{
  "title": "Paper_489",
  "abstract": "pmc eBioMedicine EBioMedicine 2749 ebiom eBioMedicine 2352-3964 Elsevier PMC12478272 PMC12478272.1 12478272 12478272 40966854 10.1016/j.ebiom.2025.105939 S2352-3964(25)00383-4 105939 1 Articles Identification of potential therapeutic targets for problematic alcohol use using multi-omics data Lee Dong June a g Song Minku b g Lim Soohyun b Park Sanghyeon b Kim Hyejin b Ahn Yeeun b Choi Faith c Myung Woojae wmyung@snu.ac.kr d e ∗ h Won Hong-Hee wonhh@skku.edu b f ∗∗ h a b c d e f ∗ wmyung@snu.ac.kr ∗∗ wonhh@skku.edu g These authors contributed equally to this work. h These authors jointly supervised this work. 10 2025 17 9 2025 120 497285 105939 8 4 2025 29 8 2025 4 9 2025 17 09 2025 30 09 2025 30 09 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary Background Problematic alcohol use (PAU) is a serious global health issue with limited treatment options. Although genetic studies have identified genomic regions associated with PAU, the specific causal genes and proteins remain unclear. This study aimed to identify these causal genes by integrating diverse genetic and molecular data to inform better treatment strategies. Methods We used Mendelian randomisation (MR) to identify genes and proteins that may cause PAU by combining genetic data with gene activity in brain and blood tissues. Multiple statistical tests confirmed shared genetic signals between expression and PAU. We also examined their effects on other traits and potential interactions with existing drugs. Findings We identified 97 genes and 13 proteins that are likely to play a causal role in PAU through MR, with strong enrichment in brain tissues. These associations remained significant after Bonferroni correction and were further supported by colocalisation analyses (posterior probability of hypothesis 4 > 0.75) and consistency across multiple datasets. Some targets also showed concordant effects with PAU on other health outcomes, supported by Bonferroni-significant associations in phenome-wide analyses, suggesting potential for drug repurposing. Interpretation This study highlights molecular signatures in both brain and blood tissues that may contribute to the development of PAU. Integrative multi-omics analyses revealed shared biological pathways across neural and peripheral systems, suggesting the potential for developing multi-systemic interventions with favourable safety profiles. Funding This study was supported by Samsung Research Fund 10.13039/501100002647 Sungkyunkwan University Keywords Problematic alcohol use Multi-omics Expression quantitative trait loci Protein quantitative trait loci Mendelian randomisation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Research in context Evidence before this study Previous genome-wide association studies (GWASs) have identified multiple genetic loci associated with problematic alcohol use (PAU). However, these studies have several limitations, including small sample sizes, a predominant focus on brain tissue, and a lack of multi-omics integration. Moreover, while GWASs can identify risk loci, they do not provide information on causal genes or proteins within those loci. Mendelian randomisation (MR) is a method that can help reveal cause-and-effect relationships between genes and disease, but previous MR studies rarely used data from multiple tissues or molecular layers. Consequently, the number of effective drug targets for PAU remains small, with only three approved medications that show inconsistent efficacy among patients. Added value of this study Our study presents a comprehensive, multi-layered genetic approach (multi-omics MR) to investigate PAU by integrating gene expression and protein data from both brain and blood tissues. By applying multiple MR methods, we identified genes and proteins that may directly influence PAU, confirming these findings across independent datasets. Among the strongest targets, genes such as AMT CCDC88B YPEL3 GPX1 PPP6C Implications of all the available evidence The integration of multi-omics data with MR provides a robust framework for identifying and validating causal targets for complex disorders such as PAU. Our findings suggest that genetic mechanisms relevant to PAU can be detected in multiple tissues, including the brain and blood, highlighting the utility of a multi-tissue approach in identifying pathways that may be centrally mediated and peripherally expressed in disease pathophysiology. The identification of genes and proteins with consistent evidence across omics layers and tissues, such as AMT CCDC88B GPX1 1 Introduction Excessive alcohol consumption is a major contributor to morbidity and mortality globally. Alcohol use results in three million deaths annually, accounting for 5.3% of all global deaths. 2 3 4 , 5 6 Supplementary Notes Supplementary Text 7 Advances in genomic research offer promising opportunities for addressing these unmet needs. Genome-wide association studies (GWASs) have identified numerous genetic regions linked to alcohol use. 8 , 9 10 8 , 9 8 , 9 , 11 8 , 9 Mendelian randomisation (MR) uses genetic data to assess whether a biological factor, such as a gene or protein, might play a causal role in a health outcome. This approach is increasingly used to identify causal and druggable targets, highlighting its value in evaluating therapeutic potential and enabling drug repurposing. 12 , 13 13 , 14 In this study, we combined MR with multiple types of biological data, including gene expression measured through transcriptome-wide Mendelian randomisation (TWMR) and protein levels assessed using proteome-wide Mendelian randomisation (PWMR), to identify potential drug targets for PAU. We also applied a statistical approach called colocalisation to determine whether the same genetic signals influence both PAU and gene or protein levels, which helps to strengthen causal interpretations. We prioritised targets that showed consistent evidence across independent datasets and then tested whether these targets were linked to other health conditions using phenome-wide Mendelian randomisation (PheWMR). This helped us understand the broader effects of each target, including their potential relevance to alcohol-related outcomes. This multifaceted validation approach enabled the identification of therapeutic targets detectable across tissues, indicating potential involvement in both the central nervous system (CNS) and peripheral biological processes related to PAU. Methods Ethics All data analysed in this study are summary-level and publicly available, with no access to individual-level information. Ethical approvals and informed consent were obtained in the original GWASs, which are cited for each dataset. Ethical approval for this study was obtained from the Institutional Review Board of Seoul National University Bundang Hospital (IRB No. B-2407-912-109). Multi-omics data utilised in Mendelian randomisation All multi-omics data utilised in the MR analysis ( Supplementary Table S1 15 , 16 We utilised GWAS summary statistics for PAU from the largest genetic study to date, which included a multi-ancestry cohort. Although the primary analysis focused on individuals of European (EUR) ancestry (N = 903,147), we also conducted complementary analyses in East Asian (EAS) (N = 13,551), African (AFR) (N = 122,571), and South Asian (SAS) (N = 1716) populations. 8 r g 8 , 9 8 8 To identify the causal gene expression pattern for PAU in brain tissue, we utilised three transcriptomic datasets. First, data from the PsychENCODE consortium provide detailed expression quantitative trait loci (eQTL) summary statistics from the prefrontal cortex (N = 1387), with adjustments for 50 probabilistic estimation of expression residuals (PEER) factors. 17 18 19 20 For brain proteomic analysis, we utilised a protein quantitative trait loci (pQTL) dataset encompassing six brain regions, as detailed by Wingo et al. 21 22 23 Tissue-specific enrichment analysis To evaluate the tissue-specific enrichment of PAU, we employed the linkage disequilibrium score regression applied to specifically expressed genes (LDSC–SEG) method to assess heritability enrichment within genes that exhibited significant tissue-specific expression. 24 24 We used precomputed annotation files (LD scores) and tissue type categories provided by Finucane et al. 24 25 26 , 27 Mendelian randomisation All MR analyses were conducted using a two-sample MR framework, which estimated the associations of genetic instruments with exposure and outcome from independent (non-overlapping) samples. This approach leverages the largest available GWAS datasets for both exposure and outcome, thereby enhancing the statistical power. 28 Transcriptome-wide Mendelian randomisation We employed the summary data–based Mendelian randomisation (SMR) software tool (version 1.3.1) 29 29 29 For exposure, we utilised eQTL datasets from brain and blood tissues and PAU GWAS data for the outcome. SMR selects the top associated variant as a genetic instrument among those that meet the following two criteria: 1) a genome-wide significant association ( P −8 P −3 r 2 Bonferroni correction was applied to account for multiple comparisons based on the number of gene expression levels tested in the MR for each exposure dataset. For the HEIDI test, a significance threshold of P P Proteome-wide Mendelian randomisation We conducted PWMR analyses using the “TwoSampleMR” R package (version 0.5.7). 30 31 2 P −8 21 22 23 Various MR methods were applied depending on the number of IVs available for each exposure. 13 , 32 Q 33 34 35 P 36 P 34 Bayesian colocalization analysis We conducted Bayesian colocalization analysis using the “coloc.abf” function from the “coloc” R package (version 5.2.2). 37 37 −4 −5 Bayesian colocalization analysis calculates posterior probabilities for five hypotheses 37 We established a posterior probability threshold of 0.75 for hypothesis 4 (PP.H4 > 0.75) as the criterion for strong evidence of colocalization. This threshold indicates that gene or protein expression levels and PAU likely share a common causal variant, 37 Phenome-wide Mendelian randomisation To assess whether the effects of the prioritised potential causal targets on other traits were directionally concordant or discordant with their effects on PAU, we conducted PheWMR analyses using gene and protein expression as exposure variables. We utilised meta-analysed GWAS results from FinnGen (N ≤ 412,181) and European samples from Pan-UKBB (N ≤ 408,961) as outcome data. 38 The prioritised potential causal targets were defined through a rigorous three-step procedure as follows: (1) identifying significant associations in MR analyses using TWMR or PWMR data from brain and blood tissues; (2) passing sensitivity analyses, including the HEIDI test for TWMR, or heterogeneity and pleiotropy tests for PWMR; and (3) demonstrating strong evidence of colocalisation with PAU via Bayesian colocalisation (PP.H4 > 0.75). Targets with consistent evidence across multiple independent datasets were retained for downstream analysis. In the PheWMR analyses, we employed the Wald ratio method using previously identified target genes or protein IVs (i.e., eQTLs and pQTLs). MR causal effects were considered statistically significant at P −6 P −5 Cross-ancestry causal gene and protein mapping for PAU via multi-omics integration To explore ancestry-specific genetic effects on PAU, we conducted TWMR using the SMR method, 29 39 40 37 8 MAGMA gene-set analysis was performed to identify gene-level associations using GWAS summary statistics from each ancestry group. SNP-wise gene analysis was carried out with ancestry-specific LD reference panels from the 1000 Genomes Project Phase 3 data, and gene-level significance was assessed using false discovery rate (FDR) correction. For TWMR analyses, the EAS GWAS was paired with frontal cortex eQTL data from the Chinese Human Brain Bank, whereas the AFR GWAS was analysed using frontal cortex eQTL data from PsychENCODE derived from African American samples. 41 For colocalisation analysis, we used lead SNPs derived from EAS, AFR, and SAS GWAS using the FUMA platform, 42 37 TWAS analyses were also conducted for EAS, AFR, and SAS populations using the FUSION software 39 Supplementary Notes Supplementary Results Drug–gene interactions The drug-gene interactions of potential causal targets were examined using Drug-Gene Interaction Database (DGIdb), 43 The DGIdb interaction score is a static metric that ranks drug–gene interactions based on evidence strength, combining factors such as the number of known drugs and gene partners, their relative connectivity, and supporting publications. 43 Role of funders The funders did not play a role in the study design, data collection, data analysis, data interpretation, or writing of the report. The corresponding authors had full access to all the data in the study and had final responsibility for the decision to submit for publication. Results Study design for identifying causal genes and proteins for PAU To identify genes and proteins that may play a causal role in PAU, we used a step-by-step strategy that combined genetic data with information on gene and protein expression ( Fig. 1 Fig. 2 Fig. 1 Study flowchart. ( a b Fig. 2 Tissue-specific enrichment analysis results for PAU. Each dot represents gene expression data from a tissue sourced from either the GTEx or Franke lab. The red dashed line indicates the significance threshold of false discovery rate (FDR) < 0.05 at −log 10 P P 10 P P - Supplementary Table S2 Tissue-specific enrichment analysis of PAU We investigated tissue-specific enrichment of genetic signals associated with PAU using LDSC–SEG 24 25 26 , 27 Fig. 2 Supplementary Table S2 P −5 P −4 P −4 P 44 Transcriptome-wide Mendelian randomisation in brain and blood tissues To identify genes whose expression may causally influence PAU, we conducted TWMR using the SMR method 29 29 In brain tissue, TWMR was performed across three eQTL datasets: PsychENCODE, 17 18 19 Table 1 P MR −6 Fig. 3 Supplementary Table S3 P MR −6 Fig. 3 Supplementary Table S4 Supplementary Table S1 Fig. 3 Supplementary Table S5 P HEIDI Table 1 Supplementary Tables S3–S5 Table 1 Summary of MR, sensitivity, and Bayesian colocalisation analyses results for brain and blood tissues. Tissue Brain Blood Type Transcriptome Proteome Transcriptome Proteome Dataset PsychENCODE BrainMeta GTEx Wingo et al. eQTLGen ARIC Icelandic Number of Tests in MR Analysis 10,197 16,224 1256–5115 (8282) 2120 15,673 1605 1961 Bonferroni Significance in MR 28 42 8–29 (41) 12 60 9 8 Passed Sensitivity Analyses 25 32 7–24 (38) 12 32 9 8 Colocalisation Evidence 10 15 0–8 (11) 4 16 4 3 Potential Causal Targets AMT CCDC88B CSDC2 KANSL1-AS1 NTN5 PPP2R3C PPP4C PPP6C SLC4A8 TBX6 AMT BRD3OS CCDC88B EVI2A FAM180B GPX1 LINC01068 MTCH2 NF1 NTN5 POLR3H PPP2R3C PPP6C SLC39A13 YPEL3 AMT CCDC88B FUT2 GPX1 LINC01068 MAMSTR MTCH2 NTN5 P4HTM SLC39A13 YPEL3 CTNND1, LEMD2, SLC4A8, TMEM120B AMT C3orf62 CCDC88B CLP1 LINC02210 LRRC37A4P MAPK8IP1P1 MAPK8IP1P2 RABGAP1L TCTA TMX2 TOB2 YPEL3 ZDHHC5 ADH1B, DOK2, GCKR, SERPINA1 ADH1B, ETFA, GCKR “Number of Tests in MR Analysis” represents the number of genes/proteins in each dataset with genetic instruments meeting the instrumental variable selection criteria for MR analysis (see Methods). “Bonferroni Significance in MR” refers to the number of genes/proteins that passed Bonferroni-corrected thresholds in the MR analysis. “Passed Sensitivity Analyses” indicates the subset of Bonferroni-significant genes/proteins that also passed sensitivity analyses. “Colocalisation Evidence” refers to the number of genes/proteins from sensitivity-passed entries that showed evidence of colocalisation. Genes/proteins that passed all these analyses were considered as potential causal targets. Transcriptome-wide MR was performed on genes from PsychENCODE, BrainMeta, GTEx, and eQTLGen datasets using the summary-data-based MR method with heterogeneity in dependent instruments (HEIDI) tests for sensitivity. Proteome-wide MR was performed on proteins from Wingo et al., ARIC, and Icelandic datasets using the TwoSampleMR method with Cochran’s Q Supplementary Table S1 MR, Mendelian randomisation. Fig. 3 Transcriptome-wide and proteome-wide MR results in brain and blood tissues. Each dot represents a gene or protein tested for MR and is plotted on a −log 10 P MR y Tables 2 3 a P Supplementary Tables S1, S3, S5, S7 and S10 b Supplementary Tables S1, S6, S8, S9,and S11 In blood tissue, analysis using the eQTLGen dataset 20 P MR −6 Fig. 3 Table 1 P HEIDI Supplementary Table S6 Proteome-wide Mendelian randomisation in brain and blood tissues PWMR analyses were performed using the TwoSampleMR method 30 33 34 13 , 32 In brain tissue, PWMR analyses using the pQTL dataset from Wingo et al. 21 P MR −5 Fig. 3 Table 1 Supplementary Table S7 Table 1 22 P MR −5 Fig. 3 Supplementary Table S8 23 P MR −5 Fig. 3 Supplementary Table S9 Identifying potential causal targets through Bayesian colocalization analysis To refine causal inference and determine whether the same genetic variants influence both gene/protein expression and PAU, we conducted Bayesian colocalization analyses 37 In brain tissue, 23 genes ( AMT BRD3OS CCDC88B CSDC2 EVI2A FAM180B FUT2, GPX1 KANSL1-AS1 LINC01068 MAMSTR MTCH2 NF1 NTN5 P4HTM POLR3H PPP2R3C PPP4C PPP6C SLC39A13 SLC4A8 TBX6 YPEL3 Fig. 3 Table 1 Supplementary Tables S10 and S12 Table 2 SLC4A8 CCDC88B KANSL1-AS1 NF1 NTN5 Supplementary Table S10 Table 2 Prioritised potential causal targets in brain tissue with multiple lines of genetic evidence. Targets PsychENCODE dataset BrainMeta dataset GTEx dataset Wingo et al. dataset DGIdb (interaction score > 0.5) FinnGen and Pan-UKBB TWMR β [95% CI] Colocalisation (PP.H4) TWMR β [95% CI] Colocalisation (PP.H4) TWMR β [95% CI] Colocalisation (PP.H4) PWMR β [95% CI] Colocalisation (PP.H4) Reproducible evidence in PheWMR AMT −0.096 [−0.128, −0.065] 0.93 −0.022 [−0.029, −0.015] 0.92 −0.021 [−0.028, −0.014] 0.91 NA NA AUD (Swedish definition) NTN5 0.101 [0.064, 0.138] 1.00 0.028 [0.018, 0.038] 0.85 0.032 [0.019, 0.045] 0.97 NA NA AUD (Swedish definition) CCDC88B 0.039 [0.022, 0.055] 0.91 0.012 [0.007, 0.016] 0.81 0.010 [0.006, 0.014] 0.81 NA NA GPX1 NS NA 0.0256 [0.018, 0.037] 0.90 0.045 [0.028, 0.062] 0.90 NS NA GP-120 antigen AUD (Swedish definition) YPEL3 NS NA −0.033 [−0.045, −0.021] 0.97 −0.026 [−0.036, −0.016] 0.95 NA NA AUD (Swedish definition) SLC39A13 NA NA −0.055 [−0.075, −0.035] 0.78 −0.065 [−0.036, −0.016] 0.78 NA NA PPP6C 0.079 [0.046, 0.112] 0.80 0.020 [0.012, 0.028] 0.77 NS NA NA NA MTCH2 NS NA −0.063 [−0.085, −0.041] 0.94 −0.055 [−0.076, −0.034] 0.93 NA NA PPP2R3C 0.033 [0.020, 0.047] 0.98 0.014 [0.003, 0.019] 0.98 NS NA NA NA LINC01068 NS NA −0.014 [−0.019, −0.008] 0.94 −0.015 [−0.021, −0.008] 0.90 NA NA SLC4A8 0.159 [0.101, 0.217] 0.97 NS NA NS NA 0.081 [0.053, 0.110] 0.93 Denatured ethanol Eleven genes in brain tissue were prioritised based on multiple lines of genetic evidence across datasets. For these targets, MR effect sizes (β) and their corresponding 95% CIs are reported if they surpassed Bonferroni-corrected significance thresholds. “NS” indicates that the target did not meet Bonferroni significance or failed sensitivity analyses, and thus, was not subjected to colocalisation analysis. “NA” indicates that the analysis was not conducted because the genetic instruments did not meet the instrumental variable selection criteria for TWMR or PWMR, or because colocalisation was not performed. For the GTEx dataset, the results were consolidated across 13 brain region datasets ( Supplementary Table S1 P Supplementary Table S10 P MR −6 MR, Mendelian randomisation; TWMR, transcriptome-wide MR; PWMR, proteome-wide MR; PheWMR, phenome-wide MR; β, effect size; CI, confidence interval; PP.H4, posterior probability of hypothesis 4; DGIdb, Drug–gene Interaction Database; GWAS, genome-wide association study; AUD, alcohol use disorder; NS, not significant; NA, not available. In the blood tissue, 16 genes ( AMT C3orf62 CCDC88B CLP1 LINC02210 LRRC37A4P MAPK8IP1P1 MAPK8IP1P2 RABGAP1L TCTA TMX2 TOB2 YPEL3 ZDHHC5 Fig. 3 Table 1 Supplementary Tables S11 and S12 Table 3 AMT CCDC88B YPEL3 Table 1 LINC02210 LRRC37A4P CCDC88B MAPK8IP1P2 Supplementary Table S11 Supplementary Table S12 Supplementary Notes Table 3 Prioritised potential causal targets in blood tissue with multiple lines of genetic evidence. Targets eQTLGen dataset ARIC dataset Icelandic dataset DGIdb (interaction score > 0.5) FinnGen and Pan-UKBB TWMR β [95% CI] Colocalisation (PP.H4) PWMR β [95% CI] Colocalisation (PP.H4) PWMR β [95% CI] Colocalisation (PP.H4) Reproducible evidence in PheWMR ADH1B NA NA 0.640 [0.601, 0.678] 1.00 0.432 [0.406, 0.458] 1.00 Fomepizole, Nitrefazole, Acetaldehyde AUD (Swedish definition), Alcoholic liver disease, Toxic effect of alcohol GCKR NA NA 0.110 [0.089, 0.130] 1.00 0.045 [0.406, 0.458] 1.00 Fenofibrate, Denatured ethanol AUD (Swedish definition) Two proteins in blood tissue were prioritised based on multiple lines of genetic evidence across datasets. For these targets, MR effect sizes (β) and their corresponding 95% CIs are reported if they surpassed Bonferroni-corrected significance thresholds. “NA” indicated that the analysis was not conducted because the genetic instruments did not meet the instrumental variable selection criteria for TWMR, or because colocalisation was not performed. Under DGIdb, drugs with an interaction score >0.5 for the respective target are reported. The interaction score was calculated using the DGIdb with evidence aggregated from multiple sources. For PheWMR, meta-GWAS data from FinnGen and Pan-UKBB included 589 traits, with only alcohol-related traits (three in total; AUD (Swedish definition), alcoholic liver disease, toxic effect of alcohol) surpassing Bonferroni-corrected significance thresholds ( P MR −5 MR, Mendelian randomisation; TWMR, transcriptome-wide MR; PWMR, proteome-wide MR; PheWMR, phenome-wide MR; β, effect size; CI, confidence interval; PP.H4, posterior probability of hypothesis 4; DGIdb, Drug–gene Interaction Database; GWAS, genome-wide association study; AUD, alcohol use disorder; NA, not available. Population-specific genetic analyses identify ancestry-relevant signals Ancestry-specific analyses identified modest but notable associations, reflecting limitations in eQTL resources and smaller sample sizes. In EAS, ANKRD13A PLEKHA2 ADH1B Supplementary Results Supplementary Notes Supplementary Table S16 Drug–gene interactions of potential causal targets We examined the drug–gene interactions of the potential causal targets using the DGIdb, 43 Supplementary Methods Supplementary Table S13 ADH1B 45 GCKR 46 RABGAP1L SLC4A8 TMX2 FUT2 P4HTM SERPINA1 Phenome-wide Mendelian randomisation and associations in independent alcohol-related outcomes To evaluate the broader health implications of the 13 prioritised targets identified through significant MR results, robustness in sensitivity analyses (HEIDI for TWMR; heterogeneity and pleiotropy tests for PWMR), and strong colocalisation with PAU (PP.H4 > 0.75). We performed PheWMR analyses using data from meta-analysed GWAS results from FinnGen and Pan-UKBB across 589 phenotypes. The effects were categorised as concordant when the direction of effect on a given trait was aligned with their effect on PAU and as discordant when the directions were in the opposite direction. This classification was based solely on the alignment of effect directions, regardless of whether the effect on PAU indicated increased or decreased risk. The 13 prioritised targets comprised 11 brain tissue genes ( AMT NTN5 CCDC88B GPX1 YPEL3 SLC39A13 PPP6C MTCH2 PPP2R3C LINC01068 SLC4A8 Table 2 In brain tissue, a total of 149 significant associations were identified ( P MR −6 Fig. 4 Supplementary Figs. S1–S10 Supplementary Table S14 AMT PPP6C GPX1 NTN5 CCDC88B NTN5 CCDC88B YPEL3 SLC39A13 AMT GPX1 NTN5 YPEL3 CCDC88B PPP6C SLC39A13 SLC4A8 Table 2 Fig. 4 Phenome-wide MR results of prioritised potential causal targets of PAU. Each triangle represents a phenotypic outcome tested across 589 traits using meta-analysed GWAS results from the FinnGen and Pan-UK Biobank. The direction of the triangle indicates the sign of the causal effect estimate (β): upward-pointing triangles indicate positive effects (β > 0), whereas downward-pointing triangles indicate negative effects (β < 0). Triangles with negative β values are displayed with lighter fill and bold borders to visually distinguish them from those with positive effects. Colours denote the various categories of traits; the ‘Others’ category consolidates trait categories with ten or fewer phenotypes, including alcohol-related outcomes such as AUD, alcoholic liver disease, and toxic effects of alcohol. ( a AMT Table 2 P MR −6 Supplementary Table S14 b Table 3 P MR −5 Supplementary Table S15 In blood tissue, 49 significant associations were identified ( P MR −5 Fig. 4 Supplementary Fig. S11 Supplementary Table S15 Table 3 Discussion We comprehensively analysed PAU by integrating MR with large-scale multi-omics data, incorporating transcriptomic and proteomic datasets from brain and blood tissues. Through MR analyses combined with Bayesian colocalisation, we identified 23 genes and four proteins in brain tissue and 16 genes and five proteins in blood tissue as potential causal targets of PAU ( Fig. 3 B Table 1 A key strength of our study is the integration of molecular data from both brain and blood tissues. While previous studies have predominantly focused on brain tissue, 11 Fig. 2 Among the prioritised targets, 13 genes and proteins were selected based on robust MR results, colocalisation evidence, and consistency across datasets ( Tables 2 3 AMT NTN5 CCDC88B GPX1 YPEL3 SLC39A13 PPP6C MTCH2 PPP2R3C LINC01068 SLC4A8 AMT CCDC88B YPEL3 Table 1 SLC4A8 Our PheWMR analysis elucidated the broader implications of the prioritised targets across various traits and diseases ( Fig. 4 AMT GPX1 PPP6C LINC01068 NTN5 CCDC88B Importantly, several targets are supported by prior biological evidence. AMT AMT 47 48 49 GPX1, 50 CCDC88B 51 CCDC88B 47 52 NTN5 PPP6C 53 54 55 Two genes with strong genetic evidence but less well-characterised biological roles, YPEL3 SLC39A13 6 , 7 GCKR, as a key regulator of triglyceride metabolism, may contribute to PAU through its influence on metabolic health. Elevated alcohol consumption is associated with increased plasma triglyceride levels, 56 GCKR 57 , 58 GCKR While our genetically informed analyses identified several biologically plausible targets for PAU, translating these findings into viable treatments remains challenging. Many existing compounds that interact with our prioritised proteins are currently unsuitable for clinical use due to safety concerns, regulatory limitations, or lack of therapeutic specificity. For example, drugs linked to ADH1B and GCKR, such as fomepizole and nitrefazole, have been associated with toxicity, market withdrawal, or indications unrelated to alcohol use, thereby limiting their repurposing potential. These limitations highlight a critical gap between genetic target identification and the availability of actionable pharmacological interventions. Although ADH1B and GCKR are strongly supported by genetic and phenome-wide evidence, the risks associated with currently available drugs targeting these proteins highlight the need for the development of advanced compounds that can modulate their activity more precisely and safely. By contrast, targets such as AMT GPX1 CCDC88B Taken together, our study demonstrates the value of integrating multi-omics data with causal inference methods to identify and prioritise therapeutic targets. This systems biology approach offers a strategic framework for guiding the next generation of pharmacological interventions for alcohol-related disorders. Despite these promising findings, our study has several limitations. First, although MR supports potential causality, functional studies are required to confirm therapeutic viability. Second, the limited number of genetic instruments may have reduced statistical power, though the stringent IV selection criteria ( P −8 cis trans In summary, this study demonstrates the power of combining genetic and molecular data to elucidate the biological basis of PAU and guide therapeutic target prioritisation. Our results offer a valuable resource for developing safe and effective treatments for alcohol-related disorders by highlighting targets with strong mechanistic plausibility and favourable safety profiles. Contributors Conceptualisation, D.J.L., W.M., and H.-H.W.; Methodology, D.J.L., W.M., and H.-H.W.; Investigation, D.J.L. and M.S.; Resources, D.J.L., S.L., S.P., H.K., Y.A., and F.C.; Writing—original draft, D.J.L. and M.S.; Writing—review and editing, W.M. and H.-H.W.; Funding acquisition, W.M. and H.-H.W.; Supervision, W.M. and H.-H.W. Data access and verification: D.J.L. and M.S. had full access to all the data in the study and take responsibility for the integrity of the data and the accuracy of the analysis. Decision to submit: W.M. and H.-H.W. were responsible for the decision to submit the manuscript. All authors read and approved the final version of the manuscript. Data sharing statement The data supporting the findings of this study are publicly available as summary-level data from the following resources. GWAS summary statistics for PAU are available through the Gelernter Lab website ( https://medicine.yale.edu/lab/gelernter/stats/ https://yanglab.westlake.edu.cn/software/smr/#DataResource https://www.eqtlgen.org/cis-eqtls.html https://doi.org/10.7303/syn51150434 http://nilanjanchatterjeelab.org/pwas https://www.decode.com/summarydata/ https://public-metaresults-fg-ukbb.finngen.fi/ Declaration of interests The authors declare no competing interests. References 1 Swift R.M. Aston E.R. Pharmacotherapy for alcohol use disorder: current and emerging therapies Harv Rev Psychiatry 23 2015 122 133 25747925 10.1097/HRP.0000000000000079 PMC4790835 2 World Health Organization Global status report on alcohol and health 2018 2019 World Health Organization 3 Hasin D.S. Stinson F.S. Ogburn E. Grant B.F. Prevalence, correlates, disability, and comorbidity of DSM-IV alcohol abuse and dependence in the United States: results from the National Epidemiologic Survey on Alcohol and Related Conditions Arch Gen Psychiatry 64 2007 830 842 10.1001/archpsyc.64.7.830 17606817 4 GBD 2016 Alcohol Collaborators Alcohol use and burden for 195 countries and territories, 1990–2016: a systematic analysis for the Global Burden of Disease Study 2016 Lancet 392 2018 1015 1035 30146330 10.1016/S0140-6736(18)31310-2 PMC6148333 5 Castillo-Carniglia A. Keyes K.M. Hasin D.S. Cerdá M. Psychiatric comorbidities in alcohol use disorder Lancet Psychiatry 6 2019 1068 1080 31630984 10.1016/S2215-0366(19)30222-6 PMC7006178 6 Sanchez-Roige S. Palmer A.A. Fontanillas P. Genome-wide association study meta-analysis of the alcohol use disorders identification test (AUDIT) in two population-based cohorts Am J Psychiatry 176 2019 107 118 30336701 10.1176/appi.ajp.2018.18040369 PMC6365681 7 Litten R.Z. Ryan M.L. Falk D.E. Reilly M. Fertig J.B. Koob G.F. Heterogeneity of alcohol use disorder: understanding mechanisms to advance personalized treatment Alcohol Clin Exp Res 39 2015 579 584 10.1111/acer.12669 25833016 8 Zhou H. Kember R.L. Deak J.D. Multi-ancestry study of the genetics of problematic alcohol use in over 1 million individuals Nat Med 29 2023 3184 3192 10.1038/s41591-023-02653-5 38062264 PMC10719093 9 Zhou H. Sealock J.M. Sanchez-Roige S. Genome-wide meta-analysis of problematic alcohol use in 435,563 individuals yields insights into biology and relationships with other traits Nat Neurosci 23 2020 809 818 10.1038/s41593-020-0643-5 32451486 PMC7485556 10 Uffelmann E. Huang Q.Q. Munung N.S. Genome-wide association studies Nat Rev Methods Primers 1 2021 59 10.1038/s43586-021-00056-9 11 Rosoff D.B. Wagner J. Bell A.S. Mavromatis L.A. Jung J. Lohoff F.W. A multi-omics Mendelian randomization study identifies new therapeutic targets for alcohol use disorder and problem drinking Nat Hum Behav 9 2025 188 207 10.1038/s41562-024-02040-1 39528761 12 Holmes M.V. Richardson T.G. Ference B.A. Davies N.M. Davey Smith G. Integrating genomics with biomarkers and therapeutic targets to invigorate cardiovascular drug development Nat Rev Cardiol 18 2021 435 453 10.1038/s41569-020-00493-1 33707768 13 Kim M.S. Song M. Kim B. Prioritization of therapeutic targets for dyslipidemia using integrative multi-omics and multi-trait analysis Cell Rep Med 4 2023 101112 10.1016/j.xcrm.2023.101112 37582372 PMC10518515 14 Minikel E.V. Painter J.L. Dong C.C. Nelson M.R. Refining the impact of genetic evidence on clinical success Nature 629 2024 624 629 10.1038/s41586-024-07316-0 38632401 PMC11096124 15 Sanderson E. Glymour M.M. Holmes M.V. Mendelian randomization Nat Rev Methods Primers 2 2022 6 10.1038/s43586-021-00092-5 37325194 PMC7614635 16 Smith G.D. Ebrahim S. ‘Mendelian randomization’: can genetic epidemiology contribute to understanding environmental determinants of disease? Int J Epidemiol 32 2003 1 22 12689998 10.1093/ije/dyg070 17 Wang D. Liu S. Warrell J. Comprehensive functional genomic resource and integrative model for the human brain Science 362 2018 eaat8464 10.1126/science.aat8464 PMC6413328 30545857 18 Qi T. Wu Y. Fang H. Genetic control of RNA splicing and its distinct role in complex trait variation Nat Genet 54 2022 1355 1363 35982161 10.1038/s41588-022-01154-4 PMC9470536 19 GTEx Consortium The GTEx consortium atlas of genetic regulatory effects across human tissues Science 369 2020 1318 1330 10.1126/science.aaz1776 32913098 PMC7737656 20 Võsa U. Claringbould A. Westra H.J. Large-scale cis- and trans-eQTL analyses identify thousands of genetic loci and polygenic scores that regulate blood gene expression Nat Genet 53 2021 1300 1310 10.1038/s41588-021-00913-z 34475573 PMC8432599 21 Wingo A.P. Liu Y. Gerasimov E.S. Sex differences in brain protein expression and disease Nat Med 29 2023 2224 2232 10.1038/s41591-023-02509-y 37653343 PMC10504083 22 Zhang J. Dutta D. Köttgen A. Plasma proteome analyses in individuals of European and African ancestry identify cis-pQTLs and models for proteome-wide association studies Nat Genet 54 2022 593 602 10.1038/s41588-022-01051-w 35501419 PMC9236177 23 Eldjarn G.H. Ferkingstad E. Lund S.H. Large-scale plasma proteomics comparisons through genetics and disease associations Nature 622 2023 348 358 10.1038/s41586-023-06563-x 37794188 PMC10567571 24 Finucane H.K. Reshef Y.A. Anttila V. Heritability enrichment of specifically expressed genes identifies disease-relevant tissues and cell types Nat Genet 50 2018 621 629 10.1038/s41588-018-0081-4 29632380 PMC5896795 25 GTEx Consortium Laboratory, Data Analysis &Coordinating Center LDACC—Analysis Working Group Statistical Methods groups—Analysis Working Group Genetic effects on gene expression across human tissues Nature 550 2017 204 213 10.1038/nature24277 29022597 PMC5776756 26 Pers T.H. Karjalainen J.M. Chan Y. Biological interpretation of genome-wide association studies using predicted gene functions Nat Commun 6 2015 5890 10.1038/ncomms6890 25597830 PMC4420238 27 Fehrmann R.S.N. Karjalainen J.M. Krajewska M. Gene expression analysis identifies global gene dosage sensitivity in cancer Nat Genet 47 2015 115 125 10.1038/ng.3173 25581432 28 Burgess S. Scott R.A. Timpson N.J. Davey Smith G. Thompson S.G. EPIC- InterAct Consortium Using published data in Mendelian randomization: a blueprint for efficient identification of causal risk factors Eur J Epidemiol 30 2015 543 552 10.1007/s10654-015-0011-z 25773750 PMC4516908 29 Zhu Z. Zhang F. Hu H. Integration of summary data from GWAS and eQTL studies predicts complex trait gene targets Nat Genet 48 2016 481 487 10.1038/ng.3538 27019110 30 Hemani G. Zheng J. Elsworth B. The MR-Base platform supports systematic causal inference across the human phenome Elife 7 2018 e34408 10.7554/eLife.34408 PMC5976434 29846171 31 Chang C.C. Chow C.C. Tellier L.C. Vattikuti S. Purcell S.M. Lee J.J. Second-generation PLINK: rising to the challenge of larger and richer datasets Gigascience 4 2015 7 10.1186/s13742-015-0047-8 25722852 PMC4342193 32 Kim M.S. Song M. Kim S. Causal effect of adiposity on the risk of 19 gastrointestinal diseases: a Mendelian randomization study Obesity (Silver Spring) 31 2023 1436 1444 10.1002/oby.23722 37014069 PMC10192008 33 Burgess S. Butterworth A. Thompson S.G. Mendelian randomization analysis with multiple genetic variants using summarized data Genet Epidemiol 37 2013 658 665 10.1002/gepi.21758 24114802 PMC4377079 34 Bowden J. Davey Smith G. Burgess S. Mendelian randomization with invalid instruments: effect estimation and bias detection through egger regression Int J Epidemiol 44 2015 512 525 26050253 10.1093/ije/dyv080 PMC4469799 35 Hartwig F.P. Davey Smith G. Bowden J. Robust inference in summary data Mendelian randomization via the zero modal pleiotropy assumption Int J Epidemiol 46 2017 1985 1998 29040600 10.1093/ije/dyx102 PMC5837715 36 Bowden J. Davey Smith G. Haycock P.C. Burgess S. Consistent estimation in Mendelian randomization with some invalid instruments using a weighted median estimator Genet Epidemiol 40 2016 304 314 10.1002/gepi.21965 27061298 PMC4849733 37 Giambartolomei C. Vukcevic D. Schadt E.E. Bayesian test for colocalisation between pairs of genetic association studies using summary statistics PLoS Genet 10 2014 e1004383 10.1371/journal.pgen.1004383 PMC4022491 24830394 38 Kurki M.I. Karjalainen J. Palta P. FinnGen provides genetic insights from a well-phenotyped isolated population Nature 613 2023 508 518 10.1038/s41586-022-05473-8 36653562 PMC9849126 39 Gusev A. Ko A. Shi H. Integrative approaches for large-scale transcriptome-wide association studies Nat Genet 48 2016 245 252 26854917 10.1038/ng.3506 PMC4767558 40 de Leeuw C.A. Mooij J.M. Heskes T. Posthuma D. MAGMA: generalized gene-set analysis of GWAS data PLoS Comput Biol 11 2015 e1004219 10.1371/journal.pcbi.1004219 25885710 PMC4401657 41 Chen Y. Liu S. Ren Z. Cross-ancestry analysis of brain QTLs enhances interpretation of schizophrenia genome-wide association studies Am J Hum Genet 111 2024 2444 2457 39362218 10.1016/j.ajhg.2024.09.001 PMC11568756 42 Watanabe K. Taskesen E. Van Bochoven A. Posthuma D. Functional mapping and annotation of genetic associations with FUMA Nat Commun 8 2017 1826 29184056 10.1038/s41467-017-01261-5 PMC5705698 43 Cannon M. Stevenson J. Stahl K. DGIdb 5.0: rebuilding the drug-gene interaction database for precision medicine and drug discovery platforms Nucleic Acids Res 52 2024 D1227 D1235 10.1093/nar/gkad1040 37953380 PMC10767982 44 Egervari G. Siciliano C.A. Whiteley E.L. Ron D. Alcohol and the brain: from genes to circuits Trends Neurosci 44 2021 1004 1015 34702580 10.1016/j.tins.2021.09.006 PMC8616825 45 Edenberg H.J. The genetics of alcohol metabolism: role of alcohol dehydrogenase and aldehyde dehydrogenase variants Alcohol Res Health 30 2007 5 13 17718394 PMC3860432 46 Iynedjian P.B. Molecular physiology of mammalian glucokinase Cell Mol Life Sci 66 2009 27 42 10.1007/s00018-008-8322-9 18726182 PMC2780631 47 Molander A. Lido H.H. Lof E. Ericson M. Soderpalm B. The GLYCINE reuptake inhibitor org 25935 decreases ethanol intake and preference in male wistar rats Alcohol Alcohol 42 2006 11 18 10.1093/alcalc/agl085 17098748 48 Radha Rama Devi A. Lingappa L. Naushad S.M. Identification of two novel mutations in aminomethyltransferase gene in cases of glycine encephalopathy J Pediatr Genet 7 2018 97 102 10.1055/s-0038-1667036 30105116 PMC6087477 49 Molander A. Lidö H.H. Löf E. Ericson M. Söderpalm B. The glycine reuptake inhibitor Org 25935 decreases ethanol intake and preference in male wistar rats Alcohol Alcohol 42 2007 11 18 17098748 10.1093/alcalc/agl085 50 Wu D. Cederbaum A.I. Alcohol, oxidative stress, and free radical damage Alcohol Res Health 27 2003 277 284 15540798 PMC6668865 51 Toikumo S. Xu H. Gelernter J. Kember R.L. Kranzler H.R. Integrating human brain proteomic data with genome-wide association study findings identifies novel brain proteins in substance use traits Neuropsychopharmacology 47 2022 2292 2299 10.1038/s41386-022-01406-1 35941285 PMC9630289 52 Leggio L. Ray L.A. Kenna G.A. Swift R.M. Blood glucose level, alcohol heavy drinking, and alcohol craving during treatment for alcohol dependence: results from the combined pharmacotherapies and behavioral interventions for alcohol dependence (COMBINE) study Alcohol Clin Exp Res 33 2009 1539 1544 10.1111/j.1530-0277.2009.00982.x 19485973 PMC2955866 53 Cheng Y. Dao C. Zhou H. Multi-trait genome-wide association analyses leveraging alcohol use disorder findings identify novel loci for smoking behaviors in the million veteran program Transl Psychiatry 13 2023 148 10.1038/s41398-023-02409-2 37147289 PMC10162964 54 Kember R.L. Vickers-Smith R. Xu H. Cross-ancestry meta-analysis of opioid use disorder uncovers novel loci with predominant effects in brain regions associated with addiction Nat Neurosci 25 2022 1279 1287 36171425 10.1038/s41593-022-01160-z PMC9682545 55 Gerring Z.F. Thorp J.G. Treur J.L. Verweij K.J. Derks E.M. The genetic landscape of substance use disorders Mol Psychiatry 1–12 2024 10.1038/s41380-024-02547-z PMC11541208 38811691 56 Klop B. do Rego A.T. Cabezas M.C. Alcohol and plasma triglycerides Curr Opin Lipidol 24 2013 321 326 10.1097/mol.0b013e3283606845 23511381 57 Noordam R. Bos M.M. Wang H. Multi-ancestry sleep-by-SNP interaction analysis in 126,926 individuals reveals lipid loci stratified by sleep duration Nat Commun 10 2019 5121 10.1038/s41467-019-12958-0 31719535 PMC6851116 58 Huang L.O. Rauch A. Mazzaferro E. Genome-wide discovery of genetic loci that uncouple excess adiposity from its comorbidities Nat Metab 3 2021 228 243 10.1038/s42255-021-00346-2 33619380 Appendix A Supplementary data  Supplementary Tables S1–S15 Supplementary Figs. S1–S11 Supplementary Note STROBE-MR checklist Acknowledgements This study was supported by Samsung Research Fund 10.13039/501100002647 Sungkyunkwan University Appendix A Supplementary data related to this article can be found at https://doi.org/10.1016/j.ebiom.2025.105939 ",
  "metadata": {
    "Title of this paper": "Genome-wide discovery of genetic loci that uncouple excess adiposity from its comorbidities",
    "Journal it was published in:": "eBioMedicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478272/"
  }
}