{
  "title": "Paper_884",
  "abstract": "pmc JOR Spine JOR Spine 3683 jorspine JSP2 JOR Spine 2572-1143 Wiley PMC12488225 PMC12488225.1 12488225 12488225 41041619 10.1002/jsp2.70119 JSP270119 JSP2-25-0091.R1 1 Research Article Research Article Automated Computational Pathology to Assess Degenerative Disc Histology Bell Richard D. https://orcid.org/0000-0003-1562-3879  1  2 bellr@hss.edu Reddick Evie C. https://orcid.org/0000-0002-0483-2977  3  4 Lillyman David J.  3 Lee Fei San  3 Wachs Rebecca A. https://orcid.org/0000-0001-5735-6284  3  4 rebecca.wachs@asu.edu   1 Arthritis and Tissue Degeneration Program, Department of Research Hospital for Special Surgery New York New York USA   2 Department of Medicine Weill Cornell Medical College New York New York USA   3 Department of Biological Systems Engineering University of Nebraska‐Lincoln Lincoln Nebraska USA   4 School of Biological and Health Systems Engineering, Arizona State University Tempe Arizona USA * Correspondence: bellr@hss.edu rebecca.wachs@asu.edu 01 10 2025 12 2025 8 4 498123 10.1002/jsp2.v8.4 e70119 04 8 2025 11 3 2025 15 9 2025 01 10 2025 02 10 2025 03 10 2025 © 2025 The Author(s). JOR Spine https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Background Preclinical models of disc degeneration are important tools to discover disease pathology. Histopathology is often used to understand these changes, but analyses remain reliant on pathologists or graders using time‐consuming scoring systems. The integration of computational pathology can improve this process by leveraging machine learning (ML) algorithms. Thus, this work aimed to develop a segmentation model to identify seven distinct disc tissues and utilize the segmented tissue areas generated from the model, along with other derived measures, to estimate pathological changes that align with traditional histological scoring. Methods Hematoxylin and eosin‐stained motion segment sections were collected from four independent studies. Each study included a disc injury puncture in Sprague Dawley rats. An active learning technique and a trained deep convolutional neural network were used to infer tissue segmentation. The model was then applied to untrained images to infer tissue segmentation, extract geometric and cell count features, and correlate these measurements with histologic scores from a standard scoring system. Results The segmentation model was highly performant with an Intersection over Union (mIOU) and frequency weighted Intersection over Union (fwIOU) of 0.83 ± 0.04 and 0.94 ± 0.02 in the Test set, respectively. The ML‐derived measures correlated well with histologic scores, with absolute ranges from rho = 0.65 to 0.87. Further, these ML‐derived measures were altered with disc degeneration with significant differences in NP cell number, NP area ratio, NP/AF border, NP roundness, and AF perimeter. Lastly, our model could measure additional tissue changes not captured through a standard histological scoring system. Conclusions Herein, we developed the first computational pathology model to phenotype disc degeneration tissue. Our model significantly correlates with traditional histopathology scoring methods, detects subtle differences between groups by directly measuring pathologic features in the images, and increases efficiency by automating the majority of the process. We utilized human‐in‐the‐loop active learning methods (1) to develop the first computational pathology model to segment disc tissue (2). These segmentation outputs were used to derive shape and other measures to phenotype disc pathology which were correlated with histological scoring but also provides increased sensitivity to detect differences (3). Finaly, we formalized the analysis into a computational pipeline that will increase the overall efficiency of disc histopathology analysis (4). disc degeneration imaging injury pre‐clinical models National Science Foundation (NSF) CAREER 10.13039/100000001 1846857 Nebraska Tobacco Settlement Biomedical Research Development Fund 10.13039/100016436 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date December 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  R. D. Bell E. C. Reddick D. J. Lillyman F. S. Lee R. A. Wachs Automated Computational Pathology to Assess Degenerative Disc Histology JOR Spine 8 4 2025 e70119 10.1002/jsp2.70119  Funding: Richard D. Bell and Evie C. Reddick contributed equally to this study. 1 Introduction Low back pain (LBP) poses an enormous burden on the quality of life of those suffering from the disease [ 1 2 3 4 5 6 7 6 8 9 10 11 Preclinical models of disc degeneration have been established in several species, including mice [ 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 14 19 16 17 18 22 24 25 26 17 25 27 13 15 20 21 23 12 Histological scoring employs the use of grading schemes to identify visual tissue characteristics either present or absent due to disease and assigns a numeric value to them. These scoring systems are important in taking qualitative changes to the disc tissue and representing them semi‐quantitatively. Scoring systems exist for a wide range of preclinical models of disc degeneration [ 28 29 30 28 The challenges with histological scoring center around the subjectivity of scoring. For example, one method of histological scoring uses an expert pathologist to assess the subtle changes during disease progression or therapeutic intervention, which can be costly and is dependent on their training and competency. Histological scoring systems that utilize a panel of graders can reduce the burden on or need for a pathologist. However, these systems require graders to be trained in scoring, which may be needed prior to each round of scoring if graders are inexperienced or studies are infrequent. Additionally, both approaches introduce inter‐ and intra‐scorer variability [ 31 32 Computational pathology is the use of digital analysis for histopathological interpretation and is an emerging discipline that leverages the advances in machine vision and artificial intelligence over the last decade. Automated pipelines that implement computational pathology algorithms can streamline the analysis, reduce or eliminate scorer variability, and improve the granularity of the quantification [ 33 34 33 34 Thus, this work aimed to develop a segmentation model to identify seven distinct disc tissue classes and utilize the segmented tissue areas generated from the model, along with other geometric and derived measures, to estimate pathological changes that align with traditional histological scoring using histological sections previously generated from four studies of rat disc degeneration in our lab. The additional geometric and derived features included shape descriptors such as area ratios and perimeter, as well as cell counts within disc tissues that described the pathological changes seen in our model of disc degeneration. These studies and tissues were selected because they represent a common rodent injury model used in the field, and standard tissue staining was previously employed. Finally, strong correlations were identified between our machine learning (ML) derived measures and standard validated disc degeneration scores, demonstrating the potential for these new ML methods to replace previous histological scoring techniques. 2 Materials and Methods 2.1 Animals and Disease Model All animal work was performed under a protocol approved by the University of Nebraska Institutional Animal Care and Use Committee. All animal studies were developed and conducted in accordance with The ARRIVE guidelines. Animals in all four studies were female Sprague–Dawley rats purchased from Envigo and aged between 20 and 23 weeks at the time of surgery. Animals were housed in a reverse 12‐h light/dark cycle with ad libitum access to food and water. Histological data was collected data from three previously published studies [ 18 35 36 1A 1B FIGURE 1 Diagram of disc degeneration surgical procedure and descriptions of datasets. (A) Procedure utilizing mechanical injury to the L5–L6 intervertebral disc performed in Studies #1–4 to induce disc degeneration. (B) Overview of the four studies used in H&E machine learning model creation and validation. wkpi = weeks post injury. 2.2 Histology At the conclusion of each study, animals were humanely euthanized via CO 2 Standard hematoxylin and eosin (H&E) staining was conducted as previously described in Lillyman et al. [ 18 2.3 Imaging and Histology Scoring Slides were digitized into Whole Slide Images with an Axioscan 7 (Zeiss) at 5× magnification with a pixel size of 0.6901μm 2 28 2.4 Model Choice, Tissue Annotation Active Learning Procedure and Semantic Segmentation Deep Learning Model Training All visualization of the slides, predictions and ground truth (GT) annotations, as well as the manual annotation occurred in QuPath (0.3.2 or later) [ 37 x y In order to obtain histological scores, we decided that our model should be capable of segmenting seven important tissues of the disc. These tissue classes include the (1) Nucleus Pulposus (NP), (2) Annulus Fibrosis (AF), (3) Endplate, (4) Ligament, (5) Bone, (6) Growth Plate, and (7) Granulation tissue. These classes would allow for enough differentiation between disc tissue types to quantify pathologic changes. Granulation tissue was defined as highly cellularized tissue located on the ventral side of disc sections between the ventral AF and ligament. To train our model, we utilized a machine learning technique that leverages small amounts of manually annotated data and an interactive, iterative process to build well trained models called active learning. A core component to active learning is building intermediate models that produce predictions to be adjusted. There are many strategies to acquire and adjust predictions, including algorithmic methods or human interactive methods (i.e., human‐in‐the‐loop) to select and correct poor predictions [ 38 33 These selections resulted in the use of a semantic segmentation model (UNET++ [ 39 2A n n n n 39 2B 2C FIGURE 2 Active learning study design to generate a high‐performance model from minimal annotations. (A) We conducted four rounds of annotations, with the general workflow of (1) collecting or correcting annotations, (2) performing a stratified (on group) random sampling to split the data into 70% Training Set: 30% Testing Set, (3) building a model. Round 1 consisted of n n n n Several of our technical choices in the building of this model relied upon our previous work in H&E stained synovial tissue with inflammatory arthritis [ 33 40 39 41 42 33 43 −4 44 Previous work, including ours [ 33 45 2.5 Semantic Segmentation Model Evaluation and Inference on External Validation Set After training was completed, inference was performed on the Test set generating prediction annotations to calculate the intersection over union (IOU), mean IOU (mIOU), and class frequency weighted mIOU (fwIOU). These values allow for the comparison of predicted annotations to the ground truth annotations. The IOU was calculated independently for each class on each image where the intersection of the ground truth annotations and predicted annotations is in the numerator and the union of the ground truth annotations and predicted annotations is in the denominator (Equation 1 (1) IOU = Ground Truth ∩ Predictions Ground Truth ∪ Predictions The mIOU is the arithmetic mean of all classes per image and the fwIOU is the class frequency weighted mean per image. The fwIOU was included to assess model performance without the influence of infrequent classes (i.e., granulation tissue that only appears in some diseased samples, ~4% of total annotated area). Inference on the external validation set was performed using Study #3 and Study #4. Each rat in the external validation set had three sections, each 15 μm apart, stained with H&E and evaluated with the model. Briefly, this process involved using QuPath to place a region of interest around the motion segment in each section to restrict inference and generate tiles. The trained model was then used to generate tissue class predictions for each tile. Segmentation predictions were imported back into QuPath, and tissue areas along with additional features (detailed below) were exported. All tissue features were averaged across the three sections. 2.6 Tissue Shape and Other Feature Extraction The main goal after tissue segmentation was to create an automated method to approximate the classical scoring methods for disc histopathology. Therefore, previous work from Lai and colleagues was examined, wherein they created a standardized histopathology scoring system for rat disc degeneration models, and we decided on six tractable scores that could be assessed downstream of our tissue segmentation (Table 1 NP shape NP shape 2 (2) Roundness = Perimeter 2 4 * π * Area TABLE 1 Scoring system adopted from Lai et al. and machine learning equivalent outcomes. H&E scoring system adopted from Lai et al. ML derived outcomes NP shape NP roundness NP area NP area ratio (NP area/NP area + AF area + granulation area) NP cellularity NP cell count AF/NP border NP and AF prediction confusion ratio AF morphology tears/fissures/disruptions AF perimeter Endplate disruptions/microfractures and osteophyte/ossification Endplate solidity  NP area NP cellularity AF morphology tears/fissures/disruptions NP/AF border 28 Endplate Solidity The secondary goal was to develop a model that measures relevant disc tissues that could be additional biomarkers of pathology. Thus, the area of all the other segmented tissues was calculated (Endplate, Ligament, Bone, Growth Plate, and Granulation tissue) and within each of these performed the QuPath watershed cell detection method to count the number of nuclei. To calculate the AF Area Ratio 2.7 Overall Disease Metric To represent an overall disc degeneration score (i.e., sum or total H&E score), control normalized z z 3 (3) Control Normalized Z − score = ML Derived Value − mean sham SD sham Normalizing to control allows appropriate inference about the magnitude of change in the diseased groups relative to the healthy condition and allows interpretation across studies, assuming healthy samples are equivalent. While most of the disease metrics we define increase with pathology, NP area and NP cell number decrease. Thus, the control normalized z z z 2.8 Statistics Prism 10.2 (GraphPad) was used for all statistical analyses. Spearman's correlation was used for all correlations between the histology scores and ML derived outcomes as the histology scores were ordinal and the ML derived outcomes were continuous. All continuous ML derived data were assessed for normality with a Shapiro‐Wilk test. NP cell number, AF area ratio, NP shape, granulation area, and ligament cellularity were found to not be normal. Thus, a Kruskal‐Wallis test with a Dunn's Post Hoc test was used to investigate the differences between groups. All other ML data and overall scores were found to be normally distributed; thus, a One‐Way ANOVA was utilized with a Tukey's Post Hoc test to investigate the differences between groups. To account for multiple testing across all outcomes in Figures 5 6 p p 2.9 Software and Hardware QuPath (0.3.2 or later) was used to visualize images and annotate tissues as well as perform some image processing (detailed above). All other machine learning or deep learning techniques were performed in Python (3.8.1) as described above. Primary machine learning libraries include PyTorch (1.8.0) and segmentation_models_pytorch (0.1.3) [ 42 2.10 Code Availability All analysis scripts and models are provided at https://github.com/rdbell3/Disk_HistoPath 3 Results 3.1 Insights From Human‐In‐The‐Loop Active Learning To improve the efficiency of the annotation process, human‐in‐the‐loop active learning was utilized (Figure 2 2C 3.2 Disc Computational Pathology Model Demonstrates High Internal Performance Four rounds of human‐in‐the‐loop active learning resulted in the generation of 45 ground truth (GT) disc samples that were then separated into a Training ( n n 3C iii v FIGURE 3 UNET++ appropriately segments disc tissues with high performance. (A) Mean (averaged across tissues) intersection over union (mIOU) and tissue frequency weighted mean intersection over union. Each dot is one histology section from one rat ( n n i i i ii ii i iv iv iv iii iii ii v v v 3.3 Computational Pathology Derived Measures Are Correlated With Histology Scores Although tissue segmentation posed the main computational challenge in this study, additional measures were developed to better align with observed pathology. These measures included counting the cells within the NP as well as calculating NP roundness, NP area ratio, AF perimeter, NP/AF confusion ratio, and endplate solidity (as detailed in Methods). To test if our derived measures approximated the histological scoring metrics validated for rat disc histopathology, correlations were performed. Our measures significantly correlated with their histology score counterparts (Figure 4 4A 4B 4C 4D 4E p FIGURE 4 Disc computational pathology modeling recapitulates histopathology scoring measures. (A) Correlation between H&E score for NP area and ML derived NP area ratio ( ρ ρ ρ ρ ρ p 3.4 Computational Pathology Derived Measures Demonstrate Disease Phenotype and Response to Therapy Slides were collected from studies that had treatment arms and cross‐sectional timepoints to address if our model and the derived measures that specifically relate to the scoring rubric can appropriately assess disc degeneration and response to therapy (Figure 1 5A–E 5B 5F 5F 5G 5H 5I FIGURE 5 Disc computational pathology modeling measures pathologic changes to disc tissues. (A) ML derived NP cell number showed significant differences between sham and all other groups. (B) ML derived NP area ratio showed significant differences between sham and all other groups. Additionally, there was a significant difference between the 6X‐Scrape and 6X‐Scrape + Trt #3. (C) ML derived NP/AF confusion ratio showed significant differences between sham and all other groups. (D) ML derived NP roundness showed significant differences between sham and all other groups. (E) ML derived AF perimeter showed significant differences between sham and all other groups (F) ML derived endplate solidity shows no significant differences between groups. (G) ML model annotations showing the seven regions. (H) ML model annotations of the same image in (G) but with cellular annotations shown in red. (I) ML model annotation showing the seven regions. Of note are the several smaller holes in the NP region highlighted in yellow. (J) ML model annotations of the same image in (H) but with the “fill annotations” hole used in QuPath to calculate the NP roundness more accurately. Kruskal‐Wallis test (A, D) and One‐way ANOVA (B, C, E, F) Bonferroni correction applied to all outcomes in Figures 5 6 p Additional measures of pathology were collected that may be informative in dissecting disease etiology and therapeutic response. These values were not represented by histological scoring but could provide additional insights into disease morphology. The AF area ratio was significantly increased in the 6X‐Scape vs. Sham controls, while it was decreased back to Sham with Treatment #3 (Figure 6A 6B 6C 6D 6E 6F FIGURE 6 Disc computational pathology modeling detects additional metrics not observed with the standard H&E grading system. (A) ML derived AF ratio shows a significant difference between sham and 6X‐scrape as well as between 6X‐Scrape and 6X‐Scrape + Trt #3. (B) ML derived granulation area shows a significant difference between sham and all other groups. (C) ML derived AF cell number shows a significant difference between sham and all other groups as well as between 6X‐Scrape and 6X‐Scrape + Trt #3. (D) ML derived bone area shows a significant difference between sham and 6X‐Scrape as well as between sham and 6X‐Scrape + Trt #4. (E) ML derived ligament cellularity shows no difference between ligament cellularity. (F) ML derived endplate cellularity shows a significant difference between sham and all other groups as well as between 6X‐Scrape and all other groups. One‐way ANOVA (A, C, D, F) and Kruskal‐Wallis test (B, E). Bonferroni correction applied to all outcomes in Figures 5 6 p 3.5  ML To mimic standard practice in histopathology scoring, we generated an overall disc degeneration score by summing the control normalized z p z 7A z p 7B 7C–E FIGURE 7 Overall ML derived degeneration score closely aligns with overall H&E degeneration score. (A) Correlation between combined H&E scores and control normalized z ρ z ρ z p 4 Discussion Computational pathology has made significant advances in the last 10 years to address pathology‐specific tasks including disease detection, diagnostics, classification, and segmentation [ 33 46 47 48 49 50 51 52 Our model's outputs align well with established histopathology scoring features that describe important phenotypic changes in the disc and surrounding tissues during degeneration. Several studies have shown that cell apoptosis and senescence are common features of disc degeneration that lead to an altered extracellular matrix [ 53 54 55 56 57 58 59 60 61 62 63 7 64 5 S1 Our model and derived measures were able to recapitulate multiple histopathology scores. Specifically, NP area, NP shape, NP cell number, and AF tears/fissures all correlated with ML derived measures with Spearman's rho > 0.73 (0.73–0.87, absolute value range). These data were consistent with our expectation as all ML derived metrics are directly related to pathology. Interestingly, we noted that there was a considerable amount of spread in our ML derived AF perimeter metric, specifically at the higher end of the x 4D x S1 3 One of the largest benefits of computational pathology tools that directly measure pathology is the added granularity or specificity. In our previous work in inflammatory arthritis, we report a 25‐fold increase in measured effect size when using a ML model to count lymphocytes rather than scoring lymphocyte numbers [ 33 z 7 2 8 FIGURE 8 Final computational workflow to calculate ML derived disc degeneration scores. The general workflow for obtaining ML derived disc degeneration features begins with imaging histology slides and downloading the model and relevant python packages. Images are then brought into QuPath where one annotation box is drawn around the entirety of the disc region for analysis. The box annotations are then batch exported from QuPath and broken into tiles with 60% overlap. The model is run and once tiles are exported, it consists of three main steps: organizing tiles, conducting inferences for each pixel, and the majority vote for overlapping pixels. Once finished, predictions for the 7 disc tissue classes are batch imported into QuPath. In QuPath, calculations of shape features for each disc tissue class are completed and cell detection is run. Lastly, metrics are exported for analysis and final calculations are performed. The increase in pathological measurement sensitivity by computational pathology can come at a cost. It can place more responsibility on the researcher to determine if these differences are clinically meaningful. This burden was previously shouldered largely by the validated scoring metric (e.g., mild vs. moderate vs. severe disease scores are easily interpreted). Further, because of the increased sensitivity, there may be more false positives throughout the data. These false positives can appear due to a variety of factors that, in part, can be understood and controlled: (1) We and others have demonstrated the importance of including stain variation into the training dataset [ 33 34 65 66 67 3C ii iii 68 28 Additionally, there are a few other important limitations to note. We utilized histological samples from one pre‐clinical model of disc degeneration due to the availability of these samples and established H&E scores for these studies. While limiting our ability to provide broad validation of pre‐clinical disc degeneration models, this work extends our existing framework [ 33 n 28 In conclusion, histopathology is a cornerstone of preclinical science, and we have aimed to reduce a major analytical bottleneck associated with these techniques. Our model is capable of capturing many pathological features associated with disc degeneration and represents, to our knowledge, the first application of machine learning to classify disc tissue in histological samples. By moving beyond a traditional ordinal H&E scoring system, this approach provides a more quantitative and detailed assessment of tissue pathology. It offers increased granularity and detection of subtle differences that might go unnoticed with the traditional scoring system. While future work is needed to demonstrate generalizability in other preclinical models and expand detection of additional pathological features, this study marks an important step toward scalable, quantitative, and automated analysis of degenerative disc histology. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Figure S1: Acknowledgments This research was funded in part by the Nebraska Tobacco Settlement Biomedical Research Development Fund. This research was funded by the National Science Foundation (NSF) CAREER Award 1846857. We would like to acknowledge the staff at the Life Sciences Annex at the University of Nebraska–Lincoln, especially veterinarian Anna Fitzwater, who performed the animal surgeries. Additionally, we would like to acknowledge Jordan Bollinger, Henry Drvol, Anna Levorson, Alvaro Moreno Lozano, Furqan Mahdi, and Uyen Nguyen for assisting in histological quantification across these studies. References 1 L. Ge M. J. Pereira C. W. Yap B. H. Heng Chronic Low Back Pain and Its Impact on Physical Function, Mental Health, and Health‐Related Quality of Life: A Cross‐Sectional Study in Singapore Scientific Reports 12 1 2022 20040 10.1038/s41598-022-24703-7 36414674 PMC9681885 2 A. L. Dutmer H. R. Schiphorst Preuper R. Soer Personal and Societal Impact of Low Back Pain: The Groningen Spine Cohort Spine 44 24 2019 E1443 E1451 10.1097/BRS.0000000000003174 31369481 3 D. Chang A. Lui A. Matsoyan M. M. Safaee H. Aryan C. Ames Comparative Review of the Socioeconomic Burden of Lower Back Pain in the United States and Globally Neurospine 21 2 2024 487 501 10.14245/ns.2448372.186 38955526 PMC11224735 4 F. Fatoye T. Gebrye C. E. Mbada U. Useh Clinical and Economic Burden of Low Back Pain in Low‐ and Middle‐Income Countries: A Systematic Review BMJ Open 13 4 2023 e064119 10.1136/bmjopen-2022-064119 PMC10151982 37185180 5 J. M. Stevans A. Delitto S. S. Khoja Risk Factors Associated With Transition From Acute to Chronic Low Back Pain in US Patients Seeking Primary Care JAMA Network Open 4 2 2021 e2037371 10.1001/jamanetworkopen.2020.37371 33591367 PMC7887659 6 M. J. DePalma J. M. Ketchum T. Saullo What Is the Source of Chronic Low Back Pain and Does Age Play a Role? Pain Medicine 12 2 2011 224 233 10.1111/j.1526-4637.2010.01045.x 21266006 7 E. I. T. de Schepper J. Damen J. B. J. van Meurs The Association Between Lumbar Disc Degeneration and Low Back Pain Spine 35 5 2010 531 536 10.1097/BRS.0b013e3181aa5b33 20147869 8 A. C. Shaheed C. G. Maher K. A. Williams R. Day A. J. McLachlan Efficacy, Tolerability, and Dose‐Dependent Effects of Opioid Analgesics for Low Back Pain: A Systematic Review and Meta‐Analysis JAMA Internal Medicine 176 7 2016 958 968 10.1001/jamainternmed.2016.1251 27213267 9 C. Maher M. Underwood R. Buchbinder Non‐Specific Low Back Pain Lancet 389 10070 2017 736 747 10.1016/s0140-6736(16)30970-9 27745712 10 S. M. Eisenstein B. Balain S. Roberts Current Treatment Options for Intervertebral Disc Pathologies Cartilage 11 2 2020 143 151 10.1177/1947603520907665 32075408 PMC7097980 11 I. Urits A. Burshtein M. Sharma Low Back Pain, a Comprehensive Review: Pathophysiology, Diagnosis, and Treatment Current Pain and Headache Reports 23 3 2019 23 10.1007/s11916-019-0757-1 30854609 12 M. Millecamps M. Tajerian L. Naso H. E. Sage L. S. Stone Lumbar Intervertebral Disc Degeneration Associated With Axial and Radiating Low Back Pain in Ageing SPARC‐Null Mice Pain 153 6 2012 1167 1179 10.1016/j.pain.2012.01.027 22414871 13 H. Choi S. Tessier E. S. Silagi A Novel Mouse Model of Intervertebral Disc Degeneration Shows Altered Cell Fate and Matrix Homeostasis Matrix Biology 70 2018 102 122 10.1016/j.matbio.2018.03.019 29605718 PMC6081256 14 T. Oichi Y. Taniguchi K. Soma A Mouse Intervertebral Disc Degeneration Model by Surgically Induced Instability Spine 43 10 2018 E557 E564 10.1097/BRS.0000000000002427 29016437 15 T. Ohnishi H. Sudo T. Tsujimoto N. Iwasaki Age‐Related Spontaneous Lumbar Intervertebral Disc Degeneration in a Mouse Model Journal of Orthopaedic Research 36 1 2018 224 232 10.1002/jor.23634 28631843 16 G. Keorochana J. S. Johnson C. E. Taghavi The Effect of Needle Size Inducing Degeneration in the Rat Caudal Disc: Evaluation Using Radiograph, Magnetic Resonance Imaging, Histology, and Immunohistochemistry Spine Journal 10 11 2010 1014 1023 10.1016/j.spinee.2010.08.013 20970740 17 A. Lai A. Moon D. Purmessur Annular Puncture With Tumor Necrosis Factor‐Alpha Injection Enhances Painful Behavior With Disc Degeneration in Vivo Spine Journal 16 3 2016 420 431 10.1016/j.spinee.2015.11.019 PMC4913353 26610672 18 D. J. Lillyman F. S. Lee E. C. Barnett Axial Hypersensitivity Is Associated With Aberrant Nerve Sprouting in a Novel Model of Disc Degeneration in Female Sprague Dawley Rats JOR Spine 5 3 2022 e1212 10.1002/jsp2.1212 36203864 PMC9520768 19 Y.‐J. Wang Q. Shi W. W. Lu Cervical Intervertebral Disc Degeneration Induced by Unbalanced Dynamic and Static Forces: A Novel in Vivo Rat Model Spine 31 14 2006 1532 1538 10.1097/01.brs.0000222019.84095.23 16778684 20 H. E. Gruber T. Johnson H. J. Norton E. N. J. Hanley The Sand Rat Model for Disc Degeneration: Radiologic Characterization of Age‐Related Changes Cross‐Sectional and Prospective Analyses Spine 27 3 2002 230 234 10.1097/00007632-200202010-00004 11805683 21 J. Clouet M. Pot‐Vaucel G. Grimandi Characterization of the Age‐Dependent Intervertebral Disc Changes in Rabbit by Correlation Between MRI, Histology and Gene Expression BMC Musculoskeletal Disorders 12 2011 147 10.1186/1471-2474-12-147 21726455 PMC3150337 22 K. Masuda Y. Aota C. Muehleman A Novel Rabbit Model of Mild, Reproducible Disc Degeneration by an Anulus Needle Puncture: Correlation Between the Degree of Disc Injury and Radiological and Histological Appearances of Disc Degeneration Spine 30 1 2004 5 14 10.1097/01.brs.0000148152.04401.20 15626974 23 N. Bergknut J. P. Rutges H. J. Kranenburg The Dog as an Animal Model for Intervertebral Disc Degeneration? Spine 37 5 2012 351 358 10.1097/BRS.0b013e31821e5665 21544011 24 Y. Zhang S. Drapeau H. S. An D. Markova B. A. Lenart D. G. Anderson Histological Features of the Degenerating Intervertebral Disc in a Goat Disc‐Injury Model Spine 36 19 2011 1519 1527 10.1097/BRS.0b013e3181f60b39 21245789 PMC3117031 25 C. Zhang S. E. Gullbrand T. P. Schaer Inflammatory Cytokine and Catabolic Enzyme Expression in a Goat Model of Intervertebral Disc Degeneration Journal of Orthopaedic Research 38 11 2020 2521 2531 10.1002/jor.24639 32091156 PMC7483272 26 D. Sheyn S. Ben‐David W. Tawackoli Human iPSCs Can Be Differentiated Into Notochordal Cells That Reduce Intervertebral Disc Degeneration in a Porcine Model Theranostics 9 25 2019 7506 7524 10.7150/thno.34898 31695783 PMC6831475 27 R. Kang H. Li K. Rickers S. Ringgaard L. Xie C. Bunger Intervertebral Disc Degenerative Changes After Intradiscal Injection of TNF‐Alpha in a Porcine Model European Spine Journal 24 9 2015 2010 2016 10.1007/s00586-015-3926-x 25850392 28 A. Lai J. Gansau S. E. Gullbrand Development of a Standardized Histopathology Scoring System for Intervertebral Disc Degeneration in Rat Models: An Initiative of the ORS Spine Section JOR Spine 4 2 2021 e1150 10.1002/jsp2.1150 34337335 PMC8313153 29 I. P. Melgoza S. S. Chenna S. Tessier Development of a Standardized Histopathology Scoring System Using Machine Learning Algorithms for Intervertebral Disc Degeneration in the Mouse Model‐An ORS Spine Section Initiative JOR Spine 4 2 2021 e1164 10.1002/jsp2.1164 34337338 PMC8313179 30 S. E. Gullbrand B. G. Ashinsky A. Lai Development of a Standardized Histopathology Scoring System for Intervertebral Disc Degeneration and Regeneration in Rabbit Models‐An Initiative of the ORSspine Section JOR Spine 4 2 2021 e1147 10.1002/jsp2.1147 34337334 PMC8313151 31 J. G. Elmore G. M. Longton P. A. Carney Diagnostic Concordance Among Pathologists Interpreting Breast Biopsy Specimens Journal of the American Medical Association 313 11 2015 1122 1132 25781441 10.1001/jama.2015.1405 PMC4516388 32 J. G. Elmore R. L. Barnhill D. E. Elder Pathologists' Diagnosis of Invasive Melanoma and Melanocytic Proliferations: Observer Accuracy and Reproducibility Study BMJ 357 2017 j2813 28659278 10.1136/bmj.j2813 PMC5485913 33 R. D. Bell M. Brendel M. A. Konnaris Automated Multi‐Scale Computational Pathotyping (AMSCP) of Inflamed Synovial Tissue Nature Communications 15 1 2024 7503 10.1038/s41467-024-51012-6 PMC11362542 39209814 34 M. A. Konnaris M. Brendel M. A. Fontana Computational Pathology for Musculoskeletal Conditions Using Machine Learning: Advances, Trends, and Challenges Arthritis Research & Therapy 24 1 2022 1 15 35277196 10.1186/s13075-021-02716-3 PMC8915507 35 D. J. Lillyman E. C. Reddick K. E. Ney S. M. Caparaso R. A. Wachs An Extracellular Matrix Hydrogel Restores Disc Volume and Alleviates Axial Hypersensitivity in a Rat Model of Disc‐Associated Pain JOR Spine 8 2 2025 e70073 10.1002/jsp2.70073 40386495 PMC12081325 36 F. Lee S. M. Caparaso C. J. Cruz E. C. Barnett K. D. Allen R. A. Wachs Investigation of the Safety and Therapeutic Efficacy of Axonal Dieback Compounds in a Rat Model of Disc‐Associated Low Back Pain European Cells and Materials 51 2025 1 30 10.22203/eCM.v051a01 37 P. Bankhead M. B. Loughrey J. A. Fernandez QuPath: Open Source Software for Digital Pathology Image Analysis Scientific Reports 7 1 2017 16878 29203879 10.1038/s41598-017-17204-5 PMC5715110 38 E. Mosqueira‐Rey E. Hernández‐Pereira D. Alonso‐Ríos J. Bobes‐Bascarán Á. Fernández‐Leal Human‐In‐The‐Loop Machine Learning: A State of the Art Artificial Intelligence Review 56 4 2023 3005 3054 10.1007/s10462-022-10246-w 39 Z. Zhou M. M. Rahman Siddiquee N. Tajbakhsh J. Liang Unet++: A Nested u‐Net Architecture for Medical Image Segmentation Springer 2018 3 11 10.1007/978-3-030-00889-5_1 PMC7329239 32613207 40 A. Jung K. Wada J. Crall imgaug: A Library for Image Augmentation in Machine Learning Experiments 41 M. Tan Q. Le Efficientnet: Rethinking Model Scaling for Convolutional Neural Networks PMLR 2019 6105 6114 42 P. Iakubovskii “Segmentation Models Pytorch. GitHub,” https://github.com/qubvel/segmentation_models.pytorch 43 A. Paszke S. Gross F. Massa Pytorch: An Imperative Style, High‐Performance Deep Learning Library Advances in Neural Information Processing Systems 32 2019 8026 8037 44 S. A. Taghanaki Y. Zheng S. K. Zhou Combo Loss: Handling Input and Output Imbalance in Multi‐Organ Segmentation Computerized Medical Imaging and Graphics 75 2019 24 33 31129477 10.1016/j.compmedimag.2019.04.005 45 L. Chan M. S. Hosseini C. Rowsell K. N. Plataniotis S. Damaskinos Histosegnet: Semantic Segmentation of Histological Tissue Type in Whole Slide Images Proceedings of the IEEE/CVF International Conference on Computer Vision IEEE 2019 10662 10671 46 V. Venerito O. Angelini G. Cazzato A Convolutional Neural Network With Transfer Learning for Automatic Discrimination Between Low and High‐Grade Synovitis: A Pilot Study Internal and Emergency Medicine 16 6 2021 1457 1465 10.1007/s11739-020-02583-x 33387201 47 L. Yang M. C. Coleman M. R. Hines P. N. Kluz M. J. Brouillette J. E. Goetz Deep Learning for Chondrocyte Identification in Automated Histological Analysis of Articular Cartilage Iowa Orthopaedic Journal 39 2 2019 1 8 PMC7047299 32577101 48 C. Correia S. Mawe S. Lofgren High‐Throughput Quantitative Histology in Systemic Sclerosis Skin Disease Using Computer Vision Arthritis Research & Therapy 22 1 2020 48 10.1186/s13075-020-2127-0 32171325 PMC7071594 49 M. Y. Lu R. J. Chen D. Kong Federated Learning for Computational Pathology on Gigapixel Whole Slide Images Medical Image Analysis 76 2022 102298 10.1016/j.media.2021.102298 34911013 PMC9340569 50 A. Taylor‐Weiner H. Pokkalla L. Han A Machine Learning Approach Enables Quantitative Measurement of Liver Histology and Disease Monitoring in NASH Hepatology 74 1 2021 133 147 10.1002/hep.31750 33570776 PMC8361999 51 R. J. Chen T. Ding M. Y. Lu Towards a General‐Purpose Foundation Model for Computational Pathology Nature Medicine 30 3 2024 850 862 10.1038/s41591-024-02857-3 PMC11403354 38504018 52 H. Xu N. Usuyama J. Bagga A Whole‐Slide Foundation Model for Digital Pathology From Real‐World Data Nature 630 8015 2024 181 188 10.1038/s41586-024-07441-w 38778098 PMC11153137 53 T. Yurube Y. Takeoka Y. Kanda R. Kuroda K. Kakutani Intervertebral Disc Cell Fate During Aging and Degeneration: Apoptosis, Senescence, and Autophagy North American Spine Society Journal 14 2023 100210 10.1016/j.xnsj.2023.100210 37090223 PMC10113901 54 C. Q. Zhao L. M. Wang L. S. Jiang L. Y. Dai The Cell Biology of Intervertebral Disc Aging and Degeneration Ageing Research Reviews 6 3 2007 247 261 10.1016/j.arr.2007.08.001 17870673 55 C. L. Le Maitre J. A. Hoyland A. J. Freemont Catabolic Cytokine Expression in Degenerate and Herniated Human Intervertebral Discs: IL‐1beta and TNFalpha Expression Profile Arthritis Research & Therapy 9 4 2007 R77 10.1186/ar2275 17688691 PMC2206382 56 K. Wuertz N. Vo D. Kletsas N. Boos Inflammatory and Catabolic Signalling in Intervertebral Discs: The Roles of NF‐kappaB and MAP Kinases European Cells & Materials 23 2012 103 119 10.22203/ecm.v023a08 22354461 57 D. Samartzis A. Borthakur I. Belfer Novel Diagnostic and Prognostic Methods for Disc Degeneration and Low Back Pain Spine Journal 15 9 2015 1919 1932 10.1016/j.spinee.2014.09.010 PMC5473425 26303178 58 G. Lyons S. M. Eisenstein M. B. E. Sweet Biochemical changes in intervertebral disc degeneration Biochimica et Biophysica Acta 673 1981 443 453 10.1016/0304-4165(81)90476-1 7225426 59 J. F. Griffith Y. J. Wang G. E. Antonio Modified Pfirrmann Grading System for Lumbar Intervertebral Disc Degeneration Spine 32 24 2007 E708 E712 10.1097/BRS.0b013e31815a59a0 18007231 60 B. R. Whatley X. Wen Intervertebral Disc (IVD): Structure, Degeneration, Repair and Regeneration Materials Science and Engineering C 32 2 2012 61 77 10.1016/j.msec.2011.10.011 61 J. C. Iatridis S. B. Nicoll A. J. Michalek B. A. Walter M. S. Gupta Role of Biomechanics in Intervertebral Disc Degeneration and Regenerative Therapies: What Needs Repairing in the Disc and What Are Promising Biomaterials for Its Repair? Spine Journal 13 3 2013 243 262 10.1016/j.spinee.2012.12.002 PMC3612376 23369494 62 E. R. Acaroglu J. C. Iatridis L. A. Setton R. J. Foster V. C. Mow M. Weidenbaum Degeneration and Aging Affect the Tensile Behavior of Human Lumbar Anulus Fibrosus Spine 20 24 1995 2690 2701 10.1097/00007632-199512150-00010 8747247 63 B. Peng J. Hao S. Hou Possible Pathogenesis of Painful Intervertebral Disc Degeneration Spine 31 5 2006 560 566 10.1097/01.brs.0000201324.45537.46 16508552 64 S. R. Pye D. M. Reid M. Lunt Lumbar Disc Degeneration: Association Between Osteophytes, End‐Plate Sclerosis and Disc Space Narrowing Annals of the Rheumatic Diseases 66 3 2007 330 333 10.1136/ard.2006.052522 17028115 PMC1856007 65 F. M. Howard J. Dolezal S. Kochanny The Impact of Site‐Specific Digital Histology Signatures on Deep Learning Model Accuracy and Bias Nature Communications 12 1 2021 1 13 10.1038/s41467-021-24698-1 PMC8292530 34285218 66 S. Otalora M. Atzori V. Andrearczyk A. Khan H. Muller Staining Invariant Features for Improving Generalization of Deep Convolutional Neural Networks in Computational Pathology Frontiers in Bioengineering and Biotechnology 7 2019 198 10.3389/fbioe.2019.00198 31508414 PMC6716536 67 D. Tellez G. Litjens P. Bandi Quantifying the Effects of Data Augmentation and Stain Color Normalization in Convolutional Neural Networks for Computational Pathology Medical Image Analysis 58 2019 101544 10.1016/j.media.2019.101544 31466046 68 C. Albers The Problem With Unadjusted Multiple and Sequential Statistical Testing Nature Communications 10 1 2019 1921 10.1038/s41467-019-09941-0 PMC6478696 31015469 ",
  "metadata": {
    "Title of this paper": "The Problem With Unadjusted Multiple and Sequential Statistical Testing",
    "Journal it was published in:": "JOR Spine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488225/"
  }
}