{
  "title": "Paper_666",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469636 PMC12469636.1 12469636 12469636 41009451 10.3390/ijms26188883 ijms-26-08883 1 Article Biodegradable Nanoparticles Encapsulating Murine Double Minute 2 siRNA to Treat Peritoneal Dissemination of Colon Cancer Kurosaki Tomoaki Conceptualization Investigation Writing – original draft 1 2 Okada Akari Formal analysis Investigation Writing – original draft 3 Takashima Yuuki Formal analysis Methodology 2 Sasaki Hitoshi Conceptualization Methodology Project administration Supervision Writing – review & editing 1 Kodama Yukinobu Project administration Supervision Writing – review & editing 3 * Pennisi Rosamaria Academic Editor 1 jj20250042@ms.nagasaki-u.ac.jp sasaki@nagasaki-u.ac.jp 2 y.takashima.ex@juntendo.ac.jp 3 chiyaku.labo@gmail.com * y-kodama@nagasaki-u.ac.jp 12 9 2025 9 2025 26 18 497349 8883 29 8 2025 10 9 2025 11 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The study aim was to apply murine double minute 2 (MDM2)-siRNA to a biodegradable siRNA delivery vector, ternary complex, for treating colorectal cancer peritoneal dissemination. The ternary complex containing MDM2-siRNA (MDM2-siRNA complex) was constructed by mixing MDM2-siRNA, dendrigraft poly-L-lysine, and γ-polyglutamic acid. Cellular uptake of the ternary complex and suppressive effect on MDM2-mRNA were determined in a mouse colorectal cancer cell line. Tumor-growth inhibition by the MDM2-siRNA complex was evaluated in peritoneal dissemination model mice. The MDM2-siRNA complex, with an approximately 177 nm particle size and −35 mV ζ-potential, prevented degradation of the inner siRNA by RNase. In the in vitro study, the ternary complex was highly taken up by the cells, and 2 μg/mL of the MDM2-siRNA complex significantly decreased MDM2-mRNA to about 30% of control cells. Intraperitoneal administration in colorectal cancer peritoneal dissemination model mice showed little effect of the ternary complex containing scramble-siRNA on cancer growth in the peritoneal cavity. Conversely, the MDM2-siRNA complex significantly reduced peritoneal dissemination to less than 1/1000th of control mice and successfully prolonged survival time. In this study, we found that the biodegradable MDM2-siRNA complex had a suppressive effect on MDM2-mRNA in cancer cells and tumor growth of peritoneal dissemination. siRNA delivery system biodegradable nanoparticles colorectal cancer peritoneal dissemination murine double minute 2 START Project Promotion Type JPMJST1819 Japan Society for the Promotion of Science (JSPS) KAKENHI JP20K12649 JP20K07156 Faculty of Pharmacy, Juntendo University This work was supported by the START Project Promotion Type under Grant number JPMJST1819 and the Japan Society for the Promotion of Science (JSPS) KAKENHI (grant numbers JP20K12649 and JP20K07156). This research was also supported in part by a grant from Faculty of Pharmacy, Juntendo University. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Colorectal cancer is the second most common cancer in women and third most common in men worldwide [ 1 2 3 4 3 5 2 It is well known that tumor protein 53 (p53) is a tumor suppressor in various diseases, including colorectal cancer [ 6 7 8 9 7 10 11 12 In a previous study, we successfully developed a new siRNA vector, a ternary complex constructed with siRNA, dendrigraft poly-L-lysine (DGL), and γ-polyglutamic acid (γ-PGA) [ 13 2. Results 2.1. Physicochemical Characteristics of siRNA Complexes The DGL solution was mixed with MDM2-siRNA or scramble-siRNA solution to prepare each binary complex. The γ-PGA solution was added to those binary complexes by pipetting to construct the MDM2-siRNA/DGL/γ-PGA complex (MDM2-siRNA complex) or scramble-siRNA/DGL/γ-PGA complex (scramble-siRNA complex). Particle sizes (Z-average) and ζ-potentials of those ternary complexes were approximately 170–180 nm and −35 mV, respectively ( Table 1 2.2. Stability of MDM2-siRNA Complex Against RNase A Figure 1 2.3. Cellular Uptake of siRNA Complex To evaluate the cellular uptake of siRNA, a commercially available fluorescence-labeled negative control siRNA (Alexa Fluor 555-siRNA) was used. The intracellular Alexa Fluor 555-siRNA was observed using a fluorescent microscope. When naked Alexa Fluor 555-siRNA was added, no fluorescence of Alexa Fluor 555-siRNA was observed in the Colon26/Luc cells ( Figure 2 Figure 2 2.4. In Vitro MDM2 Silencing Efficiency of the MDM2-siRNA Complex The silencing effect of the MDM2-siRNA complex in Colon26/Luc cells was evaluated by performing real-time polymerase chain reaction (PCR) ( Figure 3 p Figure 3 2.5. In Vivo Tumor-Growth Inhibition of the MDM2-siRNA Complex Tumor-growth inhibition of the MDM2-siRNA complex was determined in the peritoneal dissemination model mice. The 5% glucose solution (a), naked MDM2-siRNA (b), scramble-siRNA complex (c), and MDM2-siRNA complex (d) were intraperitoneally administered to the mice. At post-administration day 16, two mice were randomly selected from each group and the growth and metastasis of Colon26/Luc cells in the mouse whole body were observed using an in vivo imaging system. Observation showed that the luminescence from Colon26/Luc cells was observed only around the peritoneal cavity and decreased markedly only in the mice treated with the MDM2-siRNA complex ( Figure 4 As Colon26/Luc cells were increased only in the peritoneal cavity, the intestine and clumps of Colon26/Luc cells were dissected, and the growth of Colon26/Luc cells was quantitatively determined by luciferase assay ( Figure 4 7 p 2.6. Effect of the MDM2-siRNA Complex on Survival Time in Tumor-Bearing Mice The survival time was monitored ≤60 days after inoculation with Colon26/Luc cells ( Figure 5 p 3. Discussion As is well known, siRNA is a small molecule with double-stranded RNA that triggers post-transcriptional silencing of target gene expression via RNA interference (RNAi) [ 11 14 15 We previously developed an anionic ternary complex containing siRNA, DGL, and γ-PGA that self-assembled through electrostatic interactions. Cationic dendrimers, such as DGL, are theoretically single-molecule compounds that are biodegradable despite their macromolecular size [ 16 17 18 Table 1 Reportedly, siRNA can be rapidly degraded in vivo by RNase A (originally known as pancreatic RNase) [ 19 Figure 1 20 We also measured the in vitro uptake of the Alexa Fluor 555-siRNA complex in colorectal cancer Colon26/Luc cells ( Figure 2 13 21 Figure 2 The in vitro MDM2-mRNA suppressing effect of the MDM2-siRNA complex and scramble-siRNA complex in Colon26/Luc cells was determined by real-time PCR ( Figure 3 Figure 3 p 22 Therefore, in vivo tumor-growth inhibition by the MDM2-siRNA complex was evaluated in colorectal cancer peritoneal dissemination model mice, which were intraperitoneally injected with Colon26/Luc cells ( Figure 4 Figure 5 23 In this study, we found that the MDM2-siRNA complex had a suppressive effect on MDM2-mRNA and tumor growth of peritoneal dissemination. Further study would be needed to demonstrate selective uptakes of MDM2-siRNA complex by Colon26/Luc cells in peritoneal cavity and evaluate how to apply the MDM2-siRNA complex in clinical therapy. 4. Materials and Methods 4.1. Chemicals MDM2-siRNA (sense: 5′-GCUUCGGAACAAGAGACUC-3′, antisense: 5′-GAGUCUCUUGUUCCGAAGC-3′) and scramble-siRNA (sense: 5′-CUUACGCUGUCAUGAUCGA-3′, antisense: 5′-UCGAUCAUGACAGCGUAAG-3′) were purchased from GeneDesign, Inc. (Osaka, Japan). A commercially available Alexa Fluor 555-siRNA (BLOCK-iT Alexa Fluor Red Fluorescent Control; the siRNA sequence is not publicly accessible) was obtained from Invitrogen (Carlsbad, CA, USA). Fifth-generation DGL compounds (MW: 172,300 Da, 963 lysine groups) was obtained from COLCOM S.A.S. (Montpellier, France). The compound γ-PGA was kindly provided by Yakult Pharmaceutical Industry Co., Ltd. (Tokyo, Japan). Bisbenzimide H 33,342 trihydrochloride (Hoechst 33,342) was obtained from Sigma Aldrich (St. Louis, MO, USA). Fetal bovine serum (FBS) was purchased from Biological Industries Ltd. (Kibbutz Beit Haemek, Israel). RPMI 1640, Opti-MEM, antibiotics (100 U/mL penicillin and 100 μg/mL streptomycin), and other culture reagents were obtained from GIBCO BRL (Grand Island, NY, USA). A solution of the antibiotic, G418, was purchased from Roche Diagnostics (Indianapolis, IN, USA). 4.2. Preparation of the Complex The siRNA, DGL, and γ-PGA were dissolved in a 5% glucose solution at a concentration of 10 mg/mL. A theoretical charge ratio of the phosphate of siRNA, nitrogen of DGL, and carboxylate of γ-PGA was calculated for complex formation. To prepare the binary complex, an appropriate amount of stock DGL solution was mixed with siRNA solution at a charge ratio of 1:6 by pipetting, and placed on ice for 10 min. After 10 min, the binary complex was maintained at room temperature for 20 min. The γ-PGA solution was added to the binary complex by pipetting to give a charge ratio of 1:6:10 (siRNA:DGL:γ-PGA) to construct the MDM2-siRNA/DGL/γ-PGA complex (MDM2-siRNA complex) or scramble-siRNA/DGL/γ-PGA complex (scramble-siRNA complex), both of which were maintained for another 30 min at room temperature. 4.3. Cell Culture The mouse colorectal cancer cell line expressing luciferase regularly (Colon26/Luc cells) was prepared in our laboratory [ 13 2 4.4. Animals All animal care and experimental procedures were performed according to the Guidelines for Animal Experimentation of Nagasaki University, with approval from the Institutional Animal Care and Use Committee of Nagasaki University. Female 5-week-old BALB/c mice were purchased from Japan SLC, Inc. (Shizuoka, Japan). At least five mice are required per group for tumor-growth experiments. We used total 40 mice in this manuscript. After delivery, the mice were acclimatized to their new environment for ≥1 day before the experiments. All animals were housed under a 12 h dark–light cycle with ad libitum food and water. 4.5. Physicochemical Characteristics of Complex A Zetasizer Nano ZS (Malvern Instruments, Ltd., Malvern, UK) was used to measure the particle size and ζ-potential of the MDM2-siRNA complex and scramble-siRNA complex. Particle sizes are shown as the Z-average particle size. 4.6. Agarose Gel Electrophoresis To determine the complex formation and degradation of siRNA by RNase A, the naked MDM2-siRNA and MDM2-siRNA complex were incubated with and without 0.05 mg/mL RNase A for 1 h. To release MDM2-siRNA from the ternary complex, heparin sulfate was added to the solution after the incubation. Immediately after the additions of heparin sulfate, 20 μL aliquots of the solution containing 1 μg of MDM2-siRNA were mixed with 4 μL of loading buffer (30% glycerol and 0.2% bromophenol blue) and then loaded onto 1% agarose gel. Electrophoresis (i-Mupid J; Cosmo Bio, Tokyo, Japan) was performed at 100 W in a running buffer solution (40 mM Tris/HCl, 40 mM acetic acid, and 1 mM ethylenediaminetetraacetic acid [EDTA]) for 30 min, and siRNA retardation was visualized with ethidium bromide staining on a Gel Doc EZ Imager (Bio-Rad, Hercules, CA, USA). 4.7. In Vitro Cellular Uptake of Complex The Colon26/Luc cells were plated on 24-well plates at a density of 1.0 × 10 4 4.8. In Vitro MDM2 Silencing Efficiency The Colon26/Luc cells were plated on 24-well plates at a density of 1.0 × 10 4 Table 2 4.9. In Vivo Tumor-Growth Inhibition In vivo tumor-growth inhibition by the MDM2-siRNA complex was evaluated in peritoneal dissemination model mice. The Colon26/Luc cells (3.0 × 10 5 n n n n The survival rate of the mice treated with the complex was also monitored up to 60 days after inoculation with the Colon26/Luc cells ( n 4.10. Statistical Analysis Statistical analysis was performed by JMP 16 software (SAS Institute Inc., Cary, NC, USA). Dunnett’s pairwise multiple comparisons t p Disclaimer/Publisher’s Note: Author Contributions Conceptualization, T.K. and H.S.; Formal analysis, A.O. and Y.T.; Investigation, T.K. and A.O.; Methodology, Y.T. and H.S.; Project administration, H.S. and Y.K.; Supervision, H.S. and Y.K.; Writing—original draft, T.K. and A.O.; Writing—review and editing, H.S. and Y.K. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement All animal care and experimental procedures were performed according to the Guidelines for Animal Experimentation of Nagasaki University with approval from the Institutional Animal Care and Use Committee (protocol code 2201061768; approval 1 June 2022). Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest associated with this manuscript. References 1. Ferlay J. Soerjomataram I. Dikshit R. Eser S. Mathers C. Rebelo M. Parkin D.M. Forman D. Bray F. Cancer incidence and mortality worldwide: Sources, methods, and major patterns in GLOBOCAN 2012 Int. J. Cancer 2015 136 E359 E386 10.1002/ijc.29210 25220842 2. Aoyagi T. Terracina K.P. Raza A. Takabe K. Current treatment options for colon cancer peritoneal carcinomatosis World J. Gastroenterol. 2014 20 12493 12500 10.3748/wjg.v20.i35.12493 25253949 PMC4168082 3. Rajeshkumar B.R. Paliwal S. Lambert L. Grossman S.R. Whalen G.F. Treatment of peritoneal carcinomatosis with intraperitoneal administration of Ad-hARF J. Surg. Res. 2015 197 85 90 10.1016/j.jss.2015.03.048 25935465 4. Klaver C.E.L. Stam R. Sloothaak D.A.M. Crezee J. Bemelman W.A. Punt C.J.A. Tanis P.J. Colorectal cancer at high risk of peri-toneal metastases: Long term outcomes of a pilot study on adjuvant laparoscopic HIPEC and future perspectives Oncotarget 2017 8 51200 51209 10.18632/oncotarget.17158 28881641 PMC5584242 5. Massalou D. Benizri E. Chevallier A. Duranton-Tanneur V. Pedeutour F. Benchimol D. Béréder J.M. Peritoneal carcinomatosis of colorectal cancer: Novel clinical and molecular outcomes Am. J. Surg. 2017 213 377 387 10.1016/j.amjsurg.2016.03.008 27816197 6. Gong H. Cao Y. Han G. Zhang Y. You Q. Wang Y. Pan Y. p53/microRNA-374b/AKT1 regulates colorectal cancer cell apoptosis in response to DNA damage Int. J. Oncol. 2017 50 1785 1791 10.3892/ijo.2017.3922 28339062 7. Hientz K. Mohr A. Bhakta-Guha D. Efferth T. The role of p53 in cancer drug resistance and targeted chemotherapy Oncotarget 2017 8 8921 8946 10.18632/oncotarget.13475 27888811 PMC5352454 8. Li X.L. Zhou J. Chen Z.R. Chng W.J. P53 mutations in colorectal cancer: Molecular pathogenesis and pharmacological reactivation World J. Gastroenterol. 2015 21 84 93 10.3748/wjg.v21.i1.84 25574081 PMC4284363 9. Liu Y. Bodmer W.F. Analysis of P53 mutations and their expression in 56 colorectal cancer cell lines Proc. Natl. Acad. Sci. USA 2006 103 976 981 10.1073/pnas.0510146103 16418264 PMC1327731 10. Wang K.S. Chen G. Shen H.L. Li T.T. Chen F. Wang Q.W. Wang Z.Q. Han Z.G. Zhang X. Insulin receptor tyrosine kinase substrate enhances low levels of MDM2-mediated p53 ubiquitination PLoS ONE 2011 6 E23571 10.1371/journal.pone.0023571 21887275 PMC3160901 11. Azmi A.S. Philip P.A. Aboukameel A. Wang Z. Banerjee S. Zafar S.F. Goustin A.S. Almhanna K. Yang D. Sarkar F.H. Reactivation of p53 by novel MDM2 inhibitors: Implications for pancreatic cancer therapy Curr. Cancer Drug Targets 2010 10 319 331 10.2174/156800910791190229 20370686 PMC3809102 12. Giono L.E. Manfredi J.J. MDM2 is required for inhibition of Cdk2 activity by p21, thereby contributing to p53-dependent cell cycle arrest Mol. Cell. Biol. 2007 27 4166 4178 10.1128/MCB.01967-06 17371838 PMC1900019 13. Kodama Y. Kuramoto H. Mieda Y. Muro T. Nakagawa H. Kurosaki T. Sakaguchi M. Nakamura T. Kitahara T. Sasaki H. Application of biodegradable dendrigraft poly-L-lysine to a small interfering RNA delivery system J. Drug Target. 2017 25 49 57 10.1080/1061186X.2016.1184670 27125178 14. Kanasty R. Dorkin J.R. Vegas A. Anderson D. Delivery materials for siRNA therapeutics Nat. Mater. 2013 12 967 977 10.1038/nmat3765 24150415 15. John J.T. Simon W.J. Sterghios A.M. Mark A.L. Michael J.G. MALDI-TOF mass spectral analysis of siRNA degradation in serum confirms an RNase A-like activity Mol. Biosyst. 2007 3 43 50 10.1039/b611612d 17216055 PMC2682774 16. Collet H. Souaid E. Cottet H. Deratani A. Boiteau L. Dessalces G. Rossi J.C. Commeyras A. Pascal R. An expeditious multigram-scale synthesis of lysine dendrigraft (DGL) polymers by aqueous N carboxyanhydride polycondensation Chemistry 2010 16 2309 2316 10.1002/chem.200901734 20033966 17. Shih I.L. Van Y.T. The production of poly-(γ-glutamic acid) from microorganisms and its various applications Bioresour. Technol. 2001 79 207 225 10.1016/S0960-8524(01)00074-8 11499575 18. Khalil I.R. Burns A.T. Radecka I. Kowalczuk M. Khalaf T. Adamus G. Johnston B. Khechara M.P. Bacterial-derived polymer poly-γ-glutamic acid (γ-PGA)-based micro/nanoparticles as a delivery system for antimicrobials and other biomedical applications Int. J. Mol. Sci. 2017 18 313 10.3390/ijms18020313 28157175 PMC5343849 19. Cuthbert B.J. Burley K.H. Goulding C.W. Introducing the new bacterial branch of the RNase A superfamily RNA Biol. 2018 15 9 12 10.1080/15476286.2017.1387710 29099294 PMC5786019 20. Reddi K.K. Holland J.F. Elevated serum ribonuclease in patients with pancreatic cancer Proc. Natl. Acad. Sci. USA 1976 73 2308 2310 10.1073/pnas.73.7.2308 1065880 PMC430542 21. Peng S.F. Tseng M.T. Ho Y.C. Wei M.C. Liao Z.X. Sung H.W. Mechanisms of cellular uptake and intracellular trafficking with chitosan/DNA/poly(γ-glutamic acid) complexes as a gene delivery vector Biomaterials 2011 32 239 248 10.1016/j.biomaterials.2010.08.081 20864162 22. Zhang J. Wu D. Xing Z. Liang S. Han H. Shi H. Zhang Y. Yang Y. Li Q. N-Isopropylacrylamide-modified polyethylenimine-mediated p53 gene delivery to prevent the proliferation of cancer cells Colloids Surf. B Biointerfaces 2015 129 54 62 10.1016/j.colsurfb.2015.03.032 25829127 23. Jackson A.L. Burchard J. Schelter J. Chau B.N. Cleary M. Lim L. Linsley P.S. Widespread siRNA “off-target” transcript silencing mediated by seed region sequence complementarity RNA 2006 12 1179 1187 10.1261/rna.25706 16682560 PMC1484447 Figure 1 Stability of the naked murine double minute 2 (MDM2)-siRNA and MDM2-siRNA complex against RNase A. The naked MDM2-siRNA or MDM2-siRNA complex were incubated with 5% glucose (a: naked MDM2-siRNA, b: MDM2-siRNA complex, c: MDM2-siRNA complex + heparin) or RNase A (d: naked MDM2-siRNA + RNase A, e: MDM2-siRNA complex + RNase A, f: naked MDM2-siRNA + RNase A + heparin, g: MDM2-siRNA complex + RNase A + heparin). Each sample was loaded onto agarose gel, and electrophoresis was carried out. Figure 2 Cellular uptake of the Alexa Fluor 555-siRNA complex. Colon26/Luc cells treated with naked Alexa Fluor 555-siRNA ( a b Figure 3 Murine double minute 2 (MDM2)-mRNA silencing effect of the MDM2-siRNA complex. The relative MDM2-mRNA expression level of the Colon26/Luc cells was determined by real-time PCR at 24 h after treatment with MDM2-siRNA ( a b n p Figure 4 Tumor-growth inhibition in mice treated with the murine double minute 2 (MDM2)-siRNA complex. The Colon26/Luc cells (3.0 × 10 5 a b c d e n p Figure 5 Survival rate of the mice after treatment with the murine double minute 2 (MDM2)-siRNA complex. The Colon26/Luc cells (3.0 × 10 5 n p ijms-26-08883-t001_Table 1 Table 1 Particle sizes and ζ-potentials of siRNA complexes. Complex Size (nm) ζ-Potential (mV) MDM2-siRNA complex 177.1 ± 1.7 −34.9 ± 0.5 Scramble-siRNA complex 172.5 ± 4.0 −35.3 ± 1.0 Each value represents the mean ± S.D. ( n ijms-26-08883-t002_Table 2 Table 2 Primer sequences used for real-time PCR. Primer Forward Primer Sequence Reverse Primer Sequence MDM2 5′-AGCACCTCACAGATTCCAGC-3′ 5′-GCGCTCCAACGGACTTTAAC-3′ GAPDH 5′-TCTCCTGCGACTTCAACA-3′ 5′-GCTGTAGCCGTATTCATTGT-3′ ",
  "metadata": {
    "Title of this paper": "Widespread siRNA “off-target” transcript silencing mediated by seed region sequence complementarity",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469636/"
  }
}