{
  "title": "Paper_173",
  "abstract": "pmc J Pharmacokinet Pharmacodyn J Pharmacokinet Pharmacodyn 365 springeropen Journal of Pharmacokinetics and Pharmacodynamics 1567-567X 1573-8744 pmc-is-collection-domain yes pmc-collection-title Springer PMC12494607 PMC12494607.1 12494607 12494607 41044356 10.1007/s10928-025-10003-w 10003 1 Correspondence Exposure-safety Markov modeling of ocular adverse events in patient populations treated with tisotumab vedotin Feng Summer sufe@genmab.com 1 7 Gunawan Rudy 2 Passey Chaitali 1 Voellinger Jenna 2 Polhamus Daniel 3 Gerritsen Arnout 4 O’Day Christine 2 Carret Anne-Sophie 2 5 Soumaoro Ibrahima 1 Gupta Manish 1 Hanley William D. 2 6 1 https://ror.org/05258cy55 grid.492734.f 0000 0004 6079 3997 Genmab US, Inc., 2 https://ror.org/01xdqrp08 grid.410513.2 0000 0000 8800 7493 Pfizer Inc., 3 https://ror.org/04j2hh758 grid.512372.0 Metrum Research Group, 4 https://ror.org/01ajp8153 grid.466767.2 0000 0004 0620 3167 Genmab, 5 6 grid.519096.2 Present Address: BeiGene, 7 3 10 2025 2025 52 5 498296 55 4 11 2024 26 8 2025 03 10 2025 05 10 2025 05 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Tisotumab vedotin (TV), a tissue factor–directed antibody–drug conjugate (ADC), is approved in the US at 2.0 mg/kg every 3 weeks (Q3W) for adult patients with recurrent or metastatic cervical cancer following disease progression on or after chemotherapy. Previous logistic regression analysis showed a positive association between TV exposure and ocular adverse events (OAEs), which were identified as prespecified AEs of interest in TV clinical studies. To further optimize TV dose from a safety perspective, we developed a discrete-time Markov model (DTMM) to characterize exposure–response (E-R) relationships of exposures of both ADC and the microtubule‐disrupting agent monomethyl auristatin E to the incidence, severity, and longitudinal time course of grade ≥ 2 OAEs in patients with advanced solid tumors. A total of 757 patients who received TV as monotherapy or combination (with carboplatin, bevacizumab, or pembrolizumab) across seven clinical studies were included in this analysis. Of multiple covariates modeled, implementation of an eye care plan was the only covariate to significantly reduce risk of grade ≥ 2 OAEs. The DTMM suggested an association between ADC exposure and risk of grade ≥ 2 OAEs. Based on the totality of data from clinical outcomes, pharmacokinetics, and E-R analyses, as well as DTMM modeling results, TV 1.7 mg/kg every 2 weeks may provide higher efficacy with slightly increased risk of OAEs compared with 2.0 mg/kg Q3W, although these OAEs are manageable with an appropriate eye care plan. ClinicalTrials.gov ID (first submission): NCT03485209 NCT03657043 NCT03438396 NCT03786081 NCT03913741 NCT02001623 NCT02552121 Supplementary Information The online version contains supplementary material available at 10.1007/s10928-025-10003-w. Keywords Ocular adverse events Markov model Antibody–drug conjugate Tisotumab vedotin Oncology Genmab (Copenhagen, Denmark) Pfizer Inc. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media, LLC, part of Springer Nature 2025 Introduction Tisotumab vedotin (TV) is a tissue factor (TF)–directed antibody–drug conjugate (ADC) composed of a fully human monoclonal immunoglobulin-1 antibody specific for TF, covalently linked to the microtubule disrupting agent monomethyl auristatin E (MMAE) via a protease-cleavable linker [ 1 1 2 1 3 4 The approved TV monotherapy dose of 2.0 mg/kg every 3 weeks (Q3W) demonstrated overall survival benefit with a manageable safety profile compared with chemotherapy in women with previously treated recurrent or metastatic cervical cancer [ 4 5 6 Ocular adverse events (OAEs) frequently occur in patients treated with a number of ADCs therapies across various tumor types [ 7 8 9 12 13 5 14 Among 425 patients with recurrent or metastatic cervical cancer who received TV across clinical trials at the approved dosing regimen (2.0 mg/kg Q3W), OAEs were observed in 55% [ 4 14 5 15 The approved TV dosing regimen of 2.0 mg/kg Q3W for cervical cancer was supported by population PK and exposure–response (E-R) analyses conducted using data across four clinical studies [ 16 17 18 19 In the previous E-R analysis, the association between TV exposure and probability of occurrence of OAE was characterized using logistic regression analysis, but due to the limitation of the logit model, neither onset time nor duration of OAEs, critical factors in determining an alternate dosing regimen, were taken into consideration [ 18 1 Fig. 1 Simulation flowchart describing modeled endpoints and trial simulation routine. Trapezoidal shapes indicate inputs to the model and arrows indicate directionality of information and outputs. Dashed rectangle refers to efficacy modeling (not reported here). PFS, progression-free survival; PK, pharmacokinetics Methods Patients and study design This study was a retrospective analysis using pooled data from seven clinical studies of TV monotherapy and combination therapies in patients with advanced solid tumors: innovaTV 201 [ 14 20 5 21 22 6 23 All clinical studies were conducted in accordance with good clinical practice guidelines from the International Council for Harmonization of Technical Requirements for Pharmaceuticals for Human Use and the principles of the Declaration of Helsinki. Protocols were approved by relevant regulatory and independent ethics committees. Written informed consent was obtained from all patients enrolled in the clinical studies. Data analysis Actual patient dosing records, including dose reductions, were included in the PK dataset. PK empirical Bayes estimates from the previously derived population-PK dataset were used to generate TV exposure metrics [ 24 The OAE dataset included AE severity grades 0, 1, 2, and ≥ 3 based on the day of occurrence and duration of OAEs. Across trials, AEs, including OAEs, were assessed and reported at each study visit; visit schedules for each study are shown in Supplementary Table 1 To support the characterization of OAEs, both a three-state Markov model (grade ≤ 1, grade 2, and grade ≥ 3) and a simplified two-state model (grade ≤ 1 vs grade ≥ 2) were developed. The three-state model enables more granular evaluation of OAE occurrence across clinically relevant severity levels, while the two-state model offers a streamlined framework to evaluate the overall burden of moderate-to-severe ocular toxicity. To allow for estimation of a Markovian element, the status for a patient’s previous day was also incorporated. OAE data used to generate the exposure-OAE model included TV as monotherapy and TV in combination with other treatments across several tumor types (tumors of the ovary, cervix, endometrium, bladder, prostate, or esophagus, head and neck squamous cell carcinoma, non-small cell lung cancer, colorectal cancer, or exocrine pancreatic cancer) from the above-mentioned trials. The effect of covariates on the risk of grade ≥2 OAEs was also evaluated. These covariates included TV therapy type (as monotherapy or in combination with pembrolizumab, carboplatin, or bevacizumab), TV dose and schedule, presence of OAEs at baseline that were not specified as exclusion criteria, presence of dry eyes at baseline, and whether ECP was mandated (15 patients from innovaTV 201 were enrolled prior to implementation of the ECP). Each study protocol specified ongoing or cicatricial ocular surface conditions at the time of enrollment as exclusion criteria; however abnormal ocular baseline findings alone were generally not a reason for exclusion from the studies [ 5 6 20 23 The dosing regimen and timing of dose modifications, often resulting from AEs, directly affect exposure. Therefore, data on dose reductions and treatment-related AEs (TRAEs) leading to discontinuation were also included to facilitate competing risk/time-to-event model development for the integrated simulation of OAEs. The day of discontinuation due to TRAEs was censored by discontinuation for other reasons (e.g., disease progression, investigator decision). To account for varying treatment durations and observation windows across subpopulations of patients, discontinuation due to progression was also captured for modeling, with times for patients discontinuing due to reasons other than progression (e.g., TRAEs, investigator decision) being censored. Summary of data source Observed OAEs were tabulated and summarized graphically across regimens and studies. In addition, the time profile and prevalence of the grades of OAE were illustrated using stacked area plots, stacked frequency plots, and percentage of patients by grade of event, time, study, and regimen (Supplementary Table 1 2 Model development The relationships between exposure and the incidence, severity, and time course of daily grade ≥ 2 OAEs were characterized using a discrete time Markov model (DTMM) with a first-order Markov element on daily intervals, logit link relating predictors to cumulative state probabilities, and interindividual variability (IIV) on baseline probabilities [ 25 26 27 2 Fig. 2 Final population PK and Markov model. Two-compartment ADC model with parallel linear and Michaelis–Menten elimination, a delay compartment, and a one-compartment unconjugated MMAE model 19. ADC, antibody–drug conjugate; CL, clearance; DAR, drug-to-antibody ratio; FR1, fraction of nonspecific elimination directed to the central compartment; FR2, fraction directed to the delay compartment; k max K V V max V MMAE V \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${k}_{e}^{ADC}$$\\end{document} A base OAE model was first developed that included only structural parameters and exposure. Covariates were added to this model as guided by model evaluation to arrive at a final model. The occurrence (and duration) of OAE events was modeled with either two or three categories: OAE occurrence of grade ≥ 2, or of grade 2 and grade 3 separately. The DTMM was specified by including a Markov component using a proportional-odds model structure, as shown in formula below for patient i j \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\begin{aligned} & logit\\left[P\\left({OAE}_{i,j}\\ge m | OA{E}_{\\left\\{i,j-1\\right\\}}=k\\right)\\right] \\\\&=\\text{log}\\left(\\frac{P\\left({OAE}_{i,j}\\ge m| OA{E}_{\\left\\{i,j-1\\right\\}}=k\\right)}{1-P\\left({OAE}_{i,j}\\ge m| OA{E}_{\\left\\{i,j-1\\right\\}} =k\\right)}\\right) \\\\& ={\\beta }_{mk}^{0}+D\\left({t}_{ij},f \\left({C}_{ij}^{ADC}, {\\beta }^{ADC}\\right),g\\left({C}_{ij}^{TOX}, {\\beta }^{TOX}\\right)\\right)\\times \\prod_{p=1}^{P}{\\gamma }_{p}^{{X}_{ip}} \\end{aligned}$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\beta }_{mk}^{0}$$\\end{document} 1 3 1 3 f() g() D() \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\gamma$$\\end{document} x D() \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\beta }^{ADC})$$\\end{document} m \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\beta }^{ADC}$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\beta }^{TOX}$$\\end{document} 28 Exposure functional forms are considered combinations of linear and hyperbolic functions of exposure. For example, a linear and additive adjustment of the direct ADC and TOX exposure effects on the log odds took the form: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\begin{aligned} & D\\left(f \\left({C}^{ADC}(t), {\\beta }^{ADC}(t)\\right),g\\left({C}^{TOX}(t), {\\beta }^{TOX}(t)\\right)\\right) \\\\& ={\\beta }_{1}^{ADC}{C}^{ADC}(t)+{\\beta }_{1}^{TOX}{C}^{TOX}(t) \\end{aligned}$$\\end{document} Other functional forms included combinations of linear and hyperbolic/sigmoidal effects, e.g., hyperbolic in ADC and linear in TOX: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\begin{aligned} & D\\left(f \\left({C}^{ADC}(t), {\\beta }^{ADC}(t)\\right),g\\left({C}^{TOX}(t), {\\beta }^{TOX}(t)\\right)\\right)\\\\& = \\frac{{\\beta }_{1}^{ADC}{C}^{ADC}(t)}{{\\beta }_{2}^{ADC}+{C}^{ADC}(t)}+{\\beta }_{1}^{TOX}{C}^{TOX}(t) \\end{aligned}$$\\end{document} Exposure itself, for either ADC or TOX, was represented as average concentration in the day ( C C e \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\frac{d{C}_{e}^{ADC}(t)}{dt}={k}_{e}^{ADC} \\left({C}^{ADC}(t)-{C}_{e}^{ADC}(t)\\right)$$\\end{document} k e 29 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\beta }_{mki}^{0}= {\\beta }_{mk}^{0} {e}^{{\\eta }_{i}}$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\eta }_{i}\\sim N\\left(0, {\\omega }^{2}\\right).$$\\end{document} In addition to the characterization of the exposure–response relationships of OAEs, we characterized the relationship between exposure and dose reduction using a repeated time-to-event model, and the relationship between exposure and discontinuation (due to AE or disease progression) using a time-to-event model. For each of these, the hazard of event was modeled in a similar manner to that described for OAE modeling: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$h\\left({t}_{i}\\right)={h}_{0}\\left({t}_{i}\\right)\\times D\\left(f \\left({C({t}_{i})}^{ADC}, {\\beta }^{ADC}\\right),g\\left({C({t}_{i})}^{TOX}, {\\beta }^{TOX}\\right)\\right)\\times \\prod_{p=1}^{P}{\\gamma }_{p}^{{X}_{ip}},$$\\end{document} h 0 D() \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\gamma$$\\end{document} h 0 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$L\\left({t}_{i}\\right)={h({t}_{i})}^{{\\delta}_{i}}\\times \\text{exp}\\left\\{-H\\left({t}_{i}\\right)\\right\\}$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\delta}_{i}$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$H\\left({t}_{i}\\right)={\\int}_{0}^{{t}_{i}}h(u) du.$$\\end{document} In addition to these modeled endpoints, simulations from a previously published joint tumor growth index–OS model [ 18 Model selection criteria and evaluation Model selection was guided by model convergence, convergence of the covariance step in NONMEM (Icon plc, Dublin, Ireland), precision, identifiability of parameter estimates, and Akaike information criterion (AIC). Model evaluation relied primarily upon visual predictive checks (VPCs) in which the model was used to simulate observations that were conditional on observed covariates, dosing, fitted parameters, and observed censoring times. Statistics of the observed data were then compared with summaries of those statistics applied to simulations from the model. For the OAE model, model-predicted and observed time profiles of OAEs and transition probabilities were compared in order to evaluate the DTMM model. The first occurrence of grade ≥ 2 OAEs was also compared using Kaplan–Meier–type VPCs. The time to first and second dose reduction and discontinuation due to AEs were also compared between model-predicted and observed data in time-to-event models. Model application To support further development of TV in non-cervical tumors, the time profile of OAEs was simulated at various dosing regimens accounting for dose reductions, discontinuation due to AE, and disease progression. The simulated OAE profiles of the more-frequent dosing regimen were compared with the profile at the approved dosing regimen of 2 mg/kg Q3W. The OAE, dose reduction, discontinuation, and projected disease progression were combined for joint exposure-driven simulations. When dose reduction events were simulated to have occurred, doses were reduced according to the following approximation of the protocol-specified dose reduction procedure for ocular event mitigation: only two total dose reductions could be experienced by a simulated patient (they discontinued treatment on the third), wherein each dose reduction decreased the dose relative to the last dose received by 30%. In addition, any simulated patient experiencing at least 6 consecutive weeks of grade ≥ 2 events discontinued at the sixth week of continuing events. Computational software Data manipulation, visualization, and simulations were conducted using R version 4.1.1 (R Foundation, Vienna, Austria), a data-analysis language suitable for use in regulated environments (Institute for Statistics and Mathematics 2018). Analyses were conducted via NONMEM version 7.5. For simulations, mrgsolve was used to combine all individual models and incorporate the dynamic dose reduction procedure [ 30 Results Patients and grade ≥ 2 OAE frequencies Details on the 757 patients in the analysis population are included in Supplementary Table 1 n n n n n 1 2 2 OAE model development Base model structure was initially considered as a three-state OAE model (grade ≤ 1, 2, and 3 OAE events). However, quantification of standard errors of parameter estimates (i.e., convergence of the covariance step) was generally problematic due to low grade 3 OAE rates (models 1 to 5); as a result, the model was simplified to a two-state model (grades ≤ 1 and ≥ 2; Supplementary Table 3 max e e max e e 1 Table 1 AIC and objective model function Model number Description Objective function AIC 1102_1 Base model: two-state; effect compartment, E max 5638.663 5650.663 1102_3 Two-state: effect compartment, E max 5594.443 5608.443 40073 Final model: E max 5499.285 5525.285 AIC ADC E max IIV MMAE Model development proceeded with the addition of covariate effects and testing of IIV on the exposure-dependent log odds of event through E max 3 1 e 2 Table 2 Final model parameter estimates for OAEs (fixed effects) Estimate 95% CI Structural model parameters \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\beta }_{01}^{0}$$\\end{document} exp( θ / θ Probability of transition to grade ≥ 2 event from grade ≤ 1 0.000209 0.000107–0.000408 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\beta }_{11}^{0}$$\\end{document} exp( θ / θ Probability of staying in state 2+ from grade ≥ 2 0.963 0.950–0.972 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\beta }_{1}^{ADC}$$\\end{document} θ E max e 11.7 5.45–17.9 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${k}_{e,TV}^{ADC}$$\\end{document} exp( θ ADC effect compartment rate constant 0.0389 0.0313–0.0484 ζ 11 θ Nonproportionality adjustment for ADC e 0.215 0.112–0.318 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\beta }_{3}^{ADC}$$\\end{document} θ Hill parameter for ADC e 1.00 FIXED \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\beta }_{2}^{ADC}$$\\end{document} θ EC50 for ADC e 4.91 0.158–9.66 Covariate effect parameters γ θ ADC e 1.25 0.901–1.59 γ θ ADC e 0.920 0.710–1.13 γ θ ADC e 1.07 0.887–1.25 γ θ ADC e 0.887 0.518–1.26 γ θ ADC e 1.36 0.747–1.97 γ θ ADC e 0.685 0.581–0.789 Final model: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$logit\\left[P\\left({OAE}_{i,j}\\ge 2|OA{E}_{i,j-1}\\le 1\\right)\\right]={\\beta }_{01}^{0}+\\frac{{\\beta }_{1}^{ADC}{ADCe}_{i,j}}{{\\beta }_{2}^{ADC}+{ADCe}_{i,j}}\\times \\prod_{P=1}^{P}{\\gamma }_{P}^{{X}_{i,P}}\\times {e}^{{\\eta }_{i}}$$\\end{document} and \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$logit\\left[P\\left({OAE}_{i,j}\\ge 2|OA{E}_{i,j-1}\\ge 2\\right)\\right]={\\beta }_{m11}^{0}+\\frac{{\\beta }_{1}^{ADC}{ADCe}_{i,j}}{{\\beta }_{2}^{ADC}+{ADCe}_{i,j}}\\times \\prod_{P=1}^{P}{\\gamma }_{P}^{{X}_{i,P}}\\times {e}^{{\\eta }_{i}}\\times {\\zeta }_{11}$$\\end{document} Parameters estimated in the log-domain were back-transformed for clarity. CIs = estimate ± 1.96 · SE ADC ADC e max The exposure effects for 0.9 mg/kg 3Q4W, 1.2 mg/kg 3Q4W, and 2.0 mg/kg Q3W monotherapy indicated a dose-dependent, delayed-onset effect of exposure on the probability of grade ≥ 2 event occurrence. The exposure effects are included in Supplementary Fig. 4 3 Fig. 3 Covariate effect. Mean and 90% CI of indicated effect as a proportional effect (relative to the reference patient) on the total exposure effect on the log-odds of transition. The reference patient, who was treated with TV monotherapy, was studied prior to the ECP and had no baseline ocular events or baseline dry eye events. ECP, eye care plan; Q3W, every 3 weeks; TV, tisotumab vedotin Time-to-event model development The time-to-dose-reduction model was an exponential survival model in which the ADC exposure entered linearly after passing through two transit compartments accounting for the delay–exposure effect. A decreased hazard after the first dose reduction was identified, as was decreased hazard in ovarian cancers relative to cervical cancers and in patients studied after introduction of the ECP. A decrease in hazard for patients with Eastern Cooperative Oncology Group status > 0 was also identified. Parameter estimates are included in Supplementary Table 5 The Kaplan–Meier plot for observed data of discontinuation due to AE showed that patients treated with TV monotherapy appeared to have a more rapid time course of discontinuation due to AE, compared with those who received combination therapies (Supplementary Fig. 6 7 Model evaluation VPCs were used as the primary model-evaluation tool. Model evaluation plots by covariate are shown in Supplementary Fig. 8 4 4 5 Fig. 4 OAE final model evaluation: (a) VPC of transition counts by regimens; (b) VPC of longitudinal rate of grade ≥ 2 events in monotherapy and combination regimens. (a) Box width indicates the observed frequency of transitions and points. Bars represent the predicted mean and 95% PI. VPCs were calculated conditional on observed covariates, dosing, and censoring times. (b) The red lines indicate observed probability. The black lines and shaded gray regions indicate the simulated mean and 95% PI. VPCs were calculated conditional on observed covariates, dosing, and censoring times. VPCs for dosing regiments with less than 20 patients were not presented. 3Q4W, days 1, 8, and 15 of a 28-day cycle; Gr, grade; Q3W, every 3 weeks; VPC, visual predictive check Fig. 5 Time-to-event of first grade ≥ 2 OAE. Time course data are plotted by treatment week. 3Q4W, days 1, 8, and 15 of a 28-day cycle; mono, monotherapy; OAE, ocular adverse event; pembro, pembrolizumab; PI, prediction interval; Q3W, every 3 weeks; TV tisotumab vedotin Model application Regimens of interest for non-cervical tumors were simulated using the final dose reduction, discontinuations due to AE, progression, and OAE models. At 13 weeks, approximately 13% of patients in all regimens were predicted to be experiencing grade ≥ 2 OAEs. After 13 weeks, a higher probability of dose reductions in the combination therapies resulted in a lowering of the OAE rate in those patients remaining on treatment (Supplementary Tables 9 10 6 6 11 Fig. 6 Combined simulations: predicted OAE in noncervical cancers. The solid red line and shaded regions represent the median predicted probability of OAE of Grade ≥ 2 with 50%, and 90% prediction intervals. The dashed blue line, which corresponds to a probability of a Grade ≥ 2 OAE of 0.25, is added as a reference line to facilitate visualization of the comparison of predicted OAE profiles at alternative dosing regimens. 1q2w, every 2 weeks; 1q3w, every 3 weeks; mono, monotherapy; OAE, ocular adverse event; pembro, pembrolizumab; PI, prediction interval; Q3W, every 3 weeks; TV, tisotumab vedotin Discussion Dose optimization is a continuously evolving effort and plays a critical role in drug development [ 31 32 5 Ongoing dose evaluation of alternate regimens in the innovaTV 207 study demonstrated encouraging antitumor activity with a 1.7 mg/kg Q2W TV dosing regimen, with results demonstrating a confirmed objective response rate of 40% in patients with previously treated recurrent or metastatic head and neck squamous cell carcinoma (second- and third-line subgroups), while maintaining an manageable safety profile [ 19 15 50 18 The present analyses described the longitudinal time course of grade ≥ 2 OAEs in TV clinical trials, as well as the time-course of dose reductions and treatment discontinuation due to AEs or disease progression. The established models were then applied to simulate the occurrence of OAEs over time with alternative dosing regimens (Q2W) in noncervical cancer and compare the result with observations with the approved regimen of 2.0 mg/kg Q3W. As shown in the observed OAE profile, the maximal percentage of patients experiencing grade ≥ 2 OAEs was reached at approximately 8 weeks after treatment started (Supplementary Fig. 2 4 2 3 Among all evaluated covariates, only the ECP had a significant effect on reducing the relative risk of OAEs. When TV was combined with pembrolizumab for which OAEs have been reported [ 33 3 34 5 6 Some limitations were noted in this analysis. Among the seven clinical studies included in the analysis, none were specifically designed or powered to detect differences in grade ≥ 2 OAEs between dosing regimens. As such, it was not feasible to apply rigorous statistical criteria or formal hypothesis testing within the scope of this analysis; this analysis is instead exploratory in nature. Additionally, exposures used in modeling were collected in a setting in which protocol-specified dose reductions due to safety events have occurred. While OAEs are one mechanism that can cause dose reductions, there are others as well: exploratory analyses suggested that at most, half of the dose reductions occur due to OAEs (Table S5 Furthermore, the implementation of the ECP was modeled as a covariate effect on the overall hazard or odds of event, which is a simplification of its impact on the risk of OAEs. When simulating patient outcomes, dose delays and interruptions as well as maximum dose holding period allowed per study protocols were not accounted for. Indeed, considering the dose-reduction process as multi-state (i.e., no reductions, holding dose, first reduction, second reduction) could have better reflected the actual ECP practice but only with substantial additional model development. Another apparent bias was the overprediction of the total number of patients who would have at least one grade ≥ 2 OAE, an effect that was apparent in the time-to-first OAE VPCs with the 2.0 mg/kg Q3W monotherapy regimen. Although the number of patients who had a grade ≥ 2 OAE at any point in the study was not presented as an output from the combined simulations, and the overall incidence across patients remaining under observation appeared to have been accurately modeled, predictions of the number of patients who would (at some point) have a grade ≥ 2 OAE may have been artificially high and should be interpreted conservatively. The overprediction noted here is possibly a result of the censoring mechanism in the predictive checks. As the predictive checks were performed conditional on observed censoring, virtual patients may remain under observation longer than they would in actual trial scenarios, increasing the likelihood of observing an OAE. Another limitation in this analysis was that, across studies, end dates of OAEs were missing in approximately 20–30% of the recorded events. These were assumed to be missing at random within the studies and were imputed at the study median durations. A more complex missing mechanism (i.e., missing not at random) may imply bias in the predicted durations of events. For the purposes of this analysis, however, the identification of the concentration-driven onset and frequency of OAEs was of principal concern. The direct and indirect effects of MMAE exposure were also assessed, and as observed in the previous E-R analysis [ 16 35 Conclusions This Markov model explored the occurrence, severity, and duration of OAEs across seven TV clinical studies and supports the use of an alternative to existing E-R approaches to assessing the risk of OAEs with exposure to ADC and MMAE. Of the multiple covariates modeled, results indicated that implementation of the ECP significantly reduced the risk of grade ≥ 2 OAEs, whereas other covariates did not lead to a statistically significant reduction of risk. The alternate TV dosing regimen of 1.7 mg/kg Q2W explored in the current analysis is being evaluated clinically in the ongoing innovaTV 207 clinical trial to further establish how this impacts the benefit:risk profile. Supplementary Information Below is the link to the electronic supplementary material. Supplementary file1 (DOCX 686 KB) Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements This study was sponsored by Seagen Inc. (acquired by Pfizer in December 2023) and Genmab, the codevelopers of tisotumab vedotin. The authors would like to thank all patients who participated in the TV clinical studies and their families. The authors also thank Leonardo Nicacio for review of the manuscript. Medical writing assistance funded by Pfizer according to Good Publication Practice guidelines was provided by Uzezi Cedras, MSc, Martina Kusi-Mensah, PharmD, Melissa Ward, BA (all of Scion, London, UK) and Blaise Low, PhD (Nucleus Global, an Inizio Company). The sponsor was involved in the study design and collection, analysis, and interpretation of data, as well as data checking of information provided in the manuscript. However, ultimate responsibility for opinions, conclusions, and data interpretation lies with the authors. Author contributions RG, JV, DP, SF, CP, MG, and IS conceptualized the study, RG, DP, SF, and CO developed the study methodology, DP contributed to the study investigation, project administration, software programming, and validated, analyzed, curated, and visualized the data, DP and AG provided the study resources, RG, JV, WDH, SF, CP, and A-SC supervised the study, DP, SF, and RG drafted the manuscript, and all authors reviewed and edited the manuscript. Funding This study was funded by Genmab (Copenhagen, Denmark) and Pfizer Inc. Data and/or code availability Metrum Research Group performed validation of the code and data related to these analyses, and both are stored in version-controlled repositories on redundant storage. Upon request and subject to review, Pfizer will provide the data that support the findings of this study. Subject to certain criteria, conditions, and exceptions, Pfizer may also provide access to the related individual de-identified participant data. See https://www.pfizer.com/science/clinical-trials/trial-data-and-results Declarations Ethics approval All clinical studies were conducted in accordance with good clinical practice guidelines from the International Council for Harmonization of Technical Requirements for Pharmaceuticals for Human Use and the principles of the Declaration of Helsinki. Protocols were approved by relevant regulatory and independent ethics committees. Competing interests SF, AG, IS, and MG report employment and stocks or stock options with Genmab US Inc. RG, JV, CO, and A-SC report employment and stocks or stock options with Pfizer Inc. CP reports employment and stocks or stock options with Genmab US Inc. and grants, consulting fees, and honoraria from Metrum LLC. DP reports employment with Metrum Research Group. WDH reports employment with BeiGene and former employment and stock options with Seagen at the time of study. References 1. Breij EC de Goeij BE Verploegen S Schuurhuis DH Amirkhosravi A Francis J Miller VB Houtkamp M Bleeker WK Satijn D Parren PW An antibody-drug conjugate that targets tissue factor exhibits potent therapeutic activity against a broad range of solid tumors Cancer Res 2014 74 4 1214 1226 10.1158/0008-5472.CAN-13-2440 24371232 Breij EC, de Goeij BE, Verploegen S, Schuurhuis DH, Amirkhosravi A, Francis J, Miller VB, Houtkamp M, Bleeker WK, Satijn D, Parren PW (2014) An antibody-drug conjugate that targets tissue factor exhibits potent therapeutic activity against a broad range of solid tumors. Cancer Res 74(4):1214–1226. 10.1158/0008-5472.CAN-13-2440 24371232 10.1158/0008-5472.CAN-13-2440 2. de Goeij BE Satijn D Freitag CM Wubbolts R Bleeker WK Khasanov A Zhu T Chen G Miao D van Berkel PH Parren PW High turnover of tissue factor enables efficient intracellular delivery of antibody-drug conjugates Mol Cancer Ther 2015 14 5 1130 1140 10.1158/1535-7163.MCT-14-0798 25724665 de Goeij BE, Satijn D, Freitag CM, Wubbolts R, Bleeker WK, Khasanov A, Zhu T, Chen G, Miao D, van Berkel PH, Parren PW (2015) High turnover of tissue factor enables efficient intracellular delivery of antibody-drug conjugates. Mol Cancer Ther 14(5):1130–1140. 10.1158/1535-7163.MCT-14-0798 25724665 10.1158/1535-7163.MCT-14-0798 3. Alley SC Harris JR Cao A van den Heuvel EG Velayudhan J Satijn D Verploegen S Dominguez T Breij EC Abstract 221: tisotumab vedotin induces anti-tumor activity through MMAE-mediated, Fc-mediated, and Fab-mediated effector functions in vitro Cancer Res 2019 79 suppl 13 221 221 10.1158/1538-7445.AM2019-221 Alley SC, Harris JR, Cao A, van den Heuvel EG, Velayudhan J, Satijn D, Verploegen S, Dominguez T, Breij EC (2019) Abstract 221: tisotumab vedotin induces anti-tumor activity through MMAE-mediated, Fc-mediated, and Fab-mediated effector functions in vitro 4. Seagen Inc (2024) TIVDAK (tisotumab vedotin). Prescribing information. https://labeling.pfizer.com/ShowLabeling.aspx?id=20632 5. Coleman RL Lorusso D Gennigens C Gonzalez-Martin A Randall L Cibula D Lund B Woelber L Pignata S Forget F Redondo A Vindelov SD Chen M Harris JR Smith M Nicacio LV Teng MSL Laenen A Rangwala R Manso L Mirza M Monk BJ Vergote I innovaTV 204/GOG-3023/ENGOT-cx6 Collaborators Efficacy and safety of tisotumab vedotin in previously treated recurrent or metastatic cervical cancer (innovaTV 204/GOG-3023/ENGOT-cx6): a multicentre, open-label, single-arm, phase 2 study Lancet Oncol 2021 22 5 609 619 10.1016/S1470-2045(21)00056-5 33845034 Coleman RL, Lorusso D, Gennigens C, Gonzalez-Martin A, Randall L, Cibula D, Lund B, Woelber L, Pignata S, Forget F, Redondo A, Vindelov SD, Chen M, Harris JR, Smith M, Nicacio LV, Teng MSL, Laenen A, Rangwala R, Manso L, Mirza M, Monk BJ, Vergote I, innovaTV 204/GOG-3023/ENGOT-cx6 Collaborators (2021) Efficacy and safety of tisotumab vedotin in previously treated recurrent or metastatic cervical cancer (innovaTV 204/GOG-3023/ENGOT-cx6): a multicentre, open-label, single-arm, phase 2 study. Lancet Oncol 22(5):609–619. 10.1016/S1470-2045(21)00056-5 33845034 10.1016/S1470-2045(21)00056-5 6. ClinicalTrials.gov (2018) Efficacy and safety study of tisotumab vedotin for patients with solid tumors (innovaTV 207). https://www.clinicaltrials.gov/ct2/show/NCT03485209 7. Dominguez-Llamas S Caro-Magdaleno M Mataix-Albert B Aviles-Prieto J Romero-Barranca I Rodriguez-de-la-Rua E Adverse events of antibody-drug conjugates on the ocular surface in cancer therapy Clin Transl Oncol 2023 25 11 3086 3100 10.1007/s12094-023-03261-y 37454027 PMC10514170 Dominguez-Llamas S, Caro-Magdaleno M, Mataix-Albert B, Aviles-Prieto J, Romero-Barranca I, Rodriguez-de-la-Rua E (2023) Adverse events of antibody-drug conjugates on the ocular surface in cancer therapy. Clin Transl Oncol 25(11):3086–3100. 10.1007/s12094-023-03261-y 37454027 10.1007/s12094-023-03261-y PMC10514170 8. Eaton JS Miller PE Mannis MJ Murphy CJ Ocular adverse events associated with antibody-drug conjugates in human clinical trials J Ocul Pharmacol Ther 2015 31 10 589 604 10.1089/jop.2015.0064 26539624 PMC4677113 Eaton JS, Miller PE, Mannis MJ, Murphy CJ (2015) Ocular adverse events associated with antibody-drug conjugates in human clinical trials. J Ocul Pharmacol Ther 31(10):589–604. 10.1089/jop.2015.0064 26539624 10.1089/jop.2015.0064 PMC4677113 9. Förster Y Meye A Albrecht S Schwenzer B Tissue factor and tumor: clinical and laboratory aspects Clin Chim Acta 2006 364 1–2 12 21 10.1016/j.cca.2005.05.018 16139825 Förster Y, Meye A, Albrecht S, Schwenzer B (2006) Tissue factor and tumor: clinical and laboratory aspects. Clin Chim Acta 364(1–2):12–21. 10.1016/j.cca.2005.05.018 16139825 10.1016/j.cca.2005.05.018 10. Patry G Hovington H Larue H Harel F Fradet Y Lacombe L Tissue factor expression correlates with disease-specific survival in patients with node-negative muscle-invasive bladder cancer Int J Cancer 2008 122 7 1592 1597 10.1002/ijc.23240 18058798 Patry G, Hovington H, Larue H, Harel F, Fradet Y, Lacombe L (2008) Tissue factor expression correlates with disease-specific survival in patients with node-negative muscle-invasive bladder cancer. Int J Cancer 122(7):1592–1597. 10.1002/ijc.23240 18058798 10.1002/ijc.23240 11. van den Berg YW Osanto S Reitsma PH Versteeg HH The relationship between tissue factor and cancer progression: insights from bench and bedside Blood 2012 119 4 924 932 10.1182/blood-2011-06-317685 22065595 van den Berg YW, Osanto S, Reitsma PH, Versteeg HH (2012) The relationship between tissue factor and cancer progression: insights from bench and bedside. Blood 119(4):924–932. 10.1182/blood-2011-06-317685 22065595 10.1182/blood-2011-06-317685 12. Lwaleed BA Cooper AJ Voegeli D Getliffe K Tissue factor: a critical role in inflammation and cancer Biol Res Nurs 2007 9 2 97 107 10.1177/1099800407305733 17909162 Lwaleed BA, Cooper AJ, Voegeli D, Getliffe K (2007) Tissue factor: a critical role in inflammation and cancer. Biol Res Nurs 9(2):97–107. 10.1177/1099800407305733 17909162 10.1177/1099800407305733 13. Butenas S Tissue factor structure and function Scientifica 2012 2012 964862 10.6064/2012/964862 24278763 PMC3820524 Butenas S (2012) Tissue factor structure and function. Scientifica 2012:964862. 10.6064/2012/964862 24278763 10.6064/2012/964862 PMC3820524 14. Hong DS Concin N Vergote I de Bono JS Slomovitz BM Drew Y Arkenau HT Machiels JP Spicer JF Jones R Forster MD Cornez N Gennigens C Johnson ML Thistlethwaite FC Rangwala RA Ghatta S Windfeld K Harris JR Lassen UN Coleman RL Tisotumab vedotin in previously treated recurrent or metastatic cervical cancer Clin Cancer Res 2020 26 6 1220 1228 10.1158/1078-0432.CCR-19-2962 31796521 Hong DS, Concin N, Vergote I, de Bono JS, Slomovitz BM, Drew Y, Arkenau HT, Machiels JP, Spicer JF, Jones R, Forster MD, Cornez N, Gennigens C, Johnson ML, Thistlethwaite FC, Rangwala RA, Ghatta S, Windfeld K, Harris JR, Lassen UN, Coleman RL (2020) Tisotumab vedotin in previously treated recurrent or metastatic cervical cancer. Clin Cancer Res 26(6):1220–1228. 10.1158/1078-0432.CCR-19-2962 31796521 10.1158/1078-0432.CCR-19-2962 15. Vergote I González-Martín A Fujiwara K Kalbacher E Bagaméri A Ghamande S Lee J-Y Banerjee S Maluf FC Lorusso D Yonemori K Nieuwenhuysen EV Manso L Woelber L Westermann A Covens A Hasegawa K Kim B-G Raimondo M Bjurberg M Cruz FM Angelergues A Cibula D Barraclough L Oaknin A Gennigens C Nicacio L Teng MSL Whalley E Soumaoro I Slomovitz BM Tisotumab vedotin as second- or third-line therapy for recurrent cervical cancer N Engl J Med 2024 391 1 44 55 10.1056/NEJMoa2313811 38959480 Vergote I, González-Martín A, Fujiwara K, Kalbacher E, Bagaméri A, Ghamande S, Lee J-Y, Banerjee S, Maluf FC, Lorusso D, Yonemori K, Nieuwenhuysen EV, Manso L, Woelber L, Westermann A, Covens A, Hasegawa K, Kim B-G, Raimondo M, Bjurberg M, Cruz FM, Angelergues A, Cibula D, Barraclough L, Oaknin A, Gennigens C, Nicacio L, Teng MSL, Whalley E, Soumaoro I, Slomovitz BM (2024) Tisotumab vedotin as second- or third-line therapy for recurrent cervical cancer. N Engl J Med 391(1):44–55. 10.1056/NEJMoa2313811 38959480 10.1056/NEJMoa2313811 16. Passey C Voellinger J Gibiansky L Gunawan R Nicacio L Soumaoro I Hanley WD Winter H Gupta M Exposure-safety and exposure-efficacy analyses for tisotumab vedotin for patients with locally advanced or metastatic solid tumors CPT Pharmacometrics Syst Pharmacol 2023 12 9 1262 1273 10.1002/psp4.13007 37496366 PMC10508544 Passey C, Voellinger J, Gibiansky L, Gunawan R, Nicacio L, Soumaoro I, Hanley WD, Winter H, Gupta M (2023) Exposure-safety and exposure-efficacy analyses for tisotumab vedotin for patients with locally advanced or metastatic solid tumors. CPT Pharmacometrics Syst Pharmacol 12(9):1262–1273. 10.1002/psp4.13007 37496366 10.1002/psp4.13007 PMC10508544 17. Hong DS Birnbaum A Steuer C Taylor M George TJ Lacy J Wang B Beca F Nicacio L Soumaoro I Cho M Efficacy and safety of Tisotumab vedotin in patients with head and neck squamous cell carcinoma: results from a phase II cohort Int J Radiat Oncol Biol Phys 2022 112 5 e10 e11 10.1016/j.ijrobp.2021.12.028 Hong DS, Birnbaum A, Steuer C, Taylor M, George TJ, Lacy J, Wang B, Beca F, Nicacio L, Soumaoro I, Cho M (2022) Efficacy and safety of tisotumab vedotin in patients with head and neck squamous cell carcinoma: results from a phase II cohort. Int J Radiat Oncol Biol Phys 112(5):e10–e11. 10.1016/j.ijrobp.2021.12.028 18. Voellinger J Passey C Feng YS Gunawan R Gibiansky L Polhamus D Gerritsen A O'Day C Nicacio L Soumaoro I Gupta M Hanley W 5P tisotumab vedotin (TV) dose schedule optimization in non-cervical populations ESMO Open 2023 8 1 100971 10.1016/j.esmoop.2023.100971 Voellinger J, Passey C, Feng YS, Gunawan R, Gibiansky L, Polhamus D, Gerritsen A, O’Day C, Nicacio L, Soumaoro I, Gupta M, Hanley W (2023) 5P tisotumab vedotin (TV) dose schedule optimization in non-cervical populations. ESMO Open 8(1):100971. 10.1016/j.esmoop.2023.100971 19. Sun L Fayette J Salas S Hong DS Adkins D Dunn L Ciardiello F Cirauqui B William WNJ Saba NF Chung CH Birnbaum AE Zandberg DP Wehr A Nicacio LV Soumaoro I Carret A-S Seiwert TY Tisotumab vedotin in head and neck squamous cell carcinoma: updated analysis from innovaTV 207 part C J Clin Oncol 2024 42 suppl 16 6012 10.1200/JCO.2024.42.16_suppl.6012 Sun L, Fayette J, Salas S, Hong DS, Adkins D, Dunn L, Ciardiello F, Cirauqui B, William WNJ, Saba NF, Chung CH, Birnbaum AE, Zandberg DP, Wehr A, Nicacio LV, Soumaoro I, Carret A-S, Seiwert TY (2024) Tisotumab vedotin in head and neck squamous cell carcinoma: updated analysis from innovaTV 207 part C. J Clin Oncol 42(suppl 16):6012. 10.1200/JCO.2024.42.16_suppl.6012 20. ClinicalTrials.gov (2015) Tisotumab vedotin (HuMax ® https://clinicaltrials.gov/study/NCT02552121 21. ClinicalTrials.gov (2018) Safety and efficacy of tisotumab vedotin monotherapy & in combination with other cancer agents in subjects with cervical cancer (innovaTV 205). https://clinicaltrials.gov/study/NCT03786081 22. ClinicalTrials.gov (2019) A trial of tisotumab vedotin In Japanese subjects with advanced solid malignancies (innovaTV 206). https://clinicaltrials.gov/study/NCT03913741 23. ClinicalTrials.gov (2018) A study of weekly tisotumab vedotin for patients with platinum-resistant ovarian cancer with safety run-in (innovaTV 208). https://clinicaltrials.gov/study/NCT03657043 24. Gibiansky L Passey C Voellinger J Gunawan R Hanley WD Gupta M Winter H Population pharmacokinetic analysis for tisotumab vedotin in patients with locally advanced and/or metastatic solid tumors CPT Pharmacometrics Syst Pharmacol 2022 11 10 1358 1370 10.1002/psp4.12850 35932175 PMC9574719 Gibiansky L, Passey C, Voellinger J, Gunawan R, Hanley WD, Gupta M, Winter H (2022) Population pharmacokinetic analysis for tisotumab vedotin in patients with locally advanced and/or metastatic solid tumors. CPT Pharmacometrics Syst Pharmacol 11(10):1358–1370. 10.1002/psp4.12850 35932175 10.1002/psp4.12850 PMC9574719 25. Lu T Yang Y Jin JY Kagedal M Analysis of longitudinal-ordered categorical data for muscle spasm adverse event of vismodegib: comparison between different pharmacometric models CPT Pharmacometrics Syst Pharmacol 2020 9 2 96 105 10.1002/psp4.12487 31877239 PMC7020275 Lu T, Yang Y, Jin JY, Kagedal M (2020) Analysis of longitudinal-ordered categorical data for muscle spasm adverse event of vismodegib: comparison between different pharmacometric models. CPT Pharmacometrics Syst Pharmacol 9(2):96–105. 10.1002/psp4.12487 31877239 10.1002/psp4.12487 PMC7020275 26. Karlsson MO Schoemaker RC Kemp B Cohen AF van Gerven JM Tuk B Peck CC Danhof M A pharmacodynamic Markov mixed-effects model for the effect of temazepam on sleep Clin Pharmacol Ther 2000 68 2 175 188 10.1067/mcp.2000.108669 10976549 Karlsson MO, Schoemaker RC, Kemp B, Cohen AF, van Gerven JM, Tuk B, Peck CC, Danhof M (2000) A pharmacodynamic Markov mixed-effects model for the effect of temazepam on sleep. Clin Pharmacol Ther 68(2):175–188. 10.1067/mcp.2000.108669 10976549 10.1067/mcp.2000.108669 27. Gastonguay MR (2004) A full model estimation approach for covariate effects: inference based on clinical importance and estimation precision. AAPS 6(S1):W4354. https://www.metrumrg.com/wp-content/uploads/2018/08/aaps_2004_fullmodel.pdf 28. Peterson B Harrell FE Jr. Partial proportional odds models for ordinal response variables J Roy Stat Soc: Ser C (Appl Stat) 1990 39 2 205 217 10.2307/2347760 Peterson B, Harrell FE Jr. (1990) Partial proportional odds models for ordinal response variables. J Roy Stat Soc: Ser C (Appl Stat) 39(2):205–217. 10.2307/2347760 29. Savic RM Jonker DM Kerbusch T Karlsson MO Implementation of a transit compartment model for describing drug absorption in pharmacokinetic studies J Pharmacokinet Pharmacodyn 2007 34 5 711 726 10.1007/s10928-007-9066-0 17653836 Savic RM, Jonker DM, Kerbusch T, Karlsson MO (2007) Implementation of a transit compartment model for describing drug absorption in pharmacokinetic studies. J Pharmacokinet Pharmacodyn 34(5):711–726. 10.1007/s10928-007-9066-0 17653836 10.1007/s10928-007-9066-0 30. Baron K Gastonguay M Simulation from ODE-based population PK/PD and systems pharmacology models in R with mrgsolve J Pharmacokinet Pharmacodyn 2015 42 S84 S85 Baron K, Gastonguay M (2015) Simulation from ODE-based population PK/PD and systems pharmacology models in R with mrgsolve. J Pharmacokinet Pharmacodyn 42:S84–S85 31. Korn EL Moscow JA Freidlin B Dose optimization during drug development: whether and when to optimize J Natl Cancer Inst 2023 115 5 492 497 10.1093/jnci/djac232 36534891 PMC10165487 Korn EL, Moscow JA, Freidlin B (2023) Dose optimization during drug development: whether and when to optimize. J Natl Cancer Inst 115(5):492–497. 10.1093/jnci/djac232 36534891 10.1093/jnci/djac232 PMC10165487 32. Aggarwal D Yang J Salam MA Sengupta S Al-Amin MY Mustafa S Khan MA Huang X Pawar JS Antibody-drug conjugates: the paradigm shifts in the targeted cancer therapy Front Immunol 2023 14 1203073 10.3389/fimmu.2023.1203073 37671162 PMC10475555 Aggarwal D, Yang J, Salam MA, Sengupta S, Al-Amin MY, Mustafa S, Khan MA, Huang X, Pawar JS (2023) Antibody-drug conjugates: the paradigm shifts in the targeted cancer therapy. Front Immunol 14:1203073. 10.3389/fimmu.2023.1203073 37671162 10.3389/fimmu.2023.1203073 PMC10475555 33. KEYTRUDA ® https://www.accessdata.fda.gov/drugsatfda_docs/label/2025/125514s172lbl.pdf 34. Young L Finnigan S Streicher H Chen HX Murray J Sen HN Sharon E Ocular adverse events in PD-1 and PD-L1 inhibitors J Immunother Cancer 2021 9 7 e002119 10.1136/jitc-2020-002119 34226280 PMC8258670 Young L, Finnigan S, Streicher H, Chen HX, Murray J, Sen HN, Sharon E (2021) Ocular adverse events in PD-1 and PD-L1 inhibitors. J Immunother Cancer 9(7):e002119. 10.1136/jitc-2020-002119 34226280 10.1136/jitc-2020-002119 PMC8258670 35. Suri A Mould DR Liu Y Jang G Venkatakrishnan K Population PK and exposure-response relationships for the antibody-drug conjugate brentuximab vedotin in CTCL patients in the phase III ALCANZA study Clin Pharmacol Ther 2018 104 5 989 999 10.1002/cpt.1037 29377077 PMC6220930 Suri A, Mould DR, Liu Y, Jang G, Venkatakrishnan K (2018) Population PK and exposure-response relationships for the antibody-drug conjugate brentuximab vedotin in CTCL patients in the phase III ALCANZA study. Clin Pharmacol Ther 104(5):989–999. 10.1002/cpt.1037 29377077 10.1002/cpt.1037 PMC6220930 36. ClinicalTrials.gov (2018) A trial of tisotumab vedotin in cervical cancer (innovaTV 204). https://clinicaltrials.gov/study/NCT03438396 ",
  "metadata": {
    "Title of this paper": "Population PK and exposure-response relationships for the antibody-drug conjugate brentuximab vedotin in CTCL patients in the phase III ALCANZA study",
    "Journal it was published in:": "Journal of Pharmacokinetics and Pharmacodynamics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494607/"
  }
}