{
  "title": "Paper_818",
  "abstract": "pmc Wiley Interdiscip Rev RNA Wiley Interdiscip Rev RNA 379 blackwellopen WRNA Wiley Interdisciplinary Reviews. RNA 1757-7004 1757-7012 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12463549 PMC12463549.1 12463549 12463549 40998459 10.1002/wrna.70028 WRNA70028 RNA-1240.R4 1 RNA in Disease Advanced Review Advanced Review  MicroRNAs Zhao Dan https://orcid.org/0000-0002-5120-6725  1  2 dan.zhao@bcm.edu Wang Yifei  1   1 Section of Epidemiology and Population Sciences, Department of Medicine Baylor College of Medicine Houston Texas USA   2 Dan L Duncan Comprehensive Cancer Center, Baylor College of Medicine Houston Texas USA * Correspondence: dan.zhao@bcm.edu 25 9 2025 Sep-Oct 2025 16 5 497540 10.1002/wrna.v16.5 e70028 14 9 2025 23 4 2025 16 9 2025 26 09 2025 27 09 2025 27 09 2025 © 2025 The Author(s). WIREs RNA https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Cancer remains one of the leading causes of death worldwide. Despite various efforts to reduce cancer mortality, such as decreasing tobacco use, improving early detection and prevention methods, and enhancing cancer care and treatments, certain racial and ethnic groups continue to experience higher cancer incidence and mortality rates, along with shorter survival compared to other groups. Several factors, including socioeconomic status, environmental influences, diet, and behavior, contribute to these racial disparities. More importantly, scientists have identified a genetic basis for these observations, with a growing body of research highlighting microRNAs as significant players in cancer racial disparities. This review focuses on various types of microRNAs (such as epigenetically regulated, copy number altered, circulating, and exosomal) and microRNA single‐nucleotide variations in the context of cancer‐related racial disparities. Additionally, we have summarized the existing resources, including racial‐specific model cell lines and cancer cohorts that include patients from diverse racial and ethnic backgrounds. Moreover, we provide here several key things to consider for future investigations. While many challenges remain, we aim to offer a balanced overview of this field to help scientists with varying expertise address these issues. This article is categorized under: RNA in Disease and Development > RNA in Disease MicroRNAs and cancer racial disparities. Race/ethnicity‐specific regulation of microRNAs at multiple levels (epigenetics, copy number, single‐nucleotide polymorphisms, and circulating or exosome secretion) provides a genetic basis for cancer racial disparities. cancer racial disparities microRNAs miR genetic variations pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September/October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:25.09.2025  Editor‐in‐Chief: 1 Introduction 1.1 Overview of Cancer Racial Disparities Cancer is the second leading cause of death worldwide, with an estimated 18.1 million new cases and 9.6 million cancer‐related deaths in 2018. The burden on individuals, families, and society is immense, with the annual economic cost of cancer reaching US$1.16 trillion (Wild et al. 2020 It is widely accepted that cancer racial disparity is a multifactorial issue, influenced by a combination of factors such as socioeconomic status, culture, environmental influences, behavior, and access to early detection, prevention screenings, and treatment. However, studies have also clearly shown a genetic component for some types of cancer. For example, certain cancer‐causing genetic mutations are more prevalent in AAs compared to CAs, and some genes are specifically overexpressed in AAs (Daly and Olopade 2015 2017 2011 1.2 There Is a Lack of Available Resources for Cancer Racial Disparity Research While epidemiological evidence is clear for cancer racial disparities, the knowledge of its causes is still emerging. Researchers face the challenge of limited resources to study racial disparities in human cancers. As summarized in Table 1 2019 2019 2012 2013 2 TABLE 1 Cancer cell lines from different racial/ethnic backgrounds. Cancer tissue origin African/Black Caucasian/White Undefined Lines of other ethnicities Adrenal gland NA 1 NA NA Autonomic ganglia NA 11 26 2 Japanese Biliary tract NA 1 9 2 Japanese Bone 1 20 34 1 Turkish and 5 Japanese Breast 9 39 11 1 French, 1 Indian, 2 Japanese, and 1 Hispanic Cervix 1 7 3 1 Mongoloid and 3 Japanese CNS 1 18 57 3 Japanese and 6 Mongoloid Endometrium NA 7 4 16 Japanese and 2 Mongoloid Hematopoietic and lymphoid 11 61 141 1 American and 36 Japanese Kidney NA 12 29 9 Japanese, 1 Chinese, and 2 Mongoloid Large intestine NA 30 25 1 American Indian, 3 Asian, 1 Japanese, and 9 Mongoloid Liver 1 3 6 9 Japanese, 4 Korean, and 3 Mongoloid Lung 13 113 83 21 Japanese Esophagus 1 6 17 1 Asian and 13 Japanese Ovary 1 11 33 16 Japanese and 3 Mongoloid Pancreas NA 21 14 11 Japanese and 3 Mongoloid Placenta NA 1 NA NA Pleura NA 6 20 1 Japanese Prostate 1 6 2 1 Japanese Salivary gland NA 1 NA 1 Mongoloid Skin NA 28 51 1 Asian, 1 European, and 4 Japanese Small intestine NA 1 NA NA Soft tissue 1 13 9 2 Japanese Stomach NA 2 12 1 Asian, 1 Hispanic, 18 Japanese, 3 Korean, and 6 Mongoloid Testis NA 1 NA 2 Japanese Thyroid NA 3 10 1 Chinese and 4 Japanese Upper aerodigestive tract NA 14 28 8 Japanese and 7 Mongoloid Urinary tract 2 11 12 1 Chinese and 1 Japanese Vulva NA 2 1 NA  Note: Abbreviation: NA, not available. TABLE 2 Number of cancer patients from different racial/ethnic backgrounds in TCGA. Cancer type Number of NHW Number of NHB Number of Asia Number of Hispanic or Latino Breast cancer 651 166 60 38 Non‐small cell lung cancer 588 80 17 15 Glioma 424 16 7 32 Melanoma 411 1 10 10 Head and neck cancer 405 42 11 26 Bladder cancer 308 17 43 9 Renal clear cell carcinoma 291 49 8 25 Endometrial cancer 277 74 20 15 Colorectal cancer 276 56 12 5 Thyroid cancer 270 26 52 38 Esophagogastric cancer 267 10 135 11 Ovarian epithelial tumor 229 10 17 7 Renal non‐clear cell carcinoma 201 58 8 16 Glioblastoma 194 27 4 6 Sarcoma 193 18 6 5 Hepatobiliary cancer 158 17 160 17 Prostate cancer 144 6 2 0 Cervical cancer 127 17 20 23 Pancreatic cancer 126 7 11 5 Pheochromocytoma 94 13 5 5 Thymic epithelial tumor 81 6 13 9 Pleural mesothelioma 71 1 1 0 Non‐seminomatous germ cell tumor 54 1 1 7 Seminoma 48 2 3 5 Adrenocortical carcinoma 38 0 2 8 Cholangiocarcinoma 28 2 3 2 Miscellaneous neuroepithelial tumor 19 6 1 0 Mature B‐cell neoplasms 17 1 18 12  Note: Abbreviations: NHB, non‐Hispanic Black; NHW, non‐Hispanic White. 1.3  microRNAs MicroRNAs are small noncoding RNAs, approximately 20 nucleotides long, that are derived from primary transcripts and processed canonically through a two‐step cleavage by the enzyme complexes Drosha and Dicer. The first step, known as cropping, produces stem‐loop‐structured precursor microRNAs. These precursors, or pre‐miRNAs, are then further cleaved by the enzyme Dicer in a process called dicing, resulting in mature microRNAs. Atypically, microRNA biogenesis happened independently of Dicer or Drosha (O'Brien et al. 2018 2023 Since the discovery of the first microRNA in 1993, the number of identified microRNAs has dramatically increased over the past two decades. According to the most recent miRBase release (V22.1), there are currently 1917 precursor and 2654 mature microRNAs in humans (Kozomara and Griffiths‐Jones 2014 2021 3 4 2020 TABLE 3 MicroRNAs and cancer racial disparities. Category MIRNA ID Cancer type Race/ethnicity Source Country study done PMID or DOI Copy number altered microRNAs  MIR4288 PC AA and CA 74 TN pairs of PC including 39 AA and 21 CA USA 30874288 (Bhagirath et al. 2019  MIR342 TNBC AA and CA 259 breast tumors USA 21264507 (Loo et al. 2011  MIR151 PC AA Total of 37 patients USA 21456068 (Barnabas et al. 2011  Multiple TNBC AA and NHW 27 AA TNBC and 30 NHW TNBC USA 27813494 (Sugita et al. 2016  MIR34B PC AA and CA 81 AA and 62 CA, methylation data from TCGA USA 28039468 (Shiina et al. 2017 Epigenetically regulated microRNAs  MIR24 PC AA and CA 81 AA and 51 CA patients USA 28157714 (Hashimoto et al. 2017  9 MIRs CRC AA and CA 6 AA TN pair and 7 CA TN pair USA 27111221 (Wang et al. 2016  MIR152 PC AA and CA 5 CA and 6 AA lines; 20 AA and 19 CA patients USA 25004396 (Theodore et al. 2014  MIR34B PC AA and CA 81 AA and 62 CA, methylation data from TCGA USA 28039468 (Shiina et al. 2017 Circulating or exosomal microRNAs miR‐125b, miR‐155, and miR‐3613 PC AA and CA Both cell lines and patients' samples, N not specified USA  https://doi.org/10.1158/1538‐7445.AM2016‐1775 2016 miR‐21 Multiple Asian and Caucasian Meta‐analysis of 36 studies on 15 cancer types involving 2920 cases and 1986 controls China 25527152 (Wu et al. 2015 miR‐101 PC AA and CA Serum of 12 normal AA vs. 24 AA PC and 20 normal CA vs. 16 CA PCs USA 24477576 (Srivastava et al. 2014 miR‐1304‐3p BC AA and CA 19 AA and 20 CA serum USA 36517516 (Zhao et al. 2022 miR‐510‐5p BC AA and CA 9 AA and 10 CA serum USA 37822942 (King et al. 2023 Multiple OC NHW and others 1220 non‐Hispanic Whites vs. 366 others USA 38388186 (Alimena et al. 2024 Multiple Early‐stage BC AA and CA 10 CA and 10 AA tumor and normal plasma samples USA 21060830 (Zhao et al. 2010 Multiple (miR‐155) Early‐stage NSCLC AA and CA Serum and plasma samples from 220 tumor patients (177 CA + 43 AA) and 220 healthy (171 CA + 49 AA) controls USA 21544802 (Heegaard et al. 2012 Other microRNAs Multiple CRC AA and CA 3 AA and 3 CA CRC cell lines USA 30066857 (Paredes et al. 2018  MIR17 Multiple Asian and non‐Asian Meta of 12 studies involving 1096 patients China 29858404 (Huang et al. 2018  MIR181B CRC AA and CA TN pairs from 106 AA and 239 CA patients USA 23719259 (Bovell et al. 2013  MIR182 CRC AA and CA 30 AA and 31 CA patients USA 24865442 (Li et al. 2014 MIR‐200 family Multiple Multiple Meta‐analysis of 28 studies involving 2097 patients and 1579 controls China 26618619 (Liu et al. 2016  MIR200C Leiomyoma Multiple 76 TN pairs USA 22685266 (Chuang et al. 2012  MIR212 PC AA and CA 13 AA and 17 CA cancer tissues USA 26553749 (Y. Yang, Jia, et al. 2016  MIR221 MIR31 PTC AA and CA 14 CA and 8 AA and adjacent normal USA 26380656 (Suresh et al. 2015  MIR29 Multiple Multiple Meta‐analysis of 20 studies involving 1966 patients China 28063172 (Qi et al. 2017  MIR494 Multiple Asian and CA Meta‐analysis of 15 studies of 1104 patients China 29416694 (Xiang et al. 2018  MIR99B PC AA and CA 15 CA and 25 AA and adjacent normal USA 24167554 (Srivastava et al. 2013 Multiple EC Black and White Discovery cohort: 50 (9 B and 41 W), validation cohort: 47 (24 B and 23 W) patients USA 25174797 (Maxwell et al. 2015 Multiple NSCLC AA and EA 42 AA and 55 EA patients USA 29196495 (Mitchell et al. 2017 Multiple Early‐stage BC Lebanese and American 45 Lebanese and 197 matched American BC patients. USA 29203780 (Nassar et al. 2017 Multiple BC British Caucasian, British Black, Nigerian, and Indian A total of 17 patients 5 British Caucasian, 4 each for the other 3 groups UK 29791912 (Pollard et al. 2018 Multiple PC AA and CA TN pairs from 20 AA and 15 CA USA 26089375 (Wang et al. 2015  MIR4719 MIR6756 PC AA and CA lines 1 AA line and 2 CA lines USA 30669553 (Paredes et al. 2018 Multiple EC AA, CA, and Asian 374 CAs, 109 AAs and 20 Asians UK 29682207 (Guttery et al. 2018 Multiple Gynecologic cancers AA and CA 305 AAs and 1402 CAs USA 35992327 (Asare et al. 2022  Note: Abbreviations: AA, African American; CA, Caucasian American; CRC, colorectal cancer; EA, European American; EC, endometrial cancer; NHW, non‐Hispanic White; NSCLC, non‐small cell lung cancer; OC, ovarian cancer; PC, prostate cancer; PTC, papillary thyroid carcinomas; TN, Tumor/Normal; TNBC, triple‐negative breast cancer. TABLE 4 MicroRNA‐related genetic variants in cancer racial disparities. SNVs Cancer type Race/ethnicity studied Racial‐specific effect in Source Country study done PMID MIR targets UTR SNPs rs8176318 in BRCA1 UTR BC AA and EA AA 102 AA and 92 EA patients USA and China 21191178 (Pelletier et al. 2011 2011 2016 rs712 in KRAS UTR Multiple Chinese and Caucasian Chinese Meta‐analysis of 6 studies (5 different types of cancer) involving > 1500 patients and > 2500 healthy controls China 25210463 (Ying et al. 2014 rs34149860 in STAG1 UTR CRC AA AA 95 AA patients USA 29471289 (Datta et al. 2018 rs1131445 at IL16 UTR PC AA and CA AA 256 AA patients and 207 CA patients USA 24061634 (Hughes et al. 2013 MIR SNPs MicroRNAs SNPs Multiple AA and non‐AA (total of 14 populations) AA 69 individuals from 14 populations USA 25169894 (Rawlings‐Goss et al. 2014  MIR146A HCC Turkish No association 222 cancer 222 control Turkey 21807077 (Akkiz et al. 2011c  MIR146A GC Caucasian and Asian Asian Meta‐analyses of 8 case–control studies involving 4308 cases and 6370 controls Sweden 25455160 (Fu et al. 2014  MIR146A CC Chinese Han and Uygur GG/CG genotypes are significantly correlated with Uygur and larger tumors 208 control, 207 cervical intraepithelial neoplasia (CIN), and 205 cervical cancer samples China 26464690 (Ma et al. 2015  MIR146A PC European Caucasian and Asian Asian but not Caucasian Meta‐analysis of 5 studies Japan 30001553 (Mi et al. 2018  MIR146A HCC Multiple Asian but not Caucasian Meta‐analysis of 12 studies including 4171 cases and 4901 controls China 25546664 (Peng et al. 2014  MIR146A HCC Chinese only No association 172 patients and 185 controls China 24301908 (Shan et al. 2013  MIR146A Multiple Asian and Caucasian Caucasian Meta‐analysis of 18 studies (12 Asian cohorts + 8 Caucasian cohorts) involving 9207 cases and 11,453 controls China 22952151 (J. Wang, Wang, et al. 2012  MIR146A MIR196A2 HCC Asian No association with HCC Meta‐analysis of 5 studies China 22768213 (Z. Wang, Cao, et al. 2012  MIR196A2 CRC Iranian Iranian 2150 Iranian patients and meta‐analyses Iran 29802998 (Haerian et al. 2018  MIR196A2 HCC Turkish Turkish 185 TN pair Turkey 21692953 (Akkiz et al. 2011a  MIR196A2 Glioma Chinese Chinese 670 cases and 680 controls China 20229273 (Dou et al. 2010  MIR196A2 BC CA No association 193 bc Australia 21962133 (Jedlinski et al. 2011  MIR196A2 Multiple Multiple Asian Meta of 46 studies involving 20,673 cases and 25,143 controls China 24633889 (Kang et al. 2014  MIR196A2 PC Caucasian and Asian Asian Meta‐analysis of 3 studies Japan 30001553 (Mi et al. 2018  MIR196A2 HCC Multiple No association Meta‐analysis of 12 studies including 4171 cases and 4901 controls China 25546664 (Peng et al. 2014  MIR196A2 Multiple Asian and Caucasian Asian Meta‐analysis of 9 studies involving 6540 cases and 7562 controls China 21625865 (F. Wang, Ma, et al. 2012  MIR196A2 Multiple Asian and Caucasian Asian Meta‐analysis of 21 studies (16 Asian cohorts + 5 Caucasian cohorts) involving 11,764 cases and 14,254 controls China 22952151 (J. Wang, Wang, et al. 2012  MIR27A CRC Chinese Chinese 508 cases and 562 controls China 26302683 (Jiang et al. 2016  MIR27A BC and OC Jewish Jewish 125 BRCA2 mutation carriers Israel 19950226 (Kontorovich et al. 2010  MIR1304 Multiple AA AA TCGA USA 36517516 (Zhao et al. 2022  MIR423 BC Chilean Chilean 440 cases and 807 controls Chile 27421647 (Morales et al. 2016  MIR423 OC Jewish Jewish 125 BRCA2 mutation carriers Israel 19950226 (Kontorovich et al. 2010  MIR499 HCC Turkish No association 222 cancer 222 control Turkey 22393998 (Akkiz et al. 2011b  MIR499 Multiple Multiple Asian Meta‐analyses of 31 case–control studies involving 12,799 cases and 14,507 controls China 25433484 (Chen et al. 2014  MIR499 PC Caucasian and Asian Asian Meta‐analysis of 3 studies Japan 30001553 (Mi et al. 2018  MIR499 HCC Chinese Chinese 172 patients and 185 controls China 24301908 (Shan et al. 2013  MIR499 Multiple Asian and Caucasian Asian Meta‐analysis of 65 case–control studies involving 23,762 cases and 28,694 controls China 29946268 (Yang et al. 2018  MIR608 CRC AA and CA Increased risk of death in CA but reduced risk in AA 245 cases and 446 controls USA 22606253 (Ryan et al. 2012 Multiple SNPs BC AA and CA rs7354931 in AGO4, rs12586258 in MIR‐758 MIR‐513A2 PACT MIR‐106B MIR‐100 MIR‐331 MIR‐544 MIR‐487 MIR‐659 906 AA and 653 EA USA 24062209 (Yao et al. 2013 IsomiRs isomiRs TNBC AA and CA 66 CA and 32 AA cancer patients, 94 CA and 6 AA normal USA 29229607 (Telonis and Rigoutsos 2018 isomiRs PC AA and CA 526 samples from 472 patients USA 29593348 (Magee et al. 2018 isomiRs TNBC AA and CA 316 samples from TCGA USA 26400174 (Telonis et al. 2015 isomiRs Lymphoblastoid cell lines Five different populations 452 lymphoblastoid cell lines USA 25229428 (Loher et al. 2014  Note: Abbreviations: AA, African American; BC, breast cancer; CA, Caucasian American; CC, cervical cancer; CRC, colorectal cancer; EA, European American; GC, gastric cancer; HCC, hepatocellular cancer; OC, ovarian cancer; PC, prostate cancer; TCGA, The Cancer Genome Atlas; TNBC, triple‐negative breast cancer. 1.4 Copy Number Altered microRNAs In the early 2000s, scientists began to explore microRNAs, a class of small noncoding RNAs that are approximately 20 nucleotides long. They discovered that these RNAs are nonrandomly scattered throughout the human genome, with more than half located at fragile sites and cancer‐associated regions (Calin et al. 2004 One study analyzing 74 prostate cancer (PC) tumor/normal pairs (39 AA and 21 CA) found that the MIR4288 2019 MIR342 2011 MIR151 2011 2016 MIR34B 2017 1.5 Epigenetically Regulated microRNAs Another layer of microRNA expression regulation involves epigenetic alterations. Three separate studies have found that the promoter regions of MIR24 MIR152 MIR34B 2017 2017 2014 MIR137 MIR2682 MIR9‐3, MIR663A MIR6130 MIR548AO MIR124 MIR‐34B/C 2016 MIR483 2021 2013 1.6 Circulating and Exosomal microRNAs MicroRNAs offer significant advantages due to their stability and small size, making them excellent candidates for biomarker research. Moreover, they have been found in small extracellular vesicles (Bayat and Sadri Nahand 2024 2018 2022 2021 2019 2021 A pioneering study involving 10 AA and 10 CA early‐stage breast cancer patients revealed multiple circulating microRNAs (miRs) in plasma that are specific to either AAs or CAs (Zhao et al. 2010 2012 2017 2014 2016 2015 2022 2023 2024 1.7 Other microRNAs In addition to the previously mentioned racial disparities in microRNAs, there are several MIRs for which the exact mechanisms leading to their differential expression remain unclear. This could be due to a complex combination of transcriptional and posttranscriptional regulations. One such MIR is MIR29 2017 MIR29 2012 MIR29 2022 MIR29 MIR9 MIR17 MIR181 MIR182 MIR212 MIR221 MIR31 MIR494 MIR99B MIR4719 MIR6756 2013 2012 2019 2023 2018 2019 2018 2014 2016 2023 2015 2017 2017 2023 2018 2018 2013 2015 2015 2018 2016 A recent study on AA patients with gynecologic malignancies, including breast invasive carcinoma, cervical squamous cell carcinoma, endocervical adenocarcinoma, ovarian serous cystadenocarcinoma, uterine corpus endometrial carcinoma, and uterine carcinosarcoma, discovered 80 differentially expressed MIRs in AAs ( N N 2022 MIR9 MIR29 1.8  SNVs microRNAs Another important mechanism in racial disparity involves SNVs, with many SNVs found to show a racial predilection (Datta et al. 2018 In the context of microRNAs, it is believed that SNVs related to microRNAs modulate the intracellular microRNA‐mRNA interaction network, contributing to cancer racial disparities. In our review, we examined (i) SNPs located in MIR targets, (ii) MIRSNPs, and (iii) isomiRs, summarizing their potential contributions to racial disparities (Table 4 1.9  microRNA SNPs As previously discussed, microRNAs typically bind to the 3′‐UTR of mRNAs to regulate target genes through Watson‐Crick pairing. SNPs located in the UTR regions of MIR target genes can alter the binding of specific microRNAs, contributing to cancer racial disparities. For example, studies involving 102 AA and 92 CA breast cancer patients revealed that the BRCA1 UTR SNP rs8176318 G allele is significantly higher in AAs and influences miR‐639 binding (Pelletier et al. 2011 2016 2018 2013 2014 MIR29 MIRLET7 1.10 microRNA SNPs A more direct regulation of these SNPs on racial disparities involves SNPs within the microRNAs themselves. Among the approximately 2000 microRNAs in the human genome, 321 (~15%) carry a SNP in either the precursor, mature, or seed sequences with a minor allele frequency greater than 5%. However, only 15 of these 321 microRNAs are extensively studied, each having more than 10 related publications (Zhao et al. 2022 5 MIR196A2 MIR202 MIR423 MIR1908 2014 TABLE 5 Top MIR SNPs and their minor allele frequencies in global populations. MIR ID SNP ID Minor allele frequency AFR AMR EAS EUR SAS  MIR196A2 rs11614913 14 38.9 54.2 41.1 25.8  MIR499A/B rs3746444 16.9 13.4 14.5 19.4 26.7  MIR149 rs2292832 27.2 31 63.7 28.2 44.6  MIR27A rs895819 48.3 37.6 28 32.2 32.4  MIR608 rs4919510 44 28.7 52.5 17.9 33.9  MIR423 rs6505162 23 54.2 81.6 44.1 55.8  MIR1908 rs174561 2 56.8 54.7 30.3 12.7  MIR492 rs2289030 0.8 16.6 28.5 5.8 10.4  MIR605 rs2043556 23.2 37.3 26.8 21.6 25.3  MIR149 rs71428439 11.1 20.2 19.9 12.7 10.7  MIR449B rs10061133 4.8 6.1 26.5 10 14.2  MIR604 rs2368392 36.8 26.7 34.6 24.3 36.2  MIR1307 rs7911488 5.3 31.7 34.3 34.8 54.7  MIR618 rs2682818 34 11.8 25.3 14.5 28.8  MIR202 rs12355840 72.7 26.7 8.7 15.9 20.8 Abbreviations: AFR, African; AMR, Ad Mixed American; EAS, East Asian; EUR, European; SAS, South Asian. For example, the SNP rs2910164, located in the MIR146A MIR146A 2008 2014 2015 2018 2011c 2013 2012 2014 2012 rs11614913, which is in the miR‐196A‐3p mature sequence, is so far the most widely studied microRNA SNP. MIR196A MIR196A 2016 2011a 2010 2018 2018 2014 2012 2011 2014 SNP rs6505162, found in the MIR423 MIR423 MIR423 2018 2015 MIR423 2016 2010 MIR423 2013 2017 2017 Another example is rs3746444, which is in the seed region of miR‐499A‐3p and the mature region of miR‐499B‐5p. MIR499 MIR‐499 2018 2011b 2014 2018 2013 2018 Additional racially disparate MIR SNPs have been reported. For instance, the G allele for MIR1304 MIR1304 2022 MIR608 2012 MIR106B MIR100 MIR544 MIR487 MIR659 MIR331 MIR758 MIR513A 2013 1.11 IsomiRs Recent discoveries have unveiled further complexities in microRNAs with the identification of isomiRs—MIR variants that differ in length and sequence. This breakthrough emerged from robust analysis of high‐throughput RNA sequencing data (Landgraf et al. 2007 2008 2017 2016 2020 Interestingly, certain isomiRs are more abundantly expressed and serve as better biomarkers compared to their canonical forms in cancer (Wu et al. 2018 2015 MIR‐183 MIR‐183 2018 2018 2014 While the functionality and biological and clinical significance of most isomiRs remain unclear and await future research, it is evident that they will significantly impact biomarker studies in cancer research and hold great potential in uncovering new aspects of microRNA signaling in cancer initiation and progression. 1.12  MIR SNVs SNVs in microRNAs are key to advancing personalized medicine. Based on the top MIR SNPs data, all of them apparently displayed ethnicity/race/population dependency and varied allele frequencies between races (Table 5 MIR196A2 MIR202 MIR1908 MIR1307 5 Take MIR423 MIR423 2023 MIR423 MIR423 2018 2022 2022 1 FIGURE 1 Multilayered regulation of MIR423 MIR423 MIR423 Another example is MIR1304 2023 2022 There are more than 6k SNPs on miRNA seed regions and 46.8k on microRNA precursors, out of which more than 10% (> 5.5k) are disease‐related variations (DRVs) based on GWAS studies (miRSNP v3) (Liu et al. 2021 2015 2 Discussion 2.1  microRNAs microRNAs and their genetic variants have been implicated in racial disparities not only in cancer but also in other human diseases. Associations between microRNAs and human diseases such as diabetes (Flowers et al. 2022 2019 2020 2016 2024 2018 2017 2019 2021 2022 2021 2.2 Mechanistic Studies—Things to Consider To fully understand the mechanisms for microRNAs in racial disparities, the following are a few things to consider. First, a major limitation in the field of microRNA research is the lack of comprehensive studies fully elucidating the regulatory control mechanisms of microRNAs. As discussed above, a significant number of microRNAs are regulated at the level of DNA copy number, epigenetic factors, SNPs, and so on; however, we should bear in mind that the complete picture might also involve transcriptional control, microRNA processing, and microRNA stability, let alone the impact of tissue/cell type‐specific expression and dynamic regulations including environmental stimuli and cellular conditions. Second, in the case of microRNA SNPs and isomiRs, to understand how each microRNA SNP/isomiR regulates disease initiation and progression, cloning of population‐enriched/allele‐specific microRNA or isomiR expression cassettes would be necessary. Third, it is now accepted that extracellular/circulating microRNAs are not only disease biomarkers but also important players in intercellular communication. These microRNAs make good candidates impacting the multilayered tumor microenvironment to explain racial disparities in initiation and progression in a cancer type‐specific manner. Fourth, microRNAs regulate gene expression through several mechanisms (Diener et al. 2024 2005 2008 2013 3 Conclusion Precision medicine is fundamentally rooted in population genetics. While individuals exhibit unique molecular, environmental, and behavioral characteristics, it is crucial to tailor prevention and intervention strategies to these specific attributes for the diseases they have or are predisposed to. However, there remains a significant challenge: the lack of diversity and inclusion in research reference samples. Improving the representation of genetic diversity and including samples from underrepresented minorities in biobanks and datasets are essential steps toward a more comprehensive understanding of human genetics in cancer. In this focused review, we have summarized the current knowledge on microRNAs in the context of human cancer racial disparities (Figure 2 FIGURE 2 MicroRNAs and cancer racial disparities. Race/ethnicity‐specific regulation of microRNAs at multiple levels (epigenetics, copy number, single‐nucleotide polymorphisms, and circulating or exosome secretion) provides a genetic basis for cancer racial disparities. Author Contributions  Dan Zhao: Yifei Wang: Conflicts of Interest The authors declare no conflicts of interest. Related WIRE s  microRNA‐based diagnostic and therapeutic applications in cancer medicine Data Availability Statement The data used in this article are openly available. MicroRNA SNP frequency information in Table 5 https://www.ensembl.org/index.html 1 https://www.cellosaurus.org/index.html 2 https://www.cbioportal.org/ References Akinyemi R. O. H. K. Tiwari V. Srinivasasainagendra 2024 Novel Functional Insights Into Ischemic Stroke Biology Provided by the First Genome‐Wide Association Study of Stroke in Indigenous Africans Genome Medicine 16 1 25 10.1186/s13073-023-01273-5 38317187 PMC10840175 Akkiz H. S. Bayram A. Bekar E. Akgollu Y. Ulger 2011a A Functional Polymorphism in Pre‐MicroRNA‐196a‐2 Contributes to the Susceptibility of Hepatocellular Carcinoma in a Turkish Population: A Case‐Control Study Journal of Viral Hepatitis 18 7 e399 e407 10.1111/j.1365-2893.2010.01414.x 21692953 Akkiz H. S. Bayram A. Bekar E. Akgollu O. Uskudar 2011b Genetic Variation in the MicroRNA‐499 Gene and Hepatocellular Carcinoma Risk in a Turkish Population: Lack of Any Association in a Case‐Control Study Asian Pacific Journal of Cancer Prevention 12 11 3107 3112 https://www.ncbi.nlm.nih.gov/pubmed/22393998 22393998 Akkiz H. S. Bayram A. Bekar E. Akgollu O. Uskudar M. Sandikci 2011c No Association of Pre‐microRNA‐146a rs2910164 Polymorphism and Risk of Hepatocellular Carcinoma Development in Turkish Population: A Case‐Control Study Gene 486 1–2 104 109 10.1016/j.gene.2011.07.006 21807077 Alimena S. B. J. K. Stephenson J. W. Webber 2024 Differences in Serum miRNA Profiles by Race, Ethnicity, and Socioeconomic Status: Implications for Developing an Equitable Ovarian Cancer Screening Test Cancer Prevention Research (Philadelphia, Pa.) 17 4 177 185 10.1158/1940-6207.CAPR-23-0156 38388186 PMC11070176 Arkorful M. A. N. Noren Hooten Y. Zhang 2020 MicroRNA‐1253 Regulation of WASF2 (WAVE2) and Its Relevance to Racial Health Disparities Genes (Basel) 11 5 572 10.3390/genes11050572 32443852 PMC7288301 Asare A. H. Yao O. D. Lara Y. Wang L. Zhang A. K. Sood 2022 Race‐Associated Molecular Changes in Gynecologic Malignancies Cancer Research Communications 2 2 99 109 10.1158/2767-9764.crc-21-0018 35992327 PMC9390975 Barnabas N. L. Xu A. Savera Z. Hou E. R. Barrack 2011 Chromosome 8 Markers of Metastatic Prostate Cancer in African American Men: Gain of the MIR151 Gene and Loss of the NKX3‐1 Gene Prostate 71 8 857 871 10.1002/pros.21302 21456068 Bayat M. J. Sadri Nahand 2024 Exosomal miRNAs: The Tumor's Trojan Horse in Selective Metastasis Molecular Cancer 23 1 167 10.1186/s12943-024-02081-0 39164756 PMC11334467 Bhagirath D. T. L. Yang Z. L. Tabatabai 2019 Role of a Novel Race‐Related Tumor Suppressor MicroRNA Located in Frequently Deleted Chromosomal Locus 8p21 in Prostate Cancer Progression Carcinogenesis 40 5 633 642 10.1093/carcin/bgz058 30874288 PMC7331454 Bhome R. F. Del Vecchio G. H. Lee 2018 Exosomal MicroRNAs (exomiRs): Small Molecules With a Big Role in Cancer Cancer Letters 420 228 235 10.1016/j.canlet.2018.02.002 29425686 PMC5831981 Bovell L. C. C. Shanmugam B. D. Putcha 2013 The Prognostic Value of MicroRNAs Varies With Patient Race/Ethnicity and Stage of Colorectal Cancer Clinical Cancer Research 19 14 3955 3965 10.1158/1078-0432.CCR-12-3302 23719259 PMC3746330 Calin G. A. C. Sevignani C. D. Dumitru 2004 Human MicroRNA Genes Are Frequently Located at Fragile Sites and Genomic Regions Involved in Cancers Proceedings of the National Academy of Sciences of the United States of America 101 9 2999 3004 10.1073/pnas.0307323101 14973191 PMC365734 Cerami E. J. Gao U. Dogrusoz 2012 The cBio Cancer Genomics Portal: An Open Platform for Exploring Multidimensional Cancer Genomics Data Cancer Discovery 2 5 401 404 10.1158/2159-8290.CD-12-0095 22588877 PMC3956037 Chen C. S. Yang S. Chaugai Y. Wang D. W. Wang 2014 Meta‐Analysis of Hsa‐Mir‐499 Polymorphism (rs3746444) for Cancer Risk: Evidence From 31 Case‐Control Studies BMC Medical Genetics 15 126 10.1186/s12881-014-0126-1 25433484 PMC4411927 Chuang T. D. H. Panda X. Luo N. Chegini 2012 miR‐200c Is Aberrantly Expressed in Leiomyomas in an Ethnic‐Dependent Manner and Targets ZEBs, VEGFA, TIMP2, and FBLN5 Endocrine‐Related Cancer 19 4 541 556 10.1530/ERC-12-0007 22685266 PMC3402184 Daly B. O. I. Olopade 2015 A Perfect Storm: How Tumor Biology, Genomics, and Health Care Delivery Patterns Collide to Create a Racial Survival Disparity in Breast Cancer and Proposed Interventions for Change CA: a Cancer Journal for Clinicians 65 3 221 238 10.3322/caac.21271 25960198 Das D. K. L. Persaud M. Sauane 2019 MicroRNA‐4719 and MicroRNA‐6756‐5p Correlate With Castration‐Resistant Prostate Cancer Progression Through Interleukin‐24 Regulation Non‐Coding RNA 5 1 10 10.3390/ncrna5010010 30669553 PMC6468726 Datta S. R. M. Sherva M. De La Cruz 2018 Single Nucleotide Polymorphism Facilitated Down‐Regulation of the Cohesin Stromal Antigen‐1: Implications for Colorectal Cancer Racial Disparities Neoplasia 20 3 289 294 10.1016/j.neo.2018.01.003 29471289 PMC5883624 Deshpande R. P. S. Sharma Y. Liu 2022 LncRNA IPW Inhibits Growth of Ductal Carcinoma In Situ by Downregulating ID2 Through miR‐29c Breast Cancer Research 24 1 6 10.1186/s13058-022-01504-4 35078502 PMC8787949 Devhare P. B. R. Steele A. M. Di Bisceglie D. E. Kaplan R. B. Ray 2017 Differential Expression of MicroRNAs in Hepatitis C Virus‐Mediated Liver Disease Between African Americans and Caucasians: Implications for Racial Health Disparities Gene Expression 17 2 89 98 10.3727/105221616X693594 27765085 PMC8751126 Diener C. A. Keller E. Meese 2024 The miRNA‐Target Interactions: An Underestimated Intricacy Nucleic Acids Research 52 4 1544 1557 10.1093/nar/gkad1142 38033323 PMC10899768 Ding W. M. Li T. Sun 2018 A Polymorphism rs3746444 Within the Pre‐miR‐499 Alters the Maturation of miR‐499‐5p and Its Antiapoptotic Function Journal of Cellular and Molecular Medicine 22 11 5418 5428 10.1111/jcmm.13813 30102014 PMC6201352 Dluzen D. F. N. Noren Hooten Y. Zhang 2016 Racial Differences in MicroRNA and Gene Expression in Hypertensive Women Scientific Reports 6 35815 10.1038/srep35815 27779208 PMC5078799 Dou T. Q. Wu X. Chen 2010 A Polymorphism of MicroRNA196a Genome Region Was Associated With Decreased Risk of Glioma in Chinese Population Journal of Cancer Research and Clinical Oncology 136 12 1853 1859 10.1007/s00432-010-0844-5 20229273 PMC11827793 Dutil J. Z. Chen A. N. Monteiro J. K. Teer S. A. Eschrich 2019 An Interactive Resource to Probe Genetic Diversity and Estimated Ancestry in Cancer Cell Lines Cancer Research 79 7 1263 1273 10.1158/0008-5472.CAN-18-2747 30894373 PMC6445675 Flowers E. A. M. Kanaya L. Zhang B. E. Aouizerat 2022 The Role of Racial and Ethnic Factors in MicroRNA Expression and Risk for Type 2 Diabetes Frontiers in Genetics 13 853633 10.3389/fgene.2022.853633 35368704 PMC8971619 Fu B. P. Song M. Lu B. Wang Q. Zhao 2014 The Association Between miR‐146a Gene rs2910164 Polymorphism and Gastric Cancer Risk: A Meta‐Analysis Biomedicine & Pharmacotherapy 68 8 923 928 10.1016/j.biopha.2014.10.002 25455160 Gao J. B. A. Aksoy U. Dogrusoz 2013 Integrative Analysis of Complex Cancer Genomics and Clinical Profiles Using the cBioPortal Science Signaling 6 269 pl1 10.1126/scisignal.2004088 23550210 PMC4160307 Gobin C. S. Inkabi C. C. Lattimore 2023 Investigating miR‐9 as a Mediator in Laryngeal Cancer Health Disparities Frontiers in Oncology 13 1096882 10.3389/fonc.2023.1096882 37081981 PMC10112398 Guttery D. S. K. Blighe K. Polymeros R. P. Symonds S. Macip E. L. Moss 2018 Racial Differences in Endometrial Cancer Molecular Portraits in the Cancer Genome Atlas Oncotarget 9 24 17093 17103 10.18632/oncotarget.24907 29682207 PMC5908308 Haerian M. S. B. S. Haerian S. Molanaei 2018 MIR196A2 rs11614913 Contributes to Susceptibility to Colorectal Cancer in Iranian Population: A Multi‐Center Case‐Control Study and Meta‐Analysis Gene 669 82 90 10.1016/j.gene.2018.05.082 29802998 Haseeb A. M. S. Makki N. M. Khan I. Ahmad T. M. Haqqi 2017 Deep Sequencing and Analyses of miRNAs, isomiRs and miRNA Induced Silencing Complex (miRISC)‐Associated miRNome in Primary Human Chondrocytes Scientific Reports 7 1 15178 10.1038/s41598-017-15388-4 29123165 PMC5680238 Hashimoto Y. M. Shiina P. Dasgupta 2019 Upregulation of miR‐130b Contributes to Risk of Poor Prognosis and Racial Disparity in African‐American Prostate Cancer Cancer Prevention Research (Philadelphia, Pa.) 12 9 585 598 10.1158/1940-6207.CAPR-18-0509 31266828 PMC7327781 Hashimoto Y. M. Shiina T. Kato 2017 The Role of miR‐24 as a Race Related Genetic Factor in Prostate Cancer Oncotarget 8 10 16581 16593 10.18632/oncotarget.15016 28157714 PMC5369986 Hausser J. A. P. Syed B. Bilen M. Zavolan 2013 Analysis of CDS‐Located miRNA Target Sites Suggests That They Can Effectively Inhibit Translation Genome Research 23 4 604 615 10.1101/gr.139758.112 23335364 PMC3613578 Heegaard N. H. A. J. Schetter J. A. Welsh M. Yoneda E. D. Bowman C. C. Harris 2012 Circulating Micro‐RNA Expression Profiles in Early Stage Nonsmall Cell Lung Cancer International Journal of Cancer 130 6 1378 1386 10.1002/ijc.26153 21544802 PMC3259258 Huang C. M. Yu X. Yao 2018 MicroRNA‐17 and the Prognosis of Human Carcinomas: A Systematic Review and Meta‐Analysis BMJ Open 8 5 e018070 10.1136/bmjopen-2017-018070 PMC5988052 29858404 Hughes L. K. Ruth T. R. Rebbeck V. N. Giri 2013 Genetic Variation in IL‐16 miRNA Target Site and Time to Prostate Cancer Diagnosis in African‐American Men Prostate Cancer and Prostatic Diseases 16 4 308 314 10.1038/pcan.2013.36 24061634 PMC3865712 Jazdzewski K. E. L. Murray K. Franssila B. Jarzab D. R. Schoenberg A. de la Chapelle 2008 Common SNP in Pre‐miR‐146a Decreases Mature miR Expression and Predisposes to Papillary Thyroid Carcinoma Proceedings of the National Academy of Sciences of the United States of America 105 20 7269 7274 10.1073/pnas.0802682105 18474871 PMC2438239 Jedlinski D. J. P. N. Gabrovska S. R. Weinstein R. A. Smith L. R. Griffiths 2011 Single Nucleotide Polymorphism in Hsa‐Mir‐196a‐2 and Breast Cancer Risk: A Case Control Study Twin Research and Human Genetics 14 5 417 421 10.1375/twin.14.5.417 21962133 Jiang G. J. L. Reiter C. Dong 2023 Genetic Regulation of Human isomiR Biogenesis Cancers (Basel) 15 17 4411 10.3390/cancers15174411 37686687 PMC10486453 Jiang Y. D. H. Lin J. P. Xu W. X. Chen S. J. Zheng L. Song 2016 Genotype GG of rs895819 Functional Polymorphism Within miR‐27a Might Increase Genetic Susceptibility to Colorectal Cancer in Han Chinese Population Journal of Clinical Laboratory Analysis 30 4 351 355 10.1002/jcla.21862 26302683 PMC6806710 Jopling C. L. M. Yi A. M. Lancaster S. M. Lemon P. Sarnow 2005 Modulation of Hepatitis C Virus RNA Abundance by a Liver‐Specific MicroRNA Science 309 5740 1577 1581 10.1126/science.1113329 16141076 Kang Z. Y. Li X. He 2014 Quantitative Assessment of the Association Between miR‐196a2 rs11614913 Polymorphism and Cancer Risk: Evidence Based on 45,816 Subjects Tumour Biology 35 7 6271 6282 10.1007/s13277-014-1822-3 24633889 Karali M. M. Persico M. Mutarelli 2016 High‐Resolution Analysis of the Human Retina miRNome Reveals isomiR Variations and Novel MicroRNAs Nucleic Acids Research 44 4 1525 1540 10.1093/nar/gkw039 26819412 PMC4770244 Kessler M. D. N. W. Bateman T. P. Conrads G. L. Maxwell J. C. Dunning Hotopp T. D. O'Connor 2019 Ancestral Characterization of 1018 Cancer Cell Lines Highlights Disparities and Reveals Gene Expression and Mutational Differences Cancer 125 12 2076 2088 10.1002/cncr.32020 30865299 PMC6541501 King B. B. A. Krisanits Q. J. Guo 2023 MicroRNA‐510 Mediated Negative Regulation of Caveolin‐1 in Fibroblasts Promotes Aggressive Tumor Growth Frontiers in Immunology 14 1116644 10.3389/fimmu.2023.1116644 37822942 PMC10564112 Kontorovich T. A. Levy M. Korostishevsky U. Nir E. Friedman 2010 Single Nucleotide Polymorphisms in miRNA Binding Sites and miRNA Genes as Breast/Ovarian Cancer Risk Modifiers in Jewish High‐Risk Women International Journal of Cancer 127 3 589 597 10.1002/ijc.25065 19950226 Kozomara A. S. Griffiths‐Jones 2014 miRBase: Annotating High Confidence MicroRNAs Using Deep Sequencing Data Nucleic Acids Research 42 Database issue D68 D73 10.1093/nar/gkt1181 24275495 PMC3965103 Kriegel A. J. Y. Liu Y. Fang X. Ding M. Liang 2012 The miR‐29 Family: Genomics, Cell Biology, and Relevance to Renal and Cardiovascular Injury Physiological Genomics 44 4 237 244 10.1152/physiolgenomics.00141.2011 22214600 PMC3289120 Landgraf P. M. Rusu R. Sheridan 2007 A Mammalian MicroRNA Expression Atlas Based on Small RNA Library Sequencing Cell 129 7 1401 1414 10.1016/j.cell.2007.04.040 17604727 PMC2681231 Li C. M. L. Grove B. Yu 2018 Genetic Variants in MicroRNA Genes and Targets Associated With Cardiovascular Disease Risk Factors in the African‐American Population Human Genetics 137 1 85 94 10.1007/s00439-017-1858-8 29264654 PMC5790599 Li C. T. Zhou J. Chen 2022 The Role of Exosomal miRNAs in Cancer Journal of Translational Medicine 20 1 6 10.1186/s12967-021-03215-4 34980158 PMC8722109 Li E. P. Ji N. Ouyang 2014 Differential Expression of miRNAs in Colon Cancer Between African and Caucasian Americans: Implications for Cancer Racial Health Disparities International Journal of Oncology 45 2 587 594 10.3892/ijo.2014.2469 24865442 PMC4091964 Liu C. J. X. Fu M. Xia Q. Zhang Z. Gu A. Y. Guo 2021 miRNASNP‐v3: A Comprehensive Database for SNPs and Disease‐Related Variations in miRNAs and miRNA Targets Nucleic Acids Research 49 D1 D1276 D1281 10.1093/nar/gkaa783 32990748 PMC7778889 Liu X. J. Zhang B. Xie H. Li J. Shen J. Chen 2016 MicroRNA‐200 Family Profile: A Promising Ancillary Tool for Accurate Cancer Diagnosis American Journal of Therapeutics 23 2 e388 e397 10.1097/MJT.0000000000000361 26618619 PMC4885590 Loher P. E. R. Londin I. Rigoutsos 2014 IsomiR Expression Profiles in Human Lymphoblastoid Cell Lines Exhibit Population and Gender Dependencies Oncotarget 5 18 8790 8802 10.18632/oncotarget.2405 25229428 PMC4226722 Loo L. W. Y. Wang E. M. Flynn 2011 Genome‐Wide Copy Number Alterations in Subtypes of Invasive Breast Cancers in Young White and African American Women Breast Cancer Research and Treatment 127 1 297 308 10.1007/s10549-010-1297-x 21264507 PMC3224104 Ma L. Y. Hong C. Lu Y. Chen C. Ma 2015 The Occurrence of Cervical Cancer in Uygur Women in Xinjiang Uygur Autonomous Region Is Correlated to MicroRNA‐146a and Ethnic Factor International Journal of Clinical and Experimental Pathology 8 8 9368 9375 https://www.ncbi.nlm.nih.gov/pubmed/26464690 26464690 PMC4583922 Magee R. G. A. G. Telonis P. Loher E. Londin I. Rigoutsos 2018 Profiles of miRNA Isoforms and tRNA Fragments in Prostate Cancer Scientific Reports 8 1 5314 10.1038/s41598-018-22488-2 29593348 PMC5871839 Mani C. G. Acharya K. Saamarthy 2023 Racial Differences in RAD51 Expression Are Regulated by miRNA‐214‐5P and Its Inhibition Synergizes With Olaparib in Triple‐Negative Breast Cancer Breast Cancer Research 25 1 44 10.1186/s13058-023-01615-6 37081516 PMC10120249 Maxwell G. L. Y. Shoji K. Darcy 2015 MicroRNAs in Endometrial Cancers From Black and White Patients American Journal of Obstetrics and Gynecology 212 2 191.e1 191.e10 10.1016/j.ajog.2014.08.028 25174797 Mi Y. K. Ren J. Zou 2018 The Association Between Three Genetic Variants in MicroRNAs (Rs11614913, Rs2910164, Rs3746444) and Prostate Cancer Risk Cellular Physiology and Biochemistry 48 1 149 157 10.1159/000491671 30001553 Mitchell K. A. A. Zingone L. Toulabi J. Boeckelman B. M. Ryan 2017 Comparative Transcriptome Profiling Reveals Coding and Noncoding RNA Differences in NSCLC From African Americans and European Americans Clinical Cancer Research 23 23 7412 7425 10.1158/1078-0432.CCR-17-0527 29196495 PMC8171584 Morales S. F. Gulppi P. Gonzalez‐Hormazabal 2016 Association of Single Nucleotide Polymorphisms in Pre‐miR‐27a, Pre‐miR‐196a2, Pre‐miR‐423, miR‐608 and Pre‐miR‐618 With Breast Cancer Susceptibility in a South American Population BMC Genetics 17 1 109 10.1186/s12863-016-0415-0 27421647 PMC4946190 Morin R. D. M. D. O'Connor M. Griffith 2008 Application of Massively Parallel Sequencing to MicroRNA Profiling and Discovery in Human Embryonic Stem Cells Genome Research 18 4 610 621 10.1101/gr.7179508 18285502 PMC2279248 Moustafa A. A. A. B. Sholl K. Tsumagari 2016 Differential Expression of Exosomes‐Associated Onco‐MicroRNAs in African Americans With Prostate Cancer Cancer Research 76 14_Suppl S1775 Nassar F. J. R. Talhouk N. K. Zgheib 2017 MicroRNA Expression in Ethnic Specific Early Stage Breast Cancer: An Integration and Comparative Analysis Scientific Reports 7 1 16829 10.1038/s41598-017-16978-y 29203780 PMC5715135 O'Brien J. H. Hayder Y. Zayed C. Peng 2018 Overview of MicroRNA Biogenesis, Mechanisms of Actions, and Circulation Frontiers in Endocrinology 9 402 10.3389/fendo.2018.00402 30123182 PMC6085463 Orom U. A. F. C. Nielsen A. H. Lund 2008 MicroRNA‐10a Binds the 5'UTR of Ribosomal Protein mRNAs and Enhances Their Translation Molecular Cell 30 4 460 471 10.1016/j.molcel.2008.05.001 18498749 Ortega F. J. J. M. Mercader V. Catalan 2013 Targeting the Circulating MicroRNA Signature of Obesity Clinical Chemistry 59 5 781 792 10.1373/clinchem.2012.195776 23396142 Ottman R. K. Ganapathy H. Y. Lin 2023 Differential Expression of miRNAs Contributes to Tumor Aggressiveness and Racial Disparity in African American Men With Prostate Cancer Cancers (Basel) 15 8 2331 10.3390/cancers15082331 37190259 PMC10136561 Ozdemir B. C. G. P. Dotto 2017 Racial Differences in Cancer Susceptibility and Survival: More Than the Color of the Skin? Trends Cancer 3 3 181 197 10.1016/j.trecan.2017.02.002 28718431 PMC5518637 Paredes J. P. Ji J. F. Lacomb K. R. Shroyer L. A. Martello J. L. Williams 2018 Establishment of Three Novel Cell Lines Derived From African American Patients With Colorectal Carcinoma: A Unique Tool for Assessing Racial Health Disparity International Journal of Oncology 53 4 1516 1528 10.3892/ijo.2018.4510 30066857 PMC6086619 Pelletier C. W. C. Speed T. Paranjape 2011 Rare BRCA1 Haplotypes Including 3'UTR SNPs Associated With Breast Cancer Risk Cell Cycle 10 1 90 99 10.4161/cc.10.1.14359 21191178 PMC3048078 Peng Q. S. Li X. Lao 2014 The Association of Common Functional Polymorphisms in Mir‐146a and Mir‐196a2 and Hepatocellular Carcinoma Risk: Evidence From a Meta‐Analysis Medicine (Baltimore) 93 29 e252 10.1097/MD.0000000000000252 25546664 PMC4602591 Pizzamiglio S. S. Zanutto C. M. Ciniselli 2017 A Methodological Procedure for Evaluating the Impact of Hemolysis on Circulating MicroRNAs Oncology Letters 13 1 315 320 10.3892/ol.2016.5452 28123561 PMC5244842 Pollard J. P. A. Burns T. A. Hughes 2018 Differential Expression of MicroRNAs in Breast Cancers From Four Different Ethnicities Pathobiology 85 4 220 226 10.1159/000488456 29791912 Qi Y. Y. Huang L. Pang 2017 Prognostic Value of the MicroRNA‐29 Family in Multiple Human Cancers: A Meta‐Analysis and Systematic Review Clinical and Experimental Pharmacology & Physiology 44 4 441 454 10.1111/1440-1681.12726 28063172 Rawlings‐Goss R. A. M. C. Campbell S. A. Tishkoff 2014 Global Population‐Specific Variation in miRNA Associated With Cancer Risk and Clinical Biomarkers BMC Medical Genomics 7 53 10.1186/1755-8794-7-53 25169894 PMC4159108 Rosato A. J. X. Chen Y. Tanaka 2019 Salivary MicroRNAs Identified by Small RNA Sequencing and Machine Learning as Potential Biomarkers of Alcohol Dependence Epigenomics 11 7 739 749 10.2217/epi-2018-0177 31140863 PMC6595542 Ryan B. M. A. C. McClary N. Valeri 2012 rs4919510 in Hsa‐Mir‐608 Is Associated With Outcome but Not Risk of Colorectal Cancer PLoS One 7 5 e36306 10.1371/journal.pone.0036306 22606253 PMC3350523 Sapp R. M. C. A. Chesney C. B. Springer 2021 Race‐Specific Changes in Endothelial Inflammation and MicroRNA in Response to an Acute Inflammatory Stimulus American Journal of Physiology. Heart and Circulatory Physiology 320 6 H2371 H2384 10.1152/ajpheart.00991.2020 33961505 Seal R. L. L. L. Chen S. Griffiths‐Jones 2020 A Guide to Naming Human Non‐Coding RNA Genes EMBO Journal 39 6 e103777 10.15252/embj.2019103777 32090359 PMC7073466 Sempere L. F. A. S. Azmi A. Moore 2021 MicroRNA‐Based Diagnostic and Therapeutic Applications in Cancer Medicine Wiley Interdisciplinary Reviews: RNA 12 6 e1662 10.1002/wrna.1662 33998154 PMC8519065 Shan Y. F. Y. H. Huang Z. K. Chen 2013 miR‐499A>G rs3746444 and miR‐146aG>C Expression and Hepatocellular Carcinoma Risk in the Chinese Population Genetics and Molecular Research 12 4 5365 5371 10.4238/2013.November.7.11 24301908 Shang R. S. Lee G. Senavirathne E. C. Lai 2023 MicroRNAs in Action: Biogenesis, Function and Regulation Nature Reviews. Genetics 24 12 816 833 10.1038/s41576-023-00611-y PMC11087887 37380761 Sharma S. X. Pei F. Xing 2021 Regucalcin Promotes Dormancy of Prostate Cancer Oncogene 40 5 1012 1026 10.1038/s41388-020-01565-9 33323968 PMC8958430 Sharma S. S. Y. Wu H. Jimenez 2019 Ca(2+) and CACNA1H Mediate Targeted Suppression of Breast Cancer Brain Metastasis by AM RF EMF eBioMedicine 44 194 208 10.1016/j.ebiom.2019.05.038 31129098 PMC6604768 Shiina M. Y. Hashimoto T. Kato 2017 Differential Expression of miR‐34b and Androgen Receptor Pathway Regulate Prostate Cancer Aggressiveness Between African‐Americans and Caucasians Oncotarget 8 5 8356 8368 10.18632/oncotarget.14198 28039468 PMC5352406 Soh J. H. Cho C. H. Choi H. Lee 2018 Identification and Characterization of MicroRNAs Associated With Somatic Copy Number Alterations in Cancer Cancers (Basel) 10 12 475 10.3390/cancers10120475 30501131 PMC6315597 Srivastava A. H. Goldberger A. Dimtchev 2014 Circulatory miR‐628‐5p Is Downregulated in Prostate Cancer Patients Tumour Biology 35 5 4867 4873 10.1007/s13277-014-1638-1 24477576 PMC4663977 Srivastava A. H. Goldberger A. Dimtchev 2013 MicroRNA Profiling in Prostate Cancer—The Diagnostic Potential of Urinary miR‐205 and miR‐214 PLoS One 8 10 e76994 10.1371/journal.pone.0076994 24167554 PMC3805541 Sugita B. M. Gill A. Mahajan 2016 Differentially Expressed miRNAs in Triple Negative Breast Cancer Between African‐American and Non‐Hispanic White Women Oncotarget 7 48 79274 79291 10.18632/oncotarget.13024 27813494 PMC5346713 Suresh R. S. Sethi S. Ali T. Giorgadze F. H. Sarkar 2015 Differential Expression of MicroRNAs in Papillary Thyroid Carcinoma and Their Role in Racial Disparity Journal of Cancer Science & Therapy 7 5 145 154 10.4172/1948-5956.1000340 26380656 PMC4570618 Telonis A. G. P. Loher Y. Jing E. Londin I. Rigoutsos 2015 Beyond the One‐Locus‐One‐miRNA Paradigm: MicroRNA Isoforms Enable Deeper Insights Into Breast Cancer Heterogeneity Nucleic Acids Research 43 19 9158 9175 10.1093/nar/gkv922 26400174 PMC4627084 Telonis A. G. I. Rigoutsos 2018 Race Disparities in the Contribution of miRNA Isoforms and tRNA‐Derived Fragments to Triple‐Negative Breast Cancer Cancer Research 78 5 1140 1154 10.1158/0008-5472.CAN-17-1947 29229607 PMC5935570 Theodore S. C. M. Davis F. Zhao 2014 MicroRNA Profiling of Novel African American and Caucasian Prostate Cancer Cell Lines Reveals a Reciprocal Regulatory Relationship of miR‐152 and DNA Methyltranferase 1 Oncotarget 5 11 3512 3525 10.18632/oncotarget.1953 25004396 PMC4116499 Wakabayashi I. H. Sourij Y. Sotoda T. Daimon K. Groschner P. P. Rainer 2021 Ethnic Differences in Serum Levels of microRNAs Potentially Regulating Alcohol Dehydrogenase 1B and Aldehyde Dehydrogenase 2 Journal of Clinical Medicine 10 16 3678 10.3390/jcm10163678 34441974 PMC8397147 Wallace T. A. D. N. Martin S. Ambs 2011 Interactions Among Genes, Tumor Biology and the Environment in Cancer Health Disparities: Examining the Evidence on a National and Global Scale Carcinogenesis 32 8 1107 1121 10.1093/carcin/bgr066 21464040 PMC3149201 Wang B. D. K. Ceniccola Q. Yang 2015 Identification and Functional Validation of Reciprocal MicroRNA‐mRNA Pairings in African American Prostate Cancer Disparities Clinical Cancer Research 21 21 4970 4984 10.1158/1078-0432.CCR-14-1566 26089375 PMC4631799 Wang F. Y. L. Ma P. Zhang 2012 A Genetic Variant in MicroRNA‐196a2 Is Associated With Increased Cancer Risk: A Meta‐Analysis Molecular Biology Reports 39 1 269 275 10.1007/s11033-011-0735-0 21625865 Wang J. Q. Wang H. Liu 2012 The Association of miR‐146a rs2910164 and miR‐196a2 rs11614913 Polymorphisms With Cancer Risk: A Meta‐Analysis of 32 Studies Mutagenesis 27 6 779 788 10.1093/mutage/ges052 22952151 Wang X. P. Ji Y. Zhang 2016 Aberrant DNA Methylation: Implications in Racial Health Disparity PLoS One 11 4 e0153125 10.1371/journal.pone.0153125 27111221 PMC4844165 Wang Z. Y. Cao C. Jiang G. Yang J. Wu Y. Ding 2012 Lack of Association of Two Common Polymorphisms rs2910164 and rs11614913 With Susceptibility to Hepatocellular Carcinoma: A Meta‐Analysis PLoS One 7 6 e40039 10.1371/journal.pone.0040039 22768213 PMC3386926 Wang Z. H. Yao S. Lin 2013 Transcriptional and Epigenetic Regulation of Human MicroRNAs Cancer Letters 331 1 1 10 10.1016/j.canlet.2012.12.006 23246373 Wild C. P. E. Weiderpass B. W. Stewart 2020 “World Cancer Report.” 39432694 Williams A. D. M. Dougal W. Jenkins N. Greene C. Williams‐DeVane K. S. Kimbro 2019 Serum miR‐17 Levels Are Downregulated in Obese, African American Women With Elevated HbA1c Journal of Diabetes and Metabolic Disorders 18 1 173 179 10.1007/s40200-019-00404-3 31275888 PMC6582114 Willinger C. M. J. Rong K. Tanriverdi 2017 MicroRNA Signature of Cigarette Smoking and Evidence for a Putative Causal Role of MicroRNAs in Smoking‐Related Inflammation and Target Organ Damage Circulation. Cardiovascular Genetics 10 5 e001678 10.1161/CIRCGENETICS.116.001678 29030400 PMC5683429 Wu C. W. J. M. Evans S. Huang 2018 A Comprehensive Approach to Sequence‐Oriented IsomiR Annotation (CASMIR): Demonstration With IsomiR Profiling in Colorectal Neoplasia BMC Genomics 19 1 401 10.1186/s12864-018-4794-7 29801434 PMC5970459 Wu K. J. Feng F. Lyu 2021 Exosomal miR‐19a and IBSP Cooperate to Induce Osteolytic Bone Metastasis of Estrogen Receptor‐Positive Breast Cancer Nature Communications 12 1 5196 10.1038/s41467-021-25473-y PMC8408156 34465793 Wu K. L. Li S. Li 2015 Circulating MicroRNA‐21 as a Biomarker for the Detection of Various Carcinomas: An Updated Meta‐Analysis Based on 36 Studies Tumour Biology 36 3 1973 1981 10.1007/s13277-014-2803-2 25527152 Xiang Z. M. Sun Z. Yuan 2018 Prognostic and Clinicopathological Significance of MicroRNA‐494 Overexpression in Cancers: A Meta‐Analysis Oncotarget 9 1 1279 1290 10.18632/oncotarget.22633 29416694 PMC5787438 Xing F. D. Zhao S. Y. Wu 2021 Epigenetic and Posttranscriptional Modulation of SOS1 Can Promote Breast Cancer Metastasis Through Obesity‐Activated c‐Met Signaling in African‐American Women Cancer Research 81 11 3008 3021 10.1158/0008-5472.CAN-19-4031 33446575 PMC8178187 Xue P. S. Huang X. Han 2022 Exosomal miR‐101‐3p and miR‐423‐5p Inhibit Medulloblastoma Tumorigenesis Through Targeting FOXP4 and EZH2 Cell Death and Differentiation 29 1 82 95 10.1038/s41418-021-00838-4 34294888 PMC8738741 Yan X. S. Zhang J. Jia J. Yang Y. Song H. Duan 2022 Exosomal MiR‐423‐3p Inhibits Macrophage M2 Polarization to Suppress the Malignant Progression of Cervical Cancer Pathology, Research and Practice 235 153882 10.1016/j.prp.2022.153882 35609397 Yang F. F. Chen J. Xu X. Guan 2016 Identification and Frequency of the rs12516 and rs8176318 BRCA1 Gene Polymorphisms Among Different Populations Oncology Letters 11 4 2481 2486 10.3892/ol.2016.4252 27073502 PMC4812322 Yang W. J. Wang Z. Chen 2017 NFE2 Induces miR‐423‐5p to Promote Gluconeogenesis and Hyperglycemia by Repressing the Hepatic FAM3A‐ATP‐Akt Pathway Diabetes 66 7 1819 1832 10.2337/db16-1172 28411267 Yang X. X. Li B. Zhou 2018 A Meta‐Analysis of miR‐499 rs3746444 Polymorphism for Cancer Risk of Different Systems: Evidence From 65 Case‐Control Studies Frontiers in Physiology 9 737 10.3389/fphys.2018.00737 29946268 PMC6005882 Yang Y. D. Jia H. Kim 2016 Dysregulation of miR‐212 Promotes Castration Resistance Through hnRNPH1‐Mediated Regulation of AR and AR‐V7: Implications for Racial Disparity of Prostate Cancer Clinical Cancer Research 22 7 1744 1756 10.1158/1078-0432.CCR-15-1606 26553749 PMC7472565 Yao S. K. Graham J. Shen 2013 Genetic Variants in MicroRNAs and Breast Cancer Risk in African American and European American Women Breast Cancer Research and Treatment 141 3 447 459 10.1007/s10549-013-2698-4 24062209 PMC3856568 Ying H. Q. F. Wang B. S. He 2014 The Involvement of Kras Gene 3'‐UTR Polymorphisms in Risk of Cancer and Influence on Patient Response to Anti‐EGFR Therapy in Metastatic Colorectal Cancer: A Meta‐Analysis OncoTargets and Therapy 7 1487 1496 10.2147/OTT.S65496 25210463 PMC4154892 Zhao D. 2020 Single Nucleotide Alterations in MicroRNAs and Human Cancer—A Not Fully Explored Field Non‐coding RNA Research 5 1 27 31 10.1016/j.ncrna.2020.02.003 32128468 PMC7044681 Zhao D. K. Wu S. Sharma 2022 Exosomal miR‐1304‐3p Promotes Breast Cancer Progression in African Americans by Activating Cancer‐Associated Adipocytes Nature Communications 13 1 7734 10.1038/s41467-022-35305-2 PMC9751138 36517516 Zhao H. A. Gao Z. Zhang 2015 Genetic Analysis and Preliminary Function Study of miR‐423 in Breast Cancer Tumour Biology 36 6 4763 4771 10.1007/s13277-015-3126-7 25663458 Zhao H. J. Shen L. Medico D. Wang C. B. Ambrosone S. Liu 2010 A Pilot Study of Circulating miRNAs as Potential Biomarkers of Early Stage Breast Cancer PLoS One 5 10 e13735 10.1371/journal.pone.0013735 21060830 PMC2966402 Zhao H. J. Xu D. Zhao 2016 Somatic Mutation of the SNP rs11614913 and Its Association With Increased MIR 196A2 Expression in Breast Cancer DNA and Cell Biology 35 2 81 87 10.1089/dna.2014.2785 26710106 ",
  "metadata": {
    "Title of this paper": "Somatic Mutation of the SNP rs11614913 and Its Association With Increased MIR 196A2 Expression in Breast Cancer",
    "Journal it was published in:": "Wiley Interdisciplinary Reviews. RNA",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12463549/"
  }
}