{
  "title": "Paper_607",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472287 PMC12472287.1 12472287 12472287 41011165 10.3390/ph18091294 pharmaceuticals-18-01294 1 Article Green Synthesis of Gold Nanoparticles Using Mandragora autumnalis https://orcid.org/0000-0003-4489-6606 Albahri Ghosoon Formal analysis Investigation Writing – original draft Writing – review & editing 1 2 Badran Adnan Formal analysis Investigation Writing – original draft Writing – review & editing 3 Hellany Heba Formal analysis Investigation Writing – original draft Writing – review & editing 2 Kafrouny Nadine Formal analysis Investigation Writing – original draft Writing – review & editing 4 El Kurdi Riham Formal analysis Investigation Writing – original draft Writing – review & editing 4 Alame Mohamad Formal analysis Investigation Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0003-4984-8531 Hijazi Akram Conceptualization Formal analysis Investigation Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0002-3585-4765 Maresca Marc Conceptualization Writing – original draft Writing – review & editing Project administration 5 * Patra Digambara Conceptualization Writing – original draft Writing – review & editing Project administration 4 https://orcid.org/0000-0002-5632-1175 Baydoun Elias Conceptualization Methodology Data curation Writing – original draft Writing – review & editing Supervision Project administration 2 * Le Duc Dat Academic Editor Anh Cao Van Academic Editor 1 ghosoon.albahri.1@ul.edu.lb alamefs@hotmail.com akram.hijazi@ul.edu.lb 2 he115@aub.edu.lb 3 abadran@uop.edu.jo 4 nfk17@mail.aub.edu re87@aub.edu.lb dp03@aub.edu.lb 5 * m.maresca@univ-amu.fr eliasbay@aub.edu.lb 29 8 2025 9 2025 18 9 497460 1294 01 8 2025 22 8 2025 27 8 2025 29 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background Methods Mandragora autumnalis Results Conclusions Mandragora autumnalis gold nanoparticles biosynthesis characterization antioxidant anti-cancerous bioactivities This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction “Nanotechnology” is the design, development, and application of components with sizes ranging from 10 to 1000 nanometers. Nowadays, the field of nanotechnology is multi-disciplinary, involving physics, chemistry, biology, and engineering [ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 One of the biggest medical challenges of the twenty-first century is cancer, a condition in which healthy cells in the body change from their normal state and divide uncontrollably [ 15 16 17 18 19 20 21 18 12 22 18 In this study, Mandragora autumnalis Mandragora autumnalis 23 Mandragora autumnalis Mandragora 24 24 25 Altogether, conventional chemical and physical synthesis methods often rely on hazardous reducing agents (e.g., sodium borohydride, hydrazine) and stabilizers, require high energy input, and may generate toxic byproducts, limiting their biocompatibility and safe application in biomedical research [ 26 27 Mandragora autumnalis 24 3+ 0 M. autumnalis 23 M. autumnalis Mandragora autumnalis 2. Results 2.1. MAE-Based Green Synthesis of Gold Nanoparticles MAE was used as a reducing agent to accomplish the green synthesis of AuNPs. When MAE-AuNPs are successfully formed, the solution changes from yellow to dark purple ( Figure 1 3+ 0 2.2. Analytical Characterization of the Synthesized Gold Nanoparticles: 2.2.1. Ultraviolet–Visible (UV–Vis) Spectroscopy The UV–Vis absorption spectrum of the MAE-AuNPs showed a surface plasmon resonance peak at 570 nm, suggesting successful synthesis of the intended gold nanoparticles and that the phytochemicals in the Mandragora autumnalis Figure 2 2.2.2. ATR Characterization of Biofunctionalized Gold Nanoparticles ATR-FTIR analysis was performed to investigate the functional groups present in the MAE and their involvement in the synthesis and stabilization of MAE-AuNPs. The spectrum of the ethanolic extract ( Figure 3 −1 −1 −1 −1 −1 Figure 3 2.2.3. Morphometric and Size Profiling Analysis DLS size distribution graph of the MAE-AuNPs revealed a dominant peak centered above 100 nm, as indicated by the polydispersity index (PDI), which was 0.188, indicating that the majority of particles exist within the nanometric range, while a secondary, much smaller peak appearing above 1000 nm suggests the presence of some larger aggregates or polydispersity within the sample ( Figure 4 Figure 4 Figure 4 Figure 4 Figure 4 Table 1 2.2.4. X-Ray Crystallinity Analysis The XRD technique was employed to investigate the crystallographic structure of MAE-AuNPs. The diffractogram ( Figure 5 Figure 5 2.2.5. Thermogravimetric Analysis MAE extract and MAE-AuNPs’ TGA graphs demonstrated a consistent weight loss between 150 and 600 °C ( Figure 6 2.3. Antioxidant Activity of the MAE-AuNPs Two commonly used radical scavenging assays, H 2 2 2 2 Figure 7 Figure 7 2.4. Anti-Cancerous Activity of the MAE-AuNPs The anticancer potential of the MAE-AuNPs was assessed against four human cancer cell lines following their successful synthesis and characterization, including human colorectal cancer cell line (HCT116), the human breast cancer cell line (MDA-MB-231), human prostate cancer cell line (22RV), and human pancreatic cancer cell line Capan-2. At 24, 48, and 72 h after treatment, the impact of various MAE-AuNPs concentrations (0, 5, 10, 25, 50, 75, and 100 µg/mL) on the viability of the cancer cells was evaluated. The findings demonstrated that MAE-AuNPs reduced cell viability in a concentration- and time-dependent manner in all cancer cell lines, but most efficiently on the MDA-MB-231 cell line. At 72 h after treatment, for example, cell viability against MDA-MB-231 cells was the highest among other cell lines using 5,10, 25, 50, 75 and 100 µg/mL AuNPs, with viability percentages at 74.72 ± 2, 53.02 ± 2.7, 38.65 ± 6.1, 28.01± 2, 14.80 ± 3.09, and 10.58 ± 3.1, respectively ( Figure 8 50 Table 2 To better understand how MAE-AuNPs reduce cancer cell viability, we looked into how MAE-AuNP-treated MDA-MB-231 breast cancer cells induced apoptosis. Using an inverted phase–contrast microscope, the morphological features of the cells were analyzed following a 24-h treatment with the specified concentrations of the MAE-AuNPs. The images’ analysis revealed a decrease in the overall number of cells per microscopic field that was dependent on the concentration of the MAE-AuNPs. Furthermore, the presence of apoptotic bodies, echinoid spikes, and membrane blebbing ( Figure 9 Figure 9 3. Discussion Biosynthesis techniques are being explored to prepare metallic nanoparticles due to their extensive use in biology, medicine, and pharmaceuticals. The use of plant extracts has become increasingly significant among the biosynthesis techniques discussed in the literature, as most plants are generally accessible, affordable, and non-toxic [ 28 29 30 Figure 2 Mandragora autumnalis 31 32 33 ATR-FTIR analysis was performed to investigate the functional groups present in the MAE and their involvement in the synthesis and stabilization of the MAE-AuNPs. The spectrum of the ethanolic extract ( Figure 3 −1 34 −1 −1 −1 35 Additional peaks in the range of 1400–1000 cm −1 Figure 3 −1 36 Y 37 38 The characterization of the biosynthesized MAE-AuNPs revealed a predominant size distribution peak above 100 nm with a minor secondary peak beyond 1000 nm ( Figure 4 38 The MAE extract exhibited a zeta potential of approximately −7 mV, indicating a relatively low negative surface charge and weak electrostatic repulsion among the dissolved biomolecules ( Figure 4 Figure 4 39 40 SEM imaging further confirmed the presence of aggregated particles with a characteristic scale of ~500 nm ( Figure 4 41 Figure 4 3+ 4 2 0 9 38 36 42 The XRD analysis of MAE-AuNPs confirms the successful formation of crystalline metallic gold. The observed diffraction peaks at 2θ ≈ 38.1°, 44.3°, 64.6°, and 77.5° correspond to the (111), (200), (220), and (311) planes of the face-centered cubic (FCC) structure of gold, as reported in the standard JCPDS file No. 04-0784 ( Figure 5 43 The sharpness and narrow width of the peaks suggest that the MAE-AuNPs are highly crystalline, with minimal structural defects. The absence of impurity peaks further confirms the phase purity of the gold nanoparticles, indicating that the biosynthesis method employed was both efficient and specific. The biological molecules present in the MAE—likely including phenolics, flavonoids, and alkaloids—are known to act as both reducing and capping agents during nanoparticle formation [ 44 Furthermore, the FCC structure of gold and the specific orientation of the (111) plane have significant implications for applications in catalysis, biomedical imaging, and drug delivery, where surface reactivity and stability are critical. Green synthesis methods such as this are increasingly favored due to their environmental compatibility, cost-effectiveness, and ability to yield nanoparticles with desirable physicochemical properties without the use of hazardous chemicals [ 45 The thermal stability of both MAE and MAE-AuNPs was evaluated using TGA. As shown in Figure 6 These observations align with findings reported in similar studies by Soltys et al. [ 46 47 The dual antioxidant assays show that MAE-AuNPs ( Figure 7 48 36 49 50 47 2 2 2 2 51 Additionally, those biosynthesized nanoparticles demonstrated anticancer properties against many human cancer cell lines [ 52 12 Figure 8 50 Ocimum sanctum 53 Terminalia arjuna 54 55 Azadirachta indica 56 Figure 9 Based on a previous study, the ethanol crude extract of Mandragora autumnalis 50 50 57 58 59 60 61 62 A critical requirement for establishing the therapeutic potential of any anticancer agent is the demonstration of selective toxicity, i.e., the ability to kill cancer cells while sparing normal cells. The ethanol crude extract of Mandragora autumnalis 57 58 63 Mandragora autumnalis Collectively, this present study demonstrated the successful biosynthesis of gold nanoparticles (AuNPs) using Mandragora autumnalis 36 38 64 65 66 67 68 37 65 66 69 70 71 72 73 63 67 38 4. Materials and Methods 4.1. Preparation of the Mandragora autumnalis Ethanolic Extract (MAE) The leaves of Mandragora autumnalis 4.2. Gold Nanoparticles Synthesis Utilizing MAE MAE and gold (III) chloride trihydrate (HAuCl 4 2 4.3. Gold Nanoparticles Characterization 4.3.1. Ultra Violet–Visible Spectroscopic Analysis The synthesis of gold nanoparticles was verified, and their optical characteristics were described using UV–Visible spectroscopy [ 74 4.3.2. Fourier Transform Infrared Spectroscopic Analysis FTIR in conjunction with attenuated total reflectance (ATR) is a powerful method for characterizing gold nanoparticles. The surface chemistry of AuNPs can be quickly and non-destructively analyzed using ATR-FTIR by identifying the functional groups of stabilizing and capping agents [ 75 4.3.3. Dynamic Light Scattering Analysis Using a PMT detector (HAMAMATSU, HC120-30, HAMAMATSU, Hamamatsu City, Japan) and a laser source operating at 658 nm, the dynamic light scattering (DLS) technique (Brookhaven Instruments Corps, Nashua, NH, USA) was used to evaluate the size distribution and zeta potential of the AuNPs solution. The program 90 Plus Particle Sizing Software Ver. 5.23 was utilized, and the dust was set to 40. The hydrodynamic size and size distribution of gold nanoparticles in solution were measured using dynamic light scattering, which offers information on their stability and aggregation. By assessing the nanoparticles’ surface charge, which affects their colloidal stability and interactions, zeta potential analysis enhances DLS. Zeta potential and DLS work together to evaluate the behavior and physical stability of gold nanoparticles in a variety of applications [ 76 4.3.4. Scanning Electron Microscopy Analysis Scanning electron microscopy was used to visualize the morphology, size, and surface structure of gold nanoparticles with high spatial resolution. It provides direct images that reveal particle shape and aggregation state. Energy dispersive X-ray spectroscopy, often coupled with SEM, identifies the elemental composition of the nanoparticles, confirming the presence of gold and detecting any impurities or surface elements [ 77 4.3.5. X-Ray Diffraction Analysis Gold nanoparticles’ crystalline structure and phase purity are ascertained using X-ray diffraction. By examining diffraction patterns, it offers details on the nanoparticle’s crystallinity, crystal size, and lattice parameters. Understanding the stability and physical characteristics of gold nanoparticles requires this structural understanding [ 78 4.3.6. Thermogravimetric Analysis Thermogravimetric analysis is used to assess the thermal stability and composition of gold nanoparticles, particularly to quantify the amount of organic capping or stabilizing agents on their surface. By measuring weight changes as the sample is heated, TGA helps determine the degradation temperatures and the proportion of organic material versus the metallic core. This information is crucial for understanding nanoparticle stability and for optimizing synthesis and functionalization processes [ 79 In aluminum oxide (Al 2 3 4.4. Radical Scavenging Antioxidant DPPH Assay The antioxidant activity of MAE-NPs was evaluated using the free-radical-scavenging activity of α, α-diphenyl-α-picrylhydrazyl (DPPH). With a 0.5 mM DPPH solution in methanol, MAE-AuNPs at various concentrations (5, 10, 25, 50, 75, or 100 μg/mL) were added. The blank solution, used for comparison, consisted of 0.5 mL of DPPH solution, 3 mL of methanol, and 0.5 mL of 80% ethanol. After the combined samples were left in the dark for half an hour, the optical density (OD) at 517 nm was measured using a spectrophotometer. The percentage of DPPH-scavenging activity for each MAE-AuNP concentration was determined using the formula below. Ascorbic acid served as the standard for comparison. The percentage of DPPH-scavenging activity for each MAE-AuNP concentration was determined using the formula below. Inhibition% = (absorbance of control − extract absorbance)/(absorbance of control) × 100. 4.5. Hydrogen Peroxide Radical Scavenging H 2 2 The capacity of AuNPs to scavenge hydrogen peroxide was another metric used to evaluate their antioxidant activity. After making a 40 mM hydrogen peroxide solution in 1 mM phosphate buffer (pH 7.4), different concentrations of synthesized AuNPs made in DMSO were added, and the mixture was incubated for ten minutes. Each reaction mixture received two milliliters of the dichromate-acetic acid reagent following incubation. The reference was a blank that contained only phosphate buffer and no hydrogen peroxide, and the control was a reaction mixture devoid of AuNPs [ 80 Inhibition% = (absorbance of control − extract absorbance)/(absorbance of control) × 100. The experiment was performed in triplicate, and the results are expressed as mean ± SEM. For both antioxidant assays, after obtaining the scavenging percentage, IC 50 4.6. Cell Culture and MTT Cell Viability Assay The cells were cultivated at 37 °C with 5% CO2 in a humidified incubator. Capan-2 human pancreatic cancer cells (Cell Line Service, CLS, Eppenlheim, Germany), 22RV1 human prostate cancer cells (ATCC, Manassas, VA, USA), and human breast cancer cells MDA-MB-231 (American Tissue Culture Collection, ATCC, Manassas, VA, USA) were cultured in DMEM high-glucose medium supplemented with 10% fetal bovine serum (FBS) (both from Sigma-Aldrich, St. Louis, MO, USA) and 1% penicillin/streptomycin (Lonza, Basel, Switzerland). A solution of 10% fetal bovine serum (FBS), 1% penicillin/streptomycin, and 1% sodium pyruvate were added to RPMI-1640 medium (Sigma-Aldrich, St. Louis, MO, USA) to support human colorectal cancer cells HCT116 (ATCC, Manassas, VA, USA). For the cell viability assay, the cells were seeded into 96-well plates (5 × 10 3 81 82 The data is displayed as mean values ± SEM. 4.7. Microscopic Analysis of Apoptotic Morphological Change In 6-well plates, MDA-MB-231 cells were cultured with or without the specified MAE-AuNPs concentrations. After 24 h, morphological features of apoptotic cells were examined at magnifications of ×10, ×20, and ×40 using an inverted phase–contrast microscope. Changes in nuclear morphology were identified using 4′, 6-diamidino-2-phenylindole, dihydrochloride (DAPI) (Cell Signaling #4083) staining. For 24 h, cells were cultured in 12-well plates with or without the specified MAE-AuNP concentrations. Following 4% formaldehyde fixation, DAPI staining, and fluorescence microscopy visualization, cells were examined. 4.8. Statistical Analysis The student’s t p 5. Limitations and Future Perspectives This study provides the first demonstration of the green synthesis of gold nanoparticles using Mandragora autumnalis 6. Conclusions The necessity to create environmentally friendly processes for the synthesis of metallic nanoparticles has grown as a result of the biological applications of these particles, particularly gold nanoparticles. Plants present a sustainable, affordable, and generally safe option for the green synthesis of metallic nanoparticles. Their extracts are easy to prepare and, due to the vast diversity of plant species, they offer a wide range of natural reducing and capping agents. This diversity enables the controlled synthesis of metallic nanoparticles with various shapes and morphologies. The biogenesis of nanomedicine holds great promise for the treatment of cancer in the twenty-first century through the development of effective anticancer nanomedicine and drug delivery systems that efficiently deliver powerful medications to targeted areas. It is anticipated that green-synthesized AuNPs will eventually be useful in the fields of cancer therapy and diagnostics, given the enormous significance of AuNPs over the past few years and the safety and biocompatibility of green synthesis methods. To the best of our knowledge, this study provides the first direct insight into the use of MAE for the green synthesis of gold nanoparticles (AuNPs) with anticancer potential. The produced MAE-AuNPs are not only eco-friendly and cost-effective but also biocompatible and non-toxic, offering a promising alternative for therapeutic applications. These MAE-AuNPs may serve as innovative agents in the treatment of cancer and other chronic inflammation-related diseases. Furthermore, their therapeutic efficacy could be enhanced through surface functionalization with specific drugs or targeting ligands to improve cellular uptake and selectivity. When combined with conventional chemotherapeutics, these MAE-AuNPs may also exhibit synergistic anticancer effects. Overall, our findings underscore the significance of MAE as a sustainable source for the development of pharmacologically active AuNPs, particularly as novel candidates with anti-inflammatory and anticancer properties. Nevertheless, there has not been much focus in the published literature on the in vivo investigation of AuNPs in different animals, as well as three-dimensional spheroids and organoid models. In order to increase confidence in translation to clinical studies for the safe and efficient use of AuNPs in cancer patients, more research is required. To do this, AuNPs functionalized with anticancer medications and targeting ligands must be produced on a large scale economically and effectively. Acknowledgments The authors would like to thank the University Research Board (URB) of the American University of Beirut and the University of Petra for their support. BioRender software was used to create the graphical abstract https://www.biorender.com/ Disclaimer/Publisher’s Note: Author Contributions Conceptualization, G.A., A.H. and E.B.; investigation, G.A., A.B. and E.B.; writing—review and editing, G.A., R.E.K., N.K. and H.H.; visualization, E.B., M.A., M.M. and A.H.; and project administration, A.H., D.P., E.B. and M.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding authors. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: MAE Mandragora autumnalis LSPR localized surface plasmon resonance AuNPs gold nanoparticles PDI polydispersity index XRD X-ray diffraction TGA thermogravimetric analysis ATR attenuated total reflectance DLS dynamic light scattering SEM scanning electron microscopy SPR surface plasmon resonance (SPR) DAPI 4′, 6-diamidino-2-phenylindole, dihydrochloride MTT 3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium bromide DMSO dimethyl sulfoxide DPPH 2,2-diphenyl-1-picrylhydrazyl H 2 2 hydrogen peroxide EDX energy dispersive X-ray spectroscopy FTIR Fourier transform infrared ROS reactive oxygen species UV-VIS Ultra violet–Visible spectroscopy HCT116 colorectal cancer cell line MDA-MB-231 triple negative breast cancer cell line 22RV1 human prostate cancer cell line Capan-2 human pancreatic cancer cell line References 1. Amina S.J. Guo B. A Review on the Synthesis and Functionalization of Gold Nanoparticles as a Drug Delivery Vehicle Int. J. Nanomed. 2020 15 9823 9857 10.2147/IJN.S279094 PMC7732174 33324054 2. Nirmal N.P. Mereddy R. Li L. Sultanbawa Y. Formulation, Characterisation and Antibacterial Activity of Lemon Myrtle and Anise Myrtle Essential Oil in Water Nanoemulsion Food Chem. 2018 254 1 7 10.1016/j.foodchem.2018.01.173 29548427 3. Thakkar K.N. Mhatre S.S. Parikh R.Y. Biological Synthesis of Metallic Nanoparticles Nanomed. Nanotechnol. Biol. Med. 2010 6 257 262 10.1016/j.nano.2009.07.002 19616126 4. Khan I. Saeed K. Khan I. Nanoparticles: Properties, Applications and Toxicities Arab. J. Chem. 2019 12 908 931 10.1016/j.arabjc.2017.05.011 5. Duman H. Akdaşçi E. Eker F. Bechelany M. Karav S. Gold Nanoparticles: Multifunctional Properties, Synthesis, and Future Prospects Nanomaterials 2024 14 1805 10.3390/nano14221805 39591046 PMC11597081 6. Li W. Cao Z. Liu R. Liu L. Li H. Li X. Chen Y. Lu C. Liu Y. AuNPs as an Important Inorganic Nanoparticle Applied in Drug Carrier Systems Artif. Cells Nanomed. Biotechnol. 2019 47 4222 4233 10.1080/21691401.2019.1687501 31713452 7. Dykman L. Khlebtsov B. Khlebtsov N. Drug Delivery Using Gold Nanoparticles Adv. Drug Deliv. Rev. 2025 216 115481 10.1016/j.addr.2024.115481 39617254 8. Huang H. Liu R. Yang J. Dai J. Fan S. Pi J. Wei Y. Guo X. Gold Nanoparticles: Construction for Drug Delivery and Application in Cancer Immunotherapy Pharmaceutics 2023 15 1868 10.3390/pharmaceutics15071868 37514054 PMC10383270 9. Kumalasari M.R. Alfanaar R. Andreani A.S. Gold Nanoparticles (AuNPs): A Versatile Material for Biosensor Application Talanta Open 2024 9 100327 10.1016/j.talo.2024.100327 10. Abuzeid H.M. Julien C.M. Zhu L. Hashem A.M. Green Synthesis of Nanoparticles and Their Energy Storage, Environmental, and Biomedical Applications Crystals 2023 13 1576 10.3390/cryst13111576 11. Wehbe N. Mesmar J.E. El Kurdi R. Al-Sawalmih A. Badran A. Patra D. Baydoun E. Halodule Uninervis Extract Facilitates the Green Synthesis of Gold Nanoparticles with Anticancer Activity Sci. Rep. 2025 15 4286 10.1038/s41598-024-81875-0 39905108 PMC11794841 12. Andleeb A. Andleeb A. Asghar S. Zaman G. Tariq M. Mehmood A. Nadeem M. Hano C. Lorenzo J.M. Abbasi B.H. A Systematic Review of Biosynthesized Metallic Nanoparticles as a Promising Anti-Cancer-Strategy Cancers 2021 13 2818 10.3390/cancers13112818 34198769 PMC8201057 13. Kajani A.A. Bordbar A.-K. Zarkesh Esfahani S.H. Razmjou A. Gold Nanoparticles as Potent Anticancer Agent: Green Synthesis, Characterization, and in Vitro Study RSC Adv. 2016 6 63973 63983 10.1039/C6RA09050H 14. Adeyemi J.O. Oriola A.O. Onwudiwe D.C. Oyedeji A.O. Plant Extracts Mediated Metal-Based Nanoparticles: Synthesis and Biological Applications Biomolecules 2022 12 627 10.3390/biom12050627 35625555 PMC9138950 15. Brown J.S. Amend S.R. Austin R.H. Gatenby R.A. Hammarlund E.U. Pienta K.J. Updating the Definition of Cancer Mol. Cancer Res. 2023 21 1142 1147 10.1158/1541-7786.MCR-23-0411 37409952 PMC10618731 16. Ekpanyaskul C. Sangrajrang S. Cancer Incidence among Healthcare Workers in Cancer Centers: A 14-Year Retrospective Cohort Study in Thailand Ann. Glob. Health 2018 84 429 435 10.29024/aogh.2324 30835381 PMC6748292 17. Anand U. Dey A. Chandel A.K.S. Sanyal R. Mishra A. Pandey D.K. De Falco V. Upadhyay A. Kandimalla R. Chaudhary A. Cancer Chemotherapy and beyond: Current Status, Drug Candidates, Associated Risks and Progress in Targeted Therapeutics Genes Dis. 2023 10 1367 1401 10.1016/j.gendis.2022.02.007 37397557 PMC10310991 18. Yao Y. Zhou Y. Liu L. Xu Y. Chen Q. Wang Y. Wu S. Deng Y. Zhang J. Shao A. Nanoparticle-Based Drug Delivery in Cancer Therapy and Its Role in Overcoming Drug Resistance Front. Mol. Biosci. 2020 7 193 10.3389/fmolb.2020.00193 32974385 PMC7468194 19. Bharadwaj K.K. Rabha B. Pati S. Sarkar T. Choudhury B.K. Barman A. Bhattacharjya D. Srivastava A. Baishya D. Edinur H.A. Green Synthesis of Gold Nanoparticles Using Plant Extracts as Beneficial Prospect for Cancer Theranostics Molecules 2021 26 6389 10.3390/molecules26216389 34770796 PMC8586976 20. Yu Z. Gao L. Chen K. Zhang W. Zhang Q. Li Q. Hu K. Nanoparticles: A New Approach to Upgrade Cancer Diagnosis and Treatment Nanoscale Res. Lett. 2021 16 88 10.1186/s11671-021-03489-z 34014432 PMC8137776 21. Houshmand M. Garello F. Circosta P. Stefania R. Aime S. Saglio G. Giachino C. Nanocarriers as Magic Bullets in the Treatment of Leukemia Nanomaterials 2020 10 276 10.3390/nano10020276 32041219 PMC7075174 22. Dewhirst M.W. Secomb T.W. Transport of Drugs from Blood Vessels to Tumour Tissue Nat. Rev. Cancer 2017 17 738 750 10.1038/nrc.2017.93 29123246 PMC6371795 23. Dağlioğlu Y. Öztürk B. Green Synthesis of Silver Nanoparticles Using Mandragora Autumnalis; Its Characterization, Antioxidant and Antimicrobial Activities Erzincan Üniversitesi Fen Bilim. Enstitüsü Derg. 2021 14 1039 1054 10.18185/erzifbed.915107 24. Albahri G. Badran A. Baki Z.A. Alame M. Hijazi A. Daou A. Mesmar J.E. Baydoun E. Mandragora Autumnalis Distribution, Phytochemical Characteristics, and Pharmacological Bioactivities Pharmaceuticals 2025 18 328 10.3390/ph18030328 40143106 PMC11944648 25. Monadi T. Azadbakht M. Ahmadi A. Chabra A. A Comprehensive Review on the Ethnopharmacology, Phytochemistry, Pharmacology, and Toxicology of the Mandragora Genus; from Folk Medicine to Modern Medicine Curr. Pharm. Des. 2021 27 3609 3637 10.2174/1381612827666210203143445 33535944 26. Kumar D. Kumar S. Gholap A.D. Kumari R. Tanwar R. Kumar V. Khalid M. Faiyazuddin M. A Comprehensive Review on the Biomass-Mediated Synthesis of Silver Nanoparticles: Opportunities and Challenges J. Environ. Chem. Eng. 2025 13 115133 10.1016/j.jece.2024.115133 27. Rani N. Singh P. Kumar S. Kumar P. Bhankar V. Kumar K. Plant-Mediated Synthesis of Nanoparticles and Their Applications: A Review Mater. Res. Bull. 2023 163 112233 10.1016/j.materresbull.2023.112233 28. Noruzi M. Biosynthesis of Gold Nanoparticles Using Plant Extracts Bioprocess Biosyst. Eng. 2015 38 1 14 10.1007/s00449-014-1251-0 25090979 29. Noruzi M. Zare D. Khoshnevisan K. Davoodi D. Rapid Green Synthesis of Gold Nanoparticles Using Rosa Hybrida Petal Extract at Room Temperature Spectrochim. Acta Part A Mol. Biomol. Spectrosc. 2011 79 1461 1465 10.1016/j.saa.2011.05.001 21616704 30. Noruzi M. Zare D. Davoodi D. A Rapid Biosynthesis Route for the Preparation of Gold Nanoparticles by Aqueous Extract of Cypress Leaves at Room Temperature Spectrochim. Acta Part A Mol. Biomol. Spectrosc. 2012 94 84 88 10.1016/j.saa.2012.03.041 22522293 31. Ying S. Guan Z. Ofoegbu P.C. Clubb P. Rico C. He F. Hong J. Green Synthesis of Nanoparticles: Current Developments and Limitations Environ. Technol. Innov. 2022 26 102336 10.1016/j.eti.2022.102336 32. Alharbi N.S. Alsubhi N.S. Felimban A.I. Green Synthesis of Silver Nanoparticles Using Medicinal Plants: Characterization and Application J. Radiat. Res. Appl. Sci. 2022 15 109 124 10.1016/j.jrras.2022.06.012 33. Abdollahi S.N. Naderi M. Amoabediny G. Synthesis and Characterization of Hollow Gold Nanoparticles Using Silica Spheres as Templates Colloids Surf. A Physicochem. Eng. Asp. 2013 436 1069 1075 10.1016/j.colsurfa.2013.08.028 34. Coman C. Leopold L.F. Rugină O.D. Barbu-Tudoran L. Leopold N. Tofană M. Socaciu C. Green Synthesis of Gold Nanoparticles by Allium Sativum Extract and Their Assessment as SERS Substrate J. Nanopart. Res. 2014 16 2158 10.1007/s11051-013-2158-4 35. Anadozie S.O. Adewale O.B. Fadaka A.O. Afolabi O.B. Roux S. Synthesis of Gold Nanoparticles Using Extract of Carica Papaya Fruit: Evaluation of Its Antioxidant Properties and Effect on Colorectal and Breast Cancer Cells Biocatal. Agric. Biotechnol. 2022 42 102348 10.1016/j.bcab.2022.102348 36. Ahmed S. Saifullah Ahmad M. Swami B.L. Ikram S. Green Synthesis of Silver Nanoparticles Using Azadirachta Indica Aqueous Leaf Extract J. Radiat. Res. Appl. Sci. 2016 9 1 7 10.1016/j.jrras.2015.06.006 37. Shankar S.S. Rai A. Ankamwar B. Singh A. Ahmad A. Sastry M. Biological Synthesis of Triangular Gold Nanoprisms Nat. Mater. 2004 3 482 488 10.1038/nmat1152 15208703 38. Iravani S. Green Synthesis of Metal Nanoparticles Using Plants Green Chem. 2011 13 2638 2650 10.1039/c1gc15386b 39. Bar H. Bhui D.K. Sahoo G.P. Sarkar P. Pyne S. Misra A. Green Synthesis of Silver Nanoparticles Using Seed Extract of Jatropha Curcas Colloids Surf. A Physicochem. Eng. Asp. 2009 348 212 216 10.1016/j.colsurfa.2009.07.021 40. Khalil M.M.H. Ismail E.H. El-Baghdady K.Z. Mohamed D. Green Synthesis of Silver Nanoparticles Using Olive Leaf Extract and Its Antibacterial Activity Arab. J. Chem. 2014 7 1131 1139 10.1016/j.arabjc.2013.04.007 41. Song J.Y. Kim B.S. Rapid Biological Synthesis of Silver Nanoparticles Using Plant Leaf Extracts Bioprocess Biosyst. Eng. 2009 32 79 84 10.1007/s00449-008-0224-6 18438688 42. Shah S. Shah S.A. Faisal S. Khan A. Ullah R. Ali N. Bilal M. Engineering Novel Gold Nanoparticles Using Sageretia Thea Leaf Extract and Evaluation of Their Biological Activities J. Nanostruct. Chem. 2022 12 129 140 10.1007/s40097-021-00407-8 43. Iravani S. Korbekandi H. Mirmohammadi S.V. Zolfaghari B. Synthesis of Silver Nanoparticles: Chemical, Physical and Biological Methods Res. Pharm. Sci. 2014 9 385 406 26339255 PMC4326978 44. Mittal A.K. Chisti Y. Banerjee U.C. Synthesis of Metallic Nanoparticles Using Plant Extracts Biotechnol. Adv. 2013 31 346 356 10.1016/j.biotechadv.2013.01.003 23318667 45. Ahmed S. Ahmad M. Swami B.L. Ikram S. A Review on Plants Extract Mediated Synthesis of Silver Nanoparticles for Antimicrobial Applications: A Green Expertise J. Adv. Res. 2016 7 17 28 10.1016/j.jare.2015.02.007 26843966 PMC4703479 46. Soltys L. Olkhovyy O. Tatarchuk T. Naushad M. Green Synthesis of Metal and Metal Oxide Nanoparticles: Principles of Green Chemistry and Raw Materials Magnetochemistry 2021 7 145 10.3390/magnetochemistry7110145 47. Singh P. Kim Y.-J. Zhang D. Yang D.-C. Biological Synthesis of Nanoparticles from Plants and Microorganisms Trends Biotechnol. 2016 34 588 599 10.1016/j.tibtech.2016.02.006 26944794 48. Chandran S.P. Chaudhary M. Pasricha R. Ahmad A. Sastry M. Synthesis of Gold Nanotriangles and Silver Nanoparticles Using Aloe Vera Plant Extract Biotechnol. Prog. 2006 22 577 583 10.1021/bp0501423 16599579 49. Ravindran A. Chandran P. Khan S.S. Biofunctionalized Silver Nanoparticles: Advances and Prospects Colloids Surf. B Biointerfaces 2013 105 342 352 10.1016/j.colsurfb.2012.07.036 23411404 50. Karamian R. Kamalnejad J. Green Synthesis of Silver Nanoparticles Using Cuminum Cyminum Leaf Extract and Evaluation of Their Biological Activities J. Nanostruct. 2019 9 74 85 10.22052/JNS.2019.01.008 51. Zhou Y. Kong Y. Kundu S. Cirillo J.D. Liang H. Antibacterial Activities of Gold and Silver Nanoparticles against Escherichia Coli and Bacillus Calmette-Guérin J. Nanobiotechnol 2012 10 19 10.1186/1477-3155-10-19 PMC3405418 22559747 52. Chaturvedi V.K. Sharma B. Tripathi A.D. Yadav D.P. Singh K.R. Singh J. Singh R.P. Biosynthesized Nanoparticles: A Novel Approach for Cancer Therapeutics Front. Med. Technol. 2023 5 1236107 10.3389/fmedt.2023.1236107 37521721 PMC10374256 53. Sharma V.K. Yngard R.A. Lin Y. Silver Nanoparticles: Green Synthesis and Their Antimicrobial Activities Adv. Colloid Interface Sci. 2009 145 83 96 10.1016/j.cis.2008.09.002 18945421 54. Mukherjee P. Bhattacharya R. Bone N. Lee Y.K. Patra C. Wang S. Lu L. Secreto C. Banerjee P.C. Yaszemski M.J. Potential Therapeutic Application of Gold Nanoparticles in B-Chronic Lymphocytic Leukemia (BCLL): Enhancing Apoptosis J. Nanobiotechnol 2007 5 4 10.1186/1477-3155-5-4 17488514 PMC1876244 55. Raghunandan D. Ravishankar B. Sharanbasava G. Mahesh D.B. Harsoor V. Yalagatti M.S. Bhagawanraju M. Venkataraman A. Anti-Cancer Studies of Noble Metal Nanoparticles Synthesized Using Different Plant Extracts Cancer Nano. 2011 2 57 65 10.1007/s12645-011-0014-8 26069485 PMC4451508 56. Kumari S.A. Patlolla A.K. Madhusudhanachary P. Biosynthesis of Silver Nanoparticles Using Azadirachta Indica and Their Antioxidant and Anticancer Effects in Cell Lines Micromachines 2022 13 1416 10.3390/mi13091416 36144039 PMC9506441 57. Mahmod A.I. Talib W.H. Anticancer Activity of Mandragora Autumnalis: An in Vitro and in Vivo Study Pharmacia 2021 68 827 835 10.3897/pharmacia.68.e71695 58. Connor E.E. Mwamuka J. Gole A. Murphy C.J. Wyatt M.D. Gold Nanoparticles Are Taken Up by Human Cells but Do Not Cause Acute Cytotoxicity Small 2005 1 325 327 10.1002/smll.200400093 17193451 59. Khlebtsov N. Dykman L. Biodistribution and Toxicity of Engineered Gold Nanoparticles: A Review of in Vitro and in Vivo Studies Chem. Soc. Rev. 2011 40 1647 1671 10.1039/C0CS00018C 21082078 60. Shukla R. Bansal V. Chaudhary M. Basu A. Bhonde R.R. Sastry M. Biocompatibility of Gold Nanoparticles and Their Endocytotic Fate Inside the Cellular Compartment: A Microscopic Overview Langmuir 2005 21 10644 10654 10.1021/la0513712 16262332 61. Patra J.K. Baek K.-H. Green Nanobiotechnology: Factors Affecting Synthesis and Characterization Techniques J. Nanomater. 2014 2014 417305 10.1155/2014/417305 62. Sundararajan B. Ranjitha Kumari B.D. Novel Synthesis of Gold Nanoparticles Using Artemisia vulgaris Aedes aegypti J. Trace Elem. Med. Biol. 2017 43 187 196 10.1016/j.jtemb.2017.03.008 28341392 63. Dreaden E.C. Alkilany A.M. Huang X. Murphy C.J. El-Sayed M.A. The Golden Age: Gold Nanoparticles for Biomedicine Chem. Soc. Rev. 2012 41 2740 2779 10.1039/C1CS15237H 22109657 PMC5876014 64. Murphy C.J. Sau T.K. Gole A.M. Orendorff C.J. Gao J. Gou L. Hunyadi S.E. Li T. Anisotropic Metal Nanoparticles: Synthesis, Assembly, and Optical Applications J. Phys. Chem. B 2005 109 13857 13870 10.1021/jp0516846 16852739 65. Brust M. Walker M. Bethell D. Schiffrin D.J. Whyman R. Synthesis of Thiol-Derivatised Gold Nanoparticles in a Two-Phase Liquid–Liquid System J. Chem. Soc. Chem. Commun. 1994 801 802 10.1039/C39940000801 66. Turkevich J. Stevenson P.C. Hillier J. A Study of the Nucleation and Growth Processes in the Synthesis of Colloidal Gold Discuss. Faraday Soc. 1951 11 55 75 10.1039/df9511100055 67. Sylvestre J.-P. Poulin S. Kabashin A.V. Sacher E. Meunier M. Luong J.H.T. Surface Chemistry of Gold Nanoparticles Produced by Laser Ablation in Aqueous Media J. Phys. Chem. B 2004 108 16864 16869 10.1021/jp047134+ 68. Amendola V. Meneghetti M. Laser Ablation Synthesis in Solution and Size Manipulation of Noble Metal Nanoparticles Phys. Chem. Chem. Phys. 2009 11 3805 3821 10.1039/b900654k 19440607 69. Nikoobakht B. El-Sayed M.A. Preparation and Growth Mechanism of Gold Nanorods (NRs) Using Seed-Mediated Growth Method Chem. Mater. 2003 15 1957 1962 10.1021/cm020732l 70. Timoszyk A. Grochowalska R. Mechanism and Antibacterial Activity of Gold Nanoparticles (AuNPs) Functionalized with Natural Compounds from Plants Pharmaceutics 2022 14 2599 10.3390/pharmaceutics14122599 36559093 PMC9784296 71. Ratan Z.A. Haidere M.F. Nurunnabi M. Shahriar S.M. Ahammad A.J.S. Shim Y.Y. Reaney M.J.T. Cho J.Y. Green Chemistry Synthesis of Silver Nanoparticles and Their Potential Anticancer Effects Cancers 2020 12 855 10.3390/cancers12040855 32244822 PMC7226404 72. Chithrani B.D. Ghazani A.A. Chan W.C.W. Determining the Size and Shape Dependence of Gold Nanoparticle Uptake into Mammalian Cells Nano Lett. 2006 6 662 668 10.1021/nl052396o 16608261 73. Fröhlich E. The Role of Surface Charge in Cellular Uptake and Cytotoxicity of Medical Nanoparticles Int. J. Nanomed. 2012 7 5577 5591 10.2147/IJN.S36111 PMC3493258 23144561 74. Overzet F. Ghijsen R.T. Drenth B.F.H. De Zeeuw R.A. Multichannel Diode Array UV—Visible Spectrophotometer as Detector in Screening for Unknown Butoprozine Metabolites in Dog Bile by High-Performance Liquid Chromatography J. Chromatogr. A 1982 240 190 195 10.1016/S0021-9673(01)84021-8 7096514 75. Becker E.D. Farrar T.C. Fourier Transform Spectroscopy: New Methods Dramatically Improve the Sensitivity of Infrared and Nuclear Magnetic Resonance Spectroscopy Science 1972 178 361 368 10.1126/science.178.4059.361 5077326 76. Bhattacharjee S. DLS and Zeta Potential—What They Are and What They Are Not? J. Control. Release 2016 235 337 351 10.1016/j.jconrel.2016.06.017 27297779 77. Abd Mutalib M. Rahman M.A. Othman M.H.D. Ismail A.F. Jaafar J. Scanning Electron Microscopy (SEM) and Energy-Dispersive X-Ray (EDX) Spectroscopy Membrane Characterization Elsevier Amsterdam, The Netherlands 2017 161 179 978-0-444-63776-5 78. Ahmad A. Pervaiz M. Ramzan S. Kiyani M.Z. Khan A. Ahmad I. Asiri A.M. Role of XRD for Nanomaterial Analysis Nanomedicine Manufacturing and Applications Elsevier Amsterdam, The Netherlands 2021 149 161 978-0-12-820773-4 79. Saadatkhah N. Carillo Garcia A. Ackermann S. Leclerc P. Latifi M. Samih S. Patience G.S. Chaouki J. Experimental Methods in Chemical Engineering: Thermogravimetric Analysis—TGA Can. J. Chem. Eng. 2020 98 34 43 10.1002/cjce.23673 80. Hymavathi K. Rani A.S. Synthesis and Characterization of Gold Nanoparticles (AuNPs) from Chrozophora rottleri (Geiseler) Spreng. An Evaluation of Antioxidant and Antimicrobial Activities J. Am. Med. Sci. Res. 2024 3 1 14 10.51470/AMSR.2024.03.02.01 81. Kumar P. Nagarajan A. Uchil P.D. Analysis of Cell Viability by the MTT Assay Cold Spring Harb. Protoc. 2018 2018 pdb.prot095505 10.1101/pdb.prot095505 29858338 82. Saraste A. Morphologic and Biochemical Hallmarks of Apoptosis Cardiovasc. Res. 2000 45 528 537 10.1016/S0008-6363(99)00384-3 10728374 Figure 1 Following sonication, the color changes from yellow ( A 3+ B C Figure 2 UV–visible spectrum of the MAE-AuNPs. Figure 3 Fourier transform infrared (FTIR) spectra of ( A B Figure 4 The DLS ( A B C D E Figure 5 XRD pattern of the MAE-AuNPs. Figure 6 TGA of the MAE-AuNPs: red represents the TGA of the MAE extract and black represents the TGA of MAE-AuNPs. Figure 7 Antioxidant activity of the MAE-AuNPs using ( A 2 2 B p Figure 8 The cell viability of HCT116 colorectal, MDA-MB-231 breast, Capan-2 pancreatic, and 22RV1 prostate cancer cells is inhibited by the MAE-AuNPs. For 24, 48, and 72 h, cells were treated with and without AuNPs at the specified concentrations. The vehicle was controlled by DMSO, and the cell viability was assessed by an MTT assay. The data are presented as a percentage of the corresponding control cells and show the mean ± SEM of three separate experiments ( n p p p Figure 9 MAE-AuNPs cause MDA-MB-231 cells to undergo apoptosis. ( A B pharmaceuticals-18-01294-t001_Table 1 Table 1 The parameters of the MAE-AuNPs, including their morphology, size, and charge distribution. Parameter MAE-AuNPs Interpretation Particle size ~200–500 nm Nanometric with some aggregates Zeta potential −19.07 mV MAE-AuNPs have moderate stability, while the crude ethanolic plant extract is unstable SEM Aggregated clusters MAE-AuNPs tend to aggregate, confirming DLS and zeta potential data EDX C ~50% High carbon and gold content pharmaceuticals-18-01294-t002_Table 2 Table 2 The IC 50 Cancer Cell Line IC 50 HCT116 22.7 ± 0.3 MDA-MB-231 10 ± 0.06 Capan-2 41.1 ± 0.09 22RV1 52 ± 0.71 ",
  "metadata": {
    "Title of this paper": "Morphologic and Biochemical Hallmarks of Apoptosis",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472287/"
  }
}