{
  "title": "Paper_687",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468962 PMC12468962.1 12468962 12468962 41008868 10.3390/cancers17183025 cancers-17-03025 1 Systematic Review Artificial Intelligence and Machine Learning in Sexual Health and Dysfunction Across the Cancer Care Continuum: A Systematic Review https://orcid.org/0000-0002-4870-4635 Salama Vivian 1 2 * † https://orcid.org/0000-0002-4525-1693 Godinich Brandon M. 3 † https://orcid.org/0009-0008-4490-6222 Lilly Peyton M. 4 Pifer Phillip M. 2 https://orcid.org/0009-0003-6684-736X Duckworth Adrienne L. 1 Hall Samantha J. 1 Alabboodi Maher 2 Siochi R. Alfredo 2 Clump David A. 2 https://orcid.org/0000-0003-3769-3210 Emadi Ashkan 1 Cioni Dania Academic Editor 1 aduckwor@hsc.wvu.edu shall19@hsc.wvu.edu ashkan.emadi@hsc.wvu.edu 2 ppifer@hsc.wvu.edu mjalabboodi@hsc.wvu.edu rasiochi@hsc.wvu.edu dclump@hsc.wvu.edu 3 brandon.m.godinich@uth.tmc.edu 4 pl00020@mix.wvu.edu * vivian.salama@hsc.wvu.edu † The authors contributed equally to this manuscript as co-first authors. 16 9 2025 9 2025 17 18 497140 3025 25 8 2025 08 9 2025 10 9 2025 16 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Many people with cancer experience sexual health problems as a result of their disease or treatment, but this important aspect of quality of life is often overlooked in research and clinical care. New technologies such as artificial intelligence and machine learning can help clinicians and researchers better understand, predict, and manage these problems by analyzing large amounts of health data. In this study, we reviewed all published research that applied these advanced technologies to sexual health across different stages of cancer care, from prevention and diagnosis to treatment and survivorship. We found that while some early results show potential, most studies have important limitations, such as lack of standard measures, reporting transparency, and proper performance reporting. Our findings highlight the need for more rigorous and high-quality research in digital technologies in cancer. With further development, these tools could support more personalized care and improve sexual health outcomes for cancer survivors. Background: Methods: Results: n n n n Conclusions: artificial intelligence machine learning sexual health sexual dysfunction cancer oncology This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Sexual dysfunction (SD) and sexual health problems are common distressing and often under-addressed issues among both male and female patients with cancer and without cancer [ 1 2 3 4 1 2 4 5 Sexual problems in patients with cancer are multifactorial, arising from both direct and indirect effects. Cancers involving reproductive organs (e.g., cervical or prostate) and treatments such as surgery, chemotherapy, radiation therapy, and hormonal therapy can damage vascular and neural structures, disrupt hormone levels, and contribute to fatigue and pain [ 6 Figure 1 6 7 8 9 10 11 1 12 13 14 Despite the high prevalence of these sexual issues, many patients with cancer report receiving little to no information or guidance on how to manage them [ 4 14 15 16 17 18 18 Artificial intelligence (AI) and machine learning (ML) technologies are increasingly being explored to address sexual health problems and dysfunction management [ 19 19 20 The development of these AI tools has laid the groundwork for a growing number of studies applying AI to predict treatment-related sexual health outcomes in oncology [ 19 21 22 Artificial intelligence tools offer a range of promising applications to further address sexual health in patients with cancer across the cancer care continuum, as summarized in Figure 1 22 23 24 Our scientific questions in this review were: What are the key applications of AI-ML models in managing sexual health in oncology? Which AI-ML algorithms are commonly used to address sexual health and SD throughout every stage of cancer care? Which AI-ML models have demonstrated the highest performance in predicting sexual health outcomes? What is the overall quality of studies applying AI and ML techniques to sexual health in cancer care, including adherence to TRIPOD+AI guidelines for transparent and accurate model performance reporting and the percentage of risk of bias? To what extent are AI and ML effective in improving sexual health and predicting SD among cancer patients? The main objective of this review was to address current gaps in knowledge by evaluating existing literature on the application of AI-ML in predicting SD and improving sexual health outcomes and QoL in individuals affected by cancer. 2. Materials and Methods 2.1. Protocol Registration The systematic review was registered in the international prospective register database of systematic reviews (PROSPERO) on 27 February 2025 (ID number: CRD420250655313) in the context of human health care. 2.2. Search Strategy and Screening Process A comprehensive systematic search of PubMed, Ovid EMBASE, and Web of Science databases was conducted for publications in English up to 18 February 2025. The concepts searched included: “artificial intelligence,” “machine learning,” “deep learning,” “neural networks,” “sexual dysfunction,” “sexual impairment,” “erectile dysfunction,” and “sexual health.” The terms were combined using AND/OR Boolean operators. Only original human studies were included; animal studies, reviews, and conference abstracts were excluded. The search strategy using Boolean operators is described in Supplementary File S1 The screening process was conducted with two independent reviewers (VS and BG). We first screened titles and abstracts, and then screened the full text. Inclusion criteria: Studies eligible to be included in this systematic review had to meet all of these criteria: (1) studies applied AI or ML models in sexual health or sexual dysfunction prediction or management (i.e., either directly or indirectly related to sexual health), (2) studies in the cancer population or in the cancer care continuum (e.g., cancer screening, detection, diagnosis, treatment, or survivorship), (3) full original articles in English, (4) studies involved human subjects, and (5) models were tested for performance. Exclusion criteria: Articles were excluded if they met any of the following criteria: (1) the study was beyond the study aim/scope, (2) no AI or ML model was applied, (3) not an original study (i.e., review article, letter, conference abstract, editorial, or response), (4) no sexual health, sexual disease, or dysfunction (biological sex, gender, or sexual minority topics were excluded), (5) not in cancer care or oncology fields, (6) duplicate publication or correction of an original article, and (7) descriptive study that did not apply or test a model. The primary outcome of this review was to identify the applications and performance of AI and ML models in predicting, detecting, or managing sexual dysfunction and sexual health outcomes in cancer populations across the care continuum. 2.3. Data Synthesis, Collection, and Analysis The systematic review followed the Preferred Reporting Items for Systematic Reviews and Meta-Analysis (PRISMA) guidelines (checklist in Supplementary File S2 2.3.1. Data Extraction Data from eligible studies were extracted into standardized Excel sheets. Extracted variables included study demographics (author, year, journal, and country), study design, cancer type, AI-ML methodology, input and outcome variables, dataset characteristics, validation type, and reported model performance metrics. Performance outcomes were standardized where possible (e.g., AUC, accuracy, sensitivity, specificity, and F1 score). Where summary measures were missing or non-comparable, narrative description was applied. 2.3.2. Presentation of Results Results were summarized in tabular format to highlight study characteristics, AI methodologies, and reported outcomes. Visualizations (e.g., bar charts, pie charts, and flow diagrams) were generated in Excel to illustrate the study distribution, TRIPOD+AI adherence, cancer types, and research strategy. 2.3.3. Synthesis Methods Due to heterogeneity in study designs, cancer populations, AI models, and outcome measures, no formal meta-analysis was conducted. A narrative synthesis approach was applied, grouping studies by cancer continuum phase (screening, diagnosis, treatment, and survivorship) and AI methodology (ML, DL, and hybrid approaches). This approach was chosen to allow meaningful comparison while acknowledging methodological diversity. 2.3.4. Exploring Heterogeneity Heterogeneity was qualitatively explored by stratifying studies based on cancer type, AI model category, and validation approach. 2.3.5. Sensitivity Analysis No analyses were conducted due to the limited number and heterogeneity of eligible studies. The small sample size of included publications and the diversity of AI models and outcomes precluded meaningful sensitivity testing. Included articles were categorized according to the applications of AI-ML models in cancer continuum phases and other applications. Excel sheets were used in collecting data, data analysis, and figure creation. 2.4. Data Quality and Risk of Bias Screening of the identified articles was performed blindly by two reviewers. Full texts of the included articles were assessed thoroughly by three reviewers (BG, VS, and PL). The materials and methods of the studies and the results sections were assessed. If the study was descriptive and no results were stated, the article was excluded. Corrections, non-full articles, or full articles that could not be accessed were excluded. To evaluate the overall quality of the included articles, a rigorous assessment was conducted, focusing on appraising both the risk of bias and adherence to reporting guidelines for each individual article. The risk of bias was assessed using the Prediction model Risk of Bias Assessment Tool (PROBAST), which examines four domains (participants, predictors, outcomes, and analysis) through 20 methodological questions to determine the overall risk of bias (checklist in Supplementary File S3 25 26 27 28 29 27 30 Supplementary File S4 3. Results 3.1. Search and Screening Results Our comprehensive database search resulted in a total of 3862 studies from PubMed ( n n n Figure 2 3.2. Publication Trends, Design, and Populations All included articles were published between 2002 and 2025 ( Figure 3 Figure 3 The majority of the included articles (7/28) employed a retrospective, uni-institutional design ( Figure 3 n n 3.3. Artificial Intelligence and Machine Learning Models Used in Sexual Health Across Cancer Care Continuum The demographics and characteristics of the final included studies and the AI or ML models used or developed in sexual health-related fields either directly or indirectly across the different phases or the cancer care continuum are illustrated in Table 1 3.3.1. Early Detection, Prevention, and Diagnosis Phases Artificial intelligence tools are proposed to aid in the early identification of patients at risk for SD, including predictive modeling based on sociodemographic, behavioral, and clinical data, particularly in populations undergoing screening for reproductive/sexual organ-related cancers, such as prostate, cervical, or ovarian cancers [ 31 32 33 34 35 36 44 46 48 53 54 33 45 3.3.2. Automatic Data Extraction Two studies implemented natural language processing (NLP) to help extract large volumes of data from electronic health records (EHRs) and social platforms to identify unspoken or undocumented sexual health concerns (Chao et al., 2022 [ 44 36 36 37 3.3.3. During the Treatment Stage Artificial intelligence and ML are valuable for real-time monitoring of sexual symptoms and supporting treatment decision making. Four studies explored AI algorithms during the cancer treatment stage. Bagshaw et al., 2021 [ 41 42 In radiation oncology, AI and ML technologies are increasingly being leveraged to anticipate treatment-related toxicities and enhance strategies that preserve sexual function. Chan et al., 2022 [ 43 47 22 3.3.4. Post-Treatment and Survivorship Phase Artificial intelligence-driven longitudinal monitoring can track sexual health over time following cancer treatment. Eleven studies focused on the use of AI-ML models to predict sexual function and satisfaction in men, as well as their impact on QoL post-treatment and during the survivorship phase. Among these, eight studies applied multiple AI-ML models to predict SD or ED after radical prostatectomy (RP) in patients with prostate cancer. Bacon et al. [ 31 32 35 40 49 51 31 32 35 40 49 51 24 21 Van Egdom et al., 2020 [ 39 52 Kumar et al., 2014 [ 34 Finally, Hanai et al., 2024 [ 23 3.3.5. Diagnostic Imaging Analysis Three studies used AI-ML tools for diagnostic imaging analysis of patients with cancers of reproductive organs to preserve sexual function and optimize treatment. Hussain et al., 2021 [ 38 50 22 3.3.6. Assessment Tools for Sexual Health in Cancer Care The sexual assessment tools in the included studies were very diverse. The most commonly used patient-reported outcome measures (PROMs) were the EPIC-26 questionnaire ( n n n 3.4. Types, Frequency, and Performance of Artificial Intelligence and Machine Learning Models Used in Sexual Health in Oncology The most frequently used algorithm across studies was regression ( n n n Figure 4 n n Figure 4 n n n n n n n n n n n n A detailed breakdown of regression models by application context is shown in Figure 4 n n The performance of the AI-ML models in the studies included in this review varied based on the target outcome and application. For classification models, studies used discrimination metrics such as area under the receiver operating curve (AUC), sensitivity or recall, specificity or precision, accuracy, or F1 scores. Other studies used root mean square error (RMSE) (Hernandez-Boussard et al. [ 36 24 48 51 24 34 n 51 21 47 49 24 50 22 p 31 32 40 43 44 49 Supplementary Table S1 Performance analysis showed that ensemble models achieved better performance. Tree-based random forest had the strongest performance, with a median of AUC 0.98, (range 0.91–0.99), median sensitivity of 0.98 (range 0.60–0.98), median specificity of 0.99 (range 0.95–0.99), specificity of 0.99 (range 0.95–0.99), and F1 score of 0.99 (range 0.89–0.99). The boosting models (e.g., GBM, XGBoost, and AdaBoost) also achieved well, with a median AUC of 0.94 (range 0.77–0.99), sensitivity of 0.96 (range 0.87–0.99), specificity of 0.97 (range 0.94–0.99), and F1 score of 0.965 (range 0.94–0.99). The KNN model achieved very strong performance, with a median AUC of 0.96 (0.73–0.98). Regression models showed a lower AUC of 0.83 (0.60–0.97), sensitivity of 0.87 (0.68–0.70), and specificity of 0.78 (0.66–0.95). SVMs had the lowest performance, with an AUC of 0.77 (0.69–0.90) and sensitivity of 0.65 (0.60–0.70). See Supplementary Table S2 3.5. Quality of Studies Including Adherence to Transparent Reporting of a Multivariable Prediction Model for Individual Prognosis or Diagnosis Guidelines and Risk-of-Bias Assessment The assessment of TRIPOD adherence across the included studies revealed high variability in reporting quality, as illustrated in Figure 5 Model usability, especially related to handling poor data quality and user interaction, were poorly reported (average 23%). Critical items such as data preparation, subjective interpretation of outcomes or predictors, and blind assessment were poorly reported. Ethical approval (20/28, 71%) and conflicts of interest (18/28, 64%) were often reported, but protocol registration (4/28, 14%), data sharing (11/28, 39%), and code sharing (0/28, 0%) were rarely addressed. Decision curve analysis and clinical utility were almost absent (0–4/28, 0–14%), and blinding of outcome assessment was reported in only 2/28 (7%) studies. Of the 28 included studies, the overall risk of bias was high in all 28 studies (100%). In the participant, predictor, and outcome domains, all 28 studies (100%) were rated as low risk, indicating clear eligibility criteria, well-defined predictors available at the time of model use, and appropriately defined and measured outcomes. However, every study (28/28; 100%) demonstrated a high risk of bias in the analysis domain. 4. Discussion Sexual health remains a critical but underrecognized aspect of oncology care, with significant implications for QoL. Our systematic review demonstrated that while digital technologies such as AI and ML tools are being applied across different stages of the cancer care continuum, high-quality studies are still limited and characterized by important methodological and clinical gaps. The included studies highlighted the applications of AI and ML during screening and early detection of cancers of reproductive organs affecting sexual dysfunction during cancer treatment and post-cancer survivorship. The various applications of AI in sexual health showed the potential of these technologies in sexual health care in oncology; however, rigorous studies are still needed for more accurate and reliable AI models. In recent years, AI digital technologies, particularly NLP and imaging-based tools, have been increasingly employed to automate complex and time-consuming tasks in cancer care. Several studies in this review utilized NLP algorithms to extract relevant PROs and clinical data from unstructured sources such as EHRs, clinical notes, and narrative surveys. Data extraction automation facilitates large-scale analysis of sexual health symptoms that are often under-documented or inconsistently reported in structured data fields. Similarly, AI-driven imaging analysis and auto-segmentation tools have been integrated into radiation oncology workflows to delineate organs at risk with high precision in several cancer types. Choi et al., 2023 [ 55 Most studies applying AI included male patients with prostate cancer, and this concentration reflects both the prevalence of this cancer and the availability of data, but it also highlights a research imbalance. Few studies addressed female gynecological cancers beyond the cervix, and none examined populations affected by sexual health disparities, such as survivors of anal, ovarian, or hematologic malignancies. The discrepancy in cancer types raises concerns about the inclusivity and generalizability of AI-driven solutions, emphasizing the need for more research in other cancer types, particularly those affecting women (gynecological cancers) and underserved populations. Several recent studies investigated the efficacy of ML models for predicting SD or ED. Chen et al., 2024 [ 56 Our review revealed significant heterogeneity and limited use of standardized tools to assess sexual function in cancer patients. Most studies lacked validated, cancer-specific instruments, making comparisons across studies difficult and limiting the clinical applicability of AI-ML models. More than half of the included studies relied on general tools, which were developed outside oncology contexts and fail to capture cancer-specific challenges, such as treatment-induced dyspareunia, vaginal dryness, or body image distress. Even models reporting excellent discrimination were built on outcomes measured with blunt or incomplete tools, raising concerns about construction validity. Without standardized, validated measures, it is difficult to benchmark performance, replicate findings, or translate AI-driven insights into meaningful interventions for patients. The same gaps were also noted in prior reviews (Eeltink et al., 2022 [ 17 57 Suboptimal adherence to TRIPOD+AI guidelines with low compliance in key domains revealed in the results of our study, in addition to lack of model calibration assessment, raise great concerns. Stricter adherence to TRIPOD+AI guidelines is needed, especially in studies leveraging AI and ML in oncology, to ensure transparency, replicability, and trust in predictive model development and evaluation [ 27 28 29 30 Deficiencies in reporting and the quality of AI studies have direct implications for the generalizability and clinical applications of AI-ML models. Without calibration, models may systematically over- or under-estimate risks, making them unreliable in diverse clinical settings. The lack of external validation further undermines confidence in the generalizability of the model and the reproducibility of findings across populations, institutions, or cancer types. Poor handling of missing data and inadequate transparency in reporting limit replicability, making it difficult for clinicians or decision makers to judge the readiness of these tools for practice. In short, even models with high reported performance cannot be confidently translated into real-world oncology care if these methodological weaknesses are not addressed [ 17 52 To enable clinical adoption, healthcare providers need structured guidance on integrating AI-ML into sexual health care within oncology. Validated AI tools can support early risk stratification of sexual dysfunction, timely referrals, and EHR integration to prompt routine discussions. Artificial intelligence-based decision support can identify high-risk patients, such as in radiation oncology, by using autosegmentation to preserve sexual organs and supportive structures. Natural language processing-derived PROs allow real-time monitoring for early intervention. Artificial intelligence tools should support clinical judgment, promoting personalized and equitable care. It is crucial that these tools are rigorously developed and validated through transparent, high-quality studies to ensure their reliability, usability, and acceptance by clinicians and healthcare providers. Multidisciplinary guidelines are needed to standardize use of these digital tools across cancers, settings, and populations, ensuring benefits while minimizing harm. 4.1. Future Studies Future studies must prioritize methodological rigor in applying AI and digital technologies in sexual health care in oncology, ensuring external validation, calibration, and transparent reporting for future clinical applications. Additionally, using standardized outcomes and validated, cancer-specific sexual health measures is very critical for the accuracy and reliability of the models. Moreover, equity and inclusivity through expanding research to cancers affecting women and underserved populations is needed in future studies to increase AI generalizability. 4.2. Limitations The limitations of this review include, first, despite employing a comprehensive search strategy across multiple databases, the number of studies specifically applying AI or ML to sexual health in oncology was limited, highlighting the nascent and underexplored nature of this field. Consequently, studies involving AI applications with potential indirect effects on sexual health (e.g., in reproductive organ cancers) were also included. Second, heterogeneity in cancer types, AI methodologies, models evaluation metrics, patient populations, and sexual health assessment tools hindered a formal meta-analysis and limited the comparability of study outcomes. Third, many included studies lacked external validation and had methodological shortcomings, such as small sample sizes, unclear handling of missing data, and insufficient details regarding model calibration and blinding procedures, which may compromise reproducibility and generalizability. Fourth, over half of the studies did not use validated tools for measuring sexual function or QoL, potentially introducing outcome measurement bias. Finally, publication bias cannot be excluded, as studies with negative or less promising findings may be underrepresented in the published literature. 5. Conclusions Artificial intelligence and machine learning tools hold potential for advancing sexual health care in oncology across all phases of the cancer care continuum, with demonstrated applications in risk prediction, monitoring, and treatment planning. However, the current evidence is constrained by methodological limitations, poor adherence to reporting standards, lack of external validation, and inconsistent or non-validated sexual health measures. Rigorous, high-quality studies are required, especially in AI applications in cancer care for clinical applications. Acknowledgments We thank the WVU Cancer Institute (WVUCI) for the Ignite Award 2025–2026. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/cancers17183025/s1 Author Contributions Conceptualization, V.S., P.M.P., S.J.H., A.L.D., D.A.C. and A.E.; methodology, V.S., B.M.G. and P.M.L.; formal analysis, V.S., B.M.G. and P.M.L.; investigation, B.M.G.; resources, B.M.G.; data curation, V.S., B.M.G. and P.M.L.; writing—original draft preparation, V.S., B.M.G. and P.M.L.; writing—review and editing, P.M.P., S.J.H., A.L.D., M.A., R.A.S., D.A.C. and A.E.; visualization, V.S. and P.M.L.; supervision, D.A.C. and A.E.; funding acquisition, V.S., D.A.C. and A.E. All authors have read and agreed to the published version of the manuscript. Data Availability Statement All data extracted from included studies, including the data collection template, are available from the corresponding author upon reasonable request. Data of AI models performance, risk of bias, and TRIPOD+AI are included in Supplementary File S5 Conflicts of Interest The authors declare that they have no known competing commercial or financial interests or personal relationships that could be constructed as potential conflict of interest. Abbreviations QoL Quality of life SD Sexual dysfunction PRO Patient-reported outcome STI Sexually transmitted infections IUD Intrauterine device ALND Axillary lymph node dissection SLNB Sentinel lymph node biopsy TURP Prior transurethral resection of the prostate HPV Human papilloma virus SF-36 Medical Outcomes Study Short Form–36 Health Status Survey CARES-SF Cancer Rehabilitation Evaluation System–Short Form UCLA University of California at Los Angeles HRQoL Health-related quality of life EPIC-26 Expanded Prostate Cancer Index Composite-26 SHIM Sexual Health Inventory of Men EORTC European Organization for Research and Treatment of Cancer QLQ C-30 Quality of Life questionnaire CX-24 Cervical Cancer-24 IIEF-15 International Index of Erectile Function-15 IIEF-5 International Index of Erectile Function 5 PROMIS Patient-Reported Measurement Information System NCBO National Center for Biomedical Ontology UMLS Unified Medical Language System ISUP International Society of Urological Pathology BREAST-Q Breast-related Quality of life Questionnaire IPSS International Prostate Symptom Score LR Logistic regression DT Decision tree SVM Support vector machine ANN Artificial neural network MLP Multilayer perceptron NLP Natural language processing GLM General linear model RF Random forest kNN k-Nearest neighbor NB Naive Bayes XGB-XGBoost Extreme gradient boosting GBDT Gradient boosting decision tree GBM Gradient boosting model SGB Stochastic gradient boosting MonMLP Monotone multilayer perceptron neural network SVMRadial Support vector machine with radial basis function kernel GaussPrRadial Gaussian process with radial basis function kernel SLDA Stabilized linear discriminant AdaBoost AdaBoost classification tree LMT Logistic model tree TreeBag Bagged classification and regression tree RgeLogistic Regularized logistic regression DL Deep learning NN Neural network FCN Topological fully convolutional network LSTM Long short-term memory References 1. Izci F. Ozdem G. Ilgun A.S. Agacayak F. Duymaz T. Erdogan Z. Alco G. Elbuken F. Ozturk A. Ordu C. Pre-Treatment and Post-Treatment Anxiety, Depression, Sleep and Sexual Function Levels in Patients with Breast Cancer Eur. J. Breast Health 2020 16 219 225 32656524 10.5152/ejbh.2020.5259 PMC7337917 2. Soldera S.V. Ennis M. Lohmann A.E. Goodwin P.J. Sexual health in long-term breast cancer survivors Breast Cancer Res. Treat. 2018 172 159 166 10.1007/s10549-018-4894-8 30027300 3. Schover L.R. Sexual quality of life in men and women after cancer Climacteric 2019 22 553 557 10.1080/13697137.2018.1526893 30380961 4. Schover L.R. Sexuality and fertility after cancer Hematol. Am. Soc. Hematol. Educ. Program. 2005 2005 523 527 10.1182/asheducation-2005.1.523 16304430 5. Mishra N. Singh N. Sachdeva M. Ghatage P. Sexual Dysfunction in Cervical Cancer Survivors: A Scoping Review Women’s Health Rep. 2021 2 594 607 10.1089/whr.2021.0035 35141708 PMC8820405 6. Mayer S. Iborra S. Grimm D. Steinsiek L. Mahner S. Bossart M. Woelber L. Voss P.J. Gitsch G. Hasenburg A. Sexual activity and quality of life in patients after treatment for breast and ovarian cancer Arch. Gynecol. Obs. 2019 299 191 201 10.1007/s00404-018-4922-2 30386993 7. Kinnaird W. Schartau P. Kirby M. Jenkins V. Allen S. Payne H. Sexual Dysfunction in Prostate Cancer Patients According to Disease Stage and Treatment Modality Clin. Oncol. 2025 41 103801 10.1016/j.clon.2025.103801 40132492 8. Tramacere F. Lancellotta V. Casa C. Fionda B. Cornacchione P. Mazzarella C. De Vincenzo R.P. Macchia G. Ferioli M. Rovirosa A. Assessment of Sexual Dysfunction in Cervical Cancer Patients after Different Treatment Modality: A Systematic Review Medicina 2022 58 1223 10.3390/medicina58091223 36143900 PMC9504584 9. Katz A. Interventions for sexuality after pelvic radiation therapy and gynecological cancer Cancer J. 2009 15 45 47 10.1097/PPO.0b013e31819585cf 19197173 10. Barcellini A. Dominoni M. Dal Mas F. Biancuzzi H. Venturini S.C. Gardella B. Orlandi E. Bo K. Sexual Health Dysfunction After Radiotherapy for Gynecological Cancer: Role of Physical Rehabilitation Including Pelvic Floor Muscle Training Front. Med. 2021 8 813352 10.3389/fmed.2021.813352 PMC8852813 35186978 11. Karacan Y. Yildiz H. Demircioglu B. Ali R. Evaluation of Sexual Dysfunction in Patients with Hematological Malignancies Asia Pac. J. Oncol. Nurs. 2021 8 51 57 10.4103/apjon.apjon_40_20 33426190 PMC7785071 12. Heinzler J. Brucker J. Bruckner T. Dinkic C. Hoffmann J. Dornhofer N. Seitz S. Sohn C. Rom J. Schott T.C. Impact of a cervical dysplasia and its treatment on quality of life and sexual function Arch. Gynecol. Obs. 2018 298 737 745 10.1007/s00404-018-4853-y 30076544 13. Aerts L. Enzlin P. Verhaeghe J. Poppe W. Vergote I. Amant F. Sexual functioning in women after surgical treatment for endometrial cancer: A prospective controlled study J. Sex. Med. 2015 12 198 209 10.1111/jsm.12764 25402322 14. Guedes T.S.R. Guedes M.B.O.G. Santana R.D. da Silva J.F.C. Dantas A.A.G. Ochandorena-Acha M. Terradas-Monllor M. Jerez-Roig J. de Souza D.L.B. Sexual Dysfunction in Women with Cancer: A Systematic Review of Longitudinal Studies Int. J. Environ. Res. Public Health 2022 19 11921 10.3390/ijerph191911921 36231221 PMC9564951 15. Taylor J. Ruggiero M. Maity A. Ko K. Greenberger B. Donofree D. Sherif K. Lazar M. Jaslow R. Richard S. Sexual Health Toxicity in Cancer Survivors: Is There a Gender Disparity in Physician Evaluation and Intervention? Int. J. Radiat. Oncol. 2020 108 S136 10.1016/j.ijrobp.2020.07.872 16. Sadovsky R. Basson R. Krychman M. Morales A.M. Schover L. Wang R. Incrocci L. Cancer and sexual problems J. Sex. Med. 2010 7 Pt 2 349 373 10.1111/j.1743-6109.2009.01620.x 20092444 17. Eeltink C. Embaby A. Incrocci L. Ket J.C.F. Liptrott S.J. Verdonck-de Leeuw I. Zweegman S. Sexual problems in patients with hematological diseases: A systematic literature review Support. Care Cancer 2022 30 4603 4616 10.1007/s00520-021-06731-7 35061099 18. Krouwel E.M. Albers L.F. Nicolai M.P.J. Putter H. Osanto S. Pelger R.C.M. Elzevier H.W. Discussing Sexual Health in the Medical Oncologist’s Practice: Exploring Current Practice and Challenges J. Cancer Educ. 2020 35 1072 1088 10.1007/s13187-019-01559-6 31209770 PMC7679345 19. Abou Chawareb E. Im B.H. Lu S. Hammad M.A.M. Huang T.R. Chen H. Yafi F.A. Sexual health in the era of artificial intelligence: A scoping review of the literature Sex. Med. Rev. 2025 13 267 279 10.1093/sxmrev/qeaf009 40121550 20. Himel Mondal S.M. The Role of Large Language Model Chatbots in Sexual Education: An Unmet Need of Research J. Psychosex. Health 2025 7 120 127 10.1177/26318318251323714 21. Saikali S. Reddy S. Gokaraju M. Goldsztein N. Dyer A. Gamal A. Jaber A. Moschovas M. Rogers T. Vangala A. Development and Assessment of an AI-based Machine Learning Model for Predicting Urinary Continence and Erectile Function Recovery after Robotic-Assisted Radical Prostatectomy: Insights from a Prostate Cancer Referral Center Comput. Methods Programs Biomed. 2025 259 108522 10.1016/j.cmpb.2024.108522 39626503 22. Balagopal A. Dohopolski M. Suk Kwon Y. Montalvo S. Morgan H. Bai T. Nguyen D. Liang X. Zhong X. Lin M.H. Deep learning based automatic segmentation of the Internal Pudendal Artery in definitive radiotherapy treatment planning of localized prostate cancer Phys. Imaging Radiat. Oncol. 2024 30 100577 10.1016/j.phro.2024.100577 38707629 PMC11068618 23. Hanai A. Ishikawa T. Kawauchi S. Iida Y. Kawakami E. Generative artificial intelligence and non-pharmacological bias: An experimental study on cancer patient sexual health communications BMJ Health Care Inform. 2024 31 e100924 10.1136/bmjhci-2023-100924 PMC11002430 38575326 24. Agochukwu-Mmonu N. Murali A. Wittmann D. Denton B. Dunn R.L. Montie J. Peabody J. Miller D. Singh K. on behalf of the Michigan Urological Surgery Improvement Collaborative Development and Validation of Dynamic Multivariate Prediction Models of Sexual Function Recovery in Patients with Prostate Cancer Undergoing Radical Prostatectomy: Results from the MUSIC Statewide Collaborative Eur. Urol. Open Sci. 2022 40 1 8 10.1016/j.euros.2022.03.009 35638089 PMC9142747 25. Moons K.G.M. Wolff R.F. Riley R.D. Whiting P.F. Westwood M. Collins G.S. Reitsma J.B. Kleijnen J. Mallett S. PROBAST: A Tool to Assess Risk of Bias and Applicability of Prediction Model Studies: Explanation and Elaboration Ann. Intern. Med. 2019 170 W1 W33 10.7326/M18-1377 30596876 26. Wolff R.F. Moons K.G.M. Riley R.D. Whiting P.F. Westwood M. Collins G.S. Reitsma J.B. Kleijnen J. Mallett S. Groupdagger P. PROBAST: A Tool to Assess the Risk of Bias and Applicability of Prediction Model Studies Ann. Intern. Med. 2019 170 51 58 10.7326/M18-1376 30596875 27. Collins G.S. Dhiman P. Andaur Navarro C.L. Ma J. Hooft L. Reitsma J.B. Logullo P. Beam A.L. Peng L. Van Calster B. Protocol for development of a reporting guideline (TRIPOD-AI) and risk of bias tool (PROBAST-AI) for diagnostic and prognostic prediction model studies based on artificial intelligence BMJ Open 2021 11 e048008 10.1136/bmjopen-2020-048008 34244270 PMC8273461 28. Collins G.S. Reitsma J.B. Altman D.G. Moons K.G. Transparent Reporting of a multivariable prediction model for Individual Prognosis Or Diagnosis (TRIPOD): The TRIPOD Statement Br. J. Surg. 2015 102 148 158 10.1002/bjs.9736 25627261 29. Salama V. Godinich B. Geng Y. Humbert-Vidan L. Maule L. Wahid K.A. Naser M.A. He R. Mohamed A.S.R. Fuller C.D. Artificial Intelligence and Machine Learning in Cancer Pain: A Systematic Review J. Pain Symptom Manag. 2024 68 e462 e490 10.1016/j.jpainsymman.2024.07.025 PMC11534522 39097246 30. Collins G.S. Moons K.G.M. Dhiman P. Riley R.D. Beam A.L. Van Calster B. Ghassemi M. Liu X. Reitsma J.B. van Smeden M. TRIPOD+AI statement: Updated guidance for reporting clinical prediction models that use regression or machine learning methods BMJ 2024 385 e078378 10.1136/bmj-2023-078378 38626948 PMC11019967 31. Bacon C.G. Giovannucci E. Testa M. Glass T.A. Kawachi I. The association of treatment-related symptoms with quality-of-life outcomes for localized prostate carcinoma patients Cancer 2002 94 862 871 10.1002/cncr.10248 11857323 32. Hoffman R.M. Hunt W.C. Gilliland F.D. Stephenson R.A. Potosky A.L. Patient satisfaction with treatment decisions for clinically localized prostate carcinoma. Results from the Prostate Cancer Outcomes Study Cancer 2003 97 1653 1662 10.1002/cncr.11233 12655522 33. D’Souza G. Zhang H.H. D’Souza W.D. Meyer R.R. Gillison M.L. Moderate predictive value of demographic and behavioral characteristics for a diagnosis of HPV16-positive and HPV16-negative head and neck cancer Oral Oncol. 2010 46 100 104 10.1016/j.oraloncology.2009.11.004 20036610 PMC2818855 34. Kumar S. Rana M.L. Verma K. Singh N. Sharma A.K. Maria A.K. Dhaliwal G.S. Khaira H.K. Saini S. PrediQt-Cx: Post Treatment Health Related Quality of Life Prediction Model for Cervical Cancer Patients PLoS ONE 2014 9 e89851 10.1371/journal.pone.0089851 24587074 PMC3935936 35. Barocas D.A. Alvarez J. Resnick M.J. Koyama T. Hoffman K.E. Tyson M.D. Conwill R. McCollum D. Cooperberg M.R. Goodman M. Association Between Radiation Therapy, Surgery, or Observation for Localized Prostate Cancer and Patient-Reported Outcomes After 3 Years JAMA 2017 317 1126 1140 10.1001/jama.2017.1704 28324093 PMC5782813 36. Hernandez-Boussard T. Kourdis P.D. Seto T. Ferrari M. Blayney D.W. Rubin D. Brooks J.D. Mining Electronic Health Records to Extract Patient-Centered Outcomes Following Prostate Cancer Treatment AMIA Annu. Symp. Proc. 2017 2017 876 882 29854154 PMC5977629 37. Best A.L. Logan R.G. Vazquez-Otero C. Fung W. Chee V. Thompson E.L. Villalona S. Thompson L.M.A. Gwede C.K. Daley E.M. Application of a Health Literacy Framework to Explore Patients’ Knowledge of the Link between HPV and Cancer J. Health Commun. 2018 23 695 702 10.1080/10810730.2018.1508257 30153087 PMC6413510 38. Hussain L. Ali A. Rathore S. Saeed S. Idris A. Usman M.U. Iftikhar M.A. Suh D.Y. Applying Bayesian Network Approach to Determine the Association Between Morphological Features Extracted from Prostate Cancer Images IEEE Access 2019 7 1586 1601 10.1109/ACCESS.2018.2886644 39. van Egdom L.S.E. Pusic A. Verhoef C. Hazelzet J.A. Koppert L.B. Machine learning with PROs in breast cancer surgery; caution: Collecting PROs at baseline is crucial Breast J. 2020 26 1213 1215 10.1111/tbj.13804 32160651 PMC7318611 40. Albers L.F. Tillier C.N. van Muilekom E. van Werkhoven E. Elzevier H.W. van Rhijn B.W.G. van der Poel H.G. Hendricksen K. Sexual Satisfaction in Men Suffering From Erectile Dysfunction After Robot-Assisted Radical Prostatectomy for Prostate Cancer: An Observational Study J. Sex. Med. 2021 18 339 346 10.1016/j.jsxm.2020.11.011 33358558 41. Bagshaw H.P. Martinez A. Heidari N. Scheinker D. Pollack A. Stoyanova R. Horwitz E. Morton G. Kishan A.U. Buyyounouski M.K. A personalized decision aid for prostate cancer shared decision making BMC Med. Inform. Decis. Mak. 2021 21 374 10.1186/s12911-021-01732-2 34972513 PMC8720209 42. Charoenkwan P. Shoombuatong W. Nantasupha C. Muangmool T. Suprasert P. Charoenkwan K. iPMI: Machine Learning-Aided Identification of Parametrial Invasion in Women with Early-Stage Cervical Cancer Diagnostics 2021 11 1454 10.3390/diagnostics11081454 34441388 PMC8391438 43. Chan M. Olson R. Lapointe V. Hamm J. Bachand F. Holloway C. Parsons C. Lim P. Using a Weekly Patient-Reported Outcome Questionnaire to Track Acute Toxicity in Patients Undergoing Pelvic Radiotherapy for Gynecologic Cancers Curr. Oncol. 2022 29 3306 3317 10.3390/curroncol29050270 35621660 PMC9140006 44. Chao X. Wang S. Lang J. Leng J. Fan Q. The application of risk models based on machine learning to predict endometriosis-associated ovarian cancer in patients with endometriosis Acta Obstet. Gynecol. Scand. 2022 101 1440 1449 10.1111/aogs.14462 36210724 PMC9812095 45. Gentile F. La Civita E. Della Ventura B. Ferro M. Cennamo M. Bruzzese D. Crocetto F. Velotta R. Terracciano D. A Combinatorial Neural Network Analysis Reveals a Synergistic Behaviour of Multiparametric Magnetic Resonance and Prostate Health Index in the Identification of Clinically Significant Prostate Cancer Clin. Genitourin. Cancer 2022 20 E406 E410 10.1016/j.clgc.2022.04.013 35610113 46. Sun L. Yang L. Liu X. Tang L. Zeng Q. Gao Y. Chen Q. Liu Z. Peng B. Optimization of Cervical Cancer Screening: A Stacking-Integrated Machine Learning Algorithm Based on Demographic, Behavioral, and Clinical Factors Front. Oncol. 2022 12 821453 10.3389/fonc.2022.821453 35242711 PMC8886038 47. Deng L. Wang T. Chen Y. Tang X. Xiang D. A predictive model for residual lesions after LEEP surgery in CIN III patients Front. Med. 2023 10 1326833 10.3389/fmed.2023.1326833 38148909 PMC10751019 48. Hariprasad R. Navamani T.M. Rote T.R. Chauhan I. Design and Development of an Efficient Risk Prediction Model for Cervical Cancer IEEE Access 2023 11 74290 74300 10.1109/ACCESS.2023.3296456 49. Hasannejadasl H. Roumen C. van der Poel H. Vanneste B. van Roermund J. Aben K. Kalendralis P. Osong B. Kiemeney L. Van Oort I. Development and external validation of multivariate prediction models for erectile dysfunction in men with localized prostate cancer PLoS ONE 2023 18 e0276815 10.1371/journal.pone.0276815 36867616 PMC9983834 50. Lei Y. Wang T.H. Roper J. Tian S.B. Patel P. Bradley J.D. Jani A.B. Liu T. Yang X.F. Automatic segmentation of neurovascular bundle on mri using deep learning based topological modulated network Med. Phys. 2023 50 5479 5488 10.1002/mp.16378 36939189 PMC10509305 51. Sibert N.T. Kurth T. Breidenbach C. Wesselmann S. Feick G. Carl E.G. Dieng S. Albarghouth M.H. Aziz A. Baltes S. Prediction models of incontinence and sexual function one year after radical prostatectomy based on data from 20 164 prostate cancer patients PLoS ONE 2023 18 e0295179 10.1371/journal.pone.0295179 38039308 PMC10691723 52. Xu C. Pfob A. Mehrara B.J. Yin P. Nelson J.A. Pusic A.L. Sidey-Gibbons C. Enhanced Surgical Decision-Making Tools in Breast Cancer: Predicting 2-Year Postoperative Physical, Sexual, and Psychosocial Well-Being following Mastectomy and Breast Reconstruction (INSPiRED 004) Ann. Surg. Oncol. 2023 30 7046 7059 10.1245/s10434-023-13971-w 37516723 PMC10562277 53. Chauhan R. Goel A. Alankar B. Kaur H. Predictive modeling and web-based tool for cervical cancer risk assessment: A comparative study of machine learning models MethodsX 2024 12 102653 10.1016/j.mex.2024.102653 38524310 PMC10957413 54. Devi S. Gangarde R. Deokar S. Muqeemuddin S.F. Awasthi S.R. Shekhar S. Sonchhatra R. Joshi S. Public health nurse perspectives on predicting nonattendance for cervical cancer screening through classification, ensemble, and deep learning models Public Health Nurs. 2024 41 781 797 10.1111/phn.13334 38757647 55. Choi M.S. Chang J.S. Kim K. Kim J.H. Kim T.H. Kim S. Cha H. Cho O. Choi J.H. Kim M. Assessment of deep learning-based auto-contouring on interobserver consistency in target volume and organs-at-risk delineation for breast cancer: Implications for RTQA program in a multi-institutional study Breast 2024 73 103599 10.1016/j.breast.2023.103599 37992527 PMC10700624 56. Chen X.Y. Lu W.T. Zhang D. Tan M.Y. Qin X. Development and validation of a prediction model for ED using machine learning: According to NHANES 2001–2004 Sci. Rep. 2024 14 27279 10.1038/s41598-024-78797-2 39516271 PMC11549311 57. Rodrigues-Machado N. Bonfill-Cosp X. Quintana M.J. Santero M. Bartolo A. Olid A.S. Sexual dysfunction in women with breast cancer: A systematic review Support. Care Cancer 2025 33 332 10.1007/s00520-025-09352-6 40163251 PMC11958476 Figure 1 Summary of causes of sexual health problems and dysfunction in patients with cancers (UPPER) and the possible applications of artificial intelligence and machine learning in sexual health and dysfunction in the cancer care continuum (LOWER). Figure 2 PRISMA flow diagram for systematic review of AI and ML in sexual health and dysfunction across the cancer care continuum. Figure 3 Publication trends, cancer types and designs of all included studies applying AI-ML in sexual health across cancer care. ( a b c Figure 4 Types and frequency of AI-ML models used in sexual health across the cancer care. ( a b Figure 5 Frequency of adherence to TRIPOD+AI guidelines checklist domains across the included 28 studies in this review articles applying AI and ML in sexual health across cancer care. cancers-17-03025-t001_Table 1 Table 1 Demographics and characteristics of included studies. Author et al., Year Journal Type of Cancer Number of Population/ AI-ML Type Input Variables Output Outcome Conclusion Sexual Health Assessment Tools Application in Cancer Care Bacon et al., 2002 [ 31  Cancer An international Interdisciplinary Journal of the American Cancer Society Prostate 783 Least square regression models. LR models Sexual function, urinary function, bowel function, covariates: age, marital status, waist circumference, physical activity, smoking status, alcohol intake, comorbid conditions Quality of life: general health-related and cancer-specific. Symptom bother: UCLA bother scales and SF-36 scales: impact of sexual, urinary, and bowel symptoms on overall and cancer-specific quality of life of prostate cancer patients. Prostate cancer patients reported significantly greater bother and effect on QOL from sexual, urinary, and bowel symptoms. Sexual symptoms were strongly associated with worse QoL. SF-36 Cancer survivorship Hoffman et al., 2003 [ 32  Cancer Prostate 2365 LR Age, race/ethnicity, treatment type (active vs. conservative), perception of being cancer-free, urinary and bowel functions, erectile function, general health status, and social support measures Patient satisfaction with treatment decision two years after diagnosis with prostate cancer. Most men were satisfied with their treatment selection for clinically localized prostate carcinoma. Men tended to minimize loss of urinary, bowel, or sexual functions by not perceiving dysfunction as a problem. None reported Post-treatment survivorship D’Souza et al., 2010 [ 33  Oral Oncol Head and Neck (HNSCC) 255 DT Demographics: age, gender, race/ethnicity. Behavioral: tobacco use, alcohol use, sexual behavior (# of oral sex partners), income, education. Biomarkers: HPV16 L1 E6/E7, HPV16 DNA Prediction of tumor HPV16 status (positive vs. negative) in HNSCC as determined by in situ hybridization Models used only demographics (tobacco use, age, gender, race) with moderate predictive values: HNSCC: PPV = 75%, NPV = 68%; Oropharyngeal cancers only: PPV = 55%, NPV = 66%. Addition of HPV biomarkers improved predictions None reported Cancer prediction Kumar, et al., 2014 [ 34  PLoS ONE Cervical 198 SVM with both linear and RBF kernels, 13 variables: age, marital status, vaginal bleeding, vaginal discharge, dyspareunia, abdominal pain, weight loss, parity, bowel or bladder control difficulty, cervical cancer stage, treatment modality, lymphoedema, and peripheral neuropathy. Three post-treatment The prediction model (PrediQt-Cx), based on support vector machine (SVM) for predicting post-treatment HRQoL in cervical cancer patients was developed and internally cross validated. The performance of SVM (linear) exceeded other models in most domains (mean AUC of 0.90). Patients experienced substantial decrease in sexual activity post-treatment. EORTC QLQ C-30 and CX-24, (HRQoL) questionnaires, Post-treatment survivorship Barocas et al., 2017 [ 35  JAMA Prostate 2550 Longitudinal regression model Baseline domain scores (EPIC-26), age, race/ethnicity, comorbidity index, prostate cancer risk stratum (D’Amico classification), physical function (SF-36), social support, depression score, medical decision-making style, treatment type (radical prostatectomy, EBRT, active surveillance) Patient-reported functional outcomes (EPIC-26 domains: sexual, urinary incontinence, urinary irritative, bowel, hormonal); health-related QoL (SF-36); disease-specific and overall survival after prostate cancer treatment. Radical prostatectomy was associated with worse sexual function and urinary incontinence at 3 years compared to EBRT and active surveillance. Radical prostatectomy was associated with improved urinary irritative symptoms. No meaningful long-term differences in bowel or hormonal function. No significant differences in disease-specific survival (≥99.7%) EPIC-26 Post-treatment survivorship Hernandez-Boussard, T., 2017 [ 36  AMIA Annu Symp Proc Prostate 7109 Natural Language Processing Patients’ demographics, health care encounters, diagnosis/problem lists, unstructured EHR clinical notes/documents, lab & diagnosis results, ICD codes, CPT codes, medications, patient history, text features (affirmed, negated, risk discussion mentions of urinary incontinence and ED) Extraction and classification of patient-centered outcomes (urinary incontinence and erectile dysfunction) from clinical notes of EHR. \"NLP pipeline developed and validated for detecting clinical mentions of patient-centered outcomes in prostate cancer patients, including UI and ED. This system showed performance sufficient for health management and treatment decisions.\" \"ICD-9/ICD-10, billing codes, medications, and vocabularies Data extraction EHR Best, A. L., 2018 [ 37  Journal of Health Communication Anal, gynecological, and oropharyngeal 50 Applied thematic framework and digital application Sociodemographic of respondents (age, education level, household income, gender, sexual orientation, and marital status). Attitudes toward digital social prescribing, perceived benefits and challenges, technology acceptance metrics Assessment, understanding, appraising, and applying cancer patients’ HPV information in the context of their cancer diagnosis. Perceptions of digital social prescribing platforms and identification of facilitators and barriers to implementation in mental health services \"The health literacy framework and the digital applications used to explore how patients diagnosed with None reported Data extraction STD diagnosis Hussain et al., 2019 [ 38  IEEE Access Prostate 682 Bayesian Networks MRI prostate cancer images, including morphological features: variables such as area, equidiameter, circulatory 1 and 2, elongatedness, entropy, maximum radius, minimum radius, and eccentricity The associations \"A Bayesian network quantified the association between different imaging morphological features of prostate cancers. None reported Imaging analysis van Egdom et al., 2020 [ 39  Breast J Breast 764 GLM Age, medical status, tumor characteristics, and possible (neo)adjuvant treatment indications/treatment characteristics Prediction of patient-reported outcomes (PROs) post-surgery, including HRQoL, sexual, physical, and psychosocial function No significant predictive relationship was found; model accuracy aligned with outcome prevalence, not effective for individual-level prediction. EORTC QLQ-C30 Post-treatment survivorship Albers et al., 2021 [ 40  J Sex Med (The Journal of Sexual Medicine) Prostate 884 Mixed effect model (regression model) Age, baseline IIEF-5 score, baseline overall satisfaction score, sexual desire score, IPSS, incontinence score, fascia preservation score, QoL \"ED due to robot-assisted radical prostatectomy (RARP). Primary: Overall satisfaction with sexual life (from IIEF-15 Q13+Q14) The model proved that no increase or decrease in overall satisfaction with sexual life between 6 m and 36 m follow-up after RARP, while a higher overall satisfaction at baseline and high sexual desire were associated with satisfaction at 24 and 26 m follow-up. Erectile function score was not correlated with overall satisfaction. IIEF-15 Post-treatment survivorship Bagshaw et al., 2021 [ 41  BMC Medical Informatics and Decision Making Prostate 750 Decision-making template (web-based decision aid) NCCN risk group, pre-treatment health state (ED, urinary incontinence, nocturia, bowel incontinence), treatment options (AS, SBRT, EBRT ± HDR ± ADT), 5-year biochemical control rate, patient preference thresholds, willingness-to-be-paid values Prostate cancer patients’ treatment decisions and engagement. [Personalized ranking of treatment alternatives based on individual risk, preferences, side effect tolerances, and value assessment] Web-based decision aid was successfully built; visual interface allowed real-time updates based on patient preferences. Every treatment could be optimal for different individuals. No single dominant option across all users. EPIC questionnaire Cancer treatment Charoenkw et al., 2021 [ 42  Diagnostics Cervical 1112 RF-classifier, named iPMI The initial model, iPMI-Econ: basic clinical and pathological features before surgery: demographics, tumor characteristics, and clinical staging. Presence or absence of parametrial invasion (PMI) was confirmed during surgery. iPMI-Power was effective and had superior performance compared to other well-known ML classifiers in predicting PMI. None reported Cancer treatment Agochukwu-Mmonu et al., 2022 [ 24  European Urology Open Science Prostate 2653 GBDT Clinical and demographic features: age, race, BMI, diabetes, PSA, T stage, Gleason grade, prostate volume, baseline/post-op EPIC-26 sexual domain score, PROMIS satisfaction with sex life, use of erectile aids, nerve-sparing status, surgical volume Sexual function, sexual activity, and satisfaction with sexual life at 3, 6, 12, and 24 months after radical prostatectomy (RP). EPIC-26 sexual domain score, EPIC-26 dichotomized score ≥73, erection quality at 12 and 24 months A dynamic ML model (GBM) was developed and validated to predict sexual function before and after RP. GBM achieved high performance for preoperative predictions and even better performance for dynamic predictions EPIC-26. Post-treatment survivorship Chan et al., 2022 [ 43  Current Oncology (Curr Oncol) Gynecologic 698 LR Patient demographics (age, cancer type, concurrent chemotherapy, radiation technique), baseline and weekly patient-reported symptom scores from a 49-item Acute toxicity trends, specifically GI and GU toxicity severity, during RT PRO data can be used to track acute toxicity (including GU and sexual activity) during RT in gynecological cancers. Patients were approximately 6 times less likely to respond to questions about vaginal and sexual health after treatment \"PRO questionnaire. EPIC Bowel/Urinary 2.0, PRO-CTCAE GI, EORTC QLQ CX24, and EuroQol Cancer treatment Chao et al., 2022 [ 44  Acta Obstetricia et Gynecologica Scandinavica Ovarian 6809 NLP for data extraction from EMR A total of 94 demographic and clinicopathologic variables for GBM. Endometriosis-associated ovarian cancer (EAOC) [which significantly affected sexual health/activity and induced pain] ML-based risk model was constructed to predict endometriosis EAOC, which had high sensitivity and specificity. The ML model performed significantly better than the LR model None reported Cancer prediction and diagnosis Gentile et al., 2022 [ 45  Clinical Genitourinary Cancer Prostate 135 NN (DL) Prostate Health Index (PHI), PI-RADS score from multiparametric MRI (mpMRI), Gleason score from pathology Identify high-grade prostate cancer. Binary classification: clinically significant prostate cancer (csPCa) vs. indolent PCa (based on Gleason score ≥7 or 7 with pattern 4) Deep learning combining mpMRI and PHI may help to better estimate the risk category of PCa at initial diagnosis None reported Cancer diagnosis Sun et al., 2022 [ 46  Frontiers in Oncology Cervical 858 Stacking integrated ML algorithm that combined multiple base models, including RF, SGB, Hormonal contraceptives (years), number of pregnancies, smoking (years), Accurate identification of women at high risk of cervical cancer A stacking integrated model that incorporated multiple algorithms was developed to improve prediction accuracy of women at high risk for cervical cancer. The stacking integrated model with TreeBag, XGBoost, and MonMLP as base classifiers and LMT as the result classifier showed the best performance. None reported Cancer prediction/prevention Deng et al., 2023 [ 47  Frontiers in Medicine CIN3 (cervical) 436 Multivariate LR analysis for independent risk factors Preoperative ECC pathology, LEEP margin status, post-LEEP follow-up HPV, post-LEEP follow-up Thin Prep Cytology Test (TCT), and gland involvement Presence or absence of residual lesions confirmed by histopathology after total hysterectomy performed within three months post-LEEP. The post-LEEP follow-up HPV, post-LEEP follow-up TCT, and gland None reported Cancer treatment Hariprasad et al., 2024 [ 48  IEEE Access Cervical 858 GBM Age, number of sexual partners, age at first sexual intercourse, smoking status, hormonal contraceptive use, number of pregnancies, history of STIs, IUD, and other gynecological factors Risk of cervical cancer The gradient boosting model was effective in associating risk factors with cervical cancer prediction, with an accuracy of 98.9% None reported Cancer prediction/prevention Hasannejadasl et al., 2023 [ 49  PLoS ONE Prostate 964 Logistic regression algorithm coupled with recursive feature elimination (RFE). (i) At diagnosis: PROMs data from the EPIC26 questionnaire; (ii) tumor characteristics, such as tumor staging, PSA at diagnosis, and ISUP Gleason grade group; (iii) patient characteristics: age, height, weight, smoking, comorbidities, and treatment Erectile dysfunction (the frequency of erections) at 1 year and 2 years post-diagnosis with prostate cancer. Two models generated using an LR algorithm coupled with RFE revealed high AUC (0.84 and EPIC-26 questionnaire Cancer survivorship Lei et al., 2023 [ 50  Med Phys Prostate 60 DL-based topological modulated network MRI images Automatic segmentation of the left and right neurovascular bundles (NVBs) on MRI. The topological modulated network achieved strong performance in segmenting both left and right NVBs when compared to expert-drawn contours None reported Imaging analysis Sibert et al., 2023 [ 51  PLoS ONE Prostate 20164 Lasso regression, Baseline and follow-up EPIC-26 sexual function scores, age, baseline function, hormone therapy use, dosimetric parameters, comorbidities Urinary incontinence and sexual function scores at one year after radical prostatectomy (RP), as assessed by EPIC-26. Lasso regression model was developed and validated to predict functional outcomes (sexual function and incontinence) 1 y after RP. Models showed appropriate predictive properties EPIC-26 questionnaire Post-treatment survivorship Xu et al., 2023 [ 52  Ann Surg Oncol Breast 1454 LR with elastic net BMI, preoperative BREAST-Q scores for physical well-being, sexual well-being, and psychosocial well-being; reconstruction Predict changes in physical, sexual, and psychosocial well-being two years following PMBR ML models are capable of accurately predicting long-term BREAST-Q Post-treatment survivorship Balagopal et al., 2024 [ 22  Physics & Imaging in Radiation Oncology Prostate 86 DL Imaging modality (CT and MRI), segmentation metrics (DSC, ASD, and HD95), dose-volume parameters (Dmean, V20), observer contour quality scores Internal pudendal artery (IPA) segmentation quality for preserving sexual potency, dosimetric similarity, and improvement in physician contouring efficiency and quality A DL model for good-quality IPA contours with DSC 62.2%, which improved uniformity of segmentation and facilitating standardized IPA segmentation in clinical trials and practice None reported Imaging analysis Chauhan et al., 2024 [ 53  MethodsX Cervical 858 CHAMP (cervical health assessment using machine learning for prediction) included multiple ML, including XGBoost Age, HPV results, cytology outcome, number of sexual partners, smoking, hormonal contraceptive use, IUD use, STDs, etc. Prediction of cervical cancer risk (binary classification) The study tested several ML None reported Cancer prediction/prevention Devi et al., 2024 [ 54  Public Health Nursing Cervical 1046 Classification Models: NB 22 predictors Prediction of nonattendance to cervical cancer screening Employing ensemble and DL models proved most effective in None reported Cancer screening/prevention Hanai et al., 2024 [ 23  BMJ Health & Care Informatics Mixed 100 Generative AI (GPT) Epidemiological surveys data regarding sexual difficulties among cancer survivors. [The prompt ‘I am a cancer survivor. Please create a question about a problem that is hard to consult’ generated 100 questions by Generated questions categorized into 7 topics based on the symptom categories specified in the clinical guidelines: sexual response, body image, intimacy, sexual functioning, vasomotor symptoms, genital symptoms, and others. Distribution and content of AI-generated answers regarding sexual health in cancer survivors \"Generative AI can serve to provide health information on sensitive topics such as sexual health\" None reported Data Extraction/Cancer survivorship Saikali et al., 2025 [ 21  Computer Methods and Programs in Biomedicine Prostate 8524 Neural Network (ANN), SVM, XG Boost Urinary continence: patient age, BMI, prostate size, and baseline urinary symptom severity as measured by IPSS. Clinical factors: prior (TURP), tumor stage, prostate volume, and the Charlson Comorbidity Index. Prediction of urinary control and erectile function following nerve-sparing robotic radical prostatectomy RARP (12 ms post-op) AI-based models (ANN) show potential in predicting postoperative functional outcomes (potency (sexual function) and continence) following RARP Sexual Health Inventory of Men (SHIM) Post-treatment survivorship ",
  "metadata": {
    "Title of this paper": "Sexual dysfunction in women with breast cancer: A systematic review",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468962/"
  }
}