{
  "title": "Paper_75",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12491401 PMC12491401.1 12491401 12491401 41039030 10.1038/s41598-025-20184-6 20184 1 Article In vivo antitumor activity of doxorubicin loaded on chitosan functionalized Pb 2 2 12 22 Radwan Aliaa M. alyaa_radwan@science.tanta.edu.eg 1 El-Atrash Afaf 2 Elkholy Maha 2 Nawar Nagat Fawzy 3 Tousson Ehab ehabtousson@science.tanta.edu.eg 2 Ghoneim Amina I. 4 1 https://ror.org/016jp5b92 grid.412258.8 0000 0000 9477 7793 Biochemistry Division, Chemistry Department, Faculty of Science, Tanta University, 2 https://ror.org/016jp5b92 grid.412258.8 0000 0000 9477 7793 Zoology Department, Faculty of Science, Tanta University, 3 https://ror.org/03svthf85 grid.449014.c 0000 0004 0583 5330 Central Lab, Faculty of Science, Damanhour University, 4 https://ror.org/016jp5b92 grid.412258.8 0000 0000 9477 7793 Physics Department, Faculty of Science, Tanta University, 2 10 2025 2025 15 478255 34313 26 2 2025 12 9 2025 02 10 2025 04 10 2025 04 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Nanoscale materials can improve cancer treatment by safely and efficiently delivering chemotherapeutic drugs. This study was designated to load the anticancer drug doxorubicin (DOX) into chitosan-coated Pb2Mn2Fe12O22 magnetic nanoparticles (CT-MNPs) and compare their physicochemical and biological effects with free drug, in addition to the therapeutic role of DOX-CT-MNPs to acting efficaciously in restraint of cancer cells growth and evolution using Ehrlich solid tumor model (EST). Forty female mice were randomly and equally split into four groups (EST; EST + Free DOX; EST + CT-MNPs; and EST + DOX-CT-MNPs). Our findings show that treating EST with DOX, either free or loaded on CT-MNPs, inhibits tumour growth by producing oxidative stress, disrupting the antioxidant system, activating apoptosis, and arresting the cell cycle. Furthermore, DOX loaded on CT-MNPs had greater anticancer activity than DOX in its free form. This highlights the potential advantages of CT-MNPs in tumour therapy and drug delivery. Keywords Ehrlich solid tumor Doxorubicin Chitosan-coated ferrite nanoparticle Apoptosis Antioxidant Subject terms Drug delivery Biochemistry Tanta University Open access funding provided by The Science, Technology & Innovation Funding Authority (STDF) in cooperation with The Egyptian Knowledge Bank (EKB). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Cancer, a non-communicable disease, poses a significant public health threat to both developed and developing countries 1 2 3 4 6 7 Although doxorubicin (DOX) is the first clinically licensed medication for solid tumors, transplantable leukemias, and lymphomas, its non-specific toxicity to healthy tissues limits its clinical utility 8 9 10 11 12 13 14 15 Chitosan is one of the most widely studied and naturally existing polymers that have garnered a lot of interest in the pharmaceutical and biomedical applications for its low immunogenicity and biodegradability 16 17 Thus, this study was designed to load the anticancer drug doxorubicin (DOX) into chitosan-coated ferrite nanoparticles (CT-MNPs) and compare their physicochemical and biological effects with free drug. To further investigate the therapeutic and anti-tumor potential of newly synthesized DOX-CT-MNPs Nano-system against EST growth and development. Materials and methods Materials Doxorubicin HCl (50 mg) was obtained from Hikma Pharmaceuticals (Badr city, Cairo, Egypt). Chitosan was obtained from Alpha Chemica, India. Preparation of Y-Type Pb 2 2 12 22 The nanocrystalline Pb 2 2 12 22 18 Functionalization of Pb 2 2 12 22 CT functionalized MNPs were made with changes from the ones published before 13 Encapsulation of doxorubicin (DOX) DOX encapsulation was taken from that formerly published, with modifications 19 The amount of DOX in the DOX-loaded CT-MNPs was measured using a spectrophotometer (Shimadzu 2100S UV–Vis spectrophotometer, Japan) at 480 nm that corresponds to the absorption peak of DOX. The encapsulation efficiency was estimated using the following equation. \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\text{Efficiency}}\\,{\\text{of}}\\,{\\text{Encapsulation }}\\,\\left( \\% \\right)\\, = \\frac{\\begin{gathered} \\left( {{\\text{DOX}}.{\\text{Total}}} \\right) \\hfill \\\\ - \\left( {{\\text{DOX}}. {\\text{Free}}} \\right) \\hfill \\\\ \\end{gathered} }{{\\left( {{\\text{DOX}}.{\\text{Total}}} \\right)}}\\, \\times \\,100$$\\end{document} In vitro drug release The in vitro release of DOX-CT-MNPs was investigated via the dialysis bag method 20 Characterization of nanoparticles The surface morphology of nanoparticles was conducted using a JeoL-JSM- 6510 scanning electron microscope (SEM). The crystalline nature of the prepared nanoparticles was confirmed by X-ray diffraction analysis (XRD) using GNR APD 2000 Pro X-ray diffractometer step scan type and CuK α1 −1 Experimental animals The study involved 40 Swiss albino mice from the Egypt Vaccine Company’s animal house colony in Egypt. The mice were housed under ambient conditions, with a commercial diet and water supply. All experimental protocols were approved by the institutional research ethics committee of Tanta University, Faculty of Science (IACUC-SCI-TU-0223) 21 22 Induction of Ehrlich solid tumour (EST) The Egyptian National Cancer Institute (Cairo University, Egypt) supplied the mice that carried Ehrlich ascites carcinoma (EAC). To sustain the EST, viable EAC cells (2.5–3 × 10 6 23 Experimental design After two weeks of tumor cell inoculation, forty mice (20-25g) were randomly allocated into equal four groups. The animals underwent the following treatment protocols: EST group: (Positive control group): mice carrying EST and received saline. EST + Free DOX group: mice carrying EST and treated with DOX in a dose of 4 mg/kg 24 EST + CT-MNPs group: mice carrying EST and treated with suspension of magnetic ferrite nano particles coated by Chitosan (CT-MNPs) in a dose of 24 mg/kg EST + DOX-CT-MNPs group: mice carrying EST and treated with suspension of DOX loaded on CT-MNPs in a dose of 24mg/kg Overall, mice were given the drugs orally every 3 days over two weeks. Tumor samples preparation Following completion of the prior treatments, mice were anesthetized with isoflurane (1–4%) and sacrificed via cervical dislocation. The tumor tissues were then dissected and weighed. Tumor samples were fixed for 16 h in paraformaldehyde solution before being put into paraffin wax. Tumor specimens were then produced from the paraffin blocks for histopathologic staining with hematoxylin and eosin (H&E) as well as immunohistochemistry staining for PCNA and caspase 3. Tumor samples were immediately frozen and kept for further biochemical, flow cytometric analysis, and qPCR as detailed subsequently. Evaluation of lipid peroxidation and antioxidants Using kits procured from Biodiagnostic Company, Egypt, the level of MDA as an oxidative stress biomarker in tumor homogenate was assessed using manufacturer-recommended approaches 25 26 2 2 27 28 Cell cycle analysis Flow cytometric measurements were utilized to determine cell cycle distribution through different stages. Tumor samples taken from non-treated and tumor-bearing treated groups were crushed after being snap frozen in liquid nitrogen. The cells were probed with propidium iodide and kept for 1 h in the dark. A cell cycle profile study was carried out by an Accuri C6 flow cytometer, and apoptotic cells were recognized as a sub-G1 peak. using the cell Quest analysis program (Becton Dickinson, Sunnyvale, CA, USA) 29 Apoptosis determination by flowcytometry The proportion of cells that go through apoptosis was measured using Annexin V/PI double staining kit (Immunostep, Spain) according to the manufacturer’s procedure. Tumor tissues from all experimental groups were broken down after being freeze-dried in liquid nitrogen. Following a wash with PBS, the tumor cells were suspended in an appropriate binding buffer. Annexin-V/PI staining solution was then mixed with the cell suspension and kept in the dark for 15 min. The samples were subsequently examined using flow cytometer (Becton Dickinson) 30 Quantitative real-time polymerase chain reaction (qRT-PCR) The total RNA from the tumor tissues of the untreated and treated EST groups was extracted and purified using an RNA extraction kit (Thermo Scientific, Fermentas, K0731). The quantity of RNA was estimated by a Uv–Vis spectrophotometer Q5000/USA. Reverse transcription kits (Thermo Scientific, Fermentas, EP0451) were used to synthesize complementary DNA (cDNA) from 5 µg of RNA, following manufacturer specifications. qPCR was utilized to evaluate the relative expression levels of PTEN, GSK-3β, and MAPK1 using 2X Maxima SYBR Green/ROX qPCR Master Mix (Thermo Scientific, USA, K0221). Glyceraldehyde 3-phosphate dehydrogenase (GAPDH) has been employed as an internal control. The data was evaluated using the ΔΔCt comparative technique, with the fold of change = 2 −ΔΔCt 31 Histopathological examination Tumor specimens from various groups were removed and fixed in 10% neutral buffered formalin before being paraffin embedded and sectioned and then stained with hematoxylin and eosin. The histology of tumor tissues was examined using a light microscope 32 Immuno-histochemical analysis Immuno-labeling involved loading 5 μm slices of each tumor onto positively charged slides. Different monoclonal anti-mouse primary antibodies were used to detect caspase-3 and proliferating cell nuclear antigen (PCNA). The correct secondary antibodies were used to localize the bound primary antibodies, and the Diaminobenzidine (DAB) stain was used in accordance with the manufacturer’s protocol 33 Statistical assessment Data were expressed as the significance of difference was analysed by one–way ANOVA. Values are expressed as means ± SE. (a) and (b) significant difference from control and from EST group respectively at P Results Characterization of the prepared DOX-chitosan-magnetic nanoparticles (DOX-CT-MNPs) The characterization results of the prepared nanoparticles were illustrated in Fig. 1 1 2 2 12 22 2 2 12 22 2 2 12 22 1 2 2 12 22 2 2 12 22 2 2 12 22 2 2 12 22 Fig. 1 SEM images for ( A B C D E F Figure 1 2 2 12 22 1 2 3 4 A B T1 T2 1 2 3 1 −1 2 −1 3 −1 2+ 2- 2+ 2- 2+ 2- 4 −1 T1 −1 −1 2 2 12 22 −1 −1 −1 −1 2 2 12 22 -1 2 In addition, the magnetic characteristics of prepared nanoparticles were displayed in Fig. 1 2 2 12 22 2 2 12 22 2 2 12 22 2 2 12 22 Loading and in-vitro release of DOX from the prepared NPs The dialysis bag approach was utilised to investigate the DOX release from DOX-CT MNPs. Figure 2 2 Fig. 2 In-Vitro release profile of DOX. ( A B Changes in tumor weight Figure 3 P Fig. 3 Influence of free DOX, CT-MNPs, and DOX-CT-MNPs on the development of tumor weight and size. ( A P a b B DOX-CT-MNPs modulated EST induced alteration in lipid peroxidation and antioxidant markers Oxidative stress is among the cytotoxic machinery triggered by doxorubicin. In this investigation, the levels of thiobarbituric acid reactive substances (TBARS) as oxidative exertion indicator, glutathione (GSH) content, superoxide dismutase (SOD), and catalase (CAT) antioxidant enzymes were determined in various experimental groups treated with either DOX in free form or loaded on CT-MNPs. The data exhibited in Table 1 P P Table 1 Changes in oxidative stress and antioxidant parameters in Ehrlich solid tumor bearing mice treated with free DOX and DOX-CT-MNPs. Groups TBARS (nmol/g tissue) GSH (mmol/g tissue) SOD (U/g tissue) CAT (U/g tissue) EST 8.94 ± 0.15 0.62 ± 0.003 53.35 ± 0.4 23.02 ± 0.37 EST + Free DOX 14.08 a 0.32 a 39.06 a 11.32 a EST + CT-MNPs 12.51 a 0.47 a 42.56 a 14.95 a EST + DOX-CT-MNPs 18.13 ab 0.26 ab 34.19 ab 10.29 a Data were presented as mean ± SD (n = 10). One-way ANOVA followed by post-hoc Tukey’s test was done. P a b DOX-CT-MNPs impact the cell cycle in Ehrlich solid tumor bearing mice The cell cycle was investigated by measuring the content of the DNA in tumor cells labelled with PI flow cytometrically (Fig. 4 P˂0.0001) Fig. 4 Flow cytometric investigation of cell cycle arrest by free DOX and DOX-CT-MNPs in Ehrlich solid tumor mice model. ( A B P a b DOX-CT-MNPs induce apoptosis in Ehrlich solid tumor bearing mice Apoptosis is a vastly controlled method of cell death characterised by a multitude of metabolic changes and different cellular shape. In this study, the effects of DOX-CT-MNPs cell death in tumours collected from the DOX-CT-MNPs and free DOX-treated groups were compared to those of the Ehrlich solid tumour (EST) untreated group using flow cytometry with Annexin V-FITC/PI (Fig. 5 p p Fig. 5 Flow cytometric assessment of apoptosis mediated by free DOX and DOX-CT-MNPs in EST-bearing mice. ( A B P a b DOX-CT-MNPs affect PTEN, GSK-3β, and MAPK1 expression in Ehrlich solid tumor bearing mice Figure 6 PTEN GSK-3β P MAPK1 P PTEN GSK-3β Fig. 6 Changes in expression levels of PTEN, GSK-3β MAPK1 P a b Histopathological observation and immunohistochemical detection of caspase-3 and PCNA expression Histological inspection of tumor tissues in the EST group revealed the presence of intact cancer cells occupying 85% of the skeletal muscle bundles that are made up of sheets and nodules of distinctly pleomorphic viable tumor cells with hyperchromatic nuclei penetrating between devastated muscle fibers, a few scattered apoptotic cells, and small areas of necrosis about 15% (Fig. 7 7 7 7 7 7 7 Fig. 7 Histopathological alterations and immunohistochemical staining of caspase-3 and PCNA in Ehrlich solid tumor bearing mice treated with free DOX and DOX-CT-MNPs. ( A D A B C D E H I L Discussion Cancer ranks as one of the utmost lethal diseases and leading causes of mortality worldwide, marked by unplanned and uncontrolled cellular growth 34 35 36 The DOX encapsulation efficiency of the produced MNPs was 83.1%, which is consistent with Ramnandan et al.’s result that CHIMgFe2O4has a DOX loading of 84.28%. The process of DOX loading into CT-MNPs involves hydrophobic and van der Waals interactions, showing that CT is a suitable biopolymer for imbuing the NPs with drug delivery capabilities 37 38 The cytotoxicity of nano-delivery carriers is vital for the antitumor medication DOX, which aims at destroying cancer cells. The surface characteristics of MNPs, whether uncoated or functionalized, play a crucial part in cytotoxicity. Direct interaction between MNPs and cells can lead to iron overload and cell death as previously reported 39 21 . 40 41 42 Apoptosis is a key mechanism for maintaining homeostasis in the context of cell division and death. The improper regulation of apoptosis is known to cause the formation and propagation of cancer 43 44 45 Additionally, to investigate whether DOX-CT-MNPs formula able to induce cell cycle arrest beside its potential to trigger the apoptosis, cancerous cells from tumor tissues were stained by PI and examine flow cytometrically. The collected histograms indicated that either free DOX or DOX-CT-MNPS arrested the cells at G0/G1. Free Dox readily enters the nucleus and diffuse passively to the intracellular matrix. In case of DOX-CT-MNPs, DOX is liberated from the formula in lysosomes because of the acidic pH. Then, the DOX enter the nucleus and bind to the DNA causing cell cycle arrest 46 42 PTEN (phosphatase and tensin homolog) and the MAPK (Mitogen-Activated Protein Kinase) pathways are both important in controlling cell growth and survival, and their interactions have a crucial role in cancer progression. PTEN MAPK PTEN MAPK 47 MAPK MAPK1 48 49 PTEN and GSK3β 8 . 50  Fig. 8 Mechanistic diagram showing the molecular changes caused by DOX-CT-MNPs. The oral administration of DOX-CT-MNPs in Ehrlich solid tumor (EST) bearing mice increase the expression of PTEN and GSK3β tumor suppressor genes that block MAPK pathway, inhibiting cell growth, proliferation, and cell cycle propagation. Also, treating EST mice with DOX-CT-MNPs increases caspase 3 expression, which causes apoptosis and cell death. Furthermore, DOX-CT-MNPs induce oxidative stress in tumour tissue by raising MDA levels while lowering GSH, CAT, and SOD activity. Conclusions The study found that Pb 2 12 22 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Author contributions E.T and A.E supervised and conceptualized the work. M.E, N.F.N and A.I.G performed the experiments and analyzed the data. A.M.R analyzed and investigated the data. All authors drafted and reviewed the manuscript. Funding Open access funding provided by The Science, Technology & Innovation Funding Authority (STDF) in cooperation with The Egyptian Knowledge Bank (EKB). Not applicable. Data availability The datasets used and/or analyzed during the current study are available from the corresponding author on reasonable request. Declarations Competing interests The authors declare no competing interests. Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. References 1. Nataru S Pulicherla Y Gaddala B A review on medicinal plants as a potential source for cancer Int J Pharm Sci Rev Res 2014 26 235 248 Nataru, S., Pulicherla, Y. & Gaddala, B. A review on medicinal plants as a potential source for cancer. Int J Pharm Sci Rev Res 26 2. Koh B Patterns in cancer incidence among people younger than 50 years in the Us, 2010 to 2019 JAMA Netw Open 2023 6 e2328171 10.1001/jamanetworkopen.2023.28171 37585204 PMC10433086 Koh, B. et al. Patterns in cancer incidence among people younger than 50 years in the Us, 2010 to 2019. JAMA Netw Open 6 37585204 10.1001/jamanetworkopen.2023.28171 PMC10433086 3. Amin AH Ameliorative effects of melatonin against solid Ehrlich carcinoma progression in female mice J. Pineal Res. 2019 67 e12585 10.1111/jpi.12585 31066091 Amin, A. H. et al. Ameliorative effects of melatonin against solid Ehrlich carcinoma progression in female mice. J. Pineal Res. 67 31066091 10.1111/jpi.12585 4. Aldubayan MA Elgharabawy RM Ahmed AS Tousson E Antineoplastic activity and curative role of avenanthramides against the growth of Ehrlich solid tumors in mice Oxid. Med. Cell Longev. 2019 2019 5162687 10.1155/2019/5162687 30755785 PMC6348884 Aldubayan, M. A., Elgharabawy, R. M., Ahmed, A. S. & Tousson, E. Antineoplastic activity and curative role of avenanthramides against the growth of Ehrlich solid tumors in mice. Oxid. Med. Cell Longev. 2019 30755785 10.1155/2019/5162687 PMC6348884 5. Alshehri AF Khodier AE Al-Gayyar MM Antitumor activity of ligustilide against ehrlich solid carcinoma in rats via inhibition of proliferation and activation of autophagy Cureus 2023 15 e40499 10.7759/cureus.40499 37333043 PMC10273303 Alshehri, A. F., Khodier, A. E. & Al-Gayyar, M. M. Antitumor activity of ligustilide against ehrlich solid carcinoma in rats via inhibition of proliferation and activation of autophagy. Cureus 15 37333043 10.7759/cureus.40499 PMC10273303 6. Nofal AE Impact of synthesized indoloquinoline analog to isolates from cryptolepis sanguinolenta on tumor growth inhibition and hepatotoxicity in Ehrlich solid tumor-bearing female mice Cells 2023 12 1024 10.3390/cells12071024 37048097 PMC10093181 Nofal, A. E. et al. Impact of synthesized indoloquinoline analog to isolates from cryptolepis sanguinolenta on tumor growth inhibition and hepatotoxicity in Ehrlich solid tumor-bearing female mice. Cells 12 37048097 10.3390/cells12071024 PMC10093181 7. Fan D Nanomedicine in cancer therapy Signal Transduct. Target. Ther. 2023 8 293 10.1038/s41392-023-01536-y 37544972 PMC10404590 Fan, D. et al. Nanomedicine in cancer therapy. Signal Transduct. Target. Ther. 8 37544972 10.1038/s41392-023-01536-y PMC10404590 8. Thorn CF Doxorubicin pathways: Pharmacodynamics and adverse effects Pharmacogenet Genomics 2011 21 440 446 10.1097/FPC.0b013e32833ffb56 21048526 PMC3116111 Thorn, C. F. et al. Doxorubicin pathways: Pharmacodynamics and adverse effects. Pharmacogenet Genomics 21 21048526 10.1097/FPC.0b013e32833ffb56 PMC3116111 9. van der Zanden SY Qiao X Neefjes J New insights into the activities and toxicities of the old anticancer drug doxorubicin Febs j 2021 288 6095 6111 10.1111/febs.15583 33022843 PMC8597086 van der Zanden, S. Y., Qiao, X. & Neefjes, J. New insights into the activities and toxicities of the old anticancer drug doxorubicin. Febs j 288 33022843 10.1111/febs.15583 PMC8597086 10. Ezike TC Advances in drug delivery systems, challenges and future directions Heliyon 2023 9 e17488 10.1016/j.heliyon.2023.e17488 37416680 PMC10320272 Ezike, T. C. et al. Advances in drug delivery systems, challenges and future directions. Heliyon 9 37416680 10.1016/j.heliyon.2023.e17488 PMC10320272 11. Yetisgin AA Cetinel S Zuvin M Kosar A Kutlu O Therapeutic nanoparticles and their targeted delivery applications Molecules 2020 10.3390/molecules25092193 32397080 PMC7248934 Yetisgin, A. A., Cetinel, S., Zuvin, M., Kosar, A. & Kutlu, O. Therapeutic nanoparticles and their targeted delivery applications. Molecules 32397080 10.3390/molecules25092193 PMC7248934 12. Xie J Lee S Chen X Nanoparticle-based theranostic agents Adv. Drug. Deliv. Rev. 2010 62 1064 1079 10.1016/j.addr.2010.07.009 20691229 PMC2988080 Xie, J., Lee, S. & Chen, X. Nanoparticle-based theranostic agents. Adv. Drug. Deliv. Rev. 62 20691229 10.1016/j.addr.2010.07.009 PMC2988080 13. Mngadi S Mokhosi S Singh M Mdlalose W Chitosan-functionalized Mg 0.5 0.5 2 4 Coatings 2020 10 446 10.3390/coatings10050446 Mngadi, S., Mokhosi, S., Singh, M. & Mdlalose, W. Chitosan-functionalized Mg 0.5 0.5 2 4 Coatings 10 14. Chomoucka J Magnetic nanoparticles and targeted drug delivering Pharmacol. Res. 2010 62 144 149 10.1016/j.phrs.2010.01.014 20149874 Chomoucka, J. et al. Magnetic nanoparticles and targeted drug delivering. Pharmacol. Res. 62 20149874 10.1016/j.phrs.2010.01.014 15. Mngadi SM Mokhosi SR Singh M Surface-coating of Mg 0.5 0.5 2 4 Inorg. Chem. Commun. 2019 108 107525 10.1016/j.inoche.2019.107525 Mngadi, S. M., Mokhosi, S. R. & Singh, M. Surface-coating of Mg 0.5 0.5 2 4 Inorg. Chem. Commun. 108 16. Desai N Chitosan: A potential biopolymer in drug delivery and biomedical applications Pharmaceutics 2023 10.3390/pharmaceutics15041313 37111795 PMC10144389 Desai, N. et al. Chitosan: A potential biopolymer in drug delivery and biomedical applications. Pharmaceutics 37111795 10.3390/pharmaceutics15041313 PMC10144389 17. Fathi M Chitosan-based multifunctional nanomedicines and theranostics for targeted therapy of cancer Med. Res. Rev. 2018 38 2110 2136 10.1002/med.21506 29846948 Fathi, M. et al. Chitosan-based multifunctional nanomedicines and theranostics for targeted therapy of cancer. Med. Res. Rev. 38 29846948 10.1002/med.21506 18. Darwish MSA Synthesis of magnetic ferrite nanoparticles with high hyperthermia performance via a controlled co-precipitation method Nanomaterials (Basel) 2019 10.3390/nano9081176 31426427 PMC6724091 Darwish, M. S. A. et al. Synthesis of magnetic ferrite nanoparticles with high hyperthermia performance via a controlled co-precipitation method. Nanomaterials (Basel) 31426427 10.3390/nano9081176 PMC6724091 19. Mushtaq MW Polymer-coated CoFe 2 4 J. Mater. Sci. 2017 52 9282 9293 10.1007/s10853-017-1141-3 Mushtaq, M. W. et al. Polymer-coated CoFe 2 4 J. Mater. Sci. 52 20. López-Muñoz R Loading of doxorubicin on poly(methyl methacrylate-co-methacrylic acid) nanoparticles and release study J. Biomater. Sci. Polym. Ed. 2021 32 1107 1124 10.1080/09205063.2021.1900652 33691605 López-Muñoz, R. et al. Loading of doxorubicin on poly(methyl methacrylate-co-methacrylic acid) nanoparticles and release study. J. Biomater. Sci. Polym. Ed. 32 33691605 10.1080/09205063.2021.1900652 21. Elkholy M Sweef OA Tousson E El-Atrash A Radwan AM Doxorubicin chitosan-coated ferrite nanoparticles ameliorate hepatic toxicity in Ehrlich solid tumor bearing mice Toxicol. Res. 2025 14 tfaf099 10.1093/toxres/tfaf099 PMC12276376 40692764 Elkholy, M., Sweef, O. A., Tousson, E., El-Atrash, A. & Radwan, A. M. Doxorubicin chitosan-coated ferrite nanoparticles ameliorate hepatic toxicity in Ehrlich solid tumor bearing mice. Toxicol. Res. 14 10.1093/toxres/tfaf099 PMC12276376 40692764 22. Albus U Guide for the care and use of laboratory animals (8th edn) Lab. Animals 2012 46 267 268 10.1258/la.2012.150312 Albus, U. Guide for the care and use of laboratory animals (8th edn). Lab. Animals 46 23. Elgharabawy RM El Tantawy El Sayed I Abd-Allah Rezk N Tousson E Therapeutic impact of costus (Saussurea lappa) against Ehrlich solid tumor-induced cardiac toxicity and DNA damage in female mice Front. Pharmacol. 2021 12 708785 10.3389/fphar.2021.708785 34262464 PMC8273245 Elgharabawy, R. M., El Tantawy El Sayed, I., Abd-Allah Rezk, N. & Tousson, E. Therapeutic impact of costus (Saussurea lappa) against Ehrlich solid tumor-induced cardiac toxicity and DNA damage in female mice. Front. Pharmacol. 12 34262464 10.3389/fphar.2021.708785 PMC8273245 24. Ghannam MM Magnetic field potential effects on the doxorubicin therapeutic activity in Ehrlich tumor growth Saudi J. Biol. Sci. 2021 28 2566 2574 10.1016/j.sjbs.2021.01.061 33935572 PMC8071967 Ghannam, M. M. et al. Magnetic field potential effects on the doxorubicin therapeutic activity in Ehrlich tumor growth. Saudi J. Biol. Sci. 28 33935572 10.1016/j.sjbs.2021.01.061 PMC8071967 25. Mesbah L Soraya B Narimane S Jean P protective effect of flavonides against the toxicity of vinblastine cyclophosphamide and paracetamol by inhibition of lipid–peroxydation and increase of liver glutathione Haematol 2004 7 59 67 Mesbah, L., Soraya, B., Narimane, S. & Jean, P. protective effect of flavonides against the toxicity of vinblastine cyclophosphamide and paracetamol by inhibition of lipid–peroxydation and increase of liver glutathione. Haematol 7 26. Beutler E Duron O Kelly BM Improved method for the determination of blood glutathione J. Lab. Clin. Med. 1963 61 882 888 13967893 Beutler, E., Duron, O. & Kelly, B. M. Improved method for the determination of blood glutathione. J. Lab. Clin. Med. 61 13967893 27. Beers RF Jr Sizer IW A spectrophotometric method for measuring the breakdown of hydrogen peroxide by catalase J. Biol. Chem. 1952 195 133 140 10.1016/S0021-9258(19)50881-X 14938361 Beers, R. F. Jr. & Sizer, I. W. A spectrophotometric method for measuring the breakdown of hydrogen peroxide by catalase. J. Biol. Chem. 195 14938361 28. Beauchamp C Fridovich I Isozymes of superoxide dismutase from wheat germ Biochimica et Biophys. Acta (BBA)-Protein Struct. 1973 317 50 64 10.1016/0005-2795(73)90198-0 4723247 Beauchamp, C. & Fridovich, I. Isozymes of superoxide dismutase from wheat germ. Biochimica et Biophys. Acta (BBA)-Protein Struct. 317 10.1016/0005-2795(73)90198-0 4723247 29. Kenawy E-R Schiff bases of cellulose: Synthesis, characterization, and anticancer potency against hepatocellular carcinoma Int. J. Biol. Macromol. 2025 302 140506 10.1016/j.ijbiomac.2025.140506 39889996 Kenawy, E.-R. et al. Schiff bases of cellulose: Synthesis, characterization, and anticancer potency against hepatocellular carcinoma. Int. J. Biol. Macromol. 302 39889996 10.1016/j.ijbiomac.2025.140506 30. Effat H Abosharaf HA Radwan AM Combined effects of naringin and doxorubicin on the JAK/STAT signaling pathway reduce the development and spread of breast cancer cells Sci. Rep. 2024 14 2824 10.1038/s41598-024-53320-9 38310190 PMC10838285 Effat, H., Abosharaf, H. A. & Radwan, A. M. Combined effects of naringin and doxorubicin on the JAK/STAT signaling pathway reduce the development and spread of breast cancer cells. Sci. Rep. 14 38310190 10.1038/s41598-024-53320-9 PMC10838285 31. Schmittgen TD Livak KJ Analyzing real-time PCR data by the comparative C(T) method Nat. Protoc. 2008 3 1101 1108 10.1038/nprot.2008.73 18546601 Schmittgen, T. D. & Livak, K. J. Analyzing real-time PCR data by the comparative C(T) method. Nat. Protoc. 3 18546601 10.1038/nprot.2008.73 32. Radwan AM Fatoh SA Massoud A Tousson E Effectiveness of curcumin nanoparticles in rat liver fibrosis caused by thioacetamide Environ. Toxicol. 2024 39 388 397 10.1002/tox.23984 37782692 Radwan, A. M., Fatoh, S. A., Massoud, A. & Tousson, E. Effectiveness of curcumin nanoparticles in rat liver fibrosis caused by thioacetamide. Environ. Toxicol. 39 37782692 10.1002/tox.23984 33. Altwaijry N El-Masry TA Alotaibi B Tousson E Saleh A Therapeutic effects of rocket seeds (Eruca sativa L.) against testicular toxicity and oxidative stress caused by silver nanoparticles injection in rats Environ. Toxicol. 2020 35 952 960 10.1002/tox.22931 32293792 Altwaijry, N., El-Masry, T. A., Alotaibi, B., Tousson, E. & Saleh, A. Therapeutic effects of rocket seeds (Eruca sativa L.) against testicular toxicity and oxidative stress caused by silver nanoparticles injection in rats. Environ. Toxicol. 35 32293792 10.1002/tox.22931 34. Piña-Sánchez P Cancer biology, epidemiology, and treatment in the 21st century: Current status and future challenges from a biomedical perspective Cancer Control 2021 28 10732748211038735 10.1177/10732748211038735 34565215 PMC8481752 Piña-Sánchez, P. et al. Cancer biology, epidemiology, and treatment in the 21st century: Current status and future challenges from a biomedical perspective. Cancer Control 28 34565215 10.1177/10732748211038735 PMC8481752 35. Liu B Zhou H Tan L Siu KTH Guan X-Y Exploring treatment options in cancer: Tumor treatment strategies Signal Transduct. Target. Ther. 2024 9 175 10.1038/s41392-024-01856-7 39013849 PMC11252281 Liu, B., Zhou, H., Tan, L., Siu, K. T. H. & Guan, X.-Y. Exploring treatment options in cancer: Tumor treatment strategies. Signal Transduct. Target. Ther. 9 39013849 10.1038/s41392-024-01856-7 PMC11252281 36. Graham W Magnetic nanoparticles and drug delivery systems for anti-cancer applications: A review Nanomaterials 2025 15 285 10.3390/nano15040285 39997849 PMC11858650 Graham, W. et al. Magnetic nanoparticles and drug delivery systems for anti-cancer applications: A review. Nanomaterials 15 39997849 10.3390/nano15040285 PMC11858650 37. Ramnandan D Mokhosi S Daniels A Singh MC Polyethylene glycol and polyvinyl alcohol modified MgFe 2 4 Molecules (Basel, Switzerland) 2021 10.3390/molecules26133893 34202245 PMC8271878 Ramnandan, D., Mokhosi, S., Daniels, A. & Singh, M. C. Polyethylene glycol and polyvinyl alcohol modified MgFe 2 4 Molecules (Basel, Switzerland) 34202245 10.3390/molecules26133893 PMC8271878 38. Fahmi A Abdur-Rahman M Mahareek O Shemis MA Synthesis, characterization, and cytotoxicity of doxorubicin-loaded polycaprolactone nanocapsules as controlled anti-hepatocellular carcinoma drug release system BMC Chem. 2022 16 95 10.1186/s13065-022-00888-w 36371274 PMC9655909 Fahmi, A., Abdur-Rahman, M., Mahareek, O. & Shemis, M. A. Synthesis, characterization, and cytotoxicity of doxorubicin-loaded polycaprolactone nanocapsules as controlled anti-hepatocellular carcinoma drug release system. BMC Chem. 16 36371274 10.1186/s13065-022-00888-w PMC9655909 39. Voinov MA Sosa Pagán JO Morrison E Smirnova TI Smirnov AI Surface-mediated production of hydroxyl radicals as a mechanism of iron oxide nanoparticle biotoxicity J. Am. Chem. Soc. 2011 133 35 41 10.1021/ja104683w 21141957 Voinov, M. A., Sosa Pagán, J. O., Morrison, E., Smirnova, T. I. & Smirnov, A. I. Surface-mediated production of hydroxyl radicals as a mechanism of iron oxide nanoparticle biotoxicity. J. Am. Chem. Soc. 133 21141957 10.1021/ja104683w 40. Keeney JTR Doxorubicin-induced elevated oxidative stress and neurochemical alterations in brain and cognitive decline: Protection by MESNA and insights into mechanisms of chemotherapy-induced cognitive impairment (“chemobrain”) Oncotarget 2018 9 30324 30339 10.18632/oncotarget.25718 30100992 PMC6084398 Keeney, J. T. R. et al. Doxorubicin-induced elevated oxidative stress and neurochemical alterations in brain and cognitive decline: Protection by MESNA and insights into mechanisms of chemotherapy-induced cognitive impairment (“chemobrain”). Oncotarget 9 30100992 10.18632/oncotarget.25718 PMC6084398 41. Lungu II Doxorubicin-conjugated iron oxide nanoparticles synthesized by laser pyrolysis in vitro study on human breast cancer cells Polymers (Basel) 2020 10.3390/polym12122799 33256060 PMC7760716 Lungu, I. I. et al. Doxorubicin-conjugated iron oxide nanoparticles synthesized by laser pyrolysis in vitro study on human breast cancer cells. Polymers (Basel) 33256060 10.3390/polym12122799 PMC7760716 42. Hernandes EP Doxorubicin-loaded iron oxide nanoparticles induce oxidative stress and cell cycle arrest in breast cancer cells Antioxidants (Basel, Switzerland) 2023 10.3390/antiox12020237 36829796 PMC9952039 Hernandes, E. P. et al. Doxorubicin-loaded iron oxide nanoparticles induce oxidative stress and cell cycle arrest in breast cancer cells. Antioxidants (Basel, Switzerland) 36829796 10.3390/antiox12020237 PMC9952039 43. Mustafa M Apoptosis: A comprehensive overview of signaling pathways, morphological changes, and physiological significance and therapeutic implications Cells 2024 13 1838 10.3390/cells13221838 39594587 PMC11592877 Mustafa, M. et al. Apoptosis: A comprehensive overview of signaling pathways, morphological changes, and physiological significance and therapeutic implications. Cells 13 39594587 10.3390/cells13221838 PMC11592877 44. Javid A Ahmadian S Saboury AA Kalantar SM Rezaei-Zarchi S Chitosan-coated superparamagnetic iron oxide nanoparticles for doxorubicin delivery: Synthesis and anticancer effect against human ovarian cancer cells Chem. Biol. Drug Des. 2013 82 296 306 10.1111/cbdd.12145 23594157 Javid, A., Ahmadian, S., Saboury, A. A., Kalantar, S. M. & Rezaei-Zarchi, S. Chitosan-coated superparamagnetic iron oxide nanoparticles for doxorubicin delivery: Synthesis and anticancer effect against human ovarian cancer cells. Chem. Biol. Drug Des. 82 23594157 10.1111/cbdd.12145 45. Xu HL Glioma-targeted superparamagnetic iron oxide nanoparticles as drug-carrying vehicles for theranostic effects Nanoscale 2016 8 14222 14236 10.1039/c6nr02448c 27396404 Xu, H. L. et al. Glioma-targeted superparamagnetic iron oxide nanoparticles as drug-carrying vehicles for theranostic effects. Nanoscale 8 27396404 10.1039/c6nr02448c 46. Tomankova K In vitro cytotoxicity analysis of doxorubicin-loaded/superparamagnetic iron oxide colloidal nanoassemblies on MCF7 and NIH3T3 cell lines Int J Nanomedicine 2015 10 949 961 10.2147/ijn.S72590 25673990 PMC4321606 Tomankova, K. et al. In vitro cytotoxicity analysis of doxorubicin-loaded/superparamagnetic iron oxide colloidal nanoassemblies on MCF7 and NIH3T3 cell lines. Int J Nanomedicine 10 25673990 10.2147/IJN.S72590 PMC4321606 47. Braicu C A comprehensive review on MAPK: A promising therapeutic target in cancer Cancers 2019 11 1618 10.3390/cancers11101618 31652660 PMC6827047 Braicu, C. et al. A comprehensive review on MAPK: A promising therapeutic target in cancer. Cancers 11 31652660 10.3390/cancers11101618 PMC6827047 48. McCubrey JA Roles of the Raf/MEK/ERK pathway in cell growth, malignant transformation and drug resistance Biochim. Biophys. Acta 2007 1773 1263 1284 10.1016/j.bbamcr.2006.10.001 17126425 PMC2696318 McCubrey, J. A. et al. Roles of the Raf/MEK/ERK pathway in cell growth, malignant transformation and drug resistance. Biochim. Biophys. Acta 1773 17126425 10.1016/j.bbamcr.2006.10.001 PMC2696318 49. Si W A miR-20a/MAPK1/c-Myc regulatory feedback loop regulates breast carcinogenesis and chemoresistance Cell Death Differ. 2018 25 406 420 10.1038/cdd.2017.176 29125598 PMC5762853 Si, W. et al. A miR-20a/MAPK1/c-Myc regulatory feedback loop regulates breast carcinogenesis and chemoresistance. Cell Death Differ. 25 29125598 10.1038/cdd.2017.176 PMC5762853 50. Yang X Combination therapy with miR34a and doxorubicin synergistically inhibits Dox-resistant breast cancer progression via down-regulation of Snail through suppressing Notch/NF-κB and RAS/RAF/MEK/ERK signaling pathway Acta. Pharmaceutica Sinica B 2021 11 2819 2834 10.1016/j.apsb.2021.06.003 34589399 PMC8463267 Yang, X. et al. Combination therapy with miR34a and doxorubicin synergistically inhibits Dox-resistant breast cancer progression via down-regulation of Snail through suppressing Notch/NF-κB and RAS/RAF/MEK/ERK signaling pathway. Acta. Pharmaceutica Sinica B 11 34589399 10.1016/j.apsb.2021.06.003 PMC8463267 ",
  "metadata": {
    "Title of this paper": "Combination therapy with miR34a and doxorubicin synergistically inhibits Dox-resistant breast cancer progression via down-regulation of Snail through suppressing Notch/NF-κB and RAS/RAF/MEK/ERK signaling pathway",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491401/"
  }
}