{
  "title": "Paper_170",
  "abstract": "pmc Ann Surg Oncol Ann Surg Oncol 365 springeropen Annals of Surgical Oncology 1068-9265 1534-4681 pmc-is-collection-domain yes pmc-collection-title Springer PMC12494671 PMC12494671.1 12494671 12494671 40775590 10.1245/s10434-025-17849-x 17849 1 Breast Oncology ASBrS Keynote Address: Reimagining Stage 1 Breast Cancer—Evolution of Breast Cancer Management over the Last 120 Years Mann Gregory Bruce MBBS, PhD, FRACS bruce.mann@mh.org.au 1 2 1 https://ror.org/005bvs909 grid.416153.4 0000 0004 0624 1200 The Royal Melbourne Hospital, Breast Service, 2 https://ror.org/01ej9dk98 grid.1008.9 0000 0001 2179 088X Department of Surgery, University of Melbourne, 7 8 2025 2025 32 11 498296 8080 8086 22 5 2025 27 6 2025 07 08 2025 05 10 2025 05 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ University of Melbourne Open Access funding enabled and organized by CAUL and its Member Institutions pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Society of Surgical Oncology 2025 Reimagining Stage 1 Breast Cancer Evolution of Breast Cancer Management over the Last 120 Years In the late 19th century, the outlook for a patient with breast cancer was grim. Series from leading European centres reported a local recurrence rate after surgical excision of 50–70%. Patients presented with advanced disease, and arguably the best treatment was supportive care. Dr. William Halsted published a series of patients treated with radical mastectomy in 1907, showing a local recurrence (LR) rate of 9% and additional regional recurrence in another 16%. This set the standard for treatment for the next 50 years. He presented a hypothesis that “…breast cancer … a disease that arose in one location (the breast) and, if left untreated, spread through the lymphatic system first to nearby lymph nodes and subsequently to other organs in the body”, 1 Dr. Bernard Fisher developed an alternative hypothesis to that of Halsted in the 1970s, based on clinical and laboratory work showing that breast cancer did not behave as predicted by the Halsted hypothesis, and that systemic spread frequently occurred earlier in the natural history of breast cancer. Dr. Fisher hypothesized that breast cancer was a systemic disease from its inception and that tumor dissemination was not dictated by anatomic considerations but by a host-tumor relationship that determined its virulence and metastatic propensity… nuances in local-regional therapy are unlikely to have a substantial influence on ultimate survival. 2 4 Dr. Fisher’s insights had a profound influence on breast cancer research and management. Attention was directed away from surgery to the development of effective treatment of systemic disease. The contention that breast cancer should be considered a systemic disease at the time of clinical presentation became known as the “Fisher hypothesis”. Fisher’s alternative hypothesis led to trials of less extensive surgery, with the NSABP-B04 trial showing no survival benefit from radical mastectomy over total mastectomy and the NSABP-B06 trial showing equivalent outcomes from total mastectomy versus breast conserving surgery (BCS) with adjuvant radiotherapy (RT). BCS without RT was associated with a high locoregional recurrence rate which eventually translated into a survival disadvantage. Further trials confirmed that axillary dissection could be replaced by sentinel node biopsy (SNB), and recent trials suggest that SNB may be safely omitted in selected patients, so long as standard adjuvant therapies are delivered. Better understanding of breast cancer biology and the development of systemic therapies has been rapid. Combination chemotherapy and adjuvant endocrine therapy (ET) led to major reductions in recurrence and deaths from breast cancer. More recently, anti-HER2 therapies, CDK inhibitors and immunotherapies have improved outcomes further, with more treatment options in the pipeline. NCCN and other guidelines now suggest that patients with invasive breast cancer should be recommended to have RT after BCS, and that almost all patients should be recommended to have some form of adjuvant systemic therapy. 5 Routine RT and adjuvant systemic therapy based on phenotype of the index cancer question the need for SNB in clinically stage 1 ER-positive cancer. SOUND and Insema have recently been published and support selective omission of SNB, with ASCO guidelines including this option. 6 8 Screening When the Fisher hypothesis was formulated, breast cancer was diagnosed on clinical grounds. Mammography was rudimentary, and there was no organised screening for pre-symptomatic disease. Pathological assessment of specimens was quite different from what it is today, with less attention to margins, and relatively cursory attention to the axillary lymph nodes. Dr. Phillip Strax published the results of the New York Health Plan trial of screening mammography around the same time that Fisher’s alternative hypothesis was presented. 9 10 Most breast cancers identified with screening are asymptomatic as opposed to cancers in the 1970s. It is nevertheless assumed that the Fisher hypothesis remains applicable, and these cancers are considered as potentially systemic disease. Adjuvant Radiotherapy Early trials of BCS without RT for Stage 1 cancer reported LR rates of 18-25%, supporting the alternative hypothesis. More focussed trials of RT omission after BCS in Stage 1, ER-positive, non-high grade cancer in older patients showed a LR rate of 10% at 10 years without RT and 1–2% with it. 11 12 Improved understanding of breast cancer biology has stimulated a suite of trials of de-escalation of RT using commercial gene arrays or pathological patterns indicating less aggressive biology. 13 14 15 Local Staging of Early Breast Cancer Pre-operative MRI in women with apparently unifocal cancer will identify additional malignant lesions, occult to mammography, in around 15% of patients. 16 17 19 20 21 This fundamental conception of the nature of invasive breast cancer is different from that of other cancers. Management of most other stage 1 epithelial malignancies involves less extensive treatment. Skin cancer, including melanoma, is treated with adequate wide excision without adjuvant therapy, as is colorectal, gastric, prostate, cervical, uterine, esophageal and other cancers. It is puzzling that stage 1 breast cancer in women after menopause should pose a higher risk of recurrence than early cancers in organs with far denser lymphatic and vascular networks. It is also notable that management of other cancers includes highly sensitive methods to identify synchronous primary cancers prior to excision of the known cancer. The Potential Impact of Using Sensitive Local Staging in Early Breast Cancer We instigated the PROSPECT trial in 2010 to test the hypothesis that undetected occult breast cancer is responsible for LR in the absence of RT in Stage 1 non-triple negative breast cancer, and that unequivocally unifocal cancer on MRI with low-risk pathology that is adequately excised will have minimal risk of recurrence without RT. 22 PROSPECT patients were 50 years of age or over with clinical stage 1, apparently unifocal, non-triple negative breast cancer. All underwent pre-operative MRI. BIRADS 3, 4 or 5 lesions underwent biopsy, and those with nil/minimal or mild background parenchymal enhancement on MRI and unifocal pT1N0 cancer without lymphovascular invasion or extensive DCIS, excised with a 2mm radial margin were eligible for RT omission on trial. Standard adjuvant systemic therapy was mandated for participants. Between September 2011 and May 2018, 443 patients with apparently unifocal cancer on standard imaging (MMG +/− US) underwent MRI. Biopsy-proven additional malignancy, separate from the index cancer, was identified and treated in 48/443 (11%) patients (Figure 1 Fig. 1 A B Primary analysis of PROSPECT, when the 100 th A health economic analysis showed that, in the Australian setting, the cost of additional MRIs and resultant biopsies was more than offset by savings from reduced RT use. A parallel quality of life study showed that those omitting RT on study had the expected benefits in health-related quality of life, and in addition had substantially less fear of cancer recurrence than those treated with RT, even when matched for pathology. 23 24 Sequencing of the only case of distant metastasis and the index cancer showed these were genetically distinct, indicating it was a de novo metastatic cancer rather than a true recurrence. Thus, there were no systemic recurrences at a median of 5 years followup in this cohort of patients with lower risk cancer where highly sensitive preoperative imaging led to identification and treatment of additional disease in 11% of the cohort. 22 Another Alternative Hypothesis When Fisher developed his alternative hypothesis, there was no screening. The hypothesis related to breast cancers presenting clinically. This critical fact is overlooked when the hypothesis is considered applicable to all invasive breast cancers. The outcomes of treatment of Stage 1 breast cancer without RT in PROSPECT are consistent with an alternative hypothesis that foci of invasive cancer, occult to standard imaging, are responsible for many local and systemic recurrences occurring in those with low-risk Stage 1 breast cancer treated without RT. A certain proportion of malignant occult lesions (mOLs) would be cured by adjuvant treatment, but others would survive RT and progress during or once ET was ceased. This is consistent with the results of the CALGB 9343 and PRIME2 trials, with many of the LRs occurring between years 5 and 10. 11 12 15 A subgroup of patients in the MINDACT trial with stage 1 disease were treated without ET. Their outcomes were compared to a matched group receiving ET with a total of 13.5% events in the group without and 5.2% in the group with ET. This appears to be consistent with the Fisher hypothesis, but closer examination reveals that 4.7% of the events were ipsilateral recurrences, 4.6% were contralateral primaries and 3.9% were distant events—potentially explainable in large part by occult malignancies present but not detected at initial diagnosis. 25 The well-recognised bimodal pattern of recurrence of ER positive cancer 26 Taken together, these data suggest that a substantial group of women with breast cancer who have been cured with BCS may be identifiable. If so, many cases of Stage 1 breast cancer can be identified where the disease is truly localised at diagnosis, where systemic therapy may reduce the risk of new primaries but will not reduce distant metastasis. This would make Stage 1 breast cancer similar to Stage 1 colorectal, gastric cancer or melanoma, where the focus after surgery is on surveillance for new primary disease rather than recurrence of the index. If such a group can be identified, women could avoid the costs and toxicities of RT, and also allow those intolerant of ET to cease it without the anxiety that they are putting their life at risk. To achieve this goal it will be necessary to continue to confirm that patients with clinical stage 1 disease have pathological stage 1 disease. The MIRROR study of the significance of micrometastases and isolated tumour cells showed that, in the absence of systemic therapy, these are associated with a substantially poorer disease-free survival, but that this difference is not seen when the treatment is given. 27 6 8 Testable Consequences of Re-Imagined Stage 1 Breast Cancer Local Staging If unifocal, non-TNBC is rarely systemic at diagnosis and under-treated occult malignant disease is responsible for many subsequent breast cancer events, the identification and treatment of this additional disease should allow treatment optimization and potentially improved outcomes for these patients. We have instituted a policy of near-universal preoperative contrast-based imaging with either MRI or contrast enhanced mammography (CEM) for early breast cancer. While guidelines suggest this imaging should be used selectively and is expected to be more useful in higher stage disease, we hypothesize that identifying and treating additional disease in a patient with lower-risk index cancer is more likely to alter outcomes. We have reported a series of 202 women with screen-detected early breast cancer having preoperative CEM showing additional DCIS or invasive cancer in 29/202 (14%), with the additional disease being considered clinically relevant in most cases. 28 Adjuvant Radiotherapy The PROSPECT trial findings suggest that MRI and pathology features can identify a group in whom RT can be safely omitted. 22 Confirmatory trials are essential. The PROSPECT International VErsion (PROSPECTIVE) has recently opened and will determine whether these findings can be replicated in a larger international multicentre study. Importantly, ET will not be mandatory in lower-risk patients on PROSPECTIVE, and may provide an indication whether surgery alone is appropriate in this select group of patients. Adjuvant Systemic Therapy Adjuvant systemic therapy has substantially reduced mortality in Stage 2 and 3 breast cancer. While recurrence is uncommon with lower-risk phenotypes of stage 1 breast cancer, the similar relative reduction in recurrence regardless of absolute risk, coupled with the understanding that breast cancer is always potentially systemic leads to near universal recommendation for adjuvant systemic therapy. This approach is strikingly different from most other epithelial malignancies, where Stage 1 cancer is considered ‘cured’ after adequate local therapy with no role for systemic therapies. Surveys show that adjuvant systemic therapy is responsible for significant longer term morbidity, 29 30 A combination of sensitive imaging to identify or exclude additional disease, next generation biomarkers to assess the risk of both LR and systemic recurrence and potentially circulating factors to identify groups who would benefit from systemic therapy or who can safely omit it may be key to further progress. These may be the next steps beyond the use of molecular and histological features to determine adjuvant therapy. Local Recurrences/Surveillance Long-term follow up has confirmed that the breast cancer specific and overall survival rates are at least as good with BCS and RT as with mastectomy. LRs after adequate surgery and RT are seen as a marker of the underlying biology rather than a driver of any subsequent events: 31 Recommendations for surveillance in those with a personal history of breast cancer (PHBC) are for annual mammography. 5 32 This understanding of subsequent local events may change if very early breast cancer is considered truly localised. As all contralateral and many ipsilateral events are unrelated to the index cancer, surveillance of those with PHBC is analogous to high-risk screening. More sensitive surveillance may lead to earlier diagnosis, better management and improved outcomes. We have instituted a policy of routine CEM as a sole imaging modality for those with a PHBC. On the prevalent round of CEM we reported a cancer detection rate of 26/1000 with around half being detected only due to the addition of contrast. 33 34 35 Longer term follow-up of a larger series is underway to test whether this approach results in better cancer outcomes. Early Detection More effective early detection is key to both improved outcomes and successful de-escalation of therapy. Despite this, there have been few clinical trials on screening in recent decades. Other than the UK AGE trial of mammographic screening women in their 40s 36 37 10 Benefits to individuals and health systems from tailored treatment of very early breast cancer, with a large proportion of patients being safely treated with less than standard treatment and a small group being treated with more, will only be realized if a larger proportion of women destined to develop cancer are diagnosed at a very early stage. Work on implementation of risk-adjusted screening is vital and should be a high priority for the research community. Implications of Reimagining Stage 1 Cancer Fisher’s alternative hypothesis regarding operable breast cancer transformed breast cancer research and treatment. De-escalation of surgery and improved systemic therapy has dramatically reduced surgical morbidity and improved outcomes. Unintended consequences may be impeding further progress in various areas. These include: Ambivalence around the potential for breast cancer screening to improve outcomes. Scepticism regarding the importance of local staging at the time of diagnosis Acceptance that RT after BCS should be standard in almost all cases of early breast cancer Acceptance that adjuvant systemic therapy should be near-universal for breast cancer Acceptance that LR after treatment reflects biology and earlier diagnosis will not alter outcome. Summary Breast cancer was a clinical disease when Dr. Fisher developed the alternative hypothesis. This is largely overlooked and the hypothesis is now considered applicable to all invasive breast cancers. The outcomes of stage 1 non-TNBC treated in the PROSPECT study without RT are consistent with another alternative hypothesis, being that foci of breast cancer, occult to conventional imaging, are responsible for the substantial rates of LR, and the small incidence of systemic recurrence observed with low-risk Stage 1 breast cancer. Incorporation of preoperative contrast-based imaging to identify or exclude additional disease may be key to further progress in the treatment of very early breast cancer. If cases of early breast cancer that is truly localised can be reliably identified, then better early detection will be key to major improvement in treatment and outcomes. As Dr. Norman Wolmark stated in his eulogy to Dr. Fisher—“when a hypothesis gained an eponym it ceased to be a theory and became a bias”. It is time to re-assess the Fisher hypothesis in the setting of stage 1 breast cancer. 4 Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Funding Open Access funding enabled and organized by CAUL and its Member Institutions. Disclosures The author declares no conflicts of interest. References 1. Halsted WS The results of radical operations for the cure of carcinoma of the breast Ann Surg 1907 46 1 19 10.1097/00000658-190707000-00001 17861990 PMC1414357 Halsted WS. The results of radical operations for the cure of carcinoma of the breast. Ann Surg 17861990 10.1097/00000658-190707000-00001 PMC1414357 2. Fisher B The surgical dilemma in the primary therapy of invasive breast cancer: a critical appraisal Curr Probl Surg 1970 1970 1 53 4992398 Fisher B. The surgical dilemma in the primary therapy of invasive breast cancer: a critical appraisal. Curr Probl Surg 4992398 3. Fisher B Biological research in the evolution of cancer surgery: a personal perspective Cancer Res 2008 68 10007 10020 10.1158/0008-5472 19074862 Fisher B. Biological research in the evolution of cancer surgery: a personal perspective. Cancer Res 19074862 10.1158/0008-5472.CAN-08-0186 4. Wolmark N In memoriam bernard fisher, 1918–2019 J Clin Oncol 2020 38 16 1751 1755 10.1200/JCO.19.03299 Wolmark N. In memoriam bernard fisher, 1918–2019. J Clin Oncol 5. www.nccn.org 6. Gentilini OD Botteri E Sangalli C Sentinel lymph node biopsy vs no axillary surgery in patients with small breast cancer and negative results on ultrasonography of axillary lymph nodes: the SOUND randomized clinical trial JAMA Oncol 2023 9 1557 1564 10.1001/jamaoncol.2023.3759 37733364 PMC10514873 Gentilini OD, Botteri E, Sangalli C, et al. Sentinel lymph node biopsy vs no axillary surgery in patients with small breast cancer and negative results on ultrasonography of axillary lymph nodes: the SOUND randomized clinical trial. JAMA Oncol 37733364 10.1001/jamaoncol.2023.3759 PMC10514873 7. Reimer T Stachs A Veselinovic K Axillary surgery in breast cancer: primary results of the INSEMA trial N Engl J Med 2025 392 1051 1064 10.1056/NEJMoa2412063 39665649 Reimer T, Stachs A, Veselinovic K, et al. Axillary surgery in breast cancer: primary results of the INSEMA trial. N Engl J Med 39665649 10.1056/NEJMoa2412063 8. Park KO Somerfield MR Anne N Sentinel lymph node biopsy in early-stage breast cancer: ASCO guideline update J Clin Oncol 2025 10.1200/JCO-25-00099 40209128 Park KO, Somerfield MR, Anne N, et al. Sentinel lymph node biopsy in early-stage breast cancer: ASCO guideline update. J Clin Oncol 40209128 10.1200/JCO-25-00099 9. Strax P Venet L Shapiro S Value of mammography in reduction of mortality from breast cancer in mass screening Am J Roentgenol Radium Ther Nucl Med 1973 117 686 689 10.2214/ajr.117.3.686 4693025 Strax P, Venet L, Shapiro S. Value of mammography in reduction of mortality from breast cancer in mass screening. Am J Roentgenol Radium Ther Nucl Med 4693025 10.2214/ajr.117.3.686 10. Marmot MG Altman DG Cameron DA The benefits and harms of breast cancer screening: an independent review Br J Cancer 2013 108 2205 2240 10.1038/bjc.2013.177 23744281 PMC3693450 Marmot MG, Altman DG, Cameron DA, et al. The benefits and harms of breast cancer screening: an independent review. Br J Cancer 23744281 10.1038/bjc.2013.177 PMC3693450 11. Hughes KS Schnaper LA Bellon JR Lumpectomy plus tamoxifen with or without irradiation in women age 70 years or older with early breast cancer: long-term follow-up of CALGB 9343 J Clin Oncol 2013 31 2382 2387 10.1200/JCO.2012.45.2615 23690420 PMC3691356 Hughes KS, Schnaper LA, Bellon JR, et al. Lumpectomy plus tamoxifen with or without irradiation in women age 70 years or older with early breast cancer: long-term follow-up of CALGB 9343. J Clin Oncol 23690420 10.1200/JCO.2012.45.2615 PMC3691356 12. Kunkler IH Williams LJ Jack WJL Breast-conserving surgery with or without irradiation in early breast cancer N Engl J Med 2023 388 585 594 10.1056/NEJMoa2207586 36791159 Kunkler IH, Williams LJ, Jack WJL, et al. Breast-conserving surgery with or without irradiation in early breast cancer. N Engl J Med 36791159 10.1056/NEJMoa2207586 13. Franco P De Rose F De Santis M Omission of postoperative radiation after breast-conserving surgery: a progressive paradigm shift towards precision medicine Clin Transl Radiat Oncol 2020 21 112 119 32090175 10.1016/j.ctro.2020.02.003 PMC7025960 Franco P, De Rose F, De Santis M, et al. Omission of postoperative radiation after breast-conserving surgery: a progressive paradigm shift towards precision medicine. Clin Transl Radiat Oncol 32090175 10.1016/j.ctro.2020.02.003 PMC7025960 14. Whelan TJ Smith S Parpia S Omitting radiotherapy after breast-conserving surgery in luminal A breast cancer N Engl J Med 2023 389 612 619 10.1056/NEJMoa2302344 37585627 Whelan TJ, Smith S, Parpia S, et al. Omitting radiotherapy after breast-conserving surgery in luminal A breast cancer. N Engl J Med 37585627 10.1056/NEJMoa2302344 15. Jagsi R Griffith KA Harris EE Omission of radiotherapy after breast-conserving surgery for women with breast cancer with low clinical and genomic risk: 5-year outcomes of IDEA J Clin Oncol 2024 42 390 398 10.1200/JCO.23.02270 38060195 PMC11846025 Jagsi R, Griffith KA, Harris EE, et al. Omission of radiotherapy after breast-conserving surgery for women with breast cancer with low clinical and genomic risk: 5-year outcomes of IDEA. J Clin Oncol 38060195 10.1200/JCO.23.02270 PMC11846025 16. Houssami N Ciatto S Macaskill P Accuracy and surgical impact of magnetic resonance imaging in breast cancer staging: systematic review and meta-analysis in detection of multifocal and multicentric cancer J Clin Oncol 2008 26 3248 3258 10.1200/JCO.2007.15.2108 18474876 Houssami N, Ciatto S, Macaskill P, et al. Accuracy and surgical impact of magnetic resonance imaging in breast cancer staging: systematic review and meta-analysis in detection of multifocal and multicentric cancer. J Clin Oncol 18474876 10.1200/JCO.2007.15.2108 17. Turnbull L Brown S Harvey I Comparative effectiveness of MRI in breast cancer (COMICE) trial: a randomised controlled trial Lancet 2010 375 563 571 10.1016/S0140-6736(09)62070-5 20159292 Turnbull L, Brown S, Harvey I, et al. Comparative effectiveness of MRI in breast cancer (COMICE) trial: a randomised controlled trial. Lancet 20159292 10.1016/S0140-6736(09)62070-5 18. Gonzalez V Arver B Löfgren L Bergkvist L Sandelin K Eriksson S Impact of preoperative breast MRI on 10-year survival of patients included in the Swedish randomized multicentre POMB trial Br J Surg Open 2021 5 zrab088 10.1093/bjsopen/zrab088 PMC8493003 34611701 Gonzalez V, Arver B, Löfgren L, Bergkvist L, Sandelin K, Eriksson S. Impact of preoperative breast MRI on 10-year survival of patients included in the Swedish randomized multicentre POMB trial. Br J Surg Open 10.1093/bjsopen/zrab088 PMC8493003 34611701 19. Peters NH van Esser S van den Bosch MA Preoperative MRI and surgical management in patients with nonpalpable breast cancer: the MONET: randomised controlled trial Eur J Cancer. 2011 47 879 886 10.1016/j.ejca.2010.11.035 21195605 Peters NH, van Esser S, van den Bosch MA, et al. Preoperative MRI and surgical management in patients with nonpalpable breast cancer: the MONET: randomised controlled trial. Eur J Cancer 21195605 10.1016/j.ejca.2010.11.035 20. Morrow M Magnetic resonance imaging in breast cancer: one step forward, two steps back? J Am Med Assoc. 2004 292 2779 2780 10.1001/jama.292.22.2779 15585740 Morrow M. Magnetic resonance imaging in breast cancer: one step forward, two steps back? J Am Med Assoc 10.1001/jama.292.22.2779 15585740 21. Surgeons ASoB. Choosing Wisely: Five things physicians and patients should question, 2016. 22. Mann GB Skandarajah AR Zdenkowski N Postoperative radiotherapy omission in selected patients with early breast cancer following preoperative breast MRI (PROSPECT): primary results of a prospective two-arm study Lancet 2024 403 261 270 10.1016/S0140-6736(23)02476-5 38065194 Mann GB, Skandarajah AR, Zdenkowski N, et al. Postoperative radiotherapy omission in selected patients with early breast cancer following preoperative breast MRI (PROSPECT): primary results of a prospective two-arm study. Lancet 38065194 10.1016/S0140-6736(23)02476-5 23. Stafford L Sinclair M Butow P Quality-of-life outcomes associated with optimization of treatment by omitting radiotherapy in early breast cancer Clin Breast Cancer 2024 24 447 56.e2 10.1016/j.clbc.2024.03.002 38548516 Stafford L, Sinclair M, Butow P, et al. Quality-of-life outcomes associated with optimization of treatment by omitting radiotherapy in early breast cancer. Clin Breast Cancer 38548516 10.1016/j.clbc.2024.03.002 24. Stafford L Sinclair M Butow P Is de-escalation of treatment by omission of radiotherapy associated with fear of cancer recurrence in women with early breast cancer? An exploratory study Breast Cancer Res Treat. 2023 201 367 376 10.1007/s10549-023-07039-2 37480383 PMC10460737 Stafford L, Sinclair M, Butow P, et al. Is de-escalation of treatment by omission of radiotherapy associated with fear of cancer recurrence in women with early breast cancer? An exploratory study. Breast Cancer Res Treat 37480383 10.1007/s10549-023-07039-2 PMC10460737 25. Lopes Cardozo JMN Byng D Drukker CA Outcome without any adjuvant systemic treatment in stage I ER+/HER2– breast cancer patients included in the MINDACT trial Ann Oncol 2022 33 310 320 10.1016/j.annonc.2021.11.014 34861376 Lopes Cardozo JMN, Byng D, Drukker CA, et al. Outcome without any adjuvant systemic treatment in stage I ER+/HER2– breast cancer patients included in the MINDACT trial. Ann Oncol 34861376 10.1016/j.annonc.2021.11.014 26. Saphner T Tormey DC Gray R Annual hazard rates of recurrence for breast cancer after primary therapy J Clin Oncol 1996 14 2738 2746 10.1200/JCO.1996.14.10.2738 8874335 Saphner T, Tormey DC, Gray R. Annual hazard rates of recurrence for breast cancer after primary therapy. J Clin Oncol 8874335 10.1200/JCO.1996.14.10.2738 27. de Boer M van Deurzen CH van Dijck JA Micrometastases or isolated tumor cells and the outcome of breast cancer N Engl J Med 2009 361 653 663 10.1056/NEJMoa0904832 19675329 de Boer M, van Deurzen CH, van Dijck JA, et al. Micrometastases or isolated tumor cells and the outcome of breast cancer. N Engl J Med 19675329 10.1056/NEJMoa0904832 28. MacCallum C Elder K Nickson C Contrast-enhanced mammography in local staging of screen-detected breast cancer Ann Surg Oncol 2024 10.1245/s10434-024-15848-y 39048901 MacCallum C, Elder K, Nickson C, et al. Contrast-enhanced mammography in local staging of screen-detected breast cancer. Ann Surg Oncol 39048901 10.1245/s10434-024-15848-y 29. Schumacher JR Tucholka JL Breuer CR Ongoing symptoms and concerns experienced by low-risk breast cancer survivors following active treatment Ann Surg Oncol 2025 32 3252 3259 10.1245/s10434-025-16959-w 39881007 PMC12212006 Schumacher JR, Tucholka JL, Breuer CR, et al. Ongoing symptoms and concerns experienced by low-risk breast cancer survivors following active treatment. Ann Surg Oncol 39881007 10.1245/s10434-025-16959-w PMC12212006 30. McIntosh SA Mactier M Fairhurst K Understanding patient experiences to inform future studies to optimize personalization of treatment for early breast cancer Ann Surg Oncol 2024 31 5870 5879 10.1245/s10434-024-15459-7 38773037 PMC11300560 McIntosh SA, Mactier M, Fairhurst K, et al. Understanding patient experiences to inform future studies to optimize personalization of treatment for early breast cancer. Ann Surg Oncol 38773037 10.1245/s10434-024-15459-7 PMC11300560 31. Fisher ER Anderson S Redmond C Fisher B Ipsilateral breast tumor recurrence and survival following lumpectomy and irradiation: pathological findings from NSABP protocol B-06 Semin Surg Oncol. 1992 8 161 166 1496227 Fisher ER, Anderson S, Redmond C, Fisher B. Ipsilateral breast tumor recurrence and survival following lumpectomy and irradiation: pathological findings from NSABP protocol B-06. Semin Surg Oncol 1496227 32. Dunn JA Donnelly P Elbeltagi N Annual versus less frequent mammographic surveillance in people with breast cancer aged 50 years and older in the UK (Mammo-50): a multicentre, randomised, phase 3, non-inferiority trial Lancet 2025 405 396 407 10.1016/S0140-6736(24)02715-6 39892911 Dunn JA, Donnelly P, Elbeltagi N, et al. Annual versus less frequent mammographic surveillance in people with breast cancer aged 50 years and older in the UK (Mammo-50): a multicentre, randomised, phase 3, non-inferiority trial. Lancet 39892911 10.1016/S0140-6736(24)02715-6 33. Elder K Matheson J Nickson C Contrast-enhanced mammography in breast cancer surveillance Breast Cancer Res Treat 2023 199 221 230 10.1007/s10549-023-06916-0 36966271 PMC10175447 Elder K, Matheson J, Nickson C, et al. Contrast-enhanced mammography in breast cancer surveillance. Breast Cancer Res Treat 36966271 10.1007/s10549-023-06916-0 PMC10175447 34. Matheson J Elder K Nickson C Contrast-enhanced mammography for surveillance in women with a personal history of breast cancer Breast Cancer Res Treat 2024 10.1007/s10549-024-07419-2 38963525 PMC11455689 Matheson J, Elder K, Nickson C, et al. Contrast-enhanced mammography for surveillance in women with a personal history of breast cancer. Breast Cancer Res Treat 38963525 10.1007/s10549-024-07419-2 PMC11455689 35. Houssami N Linn A Abraham MS Accuracy and outcomes of screening mammography in women with a personal history of early-stage breast cancer JAMA 2011 305 790 799 10.1001/jama.2011.188 21343578 PMC3799940 Houssami N, Linn A, Abraham MS, et al. Accuracy and outcomes of screening mammography in women with a personal history of early-stage breast cancer. JAMA 21343578 10.1001/jama.2011.188 PMC3799940 36. Duffy SW Vulkan D Cuckle H Effect of mammographic screening from age 40 years on breast cancer mortality (UK Age trial): final results of a randomised, controlled trial Lancet Oncol 2020 21 1165 1172 10.1016/S1470-2045(20)30398-3 32800099 PMC7491203 Duffy SW, Vulkan D, Cuckle H, et al. Effect of mammographic screening from age 40 years on breast cancer mortality (UK Age trial): final results of a randomised, controlled trial. Lancet Oncol 32800099 10.1016/S1470-2045(20)30398-3 PMC7491203 37. Bakker MF de Lange SV Pijnappel RM Supplemental MRI screening for women with extremely dense breast tissue N Engl J Med 2019 381 2091 2102 10.1056/NEJMoa1903986 31774954 Bakker MF, de Lange SV, Pijnappel RM, et al. Supplemental MRI screening for women with extremely dense breast tissue. N Engl J Med 31774954 10.1056/NEJMoa1903986 ",
  "metadata": {
    "Title of this paper": "Supplemental MRI screening for women with extremely dense breast tissue",
    "Journal it was published in:": "Annals of Surgical Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494671/"
  }
}