{
  "title": "Paper_46",
  "abstract": "pmc Bone Rep Bone Rep 3044 bonr Bone Reports 2352-1872 Elsevier PMC12493230 PMC12493230.1 12493230 12493230 10.1016/j.bonr.2025.101878 S2352-1872(25)00055-5 101878 1 Full Length Article High-fat diet induced obesity and anti-activin receptor antibody: Effects on bone properties in mice Bromer Frederik Duch fd@biomed.au.dk a b c ⁎ Lodberg Andreas a b c Sylow Lykke d Carlsson Michala d Andersen Christian Brix Folsted a Thomsen Jesper Skovhus a 1 Brüel Annemarie a 1 a b c d ⁎ fd@biomed.au.dk 1 Jesper Skovhus Thomsen and Annemarie Brüel are joint senior authors. 12 2025 19 9 2025 27 497210 101878 16 9 2025 18 9 2025 19 09 2025 04 10 2025 04 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Aim Weight-loss therapy often results in an unintended loss of muscle and bone mass. Inhibitors of the activin receptor signaling pathway, such as bimagrumab, an anti-activin receptor antibody (αActRIIA/IIB ab), are under investigation to counteract weight-loss induced muscle loss, but their skeletal effects in obesity remain unclear. This study investigates αActRIIA/IIB ab on bone in mice exposed to a high-fat diet (HFD) model of obesity or standard chow. Materials and methods Male C57BL/6 J mice were stratified into four groups ( n Results HFD did not affect bone density, microstructure, or strength but reduced histological bone formation markers. In standard chow mice, αActRIIA/IIB ab increased trabecular bone volume fraction (BV/TV) and volumetric bone mineral density (vBMD) by 36 %. In HFD mice, the effect of αActRIIA/IIB ab was less pronounced but still increased BV/TV (+16 %) and vBMD (+13 %). For cortical bone, μCT parameters remained largely unaffected by αActRIIA/IIB ab, while the treatment increased periosteal mineralizing bone surfaces in standard chow mice (+217 %), but not in HFD mice. Conclusions αActRIIA/IIB ab enhanced trabecular bone properties in standard chow-fed mice, but its anabolic effects were blunted in HFD-fed mice. Furthermore, αActRIIA/IIB ab improved cortical histological bone formation markers, while morphology remained unaffected, suggesting a site- or time-specific difference. Thus, αActRIIA/IIB ab holds potential for mitigating weight-loss-associated bone deterioration. Highlights • Weight-loss therapies often cause an unintended loss of muscle and bone mass. • Bimagrumab (αActRIIA/IIB ab) is being explored to preserve lean mass during weight loss, but its effects on bone are unclear. • We investigated the effect of αActRIIA/IIB ab on bone in mice with obesity. • αActRIIA/IIB ab improved trabecular bone structure, with minimal cortical bone changes. • High-fat diet blunted bone anabolic effects, suggesting obesity may impair the bone response to activin receptor blockade. Keywords Smad2/3 TGF-beta Bone metabolism Myostatin Weight-loss pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Obesity is defined by a high Body Mass Index and is a growing problem globally ( Peeters et al., 2003 Abbafati et al., 2020 Blüher, 2019 Peeters et al., 2003 Reid, 2002 Gkastaris et al., 2020 Fassio et al., 2018 Premaor et al., 2010 Recent advancements in pharmaceuticals for treating obesity, such as glucagon like peptide-1 (GLP-1) receptor agonists, have attracted massive interest due to the ubiquitous nature of the obesity epidemic ( Jastreboff and Kushner, 2023 Knudsen and Lau, 2019 Torekov et al., 2011 Wilding et al., 2021 Christoffersen et al., 2022 Jensen et al., 2024 IASPs are a new class of pharmaceuticals that have been shown to simultaneously increase skeletal muscle mass and improve bone density, microstructure, and strength ( Pearsall et al., 2008 Lodberg, 2021 Brent et al., 2021 Lodberg et al., 2019 Bromer et al., 2025 Lodberg, 2021 Sugino et al., 1988 Attisano et al., 1996 Whittemore et al., 2003 Rebbapragada et al., 2003 Bimagrumab is one such IASP – a human anti-activin receptor type IIA and type IIB antibody (αActRIIA/IIB ab) – which binds and blocks the ligand-binding site on the activin type IIA and type IIB receptors ( Lach-Trifilieff et al., 2014 Amato et al., 2014 NCT05616013 NCT06643728 Nunn et al., 2024 Multiple studies have shown the potency of αActRIIA/IIB ab to improve skeletal muscle mass in different diseases ( Lach-Trifilieff et al., 2014 Morvan et al., 2017 Polkey et al., 2019 Hatakeyama et al., 2016 Rooks et al., 2020 Rooks et al., 2017a Rooks et al., 2017b Heymsfield et al., 2021 Bromer et al., 2025 NCT05933499 A commonly used preclinical animal model for studying obesity involves exposing mice to a high-fat diet (HFD). In this model, the mice rapidly gain total body weight (BW) and develop many obesity-associated complications, such as increased fat mass and decreased glucose tolerance ( Nilsson et al., 2012 Fang et al., 2023 Nagy and Einwallner, 2018 Zhang et al., 2022 Consequently, this study aimed to investigate the effects of anti-activin receptor antibody treatment on bone parameters in mice fed either a high-fat diet or a standard chow diet. 2 Materials and methods The bones analyzed in the current study originate from a previously published study ( Carlsson et al., 2025 2.1 Production of αActRIIA/IIB ab Expression and purification were performed as described previously ( Bromer et al., 2025 Carlsson et al., 2025 2.2 Housing and animal procedures After acclimatization, forty 14-week-old male C57BL/6 J mice (Janvier Labs, Le Genest-Saint-Isle, France) were allocated into four groups based on BW and body composition ( n Seven weeks after the start of their respective diets, animals in the αActRIIA/IIB ab groups received intraperitoneal injections of αActRIIA/IIB ab (10 mg/kg) twice a week for three weeks. Animals in the vehicle groups received intraperitoneal injections of equal volume vehicle (PBS) twice a week. To monitor the effect of both diet and treatment, BW was measured weekly. To facilitate dynamic bone histomorphometry, tetracycline (20 mg/kg; T3383, Sigma-Aldrich, St. Louis, MO, USA) and alizarin red (20 mg/kg; A3882; Sigma-Aldrich, St. Louis, MO, USA) was injected subcutaneously (s.c.) 8 and 4 days before euthanasia, respectively. After 3 weeks of treatment, all animals were sedated with a pentobarbital/lidocaine mix and euthanized by cervical dislocation. The right femora were removed, their length was measured using a digital caliper, and they were then frozen in Ringer's solution at −20 °C. The left femora were removed, fixed in 4 % formaldehyde for 48 h, and then transferred to 70 % ethanol. The L5 and L6 vertebra were removed and frozen in Ringer's solution at −20 °C. A timeline of the experiment is shown in Fig. 1 Fig. 1 Study overview. (a) Timeline of the study. (b) 3D semitransparent renderings of a femur and a vertebra highlighting the volumes of interests (VOIs) in the femoral mid-diaphysis, distal femoral metaphysis, and vertebral body. In addition, histological sections from the distal femoral metaphysis are shown. The first section is stained with Masson-Goldner trichrome (MGT), where blue arrows indicate osteoblasts and red arrows indicate osteoid. The second section is stained for tartrate resistant acid phosphatase (TRAP), with green arrows pointing to multinucleated osteoclasts. Lastly, an unstained section viewed under fluorescence microscopy showing a red alizarin label and an orange tetracycline label. Fig. 1 2.3 Dual-energy X-ray absorptiometry (DEXA) Areal bone mineral density (aBMD) and bone mineral content (BMC) was determined for the whole femur using DEXA (Sabre XL; Nordland Stratec, Pfortzheim, Germany). Scans were performed at a spatial resolution of 0.1 × 0.1 mm 2 2.4 Micro-computed tomography Bone microstructural parameters were assessed using micro-computed tomography (μCT) (μCT35; Scanco Medical Ag, Brüttisellen, Switzerland) for the right distal femoral metaphyses, the L5 vertebrae, and the right femoral mid-diaphyses. The distal femoral metaphyses and the L5 vertebrae were imaged with 1000 projections / 180° using an X-ray potential of 55 kVp, an isotropic voxel size of 3.5 μm, and an integration time of 800 ms. For the mid-diaphyses, imaging was performed with 500 projections / 180° using an X-ray potential of 55 kVp, an isotropic voxel size of 7 μm, and an integration time of 300 ms. Software supplied with the scanner was used to demarcate the volumes of interest (VOI) for each bone site ( Fig. 1 After reconstruction, a low-pass Gaussian filter (σ = 0.8, support = 1) was applied to the data followed by segmentation using a threshold of 531 mg hydroxyapatite (HA)/cm 3 3 2.5 Mechanical testing Bone strength (maximum applied force, F max 2.6 Tissue preparation for histological analysis The left distal femora and the L6 vertebra were dehydrated and embedded undecalcified in methylmetacrylate, cut into 7-μm-thick longitudinal sections, and mounted on glass slides. The femoral samples were then either left unstained for dynamic bone histomorphometry, stained with Masson-Goldner trichrome, or enzymatically stained for tartrate-resistant acid phosphatase (TRAP), while the L6 vertebra samples were either left unstained or stained with Masson-Goldner trichrome. After mechanical testing of the femur, a 200-μm-thick cross section was cut from the femoral mid-diaphysis, mounted on glass slides, and left unstained for dynamic histomorphometry. 2.7 Dynamic bone histomorphometry The trabecular bone of the distal femoral metaphysis was analyzed using a 1000-μm-high region of interest (ROI) located 200 μm proximal to the most proximal part of the distal growth plate. The ROI of the L6 vertebra comprised the entire trabecular region of the vertebral body, excluding the primary spongiosa. Using a fluorescent microscope (Eclipse i80; Nikon, Tokyo, Japan) connected to a computer with stereology software (Visiopharm v. 2020.09.0.8195; Visiopharm, Hørsholm, Denmark), a randomly oriented line grid was superimposed digitally over the samples, and intersections between the lines and bone or fluorescent labels were counted by a blinded observer. Cortical bone was analyzed using the cross-sectional samples of the femoral mid-diaphysis, where a grid with 24 lines radiating from the center was superimposed over the center of the mid-diaphysis. The intersections between the lines and bone or labels were then counted. For both trabecular bone and cortical bone, mineralizing bone surfaces (MS/BS), mineral apposition rate (MAR), and bone formation rate (BFR/MS) were determined ( Dempster et al., 2013 2.8 Osteoblast, osteoid, and osteoclast count For femoral samples, osteoblast-covered bone surfaces (Ob.S/BS) and osteoid-covered bone surfaces (OS/BS) were determined using the Masson-Goldner trichrome stained sections, while osteoclast-covered bone surfaces (Oc.S/BS) were determined using the sections stained for TRAP. For vertebral samples, only OS/BS was estimated, as the samples had not been fixed in 4 % formaldehyde after removal. ROIs were delineated, as described above. Osteoblasts were identified as clear, cuboidal cells on the bone surface, osteoid as a red seam just beneath the bone surface, and osteoclasts as multinucleated, TRAP-positive cells on the bone surface. 2.9 Statistical analysis Statistical analysis was performed using GraphPad Prism 10.0.1. Normality of the data was assessed using QQ-plots of the residuals. For normally distributed data, a two-way analysis of variance (2 W-ANOVA) was performed, followed by a Holm-Sidak analysis for multiple comparison for Chow vs. HFD, Chow + αActRIIA/IIB ab vs. Chow, and HFD + αActRIIA/IIB ab vs. HFD. For non-normally distributed data, a Kruskal-Wallis test was performed followed by a Dunn's test. Data are presented as relative values in the text and as mean ± standard deviation (SD) in the figures and tables. In the analyses, p 3 Results 3.1 Body weight and femoral length The final BW of HFD mice was higher (+32 %) than that of Chow mice ( Fig. 2 Fig. 2 Body weight and femoral length. (a) Body weight (BW) during the study. (b) Final BW. (c) Femoral length. Data is presented as mean ± SD. ⁎ p ⁎⁎⁎⁎ p Fig. 2 The femoral length did not differ between the groups, regardless of diet or treatment ( Fig. 2 3.2 Dual-energy X-ray absorptiometry Whole femur BMC and aBMD did not differ between the separate groups regardless of diet or treatment, however, the 2 W-ANOVA detected a significant increase in BMC due to treatment ( Table 1 Table 1 Bone properties. Areal bone mineral density (aBMD) and bone mineral content (BMC) determined by Dual-Energy X-Ray Absorptiometry (DEXA). Trabecular separation (Tb.Sp), tissue mineral density (vBMD), cortical bone area ( Ct.B.Ar Ct.T.Ar Ct.Ma.Ar F max a p b p c p p p p p Table 1 Chow Chow + αActRIIA/IIB ab HFD HFD + αActRIIA/IIB ab 2 W-ANOVA HFD Treat Inter Whole femur aBMD (mg/cm 3 61 (2) 64 (3) 63 (3) 63 (3) ns ns ns BMC (mg/cm 3 24 (1) 26 (2) 24 (2) 25 (1) ns * ns  Distal femoral metaphysis Tb.Sp (μm) 213 (12) 187 (9)b 201 (25) 191 (9) ns *** ns TMD (mg/cm3) 902 (8) 920 (6)b 946 (10)a 947 (12) **** ** **  L5 vertebral body Tb.Sp (μm) 173 (7) 161 (9)b 163 (13) 157 (8) * ** ns TMD (mg/cm3) 906 (7) 915 (8)b 942 (9)a 944 (6) **** * ns  Femoral mid-diaphysis Ct.Ba.Ar 0.97 (0.03) 0.97 (0.05) 0.96 (0.05) 0.99 (0.04) ns ns ns Ct.T.Ar 2.16 (0.12) 2.10 (0.13) 2.08 (0.07) 2.17 (0.11) ns ns * Ct.Ma.Ar 1.19 (0.12) 1.13 (0.10) 1.13 (0.07) 1.18 (0.08) ns ns ns Ct.Th (μm) 201 (9) 206 (9) 203 (12) 207 (8) ns ns ns TMD (mg/cm3) 1153 (8) 1152 (9) 1163 (12) 1160 (11) ** ns ns  Mechanical strength Femoral neck, F max 12.9 (1.7) 13.9 (1.3) 13.6 (1.2) 14.3 (1.7) ns ns ns Femoral neck, stiffness (N/mm) 135.6 (21.7) 152.9 (20.3) 142.0 (29.7) 153.7 (24.4) ns ns ns L5 compression, F max 20.9 (2.7) 24.4 (4.3) 23.6 (5.4) 23.7 (4.7) ns ns ns L5 compression, stiffness (N/mm) 184.8 (54.7) 226.7 (57.0) 239.2 (83.8) 254.0 (101.8) ns ns ns Mid-diaphysis, F max 17.6 (1.8) 17.9 (1.5) 18.1 (1.5) 18.1 (1.7) ns ns ns Mid-diaphysis, stiffness (N/mm) 91.6 (8.6) 93.1 (6.3) 95.4 (8.8) 97.9 (10.3) ns ns ns 3.3 Micro-computed tomography 3.3.1 Distal femoral metaphysis HFD mice had increased vBMD (+16 %) and TMD (+5 %) compared to Chow mice, but no other trabecular parameters were affected by the diet ( Fig. 3 Table 1 Fig. 3 Trabecular μCT parameters. (a) μCT bone parameters at the distal femoral metaphysis. (b) Representative μCT reconstructions of the distal femoral metaphysis. (c) μCT bone parameters at the L5 vertebral body. (d) Representative μCT reconstructions of the L5 vertebral body. Bone volume fraction (BV/TV), trabecular number (Tb.N), trabecular thickness (Tb.Th), structure model index (SMI), and volumetric bone mineral density (vBMD). Data is presented as mean ± SD. ⁎ p ⁎⁎ p ⁎⁎⁎ p ⁎⁎⁎⁎ p Fig. 3 3.3.2 L5 vertebra HFD increased BV/TV (+12 %), Tb.Th (+7 %), vBMD (+13 %), and TMD (+4 %) compared to Chow, while SMI (−41 %) was decreased in HFD compared to Chow ( Fig. 3 Table 1 Similarly to trabecular bone at the metaphysis, a statistically significant interaction was observed between diet and treatment for BV/TV, vBMD, and SMI, with HFD blunting the anabolic effect of αActRIIA/IIB ab treatment. 3.3.3 Femoral mid-diaphysis Neither diet nor αActRIIA/IIB ab treatment altered B·Ar, T.Ar, M.Ar, or Ct.Th at the femoral mid-diaphysis ( Table 1 Taken together, the μCT-derived findings show that HFD slightly elevated trabecular bone parameters, while αActRIIA/IIB ab treatment improved trabecular bone structure in both Chow and HFD mice, with a less pronounced effect in HFD mice. Moreover, neither HFD nor αActRIIA/IIB ab treatment significantly affected the cortical bone morphology. 3.4 Mechanical testing Neither diet nor αActRIIA/IIB ab treatment had a statistically significant effect on bone strength at the femoral mid-diaphysis, femoral neck, or L5 vertebral body ( Table 1 3.5 Dynamic bone histomorphometry 3.5.1 Distal femoral metaphysis While HFD did not significantly affect either MS/BS, MAR, or BFR/BS compared to Chow, a borderline significant reduction in MS/BS (−47 %, p 3.5.2 L6 vertebra HFD reduced MS/BS (−44 %) and BFR/BS (−46 %) but did not affect MAR compared to Chow mice (Table S1). αActRIIA/IIB ab treatment did not affect MS/BS, MAR, or BFR/BS in Chow mice, but increased both MS/BS (+35 %) and BFR/BS (+39 %) in HFD mice. 3.5.3 Femoral mid-diaphysis At the periosteal bone surface, MS/BS, MAR, and BFR/BS did not differ between HFD and Chow mice ( Fig. 4 Fig. 4 Fig. 4 Dynamic bone histomorphometry at the femoral mid-diaphysis. (a) A representative sample from each group. Yellow is the tetracycline label and red is the alizarin label. Mineralizing bone surfaces (MS/BS), mineral apposition rate (MAR), and bone formation rate (BFR/BS) for the (b) periosteal and (c) endosteal mid-diaphyseal bone surface. Data is presented as mean ± SD. *: p < 0.05, **: p < 0.01, ****: p < 0.0001, ns: Not significant. Group effects of high-fat diet (HFD), αActRIIA/IIB ab treatment (Treat), and interaction between the two (Inter) were determined by two-way analysis of variance (2 W-ANOVA) and are shown in the textbox. Chow diet and HFD contained 11 and 45 kcal% fat, respectively. Fig. 4 These dynamic bone histomorphometry findings illustrate that HFD decreased trabecular MS/BS at the L6 vertebral body and at the endocortical envelope of the femoral mid-diaphysis. In contrast, treatment with αActRIIA/IIB ab increased MS/BS for trabecular bone and at the periosteal cortical bone surface but had no effect on the endosteal cortical bone surface. 3.6 Osteoblast, osteoid, and osteoclast count 3.6.1 Distal femoral metaphysis Both Ob.S/BS and OS/BS were significantly lower (−79 % and − 73 %, respectively) in HFD mice compared to Chow mice (Table S1). In Chow mice, αActRIIA/IIB ab treatment significantly decreased Ob.S/BS (−66 %), whereas no difference in Ob.S/BS was found in HFD mice. Additionally, treatment with αActRIIA/IIB ab did not affect OS/BS in either diet group. Furthermore, Oc.S/BS was unaffected by both diet and αActRIIA/IIB ab treatment. 3.6.2 L6 vertebra OS/BS was lower (−54 %) in HFD compared to Chow mice (Table S1). In Chow animals, αActRIIA/IIB ab treatment significantly reduced OS/BS (31 %), whereas the treatment had no effect on OS/BS in HFD animals. Ob.S/BS and Oc.S/BS could not be measured, as described in M&M 2.8. 4 Discussion In this study, we investigated the effects of anti-activin receptor antibody treatment on bone parameters in mice exposed to either a high-fat diet or a standard chow diet. We found that treatment with αActRIIA/IIB ab in mice fed a standard chow resulted in significantly improved trabecular bone microstructure at both the distal femoral metaphysis and the L5 vertebral body. Interestingly, the anabolic effect of αActRIIA/IIB ab treatment was less pronounced in mice exposed to a high-fat diet, with significant negative interactions between treatment and high-fat diet for several parameters, including metaphyseal BV/TV and vBMD and vertebral BV/TV, SMI, and vBMD. This suggests that the high-fat diet blunted the bone anabolic effect of αActRIIA/IIB ab. The trabecular bone formation in this study appears to be driven mainly by αActRIIA/IIB ab osteoblastic stimulation, whereas no effect was observed on osteoclast-covered surfaces. Although activin A stimulation of osteoclast differentiation and activity has been shown in vitro Fuller et al., 2000 Sakai et al., 1993 Brent et al., 2021 Jeong et al., 2018 Lotinun et al., 2010 in vivo Bromer et al., 2025 Lodberg et al., 2018 Chantry et al., 2010 The high-fat diet model used in the current study did not negatively affect bone density, microstructural properties, or strength. However, the high-fat diet resulted in reduced histological bone formation markers at multiple bone sites, including the femoral metaphysis, vertebral body, and the mid-diaphyseal endocortical bone, as well as decreased osteoblast- and osteoid-covered surfaces. These findings suggest that an extended study duration could result in significantly impaired structural bone properties. Counterintuitively, high-fat diet increased trabecular bone parameters at the L5 vertebra compared to controls, while dynamic histomorphometry revealed reduced bone formation. Increased body weight is known to enhance mechanical loading, which may explain the higher static trabecular bone values. A plausible explanation is that bone formation was initially stimulated by the increased mechanical load but declined with prolonged high-fat diet, ultimately leading to negative effects on bone, as captured by the dynamic bone histomorphometry performed at the study endpoint. This interpretation is consistent with the two-phase skeletal response to high-fat diet reported by Lecka-Czernik et al. ( Lecka-Czernik et al., 2015 Zhang et al., 2022 Unlike trabecular bone, cortical bone parameters were mostly unaffected by αActRIIA/IIB ab treatment, with only a slight increase in BMC detected by the two-way analysis of variance. This discrepancy between trabecular and cortical bone responses is consistent with our previous findings in female mice, where αActRIIA/IIB ab significantly improved trabecular microstructure but led to only modest increases in aBMD, BMC, and microstructural cortical parameters (B.Ar and T.Ar) in mice of similar age and strain ( Bromer et al., 2025 Bromer et al., 2025 Pearsall et al., 2008 Brent et al., 2021 Lodberg et al., 2018 Initially, IASPs were explored for their bone anabolic potential. However, after their hematopoietic and muscle anabolic effects were discovered, clinical research shifted focus towards diseases affecting muscle and blood tissue ( Lodberg, 2021 Carlsson et al., 2025 Zhang et al., 2022 Beaver et al., 2023 Contrary to expectation, Chow mice treated with αActRIIA/IIB ab had lower Ob.S/BS and OS/BS than their controls. In contrast, we previously found a slight increase in both Ob.S/BS and OS/BS in female mice treated with αActRIIA/IIB ab 18 Saag et al., 2017 Garito et al., 2018 In conclusion, αActRIIA/IIB ab treatment increased cortical bone formation markers and caused a potent bone anabolic response in the trabecular bone of male mice exposed to a standard diet, but this response was blunted in mice exposed to a high-fat diet. CRediT authorship contribution statement Frederik Duch Bromer: Andreas Lodberg: Lykke Sylow: Michala Carlsson: Christian Brix Folsted Andersen: Jesper Skovhus Thomsen: Annemarie Brüel: Declaration of competing interest AL has served as a consultant or has received advisory fees from Acarios, Aureka Biotechnologies, Bluejay Therapeutics, Epirium Bio, and Morgan Stanley. AL, AM, and JST have performed sponsored research for Keros Therapeutics. LS owns stock in Eli Lilly and Company. References Abbafati C. Abbas K.M. Abbasi-Kangevari M. Global burden of 87 risk factors in 204 countries and territories, 1990–2019: a systematic analysis for the global burden of disease study 2019 Lancet 396 10258 2020 1223 1249 10.1016/S0140-6736(20)30752-2 33069327 PMC7566194 Amato A.A. Sivakumar K. Goyal N. Treatment of sporadic inclusion body myositis with bimagrumab Neurology 83 24 2014 2239 2246 10.1212/wnl.0000000000001070 25381300 PMC4277670 Attisano L. Wrana J.L. Montalvo E. Massague J. Activation of signalling by the activin receptor complex Mol. Cell. Biol. 16 3 1996 1066 1073 10.1128/mcb.16.3.1066 8622651 PMC231089 Beaver L.M. Prati M. Gilman K.E. Diet composition influences the effect of high fat diets on bone in growing male mice Bone 176 2023 116888 10.1016/j.bone.2023.116888 37652285 Blüher M. Obesity: global epidemiology and pathogenesis Nat. Rev. Endocrinol. 15 5 2019 288 298 10.1038/s41574-019-0176-8 30814686 Brent M.B. Lodberg A. Bromer F.D. Activin type IIA decoy receptor and intermittent parathyroid hormone in combination overturns the bone loss in disuse-osteopenic mice Bone 142 2021 10.1016/j.bone.2020.115692 33069923 Bromer F.D. Lodberg A. Eijken M. The effect of anti-Activin receptor type IIA and type IIB antibody on muscle, bone and blood in healthy and osteosarcopenic mice J. Cachexia. Sarcopenia Muscle 16 1 2025 10.1002/jcsm.13718 PMC11780395 39887865 Carlsson M. Frank E. Màrmol J.M. Activin receptor type IIA/B blockade increases muscle mass and strength, but compromises glycemic control in mice bioRxiv 2025 10.1101/2025.06.11.659035 Published online June 15, 2025. 06.11.659035 41022302 Chantry A.D. Heath D. Mulivor A.W. Inhibiting activin-a signaling stimulates bone formation and prevents cancer-induced bone destruction in vivo J. Bone Miner. Res. 25 12 2010 2633 2646 10.1002/jbmr.142 20533325 Christoffersen B.Ø. Sanchez-Delgado G. John L.M. Ryan D.H. Raun K. Ravussin E. Beyond appetite regulation: targeting energy expenditure, fat oxidation, and lean mass preservation for sustainable weight loss Obesity 30 4 2022 841 857 10.1002/oby.23374 35333444 PMC9310705 Dempster D.W. Compston J.E. Drezner M.K. Standardized nomenclature, symbols, and units for bone histomorphometry: a 2012 update of the report of the ASBMR Histomorphometry Nomenclature Committee J. Bone Miner. Res. 28 1 2013 2 17 10.1002/jbmr.1805 23197339 PMC3672237 Fang L.Z. Lily Vidal J.A. Hawlader O. Hirasawa M. High-fat diet-induced elevation of body weight set point in male mice Obesity 31 4 2023 1000 1010 10.1002/oby.23650 36811235 Fassio A. Idolazzi L. Rossini M. The obesity paradox and osteoporosis Eat. Weight Disord. 23 3 2018 293 302 10.1007/s40519-018-0505-2 29637521 Fuller K. Bayley K.E. Chambers T.J. Activin A is an essential cofactor for osteoclast induction Biochem. Biophys. Res. Commun. 268 1 2000 2 7 10.1006/bbrc.2000.2075 10652202 Garito T. Zakaria M. Papanicolaou D.A. Effects of bimagrumab, an activin receptor type II inhibitor, on pituitary neurohormonal axes Clin. Endocrinol. 88 6 2018 908 919 10.1111/cen.13601 29566437 Gkastaris K. Goulis D.G. Potoupnis M. Anastasilakis A.D. Kapetanos G. Obesity, osteoporosis and bone metabolism J. Musculoskelet. Neuronal Interact. 20 3 2020 372 381 Accessed April 29, 2024 http://www.ismni.org 32877973 PMC7493444 Hatakeyama S. Summermatter S. Jourdain M. Melly S. Minetti G.C. Lach-Trifilieff E. ActRII blockade protects mice from cancer cachexia and prolongs survival in the presence of anti-cancer treatments Skelet. Muscle 6 1 2016 10.1186/s13395-016-0098-2 PMC4960708 27462398 Heymsfield S.B. Coleman L.A. Miller R. Effect of bimagrumab vs placebo on body fat mass among adults with type 2 diabetes and obesity: a phase 2 randomized clinical trial JAMA Netw. Open 4 1 2021 10.1001/jamanetworkopen.2020.33457 PMC7807292 33439265 Jastreboff A.M. Kushner R.F. New frontiers in obesity treatment: GLP-1 and nascent nutrient-stimulated hormone-based therapeutics Annu. Rev. Med. 74 2023 125 139 10.1146/annurev-med-043021-014919 36706749 Jensen S.B.K. Sørensen V. Sandsdal R.M. Bone health after exercise alone, GLP-1 receptor agonist treatment, or combination treatment: a secondary analysis of a randomized clinical trial JAMA Netw. Open 7 6 2024 e2416775 10.1001/jamanetworkopen.2024.16775 PMC11200146 38916894 Jeong Y. Daghlas S.A. Xie Y. Skeletal response to soluble activin receptor type IIB in mouse models of osteogenesis imperfecta J. Bone Miner. Res. 33 10 2018 1760 1772 10.1002/jbmr.3473 29813187 PMC6400483 Knudsen L.B. Lau J. The discovery and development of liraglutide and semaglutide Front. Endocrinol. (Lausanne) 10 APR 2019 155 10.3389/fendo.2019.00155 31031702 PMC6474072 Lach-Trifilieff E. Minetti G.C. Sheppard K. An antibody blocking Activin type II receptors induces strong skeletal muscle hypertrophy and protects from atrophy Mol. Cell. Biol. 34 4 2014 606 618 10.1128/mcb.01307-13 24298022 PMC3911487 Lecka-Czernik B. Stechschulte L.A. Czernik P.J. Dowling A.R. High bone mass in adult mice with diet-induced obesity results from a combination of initial increase in bone mass followed by attenuation in bone formation; implications for high bone mass and decreased bone quality in obesity Mol. Cell. Endocrinol. 410 2015 35 41 10.1016/J.MCE.2015.01.001 25576855 Lodberg A. Principles of the activin receptor signaling pathway and its inhibition Cytokine Growth Factor Rev. 60 2021 1 17 10.1016/j.cytogfr.2021.04.001 33933900 Lodberg A. Eijken M. van der Eerden B.C.J. Okkels M.W. Thomsen J.S. Brüel A. A soluble activin type IIA receptor mitigates the loss of femoral neck bone strength and cancellous bone mass in a mouse model of disuse osteopenia Bone 110 2018 326 334 10.1016/j.bone.2018.02.026 29499419 Lodberg A. van der Eerden B.C.J. Boers-Sijmons B. A follistatin-based molecule increases muscle and bone mass without affecting the red blood cell count in mice FASEB J. 33 5 2019 6001 6010 10.1096/fj.201801969RR 30759349 Lotinun S. Pearsall R.S. Davies M.V. A soluble activin receptor type IIA fusion protein (ACE-011) increases bone mass via a dual anabolic-antiresorptive effect in Cynomolgus monkeys Bone 46 4 2010 1082 1088 10.1016/j.bone.2010.01.370 20080223 Morvan F. Rondeau J.M. Zou C. Blockade of activin type II receptors with a dual anti-ActRIIA/IIB antibody is critical to promote maximal skeletal muscle hypertrophy Proc. Natl. Acad. Sci. USA 114 47 2017 12448 12453 10.1073/pnas.1707925114 29109273 PMC5703284 Nagy C. Einwallner E. Study of in vivo glucose metabolism in high-fat diet-fed mice using oral glucose tolerance test (OGTT) and insulin tolerance test (ITT) J. Vis. Exp. 2018 131 2018 10.3791/56672 PMC5908452 29364280 Nilsson C. Raun K. Yan F.F. Larsen M.O. Tang-Christensen M. Laboratory animals as surrogate models of human obesity Acta Pharmacol. Sin. 33 2 2012 173 181 10.1038/aps.2011.203 22301857 PMC4010334 Nunn E. Jaiswal N. Gavin M. Antibody blockade of activin type II receptors preserves skeletal muscle mass and enhances fat loss during GLP-1 receptor agonism Mol. Metab. 80 2024 10.1016/j.molmet.2024.101880 PMC10832506 38218536 Pearsall R.S. Canalis E. Cornwall-Brady M. A soluble activin type IIA receptor induces bone formation and improves skeletal integrity Proc. Natl. Acad. Sci. USA 105 19 2008 7082 7087 10.1073/pnas.0711263105 18460605 PMC2383948 Peeters A. Barendregt J.J. Willekens F. Obesity in adulthood and its consequences for life expectancy: a life-table analysis Ann. Intern. Med. 138 1 2003 24 32 10.7326/0003-4819-138-1-200301070-00008 12513041 Polkey M.I. Praestgaard J. Berwick A. Activin type II receptor blockade for treatment of muscle depletion in chronic obstructive pulmonary disease: a randomized trial Am. J. Respir. Crit. Care Med. 199 3 2019 313 320 10.1164/rccm.201802-0286OC 30095981 PMC6363975 Premaor M.O. Pilbrow L. Tonkin C. Parker R.A. Compston J. Obesity and fractures in postmenopausal women J. Bone Miner. Res. 25 2 2010 292 297 10.1359/jbmr.091004 19821769 Rebbapragada A. Benchabane H. Wrana J.L. Celeste A.J. Attisano L. Myostatin signals through a transforming growth factor β-like signaling pathway to block adipogenesis Mol. Cell. Biol. 23 20 2003 7230 7242 10.1128/mcb.23.20.7230-7242.2003 14517293 PMC230332 Reid I.R. Relationships among body mass, its components, and bone Bone 31 5 2002 547 555 10.1016/S8756-3282(02)00864-5 12477567 Rooks D. Praestgaard J. Hariry S. Treatment of sarcopenia with Bimagrumab: results from a phase II, randomized, controlled, proof-of-concept study J. Am. Geriatr. Soc. 65 9 2017 1988 1995 10.1111/jgs.14927 28653345 Rooks D. Swan T. Goswami B. Bimagrumab vs optimized standard of care for treatment of sarcopenia in community-dwelling older adults: a randomized clinical trial JAMA Netw. Open 3 10 2020 e2020836 10.1001/jamanetworkopen.2020.20836 PMC7573681 33074327 Rooks D.S. Laurent D. Praestgaard J. Rasmussen S. Bartlett M. Tankó L.B. Effect of bimagrumab on thigh muscle volume and composition in men with casting-induced atrophy J. Cachexia. Sarcopenia Muscle 8 5 2017 727 734 10.1002/jcsm.12205 28905498 PMC5659065 Saag K.G. Petersen J. Brandi M.L. Romosozumab or alendronate for fracture prevention in women with osteoporosis N. Engl. J. Med. 377 15 2017 1417 1427 10.1056/nejmoa1708322 28892457 Sakai R. Eto Y. Ohtsuka M. Hirafuji M. Shinoda H. Activin enhances osteoclast-like cell formation in vitro Biochem. Biophys. Res. Commun. 195 1 1993 39 46 10.1006/bbrc.1993.2006 7779164 Sugino H. Nakamura T. Hasegawa Y. Identification of a specific receptor for erythroid differentiation factor on follicular granulosa cell J. Biol. Chem. 263 30 1988 15249 15252 10.1016/s0021-9258(19)37578-7 2844805 Torekov S.S. Madsbad S. Holst J.J. Obesity - an indication for GLP-1 treatment? Obesity pathophysiology and GLP-1 treatment potential Obes. Rev. 12 8 2011 593 601 10.1111/j.1467-789X.2011.00860.x 21401851 Whittemore L.A. Song K. Li X. Inhibition of myostatin in adult mice increases skeletal muscle mass and strength Biochem. Biophys. Res. Commun. 300 4 2003 965 971 10.1016/S0006-291X(02)02953-4 12559968 Wilding J.P.H. Batterham R.L. Calanna S. Once-weekly semaglutide in adults with overweight or obesity N. Engl. J. Med. 384 11 2021 989 1002 10.1056/nejmoa2032183 33567185 Zhang Z.Z. Zhang Z.Z. Pei L. How high-fat diet affects bone in mice: a systematic review and meta-analysis Obes. Rev. 23 10 2022 e13493 10.1111/obr.13493 35822276 Glossary 2W-ANOVA Two-way analysis of variance ANOVA Analysis of variance B.Ar Bone area BFR/BS Bone formation rate per bone surface BMC Bone mineral content BMI Body mass index BS Bone surface Ct.Th Cortical thickness DEXA Dual-energy X-ray absorptiometry Fmax Maximum applied force GDF-11 Growth-differentiation factor-11 GLP-1 Glucagon-like peptide-1 HA Hydroxyapatite HFD High-fat diet IASP Inhibitor of the activin receptor signalling pathway M.Ar Marrow area MAR Mineral apposition rate MS/BS Mineralising surface per bone surface OS/BS Osteoid-covered bone surface Ob.S/BS Osteoblast-covered bone surface Oc.S/BS Osteoclast-covered bone surface PBS Phosphate-buffered saline ROI Region of interest SD Standard deviation SMI Structure model index T.Ar Tissue area TGF-beta Transforming growth factor-beta TMD Tissue mineral density TRAP Tartrate-resistant acid phosphatase Tb.N Trabecular number Tb.Sp Trabecular spacing Tb.Th Trabecular thickness VOI Volume of interest aBMD Areal bone mineral density vBMD Volumetric bone mineral density αActRIIA/IIB ab Anti-activin receptor type IIA and type IIB antibody (bimagrumab) Appendix A Supplementary data  Supplementary material Image 1 Data availability Data will be made available on request. Acknowledgments The authors would like to thank Jytte Utoft for excellent technical assistance. The μCT scanner was donated by the VELUX foundation. This research did not receive any specific grant from funding agencies in the public, commercial, or not-for-profit sectors. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.bonr.2025.101878 ",
  "metadata": {
    "Title of this paper": "How high-fat diet affects bone in mice: a systematic review and meta-analysis",
    "Journal it was published in:": "Bone Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12493230/"
  }
}