{
  "title": "Paper_927",
  "abstract": "pmc J Dent Sci J Dent Sci 3597 jds Journal of Dental Sciences 1991-7902 2213-8862 Association for Dental Sciences of the Republic of China PMC12485457 PMC12485457.1 12485457 12485457 41040590 10.1016/j.jds.2025.03.001 S1991-7902(25)00058-3 1 Original Article γ-Mangostin mitigates impaired wound healing and pyroptosis in human gingival fibroblasts induced by advanced glycation end products Huang Chao-Yen a b c † Chen Pei-Yin d e † Ng Min Yee d Liao Yi-Wen c f Yu Cheng-Chia jasminne1117@gmail.com c d e ⁎⁎ Chen Szu-Han ccyu@csmu.edu.tw c d ⁎ a b c d e f ⁎ ccyu@csmu.edu.tw ⁎⁎ jasminne1117@gmail.com † These two authors contributed equally to the results of this study. 10 2025 14 3 2025 20 4 498055 2443 2450 15 2 2025 1 3 2025 14 03 2025 02 10 2025 03 10 2025 © 2025 Association for Dental Sciences of the Republic of China. Publishing services by Elsevier B.Vé. 2025 Association for Dental Sciences of the Republic of China https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Background/purpose The incidence of diabetes mellitus (DM) has gradually increased in recent years. DM and its complications impose a substantial burden on healthcare systems. Chronic hyperglycemia results in the accumulation of advanced glycation end products (AGEs), which in turn elevate oxidative stress and inflammation, thereby contributing to diabetic complications, including impaired wound healing. γ-Mangostin, a mangostin isolated from the pericarp of mangosteen fruit, has been reported to possess antioxidant and anti-inflammatory properties. Our study aimed to investigate the effects of γ-mangostin on AGEs-induced impairment of wound healing and inflammaging. Materials and methods Human gingival fibroblasts (HGFs) were isolated from gingival tissues obtained from patients undergoing crown lengthening surgery. HGFs were treated with AGEs for 24 h, followed by treatment with 0.5–2 μg/mL γ-mangostin for another 24 h. Cell proliferation, wound healing capacity, oxidative stress, cell senescence, pyroptosis, and pro-inflammatory cytokine expression were then assessed. Results Our study found that γ-mangostin at 0.5–2 μg/mL had no effect on HGFs proliferation rate. Furthermore, γ-mangostin restored AGE-induced wound healing impairment and decreased ROS generation. γ-Mangostin reduced AGEs-induced increases in senescence-related β-galactosidase (SA-β-gal) activity and senescence markers p16 and p21. Furthermore, γ-mangostin decreased the expression of pyroptosis-related markers, including as ASC, NLR family pyrin domain-containing 3 (NLRP3), pro-caspase-1, and cleaved gasdermin D (GSDMD). Finally, γ-mangostin inhibited the AGE-induced production of pro-inflammatory cytokines IL-6 and IL-8. Conclusion Our findings suggest that AGEs impair wound healing and promote oxidative stress, cellular senescence, pyroptosis, and inflammation. γ-Mangostin treatment mitigated these effects, potentially by attenuating inflammation and pyroptosis, thereby improving wound healing. Keywords Diabetic periodontitis γ-mangostin Advanced glycation end product Wound healing Inflammaging pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Insulin resistance and insufficiency are two main characteristics of diabetes mellitus (DM). 1 2 3 4 , 5 6 7 8 The destruction of soft and hard tissues in the periodontal region is a defining characteristic of periodontitis, a chronic inflammatory oral disease that ultimately leads to the loss of periodontal ligament, cementum, and alveolar bone, culminating in tooth loss. 9 10 11 , 12 13 14 Inflammaging is a chronic and low-grade systemic inflammation that accompanies aging, exacerbates age-related diseases including cellular senescence, immune dysfunction, and organ damage. 15 , 16 16 , 17 4 In vivo Porphyromonas gingivalis 18 10 , 19 Mangosteen ( Garcinia mangostana 20 21 , 22 23 24 25 Materials and methods Cell culture Human gingival fibroblasts (HGFs) were collected from three healthy patients who had crown lengthening surgery. All experimental techniques followed the Institutional Review Board (IRB) guidelines of the National Chung Shan Medical University Hospital (IRB Number: CSMUH-CS2-23059). To prevent the alteration of fibroblast properties, cells from the third to the eighth generation were cultivated for the study. HGFs were procured from the gingiva at the upper one third of the root, and the gingival tissues were soaked in sterile saline for 1–4 h prior to the experiment. Following multiple washes with phosphate-buffered saline (PBS), the gingival tissues were chopped with a scalpel and incubated with 3 mg/mL collagenase type I at 37 °C. HGFs were then cultured for 30 min and subsequently filtered through a 70 mm strainer to achieve a single-cell solution for culture. The culture medium for human fibroblast cultivation is DMEM supplemented with 10 % FBS, and HGFs were subcultured upon reaching 90 % confluence. γ-Mangostin (Sigma Chemical Co., St. Louis, MO, USA) was dissolved in methanol and prepared in various concentrations for research use. In this study, human fibroblasts were cultivated with 200 μg/mL AGE-BSA (BioVision, Milpitas, CA, USA) for 24 h, after which they were treated with 0.5 and 1 μg/mL γ-mangostin for an additional 24 h. Each experiment was conducted three times using fibroblasts from two distinct donors. Cell viability assay HGFs (10000 cells/well) were inoculated into 96-well plates (Corning Inc., Rochester, NY, USA) for 24 h. After the cells had attached, 200 μg/mL AGE-BSA was added for 24 h 0.5–2 μg/mL γ-mangostin was added and cultured for another 24 h. Prestoblue was diluted 10-fold and 100 μL was added to each well and the absorbance at 570 nm was measured to evaluate cell viability and proliferation ability. The absorbance at 570 nm of the group without γ-mangostin was set as 100 % cell viability, and the cell viability of the remaining groups were calculated relative to control. Wound healing assay After the HGFs have reached 80 % confluence, the monolayer was scraped across the center of the well in a 12-well plate using a sterile 200 μL tip. A further 48 h were allowed for the growth of HGF cells. Images of cell migration toward the denuded region were captured using a microscope at both 0 and 48 h. ROS analysis HGF cells were rinsed with PBS, and subsequently, fresh culture medium was introduced. Subsequently, 10 μM 2′,7′-dichlorodihydrofluorescein diacetate indicator was introduced, and the cells were placed back in the 37 °C incubator with 5 % CO 2 Cellular senescence assay The Senescence Detection Kit (BioVision) was used to measure the proportion of cells positive for senescence-associated β-galactosidase (SA-β-gal). HGFs were inoculated onto 6-well culture plates and then rinsed with PBS. Subsequently, the cells were subjected to SA-β-gal staining fixative at ambient temperature for 20 min, followed by three washes with PBS. 470 μl of staining solution, 5 μl of staining additive, and 25 μl of 20 mg/mL X-gal were included. The specimens were stained using a DMF solution. Subsequent to the application of the stain, the cells were incubated overnight at 37 °C in a 5 % CO 2 Western blot Western blot was conducted as previously mentioned. 26 ELISA analysis The supernatants were collected and analyzed for IL-6 and IL-8 concentrations using ELISA kits (R&D Systems, Minneapolis, MN, USA) after HGFs were treated with AGEs and γ-mangostin. The procedures were carried out according to the manufacturer's recommendations, and the absorbance at a wavelength of 450 nm was measured for analysis (MRX; Dynatech Laboratories, Chantilly, VA, USA). Each sample was measured three times. Statistical analysis Results were presented as the mean ± standard deviation (SD), and the experiments were performed three times. One-way analysis of variance (ANOVA) and Duncan's test were employed to conduct statistical analysis. Significant differences were defined as P Results Human gingival fibroblasts (HGFs), the major cell type in the oral cavity are essential for the repair of gingival tissue wounds, 27 Fig. 1 Figure 1 The effect of γ-mangostin on cell proliferation of human gingival fibroblasts (HGFs) induced by advanced glycation end products (AGEs). 4 Figure 1 Our study revealed that 200 μg/mL AGE-BSA impeded wound healing. Meanwhile, treatment with 0.5 and 1 μg/mL γ-mangostin markedly enhanced wound healing, indicating a protective effect against AGE-induced injury ( Fig. 2 Fig. 3 Figure 2 γ-Mangostin reverse impaired wound healing in human gingival fibroblasts (HGFs) treated with advanced glycation end products (AGEs). P P Figure 2 Figure 3 γ-Mangostin diminished the production of ROS in human gingival fibroblasts (HGFs) induced by advanced glycation end products (AGEs). P P Figure 3 Additionally, we investigated the effects of γ-mangostin on cellular senescence. AGE-BSA markedly elevated senescence-associated β-galactosidase (SA-β-gal) activity, an indicator of cellular senescence. SA-β-gal activity and senescence markers p16 and p21 induced by AGE-BSA was considerably inhibited by γ-mangostin ( Fig. 4 28 29 Fig. 5 30 Fig. 6 Figure 4 γ-Mangostin attenuated cell senescence and the protein level of senescence markers p16 and p21 in human gingival fibroblasts (HGFs) produced by advanced glycation end products (AGEs) Figure 4 Figure 5 γ-Mangostin decreased the protein level of pyroptosis markers in human gingival fibroblasts (HGFs) induced by advanced glycation end-products (AGEs). Figure 5 Figure 6 γ-Mangostin inhibited the production of pro-inflammatory cytokines in human gingival fibroblasts (HGFs) induced by advanced glycation end products (AGEs). P P Figure 6 Discussion Our investigation revealed that AGEs significantly contribute to inflammaging through multiple interconnected pathways, ultimately leading to impaired wound healing ( Figure 2 Figure 3 31 32 33 19 33 , 34 A key finding of our study is the role of AGE-induced oxidative stress in promoting cell senescence and SASP expression. The resulting inflammation and paracrine signaling create a detrimental cycle that disrupts tissue function, potentially exacerbating both diabetes and its complications. 35 36 Fig. 4 The impairment of wound healing in diabetic conditions emerges as a critical consequence of these molecular changes. At wound sites, significant ROS production triggers enhanced SASP release from senescent cells, leading to decreased angiogenesis and vascular permeability. 37 38 The biochemical mechanisms underlying diabetes-related wound healing impairment, particularly in periodontal tissues, remain an area of active investigation. Current evidence suggests that oxidative stress plays a central role in the pathogenesis of both diabetes and periodontal disease, with these conditions mutually exacerbating oxidative stress in periodontal tissues. 39 7 8 In a nutshell, our findings indicate that AGE treatment in HGFs leads to increased oxidative stress and cell senescence, along with elevated levels of pyroptosis-related proteins and a reduced wound healing capacity. These results highlight the intricate relationship between these pathways. The therapeutic potential of γ-mangostin, which can mitigate these harmful processes and promote wound healing, offers a promising avenue for intervention. Targeting the AGE-induced inflammaging pathway, particularly by modulating oxidative stress and cellular senescence, could be a valuable strategy for enhancing wound healing in diabetic patients. However, due to the complexity of the wound healing process, further research is necessary to fully explore the effects of such treatments on macrophages, angiogenesis, and different stages of healing. Declaration of competing interest The authors have no conflicts of interest relevant to this article. References 1 Mealey B.L. Oates T.W. Diabetes mellitus and periodontal diseases J Periodontol 77 2006 1289 1303 16881798 10.1902/jop.2006.050459 2 ElSayed N.A. Aleppo G. Aroda V.R. Erratum. 2. Classification and diagnosis of diabetes: standards of care in diabetes-2023 Diabetes Care 46 Suppl 1 2023 S19 S40 Diabetes Care 2023;46:1106 36724041 10.2337/dc23-er05 PMC10154657 3 Forbes J.M. Cooper M.E. Mechanisms of diabetic complications Physiol Rev 93 2013 137 188 23303908 10.1152/physrev.00045.2011 4 Singh V.P. Bali A. Singh N. Jaggi A.S. Advanced glycation end products and diabetic complications KOREAN J PHYSIOL PHARMACOL 18 2014 1 14 24634591 10.4196/kjpp.2014.18.1.1 PMC3951818 5 Vlassara H. Uribarri J. Advanced glycation end products (AGE) and diabetes: cause, effect, or both? Curr Diabetes Rep 14 2014 453 10.1007/s11892-013-0453-1 PMC3903318 24292971 6 Ahmed N. Thornalley P.J. Advanced glycation endproducts: what is their relevance to diabetic complications? Diabetes Obes Metabol 9 2007 233 245 10.1111/j.1463-1326.2006.00595.x 17391149 7 Zhao Z. Ming Y. Li X. Hyperglycemia aggravates periodontitis via autophagy impairment and ROS-inflammasome-mediated macrophage pyroptosis Int J Mol Sci 24 2023 6309 37047282 10.3390/ijms24076309 PMC10094233 8 Zhao M. Xie Y. Gao W. Li C. Ye Q. Li Y. Diabetes mellitus promotes susceptibility to periodontitis-novel insight into the molecular mechanisms Front Endocrinol 14 2023 1192625 10.3389/fendo.2023.1192625 PMC10469003 37664859 9 Hoare A. Soto C. Rojas-Celis V. Bravo D. Chronic inflammation as a link between periodontitis and carcinogenesis Mediat Inflamm 2019 2019 1029857 10.1155/2019/1029857 PMC6458883 31049022 10 Hajishengallis G. Periodontitis. from microbial immune subversion to systemic inflammation Nat Rev Immunol 15 2015 30 44 25534621 10.1038/nri3785 PMC4276050 11 Barutta F. Bellini S. Durazzo M. Gruden G. Novel insight into the mechanisms of the bidirectional relationship between diabetes and periodontitis Biomedicines 10 2022 178 35052857 10.3390/biomedicines10010178 PMC8774037 12 King G.L. The role of inflammatory cytokines in diabetes and its complications J Periodontol 79 8 Suppl 2008 1527 1534 18673007 10.1902/jop.2008.080246 13 Jepsen S. Caton J.G. Albandar J.M. Periodontal manifestations of systemic diseases and developmental and acquired conditions: consensus report of workgroup 3 of the 2017 World Workshop on the classification of periodontal and peri-implant diseases and conditions J Periodontol 89 Suppl 1 2018 S237 S248 29926943 10.1002/JPER.17-0733 14 Falanga V. Wound healing and its impairment in the diabetic foot Lancet 366 2005 1736 1743 16291068 10.1016/S0140-6736(05)67700-8 15 Xia S. Zhang X. Zheng S. An update on inflamm-aging: mechanisms, prevention, and treatment J Immunol Res 2016 2016 8426874 10.1155/2016/8426874 PMC4963991 27493973 16 Franceschi C. Campisi J. Chronic inflammation (inflammaging) and its potential contribution to age-associated diseases J Gerontol A Biol Sci Med Sci 69 Suppl 1 2014 S4 S9 24833586 10.1093/gerona/glu057 17 Franceschi C. Capri M. Monti D. Inflammaging and anti-inflammaging: a systemic perspective on aging and longevity emerged from studies in humans Mech Ageing Dev 128 2007 92 105 17116321 10.1016/j.mad.2006.11.016 18 Yamaguchi Y. Kurita-Ochiai T. Kobayashi R. Suzuki T. Ando T. Regulation of the NLRP3 inflammasome in Porphyromonas gingivalis-accelerated periodontal disease Inflamm Res 66 2017 59 65 27665233 10.1007/s00011-016-0992-4 19 Zhang P. Wang Q. Nie L. Hyperglycemia-induced inflamm-aging accelerates gingival senescence via NLRC4 phosphorylation J Biol Chem 294 2019 18807 18819 31676687 10.1074/jbc.RA119.010648 PMC6901307 20 Ovalle-Magallanes B. Eugenio-Pérez D. Pedraza-Chaverri J. Medicinal properties of mangosteen (Garcinia mangostana L.): a comprehensive update Food Chem Toxicol 109 2017 102 122 28842267 10.1016/j.fct.2017.08.021 21 Suttirak W. Manurakchinakorn S. In vitro antioxidant properties of mangosteen peel extract J Food Sci Technol 51 2014 3546 3558 25477623 10.1007/s13197-012-0887-5 PMC4252444 22 Wang J.J. Sanderson B.J. Zhang W. Cytotoxic effect of xanthones from pericarp of the tropical fruit mangosteen (Garcinia mangostana Linn.) on human melanoma cells Food Chem Toxicol 49 2011 2385 2391 21723363 10.1016/j.fct.2011.06.051 23 Pérez-Rojas J.M. González-Macías R. González-Cortes J. Jurado R. Pedraza-Chaverri J. García-López P. Synergic effect of α-mangostin on the cytotoxicity of cisplatin in a cervical cancer model Oxid Med Cell Longev 2016 2016 7981397 10.1155/2016/7981397 PMC5178369 28053694 24 Yeong K.Y. Khaw K.Y. Takahashi Y. Itoh Y. Murugaiyah V. Suzuki T. Discovery of gamma-mangostin from Garcinia mangostana as a potent and selective natural SIRT2 inhibitor Bioorg Chem 94 2020 103403 10.1016/j.bioorg.2019.103403 31711765 25 Chen S.P. Lin S.R. Chen T.H. Mangosteen xanthone γ-mangostin exerts lowering blood glucose effect with potentiating insulin sensitivity through the mediation of AMPK/PPARγ Biomed Pharmacother 144 2021 112333 10.1016/j.biopha.2021.112333 34678724 26 Huang C.Y. Ng M.Y. Lin T. Quercetin ameliorates advanced glycation end product-induced wound healing impairment and inflammaging in human gingival fibroblasts J Dent Sci 19 2024 268 275 38303825 10.1016/j.jds.2023.04.014 PMC10829550 27 Wada N. Menicanin D. Shi S. Bartold P.M. Gronthos S. Immunomodulatory properties of human periodontal ligament stem cells J Cell Physiol 219 2009 667 676 19160415 10.1002/jcp.21710 28 Wan L. Bai X. Zhou Q. The advanced glycation end-products (AGEs)/ROS/NLRP3 inflammasome axis contributes to delayed diabetic corneal wound healing and nerve regeneration Int J Biol Sci 18 2022 809 825 35002527 10.7150/ijbs.63219 PMC8741862 29 Kelley N. Jeltema D. Duan Y. He Y. The NLRP3 inflammasome: an overview of mechanisms of activation and regulation Int J Mol Sci 20 2019 3328 31284572 10.3390/ijms20133328 PMC6651423 30 Vilotić A. Nacka-Aleksić M. Pirković A. Bojić-Trbojević Ž. Dekanski D. Jovanović Krivokuća M. IL-6 and IL-8: an overview of their roles in healthy and pathological pregnancies Int J Mol Sci 23 2022 14574 10.3390/ijms232314574 PMC9738067 36498901 31 Qin Z.Y. Gu X. Chen Y.L. Toll-like receptor 4 activates the NLRP3 inflammasome pathway and periodontal inflammaging by inhibiting Bmi-1 expression Int J Mol Med 47 2021 137 150 33236134 10.3892/ijmm.2020.4787 PMC7723510 32 Nonaka K. Kajiura Y. Bando M. Advanced glycation end-products increase IL-6 and ICAM-1 expression via RAGE, MAPK and NF-kappaB pathways in human gingival fibroblasts J Periodontal Res 53 2018 334 344 29193068 10.1111/jre.12518 33 Franceschi C. Garagnani P. Parini P. Giuliani C. Santoro A. Inflammaging: a new immune-metabolic viewpoint for age-related diseases Nat Rev Endocrinol 14 2018 576 590 30046148 10.1038/s41574-018-0059-4 34 Chiu H.C. Fu M.M. Yang T.S. Effect of high glucose, Porphyromonas gingivalis lipopolysaccharide and advanced glycation end-products on production of interleukin-6/-8 by gingival fibroblasts J Periodontal Res 52 2017 268 276 27397896 10.1111/jre.12391 35 Prattichizzo F. De Nigris V. La Sala L. Procopio A.D. Olivieri F. Ceriello A. \"Inflammaging\" as a druggable target: a senescence-associated secretory phenotype-centered view of type 2 diabetes Oxid Med Cell Longev 2016 2016 1810327 10.1155/2016/1810327 PMC4908264 27340505 36 Murakami T. Inagaki N. Kondoh H. Cellular senescence in diabetes mellitus: distinct senotherapeutic strategies for adipose tissue and pancreatic β cells Front Endocrinol 13 2022 869414 10.3389/fendo.2022.869414 PMC9009089 35432205 37 Wei X. Li M. Zheng Z. Senescence in chronic wounds and potential targeted therapies Burns Trauma 10 2022 tkab045 10.1093/burnst/tkab045 PMC8853744 35187179 38 Wilkinson H.N. Hardman M.J. Wound healing: cellular mechanisms and pathological outcomes Open Biol 10 2020 200223 10.1098/rsob.200223 PMC7536089 32993416 39 Buranasin P. Kominato H. Mizutani K. Influence of reactive oxygen species on wound healing and tissue regeneration in periodontal and peri-implant tissues in diabetic patients Antioxidants 12 2023 1787 37760090 10.3390/antiox12091787 PMC10525304 Acknowledgments This work was funded by grants from the 10.13039/501100004699 Chung Shan Medical University Hospital CSH-2023-C-041 ",
  "metadata": {
    "Title of this paper": "Influence of reactive oxygen species on wound healing and tissue regeneration in periodontal and peri-implant tissues in diabetic patients",
    "Journal it was published in:": "Journal of Dental Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485457/"
  }
}