{
  "title": "Paper_1208",
  "abstract": "pmc Nutrients Nutrients 1692 nutrients nutrients Nutrients 2072-6643 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472808 PMC12472808.1 12472808 12472808 41010438 10.3390/nu17182912 nutrients-17-02912 1 Article Impact of Preoperative Malnutrition on Postoperative Quality of Life in Older Adults Undergoing Surgery for Degenerative Cervical Myelopathy: A Retrospective Cohort Study https://orcid.org/0000-0002-2329-123X Taniguchi Yuki Conceptualization Methodology Validation Formal analysis Investigation Resources Data curation Writing – original draft Writing – review & editing Visualization Funding acquisition 1 2 * Nakamoto Hideki Methodology Resources 2 Kato So Validation Formal analysis Data curation Writing – review & editing 2 https://orcid.org/0000-0003-4908-309X Nakarai Hiroyuki Data curation 2 https://orcid.org/0000-0003-4495-1134 Nagata Kosei Formal analysis Data curation Writing – review & editing 2 Kono Kenichi Conceptualization Methodology 1 2 Saito Yuhei Software Resources 1 Inoue Reo Resources 1 Okawa Hiroshi Resources 1 Tanaka Sakae Supervision 2 Oshima Yasushi Validation Data curation Supervision 2 Fukatsu Kazuhiko Conceptualization Writing – review & editing Supervision Project administration 1 Graf Christophe E. Academic Editor 1 kkouno_tki@yahoo.co.jp fukatsu-1su@h.u-tokyo.ac.jp 2 hidekinski.indifferent@gmail.com skatou-tky@umin.net h.nakarai.ort@gmail.com koseinagata1984@gmail.com tanakas-ort@h.u-tokyo.ac.jp yoo-tky@umin.ac.jp * taniguchi-tky@umin.ac.jp 09 9 2025 9 2025 17 18 497660 2912 17 8 2025 08 9 2025 08 9 2025 09 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods: Results: p p Conclusions: malnutrition health-related quality of life geriatric degenerative cervical myelopathy JSPS KAKENHI JP23K08669 The APC was funded by JSPS KAKENHI Grant Number JP23K08669. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Population aging is progressing globally, drawing increasing attention to the concept of health-adjusted life expectancy [ 1 2 3 4 5 6 7 8 9 10 11 12 13 2. Materials and Methods 2.1. Data Source and Patients We conducted a retrospective analysis of our prospective cohort, enrolling consecutive patients aged ≥65 years who underwent elective surgery for DCM in our hospital between 1 April 2017 and 31 January 2024. We excluded patients who underwent revision surgery, those with rheumatoid arthritis, those on hemodialysis, those with atlantoaxial subluxation, and individuals from whom informed consent could not be obtained. This study was approved by the Research Ethics Committee of the University of Tokyo [approval numbers 10335-(9) and 2674-(9)], and written informed consent was obtained from all participants. 2.2. Data Collection The collected data included patient characteristics, surgery-related information, and patient-reported outcome measures (PROMs). Patient characteristics included age, sex, body mass index (BMI), diagnosis, preoperative American Society of Anesthesiologists Physical Status (ASA-PS) score, smoking status, and diagnosis of diabetes mellitus. Diagnosis of the disease was classified into cervical spondylotic myelopathy (CSM), ossification of the posterior longitudinal ligament (OPLL), and cervical disc herniation. For univariate and multivariate analyses, patients’ ages were categorized into three groups: 65–74, 75–84, and ≥85. Surgery-related data included operation time, estimated blood loss, surgical procedure, and use of microendoscopy. Surgical procedures included posterior decompression, such as laminectomy and laminoplasty, posterior decompression with fusion, anterior decompression with fusion, and combined anterior and posterior decompression with fusion. The occurrence of incidental intraoperative durotomy was also recorded. For PROMs, we used the EuroQol Five-Dimension Questionnaire (EQ-5D) administered preoperatively and one year postoperatively as the primary outcome [ 14 15 16 17 18 2.3. Assessment of Preoperative Nutritional Status Preoperative nutritional status was evaluated using the Geriatric Nutritional Risk Index (GNRI), which was calculated from the patient’s preoperative serum albumin level and BMI [ 19 20 21 22 2.4. Statistical Analysis Continuous variables were compared using t p p 3. Results 3.1. Patient Characteristics We identified 188 eligible patients in our cohort, comprising 110 males and 78 females. Table 1 2 Table 1 Table 1 Table 1 Table 1 Table 1 Table 1 p Table 1 3.2. Comparison Between the Malnutrition Risk and No-Risk Groups The malnutrition risk group (those with preoperative GNRI ≤ 98) included 35 patients, whereas the remaining 153 patients (with preoperative GNRI > 98) were categorized into the no-risk group ( Table 2 Table 2 Table 2 Table 2 p Table 2 Table 2 3.3. Proportions of Patients with Changes Exceeding the MCID Thresholds for EQ-5D Score in the Malnutrition Risk and No-Risk Groups Subsequently, we analyzed the proportion of patients whose EQ-5D score changes exceeded the MCID thresholds, either for improvement or deterioration. Although there was no significant difference in the proportion of patients who achieved an improvement exceeding the MCID, the proportion of patients who experienced deterioration beyond the MCID was significantly higher in the malnutrition risk group than in the no-risk group (37.1% vs. 21.2%, p Table 3 3.4. Risk Factors for Deterioration in EQ-5D Score Exceeding the MCID Threshold To determine the actual impact of preoperative nutritional status on postoperative EQ-5D-deterioration, we conducted univariate and multivariate analyses. Univariate analysis did not reveal statistically significant associations, but incidental durotomy and preoperative GNRI ≤ 98 tended to be associated with a deterioration in EQ-5D exceeding the MCID ( Table 4 Table 4 Supplementary Tables S1–S3 4. Discussion This study demonstrates that preoperative malnutrition risk has a clear impact on postoperative HRQOL in elderly patients with DCM. Patients with preoperative malnutrition risk, defined as GNRI ≤ 98, had significantly lower EQ-5D values one year after surgery than those without malnutrition risk. Furthermore, preoperative GNRI ≤ 98 was identified as an independent risk factor for deterioration in EQ-5D score exceeding the MCID threshold at one year postoperatively. Previous studies have demonstrated a relationship between preoperative nutritional status and perioperative complications following cervical spine surgery. Lee et al. found that a baseline serum albumin <3.5 g/dL might serve as a predictor of several complications following posterior cervical fusion [ 13 23 24 25 26 27 Malnutrition has been closely linked to sarcopenia and frailty, and recent reports have highlighted the relationship between sarcopenia/frailty and postoperative HRQOL following cervical spine surgery [ 28 29 30 31 32 33 34 35 Another possible factor contributing to the poor postoperative outcomes observed in patients with preoperative malnutrition risk in this study may be related to cervical alignment. A previous study demonstrated that preoperative malnutrition is a risk factor for postoperative cervical kyphosis development in elderly patients undergoing laminoplasty for CSM [ 36 37 38 There is an ongoing debate regarding the optimal indicator for assessing preoperative nutritional status. Various indices have been proposed in the literature, including GNRI, PNI, the Mini Nutritional Assessment–Short Form, the Controlling Nutritional Status (CONUT) score, the Global Leadership Initiative on Malnutrition criteria, and the Malnutrition Universal Screening Tool [ 19 39 40 41 42 43 44 Our findings support the incorporation of routine nutritional risk screening into the preoperative pathway for elderly patients undergoing surgery for DCM. Practical approaches include brief clinic-based screening and/or the use of validated indices such as the GNRI, followed by early referral to a registered dietitian for targeted counseling and initiation of oral nutritional supplementation when risk is identified [ 45 This study has several limitations. First, its retrospective, single-center design is prone to information bias and residual confounding. Because exposures and covariates were abstracted from routine clinical records rather than collected under a prespecified protocol, misclassification is possible. Important confounders—such as the severity of frailty/sarcopenia, socioeconomic factors, intensity of perioperative rehabilitation, and detailed radiographic parameters—were not fully captured, introducing the potential for unmeasured or inadequately measured confounding that could bias estimates in either direction. Second, selection bias cannot be excluded. Eligibility for elective surgery depends on the medical fitness of the patient and clinician judgment; patients with more severe malnutrition or complex conditions may have been triaged to nonoperative care or deferred for optimization and thus not included, which could attenuate the observed associations. Conversely, preoperative optimization among those proceeding to surgery may have selectively improved nutritional indices. Third, the sample size was relatively modest in relation to the number of covariates and events, limiting statistical power for subgroup analyses and yielding wider confidence intervals. Small samples also increase model instability and reduce the ability to explore non-linear effects or interactions, thereby constraining the precision and generalizability of the estimates. 5. Conclusions The present study is the first to demonstrate the negative impact of preoperative malnutrition status, defined as GNRI ≤ 98, on postoperative HRQOL in elderly patients with DCM. Patients with preoperative malnutrition risk had significantly lower EQ-5D values one year after surgery than those without malnutrition risk. Furthermore, preoperative malnutrition risk was identified as an independent risk factor for deterioration in EQ-5D score, exceeding the MCID threshold at one year postoperatively. These findings underscore the importance of preoperative nutritional assessment and management in geriatric patients undergoing cervical spine surgery. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/nu17182912/s1 Author Contributions Conceptualization, Y.T., K.K. and K.F.; Methodology, Y.T., K.K. and H.N. (Hideki Nakamoto); Software, Y.S.; Validation, Y.T., S.K. and Y.O.; Formal Analysis, Y.T., S.K. and K.N.; Investigation, Y.T.; Resources, Y.T., H.N. (Hideki Nakamoto), Y.S., R.I. and H.O.; Data Curation, Y.T., H.N. (Hiroyuki Nakarai), K.N., S.K. and Y.O.; Writing—Original Draft Preparation, Y.T.; Writing—Review and Editing, Y.T., S.K., K.N. and K.F.; Visualization, Y.T.; Supervision, K.F., S.T. and Y.O.; Project Administration, K.F.; Funding Acquisition, Y.T. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the Declaration of Helsinki and approved by the Research Ethics Committee of the University of Tokyo [approval numbers 10335-(9), 26 December 2013, and 2674-(9), 27 July 2009]. Informed Consent Statement Informed consent was obtained from all subjects involved in this study. Data Availability Statement The data presented in this study are available from the corresponding author upon request due to restrictions related to the protection of personal information. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ADLs activities of daily living ASA-PS American Society of Anesthesiologists Physical Status BMI body mass index CONUT Controlling Nutritional Status CSM cervical spondylotic myelopathy DCM degenerative cervical myelopathy EQ-5D EuroQol Five-Dimension Questionnaire GNRI Geriatric Nutritional Risk Index HRQOL health-related quality of life MCID minimum clinically important difference PNI Prognostic Nutritional Index PROM patient-reported outcome measure QOL quality of life References 1. United Nations, Department of Economic and Social Affairs, Population Division World Population Prospects 2019: Highlights ST/ESA/SER.A/423 United Nations New York, NY, USA 2019 2. Garmany A. Terzic A. Global healthspan-lifespan gaps among 183 World Health Organization Member States JAMA Netw. Open 2024 7 e2450241 10.1001/jamanetworkopen.2024.50241 39661386 PMC11635540 3. Dent E. Wright O.R.L. Woo J. Hoogendijk E.O. Malnutrition in older adults Lancet 2023 401 951 966 10.1016/S0140-6736(22)02612-5 36716756 4. Ligthart-Melis G.C. Luiking Y.C. Kakourou A. Cederholm T. Maier A.B. de van der Schueren M.A.E. Frailty, sarcopenia, and malnutrition frequently (co-)occur in hospitalized older adults: A systematic review and meta-analysis J. Am. Med. Dir. Assoc. 2020 21 1216 1228 10.1016/j.jamda.2020.03.006 32327302 5. Roberts S. Collins P. Rattray M. Identifying and managing malnutrition, frailty and sarcopenia in the community: A narrative review Nutrients 2021 13 2316 10.3390/nu13072316 34371823 PMC8308465 6. Bloom I. Shand C. Cooper C. Robinson S. Baird J. Diet Quality and Sarcopenia in Older Adults: A Systematic Review Nutrients 2018 10 308 10.3390/nu10030308 29510572 PMC5872726 7. Gonçalves T.J.M. Gonçalves S.E.A.B. Nava N. Jorge V.C. Okawa A.M. Rocha V.A. Forato L.C.H. Furuya V.A.O. Martins S.S. Oksman D. Perioperative Immunonutrition in Elderly Patients Undergoing Total Hip and Knee Arthroplasty: Impact on Postoperative Outcomes J. Parenter. Enteral Nutr. 2021 45 1559 1566 10.1002/jpen.2028 33044001 PMC8518379 8. Gregori P. Franceschetti E. Basciani S. Impieri L. Zampogna B. Matano A. Manzi C. Carbone L. Marano L. Papalia R. Immunonutrition in Orthopedic and Traumatic Patients Nutrients 2023 15 537 10.3390/nu15030537 36771245 PMC9919811 9. Norman K. Haß U. Pirlich M. Malnutrition in Older Adults-Recent Advances and Remaining Challenges Nutrients 2021 13 2764 10.3390/nu13082764 34444924 PMC8399049 10. Puvanesarajah V. Jain A. Kebaish K. Shaffrey C.I. Sciubba D.M. De la Garza-Ramos R. Khanna A.J. Hassanzadeh H. Poor nutrition status and lumbar spine fusion surgery in the elderly: Readmissions, complications, and mortality Spine 2017 42 979 983 10.1097/BRS.0000000000001969 27831968 11. Kang T. Park S.Y. Lee J.S. Lee S.H. Park J.H. Suh S.W. Predicting postoperative complications in patients undergoing lumbar spinal fusion by using the modified five-item frailty index and nutritional status Bone Joint J. 2020 102-B 1717 1722 10.1302/0301-620X.102B12.BJJ-2020-0874.R1 33249905 12. Ushirozako H. Hasegawa T. Yamato Y. Yoshida G. Yasuda T. Banno T. Arima H. Oe S. Mihara Y. Yamada T. Does preoperative prognostic nutrition index predict surgical site infection after spine surgery? Eur. Spine J. 2021 30 1765 1773 33037485 10.1007/s00586-020-06622-1 13. Lee N.J. Kothari P. Kim J.S. Phan K. Di Capua J. Shin J. Cho S.K. Nutritional status as an adjunct risk factor for early postoperative complications following posterior cervical fusion Spine 2017 42 1367 1374 10.1097/brs.0000000000002119 28187076 14. EuroQol Group EuroQol—A new facility for the measurement of health-related quality of life Health Policy 1990 16 199 208 10.1016/0168-8510(90)90421-9 10109801 15. Tsuchiya A. Ikeda S. Ikegami N. Nishimura S. Sakai I. Fukuda T. Hamashima C. Hisashige A. Tamura M. Estimating an EQ-5D population value set: The case of Japan Health Econ. 2002 11 341 353 10.1002/hec.673 12007165 16. Kato S. Oshima Y. Matsubayashi Y. Taniguchi Y. Tanaka S. Takeshita K. Minimum clinically important difference in outcome scores among patients undergoing cervical laminoplasty Eur. Spine J. 2019 28 1234 1241 10.1007/s00586-019-05945-y 30877386 17. Ohya J. Oshima Y. Oka H. Saiki F. Taniguchi Y. Matsubayashi Y. Tanaka S. Chikuda H. Takeshita K. Patient satisfaction with posterior decompression surgery for cervical ossification of the posterior longitudinal ligament: Prognostic radiographic factors and patient-reported outcomes for the effectiveness of surgical treatment World Neurosurg. 2016 96 272 279 10.1016/j.wneu.2016.09.011 27647024 18. Nakajima K. Miyahara J. Ohtomo N. Nagata K. Kato S. Doi T. Matsubayashi Y. Taniguchi Y. Kawamura N. Higashikawa A. Impact of body mass index on outcomes after lumbar spine surgery Sci. Rep. 2023 13 7862 10.1038/s41598-023-35008-8 37188788 PMC10185565 19. Bouillanne O. Morineau G. Dupont C. Coulombel I. Vincent J.-P. Nicolis I. Benazeth S. Cynober L. Aussel C. Geriatric nutritional risk index: A new index for evaluating at-risk elderly medical patients Am. J. Clin. Nutr. 2005 82 777 783 10.1093/ajcn/82.4.777 16210706 20. Sasaki M. Miyoshi N. Fujino S. Ogino T. Takahashi H. Uemura M. Matsuda C. Yamamoto H. Mizushima T. Mori M. The geriatric nutritional risk index predicts postoperative complications and prognosis in elderly patients with colorectal cancer after curative surgery Sci. Rep. 2020 10 10744 10.1038/s41598-020-67285-y 32612136 PMC7329855 21. Kanno H. Goto Y. Sasaki S. Fukutomi S. Hisaka T. Fujita F. Akagi Y. Okuda K. Geriatric nutritional risk index predicts prognosis in hepatocellular carcinoma after hepatectomy: A propensity score matching analysis Sci. Rep. 2021 11 9038 10.1038/s41598-021-88254-z 33907232 PMC8079680 22. Sargento L. Vicente Simões A. Rodrigues J. Longo S. Lousada N. Palma Dos Reis R. Geriatric nutritional risk index as a nutritional and survival risk assessment tool in stable outpatients with systolic heart failure Nutr. Metab. Cardiovasc. Dis. 2017 27 430 437 10.1016/j.numecd.2017.02.003 28438373 23. Kurosu K. Oe S. Hasegawa T. Shimizu S. Yoshida G. Kobayashi S. Fujita T. Yamada T. Ide K. Watanabe Y. Preoperative prognostic nutritional index as a predictive factor for medical complication after cervical posterior decompression surgery: A multicenter study J. Orthop. Surg. 2021 29 23094990211006869 10.1177/23094990211006869 33832377 24. Alam J.S. Easmin S. Bou Monsef J. Paulino C. The geriatric nutritional risk index is an independent predictor for adverse outcomes after anterior cervical discectomy and fusion World Neurosurg. 2024 189 e260 e266 10.1016/j.wneu.2024.06.030 38871286 25. Mendiratta D. Para A. Berg A.R. Vives M.J. Use of the geriatric nutritional risk index to assess risk for postoperative complications following posterior cervical decompression/fusion Int. J. Spine Surg. 2023 17 866 874 10.14444/8551 37884336 PMC10753348 26. Kokubu Y. Kawahara S. Hamai S. Akasaki Y. Sato T. Konishi T. Inoue T. Nakashima Y. Geriatric Nutritional Risk Index is a risk factor for long-term decreases in patient-reported outcome measures following total knee arthroplasty J. Exp. Orthop. 2025 12 e70170 10.1002/jeo2.70170 39944723 PMC11815201 27. Chen Y. Bei M. Liu G. Zhang J. Ge Y. Tan Z. Peng W. Gao F. Tu C. Tian M. Prognostic nutritional index (PNI) is an independent predictor for functional outcome after hip fracture in the elderly: A prospective cohort study Arch. Osteoporos. 2024 19 107 10.1007/s11657-024-01469-1 39499371 PMC11538184 28. Crovetto Mattassi M. Henríquez Mella C. Pérez Bocaz L. Association between sarcopenia and nutritional status in Chilean older people aged 65 years and older Nutrients 2022 14 5228 10.3390/nu14245228 36558390 PMC9784207 29. Papadopoulou S.K. Papadimitriou K. Voulgaridou G. Georgaki E. Tsotidou E. Zantidou O. Papandreou D. Exercise and nutrition impact on osteoporosis and sarcopenia-the incidence of osteosarcopenia: A narrative review Nutrients 2021 13 4499 10.3390/nu13124499 34960050 PMC8705961 30. Eglseer D. Eminovic S. Lohrmann C. Association between sarcopenia and nutritional status in older adults: A systematic literature review J. Gerontol. Nurs. 2016 42 33 41 10.3928/00989134-20160613-03 27337185 31. Tayal A. Wahi S. Afsar A.P. Pahwa B. Garg K. Sarcopenia as a predictor of poor functional outcome of cervical spine surgery: A systematic review and meta-analysis Neurosurg. Rev. 2025 48 256 10.1007/s10143-025-03398-0 39976777 32. Pinter Z.W. Reed R. Townsley S.E. Mikula A.L. Lakomkin N. Kazarian E. Michalopoulos G.D. Freedman B.A. Currier B.L. Elder B.D. Paraspinal sarcopenia is associated with worse patient-reported outcomes following laminoplasty for degenerative cervical myelopathy Spine 2023 48 772 781 10.1097/BRS.0000000000004650 36972148 33. Cheng X. Ye W. Yu Z. Chen C. Yu T. Zhuang J. Xiao D. Huang Y. Chang Y. Impact of frailty on short- and long-term outcomes following cervical laminoplasty for ossification of the posterior longitudinal ligament: A retrospective cohort study Eur. Spine J. 2025 34 3345 3355 10.1007/s00586-025-08902-0 40410363 34. Wilson J.R.F. Badhiwala J.H. Moghaddamjou A. Vaccaro A.R. Arnold P.M. Bartels R.H.M.A. Barbagallo G. Fehlings M.G. Adverse effects of frailty on the outcomes of surgery for degenerative cervical myelopathy: Results from a prospective multicenter international data set of 757 patients J. Neurosurg. Spine 2023 39 815 821 10.3171/2023.6.SPINE23461 37728372 35. Buccheri E. Dell’Aquila D. Russo M. Chiaramonte R. Musumeci G. Vecchio M. Can artificial intelligence simplify the screening of muscle mass loss? Heliyon 2023 9 e16323 10.1016/j.heliyon.2023.e16323 37251872 PMC10208931 36. Takasawa E. Iizuka Y. Ishiwata S. Kakuta Y. Inomata K. Tomomatsu Y. Ito S. Honda A. Mieda T. Chikuda H. Impact of the preoperative nutritional status on postoperative kyphosis in geriatric patients undergoing cervical laminoplasty Eur. Spine J. 2023 32 374 381 10.1007/s00586-022-07481-8 36471185 37. Roguski M. Benzel E.C. Curran J.N. Magge S.N. Bisson E.F. Krishnaney A.A. Steinmetz M.P. Butler W.E. Heary R.F. Ghogawala Z. Postoperative cervical sagittal imbalance negatively affects outcomes after surgery for cervical spondylotic myelopathy Spine 2014 39 2070 2077 10.1097/BRS.0000000000000641 25419682 PMC4254605 38. Inose H. Yoshii T. Kimura A. Takeshita K. Inoue H. Maekawa A. Endo K. Miyamoto T. Furuya T. Nakamura A. Comparison of clinical and radiographic outcomes of laminoplasty, anterior decompression with fusion, and posterior decompression with fusion for degenerative cervical myelopathy: A prospective multicenter study Spine 2020 45 E1342 E1348 10.1097/BRS.0000000000003592 32576779 39. Onodera T. Goseki N. Kosaki G. Prognostic nutritional index in gastrointestinal surgery of malnourished cancer patients Nihon Geka Gakkai Zasshi 1984 85 1001 1005 6438478 40. Kondrup J. Allison S.P. Elia M. Vellas B. Plauth M. Educational and Clinical Practice Committee, European Society of Parenteral and Enteral Nutrition (ESPEN) ESPEN guidelines for nutrition screening 2002 Clin. Nutr. 2003 22 415 421 10.1016/S0261-5614(03)00098-0 12880610 41. Ignacio de Ulíbarri J. González-Madroño A. de Villar N.G. González P. González B. Mancha A. Rodríguez F. Fernández G. CONUT: A tool for controlling nutritional status. First validation in a hospital population Nutr. Hosp. 2005 20 38 45 15762418 42. Jensen G.L. Cederholm T. Correia M.I.T.D. Gonzalez M.C. Fukushima R. Higashiguchi T. de Baptista G.A. Barazzoni R. Blaauw R. Coats A.J. GLIM Criteria for the diagnosis of malnutrition: A consensus report from the global clinical nutrition community J. Parenter. Enteral Nutr. 2019 43 32 40 10.1002/jpen.1440 30175461 43. Stratton R.J. Hackston A. Longmore D. Dixon R. Price S. Stroud M. King C. Elia M. Malnutrition in hospital outpatients and inpatients: Prevalence, concurrent validity and ease of use of the ‘malnutrition universal screening tool’ (“MUST”) for adults Br. J. Nutr. 2004 92 799 808 10.1079/bjn20041258 15533269 44. Acarbaş A. Baş N.S. Which objective nutritional index is better for the prediction of adverse medical events in elderly patients undergoing spinal surgery? World Neurosurg. 2021 146 e106 e111 10.1016/j.wneu.2020.10.041 33068798 45. Williams D.G. Aronson S. Murray S. Fuller M. Villalta E. Haines K.L. Wischmeyer P.E. Validation of the perioperative nutrition screen for prediction of postoperative outcomes J. Parenter. Enteral Nutr. 2022 46 1307 1315 10.1002/jpen.2310 34850403 nutrients-17-02912-t001_Table 1 Table 1 Patient characteristics, surgery-related data, and patient-reported outcome measures of the study population. Number of Patients 188  Sex   Male 110 (58.5) Female 78 (41.5) Age at surgery, years 76.1 [6.0] Body mass index, kg/m 2 24.1 [3.8] Preoperative GNRI 106.1 [8.7] Diagnosis   Cervical spondylotic myelopathy 128 (68.1) Ossification of the posterior longitudinal ligament 55 (29.3) Cervical disc herniation 5 (2.7) ASA-PS   1 11 (5.9) 2 153 (81.4) 3 23 (12.2) 4 1 (0.5) Smoking 13 (6.9) Diabetes 62 (33.0) Operation time, min 144.4 [69.1] Estimated blood loss, mL 121.8 [182.2] Surgical procedure   Posterior decompression 167 (88.8) Posterior decompression with fusion 17 (9.0) Anterior decompression with fusion 3 (1.6) Anterior and posterior fusion with decompression 1 (0.5) Microendoscopic surgery 28 (14.9) Incidental durotomy 6 (3.2) EQ-5D value   Before surgery 0.57 [0.18] One year after surgery 0.66 [0.17] Values are presented as n nutrients-17-02912-t002_Table 2 Table 2 Comparison between the malnutrition risk and no-risk groups.  Malnutrition Risk Group No-Risk Group  p Number of patients (%) 35 (18.6) 153 (81.4)  Sex (Male:Female) 19:16 91:62 0.58 Age at surgery, years 77.3 [6.7] 75.8 [5.8] 0.18 Body mass index, kg/m 2 20.3 [2.3] 24.9 [3.5]  <0.001 Preoperative GNRI 93.9 [3.9] 108.8 [6.9]  <0.001 Diagnosis    (CSM:OPLL:CDH) 25:8:2 103:47:3 0.34 ASA-PS (1:2:3:4) 3:24:7:1 8:129:16:0  0.048 Smoking (yes:no) 3:32 10:143 0.71 Diabetes (yes:no) 23:12 103:50 0.84 Operation time, min 136.9 [42.9] 146.1 [72.0] 0.48 Estimated blood loss, mL 97.0 [102.2] 127.5 [195.8] 0.37 Surgical procedure    (PD:PDF:ADF:APDF) 30:4:1:0 137:13:2:1 0.81 Microendoscopic surgery (yes:no) 3:32 25:128 0.30 Incidental durotomy (yes:no) 1:34 5:148 1.00 Patients’ satisfaction    (satisfied:dissatisfied) 21:14 104:49 0.43 EQ-5D value    Before surgery 0.57 [0.20] 0.57 [0.17] 0.99 One year after surgery 0.58 [0.16] 0.67 [0.16]  0.003 Values are presented as n nutrients-17-02912-t003_Table 3 Table 3 The number of patients in the malnutrition risk and no-risk groups whose one-year changes in EuroQol Five-Dimension Questionnaire (EQ-5D) score reached the minimum clinically important difference.  Malnutrition Risk Group No-Risk Group  p One-year change in EQ-5D value (%)    ∆ ≥ 0.0485 16/35 (45.7) 85/146 (58.2) 0.19 ∆ ≤ −0.0485 13/35 (37.1) 31/146 (21.2)  0.049 GNRI, Geriatric Nutritional Risk Index; ∆, changes in each patient-reported outcome measure from preoperative baseline to one year postoperatively. nutrients-17-02912-t004_Table 4 Table 4 Univariate and multivariate analyses for deterioration in EQ-5D score exceeding the MCID of −0.0485 at one year postoperatively.  Univariate Analysis Multivariate Analysis  Odds Ratio [CI]  p Odds Ratio [CI]  p Age, years  0.94  0.71 85+ 0.88 [0.18–3.23]  0.68 [0.13–2.68]  75–84 1.09 [0.54–2.26]  1.19 [0.57–2.50]  65–74 Reference  Reference  Sex  0.87  0.79 Male 1.06 [0.53–2.14]  1.10 [0.55–2.27]  Female Reference  Reference  Preoperative GNRI  0.06   0.04 ≤98 2.19 [0.98–4.81]  2.40 [1.03–5.52]  >98 Reference  Reference  Diabetes  0.97   Yes 0.99 [0.47–2.02]    No Reference    Smoking  0.24   Yes 2.07 [0.60–6.56]    No Reference    Diagnosis  0.32   OPLL 1.01 [0.47–2.10]    CDH <0.001 [*–1.93]    CSM Reference    ASA-PS  0.27   3 or 4 4.80 [0.70–96.7]    2 2.79 [0.50–52.3]    1 Reference    Surgical procedure  0.94   Fusion with decompression 1.04 [0.32–2.89]    Decompression alone Reference    Microendoscopic surgery  0.44   Yes 0.67 [0.21–1.77]    No Reference    Incidental durotomy  0.06  0.07 Yes <0.001 [*–1.15]  <0.001 [*–1.16]  No Reference  Reference  *, not estimable; EQ-5D, EuroQol Five-Dimension Questionnaire; CI, confidence interval; OPLL, ossification of the longitudinal ligament; CDH, cervical disc herniation; CSM, cervical spondylotic myelopathy; ASA-PS, American Society of Anesthesiologists Physical Status; GNRI, Geriatric Nutritional Risk Index. ",
  "metadata": {
    "Title of this paper": "Validation of the perioperative nutrition screen for prediction of postoperative outcomes",
    "Journal it was published in:": "Nutrients",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472808/"
  }
}