{
  "title": "Paper_572",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473970 PMC12473970.1 12473970 12473970 41012548 10.3390/pharmaceutics17091213 pharmaceutics-17-01213 1 Article Glycyrrhiza uralensis Zhao Yanan Methodology Validation Data curation Writing – original draft 1 † Song Ming Conceptualization Methodology Validation Formal analysis Data curation Writing – original draft 1 † Dilixiati Yilizilan Validation Writing – review & editing Supervision 1 Cai Shanshan Conceptualization Writing – original draft Visualization 1 Maisaidi Reyilanmu Software Investigation 2 Aili Patanmu Conceptualization Writing – review & editing 1 https://orcid.org/0000-0002-3295-6096 Li Jinyao Methodology Validation Writing – review & editing Funding acquisition 1 Han Lili Conceptualization Validation Supervision Funding acquisition 2 * Aipire Adila Conceptualization Validation Writing – review & editing Supervision Funding acquisition 1 * Gonçalves Lídia Maria Diogo Academic Editor Szebeni Janos Academic Editor 1 zhaoyanan514@163.com 107552100985@stu.xju.edu.cn 107552100963@stu.xju.edu.cn 18699927521@163.com 17690025193@163.com ljyxju@xju.edu.cn 2 18814115890@163.com * hanliliabcd@163.com adila16@xju.edu.cn † These authors contributed equally to this work. 17 9 2025 9 2025 17 9 497664 1213 04 6 2025 02 8 2025 22 8 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background Glycyrrhiza uralensis Methods Results + + Conclusions GUPS-AuNPs DC vaccine immune enhancement antigen delivery antitumor Key research and development program in Xinjiang Uygur Autonomous Region 2022B03018-5 Tianshan Talent Training Program 2023TSYCLJ0043 Natural Science Foundation of Xinjiang Uygur Autonomous Region 2022D01C97 This work was supported by the Key research and development program in Xinjiang Uygur Autonomous Region (2022B03018-5) to Adila Aipire, Tianshan Talent Training Program (2023TSYCLJ0043) to Jinyao Li, and the Natural Science Foundation of Xinjiang Uygur Autonomous Region (2022D01C97). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cervical cancer is the fourth most common malignant tumor among women and a major cause of cancer-related mortality, ranking as the second leading cause of cancer deaths in females. Consequently, it poses a serious threat to women’s health [ 1 2 3 4 DCs are specialized antigen-presenting cells that function as professional carriers for antigen delivery. DC vaccines work by capturing antigens ex vivo and then reintroducing them into the body to activate and guide the antitumor responses of tumor-killing T cells [ 5 6 7 8 Previous research by our group has demonstrated that GUPS enhance macrophage activation through the TLR4 receptor pathway, promote DC maturation, and serve as an effective vaccine adjuvant, boosting both antibody and cellular immune responses across a range of vaccine types, including protein vaccines, DNA vaccines, and HPV-DC vaccines [ 9 10 11 12 2. Materials and Methods 2.1. Materials and Reagents Ural licorice, sourced from in the Xinjiang Uygur Autonomous Region, Yining, China, was processed to extract Glycyrrhiza uralensis polysaccharides (GUPS), which were subsequently preserved in the laboratory, as verified by Xinjiang Pharmaceutical Research. Additionally, the HPV-containing plasmid pGEX-2T-HPV 16 E7-DH5α and TC-1 cells were stored at the Xinjiang Key Laboratory of Genetic Engineering for Bioresources, affiliated with Xinjiang University. HAuCl 4 2.2. Synthesis of GUPS-AuNPs Begin by placing a 250 mL round-bottom flask on a magnetic stirrer set to a consistent stirring speed of 400 rpm. Add 10 mL of a 0.01% HAuCl 4 4 2.3. Physicochemical Characterization of GUPS-AuNP The transmission electron microscopy (TEM) analysis was performed on GUPS-AuNP dissolved at a concentration of 1 mg/mL. The morphology of the material was characterized using TEM, while the elemental distributions were effectively visualized with mapping technology, offering a clear and intuitive representation. Field emission scanning electron microscopy (SEM) and energy-dispersive X-ray spectroscopy (EDS) were utilized to examine the morphological features and elemental composition of GUPS-AuNP dry powder. These analyses were performed using a scanning electron microscope (model SU8010). Additionally, UV–visible absorption spectroscopy was utilized to analyze GUPS, AuNPs, and the GUPS-AuNP composite, with the wavelength scanning range set between 190 and 900 nm, which includes both the ultraviolet and visible light regions. Infrared spectroscopy (FT-IR) analysis was performed by homogenizing 2 mg of GUPS-AuNP with 400 mg of KBr to create a sample pellet. The pellet was scanned using an FT-IR spectrometer at a resolution of 4 cm −1 −1 −1 ζ-Potential analysis: The particle size of GUPS-AuNP was measured using a laser particle size analyzer, with three parallel tests conducted to ensure accuracy. 2.4. Bone Marrow-Derived DC Induction Culture Granulocyte-macrophage colony-stimulating factor (GM-CSF) was employed to induce dendritic cells (DCs) from the bone marrow of C57BL/6 mice. The procedure involved the extraction of bone marrow from the femurs and tibias of the mice, followed by centrifugation at 1200 rpm for 7 min to remove the supernatant. The resulting cells were resuspended and cultured in RPMI-1640 complete medium, which was supplemented with 10% fetal bovine serum, 1% antibiotics, and 20 ng/mL GM-CSF. Cultures were maintained in 60 mm Petri dishes at 37 °C in a 5% CO 2 2.5. Detection of DC Surface Molecules by Flow Cytometry (FCM) On the seventh day of culture, DCs were harvested and seeded into 24-well plates at a density of 2 × 106 cells per well. The effects of GUPS-AuNP treatment at varying concentrations on DCs were evaluated over a 12 h period, with 20 ng/mL LPS serving as a positive control. After treatment, the cells were collected by centrifugation at 1200 rpm for 7 min, and the supernatant was preserved for cytokine concentration analysis. The cells were then rinsed with PBS, stained with fluorescent antibodies targeting CD40 and CD86 for 15 min, and resuspended following a subsequent PBS wash. Finally, the cell suspension was filtered through a 200-mesh copper mesh into a collection tube for flow cytometry assessment. 2.6. Enzyme-Linked Immunosorbent Assay (ELISA) for Assessing Cytokine Secretion Levels The DC culture supernatant was analyzed for cytokine content using an ELISA kit, following the manufacturer’s instructions (Elabscience). The procedure was conducted as follows: Cytokine standards (2000 pg) were prepared using a sample diluent and subjected to gradient dilution to create seven standard concentrations: 1000 pg/mL, 500 pg/mL, 250 pg/mL, 125 pg/mL, 62.5 pg/mL, 31.25 pg/mL, and 15.625 pg/mL. A total of 100 μL of each appropriately diluted standard and sample solution was added to pre-coated 96-well plates and incubated at 37 °C for 90 min. After incubation, the liquid in the wells was discarded, and 100 μL of diluted antibody solution was added to each well, followed by an additional incubation at 37 °C for 60 min. The wells were then washed by adding 200 μL of washing solution to each well for 1 min, after which the liquid was removed by tapping the plate dry. This washing process was repeated three times. Afterward, 100 μL of pre-diluted (1:100) enzyme solution was added and incubated at 37 °C for 30 min. The samples underwent another incubation at 37 °C for an additional 30 min. Once this step was complete, 200 μL of washing solution was added to each well for 1 min, and the washing process was repeated five times. Finally, 90 μL of color development solution was added to each well and allowed to react for 5 to 15 min at room temperature. To stop the reaction, 50 μL of termination solution was added to each well. The optical density (OD450) value was then measured using a multifunctional enzyme marker. The cytokine standard curves were generated based on the requirements of the experiment, with the horizontal axis (X-axis) representing the concentration and the vertical axis (Y-axis) indicating OD450: IL-6: y = 0.0006 x + 0.0612, R 2 TNF-α: y = 0.0008 x + 0.0787, R 2 IL-12p40: y = 0.0008 x + 0.1008, R 2 2.7. GUPS-AuNP Antigen Phagocytosis Assay On day 7, DCs were exposed to GUPS-AuNP at a concentration of 2 μg/mL or LPS at 20 ng/mL for 12 h. Afterward, the cultures were incubated for 1 h at 37 °C in a 5% CO 2 2.8. Evaluation of the Impact of GUPS-AuNP-Treated Dendritic Cells on T Cell Proliferation DCs from primary cultures were harvested on day 7 and exposed to 2 μg/mL of GUPS-AuNP and GUPS for 12 h, respectively. LPS at a concentration of 20 ng/mL was used as the positive control. Spleens from BALB/c mice were homogenized, followed by the addition of red blood cell lysate. Spleen cells were then isolated through centrifugation and subsequent washing with PBS. These cells were stained with 1 μM CellTrace™ Violet, rinsed with PBS, and resuspended in complete medium. Spleen cells were paired with DCs at a ratio of 5:1, with the spleen cells set at a density of 1 × 10 6 + + 2.9. Binding of GUPS-AuNP to OVA Proteins In a 50 mL round-bottom flask, 10 mL of GUPS-AuNP was mixed with 100 μL of FITC-OVA. The mixture was stirred in the dark using a magnetic stirrer for 6, 12, and 24 h. Subsequently, PBS was used to remove unbound proteins, yielding the GUPS-AuNP/FITC-OVA complex. This complex was then analyzed using a UV spectrophotometer. The binding efficiency of GUPS-AuNP to the OVA protein was evaluated using a BCA protein quantification kit, with bovine serum albumin (BSA) serving as the standard for the assay. 2.10. Ability of FCM to Detect DC Capture of FITC-OVA Antigen DCs derived from primary cultures were harvested on day 7 through centrifugation at 1200 rpm for 7 min. The cells were then seeded into 24-well plates at a concentration of 1 × 10 6 + 2.11. Confocal Microscopy Analysis of GUPS-AuNP-Mediated Delivery of FITC-OVA DCs were treated with GUPS-AuNP/FITC-OVA under dark conditions for various durations of 12 h, 6 h, 4 h, and 1 h while an untreated group served as the control. Following treatment, the cells were washed twice with PBS. A staining solution was prepared according to the protocol outlined in the cell membrane red fluorescent staining kit. Subsequently, 500 μL of the staining solution was added to each sample, and the samples were incubated at 37 °C for 20 min. After incubation, the samples were washed twice with PBS, and 200 μL of anti-fluorescence quenching sealing solution containing DAPI was carefully added. The samples were then incubated at 37 °C for 10 min before imaging with a Nikon A1 confocal laser scanning microscope. 2.12. Localization of GUPS-AuNP/FITC-OVA in DCs DCs from primary culture were collected on day seven through centrifugation at 1200 rpm for 7 min, counted, and subsequently transferred to a specialized Petri dish for laser confocal imaging at a density of 1 × 10 5 2.13. Establishment and Treatment of TC-1 Tumor Model Mice To assess the antitumor efficacy of the HPV DC vaccine, a TC-1 tumor model was established in mice. The procedure for creating the TC-1 tumor model and the subsequent treatment strategy is depicted in Figure 5a. During the logarithmic growth phase, TC-1 cells were collected, centrifuged at 1000 rpm for 5 min, and resuspended in PBS at a concentration of 1 × 10 6 5 Tumor-bearing mice were randomly divided into four groups, each comprising five mice. The first group, which received untreated DC peptides, acted as the control. The second group was administered the GUPS-AuNP-DC + E7pep peptide. The third group received the GUPS-AuNP-E7pro peptide-DC peptide, while the fourth group was treated with the GUPS-AuNP-E7pro-DC vaccine. The intradermal administration of the DC vaccine was conducted on days 5 and 12 after tumor inoculation, with a total of two immunizations delivered at 7-day intervals. The mice’s mental state was closely observed, and detailed records of tumor size changes were meticulously maintained. The length (a) and width (b) of the tumor tissue were measured every two days using vernier calipers. Tumor volume was calculated, and a tumor growth curve was plotted based on the following formula: Tumor volume (V, in mm 3 2 2.14. FCM Analysis of Spleen Immune Cells After grinding and processing the spleen tissue, the cells were resuspended in 5 mL of complete medium and counted. Each mouse yielded two million spleen cells, which were subsequently washed with PBS. The cells were then incubated at room temperature for 15 min with antibodies against CD3, CD19, CD49b, CD4, CD8, and CD44, all while shielded from light. Following incubation, the cells were rinsed with PBS, centrifuged at 1200 rpm for 7 min, and resuspended in PBS. They were then filtered through a 200-mesh copper mesh into flow cytometry tubes. Finally, the samples were collected using flow cytometry. 2.15. Tregs Cell Ratio Detection A total of 2 × 10 6 2.16. Detection of Antigen-Specific T Cell Immune Responses The wells of a 24-well cell culture plate were seeded with spleen cells at a concentration of 2 × 10 6 The cells were collected and incubated with anti-CD4 and anti-CD8 antibodies for 15 min, followed by a PBS wash. A membrane-permeabilizing fixative was then added, and the cells were incubated for an additional 30 min at 4 °C. Afterward, the cells were washed with 1 mL of washing buffer, and the resulting cell pellets were incubated with an anti-IFN-γ antibody for 15 min. Following this step, the cells were washed again with PBS. Finally, the cells were resuspended in PBS, filtered through a 200-mesh copper mesh, and transferred to flow cytometry tubes. The samples were subsequently collected and analyzed via flow cytometry. 2.17. Statistical Analysis of Data Data analysis was conducted using GraphPad Prism 10.2. (San Diego, CA, USA) Statistical evaluations employed one-way analysis of variance (ANOVA) and the Mann–Whitney non-parametric t p 3. Results 3.1. Synthesis and Characterization of GUPS-AuNP The synthesis of GUPS-AuNPs was carried out using varying ratios (1:1, 2:1, 5:1, 7:1, 10:1, and 15:1) of GUPS (1 mg/mL) and HAuCl 4 Figure S1b Figure S1c Figure S1d,e SEM was employed to characterize the structure of GUPS-AuNPs, demonstrating that they exhibit a relatively uniform structural morphology ( Figure 1 Figure 1 Figure 1 Figure 1 −1 −1 13 14 −1 15 Figure 1 Figure 1 3.2. Maturity and Functionality of GUPS-AuNP-Enhanced DCs To systematically assess the impact of GUPS-AuNP on dendritic cell (DC) maturation and function, DCs were exposed to varying concentrations of GUPS-AuNP (1, 2, 4, 8, 10, and 12 μg/mL), with lipopolysaccharide (LPS) serving as the positive control. After a 12 h treatment, the expression levels of surface molecules and cytokines in DCs were evaluated. The findings revealed that different concentrations of GUPS-AuNP significantly enhanced the expression of DC surface markers CD40 and CD86 ( Figure 2 Figure 2 Mature DCs experience a diminished ability to phagocytize antigens. To confirm DC maturation, we assessed their phagocytic activity. The research results showed that compared with the control group, both GUPS and GUPS-AuNP reduced the proportion of FITC-Dextran + Figure 2 3.3. Proliferation of DC-Enhanced T Cells Treated with GUPS-AuNP The role of DCs in T cell activation was evaluated using a mixed lymphocyte reaction (MLR) assay ( Figure 3 + + + + + + Figure 3 3.4. GUPS-AuNP Enhances DC Capture of FITC-OVA and Prolongs GUPS-AuNP/FITC-OVA Co-Localization with Lysosomes DCs are widely recognized as the most potent antigen-presenting cells in the body. To explore the interaction between DCs and antigens, we employed FITC-OVA as a model antigen to evaluate the impact of GUPS-AuNP on the antigen capture ability of DCs. Initially, we investigated the protein-binding properties of GUPS-AuNP. To prepare the GUPS-AuNP/FITC-OVA complex, GUPS-AuNP and FITC-OVA were incubated under dark conditions for 6, 12, and 24 h. The results from UV spectrophotometry and BCA protein quantification revealed that GUPS-AuNP demonstrated optimal binding with FITC-OVA at 6 h, achieving a binding efficiency of 17.5%. By incubating GUPS-AuNP/FITC-OVA with DCs for varying durations, we observed a time-dependent increase in the internalization of GUPS-AuNP/FITC-OVA by DCs, with the fluorescence intensity reaching its peak at 12 h ( Figure 4 Figure 4 To better assess the ability of GUPS-AuNP to enhance antigen capture by DCs, we performed confocal laser scanning microscopy (CLSM) at various incubation intervals. After 1 h of incubation, green fluorescence representing antigen entry into the cells became visible, as illustrated in the figure. The fluorescence intensity increased proportionally with the amount of antigen taken up by the DCs, a result further validated through flow cytometry analysis. These findings clearly demonstrate that GUPS-AuNP substantially enhances the efficiency of antigen capture by DCs. In our previous studies, we demonstrated that GUPS-AuNP significantly enhances the antigen-capturing ability of DCs. To further explore the intracellular distribution of captured antigens, we varied the incubation times, stained lysosomes using Lyso-Tracker Red, and analyzed the co-localization of GUPS-AuNP/FITC-OVA with lysosomes. CLSM revealed that GUPS-AuNP/FITC-OVA co-localized with lysosomes only after 6 h. This observation suggests that GUPS-AuNP/FITC-OVA does not rapidly enter lysosomes for degradation but instead extends its retention within the cells, thereby promoting antigen cross-presentation ( Figure 4 3.5. GUPS-AuNP-DC + HPV Inhibits Tumor Growth To assess the antitumor efficacy of the HPV-DC vaccine using GUPS-AuNP as a carrier, we established a TC-1 mouse tumor model ( Figure 5 Figure 5 Figure 5 + + + + + + + Figure 5 + + Figure 5 To assess the specific immune response triggered by the vaccine, we stimulated spleen cells from each group in vitro with the HPV E7 peptide for 10 h and analyzed the proportions of CD4 + + + + Figure 5 4. Discussion With advancements in nanotechnology, nanomaterials have found widespread applications across diverse fields, such as biological carriers, disease diagnosis, and food safety inspection. Among the various nanomaterials, AuNPs stand out due to their relatively straightforward synthesis process, ease of functionalization, and remarkable chemical and physical properties. These attributes enable AuNPs to play pivotal roles in drug delivery, photothermal therapy, and biosensing [ 16 17 18 19 20 21 22 23 3+ 24 Polysaccharide-based gold nanomaterials present numerous advantages, such as enhanced immune response activation and prolonged in vivo retention, making them extensively applied in the biological sciences [ 25 26 27 DCs, as professional antigen-presenting cells (APCs), play a pivotal role in initiating antigen-specific T cell responses. DC-based cancer vaccines have attracted considerable interest from researchers and hold immense potential in advancing tumor immunotherapy [ 28 29 30 31 Tumor antigens exist in various forms, including peptides, nucleic acids, proteins, and tumor lysates, each of which directly influences the specificity and intensity of immune responses induced by vaccines. Nucleic acid antigens (RNA or DNA) enter host cells via mechanisms such as membrane permeability, endocytosis, or membrane fusion. Once inside, they are expressed using the host’s cellular machinery, primarily activating CD8 T cell responses as endogenous antigens. However, their use is limited due to issues such as poor stability, susceptibility to degradation, and low immunogenicity [ 32 33 34 35 36 5. Conclusions In summary, this study utilized GUPS as a reducing agent to synthesize GUPS-AuNPs, which significantly promoted the maturation and functionality of DCs. This method enhanced DCs’ ability to capture OVA protein and extended the intracellular retention time of the protein, thereby facilitating efficient cross-presentation of the antigen. Moreover, the HPV DC vaccine formulated with GUPS-AuNPs as a carrier triggered a robust antitumor immune response in vivo. Although GUPS-AuNPs effectively enhance immune responses, several limitations remain. Their bioavailability and in vivo stability require optimization to improve clinical applicability. Nanoparticle size and surface modifications also influence immune cell interactions and antigen delivery efficiency. Future studies should focus on three key areas: refining GUPS-AuNP synthesis methods to optimize the particle size and surface properties for enhanced stability and biodistribution; investigating synergistic effects with other immunopotentiators or therapies to boost immune activity; and assessing long-term efficacy and safety in preclinical models to support clinical translation. These optimizations could establish GUPS-AuNPs as a safer, more efficient platform for tumor immunotherapy and vaccine development. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/pharmaceutics17091213/s1 a b c d e p p p p Author Contributions Y.Z.: writing—original draft, conceptualization, data curation, formal analysis, methodology, validation. M.S.: writing—original draft, conceptualization, data curation, formal analysis, methodology, validation. Y.D.: writing—review and editing, validation, supervision. S.C.: writing—original draft, conceptualization, visualization. R.M.: investigation, software. P.A.: writing—review and editing, conceptualization. J.L.: writing—review and editing, methodology, validation, funding acquisition. L.H.: validation, supervision, funding acquisition, conceptualization. A.A.: writing—review and editing, validation, supervision, funding acquisition, conceptualization. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in the study are included in the article/ Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: HPV Human papillomavirus GUPS Glycyrrhiza polysaccharide DC Dendritic cell GUPS-AuNP Glycyrrhiza polysaccharide gold nanoparticles AuNP Gold nanoparticles FTIR Fourier transform infrared DLS Dynamic light scattering PDI Polydispersity index MLR Mixed lymphocyte reaction CLSM Confocal laser scanning microscopy GLP-Au Ganoderma lucidum polysaccharide gold nanoparticles APCs Antigen-presenting cells OVA Ovalbumin References 1. Abu-Rustum N.R. Yashar C.M. Arend R. Barber E. Bradley K. Brooks R. Campos S.M. Chino J. Chon H.S. Crispens M.A. NCCN Guidelines ® J. Natl. Compr. Canc. Netw. 2023 21 1224 1233 10.6004/jnccn.2023.0062 38081139 2. Murthy S.S. Trapani D. Cao B. Bray F. Murthy S. Kingham T.P. Are C. Ilbawi A.M. Premature mortality trends in 183 countries by cancer type, sex, WHO region, and World Bank income level in 2000-19: A retrospective, cross-sectional, population-based study Lancet Oncol. 2024 25 969 978 10.1016/S1470-2045(24)00274-2 38964357 PMC11329430 3. Okunade K. Human papillomavirus and cervical cancer J. Obstet. Gynaecol. 2019 40 602 608 10.1080/01443615.2019.1634030 31500479 PMC7062568 4. Mo Y. Ma J. Zhang H. Shen J. Chen J. Hong J. Xu Y. Qian C. Prophylactic and Therapeutic HPV Vaccines: Current Scenario and Perspectives Front. Cell Infect. Microbiol. 2022 12 909223 10.3389/fcimb.2022.909223 35860379 PMC9289603 5. Lu Y. Shi Y. Liu Y. Luo Z. Zhang J. Jiang M. Li X. Liu X. Guo X. Qin B. A therapeutic DC vaccine with maintained immunological activity exhibits robust anti-tumor efficacy J. Control. Release 2022 349 254 268 10.1016/j.jconrel.2022.06.059 35803328 6. Li M. Zhou H. Jiang W. Yang C. Wang Y. Nanovaccines integrating endogenous antigens and pathogenic adjuvants elicit potent antitumor immunity Nano Today 2020 35 101007 10.1016/j.nantod.2020.101007 7. Kikete S. Luo L. Jia B. Wang L. Ondieki G. Bian Y. Plant-derived polysaccharides activate dendritic cell-based anti-cancer immunity Cytotechnology 2018 70 1097 1110 10.1007/s10616-018-0202-z 29556897 PMC6081929 8. Xiong H. Han X. Cai L. Zheng H. Natural polysaccharides exert anti-tumor effects as dendritic cell immune enhancers Front. Oncol. 2023 13 1274048 10.3389/fonc.2023.1274048 37876967 PMC10593453 9. Cai S. Aipire A. Aimaier A. Chen Q. Li Y. Li J. Glycyrrhiza uralensis Chin. J. Microbiol. Immunol. 2018 38 774 781 10.3760/cma.j.issn.0254-5101.2018.10.010 10. Yoshino S. Nishikawa K. Morita S. Takahashi T. Sakata K. Nagao J. Nemoto H. Murakami N. Matsuda T. Hasegawa H. Randomised phase III study of S-1 alone versus S-1 plus lentinan for unresectable or recurrent gastric cancer (JFMC36-0701) Eur. J. Cancer 2016 65 164 171 10.1016/j.ejca.2016.06.012 27501505 11. Fan J. Cheng Y. Nanoparticles S.M.F.G. Properties and Biomedical Applications Chem. Rec. 2020 20 1474 1504 10.1002/tcr.202000087 32970383 12. Facchi D.P. da Cruz J.A. Bonafé E.G. Pereira A.G.B. Fajardo A.R. Venter S.A.S. Monteiro J.P. Muniz E.C. Martins A.F. Polysaccharide-Based Materials Associated with or Coordinated to Gold Nanoparticles: Synthesis and Medical Application Curr. Med. Chem. 2017 24 2701 2735 10.2174/0929867324666170309123351 28294043 13. MM E.-H. Arias J.L. Recent advances in the surface functionalization of PLGAbased nanomedicines Nanomaterials 2022 12 354 10.3390/nano12030354 35159698 PMC8840194 14. Guo X. Zuo X. Zhou Z. Gu Y. Zheng H. Wang X. Wang G. Xu C. Wang F. PLGA-Based Micro/Nanoparticles: An Overview of Their Applications in Respiratory Diseases Int. J. Mol. Sci. 2023 24 4333 10.3390/ijms24054333 36901762 PMC10002081 15. Wang M. Huang H. Sun Y. Wang M. Yang Z. Shi Y. Liu L. PEI functionalized cell membrane for tumor targeted and glutathione responsive gene delivery Int. J. Biol. Macromol. 2024 255 128354 10.1016/j.ijbiomac.2023.128354 37995795 16. Amina S.J. Guo B.A. A Review on the Synthesis and Functionalization of Gold Nanoparticles as a Drug Delivery Vehicle Int. J. Nanomedicine. 2020 15 9823 9857 10.2147/IJN.S279094 33324054 PMC7732174 17. Yadav P. Singh S.P. Rengan A.K. Shanavas A. Srivastava R. Gold laced bio-macromolecules for theranostic application Int. J. Biol. Macromol. 2018 110 39 53 10.1016/j.ijbiomac.2017.10.124 29056467 18. Hiramatsu H. Osterloh F.E. A Simple Large-Scale Synthesis of Nearly Monodisperse Gold and Silver Nanoparticles with Adjustable Sizes and with Exchangeable Surfactants Chem. Mater. 2004 16 2509 2511 10.1021/cm049532v 19. Hammami I. Alabdallah N.M. Gold nanoparticles: Synthesis properties and applications J. King Saud. Univ. Sci. 2021 33 101560 10.1016/j.jksus.2021.101560 20. Teimouri M. Khosravi-Nejad F. Attar F. AA S. Kostova I. Benelli G. Falahati M. Gold nanoparticles fabrication by plant extracts: Synthesis, characterization, degradation of 4-nitrophenol from industrial wastewater, and insecticidal activity—A review J. Clean. Prod. 2018 184 740 753 10.1016/j.jclepro.2018.02.268 21. Lee K.X. Shameli K. Yew Y.P. Teow S.Y. Jahangirian H. Rafiee-Moghaddam R. Webster T.J. Recent Developments in the Facile Bio-Synthesis of Gold Nanoparticles (AuNPs) and Their Biomedical Applications Int. J. Nanomed. 2020 15 275 300 10.2147/IJN.S233789 PMC6970630 32021180 22. SS L. Su J. Zhang Y. XW H. XP W. MC H. Li B. Shou D. Benefits and mechanisms of polysaccharides from Chinese medicinal herbs for anti-osteoporosis therapy: A review Int. J. Biol. Macromol. 2021 193 1996 2005 10.1016/j.ijbiomac.2021.11.030 34767882 23. Kang Q. Chen S. Li S. Wang B. Liu X. Hao L. Lu J. Comparison on characterization and antioxidant activity of polysaccharides from Ganoderma lucidum by ultrasound and conventional extraction Int. J. Biol. Macromol. 2019 124 1137 1144 10.1016/j.ijbiomac.2018.11.215 30481533 24. Noruzi M. Zare D. Khoshnevisan K. Davoodi D. Rapid green synthesis of gold nanoparticles using Rosa hybrida petal extract at room temperature Spectrochim. Acta A Mol. Biomol. Spectrosc. 2011 79 1461 1465 10.1016/j.saa.2011.05.001 21616704 25. Liu H. Zhang M. Meng F. Su C. Polysaccharide-based gold nanomaterials: Synthesis mechanism, polysaccharide structure-effect, and anticancer activity Carbohydr. Polym. 2023 321 121284 10.1016/j.carbpol.2023.121284 37739497 26. Zhang S. Pang G. Chen C. Qin J. Yu H. Liu Y. Zhang X. Song Z. Zhao J. Wang F. Effective cancer immunotherapy by Ganoderma lucidum polysaccharide-gold nanocomposites through dendritic cell activation and memory T cell response Carbohydr. Polym. 2019 205 192 202 10.1016/j.carbpol.2018.10.028 30446095 27. Pang G. Zhang S. Zhou X. Yu H. Wu Y. Jiang T. Zhang X. Wang F. Wang Y. Zhang L.W. Immunoactive polysaccharide functionalized gold nanocomposites promote dendritic cell stimulation and antitumor effects Nanomedicine 2019 14 1291 1306 10.2217/nnm-2018-0390 31084395 28. Laureano R.S. Sprooten J. Vanmeerbeerk I. Berneman Z.N. Beuselinck B. Bol K.F. Borst J. Coosemans A. Datsi A. Fučíková J. Trial watch: Dendritic cell (DC)-based immunotherapy for cancer Oncoimmunology 2022 11 2096363 10.1080/2162402X.2022.2096363 35800158 PMC9255073 29. Perez C.R. De Palma M. Engineering dendritic cell vaccines to improve cancer immunotherapy Nat. Commun. 2019 10 5408 10.1038/s41467-019-13368-y 31776331 PMC6881351 30. Zhang Y. Shi J. Ma B. Zhou Y. Yong H. Li J. Kong X. Zhou D. Functionalization of polymers for intracellular protein delivery Prog. Polym. Sci. 2023 146 101751 101766 10.1016/j.progpolymsci.2023.101751 31. Zhang S. Cheng Y. Boronic acid-engineered gold nanoparticles for cytosolic protein delivery Biomater. Sci. 2020 8 3741 3750 10.1039/D0BM00679C 32502228 32. Hartmann G. Chapter Four-Nucleic Acid Immunity Adv. Immunol. 2017 133 121 169 10.1016/bs.ai.2016.11.001 28215278 PMC7112058 33. Chavda V.P. Hossain M.K. Beladiya J. Apostolopoulos V. Nucleic Acid Vaccines for COVID-19: A Paradigm Shift in the Vaccine Development Arena Biologics 2021 1 337 356 10.3390/biologics1030020 34. Lee J. Oldham M.L. Manon V. Chen J. Principles of peptide selection by the transporter associated with antigen processing Proc. Natl. Acad. Sci. USA 2024 121 e2320879121 10.1073/pnas.2320879121 38805290 PMC11161800 35. Dyson H.J. Wright P.E. Antigenic peptides FASEB J. 1995 9 37 42 10.1096/fasebj.9.1.7821757 7821757 36. Al Qaraghuli M.M. Kubiak-Ossowska K. Ferro V.A. Mulheran P.A. Antibody-protein binding and conformational changes: Identifying allosteric signalling pathways to engineer a better effector response Sci. Rep. 2020 10 13696 10.1038/s41598-020-70680-0 32792612 PMC7426963 Figure 1 Physicochemical characterization of GUPS-AuNP: ( a b c d e f g f g Figure 2 GUPS-AuNP induces maturation and promotes DC function: ( a b p c + p p Figure 3 GUPS-AuNP enhanced the function of DCs in promoting T cell proliferation: ( a b + + p p Figure 4 GUPS-AuNP enhances DC capture of antigen and prolongs antigen retention in cells: ( a b c p p p d e Figure 5 In vivo antitumor effects: ( a b c d e + + f g p p p ",
  "metadata": {
    "Title of this paper": "Antibody-protein binding and conformational changes: Identifying allosteric signalling pathways to engineer a better effector response",
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473970/"
  }
}