{
  "title": "Paper_268",
  "abstract": "pmc Dis Esophagus Dis Esophagus 3393 dote dote Diseases of the Esophagus 1120-8694 1442-2050 Oxford University Press PMC12490072 PMC12490072.1 12490072 12490072 40971833 10.1093/dote/doaf068 doaf068 1 Original Article AcademicSubjects/MED00260 Early versus late oral feeding regimens following esophagectomy: a propensity score-matched observational cohort https://orcid.org/0000-0001-5985-0075 Kooij Cezanne D  Department of Surgery, University Medical Center Utrecht Utrecht The Netherlands Conceptualization Formal analysis Methodology Writing - original draft Writing - review & editing Goense Lucas  Department of Surgery, University Medical Center Utrecht Utrecht The Netherlands Conceptualization Formal analysis Methodology Supervision Writing - original draft Writing - review & editing Kingma B Feike  Department of Surgery, University Medical Center Utrecht Utrecht The Netherlands Conceptualization Methodology Supervision Writing - original draft Writing - review & editing den Boer Robin B  Department of Surgery, University Medical Center Utrecht Utrecht The Netherlands Conceptualization Methodology Writing - review & editing Steenhagen Elles  Department of Dietetics, University Medical Center Utrecht Utrecht The Netherlands Conceptualization Writing - review & editing Ruurda Jelle P  Department of Surgery, University Medical Center Utrecht Utrecht The Netherlands Conceptualization Methodology Supervision Writing - review & editing https://orcid.org/0000-0002-7134-261X van Hillegersberg Richard  Department of Surgery, University Medical Center Utrecht Utrecht The Netherlands Conceptualization Methodology Supervision Writing - review & editing Address correspondence to: Richard van Hillegersberg, University Medical Center Utrecht Department of Surgery, Heidelberglaan 100, 3584CX, Utrecht, The Netherlands. T: +31 (0)88 755 8074. Email: R.vanHillegersberg@umcutrecht.nl 10 2025 18 9 2025 38 5 496026 doaf068 04 3 2025 29 6 2025 29 7 2025 18 09 2025 03 10 2025 03 10 2025 © The Author(s) 2025. Published by Oxford University Press on behalf of the International Society for Diseases of the Esophagus. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract Background The optimal time to resume oral intake after esophagectomy remains debated, with practices varying across centers. Methods This single-center, retrospective cohort study compared early and late oral feeding regimens after esophagectomy. Perioperative care was identical except for the feeding regimen. Early oral feeding began immediately post-surgery, while late oral feeding started on postoperative day 4 after swallow examination, with jejunostomy for early enteral tube feeding. Propensity score matching was used to reduce confounding. The primary outcome was overall survival. Secondary outcomes included complications, need for an alternative feeding route, hospital stay, readmission, and 90-day mortality. Results Between May 2017 and October 2023, 406 patients underwent an esophagectomy (312 transthoracic; 94 transhiatal). After matching, 139 patients were included in both the early and late oral feeding groups. Overall complication rates did not significantly differ (84.9% vs. 77.7%; P P P P P P Conclusions Early and late oral feeding showed similar survival rates, but late oral feeding was associated with fewer severe complications, lower anastomotic leakage, and shorter hospital stay. Therefore, despite no survival difference, late oral feeding with jejunal feeding may lead to better postoperative outcomes. esophagectomy nutrition survival pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Esophageal cancer is the seventh most common cancer worldwide, and the sixth leading cause of cancer-related mortality, with the majority of patients being diagnosed at an advanced stage. 1 2 In esophageal cancer surgery, the postoperative feeding strategy is still topic of debate. While the importance of adequate feeding is widely acknowledged in order to optimize recovery, there is no clear consensus in literature concerning the timing of oral feeding and the methods of nutritional support. 3 4 5 6 7 Consequently, the optimal timing for resuming oral feeding after esophagectomy remains uncertain, with practices varying across centers. To address this, the present study evaluates postoperative outcomes in matched cohorts of patients following either early or late oral feeding regimens, with a primary focus on the potential impact on long-term survival. Additionally, this study examines the association between feeding strategy and short-term outcomes including overall complications, complication severity, anastomotic leakage, need for an alternative feeding route, hospital, and intensive care unit (ICU) stay, readmission, and 90-day mortality. METHODS Study design and population This observational retrospective cohort study included patients who underwent esophagectomy for esophageal cancer at the University Medical Center Utrecht, between May 2017 and October 2023. Procedures included transhiatal or transthoracic esophagectomy with gastric conduit reconstruction using an intrathoracic or cervical hand-sewn end-to-side anastomosis, which was the standard anastomotic technique in our center during the study period. Patients were excluded in case of absence of a gastric conduit, or if a stapled anastomosis and/or side-to-side or end-to-end approach was used, in order to reduce potential confounding and ensure a homogeneous study population with regard to surgical technique. Data were extracted from a prospectively maintained database. The institutional review board approved this study, and the requirement for informed consent was waived. Feeding regimens The oral feeding regimen is part of the ERAS protocol. From May 2017 to February 2019, patients routinely followed an early oral feeding regimen, beginning oral intake immediately after surgery. On postoperative day (POD) 0 patients received a popsicle; on POD1–3, they were given a clear liquid diet and on POD4, they could expand to a full liquid diet, both including oral nutritional supplements. No formal assessment of gastric conduit emptying or swallowing function was performed prior to initiation of oral intake. Jejunostomy placement was not routinely performed during esophagectomy and was reserved for patients with poor preoperative nutritional status, defined as >10% weight loss within six months or >5% weight loss within a month. Patients were ideally discharged on oral feeding alone (full liquid diet for 2 weeks, followed by further expansion in consultation with a dietitian), although additional enteral tube feeding was provided if a jejunostomy had been placed. Although no uniform definition exists and the literature varies on what constitutes early oral feeding, our regimen aligns with what is generally considered early oral feeding. 8 In March 2019, the protocol was revised to a late oral feeding regimen due to an increased incidence of delayed gastric emptying (10%) and 40% of patients needed an alternative feeding route due to lack of oral caloric intake. Under the revised protocol, patients routinely received an intraoperatively placed jejunostomy and enteral tube feeding was started at POD1 and gradually increased if bowel movements had resumed and there were no signs of ileus. Patients were kept nil-by-mouth from POD1–3, with sips of water introduced on POD4, following a satisfactory contrast swallow test. The routine contrast swallow test assessed gastric conduit emptying, as well as swallowing function (aspiration). After a satisfactory contrast swallow test, oral feeding could be increased with liquid diets. Patients were discharged with oral fluid diet for two weeks and maintained enteral tube feeding via the jejunostomy until adequate oral intake was achieved. Outcomes The primary outcome was overall survival, defined as time from surgery to death or last follow-up. Secondary outcomes included postoperative complications, anastomotic leakage (clinically or radiologically, according to the Esophagectomy Complications Consensus Group [ECCG] classification), severity of anastomotic leakage (Clavien-Dindo ≥3a), need for an alternative feeding route (jejunostomy, nasojejunal feeding tube, and PICC line for total parenteral feeding [TPN]), hospital and ICU stay, readmissions, and 90-day mortality. Anastomotic leakage was defined according to the ECCG as a full-thickness gastrointestinal defect involving esophagus, anastomosis, staple line, or conduit, regardless of presentation or method of identification. 9 10 All patient characteristics, peri- and postoperative outcomes were retrieved from a prospectively maintained database, with comprehensive registration of potential complications, including pulmonary, cardiac, urological, thromboembolic, neurological, wound-related, chyle-related, discussed and recorded during a weekly multidisciplinary team (MDT) meeting. The Patient-Generated Subjective Global Assessment (PG-SGA) was used by trained dietitians to determine nutritional status and identify malnutrition two weeks after neoadjuvant therapy. 11 Statistics To minimize the effect of possible confounders, propensity score matching was performed to compare the outcomes between the early and late oral feeding regimens. Possible confounders included gender, age, body mass index, American Society of Anesthesiology (ASA)-score, comorbidities, tumor location, cT-, cN-, and cM-stage, neoadjuvant therapy and surgical approach. Specifically, one-to-one propensity score matching was conducted with nearest-neighbor matching without replacement. The caliper width was adjusted to ensure that the matched cohort achieved standardized mean differences (SMDs) of <10% for all relevant confounders. This adjustment was made with the consideration of maintaining an optimal balance between achieving precise matching and preserving an adequate sample size, thereby avoiding an overly strict caliper that could reduce the number of matched pairs. 12 Table 1 Table 1 Baseline characteristics Entire cohort Matched cohort Early feeding n Late feeding n SMD Early feeding n Late feeding n SMD Gender (male) 113 (78) 196 (75) 0.089 113 (81) 111 (80) 0.036 Age at time of operation in years (mean, SD) 66.1 (±9.1) 65.9 (±8.8) 0.0252 66.0 (±9.0) 66.3 (±9.4) 0.040 BMI in kg/m 2 26.1 (±4.5) 25.5 (±4.6) 0.1175 25.6 (±4.5) 26.1 (±4.4) 0.099 ASA-score   0.382   0.036 Comorbidities       Tumor location       Clinical T-stage   0.102   0.086 Clinical N-stage   0.164   0.000 Clinical M-stage   0.067   0.0000 Neoadjuvant treatment       Approach       Open vs. MIE       Abbreviations: ASA, American Society of Anesthesiology; GEJ, gastro-esophageal junction, MIE, minimally invasive esophagectomy; SMD, standardized mean difference; SD, standard deviation; TH, transhiatal; TT, transthoracic. Analyses were performed according to the intention-to-treat principle. Overall survival was compared between the matched cohorts using Kaplan–Meier curves with log-rank tests. Additionally, a multivariable Cox regression analysis on the full (unmatched) cohort assessed the impact of the feeding regimen, reporting the hazard ratio (HR) with 95% confidence interval (CI) while adjusting for the following confounding factors: age, gender, ASA-score, comorbidity, neoadjuvant therapy, open/MIE, surgical approach, radicality, histology, pT-stage, pN-stage, and severe complications. Categorical data were analyzed with Chi-square tests, continuous data with normal distributions were compared using independent samples t U http://www.R-project.org P RESULTS Between May 2017 and October 2023, 412 patients underwent an esophagectomy. Of these, 6 patients were excluded from the analysis because no gastric conduit was created ( n n n n Table 1 Table 1 Patient and tumor characteristics The matched cohorts ( n n Table 1 n n n n n n n n n n Table 2 P Table 2 Patient-Generated Subjective Global Assessment (PG-SGA) ‡ Early feeding n Late feeding n  P * A—Well nourished 75 (54.0%) 78 (56.1%) 0.753 B—Moderately malnourished/suspected malnutrition 35 (25.2%) 36 (25.9%) C—Severely malnourished 9 (6.5%) 7 (5.0%) Missing 20 (14.4%) 18 (12.9%) Abbreviation: PG-SGA, patient-generated subjective global assessment.  * P U Outcomes In the matched cohorts, the median follow-up was 45 months (IQR 15–64 months) for patients in the early oral feeding group and 16 months (IQR 7–32 months) for patients in the late oral feeding group. The primary outcome measure, overall survival, did not differ between the matched groups, as shown in the Kaplan–Meier curve in Fig. 1 P P Table 3 Figure 1 Kaplan–Meier curves of the overall survival of the early oral feeding and late oral feeding group (log rank P Table 3 Multivariable analysis (Cox regression) on the impact of the feeding regimen and confounding factors on overall survival HR (95% CI)  P * Age Continuous 1.010 (0.992–1.029) 0.285 Gender Male/female 0.959 (0.654–1.407) 0.832 ASA-score ASA1–2/ASA3–4 1.530 (1.108–2.113) 0.010 Comorbidities No/yes 0.981 (0.653–1.473) 0.927 Neoadjuvant therapy No/yes 1.121 (0.690–1.823) 0.654 Open/MIE Open/MIE 1.208 (0.464–3.147) 0.698 Surgical approach Transthoracic/transhiatal 0.913 (0.620–1.344) 0.645 Radicality R0/R1–2 3.268 (2.026–5.271) <0.001 Histology AC/SCC 0.983 (0.664–1.493) 0.983 pT-stage pT0–1/pT2–4 1.755 (1.210–2.546) 0.003 pN-stage pN0/pN+ 2.356 (1.683–3.296) <0.001 Complication≥CD3a No/yes 1.462 (1.070–1.997) 0.017 Feeding regimen Early/late oral feeding 1.020 (0.729–1.427) 0.907 Abbreviations: ASA, American Society of Anesthesiology; AC, adenocarcinoma; CI, confidence interval; CD, Clavien-Dindo; HR, hazard ratio; MIE, minimally invasive esophagectomy; SCC, squamous cell carcinoma.  * P As shown in Table 4 P P P Table 4 Postoperative outcomes Early feeding n Late feeding n  P * Postoperative complication(s)    Complications ≥Clavien-Dindo 3a 68 (48.9%) 51 (36.7%) 0.039 Length of hospital stay (median, IQR) 12 (9–21) 11 (8–15) 0.008 Length of ICU stay (median, IQR) 1 (1–3) 1 (1–2) 0.087 Readmission 23 (16.5%) 25 (18.0%) 0.751 Follow-up    Abbreviations: IQR, interquartile range.  * P t The occurrence of anastomotic leakage was significantly higher in the early oral feeding group ( n n P Table 4 P P Supplementary Table S1 P P  Table 5 n n n n n n n n Table 5 Postoperative feeding routes Early feeding n Late feeding n Jejunostomy during esophagectomy 59 (42.4%) 136 (97.8%) Alternative feeding route 49 (35.3%) 14 (10.1%) Jejunostomy 4 (2.9%) 0 (0.0%) Abbreviations: PICC, peripherally inserted central catheter; TPN, total parenteral nutrition. Among patients with an intraoperative jejunostomy ( n n n n n n n n n n n n DISCUSSION This propensity score-matched observational cohort study showed no differences in overall survival after esophagectomy between patients who followed an early oral feeding regimen and those who followed a late oral feeding regimen. However, late oral feeding was associated with lower rates of severe complications and anastomotic leakage among patients who underwent esophagectomy with intrathoracic anastomosis. Additionally, the length of hospital stay was shorter in the late oral feeding group. Other postoperative outcomes did not show significant differences between the groups. This study used overall survival as the primary outcome to assess the timing of oral intake. This interest arose from a side-study of the NUTRIENT II trial, comparing early ( n n 7 P P P P P P 7 13 Concerns regarding anastomotic leakage has been a major factor in delaying the resumption of oral intake following esophagectomy, given its association with morbidity, extended hospital stay, and increased mortality risk. 8 14 P P While some studies suggest that late oral feeding reduces anastomotic leakage, other evidence indicates that early oral feeding does not increase rates of complications, including anastomotic leakage. 14 , 15 16 Esophageal cancer patients are particularly vulnerable to malnutrition, with over 70% experiencing significant weight loss at diagnosis due to dysphagia and cachexia. 17 17 , 18 18 , 19 16 20 Strengths of this study include its relatively large cohort, a Western-representative esophageal cancer population, and comprehensive data from a prospectively maintained database with weekly MDT-verified complications. However, there are some limitations. Despite being representative, the cohort is heterogeneous. To address this, propensity score matching was performed. Additionally, follow-up varied between groups due to changes in oral feeding protocols over time, with shorter follow-up for late oral feeding. Lastly, temporal bias should be considered, as esophagectomy with intrathoracic anastomosis became routine practice in 2017, likely improving outcomes over time, potentially favoring the late oral feeding cohort. In conclusion, this study found no differences in overall survival between early and late oral feeding cohorts after esophagectomy, suggesting that both approaches are safe with regard to survival. However, late oral feeding with early enteral tube feeding was associated with lower severe complication rates, reduced anastomotic leakage in esophagectomy with intrathoracic anastomosis, and a shorter hospital stay. Other outcomes were similar between groups. These findings indicate that there is no strong evidence to support the need for immediate oral intake resumption. Instead, despite no difference in survival, late oral feeding including routine jejunostomy may be preferable due to its association with better postoperative outcomes and a reduced need for an alternative feeding route. Supplementary Material Early_versus_late_feeding_Supplementary_Material_04032025_doaf068 Specific author contributions: Cezanne Kooij (Conceptualization, Formal analysis, Methodology, Writing—original draft, Writing—review & editing), Lucas Goense (Conceptualization, Formal analysis, Methodology, Supervision, Writing—original draft, Writing—review & editing), B. Feike Feike Kingma (Conceptualization, Methodology, Supervision, Writing—original draft, Writing—review & editing), Robin B. den Boer (Conceptualization, Methodology, Writing—review & editing), Elles Steenhagen (Conceptualization, Writing—review & editing), Jelle P. Ruurda (Conceptualization, Methodology, Supervision, Writing—review & editing), Richard van Hillegersberg (Conceptualization, Methodology, Supervision, Writing—review & editing). Financial support: No funding was requested nor received for the current study. Conflicts of interest: Jelle Ruurda: Consulting/Advisory Role: Intuitive Surgical, Medtronic. Richard van Hillegersberg: Consulting/Advisory Role: Intuitive Surgical, Medtronic, Olympus. The other authors declared no conflicts of interest. References 1. Bray F Ferlay J Soerjomataram I Siegel R L Torre L A Jemal A Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2018 68 394 424 30207593 10.3322/caac.21492 2. Ashok A Niyogi D Ranganathan P et al. The enhanced recovery after surgery (ERAS) protocol to promote recovery following esophageal cancer resection Surg Today 2020 50 323 34 32048046 10.1007/s00595-020-01956-1 PMC7098920 3. Zheng R Devin C L Pucci M J Berger A C Rosato E L Palazzo F Optimal timing and route of nutritional support after esophagectomy: a review of the literature World J Gastroenterol 2019 25 4427 36 31496622 10.3748/wjg.v25.i31.4427 PMC6710171 4. Mei L X Liang G B Dai L Wang Y Y Chen M W Mo J X Early versus the traditional start of oral intake following esophagectomy for esophageal cancer: a systematic review and meta-analysis Support Care Cancer 2022 30 3473 83 35015134 10.1007/s00520-022-06813-0 5. Lewis S J Andersen H K Thomas S Early enteral nutrition within 24 h of intestinal surgery versus later commencement of feeding: a systematic review and meta-analysis J Gastrointest Surg 2009 13 569 75 18629592 10.1007/s11605-008-0592-x 6. Berkelmans G H K Fransen L F C Dolmans-Zwartjes A C P et al. Direct oral feeding following minimally invasive esophagectomy (NUTRIENT II trial) Ann Surg 2020 271 41 7 31090563 10.1097/SLA.0000000000003278 7. Geraedts T C M Weijs T J Berkelmans G H K et al. Long-term survival associated with direct oral feeding following minimally invasive esophagectomy: results from a randomized controlled trial (NUTRIENT II) Cancers (Basel) 2023 15 4856 37835550 10.3390/cancers15194856 PMC10571988 8. Berkelmans G H van Workum F Weijs T J et al. The feeding route after esophagectomy: a review of literature J Thorac Dis 2017 9 S785 91 28815075 10.21037/jtd.2017.03.152 PMC5538990 9. Low D E Alderson D Cecconello I et al. International consensus on standardization of data collection for complications associated with esophagectomy Ann Surg 2015 262 286 94 25607756 10.1097/SLA.0000000000001098 10. de Groot E M Bronzwaer S F C Goense L et al. Management of anastomotic leakage after robot-assisted minimally invasive esophagectomy with an intrathoracic anastomosis Dis Esophagus 2023 36 10.1093/dote/doac094 PMC10226267 36636758 11. Yin L Cheng N Chen P et al. Association of Malnutrition, as defined by the PG-SGA, ESPEN 2015, and GLIM criteria, with complications in esophageal cancer patients after esophagectomy Front Nutr 2021 8 10.3389/fnut.2021.632546 PMC8107390 33981719 12. Austin P C Assessing balance in measured baseline covariates when using many-to-one matching on the propensity-score Pharmacoepidemiol Drug Saf 2008 17 1218 25 18972455 10.1002/pds.1674 13. Berkelmans G H K Fransen L Weijs T J et al. The long-term effects of early oral feeding following minimal invasive esophagectomy Dis Esophagus 2018 31 10.1093/dote/dox114 29025081 14. Speicher J E Gunn T M Rossi N P Iannettoni M D Delay in oral feeding is associated with a decrease in anastomotic leak following transhiatal esophagectomy Semin Thorac Cardiovasc Surg 2018 30 476 84 30189260 10.1053/j.semtcvs.2018.08.004 15. Li X Yan S Ma Y et al. Impact of early oral feeding on anastomotic leakage rate after esophagectomy: a systematic review and meta-analysis World J Surg 2020 44 2709 18 32227277 10.1007/s00268-020-05489-z 16. Johnson S Ziegler J August D A Timing of oral intake after esophagectomy: a narrative review of the literature and case report Nutr Clin Pract 2022 37 536 54 34608676 10.1002/ncp.10777 17. Riccardi D Allen K Nutritional management of patients with esophageal and esophagogastric junction cancer Cancer Control 1999 6 64 72 10758536 10.1177/107327489900600106 18. Jordan T Mastnak D M Palamar N Kozjek N R Nutritional therapy for patients with esophageal cancer Nutr Cancer 2018 70 23 9 29016197 10.1080/01635581.2017.1374417 19. Kingma B F Steenhagen E Ruurda J P van Hillegersberg R Nutritional aspects of enhanced recovery after esophagectomy with gastric conduit reconstruction J Surg Oncol 2017 116 623 9 28968919 10.1002/jso.24827 20. Visser M R Straatman J Voeten D M et al. Hospital variation in feeding jejunostomy policy for minimally invasive esophagectomy: a nationwide cohort study Nutrients. 2022 15 154 36615812 10.3390/nu15010154 PMC9823823 ",
  "metadata": {
    "Title of this paper": "Hospital variation in feeding jejunostomy policy for minimally invasive esophagectomy: a nationwide cohort study",
    "Journal it was published in:": "Diseases of the Esophagus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490072/"
  }
}