{
  "title": "Paper_765",
  "abstract": "pmc Antioxidants (Basel) Antioxidants (Basel) 2840 antiox antioxidants Antioxidants 2076-3921 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12466652 PMC12466652.1 12466652 12466652 41009011 10.3390/antiox14091107 antioxidants-14-01107 1 Article Association Between Blood Free Fatty Acid Concentrations in Midlife and Cerebral Small Vessel Disease Nukata Ryotaro Formal analysis Investigation Writing – original draft 1 https://orcid.org/0000-0002-1495-4433 Hattori Yorito Conceptualization Writing – review & editing Funding acquisition 1 2 * https://orcid.org/0000-0003-2690-4318 Noda Kotaro Investigation 1 3 https://orcid.org/0000-0003-3178-8171 Yoshimoto Takeshi Investigation 1 4 https://orcid.org/0000-0002-7102-4048 Ihara Masafumi Supervision 1 Napolitano Alessandra Academic Editor 1 2 3 4 * yoh2019@ncvc.go.jp 12 9 2025 9 2025 14 9 497608 1107 11 8 2025 31 8 2025 09 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Free fatty acids (FFAs) are a risk factor for recurrent ischemic stroke, primarily via the overproduction of reactive oxygen species. However, the association between FFA concentrations and cerebral small vessel disease (SVD), including lacunes, cerebral microbleeds, and white matter lesions on brain magnetic resonance imaging, remains unclear. This study included 95 patients with acute ischemic stroke (median age: 59 [interquartile range: 49–73] years). The patients were divided into two groups: those aged ≤59 years (midlife patients) and those aged ≥60 years (late-life patients). In the midlife patients, the low serum total FFA concentration was an independent risk factor of lacunes (adjusted odds ratio [aOR]: 0.82, 95% confidence interval [CI]: 0.69–0.96; p p p free fatty acid cerebral small vessel disease lacune cerebral microbleeds Suzuken Memorial Foundation Takeda Medial Research Foundation (Y.H.) This study was supported by Suzuken Memorial Foundation and Takeda Medial Research Foundation (Y.H.). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Free fatty acids (FFAs), which are unesterified fatty acids, are present in systemic circulation and produced via the lipolysis of triglycerides in the adipose tissue. FFAs represent an important energy source for organs such as the heart, skeletal muscle, and liver; however, excessive FFA accumulation in non-adipose tissues disrupts multiple metabolic pathways, a process termed lipotoxicity [ 1 2 3 4 5 6 7 8 9 10 In metabolic diseases, FFAs play a crucial role in the development of type 2 diabetes [ 8 9 10 11 12 13 l 14 15 10 In particular, FFAs are known to contribute to vascular endothelial dysfunction by promoting oxidative stress and inflammation [ 16 17 2 3 4 5 6 7 16 17 5 7 18 19 20 In ischemic stroke, elevated blood FFA concentrations were an independent predictor of recurrent ischemic stroke, poor 90-day functional outcome, and mortality [ 21 22 23 24 Cerebral small vessel disease (SVD), commonly associated with aging, is often asymptomatic. However, it carries a high risk of symptomatic lacunar ischemic or hemorrhagic stroke due to cerebral microcirculation impairment [ 25 26 27 28 29 30 25 31 32 31 33 34 35 36 2. Materials and Methods 2.1. Study Design This cross-sectional observational study was conducted at the National Cerebral Cardiovascular Center (NCVC) in Japan. It was carried out in accordance with the Declaration of Helsinki and was approved by the Research Ethics Committee of NCVC (approval number: M29-003 and R20113 2.2. Measurement of FFA Concentrations Fasting blood samples were collected during hospitalization, and serum total FFA and each FFA fraction level were measured using gas chromatography-mass spectrometry (Shimadzu Techno-Research, Kyoto, Japan). The FFA fractions included free C12:0, C14:0, C16:0, C16:1, C18:0, C18:1n9c, C18:2n6c, C18:3n3, C20:1n9, C20:2n6, C20:3n6, C20:4n6, C20:5n3, and C22:6n3. 2.3. Clinical Characteristics of the Participants Ischemic stroke was diagnosed based on the presence of cardioembolic stroke, large-artery atherosclerosis, small-vessel occlusion, and stroke of other determined etiologies based on Trial of Org 10172 in Acute Stroke Treatment [ 37 2 2.4. Brain MRI Findings During hospitalization, brain MRI examinations were performed on all patients using 3.0-Tesla scanners (Verio, Vida or Spectra: Siemens, Erlangen, Germany; Premier: GE, Boston, MA, USA; Elition: Philips, Amsterdam, The Netherlands) at the NCVC. SVD findings, such as lacunes, CMBs, and WMHs, including periventricular hyperintensities (PVHs), and deep and subcortical white matter hyperintensities (DSWMHs) were assessed on brain MRI. Lacune was defined as an ovoid, subcortical, fluid-filled cavity, with a diameter of 3–15 mm on fluid-attenuated inversion recovery imaging [ 10 38 10 39 2.5. Statistical Analysis Continuous variables were presented as median and interquartile range (IQR), and categorical variables were expressed as frequencies with percentages. The chi-square test was used to assess differences in categorical variables. Meanwhile, the Mann–Whitney U test or the t p p 3. Results 3.1. Baseline Characteristics of the Patients Of the patients who provided written informed consent for the NCVC Biobank, 95 underwent measurements for serum FFA concentrations. The median age of the patients was 59 (IQR: 49–73) years. As SVD is frequently associated with aging, as mentioned in the Introduction section, all patients were divided into two groups: patients aged ≤59 (IQR: 42.5–55) years (midlife patients) and those aged ≥60 (IQR: 67–77) years (late-life patients). The midlife patients had a significantly higher body mass index (24.4 vs. 22.2; p p p p p Table 1 3.2. Inverse Association Between the Total Serum FFA Concentrations and SVD in the Midlife Patients The late-life patients had a higher prevalence of SVD findings on brain MRI, including lacunes, CMBs, and WMHs, than the midlife patients, which is consistent with previous reports ( Table 2 p p Figure 1 Figure 1 p p Figure 2 p p p Figure 3 Table 3 Next, serum total FFA concentrations were analyzed according to sex and age. We separated the patients into four groups: midlife men ( n n n n p Figure 4 p Figure 5 p Figure 4 p Figure 5 Figure 4 Figure 5 Figure 6 Figure 7 Among the FFA fractions, the serum free C14:0 ( p p Figure 8 p p Figure 8 Table 4 4. Discussion The main and unexpected finding of this study was that the low serum total FFA concentrations were significantly associated with the presence of lacunes in the midlife patients. However, the late-life patients did not present with such an association. Our results indicated that low serum total FFA concentrations during the midlife period contribute to the development of SVD. Thus far, only high blood FFA concentrations have been considered a strong risk factor of metabolic syndrome, such as type 2 diabetes [ 8 3 4 21 40 41 42 42 43 44 45 46 47 1–42 1–42 48 49 RNF213 50 Contrarily, the serum total FFA concentration was not significantly different between late-life patients with and without SVD findings on brain MRI in this study. Several factors may account for these findings. First, SVD primarily develops as a consequence of long-term cumulative exposures, such as midlife hypertension [ 41 42 Figure 3 Our study specifically showed that the serum C14:0 and C18:3n3 concentrations were significantly lower in the midlife patients presenting with lacunes. Focusing on oxidative stress, C14:0 (myristic acid), a free fatty acid highly abundant in copra/palmist oils, is a predictor of nonalcoholic steatohepatitis, and it stimulates ceramide synthesis [ 51 52 53 53 54 55 Lacunes and deep CMBs as neuroradiological findings on brain MRI are basically asymptomatic lesions. However, they are recognized as predictors of ischemic stroke and intracerebral hemorrhage [ 56 57 58 Despite its strengths, the current study has several limitations. First, this was a cross-sectional observational study. Thus, a longitudinal prospective study should be performed to establish a causal association between blood FFA concentrations and the development or exacerbation of SVD. Second, brain MRI was performed during the acute phase of ischemic stroke. Therefore, there could be mixed asymptomatic SVD findings with acute findings of ischemic stroke on brain MRI. Third, we did not assess insulin resistance and collect data on dietary patterns, which could affect blood FFA concentrations. For instance, some patients might have been taking fish oil supplements, which can increase the levels of certain fatty acids, prior to admission. Fourth, this observational study was conducted at a single institution in Japan, and the generalizability of the findings to other populations and ethnicities is limited. Finally, the sample size of this study might have been insufficient because the measurement of serum FFAs levels is costly (USD 355 per sample). Therefore, this study should be considered exploratory. To enhance statistical power and validity, future studies should include a larger cohort. 5. Conclusions Low blood FFA concentrations in midlife could be a novel “nonvascular,” nonatheromatous risk factor of SVD, including the presence of lacunes detected on brain MRI. Nevertheless, more studies should be performed to validate these findings and the role of FFA on SVD. Acknowledgments We want to thank Natsuki Hanada for preparing the serum samples. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, Y.H. and M.I.; Methodology, Y.H.; Formal analysis, R.N. and K.N.; Investigation, R.N., K.N. and T.Y.; Data curation, R.N., K.N. and T.Y.; Writing—original draft preparation, R.N.; Writing—review and editing, Y.H. and M.I.; Supervision, M.I.; Funding acquisition, Y.H. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The current study was conducted in accordance with the Declaration of Helsinki and approved by the Research Ethics Committee of the National Cerebral and Cardiovascular Center (approval number: M29-003, approval date: 26 May 2017; R20113 Informed Consent Statement Informed consent for the NCVC Biobank was obtained from all participants involved in the current study. Data Availability Statement The data supporting the findings of this study are available upon request from the corresponding author. The data are not publicly available due to privacy or ethical restrictions. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: AD Alzheimer’s disease aOR Adjusted odds ratio CI Confidence interval CMBs Cerebral microbleeds DSWMH Deep subcortical white matter hyperintensity FFA Free fatty acid IQR Interquartile range MASH Metabolic dysfunction-associated steatohepatitis MRI Magnetic resonance imaging NADPH Nicotinamide adenine dinucleotide phosphate NCVC National Cerebral and Cardiovascular Center PVH Periventricular hyperintensity ROS Reactive oxygen species RVOT-ACT Right ventricular outflow tract acceleration time SVD Cerebral small vessel disease WMHs White matter hyperintensities References 1. Yazici D. Sezer H. Insulin Resistance, Obesity and Lipotoxicity Obesity and Lipotoxicity Advances in Experimental Medicine and Biology Engin A.B. Engin A. Springer Cham, Switzerland 2017 Volume 960 277 304 10.1007/978-3-319-48382-5_12 28585204 2. Opie L.H. The metabolic vicious cycle in heart failure Lancet 2004 364 1733 1734 10.1016/S0140-6736(04)17412-6 15541431 3. Zhang H.W. Zhao X. Guo Y.L. Zhu C.G. Wu N.Q. Sun J. Liu G. Dong Q. Li J.J. Free fatty acids and cardiovascular outcome: A Chinese cohort study on stable coronary artery disease Nutr. Metab. 2017 14 41 10.1186/s12986-017-0195-1 PMC5485743 28674554 4. Pilz S. Scharnagl H. Tiran B. Seelhorst U. Wellnitz B. Boehm B.O. Schaefer J.R. Marz W. Free fatty acids are independently associated with all-cause and cardiovascular mortality in subjects with coronary artery disease J. Clin. Endocrinol. Metab. 2006 91 2542 2547 10.1210/jc.2006-0195 16595593 5. Yuan D. Xu N. Song Y. Zhang Z. Xu J. Liu Z. Tang X. Han Y. Chen Y. Zhang Y. Association Between Free Fatty Acids and Cardiometabolic Risk in Coronary Artery Disease: Results from the PROMISE Study J. Clin. Endocrinol. Metab. 2023 109 125 134 10.1210/clinem/dgad416 37540767 6. Gruzdeva O. Uchasova E. Dyleva Y. Belik E. Karetnikova V. Shilov A. Barbarash O. Multivessel coronary artery disease, free fatty acids, oxidized LDL and its antibody in myocardial infarction Lipids Health Dis. 2014 13 111 10.1186/1476-511X-13-111 25008008 PMC4098672 7. Djoussé L. Benkeser D. Arnold A. Kizer J.R. Zieman S.J. Lemaitre R.N. Tracy R.P. Gottdiener J.S. Mozaffarian D. Siscovick D.S. Plasma free fatty acids and risk of heart failure: The Cardiovascular Health Study Circ. Heart Fail. 2013 6 964 969 10.1161/CIRCHEARTFAILURE.113.000521 23926204 PMC3884584 8. Bays H. Mandarino L. DeFronzo R.A. Role of the adipocyte, free fatty acids, and ectopic fat in pathogenesis of type 2 diabetes mellitus: Peroxisomal proliferator-activated receptor agonists provide a rational therapeutic approach J. Clin. Endocrinol. Metab. 2004 89 463 478 10.1210/jc.2003-030723 14764748 9. Geng Y.N. Faber K.N. de Meijer V.E. Blokzijl H. Moshage H. How does hepatic lipid accumulation lead to lipotoxicity in non-alcoholic fatty liver disease? Hepatol. Int. 2021 15 21 35 10.1007/s12072-020-10121-2 33548031 PMC7886759 10. Shiota G. Tsuchiya H. Pathophysiology of NASH: Insulin resistance, free fatty acids and oxidative stress J. Clin. Biochem. Nutr. 2006 38 127 132 10.3164/jcbn.38.127 11. Ahmed B. Sultana R. Greene M.W. Adipose tissue and insulin resistance in obese Biomed. Pharmacother. 2021 137 111315 10.1016/j.biopha.2021.111315 33561645 12. Sato Y. Fujimoto S. Mukai E. Sato H. Tahara Y. Ogura K. Yamano G. Ogura M. Nagashima K. Inagaki N. Palmitate induces reactive oxygen species production and β-cell dysfunction by activating nicotinamide adenine dinucleotide phosphate oxidase through Src signaling J. Diabetes Investig. 2014 5 19 26 10.1111/jdi.12124 PMC4025235 24843732 13. Ly L.D. Xu S. Choi S.K. Ha C.M. Thoudam T. Cha S.K. Wiederkehr A. Wollheim C.B. Lee I.K. Park K.S. Oxidative stress and calcium dysregulation by palmitate in type 2 diabetes Exp. Mol. Med. 2017 49 e291 10.1038/emm.2016.157 28154371 PMC5336562 14. Pereira S. Shah A. George Fantus I. Joseph J.W. Giacca A. Effect of N-acetyl-l-cysteine on insulin resistance caused by prolonged free fatty acid elevation J. Endocrinol. 2015 225 1 7 10.1530/JOE-14-0676 25609734 15. Straub L.G. Efthymiou V. Grandl G. Balaz M. Challa T.D. Truscello L. Horvath C. Moser C. Rachamin Y. Arnold M. Antioxidants protect against diabetes by improving glucose homeostasis in mouse models of inducible insulin resistance and obesity Diabetologia 2019 62 2094 2105 10.1007/s00125-019-4937-7 31309261 PMC6805816 16. Inoguchi T. Li P. Umeda F. Yu H.Y. Kakimoto M. Imamura M. Aoki T. Etoh T. Hashimoto T. Naruse M. High glucose level and free fatty acid stimulate reactive oxygen species production through protein kinase C—Dependent activation of NAD(P)H oxidase in cultured vascular cells Diabetes 2000 49 1939 1945 10.2337/diabetes.49.11.1939 11078463 17. Maloney E. Sweet I.R. Hockenbery D.M. Pham M. Rizzo N.O. Tateya S. Handa P. Schwartz M.W. Kim F. Activation of NF-kappaB by palmitate in endothelial cells: A key role for NADPH oxidase-derived superoxide in response to TLR4 activation Arterioscler. Thromb. Vasc. Biol. 2009 29 1370 1375 10.1161/ATVBAHA.109.188813 19542021 PMC2775080 18. Borlaug B.A. Jensen M.D. Kitzman D.W. Lam C.S.P. Obokata M. Rider O.J. Obesity and heart failure with preserved ejection fraction: New insights and pathophysiological targets Cardiovasc. Res. 2023 118 3434 3450 10.1093/cvr/cvac120 35880317 PMC10202444 19. Pfenniger A. Yoo S. Arora R. Oxidative stress and atrial fibrillation J. Mol. Cell. Cardiol. 2024 196 141 151 10.1016/j.yjmcc.2024.09.011 39307416 PMC12266930 20. Sridhar A. DeSantiago J. Chen H. Pavel M.A. Ly O. Owais A. Barney M. Jousma J. Nukala S.B. Abdelhady K. Modulation of NOX 2 J. Clin. Investig. 2024 134 e175447 10.1172/JCI175447 39146015 PMC11405042 21. Niu Z. Hu H. Tang F. High Free Fatty Acid Levels Are Associated with Stroke Recurrence and Poor Functional Outcome in Chinese Patients with Ischemic Stroke J. Nutr. Health Aging 2017 21 1102 1106 10.1007/s12603-016-0852-5 29188867 22. Taniguchi A. Sakai M. Teramura S. Fukushima M. Hama K. Marumoto K. Nezumi N. Yoshida T. Nagasaka S. Hayashi R. Serum nonesterified fatty acids are related with carotid atherosclerotic plaque in nonobese nonhypertensive Japanese type 2 diabetic patients Diabetes Care 2001 24 1505 1507 10.2337/diacare.24.8.1505 11473101 23. Choi J.Y. Kim J.S. Kim J.H. Oh K. Koh S.B. Seo W.K. High free fatty acid level is associated with recurrent stroke in cardioembolic stroke patients Neurology 2014 82 1142 1148 10.1212/WNL.0000000000000264 24587477 24. Seo W.K. Jung J.M. Kim J.H. Koh S.B. Bang O.Y. Oh K. Free Fatty Acid Is Associated with Thrombogenicity in Cardioembolic Stroke Cerebrovasc. Dis. 2017 44 160 168 10.1159/000478895 28715812 25. Wardlaw J.M. Smith C. Dichgans M. Small vessel disease: Mechanisms and clinical implications Lancet Neurol. 2019 18 684 696 10.1016/S1474-4422(19)30079-1 31097385 26. Wardlaw J.M. Smith E.E. Biessels G.J. Cordonnier C. Fazekas F. Frayne R. Lindley R.I. O’Brien J.T. Barkhof F. Benavente O.R. Neuroimaging standards for research into small vessel disease and its contribution to ageing and neurodegeneration Lancet Neurol. 2013 12 822 838 10.1016/S1474-4422(13)70124-8 23867200 PMC3714437 27. Das A. Baidya R. Chakraborty T. Samanta A.K. Roy S. Pharmacological basis and new insights of taxifolin: A comprehensive review Biomed. Pharmacother. 2021 142 112004 10.1016/j.biopha.2021.112004 34388527 28. Clancy U. Gilmartin D. Jochems A.C.C. Knox L. Doubal F.N. Wardlaw J.M. Neuropsychiatric symptoms associated with cerebral small vessel disease: A systematic review and meta-analysis Lancet Psychiatry 2021 8 225 236 10.1016/S2215-0366(20)30431-4 33539776 29. Duering M. Biessels G.J. Brodtmann A. Chen C. Cordonnier C. de Leeuw F.E. Debette S. Frayne R. Jouvent E. Rost N.S. Neuroimaging standards for research into small vessel disease-advances since 2013 Lancet Neurol. 2023 22 602 618 10.1016/S1474-4422(23)00131-X 37236211 30. Duering M. Biessels G.J. Brodtmann A. Correction to Lancet Neurol 2023; 22: 602-18 Lancet Neurol. 2023 22 e10 10.1016/s1474-4422(23)00279-x 31. Kremer R. Williams A. Wardlaw J. Endothelial cells as key players in cerebral small vessel disease Nat. Rev. Neurosci. 2025 26 179 188 10.1038/s41583-024-00892-0 39743557 32. De Silva T.M. Miller A.A. Cerebral Small Vessel Disease: Targeting Oxidative Stress as a Novel Therapeutic Strategy? Front. Pharmacol. 2016 7 61 10.3389/fphar.2016.00061 27014073 PMC4794483 33. Ghosh A. Gao L. Thakur A. Siu P.M. Lai C.W.K. Role of free fatty acids in endothelial dysfunction J. Biomed. Sci. 2017 24 50 10.1186/s12929-017-0357-5 28750629 PMC5530532 34. Mathew M. Tay E. Cusi K. Elevated plasma free fatty acids increase cardiovascular risk by inducing plasma biomarkers of endothelial activation, myeloperoxidase and PAI-1 in healthy subjects Cardiovasc. Diabetol. 2010 9 9 10.1186/1475-2840-9-9 20158910 PMC2837624 35. Steinberg H.O. Paradisi G. Hook G. Crowder K. Cronin J. Baron A.D. Free fatty acid elevation impairs insulin-mediated vasodilation and nitric oxide production Diabetes 2000 49 1231 1238 10.2337/diabetes.49.7.1231 10909983 36. Steinberg H.O. Tarshoby M. Monestel R. Hook G. Cronin J. Johnson A. Bayazeed B. Baron A.D. Elevated circulating free fatty acid levels impair endothelium-dependent vasodilation J. Clin. Investig. 1997 100 1230 1239 10.1172/JCI119636 9276741 PMC508300 37. Adams H.P. Jr. Bendixen B.H. Kappelle L.J. Biller J. Love B.B. Gordon D.L. Marsh E.E. 3rd Classification of subtype of acute ischemic stroke. Definitions for use in a multicenter clinical trial. TOAST. Trial of Org 10172 in Acute Stroke Treatment Stroke 1993 24 35 41 10.1161/01.STR.24.1.35 7678184 38. Fazekas F. Niederkorn K. Schmidt R. Offenbacher H. Horner S. Bertha G. Lechner H. White matter signal abnormalities in normal individuals: Correlation with carotid ultrasonography, cerebral blood flow measurements, and cerebrovascular risk factors Stroke 1988 19 1285 1288 10.1161/01.STR.19.10.1285 3051534 39. Gregoire S.M. Chaudhary U.J. Brown M.M. Yousry T.A. Kallis C. Jäger H.R. Werring D.J. The Microbleed Anatomical Rating Scale (MARS): Reliability of a tool to map brain microbleeds Neurology 2009 73 1759 1766 10.1212/WNL.0b013e3181c34a7d 19933977 40. Pan Y. Wu T.T. Mao X.F. Hou X.G. Yang Y. Deng C.J. Wang S. Zheng Y.Y. Xie X. Decreased free fatty acid levels associated with adverse clinical outcomes in coronary artery disease patients with type 2 diabetes: Findings from the PRACTICE study Eur. J. Prev. Cardiol. 2023 30 730 739 10.1093/eurjpc/zwad073 36912007 41. Jansen M.G. Griffanti L. Mackay C.E. Anatürk M. Melazzini L. Lange A.G. Filippini N. Zsoldos E. Wiegertjes K. Leeuw F.E. Association of cerebral small vessel disease burden with brain structure and cognitive and vascular risk trajectories in mid-to-late life J. Cereb. Blood Flow Metab. 2022 42 600 612 10.1177/0271678X211048411 34610763 PMC8943617 42. Petrea R.E. O’Donnell A. Beiser A.S. Habes M. Aparicio H. DeCarli C. Seshadri S. Romero J.R. Mid to Late Life Hypertension Trends and Cerebral Small Vessel Disease in the Framingham Heart Study Hypertension 2020 76 707 714 10.1161/HYPERTENSIONAHA.120.15073 32755403 PMC7577565 43. Khadour F.H. Panas D. Ferdinandy P. Schulze C. Csont T. Lalu M.M. Wildhirt S.M. Schulz R. Enhanced NO and superoxide generation in dysfunctional hearts from endotoxemic rats Am. J. Physiol. Heart Circ. Physiol. 2002 283 H1108 H1115 10.1152/ajpheart.00549.2001 12181141 44. Yang J. Wu L.J. Tashino S. Onodera S. Ikejima T. Reactive oxygen species and nitric oxide regulate mitochondria-dependent apoptosis and autophagy in evodiamine-treated human cervix carcinoma HeLa cells Free Radic. Res. 2008 42 492 504 10.1080/10715760802112791 18484413 45. Chen Y. McMillan-Ward E. Kong J. Israels S.J. Gibson S.B. Mitochondrial electron-transport-chain inhibitors of complexes I and II induce autophagic cell death mediated by reactive oxygen species J. Cell Sci. 2007 120 4155 4166 10.1242/jcs.011163 18032788 46. Zhou X. Zhai X. Ashraf M. Direct evidence that initial oxidative stress triggered by preconditioning contributes to second window of protection by endogenous antioxidant enzyme in myocytes Circulation 1996 93 1177 1184 10.1161/01.CIR.93.6.1177 8653839 47. Garrido-Pascual P. Alonso-Varona A. Castro B. Buron M. Palomares T. H 2 2 Stem Cell Res. Ther. 2020 11 335 10.1186/s13287-020-01851-z 32746890 PMC7397657 48. Maia L.F. Kaeser S.A. Reichwald J. Lambert M. Obermüller U. Schelle J. Odenthal J. Martus P. Staufenbiel M. Jucker M. Increased CSF Aβ during the very early phase of cerebral Aβ deposition in mouse models EMBO Mol. Med. 2015 7 895 903 10.15252/emmm.201505026 25978969 PMC4520655 49. Jensen M. Schröder J. Blomberg M. Engvall B. Pantel J. Ida N. Basun H. Wahlund L.O. Werle E. Jauss M. Cerebrospinal fluid A beta42 is increased early in sporadic Alzheimer’s disease and declines with disease progression Ann. Neurol. 1999 45 504 511 10.1002/1531-8249(199904)45:4&#x0003c;504::AID-ANA12&#x0003e;3.0.CO;2-9 10211475 50. Noda K. Hattori Y. Nishii T. Horinouchi H. Nakaoku Y. Ogata S. Inagaki Y. Asano R. Yoshimoto T. Nishimura K. Relationship Between RNF213 p.R4810K and Echocardiographic Findings in Patients with Cerebrovascular Diseases: A Multicenter Prospective Cohort Study J. Am. Heart Assoc. 2025 14 e036333 10.1161/JAHA.124.036333 39868517 PMC12074755 51. Tomita K. Teratani T. Yokoyama H. Suzuki T. Irie R. Ebinuma H. Saito H. Hokari R. Miura S. Hibi T. Plasma free myristic acid proportion is a predictor of nonalcoholic steatohepatitis Dig. Dis. Sci. 2011 56 3045 3052 10.1007/s10620-011-1712-0 21516322 52. Beauchamp E. Goenaga D. Le Bloc’h J. Catheline D. Legrand P. Rioux V. Myristic acid increases the activity of dihydroceramide Delta4-desaturase 1 through its N-terminal myristoylation Biochimie 2007 89 1553 1561 10.1016/j.biochi.2007.07.001 17716801 53. Martínez L. Torres S. Baulies A. Alarcón-Vila C. Elena M. Fabriàs G. Casas J. Caballeria J. Fernandez-Checa J.C. García-Ruiz C. Myristic acid potentiates palmitic acid-induced lipotoxicity and steatohepatitis associated with lipodystrophy by sustaning de novo ceramide synthesis Oncotarget 2015 6 41479 41496 10.18632/oncotarget.6286 26539645 PMC4747168 54. Deshpande R. Mansara P. Suryavanshi S. Kaul-Ghanekar R. Alpha-linolenic acid regulates the growth of breast and cervical cancer cell lines through regulation of NO release and induction of lipid peroxidation J. Mol. Biochem. 2013 2 6 17 55. Couëdelo L. Buaud B. Abrous H. Chamekh-Coelho I. Majou D. Boué-Vaysse C. Effect of increased levels of dietary α-linolenic acid on the n-3 PUFA bioavailability and oxidative stress in rat Br. J. Nutr. 2022 127 1320 1333 10.1017/S0007114521002294 34462019 56. Bernick C. Kuller L. Dulberg C. Longstreth W.T. Jr. Manolio T. Beauchamp N. Price T. Silent MRI infarcts and the risk of future stroke: The cardiovascular health study Neurology 2001 57 1222 1229 10.1212/WNL.57.7.1222 11591840 57. Liu Y.T. Lei C.Y. Zhong L.M. Research Advancements on the Correlation Between Spontaneous Intracerebral Hemorrhage of Different Etiologies and Imaging Markers of Cerebral Small Vessel Disease Neuropsychiatr. Dis. Treat. 2024 20 307 316 10.2147/NDT.S442334 38405425 PMC10893791 58. Lovelock C.E. Cordonnier C. Naka H. Al-Shahi Salman R. Sudlow C.L. Edinburgh Stroke Study G. Sorimachi T. Werring D.J. Gregoire S.M. Imaizumi T. Antithrombotic drug use, cerebral microbleeds, and intracerebral hemorrhage: A systematic review of published and unpublished studies Stroke 2010 41 1222 1228 10.1161/STROKEAHA.109.572594 20431083 Figure 1 Comparison of total free fatty acid (FFA) concentrations based on the presence of magnetic resonance imaging findings of cerebral small vessel disease (SVD) in midlife patients. The bar graphs show the total FFA concentrations according to the presence of the following SVD findings: ( A B C D E Figure 2 Association between total free fatty acid (FFA) concentrations and the presence of lacunes and deep cerebral microbleeds (CMBs) in midlife patients. Abbreviation: CI, confidence interval. The multivariate logistic regression analyses were adjusted for sex, hypertension, diabetes mellitus, and dyslipidemia. Figure 3 Comparison of total free fatty acid (FFA) concentrations according to the presence of brain magnetic resonance imaging findings of cerebral small vessel disease (SVD) in late-life patients. The bar graphs show the total FFA concentrations according to the presence of the following SVD findings: ( A B C D E Figure 4 Comparison of total free fatty acid (FFA) concentrations according to the presence of brain magnetic resonance imaging findings of cerebral small vessel disease (SVD) in midlife men. The bar graphs show the total FFA concentrations according to the presence of the following SVD findings: ( A B C D E F Figure 5 Comparison of total free fatty acid (FFA) concentrations according to the presence of brain magnetic resonance imaging findings of cerebral small vessel disease (SVD) in late-life women. The bar graphs show the total FFA concentrations according to the presence of the following SVD findings: ( A B C D E F Figure 6 Comparison of total free fatty acid (FFA) concentrations according to the presence of brain magnetic resonance imaging findings of cerebral small vessel disease (SVD) in midlife women. The bar graphs show the total FFA concentrations according to the presence of the following SVD findings: ( A B C D E Figure 7 Comparison of total free fatty acid (FFA) concentrations according to the presence of brain magnetic resonance imaging findings of cerebral small vessel disease (SVD) in late-life men. The bar graphs show the total FFA concentrations according to the presence of the following SVD findings: ( A B C D E Figure 8 Associations between the free C14:0 and C18:3n3 concentrations and lacunes in the midlife patients. The bar graphs show the free C14:0 ( A B C antioxidants-14-01107-t001_Table 1 Table 1 Baseline characteristics of the study population.  All Patients n Midlife Patients ( n Late-Life Patients n p Age [years] 59 (49–73) 49.5 (42.5–55) 73 (67–77) — Female sex 30 (31.6) 18 (37.5) 12 (25.5) 0.21 Smoking 54 (56.8) 26 (54.2) 28 (59.6) 0.60 Hypertension 72 (75.8) 36 (75.0) 36 (76.6) 0.86 Diabetes 29 (30.5) 15 (31.3) 14 (29.8) 0.88 Dyslipidemia 62 (65.3) 30 (62.5) 32 (68.1) 0.57 Body mass index [kg/m 2 23.3 (21.0–26.4) 24.4 (22.7–27.0) 22.2 (19.9–25.3) 0.003 Liver function      - Total bilirubin [mg/dL] 0.6 (0.43–0.7) 0.5 (0.4–0.63) 0.6 (0.5–0.7) 0.13  - Aspartate aminotransferase [U/L] 21 (16–27.5) 19.5 (16–23) 23 (18–29) 0.034  - Alanine aminotransferase [U/L] 16 (13–22) 17.5 (14–23.25) 16 (12–19.5) 0.24 Subtypes of ischemic stroke  - Cardioembolic stroke 7 (7.4) 0 (0.0) 7 (14.9) 0.005  - Large-artery atherosclerosis 36 (37.8) 20 (41.7) 16 (34.0) 0.44  - Small-vessel occlusion 23 (24.2) 6 (12.5) 17 (36.2) 0.007  - Stroke of other determined etiologies 29 (30.5) 22 (45.8) 7 (14.9) 0.001 Continuous variables are expressed as median with interquartile range, and categorical variables are presented as frequencies with percentages. antioxidants-14-01107-t002_Table 2 Table 2 Prevalence of brain magnetic resonance imaging findings of cerebral small vessel disease and serum total free fatty acid concentrations.  All Patients n Midlife Patients ( n Late-Life Patients n Lacunes 42 (44.2) 18 (37.5) 24 (51.1) Deep CMBs 18 (20.0) 6 (13.0) 12 (27.3) Lobar CMBs 13 (14.4) 6 (13.0) 7 (15.9) PVH grade > 2 22 (23.2) 4 (8.3) 18 (38.3) DSWMH grade > 2 49 (51.6) 16 (33.3) 33 (70.2) Total FFA levels [µg/mL] 28.4 (21.0–32.3) 24.7 (20.0–31.7) 29.5 (23.2–32.8) Continuous variables were presented as median with interquartile range, and categorical variables were expressed as frequencies with percentages. Abbreviations: CMBs, cerebral microbleeds; PVH, periventricular hyperintensities; DSWMH, deep subcortical white matter hyperintensities; FFA, free fatty acid. antioxidants-14-01107-t003_Table 3 Table 3 Comparison of liver function indices according to the presence of small vessel disease (SVD) findings on brain magnetic resonance imaging (MRI) in midlife patients.  All Patients SVD Findings on Brain MRI (−) SVD Findings on Brain MRI (+) p Lacunes     Number n n n  Total bilirubin [mg/dL] 0.50 (0.40–0.65) 0.50 (0.40–0.60) 0.60 (0.50–0.70) 0.20 Aspartate aminotransferase [U/L] 20 (16–23) 20 (16–23) 20 (16–26) 0.72 Alanine aminotransferase [U/L] 18 (14–24) 16 (14–23) 20 (14–27) 0.41 Deep CMBs     Number n n n  Total bilirubin [mg/dL] 0.50 (0.40–0.70) 0.50 (0.40–0.70) 0.55 (0.40–0.70) >0.99 Aspartate aminotransferase [U/L] 19 (16–23) 19 (16–25) 20 (19–21) >0.99 Alanine aminotransferase [U/L] 17 (14–24) 16 (14–24) 18 (14–21) >0.99 Values are expressed as the median and interquartile range. Abbreviation: CMBs, cerebral microbleeds. antioxidants-14-01107-t004_Table 4 Table 4 Comparison of free fatty acid (FFA) fraction concentrations based on the presence of lacunes in the midlife patients. FFA Fraction [µg/mL] Patients Without Lacunes n Patients with Lacunes n p C12:0 0 (0–0) 0 (0–0) 0.37 C16:0 7.14 (6.21–8.63) 6.55 (5.99–8.39) 0.40 C16:1 0.63 (0.33–1.05) 0.42 (0.3–0.6) 0.072 C18:0 3.08 (2.54–4.23) 2.77 (2.56–3.87) 0.61 C18:1n9c 8.5 (6.28–11.26) 7.06 (4.66–8.71) 0.083 C18:2n6c 3.64 (2.73–5.35) 3.25 (2.19–3.57) 0.15 C20:1n9 0 (0–0) 0 (0–0) 0.28 C20:2n6 0 (0–0) 0 (0–0) 0.46 C20:3n6 0 (0–0) 0 (0–0) 0.59 C20:4n6 0.62 (0.41–0.95) 0.42 (0.33–0.75) 0.10 C20:5n3 0 (0–0.15) 0 (0–0) 0.64 C22:6n3 0.65 (0.51–1.11) 0.44 (0.36–0.85) 0.14 Values are expressed as median (interquartile range). ",
  "metadata": {
    "Title of this paper": "Antithrombotic drug use, cerebral microbleeds, and intracerebral hemorrhage: A systematic review of published and unpublished studies",
    "Journal it was published in:": "Antioxidants",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466652/"
  }
}