{
  "title": "Paper_877",
  "abstract": "pmc Front Oncol Front Oncol 1755 frontonco Front. Oncol. Frontiers in Oncology 2234-943X Frontiers Media SA PMC12460114 PMC12460114.1 12460114 12460114 41018105 10.3389/fonc.2025.1591923 1 Oncology Original Research A long-term retrospective analysis of oncologic and fertility outcomes in cervical cancer patients undergoing radical trachelectomy Liu Yu Zhang Xuyin Xin Weijuan Ding Yan Zhang Yunqiang Zhang Ning  * Hua Keqin  *  Department of Gynecology, Obstetrics and Gynecology Hospital of Fudan University Shanghai China Edited by: Stefano Canosa Reviewed by: Kinan Mokbel  Aleksandar Celebic *Correspondence: Keqin Hua, huakeqinjiaoshou@163.com zn0731@hotmail.com 11 9 2025 2025 15 480898 1591923 11 3 2025 25 8 2025 11 09 2025 26 09 2025 29 09 2025 Copyright © 2025 Liu, Zhang, Xin, Ding, Zhang, Zhang and Hua. 2025 Liu, Zhang, Xin, Ding, Zhang, Zhang and Hua https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Given the excellent prognosis of early-stage cervical cancer, fertility-sparing surgery has grown as a priority, significant alternative for radical hysterectomy in women being of reproductive age. We aimed to investigate the outcomes and subsequent pregnancies of early-stage cervical cancer patients who received radical trachelectomy. Moreover, there is a scarcity of literature directly comparing the impact of whether performing cervical cerclage concurrently with radical trachelectomy on patients’ reproductive outcomes. Methods Women with IA1-IB2 cervical cancer who underwent fertility-sparing surgery at the Obstetrics and Gynecology Hospital of Fudan University were reviewed from January 2014 to May 2024.Radical trachelectomy in 70 women was performed by surgical team from the gynecologic oncologic center. Clinical characteristics, intraoperative, pathological results, oncologic, fertility and follow-up data of these patients were recorded and retrospectively analyzed. This study compared surgical and perinatal outcomes between patients who underwent cervical cerclage during radical trachelectomy (n=49) and those who did not receive the procedure simultaneously (n=21). Results A total of 70 women (mean age: 31years) underwent radical trachelectomy (RT) of whom 68.6% were nulliparous. The FIGO stage distribution was IA1 (n=6), stage IA2 (n=7), stage IB1 (n=49), and stage IB2 (n=8). The operative duration was significantly longer in the cerclage group than in the control group (285.4±63.9 min vs 204.8±61.9 min; p p p Conclusion Radical trachelectomy provides excellent oncologic results with an outstanding fertility rate and obstetric outcome for patients with early cervical cancer. RT combined with intrauterine-cervical stent is a safe and effective fertility-sparing surgery but cervical cerclage is not recommended. cervical cancer fertility-sparing surgery radical trachelectomy cerclage intrauterine-cervical stent pregnancy delivery The author(s) declare financial support was received for the research and/or publication of this article. This work was supported by Clinical Research Program of Obstetrics and Gynecology Hospital of Fudan University (NO. FC2021CR101) and the medical innovation research project of the Science and Technology Commission of Shanghai Municipality (No. 22Y11906500, to Ning Zhang) and Shanghai Municipal Health Commission (20214Y0220, to Ning Zhang). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Gynecological Oncology Introduction Cervical cancer (CC) is the most common gynecological malignancy in women and the leading cause of cancer death in some developing countries. Despite improvements in screening and prevention, CC remains a significant cause of morbidity and mortality ( 1 2 3 4 5 Radical trachelectomy, as a fertility-preserving surgical option for patients with early-stage cervical cancer, is currently performed via two main approaches: open surgery and minimally invasive surgery (including laparoscopy and robot-assisted techniques). A large international multicenter retrospective study (2005 to 2017) demonstrated that the two approaches showed no significant differences in 4.5-year disease-free survival (99.2% vs. 99.0%) or overall survival, with low recurrence rates observed for both. Minimally invasive surgery has emerged as an alternative to open surgery due to its reduced surgical trauma ( 6 7 8 9 To maintain healthy menstruation and reduce infertility problems after radical trachelectomy, it is important to prevent postoperative cervical stenosis and cervical insufficiency. Until now, there have been few studies published fertility outcomes after radical trachelectomy and various surgical approaches, including vaginal RT (VRT), abdominal RT (ART), the robotic radical trachelectomy (RORT) and video laparoscopy radical trachelectomy (VLRT), yield different fertility outcomes (live delivery rate 8.33%-76.2%) ( 10 14 Much of the current literature consists of case reports with limited sample sizes, lacking long-term follow-up data on oncologic outcomes and the health development of offspring. Recent reports, although documenting a larger number of surgeries, rarely mention fertility outcomes ( 15 16 17 Patients who are appropriately staged and aged (≤ IB2, ≤40 preferred); Cervical cerclage may be performed either intraoperatively or during pregnancy, concurrent intraoperative cerclage is not routinely recommended; Placement of an IUD and cervical stent during surgery to prevent cervical adhesion, highly recommended; Rigorous postoperative follow-up and active encouragement of fertility at 6 months post-surgery when the intrauterine stent is removed. Since initiating our radical trachelectomy program in 2009, we have performed over 100 procedures, observing merely three recurrences with zero mortality. Our team has previously established that fertility-sparing surgery (FSS) achieves favorable survival and prognostic outcomes for cervical cancer ( 18 19 20 Materials and methods We retrospectively reviewed the medical records of patients diagnosed with cervical cancer who underwent radical trachelectomy in Shanghai tertiary medical center (Obstetrics and Gynecology Hospital of Fudan University) from January 2014 to May 2024. Inclusion criteria were as follows: Patients who have strong desire to preserve fertility and no history of fertility impairment; aged 18 to 45 years; 2018 FIGO stage IA1-IB2; pathological types include adenocarcinoma, squamous cell carcinoma, or adenosquamous carcinoma; no evidence of upper endocervical involvement and a cranial extent of the tumor that is at least 1 cm away from the internal os; no lymph node spread or distant metastasis by preoperative imaging. Exclusion criteria including: neuroendocrine carcinoma and gastric-type adenocarcinoma of the cervix; has received radiotherapy or neo-adjuvant therapy; tumors with internal os invasion or lymph node metastasis confirmed by intraoperative frozen section pathology; accompanied by any other kind of malignancy; absence of follow-up data. For the patients included in this study, we assessed the following variables: basic characteristics (age at diagnosis, BMI, FIGO stage, surgical approach and histology); perioperative outcomes (operation time, blood loss, hospital stay, and complication); fertility outcomes (pregnancy rate, natural conception rate and in vitro  Figure 1 Figure 1 Therapeutic Protocol and Fertility Follow-up Algorithm for CC Patients Undergoing RT in this study. CC, cervical cancer; RT, radical trachelectomy; FIGO, International Federation of Gynecology and Obstetrics; FSS, fertility sparing surgery. Flowchart outlining decision-making criteria for fertility preservation in patients with certain cervical cancer stages. It includes inclusion and exclusion criteria, informed consent, procedures like hysterectomy, in vitro fertilization, and monitoring options for conception and pregnancy, depending on tumor and lymph node conditions. Preoperative assessment and follow-up Two experienced gynecologic oncologists staged the patients and assessed parametrial involvement. Preoperative colposcopy was performed to exclude high-grade vaginal lesions or vaginal cancer. Preoperative imaging such as pelvic enhanced MRI were conducted to rule out pelvic metastasis. Follow-up data was obtained from the outpatient electronic medical record system, generally every three months for 2 years and every 6 months for 5 years after the surgery. Surgical procedure Radical trachelectomy with pelvic lymph node dissection Prior to the radical trachelectomy, a pelvic lymph node dissection is performed, and the excised common iliac lymph nodes are sent for rapid frozen section pathology examination. The radical trachelectomy proceeds only after pathological confirmation of tumor-free pelvic lymph nodes, while preserving the uterine artery’s upper branches. The parametrial tissue is cut 3cm from the uterus at the level of the uterosacral ligament and cardinal ligament. The cervix is transected at 30mm below the external cervical os, ligating and closing the cervical lesion, cutting the vaginal wall, and then dividing the cervix at the level of the internal cervical os. The excised cervix is sent for frozen section pathology examination through the vagina. If the cervical margins(>3-5mm), vaginal margins, and lymph nodes are all negative, the lower segment of the uterus and the posterior vaginal stump are further sutured. Cervical stent insertion and cerclage A polypropylene loop ligature is placed below the uterine artery at the internal cervical os, and an intrauterine device (IUD) is connected to a size 18 Foley catheter to create a homemade uterine-cervical stent, which is then implanted into the uterine cavity and cervical os. Tighten the cerclage band and secure with a knot. The peritoneal layer is sutured continuously with absorbable sutures. The detailed surgical procedure and schematic illustration of FSS in this study are illustrated in  Figure 2  Figure 3 Figure 2 Surgical procedure flow. Pelvic lymphadenectomy is performed. Proceed with radical trachelectomy only upon negative lymph nodes. Implant homemade uterine-cervical stent into the uterine cavity and cervical os. Tighten the cerclage band and secure with a knot. Four images showing surgical procedures. Top left: Pelvic lymph node dissection with instruments around yellow tissue. Top right: Radical trachelectomy with exposed tissue and measuring tape. Bottom left: Cervical stent insertion with a loop and instruments. Bottom right: Cervical cerclage with sutures and instruments. Figure 3 Schematic illustration of FSS in this study. As shown in the figure below, the surgical scope is marked by a black solid line. The surgery encompassed pelvic lymph node dissection and the excision of the cervix as well as 2-3cm of the vagina and adjacent para-uterine structures, while preserving the cervical tissue, specifically maintaining a distance of over 1cm from the internal os of the cervix. During the surgery, a cervical stent was applied, and cervical cerclage was performed simultaneously. Diagram illustrating a radical trachelectomy procedure. It shows pelvic lymph node dissection, surgical scope of radical trachelectomy, cervical stent insertion, and cervical cerclage. Lymph nodes are depicted in green, blood vessels in red and blue, with anatomical labels for clarity. Statistical analysis The t-test was used to compare continuous variables that followed a normal distribution and met the homogeneity of variance assumption, including age, BMI, operative time, blood loss, and neonatal birth weight, etc. For categorical variables (such as stage, histology, pregnancy rate, etc.), use the χ2 test or Fisher’s exact test, for continuous data that do not follow a normal distribution, use the Mann-Whitney U test. P-values <0.05 were considered to denote statistical significance. Results Baseline characteristics The average follow-up time for these 70 patients was 68.7 months, with the longest follow-up time being 153 months. A total of 70 patients of reproductive age with stage IA1-IB2 cervical cancer underwent fertility-sparing surgery with a median follow-up of 5.7 years (range: 2.8-12.8 years). The median age of patients was 31.1 years, and 29.6% were primipara, with only 4 cases having received HPV vaccination (5.7%). Minimally invasive techniques (laparoscopic/robotic/gasless laparoscopic) constituted a majority of procedures (98.6%), contrasting with open abdominal surgery as the small minority approach (1.4%). The mean length of hospital stay was 10.6 days for the FSS patients, as shown in  Table 1 Table 1 Basic characteristics. Patients N=70(%) Follow up months, (median, range) 68.7(34-153) HPV vaccine Yes 4/70 (5.7%) No 66/70 (94.3%) Prior LEEP or CKC No 25/70 (35.2%) LEEP 34/70 (47.9%) CKC 11/70 (15.5%) Surgical approach Laparoscopic 55/70(78.6%) Robotic 12/70 (16.9%) Gasless laparoscopic 2/70 (2.8%) Abdom 1/70 (1.4%) Post-operative hospital stay days, (median, range) 10.6(5-16) CKC, cold knife conization; LEEP, loop electrosurgical excision procedure. Surgical outcomes The mean ages of the non-cerclage group and cerclage group were 31.3 years and 30.6 years, respectively. No significant differences were observed between the cerclage and non-cerclage groups regarding age, BMI, FIGO stage, or pathological type (all p>0.05). Preoperative abortion rates and obstetric history also showed no intergroup differences. Intrauterine stent placement was performed concurrently in 83.7% of the cerclage group cases, significantly higher than the 52.4% rate in the non-cerclage group (p>0.05). As anticipated, the operative time in the cerclage group (285.4±63.9 min) was significantly longer than that in the non-cerclage group (204.8±61.9 min, p<0.001, 95% CI 47.51298,113.48022). Similarly, intraoperative blood loss was greater in the cerclage group (201.0ml vs p= No differences were found between groups regarding lesion size ( p= p= p= The number of common iliac lymph nodes harvested was approximately 1 bilaterally in both groups, showing no intergroup difference (left, p= p= p= p= p=  Table 2 Table 2 Surgical data and complications. Variables Non-cerclage Cerclage during RT  p 95% CI Age (years) 31.3±6.3 30.6±4.7 0.577 -3.477,1.953 BMI (kg/m2) 22.5±2.8 20.5±2.4 0.122 -4.573,0.592 SCC antigen level 0.8(0.7,1.2) 0.8(0.6,1.1) 0.534 Histological type 0.679 SCC 15/21(71.4%) 38/49(77.6%) Adeno 4/21(19.0%) 9/49(18.4%) Adenosqmaous 2/21(9.5%) 2/49(4.1%) FIGO Stage, 0.133 IA1 4/21(19.0%) 2/49(4.1%) IA2 3/21(14.3%) 4/49(8.2%) IB1 13/21(61.9%) 36/49(73.5%) IB2 1/21(4.8%) 7/49(14.3%) Pre-operative abortions 0(0,1.5) 1(0,2) 0.07 Parous before FSS 6/21(28.6%) 16/49(32.7%) 0.736 Nulliparous before FSS 15/21(71.4%) 33/49(67.3%) IUD+cervical stent 11/21(52.4%) 41/49(83.7%) 0.006 Operative time min 204.8±61.9 285.4±63.9 <0.001 47.51298,113.48022 Intraoperative blood loss mL 170.1±59.3 201.0±96.5 0.187 -15.104,75.717 Intraoperative complications 0/21(0%) 2/49(4.1%) NA Tumor size cm 0(0,2.5) 0(0,1.6) 0.795 Lymph-vascular space invasion 4/21 (19.0%) 14/49(28.6%) 0.403 Stromal invasion 0.723 None 13/21(61.9%) 24/49(49.0%) Superficial 5/21(23.8%) 17/49(34.7%) Middle 1/21(4.8%) 4/49(8.2%) deep 2/21(9.5%) 4/49(8.2%) Histologic Subtype 0.985 NA 15/21(71.4%) 34/49(69.4%) Keratinizing 2/21(9.5%) 5/49(10.2%) Non-keratinizing 4/21(19.0%) 10/49(20.4%) Length of vaginal cuff resection 0 o’clock 2.2±0.8 2.0±0.8 0.319 -0.224,0.675 3 o’clock 2.2±0.6 2.3±0.7 0.552 -0.274,0.507 6 o’clock 2.3±0.7 2.7±0.8 0.073 -0.004,0.860 9 o’clock 2.1±0.6 2.3±0.7 0.204 -0.140,0.640 Number of common iliac lymph nodes left 1(1,2) 1(1,2) 0.401 right 1(1,2.75) 1(1,2) 0.320 Number of pelvic lymph nodes left 8.1±4.5 6.9±2.3 0.142 -2.977,0.437 right 7.7±3.7 7.7±4.1 0.935 -2.151,2.335 Postoperative chemotherapy 2/21(9.5%) 11/49(22.4%) 0.317 Adeno, adenocarcinoma; FIGO, International Federation of Gynecology and Obstetrics; SCC, squamous cell carcinoma; FSS= fertility sparing surgery. NA, Not Available. Oncological and reproductive outcomes Latest follow-up data revealed no recurrence in the non-cerclage group, whereas 3 cases of recurrence were observed in the concurrent intraoperative cerclage group, though the difference was not statistically significant ( p= vs p vs p vs p No intergroup differences were observed in postoperative miscarriage frequency ( p vs vs p= vs p= vs p All cesarean sections and their post-operative courses were uneventful. No differences were noted in neonatal Apgar scores at 1 minute (median 9 in both groups, p= p vs p To further evaluate cervical cerclage’s gestational prolongation effect, patients were reclassified by cerclage status (regardless of timing: concurrent intraoperative or during pregnancy). Analysis revealed that the cerclage group had a longer mean gestational age (36.3 weeks vs vs p The incidence of antenatal complications—such as velamentous cord insertion and gestational diabetes mellitus—showed no significant difference between groups ( p vs p No patients required radiotherapy or chemotherapy following cesarean delivery. Over 10 years of follow-up confirmed normal offspring development in both groups, with no congenital malformations or neurodevelopmental disorders observed. As shown in  Table 3 Table 3 Oncology follow-up and fertility data. Variables Non-cerclage Cerclage during RT  p 95% CI Recurrence 0/21(0%) 3/49(6.1%) 0.549 Death 0/7(0%) 0/13(0%) NA Attempting pregnancy 12/21(57.1%) 24/49(49.0%) 0.531 Pregnancy rate 9/12(75.0%) 17/24(70.8%) 0.793 Conception 0.210 Natural conception 7/9(77.8%) 9/17(52.9%) IVF-ET 2/9(22.2%) 8/17(47.1%) Postoperative complications 1/21(4.8%) 3/49(6.1%) 0.728 Number of miscarriages after FSS 0.788 0 6/9(66.7%) 11/17(64.7%) 1 2/9(22.2%) 4/17(23.5%) 2 1/9(11.1%) 1/17(5.9%) 3 0/9(0%) 1/17(5.9%) Fertility results 0.252 Miscarriage ≤12th WOG 2/9(22.2%) 3/17(17.6%) Miscarriage >12th ≤28th WOG 1/9(11.1%) 2/17(11.8%) Preterm birth (>28 th<37 th WOG) 3/9(33.3%) 5/17(29.4%) Live birth 7/9(77.8%) 13/17(76.5%) 0.564 Full-term delivery 4/9(44.4%) 8/17 (47.1%) 0.608 Apgar 1min 9(9,9) 9(9,9) 0.173 Gender of offspring 0.848 Boy 3/7(42.9%) 5/13(38.5%) Girl 4/7(57.1%) 8/13(61.5%) Week of gestation 37(35.5,37.2) 37(35,37.35) 0.842 Mean birth weight/g 2828.6±341.4 2625±393.9 0.265 -575.169,168.027 Complications during pregnancy 1/7(14.3%) 4/13(30.8%) 0.613 Retaining the uterus after childbirth 5/7(71.4%) 8/13(61.5%) 0.656 Radiation/chemotherapy after CS 0/7(0%) 0/13(0%) NA Average age of offspring months, (median, range) 122(71,187) 132(62.5,190) 0.905 Developmental abnormalities in offspring 0/7(0%) 0/13(0%) NA IVF-ET, in vitro Discussion Nowadays, fertility-preservation treatment strategies for patients with early stage cervical cancer are continuously evolving, and less radical surgeries based on the ConCerv criteria are becoming more acceptable. Additional and ongoing evidence is helping determine the impact of conservative procedures on oncologic and obstetric outcomes in these patients ( 21 The literature reports that the most common procedure performed was radical vaginal trachelectomy (40.7%) with the highest clinical pregnancy rate (67.5%) ( 21 22 23 23 21 24 The reported average rate of cervical stenosis after radical trachelectomy was 10.5%. Among patients with abdominal, vaginal, laparoscopic and robotic radical trachelectomy, the incidences of cervical stenosis were 11.0%, 8.1%, 9.3% and 0%, respectively while the use of uterine cavity stents can prevent intrauterine adhesions(4.6% VS 25 9 26 27 Due to limited evidence, no relevant guidelines have been established for clinical reference regarding whether cervical cerclage should be performed simultaneously during fertility-preserving surgery for cervical cancer. Statistical analysis based solely on the presence or absence of cervical cerclage (regardless of timing) demonstrated that the cerclage group exhibited significantly higher mean gestational age at delivery (36.3 weeks) compared to the non-cerclage group (33.4 weeks), along with greater neonatal birth weights (2719.74g vs 28 vs vs vs 29 In cases of cerclage placed in patients undergo radical trachelectomy, the procedure is typically performed via transabdominal or laparoscopic approach. Consequently, the cerclage cannot be removed vaginally. What’s more, it has been reported that once the prophylactic cerclage is removed, re-suturing may not be feasible ( 30 The factors influencing postoperative pregnancy in patients are numerous, such as anatomical issues, cervical canal adhesions, abnormal uterine bleeding, sexual dysfunction, and psychological issues like fear of tumor recurrence, fear of sexual activity, concerns about pregnancy affecting tumor prognosis, etc ( 31 33 34 9 For cervical cancer patients undergoing fertility-sparing treatment, the literature recommends planned cesarean delivery between 37 and 39 weeks of gestation ( 35 36 27 Our institution has implemented a specialized multidisciplinary fertility preservation clinic that delivers structured patient education on cervical cancer management while providing personalized preconception counseling. For patients failing to conceive spontaneously within six months post-treatment, we initiate timely assisted reproductive technology (ART) referrals. This structured pathway aims to support patients’ pursuit of post-therapeutic fertility goals, with anticipated enrichment of longitudinal reproductive outcome data. Limitations Our study has several notable limitations. Firstly, due to its retrospective nature, there are inherent risks such as selection bias, potential missing data, and reliance on existing records. This may affect the accuracy and comprehensiveness of the data analysis. Secondly, although the sample size of 70 is reasonable for this specialized surgical procedure, it may limit the ability to detect statistically significant differences in subgroup analyses or rare events. Additionally, being a single-center study, the results might reflect specific institutional practices and patient populations, thus potentially restricting the generalizability of the findings. Acknowledgments The authors thank Jiang-Nan Wu, Research Associate, Department of Clinical Research Center, Obstetrics and Gynecology Hospital of Fudan University, for help in performing the statistical analysis. Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Ethics statement Written informed consent was obtained from the individual(s) for the publication of any potentially identifiable images or data included in this article. Author contributions YL: Data curation, Formal Analysis, Visualization, Writing – original draft, Writing – review & editing. XZ: Investigation, Methodology, Supervision, Writing – review & editing. WX: Conceptualization, Data curation, Formal Analysis, Investigation, Visualization, Writing – review & editing. YD: Conceptualization, Data curation, Formal Analysis, Investigation, Methodology, Supervision, Writing – review & editing. YZ: Conceptualization, Data curation, Formal Analysis, Investigation, Methodology, Software, Supervision, Validation, Writing – review & editing. NZ: Conceptualization, Data curation, Funding acquisition, Investigation, Methodology, Project administration, Resources, Supervision, Validation, Visualization, Writing – review & editing. KH: Conceptualization, Funding acquisition, Project administration, Supervision, Validation, Visualization, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fonc.2025.1591923/full#supplementary-material References 1 Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Global cancer statistics 2020: globocan estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA-CANCER J Clin 2021 71 209–49 10.3322/caac.21660 33538338 2 Jorgensen KA Agusti N Wu CF Kanbergs A Pareja R Ramirez PT Fertility-sparing surgery vs standard surgery for early-stage cervical cancer: difference in 5-year life expectancy by tumor size Am J OBSTET GYNECOL 2024 230 661–3 10.1016/j.ajog.2024.02.012 38365097 PMC11139552 3 Jorgensen K Meernik C Wu CF Murphy CC Baker VL Jarmon P Disparities in fertility-sparing treatment and use of assisted reproductive technology after a diagnosis of cervical, ovarian, or endometrial cancer OBSTET GYNECOL 2023 141 341–53 10.1097/AOG.0000000000005044 36649345 PMC9858239 4 Zaccarini F Sanson C Maulard A Scherier S Pautier P Leary A Surgical de-escalation in gynecologic oncology B Cancer 2021 108 1155–61 10.1016/j.bulcan.2021.06.012 34629168 5 Wei J Qi Y Shen X Analysis on the incidence and mortality of cervical cancer in China based on the age-period-cohort model from 1992 to 2021 Int J Gynecol Obstetrics 2024 51 664–8 10.12280/gjfckx.20240828 6 Salvo G Ramirez PT Leitao MM Cibula D Wu X Falconer H Open vs minimally invasive radical trachelectomy in early-stage cervical cancer: international radical trachelectomy assessment study Am J OBSTET GYNECOL 2022 226 91–7 10.1016/j.ajog.2021.08.029 34461074 PMC9518841 7 Smith ES Moon AS O’Hanlon R Leitao MJ Sonoda Y Abu-Rustum NR Radical trachelectomy for the treatment of early-stage cervical cancer: a systematic review OBSTET GYNECOL 2020 136 533–42 10.1097/AOG.0000000000003952 32769648 PMC7528402 8 Li X Xia L Li J Chen X Ju X Wu X Reproductive and obstetric outcomes after abdominal radical trachelectomy (art) for patients with early-stage cervical cancers in Fudan, China GYNECOL Oncol 2020 157 418–22 10.1016/j.ygyno.2020.02.016 32122687 9 Shah JS Jooya ND Woodard TL Ramirez PT Fleming ND Frumovitz M Reproductive counseling and pregnancy outcomes after radical trachelectomy for early stage cervical cancer J GYNECOL Oncol 2019 30 e45 10.3802/jgo.2019.30.e45 30887762 PMC6424852 10 Robova H Rob L Halaska MJ Drozenova J Pichlik T Drochytek V Twenty years of experience with less radical fertility-sparing surgery in early-stage cervical cancer: pregnancy outcomes GYNECOL Oncol 2023 174 76–9 10.1016/j.ygyno.2023.04.016 37163776 11 Bellotti JA Gutierres IG Furtado YL Patury P Figueiredo JA Guitmann G Surgical, oncologic, and obstetric outcomes of radical trachelectomy in early-stage cervical cancer: results from a retrospective cohort study at Brazil national cancer institute Front Oncol 2024 14 1267625 10.3389/fonc.2024.1267625 38525414 PMC10958530 12 Chen T Li J Zhu Y Lu AW Zhou L Wang JS The oncological and obstetric results of radical trachelectomy as a fertility-sparing therapy in early-stage cervical cancer patients BMC WOMENS Health 2022 22 424 10.1186/s12905-022-01990-w 36289488 PMC9608899 13 Danisch M Kranawetter M Bartl T Postl M Grimm C Langthaler E Oncologic and obstetric outcomes following radical abdominal trachelectomy in non-low-risk early-stage cervical cancers: a 10-year Austrian single-center experience J Pers Med 2024 14 611 10.3390/jpm14060611 38929833 PMC11204697 14 Guo J Zhang Y Chen X Sun L Chen K Sheng X Surgical and oncologic outcomes of radical abdominal trachelectomy versus hysterectomy for stage ia2-ib1 cervical cancer J MINIM INVAS GYN 2019 26 484–91 10.1016/j.jmig.2018.06.006 29908338 15 Kobayashi H Yanazume S Kamio M Togami S Ushiwaka T Robotic trachelectomy with sentinel lymph node biopsy for cervical cancer: a prospective study investigating minimally invasive radicality Int J Clin Oncol 2025 30 1002–17 10.1007/s10147-025-02718-0 40038151 PMC12014823 16 Soltanizadeh S Bjorn SF Froding LP Mosgaard BJ Hogdall C Oncological outcomes after vaginal and robotic-assisted radical trachelectomy in patients with cervical cancer-a single-center prospective cohort study EJSO-EUR J Surg ONC 2025 51 109671 10.1016/j.ejso.2025.109671 39954571 17 Jones CA Tan J Chronis-Brown P Zhu A Pereira N Live birth after transmyometrial embryo transfer in a patient with radical trachelectomy FERTIL STERIL 2024 122 1152–3 10.1016/j.fertnstert.2024.08.346 39218281 18 Shen K Lang JH Yang JX Chen YL Xiang Y Hua KQ Analysis of 16 patients with early cervical cancer treated by laparoscopic vaginal radical trachelectomy Zhonghua Fu Chan Ke Za Zhi 2006 41 222–5 10.3760/j.issn:0529-567x.2006.04.003 16759453 19 Yi X Ding J Zhang Y Liu X Cheng H Li X Laparoscopic radical trachelectomy followed by chemotherapy in a pregnant patient with invasive cervical cancer Int J GYNECOL OBSTET 2015 131 101–2 10.1016/j.ijgo.2015.04.035 26164629 20 Tang X Zhang X Ding Y Zhang Y Zhang N Qiu J A long-term retrospective analysis of management of cervical cancer during pregnancy Int J GYNECOL OBSTET 2024 165 1189–98 10.1002/ijgo.15314 38149695 21 Salman L Covens A Fertility preservation in cervical cancer-treatment strategies and indications Curr Oncol 2024 31 296 306 10.3390/curroncol31010019 38248104 PMC10814061 22 Kohler C Plaikner A Siegler K Hertel H Hasenbein K Petzel A Radical vaginal trachelectomy: long-term oncologic and fertility outcomes in patients with early cervical cancer Int J GYNECOL Cancer 2024 34 799 805 10.1136/ijgc-2024-005274 38599782 PMC11187360 23 Han L Chen Y Zheng A Tan X Chen H Minimally invasive versus abdominal radical trachelectomy for early-stage cervical cancer: a systematic review and meta-analysis Am J Cancer Res 2023 13 4466–77 37818069 PMC10560958 24 Bogani G Chiappa V Vinti D Somigliana E Filippi F Murru G Long-term results of fertility-sparing treatment for early-stage cervical cancer GYNECOL Oncol 2019 154 89 94 10.1016/j.ygyno.2019.04.007 31000470 25 Li X Li J Wu X Incidence, risk factors and treatment of cervical stenosis after radical trachelectomy: a systematic review Eur J Cancer 2015 51 1751–9 10.1016/j.ejca.2015.05.012 26049687 26 Li Q Pregnancy and oncological outcomes of different fertility-sparing surgical approaches for early-stage cervical cancer Chongqing, China Army Medical University of the Chinese People’s Liberation Army 2022 50 27 Chernyshova A Kolomiets L Chekalkin T Chernov V Sinilkin I Gunther V Fertility-sparing surgery using knitted tini mesh implants and sentinel lymph nodes: a 10-year experience J Invest Surg 2021 34 1110–8 10.1080/08941939.2020.1745965 32281433 28 D’Antonio F Eltaweel N Prasad S Flacco ME Manzoli L Khalil A Cervical cerclage for prevention of preterm birth and adverse perinatal outcome in twin pregnancies with short cervical length or cervical dilatation: a systematic review and meta-analysis PloS Med 2023 20 e1004266 10.1371/journal.pmed.1004266 37535682 PMC10456178 29 Messinger CJ Hernandez-Diaz S Hofman A Sadlak N Einarsson J McElrath TF Effect of transabdominal versus transvaginal cerclage on preterm birth and neonatal outcomes among patients with a history of cervical insufficiency Am J OBSTET GYNECOL 2025 25 00427 10.1016/j.ajog.2025.06.049 40645472 30 Ishioka S Kim M Mizugaki Y Kon S Isoyama K Mizuuchi M Transabdominal cerclage (tac) for patients with ultra-short uterine cervix after uterine cervix surgery and its impact on pregnancy J OBSTET GYNAECOL RE 2018 44 61–6 10.1111/jog.13487 29121417 31 Matsuoka M Taga A Hata S Yamamoto R Ando Y Kozono Y Abnormal menstruation after radical trachelectomy and its effects on fertility J OBSTET GYNAECOL RE 2019 45 1906–12 10.1111/jog.14032 31215125 32 Froeding LP Ottosen C Rung-Hansen H Svane D Mosgaard BJ Jensen PT Sexual functioning and vaginal changes after radical vaginal trachelectomy in early stage cervical cancer patients: a longitudinal study J SEX Med 2014 11 595 604 10.1111/jsm.12399 24286464 33 Carter J Sonoda Y Chi DS Raviv L Abu-Rustum NR Radical trachelectomy for cervical cancer: postoperative physical and emotional adjustment concerns GYNECOL Oncol 2008 111 151–7 10.1016/j.ygyno.2008.06.003 18662827 34 Li Q Yang R Zhou Z Qian W Zhang J Wu Z Fertility history and intentions of married women, China B World Health Organ 2024 102 244–54 10.2471/BLT.23.289736 38562192 PMC10976870 35 Temming L Mikhail E Society for maternal-fetal medicine consult series 65: transabdominal cerclage Am J OBSTET GYNECOL 2023 228 B2 B10 10.1016/j.ajog.2023.02.018 36858095 36 Nishio H Fujii T Sugiyama J Kuji N Tanaka M Hamatani T Reproductive and obstetric outcomes after radical abdominal trachelectomy for early-stage cervical cancer in a series of 31 pregnancies Hum Reprod 2013 28 1793–8 10.1093/humrep/det118 23624633 ",
  "metadata": {
    "Title of this paper": "Reproductive and obstetric outcomes after radical abdominal trachelectomy for early-stage cervical cancer in a series of 31 pregnancies",
    "Journal it was published in:": "Frontiers in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12460114/"
  }
}