{
  "title": "Paper_205",
  "abstract": "pmc BMC Pediatr BMC Pediatr 55 bmcpedi BMC Pediatrics 1471-2431 BMC PMC12492882 PMC12492882.1 12492882 12492882 41039318 10.1186/s12887-025-05992-z 5992 1 Research Hearing assesment in children after intrauterine exposure to platinum-based treatment of pregnant cancer patients: A study from the International Network on Cancer, Infertility and Pregnancy Veld Evangeline A. Huis in ‘t 1 2 Babkova Anna 3 Verespejova Ľudmila 4 Diepstraten Franciscus A. 1 Meijer Annelot J. M. 1 van Grotel Martine 1 van Gerwen Mathilde 1 2 5 Van Assche Indra A. 6 Van Calsteren Kristel 6 7 van Tinteren Harm 1 van den Heuvel-Eibrink Marry M. 1 8 Amant Frédéric frederic.amant@uzleuven.be 2 9 Halaska Michael 3 Hoetink Alexander E. 1 10 1 https://ror.org/02aj7yc53 grid.487647.e Princess Máxima Center for Pediatric Oncology, 2 https://ror.org/03xqtf034 grid.430814.a 0000 0001 0674 1393 Center for Gynecologic Oncology Amsterdam, The Netherlands Cancer Institute, 3 https://ror.org/04sg4ka71 grid.412819.7 0000 0004 0611 1895 Department of Obstetrics and Gynecology, 3Rd Medical Faculty Charles University and University Hospital Kralovske Vinohrady, 4 https://ror.org/04sg4ka71 grid.412819.7 0000 0004 0611 1895 Department of Otorhinolaryngology, 3Rd Medical Faculty Charles University and University Hospital Kralovske Vinohrady, 5 https://ror.org/00bmv4102 grid.414503.7 0000 0004 0529 2508 Amsterdam UMC, Emma Children’s Hospital, 6 https://ror.org/05f950310 grid.5596.f 0000 0001 0668 7884 Department of Development and Regeneration, Unit of Woman and Child, KU Leuven, 7 https://ror.org/0424bsv16 grid.410569.f 0000 0004 0626 3338 Department of Obstetrics and Gynaecology, Unit of Foetomaternal Medicine, University Hospitals Leuven, 8 https://ror.org/05fqypv61 grid.417100.3 0000 0004 0620 3132 University Medical Center Utrecht-Wilhelmina Children’s Hospital, 9 https://ror.org/0424bsv16 grid.410569.f 0000 0004 0626 3338 Division Gynecologic Oncology, University Hospitals Leuven, UZ Gasthuisberg, 10 https://ror.org/0575yy874 grid.7692.a 0000 0000 9012 6352 Department of Otorhinolaryngology-Head and Neck Surgery, University Medical Centre Utrecht, UMC Brain Centre, 2 10 2025 2025 25 478519 703 18 12 2023 24 7 2025 02 10 2025 04 10 2025 04 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Literature on the effects of prenatal exposure to platinum-based chemotherapy on the auditory capacity of the offspring is scarce. The current study aims to describe the occurrence of hearing impairment in a well-documented series of children who underwent audiological testing. Methods An international, descriptive multicentre study using oncological, obstetrical, and neonatal data registered by the International Network of Cancer Infertility and Pregnancy database, was performed. The offspring (aged ≥ 4 years) underwent pure tone audiometry. Audiological outcomes were registered after expert review, using international standardized audiological grading as developed for platinum exposed childhood cancer patients: the Muenster criteria and the International Society for Paediatric Oncology classification. Platinum-induced hearing loss was defined as bilateral hearing loss, starting at 8 kHz and without middle ear problems confirmed by tympanometry or otoscopy. Findings Twenty-five children were included of which 17 children (68%) had been exposed to cisplatin and 8 (32%) to carboplatin, none to both. Median gestational age at start maternal treatment was 22 weeks (range, 14–31). Median gestational age at delivery was 35 weeks (range, 31–39), and median birth weight was 2345 g (range, 1526–3360). Neonatal hearing screening, performed in 10 children (40%), showed no hearing loss. At a median age of 6.0 years (range, 4.0–28 . Interpretation Antenatal exposure to platinum-based chemotherapy is associated with hearing loss in a subset of the offspring. Prospective longitudinal standardized surveillance of auditory function is advised, starting after birth. Supplementary Information The online version contains supplementary material available at 10.1186/s12887-025-05992-z. Keywords Platinum-induced hearing loss Cancer in pregnancy Cisplatin Carboplatin Audiometry http://dx.doi.org/10.13039/501100004622 KWF Kankerbestrijding 13192 http://dx.doi.org/10.13039/501100011851 Kom op tegen Kanker ZKD6005 Cooperatio program (Maternal and Childhood Care) 207035 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Research in context Evidence before this study Historically, antenatal cancer presented a medical-ethical quandary regarding the treatment of pregnant women with cancer. Studies of the International Network on Cancer, Infertility, and Pregnancy (INCIP) encompass prenatal exposure to maternal cancer, including all forms of cancer treatment. However, there remains a dearth of information regarding the effects of prenatal exposure to platinum-based chemotherapy on the auditory development of the offspring. Platinum compounds, renowned for their placental crossing and prolonged half-life, may result in elevated concentrations in the fetus, heightening the risk of developmental damage. Notably, platinum derivatives, acting as DNA cross-links inhibitors, are notorious for inducing ototoxicity. The identification of hearing loss in young children is paramount, as it significantly impacts speech-language development, often leading to social-communicative impairment and learning difficulties which can affect the quality of life in terms of emotional well-being and social interaction. Our study aims to document the occurrence of hearing impairment in a well-defined cohort of children prenatally exposed to intrauterine platinum-based therapy. Added value of this study This study marks one of the first explorations of auditory outcomes in children who were exposed to maternal platinum-based cancer treatment during prenatal development. Distinguished by its comprehensive approach, this research meticulously details the auditory impacts on children through the utilization of internationally recognized audiological classification systems, ensuring reliability and consistency in the assessment process. A key distinguishing factor is the prospective nature of data collection, setting this study apart as a pioneer in the field. We expect the results to influence the clinical decision-making process. Implications of the available evidence With a focus on platinum-treated pregnant women diagnosed with cancer and their offspring, the findings presented in this paper are poised to guide healthcare professionals. This includes aiding in treatment decisions for expectant mothers and offering valuable insights into the surveillance and intervention strategies required for their offspring. Introduction Approximately 17–25 in 100,000 pregnancies are complicated by a diagnosis of cancer [ 1 2 3 4 7 Certain cancer types that occur during pregnancy, such as cervical cancer, ovarian cancer, and oropharyngeal cancer, require platinum-based therapy including cisplatin, carboplatin or oxaliplatin as an indispensable treatment for cure [ 8 9 10 11 12 13 14 Typical platinum-induced hearing loss in cancer patients is bilateral, starts at 8 kHz (or above when extended high frequencies are measured) and extends towards the lower frequencies with increasing platinum dose, and over time. Platinum-induced hearing loss develops as a direct toxicity, shortly after exposure in both children and adolescents [ 15 16 17 20 13 21 Identifying hearing loss in young children is important, as it induces a severe negative impact on them, because of its influence on speech-language development, often leading to social-communicative impairment and learning problems [ 22 23 7 Methods Study design and participants This is a descriptive international multicenter study of the International Network on Cancer, Infertility and Pregnancy (INCIP). Children exposed in utero to cisplatin, carboplatin or oxaliplatin were eligible for inclusion. To include reliable audiological outcomes, only children (≥ 4 years) with the capability to perform high quality pure tone audiometry, were included. The ethical committee of The University Hospitals of Leuven (UZ Leuven) represents the coordinator and sponsor of this multicentre study. The Ethical Committee of UZ/KU Leuven (reference number B322201420048) approved of the study, as well as the local ethics committee of each participating center, including the ethical committee of the Erasmus Medical Center Rotterdam, the Netherlands (METC NL43546.078.13). The study was performed in accordance with the Declaration of Helsinki, and written (parental) informed consent was obtained for all participants. The full study protocol is available at https://www.cancerinpregnancy.org/study-protocols Data collection and instruments For each mother–child pair demographic, oncological, obstetrical, and neonatal data were registered within the web-based INCIP database [ 24 Audiological assessment and classifications All included subjects underwent audiological testing, consisting of pure tone audiometry (PTA). Air conduction thresholds for 0 . . 1 25 Fig. 1 Study design and recruitment Hearing assessments were graded using the standards used in pediatric cancer patients. The Muenster classification was used as a reliable method to determine early hearing impairment in children with cancer, exposed to platinum [ 26 27 26 Statistical analysis Given the limited size of the cohort and the relatively limited variation between groups, we were restrictive in the statistical comparison of the groups. We primarily provide a solid description. In addition, to make a responsible comparison between children with and without hearing loss, we report difference in means with a bootstrapped 95% confidence interval. An interval on either side of 0 indicates a non-significant difference between the two groups. Bootstrapping was performed using 1,000 resamples to derive the confidence intervals. Further descriptive statistics included numbers and percentages for categorical variables and median and ranges for continuous variables. Results Characteristics of the study children and the mothers In total, 25 children born between 1992 and 2017 (including two pairs of twins) from 3 centers in 3 countries (the Netherlands, the Czech Republic and Belgium) (Fig. 1 7 2 . . . 1 . 1 2 Table 1 Demographic characteristics of the children and disease and treatment characteristics of the mother with cancer in pregnancy Characteristic Total cohort ( N Children prenatally exposed to cisplatin ( N Children prenatally exposed to carboplatin ( N Maternal cancer during pregnancy – n (%) Cervical cancer 12 (48 . 7 (41 . 5 (62 . Ovarian cancer a 8 (32 . 7 (41 . 1 (12 . Oral cavity a 3 (12 . 1 (5 . 2 (25) Nasopharyngeal tumour 1 (4 . 1 (5 . 0 Osteosarcoma 1 (4 . 1 (5 . 0 Cancer treatment during pregnancy – n (%) Chemotherapy and surgery 21 (84 . 14 (82 . 7 (87 . Chemotherapy only 3 (12 . 3 (17 . 0 Chemotherapy and radiotherapy 1 (4 . 0 1 (12 . Type platinum – n (%) Cisplatin 17 (32 . 17 (100) 0 Carboplatin 8 (68 . 0 8 (100) Carbo and cisplatin 0 0 0 Other chemotherapeutic agent types during pregnancy – n (%) Paclitaxel 9 (36 . 3 (17 . 6 (75) 5-FU 3 (12 . 1 (5 . 2 (25) Ifosfamid 1 (4 . 1 (5 . 0 Cyclofosfamid 1 (4 . 1 (5 . 0 Doxorubicin 1 (4 . 1 (5 . 0 Bleomycin and Etoposid 1 (4 . 1 (5 . 0 Median gestational age at start platinum-based treatment (range) – weeks 22 . . . 21 . . . 22 . . . Median number of platinum cycles during pregnancy (range) 3 (2–6) 3 (2–6) 3 (2–6) Median TCD cisplatin in mg/m 2 239 (100–450) 239 (100–450) - Median TCD cisplatin in mg (range) 512 (240–748) 512 (240–748) - Median TCD carboplatin in mg/m 2 1800 (1308–2627) 1800 (1308–2627) Median TCD carboplatin in mg (range) 3039 (390–4758) 3039 (390–4758) Median gestational age at birth (range) – weeks 35 . 35 . . . 35 . . Median birth weight (range) – grams 2345 (1526–3360) 2345 (1715–3066) 2313 (1526–3360) Median age at last follow-up (range) – years 6 (4–28) 6 (6–28) 6 (4–12) Sex – number (%) Female 17 (68 . 14 (82 . 3 (37 . Male 8 (32 . 3 (17 . 5 (62 . a Table 2 Characteristics and audiological results of the included subjects Abbreviations FU GA HL NHS TCD Tymp * ** ≠ Data on these children was described before (Vandenbroucke et al., 2020) √bilateralhearing loss observed ?monaural hearing loss observed, unclear whether ototoxicity related Neonatal hearing screening had been performed in 10/13 children who all resided in the Netherlands at that time and all of them passed. Data on NHS from the Belgian and Czech children was not available. None of the 25 children had a history of ear, nose or throat problems in the general pediatric consultation, none of them had a documented genetic predisposition syndrome. The results of audiometric tests and chemotherapy exposure per case are shown in Table 2 Tympanometry was conducted in 17 out of 25 children. Results were bilaterally inconclusive in one child and unilaterally inconclusive in another (Table 2 The child with the bilaterally inconclusive tympanograms (case 06) had bilaterally the highest grading of all children (Muenster 3b and SIOP 3). The child with the unilateral inconclusive tympanogram (case 23) had a higher grading (Muenster grade 2a and SIOP 1) for the ear with the inconclusive tympanogram compared with the other ear (Muenster grade 1 and SIOP 0) with a type A tympanogram. Tympanograms in 6 children were abnormal. See supplementary Table 2 for details on the Jergers’ classification which was used to grade the tympanograms. In one child (case 01) the tympanogram was type B bilaterally, indicative for liquid filling of both middle ears; in case 19 the tympanogram was type C bilaterally, indicative of negative middle ear pressure in both middle ears; in cases 02 and 08 the tympanograms were of type C unilaterally, indicative of a negative middle ear pressure in only one middle ear; in case 22 the tympanogram was of type C in the one ear and type As in the other ear, indicative of negative middle ear pressure on one side and reduced mobility of the middle ear on the other side; in case 20 the tympanogram was of type As bilaterally, indicative for reduced mobility in both middle ears. Four children with abnormal tympanograms (cases 01, 08, 20 and 22) showed normal hearing based on the gradings. One child (case 02) with a unilateral type C tympanogram showed a higher grading on that side for the Muenster grading (2c ipsilateral versus 2a contralateral) but equal grading on both sides for SIOP (both ears SIOP 1). This child was therefore classified as having mild hearing loss. The child with bilateral type C tympanograms (case 19) showed mild hearing loss based on both Muenster and SIOP grading. Although there is a possibility that a negative middle ear pressure may have increased high frequency hearing thresholds, we classified this case as having bilateral mild hearing loss. Normal middle ear immittance was observed in 9 (36%) children (Table 2 Based on the available tympanometry data and using Muenster grade ≥ 2b and SIOP grade ≥ 2, 6/25 children (5 girls, 1 boy) revealed bilateral hearing loss in the high frequencies, all having been exposed i n utero 2 25 2 Fig. 2 A typical pattern of cisplatin-induced bilateral hearing loss (CIHL) starting at8 kHz and above, according to the international standardized classifications (Table 2 Data regarding gestational age at the start of maternal chemotherapy and total cumulative dose (cisplatin or carboplatin) in the 6 children with overt hearing loss and the group of children without bilateral hearing loss ( n Further descriptive analysis was performed on children with Muenster grade 2a and SIOP grade 1 to identify offspring with mild bilateral hearing loss. This analysis revealed 3 children with a bilaterally abnormal hearing pattern. Two children were exposed to cisplatin (TCD 200 and 300 mg/m 2 2 2 The series included two monozygotic twins. In one of the twins (cases 13 and 14) prenatally exposed to cisplatin, one child showed unilateral mild hearing loss on the left side whereas the sibling did not show hearing loss at all. In the other twins (cases 24 and 25), prenatally exposed to carboplatin, both siblings showed unilateral mild hearing loss, on the left side. For both twins tympanometry data was not available, however. Discussion In this descriptive multicenter international series, auditory outcomes were reported of 25 well-documented children prenatally exposed to platinum-based chemotherapy, suggesting that antenatal exposure to platinum-based chemotherapy is associated with hearing loss in a subset of the offspring. Only 2 small series and 1 case report on the occurrence of hearing impairment in this specific subset of children were available so far. A previous study from the INCIP Network described auditory function in children with a median age of 6 . 4 7 28 29 30 31 32 The six children, with overt hearing impairment, had all been exposed to cisplatin in utero. The median gestational age at start of treatment of patients with overt hearing loss was 26 weeks, of the two cisplatin-exposed children with mild hearing loss 21 and 30 weeks, and of children with no hearing loss 20 weeks. In the carboplatin-exposed child with mild hearing loss, maternal treatment started at a gestational age of 32 weeks. The results may indicate a trend of hearing impairment in children exposed to cisplatin in a later stage of pregnancy (Supplementary Fig. 2), which is a remarkable finding as the development of hair cells takes place around the 10th gestational week [ 9 33 14 34 36 37 13 Remarkably, all available NHS results did not show abnormalities in hearing function. Nevertheless, some of these children revealed overt hearing loss in the current study. This is conceivably explained by the fact that NHS consist of (a combination of OAEs and) Automated Auditory Brainstem Response (AABR) tests and does not detect hearing loss in the higher frequencies range (above 4 kHz). Hence, it is strongly recommended to continue monitoring hearing function as standard of care for platinum exposed children in utero, even in case the NHS test was passed. For example, by starting shortly after birth with auditory tests that also detect hearing loss in other frequencies such as Distortion Product Otoacoustic Emissions (DPOAE). DP-OAEs are clinically measured by presenting simultaneously two pure tones with frequency ration f 1 2 2 1 2 2 . We also advocate to perform age-appropriate testing in the long term auditory monitoring of children prenatally exposed to platinum-based cancer treatment such as recommended in childhood cancer survivors, since we seem to observe the same patterns of platinum-induced hearing loss as have been reported in childhood cancer patients [ 29 Our study has some limitations. Apart from the small sample size, not every audiological assessment had been performed with a concomitant tympanogram and (micro-)otoscopy to detect conductive hearing loss which may affect grading by masking the presence of sensorineural high-frequency hearing loss [ 38 13 37 . 39 Conclusion Our results may be concerning and confirm that awareness of platin-induced hearing loss in children exposed to maternal platinum-based chemotherapy is warranted. The current study, in a modest number of subjects, may suggest, that platinum-related ototoxicity in offspring, is mainly related to intrauterine expose to cisplatin. However, further studies in a larger cohort are necessary to confirm this. NHS only is not sufficient as it does not include assessment of the higher frequencies. Prospective longitudinal standardized surveillance of auditory function using international standardized classification systems, including an extensive medical history and tympanometry in combination with (micro-)otoscopy, is advised throughout young adulthood [ 38 13 40 42 Supplementary Information  Supplementary Material 1. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Evangeline A. Huis in ‘t Veld, Anna Babkova, Ľudmila Verespejova contributed equally as first authors. Frédéric Amant, Michael Halaska and Alexander E. Hoetink contributed equally as last authors. Acknowledgements The authors are grateful to Petr Waldauf, affiliated to Charles University in Prague, 3rd Medical Faculty for data analysis consulting. The authors thank the European Society of Gynaecological Oncology (ESGO) for their continued support. The ongoing in-kind support of the board of the Princess Maxima Center (Prof. dr. R. Pieters) and the Audiological department of the UMCU-(WKZ) (Prof. dr. R. Stokroos) to the national CIP-offspring outpatient clinic, is kindly acknowledged. The International Network on Cancer, Infertility and Pregnancy (INCIP) consists of researchers and clinicians from The Royal Women's Hospital Melbourne, Victoria, Private practice, N.N. Alexandrov National Cancer Center of Belarus, University Hospital Leuven, Cliniques Universitaires Saint-Luc Bruxelles, Universitair ziekenhuis Brussel, University Hospital Gent, University Hospital Antwerpen, GasthuisZusters Antwerpen, University Hospital Maria Middelares, CHR Citadelle, University Hospital Turnhout, Fundacion Valle del Lili, Cali, Oslo University Hospital-Norwegian Radium Hospital, Haukeland University Hospital, Polish Mother's Memorial Hospital-Research Institute, University Hospital of Krakow, Maria Sklodowska-Curie Memorial Cancer Center and Institute of Oncology, Poznan University of Medical Sciences, Champalimaud Clinical Centre, Centro Hospitalar Lisboa Central- Maternidade Dr. Alfredo da Costa, N.N. Petrov NMRC of Oncology, Almazov National Medical Research Centre, North-Western State Medical University named after I.I. Mechnikov Ministry of Health of Russian Federation, Research Center for Obstetrics, Gynecology and Perinatology, N.N. Blokchin National Medical Research Center of Oncology, University clinical centre of Serbia – Belgrado, University Hospital 12 Octubre, La Paz University Hospital, Vall D'hebron Hospital, Quiron-Dexeus Barcelona, University Hospital Málaga, Karolinska University Hospital, Centre Hospitalier Universitaire Vaudois (CHUV), 3rd medical faculty of Charles University Prague, university Hospital Ostrava, Copenhagen University Hospital, Praticien Hospitalo-Universitaire, University Hospital of Cologne, Universitätsklinikum Essen, Alexandra General Hospital, Euroclinic Hospital, Hippokration Hospital, Aristotle University of Thessaloniki, National University Hospital of Iceland, Fondazione IRCCS Ca'Granda Ospedale Maggiore Policlinico Milano, San Raffaele Hospital Milan, Gemelli University Hospital, Città della Salute e della Scienza di Torino, Ospedale Degli Infermi - Biella - University of Turin, Azienda Ospedaliero Universitaria Careggi, Ospedale San Gerardo, University of Udine, Policlinico San Martino-University of Genova, Kaunas University Hospital, Regional Hospital of High Specialty of Ixtapaluca, Auckland city hospital, Cancer Registry of Norway, Oslo University Hospital Rikshospitalet, Luzerner Kantonsspital, Catharina Medisch Centrum Eindhoven, University Medical Center Groningen, VU University Medical Center, Antoni Van Leeuwenhoek, Academic Medical Center Amsterdam, Maastricht University Medical Center, Erasmus Medical Center Rotterdam, University Medical Center Radboud, University Medical Center Leiden, Princes Máxima Center for pediatric oncology, University Medical Center Utrecht, National Cancer Institute, Pereira Rossell Hospital, Oxford university hospitals, Rutgers Cancer Institute of New Jersey, Baylor College of Medicine - Texas Children's Hospital, Pavilion for Women, Cooper University Hospital, Atrium Health Wake Forest Baptist Medical Center, Hospital General del Este\"Dr Domingo Luciani\". Authors’ contributions EH., AB., and LV. wrote the main manuscript text. All authors reviewed the manuscript. EH. prepared all figures. HvT supervised the analysis. FAD and AH validated the data. MvdH-E, FA, MH and AH were responsible for the supervision. Funding This research was funded by KWF Kankerbestrijding (‘CRADLE’, grant number 13192), Kom op Tegen Kanker (‘Cancer Treatment During Pregnancy’, ZKD6005) and Cooperatio program (Maternal and Childhood Care, 207035). These organizations had no involvement in the design, writing, editing of, or decision to submit this manuscript. Data availability All data generated or analysed during this study are included in this published article [and its supplementary information files]. Declarations Ethics approval and consent to participate The ethical committee of each participating institution (Netherlands, Czech Republic and Belgium) approved of the study and written (parental) informed consent was obtained for each child. The full study protocol is available at https://www.cancerinpregnancy.org/study-protocols Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Parazzini F Franchi M Tavani A Negri E Peccatori FA Frequency of pregnancy related cancer: a population based linkage study in Lombardy, Italy Int J Gynecol Cancer 2017 27 3 613 619 10.1097/IGC.0000000000000904 28107260 Parazzini F, Franchi M, Tavani A, Negri E, Peccatori FA. Frequency of pregnancy related cancer: a population based linkage study in Lombardy, Italy. Int J Gynecol Cancer. 2017;27(3):613–9. 28107260 10.1097/IGC.0000000000000904 2. Amant F Han SN Gziri MM Vandenbroucke T Verheecke M Van Calsteren K Management of cancer in pregnancy Best Pract Res Clin Obstet Gynaecol 2015 29 5 741 753 10.1016/j.bpobgyn.2015.02.006 25797199 Amant F, Han SN, Gziri MM, Vandenbroucke T, Verheecke M, Van Calsteren K. Management of cancer in pregnancy. Best Pract Res Clin Obstet Gynaecol. 2015;29(5):741–53. 25797199 10.1016/j.bpobgyn.2015.02.006 3. Boere I Lok C Vandenbroucke T Amant F Cancer in pregnancy: safety and efficacy of systemic therapies Curr Opin Oncol 2017 29 5 328 334 10.1097/CCO.0000000000000386 28614135 Boere I, Lok C, Vandenbroucke T, Amant F. Cancer in pregnancy: safety and efficacy of systemic therapies. Curr Opin Oncol. 2017;29(5):328–34. 28614135 10.1097/CCO.0000000000000386 4. Amant F Van Calsteren K Halaska MJ Gziri MM Hui W Lagae L Long-term cognitive and cardiac outcomes after prenatal exposure to chemotherapy in children aged 18 months or older: an observational study Lancet Oncol 2012 13 3 256 264 10.1016/S1470-2045(11)70363-1 22326925 Amant F, Van Calsteren K, Halaska MJ, Gziri MM, Hui W, Lagae L, et al. Long-term cognitive and cardiac outcomes after prenatal exposure to chemotherapy in children aged 18 months or older: an observational study. Lancet Oncol. 2012;13(3):256–64. 22326925 10.1016/S1470-2045(11)70363-1 5. Amant F Vandenbroucke T Verheecke M Fumagalli M Halaska MJ Boere I Pediatric outcome after maternal cancer diagnosed during pregnancy N Engl J Med 2015 373 19 1824 1834 10.1056/NEJMoa1508913 26415085 Amant F, Vandenbroucke T, Verheecke M, Fumagalli M, Halaska MJ, Boere I, et al. Pediatric outcome after maternal cancer diagnosed during pregnancy. N Engl J Med. 2015;373(19):1824–34. 26415085 10.1056/NEJMoa1508913 6. Blommaert J Radwan A Sleurs C Maggen C van Gerwen M Wolters V The impact of cancer and chemotherapy during pregnancy on child neurodevelopment: a multimodal neuroimaging analysis EClinicalMedicine 2020 28 100598 10.1016/j.eclinm.2020.100598 33294813 PMC7700909 Blommaert J, Radwan A, Sleurs C, Maggen C, van Gerwen M, Wolters V, et al. The impact of cancer and chemotherapy during pregnancy on child neurodevelopment: a multimodal neuroimaging analysis. EClinicalMedicine. 2020;28:100598. 33294813 10.1016/j.eclinm.2020.100598 PMC7700909 7. Vandenbroucke T Verheecke M van Gerwen M Van Calsteren K Halaska MJ Fumagalli M Child development at 6 years after maternal cancer diagnosis and treatment during pregnancy Eur J Cancer 2020 138 57 67 10.1016/j.ejca.2020.07.004 32858478 PMC7532701 Vandenbroucke T, Verheecke M, van Gerwen M, Van Calsteren K, Halaska MJ, Fumagalli M, et al. Child development at 6 years after maternal cancer diagnosis and treatment during pregnancy. Eur J Cancer. 2020;138:57–67. 32858478 10.1016/j.ejca.2020.07.004 PMC7532701 8. Maggen C, van Gerwen M, Van Calsteren K, Vandenbroucke T, Amant F. Management of cancer during pregnancy and current evidence of obstetric, neonatal and pediatric outcome: a review article. Int J Gynecol Cancer. 2019;29(2):404–16. 10.1136/ijgc-2018-000061 30659032 9. Van Calsteren K Verbesselt R Van Bree R Heyns L de Bruijn E de Hoon J Substantial variation in transplacental transfer of chemotherapeutic agents in a mouse model Reprod Sci 2011 18 1 57 63 10.1177/1933719110379650 20826505 Van Calsteren K, Verbesselt R, Van Bree R, Heyns L, de Bruijn E, de Hoon J, et al. Substantial variation in transplacental transfer of chemotherapeutic agents in a mouse model. Reprod Sci. 2011;18(1):57–63. 20826505 10.1177/1933719110379650 10. Sheth S Mukherjea D Rybak LP Ramkumar V Mechanisms of cisplatin-induced ototoxicity and otoprotection Front Cell Neurosci 2017 11 338 10.3389/fncel.2017.00338 29163050 PMC5663723 Sheth S, Mukherjea D, Rybak LP, Ramkumar V. Mechanisms of cisplatin-induced ototoxicity and otoprotection. Front Cell Neurosci. 2017;11:338. 29163050 10.3389/fncel.2017.00338 PMC5663723 11. Siddik ZH Cisplatin: mode of cytotoxic action and molecular basis of resistance Oncogene 2003 22 47 7265 7279 10.1038/sj.onc.1206933 14576837 Siddik ZH. Cisplatin: mode of cytotoxic action and molecular basis of resistance. Oncogene. 2003;22(47):7265–79. 14576837 10.1038/sj.onc.1206933 12. Rabik CA Dolan ME Molecular mechanisms of resistance and toxicity associated with platinating agents Cancer Treat Rev 2007 33 1 9 23 10.1016/j.ctrv.2006.09.006 17084534 PMC1855222 Rabik CA, Dolan ME. Molecular mechanisms of resistance and toxicity associated with platinating agents. Cancer Treat Rev. 2007;33(1):9–23. 17084534 10.1016/j.ctrv.2006.09.006 PMC1855222 13. Clemens E de Vries AC Pluijm SF Am Zehnhoff-Dinnesen A Tissing WJ Loonen JJ Determinants of ototoxicity in 451 platinum-treated Dutch survivors of childhood cancer: a DCOG late-effects study Eur J Cancer 2016 69 77 85 10.1016/j.ejca.2016.09.023 27821322 Clemens E, de Vries AC, Pluijm SF, Am Zehnhoff-Dinnesen A, Tissing WJ, Loonen JJ, et al. Determinants of ototoxicity in 451 platinum-treated Dutch survivors of childhood cancer: a DCOG late-effects study. Eur J Cancer. 2016;69:77–85. 27821322 10.1016/j.ejca.2016.09.023 14. Clemens E van den Heuvel-Eibrink MM Mulder RL Kremer LCM Hudson MM Skinner R Recommendations for ototoxicity surveillance for childhood, adolescent, and young adult cancer survivors: a report from the International Late Effects of Childhood Cancer Guideline Harmonization Group in collaboration with the PanCare Consortium Lancet Oncol 2019 20 1 e29 e41 10.1016/S1470-2045(18)30858-1 30614474 PMC7549756 Clemens E, van den Heuvel-Eibrink MM, Mulder RL, Kremer LCM, Hudson MM, Skinner R, et al. Recommendations for ototoxicity surveillance for childhood, adolescent, and young adult cancer survivors: a report from the International Late Effects of Childhood Cancer Guideline Harmonization Group in collaboration with the PanCare Consortium. Lancet Oncol. 2019;20(1):e29–41. 30614474 10.1016/S1470-2045(18)30858-1 PMC7549756 15. Travis LB, Fossa SD, Sesso HD, Frisina RD, Herrmann DN, Beard CJ, et al. Chemotherapy-induced peripheral neurotoxicity and ototoxicity: new paradigms for translational genomics. J Nat Cancer Inst. 2014;106(5):dju044. 10.1093/jnci/dju044 PMC4568989 24623533 16. Qaddoumi I Bass JK Wu J Billups CA Wozniak AW Merchant TE Carboplatin-associated ototoxicity in children with retinoblastoma J Clin Oncol 2012 30 10 1034 1041 10.1200/JCO.2011.36.9744 22370329 PMC3341147 Qaddoumi I, Bass JK, Wu J, Billups CA, Wozniak AW, Merchant TE, et al. Carboplatin-associated ototoxicity in children with retinoblastoma. J Clin Oncol. 2012;30(10):1034–41. 22370329 10.1200/JCO.2011.36.9744 PMC3341147 17. Meijer AJM Li KH Brooks B Clemens E Ross CJ Rassekh SR The cumulative incidence of cisplatin-induced hearing loss in young children is higher and develops at an early stage during therapy compared with older children based on 2052 audiological assessments Cancer 2022 128 1 169 179 10.1002/cncr.33848 34490624 Meijer AJM, Li KH, Brooks B, Clemens E, Ross CJ, Rassekh SR, et al. The cumulative incidence of cisplatin-induced hearing loss in young children is higher and develops at an early stage during therapy compared with older children based on 2052 audiological assessments. Cancer. 2022;128(1):169–79. 34490624 10.1002/cncr.33848 18. Brock PR Maibach R Childs M Rajput K Roebuck D Sullivan MJ Sodium thiosulfate for protection from cisplatin-induced hearing loss N Engl J Med 2018 378 25 2376 2385 10.1056/NEJMoa1801109 29924955 PMC6117111 Brock PR, Maibach R, Childs M, Rajput K, Roebuck D, Sullivan MJ, et al. Sodium thiosulfate for protection from cisplatin-induced hearing loss. N Engl J Med. 2018;378(25):2376–85. 29924955 10.1056/NEJMoa1801109 PMC6117111 19. Freyer DR Chen L Krailo MD Knight K Villaluna D Bliss B Effects of sodium thiosulfate versus observation on development of cisplatin-induced hearing loss in children with cancer (ACCL0431): a multicentre, randomised, controlled, open-label, phase 3 trial Lancet Oncol 2017 18 1 63 74 10.1016/S1470-2045(16)30625-8 27914822 PMC5520988 Freyer DR, Chen L, Krailo MD, Knight K, Villaluna D, Bliss B, et al. Effects of sodium thiosulfate versus observation on development of cisplatin-induced hearing loss in children with cancer (ACCL0431): a multicentre, randomised, controlled, open-label, phase 3 trial. Lancet Oncol. 2017;18(1):63–74. 27914822 10.1016/S1470-2045(16)30625-8 PMC5520988 20. Knight KR Chen L Freyer D Aplenc R Bancroft M Bliss B Group-wide, prospective study of ototoxicity assessment in children receiving cisplatin chemotherapy (ACCL05C1): a report from the children's oncology group J Clin Oncol 2017 35 4 440 445 10.1200/JCO.2016.69.2319 27937095 PMC5455699 Knight KR, Chen L, Freyer D, Aplenc R, Bancroft M, Bliss B, et al. Group-wide, prospective study of ototoxicity assessment in children receiving cisplatin chemotherapy (ACCL05C1): a report from the children’s oncology group. J Clin Oncol. 2017;35(4):440–5. 27937095 10.1200/JCO.2016.69.2319 PMC5455699 21. Terheggen PM Begg AC Emondt JY Dubbelman R Floot BG den Engelse L Formation of interaction products of carboplatin with DNA in vitro and in cancer patients Br J Cancer 1991 63 2 195 200 10.1038/bjc.1991.48 1997096 PMC1971771 Terheggen PM, Begg AC, Emondt JY, Dubbelman R, Floot BG, den Engelse L. Formation of interaction products of carboplatin with DNA in vitro and in cancer patients. Br J Cancer. 1991;63(2):195–200. 1997096 10.1038/bjc.1991.48 PMC1971771 22. Landier W Knight K Wong FL Lee J Thomas O Kim H Ototoxicity in children with high-risk neuroblastoma: prevalence, risk factors, and concordance of grading scales–a report from the children's oncology group J Clin Oncol 2014 32 6 527 534 10.1200/JCO.2013.51.2038 24419114 PMC3918536 Landier W, Knight K, Wong FL, Lee J, Thomas O, Kim H, et al. Ototoxicity in children with high-risk neuroblastoma: prevalence, risk factors, and concordance of grading scales–a report from the children’s oncology group. J Clin Oncol. 2014;32(6):527–34. 24419114 10.1200/JCO.2013.51.2038 PMC3918536 23. Rajput K Edwards L Brock P Abiodun A Simpkin P Al-Malky G Ototoxicity-induced hearing loss and quality of life in survivors of paediatric cancer Int J Pediatr Otorhinolaryngol 2020 138 110401 10.1016/j.ijporl.2020.110401 33152988 Rajput K, Edwards L, Brock P, Abiodun A, Simpkin P, Al-Malky G. Ototoxicity-induced hearing loss and quality of life in survivors of paediatric cancer. Int J Pediatr Otorhinolaryngol. 2020;138:110401. 33152988 10.1016/j.ijporl.2020.110401 24. Harvey LA REDCap: web-based software for all types of data storage and collection Spinal Cord 2018 56 7 625 10.1038/s41393-018-0169-9 29977003 Harvey LA. REDCap: web-based software for all types of data storage and collection. Spinal Cord. 2018;56(7):625. 29977003 10.1038/s41393-018-0169-9 25. Jerger J Clinical experience with impedance audiometry Arch Otolaryngol 1970 92 4 311 324 10.1001/archotol.1970.04310040005002 5455571 Jerger J. Clinical experience with impedance audiometry. Arch Otolaryngol. 1970;92(4):311–24. 5455571 10.1001/archotol.1970.04310040005002 26. Brock PR Knight KR Freyer DR Campbell KC Steyger PS Blakley BW Platinum-induced ototoxicity in children: a consensus review on mechanisms, predisposition, and protection, including a new International Society of Pediatric Oncology Boston ototoxicity scale J Clin Oncol 2012 30 19 2408 2417 10.1200/JCO.2011.39.1110 22547603 PMC3675696 Brock PR, Knight KR, Freyer DR, Campbell KC, Steyger PS, Blakley BW, et al. Platinum-induced ototoxicity in children: a consensus review on mechanisms, predisposition, and protection, including a new International Society of Pediatric Oncology Boston ototoxicity scale. J Clin Oncol. 2012;30(19):2408–17. 22547603 10.1200/JCO.2011.39.1110 PMC3675696 27. Schmidt CM Bartholomaus E Deuster D Heinecke A Dinnesen AG The \"Muenster classification\" of high frequency hearing loss following cisplatin chemotherapy HNO 2007 55 4 299 306 10.1007/s00106-005-1368-1 16437215 Schmidt CM, Bartholomaus E, Deuster D, Heinecke A, Dinnesen AG. The “Muenster classification” of high frequency hearing loss following cisplatin chemotherapy. HNO. 2007;55(4):299–306. 16437215 10.1007/s00106-005-1368-1 28. Geijteman ECT Wensveen CWM Duvekot JJ van Zuylen L A child with severe hearing loss associated with maternal cisplatin treatment during pregnancy Obstet Gynecol 2014 124 2 Pt 2 Suppl 1 454 456 10.1097/AOG.0000000000000389 25004323 Geijteman ECT, Wensveen CWM, Duvekot JJ, van Zuylen L. A child with severe hearing loss associated with maternal cisplatin treatment during pregnancy. Obstet Gynecol. 2014;124(2 Pt 2 Suppl 1):454–6. 25004323 10.1097/AOG.0000000000000389 29. Knight KR Kraemer DF Neuwelt EA Ototoxicity in children receiving platinum chemotherapy: underestimating a commonly occurring toxicity that may influence academic and social development J Clin Oncol 2005 23 34 8588 8596 10.1200/JCO.2004.00.5355 16314621 Knight KR, Kraemer DF, Neuwelt EA. Ototoxicity in children receiving platinum chemotherapy: underestimating a commonly occurring toxicity that may influence academic and social development. J Clin Oncol. 2005;23(34):8588–96. 16314621 10.1200/JCO.2004.00.5355 30. Aquino VM Fort DW Kamen BA Carboplatin for the treatment of children with newly diagnosed optic chiasm gliomas: a phase II study J Neurooncol 1999 41 3 255 259 10.1023/A:1006149809479 10359145 Aquino VM, Fort DW, Kamen BA. Carboplatin for the treatment of children with newly diagnosed optic chiasm gliomas: a phase II study. J Neurooncol. 1999;41(3):255–9. 10359145 10.1023/a:1006149809479 31. Kim SB Kim SY Kim KH Kim TN Oxaliplatin-induced sudden hearing loss in a patient with pancreatic cancer Korean J Gastroenterol 2020 76 5 261 264 10.4166/kjg.2020.121 33234775 PMC12286459 Kim SB, Kim SY, Kim KH, Kim TN. Oxaliplatin-induced sudden hearing loss in a patient with pancreatic cancer. Korean J Gastroenterol. 2020;76(5):261–4. 33234775 10.4166/kjg.2020.121 PMC12286459 32. Budai B Prekopp P Noszek L Kovacs ER Szonyi M Erdelyi DJ GSTM1 null and GSTT1 null: predictors of cisplatin-caused acute ototoxicity measured by DPOAEs J Mol Med (Berl) 2020 98 7 963 971 10.1007/s00109-020-01921-y 32435918 PMC7343745 Budai B, Prekopp P, Noszek L, Kovacs ER, Szonyi M, Erdelyi DJ, et al. GSTM1 null and GSTT1 null: predictors of cisplatin-caused acute ototoxicity measured by DPOAEs. J Mol Med (Berl). 2020;98(7):963–71. 32435918 10.1007/s00109-020-01921-y PMC7343745 33. Al-Saleh E Al-Harmi J Nandakumaran M Al-Shammari M Transport kinetics of cisplatin in the perfused human placental lobule in vitro J Matern Fetal Neonatal Med 2008 21 10 726 731 10.1080/14767050802276542 19012189 Al-Saleh E, Al-Harmi J, Nandakumaran M, Al-Shammari M. Transport kinetics of cisplatin in the perfused human placental lobule in vitro. J Matern Fetal Neonatal Med. 2008;21(10):726–31. 19012189 10.1080/14767050802276542 34. Rybak LP Mukherjea D Jajoo S Ramkumar V Cisplatin ototoxicity and protection: clinical and experimental studies Tohoku J Exp Med 2009 219 3 177 186 10.1620/tjem.219.177 19851045 PMC2927105 Rybak LP, Mukherjea D, Jajoo S, Ramkumar V. Cisplatin ototoxicity and protection: clinical and experimental studies. Tohoku J Exp Med. 2009;219(3):177–86. 19851045 10.1620/tjem.219.177 PMC2927105 35. Hill GW Morest DK Parham K Cisplatin-induced ototoxicity: effect of intratympanic dexamethasone injections Otol Neurotol 2008 29 7 1005 1011 10.1097/MAO.0b013e31818599d5 18716567 PMC2720789 Hill GW, Morest DK, Parham K. Cisplatin-induced ototoxicity: effect of intratympanic dexamethasone injections. Otol Neurotol. 2008;29(7):1005–11. 18716567 10.1097/MAO.0b013e31818599d5 PMC2720789 36. Marshak T Steiner M Kaminer M Levy L Shupak A Prevention of cisplatin-induced hearing loss by intratympanic dexamethasone: a randomized controlled study Otolaryngol Head Neck Surg 2014 150 6 983 990 10.1177/0194599814524894 24618499 Marshak T, Steiner M, Kaminer M, Levy L, Shupak A. Prevention of cisplatin-induced hearing loss by intratympanic dexamethasone: a randomized controlled study. Otolaryngol Head Neck Surg. 2014;150(6):983–90. 24618499 10.1177/0194599814524894 37. Diepstraten FA Hoetink AE van Grotel M Huitema ADR Stokroos RJ van den Heuvel-Eibrink MM Aminoglycoside- and glycopeptide-induced ototoxicity in children: a systematic review JAC-Antimicrobial Resistance 2021 3 4 dlab184 10.1093/jacamr/dlab184 34917943 PMC8669239 Diepstraten FA, Hoetink AE, van Grotel M, Huitema ADR, Stokroos RJ, van den Heuvel-Eibrink MM, et al. Aminoglycoside- and glycopeptide-induced ototoxicity in children: a systematic review. JAC-Antimicrobial Resistance. 2021;3(4):dlab184. 34917943 10.1093/jacamr/dlab184 PMC8669239 38. Meijer AJM van den Heuvel-Eibrink MM Brooks B Am Zehnhoff-Dinnesen AG Knight KR Freyer DR Recommendations for age-appropriate testing, timing, and frequency of audiologic monitoring during childhood cancer treatment: an international society of paediatric oncology supportive care consensus report JAMA Oncol 2021 7 10 1550 1558 10.1001/jamaoncol.2021.2697 34383016 Meijer AJM, van den Heuvel-Eibrink MM, Brooks B, Am Zehnhoff-Dinnesen AG, Knight KR, Freyer DR, et al. Recommendations for age-appropriate testing, timing, and frequency of audiologic monitoring during childhood cancer treatment: an international society of paediatric oncology supportive care consensus report. JAMA Oncol. 2021;7(10):1550–8. 34383016 10.1001/jamaoncol.2021.2697 39. Hille ET van Straaten HI Verkerk PH Dutch NNHSWG Prevalence and independent risk factors for hearing loss in NICU infants Acta Paediatr. 2007 96 8 1155 8 10.1111/j.1651-2227.2007.00398.x 17655618 Hille ET, van Straaten HI, Verkerk PH, Dutch NNHSWG. Prevalence and independent risk factors for hearing loss in NICU infants. Acta Paediatr. 2007;96(8):1155–8. 17655618 10.1111/j.1651-2227.2007.00398.x 40. Wheeler HE Gamazon ER Frisina RD Perez-Cervantes C El Charif O Mapes B Variants in WFS1 and other mendelian deafness genes are associated with cisplatin-associated ototoxicity Clin Cancer Res 2017 23 13 3325 3333 10.1158/1078-0432.CCR-16-2809 28039263 PMC5493516 Wheeler HE, Gamazon ER, Frisina RD, Perez-Cervantes C, El Charif O, Mapes B, et al. Variants in WFS1 and other mendelian deafness genes are associated with cisplatin-associated ototoxicity. Clin Cancer Res. 2017;23(13):3325–33. 28039263 10.1158/1078-0432.CCR-16-2809 PMC5493516 41. Clemens E van der Kooi ALF Broer L van Dulmen-den BE Visscher H Kremer L The influence of genetic variation on late toxicities in childhood cancer survivors: a review Crit Rev Oncol Hematol 2018 126 154 167 10.1016/j.critrevonc.2018.04.001 29759558 Clemens E, van der Kooi ALF, Broer L, van Dulmen-den BE, Visscher H, Kremer L, et al. The influence of genetic variation on late toxicities in childhood cancer survivors: a review. Crit Rev Oncol Hematol. 2018;126:154–67. 29759558 10.1016/j.critrevonc.2018.04.001 42. Meijer AJM Diepstraten FA Langer T Broer L Domingo IK Clemens E TCERG1L allelic variation is associated with cisplatin-induced hearing loss in childhood cancer, a PanCareLIFE study NPJ Precis Oncol 2021 5 1 64 10.1038/s41698-021-00178-z 34262104 PMC8280110 Meijer AJM, Diepstraten FA, Langer T, Broer L, Domingo IK, Clemens E, et al. TCERG1L allelic variation is associated with cisplatin-induced hearing loss in childhood cancer, a PanCareLIFE study. NPJ Precis Oncol. 2021;5(1):64. 34262104 10.1038/s41698-021-00178-z PMC8280110 ",
  "metadata": {
    "Title of this paper": "TCERG1L allelic variation is associated with cisplatin-induced hearing loss in childhood cancer, a PanCareLIFE study",
    "Journal it was published in:": "BMC Pediatrics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12492882/"
  }
}