{
  "title": "Paper_408",
  "abstract": "pmc J Appl Clin Med Phys J Appl Clin Med Phys 3200 jacmp ACM2 Journal of Applied Clinical Medical Physics 1526-9914 Wiley PMC12481828 PMC12481828.1 12481828 12481828 41025882 10.1002/acm2.70199 ACM270199 1 Research Article RADIATION ONCOLOGY PHYSICS Research Article Characterizing geometrical distortions in MRI for radiotherapy: Evaluating MR‐SIM protocols and dose accuracy in stereotactic radiosurgery using AAPM TG‐284 criteria BARZEGAR et al. Barzegar Mojtaba https://orcid.org/0000-0002-3467-9109  1  2 Mbarzegar@hamad.qa Rostami Aram  1 Mkanna Abbass Yousef  1 Torfeh Tarraf  1 Paloor Satheesh Prasad  1 Basith Ahamed  1 Aouadi Souha https://orcid.org/0000-0002-9839-2908  1 Hammoud Rabih  1 Rhammoud2@hamad.qa Al Hammadi Noora  1   1 Radiation Oncology Department National Center for Cancer Care and Research Doha Qatar   2 Society for Brain Mapping and Therapeutic Los Angles California USA * Correspondence Mbarzegar@hamad.qa Rhammoud2@hamad.qa 30 9 2025 10 2025 26 10 497070 10.1002/acm2.v26.10 e70199 18 5 2025 02 1 2025 01 7 2025 30 09 2025 01 10 2025 01 10 2025 © 2025 The Author(s). Journal of Applied Clinical Medical Physics https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Objective Magnetic resonance imaging (MRI) is crucial for diagnostic imaging and radiotherapy (RT) planning due to its superior soft tissue contrast. However, geometric distortions can affect treatment accuracy. This study evaluates the geometric accuracy of MRI protocols using a 1.5T MR‐Sim scanner for RT and their dosimetric impacts. Materials and Methods Geometric distortion was assessed using the CIRS 604‐GS MR Image Distortion Phantom with 2152 control points across various MRI sequences. A central cubic structure and surrounding regions were analyzed, totaling 27 structures. Rigid registration in Eclipse V18.1 aligned MRI images to CT images, with verified accuracy and visual inspection. An evaluation of the overlap and surface distance metrics was performed through MIM Mastro. Geometric distortion was quantified using 3D distortion analysis software, comparing marker coordinates to reference CT scans. Twenty‐seven VMAT full arc plans were done in Eclipse on 27 paired structures, irradiated with 16 Gy in a single fraction at 6 MV energy using the Acuros XB algorithm Results All 3D sequences demonstrated mean distortions of 0.4–0.5 mm, with maximum distortions of up to 3.3 mm in the TOF (time of flight) Angiography sequence. In contrast, the T2 TSE 2D sequence showed larger distortions (mean 1.4 mm, max. 9.7 mm). The center structure showed stable dosimetric performance (D mean normalized 95% Conclusion Precise MR protocols are essential for accurate tumor delineation and RT planning. While all sequences showed acceptable accuracy, 3D sequences are superior for high‐precision RT. dosimetric impact MR geometric distortion SRS pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:30.09.2025  Barzegar M Rostami A Mkanna AY Characterizing geometrical distortions in MRI for radiotherapy: Evaluating MR‐SIM protocols and dose accuracy in stereotactic radiosurgery using AAPM TG‐284 criteria J Appl Clin Med Phys 2025 26 e70199 10.1002/acm2.70199 1 INTRODUCTION Magnetic resonance imaging (MRI) has become an indispensable tool in medical imaging, serving as a cornerstone in both diagnostic imaging and radiotherapy (RT) planning.  1  2 Although MRI can provide detailed information about healthy organs and tumor boundaries, the geometric accuracy of these boundaries can be compromised by distortions due to static magnetic field inhomogeneity, gradient field nonlinearity, tissue magnetic susceptibility, and chemical shift artifacts. RT relies heavily on precise imaging for tumor delineation, as even minor distortions can lead to misdiagnosis or improper treatment of lesions. These images are crucial for ensuring that the prescribed dose is precisely delivered to the targeted lesions.  3 The extent of these distortions varies depending on the MRI system, the type of sequences, and the specific sequence parameters.  4  5 However, reliance on MRI can lead to geometric inaccuracies that may affect dose distribution and compromise treatment safety. This issue becomes particularly critical in advanced RT techniques, such as stereotactic radiosurgery (SRS) for the treatment of AVMs (arteriovenous malformation) and brain metastases, which deliver high doses in just a few sessions.  3  6  7  8  9  10  11  12  13  14 Given these high stakes, maintaining the highest possible geometrical fidelity in MRI is essential for achieving the best clinical outcomes in RT.  5  15  16 2 MATERIALS AND METHODS 2.1 Phantom and MRI equipment A resolute CIRS Model 604‐GS Large Field MR Image Distortion Phantom (Sun Nuclear, Virginia, USA) was employed in this study. This liquid‐fillable acrylic phantom has an outer diameter of 356 mm, a length of 300 mm, and a height of 270 mm, featuring a proprietary 3D grid structure of 3 mm diameter rods arranged orthogonally. With 2152 control points per CAD model, it enables comprehensive distortion assessment beyond 2D phantoms. The phantom material has a mean Hounsfield unit (HU) value of 273 ± 5 and a relative electron density (RED) of 1.19, ensuring accurate dose calculations. It allows for evaluating image distortions arising from B₀ inhomogeneity, gradient nonlinearity, chemical shift, and susceptibility artifacts. The study employed a wide bore (70 cm) 1.5T GE‐MR SIGNA Artist (GE Healthcare, Milwaukee, Wisconsin, USA) scanner used for RT simulation. For CT image acquisition, we employed a Siemens SOMATOM Definition AS (Siemens Healthcare GmbH, Erlangen, Germany) scanner (64‐slice, dual‐source configuration), which provides high‐resolution imaging essential for accurate target delineation, and stable HU consistency. 2.2 Imaging procedure Prior to scanning, all relevant quality assurance (QA) tests for MRI (AAPM TG‐284)‐ including central frequency of the magnetic field verification and B 0 2.2.1 MR‐Sim imaging For 3D QA scans, the phantom's crosshair was meticulously aligned with the isocenter. Each sequence and its parameters listed in Table 1  20 TABLE 1 MRI sequences and parameters for CyberKnife applications at 1.5T. MR sequence TR (ms) TE (ms) BW (Hz/Px) Thickness (mm) Acquisition matrix size Acceleration: HyperSense*Phase Total time Name Type T1 MPRAGE 3D SPGR 2438 2.7 220 0.6 224*224 1.0* 2.0 3’50” T2 FLAIR 3D SE_IR 5500 89 220 0.6 256*256 1.2* 2.0 4’28” T2 Cube 3D Brain SE 2500 100 220 0.6 256*256 1.0* 2.0 3’58” T2 Cube 3D Spine SE 2000 90 220 0.5 288*288 2.0* 2.0 4’07” TOF MRA (AVM) SPGR 24 2.3 220 0.5 360*360 2.0* 2.0 5’23” T2 TSE Tra 2D TSE 7739 97 220 3.0 256*256 1.0* 3.0 5’02” Abbreviations: Px.BW, pixel bandwidth; SE_IR, Spin Echo Inversion Recovery; SE, Spin Echo; SPGR, Spoiled Gradient Echo; TSE, Turbo Spin Echo; TR, repetition time, TE, echo time. John Wiley & Sons, Ltd. 2.2.2 Geometric correction option In GE MR scanners, during imaging, the 3D geometrical correction option should be used to minimize the geometrical inaccuracy. This 3D geometric correction option compensates for distortions by mapping coordinates from the distorted image space ( x 0 y 0 z 0 x y z 0 1 (1) x y z = x 0 y 0 z 0 + ∑ l = 0 L ∑ m = − l l a l m . Y l m θ , ∅  x y z  x 0 y 0 z 0  a l m  Y l m ( θ , ∅ )  l m L This transformation adjusts the distorted coordinates ( x 0 y 0 z 0 2.2.3 CT‐Sim imaging For CT simulations, a flat overlay patient couch top specifically designed for RT was used to minimize positioning uncertainties. The phantom was aligned using an external laser system with crosshairs to ensure precise alignment with the machine isocenter. By following clinical positioning protocols, setup consistency was ensured, and potential uncertainties were minimized across imaging sessions. CT images acquired in helical mode at 140 kVp, 220 mA, 400 mAs, and a slice thickness of 0.6 mm with a 512 × 512 acquisition matrix, served as the gold standard reference. 2.3 Image processing, registration, and contouring To investigate the impact of geometric distortions on dose distribution, three central cubic structures were added at the isocenter (X = 0, Y = 0, Z = 3 1 FIGURE 1 Contoured structures in various positions surrounding the central structures; Note that the center structure is located precisely at the isocenter of the phantom/magnet. The coordinate system follows the radiotherapy convention: X (L–R), Y (A–P), and Z (Sup‐Inf). For contouring, each structure was delineated by connecting points along the edges and boundaries. The process involved manually identifying control points on each structure, followed by interpolation to connect the points and reconstruct the 3D volume of the structures. This approach ensured precise delineation of each volume within the phantom, accounting for potential geometric distortions and allowing for accurate evaluation of their impact on dose distribution. The challenges in merging MRI and CT data primarily arise from patient (phantom) positioning and scan parameters. MRI–CT registration addresses the lack of electron density information in MR‐based RT by spatially aligning MR and CT images. Once co‐registered, the voxel information from both modalities is combined. Most co‐registration techniques treat the imaged volume as a rigid body, and the transformation of coordinates is represented by a linear, spatially invariant function (Equation 2 (2) r 1 = A . r 2 + b  r”  A”  b” Rigid image registration was performed using the image registration module in Eclipse V18.1 (Varian Medical Systems Inc., Palo Alto, CA), with MRI images initially aligned to the reference CT images. Image rigid registration can be performed automatically or manually. Manual registration uses fiducial points, typically requiring at least eight points for accuracy, while automated employs automatic algorithms. Landmark selection is critical, ensuring widely spaced points for precise registration. Accuracy of registration was verified through “target registration error” option in the Eclipse software with point pairs as well as visual inspection according to the recommendations of AAPM TG‐132.  17 2 FIGURE 2 Image scans showing a set of contours for CT (top) and MR (bottom) in three orthogonal planes intersecting at the isocenter for the 3D MR phantom shown on the left. In this study, volume contouring accuracy was evaluated through MIM Maestro (MIM Software Inc., Cleveland, OH, USA) using three contour similarity metrics: Dice Similarity Coefficient (DSC), Jaccard Index (J), and Hausdorff Distance (HD). DSC measures the spatial overlap between two contours, ranging from 0 (no overlap) to 1 (perfect overlap). The Jaccard index, a metric like DSC, quantifies the percentage of overlap between two regions relative to their combined area, where values closer to one indicate better agreement in Equations ( 3 4 (3) D S C A , B = 2 A ∩ B A + B (4) J A , B = A ∩ B A ∪ B = DS C A , B 2 − DS C A , B | A ∩ B | A B | A ∪ B |  A  B  19 2.4 3D absolute geometrical distortion Geometric distortion analysis was conducted using CIRS’ Distortion Check software. This software compares the detected marker coordinates from the 3D MRI scans to their reference positions in the CT space, generating detailed 3D distortion vector fields. To account for global positioning offsets, the software applied a registration step before computing the distortion values. The absolute geometric distortion (GD) corresponding to each control point is given by Equation ( 5 (5) G D = ( x 1 − x r e f ) 2 + ( y 1 − y r e f ) 2 + ( z 1 − z r e f ) 2 3  ( x 1 , y 1 , z 1 )  ( x r e f , y r e f , z r e f ) FIGURE 3 Image display of expected (orange) and measured (blue) control points. The spatial deviation between these points represents the measured distortion within the image volume. The user interface and backend processing pipeline of the software are shown in Figure 4  18 FIGURE 4 Flowchart of the distortion measurement method. 2.5 Distortion by outer radius To evaluate the variation in maximum and mean total image distortion relative to the image volume, the outer radius of a spherical band was used as a reference. This approach involved analyzing distortions at increasing distances from the isocenter, ranging from 10 to 160 mm, within spherical bands. The maximum distortion represents the worst‐case error, while the mean distortion provides an average error within each band. By studying these distortions across different MRI sequences commonly used in the CK protocol, the analysis highlights how distortions increase with distance from the isocenter and vary depending on the sequence parameters. This helps in understanding and potentially correcting distortion patterns to improve imaging accuracy. 2.6 External beam planning To assess the dosimetric impact of observed distortions, a highly conformal volumetric modulated arc therapy (VMAT) technique was used, utilizing a single full mono‐isocentric coplanar arc for each structure, as in Figure 5 FIGURE 5 Mono isocentric coplanar single arc plan targeting central structure. 2.7 Clinical dose evaluation A clinical SRS plan involving brain metastases with seven spatially scattered lesions (Figure 6 FIGURE 6 Lesions localization in lateral view (left) and oblique view (right) for better visualization of lesion shapes and locations. 3 RESULTS 3.1 MR‐Sim QA 3.1.1 B 0 The data in Table 2 0 0 0 TABLE 2 Mean quarterly B 0 DSV 27 cm Z direction (ppm) X direction (ppm) Y direction (ppm) Bandwidth‐difference option 1st monthly 0.07 0.35 0.14 2nd monthly 0.07 0.42 0.20 3rd monthly 0.19 0.26 0.07  Average  0.11  0.34  0.14  Note 0 John Wiley & Sons, Ltd. 3.1.2 ACR geometrical accuracy The MR‐Sim weekly QA contour plots and trend data confirm that the MRI system meets ACR recommendations for geometric accuracy, with distortions consistently below the 2 mm threshold.  17 7 FIGURE 7 ACR MRI‐T1 axial geometrical accuracy assessed during weekly QA of 1.5T MR‐Sim. Results are for phantom slice #5 with an expected value of 190 ± 2 mm. 3.2 MR geometrical evaluation 3.2.1 MR geometrical correction assessment Figure 8 FIGURE 8 2D plots of MR geometric distortions in the sagittal plane with (right) and without (left) including geometric correction. Red contours indicate distortions > 1.5 mm tolerance. Enabling geometric correction (right) keeps distortion within acceptable limits across most of the plot. 3.2.2 Absolute distortion in 3D and 2D MR sequences The scatter plots in Figure 9 p p FIGURE 9 Scatter plots of geometric distortion (magnitude) are shown for all 3D MRI sequences used in SRS treatment (for brain, spine, and AVM using CK machine) and for a 2D MRI sequence without correction Horizontal lines indicate TG‐284 recommendation of 2 mm distortion tolerance in SRS. 3.2.3 Cumulative MR sequence distortion (min., mean, and max.) The distortion analysis without considering the FOVs of different MRI sequences, presented in Figure 10 1 n FIGURE 10 Boxplot showing distortion values for 3D T2 Cube/T2 FLAIR/T1 MPRAGE/3D TOF Angiography and 2D T2 MRI sequences for the CIRS MR distortion phantom. The orange horizontal line in the middle of each box shows the median value ( n As shown, the median distortion levels for each sequence are marked. Among the 3D sequences, both 3D T2 Cube (used in CK for AVM or other lesions) and 3D T2 FLAIR demonstrated low distortion levels. In contrast, the 3D TOF MRA sequence had the highest maximum distortion among the 3D sequences (3.3 mm), indicating a potential limitation in peripheral vessel delineation. However, the mean distortion for this sequence (0.4 mm) is within the tolerance recommended by AAPM TG‐284.  15 3.2.4 Mean and max. distortion by outer radius Evaluating max and mean distortion by outer radius reveals overall accuracy (mean) and worst‐case scenarios (max), highlighting spatial performance trends (Figure 11 11 FIGURE 11 Maximum and mean magnitude of distortions (mm) over the outer radius spherical band in different MR sequences. 3.3 Dosimetric impact 3.3.1 Contour variability on rigid registration Given the critical importance of accurate contouring and registration in dose distribution, the evaluation results obtained using Eclipse showed target registration errors with a mean of 0.1 mm and a standard deviation of 0.5 mm. The contour evaluation, focusing on a clinical MR sequence, demonstrated a high degree of similarity across various regions of the phantom. The Dice and Jaccard indices showed mean values of 0.94 and 0.89, respectively, indicating significant contour overlap. Further analysis using the HD metric confirmed the findings, with average values of 2.1 mm, showing minimal deviation between CT and MR contours. This was particularly evident at the isocenter, which achieved a Jaccard value of 0.99. Notably, contour accuracy was higher in the central section of the phantom compared to the superior and inferior regions (Figure 12 FIGURE 12 The box plot shows the average values of HD, Dice, and Jaccard indices for contour comparisons in each region across various contours in the CIRS phantom. 3.3.2 Dosimetric accuracy across central and peripheral regions The dosimetric analysis reveals significant variations in dose distribution across the phantom, with notable discrepancies between MR and CT imaging modalities ( p t 3 TABLE 3 Mean dose and D 95% No. Geometrical index D 95% D mean Volume [cm 3 Contour pairs Jaccard CT MR MR Nor. Diff. CT MR CT MR 1 Isocenter 0.99 96.6 96.3 95.7 0.9 1601.6 1600.3 99.0 99.6 2 Mid_Left 0.92 97.3 95.8 91.5 5.8 1606.5 1599.7 98.7 103.3 3 Mid_Right 0.92 95.1 92.8 86.7 8.4 1564.5 1556.3 96.4 103.2 4 Mid_Anterior 0.89 96.0 94.3 87.7 8.3 1580.3 1573.6 96.8 104.1 5 Mid_Posterior 0.91 96.8 93.5 87.2 9.6 1601.2 1589.5 96.6 103.6 4 Mid_Lt_Anterior 0.90 95.9 94.7 87.9 8.0 1581.0 1575.7 97.1 104.6 7 Mid_Lt_Posterior 0.88 95.7 93.6 87.4 8.3 1583.4 1574.7 96.3 103.1 8 Mid_Rt_Anterior 0.90 95.0 92.6 88.4 6.6 1566.6 1557.0 96.5 101.1 9 Mid_Rt_Posterior 0.90 96.0 93.0 87.7 8.3 1583.9 1572.4 96.5 102.3 10 Sup_Center (Head) 0.90 94.9 98.2 99.3 4.4 1578.6 1572.1 100.3 99.2 11 Sup_Left 0.88 94.7 93.1 86.8 7.9 1570.1 1566.0 104.6 112.2 12 Sup_Right 0.88 95.1 93.7 87.8 7.3 1566.9 1561.5 105.9 113.0 13 Sup_Anterior 0.88 96.0 93.8 85.6 10.4 1589.4 1581.0 105.8 115.9 14 Sup_Posterior 0.87 95.1 93.2 85.0 10.1 1572.4 1566.0 103.5 113.5 15 Sup_Lt_Anterior 0.88 96.8 95.0 86.2 10.6 1601.2 1593.5 104.9 115.6 16 Sup_Lt_Posterior 0.82 95.3 91.9 81.6 13.7 1568.9 1557.7 103.3 116.4 17 Sup_Rt_Anterior 0.86 94.4 91.5 83.1 11.3 1564.5 1553.2 102.3 112.7 18 Sup_Rt_Posterior 0.86 95.4 93.6 85.3 10.1 1570.3 1561.3 101.8 111.7 19 Inf_Center (Feet) 0.93 95.1 95.3 96.5 1.4 1577.3 1578.1 98.3 97.1 20 Inf_Left 0.90 94.5 91.5 83.2 11.3 1575.3 1571.8 99.8 109.7 21 Inf_Right 0.87 96.3 95.1 85.1 11.2 1585.8 1580.5 98.7 110.3 22 Inf_Anterior 0.90 94.4 93.2 85.1 9.3 1554.4 1546.2 105.8 115.9 23 Inf_Posterior 0.88 95.1 94.0 87.6 7.5 1577.3 1572.3 96.6 103.6 24 Inf_Lt_Anterior 0.90 92.7 90.7 82.6 10.1 1575.3 1571.8 97.4 107.0 25 Inf_Lt_Posterior 0.88 93.7 91.3 83.5 10.2 1566.2 1557.8 98.2 107.4 26 Inf_Rt_Anterior 0.89 93.8 90.9 83.1 10.7 1562.8 1553.8 98.8 108.1 27 Inf_Rt_Posterior 0.85 95.6 94.0 84.0 11.6 1583.3 1578.6 97.9 109.5 John Wiley & Sons, Ltd. Isocenter structure (No. 1) exhibits the most stable dosimetric performance, with D 95% normalized normalized 95% mean Among central structures (No. 1, 10, and 19), the isocenter maintains the highest stability, whereas the superior and inferior centers show relative D95% differences of 4.4% and 1.4%, respectively. These deviations, though small, highlight the need for careful consideration in treatment planning to ensure optimal dose coverage. Peripheral structures show greater dosimetric variability than central ones, with MR normalized 95% 2.3 3.3.3 DVH comparison of central structures Figure 13 FIGURE 13 DVH comparison between MR and CT‐based treatment plans in central and most deviated structures. For the central structure, the MR DVH closely aligns with the CT reference, indicating minimal geometric distortion and consistent dose coverage (D 95% mean Conversely, the MR DVH for the peripheral Sup_Lt_Posterior structure exhibits a broader slope, indicating dose inhomogeneity and decline (D 95% mean These findings emphasize the importance of evaluating peripheral dose distributions, as increased geometric distortion at greater distances from the isocenter can affect treatment accuracy, necessitating adjustments to mitigate potential dosimetric discrepancies. 3.3.4 Clinical dose evaluation Compared to the original plan, a 3 mm plan shift led to reduce all GTVs dose coverage. GTV7 was most affected, with coverage falling from 95.2% to 89.7%, failing to meet the clinical target in all plans. GTVs 1, 2, and 5 showed moderate sensitivity, with some plans dropping below the ≥98% coverage threshold. Although GTVs 3 and 4 maintained coverage above 98%, they still experienced slight decreases (Table 4 TABLE 4 Dose coverage comparison of lesions in original and shifted plans. Contours GTV1  a GTV2 GTV3 GTV4 GTV5 GTV6 GTV7 Clinical goal (cGy) ≥ 98% V 1800 V 2000 V 2000 V 1800 V 2000 V 2000 V 2000 Original plan coverage (%) 98.6 99.4 99.2 99.2 97.6 99.0 95.2 Shifted plan coverage (%) 96.8 97.6 98.8 98.7 95.5 97.8 89.7  a Skull bone lesion. John Wiley & Sons, Ltd. 4 DISCUSSION Geometric distortion in MRI can compromise the spatial accuracy essential for RT planning. This study extends prior work (6, 9, 11, 16) by directly linking phantom‐measured distortions to dosimetric consequences in high‐precision treatments. Using the CIRS Model 604‐GS phantom, we systematically quantified distortions across clinical 2D and 3D sequences at 1.5 T MR‐Sim. Our results confirm that 2D T2 TSE Axial sequence exhibits up to four‐fold greater mean distortion (≈1.4 mm) and a maximum error of 9.7 mm at 150 mm off‐isocenter, underscoring their vulnerability when gradient correction is limited. In contrast, 3D volumetric sequences (T1 MPRAGE, T2 FLAIR, T2 Cube) maintained submillimeter average distortions (≈0.4 mm) and a maximum of 2.2 mm, in line with AAPM TG‐284 recommendations.  4  18 Importantly, distortion magnitude increased with radial distance, reaching 3.3 mm in TOF MRA at the phantom periphery—a finding particularly relevant for CyberKnife treatments targeting off‐axis lesions. Phantom‐derived shifts (up to 3 mm) applied to a clinical SRS VMAT plan resulted in average GTV coverage losses of 1.9%, with lesions (e.g., max. 5.5% for GTV7) failing to meet the ≥98% threshold under combined XYZ (3 mm) distortion. Dosimetric discrepancies between MRI‐ and CT‐based planning were minimal (<1% in central regions) but escalated to 13.7% in peripheral structures, highlighting that peripheral targets are at greatest risk of underdosage if distortions are uncorrected. These findings demonstrate that sequence selection and geometric correction algorithms are crucial to mitigate distortion, particularly for off‐center targets in stereotactic applications. Limitations include scanner‐specific variability and the influence of patient anatomy on distortion patterns. Future work should refine distortion‐correction workflows, explore real‐time mapping techniques, and validate adaptive planning strategies that incorporate measured geometric errors. 5 CONCLUSION This study evaluates the geometric accuracy of MRI protocols for RT planning using a 1.5T MR‐Sim scanner and a geometrical phantom. While 3D sequences show acceptable accuracy, significant variability was observed, with the current T2 TSE 2D sequence exhibiting higher distortion. 3D T1 MPRAGE, 3D T2 Cube, and 3D T2 FLAIR provide the best balance of low distortion and stability, while the 3D TOF MR Angiography sequence may require caution for peripheral delineations. The results confirm that central anatomical structures align well in MRI‐CT registration, ensuring accurate dose distribution. However, peripheral regions are more sensitive to geometric misalignments, emphasizing the need for careful protocol selection and patient positioning based on lesion location. Optimized MRI techniques and image fusion strategies are also essential for precise treatment planning. AUTHOR CONTRIBUTIONS Mojtaba Barzegar performed measurements and analysis, contributed to VMAT planning, co‐authored sections, created figures, and manuscript writing. Aram Rostami designed the study, directed all content, contributed to image registration and dosimetric evaluation sections, co‐authored sections, and proofread the manuscript. Abbas Yousef Mkanna contributed to VMAT planning, and dosimetric revisions. Satheesh Prasad Paloor revised the manuscript, and proofread all content. Ahamed Basith contributed to VMAT planning, Tarraf Torfeh and Souha Aouadi evaluated image distortion. Rabih Hamoud and Noora Al Hammadi provided all materials. CONFLICT OF INTEREST STATEMENT The authors declare no conflicts of interest. ACKNOWLEDGMENTS Open Access funding was provided by Sun Nuclear Corp. through Al Zahrawi Medical. REFERENCES 1 Aleong AM Berlin A Borg J Rapid multi‐catheter segmentation for magnetic resonance image‐guided catheter‐based interventions Med Phys 2024 51 8 5361 5373 38713919 10.1002/mp.17117 2 Murgic J Gregov M Mrcela I MRI‐guided radiotherapy for prostate cancer: a new paradigm Acta Clin Croat 2022 61 3 65 70 36938552 10.20471/acc.2022.61.s3.9 PMC10022406 3 Sun J Barnes M Dowling J Menk F Stanwell P Greer PB An open source automatic quality assurance (OSAQA) tool for the ACR MRI phantom Australas Phys Eng Sci Med 2015 38 1 39 46 25412885 10.1007/s13246-014-0311-8 4 Hasler SW Kallehauge JF Hansen RH Geometric distortions in clinical MRI sequences for radiotherapy: insights gained from a multicenter investigation Acta Oncologica 2023 62 11 1551 1560 37815867 10.1080/0284186X.2023.2266560 5 Tang S Rai R Vinod SK Rates of MRI simulator utilisation in a tertiary cancer therapy centre J Med Imaging Radiat Oncol 2022 66 5 717 723 35687525 10.1111/1754-9485.13422 6 Chen L Price RA Jr Nguyen TB Dosimetric evaluation of MRI‐based treatment planning for prostate cancer Phys Med Biol 2004 49 22 5157 5170 15609565 10.1088/0031-9155/49/22/010 7 Kidd EA Imaging to optimize gynecological radiation oncology Int J Gynecol Cancer 2022 32 3 358 365 35256424 10.1136/ijgc-2021-002460 8 Theocharis S Pappas EP Seimenis I Geometric distortion assessment in 3T MR images used for treatment planning in cranial Stereotactic radiosurgery and radiotherapy PLoS One 2022 17 5 e0268925 35605005 10.1371/journal.pone.0268925 PMC9126373 9 Seibert TM White NS Kim GY Distortion inherent to magnetic resonance imaging can lead to geometric miss in radiosurgery planning Pract Radiat Oncol 2016 6 6 e319 e328 27523440 10.1016/j.prro.2016.05.008 PMC5099096 10 Gao Y Han F Zhou Z Distortion‐free diffusion MRI using an MRI‐guided Tri‐Cobalt 60 radiotherapy system: sequence verification and preliminary clinical experience Med Phys 2017 44 10 5357 5366 28692129 10.1002/mp.12465 11 Pappas EP Alshanqity M Moutsatsos A MRI‐Related geometric distortions in stereotactic radiotherapy treatment planning: evaluation and dosimetric impact Technol Cancer Res Treat 2017 16 6 1120 1129 29332453 10.1177/1533034617735454 PMC5762079 12 Pavlidis ET Pavlidis TE New trends in the surgical management of soft tissue sarcoma: the role of preoperative biopsy World J Clin Oncol 2023 14 2 89 98 36908679 10.5306/wjco.v14.i2.89 PMC9993143 13 Teyateeti A Brown PD Mahajan A Laack NN Pollock BE Brain metastases resection cavity radio‐surgery based on T2‐weighted MRI: technique assessment J Neurooncol 2020 148 1 89 95 32303974 10.1007/s11060-020-03492-x 14 Wang X Fan L Yan W Bao S Liu L Comparison of accuracy and long‐term prognosis between computed tomography‐based and magnetic resonance imaging‐based brachytherapy for cervical cancer: a meta‐analysis J Med Imaging Radiat Oncol 2020 64 1 151 162 31845539 10.1111/1754-9485.12984 15 Glide‐Hurst CK Paulson ES McGee K Task group 284 report: magnetic resonance imaging simulation in radiotherapy: considerations for clinical implementation, optimization, and quality assurance Medical physics 2021 48 7 e636 e670 33386620 10.1002/mp.14695 PMC8761371 16 Price R Allison J Clarke G Magnetic Resonance Imaging Quality Control Manual American College of Radiology 2015 120 17 Brock KK Mutic S McNutt TR AAPM Task Group 132 report: use of image registration and fusion algorithms and techniques in radiotherapy Med Phys 2017 44 7 e43 e76 10.1002/mp.12256 28376237 18 Stanescu T Jans HS Wachowicz K Fallone BG Investigation of a 3D system distortion correction method for MR images J Appl Clin Med Phys 2010 11 1 200 201 10.1120/jacmp.v11i1.2961 PMC5719775 20160688 19 Casati M Piffer S Calusi S Methodological approach to create an atlas using a commercial auto‐contouring software J Appl Clin Med Phys 2020 21 12 219 230 33236827 10.1002/acm2.13093 PMC7769405 20 Nousiainen K Mäkelä T Peltonen JI Characterizing geometric distortions of 3D sequences in clinical head MRI Magnetic Resonance Materials in Physics, Biology & Medicine 2022 35 6 983 995 10.1007/s10334-022-01020-8 PMC9596562 35657535 ",
  "metadata": {
    "Title of this paper": "Characterizing geometric distortions of 3D sequences in clinical head MRI",
    "Journal it was published in:": "Journal of Applied Clinical Medical Physics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481828/"
  }
}