{
  "title": "Paper_973",
  "abstract": "pmc Mol Cancer Mol Cancer 117 molcanc Molecular Cancer 1476-4598 BMC PMC12482714 PMC12482714.1 12482714 12482714 41029375 10.1186/s12943-025-02441-4 2441 1 Review The role of acetylcholine and its receptors in tumor immune regulation: mechanisms and potential therapeutic targets Zhang Chunyu Guo Xiangdong Wang Yanan Zhang Shuo Wang Zhihua zhwang_hust@hotmail.com https://ror.org/00p991c53 grid.33199.31 0000 0004 0368 7223 Department of Urology, Tongji Hospital, Tongji Medical College, Huazhong University of Science and Technology, 30 9 2025 2025 24 478187 231 16 5 2025 11 8 2025 30 09 2025 01 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Acetylcholine (ACh) is an essential neurotransmitter that has recently gained attention for its multifunctional role in tumor immune regulation. By binding neuronal loss to nicotinic and muscarinic receptors, ACh directly promotes tumor cell proliferation and migration while modulating immune cell functions, thereby influencing the tumor microenvironment. Additionally, ACh plays a crucial role in tumor angiogenesis and stromal remodeling. Recent studies suggest that combining ACh modulators with immune checkpoint inhibitors and other therapies may improve treatment efficacy and overcome resistance. This review highlights current research developments regarding ACh in tumor immune regulation, explores its underlying mechanisms and clinical potential, and provides a theoretical basis for developing personalized therapeutic strategies. Keywords Acetylcholine Tumor immunity Nicotinic acetylcholine receptor Muscarinic acetylcholine receptor Fundamental Research Funds for the Central Universities YCJJ20251101 Zhang Chunyu pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Acetylcholine (ACh) is a classical neurotransmitter that was first discovered in the autonomic nervous system, where it primarily regulates parasympathetic and certain central nervous system (CNS) signaling pathways [ 1 2 2 3 5 Recent studies have shown that ACh is not limited to being a neurotransmitter but is also widely found in the tumor microenvironment (TME), where it participates in the regulation of various cellular functions [ 6 7 8 While the mechanisms of ACh in the nervous system have been well characterized, its exact function in tumor immune regulation has yet to be fully clarified. With the growing interest in tumor immune microenvironment research, ACh has been increasingly recognized as an important modulator of tumor immunity [ 8 The sources and signaling pathways of acetylcholine Synthesis and release of acetylcholine ACh synthesis is catalyzed by choline acetyltransferase (ChAT), which combines acetyl-CoA with choline obtained primarily through the high-affinity sodium-dependent choline transporter (CHT) [ 9 11 1 + 12 23 15 18 + 15 16 24 25 27 + 17 16 28 15 23  Fig. 1 Overview of Acetylcholine Synthesis. Choline enters the cell through the sodium-dependent choline transporter, while acetyl-CoA (CoA) is generated in the mitochondria via glycolysis or fatty acid metabolism. Choline acetyltransferase (ChAT) catalyzes the synthesis of acetylcholine by combining acetyl-CoA with choline, simultaneously producing free CoA as a byproduct. Acetylcholine is transported into vesicles via the vesicular acetylcholine transporter (VAChT, a proton antiporter) and is released into the synaptic cleft through exocytosis for neuronal use or into the extracellular space for non-neuronal synthesis. Before binding to receptors, acetylcholine may be hydrolyzed by acetylcholinesterase (AChE) or butyrylcholinesterase (BChE), producing acetate and choline; the resulting choline may be reabsorbed. Acetylcholine can bind to nicotinic acetylcholine receptors (nAChR), muscarinic acetylcholine receptors (mAChR), or other receptors to exert paracrine or autocrine effects. When two acetylcholine molecules bind, they activate nAChR, opening a non-selective cation channel. Activated mAChR can recruit G proteins, initiating Gq/11 or Gi/o signaling, or recruit G protein-coupled receptor kinases, further recruiting β-arrestin proteins, leading to receptor desensitization and internalization Acetylcholine receptors and signal transduction mechanism ACh mediates its biological functions through interaction with two primary classes of receptors: mAChRs and nAChRs. These two receptor types exhibit significant differences in structure, signal transduction mechanisms, and functional regulation. They participate in various physiological processes, including neurotransmission, immune regulation, angiogenesis, and tumor cell proliferation. nAChRs are pentameric ligand-gated ion channels composed of 10 α subunits (α1–α10), 4 β subunits (β1–β4), and γ, δ, ε subunits [ 29 31 32 36 2+ + 34 36 37 39 2+ 33 38 40 41 2+ 38 39 42 43 49 + + 46 47 49 50 54 4 50 55 63 mAChRs belong to the G protein-coupled receptor (GPCR) family and consist of five subtypes (M1–M5), encoded by CHRM1–CHRM5. M1, M3, and M5 couple with Gq proteins activating phospholipase C (PLC), generating IP3 and DAG to activate PKC; M2 and M4 couple with Gi/Go proteins to inhibit adenylyl cyclase and reduce cAMP [ 64 65 73 70 80 + + 46 81 The mechanisms of acetylcholine in the tumor microenvironment Direct effects of acetylcholine on tumor cells ACh, a classic neurotransmitter, has recently gained attention for its growth-promoting and anti-apoptotic effects in various tumor cells [ 82 1 2 83 87  Table 1 Acetylcholine receptor expression and function across various tumors AChR subtype Tumor type Expression level Biological function Pathway/mechanism References α1-nAChR Lung cancer High Enhancing EGFR-TKI resistance p44/42 MAPK [ 88 α1-nAChR Melanoma High Promoting metastasis – [ 91 α1-nAChR Glioblastoma High Promoting cell proliferation – [ 92 α5-nAChR Lung cancer High Promoting cell proliferation, migration, and invasion DNMT1/FHIT、p-STAT3、NLRP3 inflammasome、ERK1/2、PI3K/Akt、JAK2/STAT3、TGF-β1/Smad [ 97 100 422 α5-nAChR Breast cancer High Promoting cell cycle, inhibiting apoptosis, DNA damage response and drug sensitivity CHEK1 [ 102 α5-nAChR Melanoma High Promoting cell proliferation, migration, and invasion PI3K-AKT、ERK1/2 [ 103 α5-nAChR Intrahepatic cholangiocarcinoma High Promoting metastasis CAMKII /GSK3β/β-连环蛋白 [ 104 α5-nAChR Hepatocellular carcinoma High Promoting progression YAP [ 105 α5-nAChR Prostate cancer High Promoting cell proliferation, migration, and invasion AKT、ERK1/2 [ 106 107 α5-nAChR Gastric cancer High Promoting cell proliferation and reducing cisplatin chemotherapy sensitivity Akt [ 108 α5-nAChR Ovarian cancer High Promoting cell proliferation, migration, and invasion p38、ERK MAPK [ 109 α7-nAChR Lung cancer High Promoting cell proliferation, migration, and invasion JNK、PI3K-AKT、PKA、MEK/ERK、CCL20、Src [ 112 120 124 125 α7-nAChR Gastric cancer High Promoting cell proliferation, migration, and reducing drug sensitivity ERK1/2、AKT、HDAC1/Cyclin D/E2F/pRb [ 126 128 α7-nAChR Hepatocellular carcinoma High Promoting cell proliferation NF-κB [ 129 α7-nAChR Oral cancer High Reducing drug sensitivity AKT/YAP/TEAD [ 133 α7-nAChR Glioma High Promoting cell proliferation ERK、AKT [ 134 135 α7-nAChR Colon cancer Low Inhibiting cell malignancy NF-κB [ 136 α9-nAChR Breast cancer High Inhibiting angiogenesis MMPs [ 212 α9-nAChR Glioma High Potential prognostic marker STAT3 [ 141 α9-nAChR Lung cancer High Promoting cell proliferation AKT、ERK [ 142 α9-nAChR Melanoma High Promoting cell proliferation AKT、ERK [ 142 β2- nAChR Pancreatic cancer Low Inhibiting cell migration and invasion β-catenin [ 143 M3- mAChR Gastric cancer High Promoting cell proliferation NGF、YAP、Wnt、ERK1/2、AKT [ 83 147 148 M3- mAChR Colorectal cancer High Promoting cell proliferation ERK [ 87 M3- mAChR Glioblastoma High Promoting cell growth and invasion MMPs [ 216 M3- mAChR Lung cancer High Promoting cell proliferation and drug resistance MAPK、AKT、YAP [ 154 155 M3- mAChR Prostate cancer High Promoting cell proliferation FAK/YAP、CaM/CaMKK/AKT、 [ 157 158 M3- mAChR Pancreatic ductal adenocarcinoma High Poor prognosis – [ 159 M3- mAChR Cholangiocarcinoma High Promoting cell migration AKT [ 160 M3- mAChR Breast cancer High Promoting angiogenesis VEGF-A [ 161 M1- mAChR Prostate cancer High Promoting cell invasion, metastasis, and chemotherapy resistance Hedgehog signaling、MAPK [ 162 164 M2- mAChR Lung cancer High Promoting cell proliferation MAPK、Akt [ 165 M2- mAChR Glioblastoma Low Inhibiting cell migration IKCa channel [ 166 M4- mAChR Cervical Cancer High Promoting cell motility ERK1/2 [ 168  Fig. 2 Principal signaling pathways downstream of nicotinic and muscarinic acetylcholine receptors in the tumor microenvironment. Activation of nicotinic and muscarinic acetylcholine receptors promotes tumor growth, metastasis, and angiogenesis by activating a series of signaling cascades, such as the Src-Raf-1-Rb, PTEN/PI3K/AKT, JAK2/STAT3, and Ras/Raf/MEK/ERK pathways The CHRNA1 gene encodes the α1 subunit of the nAChR. Immunohistochemical (IHC) analysis of primary tumor tissues revealed significant protein expression of the α1 and β1 subunits of nAChR in lung tumors, while α7 subunit expression was absent. This suggests that muscle-type nAChRs are primarily found in non-small cell lung cancer (NSCLC). Further analysis showed that the β1 subunit was expressed at significantly higher levels in lung tumors compared to non-tumor bronchial tissues, with the α1 subunit also showing a tendency for increased expression. Nicotine treatment (10 µM) significantly induced phosphorylation of mitogen-activated protein kinases (MAPK, p44/42). This phosphorylation may be suppressed by nAChR antagonists, especially when using α-bungarotoxin (α-BTX, 100 nM) or hexafluoroethane (HEX, 10 µM), with the combination providing the strongest inhibitory effect. Further studies indicated that nicotine could also activate Akt phosphorylation in NSCLC cells, a process that could be blocked by LY294002 (the PI3K inhibitor) and neurotype nAChR antagonists, but not by inhibitors targeting muscle-type nAChR. Additionally, nicotine initiated an influx of calcium ions, suggesting activation of L-type calcium channels. Activation of the MAPK (p44/42) signaling pathway was more significant than that of the Akt pathway under nicotine stimulation. When nicotine was combined with the epidermal growth factor receptor tyrosine kinase inhibitor (EGFR-TKI) gefitinib, the number of surviving cells in the culture was significantly higher than when gefitinib was used alone. This suggests that high expression of muscle-type nAChR may contribute to NSCLC resistance to EGFR-TKI by activating the p44/42 MAPK signaling pathway. Although neurotype nAChR expression is low in NSCLC, it can still activate MAPK and Akt pathways [ 88 89 90 91 92 The CHRNA5 gene encodes the α5 subunit of nAChR, which has a significant function in nicotine-induced proliferation, invasion, and migration of lung cancer cells [ 93 95 96 97 98 99 100 101 102 103 104 105 107 108 109 The CHRNA7 gene encodes the α7 subunit of nAChRs. In lung cancer, activation of α7nAChR induces cancer cell proliferation by the MEK/ERK pathway. Using α7nAChR antagonists or RNA interference can significantly inhibit the activity of the MEK/ERK pathway, thereby reducing cancer cell proliferation [ 110 111 112 113 114 115 116 119 120 121 110 122 124 125 126 127 128 129 130 131 132 133 134 135 136 The CHRNA9 gene encodes the α9nAChR. In breast cancer studies, the expression of α9nAChR is notably elevated compared to normal epithelial cells, especially in triple-negative breast cancer (TNBC) cell lines. High level of α9nAChR is believed to be closely associated with tumor metastasis, proliferation, and chemotherapy resistance. Stable expression of α9nAChR siRNA in MDA-MB-231 cells significantly weakened nicotine-stimulated growth and proliferation in soft agar, and the volume of transplanted tumors in SCID mice also decreased significantly [ 137 139 140 141 142 The CHRNB2 gene encodes the β2 subunit of the nAChRs. Downregulation of CHRNB2 can promote the invasion and migration of pancreatic cancer cells independently of Ach, while its overexpression inhibits the invasion and migration of pancreatic cancer cells. Studies have shown that downregulation of CHRNB2 may suppress the β-catenin pathway by regulating its upstream factors, such as TCF7L2, SOX17, SRY, and SOX6, thereby affecting the invasion and migration capabilities of cancer cells [ 143 144 145 Muscarinic ACh receptors, particularly the M3 muscarinic receptor (M3R), play a key role in the regulation of signaling pathways in various cancers. Studies on vagotomy have shown that M3R is an essential factor in inhibiting gastric cancer progression, and its transcript and protein expression are significantly upregulated in gastric cancer patients [ 146 147 148 149 148 150 151 151 83 152 153 154 155 156 157 158 159 160 161 The CHRM1 gene encodes the muscarinic AChR M1 subtype. Studies have shown that through the Hedgehog signaling pathway, CHRM1 regulates the migration and invasion of PCa cells [ 162 163 164 165 166 167 168 169 In addition to promoting growth and anti-apoptotic effects, ACh also supports tumor cells by regulating their metabolism. Tumor cells often exhibit metabolic abnormalities, particularly the “Warburg effect,” where they rely on aerobic glycolysis for energy generation, regardless of sufficient oxygen presence. ACh enhances glucose uptake and glycolytic activity by activating mAChRs and nAChRs. Research has demonstrated that nicotine, by activating nicotinic AChRs, promotes the migration of A549 and upregulates the level of acid extrusion proteins (like NHE1 and MCT4), further promoting glycolysis [ 170 171 In summary, ACh not only directly promotes tumor cell proliferation and anti-apoptotic by the activation of multiple signaling, but also supports tumor cell metabolism, fulfilling the energy and material demands during rapid proliferation. The regulatory role of acetylcholine in the tumor immune microenvironment ACh exerts both direct effects on tumor cells and indirect effects by enhancing tumor growth and progression through the regulation of immune cell function in the tumor immune microenvironment. ACh finely regulates the activity and responsiveness of immune cells, particularly in enhancing the function of immunosuppressive cells and inhibiting effector immune cells [ 172 ( 2 3 )  Table 2 Regulatory effects of acetylcholine on immune cells Immune cell type Mechanism of action Relevant receptors Functional regulation References T cells HDAC1-mediated downregulation of CCL5 – Weakening the recruitment ability of CD8 + [ 173 T cells Inhibiting the production of interferon-gamma – Promoting Th2 cell differentiation and inhibiting Th1 cell differentiation [ 173 T cells – M3- mAChR Promoting the differentiation of regulatory T cells [ 173 T cells Activating the transcription factor c-Jun to upregulate IDO1 expression α7-nAChR Promoting the function of regulatory T cells (Tregs) and inhibiting the function of CD8 + [ 175 T cells IP3-mediated Ca(2+) release induces extracellular Ca(2+) influx, generating [Ca(2+)]i oscillations, and enhances the expression of c-fos gene and interleukin-2 in T lymphocytes M3- mAChR、M5- mAChR Promoting T cell activation and proliferation [ 176 T cells – α7-nAChR Upregulating the generation of Tregs [ 183 T cells Inhibiting the secretion of IFN-γ α5-nAChR Inhibiting the cytotoxic ability of T cells [ 218 T cells Ca 2+ Inhibiting excessive T cell activation [ 219 Macrophages Upregulating the phosphorylation levels of STAT3, PI3K p85, and NF-κB p65 α7-nAChR Inhibiting the migration and invasion of colorectal cancer cells [ 184 Macrophages Inhibiting the release of TNF-α α7-nAChR Inhibiting macrophage inflammatory response [ 93 NK cells – – Enhanced peripheral NK cell activity [ 186 B cells – α7-nAChR Inhibiting B cell proliferation [ 193 196 Neutrophils Promoting the production of CXCL2 – Enhancing neutrophil NETosis [ 197  Fig. 3 Immunomodulatory roles of acetylcholine in the tumor microenvironment. ( A B + C D E T cells in the TME can inhibit tumor progression through CD8 + + 173 + + + 174 + + 175 2+ 176 177 178 178 43 179 180 + + + + + 181 182 183 Within the tumor microenvironment, macrophages exhibit a dual role, functioning as either pro-inflammatory M1-type or anti-inflammatory M2-type cells. In colorectal cancer (CRC) patients, those with a high incidence of liver metastasis show a low or absent expression of the α7nAChR in their tumor-associated macrophages (TAMs). In vitro experiments have shown that knocking down α7nAChR in macrophages (TMα7-/-) markedly enhances the migration and invasion abilities of CRC cell lines. Additionally, the phosphorylation levels of NF-κB p65, PI3K p85, STAT3and were significantly downregulated after co-culturing with human colon cancer cell line LoVo cells [ 184 93 185 + 17 179 186 190 191 Natural killer (NK) cells constitute a vital part of the innate immune defense, directly eliminating tumor cells through cytotoxic responses and cytokine secretion. Studies have shown that BEP neurons, differentiated from fetal neural stem cells in vitro, were transplanted into the hypothalamus of rats treated with mammary carcinogens. Compared to rats receiving cortical cell transplants, rats that received BEP transplants showed a notable decline in mammary tumor development, progression, aggressiveness, and metastasis. BEP neuron transplantation also reduced the levels of inflammation in the tumor tissue and EMT, while enhancing the activity of peripheral NK cells and macrophages, decreasing the plasma levels of pro-inflammatory cytokines, and increasing the plasma levels of anti-inflammatory cytokines. This anti-metastatic effect, along with the activation of NK cells and macrophages, was blocked by the opioid antagonist naloxone, the nicotinic AChR antagonist methyllycaconitine, as well as the β-adrenergic agonist metoprolol [ 192 193 196 197 198 In summary, ACh regulates various immune cells in the TME, inhibiting the anti-tumor functions of effector immune cells, enhancing the activity of immune-suppressive cells, and helping cancer cells evade immune system surveillance and clearance. The role of acetylcholine in tumor angiogenesis and matrix remodeling ACh plays a significant role in the TME, not only through regulating cancer cells and immune cell functions but also by significantly influencing two key processes—angiogenesis and matrix remodeling. These processes are crucial for tumor growth, metastasis, and invasion. ACh regulates the function of endothelial cells, stromal cells, and the extracellular matrix (ECM) by activating different types of AChRs, promoting tumorigenesis and rapid metastatic dissemination. Angiogenesis refers to the formation of new blood vessels and is essential for maintaining normal physiological functions and contributing to the progression of numerous diseases, including cancer, atherosclerosis, macular degeneration, brain ischemia, neurodegenerative diseases, and cardiovascular diseases [ 199 200 201 202 203 204 205 206 207 208 210 206 211 212 Matrix remodeling is an essential process in tumor progression, involving the degradation, reorganization, and regeneration of the ECM, thereby creating space for tumor cell proliferation, migration, and metastasis. ACh, through activation of mAChRs, induces the dissociation of HT-29 cells and changes in cell-matrix contact, granting them invasive potential. This process depends on the activation of the src/Erk and FAK signaling [ 213 213 213 214 215 154 216 87 In summary, ACh Acetylcholine in tumor immune evasion Tumor immune evasion is a process by which tumor cells suppress or evade immune system detection and attack, allowing for tumor growth and expansion. ACh, as a neurotransmitter, not only regulates physiological functions but also regulates immune responses in the TME through complex mechanisms, helping tumor cells escape immune system surveillance. Influence on immune surveillance and cytotoxic mechanisms ACh is essential for regulating immune surveillance and cytotoxic mechanisms, with its effects being widely reflected in immune cell functions and changes in the tumor immune microenvironment. In the skeletal muscles surrounding oral squamous cell carcinoma, the nicotine AChR subunits that are specifically expressed show immune-related characteristics: the increased expression of α1 is linked to the increased level of cancer stem cell markers such as CD44, as well as NK cell markers (CD56, CD16) and T cell markers (CD3, CD8), while it correlates with a reduction in the T phase and an elevation in the N phase. The upregulation of α3 is linked to the increase of CD56 and CD16, while the increase of α5 is associated with a reduction in CD3, CD8, and CD56 markers, as well as poorer survival and the loss of epithelial characteristics. In contrast, the increase of α7 is significantly correlated with an increase in T cell and NK cell markers, as well as a decrease in the tumor-to-surrounding immune cell ratio, suggesting it may enhance epithelial characteristics and improve the local immune environment, which is typically associated with better prognosis [ 217 + + + 218 + + 219 220 228 186 186 187 Modulation of cytokine and chemokine environment ACh is crucial for regulating the cytokine and chemokine environment through influencing the level of anti-inflammatory and pro-inflammatory cytokines through the activation of different AChRs. Studies have shown that ACh and nicotine can suppress the release of TNF-α in LPS-induced human macrophages, and vagus nerve stimulation can also suppress LPS-induced TNF-α synthesis in wild-type mice. Nevertheless, this inhibitory impact disappears in α7 receptor knockout mice (α7-KO) [ 179 188 229 230 186 17 179 188 190 231 233 234 235 236 Interaction with immune checkpoints The interaction between ACh and immune checkpoints plays a crucial role in the cancer immune evasion mechanisms. A retrospective analysis of primary lung adenocarcinoma cases treated surgically at the Mayo Clinic in Rochester revealed a significant association between PD-L1 expression and the AChR CHRNA5 [ 237 218 238 239 240 + + 241 219 In summary, ACh influences tumor immune evasion through multiple mechanisms, including directly regulating immune cell function, altering the cytokine and chemokine environment, and cooperating with immune checkpoints. These mechanisms work together to help cancer cells avoide surveillance and attack by the host immune system, creating favorable conditions for tumor growth and expansion. Potential therapeutic targets of acetylcholine signaling pathways The ACh signaling pathway is essential in tumorigenesis, progression, and treatment. By modulating its receptors and antagonists or agonists of enzymes participating in its synthesis, transport, and degradation, we can inhibit tumor progression and enhance drug sensitivity. ( 3 )  Table 3 Summary of acetylcholine receptor agonists and antagonists Agent type Subtype targeted Compound name Mechanism of action Biological effect References Antagonist M1- mAChR Dicyclomine Blocks receptor Reversing drug resistance [ 164 Antagonist M1- mAChR Dihydroxyphenylalanine Blocks receptor Inhibiting melanoma proliferation [ 246 Agonist M1- mAChR McN-A-343 Activates receptor Inhibiting colon cancer cell proliferation, enhances chemotherapy sensitivity [ 249 Agonist M1- mAChR Xanomeline Activates receptor Inhibiting colon cancer cell proliferation [ 249 Agonist M2- mAChR N-8-Iper Activates receptor Reversing drug resistance [ 250 Agonist M2- mAChR Arecaidine propargyl ester Activates receptor Inducing glioblastoma cell apoptosis [ 252 Antagonist M3- mAChR Enablex Blocks receptor Inhibiting tumor growth [ 83 152 158 254 255 Antagonist M3- mAChR R2-8018 Blocks receptor Inhibiting non-small cell lung cancer cell proliferation and migration [ 256 Antagonist M3- mAChR J-115,311 Blocks receptor Reducing tumor growth [ 257 Antagonist M3- mAChR Tudorza Blocks receptor Inducing gastric cancer cell apoptosis [ 259 Antagonist M3- mAChR 4-DAMP Blocks receptor Inhibiting non-small cell lung cancer cell proliferation [ 155 Antagonist M3- mAChR R2HBJJ Blocks receptor Inhibiting non-small cell lung cancer cell proliferation [ 259 Agonist M1- mAChR M3- mAChR Pilocarpine Activates receptor Inhibiting proliferation of chronic myelogenous K562 cells [ 262 Antagonist α3β4-nAChR TxID Blocks receptor Inhibiting lung cancer cell proliferation [ 376 Antagonist α3β4-nAChR Microgeva A(1) Blocks receptor More toxic to colon cancer cells than normal colon cells [ 378 Antagonist α6-nAChR α-Conotoxin MII Blocks receptor Inhibiting Ehrlich cancer growth [ 278 Antagonist α7-nAChR Methyllycaconitine Blocks receptor Inhibiting lung cancer cell proliferation and migration [ 95 270 271 Antagonist α7-nAChR Pinnatoxin G Blocks receptor Induceing cell apoptosis [ 274 Antagonist α7-nAChR α-Neurotoxin Blocks receptor Inhibiting cell proliferation [ 137 275 276 Antagonist α7-nAChR α-Conotoxin ImI-modified nanoparticle Blocks receptor Induceing cell apoptosis [ 280 281 Antagonist α7-nAChR α-bungarotoxin Blocks receptor Inhibiting lung cancer cell migration and invasion [ 286 287 Antagonist α7-nAChR α-Cobra toxin Blocks receptor Inhibiting tumor growth [ 289 291 Antagonist α7-nAChR SLURP-1 Blocks receptor Inhibiting cell proliferation [ 292 293 Antagonist α7-nAChR Oncotag Blocks receptor Inhibiting tumor growth and metastasis [ 294 Antagonist α7-nAChR Lynx1 Blocks receptor Inhibiting cell proliferation [ 288 Antagonist α7-nAChR Quinine-triazolyl molecule QND7 Blocks receptor Induceing cell apoptosis [ 295 Antagonist α7-nAChR MG624 Blocks receptor Inhibiting angiogenesis [ 211 Antagonist α7-nAChR Dequalinium chloride Blocks receptor Inhibiting cell growth and induces apoptosis [ 298 Antagonist α7-nAChR Oxidized carotenoids Inhibiting receptor expression Inhibiting tumor occurrence and movement [ 121 Antagonist α7-nAChR APS8 Blocks receptor Inhibiting tumor growth [ 300 Antagonist α7-nAChR Dextromethorphan Blocks receptor Inhibiting tumor progression [ 303 Antagonist α7-nAChR Metformin Inhibiting receptor expression Inhibiting tumor progression [ 303 Antagonist α7-nAChR GW1929 Inhibiting receptor expression Inhibiting tumor growth [ 306 Antagonist α7-nAChR Sinomenine Inhibiting receptor expression Inhibiting cell migration, inducing apoptosis [ 307 310 Antagonist α9-nAChR GeXIVA Blocks receptor Inhibiting cell proliferation, migration [ 137 339 Antagonist α9-nAChR RgIA4 Blocks receptor Inhibiting cell proliferation [ 115 Antagonist α9-nAChR Garcinol Inhibiting receptor expression Inhibiting cell proliferation [ 371 Antagonist α9-nAChR Apigenin Inhibiting receptor expression Inhibiting tumor growth [ 372 Antagonist α9-nAChR Quercetin Inhibiting receptor expression Inhibiting tumor growth [ 372 Antagonist α9-nAChR Tea polyphenol (−)-Epigallocatechin-3-gallate Inhibiting receptor expression Inhibiting cell proliferation [ 373 Antagonist α9-nAChR Methoxy polyethylene glycol Blocks receptor Inhibiting angiogenesis [ 374 Antagonist α9-nAChR APS7 Blocks receptor Inhibiting cell proliferation, inducing apoptosis [ 381 Antagonist α9-nAChR APS7-GNPs Blocks receptor Enhancing chemotherapy efficacy [ 381 Antagonist α9-nAChR Compound 51 [(2 S)-1-(4-amino-butyl)-2-(((5-((3,4-dichlorophenoxy)methyl)-isozol-3-yl) oxy)methyl)pyrrolidine-1-ammonium chloride] Blocks receptor Inhibiting cell proliferation [ 382 Agonist ChAT ONO-4819 Upregulating gene expression Inhibiting cell proliferation [ 386 Antagonist ChAT BW813U Upregulating inhibitory gene expression Inhibiting cell proliferation [ 7 Antagonist AChE poly-APS Inhibiting activity inducing cell apoptosis” [ 396 397 Antagonist AChE Rhodolatouchol Inhibiting activity Inhibiting cell growth [ 398 Antagonist AChE Dehydrocorydaline Inhibiting activity Inhibiting cell migration and invasion [ 399 Antagonist AChE Pyridostigmine Inhibiting activity Inhibiting cell viability and invasion [ 400 Antagonist AChE Abrine Inhibiting activity Inhibiting cell viability and invasion [ 400 Antagonist AChE NBP-14 Inhibiting C-terminal 14 peptide Inhibit cell migration [ 401 Antagonist AChE BChE AA-CHOL Inhibiting activity Reducing cell activity [ 402 Antagonist AChE GNE-783 Inhibiting activity Enhancing chemotherapy efficacy [ 403 Antagonist AChE GNE-900 Inhibiting activity Enhancing chemotherapy efficacy [ 403 Antagonist AChE GNE-145 Inhibiting activity Enhancing chemotherapy efficacy [ 403 Antagonist AChE 2-Phenylthiazole derivative A6 Inhibiting activity Inhibiting cell migration and inducing apoptosis [ 404 Antagonist AChE BChE Phenylcinnamamide compounds Inhibiting activity Reducing cell activity [ 406 Antagonist AChE 2-O-Methoxy Inhibiting activity Reducing cell activity [ 406 Muscarinic acetylcholine receptors as targets Considering the crucial involvement of cholinergic signaling in tumors, the possibility of targeting muscarinic receptors to inhibit tumor advancement has become progressively apparent. However, realizing this objective in a safe and effective manner still faces many challenges. Due to the high homology between muscarinic receptor subtypes, there are relatively few selective muscarinic receptor antagonists and agonists available for clinical use. Advancements in global and conditional muscarinic receptor knockout mouse models, along with innovations in gene expression regulation technologies, have facilitated progress in the development of ligands targeting specific receptor subtypes [ 242 243 244 245 Muscarinic AChR M1 antagonists and agonists exert different effects in various tumors. Dicyclomine is a clinically available selective CHRM1 antagonist that has demonstrated the ability to reverse resistance and suppress the proliferation of various docetaxel-resistant, castration-resistant prostate cancer models [ 164 246 247 248 249 249 The M2R dual agonist Iper-8-naphthamide (N-8-Iper) has been shown to effectively reverse chemoresistance in glioblastoma, partly by downregulating ABC drug efflux pumps [ 250 251 252 Darifenacin, a selective muscarinic M3 receptor antagonist sold under the brand name Enablex, received initial approval for the treatment of overactive bladder in women. After oral intake, darifenacin undergoes swift and near-complete absorption, with a comparatively lower incidence of adverse effects [ 253 83 152 158 254 255 256 257 155 254 258 259 260 155 261 262 Nicotinic acetylcholine receptors as targets α7 nAChR is a homologous pentameric receptor part of the Cys-loop receptor family, with its structure comprising three distinct regions: the extracellular, transmembrane, and intracellular domains [ 263 263 264 265 266 265 268 269 Methyllycaconitine, an effective α7 nAChR blocker isolated from aconite and lily of the valley, effectively inhibits the activity of α7 nAChR agonists. Studies have shown that MLA can reduce nicotine-induced cancer cell proliferation and migration through a hepatocyte growth factor (HGF)-dependent mechanism in lung cancer cells [ 95 270 271 272 273 274 As an α7 nAChR antagonist, α-neurotoxins (α-ctxs) in cone snail venom show potential in blocking multiple nAChR subtypes, including α7, α4β2, and α3β4 nAChRs, and can significantly inhibit the proliferation of cervical cancer and breast cancer cells [ 137 275 276 277 278 278 279 146 280 281 The neurotoxins belonging to the Ly-6 protein family, found in snake venom, are classified into short-chain and long-chain types [ 282 269 283 284 285 286 287 288 Naja kaouthia 289 291 292 292 293 294 288 The quinine-triazole molecule QND7 antagonizes α7 nAChR through both competitive and non-competitive mechanisms and promotes apoptosis in H460 and A549, with IC50 values of 75.40 µM and 76.29 µM, respectively. QND7 significantly reduces the growth and migration of lung cancer cells by inhibiting Akt/mTOR activity, but its potency and selectivity still need further optimization [ 295 211 296 297 298 Some compounds functioning as non-competitive α7 nAChR inhibitors lack several canonical pharmacophore elements, suggesting that the locations of their interaction are beyond the orthosteric binding site. For example, N3,N7-diaminobenzothiazine-5-ammonium derivatives containing a benzothiazine ring can reversibly antagonize α7 nAChR. Electrophysiological testing in African clawed frog oocytes injected with hα7 nAChR showed that these compounds act non-competitively, as they did not alter the EC50 value of ACh, likely achieving their effect by blocking ion flow and inhibiting conformational changes of the channel [ 299 121 121 300 269 301 302 303 304 305 Other molecules not only act as α7 nAChR antagonists but also modulate α7 nAChR expression. For instance, GW1929, an agonist of PPARα, has been demonstrated to suppress the expression of α7 nAChR in NSCLC cell lines by activating p38 MAPK and inhibiting the PI3K/AKT pathway. The mechanism of action is through transcriptional downregulation of α7 nAChR expression, induction of Egr-1 protein levels, and promotion of Egr-1 binding of Egr-1 to specific regulatory elements within the α7 nAChR gene promoter [ 306 307 310 311 Antagonists targeting α9α10 nAChRs are regarded as promising candidates for managing chronic and persistent inflammatory pain and hold potential applications in cancer therapy. These compounds include nitrogen-containing aromatic quaternary ammonium analogs, as well as those designed to combine pro-oxidants and mitochondrial toxins [ 297 312 313 297 314 315 316 315 317 318 319 320 321 322 323 321 318 320 324 329 330 331 325 332 333 325 334 316 330 332 335 315 30 336 337 315 315 315 338 339 137 339 275 115 Despite the pharmacological potential of conotoxins, their translational application is limited by factors including rapid degradation, labile disulfide bonds, restricted administration routes, and reduced efficacy on human α9α10 nAChR [ 340 342 343 315 344 137 330 333 345 331 346 314 331 347 348 349 341 350 351 352 355 353 356 358 359 360 361 366 359 367 368 369 279 370 Garcinol, isolated from the fruit of Garcinia indica, can effectively delay cancer progression in vivo through downregulating α9 nAChR expression and inhibiting nicotine-stimulated proliferation of breast cancer cells [ 371 372 373 374 375 α-Amyotoxin TxID can effectively and selectively block the α3β4 nAChRs, thereby inhibiting the growth of NCI-H1299 and A549 cells and enhancingthe antiproliferative efficacy in combination with doxorubicin [ 376 377 378 Desipramine and imipramine, both tricyclic antidepressants, can reversibly inhibit the inward current induced by the nAChR agonist dimethylphenylpiperazine iodide (DMPP), and their inhibitory effects are independent of the agonist concentration. This suggests that the modulation of neuronal nAChRs by tricyclic antidepressants involves distinct and potentially receptor subtype-specific mechanisms [ 379 380 381 i 382 Various barriers, such as the blood-brain barrier (BBB), blood-brain tumor barrier (BBTB), and enzymatic barriers in vascular endothelial cells, tightly restrict the delivery of drugs and drug delivery systems to tumor sites. By targeting AChRs and combining with specific carriers, drug delivery efficiency and targeting can be further enhanced. A targeted carrier was developed by combining a specific ligand (RVG29 peptide), which can bind to AChRs, with polyethylene glycol-modified poly(d, l-lactic-co-glycolic acid) (PEG-PLGA), and docetaxel nanoparticles (DTX-NPs) were prepared via a nanoprecipitation method. These nanoparticles have a diameter of approximately 110 nm and a smooth surface. Enzyme-linked immunosorbent assay (ELISA) results show that the number of receptors on glioma cell surfaces is 2.04 times that of non-malignant cells, which may promote the accumulation of RVG29-modified nanoparticles at the target site. In vitro cell uptake tests revealed that these nanoparticles exhibited targeted properties for glioma cells, and compared with non-targeted nanoparticles, targeted nanoparticles showed better BBB penetration in the in vitro model [ 383 384 385 Different mAChR and nAChR subtypes play distinct roles across various cells and tissues. Selective antagonists targeting specific receptor subtypes can regulate their functions precisely, minimizing side effects on non-target tissues. For example, selective α7-nAChR antagonists suppress immune responses without significantly impacting other nAChR subtypes, enhancing treatment safety and specificity. Variations in receptor expression among tumor types and patients allow for personalized therapies tailored to individual receptor profiles, improving efficacy. Broad antagonism risks serious side effects due to the receptors’ involvement in many physiological processes, but subtype-specific modulation can reduce such risks—for instance, selective mAChR antagonists mitigate cardiovascular and nervous system side effects, while selective nAChR antagonists avoid impairing cognitive function. Deepening our understanding of these receptor subtypes may uncover novel therapeutic targets and aid in developing more effective cancer treatments. Overall, mAChR and nAChR antagonists hold great promise for cancer therapy by enhancing specificity, reducing side effects, and enabling personalized approaches. Continued research into their mechanisms and clinical applications will advance cancer immunotherapy strategies. Regulation of acetylcholine synthesis, transport, and degradation pathways The synthesis, transport, and degradation of ACh in both neural and non-neural tissues are crucial for its functional roles. Regulating these processes can significantly affect the biological effects of ACh and, in turn, influence the tumor microenvironment. The synthesis of ACh is catalyzed by ChAT. Choline is taken up from the extracellular fluid by the CHT1 and combines with acetyl-CoA to form ACh. The uptake of choline is regulated by CHT1, while the supply of acetyl-CoA depends on intracellular metabolic pathways. By modulating the activity of ChAT or affecting the supply of choline and acetyl-CoA, the synthesis of ACh can be effectively adjusted, playing an important role in various physiological or pathological states. ONO-4819 (a selective EP4 receptor agonist) has been shown to upregulate the mRNA expression and activity of ChAT, significantly increasing the intracellular ACh content and release, thereby inhibiting the proliferation of MOLT-3 cells [ 386 387 7 7 388 ACh synthesized in the cell is transported into neuronal synaptic vesicles, preparing for the transmission of nerve impulses. The VAChT is responsible for transporting ACh from the cytoplasm into the synaptic vesicles. The function of VAChT is regulated by various factors, including the calcium ion concentration at the presynaptic membrane and the pH of the synaptic vesicle. By modulating VAChT function, the storage and release of ACh can be altered, which holds potential for therapeutic applications in neurological diseases. Additionally, selective VAChT inhibitors can reduce the vesicular storage of ACh, thereby affecting its release. Selective VAChT inhibitors can specifically regulate certain AChR subtypes, reducing side effects on other non-target receptors. In human bronchial epithelial cells (BACs), ACh can be synthesized, and a variety of cholinergic components are present, including AChE, ChAT, CHT1(SLC5A7), VAChT(SLC18A3), and nAChRs(CHRNAs). Research has shown that nicotine can increase ACh production in human BACs, and ACh acts as a growth factor for these cells. Nicotine-induced ACh production is mediated through α7-, α3β2-, and β3-nAChRs, ChAT, and VAChT pathways. Observations indicate that nicotine upregulates the expression of ChAT and VAChT. Therefore, we hypothesize that VAChT antagonists (such as vesamicol) may inhibit the growth of human BACs by suppressing VAChT function [ 389 ACh is rapidly degraded in the synaptic cleft by AChE into choline and acetic acid. The primary function of AChE is to clear ACh following nerve impulses, thereby terminating signal transmission. Regulation of AChE activity can influence the rate of ACh clearance and its local concentration, subsequently altering its biological effects. Within the tumor microenvironment, the role of ACh is complex and paradoxical. On one hand, ACh can promote the growth, invasion, and migration of various tumors by acting on its receptors; on the other hand, it can exhibit anti-tumor effects under certain conditions. For example, ACh has been shown to suppress the malignant behavior of colon cancer cells via α7-nAChR [ 136 390 1 + 391 2 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 406 In summary, the synthesis, transport, and degradation pathways of ACh play key roles in regulating its biological effects. Acetylcholinesterase inhibitors and VAChT modulation can not only be used in the treatment of neurological diseases but may also play a significant role in tumor immunotherapy. Further investigation of the regulatory mechanisms of these pathways could lead to the development of more effective treatment strategies, improving patient outcomes and quality of life. Combination of acetylcholine with tumor immunotherapy The regulatory role of ACh in the tumor immune microenvironment provides new therapeutic approaches for its combination with existing immunotherapies, particularly in enhancing immunotherapy efficacy. By exploring the combined strategies of ACh with anti-PD-1/PD-L1 therapy, cell therapy, and vaccination, innovative progress in cancer treatment may be achieved. ACh is synthesized through a process catalyzed byChAT, where choline combines with acetyl-CoA to form ACh. However, due to the extremely short half-life of ACh in vivo, directly measuring its levels is challenging. Instead, choline, a more stable metabolite, is often used as an indirect indicator of ACh activity. In a phase II clinical trial ( NCT02644369 154 255 407 ACh modulators may play a crucial role in mitigating ICI-related adverse events (irAEs). While ICIs have achieved significant efficacy in cancer treatment, their use is often accompanied by immune-related adverse events affecting multiple organ systems, particularly neurotoxicity, such as immune-mediated myasthenia, myositis, and severe myasthenia gravis (MG). These toxicities are often associated with excessive inflammatory activation, and the anti-inflammatory function of ACh provides a theoretical basis for its use in reducing irAEs during ICI therapy. ACh modulators, especially AChE inhibitors, increase local ACh concentrations, enhancing its effects on muscarinic and nicotinic ACh receptors, thereby reducing autoimmune attacks at neuromuscular junctions and alleviating ICI-induced neurotoxicity. For instance, myasthenia gravis is an autoimmune disorder characterized by AChR autoantibody-mediated disruption of neuromuscular transmission. In some patients, ICIs can exacerbate this autoimmune reaction, worsening MG symptoms [ 408 409 410 Clinical studies At present, clinical research on ACh signal antagonists in cancer therapy remains limited. However, some studies have preliminarily explored the potential role of the cholinergic system in cancer treatment. For example, one study investigated the clinical management and outcomes of patients who developed ICI-induced myasthenia gravis following ICI therapy. Many of these patients received treatment regimens that included AChE inhibitors, such as pyridostigmine or ambenonium [ 411 NCT05241249 NCT04563013 NCT00369785 NCT00452868 NCT01466270 NCT00006349 Conclusion ACh, as a key neurotransmitter, has recently been increasingly recognized for its complex role in tumor immune regulation. ACh influences tumor cell growth, metabolism, and apoptosis through nAChRs and mAChRs. Studies have shown that ACh can promote tumor cell proliferation and invasion while regulating metabolic processes that support tumor initiation and progression. Additionally, ACh plays a crucial role in shaping the tumor immune microenvironment. It affects the function of immune cells such as macrophages, T cells, and nNK cells, while inhibiting the activity of MDSCs and TregsThis modulation alters the immune state of the tumor microenvironment and impacts tumor immune evasion mechanisms. In terms of tumor angiogenesis, ACh regulates endothelial cell function and tumor stroma remodeling, influencing tumor blood supply and growth. As a result, ACh has emerged as a significant target in the study of tumor angiogenesis and stromal remodeling. Research further suggests that ACh modulators have great potential when combined with existing immunotherapies. These modulators may enhance immune responses, overcome resistance, and optimize treatment outcomes, thereby improving the efficacy of immune checkpoint inhibitors. Despite these advances, several challenges remain in the application of ACh in tumor immune regulation. First, the concentration of ACh in the tumor microenvironment is low and unevenly distributed, making accurate quantification in in vitro and in vivo models difficult [ 47 412 413 416 417 418 419 420 421 Abbreviations ACh Acetylcholine CNS Central nervous system nAChRs Nicotinic acetylcholine receptors mAChRs Muscarinic acetylcholine receptors TME Tumor microenvironment AChRs Acetylcholine receptors ChAT Choline acetyltransferase CHT Choline transporter TCR T cell receptor VAChT Vesicular acetylcholine transporter AChE Acetylcholinesterase NE Norepinephrine CCK Cholecystokinin GPCR G protein-coupled receptor PLC Phospholipase C EGFR Epidermal growth factor receptor MMP Matrix metalloproteinase IHC Immunohistochemical NSCLC Non-small cell lung cancer MAPK Mitogen-activated protein kinases α-BTX α-bungarotoxin HEX Hexafluoroethane EGFR-TKI Epidermal growth factor receptor tyrosine kinase inhibitor GBM Glioblastoma SCC Squamous cell lung cancer CUMS Chronic unpredictable stress ER Estrogen receptor ICC Intrahepatic cholangiocarcinoma CAMKII Calcium/calmodulin-dependent protein kinase II BDNF Brain-derived neurotrophic factor OC Ovarian cancer PGE2 Prostaglandin E2 COX-2 Cyclooxygenase-2 taVNS Transcutaneous auricular vagus nerve stimulation CAP Cholinergic anti-inflammatory pathway DMH Ddimethylhydrazine TNBC Triple-negative breast cancer M3R M3 muscarinic receptor NGF Nerve growth factor YAP Yes-associated protein PCa Prostate cancer CRPC Castration-resistant prostate cancer PDAC Pancreatic ductal adenocarcinoma shRNA Short hairpin RNA FV Friend virus complex IP3 Inositol trisphosphate IFN-γ Interferon-γ HV Hepatic vagotomy NNK Nicotine-derived nitrosamine ketone IDO1 Indoleamine 2,3-dioxygenase 1 IL-2 Interleukin-2 KO Knockout WT Wild-type CRC Colorectal cancer TAMs Tumor-associated macrophages MDMs Monocyte-derived macrophages NK Natural killer NETs Neutrophil extracellular traps ECM Extracellular matrix ECs Endothelial cells CGRP Calcitonin gene-related peptide SP Substance P DCs Dendritic cells OVA Ovalbumin pSTAT3 phosphorylated STAT3 DOPA Dihydroxyphenylalanine N-8-Iper Iper-8-naphthamide γ-H2AX Phosphorylated histone H2AX APE Arecaidine propargyl ester MLA Methyllycaconitine HGF Hepatocyte growth factor CBD Cannabidiol α-ctxs α-neurotoxins α-cbt α-cobra toxin OXA Oxaliplatin CCI Chronic constriction injury PEG Polyethylene glycol EGCG Epigallocatechin-3-gallate DMPP Dimethylphenylpiperazine iodide BBB Blood-brain barrier BBTB Blood-brain tumor barrier DTX-NPs Docetaxel nanoparticles ELISA Enzyme-linked immunosorbent assay BACs Bronchial epithelial cells PFS Progression-free survival OS Overall survival TMB Tumor mutation burden irAEs ICI-related adverse events MG Myasthenia gravis LC-MS Liquid chromatography-mass spectrometry Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Chunyu Zhang and Xiangdong Guo have contributed equally to this work. Acknowledgements The figures were created by Biorender.com. Author contributions C. Z. and X. G. contributed to conception and design of the manuscript; C. Z. and X. G. drafted the manuscript; Y. W. and S. Z. conducted data analysis and image processing; Z. W. critically reviewed and edited the manuscript; Z. W. given the final approval of the version to be published. All authors have read and approved the final version of the manuscript for publication. Funding This research was supported by the Fundamental Research Funds for the Central Universities (YCJJ20251101). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Dale HH Feldberg W Vogt M Release of acetylcholine at voluntary motor nerve endings J Physiol 1936 86 4 353 80 10.1113/jphysiol.1936.sp003371 16994763 PMC1394683 Dale HH, Feldberg W, Vogt M. Release of acetylcholine at voluntary motor nerve endings. J Physiol. 1936;86(4):353–80. 16994763 10.1113/jphysiol.1936.sp003371 PMC1394683 2. Picciotto MR Higley MJ Mineur YS Acetylcholine as a neuromodulator: cholinergic signaling shapes nervous system function and behavior Neuron 2012 76 1 116 29 10.1016/j.neuron.2012.08.036 23040810 PMC3466476 Picciotto MR, Higley MJ, Mineur YS. Acetylcholine as a neuromodulator: cholinergic signaling shapes nervous system function and behavior. Neuron. 2012;76(1):116–29. 23040810 10.1016/j.neuron.2012.08.036 PMC3466476 3. Beckmann J Lips KS The non-neuronal cholinergic system in health and disease Pharmacology 2013 92 5–6 286 302 10.1159/000355835 24296914 Beckmann J, Lips KS. The non-neuronal cholinergic system in health and disease. Pharmacology. 2013;92(5–6):286–302. 24296914 10.1159/000355835 4. Wessler I Kirkpatrick CJ Acetylcholine beyond neurons: the non-neuronal cholinergic system in humans Br J Pharmacol 2008 154 8 1558 71 10.1038/bjp.2008.185 18500366 PMC2518461 Wessler I, Kirkpatrick CJ. Acetylcholine beyond neurons: the non-neuronal cholinergic system in humans. Br J Pharmacol. 2008;154(8):1558–71. 18500366 10.1038/bjp.2008.185 PMC2518461 5. Kawashima K Fujii T Basic and clinical aspects of non-neuronal acetylcholine: overview of non-neuronal cholinergic systems and their biological significance J Pharmacol Sci 2008 106 2 167 73 10.1254/jphs.FM0070073 18285657 Kawashima K, Fujii T. Basic and clinical aspects of non-neuronal acetylcholine: overview of non-neuronal cholinergic systems and their biological significance. J Pharmacol Sci. 2008;106(2):167–73. 18285657 10.1254/jphs.fm0070073 6. Bele T Turk T Križaj I Nicotinic acetylcholine receptors in cancer: limitations and prospects Biochim Et Biophys Acta Mol Basis Disease 2024 1870 1 166875 10.1016/j.bbadis.2023.166875 37673358 Bele T, Turk T, Križaj I. Nicotinic acetylcholine receptors in cancer: limitations and prospects. Biochim Et Biophys Acta Mol Basis Disease. 2024;1870(1):166875. 10.1016/j.bbadis.2023.166875 37673358 7. Friedman JR Richbart SD Merritt JC Brown KC Nolan NA Akers AT Lau JK Robateau ZR Miles SL Dasgupta P Acetylcholine signaling system in progression of lung cancers Pharmacol Ther 2019 194 222 54 10.1016/j.pharmthera.2018.10.002 30291908 PMC6348061 Friedman JR, Richbart SD, Merritt JC, Brown KC, Nolan NA, Akers AT, Lau JK, Robateau ZR, Miles SL, Dasgupta P. Acetylcholine signaling system in progression of lung cancers. Pharmacol Ther. 2019;194:222–54. 30291908 10.1016/j.pharmthera.2018.10.002 PMC6348061 8. Zheng C Liu S Fazel Modares N St Paul M Mak TW Cholinergic T cells revitalize the tumor immune microenvironment: TIME to chat Nat Immunol 2025 26 5 665 77 10.1038/s41590-025-02144-4 40307453 Zheng C, Liu S, Fazel Modares N, St Paul M, Mak TW. Cholinergic T cells revitalize the tumor immune microenvironment: TIME to chat. Nat Immunol. 2025;26(5):665–77. 40307453 10.1038/s41590-025-02144-4 9. Sampaio Moura N, Schledwitz A, Alizadeh M, Kodan A, Njei LP, Raufman JP. Cholinergic mechanisms in Gastrointestinal neoplasia. Int J Mol Sci 2024, 25(10). 10.3390/ijms25105316 PMC11120676 38791353 10. Dey S Ray K Cholinergic activity is essential for maintaining the anterograde transport of choline acetyltransferase in drosophila Sci Rep 2018 8 1 8028 10.1038/s41598-018-26176-z 29795337 PMC5966444 Dey S, Ray K. Cholinergic activity is essential for maintaining the anterograde transport of choline acetyltransferase in drosophila. Sci Rep. 2018;8(1):8028. 29795337 10.1038/s41598-018-26176-z PMC5966444 11. Ojiakor OA Rylett RJ Modulation of sodium-coupled choline transporter CHT function in health and disease Neurochem Int 2020 140 104810 10.1016/j.neuint.2020.104810 32768485 Ojiakor OA, Rylett RJ. Modulation of sodium-coupled choline transporter CHT function in health and disease. Neurochem Int. 2020;140:104810. 32768485 10.1016/j.neuint.2020.104810 12. Grando SA Kawashima K Kirkpatrick CJ Kummer W Wessler I Recent progress in revealing the biological and medical significance of the non-neuronal cholinergic system Int Immunopharmacol 2015 29 1 1 7 10.1016/j.intimp.2015.08.023 26362206 Grando SA, Kawashima K, Kirkpatrick CJ, Kummer W, Wessler I. Recent progress in revealing the biological and medical significance of the non-neuronal cholinergic system. Int Immunopharmacol. 2015;29(1):1–7. 26362206 10.1016/j.intimp.2015.08.023 13. Schledwitz A, Sundel MH, Alizadeh M, Hu S, Xie G, Raufman JP. Differential actions of muscarinic receptor subtypes in gastric, pancreatic, and colon cancer. Int J Mol Sci 2021, 22(23). 10.3390/ijms222313153 PMC8658119 34884958 14. Tallini YN Shui B Greene KS Deng KY Doran R Fisher PJ Zipfel W Kotlikoff MI BAC Transgenic mice express enhanced green fluorescent protein in central and peripheral cholinergic neurons Physiol Genom 2006 27 3 391 7 10.1152/physiolgenomics.00092.2006 16940431 Tallini YN, Shui B, Greene KS, Deng KY, Doran R, Fisher PJ, Zipfel W, Kotlikoff MI. BAC Transgenic mice express enhanced green fluorescent protein in central and peripheral cholinergic neurons. Physiol Genom. 2006;27(3):391–7. 10.1152/physiolgenomics.00092.2006 16940431 15. Reardon C Duncan GS Brüstle A Brenner D Tusche MW Olofsson PS Rosas-Ballina M Tracey KJ Mak TW Lymphocyte-derived ach regulates local innate but not adaptive immunity Proc Natl Acad Sci U S A 2013 110 4 1410 5 10.1073/pnas.1221655110 23297238 PMC3557089 Reardon C, Duncan GS, Brüstle A, Brenner D, Tusche MW, Olofsson PS, Rosas-Ballina M, Tracey KJ, Mak TW. Lymphocyte-derived ach regulates local innate but not adaptive immunity. Proc Natl Acad Sci U S A. 2013;110(4):1410–5. 23297238 10.1073/pnas.1221655110 PMC3557089 16. Cox MA Duncan GS Lin GHY Steinberg BE Yu LX Brenner D Buckler LN Elia AJ Wakeham AC Nieman B Choline acetyltransferase-expressing T cells are required to control chronic viral infection Science 2019 363 6427 639 44 10.1126/science.aau9072 30733420 PMC7181845 Cox MA, Duncan GS, Lin GHY, Steinberg BE, Yu LX, Brenner D, Buckler LN, Elia AJ, Wakeham AC, Nieman B, et al. Choline acetyltransferase-expressing T cells are required to control chronic viral infection. Science. 2019;363(6427):639–44. 30733420 10.1126/science.aau9072 PMC7181845 17. Rosas-Ballina M Olofsson PS Ochani M Valdés-Ferrer SI Levine YA Reardon C Tusche MW Pavlov VA Andersson U Chavan S Acetylcholine-synthesizing T cells relay neural signals in a vagus nerve circuit Science 2011 334 6052 98 101 10.1126/science.1209985 21921156 PMC4548937 Rosas-Ballina M, Olofsson PS, Ochani M, Valdés-Ferrer SI, Levine YA, Reardon C, Tusche MW, Pavlov VA, Andersson U, Chavan S, et al. Acetylcholine-synthesizing T cells relay neural signals in a vagus nerve circuit. Science. 2011;334(6052):98–101. 21921156 10.1126/science.1209985 PMC4548937 18. Wu H Deng Y Zhao M Zhang J Zheng M Chen G Li L He Z Lu Q Molecular control of follicular helper T cell development and differentiation Front Immunol 2018 9 2470 10.3389/fimmu.2018.02470 30410493 PMC6209674 Wu H, Deng Y, Zhao M, Zhang J, Zheng M, Chen G, Li L, He Z, Lu Q. Molecular control of follicular helper T cell development and differentiation. Front Immunol. 2018;9:2470. 30410493 10.3389/fimmu.2018.02470 PMC6209674 19. Jørgensen NP Alstrup AK Mortensen FV Knudsen K Jakobsen S Madsen LB Bender D Breining P Petersen MS Schleimann MH Cholinergic PET imaging in infections and inflammation using (11)C-donepezil and (18)F-FEOBV Eur J Nucl Med Mol Imaging 2017 44 3 449 58 10.1007/s00259-016-3555-6 27785538 Jørgensen NP, Alstrup AK, Mortensen FV, Knudsen K, Jakobsen S, Madsen LB, Bender D, Breining P, Petersen MS, Schleimann MH, et al. Cholinergic PET imaging in infections and inflammation using (11)C-donepezil and (18)F-FEOBV. Eur J Nucl Med Mol Imaging. 2017;44(3):449–58. 27785538 10.1007/s00259-016-3555-6 20. Ogawa H Fujii T Watanabe Y Kawashima K Expression of multiple mRNA species for choline acetyltransferase in human T-lymphocytes Life Sci 2003 72 18–19 2127 30 10.1016/S0024-3205(03)00072-9 12628468 Ogawa H, Fujii T, Watanabe Y, Kawashima K. Expression of multiple mRNA species for choline acetyltransferase in human T-lymphocytes. Life Sci. 2003;72(18–19):2127–30. 12628468 10.1016/s0024-3205(03)00072-9 21. Kawashima K Fujii T Extraneuronal cholinergic system in lymphocytes Pharmacol Ther 2000 86 1 29 48 10.1016/S0163-7258(99)00071-6 10760545 Kawashima K, Fujii T. Extraneuronal cholinergic system in lymphocytes. Pharmacol Ther. 2000;86(1):29–48. 10760545 10.1016/s0163-7258(99)00071-6 22. Grimsholm O Rantapää-Dahlqvist S Dalén T Forsgren S Unexpected finding of a marked non-neuronal cholinergic system in human knee joint synovial tissue Neurosci Lett 2008 442 2 128 33 10.1016/j.neulet.2008.06.082 18621096 Grimsholm O, Rantapää-Dahlqvist S, Dalén T, Forsgren S. Unexpected finding of a marked non-neuronal cholinergic system in human knee joint synovial tissue. Neurosci Lett. 2008;442(2):128–33. 18621096 10.1016/j.neulet.2008.06.082 23. Jiang W Li D Han R Zhang C Jin WN Wood K Liu Q Shi FD Hao J Acetylcholine-producing NK cells attenuate CNS inflammation via modulation of infiltrating monocytes/macrophages Proc Natl Acad Sci U S A 2017 114 30 E6202 11 10.1073/pnas.1705491114 28696300 PMC5544318 Jiang W, Li D, Han R, Zhang C, Jin WN, Wood K, Liu Q, Shi FD, Hao J. Acetylcholine-producing NK cells attenuate CNS inflammation via modulation of infiltrating monocytes/macrophages. Proc Natl Acad Sci U S A. 2017;114(30):E6202–11. 28696300 10.1073/pnas.1705491114 PMC5544318 24. Prado MA Reis RA Prado VF de Mello MC Gomez MV de Mello FG Regulation of acetylcholine synthesis and storage Neurochem Int 2002 41 5 291 9 10.1016/S0197-0186(02)00044-X 12176069 Prado MA, Reis RA, Prado VF, de Mello MC, Gomez MV, de Mello FG. Regulation of acetylcholine synthesis and storage. Neurochem Int. 2002;41(5):291–9. 12176069 10.1016/s0197-0186(02)00044-x 25. Kurzen H Schallreuter KU Novel aspects in cutaneous biology of acetylcholine synthesis and acetylcholine receptors Exp Dermatol 2004 13 Suppl 4 27 30 10.1111/j.1600-0625.2004.00258.x 15507109 Kurzen H, Schallreuter KU. Novel aspects in cutaneous biology of acetylcholine synthesis and acetylcholine receptors. Exp Dermatol. 2004;13(Suppl 4):27–30. 15507109 10.1111/j.1600-0625.2004.00258.x 26. Hedtke V Bakovic M Choline transport for phospholipid synthesis: an emerging role of choline transporter-like protein 1 Experimental Biology Med (Maywood NJ) 2019 244 8 655 62 10.1177/1535370219830997 PMC6552397 30776907 Hedtke V, Bakovic M. Choline transport for phospholipid synthesis: an emerging role of choline transporter-like protein 1. Experimental Biology Med (Maywood NJ). 2019;244(8):655–62. 10.1177/1535370219830997 PMC6552397 30776907 27. Amenta F Tayebati SK Pathways of acetylcholine synthesis, transport and release as targets for treatment of adult-onset cognitive dysfunction Curr Med Chem 2008 15 5 488 98 10.2174/092986708783503203 18289004 Amenta F, Tayebati SK. Pathways of acetylcholine synthesis, transport and release as targets for treatment of adult-onset cognitive dysfunction. Curr Med Chem. 2008;15(5):488–98. 18289004 10.2174/092986708783503203 28. Fujii T Takada-Takatori Y Kawashima K Regulatory mechanisms of acetylcholine synthesis and release by T cells Life Sci 2012 91 21–22 981 5 10.1016/j.lfs.2012.04.031 22569292 Fujii T, Takada-Takatori Y, Kawashima K. Regulatory mechanisms of acetylcholine synthesis and release by T cells. Life Sci. 2012;91(21–22):981–5. 22569292 10.1016/j.lfs.2012.04.031 29. Gergalova G Lykhmus O Kalashnyk O Koval L Chernyshov V Kryukova E Tsetlin V Komisarenko S Skok M Mitochondria express α7 nicotinic acetylcholine receptors to regulate Ca2 + accumulation and cytochrome c release: study on isolated mitochondria PLoS ONE 2012 7 2 e31361 10.1371/journal.pone.0031361 22359587 PMC3281078 Gergalova G, Lykhmus O, Kalashnyk O, Koval L, Chernyshov V, Kryukova E, Tsetlin V, Komisarenko S, Skok M. Mitochondria express α7 nicotinic acetylcholine receptors to regulate Ca2 + accumulation and cytochrome c release: study on isolated mitochondria. PLoS ONE. 2012;7(2):e31361. 22359587 10.1371/journal.pone.0031361 PMC3281078 30. Albuquerque EX Pereira EF Alkondon M Rogers SW Mammalian nicotinic acetylcholine receptors: from structure to function Physiol Rev 2009 89 1 73 120 10.1152/physrev.00015.2008 19126755 PMC2713585 Albuquerque EX, Pereira EF, Alkondon M, Rogers SW. Mammalian nicotinic acetylcholine receptors: from structure to function. Physiol Rev. 2009;89(1):73–120. 19126755 10.1152/physrev.00015.2008 PMC2713585 31. Conti-Tronconi BM McLane KE Raftery MA Grando SA Protti MP The nicotinic acetylcholine receptor: structure and autoimmune pathology Crit Rev Biochem Mol Biol 1994 29 2 69 123 10.3109/10409239409086798 8026215 Conti-Tronconi BM, McLane KE, Raftery MA, Grando SA, Protti MP. The nicotinic acetylcholine receptor: structure and autoimmune pathology. Crit Rev Biochem Mol Biol. 1994;29(2):69–123. 8026215 10.3109/10409239409086798 32. Ortells MO Lunt GG Evolutionary history of the ligand-gated ion-channel superfamily of receptors Trends Neurosci 1995 18 3 121 7 10.1016/0166-2236(95)93887-4 7754520 Ortells MO, Lunt GG. Evolutionary history of the ligand-gated ion-channel superfamily of receptors. Trends Neurosci. 1995;18(3):121–7. 7754520 10.1016/0166-2236(95)93887-4 33. Borroni V, Barrantes FJ. Homomeric and heteromeric α7 nicotinic acetylcholine receptors in health and some central nervous system diseases. Membranes 2021, 11(9). 10.3390/membranes11090664 PMC8465519 34564481 34. Fucile S Ca2 + permeability of nicotinic acetylcholine receptors Cell Calcium 2004 35 1 1 8 10.1016/j.ceca.2003.08.006 14670366 Fucile S. Ca2 + permeability of nicotinic acetylcholine receptors. Cell Calcium. 2004;35(1):1–8. 14670366 10.1016/j.ceca.2003.08.006 35. Fucile S Sucapane A Eusebi F Ca2 + permeability through rat cloned alpha9-containing nicotinic acetylcholine receptors Cell Calcium 2006 39 4 349 55 10.1016/j.ceca.2005.12.002 16451809 Fucile S, Sucapane A, Eusebi F. Ca2 + permeability through rat cloned alpha9-containing nicotinic acetylcholine receptors. Cell Calcium. 2006;39(4):349–55. 16451809 10.1016/j.ceca.2005.12.002 36. Fucile S Renzi M Lax P Eusebi F Fractional Ca(2+) current through human neuronal alpha7 nicotinic acetylcholine receptors Cell Calcium 2003 34 2 205 9 10.1016/S0143-4160(03)00071-X 12810063 Fucile S, Renzi M, Lax P, Eusebi F. Fractional Ca(2+) current through human neuronal alpha7 nicotinic acetylcholine receptors. Cell Calcium. 2003;34(2):205–9. 12810063 10.1016/s0143-4160(03)00071-x 37. Hurst R Rollema H Bertrand D Nicotinic acetylcholine receptors: from basic science to therapeutics Pharmacol Ther 2013 137 1 22 54 10.1016/j.pharmthera.2012.08.012 22925690 Hurst R, Rollema H, Bertrand D. Nicotinic acetylcholine receptors: from basic science to therapeutics. Pharmacol Ther. 2013;137(1):22–54. 22925690 10.1016/j.pharmthera.2012.08.012 38. King JR Nordman JC Bridges SP Lin MK Kabbani N Identification and characterization of a G Protein-binding cluster in α7 nicotinic acetylcholine receptors J Biol Chem 2015 290 33 20060 70 10.1074/jbc.M115.647040 26088141 PMC4536413 King JR, Nordman JC, Bridges SP, Lin MK, Kabbani N. Identification and characterization of a G Protein-binding cluster in α7 nicotinic acetylcholine receptors. J Biol Chem. 2015;290(33):20060–70. 26088141 10.1074/jbc.M115.647040 PMC4536413 39. Kabbani N Nichols RA Beyond the channel: metabotropic signaling by nicotinic receptors Trends Pharmacol Sci 2018 39 4 354 66 10.1016/j.tips.2018.01.002 29428175 Kabbani N, Nichols RA. Beyond the channel: metabotropic signaling by nicotinic receptors. Trends Pharmacol Sci. 2018;39(4):354–66. 29428175 10.1016/j.tips.2018.01.002 40. Papke RL Lindstrom JM Nicotinic acetylcholine receptors: conventional and unconventional ligands and signaling Neuropharmacology 2020 168 108021 10.1016/j.neuropharm.2020.108021 32146229 PMC7610230 Papke RL, Lindstrom JM. Nicotinic acetylcholine receptors: conventional and unconventional ligands and signaling. Neuropharmacology. 2020;168:108021. 32146229 10.1016/j.neuropharm.2020.108021 PMC7610230 41. Nordman JC Kabbani N Microtubule dynamics at the growth cone are mediated by α7 nicotinic receptor activation of a Gαq and IP3 receptor pathway FASEB Journal: Official Publication Federation Am Soc Experimental Biology 2014 28 7 2995 3006 10.1096/fj.14-251439 PMC4062821 24687992 Nordman JC, Kabbani N. Microtubule dynamics at the growth cone are mediated by α7 nicotinic receptor activation of a Gαq and IP3 receptor pathway. FASEB Journal: Official Publication Federation Am Soc Experimental Biology. 2014;28(7):2995–3006. 10.1096/fj.14-251439 PMC4062821 24687992 42. King JR Kabbani N Alpha 7 nicotinic receptor coupling to heterotrimeric G proteins modulates RhoA activation, cytoskeletal motility, and structural growth J Neurochem 2016 138 4 532 45 10.1111/jnc.13660 27167578 King JR, Kabbani N. Alpha 7 nicotinic receptor coupling to heterotrimeric G proteins modulates RhoA activation, cytoskeletal motility, and structural growth. J Neurochem. 2016;138(4):532–45. 27167578 10.1111/jnc.13660 43. Fujii T Mashimo M Moriwaki Y Misawa H Ono S Horiguchi K Kawashima K Physiological functions of the cholinergic system in immune cells J Pharmacol Sci 2017 134 1 1 21 10.1016/j.jphs.2017.05.002 28552584 Fujii T, Mashimo M, Moriwaki Y, Misawa H, Ono S, Horiguchi K, Kawashima K. Physiological functions of the cholinergic system in immune cells. J Pharmacol Sci. 2017;134(1):1–21. 28552584 10.1016/j.jphs.2017.05.002 44. Mashimo M, Moriwaki Y, Misawa H, Kawashima K, Fujii T. Regulation of immune functions by Non-Neuronal acetylcholine (ACh) via muscarinic and nicotinic ach receptors. Int J Mol Sci 2021, 22(13). 10.3390/ijms22136818 PMC8268711 34202925 45. Skok MV Kalashnik EN Koval LN Tsetlin VI Utkin YN Changeux JP Grailhe R Functional nicotinic acetylcholine receptors are expressed in B lymphocyte-derived cell lines Mol Pharmacol 2003 64 4 885 9 10.1124/mol.64.4.885 14500745 Skok MV, Kalashnik EN, Koval LN, Tsetlin VI, Utkin YN, Changeux JP, Grailhe R. Functional nicotinic acetylcholine receptors are expressed in B lymphocyte-derived cell lines. Mol Pharmacol. 2003;64(4):885–9. 14500745 10.1124/mol.64.4.885 46. Qian J Galitovskiy V Chernyavsky AI Marchenko S Grando SA Plasticity of the murine spleen T-cell cholinergic receptors and their role in in vitro differentiation of Naïve CD4 T cells toward the Th1, Th2 and Th17 lineages Genes Immun 2011 12 3 222 30 10.1038/gene.2010.72 21270829 Qian J, Galitovskiy V, Chernyavsky AI, Marchenko S, Grando SA. Plasticity of the murine spleen T-cell cholinergic receptors and their role in in vitro differentiation of Naïve CD4 T cells toward the Th1, Th2 and Th17 lineages. Genes Immun. 2011;12(3):222–30. 21270829 10.1038/gene.2010.72 47. Fujii T Mashimo M Moriwaki Y Misawa H Ono S Horiguchi K Kawashima K Expression and function of the cholinergic system in immune cells Front Immunol 2017 8 1085 10.3389/fimmu.2017.01085 28932225 PMC5592202 Fujii T, Mashimo M, Moriwaki Y, Misawa H, Ono S, Horiguchi K, Kawashima K. Expression and function of the cholinergic system in immune cells. Front Immunol. 2017;8:1085. 28932225 10.3389/fimmu.2017.01085 PMC5592202 48. Treinin M Papke RL Nizri E Ben-David Y Mizrachi T Brenner T Role of the α7 nicotinic acetylcholine receptor and RIC-3 in the cholinergic Anti-inflammatory pathway Cent Nerv Syst Agents Med Chem 2017 17 2 90 9 27573666 10.2174/1871524916666160829114533 Treinin M, Papke RL, Nizri E, Ben-David Y, Mizrachi T, Brenner T. Role of the α7 nicotinic acetylcholine receptor and RIC-3 in the cholinergic Anti-inflammatory pathway. Cent Nerv Syst Agents Med Chem. 2017;17(2):90–9. 27573666 10.2174/1871524916666160829114533 49. Hecker A, Küllmar M, Wilker S, Richter K, Zakrzewicz A, Atanasova S, Mathes V, Timm T, Lerner S, Klein J et al. Phosphocholine-Modified Macromolecules and Canonical Nicotinic Agonists Inhibit ATP-Induced IL-1β Release. Journal of immunology (Baltimore, Md 10.4049/jimmunol.1400974 26202987 50. Grando SA Connections of nicotine to cancer Nat Rev Cancer 2014 14 6 419 29 10.1038/nrc3725 24827506 Grando SA. Connections of nicotine to cancer. Nat Rev Cancer. 2014;14(6):419–29. 24827506 10.1038/nrc3725 51. Fujii T [An independent, non-neuronal cholinergic system in lymphocytes and its roles in regulation of immune function] Nihon Yakurigaku Zasshi Folia Pharmacol Japonica 2004 123 3 179 88 10.1254/fpj.123.179 14993730 Fujii T. [An independent, non-neuronal cholinergic system in lymphocytes and its roles in regulation of immune function]. Nihon Yakurigaku Zasshi Folia Pharmacol Japonica. 2004;123(3):179–88. 10.1254/fpj.123.179 14993730 52. Ma Y Liu S Jun H Wu J CHRNA2: a new paradigm in beige thermoregulation and metabolism Trends Cell Biol 2022 32 6 479 89 10.1016/j.tcb.2021.11.009 34952750 PMC9106810 Ma Y, Liu S, Jun H, Wu J. CHRNA2: a new paradigm in beige thermoregulation and metabolism. Trends Cell Biol. 2022;32(6):479–89. 34952750 10.1016/j.tcb.2021.11.009 PMC9106810 53. Kalashnyk O Lykhmus O Izmailov M Koval L Komisarenko S Skok M SARS-Cov-2 Spike protein fragment 674–685 protects mitochondria from releasing cytochrome c in response to apoptogenic influence Biochem Biophys Res Commun 2021 561 14 8 10.1016/j.bbrc.2021.05.018 34000512 PMC8112323 Kalashnyk O, Lykhmus O, Izmailov M, Koval L, Komisarenko S, Skok M. SARS-Cov-2 Spike protein fragment 674–685 protects mitochondria from releasing cytochrome c in response to apoptogenic influence. Biochem Biophys Res Commun. 2021;561:14–8. 34000512 10.1016/j.bbrc.2021.05.018 PMC8112323 54. Matta JA, Gu S, Davini WB, Bredt DS. Nicotinic acetylcholine receptor redux: discovery of accessories opens therapeutic vistas. Science 2021, 373(6556). 10.1126/science.abg6539 34385370 55. Schuller HM Cell type specific, receptor-mediated modulation of growth kinetics in human lung cancer cell lines by nicotine and tobacco-related nitrosamines Biochem Pharmacol 1989 38 20 3439 42 10.1016/0006-2952(89)90112-3 2573356 Schuller HM. Cell type specific, receptor-mediated modulation of growth kinetics in human lung cancer cell lines by nicotine and tobacco-related nitrosamines. Biochem Pharmacol. 1989;38(20):3439–42. 2573356 10.1016/0006-2952(89)90112-3 56. Maneckjee R Minna JD Opioid and nicotine receptors affect growth regulation of human lung cancer cell lines Proc Natl Acad Sci U S A 1990 87 9 3294 8 10.1073/pnas.87.9.3294 2159143 PMC53886 Maneckjee R, Minna JD. Opioid and nicotine receptors affect growth regulation of human lung cancer cell lines. Proc Natl Acad Sci U S A. 1990;87(9):3294–8. 2159143 10.1073/pnas.87.9.3294 PMC53886 57. Ferreira-Vieira TH Guimaraes IM Silva FR Ribeiro FM Alzheimer’s disease: targeting the cholinergic system Curr Neuropharmacol 2016 14 1 101 15 10.2174/1570159X13666150716165726 26813123 PMC4787279 Ferreira-Vieira TH, Guimaraes IM, Silva FR, Ribeiro FM. Alzheimer’s disease: targeting the cholinergic system. Curr Neuropharmacol. 2016;14(1):101–15. 26813123 10.2174/1570159X13666150716165726 PMC4787279 58. Dineley KT Pandya AA Yakel JL Nicotinic ach receptors as therapeutic targets in CNS disorders Trends Pharmacol Sci 2015 36 2 96 108 10.1016/j.tips.2014.12.002 25639674 PMC4324614 Dineley KT, Pandya AA, Yakel JL. Nicotinic ach receptors as therapeutic targets in CNS disorders. Trends Pharmacol Sci. 2015;36(2):96–108. 25639674 10.1016/j.tips.2014.12.002 PMC4324614 59. Stegemann A Böhm M Targeting the α7 nicotinic acetylcholine receptor-A novel road towards the future treatment of skin diseases Exp Dermatol 2020 29 9 924 31 10.1111/exd.14173 32780438 Stegemann A, Böhm M. Targeting the α7 nicotinic acetylcholine receptor-A novel road towards the future treatment of skin diseases. Exp Dermatol. 2020;29(9):924–31. 32780438 10.1111/exd.14173 60. Kennedy AC, Belgi A, Husselbee BW, Spanswick D, Norton RS, Robinson AJ. α-Conotoxin peptidomimetics: probing the minimal binding motif for effective analgesia. Toxins 2020, 12(8). 10.3390/toxins12080505 PMC7472027 32781580 61. Hone AJ McIntosh JM Nicotinic acetylcholine receptors in neuropathic and inflammatory pain FEBS Lett 2018 592 7 1045 62 10.1002/1873-3468.12884 29030971 PMC5899685 Hone AJ, McIntosh JM. Nicotinic acetylcholine receptors in neuropathic and inflammatory pain. FEBS Lett. 2018;592(7):1045–62. 29030971 10.1002/1873-3468.12884 PMC5899685 62. Engel AG Shen XM Selcen D Sine SM Congenital myasthenic syndromes: pathogenesis, diagnosis, and treatment Lancet Neurol 2015 14 4 420 34 10.1016/S1474-4422(14)70201-7 25792100 PMC4520251 Engel AG, Shen XM, Selcen D, Sine SM. Congenital myasthenic syndromes: pathogenesis, diagnosis, and treatment. Lancet Neurol. 2015;14(4):420–34. 25792100 10.1016/S1474-4422(14)70201-7 PMC4520251 63. Chen ZR, Huang JB, Yang SL, Hong FF. Role of Cholinergic Signaling in Alzheimer’s Disease. Molecules 2022, 27(6). 10.3390/molecules27061816 PMC8949236 35335180 64. Maeda S Qu Q Robertson MJ Skiniotis G Kobilka BK Structures of the M1 and M2 muscarinic acetylcholine receptor/G-protein complexes Science 2019 364 6440 552 7 10.1126/science.aaw5188 31073061 PMC7034192 Maeda S, Qu Q, Robertson MJ, Skiniotis G, Kobilka BK. Structures of the M1 and M2 muscarinic acetylcholine receptor/G-protein complexes. Science. 2019;364(6440):552–7. 31073061 10.1126/science.aaw5188 PMC7034192 65. Abrams P Andersson KE Buccafusco JJ Chapple C de Groat WC Fryer AD Kay G Laties A Nathanson NM Pasricha PJ Muscarinic receptors: their distribution and function in body systems, and the implications for treating overactive bladder Br J Pharmacol 2006 148 5 565 78 10.1038/sj.bjp.0706780 16751797 PMC1751864 Abrams P, Andersson KE, Buccafusco JJ, Chapple C, de Groat WC, Fryer AD, Kay G, Laties A, Nathanson NM, Pasricha PJ, et al. Muscarinic receptors: their distribution and function in body systems, and the implications for treating overactive bladder. Br J Pharmacol. 2006;148(5):565–78. 16751797 10.1038/sj.bjp.0706780 PMC1751864 66. Gil DW Krauss HA Bogardus AM WoldeMussie E Muscarinic receptor subtypes in human iris-ciliary body measured by Immunoprecipitation Investig Ophthalmol Vis Sci 1997 38 7 1434 42 9191607 Gil DW, Krauss HA, Bogardus AM, WoldeMussie E. Muscarinic receptor subtypes in human iris-ciliary body measured by Immunoprecipitation. Investig Ophthalmol Vis Sci. 1997;38(7):1434–42. 9191607 67. Bognar IT Altes U Beinhauer C Kessler I Fuder H A muscarinic receptor different from the M1, M2, M3 and M4 subtypes mediates the contraction of the rabbit Iris sphincter Naunyn Schmiedebergs Arch Pharmacol 1992 345 6 611 8 10.1007/BF00164573 1635586 Bognar IT, Altes U, Beinhauer C, Kessler I, Fuder H. A muscarinic receptor different from the M1, M2, M3 and M4 subtypes mediates the contraction of the rabbit Iris sphincter. Naunyn Schmiedebergs Arch Pharmacol. 1992;345(6):611–8. 1635586 10.1007/BF00164573 68. Bymaster FP Carter PA Yamada M Gomeza J Wess J Hamilton SE Nathanson NM McKinzie DL Felder CC Role of specific muscarinic receptor subtypes in cholinergic parasympathomimetic responses, in vivo phosphoinositide hydrolysis, and pilocarpine-induced seizure activity Eur J Neurosci 2003 17 7 1403 10 10.1046/j.1460-9568.2003.02588.x 12713643 Bymaster FP, Carter PA, Yamada M, Gomeza J, Wess J, Hamilton SE, Nathanson NM, McKinzie DL, Felder CC. Role of specific muscarinic receptor subtypes in cholinergic parasympathomimetic responses, in vivo phosphoinositide hydrolysis, and pilocarpine-induced seizure activity. Eur J Neurosci. 2003;17(7):1403–10. 12713643 10.1046/j.1460-9568.2003.02588.x 69. Matsui M Motomura D Karasawa H Fujikawa T Jiang J Komiya Y Takahashi S Taketo MM Multiple functional defects in peripheral autonomic organs in mice lacking muscarinic acetylcholine receptor gene for the M3 subtype Proc Natl Acad Sci U S A 2000 97 17 9579 84 10.1073/pnas.97.17.9579 10944224 PMC16907 Matsui M, Motomura D, Karasawa H, Fujikawa T, Jiang J, Komiya Y, Takahashi S, Taketo MM. Multiple functional defects in peripheral autonomic organs in mice lacking muscarinic acetylcholine receptor gene for the M3 subtype. Proc Natl Acad Sci U S A. 2000;97(17):9579–84. 10944224 10.1073/pnas.97.17.9579 PMC16907 70. Colecraft HM Egamino JP Sharma VK Sheu SS Signaling mechanisms underlying muscarinic receptor-mediated increase in contraction rate in cultured heart cells J Biol Chem 1998 273 48 32158 66 10.1074/jbc.273.48.32158 9822693 Colecraft HM, Egamino JP, Sharma VK, Sheu SS. Signaling mechanisms underlying muscarinic receptor-mediated increase in contraction rate in cultured heart cells. J Biol Chem. 1998;273(48):32158–66. 9822693 10.1074/jbc.273.48.32158 71. Dhein S van Koppen CJ Brodde OE Muscarinic receptors in the mammalian heart Pharmacol Res 2001 44 3 161 82 10.1006/phrs.2001.0835 11529684 Dhein S, van Koppen CJ, Brodde OE. Muscarinic receptors in the mammalian heart. Pharmacol Res. 2001;44(3):161–82. 11529684 10.1006/phrs.2001.0835 72. Khurana S Chacon I Xie G Yamada M Wess J Raufman JP Kennedy RH Vasodilatory effects of cholinergic agonists are greatly diminished in aorta from M3R-/- mice Eur J Pharmacol 2004 493 1–3 127 32 10.1016/j.ejphar.2004.04.012 15189773 Khurana S, Chacon I, Xie G, Yamada M, Wess J, Raufman JP, Kennedy RH. Vasodilatory effects of cholinergic agonists are greatly diminished in aorta from M3R-/- mice. Eur J Pharmacol. 2004;493(1–3):127–32. 15189773 10.1016/j.ejphar.2004.04.012 73. Yamada M Lamping KG Duttaroy A Zhang W Cui Y Bymaster FP McKinzie DL Felder CC Deng CX Faraci FM Cholinergic dilation of cerebral blood vessels is abolished in M(5) muscarinic acetylcholine receptor knockout mice Proc Natl Acad Sci U S A 2001 98 24 14096 101 10.1073/pnas.251542998 11707605 PMC61174 Yamada M, Lamping KG, Duttaroy A, Zhang W, Cui Y, Bymaster FP, McKinzie DL, Felder CC, Deng CX, Faraci FM, et al. Cholinergic dilation of cerebral blood vessels is abolished in M(5) muscarinic acetylcholine receptor knockout mice. Proc Natl Acad Sci U S A. 2001;98(24):14096–101. 11707605 10.1073/pnas.251542998 PMC61174 74. Kitazawa T Hirama R Masunaga K Nakamura T Asakawa K Cao J Teraoka H Unno T Komori S Yamada M Muscarinic receptor subtypes involved in carbachol-induced contraction of mouse uterine smooth muscle Naunyn Schmiedebergs Arch Pharmacol 2008 377 4–6 503 13 10.1007/s00210-007-0223-1 18071676 Kitazawa T, Hirama R, Masunaga K, Nakamura T, Asakawa K, Cao J, Teraoka H, Unno T, Komori S, Yamada M, et al. Muscarinic receptor subtypes involved in carbachol-induced contraction of mouse uterine smooth muscle. Naunyn Schmiedebergs Arch Pharmacol. 2008;377(4–6):503–13. 18071676 10.1007/s00210-007-0223-1 75. Chess-Williams R Muscarinic receptors of the urinary bladder: detrusor, urothelial and prejunctional Auton Autacoid Pharmacol 2002 22 3 133 45 10.1046/j.1474-8673.2002.00258.x 12452898 Chess-Williams R. Muscarinic receptors of the urinary bladder: detrusor, urothelial and prejunctional. Auton Autacoid Pharmacol. 2002;22(3):133–45. 12452898 10.1046/j.1474-8673.2002.00258.x 76. Donfack J Kogut P Forsythe S Solway J Ober C Sequence variation in the promoter region of the cholinergic receptor muscarinic 3 gene and asthma and atopy J Allergy Clin Immunol 2003 111 3 527 32 10.1067/mai.2003.71 12642833 Donfack J, Kogut P, Forsythe S, Solway J, Ober C. Sequence variation in the promoter region of the cholinergic receptor muscarinic 3 gene and asthma and atopy. J Allergy Clin Immunol. 2003;111(3):527–32. 12642833 10.1067/mai.2003.71 77. Chiba T Bharucha AE Thomforde GM Kost LJ Phillips SF Model of rapid Gastrointestinal transit in dogs: effects of muscarinic antagonists and a nitric oxide synthase inhibitor Neurogastroenterol Motil 2002 14 5 535 41 10.1046/j.1365-2982.2002.00357.x 12358682 Chiba T, Bharucha AE, Thomforde GM, Kost LJ, Phillips SF. Model of rapid Gastrointestinal transit in dogs: effects of muscarinic antagonists and a nitric oxide synthase inhibitor. Neurogastroenterol Motil. 2002;14(5):535–41. 12358682 10.1046/j.1365-2982.2002.00357.x 78. Rosenfeld GC Isolated parietal cells: adrenergic response and Pharmacology J Pharmacol Exp Ther 1984 229 3 763 7 10.1016/S0022-3565(25)21932-2 6202870 Rosenfeld GC. Isolated parietal cells: adrenergic response and Pharmacology. J Pharmacol Exp Ther. 1984;229(3):763–7. 6202870 79. Raufman JP Sutliff VE Kasbekar DK Jensen RT Gardner JD Pepsinogen secretion from dispersed chief cells from Guinea pig stomach Am J Physiol 1984 247 1 Pt 1 G95 104 6430103 10.1152/ajpgi.1984.247.1.G95 Raufman JP, Sutliff VE, Kasbekar DK, Jensen RT, Gardner JD. Pepsinogen secretion from dispersed chief cells from Guinea pig stomach. Am J Physiol. 1984;247(1 Pt 1):G95–104. 6430103 10.1152/ajpgi.1984.247.1.G95 80. Xie G Drachenberg C Yamada M Wess J Raufman JP Cholinergic agonist-induced pepsinogen secretion from murine gastric chief cells is mediated by M1 and M3 muscarinic receptors Am J Physiol Gastrointest Liver Physiol 2005 289 3 G521 529 10.1152/ajpgi.00105.2004 15933222 Xie G, Drachenberg C, Yamada M, Wess J, Raufman JP. Cholinergic agonist-induced pepsinogen secretion from murine gastric chief cells is mediated by M1 and M3 muscarinic receptors. Am J Physiol Gastrointest Liver Physiol. 2005;289(3):G521–529. 15933222 10.1152/ajpgi.00105.2004 81. Kawashima K Yoshikawa K Fujii YX Moriwaki Y Misawa H Expression and function of genes encoding cholinergic components in murine immune cells Life Sci 2007 80 24–25 2314 9 10.1016/j.lfs.2007.02.036 17383684 Kawashima K, Yoshikawa K, Fujii YX, Moriwaki Y, Misawa H. Expression and function of genes encoding cholinergic components in murine immune cells. Life Sci. 2007;80(24–25):2314–9. 17383684 10.1016/j.lfs.2007.02.036 82. Gutkind JS Novotny EA Brann MR Robbins KC Muscarinic acetylcholine receptor subtypes as agonist-dependent oncogenes Proc Natl Acad Sci U S A 1991 88 11 4703 7 10.1073/pnas.88.11.4703 1905013 PMC51734 Gutkind JS, Novotny EA, Brann MR, Robbins KC. Muscarinic acetylcholine receptor subtypes as agonist-dependent oncogenes. Proc Natl Acad Sci U S A. 1991;88(11):4703–7. 1905013 10.1073/pnas.88.11.4703 PMC51734 83. Yu H Xia H Tang Q Xu H Wei G Chen Y Dai X Gong Q Bi F Acetylcholine acts through M3 muscarinic receptor to activate the EGFR signaling and promotes gastric cancer cell proliferation Sci Rep 2017 7 40802 10.1038/srep40802 28102288 PMC5244394 Yu H, Xia H, Tang Q, Xu H, Wei G, Chen Y, Dai X, Gong Q, Bi F. Acetylcholine acts through M3 muscarinic receptor to activate the EGFR signaling and promotes gastric cancer cell proliferation. Sci Rep. 2017;7:40802. 28102288 10.1038/srep40802 PMC5244394 84. Nie H Cao Q Zhu L Gong Y Gu J He Z Acetylcholine acts on androgen receptor to promote the migration and invasion but inhibit the apoptosis of human hepatocarcinoma PLoS ONE 2013 8 4 e61678 10.1371/journal.pone.0061678 23620780 PMC3631145 Nie H, Cao Q, Zhu L, Gong Y, Gu J, He Z. Acetylcholine acts on androgen receptor to promote the migration and invasion but inhibit the apoptosis of human hepatocarcinoma. PLoS ONE. 2013;8(4):e61678. 23620780 10.1371/journal.pone.0061678 PMC3631145 85. Muñoz JP, Calaf GM. Acetylcholine, another factor in breast cancer. Biology 2023, 12(11). 10.3390/biology12111418 PMC10669196 37998017 86. Chen RJ Ho YS Guo HR Wang YJ Long-term nicotine exposure-induced chemoresistance is mediated by activation of Stat3 and downregulation of ERK1/2 via nAChR and beta-adrenoceptors in human bladder cancer cells Toxicol Sci 2010 115 1 118 30 10.1093/toxsci/kfq028 20106947 Chen RJ, Ho YS, Guo HR, Wang YJ. Long-term nicotine exposure-induced chemoresistance is mediated by activation of Stat3 and downregulation of ERK1/2 via nAChR and beta-adrenoceptors in human bladder cancer cells. Toxicol Sci. 2010;115(1):118–30. 20106947 10.1093/toxsci/kfq028 87. Xie G Cheng K Shant J Raufman JP Acetylcholine-induced activation of M3 muscarinic receptors stimulates robust matrix metalloproteinase gene expression in human colon cancer cells Am J Physiol Gastrointest Liver Physiol 2009 296 4 G755 763 10.1152/ajpgi.90519.2008 19221016 PMC2670666 Xie G, Cheng K, Shant J, Raufman JP. Acetylcholine-induced activation of M3 muscarinic receptors stimulates robust matrix metalloproteinase gene expression in human colon cancer cells. Am J Physiol Gastrointest Liver Physiol. 2009;296(4):G755–763. 19221016 10.1152/ajpgi.90519.2008 PMC2670666 88. Carlisle DL Liu X Hopkins TM Swick MC Dhir R Siegfried JM Nicotine activates cell-signaling pathways through muscle-type and neuronal nicotinic acetylcholine receptors in non-small cell lung cancer cells Pulm Pharmacol Ther 2007 20 6 629 41 10.1016/j.pupt.2006.07.001 17015027 Carlisle DL, Liu X, Hopkins TM, Swick MC, Dhir R, Siegfried JM. Nicotine activates cell-signaling pathways through muscle-type and neuronal nicotinic acetylcholine receptors in non-small cell lung cancer cells. Pulm Pharmacol Ther. 2007;20(6):629–41. 17015027 10.1016/j.pupt.2006.07.001 89. Wang S Takayama K Tanaka K Takeshita M Nakagaki N Ijichi K Li H Nakanishi Y Nicotine induces resistance to epidermal growth factor receptor tyrosine kinase inhibitor by α1 nicotinic acetylcholine receptor-mediated activation in PC9 cells J Thorac Oncology: Official Publication Int Association Study Lung Cancer 2013 8 6 719 25 10.1097/JTO.0b013e31828b51d4 23625155 Wang S, Takayama K, Tanaka K, Takeshita M, Nakagaki N, Ijichi K, Li H, Nakanishi Y. Nicotine induces resistance to epidermal growth factor receptor tyrosine kinase inhibitor by α1 nicotinic acetylcholine receptor-mediated activation in PC9 cells. J Thorac Oncology: Official Publication Int Association Study Lung Cancer. 2013;8(6):719–25. 10.1097/JTO.0b013e31828b51d4 23625155 90. Li H Wang S Takayama K Harada T Okamoto I Iwama E Fujii A Ota K Hidaka N Kawano Y Nicotine induces resistance to erlotinib via cross-talk between α 1 nAChR and EGFR in the non-small cell lung cancer xenograft model Lung Cancer (Amsterdam Netherlands) 2015 88 1 1 8 10.1016/j.lungcan.2015.01.017 25670150 Li H, Wang S, Takayama K, Harada T, Okamoto I, Iwama E, Fujii A, Ota K, Hidaka N, Kawano Y, et al. Nicotine induces resistance to erlotinib via cross-talk between α 1 nAChR and EGFR in the non-small cell lung cancer xenograft model. Lung Cancer (Amsterdam Netherlands). 2015;88(1):1–8. 25670150 10.1016/j.lungcan.2015.01.017 91. Bakr MN Takahashi H Kikuchi Y CHRNA1 and its correlated-myogenesis/cell cycle genes are prognosis-related markers of metastatic melanoma Biochem Biophys Rep 2023 33 101425 36654921 10.1016/j.bbrep.2023.101425 PMC9841360 Bakr MN, Takahashi H, Kikuchi Y. CHRNA1 and its correlated-myogenesis/cell cycle genes are prognosis-related markers of metastatic melanoma. Biochem Biophys Rep. 2023;33:101425. 36654921 10.1016/j.bbrep.2023.101425 PMC9841360 92. Gondarenko E, Mazur D, Masliakova M, Ryabukha Y, Kasheverov I, Utkin Y, Tsetlin V, Shahparonov M, Kudryavtsev D, Antipova N. Subtype-Selective peptide and protein neurotoxic inhibitors of nicotinic acetylcholine receptors enhance proliferation of Patient-Derived glioblastoma cell lines. Toxins 2024, 16(2). 10.3390/toxins16020080 PMC10891657 38393158 93. Padilla A Keating P Hartmann JX Marí F Effects of α-conotoxin ImI on TNF-α, IL-8 and TGF-β expression by human macrophage-like cells derived from THP-1 pre-monocytic leukemic cells Sci Rep 2017 7 1 12742 10.1038/s41598-017-11586-2 28986583 PMC5630575 Padilla A, Keating P, Hartmann JX, Marí F. Effects of α-conotoxin ImI on TNF-α, IL-8 and TGF-β expression by human macrophage-like cells derived from THP-1 pre-monocytic leukemic cells. Sci Rep. 2017;7(1):12742. 28986583 10.1038/s41598-017-11586-2 PMC5630575 94. Li CL, Lin YK, Chen HA, Huang CY, Huang MT, Chang YJ. Smoking as an independent risk factor for hepatocellular carcinoma due to the α7-Nachr modulating the JAK2/STAT3 signaling axis. J Clin Med 2019, 8(9). 10.3390/jcm8091391 PMC6780871 31492006 95. Yoneyama R Aoshiba K Furukawa K Saito M Kataba H Nakamura H Ikeda N Nicotine enhances hepatocyte growth factor-mediated lung cancer cell migration by activating the α7 nicotine acetylcholine receptor and phosphoinositide kinase-3-dependent pathway Oncol Lett 2016 11 1 673 7 10.3892/ol.2015.3930 26870265 PMC4727086 Yoneyama R, Aoshiba K, Furukawa K, Saito M, Kataba H, Nakamura H, Ikeda N. Nicotine enhances hepatocyte growth factor-mediated lung cancer cell migration by activating the α7 nicotine acetylcholine receptor and phosphoinositide kinase-3-dependent pathway. Oncol Lett. 2016;11(1):673–7. 26870265 10.3892/ol.2015.3930 PMC4727086 96. Jiao Y Kang G Pan P Fan H Li Q Li X Li J Wang Y Jia Y Zhang L Acetylcholine promotes chronic stress-induced lung adenocarcinoma progression via α5-nAChR/FHIT pathway Cell Mol Life Sci 2023 80 5 119 10.1007/s00018-023-04742-7 37029227 PMC11072774 Jiao Y, Kang G, Pan P, Fan H, Li Q, Li X, Li J, Wang Y, Jia Y, Zhang L, et al. Acetylcholine promotes chronic stress-induced lung adenocarcinoma progression via α5-nAChR/FHIT pathway. Cell Mol Life Sci. 2023;80(5):119. 37029227 10.1007/s00018-023-04742-7 PMC11072774 97. Jia Y Zhang Q Liu Z Pan P Jia Y Zhu P Jiao Y Kang G Ma X The role of α5-nicotinic acetylcholine receptor/NLRP3 signaling pathway in lung adenocarcinoma cell proliferation and migration Toxicology 2022 469 153120 10.1016/j.tox.2022.153120 35131329 Jia Y, Zhang Q, Liu Z, Pan P, Jia Y, Zhu P, Jiao Y, Kang G, Ma X. The role of α5-nicotinic acetylcholine receptor/NLRP3 signaling pathway in lung adenocarcinoma cell proliferation and migration. Toxicology. 2022;469:153120. 35131329 10.1016/j.tox.2022.153120 98. Ma X Jia Y Zu S Li R Jia Y Zhao Y Xiao D Dang N Wang Y α5 nicotinic acetylcholine receptor mediates nicotine-induced HIF-1α and VEGF expression in non-small cell lung cancer Toxicol Appl Pharmcol 2014 278 2 172 9 10.1016/j.taap.2014.04.023 24793809 Ma X, Jia Y, Zu S, Li R, Jia Y, Zhao Y, Xiao D, Dang N, Wang Y. α5 nicotinic acetylcholine receptor mediates nicotine-induced HIF-1α and VEGF expression in non-small cell lung cancer. Toxicol Appl Pharmcol. 2014;278(2):172–9. 10.1016/j.taap.2014.04.023 24793809 99. Zhang Y Jia Y Li P Li H Xiao D Wang Y Ma X Reciprocal activation of α5-nAChR and STAT3 in nicotine-induced human lung cancer cell proliferation J Genet genomics = Yi Chuan Xue Bao 2017 44 7 355 62 10.1016/j.jgg.2017.03.003 28750889 Zhang Y, Jia Y, Li P, Li H, Xiao D, Wang Y, Ma X. Reciprocal activation of α5-nAChR and STAT3 in nicotine-induced human lung cancer cell proliferation. J Genet genomics = Yi Chuan Xue Bao. 2017;44(7):355–62. 28750889 10.1016/j.jgg.2017.03.003 100. Zhang Q Jia Y Pan P Zhang X Jia Y Zhu P Chen X Jiao Y Kang G Zhang L α5-nAChR associated with Ly6E modulates cell migration via TGF-β1/Smad signaling in non-small cell lung cancer Carcinogenesis 2022 43 4 393 404 10.1093/carcin/bgac003 34994389 Zhang Q, Jia Y, Pan P, Zhang X, Jia Y, Zhu P, Chen X, Jiao Y, Kang G, Zhang L, et al. α5-nAChR associated with Ly6E modulates cell migration via TGF-β1/Smad signaling in non-small cell lung cancer. Carcinogenesis. 2022;43(4):393–404. 34994389 10.1093/carcin/bgac003 101. Shehwana H Keskus AG Ozdemir SE Acikgöz AA Biyik-Sit R Cagnan I Gunes D Jahja E Cingir-Koker S Olmezer G CHRNA5 belongs to the secondary Estrogen signaling network exhibiting prognostic significance in breast cancer Cell Oncol (Dordrecht) 2021 44 2 453 72 10.1007/s13402-020-00581-x 33469842 Shehwana H, Keskus AG, Ozdemir SE, Acikgöz AA, Biyik-Sit R, Cagnan I, Gunes D, Jahja E, Cingir-Koker S, Olmezer G, et al. CHRNA5 belongs to the secondary Estrogen signaling network exhibiting prognostic significance in breast cancer. Cell Oncol (Dordrecht). 2021;44(2):453–72. 10.1007/s13402-020-00581-x 33469842 102. Cingir Koker S Jahja E Shehwana H Keskus AG Konu O Cholinergic receptor nicotinic alpha 5 (CHRNA5) RNAi is associated with cell cycle inhibition, apoptosis, DNA damage response and drug sensitivity in breast cancer PLoS ONE 2018 13 12 e0208982 10.1371/journal.pone.0208982 30543688 PMC6292578 Cingir Koker S, Jahja E, Shehwana H, Keskus AG, Konu O. Cholinergic receptor nicotinic alpha 5 (CHRNA5) RNAi is associated with cell cycle inhibition, apoptosis, DNA damage response and drug sensitivity in breast cancer. PLoS ONE. 2018;13(12):e0208982. 30543688 10.1371/journal.pone.0208982 PMC6292578 103. Dang N Meng X Qin G An Y Zhang Q Cheng X Huang S α5-nAChR modulates melanoma growth through the Notch1 signaling pathway J Cell Physiol 2020 235 11 7816 26 10.1002/jcp.29435 31907929 Dang N, Meng X, Qin G, An Y, Zhang Q, Cheng X, Huang S. α5-nAChR modulates melanoma growth through the Notch1 signaling pathway. J Cell Physiol. 2020;235(11):7816–26. 31907929 10.1002/jcp.29435 104. Fu Y Shen K Wang H Wang S Wang X Zhu L Zheng Y Zou T Ci H Dong Q Alpha5 nicotine acetylcholine receptor subunit promotes intrahepatic cholangiocarcinoma metastasis Signal Transduct Target Ther 2024 9 1 63 10.1038/s41392-024-01761-z 38453934 PMC10920868 Fu Y, Shen K, Wang H, Wang S, Wang X, Zhu L, Zheng Y, Zou T, Ci H, Dong Q, et al. Alpha5 nicotine acetylcholine receptor subunit promotes intrahepatic cholangiocarcinoma metastasis. Signal Transduct Target Ther. 2024;9(1):63. 38453934 10.1038/s41392-024-01761-z PMC10920868 105. Fu Y, Ci H, Du W, Dong Q, Jia H. CHRNA5 contributes to hepatocellular carcinoma progression by regulating YAP activity. Pharmaceutics 2022, 14(2). 10.3390/pharmaceutics14020275 PMC8877699 35214008 106. Qi JC Xue WY Zhang YP Qu CB Lu BS Yin YW Liu KL Wang DB Li W Zhao ZM Cholinergic α5 nicotinic receptor is involved in the proliferation and invasion of human prostate cancer cells Oncol Rep 2020 43 1 159 68 31789411 10.3892/or.2019.7411 PMC6908936 Qi JC, Xue WY, Zhang YP, Qu CB, Lu BS, Yin YW, Liu KL, Wang DB, Li W, Zhao ZM. Cholinergic α5 nicotinic receptor is involved in the proliferation and invasion of human prostate cancer cells. Oncol Rep. 2020;43(1):159–68. 31789411 10.3892/or.2019.7411 PMC6908936 107. Papapostolou I, Ross-Kaschitza D, Bochen F, Peinelt C, Maldifassi MC. Contribution of the α5 nAChR subunit and α5SNP to Nicotine-Induced proliferation and migration of human cancer cells. Cells 2023, 12(15). 10.3390/cells12152000 PMC10417634 37566079 108. Jia Y Sun H Wu H Zhang H Zhang X Xiao D Ma X Wang Y Nicotine inhibits Cisplatin-Induced apoptosis via regulating α5-nAChR/AKT signaling in human gastric cancer cells PLoS ONE 2016 11 2 e0149120 10.1371/journal.pone.0149120 26909550 PMC4765889 Jia Y, Sun H, Wu H, Zhang H, Zhang X, Xiao D, Ma X, Wang Y. Nicotine inhibits Cisplatin-Induced apoptosis via regulating α5-nAChR/AKT signaling in human gastric cancer cells. PLoS ONE. 2016;11(2):e0149120. 26909550 10.1371/journal.pone.0149120 PMC4765889 109. Harmych SJ Kumar J Bouni ME Chadee DN Nicotine inhibits MAPK signaling and spheroid invasion in ovarian cancer cells Exp Cell Res 2020 394 1 112167 10.1016/j.yexcr.2020.112167 32649943 PMC7434703 Harmych SJ, Kumar J, Bouni ME, Chadee DN. Nicotine inhibits MAPK signaling and spheroid invasion in ovarian cancer cells. Exp Cell Res. 2020;394(1):112167. 32649943 10.1016/j.yexcr.2020.112167 PMC7434703 110. Zhang C Yu P Zhu L Zhao Q Lu X Bo S Blockade of α7 nicotinic acetylcholine receptors inhibit nicotine-induced tumor growth and vimentin expression in non-small cell lung cancer through MEK/ERK signaling way Oncol Rep 2017 38 6 3309 18 29039603 10.3892/or.2017.6014 PMC5783576 Zhang C, Yu P, Zhu L, Zhao Q, Lu X, Bo S. Blockade of α7 nicotinic acetylcholine receptors inhibit nicotine-induced tumor growth and vimentin expression in non-small cell lung cancer through MEK/ERK signaling way. Oncol Rep. 2017;38(6):3309–18. 29039603 10.3892/or.2017.6014 PMC5783576 111. Phiboonchaiyanan PP Kiratipaiboon C Chanvorachote P Ciprofloxacin mediates cancer stem cell phenotypes in lung cancer cells through caveolin-1-dependent mechanism Chem Biol Interact 2016 250 1 11 10.1016/j.cbi.2016.03.005 26947806 Phiboonchaiyanan PP, Kiratipaiboon C, Chanvorachote P. Ciprofloxacin mediates cancer stem cell phenotypes in lung cancer cells through caveolin-1-dependent mechanism. Chem Biol Interact. 2016;250:1–11. 26947806 10.1016/j.cbi.2016.03.005 112. Zhong X Fan Y Ritzenthaler JD Zhang W Wang K Zhou Q Roman J Novel link between prostaglandin E2 (PGE2) and cholinergic signaling in lung cancer: the role of c-Jun in PGE2-induced α7 nicotinic acetylcholine receptor expression and tumor cell proliferation Thorac Cancer 2015 6 4 488 500 10.1111/1759-7714.12219 26273406 PMC4511329 Zhong X, Fan Y, Ritzenthaler JD, Zhang W, Wang K, Zhou Q, Roman J. Novel link between prostaglandin E2 (PGE2) and cholinergic signaling in lung cancer: the role of c-Jun in PGE2-induced α7 nicotinic acetylcholine receptor expression and tumor cell proliferation. Thorac Cancer. 2015;6(4):488–500. 26273406 10.1111/1759-7714.12219 PMC4511329 113. Iksen, Pothongsrisit S, Pongrakhananon V. Targeting the PI3K/AKT/mTOR signaling pathway in lung cancer: an update regarding potential drugs and natural products. Molecules 2021, 26(13). 10.3390/molecules26134100 PMC8271933 34279440 114. Phetphoung T Malla A Rattanapisit K Pisuttinusart N Damrongyot N Joyjamras K Chanvorachote P Phakham T Wongtangprasert T Strasser R Expression of plant-produced anti-PD-L1 antibody with Anoikis sensitizing activity in human lung cancer cells via., suppression on epithelial-mesenchymal transition PLoS ONE 2022 17 11 e0274737 10.1371/journal.pone.0274737 36367857 PMC9651560 Phetphoung T, Malla A, Rattanapisit K, Pisuttinusart N, Damrongyot N, Joyjamras K, Chanvorachote P, Phakham T, Wongtangprasert T, Strasser R, et al. Expression of plant-produced anti-PD-L1 antibody with Anoikis sensitizing activity in human lung cancer cells via., suppression on epithelial-mesenchymal transition. PLoS ONE. 2022;17(11):e0274737. 36367857 10.1371/journal.pone.0274737 PMC9651560 115. Mucchietto V Fasoli F Pucci S Moretti M Benfante R Maroli A Di Lascio S Bolchi C Pallavicini M Dowell C α9- and α7-containing receptors mediate the pro-proliferative effects of nicotine in the A549 adenocarcinoma cell line Br J Pharmacol 2018 175 11 1957 72 10.1111/bph.13954 28726253 PMC5980168 Mucchietto V, Fasoli F, Pucci S, Moretti M, Benfante R, Maroli A, Di Lascio S, Bolchi C, Pallavicini M, Dowell C, et al. α9- and α7-containing receptors mediate the pro-proliferative effects of nicotine in the A549 adenocarcinoma cell line. Br J Pharmacol. 2018;175(11):1957–72. 28726253 10.1111/bph.13954 PMC5980168 116. Nishioka T Luo LY Shen L He H Mariyannis A Dai W Chen C Nicotine increases the resistance of lung cancer cells to cisplatin through enhancing Bcl-2 stability Br J Cancer 2014 110 7 1785 92 10.1038/bjc.2014.78 24548862 PMC3974091 Nishioka T, Luo LY, Shen L, He H, Mariyannis A, Dai W, Chen C. Nicotine increases the resistance of lung cancer cells to cisplatin through enhancing Bcl-2 stability. Br J Cancer. 2014;110(7):1785–92. 24548862 10.1038/bjc.2014.78 PMC3974091 117. Kim J Shim MK Yang S Moon Y Song S Choi J Kim J Kim K Combination of cancer-specific prodrug nanoparticle with Bcl-2 inhibitor to overcome acquired drug resistance J Controlled Release: Official J Controlled Release Soc 2021 330 920 32 10.1016/j.jconrel.2020.10.065 33152391 Kim J, Shim MK, Yang S, Moon Y, Song S, Choi J, Kim J, Kim K. Combination of cancer-specific prodrug nanoparticle with Bcl-2 inhibitor to overcome acquired drug resistance. J Controlled Release: Official J Controlled Release Soc. 2021;330:920–32. 10.1016/j.jconrel.2020.10.065 33152391 118. Prateep A Sumkhemthong S Karnsomwan W De-Eknamkul W Chamni S Chanvorachote P Chaotham C Avicequinone B sensitizes Anoikis in human lung cancer cells J Biomed Sci 2018 25 1 32 10.1186/s12929-018-0435-3 29631569 PMC5890350 Prateep A, Sumkhemthong S, Karnsomwan W, De-Eknamkul W, Chamni S, Chanvorachote P, Chaotham C. Avicequinone B sensitizes Anoikis in human lung cancer cells. J Biomed Sci. 2018;25(1):32. 29631569 10.1186/s12929-018-0435-3 PMC5890350 119. Liu L Shi X Zhao H Yang M Wang C Liao M Zhao J Nicotine induces cell survival and chemoresistance by stimulating Mcl-1 phosphorylation and its interaction with bak in lung cancer J Cell Physiol 2019 234 9 15934 40 10.1002/jcp.28251 30741422 Liu L, Shi X, Zhao H, Yang M, Wang C, Liao M, Zhao J. Nicotine induces cell survival and chemoresistance by stimulating Mcl-1 phosphorylation and its interaction with bak in lung cancer. J Cell Physiol. 2019;234(9):15934–40. 30741422 10.1002/jcp.28251 120. Wang GZ Cheng X Li XC Liu YQ Wang XQ Shi X Wang ZY Guo YQ Wen ZS Huang YC Tobacco smoke induces production of chemokine CCL20 to promote lung cancer Cancer Lett 2015 363 1 60 70 10.1016/j.canlet.2015.04.005 25864589 Wang GZ, Cheng X, Li XC, Liu YQ, Wang XQ, Shi X, Wang ZY, Guo YQ, Wen ZS, Huang YC, et al. Tobacco smoke induces production of chemokine CCL20 to promote lung cancer. Cancer Lett. 2015;363(1):60–70. 25864589 10.1016/j.canlet.2015.04.005 121. Iskandar AR Miao B Li X Hu KQ Liu C Wang XD β-Cryptoxanthin reduced lung tumor multiplicity and inhibited lung cancer cell motility by downregulating nicotinic acetylcholine receptor α7 signaling Cancer Prev Res (Philadelphia Pa) 2016 9 11 875 86 10.1158/1940-6207.CAPR-16-0161 PMC5093079 27623933 Iskandar AR, Miao B, Li X, Hu KQ, Liu C, Wang XD. β-Cryptoxanthin reduced lung tumor multiplicity and inhibited lung cancer cell motility by downregulating nicotinic acetylcholine receptor α7 signaling. Cancer Prev Res (Philadelphia Pa). 2016;9(11):875–86. 10.1158/1940-6207.CAPR-16-0161 PMC5093079 27623933 122. Mahmood MQ Ward C Muller HK Sohal SS Walters EH Epithelial mesenchymal transition (EMT) and non-small cell lung cancer (NSCLC): a mutual association with airway disease Med Oncol (Northwood Lond Engl) 2017 34 3 45 10.1007/s12032-017-0900-y 28197929 Mahmood MQ, Ward C, Muller HK, Sohal SS, Walters EH. Epithelial mesenchymal transition (EMT) and non-small cell lung cancer (NSCLC): a mutual association with airway disease. Med Oncol (Northwood Lond Engl). 2017;34(3):45. 10.1007/s12032-017-0900-y 28197929 123. Zhang C Ding XP Zhao QN Yang XJ An SM Wang H Xu L Zhu L Chen HZ Role of α7-nicotinic acetylcholine receptor in nicotine-induced invasion and epithelial-to-mesenchymal transition in human non-small cell lung cancer cells Oncotarget 2016 7 37 59199 208 10.18632/oncotarget.10498 27409670 PMC5312305 Zhang C, Ding XP, Zhao QN, Yang XJ, An SM, Wang H, Xu L, Zhu L, Chen HZ. Role of α7-nicotinic acetylcholine receptor in nicotine-induced invasion and epithelial-to-mesenchymal transition in human non-small cell lung cancer cells. Oncotarget. 2016;7(37):59199–208. 27409670 10.18632/oncotarget.10498 PMC5312305 124. Schaal CM Bora-Singhal N Kumar DM Chellappan SP Regulation of Sox2 and stemness by nicotine and electronic-cigarettes in non-small cell lung cancer Mol Cancer 2018 17 1 149 10.1186/s12943-018-0901-2 30322398 PMC6190543 Schaal CM, Bora-Singhal N, Kumar DM, Chellappan SP. Regulation of Sox2 and stemness by nicotine and electronic-cigarettes in non-small cell lung cancer. Mol Cancer. 2018;17(1):149. 30322398 10.1186/s12943-018-0901-2 PMC6190543 125. Bhummaphan N Petpiroon N Prakhongcheep O Sritularak B Chanvorachote P Lusianthridin targeting of lung cancer stem cells via Src-STAT3 suppression Phytomedicine: Int J Phytotherapy Phytopharmacology 2019 62 152932 10.1016/j.phymed.2019.152932 31100681 Bhummaphan N, Petpiroon N, Prakhongcheep O, Sritularak B, Chanvorachote P. Lusianthridin targeting of lung cancer stem cells via Src-STAT3 suppression. Phytomedicine: Int J Phytotherapy Phytopharmacology. 2019;62:152932. 10.1016/j.phymed.2019.152932 31100681 126. Lien YC Wang W Kuo LJ Liu JJ Wei PL Ho YS Ting WC Wu CH Chang YJ Nicotine promotes cell migration through alpha7 nicotinic acetylcholine receptor in gastric cancer cells Ann Surg Oncol 2011 18 9 2671 9 10.1245/s10434-011-1598-2 21347787 Lien YC, Wang W, Kuo LJ, Liu JJ, Wei PL, Ho YS, Ting WC, Wu CH, Chang YJ. Nicotine promotes cell migration through alpha7 nicotinic acetylcholine receptor in gastric cancer cells. Ann Surg Oncol. 2011;18(9):2671–9. 21347787 10.1245/s10434-011-1598-2 127. Tu CC Huang CY Cheng WL Hung CS Uyanga B Wei PL Chang YJ The α7-nicotinic acetylcholine receptor mediates the sensitivity of gastric cancer cells to taxanes Tumour Biology: J Int Soc Oncodevelopmental Biology Med 2016 37 4 4421 8 10.1007/s13277-015-4260-y 26499946 Tu CC, Huang CY, Cheng WL, Hung CS, Uyanga B, Wei PL, Chang YJ. The α7-nicotinic acetylcholine receptor mediates the sensitivity of gastric cancer cells to taxanes. Tumour Biology: J Int Soc Oncodevelopmental Biology Med. 2016;37(4):4421–8. 10.1007/s13277-015-4260-y 26499946 128. Rao L Guo D Wu JP Cisplatin-resistance induces lung squamous carcinoma cell growth by nicotine-mediated α7nAchR/HDAC1/Cyclin D1/pRb cell cycle activation Cell Biochem Funct 2024 42 2 e3990 10.1002/cbf.3990 38504444 Rao L, Guo D, Wu JP. Cisplatin-resistance induces lung squamous carcinoma cell growth by nicotine-mediated α7nAchR/HDAC1/Cyclin D1/pRb cell cycle activation. Cell Biochem Funct. 2024;42(2):e3990. 38504444 10.1002/cbf.3990 129. Wan C Wu M Zhang S Chen Y Lu C α7nAChR-mediated recruitment of PP1γ promotes TRAF6/NF-κB cascade to facilitate the progression of hepatocellular carcinoma Mol Carcinog 2018 57 11 1626 39 10.1002/mc.22885 30074282 Wan C, Wu M, Zhang S, Chen Y, Lu C. α7nAChR-mediated recruitment of PP1γ promotes TRAF6/NF-κB cascade to facilitate the progression of hepatocellular carcinoma. Mol Carcinog. 2018;57(11):1626–39. 30074282 10.1002/mc.22885 130. Hajiasgharzadeh K Somi MH Mansoori B Khaze Shahgoli V Derakhshani A Mokhtarzadeh A Shanehbandi D Baradaran B Small interfering RNA targeting alpha7 nicotinic acetylcholine receptor sensitizes hepatocellular carcinoma cells to Sorafenib Life Sci 2020 244 117332 10.1016/j.lfs.2020.117332 31962133 Hajiasgharzadeh K, Somi MH, Mansoori B, Khaze Shahgoli V, Derakhshani A, Mokhtarzadeh A, Shanehbandi D, Baradaran B. Small interfering RNA targeting alpha7 nicotinic acetylcholine receptor sensitizes hepatocellular carcinoma cells to Sorafenib. Life Sci. 2020;244:117332. 31962133 10.1016/j.lfs.2020.117332 131. Nour MA Kheradmand F Rasmi Y Baradaran B Alpha7 nicotinic acetylcholine receptor expression in Sorafenib-resistant hepatocellular carcinoma cells Med Oncol (Northwood Lond Engl) 2022 39 11 165 10.1007/s12032-022-01745-5 35972579 Nour MA, Kheradmand F, Rasmi Y, Baradaran B. Alpha7 nicotinic acetylcholine receptor expression in Sorafenib-resistant hepatocellular carcinoma cells. Med Oncol (Northwood Lond Engl). 2022;39(11):165. 10.1007/s12032-022-01745-5 35972579 132. Chien CY, Chen YC, Hsu CC, Chou YT, Shiah SG, Liu SY, Hsieh AC, Yen CY, Lee CH, Shieh YS. YAP-Dependent bip induction is involved in Nicotine-Mediated oral cancer malignancy. Cells 2021, 10(8). 10.3390/cells10082080 PMC8392082 34440849 133. Hsu CC Tsai KY Su YF Chien CY Chen YC Wu YC Liu SY Shieh YS α7-Nicotine acetylcholine receptor mediated nicotine induced cell survival and cisplatin resistance in oral cancer Arch Oral Biol 2020 111 104653 10.1016/j.archoralbio.2020.104653 31935534 Hsu CC, Tsai KY, Su YF, Chien CY, Chen YC, Wu YC, Liu SY, Shieh YS. α7-Nicotine acetylcholine receptor mediated nicotine induced cell survival and cisplatin resistance in oral cancer. Arch Oral Biol. 2020;111:104653. 31935534 10.1016/j.archoralbio.2020.104653 134. Pucci S Fasoli F Moretti M Benfante R Di Lascio S Viani P Daga A Gordon TJ McIntosh M Zoli M Choline and nicotine increase glioblastoma cell proliferation by binding and activating α7- and α9- containing nicotinic receptors Pharmacol Res 2021 163 105336 10.1016/j.phrs.2020.105336 33276105 Pucci S, Fasoli F, Moretti M, Benfante R, Di Lascio S, Viani P, Daga A, Gordon TJ, McIntosh M, Zoli M, et al. Choline and nicotine increase glioblastoma cell proliferation by binding and activating α7- and α9- containing nicotinic receptors. Pharmacol Res. 2021;163:105336. 33276105 10.1016/j.phrs.2020.105336 135. Shi D Guo W Chen W Fu L Wang J Tian Y Xiao X Kang T Huang W Deng W Nicotine promotes proliferation of human nasopharyngeal carcinoma cells by regulating α7AChR, ERK, HIF-1α and VEGF/PEDF signaling PLoS ONE 2012 7 8 e43898 10.1371/journal.pone.0043898 22952803 PMC3432052 Shi D, Guo W, Chen W, Fu L, Wang J, Tian Y, Xiao X, Kang T, Huang W, Deng W. Nicotine promotes proliferation of human nasopharyngeal carcinoma cells by regulating α7AChR, ERK, HIF-1α and VEGF/PEDF signaling. PLoS ONE. 2012;7(8):e43898. 22952803 10.1371/journal.pone.0043898 PMC3432052 136. Rawat JK Roy S Singh M Guatam S Yadav RK Ansari MN Aldossary SA Saeedan AS Kaithwas G Transcutaneous vagus nerve stimulation regulates the cholinergic Anti-inflammatory pathway to counteract 1, 2-Dimethylhydrazine induced colon carcinogenesis in albino Wistar rats Front Pharmacol 2019 10 353 10.3389/fphar.2019.00353 31164817 PMC6536668 Rawat JK, Roy S, Singh M, Guatam S, Yadav RK, Ansari MN, Aldossary SA, Saeedan AS, Kaithwas G. Transcutaneous vagus nerve stimulation regulates the cholinergic Anti-inflammatory pathway to counteract 1, 2-Dimethylhydrazine induced colon carcinogenesis in albino Wistar rats. Front Pharmacol. 2019;10:353. 31164817 10.3389/fphar.2019.00353 PMC6536668 137. Sun Z, Zhangsun M, Dong S, Liu Y, Qian J, Zhangsun D, Luo S. Differential expression of nicotine acetylcholine receptors associates with human breast cancer and mediates antitumor activity of αO-Conotoxin gexiva. Mar Drugs 2020, 18(1). 10.3390/md18010061 PMC7024346 31963558 138. Lee CH Huang CS Chen CS Tu SH Wang YJ Chang YJ Tam KW Wei PL Cheng TC Chu JS Overexpression and activation of the alpha9-nicotinic receptor during tumorigenesis in human breast epithelial cells J Natl Cancer Inst 2010 102 17 1322 35 10.1093/jnci/djq300 20733118 Lee CH, Huang CS, Chen CS, Tu SH, Wang YJ, Chang YJ, Tam KW, Wei PL, Cheng TC, Chu JS, et al. Overexpression and activation of the alpha9-nicotinic receptor during tumorigenesis in human breast epithelial cells. J Natl Cancer Inst. 2010;102(17):1322–35. 20733118 10.1093/jnci/djq300 139. Lee CH Chang YC Chen CS Tu SH Wang YJ Chen LC Chang YJ Wei PL Chang HW Chang CH Crosstalk between nicotine and Estrogen-induced Estrogen receptor activation induces α9-nicotinic acetylcholine receptor expression in human breast cancer cells Breast Cancer Res Treat 2011 129 2 331 45 10.1007/s10549-010-1209-0 20953833 Lee CH, Chang YC, Chen CS, Tu SH, Wang YJ, Chen LC, Chang YJ, Wei PL, Chang HW, Chang CH, et al. Crosstalk between nicotine and Estrogen-induced Estrogen receptor activation induces α9-nicotinic acetylcholine receptor expression in human breast cancer cells. Breast Cancer Res Treat. 2011;129(2):331–45. 20953833 10.1007/s10549-010-1209-0 140. Huang LC Lin CL Qiu JZ Lin CY Hsu KW Tam KW Lee JY Yang JM Lee CH Nicotinic acetylcholine receptor subtype Alpha-9 mediates Triple-Negative breast cancers based on a spontaneous pulmonary metastasis mouse model Front Cell Neurosci 2017 11 336 10.3389/fncel.2017.00336 29163048 PMC5675882 Huang LC, Lin CL, Qiu JZ, Lin CY, Hsu KW, Tam KW, Lee JY, Yang JM, Lee CH. Nicotinic acetylcholine receptor subtype Alpha-9 mediates Triple-Negative breast cancers based on a spontaneous pulmonary metastasis mouse model. Front Cell Neurosci. 2017;11:336. 29163048 10.3389/fncel.2017.00336 PMC5675882 141. Ma X Geng R Zhao Y Xu W Li Y Jiang Y Liu Y Zhao L Li Y CHRNA9 as a new prognostic marker and potential therapeutic target in glioma J Cancer 2024 15 8 2095 109 10.7150/jca.92080 38495483 PMC10937273 Ma X, Geng R, Zhao Y, Xu W, Li Y, Jiang Y, Liu Y, Zhao L, Li Y. CHRNA9 as a new prognostic marker and potential therapeutic target in glioma. J Cancer. 2024;15(8):2095–109. 38495483 10.7150/jca.92080 PMC10937273 142. Schaal C Chellappan SP Nicotine-mediated cell proliferation and tumor progression in smoking-related cancers Mol Cancer Research: MCR 2014 12 1 14 23 10.1158/1541-7786.MCR-13-0541 24398389 PMC3915512 Schaal C, Chellappan SP. Nicotine-mediated cell proliferation and tumor progression in smoking-related cancers. Mol Cancer Research: MCR. 2014;12(1):14–23. 24398389 10.1158/1541-7786.MCR-13-0541 PMC3915512 143. Qin C Li T Wang Y Zhao B Li Z Li T Yang X Zhao Y Wang W CHRNB2 represses pancreatic cancer migration and invasion via inhibiting β-catenin pathway Cancer Cell Int 2022 22 1 340 10.1186/s12935-022-02768-8 36344976 PMC9641890 Qin C, Li T, Wang Y, Zhao B, Li Z, Li T, Yang X, Zhao Y, Wang W. CHRNB2 represses pancreatic cancer migration and invasion via inhibiting β-catenin pathway. Cancer Cell Int. 2022;22(1):340. 36344976 10.1186/s12935-022-02768-8 PMC9641890 144. Castillo-González AC Pelegrín-Hernández JP Nieto-Cerón S Madrona AP Noguera JA López-Moreno MF Rodríguez-López JN Vidal CJ Hellín-Meseguer D Cabezas-Herrera J Unbalanced acetylcholinesterase activity in larynx squamous cell carcinoma Int Immunopharmacol 2015 29 1 81 6 10.1016/j.intimp.2015.05.011 26002584 Castillo-González AC, Pelegrín-Hernández JP, Nieto-Cerón S, Madrona AP, Noguera JA, López-Moreno MF, Rodríguez-López JN, Vidal CJ, Hellín-Meseguer D, Cabezas-Herrera J. Unbalanced acetylcholinesterase activity in larynx squamous cell carcinoma. Int Immunopharmacol. 2015;29(1):81–6. 26002584 10.1016/j.intimp.2015.05.011 145. Tie P Cheng J Xue MX Yin J Fu G Duan WL SLC18A3 promoted renal cancer development through acetylcholine/camp signaling Am J Cancer Res 2022 12 9 4279 89 36225635 PMC9548016 Tie P, Cheng J, Xue MX, Yin J, Fu G, Duan WL. SLC18A3 promoted renal cancer development through acetylcholine/camp signaling. Am J Cancer Res. 2022;12(9):4279–89. 36225635 PMC9548016 146. Wang L Xu J Xia Y Yin K Li Z Li B Wang W Xu H Yang L Xu Z Muscarinic acetylcholine receptor 3 mediates vagus nerve-induced gastric cancer Oncogenesis 2018 7 11 88 10.1038/s41389-018-0099-6 30459304 PMC6246593 Wang L, Xu J, Xia Y, Yin K, Li Z, Li B, Wang W, Xu H, Yang L, Xu Z. Muscarinic acetylcholine receptor 3 mediates vagus nerve-induced gastric cancer. Oncogenesis. 2018;7(11):88. 30459304 10.1038/s41389-018-0099-6 PMC6246593 147. Kniewallner KM Grimm N Humpel C Platelet-derived nerve growth factor supports the survival of cholinergic neurons in organotypic rat brain slices Neurosci Lett 2014 574 64 9 10.1016/j.neulet.2014.05.033 24861506 PMC4311057 Kniewallner KM, Grimm N, Humpel C. Platelet-derived nerve growth factor supports the survival of cholinergic neurons in organotypic rat brain slices. Neurosci Lett. 2014;574:64–9. 24861506 10.1016/j.neulet.2014.05.033 PMC4311057 148. Hayakawa Y Sakitani K Konishi M Asfaha S Niikura R Tomita H Renz BW Tailor Y Macchini M Middelhoff M Nerve growth factor promotes gastric tumorigenesis through aberrant cholinergic signaling Cancer Cell 2017 31 1 21 34 10.1016/j.ccell.2016.11.005 27989802 PMC5225031 Hayakawa Y, Sakitani K, Konishi M, Asfaha S, Niikura R, Tomita H, Renz BW, Tailor Y, Macchini M, Middelhoff M, et al. Nerve growth factor promotes gastric tumorigenesis through aberrant cholinergic signaling. Cancer Cell. 2017;31(1):21–34. 27989802 10.1016/j.ccell.2016.11.005 PMC5225031 149. Azzolin L Panciera T Soligo S Enzo E Bicciato S Dupont S Bresolin S Frasson C Basso G Guzzardo V YAP/TAZ incorporation in the β-catenin destruction complex orchestrates the Wnt response Cell 2014 158 1 157 70 10.1016/j.cell.2014.06.013 24976009 Azzolin L, Panciera T, Soligo S, Enzo E, Bicciato S, Dupont S, Bresolin S, Frasson C, Basso G, Guzzardo V, et al. YAP/TAZ incorporation in the β-catenin destruction complex orchestrates the Wnt response. Cell. 2014;158(1):157–70. 24976009 10.1016/j.cell.2014.06.013 150. Schütz B Jurastow I Bader S Ringer C von Engelhardt J Chubanov V Gudermann T Diener M Kummer W Krasteva-Christ G Chemical coding and chemosensory properties of cholinergic brush cells in the mouse Gastrointestinal and biliary tract Front Physiol 2015 6 87 25852573 10.3389/fphys.2015.00087 PMC4371653 Schütz B, Jurastow I, Bader S, Ringer C, von Engelhardt J, Chubanov V, Gudermann T, Diener M, Kummer W, Krasteva-Christ G, et al. Chemical coding and chemosensory properties of cholinergic brush cells in the mouse Gastrointestinal and biliary tract. Front Physiol. 2015;6:87. 25852573 10.3389/fphys.2015.00087 PMC4371653 151. Middelhoff M Nienhüser H Valenti G Maurer HC Hayakawa Y Takahashi R Kim W Jiang Z Malagola E Cuti K Prox1-positive cells monitor and sustain the murine intestinal epithelial cholinergic niche Nat Commun 2020 11 1 111 10.1038/s41467-019-13850-7 31913277 PMC6949263 Middelhoff M, Nienhüser H, Valenti G, Maurer HC, Hayakawa Y, Takahashi R, Kim W, Jiang Z, Malagola E, Cuti K, et al. Prox1-positive cells monitor and sustain the murine intestinal epithelial cholinergic niche. Nat Commun. 2020;11(1):111. 31913277 10.1038/s41467-019-13850-7 PMC6949263 152. Hering NA, Liu V, Kim R, Weixler B, Droeser RA, Arndt M, Pozios I, Beyer K, Kreis ME, Seeliger H. Blockage of Cholinergic Signaling via Muscarinic Acetylcholine Receptor 3 Inhibits Tumor Growth in Human Colorectal Adenocarcinoma. Cancers (Basel) 10.3390/cancers13133220 PMC8267754 34203220 153. Xie G Raufman JP Muscarinic receptor signaling and colon cancer progression J Cancer Metastasis Treat 2016 2 195 200 10.20517/2394-4722.2016.05 32671227 PMC7362988 Xie G, Raufman JP. Muscarinic receptor signaling and colon cancer progression. J Cancer Metastasis Treat. 2016;2:195–200. 32671227 10.20517/2394-4722.2016.05 PMC7362988 154. Watson GA, Sanz-Garcia E, Zhang WJ, Liu ZA, Yang SC, Wang B, Liu S, Kubli S, Berman H, Pfister T et al. Increase in serum choline levels predicts for improved progression-free survival (PFS) in patients with advanced cancers receiving pembrolizumab. J Immunother Cancer 2022, 10(6). 10.1136/jitc-2021-004378 PMC9204435 35705312 155. Song P Sekhon HS Lu A Arredondo J Sauer D Gravett C Mark GP Grando SA Spindel ER M3 muscarinic receptor antagonists inhibit small cell lung carcinoma growth and mitogen-activated protein kinase phosphorylation induced by acetylcholine secretion Cancer Res 2007 67 8 3936 44 10.1158/0008-5472.CAN-06-2484 17440109 Song P, Sekhon HS, Lu A, Arredondo J, Sauer D, Gravett C, Mark GP, Grando SA, Spindel ER. M3 muscarinic receptor antagonists inhibit small cell lung carcinoma growth and mitogen-activated protein kinase phosphorylation induced by acetylcholine secretion. Cancer Res. 2007;67(8):3936–44. 17440109 10.1158/0008-5472.CAN-06-2484 156. Nie M, Chen N, Pang H, Jiang T, Jiang W, Tian P, Yao L, Chen Y, DeBerardinis RJ, Li W et al. Targeting acetylcholine signaling modulates persistent drug tolerance in EGFR-mutant lung cancer and impedes tumor relapse. J Clin Invest 2022, 132(20). 10.1172/JCI160152 PMC9566900 36048538 157. Goto Y Ando T Izumi H Feng X Arang N Gilardi M Wang Z Ando K Gutkind JS Muscarinic receptors promote castration-resistant growth of prostate cancer through a FAK-YAP signaling axis Oncogene 2020 39 20 4014 27 10.1038/s41388-020-1272-x 32205868 PMC7428076 Goto Y, Ando T, Izumi H, Feng X, Arang N, Gilardi M, Wang Z, Ando K, Gutkind JS. Muscarinic receptors promote castration-resistant growth of prostate cancer through a FAK-YAP signaling axis. Oncogene. 2020;39(20):4014–27. 32205868 10.1038/s41388-020-1272-x PMC7428076 158. Wang N Yao M Xu J Quan Y Zhang K Yang R Gao WQ Autocrine activation of CHRM3 promotes prostate cancer growth and castration resistance via CaM/CaMKK-Mediated phosphorylation of Akt Clin Cancer Res 2015 21 20 4676 85 10.1158/1078-0432.CCR-14-3163 26071486 Wang N, Yao M, Xu J, Quan Y, Zhang K, Yang R, Gao WQ. Autocrine activation of CHRM3 promotes prostate cancer growth and castration resistance via CaM/CaMKK-Mediated phosphorylation of Akt. Clin Cancer Res. 2015;21(20):4676–85. 26071486 10.1158/1078-0432.CCR-14-3163 159. Zhang L Xiu D Zhan J He X Guo L Wang J Tao M Fu W Zhang H High expression of muscarinic acetylcholine receptor 3 predicts poor prognosis in patients with pancreatic ductal adenocarcinoma OncoTargets Therapy 2016 9 6719 26 10.2147/OTT.S111382 27826198 PMC5096762 Zhang L, Xiu D, Zhan J, He X, Guo L, Wang J, Tao M, Fu W, Zhang H. High expression of muscarinic acetylcholine receptor 3 predicts poor prognosis in patients with pancreatic ductal adenocarcinoma. OncoTargets Therapy. 2016;9:6719–26. 27826198 10.2147/OTT.S111382 PMC5096762 160. Feng Y Hu X Liu G Lu L Zhao W Shen F Ma K Sun C Zhu C Zhang B M3 muscarinic acetylcholine receptors regulate epithelial-mesenchymal transition, perineural invasion, and migration/metastasis in cholangiocarcinoma through the AKT pathway Cancer Cell Int 2018 18 173 10.1186/s12935-018-0667-z 30450012 PMC6219094 Feng Y, Hu X, Liu G, Lu L, Zhao W, Shen F, Ma K, Sun C, Zhu C, Zhang B. M3 muscarinic acetylcholine receptors regulate epithelial-mesenchymal transition, perineural invasion, and migration/metastasis in cholangiocarcinoma through the AKT pathway. Cancer Cell Int. 2018;18:173. 30450012 10.1186/s12935-018-0667-z PMC6219094 161. Fiszman G Cattaneo V de la Torre E Español A Colombo L Sacerdote de Lustig E Sales ME Muscarinic receptors autoantibodies purified from mammary adenocarcinoma-bearing mice Sera stimulate tumor progression Int Immunopharmacol 2006 6 8 1323 30 10.1016/j.intimp.2006.04.007 16782546 Fiszman G, Cattaneo V, de la Torre E, Español A, Colombo L, Sacerdote de Lustig E, Sales ME. Muscarinic receptors autoantibodies purified from mammary adenocarcinoma-bearing mice Sera stimulate tumor progression. Int Immunopharmacol. 2006;6(8):1323–30. 16782546 10.1016/j.intimp.2006.04.007 162. Yin QQ Xu LH Zhang M Xu C Muscarinic acetylcholine receptor M1 mediates prostate cancer cell migration and invasion through Hedgehog signaling Asian J Androl 2018 20 6 608 14 10.4103/aja.aja_55_18 30027929 PMC6219293 Yin QQ, Xu LH, Zhang M, Xu C. Muscarinic acetylcholine receptor M1 mediates prostate cancer cell migration and invasion through Hedgehog signaling. Asian J Androl. 2018;20(6):608–14. 30027929 10.4103/aja.aja_55_18 PMC6219293 163. Wang Q, Chen J, Zhang M, Wang H, Zeng Y, Huang Y, Xu C. Autophagy Induced by Muscarinic Acetylcholine Receptor 1 Mediates Migration and Invasion Targeting Atg5 via AMPK/mTOR Pathway in Prostate Cancer. Journal of oncology 10.1155/2022/6523195 PMC9203210 35720225 164. Wang J Wei J Pu T Zeng A Karthikeyan V Bechtold B Vo K Chen J Lin TP Chang AP Cholinergic signaling via muscarinic M1 receptor confers resistance to docetaxel in prostate cancer Cell Rep Med 2024 5 2 101388 10.1016/j.xcrm.2023.101388 38262412 PMC10897519 Wang J, Wei J, Pu T, Zeng A, Karthikeyan V, Bechtold B, Vo K, Chen J, Lin TP, Chang AP, et al. Cholinergic signaling via muscarinic M1 receptor confers resistance to docetaxel in prostate cancer. Cell Rep Med. 2024;5(2):101388. 38262412 10.1016/j.xcrm.2023.101388 PMC10897519 165. Zhao Q Gu X Zhang C Lu Q Chen H Xu L Blocking M2 muscarinic receptor signaling inhibits tumor growth and reverses epithelial-mesenchymal transition (EMT) in non-small cell lung cancer (NSCLC) Cancer Biol Ther 2015 16 4 634 43 10.1080/15384047.2015.1029835 25778781 PMC4622973 Zhao Q, Gu X, Zhang C, Lu Q, Chen H, Xu L. Blocking M2 muscarinic receptor signaling inhibits tumor growth and reverses epithelial-mesenchymal transition (EMT) in non-small cell lung cancer (NSCLC). Cancer Biol Ther. 2015;16(4):634–43. 25778781 10.1080/15384047.2015.1029835 PMC4622973 166. Guerriero C Fanfarillo R Mancini P Sterbini V Guarguaglini G Sforna L Michelucci A Catacuzzeno L Tata AM M2 muscarinic receptors negatively modulate cell migration in human glioblastoma cells Neurochem Int 2024 174 105673 10.1016/j.neuint.2023.105673 38185384 Guerriero C, Fanfarillo R, Mancini P, Sterbini V, Guarguaglini G, Sforna L, Michelucci A, Catacuzzeno L, Tata AM. M2 muscarinic receptors negatively modulate cell migration in human glioblastoma cells. Neurochem Int. 2024;174:105673. 38185384 10.1016/j.neuint.2023.105673 167. Song S Lin Z Zhao C Wen J Chen J Xie S Qi H Wang J Su X Vagal-mAChR4 signaling promotes friend virus complex (FV)-induced acute erythroleukemia Virol Sin 2023 38 3 429 39 10.1016/j.virs.2023.05.005 37172825 PMC10311277 Song S, Lin Z, Zhao C, Wen J, Chen J, Xie S, Qi H, Wang J, Su X. Vagal-mAChR4 signaling promotes friend virus complex (FV)-induced acute erythroleukemia. Virol Sin. 2023;38(3):429–39. 37172825 10.1016/j.virs.2023.05.005 PMC10311277 168. Parnell EA Calleja-Macias IE Kalantari M Grando SA Bernard HU Muscarinic cholinergic signaling in cervical cancer cells affects cell motility via ERK1/2 signaling Life Sci 2012 91 21–22 1093 8 10.1016/j.lfs.2012.02.020 22406505 Parnell EA, Calleja-Macias IE, Kalantari M, Grando SA, Bernard HU. Muscarinic cholinergic signaling in cervical cancer cells affects cell motility via ERK1/2 signaling. Life Sci. 2012;91(21–22):1093–8. 22406505 10.1016/j.lfs.2012.02.020 169. Pettersson A Nilsson L Nylund G Khorram-Manesh A Nordgren S Delbro DS Is acetylcholine an autocrine/paracrine growth factor via the nicotinic alpha7-receptor subtype in the human colon cancer cell line HT-29? Eur J Pharmacol 2009 609 1–3 27 33 10.1016/j.ejphar.2009.03.002 19285065 Pettersson A, Nilsson L, Nylund G, Khorram-Manesh A, Nordgren S, Delbro DS. Is acetylcholine an autocrine/paracrine growth factor via the nicotinic alpha7-receptor subtype in the human colon cancer cell line HT-29? Eur J Pharmacol. 2009;609(1–3):27–33. 19285065 10.1016/j.ejphar.2009.03.002 170. Huang HK Lin PC Huang TT Hung HY Huang TW Huang EY Nicotine activates HIF-1α and regulates acid extruders through the nicotinic acetylcholine receptor to promote the Warburg effect in non-small cell lung cancer cells Eur J Pharmacol 2023 950 175778 10.1016/j.ejphar.2023.175778 37169144 Huang HK, Lin PC, Huang TT, Hung HY, Huang TW, Huang EY. Nicotine activates HIF-1α and regulates acid extruders through the nicotinic acetylcholine receptor to promote the Warburg effect in non-small cell lung cancer cells. Eur J Pharmacol. 2023;950:175778. 37169144 10.1016/j.ejphar.2023.175778 171. DeGeorge JJ Ousley AH McCarthy KD Lapetina EG Morell P Acetylcholine stimulates selective liberation and re-esterification of arachidonate and accumulation of inositol phosphates and Glycerophosphoinositol in C62B glioma cells J Biol Chem 1987 262 17 8077 83 10.1016/S0021-9258(18)47530-8 3110145 DeGeorge JJ, Ousley AH, McCarthy KD, Lapetina EG, Morell P. Acetylcholine stimulates selective liberation and re-esterification of arachidonate and accumulation of inositol phosphates and Glycerophosphoinositol in C62B glioma cells. J Biol Chem. 1987;262(17):8077–83. 3110145 172. Terpinskaya TI Osipov AV Balashevich TV Yanchanka TL Tamashionik EA Tsetlin VI Utkin YN Blockers of nicotinic acetylcholine receptors delay tumor growth and increase antitumor activity of mouse splenocytes Dokl Biochem Biophys 2020 491 1 89 92 10.1134/S1607672920020143 32483759 Terpinskaya TI, Osipov AV, Balashevich TV, Yanchanka TL, Tamashionik EA, Tsetlin VI, Utkin YN. Blockers of nicotinic acetylcholine receptors delay tumor growth and increase antitumor activity of mouse splenocytes. Dokl Biochem Biophys. 2020;491(1):89–92. 32483759 10.1134/S1607672920020143 173. Yang MW Tao LY Jiang YS Yang JY Huo YM Liu DJ Li J Fu XL He R Lin C Perineural invasion reprograms the immune microenvironment through cholinergic signaling in pancreatic ductal adenocarcinoma Cancer Res 2020 80 10 1991 2003 10.1158/0008-5472.CAN-19-2689 32098780 Yang MW, Tao LY, Jiang YS, Yang JY, Huo YM, Liu DJ, Li J, Fu XL, He R, Lin C, et al. Perineural invasion reprograms the immune microenvironment through cholinergic signaling in pancreatic ductal adenocarcinoma. Cancer Res. 2020;80(10):1991–2003. 32098780 10.1158/0008-5472.CAN-19-2689 174. Bauer KC, Trehan R, Ruf B, Myojin Y, Benmebarek MR, Ma C, Seifert M, Nur A, Qi J, Huang P et al. The Gut Microbiome Controls Liver Tumors via the Vagus Nerve. bioRxiv: the preprint server for biology 175. Liang F Wang GZ Wang Y Yang YN Wen ZS Chen DN Fang WF Zhang B Yang L Zhang C Tobacco carcinogen induces Tryptophan metabolism and immune suppression via induction of indoleamine 2,3-dioxygenase 1 Signal Transduct Target Ther 2022 7 1 311 10.1038/s41392-022-01127-3 36068203 PMC9448807 Liang F, Wang GZ, Wang Y, Yang YN, Wen ZS, Chen DN, Fang WF, Zhang B, Yang L, Zhang C, et al. Tobacco carcinogen induces Tryptophan metabolism and immune suppression via induction of indoleamine 2,3-dioxygenase 1. Signal Transduct Target Ther. 2022;7(1):311. 36068203 10.1038/s41392-022-01127-3 PMC9448807 176. Mashimo M Yurie Y Kawashima K Fujii T CRAC channels are required for [Ca(2+)]i oscillations and c-fos gene expression after muscarinic acetylcholine receptor activation in leukemic T cells Life Sci 2016 161 45 50 10.1016/j.lfs.2016.07.014 27474128 Mashimo M, Yurie Y, Kawashima K, Fujii T. CRAC channels are required for [Ca(2+)]i oscillations and c-fos gene expression after muscarinic acetylcholine receptor activation in leukemic T cells. Life Sci. 2016;161:45–50. 27474128 10.1016/j.lfs.2016.07.014 177. Nakata Y, Miura K, Yamasaki N, Ogata S, Miura S, Hosomi N, Kaminuma O. Expression and function of nicotinic acetylcholine receptors in induced regulatory T cells. Int J Mol Sci 2022, 23(3). 10.3390/ijms23031779 PMC8836781 35163704 178. Mashimo M Iwasaki Y Inoue S Saito S Kawashima K Fujii T Acetylcholine released from T cells regulates intracellular Ca(2+), IL-2 secretion and T cell proliferation through nicotinic acetylcholine receptor Life Sci 2017 172 13 8 10.1016/j.lfs.2016.12.015 28025040 Mashimo M, Iwasaki Y, Inoue S, Saito S, Kawashima K, Fujii T. Acetylcholine released from T cells regulates intracellular Ca(2+), IL-2 secretion and T cell proliferation through nicotinic acetylcholine receptor. Life Sci. 2017;172:13–8. 28025040 10.1016/j.lfs.2016.12.015 179. Wang H Yu M Ochani M Amella CA Tanovic M Susarla S Li JH Wang H Yang H Ulloa L Nicotinic acetylcholine receptor alpha7 subunit is an essential regulator of inflammation Nature 2003 421 6921 384 8 10.1038/nature01339 12508119 Wang H, Yu M, Ochani M, Amella CA, Tanovic M, Susarla S, Li JH, Wang H, Yang H, Ulloa L, et al. Nicotinic acetylcholine receptor alpha7 subunit is an essential regulator of inflammation. Nature. 2003;421(6921):384–8. 12508119 10.1038/nature01339 180. Fujii YX Fujigaya H Moriwaki Y Misawa H Kasahara T Grando SA Kawashima K Enhanced serum antigen-specific IgG1 and Proinflammatory cytokine production in nicotinic acetylcholine receptor alpha7 subunit gene knockout mice J Neuroimmunol 2007 189 1–2 69 74 10.1016/j.jneuroim.2007.07.003 17675251 Fujii YX, Fujigaya H, Moriwaki Y, Misawa H, Kasahara T, Grando SA, Kawashima K. Enhanced serum antigen-specific IgG1 and Proinflammatory cytokine production in nicotinic acetylcholine receptor alpha7 subunit gene knockout mice. J Neuroimmunol. 2007;189(1–2):69–74. 17675251 10.1016/j.jneuroim.2007.07.003 181. Mashimo M Komori M Matsui YY Murase MX Fujii T Takeshima S Okuyama H Ono S Moriwaki Y Misawa H Distinct roles of α7 nAChRs in Antigen-Presenting cells and CD4(+) T cells in the regulation of T cell differentiation Front Immunol 2019 10 1102 10.3389/fimmu.2019.01102 31214160 PMC6554293 Mashimo M, Komori M, Matsui YY, Murase MX, Fujii T, Takeshima S, Okuyama H, Ono S, Moriwaki Y, Misawa H, et al. Distinct roles of α7 nAChRs in Antigen-Presenting cells and CD4(+) T cells in the regulation of T cell differentiation. Front Immunol. 2019;10:1102. 31214160 10.3389/fimmu.2019.01102 PMC6554293 182. Mashimo M Fujii T Ono S Moriwaki Y Misawa H Kawashima K Minireview: divergent roles of α7 nicotinic acetylcholine receptors expressed on antigen-presenting cells and CD4(+) T cells in the regulation of T cell differentiation Int Immunopharmacol 2020 82 106306 10.1016/j.intimp.2020.106306 32086096 Mashimo M, Fujii T, Ono S, Moriwaki Y, Misawa H, Kawashima K. Minireview: divergent roles of α7 nicotinic acetylcholine receptors expressed on antigen-presenting cells and CD4(+) T cells in the regulation of T cell differentiation. Int Immunopharmacol. 2020;82:106306. 32086096 10.1016/j.intimp.2020.106306 183. Fransson M Piras E Burman J Nilsson B Essand M Lu B Harris RA Magnusson PU Brittebo E Loskog AS CAR/FoxP3-engineered T regulatory cells target the CNS and suppress EAE upon intranasal delivery J Neuroinflamm 2012 9 112 10.1186/1742-2094-9-112 PMC3403996 22647574 Fransson M, Piras E, Burman J, Nilsson B, Essand M, Lu B, Harris RA, Magnusson PU, Brittebo E, Loskog AS. CAR/FoxP3-engineered T regulatory cells target the CNS and suppress EAE upon intranasal delivery. J Neuroinflamm. 2012;9:112. 10.1186/1742-2094-9-112 PMC3403996 22647574 184. Fei R Zhang Y Wang S Xiang T Chen W α7 nicotinic acetylcholine receptor in tumor-associated macrophages inhibits colorectal cancer metastasis through the JAK2/STAT3 signaling pathway Oncol Rep 2017 38 5 2619 28 10.3892/or.2017.5935 28901507 PMC5780013 Fei R, Zhang Y, Wang S, Xiang T, Chen W. α7 nicotinic acetylcholine receptor in tumor-associated macrophages inhibits colorectal cancer metastasis through the JAK2/STAT3 signaling pathway. Oncol Rep. 2017;38(5):2619–28. 28901507 10.3892/or.2017.5935 PMC5780013 185. Tarnawski L Reardon C Caravaca AS Rosas-Ballina M Tusche MW Drake AR Hudson LK Hanes WM Li JH Parrish WR Adenylyl cyclase 6 mediates Inhibition of TNF in the inflammatory reflex Front Immunol 2018 9 2648 10.3389/fimmu.2018.02648 30538698 PMC6277584 Tarnawski L, Reardon C, Caravaca AS, Rosas-Ballina M, Tusche MW, Drake AR, Hudson LK, Hanes WM, Li JH, Parrish WR, et al. Adenylyl cyclase 6 mediates Inhibition of TNF in the inflammatory reflex. Front Immunol. 2018;9:2648. 30538698 10.3389/fimmu.2018.02648 PMC6277584 186. Fujii T Horiguchi K Sunaga H Moriwaki Y Misawa H Kasahara T Tsuji S Kawashima K SLURP-1, an endogenous α7 nicotinic acetylcholine receptor allosteric ligand, is expressed in CD205(+) dendritic cells in human tonsils and potentiates lymphocytic cholinergic activity J Neuroimmunol 2014 267 1–2 43 9 10.1016/j.jneuroim.2013.12.003 24365495 Fujii T, Horiguchi K, Sunaga H, Moriwaki Y, Misawa H, Kasahara T, Tsuji S, Kawashima K. SLURP-1, an endogenous α7 nicotinic acetylcholine receptor allosteric ligand, is expressed in CD205(+) dendritic cells in human tonsils and potentiates lymphocytic cholinergic activity. J Neuroimmunol. 2014;267(1–2):43–9. 24365495 10.1016/j.jneuroim.2013.12.003 187. Favre B Plantard L Aeschbach L Brakch N Christen-Zaech S de Viragh PA Sergeant A Huber M Hohl D SLURP1 is a late marker of epidermal differentiation and is absent in Mal de Meleda J Invest Dermatol 2007 127 2 301 8 10.1038/sj.jid.5700551 17008884 Favre B, Plantard L, Aeschbach L, Brakch N, Christen-Zaech S, de Viragh PA, Sergeant A, Huber M, Hohl D. SLURP1 is a late marker of epidermal differentiation and is absent in Mal de Meleda. J Invest Dermatol. 2007;127(2):301–8. 17008884 10.1038/sj.jid.5700551 188. Tracey KJ The inflammatory reflex Nature 2002 420 6917 853 9 10.1038/nature01321 12490958 Tracey KJ. The inflammatory reflex. Nature. 2002;420(6917):853–9. 12490958 10.1038/nature01321 189. Fukaya T Murakami R Takagi H Sato K Sato Y Otsuka H Ohno M Hijikata A Ohara O Hikida M Conditional ablation of CD205 + conventional dendritic cells impacts the regulation of T-cell immunity and homeostasis in vivo Proc Natl Acad Sci U S A 2012 109 28 11288 93 10.1073/pnas.1202208109 22736794 PMC3396526 Fukaya T, Murakami R, Takagi H, Sato K, Sato Y, Otsuka H, Ohno M, Hijikata A, Ohara O, Hikida M, et al. Conditional ablation of CD205 + conventional dendritic cells impacts the regulation of T-cell immunity and homeostasis in vivo. Proc Natl Acad Sci U S A. 2012;109(28):11288–93. 22736794 10.1073/pnas.1202208109 PMC3396526 190. Olofsson PS Katz DA Rosas-Ballina M Levine YA Ochani M Valdés-Ferrer SI Pavlov VA Tracey KJ Chavan SS α7 nicotinic acetylcholine receptor (α7nAChR) expression in bone marrow-derived non-T cells is required for the inflammatory reflex Mol Med 2012 18 1 539 43 10.2119/molmed.2011.00405 22183893 PMC3356417 Olofsson PS, Katz DA, Rosas-Ballina M, Levine YA, Ochani M, Valdés-Ferrer SI, Pavlov VA, Tracey KJ, Chavan SS. α7 nicotinic acetylcholine receptor (α7nAChR) expression in bone marrow-derived non-T cells is required for the inflammatory reflex. Mol Med. 2012;18(1):539–43. 22183893 10.2119/molmed.2011.00405 PMC3356417 191. de Oliveira P Gomes AQ Pacheco TR Vitorino de Almeida V Saldanha C Calado A Cell-specific regulation of acetylcholinesterase expression under inflammatory conditions Clin Hemorheol Microcirc 2012 51 2 129 37 10.3233/CH-2011-1520 22240379 de Oliveira P, Gomes AQ, Pacheco TR, Vitorino de Almeida V, Saldanha C, Calado A. Cell-specific regulation of acetylcholinesterase expression under inflammatory conditions. Clin Hemorheol Microcirc. 2012;51(2):129–37. 22240379 10.3233/CH-2011-1520 192. Sarkar DK Zhang C Murugan S Dokur M Boyadjieva NI Ortigüela M Reuhl KR Mojtehedzadeh S Transplantation of β-endorphin neurons into the hypothalamus promotes immune function and restricts the growth and metastasis of mammary carcinoma Cancer Res 2011 71 19 6282 91 10.1158/0008-5472.CAN-11-1610 21835894 PMC3185148 Sarkar DK, Zhang C, Murugan S, Dokur M, Boyadjieva NI, Ortigüela M, Reuhl KR, Mojtehedzadeh S. Transplantation of β-endorphin neurons into the hypothalamus promotes immune function and restricts the growth and metastasis of mammary carcinoma. Cancer Res. 2011;71(19):6282–91. 21835894 10.1158/0008-5472.CAN-11-1610 PMC3185148 193. Skok M Grailhe R Changeux JP Nicotinic receptors regulate B lymphocyte activation and immune response Eur J Pharmacol 2005 517 3 246 51 10.1016/j.ejphar.2005.05.011 15963492 Skok M, Grailhe R, Changeux JP. Nicotinic receptors regulate B lymphocyte activation and immune response. Eur J Pharmacol. 2005;517(3):246–51. 15963492 10.1016/j.ejphar.2005.05.011 194. Skok M Grailhe R Agenes F Changeux JP The role of nicotinic acetylcholine receptors in lymphocyte development J Neuroimmunol 2006 171 1–2 86 98 10.1016/j.jneuroim.2005.09.011 16253349 Skok M, Grailhe R, Agenes F, Changeux JP. The role of nicotinic acetylcholine receptors in lymphocyte development. J Neuroimmunol. 2006;171(1–2):86–98. 16253349 10.1016/j.jneuroim.2005.09.011 195. Skok MV Grailhe R Agenes F Changeux JP The role of nicotinic receptors in B-lymphocyte development and activation Life Sci 2007 80 24–25 2334 6 10.1016/j.lfs.2007.02.005 17363009 Skok MV, Grailhe R, Agenes F, Changeux JP. The role of nicotinic receptors in B-lymphocyte development and activation. Life Sci. 2007;80(24–25):2334–6. 17363009 10.1016/j.lfs.2007.02.005 196. Koval L Lykhmus O Zhmak M Khruschov A Tsetlin V Magrini E Viola A Chernyavsky A Qian J Grando S Differential involvement of α4β2, α7 and α9α10 nicotinic acetylcholine receptors in B lymphocyte activation in vitro Int J Biochem Cell Biol 2011 43 4 516 24 10.1016/j.biocel.2010.12.003 21146628 Koval L, Lykhmus O, Zhmak M, Khruschov A, Tsetlin V, Magrini E, Viola A, Chernyavsky A, Qian J, Grando S, et al. Differential involvement of α4β2, α7 and α9α10 nicotinic acetylcholine receptors in B lymphocyte activation in vitro. Int J Biochem Cell Biol. 2011;43(4):516–24. 21146628 10.1016/j.biocel.2010.12.003 197. Pan J Zhang L Wang X Li L Yang C Wang Z Su K Hu X Zhang Y Ren G Chronic stress induces pulmonary epithelial cells to produce acetylcholine that remodels lung pre-metastatic niche of breast cancer by enhancing NETosis J Exp Clin Cancer Res 2023 42 1 255 10.1186/s13046-023-02836-5 37773152 PMC10540414 Pan J, Zhang L, Wang X, Li L, Yang C, Wang Z, Su K, Hu X, Zhang Y, Ren G, et al. Chronic stress induces pulmonary epithelial cells to produce acetylcholine that remodels lung pre-metastatic niche of breast cancer by enhancing NETosis. J Exp Clin Cancer Res. 2023;42(1):255. 37773152 10.1186/s13046-023-02836-5 PMC10540414 198. Hu Y Wang H Liu Y NETosis: sculpting tumor metastasis and immunotherapy Immunol Rev 2024 321 1 263 79 10.1111/imr.13277 37712361 Hu Y, Wang H, Liu Y. NETosis: sculpting tumor metastasis and immunotherapy. Immunol Rev. 2024;321(1):263–79. 37712361 10.1111/imr.13277 199. Egleton RD Brown KC Dasgupta P Angiogenic activity of nicotinic acetylcholine receptors: implications in tobacco-related vascular diseases Pharmacol Ther 2009 121 2 205 23 10.1016/j.pharmthera.2008.10.007 19063919 Egleton RD, Brown KC, Dasgupta P. Angiogenic activity of nicotinic acetylcholine receptors: implications in tobacco-related vascular diseases. Pharmacol Ther. 2009;121(2):205–23. 19063919 10.1016/j.pharmthera.2008.10.007 200. Carmeliet P Jain RK Angiogenesis in cancer and other diseases Nature 2000 407 6801 249 57 10.1038/35025220 11001068 Carmeliet P, Jain RK. Angiogenesis in cancer and other diseases. Nature. 2000;407(6801):249–57. 11001068 10.1038/35025220 201. Macklin KD Maus AD Pereira EF Albuquerque EX Conti-Fine BM Human vascular endothelial cells express functional nicotinic acetylcholine receptors J Pharmacol Exp Ther 1998 287 1 435 9 10.1016/S0022-3565(24)37807-3 9765366 Macklin KD, Maus AD, Pereira EF, Albuquerque EX, Conti-Fine BM. Human vascular endothelial cells express functional nicotinic acetylcholine receptors. J Pharmacol Exp Ther. 1998;287(1):435–9. 9765366 202. Bi X He X Xu M Zhao M Yu X Lu X Zang W Acetylcholine ameliorates Endoplasmic reticulum stress in endothelial cells after hypoxia/reoxygenation via M3 AChR-AMPK signaling Cell Cycle (Georgetown Tex) 2015 14 15 2461 72 10.1080/15384101.2015.1060383 26066647 PMC4613452 Bi X, He X, Xu M, Zhao M, Yu X, Lu X, Zang W. Acetylcholine ameliorates Endoplasmic reticulum stress in endothelial cells after hypoxia/reoxygenation via M3 AChR-AMPK signaling. Cell Cycle (Georgetown Tex). 2015;14(15):2461–72. 26066647 10.1080/15384101.2015.1060383 PMC4613452 203. Kawashima K Watanabe N Oohata H Fujimoto K Suzuki T Ishizaki Y Morita I Murota S Synthesis and release of acetylcholine by cultured bovine arterial endothelial cells Neurosci Lett 1990 119 2 156 8 10.1016/0304-3940(90)90822-Q 2280888 Kawashima K, Watanabe N, Oohata H, Fujimoto K, Suzuki T, Ishizaki Y, Morita I, Murota S. Synthesis and release of acetylcholine by cultured bovine arterial endothelial cells. Neurosci Lett. 1990;119(2):156–8. 2280888 10.1016/0304-3940(90)90822-q 204. Cooke JP Angiogenesis and the role of the endothelial nicotinic acetylcholine receptor Life Sci 2007 80 24–25 2347 51 10.1016/j.lfs.2007.01.061 17383685 PMC1941778 Cooke JP. Angiogenesis and the role of the endothelial nicotinic acetylcholine receptor. Life Sci. 2007;80(24–25):2347–51. 17383685 10.1016/j.lfs.2007.01.061 PMC1941778 205. Kakinuma Y Furihata M Akiyama T Arikawa M Handa T Katare RG Sato T Donepezil, an acetylcholinesterase inhibitor against alzheimer’s dementia, promotes angiogenesis in an ischemic hindlimb model J Mol Cell Cardiol 2010 48 4 680 93 10.1016/j.yjmcc.2009.11.010 19962381 Kakinuma Y, Furihata M, Akiyama T, Arikawa M, Handa T, Katare RG, Sato T. Donepezil, an acetylcholinesterase inhibitor against alzheimer’s dementia, promotes angiogenesis in an ischemic hindlimb model. J Mol Cell Cardiol. 2010;48(4):680–93. 19962381 10.1016/j.yjmcc.2009.11.010 206. Heeschen C Weis M Aicher A Dimmeler S Cooke JP A novel angiogenic pathway mediated by non-neuronal nicotinic acetylcholine receptors J Clin Invest 2002 110 4 527 36 10.1172/JCI0214676 12189247 PMC150415 Heeschen C, Weis M, Aicher A, Dimmeler S, Cooke JP. A novel angiogenic pathway mediated by non-neuronal nicotinic acetylcholine receptors. J Clin Invest. 2002;110(4):527–36. 12189247 10.1172/JCI14676 PMC150415 207. Kamimura Y Fujii T Kojima H Nagano T Kawashima K Nitric oxide (NO) synthase mRNA expression and NO production via muscarinic acetylcholine receptor-mediated pathways in the CEM, human leukemic T-cell line Life Sci 2003 72 18–19 2151 4 10.1016/S0024-3205(03)00076-6 12628472 Kamimura Y, Fujii T, Kojima H, Nagano T, Kawashima K. Nitric oxide (NO) synthase mRNA expression and NO production via muscarinic acetylcholine receptor-mediated pathways in the CEM, human leukemic T-cell line. Life Sci. 2003;72(18–19):2151–4. 12628472 10.1016/s0024-3205(03)00076-6 208. Fiszman GL Middonno MC de la Torre E Farina M Español AJ Sales ME Activation of muscarinic cholinergic receptors induces MCF-7 cells proliferation and angiogenesis by stimulating nitric oxide synthase activity Cancer Biol Ther 2007 6 7 1106 13 10.4161/cbt.6.7.4330 17611397 Fiszman GL, Middonno MC, de la Torre E, Farina M, Español AJ, Sales ME. Activation of muscarinic cholinergic receptors induces MCF-7 cells proliferation and angiogenesis by stimulating nitric oxide synthase activity. Cancer Biol Ther. 2007;6(7):1106–13. 17611397 10.4161/cbt.6.7.4330 209. Rimmaudo LE de la Torre E Sacerdote de Lustig E Sales ME Muscarinic receptors are involved in LMM3 tumor cells proliferation and angiogenesis Biochem Biophys Res Commun 2005 334 4 1359 64 10.1016/j.bbrc.2005.07.031 16040004 Rimmaudo LE, de la Torre E, Sacerdote de Lustig E, Sales ME. Muscarinic receptors are involved in LMM3 tumor cells proliferation and angiogenesis. Biochem Biophys Res Commun. 2005;334(4):1359–64. 16040004 10.1016/j.bbrc.2005.07.031 210. Zhang Q Tang X Zhang ZF Velikina R Shi S Le AD Nicotine induces hypoxia-inducible factor-1alpha expression in human lung cancer cells via nicotinic acetylcholine receptor-mediated signaling pathways Clin Cancer Res 2007 13 16 4686 94 10.1158/1078-0432.CCR-06-2898 17699846 PMC4166418 Zhang Q, Tang X, Zhang ZF, Velikina R, Shi S, Le AD. Nicotine induces hypoxia-inducible factor-1alpha expression in human lung cancer cells via nicotinic acetylcholine receptor-mediated signaling pathways. Clin Cancer Res. 2007;13(16):4686–94. 17699846 10.1158/1078-0432.CCR-06-2898 PMC4166418 211. Brown KC Lau JK Dom AM Witte TR Luo H Crabtree CM Shah YH Shiflett BS Marcelo AJ Proper NA MG624, an α7-nAChR antagonist, inhibits angiogenesis via the Egr-1/FGF2 pathway Angiogenesis 2012 15 1 99 114 10.1007/s10456-011-9246-9 22198237 Brown KC, Lau JK, Dom AM, Witte TR, Luo H, Crabtree CM, Shah YH, Shiflett BS, Marcelo AJ, Proper NA, et al. MG624, an α7-nAChR antagonist, inhibits angiogenesis via the Egr-1/FGF2 pathway. Angiogenesis. 2012;15(1):99–114. 22198237 10.1007/s10456-011-9246-9 212. Ochirbat S Kan TC Hsu CC Huang TH Chuang KH Chen M Cheng CC Chang CC Rahayu S Chang J The angiogenic role of the alpha 9-nicotinic acetylcholine receptor in triple-negative breast cancers Angiogenesis 2024 27 4 827 43 10.1007/s10456-024-09944-6 39177676 Ochirbat S, Kan TC, Hsu CC, Huang TH, Chuang KH, Chen M, Cheng CC, Chang CC, Rahayu S, Chang J. The angiogenic role of the alpha 9-nicotinic acetylcholine receptor in triple-negative breast cancers. Angiogenesis. 2024;27(4):827–43. 39177676 10.1007/s10456-024-09944-6 213. Pelissier-Rota M Chartier NT Bonaz B Jacquier-Sarlin MR A crosstalk between muscarinic and CRF2 receptors regulates cellular adhesion properties of human colon cancer cells Biochim Et Biophys Acta Mol Cell Res 2017 1864 7 1246 59 10.1016/j.bbamcr.2017.04.008 28432022 Pelissier-Rota M, Chartier NT, Bonaz B, Jacquier-Sarlin MR. A crosstalk between muscarinic and CRF2 receptors regulates cellular adhesion properties of human colon cancer cells. Biochim Et Biophys Acta Mol Cell Res. 2017;1864(7):1246–59. 10.1016/j.bbamcr.2017.04.008 28432022 214. Mondal S Adhikari N Banerjee S Amin SA Jha T Matrix metalloproteinase-9 (MMP-9) and its inhibitors in cancer: A minireview Eur J Med Chem 2020 194 112260 10.1016/j.ejmech.2020.112260 32224379 Mondal S, Adhikari N, Banerjee S, Amin SA, Jha T. Matrix metalloproteinase-9 (MMP-9) and its inhibitors in cancer: A minireview. Eur J Med Chem. 2020;194:112260. 32224379 10.1016/j.ejmech.2020.112260 215. Pelegrina LT Lombardi MG Fiszman GL Azar ME Morgado CC Sales ME Immunoglobulin g from breast cancer patients regulates MCF-7 cells migration and MMP-9 activity by stimulating muscarinic acetylcholine receptors J Clin Immunol 2013 33 2 427 35 10.1007/s10875-012-9804-y 23007238 Pelegrina LT, Lombardi MG, Fiszman GL, Azar ME, Morgado CC, Sales ME. Immunoglobulin g from breast cancer patients regulates MCF-7 cells migration and MMP-9 activity by stimulating muscarinic acetylcholine receptors. J Clin Immunol. 2013;33(2):427–35. 23007238 10.1007/s10875-012-9804-y 216. Zhang B Zhao J Wang Y Xu H Gao BO Zhang G Han B Song G Zhang J Meng W CHRM3 is a novel prognostic factor of poor prognosis and promotes glioblastoma progression via activation of oncogenic invasive growth factors Oncol Res 2023 31 6 917 27 10.32604/or.2023.030425 37744266 PMC10513942 Zhang B, Zhao J, Wang Y, Xu H, Gao BO, Zhang G, Han B, Song G, Zhang J, Meng W. CHRM3 is a novel prognostic factor of poor prognosis and promotes glioblastoma progression via activation of oncogenic invasive growth factors. Oncol Res. 2023;31(6):917–27. 37744266 10.32604/or.2023.030425 PMC10513942 217. Lin CM Lin LW Chen TC Ye YL Chiang BL The expression of nicotinic acetylcholine receptor subunits and their associations with local immune cells and prognosis in oral squamous cell carcinoma Cancer Med 2023 12 18 18918 30 10.1002/cam4.6482 37654227 PMC10557882 Lin CM, Lin LW, Chen TC, Ye YL, Chiang BL. The expression of nicotinic acetylcholine receptor subunits and their associations with local immune cells and prognosis in oral squamous cell carcinoma. Cancer Med. 2023;12(18):18918–30. 37654227 10.1002/cam4.6482 PMC10557882 218. Zhu P Jin Z Kang G Jia Y Liu D Zhang Q Guo F Jia Y Jiao Y Li J Alpha5 nicotinic acetylcholine receptor mediated immune escape of lung adenocarcinoma via STAT3/Jab1-PD-L1 signalling Cell Communication Signaling: CCS 2022 20 1 121 10.1186/s12964-022-00934-z 35971127 PMC9377093 Zhu P, Jin Z, Kang G, Jia Y, Liu D, Zhang Q, Guo F, Jia Y, Jiao Y, Li J, et al. Alpha5 nicotinic acetylcholine receptor mediated immune escape of lung adenocarcinoma via STAT3/Jab1-PD-L1 signalling. Cell Communication Signaling: CCS. 2022;20(1):121. 35971127 10.1186/s12964-022-00934-z PMC9377093 219. Zheng C Snow BE Elia AJ Nechanitzky R Dominguez-Brauer C Liu S Tong Y Cox MA Focaccia E Wakeham AC Tumor-specific cholinergic CD4(+) T lymphocytes guide immunosurveillance of hepatocellular carcinoma Nat Cancer 2023 4 10 1437 54 10.1038/s43018-023-00624-w 37640929 PMC10597839 Zheng C, Snow BE, Elia AJ, Nechanitzky R, Dominguez-Brauer C, Liu S, Tong Y, Cox MA, Focaccia E, Wakeham AC, et al. Tumor-specific cholinergic CD4(+) T lymphocytes guide immunosurveillance of hepatocellular carcinoma. Nat Cancer. 2023;4(10):1437–54. 37640929 10.1038/s43018-023-00624-w PMC10597839 220. Arredondo J Chernyavsky AI Webber RJ Grando SA Biological effects of SLURP-1 on human keratinocytes J Invest Dermatol 2005 125 6 1236 41 10.1111/j.0022-202X.2005.23973.x 16354194 Arredondo J, Chernyavsky AI, Webber RJ, Grando SA. Biological effects of SLURP-1 on human keratinocytes. J Invest Dermatol. 2005;125(6):1236–41. 16354194 10.1111/j.0022-202X.2005.23973.x 221. Chimienti F Hogg RC Plantard L Lehmann C Brakch N Fischer J Huber M Bertrand D Hohl D Identification of SLURP-1 as an epidermal neuromodulator explains the clinical phenotype of Mal de Meleda Hum Mol Genet 2003 12 22 3017 24 10.1093/hmg/ddg320 14506129 Chimienti F, Hogg RC, Plantard L, Lehmann C, Brakch N, Fischer J, Huber M, Bertrand D, Hohl D. Identification of SLURP-1 as an epidermal neuromodulator explains the clinical phenotype of Mal de Meleda. Hum Mol Genet. 2003;12(22):3017–24. 14506129 10.1093/hmg/ddg320 222. Moriwaki Y Watanabe Y Shinagawa T Kai M Miyazawa M Okuda T Kawashima K Yabashi A Waguri S Misawa H Primary sensory neuronal expression of SLURP-1, an endogenous nicotinic acetylcholine receptor ligand Neurosci Res 2009 64 4 403 12 10.1016/j.neures.2009.04.014 19409425 Moriwaki Y, Watanabe Y, Shinagawa T, Kai M, Miyazawa M, Okuda T, Kawashima K, Yabashi A, Waguri S, Misawa H. Primary sensory neuronal expression of SLURP-1, an endogenous nicotinic acetylcholine receptor ligand. Neurosci Res. 2009;64(4):403–12. 19409425 10.1016/j.neures.2009.04.014 223. Gamse R Holzer P Lembeck F Decrease of substance P in primary afferent neurones and impairment of neurogenic plasma extravasation by capsaicin Br J Pharmacol 1980 68 2 207 13 10.1111/j.1476-5381.1980.tb10409.x 6153545 PMC2043922 Gamse R, Holzer P, Lembeck F. Decrease of substance P in primary afferent neurones and impairment of neurogenic plasma extravasation by capsaicin. Br J Pharmacol. 1980;68(2):207–13. 6153545 10.1111/j.1476-5381.1980.tb10409.x PMC2043922 224. Li Y Jiang YC Owyang C Central CGRP inhibits pancreatic enzyme secretion by modulation of vagal parasympathetic outflow Am J Physiol 1998 275 5 G957 963 10.1152/ajpcell.1989.257.5.C957 9815024 Li Y, Jiang YC, Owyang C. Central CGRP inhibits pancreatic enzyme secretion by modulation of vagal parasympathetic outflow. Am J Physiol. 1998;275(5):G957–963. 9815024 10.1152/ajpgi.1998.275.5.G957 225. Lorton D Bellinger DL Felten SY Felten DL Substance P innervation of spleen in rats: nerve fibers associate with lymphocytes and macrophages in specific compartments of the spleen Brain Behav Immun 1991 5 1 29 40 10.1016/0889-1591(91)90005-U 1712652 Lorton D, Bellinger DL, Felten SY, Felten DL. Substance P innervation of spleen in rats: nerve fibers associate with lymphocytes and macrophages in specific compartments of the spleen. Brain Behav Immun. 1991;5(1):29–40. 1712652 10.1016/0889-1591(91)90005-u 226. Bulloch K McEwen BS Diwa A Radojcic T Hausman J Baird S The role of calcitonin gene-related peptide in the mouse thymus revisited Ann N Y Acad Sci 1994 741 129 36 10.1111/j.1749-6632.1994.tb23094.x 7825800 Bulloch K, McEwen BS, Diwa A, Radojcic T, Hausman J, Baird S. The role of calcitonin gene-related peptide in the mouse thymus revisited. Ann N Y Acad Sci. 1994;741:129–36. 7825800 10.1111/j.1749-6632.1994.tb23094.x 227. Wang X Fiscus RR Tang Z Yang L Wu J Fan S Mathews HL CGRP in the serum of endotoxin-treated rats suppresses lymphoproliferation Brain Behav Immun 1994 8 4 282 92 10.1006/brbi.1994.1027 7696715 Wang X, Fiscus RR, Tang Z, Yang L, Wu J, Fan S, Mathews HL. CGRP in the serum of endotoxin-treated rats suppresses lymphoproliferation. Brain Behav Immun. 1994;8(4):282–92. 7696715 10.1006/brbi.1994.1027 228. Ebbinghaus M von Segond G Massier J Gajda M Bräuer R Kress M Schaible HG Interleukin-6-dependent influence of nociceptive sensory neurons on antigen-induced arthritis Arthritis Res Therapy 2015 17 334 10.1186/s13075-015-0858-0 PMC4654804 26590032 Ebbinghaus M, von Segond G, Massier J, Gajda M, Bräuer R, Kress M, Schaible HG. Interleukin-6-dependent influence of nociceptive sensory neurons on antigen-induced arthritis. Arthritis Res Therapy. 2015;17:334. 10.1186/s13075-015-0858-0 PMC4654804 26590032 229. Pavlov VA Tracey KJ The cholinergic anti-inflammatory pathway Brain Behav Immun 2005 19 6 493 9 10.1016/j.bbi.2005.03.015 15922555 Pavlov VA, Tracey KJ. The cholinergic anti-inflammatory pathway. Brain Behav Immun. 2005;19(6):493–9. 15922555 10.1016/j.bbi.2005.03.015 230. Tracey KJ Physiology and immunology of the cholinergic antiinflammatory pathway J Clin Invest 2007 117 2 289 96 10.1172/JCI30555 17273548 PMC1783813 Tracey KJ. Physiology and immunology of the cholinergic antiinflammatory pathway. J Clin Invest. 2007;117(2):289–96. 17273548 10.1172/JCI30555 PMC1783813 231. Huston JM Ochani M Rosas-Ballina M Liao H Ochani K Pavlov VA Gallowitsch-Puerta M Ashok M Czura CJ Foxwell B Splenectomy inactivates the cholinergic antiinflammatory pathway during lethal endotoxemia and polymicrobial sepsis J Exp Med 2006 203 7 1623 8 10.1084/jem.20052362 16785311 PMC2118357 Huston JM, Ochani M, Rosas-Ballina M, Liao H, Ochani K, Pavlov VA, Gallowitsch-Puerta M, Ashok M, Czura CJ, Foxwell B, et al. Splenectomy inactivates the cholinergic antiinflammatory pathway during lethal endotoxemia and polymicrobial sepsis. J Exp Med. 2006;203(7):1623–8. 16785311 10.1084/jem.20052362 PMC2118357 232. Rosas-Ballina M Ochani M Parrish WR Ochani K Harris YT Huston JM Chavan S Tracey KJ Splenic nerve is required for cholinergic antiinflammatory pathway control of TNF in endotoxemia Proc Natl Acad Sci U S A 2008 105 31 11008 13 10.1073/pnas.0803237105 18669662 PMC2504833 Rosas-Ballina M, Ochani M, Parrish WR, Ochani K, Harris YT, Huston JM, Chavan S, Tracey KJ. Splenic nerve is required for cholinergic antiinflammatory pathway control of TNF in endotoxemia. Proc Natl Acad Sci U S A. 2008;105(31):11008–13. 18669662 10.1073/pnas.0803237105 PMC2504833 233. Huston JM Wang H Ochani M Ochani K Rosas-Ballina M Gallowitsch-Puerta M Ashok M Yang L Tracey KJ Yang H Splenectomy protects against sepsis lethality and reduces serum HMGB1 levels J Immunol (Baltimore Md: 1950) 2008 181 5 3535 9 10.4049/jimmunol.181.5.3535 PMC4533852 18714026 Huston JM, Wang H, Ochani M, Ochani K, Rosas-Ballina M, Gallowitsch-Puerta M, Ashok M, Yang L, Tracey KJ, Yang H. Splenectomy protects against sepsis lethality and reduces serum HMGB1 levels. J Immunol (Baltimore Md: 1950). 2008;181(5):3535–9. 10.4049/jimmunol.181.5.3535 PMC4533852 18714026 234. Jimenez T, Friedman T, Vadgama J, Singh V, Tucker A, Collazo J, Sinha S, Hikim AS, Singh R, Pervin S. Nicotine Synergizes with High-Fat Diet to Induce an Anti-Inflammatory Microenvironment to Promote Breast Tumor Growth. Mediators of inflammation 10.1155/2020/5239419 PMC7752272 33414685 235. Guo H Zhang C Shen YK Zhang JD Yang FY Liang F Wang W Liu YT Wang GZ Zhou GB PD-L2 mediates tobacco smoking-induced recruitment of regulatory T cells via the RGMB/NFκB/CCL20 cascade Cell Biol Toxicol 2024 40 1 56 10.1007/s10565-024-09892-3 39042313 PMC11266262 Guo H, Zhang C, Shen YK, Zhang JD, Yang FY, Liang F, Wang W, Liu YT, Wang GZ, Zhou GB. PD-L2 mediates tobacco smoking-induced recruitment of regulatory T cells via the RGMB/NFκB/CCL20 cascade. Cell Biol Toxicol. 2024;40(1):56. 39042313 10.1007/s10565-024-09892-3 PMC11266262 236. Fujii YX Tashiro A Arimoto K Fujigaya H Moriwaki Y Misawa H Fujii T Matsui M Kasahara T Kawashima K Diminished antigen-specific IgG1 and interleukin-6 production and acetylcholinesterase expression in combined M1 and M5 muscarinic acetylcholine receptor knockout mice J Neuroimmunol 2007 188 1–2 80 5 10.1016/j.jneuroim.2007.05.017 17586055 Fujii YX, Tashiro A, Arimoto K, Fujigaya H, Moriwaki Y, Misawa H, Fujii T, Matsui M, Kasahara T, Kawashima K. Diminished antigen-specific IgG1 and interleukin-6 production and acetylcholinesterase expression in combined M1 and M5 muscarinic acetylcholine receptor knockout mice. J Neuroimmunol. 2007;188(1–2):80–5. 17586055 10.1016/j.jneuroim.2007.05.017 237. Pal K Hussain T Xie H Li S Yang P Mansfield A Lou Y Chowdhury S Mukhopadhyay D Expression, correlation, and prognostic significance of different nicotinic acetylcholine receptors, programed death ligand 1, and dopamine receptor D2 in lung adenocarcinoma Front Oncol 2022 12 959500 10.3389/fonc.2022.959500 36072788 PMC9441878 Pal K, Hussain T, Xie H, Li S, Yang P, Mansfield A, Lou Y, Chowdhury S, Mukhopadhyay D. Expression, correlation, and prognostic significance of different nicotinic acetylcholine receptors, programed death ligand 1, and dopamine receptor D2 in lung adenocarcinoma. Front Oncol. 2022;12:959500. 36072788 10.3389/fonc.2022.959500 PMC9441878 238. Zhu P Kang G Jiao Y Gui C Fan H Li X Jia Y Zhang L Ma X The α5-nAChR/PD-L1 axis facilitates lung adenocarcinoma cell migration and invasion Hum Cell 2022 35 4 1207 18 10.1007/s13577-022-00709-1 35593989 Zhu P, Kang G, Jiao Y, Gui C, Fan H, Li X, Jia Y, Zhang L, Ma X. The α5-nAChR/PD-L1 axis facilitates lung adenocarcinoma cell migration and invasion. Hum Cell. 2022;35(4):1207–18. 35593989 10.1007/s13577-022-00709-1 239. Kwok HH, Gao B, Chan KH, Ip MS, Minna JD, Lam DC. Nicotinic Acetylcholine Receptor Subunit α7 Mediates Cigarette Smoke-Induced PD-L1 Expression in Human Bronchial Epithelial Cells. Cancers (Basel) 10.3390/cancers13215345 PMC8582493 34771509 240. Nguyen HD, Liao YC, Ho YS, Chen LC, Chang HW, Cheng TC, Liu D, Lee WR, Shen SC, Wu CH et al. The α9 nicotinic acetylcholine receptor mediates Nicotine-Induced PD-L1 expression and regulates melanoma cell proliferation and migration. Cancers (Basel) 2019, 11(12). 10.3390/cancers11121991 PMC6966517 31835799 241. Wang Z Liu W Wang C Li Y Ai Z Acetylcholine promotes the self-renewal and immune escape of CD133 + thyroid cancer cells through activation of CD133-Akt pathway Cancer Lett 2020 471 116 24 10.1016/j.canlet.2019.12.009 31830559 Wang Z, Liu W, Wang C, Li Y, Ai Z. Acetylcholine promotes the self-renewal and immune escape of CD133 + thyroid cancer cells through activation of CD133-Akt pathway. Cancer Lett. 2020;471:116–24. 31830559 10.1016/j.canlet.2019.12.009 242. Wess J Eglen RM Gautam D Muscarinic acetylcholine receptors: mutant mice provide new insights for drug development Nat Rev Drug Discovery 2007 6 9 721 33 10.1038/nrd2379 17762886 Wess J, Eglen RM, Gautam D. Muscarinic acetylcholine receptors: mutant mice provide new insights for drug development. Nat Rev Drug Discovery. 2007;6(9):721–33. 17762886 10.1038/nrd2379 243. Sales ME Muscarinic receptors as targets for metronomic therapy in breast cancer Curr Pharm Design 2016 22 14 2170 7 10.2174/1381612822666160229115317 26924207 Sales ME. Muscarinic receptors as targets for metronomic therapy in breast cancer. Curr Pharm Design. 2016;22(14):2170–7. 10.2174/1381612822666160229115317 26924207 244. Salem AR Martínez Pulido P Sanchez F Sanchez Y Español AJ Sales ME Effect of low dose metronomic therapy on MCF-7 tumor cells growth and angiogenesis. Role of muscarinic acetylcholine receptors Int Immunopharmacol 2020 84 106514 10.1016/j.intimp.2020.106514 32311671 Salem AR, Martínez Pulido P, Sanchez F, Sanchez Y, Español AJ, Sales ME. Effect of low dose metronomic therapy on MCF-7 tumor cells growth and angiogenesis. Role of muscarinic acetylcholine receptors. Int Immunopharmacol. 2020;84:106514. 32311671 10.1016/j.intimp.2020.106514 245. Park YS Cho NJ EGFR and PKC are involved in the activation of ERK1/2 and p90 RSK and the subsequent proliferation of SNU-407 colon cancer cells by muscarinic acetylcholine receptors Mol Cell Biochem 2012 370 1–2 191 8 10.1007/s11010-012-1410-z 22865467 Park YS, Cho NJ. EGFR and PKC are involved in the activation of ERK1/2 and p90 RSK and the subsequent proliferation of SNU-407 colon cancer cells by muscarinic acetylcholine receptors. Mol Cell Biochem. 2012;370(1–2):191–8. 22865467 10.1007/s11010-012-1410-z 246. Doepner M Lee I Natale CA Brathwaite R Venkat S Kim SH Wei Y Vakoc CR Capell BC Katzenellenbogen JA Endogenous DOPA inhibits melanoma through suppression of CHRM1 signaling Sci Adv 2022 8 35 eabn4007 10.1126/sciadv.abn4007 36054350 PMC10848963 Doepner M, Lee I, Natale CA, Brathwaite R, Venkat S, Kim SH, Wei Y, Vakoc CR, Capell BC, Katzenellenbogen JA, et al. Endogenous DOPA inhibits melanoma through suppression of CHRM1 signaling. Sci Adv. 2022;8(35):eabn4007. 36054350 10.1126/sciadv.abn4007 PMC10848963 247. Mitchelson FJJP, Therapeutics. The Pharmacology of McN-A-343. 2012, 135(2):216–45. 10.1016/j.pharmthera.2012.05.008 22643681 248. Bodick NC Offen WW Shannon HE Satterwhite J Lucas R van Lier R Paul SM The selective muscarinic agonist Xanomeline improves both the cognitive deficits and behavioral symptoms of alzheimer disease Alzheimer Dis Assoc Disord 1997 11 Suppl 4 S16 22 9339268 Bodick NC, Offen WW, Shannon HE, Satterwhite J, Lucas R, van Lier R, Paul SM. The selective muscarinic agonist Xanomeline improves both the cognitive deficits and behavioral symptoms of alzheimer disease. Alzheimer Dis Assoc Disord. 1997;11(Suppl 4):S16–22. 9339268 249. Sundel MH, Sampaio Moura N, Cheng K, Chatain O, Hu S, Drachenberg CB, Xie G, Raufman JP. Selective Activation of M(1) Muscarinic Receptors Attenuates Human Colon Cancer Cell Proliferation. Cancers (Basel) 10.3390/cancers15194766 PMC10571583 37835460 250. Guerriero C, Matera C, Del Bufalo D, De Amici M, Conti L, Dallanoce C, Tata AM. The combined treatment with chemotherapeutic agents and the dualsteric muscarinic agonist Iper-8-Naphthalimide affects drug resistance in glioblastoma stem cells. Cells 2021, 10(8). 10.3390/cells10081877 PMC8391681 34440646 251. Cristofaro I Spinello Z Matera C Fiore M Conti L De Amici M Dallanoce C Tata AM Activation of M2 muscarinic acetylcholine receptors by a hybrid agonist enhances cytotoxic effects in GB7 glioblastoma cancer stem cells Neurochem Int 2018 118 52 60 10.1016/j.neuint.2018.04.010 29702145 Cristofaro I, Spinello Z, Matera C, Fiore M, Conti L, De Amici M, Dallanoce C, Tata AM. Activation of M2 muscarinic acetylcholine receptors by a hybrid agonist enhances cytotoxic effects in GB7 glioblastoma cancer stem cells. Neurochem Int. 2018;118:52–60. 29702145 10.1016/j.neuint.2018.04.010 252. Di Bari M Tombolillo V Conte C Castigli E Sciaccaluga M Iorio E Carpinelli G Ricordy R Fiore M Degrassi F Cytotoxic and genotoxic effects mediated by M2 muscarinic receptor activation in human glioblastoma cells Neurochem Int 2015 90 261 70 10.1016/j.neuint.2015.09.008 26455407 Di Bari M, Tombolillo V, Conte C, Castigli E, Sciaccaluga M, Iorio E, Carpinelli G, Ricordy R, Fiore M, Degrassi F, et al. Cytotoxic and genotoxic effects mediated by M2 muscarinic receptor activation in human glioblastoma cells. Neurochem Int. 2015;90:261–70. 26455407 10.1016/j.neuint.2015.09.008 253. Skerjanec A The clinical pharmacokinetics of Darifenacin Clin Pharmacokinet 2006 45 4 325 50 10.2165/00003088-200645040-00001 16584282 Skerjanec A. The clinical pharmacokinetics of Darifenacin. Clin Pharmacokinet. 2006;45(4):325–50. 16584282 10.2165/00003088-200645040-00001 254. Song P Sekhon HS Fu XW Maier M Jia Y Duan J Proskosil BJ Gravett C Lindstrom J Mark GP Activated cholinergic signaling provides a target in squamous cell lung carcinoma Cancer Res 2008 68 12 4693 700 10.1158/0008-5472.CAN-08-0183 18559515 PMC2865551 Song P, Sekhon HS, Fu XW, Maier M, Jia Y, Duan J, Proskosil BJ, Gravett C, Lindstrom J, Mark GP, et al. Activated cholinergic signaling provides a target in squamous cell lung carcinoma. Cancer Res. 2008;68(12):4693–700. 18559515 10.1158/0008-5472.CAN-08-0183 PMC2865551 255. Kuol N, Davidson M, Karakkat J, Filippone RT, Veale M, Luwor R, Fraser S, Apostolopoulos V, Nurgali K. Blocking muscarinic receptor 3 attenuates tumor growth and decreases immunosuppressive and cholinergic markers in an orthotopic mouse model of colorectal cancer. Int J Mol Sci 2022, 24(1). 10.3390/ijms24010596 PMC9820315 36614038 256. Lan L Wang H Yang R Liu F Bi Q Wang S Wei X Yan H Su R R2-8018 reduces the proliferation and migration of non-small cell lung cancer cells by disturbing transactivation between M3R and EGFR Life Sci 2019 234 116742 10.1016/j.lfs.2019.116742 31401315 Lan L, Wang H, Yang R, Liu F, Bi Q, Wang S, Wei X, Yan H, Su R. R2-8018 reduces the proliferation and migration of non-small cell lung cancer cells by disturbing transactivation between M3R and EGFR. Life Sci. 2019;234:116742. 31401315 10.1016/j.lfs.2019.116742 257. Ami N Koga K Fushiki H Ueno Y Ogino Y Ohta H Selective M3 muscarinic receptor antagonist inhibits small-cell lung carcinoma growth in a mouse orthotopic xenograft model J Pharmacol Sci 2011 116 1 81 8 10.1254/jphs.10308FP 21512307 Ami N, Koga K, Fushiki H, Ueno Y, Ogino Y, Ohta H. Selective M3 muscarinic receptor antagonist inhibits small-cell lung carcinoma growth in a mouse orthotopic xenograft model. J Pharmacol Sci. 2011;116(1):81–8. 21512307 10.1254/jphs.10308fp 258. Sagara Y Sagara T Mase T Kimura T Numazawa T Fujikawa T Noguchi K Ohtake N Cyclohexylmethylpiperidinyltriphenylpropioamide: a selective muscarinic M(3) antagonist discriminating against the other receptor subtypes J Med Chem 2002 45 4 984 7 10.1021/jm010480k 11831911 Sagara Y, Sagara T, Mase T, Kimura T, Numazawa T, Fujikawa T, Noguchi K, Ohtake N. Cyclohexylmethylpiperidinyltriphenylpropioamide: a selective muscarinic M(3) antagonist discriminating against the other receptor subtypes. J Med Chem. 2002;45(4):984–7. 11831911 10.1021/jm010480k 259. Aclidium bromide Tudorza Pressair) for COPD Med Lett Drugs Ther 2012 54 1405 99 100 23223246 Aclidium bromide. (Tudorza Pressair) for COPD. Med Lett Drugs Ther. 2012;54(1405):99–100. 23223246 260. Li ZZ Wang YL Yu YH Xing YL Ji XF Aclidinium bromide inhibits proliferation of osteosarcoma cells through regulation of PI3K/Akt pathway Eur Rev Med Pharmacol Sci 2019 23 1 105 12 30657552 10.26355/eurrev_201901_16754 Li ZZ, Wang YL, Yu YH, Xing YL, Ji XF. Aclidinium bromide inhibits proliferation of osteosarcoma cells through regulation of PI3K/Akt pathway. Eur Rev Med Pharmacol Sci. 2019;23(1):105–12. 30657552 10.26355/eurrev_201901_16754 261. Hua N Wei X Liu X Ma X He X Zhuo R Zhao Z Wang L Yan H Zhong B A novel muscarinic antagonist R2HBJJ inhibits non-small cell lung cancer cell growth and arrests the cell cycle in G0/G1 PLoS ONE 2012 7 12 e53170 10.1371/journal.pone.0053170 23285263 PMC3532118 Hua N, Wei X, Liu X, Ma X, He X, Zhuo R, Zhao Z, Wang L, Yan H, Zhong B, et al. A novel muscarinic antagonist R2HBJJ inhibits non-small cell lung cancer cell growth and arrests the cell cycle in G0/G1. PLoS ONE. 2012;7(12):e53170. 23285263 10.1371/journal.pone.0053170 PMC3532118 262. Kanlı Z Cabadak H Aydın B Potential antiproliferative and apoptotic effects of pilocarpine combined with TNF alpha in chronic myeloid leukemia cells Naunyn Schmiedebergs Arch Pharmacol 2023 396 7 1513 24 10.1007/s00210-023-02418-4 36781441 Kanlı Z, Cabadak H, Aydın B. Potential antiproliferative and apoptotic effects of pilocarpine combined with TNF alpha in chronic myeloid leukemia cells. Naunyn Schmiedebergs Arch Pharmacol. 2023;396(7):1513–24. 36781441 10.1007/s00210-023-02418-4 263. Brejc K van Dijk WJ Klaassen RV Schuurmans M van Der Oost J Smit AB Sixma TK Crystal structure of an ACh-binding protein reveals the ligand-binding domain of nicotinic receptors Nature 2001 411 6835 269 76 10.1038/35077011 11357122 Brejc K, van Dijk WJ, Klaassen RV, Schuurmans M, van Der Oost J, Smit AB, Sixma TK. Crystal structure of an ACh-binding protein reveals the ligand-binding domain of nicotinic receptors. Nature. 2001;411(6835):269–76. 11357122 10.1038/35077011 264. Hansen SB Sulzenbacher G Huxford T Marchot P Taylor P Bourne Y Structures of aplysia achbp complexes with nicotinic agonists and antagonists reveal distinctive binding interfaces and conformations Embo J 2005 24 20 3635 46 10.1038/sj.emboj.7600828 16193063 PMC1276711 Hansen SB, Sulzenbacher G, Huxford T, Marchot P, Taylor P, Bourne Y. Structures of aplysia achbp complexes with nicotinic agonists and antagonists reveal distinctive binding interfaces and conformations. Embo J. 2005;24(20):3635–46. 16193063 10.1038/sj.emboj.7600828 PMC1276711 265. Zhang H He X Wang X Yu B Zhao S Jiao P Jin H Liu Z Wang K Zhang L Design, synthesis and biological activities of piperidine-spirooxadiazole derivatives as α7 nicotinic receptor antagonists Eur J Med Chem 2020 207 112774 10.1016/j.ejmech.2020.112774 32882607 Zhang H, He X, Wang X, Yu B, Zhao S, Jiao P, Jin H, Liu Z, Wang K, Zhang L, et al. Design, synthesis and biological activities of piperidine-spirooxadiazole derivatives as α7 nicotinic receptor antagonists. Eur J Med Chem. 2020;207:112774. 32882607 10.1016/j.ejmech.2020.112774 266. Arunrungvichian K Fokin VV Vajragupta O Taylor P Selectivity optimization of substituted 1,2,3-triazoles as α7 nicotinic acetylcholine receptor agonists ACS Chem Neurosci 2015 6 8 1317 30 10.1021/acschemneuro.5b00058 25932897 Arunrungvichian K, Fokin VV, Vajragupta O, Taylor P. Selectivity optimization of substituted 1,2,3-triazoles as α7 nicotinic acetylcholine receptor agonists. ACS Chem Neurosci. 2015;6(8):1317–30. 25932897 10.1021/acschemneuro.5b00058 267. López JJ García-Colunga J Pérez EG Fierro A Methylpiperidinium Iodides as novel antagonists for α7 nicotinic acetylcholine receptors Front Pharmacol 2018 9 744 10.3389/fphar.2018.00744 30042682 PMC6048275 López JJ, García-Colunga J, Pérez EG, Fierro A. Methylpiperidinium Iodides as novel antagonists for α7 nicotinic acetylcholine receptors. Front Pharmacol. 2018;9:744. 30042682 10.3389/fphar.2018.00744 PMC6048275 268. Arunrungvichian K, Chongruchiroj S, Sarasamkan J, Schüürmann G, Brust P, Vajragupta O. In Silico finding of key interaction mediated α3β4 and α7 nicotinic acetylcholine receptor ligand selectivity of Quinuclidine-Triazole chemotype. Int J Mol Sci 2020, 21(17). 10.3390/ijms21176189 PMC7504379 32867140 269. Berne S, Čemažar M, Frangež R, Juntes P, Kranjc S, Grandič M, Savarin M, Turk T. APS8 delays tumor growth in mice by inducing apoptosis of lung adenocarcinoma cells expressing high number of α7 nicotinic receptors. Mar Drugs 2018, 16(10). 10.3390/md16100367 PMC6213019 30282908 270. Qasem AMA Rowan MG Sanders VR Millar NS Blagbrough IS Synthesis and antagonist activity of Methyllycaconitine analogues on human α7 nicotinic acetylcholine receptors ACS Bio Med Chem Au 2023 3 2 147 57 10.1021/acsbiomedchemau.2c00057 37096031 PMC10119942 Qasem AMA, Rowan MG, Sanders VR, Millar NS, Blagbrough IS. Synthesis and antagonist activity of Methyllycaconitine analogues on human α7 nicotinic acetylcholine receptors. ACS Bio Med Chem Au. 2023;3(2):147–57. 37096031 10.1021/acsbiomedchemau.2c00057 PMC10119942 271. Dasgupta P Rastogi S Pillai S Ordonez-Ercan D Morris M Haura E Chellappan S Nicotine induces cell proliferation by beta-arrestin-mediated activation of Src and Rb-Raf-1 pathways J Clin Invest 2006 116 8 2208 17 10.1172/JCI28164 16862215 PMC1513051 Dasgupta P, Rastogi S, Pillai S, Ordonez-Ercan D, Morris M, Haura E, Chellappan S. Nicotine induces cell proliferation by beta-arrestin-mediated activation of Src and Rb-Raf-1 pathways. J Clin Invest. 2006;116(8):2208–17. 16862215 10.1172/JCI28164 PMC1513051 272. Gallagher R Qudah T Balle T Chebib M McLeod MD Novel Methyllycaconitine analogues selective for the α4β2 over α7 nicotinic acetylcholine receptors Bioorg Med Chem 2021 51 116516 10.1016/j.bmc.2021.116516 34798380 Gallagher R, Qudah T, Balle T, Chebib M, McLeod MD. Novel Methyllycaconitine analogues selective for the α4β2 over α7 nicotinic acetylcholine receptors. Bioorg Med Chem. 2021;51:116516. 34798380 10.1016/j.bmc.2021.116516 273. Chrestia JF Esandi MDC Bouzat C Cannabidiol as a modulator of α7 nicotinic receptors Cell Mol Life Sci 2022 79 11 564 10.1007/s00018-022-04600-y 36282426 PMC11803050 Chrestia JF, Esandi MDC, Bouzat C. Cannabidiol as a modulator of α7 nicotinic receptors. Cell Mol Life Sci. 2022;79(11):564. 36282426 10.1007/s00018-022-04600-y PMC11803050 274. Clarke MR Jones B Squires CLM Imhoff FM Harwood DT Rhodes L Selwood AI McNabb PS Baird SK Cyclic Imine Pinnatoxin G is cytotoxic to cancer cell lines via nicotinic acetylcholine Receptor-Driven classical apoptosis J Nat Prod 2021 84 7 2035 42 10.1021/acs.jnatprod.1c00418 34170700 Clarke MR, Jones B, Squires CLM, Imhoff FM, Harwood DT, Rhodes L, Selwood AI, McNabb PS, Baird SK. Cyclic Imine Pinnatoxin G is cytotoxic to cancer cell lines via nicotinic acetylcholine Receptor-Driven classical apoptosis. J Nat Prod. 2021;84(7):2035–42. 34170700 10.1021/acs.jnatprod.1c00418 275. Liu Y, Qian J, Sun Z, Zhangsun D, Luo S. Cervical cancer correlates with the differential expression of nicotinic acetylcholine receptors and reveals therapeutic targets. Mar Drugs 2019, 17(5). 10.3390/md17050256 PMC6562638 31035425 276. Guo X, He L, Xu W, Wang W, Feng X, Fu Y, Zhang X, Ding RB, Qi X, Bao J et al. αO-Conotoxin GeXIVA[1,2] suppresses in vivo tumor growth of Triple-Negative breast cancer by inhibiting AKT-mTOR, STAT3 and NF-κB signaling mediated proliferation and inducing apoptosis. Mar Drugs 2024, 22(6). 10.3390/md22060252 PMC11205035 38921563 277. Wang H Li Y Yang M Zhou M Synthesis and characterization of αM-conotoxin SIIID, a reversible human α7 nicotinic acetylcholine receptor antagonist Toxicon: Official J Int Soc Toxinology 2022 210 141 7 10.1016/j.toxicon.2022.03.002 35255330 Wang H, Li Y, Yang M, Zhou M. Synthesis and characterization of αM-conotoxin SIIID, a reversible human α7 nicotinic acetylcholine receptor antagonist. Toxicon: Official J Int Soc Toxinology. 2022;210:141–7. 10.1016/j.toxicon.2022.03.002 35255330 278. Osipov AV, Terpinskaya TI, Yanchanka T, Balashevich T, Zhmak MN, Tsetlin VI, Utkin YN. α-Conotoxins enhance both the in vivo suppression of Ehrlich carcinoma growth and in vitro reduction in cell viability elicited by cyclooxygenase and Lipoxygenase inhibitors. Mar Drugs 2020, 18(4). 10.3390/md18040193 PMC7230841 32272633 279. Liang J Tae HS Xu X Jiang T Adams DJ Yu R Dimerization of α-Conotoxins as a strategy to enhance the Inhibition of the human α7 and α9α10 nicotinic acetylcholine receptors J Med Chem 2020 63 6 2974 85 10.1021/acs.jmedchem.9b01536 32101438 Liang J, Tae HS, Xu X, Jiang T, Adams DJ, Yu R. Dimerization of α-Conotoxins as a strategy to enhance the Inhibition of the human α7 and α9α10 nicotinic acetylcholine receptors. J Med Chem. 2020;63(6):2974–85. 32101438 10.1021/acs.jmedchem.9b01536 280. Mei D Lin Z Fu J He B Gao W Ma L Dai W Zhang H Wang X Wang J The use of α-conotoxin ImI to actualize the targeted delivery of Paclitaxel micelles to α7 nAChR-overexpressing breast cancer Biomaterials 2015 42 52 65 10.1016/j.biomaterials.2014.11.044 25542793 Mei D, Lin Z, Fu J, He B, Gao W, Ma L, Dai W, Zhang H, Wang X, Wang J, et al. The use of α-conotoxin ImI to actualize the targeted delivery of Paclitaxel micelles to α7 nAChR-overexpressing breast cancer. Biomaterials. 2015;42:52–65. 25542793 10.1016/j.biomaterials.2014.11.044 281. Mei D Zhao L Chen B Zhang X Wang X Yu Z Ni X Zhang Q α-Conotoxin ImI-modified polymeric micelles as potential nanocarriers for targeted docetaxel delivery to α7-nAChR overexpressed non-small cell lung cancer Drug Delivery 2018 25 1 493 503 10.1080/10717544.2018.1436097 29426250 PMC6058686 Mei D, Zhao L, Chen B, Zhang X, Wang X, Yu Z, Ni X, Zhang Q. α-Conotoxin ImI-modified polymeric micelles as potential nanocarriers for targeted docetaxel delivery to α7-nAChR overexpressed non-small cell lung cancer. Drug Delivery. 2018;25(1):493–503. 29426250 10.1080/10717544.2018.1436097 PMC6058686 282. Moriwaki Y Kubo N Watanabe M Asano S Shinoda T Sugino T Ichikawa D Tsuji S Kato F Misawa H Endogenous neurotoxin-like protein Ly6H inhibits alpha7 nicotinic acetylcholine receptor currents at the plasma membrane Sci Rep 2020 10 1 11996 10.1038/s41598-020-68947-7 32686737 PMC7371702 Moriwaki Y, Kubo N, Watanabe M, Asano S, Shinoda T, Sugino T, Ichikawa D, Tsuji S, Kato F, Misawa H. Endogenous neurotoxin-like protein Ly6H inhibits alpha7 nicotinic acetylcholine receptor currents at the plasma membrane. Sci Rep. 2020;10(1):11996. 32686737 10.1038/s41598-020-68947-7 PMC7371702 283. Blacklow B Kornhauser R Hains PG Loiacono R Escoubas P Graudins A Nicholson GM α-Elapitoxin-Aa2a, a long-chain snake α-neurotoxin with potent actions on muscle (α1)(2)βγδ nicotinic receptors, lacks the classical high affinity for neuronal α7 nicotinic receptors Biochem Pharmacol 2011 81 2 314 25 10.1016/j.bcp.2010.10.004 20950587 Blacklow B, Kornhauser R, Hains PG, Loiacono R, Escoubas P, Graudins A, Nicholson GM. α-Elapitoxin-Aa2a, a long-chain snake α-neurotoxin with potent actions on muscle (α1)(2)βγδ nicotinic receptors, lacks the classical high affinity for neuronal α7 nicotinic receptors. Biochem Pharmacol. 2011;81(2):314–25. 20950587 10.1016/j.bcp.2010.10.004 284. Nys M Zarkadas E Brams M Mehregan A Kambara K Kool J Casewell NR Bertrand D Baenziger JE Nury H The molecular mechanism of snake short-chain α-neurotoxin binding to muscle-type nicotinic acetylcholine receptors Nat Commun 2022 13 1 4543 10.1038/s41467-022-32174-7 35927270 PMC9352773 Nys M, Zarkadas E, Brams M, Mehregan A, Kambara K, Kool J, Casewell NR, Bertrand D, Baenziger JE, Nury H, et al. The molecular mechanism of snake short-chain α-neurotoxin binding to muscle-type nicotinic acetylcholine receptors. Nat Commun. 2022;13(1):4543. 35927270 10.1038/s41467-022-32174-7 PMC9352773 285. Kalamida D Poulas K Avramopoulou V Fostieri E Lagoumintzis G Lazaridis K Sideri A Zouridakis M Tzartos SJ Muscle and neuronal nicotinic acetylcholine receptors. Structure, function and pathogenicity FEBS J 2007 274 15 3799 845 10.1111/j.1742-4658.2007.05935.x 17651090 Kalamida D, Poulas K, Avramopoulou V, Fostieri E, Lagoumintzis G, Lazaridis K, Sideri A, Zouridakis M, Tzartos SJ. Muscle and neuronal nicotinic acetylcholine receptors. Structure, function and pathogenicity. FEBS J. 2007;274(15):3799–845. 17651090 10.1111/j.1742-4658.2007.05935.x 286. Lebbe EK Peigneur S Maiti M Mille BG Devi P Ravichandran S Lescrinier E Waelkens E D’Souza L Herdewijn P Discovery of a new subclass of α-conotoxins in the venom of Conus australis Toxicon: Official J Int Soc Toxinology 2014 91 145 54 10.1016/j.toxicon.2014.08.074 25194747 Lebbe EK, Peigneur S, Maiti M, Mille BG, Devi P, Ravichandran S, Lescrinier E, Waelkens E, D’Souza L, Herdewijn P, et al. Discovery of a new subclass of α-conotoxins in the venom of Conus australis. Toxicon: Official J Int Soc Toxinology. 2014;91:145–54. 10.1016/j.toxicon.2014.08.074 25194747 287. Shen J Xu L Owonikoko TK Sun SY Khuri FR Curran WJ Deng X NNK promotes migration and invasion of lung cancer cells through activation of c-Src/PKCι/FAK loop Cancer Lett 2012 318 1 106 13 10.1016/j.canlet.2011.12.008 22178655 PMC3288633 Shen J, Xu L, Owonikoko TK, Sun SY, Khuri FR, Curran WJ, Deng X. NNK promotes migration and invasion of lung cancer cells through activation of c-Src/PKCι/FAK loop. Cancer Lett. 2012;318(1):106–13. 22178655 10.1016/j.canlet.2011.12.008 PMC3288633 288. Spindel ER Cholinergic targets in lung cancer Curr Pharm Design 2016 22 14 2152 9 10.2174/1381612822666160127114237 PMC4961355 26818857 Spindel ER. Cholinergic targets in lung cancer. Curr Pharm Design. 2016;22(14):2152–9. 10.2174/1381612822666160127114237 PMC4961355 26818857 289. Alama A Bruzzo C Cavalieri Z Forlani A Utkin Y Casciano I Romani M Inhibition of the nicotinic acetylcholine receptors by Cobra venom α-neurotoxins: is there a perspective in lung cancer treatment? PLoS ONE 2011 6 6 e20695 10.1371/journal.pone.0020695 21695184 PMC3113800 Alama A, Bruzzo C, Cavalieri Z, Forlani A, Utkin Y, Casciano I, Romani M. Inhibition of the nicotinic acetylcholine receptors by Cobra venom α-neurotoxins: is there a perspective in lung cancer treatment? PLoS ONE. 2011;6(6):e20695. 21695184 10.1371/journal.pone.0020695 PMC3113800 290. Grozio A Paleari L Catassi A Servent D Cilli M Piccardi F Paganuzzi M Cesario A Granone P Mourier G Natural agents targeting the alpha7-nicotinic-receptor in NSCLC: a promising prospective in anti-cancer drug development Int J Cancer 2008 122 8 1911 5 10.1002/ijc.23298 18067132 Grozio A, Paleari L, Catassi A, Servent D, Cilli M, Piccardi F, Paganuzzi M, Cesario A, Granone P, Mourier G, et al. Natural agents targeting the alpha7-nicotinic-receptor in NSCLC: a promising prospective in anti-cancer drug development. Int J Cancer. 2008;122(8):1911–5. 18067132 10.1002/ijc.23298 291. Catassi A Paleari L Servent D Sessa F Dominioni L Ognio E Cilli M Vacca P Mingari M Gaudino G Targeting alpha7-nicotinic receptor for the treatment of pleural mesothelioma Eur J Cancer 2008 44 15 2296 311 10.1016/j.ejca.2008.06.045 18722110 Catassi A, Paleari L, Servent D, Sessa F, Dominioni L, Ognio E, Cilli M, Vacca P, Mingari M, Gaudino G, et al. Targeting alpha7-nicotinic receptor for the treatment of pleural mesothelioma. Eur J Cancer. 2008;44(15):2296–311. 18722110 10.1016/j.ejca.2008.06.045 292. Shulepko MA Bychkov ML Shlepova OV Shenkarev ZO Kirpichnikov MP Lyukmanova EN Human secreted protein SLURP-1 abolishes nicotine-induced proliferation, PTEN down-regulation and α7-nAChR expression up-regulation in lung cancer cells Int Immunopharmacol 2020 82 106303 10.1016/j.intimp.2020.106303 32106059 Shulepko MA, Bychkov ML, Shlepova OV, Shenkarev ZO, Kirpichnikov MP, Lyukmanova EN. Human secreted protein SLURP-1 abolishes nicotine-induced proliferation, PTEN down-regulation and α7-nAChR expression up-regulation in lung cancer cells. Int Immunopharmacol. 2020;82:106303. 32106059 10.1016/j.intimp.2020.106303 293. Bychkov ML Shulepko MA Shlepova OV Kulbatskii DS Chulina IA Paramonov AS Baidakova LK Azev VN Koshelev SG Kirpichnikov MP SLURP-1 controls growth and migration of lung adenocarcinoma cells, forming a complex with α7-nAChR and PDGFR/EGFR heterodimer Front Cell Dev Biology 2021 9 739391 10.3389/fcell.2021.739391 PMC8476798 34595181 Bychkov ML, Shulepko MA, Shlepova OV, Kulbatskii DS, Chulina IA, Paramonov AS, Baidakova LK, Azev VN, Koshelev SG, Kirpichnikov MP, et al. SLURP-1 controls growth and migration of lung adenocarcinoma cells, forming a complex with α7-nAChR and PDGFR/EGFR heterodimer. Front Cell Dev Biology. 2021;9:739391. 10.3389/fcell.2021.739391 PMC8476798 34595181 294. Shlepova OV Shulepko MA Shipunova VO Bychkov ML Kukushkin ID Chulina IA Azev VN Shramova EI Kazakov VA Ismailova AM Selective targeting of α7 nicotinic acetylcholine receptor by synthetic peptide mimicking loop I of human SLURP-1 provides efficient and prolonged therapy of epidermoid carcinoma in vivo Front Cell Dev Biology 2023 11 1256716 10.3389/fcell.2023.1256716 PMC10580074 37854069 Shlepova OV, Shulepko MA, Shipunova VO, Bychkov ML, Kukushkin ID, Chulina IA, Azev VN, Shramova EI, Kazakov VA, Ismailova AM, et al. Selective targeting of α7 nicotinic acetylcholine receptor by synthetic peptide mimicking loop I of human SLURP-1 provides efficient and prolonged therapy of epidermoid carcinoma in vivo. Front Cell Dev Biology. 2023;11:1256716. 10.3389/fcell.2023.1256716 PMC10580074 37854069 295. Witayateeraporn W Arunrungvichian K Pothongsrisit S Doungchawee J Vajragupta O Pongrakhananon V α7-Nicotinic acetylcholine receptor antagonist QND7 suppresses non-small cell lung cancer cell proliferation and migration via Inhibition of akt/mtor signaling Biochem Biophys Res Commun 2020 521 4 977 83 10.1016/j.bbrc.2019.11.018 31727368 Witayateeraporn W, Arunrungvichian K, Pothongsrisit S, Doungchawee J, Vajragupta O, Pongrakhananon V. α7-Nicotinic acetylcholine receptor antagonist QND7 suppresses non-small cell lung cancer cell proliferation and migration via Inhibition of akt/mtor signaling. Biochem Biophys Res Commun. 2020;521(4):977–83. 31727368 10.1016/j.bbrc.2019.11.018 296. Bavo F Pallavicini M Pucci S Appiani R Giraudo A Oh H Kneisley DL Eaton B Lucero L Gotti C Subnanomolar affinity and selective antagonism at α7 nicotinic receptor by combined modifications of 2-Triethylammonium Ethyl ether of 4-Stilbenol (MG624) J Med Chem 2023 66 1 306 32 10.1021/acs.jmedchem.2c01256 36526469 PMC9841521 Bavo F, Pallavicini M, Pucci S, Appiani R, Giraudo A, Oh H, Kneisley DL, Eaton B, Lucero L, Gotti C, et al. Subnanomolar affinity and selective antagonism at α7 nicotinic receptor by combined modifications of 2-Triethylammonium Ethyl ether of 4-Stilbenol (MG624). J Med Chem. 2023;66(1):306–32. 36526469 10.1021/acs.jmedchem.2c01256 PMC9841521 297. Bavo F Pucci S Fasoli F Lammi C Moretti M Mucchietto V Lattuada D Viani P De Palma C Budriesi R Potent antiglioblastoma agents by hybridizing the Onium-Alkyloxy-Stilbene based structures of an α7-nAChR, α9-nAChR antagonist and of a Pro-Oxidant Mitocan J Med Chem 2018 61 23 10531 44 10.1021/acs.jmedchem.8b01052 30403486 Bavo F, Pucci S, Fasoli F, Lammi C, Moretti M, Mucchietto V, Lattuada D, Viani P, De Palma C, Budriesi R, et al. Potent antiglioblastoma agents by hybridizing the Onium-Alkyloxy-Stilbene based structures of an α7-nAChR, α9-nAChR antagonist and of a Pro-Oxidant Mitocan. J Med Chem. 2018;61(23):10531–44. 30403486 10.1021/acs.jmedchem.8b01052 298. Belanger-Coast MG Zhang M Bugay V Gutierrez RA Gregory SR Yu W Brenner R Dequalinium chloride is an antagonists of α7 nicotinic acetylcholine receptors Eur J Pharmacol 2022 925 175000 10.1016/j.ejphar.2022.175000 35525312 Belanger-Coast MG, Zhang M, Bugay V, Gutierrez RA, Gregory SR, Yu W, Brenner R. Dequalinium chloride is an antagonists of α7 nicotinic acetylcholine receptors. Eur J Pharmacol. 2022;925:175000. 35525312 10.1016/j.ejphar.2022.175000 299. Sadek B Ashoor A Al Mansouri A Lorke DE Nurulain SM Petroianu G Wainwright M Oz M N3,N7-diaminophenothiazinium derivatives as antagonists of α7-nicotinic acetylcholine receptors expressed in xenopus oocytes Pharmacol Res 2012 66 3 213 8 10.1016/j.phrs.2012.05.008 22673050 Sadek B, Ashoor A, Al Mansouri A, Lorke DE, Nurulain SM, Petroianu G, Wainwright M, Oz M. N3,N7-diaminophenothiazinium derivatives as antagonists of α7-nicotinic acetylcholine receptors expressed in xenopus oocytes. Pharmacol Res. 2012;66(3):213–8. 22673050 10.1016/j.phrs.2012.05.008 300. Zovko A Viktorsson K Lewensohn R Kološa K Filipič M Xing H Kem WR Paleari L Turk T APS8, a polymeric alkylpyridinium salt blocks α7 nAChR and induces apoptosis in non-small cell lung carcinoma Mar Drugs 2013 11 7 2574 94 10.3390/md11072574 23880932 PMC3736439 Zovko A, Viktorsson K, Lewensohn R, Kološa K, Filipič M, Xing H, Kem WR, Paleari L, Turk T. APS8, a polymeric alkylpyridinium salt blocks α7 nAChR and induces apoptosis in non-small cell lung carcinoma. Mar Drugs. 2013;11(7):2574–94. 23880932 10.3390/md11072574 PMC3736439 301. Alwassil OI Khatri S Schulte MK Aripaka SS Mikkelsen JD Dukat M N(1)H- and N(1)-Substituted phenylguanidines as α7 nicotinic acetylcholine (nACh) receptor antagonists: Structure-Activity relationship studies ACS Chem Neurosci 2021 12 12 2194 201 10.1021/acschemneuro.1c00212 34043311 Alwassil OI, Khatri S, Schulte MK, Aripaka SS, Mikkelsen JD, Dukat M. N(1)H- and N(1)-Substituted phenylguanidines as α7 nicotinic acetylcholine (nACh) receptor antagonists: Structure-Activity relationship studies. ACS Chem Neurosci. 2021;12(12):2194–201. 34043311 10.1021/acschemneuro.1c00212 302. Wesolowska A Young S Dukat M MD-354 potentiates the antinociceptive effect of clonidine in the mouse tail-flick but not hot-plate assay Eur J Pharmacol 2004 495 2–3 129 36 10.1016/j.ejphar.2004.05.028 15249161 Wesolowska A, Young S, Dukat M. MD-354 potentiates the antinociceptive effect of clonidine in the mouse tail-flick but not hot-plate assay. Eur J Pharmacol. 2004;495(2–3):129–36. 15249161 10.1016/j.ejphar.2004.05.028 303. Wang L Du L Xiong X Lin Y Zhu J Yao Z Wang S Guo Y Chen Y Geary K Repurposing dextromethorphan and Metformin for treating nicotine-induced cancer by directly targeting CHRNA7 to inhibit JAK2/STAT3/SOX2 signaling Oncogene 2021 40 11 1974 87 10.1038/s41388-021-01682-z 33603170 PMC7979537 Wang L, Du L, Xiong X, Lin Y, Zhu J, Yao Z, Wang S, Guo Y, Chen Y, Geary K, et al. Repurposing dextromethorphan and Metformin for treating nicotine-induced cancer by directly targeting CHRNA7 to inhibit JAK2/STAT3/SOX2 signaling. Oncogene. 2021;40(11):1974–87. 33603170 10.1038/s41388-021-01682-z PMC7979537 304. Marmouzi I Myers S Buck DJ Davis RL Arias HR α7 nicotinic acetylcholine receptor potentiation downregulates chemotherapy-induced inflammatory overactivation by overlapping intracellular mechanisms Int J Biochem Cell Biol 2023 158 106405 10.1016/j.biocel.2023.106405 36966906 Marmouzi I, Myers S, Buck DJ, Davis RL, Arias HR. α7 nicotinic acetylcholine receptor potentiation downregulates chemotherapy-induced inflammatory overactivation by overlapping intracellular mechanisms. Int J Biochem Cell Biol. 2023;158:106405. 36966906 10.1016/j.biocel.2023.106405 305. Lee A Saito E Ekins S McMurtray A Extracellular binding of indinavir to matrix metalloproteinase-2 and the alpha-7-nicotinic acetylcholine receptor: implications for use in cancer treatment Heliyon 2019 5 9 e02526 10.1016/j.heliyon.2019.e02526 31687607 PMC6819839 Lee A, Saito E, Ekins S, McMurtray A. Extracellular binding of indinavir to matrix metalloproteinase-2 and the alpha-7-nicotinic acetylcholine receptor: implications for use in cancer treatment. Heliyon. 2019;5(9):e02526. 31687607 10.1016/j.heliyon.2019.e02526 PMC6819839 306. Hahn SS Tang Q Zheng F Zhao S Wu J GW1929 inhibits α7 nAChR expression through PPARγ-independent activation of p38 MAPK and inactivation of PI3-K/mTOR: the role of Egr-1 Cell Signal 2014 26 4 730 9 10.1016/j.cellsig.2013.12.019 24412748 Hahn SS, Tang Q, Zheng F, Zhao S, Wu J. GW1929 inhibits α7 nAChR expression through PPARγ-independent activation of p38 MAPK and inactivation of PI3-K/mTOR: the role of Egr-1. Cell Signal. 2014;26(4):730–9. 24412748 10.1016/j.cellsig.2013.12.019 307. Zhi YK Li J Yi L Zhu RL Luo JF Shi QP Bai SS Li YW Du Q Cai JZ Sinomenine inhibits macrophage M1 polarization by downregulating α7nAChR via a feedback pathway of α7nAChR/ERK/Egr-1 Phytomedicine: Int J Phytotherapy Phytopharmacology 2022 100 154050 10.1016/j.phymed.2022.154050 35397284 Zhi YK, Li J, Yi L, Zhu RL, Luo JF, Shi QP, Bai SS, Li YW, Du Q, Cai JZ, et al. Sinomenine inhibits macrophage M1 polarization by downregulating α7nAChR via a feedback pathway of α7nAChR/ERK/Egr-1. Phytomedicine: Int J Phytotherapy Phytopharmacology. 2022;100:154050. 10.1016/j.phymed.2022.154050 35397284 308. Maggi L Palma E Eusebi F Moretti M Balestra B Clementi F Gotti C Selective effects of a 4-oxystilbene derivative on wild and mutant neuronal chick alpha7 nicotinic receptor Br J Pharmacol 1999 126 1 285 95 10.1038/sj.bjp.0702299 10051147 PMC1565803 Maggi L, Palma E, Eusebi F, Moretti M, Balestra B, Clementi F, Gotti C. Selective effects of a 4-oxystilbene derivative on wild and mutant neuronal chick alpha7 nicotinic receptor. Br J Pharmacol. 1999;126(1):285–95. 10051147 10.1038/sj.bjp.0702299 PMC1565803 309. Shen KH, Hung JH, Liao YC, Tsai ST, Wu MJ, Chen PS. Sinomenine inhibits migration and invasion of human lung cancer cell through downregulating expression of miR-21 and MMPs. Int J Mol Sci 2020, 21(9). 10.3390/ijms21093080 PMC7247699 32349289 310. Jiang S Gao Y Hou W Liu R Qi X Xu X Li J Bao Y Zheng H Hua B Sinomenine inhibits A549 human lung cancer cell invasion by mediating the STAT3 signaling pathway Oncol Lett 2016 12 2 1380 6 10.3892/ol.2016.4768 27446441 PMC4950784 Jiang S, Gao Y, Hou W, Liu R, Qi X, Xu X, Li J, Bao Y, Zheng H, Hua B. Sinomenine inhibits A549 human lung cancer cell invasion by mediating the STAT3 signaling pathway. Oncol Lett. 2016;12(2):1380–6. 27446441 10.3892/ol.2016.4768 PMC4950784 311. Bai S Wen W Hou X Wu J Yi L Zhi Y Lv Y Tan X Liu L Wang P Inhibitory effect of Sinomenine on lung cancer cells via negative regulation of α7 nicotinic acetylcholine receptor J Leukoc Biol 2021 109 4 843 52 10.1002/JLB.6MA0720-344RRR 32726882 Bai S, Wen W, Hou X, Wu J, Yi L, Zhi Y, Lv Y, Tan X, Liu L, Wang P, et al. Inhibitory effect of Sinomenine on lung cancer cells via negative regulation of α7 nicotinic acetylcholine receptor. J Leukoc Biol. 2021;109(4):843–52. 32726882 10.1002/JLB.6MA0720-344RRR 312. Wala EP Crooks PA McIntosh JM Holtman JR Jr Novel small molecule α9α10 nicotinic receptor antagonist prevents and reverses chemotherapy-evoked neuropathic pain in rats Anesth Analg 2012 115 3 713 20 10.1213/ANE.0b013e31825a3c72 22610850 PMC4502964 Wala EP, Crooks PA, McIntosh JM, Holtman JR Jr. Novel small molecule α9α10 nicotinic receptor antagonist prevents and reverses chemotherapy-evoked neuropathic pain in rats. Anesth Analg. 2012;115(3):713–20. 22610850 10.1213/ANE.0b013e31825a3c72 PMC4502964 313. Zheng G Zhang Z Dowell C Wala E Dwoskin LP Holtman JR McIntosh JM Crooks PA Discovery of non-peptide, small molecule antagonists of α9α10 nicotinic acetylcholine receptors as novel analgesics for the treatment of neuropathic and tonic inflammatory pain Bioorg Med Chem Lett 2011 21 8 2476 9 10.1016/j.bmcl.2011.02.043 21397497 PMC3726002 Zheng G, Zhang Z, Dowell C, Wala E, Dwoskin LP, Holtman JR, McIntosh JM, Crooks PA. Discovery of non-peptide, small molecule antagonists of α9α10 nicotinic acetylcholine receptors as novel analgesics for the treatment of neuropathic and tonic inflammatory pain. Bioorg Med Chem Lett. 2011;21(8):2476–9. 21397497 10.1016/j.bmcl.2011.02.043 PMC3726002 314. Ellison M Haberlandt C Gomez-Casati ME Watkins M Elgoyhen AB McIntosh JM Olivera BM Alpha-RgIA: a novel conotoxin that specifically and potently blocks the alpha9alpha10 nAChR Biochemistry 2006 45 5 1511 7 10.1021/bi0520129 16445293 Ellison M, Haberlandt C, Gomez-Casati ME, Watkins M, Elgoyhen AB, McIntosh JM, Olivera BM. Alpha-RgIA: a novel conotoxin that specifically and potently blocks the alpha9alpha10 nAChR. Biochemistry. 2006;45(5):1511–7. 16445293 10.1021/bi0520129 315. Luo S Zhangsun D Harvey PJ Kaas Q Wu Y Zhu X Hu Y Li X Tsetlin VI Christensen S Cloning, synthesis, and characterization of αO-conotoxin gexiva, a potent α9α10 nicotinic acetylcholine receptor antagonist Proc Natl Acad Sci U S A 2015 112 30 E4026 4035 10.1073/pnas.1503617112 26170295 PMC4522777 Luo S, Zhangsun D, Harvey PJ, Kaas Q, Wu Y, Zhu X, Hu Y, Li X, Tsetlin VI, Christensen S, et al. Cloning, synthesis, and characterization of αO-conotoxin gexiva, a potent α9α10 nicotinic acetylcholine receptor antagonist. Proc Natl Acad Sci U S A. 2015;112(30):E4026–4035. 26170295 10.1073/pnas.1503617112 PMC4522777 316. Jin AH Muttenthaler M Dutertre S Himaya SWA Kaas Q Craik DJ Lewis RJ Alewood PF Conotoxins: chemistry and biology Chem Rev 2019 119 21 11510 49 10.1021/acs.chemrev.9b00207 31633928 Jin AH, Muttenthaler M, Dutertre S, Himaya SWA, Kaas Q, Craik DJ, Lewis RJ, Alewood PF. Conotoxins: chemistry and biology. Chem Rev. 2019;119(21):11510–49. 31633928 10.1021/acs.chemrev.9b00207 317. Olivera BM Gray WR Zeikus R McIntosh JM Varga J Rivier J de Santos V Cruz LJ Peptide neurotoxins from fish-hunting cone snails Science 1985 230 4732 1338 43 10.1126/science.4071055 4071055 Olivera BM, Gray WR, Zeikus R, McIntosh JM, Varga J, Rivier J, de Santos V, Cruz LJ. Peptide neurotoxins from fish-hunting cone snails. Science. 1985;230(4732):1338–43. 4071055 10.1126/science.4071055 318. Akondi KB Muttenthaler M Dutertre S Kaas Q Craik DJ Lewis RJ Alewood PF Discovery, synthesis, and structure-activity relationships of conotoxins Chem Rev 2014 114 11 5815 47 10.1021/cr400401e 24720541 PMC7610532 Akondi KB, Muttenthaler M, Dutertre S, Kaas Q, Craik DJ, Lewis RJ, Alewood PF. Discovery, synthesis, and structure-activity relationships of conotoxins. Chem Rev. 2014;114(11):5815–47. 24720541 10.1021/cr400401e PMC7610532 319. Olivera BM Rivier J Clark C Ramilo CA Corpuz GP Abogadie FC Mena EE Woodward SR Hillyard DR Cruz LJ Diversity of Conus neuropeptides Science 1990 249 4966 257 63 10.1126/science.2165278 2165278 Olivera BM, Rivier J, Clark C, Ramilo CA, Corpuz GP, Abogadie FC, Mena EE, Woodward SR, Hillyard DR, Cruz LJ. Diversity of Conus neuropeptides. Science. 1990;249(4966):257–63. 2165278 10.1126/science.2165278 320. Vetter I Lewis RJ Therapeutic potential of cone snail venom peptides (conopeptides) Curr Top Med Chem 2012 12 14 1546 52 10.2174/156802612802652457 22827523 Vetter I, Lewis RJ. Therapeutic potential of cone snail venom peptides (conopeptides). Curr Top Med Chem. 2012;12(14):1546–52. 22827523 10.2174/156802612802652457 321. Kaas Q Yu R Jin AH Dutertre S Craik DJ ConoServer: updated content, knowledge, and discovery tools in the conopeptide database Nucleic Acids Res 2012 40 Database issue D325 330 10.1093/nar/gkr886 22058133 PMC3245185 Kaas Q, Yu R, Jin AH, Dutertre S, Craik DJ. ConoServer: updated content, knowledge, and discovery tools in the conopeptide database. Nucleic Acids Res. 2012;40(Database issue):D325–330. 22058133 10.1093/nar/gkr886 PMC3245185 322. Robinson SD Norton RS Conotoxin gene superfamilies Mar Drugs 2014 12 12 6058 101 10.3390/md12126058 25522317 PMC4278219 Robinson SD, Norton RS. Conotoxin gene superfamilies. Mar Drugs. 2014;12(12):6058–101. 25522317 10.3390/md12126058 PMC4278219 323. Góngora-Benítez M Tulla-Puche J Albericio F Multifaceted roles of disulfide bonds. Peptides as therapeutics Chem Rev 2014 114 2 901 26 10.1021/cr400031z 24446748 Góngora-Benítez M, Tulla-Puche J, Albericio F. Multifaceted roles of disulfide bonds. Peptides as therapeutics. Chem Rev. 2014;114(2):901–26. 24446748 10.1021/cr400031z 324. Kaas Q Westermann JC Halai R Wang CK Craik DJ ConoServer, a database for conopeptide sequences and structures Bioinformatics 2008 24 3 445 6 10.1093/bioinformatics/btm596 18065428 Kaas Q, Westermann JC, Halai R, Wang CK, Craik DJ. ConoServer, a database for conopeptide sequences and structures. Bioinformatics. 2008;24(3):445–6. 18065428 10.1093/bioinformatics/btm596 325. Lewis RJ Dutertre S Vetter I Christie MJ Conus venom peptide Pharmacology Pharmacol Rev 2012 64 2 259 98 10.1124/pr.111.005322 22407615 Lewis RJ, Dutertre S, Vetter I, Christie MJ. Conus venom peptide Pharmacology. Pharmacol Rev. 2012;64(2):259–98. 22407615 10.1124/pr.111.005322 326. Nilsson KP Lovelace ES Caesar CE Tynngård N Alewood PF Johansson HM Sharpe IA Lewis RJ Daly NL Craik DJ Solution structure of chi-conopeptide mria, a modulator of the human norepinephrine transporter Biopolymers 2005 80 6 815 23 10.1002/bip.20302 15931669 Nilsson KP, Lovelace ES, Caesar CE, Tynngård N, Alewood PF, Johansson HM, Sharpe IA, Lewis RJ, Daly NL, Craik DJ. Solution structure of chi-conopeptide mria, a modulator of the human norepinephrine transporter. Biopolymers. 2005;80(6):815–23. 15931669 10.1002/bip.20302 327. Sadeghi M McArthur JR Finol-Urdaneta RK Adams DJ Analgesic conopeptides targeting G protein-coupled receptors reduce excitability of sensory neurons Neuropharmacology 2017 127 116 23 10.1016/j.neuropharm.2017.05.020 28533165 Sadeghi M, McArthur JR, Finol-Urdaneta RK, Adams DJ. Analgesic conopeptides targeting G protein-coupled receptors reduce excitability of sensory neurons. Neuropharmacology. 2017;127:116–23. 28533165 10.1016/j.neuropharm.2017.05.020 328. Sharpe IA Gehrmann J Loughnan ML Thomas L Adams DA Atkins A Palant E Craik DJ Adams DJ Alewood PF Two new classes of conopeptides inhibit the alpha1-adrenoceptor and noradrenaline transporter Nat Neurosci 2001 4 9 902 7 10.1038/nn0901-902 11528421 Sharpe IA, Gehrmann J, Loughnan ML, Thomas L, Adams DA, Atkins A, Palant E, Craik DJ, Adams DJ, Alewood PF, et al. Two new classes of conopeptides inhibit the alpha1-adrenoceptor and noradrenaline transporter. Nat Neurosci. 2001;4(9):902–7. 11528421 10.1038/nn0901-902 329. Pennington MW Czerwinski A Norton RS Peptide therapeutics from venom: current status and potential Bioorg Med Chem 2018 26 10 2738 58 10.1016/j.bmc.2017.09.029 28988749 Pennington MW, Czerwinski A, Norton RS. Peptide therapeutics from venom: current status and potential. Bioorg Med Chem. 2018;26(10):2738–58. 28988749 10.1016/j.bmc.2017.09.029 330. Dutton JL Craik DJ alpha-Conotoxins: nicotinic acetylcholine receptor antagonists as Pharmacological tools and potential drug leads Curr Med Chem 2001 8 4 327 44 10.2174/0929867013373453 11172693 Dutton JL, Craik DJ. alpha-Conotoxins: nicotinic acetylcholine receptor antagonists as Pharmacological tools and potential drug leads. Curr Med Chem. 2001;8(4):327–44. 11172693 10.2174/0929867013373453 331. Halai R Clark RJ Nevin ST Jensen JE Adams DJ Craik DJ Scanning mutagenesis of alpha-conotoxin Vc1.1 reveals residues crucial for activity at the alpha9alpha10 nicotinic acetylcholine receptor J Biol Chem 2009 284 30 20275 84 10.1074/jbc.M109.015339 19447885 PMC2740453 Halai R, Clark RJ, Nevin ST, Jensen JE, Adams DJ, Craik DJ. Scanning mutagenesis of alpha-conotoxin Vc1.1 reveals residues crucial for activity at the alpha9alpha10 nicotinic acetylcholine receptor. J Biol Chem. 2009;284(30):20275–84. 19447885 10.1074/jbc.M109.015339 PMC2740453 332. Abraham N, Lewis RJ. Neuronal nicotinic acetylcholine receptor modulators from cone snails. Mar Drugs 2018, 16(6). 10.3390/md16060208 PMC6024932 29899286 333. Giribaldi J Dutertre S α-Conotoxins to explore the molecular, physiological and pathophysiological functions of neuronal nicotinic acetylcholine receptors Neurosci Lett 2018 679 24 34 10.1016/j.neulet.2017.11.063 29199094 Giribaldi J, Dutertre S. α-Conotoxins to explore the molecular, physiological and pathophysiological functions of neuronal nicotinic acetylcholine receptors. Neurosci Lett. 2018;679:24–34. 29199094 10.1016/j.neulet.2017.11.063 334. Lebbe EK Peigneur S Wijesekara I Tytgat J Conotoxins targeting nicotinic acetylcholine receptors: an overview Mar Drugs 2014 12 5 2970 3004 10.3390/md12052970 24857959 PMC4052327 Lebbe EK, Peigneur S, Wijesekara I, Tytgat J. Conotoxins targeting nicotinic acetylcholine receptors: an overview. Mar Drugs. 2014;12(5):2970–3004. 24857959 10.3390/md12052970 PMC4052327 335. Li X Tae HS Chu Y Jiang T Adams DJ Yu R Medicinal chemistry, pharmacology, and therapeutic potential of α-conotoxins antagonizing the α9α10 nicotinic acetylcholine receptor Pharmacol Ther 2021 222 107792 10.1016/j.pharmthera.2020.107792 33309557 Li X, Tae HS, Chu Y, Jiang T, Adams DJ, Yu R. Medicinal chemistry, pharmacology, and therapeutic potential of α-conotoxins antagonizing the α9α10 nicotinic acetylcholine receptor. Pharmacol Ther. 2021;222:107792. 33309557 10.1016/j.pharmthera.2020.107792 336. Wu X Huang YH Kaas Q Harvey PJ Wang CK Tae HS Adams DJ Craik DJ Backbone cyclization of analgesic conotoxin gexiva facilitates direct folding of the ribbon isomer J Biol Chem 2017 292 41 17101 12 10.1074/jbc.M117.808386 28851841 PMC5641895 Wu X, Huang YH, Kaas Q, Harvey PJ, Wang CK, Tae HS, Adams DJ, Craik DJ. Backbone cyclization of analgesic conotoxin gexiva facilitates direct folding of the ribbon isomer. J Biol Chem. 2017;292(41):17101–12. 28851841 10.1074/jbc.M117.808386 PMC5641895 337. Zhangsun D Zhu X Kaas Q Wu Y Craik DJ McIntosh JM Luo S αO-Conotoxin gexiva disulfide bond isomers exhibit differential sensitivity for various nicotinic acetylcholine receptors but retain potency and selectivity for the human α9α10 subtype Neuropharmacology 2017 127 243 52 10.1016/j.neuropharm.2017.04.015 28416445 PMC6029978 Zhangsun D, Zhu X, Kaas Q, Wu Y, Craik DJ, McIntosh JM, Luo S. αO-Conotoxin gexiva disulfide bond isomers exhibit differential sensitivity for various nicotinic acetylcholine receptors but retain potency and selectivity for the human α9α10 subtype. Neuropharmacology. 2017;127:243–52. 28416445 10.1016/j.neuropharm.2017.04.015 PMC6029978 338. Wang H, Li X, Zhangsun D, Yu G, Su R, Luo S. The α9α10 nicotinic acetylcholine receptor antagonist αO-Conotoxin GeXIVA[1,2] alleviates and reverses Chemotherapy-Induced neuropathic pain. Mar Drugs 2019, 17(5). 10.3390/md17050265 PMC6562493 31060282 339. Sun Z, Bao J, Zhangsun M, Dong S, Zhangsun D, Luo S. αO-Conotoxin gexiva inhibits the growth of breast cancer cells via interaction with α9 nicotine acetylcholine receptors. Mar Drugs 2020, 18(4). 10.3390/md18040195 PMC7231225 32272701 340. Carstens BB Clark RJ Daly NL Harvey PJ Kaas Q Craik DJ Engineering of conotoxins for the treatment of pain Curr Pharm Design 2011 17 38 4242 53 10.2174/138161211798999401 22204425 Carstens BB, Clark RJ, Daly NL, Harvey PJ, Kaas Q, Craik DJ. Engineering of conotoxins for the treatment of pain. Curr Pharm Design. 2011;17(38):4242–53. 10.2174/138161211798999401 22204425 341. Romero HK Christensen SB Di Cesare Mannelli L Gajewiak J Ramachandra R Elmslie KS Vetter DE Ghelardini C Iadonato SP Mercado JL Inhibition of α9α10 nicotinic acetylcholine receptors prevents chemotherapy-induced neuropathic pain Proc Natl Acad Sci U S A 2017 114 10 E1825 32 10.1073/pnas.1621433114 28223528 PMC5347537 Romero HK, Christensen SB, Di Cesare Mannelli L, Gajewiak J, Ramachandra R, Elmslie KS, Vetter DE, Ghelardini C, Iadonato SP, Mercado JL, et al. Inhibition of α9α10 nicotinic acetylcholine receptors prevents chemotherapy-induced neuropathic pain. Proc Natl Acad Sci U S A. 2017;114(10):E1825–32. 28223528 10.1073/pnas.1621433114 PMC5347537 342. Tabassum N Tae HS Jia X Kaas Q Jiang T Adams DJ Yu R Role of Cys(I)-Cys(III) disulfide bond on the structure and activity of α-Conotoxins at human neuronal nicotinic acetylcholine receptors ACS Omega 2017 2 8 4621 31 10.1021/acsomega.7b00639 30023726 PMC6044955 Tabassum N, Tae HS, Jia X, Kaas Q, Jiang T, Adams DJ, Yu R. Role of Cys(I)-Cys(III) disulfide bond on the structure and activity of α-Conotoxins at human neuronal nicotinic acetylcholine receptors. ACS Omega. 2017;2(8):4621–31. 30023726 10.1021/acsomega.7b00639 PMC6044955 343. Craik DJ Adams DJ Chemical modification of conotoxins to improve stability and activity ACS Chem Biol 2007 2 7 457 68 10.1021/cb700091j 17649970 Craik DJ, Adams DJ. Chemical modification of conotoxins to improve stability and activity. ACS Chem Biol. 2007;2(7):457–68. 17649970 10.1021/cb700091j 344. Halai R Craik DJ Conotoxins: natural product drug leads Nat Prod Rep 2009 26 4 526 36 10.1039/b819311h 19642420 Halai R, Craik DJ. Conotoxins: natural product drug leads. Nat Prod Rep. 2009;26(4):526–36. 19642420 10.1039/b819311h 345. Janes RW alpha-Conotoxins as selective probes for nicotinic acetylcholine receptor subclasses Curr Opin Pharmacol 2005 5 3 280 92 10.1016/j.coph.2005.01.013 15907916 Janes RW. alpha-Conotoxins as selective probes for nicotinic acetylcholine receptor subclasses. Curr Opin Pharmacol. 2005;5(3):280–92. 15907916 10.1016/j.coph.2005.01.013 346. Morrison KL Weiss GA Combinatorial alanine-scanning Curr Opin Chem Biol 2001 5 3 302 7 10.1016/S1367-5931(00)00206-4 11479122 Morrison KL, Weiss GA. Combinatorial alanine-scanning. Curr Opin Chem Biol. 2001;5(3):302–7. 11479122 10.1016/s1367-5931(00)00206-4 347. Quiram PA Sine SM Identification of residues in the neuronal alpha7 acetylcholine receptor that confer selectivity for conotoxin ImI J Biol Chem 1998 273 18 11001 6 10.1074/jbc.273.18.11001 9556580 Quiram PA, Sine SM. Identification of residues in the neuronal alpha7 acetylcholine receptor that confer selectivity for conotoxin ImI. J Biol Chem. 1998;273(18):11001–6. 9556580 10.1074/jbc.273.18.11001 348. Ren J, Zhu X, Xu P, Li R, Fu Y, Dong S, Zhangsun D, Wu Y, Luo S. d-Amino acid substitution of α-Conotoxin RgIA identifies its critical residues and improves the enzymatic stability. Mar Drugs 2019, 17(3). 10.3390/md17030142 PMC6472032 30823399 349. Huynh PN Harvey PJ Gajewiak J Craik DJ Michael McIntosh J Critical residue properties for potency and selectivity of α-Conotoxin RgIA towards α9α10 nicotinic acetylcholine receptors Biochem Pharmacol 2020 181 114124 10.1016/j.bcp.2020.114124 32593612 PMC7572646 Huynh PN, Harvey PJ, Gajewiak J, Craik DJ, Michael McIntosh J. Critical residue properties for potency and selectivity of α-Conotoxin RgIA towards α9α10 nicotinic acetylcholine receptors. Biochem Pharmacol. 2020;181:114124. 32593612 10.1016/j.bcp.2020.114124 PMC7572646 350. Christensen SB Hone AJ Roux I Kniazeff J Pin JP Upert G Servent D Glowatzki E McIntosh JM RgIA4 potently blocks mouse α9α10 nAChRs and provides long lasting protection against Oxaliplatin-Induced cold allodynia Front Cell Neurosci 2017 11 219 10.3389/fncel.2017.00219 28785206 PMC5519620 Christensen SB, Hone AJ, Roux I, Kniazeff J, Pin JP, Upert G, Servent D, Glowatzki E, McIntosh JM. RgIA4 potently blocks mouse α9α10 nAChRs and provides long lasting protection against Oxaliplatin-Induced cold allodynia. Front Cell Neurosci. 2017;11:219. 28785206 10.3389/fncel.2017.00219 PMC5519620 351. Chu X Tae HS Xu Q Jiang T Adams DJ Yu R α-Conotoxin Vc1.1 Structure-Activity relationship at the human α9α10 nicotinic acetylcholine receptor investigated by minimal side chain replacement ACS Chem Neurosci 2019 10 10 4328 36 10.1021/acschemneuro.9b00389 31411453 Chu X, Tae HS, Xu Q, Jiang T, Adams DJ, Yu R. α-Conotoxin Vc1.1 Structure-Activity relationship at the human α9α10 nicotinic acetylcholine receptor investigated by minimal side chain replacement. ACS Chem Neurosci. 2019;10(10):4328–36. 31411453 10.1021/acschemneuro.9b00389 352. Clark RJ Akcan M Kaas Q Daly NL Craik DJ Cyclization of conotoxins to improve their biopharmaceutical properties Toxicon: Official J Int Soc Toxinology 2012 59 4 446 55 10.1016/j.toxicon.2010.12.003 21147143 Clark RJ, Akcan M, Kaas Q, Daly NL, Craik DJ. Cyclization of conotoxins to improve their biopharmaceutical properties. Toxicon: Official J Int Soc Toxinology. 2012;59(4):446–55. 10.1016/j.toxicon.2010.12.003 21147143 353. Clark RJ Jensen J Nevin ST Callaghan BP Adams DJ Craik DJ The engineering of an orally active conotoxin for the treatment of neuropathic pain Angewandte Chemie (International Ed English) 2010 49 37 6545 8 10.1002/anie.201000620 20533477 Clark RJ, Jensen J, Nevin ST, Callaghan BP, Adams DJ, Craik DJ. The engineering of an orally active conotoxin for the treatment of neuropathic pain. Angewandte Chemie (International Ed English). 2010;49(37):6545–8. 10.1002/anie.201000620 20533477 354. Clark RJ Fischer H Dempster L Daly NL Rosengren KJ Nevin ST Meunier FA Adams DJ Craik DJ Engineering stable peptide toxins by means of backbone cyclization: stabilization of the alpha-conotoxin MII Proc Natl Acad Sci U S A 2005 102 39 13767 72 10.1073/pnas.0504613102 16162671 PMC1236553 Clark RJ, Fischer H, Dempster L, Daly NL, Rosengren KJ, Nevin ST, Meunier FA, Adams DJ, Craik DJ. Engineering stable peptide toxins by means of backbone cyclization: stabilization of the alpha-conotoxin MII. Proc Natl Acad Sci U S A. 2005;102(39):13767–72. 16162671 10.1073/pnas.0504613102 PMC1236553 355. Franke B James AM Mobli M Colgrave ML Mylne JS Rosengren KJ Two proteins for the price of one: structural studies of the dual-destiny protein Preproalbumin with sunflower trypsin inhibitor-1 J Biol Chem 2017 292 30 12398 411 10.1074/jbc.M117.776955 28536266 PMC5535016 Franke B, James AM, Mobli M, Colgrave ML, Mylne JS, Rosengren KJ. Two proteins for the price of one: structural studies of the dual-destiny protein Preproalbumin with sunflower trypsin inhibitor-1. J Biol Chem. 2017;292(30):12398–411. 28536266 10.1074/jbc.M117.776955 PMC5535016 356. Armishaw CJ Dutton JL Craik DJ Alewood PF Establishing regiocontrol of disulfide bond isomers of alpha-conotoxin ImI via the synthesis of N-to-C Cyclic analogs Biopolymers 2010 94 3 307 13 10.1002/bip.21360 20013812 Armishaw CJ, Dutton JL, Craik DJ, Alewood PF. Establishing regiocontrol of disulfide bond isomers of alpha-conotoxin ImI via the synthesis of N-to-C Cyclic analogs. Biopolymers. 2010;94(3):307–13. 20013812 10.1002/bip.21360 357. Carstens BB Swedberg J Berecki G Adams DJ Craik DJ Clark RJ Effects of linker sequence modifications on the structure, stability, and biological activity of a Cyclic α-conotoxin Biopolymers 2016 106 6 864 75 10.1002/bip.22848 27038328 Carstens BB, Swedberg J, Berecki G, Adams DJ, Craik DJ, Clark RJ. Effects of linker sequence modifications on the structure, stability, and biological activity of a Cyclic α-conotoxin. Biopolymers. 2016;106(6):864–75. 27038328 10.1002/bip.22848 358. Halai R Callaghan B Daly NL Clark RJ Adams DJ Craik DJ Effects of cyclization on stability, structure, and activity of α-conotoxin RgIA at the α9α10 nicotinic acetylcholine receptor and GABA(B) receptor J Med Chem 2011 54 19 6984 92 10.1021/jm201060r 21888386 Halai R, Callaghan B, Daly NL, Clark RJ, Adams DJ, Craik DJ. Effects of cyclization on stability, structure, and activity of α-conotoxin RgIA at the α9α10 nicotinic acetylcholine receptor and GABA(B) receptor. J Med Chem. 2011;54(19):6984–92. 21888386 10.1021/jm201060r 359. Castro J Grundy L Deiteren A Harrington AM O’Donnell T Maddern J Moore J Garcia-Caraballo S Rychkov GY Yu R Cyclic analogues of α-conotoxin Vc1.1 inhibit colonic nociceptors and provide analgesia in a mouse model of chronic abdominal pain Br J Pharmacol 2018 175 12 2384 98 10.1111/bph.14115 29194563 PMC5980271 Castro J, Grundy L, Deiteren A, Harrington AM, O’Donnell T, Maddern J, Moore J, Garcia-Caraballo S, Rychkov GY, Yu R, et al. Cyclic analogues of α-conotoxin Vc1.1 inhibit colonic nociceptors and provide analgesia in a mouse model of chronic abdominal pain. Br J Pharmacol. 2018;175(12):2384–98. 29194563 10.1111/bph.14115 PMC5980271 360. Zheng N Christensen SB Blakely A Dowell C Purushottam L McIntosh JM Chou DH Development of conformationally constrained α-RgIA analogues as stable peptide antagonists of human α9α10 nicotinic acetylcholine receptors J Med Chem 2020 63 15 8380 7 10.1021/acs.jmedchem.0c00613 32597184 PMC7942019 Zheng N, Christensen SB, Blakely A, Dowell C, Purushottam L, McIntosh JM, Chou DH. Development of conformationally constrained α-RgIA analogues as stable peptide antagonists of human α9α10 nicotinic acetylcholine receptors. J Med Chem. 2020;63(15):8380–7. 32597184 10.1021/acs.jmedchem.0c00613 PMC7942019 361. Rabenstein DL Weaver KH Kinetics and equilibria of the thiol/disulfide exchange reactions of somatostatin with glutathione J Org Chem 1996 61 21 7391 7 10.1021/jo960917+ 11667665 Rabenstein DL, Weaver KH. Kinetics and equilibria of the thiol/disulfide exchange reactions of somatostatin with glutathione. J Org Chem. 1996;61(21):7391–7. 11667665 10.1021/jo960917+ 362. Gehrmann J Alewood PF Craik DJ Structure determination of the three disulfide bond isomers of alpha-conotoxin GI: a model for the role of disulfide bonds in structural stability J Mol Biol 1998 278 2 401 15 10.1006/jmbi.1998.1701 9571060 Gehrmann J, Alewood PF, Craik DJ. Structure determination of the three disulfide bond isomers of alpha-conotoxin GI: a model for the role of disulfide bonds in structural stability. J Mol Biol. 1998;278(2):401–15. 9571060 10.1006/jmbi.1998.1701 363. Green BR Zhang MM Chhabra S Robinson SD Wilson MJ Redding A Olivera BM Yoshikami D Bulaj G Norton RS Interactions of disulfide-deficient selenocysteine analogs of µ-conotoxin BuIIIB with the α-subunit of the voltage-gated sodium channel subtype 1.3 FEBS J 2014 281 13 2885 98 10.1111/febs.12835 24814369 PMC4160447 Green BR, Zhang MM, Chhabra S, Robinson SD, Wilson MJ, Redding A, Olivera BM, Yoshikami D, Bulaj G, Norton RS. Interactions of disulfide-deficient selenocysteine analogs of µ-conotoxin BuIIIB with the α-subunit of the voltage-gated sodium channel subtype 1.3. FEBS J. 2014;281(13):2885–98. 24814369 10.1111/febs.12835 PMC4160447 364. MacRaild CA Illesinghe J van Lierop BJ Townsend AL Chebib M Livett BG Robinson AJ Norton RS Structure and activity of (2,8)-dicarba-(3,12)-cystino alpha-ImI, an alpha-conotoxin containing a nonreducible cystine analogue J Med Chem 2009 52 3 755 62 10.1021/jm8011504 19125616 MacRaild CA, Illesinghe J, van Lierop BJ, Townsend AL, Chebib M, Livett BG, Robinson AJ, Norton RS. Structure and activity of (2,8)-dicarba-(3,12)-cystino alpha-ImI, an alpha-conotoxin containing a nonreducible cystine analogue. J Med Chem. 2009;52(3):755–62. 19125616 10.1021/jm8011504 365. Chhabra S Belgi A Bartels P van Lierop BJ Robinson SD Kompella SN Hung A Callaghan BP Adams DJ Robinson AJ Dicarba analogues of α-conotoxin rgia. Structure, stability, and activity at potential pain targets J Med Chem 2014 57 23 9933 44 10.1021/jm501126u 25393758 Chhabra S, Belgi A, Bartels P, van Lierop BJ, Robinson SD, Kompella SN, Hung A, Callaghan BP, Adams DJ, Robinson AJ, et al. Dicarba analogues of α-conotoxin rgia. Structure, stability, and activity at potential pain targets. J Med Chem. 2014;57(23):9933–44. 25393758 10.1021/jm501126u 366. van Lierop BJ Robinson SD Kompella SN Belgi A McArthur JR Hung A MacRaild CA Adams DJ Norton RS Robinson AJ Dicarba α-conotoxin Vc1.1 analogues with differential selectivity for nicotinic acetylcholine and GABAB receptors ACS Chem Biol 2013 8 8 1815 21 10.1021/cb4002393 23768016 van Lierop BJ, Robinson SD, Kompella SN, Belgi A, McArthur JR, Hung A, MacRaild CA, Adams DJ, Norton RS, Robinson AJ. Dicarba α-conotoxin Vc1.1 analogues with differential selectivity for nicotinic acetylcholine and GABAB receptors. ACS Chem Biol. 2013;8(8):1815–21. 23768016 10.1021/cb4002393 367. Yu R Seymour VA Berecki G Jia X Akcan M Adams DJ Kaas Q Craik DJ Less is more: design of a highly stable Disulfide-Deleted mutant of analgesic Cyclic α-Conotoxin Vc1.1 Sci Rep 2015 5 13264 10.1038/srep13264 26290113 PMC4542547 Yu R, Seymour VA, Berecki G, Jia X, Akcan M, Adams DJ, Kaas Q, Craik DJ. Less is more: design of a highly stable Disulfide-Deleted mutant of analgesic Cyclic α-Conotoxin Vc1.1. Sci Rep. 2015;5:13264. 26290113 10.1038/srep13264 PMC4542547 368. Xu P Kaas Q Wu Y Zhu X Li X Harvey PJ Zhangsun D Craik DJ Luo S Structure and activity studies of Disulfide-Deficient analogues of αO-Conotoxin gexiva J Med Chem 2020 63 4 1564 75 10.1021/acs.jmedchem.9b01409 31986036 Xu P, Kaas Q, Wu Y, Zhu X, Li X, Harvey PJ, Zhangsun D, Craik DJ, Luo S. Structure and activity studies of Disulfide-Deficient analogues of αO-Conotoxin gexiva. J Med Chem. 2020;63(4):1564–75. 31986036 10.1021/acs.jmedchem.9b01409 369. Wan J Huang JX Vetter I Mobli M Lawson J Tae HS Abraham N Paul B Cooper MA Adams DJ α-Conotoxin dendrimers have enhanced potency and selectivity for homomeric nicotinic acetylcholine receptors J Am Chem Soc 2015 137 9 3209 12 10.1021/jacs.5b00244 25710197 Wan J, Huang JX, Vetter I, Mobli M, Lawson J, Tae HS, Abraham N, Paul B, Cooper MA, Adams DJ, et al. α-Conotoxin dendrimers have enhanced potency and selectivity for homomeric nicotinic acetylcholine receptors. J Am Chem Soc. 2015;137(9):3209–12. 25710197 10.1021/jacs.5b00244 370. Lawrence PB Price JL How pegylation influences protein conformational stability Curr Opin Chem Biol 2016 34 88 94 10.1016/j.cbpa.2016.08.006 27580482 PMC5107330 Lawrence PB, Price JL. How pegylation influences protein conformational stability. Curr Opin Chem Biol. 2016;34:88–94. 27580482 10.1016/j.cbpa.2016.08.006 PMC5107330 371. Chen CS Lee CH Hsieh CD Ho CT Pan MH Huang CS Tu SH Wang YJ Chen LC Chang YJ Nicotine-induced human breast cancer cell proliferation attenuated by garcinol through down-regulation of the nicotinic receptor and Cyclin D3 proteins Breast Cancer Res Treat 2011 125 1 73 87 10.1007/s10549-010-0821-3 20229177 Chen CS, Lee CH, Hsieh CD, Ho CT, Pan MH, Huang CS, Tu SH, Wang YJ, Chen LC, Chang YJ, et al. Nicotine-induced human breast cancer cell proliferation attenuated by garcinol through down-regulation of the nicotinic receptor and Cyclin D3 proteins. Breast Cancer Res Treat. 2011;125(1):73–87. 20229177 10.1007/s10549-010-0821-3 372. Shih YL Liu HC Chen CS Hsu CH Pan MH Chang HW Chang CH Chen FC Ho CT Yang YY Combination treatment with Luteolin and Quercetin enhances antiproliferative effects in nicotine-treated MDA-MB-231 cells by down-regulating nicotinic acetylcholine receptors J Agric Food Chem 2010 58 1 235 41 10.1021/jf9031684 19921817 Shih YL, Liu HC, Chen CS, Hsu CH, Pan MH, Chang HW, Chang CH, Chen FC, Ho CT, Yang YY, et al. Combination treatment with Luteolin and Quercetin enhances antiproliferative effects in nicotine-treated MDA-MB-231 cells by down-regulating nicotinic acetylcholine receptors. J Agric Food Chem. 2010;58(1):235–41. 19921817 10.1021/jf9031684 373. Tu SH Ku CY Ho CT Chen CS Huang CS Lee CH Chen LC Pan MH Chang HW Chang CH Tea polyphenol (-)-epigallocatechin-3-gallate inhibits nicotine- and estrogen-induced α9-nicotinic acetylcholine receptor upregulation in human breast cancer cells Mol Nutr Food Res 2011 55 3 455 66 10.1002/mnfr.201000254 21370452 Tu SH, Ku CY, Ho CT, Chen CS, Huang CS, Lee CH, Chen LC, Pan MH, Chang HW, Chang CH, et al. Tea polyphenol (-)-epigallocatechin-3-gallate inhibits nicotine- and estrogen-induced α9-nicotinic acetylcholine receptor upregulation in human breast cancer cells. Mol Nutr Food Res. 2011;55(3):455–66. 21370452 10.1002/mnfr.201000254 374. Ochirbat S, Kan TC, Hsu CC, Huang TH, Chuang KH, Chen M, Cheng CC, Chang CC, Rahayu S, Chang J. The angiogenic role of the alpha 9-nicotinic acetylcholine receptor in triple-negative breast cancers. Angiogenesis 10.1007/s10456-024-09944-6 39177676 375. Liao YC Cheng TC Tu SH Chang J Guo P Chen LC Ho YS Tumor targeting and therapeutic assessments of RNA nanoparticles carrying α9-nAChR aptamer and anti-miR-21 in triple-negative breast cancers Mol Therapy Nucleic Acids 2023 33 351 66 10.1016/j.omtn.2023.07.013 37547295 PMC10400867 Liao YC, Cheng TC, Tu SH, Chang J, Guo P, Chen LC, Ho YS. Tumor targeting and therapeutic assessments of RNA nanoparticles carrying α9-nAChR aptamer and anti-miR-21 in triple-negative breast cancers. Mol Therapy Nucleic Acids. 2023;33:351–66. 37547295 10.1016/j.omtn.2023.07.013 PMC10400867 376. Qian J Liu YQ Sun ZH Zhangsun DT Luo SL Identification of nicotinic acetylcholine receptor subunits in different lung cancer cell lines and the inhibitory effect of alpha-conotoxin TxID on lung cancer cell growth Eur J Pharmacol 2019 865 172674 10.1016/j.ejphar.2019.172674 31634461 Qian J, Liu YQ, Sun ZH, Zhangsun DT, Luo SL. Identification of nicotinic acetylcholine receptor subunits in different lung cancer cell lines and the inhibitory effect of alpha-conotoxin TxID on lung cancer cell growth. Eur J Pharmacol. 2019;865:172674. 31634461 10.1016/j.ejphar.2019.172674 377. Zhao W, Xiong Y, Zhangsun D, Luo S. DSPE-PEG modification of α-Conotoxin TxID. Mar Drugs 2019, 17(6). 10.3390/md17060342 PMC6627868 31181805 378. Still PC Yi B González-Cestari TF Pan L Pavlovicz RE Chai HB Ninh TN Li C Soejarto DD McKay DB Alkaloids from Microcos paniculata with cytotoxic and nicotinic receptor antagonistic activities J Nat Prod 2013 76 2 243 9 10.1021/np3007414 23327794 PMC3580017 Still PC, Yi B, González-Cestari TF, Pan L, Pavlovicz RE, Chai HB, Ninh TN, Li C, Soejarto DD, McKay DB, et al. Alkaloids from Microcos paniculata with cytotoxic and nicotinic receptor antagonistic activities. J Nat Prod. 2013;76(2):243–9. 23327794 10.1021/np3007414 PMC3580017 379. Rana B McMorn SO Reeve HL Wyatt CN Vaughan PF Peers C Inhibition of neuronal nicotinic acetylcholine receptors by Imipramine and Desipramine Eur J Pharmacol 1993 250 2 247 51 10.1016/0014-2999(93)90388-X 7509283 Rana B, McMorn SO, Reeve HL, Wyatt CN, Vaughan PF, Peers C. Inhibition of neuronal nicotinic acetylcholine receptors by Imipramine and Desipramine. Eur J Pharmacol. 1993;250(2):247–51. 7509283 10.1016/0014-2999(93)90388-x 380. He YQ Li Y Wang XY He XD Jun L Chuai M Lee KK Wang J Wang LJ Yang X Dimethyl phenyl piperazine iodide (DMPP) induces glioma regression by inhibiting angiogenesis Exp Cell Res 2014 320 2 354 64 10.1016/j.yexcr.2013.10.009 24162003 He YQ, Li Y, Wang XY, He XD, Jun L, Chuai M, Lee KK, Wang J, Wang LJ, Yang X. Dimethyl phenyl piperazine iodide (DMPP) induces glioma regression by inhibiting angiogenesis. Exp Cell Res. 2014;320(2):354–64. 24162003 10.1016/j.yexcr.2013.10.009 381. Kononenko V Joukhan A Bele T Križaj I Kralj S Turk T Drobne D Gelatin nanoparticles loaded with 3-alkylpyridinium salt APS7, an analog of marine toxin, are a promising support in human lung cancer therapy Biomed Pharmacother 2024 177 117007 10.1016/j.biopha.2024.117007 38906020 Kononenko V, Joukhan A, Bele T, Križaj I, Kralj S, Turk T, Drobne D. Gelatin nanoparticles loaded with 3-alkylpyridinium salt APS7, an analog of marine toxin, are a promising support in human lung cancer therapy. Biomed Pharmacother. 2024;177:117007. 38906020 10.1016/j.biopha.2024.117007 382. Shi JJ, Jia KH, Sun H, Gunosewoyo H, Yang F, Tang J, Luo J, Yu LF. Synthesis and Pharmacological Evaluation of σ2 Receptor Ligands Based on a 3-Alkoxyisoxazole Scaffold: Potential Antitumor Effects against Osteosarcoma. ChemMedChem 10.1002/cmdc.202000461 32964625 383. Hua H Zhang X Mu H Meng Q Jiang Y Wang Y Lu X Wang A Liu S Zhang Y RVG29-modified docetaxel-loaded nanoparticles for brain-targeted glioma therapy Int J Pharm 2018 543 1–2 179 89 10.1016/j.ijpharm.2018.03.028 29555442 Hua H, Zhang X, Mu H, Meng Q, Jiang Y, Wang Y, Lu X, Wang A, Liu S, Zhang Y, et al. RVG29-modified docetaxel-loaded nanoparticles for brain-targeted glioma therapy. Int J Pharm. 2018;543(1–2):179–89. 29555442 10.1016/j.ijpharm.2018.03.028 384. Xin X Liu W Zhang ZA Han Y Qi LL Zhang YY Zhang XT Duan HX Chen LQ Jin MJ Efficient Anti-Glioma therapy through the Brain-Targeted RVG15-Modified liposomes loading Paclitaxel-Cholesterol complex Int J Nanomed 2021 16 5755 76 10.2147/IJN.S318266 PMC8403987 34471351 Xin X, Liu W, Zhang ZA, Han Y, Qi LL, Zhang YY, Zhang XT, Duan HX, Chen LQ, Jin MJ, et al. Efficient Anti-Glioma therapy through the Brain-Targeted RVG15-Modified liposomes loading Paclitaxel-Cholesterol complex. Int J Nanomed. 2021;16:5755–76. 10.2147/IJN.S318266 PMC8403987 34471351 385. Huey R Rathbone D McCarron P Hawthorne S Design, stability and efficacy of a new targeting peptide for nanoparticulate drug delivery to SH-SY5Y neuroblastoma cells J Drug Target 2019 27 9 959 70 10.1080/1061186X.2019.1567737 30623678 Huey R, Rathbone D, McCarron P, Hawthorne S. Design, stability and efficacy of a new targeting peptide for nanoparticulate drug delivery to SH-SY5Y neuroblastoma cells. J Drug Target. 2019;27(9):959–70. 30623678 10.1080/1061186X.2019.1567737 386. Suenaga A Fujii T Ogawa H Maruyama T Ohuchida S Katsube N Obata T Kawashima K Up-regulation of lymphocytic cholinergic activity by ONO-4819, a selective prostaglandin EP4 receptor agonist, in MOLT-3 human leukemic T cells Vascul Pharmacol 2004 41 2 51 8 10.1016/j.vph.2004.03.006 15196475 Suenaga A, Fujii T, Ogawa H, Maruyama T, Ohuchida S, Katsube N, Obata T, Kawashima K. Up-regulation of lymphocytic cholinergic activity by ONO-4819, a selective prostaglandin EP4 receptor agonist, in MOLT-3 human leukemic T cells. Vascul Pharmacol. 2004;41(2):51–8. 15196475 10.1016/j.vph.2004.03.006 387. Chen H Wang N Wei S Xu X Wu C Liu S Inhibition of acetylcholine expression in the tumor microenvironment by mustard oil: A potential strategy to retard colon cancer progression Altern Ther Health Med 2023 29 8 246 51 37573596 Chen H, Wang N, Wei S, Xu X, Wu C, Liu S. Inhibition of acetylcholine expression in the tumor microenvironment by mustard oil: A potential strategy to retard colon cancer progression. Altern Ther Health Med. 2023;29(8):246–51. 37573596 388. Kumar R Kumar A Långström B Darreh-Shori T Discovery of novel choline acetyltransferase inhibitors using structure-based virtual screening Sci Rep 2017 7 1 16287 10.1038/s41598-017-16033-w 29176551 PMC5701137 Kumar R, Kumar A, Långström B, Darreh-Shori T. Discovery of novel choline acetyltransferase inhibitors using structure-based virtual screening. Sci Rep. 2017;7(1):16287. 29176551 10.1038/s41598-017-16033-w PMC5701137 389. Lau JK Brown KC Thornhill BA Crabtree CM Dom AM Witte TR Hardman WE McNees CA Stover CA Carpenter AB Inhibition of cholinergic signaling causes apoptosis in human bronchioalveolar carcinoma Cancer Res 2013 73 4 1328 39 10.1158/0008-5472.CAN-12-3190 23222296 PMC10461321 Lau JK, Brown KC, Thornhill BA, Crabtree CM, Dom AM, Witte TR, Hardman WE, McNees CA, Stover CA, Carpenter AB, et al. Inhibition of cholinergic signaling causes apoptosis in human bronchioalveolar carcinoma. Cancer Res. 2013;73(4):1328–39. 23222296 10.1158/0008-5472.CAN-12-3190 PMC10461321 390. !!!. INVALID CITATION !!! [164]. 391. !!!. INVALID CITATION !!! [173]. 392. Richbart SD Merritt JC Nolan NA Dasgupta P Acetylcholinesterase and human cancers Adv Cancer Res 2021 152 1 66 10.1016/bs.acr.2021.05.001 34353435 Richbart SD, Merritt JC, Nolan NA, Dasgupta P. Acetylcholinesterase and human cancers. Adv Cancer Res. 2021;152:1–66. 34353435 10.1016/bs.acr.2021.05.001 393. Syed M Fenoglio-Preiser C Skau KA Weber GF Acetylcholinesterase supports anchorage independence in colon cancer Clin Exp Metastasis 2008 25 7 787 98 10.1007/s10585-008-9192-0 18612832 Syed M, Fenoglio-Preiser C, Skau KA, Weber GF. Acetylcholinesterase supports anchorage independence in colon cancer. Clin Exp Metastasis. 2008;25(7):787–98. 18612832 10.1007/s10585-008-9192-0 394. Perry C Sklan EH Soreq H CREB regulates AChE-R-induced proliferation of human glioblastoma cells Neoplasia 2004 6 3 279 86 10.1593/neo.03424 15153340 PMC1502102 Perry C, Sklan EH, Soreq H. CREB regulates AChE-R-induced proliferation of human glioblastoma cells. Neoplasia. 2004;6(3):279–86. 15153340 10.1593/neo.3424 PMC1502102 395. Formagio AS Vieira MC Volobuff CR Silva MS Matos AI Cardoso CA Foglio MA Carvalho JE In vitro biological screening of the anticholinesterase and antiproliferative activities of medicinal plants belonging to Annonaceae Brazilian J Med Biol Res = Revista Brasileira De Pesquisas Medicas E Biologicas 2015 48 4 308 15 10.1590/1414-431x20144127 PMC4418360 25714885 Formagio AS, Vieira MC, Volobuff CR, Silva MS, Matos AI, Cardoso CA, Foglio MA, Carvalho JE. In vitro biological screening of the anticholinesterase and antiproliferative activities of medicinal plants belonging to Annonaceae. Brazilian J Med Biol Res = Revista Brasileira De Pesquisas Medicas E Biologicas. 2015;48(4):308–15. 10.1590/1414-431X20144127 PMC4418360 25714885 396. Zovko A, Sepcic K, Turk T, Faimali M, Garaventa F, Chelossi E, Paleari L, Falugi C, Aluigi M, Angelini CJWTBB. New aspects of the relationship between acethylcholinesterase activity and cancer I: Poly-Aps experiments. 2009, 6:58–69. 397. Paleari L Trombino S Falugi C Gallus L Carlone S Angelini C Sepcic K Turk T Faimali M Noonan DM Marine sponge-derived polymeric alkylpyridinium salts as a novel tumor chemotherapeutic targeting the cholinergic system in lung tumors Int J Oncol 2006 29 6 1381 8 17088975 Paleari L, Trombino S, Falugi C, Gallus L, Carlone S, Angelini C, Sepcic K, Turk T, Faimali M, Noonan DM, et al. Marine sponge-derived polymeric alkylpyridinium salts as a novel tumor chemotherapeutic targeting the cholinergic system in lung tumors. Int J Oncol. 2006;29(6):1381–8. 17088975 398. Nguyen TH Pham HV Pham NK Quach ND Pudhom K Hansen PE Nguyen KP Chemical constituents from sonneratia ovata backer and their in vitro cytotoxicity and acetylcholinesterase inhibitory activities Bioorg Med Chem Lett 2015 25 11 2366 71 10.1016/j.bmcl.2015.04.017 25933595 Nguyen TH, Pham HV, Pham NK, Quach ND, Pudhom K, Hansen PE, Nguyen KP. Chemical constituents from sonneratia ovata backer and their in vitro cytotoxicity and acetylcholinesterase inhibitory activities. Bioorg Med Chem Lett. 2015;25(11):2366–71. 25933595 10.1016/j.bmcl.2015.04.017 399. Lee J Sohn EJ Yoon SW Kim CG Lee S Kim JY Baek N Kim SH Anti-Metastatic effect of dehydrocorydaline on H1299 Non-Small cell lung carcinoma cells via Inhibition of matrix metalloproteinases and B cell lymphoma 2 Phytother Res 2017 31 3 441 8 10.1002/ptr.5766 28144994 Lee J, Sohn EJ, Yoon SW, Kim CG, Lee S, Kim JY, Baek N, Kim SH. Anti-Metastatic effect of dehydrocorydaline on H1299 Non-Small cell lung carcinoma cells via Inhibition of matrix metalloproteinases and B cell lymphoma 2. Phytother Res. 2017;31(3):441–8. 28144994 10.1002/ptr.5766 400. Pfitzinger PL Fangmann L Wang K Demir E Gürlevik E Fleischmann-Mundt B Brooks J D’Haese JG Teller S Hecker A Indirect cholinergic activation slows down pancreatic cancer growth and tumor-associated inflammation J Exp Clin Cancer Res 2020 39 1 289 10.1186/s13046-020-01796-4 33357230 PMC7758936 Pfitzinger PL, Fangmann L, Wang K, Demir E, Gürlevik E, Fleischmann-Mundt B, Brooks J, D’Haese JG, Teller S, Hecker A, et al. Indirect cholinergic activation slows down pancreatic cancer growth and tumor-associated inflammation. J Exp Clin Cancer Res. 2020;39(1):289. 33357230 10.1186/s13046-020-01796-4 PMC7758936 401. Pepper C Tu H Morrill P Garcia-Rates S Fegan C Greenfield S Tumor cell migration is inhibited by a novel therapeutic strategy antagonizing the alpha-7 receptor Oncotarget 2017 8 7 11414 24 10.18632/oncotarget.14545 28077796 PMC5355275 Pepper C, Tu H, Morrill P, Garcia-Rates S, Fegan C, Greenfield S. Tumor cell migration is inhibited by a novel therapeutic strategy antagonizing the alpha-7 receptor. Oncotarget. 2017;8(7):11414–24. 28077796 10.18632/oncotarget.14545 PMC5355275 402. Akimov MG, Kudryavtsev DS, Kryukova EV, Fomina-Ageeva EV, Zakharov SS, Gretskaya NM, Zinchenko GN, Serkov IV, Makhaeva GF, Boltneva NP et al. Arachidonoylcholine and other unsaturated Long-Chain acylcholines are endogenous modulators of the acetylcholine signaling system. Biomolecules 2020, 10(2). 10.3390/biom10020283 PMC7072677 32059521 403. Gazzard L Williams K Chen H Axford L Blackwood E Burton B Chapman K Crackett P Drobnick J Ellwood C Mitigation of acetylcholine esterase activity in the 1,7-Diazacarbazole series of inhibitors of checkpoint kinase 1 J Med Chem 2015 58 12 5053 74 10.1021/acs.jmedchem.5b00464 25988399 Gazzard L, Williams K, Chen H, Axford L, Blackwood E, Burton B, Chapman K, Crackett P, Drobnick J, Ellwood C, et al. Mitigation of acetylcholine esterase activity in the 1,7-Diazacarbazole series of inhibitors of checkpoint kinase 1. J Med Chem. 2015;58(12):5053–74. 25988399 10.1021/acs.jmedchem.5b00464 404. Shi X Liu P Ma Y Li M Zhang Z Zhang X Shi D Si X Identification of a 2-phenylthiazole derivative acetylcholinesterase modulator with in vitro antitumor activity in breast cancer cells Chem Biol Drug Des 2024 103 1 e14402 10.1111/cbdd.14402 38009562 Shi X, Liu P, Ma Y, Li M, Zhang Z, Zhang X, Shi D, Si X. Identification of a 2-phenylthiazole derivative acetylcholinesterase modulator with in vitro antitumor activity in breast cancer cells. Chem Biol Drug Des. 2024;103(1):e14402. 38009562 10.1111/cbdd.14402 405. Saeed A Mahesar PA Zaib S Khan MS Matin A Shahid M Iqbal J Synthesis, cytotoxicity and molecular modelling studies of new phenylcinnamide derivatives as potent inhibitors of cholinesterases Eur J Med Chem 2014 78 43 53 10.1016/j.ejmech.2014.03.015 24675179 Saeed A, Mahesar PA, Zaib S, Khan MS, Matin A, Shahid M, Iqbal J. Synthesis, cytotoxicity and molecular modelling studies of new phenylcinnamide derivatives as potent inhibitors of cholinesterases. Eur J Med Chem. 2014;78:43–53. 24675179 10.1016/j.ejmech.2014.03.015 406. Iqbal J Saeed A Shah SJ al-Rashida M Shams-ul M Biological evaluation of Azomethine-dihydroquinazolinone conjugates as cancer and cholinesterase inhibitors. Medicinal chemistry (Shariqah (United Arab Emirates)) 2016 12 1 74 82 10.2174/1573406411666150708111417 26152145 Iqbal J, Saeed A, Shah SJ, al-Rashida M, Shams-ul M. Biological evaluation of Azomethine-dihydroquinazolinone conjugates as cancer and cholinesterase inhibitors. Medicinal chemistry (Shariqah 10.2174/1573406411666150708111417 26152145 407. Wang H Chao Y Zhao H Zhou X Zhang F Zhang Z Li Z Pan J Wang J Chen Q Smart nanomedicine to enable crossing Blood-Brain barrier delivery of checkpoint Blockade antibody for immunotherapy of glioma ACS Nano 2022 16 1 664 74 10.1021/acsnano.1c08120 34978418 Wang H, Chao Y, Zhao H, Zhou X, Zhang F, Zhang Z, Li Z, Pan J, Wang J, Chen Q, et al. Smart nanomedicine to enable crossing Blood-Brain barrier delivery of checkpoint Blockade antibody for immunotherapy of glioma. ACS Nano. 2022;16(1):664–74. 34978418 10.1021/acsnano.1c08120 408. Kaira K Mouri A Imai H Yamaguchi O Kagamu H Clinical issue of myasthenia Gravis related to immune checkpoint inhibitors Curr Oncol Rep 2024 26 9 1113 9 10.1007/s11912-024-01571-0 38954314 Kaira K, Mouri A, Imai H, Yamaguchi O, Kagamu H. Clinical issue of myasthenia Gravis related to immune checkpoint inhibitors. Curr Oncol Rep. 2024;26(9):1113–9. 38954314 10.1007/s11912-024-01571-0 409. Shames Y Errante M Keteku NP Myasthenia gravis: A rare neurologic complication of immune checkpoint inhibitor therapy J Adv Practitioner Oncol 2022 13 2 151 7 10.6004/jadpro.2022.13.2.6 PMC8955569 35369395 Shames Y, Errante M, Keteku NP. Myasthenia gravis: A rare neurologic complication of immune checkpoint inhibitor therapy. J Adv Practitioner Oncol. 2022;13(2):151–7. 10.6004/jadpro.2022.13.2.6 PMC8955569 35369395 410. Tezuka T Okuzumi S Nakashima C Ide T Imai S Mitsuboshi S Kuwahara Y Takizawa T Seki M Minematsu N Dysautonomia associated with immune checkpoint inhibitors J Neurol 2023 270 7 3413 23 10.1007/s00415-023-11667-5 36939931 Tezuka T, Okuzumi S, Nakashima C, Ide T, Imai S, Mitsuboshi S, Kuwahara Y, Takizawa T, Seki M, Minematsu N, et al. Dysautonomia associated with immune checkpoint inhibitors. J Neurol. 2023;270(7):3413–23. 36939931 10.1007/s00415-023-11667-5 411. Safa H Johnson DH Trinh VA Rodgers TE Lin H Suarez-Almazor ME Fa’ak F Saberian C Yee C Davies MA Immune checkpoint inhibitor related myasthenia gravis: single center experience and systematic review of the literature J Immunother Cancer 2019 7 1 319 10.1186/s40425-019-0774-y 31753014 PMC6868691 Safa H, Johnson DH, Trinh VA, Rodgers TE, Lin H, Suarez-Almazor ME, Fa’ak F, Saberian C, Yee C, Davies MA, et al. Immune checkpoint inhibitor related myasthenia gravis: single center experience and systematic review of the literature. J Immunother Cancer. 2019;7(1):319. 31753014 10.1186/s40425-019-0774-y PMC6868691 412. Takahashi T Ohnishi H Sugiura Y Honda K Suematsu M Kawasaki T Deguchi T Fujii T Orihashi K Hippo Y Non-neuronal acetylcholine as an endogenous regulator of proliferation and differentiation of Lgr5-positive stem cells in mice FEBS J 2014 281 20 4672 90 10.1111/febs.12974 25143155 Takahashi T, Ohnishi H, Sugiura Y, Honda K, Suematsu M, Kawasaki T, Deguchi T, Fujii T, Orihashi K, Hippo Y, et al. Non-neuronal acetylcholine as an endogenous regulator of proliferation and differentiation of Lgr5-positive stem cells in mice. FEBS J. 2014;281(20):4672–90. 25143155 10.1111/febs.12974 413. Eva C Hadjiconstantinou M Neff NH Meek JL Acetylcholine measurement by high-performance liquid chromatography using an enzyme-loaded postcolumn reactor Anal Biochem 1984 143 2 320 4 10.1016/0003-2697(84)90670-5 6397998 Eva C, Hadjiconstantinou M, Neff NH, Meek JL. Acetylcholine measurement by high-performance liquid chromatography using an enzyme-loaded postcolumn reactor. Anal Biochem. 1984;143(2):320–4. 6397998 10.1016/0003-2697(84)90670-5 414. Świt P Pollap A Orzeł J Spectroscopic determination of acetylcholine (ACh): A representative review Top Curr Chem (Cham) 2023 381 4 16 10.1007/s41061-023-00426-9 37169979 PMC10175388 Świt P, Pollap A, Orzeł J. Spectroscopic determination of acetylcholine (ACh): A representative review. Top Curr Chem (Cham). 2023;381(4):16. 37169979 10.1007/s41061-023-00426-9 PMC10175388 415. Lamy E Pilyser L Paquet C Bouaziz-Amar E Grassin-Delyle S High-sensitivity quantification of acetylcholine and choline in human cerebrospinal fluid with a validated LC-MS/MS method Talanta 2021 224 121881 10.1016/j.talanta.2020.121881 33379090 Lamy E, Pilyser L, Paquet C, Bouaziz-Amar E, Grassin-Delyle S. High-sensitivity quantification of acetylcholine and choline in human cerebrospinal fluid with a validated LC-MS/MS method. Talanta. 2021;224:121881. 33379090 10.1016/j.talanta.2020.121881 416. Mineur YS Picciotto MR How can I measure brain acetylcholine levels in vivo? Advantages and caveats of commonly used approaches J Neurochem 2023 167 1 3 15 10.1111/jnc.15943 37621094 PMC10616967 Mineur YS, Picciotto MR. How can I measure brain acetylcholine levels in vivo? Advantages and caveats of commonly used approaches. J Neurochem. 2023;167(1):3–15. 37621094 10.1111/jnc.15943 PMC10616967 417. Gotti C Carbonnelle E Moretti M Zwart R Clementi F Drugs selective for nicotinic receptor subtypes: a real possibility or a dream? Behav Brain Res 2000 113 1–2 183 92 10.1016/S0166-4328(00)00212-6 10942044 Gotti C, Carbonnelle E, Moretti M, Zwart R, Clementi F. Drugs selective for nicotinic receptor subtypes: a real possibility or a dream? Behav Brain Res. 2000;113(1–2):183–92. 10942044 10.1016/s0166-4328(00)00212-6 418. Ambrosi P Becchetti A Targeting neuronal nicotinic receptors in cancer: new ligands and potential side-effects Recent Pat Anti-cancer Drug Discov 2013 8 1 38 52 10.2174/1574892811308010038 22537644 Ambrosi P, Becchetti A. Targeting neuronal nicotinic receptors in cancer: new ligands and potential side-effects. Recent Pat Anti-cancer Drug Discov. 2013;8(1):38–52. 10.2174/15748928130105 22537644 419. Schledwitz A, Xie G, Raufman JP. Exploiting unique features of the gut-brain interface to combat Gastrointestinal cancer. J Clin Invest 2021, 131(10). 10.1172/JCI143776 PMC8121521 33998603 420. Gao J Lan J Liao H Yang F Qiu P Jin F Wang S Shen L Chao T Zhang C Promising preclinical patient-derived organoid (PDO) and xenograft (PDX) models in upper Gastrointestinal cancers: progress and challenges BMC Cancer 2023 23 1 1205 10.1186/s12885-023-11434-9 38062430 PMC10702130 Gao J, Lan J, Liao H, Yang F, Qiu P, Jin F, Wang S, Shen L, Chao T, Zhang C, et al. Promising preclinical patient-derived organoid (PDO) and xenograft (PDX) models in upper Gastrointestinal cancers: progress and challenges. BMC Cancer. 2023;23(1):1205. 38062430 10.1186/s12885-023-11434-9 PMC10702130 421. Ali O, Tolaymat M, Hu S, Xie G, Raufman JP. Overcoming Obstacles to targeting muscarinic receptor signaling in colorectal cancer. Int J Mol Sci 2021, 22(2). 10.3390/ijms22020716 PMC7828259 33450835 422. Chen X Jia Y Zhang Y Zhou D Sun H Ma X α5-nAChR contributes to epithelial-mesenchymal transition and metastasis by regulating Jab1/Csn5 signalling in lung cancer J Cell Mol Med 2020 24 4 2497 506 10.1111/jcmm.14941 31930655 PMC7028847 Chen X, Jia Y, Zhang Y, Zhou D, Sun H, Ma X. α5-nAChR contributes to epithelial-mesenchymal transition and metastasis by regulating Jab1/Csn5 signalling in lung cancer. J Cell Mol Med. 2020;24(4):2497–506. 31930655 10.1111/jcmm.14941 PMC7028847 ",
  "metadata": {
    "Title of this paper": "α5-nAChR contributes to epithelial-mesenchymal transition and metastasis by regulating Jab1/Csn5 signalling in lung cancer",
    "Journal it was published in:": "Molecular Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482714/"
  }
}