{
  "title": "Paper_13",
  "abstract": "pmc MicroPubl Biol MicroPubl Biol 3859 micropubbio microPublication Biology 2578-9430 California Institute of Technology PMC12495483 PMC12495483.1 12495483 12495483 10.17912/micropub.biology.001764 1 New Finding Materials and Reagents Cell Culture Undergraduate Research Experience Class Activities Human Other Cells stably expressing shRNA against MYO10 display altered cell motility Mas Joanna A. Data curation Formal analysis Investigation Methodology Supervision Validation Visualization Writing - original draft Writing - review & editing 1 Cristella Chase E. Data curation Formal analysis Investigation Methodology Validation Visualization Writing - original draft Writing - review & editing 1 Phan Vu Hao M.N. Data curation Formal analysis Investigation Methodology Visualization Writing - original draft Writing - review & editing 1 Wendt Lillian S. Data curation Formal analysis Investigation Visualization Writing - original draft Writing - review & editing 1 Rose Charlotte A. Data curation Formal analysis Investigation Methodology Visualization Writing - original draft Writing - review & editing 1 Ali Abigail Data curation Formal analysis Investigation Methodology Visualization 1 Carpio David F. Data curation Formal analysis Investigation Methodology Visualization 1 Cole Christine Data curation Formal analysis Investigation Methodology Visualization 1 Embley Paige Data curation Formal analysis Investigation Methodology Visualization 1 Hoskins-Harris Jack E. Data curation Formal analysis Investigation Methodology Visualization 1 Johnson Delia Data curation Formal analysis Investigation Methodology Visualization 1 Ledoux Noelle Data curation Formal analysis Investigation Methodology Visualization 1 Lwin Hannah W. Data curation Formal analysis Investigation Methodology Visualization 1 Salah Sarah Data curation Formal analysis Investigation Methodology Visualization 1 Weisbart Erin Formal analysis Methodology Supervision Writing - review & editing 2 Criswell Stacey J. Conceptualization Funding acquisition Methodology Project administration Resources Supervision Writing - review & editing 1 Quintero-Carmona Omar Alberto Conceptualization Data curation Formal analysis Funding acquisition Investigation Methodology Project administration Resources Supervision Validation Visualization Writing - original draft Writing - review & editing 1 §  1  2 § oquinter@richmond.edu The authors declare that there are no conflicts of interest present. 19 9 2025 2025 2025 479498 10.17912/micropub.biology.001764 24 7 2025 3 9 2025 17 9 2025 19 09 2025 05 10 2025 05 10 2025 Copyright: © 2025 by the authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Myosin-X (MYO10) is an actin-based motor protein involved in cytoskeletal dynamics, membrane interactions, and integrin-mediated adhesion. To investigate MYO10's cellular roles, we generated MYO10 knockdown (MYO10 KD KD KD KD The University of Richmond School of Arts & Sciences funded undergraduate summer research for JAM, CEC, VMNP, and LSW through “ The Richmond Guarantee pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Figure 1. Decreased MYO10 expression in two different cell lines stably expressing shRNA results in proliferation, motility, and attachment defects compared to wild-type parental cell lines Semi-clonal HeLa and COS7 lines isolated by puromycin selection show decreased MYO10 mRNA and protein expression as measured by (A) (B) (C) KD (D) KD (E) KD (F) KD Quantitative and statistical representations: Description In eukaryotic cells, both cell migration and the organization of internal components rely on a cytoskeletal system composed of filaments, motor proteins, and their associated regulators (reviewed in Machesky and Schliwa, 2000). The class X myosin proteins (MYO10) play roles in both cytoskeletal dynamics and membrane interactions (Kerber and Cheney, 2011; Tokuo, 2020). MYO10 facilitates the formation of filopodia (Berg and Cheney, 2002; Bohil et al., 2006; Tokuo et al., 2007), promotes directed migration (Arjonen et al., 2011; Hwang et al., 2009), and links actin filaments to membrane-bound receptors such as integrins (Cox et al., 2002; He et al., 2017; Toyoshima and Nishida, 2007; Zhang et al., 2004). Given these roles, MYO10 is thought to contribute to spatially coordinated signaling events essential for cell proliferation, adhesion, and motility. To better understand the mechanistic contributions of MYO10 in these contexts, we generated and characterized MYO10 knockdown cell lines using lentiviral delivery of short hairpin RNA (shRNA) resulting in genomic integration (Dull et al., 1998). By doing so, we aimed to generate an accessible cell culture model system for investigating the roles of MYO10 in cytoskeletal organization, migratory capacity, and adhesive behavior. These cell lines also provide a useful platform for studying the functionality of specific MYO10 domains and sequences through ectopic expression of fluorescently tagged or mutant constructs. Cell culture model systems are more useful for studying the behavior of fluorescently tagged proteins-of-interest if the endogenous expression of that protein is reduced. By minimizing the confounding behavior of the native protein, observed phenotypes can be attributed to the exogenously expressed protein. Although embryonic fibroblasts isolated from MYO10 knockout mice (MYO10 KO KO Figure 1A Figure 1B KD KD WT We assayed the HeLa and COS7 MYO10 KD Figure 1C KD KD WT Xenopus KD HeLa cells generate filopodia on their dorsal surfaces and along their edges, while COS7 cells do not generate dorsal filopodia and have very few edge filopodia (Berg and Cheney, 2002; Bohil et al., 2006). Previous reports described differences in filopodia formation following transient siRNA treatment to reduce MYO10 expression (Bohil et al., 2006). We used scanning electron microscopy to assay HeLa MYO10 KD Figure 1D KD WT KD WT We used a wound-healing assay (Liang et al., 2007) to examine the effect of MYO10 knockdown on collective cell migration. Briefly, cells were grown to near-confluency on coverslips, the monolayer was disrupted by gentle scratching with a pipet tip, and the wounds were fixed and examined following 18 hours of recovery in low-serum media to limit the impact of cell division on wound closure. Recovery was measured by either quantifying the width of the wound, or by assaying the area of the wound visible in each image ( Figure 1E KD WT 5 2 5 2 5 2 5 2 KD WT KD WT MYO10 serves as a link between the actin cytoskeleton and extracellular matrix proteins through integrin-mediated adhesions (Alieva et al., 2019; Zhang et al., 2004). Laminin is one such extracellular matrix protein. We used cell spreading assays on laminin-coated surfaces to evaluate the impact of decreased MYO10 expression on integrin-mediated attachment for both HeLa and COS7 cells. MYO10 KD WT Figure 1F 2 2 2 2 KD WT Taken together, the phenotypes of these HeLa and COS7 MYO10 KD Methods COS7 and HeLa cell culture Cos7 (Gluzman, 1981) and HeLa (Scherer et al., 1953) cells were cultured in growth media: DMEM high glucose (Gibco) supplemented with 10% Fetal Bovine Serum (Benchmark FBS, GeminiBio), and antibiotics (50U/ml penicillin, 50mg/ml streptomycin, Gibco). Cells were maintained in a humidified incubator at 37°C with 5% CO 2  Lentivirus and stable cell line production HEK293FT cells (a gift from Benjamin Major, UNC Chapel Hill) were grown in growth media. The cells were maintained at 37°C in a humidified environment supplemented with 5% CO₂. To generate virus, Lipofectamine 3000 (Invitrogen) was used as the transfection reagent, and cells grown in T75 plates pCMV-VSV-G (Stewart et al., 2003), pRSV-Rev, pMDLg/pRRE (Dull et al., 1998) (Addgene plasmid # 8454, 12253, and 12251, respectively), pLKO.1 plasmid TRCN0000123087 (Moffat et al., 2006) targeting the human MYO10 sequence (target sequence: CCCAGATGAGAAGATATTCAA, Millipore Sigma), and a small amount of pEGFP-C1 to verify transfection. Twenty four hours later, media containing the virus was collected and replaced with fresh media. Cellular debris was removed from the virus-containing media by centrifugation at 2000 x g for 5 minutes at 4°C prior to infection. HeLa cells and COS7 cells were plated in T25 flasks and grown to confluency. They were then incubated with lentivirus media diluted into DMEM growth at a 1:4 or a 4:1 viral media:growth media ratio. The media was supplemented with 8mg/ml hexadimethrine bromide and the infected plates were incubated overnight. The following day, the cells in the T25 were transferred to 150mm cell culture dishes and grown in media containing 2µg/ml puromycin. Media was replaced every two days to remove debris from dying cells. The plates were examined for clusters of isolated cells assumed to be colonies of cells where the DNA containing the shRNA cassette and the puromycin resistance gene had been incorporated into the cells’ genome. Eight to ten days after infection, clusters were isolated by placing a cloning ring in sterile petroleum jelly surrounding a colony. The colony was trypsinized, transferred to one well of a 6-well dish, and cultured in puromycin-containing growth media. The cultures were grown and expanded for 10 more days prior to verification of MYO10 knockdown by qPCR and western blotting. At this point, validated cultures of HeLa cells and COS7 cells were designated “passage #1,” and aliquots were frozen in DMEM growth media supplemented with 10% cell culture-grade DMSO (Sigma) and 40% fetal bovine serum.  Quantitative Real Time PCR sample preparation and analysis RNA was isolated from T25-sized cultures of HeLa or COS7 cells using the RNeasy Plus kit (Qiagen) according the supplied protocol for purification of RNA from animal cells. In addition to the standard protocol, we also treated the cells to a Qiashredder step before loading the cell lysate onto the purification column, and we treated the lysate with an on-column DNAse digestion prior to washing and eluting the RNA. RNA concentration was estimated using a Nanodrop spectrophotometer, aliquoted, and frozen at -80°C. cDNA was synthesized using the M-MLV reverse transcriptase kit with random hexamer primers, following the standard protocol, with a starting amount of 750µg RNA (Invitrogen). qPCR samples were prepared using the Luna Universal qPCR Master Mix (New England Biolabs) and run on a Bio-Rad CFX96 real time PCR machine, and assayed for MYO10 expression and β-actin expression. Standard curves for both MYO10 and β-actin were generated and run in parallel with the cell line cDNA samples—all samples in triplicate. MYO10 expression relative to β-actin expression was quantified using Bio-Rad CFX Manager software and was standardized relative to the wild-type cell MYO10/β-actin ratio for the relevant knockdown line.  Western blotting Cells were lysed in sample buffer containing protease inhibitors (50 mM Tris HCl, pH 7.4, 0.5 M NaCl, 0.2% SDS, 1 mM EDTA, 1 mM DTT, 10 mg/ml aprotinin, 10 mg/ml leupeptin, 1 mM PMSF) at a concentration of 2x10 6  Western blotting quantification and analysis Band intensities were quantified using the “Analyze Gels” tool in FIJI/ImageJ (Schindelin et al., 2012). The MYO10/tubulin ratio was calculated for each sample, where the average MYO10/tubulin ratio for the wild-type cells was set to a value of 1, and all other MYO10/tubulin ratios were standardized relative to this value.  Growth curve sample preparation, data acquisition, and analysis The cell proliferation assay protocol was adapted from (Rago et al., 1990). Cells were plated in six 96-well cell culture plates at a density of 1000 cells/well in 100 μL of growth media and incubated in a humidified environment at 37°C with 5% CO₂. Empty wells were filled with 100 μL of sterile water to prevent media evaporation. Sufficient plates were set up at the beginning of the experiment so that one plate could be collected each day of the experiment. Each day, one plate was removed from the incubator, and media was discarded by gently shaking the plate over a sink, followed by blotting on a paper towel. The plate was then stored at -80°C. This process was repeated at the same time for subsequent days. All plates were kept at -80°C for an additional 24 hours following the final time day. Plates were thawed at room temperature for approximately an hour. After thawing, 100 μL of sterile water was added to each well. To induce lysis, plates were incubated at 37°C for one hour before being returned to -80°C overnight. Plates were removed from -80°C, thawed at room temperature for an hour, and stained with 100 μL of staining buffer (10mM Tris, 2M NaCl, 1mM EDTA, 2mM NaN 3 Raw absorbance data was pasted into a spreadsheet for analysis. Background absorbance values were determined using sterile water wells and subtracted from all sample wells. To calculate fold-growth, absorbance values for each condition were normalized to the average absorbance on Day 1. Average fold growth values across multiple experiments were plotted using KaleidaGraph software, and were then fit to a single exponential growth model. The exponential growth curve was used to determine the doubling time at Day 4.  SEM sample preparation, imaging, and filopodial density quantification Before processing, a 6-well dish was prepared, where wild-type or MYO10 knockdown HeLa cells were plated on acid-washed, 18 mm round #1.5 coverslips at a concentration of 25,000 cells/well in growth media, and allowed to adhere overnight. The following day, media was removed, and samples were fixed in warm PBS containing 4% paraformaldehyde and 2% glutaraldehyde for at least 30 minutes with gentle rocking. Fixative was removed with three, 10-minute PBS washes. Samples were dehydrated via a series of ethanol washes at 30%, 50%, 70%, 95%, and 100% ethanol for 10 mins at each concentration. Samples were submerged in 100% ethanol and critical-point dried using a Samdri-795. After drying, samples were mounted on 12.2 mm diameter, 10 mm high aluminum mounts and sputter-coated with a Leica EM ACE600 ~10nm of 60/40 gold/palladium to prevent the buildup of surface charges. Samples were then imaged using a JEOL JSM-IT700HR scanning electron microscope set to a working distance of 15mm, a standard probe current (STD-PC) of 50, and a field of view of 128µmx96µm. To reduce the potential for bias, SEM images were randomized using a “Blind Experiment” plugin in FIJI-ImageJ. Randomized images were then opened in FIJI. To calculate dorsal filopodia density, a region of interest (ROI) was highlighted using the “Rectangle” tool for each cell present in the image. The ROI was then enlarged, and dorsal filopodia were manually counted using the “Cell Counter” plugin. Filopodial surface density (filopodia/mm 2  Wound healing assay sample preparation & imaging On day 1, both HeLa and COS7 wild-type and MYO10 knockdown cells were plated on square glass coverslips at a concentration of 120,000 cells per well in growth media and allowed to adhere overnight. On day 2, once confluency was verified, cells were scratched. Using a P10 pipette tip, the coverslip upon which the cells were growing on was scratched 5 total times. 3 of the scratches were done in parallel vertically, and 2 of the scratches were done in parallel horizontally. This allowed up 5 possible “lanes” of observation when image capturing. After scratching, the media from these wells was removed, and 3 mLs of Low-Serum Media was added to prevent cellular division. Wounds were allowed to heal for 18 hours, after which cells were then permeabilized in PBS with 0.5% Triton X100 for 5 minutes. Samples were stained for F-actin and DNA with 6.6nM ALEXA488-phalloidin and 15nM DAPI for 30 minutes. After four 5-minute PBS washes, the cells were mounted onto slides using Profade Glass. Images were captured using an Olympus UPlanSApo20x/0.75NA objective mounted on either an IX-71 or IX-83 stand, an EXFO mixed gas light source, a Chroma Sedat Quad filter set, and a Hamamatsu ORCA Flash 4v2 camera. The microscopy hardware and image acquisition settings were controlled by Metamorph software. Typical exposure times were under 30ms for DAPI and under 150ms for ALEXA488-phalloidin.  Wound healing assay quantification, widths Using the straight line tool in FIJI/ImageJ, ten lines were traced from one side of the wound to the other, approximately perpendicular to the wound edge for each image. Line lengths were recorded in pixels, converted to microns, and averaged for each day. A minimum of 10 images were captured for each sample condition on each day.  Wound healing assay quantification, area Wound area was completed using both Ilastik (Berg et al., 2019) and FIJI/ImageJ. With Ilastik, the images captured on the channel visualizing F-actin were uploaded to the application. “Cell” and “background” pixels were identified using the “Pixel Classification” segmentation workflow, with all options selected in the “Feature Selection” step. The classifier was trained using 15-20% of the total number of pictures in a set. Scratches from each day, cell type, and condition were trained individually. Simple segmentations were exported as TIF files. The resulting segmented files were thresholded in FIJI/ImageJ, the wound areas were measured for each image, and averaged together for each condition on each day. A minimum of 10 images were captured for each condition on each day.  Spreading assay sample preparation & imaging Prior to plating, acid-washed, 22mm square #1.5 coverslips were placed in a 6 well dish, coated with 10µg/mL laminin in PBS for 30 minutes, and then washed 3x with PBS. Cells were lifted using 0.25% trypsin with EDTA, and then resuspended at a concentration of 20,000 cells/mL in DMEM supplemented with 10% fetal bovine serum, penicillin, and streptomycin. 3 mL of the cell mixture were added to each well for a total of 60,000 cells/well, and allowed to adhere for the specified amount of time. Once the time-course ended, the media was removed and the cells were fixed in PBS with 4% paraformaldehyde for 20 minutes. Cells were then permeabilized in PBS with 0.5% Triton X100 for 5 minutes. Samples were stained for F-actin and DNA with 6.6nM ALEXA568-phalloidin and 15nM DAPI for 30 minutes. After four 5-minute PBS washes, the cells were mounted onto slides using Profade Glass. Images were captured using an Olympus UPlanSApo20x/0.75NA objective mounted on either an IX-71 or IX-83 stand, an EXFO mixed gas light source, a Chroma Sedat Quad filter set, and a Hamamatsu ORCA Flash 4v2 camera. The microscopy hardware and image acquisition settings were controlled by Metamorph software. Typical exposure times were under 30ms for DAPI and under 150ms for ALEXA568-phalloidin.  Spreading assay quantification, area Measurement of cell area was completed using both Ilastik and FIJI/ImageJ. With Ilastik, the images captured on the channel visualizing F-actin were uploaded to the application. “Cell” and “background” pixels were identified using the “Pixel Classification” segmentation workflow, with all options selected in the “Feature Selection” step. The classifier was trained using 15-20% of the total number of pictures in a set. Samples from each day, cell type, and condition were trained individually. Simple segmentations were exported as TIF files. The resulting segmented files were thresholded in FIJI/ImageJ, cell areas were measured for each image, and averaged together for each condition on each day. A minimum of 10 images were captured for each condition on each day.  Replication and statistical analysis For qPCR, each marker represents the average of 2-3 technical replicates for a particular experiment (n = 3 or 4 experiments). For western blotting, each marker represents a single sample for a particular experiment (n =4 experiments). For growth curves and doubling time calculations, each marker represents the average of 5-7 different experiments where each experiment contained triplicate technical replicates. For dorsal filopodia density, each marker represents the average of >15 measured cells (n = 5 experiments). For wound width, each marker represents the average of >50 width measurements across multiple wounds (n = 6, 7, or 8 experiments). For wound area, each marker represents the average of >10 different images of wounds (n = 6 or 7 experiments). For spreading area, each marker represents the average of >90 cells (n = 6 or 7 experiments). Statistical comparisons between conditions within a cell type (wild-type versus knockdown) were carried out using a Student’s t-test. Data are reported in the text as mean ± standard error of the mean. As wounding width variation is sensitive to the experimenter carrying out the scratch, wound data was compared using a paired Student’s t-test. The results in this report were generated primarily by undergraduate students working in the Quintero lab and the Spring BIOL317 Mechanochemical Cell Biology Course at the University of Richmond. OAQ-C generated the lentivirus and established the cell lines, CEC validated the cell lines using qPCR and western blotting, JAM completed the growth assays, VMNP completed the scanning electron microscopy analysis, and CEC & JAM collaborated on the scratch analysis. Once the cell lines were established the students in BIOL317 used the lines as part of a course-based undergraduate research experience where they became proficient at collecting fluorescence microscopy data, and basic segmentation and quantitative image analysis under the guidance of SJC, EW, and OAQ-C. JAM was the BIOL317 teaching assistant responsible for cell line maintenance and sample preparation. The students chose to analyze cell spreading and other measures of size & shape. Validation of the results came from multiple teams of students using different instruments to collect and analyze images from the same sets of slides. The students then compared results across all teams within the class. To get exposure and immersion to the cell science field, the students presented their results in a “Zoom lab meeting” at the end of the semester to Hijab Fatima (Columbia University), Jordan Beach (Loyola University Chicago), Richard Cheney (UNC Chapel Hill), Tom Pollard (Yale University), Derek Applewhite (Reed College), Meg Titus (University of Minnesota), Kendall Stewart (UC Davis), Gabe Offenback (UNC Chapel Hill), Graham Johnson (Allen Institute for Cell Science), Uri Manor (UC San Diego), Sarah Heissler (The Ohio State University), Adelaide Masterson (Latham BioPharm Group), Anthony Isenhour (Yale University), Dan Kiehart (Duke University), and John Peters (Harvard University). The BIOL317 team would like to thank these scientists for their time, their support, and their insight. Their participation was crucial to giving the students a sense that their efforts have value to the greater cell science community. We thank the University of Richmond School of Arts & Sciences for establishing and maintaining the Biological Imaging Lab Part of this work can be found on bioRxiv (Mas et al., 2025). Alieva NO Efremov AK Hu S Oh D Chen Z Natarajan M Ong HT Jégou A Romet-Lemonne G Groves JT Sheetz MP Yan J Bershadsky AD 2019 8 9 Myosin IIA and formin dependent mechanosensitivity of filopodia adhesion. Nat Commun 10 1 3593 3593 10.1038/s41467-019-10964-w 31399564 PMC6689027 Arjonen A Kaukonen R Ivaska J 2011 10 1 Filopodia and adhesion in cancer cell motility. Cell Adh Migr 5 5 1933-6918 421 430 10.4161/cam.5.5.17723 21975551 PMC3218609 Berg JS Cheney RE 2002 3 1 Myosin-X is an unconventional myosin that undergoes intrafilopodial motility. Nat Cell Biol 4 3 1465-7392 246 250 10.1038/ncb762 11854753 Berg S Kutra D Kroeger T Straehle CN Kausler BX Haubold C Schiegg M Ales J Beier T Rudy M Eren K Cervantes JI Xu B Beuttenmueller F Wolny A Zhang C Koethe U Hamprecht FA Kreshuk A 2019 9 30 ilastik: interactive machine learning for (bio)image analysis. Nat Methods 16 12 1548-7091 1226 1232 10.1038/s41592-019-0582-9 31570887 Bishai EA Sidhu GS Li W Dhillon J Bohil AB Cheney RE Hartwig JH Southwick FS 2012 11 13 Myosin-X facilitates Shigella-induced membrane protrusions and cell-to-cell spread. Cell Microbiol 15 3 1462-5814 353 367 10.1111/cmi.12051 23083060 PMC4070382 Bohil AB Robertson BW Cheney RE 2006 8 7 Myosin-X is a molecular motor that functions in filopodia formation. Proc Natl Acad Sci U S A 103 33 0027-8424 12411 12416 10.1073/pnas.0602443103 16894163 PMC1567893 Courson DS Cheney RE 2015 3 27 Myosin-X and disease. Exp Cell Res 334 1 0014-4827 10 15 10.1016/j.yexcr.2015.03.014 25819274 PMC4433855 Cox D Berg JS Cammer M Chinegwundoh JO Dale BM Cheney RE Greenberg S 2002 7 1 Myosin X is a downstream effector of PI(3)K during phagocytosis. Nat Cell Biol 4 7 1465-7392 469 477 10.1038/ncb805 12055636 Dull T Zufferey R Kelly M Mandel RJ Nguyen M Trono D Naldini L 1998 11 1 A third-generation lentivirus vector with a conditional packaging system. J Virol 72 11 0022-538X 8463 8471 10.1128/JVI.72.11.8463-8471.1998 9765382 PMC110254 El-Brolosy MA Stainier DYR 2017 7 13 Genetic compensation: A phenomenon in search of mechanisms. PLoS Genet 13 7 1553-7390 e1006780 e1006780 10.1371/journal.pgen.1006780 28704371 PMC5509088 Frattini A Fabbri M Valli R De Paoli E Montalbano G Gribaldo L Pasquali F Maserati E 2015 10 20 High variability of genomic instability and gene expression profiling in different HeLa clones. Sci Rep 5 15377 15377 10.1038/srep15377 26483214 PMC4613361 Gluzman Y 1981 1 1 SV40-transformed simian cells support the replication of early SV40 mutants. Cell 23 1 0092-8674 175 182 10.1016/0092-8674(81)90282-8 6260373 He K Sakai T Tsukasaki Y Watanabe TM Ikebe M 2017 10 20 Myosin X is recruited to nascent focal adhesions at the leading edge and induces multi-cycle filopodial elongation. Sci Rep 7 1 13685 13685 10.1038/s41598-017-06147-6 29057977 PMC5651867 Heimsath EG Jr Yim YI Mustapha M Hammer JA Cheney RE 2017 12 11 Myosin-X knockout is semi-lethal and demonstrates that myosin-X functions in neural tube closure, pigmentation, hyaloid vasculature regression, and filopodia formation. Sci Rep 7 1 17354 17354 10.1038/s41598-017-17638-x 29229982 PMC5725431 Hu WE Zhang X Guo QF Yang JW Yang Y Wei SC Su XD 2019 12 2 HeLa-CCL2 cell heterogeneity studied by single-cell DNA and RNA sequencing. PLoS One 14 12 e0225466 e0225466 10.1371/journal.pone.0225466 31790455 PMC6886862 Hwang YS Luo T Xu Y Sargent TD 2009 10 1 Myosin-X is required for cranial neural crest cell migration in Xenopus laevis. Dev Dyn 238 10 1058-8388 2522 2529 10.1002/dvdy.22077 19718754 PMC3023993 Kerber ML Cheney RE 2011 11 15 Myosin-X: a MyTH-FERM myosin at the tips of filopodia. J Cell Sci 124 Pt 22 0021-9533 3733 3741 10.1242/jcs.023549 22124140 PMC3225264 Kerber ML Jacobs DT Campagnola L Dunn BD Yin T Sousa AD Quintero OA Cheney RE 2009 4 23 A novel form of motility in filopodia revealed by imaging myosin-X at the single-molecule level. Curr Biol 19 11 0960-9822 967 973 10.1016/j.cub.2009.03.067 19398338 PMC2817954 Kwon M Bagonis M Danuser G Pellman D 2015 7 30 Direct Microtubule-Binding by Myosin-10 Orients Centrosomes toward Retraction Fibers and Subcortical Actin Clouds. Dev Cell 34 3 1534-5807 323 337 10.1016/j.devcel.2015.06.013 26235048 PMC4672950 Landry JJ Pyl PT Rausch T Zichner T Tekkedil MM Stütz AM Jauch A Aiyar RS Pau G Delhomme N Gagneur J Korbel JO Huber W Steinmetz LM 2013 8 7 The genomic and transcriptomic landscape of a HeLa cell line. G3 (Bethesda) 3 8 1213 1224 10.1534/g3.113.005777 23550136 PMC3737162 Liang CC Park AY Guan JL 2007 In vitro scratch assay: a convenient and inexpensive method for analysis of cell migration in vitro. Nat Protoc 2 2 329 333 10.1038/nprot.2007.30 17406593 Liu Y Mi Y Mueller T Kreibich S Williams EG Van Drogen A Borel C Frank M Germain PL Bludau I Mehnert M Seifert M Emmenlauer M Sorg I Bezrukov F Bena FS Zhou H Dehio C Testa G Saez-Rodriguez J Antonarakis SE Hardt WD Aebersold R 2019 2 18 Multi-omic measurements of heterogeneity in HeLa cells across laboratories. Nat Biotechnol 37 3 1087-0156 314 322 10.1038/s41587-019-0037-y 30778230 Machesky LM Schliwa M 2000 1 1 Cell dynamics: a new look at the cytoskeleton. Nat Cell Biol 2 1 1465-7392 E17 E18 10.1038/71403 10620818 Makowska KA Hughes RE White KJ Wells CM Peckham M 2015 12 6 Specific Myosins Control Actin Organization, Cell Morphology, and Migration in Prostate Cancer Cells. Cell Rep 13 10 2118 2125 10.1016/j.celrep.2015.11.012 26670045 PMC4688110 Mas Joanna A. Cristella Chase E. Phan Vu M.N. Wendt Lillie S. Rose Charlotte A. Ali Abigail Carpio David F. Cole Christine Embley Paige Hoskins-Harris Jack E. Johnson Delia Ledoux Noelle Lwin Hannah W. Salah Sarah Weisbart Erin Criswell Stacey J. Quintero-Carmona Omar A. 2025 7 24 Cells stably expressing shRNA against MYO10 display altered cell motility 10.1101/2025.07.23.666455 Mayca Pozo F Geng X Miyagi M Amin AL Huang AY Zhang Y 2023 5 17 MYO10 regulates genome stability and cancer inflammation through mediating mitosis. Cell Rep 42 5 112531 112531 10.1016/j.celrep.2023.112531 37200188 PMC10293887 Mayca Pozo F Geng X Tamagno I Jackson MW Heimsath EG Hammer JA Cheney RE Zhang Y 2021 9 15 MYO10 drives genomic instability and inflammation in cancer. Sci Adv 7 38 eabg6908 eabg6908 10.1126/sciadv.abg6908 34524844 PMC8443186 Miihkinen M Grönloh MLB Popović A Vihinen H Jokitalo E Goult BT Ivaska J Jacquemet G 2021 9 14 Myosin-X and talin modulate integrin activity at filopodia tips. Cell Rep 36 11 109716 109716 10.1016/j.celrep.2021.109716 34525374 PMC8456781 Moffat J Grueneberg DA Yang X Kim SY Kloepfer AM Hinkle G Piqani B Eisenhaure TM Luo B Grenier JK Carpenter AE Foo SY Stewart SA Stockwell BR Hacohen N Hahn WC Lander ES Sabatini DM Root DE 2006 3 24 A lentiviral RNAi library for human and mouse genes applied to an arrayed viral high-content screen. Cell 124 6 0092-8674 1283 1298 10.1016/j.cell.2006.01.040 16564017 Ou H Wang L Xi Z Shen H Jiang Y Zhou F Liu Y Zhou Y 2022 8 26 MYO10 contributes to the malignant phenotypes of colorectal cancer via RACK1 by activating integrin/Src/FAK signaling. Cancer Sci 113 11 1347-9032 3838 3851 10.1111/cas.15519 35912545 PMC9633311 Pi X Ren R Kelley R Zhang C Moser M Bohil AB Divito M Cheney RE Patterson C 2007 12 24 Sequential roles for myosin-X in BMP6-dependent filopodial extension, migration, and activation of BMP receptors. J Cell Biol 179 7 0021-9525 1569 1582 10.1083/jcb.200704010 18158328 PMC2373493 Rago R Mitchen J Wilding G 1990 11 15 DNA fluorometric assay in 96-well tissue culture plates using Hoechst 33258 after cell lysis by freezing in distilled water. Anal Biochem 191 1 0003-2697 31 34 10.1016/0003-2697(90)90382-j 1706565 Raines AN Nagdas S Kerber ML Cheney RE 2012 5 31 Headless Myo10 is a negative regulator of full-length Myo10 and inhibits axon outgrowth in cortical neurons. J Biol Chem 287 30 0021-9258 24873 24883 10.1074/jbc.M112.369173 22661706 PMC3408153 Sandquist JC Larson ME Woolner S Ding Z Bement WM 2018 1 10 An interaction between myosin-10 and the cell cycle regulator Wee1 links spindle dynamics to mitotic progression in epithelia. J Cell Biol 217 3 0021-9525 849 859 10.1083/jcb.201708072 29321170 PMC5839792 SCHERER WF SYVERTON JT GEY GO 1953 5 1 Studies on the propagation in vitro of poliomyelitis viruses. IV. Viral multiplication in a stable strain of human malignant epithelial cells (strain HeLa) derived from an epidermoid carcinoma of the cervix. J Exp Med 97 5 0022-1007 695 710 10.1084/jem.97.5.695 13052828 PMC2136303 Schindelin J Arganda-Carreras I Frise E Kaynig V Longair M Pietzsch T Preibisch S Rueden C Saalfeld S Schmid B Tinevez JY White DJ Hartenstein V Eliceiri K Tomancak P Cardona A 2012 6 28 Fiji: an open-source platform for biological-image analysis. Nat Methods 9 7 1548-7091 676 682 10.1038/nmeth.2019 22743772 PMC3855844 Stewart SA Dykxhoorn DM Palliser D Mizuno H Yu EY An DS Sabatini DM Chen IS Hahn WC Sharp PA Weinberg RA Novina CD 2003 4 1 Lentivirus-delivered stable gene silencing by RNAi in primary cells. RNA 9 4 1355-8382 493 501 10.1261/rna.2192803 12649500 PMC1370415 Tokuo H 2020 Myosin X. Adv Exp Med Biol 1239 0065-2598 391 403 10.1007/978-3-030-38062-5_17 32451868 Tokuo H Bhawan J Coluccio LM 2018 7 11 Myosin X is required for efficient melanoblast migration and melanoma initiation and metastasis. Sci Rep 8 1 10449 10449 10.1038/s41598-018-28717-y 29993000 PMC6041326 Tokuo H Ikebe M 2004 6 18 Myosin X transports Mena/VASP to the tip of filopodia. Biochem Biophys Res Commun 319 1 0006-291X 214 220 10.1016/j.bbrc.2004.04.167 15158464 Tokuo H Mabuchi K Ikebe M 2007 10 22 The motor activity of myosin-X promotes actin fiber convergence at the cell periphery to initiate filopodia formation. J Cell Biol 179 2 0021-9525 229 238 10.1083/jcb.200703178 17954606 PMC2064759 Toyoshima F Nishida E 2007 2 22 Integrin-mediated adhesion orients the spindle parallel to the substratum in an EB1- and myosin X-dependent manner. EMBO J 26 6 0261-4189 1487 1498 10.1038/sj.emboj.7601599 17318179 PMC1829369 Watanabe TM Tokuo H Gonda K Higuchi H Ikebe M 2010 4 13 Myosin-X induces filopodia by multiple elongation mechanism. J Biol Chem 285 25 0021-9258 19605 19614 10.1074/jbc.M109.093864 20392702 PMC2885239 Weber KL Sokac AM Berg JS Cheney RE Bement WM 2004 9 16 A microtubule-binding myosin required for nuclear anchoring and spindle assembly. Nature 431 7006 0028-0836 325 329 10.1038/nature02834 15372037 Woolner S O'Brien LL Wiese C Bement WM 2008 7 7 Myosin-10 and actin filaments are essential for mitotic spindle function. J Cell Biol 182 1 0021-9525 77 88 10.1083/jcb.200804062 18606852 PMC2447898 Yim YI Pedrosa A Wu X Chinthalapudi K Cheney RE Hammer JA 2023 6 15 Myosin 10 uses its MyTH4 and FERM domains differentially to support two aspects of spindle pole biology required for mitotic spindle bipolarity. bioRxiv 10.1101/2023.06.15.545002 37398378 PMC10312724 Yu H Lai M Guo Y Yuan L Lan Y Wang X Zhu X 2014 12 10 Myo10 is required for neurogenic cell adhesion and migration. In Vitro Cell Dev Biol Anim 51 4 1071-2690 400 407 10.1007/s11626-014-9845-z 25491426 Zhang H Berg JS Li Z Wang Y Lång P Sousa AD Bhaskar A Cheney RE Strömblad S 2004 5 23 Myosin-X provides a motor-based link between integrins and the cytoskeleton. Nat Cell Biol 6 6 1465-7392 523 531 10.1038/ncb1136 15156152 ",
  "metadata": {
    "Title of this paper": "Myosin-X provides a motor-based link between integrins and the cytoskeleton.",
    "Journal it was published in:": "microPublication Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495483/"
  }
}