{
  "title": "Paper_387",
  "abstract": "pmc BMC Med Inform Decis Mak BMC Med Inform Decis Mak 42 bmcmidm BMC Medical Informatics and Decision Making 1472-6947 BMC PMC12482897 PMC12482897.1 12482897 12482897 41023978 10.1186/s12911-025-03197-z 3197 1 Research Comprehensive survival analysis of breast cancer patients: a bayesian network approach Toffaha Khaled Khaled.mToffaha@ku.ac.ae 1 Emre Simsekler Mecit Can 1 Shehhi Aamna Al 2 3 Sleptchenko Andrei 1 AlAwadhi Aydah 4 1 https://ror.org/05hffr360 grid.440568.b 0000 0004 1762 9729 Department of Management Science & Engineering, Khalifa University of Science & Technology, 2 https://ror.org/05hffr360 grid.440568.b 0000 0004 1762 9729 Department of Biomedical Engineering & Biotechnology, Khalifa University of Science & Technology, 3 https://ror.org/05hffr360 grid.440568.b 0000 0004 1762 9729 Healthcare Engineering Innovation Group (HEIG), Khalifa University of Science & Technology, 4 https://ror.org/00gk5fa11 grid.508019.5 0000 0004 9549 6394 Haematology & Oncology Division, Sheik Shakhbout Medical City, 29 9 2025 2025 25 478029 349 7 3 2025 10 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Breast cancer is recognized as one of the leading causes of cancer-related deaths globally. A deeper understanding of the complex interactions between clinical, pathological, and treatment-related factors is essential for improving patient outcomes. Methods Following comprehensive data cleaning and preprocessing, an analysis was performed on a cohort of 1,980 primary breast cancer samples from the METABRIC database. The dataset was divided into a 75/25 training–testing split, and five-fold cross-validation was applied to the training set to mitigate overfitting. Overall and relapse-free survival were then modeled using four fully parametric distributions: Weibull, Exponential, Log-Normal, and Log-Logistic, along with their corresponding Accelerated Failure Time (AFT) forms, to identify significant prognostic features. Competing models were ranked by the Akaike Information Criterion (AIC) and further validated through Quantile–Quantile (QQ) plots. Finally, the probabilistic relationships among the significant factors selected by the optimal AFT models were explored using a Bayesian Belief Network (BBN), whose structure was learned from the training data using multiple score-based algorithms and refined through expert-driven judgment; all conditional probability parameters were estimated using maximum likelihood. Results The Weibull model provided the best fit for overall survival, whereas the Log-Normal form was optimal for relapse-free survival, each satisfying their respective error-distribution diagnostics. In the hold-out test set, the Bayesian network achieved an Area Under the Curve (AUC) of 0.880 and an F1-score of 0.779. Age at diagnosis, menopausal status, tumor stage, lymph-node burden, and treatment modality were identified as the most influential predictors, and the learned network clarified their direct and mediated effects on both survival endpoints. Conclusion Through the integration of validated parametric survival models with a data-driven BBN, this study delivers a comprehensive framework for estimating individualized survival probabilities and visualizing the complex probabilistic relationships that characterize high-risk cancer patient profiles. This approach supports evidence-based, personalized breast cancer management and demonstrates the potential for guiding clinical decision-making and adapting to diverse external patient cohorts. Keywords Breast cancer Survival analysis Machine learning Bayesian belief network Healthcare analytics pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Breast cancer continues to represent the most significant oncological challenge among women globally, constituting the most frequently diagnosed malignancy and the primary cause of cancer-related mortality in the female population [ 1 2 3 The prognosis and survival outcomes of breast cancer patients are influenced by a complex interconnected set of factors that operate through multifaceted pathways. Tumor size, lymph node involvement, and metastatic status constitute the most significant clinical and pathological determinants of survival, forming the foundation of traditional prognostic assessment [ 4 5 5 7 Survival analysis represents a branch of statistical methodology specifically designed to analyze time-to-event data, where the primary outcome variable forms the duration until a specific event occurs. This analytical approach is advantageous in medical research contexts for examining the temporal aspects of events such as mortality, disease recurrence, or recovery processes. The fundamental objectives of survival analysis contain the estimation of survival functions, comparative assessment of survival rates across different patient populations, and evaluation of relationships between explanatory variables and survival duration [ 8 9 10 Despite extensive research on breast cancer survival analysis, significant methodological gaps continue in the current literature, limiting a comprehensive understanding of survival dynamics and probabilistic relationships. While multiple studies have employed traditional semi-parametric approaches such as the Cox proportional hazards model, there remains a lack of research investigating the integration of parametric and non-parametric and Accelerated Failure Time (AFT) models with advanced causal inference methodologies, particularly Bayesian Belief Networks (BBN), in breast cancer survival analysis [ 11 12 13 14 The selection of BBNs over alternative causal inference frameworks is motivated by several methodological advantages that align with the complex nature of breast cancer survival analysis [ 15 16 This study addresses these identified methodological gaps by systematically evaluating and comparing the performance of multiple parametric survival models, including WeibullFitter, ExponentialFitter, LogNormalFitter, and LogLogisticFitter, while identifying key predictive factors through Accelerated Failure Time (AFT) modeling approaches. Integrating BBN methodology enables comprehensive exploration of probabilistic relationships between survival determinants and outcomes, achieving enhanced predictive performance through probabilistic inference mechanisms [ 17 The remainder of this manuscript is structured as follows. The Related Work section reviews prior studies on parametric survival modeling, population-based analyses, and causal inference approaches, particularly in the context of breast cancer prognosis. The Methods section outlines the dataset, preprocessing procedures, modeling techniques, and validation strategies employed. The Results section presents comparative performance of survival models, key prognostic features, and insights derived from BBN analysis. The discussion section interprets these findings across several thematic dimensions: age at diagnosis, menopausal status, treatment modalities, tumor staging, the Nottingham Prognostic Index, and causal inference from BBNs. Finally, the Conclusion section summarizes key contributions, followed by a reflection on limitations and proposed directions for future work. Related work Survival analysis in breast cancer research employs a range of statistical methodologies to identify prognostic factors and enhance patient outcomes. Prior investigations employing parametric models have demonstrated more flexibility than the semi-parametric methods in capturing time-to-event dynamics. In Northwest Ethiopia, Feleke et al. applied a Weibull–Gamma shared frailty model to a cohort of 322 patients, identifying age, stage, complications, treatment type, metastasis, blood type, family history, and recurrence as significant predictors and estimating mean and median survival times of 43.7 and 45 months, respectively [ 18 19 20 21 22 Studies based on population-level and registry data have highlighted the impact of molecular subtypes, treatment modalities, and socio-demographic disparities. A SEER-based analysis of de novo stage IV cases revealed that HR+/HER2– subtypes have superior breast cancer–specific survival compared to HR–/HER2–, with age, race, marital status, grade, surgery, and chemotherapy serving as independent prognostic factors [ 23 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\approx$$\\end{document} 24 1 25 Investigations employing causal inference techniques range from traditional Cox proportional hazards models, the conventional choice despite their reliance on proportional hazards assumptions, to Bayesian frameworks. Lin et al. combined Kaplan–Meier curves, Cox models, and Markov chain simulations to show that surgical intervention yields the most significant survival benefit in northern Taiwan, followed by hormone, chemo, and radio-therapies, with 5-year survival estimates up to 99.6% in early-stage patients [ 26 27 28 29 20 This research systematically compares multiple parametric survival models to identify the best-fitting approach for breast cancer survival analysis, followed by the extraction of significant prognostic features using AFT regression, combined with BBNs to uncover conditional dependencies among clinical, pathological, and socioeconomic predictors. Together, these methods form a robust framework that enhances both predictive accuracy and probabilistic insight into breast cancer prognosis. Methods This section details the methodological framework employed to conduct a comprehensive survival analysis of breast cancer patients, integrating parametric survival modeling with BN inference. The overarching workflow, illustrated in Fig. 1 Fig. 1 Proposed methodology outline Data collection The data were obtained from a Kaggle repository [ 30 31 32 Data processing Several data processing steps were undertaken to ensure the dataset’s integrity and suitability for survival models. Missing observations were addressed by applying the Multivariate Imputation by Chained Equations (MICE) algorithm, which iteratively estimated each variable with missing values via conditional models based on other covariates [ 33 34 Model selection In light of the censored time-to-event structure, non-parametric and parametric survival modeling approaches were considered. The choice of model depends on the characteristics of the data, particularly the proportion of censored observations and the underlying distribution of survival times. Parametric models Four parametric models, Weibull, Exponential, Log-Normal, and Log-Logistic, were selected for their ability to model survival time directly, accommodate a high proportion of censored data, and flexibly capture a range of underlying survival distributions. Non-parametric models To ensure reliable estimation under heavy censoring and to select the significant features through regression, the log-logistic, Weibull, and log-normal AFT models were adopted; their explicit survival-time formulations maintain robustness when censoring exceeds 50%, a scenario in which the widely used Kaplan–Meier estimator can produce biased or unstable results [ 35 Model selection criteria Model fit was assessed by comparing Akaike Information Criterion (AIC) values, calculated for each parametric specification to balance model complexity against goodness of fit, with the model exhibiting the lowest AIC considered the best. To verify these results, Quantile–Quantile (QQ) plots were used to map empirical survival quantiles to theoretical quantiles under each distribution. The model whose QQ plot most closely approximated the identity line was considered to provide the most accurate representation of the survival times. The final parametric model was chosen based on a joint consideration of AIC minimization and visual QQ-plot compliance, and its predictive accuracy was validated on the hold-out set. Evaluation and illustration The multivariate log-rank test was used to compare survival distributions across groups defined by multiple features. This test evaluated whether significant differences in survival times existed between those groups. Variables such as age at diagnosis, chemotherapy, and hormone therapy were assessed to determine their impact on survival, with corresponding p-values indicating whether each factor produced a significant difference. Survival curves were also generated to visually compare group-specific survival probabilities, aiding in the interpretation of survival trends and the influence of each covariate based on both graphical and statistical criteria. Bayesian network A score-based BBN was constructed to capture the conditional dependencies among the top predictors identified by AFT modeling and log-rank testing. Several structure-learning algorithms, including Naïve Bayes (NB), Tree-Augmented Naïve Bayes (TAN), Greedy Hill Climbing (GHC), Tabu Search (TS), Chow–Liu (CL), and Multivariate Information-based Inductive Causation (MIIC), were compared, all implemented in Python. Nodes corresponding to selected features were defined, and both statistical associations and expert knowledge informed directed edges representing conditional dependencies. Conditional probability tables were learned from the data via maximum likelihood, enabling probabilistic inference to compute posterior survival probabilities under specified feature configurations. The network’s discriminative power and classification performance were then evaluated on the hold-out test set using Area Under the Curve (AUC) and F1-score metrics, with 95% confidence intervals for AUC estimated through bootstrap resampling to ensure robust and stable results. Results This section summarises the findings obtained from the parametric survival analysis and the subsequent BN investigation. Emphasis is placed on (i) selecting the most suitable model for overall and relapse-free survival, (ii) identifying statistically significant prognostic factors through AFT models, and (iii) benchmarking alternative BBN learners and discretization schemes. Model comparison for overall and relapse-free survival Because more than half of the observations were censored, non-parametric estimators such as the Kaplan–Meier method were deemed unreliable cite Eurachem2017. Consequently, four parametric lifelines implementations WeibullFitter ExponentialFitter LogNormalFitter LogLogisticFitter 1 2 2 3 Table 1 Overall survival models comparison Model AIC Values Median Survival Time (Months) WeibullFitter 14386.62 152.45 ExponentialFitter 14465.45 150.85 LogNormalFitter 14423.16 146.26 LogLogisticFitter 14405.28 147.37 Table 2 Relapse-free survival models comparison Model AIC Values Median Relapse-Free Time (Months) WeibullFitter 10483.84 201.23 ExponentialFitter 10520.22 188.75 LogNormalFitter 10406.74 210.01 LogLogisticFitter 10443.95 200.01 Descriptive survival differences Table 3 Table 3 Dataset description and survival analysis Features Description Full Data Died of Cancer Condition Relapse Free (Months) Survival (Months) Age at Diagnosis Age (in years) at which the patient was diagnosed with breast cancer. 61 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\pm$$\\end{document} 56.5 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\pm$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\leq$$\\end{document} 157.8 209.6 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ > $$\\end{document} 217.2 148.3 Log Rank 0.012 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} Inferred Menopausal State Status of the patient based on available clinical data. 1543 586 Post 220.3 142.16 423 247 Pre 174 226.6 Log Rank 0.028 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} Type of Breast Surgery Surgical procedure types performed on the breast. 787 418 Breast Conserving 280.6 188.8 1179 415 Mastectomy 172.8 133 Log Rank \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} Cancer Type Detailed Specific classification of breast cancer, detailing subtypes. 17 12 Breast 552.9 343.8 1529 645 Breast Invasive Ductal Carcinoma 203.3 149.9 145 60 Breast Invasive Lobular Carcinoma 189.7 150.5 23 13 Breast Invasive Mixed Mucinous Carcinoma 593.5 191.5 210 79 Breast Mixed Ductal and Lobular Carcinoma 219.2 157.3 42 24 Invasive Breast Carcinoma 361.5 194.5 Log Rank 0.260 0.250 Cellularity Assessment of the tumor cells present in the specimen, indicating density and arrangement. 215 102 Low 234 159.9 764 316 Moderate 195.3 154.6 987 415 High 218.1 149.4 Log Rank 0.650 0.740 Nottingham prognostic index A score calculated using tumor size, lymph node status, and histological grade to estimate prognosis. 198 40 Poor 51 71.8 1095 461 Moderate 202 147 673 322 Good 358 190.4 Log Rank \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} Chemotherapy Indicates whether the patient underwent chemotherapy as part of their treatment plan. 1556 644 No 250 158.4 410 189 Yes 105.1 130.5 Log Rank \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} 0.003 Hormone Therapy Indicates whether the patient received hormone therapy as part of their treatment. 754 335 No 219.2 158.4 1212 498 Yes 200.5 130.5 Log Rank 0.674 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} Radio Therapy Indicates whether the patient received radiotherapy as part of their treatment regimen. 798 290 No 218.8 142.5 1168 543 Yes 204.3 160.9 Log Rank 0.810 0.008 Pam50 + Claudin-low subtype Classifies the tumor into molecular subtypes based on gene expression profiling. 208 94 Basal 164.4 138.7 224 67 Her2 118.4 113.2 699 322 LumA 303.3 177.3 475 160 LumB 139.5 128.7 147 69 Normal-like 190.6 163.5 213 121 claudin-low 396.6 198.4 Log Rank \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} ER status measured by IHC The presence of estrogen receptors in cancer cells using immunohistochemistry techniques. 446 200 Negative 162.5 138.8 1520 633 Positive 219 156.5 Log Rank 0.001 0.134 HER2 status measured by SNP6 Reflects HER2 receptor status determined through SNP6 analysis methods. 435 168 Negative 136.2 124 100 49 Positive 154.6 161 Log Rank \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} PR Status Status indicating whether the cancer cells express progesterone receptors. 1033 385 Negative 174.2 135 933 448 Positive 236.2 167 Log Rank \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} 3-Gene classifier subtype Classification based on expression levels of three specific genes. 690 230 ER+/HER2- High Prolif 153.5 135.3 696 343 ER+/HER2- Low Prolif 327.4 183.9 363 175 ER-/HER2- 214 156.8 217 85 HER2+ 115 116.3 Log Rank \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} Oncotree Code Standardized code to classify cancer types for consistency in research and clinical settings. 1529 645 IDC 203.3 148.8 145 60 ILC 189.7 150.5 210 79 MDLC 219.2 157.3 82 49 Other 440.3 211.8 Log Rank 0.094 0.110 Integrative Cluster Categorization of patients based on integrative analysis of multiple genomic data types. 139 59 1 127.4 140.7 224 118 2 94.3 122.2 72 20 3 334.6 182.2 286 138 4 249.3 169.4 338 167 5 82.6 94.8 189 60 6 144.9 121.4 85 26 7 407 168.8 189 77 8 257.5 163.4 299 120 9 129.3 124 145 48 10 277.4 186.7 Log Rank \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} Lymph nodes examined positive Count of lymph nodes that tested positive for cancer during surgical examination. 1061 513 N0: = 0 339.6 181.8 601 244 N1: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\leq$$\\end{document} 189.3 144.1 201 60 N2: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\leq$$\\end{document} 86.3 99.6 103 16 N3: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ > $$\\end{document} 39.5 59.6 Log Rank \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} Mutation Count Total number of mutations identified in the tumor DNA. 1826 779 Low 207.7 152.9 126 52 Intermediate 254 152.2 14 2 High 203.5 107.2 Log Rank 0.810 0.690 Neoplasm Histologic Grade Grade assigned to the tumor based on cellular characteristics. 171 25 1 623 195 813 221 2 239.7 167 982 221 3 156.2 132.6 Log Rank \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} Primary Tumor Laterality Identify which side of the body the primary tumor is located on. 1023 345 Left 206.3 148.7 943 294 Right 214.1 156.6 Log Rank 0.690 0.290 Tumor Other Histologic Subtype Other specified types of tumor based on microscopic examination. 1483 619 Ductal/NST 196.4 147.3 145 60 Lobular 189.7 150.5 252 103 Mixed 235 162.2 86 51 Other 572.2 245.7 Log Rank 0.005 0.003 Tumor Size Size of the tumor measured in millimeters at diagnosis. 851 437 T1: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\leq$$\\end{document} 309.9 194 1014 367 T2: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\leq$$\\end{document} 210 152.4 101 29 T3: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ > $$\\end{document} 89 95.2 Log Rank \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} Tumor Stage Stage of the tumor based on TNM classification system. 13 11 T0 27210.3 235.7 616 336 T1 406.1 214.2 1205 452 T2 172.4 133.2 122 33 T3 64.5 82.3 10 1 T4 15.3 46.4 Log Rank \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < 0.001$$\\end{document}  Fig. 2 Survival Models QQ plot Feature significance from best-fit models Log-Logistic, Weibull, and Log-Normal AFT formulations were estimated with covariates to quantify the influence of individual factors. Table 4 4 5 5 Age at Diagnosis Menopausal State ER/PR status Lymph-node burden Fig. 3 Relapse-free models QQ plot Fig. 4 Overall survival LogLogistic AFT Model Fig. 5 Relapse-free weibull AFT Model Table 4 Overall survival analysis Model AIC (Survival) AIC (Relapse-Free) Log-Logistic AFT 11179.72 10193.38 Weibull AFT 11440.62 10177.95 Log-Normal AFT 11310.05 10253.75 Table 5 Significant features identified by log-logistic AFT and Weibull AFT models Log-Logistic AFT (Survival) Weibull AFT (Relapse-Free) Age at Diagnosis Chemotherapy ER status measured by IHC ER status measured by IHC Inferred Menopausal State Inferred Menopausal State Radio Therapy Radio Therapy Hormone Therapy Hormone Therapy PR Status PR Status Integrative Cluster Neoplasm Histologic Grade Lymph Nodes Examined Positive Lymph Nodes Examined Positive Oncotree Code Oncotree Code Tumor Other Histologic Subtype Tumor Other Histologic Subtype Tumor Stage Tumor Stage Relapse Free Status Tumor Size HER2 status measured by SNP6 Nottingham Prognostic Index Bayesian network construction and evaluation Given the observed overlap of significant features, a BBN was built to explore the conditional pathways linking relapse-free and overall survival. Several structure-learning algorithms available in pyAgrum were benchmarked: NB, TAN, GHC, TS, CL, and MIIC. For each learner, three discretization rules, \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$k$$\\end{document} 6 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$k$$\\end{document} 7 8 Fig. 6 AUC for different combinations of learning methods and discretization functions Fig. 7 AUC and F1 score for TAN and Kmeans Discretization Fig. 8 Bayesian network diagram The BBN confirms that the relapse-free node acts as a parent of the overall-survival node, mediating the effects of therapy-related ( Chemotherapy Hormone Therapy Tumour Stage Lymph-node status Integrative Cluster Pam50 subtype Discussion The comprehensive survival analysis of breast cancer patients revealed significant insights into the complex interplay between clinical, pathological, and treatment-related factors influencing both relapse-free survival and overall survival outcomes. The performance of the Log-Logistic AFT model for overall survival and the Weibull AFT model for relapse-free survival highlights the importance of selecting appropriate distributional assumptions when modeling survival data with substantial censoring. These findings contribute to the growing body of evidence supporting the utility of both parametric and non-parametric approaches in breast cancer prognosis, where traditional non-parametric methods may be inadequate due to high censoring rates exceeding 50% of the observations. Age at diagnosis and its complex relationship with survival outcomes The analysis revealed a contradictory relationship between age at diagnosis and survival outcomes, wherein younger patients demonstrated longer overall survival times yet experienced shorter relapse-free periods, as illustrated in Fig. 9 36 37 38 Fig. 9 Comparison of age at diagnosis between overall and relapse-free survival Menopausal status and hormonal influences on breast cancer prognosis The analysis of menopausal status revealed significant differences in survival outcomes between premenopausal and postmenopausal women, with premenopausal patients demonstrating superior overall survival of 226.58 months compared to 142.17 months in postmenopausal women, as shown in Fig. 10 39 40 39 Fig. 10 Comparison of menopausal State between overall and relapse-free survival Treatment modalities and their differential impact on survival outcomes The comprehensive analysis of treatment modalities revealed notable variations in survival outcomes and relapse-free periods, reflecting the development of breast cancer therapeutics and the importance of personalized treatment approaches based on tumor biology and patient characteristics as illustrated in Fig. 11 41 42 Fig. 11 Comparison of treatments between overall and relapse-free survival In contrast, hormone therapy exhibited superior efficacy in estrogen receptor-positive cancers, achieving median survival times of 135.05 months and significantly extended relapse-free periods of 232.46 months. These findings highlight the role of hormone receptor status in determining treatment selection and prognosis, as endocrine therapies effectively inhibit cancer growth in hormone-responsive tumors while maintaining favorable toxicity profiles compared to chemotherapy [ 43 44 45 46 Combination therapies have appeared as standard approaches for optimizing both systemic and local disease control, with multimodal treatment strategies addressing the complex nature of breast cancer progression. Chemo-hormone therapy combinations yielded median survival times of 104.98 months and relapse-free periods of 72.46 months, demonstrating efficacy in hormone receptor-positive cancers at high risk for recurrence [ 47 48 49 50 50 51 These treatment outcome variations emphasize the fundamental principle of personalized medicine in oncology, where therapeutic decisions must be tailored to individual patient profiles, tumor biology, and risk stratification to achieve optimal outcomes while minimizing treatment-related morbidity. Tumor staging and prognostic implications across disease stages The analysis of tumor staging illustrated in Fig. 12 52 53 Fig. 12 Comparison of tumor stages between overall and relapse-free survival Patients with T1 tumors demonstrated slightly reduced but still favorable outcomes, with overall survival of 211.49 months and relapse-free periods of 408.79 months, reflecting the continued benefit of early-stage disease detection and the effectiveness of standard therapeutic approaches including surgery, radiotherapy, and appropriate adjuvant therapies [ 52 54 Advanced-stage diseases demonstrated progressively worse outcomes, with T3 tumors exhibiting median survival times of 83.13 months and relapse-free periods of 64.64 months, while T4 tumors, representing the most advanced local disease with invasion of chest wall or skin structures, showed the poorest prognosis with overall survival of 46.38 months and relapse-free periods of only 15.32 months [ 52 53 55 The systematic deterioration in survival outcomes across advancing tumor stages underscores the critical importance of early detection programs, public health initiatives promoting breast cancer awareness, and the development of more effective therapeutic strategies for advanced-stage disease. These findings also highlight the importance of risk-stratified surveillance protocols and the potential benefits of neoadjuvant therapy approaches in downstaging advanced tumors, thereby enhancing surgical outcomes and long-term prognosis. Nottingham prognostic index and risk stratification The Nottingham Prognostic Index (NPI), illustrated in Fig. 13 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\leq$$\\end{document} 56 58 54 Fig. 13 Comparison of NPI between overall and relapse-free survival Patients in the moderate prognostic group (3.4 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$ < $$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\leq$$\\end{document} 54 57 The stratification provided by the NPI facilitates evidence-based clinical decision-making by identifying patients who may benefit from intensified treatment strategies versus those who can be managed effectively with less aggressive interventions. This risk-stratified approach not only optimizes resource allocation within healthcare systems but also enhances patient quality of life by minimizing unnecessary treatment burden in low-risk patients while ensuring appropriate therapeutic intensity for high-risk individuals. The continued relevance of the Nottingham Prognostic Index in contemporary breast cancer management reflects its robust prognostic capability and practical clinical utility across diverse patient populations and treatment eras. Bayesian belief network analysis and causal inference The implementation of a BBN using YAN learning methodology with \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$k$$\\end{document} The direct connection between relapse-free status and overall survival within the network structure emphasizes the fundamental relationship between disease-free intervals and long-term patient outcomes, supporting clinical strategies aimed at prolonging relapse-free periods through optimized adjuvant therapies and surveillance protocols. Tumor stage and size appeared as pivotal nodes influencing both survival and relapse-free outcomes, corroborating clinical evidence that advanced tumor characteristics correlate with poorer prognoses and highlighting the continued importance of early detection initiatives. The network’s ability to model treatment strategy effectiveness demonstrates the significance of personalized therapeutic approaches, with hormone therapy showing particular efficacy for estrogen receptor-positive tumors, chemotherapy remaining crucial for aggressive subtypes such as triple-negative breast cancer, and radiotherapy providing substantial benefits when integrated with other treatment modalities. The incorporation of pathological features, including the Nottingham Prognostic Index, lymph node involvement, and histological grade as critical network nodes, facilitates patient stratification into distinct prognostic categories, enabling evidence-based treatment selection and resource allocation. Patient demographic characteristics, including age at diagnosis and menopausal status, were identified as influential factors within the network structure, confirming their prognostic significance and supporting the development of age-appropriate treatment strategies. The inference analysis conducted with 100% probability of death revealed important conditional relationships, including an 88% probability of frequent relapse status, 70% probability of postmenopausal state, 77% probability of chemotherapy administration, and a 72% probability of having a neutral HER2 status. The tumor stage emerged as a critical determinant, with a 65% probability of having a T2 tumor stage, indicating that tumor size and progression significantly impact survival outcomes and necessitate early detection and intervention strategies. Histologic grade represented another important prognostic factor, with a 52% probability of having a grade 2 tumor, suggesting a moderate level of differentiation that influences treatment decisions and overall prognosis. The NPI with values above 3.68 places patients in the moderate to poor prognostic groups, which correspond to five-year survival rates ranging from 70% to 78% for moderate risk patients and declining to approximately 44–50% for poor risk categories. Overall, the inference analysis illustrated in Fig. 14 Fig. 14 Bayesian inference diagram The Bayesian network framework offers several advantages over traditional survival modeling approaches, including the elimination of proportional hazards assumptions, the ability to handle missing data through probabilistic imputation, and the provision of interpretable graphical representations of variable interactions that facilitate clinical understanding and decision-making. This study demonstrates the importance of integrating advanced ML methodologies with clinical domain knowledge to develop robust predictive models that enhance understanding of breast cancer survival dynamics while providing practical tools for personalized patient management and treatment optimization. Conclusion This research presents a comprehensive analysis of the multifaceted determinants influencing survival and relapse-free outcomes in breast cancer patients through the application of advanced parametric and non-parametric survival modeling techniques and BN analysis. The findings highlight the importance of integrating clinical, pathological, and treatment-related features in developing robust prognostic frameworks that can enhance individualized patient care and inform optimal therapeutic decision-making processes. The parametric survival analysis revealed that the WeibullFitter model demonstrated superior performance for overall survival prediction, while the LogNormalFitter model provided optimal fit for relapse-free survival assessment, as evidenced by their superior AIC values and validation through QQ plot diagnostics. These findings align with recent research demonstrating that parametric models offer distinct advantages over traditional approaches when dealing with substantial censoring proportions, providing enhanced predictive capabilities and more intuitive interpretation of underlying survival mechanisms. The identification of age at diagnosis and menopausal status as significant prognostic factors, wherein younger and premenopausal patients exhibited longer overall survival yet shorter relapse-free periods, reflects the complex interplay between patient demographics, tumor biology, and disease progression patterns that characterize breast cancer heterogeneity. The non-parametric AFT models further confirmed these findings, with the Log-Logistic AFT model providing optimal fit for overall survival data while the Weibull AFT model demonstrated superior performance for relapse-free survival prediction. Treatment modality analysis revealed variations in therapeutic efficacy, with radiotherapy alone achieving the longest survival and relapse-free periods, reflecting the critical importance of local disease control in early-stage breast cancer management. The demonstration that tumor size and staging represent critical determinants of prognosis, with early-stage tumors associated with significantly better outcomes, reinforces the fundamental importance of early detection initiatives and timely therapeutic intervention in improving patient outcomes. The validation of the NPI in effectively stratifying patients into distinct prognostic categories, with those in favorable risk groups experiencing substantially longer overall survival and relapse-free periods, confirms its continued utility as a robust tool for clinical decision-making in contemporary breast cancer management. The BBN constructed using the TAN learning methodology, coupled with \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$k$$\\end{document} These findings provide factual evidence for the multifactorial nature of breast cancer prognosis and emphasize the critical importance of personalized medicine approaches in optimizing patient outcomes through individualized risk assessment and treatment selection. The integration of parametric survival modeling with BN analysis establishes a robust analytical framework that extends beyond traditional prognostic methods by incorporating causal inference capabilities and probabilistic reasoning mechanisms. These methodological advances support the implementation of risk-adapted treatment strategies that consider individual patient characteristics, tumor biology, and treatment response patterns to maximize therapeutic efficacy while minimizing treatment-related morbidity. Limitations This study has several limitations that should be acknowledged. First, the analysis was based on a single, retrospective dataset (METABRIC), which may limit the generalizability of the findings to other populations or healthcare settings. The absence of external validation data constrains our ability to confirm model performance across independent cohorts. Second, while the BBN framework enables the exploration of conditional dependencies, the retrospective nature of the data precludes definitive causal inference. Additionally, although expert-informed validation was used to refine the network structure, the reliance on discretized input variables may result in some loss of information granularity. Lastly, while statistical assumptions and model diagnostics were checked, parametric model performance remains sensitive to distributional misspecification, which may not always be fully addressed in real-world data. Future work Future research should focus on expanding patient cohort diversity across different geographic regions and ethnic populations to enhance the generalizability of predictive models and ensure equitable healthcare delivery across diverse patient populations. The integration of comprehensive molecular profiling data, including multi-omics approaches that combine genomic, transcriptomic, proteomic, and metabolomic information, represents a critical advancement that could enhance the predictive power of survival models and enable more precise patient stratification. Additionally, the development of prognostic tools that integrate clinical and molecular data for accurate risk stratification, combined with the creation of dynamic prediction models that update survival predictions in real-time during treatment and follow-up periods, represents essential advancements that could revolutionize clinical decision-making processes. In parallel, the incorporation of artificial intelligence (AI) and machine learning–based survival models, such as Random Survival Forests (RSF), offers promising avenues for future methodological advancements. These models are capable of capturing complex nonlinear interactions and high-dimensional feature spaces that may be challenging to address using traditional parametric or Bayesian approaches. Comparing their predictive performance and interpretability against established frameworks such as parametric and AFT models will be essential for evaluating their clinical utility. Ultimately, the development of AI-driven clinical decision support systems, integrating real-time patient data, treatment response monitoring, and survival outcome predictions, could significantly enhance the implementation of precision medicine in routine oncology practice. When coupled with comprehensive training for healthcare professionals and the establishment of robust data infrastructure, these systems have the potential to transform breast cancer management paradigms. The continued evolution and validation of such technologies, supported by international collaboration and multicenter datasets, will play a critical role in advancing personalized, evidence-based, and timely interventions to improve survival outcomes across diverse healthcare settings and patient populations worldwide. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Mecit Can Emre Simsekler, Aamna Al Shehhi, Andrei Sleptchenko and Aydah AlAwadhi contributed equally to this work. Author contributions K.T. conducted the analysis, developed the methodology, and wrote the first draft of the manuscript. M.S. contributed to the methodology design, provided supervision, and reviewed and edited the manuscript. A.S. assisted in data interpretation, validation, and critically reviewed the manuscript. A.S. provided conceptual guidance, supervised the research, and contributed to the manuscript's revision. A.A. supported the research design, contributed to data validation, and validated the results from a physician's point of view. All authors participated in the finalization of the manuscript and approved its submission. Funding Khalifa University of Science & Technology supported this work. The funding body was not directly involved in the design, data collection, analysis, interpretation, or writing of the manuscript. Data availability The dataset analyzed during this study, the METABRIC cohort, is publicly available through https://www.cbioportal.org/study/summary?id=brca_metabric Declarations Ethics approval and consent to participate This study uses publicly available anonymized cervical cancer data, obtained from the Kaggle and collected by Professor Carlos Caldas from Cambridge Research Institute and Professor Sam Aparicio from the British Columbia Cancer Centre in Canada, and published on Nature Communications [ 32 Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Amato O Guarneri V Girardi F Epidemiology trends and progress in breast cancer survival: Earlier diagnosis, new therapeutics Curr. Opin. Oncol 2023 35 612 19 10.1097/CCO.0000000000000987 37681462 PMC10566595 Amato O, Guarneri V, Girardi F. Epidemiology trends and progress in breast cancer survival: Earlier diagnosis, new therapeutics. Curr Opin Oncol. 2023;35:612–19. 10.1097/CCO.0000000000000987. 37681462 10.1097/CCO.0000000000000991 PMC10566595 2. Surveillance E, Program ER. Cancer statistics for breast cancer. SEER Cancer Stat. Rev. 2024. 3. Wilson J Sule AA Disparity in early detection of breast cancer 2022 StatPearls Publishing 33231981 Wilson J, Sule AA. Disparity in early detection of breast cancer. Stat Pearls Publishing; 2022. 33231981 4. Fabiano V Mando P Rizzo M Breast cancer in young women presents with more aggressive pathologic characteristics: Retrospective analysis from an Argentine national database JCO Glob. Oncol 2020 6 639 46 10.1200/JGO.19.00228 32315233 PMC7193768 Fabiano V, Mando P, Rizzo M, et al. Breast cancer in young women presents with more aggressive pathologic characteristics: Retrospective analysis from an Argentine national database. JCO Glob Oncol. 2020;6:639–46. 32315233 10.1200/JGO.19.00228 PMC7193768 5. Seedhom AE Kamal N 442 N. Factors affecting survival of women diagnosed with breast cancer in el-minia governorate, Egypt Int. J. Prev. Med 2011 2 131 38 21811654 PMC3143525 Seedhom AE, Kamal N. 442 N. Factors affecting survival of women diagnosed with breast cancer in el-minia governorate, Egypt. Int J Prev Med. 2011;2:131–38. 21811654 PMC3143525 6. National Cancer Institute. Cancer stat facts: Female breast cancer. 2022. https://www.cancer.gov/ 7. Jagsir R Malignant tumors of the breast chap 2019 11th edn Philadelphia, PA Wolters Kluwer 1269 317 Jagsir R, et al. Malignant tumors of the breast. In: chap. 11th edn. Vol. 79. Philadelphia, PA: Wolters Kluwer; 2019. p. 1269–317. 8. Rai S Mishra P Ghoshal U Survival analysis: A primer for the clinician scientists Indian J Gastroenterol 2021 40 541 49 10.1007/s12664-021-01232-1 35006489 PMC8743691 Rai S, Mishra P, Ghoshal U. Survival analysis: A primer for the clinician scientists. Indian J Gastroenterol. 2021;40:541–49. 10.1007/s12664-021-01232-1. 35006489 10.1007/s12664-021-01232-1 PMC8743691 9. Lofterod T Exploring the effects of lifestyle on breast cancer risk, age at diagnosis, and survival: The ebba-life study Breast Cancer Res. Treat 2020 182 215 27 10.1007/s10549-020-05683-3 32436147 PMC7275030 Lofterod T, et al. Exploring the effects of lifestyle on breast cancer risk, age at diagnosis, and survival: The ebba-life study. Breast Cancer Res. Treat. 2020;182:215–27. 10.1007/s10549-020-05683-3. 32436147 10.1007/s10549-020-05679-2 PMC7275030 10. Bodai BI Tuso P Breast cancer survivorship: A comprehensive review of long-term medical issues and lifestyle recommendations Perm J 2015 19 48 79 10.7812/TPP/14-241 25902343 PMC4403581 Bodai BI, Tuso P. Breast cancer survivorship: A comprehensive review of long-term medical issues and lifestyle recommendations. Perm J. 2015;19:48–79. 10.7812/TPP/14-241. 25902343 10.7812/TPP/14-241 PMC4403581 11. Zhang Z Sinha S Maiti T Shipp E Bayesian variable selection in accelerated failure time models Stat. Med 2025 44 1123 45 10.1177/0962280215626947 28034170 Zhang Z, Sinha S, Maiti T, Shipp E. Bayesian variable selection in accelerated failure time models. Stat Med. 2025;44:1123–45. 10.1177/0962280215626947 28034170 12. Chekouo T Stingo F Guindani M Bayesian data integration for cancer prognosis Biostatistics 2019 20 567 89 Chekouo T, Stingo F, Guindani M. Bayesian data integration for cancer prognosis. Biostatistics. 2019;20:567–89. 13. Hosseini S Ayatollahi T Parametric survival models for breast cancer mortality prediction J researchmed Sci 2020 25 89 97 Hosseini S, Ayatollahi T. Parametric survival models for breast cancer mortality prediction. J Res Med Sci. 2020;25:89–97. 14. Sun R Song X Tree-based bayesian accelerated failure time cure model Bayesian Anal 2024 19 1 29 Sun R, Song X. Tree-based bayesian accelerated failure time cure model. Bayesian Anal. 2024;19:1–29. 15. Yoo C Oh S Combining structural equation models with bayesian networks Comput Stat 2013 28 1245 67 Yoo C, Oh S. Combining structural equation models with bayesian networks. Comput Stat. 2013;28:1245–67. 16. Kumar R Bayesian networks in healthcare decision-making Healthc. Inf Res 2024 30 156 72 Kumar R. Bayesian networks in healthcare decision-making. Healthc. Inf Res. 2024;30:156–72. 17. Buyrukoğlu G Survival analysis in breast cancer using ensemble learning peerj Comput Sci 2024 10 e2147 10.7717/peerj-cs.2147 39145224 PMC11323082 Buyrukoğlu G. Survival analysis in breast cancer using ensemble learning. Peer J Comput Sci. 2024;10:e2147. 39145224 10.7717/peerj-cs.2147 PMC11323082 18. Feleke B, Tesfaw L, Mitku A. Survival analysis of women breast cancer patients in northwest amhara, Ethiopia. Front Oncol. 2022;12:1041245. 10.3389/fonc.2022.1041245. 10.3389/fonc.2022.1041245 PMC9808778 36605442 19. Qian J Hall P Greenwood D Breast cancer survival analysis: Applying the generalized gamma distribution under different proportional hazards and accelerated failure time conditions Cancer Epidemiol 2012 36 e280 87 PMC3445281 23024854 Qian J, Hall P, Greenwood D. Breast cancer survival analysis: Applying the generalized gamma distribution under different proportional hazards and accelerated failure time conditions. Cancer Epidemiol. 2012;36:e280–87. PMC3445281 23024854 20. Birungi J Accelerated failure time models in survival analysis Stat Appl 2024 15 78 92 Birungi J. Accelerated failure time models in survival analysis. Stat Appl. 2024;15:78–92. 21. Iraji Z Koshki TJ Dolatkhah R Parametric survival model to identify the predictors of breast cancer mortality: An accelerated failure time approach J researchmed Sci 2020 25 89 97 10.4103/jrms.JRMS_743_19 PMC7306232 32582344 Iraji Z, Koshki TJ, Dolatkhah R. Parametric survival model to identify the predictors of breast cancer mortality: An accelerated failure time approach. J Res Med Sci. 2020;25:89–97. 10.4103/jrms.JRMS_743_19 PMC7306232 32582344 22. Meshkat M Baghestani AR Zayeri F Khayamzadeh M Akbari ME Survival rate and prognostic factors among Iranian breast cancer patients Iran. J. Public Heal 2020 49 341 50 PMC7231718 32461942 Meshkat M, Baghestani AR, Zayeri F, Khayamzadeh M, Akbari ME. Survival rate and prognostic factors among Iranian breast cancer patients. Iran J Public Heal. 2020;49:341–50. PMC7231718 32461942 23. Li X Zhang Y Wang H Molecular subtype and prognosis in de novo stage iv breast cancer: Analysis of seer data Breast Cancer Res. Treat 2021 189 267 79 Li X, Zhang Y, Wang H. Molecular subtype and prognosis in de novo stage iv breast cancer: Analysis of seer data. Breast Cancer Res. Treat. 2021;189:267–79. 24. Chen Y Lin T Huang J Validation of a breast cancer survival prediction model with seer database J. Integr. Oncol 2016 5 1000174 10.4172/2329-6771.1000174 Chen Y, Lin T, Huang J. Validation of a breast cancer survival prediction model with seer database. J Integr Oncol. 2016;5:1000174. 10.4172/2329-6771.1000174. 25. Limenih M Mekonnen E Birhanu F Survival patterns among patients with breast cancer in sub-saharan africa: A systematic review and meta-analysis JAMA Netw Open 2024 7 e2410260 10.1001/jamanetworkopen.2024.10260 38743426 PMC11094564 Limenih M, Mekonnen E, Birhanu F, et al. Survival patterns among patients with breast cancer in sub-saharan africa: a systematic review and meta-analysis. JAMA Netw Open. 2024;7:e2410260. 10.1001/jamanetworkopen.2024.10260. 38743426 10.1001/jamanetworkopen.2024.10260 PMC11094564 26. Lin R, Lin C, Chuang C, Kujabi B, Chen Y. Breast cancer survival analysis model. Appl Sci. 2022;12(1971). 10.3390/app12041971. 27. Gönen O Rubin D Can a bayesian belief network estimate 1-year survival in patients with primary bone sarcoma? Clin. Orthop. Relat. Res 2017 475 255 62 10.1007/s11999-017-5346-1 PMC5406365 28397168 Gönen O, Rubin D. Can a bayesian belief network estimate 1-year survival in patients with primary bone sarcoma? Clin Orthop Relat Res. 2017;475:255–62. 10.1007/s11999-017-5346-1 PMC5406365 28397168 28. Poon C Lee H Chan J Bayesian network–based survival prediction model for patients undergoing tips for portal hypertension J. Clin. Inf 2024 9 45 56 Poon C, Lee H, Chan J. Bayesian network–based survival prediction model for patients undergoing tips for portal hypertension. J Clin Inf. 2024;9:45–56. 29. Siddiqui O Lee M Chang K External validation of a bayesian belief network for survival prediction in extremity metastases: Pathfx in an Asian cohort Acta Orthop 2022 93 687 94 10.2340/17453674.2022.4545 PMC9463636 36083697 Siddiqui O, Lee M, Chang K. External validation of a bayesian belief network for survival prediction in extremity metastases: Pathfx in an Asian cohort. Acta Orthop. 2022;93:687–94. 10.2340/17453674.2022.4545. 10.2340/17453674.2022.4545 PMC9463636 36083697 30. Pereira B, Chin SF, Rueda O, et al. Breast cancer gene expression profiles METABRIC. 2016. https://www.kaggle.com/datasets/raghadalharbi/breast-cancer-gene-expression-profiles-metabric 31. Curtis C The genomic and transcriptomic architecture of 2,000 breast tumours reveals novel subgroups Nature 2012 486 346 52 10.1038/nature10983 22522925 PMC3440846 Curtis C, et al. The genomic and transcriptomic architecture of 2,000 breast tumours reveals novel subgroups. Nature. 2012;486:346–52. 10.1038/nature10983. 22522925 10.1038/nature10983 PMC3440846 32. Pereira B The somatic mutation profiles of 2,433 breast cancers refines their genomic and transcriptomic landscapes Nat Commun 2016 7 11479 10.1038/ncomms11479 27161491 PMC4866047 Pereira B, et al. The somatic mutation profiles of 2,433 breast cancers refines their genomic and transcriptomic landscapes. Nat Commun. 2016;7:11479. 10.1038/ncomms11479. 27161491 10.1038/ncomms11479 PMC4866047 33. van Buuren S Groothuis-Oudshoorn K Mice: Multivariate imputation by chained equations in r J Stat Softw 2011 45 1 67 van Buuren S, Groothuis-Oudshoorn K. Mice: Multivariate imputation by chained equations in r. J Stat Softw. 2011;45:1–67. 34. Schumacher M Binder H Using cross-validation to evaluate predictive accuracy of survival models Stat. Med 2011 30 2571 89 Schumacher M, Binder H. Using cross-validation to evaluate predictive accuracy of survival models. Stat. Med. 2011;30:2571–89. 35. Eurachem Workshop Participants. Statistical methods to estimate the assigned value in presence of multiple censored data. Presentation at Eurachem Workshop, Portorož, 12 October 2017 (2017) Kaplan–Meier method recommended for data sets with less than 50% censoring. 36. Fernandes G, O. Differences in breast cancer survival and stage by age in off-target population for screening mammography. Am J Obstet Gynecol Glob Rep. 2023;3:100174. 10.1016/j.xagr.2023.100208 PMC10193116 37213794 37. Johnson RH Chien FL Bleyer A Breast cancer before age 40 years Semin Oncol 2013 40 311 25 10.1053/j.seminoncol.2009.03.001 PMC2894028 19460581 Johnson RH, Chien FL, Bleyer A. Breast cancer before age 40 years. Semin Oncol. 2013;40:311–25. 10.1053/j.seminoncol.2009.03.001 PMC2894028 19460581 38. Anders CK Young age at diagnosis correlates with worse prognosis and defines a subset of breast cancers with shared patterns of gene expression J Clin Oncol 2008 26 3324 30 10.1200/JCO.2007.14.2471 18612148 Anders CK, et al. Young age at diagnosis correlates with worse prognosis and defines a subset of breast cancers with shared patterns of gene expression. J Clin Oncol. 2008;26:3324–30. 18612148 10.1200/JCO.2007.14.2471 39. Surakasula A Nagarjunapu GC Raghavaiah KV A comparative study of pre- and post-menopausal breast cancer: Risk factors, presentation, characteristics and management J. Res. Pharm. Pract 2014 3 12 18 10.4103/2279-042X.132704 24991630 PMC4078652 Surakasula A, Nagarjunapu GC, Raghavaiah KV. A comparative study of pre- and post-menopausal breast cancer: Risk factors, presentation, characteristics and management. J. Res. Pharm. Pract. 2014;3:12–18. 10.4103/2279-042X.132704. 24991630 10.4103/2279-042X.132704 PMC4078652 40. Yoon TI, Jeong J, Lee S, et al. Survival outcomes in premenopausal patients with invasive lobular carcinoma. JAMA Netw. Open. 2023;6:e2342270. 10.1001/jamanetworkopen.2023.42270. 10.1001/jamanetworkopen.2023.42270 PMC10632960 37938845 41. Wahba HA El-Hadaad HA Current approaches in treatment of triple-negative breast cancer Cancer Biol. & Med 2015 12 106 16 10.7497/j.issn.2095-3941.2015.0030 26175926 PMC4493381 Wahba HA, El-Hadaad HA. Current approaches in treatment of triple-negative breast cancer. Cancer Biol. & Med. 2015;12:106–16. 10.7497/j.issn.2095-3941.2015.0030. 26175926 10.7497/j.issn.2095-3941.2015.0030 PMC4493381 42. Cortazar P Pathological complete response and long-term clinical benefit in breast cancer: The ctneobc pooled analysis Lancet 2014 384 164 72 10.1016/S0140-6736(13)62422-8 24529560 Cortazar P, et al. Pathological complete response and long-term clinical benefit in breast cancer: The ctneobc pooled analysis. Lancet. 2014;384:164–72. 24529560 10.1016/S0140-6736(13)62422-8 43. Rauh C Hormone therapy and its effect on the prognosis in breast cancer patients Geburtshilfe FrauenheilkD 2015 75 588 96 10.1055/s-0035-1546149 26166840 PMC4490917 Rauh C, et al. Hormone therapy and its effect on the prognosis in breast cancer patients. Geburtshilfe Frauenheilkd. 2015;75:588–96. 10.1055/s-0035-1546149. 26166840 10.1055/s-0035-1546149 PMC4490917 44. Early Breast Cancer Trialists’ Collaborative Group Aromatase inhibitors versus tamoxifen in early breast cancer: Patient-level meta-analysis of the randomised trials Lancet 2015 386 1341 52 10.1016/S0140-6736(15)61074-1 26211827 Early Breast Cancer Trialists’ Collaborative Group. Aromatase inhibitors versus tamoxifen in early breast cancer: Patient-level meta-analysis of the randomised trials. Lancet. 2015;386:1341–52. 26211827 10.1016/S0140-6736(15)61074-1 45. Rutqvist LE Rose C Cavallin-Ståhl E A systematic overview of radiation therapy effects in breast cancer Acta Oncol 2003 42 532 45 10.1080/02841860310014444 14596511 Rutqvist LE, Rose C, Cavallin-Ståhl E. A systematic overview of radiation therapy effects in breast cancer. Acta Oncol. 2003;42:532–45. 10.1080/02841860310014444. 14596511 10.1080/02841860310014444 46. Early Breast Cancer Trialists’ Collaborative Group Effect of radiotherapy after breast-conserving surgery on 10-year recurrence and 15-year breast cancer death: Meta-analysis of individual patient data for 10 801 women in 17 randomised trials Lancet 2011 378 1707 16 10.1016/S0140-6736(11)61629-2 22019144 PMC3254252 Early Breast Cancer Trialists’ Collaborative Group. Effect of radiotherapy after breast-conserving surgery on 10-year recurrence and 15-year breast cancer death: Meta-analysis of individual patient data for 10 801 women in 17 randomised trials. Lancet. 2011;378:1707–16. 22019144 10.1016/S0140-6736(11)61629-2 PMC3254252 47. Wang Y Minden A Current molecular combination therapies used for the treatment of breast cancer Int J Mol Sci 2022 23 521 11046 10.3390/ijms231911046 36232349 PMC9569555 Wang Y, Minden A. Current molecular combination therapies used for the treatment of breast cancer. Int J Mol Sci. 2022;23:521 11046. 10.3390/ijms231911046. 36232349 10.3390/ijms231911046 PMC9569555 48. Jhawar SR Adjuvant radiation therapy alone is associated with improved overall survival compared to hormonal therapy alone in older women with estrogen receptor positive early stage breast cancer Cancer Med 2020 9 8345 54 10.1002/cam4.3443 32942344 PMC7666745 Jhawar SR, et al. Adjuvant radiation therapy alone is associated with improved overall survival compared to hormonal therapy alone in older women with estrogen receptor positive early stage breast cancer. Cancer Med. 2020;9:8345–54. 10.1002/cam4.3443. 32942344 10.1002/cam4.3443 PMC7666745 49. Fisusi FA, Akala EO. Drug combinations in breast cancer therapy. Pharm nanotechnol. 2019;7:3–23. 10.2174/2211738507666190122111224. 10.2174/2211738507666190122111224 PMC6691849 30666921 50. Moo TA Sanford R Dang C Morrow M Overview of breast cancer therapy PET Clin 2018 13 339 54 10.1016/j.cpet.2018.02.006 30100074 PMC6092031 Moo TA, Sanford R, Dang C, Morrow M. Overview of breast cancer therapy. PET Clin. 2018;13:339–54. 10.1016/j.cpet.2018.02.006. 30100074 10.1016/j.cpet.2018.02.006 PMC6092031 51. Hortobagyi GN Multimodal treatment of locoregionally advanced breast cancer Cancer 1984 51 763 68 10.1002/1097-0142(19830301)51:5&#x0003c;763::AID-CNCR2820510502&#x0003e;3.0.CO;2-C 6687377 Hortobagyi GN, et al. Multimodal treatment of locoregionally advanced breast cancer. Cancer. 1984;51:763–68. 10.1002/1097-0142(19830301)51:5<763::aid-cncr2820510502>3.0.co;2-c 6687377 52. Liu Y Tumor size still impacts prognosis in breast cancer with extensive nodal involvement Front Oncol 2021 11 585613 10.3389/fonc.2021.585613 33898305 PMC8064390 Liu Y, et al. Tumor size still impacts prognosis in breast cancer with extensive nodal involvement. Front Oncol. 2021;11:585613. 10.3389/fonc.2021.585613. 33898305 10.3389/fonc.2021.585613 PMC8064390 53. Gómez-Acebo I Tumour characteristics and survivorship in a cohort of breast cancer: The mcc-spain study Breast Cancer Res. Treat 2020 181 667 78 10.1007/s10549-020-05600-x 32356254 PMC7220874 Gómez-Acebo I, et al. Tumour characteristics and survivorship in a cohort of breast cancer: The mcc-spain study. Breast Cancer Res. Treat. 2020;181:667–78. 10.1007/s10549-020-05600-x. 32356254 10.1007/s10549-020-05600-x PMC7220874 54. Galea M Blamey R Elston C Ellis I The nottingham prognostic index in primary breast cancer Breast Cancer Res. Treat 1992 22 207 19 10.1007/BF01840834 1391987 Galea M, Blamey R, Elston C, Ellis I. The nottingham prognostic index in primary breast cancer. Breast Cancer Res. Treat. 1992;22:207–19. 1391987 10.1007/BF01840834 55. Soerjomataram I Louwman MW Ribot JG Roukema JA Coebergh JWW Tumour characteristics and survivorship in a cohort of breast cancer patients: Analysis from European cancer registries Eur J Cancer 2020 46 1011 20 Soerjomataram I, Louwman MW, Ribot JG, Roukema JA, Coebergh JWW. Tumour characteristics and survivorship in a cohort of breast cancer patients: Analysis from European cancer registries. Eur J Cancer. 2020;46:1011–20. 56. Pradhan A Paudyal P Sinha A Agrawal C Grading, staging and nottingham prognostic index scoring of breast carcinoma J. Pathol. Nepal 2017 7 1078 83 10.3126/jpn.v7i1.16951 Pradhan A, Paudyal P, Sinha A, Agrawal C. Grading, staging and nottingham prognostic index scoring of breast carcinoma. J Pathol Nepal. 2017;7:1078–83. 10.3126/jpn.v7i1.16951. 57. Zhou L Rueda M Alkhateeb A Classification of breast cancer nottingham prognostic index using high-dimensional embedding and residual neural network Cancers (basel) 2022 14 934 10.3390/cancers14040934 35205681 PMC8870306 Zhou L, Rueda M, Alkhateeb A. Classification of breast cancer nottingham prognostic index using high-dimensional embedding and residual neural network. Cancers (basel). 2022;14:934. 10.3390/cancers14040934. 35205681 10.3390/cancers14040934 PMC8870306 58. Kerin E, et al. Comparison of the nottingham prognostic index and oncotypedx © recurrence score in predicting outcome in estrogen receptor positive breast cancer. Breast. 2022;66:227–35. 10.1016/j.breast.2022.11.001. 10.1016/j.breast.2022.11.001 PMC9647009 36335747 ",
  "metadata": {
    "Title of this paper": "Classification of breast cancer nottingham prognostic index using high-dimensional embedding and residual neural network",
    "Journal it was published in:": "BMC Medical Informatics and Decision Making",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482897/"
  }
}