{
  "title": "Paper_324",
  "abstract": "pmc Inflamm Regen Inflamm Regen 3363 infregen Inflammation and Regeneration 1880-9693 1880-8190 BMC PMC12486510 PMC12486510.1 12486510 12486510 41029827 10.1186/s41232-025-00393-2 393 1 Review The roles of tertiary lymphoid structures in orchestrating immune responses in peripheral organs http://orcid.org/0000-0003-0070-2291 Taniguchi Keisuke 1 http://orcid.org/0000-0003-3426-5982 Yoshikawa Takahisa 1 http://orcid.org/0000-0002-0339-9008 Yanagita Motoko motoy@kuhp.kyoto-u.ac.jp 1 2 1 https://ror.org/02kpeqv85 grid.258799.8 0000 0004 0372 2033 Department of Nephrology, Graduate School of Medicine, Kyoto University, 2 https://ror.org/02kpeqv85 grid.258799.8 0000 0004 0372 2033 Institute for the Advanced Study of Human Biology (ASHBi), Kyoto University, 30 9 2025 2025 45 479643 28 4 4 2025 12 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Tertiary lymphoid structures (TLSs) are ectopic lymphoid aggregates that develop in non-lymphoid organs under pathological conditions of chronic inflammation, such as cancer, autoimmune diseases, chronic infections, organ transplantation, and age-related disorders. TLSs produce various cytokines and chemokines, and orchestrate local adaptive immune responses by serving as sites for antigen presentation. TLSs have attracted significant attention because of their multifaceted roles in various diseases. However, the diversity in cellular composition, development, and maturation of TLSs, depending on the disease context and organ, makes it challenging to fully understand their characteristics. Several basic and clinical studies have demonstrated the clinical and pathophysiological roles of TLSs, revealing both their protective and harmful effects. In cancer, TLSs generally activate anticancer immune responses, leading to the suppression of tumor growth. Additionally, they contribute to host defense against pathogens in infectious diseases. Conversely, they can provide a niche for autoantibody production, exacerbating autoimmune diseases and chronic rejection in transplanted organs. In age-related diseases, they may prolong tissue inflammation and hinder tissue repair. The pathophysiological significance of TLSs has prompted the development of therapeutic strategies that target their formation and maturation. However, their potential systemic immunological effects must be carefully considered. Recent advances in single-cell omics technologies have facilitated a deeper understanding of the diverse cellular components of TLSs and their cell–cell interactions, which may contribute to the development of TLS-specific therapies. The fact that TLSs can only be identified using invasive diagnostic methods remains a barrier to further research. Advances in artificial intelligence-driven pathology diagnostics and improvements in imaging technologies for noninvasive detection are expected to accelerate TLS research. Categorizing various conditions with TLSs as 'TLS-related diseases' could deepen our understanding of TLS pathophysiology and lead to the development of novel therapeutic strategies. Keywords Tertiary lymphoid structures Chronic inflammation Inflammaging Autoimmune diseases Cancer immunotherapy http://dx.doi.org/10.13039/501100000646 Japan Society for the Promotion of Science London JP24K23310 24K19147 23H02925 23K18288 Taniguchi Keisuke Yoshikawa Takahisa Yanagita Motoko pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Japanese Society of Inflammation and Regeneration 2025 Introduction In a typical immune response to pathogens, local innate immune cells attempt to control them. Simultaneously, antigen-presenting cells prime lymphocytes in secondary lymphoid organs (SLOs), initiating adaptive immune responses including germinal center (GC) reactions, somatic hypermutation, and class switch recombination [ 1 2 2 4 5 10 Various basic and clinical studies have demonstrated the clinical and pathophysiological significance of TLSs, revealing their dual roles as either beneficial or detrimental depending on the disease and organ context. These studies have also explored therapeutic strategies aimed at either TLS resolution or induction as well as their potential utility as prognostic indicators. Among them, TLSs have been identified in multiple organs of aged individuals, suggesting their potential association with age-related alterations in the immune system, termed “immunosenescence” [ 11 14 6 7 15 16 This review provides insights into the cellular composition and developmental mechanisms of TLSs and discusses their pathological roles, clinical significance, and potential therapeutic implications in various diseases. Furthermore, we introduce the novel concept of\"TLS-related diseases\"and offer insights into prospective directions for TLS research. Development and maturation of TLSs TLSs consist of T, B, and dendritic cells, fibroblasts, lymphatic vessels, and blood vessels, including high endothelial venules (HEVs), resembling SLOs, such as the spleen, lymph nodes, Peyer's patches, and tonsils, in development, components, and structures (Fig. 1 17 18 19 20 22 Fig. 1 Tertiary lymphoid structures in aged injured murine kidneys revealed by staining with Periodic acid Schiff and immunofluorescence. Histological analysis of 12-month-old murine kidneys 45 days after 30 min of ischemic reperfusion injury by staining with Periodic acid Schiff (left) and immunofluorescence of B220 (green) and CD3ε (red). TLSs are comprised of T and B cells, and develop mainly around the arteries in the kidney. Scale bar = 100 µm However, the precise mechanisms underlying TLS initiation and maturation remain unclear. Generally, in chronic inflammation, immune and parenchymal cells, such as epithelial or endothelial cells, activate tissue-resident fibroblasts by producing pro-inflammatory cytokines, such as interleukin (IL)−13, IL-17, and IL-22 [ 18 23 25 24 17 6 11 26 11 20 27 27 Depending on the pathological context, TLSs can range from small aggregates of T and B cells to highly organized structures resembling SLOs. This variability leads to inconsistencies in the definition of TLSs and hinders our understanding of their roles, particularly in clinical settings. To address this hurdle, we qualitatively evaluated TLSs by staging them as follows: Stage I, unorganized aggregates composed of proliferating T and B cells; Stage II for those with FDCs but without GCs; and Stage III for those with GCs [ 16 2 16 16 28 29 31 29 Fig. 2 TLS components and staging. Schema of TLS staging. TLSs consist of T, B, and dendritic cells, fibroblasts, blood vessels, and lymphatic vessels. They progress from Stage I to Stage III. Stage I is characterized by unorganized aggregates of proliferating T and B cells. Stage II is defined by the presence of FDCs and B cell zones, but not germinal centers (GCs). Stage III is distinguished by the presence of FDCs and GCs. (Created in BioRender. https://BioRender.com/l28x219 Pathophysiological significance of TLSs TLSs are observed in various diseases and pathological conditions, including cancers, autoimmune diseases, allograft rejection, infections, and aging [ 2 3 26 32 1 Table 1 Context-dependent roles of TLSs across major pathological settings Pathological context Predominant function* Representative pathological mechanisms Prognostic impact Therapeutic implication(s) Context-specific exceptions Cancer Protective Effector cell activation and Anti-tumor antibody production [ 40 43 Larger or mature TLSs is associated with longer overall, progression-free survival and better ICI response [ 29 31 33 37 40 TLS induction by recombinant CXCL13/CCL21, LTβR agonists, LIGHT agonists, STING agonists, cancer vaccines, and ICIs etc. [ 35 44 45 47 49 51 55 Poor prognosis in HCC, RCC, and irAE-associated TLSs (38.39,56) Infection Protective Effector cell activation and Pathogen-specific antibody production [ 64 68 The presence of TLS is associated with better prognosis and effective viral clearance [ 64 68 70 72 74 76 77 TLS induction by live pathogens or vaccines [ 79 81 The association between TLSs and fibrosis in SARS-CoV-2 and HCV [ 12 82 83 Autoimmune diseases Pathogenic Autoantibody production [ 84 85 91 The increase of TLS burden is associated with increased relapse rate and organ damage [ 84 85 87 95 TLS depletion by BAFF/APRIL blockade or anti-CXCL13 mAbs [ 97 101 Certain allergy models show tolerogenic TLSs [ 96 Age-related disorders Pathogenic Excess local cytokine production (e.g. IFN-γ, TNF-α) [ 6 The presence of TLS is associated with worse organ function [ 13 16 TLS depletion by dexamethasone, anti-CD4 mAbs, or CD153–CD30 axis blockade [ 7 11 16 N/A Transplantation Pathogenic OR Protective ･Donor-specific antibody production [ 122 126 OR ･Niche for Treg or IL-10⁺ B regs [ 129 134 Mature TLSs is associated with antibody-mediated rejection, poor graft survival [ 28 123 126 OR The presence of TLSs is associated with better graft survival [ 129 134 TLS depletion by LTβR blockade or anti-CXCR3/CCL21 mAbs [ 124 126 127 OR N/A N/A Protective, Pathogenic, TLSs, ICIs, HCC, RCC, irAE, Treg, Breg, HCV, CXCL13, CCL21, CXCR3, LTβR, mAbs, N/A, Cancers The presence of TLSs, especially mature TLSs [ 29 33 34 35 36 37 3 38 39 In recent years, the association between the efficacy of immune checkpoint inhibitors (ICIs), such as therapies targeting programmed cell death protein 1 (PD-1) and cytotoxic T-lymphocyte-associated protein 4 (CTLA-4), and the presence or localization of TLSs has garnered increasing attention in cancer treatment. ICIs alleviate immunosuppression in the tumor microenvironment and promote TLS formation [ 3 29 activation-induced cytidine deaminase A AICDA B cell lymphoma 6 BCL6 40 40 40 40 43 Consequently, there is growing attention concerning the induction of TLSs as a potential therapeutic strategy for cancer immunotherapy. Animal experiments have demonstrated that local administration of TLS-related cytokines and chemokines can induce TLSs and improve the prognosis in cancer models. For instance, in ovarian cancer, CXCL13 expression correlates with the presence of TLSs and favorable prognosis. In murine models of ovarian cancer, the exogenous administration of recombinant CXCL13 induced peritumoral TLSs, increased CD8 + 35 44 + + 45 46 47 49 50 Tnfsf15 Cxcl10 51 52 55 56 57 59 47 51 60 61 Infection One of the most important defense systems against infections is the adaptive immune response. The primary site is SLOs. However, accumulating evidence has demonstrated that TLSs also play a significant role in the defense against infection [ 62 63 Mycobacterium tuberculosis + 64 67 64 65 68 63 69 5 Il1r1 Il1r1 70 71 74 71 72 73 Il17a Il17f 75 76 77 16 78 Additionally, vaccines targeting pathogens can induce TLSs. For example, administration of Bacillus Calmette–Guérin followed by oral exposure to nontuberculous mycobacteria in mice promoted TLS formation in the lungs, leading to enhanced long-term resistance to Mtb [ 79 M. avium subspecies paratuberculosis + + 80 81 63 Conversely, in severe acute respiratory syndrome-coronavirus-2 (SARS-CoV-2) infection, TLSs may contribute to the persistence of inflammation and fibrosis, leading to long COVID syndrome, which is characterized by symptoms that include shortness of breath and fatigue. Spatial analysis of COVID-19 donor lungs using multiple modalities showed that SARS-CoV-2 infection enhanced CCL21 expression in activated endothelial cells within the adventitial niche surrounding medium-to-large blood vessels and airways, recruiting CCR7 + + + 82 83 12 Autoimmune and allergic diseases TLSs have been identified in a wide range of autoimmune diseases including rheumatoid arthritis [ 84 85 86 87 88 89 84 85 lpr/lpr 90 91 + + + + 92 87 TLSs also form in allergic diseases, such as allergic conjunctivitis and chronic sinusitis. Analysis of severe allergic conjunctivitis revealed that IL-33 produced by epithelial cells in response to allergen stimulation stimulated ST2 high 93 94 95 96 + TLSs are generally considered pathogenic in autoimmune diseases and are potential therapeutic targets. Therapeutic interventions targeting the factors critical for the formation and maturation of TLSs have also been investigated. For example, CXCL13 neutralizing antibodies suppressed symptoms and TLS formation in a collagen-induced arthritis model [ 97 lpr/lpr 98 99 100 ⁻/⁻ lpr/lpr 101 101 102 103 104 105 106 7 26 Aging-dependent chronic inflammation Age-related changes in the immune system are referred to as “immunosenescence” [ 107 107 108 107 109 107 NLRC4 NLRC5 IL-1B 110 110 111 112 113 114 Unsurprisingly, TLSs have been observed in individuals with immunosenescence because both conditions are closely associated with chronic inflammation [ 107 16 12 13 14 6 13 115 11 16 116 16 56 56 116 Some reports on age-related TLSs have indicated their pathogenic potential. However, research on interventions targeting them remains limited. Previously we have reported that the administration of steroids and anti-CD4 antibodies in models of kidney injury in aged mice resulted in a reduction in TLS size and tissue damage, suggesting that TLSs in aging-related diseases might be potential therapeutic targets [ 11 16 + Tnfsf8 + Tnfrsf8 + 7 117 high − + 118 119 120 121 Transplanted organs In organ transplantation, advances in immunosuppressive therapy have significantly reduced the incidence of acute rejection and greatly extended the survival of transplanted organs. However, the incidence of chronic rejection has not changed considerably, which may be partially attributed to TLSs [ 32 122 123 124 125 126 28 28 124 126 127 128 128 Conversely, regulatory tertiary lymphoid organs (rTLOs) reportedly exert organ-protective functions in transplanted organs [ 32 122 129 130 + 131 132 133 133 133 134 Conclusions and future prospectives TLSs are formed in various diseases involving chronic inflammation and have been reported to play context-dependent roles as immune response hubs in peripheral tissues. However, the clinical relevance of the TLSs remains unclear. Currently, TLSs diagnosis relies on detailed pathological examination of tissue samples, making it challenging. Recent advancements in artificial intelligence for pathological and imaging diagnoses may help address some of these limitations. An artificial intelligence based quantitative TLS scoring system in hematoxylin–eosin-stained images of multiple gastrointestinal cancers found that TLS scores were an independent prognostic factor related to survival [ 135 136 137 138 Moreover, it is important to develop novel biomarkers. CXCL13 in serum is one of the candidates with reports of correlation with prognosis and activity in autoimmune diseases, but there is still no consensus regarding its association with TLSs [ 139 141 118 119 121 142 143 Various studies have developed therapies targeting specific pathways or cells associated with TLSs. However, as the cellular components and structures of TLSs are similar to those of SLOs, treatments targeting TLSs may have broad effects on the systemic immune system. Recent advancements in single-cell omics technologies have allowed the simultaneous consideration of interactions among many cells and molecular mechanisms [ 5 144 The increasing number of publications focused on TLSs underscores the growing scientific interest in their biological significance and clinical relevance. While TLSs have been associated with a broad range of disorders, most studies have investigated their roles and mechanisms within specific contexts. Considering that TLSs universally function as local immune hubs in chronically inflamed peripheral tissues, we propose the overarching concept of\"TLS-related diseases.\"This concept is defined as conditions wherein the formation of TLSs in affected tissues contributes to disease pathogenesis. A disease is classified as a TLS-related disease when the following two criteria are met: (i) Histological evidence of TLSs—well-organized lymphoid aggregates are visible on hematoxylin–eosin sections, and/or proliferating T- and B-cell clusters are confirmed by immunostaining; (ii) Clinical association—the presence, size, or maturity of TLSs shows an association with disease severity or patient outcome, indicating their roles in pathogenesis. By adopting this framework, diagnostic and therapeutic insights that originally developed in a single disease context may be readily transferred across diverse TLS-related diseases (Fig. 3  Fig. 3 Overview of TLS-related diseases and potential clinical applications. TLSs have been implicated in a wide range of diseases, including cancer, autoimmune diseases, chronic infections, transplanted organs, and age-related disorders. Recognizing these conditions as “TLS-related diseases” based on shared pathophysiological features may facilitate the identification of novel therapeutic targets and clinical applications. The key areas of TLS-related research include (1) discovery of TLS-associated biomarkers, (2) development of artificial intelligence based diagnostic technologies and other noninvasive imaging tools to identify TLSs, (3) potential of TLSs as prognostic indicators, and (4) exploration of TLS-specific molecular pathways for novel therapeutic interventions. Collectively, these efforts aim to establish TLSs as viable therapeutic targets and to improve clinical outcomes in patients with TLS-related diseases. (Created in BioRender. https://BioRender.com/u99k843 Abbreviations ABCs Age-associated B cells AICDA Activation-induced cytidine deaminase A APRIL A proliferation-inducing ligand BAFF B cell-activating factor BCL6 B cell lymphoma 6 CCL19 -C motif chemokine ligand 19 CKD Chronic kidney disease COPD Chronic obstructive pulmonary disease CTLA-4 Cytotoxic T-lymphocyte-associated protein 4 CXCL13 Chemokine (C-X-C motif) ligand 13 DAMPs Damage-associated molecular patterns EOMES Eomesodermin FDCs Follicular dendritic cells GC Germinal center GM-CSF Granulocyte-macrophage colony-stimulating factor GVAX GM-CSF-secreting whole-cell cancer vaccine HEVs High endothelial venules iBALT Induced bronchus-associated lymphoid tissue ICAM-1 Intercellular adhesion molecule-1 ICIs Immune checkpoint inhibitors IFN-γ Interferon-gamma IL Interleukin irAEs Immune-related adverse events LT Lymphotoxin LTβR Lymphotoxin-β receptor LTi Lymphoid tissue inducer cells LTo Lymphoid tissue organizer cells MAdCAM-1 Mucosal vascular addressin cell adhesion molecule 1 Mtb Mycobacterium tuberculosis PD-1 Programmed cell death protein 1 rTLOs Regulatory tertiary lymphoid organs SARS-CoV-2 Severe acute respiratory syndrome-coronavirus-2 SATs Senescence-associated T cells SLE Systemic lupus erythematosus SELENA-SLEDAI Safety of Oestrogens in Lupus Erythematosus National Assessment-SLE Disease Activity Index SLOs Secondary lymphoid organs STAT1 Signal transducer and activator of transcription 1 Tfh Follicular helper T cells TLSs Tertiary lymphoid structures TNFR1 Tumor necrosis factor receptor 1 Tph Peripheral helper T cells VCAM-1 Vascular cell adhesion molecule 1 Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We thank the Single-Cell Genome Information Analysis Core (SignAC) at WPI-ASHBi, Kyoto University for their support. This work was partially supported by the World Premier International Research Center Initiative (WPI), MEXT, Japan. Authors’ contributions KT designed the concept of this article and wrote the manuscript. TY and MY supervised this work. All the authors contributed to the discussion and approved the final version of the manuscript. Funding This work was financially supported by research grants from the Japan Society for the Promotion of Science (JSPS) KAKENHI (JP24K23310 to K.T. and  24K19147 to T.Y. and 23H02925, 23K18288 to M.Y.), Japan Agency for Medical Research and Development (AMED) ( to M.T.), and Japan Agency for Medical Research and Development–Core Research for Evolutional Science and Technology (AMED - CREST) (24gm1210009h0006 to M.Y.) and Leading Advanced Projects for medical innovation(AMED - LEAP)( 24gm0010011h0001 to M.Y.) Data availability Not applicable. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare that they have no competing interests. References 1. Lam N Lee Y Farber DL A guide to adaptive immune memory Nat Rev Immunol 2024 24 11 810 829 10.1038/s41577-024-01040-6 38831162 Lam N, Lee Y, Farber DL. A guide to adaptive immune memory. Nat Rev Immunol. 2024;24(11):810–29. 38831162 10.1038/s41577-024-01040-6 2. Sato Y Silina K van den Broek M Hirahara K Yanagita M The roles of tertiary lymphoid structures in chronic diseases Nat Rev Nephrol 2023 19 8 525 537 10.1038/s41581-023-00706-z 37046081 PMC10092939 Sato Y, Silina K, van den Broek M, Hirahara K, Yanagita M. The roles of tertiary lymphoid structures in chronic diseases. Nat Rev Nephrol. 2023;19(8):525–37. 37046081 10.1038/s41581-023-00706-z PMC10092939 3. Teillaud JL Houel A Panouillot M Riffard C Dieu-Nosjean MC Tertiary lymphoid structures in anticancer immunity Nat Rev Cancer 2024 24 9 629 646 10.1038/s41568-024-00728-0 39117919 Teillaud JL, Houel A, Panouillot M, Riffard C, Dieu-Nosjean MC. Tertiary lymphoid structures in anticancer immunity. Nat Rev Cancer. 2024;24(9):629–46. 39117919 10.1038/s41568-024-00728-0 4. Schumacher TN Thommen DS Tertiary lymphoid structures in cancer Science 2022 375 6576 eabf9419 10.1126/science.abf9419 34990248 Schumacher TN, Thommen DS. Tertiary lymphoid structures in cancer. Science. 2022;375(6576):eabf9419. 34990248 10.1126/science.abf9419 5. Yoshikawa T Yanagita M Single-Cell Analysis Provides New Insights into the Roles of Tertiary Lymphoid Structures and Immune Cell Infiltration in Kidney Injury and Chronic Kidney Disease Am J Pathol 2025 195 1 40 54 10.1016/j.ajpath.2024.07.008 39097168 PMC12179524 Yoshikawa T, Yanagita M. Single-Cell Analysis Provides New Insights into the Roles of Tertiary Lymphoid Structures and Immune Cell Infiltration in Kidney Injury and Chronic Kidney Disease. Am J Pathol. 2025;195(1):40–54. 39097168 10.1016/j.ajpath.2024.07.008 PMC12179524 6. Yoshikawa T Oguchi A Toriu N Sato Y Kobayashi T Ogawa O Tertiary Lymphoid Tissues Are Microenvironments with Intensive Interactions between Immune Cells and Proinflammatory Parenchymal Cells in Aged Kidneys J Am Soc Nephrol 2023 34 10 1687 1708 10.1681/ASN.0000000000000202 37548710 PMC10561819 Yoshikawa T, Oguchi A, Toriu N, Sato Y, Kobayashi T, Ogawa O, et al. Tertiary Lymphoid Tissues Are Microenvironments with Intensive Interactions between Immune Cells and Proinflammatory Parenchymal Cells in Aged Kidneys. J Am Soc Nephrol. 2023;34(10):1687–708. 37548710 10.1681/ASN.0000000000000202 PMC10561819 7. Sato Y, Oguchi A, Fukushima Y, Masuda K, Toriu N, Taniguchi K, et al. CD153/CD30 signaling promotes age-dependent tertiary lymphoid tissue expansion and kidney injury. J Clin Invest. 2022;132(2). 10.1172/JCI146071 PMC8759786 34813503 8. Tanoue K Ohmura H Uehara K Ito M Yamaguchi K Tsuchihashi K Spatial dynamics of CD39(+)CD8(+) exhausted T cell reveal tertiary lymphoid structures-mediated response to PD-1 blockade in esophageal cancer Nat Commun 2024 15 1 9033 10.1038/s41467-024-53262-w 39426955 PMC11490492 Tanoue K, Ohmura H, Uehara K, Ito M, Yamaguchi K, Tsuchihashi K, et al. Spatial dynamics of CD39(+)CD8(+) exhausted T cell reveal tertiary lymphoid structures-mediated response to PD-1 blockade in esophageal cancer. Nat Commun. 2024;15(1):9033. 39426955 10.1038/s41467-024-53262-w PMC11490492 9. Shiao SL, Gouin KH, 3rd, Ing N, Ho A, Basho R, Shah A, et al. Single-cell and spatial profiling identify three response trajectories to pembrolizumab and radiation therapy in triple negative breast cancer. Cancer Cell. 2024;42(1):70–84 e8. 10.1016/j.ccell.2023.12.012 38194915 10. Abedini A Levinsohn J Klotzer KA Dumoulin B Ma Z Frederick J Single-cell multi-omic and spatial profiling of human kidneys implicates the fibrotic microenvironment in kidney disease progression Nat Genet 2024 56 8 1712 1724 10.1038/s41588-024-01802-x 39048792 PMC11592391 Abedini A, Levinsohn J, Klotzer KA, Dumoulin B, Ma Z, Frederick J, et al. Single-cell multi-omic and spatial profiling of human kidneys implicates the fibrotic microenvironment in kidney disease progression. Nat Genet. 2024;56(8):1712–24. 39048792 10.1038/s41588-024-01802-x PMC11592391 11. Sato Y Mii A Hamazaki Y Fujita H Nakata H Masuda K Heterogeneous fibroblasts underlie age-dependent tertiary lymphoid tissues in the kidney JCI Insight 2016 1 11 e87680 10.1172/jci.insight.87680 27699223 PMC5033938 Sato Y, Mii A, Hamazaki Y, Fujita H, Nakata H, Masuda K, et al. Heterogeneous fibroblasts underlie age-dependent tertiary lymphoid tissues in the kidney. JCI Insight. 2016;1(11): e87680. 27699223 10.1172/jci.insight.87680 PMC5033938 12. Toriu N, Sato Y, Kamimura H, Yoshikawa T, Tanaka M, Yamamoto S, et al. Aligning cellular and molecular components in age-dependent tertiary lymphoid tissues of kidney and liver. Plos One. 2025;20(2). 10.1371/journal.pone.0311193 PMC11867392 40014629 13. Ligon MM Wang C DeJong EN Schulz C Bowdish DME Mysorekar IU Single cell and tissue-transcriptomic analysis of murine bladders reveals age- and TNFalpha-dependent but microbiota-independent tertiary lymphoid tissue formation Mucosal Immunol 2020 13 6 908 918 10.1038/s41385-020-0290-x 32366865 PMC7572484 Ligon MM, Wang C, DeJong EN, Schulz C, Bowdish DME, Mysorekar IU. Single cell and tissue-transcriptomic analysis of murine bladders reveals age- and TNFalpha-dependent but microbiota-independent tertiary lymphoid tissue formation. Mucosal Immunol. 2020;13(6):908–18. 32366865 10.1038/s41385-020-0290-x PMC7572484 14. Galletti JG Scholand KK Trujillo-Vargas CM Yu Z Mauduit O Delcroix V Ectopic lymphoid structures in the aged lacrimal glands Clin Immunol 2023 248 109251 10.1016/j.clim.2023.109251 36740002 PMC10323865 Galletti JG, Scholand KK, Trujillo-Vargas CM, Yu Z, Mauduit O, Delcroix V, et al. Ectopic lymphoid structures in the aged lacrimal glands. Clin Immunol. 2023;248: 109251. 36740002 10.1016/j.clim.2023.109251 PMC10323865 15. Yoshikawa T Lee YH Sato Y Yanagita M Tertiary lymphoid tissues in kidney diseases: a perspective for the pediatric nephrologist Pediatr Nephrol 2023 38 5 1399 1409 10.1007/s00467-022-05770-4 36251070 Yoshikawa T, Lee YH, Sato Y, Yanagita M. Tertiary lymphoid tissues in kidney diseases: a perspective for the pediatric nephrologist. Pediatr Nephrol. 2023;38(5):1399–409. 36251070 10.1007/s00467-022-05770-4 16. Sato Y Boor P Fukuma S Klinkhammer BM Haga H Ogawa O Developmental stages of tertiary lymphoid tissue reflect local injury and inflammation in mouse and human kidneys Kidney Int 2020 98 2 448 463 10.1016/j.kint.2020.02.023 32473779 Sato Y, Boor P, Fukuma S, Klinkhammer BM, Haga H, Ogawa O, et al. Developmental stages of tertiary lymphoid tissue reflect local injury and inflammation in mouse and human kidneys. Kidney Int. 2020;98(2):448–63. 32473779 10.1016/j.kint.2020.02.023 17. Antonioli L Fornai M Pellegrini C Masi S Puxeddu I Blandizzi C Ectopic Lymphoid Organs and Immune-Mediated Diseases: Molecular Basis for Pharmacological Approaches Trends Mol Med 2020 26 11 1021 1033 10.1016/j.molmed.2020.06.004 32600794 Antonioli L, Fornai M, Pellegrini C, Masi S, Puxeddu I, Blandizzi C. Ectopic Lymphoid Organs and Immune-Mediated Diseases: Molecular Basis for Pharmacological Approaches. Trends Mol Med. 2020;26(11):1021–33. 32600794 10.1016/j.molmed.2020.06.004 18. de Gago C van Baarsen LGM Mebius RE Tertiary Lymphoid Structures: Diversity in Their Development, Composition, and Role J Immunol 2021 206 2 273 81 10.4049/jimmunol.2000873 33397741 Gago da Graca C, van Baarsen LGM, Mebius RE. Tertiary Lymphoid Structures: Diversity in Their Development, Composition, and Role. J Immunol. 2021;206(2):273–81. 33397741 10.4049/jimmunol.2000873 19. van de Pavert SA Olivier BJ Goverse G Vondenhoff MF Greuter M Beke P Chemokine CXCL13 is essential for lymph node initiation and is induced by retinoic acid and neuronal stimulation Nat Immunol 2009 10 11 1193 1199 10.1038/ni.1789 19783990 PMC2771164 van de Pavert SA, Olivier BJ, Goverse G, Vondenhoff MF, Greuter M, Beke P, et al. Chemokine CXCL13 is essential for lymph node initiation and is induced by retinoic acid and neuronal stimulation. Nat Immunol. 2009;10(11):1193–9. 19783990 10.1038/ni.1789 PMC2771164 20. Ruddle NH Lymphatic vessels and tertiary lymphoid organs J Clin Invest 2014 124 3 953 959 10.1172/JCI71611 24590281 PMC3934190 Ruddle NH. Lymphatic vessels and tertiary lymphoid organs. J Clin Invest. 2014;124(3):953–9. 24590281 10.1172/JCI71611 PMC3934190 21. Vondenhoff MF Kraal G Mebius RE Lymphoid organogenesis in brief Eur J Immunol 2007 37 Suppl 1 S46 52 10.1002/eji.200737528 17972344 Vondenhoff MF, Kraal G, Mebius RE. Lymphoid organogenesis in brief. Eur J Immunol. 2007;37(Suppl 1):S46-52. 17972344 10.1002/eji.200737528 22. Krishnamurty AT Turley SJ Lymph node stromal cells: cartographers of the immune system Nat Immunol 2020 21 4 369 380 10.1038/s41590-020-0635-3 32205888 Krishnamurty AT, Turley SJ. Lymph node stromal cells: cartographers of the immune system. Nat Immunol. 2020;21(4):369–80. 32205888 10.1038/s41590-020-0635-3 23. Rangel-Moreno J Carragher DM de la Luz G-H Hwang JY Kusser K Hartson L The development of inducible bronchus-associated lymphoid tissue depends on IL-17 Nat Immunol 2011 12 7 639 646 10.1038/ni.2053 21666689 PMC3520063 Rangel-Moreno J, Carragher DM, de la Luz G-H, Hwang JY, Kusser K, Hartson L, et al. The development of inducible bronchus-associated lymphoid tissue depends on IL-17. Nat Immunol. 2011;12(7):639–46. 21666689 10.1038/ni.2053 PMC3520063 24. Nayar S Campos J Smith CG Iannizzotto V Gardner DH Mourcin F Immunofibroblasts are pivotal drivers of tertiary lymphoid structure formation and local pathology Proc Natl Acad Sci U S A 2019 116 27 13490 13497 10.1073/pnas.1905301116 31213547 PMC6613169 Nayar S, Campos J, Smith CG, Iannizzotto V, Gardner DH, Mourcin F, et al. Immunofibroblasts are pivotal drivers of tertiary lymphoid structure formation and local pathology. Proc Natl Acad Sci U S A. 2019;116(27):13490–7. 31213547 10.1073/pnas.1905301116 PMC6613169 25. Barone F Nayar S Campos J Cloake T Withers DR Toellner KM IL-22 regulates lymphoid chemokine production and assembly of tertiary lymphoid organs Proc Natl Acad Sci U S A 2015 112 35 11024 11029 10.1073/pnas.1503315112 26286991 PMC4568258 Barone F, Nayar S, Campos J, Cloake T, Withers DR, Toellner KM, et al. IL-22 regulates lymphoid chemokine production and assembly of tertiary lymphoid organs. Proc Natl Acad Sci U S A. 2015;112(35):11024–9. 26286991 10.1073/pnas.1503315112 PMC4568258 26. Zhao L Jin S Wang S Zhang Z Wang X Chen Z Tertiary lymphoid structures in diseases: immune mechanisms and therapeutic advances Signal Transduct Target Ther 2024 9 1 225 10.1038/s41392-024-01947-5 39198425 PMC11358547 Zhao L, Jin S, Wang S, Zhang Z, Wang X, Chen Z, et al. Tertiary lymphoid structures in diseases: immune mechanisms and therapeutic advances. Signal Transduct Target Ther. 2024;9(1):225. 39198425 10.1038/s41392-024-01947-5 PMC11358547 27. Fleig S Kapanadze T Bernier-Latmani J Lill JK Wyss T Gamrekelashvili J Loss of vascular endothelial notch signaling promotes spontaneous formation of tertiary lymphoid structures Nat Commun 2022 13 1 2022 10.1038/s41467-022-29701-x 35440634 PMC9018798 Fleig S, Kapanadze T, Bernier-Latmani J, Lill JK, Wyss T, Gamrekelashvili J, et al. Loss of vascular endothelial notch signaling promotes spontaneous formation of tertiary lymphoid structures. Nat Commun. 2022;13(1):2022. 35440634 10.1038/s41467-022-29701-x PMC9018798 28. Lee YH Sato Y Saito M Fukuma S Saito M Yamamoto S Advanced Tertiary Lymphoid Tissues in Protocol Biopsies are Associated with Progressive Graft Dysfunction in Kidney Transplant Recipients J Am Soc Nephrol 2022 33 1 186 200 10.1681/ASN.2021050715 34725107 PMC8763171 Lee YH, Sato Y, Saito M, Fukuma S, Saito M, Yamamoto S, et al. Advanced Tertiary Lymphoid Tissues in Protocol Biopsies are Associated with Progressive Graft Dysfunction in Kidney Transplant Recipients. J Am Soc Nephrol. 2022;33(1):186–200. 34725107 10.1681/ASN.2021050715 PMC8763171 29. Vanhersecke L Brunet M Guegan JP Rey C Bougouin A Cousin S Mature tertiary lymphoid structures predict immune checkpoint inhibitor efficacy in solid tumors independently of PD-L1 expression Nat Cancer 2021 2 8 794 802 10.1038/s43018-021-00232-6 35118423 PMC8809887 Vanhersecke L, Brunet M, Guegan JP, Rey C, Bougouin A, Cousin S, et al. Mature tertiary lymphoid structures predict immune checkpoint inhibitor efficacy in solid tumors independently of PD-L1 expression. Nat Cancer. 2021;2(8):794–802. 35118423 10.1038/s43018-021-00232-6 PMC8809887 30. Calderaro J Petitprez F Becht E Laurent A Hirsch TZ Rousseau B Intra-tumoral tertiary lymphoid structures are associated with a low risk of early recurrence of hepatocellular carcinoma J Hepatol 2019 70 1 58 65 10.1016/j.jhep.2018.09.003 30213589 Calderaro J, Petitprez F, Becht E, Laurent A, Hirsch TZ, Rousseau B, et al. Intra-tumoral tertiary lymphoid structures are associated with a low risk of early recurrence of hepatocellular carcinoma. J Hepatol. 2019;70(1):58–65. 30213589 10.1016/j.jhep.2018.09.003 31. Shu DH Ho WJ Kagohara LT Girgis A Shin SM Danilova L Immunotherapy response induces divergent tertiary lymphoid structure morphologies in hepatocellular carcinoma Nat Immunol 2024 25 11 2110 2123 10.1038/s41590-024-01992-w 39455893 PMC12042221 Shu DH, Ho WJ, Kagohara LT, Girgis A, Shin SM, Danilova L, et al. Immunotherapy response induces divergent tertiary lymphoid structure morphologies in hepatocellular carcinoma. Nat Immunol. 2024;25(11):2110–23. 39455893 10.1038/s41590-024-01992-w PMC12042221 32. Ruddle NH Posttransplant Tertiary Lymphoid Organs Transplantation 2024 108 5 1090 1099 10.1097/TP.0000000000004812 37917987 PMC11042531 Ruddle NH. Posttransplant Tertiary Lymphoid Organs. Transplantation. 2024;108(5):1090–9. 37917987 10.1097/TP.0000000000004812 PMC11042531 33. Gu-Trantien C Loi S Garaud S Equeter C Libin M de Wind A CD4(+) follicular helper T cell infiltration predicts breast cancer survival J Clin Invest 2013 123 7 2873 2892 10.1172/JCI67428 23778140 PMC3696556 Gu-Trantien C, Loi S, Garaud S, Equeter C, Libin M, de Wind A, et al. CD4(+) follicular helper T cell infiltration predicts breast cancer survival. J Clin Invest. 2013;123(7):2873–92. 23778140 10.1172/JCI67428 PMC3696556 34. Kroeger DR Milne K Nelson BH Tumor-Infiltrating Plasma Cells Are Associated with Tertiary Lymphoid Structures, Cytolytic T-Cell Responses, and Superior Prognosis in Ovarian Cancer Clin Cancer Res 2016 22 12 3005 3015 10.1158/1078-0432.CCR-15-2762 26763251 Kroeger DR, Milne K, Nelson BH. Tumor-Infiltrating Plasma Cells Are Associated with Tertiary Lymphoid Structures, Cytolytic T-Cell Responses, and Superior Prognosis in Ovarian Cancer. Clin Cancer Res. 2016;22(12):3005–15. 26763251 10.1158/1078-0432.CCR-15-2762 35. Ukita M, Hamanishi J, Yoshitomi H, Yamanoi K, Takamatsu S, Ueda A, et al. CXCL13-producing CD4+ T cells accumulate in the early phase of tertiary lymphoid structures in ovarian cancer. JCI Insight. 2022;7(12). 10.1172/jci.insight.157215 PMC9309049 35552285 36. Deguchi S Tanaka H Suzuki S Natsuki S Mori T Miki Y Clinical relevance of tertiary lymphoid structures in esophageal squamous cell carcinoma BMC Cancer 2022 22 1 699 10.1186/s12885-022-09777-w 35751038 PMC9233387 Deguchi S, Tanaka H, Suzuki S, Natsuki S, Mori T, Miki Y, et al. Clinical relevance of tertiary lymphoid structures in esophageal squamous cell carcinoma. BMC Cancer. 2022;22(1):699. 35751038 10.1186/s12885-022-09777-w PMC9233387 37. Dieu-Nosjean MC Antoine M Danel C Heudes D Wislez M Poulot V Long-term survival for patients with non-small-cell lung cancer with intratumoral lymphoid structures J Clin Oncol 2008 26 27 4410 4417 10.1200/JCO.2007.15.0284 18802153 Dieu-Nosjean MC, Antoine M, Danel C, Heudes D, Wislez M, Poulot V, et al. Long-term survival for patients with non-small-cell lung cancer with intratumoral lymphoid structures. J Clin Oncol. 2008;26(27):4410–7. 18802153 10.1200/JCO.2007.15.0284 38. Finkin S Yuan D Stein I Taniguchi K Weber A Unger K Ectopic lymphoid structures function as microniches for tumor progenitor cells in hepatocellular carcinoma Nat Immunol 2015 16 12 1235 1244 10.1038/ni.3290 26502405 PMC4653079 Finkin S, Yuan D, Stein I, Taniguchi K, Weber A, Unger K, et al. Ectopic lymphoid structures function as microniches for tumor progenitor cells in hepatocellular carcinoma. Nat Immunol. 2015;16(12):1235–44. 26502405 10.1038/ni.3290 PMC4653079 39. Masuda T, Tanaka N, Takamatsu K, Hakozaki K, Takahashi R, Anno T, et al. Unique characteristics of tertiary lymphoid structures in kidney clear cell carcinoma: prognostic outcome and comparison with bladder cancer. J Immunother Cancer. 2022;10(3). 10.1136/jitc-2021-003883 PMC8938705 35314433 40. Cabrita R Lauss M Sanna A Donia M Skaarup Larsen M Mitra S Tertiary lymphoid structures improve immunotherapy and survival in melanoma Nature 2020 577 7791 561 565 10.1038/s41586-019-1914-8 31942071 Cabrita R, Lauss M, Sanna A, Donia M, Skaarup Larsen M, Mitra S, et al. Tertiary lymphoid structures improve immunotherapy and survival in melanoma. Nature. 2020;577(7791):561–5. 31942071 10.1038/s41586-019-1914-8 41. Kasikova L Rakova J Hensler M Lanickova T Tomankova J Pasulka J Tertiary lymphoid structures and B cells determine clinically relevant T cell phenotypes in ovarian cancer Nat Commun 2024 15 1 2528 10.1038/s41467-024-46873-w 38514660 PMC10957872 Kasikova L, Rakova J, Hensler M, Lanickova T, Tomankova J, Pasulka J, et al. Tertiary lymphoid structures and B cells determine clinically relevant T cell phenotypes in ovarian cancer. Nat Commun. 2024;15(1):2528. 38514660 10.1038/s41467-024-46873-w PMC10957872 42. Meylan M Petitprez F Becht E Bougouin A Pupier G Calvez A Tertiary lymphoid structures generate and propagate anti-tumor antibody-producing plasma cells in renal cell cancer Immunity 2022 55 3 527 41 e5 10.1016/j.immuni.2022.02.001 35231421 Meylan M, Petitprez F, Becht E, Bougouin A, Pupier G, Calvez A, et al. Tertiary lymphoid structures generate and propagate anti-tumor antibody-producing plasma cells in renal cell cancer. Immunity. 2022;55(3):527–41 e5. 35231421 10.1016/j.immuni.2022.02.001 43. Helmink BA Reddy SM Gao J Zhang S Basar R Thakur R B cells and tertiary lymphoid structures promote immunotherapy response Nature 2020 577 7791 549 555 10.1038/s41586-019-1922-8 31942075 PMC8762581 Helmink BA, Reddy SM, Gao J, Zhang S, Basar R, Thakur R, et al. B cells and tertiary lymphoid structures promote immunotherapy response. Nature. 2020;577(7791):549–55. 31942075 10.1038/s41586-019-1922-8 PMC8762581 44. Yang M, Lu J, Zhang G, Wang Y, He M, Xu Q, et al. CXCL13 shapes immunoactive tumor microenvironment and enhances the efficacy of PD-1 checkpoint blockade in high-grade serous ovarian cancer. J Immunother Cancer. 2021;9(1). 10.1136/jitc-2020-001136 PMC7813306 33452206 45. Delvecchio FR Fincham REA Spear S Clear A Roy-Luzarraga M Balkwill FR Pancreatic Cancer Chemotherapy Is Potentiated by Induction of Tertiary Lymphoid Structures in Mice Cell Mol Gastroenterol Hepatol 2021 12 5 1543 1565 10.1016/j.jcmgh.2021.06.023 34252585 PMC8529396 Delvecchio FR, Fincham REA, Spear S, Clear A, Roy-Luzarraga M, Balkwill FR, et al. Pancreatic Cancer Chemotherapy Is Potentiated by Induction of Tertiary Lymphoid Structures in Mice. Cell Mol Gastroenterol Hepatol. 2021;12(5):1543–65. 34252585 10.1016/j.jcmgh.2021.06.023 PMC8529396 46. Ren J Lan T Liu T Liu Y Shao B Men K CXCL13 as a Novel Immune Checkpoint for Regulatory B Cells and Its Role in Tumor Metastasis J Immunol 2022 208 10 2425 2435 10.4049/jimmunol.2100341 35437281 PMC9125199 Ren J, Lan T, Liu T, Liu Y, Shao B, Men K, et al. CXCL13 as a Novel Immune Checkpoint for Regulatory B Cells and Its Role in Tumor Metastasis. J Immunol. 2022;208(10):2425–35. 35437281 10.4049/jimmunol.2100341 PMC9125199 47. Johansson-Percival A He B Li ZJ Kjellen A Russell K Li J De novo induction of intratumoral lymphoid structures and vessel normalization enhances immunotherapy in resistant tumors Nat Immunol 2017 18 11 1207 1217 10.1038/ni.3836 28892469 Johansson-Percival A, He B, Li ZJ, Kjellen A, Russell K, Li J, et al. De novo induction of intratumoral lymphoid structures and vessel normalization enhances immunotherapy in resistant tumors. Nat Immunol. 2017;18(11):1207–17. 28892469 10.1038/ni.3836 48. Allen E Jabouille A Rivera LB Lodewijckx I Missiaen R Steri V Combined antiangiogenic and anti–PD-L1 therapy stimulates tumor immunity through HEV formation Sci Transl Med 2017 9 385 eaak9679 10.1126/scitranslmed.aak9679 28404866 PMC5554432 Allen E, Jabouille A, Rivera LB, Lodewijckx I, Missiaen R, Steri V, et al. Combined antiangiogenic and anti–PD-L1 therapy stimulates tumor immunity through HEV formation. Sci Transl Med. 2017;9(385):eaak9679. 28404866 10.1126/scitranslmed.aak9679 PMC5554432 49. Tang H Wang Y Chlewicki LK Zhang Y Guo J Liang W Facilitating T Cell Infiltration in Tumor Microenvironment Overcomes Resistance to PD-L1 Blockade Cancer Cell 2016 29 3 285 296 10.1016/j.ccell.2016.02.004 26977880 PMC4794755 Tang H, Wang Y, Chlewicki LK, Zhang Y, Guo J, Liang W, et al. Facilitating T Cell Infiltration in Tumor Microenvironment Overcomes Resistance to PD-L1 Blockade. Cancer Cell. 2016;29(3):285–96. 26977880 10.1016/j.ccell.2016.02.004 PMC4794755 50. Jain RK Normalization of tumor vasculature: an emerging concept in antiangiogenic therapy Science 2005 307 5706 58 62 10.1126/science.1104819 15637262 Jain RK. Normalization of tumor vasculature: an emerging concept in antiangiogenic therapy. Science. 2005;307(5706):58–62. 15637262 10.1126/science.1104819 51. Chelvanambi M, Fecek RJ, Taylor JL, Storkus WJ. STING agonist-based treatment promotes vascular normalization and tertiary lymphoid structure formation in the therapeutic melanoma microenvironment. J Immunother Cancer. 2021;9(2). 10.1136/jitc-2020-001906 PMC7852948 33526609 52. Lutz ER Wu AA Bigelow E Sharma R Mo G Soares K Immunotherapy converts nonimmunogenic pancreatic tumors into immunogenic foci of immune regulation Cancer Immunol Res 2014 2 7 616 631 10.1158/2326-6066.CIR-14-0027 24942756 PMC4082460 Lutz ER, Wu AA, Bigelow E, Sharma R, Mo G, Soares K, et al. Immunotherapy converts nonimmunogenic pancreatic tumors into immunogenic foci of immune regulation. Cancer Immunol Res. 2014;2(7):616–31. 24942756 10.1158/2326-6066.CIR-14-0027 PMC4082460 53. Melssen MM Pollack KE Meneveau MO Smolkin ME Pinczewski J Koeppel AF Characterization and comparison of innate and adaptive immune responses at vaccine sites in melanoma vaccine clinical trials Cancer Immunol Immunother 2021 70 8 2151 2164 10.1007/s00262-020-02844-w 33454795 PMC10992166 Melssen MM, Pollack KE, Meneveau MO, Smolkin ME, Pinczewski J, Koeppel AF, et al. Characterization and comparison of innate and adaptive immune responses at vaccine sites in melanoma vaccine clinical trials. Cancer Immunol Immunother. 2021;70(8):2151–64. 33454795 10.1007/s00262-020-02844-w PMC10992166 54. Shen S, Cui Y, Li M, Yu K, Zhu Q, Zhang X, et al. TLR agonists promote formation of Tertiary Lymphoid Structure and improve anti-glioma immunity. Neuro Oncol. 2024. 10.1093/neuonc/noae167 PMC11726345 39188155 55. Maldonado L Teague JE Morrow MP Jotova I Wu TC Wang C Intramuscular Therapeutic Vaccination Targeting HPV16 Induces T Cell Responses That Localize in Mucosal Lesions Sci Transl Med 2014 96 221 221ra13 ra13 10.1126/scitranslmed.3007323 PMC4086631 24477000 Maldonado L, Teague JE, Morrow MP, Jotova I, Wu TC, Wang C, et al. Intramuscular Therapeutic Vaccination Targeting HPV16 Induces T Cell Responses That Localize in Mucosal Lesions. Science Translational Medicine. 2014;6(221):221ra13-ra13. 10.1126/scitranslmed.3007323 PMC4086631 24477000 56. Tsukamoto H Komohara Y Tomita Y Miura Y Motoshima T Imamura K Aging-associated and CD4 T-cell-dependent ectopic CXCL13 activation predisposes to anti-PD-1 therapy-induced adverse events Proc Natl Acad Sci U S A 2022 119 29 e2205378119 10.1073/pnas.2205378119 35858347 PMC9303859 Tsukamoto H, Komohara Y, Tomita Y, Miura Y, Motoshima T, Imamura K, et al. Aging-associated and CD4 T-cell-dependent ectopic CXCL13 activation predisposes to anti-PD-1 therapy-induced adverse events. Proc Natl Acad Sci U S A. 2022;119(29):e2205378119. 35858347 10.1073/pnas.2205378119 PMC9303859 57. Cupedo T Jansen W Kraal G Mebius RE Induction of secondary and tertiary lymphoid structures in the skin Immunity 2004 21 5 655 667 10.1016/j.immuni.2004.09.006 15539152 Cupedo T, Jansen W, Kraal G, Mebius RE. Induction of secondary and tertiary lymphoid structures in the skin. Immunity. 2004;21(5):655–67. 15539152 10.1016/j.immuni.2004.09.006 58. Vonderheide RH CD40 Agonist Antibodies in Cancer Immunotherapy Annu Rev Med 2020 71 47 58 10.1146/annurev-med-062518-045435 31412220 Vonderheide RH. CD40 Agonist Antibodies in Cancer Immunotherapy. Annu Rev Med. 2020;71:47–58. 31412220 10.1146/annurev-med-062518-045435 59. van Hooren L Vaccaro A Ramachandran M Vazaios K Libard S van de Walle T Agonistic CD40 therapy induces tertiary lymphoid structures but impairs responses to checkpoint blockade in glioma Nat Commun 2021 12 1 4127 10.1038/s41467-021-24347-7 34226552 PMC8257767 van Hooren L, Vaccaro A, Ramachandran M, Vazaios K, Libard S, van de Walle T, et al. Agonistic CD40 therapy induces tertiary lymphoid structures but impairs responses to checkpoint blockade in glioma. Nat Commun. 2021;12(1):4127. 34226552 10.1038/s41467-021-24347-7 PMC8257767 60. Kang W Feng Z Luo J He Z Liu J Wu J Tertiary Lymphoid Structures in Cancer: The Double-Edged Sword Role in Antitumor Immunity and Potential Therapeutic Induction Strategies Front Immunol 2021 12 689270 10.3389/fimmu.2021.689270 34394083 PMC8358404 Kang W, Feng Z, Luo J, He Z, Liu J, Wu J, et al. Tertiary Lymphoid Structures in Cancer: The Double-Edged Sword Role in Antitumor Immunity and Potential Therapeutic Induction Strategies. Front Immunol. 2021;12:689270. 34394083 10.3389/fimmu.2021.689270 PMC8358404 61. Senapati S Mahanta AK Kumar S Maiti P Controlled drug delivery vehicles for cancer treatment and their performance Signal Transduct Target Ther 2018 3 7 10.1038/s41392-017-0004-3 29560283 PMC5854578 Senapati S, Mahanta AK, Kumar S, Maiti P. Controlled drug delivery vehicles for cancer treatment and their performance. Signal Transduct Target Ther. 2018;3:7. 29560283 10.1038/s41392-017-0004-3 PMC5854578 62. Pitzalis C Jones GW Bombardieri M Jones SA Ectopic lymphoid-like structures in infection, cancer and autoimmunity Nat Rev Immunol 2014 14 7 447 462 10.1038/nri3700 24948366 Pitzalis C, Jones GW, Bombardieri M, Jones SA. Ectopic lymphoid-like structures in infection, cancer and autoimmunity. Nat Rev Immunol. 2014;14(7):447–62. 24948366 10.1038/nri3700 63. Marin ND Dunlap MD Kaushal D Khader SA Friend or Foe: The Protective and Pathological Roles of Inducible Bronchus-Associated Lymphoid Tissue in Pulmonary Diseases J Immunol 2019 202 9 2519 2526 10.4049/jimmunol.1801135 31010841 PMC6481307 Marin ND, Dunlap MD, Kaushal D, Khader SA. Friend or Foe: The Protective and Pathological Roles of Inducible Bronchus-Associated Lymphoid Tissue in Pulmonary Diseases. J Immunol. 2019;202(9):2519–26. 31010841 10.4049/jimmunol.1801135 PMC6481307 64. Moyron-Quiroz JE Rangel-Moreno J Hartson L Kusser K Tighe MP Klonowski KD Persistence and responsiveness of immunologic memory in the absence of secondary lymphoid organs Immunity 2006 25 4 643 654 10.1016/j.immuni.2006.08.022 17045819 Moyron-Quiroz JE, Rangel-Moreno J, Hartson L, Kusser K, Tighe MP, Klonowski KD, et al. Persistence and responsiveness of immunologic memory in the absence of secondary lymphoid organs. Immunity. 2006;25(4):643–54. 17045819 10.1016/j.immuni.2006.08.022 65. Moyron-Quiroz JE Rangel-Moreno J Kusser K Hartson L Sprague F Goodrich S Role of inducible bronchus associated lymphoid tissue (iBALT) in respiratory immunity Nat Med 2004 10 9 927 934 10.1038/nm1091 15311275 Moyron-Quiroz JE, Rangel-Moreno J, Kusser K, Hartson L, Sprague F, Goodrich S, et al. Role of inducible bronchus associated lymphoid tissue (iBALT) in respiratory immunity. Nat Med. 2004;10(9):927–34. 15311275 10.1038/nm1091 66. Tan HX Esterbauer R Vanderven HA Juno JA Kent SJ Wheatley AK Inducible Bronchus-Associated Lymphoid Tissues (iBALT) Serve as Sites of B Cell Selection and Maturation Following Influenza Infection in Mice Front Immunol 2019 10 611 10.3389/fimmu.2019.00611 30984186 PMC6450362 Tan HX, Esterbauer R, Vanderven HA, Juno JA, Kent SJ, Wheatley AK. Inducible Bronchus-Associated Lymphoid Tissues (iBALT) Serve as Sites of B Cell Selection and Maturation Following Influenza Infection in Mice. Front Immunol. 2019;10:611. 30984186 10.3389/fimmu.2019.00611 PMC6450362 67. Slight SR Rangel-Moreno J Gopal R Lin Y Fallert Junecko BA Mehra S CXCR5(+) T helper cells mediate protective immunity against tuberculosis J Clin Invest 2013 123 2 712 726 23281399 10.1172/JCI65728 PMC3561804 Slight SR, Rangel-Moreno J, Gopal R, Lin Y, Fallert Junecko BA, Mehra S, et al. CXCR5(+) T helper cells mediate protective immunity against tuberculosis. J Clin Invest. 2013;123(2):712–26. 23281399 10.1172/JCI65728 PMC3561804 68. Matsumoto R Gray J Rybkina K Oppenheimer H Levy L Friedman LM Induction of bronchus-associated lymphoid tissue is an early life adaptation for promoting human B cell immunity Nat Immunol 2023 24 8 1370 1381 10.1038/s41590-023-01557-3 37460638 PMC10529876 Matsumoto R, Gray J, Rybkina K, Oppenheimer H, Levy L, Friedman LM, et al. Induction of bronchus-associated lymphoid tissue is an early life adaptation for promoting human B cell immunity. Nat Immunol. 2023;24(8):1370–81. 37460638 10.1038/s41590-023-01557-3 PMC10529876 69. Cavalli G Colafrancesco S Emmi G Imazio M Lopalco G Maggio MC Interleukin 1alpha: a comprehensive review on the role of IL-1alpha in the pathogenesis and treatment of autoimmune and inflammatory diseases Autoimmun Rev 2021 20 3 102763 10.1016/j.autrev.2021.102763 33482337 Cavalli G, Colafrancesco S, Emmi G, Imazio M, Lopalco G, Maggio MC, et al. Interleukin 1alpha: a comprehensive review on the role of IL-1alpha in the pathogenesis and treatment of autoimmune and inflammatory diseases. Autoimmun Rev. 2021;20(3):102763. 33482337 10.1016/j.autrev.2021.102763 70. Neyt K GeurtsvanKessel CH Deswarte K Hammad H Lambrecht BN Early IL-1 Signaling Promotes iBALT Induction after Influenza Virus Infection Front Immunol 2016 7 312 10.3389/fimmu.2016.00312 27579026 PMC4985557 Neyt K, GeurtsvanKessel CH, Deswarte K, Hammad H, Lambrecht BN. Early IL-1 Signaling Promotes iBALT Induction after Influenza Virus Infection. Front Immunol. 2016;7:312. 27579026 10.3389/fimmu.2016.00312 PMC4985557 71. Wang X Chan CC Yang M Deng J Poon VK Leung VH A critical role of IL-17 in modulating the B-cell response during H5N1 influenza virus infection Cell Mol Immunol 2011 8 6 462 468 10.1038/cmi.2011.38 21946434 PMC4012931 Wang X, Chan CC, Yang M, Deng J, Poon VK, Leung VH, et al. A critical role of IL-17 in modulating the B-cell response during H5N1 influenza virus infection. Cell Mol Immunol. 2011;8(6):462–8. 21946434 10.1038/cmi.2011.38 PMC4012931 72. McGeachy MJ Bak-Jensen KS Chen Y Tato CM Blumenschein W McClanahan T TGF-beta and IL-6 drive the production of IL-17 and IL-10 by T cells and restrain T(H)-17 cell-mediated pathology Nat Immunol 2007 8 12 1390 1397 10.1038/ni1539 17994024 McGeachy MJ, Bak-Jensen KS, Chen Y, Tato CM, Blumenschein W, McClanahan T, et al. TGF-beta and IL-6 drive the production of IL-17 and IL-10 by T cells and restrain T(H)-17 cell-mediated pathology. Nat Immunol. 2007;8(12):1390–7. 17994024 10.1038/ni1539 73. Khader SA Guglani L Rangel-Moreno J Gopal R Junecko BA Fountain JJ IL-23 is required for long-term control of Mycobacterium tuberculosis and B cell follicle formation in the infected lung J Immunol 2011 187 10 5402 5407 10.4049/jimmunol.1101377 22003199 PMC3208087 Khader SA, Guglani L, Rangel-Moreno J, Gopal R, Junecko BA, Fountain JJ, et al. IL-23 is required for long-term control of Mycobacterium tuberculosis and B cell follicle formation in the infected lung. J Immunol. 2011;187(10):5402–7. 22003199 10.4049/jimmunol.1101377 PMC3208087 74. Fleige H Ravens S Moschovakis GL Bolter J Willenzon S Sutter G IL-17-induced CXCL12 recruits B cells and induces follicle formation in BALT in the absence of differentiated FDCs J Exp Med 2014 211 4 643 651 10.1084/jem.20131737 24663215 PMC3978277 Fleige H, Ravens S, Moschovakis GL, Bolter J, Willenzon S, Sutter G, et al. IL-17-induced CXCL12 recruits B cells and induces follicle formation in BALT in the absence of differentiated FDCs. J Exp Med. 2014;211(4):643–51. 24663215 10.1084/jem.20131737 PMC3978277 75. Fleige H, Haas JD, Stahl FR, Willenzon S, Prinz I, Forster R. Induction of BALT in the absence of IL-17. Nat Immunol. 2011;13(1):1; author reply 2. 10.1038/ni.2167 22179267 76. van Buuren N Ramirez R Turner S Chen D Suri V Aggarwal A Characterization of the liver immune microenvironment in liver biopsies from patients with chronic HBV infection JHEP Rep 2022 4 1 100388 10.1016/j.jhepr.2021.100388 34950863 PMC8671126 van Buuren N, Ramirez R, Turner S, Chen D, Suri V, Aggarwal A, et al. Characterization of the liver immune microenvironment in liver biopsies from patients with chronic HBV infection. JHEP Rep. 2022;4(1): 100388. 34950863 10.1016/j.jhepr.2021.100388 PMC8671126 77. Li L Barry V Daffis S Niu C Huntzicker E French DM Anti-HBV response to toll-like receptor 7 agonist GS-9620 is associated with intrahepatic aggregates of T cells and B cells J Hepatol 2018 68 5 912 921 10.1016/j.jhep.2017.12.008 29247724 PMC9940657 Li L, Barry V, Daffis S, Niu C, Huntzicker E, French DM, et al. Anti-HBV response to toll-like receptor 7 agonist GS-9620 is associated with intrahepatic aggregates of T cells and B cells. J Hepatol. 2018;68(5):912–21. 29247724 10.1016/j.jhep.2017.12.008 PMC9940657 78. Ichii O Hosotani M Masum MA Horino T Otani Y Namba T Close Association between Altered Urine-Urothelium Barrier and Tertiary Lymphoid Structure Formation in the Renal Pelvis during Nephritis J Am Soc Nephrol 2022 33 1 88 107 10.1681/ASN.2021040575 34686544 PMC8763173 Ichii O, Hosotani M, Masum MA, Horino T, Otani Y, Namba T, et al. Close Association between Altered Urine-Urothelium Barrier and Tertiary Lymphoid Structure Formation in the Renal Pelvis during Nephritis. J Am Soc Nephrol. 2022;33(1):88–107. 34686544 10.1681/ASN.2021040575 PMC8763173 79. Dutt TS Karger BR Fox A Youssef N Dadhwal R Ali MZ Mucosal exposure to non-tuberculous mycobacteria elicits B cell-mediated immunity against pulmonary tuberculosis Cell Rep 2022 41 11 111783 10.1016/j.celrep.2022.111783 36516760 PMC10337594 Dutt TS, Karger BR, Fox A, Youssef N, Dadhwal R, Ali MZ, et al. Mucosal exposure to non-tuberculous mycobacteria elicits B cell-mediated immunity against pulmonary tuberculosis. Cell Rep. 2022;41(11): 111783. 36516760 10.1016/j.celrep.2022.111783 PMC10337594 80. Kaushal D Foreman TW Gautam US Alvarez X Adekambi T Rangel-Moreno J Mucosal vaccination with attenuated Mycobacterium tuberculosis induces strong central memory responses and protects against tuberculosis Nat Commun 2015 6 8533 10.1038/ncomms9533 26460802 PMC4608260 Kaushal D, Foreman TW, Gautam US, Alvarez X, Adekambi T, Rangel-Moreno J, et al. Mucosal vaccination with attenuated Mycobacterium tuberculosis induces strong central memory responses and protects against tuberculosis. Nat Commun. 2015;6:8533. 26460802 10.1038/ncomms9533 PMC4608260 81. Wiley JA Richert LE Swain SD Harmsen A Barnard DL Randall TD Inducible bronchus-associated lymphoid tissue elicited by a protein cage nanoparticle enhances protection in mice against diverse respiratory viruses PLoS ONE 2009 4 9 e7142 10.1371/journal.pone.0007142 19774076 PMC2743193 Wiley JA, Richert LE, Swain SD, Harmsen A, Barnard DL, Randall TD, et al. Inducible bronchus-associated lymphoid tissue elicited by a protein cage nanoparticle enhances protection in mice against diverse respiratory viruses. PLoS ONE. 2009;4(9): e7142. 19774076 10.1371/journal.pone.0007142 PMC2743193 82. Mothes R Pascual-Reguant A Koehler R Liebeskind J Liebheit A Bauherr S Distinct tissue niches direct lung immunopathology via CCL18 and CCL21 in severe COVID-19 Nat Commun 2023 14 1 791 10.1038/s41467-023-36333-2 36774347 PMC9922044 Mothes R, Pascual-Reguant A, Koehler R, Liebeskind J, Liebheit A, Bauherr S, et al. Distinct tissue niches direct lung immunopathology via CCL18 and CCL21 in severe COVID-19. Nat Commun. 2023;14(1):791. 36774347 10.1038/s41467-023-36333-2 PMC9922044 83. Dinnon KH Leist SR Okuda K Dang H Fritch EJ Gully KL SARS-CoV-2 infection produces chronic pulmonary epithelial and immune cell dysfunction with fibrosis in mice Sci Transl Med 2022 14 664 eabo5070 10.1126/scitranslmed.abo5070 35857635 PMC9273046 Dinnon KH, Leist SR, Okuda K, Dang H, Fritch EJ, Gully KL, et al. SARS-CoV-2 infection produces chronic pulmonary epithelial and immune cell dysfunction with fibrosis in mice. Science Translational Medicine. 2022;14(664):eabo5070. 35857635 10.1126/scitranslmed.abo5070 PMC9273046 84. Humby F Bombardieri M Manzo A Kelly S Blades MC Kirkham B Ectopic lymphoid structures support ongoing production of class-switched autoantibodies in rheumatoid synovium PLoS Med 2009 6 1 e1 10.1371/journal.pmed.0060001 19143467 PMC2621263 Humby F, Bombardieri M, Manzo A, Kelly S, Blades MC, Kirkham B, et al. Ectopic lymphoid structures support ongoing production of class-switched autoantibodies in rheumatoid synovium. PLoS Med. 2009;6(1):e1. 19143467 10.1371/journal.pmed.0060001 PMC2621263 85. Chang A Henderson SG Brandt D Liu N Guttikonda R Hsieh C In situ B cell-mediated immune responses and tubulointerstitial inflammation in human lupus nephritis J Immunol 2011 186 3 1849 1860 10.4049/jimmunol.1001983 21187439 PMC3124090 Chang A, Henderson SG, Brandt D, Liu N, Guttikonda R, Hsieh C, et al. In situ B cell-mediated immune responses and tubulointerstitial inflammation in human lupus nephritis. J Immunol. 2011;186(3):1849–60. 21187439 10.4049/jimmunol.1001983 PMC3124090 86. Steinmetz OM Velden J Kneissler U Marx M Klein A Helmchen U Analysis and classification of B-cell infiltrates in lupus and ANCA-associated nephritis Kidney Int 2008 74 4 448 457 10.1038/ki.2008.191 18528326 Steinmetz OM, Velden J, Kneissler U, Marx M, Klein A, Helmchen U, et al. Analysis and classification of B-cell infiltrates in lupus and ANCA-associated nephritis. Kidney Int. 2008;74(4):448–57. 18528326 10.1038/ki.2008.191 87. Pei G Zeng R Han M Liao P Zhou X Li Y Renal interstitial infiltration and tertiary lymphoid organ neogenesis in IgA nephropathy Clin J Am Soc Nephrol 2014 9 2 255 264 10.2215/CJN.01150113 24262509 PMC3913227 Pei G, Zeng R, Han M, Liao P, Zhou X, Li Y, et al. Renal interstitial infiltration and tertiary lymphoid organ neogenesis in IgA nephropathy. Clin J Am Soc Nephrol. 2014;9(2):255–64. 24262509 10.2215/CJN.01150113 PMC3913227 88. Nagayama Y Yoshioka S Ichikura-Iida A Inoue T Maeda K Otani M Tubulointerstitial nephritis with IgG4-positive plasma cell infiltration and tertiary lymphoid tissue in a patient with cryoglobulinemic vasculitis: a case report CEN Case Rep 2024 13 6 534 544 10.1007/s13730-024-00884-0 38750297 PMC11608203 Nagayama Y, Yoshioka S, Ichikura-Iida A, Inoue T, Maeda K, Otani M, et al. Tubulointerstitial nephritis with IgG4-positive plasma cell infiltration and tertiary lymphoid tissue in a patient with cryoglobulinemic vasculitis: a case report. CEN Case Rep. 2024;13(6):534–44. 38750297 10.1007/s13730-024-00884-0 PMC11608203 89. Miyanaga T Mizuguchi K Hara S Zoshima T Inoue D Nishioka R Tertiary lymphoid tissue in early-stage IgG4-related tubulointerstitial nephritis incidentally detected with a tumor lesion of the ureteropelvic junction: a case report BMC Nephrol 2021 22 1 34 10.1186/s12882-021-02240-1 33468063 PMC7816437 Miyanaga T, Mizuguchi K, Hara S, Zoshima T, Inoue D, Nishioka R, et al. Tertiary lymphoid tissue in early-stage IgG4-related tubulointerstitial nephritis incidentally detected with a tumor lesion of the ureteropelvic junction: a case report. BMC Nephrol. 2021;22(1):34. 33468063 10.1186/s12882-021-02240-1 PMC7816437 90. Stock AD, Der E, Gelb S, Huang M, Weidenheim K, Ben-Zvi A, et al. Tertiary lymphoid structures in the choroid plexus in neuropsychiatric lupus. JCI Insight. 2019;4(11). 10.1172/jci.insight.124203 PMC6629135 31167973 91. Risselada AP Looije MF Kruize AA Bijlsma JW van Roon JA The role of ectopic germinal centers in the immunopathology of primary Sjögren's syndrome: a systematic review Semin Arthritis Rheum 2013 42 4 368 376 10.1016/j.semarthrit.2012.07.003 22995442 Risselada AP, Looije MF, Kruize AA, Bijlsma JW, van Roon JA. The role of ectopic germinal centers in the immunopathology of primary Sjögren’s syndrome: a systematic review. Semin Arthritis Rheum. 2013;42(4):368–76. 22995442 10.1016/j.semarthrit.2012.07.003 92. Sato Y Jain A Ohtsuki S Okuyama H Sturmlechner I Takashima Y Stem-like CD4 + Sci Transl Med 2023 15 712 eadh0380 10.1126/scitranslmed.adh0380 37672564 PMC11131576 Sato Y, Jain A, Ohtsuki S, Okuyama H, Sturmlechner I, Takashima Y, et al. Stem-like CD4 + 37672564 10.1126/scitranslmed.adh0380 PMC11131576 93. Okano M Hirahara K Kiuchi M Onoue M Iwamura C Kokubo K Interleukin-33-activated neuropeptide CGRP-producing memory Th2 cells cooperate with somatosensory neurons to induce conjunctival itch Immunity 2022 55 12 2352 68 e7 10.1016/j.immuni.2022.09.016 36272417 Okano M, Hirahara K, Kiuchi M, Onoue M, Iwamura C, Kokubo K, et al. Interleukin-33-activated neuropeptide CGRP-producing memory Th2 cells cooperate with somatosensory neurons to induce conjunctival itch. Immunity. 2022;55(12):2352–68 e7. 36272417 10.1016/j.immuni.2022.09.016 94. Shinoda K Hirahara K Iinuma T Ichikawa T Suzuki AS Sugaya K Thy1+IL-7+ lymphatic endothelial cells in iBALT provide a survival niche for memory T-helper cells in allergic airway inflammation Proc Natl Acad Sci U S A 2016 113 20 E2842 E2851 10.1073/pnas.1512600113 27140620 PMC4878506 Shinoda K, Hirahara K, Iinuma T, Ichikawa T, Suzuki AS, Sugaya K, et al. Thy1+IL-7+ lymphatic endothelial cells in iBALT provide a survival niche for memory T-helper cells in allergic airway inflammation. Proc Natl Acad Sci U S A. 2016;113(20):E2842–51. 27140620 10.1073/pnas.1512600113 PMC4878506 95. Buchheit KM Hulse KE Local immunoglobulin production in nasal tissues: A key to pathogenesis in chronic rhinosinusitis with nasal polyps and aspirin-exacerbated respiratory disease Ann Allergy Asthma Immunol 2021 126 2 127 134 10.1016/j.anai.2020.09.016 33065294 PMC8210467 Buchheit KM, Hulse KE. Local immunoglobulin production in nasal tissues: A key to pathogenesis in chronic rhinosinusitis with nasal polyps and aspirin-exacerbated respiratory disease. Ann Allergy Asthma Immunol. 2021;126(2):127–34. 33065294 10.1016/j.anai.2020.09.016 PMC8210467 96. Hwang JY Silva-Sanchez A Carragher DM Garcia-Hernandez ML Rangel-Moreno J Randall TD Inducible Bronchus-Associated Lymphoid Tissue (iBALT) Attenuates Pulmonary Pathology in a Mouse Model of Allergic Airway Disease Front Immunol 2020 11 570661 10.3389/fimmu.2020.570661 33101290 PMC7545112 Hwang JY, Silva-Sanchez A, Carragher DM, Garcia-Hernandez ML, Rangel-Moreno J, Randall TD. Inducible Bronchus-Associated Lymphoid Tissue (iBALT) Attenuates Pulmonary Pathology in a Mouse Model of Allergic Airway Disease. Front Immunol. 2020;11: 570661. 33101290 10.3389/fimmu.2020.570661 PMC7545112 97. Zheng B Ozen Z Zhang X De Silva S Marinova E Guo L CXCL13 neutralization reduces the severity of collagen-induced arthritis Arthritis Rheum 2005 52 2 620 626 10.1002/art.20768 15692971 Zheng B, Ozen Z, Zhang X, De Silva S, Marinova E, Guo L, et al. CXCL13 neutralization reduces the severity of collagen-induced arthritis. Arthritis Rheum. 2005;52(2):620–6. 15692971 10.1002/art.20768 98. Bagaeva LV Rao P Powers JM Segal BM CXC Chemokine Ligand 13 Plays a Role in Experimental Autoimmune Encephalomyelitis1 J Immunol 2006 176 12 7676 7685 10.4049/jimmunol.176.12.7676 16751415 Bagaeva LV, Rao P, Powers JM, Segal BM. CXC Chemokine Ligand 13 Plays a Role in Experimental Autoimmune Encephalomyelitis1. J Immunol. 2006;176(12):7676–85. 16751415 10.4049/jimmunol.176.12.7676 99. Huang MW Stock AD Putterman C CXCL13 Neutralization Attenuates Neuropsychiatric Manifestations in Lupus-Prone Mice Front Immunol 2021 12 763065 10.3389/fimmu.2021.763065 34868008 PMC8633419 Huang MW, Stock AD, Putterman C. CXCL13 Neutralization Attenuates Neuropsychiatric Manifestations in Lupus-Prone Mice. Front Immunol. 2021;12: 763065. 34868008 10.3389/fimmu.2021.763065 PMC8633419 100. Wieczorek G Bigaud M Pfister S Ceci M McMichael K Afatsawo C Blockade of CD40-CD154 pathway interactions suppresses ectopic lymphoid structures and inhibits pathology in the NOD/ShiLtJ mouse model of Sjogren's syndrome Ann Rheum Dis 2019 78 7 974 978 10.1136/annrheumdis-2018-213929 30902822 Wieczorek G, Bigaud M, Pfister S, Ceci M, McMichael K, Afatsawo C, et al. Blockade of CD40-CD154 pathway interactions suppresses ectopic lymphoid structures and inhibits pathology in the NOD/ShiLtJ mouse model of Sjogren’s syndrome. Ann Rheum Dis. 2019;78(7):974–8. 30902822 10.1136/annrheumdis-2018-213929 101. Kang S Fedoriw Y Brenneman EK Truong YK Kikly K Vilen BJ BAFF Induces Tertiary Lymphoid Structures and Positions T Cells within the Glomeruli during Lupus Nephritis J Immunol 2017 198 7 2602 2611 10.4049/jimmunol.1600281 28235864 PMC5360485 Kang S, Fedoriw Y, Brenneman EK, Truong YK, Kikly K, Vilen BJ. BAFF Induces Tertiary Lymphoid Structures and Positions T Cells within the Glomeruli during Lupus Nephritis. J Immunol. 2017;198(7):2602–11. 28235864 10.4049/jimmunol.1600281 PMC5360485 102. Vincent FB Morand EF Schneider P Mackay F The BAFF/APRIL system in SLE pathogenesis Nat Rev Rheumatol 2014 10 6 365 373 10.1038/nrrheum.2014.33 24614588 Vincent FB, Morand EF, Schneider P, Mackay F. The BAFF/APRIL system in SLE pathogenesis. Nat Rev Rheumatol. 2014;10(6):365–73. 24614588 10.1038/nrrheum.2014.33 103. Rodriguez AB Peske JD Woods AN Leick KM Mauldin IS Meneveau MO Immune mechanisms orchestrate tertiary lymphoid structures in tumors via cancer-associated fibroblasts Cell Rep 2021 36 3 109422 10.1016/j.celrep.2021.109422 34289373 PMC8362934 Rodriguez AB, Peske JD, Woods AN, Leick KM, Mauldin IS, Meneveau MO, et al. Immune mechanisms orchestrate tertiary lymphoid structures in tumors via cancer-associated fibroblasts. Cell Rep. 2021;36(3):109422. 34289373 10.1016/j.celrep.2021.109422 PMC8362934 104. Myette JR Kano T Suzuki H Sloan SE Szretter KJ Ramakrishnan B A Proliferation Inducing Ligand (APRIL) targeted antibody is a safe and effective treatment of murine IgA nephropathy Kidney Int 2019 96 1 104 116 10.1016/j.kint.2019.01.031 31027890 Myette JR, Kano T, Suzuki H, Sloan SE, Szretter KJ, Ramakrishnan B, et al. A Proliferation Inducing Ligand (APRIL) targeted antibody is a safe and effective treatment of murine IgA nephropathy. Kidney Int. 2019;96(1):104–16. 31027890 10.1016/j.kint.2019.01.031 105. Mathur M Barratt J Chacko B Chan TM Kooienga L Oh KH A Phase 2 Trial of Sibeprenlimab in Patients with IgA Nephropathy N Engl J Med 2024 390 1 20 31 10.1056/NEJMoa2305635 37916620 PMC7615905 Mathur M, Barratt J, Chacko B, Chan TM, Kooienga L, Oh KH, et al. A Phase 2 Trial of Sibeprenlimab in Patients with IgA Nephropathy. N Engl J Med. 2024;390(1):20–31. 37916620 10.1056/NEJMoa2305635 PMC7615905 106. A Phase 3, Multicenter, Randomized, Double-blind, Placebo-controlled Trial to Evaluate the Efficacy and Safety of Sibeprenlimab Administered Subcutaneously in Subjects With Immunoglobulin A Nephropathy [Internet]. 2022. Available from: https://clinicaltrials.gov/study/NCT05248646 107. Sato Y Yanagita M Immunology of the ageing kidney Nat Rev Nephrol 2019 15 10 625 640 10.1038/s41581-019-0185-9 31477915 Sato Y, Yanagita M. Immunology of the ageing kidney. Nat Rev Nephrol. 2019;15(10):625–40. 31477915 10.1038/s41581-019-0185-9 108. Liu Z Liang Q Ren Y Guo C Ge X Wang L Immunosenescence: molecular mechanisms and diseases Signal Transduct Target Ther 2023 8 1 200 10.1038/s41392-023-01451-2 37179335 PMC10182360 Liu Z, Liang Q, Ren Y, Guo C, Ge X, Wang L, et al. Immunosenescence: molecular mechanisms and diseases. Signal Transduct Target Ther. 2023;8(1):200. 37179335 10.1038/s41392-023-01451-2 PMC10182360 109. Ajoolabady A Pratico D Vinciguerra M Lip GYH Franceschi C Ren J Inflammaging: mechanisms and role in the cardiac and vasculature Trends Endocrinol Metab 2023 34 6 373 387 10.1016/j.tem.2023.03.005 37076375 Ajoolabady A, Pratico D, Vinciguerra M, Lip GYH, Franceschi C, Ren J. Inflammaging: mechanisms and role in the cardiac and vasculature. Trends Endocrinol Metab. 2023;34(6):373–87. 37076375 10.1016/j.tem.2023.03.005 110. Furman D Chang J Lartigue L Bolen CR Haddad F Gaudilliere B Expression of specific inflammasome gene modules stratifies older individuals into two extreme clinical and immunological states Nat Med 2017 23 2 174 184 10.1038/nm.4267 28092664 PMC5320935 Furman D, Chang J, Lartigue L, Bolen CR, Haddad F, Gaudilliere B, et al. Expression of specific inflammasome gene modules stratifies older individuals into two extreme clinical and immunological states. Nat Med. 2017;23(2):174–84. 28092664 10.1038/nm.4267 PMC5320935 111. Puzianowska-Kuznicka M Owczarz M Wieczorowska-Tobis K Nadrowski P Chudek J Slusarczyk P Interleukin-6 and C-reactive protein, successful aging, and mortality: the PolSenior study Immun Ageing 2016 13 21 10.1186/s12979-016-0076-x 27274758 PMC4891873 Puzianowska-Kuznicka M, Owczarz M, Wieczorowska-Tobis K, Nadrowski P, Chudek J, Slusarczyk P, et al. Interleukin-6 and C-reactive protein, successful aging, and mortality: the PolSenior study. Immun Ageing. 2016;13:21. 27274758 10.1186/s12979-016-0076-x PMC4891873 112. van Deursen JM The role of senescent cells in ageing Nature 2014 509 7501 439 446 10.1038/nature13193 24848057 PMC4214092 van Deursen JM. The role of senescent cells in ageing. Nature. 2014;509(7501):439–46. 24848057 10.1038/nature13193 PMC4214092 113. Baker DJ Wijshake T Tchkonia T LeBrasseur NK Childs BG van de Sluis B Clearance of p16Ink4a-positive senescent cells delays ageing-associated disorders Nature 2011 479 7372 232 236 10.1038/nature10600 22048312 PMC3468323 Baker DJ, Wijshake T, Tchkonia T, LeBrasseur NK, Childs BG, van de Sluis B, et al. Clearance of p16Ink4a-positive senescent cells delays ageing-associated disorders. Nature. 2011;479(7372):232–6. 22048312 10.1038/nature10600 PMC3468323 114. Conway J, N AD. Ageing of the gut microbiome: Potential influences on immune senescence and inflammageing. Ageing Res Rev. 2021;68:101323. 10.1016/j.arr.2021.101323 33771720 115. Yin C Mohanta SK Srikakulapu P Weber C Habenicht AJ Artery Tertiary Lymphoid Organs: Powerhouses of Atherosclerosis Immunity Front Immunol 2016 7 387 10.3389/fimmu.2016.00387 27777573 PMC5056324 Yin C, Mohanta SK, Srikakulapu P, Weber C, Habenicht AJ. Artery Tertiary Lymphoid Organs: Powerhouses of Atherosclerosis Immunity. Front Immunol. 2016;7:387. 27777573 10.3389/fimmu.2016.00387 PMC5056324 116. Polverino F Cosio BG Pons J Laucho-Contreras M Tejera P Iglesias A B Cell-Activating Factor. An Orchestrator of Lymphoid Follicles in Severe Chronic Obstructive Pulmonary Disease Am J Respir Crit Care Med 2015 192 6 695 705 10.1164/rccm.201501-0107OC 26073875 PMC4595676 Polverino F, Cosio BG, Pons J, Laucho-Contreras M, Tejera P, Iglesias A, et al. B Cell-Activating Factor. An Orchestrator of Lymphoid Follicles in Severe Chronic Obstructive Pulmonary Disease. Am J Respir Crit Care Med. 2015;192(6):695–705. 26073875 10.1164/rccm.201501-0107OC PMC4595676 117. Tahir S Fukushima Y Sakamoto K Sato K Fujita H Inoue J A CD153+CD4+ T follicular cell population with cell-senescence features plays a crucial role in lupus pathogenesis via osteopontin production J Immunol 2015 194 12 5725 5735 10.4049/jimmunol.1500319 25972477 Tahir S, Fukushima Y, Sakamoto K, Sato K, Fujita H, Inoue J, et al. A CD153+CD4+ T follicular cell population with cell-senescence features plays a crucial role in lupus pathogenesis via osteopontin production. J Immunol. 2015;194(12):5725–35. 25972477 10.4049/jimmunol.1500319 118. Rao DA Gurish MF Marshall JL Slowikowski K Fonseka CY Liu Y Pathologically expanded peripheral T helper cell subset drives B cells in rheumatoid arthritis Nature 2017 542 7639 110 114 10.1038/nature20810 28150777 PMC5349321 Rao DA, Gurish MF, Marshall JL, Slowikowski K, Fonseka CY, Liu Y, et al. Pathologically expanded peripheral T helper cell subset drives B cells in rheumatoid arthritis. Nature. 2017;542(7639):110–4. 28150777 10.1038/nature20810 PMC5349321 119. Bocharnikov AV, Keegan J, Wacleche VS, Cao Y, Fonseka CY, Wang G, et al. PD-1hiCXCR5- T peripheral helper cells promote B cell responses in lupus via MAF and IL-21. JCI Insight. 2019;4(20). 10.1172/jci.insight.130062 PMC6824311 31536480 120. Dunlap G Wagner A Meednu N Wang R Zhang F Ekabe JC Clonal associations between lymphocyte subsets and functional states in rheumatoid arthritis synovium Nat Commun 2024 15 1 4991 10.1038/s41467-024-49186-0 38862501 PMC11167034 Dunlap G, Wagner A, Meednu N, Wang R, Zhang F, Ekabe JC, et al. Clonal associations between lymphocyte subsets and functional states in rheumatoid arthritis synovium. Nat Commun. 2024;15(1):4991. 38862501 10.1038/s41467-024-49186-0 PMC11167034 121. Yoshitomi H Peripheral Helper T Cell Responses in Human Diseases Front Immunol 2022 13 946786 10.3389/fimmu.2022.946786 35880181 PMC9307902 Yoshitomi H. Peripheral Helper T Cell Responses in Human Diseases. Front Immunol. 2022;13: 946786. 35880181 10.3389/fimmu.2022.946786 PMC9307902 122. Koenig A Thaunat O Lymphoid Neogenesis and Tertiary Lymphoid Organs in Transplanted Organs Front Immunol 2016 7 646 10.3389/fimmu.2016.00646 28082981 PMC5186756 Koenig A, Thaunat O. Lymphoid Neogenesis and Tertiary Lymphoid Organs in Transplanted Organs. Front Immunol. 2016;7:646. 28082981 10.3389/fimmu.2016.00646 PMC5186756 123. Cho H Choi JO Jeon ES Kim JS Quilty Lesions in the Endomyocardial Biopsies after Heart Transplantation J Pathol Transl Med 2019 53 1 50 56 10.4132/jptm.2018.11.30 30586951 PMC6344801 Cho H, Choi JO, Jeon ES, Kim JS. Quilty Lesions in the Endomyocardial Biopsies after Heart Transplantation. J Pathol Transl Med. 2019;53(1):50–6. 30586951 10.4132/jptm.2018.11.30 PMC6344801 124. Motallebzadeh R Rehakova S Conlon TM Win TS Callaghan CJ Goddard M Blocking lymphotoxin signaling abrogates the development of ectopic lymphoid tissue within cardiac allografts and inhibits effector antibody responses FASEB J 2012 26 1 51 62 10.1096/fj.11-186973 21926237 Motallebzadeh R, Rehakova S, Conlon TM, Win TS, Callaghan CJ, Goddard M, et al. Blocking lymphotoxin signaling abrogates the development of ectopic lymphoid tissue within cardiac allografts and inhibits effector antibody responses. FASEB J. 2012;26(1):51–62. 21926237 10.1096/fj.11-186973 125. Thaunat O Patey N Caligiuri G Gautreau C Mamani-Matsuda M Mekki Y Chronic rejection triggers the development of an aggressive intragraft immune response through recapitulation of lymphoid organogenesis J Immunol 2010 185 1 717 728 10.4049/jimmunol.0903589 20525884 Thaunat O, Patey N, Caligiuri G, Gautreau C, Mamani-Matsuda M, Mekki Y, et al. Chronic rejection triggers the development of an aggressive intragraft immune response through recapitulation of lymphoid organogenesis. J Immunol. 2010;185(1):717–28. 20525884 10.4049/jimmunol.0903589 126. Zhang G, Feizi N, Zhao D, Halesha L, Williams AL, Randhawa PS, et al. Lymphotoxin beta receptor and tertiary lymphoid organs shape acute and chronic allograft rejection. JCI Insight. 2024;9(15). 10.1172/jci.insight.177555 PMC11383591 38954463 127. Cai J Deng J Gu W Ni Z Liu Y Kamra Y Impact of Local Alloimmunity and Recipient Cells in Transplant Arteriosclerosis Circ Res 2020 127 8 974 993 10.1161/CIRCRESAHA.119.316470 32689904 Cai J, Deng J, Gu W, Ni Z, Liu Y, Kamra Y, et al. Impact of Local Alloimmunity and Recipient Cells in Transplant Arteriosclerosis. Circ Res. 2020;127(8):974–93. 32689904 10.1161/CIRCRESAHA.119.316470 128. Thaunat O Patey N Gautreau C Lechaton S Fremeaux-Bacchi V Dieu-Nosjean MC B cell survival in intragraft tertiary lymphoid organs after rituximab therapy Transplantation 2008 85 11 1648 1653 10.1097/TP.0b013e3181735723 18551073 Thaunat O, Patey N, Gautreau C, Lechaton S, Fremeaux-Bacchi V, Dieu-Nosjean MC, et al. B cell survival in intragraft tertiary lymphoid organs after rituximab therapy. Transplantation. 2008;85(11):1648–53. 18551073 10.1097/TP.0b013e3181735723 129. Miyajima M Chase CM Alessandrini A Farkash EA Della Pelle P Benichou G Early acceptance of renal allografts in mice is dependent on foxp3(+) cells Am J Pathol 2011 178 4 1635 1645 10.1016/j.ajpath.2010.12.024 21435448 PMC3078464 Miyajima M, Chase CM, Alessandrini A, Farkash EA, Della Pelle P, Benichou G, et al. Early acceptance of renal allografts in mice is dependent on foxp3(+) cells. Am J Pathol. 2011;178(4):1635–45. 21435448 10.1016/j.ajpath.2010.12.024 PMC3078464 130. Rosales IA Yang C Farkash EA Ashry T Ge J Aljabban I Novel intragraft regulatory lymphoid structures in kidney allograft tolerance Am J Transplant 2022 22 3 705 716 10.1111/ajt.16880 34726836 Rosales IA, Yang C, Farkash EA, Ashry T, Ge J, Aljabban I, et al. Novel intragraft regulatory lymphoid structures in kidney allograft tolerance. Am J Transplant. 2022;22(3):705–16. 34726836 10.1111/ajt.16880 131. Guinn MT Szuter ES Yokose T Ge J Rosales IA Chetal K Intragraft B cell differentiation during the development of tolerance to kidney allografts is associated with a regulatory B cell signature revealed by single cell transcriptomics Am J Transplant 2023 23 9 1319 1330 10.1016/j.ajt.2023.05.036 37295719 PMC11232115 Guinn MT, Szuter ES, Yokose T, Ge J, Rosales IA, Chetal K, et al. Intragraft B cell differentiation during the development of tolerance to kidney allografts is associated with a regulatory B cell signature revealed by single cell transcriptomics. Am J Transplant. 2023;23(9):1319–30. 37295719 10.1016/j.ajt.2023.05.036 PMC11232115 132. Yokose T, Szuter ES, Rosales I, Guinn MT, Liss AS, Baba T, et al. Dysfunction of infiltrating cytotoxic CD8+ T cells within the graft promotes murine kidney allotransplant tolerance. J Clin Invest. 2024;134(16). 10.1172/JCI179709 PMC11324304 38888968 133. Li W Bribriesco AC Nava RG Brescia AA Ibricevic A Spahn JH Lung transplant acceptance is facilitated by early events in the graft and is associated with lymphoid neogenesis Mucosal Immunol 2012 5 5 544 554 10.1038/mi.2012.30 22549742 PMC3425714 Li W, Bribriesco AC, Nava RG, Brescia AA, Ibricevic A, Spahn JH, et al. Lung transplant acceptance is facilitated by early events in the graft and is associated with lymphoid neogenesis. Mucosal Immunol. 2012;5(5):544–54. 22549742 10.1038/mi.2012.30 PMC3425714 134. Li W Gauthier JM Higashikubo R Hsiao HM Tanaka S Vuong L Bronchus-associated lymphoid tissue-resident Foxp3+ T lymphocytes prevent antibody-mediated lung rejection J Clin Invest 2019 129 2 556 568 10.1172/JCI122083 30561386 PMC6355223 Li W, Gauthier JM, Higashikubo R, Hsiao HM, Tanaka S, Vuong L, et al. Bronchus-associated lymphoid tissue-resident Foxp3+ T lymphocytes prevent antibody-mediated lung rejection. J Clin Invest. 2019;129(2):556–68. 30561386 10.1172/JCI122083 PMC6355223 135. Li Z Jiang Y Li B Han Z Shen J Xia Y Development and Validation of a Machine Learning Model for Detection and Classification of Tertiary Lymphoid Structures in Gastrointestinal Cancers JAMA Netw Open 2023 6 1 e2252553 10.1001/jamanetworkopen.2022.52553 36692877 PMC10408275 Li Z, Jiang Y, Li B, Han Z, Shen J, Xia Y, et al. Development and Validation of a Machine Learning Model for Detection and Classification of Tertiary Lymphoid Structures in Gastrointestinal Cancers. JAMA Netw Open. 2023;6(1):e2252553. 36692877 10.1001/jamanetworkopen.2022.52553 PMC10408275 136. Cheng C Li B Li J Wang Y Xiao H Lian X Multi-stain deep learning prediction model of treatment response in lupus nephritis based on renal histopathology Kidney Int 2025 107 4 714 727 10.1016/j.kint.2024.12.007 39733792 Cheng C, Li B, Li J, Wang Y, Xiao H, Lian X, et al. Multi-stain deep learning prediction model of treatment response in lupus nephritis based on renal histopathology. Kidney Int. 2025;107(4):714–27. 39733792 10.1016/j.kint.2024.12.007 137. Zhao X Wang Y Xue M Ding Y Zhang H Wang K Preoperative assessment of tertiary lymphoid structures in stage I lung adenocarcinoma using CT radiomics: a multicenter retrospective cohort study Cancer Imaging 2024 24 1 167 10.1186/s40644-024-00813-5 39696659 PMC11654080 Zhao X, Wang Y, Xue M, Ding Y, Zhang H, Wang K, et al. Preoperative assessment of tertiary lymphoid structures in stage I lung adenocarcinoma using CT radiomics: a multicenter retrospective cohort study. Cancer Imaging. 2024;24(1):167. 39696659 10.1186/s40644-024-00813-5 PMC11654080 138. Long S, Li M, Chen J, Zhong L, Abudulimu A, Zhou L, et al. Spatial patterns and MRI-based radiomic prediction of high peritumoral tertiary lymphoid structure density in hepatocellular carcinoma: a multicenter study. J Immunother Cancer. 2024;12(12). 10.1136/jitc-2024-009879 PMC11647298 39675785 139. Bechman K Dalrymple A Southey-Bassols C Cope AP Galloway JB A systematic review of CXCL13 as a biomarker of disease and treatment response in rheumatoid arthritis BMC Rheumatol 2020 4 1 70 10.1186/s41927-020-00154-3 33292827 PMC7604968 Bechman K, Dalrymple A, Southey-Bassols C, Cope AP, Galloway JB. A systematic review of CXCL13 as a biomarker of disease and treatment response in rheumatoid arthritis. BMC Rheumatol. 2020;4(1):70. 33292827 10.1186/s41927-020-00154-3 PMC7604968 140. Pan Z Zhu T Liu Y Zhang N Role of the CXCL13/CXCR5 Axis in Autoimmune Diseases Front Immunol 2022 13 850998 10.3389/fimmu.2022.850998 35309354 PMC8931035 Pan Z, Zhu T, Liu Y, Zhang N. Role of the CXCL13/CXCR5 Axis in Autoimmune Diseases. Front Immunol. 2022;13: 850998. 35309354 10.3389/fimmu.2022.850998 PMC8931035 141. Pierson SK Katz L Williams R Mumau M Gonzalez M Guzman S CXCL13 is a predictive biomarker in idiopathic multicentric Castleman disease Nat Commun 2022 13 1 7236 10.1038/s41467-022-34873-7 36433996 PMC9700691 Pierson SK, Katz L, Williams R, Mumau M, Gonzalez M, Guzman S, et al. CXCL13 is a predictive biomarker in idiopathic multicentric Castleman disease. Nat Commun. 2022;13(1):7236. 36433996 10.1038/s41467-022-34873-7 PMC9700691 142. Fortea-Gordo P Nuno L Villalba A Peiteado D Monjo I Sanchez-Mateos P Two populations of circulating PD-1hiCD4 T cells with distinct B cell helping capacity are elevated in early rheumatoid arthritis Rheumatology (Oxford) 2019 58 9 1662 1673 10.1093/rheumatology/kez169 31056653 Fortea-Gordo P, Nuno L, Villalba A, Peiteado D, Monjo I, Sanchez-Mateos P, et al. Two populations of circulating PD-1hiCD4 T cells with distinct B cell helping capacity are elevated in early rheumatoid arthritis. Rheumatology (Oxford). 2019;58(9):1662–73. 31056653 10.1093/rheumatology/kez169 143. Li H Lin WP Zhang ZN Sun ZJ Tailoring biomaterials for monitoring and evoking tertiary lymphoid structures Acta Biomater 2023 172 1 15 10.1016/j.actbio.2023.09.028 37739247 Li H, Lin WP, Zhang ZN, Sun ZJ. Tailoring biomaterials for monitoring and evoking tertiary lymphoid structures. Acta Biomater. 2023;172:1–15. 37739247 10.1016/j.actbio.2023.09.028 144. Rao A Barkley D França GS Yanai I Exploring tissue architecture using spatial transcriptomics Nature 2021 596 7871 211 220 10.1038/s41586-021-03634-9 34381231 PMC8475179 Rao A, Barkley D, França GS, Yanai I. Exploring tissue architecture using spatial transcriptomics. Nature. 2021;596(7871):211–20. 34381231 10.1038/s41586-021-03634-9 PMC8475179 ",
  "metadata": {
    "Title of this paper": "Exploring tissue architecture using spatial transcriptomics",
    "Journal it was published in:": "Inflammation and Regeneration",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486510/"
  }
}