{
  "title": "Paper_1",
  "abstract": "pmc Int J Endocrinol Int J Endocrinol 995 ijendocrin ije International Journal of Endocrinology 1687-8337 1687-8345 Wiley PMC12496152 PMC12496152.1 12496152 12496152 10.1155/ije/1438786 1 Research Article Ultrasound-Guided Radiofrequency Ablation for Papillary Thyroid Microcarcinoma: Efficacy and Safety in a Cross-Country Multicenter Retrospective Study https://orcid.org/0000-0002-1326-0587 Lin Wei-Che  1  2  3  4  5 https://orcid.org/0000-0003-4952-8546 Chen Chi-Cheng  1  2  3 https://orcid.org/0000-0002-4922-7500 Wu Yi-Ju  6 https://orcid.org/0000-0002-8811-9203 Wu Ming-Hsun  7 https://orcid.org/0000-0003-3883-2104 Cheng Kai-Lun  8  9  10 https://orcid.org/0000-0002-2334-5621 Wang Wen-Hung evan_travel@hotmail.com  11  12  13  14 https://orcid.org/0000-0002-4325-9712 My Le Thi phuthuy87@gmail.com  15  1  2  3  4  5  6  7  8  9  10  11  12  13  14  15 Academic Editor: Suraiya Saleem 2025 27 9 2025 2025 480726 1438786 4 1 2025 24 7 2025 29 8 2025 27 09 2025 05 10 2025 05 10 2025 Copyright © 2025 Wei-Che Lin et al. International Journal of Endocrinology published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited.  Objectives:  Materials and Methods: t t  Results: p p p  Conclusions: Keywords papillary thyroid microcarcinoma (PTMC) radiofrequency ablation (RFA) thyroid ultrasound (US)-guided Chang Gung Medical Research Program CMRPG8N1472 CMRPG8N1091 This study was supported by the Chang Gung Medical Research Program (grant numbers CMRPG8N1472, CMRPG8N1091). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Over the last 3 decades, thyroid cancer has emerged as one of the fastest-growing malignancies globally, with papillary thyroid carcinoma (PTC) being the primary contributor to the rapidly increasing number of diagnoses in many parts of the world, including the United States, Taiwan, and Vietnam [ 1 4 5 6 According to the 2015 American Thyroid Association (ATA) guidelines [ 7 8 9 10 Due to the low-risk course of PTMC, active surveillance has also been adopted as an alternative approach for patients, as it bears no complications and offers a similar outcome to immediate surgery [ 7 9 11 In recent years, the importance of functional preservation in the treatment of thyroid disease has been growing. Thus, several alternative minimally invasive techniques have been proposed for treating PTMC, including ultrasound (US)-guided microwave ablation [ 12 14 15 17 18 24 8 25 In Asia, several countries including Korea [ 22 23 18 21 24 23 13 2. Materials and Methods 2.1. Patients The study protocol was reviewed and approved by the Research Ethics Committee of Chang Gung Memorial Hospital (IRB no. 202301622B0), and it adhered to the Declaration of Helsinki principles and the International Conference on Harmonization for Good Clinical Practice. Signed informed consent was waived as personal patient data were thoroughly deidentified in this retrospective study. This retrospective study reviewed all patients with pathology-proven PTC who received US-guided RFA at 6 medical centers in Taiwan and Vietnam between November 2017 and April 2022. The baseline data of all patients, including clinical characteristics, nodular parameters, and laboratory results, were collected prior to the RFA treatment from medical records. All patients provided informed consent before each procedure. 2.2. Inclusion and Exclusion Criteria The inclusion criteria for RFA treatment were (1) solitary or multiple PTCs confirmed by US-guided fine-needle aspiration (FNA); (2) no imaging findings indicating evidence of extrathyroidal extension, lymph node metastasis, or distant metastasis on both US and head and neck computed tomography (CT) scans; (3) no abnormal findings of vocal cord paralysis during laryngoscopy examination; (4) no abnormal coagulation function test; and (5) refusal or ineligibility for surgery. The exclusion criteria for this study were as follows: (1) PTC with a maximal diameter greater than 10 mm; (2) previous history of malignant thyroid disease or other malignant disease; and (3) incomplete follow-up data (lost to follow-up before 6 months). The CONSORT flow diagram is shown in Figure 1 2.3. Preablation Assessment CT scans were performed to assess the size and extension of PTMC tumors and to exclude cervical lymph node metastasis or distant metastasis. On the day of the RFA procedure, US was used to record the three orthogonal tumoral diameters, volume, location, and microcalcification. Equation V πabc V a b c Prior to RFA, laboratory examinations were conducted, including platelet count, blood coagulation test, serum thyroglobulin, thyroid function test, and thyroglobulin antibody test. 2.4. Ablation Technique The RFA procedures were all performed in an outpatient setting. All patients received a single RFA session regardless of presenting with a singular or multiple PTMCs. The ablation procedures were performed by 5 individual radiologists, each with over 10 years of experience in US-guided procedures. Prior to the RFA procedure, a mixed solution of local anesthesia (including 2% lidocaine hydrochloride, epinephrine, and sodium bicarbonate) was injected at the puncture site and around the thyroid gland [ 26 The electrode tip size was chosen according to US examination guidelines. The PTMCs were approached via the trans-isthmic route, with the electrode penetrating the thyroid parenchyma and inserted through the deepest and most distant part of the tumors using the moving shot technique [ 27 24 26 2.5. Follow-Up Evaluations After the RFA procedure, all patients were kept under observation in the hospital for at least 30 min to monitor for potential complications. The Society of Interventional Radiology terminology was used to assess major and minor complications [ 28 Post-RFA follow-up US evaluations for changes in tumor size, volume reduction ratio (VRR), tumor recurrence, and disease progression, including cervical lymph node and distant metastasis, were performed at 1, 3, 6, 9, and 12 months, and yearly thereafter. The VRR was calculated using the following equation: VRR (%) = initial volume (mL)—final volume (mL) × 100/initial volume. Complete disappearance of the tumor was defined as the treated area becoming only a linear scar or could no longer be measured. Follow-up contrast-enhanced CT was performed at the 6 month to 1 year post-RFA follow-up to assess the volume of the ablated area and the possibility of tumor recurrence, newly developed cancer, lymph node metastasis or distant metastasis. Regular clinical follow-ups and serum thyroglobulin laboratory examinations were also performed on a regular basis. If the area treated with RFA was still visible at the 6 month follow-up, a US-guided FNA biopsy would be performed to evaluate the effectiveness of the RFA procedure and to confirm that there was no remaining viable tumor in the treated area. If any unusual imaging results were detected during follow-up, such as a larger treated area that may indicate remaining viable tumor cells, new nodules, or distant metastasis, an FNA would be carried out for further investigation. This applied to all follow-up appointments except for the 1-month follow-up. 2.6. Analyses and Statistics The statistical analyses were performed using SPSS software for Windows (version 26.0, SPSS, Inc., Chicago, IL, USA). Categorical variables were presented as frequencies and percentages, and continuous variables were presented as mean ± standard deviation (SD). Repeated measures the General Lineal Model (GLM) was used to analyze individual-group and between-group (Taiwan versus Vietnam) differences among volume and VRR from baseline to the end of follow-up. Student's t t p 3. Results The baseline clinical characteristics of the patients and the PTMCs are summarized in Table 1 Table 2 Figure 2 3.1. Baseline Clinical Characteristics The study population consisted of 206 patients with a total of 224 tumors, of which 188 patients had a single tumor and 18 patients had two tumors ( Table 1 p p p p 3.2. Overall Tumor Changes The mean tumoral size at baseline and at each follow-up is presented in Table 2 Figure 2(a) p p p 3.3. Subgroup Analysis by Country A comparison between Taiwan and Vietnam showed significant differences in baseline tumor size. The mean longest diameter (Taiwan: 7.44 ± 2.22 mm; Vietnam: 5.61 ± 1.62 mm) and baseline tumor volume (Taiwan: 0.18 ± 0.17 mL; Vietnam: 0.07 ± 0.06 mL) were both significantly larger in Taiwan ( p p p p p Table 2 Figure 2(a) Repeated measures ANOVA confirmed a significant effect of time on tumor volume in both countries (Taiwan: F(2.190, 78.835) = 40.875, p p p p p The mean VRRs at each follow-up are presented in Table 2 Figure 2(b) p p p Figure 2(b) Repeated measures ANOVA confirmed a significant time effect on VRR in both countries (Taiwan: F(1.146, 41.267) = 20.779, p p p F p p 3.4. Subgroup Analysis by Center Volume A post hoc analysis was conducted to compare clinical outcomes between high-volume centers (≥ 50 cases) and low-volume centers (< 50 cases). High-volume centers included Centers No. 1, No. 5, and No. 6, with Centers No. 5 and No. 6 grouped together due to sharing the same operator and clinical protocols. Low-volume centers included Centers No. 2, No. 3, and No. 4. The results are summarized in Table 3 While low-volume centers demonstrated higher early volume reduction at 6 months and treated slightly larger tumors at baseline ( p p p p 3.5. Complications and Disease Progression Four patients in Vietnam reported transient hoarseness as complications, all of whom recovered without sequela within 2 months. The patients in this study did not experience any other major complications, such as hematoma, skin burn, nodule rupture, or recurrent laryngeal nerve injuries. All patients maintained normal thyroid function after the RFA treatment. At the 6 month follow-up, 135 patients (65.9%) underwent repeat US-guided FNA due to persistent hypoechoic appearance or incomplete resolution of the treated nodule on US ( Table 1 In our study, we noted one case of lymph node metastasis as disease progression in a 26-year-old Taiwanese male who received RFA for a single PTMC tumor located at the right thyroid bed. The original tumor had a longest diameter of 9 mm and a baseline volume of 0.23 mL. At the 6-month follow-up, the tumor size had decreased to 0.08 mL, with a VRR of 65.22%. However, a newly discovered ipsilateral neck lymph node was detected by CT at the 6 month follow-up, which was confirmed as metastatic by US-guided FNA. The patient subsequently underwent additional RFA for the metastatic lymph node, and no evidence of recurrent disease or distant metastasis was observed during continued follow-up through 24 months. 4. Discussion The current study is, to the best of our knowledge, the first international (cross-country) evaluation and comparison of the therapeutic efficacy and clinical safety of RFA for PTMC. Our findings demonstrate that while short-term follow-up results may exhibit differences, no distinction exists with a longer follow-up time in terms of the efficacy of RFA for PTMC patients, regardless of distinct national treatment settings, healthcare system, or equipment operator. The findings of this study indicate that RFA treatment is notably effective in PTMC patients ( Figure 3 16 20 29 Previous studies of the surgical option have reported a 1%–6% recurrence rate [ 30 31 32 In this study, we observed a statistical difference in the mean baseline tumor volume between Taiwan and Vietnam, which impacted the tumor volume results at each follow-up. More specifically, the tumors reported in Vietnam had a smaller mean baseline volume, resulting in a faster volume reduction rate, achieving a VRR of 91.33% at the 12 month follow-up; meanwhile, in Taiwan the 12 month follow-up showed a VRR of 83.32% and further achieved a VRR of 95.23% at the 24 month follow-up. Furthermore, Taiwan showed a lower complete disappearance rate (53.6%) at the 12 month follow-up compared to Vietnam (86.7%), although a similar complete disappearance rate at the 24 month follow-up (Taiwan 98.3% vs. Vietnam 100%). This result could be attributed to the relatively larger ablation zone required as a safety margin for the larger tumors in Taiwan, which subsequently influenced the VRR and complete disappearance rate. We also observed a statistical difference in the mean longest diameter between Taiwan and Vietnam, with the measurement being close to 5 mm in Vietnam and approximately 2 mm larger in Taiwan. Of note, recent studies have suggested that PTMC with a tumor size > 5 mm could be a possible predictive factor of tumor recurrence [ 33 34 Additionally, we conducted a post hoc analysis to compare treatment outcomes between high-volume centers (≥ 50 cases) and low-volume centers (< 50 cases). The findings support the feasibility of achieving consistent treatment outcomes across centers of varying case volumes, provided that procedures are performed by trained operators following standardized protocols, even if early post-treatment response patterns may differ. We also noted a statistical difference in the mean patient age between Taiwan and Vietnam. Patient age at the time of a thyroid cancer diagnosis is considered a crucial prognostic factor for survival, with an age cut-off of 55 years noted in the American Joint Committee on Cancer (AJCC) staging system for differentiated thyroid cancer [ 35 36 Although there is currently no formal population-based screening program for thyroid cancer in either Taiwan or Vietnam, routine thyroid US examinations are commonly included in elective health check-up packages offered by both commercial and hospital institutions, supported by the widespread availability and affordability of sonography. Local clinicians have noted that the frequent use of neck US has contributed to increased detection of small thyroid nodules, leading to a rise in US-guided FNAs and a corresponding increase in thyroid cancer diagnoses over the past 2 decades [ 3 4 While the 2015 ATA guidelines discourage routine FNA for TR-5 nodules < 1 cm, clinicians in our institutions may still perform FNA in selected cases when patients express anxiety or have a relevant family history. This approach aligns with a broader regional consensus in Asia, where guidelines recommend FNA for nodules measuring ≥ 5 mm when high-suspicion features are present on US. For example, the Korean Society of Thyroid Radiology recommends biopsy of category 4 or 5 K-TIRADS nodules ≥ 5 mm in the presence of additional risk factors such as suspicious lymph nodes or extrathyroidal extension [ 37 Although early detection of PTMC enables minimally invasive treatment options, this de facto screening practice raises important concerns regarding potential overdiagnosis and the appropriate use of healthcare resources, particularly for PTMCs measuring 5–7 mm. We acknowledge this ongoing debate and would like to emphasize the importance of shared decision-making and individualized risk stratification to balance the benefits of early intervention with the risk of overtreatment. This study has several limitations. First, the relatively short follow-up duration is a major limitation of our study, with 70.4% of tumors monitored for over 12 months. While this allowed for meaningful assessment of short- to mid-term outcomes, an extended follow-up report is necessary to allow comparison with active surveillance studies, which reported a progression rate of 3%–5% at 5 years [ 38 Second, as a retrospective study, it has inherent limitations including potential selection bias and lack of randomization. Third, the study enrolled a relatively small number of patients. There was also heterogeneity in terms of the number of tumors treated at the different medical centers ( Table 1 5. Conclusion We herein demonstrate that US-guided RFA is an established and reliable treatment option which is safe and effective for patients with PTMC, regardless of differences in terms of the individual operator, medical environment, and sociosystemic setting between Taiwan and Vietnam. The low complication rate and high success rate in achieving complete tumor ablation make RFA a promising minimally invasive alternative to surgery for PTMC. Acknowledgments The authors acknowledge that preliminary findings of this study were presented at the American Society of Neuroradiology (ASNR) 2023 Annual Meeting [ 39 Data Availability Statement Some or all datasets generated during and/or analyzed during the current study are not publicly available but are available from the corresponding authors on reasonable request. Conflicts of Interest The authors declare no conflicts of interest. Author Contributions Wei-Che Lin and Chi-Cheng Chen contributed equally to this work and are the co-first authors. Wen-Hung Wang and Le Thi My contributed equally to this work and share the role of corresponding authors. 1 Morris L. G. Sikora A. G. Tosteson T. D. Davies L. The Increasing Incidence of Thyroid Cancer: the Influence of Access to Care Thyroid 2013 July 23 7 885 891 10.1089/thy.2013.0045 2-s2.0-84881464304 23517343 PMC3704124 2 Miranda-Filho A. Lortet-Tieulent J. Bray F. Thyroid Cancer Incidence Trends by Histology in 25 Countries: A Population-based Study Lancet Diabetes & Endocrinology 2021 April 9 4 225 234 10.1016/S2213-8587(21)00027-9 33662333 3 Lee K. L. Chen T. J. Won G. S. The Use of Fine Needle Aspiration and Trends in Incidence of Thyroid Cancer in Taiwan Journal of the Chinese Medical Association 2018 February 81 2 164 169 10.1016/j.jcma.2017.09.008 2-s2.0-85034666720 29174930 4 Pham D. X. Nguyen H. D. Phung A. H. T. Trends in Incidence and Histological Pattern of Thyroid Cancer in Ho Chi Minh City, Vietnam (1996–2015): A Population-Based Study BMC Cancer 2021 March 21 1 p. 296 10.1186/s12885-021-08023-z PMC7981942 33743620 5 Leboulleux S. Tuttle R. M. Pacini F. Schlumberger M. Papillary Thyroid Microcarcinoma: Time to Shift From Surgery to Active Surveillance? Lancet Diabetes & Endocrinology 2016 November 4 11 933 942 10.1016/S2213-8587(16)30180-2 2-s2.0-84994099387 27550849 6 Yu X. M. Wan Y. Sippel R. S. Chen H. Should all Papillary Thyroid Microcarcinomas be Aggressively Treated? An Analysis of 18,445 Cases Annals of Surgery 2011 October 254 4 653 660 10.1097/SLA.0b013e318230036d 2-s2.0-80053272812 21876434 7 Haugen B. R. American Thyroid Association Management Guidelines for Adult Patients With Thyroid Nodules and Differentiated Thyroid Cancer: What is New and What has Changed? Cancer 2017 February 123 3 372 381 10.1002/cncr.30360 2-s2.0-84995390633 27741354 8 Kim J. H. Baek J. H. Lim H. K. 2017 Thyroid Radiofrequency Ablation Guideline: Korean Society of Thyroid Radiology Korean Journal of Radiology 2018 August 19 4 632 655 10.3348/kjr.2018.19.4.632 2-s2.0-85048632211 29962870 PMC6005940 9 Filetti S. Durante C. Hartl D. Thyroid Cancer: ESMO Clinical Practice Guidelines for Diagnosis, Treatment and Follow-Up Annals of Oncology 2019 December 30 12 1856 1883 10.1093/annonc/mdz400 31549998 10 Weiss A. Parina R. P. Tang J. A. Brumund K. T. Chang D. C. Bouvet M. Outcomes of Thyroidectomy From a Large California State Database The American Journal of Surgery 2015 December 210 6 1170 1177 10.1016/j.amjsurg.2015.08.011 2-s2.0-84955485041 26482517 11 Yoshida Y. Horiuchi K. Okamoto T. Patients’ View on the Management of Papillary Thyroid Microcarcinoma: Active Surveillance or Surgery Thyroid 2020 May 30 5 681 687 10.1089/thy.2019.0420 31910100 PMC7232659 12 Teng D. K. Li W. H. Du J. R. Wang H. Yang D. Y. Wu X. L. Effects of Microwave Ablation on Papillary Thyroid Microcarcinoma: A Five-Year Follow-Up Report Thyroid 2020 December 30 12 1752 1758 10.1089/thy.2020.0049 32458748 13 Cao X. J. Yu M. A. Zhu Y. L. Ultrasound-Guided Thermal Ablation for Papillary Thyroid Microcarcinoma: A Multicenter Retrospective Study International Journal of Hyperthermia 2021 38 1 916 922 10.1080/02656736.2021.1936218 34148494 14 Wang X. Niu X. Mu S. Analysis and Evaluation of the Efficacy of Ultrasound-Guided Microwave Ablation for Papillary Thyroid Microcarcinoma International Journal of Hyperthermia 2021 38 1 1476 1485 10.1080/02656736.2021.1988152 34645358 15 Kim H. J. Chung S. M. Kim H. Long-Term Efficacy of Ultrasound-Guided Laser Ablation for Papillary Thyroid Microcarcinoma: Results of a 10-Year Retrospective Study Thyroid 2021 November 31 11 1723 1729 10.1089/thy.2021.0151 34445885 16 Juan Z. Yongping L. Han X. A 5-Year Follow-Up Study on the Efficacy and Safety of Ultrasound-Guided Laser Ablation in Elderly Patients With Papillary Thyroid Microcarcinoma: A Retrospective, Single-Center Study From China Frontiers in Endocrinology 2022 13 p. 972589 10.3389/fendo.2022.972589 36407301 PMC9671076 17 Peng K. Zhou P. Liu W. Long-Term Efficacy of Ultrasound-Guided Percutaneous Laser Ablation for Low-Risk Papillary Thyroid Microcarcinoma: A 5-Year Follow-Up Study BioMed Research International 2021 2021 1 p. 6616826 10.1155/2021/6616826 PMC8324339 34337037 18 Yan L. Lan Y. Xiao J. Lin L. Jiang B. Luo Y. Long-Term Outcomes of Radiofrequency Ablation for Unifocal low-risk Papillary Thyroid Microcarcinoma: A Large Cohort Study of 414 Patients European Radiology 2021 February 31 2 685 694 10.1007/s00330-020-07128-6 32813103 19 Zhu Y. Che Y. Gao S. Long-Term Follow-Up Results of PTMC Treated by Ultrasound-Guided Radiofrequency Ablation: A Retrospective Study International Journal of Hyperthermia 2021 38 1 1225 1232 10.1080/02656736.2021.1963850 34402363 20 Wu R. Luo Y. Tang J. Ultrasound-Guided Radiofrequency Ablation for Papillary Thyroid Microcarcinoma: A Retrospective Analysis of 198 Patients International Journal of Hyperthermia 2020 37 1 168 174 10.1080/02656736.2019.1708480 32026736 21 Zhang M. Luo Y. Zhang Y. Tang J. Efficacy and Safety of Ultrasound-Guided Radiofrequency Ablation for Treating Low-Risk Papillary Thyroid Microcarcinoma: A Prospective Study Thyroid 2016 November 26 11 1581 1587 10.1089/thy.2015.0471 2-s2.0-84994156580 27445090 22 Cho S. J. Baek S. M. Lim H. K. Lee K. D. Son J. M. Baek J. H. Long-Term Follow-Up Results of Ultrasound-Guided Radiofrequency Ablation for Low-Risk Papillary Thyroid Microcarcinoma: More Than 5-Year Follow-Up for 84 Tumors Thyroid 2020 December 30 12 1745 1751 10.1089/thy.2020.0106 32375570 23 Lim H. K. Cho S. J. Baek J. H. US-Guided Radiofrequency Ablation for Low-Risk Papillary Thyroid Microcarcinoma: Efficacy and Safety in a Large Population Korean Journal of Radiology 2019 December 20 12 1653 1661 10.3348/kjr.2019.0192 31854153 PMC6923213 24 Lim L. S. Lin W. C. Chiang P. L. One Year Follow-Up of US-Guided Radiofrequency Ablation for Low-Risk Papillary Thyroid Microcarcinoma: The First Experience in Taiwan Journal of the Formosan Medical Association 2022 August 121 8 1406 1413 10.1016/j.jfma.2021.09.026 34657768 25 Mauri G. Hegedus L. Bandula S. European Thyroid Association and Cardiovascular and Interventional Radiological Society of Europe 2021 Clinical Practice Guideline for the Use of Minimally Invasive Treatments in Malignant Thyroid Lesions European Thyroid Journal 2021 June 10 3 185 197 10.1159/000516469 34178704 PMC8215982 26 Chen C. C. Chen H. L. Chiang P. L. Efficacy and Safety of Radiofrequency Ablation for Primary and Secondary Hyperparathyroidism With or Without Previous Parathyroidectomy: A Retrospective Study International Journal of Hyperthermia 2022 39 1 907 917 10.1080/02656736.2022.2097324 35848429 27 Ha E. J. Baek J. H. Lee J. H. Moving-Shot Versus Fixed Electrode Techniques for Radiofrequency Ablation: Comparison in an Ex-Vivo Bovine Liver Tissue Model Korean Journal of Radiology 2014 December 15 6 836 843 10.3348/kjr.2014.15.6.836 2-s2.0-84908662137 25469097 PMC4248641 28 Sacks D. McClenny T. E. Cardella J. F. Lewis C. A. Society of Interventional Radiology Clinical Practice Guidelines Journal of Vascular and Interventional Radiology 2003 September 14 9 S199 S202 10.1097/01.rvi.0000094584.83406.3e 2-s2.0-3242877827 14514818 29 Ito Y. Miyauchi A. Inoue H. An Observational Trial for Papillary Thyroid Microcarcinoma in Japanese Patients World Journal of Surgery 2010 January 34 1 28 35 10.1007/s00268-009-0303-0 2-s2.0-73649127207 20020290 30 Mazzaferri E. L. Management of Low-Risk Differentiated Thyroid Cancer Endocrine Practice 2007 September 13 5 498 512 10.4158/EP.13.5.498 2-s2.0-35148819235 17872353 31 Li Y. J. Wang Y. Z. Yi Z. B. Chen L. L. Zhou X. D. Comparison of Completion Thyroidectomy and Primary Total Surgery for Differentiated Thyroid Cancer: A Meta-Analysis Oncology Research and Treatment 2015 38 10 528 531 10.1159/000440690 2-s2.0-84944677939 26451702 32 Yan L. Zhang M. Song Q. Luo Y. Ultrasound-Guided Radiofrequency Ablation Versus Thyroid Lobectomy for Low-Risk Papillary Thyroid Microcarcinoma: A Propensity-Matched Cohort Study of 884 Patients Thyroid 2021 November 31 11 1662 1672 10.1089/thy.2021.0100 34269611 33 Riss J. C. Peyrottes I. Chamorey E. Prognostic Impact of Tumour Multifocality in Thyroid Papillary Microcarcinoma Based on a Series of 160 Cases European Annals of Otorhinolaryngology, Head and Neck Diseases 2012 August 129 4 175 178 10.1016/j.anorl.2011.11.003 2-s2.0-84865745940 22475976 34 Goran M. Markovic I. Buta M. The Influence of Papillary Thyroid Microcarcinomas Size on the Occurrence of Lymph Node Metastases Journal of the Balkan Union of Oncology 2019 October 24 5 2120 2126 31786884 35 Kazaure H. S. Roman S. A. Sosa J. A. The Impact of Age on Thyroid Cancer Staging Current Opinion in Endocrinology Diabetes and Obesity 2018 October 25 5 330 334 10.1097/MED.0000000000000430 2-s2.0-85065020831 30048260 36 Takano T. Natural History of Thyroid Cancer Endocrine Journal 2017 March 64 3 237 244 10.1507/endocrj.EJ17-0026 2-s2.0-85016579874 28154351 37 Ha E. J. Chung S. R. Na D. G. 2021 Korean Thyroid Imaging Reporting and Data System and Imaging-Based Management of Thyroid Nodules: Korean Society of Thyroid Radiology Consensus Statement and Recommendations Korean Journal of Radiology 2021 December 22 12 2094 2123 10.3348/kjr.2021.0713 34719893 PMC8628155 38 Saravana-Bawan B. Bajwa A. Paterson J. McMullen T. Active Surveillance of Low-Risk Papillary Thyroid Cancer: A Meta-Analysis Surgery 2020 January 167 1 46 55 10.1016/j.surg.2019.03.040 2-s2.0-85072197404 31526581 39 American Society of Neuroradiology ASNR23 Annual Meeting Proceedings 2023 https://www.asnr.org/wp-content/uploads/2023/04/ASNR23-Proceedings_04.24.23.pdf Figure 1 The CONSORT flow diagram of the study. PTC = papillary thyroid carcinoma. FNA = fine needle aspiration. Figure 2 Mean PTMC tumor volume and VRR at each follow-up. (a) The mean tumor volume and (b) the mean VRR of the PTMCs in Taiwan, Vietnam, and both countries before and after RFA at each follow-up. Both countries showed successful treatment responses compared to the baseline, with consistent trends observed in the volume change and VRR between the two countries. PTMC = papillary thyroid microcarcinoma, VRR = volume reduction ratio, RFA = radiofrequency ablation. Figure 3 A 46-year-old Taiwanese female with PTMC who underwent RFA. (a) US examination and (b) contrast enhanced CT scan revealed the PTMC (arrows) measuring 7 × 6 × 4 mm in the right isthmus of the thyroid adjacent to the trachea. (c) In the beginning of the RFA procedure, a layer of hydrodissection (arrow) was created to prevent thermal injury to the adjacent trachea. (d) During the RFA procedure, the targeted area was transformed to a transient hyperechoic state. (e) Follow-up US examination at 1 year after RFA showed regression of the PTMC, with a remaining linear scar (arrow) measuring 2 mm and atrophy of the right isthmus of the thyroid. (f) Contrast enhanced CT scan 3 years after RFA showed total regression (arrow) of the PTMC. PTMC = papillary thyroid microcarcinoma, RFA = radiofrequency ablation, CT = CT, US = ultrasound. Table 1 Characteristics of patients and tumors.  Taiwan Vietnam Total  p Center (no.) 1 2 3 4 Total 5 6 Total    Patients ( n 44 18 6 6 74 127 5 132 206  Age (year) 51.36 ± 12.31 44.00 ± 11.47 50.4 ± 11.52 48.67 ± 23.23 49.28 ± 13.25 43.02 ± 11.71 35.91 ± 7.92 42.33 ± 11.44 44.82 ± 12.54 < 0.001 Gender (M/F) 12/32 4/14 2/4 1/5 19/55 23/104 2/3 25/107 44/162 0.399  Tumor characteristics           Number (single/multiple + 50 (38/12) 18 (18/0) 6 (6/0) 6 (6/0) 80 (68/12) 138 (116/22) 6 (4/2) 144 (120/24) 224 (188/36) 0.745 Longest diameter (mm) 7.54 ± 2.23 7.67 ± 1.75 6.44 ± 3.78 6.87 ± 1.65 7.44 ± 2.22 5.54 ± 1.58 7.23 ± 1.88 5.61 ± 1.62 6.26 ± 2.05 < 0.001 Baseline volume (mL) 0.18 ± 0.20 0.19 ± 0.11 0.18 ± 0.13 0.12 ± 0.06 0.18 ± 0.17 0.07 ± 0.06 0.13 ± 0.11 0.07 ± 0.06 0.11 ± 0.12 < 0.001 Location ( n          0.090 Left 19 (38.0%) 10 (55.6%) 2 (33.3%) 2 (33.3%) 33 (41.3%) 44 (31.9%) 3 (50.0%) 47 (32.6%) 80 (35.7%)  Right 28 (56.0%) 8 (44.4%) 4 (66.7%) 4 (33.3%) 44 (55.0%) 77 (55.8%) 3 (50.0%) 80 (55.6%) 124 (55.4%)  Isthmus 3 (6.0%) 0 0 0 3 (3.7%) 17 (12.3%) 0 17 (11.8%) 20 (8.9%)   Complications ( n 0 0 0 0 0 3 (2.4%) 1 (20%) 0 4 (1.9%) 0.092 Repeat FNA at 6 months 31 (70.5%) 13 (72.2%) 4 (66.7%) 4 (66.7%) 51 (68.9%) 81 (63.8%) 3 (60.0%) 84 (63.6%) 135 (65.9%) 0.148 Disease progression ( n 0 1 (5.6%) 0 0 0 0 0 0 1 (0.5%) 0.179  Note: p Abbreviation: FNA = fine needle aspiration.  + Table 2 Mean volume of tumors and VRR at each follow-up after ablation based on countries. Country Taiwan  p Vietnam  p Total  p  p # Group ∗ p Tumor volume (mean ± SD, ml)        0.193 Baseline 0.18 ± 0.17  0.07 ± 0.06  0.11 ± 0.12  < 0.001  1 month 0.42 ± 0.32 < 0.001 0.41 ± 0.22 < 0.001 0.41 ± 0.26 < 0.001 0.370  3 months 0.20 ± 0.19 < 0.001 0.14 ± 0.12 < 0.001 0.17 ± 0.15 < 0.001 0.170  6 months 0.12 ± 0.19 < 0.001 0.04 ± 0.06 < 0.001 0.07 ± 0.13 < 0.001 < 0.001  12 months 0.03 ± 0.08 < 0.001 0.01 ± 0.03 < 0.001 0.02 ± 0.06 < 0.001 < 0.001  24 months 0.01 ± 0.03 < 0.001 0 ± 0 0.317 0.01 ± 0.03 < 0.001 0.159  Time effect p < 0.001  < 0.001  < 0.001     Volume reduction ratio (mean ± SD, %)        < 0.001 1 month −374.42 ± 639.23  −829.24 ± 906.28  −674.85 ± 851.66  < 0.001  3 months −81.20 ± 206.21 < 0.001 −210.51 ± 364.02 < 0.001 −165.46 ± 323.47 < 0.001 0.001  6 months 4.52 ± 147.01 < 0.001 23.63 ± 90.67 < 0.001 16.80 ± 114.07 < 0.001 0.740  12 months 83.32 ± 36.04 < 0.001 91.33 ± 43.60 < 0.001 87.58 ± 40.29 < 0.001 < 0.001  24 months 95.23 ± 14.74 < 0.001 100 ± 0 0.317 96.18 ± 13.29 < 0.001 0.159  Time effect p < 0.001  0.003  < 0.001     Cumulative disappearance ( n         1 month 0  0  0    3 months 0  2 (1.3%)  2 (0.9%)    6 months 8 (10.0%)  23 (16.0%)  31 (13.8%)    12 months 37 (53.6%)  72 (86.7%)  109 (71.7%)    24 months 58 (98.3%)  73 (100%)  131 (99.2%)     Note: p p # Table 3 Treatment outcomes based on center volume.  High-volume centers Low-volume centers  p Centers (no.) 1, 5, 6 2, 3, 4   n 194 30   Baseline tumor volume (mean ± SD, mL) 0.10 ± 0.12 0.17 ± 0.11 0.003  Volume reduction ratio (mean ± SD, %)    6 months 8.44 ± 120.20 70.91 ± 19.86 0.005 12 months 86.91 ± 43.72 91.12 ± 9.99 0.648 24 months 96.27 ± 14.22 95.75 ± 7.13 0.921  Cumulative disappearance ( n    12 months 99 (71.7%) 10 (71.4%) 0.834 24 months 114 (100%) 17 (94.4%) 0.458  Complication rate (%) 5 (2.6%) 0 (0.0%) 0.374  Note: p ",
  "metadata": {
    "Title of this paper": "ASNR23 Annual Meeting Proceedings",
    "Journal it was published in:": "International Journal of Endocrinology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12496152/"
  }
}