{
  "title": "Paper_628",
  "abstract": "pmc J Cardiovasc Dev Dis J Cardiovasc Dev Dis 3360 jcdd jcdd Journal of Cardiovascular Development and Disease 2308-3425 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471078 PMC12471078.1 12471078 12471078 41002612 10.3390/jcdd12090333 jcdd-12-00333 1 Review Advancements in Acute Pulmonary Embolism Diagnosis and Treatment: A Narrative Review of Emerging Imaging Techniques and Intravascular Interventions https://orcid.org/0000-0002-7401-1971 Cellina Michaela 1 * https://orcid.org/0009-0004-4374-7806 Pavan Matilde 2 https://orcid.org/0009-0000-1877-7844 Finardi Niccolò 2 https://orcid.org/0009-0004-8995-8393 Cicchetti Francesco 2 https://orcid.org/0000-0002-8906-5665 Cè Maurizio 3 https://orcid.org/0000-0002-2737-2053 Biondetti Pierpaolo 3 Lanza Carolina 3 Carriero Serena 3 Carrafiello Gianpaolo 2 3 Sun Zhonghua Academic Editor 1 2 matilde.pavan@unimi.it niccolo.finardi@unimi.it francesco.cicchetti@unimi.it 3 maurizioce.md1@gmail.com carolina.lanza@policlinico.mi.it serena.carriero@policlinico.mi.it * michaela.cellina@asst-fbf-sacco.it 29 8 2025 9 2025 12 9 497646 333 30 5 2025 25 8 2025 26 8 2025 29 08 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Acute pulmonary embolism (APE) represents a significant cause of morbidity and mortality worldwide, requiring rapid and precise diagnosis and effective therapy strategies. Computed Tomography Pulmonary Angiography (CTPA) is currently the gold standard technique for diagnosing PE; however, it presents some disadvantages, including limited sensitivity in detecting sub-segmental emboli and contrast-related risks. Recent advancements in imaging technologies, including Dual-Energy Computed Tomography (DECT) and Photon Counting (PC), offer improved sensitivity and specificity for APE and perfusion abnormalities detection. Digital Dynamic Radiography (DDR) perfusion imaging represents a novel imaging that allows pulmonary perfusion assessment without contrast medium administration, able to detect anomalies at the patient’s bedside, representing a promising advancement, particularly for critically ill or contrast-allergic patients. In parallel, interventional radiology has become integral to APE management, particularly for high-risk and intermediate–high-risk patients, with evolving intravascular treatment techniques such as catheter-directed thrombolysis, mechanical thrombectomy, and thrombus aspiration. This narrative review provides an overview of the latest developments in APE diagnostic imaging and interventional radiology, contextualizing them within current guideline recommendations for endovascular treatment. pulmonary embolism photon counting CT DECT mechanical thrombectomy catheter-directed thrombolysis This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Acute pulmonary embolism (APE) is a serious condition characterized by the obstruction of blood circulation in the pulmonary arteries or their branches, mainly caused by a blood clot, which typically originates in the deep venous system of the legs [ 1 2 2 Although APE is the third leading cause of cardiovascular-related deaths, after coronary artery disease and stroke [ 3 4 5 6 7 Incidental APE detection on CT scans across different populations is approximately 2.6%, with elevated rates in cancer patients (up to 5%) and hospitalized individuals [ 5 5 Throughout the years, computed tomography pulmonary angiography (CTPA) has emerged as the reference standard imaging method for diagnosing APE [ 2 8 9 Recent imaging methods have proven valuable for diagnosing APE. Dual-Energy CT (DECT) enables the generation of pulmonary perfusion maps, offering functional data alongside anatomical details, enhancing diagnostic precision, while minimizing the volume of contrast agent [ 10 11 12 13 Along with these imaging innovations, the management of APE is also evolving, with the emergence of risk-stratification tools and interventional radiology-based treatments [ 14 15 16 This review explores emerging imaging and interventional techniques that are playing an increasingly important role in both the diagnosis and treatment of APE, with a focus on their recent developments and potential clinical applications. 2. Search Strategy and Methodology We conducted a review of the literature by searching the PubMed database up to May 2025 using the following key terms, individually and in combination: ‘pulmonary embolism’, ‘computed tomography pulmonary angiography’, ‘dual-energy CT’, ‘photon-counting CT’, ‘dynamic digital radiography’, ‘catheter-directed thrombolysis’, ‘mechanical thrombectomy’, ‘low-dose systemic thrombolysis’ and ‘artificial intelligence’. Additional relevant articles were identified through manual reference checks of selected papers and recent guidelines. 3. Diagnostic Imaging Recent advances in imaging technology have emerged to address some of the inherent limitations of CTPA, which, despite these developments, remains the current gold standard for the diagnosis of APE. 3.1. High-Pitch CT High-pitch helical CT scanning enables rapid acquisition of thoracic images, which is particularly useful in the emergency setting for patients who are dyspneic or unable to cooperate. A recent study analyzed 81 normal-weight patients referred for CTPA for suspected APE: forty-one patients underwent the high-pitch CTPA protocol, while 40 underwent the standard CTPA protocol, both on a second-generation dual-source CT scanner [ 17 p 17 3.2. Dual Energy CT 3.2.1. Principles of DECT DECT relies on the differences in the photoelectric effect and Compton scattering at different energetic levels to generate material-specific maps for the characterization of different tissues and components. Several dual-energy acquisition techniques are currently in clinical use, including dual-source systems, rapid kVp-switching single-source scanners, and layered detector configurations. Post-processing techniques enable the generation of virtual monoenergetic images (VMIs), virtual non-contrast images (VNC), and iodine distribution maps, all of which contribute to enhanced diagnostic confidence and potentially reduce the need for additional imaging [ 18 19 20 21 3.2.2. Accuracy of DECT Thieme et al. [ 22 23 24 A meta-analysis by Monti et al. [ 25 26 Finally, Foti et al. [ 27 In addition to detection, DECT offers further characterization and prognostic information; perfusion defect scoring has been suggested to measure APE severity, and research has indicated a link to right ventricular dysfunction and negative outcomes [ 28 29 30 VMIs are images synthesized at different energy levels, usually ranging from 40 to 190 keV ( Figure 1 Figure 2 Finally, the use of high-energy VMIs (e.g., 100–140 keV) can mitigate beam-hardening artifacts from dense contrast or metallic implants, improving overall image quality. 3.3. Photon-Counting CT 3.3.1. Principles of Photon Counting PC is a new imaging technique that greatly improves traditional CT and depends on energy-integrating detectors (EIDs). PC provides enhanced spatial and contrast resolution, lower electronic noise, and the possibility for a decrease in radiation dose [ 19 31 32 10 31 PCDs enable a significant reduction in contrast medium administration and radiation dose for diagnosing APE compared to conventional EID-CT while maintaining good to excellent image quality [ 32 3.3.2. Diagnostic Accuracy of of Photon Counting-CTPA Pennenbecker et al. [ 12 33 Morevoer, when working with PC, VMIs help APE diagnosis by optimizing contrast resolution and reducing artifacts [ 34 35 Figure 3 Although 40 keV VMIs achieve peak signal-to-noise ratios, 50 keV balances noise reduction and artifact mitigation, with studies demonstrating superior APE visibility at this energy level due to fewer beam-hardening artifacts [ 35 35 PC CTPA is now being used routinely in clinical settings, with continuing research aiming to evaluate its diagnostic performance compared with traditional CTPA. Recent prospective investigations have shown that PC produces 95–100% of tests classified as diagnostic for PE, with some series reporting no non-diagnostic scans. In most situations, subjective image quality was rated excellent or good, exceeding EID-CT and DECT [ 12 33 12 33 In a recent prospective study, Remy-Jardin et al. [ 36 37 3.4. Dynamic Digital Radiography 3.4.1. Principles of Dynamic Digital Radiography DDR is an emerging low-radiation method for assessing pulmonary perfusion that applies a flat-panel detector and a conventional radiography system with a pulsed X-ray generator, allowing for the capture of sequential high-resolution images over time., creating a dynamic sequence that represents motion and functional changes, such as airflow and blood flow in the lungs. Patients are imaged in a standing or supine position over a breath-hold of 6 s, and the obtained images are processed to highlight temporal changes in pixel intensity corresponding to pulmonary blood flow from the baseline timing (end-diastolic phase) [ 38 Figure 4 Figure 5 39 APE is visible on DDR examinations as well-defined triangular or wedge-shaped perfusion defects, similar to those observed in traditional imaging modalities such as lung perfusion scintigraphy [ 40 DDR obtains lung perfusion without utilizing intravenous contrast media, providing a secure option for patients with contraindications to contrast agents and presenting benefits regarding radiation exposure and patient comfort. The low radiation doses (0.2 mSv) compared to traditional imaging techniques make DDR a promising option for functional analysis of pulmonary circulation, especially in patients who require repeated imaging or have limited tolerance for more invasive procedures. The availability of DDR portable equipment allows the acquisition also at the patients’ bed, speeding up the workflow in the emergency setting. 3.4.2. Accuracy of Dynamic Digital Radiography Studies have demonstrated the efficacy of DDR in detecting chronic thromboembolic pulmonary hypertension (CTEPH), a pathological condition related to unresolved pulmonary embolism. Research indicates that DDR has comparable sensitivity and specificity to ventilation/perfusion (V/Q) scanning in identifying CTEPH, suggesting its potential as a reliable diagnostic tool in clinical practice [ 13 The main advantages of the different imaging techniques are listed in Table 1 4. Artificial Intelligence 4.1. Automated Detection Artificial intelligence (AI) is transforming medical imaging and diagnostics, significantly enhancing precision and efficiency. Recent advancements have focused on developing AI algorithms that efficiently and accurately evaluate medical images [ 41 42 43 44 Previous studies utilized machine learning (ML) to create Computer-Assisted Detection (CAD) programs that supported radiologists in identifying APE. Although CAD software exhibited low sensitivity and specificity and necessitated manual verification by radiologists, its incorporation into radiologist workflows greatly enhanced detection rates [ 45 46 47 Different AI models have been explored for the APE detection on CTPA [ 41 44 To enhance the performance of these base models, researchers often integrate DenseNet or ResNet components [ 48 49 Another important class of models focuses on object detection, which aims to locate and mark the position of emboli within the pulmonary arteries. Examples include Faster R-CNN and Mask R-CNN [ 49 Numerous studies have evaluated the performance of AI algorithms for APE detection using metrics such as sensitivity, specificity, Area Under the Curve (AUC), and accuracy [ 41 42 46 50 51 52 53 54 55 56 Specific AI tools have been evaluated and received regulatory approval. In particular, CINA-PE (Avicenna.AI), an FDA-cleared and CE-marked DL-based algorithm, demonstrated high performance in different studies, with a per-case sensitivity and specificity that range between 93.9–91.4% and 94.8–91.5%, respectively, and an AUC-ROC of 0.92 [ 57 58 59 Another FDA-approved AI model is Aidoc, which has been tested in real hospitals showing high levels of accuracy, with sensitivity reaching 96.8% and specificity up to 99.9% [ 60 Zsarnoczay et al. [ 50 When using AI, common sources of false positives included lung masses, pneumonia, and contrast flow artifacts, while false negatives often involved chronic and subsegmental APE. Detecting peripheral and small emboli poses a significant challenge, and current AI initiatives aim to enhance precision in these regions, while earlier research typically concentrated only on major arteries [ 61 62 Beyond contrast-enhanced CTPA, the possible role of automated APE detection on unenhanced chest CT has also been explored [ 63 57 41 A summary of the performance of the main DL algorithms is presented in Table 2 4.2. Segmentation and Quantification Beyond detection, AI also plays an important role in segmenting anatomical structures and embolic material. CNNs are often used for segmenting lung lobes, the heart, and pulmonary arteries, regions critical for accurately localizing and quantifying APE. Common architectures include 2D, 2.5D, and 3D U-Nets, alongside advanced models like Retina U-Net, nnU-Net, and MP-Net, all engineered to delineate features at a pixel level [ 44 64 51 43 4.3. Prediction Segmentation is useful to establish the APE severity, including estimating the Qanadli score [ 44 65 44 AI is also a promising tool for outcome prediction and risk stratification [ 66 Finally, Natural Language Processing (NLP), a branch of AI that focuses on processing written or spoken language by extracting relevant information from radiology reports, medical history and admission notes, can be used to identify patients with a potential diagnosis [ 67 5. Therapeutic Strategies 5.1. Risk Stratification and Interventional Procedure for Pulmonary Embolism Risk stratification is a cornerstone of managing APE as it determines the appropriate diagnostic and therapeutic strategies [ 68 69 68 69 High-risk APE is characterized by hemodynamic instability, including cardiac arrest, obstructive shock (systolic blood pressure <90 mmHg or vasopressor use with signs of end-organ hypoperfusion), or persistent hypotension unresponsive to volume resuscitation [ 69 70 71 68 72 72 The ESC 2019 guidelines similarly recommend systemic thrombolysis as first-line therapy, with catheter-based options reserved for selected high-risk patients with contraindications or failure of thrombolysis [ 71 69 Although hemodynamically stable patients may not fulfill the criteria for massive APE, they can exhibit severity markers such as increased troponin or brain natriuretic peptide levels, along with RV dysfunction detected through echocardiography or CTPA [ 71 16 73 Systemic thrombolysis is not routinely recommended; however, interventional radiology-guided CDT or mechanical thrombectomy may be considered for patients whose clinical condition deteriorates despite anticoagulation, or for those with persistent signs of RV overload and hypoxia [ 72 71 71 Interventional radiology plays a limited role in low-risk APE, which includes hemodynamically stable patients, lack of RV dysfunction, and a PESI class I–II or a simplified PESI score of 0 [ 71 69 5.2. EkoSonic Endovascular System (EKOS) The EkoSonic Endovascular System (EKOS) is a directed thrombolysis platform that combines ultrasound energy with low-dose fibrinolytic infusion to accelerate thrombus dissolution. Its efficacy was evaluated through different trials, such as the ULTIMA trial, a randomized controlled trial enrolling 59 patients with intermediate-risk APE, which showed that ultrasound-assisted CDT using EKOS was significantly more effective than anticoagulation alone in reducing RV/LV ratio at 24 h, with no major bleeding events reported [ 73 74 The OPTALYSE-PE trial aimed to determine the optimal duration and dose of thrombolytic delivery using EKOS in intermediate-risk patients [ 75 76 A highly anticipated trial is the HI-PEITHO study, a large, prospective, multicenter, randomized controlled trial designed to compare EKOS-based CDT plus anticoagulation versus anticoagulation alone in 406 patients with intermediate–high-risk APE. The trial’s primary outcomes include PE-related death, recurrence, and cardiorespiratory decompensation at 7 days. The results will significantly influence future guideline recommendations regarding CDT use in intermediate-risk patients [ 16 Recent case reports also highlight the clinical applicability of catheter-directed therapies such as EKOS in complex APE scenarios, where systemic thrombolysis poses significant risks. For example, a 50-year-old female patient with May–Thurner Syndrome and extensive thrombotic burden was successfully treated using bilateral EkoSonic Endovascular System (EKOS) catheters without the use of systemic thrombolysis [ 77 5.3. FlowTriever System (Inari Medical) The FlowTriever System (Inari Medical, Irvine, CA, USA) is a mechanical thrombectomy device using a large-bore catheter, available in 16F, 20F, and 24F sizes, and a 60 mL syringe with a locking mechanism to create a vacuum, designed to remove thrombus from the pulmonary arteries without thrombolytics. It uses aspiration through the Triever catheter (Inari Medical, Irvine, CA, USA) and mechanical engagement tools with self-expanding nitinol disks, offering immediate hemodynamic benefits compared to the gradual improvements seen with CDT. Although technically more demanding, effective outcomes have been favorable, regardless of operator experience. Significant evidence from various studies highlights the efficacy and safety of FlowTriever across different patient settings. The FLARE study, a prospective, single-arm trial of 106 intermediate-risk PE patients, demonstrated a significant average reduction (25%) in the RV/LV ratio at 48 h post-procedure, along with a low rate (3.8%) of composite adverse safety outcomes and minimal bleeding complications [ 74 78 79 In the high-risk APE setting, the FLAME study compared 53 patients treated with FlowTriever ( Figure 6 80 The PEERLESS study further strengthens FlowTriever’s evidence base as the first randomized controlled trial (RCT) to directly compare two advanced catheter-based therapies, FlowTriever versus CDT, in intermediate-risk APE patients. Enrolling 550 patients, PEERLESS demonstrated a significantly favorable primary endpoint for FlowTriever, primarily driven by fewer cases of clinical deterioration, lower need for bailout therapies, and reduced ICU admissions and lengths of stay [ 81 These studies underscore FlowTriever’s capacity for rapid thrombus removal, significant acute improvement in right ventricular function, and an impressive safety profile, making it a compelling therapeutic choice for a broad spectrum of APE patients. 5.4. Indigo Aspiration System (Penumbra Inc.) The Indigo Aspiration System (Penumbra Inc., Alameda, CA, USA) is a mechanical thrombectomy device designed to rapidly remove thrombus in APE using continuous aspiration and mechanical fragmentation. The system features a computer-assisted vacuum thrombectomy (CAVT), regulated by a microprocessor, facilitating precise thrombus extraction while minimizing blood loss. The device comprises aspiration catheters of various sizes (8–12 Fr), a suction pump, and an optional separator wire for enhanced thrombus disruption. Clinical evaluation through the EXTRACT-PE study—a prospective, multicenter, single-arm trial with 119 intermediate-risk PE patients—demonstrated significant efficacy, showing a mean reduction of 0.43 (27.3%) in the RV/LV ratio at 48 h. Safety outcomes were favorable, with a major adverse event rate of only 1.7%, major bleeding occurring in 1.7%, and no cases of intracranial hemorrhage reported. Notably, 98.3% of patients underwent the procedure without adjunctive thrombolytic therapy. The median procedural duration of 37 min and minimal blood loss further underscored the efficiency and safety of this system [ 82 Additional support comes from interim results of the STRIKE-PE trial, a larger prospective, international study evaluating Indigo Aspiration in intermediate- and high-risk APE patients. Interim findings from 150 patients confirmed significant acute hemodynamic improvements, including a 25.7% reduction in the RV/LV ratio and reduced pulmonary artery pressures at 48 h, alongside low complication rates (2.7% composite major adverse events) and notable functional and quality-of-life benefits at 90 days [ 83 Together, these studies position the Indigo Aspiration System as an effective, safe, and versatile mechanical thrombectomy option for managing APE, particularly in populations where thrombolysis is contraindicated or undesirable. Clinical case reports further emphasize the role of the Indigo Aspiration System in high-risk pulmonary embolism scenarios, particularly where thrombolysis is contraindicated. Angelini et al. [ 84 5.5. Other Devices Other devices include the AngioJet rheolytic thrombectomy system (Boston Scientific, Marlborough, MA, USA), which utilizes high-pressure saline jets to fragment and aspirate thrombi and allows local thrombolytic injections. The AngioJet system has primarily been assessed in small, retrospective studies involving intermediate- and high-risk APE patients. One retrospective study of 44 patients (21 high-risk and 23 intermediate–high-risk) showed significant short-term clinical and hemodynamic improvements. However, mortality was relatively high (six in-hospital deaths), and complications such as significant bleeding occurred in 4.5% of patients [ 85 86 The AngioVac (AngioDynamics, Oakville, ON, USA) is a large-bore (24 Fr) catheter system designed for venous thrombus removal via extracorporeal venovenous bypass. It allows filtration of aspirated thrombus before reinfusion into the systemic circulation. However, the available literature does not provide detailed evidence from specific randomized trials or robust clinical studies conclusively demonstrating its efficacy in treating PE, relying instead on limited single-center experiences and case reports. The BASHIR endovascular catheter (Thrombolex, New Britain, PA, USA) introduces a unique concept of mechanical expansion and local thrombolysis via an expandable infusion basket with multiple orifices. Preliminary data have shown significant improvements in RV function and thrombus burden with a favorable safety profile [ 87 6. Systemic Thrombolysis The mortality rate from an APE primarily depends on how well the right ventricle (RV) can cope with the sudden strain placed upon it, and quick intervention is vital for APE patients showing signs of RV failure. Anticoagulation treatment is effective in preventing clot progression; however, it does not significantly improve RV function or pulmonary perfusion in the early stages of treatment [ 88 89 90 Thrombolytic therapy has instead demonstrated more immediate benefits, including significant improvements in both RV function and pulmonary perfusion. The impact of low-dose systemic tissue plasminogen activator (tPA) thrombolysis on patient outcomes remains a subject of debate, as thrombolytic therapy carries an increased risk of bleeding complications [ 91 To minimize this risk while retaining therapeutic benefits, low-dose, prolonged thrombolysis using alteplase or tPA has been proposed as an alternative for patients with intermediate- or high-risk APE [ 92 Low-dose systemic tPA has emerged as a promising treatment option for APE, particularly in intermediate-risk patients. Compared to anticoagulation alone, this approach seeks to achieve more rapid clot resolution and improved RV function, with a lower bleeding risk than traditional high-dose thrombolytic therapy [ 93 Common regimens include a 6 h infusion of low-dose tPA (e.g., 50 mg total, sometimes given as a 10 mg bolus followed by infusion) to balance thrombolytic efficacy with bleeding risk reduction [ 94 95 7. Pulmonary Embolism Response Teams (PERTs) Many institutions have established Pulmonary Embolism Response Teams (PERTs) to support decision-making in this increasingly complex therapeutic landscape. These multidisciplinary teams typically include pulmonologists, cardiologists, emergency medicine physicians, hematologists, interventional radiologists, cardiothoracic surgeons, and pharmacists. PERTs provide rapid consultation, often via virtual or in-person meetings, and facilitate real-time clinical, imaging, and laboratory data analysis to guide optimal treatment strategies [ 96 Their role is particularly vital in intermediate- and high-risk APE cases, or in low-risk patients with complicating factors such as significant comorbidities or contraindications to standard therapies. Studies assessing the impact of PERT implementation have demonstrated notable benefits. Direct PERT consultation has been associated with reductions in 30-day mortality, hospital length of stay, time to therapeutic anticoagulation, and bleeding complications, even though patients receiving PERT consultation were more likely to undergo advanced interventions such as thrombolysis or thrombectomy [ 96 97 98 99 100 8. Discussion The management of APE has evolved remarkably over the past decade, driven by innovations in diagnostic imaging, interventional radiology, AI, and structured clinical management frameworks such as PERTs. While CTPA remains the reference standard for diagnosis [ 8 9 10 12 13 Simultaneously, AI has begun to integrate into APE diagnostics, with deep learning algorithms showing high diagnostic accuracy and support in CTPA interpretation. FDA-cleared tools like CINA-PE and Aidoc have demonstrated improved detection rates of APE and potential reductions in missed diagnoses, particularly for incidental and peripheral emboli [ 55 From a therapeutic perspective, the field of interventional radiology has made substantial progress in addressing high- and intermediate–high-risk APE, especially in patients contraindicated for systemic thrombolysis. Catheter-directed therapies (CDTs) such as the EkoSonic Endovascular System (EKOS), FlowTriever System, Indigo Aspiration System, and emerging devices like the BASHIR catheter have demonstrated safety and efficacy in clinical trials. Notably, randomized evidence from trials like PEERLESS [ 81 16 APE treatment is complex and should be formulated by an experienced interdisciplinary clinician team and based on careful risk stratification, including different factors, such as patient characteristics, cardio-pulmonary reserve, bleeding risk, and available interventional resources. Recent guidelines (ESC 2019, ACCP 2021, and the PERT Consortium recommendations) [ 72 77 9. Limitations As a narrative review inherently carries selection bias, studies were chosen based on relevance and author expertise rather than a systematic or meta-analytic methodology. Although we endeavored to present balanced and current evidence, some emerging technologies and trials may have been inadvertently overlooked. Moreover, much of the supporting evidence for newer imaging modalities like PC, DDR, and AI-based tools derives from single-center studies or early-phase trials with limited patient cohorts. Consequently, the generalizability of these findings to broader clinical practice remains uncertain. Finally, interventional radiology techniques, while increasingly utilized, lack extensive randomized controlled trial data in intermediate-risk PE populations, with most published studies being observational or single-arm registries. The forthcoming results from pivotal trials such as HI-PEITHO will be crucial in refining recommendations and clinical indications. 10. Conclusions APE is a complex and potentially life-threatening condition that demands a multidisciplinary and personalized approach. Recent advances in imaging technologies have improved diagnostic accuracy while minimizing patient risk. Minimally invasive endovascular therapies are becoming increasingly central for managing high- and intermediate-risk cases, offering effective alternatives to systemic thrombolysis. Pulmonary Embolism Response Teams facilitate tailored decision-making and improve outcomes through structured collaboration. Continued integration of artificial intelligence, risk stratification models, and clinical expertise will be critical to advancing APE care and improving long-term patient outcomes. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.C. (Michaela Cellina) and M.P.; methodology, M.C. (Michaela Cellina), M.P. and M.C. (Maurizio Cè); investigation, S.C., C.L. and P.B.; writing—original draft preparation, M.C. (Michaela Cellina), M.P., N.F., F.C., M.C. (Maurizio Cè) and P.B.; writing—review and editing, M.C. (Michaela Cellina), M.C. (Maurizio Cè), M.P., N.F., F.C. and P.B.; visualization, S.C. and G.C.; supervision, G.C.; project administration, S.C. and G.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: APE Acute Pulmonary Embolism CTPA Computed Tomography Pulmonary Angiography DECT Dual-Energy Computed Tomography PC Photon Counting DDR Dynamic Digital Radiography RV Right Ventricle VNC Virtual Non-Contrast VMIs Virtual Monoenergetic Images EID-CT Energy-Integrating Detector CT PCDs Photon-Counting Detectors DL Deep Learning CNNs Convolutional Neural Networks CAD Computer-Assisted Detection ML Machine Learning AUC Area Under the Curve DNN Deep Neural Network NLP Natural Language Processing CT Computed Tomography PE Pulmonary Embolism V/Q Ventilation/Perfusion (referring to V/Q scanning) CTEPH Chronic Thromboembolic Pulmonary Hypertension SECT Single-Energy CT LB Linear Blending RV/LV Right Ventricle-to-Left Ventricle diameter ratio References 1. Peracaula M. Sebastian L. Francisco I. Vilaplana M.B. Rodríguez-Chiaradía D.A. Tura-Ceide O. Decoding Pulmonary Embolism: Pathophysiology, Diagnosis, and Treatment Biomedicines 2024 12 1936 10.3390/biomedicines12091936 39335450 PMC11428250 2. Teissandier D. Roussel M. Bannelier H. Freund Y. Catoire P. Contemporary approaches to pulmonary embolism diagnosis: A clinical review Korean Soc. Emerg. Med. 2024 11 127 135 10.15441/ceem.23.157 PMC11237265 38368878 3. Raskob G.E. Angchaisuksiri P. Blanco A.N. Buller H. Gallus A. Hunt B.J. Hylek E.M. Kakkar A. Konstantinides S.V. McCumber M. Thrombosis: A major contributor to global disease burden Arter. Thromb. Vasc. Biol. 2014 34 2363 2371 10.1161/ATVBAHA.114.304488 25304324 4. Faluk M. Hasan S.M. Chacko J.J. Abdelmaseih R. Patel J. Evolution of Acute Pulmonary Embolism Management: Review Article Curr. Probl. Cardiol. 2021 46 100551 10.1016/j.cpcardiol.2020.100551 32204946 5. Pollack C.V. Schreiber D. Goldhaber S.Z. Slattery D. Fanikos J. O’Neil B.J. Thompson J.R. Hiestand B. Briese B.A. Pendleton R.C. Clinical characteristics, management, and outcomes of patients diagnosed with acute pulmonary embolism in the emergency department: Initial report of EMPEROR (Multicenter Emergency Medicine Pulmonary Embolism in the Real World Registry) J. Am. Coll. Cardiol. 2011 57 700 706 10.1016/j.jacc.2010.05.071 21292129 6. Noschang J. Guimarães M.D. Teixeira D.F.D. Braga J.C.D. Hochhegger B. Santana P.R.P. Marchiori E. Pulmonary thromboembolism: New diagnostic imaging techniques Radiol. Bras. 2018 51 178 186 10.1590/0100-3984.2017.0191 29991840 PMC6034731 7. Thomas S.E. Weinberg I. Schainfeld R.M. Rosenfield K. Parmar G.M. Diagnosis of Pulmonary Embolism: A Review of Evidence-Based Approaches Biomedicines 2024 13 3722 10.3390/jcm13133722 PMC11242034 38999289 8. Zantonelli G. Cozzi D. Bindi A. Cavigli E. Moroni C. Luvarà S. Grazzini G. Danti G. Granata V. Miele V. Acute Pulmonary Embolism: Prognostic Role of Computed Tomography Pulmonary Angiography (CTPA) Tomography 2022 8 529 539 10.3390/tomography8010042 35202207 PMC8880178 9. Patel P. Bhatt M. Braun C. Begum H. Wiercioch W. Varghese J. Wooldridge D. Alturkmani H. Thomas M. Baig M. Systematic review and meta-analysis of test accuracy for the diagnosis of suspected pulmonary embolism Blood Adv. 2020 4 4296 4311 10.1182/bloodadvances.2019001052 32915980 PMC7509887 10. Vlahos I. Jacobsen M.C. Godoy M.C. Stefanidis K. Layman R.R. Dual-energy CT in pulmonary vascular disease Br. J. Radiol. 2021 95 20210699 10.1259/bjr.20210699 34538091 PMC8722250 11. Guerrini S. Zanoni M. Sica C. Bagnacci G. Mancianti N. Galzerano G. Garosi G. Cacioppa L.M. Cellina M. Zamboni G.A. Dual-Energy CT as a Well-Established CT Modality to Reduce Contrast Media Amount: A Systematic Review from the Computed Tomography Subspecialty Section of the Italian Society of Radiology J. Clin. Med. 2024 13 6345 10.3390/jcm13216345 39518485 PMC11546204 12. Pannenbecker P. Huflage H. Grunz J.P. Gruschwitz P. Patzer T.S. Weng A.M. Heidenreich J.F. Bley T.A. Petritsch B. Photon-counting CT for diagnosis of acute pulmonary embolism: Potential for contrast medium and radiation dose reduction Eur. Radiol. 2023 33 7830 7839 10.1007/s00330-023-09777-9 37311805 PMC10598187 13. Yamasaki Y. Abe K. Kamitani T. Hosokawa K. Hida T. Sagiyama K. Matsuura Y. Baba S. Isoda T. Maruoka Y. Efficacy of Dynamic Chest Radiography for Chronic Thromboembolic Pulmonary Hypertension Radiology 2023 306 e220908 10.1148/radiol.220908 36346313 14. Marti C. John G. Konstantinides S. Combescure C. Sanchez O. Lankeit M. Meyer G. Perrier A. Systemic thrombolytic therapy for acute pulmonary embolism: A systematic review and meta-analysis Eur. Heart J. 2015 36 605 614 10.1093/eurheartj/ehu218 24917641 PMC4352209 15. Harvey J.J. Huang S. Uberoi R. Catheter-Directed Therapies for the Treatment of High Risk (Massive) and Intermediate Risk (Submassive) Acute Pulmonary Embolism John Wiley and Sons Ltd. Hoboken, NJ, USA 2022 10.1002/14651858.CD013083.pub2 PMC9358724 35938605 16. Klok F.A. Piazza G. Sharp A.S.P. Ní Ainle F. Jaff M.R. Chauhan N. Patel B. Barco S. Goldhaber S.Z. Kucher N. Ultrasound-facilitated, catheter-directed thrombolysis vs anticoagulation alone for acute intermediate-high-risk pulmonary embolism: Rationale and design of the HI-PEITHO study Am. Heart J. 2022 251 43 53 10.1016/j.ahj.2022.05.011 35588898 17. Schönfeld T. Seitz P. Krieghoff C. Ponorac S. Wötzel A. Olthoff S. Schaudt S. Steglich J. Gutberlet M. Gohmann R.F. High-pitch CT pulmonary angiography (CTPA) with ultra-low contrast medium volume for the detection of pulmonary embolism: A comparison with standard CTPA Eur. Radiol. 2024 34 1921 1931 10.1007/s00330-023-10101-8 37656178 PMC10873234 18. D’Angelo T. Bucolo G.M. Yel I. Koch V. Gruenewald L.D. Martin S.S. Alizadeh L.S. Vogl T.J. Ascenti G. Lanzafame L.R.M. Dual-energy CT late arterial phase iodine maps for the diagnosis of acute non-occlusive mesenteric ischemia Radiol. Med. 2024 129 1611 1621 10.1007/s11547-024-01898-5 39405018 PMC11554692 19. Rajiah P. Parakh A. Kay F. Baruah D. Kambadakone A.R. Leng S. Update on multienergy CT: Physics, principles, and applications Radiographics 2020 40 1284 1308 10.1148/rg.2020200038 32822281 20. Borgheresi A. Cesari E. Agostini A. Badaloni M. Balducci S. Tola E. Consoli V. Palucci A. Burroni L. Carotti M. Pulmonary emphysema: The assessment of lung perfusion with Dual-Energy CT and pulmonary scintigraphy Radiol. Med. 2024 129 1622 1632 10.1007/s11547-024-01883-y 39256299 PMC11554815 21. Grob D. Smit E. Prince J. Kist J. Stöger L. Geurts B. Snoeren M.M. van Dijk R. Oostveen L.J. Prokop M. Iodine Maps from Subtraction CT or Dual-Energy CT to Detect Pulmonary Emboli with CT Angiography: A Multiple-Observer Study Radiology 2019 292 197 205 10.1148/radiol.2019182666 31084482 22. Thieme S.F. Becker C.R. Hacker M. Nikolaou K. Reiser M.F. Johnson T.R.C. Dual energy CT for the assessment of lung perfusion-Correlation to scintigraphy Eur. J. Radiol. 2008 68 369 374 10.1016/j.ejrad.2008.07.031 18775618 23. Thieme S.F. Graute V. Nikolaou K. Maxien D. Reiser M.F. Hacker M. Johnson T.R. Dual Energy CT lung perfusion imaging—Correlation with SPECT/CT Eur. J. Radiol. 2012 81 360 365 10.1016/j.ejrad.2010.11.037 21185141 24. Grob D. Smit E. Oostveen L.J. Snoeren M.M. Prokop M. Schaefer-Prokop C.M. Sechopoulos I. Brink M. Image Quality of Iodine Maps for Pulmonary Embolism: A Comparison of Subtraction CT and Dual-Energy CT AJR Am. J. Roentgenol. 2019 212 1253 1259 10.2214/AJR.18.20786 30860897 25. Monti C.B. Zanardo M. Cozzi A. Schiaffino S. Spagnolo P. Secchi F. De Cecco C.N. Sardanelli F. Dual-energy CT performance in acute pulmonary embolism: A meta-analysis Eur. Radiol. 2021 31 6248 6258 10.1007/s00330-020-07633-8 33555356 26. Stein P.D. Fowler S.E. Goodman L.R. Gottschalk A. Hales C.A. Hull R.D. Leeper K.V. Jr. Popovich J. Jr. Quinn D.A. Sos T.A. PIOPED II Investigators. Multidetector computed tomography for acute pulmonary embolism N. Engl. J. Med. 2006 354 2317 2327 10.1056/NEJMoa052367 16738268 27. Foti G. Silva R. Faccioli N. Fighera A. Menghini R. Campagnola A. Carbognin G. Identification of pulmonary embolism: Diagnostic accuracy of venous-phase dual-energy CT in comparison to pulmonary arteries CT angiography Eur. Radiol. 2021 31 1923 1931 10.1007/s00330-020-07286-7 32965572 28. Im D.J. Hur J. Han K.H. Lee H.J. Kim Y.J. Kwon W. Choi B.W. Acute Pulmonary Embolism: Retrospective Cohort Study of the Predictive Value of Perfusion Defect Volume Measured with Dual-Energy CT AJR Am. J. Roentgenol. 2017 209 1015 1022 10.2214/AJR.17.17815 28898127 29. Chae E.J. Seo J.B. Jang Y.M. Krauss B. Lee C.W. Lee H.J. Song K.S. Dual-energy CT for assessment of the severity of acute pulmonary embolism: Pulmonary perfusion defect score compared with CT angiographic obstruction score and right ventricular/left ventricular diameter ratio AJR Am. J. Roentgenol. 2010 194 604 610 10.2214/AJR.09.2681 20173135 30. Cellina M. Cè M. Grimaldi E. Mastellone G. Fortunati A. Oliva G. Martinenghi C. Carrafiello G. The role of dual-energy computed tomography (DECT) in emergency radiology: A visual guide to advanced diagnostics Clin. Radiol. 2025 83 106836 10.1016/j.crad.2025.106836 40037137 31. Schwartz F.R. Bache S. Lee R. Maxfield C.M. Fadell M.F. 2nd Gaca A.M. Samei E. Frush D.P. Cao J.Y. Photon-counting CT yields superior abdominopelvic image quality at lower radiation and iodinated contrast doses Pediatr. Radiol. 2025 55 1202 1211 10.1007/s00247-025-06209-2 40111456 32. Willemink M.J. Persson M. Pourmorteza A. Pelc N.J. Fleischmann D. Photon-counting CT: Technical principles and clinical prospects Radiol. Soc. N. Am. Inc. 2018 289 293 312 10.1148/radiol.2018172656 30179101 33. Pannenbecker P. Heidenreich J.F. Huflage H. Gruschwitz P. Patzer T.S. Weng A.M. Grunz J.P. Kunz A.S. Bley T.A. Petritsch B. The Best of Both Worlds: Ultra-high-pitch Pulmonary Angiography with Free-Breathing Technique by Means of Photon-Counting Detector CT for Diagnosis of Acute Pulmonary Embolism Acad. Radiol. 2024 31 5280 5288 10.1016/j.acra.2024.06.028 38969575 34. Pallasch F.B. Rau A. Reisert M. Rau S. Diallo T. Stein T. Faby S. Bamberg F. Weiss J. Photon-counting detector computed tomography for metal artifact reduction: A comparative study of different artifact reduction techniques in patients with orthopedic implants Radiol. Med. 2024 129 890 900 10.1007/s11547-024-01822-x 38689182 PMC11168992 35. Yalynska T. Polacin M. Frauenfelder T. Martini K. Impact of Photon Counting Detector CT Derived Virtual Monoenergetic Images on the Diagnosis of Pulmonary Embolism Diagnostics 2022 12 2715 10.3390/diagnostics12112715 36359558 PMC9689164 36. Remy-Jardin M. Oufriche I. Guiffault L. Duhamel A. Flohr T. Schmidt B. Remy J. Diagnosis of acute pulmonary embolism: When photon-counting-detector CT replaces energy-integrating-detector CT in daily routine Eur. Radiol. 2024 34 6544 6555 10.1007/s00330-024-10724-5 38634875 37. Nehra A.K. Rajendran K. Baffour F.I. Mileto A. Rajiah P.S. Horst K.K. Inoue A. Johnson T.F. Diehn F.E. Glazebrook K.N. Seeing More with Less: Clinical Benefits of Photon-counting Detector CT Radiographics 2023 43 e220158 10.1148/rg.220158 37022956 38. Cè M. Oliva G. Rabaiotti F.L. Macrì L. Zollo S. Aquila A. Cellina M. Portable Dynamic Chest Radiography: Literature Review and Potential Bedside Applications Med. Sci. 2024 12 10 10.3390/medsci12010010 38390860 PMC10885043 39. Yamasaki Y. Abe K. Hosokawa K. Kamitani T. A novel pulmonary circulation imaging using dynamic digital radiography for chronic thromboembolic pulmonary hypertension Eur. Heart J. 2020 41 2506 10.1093/eurheartj/ehaa143 32155252 PMC7368460 40. Yamasaki Y. Kamitani T. Sagiyama K. Hino T. Kisanuki M. Tabata K. Isoda T. Kitamura Y. Abe K. Hosokawa K. Dynamic chest radiography for pulmonary vascular diseases: Clinical applications and correlation with other imaging modalities Jpn. J. Radiol. 2024 42 126 144 10.1007/s11604-023-01483-2 37626168 PMC10811043 41. Bushra F. Chowdhury M.E.H. Sarmun R. Kabir S. Said M. Zoghoul S.B. Mushtak A. Al-Hashimi I. Alqahtani A. Hasan A. Deep learning in computed tomography pulmonary angiography imaging: A dual-pronged approach for pulmonary embolism detection Expert Syst. Appl. 2024 245 123029 10.1016/j.eswa.2023.123029 42. Allena N. Khanal S. The Algorithmic Lung Detective: Artificial Intelligence in the Diagnosis of Pulmonary Embolism Cureus 2023 15 e51006 10.7759/cureus.51006 38259362 PMC10803098 43. Li L. Peng M. Zou Y. Li Y. Qiao P. The promise and limitations of artificial intelligence in CTPA-based pulmonary embolism detection Front. Med. 2025 12 1514931 10.3389/fmed.2025.1514931 PMC11961422 40177281 44. Djahnine A. Lazarus C. Lederlin M. Mulé S. Wiemker R. Si-Mohamed S. Jupin-Delevaux E. Nempont O. Skandarani Y. De Craene M. Detection and severity quantification of pulmonary embolism with 3D CT data using an automated deep learning-based artificial solution Diagn. Interv. Imaging 2024 105 97 103 10.1016/j.diii.2023.09.006 38261553 45. Das M. Mühlenbruch G. Helm A. Bakai A. Salganicoff M. Stanzel S. Liang J. Wolf M. Günther R.W. Wildberger J.E. Computer-aided detection of pulmonary embolism: Influence on radiologists’ detection performance with respect to vessel segments Eur. Radiol. 2008 18 1350 1355 10.1007/s00330-008-0889-x 18292998 46. Cheikh A.B. Gorincour G. Nivet H. May J. Seux M. Calame P. Thomson V. Delabrousse E. Crombé A. How artificial intelligence improves radiological interpretation in suspected pulmonary embolism Eur. Radiol. 2022 32 5831 5842 10.1007/s00330-022-08645-2 35316363 PMC8938594 47. Langius-Wiffen E. de Jong P.A. Hoesein F.A.M. Dekker L. van den Hoven A.F. Nijholt I.M. Boomsma M.F. Veldhuis W.B. Retrospective batch analysis to evaluate the diagnostic accuracy of a clinically deployed AI algorithm for the detection of acute pulmonary embolism on CTPA Insights Imaging 2023 14 102 10.1186/s13244-023-01454-1 37278961 PMC10244304 48. Huang G. Liu Z. van der Maaten L. Weinberger K.Q. Densely Connected Convolutional Networks Available online: http://arxiv.org/abs/1608.06993 (accessed on 1 June 2025) 49. Liu Z. Yuan H. Wang H. CAM-Wnet: An effective solution for accurate pulmonary embolism segmentation Med. Phys. 2022 49 5294 5303 10.1002/mp.15719 35609213 50. Zsarnoczay E. Rapaka S. Schoepf U.J. Gnasso C. Vecsey-Nagy M. Todoran T.M. Hagar M.T. Kravchenko D. Tremamunno G. Griffith J.P. Accuracy of a deep neural network for automated pulmonary embolism detection on dedicated CT pulmonary angiograms Eur. J. Radiol. 2025 187 112077 10.1016/j.ejrad.2025.112077 40187199 51. Huhtanen H. Nyman M. Mohsen T. Virkki A. Karlsson A. Hirvonen J. Automated detection of pulmonary embolism from CT-angiograms using deep learning BMC Med. Imaging 2022 22 43 10.1186/s12880-022-00763-z 35282821 PMC8919639 52. Liu W. Liu M. Guo X. Zhang P. Zhang L. Zhang R. Kang H. Zhai Z. Tao X. Wan J. Evaluation of acute pulmonary embolism and clot burden on CTPA with deep learning Eur. Radiol. 2020 30 3567 3575 10.1007/s00330-020-06699-8 32064559 53. Kahraman A.T. Fröding T. Toumpanakis D. Gustafsson C.J. Sjöblom T. Enhanced classification performance using deep learning based segmentation for pulmonary embolism detection in CT angiography Heliyon 2024 10 e38118 10.1016/j.heliyon.2024.e38118 39398015 PMC11471166 54. Mu W. Liang Y. Hall L.O. Tan Y. Balagurunathan Y. Wenham R. Wu N. Tian J. Gillies R.J. 18F-FDG PET/CT Habitat Radiomics Predicts Outcome of Patients with Cervical Cancer Treated with Chemoradiotherapy Radiol. Artif. Intell. 2020 2 e190218 10.1148/ryai.2020190218 33937845 PMC8082355 55. Soffer S. Klang E. Shimon O. Barash Y. Cahan N. Greenspan H. Konen E. Deep learning for pulmonary embolism detection on computed tomography pulmonary angiogram: A systematic review and meta-analysis Sci. Rep. 2021 11 15814 10.1038/s41598-021-95249-3 34349191 PMC8338977 56. Lanza E. Ammirabile A. Francone M. Meta-analysis of AI-based pulmonary embolism detection: How reliable are deep learning models? Comput. Biol. Med. 2025 193 110402 10.1016/j.compbiomed.2025.110402 40412084 57. Ayobi A. Chang P.D. Chow D.S. Weinberg B.D. Tassy M. Franciosini A. Scudeler M. Quenet S. Avare C. Chaibi Y. Performance and clinical utility of an artificial intelligence-enabled tool for pulmonary embolism detection Clin. Imaging 2024 113 110245 10.1016/j.clinimag.2024.110245 39094243 58. Grenier P.A. Ayobi A. Quenet S. Tassy M. Marx M. Chow D.S. Weinberg B.D. Chang P.D. Chaibi Y. Deep Learning-Based Algorithm for Automatic Detection of Pulmonary Embolism in Chest CT Angiograms Diagnostics 2023 13 1324 10.3390/diagnostics13071324 37046542 PMC10093638 59. Li Y. Zhang L. Liu H. Li Y. Liu Z. Research progress of artificial intelligence and machine learning in pulmonary embolism Front. Med. 2025 12 1577559 10.3389/fmed.2025.1577559 PMC11983447 40212275 60. Naser A.M. Vyas R. Morgan A.A. Kalaiger A.M. Kharawala A. Nagraj S. Agarwal R. Maliha M. Mangeshkar S. Singh N. Role of Artificial Intelligence in the Diagnosis and Management of Pulmonary Embolism: A Comprehensive Review Diagnostics 2025 15 889 10.3390/diagnostics15070889 40218239 PMC11988985 61. Huang S.C. Kothari T. Banerjee I. Chute C. Ball R.L. Borus N. Huang A. Patel B.N. Rajpurkar P. Irvin J. PENet-a scalable deep-learning model for automated diagnosis of pulmonary embolism using volumetric CT imaging NPJ Digit. Med. 2020 3 61 Erratum in NPJ Digit. Med. 2020 3 10.1038/s41746-020-0266-y 32352039 PMC7181770 62. Wu H. Xu Q. He X. Xu H. Wang Y. Guo L. SPE-YOLO: A deep learning model focusing on small pulmonary embolism detection Comput. Biol. Med. 2025 184 109402 10.1016/j.compbiomed.2024.109402 39536384 63. Hagen F. Vorberg L. Thamm F. Ditt H. Maier A. Brendel J.M. Ghibes P. Bongers M.N. Krumm P. Nikolaou K. Improved detection of small pulmonary embolism on unenhanced computed tomography using an artificial intelligence-based algorithm—A single centre retrospective study Int. J. Cardiovasc. Imaging 2024 40 2293 2304 10.1007/s10554-024-03222-8 39196450 64. Belkouchi Y. Lederlin M. Ben Afia A. Fabre C. Ferretti G. De Margerie C. Berge P. Liberge R. Elbaz N. Blain M. Detection and quantification of pulmonary embolism with artificial intelligence: The SFR 2022 artificial intelligence data challenge Diagn. Interv. Imaging 2023 104 485 489 10.1016/j.diii.2023.05.007 37321875 65. Cho S.U. Cho Y.D. Choi S.H. Yoon Y.H. Park J.H. Park S.J. Lee E.S. Assessing the severity of pulmonary embolism among patients in the emergency department: Utility of RV/LV diameter ratio PLoS ONE 2020 15 e0242340 10.1371/journal.pone.0242340 33211719 PMC7676654 66. Park J.I. Kim D. Lee J.A. Zheng K. Amin A. Personalized Risk Prediction for 30-Day Readmissions with Venous Thromboembolism Using Machine Learning J. Nurs. Scholarsh. 2021 53 278 287 10.1111/jnu.12637 33617689 PMC8568050 67. Jin Z.G. Zhang H. Tai M.H. Yang Y. Yao Y. Guo Y.T. Natural Language Processing in a Clinical Decision Support System for the Identification of Venous Thromboembolism: Algorithm Development and Validation J. Med. Internet. Res. 2023 25 e45139 10.2196/43153 PMC10167583 37093636 68. Leidi A. Bex S. Righini M. Berner A. Grosgurin O. Marti C. Risk Stratification in Patients with Acute Pulmonary Embolism: Current Evidence and Perspectives J. Clin. Med. 2022 11 2533 10.3390/jcm11092533 35566658 PMC9104204 69. Barca-Hernando M. Jara-Palomares L. When should we involve interventional radiology in the management of acute pulmonary embolism? Breathe 2023 19 230085 10.1183/20734735.0085-2023 37719239 PMC10501706 70. Pruszczyk P. Klok F.A. Kucher N. Roik M. Meneveau N. Sharp A.S.P. Nielsen-Kudsk J.E. Obradović S. Barco S. Giannini F. Percutaneous treatment options for acute pulmonary embolism: A clinical consensus statement by the ESC Working Group on Pulmonary Circulation and Right Ventricular Function and the European Association of Percutaneous Cardiovascular Interventions EuroIntervention 2022 18 e623 e638 10.4244/EIJ-D-22-00246 36112184 PMC10241264 71. Konstantinides S.V. Meyer G. Becattini C. Bueno H. Geersing G.J. Harjola V.P. Huisman M.V. Humbert M. Jennings C.S. Jiménez D. ESC Scientific Document Group. 2019 ESC Guidelines for the diagnosis and management of acute pulmonary embolism developed in collaboration with the European Respiratory Society (ERS) Eur. Heart J. 2020 41 543 603 10.1093/eurheartj/ehz405 31504429 72. Stevens S.M. Woller S.C. Kreuziger L.B. Bounameaux H. Doerschug K. Geersing G.J. Huisman M.V. Kearon C. King C.S. Knighton A.J. Antithrombotic Therapy for VTE Disease: Second Update of the CHEST Guideline and Expert Panel Report Chest 2021 160 e545 e608 Erratum in Chest 2022 162 10.1016/j.chest.2021.07.055 34352278 73. Kucher N. Boekstegers P. Müller O.J. Kupatt C. Beyer-Westendorf J. Heitzer T. Tebbe U. Horstkotte J. Müller R. Blessing E. Randomized, controlled trial of ultrasound-assisted catheter-directed thrombolysis for acute intermediate-risk pulmonary embolism Circulation 2014 129 479 486 10.1161/CIRCULATIONAHA.113.005544 24226805 74. Tu T. Toma C. Tapson V.F. Adams C. Jaber W.A. Silver M. Khandhar S. Amin R. Weinberg M. Engelhardt T. A Prospective, Single-Arm, Multicenter Trial of Catheter-Directed Mechanical Thrombectomy for Intermediate-Risk Acute Pulmonary Embolism: The FLARE Study JACC Cardiovasc. Interv. 2019 12 859 869 10.1016/j.jcin.2018.12.022 31072507 75. Tapson V.F. Sterling K. Jones N. Elder M. Tripathy U. Brower J. Maholic R.L. Ross C.B. Natarajan K. Fong P. A Randomized Trial of the Optimum Duration of Acoustic Pulse Thrombolysis Procedure in Acute Intermediate-Risk Pulmonary Embolism: The OPTALYSE PE Trial JACC Cardiovasc. Interv. 2018 11 1401 1410 10.1016/j.jcin.2018.04.008 30025734 76. Avgerinos E.D. Jaber W. Lacomis J. Markel K. McDaniel M. Rivera-Lebron B.N. Ross C.B. Sechrist J. Toma C. Chaer R. Randomized Trial Comparing Standard Versus Ultrasound-Assisted Thrombolysis for Submassive Pulmonary Embolism: The SUNSET sPE Trial JACC Cardiovasc. Interv. 2021 14 1364 1373 Erratum in JACC Cardiovasc. Interv. 2021 14 10.1016/j.jcin.2021.04.049 34167677 PMC9057455 77. Netzel A. Iqbal F. Hansra R. Grier L. Ekosonic endovascular system catheter for successful treatment of right atrial thrombus and pulmonary embolism: A case report Chest 2022 162 A798 A799 10.1016/j.chest.2022.08.629 78. Toma C. Jaber W.A. Weinberg M.D. Bunte M.C. Khandhar S. Stegman B. Gondi S. Chambers J. Amin R. Leung D.A. Acute outcomes for the full US cohort of the FLASH mechanical thrombectomy registry in pulmonary embolism EuroIntervention 2023 18 1201 1212 10.4244/EIJ-D-22-00732 36349702 PMC9936254 79. Khandhar S. Jaber W. Bunte M.C. Cho K. Weinberg M.D. Mina B. Stegman B. Pollak J. Khosla A. Elmasri F. Longer-Term Outcomes Following Mechanical Thrombectomy for Intermediate- and High-Risk Pulmonary Embolism: 6-Month FLASH Registry Results J. Soc. Cardiovasc. Angiogr. Interv. 2023 2 101000 10.1016/j.jscai.2023.101000 39131661 PMC11307656 80. Silver M.J. Gibson C.M. Giri J. Khandhar S. Jaber W. Toma C. Mina B. Bowers T. Greenspon L. Kado H. Outcomes in High-Risk Pulmonary Embolism Patients Undergoing FlowTriever Mechanical Thrombectomy or Other Contemporary Therapies: Results From the FLAME Study Circ. Cardiovasc. Interv. 2023 16 e013406 10.1161/CIRCINTERVENTIONS.123.013406 37847768 PMC10573120 81. Jaber W.A. Gonsalves C.F. Stortecky S. Horr S. Pappas O. Gandhi R.T. Pereira K. Giri J. Khandhar S.J. Ammar K.A. Large-Bore Mechanical Thrombectomy Versus Catheter-Directed Thrombolysis in the Management of Intermediate-Risk Pulmonary Embolism: Primary Results of the PEERLESS Randomized Controlled Trial Circulation 2025 151 260 273 10.1161/CIRCULATIONAHA.124.072364 39470698 PMC11789609 82. Sista A.K. Horowitz J.M. Tapson V.F. Rosenberg M. Elder M.D. Schiro B.J. Dohad S. Amoroso N.E. Dexter D.J. Loh C.T. EXTRACT-PE Investigators. Indigo Aspiration System for Treatment of Pulmonary Embolism: Results of the EXTRACT-PE Trial JACC Cardiovasc. Interv. 2021 14 319 329 10.1016/j.jcin.2020.09.053 33454291 83. Moriarty J.M. Dohad S.Y. Schiro B.J. Tamaddon H. Heithaus R.E. Iliadis E.A. Dexter D.J. 2nd Shavelle D.M. Leal S.R.N. Attallah A.S. Clinical, Functional, and Quality-of-Life Outcomes after Computer Assisted Vacuum Thrombectomy for Pulmonary Embolism: Interim Analysis of the STRIKE-PE Study J. Vasc. Interv. Radiol. 2024 35 1154 1165.e6 10.1016/j.jvir.2024.04.028 38729421 84. Angelini G. Maharaj S. McCarthy A. Martinez A. Gomez J. Rampersad R. Thrombo-Aspiration in a High-Risk Case of Pulmonary Embolism J. Clin. Case Rep. 2024 2 1011 10.52768/2996-590X/1011 85. Li K. Cui M. Zhang K. Liang K. Liu H. Zhai S. Treatment of acute pulmonary embolism using rheolytic thrombectomy EuroIntervention 2021 17 E158 E166 10.4244/EIJ-D-20-00259 32863245 PMC9725013 86. Akbal Ö.Y. Keskin B. Tokgöz H.C. Hakgör A. Karagöz A. Tanyeri S. Kültürsay B. Külahçıoğlu Ş. Bayram Z. Efe S. A seven-year single-center experience on AngioJet rheolytic thrombectomy in patients with pulmonary embolism at high risk and intermediate-high risk Anatol. J. Cardiol. 2021 25 902 911 10.5152/AnatolJCardiol.2021.28303 34866585 PMC8654010 87. Bashir R. Foster M. Iskander A. Darki A. Jaber W. Rali P.M. Lakhter V. Gandhi R. Klein A. Bhatheja R. Pharmacomechanical Catheter-Directed Thrombolysis with the Bashir Endovascular Catheter for Acute Pulmonary Embolism: The RESCUE Study JACC Cardiovasc. Interv. 2022 15 2427 2436 10.1016/j.jcin.2022.09.011 36121244 88. Agnelli G. Becattini C. Anticoagulant treatment for acute pulmonary embolism: A pathophysiology-based clinical approach Eur. Respir. J. 2015 45 1142 1149 10.1183/09031936.00164714 25700388 89. Konstantinides S. Geibel A. Heusel G. Heinrich F. Kasper W. Heparin plus alteplase compared with heparin alone in patients with submassive pulmonary embolism N. Engl. J. Med. 2002 347 1143 1150 10.1056/NEJMoa021274 12374874 90. Wan S. Quinlan D.J. Agnelli G. Thrombolysis compared with heparin for the initial treatment of pulmonary embolism: A meta-analysis of the randomized controlled trials Circulation 2004 110 744 749 10.1161/01.CIR.0000137826.09715.9C 15262836 91. Meyer G. Vicaut E. Danays T. Agnelli G. Becattini C. Beyer-Westendorf J. Bluhmki E. Bouvaist H. Brenner B. Couturaud F. PEITHO Investigators. Fibrinolysis for patients with intermediate-risk pulmonary embolism N. Engl. J. Med. 2014 370 1402 1411 10.1056/NEJMoa1302097 24716681 92. Murguia A.R. Mukherjee D. Ojha C. Reduced-dose thrombolysis in acute pulmonary embolism a systematic review Angiology 2023 75 208 218 10.1177/00033197231167062 37060258 93. Rosa A. Murguia A.R. Brockman M.J. Mukherjee D. Rajachandran M. Nickel N.P. Low-dose Systemic Tissue-type-plasminogen-activator Compared to Conventional Anti-coagulation for the Treatment of Intermediate-high Risk Pulmonary Embolism Cardiovasc. Hematol. Disord. Targets 2025 25 46 53 10.2174/011871529X349173250119114056 39886780 94. Güner A. Güner E.G. Karakurt S. Kalçık M. Efficacy and Safety of Low-Dose Systemic Fibrinolytic Therapy for Acute Submassive Pulmonary Embolism JACC Cardiovasc. Interv. 2021 14 809 10.1016/j.jcin.2021.01.043 33826502 95. Zhang L.Y. Gao B.A. Jin Z. Xiang G.M. Gong Z. Zhang T.T. Lu H.F. Wang Y.Q. Gong Y. Lu C. Clinical efficacy of low dose recombinant tissue-type plasminogen activator for the treatment of acute intermediate-risk pulmonary embolism Saudi Med. J. 2018 39 1090 1095 10.15537/smj.2018.11.22717 30397707 PMC6274653 96. Schultz J. Giordano N. Zheng H. Parry B.A. Barnes G.D. Heresi G.A. Jaber W. Wood T. Todoran T. Courtney D.M. EXPRESS: A Multidisciplinary Pulmonary Embolism Response Team (PERT)—Experience from a national multicenter consortium Pulm. Circ. 2019 9 1 10 10.1177/2045894018824563 30632901 PMC6690111 97. Gardner T.A. Fuher A. Longino A. Sink E.M. Jurica J. Park B. Lindquist J. Bull T.M. Hountras P. Reduced mortality associated with pulmonary embolism response team consultation for intermediate and high-risk pulmonary embolism: A retrospective cohort study Thromb. J. 2024 22 38 10.1186/s12959-024-00605-8 38641802 PMC11027408 98. Fleitas Sosa D. Lehr A.L. Zhao H. Roth S. Lakhther V. Bashir R. Cohen G. Panaro J. Maldonado T.S. Horowitz J. Impact of pulmonary embolism response teams on acute pulmonary embolism: A systematic review and meta-analysis Eur. Respir. Rev. 2022 31 220023 10.1183/16000617.0023-2022 35831010 PMC9724819 99. Sterling K.M. Goldhaber S.Z. Sharp A.S.P. Kucher N. Jones N. Maholic R. Meneveau N. Zlotnick D. Sayfo S. Konstantinides S.V. Prospective Multicenter International Registry of Ultrasound-Facilitated Catheter-Directed Thrombolysis in Intermediate-High and High-Risk Pulmonary Embolism (KNOCOUT PE) Circ. Cardiovasc. Interv. 2024 17 e013448 10.1161/CIRCINTERVENTIONS.123.013448 38264938 PMC10942169 100. Sista A.K. Troxel A.B. Tarpey T. Parpia S. Goldhaber S.Z. Stringer W.W. Magnuson E.A. Cohen D.J. Kahn S.R. Rao S.V. Rationale and design of the PE-TRACT trial: A multicenter randomized trial to evaluate catheter-directed therapy for the treatment of intermediate-risk pulmonary embolism Am. Heart J. 2025 281 112 122 10.1016/j.ahj.2024.11.016 39638275 PMC11810573 Figure 1 ( A B Figure 2 Iodine maps help detect segmental perfusion deficits, hard to detect on traditional CTPA, visible as defects in iodine contents (blue arrows, ( A B Figure 3 Pulmonary blood volume map derived from PC acquisition, showing iodine distribution. The perfusion is almost homogeneous in ( A B B Figure 4 The perfusion algorithm uses the reference frame subtraction method to analyze the degree of pixel value change from the baseline timing (end-diastolic phase) ( A B Figure 5 DDR perfusion assessment of a lung cancer patient, presenting dyspnea and raised D-dimer values. The traditional X-Ray ( A B Figure 6 65-year-old male affected by bilateral pulmonary embolism treated with FlowTriever system. ( A B C D jcdd-12-00333-t001_Table 1 Table 1 Advantages and disadvantages of the different imaging techniques in APE diagnosis. CTPA: Computed Tomography Pulmonary Angiography; VMI: Virtual Monochromatic Image; VNC: Virtual Non-Contrast; RV: Right Ventricle; APE: Acute Pulmonary Embolism. Technique Pros Cons High-Pitch CT - Very fast scan time (<1 s) - Slightly lower contrast opacification and increased noise in segmental arteries Dual-Energy CT (DECT) - Combines anatomical and perfusion imaging - Variable diagnostic performance depending on protocol and post-processing Photon-Counting CT (PC) - Superior spatial and contrast resolution - Expensive and limited current availability Dynamic Digital Radiography (DDR) - No contrast medium required - Limited spatial resolution jcdd-12-00333-t002_Table 2 Table 2 This table provides a summary based on the specific performance metrics (Sensitivity, Specificity, Area Under the Curve—AUC) available for each mentioned AI tool. Name of the Tool Specificity Sensitivity AUC CINA-PE (Avicenna.AI) [ 57 58 94.8% 93.9% AUC: 0.92 Aidoc [ 60 95.8% 92.6% AUC: 0.87 Retina U-Net/nnDetection (unenhanced CT) [ 56 N/A Varies by location: N/A Deep Learning Algorithm (Liu et al.) [ 52 76.5% 94.6% AUC: 0.92 Deep Learning Model (Huhtanen et al.) [ 51 86.6% 93.5% AUC: 0.91 End-to-end DL Model (Huang et al.) [ 48 N/A N/A AUC: 0.84–0.85 Deep Learning Algorithm (Li et al.) [ 59 95.5% 92.7% AUC: 0.95 nnU-Net-based Algorithm (Kahraman et al.) [ 53 94.6% 96.1% N/A ",
  "metadata": {
    "Title of this paper": "Rationale and design of the PE-TRACT trial: A multicenter randomized trial to evaluate catheter-directed therapy for the treatment of intermediate-risk pulmonary embolism",
    "Journal it was published in:": "Journal of Cardiovascular Development and Disease",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471078/"
  }
}