{
  "title": "Paper_142",
  "abstract": "pmc EFORT Open Rev EFORT Open Rev 3182 efortor EOR EFORT Open Reviews 2058-5241 Bioscientifica Ltd. PMC12495883 PMC12495883.1 12495883 12495883 41031628 10.1530/EOR-2025-0041 EOR-2025-0041 1 Spine spine Spine Progress in diagnosis and treatment of primary spondylodiscitis: a systematic literature review Yu Dongdong Kang Yongjian Lu Wenxin https://orcid.org/0000-0002-8028-0182 Chen Bin Department of Orthopedic Surgery, First Affiliated Hospital, Zhejiang University School of Medicine Hangzhou China Correspondence should be addressed to B Chen: ttbin@zju.edu.cn 01 10 2025 10 2025 10 10 498264 815 828 01 10 2025 05 10 2025 05 10 2025 © the author(s) 2025 the author(s) https://creativecommons.org/licenses/by/4.0/ Creative Commons Attribution 4.0 International License. Objective Primary spondylodiscitis poses significant diagnostic and therapeutic challenges, with delayed diagnosis or improper treatment potentially resulting in severe complications. This systematic review aimed to summarize the latest diagnostic and therapeutic approaches for primary spondylodiscitis. Methods Adhering to PRISMA 2020 guidelines, we conducted a systematic literature review. PubMed was comprehensively searched for English-language original studies from January 1, 1990, to October 31, 2024. Structured queries combined keywords and MeSH terms relevant to spondylodiscitis, vertebral osteomyelitis, spinal infection, and associated treatments. Two reviewers independently screened titles, abstracts, and full texts, with manual bibliography searches as a supplement. A total of 147 articles were finally included. Results The literature indicates that diagnosis can be based on clinical suspicion, using serological, radiological, and microbiological tests. Newer methods such as metagenomics next-generation sequencing (mNGS) and positron emission tomography-computed tomography (PET-CT) can enhance diagnostic sensitivity and specificity. For confirmed cases, appropriate antibiotic therapy is crucial. Surgical treatment can benefit patients with neurological deficits, sepsis, spinal instability/deformity, epidural abscesses, or failed conservative treatment, accelerating recovery and reducing complications. Minimally invasive surgical approaches may also serve as an alternative to open surgery for select patients. Conclusion Although new technologies have improved diagnostic accuracy and treatment success rates for primary spondylodiscitis, establishing a robust staging system is vital to ensure patients receive effective, evidence-based treatment options. Keywords primary spondylodiscitis artificial intelligence metagenomics next generation sequencing Zhejiang Provincial Natural Science Foundation of China under Grant LQ22H100003 The Medical Health Science and Technology Project of Zhejiang Provincial Health Commission 2020KY132 The Zhejiang Province Leading Geese Plan 2025C02170 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ifp:collection spine Introduction Primary spondylodiscitis is infrequent in Western nations, with an incidence ranging from 1:100,000 to 1:250,000. Conversely, developing countries exhibit a higher incidence than their developed counterparts ( 1 2 3 4 5 6 7 8 Diagnosing spondylodiscitis early is challenging due to its rarity and the atypical nature of clinical signs and symptoms, leading to a consistent delay in diagnosis. Delayed diagnosis results in severe consequences, including neurological deficits, vertebral instability, spinal deformity, or sepsis ( 9 10 11 Likewise, spondylodiscitis presents controversies and treatment challenges. Diagnostic difficulties impede the selection of optimal anti-infective treatments. The inherent drug resistance in spondylodiscitis necessitates prolonged antibiotic courses, resulting in disease recurrence and drug toxicity accumulation. Unwise timing for surgery selection leads to delayed procedures and inferior surgical outcomes ( 12 13 Therefore, this article provides an overview of unresolved issues, aiming to identify protocols for accurate and timely diagnosis and treatment, thereby contributing to the effective management of spondylodiscitis. This article comprehensively addresses primary spondylodiscitis affecting the entire spinal column, encompassing the cervical, thoracic, lumbar, and sacral regions. While acknowledging anatomical and biomechanical variations across spinal segments, we focus on the shared diagnostic and therapeutic principles of this condition, while highlighting segment-specific considerations, particularly regarding surgical approaches and neurological risks where applicable. Methods We conducted a systematic literature review in accordance with the PRISMA 2020 guidelines ( 14 Following are the inclusion criteria for the selected studies: i) only empirical studies, peer-reviewed studies, and journal publications were included. ii) Studies were included from January 1, 1990, to October 31, 2024. iii) Studies were included only if they were in the English language. iv) Studies were included only if they related to primary spondylodiscitis as a specific cohort. Studies were excluded if they met the following criteria: i) conference proceeding papers, general magazine articles, commentaries, opinion pieces, newsletters, and any gray or secondary literature were excluded. ii) Studies were excluded if they were not in the English language. iii) Studies that were not about primary spondylodiscitis were excluded. Two reviewers worked independently to screen the titles and abstracts, as well as the full texts of the articles. To ensure a thorough search, we also manually searched bibliographies for additional relevant studies. We maintained a record of the selection process, including the reasons for exclusions. This information was then summarized in a PRISMA flow diagram, which is presented as Fig. 1 Figure 1 PRISMA flow chart of the systematic literature review for primary spondylodiscitis. Results This review encompassed a comprehensive analysis of 148 included studies. The distribution of research methodologies was diverse: quantitative designs predominated (92 studies, 62.2%), including retrospective cohort studies, randomized controlled trials (RCTs), diagnostic tests, and meta-analyses. Qualitative methodologies were employed in 43 studies (29.1%), comprising systematic reviews, clinical guidelines, and case reports. A further 13 studies (8.8%) utilized mixed-methods approaches. Geographically, the studies demonstrated a wide international scope with shifts in regional contributions: research originating from China constituted the largest single-country cohort (43 studies, 29.1%), followed by the United States (38 studies, 25.7%) and various European countries collectively (38 studies, 25.7%). The included studies were predominantly published in high-impact journals. The vast majority (100 studies, 67.6%) appeared in JCR Q1 journals. A significant portion was published in Q2 journals (33 studies, 22.3%), while Q3/Q4 journals accounted for 15 studies (10.1%). Publication dates revealed a strengthened recent focus: 74 studies (50.0%) were published between 2020 and 2024, peaking in 2023 with 33 studies. The research focus evolved over time, shifting from foundational pathology and open surgery towards diagnostic standards, optimized conservative management, and, increasingly, minimally invasive techniques and AI applications in the most recent period. Thematic analysis showed a primary emphasis on treatment strategies (75 studies, 50.7%), covering surgical approaches and antibiotic regimens. Diagnostic technologies were the focus of 49 studies (33.1%), including advancements in imaging, biopsy techniques, and metagenomic next-generation sequencing (mNGS). Emerging technologies, particularly AI and endoscopic applications, were explored in 24 studies (16.2%). Discussion The in-depth analysis of the reviewed articles was conducted under different thematic categories of primary spondylodiscitis. The results of this thematic analysis will be presented separately in the following text, followed by an overall discussion. Etiology Primary spinal infections can be broadly categorized as pyogenic or non-pyogenic. Pyogenic infections are typically caused by bacteria such as Staphylococcus aureus and Escherichia coli, which induce acute suppurative inflammation. In contrast, non-pyogenic infections encompass granulomatous pathogens, including Mycobacterium tuberculosis (MTB), Brucella spp., and fungi, which often present with an indolent course. This classification guides the subsequent pathogen-specific review. Tuberculous spondylodiscitis MTB, a representative non-pyogenic pathogen, is one of the leading global causes of spondylodiscitis. A systematic review of 1,060 cases with microbiologic details found that 30.9% were attributed to MTB ( 15 16 17 Non-tuberculous spondylodiscitis Staphylococcus aureus is the predominant non-tuberculous pathogen. The systematic review indicated that 40.3% of cases were attributed to Staphylococcus spp., and 28.3% to other bacterial pathogens; fungal (0.5%) and viral (0.1%) etiologies were relatively rare ( 15 18 Regardless of pyogenic or non-pyogenic classification, the thoracolumbar and lumbar regions of the spine are the most commonly affected, while the lumbosacral and upper cervical thoracic segments are less frequently involved ( 12 19 20 21 22 Protracted delays in diagnosis and treatment are associated with a poor prognosis ( 23 24 25 26 27 28 29 Therefore, timely and systematic assessment is essential for the accurate diagnosis and effective management of this disease. Diagnosis The diagnostic approaches discussed below are applicable to spondylodiscitis regardless of spinal level, although imaging interpretation and biopsy access may vary technically. Due to the widespread occurrence of lumbar back and radicular pain, diagnosis is frequently delayed, as indicated by a mean diagnostic duration of 2–4 months in a study ( 30 31 32 33 34 35 Laboratory diagnosis of patients with spondylodiscitis includes white blood cell count, erythrocyte sedimentation rate, and C-reactive protein (CRP). While they serve as diagnostic references, they lack sufficient sensitivity and specificity. Elevated CRP values are present in more than 90% of spondylodiscitis cases, so significant elevation of CRP is the most reliable marker ( 36 37 Imaging evaluation of patients with spondylodiscitis includes X-rays, computed tomography (CT) scans, and magnetic resonance imaging (MRI) ( 38 39 40 41 42 11 43 44 45 46 47 28 Isolating pathogenic microorganisms is essential for spondylodiscitis management, guiding the selection of appropriate antibiotics ( 48 8 49 50 51 52 53 Recent advancements in NGS have significantly addressed the microbiologic diagnostic challenges of spondylodiscitis ( 54 52 55 56 57 58 59 60 61 62 Currently, AI contributes to the diagnosis and risk prediction of spinal infections. AI technology can analyze spinal imaging through deep learning algorithms to rapidly identify infected areas and differentiate between types of spinal infections ( 63 64 65 66 67 68 69 Table 1 Table 1 A summary of research on the application of artificial intelligence to spinal infections. Study Study population Research purpose Research variables Methodologies Results, AUC Feng et al. 68 TS patients Predicting SCI Clinical characteristics RF model 0.816 Chen et al. 67 TS or BS patients Differentiate TS from BS MRI VGG19 0.973 Oz Haim et al. 64 Patients with various spinal pathologies Differentiate between spinal pathologies Preop MRI and post-op pathological results A deep learning model built on the Fast.ai framework on top of the PyTorch environment 0.78 Zhang et al. 69 Spine surgery patients Predicting postoperative SSI following spine surgery Clinical characteristics NBM 0.95 Shuo et al. 65 TS & SM patients Discriminating between spinal TS and SM MRI MViTv2 0.98 Mukaihata et al. 66 PS & SMC patients Differentiate spinal pyogenic spondylitis from modic change MRI CNN 0.95 Liu et al. 63 Postop SSI after LSS patients Predict SSI risk in patients after LSS Clinical characteristics GBM 0.923 TS, tuberculous spondylitis; BS, brucellar spondylitis; SSI, surgical site infection; LSS, lumbar spinal surgery; SM, spinal metastases; SCI, spinal cord injury; PS, pyogenic spondylitis; SMC, spinal modic change; RF, random forest; NBM, Naive Bayes Model; MViTv2, Multiscale Vision Transformers; MRI, magnetic resonance imaging; CNN, convolutional neural network; GBM, gradient boosting machine; VGG19, Visual Geometry Group 19-layer Network. Therapy The management of spondylodiscitis remains a contentious issue, encompassing the optimal timing for antibiotic therapy and the criteria and methods for surgical intervention ( 70 28 Antibiotic therapy If the patient stays stable, antibiotics should be initiated following the collection of a culture sample. In critically ill patients or those with negative culture results, intravenous empiric broad-spectrum antibiotic therapy is indicated, commonly consisting of third-generation cephalosporins or fluoroquinolones in conjunction with clindamycin or vancomycin ( 71 72 73 The duration of antibiotic therapy remains controversial and is influenced by the patient’s immune status, pathogenic bacterial species, resistance, and internal fixation status ( 74 75 Surgical clearance can shorten parenteral antibiotic use in select patients ( 76 77 78 79 80 81 82 83 Brucella infections are primarily treated with doxycycline and rifampicin, potentially with aminoglycosides. Complicated cases may require more prolonged antibiotic courses compared to uncomplicated cases ( 84 85 Surgical management The surgical management of spondylodiscitis remains controversial, attributable to the absence of a standardized classification system and universally acknowledged surgical guidelines ( 86 87 24 28 88 89 Spinal stability serves as a crucial determinant in guiding surgical decisions for spondylodiscitis. Similar to metastatic spinal tumors, spondylodiscitis results in the chronic instability of the spine, distinguishing it from the acute instability induced by traumatic injuries ( 90 91 92 93 Optimal treatment selection for spondylodiscitis involves considerations beyond spinal stability; aspects such as overall patient health, neurological status, and patient preferences necessitate thorough evaluation ( 94 95 96 97 98 99 100 101 102 103 104 105 The general health of the patient has a significant impact on the decision to operate for spondylodiscitis. For critically ill patients with spondylodiscitis, delayed surgery (performed 3 days after admission), especially between 10 and 14 days post-admission, is associated with lower mortality. These findings highlight the potential benefits of considering surgical timing to improve patient outcomes ( 106 107 108 109 110 111 Immunocompromised patients, including those with Acquired Immune Deficiency Syndrome, organ transplantation, a history of intravenous drug abuse, prolonged steroid therapy, hematologic malignancies ( 112 113 114 115 116 5 62 116 117 118 5 Surgical access and method should be tailored to the pathogen’s characteristics, lesion location, and nature ( 119 120 102 121 In thoracolumbar spondylodiscitis, one-stage posterior decompression and debridement with internal fixation typically yield favorable clinical outcomes, encompassing effective infection control, relief from back pain, correction of kyphosis, and partial or solid fusion ( 122 123 124 37 125 126 127 99 128 99 129 Minimally Invasive Spine Surgery (MISS) has profoundly influenced spondylodiscitis treatment, offering patients cost-effective and advantageous surgical treatment. The safety and efficacy of thoracoscopic access in the management of spondylodiscitis in the thoracic spine segment have been demonstrated at certain institutions ( 130 131 132 133 134 124 135 Table 2 136 Table 2 Application of minimally invasive spinal surgery in the treatment of spinal infections. Disease type Cases, n Surgical procedure Result Study Spinal TB 16 VATS 88% had good neurologic recovery Kapoor et al. 130 Spinal TB 23 VATS 94% had neurologic recovery Jayaswal et al. 142 Spinal TB 15 VATS Average neurological recovery was 1.44 grades on the scale by Frankel et al. Zheng et al. 149 Thoracic or lumbar TB 42 PPS fixation Pain decreased; less operative time, blood loss and shorter hospital stay Guo et al. 132 PS 125 PPS fixation Less operative time, blood loss and shorter hospital stay Janssen et al. 134 Single segment lumbar TB 60 OLIF Less operative time, blood loss and shorter hospital stay Du et al. 143 Lumbar TB 22 PPS fixation and minimally invasive LSILD and bone graft fusion Less bleeding, less trauma, and faster recovery Chen et al. 144 IS 17 PEDD 82% had good neurologic recovery Choi et al. 135 IS 24 Percutaneous endoscopic surgery No spinal instability Lin et al. 145 IS 60 Endoscopic surgery 2 (3.3%) experienced infection relapse Lin et al. 146 High-risk patients with spondylodiscitis 14 FEDD Significant improvement in symptoms Lin et al. 147 IS 28 PTD Immediate pain relief rate: 75%; long-term FU success rate: 68% Hadjipavlou et al. 148 PS, pyogenic spondylodiscitis; LSILD, lateral small incisions lesion debridement; IS, infectious spondylodiscitis; TB, tuberculosis; FU, follow-up; VATS, video-assisted thoracoscopic surgery; pps, percutaneous pedicle screw; OLIF, oblique lateral interbody fusion combined with percutaneous pedicle screw fixation; PEDD, percutaneous endoscopic debridement and drainage; FEDD, full endoscopic debridement and drainage; PTD, percutaneous transpedicular discectomy. Improvement in clinical algorithm of primary spondylodiscitis The primary spondylodiscitis diagnosis and treatment process proposed in this review ( Fig. 2 28 Figure 2 A proposed algorithm for the treatment of primary spondylodiscitis (CRP, C-reactive protein; ESR, erythrocyte sedimentation rate; WBC, white blood cell; MRI, magnetic resonance imaging; CT, computed tomography; PET-CT, positron emission tomography-computed tomography; MISS, minimally invasive spine surgery; mNGS, metagenomic next-generation sequencing; MDT, multidisciplinary treatment). First, unlike the current guidelines that use mNGS as a salvage method after negative culture results, this algorithm incorporates mNGS in parallel with routine culture for initial pathogen detection, and simultaneously introduces AI-driven imaging analysis. Second, unlike the IDSA guidelines that recommend PET-CT only when MRI is contraindicated, this process emphasizes the importance of PET-CT when the initial assessment is uncertain, thus avoiding repeated invasive procedures. Third, a multidisciplinary team (MDT) decision-making node has been established, requiring all confirmed patients to be jointly assessed by infectious disease, spinal surgery, imaging, and microbiology physicians before treatment initiation ( 137 138 Finally, MISS has been upgraded from a supplementary to a first-line option, with clear indications (single-segment lesions, high functional demands, and multiple comorbidities). The core innovation of this algorithm lies in creating a closed-loop system of ‘precise diagnosis, intelligent decision, minimally invasive intervention’. Early molecular diagnosis (mNGS) and AI imaging solve the problem of delayed diagnosis. The MDT mechanism enables rapid and effective treatment decisions. MISS technology integration promotes a shift in surgical intervention from ‘trauma control’ to ‘function preservation’. This provides an operable clinical framework for establishing a spinal infection staging system and is expected to be a key reference for future guideline updates. Summary and outlook Spondylodiscitis is an infrequent and impactful condition associated with severe consequences, including spinal deformity, nerve damage, and paralysis, often exacerbated by delayed diagnosis and treatment. The adoption of standardized and timely conservative or surgical interventions proves instrumental in mitigating these risks. The novel technologies further enhance the diagnostic and therapeutic landscape for spondylodiscitis. mNGS serves as a swift and effective tool, utilizing high-throughput data for the precise identification of pathogenic bacteria, thereby guiding antibiotic treatments. PET-CT, serving as a valuable adjunct to MRI, exhibits commendable accuracy in early-stage diagnosis, demonstrating superior sensitivity and specificity. The pervasive application of AI, particularly through machine learning, holds significant promise across the realms of diagnosis, prevention, and prognostic assessment of spondylodiscitis ( 63 139 140 141 ICMJE Statement of Interest The authors declare that there is no conflict of interest that could be perceived as prejudicing the impartiality of the work reported. Funding Statement This research was supported by Zhejiang Provincial Natural Science Foundation of China under Grant The Medical Health Science and Technology Project of Zhejiang Provincial Health Commission The Zhejiang Province Leading Geese Plan References 1 Cottle L Riordan T Infectious spondylodiscitis J Infect 2008 56 401 412 10.1016/j.jinf.2008.02.005 18442854 2 Gregori F Grasso G Iaiani G et al. Treatment algorithm for spontaneous spinal infections: a review of the literature J Craniovertebr Junction Spine 2019 10 3 9 10.4103/jcvjs.jcvjs_115_18 31000972 PMC6469318 3 Jeon S Yu D Bae SW et al. Analysis of clinical factors associated with medical burden and functional status in pyogenic spine infection J Clin Med 2023 12 2551 10.3390/jcm12072551 37048635 PMC10095451 4 Mavrogenis AF Megaloikonomos PD Igoumenou VG et al. Spondylodiscitis revisited EFORT Open Rev 2017 2 447 461 10.1302/2058-5241.2.160062 29218230 PMC5706057 5 Rule R Mitton B Govender NP et al. Spinal epidural abscess caused by aspergillus spp masquerading as spinal tuberculosis in a person with HIV Lancet Infect Dis 2021 21 e356 e362 10.1016/s1473-3099(20)30979-8 34599872 6 Wang MS Han C Wang JL et al. The prevalence, diagnosis and surgical risk factors of spinal tuberculosis in children Trop Med Int Health 2020 25 834 838 10.1111/tmi.13411 32358838 7 Abreu P Lourenco JA Romero C et al. Endoscopic treatment of spondylodiscitis: systematic review Eur Spine J 2022 31 1765 1774 10.1007/s00586-022-07142-w 35211807 8 Gouliouris T Aliyu SH Brown NM Spondylodiscitis: update on diagnosis and management J Antimicrob Chemother 2010 65 Supplement 3 iii11 iii24 10.1093/jac/dkq303 20876624 9 Mylona E Samarkos M Kakalou E et al. Pyogenic vertebral osteomyelitis: a systematic review of clinical characteristics Semin Arthritis Rheum 2009 39 10 17 10.1016/j.semarthrit.2008.03.002 18550153 10 Pola E Logroscino CA Gentiempo M et al. Medical and surgical treatment of pyogenic spondylodiscitis Eur Rev Med Pharmacol Sci 2012 16 Supplement 2 35 49 22655482 11 Maamari J Grach SL Passerini M et al. The use of MRI, PET/CT, and nuclear scintigraphy in the imaging of pyogenic native vertebral osteomyelitis: a systematic review and meta-analysis Spine J 2023 23 868 876 10.1016/j.spinee.2023.01.019 36754150 12 Koutserimpas C Naoum S Melissinos EP et al. Spinal infections caused by Coccidioides species Maedica 2023 18 209 215 10.26574/maedica.2023.18.2.209 37588822 PMC10427092 13 Saeed K Esposito S Ascione T et al. Hot topics on vertebral osteomyelitis from the international society of antimicrobial chemotherapy Int J Antimicrob Agents 2019 54 125 133 10.1016/j.ijantimicag.2019.06.013 31202920 14 Page MJ McKenzie JE Bossuyt PM et al. The PRISMA 2020 statement: an updated guideline for reporting systematic reviews Syst Rev 2021 10 89 10.1186/s13643-021-01626-4 33781348 PMC8008539 15 Gentile L Benazzo F De Rosa F et al. A systematic review: characteristics, complications and treatment of spondylodiscitis Eur Rev Med Pharmacol Sci 2019 23 117 128 10.26355/eurrev_201904_17481 30977878 16 Igbokwe V Ruby LC Sultanli A et al. Post-tuberculosis sequelae in children and adolescents: a systematic review Lancet Infect Dis 2023 23 e138 e150 10.1016/s1473-3099(23)00004-x 36963920 17 Dureja S Sen IB Acharya S Potential role of f18 FDG PET-CT as an imaging biomarker for the noninvasive evaluation in uncomplicated skeletal tuberculosis: a prospective clinical observational study Eur Spine J 2014 23 2449 2454 10.1007/s00586-014-3483-8 25070791 18 Tali ET Koc AM Oner AY Spinal brucellosis Neuroimaging Clin N Am 2015 25 233 245 10.1016/j.nic.2015.01.004 25952175 19 Mulleman D Mammou S Griffoul I et al. Characteristics of patients with spinal tuberculosis in a French teaching hospital Joint Bone Spine 2006 73 424 427 10.1016/j.jbspin.2005.10.013 16488649 20 Wang H Li C Wang J et al. Characteristics of patients with spinal tuberculosis: seven-year experience of a teaching hospital in southwest China Int Orthop 2012 36 1429 1434 10.1007/s00264-012-1511-z 22358176 PMC3385881 21 Merino P Candel FJ Gestoso I et al. Microbiological diagnosis of spinal tuberculosis Int Orthop 2012 36 233 238 10.1007/s00264-011-1461-x 22252412 PMC3282864 22 Liu M Lu L Liu Q et al. FDG PET/CT in disseminated intracranial and intramedullary spinal cord tuberculomas Clin Nucl Med 2021 46 266 269 10.1097/rlu.0000000000003483 33443950 23 Mackenzie AR Laing RB Smith CC et al. Spinal epidural abscess: the importance of early diagnosis and treatment J Neurol Neurosurg Psychiatry 1998 65 209 212 10.1136/jnnp.65.2.209 9703173 PMC2170211 24 Park J Han S Jeon Y et al. Spinal epidural abscess as predicting factor for the necessity of early surgical intervention in patients with pyogenic spondylitis BMC Musculoskelet Disord 2023 24 586 10.1186/s12891-023-06703-4 37464374 PMC10355007 25 Chen J Xue L Li X et al. A combined scoring method based on 18f-FDG PET/CT for distinguishing spinal infection from malignancy Spine 2023 48 270 277 10.1097/brs.0000000000004528 36692156 26 Thavarajasingam SG Vemulapalli KV Vishnu K S et al. Conservative versus early surgical treatment in the management of pyogenic spondylodiscitis: a systematic review and meta-analysis Sci Rep 2023 13 15647 10.1038/s41598-023-41381-1 37730826 PMC10511402 27 Jeyaraman N Jeyaraman M Nallakumarasamy A et al. A proposed management classification for spinal brucellosis from India Trav Med Infect Dis 2023 54 102614 10.1016/j.tmaid.2023.102614 37392982 28 Berbari EF Kanj SS Kowalski TJ et al. 2015 Infectious Diseases Society of America (IDSA) Clinical Practice Guidelines for the diagnosis and treatment of native vertebral osteomyelitis in adultsa Clin Infect Dis 2015 61 e26 e46 10.1093/cid/civ482 26229122 29 Kim J Oh SH Kim SW et al. The epidemiology of concurrent infection in patients with pyogenic spine infection and its association with early mortality: a nationwide cohort study based on 10,695 patients J Infect Public Health 2023 16 981 988 10.1016/j.jiph.2023.04.010 37148755 30 Gasbarrini AL Bertoldi E Mazzetti M et al. Clinical features, diagnostic and therapeutic approaches to haematogenous vertebral osteomyelitis Eur Rev Med Pharmacol Sci 2005 9 53 66 15852519 31 Buranapanitkit B Lim A Geater A Misdiagnosis in vertebral osteomyelitis: problems and factors J Med Assoc Thai 2001 84 1743 1750 11999822 32 Pellet A Zingg E Diagnosis of prostatic cancer Ther Umsch 1972 29 254 257 5063888 33 Romdhane E Rammeh S Riahi H et al. The value of histology in the diagnosis of tuberculous spondylodiscitis J Clin Rheumatol 2020 26 63 66 10.1097/rhu.0000000000000930 32073517 34 Liang C Wei W Liang X et al. Spinal brucellosis in hulunbuir, China, 2011–2016 Infect Drug Resist 2019 12 1565 1571 10.2147/idr.s202440 31239732 PMC6559255 35 Goertz CE Frasca SJ Bohach GA et al. Brucella sp. vertebral osteomyelitis with intercurrent fatal Staphylococcus aureus toxigenic enteritis in a bottlenose dolphin (Tursiops truncatus) J Vet Diagn Invest 2011 23 845 851 10.1177/1040638711407683 21908337 PMC3774104 36 Landi A Di Bartolomeo A Marotta N et al. Multidisciplinary management of spontaneous spinal infections: is there a correlation between timing, type of treatment and outcome? J Neurosurg Sci 2019 63 379 387 10.23736/s0390-5616.16.03779-6 27879951 37 Schuchert MJ McCormick KN Abbas G et al. Anterior thoracic surgical approaches in the treatment of spinal infections and neoplasms Ann Thorac Surg 2014 97 10.1016/j.athoracsur.2013.09.085 24612704 38 Raghavan M Palestro CJ Imaging of spondylodiscitis: an update Semin Nucl Med 2023 53 152 166 10.1053/j.semnuclmed.2022.11.005 36522190 39 Ortiz AO Levitt A Shah LM et al. ACR appropriateness criteria® suspected spine infection J Am Coll Radiol 2021 18 S488 S501 10.1016/j.jacr.2021.09.001 34794603 40 Barreto S Sharma S Cheraya G et al. Finding MRI features to obviate the need of repeat spinal biopsies in clinically suspected persistent or recurrent spinal osteomyelitis Pol J Radiol 2023 88 e225 e230 10.5114/pjr.2023.127066 37234461 PMC10207303 41 Singh DK Mukund A Tissue diagnosis in infective spondylodiscitis by CT-guided spinal biopsy: a standard practice before starting treatment Indian J Radiol Imaging 2023 33 287 288 10.1055/s-0043-1770345 37362364 PMC10289847 42 Chang CY Pelzl C Jesse MK et al. Image-guided biopsy in acute diskitis-osteomyelitis: a systematic review and meta-analysis AJR Am J Roentgenol 2023 220 499 511 10.2214/ajr.22.28423 36222488 43 Lafford HW Stewart EE Koslowsky IL et al. The routine clinical use of fluorodeoxyglucose PET/CT to confirm treatment response in pyogenic spine infection Skelet Radiol 2023 53 161 170 10.1007/s00256-023-04393-6 37393203 44 Palestro CJ A brief history of nuclear medicine imaging of infection J Infect Dis 2023 228 S237 S240 10.1093/infdis/jiac466 37788498 45 Thang SP Tong AK Lam WW et al. SPECT/CT in musculoskeletal infections Semin Musculoskelet Radiol 2014 18 194 202 10.1055/s-0034-1371020 24715450 46 Gemmel F Rijk PC Collins JM et al. Expanding role of 18f-fluoro-d-deoxyglucose PET and PET/CT in spinal infections Eur Spine J 2010 19 540 551 10.1007/s00586-009-1251-y 20052505 PMC2899827 47 Treglia G Pascale M Lazzeri E et al. Diagnostic performance of (18)f-FDG PET/CT in patients with spinal infection: a systematic review and a bivariate meta-analysis Eur J Nucl Med Mol Imaging 2020 47 1287 1301 10.1007/s00259-019-04571-6 31729539 48 Grados F Lescure FX Senneville E et al. Suggestions for managing pyogenic (non-tuberculous) discitis in adults Jt Bone Spine 2007 74 133 139 10.1016/j.jbspin.2006.11.002 17337352 49 Tsantes AG Papadopoulos DV Vrioni G et al. Spinal infections: an update Microorganisms 2020 8 476 10.3390/microorganisms8040476 32230730 PMC7232330 50 Terreaux W Geoffroy M Ohl X et al. Diagnostic contribution of a second percutaneous needle biopsy in patients with spontaneous diskitis and negative blood cultures and first biopsy Joint Bone Spine 2016 83 715 719 10.1016/j.jbspin.2016.02.006 27010838 51 Luzzati R Giacomazzi D Danzi MC et al. Diagnosis, management and outcome of clinically- suspected spinal infection J Infect 2009 58 259 265 10.1016/j.jinf.2009.02.006 19268368 52 Zhang N Ma L Ding W The diagnostic value of blood next-generation sequencing in early surgical site infection after spine surgery Int J Gen Med 2023 16 37 45 10.2147/ijgm.s394255 36636713 PMC9830415 53 Gómez MC Nieto JA Rosa C et al. Evaluation of seven tests for diagnosis of human brucellosis in an area where the disease is endemic Clin Vaccine Immunol 2008 15 1031 1033 10.1128/cvi.00424-07 18448622 PMC2446629 54 Dayer R De Marco G Vazquez O et al. Laboratory diagnostics for primary spinal infections in pediatric and adult populations: a narrative review N Am Spine Soc J 2023 16 100270 10.1016/j.xnsj.2023.100270 37767011 PMC10520565 55 Xu L Zhou Z Wang Y et al. Improved accuracy of etiological diagnosis of spinal infection by metagenomic next-generation sequencing Front Cell Infect Microbiol 2022 12 929701 10.3389/fcimb.2022.929701 36275025 PMC9585211 56 Kullar R Chisari E Snyder J et al. Next-generation sequencing supports targeted antibiotic treatment for culture negative orthopedic infections Clin Infect Dis 2023 76 359 364 10.1093/cid/ciac733 36074890 PMC9839185 57 Fedrizzi T Meehan CJ Grottola A et al. Genomic characterization of nontuberculous mycobacteria Sci Rep 2017 7 45258 10.1038/srep45258 28345639 PMC5366915 58 Yoon JK Kim TS Kim JI et al. Whole genome sequencing of nontuberculous mycobacterium (NTM) isolates from sputum specimens of co-habiting patients with NTM pulmonary disease and NTM isolates from their environment BMC Genom 2020 21 322 10.1186/s12864-020-6738-2 PMC7181514 32326890 59 Wilson MR Sample HA Zorn KC et al. Clinical metagenomic sequencing for diagnosis of meningitis and encephalitis N Engl J Med 2019 380 2327 2340 10.1056/nejmoa1803396 31189036 PMC6764751 60 Hilt EE Ferrieri P Next generation and other sequencing technologies in diagnostic microbiology and infectious diseases Genes 2022 13 1566 10.3390/genes13091566 36140733 PMC9498426 61 Gabaldon T Recent trends in molecular diagnostics of yeast infections: from PCR to NGS FEMS Microbiol Rev 2019 43 517 547 10.1093/femsre/fuz015 31158289 PMC8038933 62 Marais S Roos I Mitha A et al. Spinal tuberculosis: clinicoradiological findings in 274 patients Clin Infect Dis 2018 67 89 98 10.1093/cid/ciy020 29340585 63 Liu WC Ying H Liao WJ et al. Using preoperative and intraoperative factors to predict the risk of surgical site infections after lumbar spinal surgery: a machine learning-based study World Neurosurg 2022 162 e553 e560 10.1016/j.wneu.2022.03.060 35318153 64 Haim O Agur A Gabay S et al. Differentiating spinal pathologies by deep learning approach Spine J 2024 24 297 303 10.1016/j.spinee.2023.09.019 37797840 65 Duan S Dong W Hua Y et al. Accurate differentiation of spinal tuberculosis and spinal metastases using MR-based deep learning algorithms Infect Drug Resist 2023 16 4325 4334 10.2147/idr.s417663 37424672 PMC10329448 66 Mukaihata T Maki S Eguchi Y et al. Differentiating magnetic resonance images of pyogenic spondylitis and spinal modic change using a convolutional neural network Spine 2023 48 288 294 10.1097/brs.0000000000004532 36692159 67 Chen J Guo X Liu X et al. Differentiation of tuberculous and brucellar spondylitis using conventional MRI-based deep learning algorithms Eur J Radiol 2024 178 111655 10.1016/j.ejrad.2024.111655 39079324 68 Feng S Wang S Liu C et al. Prediction model for spinal cord injury in spinal tuberculosis patients using multiple machine learning algorithms: a multicentric study Sci Rep 2024 14 7691 10.1038/s41598-024-56711-0 38565845 PMC10987632 69 Zhang Q Chen G Zhu Q et al. Construct validation of machine learning for accurately predicting the risk of postoperative surgical site infection following spine surgery J Hosp Infect 2024 146 232 241 10.1016/j.jhin.2023.09.024 38029857 70 Fukuda K Miyamoto H Uno K et al. Indications and limitations of conservative treatment for pyogenic spondylitis J Spinal Disord Tech 2014 27 316 320 10.1097/bsd.0b013e31825d6aca 22614267 71 Alcobendas Rueda RM Nunez E Martin L et al. Oral versus intravenous antibiotics for pediatric osteoarticular infection: when and to whom? Pediatr Infect Dis J 2022 41 e351 e357 10.1097/inf.0000000000003619 35763692 72 Lorrot M Gillet Y Basmaci R et al. Antibiotic therapy for osteoarticular infections in 2023: proposals from the pediatric infectious pathology group (GPIP) Infect Dis Now 2023 53 104789 10.1016/j.idnow.2023.104789 37741341 73 Krzysztofiak A Pagnotta G Lancella L et al. Linezolid therapy for pediatric thoracic spondylodiscitis due to Staphylococcus aureus sepsis Int J Infect Dis 2010 14 Supplement 3 e205 e207 10.1016/j.ijid.2009.07.013 19914114 74 Phillips BT Sheldon ES Orhurhu V et al. Preoperative versus extended postoperative antimicrobial prophylaxis of surgical site infection during spinal surgery: a comprehensive systematic review and meta-analysis Adv Ther 2020 37 2710 2733 10.1007/s12325-020-01371-5 32415484 PMC7467442 75 Bernard L Dinh A Ghout I et al. Antibiotic treatment for 6 weeks versus 12 weeks in patients with pyogenic vertebral osteomyelitis: an open-label, non-inferiority, randomised, controlled trial Lancet 2015 385 875 882 10.1016/s0140-6736(14)61233-2 25468170 76 Li YD Wong CB Tsai TT et al. Appropriate duration of post-surgical intravenous antibiotic therapy for pyogenic spondylodiscitis BMC Infect Dis 2018 18 468 10.1186/s12879-018-3377-1 30223785 PMC6142394 77 Pola E Taccari F Autore G et al. Multidisciplinary management of pyogenic spondylodiscitis: epidemiological and clinical features, prognostic factors and long-term outcomes in 207 patients Eur Spine J 2018 27 229 236 10.1007/s00586-018-5598-9 29667140 78 Erroi F Rotondo C Sciacca S et al. Serious spondylodiscitis, septic sacroiliitis and multiple abscesses after ozone therapy for low back pain: a case report on good response to combined treatment with empiric antibiotic and neridronate Int J Rheum Dis 2023 26 1590 1593 10.1111/1756-185x.14632 36814395 79 Leowattana W Leowattana P Leowattana T Tuberculosis of the spine World J Orthop 2023 14 275 293 10.5312/wjo.v14.i5.275 37304201 PMC10251269 80 Wang B Wang Y Hao D Current study of medicinal chemistry for treating spinal tuberculosis Curr Med Chem 2021 28 5201 5212 10.2174/0929867328666201222125225 33355046 81 World Health Organization Treatment of Tuberculosis: Guidelines Geneva World Health Organization https://www.who.int/news/item/07-05-2010-treatment-of-tuberculosis-guidelines-for-national-programme 82 Chen L Zhang J Retrospective evaluation of short-course versus traditional preoperative chemotherapy in thoracolumbar spinal tuberculosis patients Med Sci Monit 2023 29 e941003 10.12659/msm.941003 37697647 PMC10504853 83 Nene AM Patil S Kathare AP et al. Six versus 12 months of anti tubercular therapy in patients with biopsy proven spinal tuberculosis: a single center, open labeled, prospective randomized clinical trial-a pilot study Spine 2019 44 E1 E6 10.1097/brs.0000000000002811 30045346 84 Ulu-Kilic A Karakas A Erdem H et al. Update on treatment options for spinal brucellosis Clin Microbiol Infect 2014 20 O75 O82 10.1111/1469-0691.12351 24118178 85 Perna A Ricciardi L Fantoni M et al. Spontaneous vertebral aspergillosis, the state of art: a systematic literature review Neurospine 2021 18 23 33 10.14245/ns.2040338.169 33211946 PMC8021829 86 Rutges JP Kempen DH van Dijk M et al. Outcome of conservative and surgical treatment of pyogenic spondylodiscitis: a systematic literature review Eur Spine J 2016 25 983 999 10.1007/s00586-015-4318-y 26585975 87 Loibl M Stoyanov L Doenitz C et al. Outcome-related co-factors in 105 cases of vertebral osteomyelitis in a tertiary care hospital Infection 2014 42 503 510 10.1007/s15010-013-0582-0 24446233 88 Darouiche RO Spinal epidural abscess N Engl J Med 2006 355 2012 2020 10.1056/nejmra055111 17093252 89 Greenwald P Chan AK Spinal epidural abscess and strep pharyngitis World Neurosurg 2023 180 77 78 10.1016/j.wneu.2023.09.033 37741329 90 Fisher CG DiPaola CP Ryken TC et al. A novel classification system for spinal instability in neoplastic disease: an evidence-based approach and expert consensus from the spine oncology study group Spine 2010 35 E1221 E1229 10.1097/brs.0b013e3181e16ae2 20562730 91 Pithwa YK Sinha Roy V Can we extrapolate SINS score to evaluate instability in spinal tuberculosis? Glob Spine J 2023 13 1305 1310 10.1177/21925682211030876 PMC10416599 34259089 92 Huang T Han Z Luo W et al. Selection of bone graft type for the surgical treatment of thoracolumbar spinal tuberculosis based on the spinal instability neoplastic score: a retrospective single-center cohort study BMC Musculoskelet Disord 2023 24 520 10.1186/s12891-023-06620-6 37355564 PMC10290412 93 Schomig F Li Z Perka L et al. Georg schmorl prize of the German spine society (DWG) 2021: Spinal Instability Spondylodiscitis Score (SISS)-a novel classification system for spinal instability in spontaneous spondylodiscitis Eur Spine J 2022 31 1099 1106 10.1007/s00586-022-07157-3 35257237 94 Tetsuka S Suzuki T Ogawa T et al. Spinal epidural abscess: a review highlighting early diagnosis and management JMA J 2020 3 29 40 10.31662/jmaj.2019-0038 33324773 PMC7733760 95 Sato K Yamada K Yokosuka K et al. Pyogenic spondylitis: clinical features, diagnosis and treatment Kurume Med J 2018 65 83 89 10.2739/kurumemedj.ms653001 31406038 96 Tuchman A Pham M Hsieh PC The indications and timing for operative management of spinal epidural abscess: literature review and treatment algorithm Neurosurg Focus 2014 37 E8 10.3171/2014.6.focus14261 25081968 97 Tonetti DA Eichar B Ares WJ et al. Should the presence of spondylodiscitis alter the surgical treatment of patients with symptomatic ventral cervical epidural abscesses? An institutional analysis World Neurosurg 2020 138 e282 e288 10.1016/j.wneu.2020.02.103 32112938 98 Turner A Zhao L Gauthier P et al. Management of cervical spine epidural abscess: a systematic review Ther Adv Infect Dis 2019 6 2049936119863940 10.1177/2049936119863940 31367375 PMC6643182 99 Heyde CE Boehm H El Saghir H et al. Surgical treatment of spondylodiscitis in the cervical spine: a minimum 2-year follow-up Eur Spine J 2006 15 1380 1387 10.1007/s00586-006-0191-z 16868782 PMC2438571 100 Stangenberg M Mohme M Mende KC et al. Impact of the localization on disease course and clinical management in spondylodiscitis Int J Infect Dis 2020 99 122 130 10.1016/j.ijid.2020.07.028 32721536 101 Long B Carlson J Montrief T et al. High risk and low prevalence diseases: spinal epidural abscess Am J Emerg Med 2022 53 168 172 10.1016/j.ajem.2022.01.008 35063888 102 Schwab JH Shah AA Spinal epidural abscess: diagnosis, management, and outcomes J Am Acad Orthop Surg 2020 28 e929 e938 10.5435/jaaos-d-19-00685 32694325 103 Behmanesh B Gessler F Quick-Weller J et al. Early versus delayed surgery for spinal epidural abscess : clinical outcome and health-related quality of life J Korean Neurosurg Soc 2020 63 757 766 10.3340/jkns.2019.0230 32759625 PMC7671776 104 Neuhoff J Kramer A Thavarajasingam SG et al. Comparing conservative and early surgical treatments for pyogenic spondylodiskitis: an international propensity score-matched retrospective outcome analysis Neurosurgery 2024 96 1008 1022 10.1227/neu.0000000000003223 39471086 PMC11970889 105 Li S Mei S Huang L et al. Emergency surgery for a patient with a thoracic spinal epidural abscess: a case report and literature review J Int Med Res 2023 51 3000605231168757 10.1177/03000605231168757 37078091 PMC10131533 106 Kramer A Thavarajasingam SG Neuhoff J et al. Management of severe pyogenic spinal infections: the 2SICK study by the EANS spine section Spine J 2025 25 876 885 10.1016/j.spinee.2024.12.018 39672206 107 Kothari M Shah K Tikoo A et al. Short to mid-term term surgical outcome study with posterior only approach on tuberculous spondylodiscitis in an elderly population Asian Spine J 2016 10 258 266 10.4184/asj.2016.10.2.258 27114766 PMC4843062 108 Duarte RM Vaccaro AR Spinal infection: state of the art and management algorithm Eur Spine J 2013 22 2787 2799 10.1007/s00586-013-2850-1 23756630 PMC3843785 109 Shamji MF Mroz T Hsu W et al. Management of degenerative lumbar spinal stenosis in the elderly Neurosurgery 2015 77 Supplement 4 S68 S74 10.1227/neu.0000000000000943 26378360 110 Zhong Y Tang B Zhang Z et al. Clinical efficacy and imaging analysis for the surgical treatment of thoracolumbar infections in elderly patients: a retrospective study Sci Rep 2023 13 10341 10.1038/s41598-023-36985-6 37365248 PMC10293203 111 Lenga P Gulec G Bajwa AA et al. ACDF versus corpectomy in octogenarians with cervical epidural abscess: early complications and outcomes with 2 years of follow-up Acta Neurochir 2023 165 875 882 10.1007/s00701-023-05488-8 36629954 PMC10068646 112 Devico Marciano N Beyer RS Nguyen A et al. Primary spinal infections in patients with hematologic immunocompromising conditions: a systematic literature review J Am Acad Orthop Surg Glob Res Rev 2023 7 e22.00178 10.5435/jaaosglobal-d-22-00178 PMC10168528 37159278 113 Camino-Willhuber G Beyer RS Hatter MJ et al. Pyogenic spinal infections in patients with chronic liver disease: illustrative case and systematic review J Neurosurg Case Lessons 2022 4 CASE22222 10.3171/case22222 36046268 PMC9329861 114 Hatter MJ Beyer RS Camino-Willhuber G et al. Primary spinal infections in patients with solid organ transplant: a systematic literature review and illustrative case J Neurosurg Case Lessons 2022 3 CASE22157 10.3171/case22157 35855206 PMC9237658 115 Budka H Neuropathology of myelitis, myelopathy, and spinal infections in AIDS Neuroimaging Clin N Am 1997 7 639 650 10.1016/s1052-5149(25)00473-3 9376972 116 Dunn RN Castelein S Held M Impact of HIV on spontaneous spondylodiscitis Bone Joint J 2019 101-B 617 620 10.1302/0301-620x.101b5.bjj-2018-0960.r1 31039039 117 Bono CM Spectrum of spine infections in patients with HIV: a case report and review of the literature Clin Orthop Relat Res 2006 444 83 91 10.1097/01.blo.0000203450.28899.ef 16523131 118 Broner FA Garland DE Zigler JE Spinal infections in the immunocompromised host Orthop Clin North Am 1996 27 37 46 10.1016/s0030-5898(20)32048-4 8539051 119 Hadjipavlou AG Mader JT Necessary JT et al. Hematogenous pyogenic spinal infections and their surgical management Spine 2000 25 1668 1679 10.1097/00007632-200007010-00010 10870142 120 Pola E Rossi B Nasto LA et al. Surgical treatment of tuberculous spondylodiscitis Eur Rev Med Pharmacol Sci 2012 16 Supplement 2 79 85 22655486 121 Lohr M Reithmeier T Ernestus RI et al. Spinal epidural abscess: prognostic factors and comparison of different surgical treatment strategies Acta Neurochir 2005 147 159 166 10.1007/s00701-004-0414-1 15570436 122 Zhang HQ Li JS Zhao SS et al. Surgical management for thoracic spinal tuberculosis in the elderly: posterior only versus combined posterior and anterior approaches Arch Orthop Trauma Surg 2012 132 1717 1723 10.1007/s00402-012-1618-0 23053192 123 Kao FC Tsai TT Niu CC et al. One-stage posterior approaches for treatment of thoracic spinal infection: transforaminal and costotransversectomy, compared with anterior approach with posterior instrumentation Medicine 2017 96 e8352 10.1097/md.0000000000008352 29049254 PMC5662420 124 Zhong Y Yang K Ye Y et al. Single posterior approach versus combined anterior and posterior approach in the treatment of spinal tuberculosis: a meta-analysis World Neurosurg 2021 147 115 124 10.1016/j.wneu.2020.12.023 33316480 125 Soares DBJ Tirado A Fernandes P Surgical treatment of spinal tuberculosis complicated with extensive abscess Iowa Orthop J 2014 34 129 136 25328472 PMC4127730 126 Li J Qin X Wang J et al. Comparison of clinical efficacy and surgical safety among three bone graft modalities in spinal tuberculosis: a network meta-analysis J Orthop Surg Res 2023 18 368 10.1186/s13018-023-03848-9 37202780 PMC10193734 127 Korovessis P Repantis T Iliopoulos P et al. Beneficial influence of titanium mesh cage on infection healing and spinal reconstruction in hematogenous septic spondylitis: a retrospective analysis of surgical outcome of twenty-five consecutive cases and review of literature Spine 2008 33 E759 E767 10.1097/brs.0b013e318187875e 18827680 128 Wang AJ Huang KT Smith TR et al. Cervical spine osteomyelitis: a systematic review of instrumented fusion in the modern era World Neurosurg 2018 120 e562 e572 10.1016/j.wneu.2018.08.129 30165226 129 Liu Z Xu Z Zhang Y et al. Endoscopy-assisted anterior cervical debridement combined with posterior fixation and fusion for the treatment of upper cervical spine tuberculosis: a retrospective feasibility study BMC Musculoskelet Disord 2022 23 126 10.1186/s12891-022-05084-4 35135516 PMC8827151 130 Kapoor SK Agarwal PN Jain BK Jr et al. Video-assisted thoracoscopic decompression of tubercular spondylitis: clinical evaluation Spine 2005 30 E605 E610 10.1097/01.brs.0000182328.03082.e2 16227877 131 Sasani M Ozer AF Oktenoglu T et al. Thoracoscopic surgical approaches for treating various thoracic spinal region diseases Turk Neurosurg 2010 20 373 381 10.5137/1019-5149.JTN.2980-10.1 20669112 132 Guo S Zhu K Zhang S et al. Percutaneous pedicle screw fixation alone versus debridement and fusion surgery for the treatment of early spinal tuberculosis: a retrospective cohort study Med Sci Monit 2019 25 1549 1557 10.12659/msm.912538 30811378 PMC6402273 133 Cabrera JP Camino-Willhuber G Muthu S et al. Percutaneous versus open pedicle screw fixation for pyogenic spondylodiscitis of the thoracic and lumbar spine: systematic review and meta-analysis Clin Spine Surg 2023 36 24 33 10.1097/bsd.0000000000001325 35344512 134 Janssen IK Jorger AK Barz M et al. Minimally invasive posterior pedicle screw fixation versus open instrumentation in patients with thoracolumbar spondylodiscitis Acta Neurochir 2021 163 1553 1560 10.1007/s00701-021-04744-z 33655377 135 Choi EJ Kim SY Kim HG et al. Percutaneous endoscopic debridement and drainage with four different approach methods for the treatment of spinal infection Pain Physician 2017 20 E933 E940 28934797 136 Segbedji FKK Mallereau C Dannhoff G et al. Minimally invasive management of cervical spondylodiscitis. A multicenter experience Neurosurg Rev 2025 48 29 10.1007/s10143-025-03191-z 39779517 137 Quinones-Hinojosa A Jun P Jacobs R et al. General principles in the medical and surgical management of spinal infections: a multidisciplinary approach Neurosurg Focus 2004 17 E1 10.3171/foc.2004.17.6.1 15636566 138 Gatti M Tedeschi S Zamparini E et al. Pharmacokinetic and pharmacodynamic considerations for optimizing antimicrobial therapy used to treat bone and joint infections: an evidence-based algorithmic approach Expert Opin Drug Metab Toxicol 2023 19 511 535 10.1080/17425255.2023.2255525 37671793 139 Hopkins BS Mazmudar A Driscoll C et al. Using artificial intelligence (AI) to predict postoperative surgical site infection: a retrospective cohort of 4046 posterior spinal fusions Clin Neurol Neurosurg 2020 192 105718 10.1016/j.clineuro.2020.105718 32065943 140 Karhade AV Shah AA Bono CM et al. Development of machine learning algorithms for prediction of mortality in spinal epidural abscess Spine J 2019 19 1950 1959 10.1016/j.spinee.2019.06.024 31255788 141 Yao Y Wu S Liu C et al. Identification of spinal tuberculosis subphenotypes using routine clinical data: a study based on unsupervised machine learning Ann Med 2023 55 2249004 10.1080/07853890.2023.2249004 37611242 PMC10448834 142 Jayaswal A Upendra B Ahmed A et al. Video-assisted thoracoscopic anterior surgery for tuberculous spondylitis Clin Orthop Relat Res 2007 460 100 107 10.1097/blo.0b013e318065b6e4 17471105 143 Du X Ou YS Zhu Y et al. Oblique lateral interbody fusion combined percutaneous pedicle screw fixation in the surgical treatment of single-segment lumbar tuberculosis: a single-center retrospective comparative study Int J Surg 2020 83 39 46 10.1016/j.ijsu.2020.09.012 32927138 144 Chen X Leng J Liu G et al. Treatment of lumbar tuberculosis with percutaneous pedicle screw internal fixation and minimally invasive lateral small incisions lesion debridement and bone graft fusion via dilated channels Zhongguo Xiu Fu Chong Jian Wai Ke Za Zhi 2021 35 46 50 10.7507/1002-1892.202007099 33448198 PMC8171605 145 Lin IH Lin CY Chang CC et al. Percutaneous endoscopic surgery alone to treat severe infectious spondylodiscitis in the thoracolumbar spine: a reparative mechanism of spontaneous spinal arthrodesis Pain Physician 2022 25 E299 E308 35322985 146 Lin CY Chang CC Chen YJ et al. New strategy for minimally invasive endoscopic surgery to treat infectious spondylodiscitis in the thoracolumbar spine Pain Physician 2019 22 281 293 31151336 147 Lin G Kim J Sharma S et al. Full endoscopic discectomy, debridement, and drainage for high-risk patients with spondylodiscitis World Neurosurg 2019 127 e202 e211 10.1016/j.wneu.2019.02.206 30878748 148 Hadjipavlou AG Katonis PK Gaitanis IN et al. Percutaneous transpedicular discectomy and drainage in pyogenic spondylodiscitis Eur Spine J 2004 13 707 713 10.1007/s00586-004-0699-z 15197626 PMC3454057 149 Zheng C Li P Kan W Video-assisted thoracoscopic anterior surgery combined posterior instrumentation for children with spinal tuberculosis Eur J Pediatr Surg 2014 24 83 87 10.1055/s-0033-1354584 24443095 ",
  "metadata": {
    "Title of this paper": "Video-assisted thoracoscopic anterior surgery combined posterior instrumentation for children with spinal tuberculosis",
    "Journal it was published in:": "EFORT Open Reviews",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495883/"
  }
}