{
  "title": "Paper_1154",
  "abstract": "pmc Laryngoscope Laryngoscope 379 blackwellopen LARY The Laryngoscope 0023-852X 1531-4995 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12475549 PMC12475549.1 12475549 12475549 40257275 10.1002/lary.32178 LARY32178 1 Original Report Facial Plastic‐Reconstructive Surgery Original Report Non‐Tobacco Nicotine Use and Complications in Free Flap Repair in Head and Neck Cancer Park Asher C. https://orcid.org/0000-0002-3631-463X  1 asher.park@northwestern.edu Wang Larry  1 Fehrenbach Milan P. https://orcid.org/0009-0005-1324-5618  2 Ayo‐Ajibola Oluwatobiloba https://orcid.org/0009-0002-4824-7160  3 Patel Urjeet A.  4 Samant Sandeep https://orcid.org/0000-0002-4755-8082  4 Stepan Katelyn O.  4   1 Northwestern University Feinberg School of Medicine Chicago Illinois USA   2 College of Medicine Lexington Kentucky USA   3 Keck School of Medicine of the University of Southern California Los Angeles California USA   4 Department of Otolaryngology‐Head and Neck Surgery Northwestern University Feinberg School of Medicine Chicago Illinois USA * Correspondence: asher.park@northwestern.edu 21 4 2025 10 2025 135 10 497679 10.1002/lary.v135.10 3630 3638 30 1 2025 10 3 2025 27 09 2025 28 09 2025 28 09 2025 © 2025 The Author(s). The Laryngoscope https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc/4.0/ ABSTRACT Objective Assess associations between non‐tobacco nicotine usage and free flap repair complications in head and neck cancer (HNC) patients. Study Design Propensity‐matched retrospective cohort study. Methods The TriNetX database was queried for HNC patients who underwent free flap procedures from 2010 to 2024. Among these patients, the NIC cohort was defined as those with dependence on nicotine prior to surgery, but without the use of cigarettes, chewing tobacco, or other tobacco products. The non‐NIC cohort was defined as patients with no nicotine dependence, cigarettes, chewing tobacco, or other tobacco product use prior to surgery. Cohorts were propensity‐matched based on demographics and comorbidities. Primary outcomes included free flap failure, blood vessel repair, and other revisionary procedures (associated with wound disruption or repair) within 30 days of the primary reconstruction. Secondary outcomes included infection, pneumonia, cardiopulmonary complications, and hematoma within 30 days. Results Following propensity matching, 1324 patients were included in each cohort. Across all free flaps, non‐tobacco nicotine use was associated with a significantly increased risk of other revision procedures (RR: 1.230 [95% CI: 1.013, 1.493], p p p p p p Conclusions Non‐tobacco nicotine use is associated with an increased risk of postoperative complications in HNC patients following free flap reconstruction. Screening for non‐tobacco nicotine use in surgical candidates may better inform clinical management and counseling. Level of Evidence III Non‐tobacco nicotine use is associated with an increased risk of postoperative complications in HNC patients following free flap reconstruction. free flap repair head and neck oncology head and neck surgery nicotine pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:27.09.2025  A. C. Park L. Wang M. P. Fehrenbach Non‐Tobacco Nicotine Use and Complications in Free Flap Repair in Head and Neck Cancer The Laryngoscope 135 10 2025 3630 3638 10.1002/lary.32178 PMC12475549 40257275  Funding: This study was submitted for presentation at the 2025 Combined Otolaryngology Spring Meetings—Triological Society Section in New Orleans from May 14–18, 2025. 1 Introduction Recent advances in microsurgery have made free flap repair the preferred treatment for head and neck reconstruction, offering excellent functional and cosmetic results with success rates reaching 95%–98% [ 1 2 3 4 Smoking has been associated with an increased risk of postoperative wound disruption, incidence of hematoma, and need for revisionary procedures following HNC free flap reconstruction [ 5 5 4 Although tobacco smoking prevalence has continued to decrease, unit sales of e‐cigarettes have grown by nearly 300% between 2017 and 2022 [ 6 7 8 9 10 9 11 12 13 14 15 This study seeks to examine the effects of non‐tobacco nicotine products in the context of free flap reconstruction among HNC patients. Utilizing a de‐identified national health database, we performed a 1:1 propensity‐score matching retrospective cohort study to quantitatively examine associations of non‐tobacco nicotine use and postoperative complications in free flap repair for HNC. 2 Methods 2.1 Study Design This retrospective cohort study was conducted utilizing the TriNetX Research Network, a global health collaborative research platform, which provides access to deidentified retrospective electronic medical records. We queried the US Collaborative Network of 66 health care organizations (HCOs). TriNetX is compliant with the Health Insurance Portability and Accountability Act (HIPAA) and contains only deidentified data. Therefore, this study was exempt from the Northwestern University Institutional Review Board (IRB) review. 2.2 Data Collection The TriNetX database was queried to identify patients diagnosed with HNC (ICD‐10 codes: C00‐14, C30, C31, C32) who were treated with a free flap reconstruction (CPT codes: 20956, 20970, 20955, 20969, 20962, 15758, 15756, 15757, 15842), from January 1, 2010, to December 14, 2024. The NIC cohort was defined as adult patients ≥ 18 years of age who had a dependence on nicotine (F17) but did not have existing or prior nicotine dependence on cigarettes (F17.21), chewing tobacco (F17.22), or other tobacco products (F17.29). The non‐NIC cohort was defined as adult patients who did not have a dependence on nicotine (F17) and had no personal history of prior use of cigarettes (F17.21), chewing tobacco (F17.22), or other tobacco products (F17.29) before surgery. These cohorts were based on previously published studies on surgical outcomes with non‐tobacco nicotine use [ 13 14 16 17 18 19 The primary outcomes measured in this study include free flap failure, blood vessel repair, and other flap revision procedures within 30 days postoperatively. Free flap failure refers to a secondary reconstruction following initial free flap repair, which includes a secondary free flap procedure or a pedicled flap with a named vascular pedicle. Blood vessel repair included procedural codes for blood vessel repair following primary reconstruction, while other flap revision procedures included procedural codes associated with wound repair or breakdown. Secondary outcomes consisted of DVT, sepsis, surgical site infections, fistula, cardiovascular complications, pneumonia, PE, and hematoma presenting within 30 days postoperatively. Diagnosis and procedural codes are available in Table S1 2.3 Statistical Analysis Statistical analyses were performed through TriNetX and R Statistical Software 4.1.2 (R foundation, Vienna, Austria). Demographics, co‐morbidities, and primary and secondary outcomes between NIC and non‐NIC cohorts were analyzed through the TriNetX database, which is based on the R, JAVA, and Python platforms [ 20 Chi‐squared and Fisher's exact testing were utilized to compare categorical variable frequencies in primary and secondary outcomes between NIC and non‐NIC cohorts. Relative risk (RR) and 95% confidence intervals (CI) were also included to evaluate the outcomes between non‐tobacco nicotine use and free flap outcomes in HNC patients. Statistical significance was defined at an α of 0.05. 3 Results A total of 11,370 HNC patients who underwent a free flap procedure from 2010 to 2024 were included in the study. Before propensity score matching, the majority of patients were based in the non‐NIC cohort ( n n 1 n n n n n n n n 1 2 TABLE 1 Cohort demographics with propensity matching. Demographics Before matching After matching Patients, no. (%) ( N Patients, no. (%) ( N NIC ( N Non‐NIC ( N Std diff. NIC ( N Non‐NIC ( N Std diff. Age, mean ± SD 60.0 ± 10.1 64.3 ± 12.8 0.370 60.1 ± 10.0 60.3 ± 12.4 0.025 Sex Female 331 (25.0) 3637 (36.2) 0.245 331 (25.0) 338 (25.5) 0.012 Male 984 (74.3) 6341 (63.1) 0.242 983 (74.2) 979 (73.9) 0.007 Ethnicity Hispanic or Latino 48 (3.6) 469 (4.7) 0.053 48 (3.6) 44 (3.3) 0.016 Not Hispanic or Latino 1037 (78.3) 7154 (71.2) 0.163 1036 (78.2) 1062 (80.2) 0.048 Unknown 240 (18.1) 2422 (24.1) 0.147 240 (18.1) 218 (16.5) 0.044 Race White 1017 (76.8) 7503 (74.7) 0.048 1017 (76.8) 1048 (79.2) 0.057 Black or African American 127 (9.6) 599 (6.0) 0.136 126 (9.5) 115 (8.7) 0.029 Asian 21 (1.6) 442 (4.4) 0.166 21 (1.6) 18 (1.4) 0.019 American Indian or Alaskan Indian 10 (0.8) 27 (0.3) 0.068 10 (0.8) 10 (0.8) < 0.001 Native Hawaiian or other Pacific Islander 10 (0.8) 105 (1.0) 0.031 10 (0.8) 10 (0.8) < 0.001 Unknown Race 134 (10.1) 1154 (11.5) 0.044 134 (10.1) 120 (9.1) 0.036 Other 13 (1.0) 215 (2.1) 0.094 13 (1.0) 11 (0.8) 0.016 Abbreviations: NIC, nicotine; Std diff., standardized mean difference. TABLE 2 Co‐morbidity demographics with propensity score matching. Diagnosis (code) Before matching After matching Patients, no. (%) ( N Patients, no. (%) ( N NIC ( N Non‐NIC ( N Std diff. NIC ( N Non‐NIC ( N Std diff Hypertensive diseases (I10‐I15) 679 (51.2) 4717 (47.0) 0.086 679 (51.3) 651 (49.2) 0.042 Acute kidney failure and chronic kidney disease (N17‐N19) 118 (8.9) 948 (9.4) 0.018 118 (8.9) 105 (7.9) 0.035 Chronic ischemic heart disease (I25) 238 (18.0) 1479 (14.7) 0.088 238 (18.0) 230 (17.4) 0.016 Ischemic heart disease (I20‐I25) 249 (18.8) 1551 (15.4) 0.089 249 (18.8) 240 (18.1) 0.018 Other forms of heart disease (I30‐I15A) 337 (25.4) 2333 (23.2) 0.051 336 (25.4) 300 (22.7) 0.064 Diabetes mellitus (E08‐E13) 187 (14.1) 1704 (17.0) 0.079 187 (14.1) 161 (12.2) 0.058 Glomerular disease (N00‐N08) 10 (0.8) 59 (0.6) 0.021 10 (0.8) 11 (0.8) 0.009 Overweight, obesity and other hyperalimentation (E65‐E68) 115 (8.7) 1130 (11.2) 0.086 115 (8.7) 84 (6.3) 0.089 Other nutritional deficiencies (E50‐E64) 78 (5.9) 610 (6.1) 0.008 78 (5.9) 50 (3.8) 0.099 Factors influencing health status and contact with health services (Z00‐Z99) 1110 (83.8) 7789 (77.5) 0.158 1109 (83.8) 1107 (83.6) 0.004 Abbreviations: NIC, nicotine; Std diff., standardized mean difference. 3.1 Risk Analysis of Primary Outcomes Primary outcomes included free flap failure (requiring secondary free flap procedure or pedicled flap with named vascular pedicle), blood vessel repair, and other flap revision procedures (including procedures related to wound repair or breakdown) within 30 days of primary reconstruction. When examining primary outcomes across all flaps, there was a significantly increased risk of other flap revision procedures among the NIC cohort (RR: 1.230 [95% CI: 1.013, 1.493], p 3 TABLE 3 Relative risk of primary outcomes between propensity‐matched NIC and non‐NIC cohorts. All flaps After matching patients, no. (%) ( N NIC ( N Non‐NIC ( N RR (95% Cl)  p Free flap failure 58 (4.38) 56 (4.23) 1.036 (0.723, 1.484) 0.847 Blood vessel repair 131 (9.89) 106 (8.01) 1.236 (0.968, 1.578) 0.089 Other flap revision procedures 198 (14.95) 161 (12.16) 1.230 (1.013, 1.493) 0.036 Bony flaps After matching patients, no. (%) ( N NIC ( N Non‐NIC ( N RR (95% Cl)  p Free flap failure 16 (4.91) 14 (4.29) 1.143 (0.567, 2.304) 0.709 Blood vessel repair 36 (11.04) 30 (9.20) 1.200 (0.758, 1.901) 0.437 Other flap revision procedures 61 (18.71) 43 (13.19) 1.419 (0.990 2.032) 0.056 Soft‐tissue flaps After matching patients, no. (%) ( N NIC ( N Non‐NIC ( N RR (95% Cl)  p Free flap failure 29 (3.17) 34 (3.72) 0.853 (0.524, 1.388) 0.522 Blood vessel repair 82 (8.97) 78 (8.53) 1.051 (0.782, 1.414) 0.742 Other flap revision procedures 109 (11.93) 123 (13.46) 0.886 (0.696, 1.128) 0.326 Abbreviations: CI, confidence interval; NIC, nicotine; RR, risk ratio. 3.2 Risk Analysis of Secondary Outcomes Secondary outcomes assessed included DVT, sepsis, surgical site infection, fistula, cardiovascular complications, pneumonia, PE, and hematoma (Table 4 p p p p p TABLE 4 Relative risk of secondary outcomes between propensity‐matched NIC and Non‐NIC cohorts. All flaps After matching Patients, no. (%) ( N NIC ( N Non‐NIC ( N RR (95% Cl)  p Deep vein thrombosis 62 (4.68) 59 (4.46) 1.051 (0.742, 1.489) 0.780 Sepsis 50 (3.78) 32 (2.42) 1.563 (1.009, 2.419)  0.045 Surgical site infection 44 (3.32) 49 (3.70) 0.898 (0.602, 1.339) 0.598 Fistula 54 (4.08) 34 (2.57) 1.588 (1.041, 2.423)  0.032 Cardiovascular complications 98 (7.40) 69 (5.21) 1.420 (1.054, 1.914)  0.021 Pneumonia 150 (11.33) 73 (5.51) 2.055 (1.570, 2.689) < 0.001 Pulmonary embolism 35 (2.64) 16 (1.21) 2.188 (1.217, 3.933)  0.012 Hematoma 100 (7.55) 81 (6.12) 1.235 (0.930, 1.638) 0.144 Bony flaps After matching Patients, no. (%) ( N NIC ( N Non‐NIC ( N RR (95% Cl)  p Deep vein thrombosis 22 (6.75) 17 (5.21) 1.294 (0.700, 2.391) 0.411 Sepsis 16 (4.91) 10 (3.07) 1.600 (0.737, 3.476) 0.235 Surgical site infection 15 (4.60) 20 (6.13) 0.750 (0.391, 1.439) 0.387 Fistula 12 (3.68) 10 (3.07) 1.200 (0.526, 2.738) 0.665 Cardiovascular complications 31 (9.51) 13 (3.99) 2.385 (1.271, 4.474)  0.007 Pneumonia 44 (13.50) 16 (4.91) 2.750 (1.585, 4.772) < 0.001 Pulmonary embolism 10 (3.07) 10 (3.07) 1.000 (0.422, 2.370) 1 Hematoma 25 (7.67) 19 (5.83) 1.316 (0.739, 2.342) 0.351 Soft‐tissue flaps After matching Patients, no. (%) ( N NIC ( N Non‐NIC ( N RR (95% Cl)  p Deep vein thrombosis 35 (3.83) 38 (4.16) 0.921 (0.587, 1.444) 0.720 Sepsis 30 (3.28) 21 (2.30) 1.563 (1.009, 2.419)  0.045 Surgical site infection 26 (2.84) 36 (3.94) 0.722 (0.440, 1.186) 0.198 Fistula 38 (4.16) 23 (2.52) 1.652 (0.993, 2.750) 0.053 Cardiovascular complications 58 (6.35) 50 (5.47) 1.160 (0.804, 1.674) 0.428 Pneumonia 92 (10.07) 60 (6.56) 1.533 (1.123, 2.094)  0.007 Pulmonary embolism 25 (2.74) 13 (1.42) 1.923 (0.990, 3.735) 0.054 Hematoma 67 (7.33) 62 (6.78) 1.081 (0.775, 1.507) 0.646  Note Abbreviations: CI, confidence interval; NIC, nicotine; RR, risk ratio. Among bony flaps, there was a significantly increased risk of cardiovascular complications (RR: 2.385 [95% CI: 1.271, 4.474], p p p p 4 Discussion The increasing prevalence of non‐tobacco nicotine products, including e‐cigarettes and nicotine pouches, raises significant concerns regarding their impact on reconstructive head and neck free flap outcomes. Despite their widespread use, the effects of these products on surgical complications remain poorly understood. In this propensity‐matched retrospective analysis of the TriNetX US Collaborative Network, non‐tobacco nicotine use was associated with a significantly increased risk of secondary flap revision procedures associated with wound repair and disruption, sepsis, fistula formation, cardiovascular complications, pneumonia, and PE across all flap types. Non‐tobacco nicotine use was also associated with a significantly increased risk of cardiovascular complications and pneumonia in patients undergoing bony free flap reconstruction. Among patients undergoing soft‐tissue free flap reconstruction, non‐tobacco nicotine use was associated with a significantly increased risk of sepsis and pneumonia. This study's findings of increased risk of postoperative complications in non‐tobacco nicotine users align with existing literature. Troiano et al. demonstrated that e‐cigarette vapor exposure in a rat model significantly increased rates of free flap necrosis compared to controls, with outcomes comparable to those observed in traditional tobacco smoke exposure [ 21 22 14 13 16 Several studies have investigated the pathophysiology of nicotine and wound healing [ 23 24 25 23 24 25 26 27 Of note, our study found a significantly increased risk of cardiovascular complication in the NIC cohort among all flaps as well as the bony flap subanalysis, while this was not seen in the soft‐tissue flap analysis. While there is limited literature looking at the risk of cardiovascular complications among bony‐ and soft‐tissue flaps, our finding may be a result of the impact of variables such as operative time and blood transfusion requirements which have been associated with cardiovascular complications in previous studies [ 28 29 30 31 32 33 28 28 29 30 31 32 33 The association between non‐tobacco nicotine use and increased risk of sepsis and pneumonia is also consistent with existing literature. While the pathophysiology remains incompletely understood, vaping is thought to impair local respiratory immune responses, increasing susceptibility to bacterial and viral infection [ 34 35 36 37 Limitations of this study are consistent with those of retrospective studies utilizing large databases. Database studies such as TriNetX are restricted by the availability of potential variables of interest, such as operative length or amount of blood transfused, which limits the possibility of utilizing a multivariate regression to account for such factors in the analysis. This study relies on proper database coding, which could be influenced by inaccuracies in documenting nicotine dependence and differentiating between tobacco and non‐tobacco nicotine products. Additionally, the use of ICD codes for cohort identification may introduce variability due to subjectivity in physician coding practices. Lastly, the dataset's inability to delineate between specific nicotine product types, such as pouches and e‐cigarettes, or to capture duration and frequency of use, further limits the specificity of our analysis. Previous studies have highlighted challenges in accurately documenting the use of nicotine pouches and e‐cigarettes in electronic health records, underscoring the need for improved preoperative screening for patients using non‐tobacco nicotine products [ 38 This study provides insights into the impact of non‐tobacco nicotine use on postoperative outcomes in free flap reconstruction for HNC patients, which has not previously been described. A strength of this study is the use of a large dataset that encompasses a diverse patient population nationwide across a number of healthcare organizations, enhancing the generalizability of our findings. Additionally, the use of propensity score matching allows for a robust comparison between our study cohorts, minimizing bias and enhancing the validity of these findings. By identifying increased risks associated with non‐tobacco nicotine use, this study underscores the need for clinical awareness and appropriate preoperative screening and counseling to mitigate adverse outcomes in free flap reconstruction. 5 Conclusion This retrospective propensity‐matched cohort study demonstrated that non‐tobacco nicotine use is associated with an increased risk of postoperative complications in patients undergoing free flap repair for HNC. Future prospective studies should explore postoperative outcomes associated with specific types of non‐tobacco nicotine products, accounting for duration and dosage of use. The interplay of non‐tobacco nicotine usage and surgical complications warrants further investigation to inform clinical management as this modality of nicotine consumption continues to grow in popularity. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  TABLE S1. References 1 H. S. Kim C. H. Chung Y. J. Chang Free‐Flap Reconstruction in Recurrent Head and Neck Cancer: A Retrospective Review of 124 Cases Archives of Craniofacial Surgery 21 2020 27 34 32126617 10.7181/acfs.2019.00738 PMC7054190 2 B. J. Lim J. Y. Shin S. G. Roh N. H. Lee Y. K. Chung Clinical Analysis of Factors Affecting the Failure of Free Flaps Used in Head and Neck Reconstruction Archives of Craniofacial Surgery 24 2023 159 166 37654235 10.7181/acfs.2023.00325 PMC10475704 3 S.‐B. Ouyang Z.‐H. Wu Y.‐P. Zhang X.‐L. Lu Comprehensive Analysis of Risk Factors for Flap Necrosis in Free Flap Reconstruction of Postoperative Tissue Defects in Oral and Maxillofacial Tumors Scientific Reports 14 2024 18676 39134569 10.1038/s41598-024-69159-z PMC11319768 4 M. M. Crippen N. Patel A. Filimonov Association of Smoking Tobacco With Complications in Head and Neck Microvascular Reconstructive Surgery JAMA Facial Plast Surg 21 1 2019 20 26 10.1001/jamafacial.2018.1176 30347003 PMC6439727 5 M. Garip J. Van Dessel L. Grosjean C. Politis M. Bila The Impact of Smoking on Surgical Complications After Head and Neck Reconstructive Surgery With a Free Vascularised Tissue Flap: A Systematic Review and Meta‐Analysis British Journal of Oral and Maxillofacial Surgery 59 2021 e79 e98 33546845 10.1016/j.bjoms.2020.07.020 6 F. R. M. Ali E. L. Seaman E. Crane B. Schillo B. A. King Trends in US E‐Cigarette Sales and Prices by Nicotine Strength, Overall and by Product and Flavor Type, 2017‐2022 Nicotine & Tobacco Research 25 2023 1052 1056 36580384 10.1093/ntr/ntac284 PMC10077931 7 R. Meza P. Cao J. Jeon K. E. Warner D. T. Levy Trends in US Adult Smoking Prevalence, 2011 to 2022 JAMA Health Forum 4 2023 e234213 38038988 10.1001/jamahealthforum.2023.4213 PMC10692849 8 M. E. Cornelius C. G. Loretan A. Jamal Tobacco Product Use Among Adults ‐ United States, 2021 MMWR. Morbidity and Mortality Weekly Report 72 18 2023 475 483 10.15585/mmwr.mm7218a1 37141154 PMC10168602 9 A. Majmundar C. Okitondo A. Xue S. Asare P. Bandi N. Nargis Nicotine Pouch Sales Trends in the US by Volume and Nicotine Concentration Levels From 2019 to 2022 JAMA Network Open 5 2022 e2242235 36378312 10.1001/jamanetworkopen.2022.42235 PMC9667333 10 CDC “E‐Cigarette Use Among Youth,” https://www.cdc.gov/tobacco/e‐cigarettes/youth.html 11 A. F. Harlow E. A. Vogel A. P. Tackett Adolescent Use of Flavored Non‐Tobacco Oral Nicotine Products Pediatrics 150 3 2022 e2022056586 10.1542/peds.2022-056586 35934731 PMC9994602 12 L. Czaplicki M. Patel B. Rahman S. Yoon B. Schillo S. W. Rose Oral Nicotine Marketing Claims in Direct‐Mail Advertising Tobacco Control 31 2022 663 666 33958422 10.1136/tobaccocontrol-2020-056446 PMC9411885 13 S. M. Pescatore S. J. DeShazo R. W. Lindeman Non‐Tobacco Nicotine Dependence Associated With Increased Postoperative Complications Following Intramedullary Nailing for Intertrochanteric Femur Fractures Journal of Surgery and Research 7 2024 229 236 38993265 PMC11238609 14 S. J. DeShazo R. C. Crossnoe L. C. Bailey J. M. Rogers P. A. Naeger Non‐Tobacco Nicotine Dependence and Rates of Postoperative Complications in Total Knee Arthroplasty: A Propensity‐Matched Comparison Journal of the American Academy of Orthopaedic Surgeons 32 22 2024 1032 1037 10.5435/JAAOS-D-23-01053 38713764 PMC11530330 15 O. Ashour L. Al‐Huneidy H. Noordeen The Implications of Vaping on Surgical Wound Healing: A Systematic Review Surgery 173 2023 1452 1462 36997424 10.1016/j.surg.2023.02.017 16 J. Lawand A. Ghali A. H. Dajani Nontobacco Nicotine Dependence and Rates of Periprosthetic Joint Infection and Other Postoperative Complications in Shoulder Arthroplasty: A Retrospective Analysis Journal of the American Academy of Orthopaedic Surgeons 33 2024 92 99 39348556 10.5435/JAAOS-D-24-00706 17 S. DeShazo S. M. Pescatore V. K. Panchbhavi Nicotine Dependence and Rates of Postoperative Complications in Achilles Tendon Repair Foot & Ankle International 45 2024 67 72 37902225 10.1177/10711007231205293 PMC10822055 18 J. Lawand A. Ghali J. Hauck S. Trejo Corona R. Gonzalez L. Deveza The Smokeless Paradox: Nontobacco Nicotine Use and Complications in Anterior Cervical Discectomy and Fusion Journal of the American Academy of Orthopaedic Surgeons 2024 10.5435/JAAOS-D-24-00801 39705814 19 J. P. Le N. Truong M. Newland F. J. Lorenz N. Goyal The Influence of Vasopressors on Free Flap Outcomes in Head and Neck Cancer Patients Otolaryng Head Neck 171 4 2024 1008 1016 10.1002/ohn.924 39101344 20 U. Topaloglu M. B. Palchuk Using a Federated Network of Real‐World Data to Optimize Clinical Trials Operations JCO Clinical Cancer Informatics 2 2018 1 10 10.1200/CCI.17.00067 PMC6816049 30652541 21 C. Troiano Z. Jaleel J. H. Spiegel Association of Electronic Cigarette Vaping and Cigarette Smoking With Decreased Random Flap Viability in Rats AMA Facial Plastic Surgery 21 2019 5 10 10.1001/jamafacial.2018.1179 PMC6439741 30347026 22 W. Li S. Wu J. Yuan F. Meng C. Xu H. Li Predictors Predisposing to Orocutaneous Fistula Occurrence Following Free Flap Reconstruction Frontiers in Oncology 12 2022 947643 35924155 10.3389/fonc.2022.947643 PMC9341452 23 G. J. Dusting D. M. F. Li Catecholamine Release and Potentiation of Thromboxane‐A2 Production by Nicotine in the Greyhound British Journal of Pharmacology 87 1986 29 36 2937502 10.1111/j.1476-5381.1986.tb10153.x PMC1916904 24 W. Lei C. Lerner I. K. Sundar I. Rahman Myofibroblast Differentiation and Its Functional Properties Are Inhibited by Nicotine and e‐Cigarette via Mitochondrial OXPHOS Complex III Scientific Reports 7 2017 43213 10.1038/srep43213 28256533 PMC5335673 25 S. Xanthoulea A. Delbert A. Romano S. S. Rensen W. A. Buurman R. R. W. J. D. Hulst Nicotine Effect on Inflammatory and Growth Factor Responses in Murine Cutaneous Wound Healing International Immunopharmacology 17 2013 1155 1164 24201082 10.1016/j.intimp.2013.10.022 26 P. Cirillo S. De Rosa M. Pacileo Nicotine Induces Tissue Factor Expression in Cultured Endothelial and Smooth Muscle Cells Journal of Thrombosis and Haemostasis 4 2 2006 453 458 10.1111/j.1538-7836.2006.01741.x 16420579 27 A. K. Whitehead A. P. Erwin X. P. Yue Nicotine and Vascular Dysfunction Acta Physiologica 231 2021 231 10.1111/apha.13631 PMC8026694 33595878 28 S. B. Cannady K. M. Hatten A. M. Bur Use of Free Tissue Transfer in Head and Neck Cancer Surgery and Risk of Overall and Serious Complication(s): An American College of Surgeons‐National Surgical Quality Improvement Project Analysis of Free Tissue Transfer to the Head and Neck Head & Neck 39 2017 702 707 28000297 10.1002/hed.24669 29 N. Irawati J. Every R. Dawson Effect of Operative Time on Complications Associated With Free Flap Reconstruction of the Head and Neck Clinical Otolaryngology 48 2 2023 175 181 10.1111/coa.14000 36321439 30 N. Shaikh K. Noor H. Jafary J. F. Chung T. Fancy W. Stokes Effect of 2 Teams and Operative Time on Complications After Oral Cavity Free Flap Reconstruction Annals of Otology, Rhinology and Laryngology 132 2023 1430 1437 37012707 10.1177/00034894231164802 31 A. C. Offodile 2nd A. Aherrera J. Wenger T. K. Rajab L. Guo Impact of Increasing Operative Time on the Incidence of Early Failure and Complications Following Free Tissue Transfer? A Risk Factor Analysis of 2,008 Patients From the ACS‐NSQIP Database Microsurgery 37 1 2017 12 20 10.1002/micr.22387 25752264 32 C. Perisanidis M. Mittlbock M. Dettke Identifying Risk Factors for Allogenic Blood Transfusion in Oral and Oropharyngeal Cancer Surgery With Free Flap Reconstruction Journal of Oral and Maxillofacial Surgery 71 4 2013 798 804 10.1016/j.joms.2012.08.028 23265851 33 S. V. Puram B. B. Yarlagadda R. Sethi Transfusion in Head and Neck Free Flap Patients: Practice Patterns and a Comparative Analysis by Flap Type Otolaryngology and Head and Neck Surgery 152 2015 449 457 10.1177/0194599814567107 25628368 34 M. C. Madison C. T. Landers B.‐H. Gu Electronic Cigarettes Disrupt Lung Lipid Homeostasis and Innate Immunity Independent of Nicotine Journal of Clinical Investigation 129 2020 4290 4304 10.1172/JCI128531 PMC6763255 31483291 35 H. Nåsell J. Adami E. Samnegård H. Tønnesen S. Ponzer Effect of Smoking Cessation Intervention on Results of Acute Fracture Surgery: A Randomized Controlled Trial Journal of Bone and Joint Surgery. American Volume 92 2010 1335 1342 20516308 10.2106/JBJS.I.00627 36 T. Nicholson A. Scott M. Newton Ede S. W. Jones Do E‐Cigarettes and Vaping Have a Lower Risk of Osteoporosis, Nonunion, and Infection Than Tobacco Smoking? Bone & Joint Research 10 2021 188 191 33709767 10.1302/2046-3758.103.BJR-2020-0327.R1 PMC7998067 37 K. Davidson A. Brancato P. Heetderks Outbreak of Electronic‐Cigarette‐Associated Acute Lipoid Pneumonia ‐ North Carolina, July‐August 2019 MMWR. Morbidity and Mortality Weekly Report 68 36 2019 784 786 10.15585/mmwr.mm6836e1 31513559 PMC6755817 38 T. J. Stack M. N. McCain E. H. Benaim Beyond Tobacco: Bridging Gaps in Social History Records for Tobacco‐Free Nicotine Pouch Consumers OTO Open 8 2024 e70034 39534855 10.1002/oto2.70034 PMC11555441 ",
  "metadata": {
    "Title of this paper": "Beyond Tobacco: Bridging Gaps in Social History Records for Tobacco‐Free Nicotine Pouch Consumers",
    "Journal it was published in:": "The Laryngoscope",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475549/"
  }
}