{
  "title": "Paper_963",
  "abstract": "pmc J Clin Invest J Clin Invest 120 jcinvest J Clin Invest The Journal of Clinical Investigation 0021-9738 1558-8238 American Society for Clinical Investigation PMC12483569 PMC12483569.1 12483569 12483569 40767604 10.1172/JCI186534 186534 1 Research Article Serum- and glucocorticoid-induced kinase 3 orchestrates glucocorticoid signaling to facilitate chromatin remodeling during murine adipogenesis Chen Qilong chenqilong2017@sibs.ac.cn 1 Guo Jialu guojialu2020@sinh.ac.cn 1 Liu Yuyi liuyuyi2021@sibs.ac.cn 1 Du dutai2022@sinh.ac.cn 1 Liu Jiapei 1063964083@qq.com 2 Zhang Yuyao yzhang120@mgh.harvard.edu 3 Dai Yuming daiyuming2019@sinh.ac.cn 1 Zhang Mengdi mdzhang@sinh.ac.cn 1 Zhou Ziqian zhouziqian2019@sibs.ac.cn 1 Zhang Qiyang zhangqiyang2019@sinh.ac.cn 1 Wei Caixia cxwei@sinh.ac.cn 1 Ding Qiurong qrding@sinh.ac.cn 1 Qin Jun qinjun@sinh.ac.cn 1 Zhai Qiwei qwzhai@sibs.ac.cn 1 Qiu Ju qiuju@sibs.ac.cn 1 https://orcid.org/0000-0002-5488-9904 Shao Mengle mlshao@ips.ac.cn 4 Zhang Fang zhangfang2018@sjtu.edu.cn 2 Soukas Alexander A. asoukas@mgh.harvard.edu 3 Zhou Ben benzhou@sinh.ac.cn 1 1 2 3 4 Address correspondence to: Ben Zhou, Shanghai Institute of Nutrition and Health, University of Chinese Academy of Sciences, Chinese Academy of Sciences, Shanghai 200031, China. Phone: 86.021.54920762; Email: benzhou@sibs.ac.cn asoukas@mgh.harvard.edu zhangfang2018@sjtu.edu.cn Authorship note: 24 7 2025 1 10 2025 135 19 498024 e186534 29 8 2024 23 7 2025 24 07 2025 01 10 2025 01 10 2025 © 2025 Chen et al. 2025 Chen et al. https://creativecommons.org/licenses/by/4.0/ This work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ This article is available online at https://www.jci.org/articles/view/186534 Elevated glucocorticoid levels are common in conditions such as aging, chronic stress, Cushing syndrome, and glucocorticoid therapy. While glucocorticoids suppress inflammation through the glucocorticoid receptor (GR), they also cause metabolic side effects. Investigating alternative pathways beyond GR activation is crucial for reducing these side effects. Our phosphoproteomics analysis revealed that glucocorticoid exposure promotes phosphorylation at the RxxS motifs of multiple proteins in preadipocytes, including those mediated by serum- and glucocorticoid-induced kinase 3 (SGK3). SGK3 is a key mediator of glucocorticoid-induced adipogenesis, as shown by impaired adipogenesis after SGK3 inhibition or genetic ablation. Sgk3 Glucocorticoids promotes adipogenesis through SGK3-mediated chromatin remodeling independent of GR, and downregulation of SGK3 inhibits glucocorticoid or high fat diet induced adipogenesis in mice. Cell biology Metabolism Adipose tissue Obesity the Strategic Priority Research Program of the Chinese Academy of Sciences XDB39020800 the National Key R&D Program of China 2023YFA1801100 the National Natural Science Foundation of China 32071149,92157111,82330028,92357306,92357307,82170891,32471175 Noncommunicable Chronic Diseases-National Science and Technology Major Project 2024ZD0530100 Talent Plan of Shanghai Branch-Chinese Academy of Sciences CASSHB-QNPD-2023-019 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction An elevated glucocorticoid level is a common feature in pathophysiological states, including aging, chronic stress, Cushing syndrome, and glucocorticoid therapy. Glucocorticoids are commonly prescribed for managing inflammation in a spectrum of autoimmune, inflammatory, and allergic conditions such as thyroid eye disease, rheumatoid arthritis, lupus erythematosus, inflammatory bowel disease, transplant rejection, and asthma ( 1 2 3 4 5 The effects of glucocorticoids are predominantly mediated through the glucocorticoid receptor (GR), a member of the nuclear hormone receptor family of transcription factors. Synthetic glucocorticoids like dexamethasone (DEX) are extensively used to induce adipogenesis. In vitro adipogenesis is usually initiated by treating postconfluent preadipocytes with an adipogenic cocktail consisting of rosiglitazone, isobutyl methylxanthine (IBMX), DEX, and insulin, collectively known as MDI. DEX rapidly binds and activates GR, leading to the expression of early adipogenic transcription factor ( 6 7 8 10 11 Adipogenesis involves orchestrated actions of transcription factors and epigenomic regulators at various differentiation stages ( 12 13 14 15 18 Mammalian serum- and glucocorticoid-inducible kinases (SGKs) comprise 3 isoforms: SGK1, SGK2, and SGK3. These AGC protein kinases, functioning parallel to AKT downstream of phosphatidylinositol 3-kinase (PI3K), possess conserved catalytic activation loop and C-terminal hydrophobic motif sites phosphorylated by PDK1 and mTORC2, respectively ( 19 21 22 23 24 25 26 27 Here, we found that glucocorticoid promptly induced phosphorylation of motifs featuring the RxxS pattern, partially mediated by SGK3. Using Sgk3 Sgk3 Results Glucocorticoids directly induce phosphoproteomic changes by activating SGK3. Numerous studies have investigated the mechanisms of glucocorticoids’ effects through GR, and recent research has suggested GR-independent roles of glucocorticoids in regulating biological processes including adipogenesis. GR loss delays rather than prevents preadipocyte differentiation in vitro ( 8 9 Figure 1A Sgk1 Rasd1 Figure 1A Supplemental Figure 1A https://doi.org/10.1172/JCI186534DS1 To further investigate the mechanisms of glucocorticoid’s function beyond GR’s activity, we treated primary SVF cells isolated from murine inguinal WAT (iWAT) with DEX for a short time and found a set of proteins were phosphorylated on their serine and threonine sites after DEX treatment in an hour ( Figure 1B Nr3c1 Figure 1C Figure 1D Supplemental Figure 1B Figure 1E Supplemental Figure 1C Supplemental Figure 1D Figure 1F Supplemental Figure 2 Supplemental Figure 2C Next, to determine whether glucocorticoid-induced protein phosphorylation requires GR signaling, we examined tamoxifen-inducible GR-KO cells after DEX treatment. Strikingly, we detected sustained phosphorylation of RxxS/T motifs in specific target proteins despite complete GR ablation ( Supplemental Figure 2D Figure 1G Sgk1 27 Figure 1H Supplemental Figure 2E Supplemental Figure 2F SGK3 deficiency protected mice from DEX- and HFD-induced obesity. Because one of the metabolic side effects of glucocorticoids is to promote obesity, we then evaluate the function of SGK3 in regulating adipose tissue under glucocorticoid treatment in vivo. We intraperitoneally injected 8-week-old Sgk3 –/– Sgk3 +/+ Sgk3 –/– Sgk3 +/+ Figure 2, A–C Figure 2D Sgk3 –/– Figure 2, E–G Sgk3 We and others found Sgk3 28 Sgk3 –/– CAG esr1 Sgk3 fl/fl Sgk3- Sgk3 –/– Sgk3 Sgk3 fl/fl Figure 2, H–O Supplemental Figure 3 Sgk3 Sgk3 Figure 2P Supplemental Figure 3H Sgk3 Sgk3 fl/fl Figure 2P Supplemental Figure 3H Sgk3 Sgk3 fl/fl A more widespread cause of obesity is overnutrition, which induces adipogenesis in adipose tissue. A recent study also showed that mice fed an HFD exhibit higher plasma corticosterone ( 29 Sgk3 fl/fl Sgk3 Supplemental Figure 3I Supplemental Figure 3 Supplemental Figure 3K SGK3 deficiency does not compromise normal hepatic or renal function. Given SGK3’s established roles in regulating ion channels and its critical functions in cell survival and proliferation, we investigated whether Sgk3 Supplemental Figure 4 Supplemental Figure 4 Sgk3 Sgk3 Supplemental Figure 4 The absence of SGK3 prevents preadipocyte differentiation. Next, we investigated whether SGK3 regulates adipogenesis in vitro. The upregulation of SGK3 expression during 3T3-L1 preadipocyte differentiation hints at its potential role in this process ( Figure 3, A and B Sgk3 Figure 3, C, D, and F Figure 3, E and F Supplemental Figure 5A Sgk3 Supplemental Figure 5B – + + + + Sgk3 –/– Sgk3 –/– Supplemental Figure 5C Adipoq Cebpa Fabp4 Pparg Figure 3, G–I Supplemental Figure 5D SGK3 regulates preadipocyte differentiation independent of GR. Given GR’s known involvement in adipogenesis and SGK3’s rapid activation by glucocorticoids, we explored the interplay between SGK3 and the GR signaling pathway ( 8 Nr3c1 Figure 4A Figure 4B Figure 1H Figure 4C Sgk1 Rasd1 Figure 4, D and E Nr3c1 Figure 4, F and G SGK3 regulates adipocyte differentiation independently of cell cycle–associated functions. To investigate how SGK3 regulates adipogenesis, we first examined its relationship with cell cycle regulation, a critical factor in adipocyte differentiation. Proliferation of adipocyte progenitors and subsequent differentiation sustain the pool of adipocytes in vivo. Cells undergo a specific cell cycle reentry during adipocyte differentiation in vivo when an HFD is administered, as well as induced adipocyte differentiation in cell lines in vitro ( 30 31 Sgk3 Supplemental Figure 5E Supplemental Figure 5F Sgk3 Supplemental Figure 5 Supplemental Figure 5I 32 33 Sgk3 Sgk3 Supplemental Figure 6 32 Sgk3 Supplemental Figure 6 SGK3 translocates to the nucleus during early adipocyte differentiation. To further understand the molecular mechanism of SGK3’s function in regulating adipocyte differentiation, we employed TurboID-based proximity labeling combined with mass spectrometry (MS) to identify potential SGK3 interaction proteins during adipogenesis ( Figure 5A 34 Figure 5B Figure 5B To confirm SGK3’s nuclear localization, we separated nuclear and cytosolic fractions of differentiating SVF cells. The nuclear localization of SGK3 was confirmed via immunofluorescence assays on day 2 after adipocyte differentiation induction ( Figure 5C Figure 5D Figure 5E 35 Supplemental Figure 7A Supplemental Figure 7B In pursuit of understanding the mechanism driving SGK3’s nuclear translocation, we examined nuclear-cytoplasmic transporter proteins among SGK3 interacting proteins ( Supplemental Figure 7C Figure 5F Figure 5G Figure 5H SGK3 is crucial for facilitating chromatin remodeling throughout the differentiation of adipocytes. Adipocyte differentiation is intricately regulated by a network of transcription factors operating within a delicately balanced chromatin landscape ( 13 Figure 5B Figure 5B Supplemental Figure 7D Figure 6A Sgk3 Supplemental Figure 8 Sgk3 Supplemental Figure 8C Sgk3 Supplemental Figure 8 To establish the relationship between SGK3 and the BAF complex, we used RNAi to knockdown Brg1 Figure 6B Next, to unravels the role of SGK3 on BRG1 chromatin occupation and subsequently the chromatin remodeling landscape during the early stage of preadipocyte differentiation, we performed BRG1 CUT&Tag and ATAC-Seq in primary SVF cells under vehicle or SGK3 PROTAC treatment, both before differentiation induction (day –3) and on day 2 post-induction. BRG1 CUT&TAG analysis identified 4,109 differential BRG1 occupied regions, of which 1,158 regions were upregulated, and 2,951 regions were downregulated in vehicle-treated cells ( Supplemental Figure 8F Supplemental Figure 8G To obtain insights into the role of SGK3 on chromatin remodeling through BRG1, we further analyzed the chromatin accessibility in regions with differential BRG1 occupancy during preadipocyte differentiation. Adipogenesis is known to involve the activation of numerous genes that facilitate preadipocyte differentiation and metabolic remodeling. The binding of the BAF complex to regulatory elements of these genes aids in their activation. Accordingly, pathway analysis of genes near regions with enhanced BRG1 occupancy revealed enrichment in terms related to white fat cell differentiation and adipogenesis ( Figure 6C Figure 6, D and E Figure 6, D and E Cebpa Pparg Figure 6F SGK3 interacts with BRG1 and regulates its protein level via the Ub-proteasome system. Our subsequent objective was to uncover SGK3’s influence on chromatin remodeling through the BAF complex. We conjectured that the regulation of the BAF complex by SGK3 might depend on particular components within the complex. Given BRG1’s prominence in SGK3 interactions with the BAF complex, we speculated that SGK3 governs the BAF complex via BRG1 ( Supplemental Figure 7D Figure 7A Figure 7B We further confirmed that BRG1 protein levels were upregulated in SGK3-overexpressing cells while downregulated in SGK3-deficient cells ( Figure 7C Brg1 Figure 7D Figure 7E Figure 7F Sgk3 28 36 Sgk3 Figure 7G Figure 7H SGK3 directly phosphorylates BRG1. Given the kinase nation of SGK3, we aimed to explore whether SGK3 regulates BRG1 stability through phosphorylation. With several RxxS/T substrate motifs present in the BRG1 protein sequence, we assessed BRG1 phosphorylation levels using an antibody against Rxx-p-S/T in an in vitro kinase assay. The result displayed an increased phosphorylation level of BRG1 protein upon incubation with SGK3 S486D ( Figure 7I Figure 7J Figure 7, K and L SGK3 deficiency in adipocyte progenitors improves DEX-induced obesity. To investigate the potential role of SGK3 in protecting against DEX-induced obesity within mature adipocytes, we created mature adipocyte–specific Sgk3 Adipoq Sgk3 fl/fl Supplemental Figure 9A Sgk3- Sgk3- Sgk3 fl/fl Supplemental Figure 9 Having demonstrated impaired adipocyte differentiation in SGK3-deficient cells in vitro, we further investigated SGK3’s functional role in vivo by generating adipocyte progenitor–specific-KO (APKO) mice through the crossbreeding of Pdgfrα Sgk3 fl/fl Sgk3- Supplemental Figure 10A Sgk3 Sgk3 fl/fl Sgk3 Sgk3 fl/fl Supplemental Figure 10 Sgk3 Sgk3 Supplemental Figure 10G Given the above, our study proved the requirement of SGK3 in glucocorticoid-induced obesity in mice. The protective function observed in Sgk3 SGK3 deficiency inhibits adipogenesis in vivo. Finally, to further substantiate SGK3’s role in regulating adipogenesis in vivo, we employed AdipoChaser mice to investigate whether SGK3 deficiency indeed inhibits adipocyte differentiation in vivo. AdipoChaser mice were generated by crossing Adipoq rtTA TRE Cre Rosa26 lacZ 37 Supplemental Figure 10 Supplemental Figure 10J -mT/mG Figure 8A Figure 8B Supplemental Figure 10K Pharmaceutical targeting of SGK3 attenuates HFD-induced obesity in mice. Next, we studied whether pharmaceutical inhibition of SGK3 could improve obesity. To monitor the development of obesity, we fed mice an HFD for 2 weeks, followed by vehicle or SGK3 PROTAC injections every 2 days. A control group of mice was fed a chow diet and received vehicle injections ( Figure 8C Figure 8, D–J Supplemental Figure 11 To test the therapeutic potential for treating already obese animals, we treated ob/ob ob/ob Supplemental Figure 11 SGK3 regulates human preadipocyte differentiation. To further examine whether the function of SGK3 in preadipocyte differentiation is conserved between mice and humans, we utilized an immortalized human fibroblast cell line derived from the orbital adipose tissue of a patient with thyroid eye disease. We then induced differentiation of these cells with or without SGK3 PROTAC treatment. Consistently, SGK3 PROTAC treatment inhibited preadipocyte differentiation and lipid accumulation, as indicated by significantly reduced BODIPY intensities ( Figure 8, K and L Figure 8M In summary, our study unveiled glucocorticoid-induced SGK3 activation in adipocyte progenitors. SGK3 deficiency impaired adipocyte differentiation both in vitro and in vivo, and consequently ameliorated glucocorticoid-induced obesity in a mouse model. More importantly, pharmaceutical targeting of SGK3 attenuated HFD-induced obesity in mice, and the role of SGK3 in regulating adipogenesis was conserved between humans and mice. Mechanistically, we uncovered the translocation of SGK3 to the nucleus upon glucocorticoid exposure, a process reliant on the importin β complex. Nuclear SGK3 phosphorylated BRG1, the core subunit of the BAF complex, and maintained BRG1 protein stability. In the absence of SGK3, BRG1 expression decreased, leading to compromised chromatin remodeling required for adipocyte differentiation ( Supplemental Figure 11L Discussion Glucocorticoids primarily exert their function through the GR, but other pathways beyond the GR pathway can also be activated by glucocorticoids. For instance, glucocorticoids have been shown to directly bind and activate GPR97, although its downstream signaling remains elusive ( 11 8 10 Sgk3 Numerous studies have demonstrated that glucocorticoids induce epigenetic alterations by activating their receptor, GR. For instance, GR recruits CBP and HDAC1 to target promoter sites by interacting with the RelB/p52 transcription factor, leading to dynamic acetylation and deacetylation of H3K9 ( 38 39 Both class 1 and class 3 PI3Ks act as positive regulators of adipogenesis ( 40 41 22 27 Sgk3 42 Specifically knocking out Sgk3 Adipoq Sgk3 Pdgfrα Sgk3 43 Our data reveal that Sgk3 ob/ob Supplemental Figure 11 The marked metabolic benefits conferred by SGK3 inhibition under both DEX and HFD challenge establish it as a promising therapeutic target for glucocorticoid-induced and obesity-related metabolic disorders. Given its widespread expression and involvement in diverse physiological processes, the safety profile of SGK3 inhibition requires thorough evaluation. In metabolism, SGK3 contributes to glucose homeostasis, as Sgk3 Akt2 43 44 Sgk3 28 43 45 46 Sgk3 26 47 Sgk3 Sgk3 28 In summary, our results highlight the critical role of SGK3 in glucocorticoid-induced chromatin remodeling and adipogenesis. SGK3 appears to function as a central hub integrating signals from glucocorticoids and growth factors like insulin, thereby promoting adipocyte differentiation through the regulation of epigenetic alterations. The retained immune suppression function of glucocorticoids in Sgk3 Methods Sex as a biological variable. Our study examined male and female animals, and similar findings are reported for both sexes. Animals. Sgk3 Sgk3 –/– Sgk3 48 Sgk3 fl/fl Nr3c1 fl/fl CAG esr1 Pdgfrα Adipoq Sgk3 Sgk3 Sgk3 Sgk3 Sgk3 Sgk3 Sgk3 fl/fl CAG esr1 Pdgfrα Adipoq Sgk3 Adipoq rtTA TRE Cre Rosa26 lacZ Adipoq-rtTA TRE-Cre ROSA26-mT/mG All mouse strains were maintained on a C57BL/6J background. Sibling or age-matched mice were used for all the experiments. All mice experiments were approved by the IACUC of the Shanghai Institute for Nutrition and Health, Chinese Academy of Sciences. All mice were housed in a temperature-controlled, specific pathogen–free barrier facility under a 12-hour light/12-hour dark cycle. Cell culture and treatments. The HEK293T cell line was obtained from the Cell Bank, Type Culture Collection Committee, Chinese Academy of Sciences and cultured in DMEM supplemented with 10% FBS and 1% penicillin/streptomycin in a humidified incubator with 5% CO 2 2 Nr3c1 fl/fl CAG esr1 Nr3c1 fl/fl CAG esr1 Nr3c1 fl/fl 49 Statistics. All quantifications of adipocyte area were conducted using ImageJ (NIH). Statistical analyses were performed using GraphPad Prism. The statistical differences between control and experimental groups were determined by 2-tailed t P n Figure 2, A–P Figure 8, B–G Supplemental Figure 3 Supplemental Figure 7 Supplemental Figure 8 n Figure 1A Figure 3I Figure 4, D and E Figure 5G Figure 6A Figure 7, D–F, and J Figure 8, I and J Supplemental Figure 3H n Figure 3, B–E, and H Figure 4, A and B Figure 5D Figure 6B Supplemental Figure 4C n Supplemental Figure 4 n Figure 6E, n Study approval. All animal studies were approved by the IACUC of Shanghai Institute of Nutrition and Health (SINH-2022-ZB-2). Data availability. Values for all data points in graphs are reported in the Supporting Data Values GSE268382 Author contributions QC, FZ, AAS, and BZ conceived the project. QC and BZ wrote the manuscript. QC, JG, YL, TD, JL, YZ, YD, Q Zhang, ZZ, MZ, CW, and BZ performed experiments and analyzed results. QD, Q Zhai, J Qin, J Qiu, MS, FZ, and AAS contributed to the discussion and edited the manuscript. Supplementary Material Supplemental data Unedited blot and gel images Supporting data values We thank Yufeng Ding, Weijun Pan, Yu Li, and Jun Qin for discussions and sharing reagents; Zhonghui Weng, Cheng Wang, Zhigang Li, Zi Li, Yifan Bu, Feng Zhao, and Jiayu Wu from Institutional Center for Shared Technologies and Facilities of SINH, CAS for technical assistance; and the staff members of the Mass Spectrometry System at the National Facility for Protein Science in Shanghai, Zhangjiang Lab, China, for providing technical support and assistance in data collection and analysis. This work was supported by grants from the National Key R&D Program of China (2023YFA1801100) to BZ and QD, the National Natural Science Foundation of China (grants 32071149 and 92157111 to BZ; 82330028 and 92357306 to QD; 92357307 to FZ; 82170891 and 32471175 to MS), the Strategic Priority Research Program of the Chinese Academy of Sciences (XDB39020800) to BZ, Noncommunicable Chronic Diseases-National Science and Technology Major Project (2024ZD0530100) to MS, and Talent Plan of Shanghai Branch-Chinese Academy of Sciences (CASSHB-QNPD-2023-019) to MS. Conflict of interest: Copyright: Reference information: J Clin Invest 1 Vandewalle J et al Therapeutic mechanisms of glucocorticoids Trends Endocrinol Metab 2018 29 1 42 54 10.1016/j.tem.2017.10.010 29162310 2 Smith TJ Hegedus L Graves’ disease N Engl J Med 2016 375 16 1552 1565 10.1056/NEJMra1510030 27797318 3 Oray M et al Long-term side effects of glucocorticoids Expert Opin Drug Saf 2016 15 4 457 465 10.1517/14740338.2016.1140743 26789102 4 Macfarlane DP et al Glucocorticoids and fatty acid metabolism in humans: fuelling fat redistribution in the metabolic syndrome J Endocrinol 2008 197 2 189 204 10.1677/JOE-08-0054 18434349 5 Thuzar M et al Glucocorticoids suppress brown adipose tissue function in humans: A double-blind placebo-controlled study Diabetes Obes Metab 2018 20 4 840 848 10.1111/dom.13157 29119718 6 Farmer SR Transcriptional control of adipocyte formation Cell Metab 2006 4 4 263 273 10.1016/j.cmet.2006.07.001 17011499 PMC1958996 7 Steger DJ et al Propagation of adipogenic signals through an epigenomic transition state Genes Dev 2010 24 10 1035 1044 10.1101/gad.1907110 20478996 PMC2867208 8 Park YK Ge K Glucocorticoid receptor accelerates, but is dispensable for, adipogenesis Mol Cell Biol 2017 37 2 e00260-16 10.1128/MCB.00260-16 27777311 PMC5214856 9 Bauerle KT et al Glucocorticoid receptor signaling is not required for in vivo adipogenesis Endocrinology 2018 159 5 2050 2061 10.1210/en.2018-00118 29579167 PMC5905394 10 Glantschnig C et al The glucocorticoid receptor in brown adipocytes is dispensable for control of energy homeostasis Embo Rep 2019 20 11 e48552 10.15252/embr.201948552 31559673 PMC6832000 11 Ping YQ et al Structures of the glucocorticoid-bound adhesion receptor GPR97-G o Nature 2021 589 7843 620 626 10.1038/s41586-020-03083-w 33408414 12 Siersbaek R et al Extensive chromatin remodelling and establishment of transcription factor ‘hotspots’ during early adipogenesis EMBO J 2011 30 8 1459 1472 10.1038/emboj.2011.65 21427703 PMC3102274 13 Lee JE et al Transcriptional and epigenomic regulation of adipogenesis Mol Cell Biol 2019 39 11 e00601-18 10.1128/MCB.00601-18 30936246 PMC6517598 14 Mashtalir N et al Modular organization and assembly of SWI/SNF family chromatin remodeling complexes Cell 2018 175 5 1272 1288 10.1016/j.cell.2018.09.032 30343899 PMC6791824 15 Pedersen TÅ et al Cooperation between C/EBPalpha TBP/TFIIB and SWI/SNF recruiting domains is required for adipocyte differentiation Genes Dev 2001 15 23 3208 3216 10.1101/gad.209901 11731483 PMC312836 16 Salma N et al Temporal recruitment of transcription factors and SWI/SNF chromatin-remodeling enzymes during adipogenic induction of the peroxisome proliferator-activated receptor gamma nuclear hormone receptor Mol Cell Biol 2004 24 11 4651 4663 10.1128/MCB.24.11.4651-4663.2004 15143161 PMC416408 17 Wanior M et al Pan-SMARCA/PB1 bromodomain inhibitors and their role in regulating adipogenesis J Med Chem 2020 63 23 14680 14699 10.1021/acs.jmedchem.0c01242 33216538 18 Park YK et al Interplay of BAF and MLL4 promotes cell type-specific enhancer activation Nat Commun 2021 12 1 1630 10.1038/s41467-021-21893-y 33712604 PMC7955098 19 Casamayor A et al Functional counterparts of mammalian protein kinases PDK1 and SGK in budding yeast Curr Biol 1999 9 4 186 197 10.1016/S0960-9822(99)80088-8 10074427 20 Park J et al Serum and glucocorticoid-inducible kinase (SGK) is a target of the PI 3-kinase-stimulated signaling pathway EMBO J 1999 18 11 3024 3033 10.1093/emboj/18.11.3024 10357815 PMC1171384 21 Garcia-Martinez JM Alessi DR mTOR complex 2 (mTORC2) controls hydrophobic motif phosphorylation and activation of serum- and glucocorticoid-induced protein kinase 1 (SGK1) Biochem J 2008 416 3 375 385 10.1042/BJ20081668 18925875 22 Malik N et al Mechanism of activation of SGK3 by growth factors via the Class 1 and Class 3 PI3Ks Biochem J 2018 475 1 117 135 10.1042/BCJ20170650 29150437 PMC5748840 23 Tessier M Woodgett JR Role of the Phox homology domain and phosphorylation in activation of serum and glucocorticoid-regulated kinase-3 J Biol Chem 2006 281 33 23978 23989 10.1074/jbc.M604333200 16790420 24 Malik N et al Phosphoproteomics reveals that the hVPS34 regulated SGK3 kinase specifically phosphorylates endosomal proteins including Syntaxin-7, Syntaxin-12, RFIP4 and WDR44 Biochem J 2019 476 20 3081 3107 10.1042/BCJ20190608 31665227 PMC6824681 25 Gasser JA et al SGK3 mediates INPP4B-dependent PI3K signaling in breast cancer Mol Cell 2014 56 4 595 607 10.1016/j.molcel.2014.09.023 25458846 PMC4255362 26 Bago R et al The hVps34-SGK3 pathway alleviates sustained PI3K/Akt inhibition by stimulating mTORC1 and tumour growth EMBO J 2016 35 17 1902 1922 10.15252/embj.201693929 27481935 PMC5007552 27 He P et al Serum- and glucocorticoid-induced kinase 3 in recycling endosomes mediates acute activation of Na+/H+ exchanger NHE3 by glucocorticoids Mol Biol Cell 2011 22 20 3812 3825 10.1091/mbc.e11-04-0328 21865597 PMC3192861 28 McCormick JA et al Targeted disruption of the protein kinase SGK3/CISK impairs postnatal hair follicle development Mol Biol Cell 2004 15 9 4278 4288 10.1091/mbc.e04-01-0027 15240817 PMC515358 29 Tsai SF et al High-fat diet-induced increases in glucocorticoids contribute to the development of non-alcoholic fatty liver disease in mice FASEB J 2022 36 1 e22130 10.1096/fj.202101570R 34959259 30 Jeffery E et al Rapid depot-specific activation of adipocyte precursor cells at the onset of obesity Nat Cell Biol 2015 17 4 376 385 10.1038/ncb3122 25730471 PMC4380653 31 Vasudevan KM et al AKT-independent signaling downstream of oncogenic PIK3CA mutations in human cancer Cancer Cell 2009 16 1 21 32 10.1016/j.ccr.2009.04.012 19573809 PMC2752826 32 He B et al Arachidonic acid released by PIK3CA mutant tumor cells triggers malignant transformation of colonic epithelium by inducing chromatin remodeling Cell Rep Med 2024 5 5 101510 10.1016/j.xcrm.2024.101510 38614093 PMC11148513 33 Wang M et al The SGK3-Catalase antioxidant signaling axis drives cervical cancer growth and therapy resistance Redox Biol 2023 67 102931 10.1016/j.redox.2023.102931 37866161 PMC10623367 34 Pokorny D et al In vitro reconstitution of Sgk3 activation by phosphatidylinositol 3-phosphate J Biol Chem 2021 297 2 100919 10.1016/j.jbc.2021.100919 34181950 PMC8318898 35 Timmermans S et al A general introduction to glucocorticoid biology Front Immunol 2019 10 1545 10.3389/fimmu.2019.01545 31333672 PMC6621919 36 Liu D et al Identification of CISK, a new member of the SGK kinase family that promotes IL-3-dependent survival Curr Biol 2000 10 19 1233 1236 10.1016/S0960-9822(00)00733-8 11050396 37 Wang QA et al Tracking adipogenesis during white adipose tissue development, expansion and regeneration Nat Med 2013 19 10 1338 1344 10.1038/nm.3324 23995282 PMC4075943 38 Zannas AS Chrousos GP Glucocorticoid signaling drives epigenetic and transcription factors to induce key regulators of human parturition Sci Signal 2015 8 400 fs19 10.1126/scisignal.aad3022 26508787 39 Vockley CM et al Direct GR binding sites potentiate clusters of TF binding across the human genome Cell 2016 166 5 1269 1281 10.1016/j.cell.2016.07.049 27565349 PMC5046229 40 Tomiyama K et al Wortmannin, a specific phosphatidylinositol 3-kinase inhibitor, inhibits adipocytic differentiation of 3T3-L1 cells Biochem Biophys Res Commun 1995 212 1 263 269 10.1006/bbrc.1995.1965 7541986 41 Song W et al Lipid kinase PIK3C3 maintains healthy brown and white adipose tissues to prevent metabolic diseases Proc Natl Acad Sci U S A 2023 120 1 e2214874120 10.1073/pnas.2214874120 36574710 PMC9910429 42 Cai K et al Ndrg1 promotes adipocyte differentiation and sustains their function Sci Rep 2017 7 1 7191 10.1038/s41598-017-07497-x 28775290 PMC5543145 43 Yao LJ et al Novel role for SGK3 in glucose homeostasis revealed in SGK3/Akt2 double-null mice Mol Endocrinol 2011 25 12 2106 2118 10.1210/me.2010-0329 21980074 PMC3231839 44 Sandu C et al Decreased intestinal glucose transport in the sgk3-knockout mouse Pflugers Arch 2005 451 3 437 444 10.1007/s00424-005-1474-7 15971077 45 Bohmer C et al Regulation of the epithelial calcium channel TRPV6 by the serum and glucocorticoid-inducible kinase isoforms SGK1 and SGK3 FEBS Lett 2007 581 29 5586 5590 10.1016/j.febslet.2007.11.006 18005662 46 Embark HM et al Regulation of the epithelial Ca2+ channel TRPV5 by the NHE regulating factor NHERF2 and the serum and glucocorticoid inducible kinase isoforms SGK1 and SGK3 expressed in Xenopus oocytes Cell Physiol Biochem 2004 14 4-6 203 212 10.1159/000080329 15319523 47 Chang CA et al Ontogeny and vulnerabilities of drug-tolerant persisters in HER2+ breast cancer Cancer Discov 2022 12 4 1022 1045 10.1158/2159-8290.CD-20-1265 34911733 PMC8983469 48 Zhou B et al Mitochondrial permeability uncouples elevated autophagy and lifespan extension Cell 2019 177 2 299 314 10.1016/j.cell.2019.02.013 30929899 PMC6610881 49 Cheng L et al Repurposing lenvatinib as a potential therapeutic agent against thyroid eye disease by suppressing adipogenesis in orbital adipose tissues Pharmaceuticals (Basel) 2022 15 11 1305 10.3390/ph15111305 36355477 PMC9696555 Version 1 08/06/2025 In-Press Preview Version 2 10/01/2025 Electronic publication Figure 1 SGK3 is essential for protein phosphorylation in response to glucocorticoid stimulation. ( A Sgk1 Rasd1 n B C Nr3c1 fl/fl D E F G H B C H A P Figure 2 Sgk3 ( A D A B C D Sgk3 +/+ Sgk3 –/– n Sgk3 +/+ n Sgk3 +/+ n Sgk3 –/– n Sgk3 –/– E G E F G Sgk3 +/+ Sgk3 –/– n Sgk3 +/+ n Sgk3 –/– H–L H I J K L Sgk3 fl/fl Sgk3 n M O M N O Sgk3 fl/fl Sgk3 n Sgk3 fl/fl n Sgk3 P Sgk3 fl/fl Sgk3 n A D E O t P P P Figure 3 SGK3 regulates adipogenesis. ( A B Sgk3 n C E Sgk3 C Sgk3 D E n F Sgk3 G H n I Adipoq Cebpa Fabp4 Pparg n B H I C E t P P P P Figure 4 SGK3 regulates adipogenesis independently of GR signaling. ( A Nr3c1 n B n C D E Sgk1 D Rasd1 E n F G G A B D E P P P Figure 5 Glucocorticoid-induced nuclear SGK3 translocation during early stage of preadipocyte differentiation. ( A B C D n E F G H n D D H P Figure 6 Deficiency of SGK3 impairs chromatin remodeling during preadipocyte differentiation. ( A n B Brg1 n C D E n F Pparg Cebpa A t B A E P P P Figure 7 SGK3 regulates differentiation-associated chromatin remodeling via BRG1. ( A B C Sgk3 D Brg1 n E F E F n G Sgk3 fl/fl Sgk3 n H I J K n L D E F G, K t D E K t F G H L J P P P P Figure 8 Pharmaceutical targeting of SGK3 attenuates HFD-induced obesity in mice and adipogenesis in vivo and in human cells. ( A mT/mG B n n C D I D E F G H I n n J K L K L n M n M B D I L M P P P P ",
  "metadata": {
    "Title of this paper": "Repurposing lenvatinib as a potential therapeutic agent against thyroid eye disease by suppressing adipogenesis in orbital adipose tissues",
    "Journal it was published in:": "The Journal of Clinical Investigation",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483569/"
  }
}