{
  "title": "Paper_1016",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12480346 PMC12480346.1 12480346 12480346 41020915 10.1007/s12672-025-03560-6 3560 1 Review Unveiling the oncogenic functions of lncRNA PSMG3-AS1 Zhang Hui 1 Wang Xin wxxh66@126.com 2 1 https://ror.org/00ms48f15 grid.233520.5 0000 0004 1761 4404 Department of Traditional Chinese Medicine, The Second Affiliated Hospital of Air Force Medical University, 2 https://ror.org/00ms48f15 grid.233520.5 0000 0004 1761 4404 Department of Gastroenterology, The Second Affiliated Hospital of Air Force Medical University, 29 9 2025 12 2025 16 478248 1773 22 5 2025 1 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Long non-coding RNAs (lncRNAs) have emerged as crucial regulators of various biological processes, including gene expression, cell differentiation, and response to external stimuli. Among them, PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 Keywords PSMG3-AS1 Long non-coding RNA Neoplasms Competing endogenous RNA Tumor progression pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Cancer remains a leading cause of mortality globally, contributing to over 10 million deaths in 2019. This escalating burden reflects an interplay of demographic shifts, such as population aging, and modifiable risk factors including tobacco and alcohol use, unhealthy diets, physical inactivity, and environmental pollutants [ 1 2 3 4 5 6 Advances in genomics have reshaped understanding of the human genome, revealing that protein-coding genes constitute less than 2% of its entirety [ 7 8 9 10 11 12 Long non-coding RNAs (lncRNAs) are integral to the regulation of gene expression, influencing processes such as chromatin remodeling, transcription, and post-transcriptional modifications [ 13 14 15 16 17 19 20 21 23 Numerous lncRNAs have demonstrated significant roles in cancer progression. For instance, TRPM2-AS IGF2BP2/TRPM2-AS/PABPC1-NUMB-NOTCH1 24 LINC00930 miR-6792-3p/ZBTB16 25 27 LINC00839 miR-195-5p/CCNE1 28 PSMG3‑AS1 PSMG3 antisense RNA 1 ( PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 Biogenesis, distribution, and biological functions of lncRNAs Long non-coding RNAs (lncRNAs) have emerged as significant regulators of various biological processes. Advances in RNA sequencing and bioinformatics have identified numerous lncRNAs, revealing their broad diversity, complex biogenesis, and critical roles in cellular physiology. Biogenesis of lncRNAs LncRNAs are primarily transcribed by RNA polymerase II, undergoing similar post-transcriptional modifications as mRNAs, such as 5′ capping, splicing, and 3′ polyadenylation. However, they also follow unique processing mechanisms. For instance, some lncRNAs, form mature 3′ ends through ribonuclease P cleavage of tRNA-like structures. Others may incorporate snoRNA-protein complexes at their termini, enhancing stability [ 29 30 31 Epigenetic modifications significantly regulate lncRNA transcription. Histone acetylation, such as H3K56 acetylation, and chromatin remodeling by factors like SWI/SNF can promote lncRNA synthesis [ 32 33 33 34 Distribution and features of lncRNAs LncRNAs are ubiquitously expressed across prokaryotic and eukaryotic organisms [ 35 29 36 37 Evolutionarily, lncRNAs exhibit lower sequence conservation compared to protein-coding genes, though their structural motifs are often preserved, highlighting their functional importance. Additionally, lncRNAs evolve rapidly, contributing to their dynamic roles across species [ 38 Biological functions of lncRNAs LncRNAs regulate gene expression through diverse mechanisms, including acting as molecular signals, decoys, scaffolds, guides, or SINEUPs [ 39 40 41 42 39 43 44 45 Uchl1 46 PSMG3-AS1 PSMG3-AS1 1 1 PSMG3‑AS1 PSMG3‑AS1  Fig. 1 The functional roles of PSMG3-AS1 in different cancers  Table 1 The biological roles of PSMG3-AS1 in different types of cancer Cancer type Property Expression Mechanism Biological functions References Breast cancer Oncogene Upregulate Sponging of miR‑143‑3p COL1A1 Proliferation, migration, metastasis [ 47 Cervical squamous cell carcinoma Oncogene Upregulate Sponging of miR‑4417 Migration, invasion [ 48 Endometrial cancer Oncogene Upregulate Negative regulation of MEG3 Proliferation [ 49 Gastric cancer Oncogene Upregulate Sponging of miR‑451a CAV1 Proliferation, apoptosis [ 50 Glioma Oncogene Upregulate Downregulates miR‑34a Chemoresistance, proliferation [ 51 Hepatocellular carcinoma Oncogene Upregulate Sponging of miR‑143‑3p Proliferation [ 52 Lung carcinoma Oncogene Upregulate Sponging of miR‑449b‑5p miR‑613 SphK1 miR‑143‑3p Proliferation, migration, invasion [ 53 [ 54 [ 55 Oral squamous cell carcinoma Oncogene Upregulate Sponging of miR‑141 Proliferation [ 56 Prostate carcinoma Oncogene Upregulate Sponging of miR‑106b Proliferation [ 57 Breast cancer Breast cancer is the second most common cancer globally, with 2.3 million new cases in 2022, accounting for 11.6% of all cancer cases [ 4 58 59 4 PSMG3-AS1 47 PSMG3-AS1 PSMG3-AS1 miR-143-3p 47 COL1A1 miR-143-3p PSMG3-AS1 miR-143-3p COL1A1 PSMG3‑AS1 miR‑143‑3p COL1A1 Cervical squamous cell carcinoma (CSCC) Cervical Squamous Cell Carcinoma (CSCC) ranks fourth among cancers affecting women, with 660,000 new cases and 350,000 deaths globally in 2022 4 4 60 61 In CSCC, PSMG3-AS1 PSMG3-AS1 miR-4417 48 miR-4417 miR-4417 PSMG3-AS1 PSMG3-AS1 miR-4417 48 PSMG3-AS1 Endometrial cancer (EC) Endometrial cancer, accounting for 90% of uterine cancers, is among the most common gynecological malignancies, with 417,000 new cases and nearly 97,000 deaths worldwide in 2020 [ 1 62 63 64 65 In EC, PSMG3-AS1 MEG3 49 PSMG3-AS1 MEG3 PSMG3-AS1 MEG3 49 PSMG3-AS1 MEG3 Gastric cancer Gastric cancer is the fifth most commonly diagnosed cancer and the fourth leading cause of cancer deaths worldwide, with a five-year survival rate of less than 10% [ 1 66 67 68 69 PSMG3-AS1 PSMG3-AS1 50 PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 caveolin-1 CAV1) miR-451a PSMG3-AS1 CAV1 PSMG3-AS1 miR-451a 50 PSMG3-AS1 Glioma Gliomas are the most common brain and spinal cord cancers, with glioblastoma (GBM) representing 57% of all gliomas and 48% of aggressive CNS tumors [ 70 71 72 Shan et al. highlighted the upregulation of PSMG3-AS1 73 PSMG3-AS1 73 PSMG3-AS1 miR-34a miR-34a PSMG3-AS1 miR-34a miR-34a PSMG3-AS1 Another study explored the role of PSMG3-AS1 51 PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 Hepatocellular carcinoma (HCC) Hepatocellular carcinoma, the most common type of primary liver cancer, ranks as the sixth most prevalent cancer and the fourth leading cause of cancer deaths globally [ 74 75 76 77 78 PSMG3-AS1 52 PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 miR-143-3p 52 miR-143-3p 79 PSMG3-AS1 PSMG3-AS1 miR‑143‑3p Lung carcinoma Lung cancer remains the leading cause of cancer-related deaths globally, with 1.8 million deaths in 2020 [ 1 80 81 82 83 In vitro experiments demonstrated that LUAD cell proliferation was promoted by PSMG3-AS1 53 PSMG3-AS1 miR-449b-5p miR-449b-5p 53 PSMG3-AS1 miR-449b-5p PSMG3-AS1 In another study the PSMG3-AS1 miR-613 SphK1 54 PSMG3-AS1 miR-613 SphK1 miR-613 SphK1 PSMG3-AS1 miR-613 SphK1 54 Another study in LUSC, PSMG3-AS1 55 PSMG3-AS1 PSMG3-AS1 miR-143-3p miR-143-3p PSMG3-AS1 miR-143-3p 55 PSMG3-AS1 Oral squamous cell carcinoma (OSCC) Oral squamous cell carcinoma (OSCC) accounted for 377,713 new cases and 177,757 deaths worldwide in 2020 [ 84 85 86 87 A study showed that PSMG3-AS1 56 miR-141 PSMG3-AS1 miR-141 PSMG3-AS1 56 PSMG3-AS1 Prostate carcinoma (PCa) Prostate cancer (PCa) is the second most common cancer in men, with 1.5 million new cases and 397,000 deaths globally in 2022 [ 4 4 4 Qiang Xia et al. revealed the upregulation of PSMG3-AS1 miR-106b 57 PSMG3-AS1 miR-106b miR-106b PSMG3-AS1 miR-106b 57 PSMG3-AS1 Integrative analysis and translational perspective on PSMG3-AS1 Comparative mechanistic roles of PSMG3-AS1 Across diverse malignancies, PSMG3‑AS1 consistently orchestrates tumorigenic processes via common regulatory pathways. Most prominently, it functions as a ceRNA, sequestering tumor‑suppressive microRNAs (e.g. miR‑143‑3p miR‑613 miR‑451a COL1A1 SphK1 CAV1 47 54 PSMG3-AS1 miR-143-3p COL1A1 PSMG3-AS1 SphK1 miR-613 2  Fig. 2 The ceRNA network of PSMG3-AS1 lncRNA However, this ceRNA model does not universally explain the behavior of PSMG3-AS1 51 PSMG3-AS1 miR-34a 57 PSMG3-AS1 miR-106b Furthermore, the nature of downstream targets regulated by PSMG3-AS1 50 PSMG3-AS1 miR-451a CAV1 52 miR-143-3p 49 PSMG3-AS1 MEG3 PSMG3-AS1 Mechanistic integration into oncogenic signaling pathways The diversity of PSMG3-AS1 54 SphK1 PSMG3-AS1 SphK1 47 COL1A1 miR-143-3p COL1A1 In glioma [ 51 PSMG3-AS1 miR-34a PSMG3-AS1 miR-34a PSMG3-AS1 Tissue-specific regulation and functional divergence Although PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 51 57 The differential availability of miRNA targets and RNA-binding proteins across tissues may also account for variability in downstream effectors. For instance, while miR-143-3p Translational perspectives PSMG3‑AS1 PSMG3‑AS1 88 89 CAV1 Given its frequent dysregulation and mechanistic diversity across cancers, PSMG3‑AS1 miR‑143‑3p miR‑34a miR‑613 Several unresolved challenges hinder clinical translation of lncRNA-targeted therapies. The poor cross-species conservation and differing isoforms, stability, and subcellular localization in mice versus humans limit model relevance, requiring humanized systems or organoids for validation [ 13 90 MALAT1 91 92 93 Subcellular localization of PSMG3‑AS1 PSMG3‑AS1 PSMG3‑AS1 56 PSMG3‑AS1 50 PSMG3‑AS1 51 PSMG3‑AS1 Conclusion and future perspectives PSMG3‑AS1 PSMG3‑AS1 While current findings underscore the oncogenic potential of PSMG3-AS1 PSMG3‑AS1 Future research should focus on leveraging advanced techniques like single-cell sequencing and CRISPR-based gene editing to dissect the role of PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 PSMG3-AS1 In conclusion, PSMG3‑AS1 Abbreviations miRNAs MicroRNAs lncRNAs Long non-coding RNAs ceRNA Competitive endogenous RNA OSCC Oral squamous cell carcinoma CSCC Cervical squamous cell carcinoma GBM Glioblastoma TMZ Temozolomide HCC Hepatocellular carcinoma EMT Epithelial–mesenchymal transition EC Endometrial carcinoma NSCLC Non-small cell lung cancer LUAD Lung adenocarcinoma LUSC Lung squamous cell carcinoma LNM Lymph node metastasis Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions H.Z. is the Main writer, contributed to all sections of the paper, X.W. is Corresponding author; involved in project planning and supervision. All authors discussed the results and contributed to the final manuscript. Funding No funding was received for this research. Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. This study is a literature review and did not involve new experiments with human participants or animals. Consent for publication Not applicable. No individual person’s data are included in any form. Competing interests The authors declare no competing interests. References 1. Sung H Ferlay J Siegel RL Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 3 209 49 10.3322/caac.21660 33538338 Sung H, Ferlay J, Siegel RL, et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71(3):209–49. 10.3322/caac.21660. 33538338 10.3322/caac.21660 2. GBD 2019 Diseases and Injuries Collaborators Global burden of 369 diseases and injuries in 204 countries and territories, 1990–2019: a systematic analysis for the global burden of disease study 2019 Lancet 2020 396 10258 1204 22 10.1016/S0140-6736(20)30925-9 33069326 PMC7567026 GBD 2019 Diseases and Injuries Collaborators. Global burden of 369 diseases and injuries in 204 countries and territories, 1990–2019: a systematic analysis for the global burden of disease study 2019. Lancet. 2020;396(10258):1204–22. 10.1016/S0140-6736(20)30925-9. 33069326 10.1016/S0140-6736(20)30925-9 PMC7567026 3. Chen S Cao Z Prettner K Estimates and projections of the global economic cost of 29 cancers in 204 countries and territories from 2020 to 2050 JAMA Oncol 2023 9 4 465 72 10.1001/jamaoncol.2022.7826 36821107 PMC9951101 Chen S, Cao Z, Prettner K, et al. Estimates and projections of the global economic cost of 29 cancers in 204 countries and territories from 2020 to 2050. JAMA Oncol. 2023;9(4):465–72. 10.1001/jamaoncol.2022.7826. 36821107 10.1001/jamaoncol.2022.7826 PMC9951101 4. Bray F Laversanne M Sung H Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 3 229 63 10.3322/caac.21834 38572751 Bray F, Laversanne M, Sung H, et al. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2024;74(3):229–63. 10.3322/caac.21834. 38572751 10.3322/caac.21834 5. Bray F Laversanne M Weiderpass E Soerjomataram I The ever-increasing importance of cancer as a leading cause of premature death worldwide Cancer 2021 127 16 3029 30 10.1002/cncr.33587 34086348 Bray F, Laversanne M, Weiderpass E, Soerjomataram I. The ever-increasing importance of cancer as a leading cause of premature death worldwide. Cancer. 2021;127(16):3029–30. 10.1002/cncr.33587. 34086348 10.1002/cncr.33587 6. Guida F Kidman R Ferlay J Global and regional estimates of orphans attributed to maternal cancer mortality in 2020 Nat Med 2022 28 12 2563 72 10.1038/s41591-022-02109-2 36404355 PMC9676732 Guida F, Kidman R, Ferlay J, et al. Global and regional estimates of orphans attributed to maternal cancer mortality in 2020. Nat Med. 2022;28(12):2563–72. 10.1038/s41591-022-02109-2. 36404355 10.1038/s41591-022-02109-2 PMC9676732 7. Li Y Non-coding RNA. Performs its biological function by interacting with macromolecules Int J Mol Sci 2023 10.3390/ijms242216246 38003435 PMC10671565 Li Y. Non-coding RNA. Performs its biological function by interacting with macromolecules. Int J Mol Sci. 2023. 10.3390/ijms242216246. 38003435 10.3390/ijms242216246 PMC10671565 8. Leng X Zhang M Xu Y Non-coding RNAs as therapeutic targets in cancer and its clinical application J Pharm Anal 2024 14 7 100947 10.1016/j.jpha.2024.02.001 39149142 PMC11325817 Leng X, Zhang M, Xu Y, et al. Non-coding RNAs as therapeutic targets in cancer and its clinical application. J Pharm Anal. 2024;14(7):100947. 10.1016/j.jpha.2024.02.001. 39149142 10.1016/j.jpha.2024.02.001 PMC11325817 9. Grillone K Riillo C Scionti F Non-coding RNAs in cancer: platforms and strategies for investigating the genomic dark matter J Exp Clin Cancer Res 2020 39 1 117 10.1186/s13046-020-01622-x 32563270 PMC7305591 Grillone K, Riillo C, Scionti F, et al. Non-coding RNAs in cancer: platforms and strategies for investigating the genomic dark matter. J Exp Clin Cancer Res. 2020;39(1):117. 10.1186/s13046-020-01622-x. 32563270 10.1186/s13046-020-01622-x PMC7305591 10. Morovat P Morovat S Ashrafi AM Teimourian S Identification of potentially functional circular RNAs hsa_circ_0070934 and hsa_circ_0004315 as prognostic factors of hepatocellular carcinoma by integrated bioinformatics analysis Sci Rep 2022 12 1 4933 10.1038/s41598-022-08867-w 35322101 PMC8943026 Morovat P, Morovat S, Ashrafi AM, Teimourian S. Identification of potentially functional circular RNAs hsa_circ_0070934 and hsa_circ_0004315 as prognostic factors of hepatocellular carcinoma by integrated bioinformatics analysis. Sci Rep. 2022;12(1):4933. 10.1038/s41598-022-08867-w. 35322101 10.1038/s41598-022-08867-w PMC8943026 11. Zhang P Wu W Chen Q Chen M Non-coding RNAs and their integrated networks J Integr Bioinform 2019 10.1515/jib-2019-0027 31301674 PMC6798851 Zhang P, Wu W, Chen Q, Chen M. Non-coding RNAs and their integrated networks. J Integr Bioinform. 2019. 10.1515/jib-2019-0027. 31301674 10.1515/jib-2019-0027 PMC6798851 12. Morey C Avner P Employment opportunities for non-coding RNAs FEBS Lett 2004 567 1 27 34 10.1016/j.febslet.2004.03.117 15165889 Morey C, Avner P. Employment opportunities for non-coding RNAs. FEBS Lett. 2004;567(1):27–34. 10.1016/j.febslet.2004.03.117. 15165889 10.1016/j.febslet.2004.03.117 13. Mattick JS Amaral PP Carninci P Long non-coding RNAs: definitions, functions, challenges and recommendations Nat Rev Mol Cell Biol 2023 24 6 430 47 10.1038/s41580-022-00566-8 36596869 PMC10213152 Mattick JS, Amaral PP, Carninci P, et al. Long non-coding RNAs: definitions, functions, challenges and recommendations. Nat Rev Mol Cell Biol. 2023;24(6):430–47. 10.1038/s41580-022-00566-8. 36596869 10.1038/s41580-022-00566-8 PMC10213152 14. Liu Y Ding W Yu W Zhang Y Ao X Wang J Long non-coding rnas: biogenesis, functions, and clinical significance in gastric cancer Mol Ther 2021 23 458 76 10.1016/j.omto.2021.11.005 PMC8637188 34901389 Liu Y, Ding W, Yu W, Zhang Y, Ao X, Wang J. Long non-coding rnas: biogenesis, functions, and clinical significance in gastric cancer. Mol Ther. 2021;23:458–76. 10.1016/j.omto.2021.11.005. 10.1016/j.omto.2021.11.005 PMC8637188 34901389 15. Statello L Guo CJ Chen LL Huarte M Gene regulation by long non-coding RNAs and its biological functions Nat Rev Mol Cell Biol 2021 22 2 96 118 10.1038/s41580-020-00315-9 33353982 PMC7754182 Statello L, Guo CJ, Chen LL, Huarte M. Gene regulation by long non-coding RNAs and its biological functions. Nat Rev Mol Cell Biol. 2021;22(2):96–118. 10.1038/s41580-020-00315-9. 33353982 10.1038/s41580-020-00315-9 PMC7754182 16. Oo JA Brandes RP Leisegang MS Long non-coding rnas: novel regulators of cellular physiology and function Pflugers Arch 2022 474 2 191 204 10.1007/s00424-021-02641-z 34791525 PMC8766390 Oo JA, Brandes RP, Leisegang MS. Long non-coding rnas: novel regulators of cellular physiology and function. Pflugers Arch. 2022;474(2):191–204. 10.1007/s00424-021-02641-z. 34791525 10.1007/s00424-021-02641-z PMC8766390 17. Zhou S Yu X Wang M Long non-coding RNAs in pathogenesis of neurodegenerative diseases Front Cell Dev Biol 2021 9 719247 10.3389/fcell.2021.719247 34527672 PMC8435612 Zhou S, Yu X, Wang M, et al. Long non-coding RNAs in pathogenesis of neurodegenerative diseases. Front Cell Dev Biol. 2021;9:719247. 10.3389/fcell.2021.719247. 34527672 10.3389/fcell.2021.719247 PMC8435612 18. Xie X Huang M Ma S The role of long non-coding RNAs in cardiovascular diseases: a comprehensive review Non-coding RNA Res 2025 11 158 87 10.1016/j.ncrna.2024.12.009 PMC11783329 39896344 Xie X, Huang M, Ma S, et al. The role of long non-coding RNAs in cardiovascular diseases: a comprehensive review. Non-coding RNA Res. 2025;11:158–87. 10.1016/j.ncrna.2024.12.009. 10.1016/j.ncrna.2024.12.009 PMC11783329 39896344 19. Alipoor B Nikouei S Rezaeinejad F Malakooti-Dehkordi SN Sabati Z Ghasemi H Long non-coding RNAs in metabolic disorders: pathogenetic relevance and potential biomarkers and therapeutic targets J Endocrinol Invest 2021 44 10 2015 41 10.1007/s40618-021-01559-8 33792864 Alipoor B, Nikouei S, Rezaeinejad F, Malakooti-Dehkordi SN, Sabati Z, Ghasemi H. Long non-coding RNAs in metabolic disorders: pathogenetic relevance and potential biomarkers and therapeutic targets. J Endocrinol Invest. 2021;44(10):2015–41. 10.1007/s40618-021-01559-8. 33792864 10.1007/s40618-021-01559-8 20. Chi Y Wang D Wang J Yu W Yang J Long non-coding RNA in the pathogenesis of cancers Cells 2019 10.3390/cells8091015 31480503 PMC6770362 Chi Y, Wang D, Wang J, Yu W, Yang J. Long non-coding RNA in the pathogenesis of cancers. Cells. 2019. 10.3390/cells8091015. 31480503 10.3390/cells8091015 PMC6770362 21. Morovat P Morovat S Hosseinpour M Moslabeh FGZ Kamali MJ Samadani AA Survival-based bioinformatics analysis to identify hub long non-coding RNAs along with lncRNA-miRNA-mRNA network for potential diagnosis/prognosis of thyroid cancer J Cell Commun Signal 2023 17 3 639 55 10.1007/s12079-022-00697-9 36149574 PMC10409689 Morovat P, Morovat S, Hosseinpour M, Moslabeh FGZ, Kamali MJ, Samadani AA. Survival-based bioinformatics analysis to identify hub long non-coding RNAs along with lncRNA-miRNA-mRNA network for potential diagnosis/prognosis of thyroid cancer. J Cell Commun Signal. 2023;17(3):639–55. 10.1007/s12079-022-00697-9. 36149574 10.1007/s12079-022-00697-9 PMC10409689 22. Ala U Competing endogenous rnas, non-coding RNAs and diseases: an intertwined story Cells 2020 10.3390/cells9071574 32605220 PMC7407898 Ala U. Competing endogenous rnas, non-coding RNAs and diseases: an intertwined story. Cells. 2020. 10.3390/cells9071574. 32605220 10.3390/cells9071574 PMC7407898 23. Wang L Cho KB Li Y Tao G Xie Z Guo B Long noncoding RNA (lncrna)-mediated competing endogenous RNA networks provide novel potential biomarkers and therapeutic targets for colorectal cancer Int J Mol Sci 2019 10.3390/ijms20225758 31744051 PMC6888455 Wang L, Cho KB, Li Y, Tao G, Xie Z, Guo B. Long noncoding RNA (lncrna)-mediated competing endogenous RNA networks provide novel potential biomarkers and therapeutic targets for colorectal cancer. Int J Mol Sci. 2019. 10.3390/ijms20225758. 31744051 10.3390/ijms20225758 PMC6888455 24. He Z Zhong Y Regmi P Exosomal long non-coding RNA TRPM2-AS promotes angiogenesis in gallbladder cancer through interacting with PABPC1 to activate NOTCH1 signaling pathway Mol Cancer 2024 23 1 65 10.1186/s12943-024-01979-z 38532427 PMC10967197 He Z, Zhong Y, Regmi P, et al. Exosomal long non-coding RNA TRPM2-AS promotes angiogenesis in gallbladder cancer through interacting with PABPC1 to activate NOTCH1 signaling pathway. Mol Cancer. 2024;23(1):65. 10.1186/s12943-024-01979-z. 38532427 10.1186/s12943-024-01979-z PMC10967197 25. Mao Y Su X Guo Q Long non-coding RNA LINC00930 targeting miR-6792-3p/ZBTB16 regulates the proliferation and EMT of pancreatic cancer BMC Cancer 2024 24 1 638 10.1186/s12885-024-12365-9 38789960 PMC11127394 Mao Y, Su X, Guo Q, et al. Long non-coding RNA LINC00930 targeting miR-6792-3p/ZBTB16 regulates the proliferation and EMT of pancreatic cancer. BMC Cancer. 2024;24(1):638. 10.1186/s12885-024-12365-9. 38789960 10.1186/s12885-024-12365-9 PMC11127394 26. Seyedi D Espandar N Hojatizadeh M Mohammadi Y Sadri F Rezaei Z Noncoding RNAs in rheumatoid arthritis: modulators of the NF-κB signaling pathway and therapeutic implications Front Immunol 2024 10.3389/fimmu.2024.1486476 39530095 PMC11550995 Seyedi D, Espandar N, Hojatizadeh M, Mohammadi Y, Sadri F, Rezaei Z. Noncoding RNAs in rheumatoid arthritis: modulators of the NF-κB signaling pathway and therapeutic implications. Front Immunol. 2024. 10.3389/fimmu.2024.1486476. 39530095 10.3389/fimmu.2024.1486476 PMC11550995 27. Pourmehran Y Sadri F Hosseini SF Mohammadi Y Rezaei Z Exploring the influence of non-coding RNAs on NF-κB signaling pathway regulation in ulcerative colitis Biomed Pharmacother 2024 179 117390 10.1016/j.biopha.2024.117390 39243424 Pourmehran Y, Sadri F, Hosseini SF, Mohammadi Y, Rezaei Z. Exploring the influence of non-coding RNAs on NF-κB signaling pathway regulation in ulcerative colitis. Biomed Pharmacother. 2024;179:117390. 10.1016/j.biopha.2024.117390. 39243424 10.1016/j.biopha.2024.117390 28. Kalantary-Charvadeh A Morovat S Aslani S Ziamajidi N Emami Razavi A Abbasalipourkabir R The role of long non-coding RNA LINC00839 in oral squamous cell carcinoma based on bioinformatics and experimental research Sci Rep 2024 14 1 31817 10.1038/s41598-024-82922-6 39738469 PMC11686358 Kalantary-Charvadeh A, Morovat S, Aslani S, Ziamajidi N, Emami Razavi A, Abbasalipourkabir R. The role of long non-coding RNA LINC00839 in oral squamous cell carcinoma based on bioinformatics and experimental research. Sci Rep. 2024;14(1):31817. 10.1038/s41598-024-82922-6. 39738469 10.1038/s41598-024-82922-6 PMC11686358 29. Wu H Yang L Chen LL The diversity of long noncoding RNAs and their generation Trends Genet 2017 33 8 540 52 10.1016/j.tig.2017.05.004 28629949 Wu H, Yang L, Chen LL. The diversity of long noncoding RNAs and their generation. Trends Genet. 2017;33(8):540–52. 10.1016/j.tig.2017.05.004. 28629949 10.1016/j.tig.2017.05.004 30. Gourvest M Brousset P Bousquet M Long noncoding RNAs in acute myeloid leukemia: functional characterization and clinical relevance Cancers (Basel) 2019 10.3390/cancers11111638 31653018 PMC6896193 Gourvest M, Brousset P, Bousquet M. Long noncoding RNAs in acute myeloid leukemia: functional characterization and clinical relevance. Cancers (Basel). 2019. 10.3390/cancers11111638. 31653018 10.3390/cancers11111638 PMC6896193 31. Chen LL The biogenesis and emerging roles of circular RNAs Nat Rev Mol Cell Biol 2016 17 4 205 11 10.1038/nrm.2015.32 26908011 Chen LL. The biogenesis and emerging roles of circular RNAs. Nat Rev Mol Cell Biol. 2016;17(4):205–11. 10.1038/nrm.2015.32. 26908011 10.1038/nrm.2015.32 32. Quinn JJ Chang HY Unique features of long non-coding RNA biogenesis and function Nat Rev Genet 2016 17 1 47 62 10.1038/nrg.2015.10 26666209 Quinn JJ, Chang HY. Unique features of long non-coding RNA biogenesis and function. Nat Rev Genet. 2016;17(1):47–62. 10.1038/nrg.2015.10. 26666209 10.1038/nrg.2015.10 33. Sleutels F Zwart R Barlow DP The non-coding air RNA is required for silencing autosomal imprinted genes Nature 2002 415 6873 810 3 10.1038/415810a 11845212 Sleutels F, Zwart R, Barlow DP. The non-coding air RNA is required for silencing autosomal imprinted genes. Nature. 2002;415(6873):810–3. 10.1038/415810a. 11845212 10.1038/415810a 34. Tam C Wong JH Tsui SKW Zuo T Chan TF Ng TB Lncrnas with miRNAs in regulation of gastric, liver, and colorectal cancers: updates in recent years Appl Microbiol Biotechnol 2019 103 12 4649 77 10.1007/s00253-019-09837-5 31062053 Tam C, Wong JH, Tsui SKW, Zuo T, Chan TF, Ng TB. Lncrnas with miRNAs in regulation of gastric, liver, and colorectal cancers: updates in recent years. Appl Microbiol Biotechnol. 2019;103(12):4649–77. 10.1007/s00253-019-09837-5. 31062053 10.1007/s00253-019-09837-5 35. Liu H Wan J Chu J Long non-coding RNAs and endometrial cancer Biomed Pharmacother 2019 119 109396 10.1016/j.biopha.2019.109396 31505425 Liu H, Wan J, Chu J. Long non-coding RNAs and endometrial cancer. Biomed Pharmacother. 2019;119:109396. 10.1016/j.biopha.2019.109396. 31505425 10.1016/j.biopha.2019.109396 36. Jia H Osak M Bogu GK Stanton LW Johnson R Lipovich L Genome-wide computational identification and manual annotation of human long noncoding RNA genes RNA 2010 16 8 1478 87 10.1261/rna.1951310 20587619 PMC2905748 Jia H, Osak M, Bogu GK, Stanton LW, Johnson R, Lipovich L. Genome-wide computational identification and manual annotation of human long noncoding RNA genes. RNA. 2010;16(8):1478–87. 10.1261/rna.1951310. 20587619 10.1261/rna.1951310 PMC2905748 37. Cabili MN Trapnell C Goff L Integrative annotation of human large intergenic noncoding RNAs reveals global properties and specific subclasses Genes Dev 2011 25 18 1915 27 10.1101/gad.17446611 21890647 PMC3185964 Cabili MN, Trapnell C, Goff L, et al. Integrative annotation of human large intergenic noncoding RNAs reveals global properties and specific subclasses. Genes Dev. 2011;25(18):1915–27. 10.1101/gad.17446611. 21890647 10.1101/gad.17446611 PMC3185964 38. Johnsson P Lipovich L Grandér D Morris KV Evolutionary conservation of long non-coding rnas; sequence, structure, function Biochim Biophys Acta 2014 1840 3 1063 71 10.1016/j.bbagen.2013.10.035 24184936 PMC3909678 Johnsson P, Lipovich L, Grandér D, Morris KV. Evolutionary conservation of long non-coding rnas; sequence, structure, function. Biochim Biophys Acta. 2014;1840(3):1063–71. 10.1016/j.bbagen.2013.10.035. 24184936 10.1016/j.bbagen.2013.10.035 PMC3909678 39. Wang KC Chang HY Molecular mechanisms of long noncoding RNAs Mol Cell 2011 43 6 904 14 10.1016/j.molcel.2011.08.018 21925379 PMC3199020 Wang KC, Chang HY. Molecular mechanisms of long noncoding RNAs. Mol Cell. 2011;43(6):904–14. 10.1016/j.molcel.2011.08.018. 21925379 10.1016/j.molcel.2011.08.018 PMC3199020 40. Pontier DB Gribnau J Xist regulation and function explored Hum Genet 2011 130 2 223 36 10.1007/s00439-011-1008-7 21626138 PMC3132428 Pontier DB, Gribnau J. Xist regulation and function explored. Hum Genet. 2011;130(2):223–36. 10.1007/s00439-011-1008-7. 21626138 10.1007/s00439-011-1008-7 PMC3132428 41. Hazari V Samali SA Izadpanahi P Mollaei H Sadri F Rezaei Z Microrna-98: the multifaceted regulator in human cancer progression and therapy Cancer Cell Int 2024 24 1 209 10.1186/s12935-024-03386-2 38872210 PMC11177407 Hazari V, Samali SA, Izadpanahi P, Mollaei H, Sadri F, Rezaei Z. Microrna-98: the multifaceted regulator in human cancer progression and therapy. Cancer Cell Int. 2024;24(1):209. 10.1186/s12935-024-03386-2. 38872210 10.1186/s12935-024-03386-2 PMC11177407 42. Sadri F Hosseini SF Aghayei A Fereidouni M Rezaei Z The tumor suppressor roles and mechanisms of MiR-491 in human cancers DNA Cell Biol 2022 41 9 810 23 10.1089/dna.2022.0274 35914029 Sadri F, Hosseini SF, Aghayei A, Fereidouni M, Rezaei Z. The tumor suppressor roles and mechanisms of MiR-491 in human cancers. DNA Cell Biol. 2022;41(9):810–23. 10.1089/dna.2022.0274. 35914029 10.1089/dna.2022.0274 43. Wang J Liu X Wu H CREB up-regulates long non-coding RNA, HULC expression through interaction with microRNA-372 in liver cancer Nucleic Acids Res 2010 38 16 5366 83 10.1093/nar/gkq285 20423907 PMC2938198 Wang J, Liu X, Wu H, et al. CREB up-regulates long non-coding RNA, HULC expression through interaction with microRNA-372 in liver cancer. Nucleic Acids Res. 2010;38(16):5366–83. 10.1093/nar/gkq285. 20423907 10.1093/nar/gkq285 PMC2938198 44. Sun M Nie F Wang Y LncRNA HOXA11-AS promotes proliferation and invasion of gastric cancer by scaffolding the chromatin modification factors PRC2, LSD1, and DNMT1 Cancer Res 2016 76 21 6299 310 10.1158/0008-5472.CAN-16-0356 27651312 Sun M, Nie F, Wang Y, et al. LncRNA HOXA11-AS promotes proliferation and invasion of gastric cancer by scaffolding the chromatin modification factors PRC2, LSD1, and DNMT1. Cancer Res. 2016;76(21):6299–310. 10.1158/0008-5472.CAN-16-0356. 27651312 10.1158/0008-5472.CAN-16-0356 45. Wang KC Yang YW Liu B A long noncoding RNA maintains active chromatin to coordinate homeotic gene expression Nature 2011 472 7341 120 4 10.1038/nature09819 21423168 PMC3670758 Wang KC, Yang YW, Liu B, et al. A long noncoding RNA maintains active chromatin to coordinate homeotic gene expression. Nature. 2011;472(7341):120–4. 10.1038/nature09819. 21423168 10.1038/nature09819 PMC3670758 46. Espinoza S Bon C Valentini P SINEUPs: a novel toolbox for RNA therapeutics Essays Biochem 2021 65 4 775 89 10.1042/EBC20200114 34623427 PMC8564737 Espinoza S, Bon C, Valentini P, et al. SINEUPs: a novel toolbox for RNA therapeutics. Essays Biochem. 2021;65(4):775–89. 10.1042/EBC20200114. 34623427 10.1042/EBC20200114 PMC8564737 47. Cui Y Fan Y Zhao G Novel lncRNA PSMG3–AS1 functions as a miR–143–3p sponge to increase the proliferation and migration of breast cancer cells Oncol Rep Published online Oct 2019 10.3892/or.2019.7390 PMC6908943 31661146 Cui Y, Fan Y, Zhao G, et al. Novel lncRNA PSMG3–AS1 functions as a miR–143–3p sponge to increase the proliferation and migration of breast cancer cells. Oncol Rep Published online Oct. 2019. 10.3892/or.2019.7390. 48. Man S Li X Zhu W Mir–4417 targets LncRNA PSMG3–AS1 to suppress cell invasion and migration in cervical squamous cell carcinoma Oncol Lett 2021 22 1 502 10.3892/ol.2021.12763 33986863 PMC8114464 Man S, Li X, Zhu W. Mir–4417 targets LncRNA PSMG3–AS1 to suppress cell invasion and migration in cervical squamous cell carcinoma. Oncol Lett. 2021;22(1):502. 10.3892/ol.2021.12763. 33986863 10.3892/ol.2021.12763 PMC8114464 49. Huang S Chen J Gao X LncRNAs PSMG3-AS1 and MEG3 negatively regulate each other to participate in endometrial carcinoma cell proliferation Mamm Genome 2022 33 3 502 7 10.1007/s00335-021-09931-y 34751795 Huang S, Chen J, Gao X, et al. LncRNAs PSMG3-AS1 and MEG3 negatively regulate each other to participate in endometrial carcinoma cell proliferation. Mamm Genome. 2022;33(3):502–7. 10.1007/s00335-021-09931-y. 34751795 10.1007/s00335-021-09931-y 50. Wang Y Hong Z Wei S Ye Z Chen L Qiu C Investigating the role of LncRNA PSMG3-AS1 in gastric cancer: implications for prognosis and therapeutic intervention Cell Cycle 2023 22 19 2161 71 10.1080/15384101.2023.2278942 37946320 PMC10732658 Wang Y, Hong Z, Wei S, Ye Z, Chen L, Qiu C. Investigating the role of LncRNA PSMG3-AS1 in gastric cancer: implications for prognosis and therapeutic intervention. Cell Cycle. 2023;22(19):2161–71. 10.1080/15384101.2023.2278942. 37946320 10.1080/15384101.2023.2278942 PMC10732658 51. Zhou L Huang X Zhang Y Wang J Li H Huang H PSMG3‐AS1 enhances glioma resistance to Temozolomide via stabilizing c‐Myc in the nucleus Brain Behav 2022 10.1002/brb3.2531 35380741 PMC9120888 Zhou L, Huang X, Zhang Y, Wang J, Li H, Huang H. PSMG3‐AS1 enhances glioma resistance to Temozolomide via stabilizing c‐Myc in the nucleus. Brain Behav. 2022. 10.1002/brb3.2531. 35380741 10.1002/brb3.2531 PMC9120888 52. Zhang J Huang J Chen W Hu Z Wang X Mir-143-3p targets LncRNA PSMG3-AS1 to inhibit the proliferation of hepatocellular carcinoma cells Cancer Manag Res 2020 12 6303 9 10.2147/CMAR.S242179 32801875 PMC7394512 Zhang J, Huang J, Chen W, Hu Z, Wang X. Mir-143-3p targets LncRNA PSMG3-AS1 to inhibit the proliferation of hepatocellular carcinoma cells. Cancer Manag Res. 2020;12:6303–9. 10.2147/CMAR.S242179. 32801875 10.2147/CMAR.S242179 PMC7394512 53. Yue N Ye M Zhang R Guo Y Mir-449b-5p targets LncRNA PSMG3-AS1 to suppress cancer cell proliferation in lung adenocarcinoma BMC Pulm Med 2020 20 1 152 10.1186/s12890-020-01189-5 32471413 PMC7260832 Yue N, Ye M, Zhang R, Guo Y. Mir-449b-5p targets LncRNA PSMG3-AS1 to suppress cancer cell proliferation in lung adenocarcinoma. BMC Pulm Med. 2020;20(1):152. 10.1186/s12890-020-01189-5. 32471413 10.1186/s12890-020-01189-5 PMC7260832 54. Shen W Hong X Jin C Xi Y LncRNA PSMG3AS1 promotes proliferation of non-small cell lung cancer cells by sponging miR-613 to upregulate SphK1 Cell Cycle 2021 20 9 829 38 10.1080/15384101.2021.1900499 33849377 PMC8168623 Shen W, Hong X, Jin C, Xi Y. LncRNA PSMG3AS1 promotes proliferation of non-small cell lung cancer cells by sponging miR-613 to upregulate SphK1. Cell Cycle. 2021;20(9):829–38. 10.1080/15384101.2021.1900499. 33849377 10.1080/15384101.2021.1900499 PMC8168623 55. Jin E Huang C Zhang L Expression of oncogenic long noncoding RNA PSMG3–antisense 1 in lung squamous cell carcinoma Oncol Lett 2021 22 5 751 10.3892/ol.2021.13012 34539855 PMC8436406 Jin E, Huang C, Zhang L, et al. Expression of oncogenic long noncoding RNA PSMG3–antisense 1 in lung squamous cell carcinoma. Oncol Lett. 2021;22(5):751. 10.3892/ol.2021.13012. 34539855 10.3892/ol.2021.13012 PMC8436406 56. Ouyang S Xuan F Zhang X Yuan W Fan X Wang J Long non-coding RNA PSMG3 antisense RNA 1 is correlated with oral squamous cell carcinoma and regulates cancer cell proliferation by targeting premature microRNA-141 Am J Cancer Res 2023 13 1 227 35 36777518 PMC9906088 Ouyang S, Xuan F, Zhang X, Yuan W, Fan X, Wang J. Long non-coding RNA PSMG3 antisense RNA 1 is correlated with oral squamous cell carcinoma and regulates cancer cell proliferation by targeting premature microRNA-141. Am J Cancer Res. 2023;13(1):227–35. 36777518 PMC9906088 57. Zhang L Chen Y Wang Z Xia Q LncRNA PSMG3-AS1 is upregulated in prostate carcinoma and downregulates miR-106b through DNA methylation Syst Biol Reprod Med 2023 69 4 264 70 10.1080/19396368.2023.2187269 37023254 Zhang L, Chen Y, Wang Z, Xia Q. LncRNA PSMG3-AS1 is upregulated in prostate carcinoma and downregulates miR-106b through DNA methylation. Syst Biol Reprod Med. 2023;69(4):264–70. 10.1080/19396368.2023.2187269. 37023254 10.1080/19396368.2023.2187269 58. Wilkinson L Gathani T Understanding breast cancer as a global health concern Br J Radiol 2022 95 1130 20211033 10.1259/bjr.20211033 34905391 PMC8822551 Wilkinson L, Gathani T. Understanding breast cancer as a global health concern. Br J Radiol. 2022;95(1130):20211033. 10.1259/bjr.20211033. 34905391 10.1259/bjr.20211033 PMC8822551 59. Arnold M Morgan E Rumgay H Current and future burden of breast cancer: global statistics for 2020 and 2040 Breast 2022 66 15 23 10.1016/j.breast.2022.08.010 36084384 PMC9465273 Arnold M, Morgan E, Rumgay H, et al. Current and future burden of breast cancer: global statistics for 2020 and 2040. Breast. 2022;66:15–23. 10.1016/j.breast.2022.08.010. 36084384 10.1016/j.breast.2022.08.010 PMC9465273 60. Chatterjee K Mukherjee S Vanmanen J Banerjee P Fata JE Dietary polyphenols, resveratrol and pterostilbene exhibit antitumor activity on an HPV E6-positive cervical cancer model: an in vitro and in vivo analysis Front Oncol 2019 9 352 10.3389/fonc.2019.00352 31143704 PMC6521745 Chatterjee K, Mukherjee S, Vanmanen J, Banerjee P, Fata JE. Dietary polyphenols, resveratrol and pterostilbene exhibit antitumor activity on an HPV E6-positive cervical cancer model: an in vitro and in vivo analysis. Front Oncol. 2019;9:352. 10.3389/fonc.2019.00352. 31143704 10.3389/fonc.2019.00352 PMC6521745 61. Alqarni SS Alshehri SM Alkhateeb MA Alsudias LS Assessing Saudi women’s awareness about human papillomavirus (HPV) and their susceptibility to receive the vaccine Hum Vaccin Immunother 2024 20 1 2395086 10.1080/21645515.2024.2395086 39219415 PMC11370954 Alqarni SS, Alshehri SM, Alkhateeb MA, Alsudias LS. Assessing Saudi women’s awareness about human papillomavirus (HPV) and their susceptibility to receive the vaccine. Hum Vaccin Immunother. 2024;20(1):2395086. 10.1080/21645515.2024.2395086. 39219415 10.1080/21645515.2024.2395086 PMC11370954 62. Doll A Abal M Rigau M Novel molecular profiles of endometrial cancer-new light through old windows J Steroid Biochem Mol Biol 2008 108 3–5 221 9 10.1016/j.jsbmb.2007.09.020 18061438 Doll A, Abal M, Rigau M, et al. Novel molecular profiles of endometrial cancer-new light through old windows. J Steroid Biochem Mol Biol. 2008;108(3–5):221–9. 10.1016/j.jsbmb.2007.09.020. 18061438 10.1016/j.jsbmb.2007.09.020 63. Onstad MA Schmandt RE Lu KH Addressing the role of obesity in endometrial cancer risk, prevention, and treatment J Clin Oncol 2016 34 35 4225 30 10.1200/JCO.2016.69.4638 27903150 PMC5455320 Onstad MA, Schmandt RE, Lu KH. Addressing the role of obesity in endometrial cancer risk, prevention, and treatment. J Clin Oncol. 2016;34(35):4225–30. 10.1200/JCO.2016.69.4638. 27903150 10.1200/JCO.2016.69.4638 PMC5455320 64. Wang Y Zeng X Tan J Xu Y Yi C Diabetes mellitus and endometrial carcinoma: risk factors and etiological links Medicine 2022 101 34 e30299 10.1097/MD.0000000000030299 36042597 PMC9410665 Wang Y, Zeng X, Tan J, Xu Y, Yi C. Diabetes mellitus and endometrial carcinoma: risk factors and etiological links. Medicine. 2022;101(34):e30299. 10.1097/MD.0000000000030299. 36042597 10.1097/MD.0000000000030299 PMC9410665 65. Baker-Rand H Kitson SJ Recent advances in endometrial cancer prevention, early diagnosis and treatment Cancers (Basel) 2024 10.3390/cancers16051028 38473385 PMC10931181 Baker-Rand H, Kitson SJ. Recent advances in endometrial cancer prevention, early diagnosis and treatment. Cancers (Basel). 2024. 10.3390/cancers16051028. 38473385 10.3390/cancers16051028 PMC10931181 66. Joshi SS Badgwell BD Current treatment and recent progress in gastric cancer CA Cancer J Clin 2021 71 3 264 79 10.3322/caac.21657 33592120 PMC9927927 Joshi SS, Badgwell BD. Current treatment and recent progress in gastric cancer. CA Cancer J Clin. 2021;71(3):264–79. 10.3322/caac.21657. 33592120 10.3322/caac.21657 PMC9927927 67. Smyth EC Nilsson M Grabsch HI van Grieken NC Lordick F Gastric cancer Lancet (London England) 2020 396 10251 635 48 10.1016/S0140-6736(20)31288-5 32861308 Smyth EC, Nilsson M, Grabsch HI, van Grieken NC, Lordick F. Gastric cancer. Lancet (London England). 2020;396(10251):635–48. 10.1016/S0140-6736(20)31288-5. 32861308 10.1016/S0140-6736(20)31288-5 68. Li GZ Doherty GM Wang J Surgical management of gastric cancer: a review JAMA Surg 2022 157 5 446 54 10.1001/jamasurg.2022.0182 35319717 Li GZ, Doherty GM, Wang J. Surgical management of gastric cancer: a review. JAMA Surg. 2022;157(5):446–54. 10.1001/jamasurg.2022.0182. 35319717 10.1001/jamasurg.2022.0182 69. Mamun TI Younus S Rahman MH Gastric cancer—epidemiology, modifiable and non-modifiable risk factors, challenges and opportunities: an updated review Cancer Treat Res Commun 2024 41 100845 10.1016/j.ctarc.2024.100845 39357127 Mamun TI, Younus S, Rahman MH. Gastric cancer—epidemiology, modifiable and non-modifiable risk factors, challenges and opportunities: an updated review. Cancer Treat Res Commun. 2024;41:100845. 10.1016/j.ctarc.2024.100845. 39357127 10.1016/j.ctarc.2024.100845 70. Li S Wang C Chen J Signaling pathways in brain tumors and therapeutic interventions Signal Transduct Target Ther 2023 8 1 8 10.1038/s41392-022-01260-z 36596785 PMC9810702 Li S, Wang C, Chen J, et al. Signaling pathways in brain tumors and therapeutic interventions. Signal Transduct Target Ther. 2023;8(1):8. 10.1038/s41392-022-01260-z. 36596785 10.1038/s41392-022-01260-z PMC9810702 71. Hanif F Muzaffar K Perveen K Malhi SM Simjee SU Glioblastoma multiforme: a review of its epidemiology and pathogenesis through clinical presentation and treatment Asian Pac J Cancer Prev 2017 18 1 3 9 10.22034/APJCP.2017.18.1.3 28239999 PMC5563115 Hanif F, Muzaffar K, Perveen K, Malhi SM, Simjee SU. Glioblastoma multiforme: a review of its epidemiology and pathogenesis through clinical presentation and treatment. Asian Pac J Cancer Prev. 2017;18(1):3–9. 10.22034/APJCP.2017.18.1.3. 28239999 10.22034/APJCP.2017.18.1.3 PMC5563115 72. Gregucci F Surgo A Bonaparte I Poor-prognosis patients affected by glioblastoma: retrospective study of hypofractionated radiotherapy with simultaneous integrated boost and concurrent/adjuvant temozolomide J Pers Med 2021 10.3390/jpm11111145 34834497 PMC8619413 Gregucci F, Surgo A, Bonaparte I, et al. Poor-prognosis patients affected by glioblastoma: retrospective study of hypofractionated radiotherapy with simultaneous integrated boost and concurrent/adjuvant temozolomide. J Pers Med. 2021. 10.3390/jpm11111145. 34834497 10.3390/jpm11111145 PMC8619413 73. Chen L Wang G Xu Z Overexpression of LncRNA PSMG3-AS1 distinguishes glioblastomas from sarcoidosis J Mol Neurosci 2020 70 12 2015 9 10.1007/s12031-020-01605-9 32529538 Chen L, Wang G, Xu Z, et al. Overexpression of LncRNA PSMG3-AS1 distinguishes glioblastomas from sarcoidosis. J Mol Neurosci. 2020;70(12):2015–9. 10.1007/s12031-020-01605-9. 32529538 10.1007/s12031-020-01605-9 74. Samant H Amiri HS Zibari GB Addressing the worldwide hepatocellular carcinoma: epidemiology, prevention and management J Gastrointest Oncol 2021 12 Suppl 2 S361 73 10.21037/jgo.2020.02.08 34422400 PMC8343080 Samant H, Amiri HS, Zibari GB. Addressing the worldwide hepatocellular carcinoma: epidemiology, prevention and management. J Gastrointest Oncol. 2021;12(Suppl 2):S361–73. 10.21037/jgo.2020.02.08. 34422400 10.21037/jgo.2020.02.08 PMC8343080 75. Abdelhamed W El-Kassas M Hepatocellular carcinoma recurrence: predictors and management Liver Res 2023 7 4 321 32 10.1016/j.livres.2023.11.004 39958776 PMC11791921 Abdelhamed W, El-Kassas M. Hepatocellular carcinoma recurrence: predictors and management. Liver Res. 2023;7(4):321–32. 10.1016/j.livres.2023.11.004. 39958776 10.1016/j.livres.2023.11.004 PMC11791921 76. Bordoni A Cerny A Bihl F Survival of hepatocellular carcinoma patients is significantly improving: a population-based study from Southern Switzerland Cancer Epidemiol 2014 38 6 679 85 10.1016/j.canep.2014.09.008 25454980 Bordoni A, Cerny A, Bihl F, et al. Survival of hepatocellular carcinoma patients is significantly improving: a population-based study from Southern Switzerland. Cancer Epidemiol. 2014;38(6):679–85. 10.1016/j.canep.2014.09.008. 25454980 10.1016/j.canep.2014.09.008 77. Sarveazad A Agah S Babahajian A Amini N Bahardoust M Predictors of 5 year survival rate in hepatocellular carcinoma patients J Res Med Sci 2019 24 86 10.4103/jrms.JRMS_1017_18 31741658 PMC6856560 Sarveazad A, Agah S, Babahajian A, Amini N, Bahardoust M. Predictors of 5 year survival rate in hepatocellular carcinoma patients. J Res Med Sci. 2019;24:86. 10.4103/jrms.JRMS_1017_18. 31741658 10.4103/jrms.JRMS_1017_18 PMC6856560 78. Li X Ramadori P Pfister D Seehawer M Zender L Heikenwalder M The immunological and metabolic landscape in primary and metastatic liver cancer Nat Rev Cancer 2021 21 9 541 57 10.1038/s41568-021-00383-9 34326518 Li X, Ramadori P, Pfister D, Seehawer M, Zender L, Heikenwalder M. The immunological and metabolic landscape in primary and metastatic liver cancer. Nat Rev Cancer. 2021;21(9):541–57. 10.1038/s41568-021-00383-9. 34326518 10.1038/s41568-021-00383-9 79. Zareifar P Ahmed HM Ghaderi P MiR-142-3p/5p role in cancer: from epigenetic regulation to immunomodulation Cell Biochem Funct 2024 42 2 e3931 10.1002/cbf.3931 38379239 Zareifar P, Ahmed HM, Ghaderi P, et al. MiR-142-3p/5p role in cancer: from epigenetic regulation to immunomodulation. Cell Biochem Funct. 2024;42(2):e3931. 10.1002/cbf.3931. 38379239 10.1002/cbf.3931 80. Herbst RS Morgensztern D Boshoff C The biology and management of non-small cell lung cancer Nature 2018 553 7689 446 54 10.1038/nature25183 29364287 Herbst RS, Morgensztern D, Boshoff C. The biology and management of non-small cell lung cancer. Nature. 2018;553(7689):446–54. 10.1038/nature25183. 29364287 10.1038/nature25183 81. Heist RS Sequist LV Engelman JA Genetic changes in squamous cell lung cancer: a review J Thorac Oncol 2012 7 5 924 33 10.1097/JTO.0b013e31824cc334 22722794 PMC3404741 Heist RS, Sequist LV, Engelman JA. Genetic changes in squamous cell lung cancer: a review. J Thorac Oncol. 2012;7(5):924–33. 10.1097/JTO.0b013e31824cc334. 22722794 10.1097/JTO.0b013e31824cc334 PMC3404741 82. Niu Z Jin R Zhang Y Li H Signaling pathways and targeted therapies in lung squamous cell carcinoma: mechanisms and clinical trials Signal Transduct Target Ther 2022 7 1 353 10.1038/s41392-022-01200-x 36198685 PMC9535022 Niu Z, Jin R, Zhang Y, Li H. Signaling pathways and targeted therapies in lung squamous cell carcinoma: mechanisms and clinical trials. Signal Transduct Target Ther. 2022;7(1):353. 10.1038/s41392-022-01200-x. 36198685 10.1038/s41392-022-01200-x PMC9535022 83. Rostami Ravari N Sadri F Mahdiabadi MA Mohammadi Y Ourang Z Rezaei Z Ferroptosis and noncoding rnas: exploring mechanisms in lung cancer treatment Front Cell Dev Biol 2025 10.3389/fcell.2025.1522873 40078365 PMC11897296 Rostami Ravari N, Sadri F, Mahdiabadi MA, Mohammadi Y, Ourang Z, Rezaei Z. Ferroptosis and noncoding rnas: exploring mechanisms in lung cancer treatment. Front Cell Dev Biol. 2025. 10.3389/fcell.2025.1522873. 40078365 10.3389/fcell.2025.1522873 PMC11897296 84. Tranby EP Heaton LJ Tomar SL Oral cancer prevalence, mortality, and costs in medicaid and commercial insurance claims data Cancer Epidemiol Biomarkers Prev 2022 31 9 1849 57 10.1158/1055-9965.EPI-22-0114 35732291 PMC9437560 Tranby EP, Heaton LJ, Tomar SL, et al. Oral cancer prevalence, mortality, and costs in medicaid and commercial insurance claims data. Cancer Epidemiol Biomarkers Prev. 2022;31(9):1849–57. 10.1158/1055-9965.EPI-22-0114. 35732291 10.1158/1055-9965.EPI-22-0114 PMC9437560 85. Di Spirito F Amato A Romano A Analysis of risk factors of oral cancer and periodontitis from a sex- and gender-related perspective: gender dentistry Appl Sci 2022 12 18 9135 10.3390/app12189135 Di Spirito F, Amato A, Romano A, et al. Analysis of risk factors of oral cancer and periodontitis from a sex- and gender-related perspective: gender dentistry. Appl Sci. 2022;12(18):9135. 10.3390/app12189135. 86. Gönül M Gül U Kaya I Smoking, alcohol consumption and denture use in patients with oral mucosal lesions J Dermatol Case Rep 2011 5 4 64 8 10.3315/jdcr.2011.1079 22408705 PMC3241948 Gönül M, Gül U, Kaya I, et al. Smoking, alcohol consumption and denture use in patients with oral mucosal lesions. J Dermatol Case Rep. 2011;5(4):64–8. 10.3315/jdcr.2011.1079. 22408705 10.3315/jdcr.2011.1079 PMC3241948 87. Mello FW Melo G Pasetto JJ Silva CAB Warnakulasuriya S Rivero ERC The synergistic effect of tobacco and alcohol consumption on oral squamous cell carcinoma: a systematic review and meta-analysis Clin Oral Investig 2019 23 7 2849 59 10.1007/s00784-019-02958-1 31111280 Mello FW, Melo G, Pasetto JJ, Silva CAB, Warnakulasuriya S, Rivero ERC. The synergistic effect of tobacco and alcohol consumption on oral squamous cell carcinoma: a systematic review and meta-analysis. Clin Oral Investig. 2019;23(7):2849–59. 10.1007/s00784-019-02958-1. 31111280 10.1007/s00784-019-02958-1 88. Rehman SU Ullah N Zhang Z Recent insights into the functions and mechanisms of antisense RNA: emerging applications in cancer therapy and precision medicine Front Chem 2024 10.3389/fchem.2023.1335330 38274897 PMC10809404 Rehman SU, Ullah N, Zhang Z, et al. Recent insights into the functions and mechanisms of antisense RNA: emerging applications in cancer therapy and precision medicine. Front Chem. 2024. 10.3389/fchem.2023.1335330. 38274897 10.3389/fchem.2023.1335330 PMC10809404 89. Morovat S Morovat P Kalantary-Charvadeh A Mojbafan M Teimourian S LINC01410 in cancer: a comprehensive review of its oncogenic role, regulatory mechanisms, and clinical implications Med Oncol 2025 42 8 325 10.1007/s12032-025-02889-w 40650849 Morovat S, Morovat P, Kalantary-Charvadeh A, Mojbafan M, Teimourian S. LINC01410 in cancer: a comprehensive review of its oncogenic role, regulatory mechanisms, and clinical implications. Med Oncol. 2025;42(8):325. 10.1007/s12032-025-02889-w. 40650849 10.1007/s12032-025-02889-w 90. Camilleri-Robles C Amador R Klein CC Guigó R Corominas M Ruiz-Romero M Genomic and functional conservation of lncrnas: lessons from flies Mamm Genome 2022 33 2 328 42 10.1007/s00335-021-09939-4 35098341 PMC9114055 Camilleri-Robles C, Amador R, Klein CC, Guigó R, Corominas M, Ruiz-Romero M. Genomic and functional conservation of lncrnas: lessons from flies. Mamm Genome. 2022;33(2):328–42. 10.1007/s00335-021-09939-4. 35098341 10.1007/s00335-021-09939-4 PMC9114055 91. Zhang X Hamblin MH Yin KJ The long noncoding RNA Malat1: its physiological and pathophysiological functions RNA Biol 2017 14 12 1705 14 10.1080/15476286.2017.1358347 28837398 PMC5731810 Zhang X, Hamblin MH, Yin KJ. The long noncoding RNA Malat1: its physiological and pathophysiological functions. RNA Biol. 2017;14(12):1705–14. 10.1080/15476286.2017.1358347. 28837398 10.1080/15476286.2017.1358347 PMC5731810 92. Ma XY Wang JH Wang JL Ma CX Wang XC Liu FS Malat1 as an evolutionarily conserved lncrna, plays a positive role in regulating proliferation and maintaining undifferentiated status of early-stage hematopoietic cells BMC Genomics 2015 16 1 676 10.1186/s12864-015-1881-x 26335021 PMC4559210 Ma XY, Wang JH, Wang JL, Ma CX, Wang XC, Liu FS. Malat1 as an evolutionarily conserved lncrna, plays a positive role in regulating proliferation and maintaining undifferentiated status of early-stage hematopoietic cells. BMC Genomics. 2015;16(1):676. 10.1186/s12864-015-1881-x. 26335021 10.1186/s12864-015-1881-x PMC4559210 93. Evans P Nagai T Konkashbaev A Zhou D Knapik EW Gamazon ER Transcriptome-wide association studies (TWAS): methodologies, applications, and challenges Curr Protoc 2024 10.1002/cpz1.981 38314955 PMC10846672 Evans P, Nagai T, Konkashbaev A, Zhou D, Knapik EW, Gamazon ER. Transcriptome-wide association studies (TWAS): methodologies, applications, and challenges. Curr Protoc. 2024. 10.1002/cpz1.981. 38314955 10.1002/cpz1.981 PMC10846672 ",
  "metadata": {
    "Title of this paper": "Transcriptome-wide association studies (TWAS): methodologies, applications, and challenges",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480346/"
  }
}