{
  "title": "Paper_1223",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472294 PMC12472294.1 12472294 12472294 41011169 10.3390/ph18091298 pharmaceuticals-18-01298 1 Review Ketamine’s Role in Neuroinflammation and Neuroprotection Across Neurological and Psychiatric Disorders: A Narrative Review https://orcid.org/0000-0003-0943-3120 Silva Gustavo N. 1 * Brandão Virna G. A. 1 https://orcid.org/0000-0001-6727-803X Blum Kenneth 2 https://orcid.org/0000-0001-7842-2914 Lewandrowski Kai-Uwe 3 4 https://orcid.org/0000-0001-5236-0903 Fiorelli Rossano K. A. 5 Chiappini Stefania Academic Editor 1 2 3 4 5 * gustavo.silva@unirio.br 29 8 2025 9 2025 18 9 497460 1298 07 7 2025 16 8 2025 25 8 2025 29 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Ketamine, a widely used anesthetic with emerging evidence suggesting neuroprotective and anti-inflammatory properties across various neurological disorders, is recognized for its NMDA receptor antagonism. It has been postulated to play a role in neuroprotection, due to its anti-inflammatory properties, and decrease microglial activation, as well as cytokines TNF and IL-6. Despite its established role, the extent of ketamine’s effects on neuroinflammation and neuroprotection remains to be fully elucidated. Here, we conducted a narrative review synthesizing current knowledge on ketamine’s operating mechanisms, including its modulation of synaptic plasticity, excitotoxicity, and cytokine release, alongside its therapeutic applications in traumatic brain injury, neurodegenerative diseases, psychiatric disorders, and pain management. For this narrative review, we searched the Medline, Embase, Scopus, Web of Science, and PubMed databases. Our findings indicate that ketamine reduces excitotoxicity and inflammation, which may contribute to neuroprotection in acute neurological injuries. These insights underscore ketamine’s potential as an adjunctive neuroprotective agent, warranting further clinical investigation to optimize its therapeutic utility across neurological and psychiatric contexts. neuroprotection neuroinflammation NMDA receptors brain injury ketamine This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The first human study involving ketamine, a derivative of phencyclidine, was carried out in the 1960s. The compound induced significant analgesia associated with a distinct state of altered consciousness (“dissociation”) [ 1 2 3 Although research into the effects of ketamine on functional outcomes and mortality in patients with severe brain injuries is quite limited, it can inhibit cortical depolarization, an electrophysiological event that can trigger secondary brain damage after a primary brain injury [ 4 5 NMDARs are members of the glutamate receptor family, ligand-gated channels that coexist with other glutamate systems, and they represent a highly complex neurotransmitter system. It is distributed at different levels of the CNS (pre-, post- and extrasynaptic and different brain regions), and the biochemical organization of its receptors into four subunits adds to the complexity of the system. These receptors are divided into two distinct groups: metabotropic receptors (mGluRs) and ionotropic receptors (iGluRs) [ 6 7 Ketamine works by antagonizing NMDARs. This results in the release of glutamate, activating other receptors that increase synaptogenesis and improve signaling via neurotrophic factors in brain regions. It also restores dopamine transmission, which helps to reduce symptoms such as anhedonia (loss of pleasure), although it can cause psychotic effects due to the release of dopamine in certain areas of the brain. NMDARs act as amplifiers and modulators of excitatory signals in the dorsal horn of the spinal cord and in certain specialized peripheral circuits. They interact with μ-opioid receptors (MORs), with such interaction reducing glutamate release. Chronic activation of NMDARs contributes to opioid-induced tolerance and hyperalgesia. In the mesolimbic (reward) pathway, NMDARs modulate synaptic plasticity in the ventral tegmental area (VTA) and nucleus accumbens. These regions are critical for reinforcing effects of opioids and influence addiction and withdrawal circuits. Additionally, modulation of GABAergic interneurons in VTA can lead to disinhibition of dopaminergic neurons [ 8 In an intensive setting, a study of children with severe traumatic brain injury found that, following a protocol based on guidelines, ketamine was associated with a reduction in intracranial pressure under sedation and an increase in cerebral perfusion pressure above the threshold [ 9 10 Significant gaps exist in the understanding of neuroinflammation and the effect of ketamine on post-trauma secondary brain processes resulting from glutamate excitotoxicity. Our study, therefore, addresses the primary mechanisms involved in neuroprotection and provides some therapeutic evidence in the context of neurological and psychiatric disorders. 2. Methods This study is a narrative review about the use of ketamine in various clinical contexts, including traumatic brain injuries, subarachnoid hemorrhage, acute and chronic pain, depression, drug detoxification, seizures, and anesthetic requirements. Our study reviews the potential mechanisms underlying the neuroprotective effects of ketamine. To this end, the authors searched and selected papers from three widely used health databases: PubMed, MEDLINE, and EMBASE. The search was conducted from October 2024 to June 2025 based on specific health sciences descriptors (DeCSs)—“Brain injury” AND “Intracranial pressure” AND “ketamine” AND “Neuroprotection” AND “Neuroinflammation”—in various combinations. At a certain point, the descriptors were crossed with each other, and some filters were added as inclusion criteria: studies from 2010 to 2024, free full texts, clinical trials, systematic reviews, and observational studies. Case reports and letters were not assessed. Subsequently, 424 articles were selected for abstract reading, of which 32 matched the research criteria. Additionally, 37 supplementary articles were included in the study through a manual search. For didactic purposes, this article is divided into sections, firstly providing an overview of NMDARs, before discussing the protective effects of ketamine on neurodegenerative diseases, its role in neuroprotection in some clinical situations, ketamine in addiction and psychiatric disorders, and ketamine’s therapeutic effects as an adjuvant drug in neuroanesthesia. 3. Results 3.1. An Overview of NMDRAs Ketamine exists as S(+) and R(−) isomers and is commonly marketed as a racemic mixture ( Figure 1 6 In mammals, NMDARs exist as several subtypes that differ in their molecular, anatomical, and signaling properties. They are considered the primary pathway through which ketamine acts, though they are not the only pathway. When activated, the glutamate-activated ion channel allows Ca 2+ + + 11 Excitatory neurotransmission and cell signaling mediated by NMDARs are essential for brain development. The transmission of glutamate and the activation of its ionotropic receptors are fundamental mechanisms by which neurons control their synaptic functions modulation and information processing. The N-methyl-D-aspartate receptor is unique among all ligand-dependent channels, requiring two ligands—glutamate and glycine—for activation. These receptors function as heterotetrameric ion channels, with channel opening dependent on the binding of glycine and glutamate to the extracellular ligand-binding domains of the GluN1 and GluN2 subunits, respectively. The opening of NMDAR channels and the subsequent relief of Mg 2+ 12 Furthermore, their activity is associated with the modulation of the cell cycle. Overactivation of NMDA receptors, for example, has been demonstrated to cause excessive calcium influx, leading to the expression of key elements that regulate and potentially disrupt the cell cycle [ 13 14 3.2. Protective Effects on Neurodegenerative Diseases Animal studies have shown promising methods with the use of ketamine, alone or in combination, to increase memory consolidation and cell proliferation, thus improving cognitive functions [ 15 16 For example, a study using human GABAergic projection neurons derived from human inducible pluripotent stem cells and embryonic stem cells in vitro tested the effects of ketamine on growth cones and synapses in developing GABAergic neurons, evaluating the glycogen synthase kinase-3 (GSK-3) and histone deacetylase 6 (HDAC6) pathways. Exposure to ketamine impaired growth cone formation, synaptogenesis, dendritic development, and maturation through mediated activation of GABAergic neurons. The identification of this neurotoxic pathway suggests that microtubule acetation could serve as a potential target for mitigating the toxic effects of ketamine on neuronal development of striatal GABAergic projections in both mature and early developing neurons [ 17 3.2.1. Parkinson’s Disease Parkinson’s disease involves the gradual degeneration of dopaminergic neurons within the substantia nigra, leading to a reduction in dopamine release in the striatum that results in movement disorders such as tremors, rigidity, and bradykinesia, as well as cognitive impairments such as dementia. Additionally, it manifests as mental symptoms like depression and anxiety, along with disruptions in sleep patterns and bowel functions [ 18 19 In LID, the role of opioids in ketamine’s action appears to be “modulatory”. Blocking opioid receptors with naloxone did not abolish ketamine’s acute antidyskinetic effect; rather, it enhanced its antiparkinsonian effect, improving akinesia. Therefore, the opioid pathway, mediated by NMDA, acts as a modulator, and opioid antagonism may help with certain motor aspects, at least in preclinical models. However, controlled clinical trials in PD/LID are still needed to determine the precise role of opioid receptors in this context. This demonstrates the involvement of the opioid system of Parkinson’s disease treatment and levodopa-induced dyskinesia [ 19 Ketamine reversed short-term memory impairment and depressive behaviors in rats with bilateral lesions in substantia nigra compacta, indicating a promising profile for its use in patients with PD [ 20 21 3.2.2. Alzheimer’s Disease Advances in public health have resulted in an aging population, creating an environment conducive to an increase in Alzheimer’s disease (AD) prevalence. Positron emission tomography markers to identify patterns of neuritic plaque deposition (amyloid) and neurofibrillary tangle formation, together with histochemical observations of neuroinflammation, neuronal synapses loss, and brain atrophy, have proved important in understanding the pathological events that define AD [ 22 The p38MAPK signaling pathway plays an important role in regulating memory and learning processes, and studies have shown that high levels of phosphorylated p38 MAPK expression in peripheral blood are associated with AD and PD [ 23 24 25 Ketamine has proven successful in treating psychiatric symptoms, particularly treatment-resistant depression. Recent clinical studies suggest that ketamine may have potential for providing neuroprotection and reducing psychiatric symptoms, especially depression, apathy, agitation, and mild psychosis, in patients with Alzheimer’s disease (AD). This conclusion is supported by both neurobiological mechanisms and specific clinical observations. AD is characterized by glutamatergic dysfunction, which involves excessive activation of NMDA receptors by extracellular glutamate. This leads to excitotoxicity and synaptic dysfunction. Ketamine reduces excessive calcium influx into neurons, thereby protecting against damage and stabilizing transmission. By activating AMPA pathways, ketamine increases the release of BDNF (brain-derived neurotrophic factor), which stimulates plasticity. It signals the mTOR pathway, which stimulates synaptic protein synthesis, the formation of new dendritic spines, and the restoration of corticolimbic circuits. Additionally, ketamine can inhibit microglial activation and reduce pro-inflammatory cytokines (IL-6 and TNF-α), which may reduce neurotoxicity and improve neuropsychiatric symptoms. These effects help restore networks involved in mood, motivation, and emotional response, all of which are impaired in AD [ 26 A study in mice provides new insights into the antidepressant mechanism of ketamine, revealing that astrocyte pyroptosis in the hippocampus is reversed by improving the glymphatic pathway—a potential therapeutic target for depression [ 27 3.2.3. Multiple Sclerosis Multiple sclerosis (MS), an autoimmune and degenerative disease that affects the central nervous system, shows long-term reductions in fatigue-related symptoms after low-dose ketamine infusions [ 28 29 Research indicates a correlation between demyelination and microglial activation in the corpus callosum of mice treated with cuprizone, a compound used to induce ME-like demyelination. Ketamine was found to enhance demyelination and microglial activation through the TrKB stimulation, a tyrosine protein kinase receptor that acts as a brain-derived neurotrophic factor and other neurotrophic receptors. Additionally, ketamine partially restored the diversity of intestinal microbiota in these mice and facilitated a reduction in lactic acid levels in their stool [ 30 Ketamine has demonstrated its ability to mitigate progression of experimental autoimmune encephalomyelitis in mice, a widely utilized model for multiple sclerosis. It alleviated body weight loss, enhanced clinical scores, and significantly decreased pathological scores, promoting microglial activation and preserving blood–brain barrier integrity in the spinal cord [ 31 There are no robust clinical trials testing the use of ketamine for motor symptoms or MS progression. However, it may be beneficial for treating refractory neuropathic pain. Some small studies have shown that subanesthetic infusion of ketamine significantly reduces pain, which is a typical effect in central control. In cases of treatment-resistant depression, there are isolated reports of rapid improvement in mood and fatigue, similar to those observed in patients with other diseases. No human studies have demonstrated an impact on disease progression, reduction in outbreaks, or preservation of myelin [ 28 29 3.3. Role in Acute Neuroinflammatory Disorders Ketamine’s safety profile and fleeting action make it a reliable tool in pre-hospital environments. It maintains a hemodynamic profile by preventing hypotension, reducing fluid use, and preserving spontaneous ventilation, all while also offering the potential to optimize analgesia and sedation in the management of ventilated patients with traumatic brain injury [ 31 2+ 32 A protective effect of ketamine may occur after traumatic brain injury (TBI), probably due to the suppression of the onset of widespread depolarization. This is an abnormal propagation of electrical activity that can be detected by electroencephalography (EEG) or internal measurement with suitable electrodes. It is associated with poor outcomes in patients with TBI after brain damage. No differences in ICP were detected between patients who received ketamine and the control group. None of the patients showed pathological ICP. Ketamine was found to prevent cough reflexes and show reduced ICP values in the short term and increased values in the long term without evidence of threat. In the pediatric population, a decrease in ICP median of 7.8 mmHg was observed two minutes after a ketamine bolus. Additionally, ketamine increases cerebral perfusion pressure and consequently decreases the dosage of vasopressors needed to counteract the effects of opioid-based sedatives. Due to its neuromodulatory properties, ketamine may be a safe drug to use alone or in combination with other sedatives in patients with moderate to severe spinal cord injury (SCI) who require mechanical ventilation [ 9 33 34 Early administration has demonstrated effectiveness with a response rate in refractory status epilepticus patients who are unresponsive to anticonvulsants for whom mechanical ventilation is contraindicated due to comorbid conditions [ 35 36 37 Ketamine could be considered a potential option for symptomatic and restorative therapies in neuromyelitis optica spectrum disorders, particularly in cases involving spinal cord lesions in cervical and thoracic segments, including around the central canal and adjacent gray matter in the dorsal and ventral horns. In early active lesions, with reducing neuroinflammation emphasis, ketamine may offer relief by blocking NMDA receptors to inhibit long-term potentiation in C-fiber synapses responsible for neuropathic pain [ 38 39 Coronavirus disease 2019 (COVID-19), responsible for severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), has been associated with neurological and neuropsychiatric complications, including anxiety, depression, mood disorders, and psychosis. The hypothesis is that these symptoms result from an excessive systemic inflammatory response, which manifests itself as viral sepsis, immune-mediated mechanisms, or direct damage to the cerebral vasculature induced by the virus. Immune dysregulation, such as defective antigen presentation caused by interleukin 6 (IL-6) or an IL-1β-mediated hemophagocytosis-like syndrome, may play a role in depression. Dopaminergic or glutamatergic drugs, such as ketamine, can help prevent serious alterations in neurotransmitter metabolism. Ketamine has been shown to downregulate several inflammatory cytokines, including IL-6, while changes in cytokine levels correlate significantly with symptom improvement [ 40 3.4. Neuromodulation in Psychiatric Disorders The literature highlights the antidepressant and antisuicidal effects of ketamine in unipolar/bipolar depression, as well as in treatment-resistant depression, with repeated doses extending the duration of efficacy. In several studies, ketamine possesses short-term antisuicidal properties, independent of its impact on depressive symptoms [ 41 42 Brain-derived neurotrophic factor (BDNF) and its receptor, tropomyosin receptor kinase B (Trk), are believed to be essential for sustained remodeling of the affect circuit. Polymorphisms in the genes encoding TrkB and NMDAR are known to modulate these therapeutic results [ 43 44 S- and R-ketamine have differential effects on inflammation-induced depression using a lipopolysaccharide (LPS)-induced mouse model. This condition is associated with neuroinflammation, as evidenced by elevated levels of pro-inflammatory markers such as TNF-α and IL-1β. S-ketamine significantly alleviated depressive behaviors and reduced pro-inflammatory factor levels in the medial prefrontal cortex by suppressing pro-inflammatory gene expression [ 45 In addition to reducing suicidal ideation, it may be a potential therapeutic option for patients with treatment-resistant anxiety pathologies, particularly obsessive–compulsive disorder and post-traumatic stress. Patients with eating disorders may experience remission of severe anorexia nervosa. When used alone or in conjunction with other therapies, it has been shown to be effective in reducing alcohol and substance use, decreasing cravings and increasing motivation, especially when combined with motivational enhancement treatment [ 46 Participants who received selective serotonin reuptake inhibitors were more likely to respond to ketamine treatment. Case reports, non-randomized studies, and randomized studies have all consistently reported immediate improvements in symptoms within 24 h. However, long-term improvements, which were sometimes sustained for two to eight weeks, were more consistently reported in case reports and non-randomized studies than in randomized studies [ 47 Unlike cocaine, the long-term effects of ketamine on mesolimbic reward circuits and behavior do not indicate the induction of drug-adaptive synaptic plasticity, long-term locomotor sensitization, or uncontrolled self-administration. Ketamine has rewarding and reinforcing properties because it indirectly acts on the dopamine system through the effects of local GABA neurons on circuits. The absence of adaptive synaptic plasticity indicates that ketamine dependence is limited by its pharmacology [ 48 Concerns persist about the addictive potential of ketamine for long-term depression treatment. Despite the heterogeneity of study designs and methods of assessing results, this study emphasizes the relative safety of ketamine treatment for adult patients. It also highlights the importance of physician-supervised administration, vigilant monitoring, and careful dosing [ 49 Table 1 Patients with refractory chronic pain who were treated with (R,S)-ketamine showed no differences in pain, anxiety, or ketamine dosage according to gender or age. The baseline inflammatory state may be more pronounced in men with neuropathic pain than in women with fibromyalgia. Ketamine exerts a strong immediate anti-inflammatory effect with the first dose; however, there is little remaining inflammation and less pain relief with subsequent administrations. In elderly patients and men aged ≥50 years, who have an even greater inflammatory state and higher IL-6 concentrations, ketamine prevents a drop in analgesia with just one administration [ 50 Despite its association with transient and dose-dependent psychotomimetic and cardiovascular side effects, it is used to treat neuropathic, acute, and chronic postoperative pain. It interacts with α-amino-3-hydroxy-5-methyl-4-isoxazolepropionic acid (AMPA) receptors, as well as opioid, cholinergic, catecholaminergic, and hyperpolarization-activated cyclic nucleotide-gated (HCN) receptors. Due to its downstream signaling mechanisms, it is an option for individuals with depression and concomitant acute or chronic pain. Mood disorders and pain often occur together, share neurobiological mechanisms, and are difficult to treat [ 51 3.5. Therapeutic Effects as an Adjuvant Drug in Neuroanesthesia Therapeutic interventions can significantly reduce inflammation in response to infection, surgery, or trauma, thereby improving patient outcomes and reducing health-related costs [ 52 Figure 2 53 54 55 56 The sympathomimetic profile of ketamine, together with its neuroprotective effect, may be advantageous over other sedative and analgesic drugs used in patients with traumatic brain injury who are at risk of experiencing a reduction in blood pressure, which could exacerbate secondary neurological injury. A study of adult patients with severe traumatic brain injury randomized to receive an infusion of either ketamine at 3 mg/kg/h or normal saline showed that, during the first four to six hours, patients in the ketamine group had significantly higher blood pressure and CPP levels than those in the control group. However, this effect was not sustained beyond six hours, and a significant reduction in ICP was observed only briefly, between the fourth and sixth hours. The control group required more vasopressors; however, there was no difference in neurological outcome at three months [ 57 58 59 60 Sedatives are often used to control intracranial pressure, reduce cerebral metabolism, enable other treatments such as mechanical ventilation or targeted temperature control, and control sympathetic hyperactivity. However, the U.S. Food and Drug Administration (FDA) has issued a precaution regarding the use of ketamine in patients with elevated intracranial pressure (ICP) prior to anesthesia, which discourages its use in patients with traumatic brain injury (TBI). Additionally, no randomized clinical trial (RCT) has shown that ketamine is completely safe for these patients. The Brain Injury and Ketamine (BIKe) study is investigating the safety of using ketamine as an adjunct to a standard sedation regimen in patients with TBI [ 61 Cerebral autoregulation involves adjustments in vascular tone sensitive to variations in systemic blood pressure. These changes are thought to be regulated myogenically or endothelium-dependently in response to stress in the vasculature; neurogenically, by the autonomic nervous system and neurons; and, to some extent, metabolically. Most anesthetic agents reduce the brain’s overall global oxygen metabolism, while volatile anesthetics, nitrous oxide, and ketamine increase cerebral blood flow. However, other intravenous agents, such as propofol and midazolam, reduce it. These changes in physiological parameters affect various endogenous mechanisms, including cerebral autoregulation, vasomotor reactivity, and neurovascular coupling [ 62 p 63 Cortical spreading depolarization (CSD) can cause neurological deterioration after evacuation of the subdural hematoma. A report of three isolated cases in which patients were treated with ketamine empirically indicated that it can reverse neurological deficits not explained by neuroimaging or electroencephalography, such as seizures [ 64 65 66 67 Insufficient analgesia can result in complications, including immobilization, pneumonia, and delayed rehabilitation. Multimodal, opioid-sparing regimens are preferred. A cohort study comparing adult cardiac surgery patients who received a single 0.3 mg/kg dose of ketamine over 30 min with those who did not receive ketamine demonstrated a significant decrease in oral opioid administration (oxycodone). When intravenous opioids were included in the analysis, the results showed a reduction in its use. This may be due to attenuation of the opioid-induced hyperalgesic response by N-methyl-D-aspartate (NMDA) blockade ( Figure 3 68 69 Table 2 4. Conclusions Ketamine is considered a promising drug with many potential clinical applications. It has a variety of pharmacological effects, ranging from anesthetic induction and maintenance to analgesic and sedative properties, depending on the dosage. Due to its neuroprotective and anti-inflammatory effects, as well as its favorable hemodynamic profile, ketamine is the drug of choice in cases involving opioid tolerance, inflammatory pain, neuropathic pain, depression, or a combination of these factors. However, original studies focused on humans and cancer therapy are still in their infancy. Most current studies use racemic ketamine, but the effect of R-ketamine on racemic ketamine remains unclear. Ketamine reduces excitotoxicity and inflammation, which may contribute to neuroprotection in acute neurological injuries. Despite showing promise in acute situations, tolerance issues limit its long-term use for chronic pain. Its anti-inflammatory effects are attributed to its action on ionotropic glutamate receptors, which play a role in synaptic plasticity, long-term potentiation, and depression. Disclaimer/Publisher’s Note: Author Contributions Conceptualization: G.N.S. and V.G.A.B.; methodology, R.K.A.F. and K.B.; software, G.N.S.; validation, G.N.S., K.-U.L. and K.B.; formal analysis, G.N.S., K.B. and R.K.A.F.; investigation, G.N.S.; resources, G.N.S. and V.G.A.B.; data curation, G.N.S. and K.B.; writing—original draft preparation, G.N.S., R.K.A.F. and K.-U.L.; writing—review and editing, G.N.S., K.-U.L., V.G.A.B. and K.B.; visualization, V.G.A.B. and K.B.; supervision, R.K.A.F. and K.-U.L.; project administration, G.N.S. and V.G.A.B.; funding acquisition, G.N.S., V.G.A.B., R.K.A.F., K.-U.L. and K.B. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest. References 1. Corssen G. Domino E.F. Dissociative anesthesia: Further pharmacologic studies and first clinical experience with the phencyclidine derivative CI-581 Anesth. Analg. 1966 45 29 40 10.1213/00000539-196601000-00007 5325977 2. Zhou Y. Wang C. Lan X. Li H. Chao Z. Ning Y. Plasma inflammatory cytokines and treatment-resistant depression with comorbid pain: Improvement by ketamine J. Neuroinflamm. 2021 18 200 10.1186/s12974-021-02245-5 PMC8444441 34526064 3. Guo J. Qiu D. Gu H.-W. Wang X.-M. Hashimoto K. Zhang G.-F. Yang J.-J. Efficacy and safety of perioperative application of ketamine on postoperative depression: A meta-analysis of randomized controlled studies Mol. Psychiatry 2023 28 2266 2276 10.1038/s41380-023-01945-z 36670198 PMC10611576 4. Andreasen T.H. Madsen F.A. Barbateskovic M. Lindschou J. Gluud C. Møller K. Ketamine for Critically Ill Patients with Severe Acute Brain Injury: A Systematic Review with Meta-analysis and Trial Sequential Analysis of Randomized Clinical Trials Neurocrit. Care 2024 42 610 621 10.1007/s12028-024-02075-2 39085508 5. Bell J.D. In Vogue: Ketamine for Neuroprotection in Acute Neurologic Injury Anesthesia Analg. 2017 124 1237 1243 10.1213/ANE.0000000000001856 28079589 6. Beaurain M. Salabert A.-S. Payoux P. Gras E. Talmont F. NMDA Receptors: Distribution, Role, and Insights into Neuropsychiatric Disorders Pharmaceuticals 2024 17 1265 10.3390/ph17101265 39458906 PMC11509972 7. Egunlusi A.O. Joubert J. NMDA Receptor Antagonists: Emerging Insights into Molecular Mechanisms and Clinical Applications in Neurological Disorders Pharmaceuticals 2024 17 639 10.3390/ph17050639 38794209 PMC11124131 8. Kawczak P. Feszak I. Bączek T. Ketamine, Esketamine, and Arketamine: Their Mechanisms of Action and Applications in the Treatment of Depression and Alleviation of Depressive Symptoms Biomedicines 2024 12 2283 10.3390/biomedicines12102283 39457596 PMC11505277 9. Laws J.C. Vance E.H. Betters K.A. Anderson J.J. Fleishman S. Bonfield C.M. Wellons J.C. III Xu M. Slaughter J.C. Giuse D.A. Acute Effects of Ketamine on Intracranial Pressure in Children with Severe Traumatic Brain Injury Crit. Care Med. 2023 51 563 572 10.1097/CCM.0000000000005806 36825892 PMC11441348 10. Tang Y. Liu Y. Zhou H. Lu H. Zhang Y. Hua J. Liao X. Esketamine is neuroprotective against traumatic brain injury through its modulation of autophagy and oxidative stress via AMPK/mTOR-dependent TFEB nuclear translocation Exp. Neurol. 2023 366 114436 10.1016/j.expneurol.2023.114436 37187276 11. Yi F. Traynelis S.F. Hansen K.B. Selective Cell-Surface Expression of Triheteromeric NMDA Receptors NMDA Receptors. Methods in Molecular Biology Burnashev N. Szepetowski P. Humana New York, NY, USA 2024 Volume 2799 10.1007/978-1-0716-3830-9_5 PMC11311247 38727903 12. Chou T.-H. Epstein M. Fritzemeier R.G. Akins N.S. Paladugu S. Ullman E.Z. Liotta D.C. Traynelis S.F. Furukawa H. Molecular mechanism of ligand gating and opening of NMDA receptor Nature 2024 632 209 217 10.1038/s41586-024-07742-0 39085540 PMC11376105 13. González-Cota A.L. Martínez-Flores D. Rosendo-Pineda M.J. Vaca L. NMDA receptor-mediated Ca 2+ Cell Calcium 2024 119 102856 10.1016/j.ceca.2024.102856 38408411 14. Hanson J.E. Yuan H. Perszyk R.E. Banke T.G. Xing H. Tsai M.-C. Menniti F.S. Traynelis S.F. Therapeutic potential of N-methyl-D-aspartate receptor modulators in psychiatry Neuropsychopharmacology 2024 49 51 66 10.1038/s41386-023-01614-3 37369776 PMC10700609 15. Arrabal-Gómez C. Beltran-Casanueva R. Hernández-García A. Bayolo-Guanche J.V. Barbancho-Fernández M.A. Serrano-Castro P.J. Narváez M. Enhancing Cognitive Functions and Neuronal Growth through NPY1R Agonist and Ketamine Co-Administration: Evidence for NPY1R-TrkB Heteroreceptor Complexes in Rats Cells 2024 13 669 10.3390/cells13080669 38667284 PMC11049095 16. Sahin F. Gunel A. Atasoy B.T. Guler U. Salih B. Kuzu I. Taspinar M. Cinar O. Kahveci S. Enhancing proteasome activity by NMDAR antagonists explains their therapeutic effect in neurodegenerative and mental diseases Sci. Rep. 2025 15 1165 10.1038/s41598-024-84479-w 39805913 PMC11729902 17. Li X. Saiyin H. Chen X. Yu Q. Ma L. Liang W. Ketamine impairs growth cone and synaptogenesis in human GABAergic projection neurons via GSK-3β and HDAC6 signaling Mol. Psychiatry 2024 29 1647 1659 10.1038/s41380-022-01864-5 36414713 PMC11371642 18. Morris H.R. Spillantini M.G. Sue C.M. Williams-Gray C.H. The pathogenesis of Parkinson’s disease Lancet 2024 403 293 304 10.1016/S0140-6736(23)01478-2 38245249 19. Stopera C.J. Bartlett M.J. Liu C. Esqueda A. Parmar R. Heien M.L. Sherman S.J. Falk T. Differential effects of opioid receptor antagonism on the anti-dyskinetic and anti-parkinsonian effects of sub-anesthetic ketamine treatment in a preclinical model Neuropharmacology 2024 257 110047 10.1016/j.neuropharm.2024.110047 38889877 PMC12404798 20. Rafe R. Saha P. Bello S.T. Targeting NMDA receptors with an antagonist is a promising therapeutic strategy for treating neurological disorders Behav. Brain Res. 2024 472 115173 10.1016/j.bbr.2024.115173 39097148 21. Zamanian M.Y. Nazifi M. Khachatryan L.G. Taheri N. Ivraghi M.S. Menon S.V. Husseen B. Prasad K.D.V. Petkov I. Nikbakht N. The Neuroprotective Effects of Agmatine on Parkinson’s Disease: Focus on Oxidative Stress, Inflammation and Molecular Mechanisms Inflammation 2024 48 1078 1092 10.1007/s10753-024-02139-7 39225914 22. Self W.K. Holtzman D.M. Emerging diagnostics and therapeutics for Alzheimer disease Nat. Med. 2023 29 2187 2199 10.1038/s41591-023-02505-2 37667136 23. Son S.H. Lee N.-R. Gee M.S. Song C.W. Lee S.J. Lee S.-K. Lee Y. Kim H.J. Kil Lee J. Inn K.-S. Chemical Knockdown of Phosphorylated p38 Mitogen-Activated Protein Kinase (MAPK) as a Novel Approach for the Treatment of Alzheimer′s Disease ACS Cent. Sci. 2023 9 417 426 10.1021/acscentsci.2c01369 36968534 PMC10037464 24. Li L. Li Y. Miao C. Liu Y. Liu R. Coriolus versicolor polysaccharides (CVP) regulates neuronal apoptosis in cerebral ischemia-reperfusion injury via the p38MAPK signaling pathway Ann. Transl. Med. 2020 8 1168 10.21037/atm-20-5759 33241017 PMC7576014 25. Wu G.-H. Guo Q.-H. Xu X.-D. Lin J.-C. You G.-T. Lin C.-H. Zhang L.-C. Ketamine exerts dual effects on the apoptosis of primary cultured hippocampal neurons from fetal rats in vitro Metab. Brain Dis. 2023 38 2417 2426 10.1007/s11011-023-01236-0 37273081 26. Shehata I.M. Masood W. Nemr N. Anderson A. Bhusal K. Edinoff A.N. Cornett E.M. Kaye A.M. Kaye A.D. The Possible Application of Ketamine in the Treatment of Depression in Alzheimer’s Disease Neurol. Int. 2022 14 310 321 10.3390/neurolint14020025 35466206 PMC9036213 27. Wen G. Zhan X. Xu X. Xia X. Jiang S. Ren X. Ren W. Lou H. Lu L. Hermenean A. Ketamine Improves the Glymphatic Pathway by Reducing the Pyroptosis of Hippocampal Astrocytes in the Chronic Unpredictable Mild Stress Model Mol. Neurobiol. 2024 61 2049 2062 10.1007/s12035-023-03669-1 37840071 28. Fitzgerald K.C. Morris B. Soroosh A. Balshi A. Maher D. Kaplin A. Nourbakhsh B. Pilot randomized active-placebo-controlled trial of low-dose ketamine for the treatment of multiple sclerosis–related fatigue Mult. Scler. J. 2021 27 942 953 10.1177/1352458520936226 PMC7790846 32633662 29. Ghajarzadeh M. Roman S. Vega L. Nourbakhsh B. Low-dose ketamine infusion for the treatment of multiple sclerosis fatigue (INKLING-MS): Study protocol for a randomized, double-blind, active placebo-controlled phase II trial Contemp. Clin. Trials 2023 126 107106 10.1016/j.cct.2023.107106 36738917 30. Wang X. Chang L. Wan X. Tan Y. Qu Y. Shan J. Yang Y. Ma L. Hashimoto K. (R)-ketamine ameliorates demyelination and facilitates remyelination in cuprizone-treated mice: A role of gut–microbiota–brain axis Neurobiol. Dis. 2022 165 105635 10.1016/j.nbd.2022.105635 35085752 31. Wang X. Chang L. Tan Y. Qu Y. Shan J. Hashimoto K. (R)-ketamine ameliorates the progression of experimental autoimmune encephalomyelitis in mice Brain Res. Bull. 2021 177 316 323 10.1016/j.brainresbull.2021.10.013 34688833 32. Reinhart K.M. Morton R.A. Brennan K.C. Carlson A.P. Shuttleworth C.W. Ketamine improves neuronal recovery following spreading depolarization in peri-infarct tissues J. Neurochem. 2023 168 855 867 10.1111/jnc.15923 37596720 PMC10986311 33. Zanza C. Piccolella F. Racca F. Romenskaya T. Longhitano Y. Franceschi F. Savioli G. Bertozzi G. De Simone S. Cipolloni L. Ketamine in acute brain injury: Current opinion following cerebral circulation and electrical activity Healthcare 2022 10 566 10.3390/healthcare10030566 35327044 PMC8949520 34. Kochanek P.M. Adelson P.D. Rosario B.L. Hutchison J. Miller Ferguson N. Ferrazzano P. O’Brien N. Beca J. Sarnaik A. LaRovere K. Comparison of Intracranial Pressure Measurements Before and After Hypertonic Saline or Mannitol Treatment in Children With Severe Traumatic Brain Injury JAMA Netw. Open 2022 5 e220891 10.1001/jamanetworkopen.2022.0891 35267036 PMC8914575 35. García-Ruiz M. Rodríguez P.M. Palliotti L. Lastras C. Romeral-Jiménez M. Morales I.G. Rey C.P. Rodrigo-Gisbert M. Campos-Fernández D. Santamarina E. Ketamine in the treatment of refractory and super-refractory status epilepticus: Experience from two centres Seizure 2024 117 13 19 10.1016/j.seizure.2024.01.013 38301485 36. Jacobwitz M. Mulvihill C. Kaufman M.C. Gonzalez A.K. Resendiz K. MacDonald J.M. Francoeur C. Helbig I. Topjian A.A. Abend N.S. Ketamine for management of neonatal and pediatric refractory status epilepticus Neurology 2022 99 E1227 E1238 10.1212/WNL.0000000000200889 35817569 PMC10499431 37. Adhikari A. Yadav S.K. Nepal G. Aryal R. Baral P. Neupane P. Paudel A. Pantha B. Acharya S. Shrestha G.S. Use of ketamine in Super Refractory Status Epilepticus: A systematic review Neurol. Res. Pract. 2024 6 33 10.1186/s42466-024-00322-7 38926769 PMC11210084 38. Anderson M. Levy M. Advances in the long-term treatment of neuromyelitis optica spectrum disorder J. Cent. Nerv. Syst. Dis. 2024 16 11795735241231094 10.1177/11795735241231094 38312734 PMC10836138 39. Abboud H. Salazar-Camelo A. George N. Planchon S.M. Matiello M. Mealy M.A. Goodman A. Symptomatic and restorative therapies in neuromyelitis optica spectrum disorders J. Neurol. 2022 269 1786 1801 10.1007/s00415-021-10783-4 34482456 PMC8940781 40. Akinosoglou K. Gogos A. Papageorgiou C. Angelopoulos E. Gogos C. Ketamine in COVID-19 patients: Thinking out of the box J. Med. Virol. 2020 93 4069 4070 10.1002/jmv.26681 33215721 PMC7753268 41. Walsh Z. Mollaahmetoglu O.M. Rootman J. Golsof S. Keeler J. Marsh B. Nutt D.J. Morgan C.J. Ketamine for the treatment of mental health and substance use disorders: Comprehensive systematic review BJPsych Open 2022 8 e19 10.1192/bjo.2021.1061 35040425 PMC8811778 42. Shafique H. Demers J.C. Biesiada J. Golani L.K. Cerne R. Smith J.L. Szostak M. Witkin J.M. ( R Int. J. Mol. Sci. 2024 25 6804 10.3390/ijms25126804 38928508 PMC11203826 43. Alnefeesi Y. Chen-Li D. Krane E. Jawad M.Y. Rodrigues N.B. Ceban F. Di Vincenzo J.D. Meshkat S. Ho R.C. Gill H. Real-world effectiveness of ketamine in treatment-resistant depression: A systematic review & meta-analysis J. Psychiatr. Res. 2022 151 693 709 35688035 10.1016/j.jpsychires.2022.04.037 44. Dwyer J.B. Landeros-Weisenberger A. Johnson J.A. Londono Tobon A. Flores J.M. Nasir M. Couloures K. Sanacora G. Bloch M.H. Efficacy of intravenous ketamine in adolescent treatment-resistant depression: A randomized midazolam-controlled trial Am. J. Psychiatry 2021 178 352 362 10.1176/appi.ajp.2020.20010018 33653121 45. Lin C. Zhou X. Li M. Zhang C. Zhai H. Li H. Wang H. Wang X. S-ketamine Alleviates Neuroinflammation and Attenuates Lipopolysaccharide-Induced Depression Via Targeting SIRT2 Adv. Sci. 2025 12 e2416481 10.1002/advs.202416481 40171943 PMC12199433 46. Turki M. Abidi O. Ellouze S. Ben Jmeaa R. Nasri J. Halouani N. Aloulou J. Ketamine As A New Therapeutic Option For The Management Of Mental Disorders Eur. Psychiatry 2022 65 S877 S878 10.1192/j.eurpsy.2022.2277 47. Bruton A.M. Wesemann D.G. Machingo T.A. Majak G. Johnstone J.M. Marshall R.D. Ketamine for mood disorders, anxiety, and suicidality in children and adolescents: A systematic review Eur. Child Adolesc. Psychiatry 2025 34 141 157 10.1007/s00787-024-02458-y 38750191 PMC12208172 48. Simmler L.D. Li Y. Hadjas L.C. Hiver A. van Zessen R. Lüscher C. Dual action of ketamine confines addiction liability Nature 2022 608 368 373 10.1038/s41586-022-04993-7 35896744 49. Ingrosso G. Cleare A.J. Juruena M.F. Is there a risk of addiction to ketamine during the treatment of depression? A systematic review of available literature J. Psychopharmacol. 2025 39 49 65 10.1177/02698811241303597 39688236 50. Pickering G. Voute M. Sorel M. Pereira B. Riant T. Sex and Age Differences in Ketamine Efficacy and Safety in Chronic Pain Alleviation J. Clin. Med. 2025 14 4269 10.3390/jcm14124269 40566014 PMC12194336 51. Subramanian S. Haroutounian S. Palanca B.J.A. Lenze E.J. Ketamine as a therapeutic agent for depression and pain: Mechanisms and evidence J. Neurol. Sci. 2022 434 120152 10.1016/j.jns.2022.120152 35092901 52. Graff V. Gabutti L. Treglia G. Pascale M. Anselmi L. Cafarotti S. La Regina D. Mongelli F. Saporito A. Perioperative costs of local or regional anesthesia versus general anesthesia in the outpatient setting: A systematic review of recent literature Braz. J. Anesthesiol. 2023 73 316 339 10.1016/j.bjane.2021.09.012 34627828 PMC10240220 53. Silva G.N. Brandão V.G. Perez M.V. Lewandrowski K.-U. Fiorelli R.K.A. Effects of Dexmedetomidine on Immunomodulation and Pain Control in Videolaparoscopic Cholecystectomies: A Randomized, Two-Arm, Double-Blinded, Placebo-Controlled Trial J. Pers. Med. 2023 13 622 10.3390/jpm13040622 37109010 PMC10141731 54. Silva G.N. Brandão V.G. Fiorelli R. Perez M.V. Mello C.R. Negrini D. Levandrowski K.-U. Martinelli R.B. dos Reis T.P.D.A. Outcomes of dexmedetomidine as adjuvant drug in patients undergoing videolaparoscopic cholecystectomy: A randomized and prospective clinical trial Int. J. Immunopathol. Pharmacol. 2023 37 03946320231196977 10.1177/03946320231196977 37604516 PMC10467245 55. Brandão V.G.A. Silva G.N. Perez M.V. Lewandrowski K.-U. Fiorelli R.K.A. Effect of Quadratus Lumborum Block on Pain and Stress Response after Video Laparoscopic Surgeries: A Randomized Clinical Trial J. Pers. Med. 2023 13 586 10.3390/jpm13040586 37108972 PMC10142610 56. Silva G.N. Brandão V.G.A. Perez M.V. Blum K. Lewandrowski K.-U. Fiorelli R.K.A. Neuroinflammatory Approach to Surgical Trauma: Biomarkers and Mechanisms of Immune and Neuroendocrine Responses J. Pers. Med. 2024 14 829 10.3390/jpm14080829 39202020 PMC11355628 57. Burman S. Chouhan R.S. Kumar N. Mahajan C. Effect of Ketamine Analgosedation on Neurological Outcome in patients with Severe Traumatic Brain Injury: A Randomized Controlled Pilot Study Neurocrit. Care 2025 1 9 10.1007/s12028-025-02274-5 40355795 58. Kamp J. Olofsen E. Henthorn T.K. van Velzen M. Niesters M. Dahan A. for the Ketamine Pharmacokinetic Study Group Ketamine Pharmacokinetics Anesthesiology 2020 133 1192 1213 10.1097/ALN.0000000000003577 32997732 59. Hartings J.A. Andaluz N. Bullock M.R. Hinzman J.M. Mathern B. Pahl C. Puccio A. Shutter L.A. Strong A.J. Vagal A. Prognostic value of spreading depolarizations in patients with severe traumatic brain injury JAMA Neurol. 2020 77 489 499 10.1001/jamaneurol.2019.4476 31886870 PMC6990808 60. Godoy D.A. Badenes R. Pelosi P. Robba C. Ketamine in acute phase of severe traumatic brain injury “an old drug for new uses?” Crit. Care 2021 25 19 10.1186/s13054-020-03452-x 33407737 PMC7788834 61. De Sloovere V. Mebis L. Wouters P. Guïza F. Boonen E. Bourgeois M. Dubois J. Ledoux D. Lormans P. Maréchal H. Brain Injury and Ketamine study (BIKe): A prospective, randomized controlled double blind clinical trial to study the effects of ketamine on therapy intensity level and intracranial pressure in severe traumatic brain injury patients Trials 2025 26 177 10.1186/s13063-025-08835-5 40437634 PMC12121202 62. Nguyen A. Mandavalli A. Diaz M.J. Root K.T. Patel A. Casauay J. Perisetla P. Lucke-Wold B. Neurosurgical Anesthesia: Optimizing Outcomes with Agent Selection Biomedicines 2023 11 372 10.3390/biomedicines11020372 36830909 PMC9953550 63. Maheswari N.M. Panda N.B. Mahajan S.M. Luthra A.M. Pattnaik S. Bhatia N. Karthigeyan M.M. Kaloria N.M. Chauhan R.M. Soni S.M. Ketofol as an Anesthetic Agent in Patients with Isolated Moderate to Severe Traumatic Brain Injury: A Prospective, Randomized Double-blind Controlled Trial J. Neurosurg. Anesthesiol. 2023 35 49 55 10.1097/ANA.0000000000000774 36745167 64. Wanchoo S. Khazanehdari S. Patel A. Lin A. Rebeiz T. DeMatteo C. Ullman J. Ledoux D. Ketamine for empiric treatment of cortical spreading depolarization after subdural hematoma evacuation Clin. Neurol. Neurosurg. 2021 200 106318 10.1016/j.clineuro.2020.106318 33268191 65. Chen K. Xie Y. Chi S. Chen D. Ran G. Shen X. Effects of intraoperative low-dose esketamine on postoperative pain after vestibular schwannoma resection: A prospective randomized, double-blind, placebo-controlled study Br. J. Clin. Pharmacol. 2024 90 1892 1899 10.1111/bcp.16081 38657619 66. Ornowska M. Wormsbecker A. Andolfatto G. Leung T.S. Khan I. Medvedev G. The use of ketamine as a neuroprotective agent following cardiac arrest: A scoping review of current literature CNS Neurosci. Ther. 2023 29 104 110 10.1111/cns.13983 36184822 PMC9804040 67. Brinck E.C.V. Virtanen T. Mäkelä S. Soini V. Hynninen V.-V. Mulo J. Savolainen U. Rantakokko J. Maisniemi K. Liukas A. S-ketamine in patient-controlled analgesia reduces opioid consumption in a dose-dependent manner after major lumbar fusion surgery: A randomized, double-blind, placebo-controlled clinical trial PLoS ONE 2021 16 e0252626 10.1371/journal.pone.0252626 34097713 PMC8183989 68. Hall J. Chung J. Khilkin M. Elkomos-Botros G. Ketamine as part of multi-modal analgesia may reduce opioid requirements following cardiac surgery: A retrospective observational cohort study J. Cardiothorac. Surg. 2025 20 178 10.1186/s13019-025-03405-x 40181432 PMC11966800 69. Kadian S. Gupta P. Agrawal S. Comparative Evaluation of analgesic efficacy of ketamine and magnesium sulfate as adjuvants to bupivacaine for scalp block in supratentorial Craniotomy: A Randomized, Double-Blind clinical study J. Clin. Neurosci. 2025 137 111347 10.1016/j.jocn.2025.111347 40435590 Figure 1 Racemic ketamine and its enantiomers structure. Ketamine exists as S(+) and R(−) isomers, which are commonly marketed as a racemic mixture. The S(+) isomer of ketamine has a higher affinity for the binding site on N-methyl-D-aspartate (NMDA) receptors and produces anesthetic potency three to four times greater than the R(−) isomer. Figure 2 Pain processing involves molecular and neural modulation in several areas, including the peripheral nociceptor, the nerve, the dorsal root ganglion, the dorsal horn of the spinal cord, the brain, and the brainstem. The NMDA receptor mainly affects pain modulation in the dorsal horn of the spinal cord. The figure illustrates the possible anatomical sites of the pain signaling pathway. Figure 3 In response to tissue damage or trauma, the primary nociceptive neuron releases glutamate in the dorsal horn of the spinal cord. This glutamate binds to N-methyl-D-aspartate (NMDA) receptors on second-order neurons. Once activated, the NMDA receptor initiates a series of intracellular processes that result in altered behavior, NMDA receptor expression, and neuronal synaptic plasticity. It plays a key role in the development of tolerance and hyperalgesia. pharmaceuticals-18-01298-t001_Table 1 Table 1 Behavioral parameters with ketamine treatment in neurological disorders. Disorder/Context Behavioral Parameters Assessed Observed Effects with Ketamine Autism Spectrum Disorder (ASD) – ABC (Aberrant Behavior Checklist) social withdrawal subscale Improvement in social withdrawal and overall clinical assessment over ~35 days. Bipolar depression/treatment-resistant depression – Depressive symptoms (rapid antidepressant effect) Rapid reduction in depressive symptoms and suicidal ideation within hours/days, with improvement maintained for up to 3 days after a single dose. Anxiety and affective comorbidities – General anxiety, anhedonia, and various affective symptoms Significant anxiolytic effects, reduced suicidal ideation, and improvement in symptoms such as anhedonia. Post-traumatic stress disorder (PTSD) – ‘Freezing’ behavior during re-exposure In animal models of PTSD, ketamine worsened ‘freezing’ behavior in animals with extreme behavioral response (EBR), with no changes in BDNF or glucose metabolism. Prolonged exposure/adolescence – Locomotion, social behavior, memory, anxiety, motor activity, affective behavior (preclinical) Changes in locomotion, social behavior, anxiety, depression, memory, and neurotoxic/apoptotic effects in animal models; in human adolescents, mood improvement but risk of cognitive/behavioral impairment. Prolonged sedation in pediatric patients – Withdrawal signs (WAT-1) Withdrawal syndrome, as well as motor and cognitive impairment observed (persistent language deficits detected up to 20 days after hospitalization). Adult animals (various models) – Open field behavior, conditioned place preference, immobility, emotional and motor reactivity, conditioned tolerance Development of tolerance to context-conditioned sedative effects, increased time spent in the center of the open field (low reactivity behavior), no motor impairment; changes in dopaminergic and serotonergic systems. Postpartum depression in rats – Forced swim test (immobility, swimming, climbing) Ketamine reversed induced depressive-like behavior (males) and reduced IL-6 and MPO; in females, it reduces MPO in the frontal cortex. It also alters maternal behavior and induces stereotyped behavior with higher prolonged doses. Neural network/cognition (neural level) – Short-term memory, dissociative psychoactivity, changes in neuronal synchronization, neural network function Ketamine affects short-term memory and induces psychedelic effects; it also alters firing patterns and neuronal synchronization, promoting arrhythmic connectivity and potentially modulating cortical networks for therapeutic purposes. Neuroplastic mechanisms – Synaptogenesis, neuroplasticity, BDNF expression, mTOR activation, reconsolidation of dysfunctional memories Stimulation of neuroplasticity via mTOR activation. BDNF increases, promoting brain reconnections and renewal of dysfunctional circuits—the basis for its rapid and profound therapeutic effects. pharmaceuticals-18-01298-t002_Table 2 Table 2 The use of ketamine in neurological clinical practice. Key Points of Clinical Use of Ketamine Outcomes and Clinical Implications Mechanisms of action and interaction pathways  Interacts with NMDA receptors, ion channels, including dopamine, serotonin, sigma, opioid and cholinergic receptors, and cyclic nucleotide-gated (HCN) channels activated by hyperpolarization [ 2 Lowers levels of TNF-α, IL-6, IFN-γ, IL-10, IL-1β, and IL-4 in patients exhibiting depressive symptoms and associated pain [ 2 Increases synaptogenesis and improves signaling through neurotrophic factors in brain regions [ 8 Relief of Mg 2+ 12 Protective effects on neurodegenerative diseases  There is little evidence supporting its use in humans for therapeutic purposes; Animal studies have shown increased memory consolidation and cell proliferation [ 15 16 Low-dose use in rodents has indicated activity of its metabolites for acute antidysetic and antiparkinsonian activities [ 19 Multiple sclerosis shows long-term reductions in fatigue-related symptoms after low-dose ketamine infusions [ 28 29 Role in acute neuroinflammatory disorders  Preventing hypotension, reducing fluid use, and preserving spontaneous ventilation, while also offering the potential to optimize analgesia and sedation in management of ventilated patients with traumatic brain injury [ 31 Appears to be a safe drug that can be used alone or in combination with other sedatives in patients with moderate to severe spinal cord injury (SCI) who require mechanical ventilation [ 33 34 Ketamine has been shown to downregulate several inflammatory cytokines in viral sepsis, including IL-6 [ 40 Addiction and psychiatric disorders  Antidepressant and antisuicidal effects in unipolar and bipolar depression, as well as in treatment-resistant depression, with repeated doses extending the duration of efficacy [ 41 Potential therapeutic option for patients with treatment-resistant anxiety disorders, particularly obsessive–compulsive disorder and post-traumatic stress disorder [ 45 Acts on dopamine system through the effects of local GABA neurons on circuits. The absence of adaptive synaptic plasticity indicates that ketamine dependence is limited by its pharmacology [ 48 Therapeutic effects as an adjuvant drug in neuroanesthesia  Its sympathomimetic profile, together with its neuroprotective effect, may be advantageous over other sedative and analgesic drugs used in patients with traumatic brain injury who are at risk of experiencing a reduction in blood pressure [ 57 Therapeutic effect in suppressing disseminated depolarization after brain injury, pulmonary vasodilation and bronchodilation, and increased mean arterial pressure and heart rate [ 58 59 60 In patients with elevated intracranial pressure (ICP) before anesthesia, its use in traumatic brain injury (TBI) is not indicated [ 61 May improve neurological outcomes after cardiac arrest [ 66 S-ketamine administered via patient-controlled analgesia reduced opioid consumption in a dose-dependent manner following major lumbar fusion surgery [ 67 Attenuation of the opioid-induced hyperalgesic response by N-methyl-D-aspartate (NMDA) blockade [ 68 Incorporating ketamine into ERAS strategies in neurosurgery can strengthen them by offering prolonged analgesia and limiting opioid use [ 69 ",
  "metadata": {
    "Title of this paper": "Comparative Evaluation of analgesic efficacy of ketamine and magnesium sulfate as adjuvants to bupivacaine for scalp block in supratentorial Craniotomy: A Randomized, Double-Blind clinical study",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472294/"
  }
}