{
  "title": "Paper_405",
  "abstract": "pmc Genet Med Open Genet Med Open 4662 genmedopen Genetics in Medicine Open 2949-7744 Elsevier PMC12481965 PMC12481965.1 12481965 12481965 41035528 10.1016/j.gimo.2025.103450 S2949-7744(25)01489-X 103450 1 Article Assessing completeness of cancer family history in EHRs using genetically defined kinships: A cross-sectional study Kiser Daniel 1 2 Elhanan Gai 1 2 Schlauch Karen A. 1 2 Read Robert 1 2 Grzymski Joseph J. joseph.grzymski@renown.org 1 2 ∗ 1 2 ∗ joseph.grzymski@renown.org 2025 21 8 2025 3 480832 103450 29 1 2025 12 8 2025 12 8 2025 21 08 2025 01 10 2025 02 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Purpose Family history (FHx) is the most widely available tool for reducing mortality and morbidity caused by heritable diseases. However, FHx may be inadequately documented. Our objective was to assess the rate at which cancers in patient relatives are documented as FHx in electronic health records (EHRs). Methods Our primary analysis included 903 Healthy Nevada Project participants who had cancer-diagnosed patient relatives removed by ≤2 degrees in a kinship analysis. The rate of successful EHR documentation of relatives’ cancer type was quantified using generalized estimating equations. Results The population-average rate of cancer FHx documentation in the EHR was 45.2% (95% confidence interval [CI]: 42.0%-48.4%). The odds ratio (OR) for successful documentation was 0.39 (95% CI: 0.24-0.64) for patients >69 years old versus patients <30 years old. Additionally, FHx documentation increased with years since a relative’s cancer diagnosis, with an OR of 2.19 (95% CI: 1.57-3.06) for patients with ≥10 years since their relative’s diagnosis versus <5 years. Compared with females, males were less likely to document female-specific cancers (OR 0.31 [95% CI: 0.19-0.49]) but more likely to document male-specific cancers (OR 2.42 [95% CI: 1.16-5.04]). In a secondary analysis of 83 patients with variants in BRCA1 BRCA2 Conclusion More than half of cancers affecting patient relatives were not documented as FHx in patient EHRs. This suggests that familial risk is underestimated, likely resulting in missed opportunities to reduce cancer mortality and morbidity. Keywords Cancer screening Clinical decision support Electronic health record Family history Kinship pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Family history (FHx) of cancer is a key component of established guidelines for determining whether a patient would benefit from genetic testing. 1 , 2 3 , 4 5 6 However, the usefulness of the EHR for identifying patients with familial risk depends on the completeness of its FHx records, which has not been quantified. Previous studies assessing the accuracy of recorded FHx typically collected FHx via intensive interviews or detailed questionnaires, rather than using existing FHx records in the EHR 7 8 9 10 11 12 13 14 4 Thus, the goal of this study was to assess the completeness of cancer FHxs in the EHR. To accomplish this, we utilized genetic sequencing data from over 44,000 patients at Renown Health, a large health system in Reno, Nevada, who are participants in the HNP. 15 Materials and Methods Data This was a cross-sectional study with an observation date of October 15, 2024. EHR data from Renown Health were used to ascertain patient gender, race, ethnicity, age, places of residence, health care encounter history, death dates, FHx records, and clinical diagnoses. Diagnoses were retrieved using local system diagnostic codes. Additional death dates were obtained from death certificates. 16 Included cancers were lymphoma, leukemia, melanoma, myeloma, and cancers of the bladder, bone, brain, breast, cervix, colorectum, esophagus, eye, fallopian tube, kidney, liver, lung, ovary, pancreas, penis, peritoneum, prostate, stomach, testicle, throat, thyroid, and uterus. Carcinomas in situ were excluded. In general, this analysis was conducted to err on the side of increased documentation. Thus, a diagnosis of melanoma in the family was considered to be successfully documented if the patient FHx record included either a mention of melanoma or a nonspecific FHx of skin cancer. Similarly, a diagnosis of a cancer in a particular site was considered to be successfully documented if the patient FHx record include a mention of a “tumor” in the same site. Although most FHx records were added by providers, patients also reported FHx via their electronic patient portals. 4 Study populations Living patients aged 18 to 89 years were eligible for inclusion in our study if they had a sufficient medical record, which we defined as having recorded gender, birth date, race, and ethnicity; having an address that could be mapped to a US census tract 17 Figure 1 Supplemental Figure 1 Figure 1 Flow chart depicting study population selection. Patients were also required to be HNP participants with quality-controlled genotyping data, 18 19 20 Finally, patients were assigned to 2 overlapping study populations: the primary study population if any of their identified relatives were diagnosed with cancer at least 180 days before the patient’s last encounter, and/or the secondary study population if they had pathogenic or likely pathogenic (P/LP) variants indicating hereditary breast and ovarian cancer (HBOC; P/LP variants in in BRCA1 BRCA2 MLH1 MSH2 MSH6 PMS2 EPCAM Figure 1 Analysis We defined a “documentation opportunity” as the diagnosis of a cancer type among a patient’s relatives that could have been documented in that patient’s FHx record. To assess the rate of missed documentation in our primary study population, we created a binary variable y i j t i j t y i j t y i j t 21 In addition to the intercept-only model, we also fitted models with indicators for each category of different grouping variables. This allowed us to estimate documentation rates for mutually exclusive categories of patients (eg, males versus females) or categories of cancer-affected relatives (eg, <2 degrees versus 2 degrees of separation). Category brackets for the continuous variables age, encounter number, and time since first diagnosis were defined after examining their distributions, and categories for income were the same as those used in prior work. 2 To assess differences in documenting FHx of sex-specific cancers between males and females, we designated cancer types as female specific (breast, cervical, ovarian, fallopian tubal, uterine, and vaginal), male specific (penile, prostate, and testicular), and non-sex specific (all other cancer types). For each group of cancers, we fit separate GEE models that included indicators for gender. We used our secondary study population to assess whether missed documentation of FHx may result in unrecognized familial risk for patients with P/LP variants related to HBOC and LS. For patients with HBOC, we determined how many patients had documented FHx in their EHR that met criteria in the 7-question family history questionnaire (FHS7), which is used to assess whether patients should be referred for genetic testing for variants related to breast cancer. 2 , 22 Finally, we conducted a follow-up analysis to assess whether our study population criteria may have concealed sociodemographic differences in FHx documentation rates. All patients with a sufficient medical record ( Figure 1 R statistical programming software (version 4.4.2) 23 24 25 Results After exclusions, our primary study population consisted of 903 patients from 721 families that included relatives known to have a personal diagnosis of cancer ( Figure 1 Table 1 Supplemental Table 1 Table 1 Characteristics of study population compared with parent population Characteristic Patients, No. (%) With Sufficient Medical Record ( n Study Population ( n Gender Female 165,650 (55.7) 679 (75.2) Male 131,571 (44.3) 224 (24.8) Nonbinary 62 (0.0) 0 (0.0) Age category (years) <30 43,004 (14.5) 100 (11.1) 30-49 95,639 (32.2) 361 (40.0) 50-69 99,137 (33.3) 291 (32.2) >69 59,503 (20.0) 151 (16.7) Race White 244,635 (82.3) 834 (92.4) Non-White a 47,351 (15.9) 68 (7.5) Unknown 5297 (1.8) 1 (0.1) Ethnicity Hispanic or Latino 41,056 (13.8) 74 (8.2) Non-Hispanic 245,509 (82.6) 819 (90.7) Unknown 10,718 (3.6) 10 (1.1) Median household income of census tract ($1000’s) <50 (low) 45,129 (15.2) 87 (9.6) 50-99 (moderate) 195,296 (65.7) 545 (60.4) ≥100 (high) 56,858 (19.1) 271 (30.0) Number of encounters 1 57,019 (19.2) 57 (6.3) 2-4 88,952 (29.9) 152 (16.8) 5-9 65,329 (22.0) 228 (25.2) 10-19 50,865 (17.1) 278 (30.8) >19 35,118 (11.8) 188 (20.8) HNP participant 30,567 (10.3) 903 (100.0) Any family history of cancer b 138,236 (46.5) 692 (76.6) HNP, Healthy Nevada Project. a Asian, Black, Native American, Pacific Islander, other, or multiracial. b Does not include cancers recorded in the comments when the code does not specify cancer because of infeasibility of parsing comments for all patients in the health system. Among the 903 patients, 692 (76.6%) had ≥1 record of cancer FHx ( Table 1 Supplemental Table 1 After accounting for family clustering, the overall rate at which cancer diagnoses in family members were documented in FHx records as specific cancer types was 45.2% (95% CI: 42.0-48.4; Table 2 Table 2 Patients, families, opportunities to document cancer types in the family history, and estimated documentation rates FHx GEE Estimates (95% CI) Patients Families Documentation Opportunities a Successful Documentation Documentation Rate Odds Ratio Overall 903 721 1074 474 (44.1) 45.2 (42.0-48.4) N/A Gender Female 679 573 803 383 (47.7) 48.7 (45.0-52.3) ref. Male 224 207 271 91 (33.6) 34.7 (29.1-40.8) 0.56 (0.42-0.75) Age category (years) <30 100 96 120 61 (50.8) 54.3 (44.6-63.6) ref. 30-49 361 325 432 209 (48.4) 48.8 (44.1-53.7) 0.80 (0.52-1.23) 50-69 291 267 346 152 (43.9) 44.3 (39.1-49.6) 0.67 (0.43-1.04) >69 151 140 176 52 (29.5) 31.6 (25.1-39.0) 0.39 (0.24-0.64) Race White 834 674 994 440 (44.3) 45.2 (41.9-48.6) ref. Non-White/multiracial/unknown 69 59 80 34 (42.5) 44.9 (35.2-55.0) 0.99 (0.65-1.50) Ethnicity Non-Hispanic 819 663 978 437 (44.7) 45.7 (42.4-49.1) ref. Hispanic 74 63 85 33 (38.8) 40.4 (30.6-51.1) 0.81 (0.51-1.26) Unknown 10 10 11 4 (36.4) 37.5 (13.9-68.9) 0.71 (0.19-2.66) Median household income of census tract ($1000’s) 50-100 (moderate) 545 472 667 297 (44.5) 45.3 (41.3-49.3) ref. <50 (low) 87 86 100 43 (43.0) 44.8 (35.5-54.4) 0.98 (0.65-1.48) >100 (high) 271 245 307 134 (43.6) 45.2 (39.6-50.8) 0.99 (0.76-1.31) Number of encounters 1 57 57 64 27 (42.2) 39.8 (28.5-52.4) ref. 2-4 152 147 183 78 (42.6) 43.8 (36.7-51.1) 1.18 (0.66-2.11) 5-9 228 214 260 108 (41.5) 43.4 (37.3-49.7) 1.16 (0.65-2.07) 10-19 278 256 340 166 (48.8) 50.1 (44.6-55.6) 1.52 (0.88-2.61) >19 188 176 227 95 (41.9) 42.9 (36.7-49.4) 1.14 (0.64-2.01) Degree of relationship Monozygotic twin/first-degree 681 579 790 396 (50.1) 50.9 (47.2-54.5) ref. Second degree 240 207 284 78 (27.5) 28.3 (23.3-33.9) 0.38 (0.28-0.51) Years between family member diagnosis and last FHx record 0.5-5 418 364 451 163 (36.1) 37.4 (33.0-41.9) ref. 5-10 365 311 410 196 (47.8) 48.4 (43.5-53.4) 1.57 (1.20-2.06) ≥10 188 157 213 115 (54.0) 56.6 (49.5-63.5) 2.19 (1.57-3.06) FHx GEE a Total number of cancer types in families that could have been documented. Among specific cancer types, the highest rate of documentation was observed for breast (69.8% [95% CI: 64.3-74.7]) and colorectal cancers (50.7% [95% CI: 38.7-62.6] Figure 2 Supplemental Table 1 Figure 3 Supplemental Table 2 Figure 2 GEE estimated documentation rates for specific cancer types. Figure 3 Documentation rates by gender and cancer category. In our secondary study population ( Figure 1 In our follow-up analysis of factors influencing whether a patient has any mention of cancer FHx in their EHR, males were less likely to have at least 1 FHx record than females (OR 0.61 [95% CI: 0.60-0.62]); patients of non-White, multiracial, or unknown race were less likely to have at least 1 record than patients of White race (OR 0.65 [95% CI: 0.63-0.66]); and patients residing in low-income census tracts were less likely to have at least 1 record than patients residing in middle-income census tracts (OR 0.91 [95% CI: 0.89-0.93]; Supplemental Table 3 Discussion FHx is the most cost-effective tool available to clinicians for identifying inherited risk. 4 , 26 In our population, several factors appeared to influence the documentation rate. Consistent with previous studies, rates were lower for patients who were males 2 10 , 27 , 28 29 The documentation rate significantly increased with time elapsed between a patient’s last encounter and the earliest diagnosis in the family: from 37.4% at <5 years to 56.6% at ≥10 years ( Table 2 Supplemental Materials 30 31 The documentation rate also varied substantially by the type of cancer. It is possible that the variation between cancer types is due to differences in associated social stigma, 32 33 Patient perceptions of hazard may help explain why females were more likely to document female-specific cancer types and males and were more likely to document male-specific cancer types ( Figure 3 Supplemental Table 2 BRCA1 BRCA2 4 34 , 35 No significant differences in the documentation rate of known cancers in the family were observed for sociodemographic factors or the number of health care encounters. However, our study population was less diverse than the broader patient population ( Table 1 Supplemental Table 3 36 Table 1 Previous studies also compared patient-reported FHx with actual diagnoses in relatives, but these studies typically included a process for ensuring a thorough collection of FHx via an intensive interview or a detailed questionnaire. 7 8 9 10 11 37 , 38 29 , 39 There are several possible solutions to inadequate FHx documentation. At the level of governmental and insurer policy, modifying incentives could ensure that clinicians can devote adequate time to collecting FHx. 40 41 22 42 3 43 15 , 44 45 46 47 Limitations In addition to limitations already noted, this was a single-center, observational study. We also did not have a complete pedigree for each patient and thus were not able to assess sensitivity and specificity of FHx records. Furthermore, because we used genetics to determine relatedness rather than patient self-report, some patient pairs might not have known they were related, which would lower the cancer documentation rate. However, estranged families are an inherent limitation of FHx in general and not just of our study. Finally, it should be noted that we focused on the documentation of cancer types rather than on other important information, such as relative type and age of onset, because documentation of these aspects of FHx would have been difficult to assess given our methods for determining relatedness. Conclusion In this cross-sectional study, we found that more than half of cancers diagnosed in patient families are not documented in EHR FHx records. This suggests that familial risk for many patients is underestimated, thus reducing the effectiveness of CDS tools and other population health initiatives that utilize EHR data. Possible solutions include policy changes to better facilitate the documentation of FHx, the use of targeted FHx questionnaires to screen for specific cancer syndromes, or the implementation of population-wide genetic screening. Addressing these gaps in FHx documentation is urgent because improving risk assessment can simultaneously reduce health care costs and lower cancer morbidity and mortality. Data Availability Deidentified participant data used to fit generalized estimating equations models can be downloaded from Dryad by following this link: https://doi.org/10.5061/dryad.4qrfj6qq1 jgrzymski@unr.edu ORCIDs Daniel Kiser: http://orcid.org/0000-0002-6468-8209 Gai Elhanan: http://orcid.org/0000-0003-1518-5522 Karen A. Schlauch: http://orcid.org/0000-0001-6916-8571 Robert Read: http://orcid.org/0000-0002-6967-5634 Joseph J. Grzymski: http://orcid.org/0000-0003-2646-8958 Ethics Declaration The Healthy Nevada Project study was reviewed and approved by the University of Nevada, Reno Institutional Review Board (project 956068-12). All participants gave their informed consent before participation. All data used for research were deidentified. Conflict of Interest Joseph J. Grzymski reported holding patents (US Patent Application 63/467,250 and 18/652,745) and receiving grants from Gilead Sciences References 1 United States Preventive Services Task Force Owens D.K. Davidson K.W. Risk assessment, genetic counseling, and genetic testing for BRCA JAMA 322 7 2019 652 665 10.1001/jama.2019.10987 31429903 2 Daly M.B. Pilarski R. Yurgelun M.B. NCCN guidelines insights: genetic/familial high-risk assessment: breast, ovarian, and pancreatic, version 1.2020 J Natl Compr Canc Netw 18 4 2020 380 391 10.6004/jnccn.2020.0017 32259785 3 Del Fiol G. Kohlmann W. Bradshaw R.L. Standards-based clinical decision support platform to manage patients who meet guideline-based criteria for genetic evaluation of familial cancer JCO Clin Cancer Inform 4 2020 1 9 10.1200/CCI.19.00120 31951474 PMC7000231 4 Kiser D. Elhanan G. Bolze A. Screening familial risk for hereditary breast and ovarian cancer JAMA Netw Open 7 9 2024 e2435901 10.1001/jamanetworkopen.2024.35901 PMC11425146 39320887 5 Murray M.F. Evans J.P. Angrist M. A proposed approach for implementing genomics-based screening programs for healthy adults. National Academy of Medicine https://nam.edu/a-proposed-approach-for-implementing-genomics-based-screening-programs-for-healthy-adults/ 6 Ginsburg G.S. Wu R.R. Orlando L.A. Family health history: underused for actionable risk assessment Lancet 394 10198 2019 596 603 10.1016/S0140-6736(19)31275-9 31395442 PMC6822265 7 Mitchell R.J. Brewster D. Campbell H. Accuracy of reporting of family history of colorectal cancer Gut 53 2 2004 291 295 10.1136/gut.2003.027896 14724166 PMC1774933 8 Kerber R.A. Slattery M.L. Comparison of self-reported and database-linked family history of cancer data in a case-control study Am J Epidemiol 146 3 1997 244 248 10.1093/oxfordjournals.aje.a009259 9247008 9 Anton-Culver H. Kurosaki T. Taylor T.H. Gildea M. Brunner D. Bringman D. Validation of family history of breast cancer and identification of the BRCA1 Genet Epidemiol 13 2 1996 193 205 10.1002/(SICI)1098-2272(1996)13:2&#x0003c;193::AID-GEPI5&#x0003e;3.0.CO;2-9 8722746 10 Ziogas A. Anton-Culver H. Validation of family history data in cancer family registries Am J Prev Med 24 2 2003 190 198 10.1016/s0749-3797(02)00593-7 12568826 11 Qureshi N. Wilson B. Santaguida P. Collection and use of cancer family history in primary care Evid Rep Technol Assess (Full Rep) 159 2007 1 84 PMC4781030 18457477 12 Wood M.E. Rehman H.T. Bedrosian I. Importance of family history and indications for genetic testing Breast J 26 1 2020 100 104 10.1111/tbj.13722 31865627 13 Chavez-Yenter D. Goodman M.S. Chen Y. Association of disparities in family history and family cancer history in the electronic health record with sex, race, Hispanic or Latino ethnicity, and language preference in 2 large US health care systems JAMA Netw Open 5 10 2022 e2234574 10.1001/jamanetworkopen.2022.34574 PMC9533178 36194411 14 Liebermann E. Taber P. Vega A.S. Barriers to family history collection among Spanish-speaking primary care patients: a BRIDGE qualitative study PEC Innov 1 2022 100087 10.1016/j.pecinn.2022.100087 PMC9757734 36532299 15 Grzymski J.J. Elhanan G. Morales Rosado J.A. Population genetic screening efficiently identifies carriers of autosomal dominant diseases Nat Med 26 8 2020 1235 1239 10.1038/s41591-020-0982-5 32719484 16 Death certificate data. Nevada Department of Health and Human Services Accessed March 2023. https://dhhs.nv.gov/ 17 American Community Survey (ACS) 5-year data. United States Census Bureau https://api.census.gov/data/2020/acs/acs5 18 Schlauch K.A. Read R.W. Neveux I. Lipp B. Slonim A. Grzymski J.J. The impact of ACEs on BMI: an investigation of the genotype-environment effects of BMI Front Genet 13 2022 816660 10.3389/fgene.2022.816660 PMC8942770 35342390 19 Manichaikul A. Mychaleckyj J.C. Rich S.S. Daly K. Sale M. Chen W.M. Robust relationship inference in genome-wide association studies Bioinformatics 26 22 2010 2867 2873 10.1093/bioinformatics/btq559 20926424 PMC3025716 20 Read R.W. Schlauch K.A. Lombardi V.C. Genome-wide identification of rare and common variants driving triglyceride levels in a Nevada population Front Genet 12 2021 639418 10.3389/fgene.2021.639418 PMC7982958 33763119 21 Liang K.Y. Zeger S.L. Longitudinal data analysis using generalized linear models Biometrika 73 1 1986 13 22 10.1093/biomet/73.1.13 22 Ashton-Prolla P. Giacomazzi J. Schmidt A.V. Development and validation of a simple questionnaire for the identification of hereditary breast cancer in primary care BMC Cancer 9 2009 283 10.1186/1471-2407-9-283 19682358 PMC2739222 23 R Core Team R: a language and environment for statistical computing. R Foundation for Statistical Computing https://www.R-project.org/ 24 Carey V.J. GEE: generalized estimation equation solver [R Package], version 4.13-27. CRAN https://CRAN.R-project.org/package=gee 25 von Elm E. Altman D.G. Egger M. The Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) statement: guidelines for reporting observational studies J Clin Epidemiol 61 4 2008 344 349 10.1016/j.jclinepi.2007.11.008 18313558 26 Bennett R.L. The Practical Guide to the Genetic Family History 2011 John Wiley & Sons 27 Ozanne E.M. O’Connell A. Bouzan C. Bias in the reporting of family history: implications for clinical care J Genet Couns 21 4 2012 547 556 10.1007/s10897-011-9470-x 22237666 28 Mai P.L. Garceau A.O. Graubard B.I. Confirmation of family cancer history reported in a population-based survey J Natl Cancer Inst 103 10 2011 788 797 10.1093/jnci/djr114 21562245 PMC3096799 29 Acheson L.S. Wiesner G.L. Zyzanski S.J. Goodwin M.A. Stange K.C. Family history-taking in community family practice: implications for genetic screening Genet Med 2 3 2000 180 185 10.1097/00125817-200005000-00004 11256663 30 Wakefield C.E. Quinn V.F. Fardell J.E. Family history-taking practices and genetic confidence in primary and tertiary care providers for childhood cancer survivors Pediatr Blood Cancer 65 4 2018 e26923 10.1002/pbc.26923 29286558 31 Valdez R. Yoon P.W. Qureshi N. Green R.F. Khoury M.J. Family history in public health practice: a genomic tool for disease prevention and health promotion Annu Rev Public Health 31 2010 69 87 10.1146/annurev.publhealth.012809.103621 20070206 32 Yoon P.W. Scheuner M.T. Peterson-Oehlke K.L. Gwinn M. Faucett A. Khoury M.J. Can family history be used as a tool for public health and preventive medicine? Genet Med 4 4 2002 304 310 10.1097/00125817-200207000-00009 12172397 33 Morse R.M. Brown J. Gage J.C. ‘Easy women get it’: pre-existing stigma associated with HPV and cervical cancer in a low-resource setting prior to implementation of an HPV screen-and-treat program BMC Public Health 23 1 2023 2396 10.1186/s12889-023-17324-w 38042779 PMC10693157 34 Leão R.R.N. Price A.J. James Hamilton R. Germline BRCA Prostate Cancer Prostatic Dis 21 1 2018 48 56 10.1038/s41391-017-0018-5 29242595 35 Li S. Silvestri V. Leslie G. Cancer risks associated with BRCA1 BRCA2 J Clin Oncol 40 14 2022 1529 1541 10.1200/JCO.21.02112 35077220 PMC9084432 36 Zavala V.A. Bracci P.M. Carethers J.M. Cancer health disparities in racial/ethnic minorities in the United States Br J Cancer 124 2 2021 315 332 10.1038/s41416-020-01038-6 32901135 PMC7852513 37 Sijmons R.H. Boonstra A.E. Reefhuis J. Accuracy of family history of cancer: clinical genetic implications Eur J Hum Genet 8 3 2000 181 186 10.1038/sj.ejhg.5200441 10780783 38 Murff H.J. Spigel D.R. Syngal S. Does this patient have a family history of cancer? An evidence-based analysis of the accuracy of family cancer history JAMA 292 12 2004 1480 1489 10.1001/jama.292.12.1480 15383520 39 Drossman D.A. Ruddy J. Improving patient-provider relationships to improve health care Clin Gastroenterol Hepatol 18 7 2020 1417 1426 10.1016/j.cgh.2019.12.007 31843593 40 Rich E.C. Burke W. Heaton C.J. Reconsidering the family history in primary care J Gen Intern Med 19 3 2004 273 280 10.1111/j.1525-1497.2004.30401.x 15009784 PMC1492151 41 Ramsey S.D. Burke W. Pinsky L. Clarke L. Newcomb P. Khoury M.J. Family history assessment to detect increased risk for colorectal cancer: conceptual considerations and a preliminary economic analysis Cancer Epidemiol Biomarkers Prev 14 11 Pt 1 2005 2494 2500 10.1158/1055-9965.EPI-05-0418 16284369 PMC2692569 42 Kastrinos F. Allen J.I. Stockwell D.H. Development and validation of a colon cancer risk assessment tool for patients undergoing colonoscopy Am J Gastroenterol 104 6 2009 1508 1518 10.1038/ajg.2009.135 19491864 PMC3584339 43 Sun L. Wei X. Fierheller C.T. Economic evaluation of population-based BRCA1 BRCA2 JAMA Netw Open 7 9 2024 e2432725 10.1001/jamanetworkopen.2024.32725 PMC11393724 39264630 44 Manickam K. Buchanan A.H. Schwartz M.L.B. Exome sequencing-based screening for BRCA1/2 JAMA Netw Open 1 5 2018 e182140 10.1001/jamanetworkopen.2018.2140 PMC6324494 30646163 45 Abul-Husn N.S. Soper E.R. Odgis J.A. Exome sequencing reveals a high prevalence of BRCA1 BRCA2 Genome Med 12 1 2019 2 10.1186/s13073-019-0691-1 31892343 PMC6938627 46 Elhanan G. Kiser D. Neveux I. Incomplete penetrance of population-based genetic screening results in electronic health record Front Genet 13 2022 866169 10.3389/fgene.2022.866169 PMC9091193 35571025 47 Manchanda R. Blyuss O. Gaba F. Current detection rates and time-to-detection of all identifiable BRCA J Med Genet 55 8 2018 538 545 10.1136/jmedgenet-2017-105195 29622727 Additional Information  Supplementary Material Acknowledgments The authors thank Renown Health for supporting the Healthy Nevada Project at the University of Nevada, Reno School of Medicine Funding Funding was provided to the Renown Institute for Health Innovation by Renown Health and the Renown Health Foundation Author Contributions Conceptualization: D.K., G.E., J.G.; Data Curation: D.K., G.E., R.R.; Formal Analysis: D.K., K.S.; Funding Acquisition: J.G.; Investigation: D.K., G.E., K.S., J.G.; Methodology: D.K., G.E., K.S.; Supervision: J.G.; Visualization: D.K.; Writing-original draft: D.K.; Writing-review and editing: D.K., G.E., K.S., R.R., J.G. The Article Publishing Charge (APC) for this article was paid by Renown Health. Additional Information The online version of this article ( https://doi.org/10.1016/j.gimo.2025.103450 ",
  "metadata": {
    "Title of this paper": "Current detection rates and time-to-detection of all identifiable ",
    "Journal it was published in:": "Genetics in Medicine Open",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481965/"
  }
}