{
  "title": "Paper_179",
  "abstract": "pmc J Cell Commun Signal J Cell Commun Signal 536 jccs CCS3 Journal of Cell Communication and Signaling 1873-9601 1873-961X Wiley PMC12494493 PMC12494493.1 12494493 12494493 10.1002/ccs3.12032 CCS312032 1 Article Article Breast Cancer; Pancreatic Cancer; Cancer Immunology; CCN Signaling Emerging role of HIC1 in prostate cancer progression and therapeutic response: A novel perspective HIC1 in Prostate Cancer Progression and Response to Therapy Xue Dun  1 Tan Long  2 Yang Fengshuai  3 Tian Xiaolan  4 Zuo Qian https://orcid.org/0009-0004-6175-1366  5 soleil0617@foxmail.com Wu Xinghui  6 cssdyyyurology@163.com   1 Department of Medical The First Hospital of Changsha Changsha China   2 Department of Nurology Surgery The First Hospital of Changsha Changsha China   3 Department of General Surgery The First Hospital of Changsha Changsha China   4 Department of Outpatient Office The First Hospital of Changsha Changsha China   5 Department of Radiology The First Hospital of Changsha Changsha China   6 Department of Urology The First Hospital of Changsha Changsha China * Correspondence soleil0617@foxmail.com cssdyyyurology@163.com 03 10 2025 12 2025 19 4 497536 10.1002/ccs3.v19.4 e12032 17 4 2024 02 2 2024 23 4 2024 03 10 2025 05 10 2025 05 10 2025 © 2025 The Author(s). Journal of Cell Communication and Signaling published by John Wiley & Sons Ltd. https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Prostate cancer (PCa) is a leading cause of cancer‐related death in men, with its progression and treatment response being complex. The study focuses on the role of HIC1 (Hypermethylated in cancer 1) in PCa, revealing its downregulation in PCa tissues compared to normal counterparts. Using transcriptome sequencing and bioinformatics, it was found that HIC1 influences key cellular processes like cell growth, proliferation, invasion, and androgen receptor (AR) signaling in PCa. Specifically, AR was identified as a transcription factor for insulin receptor substrate 2 (IRS2), which activates the PI3K/AKT pathway, enhancing PCa cell proliferation and invasion. However, this effect could be reversed by IRS2 inhibition using NT157. Furthermore, HIC1 overexpression reduced castration resistance in PCa cells, with in vivo studies showing that HIC1 silencing increased PCa xenograft growth and resistance, and elevated Ki‐67, Cleaved‐caspase‐3, EMT markers, and prostate‐specific antigen (PSA) levels. Conversely, AR and IRS2 inhibitors like EPI‐7170 and NT157 negatively affected PCa progression. These results underscore HIC1's potential as a therapeutic target in PCa, offering new insights into its role in cancer biology and treatment. HIC1 inhibits AR expression to suppress the development of castration‐resistant prostate cancer through the IRS2/PI3K/AKT axis. androgen receptor castration resistance HIC1 IRS2 PI3K/AKT axis prostate cancer pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date December 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:04.10.2025 1 INTRODUCTION Prostate cancer (PCa) is a prevalent malignancy that affects men worldwide, particularly in Western countries, where it has the highest incidence and mortality rates compared to other male malignancies.  1  2  3  4  5  6  7  8  9 A significant body of research suggests that the androgen receptor (AR) plays a vital role in the development of prostate cancer.  10  11  12  13 Furthermore, the IRS2/PI3K/AKT axis, which involves the insulin receptor substrate 2 (IRS2) signaling pathway, the phosphoinositide 3‐kinase (PI3K), and protein kinase B (AKT), plays a crucial role in prostate cancer development.  14  15  16  17  18 HIC1, also known as hypermethylated in Cancer 1, is a DNA‐binding protein that regulates critical biological processes, such as cell proliferation, differentiation, and apoptosis. It is closely associated with various types of cancer.  19  20  21 2 MATERIALS AND METHODS 2.1 High‐throughput sequencing of transcriptome samples, conducted quality control of the data, and performed differential gene analysis Total RNA was extracted from each sample using a Trizol reagent (Thermo, 16096020). The concentration, purity, and integrity of the RNA were measured using the Qubit®2.0 Fluorometer® from Life Technologies ( Q33216  22  23 To assess the quality of the paired‐end reads in the raw sequencing data, FastQC software version 0.11.8 was used. The raw data were then preprocessed using Cutadapt 1.18 software, which involved removing Illumina sequencing adapters and poly(A) tail sequences, as well as eliminating reads with an N content exceeding 5%, using a Perl script. Reads with a quality score above 20, covering 70% of the bases, were extracted using the FASTX Toolkit version 0.0.13. Paired‐end sequences were repaired using the BBMap software. Finally, the filtered and high‐quality read fragments were aligned to the mouse reference genome using HISAT2 software (version 0.7.12). Differentially expressed genes (DEGs) were selected using the “Limma” package in R, applying a threshold of |logFC| >1.7 and p For the analysis of differential gene expression, the “heatmap” package and the “ggplot2” package in R were utilized to generate heat maps and volcano plots. Venn diagrams were created using the “vennDiagram” package. Gene ontology (GO) and KEGG pathway enrichment analysis were performed using the “clusterProfiler” package in R, while correlation analysis was conducted using the “corrplot” package. Furthermore, protein‐protein interaction analysis was carried out using the STRING online website.  24  25 2.2 PCa cell culture in vitro The mouse prostate cancer cell line RM‐1 (catalog number TCM14) was cultured in RPMI 1640 medium containing 10% FBS. The human PCa cell line VCaP (catalog number TCHu220) was cultured in DMEM medium with 20% FBS. PC3 (catalog number TCHu158) was cultured in Ham's F‐12K medium with 10% FBS. LNCaP (catalog number TCHu173) was cultured in RPMI 1640 medium with 10% FBS. DU145 (catalog number TCHu222) was cultured in a DMEM medium with 10% FBS. These cells were all obtained from the Cell Bank of the Chinese Academy of Sciences. HEK‐293 cells were procured from ATCC (catalog number: CRL‐3216, ATCC) and grown in DMEM/F‐12 medium with 10% FBS. The castration‐resistant PCa cell line LNCaP‐AI (LNCaP‐androgen independent) was derived from LNCaP cells after multiple passages, transitioning to a medium containing 10% FBS and charcoal‐stripped serum (CDS medium) devoid of steroids (Israeli Biological Industries), instead of regular FBS. These cells were maintained in a CDS medium for approximately 6 months, resulting in the selection of the castration‐resistant PCa cell line.  26  27  28  29 For cell culture, a constant‐temperature incubator (catalog number: 51032874, ThermoFisher) was used with 5% CO2 at 37°C. The culture media employed in this study were as follows: FBS (Catalog number: 10099, Gibco), DMEM/F‐12 medium (Catalog number: 21041025, Gibco), DMEM medium (Catalog number: 10566016, Gibco), Ham's F‐12K medium (Catalog number: 21127022, Gibco), and RPMI 1640 medium (Catalog number: 11875093, Gibco). Furthermore, the charcoal‐stripped serum (CSS) used in the study was prepared by treating bovine fetal blood‐derived serum with activated carbon and pectin. The CSS was purchased from Gibco (Catalog number: 12676‐029, USA). 2.3 Cell transfection and other treatments The transfection process involves introducing the pHAGE‐puro series plasmids and helper plasmids pSPAX2 and pMD2.G, as well as the pSuper‐retro‐puro series plasmids and helper plasmids gag/pol and VSVG, into 293t cells. This can be achieved using the Lentivirus Packaging Kit (A35684CN, Invitrogen). When the cells are in the logarithmic phase, they should be digested with trypsin and then seeded into a 6‐well plate at a density of 1 × 10 5 6 8 S1 The IRS2 inhibitor NT157 (catalog number M00819, Beijing Bai'aolei Biotechnology Co., Ltd) should be prepared as a 10 mM stock solution according to the provided instructions. For in vitro studies, NT157 should be dissolved in dimethyl sulfoxide (DMSO) to create a 10 mM stock solution and stored at 4°C. For in vivo studies, NT157 should be dissolved in a 20% solution of 2‐hydroxypropyl‐β‐cyclodextrin (2‐HP‐β‐CD) (C0926, Sigma) at a concentration of 5 mg/mL and stored at −80°C. The cells should be treated with a concentration of 5 μM NT157 for 6 h to prepare for further experiments.  30 Enzalutamide (catalog number MDV3100, MedChemExpress) should be dissolved as instructed and stored at −80°C. The cells should be treated with a concentration of 10 μM enzalutamide for subsequent experiments. To remove the influence of androgens in the culture medium, cells should be cultured in a medium containing 5%–10% FBS‐CSS for 3 days prior to enzalutamide treatment. Subsequently, enzalutamide should be added to the cells in the same medium with 5%–10% FBS‐CSS and incubated for 24 h.  31 The PI3K inhibitor LY294002 was purchased from Abcam (Catalog number: ab120243). It was dissolved in dimethyl sulfoxide (DMSO) as a 25 mM stock solution according to the manufacturer's instructions and stored at 4°C. Cells were treated with a concentration of 10 μM for 24 h for subsequent experiments.  32 SC79 was obtained from MedChemExpress (Catalog number: HY‐18749). Enzalutamide was dissolved in DMSO as per the instructions, stored at −80°C, and cells were treated with a concentration of 4 μg/mL for 24 h before subsequent experiments.  33 The groups for lentiviral infection of cells and drug treatment were as follows: LNCaP cells: sh‐NC, sh‐HIC1‐1, sh‐HIC1‐2, oe‐NC, oe‐AR, oe‐AR+sh‐IRS1, oe‐AR+sh‐IRS2, sh‐HIC1+LY294002 (10 μM), oe‐AR+LY294002 (10 μM), oe‐AR+NT157 (5 μM), Enzalutamide (10 μM), sh‐HIC1+NT157 (5 μM), NC, SC79 (4 μg/mL); VCaP cells: oe‐NC, oe‐HIC1, oe‐HIC1+oe‐AR, sh‐NC, sh‐AR‐1, sh‐AR‐2; LNCaP‐AI cells: oe‐NC, oe‐HIC1, Enzalutamide (10 μM). 2.4 Dual luciferase assay Human embryonic kidney HEK293T cells (iCell‐h237, Cyagen Biosciences) and human prostate cancer cell line (VCaP) were cultured in DMEM medium containing 10% fetal bovine serum at 37°C with 5% CO2. The cDNA fragment of IRS2 containing the AR binding site (IRS2‐WT: GAGGACAGTGGGTAC) was inserted into the pmirGLO vector. Mutant IRS2 cDNA fragment (IRS2‐MUT: GTCCACTCAGGGATG) was synthesized using site‐directed mutagenesis and inserted into the pmirGLO vector. Lipofection was used to co‐transfect HEK293T cells and VCaP cells with recombinant vectors carrying IRS2‐WT or IRS2‐MUT together with oe‐AR or oe‐NC. After transfection, cells were incubated for 48 h and assessed using the Biovision luciferase assay kit (K801‐200). The detection of luciferase reporter gene activity was performed with the Promega Dual‐Luciferase Reporter Assay System (E1910). Renilla luciferase was used as an internal control gene, and the activation level of the target reporter gene was determined by calculating the ratio of firefly luciferase values (RLU) to Renilla luciferase values (RLU).  34 2.5 ChIP Once the cell fusion reached a level of 70%–80%, formaldehyde was added at a concentration of 1% to fix the cells at room temperature for 10 min. This process was carried out in order to crosslink and stabilize the DNA and proteins within the cells. After crosslinking, the fragmented samples were treated with ultrasound. Each ultrasound treatment lasted for 10 s, with a 10‐s interval between each treatment. This cycle was repeated 15 times to achieve the desired fragmentation of the samples. The samples were then subjected to centrifugation at 12,000 xg at 4°C, and the resulting supernatant was collected and divided into two tubes. The supernatant in each tube was separately incubated overnight at 4°C with two different antibodies: rabbit anti‐IgG (1:100, Abcam, ab172730) as the negative control antibody and anti‐AR antibody (Abcam, ab108341) specific to the target protein. Protein Agarose/Sepharose was used to precipitate the endogenous DNA‐protein complexes. The supernatant was then discarded after a brief centrifugation, and non‐specific complexes were washed. Decrosslinking was performed by overnight incubation at 65°C. Finally, DNA fragments were obtained by extraction and purification using a phenol/chloroform solution. The ChIP‐qPCR products underwent qualitative analysis using 3% agarose gel electrophoresis (Table S2  35 2.6 Co‐IP validation of HIC1 and AR protein interaction For immunoprecipitation, the Pierce™ Co‐Immunoprecipitation Kit (26149, Thermo Fisher Scientific, Waltham, MA, USA) was utilized following the manufacturer's instructions. The lysates containing 1 μg of total protein were precleaned with an appropriate homologous IgG antibody (ab6721, 1:2000). Subsequently, the lysates were mixed with 2 mg of anti‐HIC1 or anti‐AR antibodies (Table S3  36 2.7 RT‐qPCR Total RNA was extracted from cells and tissues using Trizol (Catalog number: 16096020, purchased from Thermo Fisher Scientific). The concentration and purity of RNA were subsequently measured using Thermo Scientific's NanoDrop One/OneC microvolume nucleic acid and protein concentration meter. The A260/A280 ratio was 2.0, indicating a concentration above 5 μg/μL. For cDNA synthesis, the cDNA first strand synthesis kit (catalog number: D7168L) from Shanghai Beyotime was used. RT‐qPCR experiments were conducted using the RT‐qPCR kit (catalog number: Q511‐02) from Vazyme Biotech in Nanjing, following the instructions in the manual. During the experiment, 2 μL of cDNA template was mixed with 0.2 μL of upstream and downstream primers. This mixture was then added to 10 μL of RT‐qPCR Mix, and the total volume was adjusted to 20 μL with RNase‐free water. PCR amplification was performed using the Bio‐rad CFX96 real‐time quantitative PCR instrument. The reaction conditions comprised pre‐denaturation at 95°C for 30 s, denaturation at 95°C for 10 s, annealing at 60°C for 30 s, and extension at 72°C for 30 s, repeated for 40 cycles. The melting curve range was set between 65°C and 95°C. The primer sequences were designed and provided by Shanghai Bioengineering Co., Ltd. in Shanghai, China. The reference sequence for the primers can be found in Table S4  37 2.8 Western blot To extract total proteins from cells and lyse tissues, RIPA lysis buffer (P0013B, Beyotime) containing 1% PMSF was added. The concentration of total protein in each sample was determined using the BCA assay kit (P0011, Beyotime). In order to accommodate the size of the target protein bands, it is recommended to prepare SDS gels with a concentration of 8%–12%. Equal amounts of protein samples were then added into each lane for electrophoretic separation using a pipette. Protein transfer from the gel to a polyvinylidene difluoride (PVDF) membrane (1620177, BIO‐RAD, USA) was followed by blocking with 5% skim milk at room temperature for 1 h. Incubation at 4°C overnight with Table S3  38 2.9 CCK‐8 The cells were enzymatically dissociated and resuspended, and the cell concentration was adjusted to 1 × 10 3  35 2.10 EdU labeling is used to detect cell proliferation rate The cells were inoculated into a 24‐well plate, with three wells specifically designated for replication within each cell group. To achieve a concentration of 10 μmol/L, EDU ( C10310  39 2.11 Transwell assay The in vitro cell invasion assay employed Transwell chambers with an 8 μm pore size (Corning). These chambers consist of a polycarbonate membrane containing Matrigel and are preloaded with 600 mL of culture medium containing fetal bovine serum (FBS) in the lower chamber. After equilibration at 37°C for 1 h, cells were resuspended in FBS‐free DMEM culture medium at a density of 2 × 10 4 2  40 2.12 Cloning formation experiment In cloning experiments, the cells under investigation are initially broken down into single‐cell suspensions. Afterward, 1000 cells were individually placed into culture dishes measuring 6 cm in diameter. To prepare the culture dishes, an appropriate complete medium should be added, and this medium should be replaced every 3 days. Next, the cells are rinsed with PBS and then fixed using 4% paraformaldehyde. Following fixation for 15 min, the cells are stained with 0.4% crystal violet. Colonies containing more than 10 cells are manually counted, and the average count is determined from duplicate wells for statistical analysis.  41 2.13 Experiment to form a sphere After harvesting and enumerating the cells, they should be transferred to a cell culture plate with a low attachment surface. To each well, 2.5 mL of Complete MammoCult™ Human Culture Medium should be added. The culture dish should then be relocated to a 5% CO 2  42 2.14 PCa mouse orthotopic tumor experiment Eighty male immunodeficient nude mice (BALB/c, nu/nu), aged 4–5 weeks, were obtained from Beijing Vital River Laboratory Animal Technology Co., Ltd. in Beijing, China. The mice were housed under non‐pathogenic conditions at a temperature of 26–28°C and a humidity range of 50%–65%. All animal experiments were conducted in adherence to ethical guidelines and received approval from our Institutional Animal Ethics Committee. For sequencing, we implanted two million RM‐1 cells that were fluorescently labeled into the dorsal lobe of the prostate in the mice. D‐fluorescein (150 mg/kg) was injected weekly to monitor tumor growth. After 4 weeks of tumor growth, we collected prostate tissues for sequencing. For in vivo experiments, we implanted 3 × 10 6 The drugs or surgical treatment methods used in this study were as follows: EPI‐7170 treatment involved daily oral administration of EPI‐7170 (30 mg/kg). The EPI‐7170 used in the study was purchased from MedChemExpress (catalog number 150102).  43 Blood samples were obtained weekly from the mouse retro‐orbital sinus using a capillary tube. The collected blood was then centrifuged at 1000 rpm to separate the serum. PSA levels were detected using the PSA ELISA kit (catalog number E‐EL‐M0961c, Elabscience) or through weight measurements. Data collection for a group was ceased if the number of mice fell below 6.  44 2.15 Immunohistochemical experiment The tissue sample was collected for detection and fixed with formalin, following which paraffin sections measuring 4 μm thick were prepared. Subsequently, the standard immunohistochemical staining methods were employed to deparaffinize and perform the procedure. In this study, the following antibodies were utilized: Mouse anti‐HIC1 (sc271499; 1:50), Rabbit anti‐Ki67 (ab16667; 1:200), Rabbit anti‐Cleaved caspase‐3 (CST, 9661; 1:400), and Rabbit anti‐Prostate‐specific antigen (ab76113; 1:1000). The antibodies were incubated overnight in a dark room. On a subsequent day, they were incubated with the corresponding secondary antibodies, namely the goat anti‐rabbit IgG antibody (ab6721, 1:1000, Abcam, UK) or goat anti‐mouse IgG antibody (ab6789, 1:1000, Abcam), for a duration of 30 min. Streptavidin‐Biotin Complex (SABC) from Vector Company, USA, was then added and incubated at a temperature of 37°C for 30 min. Drops of the color‐developing reagent from the DAB Color Development Kit (P0203, Beyotime Biotechnology) were applied to the specimen and left to develop for 6 min to facilitate the development of color. Subsequently, the sample was stained with safranin solution for 30 s, followed by sequential immersion in ethanol concentrations of 70%, 80%, 90%, and 95%, and finally, absolute ethanol, with each immersion lasting 2 min, to aid in dehydration. To complete the process, the specimen underwent two rounds of transparent treatment, each lasting 5 min, using xylene. It was then sealed with neutral resin. Finally, observation was carried out using a brightfield microscope (BX63, Olympus, Japan). The staining results will be analyzed utilizing ImageJ software for quantification of grayscale intensity and estimation of protein expression.  45 2.16 Hematoxylin and eosin (H&E) staining Tumor tissues embedded in paraffin were sectioned at 4 μm, deparaffinized in xylene, and rehydrated through a series of ethanol gradients. The sections were then rinsed in 1 × PBS and stained with hematoxylin and eosin (H&E; Beyotime; C0105). Subsequently, the sections were dehydrated in increasing concentrations of ethanol and xylene, and observed under a bright‐field microscope (BX63, Olympus).  46 2.17 Statistical analysis Statistical analysis for the bioinformatics findings in our study was carried out using R version 4.2.1, whereas analysis of the remaining results was done with SPSS version 26.0 (IBM). Measurement data is conventionally represented as the mean value ± standard deviation. To begin, tests for normality and homoscedasticity should be conducted. In cases where the data follows a normal distribution and has equal variances, either an independent samples t t P 3 RESULTS 3.1 Identification and implication of HIC1 downregulation in prostate cancer progression Prostate cancer (PCa) is prevalent in Western countries, posing challenges for treatment due to its non‐obvious early symptoms, drug resistance, and complex prognostic factors.  47 n n P 1A 1B S1A 1C S1B  48  49 S1C‐D  50  51  52  53 1D 1D–F FIGURE 1 Expression of HIC1 in normal mouse prostate and PCa xenograft prostate tissues. (A) Volcano plot of differentially expressed genes in the Normal group ( n n n n P P 3.2 HIC1 inhibits prostate cancer progression by downregulating AR expression and activity Previous studies have demonstrated that HIC1 enhances the transcriptional activity of the tumor suppressor gene p53 by inhibiting the cellular stress‐responsive protein SIRT1.  54  55  56  57 To investigate the regulatory role of HIC1 on AR, we initially assessed the expression of HIC1 and AR in human and murine prostate cancer cell lines (including VCaP, PC3, DU145, LNCaP, and RM‐1 cells). Our findings revealed that HIC1 exhibited lower expression levels in VCaP and LNCaP cells, while it was relatively higher in DU145, PC‐3, and RM‐1 cells, contrasting with the expression pattern of AR (Figure 2A,B FIGURE 2 Impact of HIC1 expression on AR expression and cell proliferation and invasion ability in PCa cells. (A and B) mRNA (A) and protein (B) expression of HIC1 and AR in VCaP, PC3, DU145, LNCaP, and RM‐1 PCa cells; (C) CCK‐8 assay to measure the effect of HIC1 silencing and overexpression on cell growth activity; (D) EdU labeling to assess the effect of HIC1 silencing and overexpression on cell proliferation ability (scale bar = 50 μm); (E) clonogenic assay to examine the impact of HIC1 silencing and overexpression on cell proliferation ability; (F) transwell invasion assay to evaluate the effect of HIC1 silencing and overexpression on cell invasion and migration ability (scale bar = 50 μm); (G) sphere formation assay to assess the influence of HIC1 silencing and overexpression on cell self‐renewal and stemness (scale bar = 100 μm); (H and I) RT‐qPCR (H) and Western blot (I) to measure the expression levels of EMT‐related proteins in cells following HIC1 silencing and overexpression; (J and K) mRNA (J) and protein (K) expression of HIC1 and AR in LNCaP cells after HIC1 silencing; (L and M) mRNA (L) and protein (M) expression of AR in VCaP cells after HIC1 overexpression; All cell experiments were repeated three times; ** P To assess the effects of HIC1 on prostate cancer cells, we performed lentivirus infection to induce knockdown and overexpression of HIC1 in LNCaP and VCaP cells. The efficacy of knockdown and overexpression was confirmed through RT‐qPCR and Western blot techniques. Our results demonstrated that sh‐HIC1‐1 and sh‐HIC1‐2 effectively knocked down HIC1 (Figure S2A,B S2C,D Subsequently, we evaluated the effects of HIC1 on the proliferation, migration, invasion, and colony formation of prostate cancer cells using CCK‐8, EdU, invasion experiments, and colony formation assays. Our findings revealed that HIC1 suppression enhanced the growth, proliferation, and invasiveness of prostate cancer cells, while upregulation of HIC1 inhibited these characteristics (Figure 2C–F 2G 2H–I We then examined the changes in AR expression after intervening in HIC1 expression. Our RT‐qPCR and Western blot analyses demonstrated that downregulation of HIC1 increased AR expression, while overexpression of HIC1 suppressed AR levels (Figure 2J–M S2E,F S2G–K In summary, our results indicate that overexpression of HIC1 decreases AR expression, leading to reduced growth, proliferation, and metastatic potential of prostate cancer cells. 3.3 HIC1 regulates prostate cancer progression via the AR/IRS2/PI3K/AKT signaling pathway In order to investigate the mechanism of HIC1 deletion in the progression of PCa further, we conducted an expression correlation analysis on 94 differentially expressed genes (DEGs) in PCa. Our analysis revealed multiple correlations among these genes (Figure S3A  30 IRS2 plays a role in tumor development through the PI3K/AKT pathway.  58 S3B S3C Based on the information above, we propose that HIC1 potentially controls the proliferation and invasion of cancer cells by regulating AR expression and subsequently modulating the IRS2/PI3K/AKT pathway. To further support this hypothesis, we confirmed the transcriptional regulatory function of AR in PCa cells with respect to IRS2. We utilized the JASPAR website to predict the binding sites of AR to the promoter regions of IRS2, as illustrated in Figure 3A 3B FIGURE 3 As a transcription factor for IRS2, AR affects the activation of the PI3K/AKT signaling pathway. (A) Prediction of binding sites of AR and IRS2 promoter using JASPAR website; (B) validation of binding sites of AR and IRS2 promoter using a luciferase reporter gene; (C) ChIP assay to verify the interaction of predicted binding sites between AR and IRS2 promoter regions; (D) investigation of the effect of NT157 on IRS2 expression and PI3K/AKT activation in LNCaP cells after AR overexpression; (E) CCK‐8 assay to measure the impact of NT157 on cell proliferation ability in VCaP cells after AR overexpression; (F) EdU labeling to observe the effect of NT157 on cell proliferation ability in VCaP cells after AR overexpression (scale bar = 50 μm); (G) clonogenic assay to evaluate the effect of NT157 on cell proliferation ability in VCaP cells after AR overexpression; (H) transwell assay to measure the effect of NT157 on cell invasion ability in VCaP cells after AR overexpression (scale bar = 100 μm); (I) sphere formation assay to examine the effect of NT157 on cell self‐renewal and stemness in VCaP cells after AR overexpression (scale bar = 25 μm); All cell experiments were repeated three times; ns P P P Furthermore, we conducted chromatin immunoprecipitation (ChIP) experiments using AR and GAPDH antibodies on lysates obtained from VCaP cells, with IgG used as the control. The results revealed the presence of amplified binding sites (Figure 3C Moreover, we utilized VCaP cell lines to generate stable transgenic strains in which the AR gene was silenced. The knockdown effect of AR was assessed using RT‐qPCR and Western blot analysis. The results demonstrate a knockdown effect for sh‐AR‐1 and sh‐AR‐2 (Figure S4A,B S4C  30 Treatment with NT157 inhibited the expression levels of IRS2, N‐cadherin, and Vimentin in AR‐overexpressing LNCaP cells (constructed earlier; see Figure 3D 3E–I S4D Expression levels of IRS2 and the activation status of the PI3K/AKT pathway were subsequently examined by Western blot in cells with silenced or overexpressed HIC1 (Figure S4E S4F S4G S5A S5C,D S5B, S5E,F S5G–I Our findings suggest that the AR functions as a transcription factor for IRS2 downstream of HIC1. This process promotes the expression levels of IRS2 and activates the PI3K/AKT signaling axis, ultimately enhancing the growth and invasive potential of PCa cells. 3.4 HIC1 overexpression inhibits castration resistance and attenuates aggressive behavior in PCa cells The development of PCa into castration resistance represents the culmination of clinical treatment, as cancer cells persist in their growth and metastasis, ultimately leading to reduced patient survival.  59 4A,B FIGURE 4 The impact of HIC1/AR/IRS2 on the development of castration resistance in PCa cells. (A) Western blot analysis of AR and PSA expression levels in cells; (B) assessment of cell sensitivity to Enzalutamide treatment as an AR antagonist; (C) western blot analysis of AR/IRS2/PI3K/AKT activation and detection of castration resistance through PSA expression; (D) RT‐qPCR analysis of AR/IRS2 mRNA expression levels in cells; (E) CCK‐8 assay to measure cell growth activity after HIC1 overexpression; (F) EdU labeling to evaluate cell proliferation ability after HIC1 overexpression (scale bar = 25 μm); (G) clonogenic assay to assess cell proliferation ability after HIC1 overexpression; (H) sphere formation assay to measure cell self‐renewal and stemness after HIC1 overexpression (scale bar = 25 μm); (I) transwell invasion assay to analyze cell invasion and migration ability after HIC1 overexpression (scale bar = 50 μm); All cell experiments were repeated three times; nsP > 0.05, ** P Subsequent treatment experiments were conducted using the AR antagonist Enzalutamide. The results indicated that LNCaP‐AI exhibited no response to the treatment, confirming the successful establishment of our castration‐resistant cell model, LNCaP‐AI. Notably, castration resistance is characterized by androgen‐independent and hormone‐refractory features. Overexpression of the HIC1 gene weakened the castration resistance of LNCaP‐AI cells, leading to a significant decrease in AR and PSA expression levels. Additionally, there was a reduction in the activation of the IRS2/PI3K/AKT signaling pathway (Figure 4C,D Moreover, the results obtained from the CCK‐8, EdU assay, flat plate cloning assay, sphere formation assay, and Transwell assay collectively demonstrated a decrease in the proliferative, invasive, and stem cell‐like properties of LNCaP‐AI cells with HIC1 overexpression (Figure 4E–I In conclusion, our research suggests that HIC1 may have the potential to suppress the development of castration‐resistant PCa cells. 3.5 HIC1 modulates prostate cancer growth, metastasis, and castration resistance via the AR/IRS2/PI3K/AKT axis in vivo mouse models This study utilized an in vivo mouse model to comprehensively investigate the impact of HIC1 on the proliferation, invasion, and development of castration resistance in PCa. We injected fluorescently labeled HIC1 silenced (LNCaP‐sh‐HIC1) cell line and control group (LNCaP‐sh‐NC) into the prostate lobe and administered the treatment according to the described methods. This included orally administering the AR inhibitor EPI‐7170 (at a daily dose of 30 mg/kg) and intraperitoneally administering the IRS2 inhibitor NCT157 (at a dose of 50 mg/kg, three times weekly). Tumor growth was assessed through palpation every other day and monitored weekly using non‐invasive in vivo bioluminescence imaging. Mice injected with PCa cells exhibited a 100% tumor incidence. Tumors in the group with low HIC1 expression showed accelerated growth, whereas tumors in the groups treated with EPI‐7170 and NT157 displayed slower growth after HIC1 silencing (Figure 5A FIGURE 5 Impact of HIC1 on PCa tumor growth through the AR/IRS2 axis. (A) Observation of tumor growth in LNCaP‐sh‐HIC1 and EPI‐7170, NT157‐treated mice with orthotopic prostate xenografts; (B and C) western blot (B) and RT‐qPCR (C) to measure protein and RNA expression levels of relevant molecules in LNCaP‐sh‐HIC1 and EPI‐7170, NT157‐treated orthotopic prostate xenografts; (D) immunohistochemical analysis of Ki‐67, Cleaved‐caspase‐3, and Vimentin expression in prostate tissues of LNCaP‐sh‐HIC1 and EPI‐7170, NT157‐treated orthotopic prostate xenografts (scale bar = 100 μm); (E) quantification of PSA in serum of LNCaP‐sh‐HIC1 and EPI‐7170, NT157‐treated orthotopic prostate xenograft models; (F) immunohistochemical evaluation of PSA expression in LNCaP‐sh‐HIC1 and EPI‐7170, NT157‐treated orthotopic prostate xenografts (scale bar = 50 μm); (G) observations of body weight changes in LNCaP‐sh‐HIC1 and EPI‐7170, NT157‐treated mice ( n P In this study, we evaluated the expression levels of HIC1, AR, IRS2, and EMT‐related proteins, as well as the activation status of the PI3K/AKT pathway in PCa mouse tumor tissue using RT‐qPCR and Western blot experiments. Figure 5B,C To further investigate the impact of HIC1/AR/IRS2 on the proliferation and metastasis of PCa cells, we conducted immunohistochemical analysis on PCa xenograft tumor slices. This analysis included markers for cell proliferation (Ki‐67), apoptosis (Cleaved caspase‐3), and epithelial‐to‐mesenchymal transition (Vimentin). As shown in Figure 5D The serum level of Prostate‐Specific Antigen (PSA) can serve as an indicator for the recurrence of PCa. During our weekly monitoring of PSA levels in mice with PCa, we observed that as the tumor grew, PSA levels increased. However, the administration of EPI‐7170 and NT157 decreased PSA levels in mice with low HIC1 expression, as shown in Figure 5E 5F 5G Interestingly, the overexpression of HIC1 had the opposite effect. It decreased the expression of the AR/IRS2/p‐PI3K/p‐AKT axis in prostate tissue, inhibited the growth of PCa xenograft tumors, and reduced the level of PSA expression (Figure S6A–E To examine the impact of HIC1/AR/IRS2 on the progression of castration‐resistant prostate cancer, we injected HIC1‐silenced cells (LNCaP‐sh‐HIC1) and a control group (LNCaP‐sh‐NC) labeled with fluorescence into the posterior lobe of the prostate. When the tumor growth in the low‐expression HIC1 group reached 300 mm3, the mice were castrated and randomly assigned to either the EPI‐7170 or NT157 group. EPI‐7170 was administered orally once daily at a dose of 30 mg/kg, while NT157 was administered via intraperitoneal injection three times a week at a dose of 50 mg/kg. Tumor growth was monitored using non‐invasive in vivo bioluminescence imaging. The results demonstrate that castration treatment was ineffective in the low‐expression HIC1 group compared to the sh‐NC group, whereas the average tumor volume decreased in the EPI‐7170 and NT157 treatment groups (Figure 6A 6B 6C FIGURE 6 HIC1 influences castration resistance in PCa tumors through the AR/IRS2 axis. (A) Tumor growth of LNCaP‐sh‐HIC1, EPI‐7170, and NT157‐treated xenografts after castration resistance therapy in mice. (B) serum PSA levels of LNCaP‐sh‐HIC1, EPI‐7170, and NT157‐treated xenografts after castration resistance therapy in mice. (C) changes in body weight of LNCaP‐sh‐HIC1, EPI‐7170, and NT157‐treated xenograft mice after castration resistance therapy. ( n P In conclusion, HIC1 plays a critical role in suppressing the proliferation, metastasis, and castration resistance of prostate cancer cells in an in situ mouse model. It achieves this by influencing the regulation of the AR on the IRS2/PI3K/AKT signaling axis. 4 DISCUSSION This study employed high‐throughput transcriptome sequencing analysis to identify a decrease in the expression of the tumor suppressor HIC1 in prostate cancer cells. These findings align with previous research, which has emphasized the inhibitory role of HIC1 in various tumor types.  19  60  61 The outcomes of the experiments conducted on prostate cancer cells demonstrate the influence of HIC1 expression on cell growth, proliferation, invasion, and stemness, aligning with its role in other types of cancer.  20 Furthermore, the inhibition of IRS2 by NT157 effectively counteracted the enhanced cell proliferation and invasive capacity resulting from AR overexpression and activation of the PI3K/AKT pathway. These findings offer promising targets for the development of drugs for prostate cancer treatment in the future. Castration therapy is a frequently employed treatment for prostate cancer, but as treatment advances, patients may develop castration resistance, posing challenges in clinical practice.  62  63  64 We created a mouse model of prostate cancer and observed that silencing HIC1 increased the expression levels of Ki‐67, Cleaved‐caspase‐3, and EMT‐related proteins in prostate cancer cells. Additionally, the levels of PSA in serum and tissue were also elevated. These in vivo experiments further strengthen the evidence supporting the role of HIC1 in prostate cancer progression. Based on the aforementioned experimental results, several preliminary conclusions can be drawn. Firstly, the expression of HIC1 in PCa tissues is decreased compared to normal prostate tissue, resulting in an upregulation of AR levels. Moreover, the overexpression of AR promotes the transcription of IRS2, subsequently activating the PI3K/AKT signaling pathway and promoting the progression of PCa. Additionally, our findings indicate a strong correlation between HIC1 and resistance to castration therapy in PCa. We observed the inhibition of castration‐resistant PCa progression in vitro and in vivo following HIC1 overexpression. This inhibitory mechanism is mediated by the AR/IRS2/PI3K/AKT signaling pathway (Figure 7 FIGURE 7 HIC1 inhibits AR expression to suppress the development of castration‐resistant prostate cancer through the IRS2/PI3K/AKT axis. Firstly, the downregulated expression of HIC1 can serve as a biomarker for prostate cancer, enhancing the early detection rate of the disease. Moreover, the inhibitory effects of HIC1 on PCa cell proliferation and invasion, along with its potential to decrease castration resistance, suggest that HIC1 could be a promising therapeutic target for prostate cancer, opening up new avenues for clinical treatment. Our comprehensive study on the AR/IRS2/PI3K/AKT axis also provides theoretical support for the development of more effective treatment strategies for prostate cancer. Although our research has yielded some significant achievements, certain limitations still need to be addressed. Firstly, our experiments primarily utilized mouse models, and further studies are necessary to validate the complete applicability of the results to human conditions. Furthermore, while our research has demonstrated the potential of HIC1 in inhibiting the AR/IRS2 axis and suppressing PCa proliferation, invasion, and castration resistance, the precise mechanism by which HIC1 regulates this axis and the detailed molecular processes involved remain to be fully understood. Therefore, further investigation is necessary. Additionally, more research is needed to explore HIC1 as a potential therapeutic target, including evaluating its efficacy, safety, and potential for drug resistance. Our research has provided novel insights into the pathogenesis and clinical management of prostate cancer. In the future, we aim to delve deeper into the specific molecular mechanisms by which HIC1 inhibits the AR/IRS2 axis, enabling us to identify more precise intervention points and enhance the targetedness and effectiveness of treatment. Moreover, we aim to examine the viability of HIC1 as a biomarker by conducting extensive clinical trials to enhance early detection rates for prostate cancer. Lastly, we plan to conduct clinical trials to assess the effectiveness and safety of a new treatment approach targeting HIC1, offering improved treatment alternatives for patients with prostate cancer. AUTHOR CONTRIBUTIONS  Dun Xue Long Tan Fengshuai Yang Xiaolan Tian Qian Zuo Xinghui Wu CONFLICT OF INTEREST STATEMENT The author declares no conflict of interest. ETHICS STATEMENT All experiments involving mice were approved by the Animal Ethics Committee of the First Hospital of Changsha. Supporting information Supporting Information S1 Figure S1 Figure S2 Figure S3 Figure S4 Figure S5 Figure S6 ACKNOWLEDGMENTS None. DATA AVAILABILITY STATEMENT The datasets generated and/or analyzed during the current study are available from the corresponding author on reasonable request. REFERENCES 1 Liu Pengyu Wenxuan Wang Fei Wang Jiaqi Fan Jinan Guo Tao Wu Dongliang Lu 2023 Alterations of Plasma Exosomal Proteins and Motabolies are Associated with the Progression of Castration‐Resistant Prostate Cancer Journal of Translational Medicine 21 1 40 10.1186/s12967-022-03860-3 36681849 PMC9867857 2 Miller Kimberly D. Leticia Nogueira Theresa Devasia Angela B. Mariotto K. Robin Yabroff Ahmedin Jemal Joan Kramer Rebecca L. Siegel 2022 Cancer Treatment and Survivorship Statistics, 2022 CA: A Cancer Journal for Clinicians 72 5 409 436 10.3322/caac.21731 35736631 3 McKay Rana R. Felix Y. Feng Alice Y. Wang Christopher J. D. Wallis Kelvin A. Moses 2020 Recent Advances in the Management of High‐Risk Localized Prostate Cancer: Local Therapy, Systemic Therapy, and Biomarkers to Guide Treatment Decisions American Society of Clinical Oncology Educational Book. American Society of Clinical Oncology. Annual Meeting 40 1 12 10.1200/EDBK_279459 PMC10182417 32412803 4 Desai Kunal Jeffrey M. McManus Nima Sharifi 2021 Hormonal Therapy for Prostate Cancer. Endocrine reviews 42 3 354 373 10.1210/endrev/bnab002 33480983 PMC8152444 5 Sekhoacha Mamello Keamogetswe Riet Paballo Motloung Lemohang Gumenku Ayodeji Adegoke Samson Mashele 2022 Prostate Cancer Review: Genetics, Diagnosis, Treatment Options, and Alternative Approaches Molecules 27 17 5730 10.3390/molecules27175730 36080493 PMC9457814 6 Achard Vérane Paul Martin Putora Aurelius Omlin Thomas Zilli Stefanie Fischer 2022 Metastatic Prostate Cancer: Treatment Options Oncology 100 1 48 59 10.1159/000519861 34781285 7 Chi Kim N. Simon Chowdhury Anders Bjartell Byung Ha Chung Andrea J. Pereira de Santana Gomes Robert Given Alvaro Juárez 2021 Apalutamide in Patients with Metastatic Castration‐Sensitive Prostate Cancer: Final Survival Analysis of the Randomized, Double‐Blind, Phase III TITAN Study Journal of Clinical Oncology : Official Journal of the American Society of Clinical Oncology 39 20 2294 2303 10.1200/JCO.20.03488 33914595 8 Thiery‐Vuillemin Antoine Johann de Bono Maha Hussain Guilhem Roubaud Giuseppe Procopio Neal Shore Karim Fizazi 2022 Pain and Health‐Related Quality of Life with Olaparib versus Physician's Choice of Next‐Generation Hormonal Drug in Patients with Metastatic Castration‐Resistant Prostate Cancer with Homologous Recombination Repair Gene Alterations (PROfound): an Open‐Label, Randomised, Phase 3 Trial The Lancet Oncology 23 3 393 405 10.1016/S1470-2045(22)00017-1 35157830 9 Saad Fred Antoine Thiery‐Vuillemin Pawel Wiechno Boris Alekseev Nuria Sala Robert Jones Ivo Kocak 2022 Patient‐Reported Outcomes with Olaparib Plus Abiraterone versus Placebo Plus Abiraterone for Metastatic Castration‐Resistant Prostate Cancer: A Randomised, Double‐Blind, Phase 2 Trial The Lancet Oncology 23 10 1297 1307 10.1016/S1470-2045(22)00498-3 36063830 10 He Z.‐Xu J.‐Ling Huo Y.‐Peng Gong Qi An Xin Zhang Hui Qiao F.‐Fei Yang 2021 Design, Synthesis and Biological Evaluation of Novel Thiosemicarbazone‐Indole Derivatives Targeting Prostate Cancer Cells European Journal of Medicinal Chemistry 210 112970 10.1016/j.ejmech.2020.112970 33153765 11 Lyu Feng S.‐Yu Shang X.‐Shu Gao M.‐Wei Ma Mu Xie X.‐Ying Ren M.‐Zhu Liu J.‐Yan Chen S.‐Shi Li Lei Huang 2023 Uncovering the Secrets of Prostate Cancer's Radiotherapy Resistance: Advances in Mechanism Research Biomedicines 11 6 1628 10.3390/biomedicines11061628 37371723 PMC10296152 12 Lv Shidong Qiong Song Guang Chen Erdong Cheng Wei Chen Ryan Cole Zeyu Wu 2021 Regulation and Targeting of Androgen Receptor Nuclear Localization in Castration‐Resistant Prostate Cancer The Journal of Clinical Investigation 131 4 e141335 10.1172/JCI141335 33332287 PMC7880411 13 Park Hyung Kyu So Dug Lim Ghee Young Kwon 2019 mRNA Expressions of Androgen Receptor and its Variants in Matched Hormone‐Sensitive and Castration‐Resistant Prostate Cancer Scandinavian Journal of Urology 53 6 365 371 10.1080/21681805.2019.1697359 31809622 14 Li Yanjing Yuanlin Tang Sirong Shi Shaojingya Gao Yun Wang Dexuan Xiao Tianyu Chen Qing He Junjiang Zhang Yunfeng Lin 2021 Tetrahedral Framework Nucleic Acids Ameliorate Insulin Resistance in Type 2 Diabetes Mellitus via the PI3K/Akt Pathway ACS Applied Materials and Interfaces 13 34 40354 40364 10.1021/acsami.1c11468 34410099 15 Shorning Boris Y. Manisha S. Dass Matthew J. Smalley Helen B. Pearson 2020 The PI3K‐AKT‐mTOR Pathway and Prostate Cancer: At the Crossroads of AR, MAPK, and WNT Signaling International Journal of Molecular Sciences 21 12 4507 10.3390/ijms21124507 32630372 PMC7350257 16 Gupta Smriti Kamalendra Yadav Shrikant S. Mantri Nitin K. Singhal Subramaniam Ganesh Rajat Sandhir 2018 Evidence for Compromised Insulin Signaling and Neuronal Vulnerability in Experimental Model of Sporadic Alzheimer's Disease Molecular Neurobiology 55 12 8916 8935 10.1007/s12035-018-0985-0 29611103 17 Hermida Miguel A. J. Dinesh Kumar Nick R. Leslie 2017 GSK3 and its Interactions with the PI3K/AKT/mTOR Signalling Network Advances in Biological Regulation 65 5 15 10.1016/j.jbior.2017.06.003 28712664 18 Hashemi Mehrdad Afshin Taheriazam Pouria Daneii Aria Hassanpour Amirabbas kakavand Shamin Rezaei Elahe Sadat Hejazi 2023 Targeting PI3K/Akt Signaling in Prostate Cancer Therapy Journal of Cell Communication and Signaling 17 3 423 443 10.1007/s12079-022-00702-1 36367667 PMC10409967 19 Dubuissez Marion Sonia Paget Souhila Abdelfettah Nathalie Spruyt Vanessa Dehennaut Gaylor Boulay Ingrid Loison 2020 HIC1 (Hypermethylated in Cancer 1) Modulates the Contractile Activity of Prostate Stromal Fibroblasts and Directly Regulates CXCL12 Expression Oncotarget 11 45 4138 4154 10.18632/oncotarget.27786 33227080 PMC7665237 20 Wu Tianqi Wenfeng Wang Guohai Shi Mingang Hao Yingying Wang Mengfei Yao Yongqiang Huang 2022 Targeting HIC1/TGF‐β Axis‐Shaped Prostate Cancer Microenvironment Restrains its Progression Cell Death & Disease 13 7 624 10.1038/s41419-022-05086-z 35853880 PMC9296670 21 Zheng Jianghua J. Wang Jinglong Wang Mingang Hao Tao Ding Dan Xiong Xiumin Wang 2013 HIC1 Modulates Prostate Cancer Progression by Epigenetic Modification Clinical Cancer Research: An Official Journal of the American Association for Cancer Research 19 6 1400 1410 10.1158/1078-0432.CCR-12-2888 23340301 22 Arunachalam Divya Shruthi Mahalakshmi Ramanathan Athul Menon Lekshmi Madhav Gopalakrishna Ramaswamy Venkatesh Prajna Namperumalsamy Lalitha Prajna Dharmalingam Kuppamuthu 2022 Expression of Immune Response Genes in Human Corneal Epithelial Cells Interacting with Aspergillus Flavus Conidia BMC Genomics 23 1 5 10.1186/s12864-021-08218-5 34983375 PMC8728928 23 Linkner Tamás Richárd Viktor Ambrus Balázs Kunkli Zsófia Ilona Szojka Gergő Kalló Éva Csősz Ajneesh Kumar Miklós Emri József Tőzsér Mohamed Mahdi 2021 Cellular Proteo‐Transcriptomic Changes in the Immediate Early‐phase of Lentiviral Transduction Microorganisms 9 11 2207 10.3390/microorganisms9112207 34835333 PMC8625573 24 Deng Ya‐Jun En‐Hui Ren W.‐Hua Yuan G.‐Zhi Zhang Z.‐Long Wu Qi‐Qi Xie 2020 GRB10 and E2F3 as Diagnostic Markers of Osteoarthritis and Their Correlation with Immune Infiltration Diagnostics 10 3 171 10.3390/diagnostics10030171 32235747 PMC7151213 25 Peng X.‐Yan Yong Wang Haibo Hu X.‐Jin Zhang Qi Li 2019 Identification of the Molecular Subgroups in Coronary Artery Disease by Gene Expression Profiles Journal of Cellular Physiology 234 9 16540 16548 10.1002/jcp.28324 30805932 26 Halkidou Kalipso Vincent J. Gnanapragasam Piyush B. Mehta Ian R. Logan Mark E. Brady Susan Cook Hing Y. Leung David E. Neal Craig N. Robson 2003 Expression of Tip60, an Androgen Receptor Coactivator, and its Role in Prostate Cancer Development Oncogene 22 16 2466 2477 10.1038/sj.onc.1206342 12717424 27 Wang Hui Qing Bo Yang Chuan Liang Xu Lin Hui Wang Yu Xi Zhang Bin Xu Jia Tao Ji Ying Hao Sun 2010 Differential Phosphoprotein Levels and Pathway Analysis Identify the Transition Mechanism of LNCaP Cells into Androgen‐independent Cells The Prostate 70 5 508 517 10.1002/pros.21085 19937597 28 Lu Shan Sophia Y. Tsai M.‐Jer Tsai 1999 Molecular Mechanisms of Androgen‐independent Growth of Human Prostate Cancer LNCaP‐AI Cells Endocrinology 140 11 5054 5059 10.1210/endo.140.11.7086 10537131 29 Li Ximing Zhi Chen Zuan Li Guihai Huang Junhao Lin Qiang Wei Jianbo Liang Wei Li 2020 The Metabolic Role of PFKFB4 in Androgen‐independent Growth In Vitro and PFKFB4 Expression in Human Prostate Cancer Tissue BMC Urology 20 1 61 10.1186/s12894-020-00635-0 32487245 PMC7268689 30 Ibuki Naokazu Mazyar Ghaffari Hadas Reuveni Mitali Pandey Ladan Fazli Haruhito Azuma Martin E. Gleave Alexander Levitzki Michael E. Cox 2014 The Tyrphostin NT157 Suppresses Insulin Receptor Substrates and Augments Therapeutic Response of Prostate Cancer Molecular Cancer Therapeutics 13 12 2827 2839 10.1158/1535-7163.MCT-13-0842 25267499 31 Dalal Kush Helene Morin Fuqiang Ban Ashley Shepherd Michael Fernandez Kevin J. Tam Huifang Li 2018 Small Molecule‐Induced Degradation of the Full Length and V7 Truncated Variant Forms of Human Androgen Receptor European Journal of Medicinal Chemistry 157 1164 1173 10.1016/j.ejmech.2018.08.059 30193215 32 Sheth Sandeep Sarvesh Jajoo Tejbeer Kaur Debashree Mukherjea Kelly Sheehan Leonard P. Rybak Vickram Ramkumar 2012 Resveratrol Reduces Prostate Cancer Growth and Metastasis by Inhibiting the Akt/MicroRNA‐21 Pathway PLoS One 7 12 e51655 10.1371/journal.pone.0051655 23272133 PMC3521661 33 Fu Xun Jianmin Liu Daoquan Liu Yongying Zhou Yuhang Guo Zhen Wang Shu Yang 2022 Glucose‐Regulated Protein 78 Modulates Cell Growth, Epithelial‐Mesenchymal Transition, and Oxidative Stress in the Hyperplastic Prostate Cell Death & Disease 13 1 78 10.1038/s41419-022-04522-4 35075122 PMC8786955 34 Jin Zhe Jiaan Ren Shanlun Qi 2020 Exosomal miR‐9‐5p Secreted by Bone Marrow‐Derived Mesenchymal Stem Cells Alleviates Osteoarthritis by Inhibiting Syndecan‐1 Cell and Tissue Research 381 1 99 114 10.1007/s00441-020-03193-x 32377874 35 Yang Wan Seok Katherine J. Kim Michael M. Gaschler Milesh Patel Mikhail S. Shchepinov Brent R. Stockwell 2016 Peroxidation of Polyunsaturated Fatty Acids by Lipoxygenases Drives Ferroptosis Proceedings of the National Academy of Sciences of the United States of America 113 34 E4966 E4975 10.1073/pnas.1603244113 27506793 PMC5003261 36 Luo Wen Zetong Lin Jiahui Chen Genghua Chen Siyu Zhang Manqing Liu Hongmei Li 2021 TMEM182 Interacts with Integrin Beta 1 and Regulates Myoblast Differentiation and Muscle Regeneration Journal of Cachexia, Sarcopenia and Muscle 12 6 1704 1723 10.1002/jcsm.12767 34427057 PMC8718073 37 Ayuk Sandra M. Heidi Abrahamse Nicolette N. Houreld 2016 The Role of Photobiomodulation on Gene Expression of Cell Adhesion Molecules in Diabetic Wounded Fibroblasts In Vitro Journal of Photochemistry and Photobiology, B: Biology 161 368 374 10.1016/j.jphotobiol.2016.05.027 27295416 38 Ban Zhengfeng Jinnian He Zhenzhen Tang Linlin Zhang Zhiwen Xu 2019 LRG‐1 Enhances the Migration of Thyroid Carcinoma Cells through Promotion of the Epithelial‐Mesenchymal Transition by Activating MAPK/p38 Signaling Oncology Reports 41 6 3270 3280 10.3892/or.2019.7123 31002347 PMC6488982 39 Yang Yang Yuan Zhang Zongxiang Lin Kai Wu Zhanfeng He Dengyan Zhu Jia Zhao Chunyang Zhang Yuxia Fan 2022 Silencing of Histone Deacetylase 3 Suppresses the Development of Esophageal Squamous Cell Carcinoma through Regulation of miR‐494‐Mediated TGIF1 Cancer Cell International 22 1 191 10.1186/s12935-022-02581-3 35578338 PMC9109300 40 Ding W. Y. Shi H. Zhang 2021 Circular RNA circNEURL4 Inhibits Cell Proliferation and Invasion of Papillary Thyroid Carcinoma by Sponging miR‐1278 and Regulating LATS1 Expression American Journal of Tourism Research 13 6 5911 5927 PMC8290797 34306334 41 Zhao Jing Yu Zhang X.‐sheng Liu F.‐ming Zhu Feng Xie C.‐yi Jiang Z.‐ye Zhang 2020 RNA‐Binding Protein Musashi2 Stabilizing Androgen Receptor Drives Prostate Cancer Progression Cancer Science 111 2 369 382 10.1111/cas.14280 31833612 PMC7004550 42 Davies Alastair Shaghayegh Nouruzi Dwaipayan Ganguli Takeshi Namekawa Daksh Thaper Simon Linder Fatih Karaoğlanoğlu 2021 An Androgen Receptor Switch Underlies Lineage Infidelity in Treatment‐Resistant Prostate Cancer Nature Cell Biology 23 9 1023 1034 10.1038/s41556-021-00743-5 34489572 PMC9012003 43 Hirayama Yukiyoshi Teresa Tam Kunzhong Jian Raymond J. Andersen Marianne D. Sadar 2020 Combination Therapy with Androgen Receptor N‐Terminal Domain Antagonist EPI‐7170 and Enzalutamide Yields Synergistic Activity in AR‐V7‐Positive Prostate Cancer Molecular Oncology 14 10 2455 2470 10.1002/1878-0261.12770 32734688 PMC7530779 44 Srivastava Sanjeev Kumar Mohammad Aslam Khan Shashi Anand Haseeb Zubair Sachin Kumar Deshmukh Girijesh Kumar Patel Seema Singh 2022 MYB Interacts with Androgen Receptor, Sustains its Ligand‐independent Activation and Promotes Castration Resistance in Prostate Cancer British Journal of Cancer 126 8 1205 1214 10.1038/s41416-021-01641-1 34837075 PMC9023474 45 Li Yan Jun Xiaochen Chen Tony K. Kwan Yik Wen Loh Julian Singer Yunzi Liu Jin Ma 2020 Dietary Fiber Protects against Diabetic Nephropathy through Short‐Chain Fatty Acid‐Mediated Activation of G Protein‐Coupled Receptors GPR43 and GPR109A Journal of the American Society of Nephrology: Journal of the American Society of Nephrology 31 6 1267 1281 10.1681/ASN.2019101029 32358041 PMC7269358 46 Yao Bing Sha Zhu Xiyi Wei M.‐Kun Chen Yangkun Feng Zhimin Li Xinyu Xu 2022 The circSPON2/miR‐331‐3p Axis Regulates PRMT5, an Epigenetic Regulator of CAMK2N1 Transcription and Prostate Cancer Progression Molecular Cancer 21 1 119 10.1186/s12943-022-01598-6 35624451 PMC9137111 47 Seruga Bostjan Alberto Ocana Ian F. Tannock 2011 Drug Resistance in Metastatic Castration‐Resistant Prostate Cancer Nature Reviews Clinical Oncology 8 1 12 23 10.1038/nrclinonc.2010.136 20859283 48 Murillo‐Garzón Virginia Robert Kypta 2017 WNT Signalling in Prostate Cancer Nature Reviews Urology 14 11 683 696 10.1038/nrurol.2017.144 28895566 49 Mourkioti Ioanna Andriani Angelopoulou Konstantinos Belogiannis Nefeli Lagopati Spyridon Potamianos Efthymios Kyrodimos Vassilis Gorgoulis Angelos Papaspyropoulos 2022 Interplay of Developmental Hippo‐Notch Signaling Pathways with the DNA Damage Response in Prostate Cancer Cells 11 15 2449 10.3390/cells11152449 35954292 PMC9367915 50 Wang Yingying Xiaoling Weng Luoyang Wang Mingang Hao Yue Li Lidan Hou Yu Liang 2018 HIC1 Deletion Promotes Breast Cancer Progression by Activating Tumor Cell/fibroblast Crosstalk The Journal of Clinical Investigation 128 12 5235 5250 10.1172/JCI99974 30204129 PMC6264654 51 Wang Yanbo Hongwei Liang Geyu Zhou Xiuting Hu Zhengya Liu Fangfang Jin Mengchao Yu 2017 HIC1 and miR‐23∼27∼24 Clusters Form a Double‐Negative Feedback Loop in Breast Cancer Cell Death & Differentiation 24 3 421 432 10.1038/cdd.2016.136 28009350 PMC5344204 52 Zhou Xiaoguang Peng Zhang Hu Han Hongen Lei Xiaodong Zhang 2019 Hypermethylated in Cancer 1 (HIC1) Suppresses Bladder Cancer Progression by Targeting Yes‐Associated Protein (YAP) Pathway Journal of Cellular Biochemistry 120 4 6471 6481 10.1002/jcb.27938 30417565 53 Hao Mingang Yue Li J. Wang Jun Qin Jinglong Wang Yufeng Ding Min Jiang 2017 HIC1 Loss Promotes Prostate Cancer Metastasis by Triggering Epithelial‐Mesenchymal Transition The Journal of Pathology 242 4 409 420 10.1002/path.4913 28466555 54 Chen Wen Yong David H. Wang RayWhay Chiu Yen Jianyuan Luo Wei Gu Stephen B. Baylin 2005 Tumor Suppressor HIC1 Directly Regulates SIRT1 to Modulate P53‐dependent DNA‐Damage Responses Cell 123 3 437 448 10.1016/j.cell.2005.08.011 16269335 55 Kumari Sangeeta Vikas Sharma Rahul Tiwari Jay Prakash Maurya Bharat Bhusan Subudhi Dhirodatta Senapati 2022 Therapeutic Potential of P53 Reactivation in Prostate Cancer: Strategies and Opportunities European Journal of Pharmacology 919 174807 10.1016/j.ejphar.2022.174807 35151649 56 Özturan Doğancan Tunç Morova Nathan A. Lack 2022 Androgen Receptor‐Mediated Transcription in Prostate Cancer Cells 11 5 898 10.3390/cells11050898 35269520 PMC8909478 57 Zou June X. Linlang Guo Alexey S. Revenko Clifford G. Tepper Abigael T. Gemo H.‐Jien Kung H.‐Wu Chen 2009 Androgen‐induced Coactivator ANCCA Mediates Specific Androgen Receptor Signaling in Prostate Cancer Cancer Research 69 8 3339 3346 10.1158/0008-5472.CAN-08-3440 19318566 58 Mao Ninghui Dong Gao Wenhuo Hu Sunyana Gadal Haley Hieronymus Shangqian Wang Young Sun Lee 2020 Oncogenic ERG Represses PI3K Signaling through Downregulation of IRS2 Cancer Research 80 7 1428 1437 10.1158/0008-5472.CAN-19-1394 32015092 PMC7127960 59 Conteduca Vincenza Alessandra Mosca Nicole Brighi Ugo de Giorgi Pasquale Rescigno 2021 New Prognostic Biomarkers in Metastatic Castration‐Resistant Prostate Cancer Cells 10 1 193 10.3390/cells10010193 33478015 PMC7835961 60 El Aliani Aissam Hassan El‐Abid Yassine El Mallali Mohammed Attaleb Moulay Mustapha Ennaji Mohammed El Mzibri 2021 Association between Gene Promoter Methylation and Cervical Cancer Development: Global Distribution and A Meta‐Analysis Cancer Epidemiology Biomarkers & Prevention: A Publication of the American Association for Cancer Research, Cosponsored by the American Society of Preventive Oncology 30 3 450 459 10.1158/1055-9965.EPI-20-0833 33441308 61 Fortes M. R. S. L. F. Zacchi L. T. Nguyen F. Raidan M. M. D. C. A. Weller J. J. Y. Choo A. Reverter 2018 Pre‐ and Post‐puberty Expression of Genes and Proteins in the Uterus of Bos indicus Heifers: The Luteal Phase Effect Post‐puberty Animal Genetics 49 6 539 549 10.1111/age.12721 30192028 62 Manceau Cécile Loic Mourey Damien Pouessel Guillaume Ploussard 2020 Abiraterone Acetate in Combination with Prednisone in the Treatment of Prostate Cancer: Safety and Efficacy Expert Review of Anticancer Therapy 20 8 629 638 10.1080/14737140.2020.1785289 32552120 63 Lokeshwar Soum D. Zachary Klaassen Fred Saad 2021 Treatment and Trials in Non‐metastatic Castration‐Resistant Prostate Cancer Nature Reviews Urology 18 7 433 442 10.1038/s41585-021-00470-4 34002069 64 Wang Yuanyuan Jiyuan Chen Zhengjie Wu Weihong Ding Shen Gao Yuan Gao Chuanliang Xu 2021 Mechanisms of Enzalutamide Resistance in Castration‐Resistant Prostate Cancer and Therapeutic Strategies to Overcome it British Journal of Pharmacology 178 2 239 261 10.1111/bph.15300 33150960 ",
  "metadata": {
    "Title of this paper": "Mechanisms of Enzalutamide Resistance in Castration‐Resistant Prostate Cancer and Therapeutic Strategies to Overcome it",
    "Journal it was published in:": "Journal of Cell Communication and Signaling",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494493/"
  }
}