{
  "title": "Paper_1089",
  "abstract": "pmc Clin Transl Med Clin Transl Med 1991 clintransmed CTM2 Clinical and Translational Medicine 2001-1326 Wiley PMC12477887 PMC12477887.1 12477887 12477887 41020792 10.1002/ctm2.70478 CTM270478 1 Review Review Lactylation in cancer: Advances and opportunities for treatment resistance XU et al. Xu Keke  1  2 Shou Yiyi  1 Liu Ruiqi  3 Xiong Hao  1  2 Dai Xiaomeng  4 Bao Xuanwen https://orcid.org/0000-0002-6232-3783  4 Chen Xiaoyan  1 Huang Luanluan  1 Sheng Hailong  1 zea974606755@163.com Zhang Haibo https://orcid.org/0000-0002-5134-4167  1 zhbdoctor@163.com Lu Yanwei  1 luyanwei@hmc.edu.cn   1 Cancer Center Department of Radiation Oncology Zhejiang Provincial People's Hospital (Affiliated People's Hospital) Hangzhou Medical College Hangzhou Zhejiang China   2 School of Basic Medical Sciences and Forensic Medicine Hangzhou Medical College Hangzhou Zhejiang China   3 Department of Pathology Tongde Hospital of Zhejiang Province Hangzhou Zhejiang China   4 Department of Medical Oncology The First Affiliated Hospital School of Medicine Zhejiang University Hangzhou Zhejiang China * Correspondence luyanwei@hmc.edu.cn zhbdoctor@163.com zea974606755@163.com 29 9 2025 10 2025 15 10 497549 10.1002/ctm2.v15.10 e70478 15 8 2025 19 3 2025 09 9 2025 29 09 2025 30 09 2025 30 09 2025 © 2025 The Author(s). Clinical and Translational Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Background Lactylation, a recently identified post‐translational modification that utilizes lactic acidas a substrate, has emerged as an important regulator of gene expression andprotein function. Since its discovery in 2019, lactylation has beenincreasingly recognized for its roles in cancer biology and treatment response. Main text Lactylationis strongly associated with tumor progression and malignancy, underscoring itspotential as a therapeutic target. Recent studies also link lactylation tocancer treatment resistance, suggesting that modulating this modification couldenhance therapeutic efficacy. As treatment resistance remains a major clinicalchallenge in oncology, accumulating evidence indicates that dysregulatedlactylation contributes to resistance across chemotherapy, immunotherapy, targeted therapy, and radiotherapy. Preclinical and clinical research has begunto delineate the molecular pathways through which lactylation shapes theseresistance processes, and experimental approaches targeting lactylation arebeing explored to restore therapeutic sensitivity. Conclusion This review systematically summarizes the mechanisms of lactylation and its roles intreatment resistance, highlighting the interplay between lactylation andtherapeutic response. We discuss current and emerging strategies that targetlactylation, providing a foundation for future therapeutic development aimed atovercoming resistance and improving cancer treatment outcomes. Key points  Lactylation links glycolysis to tumor progression and therapeutic response. Modulating lactylation writers and erasers restores treatment sensitivity. Aberrant lactylation drives resistance tomultiple cancer therapies. Crosstalk with other post‐translational modifications suggests novel combination strategies. Aberrant lactylation plays a crucial role in the development of resistance to chemotherapy, immunotherapy, targeted therapy, and radiotherapy. Strategies to overcome this resistance include the inhibition of key glycolytic enzymes, targeting lactate transporters, synergistic therapeutic approaches, and the inhibition of specific site. chemotherapy immunotherapy lactylation targeted therapy treatment resistance National Natural Science Foundation of China 10.13039/501100001809 82203377 82473238 Zhejiang Natural Science Foundation of China LY24H160022 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  Xu K Shou Y Liu R Lactylation in cancer: Advances and opportunities for treatment resistance Clin Transl Med 2025 15 e70478 10.1002/ctm2.70478 Keke Xu, Yiyi Shou, and Ruiqi Liu contributed equally to this study. 1 INTRODUCTION Under oxygen‐rich conditions, cancer cells preferentially rely on glycolysis rather than the more energy‐efficient oxidative phosphorylation for energy production. This phenomenon is known as the Warburg effect, or aerobic glycolysis.  1  2  3  4  5  6  7  8 In 2019, Zhao et al.  9  10  11  12  13 1 FIGURE 1 The Warburg effect and lactylation. Lactylation serves as a critical regulator of cellular metabolism, particularly in the context of metabolic reprogramming. It can directly influence the activity of metabolic enzymes, thus regulating the utilization of energy metabolism pathways.  14  9  15  16 2 LACTYLATION IN CHEMORADIOTHERAPY Malignancies persist as a predominant contributor to the global mortality burden. While surgical intervention remains the cornerstone for localized disease management, its therapeutic limitations in advanced‐stage cancers have established adjuvant chemotherapy as an indispensable component of comprehensive treatment protocols.  17 Tumour resistance is a complex phenomenon involving multiple mechanisms, which can act independently or in combination to reduce chemotherapy effectiveness. Recent studies have shown that lactylation contributes to chemotherapy resistance through mechanisms such as enhanced DNA damage repair, epithelial–mesenchymal transition (EMT), and overexpression of ATP‐binding cassette (ABC) transporters. Understanding these pathways could inform future drug development (Figure 2 FIGURE 2 Lactylation and several main drug resistance mechanisms. 2.1 DNA damage repair Cisplatin is a widely used chemotherapy drug, particularly effective in the treatment of testicular and ovarian cancers. Combining surgery with cisplatin therapy has been shown to significantly improve patient survival rates.  18  19  20 Recent studies have demonstrated that cancer cells are capable of using lactate to counteract the damage caused by chemotherapy. In a published study, Chen et al.  21 Further investigation revealed that lactate significantly enhances homologous recombination repair (HR) in cancer cells by mediating DNA damage repair. The researchers hypothesized that lactylation, a PTM, could be involved. Previous studies have shown that lactylation, as an epigenetic modification, can drive tumour progression and promote immune evasion.  22 3 FIGURE 3 Mechanisms governing lactylation and overcoming resistance to chemoradiotherapy. Coincidentally, in the same year, another study published a close relationship between lactylation, DNA damage repair, and chemotherapy resistance in tumour cells.  23 3 As early as 2007, Williams et al.  24 These findings indicate that lactylation may drive tumour cell adaptation under sustained DNA damage by selectively enhancing HR, contributing to resistance against DNA‐damaging agents. Given HR's critical role in DNA repair during cancer treatment, lactylation may alter tumour cell sensitivity to certain chemotherapies. Understanding this mechanism offers potential avenues for targeting lactylation to overcome chemotherapy resistance. 2.2 Overexpression of ABC transporters Cancer cells frequently exhibit intrinsic or acquired resistance to multiple chemotherapeutic agents, limiting treatment efficacy. One of the main mechanisms of multidrug resistance is the overexpression of ABC transporters, particularly ABCB1, ABCG2, and ABCC1, which are known to contribute to chemotherapy resistance.  25  26 In Sun's study,  27 2.3 Epithelial–mesenchymal transition EMT is a persistent challenge in tumour metastasis, with over 90% of malignant tumours originating from epithelial tissues, such as the lung, breast, liver, and gastric cancers. EMT plays a crucial role in the metastasis of these malignancies.  28 Using single‐cell RNA sequencing, researchers mapped the single‐cell landscape of BCA, identifying a distinct subpopulation with marked cisplatin resistance. They found that H3K18la was enriched at promoter regions, crucial for activating target gene transcription. Inhibiting H3K18la restored cisplatin sensitivity in resistant epithelial cells. Moreover, YBX1 emerged as a potential target to reverse cisplatin resistance, while YY1 was recognized as a key driver of chemotherapy resistance across various malignancies.  29 2.4 Other resistance mechanisms Autophagy and apoptosis in tumour cells are common mechanisms of drug resistance, with numerous studies demonstrating the involvement of autophagy in chemotherapy resistance across various cancer types.  30  31  32  33  34  35  36 As one of the most important metabolites in the tumour microenvironment (TME), lactate is closely associated with tumour immunity. The TME can be divided into cellular and non‐cellular components, with the former enhancing drug resistance by recruiting and secreting various protective cytokines, while the latter mediates resistance by constructing physical barriers and influencing tumour cell growth and metabolism.  37  38  39 The interaction between acetylation and lactylation is a particularly intriguing area of research. These two modifications share similar enzymatic mechanisms. Traditionally, lysine acetyltransferases (KATs) are considered to catalyze acetylation via acetyl‐CoA. According to existing research, GCN5‐related N‐acetyltransferase, p300‐CBP (CREB‐binding protein), and Sas2 and Tat‐interacting protein 60 (TIP60) are the three most common enzymes involved.  40  41  11  42 Furthermore, dual‐specificity enzymes, such as histone deacetylases (HDACs) and sirtuins (SIRTs), also play a central role in regulating both acetylation and lactylation. Lysine deacetylases (KDACs) are divided into two families: Zn2+‐dependent (HDACs, also known as class I, II, and IV KDACs) and NAD+‐dependent SIRTs (also known as class III KDACs).  43  41 Research indicates that competition between acetylation and lactylation at the same lysine residue is a key factor in determining the effects of these modifications. For example, specific histone sites, such as H3K9 and H3K18, have been found to undergo both acetylation and lactylation simultaneously.  6  44 3 LACTYLATION IN IMMUNOTHERAPY Immunotherapy using immune checkpoint inhibitors has been a major breakthrough in oncology over the past decade, demonstrating efficacy across various malignancies. However, like other anti‐cancer treatment modalities, immune checkpoint inhibitors can also encounter resistance issues.  45  46  47 The current enthusiasm for cancer immunotherapy largely stems from the success of monoclonal antibodies targeting immune suppression within the TME. These antibodies block the immune inhibitory receptor programmed death 1 (PD‐1) and its ligand B7‐H1, also known as programmed death ligand 1 (PD‐L1).  48  49  50  51  52 4 FIGURE 4 Lactylation‐mediated immunosuppression and immune escape. 3.1 M2 polarization immunosuppression Tumour‐associated macrophages are a key component of tumour tissues and organs, consisting primarily of M1 macrophages, which hinder cancer cell proliferation, and M2 macrophages, which promote functional differentiation. In Chaudagar's study,  53  54  55  56 In addition to immune suppression caused by M2 macrophage polarization, other macrophages in the innate immune system can regulate lactylation and suppress innate immunity, contributing to immunotherapy resistance. Zong's study  57  58 Additionally, in De's study,  22  59 3.2 Proliferation immunosuppression Tregs, as adaptive immune cells, are key immunoregulatory components within the TME, with their proliferation, function, and metabolic adaptation all dependent on TGF‐β signalling.  60  61  62  63  64  65 Chen's study  66  67  68 3.3 Immune evasion As another key player in adaptive immunity, CTLs are undoubtedly essential for anti‐tumour and anti‐infection responses. PD‐(L)1 inhibitors, CAR‐T therapy, and CD3 T‐cell bispecific antibodies are all successful applications of CTL cytotoxicity.  69  70 Similarly, Wang's study  6 Additionally, mutant KRAS (KRASMUT) has been shown to induce immune evasion through activation‐induced cell death (AICD). In Zhou's study,  71  72 Given that lactate accumulation is a hallmark of the tumour microenvironment, the discovery of lactylation has opened new avenues for exploring tumour progression and immune evasion in cancer immunotherapy. While lactylation plays a key role in immune suppression within the tumour microenvironment, its precise mechanisms and implications for immunotherapy resistance remain under investigation. Evidence links lactate accumulation to immune cell dysfunction, but conclusions vary regarding the specific pathways and targets involved. One line of research indicates that lactate can drive M2‐type TAM polarization via the Warburg effect, thereby promoting immune suppression. Another body of work has identified aminoacyl‐tRNA synthetase 1 (AARS1) as a lactate sensor that mediates lactylation to promote immune evasion by targeting tumour suppressor genes such as p53. The former emphasizes metabolic shifts in macrophages, whereas the latter focuses on molecular lactylation, pointing to two distinct therapeutic approaches—targeting metabolic pathways versus the lactylation machinery. Further studies have shown that AARS1 and AARS2 can catalyze lactylation independently of coenzyme A, inhibiting cGAS and suppressing innate immunity to facilitate immune evasion. In contrast, other investigations have demonstrated that lactate‐induced histone lactylation in glioblastoma enhances immunosuppressive activity and that blocking PERK‐driven lactylation may improve immunotherapy outcomes. The former line of evidence centres on the effects of lactylation on innate immunity and tumour progression, whereas the latter highlights its role in epigenetic regulation of macrophage function, offering a broader strategy for targeting histone modifications in immunotherapy. Across immune cell types, lactylation acts as a metabolic–epigenetic bridge, translating elevated lactate into durable immune suppression. This suppression is mechanistically redundant: TAMs, Tregs, and CTLs are targeted through parallel but converging routes, ensuring immune evasion even if one pathway is blocked. This redundancy may explain the limited efficacy of monotherapies targeting single checkpoints, such as single‐agent PD‐1 blockade, and suggests that combinational approaches inhibiting lactylation alongside ICIs could disrupt multiple resistance nodes simultaneously. 4 LACTYLATION IN TARGETED THERAPY Targeted cancer therapy is a precise approach that focuses on specific molecules within cancer cells to inhibit tumour growth and spread while minimizing harm to normal cells. It offers high specificity, effective tumour inhibition, and fewer side effects compared with chemotherapy and immunotherapy.  73  74 Targeting lactylation is closely associated with aerobic glycolysis, as inhibiting tumour cell glycolysis presents a promising strategy to reduce lactylation and overcome therapy resistance. Key enzymes like HK2,  75  76  77  78  79  80  81  82  83  84  85  86  82  87  88  89 LDH, a tetrameric enzyme, plays a crucial role in mediating the bidirectional conversion between pyruvate and lactate.  90  91  92  93  94  95  96 Strong evidence suggests that the combination of MCT‐targeted therapies with other treatment methods can achieve better therapeutic outcomes. Li et al.  97  98 Current drug development targeting lactylation focuses on MCT1 inhibitors  99  66  100  101 1 TABLE 1 The potential attempts of targeting lactylation in cancer therapy. Targets Drugs Cancer Reference HK 2‐DG, Ocular melanoma,   75 3‐BP, hepatocellular carcinoma,   76 Limonin, hepatocellular carcinoma,   77 Lonidamine melanoma and breast cancer   78  79 LDH Oxamate, Ocular melanoma,   83 gastric carcinoma,   84 Gossypol, melanoma,   85 PS TM colon cancer   86 PKM Compound 3K, Ovarian cancer,   80 Shikonin, bladder cancer,   81 hepatocellular carcinoma   82 MCTs CHC, Colorectal cancer,   82 DIDS, prostate cancer,   87 Simvastatin, oral squamous cell carcinoma,   88 Quercetin breast cancer   89 John Wiley & Sons, Ltd. Bevacizumab, an anti‐angiogenic therapy targeting VEGFA, plays a crucial role in treating advanced CRC by blocking VEGFA‐VEGFR binding to inhibit angiogenesis.  102  103 5 FIGURE 5 Targeting lactate production and lactylation to enhance anticancer therapy. Across targeted therapies, lactylation functions as a metabolic–epigenetic integrator that enables tumours to bypass inhibition of their primary oncogenic pathway. Whether driven by glycolytic flux, hypoxia, or transporter‐mediated lactate exchange, the outcome is consistent: stabilization of pro‐survival transcriptional programs and maintenance of a resistant tumour phenotype. This redundancy explains why both metabolic interventions—such as LDH or MCT blockade—and direct epigenetic strategies employing lactylation inhibitors demonstrate cross‐therapy potential. Future targeted therapy design should integrate lactylation suppression as a co‐strategy to prevent the metabolic plasticity that underlies convergent resistance mechanisms. 5 LACTYLATION IN RADIOTHERAPY Radiation therapy (RT) is widely known for inducing DNA damage through ionizing radiation (IR), either by directly causing DNA breaks or by generating highly reactive free radicals through the absorption of high‐energy wavelengths, which indirectly damage DNA.  104  105  106  107  108 Recent pivotal studies have demonstrated that lactate enhances tumour resistance to RT by promoting DNA damage repair.  21  23  109 These findings reveal that RT induces DNA repair enhancement, and lactate/lactylation strengthens tumour resistance to RT, reducing treatment efficacy. Understanding these mechanisms offers potential avenues to improve radiosensitivity in future cancer therapies. 6 CLINICAL TARGETING OF LACTYLATION AND LACTATE METABOLISM IN CANCER Lactate metabolism has become a crucial target for cancer therapy, with its dysregulation serving as a fundamental mechanism driving tumour progression and metastasis. Lactate production and transport are primarily mediated by LDH and MCTs, with LDH catalyzing the conversion of pyruvate to lactate and MCTs facilitating lactate efflux, contributing to the acidic tumour microenvironment that promotes immune evasion. Targeting LDH and MCTs has therefore become a promising strategy for disrupting tumour metabolism and improving cancer therapy. Inhibition of LDH, particularly the LDHA isoform, has been shown to reduce lactate production, thereby reprogramming tumour metabolism and inhibiting cancer cell proliferation.  110  111  112  113  114  115 Advances in detection technologies, such as fluorescent lactate analogues and isotope‐tracing‐based metabolic flux analysis, have significantly enhanced our understanding of lactate's role in tumour biology.  116  117  118  119 The use of lactate‐modifying agents has also been integrated with other therapeutic modalities to improve treatment outcomes. LDH inhibitors, when combined with immune checkpoint inhibitors, have shown potential in enhancing T‐cell infiltration into tumours and reversing the immunosuppressive TME.  110  120  112  113  114  115  121  122  123  124 2 TABLE 2 Key ongoing clinical trials targeting lactate metabolism and lactylation. Targets Inhibitor Clinical trial phase Cancer types Outcome Reference LDH AT‐101 (Gossypol) Phase I/II Prostate cancer, lymphoma Prolonged progression‐free survival   112  113 MCT1/2 AZD3965 Phase I/II Solid tumours, lymphoma Positive pharmacokinetics, patient tolerability   114  115 LDH + Immunotherapy AT‐101 + Pembrolizumab Preclinical NSCLC, melanoma Enhanced T‐cell infiltration, improved immune response   122  123 MCT1 + Immunotherapy Syrosingopine Preclinical Breast cancer Reversal of immunosuppressive TME, improved therapy sensitivity   124 Lactylation Demethylzellal Preclinical Liver cancer Disrupting metabolic stress‐related histone lactylation   101 Lactylation Tubuloside A Preclinical Liver cancer Targeting the lactylation of ABCF1 in the nucleus   125 John Wiley & Sons, Ltd. The complexity of lactate metabolism across different tumour types remains a significant challenge. Tumour cells exhibit metabolic heterogeneity, with variations in lactate production and utilization across different stages of tumour progression and among distinct cancer types. This heterogeneity necessitates the development of more specific lactate‐targeting strategies to avoid potential off‐target effects on healthy cells. Researchers are currently exploring new avenues, such as the use of lactate oxidase (LOx) and PROTAC (proteolysis‐targeting chimaeras), which offer the ability to degrade lactate‐modifying enzymes and modulate lactate levels within tumours.  125 7 CONCLUSION Since the groundbreaking discovery of lysine lactylation by Professor Yingming Zhao's team at the University of Chicago in 2019, utilizing LC/MS technology,  9  42  126 As numerous studies have demonstrated, regulating lactylation levels can overcome resistance to conventional chemotherapy, immunotherapy, targeted therapy, and radiation therapy. These findings suggest the potential of developing new therapies by reducing lactylation levels to combat cancer resistance. This review has summarized the mechanisms of lactylation and its role in drug resistance; however, there is still a long way to go before clinical application. First, it remains unclear whether lactylation‐induced resistance is limited to cancers with specific characteristics or applies broadly across various cancers. A deeper understanding of the mechanisms linking lactylation to resistance is essential to define effective treatment strategies. Second, lactylation competes with acetylation, creating a complex balance in the system. The intricate interplay between lactylation and other PTMs represents a promising avenue for future research. Modifications such as acetylation, methylation, and phosphorylation frequently coexist and interact within the same protein, forming a dynamic and context‐dependent regulatory network. Crosstalk between lactylation and these modifications can influence protein function, stability, and intermolecular interactions, ultimately impacting cellular processes including metabolism, immune responses, and cancer progression. Elucidating these interactions may facilitate the identification of novel therapeutic targets and the development of combination treatment strategies capable of modulating multiple PTMs simultaneously, thereby providing a more comprehensive approach to overcoming cancer resistance and other diseases. AUTHOR CONTRIBUTIONS Yanwei Lu and Haibo Zhang designed the study and approved the final submission. Keke Xu, Yiyi Shou, and Ruiqi Liu drafted the manuscript. Hao Xiong, Xiaomeng Dai, Xuanwen Bao, Xiaoyan Chen, Luanluan Huang, and Hailong Sheng assisted in the revision and drafting process. CONFLICT OF INTEREST STATEMENT The authors declare no conflict of interest. ETHICS STATEMENT Ethical approval is not applicable to this study. ACKNOWLEDGEMENTS The authors have nothing to report. This work was supported by the National Natural Science Foundation of China (82203377 to Yanwei Lu; 82473238 to Haibo Zhang) and the Zhejiang Natural Science Foundation of China (grant number: LY24H160022 to Haibo Zhang). DATA AVAILABILITY STATEMENT Data sharing is not applicable to this article as no new data were created or analyzed in this study. REFERENCES 1 Warburg O On the origin of cancer cells Science 1956 123 3191 309 14 13298683 10.1126/science.123.3191.309 2 Brooks GA Lactate as a fulcrum of metabolism Redox Biol 2020 35 101454 32113910 10.1016/j.redox.2020.101454 PMC7284908 3 Brown TP Bhattacharjee P Ramachandran S The lactate receptor GPR81 promotes breast cancer growth via a paracrine mechanism involving antigen‐presenting cells in the tumor microenvironment Oncogene 2020 39 16 3292 3304 32071396 10.1038/s41388-020-1216-5 4 Nii T Prabhu VV Ruvolo V Imipridone ONC212 activates orphan G protein‐coupled receptor GPR132 and integrated stress response in acute myeloid leukemia Leukemia 2019 33 12 2805 2816 31127149 10.1038/s41375-019-0491-z PMC6874902 5 Chen P Zuo H Xiong H Gpr132 sensing of lactate mediates tumor‐macrophage interplay to promote breast cancer metastasis Proc Natl Acad Sci USA 2017 114 3 580 585 28049847 10.1073/pnas.1614035114 PMC5255630 6 Wang R Li C Cheng Z Li M Shi J Zhang Z H3K9 lactylation in malignant cells facilitates CD8 + Cell Rep 2024 43 9 114686 39216002 10.1016/j.celrep.2024.114686 7 Ippolito L Morandi A Giannoni E Lactate CP A metabolic driver in the tumour landscape Trends Biochem Sci 2019 44 2 153 166 30473428 10.1016/j.tibs.2018.10.011 8 Suhail Y Cain MP Vanaja K Kurywchak PA Levchenko A Kalluri R Systems biology of cancer metastasis Cell Syst 2019 9 2 109 127 31465728 10.1016/j.cels.2019.07.003 PMC6716621 9 Zhang D Tang Z Huang H Zhou G Cui C Weng Y Metabolic regulation of gene expression by histone lactylation Nature 2019 574 7779 575 580 31645732 10.1038/s41586-019-1678-1 PMC6818755 10 Faubert B Li KY Cai L Lactate metabolism in human lung tumors Cell 2017 171 2 358 371.e9 28985563 10.1016/j.cell.2017.09.019 PMC5684706 11 Zhu R Ye X Lu X ACSS2 acts as a lactyl‐CoA synthetase and couples KAT2A to function as a lactyltransferase for histone lactylation and tumor immune evasion Cell Metab 2025 37 2 361 376.e7 39561764 10.1016/j.cmet.2024.10.015 12 Liu R Ren X Park YE Nuclear GTPSCS functions as a lactyl‐CoA synthetase to promote histone lactylation and gliomagenesis Cell Metab 2025 37 2 377 394.e9 39642882 10.1016/j.cmet.2024.11.005 PMC11798710 13 Wang Y Wang Y Patel H Epigenetic modification of m 6 Mol Cancer 2023 22 1 102 37391814 10.1186/s12943-023-01810-1 PMC10311752 14 Gao R Li Y Xu Z Mitochondrial pyruvate carrier 1 regulates fatty acid synthase lactylation and mediates treatment of nonalcoholic fatty liver disease Hepatology 2023 78 6 1800 1815 36651176 10.1097/HEP.0000000000000279 15 Xie B Lin J Chen X CircXRN2 suppresses tumor progression driven by histone lactylation through activating the Hippo pathway in human bladder cancer Mol Cancer 2023 22 1 151 37684641 10.1186/s12943-023-01856-1 PMC10486081 16 Yang K Fan M Wang X Lactate promotes macrophage HMGB1 lactylation, acetylation, and exosomal release in polymicrobial sepsis Cell Death Differ 2022 29 1 133 146 34363018 10.1038/s41418-021-00841-9 PMC8738735 17 Yano T Muto M Minashi K Photodynamic therapy as salvage treatment for local failure after chemoradiotherapy in patients with esophageal squamous cell carcinoma: a phase II study Int J Cancer 2012 131 5 1228 34 22024814 10.1002/ijc.27320 18 Yu L Gu C Zhong D Induction of autophagy counteracts the anticancer effect of cisplatin in human esophageal cancer cells with acquired drug resistance Cancer Lett 2014 355 1 34 45 25236911 10.1016/j.canlet.2014.09.020 19 Enzinger PC Mayer RJ Esophageal cancer N Engl J Med 2003 349 23 2241 52 14657432 10.1056/NEJMra035010 20 Kelland L The resurgence of platinum‐based cancer chemotherapy Nat Rev Cancer 2007 7 8 573 84 17625587 10.1038/nrc2167 21 Chen H Li Y Li H NBS1 lactylation is required for efficient DNA repair and chemotherapy resistance Nature 2024 631 8021 663 669 38961290 10.1038/s41586-024-07620-9 PMC11254748 22 De Leo A Ugolini A Yu X Glucose‐driven histone lactylation promotes the immunosuppressive activity of monocyte‐derived macrophages in glioblastoma Immunity 2024 57 5 1105 1123 38703775 10.1016/j.immuni.2024.04.006 PMC11114377 23 Chen Y Wu J Zhai L Metabolic regulation of homologous recombination repair by MRE11 lactylation Cell 2024 187 2 294 311.e21 38128537 10.1016/j.cell.2023.11.022 PMC11725302 24 Williams RS Williams JS Tainer JA Mre11‐Rad50‐Nbs1 is a keystone complex connecting DNA repair machinery, double‐strand break signaling, and the chromatin template Biochem Cell Biol 2007 85 4 509 20 17713585 10.1139/O07-069 25 Sajid A Rahman H Ambudkar SV Advances in the structure, mechanism and targeting of chemoresistance‐linked ABC transporters Nat Rev Cancer 2023 23 11 762 779 37714963 10.1038/s41568-023-00612-3 26 Duan W Liu W Xia S Warburg effect enhanced by AKR1B10 promotes acquired resistance to pemetrexed in lung cancer‐derived brain metastasis J Transl Med 2023 21 1 547 37587486 10.1186/s12967-023-04403-0 PMC10428599 27 Sun X He L Liu H The diapause‐like colorectal cancer cells induced by SMC4 attenuation are characterized by low proliferation and chemotherapy insensitivity Cell Metab 2023 35 9 1563 1579.e8 37543034 10.1016/j.cmet.2023.07.005 28 Chen X Yang M Yin J Tumor‐associated macrophages promote epithelial‐mesenchymal transition and the cancer stem cell properties in triple‐negative breast cancer through CCL2/AKT/β‐catenin signaling Cell Commun Signal 2022 20 1 92 35715860 10.1186/s12964-022-00888-2 PMC9205034 29 Li F Zhang H Huang Y Single‐cell transcriptome analysis reveals the association between histone lactylation and cisplatin resistance in bladder cancer Drug Resist Updat 2024 73 101059 38295753 10.1016/j.drup.2024.101059 30 Sun Y Shen W Hu S METTL3 promotes chemoresistance in small cell lung cancer by inducing mitophagy J Exp Clin Cancer Res 2023 42 1 65 36932427 10.1186/s13046-023-02638-9 PMC10022264 31 Liu ZD Shi YH Xu QC CSNK2A1 confers gemcitabine resistance to pancreatic ductal adenocarcinoma via inducing autophagy Cancer Lett 2024 585 216640 38290659 10.1016/j.canlet.2024.216640 32 Young MJ Wang SA Chen YC USP24‐i‐101 targeting of USP24 activates autophagy to inhibit drug resistance acquired during cancer therapy Cell Death Differ 2024 31 5 574 591 38491202 10.1038/s41418-024-01277-7 PMC11093971 33 Cao LL Wu YK Lin TX CDK5 promotes apoptosis and attenuates chemoresistance in gastric cancer via E2F1 signaling Cancer Cell Int 2023 23 1 286 37990321 10.1186/s12935-023-03112-4 PMC10664659 34 Zhu H Chen K Chen Y RNA‐binding protein ZCCHC4 promotes human cancer chemoresistance by disrupting DNA‐damage‐induced apoptosis Signal Transduct Target Ther 2022 7 1 240 35853866 10.1038/s41392-022-01033-8 PMC9296561 35 Huang Y Luo G Peng K Lactylation stabilizes TFEB to elevate autophagy and lysosomal activity J Cell Biol 2024 223 11 e202308099 39196068 10.1083/jcb.202308099 PMC11354204 36 Jia M Yue X Sun W ULK1‐mediated metabolic reprogramming regulates Vps34 lipid kinase activity by its lactylation Sci Adv 2023 9 22 eadg4993 37267363 10.1126/sciadv.adg4993 PMC10413652 37 Jiang Y Zhang H Wang J Targeting extracellular matrix stiffness and mechanotransducers to improve cancer therapy J Hematol Oncol 2022 15 1 34 35331296 10.1186/s13045-022-01252-0 PMC8943941 38 Tang Y Zang H Wen Q Fan S AXL in cancer: a modulator of drug resistance and therapeutic target J Exp Clin Cancer Res 2023 42 1 148 37328828 10.1186/s13046-023-02726-w PMC10273696 39 Liu J Cao X Glucose metabolism of TAMs in tumor chemoresistance and metastasis Trends Cell Biol 2023 33 11 967 978 37080816 10.1016/j.tcb.2023.03.008 40 Allis CD Berger SL Cote J New nomenclature for chromatin‐modifying enzymes Cell 2007 131 4 633 6 18022353 10.1016/j.cell.2007.10.039 41 Sabari BR Zhang D Allis CD Metabolic regulation of gene expression through histone acylations Nat Rev Mol Cell Biol 2017 18 2 90 101 27924077 10.1038/nrm.2016.140 PMC5320945 42 Deng J Li Y Yin L Histone lactylation enhances GCLC expression and thus promotes chemoresistance of colorectal cancer stem cells through inhibiting ferroptosis Cell Death Dis 2025 16 1 193 40113760 10.1038/s41419-025-07498-z PMC11926133 43 Liu R Wu J Guo H Post‐translational modifications of histones: mechanisms, biological functions, and therapeutic targets MedComm (2020) 2023 4 3 e292 37220590 10.1002/mco2.292 PMC10200003 44 Rho H Terry AR Chronis C Hexokinase 2‐mediated gene expression via histone lactylation is required for hepatic stellate cell activation and liver fibrosis Cell Metab 35 8 2023 1406 1423.e8 37463576 10.1016/j.cmet.2023.06.013 PMC11748916 45 Johnson DB Nebhan CA Moslehi JJ Balko JM Immune‐checkpoint inhibitors: long‐term implications of toxicity Nat Rev Clin Oncol 2022 19 4 254 267 35082367 10.1038/s41571-022-00600-w PMC8790946 46 Hanahan D Weinberg RA Hallmarks of cancer: the next generation Cell 2011 144 5 646 74 21376230 10.1016/j.cell.2011.02.013 47 Vesely MD Zhang T Chen L Resistance mechanisms to anti‐PD cancer immunotherapy Annu Rev Immunol 2022 40 45 74 35471840 10.1146/annurev-immunol-070621-030155 48 Chen L Han X Anti‐PD‐1/PD‐L1 therapy of human cancer: past, present, and future J Clin Invest 2015 125 9 3384 91 26325035 10.1172/JCI80011 PMC4588282 49 Vesely MD Chen L Normalization cancer immunotherapy for melanoma J Invest Dermatol 2020 140 6 1134 1142 32092349 10.1016/j.jid.2020.02.005 PMC7247948 50 Sanmamed MF Chen L A paradigm shift in cancer immunotherapy: from enhancement to normalization Cell 2018 175 2 313 326 30290139 10.1016/j.cell.2018.09.035 PMC6538253 51 Park I Larson PE Zierhut ML Hyperpolarized 13C magnetic resonance metabolic imaging: application to brain tumors Neuro Oncol 2010 12 2 133 44 20150380 10.1093/neuonc/nop043 PMC2940577 52 Deng H Kan A Lyu N He M Huang X Qiao S Tumor‐derived lactate inhibit the efficacy of lenvatinib through regulating PD‐L1 expression on neutrophil in hepatocellular carcinoma J Immunother Cancer 2021 9 6 e002305 34168004 10.1136/jitc-2020-002305 PMC8231064 53 Chaudagar K Hieromnimon HM Kelley A Suppression of tumor cell lactate‐generating signaling pathways eradicates murine PTEN/p53‐deficient aggressive‐variant prostate cancer via macrophage phagocytosis Clin Cancer Res 2023 29 23 4930 4940 37721526 10.1158/1078-0432.CCR-23-1441 PMC10841690 54 Chaudagar K Hieromnimon HM Khurana R Reversal of lactate and PD‐1‐mediated macrophage immunosuppression controls growth of PTEN/p53‐deficient prostate cancer Clin Cancer Res 2023 29 10 1952 1968 36862086 10.1158/1078-0432.CCR-22-3350 PMC10192075 55 Wang J Yang P Yu T Lactylation of PKM2 suppresses inflammatory metabolic adaptation in pro‐inflammatory macrophages Int J Biol Sci 2022 18 16 6210 6225 36439872 10.7150/ijbs.75434 PMC9682528 56 Colegio OR Chu NQ Szabo AL Functional polarization of tumour‐associated macrophages by tumour‐derived lactic acid Nature 2014 513 7519 559 63 25043024 10.1038/nature13490 PMC4301845 57 Zong Z Xie F Wang S Alanyl‐tRNA synthetase, AARS1, is a lactate sensor and lactyltransferase that lactylates p53 and contributes to tumorigenesis Cell 2024 187 10 2375 2392.e33 38653238 10.1016/j.cell.2024.04.002 58 Li H Liu C Li R AARS1 and AARS2 sense L‐lactate to regulate cGAS as global lysine lactyltransferases Nature 2024 10.1038/s41586-024-07992-y 39322678 59 Xiong J He J Zhu J Lactylation‐driven METTL3‐mediated RNA m 6 Mol Cell 2022 82 9 1660 1677.e10 35320754 10.1016/j.molcel.2022.02.033 60 Tanaka A Sakaguchi S Regulatory T cells in cancer immunotherapy Cell Res 2017 27 1 109 118 27995907 10.1038/cr.2016.151 PMC5223231 61 Ghiringhelli F Puig PE Roux S Tumor cells convert immature myeloid dendritic cells into TGF‐beta‐secreting cells inducing CD4+CD25+ regulatory T cell proliferation J Exp Med 2005 202 7 919 29 16186184 10.1084/jem.20050463 PMC2213166 62 Wang W Wang X Lu S Metabolic disturbance and Th17/Treg imbalance are associated with progression of gingivitis Front Immunol 2021 12 670178 34234776 10.3389/fimmu.2021.670178 PMC8257051 63 Rastogi S Mishra SS Arora MK Lactate acidosis and simultaneous recruitment of TGF‐β leads to alter plasticity of hypoxic cancer cells in tumor microenvironment Pharmacol Ther 2023 250 108519 37625521 10.1016/j.pharmthera.2023.108519 64 Takahashi H Alves CRR Stanford KI TGF‐β2 is an exercise‐induced adipokine that regulates glucose and fatty acid metabolism Nat Metab 2019 1 2 291 303 31032475 10.1038/s42255-018-0030-7 PMC6481955 65 Gu J Zhou J Chen Q Xu X Tumor metabolite lactate promotes tumorigenesis by modulating MOESIN lactylation and enhancing TGF‐β signaling in regulatory T cells Cell Rep 2022 40 3 111122 35858574 10.1016/j.celrep.2022.111122 66 Chen J Zhao D Wang Y Lactylated apolipoprotein C‐II induces immunotherapy resistance by promoting extracellular lipolysis Adv Sci (Weinh) 2024 11 38 e2406333 38981044 10.1002/advs.202406333 PMC11481198 67 Ansa‐Addo EA Zhang Y Yang Y Membrane‐organizing protein moesin controls Treg differentiation and antitumor immunity via TGF‐β signaling J Clin Invest 2017 127 4 1321 1337 28287407 10.1172/JCI89281 PMC5373867 68 Wang S Huang T Wu Q Lactate reprograms glioblastoma immunity through CBX3‐regulated histone lactylation J Clin Invest 2024 134 22 e176851 39545414 10.1172/JCI176851 PMC11563687 69 Ye D Zhou S Dai X Targeting the MHC‐I endosomal‐lysosomal trafficking pathway in cancer: from mechanism to immunotherapy Biochim Biophys Acta Rev Cancer 2024 1879 5 189161 39096977 10.1016/j.bbcan.2024.189161 70 Zhang C Zhou L Zhang M H3K18 lactylation potentiates immune escape of non‐small cell lung cancer Cancer Res 2024 10.1158/0008-5472.CAN-23-3513 39137401 71 Zhou C Li W Liang Z Mutant KRAS‐activated circATXN7 fosters tumor immunoescape by sensitizing tumor‐specific T cells to activation‐induced cell death Nat Commun 2024 15 1 499 38216551 10.1038/s41467-024-44779-1 PMC10786880 72 Tyl MD Merengwa VU Cristea IM Infection‐induced lysine lactylation enables herpesvirus immune evasion Sci Adv 2025 11 2 eads6215 39772686 10.1126/sciadv.ads6215 PMC11708889 73 Liu R Wu J Guo H Post‐translational modifications of histones: mechanisms, biological functions, and therapeutic targets MedComm (2020) 2023 4 3 e292 37220590 10.1002/mco2.292 PMC10200003 74 Ganesh K Massagué J Targeting metastatic cancer Nat Med 2021 27 1 34 44 33442008 10.1038/s41591-020-01195-4 PMC7895475 75 Pajak B Siwiak E Sołtyka M 2‐Deoxy‐D‐glucose and its analogs: from diagnostic to therapeutic agents Int J Mol Sci 2019 21 1 234 31905745 10.3390/ijms21010234 PMC6982256 76 Geschwind JF Georgiades CS Ko YH Pedersen PL Recently elucidated energy catabolism pathways provide opportunities for novel treatments in hepatocellular carcinoma Expert Rev Anticancer Ther 2004 4 3 449 57 15161443 10.1586/14737140.4.3.449 77 Sheng SL Liu JJ Dai YH Sun XG Xiong XP Huang G Knockdown of lactate dehydrogenase A suppresses tumor growth and metastasis of human hepatocellular carcinoma FEBS J 2012 279 20 3898 910 22897481 10.1111/j.1742-4658.2012.08748.x 78 Yao J Liu J Zhao W By blocking hexokinase‐2 phosphorylation, limonin suppresses tumor glycolysis and induces cell apoptosis in hepatocellular carcinoma Onco Targets Ther 2018 11 3793 3803 30013360 10.2147/OTT.S165220 PMC6037266 79 Kirkland JL Tchkonia T Senolytic drugs: from discovery to translation J Intern Med 2020 288 5 518 536 32686219 10.1111/joim.13141 PMC7405395 80 Wang Y Hao F Nan Y PKM2 inhibitor shikonin overcomes the cisplatin resistance in bladder cancer by inducing necroptosis Int J Biol Sci 2018 14 13 1883 1891 30443191 10.7150/ijbs.27854 PMC6231221 81 Martin SP Fako V Dang H PKM2 inhibition may reverse therapeutic resistance to transarterial chemoembolization in hepatocellular carcinoma J Exp Clin Cancer Res 2020 39 1 99 32487192 10.1186/s13046-020-01605-y PMC7268641 82 Amorim R Pinheiro C Miranda‐Gonçalves V Monocarboxylate transport inhibition potentiates the cytotoxic effect of 5‐fluorouracil in colorectal cancer cells Cancer Lett 2015 365 1 68 78 26021766 10.1016/j.canlet.2015.05.015 83 Zhao Z Han F Yang S Wu J Zhan W Oxamate‐mediated inhibition of lactate dehydrogenase induces protective autophagy in gastric cancer cells: involvement of the Akt‐mTOR signaling pathway Cancer Lett 2015 358 1 17 26 25524555 10.1016/j.canlet.2014.11.046 84 Shelley MD Hartley L Fish RG Stereo‐specific cytotoxic effects of gossypol enantiomers and gossypolone in tumour cell lines Cancer Lett 1999 135 2 171 80 10096426 10.1016/s0304-3835(98)00302-4 85 Kim EY Chung TW Han CW A novel lactate dehydrogenase inhibitor, 1‐(phenylseleno)‐4‐(trifluoromethyl) benzene, suppresses tumor growth through apoptotic cell death Sci Rep 2019 9 1 3969 30850682 10.1038/s41598-019-40617-3 PMC6408513 86 Park JH Kundu A Lee SH Specific pyruvate kinase M2 inhibitor, compound 3K, induces autophagic cell death through disruption of the glycolysis pathway in ovarian cancer cells Int J Biol Sci 2021 17 8 1895 1908 34131394 10.7150/ijbs.59855 PMC8193271 87 George K Thomas NS Malathi R 4,4'‐Diisothiocyanatostilbene‐2,2'‐disulfonate modulates voltage‐gated K + Toxicol Mech Methods 2020 30 5 358 369 32193973 10.1080/15376516.2020.1745343 88 Liu Y Guo JZ Liu Y Nuclear lactate dehydrogenase A senses ROS to produce α‐hydroxybutyrate for HPV‐induced cervical tumor growth Nat Commun 2018 9 1 4429 30356100 10.1038/s41467-018-06841-7 PMC6200739 89 Liu X Zou X Zhou Y Chen R Peng Y Qu M LDHA and LDHB overexpression promoted the Warburg effect in malignantly transformed GES‐1 cells induced by N‐nitroso compounds Food Chem Toxicol 2023 180 114007 37648104 10.1016/j.fct.2023.114007 90 Qing Y Dong L Gao L R‐2‐hydroxyglutarate attenuates aerobic glycolysis in leukemia by targeting the FTO/m 6 Mol Cell 2021 81 5 922 939.e9 33434505 10.1016/j.molcel.2020.12.026 PMC7935770 91 Dorneburg C Fischer M Barth TFE LDHA in neuroblastoma is associated with poor outcome and its depletion decreases neuroblastoma growth independent of aerobic glycolysis Clin Cancer Res 2018 24 22 5772 5783 29925504 10.1158/1078-0432.CCR-17-2578 92 Huo N Cong R Sun ZJ STAT3/LINC00671 axis regulates papillary thyroid tumor growth and metastasis via LDHA‐mediated glycolysis Cell Death Dis 2021 12 9 799 34404767 10.1038/s41419-021-04081-0 PMC8371129 93 Pouysségur J Marchiq I Parks SK Durivault J Ždralević M Vucetic M Warburg effect’ controls tumor growth, bacterial, viral infections and immunity—genetic deconstruction and therapeutic perspectives Semin Cancer Biol 2022 86 Pt 2 334 346 35820598 10.1016/j.semcancer.2022.07.004 94 Cheng A Zhang P Wang B Aurora‐A mediated phosphorylation of LDHB promotes glycolysis and tumor progression by relieving the substrate‐inhibition effect Nat Commun 2019 10 1 5566 31804482 10.1038/s41467-019-13485-8 PMC6895051 95 Tian LR Lin MZ Zhong HH Nanodrug regulates lactic acid metabolism to reprogram the immunosuppressive tumor microenvironment for enhanced cancer immunotherapy Biomater Sci 2022 10 14 3892 3900 35686599 10.1039/d2bm00650b 96 Ma J Tang L Tan Y Lithium carbonate revitalizes tumor‐reactive CD8 + Nat Immunol 2024 25 3 552 561 38263463 10.1038/s41590-023-01738-0 PMC10907288 97 Brandstetter G Blatt S Goldschmitt J Taylor L Heymann P Al‐Nawas B Ziebart T Targeted sensitization of tumor cells for radiation through monocarboxylate transporters 1 and 4 inhibition in vitro Clin Oral Investig 2021 25 1 295 310 10.1007/s00784-020-03364-8 32495222 98 Harris T Eliyahu G Frydman L Degani H Kinetics of hyperpolarized 13C1‐pyruvate transport and metabolism in living human breast cancer cells Proc Natl Acad Sci USA 2009 106 43 18131 6 19826085 10.1073/pnas.0909049106 PMC2775348 99 Wang ZH Zhang P Peng WB Altered phenotypic and metabolic characteristics of FOXP3 + + + Oncoimmunology 2022 12 1 2160558 36567801 10.1080/2162402X.2022.2160558 PMC9788685 100 Yu Y Huang X Liang C Zhang P Evodiamine impairs HIF1A histone lactylation to inhibit Sema3A‐mediated angiogenesis and PD‐L1 by inducing ferroptosis in prostate cancer Eur J Pharmacol 2023 957 176007 37611839 10.1016/j.ejphar.2023.176007 101 Pan L Feng F Wu J Demethylzeylasteral targets lactate by inhibiting histone lactylation to suppress the tumorigenicity of liver cancer stem cells Pharmacol Res 2022 181 106270 35605812 10.1016/j.phrs.2022.106270 102 Benson AB Venook AP Adam M NCCN Guidelines® Insights: rectal cancer, Version 3.2024 J Natl Compr Canc Netw 2024 22 6 366 375 39151454 10.6004/jnccn.2024.0041 103 Li W Zhou C Yu L Tumor‐derived lactate promotes resistance to bevacizumab treatment by facilitating autophagy enhancer protein RUBCNL expression through histone H3 lysine 18 lactylation (H3K18la) in colorectal cancer Autophagy 2024 20 1 114 130 37615625 10.1080/15548627.2023.2249762 PMC10761097 104 Azzam EI Jay‐Gerin JP Pain D Ionizing radiation‐induced metabolic oxidative stress and prolonged cell injury Cancer Lett 2012 327 1‐2 48 60 22182453 10.1016/j.canlet.2011.12.012 PMC3980444 105 Huang RX Zhou PK DNA damage response signaling pathways and targets for radiotherapy sensitization in cancer Signal Transduct Target Ther 2020 5 1 60 32355263 10.1038/s41392-020-0150-x PMC7192953 106 Xu J Zhu W Xu W Silencing of MBD1 reverses pancreatic cancer therapy resistance through inhibition of DNA damage repair Int J Oncol 2013 42 6 2046 52 23588667 10.3892/ijo.2013.1901 107 Watanabe S Watanabe K Akimov V JMJD1C demethylates MDC1 to regulate the RNF8 and BRCA1‐mediated chromatin response to DNA breaks Nat Struct Mol Biol 2013 20 12 1425 33 24240613 10.1038/nsmb.2702 108 Maréchal A Zou L DNA damage sensing by the ATM and ATR kinases Cold Spring Harb Perspect Biol 2013 5 9 a012716 24003211 10.1101/cshperspect.a012716 PMC3753707 109 Li G Wang D Zhai Y Pan C Zhang J Wang C Glycometabolic reprogramming‐induced XRCC1 lactylation confers therapeutic resistance in ALDH1A3‐overexpressing glioblastoma Cell Metab 2024 36 8 1696 1710.e10 39111285 10.1016/j.cmet.2024.07.011 110 Yang Y Chong Y Chen M Targeting lactate dehydrogenase A improves radiotherapy efficacy in non‐small cell lung cancer: from bedside to bench J Transl Med 2021 19 170 33902615 10.1186/s12967-021-02825-2 PMC8074241 111 Chaube B Malv P Singh SV Targeting metabolic flexibility by simultaneously inhibiting respiratory complex I and lactate generation retards melanoma progression Oncotarget 2015 6 37281 37299 26484566 10.18632/oncotarget.6134 PMC4741930 112 Rai G Brimacombe KR Discovery and optimization of potent, cell‐active pyrazole‐based inhibitors of lactate dehydrogenase (LDH) J Med Chem. 2017 60 9184 9204 29120638 10.1021/acs.jmedchem.7b00941 PMC5894102 113 Le A Cooper CR Gouw AM Inhibition of lactate dehydrogenase A induces oxidative stress and inhibits tumor progression Proc Natl Acad Sci USA 2010 107 2037 2042 20133848 10.1073/pnas.0914433107 PMC2836706 114 Halford S Veal GJ Wedge SR A Phase I dose‐escalation study of AZD3965, an oral monocarboxylate transporter 1 inhibitor, in patients with advanced cancer Clin Cancer Res 2023 29 1429 1439 36652553 10.1158/1078-0432.CCR-22-2263 PMC7614436 115 Noble RA Bell N Blair H Inhibition of monocarboxyate transporter 1 by AZD3965 as a novel therapeutic approach for diffuse large B‐cell lymphoma and Burkitt lymphoma Haematologica 2017 102 1247 1257 28385782 10.3324/haematol.2016.163030 PMC5566036 116 Barros LF Metabolic signaling by lactate in the brain Trends Neurosci 2013 36 396 404 23639382 10.1016/j.tins.2013.04.002 117 Lai FL Gao F Auto‐Kla: a novel web server to discriminate lysine lactylation sites using automated machine learning Brief. Bioinform 2023 24 bbad070 36869843 10.1093/bib/bbad070 118 Levitin HM Yuan J Sims PA Single‐cell transcriptomic analysis of tumor heterogeneity Trends Cancer 2018 4 264 268 29606308 10.1016/j.trecan.2018.02.003 PMC5993208 119 Khoo BL Grenci G Lim Y Expansion of patient‐derived circulating tumor cells from liquid biopsies using a CTC microfluidic culture device Nat Protoc 2018 13 34 58 29215634 10.1038/nprot.2017.125 120 Meng Z Zhang X Tan H Lian H Zinc‐enriched nanosystem for dual glycolysis regulation and photothermal therapy to synergistically inhibit primary melanoma and lung metastasis Chem Eng J 2022 435 134781 121 Karlsson MJ Svedman FC Tebani A Inflammation and apolipoproteins are potential biomarkers for stratification of cutaneous melanoma patients for immunotherapy and targeted therapy Cancer Res 2021 81 2545 2555 33574091 10.1158/0008-5472.CAN-20-2000 122 Qiao T Xiong Y Feng Y Inhibition of LDH‐A by oxamate enhances the efficacy of anti‐PD‐1 treatment in an NSCLC humanized mouse model Front Oncol 2021 11 632364 33859941 10.3389/fonc.2021.632364 PMC8042335 123 Bonnet S Archer SL Turner JA A mitochondria‐K+ channel axis is suppressed in cancer and its normalization promotes apoptosis and inhibits cancer growth Cancer Cell 2007 11 37 51 17222789 10.1016/j.ccr.2006.10.020 124 Hong H Han H Wang L ABCF1‐K430‐Lactylation promotes HCC malignant progression via transcriptional activation of HIF1 signaling pathway Cell Death Differ 2025 10.1038/s41418-024-01436-w PMC11982231 39753865 125 Tian Z Yang K Yao Y Catalytically selective chemotherapy from tumor‐metabolic generated lactic acid Small 2019 15 e1903746 31553140 10.1002/smll.201903746 126 Sun K Shi Y Yan C Glycolysis‐derived lactate induces ACSL4 expression and lactylation to activate ferroptosis during intervertebral disc degeneration Adv Sci (Weinh) 2025 12 21 e2416149 40171826 10.1002/advs.202416149 PMC12140309 ",
  "metadata": {
    "Title of this paper": "Glycolysis‐derived lactate induces ACSL4 expression and lactylation to activate ferroptosis during intervertebral disc degeneration",
    "Journal it was published in:": "Clinical and Translational Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477887/"
  }
}