{
  "title": "Paper_606",
  "abstract": "pmc Molecules Molecules 3416 molecules molecules Molecules 1420-3049 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472313 PMC12472313.1 12472313 12472313 41011603 10.3390/molecules30183710 molecules-30-03710 1 Article Synthesis, Clastogenic and Cytotoxic Potential, and In Vivo Antitumor Activity of a Novel N-Mustard Based on Indole-3-carboxylic Acid Derivative https://orcid.org/0000-0002-9690-4746 Filimonova Marina 1 2 * https://orcid.org/0000-0002-1178-3560 Soldatova Olga 1 2 https://orcid.org/0000-0001-5512-9096 Shitova Anna 1 2 Surinova Valentina Validation Formal analysis 1 2 https://orcid.org/0000-0001-8820-9965 Rybachuk Vitaly Formal analysis Investigation 1 2 https://orcid.org/0000-0003-2173-388X Kosachenko Alexander 1 2 https://orcid.org/0000-0003-0518-8228 Nikolaev Kirill 1 2 Filatova Daria 1 2 Prosovskaya Ekaterina 1 2 Ivanov Sergey 1 Shegay Petr Supervision 2 3 Kaprin Andrey Supervision 2 3 https://orcid.org/0000-0002-4398-1764 Filimonov Alexander 1 2 Mangalagiu Ionel Academic Editor 1 ovsoldatova97@gmail.com annaredrose@mail.ru val_surinova@mail.ru br.shepard@list.ru nireallki@gmail.com filatovadaria.nik@gmail.com ekaterina.prosovskaya@gmail.com oncourolog@gmail.com filimonov_alex@mail.ru 2 dr.shegai@mail.ru kaprin@mail.ru 3 * vladimirovna.fil@gmail.com 12 9 2025 9 2025 30 18 496804 3710 11 8 2025 05 9 2025 11 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Compound T1089—a novel nitrogen mustard based on an indole-3-carboxylic acid derivative (ICAD)—has been synthesized. The ICAD used as the basis for T1089 is a TLR agonist capable of activating an antitumor immune response. This study describes the synthesis method and presents the results of preliminary investigations of this compound. This research included an assessment of acute toxicity in mice, in vivo clastogenic activity evaluated via the bone marrow chromosome aberration (BMCA) test in mice, in vitro cytotoxicity determined by the MTT assay against human lung carcinoma A549 cells, and in vivo antitumor effects (ATEs) in models of conventional chemotherapy (CCT) of solid tumors in mice. The bifunctional alkylating agent cyclophosphamide (CPA) was used as a reference drug. Toxicological 16 50 In vitro 50 50 Differences A high In summary nitrogen mustard indole-3-carboxylic acid derivative alkylating agent TLR agonist clastogenic effect cytotoxic effect antitumor effect conventional chemotherapy metronomic chemotherapy Ministry of Health of the Russian Federation Russian Foundation for Basic Research and Kaluga Region 16-44-400256 This research was partially financially supported by the Ministry of Health of the Russian Federation and partially by the Russian Foundation for Basic Research and Kaluga Region, grant number 16-44-400256. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cancer remains one of the most severe social and medical challenges, posing a significant threat to global health. According to the International Agency for Research on Cancer (IARC), approximately 20 million new cancer cases and 9.7 million cancer-related deaths were reported worldwide in 2022. By 2050, the global cancer burden is projected to rise to 35 million cases [ 1 2 3 4 5 6 7 Chemotherapy for cancer has a long history spanning over 80 years. The oldest class of anticancer agents is alkylating agents (AAs). Their development began with the discovery of the antitumor activity of nitrogen mustard. Initially, AAs were used as chemical weapons during World War I, causing severe vesicant effects accompanied by bone marrow aplasia and pancytopenia [ 8 9 10 11 12 13 14 15 16 AAs are electrophilic compounds that react with nucleophilic DNA sites (ring N and extracyclic O atoms in DNA bases), leading to the covalent transfer of an alkyl group [ 15 17 17 18 19 Under such mechanisms of alteration leading to the cytotoxic action of alkylating agents (AAs), as well as to the effects of ionizing radiation, which also damages DNA, the most sensitive tissues are those that are actively proliferating. This enables the achievement of therapeutic effects in chemotherapy with AAs for actively growing malignant neoplasms. However, it also creates conditions for the development of systemic genotoxic, mutagenic, and carcinogenic effects, as well as hematological or non-hematological organ-specific complications [ 20 21 22 23 24 25 26 In this regard, from their discovery to the present day, AAs have remained the subject of intensive research efforts aimed at developing safer and more effective agents. Currently, various approaches are employed to improve the therapeutic profile of AAs, including structural modifications of synthetic and natural AAs, as well as the development of new alkylating therapy technologies. To enhance targeted delivery, tumor selectivity, and cytotoxic efficacy, research is being conducted on hypoxia-activated and tumor-associated enzyme-activated bioreductive alkylating prodrugs, conjugates of AAs with antibodies and ligands for tumor receptors, conjugates of AAs with tumor-targeting pharmacophores, steroid-based AAs for hormone-sensitive tumors, DNA-targeted AAs specific to the minor groove, novel technologies for antibody-directed and gene-directed enzyme alkylating therapy, and synergistic modulation of DNA alkylation-induced signaling pathways [ 15 16 19 27 28 29 30 Moreover, in recent decades, there has been a significant revision of alkylating therapy strategies themselves [ 31 32 33 34 35 As early as the 1970s, data emerged indicating that immune factors significantly contribute to the effects of AAs, leading to the formulation of the concept of their dual antitumor action: direct cytotoxic effects and indirect effects mediated by the activation of antitumor immunity [ 36 37 38 39 In metronomic therapy with AAs, antitumor effects arise from their impact on various cells in the tumor microenvironment and are mediated by anti-angiogenic action (reduction in circulating endothelial progenitor cells, stimulation of TSP1 secretion, and apoptosis of proliferating endothelial cells) and the induction of T-cell-dependent immune responses (inhibition of immunosuppressive Treg cells, decreased levels of immunosuppressive cytokines, recovery of IFN-γ-producing NK cells, polarization of Th1 and Th17 lymphocytes and macrophages, and activation of dendritic cells) [ 40 41 42 43 44 45 46 31 33 47 The Laboratory of Radiation Pharmacology at the A.F. Tsyb Medical Radiological Research Center has long been engaged in the chemistry and pharmacology of indole-3-carboxylic acid derivatives. In recent years, we have synthesized a series of new aminoalkyl esters of 5-methoxyindole-3-carboxylic acid exhibiting antiviral and interferon-inducing activity [ 48 49 50 51 48 49 50 At the same time, recent data suggest that TLR agonists, by inducing acute inflammatory responses, stimulate dendritic cell maturation and antigen presentation, thereby activating antitumor immune responses and creating prospects for their use in combination with immune checkpoint inhibitors and antitumor vaccines [ 52 53 54 55 16 Concurrently, having confirmed that the immunomodulatory activity of the studied ICADs can inhibit tumor growth and metastatic progression, we deemed it appropriate to enhance these compounds with dual antitumor action by incorporating cytotoxic alkylating properties through the introduction of a nitrogen mustard moiety into their molecular structure. Based on one of the investigated ICADs, we successfully synthesized such a compound [ 56 Figure 1 Figure 1 17 19 53 54 This study provides a detailed description of the synthesis of T1089 and presents the results of the initial stage of pharmacological investigations, aimed at evaluating toxicological characteristics, clastogenic and mutagenic activity, cytotoxic potential in vitro, and antitumor effects in vivo under conventional chemotherapy regimens. For comparative assessment, CPA—a bifunctional AA widely used in conventional and metronomic chemotherapy—was employed as a reference compound. 2. Results 2.1. Synthesis of Compound T1089 and Its Physicochemical Properties The synthesis scheme for compound T1089 is illustrated in Figure 2 Figure 2 57 Figure 2 Stage 1—Preparation of 1,2-dimethyl-5-methoxy-3-ethoxycarbonylindole ( Figure 2 To a solution of 0.02 M dimecarbin in 40 mL of dioxane, 40 mL of a 10% NaOH solution was added under stirring. Subsequently, 4 mL of dimethyl sulfate was added dropwise. The mixture was stirred for 1 h, during which a precipitate formed. The mixture was diluted with water, the precipitate was filtered off, and washed with water. Recrystallization was performed from ethanol. Yield: 4.65 g (94%). Mp 113–115 °C. Stage 2—Preparation of 1,2-dimethyl-3-carbethoxy-5-methoxy-6-bromoindole ( Figure 2 To a solution of 4.65 g (0.0188 M) of 1,2-dimethyl-5-methoxy-3-ethoxycarbonylindole in 75 mL of CCl 4 N 4 Stage 3—Preparation of 1-methyl-2-bromomethyl-3-carbethoxy-5-methoxy-6-bromoindole ( Figure 2 A mixture of 3.3 g (0.01 M) of 1,2-dimethyl-3-carbethoxy-5-methoxy-6-bromoindole, 0.1 g (0.0004 M) of benzoyl peroxide, and 1.78 g (0.01 M) of N 4 4 Stage 4—Final Stage. The 1-methyl-2-bromomethyl-3-carbethoxy-5-methoxy-6-bromoindole obtained in Stage 3 was reacted with di(2-chloroethyl)amine hydrochloride, which was preliminarily prepared by the reaction of diethanolamine with thionyl chloride in chloroform. To a solution of 0.64 g (0.005 M) of di(2-chloroethyl)amine hydrochloride in 30 mL of dioxane, 0.7 mL of triethylamine (TEA) was added. Separately, 2.05 g (0.005 M) of 1-methyl-2-bromomethyl-3-carbethoxy-5-methoxy-6-bromoindole was dissolved in 30 mL of dioxane and 0.7 mL of TEA. The solutions were combined and heated at 60 °C. The precipitated TEA·HCl and TEA·HBr were filtered off and washed with hot dioxane. The filtrate was evaporated, and the residue was triturated with 5–7 drops of water. Recrystallization was performed from isopropanol. Yield: 1.57 g (67%). Mp 99–100 °C. The structure of the obtained compound T1089 and the acceptable purity of the substance were confirmed by the correspondence of the 1 13 Figure 3 NMR spectrum 1 d 6 J 3 J 2 J 2 3 3 2 J 2 4 7 NMR spectrum 13 d 6 3 3 2 2 2 3 2 4 3 6 7 3a 7a 2 5 The structure of T1089 was also confirmed by high-resolution mass spectrometry (HRMS) and elemental analysis (EA) of C, H and N. HRMS: [M+H] + 18 24 2 2 3 m z Figure S1 18 23 2 2 3 Chemical formula T1089: C 18 23 2 2 3 The substance of compound T1089 is a powder of non-uniform flakes of pale yellow color, insoluble in water, well soluble in alcohols, DMSO, dioxane and chloroform. 2.2. Toxicological Properties of Compound T1089 The toxicological characteristics of T1089 were studied in outbred male ICR (CD-1) mice using an acute toxicity test following a single intraperitoneal (i.p.) administration at doses ranging from 180 to 220 mg/kg. The mice tolerated T1089 satisfactorily at the tested doses, with no significant changes in behavior or signs of acute intoxication observed. However, at doses of 190 mg/kg and higher, a decrease in body weight, increasing hypoactivity, and delayed mortality were noted in some mice by days 4–7 post-administration. During the 14-day observation period, the mortality rate in the experimental groups exhibited a dose-dependent pattern: 0.0% (0/5) at 180 mg/kg 12.5% (1/8) at 190 mg/kg 50.0% (3/6) at 200 mg/kg 75.0% (6/8) at 210 mg/kg 100.0% (5/5) at 220 mg/kg Probit analysis of these data yielded the following standard toxicity parameters: LD 10 LD 16 LD 50 LD 84 Based on these values, compound T1089 can be classified as a moderately toxic substance (Hazard Class 3) [ 58 2.3. Cytotoxic Activity of Cyclophosphamide and T1089 In Vitro According to the MTT assay data, the cytotoxic effects of CPA and compound T1089 on human lung carcinoma A549 cells qualitatively differed ( Figure 4 Tables S1 and S2 50 50 59 In contrast, the in vitro effect of compound T1089 on A549 cells was 125 times more cytotoxic. Significant cytotoxic effects of T1089 were observed even at low concentrations (15–50 μM; IC 50 50 2.4. Clastogenic (Mutagenic) Activity of Cyclophosphamide and T1089 In Vivo A comparative study of the clastogenic activity (ability to induce DNA strand breaks) of CPA and compound T1089 was conducted in female F 1 60 Figure 5 61 62 In contrast, a single i.p. injection of CPA and T1089 at an equimolar dose of 0.064 mmol/kg (16.9 and 30.0 mg/kg, respectively) resulted in a statistically significant ( p 63 64 Figure 5 Table S3 63 2.5. In Vivo Antitumor Effect of Cyclophosphamide and T1089 on Solid Ehrlich Carcinoma A comparative study of the antitumor activity of CPA and T1089 in vivo was conducted on Ehrlich solid carcinoma (ESC) in female F 1 50 50 The obtained data indicated high resistance of ESC to CPA at the administered dose. The antitumor effect of CPA increased gradually over the course of treatment, reaching a significant level only after four injections. By the end of the observation period, following seven administrations, the effect remained moderate, with the tumor inhibition (TI) index not exceeding 30% ( Figure 6 Tables S5 and S6 In contrast, ESC exhibited substantially higher sensitivity to T1089. The antitumor effect of T1089 upon repeated administration also displayed a cumulative and progressive nature, but the rate of development and magnitude of the effect were significantly greater. A statistically significant effect of T1089 was observed as early as after two injections, reached its maximum (TI index—53%) after four administrations, and remained at this high level until the end of the experiment ( Figure 6 Tables S5 and S6 However, alongside the antitumor effects, this experiment also revealed negative, toxic effects of CPA and T1089. According to clinical observations, mice bearing ESC tolerated the seven i.p. administrations of CPA and T1089 at the tested dose satisfactorily. No signs of acute intoxication, changes in behavioral responses or feeding activity, or animal mortality were observed. However, body weight (BW) monitoring indicated the development of a significant deficit (8–10% BW) in CPA-treated and T1089-treated mice compared to control animals ( Figure 6 Table S7 2.6. In Vivo Antitumor Effect of T1089 on Melanoma B-16 To more objectively evaluate the antitumor potential of T1089 in vivo and determine its optimal therapeutic dose, a study was conducted to assess the effects of this compound on B-16 melanoma in female C57BL6j mice. The compound was administered intraperitoneally (i.p.) six times at 48 h intervals at a dose of 28 mg/kg (1/7 of the LD 50 The results of this experiment demonstrated that B-16 melanoma was highly sensitive to T1089 at the administered dose. After just two injections, the antitumor effect of T1089 reached its maximum (TI index—56%), and the subsequent four injections maintained a high level of efficacy (TI index—52–55%) until the end of the observation period ( Figure 7 Tables S9 and S10 Figure 7 An important finding of this experiment was that at this lower dose, T1089 produced such a significant antitumor effect with minimal toxicity. In this case, the body weight (BW) deficit in T1089-treated mice compared to controls was limited and reached a significant level only at the final observation time point ( Figure 7 3. Discussion The compound we synthesized, T1089 ( Figure 1 N 51 55 Toxicological studies have established that T1089 is a relatively safe compound, classified as hazard class 3 [ 58 16 50 50 59 The presence of two reactive sites (chloroethyl groups) in the structure of T1089 confers upon this compound the properties of bifunctional alkylating agents (AAs), similar to CPA, which has an analogous reactive group. The alkylating effect of such agents on DNA leads to the formation of difficult-to-repair damage (intra- or interstrand cross-links and DNA strand breaks), accompanied by the stimulation of structural mutagenesis and a pronounced cytotoxic effect [ 17 19 Figure 5 Table S3 p 63 64 63 At the same time, the data from studies on the cytotoxic effects of CPA and T1089 in vitro indicated that the mechanism of alkylating action likely differs significantly between these compounds ( Figure 4 Tables S1 and S2 N 17 19 50 50 50 50 Significant differences in the effects of CPA and T1089 were also observed in the study of antitumor activity in vivo on the model of conventional ESC chemotherapy in mice ( Figure 6 Tables S5–S7 50 50 Despite the relatively “harsh” chemotherapy regimen, ESC exhibited significant resistance to CPA. The antitumor effect of CPA increased slowly over the course of treatment, reaching a significant level only after four injections, and by the end of observations—after seven administrations—remained moderate, with the TI index not exceeding 30%. In contrast, ESC was substantially more sensitive to T1089 under the same chemotherapy conditions, and at all observation time points, the effects of T1089 significantly exceeded those of CPA. The dynamics of T1089′s antitumor effect also followed a cumulative pattern, but the rate of development and magnitude of the effect were qualitatively higher. A significant effect of T1089 was achieved after just two injections, with the maximum effect (TI index—53%) observed after four administrations. This high level of efficacy was maintained until the end of the experiment. The high antitumor efficacy of T1089 in vivo was also confirmed in studies using the B-16 melanoma chemotherapy model in mice ( Figure 7 Tables S9–S12 50 At the same time, B-16 melanoma remained highly sensitive to the action of T1089 even in this milder chemotherapy regimen. After two injections, the antitumor effect of T1089 reached its maximum development (TI index—56%), and the subsequent four injections maintained a consistently high level of efficacy (TI index—52–55%) until the end of the observation period. Thus, the data obtained during the initial stage of pharmacological studies of T1089 indicate that this compound possesses alkylating activity characteristic of bifunctional agents, which is accompanied by high cytotoxic activity in vitro and pronounced antitumor effects in vivo in animal tumor models of conventional chemotherapy (at high doses of the agent). At the same time, given that the indole-3-carboxylic acid derivative used as the basis for T1089 is a TLR agonist capable of activating an antitumor immune response, T1089 can be considered an alkylating agent with dual antitumor action. Overall, this highlights the need for further studies of this agent in conventional chemotherapy and metronomic chemotherapy, particularly in combinations with immune checkpoint blockers and antitumor vaccines. 4. Materials and Methods 4.1. T1089 and Other Compounds and Solutions The investigated compound T1089 was synthesized in the Laboratory of Radiation Pharmacology at A. Tsyb MRRC. The synthetic methodology for T1089 was previously reported in a patent application [ 56 1 13 d 6 T1089 is a pale-yellow, flaky powder, insoluble in water but readily soluble in alcohols, DMSO, dioxane, and chloroform. For in vivo studies (acute toxicity, chromosome aberration assay, and antitumor efficacy in solid tumor models), T1089 was administered intraperitoneally (i.p.) as an aqueous suspension prepared ex tempore using sterile water for injection (Grotex, Saint Petersburg, Russia) with 0.5% hypromellose (Nippon Soda Co., Tokyo, Japan) as a suspending agent. For in vitro cytotoxicity assays, T1089 was dissolved in 1.0% DMSO (PanEco Ltd., Kaluga, Russia). In most experiments, cyclophosphamide (CPA) served as the reference compound. CPA was obtained as a pharmacopoeial-grade powder (Endoxan; Baxter, Unterschleissheim, Germany) for intravenous administration and was dissolved in either sterile water for injection or deionized water. In in vivo studies, control (untreated) animals received an equivalent volume of 0.9% sodium chloride (Dalchimpharm JSC, Khabarovsk, Russia) administered i.p. 4.2. In Vitro Cytotoxic Activity Studies Comparative in vitro study of the cytotoxic activity of CPA and compound T1089 was performed using the MTT assay on human lung carcinoma A549 cells. CPA was tested at concentrations ranging from 62.5 to 4000 μM, while T1089 was evaluated at concentrations of 1.56 to 100 μM. The concentration ranges were determined based on preliminary MTT assay data for these compounds. T1089 was dissolved in a 1% DMSO solution (PanEco Ltd., Kaluga, Russia) prepared in DMEM medium (PanEco) supplemented with fetal bovine serum (PanEco). The final DMSO concentrations did not exceed 0.5% and were non-toxic to the cells. CPA was dissolved in deionized water (PanEco). The test compounds were added to the culture medium, followed by cell incubation, MTT dye (PanEco) addition, formazan extraction, spectrophotometric measurements, and quantitative data analysis, as previously described in our study [ 65 50 4.3. Animals The in vivo studies were conducted on 31 male outbred ICR (CD-1) mice (age 2.5–3 months, body weight 22–25 g), 81 female F 1 Animal experiments were approved by the Ethics Committee of MRRC and performed in accordance with standard operating procedures compliant with the requirements of the European Convention ETS/STE No. 123. Scheduled euthanasia of mice was carried out using a CO 2 4.4. Toxicological Studies of Compound T1089 Toxicological studies of T1089 were conducted on 31 male outbred ICR (CD-1) mice using the Litchfield and Wilcoxon method in an acute toxicity test following a single intraperitoneal (i.p.) administration [ 66 50 66 10 16 50 84 4.5. Study of Clastogenic (Mutagenic) Activity of Cyclophosphamide and T1089 The comparative investigation of the clastogenic effect (ability to induce DNA strand breaks) of cyclophosphamide (CPA) and compound T1089 was conducted using 18 female F 1 60 The first group received a single intraperitoneal (i.p.) injection of 0.9% sodium chloride at a dose of 10.0 mL/kg. The second group was administered CPA at a dose of 0.064 mmol/kg (16.9 mg/kg; 10.0 mL/kg of a 0.17% solution) via the same route. The third group received T1089 at an equimolar dose of 0.064 mmol/kg (30.0 mg/kg; 10.0 mL/kg of a 0.3% suspension). Twenty-two hours after treatment, all animals were injected intraperitoneally (i.p.) with colchicine (PanEco) at a dose of 4 mg/kg. After 24 h, the mice were euthanized via CO 2 60 67 For each animal, 110–130 well-spread metaphases containing at least 40 centromeres were analyzed under high magnification using a Leica DM 1000 microscope (Leica Microsystems CMS GmbH, Wetzlar, Germany). Metaphases with excessively scattered chromosomes or those with very short and/or misaligned chromatids were excluded. The following aberrations were recorded per metaphase: achromatic gaps, chromatid breaks (with or without accompanying fragments), chromatid fragments, chromosome fragments, chromatid exchanges, and chromosome exchanges. For statistical analysis, the minimal observational units were the frequency of aberrant cells and the frequencies of different aberration types per individual mouse. 4.6. Studies of the Antitumor Activity of Cyclophosphamide and T1089 In Vivo Studies on antitumor activity in vivo were conducted on two tumor models: solid Ehrlich carcinoma (ESC) in female F 1 ESC was transplanted into 63 female F 1 6 68 B-16 melanoma was transplanted into 42 female C57BL6j mice by subcutaneous injection into the lateral surface of the right thigh with 10 6 4.7. Statistical Analysis For all controlled quantitative indicators, the calculation of variation parameters was performed, and their values are presented, including graphically, as M ± SD. The statistical significance of intergroup differences was assessed using nonparametric methods: for pairwise comparison—with the Mann–Whitney U test; for multiple comparisons—with the Kruskal–Wallis rank ANOVA test, followed by post hoc analysis using the Mann–Whitney U test with Holm–Bonferroni corrections [ 69 Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/molecules30183710/s1 Author Contributions Conceptualization, methodology, analysis, and writing, M.F. and A.F.; Chemical synthesis and analysis, V.S., D.F. and E.P.; Investigation and formal analysis, O.S., A.S., V.R., A.K. (Alexander Kosachenko) and K.N. Supervision P.S., A.K. (Andrey Kaprin) and S.I. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted according to the guidelines of the Declaration of Helsinki (ETS-123) and approved by the Ethics Committee of A. Tsyb Medical Radiological Research Center (protocol code 1-D-00041). Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article and Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript, or in the decision to publish the results. Abbreviations AAs—alkylating agents; ATE—antitumor effect; BMCA—bone marrow chromosome aberration, BW—body weight; CCT—conventional chemotherapy; CPA—cyclophosphamide; ESC—Ehrlich solid carcinoma; IARC—International Agency for Research on Cancer; ICAD—indole-3-carboxylic acid derivative, MTD—maximum tolerated dose; TI—tumor inhibition; TV—tumor volume. References 1. Bray F. Laversanne M. Sung H. Ferlay J. Siegel R.L. Soerjomataram I. Jemal A. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 2. Joshi D.C. Sharma A. Prasad S. Singh K. Kumar M. Sherawat K. Tuli H.S. Gupta M. Novel therapeutic agents in clinical trials: Emerging approaches in cancer therapy Discov. Oncol. 2024 15 342 10.1007/s12672-024-01195-7 39127974 PMC11317456 3. Berger M.F. Mardis E.R. The emerging clinical relevance of genomics in cancer medicine Nat. Rev. Clin. Oncol. 2018 15 353 365 10.1038/s41571-018-0002-6 29599476 PMC6658089 4. Singh M. Kumar V. Sehrawat N. Yadav M. Chaudhary M. Upadhyay S.K. Kumar S. Sharma V. Kumar S. Dilbaghi N. Current paradigms in epigenetic anticancer therapeutics and future challenges Semin. Cancer Biol. 2022 83 422 440 10.1016/j.semcancer.2021.03.013 33766649 5. Thompson M.K. Poortmans P. Chalmers A.J. Finn C.F. Hall E. Huddart R.A. Lievens Y. Montefiore D.S. Coles C.E. Practice-changing radiation therapy trials for the treatment of cancer: Where are we 150 years after the birth of Marie Curie? Br. J. Cancer 2018 119 389 407 10.1038/s41416-018-0201-z 30061587 PMC6117262 6. Izbicka E. Tolcher A.W. Development of novel alkylating drugs as anticancer agents Curr. Opin. Investig. Drugs 2004 5 587 591 15242245 7. Hu Z. Bousbaa H. Recent advances in anticancer strategies Cancers 2025 17 173 10.3390/cancers17020173 39857956 PMC11763798 8. Stewart M.J. Chemical Warfare Medical Committee Report No. 12 His Majesty’s Stationery Office (HMSO) London, UK 1918 9. Krumbhaar E.B. Role of the blood and bone marrow in certain forms of gas poisoning. I. Peripheral blood changes and their significance J. Am. Med. Assoc. 1919 72 39 41 10.1001/jama.1919.26110010018009f 10. Adair F.E. Bagg H.J. Experimental and clinical studies on the treatment of cancer by dichlorethylsulphide (mustard gas) Ann. Surg. 1931 93 190 199 10.1097/00000658-193101000-00026 17866462 PMC1398743 11. Gilman A. Philips F.S. The biological actions and therapeutic applications of the B-chloroethyl amines and sulfides Science 1946 103 409 436 10.1126/science.103.2675.409 17751251 12. Goodman L.S. Wintrobe M.M. Dameshek W. Goodman M.J. Gilman A. McLennan M.T. Nitrogen mustard therapy; use of methyl-bis (beta-chloroethyl) amine hydrochloride and tris (beta-chloroethyl) amine hydrochloride for Hodgkin’s disease, lymphosarcoma, leukemia and certain allied and miscellaneous disorders J. Am. Med. Assoc. 1946 132 126 132 10.1001/jama.1946.02870380008004 20997191 13. Rhoads C.P. Nitrogen mustards in the treatment of neoplastic disease; official statement J. Am. Med. Assoc. 1946 131 656 658 10.1001/jama.1946.02870250010003 20984885 14. Wilkinson J.F. Fletcher F. Effect of beta-chloroethylamine hydrochlorides in leukaemia, Hodgkin’s disease, and polycythaemia vera; report on 18 cases Lancet 1947 2 540 545 10.1016/S0140-6736(47)90586-2 20344806 15. Singh R.K. Kumar S. Prasad D.N. Bhardwaj T.R. Therapeutic journery of nitrogen mustard as alkylating anticancer agents: Historic to future perspectives Eur. J. Med. Chem. 2018 151 401 433 10.1016/j.ejmech.2018.04.001 29649739 16. Karati D. Mahadik K.R. Trivedi P. Kumar D. Alkylating agents, the road less traversed, changing anticancer therapy Anticancer Agents Med. Chem. 2022 22 1478 1495 10.2174/1871520621666210811105344 34382529 17. Chiorcea-Paquim A.-M. Oliveira-Brett A.M. Electrochemistry of chemotherapeutic alkylating agents and their interaction with DNA J. Pharm. Biomed. Anal. 2023 222 115036 10.1016/j.jpba.2022.115036 36244084 18. Fu D. Calvo J.A. Samson L.D. Balancing repair and tolerance of DNA damage caused by alkylating agents Nat. Rev. Cancer 2012 12 104 120 10.1038/nrc3185 22237395 PMC3586545 19. More G.S. Thomas A.B. Chitlange S.S. Nanda R.K. Gajbhiye R.L. Nitrogen mustards as alkylating agents: A review on chemistry, mechanism of action and current USFDA status of drugs Anticancer Agents Med. Chem. 2019 19 1080 1102 10.2174/1871520619666190305141458 30834842 20. Klapacz J. Pottenger L.H. Engelward B.P. Heinen C.D. Johnson G.E. Clewell R.A. Carmichael P.L. Adeleye Y. Andersen M.E. Contributions of DNA repair and damage response pathways to the non-linear genotoxic responses of alkylating agents Mutat. Res. Rev. Mutat. Res. 2016 767 77 91 10.1016/j.mrrev.2015.11.001 27036068 PMC4818947 21. Sanderson B.J. Shield A.J. Mutagenic damage to mammalian cells by therapeutic alkylating agents Mutat. Res. 1996 355 41 57 10.1016/0027-5107(96)00021-8 8781576 22. Montesano R. Hall J. Wild C.P. Alkylating agents relating to carcinogenesis in man Prog. Clin. Biol. Res. 1992 374 175 196 1620703 23. Scaringi C. De Sanctis V. Minniti G. Enrici R.M. Temozolomide-related hematologic toxicity Onkologie 2013 36 444 449 10.1159/000353752 23921765 24. Mondal P. Jain D. Aronow W.S. Frishman W.H. Cardiotoxicity of Cancer Therapies Cardiol. Rev. 2019 27 230 235 10.1097/CRD.0000000000000239 30433897 25. Quiroz-Aldave J.E. Durand-Vásquez M.D.C. Chávez-Vásquez F.S. Rodríguez-Angulo A.N. Gonzáles-Saldaña S.E. Alcalde-Loyola C.C. Coronado-Arroyo J.C. Zavaleta-Gutiérrez F.E. Concepción-Urteaga L.A. Haro-Varas J.C. Ifosfamide-induced nephrotoxicity in oncological patients Expert Rev. Anticancer Ther. 2024 24 5 14 10.1080/14737140.2023.2290196 38031874 26. Ajithkumar T. Parkinson C. Shamshad F. Murray P. Ifosfamide encephalopathy Clin. Oncol. 2007 19 108 114 10.1016/j.clon.2006.11.003 17355105 27. De Groot F.M. Damen E.W. Schere H.W. Anticancer prodrugs for application in monotherapy: Targeting hypoxia, tumor-associated enzymes, and receptors Curr. Med. Chem. 2001 8 1093 1122 10.2174/0929867013372634 11472243 28. Hotta K. Ueoka H. New cytotoxic agents: A review of the literature Crit. Rev. Oncol. Hematol. 2005 55 45 65 10.1016/j.critrevonc.2005.01.006 15927843 29. Diethelm-Varela B. Ai Y. Liang D. Xue F. Nitrogen mustards as anticancer chemotherapies: Historic perspective, current developments and future trends Curr. Top. Med. Chem. 2019 19 691 712 10.2174/1568026619666190401100519 30931858 30. Nie Q.-Y. Hu Y. Hou X.-F. Tang G.-L. Biosynthesis of DNA-alkylating antitumor natural products Molecules 2022 27 6387 10.3390/molecules27196387 36234921 PMC9570651 31. Penel N. Adenis A. Bocci G. Cyclophosphamide-based metronomic chemotherapy: After 10 years of experience, where do we stand and where are we going? Crit. Rev. Oncol. Hematol. 2012 82 40 50 10.1016/j.critrevonc.2011.04.009 21641231 32. Lajous H. Lelièvre B. Vauléon E. Lecomte P. Garcion E. Rethinking alkylating(-like) agents for solid tumor management Trends Pharmacol. Sci. 2019 40 342 357 10.1016/j.tips.2019.03.003 30979523 33. Delahousse J. Molina L. Paci A. Cyclophosphamide and analogues; a matter of dose and schedule for dual anticancer activities Cancer Lett. 2024 598 217119 10.1016/j.canlet.2024.217119 39002693 34. Scharovsky O.G. Mainetti L.E. Rozados V.R. Metronomic chemotherapy: Changing the paradigm that more is better Curr. Oncol. 2009 16 7 15 10.3747/co.v16i2.420 19370174 PMC2669231 35. Zhidkov N. De Souza R. Ghassemi A.H. Allen C. Piquette-Miller M. Continuous intraperitoneal carboplatin delivery for the treatment of late-stage ovarian cancer Mol. Pharm. 2013 10 3315 3322 10.1021/mp400345h 23924289 36. Moore M. Williams D.E. Contribution of host immunity to cyclophosphamide therapy of a chemically-induced murine sarcoma Int. J. Cancer 1973 11 358 368 10.1002/ijc.2910110213 4790698 37. Steele G. Pierce G.E. Effects of cyclophosphamide on immunity against chemically-induced syngeneic murine sarcomas Int. J. Cancer 1974 13 572 578 10.1002/ijc.2910130417 4842326 38. Mokyr M.B. Dray S. Some advantages of curing mice bearing a large subcutaneous MOPC-315 tumor with a low dose rather than a high dose of cyclophosphamide Cancer Res. 1983 43 3112 3119 6850619 39. Kerbel R.S. Kamen B.A. The anti-angiogenic basis of metronomic chemotherapy Nat. Rev. Cancer 2004 4 423 436 10.1038/nrc1369 15170445 40. Bertolini F. Paul S. Mancuso P. Monestiroli S. Gobbi S. Shaked Y. Kerbel R.S. Maximum tolerable dose and low-dose metronomic chemotherapy have opposite effects on the mobilization and viability of circulating endothelial progenitor cells Cancer Res. 2003 63 4342 4346 12907602 41. Hamano Y. Sugimoto H. Soubasakos M.A. Kieran M. Olsen B.R. Lawler J. Sudhakar A. Kalluri R. Thrombospondin-1 associated with tumor microenvironment contributes to low-dose cyclophosphamide-mediated endothelial cell apoptosis and tumor growth suppression Cancer Res. 2004 64 1570 1574 10.1158/0008-5472.CAN-03-3126 14996710 42. Heylmann D. Bauer M. Becker H. van Gool S. Bacher N. Steinbrink K. Kaina B. Human CD4+CD25+ regulatory T cells are sensitive to low dose cyclophosphamide: Implications for the immune response PLoS ONE 2013 8 e83384 10.1371/journal.pone.0083384 24376696 PMC3871695 43. Zhong H. Lai Y. Zhang R. Daoud A. Feng Q. Zhou J. Shang J. Low dose cyclophosphamide modulates tumor microenvironment by TGF-β signaling pathway Int. J. Mol. Sci. 2020 21 957 10.3390/ijms21030957 32023984 PMC7038197 44. Ghiringhelli F. Menard C. Puig P.E. Ladoire S. Roux S. Martin F. Solary E. Le Cesne A. Zitvogel L. Chauffert B. Metronomic cyclophosphamide regimen selectively depletes CD4+CD25+ regulatory T cells and restores T and NK effector functions in end stage cancer patients Cancer Immunol. Immunother. 2007 56 641 648 10.1007/s00262-006-0225-8 16960692 PMC11030569 45. Guerriero J.L. Ditsworth D. Catanzaro J.M. Sabino G. Furie M.B. Kew R.R. Crawford H.C. Zong W.-X. DNA alkylating therapy induces tumor regression through an HMGB1-mediated activation of innate immunity J. Immunol. 2011 186 3517 3526 10.4049/jimmunol.1003267 21300822 PMC3066027 46. Vacchelli E. Ma Y. Baracco E.E. Sistigu A. Enot D.P. Pietrocola F. Yang H. Adjemian S. Chaba K. Semeraro M. Chemotherapy-induced antitumor immunity requires formyl peptide receptor 1 Science 2015 350 972 978 10.1126/science.aad0779 26516201 47. Wu H.-L. Zhou H.-X. Chen L.-M. Wang S.-S. Metronomic chemotherapy in cancer treatment: New wine in an old bottle Theranostics 2024 14 3548 3564 10.7150/thno.95619 38948068 PMC11209710 48. Filimonova M.V. Tsyshkova N.G. Narovlyansky A.N. Marinchenko V.P. Koval L.S. Parfenova T.M. Izmestyeva A.V. Ershov F.I. Indole-3-Carboxylic Acid Derivatives Having Antiviral Activity Russian Federation Patent RU 2,552,422 10 June 2015 (In Russian) 49. Narovlyansky A.N. Filimonova M.V. Tsyshkova N.G. Pronin A. Grebennikova T.V. Karamov E.V. Larichev V.F. Kornilayeva G.V. Fedyakina I.T. Dolzhikova I.V. Indole-3-Carboxylic Acid Derivative Having Antiviral Activity on SARS-CoV-2 Russian Federation Patent RU 2,820,633 6 June 2024 (In Russian) 50. Narovlyansky A.N. Filimonova M.V. Tsyshkova N.G. Pronin A.V. Grebennikova T.V. Karamov E.V. Larichev V.F. Kornilayeva G.V. Fedyakina I.T. Dolzhikova I.V. In vitro antiviral activity of a new indol-3-carboxylic acid derivative against SARS-CoV-2 Acta Naturae 2023 15 83 91 10.32607/actanaturae.26623 38234608 PMC10790354 51. Narovlyansky A. Pronin A. Poloskov V. Sanin A. Mezentseva M. Fedyakina I. Suetina I. Zubashev I. Ershov F. Filimonova M. Expression of Toll-like receptor genes and antiviral cytokines in macrophage-like cells in response to indole-3-carboxylic acid derivative Viruses 2024 16 1718 10.3390/v16111718 39599833 PMC11598892 52. Zhao H. Wu L. Yan G. Chen Y. Zhou M. Wu Y. Li Y. Inflammation and tumor progression: Signaling pathways and targeted intervention Signal Transduct. Target. Ther. 2021 6 263 10.1038/s41392-021-00658-5 34248142 PMC8273155 53. Rwandamuriye F.X. Wang T. Zhang H. Elaskalani O. Kuster J. Ye X. Vitali B. Schreurs J. Morales M.L.O. Norret M. Local therapy with combination TLR agonists stimulates systemic anti-tumor immunity and sensitizes tumors to immune checkpoint blockade Oncoimmunology 2024 13 2395067 10.1080/2162402X.2024.2395067 39188754 PMC11346538 54. Everson R.G. Hugo W. Sun L. Antonios J. Lee A. Ding L. Bu M. Khattab S. Chavez C. Billingslea-Yoon E. TLR agonists polarize interferon responses in conjunction with dendritic cell vaccination in malignant glioma: A randomized phase II Trial Nat. Commun. 2024 15 3882 10.1038/s41467-024-48073-y 38719809 PMC11078958 55. Filimonova M.V. Surinova V.I. Soldatova O.V. Shitova A.A. Tsyshkova N.G. Filimonov A.S. Shegay P.V. Kaprin A.D. Indol-3-Carboxic Acid Derivatives with Anti-Tumor Activity Russian Federation Patent RU 2,782,931 7 November 2022 (In Russian) 56. Filimonova M.V. Soldatova O.V. Surinova V.I. Filimonov A.S. Shitova A.A. Rybachuk V.A. Volkova I.K. Nikolaev K.A. Kosachenko A.O. Shegay P.V. Method for Obtaining New Original Chloroethylamino-Substituted Derivatives of Aminoalkyl Esters of Indole-3-Carboxylic Acid Possessing Antitumor Activity Russian Federation Patent RU 2024,127,831 20 September 2024 (In Russian) 57. Tsyshkova N.G. Trofimov F.A. Marinchenko V.P. Dubovik B.V. Lushnikova G.A. Shvedov V.L. Synthesis 1,2,3,4-tetrahydropyrazino[1,2-a]indole derivatives and their pharmacological investigation Pharm. Chem. J. 1993 26 750 753 10.1007/BF00770625 58. Berezovskaya I.V. Classification of substances with respect to acute toxicity for parenteral administration Pharm. Chem. J. 2003 37 139 141 10.1023/A:1024586630954 59. Pfizer Material Safety Data Sheet. Cyclophosphamide Powder for Injection. Version 2.1 Available online: https://cdn.pfizer.com/pfizercom/products/material_safety_data/PZ00021.pdf (accessed on 22 July 2025) 60. Organization for Economic Co-Operation and Development, OECD Test No. 475: Mammalian Bone Marrow Chromosome Aberration Test OECD Publishing Paris, France 1997 10.1787/9789264071308-en 61. Thrall M.A. Weiser G. Allison R.W. Campbell T.W. Veterinary Hematology and Clinical Chemistry 2nd ed. Wiley-Blackwell, John Wiley & Sons, Inc. Hoboken, NJ, USA 2012 784 978-0-813-81027-0 62. Yushkov B.G. Korneeva E.A. Chereshnev V.A. The Concept of Norm in Physiology and Pathophysiology. Physiological Constants of Laboratory Animals Ural Branch of Russian Academy of Sciences Ekaterinburg, Russia 2021 864 978-5-7691-2542-3 (In Russian) 63. Savage J.R. Classification and relationships of induced chromosomal structural changes J. Med. Genet. 1976 13 103 122 10.1136/jmg.13.2.103 933108 PMC1013369 64. Natarajan A.T. Boei J.J.W.A. Formation of chromosome aberrations: Insights from FISH Mutat. Res. 2003 544 299 304 10.1016/j.mrrev.2003.09.005 14644331 65. Filimonova M. Shitova A. Shevchenko L. Soldatova O. Surinova V. Rybachuk V. Kosachenko A. Nikolaev K. Volkova I. Demyashkin G. In vitro cytotoxic potential and in vivo antitumor effects of NOS/PDK-inhibitor T1084 Int. J. Mol. Sci. 2024 25 9711 10.3390/ijms25179711 39273658 PMC11396549 66. Bunyatyan N.D. Vasiliev A.N. Verstakova O.L. Zhuravleva M.V. Korobov N.V. Merkulov V.A. Orekhov S.N. Sakaeva I.V. Uteshev D.B. Yavorsky A.N. Guidelines for Preclinical Drug Research. Part 1 Mironov A.N. Grif & Co. Moscow, Russia 2012 944 978-5-8125-1466-3 (In Russian) 67. Dhawan A. Bajpayee M. Genotoxicity Assessment: Methods and Protocols Humana Totowa, NJ, USA 2013 478 10.1007/978-1-62703-529-3 978-1627035286 68. Filimonova M. Shitova A. Soldatova O. Shevchenko L. Saburova A. Podosinnikova T. Surinova V. Shegay P. Kaprin A. Ivanov S. Combination of NOS- and PDK-inhibitory activity: Possible way to enhance antitumor effects Int. J. Mol. Sci. 2022 23 730 10.3390/ijms23020730 35054914 PMC8775993 69. Holm S. A simple sequentially rejective multiple test procedure Scand. J. Stat. 1979 6 65 70 Figure 1 Structural formulas of the studied compounds. ( A B H Figure 2 Synthesis scheme of compound T1089. Reagents, conditions and yields: α. (1) aq. NaOH, dioxane; (2) Me 2 4 N 4 N 2 4 Figure 3 NMR spectra of compound T1089. ( A 1 B 13 Figure 4 Cytotoxic effect of compound T1089 and cyclophosphamide (CPA) in vitro on human lung carcinoma cells A549 according to MTT test data. Graphic symbols—survival of A549 cells (M ± SD; n 50 Figure 5 The effect of cyclophosphamide and compound T1089 on structural mutagenesis in bone marrow cells of female F 1 A I II III VI B C B p p C I II III IV p p p p p p Figure 6 Antitumor and toxic effects of cyclophosphamide (CPA) and compound T1089 with chronic i.p. administration at a dose of 33 mg/kg (with an interval of 48 h) in a model of Ehrlich solid carcinoma (ESC) in female F 1 A n p p p p p p p p p p p B n p p p p C n p p p p p p p p p Figure 7 Antitumor and toxic effects of compound T1089 with chronic i.p. administration at a dose of 28 mg/kg (with an interval of 48 h) in a model of melanoma B-16 in female C57Bl/6j mice. ( A n p p p p p B n C n p D E p ",
  "metadata": {
    "Title of this paper": "A simple sequentially rejective multiple test procedure",
    "Journal it was published in:": "Molecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472313/"
  }
}