{
  "title": "Paper_1087",
  "abstract": "pmc Prev Med Rep 2904 pmedr Preventive Medicine Reports 2211-3355 Elsevier PMC12477911 PMC12477911.1 12477911 12477911 41031352 10.1016/j.pmedr.2025.103249 S2211-3355(25)00288-8 103249 1 Short Communication Behavioral economics, lifestyle, and health-related factors associated with participation in breast and cervical cancer screenings: A cross-sectional analysis of Japanese women Satoh Miho mihos-tky@umin.ac.jp a ⁎ Sato Naoko naoko-st@fmu.ac.jp b Sekino Mizuki semizuki@fmu.ac.jp b a b ⁎ mihos-tky@umin.ac.jp 11 2025 15 9 2025 59 497710 103249 7 5 2025 12 9 2025 13 9 2025 15 09 2025 30 09 2025 01 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Objective This study investigated factors influencing Japanese women's participation in breast and cervical cancer screenings, with a focus on health behaviors, behavioral economics characteristics, socioeconomic status, and physical and mental health. Methods Using secondary data from the Japan Household Panel Survey (Wave 2021, collected February 2021), we analyzed responses from 410 women aged ≤70 years. Key variables included risk aversion, time preference, exercise frequency, smoking status, alcohol consumption, nutritional intake, subjective and mental health, body mass index, and sociodemographic factors such as education, employment, and municipality type. Results The participants' mean age was 52.92 years (standard deviation = 9.17 years). Of the women, 15.9 % underwent cervical cancer screening and 16.8 % underwent breast cancer screening. A logistic regression analysis revealed that, for both breast and cervical cancer screenings, high psychological distress, risk aversion, and smoking were associated with lower participation, whereas regular exercise, permanent employment, and residence in towns and villages were associated with higher participation. Smoking was significantly associated with breast cancer screening participation, and utilization of medical services was significantly associated with cervical cancer screening participation. Conclusion Interventions incorporating behavioral economics approaches, such as addressing risk perception and promoting health behaviors, may enhance Japanese women's cancer screening participation. Keywords Cancer screening Cervical cancer Breast cancer Lifestyle Behavioral economics pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Japan's recently rising mortality rates for cervical and breast cancer might be attributable to persistently insufficient screening rates for these cancers. The screening rate is 47.4 % for breast cancer and 43.6 % for cervical cancer among Japanese women—considerably lower than the rates of 70 % for both cancers in other developed countries, such as the US, the UK, and Finland ( OECD, 2024 Previous studies in Japan and internationally have shown that cancer screening participation is influenced by health awareness, health behaviors, lifestyle, education, and socioeconomic status ( Castañeda et al., 2023 Wakui et al., 2014 Lower socioeconomic status, financial and time constraints, and limited health literacy are also associated with lower screening rates ( Shimoda et al., 2021 Vallone et al., 2022 Vallone et al., 2022 Mon et al., 2024 Additionally, behavioral economics has highlighted that people often make irrational health decisions, avoiding screenings due to anxiety or biases such as present bias or loss aversion ( Emanuel et al., 2015 Zhao and Liu, 2021 This study sought to analyze factors related to participation in breast and cervical cancer screenings among Japanese women from multiple perspectives: health behaviors, the characteristics of behavioral economics, socioeconomic aspects, and physical and mental health. 2 Methods 2.1 Data source and participants This study was a secondary analysis of nationally representative data from the Japanese Household Panel Survey (JHPS/KHPS), administered by the Panel Data Research Center at Keio University ( Keio University, n.d Data from Wave 2021, supplemented with demographic information from Waves 2004 and 2009, were analyzed. The analytical sample comprised 410 women aged ≤70 years in 2021 who were eligible for breast and cervical cancer screening in Japan and had complete data available for all variables of interest. Table 1 Table 1 Health Behaviors, Behavioral Economic Characteristics, Physical and Mental Health, and Sociodemographic of Participants According to Cervical and Breast Cancer Screening Status Among Japanese Women Aged ≤70 Years ( n Table 1 Cervical Cancer Screening Breast Cancer Screening No n Yes n p † No n Yes n p-value †† n (%)/mean (SD) n (%)/mean (SD) n (%)/mean (SD) n (%)/mean (SD) Marital Status Married 266 (77.1) 50 (76.9) 0.98 262 (76.8) 54 (78.3) 0.80 Unmarried 79 (22.9) 15 (23.1) 79 (23.2) 15 (21.7) Child Status None 48 (13.9) 11 (16.9) 0.59 49 (14.4) 10 (14.5) 0.46 <15-year-old 47 (13.6) 11 (16.9) 45 (13.2) 13 (18.8) ≥15-year-old 250 (72.5) 43 (66.2) 247 (72.4) 46 (66.7) Caregiver Role Status No 270 (78.3) 49 (75.4) 0.61 268 (78.6) 51 (73.9) 0.39 Yes 75 (21.7) 16 (24.6) 73 (21.4) 18 (26.1) Educational Attainment Junior/ Senior high school 160 (46.4) 28 (43.1) 0.86 157 (46.0) 31 (44.9) 0.27 Junior/ Technical college 119 (34.5) 23 (35.4) 122 (35.8) 20 (29.0) University/Graduate School 66 (19.1) 14 (21.5) 62 (18.2) 18 (26.1) Employment Status Permanent 75 (21.7) 22 (33.8) 0.07 76 (22.3) 21 (30.4) 0.35 Temporary 166 (48.1) 30 (46.2) 166 (48.7) 30 (43.5) Self-employed/Homemaker/ Unemployed 104 (30.1) 13 (20.0) 99 (29.0) 18 (26.1) Alcohol Consumption <180 mL / week 180 (52.2) 38 (58.5) 0.35 174 (51.0) 44 (63.8) 0.05 ≥180 mL / week 165 (47.8) 27 (41.5) 167 (49.0) 25 (36.2) Smoking Status Never smoker 229 (66.4) 43 (66.2) 0.85 227 (66.6) 45 (65.2) 0.45 Former smoker 81 (23.5) 14 (21.5) 81 (23.8) 14 (20.3) Current smoker 35 (10.1) 8 (12.3) 33 (9.7) 10 (14.5) Utilization of medical services in the Past Year No 121 (35.1) 15 (23.1) 0.06 123 (36.1) 13 (18.8) 0.01 Yes 224 (64.9) 50 (76.9) 218 56 (81.2) Municipality Type Government-designated city ⁎ 111 (32.2) 17 (26.2) 0.16 106 (31.1) 22 (31.9) 0.24 City ⁎⁎ 202 (58.6) 37 (56.9) 203 (59.5) 36 (52.2) Towns or villages ⁎⁎⁎ 32 (9.3) 11 (16.9) 32 (9.4) 11 (15.9) Age 53.03 (9.24) 52.32 (8.85) 0.57 52.50 (9.14) 54.97 (9.10) 0.04 Annual Household Income (million JPY [thousand EUR]) 1 737.67 (480.91) 827.22 (476.49) 0.17 743.29 (470.75) 794.23 (529.03) 0.42 Subjective Health 2 3.45 (0.88) 3.43 (0.85) 0.88 3.46 (0.89) 3.39 (0.79) 0.57 Mental Health 3 5.03 (4.49) 4.34 (4.15) 0.25 5.05 (4.59) 4.25 (3.58) 0.17 Sleep Duration 4 6.75 (0.99) 6.67 (0.86) 0.52 6.76 (0.99) 6.66 (0.85) 0.43 Risk Aversion 5 47.58 (16.30) 43.38 (16.33) 0.06 47.76 (16.31) 42.75 (16.08) 0.02 Time Preference Rate 6 0.16 (0.13) 0.16 (0.14) 1.00 0.16 (0.13) 0.18 (0.14) 0.38 Weekly Frequency of Exercise 7 0.70 (1.46) 1.22 (1.88) 0.01 0.69 (1.44) 1.20 (1.91) 0.04 Body Mass Index 8 22.36 (3.88) 22.26 (3.66) 0.85 22.36 (3.85) 22.26 (3.80) 0.85 Protein Intake 9 2.49 (0.99) 2.43 (0.92) 0.64 2.48 (0.95) 2.48 (0.98) 0.97 Vegetable Intake 9 2.67 (1.14) 2.46 (1.03) 0.17 2.65 (1.14) 2.57 (1.09) 0.55 Fruits Intake 9 4.75 (1.74) 4.58 (1.56) 0.48 4.78 (1.72) 4.45 (1.69) 0.14 † Calculated using the chi-square test for categorical variables. †† Calculated using the unpaired t-tests for continuous variables. 1. Self-reported, continuous, annual household income in JPY was converted to approximate EUR using the average exchange rates for 2021 (1 EUR ≈ 127 JPY). 2. Single 5-point Likert scale. 3. Kessler Psychological Distress Scale, six items rated on a 5-point scale; total score 0–24. 4. Self-reported average hours per night. 5. Assessed by a hypothetical rainfall question; higher scores = greater aversion. 6. Measured by delayed monetary choice; 8-point scale (−5 % to 40 %). 7. Self-reported weekly frequency. 8. Calculated from self-reported height and weight. 9. frequency of consumption recorded as “three times a day,” “twice a day,” “once a day,” “4–6 times a week,” “2–3 times a week,” “once a week,” “less than once a week to 3 times a month,” or “never,” and scored on an 8-point scale from 1 (least frequent) to 8 (most frequent). EUR, euro; JPY, Japanese yen; SD, standard deviation. ⁎ Population ≥ 500,000. ⁎⁎ Population ≥ 50,000 to <500,000. ⁎⁎⁎ Population < 50,000. 2.2 Variables The dependent variables in this study were participation in breast cancer screening and participation in cervical cancer screening, with each treated as a binary variable (screened vs. not screened) and measured as whether the respondent underwent screening in 2020. Independent variables comprised health behaviors, behavioral economics, health status, and sociodemographic characteristics. Health behaviors included exercise frequency, sleep duration, alcohol consumption, smoking status, nutritional intake, and healthcare utilization. Alcohol consumption was classified as <180 mL/week or ≥ 180 mL/week, based on national guidelines ( Ministry of Health, Labour and Welfare, 2024 Wakai, 2009 Behavioral economic factors included risk aversion and time preference, treated as continuous variables. Risk aversion was assessed by a question on expected rainfall, with higher scores indicating greater aversion ( Tsutsui et al., 2012 Picone et al., 2004 Health status was measured using several indicators as continuous variables: subjective health was assessed on a five-point Likert scale from “good” to “poor”; mental health was evaluated using the Kessler Psychological Distress Scale ( Kessler et al., 2002 Sociodemographic variables included age, marital status (single or married), parental status (none, having a child aged <15 years, or having a child aged ≥15 years), caregiving role status (yes or no), education (junior/senior high school, junior/technical college, or university/graduate school), employment (permanent, temporary, self-employed/homemaker/unemployed), municipality type (government-designated city, city, or town/village), and household income. 2.3 Statistical analyses Descriptive statistics were calculated for all variables. Subsequently, chi-squared tests, adjusted standardized residuals, and unpaired t We conducted all statistical analyses using SPSS Statistics 29.0 for Mac. Statistical significance was set at p 2.4 Ethical considerations As the JHPS/KHPS data are deidentified data, an ethics review was deemed unnecessary. JHPS/KHPS participants consented to data use, anonymity, confidentiality, and secondary use by the Panel Data Research Center at Keio University. 3 Results Participants' demographic characteristics are shown by screening status in Table 1 p p p Table 2 Table 2 Multivariable Logistic Regression Analysis of Behavioral Economic Characteristics, Health-Related Behaviors, Physical and Mental Health, and Sociodemographic Associated with Participation in Cervical and Breast Cancer Screening Among Japanese Women Aged ≤70 years (n = 410) from the Japanese Household Panel Survey, Wave 2021. Table 2 Cervical cancer screening Breast cancer screening Exp(B) 95 % CI Exp(B) 95 % CI Age 0.98 0.94, 1.01 1.01 0.98, 1.05  Marital Status (ref = Unmarried) Married 1.17 0.51, 2.70 1.46 0.64, 3.31  Child Status (ref = None) <15 years old 0.81 0.34, 1.96 1.45 0.50, 4.22 ≥15 years old 1.21 0.41, 3.56 1.03 0.43, 2.49  Caregiver Role Status (ref = No) Yes 1.30 0.65, 2.59 1.21 0.62, 2.35  Educational Attainment (ref = University/Graduate school) Junior/ Senior high school 0.89 0.38, 2.09 0.60 0.27, 1.34 Junior/ Technical college 1.04 0.46, 2.37 0.56 0.25, 1.25  Employment Status (ref = Homemaker/Unemployed/Self-employed) Permanent 2.95 1.22, 7.16 2.65 1.12, 6.31 Temporary 1.73 0.78, 3.85 1.44 0.68, 3.05  Alcohol Consumption (ref ≤180 mL/week) ≥180 mL/week 0.76 0.42, 1.40 0.64 0.35, 1.18  Smoking Status (ref = Current smoker) Never smoker 0.44 0.16, 1.21 0.28 0.10, 0.74 Former smoker 0.49 0.17, 1.43 0.33 0.12, 0.92  Utilization of Medical Services in the Past Year (ref = No) Yes 1.86 0.92, 3.76 2.18 1.06, 4.47 Protein Intake 1 1.24 0.84, 1.84 1.21 0.83, 1.78 Vegetable Intake 1 0.81 0.56, 1.16 0.93 0.66, 1.31 Fruits Intake 1 1.00 0.83, 1.20 0.95 0.79, 1.14 Subjective Health 2 0.79 0.55, 1.12 0.77 0.54, 1.09 Mental Health 3 0.93 0.86, 0.99 0.92 0.85, 0.99 Sleep Duration 4 0.94 0.68, 1.28 0.94 0.69, 1.29 Risk Aversion 5 0.98 0.96, 0.99 0.98 0.96, 0.99 Time Preference Rate 6 1.43 0.17, 11.91 3.13 0.40, 24.87 Weekly Frequency of Exercise 7 1.25 1.05, 1.48 1.19 1.01, 1.42 Body Mass Index 8 0.99 0.91, 1.07 0.99 0.91, 1.07 Annual Household Income (million JPY [thousand EUR]) 9 1.00 1.00, 1.00 1.00 1.00, 1.00  Municipality Type (ref = Towns or villages ⁎⁎⁎ Government-designated city ⁎ 0.26 0.10, 0.69 0.32 0.12, 0.85 City ⁎⁎ 0.35 0.15, 0.84 0.30 0.13, 0.74 1. Frequency of consumption recorded as “three times a day,” “twice a day,” “once a day,” “4–6 times a week,” “2–3 times a week,” “once a week,” “less than once a week to 3 times a month,” or “never,” and scored on an 8-point scale from 1 (least frequent) 8 (most frequent). 2. Single 5-point Likert scale. 3. Kessler Psychological Distress Scale, six items rated on a 5-point scale; total score 0–24. 4. Self-reported average hours per night. 5. Assessed by a hypothetical rainfall question; higher scores = greater aversion. 6. Measured by delayed monetary choice; 8-point scale (−5 % to 40 %). 7. Self-reported weekly frequency. 8. Calculated from self-reported height and weight. 9 Self-reported, continuous, annual household income in JPY was converted to approximate amounts in EUR using the average exchange rates for 2021 (1 EUR ≈ 127 JPY). CI, confidence interval; EUR, euro; JPY, Japanese yen. ⁎ Population ≥ 500,000. ⁎⁎ Population ≥ 50,000 to <500,000. ⁎⁎⁎ Population < 50,000. For breast cancer screening, higher psychological distress (OR = 0.92, 95 % CI = 0.85, 0.99) and greater risk aversion (OR = 0.98, 95 % CI = 0.96, 0.99) were inversely associated with screening participation. Conversely, higher exercise frequency (OR = 1.19, 95 % CI = 1.01, 1.42) and permanent employment (OR = 2.65, 95 % CI = 1.12, 6.31) were significantly associated with increased screening participation. Notably, women who had never smoked (OR = 0.28, 95 % CI = 0.10, 0.74) or formerly smoked (OR = 0.33, 95 % CI = 0.12, 0.92) were less likely to participate in screening compared with current smokers. Additionally, women who had utilized medical services in the past year were significantly more likely to undergo breast cancer screening (OR = 2.18, 95 % CI = 1.06, 4.47). Finally, residing in a government-designated city (OR = 0.32, 95 % CI = 0.12, 0.85) or a city (OR = 0.30, 95 % CI = 0.13, 0.74) was associated with lower screening participation than residing in towns or villages. 4 Discussion This study revealed that higher levels of psychological distress, greater risk aversion, and smoking status were associated with reduced screening participation, whereas regular exercise, permanent employment, and residence in towns or villages were associated with increased screening participation. The finding that higher psychological distress was associated with lower participation in breast and cervical cancer screenings was consistent with prior research indicating that poor mental health may hinder engagement in preventive health behaviors ( Kerrison et al., 2023 Zhao and Liu, 2021 Goldzahl, 2017 Breast and cervical cancer screening rates were significantly higher among women who regularly exercised. This indicates that health behaviors tend to co-occur synergistically and that autonomous motivation for health may be higher ( Ng et al., 2012 Eng et al., 2020 Sheeran et al., 2014 For both breast and cervical cancer screenings, permanently employed women had significantly higher rates of screening participation than those who were unemployed/homemakers/self-employed. This suggests that employment status may affect access to health resources and information. The presence or absence of workplace-based screenings and opportunities for health education in the workplace may influence health behavior. This could also be interpreted as a form of inequality related to screening behavior, stemming from disparities in pathways such as health insurance coverage, economic stability, and the availability of workplace health promotion support ( Mon et al., 2024 Women who had utilized medical services in the past year showed significantly higher participation in breast cancer screening, suggesting that healthcare encounters may be a key opportunity for screening recommendations and information. There were also residential-area differences, with residents of government-designated and mid-sized cities having lower screening rates than those of towns and villages. Although urban residents may have better access to medical facilities, attributes such as a fast-paced lifestyle, greater anonymity, and information overload may weaken their motivation to seek out screenings. In contrast, people in rural areas may benefit from stronger community ties and more effective outreach efforts from local governments ( Huang and Ekenga, 2025 These results highlight the complex interplay of psychological, behavioral, and social factors that influence cancer screening rates. Interventions incorporating behavioral economics, stigma-free support, community-based approaches, and flexible screening options are essential for promoting cancer screening participation. To reach diverse populations with diverse values, integrated, multilayered strategies that address these factors are essential. This study has some limitations. Its cross-sectional design precludes causal inference, warranting longitudinal and interventional research. Self-administered questionnaires may have introduced bias; future studies should clarify individuals' perceptions and motivations regarding screenings. Screening behavior was treated as binary, without considering screening type, continuity, or frequency; linking registry and medical record data could enhance validity. Importantly, the modest sample size may have limited statistical power and precision, particularly for rare categories, and the inclusion of numerous variables raises the risk of overfitting. 5 Conclusion For breast cancer screening and cervical cancer screening, high psychological distress, risk aversion, and never or formerly smoking were associated with lower participation, whereas regular exercise, permanent employment, and rural residence were associated with higher participation. Additionally, smoking status was significantly associated with breast cancer screening participation, and utilization of medical services was significantly associated with cervical cancer screening participation. CRediT authorship contribution statement Miho Satoh: Naoko Sato: Mizuki Sekino: Funding This research did not receive any specific grant from funding agencies in the public, commercial, or not-for-profit sectors. Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References Castañeda K.M. Sidorenkov G. Mourits M.J.E. van der Vegt B. Siebers A.G. Vermeulen K.M. Schuuring E. Wisman G.B.A. de Bock G.H. Impact of health-related behavioral factors on participation in a cervical cancer screening program: the lifelines population-based cohort BMC Public Health 23 2023 2376 10.1186/s12889-023-17293-0 38037016 PMC10688458 Emanuel A.S. Kiviniemi M.T. Howell J.L. Hay J.L. Waters E.A. Orom H. Shepperd J.A. Avoiding cancer risk information Soc. Sci. Med. 147 2015 113 120 10.1016/j.socscimed.2015.10.058 26560410 PMC4689624 Eng V.A. David S.P. Li S. Ally M.S. Stefanick M. Tang J.Y. The association between cigarette smoking, cancer screening, and cancer stage: a prospective study of the women’s health initiative observational cohort BMJ Open 10 2020 e037945 10.1136/bmjopen-2020-037945 PMC7430331 32796021 Goldzahl L. Contributions of risk preference, time orientation and perceptions to breast cancer screening regularity Soc. Sci. Med. 185 2017 147 157 10.1016/j.socscimed.2017.04.037 28578212 Huang T. Ekenga C.C. Associations between social capital and screening mammography among older U.S. women Prev. Med. Rep. 52 2025 103026 10.1016/j.pmedr.2025.103026 PMC11951863 40160970 Keio University, n.d. Overview of the Research at PDRC https://www.pdrc.keio.ac.jp/en/about/overview/ Kerrison R.S. Jones A. Peng J. Price G. Verne J. Barley E.A. Lugton C. Inequalities in cancer screening participation between adults with and without severe mental illness: results from a cross-sectional analysis of primary care data on English screening Programmes Br. J. Cancer 129 2023 81 93 10.1038/s41416-023-02249-3 37137996 PMC10307861 Kessler R.C. Andrews G. Colpe L.J. Hiripi E. Mroczek D.K. Normand S.L.T. Walters E.E. Zaslavsky A.M. Short screening scales to monitor population prevalences and trends in non-specific psychological distress Psychol. Med. 32 6 2002 959 976 10.1017/s0033291702006074 12214795 Ministry of Health, Labour and Welfare The Guidelines on Desirable Drinking Behavior https://www.mhlw.go.jp/stf/newpage_37908.html 2024 (in Japanese) (accessed 12 July 2025) Mon H.M. Robb K.A. Demou E. Effectiveness of workplace cancer screening interventions: a systematic review BMC Cancer 24 2024 999 10.1186/s12885-024-12649-0 39134945 PMC11321184 Ng J.Y.Y. Ntoumanis N. Thøgersen-Ntoumani C. Deci E.L. Ryan R.M. Duda J.L. Williams G.C. Self-determination theory applied to health contexts: a meta-analysis Perspect. Psychol. Sci. 7 2012 325 340 10.1177/1745691612447309 26168470 OECD OECD health statistics 2024 https://www.oecd.org/en/data/datasets/oecd-health-statistics.html 2024 accessed 30 April 2025 Picone G. Sloan F. Taylor D. Effects of risk and time preference and expected longevity on demand for medical tests J. Risk Uncertain. 28 2004 39 53 10.1023/B:RISK.0000009435.11390.23 Sheeran P. Harris P.R. Epton T. Does heightening risk appraisals change people’s intentions and behavior? A meta-analysis of experimental studies Psychol. Bull. 140 2014 511 543 10.1037/a0033065 23731175 Shimoda A. Saito Y. Ooe C. Kondo N. Income-based inequality in nationwide general health checkup participation in Japan Public Health 195 2021 112 117 10.1016/j.puhe.2021.01.022 34087670 Tsutsui Y. Benzion U. Shahrabani S. Economic and behavioral factors in an individual’s decision to take the influenza vaccination in Japan J. Socio-Econ. 41 2012 594 602 10.1016/j.socec.2012.05.001 Vallone F. Lemmo D. Martino M.L. Donizzetti A.R. Freda M.F. Palumbo F. Lorenzo E. D'Argenzio A. Caso D. Factors promoting breast, cervical and colorectal cancer screenings participation: a systematic review Psycho-Oncology. 31 2022 1435 1447 10.1002/pon.5997 35793430 PMC9541457 Wakai K. A review of food frequency questionnaires developed and validated in Japan J. Epidemiol. 19 2009 1 11 10.2188/jea.JE20081007 19164867 PMC3924089 Wakui S. Nagashima M. Hagi Y. Higashionna A. Yoshitake Y. The relationship between the specific medical check-up and the physical activity-related factors among national health insurance subscribers Jpn. J. Lifelong Sport. 10 2014 11 20 (in Japanese). Doi:10.14838/jjls.10.11 Zhao S. Liu Y. The more insufficient, the more avoidance? Cognitive and affective factors that relates to information behaviours in acute risks Front. Psychol. 12 2021 730068 10.3389/fpsyg.2021.730068 PMC8500063 34630242 Data availability The third-party dataset (Approval No. 5841: Data ID 229 JHPS/KHPS2004–2022) supporting the conclusions of this article is available from the Panel Data Research Center at Keio University with the approval of this organization ( https://www.pdrc.keio.ac.jp/en Acknowledgment We are grateful to the Keio University Panel Data Research Center for providing the Japanese Household Panel Survey. ",
  "metadata": {
    "Title of this paper": "The more insufficient, the more avoidance? Cognitive and affective factors that relates to information behaviours in acute risks",
    "Journal it was published in:": "Preventive Medicine Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477911/"
  }
}