{
  "title": "Paper_1048",
  "abstract": "Indian J Otolaryngol Head Neck Surg Indian J Otolaryngol Head Neck Surg 1415 ijoto Indian Journal of Otolaryngology and Head & Neck Surgery 2231-3796 0973-7707 Springer PMC11455808 PMC11455808.1 11455808 11455808 39376395 10.1007/s12070-024-04824-3 4824 1 Brief Communication Cytologic and Clinicopathologic Features of Papillary Thyroid Carcinoma with Prominent Hobnail Features on FNAC http://orcid.org/0009-0000-5375-6651 Saxena Deepali 1 http://orcid.org/0000-0002-5136-7254 Phulware Ravi Hari ravipaarti@gmail.com 1 http://orcid.org/0000-0002-8430-0216 Durgapal Prashant 1 http://orcid.org/0000-0002-3614-6074 Kumar Arvind 1 http://orcid.org/0000-0002-8476-0853 Tyagi Amit Kumar 2 1 grid.413618.9 0000 0004 1767 6103 Department of Pathology and Laboratory Medicine, All India Institute of Medical Sciences, 2 grid.413618.9 0000 0004 1767 6103 Department of Otolaryngology and Head and Neck Surgery, All India Institute of Medical Sciences, 21 6 2024 10 2024 76 5 472259 4885 4888 20 1 2024 17 6 2024 01 10 2025 01 10 2025 07 10 2024 01 10 2025 © Association of Otolaryngologists of India 2024 2024 The hobnail variation of papillary thyroid cancer (PTC) is an uncommon, aggressive variety with hobnail characteristics on more than 30% of the tumour cells. Because of the entity’s rarity, the clinical behaviour and pathologic characteristics of these tumours are still unknown. The purpose of this case study was to look at the cytologic, clinical, and pathological aspects of the hobnail variant of PTC, because of its severe clinicopathologic features and poor outcome, the unusual hobnail type of PTC may necessitate more aggressive treatment than traditional PTCs. The cytologic features of the hobnail variety are distinctive, and FNAC specimens can be used to provide a preoperative diagnosis. Diagnostic parameters for proportion of hobnail morphology need to be refined further. More research is needed to understand how detection of this high-risk variation affects clinical treatment. Keywords Hobnail papillary thyroid carcinoma Neck mass Hobnail variant Thyroid cancer Papillary thyroid cancer Aggressive variants of papillary thyroid cancer pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Association of Otolaryngologists of India 2024 ",
  "metadata": {
    "Title of this paper": "Cytologic and Clinicopathologic Features of Papillary Thyroid Carcinoma with Prominent Hobnail Features on FNAC",
    "Journal it was published in:": "Indian Journal of Otolaryngology and Head & Neck Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11455808/"
  }
}