{
  "title": "Paper_979",
  "abstract": "pmc BMC Cancer BMC Cancer 16 bmccanc BMC Cancer 1471-2407 BMC PMC12482501 PMC12482501.1 12482501 12482501 41023871 10.1186/s12885-025-14636-5 14636 1 Research Pan-cancer analysis of the oncogenic role of ZNF703 in regulating tumor immunity Shi Xianli 1 2 Lie Jingyu 3 Li Rui 3 Chen Haoming 3 Zhang Rongxin rxzhang@gdpu.edu.cn 3 1 https://ror.org/02vg7mz57 grid.411847.f 0000 0004 1804 4300 Department of Biochemistry, School of Basic Medical Science, Guangdong Pharmaceutical University, 2 https://ror.org/02vg7mz57 grid.411847.f 0000 0004 1804 4300 Laboratory of Oncology and Immunology, School of Basic Medical Sciences, Guangdong Pharmaceutical University, 3 https://ror.org/02vg7mz57 grid.411847.f 0000 0004 1804 4300 Guangdong Provincial Key Laboratory of Advanced Drug Delivery, Department of Biotechnology, Laboratory of Immunology and Inflammation, School of Life Sciences and Biopharmaceutics, Guangdong Pharmaceutical University, 29 9 2025 2025 25 478185 1437 30 4 2025 4 7 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ ZNF703, a member of the NET/NLZ family, plays a critical role in individual development and cancer progression. Despite its significance, a comprehensive pan-cancer analysis of ZNF703 remains underexplored. In this study, we performed a systematic pan-cancer analysis to elucidate the mechanistic and functional roles of ZNF703 in tumorigenesis. Our findings reveal that elevated ZNF703 expression is significantly correlated with cancer progression, adverse clinical outcomes, and the enrichment of immune cells within the tumor microenvironment (TME), particularly cancer-associated fibroblasts (CAFs), CD8 + Supplementary Information The online version contains supplementary material available at 10.1186/s12885-025-14636-5. Keywords ZNF703 Tumor immunity CD274 ICAM1 CXCL3 Medical Science and Technology Research Fund of Guangdong province A2025170 Shi Xianli pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction ZNF703, a recently identified transcriptional repressor within the NET/NLZ family [ 1 2 3 , 4 5 6 7 8 9 10 The tumor microenvironment (TME) plays a pivotal role in facilitating cancer initiation and progression. Within the TME, cancer-associated fibroblasts (CAFs) promote tumorigenesis by recruiting pro-tumorigenic myeloid cells, secreting pro-inflammatory cytokines, and modulating anti-tumor T cell responses [ 11 13 + 14 15 Immune checkpoint molecules (ICPs), which function as key regulators of immunosuppressive pathways, are crucial for maintaining immune tolerance by modulating co-inhibitory signaling. However, tumor cells frequently exploit these pathways to evade immune surveillance [ 15 16 16 17 In this study, we conducted the first comprehensive pan-cancer analysis of ZNF703 utilizing data from The Cancer Genome Atlas (TCGA) [ 18 19 Materials and methods Gene expression analysis Differential expression analysis of ZNF703 between tumor and normal tissues was conducted using multiple bioinformatics platforms: the “Gene_DE” module of TIMER2.0 [ 20 21 P 22 P Survival prognosis analysis Utilizing the “Survival Map” module of GEPIA2, we systematically analyzed the overall survival (OS) and disease-free survival (DFS) significance maps of ZNF703 across all TCGA tumor types, employing a cutoff value of 50% to stratify high and low expression groups. The log-rank test was subsequently applied for hypothesis testing, and survival plots along with Kaplan-Meier curves were obtained, with statistical significance determined at P P P Genetic alteration analysis To investigate genetic alterations of ZNF703 in various cancers, we employed the cBioPortal database [ 23 24 Methylation analysis The DNA methylation levels of the ZNF703 promoter were examined in specific cancers and corresponding normal tissues using the UALCAN database [ 25 26 Phosphorylation analysis The PhosphoNET database was utilized to identify potential phosphorylation sites within the ZNF703 protein. Subsequently, the UALCAN database was employed to compare the expression levels of total ZNF703 protein, including its phosphorylated forms at S87 and S252, between primary tumor tissues and normal tissues. Immune infiltration analysis To investigate the relationship between ZNF703 expression and tumor-infiltrating immune cells, including cancer-associated fibroblasts (CAFs), CD8 + Immune checkpoints analysis The Sangerbox online tool was used to calculate tumor-immune infiltration scores based on ZNF703 expression data from TCGA cancers. The same tool was further applied to assess the association between ZNF703 expression and immune checkpoint markers, with findings presented in heatmap format. Screen the potential ZNF703 regulated ICP genes The target genes of ZNF703 were identified using the “Target Genes” module of the CHIP-Atlas database [ 27 28 Validation experiments in ZNF703 knockdown HCT-116 The pLKO.1-ZNF703 shRNA, along with pSPAX2 and pMD2.G, was transfected into HEK293T cells to generate ZNF703 shRNA lentivirus. This lentivirus was then used to infect HCT-116 cells to establish a stable ZNF703 knockdown cell line. Following puromycin selection (5 µg/mL), the knockdown efficiency of ZNF703 was confirmed by Western blot analysis using ZNF703 antibody (Proteintech, Cat. No. 21075-1-AP) and GAPDH antibody (Proteintech, Cat. No. 60004-1-Ig). The HCT-116 control/ZNF703 shRNA cells were plated in 96-well plates (1000 cells in 100 µL complete medium), and incubated for 24, 48, and 96 h. According to the manufacturer’s instructions, the cell proliferation was analyzed by the CCK-8 assay (Dojindo, Japan). The 450 nm Absorbances were measured by a microplate reader. And the cells for each time point were prepared in triplicate. The expression levels of CD274, ICAM1, and CX3CL1 were quantified by quantitative PCR (Q-PCR) using the 2 −∆ΔCT P P P P Ten gene set enrichment analysis The STRING database [ 29 P 30 P Furthermore, the co-expression patterns of ZNF703 and the identified hub genes were investigated using the TIMER2.0 database, with results presented as a heatmap and corresponding scatter plots. Differential expression of the hub genes between normal and tumor tissues in specific cancers was analyzed using GEPIA2. Result The differential expression profiles of ZNF703 in human pan-cancer The expression levels of ZNF703 across various TCGA tumors were analyzed using TIMER2.0. As illustrated in Fig. 1 1 1 P  Fig. 1 The expression of ZNF703 in Pan-Cancer ( A p p p B p C p D To investigate the association between ZNF703 expression and cancer pathological stages, the “pathological stage map” module of GEPIA2 was employed. Significant correlations between ZNF703 expression levels and tumor stages were observed in CHOL, DLBC, OV (ovarian serous cystadenocarcinoma), KICH, STAD, KIRP, and LIHC (Fig. 1 p Analysis the prognostics effect of ZNF703 in pan-cancer To systematically assess the prognostic significance of ZNF703 across TCGA malignancies, we stratified tumor cases into high- and low-expression cohorts based on ZNF703 expression levels, subsequently investigating its correlation with patient outcomes. The analysis was conducted utilizing comprehensive datasets from TCGA and GEO. As illustrated in Fig. 2 p p 2 Fig. 2 Correlation between ZNF703 expression and survival prognosis of cancers in TCGA. GEPIA2 was used to perform Overall Survival ( A B Genetic alteration analysis of ZNF703 The mutation frequency of ZNF703 was analyzed using the cBioPortal platform. As depicted in Fig. 3 3 3 3 3  Fig. 3 Genetic alteration analysis.(A) Genetic alteration in ZNF703 in pan-cancer tissues, accounting for 5% of alterations (altered / profiled = 509 / 10960). (B) The alteration frequency with the mutation type of ZNF703 in different cancers. (C) Diagram of ZNF703 mutations across cancer types in the protein domain. (D) The mutation site with the highest alteration frequency (G558Afs*24) in the 3D structure of ZNF703. (E) The prognostic value of ZNF703 genetic alteration was analyzed and the Kaplan–Meier curves of progression-free survival are demonstrated. Methylation analysis of ZNF703 Utilizing the UALCAN database, we conducted a comparative analysis of ZNF703 methylation levels between tumor and normal tissues (Fig. 4 p p 4  Fig. 4 Analysis of DNA methylation and phosphorylation in ZNF703 ( A B C ZNF703 protein phosphorylation sites and different expression levels in several tumors Post-translational modifications (PTMs), particularly phosphorylation and dephosphorylation, play a critical role in modulating protein function, and dysregulation of these processes has been implicated in various diseases, including cancer. Utilizing the CPTAC database, we conducted a comparative analysis of ZNF703 phosphorylation levels between normal tissues and primary tumor tissues. Figure 4 The association of ZNF703 with TME-immune cells To elucidate the association between ZNF703 expression and immune cell infiltration across various TCGA tumors, we employed multiple computational algorithms, including EPIC, MCPCOUNTER, XECLL, TIDE, CIBERSORT, CIBERSORTABS, and QUANTISEQ. As depicted in Fig. 5 + 5 + 5  Fig. 5 The correlation of ZNF703 expression with immune-infiltrating CAFs, CD8 + A B + C D p Notably, in BRCA, CESC, HNSC-HPV-, and KIRC, ZNF703 exhibited a dual pattern of correlation: positive with CAFs and negative with CD8 + The association of ZNF703 with TME immune scores and ICPs Utilizing the Sangerbox online platform, we quantified immune infiltration scores (stromal score, immune score, and estimate score) across 44 distinct tumor types. Our analysis revealed a significant positive correlation between ZNF703 expression and stromal scores in KIRC, THCA, and PCPG (Fig. S6A). Conversely, a significant negative correlation was observed between ZNF703 expression and immune scores in BRCA, COADREAD, and LUSC (Fig. S6B). Furthermore, Fig. S6C illustrates that ZNF703 exhibited a significant negative correlation with the estimate score (tumor purity) in LUSC, while demonstrating a positive correlation in KIPAN and PCPG. These findings underscore the pivotal role of ZNF703 expression in modulating tumor immune infiltration, potentially serving as a predictive biomarker for immunotherapy efficacy in cancer patients. Additionally, we investigated the correlation between ZNF703 and immune checkpoint (ICPs) gene expression (Fig. 5 Screen the potential ZNF703 regulated ICPs Through the intersection of ZNF703 target genes identified from CHIP-Atlas with the ligand-receptor interaction data from the CellPhoneDB database, we identified 173 key target genes potentially involved in cell-cell communication. To determine the immune checkpoint proteins (ICPs) directly regulated by ZNF703, we intersected these 173 target genes with previously identified ZNF703-associated ICPs (Fig. 5 6 6 6  Fig. 6 Correlation analysis between ZNF703 and ICPs ( A B C D E ZNF703 promotes cancer cell proliferation while suppressing the expression of CD274, ICAM1 and CXCL1 To validate these findings, we established a ZNF703 knockdown (KD) HCT-116 cell line (Fig. 7 7 7 6  Fig. 7 Validation experiments in ZNF703 KD HCT-116 ( A B C D E Enrichment analysis of ZNF703 functional related genes Through the intersection of the top 100 ZNF703-binding proteins identified from STRING and GEPIA2 databases, 11 overlapping genes were identified (Fig. 8 8 8 8 8 8 31 32 33 34 35 36 5 37 38  Fig. 8 ZNF703 gene enrichment analysis expression ( A B C D E F p G H p Gene-enrichment analysis of the 11 ZNF703-associated hub genes was performed. KEGG pathway analysis (Fig. 8 8 Discussion and conclusion The oncogenic roles of ZNF703 ZNF703 has been identified as a critical oncogene implicated in various malignancies. Located within the amplified region of chromosome 8p11-p12 [ 39 38 40 41 The oncogenic functions of ZNF703 are mediated through multiple molecular mechanisms. In response to estrogen receptor signaling, ZNF703 forms protein complexes with DCAF7, PHB2, and NCOR2 to suppress the transcription of E2F1 and P27Kip1, thereby accelerating G1 phase progression and regulating the self-renewal capacity of mammary cancer stem cells [ 6 6 9 42 43 44 45 Through comprehensive enrichment analysis utilizing STRING and GEPIA2 databases, we identified significant associations between ZNF703 and three potential oncogenes: DDHD2, LSM1, and BAG4, all of which are localized within the chromosome 8p11-p12 amplicon. DDHD2, a member of the phospholipase A1 (PLA1) protein family, plays a crucial role in Golgi-to-plasma membrane trafficking. LSM1 is involved in mRNA translation and metabolism, while BAG4 functions as an anti-apoptotic factor that negatively regulates cell death signaling pathways [ 41 5 ZNF703 May regulate tumor immunity through CD274, ICAM1 and CXCL3 To elucidate the potential mechanism of ZNF703 in modulating tumor immunity, we identified three putative ZNF703 target genes: PD-L1(CD274), ICAM1, and CX3CL1. Analysis of CHIP-Atlas data and experimental validation revealed that ZNF703 directly binds to the promoters of these genes and suppresses their expression. PD-L1, through its interaction with the receptor PD-1, downregulates T-cell function and survival, thereby facilitating tumor immune evasion [ 46 47 47 48 49 50 7 6 CX3CL1, in conjunction with its receptor CX3CR1, plays a pivotal role in tumorigenesis and tumor immunity by mediating immune cell recruitment and homing [ 51 52 53 54 52 55 + + 56 7 6 As a member of the immunoglobulin (Ig) superfamily, intercellular adhesion molecule 1 (ICAM1) interacts with macrophage antigen-1 (MAC-1) and lymphocyte function-associated antigen-1 (LFA-1) [ 57 58 59 60 + 61 62 63 6 7 + Conclusion In conclusion, our comprehensive pan-cancer analysis coupled with experimental validation demonstrates that ZNF703 exerts critical oncogenic functions in tumorigenesis through two distinct mechanisms: (1) synergistic interactions with its functional hub genes (DDHD2, LSM1, and BAG4), and (2) transcriptional repression of immune-related molecules, including PD-L1 (CD274), ICAM1, and CX3CL1, thereby modulating tumor immune responses. Supplementary Information  Supplementary Material 1: Figure S1 the relationship between the level of DNA methylation of ZNF703 and the survival of each CpG site in different tumors. Supplementary Material 2: Figure S2 The expression of the S87 and S252 phosphosites of ZNF 703 in tumor tissues and normal tissues. Supplementary Material 3: Figure S3 The scatter plot of ZNF703 immune-infiltrated level of CAFs. Several algorithms, such as TIMER, EPIC, QUANTISEQ, XCELL, MCPCOUNTER, CIBERSORT, CIBERSORT-ABS, and TIDE, were applied to explore the correlation. Positive correlation (0–1) are indicated with the red color, while negative correlation (−1 to 0) are indicated with the blue color. p Supplementary Material 4: Figure S4 The scatter plot of ZNF703 immune-infiltrated level of CD8 + Supplementary Material 5: Figure S5 The scatter plot of ZNF703 immune-infiltrated level of macrophage. Supplementary Material 6: Figure S6 The correlation between ZNF703 expression and the immune infiltration scores in multicancer types. (A) Stromal scores of TME. (B) Immune scores of TME for tumor samples. (C) Estimate scores of tumor purity in multicancer cases. Supplementary Material 7: Supplementary Table1 The 21bp optimal oligo sequence for pLKO.1-ZNF703shRNA and the related QPCR primers for GAPDH, CD274, ICAM1, CXCL3 are presented. Abbreviations Acs Apoptotic cells ACC Adrenocortical carcinoma ALL Acute Lymphoblastic Leukemia BLCA Bladder Urothelial Carcinoma CAFs Cancer-associated fibroblasts CESC Cervical Squamous Cell Carcinoma CHIP Chromatin Immunoprecipitation CHOL Cholangiocarcinoma CIBERSORT/CIBERSORTABS Cell-type Identification By Estimating Relative Subsets Of RNA Transcripts COAD Colon adenocarcinoma COADREAD Colon Adenocarcinoma + Rectal Adenocarcinoma CPS Combined positive score DCs Dendritic cells DFS Disease-free survival DLBC Diffuse large B-cell lymphoma EPIC Estimation of Proportions of Immune and Cancer cells ESCA Esophageal carcinoma GBM Glioblastoma Multiforme GEO Gene Expression Omnibus GO Gene Ontology HNSC Head and Neck Squamous Cell Carcinoma HNSC-HPV- Head and Neck Squamous Cell Carcinoma, HPV- ICPs Immune checkpoint Ig Immunoglobulin IPS Immune proportion score KEGG Kyoto Encyclopedia of Genes and Genomes KICH Kidney chromophobe KIPAN Pan-Kidney Cohort (KIRC + KIRP + KICH) KIRC Kidney Renal Clear Cell Carcinoma KIRP Kidney renal papillary cell carcinoma LAML Acute Myeloid Leukemia LGG Lower grade glioma LIHC Liver hepatocellular carcinoma LUAD Lung adenocarcinoma LUSC Lung squamous cell carcinoma M1-TAM M1 tumor associated macrophage M2-TAM M2 tumor associated macrophage MCPCOUNTER Microenvironment Cell Populations-counter MTC Medullary thyroid carcinoma NB Neuroblastoma NSCLS Non-small cell lung cancer OS Overall survival OSCC Oral squamous cell carcinoma OV Ovarian serous cystadenocarcinoma PAAD Pancreatic adenocarcinoma PRAD Prostate Adenocarcinoma PTC Papillary thyroid carcinoma PTMs Post-translational modifications QUANTISEQ Quantitative Imaging of Immune Cells RCC Renal cell carcinoma READ Rectum adenocarcinoma SARC Sarcoma SKCM Cutaneous melanoma STAD Stomach adenocarcinoma TAM Tumor-associated macrophage TME Tumor microenvironment TNF Tumor Necrosis Factor TPS Tumor proportion score TCGA The Cancer Genome Atlas TGCT Testicular Germ Cell Tumors THCA Thyroid carcinoma THYM Thymoma TIDE Tumor Immune Dysfunction and Exclusion TIMER Tumor Immune Estimation Resource TNBC Triple-negative breast cancer UCEC Uterine corpus endometrial carcinoma UCS Uterine Carcinosarcoma UVM Uveal Melanoma WT Wilms Tumor (Nephroblastoma) XECLL Cell Type Enrichment Analysis Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Xianli Shi and Jingyu Lie contributed equally to this work. Acknowledgements We thank members of Zhang Lab for their advices and support on the preparation of this work. Authors’ contributions Xianli Shi and Jingyu Lie Carried out the Data analysis, and wrote the manuscript; Rui Li performed the validation experiment; Haoming Chen wrote the methodology; Xianli Shi and Rongxin Zhang performed the proofreading. Funding Medical Science and Technology Research Fund of Guangdong province, No. A2025170. Data availability Data sharing is not applicable to this article as no datasets were generated. Declarations Ethics approval and consent to participate Not applicable. The data used in this study were obtained from open-access repositories (TCGA, cBioprotal, UALCAN, PhosphoNET, SWISS-MODEL, GEPIA2, CHIP-Altas, Cellphone BD, etc.) and were fully anonymized. Consent for publication Not applicable. This study utilized publicly available data from GEO/TCGA, which were fully anonymized and exempt from individual consent requirements under the database’s access policies. Competing interests The authors declare no competing interests. References 1. Pereira-Castro I Characterization of human NLZ1/ZNF703 identifies conserved domains essential for proper subcellular localization and transcriptional repression J Cell Biochem 2013 114 1 120 33 10.1002/jcb.24309 22886885 Pereira-Castro I, et al. Characterization of human NLZ1/ZNF703 identifies conserved domains essential for proper subcellular localization and transcriptional repression. J Cell Biochem. 2013;114(1):120–33. 22886885 10.1002/jcb.24309 2. Dutta S Nlz1 is required for cilia formation in zebrafish embryogenesis Dev Biol 2015 406 2 203 11 10.1016/j.ydbio.2015.08.019 26327644 PMC4639414 Dutta S, et al. Nlz1 is required for cilia formation in zebrafish embryogenesis. Dev Biol. 2015;406(2):203–11. 26327644 10.1016/j.ydbio.2015.08.019 PMC4639414 3. Pereira F Evolution of the NET (NocA, nlz, elbow, TLP-1) protein family in metazoans: insights from expression data and phylogenetic analysis Sci Rep 2016 6 38383 10.1038/srep38383 27929068 PMC5144077 Pereira F, et al. Evolution of the NET (NocA, nlz, elbow, TLP-1) protein family in metazoans: insights from expression data and phylogenetic analysis. Sci Rep. 2016;6:38383. 27929068 10.1038/srep38383 PMC5144077 4. Hong CS, Saint-Jeannet JP. Znf703, a novel target of Pax3 and Zic1, regulates hindbrain and neural crest development in Xenopus. Genesis, 2017. 55(12 ):10.1002/dvg.23082. 10.1002/dvg.23082 PMC5734999 29086464 5. Yang ZQ Multiple interacting oncogenes on the 8p11-p12 amplicon in human breast cancer Cancer Res 2006 66 24 11632 43 10.1158/0008-5472.CAN-06-2946 17178857 Yang ZQ, et al. Multiple interacting oncogenes on the 8p11-p12 amplicon in human breast cancer. Cancer Res. 2006;66(24):11632–43. 17178857 10.1158/0008-5472.CAN-06-2946 6. Sircoulomb F ZNF703 gene amplification at 8p12 specifies luminal B breast cancer EMBO Mol Med 2011 3 3 153 66 10.1002/emmm.201100121 21328542 PMC3395112 Sircoulomb F, et al. ZNF703 gene amplification at 8p12 specifies luminal B breast cancer. EMBO Mol Med. 2011;3(3):153–66. 21328542 10.1002/emmm.201100121 PMC3395112 7. Yang G ZNF703 acts as an oncogene that promotes progression in gastric cancer Oncol Rep 2014 31 4 1877 82 10.3892/or.2014.2997 24481460 Yang G, et al. ZNF703 acts as an oncogene that promotes progression in gastric cancer. Oncol Rep. 2014;31(4):1877–82. 24481460 10.3892/or.2014.2997 8. Wang J Transcription factor ZNF703 activates linc-UBC1 to stimulate the progression of glioma Eur Rev Med Pharmacol Sci 2020 24 6 3183 9 32271436 10.26355/eurrev_202003_20685 Wang J, et al. Transcription factor ZNF703 activates linc-UBC1 to stimulate the progression of glioma. Eur Rev Med Pharmacol Sci. 2020;24(6):3183–9. 32271436 10.26355/eurrev_202003_20685 9. Wang S ZNF703 promotes tumor progression in ovarian cancer by interacting with HE4 and epigenetically regulating PEA15 J Exp Clin Cancer Res 2020 39 1 264 10.1186/s13046-020-01770-0 33246486 PMC7693506 Wang S, et al. ZNF703 PEA15 33246486 10.1186/s13046-020-01770-0 PMC7693506 10. Orhan C ZNF703 is an important player in head and neck cancer Clin Otolaryngol 2019 44 6 1080 6 10.1111/coa.13450 31574205 Orhan C, et al. ZNF703 is an important player in head and neck cancer. Clin Otolaryngol. 2019;44(6):1080–6. 31574205 10.1111/coa.13450 11. Kennel KB Cancer-associated fibroblasts in inflammation and antitumor immunity Clin Cancer Res 2023 29 6 1009 16 10.1158/1078-0432.CCR-22-1031 36399325 PMC10011884 Kennel KB, et al. Cancer-associated fibroblasts in inflammation and antitumor immunity. Clin Cancer Res. 2023;29(6):1009–16. 36399325 10.1158/1078-0432.CCR-22-1031 PMC10011884 12. Ye B Navigating the immune landscape with plasma cells: a pan-cancer signature for precision immunotherapy Biofactors 2025 51 1 e2142 10.1002/biof.2142 39495620 Ye B, et al. Navigating the immune landscape with plasma cells: a pan-cancer signature for precision immunotherapy. Biofactors. 2025;51(1): e2142. 39495620 10.1002/biof.2142 13. Sun W Systemic immune-inflammation index predicts survival in patients with resected lung invasive mucinous adenocarcinoma Transl Oncol 2024 40 101865 10.1016/j.tranon.2023.101865 38101174 PMC10727949 Sun W, et al. Systemic immune-inflammation index predicts survival in patients with resected lung invasive mucinous adenocarcinoma. Transl Oncol. 2024;40: 101865. 38101174 10.1016/j.tranon.2023.101865 PMC10727949 14. de Visser KE Joyce JA The evolving tumor microenvironment: from cancer initiation to metastatic outgrowth Cancer Cell 2023 41 3 374 403 10.1016/j.ccell.2023.02.016 36917948 de Visser KE, Joyce JA. The evolving tumor microenvironment: from cancer initiation to metastatic outgrowth. Cancer Cell. 2023;41(3):374–403. 36917948 10.1016/j.ccell.2023.02.016 15. Kloosterman DJ Akkari L Macrophages at the interface of the co-evolving cancer ecosystem Cell 2023 186 8 1627 51 10.1016/j.cell.2023.02.020 36924769 Kloosterman DJ, Akkari L. Macrophages at the interface of the co-evolving cancer ecosystem. Cell. 2023;186(8):1627–51. 36924769 10.1016/j.cell.2023.02.020 16. Barber DL Restoring function in exhausted CD8 T cells during chronic viral infection Nature 2006 439 7077 682 7 10.1038/nature04444 16382236 Barber DL, et al. Restoring function in exhausted CD8 T cells during chronic viral infection. Nature. 2006;439(7077):682–7. 16382236 10.1038/nature04444 17. Pardoll DM The blockade of immune checkpoints in cancer immunotherapy Nat Rev Cancer 2012 12 4 252 64 10.1038/nrc3239 22437870 PMC4856023 Pardoll DM. The blockade of immune checkpoints in cancer immunotherapy. Nat Rev Cancer. 2012;12(4):252–64. 22437870 10.1038/nrc3239 PMC4856023 18. Blum A Wang P Zenklusen JC Snapshot: TCGA-analyzed tumors Cell 2018 173 2 530 10.1016/j.cell.2018.03.059 29625059 Blum A, Wang P, Zenklusen JC. Snapshot: TCGA-analyzed tumors. Cell. 2018;173(2):530. 29625059 10.1016/j.cell.2018.03.059 19. Clough E Barrett T The gene expression omnibus database Methods Mol Biol 2016 1418 93 110 10.1007/978-1-4939-3578-9_5 27008011 PMC4944384 Clough E, Barrett T. The gene expression omnibus database. Methods Mol Biol. 2016;1418:93–110. 27008011 10.1007/978-1-4939-3578-9_5 PMC4944384 20. Li T TIMER2.0 for analysis of tumor-infiltrating immune cells Nucleic Acids Res 2020 48 W1 W509 14 10.1093/nar/gkaa407 32442275 PMC7319575 Li T, et al. TIMER2.0 for analysis of tumor-infiltrating immune cells. Nucleic Acids Res. 2020;48(W1):W509–14. 32442275 10.1093/nar/gkaa407 PMC7319575 21. Tang Z GEPIA2: an enhanced web server for large-scale expression profiling and interactive analysis Nucleic Acids Res 2019 47 W1 W556 60 10.1093/nar/gkz430 31114875 PMC6602440 Tang Z, et al. GEPIA2: an enhanced web server for large-scale expression profiling and interactive analysis. Nucleic Acids Res. 2019;47(W1):W556–60. 31114875 10.1093/nar/gkz430 PMC6602440 22. Chandrashekar DS UALCAN: a portal for facilitating tumor subgroup gene expression and survival analyses Neoplasia 2017 19 8 649 58 10.1016/j.neo.2017.05.002 28732212 PMC5516091 Chandrashekar DS, et al. UALCAN: a portal for facilitating tumor subgroup gene expression and survival analyses. Neoplasia. 2017;19(8):649–58. 28732212 10.1016/j.neo.2017.05.002 PMC5516091 23. Gao J Integrative analysis of complex cancer genomics and clinical profiles using the cBioPortal Sci Signal 2013 6 269 pl1 10.1126/scisignal.2004088 23550210 PMC4160307 Gao J, et al. Integrative analysis of complex cancer genomics and clinical profiles using the cBioPortal. Sci Signal. 2013;6(269):pl1. 23550210 10.1126/scisignal.2004088 PMC4160307 24. Waterhouse A SWISS-MODEL: homology modelling of protein structures and complexes Nucleic Acids Res 2018 46 W1 W296 303 10.1093/nar/gky427 29788355 PMC6030848 Waterhouse A, et al. SWISS-MODEL: homology modelling of protein structures and complexes. Nucleic Acids Res. 2018;46(W1):W296–303. 29788355 10.1093/nar/gky427 PMC6030848 25. Chen F Pan-cancer molecular subtypes revealed by mass-spectrometry-based proteomic characterization of more than 500 human cancers Nat Commun 2019 10 1 5679 10.1038/s41467-019-13528-0 31831737 PMC6908580 Chen F, et al. Pan-cancer molecular subtypes revealed by mass-spectrometry-based proteomic characterization of more than 500 human cancers. Nat Commun. 2019;10(1):5679. 31831737 10.1038/s41467-019-13528-0 PMC6908580 26. Modhukur V Methsurv: a web tool to perform multivariable survival analysis using DNA methylation data Epigenomics 2018 10 3 277 88 10.2217/epi-2017-0118 29264942 Modhukur V, et al. Methsurv: a web tool to perform multivariable survival analysis using DNA methylation data. Epigenomics. 2018;10(3):277–88. 29264942 10.2217/epi-2017-0118 27. Zou Z ChIP-Atlas 2021 update: a data-mining suite for exploring epigenomic landscapes by fully integrating ChIP-seq, ATAC-seq and Bisulfite-seq data Nucleic Acids Res 2022 50 W1 W175 82 10.1093/nar/gkac199 35325188 PMC9252733 Zou Z, et al. ChIP-Atlas 2021 update: a data-mining suite for exploring epigenomic landscapes by fully integrating ChIP-seq, ATAC-seq and Bisulfite-seq data. Nucleic Acids Res. 2022;50(W1):W175–82. 35325188 10.1093/nar/gkac199 PMC9252733 28. Efremova M CellphoneDB: inferring cell-cell communication from combined expression of multi-subunit ligand-receptor complexes Nat Protoc 2020 15 4 1484 506 10.1038/s41596-020-0292-x 32103204 Efremova M, et al. CellphoneDB: inferring cell-cell communication from combined expression of multi-subunit ligand-receptor complexes. Nat Protoc. 2020;15(4):1484–506. 32103204 10.1038/s41596-020-0292-x 29. Szklarczyk D STRING v11: protein-protein association networks with increased coverage, supporting functional discovery in genome-wide experimental datasets Nucleic Acids Res 2019 47 D1 D607 13 10.1093/nar/gky1131 30476243 PMC6323986 Szklarczyk D, et al. STRING v11: protein-protein association networks with increased coverage, supporting functional discovery in genome-wide experimental datasets. Nucleic Acids Res. 2019;47(D1):D607–13. 30476243 10.1093/nar/gky1131 PMC6323986 30. Doncheva NT Cytoscape stringapp: network analysis and visualization of proteomics data J Proteome Res 2019 18 2 623 32 10.1021/acs.jproteome.8b00702 30450911 PMC6800166 Doncheva NT, et al. Cytoscape stringapp: network analysis and visualization of proteomics data. J Proteome Res. 2019;18(2):623–32. 30450911 10.1021/acs.jproteome.8b00702 PMC6800166 31. Chu J Circular RNA circRUNX1 promotes papillary thyroid cancer progression and metastasis by sponging MiR-296-3p and regulating DDHD2 expression Cell Death Dis 2021 12 1 112 10.1038/s41419-020-03350-8 33479208 PMC7819993 Chu J, et al. Circular RNA circRUNX1 promotes papillary thyroid cancer progression and metastasis by sponging MiR-296-3p and regulating DDHD2 expression. Cell Death Dis. 2021;12(1):112. 33479208 10.1038/s41419-020-03350-8 PMC7819993 32. Yi L Bcl–2 associated athanogene 4 promotes proliferation, migration and invasion of gastric cancer cells Mol Med Rep 2017 16 4 3753 60 10.3892/mmr.2017.7073 29067445 PMC5646952 Yi L, et al. Bcl–2 associated athanogene 4 promotes proliferation, migration and invasion of gastric cancer cells. Mol Med Rep. 2017;16(4):3753–60. 29067445 10.3892/mmr.2017.7073 PMC5646952 33. Little EC The CaSm (LSm1) oncogene promotes transformation, chemoresistance and metastasis of pancreatic cancer cells Oncogenesis 2016 5 1 e182 10.1038/oncsis.2015.45 26751936 PMC4728675 Little EC, et al. The CaSm (LSm1) oncogene promotes transformation, chemoresistance and metastasis of pancreatic cancer cells. Oncogenesis. 2016;5(1):e182. 26751936 10.1038/oncsis.2015.45 PMC4728675 34. Streicher KL Transforming function of the LSM1 oncogene in human breast cancers with the 8p11-12 amplicon Oncogene 2007 26 14 2104 14 10.1038/sj.onc.1210002 17001308 PMC2435249 Streicher KL, et al. Transforming function of the LSM1 oncogene in human breast cancers with the 8p11-12 amplicon. Oncogene. 2007;26(14):2104–14. 17001308 10.1038/sj.onc.1210002 PMC2435249 35. Cai C Correlation between LSM1 Expression and Clinical Outcomes in Glioblastoma and Functional Mechanisms Int J Genomics 2023 2023 1543620 10.1155/2023/1543620 37954131 PMC10635750 Cai C, et al. Correlation between LSM1 Expression and Clinical Outcomes in Glioblastoma and Functional Mechanisms. Int J Genomics. 2023;2023:1543620. 37954131 10.1155/2023/1543620 PMC10635750 36. Watson PM CaSm (LSm-1) overexpression in lung cancer and mesothelioma is required for transformed phenotypes Am J Respir Cell Mol Biol 2008 38 6 671 8 10.1165/rcmb.2007-0205OC 18218995 PMC2396246 Watson PM, et al. CaSm (LSm-1) overexpression in lung cancer and mesothelioma is required for transformed phenotypes. Am J Respir Cell Mol Biol. 2008;38(6):671–8. 18218995 10.1165/rcmb.2007-0205OC PMC2396246 37. Bernard-Pierrot I Characterization of the recurrent 8p11-12 amplicon identifies PPAPDC1B, a phosphatase protein, as a new therapeutic target in breast cancer Cancer Res 2008 68 17 7165 75 10.1158/0008-5472.CAN-08-1360 18757432 Bernard-Pierrot I, et al. Characterization of the recurrent 8p11-12 amplicon identifies PPAPDC1B, a phosphatase protein, as a new therapeutic target in breast cancer. Cancer Res. 2008;68(17):7165–75. 18757432 10.1158/0008-5472.CAN-08-1360 38. Kwek SS Co-amplified genes at 8p12 and 11q13 in breast tumors cooperate with two major pathways in oncogenesis Oncogene 2009 28 17 1892 903 10.1038/onc.2009.34 19330026 PMC2722962 Kwek SS, et al. Co-amplified genes at 8p12 and 11q13 in breast tumors cooperate with two major pathways in oncogenesis. Oncogene. 2009;28(17):1892–903. 19330026 10.1038/onc.2009.34 PMC2722962 39. Reynisdottir I High expression of ZNF703 independent of amplification indicates worse prognosis in patients with luminal B breast cancer Cancer Med 2013 2 4 437 46 10.1002/cam4.88 24156016 PMC3799278 Reynisdottir I, et al. High expression of ZNF703 independent of amplification indicates worse prognosis in patients with luminal B breast cancer. Cancer Med. 2013;2(4):437–46. 24156016 10.1002/cam4.88 PMC3799278 40. Głodzik D Mutational mechanisms of amplifications revealed by analysis of clustered rearrangements in breast cancers Ann Oncol 2018 29 11 2223 31 10.1093/annonc/mdy404 30252041 PMC6290883 Głodzik D, et al. Mutational mechanisms of amplifications revealed by analysis of clustered rearrangements in breast cancers. Ann Oncol. 2018;29(11):2223–31. 30252041 10.1093/annonc/mdy404 PMC6290883 41. Voutsadakis IA Amplification of 8p11.23 in cancers and the role of amplicon genes Life Sci 2021 264 118729 10.1016/j.lfs.2020.118729 33166592 Voutsadakis IA. Amplification of 8p11.23 in cancers and the role of amplicon genes. Life Sci. 2021;264:118729. 33166592 10.1016/j.lfs.2020.118729 42. Yang X Silencing of zinc finger protein 703 inhibits medullary thyroid carcinoma cell proliferation in vitro and in vivo Oncol Lett 2020 19 1 943 51 31897207 10.3892/ol.2019.11153 PMC6924197 Yang X, et al. Silencing of zinc finger protein 703 inhibits medullary thyroid carcinoma cell proliferation in vitro and in vivo. Oncol Lett. 2020;19(1):943–51. 31897207 10.3892/ol.2019.11153 PMC6924197 43. Baykara O ZNF703 overexpression May act as an oncogene in non-small cell lung cancer Cancer Med 2016 5 10 2873 8 10.1002/cam4.847 27650486 PMC5083741 Baykara O, et al. ZNF703 overexpression May act as an oncogene in non-small cell lung cancer. Cancer Med. 2016;5(10):2873–8. 27650486 10.1002/cam4.847 PMC5083741 44. Wang H Zinc finger protein 703 induces EMT and Sorafenib resistance in hepatocellular carcinoma by transactivating CLDN4 expression Cell Death Dis 2020 11 4 225 10.1038/s41419-020-2422-3 32269215 PMC7142083 Wang H, et al. Zinc finger protein 703 induces EMT and Sorafenib resistance in hepatocellular carcinoma by transactivating CLDN4 expression. Cell Death Dis. 2020;11(4):225. 32269215 10.1038/s41419-020-2422-3 PMC7142083 45. Harrison H Regulation of breast cancer stem cell activity by signaling through the Notch4 receptor Cancer Res 2010 70 2 709 18 10.1158/0008-5472.CAN-09-1681 20068161 PMC3442245 Harrison H, et al. Regulation of breast cancer stem cell activity by signaling through the Notch4 receptor. Cancer Res. 2010;70(2):709–18. 20068161 10.1158/0008-5472.CAN-09-1681 PMC3442245 46. Ai L Research status and outlook of PD-1/PD-L1 inhibitors for Cancer therapy Drug Des Devel Ther 2020 14 3625 49 10.2147/DDDT.S267433 32982171 PMC7490077 Ai L, et al. Research status and outlook of PD-1/PD-L1 inhibitors for Cancer therapy. Drug Des Devel Ther. 2020;14:3625–49. 32982171 10.2147/DDDT.S267433 PMC7490077 47. Zou W Wolchok JD Chen L PD-L1 (B7-H1) and PD-1 pathway blockade for cancer therapy: mechanisms, response biomarkers, and combinations Sci Transl Med 2016 8 328 rv3284 3284 10.1126/scitranslmed.aad7118 PMC4859220 26936508 Zou W, Wolchok JD, Chen L. PD-L1 (B7-H1) and PD-1 pathway blockade for cancer therapy: mechanisms, response biomarkers, and combinations. Sci Transl Med. 2016;8(328):rv3284-3284. 10.1126/scitranslmed.aad7118 PMC4859220 26936508 48. Kerr KM Hirsch FR Programmed death Ligand-1 immunohistochemistry: friend or foe?? Arch Pathol Lab Med 2016 140 4 326 31 10.5858/arpa.2015-0522-SA 26756647 Kerr KM, Hirsch FR. Programmed death Ligand-1 immunohistochemistry: friend or foe?? Arch Pathol Lab Med. 2016;140(4):326–31. 26756647 10.5858/arpa.2015-0522-SA 49. Ye B iMLGAM: integrated machine learning and genetic algorithm-driven multiomics analysis for pan-cancer immunotherapy response prediction Imeta 2025 4 2 e70011 10.1002/imt2.70011 40236779 PMC11995183 Ye B, et al. iMLGAM: integrated machine learning and genetic algorithm-driven multiomics analysis for pan-cancer immunotherapy response prediction. Imeta. 2025;4(2): e70011. 40236779 10.1002/imt2.70011 PMC11995183 50. Galon J Bruni D Approaches to treat immune hot, altered and cold tumours with combination immunotherapies Nat Rev Drug Discov 2019 18 3 197 218 10.1038/s41573-018-0007-y 30610226 Galon J, Bruni D. Approaches to treat immune hot, altered and cold tumours with combination immunotherapies. Nat Rev Drug Discov. 2019;18(3):197–218. 30610226 10.1038/s41573-018-0007-y 51. Conroy MJ Identifying a novel role for fractalkine (CX3CL1) in memory CD8(+) T cell accumulation in the omentum of obesity-associated cancer patients Front Immunol 2018 9 1867 10.3389/fimmu.2018.01867 30150990 PMC6099201 Conroy MJ, et al. Identifying a novel role for fractalkine (CX3CL1) in memory CD8(+) T cell accumulation in the omentum of obesity-associated cancer patients. Front Immunol. 2018;9: 1867. 30150990 10.3389/fimmu.2018.01867 PMC6099201 52. Böttcher JP Functional classification of memory CD8(+) T cells by CX3CR1 expression Nat Commun 2015 6 8306 10.1038/ncomms9306 26404698 PMC4667439 Böttcher JP, et al. Functional classification of memory CD8(+) T cells by CX3CR1 expression. Nat Commun. 2015;6: 8306. 26404698 10.1038/ncomms9306 PMC4667439 53. Nukiwa M Dendritic cells modified to express fractalkine/CX3CL1 in the treatment of preexisting tumors Eur J Immunol 2006 36 4 1019 27 10.1002/eji.200535549 16525992 Nukiwa M, et al. Dendritic cells modified to express fractalkine/CX3CL1 in the treatment of preexisting tumors. Eur J Immunol. 2006;36(4):1019–27. 16525992 10.1002/eji.200535549 54. Xin H Antitumor immune response by CX3CL1 fractalkine gene transfer depends on both NK and T cells Eur J Immunol 2005 35 5 1371 80 10.1002/eji.200526042 15789339 Xin H, et al. Antitumor immune response by CX3CL1 fractalkine gene transfer depends on both NK and T cells. Eur J Immunol. 2005;35(5):1371–80. 15789339 10.1002/eji.200526042 55. Park MH Lee JS Yoon JH High expression of CX3CL1 by tumor cells correlates with a good prognosis and increased tumor-infiltrating CD8 + T cells, natural killer cells, and dendritic cells in breast carcinoma J Surg Oncol 2012 106 4 386 92 10.1002/jso.23095 22422195 Park MH, Lee JS, Yoon JH. High expression of CX3CL1 by tumor cells correlates with a good prognosis and increased tumor-infiltrating CD8 + T cells, natural killer cells, and dendritic cells in breast carcinoma. J Surg Oncol. 2012;106(4):386–92. 22422195 10.1002/jso.23095 56. Guo J Fractalkine transgene induces T-cell-dependent antitumor immunity through chemoattraction and activation of dendritic cells Int J Cancer 2003 103 2 212 20 10.1002/ijc.10816 12455035 Guo J, et al. Fractalkine transgene induces T-cell-dependent antitumor immunity through chemoattraction and activation of dendritic cells. Int J Cancer. 2003;103(2):212–20. 12455035 10.1002/ijc.10816 57. Staunton DE The arrangement of the immunoglobulin-like domains of ICAM-1 and the binding sites for LFA-1 and rhinovirus Cell 1990 61 2 243 54 10.1016/0092-8674(90)90805-O 1970514 Staunton DE, et al. The arrangement of the immunoglobulin-like domains of ICAM-1 and the binding sites for LFA-1 and rhinovirus. Cell. 1990;61(2):243–54. 1970514 10.1016/0092-8674(90)90805-o 58. Kong DH Emerging roles of vascular cell adhesion molecule-1 (VCAM-1) in immunological disorders and cancer Int J Mol Sci 2018 10.3390/ijms19041057 29614819 PMC5979609 Kong DH, et al. Emerging roles of vascular cell adhesion molecule-1 (VCAM-1) in immunological disorders and cancer. Int J Mol Sci. 2018. 10.3390/ijms19041057. 29614819 10.3390/ijms19041057 PMC5979609 59. Blank C ICAM-1 contributes to but is not essential for tumor antigen cross-priming and CD8 + T cell-mediated tumor rejection in vivo J Immunol 2005 174 6 3416 20 10.4049/jimmunol.174.6.3416 15749875 Blank C, et al. ICAM-1 contributes to but is not essential for tumor antigen cross-priming and CD8 + T cell-mediated tumor rejection in vivo. J Immunol. 2005;174(6):3416–20. 15749875 10.4049/jimmunol.174.6.3416 60. Figenschau SL ICAM1 expression is induced by proinflammatory cytokines and associated with TLS formation in aggressive breast cancer subtypes Sci Rep 2018 8 1 11720 10.1038/s41598-018-29604-2 30082828 PMC6079003 Figenschau SL, et al. ICAM1 expression is induced by proinflammatory cytokines and associated with TLS formation in aggressive breast cancer subtypes. Sci Rep. 2018;8(1):11720. 30082828 10.1038/s41598-018-29604-2 PMC6079003 61. Lee SH Intracellular adhesion Molecule-1 improves responsiveness to immune checkpoint inhibitor by activating CD8(+) T cells Adv Sci (Weinh) 2023 10 17 e2204378 10.1002/advs.202204378 37097643 PMC10265102 Lee SH, et al. Intracellular adhesion Molecule-1 improves responsiveness to immune checkpoint inhibitor by activating CD8(+) T cells. Adv Sci (Weinh). 2023;10(17):e2204378. 37097643 10.1002/advs.202204378 PMC10265102 62. Wiesolek HL Intercellular adhesion molecule 1 functions as an efferocytosis receptor in inflammatory macrophages Am J Pathol 2020 190 4 874 85 10.1016/j.ajpath.2019.12.006 32035057 PMC7180595 Wiesolek HL, et al. Intercellular adhesion molecule 1 functions as an efferocytosis receptor in inflammatory macrophages. Am J Pathol. 2020;190(4):874–85. 32035057 10.1016/j.ajpath.2019.12.006 PMC7180595 63. Zhou Q Role of ICAM1 in tumor immunity and prognosis of triple-negative breast cancer Front Immunol 2023 14 1176647 10.3389/fimmu.2023.1176647 37671167 PMC10475526 Zhou Q, et al. Role of ICAM1 in tumor immunity and prognosis of triple-negative breast cancer. Front Immunol. 2023;14: 1176647. 37671167 10.3389/fimmu.2023.1176647 PMC10475526 ",
  "metadata": {
    "Title of this paper": "Role of ICAM1 in tumor immunity and prognosis of triple-negative breast cancer",
    "Journal it was published in:": "BMC Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482501/"
  }
}