{
  "title": "Paper_307",
  "abstract": "pmc Plast Reconstr Surg Glob Open Plast Reconstr Surg Glob Open 2522 prsgo GOX Plastic and Reconstructive Surgery Global Open 2169-7574 Wolters Kluwer Health PMC12487904 PMC12487904.1 12487904 12487904 41040896 10.1097/GOX.0000000000007152 GOX-D-25-00219 1 3 Reconstructive Case Report Prophylactic Pectoralis Major Muscle Flap in Esophageal Reconstruction: A Preventive Approach to Anastomotic Leakage Kondo Akatsuki MD, PhD 1 Umezawa Hiroki MD, PhD 1 Taga Marie MD 1 Ogawa Rei MD, PhD, FACS 1 From the Department of Plastic, Reconstructive and Aesthetic Surgery, Nippon Medical School Hospital, Tokyo, Japan. Akatsuki Kondo, MD, PhD, Department of Plastic, Reconstructive and Aesthetic Surgery, Nippon Medical School Hospital, 1-1-5 Sendagi Bunkyo-ku, Tokyo 113-8603, Japan, E-mail: kondoakatsuki@gmail.com 10 2025 01 10 2025 13 10 498115 e7152 28 2 2025 12 8 2025 01 10 2025 02 10 2025 03 10 2025 Copyright © 2025 The Authors. Published by Wolters Kluwer Health, Inc. on behalf of The American Society of Plastic Surgeons. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution-Non Commercial-No Derivatives License 4.0 (CCBY-NC-ND) Summary: Leakage from gastrointestinal flap anastomoses remains a significant challenge in reconstructive esophageal surgery, occurring in 10%–25% of cases, leading to prolonged hospital stays and high mortality rates. We explored a novel preventive approach, where the flap anastomosis is wrapped with a pectoralis major muscle (PMM) flap. We describe 3 patients (men aged 70–78 y) with esophageal cancer who underwent esophageal reconstruction with a jejunal flap followed by prophylactic PMM flap coverage. In case 1, the jejunal flap was supercharged and underwent esophagojejunal anastomosis. The esophagojejunal anastomosis was covered with the PMM flap. In case 2, pharyngojejunal and jejunogastric anastomoses were performed, and the latter was wrapped with a PMM flap. In case 3, the patient initially underwent a retrosternal gastric pull-up, which failed due to complications. During salvage surgery, a free jejunal flap was used, and the pharyngojejunal and jejunogastric anastomoses were both prophylactically covered with a PMM flap. Anastomotic leakage was not observed on postoperative endoscopy. PMM flap coverage may reduce anastomotic leakage by providing well-vascularized muscle tissue that promotes wound healing and by protecting the anastomosis from gravitational traction forces and mechanical stress. Although preliminary, our results suggest that prophylactic use of PMM flaps may prevent complications after esophageal reconstruction, particularly in patients requiring high-risk esophageal reconstruction. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes OPEN-ACCESS TRUE COUNTRY JAPAN SDC T Anastomotic leakage after esophagectomy, occurring in 10%–25% of patients, is a severe complication that increases the risk of sepsis, length of hospital stay, and mortality. 1 2 3 The PMM flap is effective in treating existing leaks and fistulas due to its reliable blood supply, bulk, and structural support. 4 SURGICAL TECHNIQUE The PMM flap is elevated through an existing sternocostal incision or a new chest incision. A skin flap is raised to expose the PMM border. For a myocutaneous flap, perforating branches are incorporated, particularly the critical perforating branch (IV-A) of the thoracoacromial artery, which enters the muscle medial to the nipple at the level of the fourth intercostal space. 5 CASE PRESENTATIONS All patients consented in writing to the publication of their medical details. Case 1: This 77-year-old man had thoracic esophageal cancer (Ut-Lt, cT3brN1M0, Stage IIIb) that was being managed with 2 cycles of 5-FU/cisplatin followed by thoracoscopic esophagectomy with open total gastrectomy. Reconstruction was performed with a pedicled jejunal flap using supercharging/superdrainage through the left fourth intercostal vessels. The esophagojejunal anastomosis was then wrapped using a left PMM flap (Fig. 1 Fig. 1. Intraoperative photographs of esophageal reconstruction with a jejunal flap and PMM flap coverage. A, Pedicled jejunal flap supercharged via anastomosis with the left fourth intercostal vessels, along with a harvested left PMM flap. B, PMM flap wrapped around the esophagojejunal anastomosis site. Case 2: This 78-year-old man had synchronous hypopharyngeal and thoracic esophageal cancer (Ce-Lt, cT1bN1M0, Stage II). It was treated with 2 cycles of fluoropyrimidine chemotherapy, after which combined thoracoscopic esophagectomy and total laryngectomy were performed by esophageal and head/neck surgical teams. Reconstruction was performed using a free jejunal flap (20 cm long) with pharyngojejunal anastomosis and anterior chest-wall gastric pull-up with jejunogastric anastomosis. Vessel anastomosis was performed to the left transverse cervical artery and the external jugular vein. A left PMM flap was wrapped around the jejunogastric anastomosis (Fig. 2 Fig. 2. Intraoperative photograph demonstrating esophageal reconstruction with a jejunal flap and jejunogastric anastomosis. A left PMM flap is used to cover the jejunogastric anastomosis. Case 3 (salvage case): This 70-year-old man had synchronous hypopharyngeal and thoracic esophageal cancers (Ut, cT3N3M0, Stage III) along with a history of radiation-treated (59.2 Gy) laryngeal cancer. The patient’s complex history and subsequent reconstructive challenges highlighted the need for proactive soft-tissue reinforcement, and his complications prompted our development of the prophylactic PMM flap approach. Initial treatment included thoracoscopic subtotal esophagectomy with retrosternal gastric reconstruction. Complications began on POD 12 with a subcutaneous cervical abscess leading to a gastric–skin fistula. After conservative management failed, on POD 61, the patient underwent fistula resection and reconstruction with a free jejunal flap, pharyngojejunal and jejunogastric anastomoses, and vessel anastomosis to the left transverse cervical and internal jugular vessels. A left PMM flap that bore a 15 × 11 cm skin island (ie, a pectoralis major myocutaneous flap) was used to reinforce the pharyngojejunal and jejunogastric anastomoses. It simultaneously reconstructed the skin lesion (Fig. 3 See figure, Supplemental Digital Content 1 https://links.lww.com/PRSGO/E359 Fig. 3. Salvage surgery for retrosternal gastric reconstruction with a skin–gastric fistula. A left pectoralis major myocutaneous flap (15 × 11 cm island) reconstructs the skin defect and covers pharyngojejunal and jejunogastric anastomoses. DISCUSSION This case series suggests that prophylactic PMM flap coverage of anastomoses may prevent leakage. However, variability in reconstruction methods and patient radiation histories (only case 3 was irradiated) limits its generalizability and highlights the need for larger studies. Although PMM flaps are used in salvage cases, this is the first report, to our knowledge, of prophylactic use in primary, nonsalvage esophageal reconstructions. 6 Patient selection for this prophylactic technique is key. High-risk candidates include those with a history of radiation, prior complex reconstructions, poor nutritional status, or anticipated high mechanical stress on the anastomosis. For these patients, the benefits of preventing a catastrophic leak may outweigh the risks of additional operative time and donor site morbidity. Harvesting through the same incision minimizes additional operative time. Potential flap complications (eg, necrosis, infection) require prompt surgical reexploration and possible use of alternative flaps such as a contralateral PMM flap. Our approach may reduce mortality from septic leaks, especially in high-risk, chemo-irradiated patients who are prone to poor healing. 7 8 9 10 This study’s limitations include its small sample size, short follow-up, and lack of a control group. Larger prospective studies are needed to help validate our findings, define patient selection criteria, and establish protocols. CONCLUSIONS We report the prophylactic use of PMM flaps in esophageal reconstruction. This technique may prevent anastomotic leakage by improving vascularity and providing mechanical support, proving especially useful for high-risk patients. Further validation is required. DISCLOSURE The authors have no financial interest to declare in relation to the content of this article. Supplementary Material Published online 1 October 2025.  Disclosure statements are at the end of this article, following the correspondence information. Related Digital Media are available in the full-text version of the article on www.PRSGlobalOpen.com The data reported in this study are available from the corresponding author upon reasonable request. REFERENCES 1. Gujjuri RR Kamarajah SK Markar SR Effect of anastomotic leaks on long-term survival after oesophagectomy for oesophageal cancer: systematic review and meta-analysis. Dis Esophagus 2021 34 doaa085 32901259 10.1093/dote/doaa085 2. Ascioti AJ Hofstetter WL Miller MJ Long-segment, supercharged, pedicled jejunal flap for total esophageal reconstruction. J Thorac Cardiovasc Surg 2005 130 1391 1398 16256794 10.1016/j.jtcvs.2005.06.032 3. Takeuchi H Saikawa Y Oyama T Factors influencing the long-term survival in patients with esophageal cancer who underwent esophagectomy after chemoradiotherapy. World J Surg 2010 34 277 284 20033687 10.1007/s00268-009-0331-9 4. Fabbi M Hagens ERC van Berge Henegouwen MI Anastomotic leakage after esophagectomy for esophageal cancer: definitions, diagnostics, and treatment. Dis Esophagus 2021 34 doaa039 32476017 10.1093/dote/doaa039 PMC7801633 5. Albirmawy OA Prevention of postlaryngectomy pharyngocutaneous fistula using a sternocleidomastoid muscle collar flap. J Laryngol Otol 2007 121 253 257 16923317 10.1017/S0022215106002659 6. Zbar RI Funk GF McCulloch TM Pectoralis major myofascial flap: a valuable tool in contemporary head and neck reconstruction. Head Neck 1997 19 412 418 9243269 10.1002/(sici)1097-0347(199708)19:5<412::aid-hed8>3.0.co;2-2 7. Heitmiller RF McQuone SJ Eisele DW The utility of the pectoralis myocutaneous flap in the management of select cervical esophageal anastomotic complications. J Thorac Cardiovasc Surg 1998 115 1250 1254 9628665 10.1016/S0022-5223(98)70206-5 8. Rikimaru H Kiyokawa K Inoue Y Three-dimensional anatomical vascular distribution in the pectoralis major myocutaneous flap. Plast Reconstr Surg 2005 115 1342 1352; discussion 1353 15809597 10.1097/01.prs.0000156972.66044.5c 9. Miyamoto S Sakuraba M Nagamatsu S Combined use of free jejunum and pectoralis major muscle flap with skin graft for reconstruction after salvage total pharyngolaryngectomy. Microsurgery 2013 33 119 124 22821761 10.1002/micr.22017 10. Kalata S Singh B Graham N Epidemiology of postoperative complications after esophagectomy: implications for management. Ann Thorac Surg 2023 116 1168 1175 37704003 10.1016/j.athoracsur.2023.09.004 ",
  "metadata": {
    "Title of this paper": "Epidemiology of postoperative complications after esophagectomy: implications for management.",
    "Journal it was published in:": "Plastic and Reconstructive Surgery Global Open",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487904/"
  }
}