{
  "title": "Paper_141",
  "abstract": "pmc Am J Case Rep Am J Case Rep 2001 amjcasereps amjcaserep The American Journal of Case Reports 1941-5923 International Scientific Information, Inc. PMC12495898 PMC12495898.1 12495898 12495898 41024419 10.12659/AJCR.948218 948218 1 Articles Disseminated Peritoneal Leiomyomatosis of the Peritoneum Following Laparoscopic Supracervical Hysterectomy with Morcellation: A Case Report Młodawski Jakub https://orcid.org/0000-0002-5740-9822 1 2 E Majczak Marcin 3 E Zmelonek-Znamirowska Anna https://orcid.org/0000-0002-6610-7965 1 2 B Kabza Jakub https://orcid.org/0009-0006-0013-3227 1 2 C Młodawska Marta https://orcid.org/0000-0001-8867-7638 1 B Domagała Zdzisław 1 E Zbylut Nina 4 E Lewitowicz Piotr https://orcid.org/0000-0002-5443-7975 4 E Świercz Grzegorz https://orcid.org/0000-0002-4175-0209 1 2 F  1  2  3  4 Corresponding Author: Jakub Młodawski, e-mail: jakub.mlodawski@ujk.edu.pl A Study Design B Data Collection C Statistical Analysis D Data Interpretation E Manuscript Preparation F Literature Search G Funds Collection 2025 30 9 2025 20 8 2025 26 478682 e948218 20 1 2025 05 8 2025 30 09 2025 05 10 2025 05 10 2025 © Am J Case Rep, 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This work is licensed under Creative Common Attribution-NonCommercial-NoDerivatives 4.0 International ( CC BY-NC-ND 4.0 Patient: Female, 40-year-old Final Diagnosis: Disseminated peritoneal leiomyomatosis Symptoms: Lower abdominal pain Clinical Procedure: — Specialty: Obstetrics and Gynecology Objective: Rare disease Background Disseminated peritoneal leiomyomatosis is a rare complication of laparoscopic procedures involving uterine morcellation. These fibroid-like lesions, which derive their blood supply from non-uterine sources, may develop after myomectomy, supracervical hysterectomy, or total laparoscopic hysterectomy – particularly when mechanical morcellation is used. Although the incidence is low, disseminated leiomyomatosis should be considered in the differential diagnosis of abdominal or pelvic pain in patients with a history of such surgeries. Case Report A 40-year-old woman presented with intermittent lower abdominal pain. She had undergone a laparoscopic supracervical hysterectomy with salpingectomy 5 years earlier due to abnormal uterine bleeding, during which uncontained mechanical morcellation was performed. At present, transvaginal ultrasound revealed a solid mass adjacent to the bladder with features suggestive of a leiomyoma. Magnetic resonance imaging (MRI) showed multiple lesions, including a polycyclic mass located above the bladder and additional foci near the sigmoid colon and the bladder dome. Laparoscopy confirmed the presence of leiomyomas on the anterior abdominal wall, sigmoid colon adventitia, and bladder dome. All lesions were excised using laparoscopic techniques, and the postoperative course was uneventful. Histopathological examination confirmed leiomyomas with positive estrogen and progesterone receptor expression. Conclusions This case underscores the importance of considering disseminated peritoneal leiomyomatosis in the differential diagnosis of abdominal or pelvic pain in patients with a history of laparoscopic hysterectomy with morcellation. It also emphasizes that this condition can mimic malignancy on imaging studies and highlights the essential role of histopathological examination in diagnosing this benign disease. Humans Hybridomas Laparoscopy Leiomyoma Predictive Value of Tests Uterine Neoplasms pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction According to World Health Organization (WHO) data, hysterectomy is one of the most commonly performed surgical procedures in women [ 1 1 2 3 It is also widely believed that subtotal hysterectomy lowers the risk of pelvic floor dysfunction and vaginal prolapse [ 4 5 An advantage of retaining the cervix is its potential role as an anchoring point for procedures such as sacrocolpopexy or laparoscopic lateral suspension [ 6 7 The dissemination of myometrial cells is one of the leading theories explaining the pathogenesis of DPL. An alternative theory, proposed by Morgan et al in 2022, suggests that DPL may originate from the metaplasia of stem cells [ 8 Case Report A 40-year-old woman was referred to a gynecologist by her general practitioner due to intermittent lower abdominal pain without additional symptoms, and a suspected solid ovarian mass was detected during an abdominal ultrasound. Her medical history was unremarkable except for a laparoscopic supracervical hysterectomy with salpingectomy performed 5 years earlier due to abnormal uterine bleeding. During the initial laparoscopic procedure, mechanical morcellation was carried out without the use of a containment system. Postoperative histopathological analysis confirmed the presence of uterine leiomyomas (2 mitotic figures per 10 high-power fields). During the consultation, gynecological examination with a speculum revealed a cervical stump with no suspicious oncological findings. No palpable adnexal abnormalities were detected. Transvaginal ultrasound showed a solid pelvic mass with irregular structure and low vascularity (color Doppler score=1). The echogenicity of the lesion was similar to that of the cervical stump ( Figure 1 Figure 2 Pelvic and abdominal magnetic resonance imaging (MRI) revealed a polycyclic mass of intermediate signal intensity on T2-weighted images, located above and slightly to the left of the bladder, measuring 45×36×30 mm (right-left×anterior-posterior×head-foot). Two additional foci with similar signal characteristics were identified: one adherent to the sigmoid colon (approximately 23×19 mm) and a smaller lesion (approximately 7 mm in diameter) located near the superior right side of the bladder wall. On Liver Acquisition with Volume Acceleration (LAVA) sequences, all lesions showed contrast enhancement comparable to that of the cervical stump ( Figures 3 6 Based on the imaging findings, residual uterine fragments from prior morcellation (ie, DPL) were suspected. The patient was scheduled for laparoscopic excision of the lesions. During laparoscopy, after establishing pneumoperitoneum, a 5-cm mass was identified on the anterior abdominal wall in the midline above the bladder dome, covered by parietal peritoneum. Morphologically, the lesion resembled a leiomyoma. It was adherent to omental appendages and the sigmoid colon. Additionally, a 2-cm lesion was found on the surface of the sigmoid colon adventitia ( Figure 7 A third lesion, approximately 1 cm in diameter and resembling a leiomyoma, was identified subperitoneally near the bladder dome ( Figure 8 Figure 9 All excised specimens were retrieved from the abdominal cavity using a laparoscopic endobag. The patient had an uneventful recovery and was discharged on postoperative day 3 in good general condition. Histopathological analysis confirmed leiomyomas of the abdominal soft tissue. Immunohistochemistry demonstrated positivity for estrogen receptor, progesterone receptor, desmin, and smooth muscle actin (SMA). CD117 and CD34 were negative. The Ki-67 index was 1%, and the mitotic index was 0 per 10 high-power fields ( Figure 10 Discussion This case illustrates a rare but significant complication that should be considered in the differential diagnosis of multiple peritoneal masses, particularly in patients with a history of surgery for uterine fibroids. In laparoscopic procedures such as myomectomy, total laparoscopic hysterectomy, or supracervical hysterectomy – especially when the uterus is too large to remove vaginally – morcellation is often employed to fragment and extract tissue. However, morcellation carries several inherent risks. The literature describes cases of organ injury caused by morcellator blades, most commonly affecting the colon, abdominal vessels, kidneys, ureters, bladder, and diaphragm [ 9 A major concern is the dissemination of uterine tissue fragments into the abdominal cavity, particularly when malignancy is diagnosed postoperatively, such as endometrial carcinoma or sarcoma. Adequate preoperative evaluation is crucial to minimize this risk, including cervical cytology, high-risk human papillomavirus testing, endometrial biopsy, and ultrasound assessment of uterine fibroids. However, ultrasonography remains a weak point, as no definitive imaging markers currently exist to distinguish between benign fibroids and uterine sarcomas. The risk of an unexpected sarcoma diagnosis following presumed benign uterine surgery is estimated at approximately 0.2% [ 10 If malignancy is identified postoperatively, morcellation significantly worsens the prognosis. It increases the recurrence rate at 1 year (RR=2.38; 95% CI: 1.05–5.38) and at 3 years (RR=1.88; 95% CI: 1.50–2.37), as well as mortality within the first year (RR=4.75; 95% CI: 1.03–22.0) [ 11 Another important risk is the unintentional spread of benign fibroids or smooth muscle tumors of uncertain malignant potential, which may result in the development of peritoneal leiomyomas [ 12 13 The incidence of DPL ranges between 0.12% and 0.95%, depending on the study, and may be slightly higher in patients undergoing morcellation during myomectomy vs patients undergoing morcellation during supracervical hysterectomy [ 14 8 15 16 A systematic review of 21 studies on DPL found the mean age at diagnosis to be 38.5 years [ 8 16 16 8 9 The most common sites for DPL include the peritoneum, omentum, and mesentery [ 8 16 17 Interestingly, DPL has also been reported in patients without prior uterine surgery or with an intact uterus [ 18 19 9 Other benign complications associated with morcellation include de novo endometriosis and adenomyomas. The risk of developing de novo endometriosis after subtotal hysterectomy or myomectomy is estimated at approximately 1.4%, which is similar to the risk in control groups not exposed to morcellation [ 20 DPL presents significant diagnostic challenges. Imaging studies such as transvaginal ultrasound and MRI play a central role. The presence of T2 hypointensity in extrauterine masses – similar to that of uterine fibroids – in patients with a history of fibroids or prior morcellation should raise suspicion for DPL [ 19 21 8 22 Due to these risks, the U.S. Food and Drug Administration (FDA) has addressed the safety of power morcellation since 2014 [ 23 24 22 Containment systems are designed to prevent tissue dissemination into the peritoneal cavity. However, their use presents several limitations, including poor visibility within the containment bag, longer operative times, risk of injury to adjacent structures (due to blind manipulation), and the possibility of the bag becoming trapped in the morcellation device [ 6 25 Conclusions This case highlights the importance of considering DPL in the differential diagnosis of abdominal or pelvic pain following laparoscopic hysterectomy with morcellation. The condition may mimic malignancy on imaging and underscores the critical role of histopathological evaluation in confirming this benign diagnosis. Conflict of interest: Department and Institution Where Work Was Done: Patient Consent: Declaration of Figures’ Authenticity: Financial support: References 1 Clayton RD Hysterectomy Best Pract Res Clin Obstet Gynaecol 2006 20 1 73 87 16275095 10.1016/j.bpobgyn.2005.09.007 2 Lindquist SAI Shah N Overgaard C Association of previous cesarean delivery with surgical complications after a hysterectomy later in life JAMA Surg 2017 152 12 1148 55 28793157 10.1001/jamasurg.2017.2825 PMC5831435 3 Millet P Gauthier T Vieillefosse S Should we perform cervix removal during hysterectomy for benign uterine disease? Clinical practice guidelines from the French College of Gynecologists and Obstetricians (CNGOF) J Gynecol Obstet Hum Reprod 2021 50 8 102134 33794370 10.1016/j.jogoh.2021.102134 4 Zekam N Oyelese Y Goodwin K Total versus subtotal hysterectomy: A survey of gynecologists Obstet Gynecol 2003 102 2 301 5 12907103 10.1016/s0029-7844(03)00529-5 5 Andersen LL Alling Møller LM Gimbel HM Objective comparison of subtotal vs total abdominal hysterectomy regarding pelvic organ prolapse and urinary incontinence: A randomized controlled trial with 14 year follow up Eur J Obstet Gynecol Reprod Biol 2015 193 40 45 26231437 10.1016/j.ejogrb.2015.06.033 6 Tius V Arcieri M Taliento C Laparoscopic sacrocolpopexy with concurrent hysterectomy or uterine preservation: A meta analysis and systematic review Int J Gynaecol Obstet 2025 168 2 456 71 39324500 10.1002/ijgo.15891 7 Bucuri CE Ciortea R Malutan AM Disseminated peritoneal leiomyomatosis – a challenging diagnosis mimicking malignancy: Scoping review of the last 14 years Biomedicines 2024 12 8 1749 39200214 10.3390/biomedicines12081749 PMC11351519 8 Morgan ED Kahiye M Kule I Disseminated peritoneal leiomyomatosis as an incidental finding: A case report Clin Case Rep 2022 10 e05541 35280083 10.1002/ccr3.5541 PMC8898820 9 Milad MP Milad EA Laparoscopic morcellator related complications J Minim Invasive Gynecol 2014 21 3 486 91 24333632 10.1016/j.jmig.2013.12.003 10 Mahnert N Morgan D Campbell D Unexpected gynecologic malignancy diagnosed after hysterectomy performed for benign indications Obstet Gynecol 2015 125 2 397 405 25569001 10.1097/AOG.0000000000000642 11 Raine Bennett T Tucker LY Zaritsky E Occult uterine sarcoma and leiomyosarcoma: Incidence of and survival associated with morcellation Obstet Gynecol 2016 127 1 29 39 26646120 10.1097/AOG.0000000000001187 12 Tinelli A D’Oria O Civino E Smooth muscle tumor of uncertain malignant potential (STUMP): A comprehensive multidisciplinary update Medicina (Kaunas) 2023 59 8 1371 37629661 10.3390/medicina59081371 PMC10456637 13 Ostrzenski A Uterine leiomyoma particle growing in an abdominal wall incision after laparoscopic retrieval Obstet Gynecol 1997 89 853 54 9166349 10.1016/s0029-7844(97)81428-7 14 Tulandi T Leung A Jan N Non malignant sequelae of unconfined morcellation at laparoscopic hysterectomy or myomectomy J Minim Invasive Gynecol 2016 23 3 331 37 26802909 10.1016/j.jmig.2016.01.017 15 Cucinella G Granese R Calagna G Parasitic myomas after laparoscopic surgery: An emerging complication in the use of morcellator? Fertil Steril 2011 96 2 e90 e96 21719004 10.1016/j.fertnstert.2011.05.095 16 Leren VA Langebrekke V Qvigstad E Parasitic leiomyomas after laparoscopic surgery with morcellation Acta Obstet Gynecol Scand 2012 91 11 1233 36 22574911 10.1111/j.1600-0412.2012.01453.x 17 Harnanan D Hariharan S Maharaj R Extrauterine leiomyomata presenting with sepsis requiring hemicolectomy Rev Bras Ginecol Obstet 2012 34 285 89 22801604 18 Li J Dai S Leiomyomatosis peritonealis disseminata: A clinical analysis of 13 cases and literature review Int J Surg Pathol 2020 28 2 163 68 31615319 10.1177/1066896919880962 19 Hiremath SB Benjamin G Gautam AA Disseminated peritoneal leiomyomatosis: A rare cause of enigmatic peritoneal masses BJR Case Rep 2016 2 20150252 30459968 10.1259/bjrcr.20150252 PMC6243359 20 Schuster MW Wheeler TL II Richter HE Endometriosis after laparoscopic supracervical hysterectomy with uterine morcellation: A case control study J Minim Invasive Gynecol 2012 19 2 183 87 22265051 10.1016/j.jmig.2011.09.014 PMC3292633 21 Kumar S Sharma JB Verma D Disseminated peritoneal leiomyomatosis: An unusual complication of laparoscopic myomectomy Arch Gynecol Obstet 2008 278 1 93 95 18193441 10.1007/s00404-007-0536-9 22 Lee M Morey G Lopez H Disseminated peritoneal leiomyomatosis mimicking carcinomatosis: A case report Int J Surg Case Rep 2024 120 109908 38878730 10.1016/j.ijscr.2024.109908 PMC11228581 23 U.S. Food and Drug Administration Laparoscopic uterine power morcellation in hysterectomy and myomectomy: FDA safety communication FDA Published Nov 24, 2014 Accessed Feb 2, 2025 https://www.fda.gov/MedicalDevices/Safety/AlertsandNotices/ucm393576.htm 24 U.S. Food and Drug Administration Update: Perform only contained morcellation when laparoscopic power morcellation is appropriate FDA Safety Communication Dec 29 2020 Accessed Feb 2, 2025 https://www.fda.gov/medical-devices/safety-communications/update-perform-only-contained-morcellation-when-laparoscopic-power-morcellation-appropriate-fda 25 Cohen SL Greenberg JA Wang KC Risk of leakage and tissue dissemination with various contained tissue extraction (CTE) techniques: An in vitro pilot study J Minim Invasive Gynecol 2014 21 6 935 42 24928740 10.1016/j.jmig.2014.06.004 Figure 1 Cervical stump visualized on transvaginal ultrasound. Figure 2 Largest leiomyoma adjacent to the urinary bladder seen on transvaginal ultrasound. Figure 3 Magnetic resonance imaging (T2-weighted sagittal view) showing a polycyclic mass with intermediate signal intensity above the urinary bladder. Figure 4 Magnetic resonance imaging (LAVA + coronal view) showing homogeneous contrast enhancement of the mass and a similar lesion near the sigmoid colon. LAVA, Liver Acquisition with Volume Acceleration. Figure 5 Magnetic resonance imaging (T2-weighted coronal view) of an oval lesion with intermediate signal adjacent to the sigmoid colon (approximately 23×19 mm). Figure 6 Magnetic resonance imaging showing a lesion with intermediate signal adjacent to the superior right aspect of the urinary bladder. Figure 7 Laparoscopic view of a lesion near the bladder dome. Figure 8 Subperitoneal lesion located on the surface of the sigmoid colon. Figure 9 Surface of the sigmoid colon after laparoscopic excision of the lesion. Figure 10 Microscopic images showing: A B C ",
  "metadata": {
    "Title of this paper": "Risk of leakage and tissue dissemination with various contained tissue extraction (CTE) techniques: An in vitro pilot study",
    "Journal it was published in:": "The American Journal of Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495898/"
  }
}