{
  "title": "Paper_1151",
  "abstract": "pmc J Int Med Res J Int Med Res 3252 jimr IMR The Journal of International Medical Research 0300-0605 1473-2300 SAGE Publications PMC12475732 PMC12475732.1 12475732 12475732 41006054 10.1177/03000605251381195 10.1177_03000605251381195 1 Observational Study Serum histamine in non–small cell lung cancer: An observational study in the context of allergo-oncology https://orcid.org/0009-0002-5992-0381 Rongrong Zhai Wenyue Shu Yanyun Hu Fengli Zhang Lei Sun Department of Clinical Laboratory, Lu’an Hospital of Anhui Medical University, China Lei Sun, Department of Clinical Laboratory, Lu’an Hospital of Anhui Medical University, Lu’an, Anhui 237005, China. Email: 2020120050@mail.sdu.edu.cn 9 2025 26 9 2025 53 9 496213 03000605251381195 8 5 2025 5 9 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 SAGE Publications https://creativecommons.org/licenses/by-nc/4.0/ Creative Commons Non Commercial CC BY-NC: This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Objectives The objective of this study was to assess serum histamine levels in patients with non–small cell lung cancer and investigate their association with tumor metastasis. Methods A retrospective study was conducted at Lu’an Hospital between 2020 and 2024, including 90 patients (70 with non–small cell lung cancer and 20 with benign pulmonary nodules) selected from an initial cohort of 416 patients after applying strict inclusion and exclusion criteria. Serum histamine levels were measured, and other clinical characteristics and laboratory parameters were obtained directly from the electronic medical record system. Receiver operating characteristic curves were used to evaluate the diagnostic performance. Non–small cell lung cancer patients were stratified by metastatic status for group comparisons and logistic regression analyses. Results Non–small cell lung cancer patients had significantly higher serum histamine levels than those with benign nodules (median: 8.58 vs. 5.97 µg/L, p = 0.024). A cutoff of 7 µg/L yielded a sensitivity of 65.7% and a specificity of 65.0% for distinguishing non–small cell lung cancer, with an area under the curve of 0.666. Among non–small cell lung cancer patients, those with metastasis ( n Conclusions Serum histamine levels were elevated in non–small cell lung cancer patients and were independently associated with tumor metastasis. These findings provide preliminary evidence of a possible connection between histamine and the emerging field of allergo-oncology. Complement C3 was also found to be independently associated with metastasis. Further studies are warranted to validate these results and explore the underlying immunological mechanisms. Non–small cell lung cancer histamine metastasis C3 the Science and Technology Program of Lu'an City 2023lakj005 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts2 Introduction Non–small cell lung cancer (NSCLC) is one of the leading causes of cancer-related death globally.  1 2 3 4 6 Histamine, a central mediator in allergic reactions, not only mediates classical inflammatory responses 7 8  9  10  11 The emerging field of allergo-oncology has recently drawn attention to the complex interplay between allergic responses and cancer biology. This interdisciplinary field explores how immune mediators, traditionally associated with hypersensitivity, may influence tumor development and immune surveillance.  12 Our previous study indicated that histamine can alter the function of monocyte-derived dendritic cells and promote the differentiation of regulatory T cells.  13 Despite previous insights into histamine’s role in immune regulation, its clinical relevance in pulmonary diseases—particularly in distinguishing benign from malignant lung lesions and in relation to metastatic progression in NSCLC—remains uncertain. In this retrospective study, we measured serum histamine levels in patients with benign pulmonary nodules and NSCLC, including comparisons between metastatic and nonmetastatic cases. These observations suggest a possible connection between histamine levels and NSCLC metastasis. The findings may be relevant to future investigations within the emerging framework of allergo-oncology. Materials and methods Study participants This was a retrospective observational study. The study was conducted in accordance with the STROBE (Strengthening the Reporting of Observational Studies in Epidemiology) guidelines.  14 The study protocol was approved by the Ethics Committee of Lu’an Hospital affiliated to Anhui Medical University (Approval No. 2023LLKS011, 10 April 2024). A waiver of informed consent was granted due to the retrospective nature of the study and anonymized data handling. All patient data were anonymized. The study was conducted in accordance with the Declaration of Helsinki (1975, revised 2024). Samples collection and analysis Venous blood samples (at least 6 mL) were collected from each patient upon admission, before conducting any treatments that could potentially affect the test indicators. Of the 6 mL, 2 mL was placed into an EDTA-2K anticoagulant tube for complete blood count (CBC), and the remaining 4 mL was collected in a plain tube without anticoagulant for serum separation. The serum was used to measure complement C3 and C4 levels. Histamine levels were measured using human histamine ELISA (enzyme-linked immunosorbent assay) kits (catalog number: HB028-Hu; Shanghai Hengyuan Biotechnology Co, Ltd, Shanghai, China). Serum samples were separated within 1 h of collection by centrifugation at 3000 rpm for 10 min and stored in aliquots at –80°C until analysis. To preserve sample integrity, each aliquot was thawed only once to avoid repeated freeze–thaw cycles. All samples were processed and handled according to the standardized protocols to ensure consistency and stability. According to the manufacturer’s specifications, the detection range of the assay was 0.5–18 µg/L, with a minimum detectable concentration (sensitivity) of 0.125 µg/L. Quality control materials provided with the kit were included in each run to ensure assay reliability. CBC parameters were analyzed using the Sysmex XN-2100™ automated hematology analyzer. This system uses hydrodynamic focusing for red blood cell and platelet assessment and semiconductor-based flow cytometry for analyzing other blood cells. Serum complement C3 and C4 levels were measured using the turbidimetric method on a Beckman Coulter AU-5831™ fully automated biochemical analyzer. Statistical analysis All statistical analyses were conducted using SPSS version 19.0. Continuous variables were expressed as median (Q1, Q3), and categorical variables as n Results Patient selection A total of 416 patients were initially identified from the hospital’s electronic medical record system. From this initial cohort, 93 were excluded due to a lack of pathological confirmation, 76 were excluded because they were first diagnosed outside our hospital or prior to sample collection, 107 were excluded for concurrent pulmonary or acute infections at admission, 24 for antibiotic use within 1 week before sampling, and 26 for coexisting or uncertain other primary tumors. No patients were excluded for recent drug allergy or antihistamine use. A total of 90 patients were included in the final analysis. The patient selection process is summarized in Figure 1 Figure 1. Flowchart of patient selection. Patient characteristics A total of 90 patients participated in the study, including 44 men and 46 women. Of these, 20 patients had benign pulmonary nodules (median age of 62.0 years; interquartile range (IQR): 55.00–68.75), while 70 patients were diagnosed with NSCLC (median age of 67.0 years; IQR: 54.75–73.25). There were no significant differences between the two groups in terms of age (p             Serum histamine levels were significantly higher in NSCLC patients than in those with benign pulmonary nodules (8.58 (5.92, 11.09) vs. 5.97 (4.61, 9.44) µg/L, p   Table 1 Table 1. Comparison of basic clinical features and serum histamine between the two groups. Characteristics Benign ( n NSCLC ( n χ 2 p-value Age, years, median (Q1, Q3) 62 (55.00, 68.75) 67 (54.75, 73.25) −1.122 0.262 Sex, n Male 10 (50.00) 34 (48.57) 0.013 0.910 Female 10 (50.00) 36 (51.43) Smoking status, n Never 13 (65.00) 44 (62.86) 0.031 0.861 Current/former 7 (35.00) 26 (37.14) Alcohol consumption, n Never 17 (85.00) 60 (85.71) 0.006 0.936 Current/former 3 (15.00) 10 (14.29) Comorbidities, n Hypertension 4 (20.00) 23 (32.86) 1.224 0.268 Diabetes 0 10 (14.29) — 0.109  a Histology, n Squamous cell cancer / 20 (28.57%) / / Adenocarcinoma / 50 (71.43%) / / Serum histamine, µg/L, median (Q1, Q3) 5.97 (4.61, 9.44) 8.58 (5.92, 11.09) −2.257 0.024 a p values calculated by Fisher’s exact test due to small expected cell counts. NSCLC: non–small cell lung cancer. Diagnostic performance of serum histamine in differentiating NSCLC from benign pulmonary nodules ROC analysis was performed to assess the diagnostic value of serum histamine in distinguishing NSCLC from benign pulmonary nodules. At the optimal cutoff value of 7 µg/L, determined using the Youden index, serum histamine demonstrated a sensitivity of 65.7%, a specificity of 65.0%, and an area under the curve of 0.666 ( Figure 2 Figure 2. ROC curve for serum histamine in differentiating benign and malignant pulmonary masses. ROC: receiver operating characteristic. Among the 70 NSCLC patients, 45 had serum histamine levels ≥7 µg/L (true positives), while 25 had levels below this cutoff (false negatives). Of the 20 patients with benign pulmonary nodules, 7 had histamine levels ≥7 µg/L (false positives) and 13 had levels <7 µg/L (true negatives). Based on these results, the positive predictive value was 86.5% and the negative predictive value was 34.2%. Serum histamine and its association with metastasis in NSCLC patients Based on metastatic status, the 70 patients with NSCLC were divided into two groups: metastatic ( n n Table 2 Table 2. Comparison of laboratory parameters in NSCLC patients with and without metastasis. Nonmetastatic ( n Metastatic ( n Z p-value Histamine, µg/L 7.18 (4.76, 10.59) 9.39 (8.18, 12.20) −3.184 0.001 C3, mg/L 1.11 (1.01, 1.20) 1.34 (1.12, 1.42) −3.519 <0.001 PLT, ×10 9 241 (196, 269) 228 (197, 276) −0.405 0.685 MPV, fL 11.3 (10.2, 12.1) 10.7 (9.6, 11.5) −1.887 0.059 PDW, % 14.5 (11.8, 16.0) 13.3 (11.7, 16.1) −0.723 0.470 NLR 1.73 (1.38, 2.26) 2.70 (1.90, 4.74) −3.189 0.001 MPV: mean platelet volume; NLR: neutrophil-to-lymphocyte ratio; NSCLC: non–small cell lung cancer; PDW: platelet distribution width; PLT: platelet count. Serum histamine levels were significantly higher in patients with metastatic NSCLC than in those without metastasis (median (IQR): 9.39 (8.18–12.20) vs. 7.18 (4.76–10.59) µg/L, p         Table 2 Logistic regression analysis of factors associated with metastasis in NSCLC patients To further evaluate the potential association between laboratory parameters and metastasis in NSCLC patients, a binary logistic regression analysis was performed, including serum histamine, complement C3 (multiplied by 10 for scaling), and NLR as independent variables. The results demonstrated that both histamine and C3 were independently associated with the presence of metastasis. Specifically, serum histamine was significantly associated with metastasis (p       Table 3 Table 3. Logistic regression analysis of factors associated with metastasis in NSCLC patients. Variable B SE p-value OR 95% CI for OR Lower Upper Histamine (µg/L) 0.193 0.093 0.038 1.213 1.011–1.455 C3 (×10 mg/L) 0.397 0.152 0.009 1.488 1.104–2.004 NLR 0.095 0.087 0.273 1.100 0.928–1.303 CI: confidence interval; NLR: neutrophil-to-lymphocyte ratio; NSCLC: non–small cell lung cancer; OR: odds ratio; SE: standard error. Discussion In this study, serum histamine concentrations were significantly elevated in NSCLC patients compared to those with benign nodules, demonstrating moderate diagnostic value. Moreover, histamine levels were higher in NSCLC patients with metastasis than in those without, and histamine was identified as an independent risk factor for metastasis in multivariate analysis. Histamine has been reported to play dual roles in tumor regulation, promoting or inhibiting tumor growth in various malignancies, including cervical cancer, ovarian cancer, colorectal cancer, and melanoma. 15 18 19 22  13 These findings align with growing evidence that histamine may influence the tumor microenvironment, with reported roles in vasodilation,  23  24  25 NLR,  26  27  28 Mechanistically, histamine is principally released by mast cells, which infiltrate lung cancer tissues,  11 29 31  32 Despite these observed associations, this study has certain limitations. The cross-sectional nature of our study precludes any causal inference; thus, it remains unclear whether histamine elevation actively contributes to NSCLC progression or merely reflects tumor-related biological processes. Second, although logistic regression was performed, the relatively modest sample size—constrained by strict inclusion and exclusion criteria as well as the limited availability of eligible patients within our institutional database—limited our ability to conduct robust multivariable analyses adjusting for potential confounders such as age, comorbidities, and tumor burden. Third, non–drug allergic histories were not collected because the electronic medical record system only recorded drug allergies, limiting the assessment of patients’ overall allergic background. Future research should consider longitudinal designs to track histamine dynamics over time and assess their prognostic relevance. Investigating the expression of histamine receptors and associated signaling molecules in tumor and immune cells may further clarify the biological role of histamine in NSCLC. Larger, multicenter studies are warranted to validate these preliminary findings and determine the clinical relevance of serum histamine in lung cancer. In conclusion, this study demonstrates that serum histamine is elevated in NSCLC, particularly in metastatic cases, suggesting a potential role in tumor progression. These preliminary findings underscore the need for further research to explore the diagnostic and immunological relevance of histamine in lung cancer. Acknowledgements The authors thank all participants and staff involved in this study. We also acknowledge the assistance of AI language tools for language editing purposes. Author contributions: The authors declare that there is no conflict of interest regarding the publication of this paper. Funding: ORCID iD: https://orcid.org/0009-0002-5992-0381 Data availability statement The datasets generated and analyzed during the current study are available from the corresponding author on reasonable request. References 1 Herbst RS Morgensztern D Boshoff C. The biology and management of non-small cell lung cancer Nature 2018 553 446 454 29364287 10.1038/nature25183 2 Patel P Flores R Alpert N et al Effect of stage shift and immunotherapy treatment on lung cancer survival outcomes Eur J Cardiothorac Surg 2023 64 ezad203 37285318 10.1093/ejcts/ezad203 PMC10412408 3 Chen P Liu Y Wen Y et al Non-small cell lung cancer in China Cancer Commun (Lond) 2022 42 937 970 36075878 10.1002/cac2.12359 PMC9558689 4 Nishikawa H Koyama S. Mechanisms of regulatory T cell infiltration in tumors: implications for innovative immune precision therapies J Immunother Cancer 2021 9 e002591 34330764 10.1136/jitc-2021-002591 PMC8327843 5 Xiang C Zhang M Shang Z et al Single-cell profiling reveals the trajectory of FOLR2-expressing tumor-associated macrophages to regulatory T cells in the progression of lung adenocarcinoma Cell Death Dis 2023 14 493 37532692 10.1038/s41419-023-06021-6 PMC10397223 6 Kinoshita T Kudo-Saito C Muramatsu R et al Determination of poor prognostic immune features of tumour microenvironment in non-smoking patients with lung adenocarcinoma Eur J Cancer 2017 86 15 27 28950145 10.1016/j.ejca.2017.08.026 7 O’Mahony L Akdis M Akdis CA. Regulation of the immune response and inflammation by histamine and histamine receptors J Allergy Clin Immunol 2011 128 1153 1162 21824648 10.1016/j.jaci.2011.06.051 8 Tiligada E Stefanaki C Ennis M et al Opportunities and challenges in the therapeutic exploitation of histamine and histamine receptor pharmacology in inflammation-driven disorders Pharmacol Ther 2024 263 108722 39306197 10.1016/j.pharmthera.2024.108722 9 Frei R Ferstl R Konieczna P et al Histamine receptor 2 modifies dendritic cell responses to microbial ligands J Allergy Clin Immunol 2013 132 194 204 23465664 10.1016/j.jaci.2013.01.013 10 Jutel M Watanabe T Klunker S et al Histamine regulates T-cell and antibody responses by differential expression of H1 and H2 receptors Nature 2001 413 420 425 11574888 10.1038/35096564 11 Stankovic B Bjørhovde HAK Skarshaug R et al Immune cell composition in human non-small cell lung cancer Front Immunol 2018 9 3101 30774636 10.3389/fimmu.2018.03101 PMC6367276 12 Karagiannis SN Josephs DH Bax HJ et al Therapeutic IgE antibodies: harnessing a macrophage-mediated immune surveillance mechanism against cancer Cancer Res 2017 77 2779 2783 28526770 10.1158/0008-5472.CAN-17-0428 13 Zhai RR Jiang AP Wang HB et al Histamine enhances HIV-1-induced modulation of dendritic cells to skew naïve T cell differentiation toward regulatory T cells Virology 2013 442 163 172 23652320 10.1016/j.virol.2013.04.009 14 Von Elm E Altman DG Egger M STROBE Initiative et al The Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) statement: guidelines for reporting observational studies Ann Intern Med 2007 147 573 577 17938396 10.7326/0003-4819-147-8-200710160-00010 15 Li H Xiao Y Li Q et al The allergy mediator histamine confers resistance to immunotherapy in cancer patients via activation of the macrophage histamine receptor H1 Cancer Cell 2022 40 36 52.e9 34822775 10.1016/j.ccell.2021.11.002 PMC8779329 16 Zhang E Zhang Y Fan Z et al Apigenin inhibits histamine-induced cervical cancer tumor growth by regulating estrogen receptor expression Molecules 2020 25 1960 32340124 10.3390/molecules25081960 PMC7221565 17 Liu M Zhang Y Xu Q et al Apigenin inhibits the histamine-induced proliferation of ovarian cancer cells by downregulating ERα/ERβ expression Front Oncol 2021 11 682917 34568014 10.3389/fonc.2021.682917 PMC8456091 18 Pós Z Sáfrány G Müller K et al Phenotypic profiling of engineered mouse melanomas with manipulated histamine production identifies histamine H2 receptor and rho-C as histamine-regulated melanoma progression markers Cancer Res 2005 65 4458 4466 15899839 10.1158/0008-5472.CAN-05-0011 19 Jafarzadeh A Nemati M Khorramdelazad H et al Immunomodulatory properties of cimetidine: its therapeutic potentials for treatment of immune-related diseases Int Immunopharmacol 2019 70 156 166 30802678 10.1016/j.intimp.2019.02.026 20 Kimura S Noguchi H Yoshida K et al Relationship of histamine expression with chemokine balance in the tumor microenvironment of squamous cell carcinoma of the tongue Head Neck 2022 44 1554 1562 35411649 10.1002/hed.27056 21 Azimi H Jafari A Maralani M et al The role of histamine and its receptors in breast cancer: from pathology to therapeutic targets Med Oncol 2024 41 190 38951252 10.1007/s12032-024-02437-y 22 Medina VA Rivera ES. Histamine receptors and cancer pharmacology Br J Pharmacol 2010 161 755 767 20636392 10.1111/j.1476-5381.2010.00961.x PMC2992892 23 Faustino-Rocha AI Ferreira R Gama A et al Antihistamines as promising drugs in cancer therapy Life Sci 2017 172 27 41 27986539 10.1016/j.lfs.2016.12.008 24 Nicoud MB Sterle HA Massari NA et al Study of the antitumour effects and the modulation of immune response by histamine in breast cancer Br J Cancer 2020 122 348 360 31748740 10.1038/s41416-019-0636-x PMC7000401 25 Chen J Hu XY. Inhibition of histamine receptor H3R suppresses prostate cancer growth, invasion and increases apoptosis via the AR pathway Oncol Lett 2018 16 4921 4928 30250558 10.3892/ol.2018.9310 PMC6144779 26 Cui H Yang Y Feng M et al Preoperative neutrophil-to-lymphocyte ratio (preNLR) for the assessment of tumor characteristics in lung adenocarcinoma patients with brain metastasis Transl Oncol 2022 22 101455 35598384 10.1016/j.tranon.2022.101455 PMC9126952 27 Kleczko EK Kwak JW Schenk EL et al Targeting the complement pathway as a therapeutic strategy in lung cancer Front Immunol 2019 10 954 31134065 10.3389/fimmu.2019.00954 PMC6522855 28 Christakoudi S Tsilidis KK Evangelou E et al Interactions of platelets with obesity in relation to lung cancer risk in the UK Biobank cohort Respir Res 2023 24 249 37848891 10.1186/s12931-023-02561-9 PMC10580651 29 Prodeus AP Zhou X Maurer M et al Impaired mast cell-dependent natural immunity in complement C3-deficient mice Nature 1997 390 172 175 9367154 10.1038/36586 30 Laumonnier Y Korkmaz RÜ Nowacka AA et al Complement-mediated immune mechanisms in allergy Eur J Immunol 2023 53 e2249979 37381711 10.1002/eji.202249979 31 Ali H. Regulation of human mast cell and basophil function by anaphylatoxins C3a and C5a Immunol Lett 2010 128 36 45 19895849 10.1016/j.imlet.2009.10.007 PMC2815128 32 Elieh Ali Komi D Shafaghat F Kovanen PT et al Mast cells and complement system: ancient interactions between components of innate immunity Allergy 2020 75 2818 2828 32446274 10.1111/all.14413 ",
  "metadata": {
    "Title of this paper": "Mast cells and complement system: ancient interactions between components of innate immunity",
    "Journal it was published in:": "The Journal of International Medical Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475732/"
  }
}