{
  "title": "Paper_323",
  "abstract": "pmc BMC Pregnancy Childbirth BMC Pregnancy Childbirth 61 bmcpcnc BMC Pregnancy and Childbirth 1471-2393 BMC PMC12486540 PMC12486540.1 12486540 12486540 41029571 10.1186/s12884-025-08133-7 8133 1 Research The association of early pregnancy, particularly persistent isolated maternal hypothyroxinemia, with adverse obstetric and perinatal outcomes Song Mengfan 1 2 Xiong Mingtao 1 2 http://orcid.org/0009-0007-6373-2152 Meng Yu 730001200@shsmu.edu.cn 1 2 1 https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 International Peace Maternity and Child Health Hospital, School of Medicine, Shanghai Jiao Tong University, 2 https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 Shanghai Key Laboratory of Embryo Original Diseases, 30 9 2025 2025 25 478341 966 19 3 2025 27 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Objective We aimed to assess the association of early pregnancy isolated maternal hypothyroxinemia (IMH), including persistent IMH, with adverse obstetric and perinatal outcomes. Methods This study was a large-scale retrospective cohort study based at a tertiary hospital in Shanghai, China between January 2013 and December 2016. Independent t-tests, chi-square tests, and stratified univariate and multivariate logistic regression analyses were performed to examine the associations between IMH and adverse pregnancy outcomes. Trend chi-square tests were used to evaluate the differences in the incidence of adverse pregnancy outcomes among the euthyroid, transient IMH, and persistent IMH groups. Results A total of 37,734 women with singleton pregnancies were classified into the euthyroid group ( n n Conclusion Early pregnancy IMH is associated with increased risks of several adverse pregnancy outcomes, and stratified analyses suggest that these risks may vary by maternal age and pre-pregnancy BMI. Both transient and persistent IMH were associated with an increased risk of adverse pregnancy outcomes, with persistent IMH related to a broader spectrum of adverse events. Keywords Thyroid dysfunction Isolated maternal hypothyroxinemia Maternal outcome Neonatal outcome Preeclampsia pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Thyroid hormones play a pivotal role in maintaining normal pregnancy and ensuring optimal fetal neurodevelopment [ 1 2 3 4 5 3 3 6 7 8 9 10 11 The clinical significance of IMH remains debated. While some studies associate it with adverse neurodevelopmental outcomes [ 12 15 16 17 18 19 20 24 Methods Subjects This is a retrospective cohort study conducted at a tertiary specialized hospital in Shanghai. We retrospectively extracted medical records from the hospital’s electronic medical record system for 52,027 women with singleton pregnancies who had completed both prenatal care and delivery at our hospital between January 2013 and December 2016. After applying inclusion and exclusion criteria, 37,734 eligible participants were included in the final analysis. The study was approved by the hospital’s ethics committee. Since this was a secondary analysis of de-identified data collected for routine clinical care, informed consent was waived by the ethics committee. The study was conducted in accordance with approved institutional and ethical guidelines. The exclusion criteria were as follows: (1) pregnant women who were receiving or had a history of thyroid hormone or antithyroid drug treatment; (2) multiple pregnancy or underwent in vitro fertilization; (3) use of medications or presence of chronic diseases that may affect thyroid function (e.g., cancer, hypertension, heart disease, diabetes, autoimmune diseases); (4) absence of thyroid function test results in early pregnancy or incomplete medical records; and (5) those who did not deliver at our hospital. Data collection Fasting blood samples were collected from the median cubital vein during early pregnancy (11–13 weeks) and late pregnancy (32–34 weeks). Serum was separated by centrifugation within 6 h of collection. TSH, FT4, and TPOAb concentrations were measured using the Architect i2000 immunoassay (Abbott, Chicago, USA) according to the manufacturer’s protocol. TPOAb ≥ 5.61 IU/ml was considered positive. Pre-pregnancy information, including maternal age, gravidity, parity, education level, smoking status, and alcohol consumption, was collected through structured interviews at the first clinical visit. Height and weight were also measured to calculate body mass index (BMI). Based on the above electronic medical record system, we conducted a study to assess the risk of IMH and a range of pregnancy complications and neonatal outcomes. Including maternal pregnancy outcomes (GDM, preeclampsia, gestational hypertension, emergency cesarean section, preterm birth, placenta previa, and postpartum hemorrhage), and neonatal outcomes (low Apgar score, fetal distress, premature delivery, low birth weight, macrosomia, and fetal growth and development indicators). Definition of IMH IMH is defined as the presence of a low maternal free thyroxine (fT4) level in conjunction with a normal maternal thyroid-stimulating hormone (TSH) level. In our study, we specifically defined IMH as an FT4 concentration below the 5th percentile and a TSH concentration within the 2.5th to 97.5th percentiles, based on institution-specific, gestational age-adjusted reference ranges. These percentiles were derived from a large reference population of pregnant women who delivered at our hospital. IMH was defined and assessed at two gestational time points: early pregnancy (11–13 weeks) and late pregnancy (32–34 weeks), using corresponding gestational age-specific thresholds. Ultrasound-based fetal biometric measurements Fetal biometric parameters, including biparietal diameter (BPD), femur length (FL), and abdominal measurements such as transverse abdominal diameter (TAD), anterior-posterior abdominal diameter (APAD), and abdominal circumference (AC) were measured using standardized ultrasound protocols within one week before delivery to ensure accuracy, with all scans performed by certified sonographers using calibrated equipment following strict measurement protocols: BPD was obtained at the thalamic level including the cavum septum pellucidum, FL was measured along the long axis from the greater trochanter to distal condyle, and AC was taken at the umbilical vein level incorporating the stomach bubble and portal sinus. Each measurement was performed three times, with a second expert review if the variation exceeded 5%. Standardized equipment settings, proper fetal positioning, and identification of anatomical landmarks during fetal rest were applied to reduce measurement errors and variability. Definitions of adverse pregnancy outcomes The following definitions of adverse pregnancy outcomes, based on medical guidelines and the reported literature, were used in this study: (1) Gestational age was based on the interval between the last menstrual period and the date of delivery of the baby. When the menstrual estimate of gestational age was inconsistent by 7 or more days within the ultrasound measurement, we used the ultrasound corrected gestational age; (2) Low birth weight (LBW): the newborn birthweight < 2,500 g; (3) Macrosomia: the newborn birthweight ≥ 4,000 g; (4) Preterm birth was defined as births with gestational age less than 37 weeks; (5) GDM was diagnosed by the 75 g oral glucose tolerance test at 24–28 weeks of gestation. Women with a fasting blood glucose level ≥ 5.1 mmol/L, a 1-h blood glucose level ≥ 10.0 mmol/L or a 2-h blood glucose level ≥ 8.5 mmol/L were defined as GDM; (6)Postpartum Hemorrhage was defined as blood loss of more than 500 mL following vaginal delivery or more than 1,000 mL following cesarean delivery; (7) Gestational hypertension was defined as new-onset systolic blood pressure ≥ 140 mmHg or diastolic blood pressure ≥ 90 mmHg on at least two occasions, at least 4 h apart, after 20 weeks of gestation in previously normotensive women, without proteinuria or other signs of preeclampsia, and typically resolving within 12 weeks postpartum [ 25 25 26 Statistical analysis Data were analyzed with SPSS version 21.0 (IBM Corp., Armonk, NY) and R software version 3.6.1 (R Development Core Team, July 2019; http://www.r-project.org P Missing data handling When the missing rate of a variable was below 5%, and missing values were distributed relatively evenly across the sample without obvious systematic bias, Listwise deletion was applied for complete case analysis. For variables with missing rates exceeding 5%, Little’s MCAR test was conducted to assess whether the missing data were missing completely at random (MCAR). If the test indicated data were MCAR, listwise deletion was continued; if not, domain knowledge was used to classify the missing data mechanism as missing at random (MAR) or missing not at random (MNAR). Multiple imputation was applied for MAR to estimate missing values, thereby reducing bias and enhancing the robustness and validity of the analysis. For MNAR data, reasonable interpretations were made based on the specific medical context of this study, and more advanced missing data methods, such as sensitivity analyses using pattern-mixture models, would be applied when necessary. Results Handling of missing data A total of 37,734 pregnant women were included in this study. Among them, 2,001 cases were diagnosed as IMH of early pregnancy, and 35,733 cases were euthyroid. Figure 1  Fig. 1 Flowchart of participants in the study In this study, 935 participants were missing thyroid function test results in early pregnancy (11–13 weeks), and an additional 156 participants lacked key covariate information. Overall, 1,091 cases (2.2% of the study population) had incomplete data. Previous methodological literature suggests that when the proportion of missing data is very low (commonly below 5%), the bias introduced is likely negligible, and complete-case analysis (CCA) is generally acceptable [ 27 p Population characteristics Table 1 P P  Table 1 Basic characteristics of pregnant women by first-trimester IMH status Basic characteristic Euthyroid n IMH n P Maternal age (y) 30 (27–32) 31 (29–34) < 0.001* Pre-pregnancy BMI (kg/m 2 20.6 (19.1–22.3) 21.8 (20.0-23.7) < 0.001* Newborn sex, n (%) male 18,669 (52.2%) 1,044 (52.2%) 0.963 female 17,064 (47.8%) 957 (47.8%) Gravidity, n (%) < 3 35,380 (99.0%) 1,920 (96.0%) < 0.001* ≥ 3 353 (1.0%) 81 (4.0%) Parity, n (%) Primipara 29,340 (82.1%) 1,369 (68.4%) < 0.001* Multipara 6,393 (17.9%) 632 (31.6%) Educational levels, n (%) High school and lower 8,188 (22.9%) 396 (19.8%) < 0.001* Bachelor 21,047 (58.9%) 1,215 (60.7%) Master 5,990 (16.8%) 344 (17.2%) Doctorate and higher 508 (1.4%) 46 (2.3%) Smoke, n (%) No 35,706 (99.9%) 2,001 (100.0%) 0.400 Yes 27 (0.1%) 0 (0.0%) Alcohol, n (%) No 35,732 (100%) 2,001 (100.0%) 0.999 Yes 1 (0.0%) 0 (0.0%) Non-normally distributed variables are presented as median (interquartile range) and compared using non-parametric tests Abbreviations BMI IMH * P Diagnostic criteria for IMH In this study, normal reference ranges of TSH and FT4 in women were defined as the 2.5th and 97.5th percentiles. The normal cut-off values in the first trimester (11–13 weeks) were: TSH (0.03–3.65) mIU/L; FT4 (11.70–19.60) pmol/L. The 5th population percentile for FT4 is 12.20 pmol/L. The normal cut-off values in the third trimester (32–34 weeks) were: TSH (0.39–3.67) mIU/L; FT4 (9.10–14.40) pmol/L. The 5th population percentile for FT4 is 9.50 pmol/L. Using these percentile-based cut-offs, IMH was defined as an FT4 concentration below the 5th percentile with a TSH concentration between the 2.5th and 97.5th percentiles. Individuals with both FT4 and TSH concentrations within the 2.5th to 97.5th percentiles were classified as euthyroid. According to whether IMH lasted into the third trimester, they were divided into the euthyroid group (normal in both the first and third trimester) with a total of 31,349 cases, the transient IMH group (IMH in early pregnancy but normal in late pregnancy) with 1,347 cases, and the persistent IMH group (IMH lasted from early to late pregnancy) with 510 cases. Comparison of pregnancy outcomes Table 2 P P P P P P P  Table 2 Comparison of maternal and neonatal outcomes based on first-trimester IMH status Outcome Euthyroid n IMH n P Maternal outcomes GDM, n (%) 3,653 (10.2%) 359 (17.9%) < 0.001 * OGTT (mmol/L) 0 h 4.1 (3.9–4.4) 4.2 (3.9–4.5) < 0.001 * 1 h 7.7 (7.1–8.5) 7.9 (7.4–9.1) < 0.001 * 2 h 6.2 (5.4–7.1) 6.5 (5.6–7.5) < 0.001 * Gestational hypertension, n (%) 1,016 (2.8%) 63 (3.1%) 0.411 Preeclampsia, n (%) 710 (2.0%) 72 (3.6%) < 0.001 * Delivery outcomes Placenta previa, n (%) 203 (0.6%) 5 (0.2%) 0.062 Emergency CS, n (%) 2,157 (6.0%) 159 (7.9%) 0.001 * Postpartum hemorrhage, n (%) 314 (0.9%) 24 (1.2%) 0.138 Neonatal outcomes Premature delivery, n (%) 1,684 (4.7%) 128 (6.4%) < 0.001* Fetal distress, n (%) 1,555 (4.3%) 176 (8.7%) < 0.001* Low Apgar score, n (%) 316 (0.9%) 29 (1.4%) 0.013* LBW, n (%) 963 (2.6%) 72 (3.5%) 0.022* Macrosomia, n (%) 2,174 (5.9%) 208 (10.4%) < 0.001* Fetal development (mm) Biparietal diameter (BPD) 91.8 ± 4.1 91.8 ± 4.4 0.464 Head Circumference (HC) 306.9 ± 38.8 311.7 ± 21.5 < 0.001* Femur Length (FL) 67.0 (64.0–69.0) 68.0 (64.0–70.0) 0.009* Humerus Length (HL) 59.0 (56.0–61.0) 59.0 (56.0–61.0) < 0.001* Transverse Abdominal Diameter (TAD) 98.0 (92.0-103.0) 99.0 (93.0-104.0) 0.002* Continuous variables with normal distribution are expressed as mean±SD and compared using the independent samples t-test. Non-normally distributed variables are presented as median (interquartile range) and compared using the Mann-Whitney U test Abbreviations GDM LBW CS IMH * P Association of IMH in the first trimester with adverse pregnancy outcomes To comprehensively evaluate the association between first-trimester IMH and adverse pregnancy outcomes, we performed stratified analyses based on maternal age and pre-pregnancy BMI (Table 3 Table 3 Association of adverse pregnancy outcomes with first-trimester IMH, stratified by maternal age and pre-pregnancy BMI Outcome Stratification Incidence (%) Crude a Adjusted b P for Interaction c IMH group ( n Euthyroid n OR (95% CI) P OR (95% CI) P Preterm birth Age < 35 (y) 5.4 4.5 1.21 (0.97 ~ 1.52) 0.095 1.11 (0.87 ~ 1.43) 0.399 0.073 ≥ 35 (y) 9.7 6.3 1.61 (1.15 ~ 2.25) 0.006 * 1.67 (1.16 ~ 2.40) 0.006 * BMI < 24 (kg/m 2 6.0 4.6 1.29 (1.02 ~ 1.63) 0.030 * 1.23 (0.97 ~ 1.55) 0.084 0.725 ≥ 24 (kg/m 2 7.9 5.8 1.37 (0.92 ~ 2.05) 0.121 1.30 (0.87 ~ 1.96) 0.201 GDM Age < 35 (y) 16.5 9.2 1.94 (1.69 ~ 2.23) < 0.001 * 1.42 (1.21 ~ 1.66) < 0.001 * 0.146 ≥ 35 (y) 22.9 18.1 1.34 (1.06 ~ 1.70) 0.013 * 1.14 (0.88 ~ 1.48) 0.331 BMI < 24 (kg/m 2 15.4 9.0 1.66 (1.42 ~ 1.94) < 0.001 * 1.40 (1.19 ~ 1.64) < 0.001 * 0.260 ≥ 24 (kg/m 2 27.0 20.1 1.29 (1.01 ~ 1.65) 0.043 1.20 (0.93 ~ 1.54) 0.162 Preeclampsia Age < 35 (y) 3.2 1.9 1.66 (1.24 ~ 2.24) < 0.001 * 1.37 (0.99 ~ 1.90) 0.055 0.264 ≥ 35 (y) 5.1 2.5 2.12 (1.33 ~ 3.38) 0.002 * 1.92 (1.15 ~ 3.20) 0.013 * BMI < 24 (kg/m 2 2.7 1.7 1.54 (1.09 ~ 2.17) 0.014 * 1.36 (0.96 ~ 1.93) 0.084 0.617 ≥ 24 (kg/m 2 6.8 4.2 1.62 (1.05 ~ 2.49) 0.030 * 1.72 (1.11 ~ 2.67) 0.016 * Emergency CS Age < 35 (y) 8.1 6.2 1.34 (1.11 ~ 1.62) 0.002 * 1.02 (0.83 ~ 1.24) 0.873 0.165 ≥ 35 (y) 7.3 4.7 1.58 (1.08 ~ 2.32) 0.020 * 1.40 (0.94 ~ 2.09) 0.095 BMI < 24 (kg/m 2 8.1 6.0 1.13 (0.93 ~ 1.37) 0.234 1.11 (0.91 ~ 1.35) 0.315 0.432 ≥ 24 (kg/m 2 7.3 6.4 0.90 (0.60 ~ 1.35) 0.609 0.94 (0.62 ~ 1.41) 0.747 Fetal distress Age < 35 (y) 8.8 4.4 2.11 (1.75 ~ 2.53) < 0.001 * 1.49 (1.23 ~ 1.81) < 0.001 * 0.590 ≥ 35 (y) 8.8 4.2 2.23 (1.56 ~ 3.20) < 0.001 * 1.81 (1.25 ~ 2.64) 0.002 * BMI < 24 (kg/m 2 8.3 4.2 1.62 (1.34 ~ 1.97) < 0.001 * 1.51 (1.24 ~ 1.84) < 0.001 * 0.933 ≥ 24 (kg/m 2 10.4 5.5 1.54 (1.09 ~ 2.17) 0.013 * 1.62 (1.15 ~ 2.30) 0.006 * LBW Age < 35 (y) 3.0 2.5 1.18 (0.87 ~ 1.59) 0.291 1.11 (0.79 ~ 1.55) 0.545 0.081 ≥ 35 (y) 4.6 2.9 1.60 (1.00 ~ 2.58) 0.051 1.91 (1.16 ~ 3.15) 0.011 * BMI < 24 (kg/m 2 3.0 2.6 1.15 (0.83 ~ 1.58) 0.403 1.20 (0.87 ~ 1.66) 0.266 0.291 ≥ 24 (kg/m 2 4.5 2.8 1.59 (0.94 ~ 2.68) 0.084 1.55 (0.91 ~ 2.64) 0.105 Macrosomia Age < 35 (y) 10.0 5.9 1.79 (1.51 ~ 2.13) < 0.001 * 1.52 (1.26 ~ 1.84) < 0.001 * 0.883 ≥ 35 (y) 10.6 6.4 1.74 (1.25 ~ 2.40) < 0.001 * 1.53 (1.06 ~ 2.20) 0.023 * BMI < 24 (kg/m 2 8.4 5.2 1.73 (1.42 ~ 2.12) < 0.001 * 1.46 (1.19 ~ 1.80) < 0.001 * 0.872 ≥ 24 (kg/m 2 16.3 11.5 1.56 (1.16 ~ 2.09) 0.003 * 1.52 (1.13 ~ 2.05) 0.006 * Abbreviations GDM IMH CS LBW OR CI * P a b c To focus on the most clinically relevant findings, Fig. 2 Fig. 2 Forest plot of multivariate logistic regression analysis for the association between IMH in the first trimester and adverse pregnancy outcomes. Forest plot showing stratified associations between first-trimester IMH and adverse pregnancy outcomes. Colored points represent adjusted ORs for each outcome stratified by maternal age and pre-pregnancy BMI categories. Vertical Lines extending from the points indicate the 95% CIs. The dashed vertical reference line at OR = 1 indicates no association. Only statistically significant associations are displayed. Different colors correspond to different pregnancy outcomes as indicated in the legend, facilitating comparison across outcomes and subgroups. Adjustment variables included maternal age, pre-pregnancy BMI, parity, gravidity, and education level. Abbreviations: IMH, isolated maternal hypothyroxinemia; GDM, gestational diabetes mellitus; CS, cesarean section; LBW, low birth weight; aOR, adjusted odds ratio; CI, confidence interval Specifically, in the Subgroup of women younger than 35 years, IMH was significantly associated with an increased risk of gestational diabetes mellitus (GDM) (adjusted OR = 1.42, P P P P P P P P P P P P P P Association of persistent IMH with adverse pregnancy outcomes As shown in Table 4 Table 4 Comparison of pregnancy outcomes among euthyroid, transient IMH, and persistent IMH groups using trend Chi-square test and multivariate logistic regression Outcome Incidence (%) P a Transient vs. Euthyroid Persistent vs. Transient Persistent vs. Euthyroid Euthyroid N Transient IMH N Persistent IMH N OR (95% CI) p b OR (95% CI) p c OR (95% CI) p b GDM 9.9 18.3 16.3 < 0.001 * 1.41 (1.20–1.66) < 0.001 * 0.86 (0.64–1.16) 0.325 1.24 (0.96–1.60) 0.093 Preeclampsia 1.8 2.4 5.7 < 0.001 * 1.11 (0.75–1.65) 0.603 2.33 (1.34–4.05) 0.003 * 2.52 (1.67–3.80) < 0.001 * Preterm birth 4.0 4.8 6.7 0.001 * 1.09 (0.82–1.45) 0.541 1.46 (0.93–2.30) 0.102 1.54 (1.07–2.23) 0.021 * Macrosomia 5.9 9.9 11.6 < 0.001 * 1.52 (1.24–1.87) < 0.001 * 1.15 (0.82–1.62) 0.418 1.77 (1.33–2.37) < 0.001 * Emergency CS 6.1 7.4 10.2 < 0.001 * 1.02 (0.82–1.28) 0.865 1.26 (0.87–1.82) 0.227 1.29 (0.95–1.75) 0.103 Fetal distress 4.3 7.9 10.4 < 0.001 * 1.42 (1.15–1.76) 0.001 * 1.20 (0.84–1.71) 0.320 1.72 (1.28–2.32) < 0.001 * LBW 1.9 1.8 3.1 0.167 0.91 (0.58–1.44) 0.686 1.91 (0.96–3.39) 0.064 1.63 (0.96–2.76) 0.071 Abbreviations GDM IMH CS LBW OR CI a P b P c p * P Discussion Main findings This study demonstrated that IMH in the first trimester is significantly associated with increased risks of adverse maternal and neonatal outcomes compared to euthyroid pregnancies. The study population was stratified by maternal age and pre-pregnancy BMI, and univariate and multivariate logistic regression analyses were performed within these strata to evaluate the association between IMH and adverse pregnancy outcomes. After adjusting for confounders, fetal distress and macrosomia remained significantly associated with IMH across all subgroups, whereas other adverse outcomes reached significance only within specific age or BMI strata. Notably, no significant interaction effects were observed between maternal age or pre-pregnancy BMI and IMH, indicating a limited moderating influence of these factors. This suggests that the impact of IMH on adverse pregnancy outcomes is largely independent. Furthermore, both transient and persistent IMH were associated with an increased risk of adverse pregnancy outcomes, with persistent IMH generally related to a broader spectrum of adverse events, particularly a higher incidence of preeclampsia compared with transient IMH. Etiology of IMH Understanding the causes of IMH is essential for optimizing treatment. Iodine deficiency remains the most common cause, as the thyroid shifts from T4 to T3 production to conserve iodine, thereby reducing circulating T4 levels [ 3 28 29 30 31 32 34 Thresholds for IMH diagnosis Accurate assessment of thyroid function during pregnancy requires trimester-specific reference ranges, as serum TSH and FT4 levels vary across different institutions and gestational stages due to physiological and methodological differences [ 35 36 37 37 38 39 40 41 42 Association of IMH in the first trimester with adverse pregnancy outcomes This study places greater emphasis on IMH in early pregnancy because this period is critical for the development of the fetal central nervous system and the formation of the placenta. During this stage, the fetus depends almost entirely on maternal thyroid hormones. If maternal thyroid dysfunction occurs at this time, it may have lasting and profound effects on fetal growth and development. Therefore, from the perspective of prevention and early risk identification, IMH in early pregnancy holds greater value for both research and clinical intervention. Accumulating evidence suggests that IMH may contribute to adverse pregnancy outcomes such as macrosomia and gestational diabetes mellitus (GDM). A Chinese cohort study reported a 1.22-fold higher risk of macrosomia in women with hypothyroxinemia [ 43 12 44 45 24 46 47 48 43 49 47 50 51 52 Fetal distress and low Apgar scores are recognized contributors to long-term neurological sequelae, including cerebral palsy and autism spectrum disorders [ 53 43 54 55 The consistent associations between IMH and adverse outcomes, particularly fetal distress and macrosomia, across all subgroups suggest a potential mechanistic pathway independent of maternal age or pre-pregnancy BMI. These observations support the role of IMH as an independent risk factor for poor perinatal outcomes. Clinically, this highlights the importance of incorporating thyroid function testing into routine antenatal risk assessment. Tailored monitoring and timely intervention strategies may facilitate early identification of at-risk pregnancies and contribute to improved maternal and neonatal outcomes. Impact of persistent IMH In this study, IMH was categorized as persistent if present in both early and late pregnancy, transient if confined to early pregnancy, and euthyroid if thyroid function remained normal throughout gestation. Prior studies have shown that only 8.4–24.8% of early pregnancy thyroid abnormalities persist into late gestation [ 56 1 57 Strengths and limitations Our study has several strengths. First, we used institution-specific, trimester-adjusted reference ranges for TSH and FT4, avoiding the pitfalls of generalized thresholds. Second, given concerns about the potential adverse effects of early pregnancy IMH [ 58 Limitations must also be acknowledged. First, although Shanghai is generally not classified as iodine-deficient due to longstanding universal salt iodization policies [ 59 60 Conclusion IMH diagnosed in the first trimester is an independent risk factor for various adverse pregnancy outcomes, with persistent IMH associated with particularly elevated risks. These findings underscore the importance of routine thyroid function screening in early pregnancy to facilitate the timely identification of IMH and enable more precise risk stratification for individualized prenatal care. Although current guidelines do not recommend routine follow-up or treatment for early IMH, our results suggest that selective monitoring of affected women may be warranted. Prospective interventional studies are needed to determine whether closer surveillance or management of early and persistent IMH can improve maternal and neonatal outcomes. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Mengfan Song and Mingtao Xiong contributed equally to this work. Acknowledgements The authors express sincere thanks to all the participants and the staff of the International Peace Maternity and Child Health Hospital for their contributions. Authors’ contributions All the authors contributed to the work. This study was designed by YM. MX performed the statistical analysis, and MS wrote the manuscript. YM reviewed and edited the manuscript. All authors read and approved the final version of this manuscript. Funding Not applicable. Data availability The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Declarations Ethics approval and consent to participate The study was approved by the Ethics Committee of the International Peace Maternity and Child Health Hospital, School of Medicine, Shanghai Jiaotong University (No. GKLW2019-16). Since this was a secondary analysis of de-identified data collected for routine clinical care, informed consent was waived by the ethics committee. The data analysis procedures followed the guidelines in the Declaration of Helsinki. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Korevaar TIM Medici M Visser TJ Peeters RP Thyroid disease in pregnancy: new insights in diagnosis and clinical management Nat Rev Endocrinol 2017 13 10 610 22 10.1038/nrendo.2017.93 28776582 Korevaar TIM, Medici M, Visser TJ, Peeters RP. Thyroid disease in pregnancy: new insights in diagnosis and clinical management. Nat Rev Endocrinol. 2017;13(10):610–22. 10.1038/nrendo.2017.93. 28776582 10.1038/nrendo.2017.93 2. Krassas GE Poppe K Glinoer D Thyroid function and human reproductive health Endocr Rev 2010 31 5 702 55 10.1210/er.2009-0041 20573783 Krassas GE, Poppe K, Glinoer D. Thyroid function and human reproductive health. Endocr Rev. 2010;31(5):702–55. 10.1210/er.2009-0041. 20573783 10.1210/er.2009-0041 3. K A, N P, A B, et al. 2017 guidelines of the American thyroid association for the diagnosis and management of thyroid disease during pregnancy and the postpartum. https://home.liebertpub.com/thy 10.1089/thy.2016.0457 28056690 4. Stagnaro-Green A Screening pregnant women for overt thyroid disease JAMA 2015 313 6 565 6 10.1001/jama.2014.17226 25668257 Stagnaro-Green A. Screening pregnant women for overt thyroid disease. JAMA. 2015;313(6):565–6. 10.1001/jama.2014.17226. 25668257 10.1001/jama.2014.17226 5. Azizi F Amouzegar A Mehran L Alamdari S Subekti I Vaidya B Screening and management of hypothyroidism in pregnancy: results of an Asian survey Endocr J 2014 61 7 697 704 10.1507/endocrj.EJ14-0083 24826864 Azizi F, Amouzegar A, Mehran L, Alamdari S, Subekti I, Vaidya B, et al. Screening and management of hypothyroidism in pregnancy: results of an Asian survey. Endocr J. 2014;61(7):697–704. 10.1507/endocrj.EJ14-0083. 24826864 10.1507/endocrj.ej14-0083 6. Vaidya B Anthony S Bilous M Shields B Drury J Hutchison S Detection of thyroid dysfunction in early pregnancy: universal screening or targeted high-risk case finding? J Clin Endocrinol Metab 2007 92 1 203 7 10.1210/jc.2006-1748 17032713 Vaidya B, Anthony S, Bilous M, Shields B, Drury J, Hutchison S, et al. Detection of thyroid dysfunction in early pregnancy: universal screening or targeted high-risk case finding? J Clin Endocrinol Metab. 2007;92(1):203–7. 10.1210/jc.2006-1748. 17032713 10.1210/jc.2006-1748 7. Cleary-Goldman J Malone FD Lambert-Messerlian G Sullivan L Canick J Porter TF Maternal thyroid hypofunction and pregnancy outcome Obstetrics and gynecology 2008 112 1 85 92 10.1097/AOG.0b013e3181788dd7 18591312 PMC4949950 Cleary-Goldman J, Malone FD, Lambert-Messerlian G, Sullivan L, Canick J, Porter TF et al. Maternal thyroid hypofunction and pregnancy outcome. Obstet Gynecol. 2008;112(1):85-92. 10.1097/AOG.0b013e3181788dd7. 18591312 10.1097/AOG.0b013e3181788dd7 PMC4949950 8. Henrichs J Bongers-Schokking JJ Schenk JJ Ghassabian A Schmidt HG Visser TJ Maternal thyroid function during early pregnancy and cognitive functioning in early childhood: the generation R study J Clin Endocrinol Metab 2010 95 9 4227 34 10.1210/jc.2010-0415 20534757 Henrichs J, Bongers-Schokking JJ, Schenk JJ, Ghassabian A, Schmidt HG, Visser TJ, et al. Maternal thyroid function during early pregnancy and cognitive functioning in early childhood: the generation R study. J Clin Endocrinol Metab. 2010;95(9):4227–34. 10.1210/jc.2010-0415. 20534757 10.1210/jc.2010-0415 9. Kominiarek MA Chauhan SP Overweight increases risk of first trimester hypothyroxinaemia in iodine-deficient pregnant women Am J Perinatol 2016 33 5 433 41 10.1055/s-0035-1567856 26588260 Kominiarek MA, Chauhan SP. Overweight increases risk of first trimester hypothyroxinaemia in iodine-deficient pregnant women. Am J Perinatol. 2016;33(5):433–41. 10.1055/s-0035-1567856. 23937433 10.1111/mcn.12040 PMC6860313 10. Moleti M Lo Presti VP Mattina F Mancuso A De Vivo A Giorgianni G Gestational thyroid function abnormalities in conditions of mild iodine deficiency: early screening versus continuous monitoring of maternal thyroid status Eur J Endocrinol 2009 160 4 611 7 10.1530/EJE-08-0709 19179457 Moleti M, Lo Presti VP, Mattina F, Mancuso A, De Vivo A, Giorgianni G, et al. Gestational thyroid function abnormalities in conditions of mild iodine deficiency: early screening versus continuous monitoring of maternal thyroid status. Eur J Endocrinol. 2009;160(4):611–7. 10.1530/EJE-08-0709. 19179457 10.1530/EJE-08-0709 11. Berbel P Mestre JL Santamaría A Palazón I Franco A Graells M Delayed neurobehavioral development in children born to pregnant women with mild hypothyroxinemia during the first month of gestation: the importance of early iodine supplementation Thyroid 2009 19 5 511 9 10.1089/thy.2008.0341 19348584 Berbel P, Mestre JL, Santamaría A, Palazón I, Franco A, Graells M, et al. Delayed neurobehavioral development in children born to pregnant women with mild hypothyroxinemia during the first month of gestation: the importance of early iodine supplementation. Thyroid. 2009;19(5):511–9. 10.1089/thy.2008.0341. 19348584 10.1089/thy.2008.0341 12. Furnica RM Gruson D Lazarus JH Maiter D Bernard P Daumerie C First trimester isolated maternal hypothyroxinaemia: adverse maternal metabolic profile and impact on the obstetrical outcome Clin Endocrinol (Oxf) 2017 86 4 576 83 10.1111/cen.13301 28039875 Furnica RM, Gruson D, Lazarus JH, Maiter D, Bernard P, Daumerie C. First trimester isolated maternal hypothyroxinaemia: adverse maternal metabolic profile and impact on the obstetrical outcome. Clin Endocrinol (Oxf). 2017;86(4):576–83. 10.1111/cen.13301. 28039875 10.1111/cen.13301 13. Gong X Liu A Li Y Sun H Li Y Li C The impact of isolated maternal hypothyroxinemia during the first and second trimester of gestation on pregnancy outcomes: an intervention and prospective cohort study in China J Endocrinol Invest 2019 42 5 599 607 10.1007/s40618-018-0960-7 30334197 PMC6476837 Gong X, Liu A, Li Y, Sun H, Li Y, Li C, et al. The impact of isolated maternal hypothyroxinemia during the first and second trimester of gestation on pregnancy outcomes: an intervention and prospective cohort study in China. J Endocrinol Invest. 2019;42(5):599–607. 10.1007/s40618-018-0960-7. 30334197 10.1007/s40618-018-0960-7 PMC6476837 14. Korevaar TI Schalekamp-Timmermans S de Rijke YB Visser WE Visser W de Keizer-Schrama M Hypothyroxinemia and TPO-antibody positivity are risk factors for premature delivery: the generation R study J Clin Endocrinol Metab 2013 98 11 4382 90 10.1210/jc.2013-2855 24037884 Korevaar TI, Schalekamp-Timmermans S, de Rijke YB, Visser WE, Visser W, de Keizer-Schrama M. Hypothyroxinemia and TPO-antibody positivity are risk factors for premature delivery: the generation R study. J Clin Endocrinol Metab. 2013;98(11):4382–90. 10.1210/jc.2013-2855. 24037884 10.1210/jc.2013-2855 15. Finken MJJ van Eijsden M Loomans EM Vrijkotte TGM Rotteveel J Maternal hypothyroxinemia in early pregnancy predicts reduced performance in reaction time tests in 5- to 6-year-old offspring J Clin Endocrinol Metab 2013 98 4 1417 26 10.1210/jc.2012-3389 23408575 Finken MJJ, van Eijsden M, Loomans EM, Vrijkotte TGM, Rotteveel J. Maternal hypothyroxinemia in early pregnancy predicts reduced performance in reaction time tests in 5- to 6-year-old offspring. J Clin Endocrinol Metab. 2013;98(4):1417–26. 10.1210/jc.2012-3389. 23408575 10.1210/jc.2012-3389 16. Olivieri A Valensise H Magnani F Medda E De Angelis S D’Archivio M High frequency of antithyroid autoantibodies in pregnant women at increased risk of gestational diabetes mellitus Eur J Endocrinol 2000 143 6 741 7 10.1530/eje.0.1430741 11124856 Olivieri A, Valensise H, Magnani F, Medda E, De Angelis S, D’Archivio M, et al. High frequency of antithyroid autoantibodies in pregnant women at increased risk of gestational diabetes mellitus. Eur J Endocrinol. 2000;143(6):741–7. 10.1530/eje.0.1430741. 11124856 10.1530/eje.0.1430741 17. Sardana D Nanda S Kharb S Thyroid hormones in pregnancy and preeclampsia J Turk Ger Gynecol Assoc 2009 10 3 168 71 24591862 PMC3939122 Sardana D, Nanda S, Kharb S. Thyroid hormones in pregnancy and preeclampsia. J Turk Ger Gynecol Assoc. 2009;10(3):168–71. 24591862 PMC3939122 18. Casey BM Dashe JS Wells CE McIntire DD Byrd W Leveno KJ Subclinical hypothyroidism and pregnancy outcomes Obstet Gynecol 2005 105 2 239 10.1097/01.AOG.0000152345.99421.22 15684146 Casey BM, Dashe JS, Wells CE, McIntire DD, Byrd W, Leveno KJ, et al. Subclinical hypothyroidism and pregnancy outcomes. Obstet Gynecol. 2005;105(2):239. 10.1097/01.AOG.0000152345.99421.22. 15684146 10.1097/01.AOG.0000152345.99421.22 19. Chan SY Franklyn JA Pemberton HN Bulmer JN Visser TJ McCabe CJ Monocarboxylate transporter 8 expression in the human placenta: the effects of severe intrauterine growth restriction J Endocrinol 2006 189 3 465 71 10.1677/joe.1.06582 16731778 PMC2869027 Chan SY, Franklyn JA, Pemberton HN, Bulmer JN, Visser TJ, McCabe CJ, et al. Monocarboxylate transporter 8 expression in the human placenta: the effects of severe intrauterine growth restriction. J Endocrinol. 2006;189(3):465–71. 10.1677/joe.1.06582. 16731778 10.1677/joe.1.06582 PMC2869027 20. Pop VJ Brouwers EP Vader HL Vulsma T van Baar AL de Vijlder JJ Maternal hypothyroxinaemia during early pregnancy and subsequent child development: a 3-year follow-up study Clin Endocrinol (Oxf) 2003 59 3 282 8 10.1046/j.1365-2265.2003.01822.x 12919150 Pop VJ, Brouwers EP, Vader HL, Vulsma T, van Baar AL, de Vijlder JJ. Maternal hypothyroxinaemia during early pregnancy and subsequent child development: a 3-year follow-up study. Clin Endocrinol (Oxf). 2003;59(3):282–8. 10.1046/j.1365-2265.2003.01822.x. 12919150 10.1046/j.1365-2265.2003.01822.x 21. Craig WY Allan WC Kloza EM Pulkkinen AJ Waisbren S Spratt DI Mid-gestational maternal free thyroxine concentration and offspring neurocognitive development at age two years J Clin Endocrinol Metab 2012 97 1 E22 28 10.1210/jc.2011-1772 22031521 PMC3251941 Craig WY, Allan WC, Kloza EM, Pulkkinen AJ, Waisbren S, Spratt DI, et al. Mid-gestational maternal free thyroxine concentration and offspring neurocognitive development at age two years. J Clin Endocrinol Metab. 2012;97(1):E22–28. 10.1210/jc.2011-1772. 22031521 10.1210/jc.2011-1772 PMC3251941 22. Casey BM Dashe JS Spong CY McIntire DD Leveno KJ Cunningham GF Perinatal significance of isolated maternal hypothyroxinemia identified in the first half of pregnancy Obstet Gynecol 2007 109 5 1129 35 10.1097/01.AOG.0000262054.03531.24 17470594 Casey BM, Dashe JS, Spong CY, McIntire DD, Leveno KJ, Cunningham GF. Perinatal significance of isolated maternal hypothyroxinemia identified in the first half of pregnancy. Obstet Gynecol. 2007;109(5):1129–35. 10.1097/01.AOG.0000262054.03531.24. 17470594 10.1097/01.AOG.0000262054.03531.24 23. Chen L Yang H Ye E Lin Z Peng M Lin H Insignificant effect of isolated hypothyroxinemia on pregnancy outcomes during the first and second trimester of pregnancy Front Endocrinol 2020 11 528146 10.3389/fendo.2020.528146 PMC7596376 33178133 Chen L, Yang H, Ye E, Lin Z, Peng M, Lin H, et al. Insignificant effect of isolated hypothyroxinemia on pregnancy outcomes during the first and second trimester of pregnancy. Front Endocrinol. 2020;11:528146. 10.3389/fendo.2020.528146. 10.3389/fendo.2020.528146 PMC7596376 33178133 24. Cai C Chen W Vinturache A Hu P Lu M Gu H Thyroid hormone concentrations in second trimester of gestation and birth outcomes in Shanghai, China J Matern Fetal Neonatal Med 2021 34 12 1897 905 10.1080/14767058.2019.1651273 31397208 Cai C, Chen W, Vinturache A, Hu P, Lu M, Gu H, et al. Thyroid hormone concentrations in second trimester of gestation and birth outcomes in Shanghai, China. J Matern Fetal Neonatal Med. 2021;34(12):1897–905. 10.1080/14767058.2019.1651273. 31397208 10.1080/14767058.2019.1651273 25. Gestational Hypertension and Preeclampsia ACOG practice bulletin summary, number 222 Obstet Gynecol 2020 135 6 1492 5 10.1097/AOG.0000000000003892 32443077 Gestational Hypertension and Preeclampsia. ACOG practice bulletin summary, number 222. Obstet Gynecol. 2020;135(6):1492–5. 10.1097/AOG.0000000000003892. 32443077 10.1097/AOG.0000000000003892 26. Xie X Kong B Duan T Obstetrics and gynecology (the 9th Version) 2018 Beijing People ’ s Medical Publishing House 138 40 Xie X, Kong B, Duan T. Obstetrics and gynecology (the 9th Version). Beijing: People ’ s Medical Publishing House; 2018. pp. 138–40. 27. Madley-Dowd P Hughes R Tilling K Heron J The proportion of missing data should not be used to guide decisions on multiple imputation J Clin Epidemiol 2019 110 63 73 10.1016/j.jclinepi.2019.02.016 30878639 PMC6547017 Madley-Dowd P, Hughes R, Tilling K, Heron J. The proportion of missing data should not be used to guide decisions on multiple imputation. J Clin Epidemiol. 2019;110:63–73. 10.1016/j.jclinepi.2019.02.016. 30878639 10.1016/j.jclinepi.2019.02.016 PMC6547017 28. Ma ZF A comparative study of iodized salt programs. Shanghai and Switzerland Biol Trace Elem Res 2019 189 2 586 10.1007/s12011-018-1478-8 30109549 Ma ZF. A comparative study of iodized salt programs. Shanghai and Switzerland. Biol Trace Elem Res. 2019;189(2):586. 10.1007/s12011-018-1478-8. 30109549 10.1007/s12011-018-1478-8 29. Wang Z Liu P Su X Zou S Song J Liu S A comparison of iodine status in children and pregnant women after a policy change in the iodized salt standard in Shanghai, China Biol Trace Elem Res 2018 185 2 275 81 10.1007/s12011-018-1257-6 29541993 Wang Z, Liu P, Su X, Zou S, Song J, Liu S. A comparison of iodine status in children and pregnant women after a policy change in the iodized salt standard in Shanghai, China. Biol Trace Elem Res. 2018;185(2):275–81. 10.1007/s12011-018-1257-6. 29541993 10.1007/s12011-018-1257-6 30. Alevizaki M Saltiki K Voidonikola P Mantzou E Papamichael C Stamatelopoulos K Free thyroxine is an independent predictor of subcutaneous fat in euthyroid individuals Eur J Endocrinol 2009 161 3 459 65 10.1530/EJE-09-0441 19700640 Alevizaki M, Saltiki K, Voidonikola P, Mantzou E, Papamichael C, Stamatelopoulos K. Free thyroxine is an independent predictor of subcutaneous fat in euthyroid individuals. Eur J Endocrinol. 2009;161(3):459–65. 10.1530/EJE-09-0441. 19700640 10.1530/EJE-09-0441 31. Agnihothri RV Courville AB Linderman JD Smith S Brychta R Remaley A Moderate weight loss is sufficient to affect thyroid hormone homeostasis and inhibit its peripheral conversion Thyroid® 2014 24 1 19 26 10.1089/thy.2013.0055 23902316 PMC3887425 Agnihothri RV, Courville AB, Linderman JD, Smith S, Brychta R, Remaley A, et al. Moderate weight loss is sufficient to affect thyroid hormone homeostasis and inhibit its peripheral conversion. Thyroid ® 23902316 10.1089/thy.2013.0055 PMC3887425 32. Shi X Han C Li C Mao J Wang W Xie X Optimal and safe upper limits of iodine intake for early pregnancy in iodine-sufficient regions: a cross-sectional study of 7190 pregnant women in China J Clin Endocrinol Metab 2015 100 4 1630 8 10.1210/jc.2014-3704 25629356 Shi X, Han C, Li C, Mao J, Wang W, Xie X, et al. Optimal and safe upper limits of iodine intake for early pregnancy in iodine-sufficient regions: a cross-sectional study of 7190 pregnant women in China. J Clin Endocrinol Metab. 2015;100(4):1630–8. 10.1210/jc.2014-3704. 25629356 10.1210/jc.2014-3704 33. Babić Leko M Gunjača I Pleić N Zemunik T Environmental factors affecting thyroid-stimulating hormone and thyroid hormone levels Int J Mol Sci 2021 22 12 6521 10.3390/ijms22126521 34204586 PMC8234807 Babić Leko M, Gunjača I, Pleić N, Zemunik T. Environmental factors affecting thyroid-stimulating hormone and thyroid hormone levels. Int J Mol Sci. 2021;22(12):6521. 10.3390/ijms22126521. 34204586 10.3390/ijms22126521 PMC8234807 34. Ghassabian A Pierotti L Basterrechea M Chatzi L Estarlich M Fernández-Somoano A Association of exposure to ambient air pollution with thyroid function during pregnancy JAMA Netw Open 2019 2 10 e1912902 10.1001/jamanetworkopen.2019.12902 31617922 PMC6806433 Ghassabian A, Pierotti L, Basterrechea M, Chatzi L, Estarlich M, Fernández-Somoano A, et al. Association of exposure to ambient air pollution with thyroid function during pregnancy. JAMA Netw Open. 2019;2(10):e1912902. 10.1001/jamanetworkopen.2019.12902. 31617922 10.1001/jamanetworkopen.2019.12902 PMC6806433 35. Huang C Wu Y Chen L Yuan Z Yang S Liu C Establishment of assay method- and trimester-specific reference intervals for thyroid hormones during pregnancy in Chengdu, China J Clin Lab Anal 2021 35 5 e23763 10.1002/jcla.23763 33942380 PMC8128292 Huang C, Wu Y, Chen L, Yuan Z, Yang S, Liu C. Establishment of assay method- and trimester-specific reference intervals for thyroid hormones during pregnancy in Chengdu, China. J Clin Lab Anal. 2021;35(5):e23763. 10.1002/jcla.23763. 33942380 10.1002/jcla.23763 PMC8128292 36. Mumtaz A Sadiq F Zaki S Batool H Ibrahim M Khurram M Trimester-specific reference ranges for thyroid hormones of pregnant females at tertiary care hospitals in Lahore, Pakistan BMC Pregnancy Childbirth 2021 21 1 717 10.1186/s12884-021-04200-x 34702203 PMC8547102 Mumtaz A, Sadiq F, Zaki S, Batool H, Ibrahim M, Khurram M, et al. Trimester-specific reference ranges for thyroid hormones of pregnant females at tertiary care hospitals in Lahore, Pakistan. BMC Pregnancy Childbirth. 2021;21(1):717. 10.1186/s12884-021-04200-x. 34702203 10.1186/s12884-021-04200-x PMC8547102 37. Korevaar TIM Evidence-based tightrope, walking. The 2017 guidelines of the American Thyroid Association for the diagnosis and management of thyroid disease during pregnancy and the postpartum Thyroid® 2017 27 3 309 311 10.1089/thy.2017.29040.tko 28257275 Korevaar TIM. Evidence-based tightrope, walking. The 2017 guidelines of the American Thyroid Association for the diagnosis and management of thyroid disease during pregnancy and the postpartum. Thyroid®. 2017;27(3):309–11. 10.1089/thy.2017.29040.tko. 28257275 10.1089/thy.2017.29040.tko 38. Ayres PJ Barlow J Garrod O Tait SA Tait JF Walker G Correlation of adrenal steroid concentrations and changes in electrolyte metabolism Scand J Clin Lab Invest 1958 10 Suppl 31 29 49 13555710 Ayres PJ, Barlow J, Garrod O, Tait SA, Tait JF, Walker G. Correlation of adrenal steroid concentrations and changes in electrolyte metabolism. Scand J Clin Lab Invest. 1958;10(Suppl 31):29–49. 13555710 39. Pop VJ Biondi B Wijnen HA Kuppens SM LVader H Maternal thyroid parameters, body mass index and subsequent weight gain during pregnancy in healthy euthyroid women Clin Endocrinol (Oxf) 2013 79 4 577 83 10.1111/cen.12177 23445086 Pop VJ, Biondi B, Wijnen HA, Kuppens SM, LVader H. Maternal thyroid parameters, body mass index and subsequent weight gain during pregnancy in healthy euthyroid women. Clin Endocrinol (Oxf). 2013;79(4):577–83. 10.1111/cen.12177. 23445086 10.1111/cen.12177 40. Andersen SL Andersen S Carlé A Christensen PA Handberg A Karmisholt J Pregnancy week-specific reference ranges for thyrotropin and free thyroxine in the North Denmark region pregnancy cohort Thyroid 2019 29 3 430 8 10.1089/thy.2018.0628 30734656 Andersen SL, Andersen S, Carlé A, Christensen PA, Handberg A, Karmisholt J, et al. Pregnancy week-specific reference ranges for thyrotropin and free thyroxine in the North Denmark region pregnancy cohort. Thyroid. 2019;29(3):430–8. 10.1089/thy.2018.0628. 30734656 10.1089/thy.2018.0628 41. De Groot L Abalovich M Alexander EK Amino N Barbour L Cobin RH Management of thyroid dysfunction during pregnancy and postpartum: an endocrine society clinical practice guideline J Clin Endocrinol Metab 2012 97 8 2543 65 10.1210/jc.2011-2803 22869843 De Groot L, Abalovich M, Alexander EK, Amino N, Barbour L, Cobin RH, et al. Management of thyroid dysfunction during pregnancy and postpartum: an endocrine society clinical practice guideline. J Clin Endocrinol Metab. 2012;97(8):2543–65. 10.1210/jc.2011-2803. 22869843 10.1210/jc.2011-2803 42. Chen L Ye E Sun M Lin H Yu L Lin Z Association between third trimester maternal isolated hypothyroxinemia and adverse pregnancy outcomes Endocr J 2023 70 6 611 8 10.1507/endocrj.EJ22-0528 37032065 Chen L, Ye E, Sun M, Lin H, Yu L, Lin Z, et al. Association between third trimester maternal isolated hypothyroxinemia and adverse pregnancy outcomes. Endocr J. 2023;70(6):611–8. 10.1507/endocrj.EJ22-0528. 37032065 10.1507/endocrj.EJ22-0528 43. Zhang C Yang X Zhang Y Guo F Yang S Peeters RP Association between maternal thyroid hormones and birth weight at early and late pregnancy J Clin Endocrinol Metab 2019 104 12 5853 63 10.1210/jc.2019-00390 31216012 Zhang C, Yang X, Zhang Y, Guo F, Yang S, Peeters RP, et al. Association between maternal thyroid hormones and birth weight at early and late pregnancy. J Clin Endocrinol Metab. 2019;104(12):5853–63. 10.1210/jc.2019-00390. 31216012 10.1210/jc.2019-00390 44. Haddow JE Craig WY Palomaki GE Impact of adjusting for the reciprocal relationship between maternal weight and free thyroxine during early pregnancy Thyroid 2013 23 2 225 30 10.1089/thy.2012.0440 23136959 PMC3569945 Haddow JE, Craig WY, Palomaki GE, et al. Impact of adjusting for the reciprocal relationship between maternal weight and free thyroxine during early pregnancy. Thyroid. 2013;23(2):225–30. 10.1089/thy.2012.0440. 23136959 10.1089/thy.2012.0440 PMC3569945 45. van Mil NH Steegers-Theunissen RP Bongers-Schokking JJ El Marroun H Ghassabian A Hofman A Maternal hypothyroxinemia during pregnancy and growth of the fetal and infant head Reprod Sci 2012 19 12 1315 22 10.1177/1933719112450338 22878528 van Mil NH, Steegers-Theunissen RP, Bongers-Schokking JJ, El Marroun H, Ghassabian A, Hofman A, et al. Maternal hypothyroxinemia during pregnancy and growth of the fetal and infant head. Reprod Sci. 2012;19(12):1315–22. 10.1177/1933719112450338. 22878528 10.1177/1933719112450338 46. Li P Cui J Li L Chen X Ouyang L Fan J Association between isolated maternal hypothyroxinemia during the first trimester and adverse pregnancy outcomes in Southern Chinese women: a retrospective study of 7051 cases BMC Pregnancy Childbirth 2022 22 1 866 10.1186/s12884-022-05194-w 36424562 PMC9694516 Li P, Cui J, Li L, Chen X, Ouyang L, Fan J, et al. Association between isolated maternal hypothyroxinemia during the first trimester and adverse pregnancy outcomes in Southern Chinese women: a retrospective study of 7051 cases. BMC Pregnancy Childbirth. 2022;22(1):866. 10.1186/s12884-022-05194-w. 36424562 10.1186/s12884-022-05194-w PMC9694516 47. Bassols J Prats-Puig A Soriano-Rodríguez P García-González MM Reid J Martínez-Pascual M Lower free thyroxin associates with a less favorable metabolic phenotype in healthy pregnant women J Clin Endocrinol Metab 2011 96 12 3717 23 10.1210/jc.2011-1784 21917863 Bassols J, Prats-Puig A, Soriano-Rodríguez P, García-González MM, Reid J, Martínez-Pascual M, et al. Lower free thyroxin associates with a less favorable metabolic phenotype in healthy pregnant women. J Clin Endocrinol Metab. 2011;96(12):3717–23. 10.1210/jc.2011-1784. 21917863 10.1210/jc.2011-1784 48. Roos A Bakker SJL Links TP Gans ROB Wolffenbuttel BHR Thyroid function is associated with components of the metabolic syndrome in euthyroid subjects J Clin Endocrinol Metab 2007 92 2 491 6 10.1210/jc.2006-1718 17090642 Roos A, Bakker SJL, Links TP, Gans ROB, Wolffenbuttel BHR. Thyroid function is associated with components of the metabolic syndrome in euthyroid subjects. J Clin Endocrinol Metab. 2007;92(2):491–6. 10.1210/jc.2006-1718. 17090642 10.1210/jc.2006-1718 49. Roef GL Rietzschel ER Van Daele CM Taes YE De Buyzere ML Gillebert TC Triiodothyronine and free thyroxine levels are differentially associated with metabolic profile and adiposity-related cardiovascular risk markers in euthyroid middle-aged subjects Thyroid 2014 24 2 223 31 10.1089/thy.2013.0314 24032604 PMC3926145 Roef GL, Rietzschel ER, Van Daele CM, Taes YE, De Buyzere ML, Gillebert TC, et al. Triiodothyronine and free thyroxine levels are differentially associated with metabolic profile and adiposity-related cardiovascular risk markers in euthyroid middle-aged subjects. Thyroid. 2014;24(2):223–31. 10.1089/thy.2013.0314. 24032604 10.1089/thy.2013.0314 PMC3926145 50. Longhi S Radetti G Thyroid function and obesity J Clin Res Pediatr Endocrinol 2013 5 Suppl 1 40 4 10.4274/jcrpe.856 23149391 PMC3608008 Longhi S, Radetti G. Thyroid function and obesity. J Clin Res Pediatr Endocrinol. 2013;5(Suppl 1):40–4. 10.4274/jcrpe.856. 23149391 10.4274/Jcrpe.856 PMC3608008 51. Johns LE Ferguson KK McElrath TF Mukherjee B Meeker JD Associations between repeated measures of maternal urinary phthalate metabolites and thyroid hormone parameters during pregnancy Environ Health Perspect 2016 124 11 1808 15 10.1289/EHP170 27152641 PMC5089879 Johns LE, Ferguson KK, McElrath TF, Mukherjee B, Meeker JD. Associations between repeated measures of maternal urinary phthalate metabolites and thyroid hormone parameters during pregnancy. Environ Health Perspect. 2016;124(11):1808–15. 10.1289/EHP170. 27152641 10.1289/EHP170 PMC5089879 52. Taylor PN Razvi S Pearce SH Dayan CM Clinical review: a review of the clinical consequences of variation in thyroid function within the reference range J Clin Endocrinol Metab 2013 98 9 3562 71 10.1210/jc.2013-1315 23824418 Taylor PN, Razvi S, Pearce SH, Dayan CM. Clinical review: a review of the clinical consequences of variation in thyroid function within the reference range. J Clin Endocrinol Metab. 2013;98(9):3562–71. 10.1210/jc.2013-1315. 23824418 10.1210/jc.2013-1315 53. Osredkar D Verdenik I Gergeli AT Gersak K Lucovnik M Apgar score and risk of cerebral palsy in preterm infants: a population-based cohort study Neuropediatrics 2021 52 4 310 5 10.1055/s-0041-1729181 34162009 Osredkar D, Verdenik I, Gergeli AT, Gersak K, Lucovnik M. Apgar score and risk of cerebral palsy in preterm infants: a population-based cohort study. Neuropediatrics. 2021;52(4):310–5. 10.1055/s-0041-1729181. 34162009 10.1055/s-0041-1729181 54. Su PY Huang K Hao JH Xu YQ Yan SQ Li T Maternal thyroid function in the first twenty weeks of pregnancy and subsequent fetal and infant development: a prospective population-based cohort study in China J Clin Endocrinol Metab 2011 96 10 3234 41 10.1210/jc.2011-0274 21832110 Su PY, Huang K, Hao JH, Xu YQ, Yan SQ, Li T, et al. Maternal thyroid function in the first twenty weeks of pregnancy and subsequent fetal and infant development: a prospective population-based cohort study in China. J Clin Endocrinol Metab. 2011;96(10):3234–41. 10.1210/jc.2011-0274. 21832110 10.1210/jc.2011-0274 55. Goel P Radotra A Devi K Malhotra S Aggarwal A Huria A Maternal and perinatal outcome in pregnancy with hypothyroidism Indian J Med Sci 2005 59 3 116 7 10.4103/0019-5359.15089 15805683 Goel P, Radotra A, Devi K, Malhotra S, Aggarwal A, Huria A. Maternal and perinatal outcome in pregnancy with hypothyroidism. Indian J Med Sci. 2005;59(3):116–7. 15805683 56. Fan J Zhang Y Zhang C Barjaktarovic M Yang X Peeters RP Persistency of thyroid dysfunction from early to late pregnancy Thyroid 2019 29 10 1475 84 10.1089/thy.2019.0115 31347461 Fan J, Zhang Y, Zhang C, Barjaktarovic M, Yang X, Peeters RP, et al. Persistency of thyroid dysfunction from early to late pregnancy. Thyroid. 2019;29(10):1475–84. 10.1089/thy.2019.0115. 31347461 10.1089/thy.2019.0115 57. La Verde M De Franciscis P Molitierno R Caniglia FM Fordellone M Braca E Carbone C Varro C Cirillo P Scappaticcio L Thyroid hormones in early pregnancy and birth weight: a retrospective study Biomedicines 2025 13 3 542 10.3390/biomedicines13030542 40149520 PMC11940075 La Verde M, De Franciscis P, Molitierno R, Caniglia FM, Fordellone M, Braca E, et al. Thyroid hormones in early pregnancy and birth weight: a retrospective study. Biomedicines. 2025;13(3):542. 10.3390/biomedicines13030542. 40149520 10.3390/biomedicines13030542 PMC11940075 58. Lazarus J Brown RS Daumerie C Hubalewska-Dydejczyk A Negro R Vaidya B European thyroid association guidelines for the management of subclinical hypothyroidism in pregnancy and in children Eur Thyroid J 2014 3 2 76 94 10.1159/000362597 25114871 PMC4109520 Lazarus J, Brown RS, Daumerie C, Hubalewska-Dydejczyk A, Negro R, Vaidya B. European thyroid association guidelines for the management of subclinical hypothyroidism in pregnancy and in children. Eur Thyroid J. 2014;3(2):76–94. 10.1159/000362597. 25114871 10.1159/000362597 PMC4109520 59. Tian W Yan W Liu Y Zhou F Wang H Sun W The status and knowledge of iodine among pregnant women in Shanghai Biol Trace Elem Res 2021 199 12 4489 97 10.1007/s12011-021-02587-4 33462796 Tian W, Yan W, Liu Y, Zhou F, Wang H, Sun W. The status and knowledge of iodine among pregnant women in Shanghai. Biol Trace Elem Res. 2021;199(12):4489–97. 10.1007/s12011-021-02587-4. 33462796 10.1007/s12011-021-02587-4 60. Yu Z Zheng C Zheng W Wan Z Bu Y Zhang G Mild-to-moderate iodine deficiency in a sample of pregnant women and salt iodine concentration from Zhejiang province, China Environ Geochem Health 2020 42 11 3811 8 10.1007/s10653-020-00640-0 32596780 Yu Z, Zheng C, Zheng W, Wan Z, Bu Y, Zhang G, et al. Mild-to-moderate iodine deficiency in a sample of pregnant women and salt iodine concentration from Zhejiang province, China. Environ Geochem Health. 2020;42(11):3811–8. 10.1007/s10653-020-00640-0. 32596780 10.1007/s10653-020-00640-0 ",
  "metadata": {
    "Title of this paper": "Mild-to-moderate iodine deficiency in a sample of pregnant women and salt iodine concentration from Zhejiang province, China",
    "Journal it was published in:": "BMC Pregnancy and Childbirth",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486540/"
  }
}