{
  "title": "Paper_483",
  "abstract": "Sci Immunol Sci Immunol 319 nihpa Science immunology 2470-9468 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12478536 PMC12478536.1 12478536 12478536 NIHMS2110559 40911697 10.1126/sciimmunol.adz6869 NIHMS2110559 NIHPA2110559 1 Article Enkephalin-producing regulatory T cells in the skin restrain local inflammation through control of nociception Mendoza Alejandra 1 3 4 * Bou-Puerto Regina 2 Jara Juan Sebastian 3 Dikiy Stanislav 1 3 Giovanelli Paolo 2 Correa Danilo 5 Manenti Susanna 3 Andretta Emma S. 1 Dahia Chitra L. 5 6 Rudensky Alexander Y. 1 * 1 2 3 4 5 6 Author contributions A.M., C.L.D. and A.Y.R. designed the experiments. A.M., R.B.P., P.G., S.D., J.S.J., S.M, E.A and D.C. performed experiments and analyzed data. A.M. and A.Y.R. interpreted the data and wrote the manuscript. * rudenska@mskcc.org almendoza@scripps.edu Competing interests Authors declare that they have no competing interests. 05 9 2025 05 9 2025 10 111 497744 eadz6869 eadz6869 13 09 2025 29 09 2025 30 09 2025 30 09 2025 Regulatory T cells restrain skin inflammation by modulating peripheral neuron activation 15 5 2024 2024.05.14.594055 bioRxiv PMC11118420 38798541 The skin integrates diverse signals discerned by sensory neurons and immune cells to elicit adaptive responses to a range of stresses. Considering interactions between nervous and immune systems, we examined whether regulatory T (T reg reg reg Penk, reg Penk reg reg One-sentence summary: Regulatory T cells curb noxious sensory signaling to dampen cutaneous inflammation, a neuro-modulatory mechanism for immunosuppression. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "\nRegulatory T cells restrain skin inflammation by modulating peripheral neuron activation\n",
    "Journal it was published in:": "Science immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478536/"
  }
}