{
  "title": "Paper_861",
  "abstract": "pmc Clin Transl Sci Clin Transl Sci 2996 cts CTS Clinical and Translational Science 1752-8054 1752-8062 Wiley PMC12461108 PMC12461108.1 12461108 12461108 40994257 10.1111/cts.70368 CTS70368 CTS-2025-0326 1 Article Article Computational Analysis of Exosome‐Derived Signature in TNBC Zhang Yuan https://orcid.org/0000-0003-3540-2205  1 Zhao Ming https://orcid.org/0009-0009-3431-2639  2 Hou Lei https://orcid.org/0009-0008-7396-5985  1 Jin Long https://orcid.org/0000-0001-5611-7097  3 Bai Jun https://orcid.org/0009-0004-6042-6924  1 rmbaijun@yeah.net Dang Yunzhi https://orcid.org/0000-0002-8059-0500  3 dangyunzhi@xiyi.edu.cn   1 Department of Oncology Shaanxi Provincial People's Hospital Xi'an China   2 Medical Laboratory Center Shaanxi Provincial People's Hospital Xi'an China   3 Department of Radiation Oncology Shaanxi Provincial People's Hospital Xi'an China * Correspondence: rmbaijun@yeah.net dangyunzhi@xiyi.edu.cn 25 9 2025 10 2025 18 10 497490 10.1111/cts.v18.10 e70368 23 8 2025 24 5 2025 09 9 2025 25 09 2025 26 09 2025 26 09 2025 © 2025 The Author(s). Clinical and Translational Science https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc/4.0/ ABSTRACT Triple‐negative breast cancer (TNBC) is a particularly aggressive subtype of breast cancer with limited targeted therapeutic options. Exosomes, small membrane vesicles secreted by cells, play a crucial role in intercellular communication and material exchange. However, the role of exosome‐related genes (ERGs) in TNBC remains unclear. In here, we analyzed single‐cell RNA sequencing (scRNA‐seq) from 10 TNBC samples and bulk RNA‐seq from TCGA and METABRIC cohorts. Starting with 121 EDPS curated from the breast cancer‐specific ExoBCD database, we identified exosome‐active cell populations and derived an Exosome‐Derived Prognostic Signature (EDPS) through integrative machine learning. Our analysis identified 31,140 cells from TNBC samples, categorized into nine cell types, with epithelial cells exhibiting the highest exosome‐related scores. A total of 232 differentially expressed genes (DEGs) related to exosome‐related scores were identified, with 19 prognostic genes selected through univariate Cox regression, leading to the construction of an EDPS. Low EDPS scores correlated with poorer clinical outcomes, higher immune infiltrates, and immune‐related pathways. Furthermore, we identified notable differences in biological functions and mutation profiles between the two EDPS groups. Additionally, the low EDPS score group exhibited lower tumor immune dysfunction and exclusion (TIDE) scores, immunophenoscore (IPS), and higher immune checkpoint expression, suggesting better immunotherapy outcomes. In conclusion, while derived from exosome‐related genes, the EDPS primarily reflects immune‐active tumor microenvironments. This signature may help identify TNBC patients likely to benefit from immunotherapy, though further validation of its relationship to exosome biology is needed. exosomes immune response prognostic model single‐cell RNA sequencing triple‐negative breast cancer pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:25.09.2025  Y. Zhang M. Zhao L. Hou L. Jin J. Bai Y. Dang Computational Analysis of Exosome‐Derived Signature in TNBC Clinical and Translational Science 18 10 2025 e70368 10.1111/cts.70368 40994257  Funding:  Study Highlights  What is the current knowledge on the topic? ○ Triple‐negative breast cancer (TNBC) is an aggressive subtype with limited therapeutic options. Exosomes play key roles in intercellular communication and tumor progression, but their prognostic significance in TNBC remains poorly understood. Existing biomarkers for TNBC stratification and immunotherapy response prediction are insufficient. What question did this study address? ○ This study aimed to identify an exosome‐derived gene signature (EDPS) for TNBC prognosis and immunotherapy response prediction by integrating single‐cell and bulk transcriptomics, addressing the gap in exosome‐related biomarkers for clinical decision‐making. What does this study add to our knowledge? ○ We developed a 6‐gene EDPS (FOSB, CYC1, EIF4EBP1, HMGB2, KPNA2, GBP1) that stratifies TNBC patients into high‐ and low‐risk groups with distinct survival outcomes. The EDPS correlates with immune‐active microenvironments (e.g., enriched NK cell cytotoxicity in low‐risk patients) and predicts immunotherapy sensitivity (lower TIDE scores, higher checkpoint expression). Notably, high‐risk patients show metabolic dysregulation and poorer responses to immunotherapy. How might this change clinical pharmacology or translational science? ○ The EDPS provides a novel tool for TNBC prognosis and immunotherapy stratification, potentially guiding personalized treatment. Its association with exosome biology and immune pathways offers insights into therapeutic targeting of exosome‐mediated crosstalk. Future validation could integrate EDPS into clinical trials for precision oncology. 1 Introduction Triple‐negative breast cancer (TNBC) is a subtype of breast cancer characterized by the absence of estrogen receptors, progesterone receptors, and human epidermal growth factor receptor 2 (HER2). This aggressive cancer subtype represents about 15%–20% of all breast cancer cases and is linked to a significantly worse prognosis compared to other types, highlighting its aggressive nature [ 1 2 3 1 4 Exosomes, a specific type of extracellular vesicle (EV), are tiny membrane‐bound vesicles released by various cell types and play a vital role in communication between cells and the exchange of materials [ 5 6 7 7 8 9 10 11 12 7 13 14 15 While direct exosome isolation was not performed in this study, we employed a comprehensive computational strategy to investigate ERG biology in TNBC. By leveraging scRNA‐seq data from TNBC samples and applying Weighted Gene Co‐expression Network Analysis (WGCNA), we systematically identified exosome activity‐correlated gene modules to establish an Exosome‐Derived Prognostic Signature (EDPS). This approach capitalizes on the strengths of single‐cell technology to resolve cellular heterogeneity within the tumor microenvironment while utilizing WGCNA to uncover clinically relevant gene networks. The integration of these advanced bioinformatic methods with validation in bulk RNA‐seq datasets (TCGA/METABRIC) provides a powerful framework for elucidating ERG‐mediated mechanisms without physical exosome isolation. Our methodology not only overcomes technical limitations associated with vesicle isolation but also enables robust correlation of ERG profiles with patient outcomes, potentially yielding novel biomarkers and therapeutic targets for this aggressive breast cancer subtype. 2 Materials and Methods 2.1 Data Set Acquisition and Processing The scRNA‐seq data were acquired from the GSE176078 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE176078 https://www.cbioportal.org/ https://exobcd.liumwei.org/ S1 16 2.2 Single‐Cell RNA The data of scRNA‐seq were processed using the “Seurat” package for cytoplasmic quality control and analysis. A total of 31,140 cells were included following the quality control standards, which involved several criteria: genes identified in fewer than three cells, a gene count per cell within the limits of 100–7500, unique molecular identifier (UMI) counts surpassing 1000, and mitochondrial gene representation below 10%. Subsequently, the scRNA‐seq data underwent normalization, and batch effects were addressed utilizing the R package “harmony”. We then identified the 2000 most variable genes and conducted principal component analysis (PCA). The leading 40 principal components were analyzed using T‐distributed stochastic neighbor embedding (t‐SNE) for clustering. Lastly, the “FindAllMarkers” function from the “Seurat” package was employed to pinpoint markers specific to each cluster. Note that scRNA‐seq data were derived from whole‐cell transcriptomes without physical exosome enrichment; ERG scores were subsequently calculated via ssGSEA as a proxy for exosome‐associated transcriptional activity. 2.3 Single Sample Gene Set Enrichment Analysis ( ssGSEA The ssGSEA is a frequently utilized method that assesses the activity status of specific gene sets within individual samples. In the present investigation, the ssGSEA technique was applied to determine the exosome score for each TNBC patient included in the TCGA cohort. Genes that displayed varying expression levels between cells characterized by high and low exosome scores were identified as being associated with exosome at the single‐cell transcriptomic level. 2.4 Weighted Co‐Expression Network Analysis ( WGCNA WGCNA serves as a powerful bioinformatics tool designed to cluster genes exhibiting high correlation into distinct modules while assessing their relationships with various phenotypic traits. In this study, we utilized WGCNA analysis to identify gene modules associated with the exosome score in the TCGA cohort. The ideal soft threshold was determined to ensure that gene interactions conformed most closely to a scale‐free distribution. A heat map illustrating the correlation between the module and its characteristics was created, and the most prominent module was selected based on the correlation coefficient and the significant p 2.5 Establishment and Validation of the Prognostic Signature The “limma” package was used to determine the differentially expressed genes (DEGs) in TNBC and normal tissues in the training cohort. The significant threshold was set at false discovery rate (FDR) < 0.05 and |log 2 2.6 Performance Evaluation of the EDPS In both the training and validation datasets, the “surv_cutpoint” function in “survminer” R package was used to determine the optimal cutoff point to divide TNBC patients into the high‐ and low‐risk groups. Subsequently, a Kaplan–Meier (KM) survival analysis was performed utilizing the R packages “survival” and “surviminer” to assess the prognostic relevance of the EDPS concerning overall survival (OS), employing the log‐rank test with a significance threshold set at p 2.7 Analysis of Immune Microenvironment To investigate the correlation between EDPS scores and the infiltration of immune cells, the CIBERSORT deconvolution algorithm was employed to measure the presence of 22 different immune cell types. Additionally, the immune score, stromal score, and ESTIMATE score for TNBC patients, derived from the ESTIMATE algorithm, were utilized to evaluate the presence of stromal cells and infiltrating immune cells within malignant tumors. Following this, variations in the activity of immune‐related pathways between the high‐EDPS and low‐EDPS subgroups were analyzed through the ssGSEA function available in the “GSVA” package, with the Wilcoxon rank‐sum test applied for statistical evaluation. 2.8 Therapeutic Response Analysis The Tumor Immune Dysfunction and Exclusion (TIDE) scoring system, which can be accessed via an online platform ( http://tide.dfci.harvard.edu/login/ 17 http://tcia.at/ To facilitate the customization of therapeutic regimens, we employed the “oncoPredict” package to assess the half maximal inhibitory concentration (IC50) of widely used antitumor agents and assess drug sensitivity across various risk categories. The disparities between the two groups were examined using the Wilcoxon signed‐rank test. 2.9 Functional Enrichment Analysis We employed the “limma” package to evaluate the DEGs between two EDPS groups, applying a selection criterion of (|FC| > 1.5 and FDR < 0.05). The enrichment analysis of DEGs was conducted within the frameworks of Gene Ontology (GO) and the Kyoto Encyclopedia of Genes and Genomes (KEGG), where signaling pathways exhibiting multiple testing p 2.10 Validation of Exosome Association for EDPS To assess the exosome association of our final signature genes, we analyzed their correlation with canonical exosome markers (CD63, CD9, CD81) in the TCGA dataset. 2.11 Cell Culture Normal human breast epithelial cell lines, specifically MCF‐10A, alongside TNBC cell lines such as MDA‐MB‐231 and MDA‐MB‐468, were obtained from Beijing Bena Biotechnology Co. (Beijing, China) for research purposes. All cell lines were cultured in DMEM F‐12 medium (Gibco, Waltham, MA, USA), supplemented with 10% fetal bovine serum (FBS) and 1% penicillin–streptomycin (10,000 U/mL penicillin and 10,000 μg/mL streptomycin). The cultures were maintained in a 5% CO2 incubator at 37°C to ensure optimal growth conditions. 2.12 Real‐Time Quantitative Polymerase Chain Reaction ( qPCR Total RNA extraction was performed from human normal breast cell lines and TNBC cell lines using TRIzol reagent (Takara, Japan). Following this, the extracted RNA was reverse transcribed into complementary DNA (cDNA) using the PrimeScript RT reagent kit (Takara, Japan), adhering to the manufacturer's guidelines. For gene expression analysis, RT‐qPCR was conducted utilizing TB Green Premix Ex Taq (Takara, Japan). GAPDH was employed as the housekeeping gene for normalization. Gene expression levels were quantified using the 2 −ΔCT 2.13 Statistical Analysis The statistical analyses were performed utilizing R version 4.4.1. For comparisons between two groups, either the t p 3 Results 3.1 Single Cell Sequencing Data Analysis We acquired scRNA‐seq data of 38,582 cells from 10 TNBC samples of TNBC patients through the GSE176078 1A 1B 1C FIGURE 1 Annotation of single‐cell data and exosome activity. (A) t‐SNE plot for descending cluster sorting. (B) Cellular annotations unveil nine distinct cell phenotypes. (C) Bubble plot of mean expression of marker genes for each cell type. (D) The exosome‐related gene score in each cell. (E) Comparison of exosome‐related gene scores of nine cell types. To investigate the expression patterns of ERGs, we assessed the exosome‐related gene score of individual cells through the application of ssGSEA (Figure 1D 1E 3.2 Screening for Module Genes Associated With Exosome Score by WGCNA TNBC Having identified epithelial cells as the primary source of exosome‐related signals in scRNA‐seq data (Figure 1 2A 2B 2C r p 2D 2 2E 2F S2 2G S3 2H 2H FIGURE 2 Screening for module genes associated with exosome score by WGCNA in TNBC. (A) The sample clustering plot to remove outlier samples. (B) The scale‐free fit index for various soft‐thresholding powers. (C) Genes are clustered into discrete modules. (D) The correlation between different modules and the exosome score. (E) The volcano plot of DEGs in the TCGA cohort. (F) The Venn diagram demonstrates the intersection of black‐module genes and DEGs. (G) Univariate Cox regression analyses for 19 exosome‐related prognostic DEGs on the TCGA dataset. (H) The frequency of CNV in the 19 prognostic genes. 3.3 Development of EDPS To develop an EDPS, these 19 genes were later incorporated into a machine learning framework for integration. To overcome the limitations of algorithm selection, we integrated 10 classical algorithms and 101 combinations to construct an EDPS in the TCGA cohort. Subsequently, we computed the C‐index for each model, assessing their performance in both the TCGA and METABRIC datasets (Figure 3A 3A FIGURE 3 Evaluation of the performance of EDPS in predicting clinical outcomes of TNBC patients. (A) The 101 machine learning combination algorithms for the average C‐index in the TCGA training cohort and the METABRIC validation cohort. (B, C) Kaplan–Meier curves of OS according to the EDPS in TCGA cohort (B) and METABRIC cohort (C). (D, E) Kaplan–Meier curves of DSS (D) and PFS (E) according to the EDPS in the TCGA cohort. (F, G) The AUC values for predicting 1‐, 3‐, and 5‐year OS in TCGA cohort (F) and METABRIC cohort (G). (H) Correlation of EDPS score and clinical traits. (I, J) Forest plot of multivariate Cox regression results in TCGA cohort (I) and METABRIC cohort (J). (I, J) Forest plot of univariate (I) and multivariate (J) Cox regression results in the TCGA cohort. 3.4 Evaluation of EDPS TNBC Patients classified within the high‐risk score category demonstrated markedly inferior OS when contrasted with individuals in the low‐risk score category, a finding substantiated by Kaplan–Meier survival analysis in both the TCGA and METABRIC cohorts (Figure 3B,C 3D,E 3F,G 3H 3I p 3J p 3.5 Potential Biological Functions and Pathways Related to the EDPS To delineate the differences between the two EDPS groups regarding gene functions and enrichment, DEGs were quantified and represented using a volcano plot and heatmap (Figure 4A,B 4C 4D 4E 4F 4G 4H FIGURE 4 Potential biological functions and pathways associated with the EDPS. (A) Volcano plot of differential analysis between high and low EDPS groups. (B) Heatmap of differential analysis between high and low EDPS groups. (C) GO enrichment analysis. (D) KEGG pathway analysis. (E, F) The top 5 most significantly enriched GO terms in the high EDPS group (E) and low EDPS group (F). (G, H) The top 5 most significantly enriched KEGG pathways in the high EDPS group (G) and low EDPS group (H). 3.6 Differences in TME EDPS To identify the variations in the immunological microenvironments of the two groups, we analyzed the TME characteristics of the two EDPS groups. The results indicated that Immune, Stromal, and ESTIMATE scores were notably diminished in high‐risk ones (Figure 5A p 5B–E 5F 5G FIGURE 5 Differences in TME between two EDPS groups. (A) Violin plot demonstrating differences in TME scores between two EDPS groups. (B–E) The scatterplots showing the relevance between the EDPS score and the infiltration of immune cells based on CIBERSORT. (F) Box plot of the difference in immune cell infiltration between the two EDPS groups based on ssGSEA. (G) Heatmap of immune‐related pathways in the two EDPS groups. 3.7 The Relationship Between EDPS To comprehensively evaluate the impact of the EDPS in the context of TNBC immunotherapy, a systematic analysis was undertaken. An increase in the TIDE score correlates with a heightened susceptibility to immune evasion, implying a potentially diminished efficacy of immunotherapy. The analysis revealed that individuals within the high EDPS score category exhibited significantly elevated TIDE scores when compared to those classified as low‐risk ( p 6A 6B,C 6D 18 6E p 19 6F p 6G p p 6H FIGURE 6 The relationship between EDPS and immunotherapy response. (A) Differences in TIDE scores in high‐ and low‐EDPS groups in TCGA‐LUAD. (B–D) Sensitivity of high‐ and low‐EDPS groups to combination therapy, anti‐PDL1, and anti‐CTLA4 by different EDPS scores. (E) The level of immune checkpoints in different EDPS score groups. (F) The TMB levels between the high‐ and low‐EDPS groups. (G) The Kaplan–Meier curve for OS in the high‐and low‐TMB groups. (H) The Kaplan–Meier curve for OS based on the EDPS score and the TMB score. 3.8 Efficacy of Chemotherapy Prediction of Candidate Drugs for Patients With High‐ and Low‐ EDPS To evaluate the drugs that may have a beneficial impact in relation to the EDPS score, we explored chemotherapeutic agents utilizing the “oncoPredict” package. The results indicated significantly lower IC50 values for cisplatin, paclitaxel, fulvestrant, axitinib, savolitinib, crizotinib, olaparib, and ruxolitinib in the high‐EDPS group, indicating that conventional chemotherapy drugs, estrogen receptor inhibitors, tyrosine kinase inhibitors (TKI), and PARP inhibitors might demonstrate improved therapeutic efficacy in the low‐EDPS group (Figure 7A–H FIGURE 7 Evaluation of chemotherapy and targeted therapy responses. (A–H) Differences in the estimated IC50 for 8 agents commonly used between the high‐and low‐EDPS groups. 3.9 Validation of Exosome Association for Signature Genes To assess the relationship between our final signature genes and exosome biology, we performed validation analysis. The results showed that all EDPS genes showed a significant positive correlation with exosome secretion markers CD63 ( p p S1 3.10 Relative Expression of EDPS To investigate the expression profiles of genes included in the EDPS, we assessed the expression levels of six specific genes in three different cell lines: one normal breast cell line (MCF‐10A) and two TNBC cell lines (MDA‐MB‐231 and MDA‐MB‐468). Using RT‐qPCR, we found that the expression of CYC1, EIF4EBP1, HMGB2, KPNA2, and GBP1 was significantly upregulated in both MDA‐MB‐231 and MDA‐MB‐468 cell lines compared to the normal MCF‐10A cells ( p 8 p 8 FIGURE 8 Validation of the expression of six EDPS genes by RT‐qPCR. NS, not statistically significant, * p p p 4 Discussion TNBC is a highly aggressive subtype of breast cancer characterized by the absence of ERs, PRs, and HER2. Treating TNBC is especially challenging due to its diverse nature and the lack of targeted therapies. Therefore, finding reliable biomarkers that can predict prognosis and therapeutic responses is essential for improving patient outcomes. This study investigates the role of ERGs in enhancing our understanding of TNBC phenotypes, potentially paving the way for more efficient therapeutic approaches. By combining scRNA seq data with bulk transcriptome analysis, we identified a strong ERG signature that correlates with patient survival outcomes. The use of machine learning techniques further confirmed the predictive capability of this signature across various patient cohorts. Our results indicate that patients with high ERG scores have significantly worse OS and DSS compared to those with lower scores, underscoring the clinical importance of ERGs in classifying TNBC patients. This research not only clarifies the clinical relevance of ERGs in TNBC but also highlights their potential role in informing personalized treatment approaches for this difficult‐to‐treat disease. The study identified six key genes within the EDPS that are essential for understanding the prognosis of TNBC. FOSB, a member of the AP‐1 transcription factor complex, plays a dual role in TNBC progression. Recent studies demonstrate that FOSB is epigenetically silenced by EZH2‐mediated H3K27me3 in TNBC, and its reactivation inhibits tumor growth by activating the p53 pathway [ 20 21 20 22 23 24 25 25 26 HMGB2 emerges as a critical regulator in TNBC progression through multiple mechanisms. It promotes tumor growth by reprogramming cancer metabolism through upregulation of LDHB and suppression of FBP1, enhancing the Warburg effect [ 27 28 29 30 31 31 30 32 33 34 35 36 37 While our EDPS originated from exosome‐related genes, it is important to note that the final signature primarily reflects prognostic value rather than direct exosome biology. The immune‐related pathways enriched in our analysis (e.g., NK cell‐mediated cytotoxicity) likely result from the prognostic selection process, which inherently favored genes associated with tumor‐immune interactions. However, three of the six signature genes have established roles in both exosome biology and cancer progression, suggesting potential dual functions. For instance, KPNA2—a key component of our EDPS—has recently been identified in tumor‐derived exosomes from bladder cancer, where it activates fibroblasts to create a pro‐tumor microenvironment via IL‐6 secretion [ 38 The analysis of enriched pathways highlighted significant differences between the high‐ and low‐risk EDPS groups in terms of biological pathways. The low EDPS group showed a strong association with pathways related to natural killer (NK) cell‐mediated immunity and antigen processing and presentation, which suggests that immune responses may play a crucial role in this subgroup. These pathways are essential for activating and regulating immune cells, particularly in tumor surveillance and elimination, indicating that patients with low EDPS might have a heightened immune response against tumor cells. In contrast, the high EDPS group was associated with pathways linked to ribosome function and metabolic processes, suggesting a potential shift towards increased cellular proliferation and metabolic adaptation in this subgroup. This contrast in pathway enrichment highlights the complexity of TNBC biology, where mechanisms of immune evasion may be more pronounced in the high EDPS group, potentially resulting in worse clinical outcomes. The findings from this study underscore the significance of exosome activity in influencing immune responses in TNBC, indicating that targeting these pathways could lead to innovative therapeutic strategies aimed at boosting anti‐tumor immunity and enhancing patient prognosis. By understanding these distinct biological pathways, we not only expand our knowledge of TNBC but also pave the way for future research focused on developing targeted therapies that harness the immune system's potential against cancer. The analysis of the immune microenvironment in TNBC demonstrated noteworthy disparities between high and low EDPS groups. Our findings show that patients in the low EDPS group exhibit markedly elevated levels of immune cell infiltration, especially among critical immune populations like M1 macrophages and activated CD4+ T memory cells. The presence of immune cells, such as CD8+ T cells and M1 macrophages, is generally linked to better outcomes in cancer treatment because they are essential in driving anti‐tumor immunity [ 39 40 This study has several limitations that must be acknowledged. First, the EDPS was derived computationally from public databases rather than through direct isolation and characterization of TNBC‐derived exosomes. Second, while we incorporated single‐cell RNA‐seq data to provide cellular context, our prognostic model primarily relies on bulk RNA‐seq data, and the relatively small sample size may restrict the generalizability of the findings. The lack of wet‐lab validation for our computational predictions and the potential batch effects introduced by using multiple datasets represent additional constraints that warrant consideration. Despite these limitations, our integrative bioinformatic approach successfully established associations between exosome‐related genes and TNBC prognosis while providing insights into immunotherapy response. These findings offer a valuable framework for biomarker discovery in resource‐limited settings where direct exosome isolation may not be feasible. Future studies combining physical exosome purification with multi‐omics profiling in larger clinical cohorts will be essential to validate and extend these observations. Additionally, we acknowledge that bulk transcriptome measurements cannot distinguish between cytoplasmic and exosome‐associated RNA. While our signature shows prognostic value, further validation is needed to determine whether these genes' products are actually packaged into TNBC‐derived exosomes and whether their exosomal versus cellular localization has differential clinical implications. 5 Conclusions The results of this study underscore the critical role of EDPS in the context of TNBC, revealing how their differential expression across cell types can influence tumor biology and patient prognosis. The identification of a substantial number of exosome marker genes opens avenues for further exploration of their potential as biomarkers or therapeutic targets. Future studies should aim to elucidate the specific mechanisms by which EDPS influence tumor behavior and their potential utility in clinical applications. Overall, this research contributes to a deeper understanding of the complex interplay between cell types in TNBC and highlights the importance of exosomes in shaping tumor biology, paving the way for innovative therapeutic strategies targeting intercellular communication pathways. Author Contributions Y.Z., J.B., and Y.D. wrote the manuscript; Y.Z., J.B., and Y.D. designed the research; Y.Z., M.Z., L.H., and L.J. performed the research; Y.Z., J.B., and Y.D. analyzed the data. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Figure S1:  Table S1:  Table S2:  Table S3: Acknowledgments During manuscript preparation, the authors used Grammarly and ChatGPT solely for language editing and readability improvement. The authors carefully reviewed and edited all AI‐assisted content and assume full responsibility for the final manuscript's content and integrity. No AI tools were used for data analysis, interpretation, or scientific decision‐making. Data Availability Statement The datasets used and/or analyzed during the current study are available from the corresponding author upon reasonable request. References 1 P. Zagami L. A. Carey Triple Negative Breast Cancer: Pitfalls and Progress NPJ Breast Cancer 8 2022 95 10.1038/s41523-022-00468-0 35987766 PMC9392735 2 L. Jin C. Qin X. Qi T. Hong X. Yang X. Zhu Clinicopathological Significance of Sox10 Expression in Triple‐Negative Breast Carcinoma Translational Cancer Research 9 2020 5603 5613 10.21037/tcr-20-2634 35117924 PMC8797416 3 Q. E. Wen L. Li R. Q. Feng Recent Advances in Immunotherapy for Breast Cancer: A Review Breast Cancer (Dove Medical Press) 16 2024 497 516 10.2147/bctt.S482504 39220564 PMC11365501 4 F. Derakhshan J. S. Reis‐Filho Pathogenesis of Triple‐Negative Breast Cancer Annual Review of Pathology 17 2022 181 204 10.1146/annurev-pathol-042420-093238 PMC9231507 35073169 5 F. Ferrantelli V. Tirelli V. Barreca F. Manfredi Generation, Characterization, and Count of Fluorescent Extracellular Vesicles Methods in Molecular Biology 2504 2022 207 217 10.1007/978-1-0716-2341-1_15 35467289 6 M. Huang J. Ji X. Xu Known and Unknown: Exosome Secretion in Tumor Microenvironment Needs More Exploration Genes & Diseases 12 2025 101175 10.1016/j.gendis.2023.101175 39524543 PMC11550746 7 S. Alhajlah S. A. Jasim F. M. Altalbawy Exploring the Role of Exosomal lncRNA in Cancer Immunopathogenesis: Unraveling the Immune Response and EMT Pathways Experimental Cell Research 445 2024 114401 10.1016/j.yexcr.2024.114401 39740727 8 J. Cao B. Feng Y. Xv J. Yu S. Cao C. Ma Continued Attention: The Role of Exosomal Long Non‐Coding RNAs in Tumors Over the Past Three Years International Immunopharmacology 144 2025 113666 10.1016/j.intimp.2024.113666 39577219 9 F. M. Ibrahim R. O. Saleh H. Uinarni Exosomal Noncoding RNA (ncRNA) in Breast Cancer Pathogenesis and Therapy; Two Sides of the Same Coin Experimental Cell Research 444 2025 114359 10.1016/j.yexcr.2024.114359 39608481 10 A. Choudhury S. Chatterjee S. Dalui Breast Cancer Cell Derived Exosomes Reduces Glycolysis of Activated CD8 + T Cells in a AKT‐mTOR Dependent Manner Cell Biology International 49 2025 45 54 10.1002/cbin.12241 39285531 11 W. Ning J. Yang R. Ni Hypoxia Induced Cellular and Exosomal RPPH1 Promotes Breast Cancer Angiogenesis and Metastasis Through Stabilizing the IGF2BP2/FGFR2 Axis Oncogene 44 2024 147 164 10.1038/s41388-024-03213-y 39496940 12 M. Chen Z. Fu C. Wu Tumor‐Derived Exosomal ICAM1 Promotes Bone Metastasis of Triple‐Negative Breast Cancer by Inducing CD8+ T Cell Exhaustion International Journal of Biochemistry & Cell Biology 175 2024 106637 10.1016/j.biocel.2024.106637 39147124 13 Y. Chen F. Cui X. Wu W. Zhao Q. Xia The Expression and Clinical Significance of Serum Exosomal‐Long Non‐Coding RNA DLEU1 in Patients With Cervical Cancer Annals of Medicine 57 2025 2442537 10.1080/07853890.2024.2442537 39687982 PMC11654034 14 M. Linares‐Rodríguez I. Blancas F. Rodríguez‐Serrano The Predictive Value of Blood‐Derived Exosomal miRNAs as Biomarkers in Breast Cancer: A Systematic Review Clinical Breast Cancer 25 2025 e48 e55 10.1016/j.clbc.2024.06.016 39054208 15 M. A. Subhan V. P. Torchilin Advances in siRNA Drug Delivery Strategies for Targeted TNBC Therapy Bioengineering (Basel, Switzerland) 11 2024 830 10.3390/bioengineering11080830 39199788 PMC11351222 16 X. Wang Z. Chai G. Pan ExoBCD: A Comprehensive Database for Exosomal Biomarker Discovery in Breast Cancer Briefings in Bioinformatics 22 2021 bbaa088 10.1093/bib/bbaa088 32591816 17 P. Jiang S. Gu D. Pan Signatures of T Cell Dysfunction and Exclusion Predict Cancer Immunotherapy Response Nature Medicine 24 2018 1550 1558 10.1038/s41591-018-0136-1 PMC6487502 30127393 18 A. Lin W. H. Yan HLA‐G/ILTs Targeted Solid Cancer Immunotherapy: Opportunities and Challenges Frontiers in Immunology 12 2021 698677 10.3389/fimmu.2021.698677 34276691 PMC8278316 19 M. Palmeri J. Mehnert A. W. Silk Real‐World Application of Tumor Mutational Burden‐High (TMB‐High) and Microsatellite Instability (MSI) Confirms Their Utility as Immunotherapy Biomarkers ESMO Open 7 2022 100336 10.1016/j.esmoop.2021.100336 34953399 PMC8717431 20 R. Zhang X. Li Z. Liu Y. Wang H. Zhang H. Xu EZH2 Inhibitors‐Mediated Epigenetic Reactivation of FOSB Inhibits Triple‐Negative Breast Cancer Progress Cancer Cell International 20 2020 175 10.1186/s12935-020-01260-5 32477007 PMC7236314 21 C. H. Ting Y. C. Chen C. J. Wu J. Y. Chen Targeting FOSB With a Cationic Antimicrobial Peptide, TP4, for Treatment of Triple‐Negative Breast Cancer Oncotarget 7 2016 40329 40347 10.18632/oncotarget.9612 27248170 PMC5130011 22 A. Sato K. Takagi Y. Miki Cytochrome c1 as a Favorable Prognostic Marker in Estrogen Receptor‐Positive Breast Carcinoma Histology and Histopathology 34 2019 1365 1375 10.14670/hh-18-130 31149728 23 M. Chishiki K. Takagi A. Sato Cytochrome c1 in Ductal Carcinoma In Situ of Breast Associated With Proliferation and Comedo Necrosis Cancer Science 108 2017 1510 1519 10.1111/cas.13251 28394473 PMC5497933 24 Y. Han S. Sun M. Zhao CYC1 Predicts Poor Prognosis in Patients With Breast Cancer Disease Markers 2016 2016 3528064 10.1155/2016/3528064 27239088 PMC4864557 25 E. D. Nelson M. G. Benesch R. Wu T. Ishikawa K. Takabe High EIF4EBP1 Expression Reflects mTOR Pathway Activity and Cancer Cell Proliferation and Is a Biomarker for Poor Breast Cancer Prognosis American Journal of Cancer Research 14 2024 227 242 10.62347/mtsd6746 38323277 PMC10839327 26 S. Yang T. L. Hui H. Q. Wang High Expression of Autophagy‐Related Gene EIF4EBP1 Could Promote Tamoxifen Resistance and Predict Poor Prognosis in Breast Cancer World Journal of Clinical Cases 11 2023 4788 4799 10.12998/wjcc.v11.i20.4788 37583983 PMC10424051 27 D. Fu J. Li J. Wei HMGB2 Is Associated With Malignancy and Regulates Warburg Effect by Targeting LDHB and FBP1 in Breast Cancer Cell Communication and Signaling: CCS 16 2018 8 10.1186/s12964-018-0219-0 29463261 PMC5819211 28 A. M. Redmond C. Byrne F. T. Bane Genomic Interaction Between ER and HMGB2 Identifies DDX18 as a Novel Driver of Endocrine Resistance in Breast Cancer Cells Oncogene 34 2015 3871 3880 10.1038/onc.2014.323 25284587 29 Q. Liu W. Xiong LINC00534 Promotes Breast Cancer Progression by Targeting the miR‐139‐5p/HMGB2 Axis Discover Oncology 16 2025 655 10.1007/s12672-025-02483-6 40314851 PMC12048369 30 T. L. Yang C. H. Tsai Y. W. Su Combining KPNA2 and FOXM1 Expression as Prognostic Markers and Therapeutic Targets in Hormone Receptor‐Positive, HER2‐Negative Breast Cancer Cancers (Basel) 17 2025 671 10.3390/cancers17040671 40002266 PMC11853725 31 M. Duan F. Hu D. Li S. Wu N. Peng Silencing KPNA2 Inhibits IL‐6‐Induced Breast Cancer Exacerbation by Blocking NF‐κB Signaling and c‐Myc Nuclear Translocation In Vitro Life Sciences 253 2020 117736 10.1016/j.lfs.2020.117736 32360571 32 H. Wang Y. Cao L. Zhang Q. Zhao S. Li D. Li RBM15 Drives Breast Cancer Cell Progression and Immune Escape via m6A‐Dependent Stabilization of KPNA2 mRNA Clinical Breast Cancer 25 2025 96 107 10.1016/j.clbc.2024.09.006 39488447 33 A. Ma M. Tang L. Zhang USP1 Inhibition Destabilizes KPNA2 and Suppresses Breast Cancer Metastasis Oncogene 38 2019 2405 2419 10.1038/s41388-018-0590-8 30531833 34 D. A. M. Mustafa R. M. S. M. Pedrosa M. Smid T Lymphocytes Facilitate Brain Metastasis of Breast Cancer by Inducing Guanylate‐Binding Protein 1 Expression Acta Neuropathologica 135 2018 581 599 10.1007/s00401-018-1806-2 29350274 PMC5978929 35 M. Quintero D. Adamoski L. M. Reis Guanylate‐Binding Protein‐1 Is a Potential New Therapeutic Target for Triple‐Negative Breast Cancer BMC Cancer 17 2017 727 10.1186/s12885-017-3726-2 29115931 PMC5688804 36 Y. Liu Z. Wu J. Lin Z. Wang Correlation Between the Risk of Lymph Node Metastasis and the Expression of GBP1 in Breast Cancer Patients Pakistan Journal of Medical Sciences 40 2024 159 164 10.12669/pjms.40.1.8251 38196488 PMC10772427 37 E. N. Hunt J. P. Kopacz D. J. Vestal Unraveling the Role of Guanylate‐Binding Proteins (GBPs) in Breast Cancer: A Comprehensive Literature Review and New Data on Prognosis in Breast Cancer Subtypes Cancers 14 2022 2794 10.3390/cancers14112794 35681772 PMC9179834 38 C. Yin C. Liufu S. Ye Tumor‐Derived Exosomal KPNA2 Activates Fibroblasts and Interacts With KIFC1 to Promote Bladder Cancer Progression, a Process Inhibited by miR‐26b‐5p Cellular & Molecular Biology Letters 30 2025 20 10.1186/s11658-025-00687-w 39956902 PMC11830183 39 B. Liu Z. Liu C. Gao Relationship Between CD8+ T Cells and Prognosis of Esophageal Cancer Patients: A Systematic Review and Meta‐Analysis Molecular Biotechnology 66 2024 138 150 10.1007/s12033-023-00733-y 37060513 40 Z. Zhao X. Ma Z. Cai The Potential Role of CD8+ Cytotoxic T Lymphocytes and One Branch Connected With Tissue‐Resident Memory in Non‐Luminal Breast Cancer PeerJ 12 2024 e17667 10.7717/peerj.17667 39006029 PMC11246025 ",
  "metadata": {
    "Title of this paper": "The Potential Role of CD8+ Cytotoxic T Lymphocytes and One Branch Connected With Tissue‐Resident Memory in Non‐Luminal Breast Cancer",
    "Journal it was published in:": "Clinical and Translational Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12461108/"
  }
}