{
  "title": "Paper_1088",
  "abstract": "pmc Beilstein J Nanotechnol Beilstein J Nanotechnol 1445 bjnano Beilstein Journal of Nanotechnology 2190-4286 Beilstein-Institut PMC12477904 PMC12477904.1 12477904 12477904 41031324 10.3762/bjnano.16.116 1 Review Nanoscience Nanotechnology Prospects of nanotechnology and natural products for cancer and immunotherapy Santos Jan Filipe Andrade https://orcid.org/0009-0006-2573-5566 janfilipe21@academico.ufs.br 1 2 Brasileiro Marcela Bernardes https://orcid.org/0009-0007-8828-6590 marcelabrasileiro@academico.ufs.br 1 2 Barreto Pamela Danielle Cavalcante pamela.danielle@academico.ufs.br 1 2 Rocha Ligiane Aranha Ligiane2004@academico.ufs.com.br 1 2 Júnior José Adão Carvalho Nascimento https://orcid.org/0000-0001-8243-5849 adaocarv95@gmail.com 1 2 3 Dourado Douglas Guest Editor  1 Department of Pharmacy, Federal University of Sergipe, São Cristóvão, Brazil https://ror.org/028ka0n85 https://www.isni.org/isni/0000000122856801  2 Laboratório de Ensaios Farmacêuticos e Toxicidade, Federal University of Sergipe, São Cristóvão, Brazil https://ror.org/028ka0n85 https://www.isni.org/isni/0000000122856801  3 Postgraduate Program in Health Sciences, Federal University of Sergipe, Aracaju, Sergipe, Brazil https://ror.org/028ka0n85 https://www.isni.org/isni/0000000122856801 2025 22 9 2025 16 478668 1644 1667 10.3762/bjnano.16.116 12 4 2025 19 8 2025 22 09 2025 30 09 2025 01 10 2025 Copyright © 2025, Santos et al. 2025 Santos et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article licensed under the terms of the Beilstein-Institut Open Access License Agreement ( https://www.beilstein-journals.org/bjnano/terms/terms https://creativecommons.org/licenses/by/4.0 Nanotechnology is revolutionizing pharmaceutical industry and drug development by providing significant advantages in controlling drug release, enhancing stability, and reducing adverse effects. Concurrently, natural products are being extensively researched for their anticancer and immunomodulatory properties. This patent review aims to analyze publications that integrate nanotechnology with natural products to develop cancer treatments and immunotherapies. In this context, 17 patents were identified through the free online databases of the European Patent Office (EPO) and the World Intellectual Property Organization (WIPO). The review discusses various types of nanotechnology, including nanoparticles, nanocarriers, and nanocapsules, as well as bioactive compounds primarily extracted from plants. Among the most frequently identified natural products were ursolic acid, hyaluronic acid, and catechins. These bioactive compounds have been shown to promote cell cycle arrest, reduce tumor size, and exhibit synergistic effects with other anticancer agents. Consequently, the combination of natural products with nanotechnology holds significant therapeutic potential. cancer immunotherapy nanotechnology natural products patent review Coordenação de Aperfeiçoamento de Pessoal de Nível Superior https://doi.org/10.13039/501100002322 Finance Code 001 This study was financed in part by the Coordenação de Aperfeiçoamento de Pessoal de Nível Superior – Brasil (CAPES) – Finance Code 001. The authors thank CAPES, CNPq and FAPITEC/SE for their financial support. All costs related to the publication of this open access article were entirely funded by the Beilstein-Institut. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes This article is part of the thematic issue \"Advances in nanotechnology applied to natural products\". Introduction Cancer is a disease characterized by the uncontrolled proliferation of abnormal cells, which have the ability to invade neighboring tissues and to metastasize to distant organs [ 1 Figure 1 2 3 4 Figure 1 Pathophysiology of Cancer and Emerging Therapeutic Innovations. Graphical element Watercolor Illustration of a Pin: ©irasutoya via Canva.com; Graphical element Genetic Mutation Vector Icon D: ©123stock via Canva.com; Graphical element Cancer cells vector illustration: ©faridyulian via Canva.com; Graphical element cancer cell growth. cancer disease: ©surachet99 via Canva.com; Graphical element treatment outline icon: ©tulpahn via Canva.com; Graphical element Molecule Icon: ©rendicon via Canva.com; Graphical element Plant Leaves Icon: ©sirvectorr via Canva.com; Graphical element Infographic Table: ©creative-visionery via Canva.com; Graphical element Check list icon. Revision icon: ©vitaliikrasnoselskyi via Canva.com. These elements are not subject to CC BY 4.0. The immune system is crucial for identifying and eliminating tumor cells. This highly specialized network includes cells such as T lymphocytes, dendritic cells, macrophages, and natural killer (NK) cells, as well as soluble mediators like cytokines and chemokines, which regulate inflammatory and adaptive responses [ 5 6 7 8 Immunotherapy shows promise as a cancer treatment approach, encompassing strategies such as monoclonal antibodies, immune checkpoint inhibitors, antitumor vaccines, and cell-based therapies, including chimeric antigen receptor T (CAR-T) cells [ 9 10 12 13 14 14 15 Nanotechnology has emerged as an innovative solution to overcome the limitations of traditional therapies. Advances in cancer nanotechnology include the development of smart nanocarriers capable of responding to internal stimuli (such as pH, redox potential, and enzymes) and external stimuli (such as magnetic fields, heat, or ultrasound), enabling precise and controlled drug release [ 16 17 18 19 20 21 19 Nevertheless, nanotechnology opens up unprecedented opportunities in cancer immunotherapy by facilitating the co-delivery of chemotherapeutic agents, immunomodulators, and gene editing tools [ 22 23 24 25 Unlike conventional literature reviews, this study employs a technology foresight approach based on patent analysis to provide a strategic overview of emerging trends in the application of nanotechnology to natural products for cancer treatment and immunotherapy. This method allows for the identification of innovation gaps, technological barriers, and commercial opportunities, generating insights that are often overlooked in academic publications. The study systematically maps and analyzes recent patents focused on the integration of nanotechnology platforms with natural bioactive compounds in oncology and immunotherapy, highlighting technological progress and, at the same time, revealing current limitations, future directions, and perspectives for the development of effective and scalable therapeutic strategies. Methods In this patent review, the free online databases of the European Patent Office (EPO) and the World Intellectual Property Organization (WIPO) were used to carry out the search using the descriptors “nano* AND cancer AND natural product” for research associated with cancer treatment, while the descriptors “nano* AND immun* AND natural product” was implemented to analyze patents related to immunotherapy. Furthermore, a time filter was applied to both surveys, with patents collected from 2016 to 2024. Given that both databases are well established and widely recognized in the field of intellectual property, and to avoid significant data duplication, we considered their inclusion sufficient for the scope of this review. In view of the subject matter addressed, the IPC classification was not used, since the search criteria implemented provided patents from different IPCs that were related to the topic addressed in the review. Also, PCT (Patent Cooperation Treaty) applications were considered, as can be seen in the inclusion of patent WO2016178224. This initial search identified 240 preliminary patents, of which 90 were excluded as duplicates. After reading the title and abstract, 106 documents were excluded due to their content being different from the focus of the review (nanotechnology formulations containing natural products for cancer treatment and immunotherapy). Subsequently, four were excluded for not having full text available. Additionally, 23 patents were eliminated for being outside the scope of the review. Finally, 17 patents were selected for critical analysis according to the objective of the study. Figure 2 Figure 2 Guidelines of screening and search used in this review. Results and Discussion Researching and screening of selected patents Based on the review criteria, the 17 selected patents were initially classified by their year of publication, covering the period from 2016 to 2024. In the first year, one document was published, a figure that remained consistent until 2021, when there was a decline, with no documents published that year. This decline can be attributed to the global impact of the COVID-19 pandemic, which began in 2020 and redirected research activities toward combating the virus. The pandemic particularly affected countries such as the United States of America and China, two major contributors to immunotherapy, related cancer research and patent production, potentially delaying research progress and patent filings. A strong recovery is evident in 2022 and 2023, with five patents published each year, suggesting a resumption of research efforts and innovation following the pandemic-induced slowdown. In 2024, the number of patents dropped again to one, although it is important to consider that data for this year may be incomplete or still in progress, especially considering the waiting time until a patent is published in the databases [ 26 Figure 3A Figure 3 (A) Distribution of patents by publication year. (B) Distribution of patents by application country (CN: China; KR: Korea of Republic; US: United States of America; WO: World Intellectual Property Organization); (C) Distribution of patents by type of applicants. Figure 3B https://www.mapchart.net/ https://creativecommons.org/licenses/by-sa/4.0/ These results may be related to the necessity of improving treatments for health issues such as cancer. Conventional treatments like chemotherapy and radiotherapy are highly cytotoxic and nonspecific, affecting both cancerous and healthy cells. Consequently, the scientific community is seeking alternatives, one of which is the use of nanotechnology in combination with other treatments. The advent of nanotechnology has revolutionized both diagnosis and treatment, enhancing factors such as bioavailability and stability, while also reducing toxicity [ 27 China (CN) leads the ranking of published inventions with 14 documents, followed by the World Intellectual Property Organization (WO), the Republic of Korea (KR), and the United States of America (USA), each with one patent ( Figure 3B 28 29 US and the Republic of Korea also have economic incentives for biotechnology research and innovation, with the US investing over 3% of its GDP in research and development and Korea allocating approximately 4.5% of its GDP to research and development [ 30 In terms of protecting their inventions, various entities, including universities, industries, and research institutes, file for the publication of their patents. The results indicate eleven patents registered by universities such as Fuzhou University (CN), South China University of Technology (CN), Sun Yat-sen University (CN), Kyung Hee University (KR), King Abdulaziz University (US), Guizhou University of Traditional Chinese Medicine (CN), Hebei University of Technology (CN), China Three Gorges University (CN), China Pharmaceutical University (CN), South China Normal University (CN), and Sichuan University (CN). Additionally, research institutes such as Harbin Institute of Technology (CN) and The Institute of Medicinal Plant Development (CN) have published around three patents; the industry is represented by a single patent from BG Negev Technologies & Applications Ltd (WO) ( Figure 3C The predominance of patents filed by universities in cancer research based on natural products certainly reflects the industry’s insecurity in investing in early-stage projects involving extraction, isolation, characterization, and reproducibility, as they are technically complex and costly, with little initial commercial appeal. Consequently, pharmaceutical companies tend to avoid these high-risk ventures and prefer to enter later, when the therapeutic application has already been proven, often through partnerships with universities. This trend also explains the two patents between universities and industry observed and why the industry filed only one patent [ 31 33 Figure 4 Figure 4 Type of technology present in the selected publications. The greater number of inventions based on nanoparticles can be attributed to the longer period over which this carrier system has been studied and utilized. Indeed, the scientific literature contains reports dating back to the early 2000s that describe the application of nanoparticles in cancer treatment [ 34 35 Following this analysis, polysaccharide nanoparticles have high biocompatibility and the ability to encapsulate therapeutic molecules, representing an alternative to the use of natural products [ 36 37 38 39 40 41 Nanotechnology, natural products, cancer, and immunotherapy Natural products are chemicals produced by living organisms such as microbes, marine organisms, animals, fungi, and plants. They are widely used as therapeutic agents to treat diseases and maintain health and wellness [ 42 43 45 The use of natural products in cancer treatment and immunotherapy is mainly represented by the use of certain classes of compounds. Among them are saponins, which can remodel the tumor microenvironment, polysaccharides, such as lentinan, which increase immune cell activity, and polyphenols that can modulate immune checkpoints, such as curcumin seen in patents CN111202719 and US240447339, and terpenoids with direct anticancer activity, such as paclitaxel, observed in patent CN111202719 [ 46 50 Moreover, natural products play a promising role in cancer treatment and immunotherapy. Their potential effects include tumor cell death, inhibition of proliferation, increased autophagy, and enhanced immune system response [ 51 52 Based on this, analyzing the bioactive compounds responsible for these effects, such as saponins, polysaccharides, flavonoids, and natural products from traditional Chinese medicine like baicalin and wogonin, which reverse the immunosuppressive environment of tumors [ 48 50 53 54 Therefore, the use of natural products for cancer treatment and immunotherapy formulation presents a promising option for the pharmaceutical industry. One of the main technologies implemented in pharmaceutical development for incorporating natural products in cancer and immunotherapy is nanotechnology, as it presents physicochemical benefits for drugs. Among the advantages, nanotechnology can eliminate the limitations of using bioactive compounds in cancer treatment formulations, leading to increased bioavailability and pharmacokinetics [ 55 56 58 59 Table 1 Figure 5 60 76 77 79 Table 1 Selected patents that use nanotechnology and natural products for cancer treatment and immunotherapy. Patent number Country/year of publication  nanotechnology/physico- a natural product biological activity in vitro and in vivo tests outcomes  WO2016178224 [ 60 WO/2016  polyssacharide nanoparticle hyaluronanic acid and alginate targeting and uptake by certain tumor cells, peptides, integrin receptors, growth factor receptors and antibodies in vitro cytotoxicity and antitumor efficacy were assessed using CT26 and MDA-MB-231 cancer cells; in vivo antitumor activity was evaluated in female athymic nude mice with MDA-MB-231 cells significantly reduced cell viability, reduced tumor size, low cardiotoxic effect and lower IC 50  US240447339 [ 61 US/2017  polymeric nanocapsule diindolylmethane and ellagic acid anticancer efficacy in vitro CAM model was used for pancreatic cancer cell implantation; additional in vitro tests were conducted with SUIT-2, colon, breast, ovarian, and bladder cancer cells Encapsulated forms inhibited cell viability by 50–70%, showing a significantly higher effect than unencapsulated forms. They also reduced tumor size and angiogenesis.  CN222367609 [ 62 CN/2017  carrier-free self-assembly nanoparticle epicatechin gallate, gallocatechin, epicatechin and procyanidin epicatechin gallate, gallocatechin and epicatechin: inhibitory activity on telomerase; procyanidin: inhibition effects on cancer cells and induced apoptosis mechanism in vitro cytotoxicity test, staining of dead living cells, cell migration detection and targeting test with MCF-7 cell strains better killing effect on breast cancer cells MCF-7 compared with the individual nanoparticles, effectively targeting breast cancer cells effect and inhibition of migration of breast cancer cells MCF-7  CN225561345 [ 63 CN/2018  nanodrug complex tannic acid, catechin, epigallocatechin or procyanidin remotion of free radicals in the body, resistance of oxidation, inflammation and cardiovascular diseases, preventing and treating cancers. in vitro survival rate test of MBA-MD-231 cells; in vivo test with mice inoculated with MBA-MD-231 tumors and with bone tumors significant inhibitory effect on cancer cells in vitro, tumor tracing effect, reduction of the tumor size, with inhibition of the growth of tumor cells, inhibitory effect on bone tumors  CN109846857 [ 64 CN/2019  carrier-free self-assembly nanoparticle sterol natural products like β-sitosterol, ergosterol or stigmasterol anticancer, and synergistic effects with photosensitizers in vivo effect with Balb-c female mice with 4T1 tumor cells; in vitro anticancer activity with murine 4T1 and human MCF-7 breast cancer cells increased phototoxicity compared to the single drug, and synergistic anticancer effects, with reduction of the tumor volume higher than the drugs alone  CN111202719 [ 65 CN/2020  carrier-free self-assembly nanoparticle ursolic acid and oleanolic acid effects in blocking cell cycles and in reducing tissue damage by chemotherapy in vitro release experiment: measured at 37 °C and pH 7.3 and 5.5; in vitro cell experiments with MCF-7 cells; in vivo antitumor with 4T1 tumor-bearing mice ursolic acid and paclitaxel achieved a synergistic effect by inhibiting MCF-7 cells growth, with a significantly higher effect than that of the single drug group and the single carrier group  CN114129571 [ 66 CN/2022  carrier-free self-assembly nanoparticle ursolic acid low toxicity, high efficiency, and multi-link regulated antitumor properties in vitro flow cytometry with HepG2 cells; in vivo mouse H22 liver cancer transplant tumor model synergistic anticancer effect superior to any single therapy, with increase of the water solubility and bioavailability of the drug  KR20220169108 [ 67 KR/2022  gold nanoparticle ginseng and black cumin extract black cumin: anticancer and antiproliferative activities in vitro test with AGS human gastric cancer cells and toxicity test with macrophage RAW264.7 and HaCaT cells no serious toxic effects and increased inhibitory activity against AGS cells compared to black cumin alone  CN367902299 [ 68 CN/2022  polymeric nanoparticle procyanidin inhibiting TMEM16A ion channels effect, promoting the inhibition of cancer in vivo test with L795 lung adenocarcinoma tumor model in BALB/c mice Good drug targeting and significantly reduced the tumor volumes compared to free drugs.  CN114470229 [ 69 CN/2022  carrier-free self-assembly nanoparticle ursolic acid increase of sensitivity of tumor cells to chemotherapy and synergistic effect in vitro cytotoxicity experiment with HepG2 cells, and in vitro cellular uptake experiment with LO2 cells and HepG2 cells A synergistic effect with sorafenib inhibited HepG2 cell proliferation and growth more effectively than individual drugs. It also improved targeting capability  CN115252560 [ 70 CN/2022  carrier-free self-assembly nanoparticle berberine, lonidamine and gambogic acid inhibition of respiratory chain complex, hexokinase 2, glycolysis, mitochondrial targeting, cytotoxicity and glutamine metabolism in vitro cytotoxicity and antitumor effect test with breast cancer cells 4T1 and normal human liver cells, hexokinase activity assay, determination of glutamine content, mitochondrial respiratory chain activity assay, and mitochondrial targeting ability The treatment exhibited low cytotoxicity, high biocompatibility, and selectivity, enhancing anticancer activity. It inhibited glycolysis, reduced glutamine levels, and decreased mitochondrial respiratory chain activity.  CN117064865 [ 71 CN/2023  carrier-free self-assembly nanoparticle ursolic acid inhibition of the differentiation of tumor cells, and immune-activating effect, with stimulation of cytokines in vitro antitumor HepG2 cells and flow cytometry 293T cells experiment; in vivo effect with Balb-c female mice with 4T1 tumor cells; in vitro anticancer activity with Mouse 4T1 and human MCF-7 breast cancer cells targeting gene knockout effect and killing effect on tumor cells  CN426774477 [ 72 CN/2023  polymeric nanoparticle astragalus polysaccharide antiviral, antitumor, anti-aging, anti-radiation, anti-stress, and antioxidant effects in vitro immune checkpoint inhibitor testing, NF-κB pathway blocking effect and cytotoxicity test with B16F10 tumor cells promotes delivery of PD-L1 antibodies, great immune checkpoint target effect, toxic and side effects reduced, immune activation effect improved, and synergistic effect achieved  CN115671277 [ 73 CN/2023  nanovaccine astragalus polysaccharide antiviral, antitumor, anti-aging, anti-radiation, anti-stress, and antioxidant effects flow cytometry with antibodies; in vitro BMDC maturation effect test; immunotherapeutic in vivo effect on mouse B16F10 melanoma model and mouse Lewis lung cancer model upregulation effect on the expression of co-stimulatory molecules, lower tumor size compared to the control group, treating tumor effect, activation of immune responses  CN427216811 [ 74 CN/2023  quantum dot nanoparticle berberine anti-inflammatiory, protection of the liver, improvement of immunity and antitumor activity in vitro cytotoxicity test with L929 cells and in vitro photothermal antitumor effect on LLC cells photothermal therapy effect and a chemotherapy effect under laser irradiation, efficiently killing LLC cells, having synergistic effect  CN115887415 [ 75 CN/2023  polymeric nanoparticle dehydro- inhibition of the growth, reproduction migration, transformation and cloning of tumor cells in vitro cytotoxicity and cellular uptake test with MCF-7 cells and MM-231 cells; in vivo tumor inhibition effect in female Balb/c mice with a breast cancer tumor (4T1 cell) model tumor cell growth inhibition effect better than that of free drugs, good targeting, promotion of release of the drug inside the cells, and slowing effect of the growth of tumor volume  CN117534780 [ 76 CN/2024  nanopolysaccharide nanoparticle chitin and β-1,3-ᴅ-glucan stimulate immune cells and improve its interaction with cell receptors in the body in vitro antitumor HepG2 cells experiment, immunoassay with RAW 264.7 macrophages significantly increased cell inhibition rate and immune-promoting effects on cells by increasing cytokines levels a Figure 5 Chemical structures of selected compounds. Source: Made by the authors using ChemDraw Professional 16.0. By analyzing the chemical structures of the natural compounds illustrated in Figure 5 80 82 83 85 86 88 89 91 Patents WO2016178224 and US240447339 show robust results, with solid data both in vitro and in vivo, suggesting high efficacy compared to the free drug and lower toxicity. Patents CN222367609 and CN225561345, although their results are limited to specific cell lines, also show good results in terms of targeting and tumor inhibition. Following this perspective, patents CN111202719, CN114470229, and CN115252560 represent advances in tumor therapy, since they combine cell cycle blockade and inhibition of metabolic pathways, which are considered complex cellular mechanisms. Nevertheless, patent CN109846857 stands out for combining the natural compound with photosensitizers, presenting a synergistic effect that is better than the isolated effect of the substances, with a methodology not seen in the others formulations. Finally, patents CN117064865, CN426774477, and CN115671277 combine immunotherapies containing immunomodulators and checkpoint inhibitors to achieve a synergistic effect and consequently expand the clinical potential of nanotechnology containing natural products. Patent KR20220169108 was discussed in the article published by Dhandapani et al., which addresses the synthesis, physicochemical characterization, and therapeutic evaluation of nanotechnology [ 92 93 94 Nanoparticles Nanoparticles are materials with at least one dimension ranging from 1 to 999 nm [ 95 96 97 98 In the context of cancer treatment, nanoparticles promote enhanced biocompatibility, reduced toxicity, and increased stability and permeability, which can help overcome challenges like multidrug resistance [ 23 99 100 101 102 27 Regarding the use of natural products, nanoparticles can increase the bioavailability, pharmacokinetics, and selectivity of compounds toward cancer cells, thereby improving their solubility and delivery [ 103 Carrier-free self-assembly nanoparticles Carrier-free self-assembly nanoparticles are formed spontaneously from the organization of active or natural compounds, without the presence of a carrier material or excipients. Their stability is due to the presence of intermolecular interactions, such as electrostatic forces, hydrogen bonding, π–π stacking, and hydrophobic interactions [ 104 105 However, carrier-free self-assembly nanoparticles may have some limitations, such as the limitation of natural products used, since the compounds must have properties that contribute to a stable formulation, difficulty in controlling physicochemical characteristics, such as particle size, which can affect reproducibility and scalability, and problems related to rapid clearance and interaction with non-target tissues, mainly due to the absence of a carrier substance [ 104 106 107 104 108 For example, patent CN114129571 (2022) describes the formation of metal–organic co-assembly nanoparticles without a carrier. The formulation contains sorafenib, a molecularly targeted anticancer drug, ursolic acid as an API, and iron ions. Ursolic acid, a naturally occurring pentacyclic triterpenoid, exhibits a variety of biological activities and potential health benefits, and it can be found in herbs, fruits, and traditional Chinese medicinal plants [ 109 110 111 112 113 114 66 Patent CN117064865 (2023) claims a nano bionic CRISPR/Cas9 drug co-assembly system to treat liver cancer. The technology is composed of ursolic acid as an API, a Cas9 ribonucleoprotein (RNP) complex that targets the PD-L1 gene, a cell-penetrating peptide, and a tumor cell membrane derived from HepG2 cells. Characterization of the nanoparticles showed that the nanocomplex was stabilized by hydrogen bonds, van der Waals forces, and hydrophobic forces. In addition, confocal microscopy, gene editing efficiency, MTT assay, and flow cytometry tests were carried out to observe the therapeutic activity of the technology. The results demonstrated that the nanoparticles increased targeting and internalization, had a knockout rate of 80%, and exhibited better inhibition of HepG2 cell proliferation compared to the individual components, revealing a synergistic activity for cancer treatment [ 71 Patent CN114470229 (2022) describes carrier-free double-drug self-assembled nanoparticles for treating liver cancer. This technology contains indocyanine green, a cell-penetrating peptide, a nucleic acid aptamer, sorafenib, and ursolic acid as an API at 4 mg·mL −1 69 115 117 Furthermore, nanoparticles containing antineoplastic drugs have demonstrated the ability to act against cancer. They do so by inhibiting the cell cycle, blocking the depolymerization of microtubules, and stimulating the development of reactive oxygen species (ROS) [ 118 119 72 Patent CN222367609 (2017) describes targeted amphiphilic nanoparticles composed lecithin, procyanidine, and doxorubicin condensated with epigallocatechin gallate in N Camellia sinensis C. sinensis C. assumica 120 121 122 123 62 Patent CN115252560 (2022) describes self-assembled nanoparticles composed of berberine, lonidamine, and gambogic acid in a 3:1:4 ratio, all acting as APIs, encapsulated with vitamin E polyethylene glycol succinate (VE-TPGS), an excipient, for stability. Berberis vulgaris B. aquifolium 124 125 126 This combination of drugs in the formulation yields multiple mechanisms against cancer. Berberine provides mitochondrial targeting, lonidamine inhibits hexokinase, and gambogic acid offers cytotoxicity. The nanoparticles showed inhibition of the proliferation of breast cancer cells, with lower cytotoxicity to normal liver cells compared to standard drug and free drug. This is due to the nanoparticles’ enhanced permeability and retention, which improves tumor-specific targeting. Mitochondrial membrane potential investigation using 2 μg·mL −1 70 Patent CN111202719 (2020) utilized a nanosystem containing ursolic acid and oleanolic acid, paclitaxel, curcumin, camptothecin, and polyvinyl alcohol as APIs and drug carriers, and methanol, ethanol, and acetone as solvents. Both nanoparticle systems exhibited high biocompatibility and low cytotoxicity to normal cells. Additionally, the results demonstrated the technology had a tumor inhibition greater than 70% in mice with a synergistic antitumor effect, significantly improved blood indicators compared to paclitaxel injection ( p 65 CN109846857 (2019) describes the development of a natural photosensitizer derived from chlorophyllin e6 (Ce6). Self-assembled nanoparticles containing sterol compounds, such as β-sitosterol, ergosterol, or stigmasterol, were employed to enhance the stability and bioavailability of the active ingredient. Ce6 has the ability to selectively accumulate in cancer cells, attributed to the increased metabolic activity and permeable vasculature of these cells compared to healthy ones. Upon absorption of light during photodynamic therapy, Ce6 generates ROS, causing damage to the cell membrane, proteins, and DNA of the cancer cells, ultimately leading to their destruction. Additionally, the ROS produced by Ce6 destroys the vascular layer surrounding the tumor, thereby inhibiting its continued growth and stimulating immune cells to recognize and target the mutated cells [ 127 128 129 27 64 130 133 Polymeric nanoparticles Polymeric nanoparticles are solid colloidal systems of synthetic or natural polymers, which can be organized in hollow, occluded, multilobed, and core–shell structures, depending on their thermodynamic and kinetic characteristics [ 130 27 131 132 133 Seeking a new pharmaceutical application for procyanidines (PCs) as APIs, the patent CN367902299 (2022) describes photo-thermally responsive PC-loaded polymeric nanoparticles designed to prevent and/or treat lung adenocarcinoma by inhibiting TMEM16A. TMEM16A is a calcium-activated chloride ion channel that appears to be a suitable biomarker and target for lung cancer treatment. PCs, also known as proanthocyanidin, are phenolic compounds of the flavonoid family and are a class of natural polymers formed by catechins and epicatechins [ 134 135 136 −1 68 Similarly, patent CN426774477 (2023) developed an immune checkpoint inhibitor nano-delivery system using natural polyphenols. The formulation contained sulfhydrylated hyaluronic acid (HA-SH), which acts as an adjuvant carrier, and epigallocatechin gallate (EGCG) as an API to form HA-EGCG, as well as manganin, FeCl 3 115 116 117 CN115887415 (2023) describes a methoxypoly(ethyleneglycol)-poly(lactic- co 127 137 75 Polysaccharide nanoparticles Polysaccharides are a class of polar polymers frequently employed in polymeric systems and nanotechnologies, including the creation of polysaccharide nanoparticles [ 28 138 139 140 141 For instance, patent WO2016178224 (2016) describes the development of anionic polysaccharide nanoparticles designed for the delivery of anionic small-molecule anticancer drugs. The formulation consists of anionic polymers, such as hyaluronic acid (HA), alginate (Alg), HA-sulfate, and Alg-sulfate, which acts as adjuvants for drug delivery, as well as anionic small-molecule drugs, including methotrexate (MTX) and doxorubicin (DOX), and divalent cations like calcium (Ca 2+ 142 143 60 CN117534780 (2024) uses chitosan–glucan nanopolysaccharide complexes (CGCs) obtained from fungi to prepare antitumor and immunomodulatory drugs, with chitosan–glucan being an API. Chitosan–glucan is a biopolymer complex composed of chitosan, a deacetylated derivative of chitin, and glucan, a polysaccharide commonly found in fungal cell walls, cereals, and seaweed. Chitosan possesses a combination of properties that include antioxidant and antitumor effect, giving it potential to prevent and/or treat cancer by stimulating apoptosis [ 144 + 145 −1 76 Gold nanoparticles Gold nanoparticles are nanometer-scale structures composed of a gold core with surface ligands, which can be structured into nanospheres, nanocages, nanorods, and nanoshells [ 146 147 148 149 150 151 152 The patent KR20220169108 (2022) claims that gold nanoparticles were developed using membrane vesicles from a Curtobacterium proimmune 89 90 67 Quantum dot nanoparticles Quantum dot nanoparticles are semiconductor structures smaller than typical nanoparticles, ranging from 2 to 10 nm in size. They are composed of heavy metal or inorganic material and exhibit fluorescent activity, making them commonly used for pharmaceutical applications [ 153 154 106 155 156 157 158 159 Bergenin (BER) is a natural compound extracted from cinnabar root. It has been combined with carbon quantum dots to treat lung cancer in the patent CN427216811 (2023). BER is a glycosidic derivative of hydroxybenzoic acid found in various plant families and species worldwide, with Bergenia purpurascens Ardisia japonica 160 161 162 163 64 65 74 75 127 129 137 164 175 Polymeric nanocapsules Polymeric nanocapsules (PNCs) are vesicular systems between 1 and 999 nm in size, composed of an internal oily reservoir surrounded by polymeric membranes, non-ionic surfactants, macromolecules, and phospholipids [ 176 177 178 179 180 132 181 182 183 However, PNCs face some challenges for therapeutic use, especially regarding the lack of methods for characterizing the shell, which is important for drug release, toxicity due to the use of organic solvents, the tendency to aggregate in aqueous media, and difficulties in sterilizing the formulation [ 184 185 186 The patent US240447339 (2017) involves the creation of PNCs. These PNCs utilized a range of bioactive compounds, such as diindolylmethane (DIM) and ellagic acid (EA), both as APIs, curcumin, green tea polyphenols, resveratrol, sulforaphane, and tocopherols. DIM is one of the main metabolites of indole-3-carbinol, found in cruciferous vegetables like broccoli, cauliflower, and cabbage; it exhibits antineoplastic properties such as suppression of cell proliferation, migration, and growth [ 187 188 189 191 61 Nanovaccines Nanovaccines (NVs) are composed of nanoparticles whose structure contains substances responsible for stimulating the host’s immune system [ 131 192 193 194 195 196 197 198 Patent CN115671277 (2023) describes a nanovaccine with the aim of offering an oncological treatment using astragalus polysaccharides as an adjuvant immune response stimulator and drug release promoter. This natural product has potential for anticancer activity, as it can be applied as an immune adjuvant, responsible for inhibiting tumor growth and increasing immune function [ 199 73 54 Nanodrug complexes Nanodrug complexes are nanometer-scale assemblies composed of two or more biomolecules, such as active compounds, antibodies, polymers, and polysaccharides, which exhibit unique biological properties [ 200 201 202 204 205 CN225561345 (2018) combines natural polyphenols that act as APIs (tannic acid, catechin, epigallocatechin, or procyanidine), bortezomib, and iron ions to form a traceable boric acid nanodrug complex for tumor tracing and treatment. Tannic acid, a polyphenolic compound consisting of gallic acid esterified to a glucose core, can be found in various plant sources such as grapes, Sicilian sumac leaves, tea, nuts, and oak bark [ 206 207 208 The nanodrug complex responds differently to human breast cancer cell lines (MBA-MD-231) based on the pH value, exhibiting stable release in the tumor microenvironment, which has a pH close to 6.5 (ensuring site-specific activation) and a significant inhibitory effect of up to 26.7%. When tested against mouse bone tumors, the BTZ/Ta Iron complex showed an obvious inhibitory effect without causing mice death, which can occur using high concentrations of bortezomib, and avoided damage caused by tumors on healthy bone tissue [ 63 Obstacles to using nanotechnology containing natural products in cancer treatment Between the idea of a new treatment and its commercialization, there are many obstacles to overcome. When it comes to complex diseases like cancer and technologies such as nanomedicine, there are even more challenges. Cancer is not a simple condition, it is a multifaceted combination involving genetic, molecular, and clinical profiles that vary for each patient. This instance alone can compromise the search for patients to participate in clinical trials. Patient recruitment for an ideal trial with significant results would require a large-scale random selection of people with identical disease parameters, necessitating an adapted clinical trial [ 209 210 The commercialization of a medicine also requires scale-up of production to an industrial level and sufficient stability for transportation and storage, which are not easily achieved with all nanotechnologies. This emerging field of therapeutic products still misses robust and well-developed regulatory guidelines from policy-making agencies [ 211 212 213 214 Despite US$24.5 billion being invested in research about cancer throughout the years of 2016–2020, its treatment remains at a high cost in development, production, and acquisition, which compromises patient care [ 215 216 217 218 219 220 221 Abraxane® is an albumin bonded with nanoparticles of paclitaxel, an alkaloid extracted and isolated from Taxus brevifolia 222 223 103 224 Conclusion In recent years, the demand for innovations that offer improved safety, fewer adverse effects, and greater efficacy in cancer treatments and immunotherapy has increased. In this way, the use of natural products has shown itself to be growing, associated with the implementation of nanotechnologies that seek to enhance the physicochemical properties of formulations. This review analyzed 17 patents for antineoplastic drugs where nanoparticles were the main technology utilized. The formulations developed were observed to promote tumor cell cycle blockage, inhibit metastasis and tumor growth, stimulate the immune system, and exhibit a synergistic effect with anticancer compounds. These formulations also demonstrated enhanced solubility, stability, and controlled drug release while reducing treatment risks. In conclusion, the combination of natural products and nanotechnology has great potential and offers substantial benefits for cancer treatment and immunotherapy. However, issues like high cost, environmental impacts, complex clinical trials, and unclear or inexistent regulations are obstacles for the successful development and commercialization of these therapies. The authors dedicate this article to the entire scientific community that fights for quality science. The authors would like to thank the contributors of Canva.com, which was used to create the Graphical Abstract: Graphical element Illustration Cancer Cells: © muttaqin-images via Canva.com; Graphical element radiation radioactive cancer: ©pepermpron via Canva.com; Graphical element 3D Isometric Flat Illustration: ©tarikvision via Canva.com; Graphical element Scalpel gradient icon: ©amethyststudio via Canva.com; Graphical element cancer cell growth. cancer disease: ©surachet99 via Canva.com; Graphical element Watercolor Illustration of a Pin: ©irasutoya via Canva.com; Graphical element cancer cell icon: ©xella92 via Canva.com; Graphical element Mortar 3D Illustration: ©permadicreative via Canva.com; Graphical element 3D Serum Bottle: ©yansone via Canva.com; Graphical element Syringe Treatment Injection Vaccines Vaccination Icon: ©photo3idea via Canva.com; Graphical element 3D blue sphere element: ©hartonocreativestudio via Canva.com; Graphical element 3D Half Sphere: ©agungamiansyah via Canva.com; Graphical element Yellow sphere 3d: ©tetiana-mykhailenko via Canva.com; Graphical element Thumb Down or Dislike Icon: ©prettygirll via Canva.com. These elements are not subject to CC BY 4.0. Data Availability Data sharing is not applicable as no new data was generated or analyzed in this study. 1 Brown J S Amend S R Austin R H Gatenby R A Hammarlund E U Pienta K J Mol Cancer Res 2023 21 1142 1147 10.1158/1541-7786.mcr-23-0411 37409952 PMC10618731 2 Kontomanolis E N Koutras A Syllaios A Schizas D Mastoraki A Garmpis N Diakosavvas M Angelou K Tsatsaris G Pagkalos A Anticancer Res 2020 40 6009 6015 10.21873/anticanres.14622 33109539 3 Bray F Laversanne M Sung H Ferlay J Siegel R L Soerjomataram I Jemal A Ca-Cancer J Clin 2024 74 229 263 10.3322/caac.21834 38572751 4 Baliu-Piqué M Pandiella A Ocana A Cancers 2020 12 3271 10.3390/cancers12113271 33167363 PMC7694303 5 Huntington N D Cursons J Rautela J Nat Rev Cancer 2020 20 437 454 10.1038/s41568-020-0272-z 32581320 6 Zeng Z Chew H Y Cruz J G Leggatt G R Wells J W Int J Mol Sci 2021 22 2907 10.3390/ijms22062907 33809369 PMC7999898 7 Labani-Motlagh A Ashja-Mahdavi M Loskog A Front Immunol 2020 11 940 10.3389/fimmu.2020.00940 32499786 PMC7243284 8 Zhang H Dai Z Wu W Wang Z Zhang N Zhang L Zeng W-J Liu Z Cheng Q J Exp Clin Cancer Res 2021 40 184 10.1186/s13046-021-01987-7 34088360 PMC8178863 9 Alard E Butnariu A-B Grillo M Kirkham C Zinovkin D A Newnham L Macciochi J Pranjol M Z I Cancers 2020 12 1826 10.3390/cancers12071826 32645977 PMC7408985 10 Tan S Li D Zhu X Biomed Pharmacother 2020 124 109821 10.1016/j.biopha.2020.109821 31962285 11 Bai R Chen N Li L Du N Bai L Lv Z Tian H Cui J Front Oncol 2020 10 1290 10.3389/fonc.2020.01290 32850400 PMC7425302 12 Rieth J Subramanian S Int J Mol Sci 2018 19 1340 10.3390/ijms19051340 29724044 PMC5983580 13 Naeem A Hu P Yang M Zhang J Liu Y Zhu W Zheng Q Molecules 2022 27 8367 10.3390/molecules27238367 36500466 PMC9737905 14 Nan Y Su H Zhou B Liu S Front Oncol 2023 12 1049888 10.3389/fonc.2022.1049888 36686745 PMC9846506 15 Singab A N B Amr K Elissawy A M Bioequiv Bioavailab Int J 2024 8 000226 10.23880/beba-16000226 16 Jin C Wang K Oppong-Gyebi A Hu J Int J Med Sci 2020 17 2964 2973 10.7150/ijms.49801 33173417 PMC7646098 17 Murugan B Sagadevan S Fatimah I Oh W-C Motalib Hossain M A Johan M R Nanotechnol Rev 2021 10 933 953 10.1515/ntrev-2021-0067 18 Azizi M Jahanban-Esfahlan R Samadian H Hamidi M Seidi K Dolatshahi-Pirouz A Yazdi A A Shavandi A Laurent S Be Omide Hagh M Mater Today Bio 2023 20 100672 10.1016/j.mtbio.2023.100672 PMC10232915 37273793 19 López‐Estévez A M Lapuhs P Pineiro‐Alonso L Alonso M J Adv Mater (Weinheim, Ger) 2024 36 14 2309355 10.1002/adma.202309355 38104275 20 Northwick A B Carlson E E Chem Res Toxicol 2025 38 7 14 10.1021/acs.chemrestox.4c00220 39772437 21 Pandit C Roy A Ghotekar S Khusro A Islam M N Emran T B Lam S E Khandaker M U Bradley D A J King Saud Univ, Sci 2022 34 3 101869 10.1016/j.jksus.2022.101869 22 Irvine D J Dane E L Nat Rev Immunol 2020 20 321 334 10.1038/s41577-019-0269-6 32005979 PMC7536618 23 Chen Y Zhou Q Jia Z Cheng N Zhang S Chen W Wang L Acta Pharm Sin B 2024 14 3834 3854 10.1016/j.apsb.2024.05.032 39309502 PMC11413684 24 Vieira I R S Conte-Junior C A Crit Rev Food Sci Nutr 2024 64 381 406 10.1080/10408398.2022.2106471 35938315 25 Hadkar V M Mohanty C Selvaraj C I RSC Adv 2024 14 25149 25173 10.1039/d4ra03911d 39139249 PMC11317881 26 World Intellectual Property Indicators 2022 World Intellectual Property Organization 10.34667/tind.47082 27 Gavas S Quazi S Karpiński T M Nanoscale Res Lett 2021 16 173 10.1186/s11671-021-03628-6 34866166 PMC8645667 28 Owens B Nature 2024 630 S2 S4 10.1038/d41586-024-01596-2 38840022 29 Li Q Di J Liu Q Front Public Health 2023 11 1087830 10.3389/fpubh.2023.1087830 36908409 PMC9995779 30 National Center for Science and Engineering Statistics (NCSES). U.S. R&D Totaled $892 Billion in 2022; Estimate for 2023 Indicates Further Increase to $940 Billion 24 6 2025 Available from: https://ncses.nsf.gov/pubs/nsf25327/ 31 Singh S B Martin G E McKittrick B Crowther J Fraenkel H Lunn C Bayne M Perkins J B Gullo V J Nat Prod 2024 87 1235 1245 10.1021/acs.jnatprod.4c00081 38554098 32 Cordell G A Natl Sci Rev 2022 9 nwac075 10.1093/nsr/nwac075 36523565 PMC9746679 33 Atanasov A G Zotchev S B Dirsch V M Orhan I E Banach M Rollinger J M Barreca D Weckwerth W Bauer R Bayer E A Nat Rev Drug Discovery 2021 20 200 216 10.1038/s41573-020-00114-z 33510482 PMC7841765 34 Davis M E Chen Z Shin D M Nat Rev Drug Discovery 2008 7 771 782 10.1038/nrd2614 18758474 35 Sakdiset P Okada A Todo H Sugibayashi K J Drug Delivery Sci Technol 2018 44 58 64 10.1016/j.jddst.2017.11.021 36 Plucinski A Lyu Z Schmidt B V K J J Mater Chem B 2021 9 7030 7062 10.1039/d1tb00628b 33928990 37 Rao A Roy S Jain V Pillai P P ACS Appl Mater Interfaces 2023 15 25248 25274 10.1021/acsami.2c05378 35715224 38 Yang J Zhang L Zhou Q Chen F Stenzel M Gao F Liu C Yuan H Li H Jiang Y Nanoscale Adv 2021 3 2812 2821 10.1039/d0na01066a 36134184 PMC9417972 39 Pulingam T Foroozandeh P Chuah J-A Sudesh K Nanomaterials 2022 12 576 10.3390/nano12030576 35159921 PMC8839423 40 Ko W-C Wang S-J Hsiao C-Y Hung C-T Hsu Y-J Chang D-C Hung C-F Molecules 2022 27 1551 10.3390/molecules27051551 35268651 PMC8911979 41 Phafat B Bhattacharya S Mini-Rev Med Chem 2023 23 1257 1272 10.2174/1389557522666220405202222 35382722 42 Bontempo P De Masi L Rigano D Nutrients 2023 15 2961 10.3390/nu15132961 37447290 PMC10346460 43 Najmi A Javed S A Al Bratty M Alhazmi H A Molecules 2022 27 349 10.3390/molecules27020349 35056662 PMC8779633 44 Elkordy A A Haj-Ahmad R R Awaad A S Zaki R M J Drug Delivery Sci Technol 2021 63 102459 10.1016/j.jddst.2021.102459 45 Ma L Diao L Peng Z Jia Y Xie H Li B Ma J Zhang M Cheng L Ding D Adv Mater (Weinheim, Ger) 2021 33 2104849 10.1002/adma.202104849 34536044 46 Nuzzo G Senese G Gallo C Albiani F Romano L d’Ippolito G Manzo E Fontana A Mar Drugs 2022 20 386 10.3390/md20060386 35736189 PMC9229642 47 Alqathama A Front Immunol 2024 15 1410300 10.3389/fimmu.2024.1410300 39050852 PMC11266008 48 Cai C Wu Q Hong H He L Liu Z Gu Y Zhang S Wang Q Fan X Fang J Sci Rep 2021 11 3332 10.1038/s41598-021-82857-2 33558586 PMC7870934 49 Deng L-J Qi M Li N Lei Y-H Zhang D-M Chen J-X J Leukocyte Biol 2020 108 493 508 10.1002/jlb.3mr0320-444r 32678943 PMC7496826 50 Dong S Guo X Han F He Z Wang Y Acta Pharm Sin B 2022 12 1163 1185 10.1016/j.apsb.2021.08.020 35530162 PMC9069318 51 Yang L Chen Y Liu K Chen Y Zhang Y Zhang Z Li H Front Pharmacol 2024 15 1289957 10.3389/fphar.2024.1289957 38420194 PMC10899684 52 Vijayan Y Sandhu J S Harikumar K B Curr Med Chem 2024 31 5165 5177 10.2174/0109298673274796240116105555 38549529 53 Kan L L-Y Chan B C-L Leung P-C Wong C-K Molecules 2023 28 5804 10.3390/molecules28155804 37570775 PMC10421415 54 Komorowska D Radzik T Kalenik S Rodacka A Int J Mol Sci 2022 23 10627 10.3390/ijms231810627 36142554 PMC9501384 55 Tang L Li J Zhao Q Pan T Zhong H Wang W Pharmaceutics 2021 13 1151 10.3390/pharmaceutics13081151 34452113 PMC8398618 56 Miguel R d A Hirata A S Jimenez P C Lopes L B Costa-Lotufo L V Pharmaceutics 2022 14 1722 10.3390/pharmaceutics14081722 36015347 PMC9415580 57 Huang L Huang X-H Yang X Hu J-Q Zhu Y-Z Yan P-Y Xie Y Pharmacol Res 2024 201 107100 10.1016/j.phrs.2024.107100 38341055 58 Patel P Garala K Singh S Prajapati B G Chittasupho C Pharmaceuticals 2024 17 329 10.3390/ph17030329 38543115 PMC10975431 59 Ion D Niculescu A-G Păduraru D N Andronic O Mușat F Grumezescu A M Bolocan A Pharmaceutics 2021 14 18 10.3390/pharmaceutics14010018 35056915 PMC8779479 60 Cohen S Kryukov O Forti E Ruvinov E Anionic nanoparticles for use in the delivery of anionic small molecule drugs WO Patent WO2016178224 2016 11 10 61 Saddiq A A N Mousa S A Mousa D S Nanocapsule containing a bioactive compound, and a method of reducing toxicity resulting from cancer therapy U.S. Patent US240447339 2017 11 2 62 Guan Y Du S Hu Z Targeted Nano-Particle for Inhibiting Breast Cancer, and Preparation Method and Application Thereof Chin. Patent CN222367609 2017 12 15 63 Cheng Y Sang H Wang C Li C Traceable Boric Acid Nano-Drug Compound, Preparation Method and Use Thereof Chin. Patent CN225561345 2018 2 11 64 Yang X Cheng J Preparation Method and Application of Active Natural Super-Molecular Photosensitizer Chin. Patent CN109846857 2019 6 7 65 Yang X Wang J Active Natural Product Nano Drug Carrier System and Preparation Method and Application Thereof Chin. Patent CN111202719 2020 5 29 66 Shao J Zhang W Zhao R Fang Y Carrier-Free Nano-Drug Based on Metal-Organic Co-Assembly as Well as Preparation and Application of Carrier-Free Nano-Drug Chin. Patent CN114129571 2022 3 4 67 Kim Y J Method for producing gold nanoparticle using strain from ginseng and nigella sativa extract and pharmaceutical composition for treating cancer comprising the gold nanoparticle Korean Pat. Appl. KR20220169108 (A) 2022 12 27 68 Xing C Li C Gao D Ahn H Chen Y Photo-Thermal Response Drug-Loaded Nano Particle as Well as Preparation and Application Thereof Chin. Patent CN367902299 2022 4 8 69 Shao J Yue J Yang F Preparation and Application of Carrier-Free Double-Drug Self-Assembled Nanoparticles Chin. Patent CN114470229 2022 5 13 70 Qu W Zhang K Zhu J Wang R Feng F Wang C Self-Assembled Nanoparticles Based on Natural Products as Well as Preparation Method and Application of Self-Assembled Nanoparticles Chin. Patent CN115252560 2022 11 1 71 Shao J Zhang B Tan X CRISPR/Cas9-Drug Co-Assembly Bionic Nano System as Well as Preparation and Application Thereof Chin. Pat. Appl. CN117064865 (A) 2023 11 17 72 Zeng X Li Z Shi K Chen H Immune Checkpoint Inhibitor Nano-Delivery System Composed of Natural Polyphenol and Preparation Method of Immune Checkpoint Inhibitor Nano-Delivery System Chin. Patent CN426774477 2023 12 20 73 Dong Z Zhang Y Li N Nano Tumor Vaccine Formed Based on Self-Assembly of Astragalus Polysaccharide and Application of Nano Tumor Vaccine Chin. Patent CN115671277 2023 2 3 74 Li J Feng T Feng X Zhou Y Chen L Jiang H Zhao C Novel CDs-Ber Nano Material as Well as Preparation Method and Application Thereof Chin. Patent CN427216811 2023 12 28 75 Deng Z Cui X Qin Y He Z Du S Preparation Method of Breast Cancer Targeted Nano Drug Delivery System Chin. Patent CN115887415 2023 4 4 76 Wang Z Wang J Liu L Wei B Shen K Zheng Q Chitin-Glucan Nano-Polysaccharide Compound as Well as Preparation Method and Application Thereof Chin. Patent CN117534780 2024 2 9 77 Sorzano C O S Hamilton D G Mendez E Lab Anim 2025 59 276 282 10.1177/00236772241271039 39445474 78 Honkala A Malhotra S V Kummar S Junttila M R Nat Rev Drug Discovery 2022 21 99 114 10.1038/s41573-021-00301-6 34702990 79 Gunjur A Balasubramanian A Hafeez U Menon S Cher L Parakh S Gan H K J Neuro-Oncol 2022 159 539 549 10.1007/s11060-022-04092-7 35933567 80 Kamran S Sinniah A Abdulghani M A M Alshawsh M A Cancers 2022 14 1100 10.3390/cancers14051100 35267408 PMC8909202 81 Ren Y Kinghorn A D J Med Chem 2020 63 15410 15448 10.1021/acs.jmedchem.0c01449 33289552 PMC7812702 82 Singh A Debnath R Sharma A Saini A Seni K Chawla V Chawla P A Curr Med Chem 2025 10.2174/0109298673315133240830055507 39318000 83 Liu W Cui X Zhong Y Ma R Liu B Xia Y Pharmacol Res 2023 193 106812 10.1016/j.phrs.2023.106812 37271425 84 Abotaleb M Liskova A Kubatka P Büsselberg D Biomolecules 2020 10 221 10.3390/biom10020221 32028623 PMC7072661 85 Bakrim S El Omari N El Hachlafi N Bakri Y Lee L-H Bouyahya A Foods 2022 11 3323 10.3390/foods11213323 36359936 PMC9657352 86 Ying Y Hao W Front Immunol 2023 14 1147641 10.3389/fimmu.2023.1147641 36969152 PMC10035574 87 Li Y Wang X Ma X Liu C Wu J Sun C Front Pharmacol 2021 12 621813 10.3389/fphar.2021.621813 33935714 PMC8080043 88 Guo R Chen M Ding Y Yang P Wang M Zhang H He Y Ma H Front Nutr 2022 9 838179 10.3389/fnut.2022.838179 35295918 PMC8919066 89 Huang Y Li G Hong C Zheng X Yu H Zhang Y Front Oncol 2021 11 733369 10.3389/fonc.2021.733369 34616681 PMC8489381 90 Stærk D Lykkeberg A K Christensen J Budnik B A Abe F Jaroszewski J W J Nat Prod 2002 65 1299 1302 10.1021/np0106384 12350151 91 Luan S Gao Y Liang X Zhang L Yin L He C Liu S Yin Z Yue G Zou Y Bioorg Chem 2021 109 104699 10.1016/j.bioorg.2021.104699 33611138 92 Dhandapani S Xu X Wang R Puja A M Kim H Perumalsamy H Balusamy S R Kim Y-J Mater Sci Eng: C 2021 127 112214 10.1016/j.msec.2021.112214 34225866 93 Guo Y Jiang K Shen Z Zheng G Fan L Zhao R Shao J ACS Appl Mater Interfaces 2017 9 43508 43519 10.1021/acsami.7b14755 29171263 94 Li N Zhang Y Han M Liu T Wu J Xiong Y Fan Y Ye F Jin B Zhang Y Sci China: Life Sci 2024 67 680 697 10.1007/s11427-023-2465-x 38206438 95 Rezić I Polymers (Basel, Switz) 2022 14 4961 10.3390/polym14224961 96 Shabatina T I Gromova Y A Vernaya O I Soloviev A V Shabatin A V Morosov Y N Astashova I V Melnikov M Y Pharmaceuticals 2024 17 587 10.3390/ph17050587 38794157 PMC11124199 97 Yusuf A Almotairy A R Z Henidi H Alshehri O Y Aldughaim M S Polymers (Basel, Switz) 2023 15 1596 10.3390/polym15071596 PMC10096782 37050210 98 Nam N H Luong N H Nanoparticles: Synthesis and Applications Materials for Biomedical Engineering 2019 Amsterdam, Netherlands Elsevier 211 240 10.1016/b978-0-08-102814-8.00008-1 99 Mundekkad D Cho W C Int J Mol Sci 2022 23 1685 10.3390/ijms23031685 35163607 PMC8835852 100 Hu Y Nie W Lyu L Zhang X Wang W Zhang Y He S Guo A Liu F Wang B ACS Nano 2024 18 3295 3312 10.1021/acsnano.3c10037 38252684 101 Wells K Liu T Zhu L Yang L Nanoscale 2024 16 17699 17722 10.1039/d4nr01780c 39257225 PMC12139611 102 Zhou L Zou M Xu Y Lin P Lei C Xia X Front Oncol 2022 12 864301 10.3389/fonc.2022.864301 35664731 PMC9160744 103 Manzari‐Tavakoli A Babajani A Tavakoli M M Safaeinejad F Jafari A Cancer Med 2024 13 5 e7010 10.1002/cam4.7010 38491817 PMC10943377 104 Ji H Wang W Qiao O Hao X ACS Appl Nano Mater 2024 7 4564 4587 10.1021/acsanm.3c03315 105 Yao Y Xu Z Ding H Yang S Chen B Zhou M Zhu Y Yang A Yan X Liang C J Nanobiotechnol 2025 23 108 10.1186/s12951-025-03146-y PMC11827262 39953594 106 Zhang X Li N Zhang S Sun B Chen Q He Z Luo C Sun J Med Res Rev 2020 40 1754 1775 10.1002/med.21669 32266734 107 Kyu Shim M Yang S Sun I-C Kim K Adv Drug Delivery Rev 2022 183 114177 10.1016/j.addr.2022.114177 35245568 108 Liu C Liu Q Chen L Li M Yin J Zhu X Chen D Adv Healthcare Mater 2020 9 2000899 10.1002/adhm.202000899 33448702 109 Nguyen H N Ullevig S L Short J D Wang L Ahn Y J Asmis R Antioxidants 2021 10 1161 10.3390/antiox10081161 34439409 PMC8388988 110 Grabowska K Żmudzki P Wróbel-Biedrawa D Podolak I Planta Med 2021 87 305 313 10.1055/a-1345-9377 33450770 111 Panda S S Thangaraju M Lokeshwar B L Molecules 2022 27 8981 10.3390/molecules27248981 36558113 PMC9785537 112 Alam M Ali S Ahmed S Elasbali A M Adnan M Islam A Hassan M I Yadav D K Int J Mol Sci 2021 22 12162 10.3390/ijms222212162 34830043 PMC8621142 113 Fogde D L Xavier C P R Balnytė K Holland L K K Stahl-Meyer K Dinant C Corcelle-Termeau E Pereira-Wilson C Maeda K Jäättelä M Cells 2022 11 4079 10.3390/cells11244079 36552844 PMC9776894 114 Xu H Yu A-l Zhao D-p Meng G-y Wang L Shan M Hu N-x Liu Y-l Innate Immun 2022 28 5 155 163 10.1177/17534259221094559 35548957 PMC9189552 115 Yasin A Ren Y Li J Sheng Y Cao C Zhang K Front Bioeng Biotechnol 2022 10 910290 10.3389/fbioe.2022.910290 35860333 PMC9289781 116 Rodriguez-Marquez C D Arteaga-Marin S Rivas-Sánchez A Autrique-Hernández R Castro-Muñoz R Int J Mol Sci 2022 23 6038 10.3390/ijms23116038 35682710 PMC9181718 117 Graciela C-Q José Juan E-C Gieraldin C-L Xóchitl Alejandra P-M Gabriel A-Á Polymers (Basel, Switz) 2023 15 3473 10.3390/polym15163473 PMC10459667 37631529 118 Wang W Zhang X Li Z Pan D Zhu H Gu Z Chen J Zhang H Gong Q Luo K Carbohydr Polym 2021 267 118160 10.1016/j.carbpol.2021.118160 34119134 119 Hu Q Li H Archibong E Chen Q Ruan H Ahn S Dukhovlinova E Kang Y Wen D Dotti G Nat Biomed Eng 2021 5 1038 1047 10.1038/s41551-021-00712-1 33903744 PMC9102991 120 Bae J Kim N Shin Y Kim S-Y Kim Y-J Biomed Dermatol 2020 4 8 10.1186/s41702-020-0057-8 121 Sheng Y Sun Y Tang Y Yu Y Wang J Zheng F Li Y Sun Y Front Pharmacol 2023 14 1144878 10.3389/fphar.2023.1144878 37033663 PMC10080012 122 Oh J-W Muthu M Pushparaj S S C Gopal J Molecules 2023 28 2151 10.3390/molecules28052151 36903395 PMC10004647 123 Talib W H Awajan D Alqudah A Alsawwaf R Althunibat R Abu AlRoos M Al Safadi A Abu Asab S Hadi R W Al Kury L T Molecules 2024 29 1373 10.3390/molecules29061373 38543009 PMC10976257 124 Li Z Geng Y-N Jiang J-D Kong W-J Evidence-Based Complementary Altern Med 2014 289264 10.1155/2014/289264 PMC3942282 24669227 125 Kazemipoor M Fadaei Tehrani P Zandi H Golvardi Yazdi R Clin Exp Dent Res 2021 7 601 608 10.1002/cre2.379 33325156 PMC8404507 126 Bhanumathi R Manivannan M Thangaraj R Kannan S ACS Omega 2018 3 8317 8328 10.1021/acsomega.7b01347 30087941 PMC6072244 127 Cui X He Z Liang J Wei M Guo Z Zhou Y Qin Y Deng Z J Drug Targeting 2024 32 325 333 10.1080/1061186x.2024.2309566 38269592 128 Hak A Ali M S Sankaranarayanan S A Shinde V R Rengan A K ACS Appl Bio Mater 2023 6 349 364 10.1021/acsabm.2c00891 36700563 129 Wang H Wang Z Zhang Z Liu J Hong L Adv Nutr 2023 14 1085 1110 10.1016/j.advnut.2023.05.013 37247842 PMC10509430 130 Sundberg D Biomacromolecules 2020 21 4388 4395 10.1021/acs.biomac.0c00549 32862639 131 Fu L Zhou X He C Macromol Biosci 2021 21 2100075 10.1002/mabi.202100075 33885225 132 Wan Z Zheng R Moharil P Liu Y Chen J Sun R Song X Ao Q Molecules 2021 26 1220 10.3390/molecules26051220 33668746 PMC7956602 133 Chang D Ma Y Xu X Xie J Ju S Front Bioeng Biotechnol 2021 9 707319 10.3389/fbioe.2021.707319 34249894 PMC8267819 134 Zhang F Zhong H Zhou X Pan M Xu J Liu M Wang M Liu G Xu T Wang Y Hortic Res 2022 9 uhac055 10.1093/hr/uhac055 35664240 PMC9154076 135 Nie F Liu L Cui J Zhao Y Zhang D Zhou D Wu J Li B Wang T Li M Antioxidants 2023 12 1004 10.3390/antiox12051004 37237870 PMC10215713 136 Yao Z Liu N Lin H Zhou Y J Clin Transl Hepatol 2023 11 1329 1340 10.14218/jcth.2023.00071 37719964 PMC10500287 137 Zhou F Zhou Y Guo Z Yu X Deng Z Mini-Rev Med Chem 2022 22 836 847 10.2174/1389557521666210428132256 33913403 138 Fan Y Liu Y Wu Y Dai F Yuan M Wang F Bai Y Deng H Int J Biol Macromol 2021 192 1240 1255 10.1016/j.ijbiomac.2021.10.074 34678381 139 Kou T Faisal M Song J Blennow A Crit Rev Food Sci Nutr 2024 64 1 15 10.1080/10408398.2022.2104209 35916785 140 Zeng Y Xiang Y Sheng R Tomás H Rodrigues J Gu Z Zhang H Gong Q Luo K Bioact Mater 2021 6 3358 3382 10.1016/j.bioactmat.2021.03.008 33817416 PMC8005658 141 Li M Zhao Y Zhang W Zhang S Zhang S Carbohydr Polym 2021 269 118323 10.1016/j.carbpol.2021.118323 34294335 142 Abka-khajouei R Tounsi L Shahabi N Patel A K Abdelkafi S Michaud P Mar Drugs 2022 20 364 10.3390/md20060364 35736167 PMC9225620 143 Iravani S Varma R S Mar Drugs 2022 20 598 10.3390/md20100598 36286422 PMC9604960 144 Wan S Fan Q Wu Y Zhang J Qiao G Jiang N Yang J Liu Y Li J Chiampanichayakul S Pharmaceutics 2023 15 631 10.3390/pharmaceutics15020631 36839952 PMC9965064 145 Wu L Zhao J Zhang X Liu S Zhao C Int J Biol Macromol 2021 179 116 124 10.1016/j.ijbiomac.2021.02.207 33667560 146 Moura R P Sousa F Almeida A Pinto S Sarmento B Theranostic Biomaterials for Regulation of the Blood–Brain Barrier Theranostic Bionanomaterials 2019 Amsterdam, Netherlands Elsevier 303 319 10.1016/b978-0-12-815341-3.00013-4 147 Kim H Park Y Stevens M M Kwon W Hahn S K J Controlled Release 2019 303 55 66 10.1016/j.jconrel.2019.04.003 30954619 148 Slepička P Slepičková Kasálková N Siegel J Kolská Z Švorčík V Materials 2019 13 1 10.3390/ma13010001 31861259 PMC6981963 149 He J-s Liu S-j Zhang Y-r Chu X-d Lin Z-b Zhao Z Qiu S-h Guo Y-g Ding H Pan Y-l Front Pharmacol 2021 12 687399 10.3389/fphar.2021.687399 34163367 PMC8215714 150 Chen X-Y Yung L-Y L Tan P H Bay B H Front Immunol 2022 13 865554 10.3389/fimmu.2022.865554 35432376 PMC9008216 151 Goddard Z R Marín M J Russell D A Searcey M Chem Soc Rev 2020 49 8774 8789 10.1039/d0cs01121e 33089858 152 Sargazi S Laraib U Er S Rahdar A Hassanisaadi M Zafar M N Díez-Pascual A M Bilal M Nanomaterials 2022 12 1102 10.3390/nano12071102 35407220 PMC9000429 153 Gidwani B Sahu V Shukla S S Pandey R Joshi V Jain V K Vyas A J Drug Delivery Sci Technol 2021 61 102308 10.1016/j.jddst.2020.102308 154 Tiwari P K Sahu M Kumar G Ashourian M Comput Intell Neurosci 2021 2096208 10.1155/2021/2096208 34413883 PMC8369165 155 Ondry J C Philbin J P Lostica M Rabani E Alivisatos A P ACS Nano 2021 15 2251 2262 10.1021/acsnano.0c07202 33377761 156 Kurniawan D Sharma N Rahardja M R Cheng Y-Y Chen Y-T Wu G-X Yeh Y-Y Yeh P-C Ostrikov K K Chiang W-H ACS Appl Mater Interfaces 2022 14 52289 52300 10.1021/acsami.2c15251 36349361 157 Uprety B Abrahamse H Front Chem (Lausanne, Switz) 2022 10 946574 10.3389/fchem.2022.946574 PMC9405672 36034651 158 Uthman A AL-Rawi N Saeed M H Eid B Al-Rawi N H PeerJ 2024 12 e16732 10.7717/peerj.16732 38188167 PMC10771769 159 Naik K Chaudhary S Ye L Parmar A S Front Bioeng Biotechnol 2022 10 882100 10.3389/fbioe.2022.882100 35662840 PMC9158127 160 Liu X-Y Wang Y-N Du J-S Chen B-H Liu K-Y Feng L Xiang G-S Zhang S-Y Lu Y-C Yang S-C Front Plant Sci 2024 14 1259347 10.3389/fpls.2023.1259347 38239219 PMC10794647 161 Salimo Z M Yakubu M N da Silva E L de Almeida A C G Chaves Y O Costa E V da Silva F M A Tavares J F Monteiro W M de Melo G C Biomolecules 2023 13 403 10.3390/biom13030403 36979338 PMC10046151 162 Gan Y Li X Han S Zhou L Li W Pharmaceuticals 2023 16 241 10.3390/ph16020241 37259388 PMC9965350 163 Li X Xie L Zhou L Gan Y Han S Zhou Y Qing X Li W Am J Chin Med 2023 51 1905 1925 10.1142/s0192415x23500842 37646142 164 Abed S N Deb P K Surchi H S Kokaz S F Jamal S M Bandopadhyay S Tekade R K Nanocarriers in Different Preclinical and Clinical Stages Basic Fundamentals of Drug Delivery 2019 London, UK Academic Press 685 731 10.1016/b978-0-12-817909-3.00017-0 165 Morales-Becerril A Aranda-Lara L Isaac-Olivé K Ocampo-García B E Morales-Ávila E EXCLI J 2022 21 1028 1052 10.17179/excli2022-4975 36110562 PMC9441682 166 Zhang R Han Y Xie W Liu F Chen S J Agric Food Chem 2022 70 6354 6367 10.1021/acs.jafc.2c01936 35603429 167 Samrot A V Sean T C Kudaiyappan T Bisyarah U Mirarmandi A Faradjeva E Abubakar A Ali H H Angalene J L A Suresh Kumar S Int J Biol Macromol 2020 165 3088 3105 10.1016/j.ijbiomac.2020.10.104 33098896 168 Alshawwa S Z Kassem A A Farid R M Mostafa S K Labib G S Pharmaceutics 2022 14 883 10.3390/pharmaceutics14040883 35456717 PMC9026217 169 Luo S Lv Z Yang Q Chang R Wu J Pharmaceutics 2023 15 1928 10.3390/pharmaceutics15071928 37514114 PMC10386740 170 Eftekhari A Kryschi C Pamies D Gulec S Ahmadian E Janas D Davaran S Khalilov R Nanotheranostics 2023 7 236 257 10.7150/ntno.77564 37064613 PMC10093418 171 Liu L Wannemuehler M J Narasimhan B Curr Opin Biomed Eng 2021 20 100322 10.1016/j.cobme.2021.100322 34423179 PMC8372976 172 Dangkoub F Sankian M Tafaghodi M Jaafari M R Badiee A J Controlled Release 2021 339 274 283 10.1016/j.jconrel.2021.09.037 34600024 173 Fan D Cao Y Cao M Wang Y Cao Y Gong T Signal Transduction Targeted Ther 2023 8 293 10.1038/s41392-023-01536-y PMC10404590 37544972 174 Baeza A Molecules 2020 25 1508 10.3390/molecules25071508 32225049 PMC7180856 175 Elbagory A M Marima R M Dlamini Z Cancers 2021 13 5686 10.3390/cancers13225686 34830840 PMC8616350 176 AbdElhamid A S Zayed D G Heikal L Khattab S N Mady O Y El-Gizawy S A Elzoghby A O Nanomedicine (London, U K) 2021 16 1613 1625 10.2217/nnm-2021-0037 34189946 177 Kumar P Yadav N Chaudhary B Umakanthan S Chattu V K Kazmi I Al-Abbasi F A Alzarea S I Afzal O Altamimi A S A Curr Pharm Biotechnol 2024 25 268 284 10.2174/1389201024666230523114350 37231750 178 Jayawardena H S N Liyanage S H Rathnayake K Patel U Yan M Anal Chem (Washington, DC, U S) 2021 93 1889 1911 10.1021/acs.analchem.0c05208 PMC7941215 33434434 179 Lima A L Gratieri T Cunha-Filho M Gelfuso G M Methods 2022 199 54 66 10.1016/j.ymeth.2021.07.009 34333117 180 Zhou Y Wang P Wan F Zhu L Wang Z Fan G Wang P Luo H Liao S Yang Y Nanomaterials 2023 13 3125 10.3390/nano13243125 38133022 PMC10745493 181 Itzhaki E Hadad E Moskovits N Stemmer S M Margel S Pharmaceuticals 2021 14 648 10.3390/ph14070648 34358074 PMC8308547 182 Xiao X Teng F Shi C Chen J Wu S Wang B Meng X Essiet Imeh A Li W Front Bioeng Biotechnol 2022 10 1024143 10.3389/fbioe.2022.1024143 36277396 PMC9585261 183 Francis D M Manspeaker M P Archer P A Sestito L F Heiler A J Schudel A Thomas S N Biomaterials 2021 279 121184 10.1016/j.biomaterials.2021.121184 34678650 PMC8639654 184 Deng S Gigliobianco M R Censi R Di Martino P Nanomaterials 2020 10 847 10.3390/nano10050847 32354008 PMC7711922 185 Yıldırım M Sessevmez M Poyraz S Düzgüneş N Pharmaceutics 2023 15 2566 10.3390/pharmaceutics15112566 38004545 PMC10675520 186 Vieira I R S Tessaro L Lima A K O Velloso I P S Conte-Junior C A Nutrients 2023 15 3136 10.3390/nu15143136 37513554 PMC10384266 187 Penta D Tripathi P Rajarajan D Natesh J Mondal P Meeran S M ACS Omega 2022 7 43147 43160 10.1021/acsomega.2c05832 36467932 PMC9713897 188 Munakarmi S Shrestha J Shin H-B Lee G-H Jeong Y-J Cells 2021 10 1178 10.3390/cells10051178 34066056 PMC8151225 189 Wang W Wang S Liu Y Wang X Nie J Meng X Zhang Y Front Aging Neurosci 2022 14 925855 10.3389/fnagi.2022.925855 35860668 PMC9289475 190 Duan J Li Y Gao H Yang D He X Fang Y Zhou G Food Funct 2020 11 6332 6339 10.1039/d0fo01177k 32608435 191 Yousuf M Shamsi A Khan P Shahbaaz M AlAjmi M F Hussain A Hassan G M Islam A Rizwanul Haque Q M Hassan M I Int J Mol Sci 2020 21 3526 10.3390/ijms21103526 32429317 PMC7278979 192 Gholap A D Gupta J Kamandar P Bhowmik D D Rojekar S Faiyazuddin M Hatvate N T Mohanto S Ahmed M G Subramaniyan V ACS Biomater Sci Eng 2024 10 271 297 10.1021/acsbiomaterials.3c01247 38096426 193 Ma L Zhang M Zhao R Wang D Ma Y Ai L Molecules 2021 26 933 10.3390/molecules26040933 33578780 PMC7916513 194 Lu L Duong V T Shalash A O Skwarczynski M Toth I Vaccines (Basel, Switz) 2021 9 563 10.3390/vaccines9060563 PMC8228360 34071482 195 Hu H Yang C Zhang F Li M Tu Z Mu L Dawulieti J Lao Y-H Xiao Z Yan H Adv Sci 2021 8 15 2002020 10.1002/advs.202002020 PMC8336609 34386315 196 Das A Ali N Expert Rev Vaccines 2021 20 1273 1290 10.1080/14760584.2021.1984890 34550859 197 Liu M Xie D Hu D Zhang R Wang Y Tang L Zhou B Zhao B Yang L Adv Sci 2023 10 31 2207697 10.1002/advs.202207697 PMC10625102 37740439 198 Fang X Lan H Jin K Gong D Qian J Cancers 2022 14 3842 10.3390/cancers14163842 36010836 PMC9405528 199 Li W Hu X Wang S Jiao Z Sun T Liu T Song K Int J Biol Macromol 2020 145 985 997 10.1016/j.ijbiomac.2019.09.189 31669273 200 Wang Y Qian J Yang M Xu W Wang J Hou G Ji L Suo A Carbohydr Polym 2019 225 115206 10.1016/j.carbpol.2019.115206 31521263 201 Rosales T K O Fabi J P Polysaccharide-Based Nanotechnology Approaches to Deliver Bioactive Compounds for Food Applications Advances in Chemical Engineering 2023 62 Cambridge, MA, USA Academic Press 215 256 10.1016/bs.ache.2023.08.001 202 Han J Cui Y Gu Z Yang D Biomaterials 2021 273 120846 10.1016/j.biomaterials.2021.120846 33930736 203 Mirrahimi M Abed Z Beik J Shiri I Shiralizadeh Dezfuli A Mahabadi V P Kamran Kamrava S Ghaznavi H Shakeri-Zadeh A Pharmacol Res 2019 143 178 185 10.1016/j.phrs.2019.01.005 30611856 204 Yang Z Chen Q Chen J Dong Z Zhang R Liu J Liu Z Small 2018 14 49 1803262 10.1002/smll.201803262 30307701 205 Kandasamy G Karuppasamy Y Krishnan U M Vaccines (Basel, Switz) 2023 11 458 10.3390/vaccines11020458 PMC9968063 36851335 206 Sun D Li M Zhang M Cui R Yang Z Yu L Wang D Yao W ACS Omega 2023 8 30474 30482 10.1021/acsomega.3c03663 37636951 PMC10448649 207 Palaniyappan S Sridhar A Kari Z A Téllez-Isaías G Ramasamy T Mar Drugs 2023 21 278 10.3390/md21050278 37233472 PMC10224334 208 Kleszcz R Majchrzak‐Celińska A Baer‐Dubowska W Br J Pharmacol 2025 182 10 2075 2093 10.1111/bph.16224 37614022 209 Ha H Lee H Y Kim J H Kim D Y An H J Bae S Park H-s Kang J H Cancer Res Treat 2024 56 991 1013 10.4143/crt.2024.128 38726510 PMC11491240 210 Acrotech Biopharma LLC; Withdrawal of Approval of New Drug Application For MARQIBO 18 8 2025 Available from: https://www.federalregister.gov/documents/2022/05/02/2022-09235/acrotech-biopharma-llc-withdrawal-of-approval-of-new-drug-application-for-marqibo-vincristine 211 Ahmad A Imran M Sharma N Pharmaceutics 2022 14 2463 10.3390/pharmaceutics14112463 36432653 PMC9697541 212 Medicines Agency - Heads of Medicines Agencies, E. Nanotechnology-Based Medicinal Products for Human Use - EU-IN Horizon Scanning Report 18 8 2025 Available from: https://www.ema.europa.eu/en/documents/report/nanotechnology-based-medicinal-products-human-use-eu-horizon-scanning-report_en.pdf 213 Zeng H Lv Z Sun X Tong Y Wu W Dong S Mao L Environ Health 2024 2 189 201 10.1021/envhealth.3c00138 PMC11503807 39474143 214 Oksel Karakus C Bilgi E Winkler D A Nanotoxicology 2021 15 331 351 10.1080/17435390.2020.1860265 33337941 215 Desai A Gyawali B eClinicalMedicine 2020 20 100269 10.1016/j.eclinm.2020.100269 32300733 PMC7152810 216 McIntosh S A Alam F Adams L Boon I S Callaghan J Conti I Copson E Carson V Davidson M Fitzgerald H Lancet Oncol 2023 24 636 645 10.1016/s1470-2045(23)00182-1 37269844 217 Gil-Ramírez A Rodriguez-Meizoso I Sep Purif Rev 2021 50 32 52 10.1080/15422119.2019.1617737 218 Ariani M D Zuhrotun A Manesiotis P Hasanah A N Polym Adv Technol 2024 35 1 e6201 10.1002/pat.6201 219 Roszczenko P Szewczyk O K Czarnomysy R Bielawski K Bielawska A Pharmaceutics 2022 14 2286 10.3390/pharmaceutics14112286 36365105 PMC9692384 220 Jahangirian H Ghasemian lemraski E Webster T J Rafiee-Moghaddam R Abdollahi Y Int J Nanomed 2017 12 2957 2978 10.2147/ijn.s127683 PMC5396976 28442906 221 Beuguel Q Tavares J R Carreau P J Heuzey M-C J Colloid Interface Sci 2018 516 23 33 10.1016/j.jcis.2018.01.035 29408109 222 Center for drug evaluation and research. Pharmacology/toxicology review and evaluation of abraxane 18 8 2025 Available from: https://www.accessdata.fda.gov/drugsatfda_docs/nda/2005/21660_ABRAXANE_pharmr.PDF 223 Center for drug evaluation and research. Aproval letter of abraxane 18 8 2025 Available from: https://www.accessdata.fda.gov/drugsatfda_docs/nda/2005/21660_AbraxaneTOC.cfm 224 Chou P-L Huang Y-P Cheng M-H Rau K-M Fang Y-P Int J Nanomed 2020 15 1731 1743 10.2147/ijn.s231407 PMC7075337 32210563 ",
  "metadata": {
    "Title of this paper": "Polysaccharide-Based Nanotechnology Approaches to Deliver Bioactive Compounds for Food Applications",
    "Journal it was published in:": "Beilstein Journal of Nanotechnology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477904/"
  }
}