{
  "title": "Paper_1134",
  "abstract": "pmc J Cell Physiol J Cell Physiol 379 blackwellopen JCP Journal of Cellular Physiology 0021-9541 1097-4652 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12476590 PMC12476590.1 12476590 12476590 41015904 10.1002/jcp.70094 JCP70094 1 Review Article Review Article Holding Out for a Model: Rhomboid Superfamily in Vertebrate Development and Disease Gourkanti Saroj  1 Munoz Yazmin  1 Cheung Jacqueline  1 Chavez Rosa M.  1 Agarwal Devanshi  1 Schoen Taylor J.  1  2 Solorio‐Kirpichyan Kristina  1 Neal Sonya E.  1  2 seneal@ucsd.edu   1 Department of Cell and Developmental Biology, School of Biological Sciences University of California San Diego San Diego California USA   2 Howard Hughes Medical Institute Chevy Chase Maryland USA * Correspondence: seneal@ucsd.edu 28 9 2025 9 2025 240 9 497722 10.1002/jcp.v240.9 e70094 05 9 2025 03 7 2025 18 9 2025 28 09 2025 29 09 2025 29 09 2025 © 2025 The Author(s). Journal of Cellular Physiology https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT The rhomboid superfamily, comprising both proteases and pseudoproteases, has emerged as a central regulator of membrane biology, mediating diverse functions including protein quality control, signal transduction, trafficking, and more. While molecular mechanisms of rhomboid activity have been well‐characterized in invertebrate and cell‐based systems, their physiological role in vertebrate development remains limited and continues to evolve. Here, we review recent advances in cell culture systems and vertebrate models that uncover the developmental and disease‐relevant functions of rhomboid family members, including RHBDLs, iRhoms, PARL, and Derlins. We outline their roles in embryogenesis, tissue regeneration, neurodevelopment, and immune signaling, alongside their pathological involvement in cancer, neurodegeneration, and metabolic disorders. We also emphasize the limitations posed by early embryonic lethality in knockout models and advocate for tissue‐specific vertebrate models to dissect rhomboid‐dependent pathways in vivo. Understanding how rhomboid proteins coordinate developmental processes will not only reveal fundamental principles of membrane‐associated processes, but also open new avenues for therapeutic targeting in disease. development membrane rhomboid proteins vertebrate model These studies were supported by NIH grant 2R35GM133565‐01, Pew Biomedical Award (304700), NSF CAREER (2047391), CZI Diversity Leadership Award, HHMI Freeman Hrabowski Scholar Program to S.E.N. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:28.09.2025 Sonya E. Neal Lead contact. 1 Introduction The rhomboid superfamily comprises a unique group of intramembranous proteases and pseudoproteases that act as key regulators in cellular homeostasis. Members are present across all kingdoms of life and share a common structural architecture: 6 or 7 transmembrane helices, a highly conserved tryptophan‐arginine (WR) motif, and a GxxxG motif (Koonin et al. 2003 2006 2007 2021 2023 Drosophila 1988 2001 2005 2005 2006 2020 2014 2017 2020 1 Figure 1 Depiction of members from the intramembrane protease and pseudoprotease subclass: RHBDL‐1, ‐2, ‐3, and ‐4, iRhom1&2, Derlin‐1, ‐2, and ‐3, and PARL, found in mammals, All rhomboid members diverged from a common ancestral rhomboid‐like core including six transmembrane helices (in blue), serine‐histidine catalytic dyad, and rhomboid motifs, WR and GxxxG, and evolutionarily diverged into the intramembrane and pseudoprotease subclass. Depicted in red are additional helices or domains that are unique to each rhomboid protein. The following domains are indicated: (VBM) valosin/p97‐binding motif (also known as SHP box), (UIM) ubiquitin‐interacting motif, (IRHD) iRhom homology domain, (UBA) ubiquitin‐associated domain. Mammalian rhomboid proteases consist of RHBDL1‐4 and mitochondrial integral membrane protein presenilin‐associated rhomboid like (PARL), while rhomboid pseudoproteases consists of iRhom and Derlin subclasses (Greenblatt et al. 2011 2011 2 2017 2017 2020 Figure 2 Depiction of subcellular localization of rhomboid superfamily members. Studies in tissue culture and yeast have revealed the molecular mechanisms through which rhomboid‐like proteins maintain homeostasis and cellular interactions. These proteins localize to various membrane‐bound compartments, including the ER, Golgi, endosomes, mitochondria, and plasma membrane and are increasingly recognized as key regulators of vast membrane‐related processes such as proteostasis, lipid homeostasis, and intercellular signaling (Nejatfard et al. 2021 2011 2016 2012 2011 2014 2021 2023 2019 nd 2016 1 3 Table 1 Rhomboid proteins and their physiological and pathological roles, substrates, and pathways. Phenotypes described in the table have been identified from three categories: In vitro (tested in bacteria, yeast, tissue culture or patient samples), in vivo (tested in vertebrate animal models), or bioinformatics (potential role identified from sequencing databanks or phenotypic screen). Rhomboid proteins Main Physiological and pathological roles Associated substrates Molecular pathways Published models References RHBDL2 Skin Regeneration (in vitro, in vivo) Thrombomodulin, Spint1 None, embryonic lethality observed in mammalian knockouts Cheng et al. ( 2011 2017 Bone Development and Homeostasis (in vitro, in vivo) Thrombomodulin IL11R signaling Koch et al. ( 2021 2020 2021 2022 2023 Female Fertility and Menopause (bioinformatics) Unknown Iager et al. ( 2013 2016 2021 Cancer (Pancreatic, breast) (in vitro, in vivo) Notch signaling Cheng et al. ( 2014 2022 2021 RHBDL4 Cancer (Lung, colorectal, gastric, and pancreatic) (in vitro, in vivo) ZEB1/PI3K/AKT, Wnt/B‐catenin, EGFR, AKT/B‐catenin ZEB1/PI3K/AKT, Wnt/B‐catenin, EGFR, AKT/B‐catenin RHBDL4 mouse xenograft Niu et al. ( 2019 2021 2022 2020 2023 Cancer (glioblastoma, breast, ovarian, non small cell lung, colorectal) (in vitro, in vivo) miRNA‐211‐3p, miR‐138, miR‐5195‐3p, miR‐294, mi145‐5p regulation Zhao et al. ( 2019 2019 2022 2023 2020 2023 Alzheimer's disease (in vitro, in vivo) amyloid precursor protein (APP) Homozygous R4 ‐/‐ Paschkowsky et al. ( 2016 2024 Charcot–Marie–Tooth disease (in vitro) MPZ‐L170R Fleig et al. ( 2012 Kawasaki disease and inflammation (in vivo, bioinformatics) TMED7 TLR4 pathway Homozygous R4 ‐/‐ Knopf et al. ( 2024 Lipid homeostasis (in vitro, in vivo) SREBP‐1c RHBDL4 CRISPR KO Mouse Han et al. ( 2023 2022 Spermatogenesis, and sex determination (bioinformatics) Unknown Wang, Hua et al. ( 2008 2021 Growth, development, and apoptosis (in vitro) tumor suppressor activated pathway‐6 (TSAP6) and BIK EGFR signaling Wan et al. ( 2012 2015 2008 2009 2021 ER stress and homeostasis (in vitro, in vivo) ER‐associated degradation (ERAD) pathway Homozygous R4 ‐/‐ Kandel and Neal ( 2020 2014 2022 PARL Adipogenesis (in vitro) f‐PINK1 PARL‐PINK1‐Parkin pathway Shiau et al. ( 2017 Mitochondrial biogenesis, apoptosis, and ferroptosis (in vitro) Pgam5 (biogenesis), DIABLO (apoptosis), STARD7 (ferroptosis) Wnt signaling, OPA1‐mediated cristae remodeling Saita et al. ( 2017 2018 2023 Spermatogenesis (in vivo) Unknown but related to ferroptosis full KO ( Parl  ‐/‐ Schumacher et al. ( 2024 2023 Parkinson's disease (in vitro) PINK1 PARL‐PINK1‐Parkin pathway Shi et al. ( 2011 Dementia with lewy bodies (bioinformatics) Unknown Wüst et al. ( 2016 Alzheimer's disease (in vitro) Unknown Kawamoto et al. ( 2020 Amyotrophic lateral sclerosis (ALS) (in vitro, in vivo) PINK1 Liu et al. ( 2023 Diabetic cardiomyopathy (in vitro, in vivo) L‐carnitine mediated microvascular regulation Li et al. ( 2023 Pancreatic Cancer (in vitro, in vivo) STOML2‐mediated chemosenstitivity Qin et al. ( 2023 Leigh‐like syndrome (in vivo) Co‐enzyme Q depletion in electron transport chain Conditional KO ( Parl  lox/lox Parl  ‐/‐ Parl  L/L:: Nes  Cre Spinazzi et al. ( 2019 Barth's syndrome (in vitro) Cardiolipin regulaiton Anzmann et al. ( 2021 Dopaminergic neurodegeneration (in vivo) Unknown Full KO ( parla  ‐/‐ ) Merhi et al. ( 2021 RHBDL3 Aging (bioinformatics) Unknown No characterized models Kumar et al. ( 2013 Schizophrenia (bioinformatics) Cerezo et al. ( 2025 Adolescent Idiopathic Scoliosis (bioinformatics) Body height, chronotype measurement, blood pressure (bioinformatics) RHBDL1 Circadian rhythmicity (bioinformatics) Unknown None, embryonic lethality observed in mammalian knockouts Zhang et al. ( 2020 iRhom1 Cancer (breast, colorectal, liver, head and neck) (in vitro, in vivo) ADAM17 EGFR, Wnt/β‐catenin signaling iRhom1 siRNA in mouse Luo et al. ( 2024 2014 2018 Childhood‐onset cardiomyopathy (bioinformatics) Unknown Al‐Hassnan et al. ( 2020 Bone development (in vivo)  ADAM17 Unknown EGFR signaling (TGFɑ) Chondrocyte‐specific deletion of iRhom1 in iRhom2 KO ( iRhom2  ‐/‐ iRhom1  fl/fl Col2a1‐cre Fang et al. ( 2020 Eyelid morphology (in vivo) Presumed ADAM17 Presumed EGFR signaling Epithelial‐specific deletion of iRhom1 in iRhom2 KO ( Rhbdf1  flox/flox‐2.9kb Rhbdf2  ‐/‐ KRT14‐Cre Erhardt et al. ( 2025 Endothelial development (in vivo) Unknown Endothelial‐specific deletion of iRhom1 in iRhom2 KO ( Rhbdf1  flox/flox‐2.9kb Rhbdf2  ‐/‐ Cdh5‐cre iRhom2 Tylosis with esophageal cancer (TOC) (in vitro, in vivo, bioinformatics) ADAM17 EGFR signaling (amphiregulin) N‐terminal SNP in iRhom2 with presumed gain‐of function ( Rhbdf2  P159L/P159L Blaydon et al. ( 2012 2017 2012 2018 Skin and hair development (in vivo) N‐terminal deletion in iRhom2 ( Rhbdf2  cub/cub Rhbdf2  uncv/uncv Hosur et al. ( 2014 2003 2014 1999 2014 Myocardial infarction (in vivo) TNFɑ signaling iRhom2 KO ( Rhbdf2  ‐/‐ Barnette et al. ( 2018 Lupus nephritis (in vivo) TNFɑ, HB‐EGF/EGFR signaling Qing et al. ( 2018 Liver disease (fibrosis, steatosis, alcohol induced damage) (in vivo) TNFɑ, TNFR signaling Liu et al. ( 2022 2019 Viral infection (DNA and RNA viruses) (in vitro, in vivo) STING, VISA Interferon signaling Luo et al. ( 2016 2017 Bacterial infection ( Listeria monocytogenes ADAM17 TNFɑ signaling McIlwain et al. ( 2012 Rheumatoid arthritis (in vitro, in vivo) Issuree et al. ( 2013 Metabolic disease (hyperlipidemia, atherosclerosis) (in vivo) iRhom2 KO in low‐density lipoprotein receptor KO ( LDLR  ‐/‐ iRhom2  ‐/‐ Hannemann et al. ( 2022 Inflammatory bowel disease, colitis (in vitro, in vivo) TNFɑ signaling (JAM‐A) Giese et al. ( 2021 Alzheimer's disease (bioinformatics) Unknown De Jager et al. ( 2014 Derlin‐1 Embryonic development (in vivo) Unknown Embryonic lethality observed in floxed KO ( Derl1  f/f Eura et al. ( 2012 Postnatal brain development (in vivo) CNS specific deletion ( Derl1  NesCre Derl1  CaMKIIαCre Sugiyama et al. ( 2021 Breast Cancer (in vitro) TMEM63A TOLLIP‐mediated autophagy Wang, Hua et al. ( 2008 Muscle Invasive Bladder Cancer (in vitro, bioinformatics) AKT/Bcl‐2 pathway Dong et al. ( 2017 Derlin‐2 Bone Development (in vivo) Unknown Floxed KO ( Derl2  f/f Dougan et al. ( 2011 Cholangiocarcinoma (in vitro, bioinformatics) Liu et al. ( 2024 Diabetic nephropathy (in vivo) Podocyte specific knockout (derlin‐2 ∆podocyte Ren et al. ( 2018 Derlin‐3 Lung adenocarcinoma (in vitro, bioinformatics) Derlin‐3 full KO mice viable Eura et al. ( 2012 2022 John Wiley & Sons, Ltd. Figure 3 Schematic illustration showing various rhomboid family proteins, including RHBDL1–4, PARL, iRhom1/2, and Derlin proteins (Derlin1–3) implicated to function across various human tissues. Each inset highlights a specific organ or tissue and lists rhomboid‐related proteins with documented functional roles in that region, based on experimental evidence. In this review, we highlight the emerging roles of rhomboid proteins in development and disease using cell culture and vertebrate model systems from the past 25 years. Along with in vivo studies that have associated rhomboid proteases & pseudoproteases with specific changes, we have compiled data from bioinformatics analyses that identify rhomboid proteases as novel factors contributing to disease. Throughout this review we use physiological and pathological subheadings for organizational clarity, but we view pathology as a continuum of dysregulation of rhomboid‐mediated pathways. In most cases, the same pathways that govern normal development and homeostasis explains the disease association we summarize. Finally, we introduce future perspectives on how rhomboid‐like proteins may be used as targets for therapies to attenuate the effects of biological stress using novel vertebrate knockout models. 2 Rhomboid Proteases 2.1 RHBDL2 2.1.1 Physiological Role of RHBDL2 RHBDL2 is the mammalian homolog of Drosophila 2001 2004 2011 2020 2017 2011 2016 2020 2021 2021 2022 2011 2020 nd 2013 2016 2021 2.1.2 Pathological Role of RHBDL2 RHBDL2 plays a major role in cancer progression and is a potential marker for various carcinomas. Indeed, patient sample analyses identified RHBDL2 as a prognostic marker in pancreatic cancer (PC), breast cancer, osteosarcoma, pancreatic ductal adenocarcinoma (PDAC), and colorectal cancer (Canzoneri et al. 2014 2020 2022 2024 2022 2023 2014 + 2021 2019 2023 2020 2.2 RHBDL4 2.2.1 Physiological Role of RHBDL4 The mammalian rhomboid protease RHBDL4, also called RHBDD1, is an intramembrane protease localized in the ER membrane. Tissue culture studies demonstrated that RHBDL4 primarily mitigates ER stress as a member of the ER‐associated degradation (ERAD) pathway (Freeman 2014 2012 2020 2022 2022 2024 2012 2015 2016 2008 2009 2009 2021 2023 2022 2.2.2 Pathological Role of RHBDL4 RHBDL4 plays an important role in regulating cancer‐associated pathways. Its expression has been linked to a range of malignancies, including breast cancer, colorectal cancer, nonsmall cell lung cancer (NSCLC), ovarian cancer (OC), liver cancer, pancreatic adenocarcinoma, and glioma (Song et al. 2015 2019 2019 2019 2021 2021 2022 2022 2023 2023 2021 2020 2020 2022 2023 2019 2019 2022 2023 2020 2020 2022 2023 2023 2019 2020 2022 2023 2022 Beyond cancer, RHBDL4 has been implicated in neurological and inflammatory diseases. It cleaves amyloid precursor protein (APP) in vitro, reducing secretion of Aβ peptide, the molecular driver of Alzheimer's disease (AD) (Paschkowsky et al. 2016 2024 2025 2012 2025 2024 2021 2.3 PARL 2.3.1 Physiological Role of PARL PARL is a rhomboid protease present in the mitochondrial inner membrane (McQuibban et al. 2003 2006 2010 2013 2021 2012 2006 2017 2017 2018 2023 2024 2023 2.3.2 Pathological Role of PARL PARL is a key regulator of the PINK1‐Parkin pathway, a major axis associated with the pathogenesis of Parkinson's disease (PD) (Jin et al. 2010 2015 2015 2020 2011 2016 parla 2021 2020 2020 2023 2023 Besides neurodegeneration, PARL defects have also been identified in other diseases. PARL/PINK1‐mediated mitophagy was shown to be regulated by L‐carnitine and STOML2 to alleviate cardiac microvascular dysfunction in diabetic cardiomyopathy in mice, and chemosensitivity in PC cells and mouse models, respectively (Li et al. 2023 2023 2019 2021 2.4 RHBDL1 and RHBDL3 2.4.1 Physiological Role of RHBDL1 and RHBDL3 RHBDL1 and RHBDL3 remain the most enigmatic proteases of the rhomboid superfamily, with no characterized functions despite high conservation and lethal phenotypes in mouse knockout models (International Mouse Phenotyping Consortium, mousephenotype.org nd 2004 2016 2016 2015 2.4.2 Pathological Role of RHBDL1 and RHBDL3 The roles of RHBDL1 and RHBDL3 in disease remain poorly understood due to limited research. However, their established importance in development suggests that dysregulation of these proteases may contribute to human pathologies. Notably, RHBDL3 has been implicated in aging, showing one of the strongest correlations with chronological age (Kumar et al. 2013 2025 2020 3 Rhomboid Pseudoproteases 3.1 iRhoms 3.1.1 Physiological Role of iRhoms iRhom1 (RHBDF1) and iRhom2 (RHBDF2) are rhomboid‐like proteins that lack proteolytic activity, classifying them as rhomboid pseudoproteases. Despite their classification as pseudoproteases, both iRhom1 and iRhom2 play critical roles in regulating growth factor and inflammatory signaling by facilitating trafficking, maturation, and activity of client proteins throughout the cell, as demonstrated in both in vitro systems and animal models (Zettl et al. 2011 2012 2013 2015 2015 2017 2018 2013 2018 2012 2012 2021 2013 2015 2012 2015 2012 iRhoms are essential for embryonic development; mice lacking both iRhoms exhibit perinatal lethality and multiorgan pathology, closely resembling phenotypes observed in mice lacking ADAM17 (Christova et al. 2013 2015 2019 2020 2013 2015 2013 2015 2015 2020 2020 2021 2020 2025 Rhbdf1  flox/flox‐2.9kb Rhbdf2  ‐/‐ KRT14‐cre) Rhbdf1  flox/flox‐2.9kb Rhbdf2  ‐/‐ Cdh5‐cre in utero 2012 2014 2017 2017 2017 cub curly bare cub 2014 2003 2014 3.1.2 Pathological Role of iRhoms iRhoms are implicated in various human diseases including cancer, neurodegeneration, autoimmunity, infection, and inflammatory digestive conditions (see Table 1 2012 2012 2018 2009 2024 2024 1 2021 2021 2022 2022 2019 2020 2020 2022 2013 2020 2025 3.2 Derlins 3.2.1 Physiological Role of Derlins The yeast derlin, Der1, was identified in a screen for mutants defective in ER‐associated degradation (Knop et al. 1996 2004 2006 2018 2006 2004 2004 2021 2006 2004 2004 2021 2023 2012 2011 2011 2021 3.2.2 Pathological Roles of Derlins Derlins are frequently overexpressed in a range of cancer types, where they help tumor cells adapt to cytotoxic stress. As tumors grow rapidly, they trigger intrinsic stress pathways, such as the unfolded protein response (UPR), to maintain proteostasis and support survival (Wang and Kaufman 2014 2008 2022 2022 2017 2017 2024 2022 2024 2024 2018 2018 2022 4 Conclusion Research into the physiological and pathological roles of the rhomboid superfamily has rapidly expanded over the past 25 years. Their remarkable structural conservation and presence across all domains of life reflect their fundamental biological importance. While vertebrate model systems have begun to reveal their cellular functions and organismal relevance, most studies to date have focused on knockout phenotypes, leaving their precise mechanisms of action in multicellular contexts largely unexplored. In particular, the contribution of rhomboid proteins to coordinated cellular behaviors during vertebrate embryogenesis remains poorly understood. To bridge these gaps, studies across vertebrate systems provide powerful opportunities to dissect rhomboid‐dependent processes in vivo with high resolution. Given the limitations of mammalian systems, particularly early embryonic lethality, other vertebrate models offer valuable opportunities to explore the physiological relevance of rhomboid proteases (Bhaduri, Aguayo et al. 2023 2013 Author Contributions The review was conceptualized by Saroj Gourkanti and Yazmin Munoz. The original draft was prepared by all authors, with all authors also contributing to the review and editing process. Figures were prepared by Jacqueline Cheung. Conflicts of Interest The authors declare no conflicts of interest. Acknowledgments These studies were supported by NIH grant 2R35GM133565‐01, Pew Biomedical Award (304700), NSF CAREER (2047391), CZI Diversity Leadership Award, HHMI Freeman Hrabowski Scholar Award to S.E.N. We thank additional Neal lab members for their feedback. Data Availability Statement Data sharing not applicable to this article as no data sets were generated or analyzed. References Adrain C. M. Cavadas 2020 The Complex Life of Rhomboid Pseudoproteases FEBS Journal 287 4261 4283 32894651 10.1111/febs.15548 Adrain C. K. Strisovsky M. Zettl L. Hu M. K. Lemberg M. Freeman 2011 Mammalian EGF Receptor Activation by the Rhomboid Protease RHBDL2 EMBO Reports 12 421 427 21494248 10.1038/embor.2011.50 PMC3090019 Adrain C. M. Zettl Y. Christova N. Taylor M. Freeman 2012 Tumor Necrosis Factor Signaling Requires iRhom2 to Promote Trafficking and Activation of TACE Science 335 225 228 22246777 10.1126/science.1214400 PMC3272371 Al‐Hassnan Z. N. A. Almesned S. Tulbah 2020 Categorized Genetic Analysis in Childhood‐Onset Cardiomyopathy Circulation. Genomic and Precision Medicine 13 504 514 32870709 10.1161/CIRCGEN.120.002969 Anzmann A. F. O. L. Sniezek A. Pado 2021 Diverse Mitochondrial Abnormalities in a New Cellular Model of TAFFAZZIN Deficiency Are Remediated by Cardiolipin‐Interacting Small Molecules Journal of Biological Chemistry 297 101005 34314685 10.1016/j.jbc.2021.101005 PMC8384898 Badenes M. A. Amin I. González‐García 2020 Deletion of iRhom2 Protects Against Diet‐Induced Obesity by Increasing Thermogenesis Molecular Metabolism 31 67 84 31918923 10.1016/j.molmet.2019.10.006 PMC6909339 Baker R. P. S. Urban 2015 Cytosolic Extensions Directly Regulate a Rhomboid Protease by Modulating Substrate Gating Nature 523 101 105 25970241 10.1038/nature14357 PMC4490020 Baldridge R. D. T. A. Rapoport 2016 Autoubiquitination of the Hrd1 Ligase Triggers Protein Retrotranslocation in ERAD Cell 166 394 407 27321670 10.1016/j.cell.2016.05.048 PMC4946995 Barnette D. N. T. J. Cahill M. Gunadasa‐Rohling C. A. Carr M. Freeman P. R. Riley 2018 iRhom2‐mediated Proinflammatory Signalling Regulates Heart Repair Following Myocardial Infarction JCI Insight 3 98268 29415889 10.1172/jci.insight.98268 PMC5821194 Bergbold N. M. K. Lemberg 2013 Emerging Role of Rhomboid Family Proteins in Mammalian Biology and Disease Biochimica et Biophysica Acta (BBA) ‐ Biomembranes 1828 2840 2848 23562403 10.1016/j.bbamem.2013.03.025 Bernkopf D. B. K. Jalal M. Brückner 2018 Pgam5 Released From Damaged Mitochondria Induces Mitochondrial Biogenesis via Wnt Signaling Journal of Cell Biology 217 1383 1394 29438981 10.1083/jcb.201708191 PMC5881504 Bhaduri S. A. Aguayo Y. Ohno 2023 An Erad‐Independent Role for Rhomboid Pseudoprotease Dfm1 in Mediating Sphingolipid Homeostasis EMBO Journal 42 e112275 36350249 10.15252/embj.2022112275 PMC9929635 Bhaduri S. M. K. E. Braza S. Stanchev 2025 An In Vitro Journal of Biological Chemistry 301 108275 39922490 10.1016/j.jbc.2025.108275 PMC11929074 Bhaduri S. N. A. Scott S. E. Neal 2023 The Role of the Rhomboid Superfamily in ER Protein Quality Control: From Mechanisms and Functions to Diseases Cold Spring Harbor Perspectives in Biology 15 a041248 35940905 10.1101/cshperspect.a041248 PMC9899648 Blaydon D. C. S. L. Etheridge J. M. Risk 2012 RHBDF2 Mutations Are Associated With Tylosis, a Familial Esophageal Cancer Syndrome American Journal of Human Genetics 90 340 346 22265016 10.1016/j.ajhg.2011.12.008 PMC3276661 Bock J. N. Kühnle J. D. Knopf 2022 Rhomboid Protease RHBDL4 Promotes Retrotranslocation of Aggregation‐Prone Proteins for Degradation Cell Reports 40 111175 35947953 10.1016/j.celrep.2022.111175 PMC9437926 Buda P. M. Chyb A. Smorczewska‐Kiljan 2021 Association Between rs12037447, rs146732504, rs151078858, rs55723436, and rs6094136 Polymorphisms and Kawasaki Disease in the Population of Polish Children Frontiers in Pediatrics 9 624798 33692975 10.3389/fped.2021.624798 PMC7937642 Burzenski L. M. B. E. Low V. Kohar L. D. Shultz M. V. Wiles V. Hosur 2021 Inactive Rhomboid Proteins RHBDF1 and RHBDF2 (iRhoms): A Decade of Research in Murine Models Mammalian Genome 32 415 426 34477920 10.1007/s00335-021-09910-3 PMC8580931 Canzoneri R. E. Lacunza M. Isla Larrain M. V. Croce M. C. Abba 2014 Rhomboid Family Gene Expression Profiling in Breast Normal Tissue and Tumor Samples Tumor Biology 35 1451 1458 24185965 10.1007/s13277-013-1199-8 Cerezo M. E. Sollis Y. Ji 2025 The NHGRI‐EBI Gwas Catalog: Standards for Reusability, Sustainability and Diversity Nucleic Acids Research 53 D998 D1005 39530240 10.1093/nar/gkae1070 PMC11701593 Chan E. Y. L. G. A. McQuibban 2013 The Mitochondrial Rhomboid Protease: Its Rise From Obscurity to the Pinnacle of Disease‐Relevant Genes Biochimica et Biophysica Acta (BBA) ‐ Biomembranes 1828 2916 2925 24099009 10.1016/j.bbamem.2013.05.012 Chang L. H. Yao Z. Yao 2021 Comprehensive Analysis of Key Genes, Signaling Pathways and miRNAs in Human Knee Osteoarthritis: Based on Bioinformatics Frontiers in Pharmacology 12 730587 34497524 10.3389/fphar.2021.730587 PMC8419250 Chen C.‐H. C. H. Lai Y. K. Hong 2020 Thrombomodulin Functional Domains Support Osteoblast Differentiation and Bone Healing in Diabetes in Mice Journal of Bone and Mineral Research 35 1812 1823 32329910 10.1002/jbmr.4036 Chen H. X. Han H. Sun T. Xie X. Fan 2024 Genomic Nursing Science Revealed the Prolyl 4‐Hydroxylase Subunit Alpha 2 as a Significant Biomarker Involved In Osteosarcoma Heliyon 10 e27191 38468936 10.1016/j.heliyon.2024.e27191 PMC10926143 Chen L. X. Wang Y. Zhu F. Liu L. Liu N. Jiang 2022 Effects of miR‐211‐3p/RHBDD1 Axis on Cell Proliferation, Cell Cycle Progression, and Epithelial‐Mesenchymal Transition in Glioma Folia Neuropathologica 60 195 209 35950472 10.5114/fn.2022.118186 Chen S. K. Cai D. Zheng 2022 RHBDL2 Promotes the Proliferation, Migration, and Invasion of Pancreatic Cancer by Stabilizing the N1ICD via the OTUD7B and Activating the Notch Signaling Pathway Cell Death & Disease 13 945 36351890 10.1038/s41419-022-05379-3 PMC9646733 Chen S.‐D. W. Zhang Y. W. Feng 2023 Genome‐Wide Survival Study Identifies PARL as a Novel Locus for Clinical Progression and Neurodegeneration in Alzheimer's Disease Biological Psychiatry 94 732 742 36870520 10.1016/j.biopsych.2023.02.992 Cheng T.‐L. C. H. Lai S. J. Jiang 2014 RHBDL2 Is a Critical Membrane Protease for Anoikis Resistance in Human Malignant Epithelial Cells Scientific World Journal 2014 e902987 10.1155/2014/902987 PMC4058132 24977233 Cheng T.‐L. Y. T. Wu H. Y. Lin 2011 Functions of Rhomboid Family Protease RHBDL2 and Thrombomodulin in Wound Healing Journal of Investigative Dermatology 131 2486 2494 21833011 10.1038/jid.2011.230 Christova Y. C. Adrain P. Bambrough A. Ibrahim M. Freeman 2013 Mammalian iRhoms Have Distinct Physiological Functions Including an Essential Role in TACE Regulation EMBO Reports 14 884 890 23969955 10.1038/embor.2013.128 PMC3807218 De Jager P. L. G. Srivastava K. Lunnon 2014 Alzheimer's Disease: Early Alterations in Brain DNA Methylation at ANK1, BIN1, RHBDF2 and Other Loci Nature Neuroscience 17 1156 1163 25129075 10.1038/nn.3786 PMC4292795 Disoma C. Y. Zhou S. Li J. Peng Z. Xia 2022 Wnt/β‐catenin Signaling in Colorectal Cancer: Is Therapeutic Targeting Even Possible? Biochimie 195 39 53 35066101 10.1016/j.biochi.2022.01.009 Dong Q. L. Fu Y. Zhao S. Tan E. Wang 2017 Derlin‐1 Overexpression Confers Poor Prognosis in Muscle Invasive Bladder Cancer and Contributes to Chemoresistance and Invasion Through PI3K/AKT and ERK/MMP Signaling Oncotarget 8 17059 17069 28178653 10.18632/oncotarget.15001 PMC5370022 Dougan S. K. C. C. A. Hu M. E. Paquet 2011 Derlin‐2‐Deficient Mice Reveal an Essential Role for Protein Dislocation in Chondrocytes Molecular and Cellular Biology 31 1145 1159 21220515 10.1128/MCB.00967-10 PMC3067910 Dulloo I. S. Muliyil M. Freeman 2019 The Molecular, Cellular and Pathophysiological Roles of iRhom Pseudoproteases Open Biology 9 190003 30890028 10.1098/rsob.190003 PMC6451368 Düsterhöft S. U. Künzel M. Freeman 2017 Rhomboid Proteases in Human Disease: Mechanisms and Future Prospects Biochimica et Biophysica Acta (BBA) ‐ Molecular Cell Research 1864 2200 2209 28460881 10.1016/j.bbamcr.2017.04.016 Erhardt V. E. Hartig K. Lorenzo H. R. Megathlin B. Tarchini V. Hosur 2025 Systematic Optimization and Prediction of Cre Recombinase for Precise Genome Editing in Mice Genome Biology 26 85 40186303 10.1186/s13059-025-03560-3 PMC11971878 Eura Y. H. Yanamoto Y. Arai T. Okuda T. Miyata K. Kokame 2012 Derlin‐1 Deficiency Is Embryonic Lethal, Derlin‐3 Deficiency Appears Normal, and Herp Deficiency Is Intolerant to Glucose Load and Ischemia in Mice PLoS One 7 e34298 22479592 10.1371/journal.pone.0034298 PMC3315519 Fang R. C. Haxaire M. Otero 2020 Role of iRhoms 1 and 2 in Endochondral Ossification International Journal of Molecular Sciences 21 8732 33227998 10.3390/ijms21228732 PMC7699240 Fleig L. N. Bergbold P. Sahasrabudhe B. Geiger L. Kaltak M. K. Lemberg 2012 Ubiquitin‐Dependent Intramembrane Rhomboid Protease Promotes ERAD of Membrane Proteins Molecular Cell 47 558 569 22795130 10.1016/j.molcel.2012.06.008 Freeman M. 2014 The Rhomboid‐Like Superfamily: Molecular Mechanisms and Biological Roles Annual Review of Cell and Developmental Biology 30 235 254 10.1146/annurev-cellbio-100913-012944 25062361 Giese A. A. A. Babendreyer P. Krappen 2021 Inflammatory Activation of Surface Molecule Shedding by Upregulation of the Pseudoprotease iRhom2 in Colon Epithelial Cells Scientific Reports 11 24230 34930929 10.1038/s41598-021-03522-2 PMC8688420 Greenblatt E. J. J. A. Olzmann R. R. Kopito 2011 Derlin‐1 Is a Rhomboid Pseudoprotease Required for the Dislocation of Mutant α‐1 Antitrypsin From the Endoplasmic Reticulum Nature Structural & Molecular Biology 18 1147 1152 10.1038/nsmb.2111 PMC3196324 21909096 Grieve A. G. H. Xu U. Künzel P. Bambrough B. Sieber M. Freeman 2017 Phosphorylation of iRhom2 at the Plasma Membrane Controls Mammalian TACE‐Dependent Inflammatory and Growth Factor Signalling eLife 6 e23968 28432785 10.7554/eLife.23968 PMC5436907 Han S.‐I. M. Nakakuki Y. Nakagawa 2023 Rhomboid Protease RHBDL4/RHBDD1 Cleaves SREBP‐1c at Endoplasmic Reticulum Monitoring and Regulating Fatty Acids PNAS Nexus 2 pgad351 37954160 10.1093/pnasnexus/pgad351 PMC10637267 Hannemann C. J. H. Schecker A. Brettschneider 2022 Deficiency of Inactive Rhomboid Protein 2 (iRhom2) Attenuates Diet‐Induced Hyperlipidaemia and Early Atherogenesis Cardiovascular Research 118 156 168 33576385 10.1093/cvr/cvab041 PMC8932158 Hill R. B. L. Pellegrini 2010 The PARL Family of Mitochondrial Rhomboid Proteases Seminars in Cell & Developmental Biology 21 582 592 20045481 10.1016/j.semcdb.2009.12.011 PMC2908206 Hitt R. D. Wolf 2004 Der1p, a Protein Required for Degradation of Malfolded Soluble Proteins of the Endoplasmic Reticulum: Topology and Der1‐Like Proteins FEMS Yeast Research 4 721 729 15093775 10.1016/j.femsyr.2004.02.003 Hosur V. K. R. Johnson L. M. Burzenski T. M. Stearns R. S. Maser L. D. Shultz 2014 Rhbdf2 Mutations Increase Its Protein Stability and Drive EGFR Hyperactivation Through Enhanced Secretion of Amphiregulin Proceedings of the National Academy of Sciences 111 E2200 E2209 10.1073/pnas.1323908111 PMC4040562 24825892 Hosur V. B. E. Low D. Li 2020 Genes Adapt to Outsmart Gene‐Targeting Strategies in Mutant Mouse Strains by Skipping Exons to Reinitiate Transcription and Translation Genome Biology 21 168 32646486 10.1186/s13059-020-02086-0 PMC7350591 Hosur V. B. E. Low L. D. Shultz M. V. Wiles 2017 Genetic Deletion of Amphiregulin Restores the Normal Skin Phenotype in a Mouse Model of the Human Skin Disease Tylosis Biology Open 6 1174 1179 28655741 10.1242/bio.026260 PMC5576083 Iager A. E. A. M. Kocabas H. H. Otu 2013 Identification of a Novel Gene Set in Human Cumulus Cells Predictive of an Oocyte's Pregnancy Potential Fertility and Sterility 99 745 752.e6 23200692 10.1016/j.fertnstert.2012.10.041 Issuree P. D. A. T. Maretzky D. R. McIlwain 2013 iRHOM2 Is a Critical Pathogenic Mediator of Inflammatory Arthritis Journal of Clinical Investigation 123 928 932 23348744 10.1172/JCI66168 PMC3561822 Jayathirtha M. T. Jayaweera D. Whitham 2023 Two‐Dimensional‐Page Coupled With Nlc‐Ms/Ms‐Based Identification of Differentially Expressed Proteins and Tumorigenic Pathways in MCF7 Breast Cancer Cells Transfected for JTB Protein Silencing Molecules 28 7501 38005222 10.3390/molecules28227501 PMC10673289 Jeyaraju D. V. L. Xu M. C. Letellier 2006 Phosphorylation and Cleavage of Presenilin‐Associated Rhomboid‐Like Protein (PARL) Promotes Changes in Mitochondrial Morphology Proceedings of the National Academy of Sciences 103 18562 18567 10.1073/pnas.0604983103 PMC1693702 17116872 Jiang J. Y. Cheng S. Dai B. Zou X. Guo 2022 Suppression of Rhomboid Domain‐Containing 1 Produces Anticancer Effects in Pancreatic Adenocarcinoma Through Affection of the AKT/GSK‐3β/β‐Catenin Pathway Environmental Toxicology 37 1944 1956 35442567 10.1002/tox.23541 Ji‐Hua S. H. I. X. U. Xue C. U. I. Hai‐meng Z. Pan L. U. O. Quing‐feng X. U. Le 2019 Value of Serum RHBDD1,Pepsinogen and CEA in the Early Diagnosis of Gastric Cancer Basic & Clinical Medicine 39 1316 Jin S. M. M. Lazarou C. Wang L. A. Kane D. P. Narendra R. J. Youle 2010 Mitochondrial Membrane Potential Regulates PINK1 Import and Proteolytic Destabilization by PARL Journal of Cell Biology 191 933 942 21115803 10.1083/jcb.201008084 PMC2995166 Johnson K. R. P. W. Lane S. A. Cook 2003 Curly Bare ( Cub mcub Genomics 81 6 14 12573256 10.1016/s0888-7543(02)00013-7 Johnson N. J. Březinová E. Stephens 2017 Quantitative Proteomics Screen Identifies a Substrate Repertoire of Rhomboid Protease RHBDL2 in Human Cells and Implicates it in Epithelial Homeostasis Scientific Reports 7 7283 28779096 10.1038/s41598-017-07556-3 PMC5544772 Kandel R. R. S. E. Neal 2020 The Role of Rhomboid Superfamily Members in Protein Homeostasis: Mechanistic Insight and Physiological Implications Biochimica et Biophysica Acta (BBA) ‐ Molecular Cell Research 1867 118793 32645330 10.1016/j.bbamcr.2020.118793 PMC7434706 Kang L. A. L. Yang C. H. Lai 2023 Chondrocyte Thrombomodulin Protects Against Osteoarthritis International Journal of Molecular Sciences 24 9522 37298473 10.3390/ijms24119522 PMC10253941 Kawamoto Y. T. Ayaki M. Urushitani H. Ito R. Takahashi 2020 Accumulation of HAX‐1 and PARL in Brainstem‐ and Cortical‐Type Lewy Bodies in Parkinson's Disease and Dementia With Lewy Bodies Journal of the Neurological Sciences 415 116928 32470650 10.1016/j.jns.2020.116928 Kespohl B. T. Schumertl J. Bertrand J. Lokau C. Garbers 2021 The Cytokine Interleukin‐11 Crucially Links Bone Formation, Remodeling and Resorption Cytokine & Growth Factor Reviews 60 18 27 33940443 10.1016/j.cytogfr.2021.04.002 Knop M. A. Finger T. Braun K. Hellmuth D. H. Wolf 1996 Der1, a Novel Protein Specifically Required for Endoplasmic Reticulum Degradation in Yeast EMBO Journal 15 753 763 8631297 PMC450274 Knopf J. D. N. Landscheidt C. L. Pegg 2020 Intramembrane Protease RHBDL4 Cleaves Oligosaccharyltransferase Subunits to Target Them for ER‐Associated Degradation Journal of Cell Science 133 jcs243790 32005703 10.1242/jcs.243790 Knopf J. D. S. S. Steigleder F. Korn 2024 RHBDL4‐triggered Downregulation of COPII Adaptor Protein TMED7 Suppresses TLR4‐mediated Inflammatory Signaling Nature Communications 15 1528 10.1038/s41467-024-45615-2 PMC10920636 38453906 Koch L. B. Kespohl M. Agthe 2021 Interleukin‐11 (IL‐11) Receptor Cleavage by the Rhomboid Protease RHBDL2 Induces IL‐11 Trans‐Signaling FASEB Journal 35 e21380 33566379 10.1096/fj.202002087R PMC12266321 Koni M. V. Pinnarò M. F. Brizzi 2020 The Wnt Signalling Pathway: A Tailored Target in Cancer International Journal of Molecular Sciences 21 7697 33080952 10.3390/ijms21207697 PMC7589708 Koonin E. V. K. S. Makarova I. B. Rogozin L. Davidovic M. C. Letellier L. Pellegrini 2003 The Rhomboids: A Nearly Ubiquitous Family of Intramembrane Serine Proteases That Probably Evolved by Multiple Ancient Horizontal Gene Transfers Genome Biology 4 R19 12620104 10.1186/gb-2003-4-3-r19 PMC153459 Kubo S. J. M. Fritz H. M. Raquer‐McKay 2022 Congenital iRHOM2 Deficiency Causes ADAM17 Dysfunction and Environmentally Directed Immunodysregulatory Disease Nature Immunology 23 75 85 34937930 10.1038/s41590-021-01093-y PMC11060421 Kumar A. J. R. Gibbs A. Beilina 2013 Age‐Associated Changes in Gene Expression in Human Brain and Isolated Neurons Neurobiology of Aging 34 1199 1209 23177596 10.1016/j.neurobiolaging.2012.10.021 PMC3545059 Künzel U. A. G. Grieve Y. Meng B. Sieber S. A. Cowley M. Freeman 2018 FRMD8 Promotes Inflammatory and Growth Factor Signalling by Stabilising the iRhom/ADAM17 Sheddase Complex eLife 7 e35012 29897336 10.7554/eLife.35012 PMC6042961 Lastun V. L. A. G. Grieve M. Freeman 2016 Substrates and Physiological Functions of Secretase Rhomboid Proteases Seminars in Cell & Developmental Biology 60 10 18 27497690 10.1016/j.semcdb.2016.07.033 Lastun V. L. C. Levet M. Freeman 2022 The Mammalian Rhomboid Protein RHBDL4 Protects Against Endoplasmic Reticulum Stress by Regulating the Morphology and Distribution of ER Sheets Journal of Biological Chemistry 298 101935 35436469 10.1016/j.jbc.2022.101935 PMC9136127 Lee W. Y. Kim J. Park 2015 iRhom1 Regulates Proteasome Activity via PAC1/2 Under ER Stress Scientific Reports 5 11559 26109405 10.1038/srep11559 PMC4479803 Leilei Y. L. Bing L. Yang 2014 iRhom2 Mutation Leads to Aberrant Hair Follicle Differentiation in Mice PLoS One 9 e115114 25546423 10.1371/journal.pone.0115114 PMC4278852 Lemberg M. K. M. Freeman 2007 Functional and Evolutionary Implications of Enhanced Genomic Analysis of Rhomboid Intramembrane Proteases Genome Research 17 1634 1646 17938163 10.1101/gr.6425307 PMC2045146 Lemberg M. K. J. Menendez A. Misik M. Garcia C. M. Koth M. Freeman 2005 Mechanism of Intramembrane Proteolysis Investigated With Purified Rhomboid Proteases EMBO Journal 24 464 472 15616571 10.1038/sj.emboj.7600537 PMC548647 Li S. M. Liu J. Chen 2023 L‐Carnitine Alleviates Cardiac Microvascular Dysfunction in Diabetic Cardiomyopathy by Enhancing pink1‐parkin cpt1a‐phb2‐parl Acta Physiologica 238 e13975 37042471 10.1111/apha.13975 Li S. R. D. P. Wang X. L. Yu 1999 Uncv (Uncovered): a New Mutation Causing Hairloss on Mouse Chromosome 11 Genetical Research 73 233 238 10425919 Li X. T. Maretzky G. Weskamp 2015 iRhoms 1 and 2 Are Essential Upstream Regulators of ADAM17‐Dependent EGFR Signaling Proceedings of the National Academy of Sciences 112 6080 6085 10.1073/pnas.1505649112 PMC4434755 25918388 Liang D. X. Jiang 2023 START Smuggling CoQ to Fight Ferroptosis Nature Cell Biology 2 207 208 10.1038/s41556-022-01044-1 36658221 Lilley B. N. H. L. Ploegh 2004 A Membrane Protein Required for Dislocation of Misfolded Proteins From the ER Nature 429 834 840 15215855 10.1038/nature02592 Lin L. G. Lin H. Lin 2022 Integrated Profiling of Endoplasmic Reticulum Stress‐Related DERL3 in the Prognostic and Immune Features of Lung Adenocarcinoma Frontiers in Immunology 13 906420 36275646 10.3389/fimmu.2022.906420 PMC9585215 Liu L. J. Wu Y. Yan S. Cheng S. Yu Y. Wang 2024 DERL2 (Derlin 2) Stabilizes BAG6 (BAG Cochaperone 6) in Chemotherapy Resistance of Cholangiocarcinoma Journal of Physiology and Biochemistry 80 81 97 37815698 10.1007/s13105-023-00986-w PMC10810035 Liu T. L. Wetzel Z. Zhu 2023 Disruption of Mitophagy Flux Through the PARL‐PINK1 Pathway by CHCHD10 Mutations or CHCHD10 Depletion Cells 12 2781 38132101 10.3390/cells12242781 PMC10741529 Liu Y. Q. Kuang X. Dai 2022 Deficiency in Inactive Rhomboid Protein2 (iRhom2) Alleviates Alcoholic Liver Fibrosis by Suppressing Inflammation and Oxidative Stress International Journal of Molecular Sciences 23 7701 35887045 10.3390/ijms23147701 PMC9317380 Lohi O. S. Urban M. Freeman O. Lohi 2004 Diverse Substrate Recognition Mechanisms for Rhomboids: Thrombomodulin Is Cleaved by Mammalian Rhomboids Current Biology 14 236 241 14761657 10.1016/j.cub.2004.01.025 Lokau J. B. Kespohl S. Kirschke C. Garbers 2022 The Role of Proteolysis in Interleukin‐11 Signaling Biochimica et Biophysica Acta (BBA) ‐ Molecular Cell Research 1869 119135 34624437 10.1016/j.bbamcr.2021.119135 Luo W.‐W. S. Li C. Li 2016 iRhom2 Is Essential for Innate Immunity to DNA Viruses by Mediating Trafficking and Stability of the Adaptor STING Nature Immunology 17 1057 1066 27428826 10.1038/ni.3510 Luo W.‐W. S. Li C. Li 2017 iRhom2 Is Essential for Innate Immunity to RNA Virus by Antagonizing ER‐ and Mitochondria‐Associated Degradation of VISA PLoS Pathogens 13 e1006693 29155878 10.1371/journal.ppat.1006693 PMC5722342 Luo Z. Y. Huang N. Batra 2024 Inhibition of iRhom1 by CD44‐Targeting Nanocarrier for Improved Cancer Immunochemotherapy Nature Communications 15 255 10.1038/s41467-023-44572-6 PMC10766965 38177179 Mayer U. C. Nüsslein‐Volhard 1988 A Group of Genes Required for Pattern Formation in the Ventral Ectoderm of the Drosophila Embryo Genes & Development 2 1496 1511 3209069 10.1101/gad.2.11.1496 McIlwain D. R. P. A. Lang T. Maretzky 2012 iRhom2 Regulation of TACE Controls TNF‐Mediated Protection Against Listeria and Responses to LPS Science 335 229 232 22246778 10.1126/science.1214448 PMC4250273 McQuibban G. A. S. Saurya M. Freeman 2003 Mitochondrial Membrane Remodelling Regulated by a Conserved Rhomboid Protease Nature 423 537 541 12774122 10.1038/nature01633 Meissner C. H. Lorenz B. Hehn M. K. Lemberg 2015 Intramembrane Protease PARL Defines a Negative Regulator of PINK1‐ and PARK2/Parkin‐Dependent Mitophagy Autophagy 11 1484 1498 26101826 10.1080/15548627.2015.1063763 PMC4590680 Merhi R. M. Kalyn A. Zhu‐Pawlowsky M. Ekker 2021 Loss of Parla Function Results in Inactivity, Olfactory Impairment, and Dopamine Neuron Loss in Zebrafish Biomedicines 9 205 33670667 10.3390/biomedicines9020205 PMC7922472 Mokoena T. J. g m Smit V. o Karusseit C. m Dorfling E. j van Rensburg 2018 Tylosis Associated With Squamous Cell Carcinoma of the Oesophagus (TOC): Report of an African Family With a Novel RHBDF2 Variant Clinical Genetics 93 1114 1116 29372562 10.1111/cge.13161 mousephenotype.org IMPC | International Mouse Phenotyping Consortium https://www.mousephenotype.org/ Neal S. P. A. Jaeger S. H. Duttke 2018 The Dfm1 Derlin Is Required for ERAD Retrotranslocation of Integral Membrane Proteins Molecular Cell 69 306 320.e4 29351849 10.1016/j.molcel.2017.12.012 PMC6049073 Nejatfard A. N. Wauer S. Bhaduri 2021 Derlin Rhomboid Pseudoproteases Employ Substrate Engagement and Lipid Distortion to Enable the Retrotranslocation of ERAD Membrane Substrates Cell Reports 37 109840 34686332 10.1016/j.celrep.2021.109840 PMC8641752 Niu Y. J. Zhang Y. Tong J. Li B. Liu 2019 miR‐145‐5p Restrained Cell Growth, Invasion, Migration and Tumorigenesis via Modulating RHBDD1 in Colorectal Cancer via the EGFR‐Associated Signaling Pathway International Journal of Biochemistry & Cell Biology 117 105641 31693935 10.1016/j.biocel.2019.105641 Noy P. J. R. K. Swain K. Khan P. Lodhia R. Bicknell 2016 Sprouting Angiogenesis Is Regulated by Shedding of the C‐Type Lectin Family 14, Member A (CLEC14A) Ectodomain, Catalyzed by Rhomboid‐Like 2 Protein (RHBDL2) FASEB Journal 30 2311 2323 26939791 10.1096/fj.201500122R Oda Y. T. Okada H. Yoshida R. J. Kaufman K. Nagata K. Mori 2006 Derlin‐2 and Derlin‐3 Are Regulated by the Mammalian Unfolded Protein Response and Are Required for ER‐Associated Degradation Journal of Cell Biology 172 383 393 16449189 10.1083/jcb.200507057 PMC2063648 Okatsu K. M. Kimura T. Oka K. Tanaka N. Matsuda 2015 Unconventional PINK1 Localization to the Outer Membrane of Depolarized Mitochondria Drives Parkin Recruitment Journal of Cell Science 128 964 978 25609704 10.1242/jcs.161000 PMC4342580 Paschkowsky S. M. Hamzé F. Oestereich L. M. Munter 2016 Alternative Processing of the Amyloid Precursor Protein Family by Rhomboid Protease RHBDL4 * Journal of Biological Chemistry 291 21903 21912 27563067 10.1074/jbc.M116.753582 PMC5063975 Penalva Y. C. M. S. Paschkowsky J. Yang 2024 Loss of the APP Regulator RHBDL4 Preserves Memory in an Alzheimer's Disease Mouse Model bioRxiv 2024.02.22.579698 10.1101/2024.02.22.579698 PMC11993729 40221411 Penalva Y. C. M. S. Paschkowsky J. Yang 2025 Loss of the APP Regulator RHBDL4 Preserves Memory in an Alzheimer's Disease Mouse Model Cell Death & Disease 16 280 40221411 10.1038/s41419-025-07579-z PMC11993729 Qiao X. Y. Zhang L. Sun 2021 Association of Human Breast Cancer CD44‐/CD24‐ Cells With Delayed Distant Metastasis eLife 10 e65418 34318746 10.7554/eLife.65418 PMC8346282 Qin C. Y. Wang B. Zhao 2023 STOML2 Restricts Mitophagy and Increases Chemosensitivity in Pancreatic Cancer Through Stabilizing PARL‐Induced PINK1 Degradation Cell Death & Disease 14 191 36906621 10.1038/s41419-023-05711-5 PMC10008575 Qing X. Y. Chinenov P. Redecha 2018 iRhom2 Promotes Lupus Nephritis Through TNF‐α and EGFR Signaling Journal of Clinical Investigation 128 1397 1412 29369823 10.1172/JCI97650 PMC5873859 Quinn P. M. J. P. I. Moreira A. F. Ambrósio C. H. Alves 2020 PINK1/PARKIN Signalling in Neurodegeneration and Neuroinflammation Acta Neuropathologica Communications 8 189 33168089 10.1186/s40478-020-01062-w PMC7654589 Radaelli E. C. A. Assenmacher J. Verrelle 2023 Mitochondrial Defects Caused by PARL Deficiency Lead to Arrested Spermatogenesis and Ferroptosis eLife 12 e84710 37505079 10.7554/eLife.84710 PMC10519710 Rahman F. P. Mahmud R. Karim T. Hossain F. Islam 2020 Determination of Novel Biomarkers and Pathways Shared by Colorectal Cancer and Endometrial Cancer via Comprehensive Bioinformatics Analysis Informatics in Medicine Unlocked 20 100376 Ren G. N. J. Tardi F. Matsuda 2018 Podocytes Exhibit a Specialized Protein Quality Control Employing Derlin‐2 in Kidney Disease American Journal of Physiology‐Renal Physiology 314 F471 F482 29167172 10.1152/ajprenal.00691.2016 Roshani M. D. Molavizadeh S. Sadeghi 2023 Emerging Roles of miR‐145 in Gastrointestinal Cancers: A New Paradigm Biomedicine & Pharmacotherapy = Biomedecine & Pharmacotherapie 166 115264 37619484 10.1016/j.biopha.2023.115264 Saarinen S. P. Vahteristo R. Lehtonen 2012 Analysis of a Finnish Family Confirms RHBDF2 Mutations as the Underlying Factor in Tylosis With Esophageal Cancer Familial cancer 11 525 528 22638770 10.1007/s10689-012-9532-8 Saita S. H. Nolte K. U. Fiedler 2017 PARL Mediates Smac Proteolytic Maturation in Mitochondria to Promote Apoptosis Nature Cell Biology 19 318 328 28288130 10.1038/ncb3488 Sato B. K. R. Y. Hampton 2006 Yeast Derlin Dfm1 Interacts With Cdc48 and Functions in ER Homeostasis Yeast 23 1053 1064 17083136 10.1002/yea.1407 Schmoker A. M. A. M. Ebert B. A. Ballif 2019 The DCBLD Receptor Family: Emerging Signaling Roles in Development, Homeostasis and Disease Biochemical Journal 476 931 950 30902898 10.1042/BCJ20190022 Schumacher S. L. Klose J. Lambertz 2024 The Mitochondrial Protease PARL Is Required for Spermatogenesis Communications Biology 7 44 38182793 10.1038/s42003-023-05703-3 PMC10770312 Sekine S. Y. Kanamaru M. Koike 2012 Rhomboid Protease PARL Mediates the Mitochondrial Membrane Potential Loss‐Induced Cleavage of PGAM5 Journal of Biological Chemistry 287 34635 34645 22915595 10.1074/jbc.M112.357509 PMC3464569 Shi G. J. R. Lee D. A. Grimes 2011 Functional Alteration of PARL Contributes to Mitochondrial Dysregulation in Parkinson's Disease Human Molecular Genetics 20 1966 1974 21355049 10.1093/hmg/ddr077 Shi J. B. Zhang J. Y. Choi 2016 Age at Menarche and Age at Natural Menopause in East Asian Women: A Genome‐Wide Association Study Age 38 513 523 27629107 10.1007/s11357-016-9939-5 PMC5266214 Shiau M.‐Y. P. S. Lee Y. J. Huang 2017 Role of PARL‐PINK1‐Parkin Pathway in Adipocyte Differentiation Metabolism: Clinical and Experimental 72 1 17 28641777 10.1016/j.metabol.2017.03.010 Shibuya K. K. Ebihara C. Ebihara 2022 AAA‐ATPase Valosin‐Containing Protein Binds the Transcription Factor SREBP1 and Promotes Its Proteolytic Activation by Rhomboid Protease RHBDL4 Journal of Biological Chemistry 298 101936 35430252 10.1016/j.jbc.2022.101936 PMC9127370 Siggs O. M. A. Grieve H. Xu P. Bambrough Y. Christova M. Freeman 2014 Genetic Interaction Implicates iRhom2 in the Regulation of EGF Receptor Signalling in Mice Biology Open 3 1151 1157 25395669 10.1242/bio.201410116 PMC4265752 Skurski J. C. M. Penniman R. Geesala 2020 Loss of iRhom2 Accelerates Fat Gain and Insulin Resistance in Diet‐Induced Obesity Despite Reduced Adipose Tissue Inflammation Metabolism: Clinical and Experimental 106 154194 32135161 10.1016/j.metabol.2020.154194 Song W. W. Liu H. Zhao 2015 Rhomboid Domain Containing 1 Promotes Colorectal Cancer Growth Through Activation of the EGFR Signalling Pathway Nature Communications 6 8022 10.1038/ncomms9022 PMC4560765 26300397 Spinazzi M. E. Radaelli K. Horré 2019 PARL Deficiency in Mouse Causes Complex III Defects, Coenzyme Q Depletion, and Leigh‐Like Syndrome Proceedings of the National Academy of Sciences 116 277 286 10.1073/pnas.1811938116 PMC6320509 30578322 Strisovsky K. 2016 Rhomboid Protease Inhibitors: Emerging Tools and Future Therapeutics Seminars in Cell & Developmental Biology 60 52 62 27567709 10.1016/j.semcdb.2016.08.021 Sugiyama T. N. Murao H. Kadowaki 2021 ERAD Components Derlin‐1 and Derlin‐2 Are Essential for Postnatal Brain Development and Motor Function iScience 24 102758 34355142 10.1016/j.isci.2021.102758 PMC8324814 Sundaram B. K. Behnke A. Belancic 2019 iRhom2 Inhibits Bile Duct Obstruction–Induced Liver Fibrosis Science Signaling 12 eaax1194 31662486 10.1126/scisignal.aax1194 Tao W. J. Cao H. Xiao 2021 A Chromosome‐Level Genome Assembly of Mozambique Tilapia ( Oreochromis mossambicus Frontiers in Genetics 12 796211 34956335 10.3389/fgene.2021.796211 PMC8692795 Tüshaus J. S. A. Müller J. Shrouder 2021 The Pseudoprotease iRhom1 Controls Ectodomain Shedding of Membrane Proteins in the Nervous System FASEB Journal 35 e21962 34613632 10.1096/fj.202100936R PMC8624807 Urban S. J. R. Lee M. Freeman 2001 Drosophila Rhomboid‐1 Defines a Family of Putative Intramembrane Serine Proteases Cell 107 173 182 11672525 10.1016/s0092-8674(01)00525-6 Urban S. M. S. Wolfe 2005 Reconstitution of Intramembrane Proteolysis In Vitro Reveals That Pure Rhomboid Is Sufficient for Catalysis and Specificity Proceedings of the National Academy of Sciences 102 1883 1888 10.1073/pnas.0408306102 PMC548546 15684070 Veit M. B. Ahrens J. Seidel A. Sommer S. Bhakdi K. Reiss 2019 Mutagenesis of the ADAM17‐Phosphatidylserine‐Binding Motif Leads to Embryonic Lethality in Mice Life Science Alliance 2 e201900430 31455669 10.26508/lsa.201900430 PMC6712283 Wan C. J. Fu Y. Wang S. Miao W. Song L. Wang 2012 Exosome‐Related Multi‐Pass Transmembrane Protein TSAP6 Is a Target of Rhomboid Protease RHBDD1‐Induced Proteolysis PLoS One 7 e37452 22624035 10.1371/journal.pone.0037452 PMC3356283 Wang H. X. Chen B. Yang Z. Xia Q. Chen 2020 MiR‐924 as a Tumor Suppressor Inhibits Non‐Small Cell Lung Cancer by Inhibiting RHBDD1/Wnt/β‐Catenin Signaling Pathway Cancer Cell International 20 491 33041671 10.1186/s12935-020-01516-0 PMC7542747 Wang J. H. Hua Y. Ran 2008 Derlin‐1 Is Overexpressed in Human Breast Carcinoma and Protects Cancer Cells From Endoplasmic Reticulum Stress‐Induced Apoptosis Breast Cancer Research 10 R7 18205950 10.1186/bcr1849 PMC2374959 Wang M. R. J. Kaufman 2014 The Impact of the Endoplasmic Reticulum Protein‐Folding Environment on Cancer Development Nature Reviews Cancer 14 581 597 25145482 10.1038/nrc3800 Wang T. X. Zhang W. Liu C. Sun Z. Li D. Zhao 2023 Prognostic and Immunological Significance of Rhomboid Domain Containing Protein 1 in Multiple Primary Cancers Combinatorial Chemistry & High Throughput Screening 26 682 695 35692140 10.2174/1386207325666220609120001 Wang Y. X. Guan K. L. Fok 2008 A Novel Member of the Rhomboid Family, RHBDD1, Regulates BIK‐Mediated Apoptosis Cellular and Molecular Life Sciences 65 3822 3829 18953687 10.1007/s00018-008-8452-0 PMC11131811 Wang Y. W. Song S. Li 2009 GC‐1 mRHBDD1 Knockdown Spermatogonia Cells Lose Their Spermatogenic Capacity in Mouse Seminiferous Tubules BMC Cell Biology 10 25 19358743 10.1186/1471-2121-10-25 PMC2679709 Wang Y. Y. Zhang Y. Ha 2006 Crystal Structure of a Rhomboid Family Intramembrane Protease Nature 444 179 180 17051161 10.1038/nature05255 Wei S. W. Hu J. Feng Y. Geng 2022 Promotion or Remission: A Role of Noncoding RNAs in Colorectal Cancer Resistance to Anti‐EGFR Therapy Cell Communication and Signaling 20 150 36131281 10.1186/s12964-022-00960-x PMC9490904 Wu A. Y. Hu Y. Xu 2021 Methyltransferase‐Like 3‐Mediated m6A Methylation of Hsa_circ_0058493 Accelerates Hepatocellular Carcinoma Progression by Binding to YTH Domain‐Containing Protein 1 Frontiers in Cell and Developmental Biology 9 762588 34888309 10.3389/fcell.2021.762588 PMC8650312 Wu Z. N. Yan L. Feng 2006 Structural Analysis of a Rhomboid Family Intramembrane Protease Reveals a Gating Mechanism for Substrate Entry Nature Structural & Molecular Biology 13 1084 1091 10.1038/nsmb1179 17099694 Wunderle L. J. D. Knopf N. Kühnle 2016 Rhomboid Intramembrane Protease RHBDL4 Triggers ER‐Export and Non‐Canonical Secretion of Membrane‐Anchored TGFα Scientific Reports 6 27342 27264103 10.1038/srep27342 PMC4893610 Wüst R. B. Maurer K. Hauser D. Woitalla M. Sharma R. Krüger 2016 Mutation Analyses and Association Studies to Assess the Role of the Presenilin‐Associated Rhomboid‐Like Gene in Parkinson's Disease Neurobiology of Aging 39 217.e13 217.e15 10.1016/j.neurobiolaging.2015.11.025 26778534 Xiao X. Y. Peng Z. Wang 2022 A Novel Immune Checkpoint Siglec‐15 Antibody Inhibits LUAD by Modulating mφ Polarization in TME Pharmacological Research 181 106269 35605813 10.1016/j.phrs.2022.106269 Xu Z. R. Wang X. Li 2021 RHBDD1 Silencing Inhibited Cell Growth and Invasion of Non‐Small Cell Lung Cancer by Mediating ZEB1/PI3K/AKT Signaling Pathway Journal of Molecular Histology 52 503 510 33515112 10.1007/s10735-020-09943-z Yamazoe K. A. Meguro M. Takeuchi E. Shibuya S. Ohno N. Mizuki 2017 Comprehensive Analysis of the Association Between UBAC2 Polymorphisms and Behçet's Disease in a Japanese Population Scientific Reports 7 742 28389674 10.1038/s41598-017-00877-3 PMC5429716 Yang Y. Y. Yuan B. Xia 2023 RHBDD1 Promotes the Growth and Stemness Characteristics of Gastric Cancer Cells by Activating Wnt/β‐catenin Signaling Pathway Current Stem Cell Research & Therapy 7 1021 1028 10.2174/011574888X259932231010112521 37861049 Ye Y. Y. Shibata C. Yun D. Ron T. A. Rapoport 2004 A Membrane Protein Complex Mediates Retro‐Translocation From the ER Lumen into the Cytosol Nature 429 841 847 15215856 10.1038/nature02656 Yuan H. R. Wei Y. Xiao 2018 RHBDF1 Regulates Apc‐Mediated Stimulation of the Epithelial‐to‐Mesenchymal Transition and Proliferation of Colorectal Cancer Cells in Part via the Wnt/β‐Catenin Signalling Pathway Experimental Cell Research 368 24 36 29654741 10.1016/j.yexcr.2018.04.009 Zettl M. C. Adrain K. Strisovsky V. Lastun M. Freeman 2011 Rhomboid Family Pseudoproteases Use the ER Quality Control Machinery to Regulate Intercellular Signaling Cell 145 79 91 21439629 10.1016/j.cell.2011.02.047 PMC3149277 Zhang T. P. Xie Y. Dong 2020 High‐Throughput Discovery of Genetic Determinants of Circadian Misalignment PLoS Genetics 16 e1008577 31929527 10.1371/journal.pgen.1008577 PMC6980734 Zhang T.‐M. L. Liao S. Y. Yang 2022 Tollip‐Mediated Autophagic Degradation Pathway Links the VCP‐TMEM63A‐DERL1 Signaling Axis to Triple‐Negative Breast Cancer Progression Autophagy 19 805 821 35920704 10.1080/15548627.2022.2103992 PMC9980475 Zhao C. X. Ling X. Li X. Hou D. Zhao 2019 MicroRNA‐138‐5p Inhibits Cell Migration, Invasion and EMT in Breast Cancer by Directly Targeting RHBDD1 Breast Cancer : Basic and Clinical Research 26 817 825 10.1007/s12282-019-00989-w 31243644 Zhihao Z. J. Cheng Z. Xiaoshuang 2023 Cancer‐Associated Fibroblast Infiltration in Osteosarcoma: The Discrepancy in Subtypes Pathways and Immunosuppression Frontiers in Pharmacology 14 1136960 37441535 10.3389/fphar.2023.1136960 PMC10333483 Zhou Z. F. Liu Z. S. Zhang 2014 Human Rhomboid Family‐1 Suppresses Oxygen‐Independent Degradation of Hypoxia‐Inducible Factor‐1α in Breast Cancer Cancer Research 74 2719 2730 24648344 10.1158/0008-5472.CAN-13-1027 Zou H. S. M. Thomas Z. W. Yan J. R. Grandis A. Vogt L. Y. Li 2009 Human Rhomboid Family‐1 Gene RHBDF1 Participates in GPCR‐Mediated Transactivation of EGFR Growth Signals in Head and Neck Squamous Cancer Cells FASEB Journal 23 425 432 18832597 10.1096/fj.08-112771 PMC2638965 ",
  "metadata": {
    "Title of this paper": "Human Rhomboid Family‐1 Gene RHBDF1 Participates in GPCR‐Mediated Transactivation of EGFR Growth Signals in Head and Neck Squamous Cancer Cells",
    "Journal it was published in:": "Journal of Cellular Physiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476590/"
  }
}