{
  "title": "Paper_968",
  "abstract": "Cancer Epidemiol Biomarkers Prev Cancer Epidemiol Biomarkers Prev 319 nihpa Cancer epidemiology, biomarkers & prevention : a publication of the American Association for Cancer Research, cosponsored by the American Society of Preventive Oncology 1055-9965 1538-7755 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12483174 PMC12483174.1 12483174 12483174 NIHMS2108941 37352435 10.1158/1055-9965.EPI-23-0236 NIHMS2108941 NIHPA2108941 1 Article Ethnic Disparities in Early-Onset Gastric Cancer Persist across Rural–Urban Geographies Narasimman Manasa 1 Pruitt Sandi L. 2 3 Murphy Caitlin C. 4 Singal Amit G. 1 3 Tavakkoli Anna 1 3 1 2 3 4 Authors’ Contributions M. Narasimman: S.L. Pruitt: C.C. Murphy: A.G. Singal: A. Tavakkoli: Corresponding Author: manasa.narasimman@utsouthwestern.edu 01 9 2023 32 9 497820 1169 1173 12 09 2025 30 09 2025 01 10 2025 01 10 2025 Background: The incidence of noncardia gastric cancer is increasing in adults ages less than 50 years old. Early-onset gastric cancer (EOGC) is characterized by ethnic disparities occurring more in Hispanic persons than non-Hispanic persons. It is unknown whether rural–urban disparities exist in EOGC and if this intersects with ethnic disparities. Methods: We utilized the Surveillance Epidemiology and End Results 17 Census Tract-level Socioeconomic Status and Rurality Database from 2006 to 2018 to calculate incidence rates and incidence rate ratios of EOGC among Hispanic and non-Hispanic persons by census tract rural–urban location, age, gender, persistent poverty, and stage of disease. We used the Tiwari Method to estimate incidence rate ratios with 95% confidence intervals (CI). Results: Hispanic persons had higher incidence rates of EOGC compared with non-Hispanic persons in both rural [incident rate ratios (IRR), 2.12; 95% confidence interval (CI), 1.64–2.73] and urban census tracts (IRR, 2.03; 95% CI, 1.91–2.16). Similar findings were seen when comparing Hispanic to non-Hispanic persons in rural and urban census tracts by age, stage of disease, and persistent poverty. Conclusions: Higher incidence rates of EOGC among Hispanic persons persist across rural–urban locations. Further research is needed to understand the etiology of this elevated risk in young Hispanics and interventions that may help to modify their outcome. Impact: While other cancers have ethnic disparities which may differ by rural–urban location, the ethnic disparity in EOGC among Hispanic and non-Hispanic persons does not differ by rural–urban residence. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Ethnic Disparities in Early-Onset Gastric Cancer Persist across Rural–Urban Geographies",
    "Journal it was published in:": "Cancer epidemiology, biomarkers & prevention : a publication of the American Association for Cancer Research, cosponsored by the American Society of Preventive Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483174/"
  }
}