{
  "title": "Paper_756",
  "abstract": "pmc Biomedicines Biomedicines 3168 biomedicines biomedicines Biomedicines 2227-9059 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12466964 PMC12466964.1 12466964 12466964 41007850 10.3390/biomedicines13092290 biomedicines-13-02290 1 Review Rebuilding Mitochondrial Homeostasis and Inhibiting Ferroptosis: Therapeutic Mechanisms and Prospects for Spinal Cord Injury Wang Qin 1 Qin Qingqing 1 Liang Wenqiang 1 Guo Haoran 1 Diao Yang 1 Tian Shengsheng 1 https://orcid.org/0000-0002-0728-6166 Wang Xin 1 2 * Černá Marie Academic Editor 1 2 * wangxinldyy@126.com 18 9 2025 9 2025 13 9 497614 2290 30 7 2025 05 9 2025 12 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ During the pathological process of spinal cord injury (SCI), ferroptosis is closely related to mitochondrial homeostasis. Following the occurrence of SCI, the interruption of local blood supply leads to mitochondrial damage within cells and a reduction in Adenosine triphosphate (ATP) production. This results in the loss of transmembrane ion gradients, causing an influx of Ca 2+ spinal cord injury ferroptosis mitochondrial homeostasis mechanism progress This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Background SCI is a common neurological condition worldwide, often resulting in impairments in motor function, sensation, and autonomic nervous system function, which can lead to permanent disability. According to recent studies, in 2021, the prevalence and incidence of SCI in China reached 2,766,277 cases and 99,363 cases, respectively, marking increases of 63.27% and 43.27% since 1990. Additionally, an ARIMA forecasting model predicts that by 2036, the age-standardized incidence and prevalence rates of SCI in China will reach 6 cases and 146 cases per 100,000 people, respectively [ 1 Maintaining mitochondrial homeostasis is crucial for the normal functioning of cells. Mitochondria are not only central to energy metabolism but also play a role in regulating various physiological processes, including the intracellular redox state, calcium ion balance, and cell signaling. When mitochondrial homeostasis is disrupted, cells may face issues such as energy deficiency, increased oxidative stress, and metabolic disorders, which can lead to cellular dysfunction and death. In recent years, ferroptosis, a novel form of programmed cell death, has garnered significant attention from researchers. The occurrence of ferroptosis is closely linked to the overload of iron ions and lipid peroxidation within cells, with mitochondria playing a critical role in this process. Mitochondrial dysfunction not only promotes the accumulation of iron ions but also exacerbates oxidative stress, thereby driving the onset of ferroptosis. Therefore, investigating the relationship between mitochondrial homeostasis imbalance and ferroptosis is essential for uncovering the mechanisms underlying various diseases and identifying potential therapeutic targets. Rather than examining mitochondrial homeostasis or ferroptosis in isolation, this review systematically integrates their interplay in SCI. On one hand, it elucidates how disruptions in mitochondrial dynamics and dysregulated mitophagy trigger ferroptosis through mechanisms such as ROS generation and iron metabolism dysregulation. On the other hand, it addresses how lipid peroxidation products generated during ferroptosis exacerbate mitochondrial structural and functional damage. Building on this bidirectional perspective, we summarize synergistic therapeutic strategies that simultaneously target mitochondrial homeostasis—such as enhancing biogenesis and balancing dynamics—and inhibit ferroptosis—for instance, via iron chelation and augmentation of antioxidant systems. These insights provide a new perspective for optimizing the clinical treatment strategies of spinal cord injuries. 2. Methodology To ensure the systematicity and comprehensiveness of this review, we strictly standardized the literature search process. The databases searched included three major English-language databases (PubMed, Web of Science, and Embase). The search timeframe was restricted to January 2000 through May 2025, aiming to encompass both classic studies and the latest advancements in the field. Search terms included “spinal cord injury,” “ferroptosis,” “mitochondrial homeostasis,” “mitophagy,” “iron overload,” and “GPX4,” among others, combined using the logical operators “AND” and “OR.” Inclusion criteria were as follows: (1) research focusing on the mutual regulatory mechanisms between ferroptosis and mitochondrial homeostasis following spinal cord injury; (2) inclusion of targeted intervention strategies (e.g., pharmaceuticals, gene regulation, cell transplantation) validated through in vivo or in vitro experiments; (3) original studies or high-quality reviews with complete data and clear conclusions. The exclusion criteria were as follows: (1) studies solely involving other models (such as brain injury or peripheral nerve injury) that cannot be extrapolated to spinal cord injury; (2) literature with ambiguous mechanistic explanations or duplicate publications; (3) incomplete publications such as abstracts or conference summaries. After initial screening by title, secondary screening by abstract, and thorough full-text review, 50 core articles were ultimately included, providing a robust literary foundation for the mechanistic analyses and summary of intervention strategies in this review. 3. Mitochondrial Dysfunction and Homeostatic Imbalance in SCI Mitochondrial dysfunction and homeostatic imbalance following SCI are core mechanisms of secondary pathological damage. These processes involve the excessive accumulation of ROS, disruptions in mitochondrial dynamics, and impaired autophagic function, ultimately leading to ferroptosis, hindered axonal regeneration, and irreversible neurological damage. Our previous research has demonstrated that after SCI, damage to the cell membrane results in the dissipation of transmembrane ion gradients. This activates voltage-gated Ca 2+ 2+ 2+ 2 − − 2 3 4 5 The maintenance of mitochondrial homeostasis is a system-level dynamic equilibrium process, encompassing the synergistic interplay of mitochondrial biogenesis (MB), mitochondrial dynamics, and the regulation of mitophagy. These three components form a functional network through intricate signal crosstalk, all of which are essential for maintaining a healthy and functional mitochondrial network [ 6 The normal functioning of mitochondria relies on the dynamic equilibrium of three key processes: mitochondrial biogenesis (MB) supplies new functional units; dynamics (fusion/fission) enable immediate repair through content mixing and segregate damaged components for clearance; and mitophagy is responsible for the ultimate degradation of irreparable components. Following SCI, the energy crisis and Ca 2+ Mitochondrial biogenesis is not a standalone process of quantitative increase, but is closely linked to dynamic remodeling. Peroxisome proliferator-activated receptor-γ coactivator 1α (PGC-1α), acting as the “master regulator” of mitochondrial biogenesis, not only activates the expression of nuclear genes such as mitochondrial transcription factor A (TFAM), but also ensures the rapid integration of newly formed mitochondria into the functional network by regulating the balance between mitochondrial fusion proteins (Mfn1/2) and fission protein (Drp1). Mitochondria are highly dynamic organelles that undergo continuous fission and fusion, a process known as mitochondrial dynamics. This balance is crucial for maintaining a healthy mitochondrial network [ 7 8 9 10 11 12 13 Mitochondrial autophagy involves four key steps. First, damaged mitochondria undergo depolarization and lose their membrane potential. Second, an autophagosome forms by enveloping the mitochondria. The third step is the fusion of the autophagosome with a lysosome. Finally, the lysosome degrades the contents of the mitochondria [ 14 15 16 Figure 1 17 18 4. Ferroptosis in SCI Ferroptosis is a form of death regulated by autophagy. Research by Yao and colleagues has found that during ferroptosis, neurons undergo excessive mitophagy. This overactive mitophagy not only leads to mitochondrial dysfunction and increased production of ROS but also results in the degradation of ferritin within the mitochondria. Consequently, this leads to an increase in free iron levels within the cells, triggering ferroptosis and creating a vicious cycle [ 19 20 21 2+ 2+ 2 2+ Figure 2 As summarized by Lei and colleagues, lipid peroxides are produced through three mechanisms: iron-catalyzed lipid autoxidation, the esterification and oxygenation of PUFA, and lipid ROS associated with the Fenton reaction. All of these pathways require iron [ 22 23 5. Mitochondrial Homeostasis Regulation Strategies In fact, the maintenance of mitochondrial homeostasis relies on a highly coordinated and multi-layered dynamic regulatory system that encompasses key processes such as MB, mitochondrial dynamics, and the regulation of mitophagy. These processes are interwoven and collectively respond to changes in both intracellular and extracellular signals, ensuring quality control and functional adaptability of the mitochondrial network. Although research on the regulation of mitochondrial homeostasis is currently limited, existing in vivo and in vitro experiments have already demonstrated exciting results. MB is one of the core strategies for regulating mitochondrial homeostasis, referring to the process by which cells increase the number of mitochondria and enhance their quality and function. Peroxisome proliferator-activated receptor-gamma coactivator 1-alpha (PGC-1α) serves as the “master regulator” of MB network expression. The activation of PGC-1α has long been considered a therapeutic strategy for SCI, with previous studies demonstrating its neuroprotective effects in both in vivo and in vitro models of SCI [ 24 25 LY344864 LY344864 LY344864 LY344864 26 27 27 28 29 Mitochondria are not static, isolated organelles; rather, they form a highly dynamic and interconnected tubular network, with their morphology, distribution, and interconnectivity undergoing continuous and precisely regulated remodeling. The core mechanism of this dynamic remodeling is known as mitochondrial dynamics, which primarily involves two seemingly opposing yet synergistically unified processes: mitochondrial fusion and fission. Mitochondrial dynamics are far from mere morphological changes; they are essential strategies and foundational frameworks for cells to maintain mitochondrial homeostasis, optimize energy metabolism, execute quality control, respond to environmental stress, and regulate cell fate. The ubiquitin-proteasome system regulates this process by degrading key proteins such as the fusion effectors MFN1 and MFN2. The outer mitochondrial membrane protein PLD6 is a critical regulatory factor downstream of MFN1/2, hydrolyzing cardiolipin to produce the signaling molecule phosphatidic acid. Abnormal levels of PLD6 can lead to excessive mitochondrial fusion or fragmentation [ 30 31 31 32 33 33 Mitochondria are inherently vulnerable organelles within cells due to their continuous exposure to high oxidative stress, metabolic byproducts, and potential risks of genetic mutations. Dysfunctional or structurally damaged mitochondria not only exhibit reduced energy production efficiency but also excessively generate ROS, leak pro-apoptotic factors such as cytochrome c, and disrupt intracellular calcium homeostasis, becoming “dangerous molecules” that threaten cellular health. Therefore, timely identification and removal of these damaged mitochondria are essential for maintaining the overall health of the mitochondrial network and ensuring cellular function and survival. Mitochondrial autophagy, or mitophagy, is a highly specialized form of autophagy that selectively targets, recognizes, encapsulates, and ultimately degrades dysfunctional or redundant mitochondria through the lysosomal pathway, rather than indiscriminately degrading cytoplasmic components. However, in the context of SCI, insufficient mitophagy can lead to the ineffective clearance of damaged mitochondria, resulting in the accumulation of toxic substances, energy metabolism collapse, failure of axonal regeneration, impaired recovery of motor and sensory functions, and exacerbation of secondary injury. Conversely, excessive activation of mitophagy in SCI can lead to the over-removal of normally functioning mitochondria, causing a sharp decline in neuronal ATP synthesis, cellular energy crises, exacerbated acute necrotic cell death, and impaired myelin synthesis, while astrocytes may exacerbate inflammatory responses due to energy depletion. Yao et al. established a mouse model of SCI by compressing the spinal cord at the T10 level and subsequently performed stem cell transplantation [ 19 19 7 2 2 7 Table 1 6. Ferroptosis Inhibition Strategy Ferroptosis is distinct from apoptosis, necroptosis, and autophagy in that it is triggered by the explosive accumulation of iron-dependent lipid peroxidation. Following SCI, local iron overload—resulting from heme degradation and dysregulation of iron transport proteins—combined with the collapse of antioxidant defenses (such as depletion of and inhibition of glutathione peroxidase 4 (GPX4)), as well as an imbalance in PUFA metabolism, creates a “death triangle.” This triangle catalyzes the peroxidative breakdown of membrane phospholipids, resulting in an irreversible loss of cell membrane integrity and, ultimately, cell death. Consequently, current research on strategies to inhibit ferroptosis in SCI models primarily focuses on these three aspects, and some progress has already been made. Primary mechanical injury leads to the rupture of microvessels, causing red blood cells to leak into spinal cord tissue and release large amounts of iron-containing hemoglobin. Subsequently, hemoglobin is gradually broken down into Fe 2+ 2 − 3+ 2+ 2+ 2+ 34 34 34 35 35 As previously mentioned, following SCI, severe damage to local tissues leads to iron overload and a significant accumulation of ROS. This results in the rapid oxidation of GSH to oxidized glutathione (GSSG), causing a sharp decline in the GSH/GSSG ratio. Consequently, the antioxidant enzyme system, including SOD, GSH, GPX4, and catalase, becomes imbalanced and paralyzed, leading to the accumulation of lipid peroxides that have irreversible effects on cells and tissues. Liu et al. conducted animal experiments to verify that the protective effect of Trimethylpyrazine (TMP) against ferroptosis is mediated through the regulation of the GPX4/ACSL4 axis [ 36 36 37 38 39 2+ 40 41 42 42 When SCI leads to the collapse of the antioxidant system (characterized by GPX4 inactivation, GSH depletion, and inhibition of the Nrf2 pathway), the lipid metabolic environment deteriorates and gradually becomes imbalanced. PUFA, due to their multiple double bonds and the presence of hydrogen atoms on the methylene groups between these double bonds, are easily attacked by free radicals, triggering chain reactions. Furthermore, because PUFA constitute a significant proportion of neuronal membrane phospholipids, their high sensitivity to oxidation makes them core targets of oxidative stress. This process involves reactions with molecular oxygen, which can initiate further chain reactions. Importantly, since this process does not require the mediation of biological enzymes, the damage can rapidly spread to adjacent healthy cells [ 43 44 45 46 47 47 48 49 50 50 Table 2 7. Biomarkers and Monitoring Significance of Mitochondrial Function and Ferroptosis Dynamic monitoring of mitochondrial function and ferroptosis is critical for evaluating the pathological progression of SCI and the efficacy of interventions, with the identification of specific biomarkers providing quantifiable metrics for this process. For monitoring mitochondrial function, intracellular ATP levels directly reflect mitochondrial respiratory chain activity; an elevated lactate/pyruvate ratio indicates impaired oxidative phosphorylation; mitochondria-derived superoxide anions (O 2 − 2+ Combined detection of these biomarkers can form a dynamic assessment network linking “mitochondrial function-ferroptosis.” For example, a sharp early drop in ATP accompanied by elevated Fe 2+ 8. Summary and Prospect In fact, targeting the regulation of mitochondrial homeostasis and inhibiting ferroptosis represents a promising new therapeutic strategy. These two approaches are not isolated; the imbalance of mitochondrial homeostasis is a key trigger for ferroptosis, and ferroptosis can further exacerbate mitochondrial damage, creating a vicious cycle. Therefore, future research should delve deeper into the mechanisms of interaction between these two processes and focus on developing integrative therapies. Key issues to be focused on include how to achieve precise regulation of mitophagy to avoid insufficient or excessive activation while adapting to the needs of different cell types; whether combined therapies, such as mitochondrial biogenesis enhancers and ferroptosis inhibitors, exert synergistic effects; how to optimize their administration timing and dosage compatibility to avoid potential conflicts; and how gene therapies (e.g., targeted regulation of PGC-1α, ACSL4) and mitochondrial transplantation techniques can be combined with existing intervention strategies. Despite challenges in clinical translation, including drug delivery efficiency, long-term safety validation, and individual variability, research focused on mitochondrial homeostasis and ferroptosis undoubtedly contributes to overcoming the limitations of traditional treatments. We have reason to believe that this therapeutic approach will bring new hope and attention to the treatment of SCI. Acknowledgments First of all, I would like to express my gratitude to my school, the First Clinical Medical College of Lanzhou University and the First Hospital of Lanzhou University, for providing this platform. Secondly, I would like to express my gratitude to my supervisor, Wang Xin, for his guidance and assistance in my writing. Thirdly, I would like to express my gratitude to Qin Qingqing, Liang Wenqiang and other classmates for their review and suggestions on my writing. Disclaimer/Publisher’s Note: Author Contributions Q.W. is responsible for literature review, initial draft writing and overall structure design. Q.Q., W.L. and H.G. participated in the collation of literature data and assisted in writing some chapters. Y.D. and S.T. are responsible for providing professional opinions. X.W. guides research directions, reviews and revises manuscripts to ensure the scientific and accurate nature of the content. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: Spinal cord injury (SCI), Adenosine triphosphate (ATP), Reactive oxygen species (ROS), Polyunsaturated fatty acids (PUFA), Mitochondrial biogenesis (MB), Phospholipid hydroperoxides (PLOOH), 4-Hydroxynonenal (4-HNE), Malondialdehyde (MDA), Peroxisome proliferator-activated receptor-γ coactivator-1α (PGC-1α), Oligodendrocyte precursor cells (OPC), Reduced glutathione (GSH), Oxidized glutathione (GSSG), Superoxide dismutase (SOD), Glutathione peroxidase 4 (GPX4), Acyl-CoA synthetase long-chain family member 4 (ACSL4), Trimethylpyrazine (TMP), Adiponectin (APN), Traumatic brain injury (TBI). References 1. Qin H. Diao Y. Hao M. Wang Z. Xie M. Hu X. Zhu T. Analysis and comparison of the trends in burden of spinal cord injury in China and worldwide from 1990 to 2021: An analysis of the global burden of disease study 2021 Front. Public Health 2024 12 1517871 39839413 10.3389/fpubh.2024.1517871 PMC11747465 2. Yu M. Wang Z. Wang D. Aierxi M. Ma Z. Wang Y. Oxidative stress following spinal cord injury: From molecular mechanisms to therapeutic targets J. Neurosci. Res. 2023 101 1538 1554 10.1002/jnr.25221 37272728 3. Zhou H. Li Z. Jing S. Wang B. Ye Z. Xiong W. Liu Y. Liu Y. Xu C. Kumeria T. Repair spinal cord injury with a versatile anti-oxidant and neural regenerative nanoplatform J. Nanobiotechnol. 2024 22 351 10.1186/s12951-024-02610-5 PMC11188197 38902789 4. Rizwana N. Agarwal V. Nune M. Antioxidant for Neurological Diseases and Neurotrauma and Bioengineering Approaches Antioxidants 2021 11 72 10.3390/antiox11010072 35052576 PMC8773039 5. Shojaie L. Iorga A. Dara L. Cell Death in Liver Diseases: A Review Int J. Mol. Sci. 2020 21 9682 33353156 10.3390/ijms21249682 PMC7766597 6. Kang R. Xie Y. Zeh H.J. Klionsky D.J. Tang D. Mitochondrial quality control mediated by PINK1 and PRKN: Links to iron metabolism and tumor immunity Autophagy 2019 15 172 173 30252570 10.1080/15548627.2018.1526611 PMC6287677 7. Cui Y. Bai M. Gao S. Zhao H. Mei X. Zinc ions facilitate metabolic bioenergetic recovery post spinal cord injury by activating microglial mitophagy through the STAT3-FOXO3a-SOD2 pathway Free Radic. Biol. Med. 2025 227 64 79 39613048 10.1016/j.freeradbiomed.2024.11.045 8. Cheng X.T. Sheng Z.H. Developmental regulation of microtubule-based trafficking and anchoring of axonal mitochondria in health and diseases Dev. Neurobiol. 2021 81 284 299 32302463 10.1002/dneu.22748 PMC7572491 9. Guedes-Dias P. Holzbaur E.L.F. Axonal transport: Driving synaptic function Science 2019 366 eaaw9997 10.1126/science.aaw9997 31601744 PMC6996143 10. You W. Li Y. Liu K. Mi X. Li Y. Guo X. Li Z. Latest assessment methods for mitochondrial homeostasis in cognitive diseases Neural Regen. Res. 2024 19 754 768 37843209 10.4103/1673-5374.382222 PMC10664105 11. Yan X. Wang B. Hu Y. Wang S. Zhang X. Abnormal Mitochondrial Quality Control in Neurodegenerative Diseases Front. Cell Neurosci. 2020 14 138 32655368 10.3389/fncel.2020.00138 PMC7324542 12. Xu S. Jia J. Mao R. Cao X. Xu Y. Mitophagy in acute central nervous system injuries: Regulatory mechanisms and therapeutic potentials Neural Regen. Res. 2025 20 2437 2453 39248161 10.4103/NRR.NRR-D-24-00432 PMC11801284 13. Tian H. Chen X. Liao J. Yang T. Cheng S. Mei Z. Ge J. Mitochondrial quality control in stroke: From the mechanisms to therapeutic potentials J. Cell Mol. Med. 2022 26 1000 1012 35040556 10.1111/jcmm.17189 PMC8831937 14. Samuvel D.J. Li L. Krishnasamy Y. Gooz M. Takemoto K. Woster P.M. Lemasters J.J. Zhong Z. Mitochondrial depolarization after acute ethanol treatment drives mitophagy in living mice Autophagy 2022 18 2671 2685 10.1080/15548627.2022.2046457 35293288 PMC9629059 15. Palikaras K. Lionaki E. Tavernarakis N. Mechanisms of mitophagy in cellular homeostasis, physiology and pathology Nat. Cell Biol. 2018 20 1013 1022 10.1038/s41556-018-0176-2 30154567 16. Gatica D. Lahiri V. Klionsky D.J. Cargo recognition and degradation by selective autophagy Nat. Cell Biol. 2018 20 233 242 10.1038/s41556-018-0037-z 29476151 PMC6028034 17. Xu B. Zhou Z. Fang J. Wang J. Tao K. Liu J. Liu S. Exosomes derived from schwann cells alleviate mitochondrial dysfunction and necroptosis after spinal cord injury via AMPK signaling pathway-mediated mitophagy Free Radic. Biol. Med. 2023 208 319 333 10.1016/j.freeradbiomed.2023.08.026 37640169 18. Jiang D. Yang X. Ge M. Hu H. Xu C. Wen S. Deng H. Mei X. Zinc defends against Parthanatos and promotes functional recovery after spinal cord injury through SIRT3-mediated anti-oxidative stress and mitophagy CNS Neurosci. Ther. 2023 29 2857 2872 10.1111/cns.14222 37063066 PMC10493669 19. Yao S. Pang M. Wang Y. Wang X. Lin Y. Lv Y. Xie Z. Hou J. Du C. Qiu Y. Mesenchymal stem cell attenuates spinal cord injury by inhibiting mitochondrial quality control-associated neuronal ferroptosis Redox Biol. 2023 67 102871 10.1016/j.redox.2023.102871 37699320 PMC10506061 20. Chen Y. Liu S. Li J. Li Z. Quan J. Liu X. Tang Y. Liu B. The Latest View on the Mechanism of Ferroptosis and Its Research Progress in Spinal Cord Injury Oxid. Med. Cell Longev. 2020 2020 6375938 32908634 10.1155/2020/6375938 PMC7474794 21. Hassannia B. Vandenabeele P. Vanden Berghe T. Targeting Ferroptosis to Iron Out Cancer Cancer Cell 2019 35 830 849 10.1016/j.ccell.2019.04.002 31105042 22. Lei P. Bai T. Sun Y. Mechanisms of Ferroptosis and Relations With Regulated Cell Death: A Review Front. Physiol. 2019 10 139 10.3389/fphys.2019.00139 30863316 PMC6399426 23. Wang H. Liu C. Zhao Y. Gao G. Mitochondria regulation in ferroptosis Eur. J. Cell Biol. 2020 99 151058 10.1016/j.ejcb.2019.151058 31810634 24. Seira O. Kolehmainen K. Liu J. Streijger F. Haegert A. Lebihan S. Boushel R. Tetzlaff W. Ketogenesis controls mitochondrial gene expression and rescues mitochondrial bioenergetics after cervical spinal cord injury in rats Sci. Rep. 2021 11 16359 10.1038/s41598-021-96003-5 34381166 PMC8357839 25. Zhang H. Hu T. Xiong M. Li S. Li W.-X. Liu J. Zhou X. Qi J. Jiang G.-B. Cannabidiol-loaded injectable chitosan-based hydrogels promote spinal cord injury repair by enhancing mitochondrial biogenesis Int. J. Biol. Macromol. 2022 221 1259 1270 10.1016/j.ijbiomac.2022.09.013 36075309 26. Simmons E.C. Scholpa N.E. Cleveland K.H. Schnellmann R.G. 5-hydroxytryptamine 1F Receptor Agonist Induces Mitochondrial Biogenesis and Promotes Recovery from Spinal Cord Injury J. Pharmacol. Exp. Ther. 2020 372 216 223 10.1124/jpet.119.262410 31776207 PMC6978694 27. Scholpa N.E. Simmons E.C. Thompson A.D. Carroll S.S. Schnellmann R.G. 5-HT(1F) receptor agonism induces mitochondrial biogenesis and increases cellular function in brain microvascular endothelial cells Front. Cell Neurosci. 2024 18 1365158 10.3389/fncel.2024.1365158 38510106 PMC10952819 28. Scholpa N.E. Williams H. Wang W. Corum D. Narang A. Tomlinson S. Sullivan P.G. Rabchevsky A.G. Schnellmann R.G. Pharmacological Stimulation of Mitochondrial Biogenesis Using the Food and Drug Administration-Approved β(2)-Adrenoreceptor Agonist Formoterol for the Treatment of Spinal Cord Injury J. Neurotrauma 2019 36 962 972 10.1089/neu.2018.5669 30280980 PMC6484358 29. Scholpa N.E. Simmons E.C. Crossman J.D. Schnellmann R.G. Time-to-treatment window and cross-sex potential of β(2)-adrenergic receptor-induced mitochondrial biogenesis-mediated recovery after spinal cord injury Toxicol. Appl. Pharmacol. 2021 411 115366 10.1016/j.taap.2020.115366 33316273 30. Choi S.Y. Huang P. Jenkins G.M. Chan D.C. Schiller J. Frohman M.A. A common lipid links Mfn-mediated mitochondrial fusion and SNARE-regulated exocytosis Nat. Cell Biol. 2006 8 1255 1262 10.1038/ncb1487 17028579 31. Raiff A. Zhao S. Bekturova A. Zenge C. Mazor S. Chen X. Ru W. Makaros Y. Ast T. Ordureau A. TOM20-driven E3 ligase recruitment regulates mitochondrial dynamics through PLD6 Nat. Chem. Biol. 2025 1 11 10.1038/s41589-025-01894-4 40263465 PMC12353589 32. Liu Q. Zhou S. Wang X. Gu C. Guo Q. Li X. Zhang C. Zhang N. Zhang L. Huang F. Apelin alleviated neuroinflammation and promoted endogenous neural stem cell proliferation and differentiation after spinal cord injury in rats J. Neuroinflamm. 2022 19 160 10.1186/s12974-022-02518-7 PMC9208139 35725619 33. Guo Q. Liu Q. Zhou S. Lin Y. Lv A. Zhang L. Li L. Huang F. Apelin regulates mitochondrial dynamics by inhibiting Mst1-JNK-Drp1 signaling pathway to reduce neuronal apoptosis after spinal cord injury Neurochem. Int. 2024 180 105885 10.1016/j.neuint.2024.105885 39433147 34. Xiong M. Wang M. Liu X. Luo S. Wang X. Yang L. Li K. Li Y. Wei W. Chen H. Quercetin inhibits oligodendrocytes ferroptosis by blocking NCOA4-mediated ferritinophagy Int. Immunopharmacol. 2025 150 114152 10.1016/j.intimp.2025.114152 39946767 35. Yao X. Zhang Y. Hao J. Duan H.-Q. Zhao C.-X. Sun C. Li B. Fan B.-Y. Li W.-X. Fu X.-H. Deferoxamine promotes recovery of traumatic spinal cord injury by inhibiting ferroptosis Neural Regen. Res. 2019 14 532 541 30539824 10.4103/1673-5374.245480 PMC6334606 36. Liu G. Deng B. Huo L. Fan X. Bai H. Zhao Y. Xu L. Gao F. Mu X. Tetramethylpyrazine alleviates ferroptosis and promotes functional recovery in spinal cord injury by regulating GPX4/ACSL4 Eur. J. Pharmacol. 2024 977 176710 10.1016/j.ejphar.2024.176710 38843947 37. Stockwell B.R. Jiang X. Gu W. Emerging Mechanisms and Disease Relevance of Ferroptosis Trends Cell Biol. 2020 30 478 490 10.1016/j.tcb.2020.02.009 32413317 PMC7230071 38. Ding K. Liu C. Li L. Yang M. Jiang N. Luo S. Sun L. Acyl-CoA synthase ACSL4: An essential target in ferroptosis and fatty acid metabolism Chin. Med. J. (Engl.) 2023 136 2521 2537 37442770 10.1097/CM9.0000000000002533 PMC10617883 39. Jia B. Li J. Song Y. Luo C. ACSL4-Mediated Ferroptosis and Its Potential Role in Central Nervous System Diseases and Injuries Int. J. Mol. Sci. 2023 24 10021 10.3390/ijms241210021 37373168 PMC10298642 40. Le X. Mu J. Peng W. Tang J. Xiang Q. Tian S. Feng Y. He S. Qiu Z. Ren G. DNA methylation downregulated ZDHHC1 suppresses tumor growth by altering cellular metabolism and inducing oxidative/ER stress-mediated apoptosis and pyroptosis Theranostics 2020 10 9495 9511 10.7150/thno.45631 32863941 PMC7449911 41. Zyba S.J. Shenvi S.V. Killilea D.W. Holland T.C. Kim E. Moy A. Sutherland B. Gildengorin V. Shigenaga M.K. King J.C. A moderate increase in dietary zinc reduces DNA strand breaks in leukocytes and alters plasma proteins without changing plasma zinc concentrations Am. J. Clin. Nutr. 2017 105 343 351 10.3945/ajcn.116.135327 28003206 PMC5267297 42. Ge M. Tian H. Mao L. Li D. Lin J. Hu H. Huang S. Zhang C. Mei X. Zinc attenuates ferroptosis and promotes functional recovery in contusion spinal cord injury by activating Nrf2/GPX4 defense pathway CNS Neurosci. Ther. 2021 27 1023 1040 10.1111/cns.13657 33951302 PMC8339532 43. Quadri S.A. Farooqui M. Ikram A. Zafar A. Khan M.A. Suriya S.S. Claus C.F. Fiani B. Rahman M. Ramachandran A. Recent update on basic mechanisms of spinal cord injury Neurosurg. Rev. 2020 43 425 441 29998371 10.1007/s10143-018-1008-3 44. Fang H. Judd R.L. Adiponectin Regulation and Function Compr. Physiol. 2018 8 1031 1063 10.1002/j.2040-4603.2018.tb00036.x 29978896 45. Zhang S. Wu X. Wang J. Shi Y. Hu Q. Cui W. Bai H. Zhou J. Du Y. Han L. Adiponectin/AdiopR1 signaling prevents mitochondrial dysfunction and oxidative injury after traumatic brain injury in a SIRT3 dependent manner Redox Biol. 2022 54 102390 35793583 10.1016/j.redox.2022.102390 PMC9287731 46. Polito R. Di Meo I. Barbieri M. Daniele A. Paolisso G. Rizzo M.R. Adiponectin Role in Neurodegenerative Diseases: Focus on Nutrition Review Int. J. Mol. Sci. 2020 21 9255 10.3390/ijms21239255 33291597 PMC7729837 47. Ge Y. Wang T. Hu Q. Wu X. Cai Y. Xie W. Zhang S. Wang B. Wang J. Feng T. Adiponectin ameliorates traumatic brain injury-induced ferroptosis through AMPK- ACC1 signaling pathway Brain Behav. Immun. 2025 126 160 175 39947491 10.1016/j.bbi.2025.01.020 48. Ye S. Luo W. Khan Z.A. Wu G. Xuan L. Shan P. Lin K. Chen T. Wang J. Hu X. Celastrol Attenuates Angiotensin II-Induced Cardiac Remodeling by Targeting STAT3 Circ. Res. 2020 126 1007 1023 32098592 10.1161/CIRCRESAHA.119.315861 49. Shen W. Li C. Liu Q. Cai J. Wang Z. Pang Y. Ning G. Yao X. Kong X. Feng S. Celastrol inhibits oligodendrocyte and neuron ferroptosis to promote spinal cord injury recovery Phytomedicine 2024 128 155380 10.1016/j.phymed.2024.155380 38507854 50. Li D. Lu X. Xu G. Liu S. Gong Z. Lu F. Xia X. Jiang J. Wang H. Zou F. Dihydroorotate dehydrogenase regulates ferroptosis in neurons after spinal cord injury via the P53-ALOX15 signaling pathway CNS Neurosci. Ther. 2023 29 1923 1939 36942513 10.1111/cns.14150 PMC10324365 Figure 1 Mitochondrial ubiquitin-dependent autophagy pathway. Figure 2 Lipid peroxidation generates ROS. biomedicines-13-02290-t001_Table 1 Table 1 Comparison of experimental evidence for mitochondrial homeostasis regulation strategies in spinal cord injury. Intervention Type Intervention/Target Model Type Key Outcomes Limitations Mitochondrial Biogenesis (MB) Regulation Cannabidiol-loaded in situ gelling hydrogel In vivo: Rat model with T9 spinal cord segment resection Activates PGC-1α/NRF2 pathway, enhances MB, alleviates mitochondrial dysfunction and apoptosis, and promotes SCI repair Hydrogel degradation rate and long-term safety not clarified; no evaluation of effects on chronic-phase nerve regeneration LY344864 In vivo: Mouse model with T10–12 thoracic contusion (80 kdyn force) Attenuates PGC-1α reduction as early as 3 days post-injury, improves mitochondrial homeostasis, promotes vascular repair, motor function recovery, and lesion size reduction Only verified within 21 days; no data on universality across different spinal segment injuries Lasmiditan (5-HT1FR agonist) In vivo: SCI model mice; In vitro: Endothelial cells Induces MB, enhances endothelial cell function via the VE-Cadherin–Akt–FoxO1–claudin-5 axis, and improves vascular recovery and motor function Endothelial cell mechanisms not validated in spinal neurons; lacks dose-dependent data Formoterol (β2-adrenergic receptor agonist) In vivo: SCI model in female C57BL/6 mice Restores expression of mitochondrial proteins (e.g., PGC-1α, Nrf2) 3 days post-injury, increases white/gray matter volume, with a treatment window of at least 8 h and cross-sex potential Efficacy details in male models insufficiently elaborated; no analysis of long-term effects on organs like the heart Mitochondrial Dynamics Regulation CRL2–FEM1B–PLD6 pathway In vitro: Cell experiments (focusing on mitochondrial localization and degradation mechanisms) TOM20 mediates CRL2-FEM1B localization to mitochondria, balancing mitochondrial fusion/fission by regulating PLD6 levels Not validated in in vivo SCI models; lacks direct evaluation of neuronal function Apelin (targeting Mst1–JNK–Drp1 pathway) In vitro: H 2 2 Inhibits mitochondrial fission, enhances antioxidant capacity, clears excess ROS, reduces apoptosis, protects neurons, and promotes functional recovery post-SCI Interactions with fusion-related proteins (e.g., Mfn1/2) not clarified; insufficient dose optimization for long-term administration Mitophagy Regulation Mesenchymal Stem Cell (MSC) transplantation In vivo: Mouse model with T10 spinal cord crush injury MSC-derived mitochondria fuse with damaged neuronal mitochondria, reducing excessive mitophagy associated with ferroptosis Immunological rejection risks of MSC transplantation unassessed; functional integrity of fused mitochondria not confirmed Zinc ions/TFP (FOXO3a activator) In vitro: H 2 2 Activates FOXO3a, enhances mitophagy, restores mitochondrial stability, improves spinal microenvironment, and promotes motor function recovery Synergistic effects of zinc ions and TFP not explored; no analysis of effects on astrocyte autophagy biomedicines-13-02290-t002_Table 2 Table 2 Comparison of main intervention strategies targeting ferroptosis and their mechanisms in spinal cord injury. Intervention Model Type Mechanism Targeting the “Death Key Outcomes Limitations Quercetin In vitro: OPCs Inhibits iron overload (blocks NCOA4-mediated ferritinophagy + downregulates Id2/transferrin pathway, reducing iron release and uptake) Reduces intracellular Fe 2+ In vitro studies only focused on OPCs, excluding neurons/astrocytes; toxicity data for high in vivo doses (>100 mg/kg) are lacking Deferoxamine In vitro: Neurons Inhibits iron overload (chelates free Fe 2+ − Decreases free iron concentration and lipid ROS; repairs mitochondrial function; improves motor function Long-term use may cause systemic iron deficiency; no evaluation of axonal regeneration in the chronic phase (>4 weeks) Tetramethylpyrazine (TMP) In vitro: Neurons Enhances antioxidant defense (upregulates GPX4) + regulates PUFA metabolism (downregulates ACSL4, reducing conversion of PUFA to oxidizable phospholipids) Increases GSH and SOD levels; decreases Fe 2+ In vitro effects on glial cells not verified; in vivo lacks stratified data for different injury severities (e.g., complete/incomplete SCI) Zinc In vitro: Neurons + astrocytes Enhances antioxidant defense (activates NRF2/HO-1 pathway, upregulates GPX4 and SOD) Reduces lipid peroxides, MDA, and ROS; rescues mitochondrial function; decreases inflammatory factors No analysis of gender differences (zinc metabolism is gender-specific); high doses (>20 mg/kg) may induce neuronal apoptosis Adiponectin (APN) In vitro: Neurons Regulates PUFA metabolism (inhibits production of PUFA such as arachidonic acid) + enhances antioxidant defense (activates AMPK pathway) Reduces MDA, 4-HNE, and NOX2/COX2 expression; alleviates ferroptosis-related lipid peroxidation Lacks direct data in SCI models; unclear effects on spinal cord-specific cells (e.g., oligodendrocytes) Celastrol In vitro: Neurons + OPCs Enhances antioxidant defense (upregulates NRF2–xCT–GPX4 axis) Reduces ROS accumulation; inhibits ferroptosis in neurons and OPCs; promotes motor function recovery In vitro dose–effect relationship not clarified; long-term in vivo toxicity (e.g., liver injury) needs evaluation Dihydroorotate dehydrogenase In vitro: Neurons Enhances antioxidant defense (inhibits P53/ALOX15 pathway, reducing lipid peroxides) Decreases activity of ferroptosis-related molecules; reduces mitochondrial damage No clear direct association with the “death triangle” in its mechanism; clinical translation potential remains to be verified ",
  "metadata": {
    "Title of this paper": "Dihydroorotate dehydrogenase regulates ferroptosis in neurons after spinal cord injury via the P53-ALOX15 signaling pathway",
    "Journal it was published in:": "Biomedicines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466964/"
  }
}