{
  "title": "Paper_844",
  "abstract": "pmc Infect Agent Cancer Infect Agent Cancer 439 infagcan Infectious Agents and Cancer 1750-9378 BMC PMC12461949 PMC12461949.1 12461949 12461949 40993812 10.1186/s13027-025-00694-8 694 1 Research Metronomic chemotherapy in locoregionally advanced nasopharyngeal carcinoma with residual EBV-DNA after induction chemotherapy Guo Lin-Feng Gong Liu-Yun Lin Qin linqin05@163.com Wu San-Gang wusg@xmu.edu.cn https://ror.org/0006swh35 grid.412625.6 Department of Radiation Oncology, Xiamen Cancer Center, Xiamen Key Laboratory of Radiation Oncology, School of Medicine, the First Affiliated Hospital of Xiamen University, Xiamen University, 24 9 2025 2025 20 479098 64 18 6 2025 20 8 2025 24 09 2025 26 09 2025 26 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Purpose To analyze outcomes and evaluate the survival benefits of metronomic chemotherapy (MC) with S-1 in locoregionally advanced nasopharyngeal carcinoma (LANPC) patients with residual EBV-DNA after induction chemotherapy (IC). Methods We retrospectively included patients diagnosed with LANPC between October 2015 and August 2021. All patients were treated with IC and had residual EBV-DNA after IC. Chi-square test, Kaplan-Meier methods, and Cox proportional hazards model were used for statistical analyses. Results A total of 103 patients were identified, including 20 (19.4%) who received MC using S-1 for one year. Among these patients, 40 experienced disease progression, including 12 with locoregional recurrence (30.0%), 24 with distant metastasis (60.0%), and 4 with both locoregional recurrence and distant metastasis (10.0%). The 5-year locoregional recurrence-free survival, distant metastasis-free survival (DMFS), progression-free survival (PFS), and overall survival (OS) rates were 81.3%, 70.7%, 52.8%, and 72.1%, respectively. Multivariate prognostic analysis showed that post-IC residual EBV-DNA levels were independent prognostic factors for DMFS and PFS. Patients with EBV-DNA levels > 90 copies/mL had worse DMFS (hazard ratio [HR] 4.978, 95% confidence interval [CI] 1.413–17.535, P P P P Conclusions Our study highlights the poorer survival outcomes observed in LANPC patients with residual EBV-DNA levels following IC, as well as the potential survival advantages of MC in this subgroup. Clinical trial number Not applicable. Keywords Nasopharyngeal carcinoma EBV-DNA Induction chemotherapy Survival outcomes Metronomic chemotherapy Medical and Health Guidance Project of Xiamen City 3502Z20244ZD1001 and 3502Z20224ZD1005 3502Z20244ZD1001 and 3502Z20224ZD1005 Lin Qin Wu San-Gang pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Nasopharyngeal carcinoma (NPC) represents a unique subtype among head and neck malignancies, exhibiting remarkable geographic and ethnic distribution patterns, with the highest global incidence rates observed in Southeast Asia, particularly in Southern China [ 1 2 4 5 6 7 9 In the management of locoregionally advanced NPC (LANPC), the current therapeutic paradigm incorporates induction chemotherapy (IC) followed by concurrent chemoradiotherapy (CCRT) as the standard treatment protocol [ 10 7 9 11 Materials and methods Patients This retrospective analysis included patients with NPC treated at the First Affiliated Hospital of Xiamen University, a tertiary care center in Xiamen, China, between October 2015 and August 2021. The study was conducted over a six-year period, during which eligible patients were identified from the electronic medical records of our institution. Inclusion criteria comprised: (1) histopathological confirmation of NPC via nasopharyngeal biopsy; (2) classification as stage III-IVA based on the eighth edition of the American Joint Committee on Cancer (AJCC) staging system; (3) completion of three cycles of IC followed by CCRT; (4) availability of EBV-DNA measurements both before and after IC; and (5) detectable EBV-DNA levels following the third cycle of IC. Individuals who did not complete the prescribed radiotherapy regimen were excluded. Ethical approval for this study was granted by the Ethics Committee of the First Affiliated Hospital of Xiamen University, and the requirement for informed consent was waived due to the retrospective design of the investigation. Data collection Data were systematically collected from the medical records of our institution during the study period. The following variables were incorporated for analysis: demographic factors (gender, age), lifestyle habits (smoking history, alcohol consumption), tumor characteristics (tumor [T] stage, nodal [N] stage, clinical stage), and treatment-related parameters (pre-treatment and post-IC plasma EBV-DNA levels, adjuvant therapy). Individuals who had smoked within the past year or those who had quit smoking for over one year were categorized as ever smokers. Tumor staging was determined based on the eighth edition of the AJCC TNM classification system. Plasma EBV-DNA quantification Peripheral blood samples (10 mL) were collected from patients before treatment using EDTA-coated tubes. From each sample, 2 mL of whole blood was processed to isolate peripheral mononuclear cells, which were subsequently stored at -80 °C for further analysis. Plasma EBV-DNA levels were quantified using droplet digital polymerase chain reaction (ddPCR). Sample preparation included heating at 75 °C for 10 min, followed by centrifugation at 12,000 g for 1 min. The EBV-DNA concentrations reported by our laboratory were initially expressed in IU/mL, which were subsequently converted to copies/mL using a conversion factor of 1 IU/mL ≈ 2.5 copies/mL [ 7 12 13 16 Treatment protocol Institutional guidelines recommended IC followed by platinum-based CCRT, with or without adjuvant chemotherapy, for patients with stage III-IVa disease. The IC regimens at our institution included docetaxel combined with cisplatin/nedaplatin (TP), docetaxel with cisplatin/nedaplatin and 5-fluorouracil (TPF), or gemcitabine with cisplatin/nedaplatin (GP). During CCRT, concurrent cisplatin, nedaplatin, or lobaplatin was administered. All chemotherapy cycles were repeated every three weeks. Definitive intensity-modulated radiotherapy was delivered to all patients, with prescribed doses of 70 Gy/32–33 fractions for the primary gross tumor volume, 66 Gy/32–33 fractions for involved cervical lymph nodes, 62 Gy/32–33 fractions for the high-risk clinical target volume, and 56 Gy/32–33 fractions for the low-risk clinical target volume. One month after CCRT, upon confirmation of locoregional tumor clearance, MC with S-1 was initiated within two weeks. S-1 was administered orally at 40 mg twice daily, regardless of body surface area, and continued uninterrupted for one year. Adverse events assessment Treatment-related toxicities, particularly those predefined and frequently associated with S-1, were systematically monitored during the study. All adverse events were evaluated and categorized based on the Common Terminology Criteria for Adverse Events (CTCAE), version 3.0. In the S-1 cohort, blood tests and toxicity assessments were conducted biweekly to ensure timely monitoring and management. Follow-up protocol Patients were monitored every three months during the first three years, every six months from the fourth to the fifth year, and annually thereafter, in accordance with guideline recommendations. Routine follow-up assessments included physical examinations, plasma EBV-DNA testing, and imaging evaluations of the head and neck, thorax, abdomen, and bones. Positron emission tomography-computed tomography was recommended for patients with detectable plasma EBV-DNA or imaging findings indicative of disease recurrence. Study endpoints comprised locoregional recurrence-free survival (LRFS), distant metastasis-free survival (DMFS), progression-free survival (PFS), and overall survival (OS). LRFS was defined as the interval from diagnosis to local or regional recurrence (LRR), DMFS as the time from diagnosis to DM, PFS as the duration from diagnosis to disease progression or death from any cause, and OS as the period from diagnosis to death from any cause. Statistical analysis Descriptive statistics were used to summarize patient clinical characteristics, including medians and ranges for continuous variables, and frequencies and percentages for categorical variables. Differences between groups were assessed using the chi-square test for categorical variables or Fisher’s exact test when expected frequencies were less than 5. The optimal cut-off point for post-IC EBV-DNA levels associated with PFS was determined using receiver operating characteristic (ROC) curve analysis, with the maximal area under the curve (AUC) value selected as the optimal threshold. Survival curves were generated using the Kaplan-Meier method, and differences between groups were compared using the log-rank test. Multivariate Cox proportional hazards regression analyses were performed to identify independent prognostic factors for survival outcomes, adjusting for potential confounders such as age, gender, lifestyle habits, histology, tumor stage, and treatment-related variables. Patients who were lost to follow-up or did not experience the event of interest (e.g., progression or death) during the study period were censored at the last follow-up date. All statistical analyses were conducted using SPSS version 26.0 (IBM Corporation, Armonk, NY, USA), with a two-sided P Results Patient characteristics At the time of diagnosis, a total of 325 patients with stage III-IV disease underwent three cycles of IC, of whom 103 patients (31.7%) with residual EBV-DNA after IC were included in this study (Table 1 n n n n n  Table 1 Patient baseline characteristics Variables n No MC (%) MC (%)  P Age (years) < 50 55 (53.4) 44 (53.0) 11 (55.0) 0.873 ≥ 50 48 (46.6) 39 (47.0) 9 (45.0) Gender Male 74 (71.8) 60 (72.3) 14 (70.0) 0.838 Female 29 (28.2) 23 (27.7) 6 (30.0) Smoking history No 52 (50.5) 42 (50.6) 10 (50.0) 0.961 Yes 51 (49.5) 41 (49.4) 10 (50.0) Alcohol consumption No 76 (73.8) 61 (73.5) 15 (75.0) 0.891 Yes 27 (26.2) 22 (26.5) 5 (25.0) Histology WHO I-II 14 (13.6) 13 (15.7) 1 (5.0) 0.212 WHO III 89 (86.4) 70 (84.3) 19 (95.0) Tumor stage T1 11 (10.7) 8 (9.6) 3 (15.0) 0.301 T2 19 (18.4) 14 (16.9) 5 (25.0) T3 46 (44.7) 36 (43.4) 10 (50.0) T4 27 (26.2) 25 (30.1) 2 (10.0) Nodal stage N0 1 (1.0) 1 (1.2) 0 (0) 0.131 N1 18 (17.5) 18 (21.7) 0 (0) N2 39 (37.9) 30 (36.1) 9 (45.0) N3 45 (43.7) 34 (41.0) 11 (55.0) Tumor stage III 39 (37.9) 32 (38.6) 7 (35.0) 0.769 IVA 64 (62.1) 51 (61.4) 13 (13.0) EBV-DNA status < 4000 copies/mL 62 (60.2) 52 (62.7) 10 (50.0) 0.299 ≥ 4000 copies/mL 41 (39.8) 31 (37.3) 10 (50.0) EBV-DNA status ≤ 90 copies/mL 25 (24.3) 19 (22.9) 6 (30.0) 0.506 > 90 copies/mL 78 (75.7) 64 (77.1) 14 (70.0) Among these patients, 20 (19.4%) received MC using S-1 for one year. There were no statistically significant differences between patients who received S-1 treatment and those who did not in terms of age ( P P P P P P P P P P 1 Patterns of disease progression and survival outcomes The median follow-up duration was 50.6 months (range, 9–96 months). Among these patients, 40 experienced disease progression, including 12 with LRR (30.0%), 24 with DM (60.0%), and 4 with both LRR and DM (10.0%). The median time to LRR was 26.2 months (range, 9–43 months), and the median time to DM was 13.1 months (range, 5–61 months). The 5-year LRFS, DMFS, PFS, and OS rates for all patients were 81.3%, 70.7%, 52.8%, and 72.1%, respectively (Fig. 1 D  Fig. 1 The locoregional recurrence-free survival ( A B C D Determination of residual EBV-DNA threshold The ROC curve was used to evaluate the relationship between residual EBV-DNA levels after IC and PFS. The results revealed that a residual EBV-DNA level > 90 copies/mL was significantly associated with PFS (AUC: 0.576; Youden index: 0.1725). Among the patients, 25 (24.3%) had residual EBV-DNA levels ≤ 90 copies/mL, while 78 (75.7%) had levels > 90 copies/mL. Kaplan-Meier analysis was conducted to evaluate the association between residual EBV-DNA levels and survival outcomes. The results indicated that residual EBV-DNA levels were not significantly correlated with LRFS (5-year rates: 95.5% vs. 76.0%, P P P P 2  Fig. 2 The locoregional recurrence-free survival ( A B C D Impact of metronomic chemotherapy on survival outcomes All patients completed one year of metronomic S-1 chemotherapy. Among these patients, the dosage of S-1 was reduced by one level in one patient and by two levels in another patient. Patients who received S-1 treatment exhibited similar LRFS (78.9% vs. 82.1%, P P P P 3  Fig. 3 The locoregional recurrence-free survival ( A B C D Prognostic analysis Multivariate Cox proportional hazards regression analysis was performed for these patients (Table 2 P P P P P P P P  Table 2 Multivariate prognostic analysis of independent prognostic factors associated with survival outcomes Variables LRFS DMFS PFS OS HR 95%CI  P HR 95%CI  P HR 95%CI  P HR 95%CI  P Age (years) < 50 1 1 1 1 ≥ 50 1.579 0.512–4.869 0.427 3.518 1.529–8.094 0.003 2.325 1.253–4.315 0.008 2.389 0.981–5.821 0.055 Gender Male 1 1 1 1 Female 2.844 0.501–16.154 0.238 1.097 0.360–3.339 0.871 1.453 0.585–3.614 0.421 1.065 0.255–4.448 0.932 Smoking history No 1 1 1 1 Yes 2.611 0.536–12.715 0.235 1.183 0.447–3.128 0.735 1.906 0.879–4.132 0.103 3.486 1.504–8.081 0.004 Alcohol consumption No 1 1 1 1 Yes 2.459 0.669–9.041 0.175 2.184 0.855–5.579 0.102 2.313 1.219–4.390 0.010 1.965 0.763–5.065 0.162 Histology WHO I-II 1 1 1 1 WHO III 1.045 0.271–4.028 0.949 0.990 0.378–2.589 0.983 0.901 0.401–2.025 0.800 0.924 0.326–2.619 0.881 Tumor stage T1-2 1 1 1 1 T3-4 1.890 0.567–6.301 0.300 2.122 0.788–5.717 0.137 1.809 0.903–3.627 0.095 1.813 0.713–4.610 0.211 Nodal stage N0-1 1 1 1 1 N2-3 2.103 0.431–10.272 0.358 3.402 1.115–10.376 0.031 2.892 1.262–6.629 0.012 2.688 0.909–7.949 0.074 EBV-DNA status < 4000 copies/mL 1 1 1 1 ≥ 4000 copies/mL 1.048 0.338–3.251 0.936 1.026 0.432–2.433 0.954 1.294 0.663–2.252 0.451 0.873 0.363–2.099 0.761 EBV-DNA status ≤ 90 copies/mL 1 1 1 1 > 90 copies/mL 5.949 0.785–45.082 0.084 4.978 1.413–17.535 0.012 3.679 1.592–8.499 0.002 2.524 0.833–7.652 0.102 MC No 1 1 1 1 Yes 1.063 0.313–3.611 0.922 — — 0.962 0.310 0.120–0.802 0.016 0.1 0.013–0.745 0.025 Adverse events during MC The most common adverse events in the 20 patients receiving metronomic S-1 were hyperpigmentation ( n n n n n n n n Discussion The present study aimed to evaluate survival outcomes and the potential benefits of adjuvant MC in LANPC patients with residual EBV-DNA following IC. Our findings offer critical insights into the management and follow-up approaches for NPC patients, particularly those with detectable EBV-DNA post-IC. Previous research has consistently shown that approximately 30% of LANPC patients exhibit detectable EBV-DNA levels after IC [ 7 9 7 8 17 18 19 20 In our study, among the 40 patients who experienced disease progression, 24 (60%) developed distant metastases, with a median time to metastasis of 13.1 months. This short interval suggests that patients with residual EBV-DNA may benefit from more intensive surveillance and adjuvant therapies to prevent or delay metastatic spread. Additionally, our ROC curve analysis identified a cutoff value of 90 copies/mL for residual EBV-DNA as a significant predictor of DMFS and PFS. These results reinforce the importance of residual EBV-DNA as a biomarker for disease progression in NPC. However, the lack of standardized EBV-DNA detection thresholds across institutions poses a challenge for consistent clinical interpretation and research [ 21 22 MC, characterized by the frequent administration of low-dose cytotoxic agents, has emerged as a promising adjuvant treatment strategy for LANPC [ 23 24 25 26 24 P P P 23 11 27 Currently, adjuvant therapy is not routinely recommended for patients who have undergone IC followed by CCRT. The Chinese Society of Clinical Oncology guidelines suggest metronomic capecitabine therapy only for high-risk patients [ 28 29 In our study, only 19.4% of patients received metronomic S-1 therapy; however, these patients exhibited improved DMFS, PFS, and OS. These results suggest that MC using S-1 is a promising adjuvant treatment option for LANPC patients, particularly those with residual EBV-DNA post-IC. Nevertheless, the lack of standardized guidelines for adjuvant therapy in LANPC underscores the need for further research to establish evidence-based recommendations. We are currently conducting a prospective study investigating the combination of metronomic S-1 and camrelizumab (a PD-1 inhibitor) for LANPC patients with residual EBV-DNA after IC (ChiCTR2500098668, with the registration date begin March 12, 2025). Similarly, a study from Singapore is exploring the use of one-year metronomic capecitabine and maintenance tislelizumab (a PD-1 inhibitor) for patients with persistently detectable EBV-DNA post-IC ( NCT06093061 Our study has several limitations, including its retrospective design, single-center nature, and relatively small sample size. Additionally, the lack of standardized EBV-DNA detection methods may have influenced the results. Future prospective multicenter studies with larger cohorts are needed to validate our findings and explore the potential of combining MC with immunotherapy to further improve outcomes in LANPC patients with residual EBV-DNA after IC. Conclusions In conclusion, our study highlights the poorer survival outcomes observed in LANPC patients with residual EBV-DNA levels following IC, as well as the potential survival advantages of MC in this subgroup. These findings highlight the necessity for standardized EBV-DNA detection protocols and further research to refine adjuvant treatment strategies for LANPC patients, particularly those with residual EBV-DNA after IC. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Lin-Feng Guo and Liu-Yun Gong contributed equally to this study. Acknowledgements Declared none. Author contributions Lin-Feng Guo, Liu-Yun Gong, and San-Gang Wu drafted the manuscript. Lin-Feng Guo and San-Gang Wu acquired the datasets. Qin Lin and San-Gang Wu conceived the study. Lin-Feng Guo and Liu-Yun Gong conducted the statistical analyses. Qin Lin and San-Gang Wu participated in the study design. All authors read and approved the final manuscript. Funding This study was partly supported by the Medical and Health Guidance Project of Xiamen City (No. 3502Z20244ZD1001 and 3502Z20224ZD1005). Data availability The data supporting the findings of the article are available within the article. Declarations Ethics approval and consent to participate The study was approved by the Ethics Committee of the First Affiliated Hospital of Xiamen University, and informed consent was waived due to the retrospective nature of the study. Consent for publication Not applicable. Competing interests The authors declare no competing interests. Human and animal rights This research was conducted on humans in accordance with the Helsinki Declaration of 1975, as revised in 2013 [ http://ethics.iit.edu/ecodes/node/3931 References 1. Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Jemal A Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 3 229 63 10.3322/caac.21834 38572751 Bray F, Laversanne M, Sung H, Ferlay J, Siegel RL, Soerjomataram I, Jemal A. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2024;74(3):229–63. 10.3322/caac.21834 38572751 10.3322/caac.21834 2. Neo J Yip PL Ong EHW Miao J Chow WM Wee JTS Fong KW Soong YL Tan TWK Tan JSH Sin SY Liu J Loh KS Tay JK Ang MK Tan SH Lim DWT Chua MLK Longitudinal post-radiotherapy plasma Epstein-Barr virus DNA trends inform on optimal risk stratification in endemic nasopharyngeal carcinoma Oral Oncol 2024 148 106655 10.1016/j.oraloncology.2023.106655 38056062 Neo J, Yip PL, Ong EHW, Miao J, Chow WM, Wee JTS, Fong KW, Soong YL, Tan TWK, Tan JSH, Sin SY, Liu J, Loh KS, Tay JK, Ang MK, Tan SH, Lim DWT, Chua MLK. Longitudinal post-radiotherapy plasma Epstein-Barr virus DNA trends inform on optimal risk stratification in endemic nasopharyngeal carcinoma. Oral Oncol. 2024;148:106655. 10.1016/j.oraloncology.2023.106655 38056062 10.1016/j.oraloncology.2023.106655 3. Lan K Mao J Sun X Li S Xie S Sun R Liu S Mai H Combined pre-treatment and middle-treatment Epstein-Barr virus DNA load contributes to prognostication and treatment modification in nasopharyngeal carcinoma patients Ther Adv Med Oncol 2024 16 17588359231221343 10.1177/17588359231221343 38188461 PMC10771739 Lan K, Mao J, Sun X, Li S, Xie S, Sun R, Liu S, Mai H. Combined pre-treatment and middle-treatment Epstein-Barr virus DNA load contributes to prognostication and treatment modification in nasopharyngeal carcinoma patients. Ther Adv Med Oncol. 2024;16:17588359231221343. 10.1177/17588359231221343 38188461 10.1177/17588359231221343 PMC10771739 4. Lu GZ Huang YX Guo LF Yu YF Lu ZZ Lin Q Wu SG Plasma Epstein-Barr virus DNA for the prediction of treatment response and disease progression in non-keratinizing differentiated nasopharyngeal carcinoma Infect Agent Cancer 2025 20 1 30 10.1186/s13027-025-00661-3 40394615 PMC12090694 Lu GZ, Huang YX, Guo LF, Yu YF, Lu ZZ, Lin Q, Wu SG. Plasma Epstein-Barr virus DNA for the prediction of treatment response and disease progression in non-keratinizing differentiated nasopharyngeal carcinoma. Infect Agent Cancer. 2025;20(1):30. 10.1186/s13027-025-00661-3 40394615 10.1186/s13027-025-00661-3 PMC12090694 5. Lai L Chen X Zhang C Chen X Chen L Tian G Zhu X Pretreatment plasma EBV-DNA load guides induction chemotherapy followed by concurrent chemoradiotherapy in locoregionally advanced nasopharyngeal cancer: A Meta-Analysis Front Oncol 2021 10 610787 10.3389/fonc.2020.610787 33665166 PMC7921716 Lai L, Chen X, Zhang C, Chen X, Chen L, Tian G, Zhu X. Pretreatment plasma EBV-DNA load guides induction chemotherapy followed by concurrent chemoradiotherapy in locoregionally advanced nasopharyngeal cancer: A Meta-Analysis. Front Oncol. 2021;10:610787. 10.3389/fonc.2020.610787 33665166 10.3389/fonc.2020.610787 PMC7921716 6. Jin YN Yao JJ Zhang F Wang SY Zhang WJ Zhou GQ Qi ZY Sun Y Is pretreatment Epstein-Barr virus DNA still associated with 6-year survival outcomes in locoregionally advanced nasopharyngeal carcinoma? J Cancer 2017 8 6 976 82 10.7150/jca.18124 28529609 PMC5436249 Jin YN, Yao JJ, Zhang F, Wang SY, Zhang WJ, Zhou GQ, Qi ZY, Sun Y. Is pretreatment Epstein-Barr virus DNA still associated with 6-year survival outcomes in locoregionally advanced nasopharyngeal carcinoma? J Cancer. 2017;8(6):976–82. 10.7150/jca.18124 28529609 10.7150/jca.18124 PMC5436249 7. Zheng H Zhou P Wang J Yu YF Zhou R Lin Q Wu SG Prognostic effect of residual plasma Epstein-Barr viral DNA after induction chemotherapy for locoregionally advanced nasopharyngeal carcinoma Cancer Med 2023 12 14 14979 87 10.1002/cam4.6132 37212447 PMC10417187 Zheng H, Zhou P, Wang J, Yu YF, Zhou R, Lin Q, Wu SG. Prognostic effect of residual plasma Epstein-Barr viral DNA after induction chemotherapy for locoregionally advanced nasopharyngeal carcinoma. Cancer Med. 2023;12(14):14979–87. 10.1002/cam4.6132 37212447 10.1002/cam4.6132 PMC10417187 8. Chen FP Luo YS Chen K Li JY Huo LQ Shi L Ou-Yang Y Cao XP Circulating Epstein-Barr virus DNA level post induction chemotherapy contributes to prognostication in advanced-stage nasopharyngeal carcinoma Eur J Cancer 2021 151 63 71 10.1016/j.ejca.2021.03.052 33964573 Chen FP, Luo YS, Chen K, Li JY, Huo LQ, Shi L, Ou-Yang Y, Cao XP. Circulating Epstein-Barr virus DNA level post induction chemotherapy contributes to prognostication in advanced-stage nasopharyngeal carcinoma. Eur J Cancer. 2021;151:63–71. 10.1016/j.ejca.2021.03.052 33964573 10.1016/j.ejca.2021.03.052 9. Lv J Xu LX Li ZX Lin L Wu CF Quan TQ Zhen ZC Li WF Tang LL Mao YP Chen L Guo R Zhang LL Ai XL Wu SY Hao MY Wei D Li JB Ma J Chen YP Zhou GQ Sun Y Longitudinal on-treatment Circulating tumor DNA as a biomarker for real-time dynamic risk monitoring in cancer patients: the EP-SEASON study Cancer Cell 2024 42 8 1401 e14144 10.1016/j.ccell.2024.07.001 39059389 Lv J, Xu LX, Li ZX, Lin L, Wu CF, Quan TQ, Zhen ZC, Li WF, Tang LL, Mao YP, Chen L, Guo R, Zhang LL, Ai XL, Wu SY, Hao MY, Wei D, Li JB, Ma J, Chen YP, Zhou GQ, Sun Y. Longitudinal on-treatment Circulating tumor DNA as a biomarker for real-time dynamic risk monitoring in cancer patients: the EP-SEASON study. Cancer Cell. 2024;42(8):1401–e14144. 10.1016/j.ccell.2024.07.001 39059389 10.1016/j.ccell.2024.07.001 10. Chen YP Ismaila N Chua MLK Colevas AD Haddad R Huang SH Wee JTS Whitley AC Yi JL Yom SS Chan ATC Hu CS Lang JY Le QT Lee AWM Lee N Lin JC Ma B Morgan TJ Shah J Sun Y Ma J Chemotherapy in combination with radiotherapy for Definitive-Intent treatment of stage II-IVA nasopharyngeal carcinoma: CSCO and ASCO guideline J Clin Oncol 2021 39 7 840 59 10.1200/JCO.20.03237 33405943 Chen YP, Ismaila N, Chua MLK, Colevas AD, Haddad R, Huang SH, Wee JTS, Whitley AC, Yi JL, Yom SS, Chan ATC, Hu CS, Lang JY, Le QT, Lee AWM, Lee N, Lin JC, Ma B, Morgan TJ, Shah J, Sun Y, Ma J. Chemotherapy in combination with radiotherapy for Definitive-Intent treatment of stage II-IVA nasopharyngeal carcinoma: CSCO and ASCO guideline. J Clin Oncol. 2021;39(7):840–59. 10.1200/JCO.20.03237 33405943 10.1200/JCO.20.03237 11. Chan ATC, Hui EP, Ngan RKC, Tung SY, Cheng ACK, Ng WT, Lee VHF, Ma BBY, Cheng HC, Wong FCS, Loong HHF, Tong M, Poon DMC, Ahuja AT, King AD, Wang K, Mo F, Zee BCY, Chan KCA, Lo YMD. Analysis of plasma Epstein-Barr virus DNA in nasopharyngeal cancer after chemoradiation to identify High-Risk patients for adjuvant chemotherapy: A randomized controlled trial. J Clin Oncol. 2018;JCO2018777847. 10.1200/JCO.2018.77.7847 10.1200/JCO.2018.77.7847 29989858 12. Hu B Sun M Wang Z Zheng Y Cai W Shi HH Zhuang Y Lin Q Prognostic value of programmed cell Death-Ligand 1 expression in Tumor-Infiltrating lymphocytes and viral load in peripheral blood mononuclear cells for Epstein-Barr Virus-Positive nasopharyngeal carcinoma Clin Chem 2020 66 9 1219 27 10.1093/clinchem/hvaa170 32870999 Hu B, Sun M, Wang Z, Zheng Y, Cai W, Shi HH, Zhuang Y, Lin Q. Prognostic value of programmed cell Death-Ligand 1 expression in Tumor-Infiltrating lymphocytes and viral load in peripheral blood mononuclear cells for Epstein-Barr Virus-Positive nasopharyngeal carcinoma. Clin Chem. 2020;66(9):1219–27. 10.1093/clinchem/hvaa170 32870999 10.1093/clinchem/hvaa170 13. Guo SS Yang JH Sun XS Liu LZ Yang ZC Liu LT Liu SL Li XY Lv XF Luo DH Li JB Liu Q Wang P Guo L Mo HY Sun R Yang Q Liang YJ Jia GD Zhao C Chen QY Tang LQ Mai HQ Reduced-dose radiotherapy for Epstein-Barr virus DNA selected staged III nasopharyngeal carcinoma: A single-arm, phase 2 trial Eur J Cancer 2023 194 113336 10.1016/j.ejca.2023.113336 37801967 Guo SS, Yang JH, Sun XS, Liu LZ, Yang ZC, Liu LT, Liu SL, Li XY, Lv XF, Luo DH, Li JB, Liu Q, Wang P, Guo L, Mo HY, Sun R, Yang Q, Liang YJ, Jia GD, Zhao C, Chen QY, Tang LQ, Mai HQ. Reduced-dose radiotherapy for Epstein-Barr virus DNA selected staged III nasopharyngeal carcinoma: A single-arm, phase 2 trial. Eur J Cancer. 2023;194:113336. 10.1016/j.ejca.2023.113336 37801967 10.1016/j.ejca.2023.113336 14. Liu LT Liang YJ Guo SS Xie Y Jia GD Wen DX Tang LQ Chen QY Mai HQ Identifying distinct risks of treatment failure in nasopharyngeal carcinoma: study based on the dynamic changes in peripheral blood lymphocytes, monocytes, N classification, and plasma Epstein-Barr virus DNA Head Neck 2022 44 1 34 45 10.1002/hed.26897 34636116 Liu LT, Liang YJ, Guo SS, Xie Y, Jia GD, Wen DX, Tang LQ, Chen QY, Mai HQ. Identifying distinct risks of treatment failure in nasopharyngeal carcinoma: study based on the dynamic changes in peripheral blood lymphocytes, monocytes, N classification, and plasma Epstein-Barr virus DNA. Head Neck. 2022;44(1):34–45. 10.1002/hed.26897 34636116 10.1002/hed.26897 15. Liang YJ Wen DX Luo MJ Tang LQ Guo SS Wang P Chen QY Liu LT Mai HQ Induction or adjuvant chemotherapy plus concurrent chemoradiotherapy versus concurrent chemoradiotherapy alone in paediatric nasopharyngeal carcinoma in the IMRT era: A recursive partitioning risk stratification analysis based on EBV DNA Eur J Cancer 2021 159 133 43 10.1016/j.ejca.2021.09.045 34743068 Liang YJ, Wen DX, Luo MJ, Tang LQ, Guo SS, Wang P, Chen QY, Liu LT, Mai HQ. Induction or adjuvant chemotherapy plus concurrent chemoradiotherapy versus concurrent chemoradiotherapy alone in paediatric nasopharyngeal carcinoma in the IMRT era: A recursive partitioning risk stratification analysis based on EBV DNA. Eur J Cancer. 2021;159:133–43. 10.1016/j.ejca.2021.09.045 34743068 10.1016/j.ejca.2021.09.045 16. Tang LL Guo R Zhang N Deng B Chen L Cheng ZB Huang J Hu WH Huang SH Luo WJ Liang JH Zheng YM Zhang F Mao YP Li WF Zhou GQ Liu X Chen YP Xu C Lin L Liu Q Du XJ Zhang Y Sun Y Ma J Effect of radiotherapy alone vs radiotherapy with concurrent chemoradiotherapy on survival without disease relapse in patients with Low-risk nasopharyngeal carcinoma: A randomized clinical trial JAMA 2022 328 8 728 36 10.1001/jama.2022.13997 35997729 PMC9399866 Tang LL, Guo R, Zhang N, Deng B, Chen L, Cheng ZB, Huang J, Hu WH, Huang SH, Luo WJ, Liang JH, Zheng YM, Zhang F, Mao YP, Li WF, Zhou GQ, Liu X, Chen YP, Xu C, Lin L, Liu Q, Du XJ, Zhang Y, Sun Y, Ma J. Effect of radiotherapy alone vs radiotherapy with concurrent chemoradiotherapy on survival without disease relapse in patients with Low-risk nasopharyngeal carcinoma: A randomized clinical trial. JAMA. 2022;328(8):728–36. 10.1001/jama.2022.13997 35997729 10.1001/jama.2022.13997 PMC9399866 17. Yang Y Pan J Wang H Zhao Y Qu S Chen N Chen X Sun Y He X Hu C Lin L Yu Q Wang S Wang G Lei F Wen J Yang K Lin Z Guo Y Chen S Huang X Wu Y Liang L Chen C Bai F Ma X Zhang Y Leaw S Zhang L Fang W Tislelizumab plus chemotherapy as first-line treatment for recurrent or metastatic nasopharyngeal cancer: A multicenter phase 3 trial (RATIONALE-309) Cancer Cell 2023 41 6 1061 e10724 10.1016/j.ccell.2023.04.014 37207654 Yang Y, Pan J, Wang H, Zhao Y, Qu S, Chen N, Chen X, Sun Y, He X, Hu C, Lin L, Yu Q, Wang S, Wang G, Lei F, Wen J, Yang K, Lin Z, Guo Y, Chen S, Huang X, Wu Y, Liang L, Chen C, Bai F, Ma X, Zhang Y, Leaw S, Zhang L, Fang W. Tislelizumab plus chemotherapy as first-line treatment for recurrent or metastatic nasopharyngeal cancer: A multicenter phase 3 trial (RATIONALE-309). Cancer Cell. 2023;41(6):1061–e10724. 10.1016/j.ccell.2023.04.014 37207654 10.1016/j.ccell.2023.04.014 18. Mai HQ Chen QY Chen D Hu C Yang K Wen J Li J Shi Y Jin F Xu R Pan J Qu S Li P Hu C Liu YC Jiang Y He X Wang HM Lim WT Liao W He X Chen X Wang S Yuan X Li Q Lin X Jing S Chen Y Lu Y Hsieh CY Yang MH Yen CJ Samol J Luo X Wang X Tang X Feng H Yao S Keegan P Xu RH Toripalimab plus chemotherapy for recurrent or metastatic nasopharyngeal carcinoma: the JUPITER-02 randomized clinical trial JAMA 2023 330 20 1961 70 10.1001/jama.2023.20181 38015220 PMC10685882 Mai HQ, Chen QY, Chen D, Hu C, Yang K, Wen J, Li J, Shi Y, Jin F, Xu R, Pan J, Qu S, Li P, Hu C, Liu YC, Jiang Y, He X, Wang HM, Lim WT, Liao W, He X, Chen X, Wang S, Yuan X, Li Q, Lin X, Jing S, Chen Y, Lu Y, Hsieh CY, Yang MH, Yen CJ, Samol J, Luo X, Wang X, Tang X, Feng H, Yao S, Keegan P, Xu RH. Toripalimab plus chemotherapy for recurrent or metastatic nasopharyngeal carcinoma: the JUPITER-02 randomized clinical trial. JAMA. 2023;330(20):1961–70. 10.1001/jama.2023.20181 38015220 10.1001/jama.2023.20181 PMC10685882 19. Yu YF Dai YQ Zhang ZK Lu GZ Lin Q Wu SG Induction camrelizumab and modified TPF (Nab-Paclitaxel, cisplatin, and S-1) in locoregionally advanced nasopharyngeal carcinoma Cancer Sci 2025 116 6 1616 26 10.1111/cas.70037 40031812 PMC12127089 Yu YF, Dai YQ, Zhang ZK, Lu GZ, Lin Q, Wu SG. Induction camrelizumab and modified TPF (Nab-Paclitaxel, cisplatin, and S-1) in locoregionally advanced nasopharyngeal carcinoma. Cancer Sci. 2025;116(6):1616–26. 10.1111/cas.70037 40031812 10.1111/cas.70037 PMC12127089 20. Xu C Zhou GQ Li WF Hu DS Chen XZ Lin SJ Jin F Huang XQ Peng G Huang J Wu Y Tao CJ Li JB Lin AH Zhao HY Hong SB Huang HL Tang LL Peng YL Shi KF Chen L Qi LP Yang KY Shen LF Sun Y Ma J Nivolumab combined with induction chemotherapy and radiotherapy in nasopharyngeal carcinoma: A multicenter phase 2 PLATINUM trial Cancer Cell 2025 43 5 925 e9364 10.1016/j.ccell.2025.01.014 40020668 Xu C, Zhou GQ, Li WF, Hu DS, Chen XZ, Lin SJ, Jin F, Huang XQ, Peng G, Huang J, Wu Y, Tao CJ, Li JB, Lin AH, Zhao HY, Hong SB, Huang HL, Tang LL, Peng YL, Shi KF, Chen L, Qi LP, Yang KY, Shen LF, Sun Y, Ma J. Nivolumab combined with induction chemotherapy and radiotherapy in nasopharyngeal carcinoma: A multicenter phase 2 PLATINUM trial. Cancer Cell. 2025;43(5):925–e9364. 10.1016/j.ccell.2025.01.014 40020668 10.1016/j.ccell.2025.01.014 21. Trevisiol C Gion M Vaona A Fabricio ASC Roca E Licitra L Alfieri S Bossi P The appropriate use of Circulating EBV-DNA in nasopharyngeal carcinoma: comprehensive clinical practice guidelines evaluation Oral Oncol 2021 114 105128 10.1016/j.oraloncology.2020.105128 33444925 Trevisiol C, Gion M, Vaona A, Fabricio ASC, Roca E, Licitra L, Alfieri S, Bossi P. The appropriate use of Circulating EBV-DNA in nasopharyngeal carcinoma: comprehensive clinical practice guidelines evaluation. Oral Oncol. 2021;114:105128. 10.1016/j.oraloncology.2020.105128 33444925 10.1016/j.oraloncology.2020.105128 22. Lee AWM Lee VHF Ng WT Strojan P Saba NF Rinaldo A Willems SM Rodrigo JP Forastiere AA Ferlito A A systematic review and recommendations on the use of plasma EBV DNA for nasopharyngeal carcinoma Eur J Cancer 2021 153 109 22 10.1016/j.ejca.2021.05.022 34153713 Lee AWM, Lee VHF, Ng WT, Strojan P, Saba NF, Rinaldo A, Willems SM, Rodrigo JP, Forastiere AA, Ferlito A. A systematic review and recommendations on the use of plasma EBV DNA for nasopharyngeal carcinoma. Eur J Cancer. 2021;153:109–22. 10.1016/j.ejca.2021.05.022 34153713 10.1016/j.ejca.2021.05.022 23. Yu YF Wu P Zhuo R Wu SG Metronomic S-1 adjuvant chemotherapy improves survival in patients with locoregionally advanced nasopharyngeal carcinoma Cancer Res Treat 2024 56 4 1058 67 10.4143/crt.2023.1343 38374697 PMC11491245 Yu YF, Wu P, Zhuo R, Wu SG. Metronomic S-1 adjuvant chemotherapy improves survival in patients with locoregionally advanced nasopharyngeal carcinoma. Cancer Res Treat. 2024;56(4):1058–67. 10.4143/crt.2023.1343 38374697 10.4143/crt.2023.1343 PMC11491245 24. Chen YP Liu X Zhou Q Yang KY Jin F Zhu XD Shi M Hu GQ Hu WH Sun Y Wu HF Wu H Lin Q Wang H Tian Y Zhang N Wang XC Shen LF Liu ZZ Huang J Luo XL Li L Zang J Mei Q Zheng BM Yue D Xu J Wu SG Shi YX Mao YP Chen L Li WF Zhou GQ Sun R Guo R Zhang Y Xu C Lv JW Guo Y Feng HX Tang LL Xie FY Sun Y Ma J Metronomic capecitabine as adjuvant therapy in locoregionally advanced nasopharyngeal carcinoma: a multicentre, open-label, parallel-group, randomised, controlled, phase 3 trial Lancet 2021 398 10297 303 13 10.1016/S0140-6736(21)01123-5 34111416 Chen YP, Liu X, Zhou Q, Yang KY, Jin F, Zhu XD, Shi M, Hu GQ, Hu WH, Sun Y, Wu HF, Wu H, Lin Q, Wang H, Tian Y, Zhang N, Wang XC, Shen LF, Liu ZZ, Huang J, Luo XL, Li L, Zang J, Mei Q, Zheng BM, Yue D, Xu J, Wu SG, Shi YX, Mao YP, Chen L, Li WF, Zhou GQ, Sun R, Guo R, Zhang Y, Xu C, Lv JW, Guo Y, Feng HX, Tang LL, Xie FY, Sun Y, Ma J. Metronomic capecitabine as adjuvant therapy in locoregionally advanced nasopharyngeal carcinoma: a multicentre, open-label, parallel-group, randomised, controlled, phase 3 trial. Lancet. 2021;398(10297):303–13. 10.1016/S0140-6736(21)01123-5 34111416 10.1016/S0140-6736(21)01123-5 25. Wu HL Zhou HX Chen LM Wang SS Metronomic chemotherapy in cancer treatment: new wine in an old bottle Theranostics 2024 14 9 3548 64 10.7150/thno.95619 38948068 PMC11209710 Wu HL, Zhou HX, Chen LM, Wang SS. Metronomic chemotherapy in cancer treatment: new wine in an old bottle. Theranostics. 2024;14(9):3548–64. 10.7150/thno.95619 38948068 10.7150/thno.95619 PMC11209710 26. Petrucci GN Magalhães TR Dias M Queiroga FL Metronomic chemotherapy: bridging theory to clinical application in canine and feline oncology Front Vet Sci 2024 11 1397376 10.3389/fvets.2024.1397376 38903691 PMC11187343 Petrucci GN, Magalhães TR, Dias M, Queiroga FL. Metronomic chemotherapy: bridging theory to clinical application in canine and feline oncology. Front Vet Sci. 2024;11:1397376. 10.3389/fvets.2024.1397376 38903691 10.3389/fvets.2024.1397376 PMC11187343 27. Twu CW Wang WY Chen CC Liang KL Jiang RS Wu CT Shih YT Lin PJ Liu YC Lin JC Metronomic adjuvant chemotherapy improves treatment outcome in nasopharyngeal carcinoma patients with postradiation persistently detectable plasma Epstein-Barr virus deoxyribonucleic acid Int J Radiat Oncol Biol Phys 2014 89 1 21 9 10.1016/j.ijrobp.2014.01.052 24725686 Twu CW, Wang WY, Chen CC, Liang KL, Jiang RS, Wu CT, Shih YT, Lin PJ, Liu YC, Lin JC. Metronomic adjuvant chemotherapy improves treatment outcome in nasopharyngeal carcinoma patients with postradiation persistently detectable plasma Epstein-Barr virus deoxyribonucleic acid. Int J Radiat Oncol Biol Phys. 2014;89(1):21–9. 10.1016/j.ijrobp.2014.01.052 24725686 10.1016/j.ijrobp.2014.01.052 28. Tang LL Chen YP Chen CB Chen MY Chen NY Chen XZ Du XJ Fang WF Feng M Gao J Han F He X Hu CS Hu DS Hu GY Jiang H Jiang W Jin F Lang JY Li JG Lin SJ Liu X Liu QF Ma L Mai HQ Qin JY Shen LF Sun Y Wang PG Wang RS Wang RZ Wang XS Wang Y Wu H Xia YF Xiao SW Yang KY Yi JL Zhu XD Ma J The Chinese society of clinical oncology (CSCO) clinical guidelines for the diagnosis and treatment of nasopharyngeal carcinoma Cancer Commun (Lond) 2021 41 11 1195 227 10.1002/cac2.12218 34699681 PMC8626602 Tang LL, Chen YP, Chen CB, Chen MY, Chen NY, Chen XZ, Du XJ, Fang WF, Feng M, Gao J, Han F, He X, Hu CS, Hu DS, Hu GY, Jiang H, Jiang W, Jin F, Lang JY, Li JG, Lin SJ, Liu X, Liu QF, Ma L, Mai HQ, Qin JY, Shen LF, Sun Y, Wang PG, Wang RS, Wang RZ, Wang XS, Wang Y, Wu H, Xia YF, Xiao SW, Yang KY, Yi JL, Zhu XD, Ma J. The Chinese society of clinical oncology (CSCO) clinical guidelines for the diagnosis and treatment of nasopharyngeal carcinoma. Cancer Commun (Lond). 2021;41(11):1195–227. 10.1002/cac2.12218 34699681 10.1002/cac2.12218 PMC8626602 29. Tang SQ Chen L Li WF Chan ATC Huang SH Chua MLK O’Sullivan B Lee AWM Lee NY Zhang Y Chen YP Xu C Sun Y Tang LL Ma J Identifying optimal clinical trial candidates for locoregionally advanced nasopharyngeal carcinoma: analysis of 9468 real-world cases and validation by two phase 3 multicentre, randomised controlled trial Radiother Oncol 2022 167 179 86 10.1016/j.radonc.2021.12.029 34971660 Tang SQ, Chen L, Li WF, Chan ATC, Huang SH, Chua MLK, O’Sullivan B, Lee AWM, Lee NY, Zhang Y, Chen YP, Xu C, Sun Y, Tang LL, Ma J. Identifying optimal clinical trial candidates for locoregionally advanced nasopharyngeal carcinoma: analysis of 9468 real-world cases and validation by two phase 3 multicentre, randomised controlled trial. Radiother Oncol. 2022;167:179–86. 10.1016/j.radonc.2021.12.029 34971660 10.1016/j.radonc.2021.12.029 ",
  "metadata": {
    "Title of this paper": "Identifying optimal clinical trial candidates for locoregionally advanced nasopharyngeal carcinoma: analysis of 9468 real-world cases and validation by two phase 3 multicentre, randomised controlled trial",
    "Journal it was published in:": "Infectious Agents and Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12461949/"
  }
}