{
  "title": "Paper_163",
  "abstract": "pmc Ther Adv Med Oncol Ther Adv Med Oncol 1560 tam TAM Therapeutic Advances in Medical Oncology 1758-8340 1758-8359 SAGE Publications PMC12495213 PMC12495213.1 12495213 12495213 10.1177/17588359251379397 10.1177_17588359251379397 1 Original Research Efficacy of Endostar plus concurrent chemoradiotherapy in locally advanced cervical cancer: a multicenter, phase II randomized trial Wu Fang * Department of Radiation Oncology, First Affiliated Hospital of Guangxi Medical University, Nanning, Guangxi, China Conceptualization Data curation Formal analysis Funding acquisition Investigation Methodology Project administration Resources Supervision Validation Writing – original draft Tang Xiaobi * Department of Oncology, Liuzhou People’s Hospital, Liuzhou, Guangxi, China Data curation Formal analysis Investigation Methodology Project administration Writing – original draft Liu Wenqi Department of Radiation Oncology, Second Affiliated Hospital of Guangxi Medical University, Nanning, Guangxi, China Data curation Investigation Project administration Luo Zhanxiong Department of Oncology, Liuzhou People’s Hospital, Liuzhou, Guangxi, China Data curation Investigation Project administration Huang Haixing Department of Oncology, Liuzhou Worker’s Hospital, Liuzhou, Guangxi, China Data curation Investigation Project administration Liu Meilian Department of Radiation Oncology, Guilin Medical University Affiliated Hospital, Guilin, Guangxi, China Data curation Investigation Project administration Wang Hongqian Department of Radiation Oncology, Red Cross Hospital of Yulin City, Yulin, Guangxi, China Data curation Investigation Project administration Liao Sihui Department of Radiation Oncology, People’s Hospital of Beihai, Beihai, Guangxi, China Data curation Investigation Project administration Ma Shanshan Department of Radiation Oncology, First Affiliated Hospital of Guangxi Medical University, Nanning, Guangxi, China Data curation Investigation Project administration Jiang Li Department of Radiation Oncology, First Affiliated Hospital of Guangxi Medical University, Nanning, Guangxi, China Data curation Investigation Project administration https://orcid.org/0000-0002-4853-6184 Zhang Yong Department of Radiation Oncology, First Affiliated Hospital of Guangxi Medical University, Nanning, GuangXi 530021, China Conceptualization Data curation Formal analysis Funding acquisition Investigation Methodology Project administration Resources Supervision Validation Writing – review & editing zhangyonggxmu@163.com * These authors contributed equally to this work and should be regarded as co-first authors. 3 10 2025 2025 17 478142 17588359251379397 4 5 2025 31 8 2025 03 10 2025 05 10 2025 05 10 2025 © The Author(s), 2025 2025 SAGE Publications Ltd unless otherwise noted. Manuscript content on this site is licensed under Creative Commons Licenses https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Background: Cervical cancer remains the fourth most common malignant cancer in females and the fourth most common cause of mortality in women worldwide. Approximately 70% of new cases are diagnosed as locoregionally advanced cervical cancer (LACC), posing a significant threat to women’s health. Concurrent chemoradiotherapy (CCRT) is the established standard treatment for LACC. However, more than 30% of patients still experience local recurrence and distant metastasis. Improving treatment outcomes for LACC is a critical global objective. Objective: To investigate the safety and efficacy of adding Endostar to CCRT in patients with LACC. Design: This is a multicenter, open-label, randomized, controlled, phase II trial. Methods: A total of 120 patients were randomly allocated (1:1) to receive either CCRT alone (definitive radiotherapy plus cisplatin 40 mg/m 2 2 Results: The CCRT + E arm demonstrated a significantly higher complete response rate (CRR) compared to the CCRT arm (68.3% vs 35.0%, p p p p p p p p Conclusion: The addition of Endostar to CCRT significantly enhanced tumor response (CRR) and reduced distant metastasis (DMFS) in LACC patients without increasing treatment toxicity, offering a promising therapeutic enhancement. Clinically, patients with squamous cell carcinoma, maximum tumor diameter > 4 cm, and International Federation of Gynecology and Obstetrics stage IB2 or IIA2–IIB disease derived particularly robust DMFS benefits from the combination regimen, suggesting they should be prioritized for this approach. Although the 5-year DMFS results are encouraging, validation in a larger phase III study and longer follow-up are warranted before considering this regimen as a new standard treatment modality for LACC. Trial registration: This trial was registered at ClinicalTrials.gov ( NCT 03086681 https://clinicaltrials.gov/study/NCT03086681 angiogenesis inhibitor cervical cancer chemoradiotherapy efficacy Endostar safety the Development and Application of Appropriate Medical and Health Technologies in Guangxi S2018025 the Program for Improvement of Scientific Research Ability of Young and Middle-Aged Scholars of Higher Education of Guangxi, China 2017KY0104 the Joint Project on Regional High-Incidence Diseases Research of the Guangxi Natural Science Foundation 2024GXNSFAA010026 the National Natural Science Foundation of China 82460573 the Scientific Research projects of Health Commission in Guangxi Z20211395 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date January-December 2025 typesetter ts1 Background Cervical cancer remains the fourth most common malignant cancer in females and the fourth most common cause of mortality in women worldwide, with locoregionally advanced cervical cancer (LACC) accounting for approximately 70% of new diagnoses and posing a significant threat to women’s health. 1 2 3 7 In 1971, Folkman confirmed that angiogenesis is the key mechanism underlying tumor growth.  8 9 11 Endostar, a recombinant human endostatin, offers a potentially more favorable profile. It demonstrates enhanced stability, multi-target anti-angiogenic activity, and the ability to normalize tumor vasculature, potentially improving oxygen delivery and treatment efficacy.  12  13  14 p p  15 Materials and methods Inclusion and exclusion criteria This multicenter, open-label, randomized, controlled, phase II trial was conducted at seven hospitals in Guangxi, China. This multicenter study involved the following seven institutions: The First Affiliated Hospital of Guangxi Medical University (Nanning, China), The Second Affiliated Hospital of Guangxi Medical University (Nanning, China), The Liuzhou People’s Hospital (Liuzhou, China), The Liuzhou Worker’s Hospital (Liuzhou, China), The Guilin Medical University Affiliated Hospital (Guilin, China), The Red Cross Hospital of Yulin City (Yulin, China), and The People’s Hospital of Beihai (Beihai, China). This trial was designed by the First Affiliated Hospital of Guangxi Medical University in Nanning, China. Patients with LACC were randomly assigned in a 1:1 ratio to either the CCRT arm, which received standard treatment with concurrent chemoradiotherapy, or the CCRT + E arm, which received Endostar in addition to CCRT ( Figure 1 9 9 Supplementary File S1  15 Figure 1. Study design. *EBRT Intensity-modulated conformal radiotherapy, regional lymphatics 45–50 Gy and pelvic metastatic lymph nodes 56–60 Gy in 25 (1.8–2 Gy per fraction, five times a week). # BT, brachytherapy; CCRT, concurrent chemoradiotherapy; CCRT + E, concurrent chemoradiotherapy plus Endostar; CRR, complete response rate; DMFS, distant metastasis-free survival; EBRT, external beam radiotherapy; FIGO, International Federation of Gynecology and Obstetrics; KPS, Karnofsky performance status; LACC, locally advanced cervical cancer; LRFS, locoregional recurrence-free survival; ORR, objective response rate; OS, overall survival; PFS, progression-free survival. Radiotherapy In this study, all patients received external beam radiation therapy (EBRT), which was delivered using intensity-modulated conformal radiotherapy, and high-dose rate intracavitary brachytherapy (BT). Regional lymphatics were administered at a dose of 45–50 Gy in 25 fractions (1.8–2.0 Gy per fraction, five times per week). Pelvic metastatic lymph nodes were boosted to a total dose of 56–60 Gy. Image-guided radiotherapy (IGRT) or cone-beam computed tomography (CBCT) was utilized with imaging for positional verification at the time of radiotherapy delivery and weekly. BT, which uses an iridium-192 source, was carried out at the end of EBRT with a dose of 28–30 Gy (6–7 Gy per fraction, twice a week). Brachytherapy planning was performed using 3D techniques based on CT, conducting dose-volume histogram (DVH) evaluation in 93.3% (112/120) of patients and 2D techniques based on point A in 6.7% (8/120) of patients. The median overall treatment time was 45.5 days (range: 36–67 days), with 87.5% of patients completing treatment within 56 days. Chemotherapy and antiangiogenesis therapy All patients received chemotherapy with cisplatin at a dose of 40 mg/m 2 2 2 14 16 Treatment assessments The tumor response evaluation was based on physical examination and pelvic magnetic resonance imaging (MRI), or CT with contrast and chest/abdomen CT with contrast at 3 months after the completion of treatment. Tumor response was evaluated according to RECIST 1.1, a standardized criteria developed by international oncology organizations, was categorized as follows: complete remission (CR), partial response (PR), stable disease (SD), and progressive disease (PD). The objective response rate (ORR) was the sum of the CR and PR rates. The primary endpoints were the CRR and treatment-related toxicity. The secondary endpoints included ORR, OS, PFS, distant metastasis-free survival (DMFS), and locoregional recurrence-free survival (LRFS). OS was defined as the time from randomization to the date of death or the last follow-up visit. PFS, DMFS, and LRFS were calculated from the date of randomization to the date of the first event, which was defined as progressive disease or death due to any cause for PFS, distant metastasis for DMFS, and regional recurrence for LRFS, respectively. Acute adverse events were defined as any treatment-related toxicities that occurred during the treatment and the following 3 months. Late treatment-related morbidities were assessed more than 3 months after completion of treatment. Acute and late drug-related events were assessed according to the Common Terminology Criteria for Adverse Events (CTCAE) version 3.0 (NCI, Bethesda, MD, USA). Acute and late radiation-induced morbidities were assessed according to the Radiation Therapy Oncology Group (RTOG) Toxicity Criteria. The patients were followed up every 3 months during the ﬁrst 2 years, every 6 months from 3 to 5 years, and then annually. Cervical/vaginal cytology test was performed annually. For patients with suspicious recurrent/metastatic disease, additional imaging such as positron emission tomography, bone scintigraphy, or a biopsy, whenever possible, was obtained to conﬁrm. Sample size calculation According to previous studies, for LACC patients, the CRR in those undergoing chemoradiation was 34.6%, whereas the CRR in those undergoing chemoradiation plus Endostar was 73.8%.  15 Statistical analyses All the data were analyzed using IBM SPSS 25.0 software (SPSS, Chicago, IL, USA), PASS 15 software (NCSS, LLC; Kaysville, UT,USA) and R V.4.3.2 (The R Foundation for Statistical Computing, Vienna, Austria). OS, PFS, DMFS, LRFS, and subgroup analysis were analyzed using the Kaplan–Meier approach and compared by the log-rank test. Statistical comparisons of continuous variables were performed by t 2 p p Results Patients Between March 2017 and September 2020, a total of 126 patients with cervical cancer stages IB2, and IIA2–IVA (FIGO 2009) were enrolled, and six patients were lost to follow-up (four patients in the CCRT arm, and two patients in the CCRT + E arm). Finally, 120 cases were included in the analysis. There were 60 patients in each arm. The median age was 53 years (range: 30–65 years). One hundred and nine patients (90.8%) had squamous cell carcinoma, and 11 (9.2%) had adenocarcinoma. Most patients were diagnosed with stage IIB disease (65.0%), followed by IIA2 (13.4%), IIIB (10.8%), IB2 (4.2%), IIIA (3.3%), and IVA disease (3.3%). In 86 patients, the maximum tumor diameter was greater than 4 cm. Moreover, 46 patients had pelvic lymph node metastasis. The clinical characteristics were well balanced between the two arms (all p Table 1 Table 1. Baseline demographic and disease characteristics in the intention-to-treat population. Variables CCRT + E ( n CCRT ( n  p Age (years) 53.60 ± 8.11 52.47 ± 7.52 0.97 Stage 0.854 IB2 3 2 IIA2 9 7 IIB 40 38 IIIA 1 3 IIIB 5 8 IVA 2 2 Histology 0.752 Squamous-cell carcinoma 55 54 Adenocarcinoma 5 6 Grade 0.304 1 2 4 2 50 43 3 8 13 Maximum tumor diameter 0.685 ⩽4 cm 18 16 >4 cm 42 44 Pelvic lymph node 0.133 Negative 41 33 Positive 19 27 t 2 CCRT, concurrent chemoradiotherapy; CCRT + E, concurrent chemoradiotherapy plus Endostar. Early treatment response All patients completed the planned treatment regimen. Among the 120 patients eligible for evaluation, CR and PR were observed in 62 patients (51.7%) and 57 patients (47.5%), respectively. In the CCRT arm, 21 patients achieved CR (35.0%) and 39 (65.0%) achieved PR, resulting in a CRR of 35.0% and an ORR of 100%. In the CCRT + E arm, 41 patients achieved CR (68.3%), 18 achieved PR (30.0%), and 1 achieved SD, resulting in a CRR of 68.3% and an ORR of 98.3%. The CCRT + E arm had a higher CRR than the CCRT arm did (68.3% vs 35.0%, p p Survival analysis Follow-up was performed until December 31, 2023, and the median follow-up time was 53.0 months (range of 8–81 months). The median follow-up duration was 48.0 months (range of 9–81 months) in the CCRT + E arm and 54.5 months (range: 8–81 months) in the CCRT arm. Among all the patients, 42 (35.0%) experienced treatment failure. Specifically, in the CCRT arm, 24 patients experienced treatment failure: 5 had locoregional failure alone, 10 had distant metastases alone, and 9 had both locoregional failure and distant metastases. In the CCRT + E arm, 18 patients experienced treatment failure: 10 had locoregional failure alone, 5 had distant metastases alone, and 3 had both locoregional failure and distant metastases. The DMFS rate was significantly higher in the CCRT + E arm than in the CCRT arm. The 1-, 2-, and 5-year DMFS rates were 91.6% versus 94.8%, 82.3% versus 91.6%, and 67.0% versus 88.0% in the CCRT and CCRT + E arms, respectively ( p p p p Figure 2(a)–(d) Figure 2. Kaplan–Meier estimates of cumulative survival curves after treatment with concurrent chemoradiotherapy compared with concurrent chemoradiotherapy plus Endostar. (a) Progression-free survival. (b) Overall survival. (c) Distant metastasis-free survival. (d) Locoregional recurrence-free survival for all patients in CCRT and CCRT + E groups. Crosses denote censored patients. CCRT, concurrent chemoradiotherapy; CCRT + E, concurrent chemoradiotherapy plus Endostar; CI, confidence interval; HR, hazard ratio. Prognostic factors Univariable analysis revealed that a maximum tumor diameter > 4 cm, stage IIIA–IVA, and failure to achieve CR were significant predictors of shorter PFS, OS, and LRFS. Treatment without Endostar, stage IIIA–IVA disease, and failure to achieve CR were significant predictors of shorter DMFS. In the multivariable analysis, only a maximum tumor diameter > 4 cm and failure to achieve CR were identified as predictive factors indicating poor PFS. In addition, maximum tumor diameter > 4 cm and stage IIIA–IVA disease were factors indicating a poor prognosis with regard to OS. Stage IIIA–IVA disease was a significant predictor of shorter DMFS. The maximum tumor diameter was a significant predictor of shorter LRFS ( Tables 2 3 Table 2. Univariate and multivariate analyses associated with PFS and OS. Univariate analysis Category  N PFS OS HR (95% CI)  p HR (95% CI)  p Endostar No/Yes 60/60 0.741 (0.402–1.366) 0.337 0.726 (0.376–1.403) 0.341 Age ⩽50/>50 y 45/75 0.808 (0.438–1.490) 0.495 0.796 (0.414–1.527) 0.493 Maximum tumor diameter ⩽4 cm/>4 cm 34/86 4.751 (1.693–13.327) 0.003 3.703 (1.309–10.475) 0.014 Pelvic lymph node No/Yes 74/46 1.624 (0.886–2.977) 0.117 1.432 (0.749–2.739) 0.278 Stage IB2, IIA2-IIB/IIIA–IVA 99/21 3.205 (1.677–6.123) 0.000 2.721 (1.336–5.544) 0.006 Histology SCC/AC 109/11 1.699 (0.666–4.335) 0.268 2.112 (0.818–5.451) 0.122 Grade G1–2/G3 99/21 1.179 (0.545–2.548) 0.676 1.437 (0.654–3.160) 0.367 Complete remission No/Yes 58/62 0.433(0.230–0.815) 0.009 0.408 (0.207–0.803) 0.009 Multivariate analysis HR (95% CI)  p HR (95% CI)  p Maximum tumor diameter ⩽4 cm/>4 cm 34/86 4.168 (1.475–11.779) 0.07 3.294 (1.155–9.390) 0.026 Stage IB2, IIA2–IIB/IIIA–IVA 99/21 2.362 (1.199–4.651) 0.013 2.025 (0.969–4.231) 0.061 Complete remission No/Yes 58/62 0.534 (0.277–1.031) 0.062 0.471 (0.234–0.945) 0.034 Cox proportional hazard regression model for univariate and multivariate analyses. CCRT, concurrent chemoradiotherapy; CCRT + E, concurrent chemoradiotherapy plus Endostar; OS, overall survival; PFS, progression-free survival. Table 3. Univariate and multivariate analyses associated with DMFS and LRFS. Univariate analysis Category  N DMFS LRFS HR (95% CI)  p HR (95% CI)  p Endostar No/Yes 60/60 0.412 (0.180–0.941) 0.035 0.944 (0.443–2.011) 0.882 Age ⩽50/>50y 45/75 0.897 (0.416–1.935) 0.782 0.737 (0.345–1.576) 0.432 Maximum tumor diameter ⩽4 cm/>4 cm 34/86 2.880 (0.995–8.342) 0.051 12.378 (1.679–91.272) 0.014 Pelvic lymph node No/Yes 74/46 1.666 (0.782–3.546) 0.186 1.587 (0.745–3.378) 0.231 Stage IB2, IIA2–IIB/IIIA–IVA 99/21 4.073 (1.848–8.976) 0.000 3.156 (1.406–7.081) 0.005 Histology SCC/AC 109/11 0.989 (0.234–4.186) 0.989 2.655 (1.004–7.022) 0.077 Grade G1–2/G3 99/21 0.899 (0.311–2.603) 0.845 1.108 (0.420–2.928) 0.835 Complete remission No/Yes 58/62 0.463 (0.212–1.012) 0.049 0.399 (0.179–0.888) 0.024 Multivariate analysis HR (95% CI)  p HR (95% CI)  p Endostar No/Yes 60/60 0.513 (0.211–1.243) 0.139 NS NS Maximum tumor diameter ⩽4 cm/>4 cm 34/86 NS NS 10.698 (1.442–79.377) 0.020 Stage IB2, IIA2–IIB/IIIA–IVA 99/21 3.498 (1.540–7.944) 0.003 2.198 (0.946–5.107) 0.067 Complete remission No/Yes 58/62 0.513 (0.211–1.243) 0.139 0.501 (0.218–1.150) 0.103 Cox proportional hazard regression model for univariate and multivariate analyses. CCRT, concurrent chemoradiotherapy; CCRT + E, concurrent chemoradiotherapy plus Endostar; DMFS, distant metastasis-free survival; LRFS, locoregional recurrence-free survival. Subgroup analyses In further subgroup analyses, we evaluated the effects of histology, maximum tumor diameter, FIGO stage, the presence of pelvic lymph node metastasis, and treatment response on PFS, OS, DMFS, and LRFS in the CCRT and CCRT + E arms. The results demonstrated that Endostar could significantly improved DMFS in patients with squamous cell carcinoma ( p p p p Tables 4 5 Table 4. Subgroup analysis with multiple testing correction of OS and PFS in CCRT versus CCRT + E for locally advanced cervical cancer. Variables PFS Adjusted p HR (95% CI) OS Adjusted P HR (95% CI) Squamous cell carcinoma CCRT (54) 59.3 0.097 0.651 63.0 0.095 0.617 CCRT + E (55) 72.7 78.2 Non-squamous cell carcinoma CCRT (6) 66.7 0.218 1.987 66.7 0.235 1.91 CCRT + E (5) 40.0 40.0 Maximum tumor diameter ⩽4 cm CCRT (16) 87.5 0.486 0.966 87.5 0.481 1.099 CCRT + E (18) 88.9 88.9 Maximum tumor diameter > 4cm CCRT (44) 50.0 0.191 0.753 54.5 0.193 0.735 CCRT + E (42) 61.9 69.0 Stage IB2, IIA2–IIB CCRT (47) 66.0 0.170 0.698 68.1 0.251 0.504 CCRT + E (52) 76.9 78.8 Stage IIIA–IVA CCRT (13) 38.5 0.470 0.958 46.2 0.258 0.640 CCRT + E (8) 25.0 50.0 Pelvic lymph node negative CCRT (33) 66.7 0.362 0.861 69.7 0.427 0.921 CCRT + E (41) 73.2 75.6 Pelvic lymph node positive CCRT (27) 51.9 0.229 0.709 55.6 0.183 0.622 CCRT + E (19) 63.2 73.7 Subgroup analyses were performed using the Kaplan–Meier method and Cox proportional hazards regression. To control the family-wise error rate arising from multiple comparisons, the Bonferroni P/2 correction was applied to adjust significance levels. CCRT, concurrent chemoradiotherapy; CCRT + E, concurrent chemoradiotherapy plus Endostar; OS, overall survival; PFS, progression-free survival. Table 5. Subgroup analysis with multiple testing correction of DMFS and LRFS in CCRT versus CCRT + E for locally advanced cervical cancer. Variables DMFS Adjusted p HR (95% CI) LRFS Adjusted P HR (95% CI) Squamous cell carcinoma CCRT (54) 66.7 0.005 0.317 77.8 0.316 0.815 CCRT + E (55) 89.1 81.8 Non-squamous cell carcinoma CCRT (6) 83.3 0.197 1.913 66.7 0.238 1.873 CCRT + E (5) 60.0 40.0 Maximum tumor diameter ⩽4 cm CCRT (16) 87.5 0.486 0.966 93.8 0.144 0.140 CCRT + E (18) 88.9 100 Maximum tumor diameter > 4 cm CCRT (44) 61.4 0.011 0.357 70.5 0.425 1.076 CCRT + E (42) 85.7 69.0 Stage IB2, IIA2–IIB CCRT (47) 70.2 0.005 0.234 80.9 0.490 0.988 CCRT + E (52) 92.3 82.7 Stage IIIA–IVA CCRT (13) 61.5 0.472 0.951 61.5 0.389 1.208 CCRT + E (8) 50.0 50.0 Pelvic lymph node negative CCRT (33) 69.7 0.058 0.435 78.8 0.434 0.915 CCRT + E (41) 87.8 82.9 Pelvic lymph node positive CCRT (27) 66.7 0.09 0.416 74.1 0.408 0.1137 CCRT + E (19) 84.2 68.4 Subgroup analyses were performed using the Kaplan–Meier method and Cox proportional hazards regression. To control the family-wise error rate arising from multiple comparisons, the Bonferroni P/2 correction was applied to adjust significance levels. CCRT, concurrent chemoradiotherapy; CCRT + E, concurrent chemoradiotherapy plus Endostar; DMFS, distant metastasis-free survival; LRFS, locoregional recurrence-free survival. Therapy-related toxicities Both arms had similar toxicity profiles. The most commonly observed acute toxicities were hematologic and gastrointestinal toxicities. Grade 1–2 bone marrow suppression was recognized in 31 patients (51.7%) and grade 3–4 bone marrow suppression was detected in 24 patients (40.0%) in the CCRT + E arm, compared with 26 patients (43.3%) and 28 patients (46.7%) in the CCRT arm, respectively ( p p p p Table 6 Table 6. Spectrum and incidence of treatment-related adverse events in the study cohort. Variables CCRT + E ( n CCRT ( n  Z  p all Grade1–2 Grade3–4 all Grade1–2 Grade3–4 Hematologic toxicity 55 31 24 54 26 28 −0.536 0.592 Hepatic toxicity 5 5 0 5 5 0 −0.658 0.511 Renal toxicity 5 5 0 2 2 0 −0.193 0.052 Cardiac toxicity 0 0 0 0 0 0 0 1 Gastrointestinal Toxicity 46 42 4 45 40 5 −0.035 0.972 Bleeding 4 4 0 3 3 0 −1.164 0.254 Hypertension 0 0 0 0 0 0 0 1 Lower extremity Lymphedema 3 3 0 4 4 0 −0.388 0.698 Radiation proctitis 6 5 1 4 3 1 −0.219 0.827 Radiation cystitis 1 1 0 1 1 0 0 1 Toxicity incidence was analyzed using non-parametric statistical tests. CCRT, concurrent chemoradiotherapy; CCRT + E, concurrent chemoradiotherapy plus Endostar. Discussion CCRT, consisting of radiotherapy and cisplatin-based chemotherapy, has been the standard treatment for LACC for nearly 20 years, yet its efficacy remains unsatisfactory. To improve the prognosis of LACC, a variety of strategies combining radiotherapy and chemotherapy have been adopted, including neoadjuvant chemotherapy plus CCRT, 17 18  19  20  7 Recently, the combination of angiogenesis inhibitors with chemoradiotherapy has become a new hot topic in the field of LACC treatment. As an anti-VEGF antibody, bevacizumab is capable of reducing tumor volume, postponing tumor growth, and suppressing tumor metastasis. The RTOG 0417 trial investigated chemoradiotherapy with bevacizumab among 49 patients with IB–IIIB stage cervical cancer and showed promising efficacy results. The 2- and 3-year OS rates were 89.8% and 81.3%. The OS was improved in this study compared to the results from RTOG 9001 (2- and 3-year OS rates of 80.2% and 76.8%, respectively).  21 9 11  22 p p  23 p  24 p p Inspired by the marked short-term efficacy of Endostar and chemoradiotherapy in LACC, there have been ongoing efforts to improve survival rates. Overall, most studies have shown that Endostar does not improve 2-year survival rates. A retrospective study by Feng et al. grouped the patients with stage IIB–IVA cervical carcinoma based on whether they received Endostar or not. The results revealed that receiving Endostar did not significantly affect PFS ( p p  23 p p p  25 p  26 p p p  27  28 p p p  29  30 22 31 32  33 Previous studies reported that the most common acute toxicities associated with Endostar combined with chemoradiotherapy were myelosuppression and gastrointestinal toxicity, which were mainly grade 1–2. A meta-analysis of 13 studies suggested that the combined use of Endostar significantly increased the occurrence of gastrointestinal adverse reactions and hypertension; however, it did not affect treatment efficacy.  34  25  23 To provide potential insights into the selection of the patients who may benefit the most from treatment with Endostar combined with chemoradiotherapy, a subset analysis was conducted. Prior studies have shown that patients with positive VEGFR2 expression who were treated with CCRT + E tended to have a better ORR and PFS than those treated with CCRT alone. However, this difference was not statistically significant in the entire study population.  25 p  23 Table 5 Limitations To our knowledge, this is the first phase II study to report the 5-year survival rate of LACC patients treated with Endostar combined with chemoradiotherapy in LACC. However, this study has several limitations. First, as a phase II clinical trial, it included a small sample size. Second, the follow-up time should be longer. Third, our study adopts simple randomization without stratification may introduce imbalance in baseline characteristics. When used with concurrent chemoradiotherapy, Endostar has the potential to further improve long-term survival rates. Therefore, we believe that it is imperative to initiate a well-designed, randomized phase III trial to properly evaluate the role of Endostar in combination with chemoradiotherapy for the treatment of patients with LACC. Conclusion The addition of Endostar to CCRT significantly enhanced tumor response (CRR) and reduced distant metastasis (DMFS) in LACC patients without increasing treatment toxicity, offering a promising therapeutic enhancement. Clinically, patients with squamous cell carcinoma, maximum tumor diameter > 4 cm, and FIGO stage IB2 or IIA2–IIB disease derived particularly robust DMFS benefits from the combination regimen, suggesting they should be prioritized for this approach. Although the 5-year DMFS results are encouraging, validation in a larger phase III study and longer follow-up are warranted before considering this regimen as a new standard treatment modality for LACC. Supplemental Material sj-docx-1-tam-10.1177_17588359251379397 – Supplemental material for Efficacy of Endostar plus concurrent chemoradiotherapy in locally advanced cervical cancer: a multicenter, phase II randomized trial Supplemental material, sj-docx-1-tam-10.1177_17588359251379397 for Efficacy of Endostar plus concurrent chemoradiotherapy in locally advanced cervical cancer: a multicenter, phase II randomized trial by Fang Wu, Xiaobi Tang, Wenqi Liu, Zhanxiong Luo, Haixing Huang, Meilian Liu, Hongqian Wang, Sihui Liao, Shanshan Ma, Li Jiang and Yong Zhang in Therapeutic Advances in Medical Oncology None. ORCID iD: https://orcid.org/0000-0002-4853-6184 Supplemental material: Declarations Ethics approval and consent to participate: Consent for publication: Author contributions: Fang Wu: Xiaobi Tang: Wenqi Liu: Zhanxiong Luo: Haixing Huang: Meilian Liu: Hongqian Wang: Sihui Liao: Shanshan Ma: Li Jiang: Yong Zhang: Funding: The authors declare that there is no conflict of interest. Availability of data and materials: References 1 Sung H Ferlay J Siegel RL et al Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 3 209 249 33538338 10.3322/caac.21660 2 Rodrigues AN de Melo AC Calabrich A et al Social disparities and patients’attitudes are associated with lower rates of cervical cancer screening in Brazil: results of EVITA study (LACOG 0215) JCO 2018 36 3 Rose PG Bundy BN Watkins EB et al Concurrent cisplatin-based radiotherapy and chemotherapy for locally advanced cervical cancer N Engl J Med 1999 341 9 708 10.1056/NEJM199908263410924 10460825 4 Thomas GM. Improved treatment for cervical cancer concurrent chemotherapy and radiotherapy N Engl J Med 1999 340 15 1198 1200 10202172 10.1056/NEJM199904153401509 5 Toita T Moromizato H Ogawa K et al Concurrent chemoradiotherapy using high-dose-rate intracavitary brachytherapy for uterine cervical cancer Gynecol Oncol 2005 96 3 665 670 15721409 10.1016/j.ygyno.2004.11.046 6 Todo Y Watari H. Concurrent chemoradiotherapy for cervical cancer: background including evidence-based data, pitfalls of the data, limitation of treatment in certain groups Chin J Cancer Res 2016 28 2 221 227 27199520 10.21147/j.issn.1000-9604.2016.02.10 PMC4865615 7 Chemoradiotherapy for Cervical Cancer Meta-Analysis Collaboration Reducing uncertainties about the effects of chemoradiotherapy for cervical cancer: a systematic review and meta-analysis of individual patient data from 18 randomized trials J Clin Oncol 2008 26 35 5802 5812 19001332 10.1200/JCO.2008.16.4368 PMC2645100 8 Folkman J. Tumor angiogenesis: therapeutic implications N Engl J Med 1971 285 21 1182 1186 4938153 10.1056/NEJM197111182852108 9 Tewari KS Sill MW Penson RT et al Bevacizumab for advanced cervical cancer: final overall survival and adverse event analysis of a randomised, controlled, open-label, phase 3 trial (Gynecologic Oncology Group 240) Lancet 2017 390 10103 1654 1663 28756902 10.1016/S0140-6736(17)31607-0 PMC5714293 10 Jackson MW Rusthoven CG Fisher CM et al Clinical potential of bevacizumab in the treatment of metastatic and locally advanced cervical cancer: current evidence Onco Targets Ther 2014 7 751 759 24876784 10.2147/OTT.S49429 PMC4037327 11 Tewari KS Sill MW Long HJ 3rd et al Improved survival with bevacizumab in advanced cervical cancer N Engl J Med 2017 377 7 702 10.1056/NEJMx170002 28745937 12 Wu Y Zheng Y Shen Z et al Endostar combined with radiotherapy increases radiation sensitivity by decreasing the expression of TGF-b1, HIF-1a and bFGF Exp Ther Med 2014 7 4 911 916 24669250 10.3892/etm.2014.1526 PMC3965127 13 Guo F Chen C Liang Y et al Efficacy of the combination of Endostar with chemotherapy on stage IVb and recurrent metastatic cervical cancer Zhong Nan Da Xue Xue Bao Yi Xue Ban 2020 45 12 1412 1418 33472996 10.11817/j.issn.1672-7347.2020.190321 14 Ke QH Zhou SQ Huang M et al Early efficacy of Endostar combined with chemoradiotherapy for advanced cervical cancers Asian Pac J Cancer Prev 2012 13 3 923 926 22631672 10.7314/apjcp.2012.13.3.923 15 Schulz KF Altman DG Moher D CONSORT 2010 statement: updated guidelines for reporting parallel group randomised trials J Pharmacol Pharmacother 2010 1 2 100 107 21350618 10.4103/0976-500X.72352 PMC3043330 16 Peng F Xu Z Wang J et al Recombinant human endostatin normalizes tumor vasculature and enhances radiation response in xenografted human nasopharyngeal carcinoma models PLoS One 2012 7 4 10.1371/journal.pone.0034646 PMC3322143 22496834 17 da Costa SCS Bonadio RC Gabrielli FCG et al Neoadjuvant chemotherapy with cisplatin and gemcitabine followed by chemoradiation versus chemoradiation for locally advanced cervical cancer: a randomized phase II trial J Clin Oncol 2019 37 33 3124 3131 31449470 10.1200/JCO.19.00674 18 Nunes de Arruda F da Costa S Bonadio R et al Quality of life of locally advanced cervical cancer patients after neoadjuvant chemotherapy followed by chemoradiation versus chemoradiation alone (CIRCE trial): a randomized phase II trial Int J Gynecol Cancer 2020 30 6 749 756 32321767 10.1136/ijgc-2019-001134 PMC7362881 19 Homaei Shandiz F Arastouei S Hosseini S et al Capecitabine-enhanced brachytherapy in locally advanced cervical cancer: a phase II Non-randomized trial on safety and efficacy Cancer Invest 2025 43 4 244 256 40268743 10.1080/07357907.2025.2493238 20 Mileshkin LR Moore KN Barnes EH et al Adjuvant chemotherapy following chemoradiotherapy as primary treatment for locally advanced cervical cancer versus chemoradiotherapy alone (OUTBACK): an international, open-label, randomised, phase 3 trial Lancet Oncol 2023 24 5 468 482 37080223 10.1016/S1470-2045(23)00147-X PMC11075114 21 Schefter T Winter K Kwon JS et al RTOG 0417: efficacy of bevacizumab in combination with definitive radiation therapy and cisplatin chemotherapy in untreated patients with locally advanced cervical carcinoma Int J Radiat Oncol Biol Phys 2014 88 1 101 105 24331655 10.1016/j.ijrobp.2013.10.022 22 Liu L Qiao Y Hu C et al Endostatin exerts radiosensitizing effect in non-small cell lung cancer cells by inhibiting VEGFR2 expression Clin Transl Oncol 2016 18 1 18 26 26542176 10.1007/s12094-015-1319-6 23 Feng Y Li X Sun F et al Efficacy and safety analysis of recombinant human endostatin (Endostar) combined with chemoradiotherapy for locally advanced cervical cancer: a 2-center retrospective study Technol Cancer Res Treat 2024 23 10.1177/15330338241263026 PMC11271135 39043041 24 Shu H Dong Y Xu Z et al The efficacy and safety of continuous intravenous endostar treatment combined with concurrent chemoradiotherapy in patients with locally advanced cervical squamous cell carcinoma: a randomized controlled trial Front Oncol 2021 11 723193 34485157 10.3389/fonc.2021.723193 PMC8414882 25 Lu H Wu Y Liu X et al Endostar: an antiangiogenesis inhibitor, combined with chemoradiotherapy for locally advanced cervical cancer Oncol Res 2022 28 9 929 944 34544526 10.3727/096504021X16318716607908 PMC8790112 26 Beskow C Agren-Cronqvist AK Granath F et al Pathologic complete remission after preoperative intracavitary radiotherapy of cervical cancer stage Ib and IIa is a strong prognostic factor for long-term survival: analysis of the Radiumhemmet data 1989-1991 Int J Gynecol Cancer 2002 12 2 158 170 11975675 10.1046/j.1525-1438.2002.01089.x 27 Yuan M Zhai Y Men Y et al Endostar (rh-endostatin) improves efficacy of concurrent chemoradiotherapy for locally advanced non-small cell lung cancer: a systematic review and meta-analysis Thorac Cancer 2021 12 23 3208 3215 34676669 10.1111/1759-7714.14188 PMC8636201 28 M Kang DY Ma JQ Gao et al Endostar combined with concurrent chemoradiotherapy versus concurrent chemoradiotherapy alone for locoregionally advanced nasopharyngeal carcinoma (LA-NPC): a phase III, prospective, randomised-controlled, multicenter clinical trial JCO 2024 42 6002 29 Lorusso D Xiang Y Hasegawa K et al Pembrolizumab or placebo with chemoradiotherapy followed by pembrolizumab or placebo for newly diagnosed, high-risk, locally advanced cervical cancer (ENGOT-cx11/GOG-3047/KEYNOTE-A18): a randomised, double-blind, phase 3 clinical trial Lancet 2024 403 10434 1341 1350 38521086 10.1016/S0140-6736(24)00317-9 30 Lindegaard JC Kirisits C Schmid MP et al Impact of patient selection on real-world outcomes by using the EMBRACE-II treatment protocol in locally advanced cervical cancer Int J Radiat Oncol Biol Phys 10.1016/j.ijrobp.2025.05.068 40460895 31 Zhu H Yang X Ding Y et al Recombinant human endostatin enhances the radioresponse in esophageal squamous cell carcinoma by normalizing tumor vasculature and reducing hypoxia Sci Rep 2015 5 14503 26412785 10.1038/srep14503 PMC4585975 32 Yan H Guo W Li K et al Combination of DESI2 and endostatin gene therapy significantly improves antitumor efficacy by accumulating DNA lesions, inducing apoptosis and inhibiting angiogenesis Exp Cell Res 2018 371 1 50 62 30055135 10.1016/j.yexcr.2018.07.040 33 Wu F Lu Z Que J et al The safety of combining Endostar with concurrent chemoradiotherapy for the treatment of locally advanced cervical cancer and the evaluation of its anti-angiogenic effects via transrectal contrast-enhanced ultrasound Front Oncol 2025 15 1514425 40406255 10.3389/fonc.2025.1514425 PMC12095288 34 Maimaitiming N Ma X Wei Y et al Efficacy and safety of Endostar combined with chemoradiotherapy versus chemoradiotherapy alone in locally advanced cervical cancer: a PRISMA-compliant systematic review and meta-analysis Medicine (Baltimore) 2022 101 36 10.1097/MD.0000000000030170 PMC10980378 36086700 ",
  "metadata": {
    "Title of this paper": "Efficacy and safety of Endostar combined with chemoradiotherapy versus chemoradiotherapy alone in locally advanced cervical cancer: a PRISMA-compliant systematic review and meta-analysis",
    "Journal it was published in:": "Therapeutic Advances in Medical Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495213/"
  }
}