{
  "title": "Paper_1156",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12475427 PMC12475427.1 12475427 12475427 41006616 10.1038/s41598-025-18820-2 18820 1 Article Identification of biomarkers associated with mitophagy in bladder cancer Huang Xianbin Meng Yanqiu Song Jielong Zhu Yizi Li Jian Xi Yan Peng Xiaodong pxddhbb@163.com Xiong Yaoyi xiongyaoyi@ncu.edu.cn https://ror.org/042v6xz23 grid.260463.5 0000 0001 2182 8825 Department of Oncology, The First Affiliated Hospital, Jiangxi Medical College, Nanchang University, 26 9 2025 2025 15 478255 33272 4 5 2025 3 9 2025 26 09 2025 28 09 2025 29 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Bladder cancer (BLCA) is the most prevalent malignant tumor of the urinary system. Mitophagy is a selective form of autophagy that occurs within the mitochondria. The goal of this study was to determine mitophagy-related biomarkers associated with BLCA and to explore their underlying molecular mechanisms. CTSK, MTERF3, SRC, and CSNK2B were identified as biomarkers. A risk model classified BLCA patients into high-risk group (HRG) and low-risk group (LRG), with HRG patients exhibiting lower survival probabilities. The “chemical carcinogenesis-DNA adducts” and “cytokine-cytokine receptor interaction” signaling pathway were closely associated with HRG and LRG. TP53 had the highest mutation frequencies in the HRG and LRG, respectively. The two groups exhibited significant differences in 14 immune cells, including M2 macrophages. CTSK exhibited the strongest correlation with the naive B cells. A total of 135 drugs differed in sensitivity between HRG and LRG, including KU.55933. The identified regulatory network included ADAMTSL4-AS1-hsa-miR-149-5p-SRC. Expression analysis showed that CTSK was significantly downregulated in the BLCA group, while MTERF3, SRC, and CSNK2B were significantly upregulated. In conclusion, CTSK, MTERF3, SRC, and CSNK2B laid the foundation for targeted therapy in the treatment of BLCA. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-18820-2. Keywords Bladder cancer Mitophagy Biomarkers Risk model Subject terms Biological techniques Computational biology and bioinformatics National Natural Science Foundation of China 82303182 Xiong Yaoyi Natural Science Foundation of Jiangxi Province 20232BAB216085 Xiong Yaoyi pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Bladder cancer (BLCA) ranks among the most frequent malignant tumors of the urinary tract worldwide, characterised mainly by painless haematuria, with significant differences in morbidity and mortality between regions and populations. Overall, there are approximately 550,000 new cases and 200,000 deaths per year globally 1 2 3 Mitochondrial autophagy is a selective mode of autophagy, a process in which the autophagosome selectively wraps mitochondria with abnormal intracellular function and transports them to the lysosome for degradation, which mainly involves the steps of selective recognition, wrapping by autophagosome, and degradation by the lysosome 4 5 6 7 8 Therefore, in this study, based on BLCA transcriptome data and combined with mitochondrial autophagy-related genes, differential analysis, one-way Cox combined with PH assumption, and then LASSO were performed to screen the genes related to BLCA prognosis and calculate risk scores. After that, the prognostic model was constructed and validated. Then the differences between immune microenvironment, immunotherapy, gene mutation and drug sensitivity were explored to provide new theoretical support and reference basis for the treatment of BLCA. Results Acquisition of 42 candidate genes In the TCGA-BLCA dataset, 12,479 Differentially expressed genes (DEGs) were identified, with 8,037 genes upregulated and 4,442 genes downregulated in the BLCA group (Fig. 1 P 1 P 1 Fig. 1 Acquisition of 42 candidate genes. ( a b c d e f By intersecting DEGs and mitophagy-related genes (MRGs), 42 candidate genes were identified (Fig. 1 1 Identification of CTSK, MTERF3, SRC, and CSNK2B as biomarkers A total of 5 candidate biomarkers (CTSK, RHOT2, MTERF3, SRC, and CSNK2B) were identified through univariate Cox regression analysis (HR ≠ 1 and P P 2 2 Fig. 2 Identification of as biomarkers. ( a P P b c d e f h GSE32894 Development of a risk model with high predictive accuracy Based on 4 biomarkers, a risk model was constructed. Based on the median risk score value of 0.0134, the 406 BLCA samples in the TCGA-BLCA dataset were classified into 203 high-risk group (HRG) samples and 203 low-risk group (LRG) samples. Kaplan–Meier (KM) curves showed that the survival rate was considerably reduced in the HRG ( P 2 2 2 GSE32894 2 Association between risk score and clinical features The risk score was strongly associated with N stage, grade, T stage, stage, and survival status ( P 3 Fig. 3 Association between risk score and clinical features. Each violin in this figure represents a set of pathological features, and the width of the violin corresponds to the density of the data at that point. P p p Exploration of signaling pathways Gene set enrichment analysis (GSEA) results indicated that the main signaling pathways significantly enriched for DEGs between the HRG and LRG were “chemical carcinogenesis-DNA adducts” and “cytokine-cytokine receptor interaction” (Fig. 4 4 Fig. 4 Exploration of signaling pathways. ( a b Significant association between risk score and immune microenvironment The infiltration of 22 types of immune cells was presented in the stacked plot (Fig. 5 P 5 P P 5 5 Fig. 5 Significant association between risk score and immune microenvironment. ( a b p p p p p c d Expression of biomarkers and immune response correlation The expression of 26 immune checkpoint genes differed significantly between the HRG and LRG. In the HRG, most of these immune checkpoint genes were expressed at higher levels, such as CTLA4, LAG3, and PDCD1 (Fig. 6 6 Fig. 6 Expression of biomarkers and immune response correlation. (a) Differential expression analysis of immune checkpoint genes in high-risk and low-risk groups. The length of the box and whiskers can intuitively reflect the distribution and difference of different immune cells between the two groups. ( b–e p p p p p High mutation of TP53 In HRG and LRG, TP53 exhibited the highest mutation frequency, with missense mutations being the most common (Fig. 7 Fig. 7 Genetic mutation and drug sensitivity analysis. ( a b c P Revealing drug sensitivity The drug sensitivity analysis revealed 135 drugs differed in sensitivity between HRG and LRG ( P 50 7 Exploring the molecular regulatory mechanisms of biomarkers A total of 84 differentially expressed miRNAs, 915 differentially expressed lncRNAs, and 4035 differentially expressed circRNAs were identified (Fig. 8 8 8 Fig. 8 Exploring the molecular regulatory mechanisms of biomarkers. ( a b c Biomarker expression and survival analysis Expression analysis showed that CTSK was significantly downregulated in the BLCA group, while MTERF3, SRC, and CSNK2B were significantly upregulated (Supplementary Fig. S2a). KM curve analysis revealed that patients in the high expression group of CTSK had poor survival outcomes, whereas patients in the high expression groups of MTERF3, SRC, and CSNK2B had better survival outcomes (Supplementary Fig. S2b). Verification of expression of CTSK, MTERF3, SRC and CSNK2B Quantitative RT-PCR analysis revealed significantly elevated mRNA expression levels of MTERF3, SRC and CSNK2B in bladder tumor cells compared to normal bladder cells (Supplementary Fig. S3), which is consistent with our previous bioinformatics studies using public datasets; However, there was indeed no statistical difference in the expression of CTSK. Discussion BLCA is one of the most common tumors of the urinary tract, and the overall prognosis for patients with intermediate to advanced stages remains poor at present 9 10 11 12 13 14 Four biomarkers (CTSK, MTERF3, SRC and CSNK2B) were obtained in this study. CTSK (Cathepsin K) is a lysosomal cysteine protease that plays a degrading role in the extracellular matrix and is involved in osteoclast resorption and may be partially involved in impaired bone remodelling 15 16 15 16 14 17 18 19 20 21 22 23 15 MTERF3(Mitochondrial Transcription Termination Factor 3), the most conserved MTERF family member, negatively regulates mtDNA transcription. 24 25 26 27 27 SRC (Src Kinase), a tyrosine kinase, exerts its pro-carcinogenic function mainly by catalysing the tyrosine phosphorylation of various protein substrates 28 29 30 31 32 33 32 34 35 32 GSEA identified several key signaling pathways with significant enrichment in differentially expressed genes between HRG and LRG were ‘chemical carcinogenesis-DNA adducts’ and ‘cytokine- cytokine receptor interaction’. The chemical carcinogenesis-DNA adducts pathway refers to the covalent binding of carcinogenic chemicals to bases in the DNA molecule, resulting in the formation of chemical-DNA complexes. The formation of these DNA compounds is a key step in the chemical carcinogenesis process 36 37 38 39 40 41 42 43 The analysis on immune cell infiltration profiles between high- and low-risk patient subgroups showed that there were significant differences in the scores of 14 types of immune cell subsets, particularly CD8 + T lymphocytes and M2-polarized macrophages. Macrophages are highly heterogeneous and are classified into M1 and M2 types according to their activation status and function, which the high abundance of M2 macrophages indicates a poor prognosis for bladder cancer patients and a significant impact on the development of malignant tumors 44 Analysis on TP53 mutations in the high- and low-risk groups revealed that the mutation frequency of TP53 was the highest in both groups, and most of these mutations were missense mutations, while the high-risk group had more mutation sites. TP53 has been reported to be central to cancer-associated cellular functions, and high levels of mutation can render p53 proteins dysfunctional and oncogenic, driving tumor development 45 46 47 In conclusion, four biomarkers associated with MRGs were identified in this study by bioinformatics methods: CTSK, MTERF3, SRC and CSNK2B. A multivariable risk prediction model was established using the identified biomarkers and subsequently validated in independent cohorts. Biological processes significantly enriched in high-risk versus low-risk groups, associations with the immune microenvironment, drug sensitivity analysis, and regulatory network construction were analysed. These may provide new insights for the development of new strategies for BLCA treatment. Notwithstanding these findings, certain methodological limitations warrant consideration. Firstly, the sample size included was insufficient and there was some heterogeneity in different datasets, which may lead to some bias in our results. Secondly, we only validated the expression of the biomarkers at the cellular level and lacked clinical sample validation. In this qRT-PCR experiment, no statistically significant difference in CTSK expression levels was observed. We hypothesize that this result may be attributed to two factors: first, the relatively limited sample size of the experiment resulted in insufficient statistical validity to detect potential expression differences; second, the qRT-PCR technique itself has limitations in detection sensitivity and experimental variability, which may have affected the accurate capture of the real expression changes of CTSK. In our future research, we plan to carry out immunohistochemistry (IHC) and Western blot experiments using animal models for in-depth validation of CTSK; overexpression and knockdown experiments to clarify the specific roles of CTSK in bladder cancer (BLCA); and functional experiments, such as autophagy activity assay and autophagy assessment in cellular models to verify our hypotheses in order to enhance the reliability and validity of our research findings. In addition, we will continue to focus on BLCA and conduct a large number of experimental mechanism studies and clinical application researches in order to provide new strategies and targets for the diagnosis and treatment of BLCA. Materials and methods Data acquisition The bladder cancer (BLCA) dataset (TCGA-BLCA) was obtained from UCSC Xena ( https://xenabrowser.net/datapages/ GSE32894 GPL6947 48 Candidate genes acquisition DEGs between the BLCA and Control groups in the TCGA-BLCA dataset were identified using the DESeq2 package (v 1.42.0) 49 2 P 50 51 52 P P- Candidate genes were selected by intersecting the DEGs with MRGs using VennDiagram package (v 1.7.3) 53 54 Acquisition of biomarkers and construction of the risk model In the TCGA-BLCA samples with survival information, a univariate Cox regression analysis was conducted using the survival package (HR ≠ 1, P 55 56 P 57 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\sum\\limits_{i = 1}^{n} {Coef(gene_{i} )*Expr(gene_{i} )}$$\\end{document} N represented the number of genes included in the scoring system, β_i denoted the LASSO regression coefficient of the i-th gene, and x_i represented the expression level of the i-th gene. Next, based on the median risk score, the 406 BLCA samples in the TCGA-BLCA dataset were divided into HRG and LRG. The survival package (v 3.7.0) was employed for survival analysis of HRG and LRG, as well as for plotting KM curve (Log-rank test, P 58 GSE32894 Analysis of the association between risk score and clinical characteristics In the TCGA-BLCA samples with survival information, the association between risk scores and clinical characteristics (including Age, T classification, Gender, N classification, Grade, M classification, TNM stage, and Status) was analyzed using the Wilcoxon test or Kruskal–Wallis test ( P GSEA The TCGA-BLCA dataset were analyzed using the DESeq2 package (v 1.42.0) to identify differences between the groups. The log 2 2 P Immune microenvironment analysis To gain a comprehensive understanding of the immune microenvironment in BLCA, First, in the TCGA-BLCA samples with survival information, an immune infiltration analysis was meticulously conducted. The IOBR package (v 0.99.8) 59 P P 60 Immune therapy analysis In the TCGA-BLCA samples with survival information, the Wilcoxon test ( P P Somatic mutation analysis BLCA samples from the TCGA-BLCA dataset, which included somatic mutation data, were analyzed for mutation frequencies in HRG and LRG using the maftools package (v 2.18.0) 61 Drug sensitivity analysis To assess the drug sensitivity of HRG and LRG from the TCGA-BLCA dataset, half-maximal inhibitory concentration (IC 50 62 P P Regulation network analysis The DESeq2 package (v 1.42.0) was utilized to identify differentially expressed miRNAs, lncRNAs, and circRNAs between the BLCA and Control groups in the TCGA-BLCA dataset (The threshold was kept consistent with the differential analysis). The ENCORI and the miRWalk were used to predict miRNAs associated with the biomarkers. The VennDiagram package (v 1.7.3) was employed to integrate the results from the 2 databases and the differentially expressed miRNAs to obtain the key miRNAs. ENCORI and miRNet were used to predict lncRNAs associated with the key miRNAs. The VennDiagram package (v 1.7.3) was employed to integrate the results from the 2 databases and the differentially expressed lncRNAs to obtain the key lncRNAs. The ENCORI was used to predict circRNAs associated with the key miRNAs. The VennDiagram package (v 1.7.3) was employed to integrate the results from the database and the differentially expressed circRNAs to obtain the key circRNAs. Igraph package (v 2.0.3) 63 Expression levels and survival analysis The mRNA expression of biomarkers in the BLCA and Control groups was analyzed using the Wilcoxon test ( P 64 P Cell culture The normal human ureteral epithelial immortalised cell line SV-HUC-1 and the human bladder cancer cell line 5637 were used in this study, with F-12 K medium for the SV-HUC-1 cell line and 1640 medium for the 5637 cell line. Both culture media contained 1% penicillin solution and 10% fetal bovine serum as supplements. Both cell lines were purchased from Procell (Wuhan, China). qRT-PCR The isolation of RNA from SV-HUC-1 and 5637 cells was performed with Trizol reagent (Servicebio), and cDNA was synthesized following the manufacturer’s protocol provided by the Hifair® AdvanceFast One-step RT-gDNA Digestion SuperMix for qPCR(Yeasen, China). qRT-PCR carried out using LightCycler® 96 (Roche Applied Science) with an SYBR Green-based reagent (Yeasen,China). Primer sequences were designed as follows: CTSK,Forward: GGCTCAAGGTTCTGCTGCTAC, Reverse: TGTTATATTGCTTCCTGTGGGTCTTC; SRC, Forward: TCCAAGCCGCAGACTCAGG, Reverse: CATCCACACCTCGCCAAAGC; MTERF3, Forward: GCAGCCAATTTCAGAGGAAGAGG, Reverse: CAGAGTCTCAGAATGATCCACATAGTC; CSNK2B, Forward: GAGCCTGATGAAGAACTGGAAGAC, Reverse: CACGGTTGGTAAGGATGTAGCG. Statistical assessment The qRT-PCR results were analyzed and reported as mean ± standard error of the mean (SEM). Statistical comparisons between the two groups were performed using Student’s t-test with GraphPad Prism 10.1.2 (GraphPad Software, Inc.). Statistical significance was set at p p p p Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2  Supplementary Material 3  Supplementary Material 4  Supplementary Material 5 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Xianbin Huang and Yanqiu Meng have contributed equally to this work. Acknowledgements We would like to express our sincere gratitude to all individuals and organizations who supported and assisted us throughout this research. Special thanks to the following organization: Nanchang Key Laboratory of Tumor Gene Diagnosis and Innovative Treatment Research, Gaoxin Branch of the First Affiliated Hospital of Nanchang University, Nanchang, Jiangxi, China. In conclusion, we extend our thanks to everyone who has supported and assisted us along the way. Without your support, this research would not have been possible. Author contributions Xianbin Huang and Yanqiu Meng executed the formal analysis, drafted the initial manuscript; Jielong Song and Yizi Zhu conducted data curation; Jian Li and Yan Xi developed the methodology and software; Xiaodong Peng and Yaoyi Xiong engaged in writing, reviewing, and editing the article. All authors reviewed the manuscript. Funding The research reported in this project was generously supported by the National Natural Science Foundation of China under grant agreement number (82303182), and the Natural Science Foundation of Jiangxi Province (20232BAB216085). Data availability The datasets analysed during the current study are available in the [GEO] repository, [ https://www.ncbi.nlm.nih.gov/geo/ https://xenabrowser.net/datapages/ Declarations Competing interests The author(s) declare no competing interests. Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. References 1. Lobo, N. et al. European urology oncology 5 10.1016/j.euo.2022.10.003 36333236 2. Lopez-Beltran, A., Cookson, M. S., Guercio, B. J. & Cheng, L. Advances in diagnosis and treatment of bladder cancer. BMJ (Clinical research ed.) 384 10.1136/bmj-2023-076743 38346808 3. Compérat, E. et al. Lancet (London, England) 400 10.1016/S0140-6736(22)01188-6 36174585 4. Lu, Y. et al. Theranostics 13 10.7150/thno.79876 PMC9830443 36632220 5. Behera, B. P. et al. Cytokine & growth factor reviews 10.1016/j.cytogfr.2025.01.004 PMC12267565 39880721 6. Li, D. et al. International journal of biological sciences 21 10.7150/ijbs.107632 PMC11844284 39990673 7. Cui, A. et al. Toxicology and applied pharmacology 480 10.1016/j.taap.2023.116749 37939859 8. Deng, X. et al. International immunopharmacology 148 10.1016/j.intimp.2025.114119 39854875 9. Dobruch, J. & Oszczudłowski, M. Bladder Cancer: Current Challenges and Future Directions. Medicina (Kaunas, Lithuania) 57 10.3390/medicina57080749 PMC8402079 34440955 10. Wang, H., Luo, W., Chen, H., Cai, Z. & Xu, G. Mitochondrial dynamics and mitochondrial autophagy: Molecular structure, orchestrating mechanism and related disorders. Mitochondrion 75 10.1016/j.mito.2024.101847 38246334 11. Liu, Z. Y. & Huang, R. H. Integrating single-cell RNA-sequencing and bulk RNA-sequencing data to explore the role of mitophagy-related genes in prostate cancer. Heliyon 10 10.1016/j.heliyon.2024.e30766 PMC11107114 38774081 12. Ye, G., Sun, X., Li, J., Pu, M. & Zhang, J. Parkin modulates the hepatocellular carcinoma microenvironment by regulating PD-1/PD-L1 signalling. J Adv Res 10.1016/j.jare.2024.12.045 39755271 13. Song, C., Pan, S., Zhang, J., Li, N. & Geng, Q. Mitophagy: A novel perspective for insighting into cancer and cancer treatment. Cell Prolif 55 10.1111/cpr.13327 PMC9715364 36200262 14. Song, W. et al. J Gene Med 25 10.1002/jgm.3527 37382425 15. Qian, D. et al. Curr Oncol 29 10.3390/curroncol29080471 PMC9406569 36005209 16. Yuan, J. et al. J Orthop Translat 38 10.1016/j.jot.2022.11.003 PMC9708541 36474855 17. Chen, Y. et al. International journal of biological macromolecules 287 10.1016/j.ijbiomac.2024.138645 39667460 18. Lin, G. et al. Oncogene 43 10.1038/s41388-024-03169-z 39424989 19. Bai, Z., Yan, C. & Chang, D. Prediction and therapeutic targeting of the tumor microenvironment-associated gene CTSK in gastric cancer. Discover oncology 14 10.1007/s12672-023-00821-0 PMC10628060 37930479 20. Li, H. et al. Medicine (Baltimore) 102 10.1097/MD.0000000000036414 PMC10695499 38050320 21. Zhao, Y. G. et al. Tumori 100 10.1700/1778.19294 25688510 22. Li, R. et al. Cell Death Differ 26 10.1038/s41418-019-0312-y PMC6889446 30850734 23. Makondi, P. T., Wei, P. L., Huang, C. Y. & Chang, Y. J. Development of novel predictive miRNA/target gene pathways for colorectal cancer distance metastasis to the liver using a bioinformatic approach. PLoS One 14 10.1371/journal.pone.0211968 PMC6391078 30807603 24. Park, C. B. et al. Cell 130 10.1016/j.cell.2007.05.046 17662942 25. Hyvärinen, A. K. et al. Nucleic Acids Res 35 10.1093/nar/gkm676 PMC2095818 17884915 26. Wang, J. et al. Biomolecules 14 10.3390/biom14020228 PMC10886790 38397465 27. Sun, M. T. et al. Genetic testing and molecular biomarkers 27 10.1089/gtmb.2023.0108 38156906 28. Luo, J. et al. Breast cancer research : BCR 24 10.1186/s13058-022-01596-y PMC9798727 36581908 29. Sun, J. et al. Frontiers in oncology 11 10.3389/fonc.2021.730716 PMC8455063 34557413 30. Yu, H., Liu, Q., Jin, M., Huang, G. & Cai, Q. Comprehensive analysis of mitophagy-related genes in NSCLC diagnosis and immune scenery: based on bulk and single-cell RNA sequencing data. Front Immunol 14 10.3389/fimmu.2023.1276074 PMC10752969 38155968 31. Huang, C. C., Liu, H. Y., Hsu, T. W. & Lee, W. C. Updates on the Pivotal Roles of Mitochondria in Urothelial Carcinoma. Biomedicines 10 10.3390/biomedicines10102453 PMC9599371 36289714 32. Yu, S., Hu, Q., Fan, K., Yang, C. & Gao, Y. CSNK2B contributes to colorectal cancer cell proliferation by activating the mTOR signaling. J Cell Commun Signal 15 10.1007/s12079-021-00619-1 PMC8222461 33928514 33. Xiao, Y. et al. EBioMedicine 51 10.1016/j.ebiom.2019.102603 PMC6950786 31901862 34. Sun, Y. et al. Human cell 38 10.1007/s13577-024-01164-w 39718697 35. Cheng, Y. et al. Front Genet 13 10.3389/fgene.2022.1050341 PMC9760814 36544483 36. Luu Truong Thanh, H., Hoang, T. M. & Hoang Van, H. Identification of Hub Genes and Potential Pathogenesis in Gastric Cancer Based on Integrated Gene Expression Profile Analysis. Asian Pacific journal of cancer prevention : APJCP 25 10.31557/APJCP.2024.25.3.885 PMC11152393 38546071 37. Wang, Y., Wang, J., Zeng, T. & Qi, J. Data-mining-based biomarker evaluation and experimental validation of SHTN1 for bladder cancer. Cancer genetics 288–289 10.1016/j.cancergen.2024.09.002 39260052 38. Pang, L. et al. BMC medical genomics 16 10.1186/s12920-023-01487-x PMC10031908 36949429 39. Nguyen, H. D. Prognostic biomarker prediction for glioma induced by heavy metals and their mixtures: An in-silico study. Toxicology and applied pharmacology 459 10.1016/j.taap.2022.116356 36563751 40. Feng, W. D. et al. Acta Pharmacol Sin 44 10.1038/s41401-022-01028-9 PMC10203299 36522512 41. Patoli, D. et al. J Clin Invest 130 10.1172/JCI130996 PMC7598049 32759503 42. Yang, E. et al. Cell Death Dis 15 10.1038/s41419-024-07068-9 PMC11415494 39304650 43. Lv, Y. et al. Adv Sci (Weinh) 12 10.1002/advs.202409425 PMC11791963 39651805 44. Muhuitijiang, B. et al. Cancer science 115 10.1111/cas.16113 PMC11093213 38422408 45. Voskarides, K. & Giannopoulou, N. The Role of TP53 in Adaptation and Evolution. Cells 12 10.3390/cells12030512 PMC9914165 36766853 46. Ciccarese, C. et al. Expert opinion on therapeutic targets 21 10.1080/14728222.2017.1297798 28281901 47. Li, K. et al. Data in brief 53 10.1016/j.dib.2024.110183 PMC10885721 38406249 48. Pei, Y., Chen, S., Zhou, F., Xie, T. & Cao, H. Construction and evaluation of Alzheimer’s disease diagnostic prediction model based on genes involved in mitophagy. Frontiers in aging neuroscience 15 10.3389/fnagi.2023.1146660 PMC10077494 37032823 49. Ritchie, M. E. et al. Nucleic Acids Res 43 10.1093/nar/gkv007 PMC4402510 25605792 50. Cheng, Q., Chen, X., Wu, H. & Du, Y. Three hematologic/immune system-specific expressed genes are considered as the potential biomarkers for the diagnosis of early rheumatoid arthritis through bioinformatics analysis. Journal of translational medicine 19 10.1186/s12967-020-02689-y PMC7789535 33407587 51. Zhang, X. et al. Front Immunol 14 10.3389/fimmu.2023.1030198 PMC10091903 37063851 52. Chen, H. & Boutros, P. C. VennDiagram: A package for the generation of highly-customizable Venn and Euler diagrams in R. BMC Bioinformatics 12 10.1186/1471-2105-12-35 PMC3041657 21269502 53. Yang, Z. et al. Journal of inflammation research 17 10.2147/JIR.S448372 PMC10927374 38476473 54. Shannon, P. et al. Genome Res 13 10.1101/gr.1239303 PMC403769 14597658 55. Wang, Y. et al. Front Immunol 14 10.3389/fimmu.2023.1268090 PMC10704160 38077322 56. Liao, X., Wang, W., Yu, B. & Tan, S. Thrombospondin-2 acts as a bridge between tumor extracellular matrix and immune infiltration in pancreatic and stomach adenocarcinomas: an integrative pan-cancer analysis. Cancer cell international 22 10.1186/s12935-022-02622-x PMC9195477 35701829 57. Shi, H., Yuan, X., Liu, G. & Fan, W. Identifying and Validating GSTM5 as an Immunogenic Gene in Diabetic Foot Ulcer Using Bioinformatics and Machine Learning. Journal of inflammation research 16 10.2147/JIR.S442388 PMC10748866 38145013 58. Ding, M. et al. Aging 15 10.18632/aging.205354 PMC10781490 38180104 59. Chen, J., Liu, Z., Wu, Z., Li, W. & Tan, X. Identification of a chemoresistance-related prognostic gene signature by comprehensive analysis and experimental validation in pancreatic cancer. Frontiers in oncology 13 10.3389/fonc.2023.1132424 PMC10213255 37251940 60. Cao, Z. J. & Gao, G. Multi-omics single-cell data integration and regulatory inference with graph-linked embedding. Nature biotechnology 40 10.1038/s41587-022-01284-4 PMC9546775 35501393 61. Xu, Q., Chen, S., Hu, Y. & Huang, W. Landscape of Immune Microenvironment Under Immune Cell Infiltration Pattern in Breast Cancer. Front Immunol 12 10.3389/fimmu.2021.711433 PMC8429934 34512634 62. Maeser, D., Gruener, R. F. & Huang, R. S. oncoPredict: An R package for predicting in vivo or cancer patient drug response and biomarkers from cell line screening data. Briefings in bioinformatics 22 10.1093/bib/bbab260 PMC8574972 34260682 63. Pitts, A. J. & Fowler, C. R. Comparison of open-source software for producing directed acyclic graphs. Journal of causal inference 12 10.1515/jci-2023-0031 PMC10869111 38361970 64. Shi, Y. et al. Apoptosis : an international journal on programmed cell death 28 10.1007/s10495-023-01868-8 PMC10425492 37369808 ",
  "metadata": {
    "Title of this paper": "Identification of biomarkers associated with mitophagy in bladder cancer",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475427/"
  }
}