{
  "title": "Paper_978",
  "abstract": "pmc J Med Case Rep J Med Case Rep 476 jmedcasrep Journal of Medical Case Reports 1752-1947 BMC PMC12482526 PMC12482526.1 12482526 12482526 41024274 10.1186/s13256-025-05540-4 5540 1 Case Report Full-thickness tracheal laceration managed conservatively: a case report http://orcid.org/0000-0003-3509-3940 Arora Nikita 1 Rancourt Maude 2 Nagappa Mahesh 3 Qiabi Mehdi Mehdi.Qiabi@lhsc.on.ca 2 1 https://ror.org/03c4mmv16 grid.28046.38 0000 0001 2182 2255 Division of Thoracic Surgery, Department of Surgery, University of Ottawa, 2 https://ror.org/02grkyz14 grid.39381.30 0000 0004 1936 8884 Division of Thoracic Surgery, Department of Surgery, Western University, 3 https://ror.org/02grkyz14 grid.39381.30 0000 0004 1936 8884 Department of Anesthesia and Perioperative Medicine, Western University, 29 9 2025 2025 19 478511 459 24 8 2024 22 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Tracheobronchial injuries, which are rare complications of intubation, can be overlooked without a high degree of clinical suspicion. While traditionally managed surgically, recent literature proposes nonoperative management for low-risk injuries. Case presentation. This case illustrates a 56-year old Caucasian Canadian female with a grade IIIA injury successfully treated conservatively using an endotracheal tube and medical therapy. Consequently, it suggests that nonoperative management may be suitable for patients meeting specific criteria indicative of clinical stability. Conclusion These insights challenge the conventional surgical approach and emphasize the potential efficacy of conservative measures in selected cases of tracheobronchial injury. Keywords Thoracic surgery Airway management Trauma Case report pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Tracheobronchial injuries, which are rare complications of endotracheal intubation (incidence: 0.005% with single-lumen intubation), have traditionally been treated surgically [ 1 2 et al 1 3 4 7 Implication statement This case study challenges established guidelines by demonstrating the successful conservative management of a high-grade, iatrogenic, full-thickness tracheal laceration. The decision to forego surgery was based on the patient’s clinical stability and the anatomic location of the injury. This work ultimately provides valuable insights that challenge the traditional surgical approach for such injuries. Case A 56-year old Caucasian Canadian female with oligometastatic pancreatic cancer, who had completed 17 cycles of induction chemotherapy 3 weeks prior, underwent an elective laparoscopic distal pancreatectomy, splenectomy, cholecystectomy, and radiofrequency ablation of four liver lesions. Her comorbidities included non-insulin-dependent type 2 diabetes mellitus and hypertension. Her body mass index was 25 kg/m 2 On preoperative evaluation by the anesthesiology team, she had normal neck range of motion, a normal thyromental distance, good temporomandibular joint mobility, a midline trachea, and adequate mouth opening. Her Mallampati score was III, and her American Society of Anesthesiologists score was III. Intubation was completed with a single-lumen endotracheal tube. No difficulties were encountered during intubation, and she was extubated with ease at the end of the procedure. Subsequently, 1 hour after extubation, a routine postoperative chest x-ray was performed and identified a right pneumothorax with subcutaneous emphysema. The patient was clinically stable on 2 L/minute supplemental oxygen via nasal prongs, and the pneumothorax was thought to be secondary to central line insertion. It was first managed conservatively, but a thoracostomy tube was required after the patient began to experience progressive respiratory distress. Over the following 8 hours, oxygen requirements increased, 600 mL of frank blood drained from the chest tube, and the patient developed significant hemoptysis. As she was still protecting her airway, additional imaging was ordered. A computed tomography (CT) scan of the thorax demonstrated a high-density focus in the posterior aspect of the trachea at the level of the thyroid, suggestive of arterial bleed. There was debris throughout the trachea and the bronchial tree. These findings were suggestive of a tracheal laceration. There was no pneumomediastinum, no signs of mediastinitis, and the subcutaneous emphysema was radiologically stable. The patient was brought to the operating room and underwent an awake intubation, flexible bronchoscopy, and esophagogastroduodenoscopy (EGD). A full-thickness laceration of the membranous portion of the trachea, measuring 5 cm in length, from the level of the third tracheal ring to 6 cm above the carina, was identified (Fig. 1 Fig. 1 Initial bronchoscopic appearance of tracheal laceration Given the above reassuring clinical signs, and owing to the location of the laceration at the level of thoracic inlet (preventing good surgical exposure from both thoracic and cervical approaches), the decision was made to treat this patient conservatively. The lesion was bridged by inflating the 7.5 mm endotracheal tube cuff distally, the ventilator was set to a minimal positive end-expiratory pressure (PEEP), and broad-spectrum antibiotics were administered. The patient was taken to the critical care unit for close monitoring. She was kept intubated, sedated, and paralyzed. The patient was surveyed closely in the critical care unit and was hemodynamically stable throughout her stay. A bronchoscopy was repeated on postoperative day (POD) 5, as demonstrated in Fig. 2 Fig. 2 Bronchoscopic appearance of tracheal laceration in intensive care unit The patient was extubated on POD 12. She received 7 days of intravenous piperacillin tazobactam 3.375 g and 15 days of intravenous fluconazole 400 mg. Her total length of stay was 23 days. On surveillance bronchoscopy performed more than 6 months after the initial injury, the laceration was completely healed, as shown in Fig. 3 Fig. 3 Bronchoscopic appearance of tracheal laceration as outpatient Discussion Tracheobronchial injury secondary to traumatic intubation is rare, and as such, there is controversy regarding patient selection for conservative management. This case contributes a clinical experience to the literature regarding this rare entity. Most guidelines, as well as reports, describe conservative management for small and superficial tracheal lacerations [ 3 et al 8 et al 2 However, Herrmann et al 2 Conclusion Tracheobronchial injuries, though rare, demand heightened clinical suspicion for accurate diagnosis. While type IIIA and IIIB injuries typically pose higher risks, this case suggests a potential role for conservative management in clinically stable patients with type IIIA injuries who meet specific criteria. This challenges traditional notions and underscores the importance of individualized approaches in the management of tracheobronchial injuries. This case also emphasizes the importance of managing such injuries in a multidisciplinary manner, with the inputs of the surgical, anesthesiology, and critical care teams. Abbreviations CT Computed tomography PEEP Positive end-expiratory pressure EGD Esophagogastroduodenoscopy POD Postoperative day TEF Tracheo-esophageal fistula Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements None. Author contributions Arora: This author helped draft this case study and was involved in the conception/acquisition of this work. Rancourt: This author helped critically revise this case study and was involved in the conception/acquisition of this work. Nagappa: This author helped critically revise this case study. Qiabi: This author helped critically revise this case study and was involved in the conception/acquisition of this work. Funding There was no funding or conflicts of interest for this work. Availability of data and materials Not applicable. Declarations Ethical approval and consent to participate Research ethics board (REB) approval was not required. Consent to participate was obtained. Consent for publication Written informed consent was obtained from the patient for publication of this case report and any accompanying images. A copy of the written consent is available for review by the Editor-in-Chief of this journal. Competing interests None. References 1. Cardillo G Carbone L Carleo F Tracheal lacerations after endotracheal intubation: a proposed morphological classification to guide non-surgical treatment Eur J Cardiothorac Surg 2010 37 3 581 587 10.1016/j.ejcts.2009.07.034 19748275 Cardillo G, Carbone L, Carleo F, et al 19748275 10.1016/j.ejcts.2009.07.034 2. Herrmann D Volmerig J Al-Turki A Does less surgical trauma result in better outcome in management of iatrogenic tracheobronchial laceration? J Thorac Dis 2019 11 11 4772 10.21037/jtd.2019.10.22 31903267 PMC6940254 Herrmann D, Volmerig J, Al-Turki A, et al 31903267 10.21037/jtd.2019.10.22 PMC6940254 3. Geltner C Likar R Hausegger K Rauter M Management of postintubational tracheal injury by endoscopic stent placement: case report and review of the literature The Thoracic and Cardiovascular Surgeon Reports 2016 5 01 8 12 10.1055/s-0035-1570376 28018811 PMC5177452 Geltner C, Likar R, Hausegger K, Rauter M. Management of postintubational tracheal injury by endoscopic stent placement: case report and review of the literature. The Thoracic and Cardiovascular Surgeon Reports. 2016;5(01):8–12. 28018811 10.1055/s-0035-1570376 PMC5177452 4. Grewal HS Dangayach NS Ahmad U Ghosh S Gildea T Mehta AC Treatment of tracheobronchial injuries: a contemporary review Chest 2019 155 3 595 604 10.1016/j.chest.2018.07.018 30059680 PMC6435900 Grewal HS, Dangayach NS, Ahmad U, Ghosh S, Gildea T, Mehta AC. Treatment of tracheobronchial injuries: a contemporary review. Chest. 2019;155(3):595–604. 30059680 10.1016/j.chest.2018.07.018 PMC6435900 5. Welter S Essaleh W Management of tracheobronchial injuries J Thorac Dis 2020 12 10 6143 10.21037/jtd-2019-as-05 33209452 PMC7656380 Welter S, Essaleh W. Management of tracheobronchial injuries. J Thorac Dis. 2020;12(10):6143. 33209452 10.21037/jtd-2019-as-05 PMC7656380 6. Mantovani S Poggi C Bassi M Cagnetti S Anile M Venuta F Surgical or conservative management of post intubation tracheal injury: when and how J Vis Surg 2020 6 4 10.21037/jovs.2019.09.07 Mantovani S, Poggi C, Bassi M, Cagnetti S, Anile M, Venuta F. Surgical or conservative management of post intubation tracheal injury: when and how. J Vis Surg. 2020;6:4. 7. Romic M Becejac T Grbavac D Romic R Romic I Conservative treatment of postintubation tracheal laceration with pneumomediastinum, bilateral pneumothorax, and massive subcutaneous emphysema Lung India 2021 38 1 77 10.4103/lungindia.lungindia_322_20 33402642 PMC8066937 Romic M, Becejac T, Grbavac D, Romic R, Romic I. Conservative treatment of postintubation tracheal laceration with pneumomediastinum, bilateral pneumothorax, and massive subcutaneous emphysema. Lung India. 2021;38(1):77. 33402642 10.4103/lungindia.lungindia_322_20 PMC8066937 8. Sanchez-Perez J, Rivera-Rivera G, Gonzalez M, Lajud S, Corona-Ruiz M, Riera-March A. Conservative management of large traumatic tracheal laceration. Authorea Preprints ",
  "metadata": {
    "Title of this paper": "Conservative treatment of postintubation tracheal laceration with pneumomediastinum, bilateral pneumothorax, and massive subcutaneous emphysema",
    "Journal it was published in:": "Journal of Medical Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482526/"
  }
}