{
  "title": "Paper_1239",
  "abstract": "pmc Life (Basel) Life (Basel) 2582 life life Life 2075-1729 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471688 PMC12471688.1 12471688 12471688 41010324 10.3390/life15091382 life-15-01382 1 Systematic Review Vaginal Microbiome and Its Relationship with Assisted Reproduction: A Systematic Review and Meta-Analysis https://orcid.org/0000-0002-3732-1057 Samama Marise 1 2 Ueno Joji 2 3 https://orcid.org/0000-0002-0167-861X Carvalho de Arruda Veiga Eduardo 2 3 Piscopo Rita C. C. P. 2 https://orcid.org/0009-0003-9644-7797 Ikeda Fabio 2 Pires de Lemos Nina 2 https://orcid.org/0000-0002-6909-8347 Tadeu Bidinotto Lucas 4 5 https://orcid.org/0000-0002-4663-7926 Guimarães da Silva Márcia 6 https://orcid.org/0000-0001-9179-3023 Jarmy Di Bella Zsuzsanna 1 https://orcid.org/0000-0001-7891-1048 Entezami Frida 7 8 * Kolar Milan Academic Editor Rampelotto Pabulo Academic Editor 1 marisesamama@yahoo.com.br zsuvi@uol.com.br 2 jojiueno@uol.com.br eduardo.veiga@fm.usp.br draritapiscopo@gmail.com famikeda@uol.com.br ninalemos29@gmail.com 3 4 lucasbidinotto@gmail.com 5 6 marcia.guimaraes@unesp.br 7 8 * frida.entezami@ahparis.org 01 9 2025 9 2025 15 9 497651 1382 27 3 2025 19 8 2025 23 8 2025 01 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background Objective Methods Results p p p Lactobacillus crispatus Conclusions Lactobacillus crispatus vaginal microbiome clinical pregnancy rate live birth rate pregnancy loss systematic review This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Infertility treatment results in thousands of in vitro fertilization (IVF) cycles annually. A global analysis showed an average delivery rate from assisted reproductive technology (ART) treatments of 19% per aspiration [ 1 2 The study of the composition of the vaginal microbiome and its molecular characterization has been increasingly refined over the past 15 years. The vaginal microbiome has been associated with sexually transmitted infections (STIs), cervical dysplasia, and, more recently, fertility and pregnancy outcomes like miscarriage and preterm birth. A disrupted vaginal microbiome appears to be one of the causes of ART failure. The vagina is predominantly inhabited by Lactobacillus 3 Lactobacillus L. crispatus L. gasseri L. iners L. jensenii Lactobacillus Lactobacillus 4 Lactobacillus 4 5 6 Streptococcus Staphylococcus Gardnerella Neisseria Klebsiella 7 8 Lactobacillus 9 In the context of reproductive health, the vaginal microbiome may be characterized as healthy or unhealthy, based on its taxonomic composition, relative abundance, environment, and how it affects assisted reproduction and pregnancy [ 10 11 A healthy vaginal microbiota maintains eubiosis and an acidic environment with a pH ranging between 3.5 and 4.5 [ 11 12 Lactobacillus Lactobacillus Gardnerella vaginalis Fannyhessea vaginae Prevotella Sneathia 12 13 Lactobacillus 14 15 Furthermore, the estrogen-dominant vaginal epithelium is essential for the survival and growth of Lactobacillus 16 Lactobacillus 17 Atopobium Aerococcus Bifidobacterium Lactobacillus 18 Lactobacilli Prevotella Escherichia coli–Shigella Lactobacilli Prevotella Atopobium 19 Lactobacilli Lactobacilli During pregnancy, there is a decline in the metabolic capacity of the vaginal resident microbiome, which is consistent with a change to a less complex Lactobacillus 20 Lactobacillus iners Lactobacillus crispatus Lactobacillus 20 Lactobacillus 21 A successful pregnancy depends on the crucial embryo–maternal interaction and the reasons for most cases of unsuccessful ART remain unexplained. As the vaginal microbiome seems to play an important role in human reproduction, the objective of this study was to observe the relationship between ART and the vaginal microbiome in real life, by developing a systematic review and meta-analysis. For the purposes of this systematic review, the authors classified the favorable microbiome according to the taxonomic classification cited above as CST I, II, III, and V and CST IV as the unfavorable microbiome. 2. Materials and Methods The PRISMA guidelines were followed in this review, and the search strategy followed the article by Page et al. [ 22 n n n n n Two different researchers independently conducted the search strategy (MS and ECAV) using the POS framework: P for patients, O for outcomes, and S for study design (POS). Women were classified as either having a favorable or unfavorable microbiome according to the CST classification, and the outcomes considered were clinical pregnancy rates (CPRs) and live birth rates (LBRs). S was the type of study, and none of the 8 selected studies were cohort development, cohort prospective, non-randomized clinical trial, or observational studies ( Figure 1 22 23 Determination of the species associated with a favorable outcome: In order to determine which species were associated with a successful pregnancy, we intended to download sequencing raw data from the eight studies and re-analyze them, using “successful pregnancy” as an endpoint and applying a regression analysis to determine those taxa which were statistically associated with this endpoint. However, of the eight studies, only Väinämö et al. (2023) [ 24 https://www.ncbi.nlm.nih.gov/sra/PRJEB61794 This, to avoid any methodological biases, we obtained sequencing data only from the MiSeq42 library, from material obtained only at the time of fresh IVF-ET ( n 25 26 3. Results  Study Selection and Participant Characteristics After analyzing the full text of the 19 selected articles, 11 articles did not fit the objectives of our study, therefore, 8 articles were selected to enter the systematic review and meta-analysis ( Figure 1 24 25 26 27 28 29 30 31 32 33 Table 1  Vaginal Microbiome Composition and Reproductive Outcomes The relationship between Lactobacillus 27 Lactobacillus 28 29 Lactobacillus 30 24 L. crispatus 31 L. crispatus 32 L. iners L. gasseri L. crispatus 33 Lactobacillus  Causes of Infertility in the Included Studies The causes of infertility varied across studies ( Table 1 24 32 31  Meta-analysis of Live Birth and Pregnancy Outcomes The main outcome of the result of the meta-analysis when evaluating live birth rates was that women who were in the most favorable microbiome group had higher and statistically significant chances of a successful pregnancy ( p Figure 2 Focusing on clinical pregnancy rate results, women in the more favorable vaginal microbiome group also experienced higher pregnancy rates ( p Figure 3 When pregnancy losses were analyzed, statistics showed that women with an unfavorable microbiome had more miscarriages than women with a favorable microbiome ( p Figure 4  Risk of Bias Assessment Risk of bias was assessed for the eight studies included in this review using the Cochrane tool for non-randomized clinical trials. Seven domains were evaluated. For random sequence generation allocation concealment blinding of participants and personnel blinding of outcome assessment incomplete outcome data selective reporting other sources of bias When all seven domains across the eight studies were considered together, 46.4% of judgments indicated a low risk of bias, while 50% were rated as unclear. For allocation concealment  Additional Analysis of Väinämö et al. (2023) A detailed reanalysis of Väinämö et al. (2023) [ 24 Lactobacillus crispatus p Table 2 4. Discussion The main findings of the study indicate that women with a favorable microbiome had higher pregnancy and live birth rates, although the included studies were subject to a high risk of bias. Celicanin et al. [ 34 Similar trends were observed in the meta-analysis and systematic review by Skafte-Holm et al. [ 35 36 37 36 Lactobacillus Some studies have shown that the vaginal microbiome associated with eubiosis and the dominance of Lactobacillus 4 38 39 40 41 Lactobacillus 16 42 Results on the relative abundance of Lactobacillus Lactobacillus L. crispatus 43 L. crispatus 44 Lactobacillus Lactobacillus L. crispatus Lactobacillus 44 45 Lactobacillus crispatus Lactobacillus Gardnerella Prevotella Some recent studies have shown that the presence of bacteria favorable to the female microbiota were associated with a significant reduction in preterm births and unfavorable bacteria with increased preterm birth. Moreover, recent reviews on the subject of the vaginal microbiome indicate that women with a healthy microbiome, with many Lactobacillus 27 28 29 30 31 32 33 34 35 36 Recent studies [ 10 Lactobacillus Reviews emphasize the need for further studies on the vaginal and endometrial microbiome and fertility, especially in respect of categorizing which bacteria are dominant and which exert a positive influence on reproductive outcomes and which a negative influence [ 46 47 The vaginal microbiota accounts for 9% of the total human microbiota and plays a central role in maintaining vaginal homeostasis in women (Golob et al., 2024) [ 48 A lack of Lactobacillus Future research on vaginal dysbiosis should consider infertility alongside demographic factors such as ethnicity, obesity, lifestyle, and population location, as all influence the vaginal microbiome [ 49 Male genital infections and in general the semen microbiome may also have an impact on the vaginal microbiome. The male and female microbiomes have interactions due to intercourse and, as shown by Mandar et al. [ 50 In an older study by Borovkova et al. [ 51 Ureaplasma Non-invasive diagnostic methods and innovative treatments are under development. The Nugent score remains widely used for bacterial vaginosis diagnosis, but it is subject to examiner variability, emphasizing the need for molecular techniques. Therapeutic approaches under investigation include antibiotics, Lactobacillus L. crispatus 5. Strengths and Limitations One of the main strengths of this review is the number of studies evaluated in the meta-analyses, with a total of more than 900 women participating. The results in relation to reproduction were significant, with clinical pregnancy rates and live birth rates being higher in women with a favorable microbiome. Another strength is that the review only analyzed studies of the vaginal microbiome which used molecular methods. However, the study also has some limitations that should be mentioned. First, the quality of the studies identified was not high or had a high risk of bias. Second, not all the studies contained data on live birth rates, which limited our analysis. Third, in respect of our analysis of which species were associated with a successful pregnancy, raw data was only available in one study. Finally, A key limitation of our study is the heterogeneity of the included populations and methodologies, including differences in study design, diagnostic methods, degrees of vaginal dysbiosis, and racial/ethnic composition, which may affect the comparability of results 6. Conclusions Women with more favorable microbiomes showed better reproductive outcomes with a higher clinical pregnancy rate, a higher live birth rate, and a lower rate of pregnancy loss although there was a low-quality bias. The high relative abundance, especially of Lactobacillus crispatus Acknowledgments All authors present in the manuscript contributed to intellectual guidance. The authors who contributed to data collection and analysis are described in the Materials and Methods and were the authors M.S. and E.C.d.A.V. Disclaimer/Publisher’s Note: Author Contributions The authors M.S., E.C.d.A.V., Z.J.D.B., and F.E. have made substantial contributions to the conception or design of the work and made other contributions such as conceptualization; methodology; validation; formal analysis; investigation; data curation; writing—original draft preparation; writing—review and editing; visualization; supervision; project administration and approved the submitted version; agree to be personally accountable for the authors’ contributions and for answering questions related to the accuracy or integrity of any part of the work. The authors J.U., R.C.C.P.P., F.I., N.P.d.L., L.T.B., and M.G.d.S. have made substantial contributions to article revision; have approved the submitted version; agreed to be personally accountable for the authors’ contributions and for answering questions related to the accuracy or integrity of any part of the work; other contributions were validation; writing—original draft preparation; writing—review and editing; visualization. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: IVF In vitro fertilization ART Assisted reproductive technology NGS Next-generation sequencing STI Sexually transmitted infection CTS Community state type References 1. Smeenk J. Wyns C. De Geyter C. Kupka M. Bergh C. Saiz I.C. De Neubourg D. Rezabek K. Tandler-Schneider A. Rugescu I. ART in Europe, 2019: Results Generated from European Registries by ESHRE Hum. Reprod. 2023 38 2321 2338 10.1093/humrep/dead197 37847771 PMC10694409 2. Piscopo R.C.C.P. Guimarães R.V. Ueno J. Ikeda F. Di Bella Z.I.K.J. Girão M.J.B.C. Samama M. Increased Prevalence of Endocervical Mycoplasma and Ureaplasma Colonization in Infertile Women with Tubal Factor J. Bras. Reprod. Assist. 2020 24 152 157 10.5935/1518-0557.20190078 32031768 PMC7169909 3. Ravel J. Gajer P. Abdo Z. Schneider G.M. Koenig S.S.K. McCulle S.L. Karlebach S. Gorle R. Russell J. Tacket C.O. Vaginal Microbiome of Reproductive-Age Women Proc. Natl. Acad. Sci. USA 2011 108 4680 4687 10.1073/pnas.1002611107 20534435 PMC3063603 4. Marconi C. El-Zein M. Ravel J. Ma B. Lima M.D. Carvalho N.S. Alves R.R.F. Parada C.M.G.L. Leite S.H.M. Giraldo P.C. Characterization of the Vaginal Micron Women of Reproductive Age from 5 Regions in Brazil Sex Transm. Dis. 2020 47 562 569 10.1097/OLQ.0000000000001204 32520883 5. Borgdorff H. Gautam R. Armstrong S.D. Xia D. Ndayisaba G.F. Van Teijlingen N.H. Geijtenbeek T.B.H. Wastling J.M. Van De Wijgert J.H.H.M. Cervicovaginal Microbiome Dysbiosis Is Associated with Proteome Changes Related to Alterations of the Cervicovaginal Mucosal Barrier Mucosal. Immunol. 2016 9 621 633 10.1038/mi.2015.86 26349657 6. Cicinelli E. Matteo M. Tinelli R. Lepera A. Alfonso R. Indraccolo U. Marrocchella S. Greco P. Resta L. Prevalence of Chronic Endometritis in Repeated Unexplained Implantation Failure and the IVF Success Rate after Antibiotic Therapy Hum. Reprod. 2015 30 323 330 10.1093/humrep/deu292 25385744 7. Zou Y. Liu X. Chen P. Wang Y. Li W. Huang R. The Endometrial Microbiota Profile Influenced Pregnancy Outcomes in Patients with Repeated Implantation Failure: A Retrospective Study J. Reprod. Immunol. 2023 155 103782 10.1016/j.jri.2022.103782 36502684 8. Qing X. Xie M. Liu P. Feng O. Leng H. Guo H. Zhang Y. Ma Y. Zheng W. Correlation between Dysbiosis of Vaginal Microecology and Endometriosis: A Systematic Review and Meta-Analysis PLoS ONE 2024 19 e0306780 10.1371/journal.pone.0306780 38976704 PMC11230536 9. Lee S. Aasmets O. Arffman R.K. Laru J. Rossi H.R. Salumets A.A. Piltonen T.T. Org E. The Reproductive Tract Microbiome in Women with Polycystic Ovary Syndrome and across Different Menstrual Cycle Phases Hum. Reprod. 2025 40 518 528 10.1093/humrep/deae270 39792897 10. Gao X. Louwers Y.V. Laven J.S.E. Schoenmakers S. Clinical Relevance of Vaginal and Endometrial Microbiome Investigation in Women with Repeated Implantation Failure and Recurrent Pregnancy Loss Int. J. Mol. Sci. 2024 25 622 10.3390/ijms25010622 38203793 PMC10779912 11. Riganelli L. Iebba V. Piccioni M. Illuminati I. Bonfiglio G. Neroni B. Calvo L. Gagliardi A. Levrero M. Merlino L. Structural Variations of Vaginal and Endometrial Microbiota: Hints on Female Infertility Front. Cell. Infect. Microbiol. 2020 10 350 10.3389/fcimb.2020.00350 32760681 PMC7372811 12. Su W. Gong C. Zhong H. Yang H. Chen Y. Wu X. Jin J. Xi H. Zhao J. Vaginal and Endometrial Microbiome Dysbiosis Associated with Adverse Embryo Transfer Outcomes Reprod. Biol. Endocrinol. 2024 22 111 10.1186/s12958-024-01274-y 39198832 PMC11351450 13. Foteinidou P. Exindari M. Chatzidimitriou D. Gioula G. Endometrial Microbiome and Its Correlation to Female Infertility: A Systematic Review and Meta-Analysis Acta Microbiol. Hell. 2024 69 14 28 10.3390/amh69010004 14. Punzón-Jiménez P. Labarta E. The Impact of the Female Genital Tract Microbiome in Women Health and Reproduction: A Review J. Assist. Reprod. Genet. 2021 38 2519 2541 10.1007/s10815-021-02247-5 34110573 PMC8581090 15. Tsonis O. Gkrozou F. Paschopoulos M. Microbiome Affecting Reproductive Outcome in ARTs J. Gynecol. Obstet. Hum. Reprod. 2021 50 102036 10.1016/j.jogoh.2020.102036 33307241 16. Sobstyl A. Chałupnik A. Mertowska P. Grywalska E. How Do Microorganisms Influence the Development of Endometriosis? Participation of Genital, Intestinal and Oral Microbiota in Metabolic Regulation and Immunopathogenesis of Endometriosis Int. J. Mol. Sci. 2023 24 10920 10.3390/ijms241310920 37446108 PMC10341671 17. Zhao C. Wei Z. Yang J. Zhang J. Yu C. Yang A. Zhang M. Zhang L. Wang Y. Mu X. Characterization of the Vaginal Microbiome in Women with Infertility and Its Potential Correlation with Hormone Stimulation during In Vitro Fertilization Surgery mSystems 2020 5 e00450-20 10.1128/mSystems.00450-20 32665329 PMC7363005 18. Carosso A. Revelli A. Gennarelli G. Canosa S. Cosma S. Borella F. Tancredi A. Paschero C. Boatti L. Zanotto E. Controlled Ovarian Stimulation and Progesterone Supplementation Affect Vaginal and Endometrial Microbiota in IVF Cycles: A Pilot Study J. Assist. Reprod. Genet. 2020 37 2315 2326 10.1007/s10815-020-01878-4 32671734 PMC7492325 19. van den Tweel M.M. van den Munckhof E.H.A. van der Zanden M. Molijn A. van Lith J.M.M. Boers K.E. The Vaginal Microbiome Changes During Various Fertility Treatments Reprod. Sci. 2024 31 1593 1600 10.1007/s43032-024-01484-0 38379070 PMC11111482 20. Eslami M. Naderian R. Ahmadpour A. Shushtari A. Maleki S. Mohammadian P. Amiri A. Janbazi M. Memarian M. Yousefi B. Microbiome Structure in Healthy and Pregnant Women and Importance of Vaginal Dysbiosis in Spontaneous Abortion Front. Cell. Infect. Microbiol. 2024 14 1401610 10.3389/fcimb.2024.1401610 40046910 PMC11881085 21. Zhang J. Xu Z. Zhang M. Fang J. Zheng Y. Jiang C. Pan M. Microbiomic Insights into the Unique Effects of Vaginal Microbiota on Preterm Birth in Chinese Pregnant Women Front. Microbiol. 2025 16 1560528 10.3389/fmicb.2025.1560528 40165789 PMC11955808 22. Page M.J. McKenzie J.E. Bossuyt P.M. Boutron I. Hoffmann T.C. Mulrow C.D. Shamseer L. Tetzlaff J.M. Akl E.A. Brennan S.E. The PRISMA 2020 Statement: An Updated Guideline for Reporting Systematic Reviews Syst. Rev. 2021 10 89 10.1186/s13643-021-01626-4 33781348 PMC8008539 23. Seo H.J. Kim S.Y. Lee Y.J. Park J.E. RoBANS 2: A Revised Risk of Bias Assessment Tool for Nonrandomized Studies of Interventions Korean J. Fam. Med. 2023 44 249 260 10.4082/kjfm.23.0034 37423253 PMC10522469 24. Väinämö S. Saqib S. Kalliala I. Kervinen K. Luiro K. Niinimäki M. Halttunen-Nieminen M. Virtanen S. Nieminen P. Salonen A. Longitudinal Analysis of Vaginal Microbiota during IVF Fresh Embryo Transfer and in Early Pregnancy Microbiol. Spectr. 2023 11 e01650-23 10.1128/spectrum.01650-23 37882794 PMC10715154 25. Callahan B.J. McMurdie P.J. Rosen M.J. Han A.W. Johnson A.J.A. Holmes S.P. DADA2: High-Resolution Sample Inference from Illumina Amplicon Data Nat. Methods 2016 13 581 583 10.1038/nmeth.3869 27214047 PMC4927377 26. Mallick H. Rahnavard A. McIver L.J. Ma S. Zhang Y. Nguyen L.H. Tickle T.L. Weingart G. Ren B. Schwager E.H. Multivariable Association Discovery in Population-Scale Meta-Omics Studies PLoS Comput. Biol. 2021 17 e1009442 10.1371/journal.pcbi.1009442 34784344 PMC8714082 27. Eskew A.M. Stout M.J. Bedrick B.S. Riley J.K. Herter B.N. Gula H. Jungheim E.S. Wylie K.M. Association of Vaginal Bacterial Communities and Reproductive Outcomes with Prophylactic Antibiotic Exposure in a Subfertile Population Undergoing in Vitro Fertilization: A Prospective Exploratory Study F S Sci. 2021 2 71 79 10.1016/j.xfss.2021.01.002 34632426 PMC8494411 28. Karaer A. Doğan B. Günal S. Tuncay G. Arda Düz S. Ünver T. Tecellioğlu N. The Vaginal Microbiota Composition of Women Undergoing Assisted Reproduction: A Prospective Cohort Study BJOG 2021 128 2101 2109 10.1111/1471-0528.16782 34053157 29. Koedooder R. Singer M. Schoenmakers S. Savelkoul P.H.M. Morré S.A. De Jonge J.D. Poort L. Cuypers W.J.S.S. Beckers N.G.M. Broekmans F.J.M. The Vaginal Microbiome as a Predictor for Outcome of in Vitro Fertilization with or without Intracytoplasmic Sperm Injection: A Prospective Study Hum. Reprod. 2019 34 1042 1054 10.1093/humrep/dez065 31119299 30. Miyagi M. Mekaru K. Tanaka S.E. Arai W. Ashikawa K. Sakuraba Y. Nakamura R. Oishi S. Akamine K. Aoki Y. Endometrial and Vaginal Microbiomes Influence Assisted Reproductive Technology Outcomes J. Bras. Reprod. Assist. 2023 27 267 281 10.5935/1518-0557.20220040 36468798 PMC10279429 31. Vergaro P. Tiscornia G. Barragán M. García D. Rodriguez A. Santaló J. Vassena R. Vaginal Microbiota Profile at the Time of Embryo Transfer Does Not Affect Live Birth Rate in IVF Cycles with Donated Oocytes Reprod. Biomed. Online 2019 38 883 891 10.1016/j.rbmo.2018.12.019 30879910 32. Koort K. Sõsa K. Türk S. Lapp E. Talving E. Karits P. Rosenstein K. Jaagura M. Sekavin A. Sõritsa D. Lactobacillus Crispatus-Dominated Vaginal Microbiome and Acinetobacter-Dominated Seminal Microbiome Support Beneficial ART Outcome Acta Obstet. Gynecol. Scand. 2023 102 921 934 10.1111/aogs.14598 37221898 PMC10333654 33. van den Tweel M.M. van den Munckhof E.H.A. van der Zanden M. Molijn A.C. van Lith J.M.M. Le Cessie S. Boers K.E. Bacterial Vaginosis in a Subfertile Population Undergoing Fertility Treatments: A Prospective Cohort Study J. Assist. Reprod. Genet. 2024 41 441 450 10.1007/s10815-023-03000-w 38087161 PMC10894785 34. Maksimovic Celicanin M. Haahr T. Humaidan P. Skafte-Holm A. Vaginal Dysbiosis-the Association with Reproductive Outcomes in IVF Patients: A Systematic Review and Meta-Analysis Curr. Opin. Obstet. Gynecol. 2024 36 155 164 10.1097/GCO.0000000000000953 38597377 PMC11062609 35. Skafte-holm A. Humaidan P. Bernabeu A. Lledo B. Jensen J.S. Haahr T. The Association between Vaginal Dysbiosis and Reproductive Outcomes in Sub-fertile Women Undergoing Ivf-treatment: A Systematic Prisma Review and Meta-analysis Pathogens 2021 10 295 10.3390/pathogens10030295 33806442 PMC8001118 36. Gudnadottir U. Debelius J.W. Du J. Hugerth L.W. Danielsson H. Schuppe-Koistinen I. Fransson E. Brusselaers N. The Vaginal Microbiome and the Risk of Preterm Birth: A Systematic Review and Network Meta-Analysis Sci. Rep. 2022 12 7926 10.1038/s41598-022-12007-9 35562576 PMC9106729 37. Haahr T. Zacho J. Bräuner M. Shathmigha K. Skov Jensen J. Humaidan P. Reproductive Outcome of Patients Undergoing in Vitro Fertilisation Treatment and Diagnosed with Bacterial Vaginosis or Abnormal Vaginal Microbiota: A Systematic PRISMA Review and Meta-Analysis BJOG 2019 126 200 207 10.1111/1471-0528.15178 29469992 38. Lafioniatis A. Samara A.A. Makaritsis P.K. Dafopoulos S. Sotiriou S. Dafopoulos K. Understanding the Role of Female Genital Tract Microbiome in Recurrent Implantation Failure J. Clin. Med. 2024 13 3173 10.3390/jcm13113173 38892884 PMC11172434 39. Odendaal J. Black N. Bennett P.R. Brosens J. Quenby S. MacIntyre D.A. The Endometrial Microbiota and Early Pregnancy Loss Hum. Reprod. 2024 39 638 646 10.1093/humrep/dead274 38195891 PMC10988105 40. Ishimwe J.A. Maternal Microbiome in Preeclampsia Pathophysiology and Implications on Offspring Health Physiol. Rep. 2021 9 e14875 10.14814/phy2.14875 34042284 PMC8157769 41. Huang C. Gin C. Fettweis J. Foxman B. Gelaye B. MacIntyre D.A. Subramaniam A. Fraser W. Tabatabaei N. Callahan B. Meta-Analysis Reveals the Vaginal Microbiome Is a Better Predictor of Earlier than Later Preterm Birth BMC Biol. 2023 21 199 10.1186/s12915-023-01702-2 37743497 PMC10518966 42. Balla B. Illés A. Tobiás B. Pikó H. Beke A. Sipos M. Lakatos P. Kósa J.P. The Role of the Vaginal and Endometrial Microbiomes in Infertility and Their Impact on Pregnancy Outcomes in Light of Recent Literature Int. J. Mol. Sci. 2024 25 13227 10.3390/ijms252313227 39684937 PMC11642076 43. Wright M.L. Fettwels J.M. Silberg J.L. Neale M.C. Serrano M.G. Jimenez N.L. Prom-Wormley E. Girerd P.H. Borzellece J.R. Jr. Strauss J.F. Vaginal microbiome Lactobacillus crispatus in heritable among European American women Commu Biol. 2021 4 872 10.1038/s42003-021-02394-6 PMC8342574 34354222 44. Incognito G.G. Ronsini C. Palmara V. Romeo P. Vizzielli G. Restaino S. La Verde M. De Tommasi O. Palumbo M. Cianci S. The Interplay Between Cervicovaginal Microbiota Diversity, Lactobacillus Profiles and Human Papillomavirus in Cervical Cancer: A Systematic Review Healthcare 2025 13 599 10.3390/healthcare13060599 40150449 PMC11942255 45. Gerede A. Nikolettos K. Vavoulidis E. Margioula-Siarkou C. Petousis S. Giourga M. Fotinopoulos P. Salagianni M. Stavros S. Dinas K. Vaginal Microbiome and Pregnancy Complications: A Review J. Clin. Med. 2024 13 3875 10.3390/jcm13133875 38999442 PMC11242209 46. de Souza S.V. Monteiro P.B. de Moura G.A. Santos N.O. Fontanezi C.T.B. de Almeida Gomes I. Teixeira C.A. Vaginal Microbioma and the Presence of Lactobacillus J. Bras. Reprod. Assist. 2023 27 496 506 10.5935/1518-0557.20230006 PMC10712827 37417853 47. Dube R. Kar S.S. Genital Microbiota and Outcome of Assisted Reproductive Treatment—A Systematic Review Life 2022 12 1867 10.3390/life12111867 36431002 PMC9693990 48. Golob J.L. Oskotsky T.T. Tang A.S. Roldan A. Chung V. Ha C.W.Y. Wong R.J. Flynn K.J. Parraga-Leo A. Wibrand C. Microbiome preterm birth DREAM challenge: Crowdsourcing machine learning approaches to advance preterm birth research Cell Rep. Med. 2024 5 101350 10.1016/j.xcrm.2023.101350 38134931 PMC10829755 49. Holdcroft A.M. Ireland D.J. Payne M.S. The Vaginal Microbiome in Health and Disease—What Role Do Common Intimate Hygiene Practices Play? Microorganisms 2023 11 298 10.3390/microorganisms11020298 36838262 PMC9959050 50. Mandar R. Punab M. Borovkova N. Lapp E. Kiiker R. Korrovits P. Metspalu A. Krjutskov K. Nolvak H. Preem J.K. Complementary seminovaginal microbiome in couples Res. Microbiol. 2015 166 440 447 10.1016/j.resmic.2015.03.009 25869222 51. Borovkova N. Korrovits P. Ausmees K. Türk S. Jõers K. Punab M. Mändar R. Influence of sexual intercourse on genital tract microbiota in infertile couples Anaerobe 2011 17 414 418 10.1016/j.anaerobe.2011.04.015 21549210 Figure 1 Flowchart of selected studies. From [ 22 Figure 2 Meta-analysis of the live birth rate of women with a favorable microbiome compared to women with an unfavorable microbiome. The references in Figure 2 27 28 32 33 31 Figure 3 Meta-analysis of the clinical pregnancy rate of women with a favorable microbiome compared to women with an unfavorable microbiome. The references in Figure 3 27 28 29 32 30 24 33 31 Figure 4 Meta-analysis comparing pregnancy loss between women with favorable microbiome and women with unfavorable microbiome. The references in Figure 2 27 28 24 life-15-01382-t001_Table 1 Table 1 Characteristics of selected studies. Author and Year Country Age BMI Index k/mg 2 AMH Abundance of Lactobacillus Causes of Infertility Detection Method Main Inclusion Criteria Conclusion Eskew et al., 2021 [ 27 USA 32.27 (3.8) 30.94 (8.1) 2.16 (1.15) The importance of timing in the assessment of vaginal microbiome to determine its associations with reproductive outcomes Male factor (33.3%) 16S rRN bacterial community structure is not predictive for embryo transfer Molecular feature of microbiome analysis Bacterial community structure is not predictive for embryo transfer Karaer et al., 2021 [ 28 Turkey 23–29 20.0–29.9 No data in the article The abundance of Lactobacillus was lower in women who failed to become pregnant Male factor (37.03%) 16S rRNA Molecular feature of microbiome analysis The high abundance of the genus Streptococcus was greater in the non-pregnancy group Koedooder et al., 2019 [ 29 The Netherlands The majority of participants were from 30–35 years old Most participants had a BMI from 20–29.9 No data in the article There was a low abundance of Lactobacillus in women who failed to become pregnant and a high abundance of Lactobacillus in pregnant women Male factor (71.6%) 16S rRNA Molecular feature of microbiome analysis Without a favorable microbiome, the implantation and subsequent embryo development seem to be compromised Koort et al., 2023 [ 32 Estonia In the ART group, the average age of women was 34.1 and in the control group, it was 32.2 In the ART group, 75% of participants had a BMI below 25 (k/mg 2 2 No data in the article Bacterial vaginosis community and with L. iners L. gasseri L. crispatus No data in the article 16S rRNA and Nugent score Molecular feature of microbiome analysis Disturbed microbiome in the reproductive tract in both partners may be one of the reasons for ART failure Miyagi et al., 30 Japan 35.6 (34.1) 22.7 (22.5) 3.53 (0.61) Pregnant women present significantly higher proportions of Lactobacillus Fallopian tube factor (47.6%) 16S rRNA Molecular feature of microbiome analysis The balance between Lactobacillus Vainamo et al., 2023 [ 24 Finland 32.9 24.9 2.6 Role of L. crispatus Endometriosis (33.3%) 16S rRNA Molecular feature of microbiome analysis Most women who achieved pregnancy had an indication of holding a reservoir of this beneficial Lactobacillus in their reproductive tract van den Tweel et al., 2024 [ 33 The Netherlands 34 27.3 - There was a tendency of more miscarriages based on positive BV status or community state type groups III and IV Male factor (34%) 16S rRNA Molecular feature of microbiome analysis Bacterial vaginosis does not significantly impact ongoing pregnancy rates but could affect miscarriage rates Vergaro et al., 2019 [ 31 Spain 41.5 24.4 24.4 Higher proportion of samples dominated by L. crispatus No data in article 16S rRNA Molecular feature of microbiome analysis Vaginal microbiota profile on the day of the embryo transfer is not related to live birth rate in women receiving oocytes life-15-01382-t002_Table 2 Table 2 MaAsLin2 analysis of the taxa represented in Väinämö et al. (2023) [ 24 Taxon Coefficient p  Lactobacillus crispatus 1.802 0.003  Streptococcus anginosus −0.708 0.060 Lactobacillus 0.402 0.605 Limosilactobacillus −0.135 0.542  Lactobacillus iners 0.425 0.656  Lactobacillus jensenii −0.269 0.705  Fannyhessea vaginae −0.320 0.374 Anaerococcus 0 0.999 Dialister 0 0.999 Gardnerella 0 0.999 Enterococcus 0 0.999  Anaerococcus prevotii 0 0.999  Anaerococcus tetradius 0 0.999  Dialister succinatiphilus 0 0.999  Enterococcus faecalis 0 0.999  Escherichia coli 0 0.999  Finegoldia magna 0 0.999  Gardnerella swidsinskii 0 0.999  Gardnerella vaginalis 0 0.999  Lactobacillus gasseri 0 0.999  Limosilactobacillus coleohominis 0 0.999  Megasphaera lornae 0 0.999  Parvimonas micra 0 0.999  Peptostreptococcus anaerobius 0 0.999  Peptostreptococcus stomatis 0 0.999  Porphyromonas asaccharolytica 0 0.999  Porphyromonas uenonis 0 0.999  Prevotella amnii 0 0.999  Prevotella bivia 0 0.999  Streptococcus agalactiae 0 0.999  Streptococcus anginosus 0 0.999  Streptococcus dysgalactiae 0 0.999  Streptococcus hominis 0 0.999  Veillonella atypica 0 0.999  Veillonella dispar 0 0.999  Veillonella ratti 0 0.999 ",
  "metadata": {
    "Title of this paper": "Influence of sexual intercourse on genital tract microbiota in infertile couples",
    "Journal it was published in:": "Life",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471688/"
  }
}