{
  "title": "Paper_36",
  "abstract": "JCO Precis Oncol JCO Precis Oncol 319 nihpa JCO precision oncology 2473-4284 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12494156 PMC12494156.1 12494156 12494156 NIHMS2107313 41037762 10.1200/PO-25-00037 NIHMS2107313 NIHPA2107313 1 Article Transgender and gender diverse patient perspectives on hereditary breast cancer risk assessment in gender-affirming top surgeries Zayhowski Kimberly MS, CGC a b Blumen Kai MS c Mittendorf Kathleen F. PhD d e Pratt Rebekah PhD f Streed Carl Jr. MD, MPH g h Berro Tala MS, CGC i MacFarlane Ian M. PhD b a b c d e f g h i Contributions Kimberly Zayhowski: Kai Blumen: Kathleen F. Mittendorf: Rebekah Pratt: Carl Streed, Jr.: Tala Berro: Ian M. MacFarlane: Correspondence: kzayhows@bu.edu 10 2025 02 10 2025 9 498220 e2500037 e2500037 08 09 2025 03 10 2025 04 10 2025 04 10 2025 Purpose: Transgender and gender diverse (TGD) people have increased cancer morbidity and mortality relative to cisgender individuals. Existing breast cancer prevention guidelines fail to adequately address gender-affirming care implications, especially in the context of gender-affirming mastectomies (“top surgery”). Evaluation of familial and germline genetic risk prior to top surgery is recommended by some transgender health guidelines. This evaluation can facilitate shared surgical decision-making regarding breast tissue resection extent. In this study, we utilize in-depth interviews with TGD people planning or having recently undergone top surgery. We aimed to understand barriers and facilitators to pre- and post-top surgery breast cancer risk assessment and screening, and the perceived utility and acceptability of pre-surgical genetic evaluation. Methods: We conducted qualitative community-engaged research through interviews with sixteen TGD adults who had or were considering top surgery. Through a social constructivist lens, we used reflexive thematic analysis to generate themes. Results: We conceptualized six key themes: (1) post-top surgery cancer screening uncertainty, (2) lack of provider knowledge hindering appropriate care, (3) the experience of breast health spaces as heavily feminized, (4) the balance of aesthetic goals with cancer risk reduction, (5) increased comfort with post-surgical screening due to reduced dysphoria and greater body confidence, and (6) the desire for cancer genetics integration with top surgery care navigation. Conclusion: From these themes, we derived actionable guidance to address breast cancer health equity in this population. Enhancing patient education, increasing provider awareness, and developing inclusive clinical practice guidelines are crucial steps in effectively addressing breast cancer risk in individuals receiving surgery. It is vital to de-gender health spaces to promote inclusion and accessibility of breast cancer prevention. Integrating genetics professionals and cancer risk assessment into transgender health clinics and the top surgery process is paramount for delivering personalized care and facilitating informed surgical decision-making. Context Summary Key objective: To enhance precision cancer care for transgender and gender diverse (TGD) people, this study aimed to understand barriers and facilitators to pre- and post-top surgery breast cancer risk assessment and screening, as well as the perceived utility and acceptability of pre-surgical genetic evaluation. Knowledge generated: Through reflexive thematic analysis of interviews with TGD participants, we constructed six themes illustrating influences on cancer risk engagement, including lack of patient and provider knowledge of post-surgical cancer risk, heavily feminized cancer spaces, aesthetic surgical considerations, post-surgical comfort with cancer screening, and explicit desire for genetic counseling integration into surgical pathways. Relevance: Based on these themes, we derived actionable guidance to promote breast cancer health equity, including enhancing patient education, increasing provider awareness, and integrating genetics into transgender health care. De-gendering clinical spaces and updating practice guidelines are vital for inclusive, informed, and personalized cancer care. Transgender mastectomy genetic counseling gender-affirming care breast cancer reflexive thematic analysis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Transgender and gender diverse patient perspectives on hereditary breast cancer risk assessment in gender-affirming top surgeries",
    "Journal it was published in:": "JCO precision oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494156/"
  }
}