{
  "title": "Paper_192",
  "abstract": "pmc Sci Adv Sci Adv 2850 sciadv sciadv Science Advances 2375-2548 American Association for the Advancement of Science PMC12494032 PMC12494032.1 12494032 12494032 41042877 10.1126/sciadv.adx8037 adx8037 1 Research Article Biomedicine and Life Sciences SciAdv r-articles Immunology Life Sciences Immunology Neonatal regulatory T cells persist into adulthood across multiple tissues with high enrichment in the skin Neonatal T regs https://orcid.org/0000-0003-4562-5998 Hilaire Morgane Conceptualization Data curation Formal analysis Investigation Methodology Supervision Validation Visualization Writing - original draft Writing - review & editing  1  2 * https://orcid.org/0000-0001-7831-1448 Mimoun Angélina Investigation Project administration Validation Visualization Writing - review & editing  2 https://orcid.org/0009-0007-2373-8672 Cagnet Léonie Investigation Writing - review & editing  1  2 https://orcid.org/0000-0001-5038-4741 Villette Rémy Formal analysis Methodology Software Writing - review & editing  1 Roubanis Aristeidis Funding acquisition Methodology Resources  1 Sentenac Hugo Formal analysis Investigation Resources Validation  2 https://orcid.org/0000-0001-9673-5578 Salomon Benoît L. Conceptualization Data curation Formal analysis Funding acquisition Methodology Project administration Resources Software Supervision Validation Visualization Writing - original draft Writing - review & editing  1  2 * 1 2 * benoit.salomon@inserm.fr hilaire.morgane77@gmail.com 03 10 2025 03 10 2025 11 40 498113 eadx8037 28 3 2025 03 9 2025 03 10 2025 04 10 2025 04 10 2025 Copyright © 2025 The Authors, some rights reserved; exclusive licensee American Association for the Advancement of Science. No claim to original U.S. Government Works. Distributed under a Creative Commons Attribution License 4.0 (CC BY). 2025 The Authors https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution license Foxp3 + regs regs reg reg reg regs reg regs regs reg regs The adult skin T reg http://dx.doi.org/10.13039/100010661 Horizon 2020 Framework Programme ANR-21-CE15-0049 http://dx.doi.org/10.13039/100010661 Horizon 2020 Framework Programme ANR-22-CE18-0045 http://dx.doi.org/10.13039/100010661 Horizon 2020 Framework Programme 955321 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Mice are born lymphopenic, and T cells begin to emerge from the thymus and progressively colonize peripheral tissues only after birth. Mice are thus an ideal model for studying T cell ontogeny and the progressive establishment of immune homeostasis throughout the first few weeks of life. During this critical window, the immune system must rapidly establish effective defenses against pathogens while simultaneously promoting tolerance to self-antigens, the microbiota, and food antigens. Neonatal and adult T cell immunity differs quite remarkably ( 1 H + regs 2 3 reg regs 4 5 reg + 4 6 reg 6 reg + 5 7 8 A subset of T regs regs 9 regs 9 10 regs H 7 11 Despite their critical role in immune homeostasis, the precise ontogeny and generation kinetics of the adult T reg regs reg 9 reg reg regs reg regs RESULTS Experimental approach To investigate T reg Foxp3 tm9(EGFP/cre/ERT2)Ayr Foxp3 iCre tm9(CAG-tdTomato)Hze/J R26 Tom Foxp3 iCre reg Cre-ERT2 R26 Tom tdTomato regs regs regs regs reg Fig. 1A Fig. 1. Dynamics of the generation of the T reg Foxp3 iCre Tom A B regs + regs + − regs + + C regs + regs reg regs D To validate this approach, we confirmed specificity of tdTomato labeling to T regs reg regs Fig. 1B regs Foxp3 iCre Tom reg regs Tissue-specific kinetics of T reg To determine the temporal dynamics of T reg Foxp3 iCre Tom regs Fig. 1A regs regs regs regs regs Fig. 1A reg regs Fig. 1C reg Fig 1C regs regs regs Fig. 1C regs reg regs regs regs regs regs Fig. 1C reg Fig. 1D reg reg reg To determine whether T reg regs + reg regs + reg reg Neonatal T regs T regs + + − − 12 regs + regs regs + 13 regs + regs + regs Fig. 2A reg + regs Fig. 2A + regs reg + regs reg regs regs regs Fig. 2B regs + + regs regs + regs regs regs + reg Fig. 2. Neonatal T regs ( A Foxp3 iCre Tom Fig. 1 regs + + − − regs regs regs regs B Foxp3 iCre Tom + + regs P P Neonatal T regs To further characterize neonatal T regs reg reg regs Foxp3 iCre Tom regs regs regs regs Fig. 3, A to C regs Fig. 3B regs regs regs regs Fig. 3D regs Fig. 3. T regs Foxp3 iCre Tom regs regs A regs B C regs D regs regs Fig. 1 P P Neonatal T regs reg We then assessed whether unTag and TagT regs regs reg 14 regs reg 15 16 Foxp3 iCre Tom regs regs Fig. 4A regs regs Fig. 4, B to D regs regs regs regs Fig. 4C regs regs regs reg regs regs reg regs 9 reg regs regs 14 reg regs regs Fig. 4E reg 15 17 regs reg regs regs Fig. 4E regs Fig. 4. T regs regs Foxp3 iCre Tom reg regs regs A reg reg B regs C regs D + + regs regs Fig. 1 E regs regs 9 reg 14 reg 15 17 P P T reg To assess whether neonatal T regs regs Foxp3 iCre Tom Fig. 5A regs reg regs regs Fig. 5B regs + reg + reg Fig. 5B reg Foxp3 iCre Tom regs Fig. 5C + regs regs regs + regs Fig. 5D reg Fig. 5. Persistence of neonatal T regs reg ( A B Foxp3 iCre Tom regs + − − + + reg C D Foxp3 iCre Tom regs + − − + + reg P P High proliferation of neonatal T regs regs Our findings demonstrate that in certain tissues, such as the skin and VAT, T regs reg regs regs regs Fig. 6A + regs Fig. 6A + regs + regs regs Fig. 6A regs regs reg regs Fig. 6. Proliferation and residency of neonatal skin T regs ( A + regs + reg B Foxp3 iCre Tom regs regs + C D Foxp3 iCre Tom regs reg regs P Our results reveal that by 8 weeks of age, 85% of the skin T reg regs regs regs Foxp3 iCre Tom Fig. 6B regs regs regs Fig. 6B regs reg regs Last, we examined the phenotypic evolution of neonatal skin T regs regs reg regs regs Fig. 6, C and D regs regs Fig. 6C regs DISCUSSION Our study provides a comprehensive analysis of the kinetics of T reg reg reg In the spleen and LNs, our data show that ~10% of the adult T reg regs regs regs The liver and lungs exhibit a distinct pattern of T reg reg reg reg 4 6 15 reg 6 The VAT exhibits an early T reg reg regs reg 15 16 regs reg regs regs reg regs regs regs regs 18 The kinetics of T reg regs regs reg regs regs reg 15 regs + 5 7 + regs 8 regs 7 regs regs We also observed a systemic and high expansion of T regs reg regs 19 regs 20 regs reg 4 6 reg reg 5 regs 21 regs Another important finding is the phenotypic switch between neonatal-derived and later-generated T regs regs regs regs regs 9 22 regs regs 9 regs regs regs regs regs 9 In addition, we demonstrate that neonatal T regs regs 1 regs H + + 23 regs regs H 24 + regs regs regs The preferential differentiation of GATA3 + regs reg reg + + 12 regs 13 + + + reg regs regs + reg + reg H reg Our findings may have clinical relevance, particularly in the context of immunodysregulation polyendocrinopathy enteropathy X-linked (IPEX) syndrome, where T reg H 25 26 + regs 27 1 reg H 11 28 regs regs 24 29 regs regs regs Last, our skin-specific T reg regs regs 30 reg regs 31 33 regs 33 35 regs regs 33 reg regs regs regs regs reg In conclusion, our study provides a comprehensive analysis of the T reg reg regs regs MATERIALS AND METHODS Mice Foxp3 tm9(EGFP/cre/ERT2)Ayr Foxp3 iCre tm9(CAG-tdTomato)Hze/J R26 Tom Foxp3 tm3(DTR/GFP)Ayr/J Foxp3 DTR Tamoxifen and EdU administration The tamoxifen (MP Biomedical, Ref: 11435161) was reconstituted at a final concentration of 40 mg/ml in peanut oil, obtained after 4 hours of vortex at 37°C. For mice older than 6 weeks, 8 mg of tamoxifen was administered orally by gavage. For mice younger than 6 weeks, tamoxifen was administered by two intraperitoneal injections, 3 days apart. They received a dose adapted to their age (0.1, 0.2, 1, and 2 mg for 1-, 2-, 3-, and 4- to 6-week-old mice, respectively). For the local treatment of the skin, HO-Tam (Sigma-Aldrich, Ref: T176) was resuspended at the final concentration of 20 μg/ml in acetone. Fifty microliters of the solution was applied directly on the ears during 4 consecutive days. EdU was administered intraperitoneally [at 5 mg/ml in phosphate-buffered saline (PBS)] three times on the day before tissue collection (at 7 a.m. and 1 and 7 p.m.). One-week-old mice received 50 μl per injection, whereas 3-week-old mice received 100 μl per injection. EdU incorporation was detected using the Click-iT Plus EdU Pacific Blue Flow Cytometry Assay Kit (Thermo Fisher Scientific, Ref: C10636 Preparation of cell suspensions After cervical dislocation, mice were perfused intracardially with PBS to eliminate blood circulating cells. Lymphoid tissues (spleen and brachial/axillary LNs) and liver were collected in PBS complemented with 3% fetal calf serum (PBS-3%FCS). A single-cell suspension was obtained by mechanical dilaceration with a 70-μm cell strainer. The single-cell suspension obtained from the liver was resuspended in 40% Percoll, laid on an 80% Percoll, and centrifuged for 20 min at 2000 rpm at 20°C. Cells were collected at the 40%:80% Percoll interface and washed with PBS-3%FCS. The entire colon was collected, washed to remove feces, and cut longitudinally and then into small pieces. The tissues were subjected to three consecutive baths in order to remove the epithelium and collect the lamina propria: twice with PBS-3%FCS EDTA 5 mM and once with PBS-3%FCS, each lasting 20 min. After each bath, the tubes were vortexed for 10 s, and the pieces of tissue were transferred into the next tube. For the spleen and lungs, the red blood cells were lysed with ammonium chloride potassium for 1 min. The VAT, lungs, and skin were collected in PBS and cut into small pieces before enzymatic digestion. For mice under 1 month old, the adipose tissue was collected subcutaneously. Digestion kits specific to each tissue from Miltenyi were used. The gentleMACS Dissociator was used for the lungs (Ref: 130-095-927) and the VAT (Ref: 130-105-808) in accordance with the instructions provided by the supplier. For the skin (Ref: 130-110-201) and the lamina propria (Ref: 130-097-410), the protocol was adapted, and the cells were digested using 12-well plates at 37°C with constant agitation for 105 and 30 min, respectively. After the digestion, the tissues were filtered with a 70-μm cell strainer. Enzymatic digestions had minimal impact on expression of surface molecules, as suggested from studying CD8a expression that is very sensitive to such treatment. Antibodies and flow cytometry Cells were stained in 96-well plates with the antibodies and fluorescent reagent listed in Table 1 + − regs Table 1. Antibodies used in flow cytometry. PE, phycoerythrin; Cy7, Cyanine 7; AP, allophycocyanin; PerCP, peridinin-chlorophyll-protein complex. Target Clone Fluorochrome Supplier Reference Bcl2 10C4 PE-Cy7 Invitrogen 25-6992-42 CCR2 475301 BUV661 BD Biosciences 750042 CD25 PC61 BV605 BioLegend 102036 CD3 145-2C11 BUV563 BD Biosciences 749277 CD4 GK1.5 BUV496 BD Biosciences 612952 CD44 IM7 PerCP BioLegend 103035 CD45 30-F11 BUV395 BD Biosciences 564279 CD62L MEL-14 BV650 BD Biosciences 564108 CD69 H1.2F3 BUV805 BD Biosciences 741927 CD73 TY/11.8 PerCP-Cy5.5 BioLegend 127214 CD8 53-6.7 PE-Cy5.5 Invitrogen 35-0081-80 c-Maf sym0F1 eF450 Invitrogen 48-9855-42 CTLA-4 UC10-4F10-11 PE-CF594 BD Biosciences 564332 EZH2 11/EZH2 BV421 BD Biosciences 562963 Foxp3 FJK-16 s FITC Invitrogen 11-5773-82 GATA3 TWAJ PE-Cy5 Invitrogen 15-9966-41 ICOS 7E.17G9 BV711 BD Biosciences 740763 Ki67 SolA15 AF532 Invitrogen 58-5698-82 KLRG1 2F1 BUV615 BD Biosciences 751191 NRP1 V46-1954 BV750 BD Biosciences 752452 PD-1 j43 BUV737 BD Biosciences 749422 RORγT Q31-378 AF647 BD Biosciences 562682 ST2 U29-93 BV480 BD Biosciences 746701 TCF1 S33-966 R718 BD Biosciences 567587 TNFR2 REA228 APC Miltenyi 130-123-275 T reg Foxp3 DTR Single-cell suspension obtained from the spleen and LNs of the Foxp3 iCre Tom + Foxp3 DTR 6 Flow cytometry analysis, GSEA, biostatistic, and data modelization Raw FCS data from the Aurora were analyzed using FlowJo software to produce data tables. The following analysis was performed using R (4.3.1). PCA was performed using factominer (2.8) and factoextra (1.0.7). Boxplots and line plots were generated using ggplot2 (3.4.3). Statistical analyses were performed using rstatix (0.7.2) and ggpubr (0.6.0). Gene set enrichment analysis (GSEA) was performed using the Webgestalt software ( https://www.webgestalt.org/ 2 regs et al. 9 regs regs 14 reg regs + + reg 15 17 Acknowledgments We are grateful to M. Larsen and M. Zahm for help in biostatistical analyses, to C. Benoist and D. Mazzone for critical reading of the manuscript, and to F. Issert, O. Bregerie, M. Mihoc, and J. Perronnet for the expert care of the mouse colony. Funding: Author contributions: Competing interests: Data and materials availability: Supplementary Materials This PDF file includes: Figs. S1 to S9 REFERENCES AND NOTES 1 B. D. Rudd Neonatal T cells: A reinterpretation Annu. Rev. Immunol. 38 229 247 2020 31928469 10.1146/annurev-immunol-091319-083608 PMC7369171 2 J. E. Konkel W. Jin B. Abbatiello J. R. Grainger W. Chen Thymocyte apoptosis drives the intrathymic generation of regulatory T cells Proc. Natl. Acad. Sci. U.S.A. 111 E465 E473 2014 24474796 10.1073/pnas.1320319111 PMC3910656 3 G. Wang Y. Miyahara Z. Guo M. Khattar S. M. Stepkowski W. Chen “Default” generation of neonatal regulatory T cells J. Immunol. 185 71 78 2010 20498359 10.4049/jimmunol.0903806 4 M. Li W. Zhao Y. Wang L. Jin G. Jin X. Sun W. Wang K. Wang X. Xu J. Hao R. Jin W. Fu Y. Sun Y. Chang X. Huang X. Zhou H. Wu K. Zhang Q. Ge A wave of Foxp3 + Cell Mol. Immunol. 17 507 518 2020 31171863 10.1038/s41423-019-0246-9 PMC7193579 5 P. Sivasami C. Elkins P. P. Diaz-Saldana K. Goss A. Peng M. Hamersky J. Bae M. Xu B. P. Pollack E. M. Horwitz C. D. Scharer L. Seldin C. Li Obesity-induced dysregulation of skin-resident PPARγ + Immunity 56 1844 1861.e6 2023 37478855 10.1016/j.immuni.2023.06.021 PMC10527179 6 J. Tuncel C. Benoist D. Mathis T cell anergy in perinatal mice is promoted by T reg cells and prevented by IL-33 J. Exp. Med. 216 1328 1344 2019 30988052 10.1084/jem.20182002 PMC6547863 7 T. C. Scharschmidt K. S. Vasquez H.-A. Truong S. V. Gearty M. L. Pauli A. Nosbaum I. K. Gratz M. Otto J. J. Moon J. Liese A. K. Abbas M. A. Fischbach M. D. Rosenblum A wave of regulatory T cells into neonatal skin mediates tolerance to commensal microbes Immunity 43 1011 1021 2015 26588783 10.1016/j.immuni.2015.10.016 PMC4654993 8 T. C. Scharschmidt K. S. Vasquez M. L. Pauli E. G. Leitner K. Chu H.-A. Truong M. M. Lowe R. S. Rodriguez N. Ali Z. G. Laszik J. L. Sonnenburg S. E. Millar M. D. Rosenblum Commensal microbes and hair follicle morphogenesis coordinately drive Treg migration into neonatal skin Cell Host Microbe 21 467 477.e5 2017 28343820 10.1016/j.chom.2017.03.001 PMC5516645 9 S. Yang N. Fujikado D. Kolodin C. Benoist D. Mathis Immune tolerance. Regulatory T cells generated early in life play a distinct role in maintaining self-tolerance Science 348 589 594 2015 25791085 10.1126/science.aaa7017 PMC4710357 10 W. Hu Z.-M. Wang Y. Feng M. Schizas B. E. Hoyos J. van der Veeken J. G. Verter R. Bou-Puerto A. Y. Rudensky Regulatory T cells function in established systemic inflammation and reverse fatal autoimmunity Nat. Immunol. 22 1163 1174 2021 34426690 10.1038/s41590-021-01001-4 PMC9341271 11 I. C. Boothby M. J. Kinet D. P. Boda E. Y. Kwan S. Clancy J. N. Cohen I. Habrylo M. M. Lowe M. Pauli A. E. Yates J. D. Chan H. W. Harris I. M. Neuhaus T. H. McCalmont A. B. Molofsky M. D. Rosenblum Early-life inflammation primes a T helper 2 cell-fibroblast niche in skin Nature 599 667 672 2021 34707292 10.1038/s41586-021-04044-7 PMC8906225 12 D. Ramanan A. Pratama Y. Zhu O. Venezia M. Sassone-Corsi K. Chowdhary S. Galván-Peña E. Sefik C. Brown A. Gélineau D. Mathis C. Benoist Regulatory T cells in the face of the intestinal microbiota Nat. Rev. Immunol. 23 749 762 2023 37316560 10.1038/s41577-023-00890-w 13 A. Pratama A. Schnell D. Mathis C. Benoist Developmental and cellular age direct conversion of CD4 + + + J. Exp. Med. 217 e20190428 2020 31685531 10.1084/jem.20190428 PMC7037252 14 M. Delacher C. D. Imbusch D. Weichenhan A. Breiling A. Hotz-Wagenblatt U. Träger A.-C. Hofer D. Kägebein Q. Wang F. Frauhammer J.-P. Mallm K. Bauer C. Herrmann P. A. Lang B. Brors C. Plass M. Feuerer Genome-wide DNA-methylation landscape defines specialization of regulatory T cells in tissues Nat. Immunol. 18 1160 1172 2017 28783152 10.1038/ni.3799 PMC5912503 15 M. Delacher C. D. Imbusch A. Hotz-Wagenblatt J.-P. Mallm K. Bauer M. Simon D. Riegel A. F. Rendeiro S. Bittner L. Sanderink A. Pant L. Schmidleithner K. L. Braband B. Echtenachter A. Fischer V. Giunchiglia P. Hoffmann M. Edinger C. Bock M. Rehli B. Brors C. Schmidl M. Feuerer Precursors for nonlymphoid-tissue Treg cells reside in secondary lymphoid organs and are programmed by the transcription factor BATF Immunity 52 295 312.e11 2020 31924477 10.1016/j.immuni.2019.12.002 PMC7026712 16 C. Li J. R. DiSpirito D. Zemmour R. G. Spallanzani W. Kuswanto C. Benoist D. Mathis TCR transgenic mice reveal stepwise, multi-site acquisition of the distinctive fat-Treg phenotype Cell 174 285 299.e12 2018 29887374 10.1016/j.cell.2018.05.004 PMC6046274 17 R. J. Miragaia T. Gomes A. Chomka L. Jardine A. Riedel A. N. Hegazy N. Whibley A. Tucci X. Chen I. Lindeman G. Emerton T. Krausgruber J. Shields M. Haniffa F. Powrie S. A. Teichmann Single-cell transcriptomics of regulatory T cells reveals trajectories of tissue adaptation Immunity 50 493 504.e7 2019 30737144 10.1016/j.immuni.2019.01.001 PMC6382439 18 A. R. Muñoz-Rojas G. Wang C. Benoist D. Mathis Adipose-tissue regulatory T cells are a consortium of subtypes that evolves with age and diet Proc. Natl. Acad. Sci. U.S.A. 121 e2320602121 2024 38227656 10.1073/pnas.2320602121 PMC10823167 19 A. Le Campion C. Bourgeois F. Lambolez B. Martin S. Léaument N. Dautigny C. Tanchot C. Pénit B. Lucas Naive T cells proliferate strongly in neonatal mice in response to self-peptide/self-MHC complexes Proc. Natl. Acad. Sci. U.S.A. 99 4538 4543 2002 11917110 10.1073/pnas.062621699 PMC123683 20 A. Le Campion A. Pommier A. Delpoux L. Stouvenel C. Auffray B. Martin B. Lucas IL-2 and IL-7 determine the homeostatic balance between the regulatory and conventional CD4 + J. Immunol. 189 3339 3346 2012 22933631 10.4049/jimmunol.1103152 21 L. L. Korn H. G. Hubbeling P. M. Porrett Q. Yang L. G. Barnett T. M. Laufer Regulatory T cells occupy an isolated niche in the intestine that is antigen independent Cell Rep. 9 1567 1573 2014 25482559 10.1016/j.celrep.2014.11.006 PMC12079782 22 J. Yang M. Zou X. Chu S. Floess Y. Li M. Delacher J. Huehn Inflammatory perturbations in early life long-lastingly shape the transcriptome and TCR repertoire of the first wave of regulatory T cells Front. Immunol. 13 991671 2022 36119090 10.3389/fimmu.2022.991671 PMC9471859 23 A. Vasanthakumar K. Moro A. Xin Y. Liao R. Gloury S. Kawamoto S. Fagarasan L. A. Mielke S. Afshar-Sterle S. L. Masters S. Nakae H. Saito J. M. Wentworth P. Li W. Liao W. J. Leonard G. K. Smyth W. Shi S. L. Nutt S. Koyasu A. Kallies The transcriptional regulators IRF4, BATF and IL-33 orchestrate development and maintenance of adipose tissue-resident regulatory T cells Nat. Immunol. 16 276 285 2015 25599561 10.1038/ni.3085 24 L. A. Kalekar J. N. Cohen N. Prevel P. M. Sandoval A. N. Mathur J. M. Moreau M. M. Lowe A. Nosbaum P. J. Wolters A. Haemel F. Boin M. D. Rosenblum Regulatory T cells in skin are uniquely poised to suppress profibrotic immune responses Sci. Immunol. 4 eaaw2910 2019 31492709 10.1126/sciimmunol.aaw2910 PMC6848056 25 T. A. Chatila F. Blaeser N. Ho H. M. Lederman C. Voulgaropoulos C. Helms A. M. Bowcock JM2, encoding a fork head-related protein, is mutated in X-linked autoimmunity-allergic disregulation syndrome J. Clin. Invest. 106 R75 R81 2000 11120765 10.1172/JCI11679 PMC387260 26 C. Caruso L. Laterza C. R. Settanni S. Colantuono C. Di Mario B. Tolusso F. Castrì E. Gremese F. Scaldaferri A. Armuzzi C. De Simone K. Peris A. Chiricozzi A. Gasbarrini Case report: Dupilumab treatment improved type 2 disorders in a patient with IPEX syndrome diagnosis Front. Immunol. 13 995304 2023 36713411 10.3389/fimmu.2022.995304 PMC9875030 27 Y. Zheng A. Chaudhry A. Kas P. deRoos J. M. Kim T.-T. Chu L. Corcoran P. Treuting U. Klein A. Y. Rudensky Regulatory T-cell suppressor program co-opts transcription factor IRF4 to control T H Nature 458 351 356 2009 19182775 10.1038/nature07674 PMC2864791 28 K. A. Knoop K. G. McDonald C.-S. Hsieh P. I. Tarr R. D. Newberry Regulatory T cells developing peri-weaning are continually required to restrain Th2 systemic responses later in life Front. Immunol. 11 603059 2021 33613522 10.3389/fimmu.2020.603059 PMC7891039 29 O. J. Harrison J. L. Linehan H.-Y. Shih N. Bouladoux S.-J. Han M. Smelkinson S. K. Sen A. L. Byrd M. Enamorado C. Yao S. Tamoutounour F. Van Laethem C. Hurabielle N. Collins A. Paun R. Salcedo J. J. O’Shea Y. Belkaid Commensal-specific T cell plasticity promotes rapid tissue adaptation to injury Science 363 eaat6280 2019 30523076 10.1126/science.aat6280 PMC7304459 30 J. N. Cohen V. Gouirand C. E. Macon M. M. Lowe I. C. Boothby J. M. Moreau I. K. Gratz A. Stoecklinger C. T. Weaver A. H. Sharpe R. R. Ricardo-Gonzalez M. D. Rosenblum Regulatory T cells in skin mediate immune privilege of the hair follicle stem cell niche Sci. Immunol. 9 eadh0152 2024 38181095 10.1126/sciimmunol.adh0152 PMC11003870 31 M. Tomura T. Honda H. Tanizaki A. Otsuka G. Egawa Y. Tokura H. Waldmann S. Hori J. G. Cyster T. Watanabe Y. Miyachi O. Kanagawa K. Kabashima Activated regulatory T cells are the major T cell type emigrating from the skin during a cutaneous immune response in mice J. Clin. Invest. 120 883 893 2010 20179354 10.1172/JCI40926 PMC2827959 32 X. Fan B. Moltedo A. Mendoza A. N. Davydov M. B. Faire L. Mazutis R. Sharma D. Pe’er D. M. Chudakov A. Y. Rudensky CD49b defines functionally mature Treg cells that survey skin and vascular tissues J. Exp. Med. 215 2796 2814 2018 30355617 10.1084/jem.20181442 PMC6219731 33 O. Burton, O. Bricard, S. Tareen, V. Gergelits, S. Andrews, C. P. Roca, C. Whyte, S. Junius, A. Brajic, E. Pasciuto, M. Ali, P. Lemaitre, S. M. Schlenner, H. Ishigame, B. D. Brown, J. Dooley, A. Liston, The tissue-resident regulatory T cell pool is shaped by transient multi-tissue migration and a conserved residency program. bioRxiv 553196 [Preprint] (2023). 10.1101/2023.08.14.553196 34 D. Kolodin N. van Panhuys C. Li A. M. Magnuson D. Cipolletta C. M. Miller A. Wagers R. N. Germain C. Benoist D. Mathis Antigen- and cytokine-driven accumulation of regulatory T cells in visceral adipose tissue of lean mice Cell Metab. 21 543 557 2015 25863247 10.1016/j.cmet.2015.03.005 PMC4747251 35 A. Vasanthakumar D. Chisanga J. Blume R. Gloury K. Britt D. C. Henstridge Y. Zhan S. V. Torres S. Liene N. Collins E. Cao T. Sidwell C. Li R. G. Spallanzani Y. Liao P. A. Beavis T. Gebhardt N. Trevaskis S. L. Nutt J. D. Zajac R. A. Davey M. A. Febbraio D. Mathis W. Shi A. Kallies Author correction: Sex-specific adipose tissue imprinting of regulatory T cells Nature 591 E26 2021 33674801 10.1038/s41586-020-2251-7 ",
  "metadata": {
    "Title of this paper": "Author correction: Sex-specific adipose tissue imprinting of regulatory T cells",
    "Journal it was published in:": "Science Advances",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494032/"
  }
}