{
  "title": "Paper_620",
  "abstract": "pmc Life (Basel) Life (Basel) 2582 life life Life 2075-1729 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471292 PMC12471292.1 12471292 12471292 41010386 10.3390/life15091444 life-15-01444 1 Review The Predilection of Specific Diseases to Affect Different Sections of the Esophagus Ahmed Monjur Stefan-van Staden Raluca-Ioana Academic Editor Thomas Jefferson University Hospitals, 132 South 10th Street, Philadelphia, PA 19107, USA; monjur.ahmed@jefferson.edu 15 9 2025 9 2025 15 9 497651 1444 27 7 2025 22 8 2025 08 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the author. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Certain esophageal diseases have a predilection for affecting different parts of the esophagus. This predilection is noted in our clinical practice as we investigate various esophageal diseases using multiple imaging and motility studies, as well as endoscopic procedures with biopsies. Clinical presentations vary with the stage and location of the disease. Clinicians can suspect certain diseases when a particular part of the esophagus is involved and then can perform appropriate investigations. Esophageal diseases with section involvement, with their symptomatology, diagnostic tests, and management, have been discussed in this narrative review. This review aims to revisit those diseases with a current update. predilection of esophageal diseases eosinophilic esophagitis esophageal stricture achalasia cardia gastroesophageal reflux disease esophageal cancer This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The esophagus is a tubular structure with mucosal, submucosal, muscular, and adventitial layers. Most diseases are mucosal epithelial diseases that can be easily detected with endoscopic procedures. However, many subepithelial diseases require further investigations like imaging and endoscopic ultrasound. Motility disorders are investigated by manometric studies. An interesting fact is that the different parts of the esophagus have different disease predilections. The upper esophagus is mainly affected by cricopharyngeal achalasia, esophageal web, Zenker diverticulum, dermatomyositis, and fibrovascular polyp. Traction esophageal diverticulum can affect the mid-esophagus. Lower esophageal diseases include gastroesophageal reflux disease (GERD), Barrett’s esophagus, adenocarcinoma, achalasia cardia, Schatzki’s ring, epiphrenic diverticulum, and epidermoid metaplasia. Eosinophilic esophagitis (EoE) and esophageal stricture can affect any part of the esophagus. Squamous cell cancer and lichen planus predominantly affect the proximal and mid esophagus. Esophageal leiomyoma, gastrointestinal stromal tumor (GIST) and esophageal scleroderma usually affect the lower two-thirds of the esophagus. As certain esophageal disorders tend to affect specific parts of the esophagus, this review is important in revisiting these conditions. So only these disorders are included in this review. 2. Brief Methods Electronic databases were searched to get help writing this review. These include PubMed Central Google Scholar Google and UpToDate 3. Cricopharyngeal Achalasia (CPA) The upper esophageal sphincter (UES)dv is a two to four cm high-pressure zone consisting of the inferior pharyngeal constrictor/cricopharyngeal muscle. The normal resting pressure of UES is 34 to 104 mm Hg, and the relaxation pressure is less than 12 mm Hg. However, significant variation can be observed during high-resolution manometry (HRM) [ 1 2 Symptoms: Patients typically present with oropharyngeal dysphagia. Other manifestations include coughing, gagging and choking while swallowing liquid food due to laryngeal penetration and aspiration. 3.1. Diagnosis Barium swallow shows an unduly prominent smooth posterior impression of the cricopharyngeal muscle at the level of C6 level. Video fluoroscopic swallow studies (VFSS) may show a cricopharyngeal bar at the C6 level. Upper endoscopy reveals a spastic UES that needs pressure to allow the scope to advance. High-resolution manometry is the gold standard for diagnosing CPA. It shows not only high pressure of the UES but also incomplete relaxation [ 3 3.2. Management The three treatment tools include endoscopic balloon dilation (EBD), Botulinum toxin injection (BTI) (5 IU/each quadrant), and cricopharyngeal myotomy. EBD may give temporary relief, but BTI has been associated with limited success [ 4 5 6 4. Esophageal Web This is a thin membrane 2 to 3 mm in size that protrudes into the esophageal lumen. It consists of mucosa and submucosa. Congenital esophageal webs are rare. They are generally circumferential with a central or eccentric orifice and occur in the middle or distal third of the esophagus. Acquired webs are more commonly observed in clinical practice, typically appearing in the cervical esophagus or the post-cricoid area. Common etiologies include iron deficiency anemia, bullous diseases (such as pemphigus, pemphigoid, and epidermolysis bullosa), graft-versus-host disease, and celiac disease [ 7 Symptoms: Most patients with an esophageal web remain asymptomatic. Patients present with intermittent dysphagia or painful swallowing or a feeling of food getting stuck in the esophagus when there is significant narrowing of the esophageal lumen. Diagnosis Barium Swallow: esophageal web is seen as a thin, shelf-like filling defect along the anterior wall of the upper esophagus or as a radiolucent ring in the upper esophagus. Upper endoscopy: esophageal web is visualized as a thin, smooth membrane that does not span the whole circumference of the esophagus [ 8 Management: Endoscopic dilation (either balloon or bougienage) is the treatment of choice. If endoscopic dilation is inadequate, endoscopic electrocauterization can be followed by balloon dilation [ 9 10 11 5. Zenker Diverticulum This is formed at the pharyngo-esophageal junction between the inferior pharyngeal constrictor muscle and cricopharyngeal muscle (Killian triangle or dehiscence) due to the development of high intraluminal pressure because of incoordination or spasm of the cricopharyngeal muscle or poor compliance of the upper esophageal sphincter [ 12 13 Symptoms: Patients with a small (<2 cm) Zenker diverticulum may remain completely asymptomatic. Patients with a large diverticulum generally present with dysphagia, regurgitation of undigested food, halitosis, and globus sensation in the throat. Sometimes, patients may present with aspiration pneumonia or significant weight loss [ 14 15 Diagnosis Barium Swallow is considered the gold standard in diagnosing Zenker diverticulum. It shows an outpouching of the posterior pharyngeal wall just above the upper esophageal sphincter at the level of C5–C6. The pouch has a narrow neck that allows barium to be trapped during the swallowing process. On a lateral view of the imaging, an air-fluid level can be seen within the pouch [ 16 Video fluoroscopy is a dynamic study that can image the real-time swallowing process and the Zenker’s diverticulum. Upper endoscopy is practical both for diagnostic and therapeutic purposes. It may allow visualization of the mucosa of the diverticulum, pooling of food inside the diverticulum, and fibrosis around the diverticulum [ 17 Management: Symptomatic patients with Zenker diverticulum should be treated endoscopically or surgically. The treatment of choice is flexible endoscopic myotomy. Endoscopically, about 1 cm of myotomy is performed by cutting the septum (cricopharyngeal muscle) between the esophageal lumen and Zenker diverticulum with a specialized knife (hook knife or needle knife). As a result, a common channel is formed between the esophagus and the diverticulum, allowing food to reach the esophagus easily without obstruction. Most patients get relief from dysphagia after this procedure. This procedure is less invasive, tolerated by elderly patients with comorbidities, and requires a short hospital stay [ 18 19 6. Dermatomyositis This can affect the striated muscles of the pharynx and upper esophagus due to inflammatory myopathy. Complement (C5b-9) mediated microangiopathy leads to capillary loss, ischemia, and muscle fiber necrosis [ 20 21 Symptoms: Patients usually present with oropharyngeal dysphagia that can result in a choking sensation, nasal regurgitation, aspiration pneumonia, and significant weight loss. Diagnosis Serology: serum creatinine phosphokinase (CPK), aldolase, lactate dehydrogenase (LDH), aspartate aminotransferase (AST), and alanine aminotransferase (ALT) will be elevated. Anti-transcription intermediary factor 1γ (TIF-1γ) antibody can be positive in more than 80% of patients. Video fluoroscopy swallow study: classic findings include pharyngeal pooling and/or nasal regurgitation [ 22 Manometry reveals decreased upper esophageal sphincter pressure, low amplitude or absent contraction of pharynx and upper esophagus [ 23 Management: High-dose corticosteroids are the first-line treatment. If the patient is resistant to corticosteroids, alternative therapies such as azathioprine, methotrexate, cyclophosphamide, or cyclosporin A can be considered [ 24 25 7. Fibrovascular Polyps or Fibroepithelial Polyps These are rare, benign intraluminal pedunculated tumor-like lesions that arise from the lamina propria or submucosa and can grow to a considerable length inside the esophagus. Approximately 80% of the time, they originate in the upper esophagus, just distal to the cricopharyngeal muscle, and extend caudally due to the propulsive effect of swallowing. Histologically, the polyp is composed of fibrovascular tissue with some lipomatous and myomatous changes, all covered by normal squamous epithelium [ 26 Symptoms: Patients may remain asymptomatic if the polyps are small. As the polyp grows bigger, patients generally present with dysphagia, regurgitation, hiccup and weight loss. Sometimes, the polyp may protrude into the mouth cavity and can obstruct the airway, causing fatal asphyxiation [ 27 Diagnosis: Imaging studies, such as a barium swallow or CT scan, may reveal a filling defect in the upper esophagus. Upper endoscopy can visualize the mobile polyp in the esophagus [ 28 Management: The treatment of choice is complete surgical resection of the polyp via lateral cervical esophagotomy or thoracotomy, as the polyp is highly vascular. Recurrence of the polyp following surgical resection is rare [ 29 30 8. Squamous Cell Carcinoma of the Esophagus This can occur at any part of the esophagus but is primarily seen in the upper or mid-esophagus. Globally, this is the most common type of esophageal carcinoma. Risk factors for developing esophageal carcinoma include tobacco smoking, alcohol consumption, organ transplantation, diets low in fruits and vegetables and high in processed food, consumption of very hot beverages and foods, people living in highly endemic areas like ‘esophageal cancer belt’ (Northern Iran, Central Asia and North-Central China), iron deficiency anemia with cricopharyngeal web, folate, selenium, zinc deficiency, corrosive injury to the esophagus, achalasia cardia, human papilloma virus infection, particularly serotype 16 and 18, Tylosis, history of head and neck (oral cavity, pharynx, larynx) or lung cancer, celiac disease, esophageal lichen planus, esophageal epidermoid metaplasia, Peutz-Jeghers syndrome and PTEN hamartoma tumor syndromes (e.g., Cowden syndrome) [ 31 32 33 34 Symptoms: Patients generally present with progressive dysphagia and weight loss. Initially, the dysphagia is only to solid food, but as the disease progresses, the patient develops both solid and liquid food dysphagia. In the advanced stage, patients may present with hematemesis or melena due to ulceration of the tumor. If the cancer invades the recurrent laryngeal nerve, patients may present with cough or hoarseness of voice [ 35 Diagnosis: Imaging studies, such as a barium swallow and CT scan, may help detect the tumor in the esophagus. Upper endoscopy with biopsy is the gold standard in establishing the diagnosis [ 36 Management: involves a multimodality approach, depending on the tumor stage and host factors [ 37 Early-stage cancer: Endoscopic resection is the treatment of choice if the tumor is confined to the mucosa (T1, N0, M0). Esophagectomy is recommended if there is submucosal invasion of cancer. Locally advanced disease (T2 or higher, N+. M0): Neoadjuvant chemoradiotherapy (CRT) therapy followed by esophagectomy is recommended by the American Society of Clinical Oncology. Improved survival has been observed with the use of carboplatin and paclitaxel in the neoadjuvant regimen. Definitive CRT is considered when patients are not surgical candidates or do not wish to undergo esophagectomy [ 38 Metastatic or unresectable disease: The standard of care is definitive CRT. Cisplatin and 5-fluorouracil (CF) are commonly used chemotherapeutic agents. A combination of chemotherapy and checkpoint inhibitors (Ipilimumab or Nivolumab) has shown a survival benefit in metastatic disease [ 39 9. Eosinophilic Esophagitis (EoE) This is a food-related, chronic, immune-mediated inflammatory disorder of the esophagus that affects both children and adults and is widely distributed throughout the world. It is most commonly seen between the ages of 30 and 50. The incidence of EoE is approximately 1 in 10,000 new cases per year. The prevalence of EoE in the United States is approximately 142.5 cases per 100,000 people [ 40 41 42 43 Symptoms: The most common symptoms of EoE in adults are dysphagia and food impaction [ 44 45 46 Diagnosis: The diagnosis of eosinophilic esophagitis (EoE) is established when the patient presents with signs of esophageal dysfunction, such as dysphagia. This diagnosis is supported by the presence of specific endoscopic features, which may include edema, rings, exudates, linear furrows, white plaques, and strictures ( Figure 1 47 Management: The management of EoE needs a multidisciplinary approach. Drugs, diet, and dilation are the three primary modalities of therapy. The drugs used in EoE include PPI, topical steroid preparations (fluticasone and budesonide), and dupilumab. High-dose PPI (Omeprazole 40 mg twice daily or equivalent) is considered the initial treatment of choice for 8 to 12 weeks, given its availability, low cost, and favorable safety profile. Symptomatic improvement occurs in 40 to 50% of patients, and histologic improvement (<15 eosinophils per HPF on esophageal biopsy) occurs in 41.7% of patients [ 48 49 50 51 52 53 10. Esophageal Leiomyoma This occurs in less than 1% of all esophageal neoplasms. It is the most common benign esophageal mesenchymal tumor. The most common site of esophageal leiomyoma is the distal two-thirds of the esophagus. It is a slow-growing tumor with a low chance of malignancy. It is a well-circumscribed spindle cell tumor arising from the muscularis propria or muscularis mucosae of the esophagus. Sometimes, it can grow to a large size, exceeding 10 cm, and is then referred to as a giant leiomyoma of the esophagus [ 54 Symptoms: Most esophageal leiomyomas are small (<5 cm), and patients remain asymptomatic for an extended period. Large leiomyomas can cause dysphagia or chest pain. They are more common in males than in females (2:1), with the usual age of presentation ranging from 20 to 50 years. Diagnosis: Esophageal leiomyoma can be detected through imaging studies, such as a chest X-ray, barium swallow, CT scan, or MRI scan. A chest X-ray may show a posterior mediastinal mass. A partial luminal filling defect is seen on a Barium Swallow. A CT scan may show a hypodense or iso-dense intramural smooth, eccentric lesion of varying size arising from the muscular propria or muscularis mucosae. MRI may reveal the lesion as slightly hyperintense [ 55 56 57 Management: If the patient is asymptomatic, the patient can be observed clinically without intervention. Symptomatic and large (>5 cm) leiomyomas need to be enucleated. Enucleation can be performed surgically or endoscopically. Thoracoscopic enucleation or laparoscopic transhiatal enucleation is an effective minimally invasive surgical approach for treating esophageal leiomyoma. In selected cases, submucosal tunneling endoscopic resection (STER) is being increasingly performed with similar efficacy to surgical enucleation [ 58 59 11. Esophageal GIST This is rare, accounting for less than 5% of all GISTs. The usual site is the distal or middle third of the esophagus. It is a subepithelial, well-circumscribed tumor that arises from interstitial cells of Cajal in the muscularis propria or muscularis mucosae. It is a slow-growing spindle cell tumor with potential for malignancy. It equally affects males and females. The average age of diagnosis is 60 years. The risk stratification depends on tumor size and mitotic index. Tumor size greater than 5 cm and a mitotic count greater than 5 per 50 high-power field indicate a high-risk group [ 60 Symptoms: Patients with small esophageal GIST typically remain asymptomatic. Occasionally, they are identified during imaging studies (like a CT scan) or an upper endoscopy. As the tumor grows bigger, patients may present with dysphagia, chest pain, or upper gastrointestinal bleeding. Diagnosis: CT with contrast can identify GIST as an intramural endophytic or exophytic lesion arising from the muscular layer of the esophagus. Upper endoscopy shows a well-circumscribed spherical or hemispherical smooth subepithelial lesion in the esophagus. Endosonographically, the lesion appears as inhomogeneous and hypoechoic, arising from the muscularis propria or rarely from the muscularis mucosae. Tissue acquisition is performed by EUS-guided FNA or true-cut biopsy (TCB). Histopathology shows spindle cell, epithelioid, or mixed morphology, and immunohistochemical staining is positive for KIT (CD117), CD34 (expressed in 75% of cases), DOG1 (expressed in 65 to 100% of cases), and PDGFRA (expressed in 15% of cases) [ 61 Management: Symptomatic esophageal GIST can be managed surgically or endoscopically. Surgical enucleation is the treatment of choice for small GISTs, while esophagectomy is recommended for larger GISTs. Small, low-risk GIST can be treated with STER, which is now considered an effective and safe treatment option. For high-risk cases, adjuvant therapy with the tyrosine kinase inhibitor (TKI) imatinib is recommended after resection of GIST for at least 3 years. Imatinib is also recommended for the treatment of unresectable, recurrent, and metastatic GIST as a standard of care. Molecular profiling should be performed before initiating therapy, as patients with PDGFRA mutations are resistant to imatinib therapy. In patients without PDGFRA mutation, imatinib is the first-line therapy. In imatinib-resistant or intolerant GIST, sunitinib (a multitargeted TKI) is the next treatment option. Regorafenib (another multitargeted TKI) should be given to patients previously treated with imatinib and sunitinib. In cases of large GIST, neoadjuvant therapy with TKI is recommended for a duration of 6 to 12 months preoperatively to downsize the GIST, facilitating resection or preserving organ function [ 62 12. Traction Esophageal Diverticulum (TED) This accounts for 15% of all esophageal diverticula. It is a true mid-esophageal diverticulum, i.e., it involves all the layers of the esophageal wall and is caused by traction from mediastinal inflammation. Granulomatous disorders, such as sarcoidosis, histoplasmosis, and tuberculosis, can lead to mediastinal lymphadenitis and subsequent fibrosis. The fibrosis can pull the esophageal wall outward, forming a broad-mouthed, triangular, or polygonal diverticulum. The mechanism of formation of TED is different from that of pulsion diverticuli (Zenker diverticulum, epiphrenic diverticulum) which are formed by increased intraluminal pressure because of esophageal dysmotility and involve only mucosa and submucosa (pseudo-diverticuli). Symptoms: Most patients with TED are asymptomatic and are diagnosed incidentally during imaging studies or endoscopy. Generally, patients are elderly with prior history of granulomatous disorders. Rarely, patients may present mild dysphagia, regurgitation, or chest discomfort. Diagnosis: A barium esophagogram is the gold standard for diagnosing TED. CT chest shows a well-defined, saccular outpouching arising from the mid-esophagus near the carina or mainstem bronchus. Adjacent mediastinal fibrosis can also be visible. Upper endoscopy can confirm the diagnosis. Management: No treatment is needed in asymptomatic cases. Surgical intervention like diverticulectomy with or without myotomy should be considered in symptomatic cases [ 63 13. Esophageal Lichen Planus (ELP) This is a rare, chronic inflammatory condition of the esophagus, primarily seen in the proximal or mid esophagus. Middle-aged and elderly females are commonly affected. It is often associated with oral lichen planus, sometimes with cutaneous or genital lichen planus. The exact pathogenesis of ELP is unknown. The current understanding is that it is a T-cell-mediated autoimmune disease. Certain environmental factors like virus (particularly hepatitis C virus, COVID-19 virus), medications (like antimalarials, non-steroidal anti-inflammatory drugs, thiazide diuretics, angiotensin converting enzyme inhibitors, beta-blockers, quinidine, and anti-tumor necrosis factors), and dental restoration materials (like copper, mercury and gold) alter the epithelial cell antigens on the mucosal surface of esophagus. This alteration triggers cytotoxic T-lymphocytes, which attack the epithelial cells and cause apoptosis, resulting in a characteristic appearance. The immune response becomes chronic, resulting in chronic inflammation with subsequent consequences, such as stricture and cancer [ 64 Symptoms: Patients can be asymptomatic, but 80% of patients with ELP may present with dysphagia. Other symptoms include odynophagia, heartburn, and regurgitation. Diagnosis: ELP is generally suspected based on endoscopic appearance and then confirmed by taking a biopsy and examining the histology. The endoscopic appearance includes a white, lacy appearance ( Figure 2 65 66 Management: Currently, there is no accepted guideline for the treatment of ELP. Topical corticosteroids, such as budesonide oral suspension (3 mg twice daily) or inhaled fluticasone (880 μg twice daily), have been shown to cause clinical and/or endoscopic improvement in 62–74% of cases [ 67 68 69 66 14. Esophageal Stricture (ES) The prevalence of ES in the United States ranges from 1 in 100 to 1 in 1000 patients. It was 203.14 cases/100,000 people in 2021, as per MarketScan databases [ 70 Etiology: Peptic esophageal stricture due to gastroesophageal reflux disease (GERD) is the most common cause, accounting for 70–80% of adult cases [ 71 72 73 74 75 76 77 78 79 80 81 82 83 Pathophysiology: Benign ES generally occurs secondary to the long-standing inflammatory process in the esophagus wall, irrespective of the underlying etiology. Chronic inflammation leads to intramural fibrosis, which subsequently narrows the esophageal lumen. Malignant ES usually occurs due to adenocarcinoma (involving the lower third of the esophagus) or squamous cell carcinoma of the esophagus (involving the middle or upper third of the esophagus). Rarely, pulmonary or mediastinal malignancy or enlarged mediastinal lymph node can affect the esophagus, leading to stricture. Classification: ES are broadly classified into simple strictures and complex strictures. Simple structures are characterized by short (<2 cm), symmetrical, focal, and straight strictures (luminal diameter > 12 mm) with smooth surfaces and borders. Common causes of simple esophageal strictures include peptic esophageal strictures and EoE-induced strictures. Complex esophageal strictures are long (>2 cm), asymmetrical or angulated, and narrower (<12 mm) with uneven surfaces and borders [ 84 85 86 87 88 Type I or mild stricture: length < 2 cm, 9 to 12 mm diameter, and uncomplicated to dilate. Type II or moderate stricture: length 2 to 4 cm, diameter 5 to 8 mm, and requires more aggressive dilation. Type III or severe stricture: length > 4 cm, diameter < 5 mm, refractory to simple dilation, and may require advanced interventions like stricturotomy, stenting, or esophageal resection. A multivariable analysis performed at Mayo Clinic recently showed a strong predictive model associated with a higher risk of refractory benign ES if the stricture length is ≥2cm, the diameter is ≤7 mm and based on the proximal location of the stricture or diffuse stricture [ 89 Symptoms: Dysphagia, i.e., difficulty swallowing food or delay in the passage of food through the esophagus, is ES’s most common symptom. Although the standard diameter of the esophageal lumen is 30 mm, solid food dysphagia occurs when it narrows beyond 12 mm. With the progression of stricture, patients develop difficulty swallowing a semisolid to liquid diet. Ogilvie dysphagia score is shown below [ 90 Ogilvie dysphagia score (range 0–4) 0 = no dysphagia 1 = normal diet, avoiding certain foods 2 = semisolid food only 3 = liquids only 4 = complete dysphagia, even for liquids Patients may have other associated symptoms due to underlying causes of ES. Patients with GERD can have a history of long-standing or uncontrolled heartburn in the past. Patients with EoE may give a history of prior food bolus impaction, bronchial asthma, atopic dermatitis, or chronic spontaneous urticaria. Patients with underlying malignancy may suffer from anorexia and weight loss. A history of prior surgery, endoscopic intervention, radiation, or medication can give essential clues to the diagnosis of esophageal stricture. Irrespective of the etiology, ES causes weight loss due to inadequate food intake and poor quality of life. Diagnosis: Barium Swallow and upper endoscopy are critical tests in diagnosing ES. A barium swallow is particularly valuable in the diagnosis of suspected complex strictures. Upper endoscopy is essential to find out the underlying cause of ES; biopsy should be taken from all strictures, and it also has therapeutic options. Sometimes, it is difficult to differentiate benign from malignant ES. In cases of suspected malignant stricture with a negative mucosal biopsy, endoscopic ultrasound (EUS) with fine needle aspiration (FNA) is a crucial diagnostic tool [ 91 92 Management: The main principle of treating ES is symptomatic improvement with relief of dysphagia. The treatment of symptomatic ES depends on whether it is a benign or malignant lesion. The treatment modalities for benign ES include drugs, dilation, stricturotomy, and surgery. Drugs: High-dose, long-term proton pump inhibitors (PPIs) should be administered for peptic esophagitis [ 93 94 95 96 83 97 Dilation: Endoscopic dilation of a benign ES (either by balloon or bougie) is considered the first-line treatment to improve dysphagia. Bougie (push-type dilators: wire-guided Savary-Gilliard dilator or blind Maloney dilator) dilators exert radial and longitudinal force, whereas through the scope (TTS), pneumatic or balloon dilators only exert radial force. Maloney dilatators are suitable for distal single strictures with a luminal diameter of 10 mm or more. In the case of mid-esophageal or proximal ES, a pneumatic or Savary-Gilliard dilator should be used. Fluoroscopy should be used in case of complex ES. It can help the advancement of the guidewire and the balloon catheter through the stricture. It can also assess the length and diameter of the stricture before and after dilation, as well as the presence of any fistula and post-dilation extravasation of contrast. The ultimate goal is to achieve a luminal diameter of 14 mm or more so the patient can tolerate a regular diet. It is recommended to pass no more than 3 dilators of progressively larger diameter (with an increment of 1.5 mm) per session (rule of three) in the presence of moderate to severe resistance to avoid adverse effects like perforation of the esophagus [ 98 99 100 71 Stenting: If the stricture is refractory, recurrent, and/or non-responsive to steroid injection, temporary (at least 6–8 weeks, maximum 3 months) placement of a fully covered self-expanding metal stent (FCSEMS) made of mostly nitinol or a self-expanding plastic stent (SEPS) made of silicone with polyester braid or a biodegradable esophageal stent (BDS) should be considered [ 101 102 103 104 105 Endoscopic stricturotomy/strctureplasty/electroincision is an endoscopic procedure in which the fibrous tissue under the mucosa at the most prominent part of the esophageal stricture is carefully cut in layers with a needle knife in a circumferential manner (electrocautery technique). Endoscopic ultrasound with a linear probe can be performed before this procedure to evaluate the wall thickness of the stricture [ 106 107 108 Surgery is considered as the last resort when endoscopic therapy fails. A laparoscopic or open esophageal resection is performed for distal ES. Partial or complete fundoplication is performed simultaneously in the case of peptic ES [ 109 110 111 112 Malignant ES is managed by stent placement, chemoradiation, or surgery. If the patient’s life expectancy is less than 3 months or if the malignancy is inoperable, palliative self-expanding metal stent (Wallstent, Ultraflex stent, or Niti-S) placement can expand the esophageal lumen and rapidly improve the patient’s dysphagia. Esophageal brachytherapy is mainly used in patients with a life expectancy of more than 3 months [ 113 99 15. GERD This is a common disease in which reflux of gastric contents into the esophagus results in symptoms and/or complications [ 114 115 116 Symptoms: Heartburn and acid regurgitation are the classic symptoms of GERD. Non-cardiac retrosternal chest pain is another frequent symptom of GERD. Sometimes, patients may present with extra-esophageal symptoms, such as chronic cough, wheezing, hoarseness of voice due to posterior laryngitis, and globus sensation (i.e., a feeling of a lump in the throat). Patients may also report dysphagia, odynophagia and upper gastrointestinal bleeding. Complications: GERD decreases patients’ health-related quality of life. Esophageal complications of GERD include erosive esophagitis, esophageal ulcer, esophageal stricture, and Barrett’s esophagus (i.e., standard lining of stratified squamous epithelium in the distal esophagus is replaced by a metaplastic simple columnar epithelium with mucin-secreting goblet cells, also called specialized intestinal metaplasia) that may lead to esophageal adenocarcinoma [ 117 118 LA classification ( Figure 3 Grade A: 5 mm or less erosion in mucosal folds Grade B: Erosion > 5 mm in mucosal folds but no continuity between folds Grade C: Mucosal erosion is continuous between 2 or more mucosal folds but involving less than 75% of the circumference. Grade D: All-around mucosal erosion involving more than 75% of the esophageal circumference. Diagnosis: is based on clinical presentation, response to acid suppressant therapy, endoscopic evidence and objective evidence of pathological acid reflux. Although heartburn and regurgitation are suggestive of GERD, they are neither sensitive nor specific enough to establish the diagnosis of GERD in isolation. Again, positive or negative response to proton pump inhibitor (PPI) therapy cannot confirm or exclude the diagnosis of GERD, respectively. PPI non-responders should have upper endoscopy. Endoscopic evidence of GERD includes LA grade B, C, or D erosive esophagitis ( Figure 3 119 120 121 Management: includes lifestyle modification, medical, surgical, and endoscopic therapy for the treatment of GERD. Lifestyle modification: The most substantial evidence of benefit includes avoiding food intake within 3 h of bedtime, elevating the head of the bed by 6 to 8 inches, and weight loss in individuals who are overweight or have recently gained weight. Other recommendations include avoiding tobacco products/smoking cigarettes, drinking alcohol, high-fat and spicy food, caffeine, chocolate, peppermint, carbonated beverages, citrus juices, onions, tomato paste, or any trigger food. Medications (such as certain calcium channel blockers, tricyclic antidepressants, anticholinergics, theophylline, sildenafil, progesterone, and benzodiazepines) that can lower the LES should also be avoided. The patient should also engage in stress reduction measures. Chewing gum may help salivary secretion, which can neutralize acid reflux [ 122 Medication: Patients with classic symptoms of GERD without any alarm features should be given empiric PPI therapy once a day, 30 to 60 min before a meal, for 8 weeks. Attempt should be made to discontinue PPI therapy in patients who respond to the empiric PPI trial. Patients with LA grade C or D esophagitis should be offered PPI maintenance therapy indefinitely or anti-reflux surgery. For maintenance therapy, PPI should be given at the lowest effective dose that can control GERD symptoms and maintain healing of reflux esophagitis. Long-term PPI therapy outweighs the theoretical risks and side effects. Patients with heartburn due to non-erosive reflux disease (NERD) should be given intermittent or on-demand PPI therapy. Baclofen is not recommended in patients without any objective evidence of GERD. Patients with typical GERD symptoms and extra-esophageal manifestations should be given PPIs twice daily for 8 to 12 weeks before performing endoscopy. An esophageal pH study should be performed in patients with extra-esophageal manifestations who do not exhibit classic symptoms of GERD before initiating PPI therapy. PPI therapy should be discontinued in patients with refractory classic symptoms of GERD but have normal pH study off PPI therapy, and normal pH/impedance study on PPI therapy. Surgical therapy: Anti-reflux surgery (laparoscopic fundoplication) is indicated in patients with persistent symptoms despite optimal dose of PPI therapy, LA grade C or D esophagitis and large hiatus hernia. Roux-en-Y gastric bypass surgery should be considered in morbidly obese patients with GERD who are candidates for bariatric surgery. Endoscopic therapy: Transoral incisionless fundoplication (TIF) is an effective endoscopic procedure in which anti-reflux valve at the gastroesophageal junction is reconstructed. It should be considered in patients who have troublesome heartburn or regurgitation despite PPI therapy. Still, they do not have LA grade C or D esophagitis or hiatus hernia > 2 cm and do not want anti-reflux surgery [ 123 16. Barrett’s Esophagus (BE) This is a condition in which the usual lining of stratified squamous epithelium in the distal esophagus is replaced by a metaplastic simple columnar epithelium with mucin-secreting goblet cells, also called specialized intestinal metaplasia. The columnar mucosa is easily recognized endoscopically by its salmon-pink color ( Figure 4 124 125 Pathogenesis and pathology: The exact pathogenesis is unknown. It is proposed to be a two-step process [ 126 127 128 129 130 Symptoms: Many Barrett’s esophagus patients are asymptomatic, and therefore the condition is under-diagnosed. BE is found in 10–15% of symptomatic GERD patients when their upper endoscopy is performed [ 131 Diagnosis: Endoscopy with biopsy is the primary method for diagnosing Barrett’s esophagus. There is displacement of the squamocolumnar junction ≥ 1 cm above the GE junction. Endoscopic grading for Barrett’s esophagus was developed and validated in the Prague classification: the circumferential extent (Prague C) and maximal extent (including tongues) of salmon-colored mucosa (Prague M) are measured [ 132 Screening: The American College of Gastroenterology (ACG) recommends screening for Barrett’s esophagus in males with chronic (>5 years) and frequent (weekly or more) symptoms of heartburn or acid regurgitation, as well as ≥2 of the following risk factors for Barrett’s esophagus or esophageal adenocarcinoma: Aged > 50 years Non-Hispanic white population Central obesity Present or history of smoking Confirmed family history of Barrett’s esophagus or esophageal adenocarcinoma in a first-degree relative. Surveillance: The main objective of surveillance of patients with BE is to detect dysplasia or adenocarcinoma at an early stage so that effective treatment can be given. One study demonstrated that endoscopic surveillance detected Barrett’s esophagus-associated adenocarcinoma at a lower stage, resulting in improved survival [ 133 134 Management: Depending on the histology of surveillance biopsies, further actions are taken: Non-dysplastic Barrett’s esophagus: endoscopic surveillance should be performed every 3–5 years as per ACG. Indefinite for dysplasia: patient should receive PPI therapy for 3–6 months. Repeat surveillance endoscopy with biopsies should then be performed. If the histology remains indefinite for dysplasia, endoscopic surveillance should be performed after 12 months. Dysplastic Barrett’s esophagus: any grade of dysplasia should be reviewed and confirmed by two pathologists, of whom at least one should be a gastrointestinal pathologist. LGD: endoscopic ablative therapy is the first choice in the absence of life-limiting comorbidity. Alternatively, endoscopic surveillance every 12 months is acceptable. HGD or intramucosal carcinoma (IMC): endoscopic ablative therapy is the treatment of choice in the absence of life-limiting comorbidity. Any nodule or mucosal abnormality should be removed by endoscopic mucosal resection (EMR). Radiofrequency ablation (RFA) using the BARRX RFA system (Medtronic, California, USA) is considered the most effective and preferred modality of endoscopic ablation therapy. It is now the standard of care in the United States. RFA is safe and highly effective in eradicating both intestinal metaplasia and dysplasia in BE [ 135 136 Nodular Barrett’s esophagus: EMR should be performed for both diagnostic and therapeutic purposes if there is any discrete nodule in the Barrett’s mucosa. If the histology of the nodule shows: HGD or IMC: the rest of the Barrett’s mucosa should be treated with endoscopic ablative therapy. Tumor invades lamina propria or muscularis mucosa (T1a) esophageal adenocarcinoma: endoscopic ablative therapy of the remaining BE is the next step. Tumor invades submucosa (T1b) esophageal adenocarcinoma: endoscopic ultrasound is usually carried out to evaluate the depth of tumor infiltration, and to biopsy local lymph nodes as there is a high rate of lymph node involvement in T1b esophageal adenocarcinoma [ 137 T1b, sm2–3 esophageal adenocarcinoma: esophagectomy with consideration of neoadjuvant therapy is the preferred treatment. Irrespective of T1a or T1b esophageal adenocarcinoma, if there is any poor differentiation of carcinoma, lymphovascular invasion, or incomplete EMR, surgery with neoadjuvant therapy should be considered. 17. Esophageal Adenocarcinoma This occurs most commonly in the lower third of the esophagus or near the gastroesophageal junction. The incidence of esophageal adenocarcinoma has increased significantly (about 5-fold) since 1970 making it the predominant subtype of esophageal carcinoma in the United States and Western countries. The risk factors include GERD, white race, male sex, tobacco smoking, obesity, and genetic factors [ 138 Symptoms: Patients with early-stage adenocarcinoma generally remain asymptomatic. They are typically detected during surveillance of Barrett’s esophagus or upper endoscopy for GERD. Patients with advanced disease generally present with dysphagia and weight loss [ 139 Diagnosis: Endoscopic biopsy establishes the diagnosis of esophageal adenocarcinoma ( Figure 5 140 Management: It depends on the stage of esophageal adenocarcinoma and the patient’s overall health. Early-stage cancer: A T1a lesion can be treated endoscopically by radiofrequency ablation. T1b lesion or higher needs to be treated by esophagectomy. Locally advanced cancer (T2 or higher, or node positive and non-metastatic) is treated by neoadjuvant chemotherapy (fluorouracil, leucovorin, oxaliplatin, and docetaxel) or chemoradiation followed by esophagectomy [ 141 142 143 Prognosis: depends on the stage of the disease. Early-stage esophageal adenocarcinoma has an excellent prognosis. In case of locally advanced disease who receive perioperative chemotherapy plus surgery have a 3-year overall survival rate of 57.4% and a 5-year overall survival of 50.6%. Achalasia cardia or cardiospasm 144 145 Etiology: The exact etiology of achalasia is unknown. Current evidence suggests that it is a multifactorial process causing autoimmune ganglionitis, possibly triggered by viral (varicella zoster, herpes simplex) infection in a genetically susceptible individual [ 146 147 Pathogenesis: There is selective loss of inhibitory neurons, which produce nitric oxide and vasoactive intestinal peptide in the myenteric plexus of the distal esophagus and LES. As a result, unopposed excitatory activity leads to spastic LES with inadequate relaxation and aperistalsis of the esophagus [ 148 Symptoms: Progressive dysphagia to both solid and liquid diet is the most common (90% of cases) symptom of achalasia. Other symptoms with prevalence include regurgitation of undigested food in 75%, weight loss in 60% and heartburn in 40% [ 149 Table 1 150 Diagnosis: Upper endoscopy is essential in suspected cases of achalasia to evaluate for any stricture at the esophagogastric junction and to rule out pseudoachalasia. It may show a dilated esophagus with retained food and fluid, as well as a spastic esophagogastric junction. However, in the early stages of achalasia, endoscopy may not reveal a dilated esophagus. Barium esophagogram may show a dilated esophagus with a bird’s beak appearance of the esophagogastric junction (EJG). However, in the early stage, a barium esophagogram may not reveal any positive findings. A timed barium esophagram (TBE) is preferable, as it quantifies esophageal emptying and can reveal abnormalities in early achalasia [ 151 Figure 6 152 2 153 Management: It is mainly focused on relieving functional obstruction of the LES. It should be individualized depending on the subtypes of achalasia and the patient’s comorbidities. The different modalities include peroral endoscopic myotomy (POEM), laparoscopic Heller myotomy, pneumatic dilation, and botulinum toxin injection. In POEM, a submucosal tunnel is created in the esophagus using an endoscope. Selective myotomy of the inner circular muscle layer of the distal esophagus and LES is performed while preserving the outer longitudinal muscle layer. It is an effective and durable treatment of all types of achalasia, particularly type III achalasia (given the potential of extending the myotomy to the distal spastic segment of the esophagus), with a clinical success rate exceeding 90%. But the risk of acid reflux following POEM for achalasia is approximately 40–65% by objective criteria, and routine post-procedure acid suppression and surveillance are recommended [ 154 155 156 157 158 18. Schatzki’s Ring This is a thin, circumferential, diaphragm-like mucosal structure located at the squamocolumnar junction of the distal esophagus, typically at or near the gastroesophageal junction. It is most associated with intermittent dysphagia to solid foods and is frequently found in conjunction with a sliding hiatal hernia [ 159 Diagnosis is usually made by barium esophagram, which is more sensitive than endoscopy, as the ring may be obscured during endoscopic insufflation. The ring typically marks the proximal margin of a hiatal hernia. Symptoms: Patients usually present with intermittent solid food dysphagia and, less commonly, acute food impaction. The etiology is not fully understood but is thought to be multifactorial, with associations to GERD, hiatal hernia, and, in some cases, eosinophilic esophagitis. Management: It is generally endoscopic dilation, which provides symptomatic relief in most patients; however, recurrence is common, and repeat dilations may be necessary. Acid suppression therapy with PPI should also be added [ 160 19. Epiphrenic Diverticulum This is a rare, pulsion-type diverticulum seen in the distal 10 cm of the esophagus just above the LES and the diaphragm. It is a pseudodiverticulum as its walls contain only mucosa and submucosa. Pathogenesis: It is almost always associated with an underlying motility disorder, such as achalasia cardia or diffuse esophageal spasm. Increased intraluminal pressure leads to herniation of mucosa and submucosa through the muscular layer at a weak point in the esophageal wall and subsequent formation of an outpouching. Symptoms: Patients remain asymptomatic majority of the time. Large diverticulum may cause regurgitation, aspiration, chest pain and dysphagia. But most of the symptoms are generally caused by an underlying motility disorder. Diagnosis: Upper endoscopy and barium swallow can identify epiphrenic diverticulum. HRM should also be conducted to determine the underlying motility disorder [ 161 Management: No treatment is indicated if the patient remains asymptomatic. In symptomatic cases, the underlying motility disorder should be managed, and the diverticulum should be treated by surgery. The surgical approach depends on the size and location of the diverticulum. The surgical modalities include diverticulectomy or laparoscopic transabdominal esophago-cardio-myotomy and fundoplication [ 162 20. Esophageal Epidermoid Metaplasia (EEM), Also Known as Esophageal Leukoplakia This is a rare condition that typically occurs in the distal or middle third of the esophagus. The exact etiology is unknown. The primary clinical concern is that it is a premalignant condition that can progress to squamous cell dysplasia and ultimately squamous cell carcinoma. Risk factors for developing EEM include cigarette smoking and alcohol intake. Symptoms: Patient may remain asymptomatic or present with GERD or dysphagia. Diagnosis: Upper endoscopy shows a white, scaly, and slightly nodular lesion ( Figure 7 163 164 Management: There are no formal treatment guidelines. As EEM is a premalignant condition, it is recommended to treat EEM by radiofrequency ablation, EMR, or ESD, particularly in the presence of dysplasia. Closed-endoscopic surveillance can be performed in non-dysplastic cases. 21. Esophageal Scleroderma Up to 90% of patients with systemic sclerosis can develop gastrointestinal manifestations, and the esophagus is the most affected organ [ 165 Pathogenesis: Autoimmune injury to the blood vessels leads to the release of proinflammatory cytokines, including interleukin (IL) -2, IL-6, IL-9, IL-1β, and IL-17. Myofibroblasts also secrete transforming growth factor (TGF)-β, connective tissue growth factor, plasminogen activator inhibitor-1, and fibronectin 1. The inflammatory cascade and repair process lead to interstitial inflammation, fibrosis, and atrophy of the esophageal smooth muscles. As a result, esophageal dysmotility characterized by esophageal aperistalsis and decreased LES pressure occurs [ 166 Symptoms: Heartburn due to GERD and dysphagia due to esophageal dysmotility are the main symptoms of esophageal scleroderma. Diagnosis: Upper endoscopy may show evidence of erosive esophagitis. The diagnosis is confirmed by HRM, which shows absent contractility with an IRP of less than 15 mmHg. 24 h pH monitoring with impedance shows evidence of gastroesophageal acid reflux [ 167 Management: It is mainly focused on the management of GERD with lifestyle modification and PPI or Potassium-competitive acid blocker (P-CAB) therapy. Nutritional support is essential as malnutrition is associated with increased mortality in this group of patients. A dietary consultation should be conducted, and oral, enteral, and parenteral support should be provided. Surgical intervention, such as fundoplication, is not recommended for patients with esophageal scleroderma [ 168 22. Summary Certain diseases are more likely to occur in specific parts of the esophagus. This predilection happens due to multiple factors, including anatomical, physiological, neurovascular supply, immunological, developmental, environmental, genetic, and other unknown factors. Patients are asymptomatic in the early stage of the disease process but become symptomatic as the disease becomes advanced. Imaging studies, endoscopy, and manometry with pH studies are the primary investigations used to diagnose various esophageal diseases. Treatment is targeted to control symptoms and resolve/stabilize the underlying pathogenesis. The prognosis varies depending on whether the disease is benign or malignant. A clear understanding of the more likely cause of the disease in specific locations of the esophagus, as seen during endoscopic procedures or imaging studies, helps gastroenterologists narrow down the differential diagnoses and better manage patients. Disclaimer/Publisher’s Note: Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Data are contained within the article. Conflicts of Interest The author declares no conflicts of interest. References 1. Rezende D.T. Herbella F.A. Silva L.C. Panocchia-Neto S. Patti M.G. Upper esophageal sphincter resting pressure varies during esophageal manometry Arq. Bras. Cir. Dig. 2014 27 182 183 10.1590/S0102-67202014000300005 25184767 PMC4676376 2. Helsper J.T. Lance J.S. Baldridge E.T. Vap J.G. Cricopharyngeal achalasia Am. J. Surg. 1974 128 521 526 10.1016/0002-9610(74)90266-9 4214210 3. Türer Ö.B. Demir N. Ciecieraga T. Günaydın R.Ö. Soyer T. Assessment of pediatric cricopharyngeal achalasia with high resolution manometry Turk. J. Pediatr. 2019 61 804 809 10.24953/turkjped.2019.05.025 32105018 4. Sewell R.K. Bauman N.M. Congenital cricopharyngeal achalasia: Management with botulinum toxin before myotomy Arch. Otolaryngol. Head. Neck Surg. 2005 131 451 453 10.1001/archotol.131.5.451 15897426 5. Lacau St Guily J. Zhang K.X. Périé S. Copin H. Butler-Browne G.S. Barbet J.P. Improvement of dysphagia following cricopharyngeal myotomy in a group of elderly patients. Histochemical and biochemical assessment of the cricopharyngeal muscle Ann. Otol. Rhinol. Laryngol. 1995 104 603 609 10.1177/000348949510400803 7639468 6. Albeniz E. Estremera-Arevalo F. Cricopharyngeal achalasia and upper oesophageal endoscopic myotomy (CP-POEM) Best Pract. Res. Clin. Gastroenterol. 2024 71 101937 10.1016/j.bpg.2024.101937 39209419 7. Sinha S.K. Nain C.K. Udawat H.P. Prasad K.K. Das R. Nagi B. Singh K. Cervical esophageal web and celiac disease J. Gastroenterol. Hepatol. 2008 23 Pt 1 1149 1152 10.1111/j.1440-1746.2008.05452.x 18554241 8. Novacek G. Plummer-Vinson syndrome Orphanet J. Rare Dis. 2006 1 36 10.1186/1750-1172-1-36 16978405 PMC1586011 9. Chao H.C. Chen S.Y. Kong M.S. Successful treatment of congenital esophageal web by endoscopic electrocauterization and balloon dilatation J. Pediatr. Surg. 2008 43 e13 e15 10.1016/j.jpedsurg.2007.08.059 18206438 10. Ohtaka M. Kobayashi S. Yoshida T. Yamaguchi T. Uetake T. Sato T. Hayashi A. Kanai M. Yamamoto T. Hatsushika K. Use of Sato’s curved laryngoscope and an insulated-tip knife for endoscopic incisional therapy of esophageal web Dig. Endosc. 2015 27 522 526 10.1111/den.12334 25131450 PMC4409093 11. Messmann H. Squamous cell cancer of the oesophagus Best Pract. Res. Clin. Gastroenterol. 2001 15 249 265 10.1053/bega.2000.0172 11355914 12. Achkar E. Zenker’s diverticulum Dig. Dis. 1998 16 144 151 10.1159/000016858 9618133 13. Klein J. Emily N.V. Clyde A.H. William E.B. Brant and Helms’ Fundamentals of Diagnostic Radiology Wolters Kluwer Alphen aan den Rijn, The Netherlands 2018 9781496367396 14. Law R. Katzka D.A. Baron T.H. Zenker’s Diverticulum Clin. Gastroenterol. Hepatol. 2014 12 1773 1782 1773–1782; quiz e111–e112 10.1016/j.cgh.2013.09.016 24055983 15. Sereke S.G. Bongomin F. Muyinda Z. Zenker’s diverticulum in an 85-year-old Ugandan man BMC Gastroenterol. 2021 21 338 10.1186/s12876-021-01914-2 34461856 PMC8406572 16. Beard K. Swanström L.L. Zenker’s diverticulum: Flexible versus rigid repair J. Thorac. Dis. 2017 9 (Suppl. 2) S154 S162 10.21037/jtd.2017.03.133 28446979 PMC5384898 17. Nesheiwat Z. Antunes C. Zenker Diverticulum StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 29763172 18. Repici A. Endoscopic treatment of zenker diverticulum Gastroenterol. Hepatol. 2010 6 628 630 21103441 PMC2978412 19. Bizzotto A. Iacopini F. Landi R. Costamagna G. Zenker’s diverticulum: Exploring treatment options Acta Otorhinolaryngol. Ital. 2013 33 219 229 24043908 PMC3773964 20. Joshi D. Mahmood R. Williams P. Kitchen P. Dysphagia secondary to dermatomyositis treated successfully with intravenous immunoglobulin: A case report Int. Arch. Med. 2008 1 12 10.1186/1755-7682-1-12 18651969 PMC2516510 21. Cheng I. Wong C.S. A systematic review and meta-analysis on the prevalence and clinical characteristics of dysphagia in patients with dermatomyositis Neurogastroenterol. Motil. 2023 35 e14572 10.1111/nmo.14572 37010885 22. Mugii N. Hasegawa M. Matsushita T. Hamaguchi Y. Oohata S. Okita H. Yahata T. Someya F. Inoue K. Murono S. Oropharyngeal Dysphagia in Dermatomyositis: Associations with Clinical and Laboratory Features Including Autoantibodies PLoS ONE 2016 11 e0154746 10.1371/journal.pone.0154746 27167831 PMC4864367 23. Ebert E.C. Review article: The gastrointestinal complications of myositis Aliment. Pharmacol. Ther. 2010 31 359 365 10.1111/j.1365-2036.2009.04190.x 19886949 24. Choy E.H. Hoogendijk J.E. Lecky B. Winer J.B. Immunosuppressant and immunomodulatory treatment for dermatomyositis and polymyositis Cochrane Database Syst. Rev. 2005 CD003643 Erratum in Cochrane Database Syst. Rev. 2009 10.1002/14651858.CD003643.pub3 16034905 25. Marie I. Hachulla E. Levesque H. Reumont G. Ducrotte P. Cailleux N. Hatron P.Y. Devulder B. Courtois H. Intravenous immunoglobulins as treatment of life threatening esophageal involvement in polymyositis and dermatomyositis J. Rheumatol. 1999 26 2706 2709 10606390 26. Sultan P.K. Meyers B.F. Patterson G.A. Cooper J.D. Fibrovascular polyps of the esophagus J. Thorac. Cardiovasc. Surg. 2005 130 1709 1710 10.1016/j.jtcvs.2005.05.043 16308020 27. Caceres M. Steeb G. Wilks S.M. Garrett H.E. Jr. Large pedunculated polyps originating in the esophagus and hypopharynx Ann. Thorac. Surg. 2006 81 393 396 10.1016/j.athoracsur.2005.05.106 16368421 28. Dutta R. Kumar A. Handa K.K. Dinda A.K. Large pedunculated fibrovascular polyp of oesophagus in a young woman Interact. Cardiovasc. Thorac. Surg. 2009 9 352 353 10.1510/icvts.2009.207696 19457898 29. Drenth J. Wobbes T. Bonenkamp J.J. Nagengast F.M. Recurrent esophageal fibrovascular polyps: Case history and review of the literature Dig. Dis. Sci. 2002 47 2598 2604 10.1023/A:1020592900552 12452402 30. Ward M.A. Beard K.W. Teitelbaum E.N. Sharata A.M. Dunst C.M. Swanstrom L.L. Reavis K.M. Endoscopic resection of giant fibrovascular esophageal polyps Surg. Endosc. 2018 32 1066 1067 10.1007/s00464-017-5664-0 28643073 31. Codipilly D.C. Wang K.K. Squamous Cell Carcinoma of the Esophagus Gastroenterol. Clin. N. Am. 2022 51 457 484 10.1016/j.gtc.2022.06.005 36153105 32. Abnet C.C. Arnold M. Wei W.Q. Epidemiology of Esophageal Squamous Cell Carcinoma Gastroenterology 2018 154 360 373 10.1053/j.gastro.2017.08.023 28823862 PMC5836473 33. Ruol A. Rampado S. Parenti A. Portale G. Giacomelli L. Battaglia G. Cagol M. Ancona E. Caustic ingestion and oesophageal cancer: Intra- and peri-tumoral fibrosis is associated with a better prognosis Eur. J. Cardiothorac. Surg. 2010 38 659 664 10.1016/j.ejcts.2010.03.057 20452236 34. Ravi K. Codipilly D.C. Sunjaya D. Fang H. Arora A.S. Katzka D.A. Esophageal Lichen Planus Is Associated With a Significant Increase in Risk of Squamous Cell Carcinoma Clin. Gastroenterol. Hepatol. 2019 17 1902 1903.e1 10.1016/j.cgh.2018.10.018 30342260 35. Rustgi A.K. El-Serag H.B. Esophageal carcinoma N. Engl. J. Med. 2014 371 2499 2509 10.1056/NEJMra1314530 25539106 36. Yip H.C. Chiu P.W. Endoscopic diagnosis and management of early squamous cell carcinoma of esophagus J. Thorac. Dis. 2017 9 (Suppl. 8) S689 S696 10.21037/jtd.2017.06.57 28815064 PMC5538983 37. Wang K.K. Wongkeesong M. Buttar N.S. American Gastroenterological Association American Gastroenterological Association medical position statement: Role of the gastroenterologist in the management of esophageal carcinoma Gastroenterology 2005 128 1468 1470 10.1053/j.gastro.2005.03.076 15887128 38. Hngorani M. Jain P. The role of surgery or definitive chemoradiotherapy in management of localized squamous cell carcinoma of esophagus—What is the verdict? Crit. Rev. Oncol. Hematol. 2023 190 104111 10.1016/j.critrevonc.2023.104111 37660931 39. Waters J.K. Reznik S.I. Update on Management of Squamous Cell Esophageal Cancer Curr. Oncol. Rep. 2022 24 375 385 10.1007/s11912-021-01153-4 35142974 40. Dellon E.S. Jensen E.T. Martin C.F. Shaheen N.J. Kappelman M.D. Prevalence of eosinophilic esophagitis in the United States Clin. Gastroenterol. Hepatol. 2014 12 589 596.e1 10.1016/j.cgh.2013.09.008 24035773 PMC3952040 41. Dellon E.S. Gonsalves N. Hirano I. Furuta G.T. Liacouras C.A. Katzka D.A. American College of Gastroenterology ACG clinical guideline: Evidenced based approach to the diagnosis and management of esophageal eosinophilia and eosinophilic esophagitis (EoE) Am. J. Gastroenterol. 2013 108 679 692 679–692; quiz 693 10.1038/ajg.2013.71 23567357 42. Litosh V.A. Rochman M. Rymer J.K. Porollo A. Kottyan L.C. Rothenberg M.E. Calpain-14 and its association with eosinophilic esophagitis J. Allergy Clin. Immunol. 2017 139 1762 1771.e7 10.1016/j.jaci.2016.09.027 28131390 PMC5461191 43. Massironi S. Mulinacci G. Gallo C. Elvevi A. Danese S. Invernizzi P. Vespa E. Mechanistic Insights into Eosinophilic Esophagitis: Therapies Targeting Pathophysiological Mechanisms Cells 2023 12 2473 10.3390/cells12202473 37887317 PMC10605530 44. Dellon E.S. Muir A.B. Katzka D.A. Shah S.C. Sauer B.G. Aceves S.S. Furuta G.T. Gonsalves N. Hirano I. ACG Clinical Guideline: Diagnosis and Management of Eosinophilic Esophagitis Am. J. Gastroenterol. 2025 120 31 59 10.14309/ajg.0000000000003194 39745304 45. Dellon E.S. Epidemiology of eosinophilic esophagitis Gastroenterol. Clin. N. Am. 2014 43 201 218 10.1016/j.gtc.2014.02.002 24813510 PMC4019938 46. Dellon E.S. Eosinophilic esophagitis: Diagnostic tests and criteria Curr. Opin. Gastroenterol. 2012 28 382 388 10.1097/MOG.0b013e328352b5ef 22450900 PMC4591255 47. Gonsalves N.P. Aceves S.S. Diagnosis and treatment of eosinophilic esophagitis J. Allergy Clin. Immunol. 2020 145 1 7 10.1016/j.jaci.2019.11.011 31910983 PMC6986782 48. Muir A. Falk G.W. Eosinophilic Esophagitis: A Review JAMA 2021 326 1310 1318 10.1001/jama.2021.14920 34609446 PMC9045493 49. Franciosi J.P. Mougey E.B. Dellon E.S. Gutierrez-Junquera C. Fernandez-Fernandez S. Venkatesh R.D. Gupta S.K. Proton Pump Inhibitor Therapy for Eosinophilic Esophagitis: History, Mechanisms, Efficacy, and Future Directions J. Asthma Allergy 2022 15 281 302 10.2147/JAA.S274524 35250281 PMC8892718 50. Van Rhijn B.D. Weijenborg P.W. Verheij J. van den Bergh Weerman M.A. Verseijden C. van den Wijngaard R.M. de Jonge W.J. Smout A.J. Bredenoord A.J. Proton pump inhibitors partially restore mucosal integrity in patients with proton pump inhibitor-responsive esophageal eosinophilia but not eosinophilic esophagitis Clin. Gastroenterol. Hepatol. 2014 12 1815 1823.e2 10.1016/j.cgh.2014.02.037 24657840 51. Dellon E.S. Rothenberg M.E. Collins M.H. Hirano I. Chehade M. Bredenoord A.J. Lucendo A.J. Spergel J.M. Aceves S. Sun X. Dupilumab in Adults and Adolescents with Eosinophilic Esophagitis N. Engl. J. Med. 2022 387 2317 2330 10.1056/NEJMoa2205982 36546624 52. Votto M. De Filippo M. Lenti M.V. Rossi C.M. Di Sabatino A. Marseglia G.L. Licari A. Diet Therapy in Eosinophilic Esophagitis. Focus on a Personalized Approach Front. Pediatr. 2022 9 820192 10.3389/fped.2021.820192 35127602 PMC8812465 53. Lucendo A.J. Molina-Infante J. Esophageal dilation in eosinophilic esophagitis: Risks, benefits, and when to do it Curr. Opin. Gastroenterol. 2018 34 226 232 10.1097/MOG.0000000000000442 29846259 54. Kandasamy D. Ahamed N. Kannan S. Samuel V. Giant Leiomyoma of the Oesophagus J. Clin. Diagn. Res. 2017 11 PD07 PD08 10.7860/JCDR/2017/24206.9565 28571208 PMC5449854 55. Yang P.S. Lee K.S. Lee S.J. Kim T.S. Choo I.W. Shim Y.M. Kim K. Kim Y. Esophageal leiomyoma: Radiologic findings in 12 patients Korean J. Radiol. 2001 2 132 137 10.3348/kjr.2001.2.3.132 11752983 PMC2718110 56. Alkhatib A.A. Faigel D.O. Endoscopic ultrasonography-guided diagnosis of subepithelial tumors Gastrointest. Endosc. Clin. N. Am. 2012 22 187 205 187–205, vii 10.1016/j.giec.2012.04.006 22632943 57. Weiss S.W. Langloss J.M. Enzinger F.M. Value of S-100 protein in the diagnosis of soft tissue tumors with particular reference to benign and malignant Schwann cell tumors Lab. Investig. 1983 49 299 308 6310227 58. Jacobson B.C. Bhatt A. Greer K.B. Lee L.S. Park W.G. Sauer B.G. Shami V.M. ACG Clinical Guideline: Diagnosis and Management of Gastrointestinal Subepithelial Lesions Am. J. Gastroenterol. 2023 118 46 58 10.14309/ajg.0000000000002100 36602835 59. Mathew G. Osueni A. Carter Y.M. Esophageal Leiomyoma StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 29083588 60. Pence K. Correa A.M. Chan E. Khaitan P. Hofstetter W. Kim M.P. Management of esophageal gastrointestinal stromal tumor: Review of one hundred seven patients Dis. Esophagus 2017 30 1 5 10.1093/dote/dox064 28881878 61. Ahmed M. Recent advances in the management of gastrointestinal stromal tumor World J. Clin. Cases 2020 8 3142 3155 10.12998/wjcc.v8.i15.3142 32874969 PMC7441252 62. Von Mehren M. Joensuu H. Gastrointestinal Stromal Tumors J. Clin. Oncol. 2018 36 136 143 10.1200/JCO.2017.74.9705 29220298 PMC6553810 63. Dado G. Bresadola V. Terrosu G. Bresadola F. Diverticulum of the midthoracic esophagus: Pathogenesis and surgical treatment Surg. Endosc. 2002 16 871 10.1007/s00464-001-4217-7 11997849 64. Arnold D.L. Krishnamurthy K. Lichen Planus StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 30252382 65. Decker A. Schauer F. Lazaro A. Monasterio C. Schmidt A.R. Schmitt-Graeff A. Kreisel W. Esophageal lichen planus: Current knowledge, challenges and future perspectives World J. Gastroenterol. 2022 28 5893 5909 10.3748/wjg.v28.i41.5893 36405107 PMC9669830 66. Oliveira J.P. Uribe N.C. Abulafia L.A. Quintella L.P. Esophageal lichen planus An. Bras. Dermatol. 2015 90 394 396 10.1590/abd1806-4841.20153255 26131872 PMC4516088 67. Kern J.S. Technau-Hafsi K. Schwacha H. Kuhlmann J. Hirsch G. Brass V. Deibert P. Schmitt-Graeff A. Kreisel W. Esophageal involvement is frequent in lichen planus: Study in 32 patients with suggestion of clinicopathologic diagnostic criteria and therapeutic implications Eur. J. Gastroenterol. Hepatol. 2016 28 1374 1382 10.1097/MEG.0000000000000732 27580215 68. Podboy A. Sunjaya D. Smyrk T.C. Murray J.A. Binder M. Katzka D.A. Alexander J.A. Halland M. Oesophageal lichen planus: The efficacy of topical steroid-based therapies Aliment. Pharmacol. Ther. 2017 45 310 318 10.1111/apt.13856 27859412 69. Keate R.F. Williams J.W. Connolly S.M. Lichen planus esophagitis: Report of three patients treated with oral tacrolimus or intraesophageal corticosteroid injections or both Dis. Esophagus. 2003 16 47 53 10.1046/j.1442-2050.2003.00289.x 12581256 70. Xue A.Z. Anderson C. Cotton C.C. Gaber C.E. Feltner C. Dellon E.S. Prevalence and Costs of Esophageal Strictures in the United States Clin. Gastroenterol. Hepatol. 2024 22 1821 1829.e4 10.1016/j.cgh.2024.03.026 38588766 PMC11344679 71. ASGE Standards of Practice Committee Pasha S.F. Acosta R.D. Chandrasekhara V. Chathadi K.V. Decker G.A. Early D.S. Evans J.A. Fanelli R.D. Fisher D.A. The role of endoscopy in the evaluation and management of dysphagia Gastrointest. Endosc. 2014 79 191 201 10.1016/j.gie.2013.07.042 24332405 72. Greenberg S.B. Ocampo A.A. Xue Z. Chang N.C. Thakkar K.P. Reddy S.B. Lee C.J. Ketchem C.J. Redd W.D. Eluri S. Increasing Rates of Esophageal Stricture and Dilation Over 2 Decades in Eosinophilic Esophagitis Gastro Hep Adv. 2023 2 521 523 10.1016/j.gastha.2022.12.006 37293573 PMC10249492 73. Ginsberg G.G. Pfau P.R. Foreign Bodies, Bezoars, and Caustic Ingestions Sleisenger and Fordtrans’s Gastrointestinal and Liver Disease 9th ed. Elsevier Amsterdam, The Netherlands 2010 74. Coia L.R. Myerson R.J. Tepper J.E. Late effects of radiation therapy on the gastrointestinal tract Int. J. Radiat. Oncol. Biol. Phys. 1995 31 1213 1236 10.1016/0360-3016(94)00419-L 7713784 75. Reed C.C. Shaheen N.J. Management of Barrett Esophagus Following Radiofrequency Ablation Gastroenterol. Hepatol. 2019 15 377 386 31391808 PMC6676349 76. Shaheen N.J. Greenwald B.D. Peery A.F. Dumot J.A. Nishioka N.S. Wolfsen H.C. Burdick J.S. Abrams J.A. Wang K.K. Mallat D. Safety and efficacy of endoscopic spray cryotherapy for Barrett’s esophagus with high-grade dysplasia Gastrointest. Endosc. 2010 71 680 685 10.1016/j.gie.2010.01.018 20363409 PMC3094022 77. Canto M.I. Shin E.J. Khashab M.A. Molena D. Okolo P. Montgomery E. Pasricha P. Safety and efficacy of carbon dioxide cryotherapy for treatment of neoplastic Barrett’s esophagus Endoscopy 2015 47 591 10.1055/s-0034-1392200 25920007 78. Overholt B.F. Panjehpour M. Haydek J.M. Photodynamic therapy for Barrett’s esophagus: Follow-up in 100 patients Gastrointest. Endosc. 1999 49 1 7 10.1016/S0016-5107(99)70437-2 9869715 79. Okubo Y. Ishihara R. Endoscopic Submucosal Dissection for Esophageal Cancer: Current and Future Life 2023 13 892 10.3390/life13040892 37109421 PMC10140872 80. Ďuriček M. Demeter M. Bánovčin P. POEM in the esophagus—How to deal with the post-POEM reflux Best Pract. Res. Clin. Gastroenterol. 2024 71 101917 10.1016/j.bpg.2024.101917 39209415 81. Tyler R. Nair A. Lau M. Hodson J. Mahmood R. Dmitrewski J. Incidence of anastomotic stricture after Ivor-Lewis oesophagectomy using a circular stapling device World J. Gastrointest. Surg. 2019 11 407 413 10.4240/wjgs.v11.i11.407 31798790 PMC6885727 82. Bonavina L. DeMeester T.R. McChesney L. Schwizer W. Albertucci M. Bailey R.T. Drug-induced esophageal strictures Ann. Surg. 1987 206 173 183 10.1097/00000658-198708000-00010 3606243 PMC1493104 83. Hage-Nassar G. Rotterdam H. Frank D. Green P.H. Esophagitis dissecans superficialis associated with celiac disease Gastrointest. Endosc. 2003 57 140 141 10.1067/mge.2003.42 12518158 84. Boregowda U. Goyal H. Mann R. Gajendran M. Patel S. Echavarria J. Sayana H. Saligram S. Endoscopic management of benign recalcitrant esophageal strictures Ann. Gastroenterol. 2021 34 287 299 10.20524/aog.2021.0585 33948052 PMC8079876 85. Shah J.N. Benign refractory esophageal strictures: Widening the endoscopist’s role Gastrointest. Endosc. 2006 63 164 167 10.1016/j.gie.2005.08.033 16377341 86. Kochman M.L. McClave S.A. Boyce H.W. The refractory and the recurrent esophageal stricture: A definition Gastrointest. Endosc. 2005 62 474 475 10.1016/j.gie.2005.04.050 16111985 87. Williams V.A. Watson T.J. Zhovtis S. Gellersen O. Raymond D. Jones C. Peters J.H. Endoscopic and symptomatic assessment of anastomotic strictures following esophagectomy and cervical esophagogastrostomy Surg. Endosc. 2008 22 1470 1476 10.1007/s00464-007-9653-6 18027040 88. Norton B.C. Papaefthymiou A. Aslam N. Telese A. Murray C. Murino A. Johnson G. Haidry R. The endoscopic management of oesophageal strictures Best Pract. Res. Clin. Gastroenterol. 2024 69 101899 10.1016/j.bpg.2024.101899 38749578 89. Bell M.G. Alexander J.A. Wong Kee Song L.M. Codipilly D.C. Snyder D.L. Dierkhising R. Ravi K. Recognition of Refractory Benign Esophageal Strictures at Index Endoscopy: Creation of a Predictive Model Gastrointest. Endosc. 2024 101 772 777 10.1016/j.gie.2024.10.036 39490691 90. Ogilvie A.L. Dronfield M.W. Ferguson R. Atkinson M. Palliative intubation of oesophagogastric neoplasms at fibreoptic endoscopy Gut 1982 23 1060 1067 10.1136/gut.23.12.1060 6184269 PMC1419858 91. Min L. Qing Y. Chu Y. Liang C. Lv L. Liu D. Tan Y. Zhou Y. Role of Endoscopic Ultrasound-Guided Fine Needle Aspiration (EUS-FNA) in the Diagnosis of Suspicious Malignant Esophageal Strictures J. Clin. Med. 2023 12 2153 10.3390/jcm12062153 36983155 PMC10057162 92. Buchanan M.E. Fishman E.K. Azadi J.R. CT Evaluation of the Esophagus: The Role of CT Imaging and CT Imaging Findings in Diagnosing Esophageal Abnormalities Curr. Probl. Diagn. Radiol. 2023 52 289 299 10.1067/j.cpradiol.2023.03.002 37045693 93. Katz P.O. Gerson L.B. Vela M.F. Guidelines for the diagnosis and management of gastroesophageal reflux disease Am. J. Gastroenterol. 2013 108 308 328 308–328; quiz 329 10.1038/ajg.2012.444 23419381 94. Snyder D.L. Alexander J.A. Ravi K. Fidler J.L. Katzka D.A. Course of Esophageal Strictures in Eosinophilic Esophagitis Using Structured Esophagram Protocol Gastro Hep Adv. 2024 3 448 453 10.1016/j.gastha.2024.01.010 39131715 PMC11307459 95. Sami S.S. Haboubi H.N. Ang Y. Boger P. Bhandari P. de Caestecker J. Griffiths H. Haidry R. Laasch H.U. Patel P. UK guidelines on oesophageal dilatation in clinical practice Gut 2018 67 1000 1023 10.1136/gutjnl-2017-315414 29478034 PMC5969363 96. Wang S.Y. Wang Z. Yang J.L. Esophageal mucosal pemphigoid and esophageal stricture Gastrointest. Endosc. 2020 92 962 963 10.1016/j.gie.2020.04.056 32376330 97. Olson C.G. Vora H. Kröner P.T. Pang M. Esophageal Stricture Recalcitrant to Repeated Dilation in Complex Rheumatological Disease ACG Case Rep. J. 2022 9 e00940 10.14309/crj.0000000000000940 36699630 PMC9799167 98. Khanna N. How do I dilate a benign esophageal stricture? Can. J. Gastroenterol. 2006 20 153 155 10.1155/2006/521583 16550258 PMC2582967 99. Shami V.M. Endoscopic management of esophageal strictures Gastroenterol. Hepatol. 2014 10 389 391 25013392 PMC4080876 100. Siersema P.D. Management of Refractory Benign Esophageal Strictures Gastroenterol. Hepatol. 2018 14 189 191 29928164 PMC6004045 101. Baron T.H. Management of benign esophageal strictures Gastroenterol. Hepatol. 2011 7 46 49 21346853 PMC3038317 102. Ham Y.H. Kim G.H. Plastic and biodegradable stents for complex and 31, refractory benign esophageal strictures Clin. Endosc. 2014 47 295 300 10.5946/ce.2014.47.4.295 25133114 PMC4130882 103. Gangwani M.K. Ahmed Z. Aziz M. Dahiya D.S. Aziz A. Ali H. Hayat U. Sohail A.H. Lee-Smith W. Qamar M.A. Comparing Endoscopic Suture vs Clip vs No Intervention in Esophageal Stent Migration: A Network Meta-Analysis Tech. Innov. Gastrointest. Endosc. 2024 26 145 152 10.1016/j.tige.2023.10.004 104. Gkolfakis P. Siersema P.D. Tziatzios G. Triantafyllou K. Papanikolaou I.S. Biodegradable esophageal stents for the treatment of refractory benign esophageal strictures Ann. Gastroenterol. 2020 33 330 337 10.20524/aog.2020.0482 32624652 PMC7315705 105. Van Boeckel P.G. Vleggaar F.P. Siersema P.D. A comparison of temporary self-expanding plastic and biodegradable stents for refractory benign esophageal strictures Clin. Gastroenterol. Hepatol. 2011 9 653 659 10.1016/j.cgh.2011.04.006 21586341 106. Rahman S.I. Tummala P. Agarwal B. Mo1483 Endoscopic Stricturoplasty: A Novel Technique for Symptomatic and Refractory Upper Gastrointestinal Strictures Gastrointest. Endosc. 2015 81 AB436 10.1016/j.gie.2015.03.1647 107. Samanta J. Dhaka N. Sinha S.K. Kochhar R. Endoscopic incisional therapy for benign esophageal strictures: Technique and results World J. Gastrointest. Endosc. 2015 7 1318 1326 10.4253/wjge.v7.i19.1318 26722613 PMC4689794 108. Mehta A. Shah S.L. Mahadev S. Endoscopic stricturotomy for a refractory complex esophageal stricture Endoscopy 2021 53 E181 E182 10.1055/a-1230-3008 32877938 109. Mamazza J. Schlachta C.M. Poulin E.C. Surgery for peptic strictures Gastrointest. Endosc. Clin. N. Am. 1998 8 399 413 10.1016/S1052-5157(18)30269-1 9583013 110. Harlak A. Yigit T. Coskun K. Ozer T. Mentes O. Gülec B. Kozak O. Surgical treatment of caustic esophageal strictures in adults Int. J. Surg. 2013 11 164 168 10.1016/j.ijsu.2012.12.010 23267851 111. Brindley G.C. Jr. Surgical management of strictures of the lower thoracic esophagus Am. Surg. 1975 41 94 96 1122068 112. Joshi P. Yadav R. Dangi A. Kumar P. Kumar S. Gupta V. Gupta V. Chandra A. Corrosive Esophageal Strictures: From Dilatation to Replacement: A Retrospective Cohort Study Dysphagia 2020 35 558 567 10.1007/s00455-019-10058-1 31485830 113. Siersema P.D. Treatment options for esophageal strictures Nat. Clin. Pract. Gastroenterol. Hepatol. 2008 5 142 152 10.1038/ncpgasthep1053 18250638 114. Dunbar K.B. Gastroesophageal Reflux Disease Ann. Intern. Med. 2024 177 ITC113 ITC128 10.7326/AITC202408200 39133924 115. El-Serag H.B. Sweet S. Winchester C.C. Dent J. Update on the epidemiology of gastro-oesophageal reflux disease: A systematic review Gut 2014 63 871 880 10.1136/gutjnl-2012-304269 23853213 PMC4046948 116. Maret-Ouda J. Markar S.R. Lagergren J. Gastroesophageal Reflux Disease: A Review JAMA 2020 324 2536 2547 10.1001/jama.2020.21360 33351048 117. Pisegna J. Holtmann G. Howden C.W. Katelaris P.H. Sharma P. Spechler S. Triadafilopoulos G. Tytgat G. Review article: Oesophageal complications and consequences of persistent gastro-oesophageal reflux disease Aliment. Pharmacol. Ther. 2004 20 (Suppl. 9) 47 56 10.1111/j.1365-2036.2004.02240.x 15527464 PMC6736593 118. Nguyen A.D. Spechler S.J. Shuler M.N. Souza R.F. Dunbar K.B. Unique Clinical Features of Los Angeles Grade D Esophagitis Suggest That Factors Other Than Gastroesophageal Reflux Contribute to its Pathogenesis J. Clin. Gastroenterol. 2019 53 9 14 10.1097/MCG.0000000000000870 28644313 PMC6542463 119. Yadlapati R. Early D. Iyer P.G. Morgan D.R. Sengupta N. Sharma P. Shaheen N.J. Quality Indicators for Upper GI Endoscopy Am. J. Gastroenterol. 2025 120 290 312 10.14309/ajg.0000000000003252 39808581 120. Shaheen N.J. Falk G.W. Iyer P.G. Souza R.F. Yadlapati R.H. Sauer B.G. Wani S. Diagnosis and Management of Barrett’s Esophagus: An Updated ACG Guideline Am. J. Gastroenterol. 2022 117 559 587 10.14309/ajg.0000000000001680 35354777 PMC10259184 121. Katz P.O. Dunbar K.B. Schnoll-Sussman F.H. Greer K.B. Yadlapati R. Spechler S.J. ACG Clinical Guideline for the Diagnosis and Management of Gastroesophageal Reflux Disease Am. J. Gastroenterol. 2022 117 27 56 10.14309/ajg.0000000000001538 34807007 PMC8754510 122. Fass R. Gastroesophageal Reflux Disease N. Engl. J. Med. 2022 387 1207 1216 10.1056/NEJMcp2114026 36170502 123. Yadlapati R. Gyawali C.P. Pandolfino J.E. CGIT GERD Consensus Conference Participants AGA Clinical Practice Update on the Personalized Approach to the Evaluation and Management of GERD: Expert Review Clin. Gastroenterol. Hepatol. 2022 20 984 994.e1 10.1016/j.cgh.2022.01.025 35123084 PMC9838103 124. Spechler S.J. Clinical practice. Barrett’s Esophagus N. Engl. J. Med. 2002 346 836 842 10.1056/NEJMcp012118 11893796 125. Hayeck T.J. Kong C.Y. Spechler S.J. Gazelle G.S. Hur C. The prevalence of Barrett’s esophagus in the US: Estimates from a simulation model confirmed by SEER data Dis. Esophagus. 2010 23 451 457 10.1111/j.1442-2050.2010.01054.x 20353441 PMC2896446 126. Oh D.S. DeMeester S.R. Pathophysiology and treatment of Barrett’s esophagus World J. Gastroenterol. 2010 16 3762 3772 10.3748/wjg.v16.i30.3762 20698038 PMC2921087 127. Tobey N.A. Hosseini S.S. Argote C.M. Dobrucali A.M. Awayda M.S. Orlando R.C. Dilated intercellular spaces and shunt permeability in nonerosive acid-damaged esophageal epithelium Am. J. Gastroenterol. 2004 99 13 22 10.1046/j.1572-0241.2003.04018.x 14687135 128. Souza R.F. Krishnan K. Spechler S.J. Acid, bile, and CDX: The ABCs of making Barrett’s metaplasia Am. J. Physiol. Gastrointest. Liver Physiol. 2008 295 G211 G218 10.1152/ajpgi.90250.2008 18556417 129. Theisen J. Peters J.H. Fein M. Hughes M. Hagen J.A. Demeester S.R. Demeester T.R. Laird P.W. The mutagenic potential of duodenoesophageal reflux Ann. Surg. 2005 241 63 68 10.1097/01.sla.0000150072.55037.e3 15621992 PMC1356847 130. Booth C.L. Thompson K.S. Barrett’s esophagus: A review of diagnostic criteria, clinical surveillance practices and new developments J. Gastrointest. Oncol. 2012 3 232 242 22943014 10.3978/j.issn.2078-6891.2012.028 PMC3418534 131. Sharma P. Clinical Practice. Barrett’s Esophagus N. Engl. J. Med. 2009 361 2548 2556 10.1056/NEJMcp0902173 20032324 132. Sharma P. Dent J. Armstrong D. Bergman J.J. Gossner L. Hoshihara Y. Jankowski J.A. Junghard O. Lundell L. Tytgat G.N. The development and validation of an endoscopic grading system for Barrett’s esophagus: The Prague C & M criteria Gastroenterology 2006 131 1392 1399 10.1053/j.gastro.2006.08.032 17101315 133. Corley D.A. Levin T.R. Habel L.A. Weiss N.S. Buffler P.A. Surveillance and survival in Barrett’s adenocarcinomas: A population-based study Gastroenterology 2002 122 633 640 10.1053/gast.2002.31879 11874995 134. Pascarenco O.D. Coroş M.F. Pascarenco G. Boeriu A.M. Draşovean S.C. Onişor D.M. Brusnic O. Dobru D. A preliminary feasibility study: Narrow-band imaging targeted versus standard white light endoscopy non-targeted biopsies in a surveillance Barrett’s population Dig. Liver Dis. 2016 48 1048 1053 27246796 10.1016/j.dld.2016.04.017 135. Shaheen N.J. Sharma P. Overholt B.F. Wolfsen H.C. Sampliner R.E. Wang K.K. Galanko J.A. Bronner M.P. Goldblum J.R. Bennett A. Radiofrequency ablation in Barrett’s esophagus with dysplasia N. Engl. J. Med. 2009 360 2277 2288 10.1056/NEJMoa0808145 19474425 136. Fleischer D.E. Sharma V.K. Endoscopic Ablation of Barrett’s Esophagus Using the Halo ® Dig. Dis. 2009 26 280 284 10.1159/000177009 PMC2790736 19188715 137. Hölscher A.H. Vallböhmer D. Bollschweiler E. Early Barrett’s carcinoma of the esophagus Ann. Thorac. Cardiovasc. Surg. 2008 14 347 354 19131920 138. Thrift A.P. Barrett’s Esophagus and Esophageal Adenocarcinoma: How Common Are They Really? Dig. Dis. Sci. 2018 63 1988 1996 10.1007/s10620-018-5068-6 29671158 139. Rubenstein J.H. Shaheen N.J. Epidemiology, Diagnosis, and Management of Esophageal Adenocarcinoma Gastroenterology 2015 149 302 317.e1 10.1053/j.gastro.2015.04.053 25957861 PMC4516638 140. Yang G.Y. Wagner T.D. Jobe B.A. Thomas C.R. The role of positron emission tomography in esophageal cancer Gastrointest. Cancer Res. 2008 2 3 9 19259317 PMC2630808 141. Hoeppner J. Brunner T. Schmoor C. Bronsert P. Kulemann B. Claus R. Utzolino S. Izbicki J.R. Gockel I. Gerdes B. Perioperative Chemotherapy or Preoperative Chemoradiotherapy in Esophageal Cancer N. Engl. J. Med. 2025 392 323 335 10.1056/NEJMoa2409408 39842010 142. Shah M.A. Kennedy E.B. Alarcon-Rozas A.E. Alcindor T. Bartley A.N. Malowany A.B. Bhadkamkar N.A. Deighton D.C. Janjigian Y. Karippot A. Immunotherapy and Targeted Therapy for Advanced Gastroesophageal Cancer: ASCO Guideline J. Clin. Oncol. 2023 41 1470 1491 10.1200/JCO.22.02331 36603169 143. Martinez J.C. Puc M.M. Quiros R.M. Esophageal stenting in the setting of malignancy ISRN Gastroenterol. 2011 2011 719575 10.5402/2011/719575 21991527 PMC3168502 144. Wadhwa V. Thota P.N. Parikh M.P. Lopez R. Sanaka M.R. Changing Trends in Age, Gender, Racial Distribution and Inpatient Burden of Achalasia Gastroenterol. Res. 2017 10 70 77 10.14740/gr723w 28496526 PMC5412538 145. Farrokhi F. Vaezi M.F. Idiopathic (primary) achalasia Orphanet J. Rare Dis. 2007 2 38 10.1186/1750-1172-2-38 17894899 PMC2040141 146. Boeckxstaens G.E. Zaninotto G. Richter J.E. Achalasia Lancet 2014 383 83 93 10.1016/S0140-6736(13)60651-0 23871090 147. Ghoshal U.C. Daschakraborty S.B. Singh R. Pathogenesis of achalasia cardia World J. Gastroenterol. 2012 18 3050 3057 10.3748/wjg.v18.i24.3050 22791940 PMC3386318 148. Savarino E. Bhatia S. Roman S. Sifrim D. Tack J. Thompson S.K. Gyawali C.P. Achalasia Nat. Rev. Dis. Primers 2022 8 28 10.1038/s41572-022-00356-8 35513420 149. Khashab M.A. Vela M.F. Thosani N. Agrawal D. Buxbaum J.L. Abbas Fehmi S.M. Fishman D.S. Gurudu S.R. Jamil L.H. Jue T.L. ASGE guideline on the management of achalasia Gastrointest. Endosc. 2020 91 213 227.e6 10.1016/j.gie.2019.04.231 31839408 150. Taft T.H. Carlson D.A. Triggs J. Craft J. Starkey K. Yadlapati R. Gregory D. Pandolfino J.E. Evaluating the reliability and construct validity of the Eckardt symptom score as a measure of achalasia severity Neurogastroenterol. Motil. 2018 30 e13287 10.1111/nmo.13287 29315993 PMC5992017 151. Fass O.Z. Pandolfino J.E. Schauer J.M. Ganesh N. Farina D.A. Lat A. Goudie E. Kelahan L.C. Carlson D.A. Diagnostic Accuracy of Timed Barium Esophagram for Achalasia Gastroenterology 2025 169 63 72 10.1053/j.gastro.2025.02.013 40020937 PMC12185239 152. Yadlapati R. Kahrilas P.J. Fox M.R. Bredenoord A.J. Prakash Gyawali C. Roman S. Babaei A. Mittal R.K. Rommel N. Savarino E. Esophageal motility disorders on high-resolution manometry: Chicago classification version 4.0 © Neurogastroenterol. Motil. 2021 33 e14058 Erratum in Neurogastroenterol. Motil. 2024 36 10.1111/nmo.14058 33373111 PMC8034247 153. Hirano I. Pandolfino J.E. Boeckxstaens G.E. Functional Lumen Imaging Probe for the Management of Esophageal Disorders: Expert Review From the Clinical Practice Updates Committee of the AGA Institute Clin. Gastroenterol. Hepatol. 2017 15 325 334 10.1016/j.cgh.2016.10.022 28212976 PMC5757507 154. Teh J.L. Tham H.Y. Soh A.Y.S. Chee C. Kim G. Shabbir A. Wong R.K.M. So J.B.Y. Gastro-esophageal reflux disease (GERD) after peroral endoscopic myotomy (POEM) Surg. Endosc. 2022 36 3308 3316 10.1007/s00464-021-08644-2 34327547 155. Inaba C.S. Wright A.S. Laparoscopic Heller Myotomy and Toupet Fundoplication for Achalasia J. Laparoendosc. Adv. Surg. Tech. A 2020 30 630 634 10.1089/lap.2020.0158 32392447 156. Van Hoeij F.B. Prins L.I. Smout A.J.P.M. Bredenoord A.J. Efficacy and safety of pneumatic dilation in achalasia: A systematic review and meta-analysis Neurogastroenterol. Motil. 2019 31 e13548 10.1111/nmo.13548 30697952 PMC6849773 157. Harvey P.R. Coupland B. Mytton J. Evison F. Patel P. Trudgill N.J. Outcomes of pneumatic dilatation and Heller’s myotomy for achalasia in England between 2005 and 2016 Gut 2019 68 1146 1151 10.1136/gutjnl-2018-316544 30606814 158. Vaezi M.F. Pandolfino J.E. Yadlapati R.H. Greer K.B. Kavitt R.T. ACG Clinical Guidelines: Diagnosis and Management of Achalasia Am. J. Gastroenterol. 2020 115 1393 1411 10.14309/ajg.0000000000000731 32773454 PMC9896940 159. Jalil S. Castell D.O. Schatzki’s ring: A benign cause of dysphagia in adults J. Clin. Gastroenterol. 2002 35 295 298 10.1097/00004836-200210000-00004 12352291 160. Novak S.H. Shortsleeve M.J. Kantrowitz P.A. Effective Treatment of Symptomatic Lower Esophageal (Schatzki) Rings With Acid Suppression Therapy: Confirmed on Barium Esophagography AJR Am. J. Roentgenol. 2015 205 1182 1187 10.2214/AJR.15.14704 26587923 161. Nadaleto B.F. Herbella F.A.M. Patti M.G. Treatment of Achalasia and Epiphrenic Diverticulum World J. Surg. 2022 46 1547 1553 10.1007/s00268-022-06476-2 35142875 162. Barbieri L.A. Parise P. Cossu A. Puccetti F. Elmore U. Talavera Urquijo E. Rosati R. Treatment of Epiphrenic Diverticulum: How I Do It J. Laparoendosc. Adv. Surg. Tech. A 2020 30 653 658 10.1089/lap.2020.0165 32315575 163. Al-Bayati K. Coneys G. Cantor M. Gheorghe R. Stone J.K. Esophageal Epidermoid Metaplasia Treated With Endoscopic Submucosal Dissection ACG Case Rep. J. 2025 12 e01698 10.14309/crj.0000000000001698 40330501 PMC12055107 164. Cottreau J. Gruchy S. Kamionek M. Lauwers G.Y. Arnason T. Prevalence of oesophageal epidermoid metaplasia in 1048 consecutive patients and 58 patients with squamous neoplasms Histopathology 2016 68 988 995 10.1111/his.12886 26426946 165. Thoua N.M. Bunce C. Brough G. Forbes A. Emmanuel A.V. Denton C.P. Assessment of gastrointestinal symptoms in patients with systemic sclerosis in a UK tertiary referral centre Rheumatology 2010 49 1770 1775 10.1093/rheumatology/keq147 20530510 166. Voulgaris T.A. Karamanolis G.P. Esophageal manifestation in patients with scleroderma World J. Clin. Cases 2021 9 5408 5419 10.12998/wjcc.v9.i20.5408 34307594 PMC8281422 167. Li B. Yan J. Pu J. Tang J. Xu S. Wang X. Esophageal Dysfunction in Systemic Sclerosis: An Update Rheumatol. Ther. 2021 8 1535 1549 10.1007/s40744-021-00382-0 34628599 PMC8572301 168. Nagaraja V. McMahan Z.H. Getzug T. Khanna D. Management of gastrointestinal involvement in scleroderma Curr. Treat Opt. Rheumatol. 2015 1 82 105 10.1007/s40674-014-0005-0 26005632 PMC4437639 Figure 1 EoE showing rings and furrows. Figure 2 Esophageal lichen planus. Figure 3 LA classification of esophagitis. Figure 4 Barrett’s esophagus. Figure 5 Esophageal adenocarcinoma. Figure 6 HRM classification of types of achalasia. Figure 7 Esophageal epidermoid metaplasia. life-15-01444-t001_Table 1 Table 1 Eckardt score. Scheme Dysphagia Regurgitation Retrosternal Pain Weight Loss (kg) 0 None None None None 1 Occasional Occasional Occasional <5 2 Daily Daily Daily 5–10 3 Each meal Each meal Each meal >10 ",
  "metadata": {
    "Title of this paper": "Management of gastrointestinal involvement in scleroderma",
    "Journal it was published in:": "Life",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471292/"
  }
}