{
  "title": "Paper_32",
  "abstract": "pmc Eur J Dent Eur J Dent 801 eurojdent European Journal of Dentistry 1305-7456 1305-7464 Dental Investigations Society PMC12494456 PMC12494456.1 12494456 12494456 40073991 10.1055/s-0045-1802950 EJD-24-9-3758 1 Original Article Histological Assessment of the Anti-Inflammatory Effectiveness of Peperomia pellucida Nasution Dewi Lidya Ichwana 1 2 http://orcid.org/0000-0003-4060-3319 Tjahajawati Sri 3 Indriyanti Ratna 4 http://orcid.org/0000-0002-9164-0542 Amaliya Amaliya 5 Irsyad Widya 6 Sabirin Indah Puti 7 1 Department of Dentistry, Faculty of Dentistry, Padjadjaran University, Jawa Barat, Indonesia 2 Department of Periodontic, Faculty of Dentistry, Jenderal Achmad Yani University, Jawa Barat, Indonesia 3 Departement of Oral Biology, Faculty of Dentistry, Padjadjaran University, Jawa Barat, Indonesia 4 Departement of Pediatric Dentistry, Faculty of Dentistry, Padjadjaran University, Jawa Barat, Indonesia 5 Department of Periodontic, Faculty of Dentistry, Padjadjaran University, Jawa Barat, Indonesia 6 Departement of Orthodontic, Faculty of Dentistry, Jenderal Achmad Yani University, Jawa Barat, Indonesia 7 Departement of Oral Biology, Faculty of Dentistry, Jenderal Achmad Yani University, Jawa Barat, Indonesia Address for correspondence Department of Periodontic, Jenderal Achmad Yani University Jalan Terusan Jenderal Sudirman, Kecamatan Cimahi Selatan, Kota Cimahi, Jawa Barat, 40531 Indonesia dewi.ichwana@lecture.unjani.ac.id 12 3 2025 10 2025 19 4 498287 1092 1105 01 03 2025 04 10 2025 04 10 2025 The Author(s). This is an open access article published by Thieme under the terms of the Creative Commons Attribution License, permitting unrestricted use, distribution, and reproduction so long as the original work is properly cited. ( https://creativecommons.org/licenses/by/4.0/ 2025 The Author(s). https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use,\ndistribution, and reproduction in any medium, provided the original work is properly cited. Objective This study aims to assess the impact of Peperomia pellucida Materials and Methods The extract was prepared using the reflux method with 96% ethanol as a solvent, followed by phytochemical screening and antibacterial testing via the disk diffusion method. This in vivo P. pellucida Statistical Analysis Data were analyzed using one-way analysis of variance and Kruskal–Wallis with Mann–Whitney post hoc tests for pairwise comparisons. Results Phytochemical analysis confirmed the presence of alkaloids, polyphenols, tannins, flavonoids, quinones, monoterpenoids, and sesquiterpenoids in P. pellucida Porphyromonas gingivalis Conclusion Based on these findings, P. pellucida Keywords Peperomia pellucida periodontitis anti-inflammatory antimicrobial activity Wistar rats pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Periodontitis is a chronic multifactorial inflammatory disease associated with the accumulation of dental plaque and characterized by the progressive destruction of periodontal tissues, including the periodontal ligament, cementum, and alveolar bone. Periodontitis involves a complex dynamic interaction between specific bacterial pathogens and a damaging immune response. 1 2 3 4 5 6 7 8 9 10 11 12 13 Herbal medicines and formulations consisting of plant elements have been recognized for their therapeutic benefits. The advantages of herbal products compared with chemical drugs include having natural activity, a higher safety margin, and lower cost. 14 9 15 16 17 18 19 20 21 9 22 Peperomia pellucida P. pellucida Propionibacterium acnes 23 24 25 26 27 28 29 P. pellucida 25 P. pellucida 25 26 27 28 29 30 31 32 P. pellucida 28 29 Various models of periodontitis in laboratory animals have been developed to study the pathogenesis of periodontitis and the effectiveness of new treatment methods across different animal species. Small rodent models are the most commonly used due to their ease of handling and the ability to reproduce inflammatory processes in periodontal tissue. The most frequently employed method is the ligature-induced periodontitis model, where a ligature placed around the cervical area of the tooth causes bacterial colonization and the development of inflammation. Moiseev et al developed a new method to accelerate periodontitis modeling in mice, using a combination of local factors designed to disrupt the functional integrity of the periodontal tissue within a short period (7 days). 33 34 35 This study aims to evaluate the effectiveness of P. pellucida P. pellucida Materials and Methods This research was an experimental laboratory study using a post-test control group design with four groups of Rattus norvegicus P. pellucida The inclusion criteria for P. pellucida Rattus norvegicus 2 32 33 The sample size was determined using the Federer formula, which indicated a minimum of six rats per group, resulting in a total of 24 rats. The groups were as follows: (1) healthy rats without induced periodontitis (no periodontitis group), (2) rats with induced periodontitis without treatment (no treatment group), (3) rats with induced periodontitis treated with 0.2% chlorhexidine gluconate (CHX-treated group), and (4) rats with induced periodontitis treated with P. pellucida Preparation P. pellucida Preparation of P. pellucida 36 36 37 A total of 1,000 g of P. pellucida P. pellucida 36 Phytochemistry of P. pellucida Phytochemical screening of P. pellucida 38 Test for alkaloids Portion 1: Mayer's reagent was added. The formation of a white precipitate or turbidity indicated the possible presence of alkaloids. Portion 2: Dragendorff's reagent was added. The formation of an orange-yellow to brick-red precipitate suggested the possible presence of alkaloids. Portion 3: This portion was used as a blank. Test for polyphenols Test for tannins Portion 1: Addition of a few drops of 1% gelatin solution led to the formation of a white precipitate, indicating the presence of tannins. Portion 2: Addition of Steasny's reagent produced a pink precipitate, confirming the presence of tannins. Test for flavonoids Test for quinones Test for saponins Test for monoterpenoids and sesquiterpenoids Test for steroids and triterpenoids Antibacterial Assay The antibacterial activity against Porphyromonas gingivalis P. pellucida 39 40 Preparation of Animal Research The preparation for the study involved setting up both the subjects and the materials required, including equipment and supplies. The study was approved by the local Ethics Committee of Faculty of Medicine, Jenderal Achmad Yani University, West Java, Indonesia No: 032/UH4.11/2023. The research object was P. pellucida Rattus norvegicus Wistar ad libitum 2 33 41 42 P. pellucida Experimental Induced Periodontitis in Animal Studies and Administration of Extract Periodontitis induction in animal studies was performed in three groups: the negative control group, the positive control group, and the P. pellucida All periodontitis induction procedures were performed under intraperitoneal anesthesia using ketamine (HCl) 40 to 80 mg/kg body weight and xylazine (Xyla) 5 to 10 mg/kg body weight, with anesthesia lasting approximately 1 hour. Before placing the ligature wire, the interdental area of the teeth was exposed using 2.5 mm silk thread (Onemed). A ligature wire (OSU) with a diameter of 0.3 mm was then placed in an eight-shaped pattern around the cervical area of the left and right upper incisors. The ends of the wire were twisted with a needle holder and ligature wire tucker until securely fastened. The cut ends of the wire were bent to prevent injury to the animal's oral mucosa and gingiva. Dental plaque was collected from a patient with severe chronic periodontitis using a Gracey curette (UNC 15, Osung MND Co., Seoul, Korea), scraped from the crown and cervical areas of the teeth, and stored in a sterile container for no more than 2 hours. The plaque was placed to fill the interdental space up to the ligature wire using a sterile paper point #40, and adherence of the plaque was ensured. Rats with ligature wire and plaque from the periodontitis patient were then given a nicotine solution in physiological saline (0.001 mg/L), injected submucosally into the gingiva in a volume of 0.05 mL. This nicotine solution was administered once daily for 7 days. 33 The ligature wire placed around the cervical area of the rats was removed on the seventh day or when periodontitis was confirmed, as indicated by changes in gingival color and consistency, gingival bleeding upon probing, and increased probing depth of the periodontal pocket. Rats confirmed with periodontitis were then subjected to measurements and evaluations of the Papillary Bleeding Index (PBI) and GI. Two rats were randomly selected to represent the sample group, anesthetized, and then decapitated to obtain their jaws, which were subsequently fixed in a 70% alcohol solution. Histological examination was performed to assess the number of macrophages, neutrophils, osteoclasts, osteoblasts, and fibroblasts. Experimentally induced periodontitis in rats was confirmed by clear infiltration of inflammatory cells, particularly neutrophils, in the gingival tissue, increased osteoclasts, decreased osteoblasts, and resorption of the alveolar process in hematoxylin and eosin (H&E)-stained sections. 43 44 45 The group without induced periodontitis and the negative control group received no treatment, while the positive control group received a topical application of 0.2% CHX (Minosep) around the periodontitis-induced teeth, administered in a 0.05 mL dose. 9 46 47 48 P. pellucida P. pellucida P. gingivalis Aggregatibacter actinomycetemcomitans 32 40 Papillary Bleeding Index and Gingival Index Examination The PBI and GI were assessed on the same day the ligature wire is removed (confirming periodontitis), and on days 3, 5, and 7 afterward. PBI and GI values were compared before and after treatment. A visual representation of the PBI is provided using a scale with the following grades ( Fig. 1 Grade 0: No bleeding Grade 1: Bleeding points Grade 2: Bleeding lines Grade 3: Bleeding triangles Grade 4: Diffuse bleeding Fig. 1 Interpretation of Papillary Bleeding Index results in rats with induced periodontitis. The condition of the gingiva is assessed on two upper front teeth in rats with induced periodontitis. The GI is evaluated using the following scores and criteria ( Fig. 2 0: No inflammation of the gingiva 1: Mild inflammation characterized by slight color change and swelling, with no bleeding upon probing 2: Moderate inflammation with redness, swelling, and shininess, with bleeding upon probing 3: Severe inflammation with more pronounced redness and swelling, ulceration, and spontaneous bleeding 49 Fig. 2 Interpretation of gingival index (GI) results in rats with induced periodontitis. ( A B C D Histological Assay On the seventh day, the rats were anesthetized and decapitated with an overdose of ether administered intramuscularly, followed by neck dislocation. All animals were anesthetized with a mixture of Zoletil (Virbac) and Rompun (Bayer) (1 mL/kg) administered intraperitoneally (4:1 v/v) and were then perfused transcardially with 0.1 M phosphate-buffered saline (pH 7.4), followed by 4% paraformaldehyde in 0.1 M phosphate buffer (PB, pH 7.4). The maxillary tissue with induced periodontitis was excised and immediately immersed in 10% paraformaldehyde in 0.1 M PB (pH 7.4) to avoid dehydration or shrinkage caused by air exposure. The maxillary tissue was then rinsed with a decalcification solution consisting of 24.4% formic acid and 0.5 N sodium hydroxide for 48 hours. The decalcified tissue was fixed in 10% neutral-buffered formalin for 1 day and then embedded in paraffin using an automated tissue processor, the Shandon Citadel 2000 (Thermo Scientific, Waltham, Massachusetts, United States), and the Shandon Histostar embedding center (Thermo Scientific). From each paraffin block, 5-μm thick sections were cut using an automatic microtome (RM2255, Leica Biosystems, Nussloch, Germany). The sections were mounted on glass slides and stained with H&E. The stained samples were examined under an electron microscope (Nikon Eclipse 80i) at ×40 magnification in five fields of view. Results Phytochemical Screening The phytochemical screening results of extracts of P. pellucida Table 1 Table 1 Phytochemical screening of extract of Peperomia pellucida Compound class Result Alkaloid + Polyphenol + Tannin + Flavonoid + Quinone + Saponin − Monoterpenoids and sesquiterpenoids − Steroid and triterpenoids + Antibacterial Activity The antibacterial activity of pepper elder leaf ( P. pellucida P. gingivalis Fig. 1 Fig. 3 Fig. 3 The results of the inhibitory test conducted using maceration and reflux extracts. Panels ( A C Porphyromonas gingivalis Table 2 P. pellucida P. gingivalis P. pellucida P. pellucida Table 2 Inhibitory values of pepper elder leaf maceration and reflux extracts Groups Zone of inhibition (mm) Mean ± SD Interpretation Aquades 0 0 0 No response 0 CHX 20.05 20.68 ± 0.584 20.80 Very strong 21.20 Peperomia pellucida 10.20 10.18 ± 0.029 Strong 10.15 10.20 Peperomia pellucida 12.05 12.20 ± 0.150 Strong 12.20 12.35 Peperomia pellucida 13.80 13.78 ± 0.176 Strong 13.95 13.60 Peperomia pellucida 15.55 15.52 ± 0.104 Strong 15.40 15.60 Abbreviations: CHX, chlorhexidine-treated; SD, standard deviation. Assessment of PBI and Gingival Index The following shows the PBI scores for rats with induced periodontitis in the untreated group, the group treated with P. pellucida Table 3 Table 3 P. pellucida P. pellucida Table 4 Table 3 Papillary Bleeding Index (PBI) and gingival index (GI) of induced periodontitis rats by group Groups PBI GI Mean Standard deviation Min–Max Mean Standard deviation Min–Max Day 0 No periodontitis 0.000 0.000 0.0–0.0 0.000 0.000 0.0–0.0 No treated 3.330 0.820 2.0–4.0 2.833 0.408 2.0–3.0 CHX-treated 3.000 1.220 1.0–4.0 3.000 0.000 3.0–3.0 Extract-treated 3.200 0.840 2.0–4.0 2.800 0.447 2.0–3.0 Day 3 No periodontitis 0.000 0.000 0.0–0.0 0.000 0.000 0.0–0.0 No treated 3.333 0.820 2.0–4.0 2.333 0.258 2.0–2.5 CHX-treated 2.600 0.890 2.0–4.0 1.900 0.224 1.5–2.0 Extract-treated 1.600 0.890 1.0–3.0 1.400 0.224 1.0–1.5 Day 5 No periodontitis 0.000 0.000 0.0–0.0 0.000 0.000 0.0–0.0 No treated 3.17 0.750 2.0–4.0 1.917 0.204 1.5–2.0 CHX-treated 1.800 1.480 0.0–4.0 1.600 0.418 1.0–2.0 Extract-treated 1.000 0.710 0.0–2.0 1.300 0.274 1.0–1.5 Day 7 No periodontitis 0.000 0.000 0.0–0.0 0.000 0.000 0.0–0.0 No treated 2.330 1.030 1.0–4.0 1.833 0.258 1.5–2.0 CHX-treated 1.600 0.890 1.0–3.0 1.200 0.274 1.0–1.5 Extract-treated 1.200 1.100 0.0–3.0 0.600 0.548 0.0–1.5 Abbreviation: CHX, chlorhexidine-treated. Table 4 Paired difference test between groups Day Extract-treated vs. no periodontitis Extract-treated vs. no treated Extract-treated vs. CHX-treated p PBI GI PBI GI PBI GI Day 0  0.004 a  0.004 a 0.836 0.931 0.940 0.690 Day 3 0.069  0.004 a 0.059  0.004 a 0.307  0.032 a Day 5 0.141  0.004 a 0.155  0.009 a 0.466 0.310 Day 7 0.051  0.030 a 0.401  0.009 a 0.528 0.095 Abbreviations: CHX, chlorhexidine-treated; GI, gingival index; PBI, Papillary Bleeding Index. a Original data are tested using the Mann-Whitney test. Statistical significance is determined by a p-value of < 0.05 and are set in bold. Histological Assessment A total of 24 rats were used in this study and divided into four groups: no periodontitis group, no treatment group, CHX-treated group, and extract group. Two rats were randomly selected from each group, and tissue samples from the periodontitis-induced area were collected for histological examination. The study focused on analyzing the number of osteoclasts, osteoblasts, fibroblasts, macrophages, and PMNs, which are closely associated with the severity of periodontitis. The stained samples were viewed under electron microscope (Nikon Eclipse 80i) at ×40 magnification in five fields of view. The normality of numerical data was assessed using the Shapiro–Wilk test ( Table 5 p p p p p p p p p p p p p p p p Table 5 Normality test of numeric data Variable Groups p Data distribution Osteoclast No periodontitis 0.0001** Not normally No treatment 0.0001** Not normally CHX-treated 1.000 Normal Extract-treated 0.0001** Not normally Osteoblast No periodontitis 0.135 Normal No treatment 0.717 Normal CHX-treated 0.282 Normal Extract-treated 0.471 Normal Fibroblast No periodontitis 0.839 Normal No treatment 0.565 Normal CHX-treated 0.559 Normal Extract-treated 0.968 Normal Macrophage No periodontitis 0.008* Not normally No treatment 0.245 Normal CHX-treated 0.007* Not normally Extract-treated 0.017* Not normally PMN No periodontitis 0.361 Normal No treatment 0.099 Normal CHX-treated 0.007* Not normally Extract-treated 0.426 Normal Abbreviations: CHX, chlorhexidine-treated; PMN, polymorphonuclear neutrophil. Note: The p p p p p p The homogeneity of numerical data was assessed using the Levene test. The results showed that for the variables osteoclasts, osteoblasts, fibroblasts, and macrophages, the p p p p Table 6 Table 6 The homogeneity test Variable p Data distribution Osteoclast 0.002* Nonhomogeneous Osteoblast 0.031* Nonhomogeneous Fibroblast 0.0001* Nonhomogeneous Macrophage 0.002* Nonhomogeneous PMN 0.105 Homogeneous Abbreviation: PMN, polymorphonuclear neutrophil. Note: The p p p p p p Table 7 p Table 7 Comparison of histological examination results among the four groups Groups Osteoclasts Osteoblasts Fibroblasts Macrophages PMN Mean ± SD p Mean ± SD p Mean ± SD p Mean ± SD p Mean ± SD p No periodontitis 0.20 ± 0.632  0.023* 10.20 ± 3.853  0.001* 23.50 ± 6.078  0.0001** 2.30 ± 0.823  0.012* 5.10 ± 2.079  0.005* No treatment 0.40 ± 0.699 16.80 ± 5.245 59.30 ± 17.263 3.60 ± 0.966 5.10 ± 2.183 CHX-treated 0.00 7.30 ± 2.163 5.40 ± 3.340 1.60 ± 1.955 2.40 ± 1.075 Extract-treated 0.60 ± 0.516 11.40 ± 3.806 28.70 ± 8.680 2.10 ± 0.876 4.50 ± 1.841 Abbreviations: ANOVA, analysis of variance; CHX, chlorhexidine-treated; PMN, polymorphonuclear neutrophil; SD, standard deviation. Note: For numerical data, the p p p The results of the comparative analysis of the four groups in Table 7 Table 8 p p Table 8 Comparison between two groups of each histological examination variable Variable Groups p Osteoclast No treatment No periodontitis 0.529 CHX-treated No periodontitis 0.739 CHX-treated No treatment 0.280 Extract-treated No periodontitis 0.105 Extract-treated No treatment 0.393 Extract-treated CHX treatment 0.023* Osteoblast No treatment No periodontitis 0.007* CHX-treated No periodontitis 0.075 CHX-treated No treatment 0.0001* Extract-treated No periodontitis 0.579 Extract-treated No treatment 0.023* Extract-treated CHX treatment 0.015* Fibroblast No treatment No periodontitis 0.0001** CHX-treated No periodontitis 0.0001** CHX-treated No treatment 0.0001** Extract-treated No Periodontitis 0.143 Extract-treated No Treatment 0.0001** Extract-treated CHX treatment 0.0001** Macrophage No treatment No periodontitis 0.009* CHX-treated No periodontitis 0.218 CHX-treated No treatment 0.035* Extract-treated No periodontitis 0.631 Extract-treated No treatment 0.004* Extract-treated CHX treatment 0.247 PMN No treatment No periodontitis 1.000 CHX-treated No periodontitis 0.003* CHX-treated No treatment 0.001* Extract-treated No periodontitis 0.529 Extract-treated No treatment 0.631 Extract-treated CHX treatment 0.011* Abbreviations: CHX, chlorhexidine-treated; LSD, least significant difference; PMN, polymorphonuclear neutrophil. Note: For numerical data, the p p p In histological observations, the number of osteoblasts, fibroblasts, and macrophages did not show significant differences between the periodontitis-induced group treated with P. pellucida p p Fig. 4 Fig. 4 Histological profile of periodontal tissue in rats induced with periodontitis. The image shows inflammatory cell infiltration, collagen degradation, and alveolar bone loss, which are characteristic features of periodontitis. Hematoxylin and eosin staining, magnification 40 × . ( A B C D P.pellucida Discussion The phytochemical screening of P. pellucida P. pellucida P. gingivalis Alkaloids possess antibacterial properties that can lyse bacterial cell walls by disrupting the peptidoglycan components within the bacterial cells. Flavonoids can act as anti-inflammatory agents by blocking the activity of cyclooxygenase (COX)-1 and COX-2 enzymes, inhibiting prostaglandin production, and preventing the accumulation of leukocytes and neutrophil degranulation. This, in turn, directly reduces the release of arachidonic acid by neutrophils and inhibits histamine release. Under normal conditions, leukocytes can move freely along the endothelial walls. During inflammation, endothelial-derived mediators and complement factors cause leukocyte adhesion to the endothelial walls. The administration of flavonoids can reduce leukocyte count and complement activation, thereby decreasing leukocyte adhesion to the endothelium and ultimately reducing the inflammatory response. The antibacterial mechanism of flavonoids involves damaging the proteins that form bacterial cytoplasm by affecting the permeability of their cell membranes, leading to an ion imbalance within the cell. Tannins can lyse bacteria and cause bacterial death by inhibiting transcription processes, preventing the cells from synthesizing proteins. 50 51 52 The active compounds in P. pellucida 53 50 54 55 56 In the process of extract preparation, several factors can influence the content of the extract. These factors include, first, biological factors such as the type of plant, location of the plant, time of harvest, plant age, and the method of plant material storage. Second, chemical factors including the types of compounds and active components present, extraction methods, and solvents used. 13 57 58 59 60 Based on the clinical parameter assessments of PBI and GI, it is evident that the administration of P. pellucida P. pellucida P. pellucida 29 Rats and other organisms possess a natural ability to heal from certain conditions through the wound healing process without external assistance. However, if the body's natural ability to repair itself is diminished and wound management is inadequate, the wound healing process can be hindered. 52 61 62 52 62 This study aims to evaluate the effects of P. pellucida P. pellucida P. pellucida P. pellucida 61 62 63 64 Several previous studies similar to ours have explored natural extracts for treating periodontitis. Curcuma longa Curcuma longa 65 66 67 Camellia sinensis 68 69 Salvadora persica 70 Nigella sativa 71 P. pellucida 66 Conclusion Based on the findings of this study, P. pellucida P. gingivalis Acknowledgment We thank Riset Disertasi Doktor Unpad for their support in this research. Conflict of Interest Authors' Contributions D.L.I.N.: Conceptualization, methodology, data analysis, and writing-original draft. S.T.: Investigation, resources, and writing-review and editing. R.I.: Investigation, resources, and writing-review and editing. A.A.: Investigation, resources, and writing-review and editing. W.I.: Investigation and resources. I.P.S.: Resources and writing-review and editing. References 1 Kwon T Lamster I B Levin L Current concepts in the management of periodontitis Int Dent J 2021 71 06 462 476 34839889 10.1111/idj.12630 PMC9275292 2 Marchesan J Girnary M S Jing L An experimental murine model to study periodontitis Nat Protoc 2018 13 10 2247 2267 30218100 10.1038/s41596-018-0035-4 PMC6773250 3 Abdulkareem A A Al-Taweel F B Al-Sharqi A JB Gul S S Sha A Chapple I LC Current concepts in the pathogenesis of periodontitis: from symbiosis to dysbiosis J Oral Microbiol 2023 15 01 2.197779E6 10.1080/20002297.2023.2197779 PMC10071981 37025387 4 Hajishengallis G Chavakis T Lambris J D Current understanding of periodontal disease pathogenesis and targets for host-modulation therapy Periodontol 2000 2020 84 01 14 34 32844416 10.1111/prd.12331 PMC7457922 5 Heitz-Mayfield L JA Trombelli L Heitz F Needleman I Moles D A systematic review of the effect of surgical debridement vs non-surgical debridement for the treatment of chronic periodontitis J Clin Periodontol 2002 29 92 102 10.1034/j.1600-051x.29.s3.5.x 12787211 6 Hammami C Nasri W Antibiotics in the treatment of periodontitis: a systematic review of the literature Int J Dent 2021 2021 6.846074E6 10.1155/2021/6846074 PMC8592718 34790237 7 Heitz-Mayfield L JA Lang N P Surgical and nonsurgical periodontal therapy. Learned and unlearned concepts Periodontol 2000 2013 62 01 218 231 23574468 10.1111/prd.12008 8 Aljateeli M Koticha T Bashutski J Surgical periodontal therapy with and without initial scaling and root planing in the management of chronic periodontitis: a randomized clinical trial J Clin Periodontol 2014 41 07 693 700 24730621 10.1111/jcpe.12259 9 Siddharth M Singh P Gupta R Sinha A Shree S Sharma K A Comparative evaluation of subgingivally delivered 2% curcumin and 0.2% chlorhexidine gel adjunctive to scaling and root planing in chronic periodontitis J Contemp Dent Pract 2020 21 05 494 499 32690830 10 Solomon S M Stafie C S Sufaru I G Curcumin as a natural approach of periodontal adjunctive treatment and its immunological implications: a narrative review Pharmaceutics 2022 14 05 982 35631567 10.3390/pharmaceutics14050982 PMC9143680 11 Rams T E Degener J E van Winkelhoff A J Antibiotic resistance in human chronic periodontitis microbiota J Periodontol 2014 85 01 160 169 23688097 10.1902/jop.2013.130142 12 Kim W J Soh Y Heo S M Recent advances of therapeutic targets for the treatment of periodontal disease Biomol Ther (Seoul) 2021 29 03 263 267 33731493 10.4062/biomolther.2021.001 PMC8094066 13 Kakad A V Laddha U D Kshirsagar S J Khairnar S J Traditional herbal remedies for periodontitis Biosci Biotechnol Res Asia 2022 19 04 1079 1091 14 Ingle N A The role of herbs in influencing periodontal health-a systematic review Int J Dent Oral Sci 2021 8 09 4326 4330 15 Tyagi P Dodwad V W Vaish S Chowdhery T Gupta N Kukreja J B Clinical efficacy of subgingivally delivered punica granatum chip and gel in management of chronic periodontitis patients Kathmandu Univ Med J 2020 18 71 279 283 34158437 16 Singhal R Agarwal V Rastogi P Khanna R Tripathi S Efficacy of Acacia arabica Saudi Dent J 2018 30 01 53 62 30166872 10.1016/j.sdentj.2017.10.006 PMC6112319 17 Kapil H Suresh D K Bathla S C Arora K S Assessment of clinical efficacy of locally delivered 0.2% thymoquinone gel in the treatment of periodontitis Saudi Dent J 2018 30 04 348 354 30202173 10.1016/j.sdentj.2018.06.001 PMC6128318 18 Pradeep A R Happy D Garg G Short-term clinical effects of commercially available gel containing Acacia arabica Aust Dent J 2010 55 01 65 69 20415914 10.1111/j.1834-7819.2009.01180.x 19 Aspalli S Shetty V S Devarathnamma M V Nagappa G Archana D Parab P Evaluation of antiplaque and antigingivitis effect of herbal mouthwash in treatment of plaque induced gingivitis: a randomized, clinical trial J Indian Soc Periodontol 2014 18 01 48 52 24744544 10.4103/0972-124X.128208 PMC3988643 20 Rassameemasmaung S Sirikulsathean A Amornchat C Maungmingsook P Rojanapanthu P Gritsanaphan W Topical application of Garcinia mangostana Complement Ther Med 2008 16 05 262 267 19186342 10.1016/j.ctim.2007.12.004 21 Sastravaha G Gassmann G Sangtherapitikul P Grimm W D Adjunctive periodontal treatment with Centella asiatica Punica granatum J Int Acad Periodontol 2005 7 03 70 79 16022023 22 Tilburt J C Kaptchuk T J Herbal medicine research and global health: an ethical analysis Bull World Health Organ 2008 86 08 594 599 18797616 10.2471/BLT.07.042820 PMC2649468 23 Yuliani D Dewi I K Marhamah S Efektivitas ekstrak daun sirih cina ( Peperomia pellucida 2022 173 181 24 Ahsan M K Herwin H Rusli R Antibacterial activity of ethanol extract of sirih cina leaves ( Peperomia pellucida J Microbiol Sci 2024 4 01 141 151 25 Wei L S Wee W Siong J Y Syamsumir D F Characterization of anticancer, antimicrobial, antioxidant properties and chemical compositions of Peperomia pellucida leaf extract Acta Med Iran 2011 49 10 670 674 22071643 26 Ng Z X Than M JY Yong P H Peperomia pellucida (L.) Kunth herbal tea: effect of fermentation and drying methods on the consumer acceptance, antioxidant and anti-inflammatory activities Food Chem 2021 344 128738 33280962 10.1016/j.foodchem.2020.128738 27 Hidayati S Agustin A T Sari E K Sari S M Destiawan R A Silvana W A Phytochemical profiling and antidiabetic evaluation of Peperomia pellucida Biodiversitas 2023 24 11 5972 5978 28 Amarathunga A AMDDN Kankanamge S U a Review on pharmacognostic, phytochemical and ethnopharmacological findings of Peperomia pellucida (L.) Kunth: pepper elder Int Res J Pharm 2017 8 11 16 23 29 Ahmad I Hikmawan B D Sulistiarini R Mun'im A Peperomia pellucida J Appl Pharm Sci 2022 13 01 1 9 30 Kartika I GAA Sinarsih N K Nayaka N MDMW Anti-inflammatory activities of Peperomia pellucida JPSA 2022 4 01 39 44 31 Roslida A H Aini N Z Evaluation of gastroprotective effect of the ethanolic extract of Peperomia pellucida Pharmacologyonline 2009 2 678 686 32 Nasution D LI Tjahajawati S Indriyanti R Amaliya A Fadilah R PN Mutiara R Antibacterial test of Peperomia pellucida Padjadjaran Journal of Dentistry 2023 35 03 181 33 Moiseev D Donskov S Dubrovin I A new way to model periodontitis in laboratory animals Dent J 2023 11 09 219 10.3390/dj11090219 PMC10527576 37754339 34 Zhang W Ju J Rigney T Tribble G Porphyromonas gingivalis BMC Oral Health 2014 14 01 89 25027664 10.1186/1472-6831-14-89 PMC4108595 35 Huang X Xie M Xie Y The roles of osteocytes in alveolar bone destruction in periodontitis J Transl Med 2020 18 01 479 33308247 10.1186/s12967-020-02664-7 PMC7733264 36 Ma Y Meng A Liu P Reflux extraction optimization and antioxidant activity of Phenolic compounds from Pleioblastus amarus Molecules 2022 27 02 362 35056677 10.3390/molecules27020362 PMC8778679 37 Zhang Q W Lin L G Ye W C Techniques for extraction and isolation of natural products: a comprehensive review Chin Med 2018 13 01 20 29692864 10.1186/s13020-018-0177-x PMC5905184 38 Gaby Syahanaya Butar-Butar R Neswita E Br Sembiring N Phytochemical screening test and measurement of total flavonoid levels in paku ( Nephrolepis biserrata J Pharm Sci 2023 6 03 1142 1160 39 Tenover F C Antibiotic susceptibility testing 3rd ed. Elsevier 2009 67 77 40 Lidya D Nasution I Tjahajawati S Indriyanti R Amaliya A Sudikno H Effectiveness of pepper elder extract ( Peperomia pellucida J Internat Dent and Med Res 2024 17 03 1056 41 American College of Laboratory Animal Medicine. European College of Laboratory Animal Medicine Hawk C T Leary S L Morris T H Formulary for Laboratory Animals United States Blackwell Pub 2005 42 Li D Feng Y Tang H A simplified and effective method for generation of experimental murine periodontitis model Front Bioeng Biotechnol 2020 8 444 32523937 10.3389/fbioe.2020.00444 PMC7261919 43 Yudhika I Dasrul J M Histopathological overview of wound healing process in white rats ( Rattus norvegicus Chromolaena odorata J Int Surg Clin Med 2021 1 02 21 28 44 Rocha-Pereira C Silva V Costa V M Histological and toxicological evaluation, in rat, of a P-glycoprotein inducer and activator: 1-(propan-2-ylamino)-4-propoxy-9 H EXCLI J 2019 18 697 722 31611753 10.17179/excli2019-1675 PMC6785774 45 Slaoui M Bauchet A L Fiette L Tissue sampling and processing for histopathology evaluation In: Drug Safety Evaluation Meth Mol Biol 2017 1641 101 114 10.1007/978-1-4939-7172-5_4 28748459 46 Pradeep A R Suke D K Martande S S Singh S P Nagpal K Naik S B Triphala, a new herbal mouthwash for the treatment of gingivitis: a randomized controlled clinical trial J Periodontol 2016 87 11 1352 1359 27442086 10.1902/jop.2016.130406 47 Saquib S Anti-gingivitis effect of an ayurvedic formulation versus 0.2% chlorhexidine on maintenance phase: a randomized clinical trial J Basic Clin Pharm 2017 8 04 205 207 48 Mali A M Behal R Gilda S S Comparative evaluation of 0.1% turmeric mouthwash with 0.2% chlorhexidine gluconate in prevention of plaque and gingivitis: a clinical and microbiological study J Indian Soc Periodontol 2012 16 03 386 391 23162334 10.4103/0972-124X.100917 PMC3498709 49 Löe H The gingival index, the plaque index and the retention index systems J Periodontol 1967 38 06 610 616 10.1902/jop.1967.38.6.610 5237684 50 Khameneh B Iranshahy M Soheili V Fazly Bazzaz B S Review on plant antimicrobials: a mechanistic viewpoint Antimicrob Resist Infect Control 2019 8 01 118 31346459 10.1186/s13756-019-0559-6 PMC6636059 51 Nijveldt R J van Nood E van Hoorn D E Boelens P G van Norren K van Leeuwen P A Flavonoids: a review of probable mechanisms of action and potential applications Am J Clin Nutr 2001 74 04 418 425 11566638 10.1093/ajcn/74.4.418 52 Meilawaty Z Chriestedy R Recky F Cassava Leaf Flavonoid Extract on Enhancing the Gingival Epithelium Thickness of Lipopolysaccharide-Induced Rats J Int Dent Med Res 2020 13 03 909 914 53 Mutiarawati N Puspitasari S Wati S H The effectiveness of sadusina (Chinese belt leaf ointment) as a burns healing Jurnal Ilmiah Keperawatan 2022 8 01 161 168 54 Olszewska-Czyz I Kralik K Tota M Prpic J The influence of hyaluronic acid adjunctive therapy of periodontitis on salivary markers of oxidative stress: randomized, controlled clinical trial Antioxidants 2022 11 01 135 35052639 10.3390/antiox11010135 PMC8773125 55 Bral M Brownstein C N Antimicrobial agents in the prevention and treatment of periodontal diseases Dent Clin North Am 1988 32 02 217 241 3288511 56 Mosaddad S A Hussain A Tebyaniyan H Green alternatives as antimicrobial agents in mitigating periodontal diseases: a narrative review Microorganisms 2023 11 05 1269 37317243 10.3390/microorganisms11051269 PMC10220622 57 Anand B Herbal therapy in periodontics: a review J Res Pharmaceut Sci 2017 3 05 1 7 58 Masud M Emerging trends of herbal use in periodontology J Oral Health Dent 2021 4 02 326 328 59 Kumar G Jalaluddin M Rout P Mohanty R Dileep C L Emerging trends of herbal care in dentistry J Clin Diagn Res 2013 7 08 1827 1829 24086929 10.7860/JCDR/2013/6339.3282 PMC3782986 60 Natarajan M Mathew A Abuhijleh E Jaber A A Al Ansari A Babu N A Role of herbal medicine in periodontics RE:view 2021 12 01 1611 1613 61 Liu Y Liu C Wang C Treatment of periodontal inflammation in diabetic rats with IL-1ra thermosensitive hydrogel Int J Mol Sci 2022 23 22 13939 36430410 10.3390/ijms232213939 PMC9693501 62 Amaliya A Budhirahardjo I Hendiani I Histological examination of lemongrass resorbable dressing on gingival healing after gingivectomy in rats Eur J Dent 2023 17 02 403 410 35760358 10.1055/s-0042-1748197 PMC10329530 63 Jeong-Hyon K Bon-Hyuk G Sang-Soo N Yeon-Cheol P A review of rat models of periodontitis treated with natural extracts J Tradit Chin Med Sci 2020 7 02 95 103 64 Sprout S L In Vitro and In Vivo Anti-Inflammatory Effects of TEES-10 ®, a Mixture of Ethanol Extracts of Ligularia stenocephala Dent J (Basel) 2022 10 08 143 36005241 10.3390/dj10080143 PMC9406350 65 Oliveira R CG Costa C A Costa N L Silva G C Souza J AC Effects of Curcuma as an adjunct therapy on periodontal disease: a systematic review and meta-analysis Complement Ther Clin Pract 2021 45 101493 34662850 10.1016/j.ctcp.2021.101493 66 Xiao C J Yu X J Xie J L Liu S Li S Protective effect and related mechanisms of curcumin in rat experimental periodontitis Head Face Med 2018 14 01 12 30115081 10.1186/s13005-018-0169-1 PMC6097422 67 Sha A M Garib B T Azeez S H Gul S S Effects of curcumin gel on osteoclastogenic bone markers in experimental periodontitis and alveolar bone loss in Wistar rats J Dent Sci 2021 16 03 905 914 34141104 10.1016/j.jds.2020.09.015 PMC8189873 68 Vargas-Sanchez P K Pitol D L de Sousa L G Green tea extract rich in epigallocatechin gallate impairs alveolar bone loss in ovariectomized rats with experimental periodontal disease Int J Exp Pathol 2020 101 06 277 288 33174663 10.1111/iep.12379 PMC7691221 69 Čolić M Miljuš N Đokić J Pomegranate peel extract differently modulates gene expression in gingiva-derived mesenchymal stromal cells under physiological and inflammatory conditions Int J Mol Sci 2023 24 20 15407 37895087 10.3390/ijms242015407 PMC10607867 70 Mekhemar M Geib M Kumar M Hassan Y Dörfer C Salvadora persica: nature's gift for periodontal health Antioxidants 2021 10 05 712 33946353 10.3390/antiox10050712 PMC8146554 71 Mekhemar M Hassan Y Dörfer C Nigella sativa and thymoquinone: a natural blessing for periodontal therapy Antioxidants 2020 9 12 1 19 10.3390/antiox9121260 PMC7764221 33322636 ",
  "metadata": {
    "Title of this paper": "Nigella sativa and thymoquinone: a natural blessing for periodontal therapy",
    "Journal it was published in:": "European Journal of Dentistry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494456/"
  }
}