{
  "title": "Paper_1125",
  "abstract": "pmc World J Radiol 1322 worldjradiol WJR World Journal of Radiology 1949-8470 Baishideng Publishing Group Inc PMC12476805 PMC12476805.1 12476805 12476805 41025063 10.4329/wjr.v17.i9.111005 jWJR.v17.i9.eid111005 1 Editorial Comprehensive linkage between molecular biology and imaging radiomics for thyroid nodules He ZX et al. He Zhen-Xing The Third People’s Hospital of Longgang, Clinical Institute of Shantou University Medical College, Shenzhen 518115, Guangdong Province, China Zhang Xiao-Ping The Third People’s Hospital of Longgang, Clinical Institute of Shantou University Medical College, Shenzhen 518115, Guangdong Province, China Department of Nuclear Medicine and Oncology Research, Shanghai Tenth People’s Hospital, Tongji University School of Medicine, Shanghai 200072, China Yang Jian-She The Third People’s Hospital of Longgang, Clinical Institute of Shantou University Medical College, Shenzhen 518115, Guangdong Province, China Department of Nuclear Medicine and Oncology Research, Shanghai Tenth People’s Hospital, Tongji University School of Medicine, Shanghai 200072, China. 2305499@tongji.edu.cn Author contributions: Yang JS designed the overall concept and outline of the manuscript; He ZX contributed to the discussion and design of the manuscript; He ZX, Zhang XP, and Yang JS contributed to the writing and editing of the manuscript, illustrations, and literature review. Corresponding author: Jian-She Yang, PhD, Academic Fellow, Chairman, Dean, Full Professor, Professor, Department of Nuclear Medicine and Oncology Research, Shanghai Tenth People’s Hospital, Tongji University School of Medicine, No. 301 Yanchang Road, Shanghai 200072, China. 2305499@tongji.edu.cn 28 9 2025 28 9 2025 17 9 497737 111005 23 6 2025 23 7 2025 15 8 2025 28 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ Thyroid nodules are common, with a prevalence of approximately 70% on thyroid ultrasonography; approximately 5% of these nodules are malignant. Distinguishing malignant and benign thyroid nodules is critical for clinical management. Clinicians can judiciously select patients for fine-needle aspiration, understand the cytology results and subsequent follow-up, and determine surveillance strategies for non-operated nodules. The challenge in selecting thyroid nodules for fine-needle aspiration is to avoid the diagnosis of small, clinically insignificant cancers without missing more severe diseases. The molecular characteristics of thyroid nodules are critical for their diagnosis and treatment. However, identifying these characteristics is costly and challenging because of unexpected technical difficulties. An imaging association model based on molecular features will bridge the essential link between molecular characteristics and the computed tomography radiomics, then improve diagnostic efficiency, reducing invasive examinations. Thyroid nodules Thyroid cancer Molecular biology Computed tomography Radiomics pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION Thyroid nodules are common, with a prevalence of approximately 70% on thyroid ultrasonography; approximately 5% of these nodules are malignant[ 1 2 3 4 5 6 7 8 BRAF 9 13 14 HISTORICAL EVOLUTION OF DIAGNOSTIC PARADIGMS Between 1980 and 2010, medical diagnoses underwent a fundamental shift from reliance on experience to the use of visual evidence[ 15 16 17 19 20 21 23 Ultrasound revolution: From A-mode to real-time elastography A-mode foundation period: One-dimensional amplitude imaging based on tissue interface reflection, mainly used for basic anatomical positioning such as axial measurement of the eye. B-mode structural imaging: Two-dimensional grayscale images are used to visualize organ morphology, which became the core paradigm of ultrasonic diagnosis, but it could not quantify the mechanical properties of tissues. Elastic imaging revolution: Ophir team proposed the principle of quantifying elastic modulus through tissue strain response, which opened a new era of functional ultrasound[ 24 26 Core principles of elastic imaging technology: Static/quasi-static elastic imaging The strain distribution was calculated by inducing tissue deformation using external pressure. For instance, the Young’s modulus of cancerous tissues is four to eight times higher than that of normal tissues, enabling the visualization of breast tumor hardness (with a sensitivity of 89.2% and a specificity of 92.7%)[ 27 28 Dynamic elastic imaging works by using the propagation speed of shear waves to quantitatively measure the shear modulus (Cs = μ/ρ). Currently, a multi-core digital signal processor has achieved real-time processing at 0.5 milliseconds per frame, overcoming the computational limitations of cross-correlation algorithms and significantly enhancing diagnostic value[ 29 30 Furthermore, multimodal fusion has emerged as a new trend in disease diagnosis. For instance, the integration of elastic B-mode ultrasound imaging has increased the specificity of breast lesion diagnosis from 68% to 92%[ 31 32 33 CT limitations: Early concerns about radiation exposure Radiation concerns primarily focus on three areas: The risk of cancer (especially in children), the risk to specific groups (such as pregnant women), and overtesting. In terms of technical parameters, the safe dose threshold for routine chest CT scans is approximately 5-10 mSv, whereas early low-dose CT scans have reduced this to 1-2 mSv[ 34 35 36 37 38 39 CORE DATA ON EARLY RADIATION CONCERNS Carcinogenic risk quantification The effective dose of conventional chest CT is 6-8 mSv (approximately 100 chest X-ray doses). A collection of epidemiological studies have shown that children who undergo CT examinations can increase the risk of leukemia by 24%. In these studies, there were eight studies of leukemia risk in relation to red bone marrow dose, effective dose or number of CTs; seven reported a positive dose-response, which was statistically significant ( P n P 40 Dose threshold controversy A single dose of 10 mSv radiation can increase the lifetime risk of cancer by 0.05%, whereas the average dose of abdominal CT is 10-30 mSv[ 41 43 Risk for special groups First, the carcinogenic sensitivity of children per unit dose is 5-10 times that of adults, and pelvic CT in early pregnancy causes fetal exposure to 10-30 mGy of radiation, which reaches the threshold of intellectual disability risk of 1/59[ 44 45 46 47 48 In summary, the “As Low As Reasonably Achievable” principle has become the international standard. Despite the technical paradox that dose reduction may induce more frequent examinations, the next generation of photon-counting CT is expected to reduce the radiation dose to 1/4 that of traditional CT and improve the spatial resolution by 100% through a balanced. TI-RADS STANDARDIZATION CHALLENGES: 2017 ACR GUIDELINES VS The standardization of thyroid imaging reporting systems faces major challenges, and it is necessary to evaluate them in three dimensions: Standard differences, clinical impact, and integration of molecular technology. In particular, the comparison between the ACR TI-RADS in 2017 and the American Thyroid Association (ATA) guidelines in 2015 should be considered in conjunction with the background of the “molecular dawn”[ 7 The ACR TI-RADS uses a quantitative scoring system (covering five dimensions: Composition, echogenicity, shape, margin, and intensity) to assess the risk of malignancy, whereas the ATA guidelines emphasize qualitative pattern descriptions, such as ‘highly suspicious’ features. Notably, the ACR deliberately lowered the threshold for the TR5 malignancy probability to 20% or higher, which is significantly more conservative than the > 80% threshold of the Kwak system in South Korea, possibly to prevent overtreatment[ 49 Different guidelines also exhibit significant differences in clinical practice, primarily in the following ways: ACR recommends a biopsy for TR5 nodules measuring 1 cm, whereas ATA directly suggests surgery for highly suspicious nodules of 1 cm or larger. This discrepancy can lead to the same nodule being treated with either biopsy or surgery at different hospitals, highlighting the pain point of the lack of standardization. The differences in follow-up protocols are even more pronounced: The ACR mandates annual follow-ups for TR5 nodules for five years, while the ATA recommends re-examinations every 6-18 months for low-risk nodules. From the start of the ultrasound examination, through different classification logic, the final endpoint is the size threshold difference between FNA, follow-up, or surgery at TR5 nodes (1 cm vs The deep root of the dilemma of standardization The “ultralow echo” defined by the ACR needs to be lower than the echo of the anterior neck muscle; however, only 28% of physicians can accurately identify this feature in clinical practice. The “irregular edge” of the ATA includes various subtypes, including lobulation, burr, and angular formation, resulting in only 63% consistency among observers. Technological disconnection in the age of molecules Neither system integrated the results of gene tests such as BRAF/V600E 50 7 LANDMARK STUDIES: THE CANCER GENOME ATLAS THYROID COHORT The landmark significance of The Cancer Genome Atlas (TCGA) thyroid cancer cohort study lies primarily in the new mechanism research on KDM4C 51 The TCGA Thyroid Cancer Cohort Milestone Study is described below. Molecular typing revolution BRAF-RAS BRAF RAS BRAF RAS BRAF V600E RAS RET/PTC PAX8/PPARγ ETV6-NTRK3 51 First, the key signaling pathways associated with these include mitogen-activated protein kinases (MAPK) pathway activation, BRAF RAS KDM4C KDM4C 51 Second, the core findings of clinical transformation have shown revolutionary advances. Telomerase reverse transcriptase promoter mutation was a prognostic marker for the high-risk group; 11.2% of TP53 51 Therapeutic targets of epigenetic targets: KDM4C inhibitors reduced tumor growth by 71.3% and significantly increased glutathione levels. Gene fusion targeting the tropomyosin-related tyrosine kinase inhibitor larotrectinib resulted in an objective response rate of 85% in patients who received neurotrophic tropomyosin-receptor kinase fusion. Immune therapy response: The programmed cell death 1 inhibitor response rate increased to 34.6% ( vs ) 51 Methodological innovation value of multi-omics integrated analysis. For the first time, a regulatory network of methylation, transcriptomics, and proteomics in thyroid cancer has been established, revealing the epigenetic silencing mechanism of the Wnt/β-catenin pathway. Protein phosphorylation profiles capture the feedback activation loop of the MAPK pathway, explaining the mechanisms underlying resistance to targeted therapy. Additionally, insights from pan-cancer studies have revealed the conserved role of the KDM4C-CTSL axis in epithelial tumors, such as breast and thyroid cancers, establishing a dual-track carcinogenesis model of ‘driver mutations with epigenetic modifications’, which is advancing the development of targeted epigenetic editing therapies. By systematically analyzing the multi-omics features of 496 cases of thyroid cancer, this cohort reconstructed the molecular classification framework of the disease and gave rise to a new therapeutic paradigm of targeted epigenetic regulation[ 51 Clinically adopted markers Multimodal detection has emerged as a new trend, aligned with the integrated diagnostic approach advocated by TCGA. However, it is crucial to highlight the differences in practical clinical applications; for instance, thyroglobulin (Tg) testing must be accompanied by Tg antibody testing to avoid false negatives, which are critical for clinical judgment. To date, tumor markers have been used in clinical practice, particularly those related to thyroid cancer, including Tg, a key marker for monitoring differentiated thyroid cancer post-surgery; calcitonin (Ct); and carcinoembryonic antigen (CEA), for diagnosing and tracking medullary carcinoma. BRAF Tg is primarily used to diagnose differentiated cancers such as papillary and follicular types. It serves as the gold standard for postoperative monitoring with a negative predictive value of < 1 ng/mL, indicating no residual lesions after total resection. Elevated Tg levels serve as an early warning of tumor recurrence; however, it is essential to simultaneously test for Tg antibodies. The Ct for CEA-positive myeloid carcinoma is mainly used for preoperative diagnosis. A postoperative Ct > 150 pg/mL indicates a risk of metastasis. CEA levels have a high false-positive rate in inflammatory/smokers. The BRAF V600E TP53 Using an intelligent integration model, the area under the curve of malignancy risk prediction for thyroid nodules can be obtained by integrating the genome, clinical characteristics, and ultrasound images. Circulating tumour DNA (ctDNA) methylation markers (such as Ras association domain family protein1 isoform A) were used to predict the recurrence of thyroid cancer with early warning. Current marker applications have shifted to a new paradigm of stratification (by cancer subtype), dynamism (trends are better than single values), and integration (multistatistical data linkage). RULE-OUT: AFIRMA GENE SEQUENCING CLASSIFIER (NEGATIVE PREDICTIVE VALUE 96%) AND RULE-IN: THYROSEQ V3 (POSITIVE PREDICTIVE VALUE 83%) To date, there are two genomic detection technologies for thyroid nodules: The exclusion value of Afirma Gene Sequencing Classifier (GSC) (96% negative predictive value) and the confirmation value of ThyroSeq v3 [83% positive predictive value (PPV)]. These technologies have specific applications in molecular diagnostics for clinical decision making. Key data on ThyroSeq v3: It achieved an 83% PPV for Bethesda III/IV category nodules, complementing the predictive model approach in neoadjuvant therapy scenarios. In medical practice, its 96% negative predictive value is widely recognized as a key advantage[ 52 Indeterminate thyroid nodules (most likely Bethesda III or IV) require a decision regarding whether to use molecular testing to avoid unnecessary surgery. The clinical risk of “exclusion of false negatives” and “confirmation of false positives” is precisely the pain point in thyroid nodule management, which includes the following aspects: (1) The complementary nature of the two technologies; (2) Recommendations for integrating clinical pathways; and (3) Precautions in special scenarios (such as young patients who are more concerned about negative predictive value to avoid over-treatment). Bethesda stage III/IV nodules account for 20% of FNA cases and are the target population. The stratification approach for liver cancer markers can be applied to the thyroid field, highlighting the combined value of ‘ruling out’ and ‘confirming’ technologies. In clinical practices, an integration plan is needed, which consists of: (1) Afirma Gene Expression Classifier: A ‘safety valve’ to avoid over-surgery, it is suitable for Bethesda Class III: Atypical cell of undetermined significance/follicular lesion of undetermined significance and IV: Follicular neoplasm/suspicious for follicular neoplasm nodules. Its clinical value lies in the negative result (benign determination), which can prevent 61% of Bethesda Class III/IV patients from undergoing diagnostic surgery, with a negative predictive value of 96%, equivalent to the gold standard of histopathology; and (2) ThyroSeq v3: A ‘precise identifier’ for high-risk lesions, capable of detecting 112 genetic variants (including point mutations, fusions, copy number variations, and gene expression profiles). Positive results can guide personalized surgical approaches such as total resection and lymph node dissection for BRAF TERT TP53 The combined use of these two technologies can significantly enhance clinical benefits; however, it is essential to adhere to the following principles during later follow-ups or ongoing treatments. For young patients with micronodules (< 1 cm) and negative Afirma GSC, annual follow-up is recommended to avoid overtreatment. For nodules with calcification or an aspect ratio > 1 and positive ThyroSeq v3, total thyroidectomy is recommended to reduce the reoperation rate by 89%. In cases of follicular tumors associated with Hashimoto’s thyroiditis, sequential testing with negative Afirma can reduce the misdiagnosis rate of ThyroSeq to < 3%. The 2025 National Comprehensive Cancer Network guidelines recommend a strategy of Afirma initial screening, followed by ThyroSeq supplementation. The current evidence supports the formation of a “rule-out-confirmation” dual-track system between Afirma GSC and ThyroSeq v3, which achieves a closed loop of precision diagnosis and treatment through hierarchical application, allowing more than 80% of patients with uncertain thyroid nodules to avoid unnecessary surgery[ 53 TECHNICAL SYNERGY MECHANISMS Radiomics feature extraction To analyze the technical collaboration mechanisms in image omics feature extraction, it is necessary to delve into the technical details. The fundamental processes of image omics encompass the core aspects of feature extraction. The open-radiomics standardized dataset and its deep learning framework serve as key examples of technical collaboration. The core of these technologies lies in the classification of feature extraction methods (traditional vs Technical coordination mechanism for image omics feature extraction First, the multi-dimensional feature extraction framework, complementary integration of traditional manual features (interpretability), and deep learning features (high-dimensional pattern recognition) improve the robustness of the model. Second, the cross-modal data integration mechanism, collaborative mode and clinical value imaging-gene association technology primarily involve quantifying gene expression profiles (such as epidermal growth factor receptor /TERT The technical challenges associated with mechanical differences in the aforementioned algorithms can be addressed and mitigated through appropriate measures. For instance, feature drift caused by differences in scanning protocols can be corrected using the ComBat algorithm to address multicenter batch effects. The subjective nature of manually delineating regions of interest can be replaced by three-dimensional (3D) U-Net automatic segmentation. Least absolute shrinkage and selection operator regression combined with random forests can reduce feature dimensions (feature compression). Furthermore, quantized feature extraction can accelerate high-dimensional texture calculations, and customized feature libraries for organs such as the thyroid and ovaries can be developed using organ-specific protocols. Currently, the extraction of imaging-omics features has significantly enhanced disease representation capabilities through three key technological advancements: Integration of traditional and deep learning methods, collaboration of multimodal data, and standardized processes, providing a quantifiable basis for precision diagnosis and treatment. Spatial resolution requirements optimal 0.5 mm isotropic voxels There are three key areas to discuss regarding the professional requirements for spatial resolution. Firstly, from a clinical value perspective, it is emphasized that neurosurgical planning requires the unambiguous localization of functional areas, and 0.7 μm-level micro-CT can provide a 3D structure of soft tissues[ 54 55 The resolution of 0.5 mm can clearly distinguish brain functional areas (such as the motor/Language cortex), and the positioning error of functional areas in surgical planning is reduced to < 1 mm, significantly reducing the risk of nerve damage[ 56 First-order: Skewness (> 1.5 predicts TERT mutations) A skewness greater than 1.5 is a specific parameter that predicts TERT 57 58 TERT 59 TERT 60 61 62 TERT CTNNB1 63 The following section presents an analysis of the association mechanism and clinical application of first-order skewness parameters in imaging omics and TERT TERT TERT 64 CTNNB1 65 Second-order: Gray-level co-occurrence matrix dissimilarity The second-order feature gray-level co-occurrence matrix (GLCM) dissimilarity of image omics was correlated with programmed death ligand-1 (PD-L1) expression, which included information related to texture features and immunotherapy[ 66 67 In the clinical setting, the degree of heterogeneity can be used to predict the efficacy of immunotherapy. Animal studies have shown that combining fumarate interventions significantly enhances the effectiveness of PD-L1 blockade, offering new insights into the use of imaging omics to guide combination therapies[ 68 Sphericity index < 0.7 indicates extrathyroidal extension There is correlation between morphological features in image omics, such as the spherical index (SI) and extrathyroid extension (ETE) of thyroid cancer[ 69 70 The Chinese Thyroid Ultrasound Reporting and Data System emphasizes the importance of nodule location (morphological equivalence), particularly highlighting the correlation between vertical nodules and malignant tumors[ 71 The pathological and imaging correlation of a transparent rod-shaped thyroid tumor with clear tumor margins (complete capsule) was consistent with a high degree of sphericity, which indirectly supports the predictive value of morphological features for invasiveness[ 72 The pathological mechanism involves a decrease in sphericity, which reflects the invasive growth pattern of cancer cells as they penetrate the capsule. However, a single parameter may be limited, and it is necessary to consider additional features such as microcalcifications and blurred margins for a comprehensive assessment. Additionally, ectopic thymic thyroid lesions can be misdiagnosed as malignant nodules. These benign lesions typically have clear boundaries (high sphericity) and can serve as negative controls to verify SI specificity of the sphericity index. The mechanism involves the destruction of the continuity of the capsule by the invasive growth of cancer cells, resulting in irregularization of the tumor contour and a decrease in sphericity. A sphericality of < 0.7 with 83% sensitivity and 79% specificity was used to predict ETE[ 73 74 75 MOLECULAR-RADIOMIC CORRELATIONS Molecular markers, such as BRAF V600E RAS PAX8-PPARG BRAF V600E BRAF RAS BRAF RAS BRAF RAS PAX8-PPARG Clinical correlation between molecular markers and imaging features of thyroid carcinoma The multimodal association model integrates molecular and imaging features to achieve an accurate classification and individualized management of thyroid cancer. The imaging features associated with the BRAF V600E 76 77 BRAF V600E P 77 RAS 78 79 PAX8-PPARG 80 CLINICAL IMPLEMENTATION MODELS Decision support systems The implementation models of the clinical decision support system (CDSS) are divided into two types: Knowledge-driven and data-driven[ 81 82 83 84 Memorial Sloan Kettering model This model was developed through collaboration between the Memorial Sloan Kettering Cancer Center (MSKCC) and the National Cancer Institute and uses routine clinical data to predict the effectiveness of immunotherapy[ 85 86 A Bayesian sequence network provides a crucial reference for technical implementation. This framework can handle classification tasks, such as cancer grading, survival analysis, and progression-free survival, which align well with the multitask capabilities of the MSKCC model[ 87 88 In clinical applications, the model output directly influences the selection of immune checkpoint inhibitors. By integrating multi-omics trends, this model can potentially generate automated reports through digital pathology, thereby forming a theoretical basis for deploying the model within the Epic system. Interestingly, both emphasize the value of dynamic monitoring of ctDNA, and future model iterations may incorporate liquid biopsy parameters. However, it is important to avoid overinterpreting the details of these features. The 18 imaging features included texture analysis (GLCM) and morphological parameters (sphericity). TMB and potential PD-L1 expression in molecular features are key predictors of immunotherapy, whereas other features may involve the RAS/RAF TREATMENT GUIDANCE The CDSS implementation model and MSKCC’s multimodal prediction model have been discussed previously. Taken together, these findings support a more comprehensive framework for informed treatment decision-making. First, the latest data from American Society of Clinical Oncology 2025 on targeted immunotherapy combinations showed significant improvements in progression-free survival[ 89 90 KRAS Surgical planning: 3D radiomics maps with intraoperative molecular margins The application of the 3D Slicer and Sina/MosoCam multimodal systems in brain surgery planning is supported by 3D image technology[ 91 92 93 94 Technical architecture and clinical value of a surgical decision-making system that integrates 3D imaging omics atlases with intraoperative molecular boundary navigation. The core technology modules include preoperative 3D imaging, omics planning, and intraoperative molecular boundary navigation. Preoperative 3D imaging-omics planning uses multi-modal image fusion to create metabolic maps from MRI-DTI/T1-CE with positron emission tomography/CT, thereby establishing a tumor boundary probability model. Detailedly, the 3D surgical planning runs as the following core steps: (1) Data acquisition: High-resolution CT or MRI scans are performed, specifically acquiring thin slices to capture detailed anatomical information; (2) Image post-processing and segmentation: Raw imaging data is fed into specialized software. Radiologists or trained technicians, sometimes with the aid of AI algorithms, segment (outline and isolate) specific organs, vessels, bones, and pathologies of interest. This creates a virtual 3D model; and (3) Surgical simulation and planning: The surgeon interacts with the 3D model using dedicated software. Virtual dissections and bone cuts are performed and implants are virtually positioned and sized. Surgical approaches are simulated to optimize trajectory and avoid critical structures. Measurements are taken, and potential challenges are identified. Based on the virtual plan, surgical guides/models are created, including patient-specific 3D printed anatomical models or surgical cutting/drilling guides. These physical guides are sterilized and used in the operating room to precisely execute the pre-operative plan. Additionally, in some advanced operating rooms, the pre-operative 3D plan can be loaded into an intraoperative navigation system. Regarding to the thyroid nodules for 3D surgical planning, identifying the exact extent of a tumor and its proximity to critical structures like the carotid artery requires detailed 3D visualization to optimize margins and minimize functional deficits. This model visualizes tumor invasion and functional cortex avoidance zones. The model enables the real-time recognition of tumor necrosis factor related apoptosis-inducing ligand/tumour necrosis factors receptors apoptosis pathway activation areas at the cellular level using wide-field microscopy, thereby enhancing the sensitivity of intraoperative droplet digital polymerase chain reaction detection of isocitrate dehydrogenase 1 mutations[ 95 Thyroid stimulating hormone suppression: Radiomic surrogate for MAPK pathway activity Integrating knowledge from three areas - thyroid cancer therapy, molecular pathways, and radiomics - is essential for thyroid cancer treatment. Confirming the clinical value of the MAPK pathway in gliomas and emphasizing the importance of post-surgery thyroid stimulating hormone (TSH) inhibition therapy for low-risk papillary thyroid carcinoma is crucial. A radiomics model for evaluating the efficacy of epidermal growth factor receptor-tyrosine kinase inhibitors in lung adenocarcinoma can serve as a methodological reference[ 96 The potential of deep convolutional neural networks to diagnose thyroid cancer can serve as a basis for algorithm selection[ 97 Finally, a three-tier framework of “mechanism-model-application” was constructed to solve the practical issues. The molecular mechanism explained this correlation, the omics model showed feasibility, and a clinical decision tree was constructed. It should be noted that the control target of TSH should be combined with dynamic monitoring of imaging characteristics. This scheme can dynamically map the MAPK pathway status through noninvasive imaging markers to achieve accurate titration and toxicity control of TSH inhibition therapy. CURRENT CHALLENGES Technical barriers Current technical barriers to TSH suppression therapy include individual differences in drug sensitivity, which can vary by up to threefold among patients, leading to poor outcomes with traditional fixed-dose regimens. Another challenge is the delayed monitoring of bone metabolism. Routine bone density tests take six months to show changes, making it difficult to provide timely warnings about osteoporosis risks. A dilemma exists between risk stratification and managing the side-effect of recurrence. High-risk patients need TSH < 0.1 mIU/L, but strong inhibition can increase the risk of atrial fibrillation. The pharmacological mechanism level is the p38-MAPK pathway, which has been proven to affect the sensitivity of myocardial cells to thyroid hormones. However, existing detection methods depend on myocardial biopsy, which is difficult to implement in a clinical setting. Noninvasive monitoring will be a breakthrough in the future. The TSH suppression target should be determined by combining the risk stratification of tumor recurrence (high, medium, and low-risk) with the risk of side effects (cardiovascular and skeletal systems). However, patient sensitivity to levothyroxine sodium can vary by more than three times, and traditional dose adjustments rely on empirical trial and error. Currently, there is a lack of real-time feedback tools, and the postoperative TSH target achievement rate is only approximately 35%-50%, influenced by factors such as drug absorption variability and metabolic interference. These technical barriers lead to the fact that TSH inhibition therapy remains in the stage of “extensive regulation”, and it is urgent to promote precision breakthroughs through interdisciplinary collaboration. Temporal discordance: Molecular changes between FNA and resection There was a 22% molecular feature inconsistency between FNA and surgical resection samples[ 98 99 Nevertheless, technological iterations may solve current thorny problems, such as 100% pure cell sorting technology implemented in the DEPArray ™ 100 101 in situ 102 103 FUTURE DIRECTIONS The correlation between single-cell radiomics and spatial transcriptomics is exploding, but the description of concepts such as “virtual cells” should be handled carefully to avoid overinterpretation. Single-cell molecular typing has enabled the single-cell sequencing of FNA samples from thyroid nodules to identify seven malignancy subtypes. The methylation marker THYRA-Methyl ® BRAF Current molecular testing has evolved from single-gene analysis to multi-omics integration, with its core value in providing a definitive diagnosis of Bethesda III-IV nodules, guiding the choice of local treatment methods, and identifying patients who would benefit from targeted therapy. However, issues such as standardizing testing, controlling costs, and integrating clinical pathways remain to be addressed. The 2025 China Anti-Cancer Association guidelines recommend that tertiary hospitals establish joint molecular imaging diagnostic centers to address this challenge. However, these techniques have obvious limitations, such as the false negative rate of FNA, high cost of molecular testing, and so on, which will possibly enhance the clinical-decision risk and hinder its broader application. With the priority of non-invasiveness of imaging techniques and the precise single-cell sequencing operation, a molecular-imaging linkage model is expected to solve these issues. On the other hand, current spatial transcriptomics technologies face significant challenges. While sequencing-based approaches can cover entire genomes, their resolution is constrained by multicellular mixing. Imaging methods, though enabling single-cell resolution, have limitations in gene detection capacity. Existing computational methods encounter issues such as low efficiency, high memory consumption, and biological signal dilution when processing data from ultra-large-scale and ultra-high-resolution technologies. These issues also need to be resolved urgently. CONCLUSION Early and precise diagnosis and treatment of thyroid nodules require comprehensive techniques and methods that include, but are not limited to, empirical physicians, advanced imaging, and novel biomarkers. This integrated field will reshape the prevention and control systems of major diseases and promote the strategic transformation of medical decision-making from “anatomical orientation” to “molecular mechanism orientation”.  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Corresponding Author’s Membership in Professional Societies:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 American Thyroid Association (ATA) Guidelines Taskforce on Thyroid Nodules and Differentiated Thyroid Cancer Cooper DS Doherty GM Haugen BR Kloos RT Lee SL Mandel SJ Mazzaferri EL McIver B Pacini F Schlumberger M Sherman SI Steward DL Tuttle RM Revised American Thyroid Association management guidelines for patients with thyroid nodules and differentiated thyroid cancer Thyroid 2009 19 1167 1214 19860577 10.1089/thy.2009.0110 2 Popoveniuc G Jonklaas J Thyroid nodules Med Clin North Am 2012 96 329 349 22443979 10.1016/j.mcna.2012.02.002 PMC3575959 3 Wang H Wang X Du YS Wang Y Bai ZJ Wu D Tang WL Zeng HL Tao J He J Non-contrast computed tomography radiomics model to predict benign and malignant thyroid nodules with lobe segmentation: A dual-center study World J Radiol 2025 17 106682 40606044 10.4329/wjr.v17.i6.106682 PMC12210200 4 Wang CC Friedman L Kennedy GC Wang H Kebebew E Steward DL Zeiger MA Westra WH Wang Y Khanafshar E Fellegara G Rosai J Livolsi V Lanman RB A large multicenter correlation study of thyroid nodule cytopathology and histopathology Thyroid 2011 21 243 251 21190442 10.1089/thy.2010.0243 PMC3698689 5 Tollin SR Mery GM Jelveh N Fallon EF Mikhail M Blumenfeld W Perlmutter S The use of fine-needle aspiration biopsy under ultrasound guidance to assess the risk of malignancy in patients with a multinodular goiter Thyroid 2000 10 235 241 10779138 10.1089/thy.2000.10.235 6 Haugen BR Alexander EK Bible KC Doherty GM Mandel SJ Nikiforov YE Pacini F Randolph GW Sawka AM Schlumberger M Schuff KG Sherman SI Sosa JA Steward DL Tuttle RM Wartofsky L 2015 American Thyroid Association Management Guidelines for Adult Patients with Thyroid Nodules and Differentiated Thyroid Cancer: The American Thyroid Association Guidelines Task Force on Thyroid Nodules and Differentiated Thyroid Cancer Thyroid 2016 26 1 133 26462967 10.1089/thy.2015.0020 PMC4739132 7 Tessler FN Middleton WD Grant EG Hoang JK Berland LL Teefey SA Cronan JJ Beland MD Desser TS Frates MC Hammers LW Hamper UM Langer JE Reading CC Scoutt LM Stavros AT ACR Thyroid Imaging, Reporting and Data System (TI-RADS): White Paper of the ACR TI-RADS Committee J Am Coll Radiol 2017 14 587 595 28372962 10.1016/j.jacr.2017.01.046 8 Cibas ES Ali SZ The 2017 Bethesda System for Reporting Thyroid Cytopathology Thyroid 2017 27 1341 1346 29091573 10.1089/thy.2017.0500 9 Nikiforova MN Mercurio S Wald AI Barbi de Moura M Callenberg K Santana-Santos L Gooding WE Yip L Ferris RL Nikiforov YE Analytical performance of the ThyroSeq v3 genomic classifier for cancer diagnosis in thyroid nodules Cancer 2018 124 1682 1690 29345728 10.1002/cncr.31245 PMC5891361 10 Patel KN Angell TE Babiarz J Barth NM Blevins T Duh QY Ghossein RA Harrell RM Huang J Kennedy GC Kim SY Kloos RT LiVolsi VA Randolph GW Sadow PM Shanik MH Sosa JA Traweek ST Walsh PS Whitney D Yeh MW Ladenson PW Performance of a Genomic Sequencing Classifier for the Preoperative Diagnosis of Cytologically Indeterminate Thyroid Nodules JAMA Surg 2018 153 817 824 29799911 10.1001/jamasurg.2018.1153 PMC6583881 11 Santos MTD Buzolin AL Gama RR Silva ECAD Dufloth RM Figueiredo DLA Carvalho AL Molecular Classification of Thyroid Nodules with Indeterminate Cytology: Development and Validation of a Highly Sensitive and Specific New miRNA-Based Classifier Test Using Fine-Needle Aspiration Smear Slides Thyroid 2018 28 1618 1626 30319072 10.1089/thy.2018.0254 PMC6308280 12 Zarkesh M Zadeh-Vakili A Azizi F Foroughi F Akhavan MM Hedayati M Altered Epigenetic Mechanisms in Thyroid Cancer Subtypes Mol Diagn Ther 2018 22 41 56 28986854 10.1007/s40291-017-0303-y 13 Ahmed AA Essa MEA Potential of epigenetic events in human thyroid cancer Cancer Genet 2019 239 13 21 31472323 10.1016/j.cancergen.2019.08.006 14 Castillo T JM Starmans MPA Arif M Niessen WJ Klein S Bangma CH Schoots IG Veenland JF A Multi-Center, Multi-Vendor Study to Evaluate the Generalizability of a Radiomics Model for Classifying Prostate cancer: High Grade vs. Low Grade Diagnostics (Basel) 2021 11 369 33671533 10.3390/diagnostics11020369 PMC7926758 15 Ratnani I Fatima S Abid MM Surani Z Surani S Evidence-Based Medicine: History, Review, Criticisms, and Pitfalls Cureus 2023 15 e35266 36968905 10.7759/cureus.35266 PMC10035760 16 Schuijf JD Lima JAC Boedeker KL Takagi H Tanaka R Yoshioka K Arbab-Zadeh A CT imaging with ultra-high-resolution: Opportunities for cardiovascular imaging in clinical practice J Cardiovasc Comput Tomogr 2022 16 388 396 35210183 10.1016/j.jcct.2022.02.003 17 Buchbinder BR Functional magnetic resonance imaging Handb Clin Neurol 2016 135 61 92 27432660 10.1016/B978-0-444-53485-9.00004-0 18 Finn ES Poldrack RA Shine JM Functional neuroimaging as a catalyst for integrated neuroscience Nature 2023 623 263 273 37938706 10.1038/s41586-023-06670-9 19 Zhao L Advances in functional magnetic resonance imaging-based brain function mapping: a deep learning perspective Psychoradiology 2025 5 kkaf007 40401160 10.1093/psyrad/kkaf007 PMC12093097 20 Nagaraja N Diffusion weighted imaging in acute ischemic stroke: A review of its interpretation pitfalls and advanced diffusion imaging application J Neurol Sci 2021 425 117435 33836457 10.1016/j.jns.2021.117435 21 Wang S Pan J Zhang X Li Y Liu W Lin R Wang X Kang D Li Z Huang F Chen L Chen J Towards next-generation diagnostic pathology: AI-empowered label-free multiphoton microscopy Light Sci Appl 2024 13 254 39277586 10.1038/s41377-024-01597-w PMC11401902 22 Khalid N Zubair M Mehmood MQ Massoud Y Emerging paradigms in microwave imaging technology for biomedical applications: unleashing the power of artificial intelligence Npj Imaging 2024 2 13 40604241 10.1038/s44303-024-00012-8 PMC12118711 23 Łoginoff J Majos A Elgalal M The Evolution of Custom Subperiosteal Implants for Treatment of Partial or Complete Edentulism in Patients with Severe Alveolar Ridge Atrophy J Clin Med 2024 13 3582 38930111 10.3390/jcm13123582 PMC11205043 24 Margulis AR Recent advances in clinical diagnostic radiology. 4. Interventional diagnostic roentgenology Adv Surg 1971 5 88 102 4941825 25 Harvey CJ Pilcher JM Eckersley RJ Blomley MJ Cosgrove DO Advances in ultrasound Clin Radiol 2002 57 157 177 11952309 10.1053/crad.2001.0918 26 Golemati S Cokkinos DD Recent advances in vascular ultrasound imaging technology and their clinical implications Ultrasonics 2022 119 106599 34624584 10.1016/j.ultras.2021.106599 27 Massey A Stewart J Smith C Parvini C McCormick M Do K Cartagena-Rivera AX Mechanical properties of human tumour tissues and their implications for cancer development Nat Rev Phys 2024 6 269 282 38706694 10.1038/s42254-024-00707-2 PMC11066734 28 Blake OO Ramsook R Faulkner DR Iyare UC The Effect of Effective Pressure on the Relationship Between Static and Dynamic Young’s Moduli and Poisson’s Ratio of Naparima Hill Formation Mudstones Rock Mech Rock Eng 2020 53 3761 3778 29 Wang Y Wang Q Pei X Mei S Liu J Optimizing Pointwise Convolutions on Multi-core DSPs. In: Tari Z, Li K, Wu H. Algorithms and Architectures for Parallel Processing. ICA3PP 2023. Lecture Notes in Computer Science. Singapore: Springer, 2024 30 Liu Z Ni S Yang C Sun W Huang D Su H Shu J Qin N Axillary lymph node metastasis prediction by contrast-enhanced computed tomography images for breast cancer patients based on deep learning Comput Biol Med 2021 136 104715 34388460 10.1016/j.compbiomed.2021.104715 31 Zhang X Liang M Yang Z Zheng C Wu J Ou B Li H Wu X Luo B Shen J Deep Learning-Based Radiomics of B-Mode Ultrasonography and Shear-Wave Elastography: Improved Performance in Breast Mass Classification Front Oncol 2020 10 1621 32984032 10.3389/fonc.2020.01621 PMC7485397 32 Çetin Tunçez H Murat Koç A Hilal Adıbelli Z Zeynep Arslan F Argon A Yücel Oğuzdoğan G Diagnostic Efficacy of Ultrasonography, Doppler Ultrasonography and Elastography in the Evaluation of Suspected Malignant Lymph Nodes J Ultrason 2023 23 1 9 36880001 10.15557/JoU.2023.0001 PMC9985183 33 Pu C Wu T Wang Q Yang Y Zhang K Feasibility of novel intraoperative navigation for anatomical liver resection using real-time virtual sonography combined with indocyanine green fluorescent imaging technology Biosci Trends 2024 17 484 490 38092390 10.5582/bst.2023.01265 34 Ippolito D Maino C Pecorelli A Salemi I Gandola D Riva L Talei Franzesi C Sironi S Application of low-dose CT combined with model-based iterative reconstruction algorithm in oncologic patients during follow-up: dose reduction and image quality Br J Radiol 2021 94 20201223 34233459 10.1259/bjr.20201223 PMC8764930 35 Chi J Xu D Yin S Li M Shen L Ding N Chen X Ji Y Reducing the radiation dose of pediatric paranasal sinus CT using an ultralow tube voltage (70 kVp) combined with iterative reconstruction: Feasibility and image quality Medicine (Baltimore) 2020 99 e21886 32846848 10.1097/MD.0000000000021886 PMC7447483 36 Bosch de Basea M Thierry-Chef I Harbron R Hauptmann M Byrnes G Bernier MO Le Cornet L Dabin J Ferro G Istad TS Jahnen A Lee C Maccia C Malchair F Olerud H Simon SL Figuerola J Peiro A Engels H Johansen C Blettner M Kaijser M Kjaerheim K Berrington de Gonzalez A Journy N Meulepas JM Moissonnier M Nordenskjold A Pokora R Ronckers C Schüz J Kesminiene A Cardis E Risk of hematological malignancies from CT radiation exposure in children, adolescents and young adults Nat Med 2023 29 3111 3119 37946058 10.1038/s41591-023-02620-0 PMC10719096 37 Matsunaga Y Haba T Kobayashi M Suzuki S Asada Y Chida K Assessment of fetal radiation exposure in pregnant women undergoing computed tomography and rotational angiography examinations for pelvic trauma Radiat Prot Dosimetry 2024 200 580 587 38486458 10.1093/rpd/ncae058 38 Zhu S Zhang B Tian Q Li A Liu Z Hou W Zhao W Huang X Xiao Y Wang Y Wang R Li Y Yang J Jin C Reduced-dose deep learning iterative reconstruction for abdominal computed tomography with low tube voltage and tube current BMC Med Inform Decis Mak 2024 24 389 39696218 10.1186/s12911-024-02811-w PMC11658360 39 Solomon DZ Ayalew B Dellie ST Admasie D Justification and Optimization Principles of ALARA in Pediatric CT at a Teaching Hospital in Ethiopia Ethiop J Health Sci 2020 30 761 766 33911838 10.4314/ejhs.v30i5.16 PMC8047270 40 Berrington de Gonzalez A Pasqual E Veiga L Epidemiological studies of CT scans and cancer risk: the state of the science Br J Radiol 2021 94 20210471 34545766 10.1259/bjr.20210471 PMC9328069 41 Brenner DJ Doll R Goodhead DT Hall EJ Land CE Little JB Lubin JH Preston DL Preston RJ Puskin JS Ron E Sachs RK Samet JM Setlow RB Zaider M Cancer risks attributable to low doses of ionizing radiation: assessing what we really know Proc Natl Acad Sci U S A 2003 100 13761 13766 14610281 10.1073/pnas.2235592100 PMC283495 42 Mullenders L Atkinson M Paretzke H Sabatier L Bouffler S Assessing cancer risks of low-dose radiation Nat Rev Cancer 2009 9 596 604 19629073 10.1038/nrc2677 43 Hauptmann M Daniels RD Cardis E Cullings HM Kendall G Laurier D Linet MS Little MP Lubin JH Preston DL Richardson DB Stram DO Thierry-Chef I Schubauer-Berigan MK Gilbert ES Berrington de Gonzalez A Epidemiological Studies of Low-Dose Ionizing Radiation and Cancer: Summary Bias Assessment and Meta-Analysis J Natl Cancer Inst Monogr 2020 2020 188 200 32657347 10.1093/jncimonographs/lgaa010 PMC8454205 44 Kelaranta A Mäkelä T Kaasalainen T Kortesniemi M Fetal radiation dose in three common CT examinations during pregnancy - Monte Carlo study Phys Med 2017 43 199 206 28941740 10.1016/j.ejmp.2017.09.120 45 Patro SN Chakraborty S Sheikh A The use of adaptive statistical iterative reconstruction (ASiR) technique in evaluation of patients with cervical spine trauma: impact on radiation dose reduction and image quality Br J Radiol 2016 89 20150082 26882825 10.1259/bjr.20150082 PMC4846189 46 Wang J Sui X Zhao R Du H Wang J Wang Y Qin R Lu X Ma Z Xu Y Jin Z Song L Song W Value of deep learning reconstruction of chest low-dose CT for image quality improvement and lung parenchyma assessment on lung window Eur Radiol 2024 34 1053 1064 37581663 10.1007/s00330-023-10087-3 47 Jiang JM Miao L Liang X Liu ZH Zhang L Li M The Value of Deep Learning Image Reconstruction in Improving the Quality of Low-Dose Chest CT Images Diagnostics (Basel) 2022 12 2560 36292249 10.3390/diagnostics12102560 PMC9601258 48 Jo GD Ahn C Hong JH Kim DS Park J Kim H Kim JH Goo JM Nam JG 75% radiation dose reduction using deep learning reconstruction on low-dose chest CT BMC Med Imaging 2023 23 121 37697262 10.1186/s12880-023-01081-8 PMC10494344 49 Modi L Sun W Shafizadeh N Negron R Yee-Chang M Zhou F Simsir A Sheth S Brandler TC Does a higher American College of Radiology Thyroid Imaging Reporting and Data System (ACR TI-RADS) score forecast an increased risk of malignancy? A correlation study of ACR TI-RADS with FNA cytology in the evaluation of thyroid nodules Cancer Cytopathol 2020 128 470 481 32078249 10.1002/cncy.22254 50 Cui B Wu Z Yu B Li Y Liu H The Diagnostic Value of BRAF V600E Discov Med 2023 35 1064 1070 38058071 10.24976/Discov.Med.202335179.102 51 Cancer Genome Atlas Research Network Integrated genomic characterization of papillary thyroid carcinoma Cell 2014 159 676 690 25417114 10.1016/j.cell.2014.09.050 PMC4243044 52 Vardarli I Tan S Görges R Krämer BK Herrmann K Brochhausen C Diagnostic accuracy of Afirma gene expression classifier, Afirma gene sequencing classifier, ThyroSeq v2 and ThyroSeq v3 for indeterminate (Bethesda III and IV) thyroid nodules: a meta-analysis Endocr Connect 2024 13 e240170 38771544 10.1530/EC-24-0170 PMC11227067 53 Silaghi CA Lozovanu V Georgescu CE Georgescu RD Susman S Năsui BA Dobrean A Silaghi H Thyroseq v3, Afirma GSC, and microRNA Panels Versus Previous Molecular Tests in the Preoperative Diagnosis of Indeterminate Thyroid Nodules: A Systematic Review and Meta-Analysis Front Endocrinol (Lausanne) 2021 12 649522 34054725 10.3389/fendo.2021.649522 PMC8155618 54 Wu ST Voltoline R Benites RL de Campos BM de Souza JPSS Ghizoni E Interactive mining of neural pathways to preoperative neurosurgical planning Comput Biol Med 2025 184 109334 39549526 10.1016/j.compbiomed.2024.109334 55 Wu W Poser BA Douaud G Frost R In MH Speck O Koopmans PJ Miller KL High-resolution diffusion MRI at 7T using a three-dimensional multi-slab acquisition Neuroimage 2016 143 1 14 27570110 10.1016/j.neuroimage.2016.08.054 PMC5139985 56 Niaz MR Ridwan AR Wu Y Alzheimer's Disease Neuroimaging Initiative, Bennett DA, Arfanakis K Development and evaluation of a high resolution 0.5mm isotropic T1-weighted template of the older adult brain Neuroimage 2022 248 118869 34986396 10.1016/j.neuroimage.2021.118869 PMC8855670 57 Menon V Brash DE Next-generation sequencing methodologies to detect low-frequency mutations: \"Catch me if you can\" Mutat Res Rev Mutat Res 2023 792 108471 37716438 10.1016/j.mrrev.2023.108471 PMC10843083 58 Murugan AK Kannan S Alzahrani AS  TERT Biochim Biophys Acta Rev Cancer 2025 1880 189243 39674418 10.1016/j.bbcan.2024.189243 59 Marczyk VR Maia AL Goemann IM Distinct transcriptional and prognostic impacts of TERT Endocr Relat Cancer 2024 31 e240058 38973620 10.1530/ERC-24-0058 60 Sun Z Du M Wu X Tao R Sun P Zheng S Zhang Z Zhou D Zhao X Yang P Rapid diagnosis of TERT Sci Rep 2025 15 18480 40425623 10.1038/s41598-025-03161-x PMC12117072 61 Ganeshan B Miles KA Quantifying tumour heterogeneity with CT Cancer Imaging 2013 13 140 149 23545171 10.1102/1470-7330.2013.0015 PMC3613789 62 Ruan Z Mei N Lu Y Xiong J Li X Zheng W Liu L Yin B A Comparative and Summative Study of Radiomics-based Overall Survival Prediction in Glioblastoma Patients J Comput Assist Tomogr 2022 46 470 479 35405713 10.1097/RCT.0000000000001300 63 Ambrozkiewicz F Trailin A Červenková L Vaclavikova R Hanicinec V Allah MAO Palek R Třeška V Daum O Tonar Z Liška V Hemminki K CTNNB1 mutations, TERT BMC Cancer 2022 22 884 35962322 10.1186/s12885-022-09989-0 PMC9375422 64 Maloberti T Repaci A Poppi L Di Paola FJ Calafato G Coluccelli S Carosi F Colapinto A Colombero S Credi G Tallini G Pantaleo MA Nannini M de Biase D Exploring the role of TERT Crit Rev Oncol Hematol 2025 213 104792 40482736 10.1016/j.critrevonc.2025.104792 65 Haag JG Wolsky RJ Moroney MR Sheren J Sheeder J Bitler BG Corr BR Clinicopathologic Evaluation of CTNNB1 Mutations in High-Intermediate Risk Endometrial Endometrioid Carcinoma Int J Gynecol Pathol 2023 42 43 53 35283443 10.1097/PGP.0000000000000865 PMC9470776 66 Zhao B Understanding Sources of Variation to Improve the Reproducibility of Radiomics Front Oncol 2021 11 633176 33854969 10.3389/fonc.2021.633176 PMC8039446 67 Feng C Zhang L Chang X Qin D Zhang T Regulation of post-translational modification of PD-L1 and advances in tumor immunotherapy Front Immunol 2023 14 1230135 37554324 10.3389/fimmu.2023.1230135 PMC10405826 68 Gao Y Fan S Sun X Li J Dai Y Li H Ma H Xu Y Lv L Oncometabolite fumarate facilitates PD-L1 expression and immune evasion in clear cell renal cell carcinoma Cell Death Dis 2025 16 432 40461489 10.1038/s41419-025-07752-4 PMC12134299 69 Li B Bao F Hou Y Li F Li H Deng Y Dai Q Tissue characterization at an enhanced resolution across spatial omics platforms with deep generative model Nat Commun 2024 15 6541 39095360 10.1038/s41467-024-50837-5 PMC11297205 70 Wang H Zhao S Yao J Yu X Xu D Factors influencing extrathyroidal extension of papillary thyroid cancer and evaluation of ultrasonography for its diagnosis: a retrospective analysis Sci Rep 2023 13 18344 37884592 10.1038/s41598-023-45642-x PMC10603168 71 Zhou J Song Y Zhan W Wei X Zhang S Zhang R Gu Y Chen X Shi L Luo X Yang L Li Q Bai B Ye X Zhai H Zhang H Jia X Dong Y Zhang J Yang Z Zhang H Zheng Y Xu W Lai L Yin L Superficial Organ and Vascular Ultrasound Group of the Society of Ultrasound in Medicine of Chinese Medical Association Chinese Artificial Intelligence Alliance for Thyroid and Breast Ultrasound Thyroid imaging reporting and data system (TIRADS) for ultrasound features of nodules: multicentric retrospective study in China Endocrine 2021 72 157 170 32852733 10.1007/s12020-020-02442-x 72 Alexander EK Marqusee E Orcutt J Benson CB Frates MC Doubilet PM Cibas ES Atri A Thyroid nodule shape and prediction of malignancy Thyroid 2004 14 953 958 15671774 10.1089/thy.2004.14.953 73 Song RY Kim HS Kang KH Minimal extrathyroidal extension is associated with lymph node metastasis in single papillary thyroid microcarcinoma: a retrospective analysis of 814 patients World J Surg Oncol 2022 20 170 35643530 10.1186/s12957-022-02629-8 PMC9148524 74 Cao M Yu T Miao X Wu Z Wang W The preferred surgical choice for intermediate-risk papillary thyroid cancer: total thyroidectomy or lobectomy? A systematic review and meta-analysis Int J Surg 2024 110 5087 5100 38967517 10.1097/JS9.0000000000001556 PMC11325972 75 Gong H Jiang Y Su A Total thyroidectomy versus less-than-total thyroidectomy for papillary thyroid carcinoma of isthmus: a systematic review and meta-analysis Gland Surg 2023 12 1525 1540 38107498 10.21037/gs-23-300 PMC10721558 76 Lee EJ Song KH Kim DL Jang YM Hwang TS Kim SK The BRAF(V600E) mutation is associated with malignant ultrasonographic features in thyroid nodules Clin Endocrinol (Oxf) 2011 75 844 850 21707687 10.1111/j.1365-2265.2011.04154.x 77 Hong X Li J Duan S You Y Retrospective study of BRAF(V600E) mutation and CT features of papillary thyroid carcinoma PeerJ 2024 12 e16810 38282867 10.7717/peerj.16810 PMC10821721 78 Howell GM Hodak SP Yip L  RAS Oncologist 2013 18 926 932 23873720 10.1634/theoncologist.2013-0072 PMC3755930 79 Burge RA Hobbs GA Not all RAS mutations are equal: A detailed review of the functional diversity of RAS hot spot mutations Adv Cancer Res 2022 153 29 61 35101234 10.1016/bs.acr.2021.07.004 80 Liu SZ Yang SH Ye M Fu BJ Lv FJ Chu ZG Bubble-like lucency in pulmonary ground glass nodules on computed tomography: a specific pattern of air-containing space for diagnosing neoplastic lesions Cancer Imaging 2024 24 47 38566150 10.1186/s40644-024-00694-8 PMC10985942 81 Sutton RT Pincock D Baumgart DC Sadowski DC Fedorak RN Kroeker KI An overview of clinical decision support systems: benefits, risks, and strategies for success NPJ Digit Med 2020 3 17 32047862 10.1038/s41746-020-0221-y PMC7005290 82 Jie Z Zhiying Z Li L A meta-analysis of Watson for Oncology in clinical application Sci Rep 2021 11 5792 33707577 10.1038/s41598-021-84973-5 PMC7952578 83 Byrd TF 4th Southwell B Ravishankar A Tran T Kc A Phelan T Melton-Meaux GB Usher MG Scheppmann D Switzer S Simon G Tignanelli CJ Validation of a Proprietary Deterioration Index Model and Performance in Hospitalized Adults JAMA Netw Open 2023 6 e2324176 37486632 10.1001/jamanetworkopen.2023.24176 PMC10366696 84 Jones C Thornton J Wyatt JC Artificial intelligence and clinical decision support: clinicians' perspectives on trust, trustworthiness, and liability Med Law Rev 2023 31 501 520 37218368 10.1093/medlaw/fwad013 PMC10681355 85 Nakauchi M Court CM Tang LH Gönen M Janjigian YY Maron SB Molena D Coit DG Brennan MF Strong VE Validation of the Memorial Sloan Kettering Gastric Cancer Post-Resection Survival Nomogram: Does It Stand the Test of Time? J Am Coll Surg 2022 235 294 304 35839406 10.1097/XCS.0000000000000251 PMC9298603 86 Ye J Hai J Song J Wang Z Multimodal Data Hybrid Fusion and Natural Language Processing for Clinical Prediction Models AMIA Jt Summits Transl Sci Proc 2024 2024 191 200 38827058 PMC11141806 87 Paolucci I Lin YM Albuquerque Marques Silva J Brock KK Odisio BC Bayesian parametric models for survival prediction in medical applications BMC Med Res Methodol 2023 23 250 37884857 10.1186/s12874-023-02059-4 PMC10605790 88 Zwanenburg A Vallières M Abdalah MA Aerts HJWL Andrearczyk V Apte A Ashrafinia S Bakas S Beukinga RJ Boellaard R Bogowicz M Boldrini L Buvat I Cook GJR Davatzikos C Depeursinge A Desseroit MC Dinapoli N Dinh CV Echegaray S El Naqa I Fedorov AY Gatta R Gillies RJ Goh V Götz M Guckenberger M Ha SM Hatt M Isensee F Lambin P Leger S Leijenaar RTH Lenkowicz J Lippert F Losnegård A Maier-Hein KH Morin O Müller H Napel S Nioche C Orlhac F Pati S Pfaehler EAG Rahmim A Rao AUK Scherer J Siddique MM Sijtsema NM Socarras Fernandez J Spezi E Steenbakkers RJHM Tanadini-Lang S Thorwarth D Troost EGC Upadhaya T Valentini V van Dijk LV van Griethuysen J van Velden FHP Whybra P Richter C Löck S The Image Biomarker Standardization Initiative: Standardized Quantitative Radiomics for High-Throughput Image-based Phenotyping Radiology 2020 295 328 338 32154773 10.1148/radiol.2020191145 PMC7193906 89 Printz C Immunotherapy combination shows longer progression-free survival than chemotherapy alone for patients with a rare type of metastatic colorectal cancer CA Cancer J Clin 2025 75 87 89 40119701 10.3322/caac.70003 90 Xu H Zhang Y Wu H Zhou N Li X Pineda JP Zhu Y Fu H Ying M Yang S Bao J Yang L Zhang B Guo L Sun L Lu F Wang H Huang Y Zhu T Wang X Wei Q Sheng C Qu S Lv Z Xu D Li Q Dong Y Qin J Cheng T Xing M High Diagnostic Accuracy of Epigenetic Imprinting Biomarkers in Thyroid Nodules J Clin Oncol 2023 41 1296 1306 36378996 10.1200/JCO.22.00232 PMC9937101 91 Zhou L Wang W Wei H Song P Li Z Cheng L Lei P Chen Q Liu Z Ye H Cai Q Clinical application of 3D Slicer combined with Sina/MosoCam multimodal system in preoperative planning of brain lesions surgery Sci Rep 2022 12 19258 36357434 10.1038/s41598-022-22549-7 PMC9649692 92 Cè M Irmici G Foschini C Danesini GM Falsitta LV Serio ML Fontana A Martinenghi C Oliva G Cellina M Artificial Intelligence in Brain Tumor Imaging: A Step toward Personalized Medicine Curr Oncol 2023 30 2673 2701 36975416 10.3390/curroncol30030203 PMC10047107 93 Zhang P Luo H Zhu W Yang J Zeng N Fan Y Wen S Xiang N Jia F Fang C Real-time navigation for laparoscopic hepatectomy using image fusion of preoperative 3D surgical plan and intraoperative indocyanine green fluorescence imaging Surg Endosc 2020 34 3449 3459 31705286 10.1007/s00464-019-07121-1 94 Bond C Santiago-Ruiz AN Tang Q Lakadamyali M Technological advances in super-resolution microscopy to study cellular processes Mol Cell 2022 82 315 332 35063099 10.1016/j.molcel.2021.12.022 PMC8852216 95 Singh D Tewari M Singh S Narayan G Revisiting the role of TRAIL/TRAIL-R in cancer biology and therapy Future Oncol 2021 17 581 596 33401962 10.2217/fon-2020-0727 96 Wu Z Hua P Chen X Lei J Zhang L Zhang P A study on the prediction of targeted therapy efficacy in advanced lung adenocarcinoma patients with EGFR mutations using CT-based delta-radiomics model Front Med (Lausanne) 2025 12 1599206 40520794 10.3389/fmed.2025.1599206 PMC12162602 97 Wang Y Guan Q Lao I Wang L Wu Y Li D Ji Q Wang Y Zhu Y Lu H Xiang J Using deep convolutional neural networks for multi-classification of thyroid tumor by histopathology: a large-scale pilot study Ann Transl Med 2019 7 468 31700904 10.21037/atm.2019.08.54 PMC6803184 98 Domingo RP Ogden LL Been LC Kennedy GC Traweek ST Identification of parathyroid tissue in thyroid fine-needle aspiration: A combined approach using cytology, immunohistochemical, and molecular methods Diagn Cytopathol 2017 45 526 532 28371486 10.1002/dc.23711 99 Kim KH Migliozzi S Koo H Hong JH Park SM Kim S Kwon HJ Ha S Garofano L Oh YT D'Angelo F Kim CI Kim S Lee JY Kim J Hong J Jang EH Mathon B Di Stefano AL Bielle F Laurenge A Nesvizhskii AI Hur EM Yin J Shi B Kim Y Moon KS Kwon JT Lee SH Lee SH Gwak HS Lasorella A Yoo H Sanson M Sa JK Park CK Nam DH Iavarone A Park JB Integrated proteogenomic characterization of glioblastoma evolution Cancer Cell 2024 42 358 377.e8 38215747 10.1016/j.ccell.2023.12.015 PMC10939876 100 Schulte J Caliebe A Marciano M Neuschwander P Seiberle I Scheurer E Schulz I DEPArray™ single-cell technology: A validation study for forensic applications Forensic Sci Int Genet 2024 70 103026 38412740 10.1016/j.fsigen.2024.103026 101 Hui Z Zhang J Ren Y Li X Yan C Yu W Wang T Xiao S Chen Y Zhang R Wei F You J Ren X Single-cell profiling of immune cells after neoadjuvant pembrolizumab and chemotherapy in IIIA non-small cell lung cancer (NSCLC) Cell Death Dis 2022 13 607 35831283 10.1038/s41419-022-05057-4 PMC9279493 102 Liu Y Yang M Deng Y Su G Enninful A Guo CC Tebaldi T Zhang D Kim D Bai Z Norris E Pan A Li J Xiao Y Halene S Fan R High-Spatial-Resolution Multi-Omics Sequencing via Deterministic Barcoding in Tissue Cell 2020 183 1665 1681.e18 33188776 10.1016/j.cell.2020.10.026 PMC7736559 103 Francies HE Barthorpe A McLaren-Douglas A Barendt WJ Garnett MJ Drug Sensitivity Assays of Human Cancer Organoid Cultures Methods Mol Biol 2019 1576 339 351 27628132 10.1007/7651_2016_10 PMC6527507 ",
  "metadata": {
    "Title of this paper": "Drug Sensitivity Assays of Human Cancer Organoid Cultures",
    "Journal it was published in:": "World Journal of Radiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476805/"
  }
}