{
  "title": "Paper_439",
  "abstract": "pmc NPJ Vaccines NPJ Vaccines 3297 npjvac NPJ Vaccines 2059-0105 Nature Publishing Group PMC12479783 PMC12479783.1 12479783 12479783 41022865 10.1038/s41541-025-01263-1 1263 1 Article Synergistic effect of nucleoside modification and ionizable lipid composition on translation and immune responses to mRNA vaccines Danz Hillary 1 Dauner Allison 2 Sharma Shraddha 1 Babiceanu Mihaela 2 Clark Nicholas 1 Ontiveros Robert Jordan 1 Amezquita Robert 1 Zhilin-Roth Alisa 1 Reyes Eric 1 Khoo Catherine 1 Gilbert Kara 1 Nadkarni Janhavi 1 Chaudhary Omkar 1 Lee Christina 1 Kume Ana 1 Bahadoran Azadeh 1 Motwani Mona 1 Lu Bin 1 Zong Wei 1 Kettring Andrew 2 Shumate Alex 2 Karve Shrirang 1 Dias Anusha 1 Wu Monica 1 Gu Xiaobo 1 Yan Yanhua 1 Anderson Daniel G. 3 4 5 6 Schanen Brian 2 http://orcid.org/0000-0002-1832-1465 Chivukula Sudha sudha.chivukula@sanofi.com 1 DeRosa Frank 1 1 https://ror.org/027vj4x92 grid.417555.7 0000 0000 8814 392X mRNA Center of Excellence, Sanofi, 2 https://ror.org/027vj4x92 grid.417555.7 0000 0000 8814 392X mRNA Center of Excellence, Sanofi, 3 https://ror.org/042nb2s44 grid.116068.8 0000 0001 2341 2786 David H Koch Institute for Integrative Cancer Research, Massachusetts Institute of Technology, 4 https://ror.org/042nb2s44 grid.116068.8 0000 0001 2341 2786 Department of Chemical Engineering, Massachusetts Institute of Technology, 5 https://ror.org/042nb2s44 grid.116068.8 0000 0001 2341 2786 Harvard-MIT Division of Health Science Technology, Massachusetts Institute of Technology, 6 https://ror.org/042nb2s44 grid.116068.8 0000 0001 2341 2786 Institute for Medical Engineering and Science, Massachusetts Institute of Technology, 29 9 2025 2025 10 478462 212 20 3 2025 24 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Lipid nanoparticle (LNP) components can impact the safety and immunogenicity of mRNA vaccines. Here we examine the mechanisms contributing to the performance of mRNA-LNP vaccines by exploring the impact of nucleoside modifications and LNP components on translational efficiency, innate immune activation, and immunogenicity. Our data reveals several molecular and immunological parameters affected by nucleoside modification including a synergistic effect of the mRNA and ionizable lipid composition on the immune activation triggered by the mRNA-LNP formulation. Our results indicate changes in the LNP composition, independent from whether the mRNA is modified or unmodified, caused differential expression of genes associated with innate and antiviral immunity. We believe these findings offer valuable insights into mRNA vaccine function and offer strategies for enhancing vaccine efficacy and reducing the reactogenicity of next generation mRNA vaccines. Subject terms Infectious diseases RNA vaccines pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction mRNA vaccines have revolutionized the field of immunization by harnessing the power of genetic information to stimulate robust immune responses against infectious diseases 1 2 3 5 While preclinical data generated over the past years indicate that unmodified mRNA vaccines elicit a robust immune response to pathogens 6 7 7 8 7 6 8 Despite the use of m1ψ in currently licensed vaccines, moderate to high innate immune responses including antiviral and type 1 interferon signaling after primary immunization followed by amplified inflammatory responses characterized by an increased frequency of circulating inflammatory monocytes and elevated sera IFNg levels post-secondary immunization have been reported 9 10 11 12 13 15 16 17 17 To better understand cellular responses to mRNA vaccines, we examined the translation efficiency, immunogenicity and tolerability of different mRNA vaccines using in vitro and in vivo models. To elucidate the mechanisms underlying improved performance of nucleoside-modified mRNA vaccines, we compared unmodified uridine (UNR) and N1-methylpseudouridine (m1ψ)-modified (MNR) non-replicating mRNA encoding hemagglutinin (HA) from influenza viruses. HA antigens from five different strains of influenza A/Wisconsin/588/2019 (Wisconsin HA), A/Tasmania/503/2020 (Tasmania HA), B/Washington/02/2019 (Washington HA) and B/Austria/1359417/2021 (Austria HA) were tested in vitro, and the H3N2 influenza strain A/Singapore/INFIMH-16-0019/2016 (Sing16 HA) was selected as our model antigen for immunization studies in mice and non-human primates (NHPs) (Supplementary Table 2 18 20 Results Modification of mRNA can result in an increase in protein expression in vitro To assess the impact of mRNA modification and LNP formulation on HA protein expression, mRNA encoding Sing16 HA in either a UNR or MNR format was formulated as OF-02, cKK-E10, or SM-102 LNPs (Supplementary Table 1 1a 1d 1c 1b 6 Fig. 1 Comparison of protein expression induced by unmodified and modified Sing16 HA mRNA formulated with LNPs in HSKM and hDC cells. a b c d P N a b d e n n P N p p p p In addition to Sing16 HA, we tested the expression of HAs from 4 other influenza strains- Wisconsin, Tasmania, Washington and Austria in the presence or absence of the m1ψ modification and formulated as OF-02 LNPs (Fig. 1e Both unmodified and modified mRNA-LNPs can cause global translational repression in vitro To assess the impact of mRNA modification on global cellular translation, we performed a puromycin incorporation assay which measures the total amount of active translation in the cell by quantifying the amount of puromycin incorporated into growing polypeptide chains (Fig. 2a 2b 2c Fig. 2 Impact of exogenous RNA transfection on global translation in vitro. Puromycin incorporation assay to measure global cellular translation by western blot. a b c p p p p p Both unmodified and modified mRNA-LNPs induced antiviral responses in vitro To determine the effect of UNR and MNR on the global transcriptome, Sing16 HA mRNA delivered as OF-02, cKK-E10 or SM-102 LNPs were used to transfect HSKM cells, and the transcriptome was analyzed at 1, 4, and 24 h post-transfection. Across all LNPs, the transcriptome exhibited a high degree of induced differential response relative to the buffer controls (Fig. 3a 3a n 3b 3b 21 3b 3b Fig. 3 Impact of nucleoside modification and LNP selection on transcriptome in vitro. a b n Modification of mRNA had a moderate impact on functional antibody titers To evaluate whether the increase in protein expression observed in MNR formulations could result in an increase in functional antibody titers, UNR and m1ψ MNR Sing16 HA-LNPs were evaluated in BALB/c mice with 0.08, 0.4 or 1 μg mRNA-LNP administered intramuscularly in a two-dose regimen, 3 weeks apart. LNPs prepared with ionizable lipids OF-02, cKK-E10 and SM-102 were evaluated for functional antibody responses as measured by hemagglutination inhibition (HAI) titers against the homologous A/Singapore/ INFIMH160019/2016 H3N2 strain (Fig. 4 p 3 22 Fig. 4 Serological evaluation of UNR vs. MNR mRNA-LNP vaccines in mice. BALB/c mice ( n a b c To further evaluate immunogenicity of the mRNA formulations, a dose range of 15, 45, and 135 μg of UNR and MNR Sing16 HA-cKK-E10 and Sing16 HA-SM-102 were tested in NHPs with two doses administered intramuscularly at 4-week intervals. Robust HAI titers were induced in all treatment groups with titers peaking between Days 42-56 (Fig. 5 10 t 0 10 t 0 1 p p p p 1 p p 1 p 1 2 4 Fig. 5 Serological evaluation of UNR vs. MNR mRNA-LNP vaccines in non-human primates. Cynomolgus macaques ( n a b c d e f The impact of mRNA modification on induction of inflammatory cytokines is species-dependent To better understand the impact of mRNA modification on innate immune responses, serum cytokines and chemokines were assessed in mice (Fig. 6a 6b Fig. 6 Serum cytokine evaluation of UNR vs. MNR mRNA-LNP vaccines in mice and non-human primates. a n n b c In mice, induction and upregulation of cytokines such as IFNγ, IL-1a, IP10, VEGF, MIP1b and IL-5 was similarly detected in both the UNR and MNR LNP vaccinated mice regardless of the lipid used in the formulation (Fig. 6a 23 23 6b 24 25 Transcriptional signatures of mRNA vaccination in NHPs The sensitivity of existing cytokine assays and their specificity to NHPs could have an impact on our ability to accurately detect subtle changes in sera cytokines. To address these concerns as well as investigate the impact of mRNA modification on the transcriptional signatures of mRNA vaccination, we next performed bulk mRNA sequencing on whole blood drawn from NHPs treated with cKK-E10 or SM-102 LNP formulations made with UNR and MNR formats of Sing16 HA at pre-study and 2 days post primary immunization. Confirmation of the serum cytokine and chemokine findings was done by interrogating differential expression of cytokine and chemokine genes taken at Day 2 compared to pre-immunization. In concurrence with the sera cytokine findings, a significant dose- and LNP-dependent increase in cytokine genes in UNR formulations was observed, which was mostly abrogated by m1ψ-modification (Fig. 6c 6b 24 6b 6c As mRNA vaccines are likely to impact many aspects of the immune response beyond cytokine induction, we next assessed the global impact of UNR and MNR formulations on differential gene expression. Administration of mRNA vaccines, regardless of formulation, resulted in a substantial induction of differentially expressed genes in NHPs (Fig. 7 7a 7b 7b r r 7c Fig. 7 Modification of mRNA reduced global transcriptional profiling in NHPs. a b p c Consistent with the observations in HSKM cells treated with UNR and MNR Sing16 HA (Fig. 3b 8 8b 8b 5 Fig. 8 Top enriched canonical pathways following mRNA vaccination in non-human primates. a 10 p b p To further compare in vitro findings to those observed in NHP, we next assessed genes associated with protein translation and degradation. Figure 9 3b 26 27 28 Fig. 9 Differential gene expression of translation and mRNA degradation genes in non-human primates following vaccination. Heatmap providing a set of genes representative of the translation and mRNA degradation pathways in the whole blood collected from non-human primates 2 days post-immunization. Heatmap color scale represents log2 fold change of Day 2 over pre-immunization (baseline) levels. Hierarchical clustering was performed using the Euclidean distance measurement. Discussion mRNA-based vaccines have exhibited significant promise as evidenced by the clinical success of COVID-19 vaccines 29 31 32 21 33 34 11 35 36 A major determinant of mRNA vaccine performance is the efficient translation of mRNA by ribosomes as each mRNA copy can produce multiple polypeptides based on their respective polysome valency 37 38 Higher induction of anti-viral genes OAS, MX1 and IFIT in cells treated with UNR Sing16 HA mRNA as compared to MNR was observed (Fig. 3a 39 3b 9 40 9 41 42 Innate immune cells, crucial for defending against pathogens, utilize PRRs such as TLR3, TLR7, TLR8, RIG-I, and MDA-5 to detect foreign RNA. Our study of the impact of N-1methylpseudouridine modification on the production of early innate cytokines demonstrated species-dependent cytokine induction with improved responses in NHPs, but not in mice. While both mice and NHPs produced detectable IFNγ after immunization with mRNA vaccines, consistent with published findings 9 6 43 44 43 6b, c 45 Our data also highlights the differential effect of the LNP composition on immune activation. In NHPs, the UNR SM-102 formulation showed increased expression of interferon-regulated genes when compared to the cKK-E10 LNP (Fig. 8 46 47 48 49 5 50 51 Methods mRNA-LNP preparation and characterization Full-length codon optimized non-replicating mRNAs from A/Singapore/INFIMH160019/2016 Influenza virus H3 Hemagglutinin (Sing16 HA) and four other influenza strains, A/Wisconsin/588/2019 (Wisconsin HA), A/Tasmania/503/2020 (Tasmania HA), B/Washington/02/2019 (Washington HA) and B/Austria/1359417/2021 (Austria HA), were synthesized enzymatically using unmodified (UNR) or m1Ψ-modified (MNR) ribonucleotides. GenBank accession number(s) for the nucleotide sequence(s) used are described in Supplementary Table 2 1 6 53 mRNA-LNP formulations were prepared by appropriate mixing solutions of mRNA and lipid mixture. Three types of cationic lipids were used for this study: OF-02 (synthesized at Sanofi), cKK-E10 (synthesized at Sanofi) and SM-102 (synthesized at Organix Inc.) lipid. All three LNP formulations had comparable lipid /mRNA ratio with the total lipid amount per mg of mRNA in the range of 21-24 mg/ml. Key LNP components (molar ratios) for DMG-PEG2k: Cholesterol:helper lipid were 1.5:50:38.5:10 for OF-O2 & cKK-E10 and 1.5:40:28.5:30 for SM-102. Briefly, an ethanolic solution of a mixture of lipids (ionizable lipid, helper lipid, cholesterol, and polyethylene glycol-lipid) at a fixed lipid and mRNA ratio were combined with an aqueous buffered solution of target mRNA at an acidic pH under controlled conditions to yield a suspension of uniform LNPs 54 mRNA-LNP formulations were prepared by mixing the various lipid components with mRNA under controlled conditions and at fixed ratios. All mRNA-LNPs exhibited ≥ 90% encapsulation with uniform hydrodynamic radius ranging from 95-120 nm and a polydispersity index of 0.106 to 0.12 for cKK-E10, 0.084 – 0.1 for OF-02, and 0.116 to 0.145 for SM-102 LNPs. Mammalian cell culture and transfection Primary human skeletal muscle myoblasts were obtained from Lonza (Cat. No. CC-2580) and thawed and expanded following vendor recommendations. Briefly, cryopreserved cell stocks were thawed into SkGM-2 complete media (Lonza, Cat. No. CC-3245). Media was replaced 24 h after thawing and every 48 h thereafter. Cells were expanded/passaged to P6, at which point they were seeded on 24-well culture plates pre-coated with Collagen 1 at a density of 24,000 cells/cm 2 Human peripheral blood-derived immature dendritic cells (hDC) were purchased from STEMCELL Technologies (Cat. No. 200-0370, Lot Nos. 2401405007; 2401419004; 2311403010). Thawed cells were added into pre-warmed culture media (RPMI media supplemented with 1% v/v penicillin/streptomycin and 10% v/v HI-FBS) and allowed to rest at 37 °C for 3–4 h. Cells were pelleted at 500 × g Immunofluorescence LNP transfected HSKM cells were washed twice with PBS (Corning; Cat. No 21-040-CV). Cells then were fixed in situ with 4% paraformaldehyde (Thermo Scientific; Cat. No AAJ61899AK) for 10 min at room temperature, followed by permeabilization with 0.004% Digitonin (Thermo Scientific; AC407565000) in PBS for 20 min. Cells were washed thrice with PBS, blocked with 10% goat serum (Gibco; 16210-072) for 1 h at room temperature and incubated with Flu anti-H3 (H3N2) antibody (Immuno-Technology; Cat. No IT-003-004M2, 1:200 dilution), CL-1000117 antibody for Wisconsin (Sanofi generated, 10 ng/µL), CL-1000476 antibody for Tasmania (Sanofi generated, 0.5 ng/µL), CL-1000928 antibody for Washington and Austria (Sanofi generated, 20 ng/µL) in 10% goat serum, at 4 °C overnight. Next day, cells were washed thrice with PBS and incubated with goat anti-mouse AlexaFluor™ 647 -conjugated secondary antibody (Abcam; Cat. No. AB150115 TM R37165 Flow cytometry Monocyte derived human dendritic cells (hDCs) were centrifuged at 1500 RPM for 5 min and the supernatant removed 24 h post-transfection. Cells were washed with 200 µl of staining buffer BioLegend, (Cat. No. 420201) and primary antibody (anti-H3) Immune Technology (Cat. No. IT-003-004M2) was diluted to 10 µg/mL in staining buffer (1:100). 100 µl of diluted antibody was added to cells and incubated for 1 h at 4 °C. The cells were washed with 100 µL staining buffer per well. The cells were stained with secondary antibody (anti-mouse-PE) 2 µg/mL (1:250) Southern Biotech (Cat. No. 1030-09) and LIVE/DEAD™ Fixable Near-IR Dead Cell Stain Kit (1:1000) Invitrogen (Cat. No. L34976 Puromycin incorporation assay HSKM cells were plated the day before transfection at 0.25 million cells/well in 6-well plates. Cells were transfected with 2-fold dose curves of UNR and MNR Sing16 mRNA formulated in cKK-E10 or OF-02 LNPs from 10 µg/million cells to 1.25 µg/million cells. 20 h post-transfection control cells were treated with 100 µg/ml cycloheximide for 2 min at 37 °C. All cells were then treated with 10 µg/mL puromycin for 30 min at 37 °C. Cells were harvested and lysed in 125 µL RIPA buffer with 1X HALT protease inhibitors. 15 µL of protein sample were combined with 5 µL of NuPAGE LDS sample buffer with reducing agent and incubated at 85 °C for 5 min. Samples were run on 8-16% SDS-PAGE at 185 V for 75 min and transferred to nitrocellulose membranes with a Biorad TransBlot Turbo system. Blots were blocked with 5% milk in tris-buffered saline (TBS) for 1 h at room temperature, then stained overnight with mouse anti-puromycin antibody (12D10) and Licor rabbit anti-actin in 1% milk in TBS with Triton™ X-100 (TBST) overnight at 4 °C. Blots were washed 3 times for 5 min each with TBST then secondary stained with Licor donkey anti-mouse 800 and goat anti-rabbit 680 for 1 h at room temperature. Blots were washed 4 times for 5 min each with TBST then scanned on a Licor Odyssey imager. Immunogenicity in mice and serological evaluation in NHP For immunogenicity studies, n = 8/treatment group of female BALB/c mice ( Mus musculus Naive male and female Mauritius origin cynomolgus macaques ( Macaca fascicularis Hemagglutination inhibition (HAI) assay HAI assays were performed as previously described 55 HAI assays were performed in V-bottom 96-well plates by adding 4 hemagglutination units per 25 μL (HAU/25 μL) of virus to 25 μL RDE-treated sera samples that have been 2-fold serially diluted across the plate. 50 μL of tRBCs were then added to the plate and incubated for 1 h at room temperature. The HAI titer was recorded as the highest serum dilution that completely inhibits hemagglutination. Cytokine profiling using Luminex Mice were bled pre-study to obtain a baseline sample and then bled 24 h post-priming. NHPs were bled pre-study to obtain a baseline sample and then bled 48 h post-priming and 48 h post-boosting. Blood samples were collected into SST tubes and centrifuged 5–10 min to separate the serum, which was stored at −80 °C until use. For mice, cytokine analysis was performed using a Milliplex mouse cytokine/chemokine magnetic bead kit (Cat. No. MCYTMAG-70K-PX32) following manufacturer’s protocol. For NHPs, cytokine analysis was performed using a Procarta NHP cytokine/chemokine magnetic bead kit (Cat. No. EPX370-40045-901) following manufacturer’s protocol. Pre-study baseline levels were subtracted from post-priming (mice and NHPs) and post-boosting (NHPs only) levels, processed to determine log2 fold change, and graphed. Gene expression profiling using Transcriptomics RNA-seq extraction and library generation Total RNA was extracted from whole blood NHP samples collected in PAXgene Blood RNA Tubes (Qiagen, BD Diagnostics) pre- and 2 days post-immunization using the MagMAX™ for Stabilized Blood Tubes RNA Isolation Kit (Invitrogen) on an automated KingFisher Flex System (Thermo Scientific). The quality and yield of RNA were assessed on the 4200 TapeStation System (Agilent) and NanoDrop™ Eight Spectrophotometer (Thermo Scientific). Sequencing libraries were then prepared using the Illumina Stranded Total RNA Prep with Ribo-Zero Plus kit and sequenced on the NovaSeq 6000 Sequencing System (Illumina) using the S4 Reagent Kit v1.5 (200 cycles). Bulk RNA-seq processing The bcl files were demultiplexed using Illumina’s bcl2fastq software. The fastq files were processed using Array Studio software (Qiagen) and aligned to the cynomolgus Macaque CynoWashU2013 reference genome with the WashUGene2017512 gene model. Differential gene expression analysis was performed using the Limma-Voom method, which transforms the raw read counts into log-counts per million (log-CPM) and models the mean-variance relationship of the data. RNA-seq pathway analysis To test for enrichment of biological pathways, the differentially expressed genes for each treatment contrast were analyzed using Ingenuity Pathway Analysis software program (Qiagen), which reports enrichment as p- Statistical analyses A linear mixed model was used to account for the repeated measurements for each subject over time. The dependent variable, expressed as the change of HAI titers from baseline in log 10 Ethics statement All animal experiments were carried out in compliance with all pertinent US National Institutes of Health regulations and were conducted with approved animal protocols from the Institutional Animal Care and Use Committee (IACUC) at BIOQUAL Inc. Rockville, MD (IACUC Number: 21-14) and New Iberia Research Center, University of Louisiana Lafayette (NIRC) (IACUC Number: 2020-8733-013). Housing and handling of animals were performed in accordance and compliant with the standards of the Association for Assessment and Accreditation of Laboratory Animal Care, the Animal Welfare Act as amended, and the Public Health Service Policy. The studies adhered strictly to applicable Standard Operating Procedures of BIOQUAL and NIRC approved IACUC protocol. Euthanasia was performed in accordance with standard procedures. For mice, the terminal blood collection was carried out using isoflurane anesthesia. Once the animal ID was confirmed, the animal was placed into the induction chamber. The vaporizer was turned on, and the O2 flow meter was set to a minimum of 1 L/min. The vaporizer was adjusted to ≤4% for anesthesia (or higher if needed), to ensure the animal was properly anesthetized. The depth of anesthesia was verified via toe pinch. After the terminal bleed, the animals were euthanized through deep anesthesia (with isoflurane administered at 5%) followed by a secondary euthanasia method (either thoracotomy and/or cervical dislocation). This process ensured that the animals were humanely euthanized and that the necessary samples were collected in line with the study protocol. NHP studies were performed at the NIRC. Treatment of NHPs was in accordance with standard operating procedures at NIRCs, which adhere to the regulations outlined in the United States Department of Agriculture Animal Welfare Act (9 CFR, Parts 1, 2 and 3) and the conditions specified in The Guide for Care and Use of Laboratory Animals 52 Supplementary information  Supplementary Information Publisher’s note These authors contributed equally: Hillary Danz, Allison Dauner. Supplementary information The online version contains supplementary material available at 10.1038/s41541-025-01263-1. Acknowledgements We appreciate the support from our Flu project team at Sanofi, and particularly Maryann Giel-Moloney for generously providing us with critical reagents and viral stocks for performing HAI assays. We also want to thank the veterinary research staff, especially Dr. Emily Romero and Jason E. Goetzman, for their exceptional support of the in vivo phase of the NHP study at New Iberia Research Center, LA. We would like to thank Dr. Anpu Wang, Sanofi for helping with evaluating dsRNA content in our mRNA preparations. We would also like to thank the BIOQUAL Inc. staff, particularly Swagata Kar and Laurent Pessaint for their support of the in vivo phase of the mouse study. Finally, we thank our internal reviewer, Jean-Sebastien Boulduc for support in finalizing the manuscript. We thank the Innovation Communication Group, especially Nicola Donelan and Jessica Martin, for their editorial support of this manuscript. This research work was funded by Sanofi. Author contributions Hillary Danz, Allison Dauner and Shraddha Sharma have contributed to the conception of the study design, execution, and authoring of manuscript. Bin Lu, Mona Motwani, Ana Kume, Azadeh Bahadoran and Janhavi Nadkarni were involved in conducting in vivo studies and analyzing the immunological readouts, Mihaela Babiceanu and Andrew Kettring have performed the NGS studies and transcriptome analysis. Alisa Zhilin-Roth, Robert Jordan Ontiveros, Omkar Chaudhary, and Nicholas Clark have conducted in vitro protein expression and mRNA translation studies and written the respective sections with help from Eric Reyes, Catherine Khoo, Kara Gilbert. Christina Lee, Wei Zong, Alex Shumate, and Robert Amezquita have supported data analysis and visualization. Shrirang Karve, Anusha Dias, Monica Wu, Xiaobo Gu, Yanhua Yan have supported mRNA and LNP preparation. Frank DeRosa and Daniel Anderson have been expert consultants. Brian Schanen has supervised studies and reviewed the manuscript. Sudha Chivukula conceived, and supervised the studies, compiled, and reviewed the manuscript. All authors proofread and critically reviewed the manuscript. Data availability The data that support the findings of this study are available in the article. GenBank accession codes for protein and mRNA sequence for influenza hemagglutinins used in this study are provided in Supplementary Table 2 GSE303153 GEO Accession viewer Competing interests The research is funded by Sanofi. Hillary Danz, Allison Dauner, Shraddha Sharma, Mihaela Babiceanu, Nicholas Clark, Robert Jordan Ontiveros, Robert Amezquita, Mona Motwani, Bin Lu, Alisa Zhilin-Roth, Eric Reyes, Catherine Khoo, Ana Kume, Azadeh Bahadoran, Janhavi Nadkarni, Omkar Chaudhary, Christina Lee, Wei Zong, Andrew Kettring, Alex Shumate, Shrirang Karve, Anusha Dias, Monica Wu, Xiaobo Gu, Yanhua Yan, Frank DeRosa, Brian Schanen and, Sudha Chivukula are employees of Sanofi and may hold stock in the company. Daniel Griffith Anderson receives research funding from Sanofi, is a Founder of oRNA Tx and receives compensation and equity from Combined Therapeutics. References 1. Gu Y Duan J Yang N Yang Y Zhao X mRNA vaccines in the prevention and treatment of diseases MedComm (2020) 2022 3 e167 10.1002/mco2.167 36033422 PMC9409637 Gu, Y., Duan, J., Yang, N., Yang, Y. & Zhao, X. mRNA vaccines in the prevention and treatment of diseases. MedComm (2020) 3 36033422 10.1002/mco2.167 PMC9409637 2. Jain S Venkataraman A Wechsler ME Peppas NA Messenger RNA-based vaccines: past, present, and future directions in the context of the COVID-19 pandemic Adv. Drug Deliv. Rev. 2021 179 114000 10.1016/j.addr.2021.114000 34637846 PMC8502079 Jain, S., Venkataraman, A., Wechsler, M. E. & Peppas, N. A. Messenger RNA-based vaccines: past, present, and future directions in the context of the COVID-19 pandemic. Adv. Drug Deliv. Rev. 179 34637846 10.1016/j.addr.2021.114000 PMC8502079 3. Chaudhary N Weissman D Whitehead KA mRNA vaccines for infectious diseases: principles, delivery and clinical translation Nat. Rev. Drug Discov. 2021 20 817 838 10.1038/s41573-021-00283-5 34433919 PMC8386155 Chaudhary, N., Weissman, D. & Whitehead, K. A. mRNA vaccines for infectious diseases: principles, delivery and clinical translation. Nat. Rev. Drug Discov. 20 34433919 10.1038/s41573-021-00283-5 PMC8386155 4. Watson OJ Global impact of the first year of COVID-19 vaccination: a mathematical modelling study Lancet Infect. Dis. 2022 22 1293 1302 10.1016/S1473-3099(22)00320-6 35753318 PMC9225255 Watson, O. J. et al. Global impact of the first year of COVID-19 vaccination: a mathematical modelling study. Lancet Infect. Dis. 22 35753318 10.1016/S1473-3099(22)00320-6 PMC9225255 5. Bitounis D Jacquinet E Rogers MA Amiji MM Strategies to reduce the risks of mRNA drug and vaccine toxicity Nat. Rev. Drug Discov. 2024 10.1038/s41573-023-00859-3 38263456 Bitounis, D., Jacquinet, E., Rogers, M. A. & Amiji, M. M. Strategies to reduce the risks of mRNA drug and vaccine toxicity. Nat. Rev. Drug Discov. 38263456 10.1038/s41573-023-00859-3 6. Karikó K Buckstein M Ni H Weissman D Suppression of RNA recognition by Toll-like receptors: the impact of nucleoside modification and the evolutionary origin of RNA Immunity 2005 23 165 175 10.1016/j.immuni.2005.06.008 16111635 Karikó, K., Buckstein, M., Ni, H. & Weissman, D. Suppression of RNA recognition by Toll-like receptors: the impact of nucleoside modification and the evolutionary origin of RNA. Immunity 23 16111635 10.1016/j.immuni.2005.06.008 7. Kobiyama K Ishii KJ Making innate sense of mRNA vaccine adjuvanticity Nat. Immunol. 2022 23 474 476 10.1038/s41590-022-01168-4 35354958 Kobiyama, K. & Ishii, K. J. Making innate sense of mRNA vaccine adjuvanticity. Nat. Immunol. 23 35354958 10.1038/s41590-022-01168-4 8. Karikó K Incorporation of pseudouridine into mRNA yields superior nonimmunogenic vector with increased translational capacity and biological stability Mol. Ther. 2008 16 1833 1840 10.1038/mt.2008.200 18797453 PMC2775451 Karikó, K. et al. Incorporation of pseudouridine into mRNA yields superior nonimmunogenic vector with increased translational capacity and biological stability. Mol. Ther. 16 18797453 10.1038/mt.2008.200 PMC2775451 9. Arunachalam PS Systems vaccinology of the BNT162b2 mRNA vaccine in humans Nature 2021 596 410 416 10.1038/s41586-021-03791-x 34252919 PMC8761119 Arunachalam, P. S. et al. Systems vaccinology of the BNT162b2 mRNA vaccine in humans. Nature 596 34252919 10.1038/s41586-021-03791-x PMC8761119 10. Rosenblum HG Safety of mRNA vaccines administered during the initial 6 months of the US COVID-19 vaccination programme: an observational study of reports to the Vaccine Adverse Event Reporting System and v-safe Lancet Infect. Dis. 2022 22 802 812 10.1016/S1473-3099(22)00054-8 35271805 PMC8901181 Rosenblum, H. G. et al. Safety of mRNA vaccines administered during the initial 6 months of the US COVID-19 vaccination programme: an observational study of reports to the Vaccine Adverse Event Reporting System and v-safe. Lancet Infect. Dis. 22 35271805 10.1016/S1473-3099(22)00054-8 PMC8901181 11. Hafez IM Maurer N Cullis PR On the mechanism whereby cationic lipids promote intracellular delivery of polynucleic acids Gene Ther. 2001 8 1188 1196 10.1038/sj.gt.3301506 11509950 Hafez, I. M., Maurer, N. & Cullis, P. R. On the mechanism whereby cationic lipids promote intracellular delivery of polynucleic acids. Gene Ther. 8 11509950 10.1038/sj.gt.3301506 12. Hassett KJ Optimization of Lipid Nanoparticles for Intramuscular Administration of mRNA Vaccines Mol. Ther. Nucleic Acids 2019 15 1 11 10.1016/j.omtn.2019.01.013 30785039 PMC6383180 Hassett, K. J. et al. Optimization of Lipid Nanoparticles for Intramuscular Administration of mRNA Vaccines. Mol. Ther. Nucleic Acids 15 30785039 10.1016/j.omtn.2019.01.013 PMC6383180 13. Connors J Lipid nanoparticles (LNP) induce activation and maturation of antigen presenting cells in young and aged individuals Commun. Biol. 2023 6 188 10.1038/s42003-023-04555-1 36805684 PMC9936473 Connors, J. et al. Lipid nanoparticles (LNP) induce activation and maturation of antigen presenting cells in young and aged individuals. Commun. Biol. 6 36805684 10.1038/s42003-023-04555-1 PMC9936473 14. Lonez C Vandenbranden M Ruysschaert JM Cationic liposomal lipids: from gene carriers to cell signaling Prog. Lipid Res. 2008 47 340 347 10.1016/j.plipres.2008.03.002 18424270 Lonez, C., Vandenbranden, M. & Ruysschaert, J. M. Cationic liposomal lipids: from gene carriers to cell signaling. Prog. Lipid Res. 47 18424270 10.1016/j.plipres.2008.03.002 15. Lonez C Vandenbranden M Ruysschaert JM Cationic lipids activate intracellular signaling pathways Adv. Drug Deliv. Rev. 2012 64 1749 1758 10.1016/j.addr.2012.05.009 22634161 Lonez, C., Vandenbranden, M. & Ruysschaert, J. M. Cationic lipids activate intracellular signaling pathways. Adv. Drug Deliv. Rev. 64 22634161 10.1016/j.addr.2012.05.009 16. Alameh MG Lipid nanoparticles enhance the efficacy of mRNA and protein subunit vaccines by inducing robust T follicular helper cell and humoral responses Immunity 2021 54 2877 2892.e2877 10.1016/j.immuni.2021.11.001 34852217 PMC8566475 Alameh, M. G. et al. Lipid nanoparticles enhance the efficacy of mRNA and protein subunit vaccines by inducing robust T follicular helper cell and humoral responses. Immunity 54 34852217 10.1016/j.immuni.2021.11.001 PMC8566475 17. Vlatkovic, I. Non-Immunotherapy Application of LNP-mRNA: Maximizing Efficacy and Safety. Biomedicines 9 10.3390/biomedicines9050530 PMC8151051 34068715 18. Dong Y Lipopeptide nanoparticles for potent and selective siRNA delivery in rodents and nonhuman primates Proc. Natl. Acad. Sci. USA 2014 111 3955 3960 10.1073/pnas.1322937111 24516150 PMC3964096 Dong, Y. et al. Lipopeptide nanoparticles for potent and selective siRNA delivery in rodents and nonhuman primates. Proc. Natl. Acad. Sci. USA 111 24516150 10.1073/pnas.1322937111 PMC3964096 19. Fenton OS Bioinspired alkenyl amino alcohol ionizable lipid materials for highly potent in vivo mRNA delivery Adv. Mater. 2016 28 2939 2943 10.1002/adma.201505822 26889757 PMC5245883 Fenton, O. S. et al. Bioinspired alkenyl amino alcohol ionizable lipid materials for highly potent in vivo mRNA delivery. Adv. Mater. 28 26889757 10.1002/adma.201505822 PMC5245883 20. Buschmann MD Nanomaterial delivery systems for mRNA vaccines Vaccines 2021 9 65 10.3390/vaccines9010065 33478109 PMC7836001 Buschmann, M. D. et al. Nanomaterial delivery systems for mRNA vaccines. Vaccines 9 33478109 10.3390/vaccines9010065 PMC7836001 21. Hassett KJ mRNA vaccine trafficking and resulting protein expression after intramuscular administration Mol. Ther. Nucleic Acids 2024 35 102083 10.1016/j.omtn.2023.102083 38161733 PMC10755037 Hassett, K. J. et al. mRNA vaccine trafficking and resulting protein expression after intramuscular administration. Mol. Ther. Nucleic Acids 35 38161733 10.1016/j.omtn.2023.102083 PMC10755037 22. Rohde, C. M. et al. Toxicological assessments of a pandemic COVID-19 vaccine-demonstrating the suitability of a platform approach for mRNA vaccines. Vaccines (Basel) 11 10.3390/vaccines11020417 PMC9965811 36851293 23. Kauffman KJ Efficacy and immunogenicity of unmodified and pseudouridine-modified mRNA delivered systemically with lipid nanoparticles in vivo Biomaterials 2016 109 78 87 10.1016/j.biomaterials.2016.09.006 27680591 PMC5267554 Kauffman, K. J. et al. Efficacy and immunogenicity of unmodified and pseudouridine-modified mRNA delivered systemically with lipid nanoparticles in vivo. Biomaterials 109 27680591 10.1016/j.biomaterials.2016.09.006 PMC5267554 24. Polack FP Safety and efficacy of the BNT162b2 mRNA COVID-19 vaccine N. Engl. J. Med 2020 383 2603 2615 10.1056/NEJMoa2034577 33301246 PMC7745181 Polack, F. P. et al. Safety and efficacy of the BNT162b2 mRNA COVID-19 vaccine. N. Engl. J. Med 383 33301246 10.1056/NEJMoa2034577 PMC7745181 25. Baden LR Efficacy and safety of the mRNA-1273 SARS-CoV-2 vaccine N. Engl. J. Med 2021 384 403 416 10.1056/NEJMoa2035389 33378609 PMC7787219 Baden, L. R. et al. Efficacy and safety of the mRNA-1273 SARS-CoV-2 vaccine. N. Engl. J. Med 384 33378609 10.1056/NEJMoa2035389 PMC7787219 26. Houseley J Tollervey D The many pathways of RNA degradation Cell 2009 136 763 776 10.1016/j.cell.2009.01.019 19239894 Houseley, J. & Tollervey, D. The many pathways of RNA degradation. Cell 136 19239894 10.1016/j.cell.2009.01.019 27. Wek, R. C. Role of eIF2alpha kinases in translational control and adaptation to cellular stress. Cold Spring Harb. Perspect Biol. 10 10.1101/cshperspect.a032870 PMC6028073 29440070 28. Haghighat A Mader S Pause A Sonenberg N Repression of cap-dependent translation by 4E-binding protein 1: competition with p220 for binding to eukaryotic initiation factor-4E EMBO J. 1995 14 5701 5709 10.1002/j.1460-2075.1995.tb00257.x 8521827 PMC394685 Haghighat, A., Mader, S., Pause, A. & Sonenberg, N. Repression of cap-dependent translation by 4E-binding protein 1: competition with p220 for binding to eukaryotic initiation factor-4E. EMBO J. 14 8521827 10.1002/j.1460-2075.1995.tb00257.x PMC394685 29. Barbier AJ Jiang AY Zhang P Wooster R Anderson DG The clinical progress of mRNA vaccines and immunotherapies Nat. Biotechnol. 2022 40 840 854 10.1038/s41587-022-01294-2 35534554 Barbier, A. J., Jiang, A. Y., Zhang, P., Wooster, R. & Anderson, D. G. The clinical progress of mRNA vaccines and immunotherapies. Nat. Biotechnol. 40 35534554 10.1038/s41587-022-01294-2 30. Lee IT Safety and immunogenicity of a phase 1/2 randomized clinical trial of a quadrivalent, mRNA-based seasonal influenza vaccine (mRNA-1010) in healthy adults: interim analysis Nat. Commun. 2023 14 3631 10.1038/s41467-023-39376-7 37336877 PMC10279702 Lee, I. T. et al. Safety and immunogenicity of a phase 1/2 randomized clinical trial of a quadrivalent, mRNA-based seasonal influenza vaccine (mRNA-1010) in healthy adults: interim analysis. Nat. Commun. 14 37336877 10.1038/s41467-023-39376-7 PMC10279702 31. Carvalho T mRNA vaccine effective against RSV respiratory disease Nat. Med 2023 29 755 756 10.1038/d41591-023-00017-7 36792804 Carvalho, T. mRNA vaccine effective against RSV respiratory disease. Nat. Med 29 36792804 10.1038/d41591-023-00017-7 32. Schoenmaker L mRNA-lipid nanoparticle COVID-19 vaccines: Structure and stability Int J. Pharm. 2021 601 120586 10.1016/j.ijpharm.2021.120586 33839230 PMC8032477 Schoenmaker, L. et al. mRNA-lipid nanoparticle COVID-19 vaccines: Structure and stability. Int J. Pharm. 601 33839230 10.1016/j.ijpharm.2021.120586 PMC8032477 33. Clark, N. E. et al. Removal of dsRNA byproducts using affinity chromatography. Mol. Ther. Nucleic Acids 36 10.1016/j.omtn.2025.102549 PMC12141893 40487356 34. Nelson J Impact of mRNA chemistry and manufacturing process on innate immune activation Sci. Adv. 2020 6 eaaz6893 10.1126/sciadv.aaz6893 32637598 PMC7314518 Nelson, J. et al. Impact of mRNA chemistry and manufacturing process on innate immune activation. Sci. Adv. 6 32637598 10.1126/sciadv.aaz6893 PMC7314518 35. Pizzuto M Cationic lipids as one-component vaccine adjuvants: a promising alternative to alum J. Control Release 2018 287 67 77 10.1016/j.jconrel.2018.08.020 30110615 Pizzuto, M. et al. Cationic lipids as one-component vaccine adjuvants: a promising alternative to alum. J. Control Release 287 30110615 10.1016/j.jconrel.2018.08.020 36. Bernard MC The impact of nucleoside base modification in mRNA vaccine is influenced by the chemistry of its lipid nanoparticle delivery system Mol. Ther. Nucleic Acids 2023 32 794 806 10.1016/j.omtn.2023.05.004 37346973 PMC10280092 Bernard, M. C. et al. The impact of nucleoside base modification in mRNA vaccine is influenced by the chemistry of its lipid nanoparticle delivery system. Mol. Ther. Nucleic Acids 32 37346973 10.1016/j.omtn.2023.05.004 PMC10280092 37. Roy B Jacobson A The intimate relationships of mRNA decay and translation Trends Genet 2013 29 691 699 10.1016/j.tig.2013.09.002 24091060 PMC3854950 Roy, B. & Jacobson, A. The intimate relationships of mRNA decay and translation. Trends Genet 29 24091060 10.1016/j.tig.2013.09.002 PMC3854950 38. Svitkin YV N1-methyl-pseudouridine in mRNA enhances translation through eIF2α-dependent and independent mechanisms by increasing ribosome density Nucleic Acids Res. 2017 45 6023 6036 10.1093/nar/gkx135 28334758 PMC5449617 Svitkin, Y. V. et al. N1-methyl-pseudouridine in mRNA enhances translation through eIF2α-dependent and independent mechanisms by increasing ribosome density. Nucleic Acids Res. 45 28334758 10.1093/nar/gkx135 PMC5449617 39. Melamed JR Lipid nanoparticle chemistry determines how nucleoside base modifications alter mRNA delivery J. Control Release 2022 341 206 214 10.1016/j.jconrel.2021.11.022 34801660 PMC8905090 Melamed, J. R. et al. Lipid nanoparticle chemistry determines how nucleoside base modifications alter mRNA delivery. J. Control Release 341 34801660 10.1016/j.jconrel.2021.11.022 PMC8905090 40. Cesaro T Michiels T Inhibition of PKR by viruses Front Microbiol. 2021 12 757238 10.3389/fmicb.2021.757238 34759908 PMC8573351 Cesaro, T. & Michiels, T. Inhibition of PKR by viruses. Front Microbiol. 12 34759908 10.3389/fmicb.2021.757238 PMC8573351 41. Heberle AM Molecular mechanisms of mTOR regulation by stress Mol. Cell Oncol. 2015 2 e970489 10.4161/23723548.2014.970489 27308421 PMC4904989 Heberle, A. M. et al. Molecular mechanisms of mTOR regulation by stress. Mol. Cell Oncol. 2 27308421 10.4161/23723548.2014.970489 PMC4904989 42. Roux, P. P. & Topisirovic, I. Signaling pathways involved in the regulation of mRNA translation. Mol. Cell Biol. 38 10.1128/MCB.00070-18 PMC5974435 29610153 43. Tahtinen S IL-1 and IL-1ra are key regulators of the inflammatory response to RNA vaccines Nat. Immunol. 2022 23 532 542 10.1038/s41590-022-01160-y 35332327 Tahtinen, S. et al. IL-1 and IL-1ra are key regulators of the inflammatory response to RNA vaccines. Nat. Immunol. 23 35332327 10.1038/s41590-022-01160-y 44. Chen J Lipid nanoparticle-mediated lymph node-targeting delivery of mRNA cancer vaccine elicits robust CD8(+) T cell response Proc. Natl. Acad. Sci. USA 2022 119 e2207841119 10.1073/pnas.2207841119 35969778 PMC9407666 Chen, J. et al. Lipid nanoparticle-mediated lymph node-targeting delivery of mRNA cancer vaccine elicits robust CD8(+) T cell response. Proc. Natl. Acad. Sci. USA 119 35969778 10.1073/pnas.2207841119 PMC9407666 45. Lee Y Immunogenicity of lipid nanoparticles and its impact on the efficacy of mRNA vaccines and therapeutics Exp. Mol. Med 2023 55 2085 2096 10.1038/s12276-023-01086-x 37779140 PMC10618257 Lee, Y. et al. Immunogenicity of lipid nanoparticles and its impact on the efficacy of mRNA vaccines and therapeutics. Exp. Mol. Med 55 37779140 10.1038/s12276-023-01086-x PMC10618257 46. Yang E Li MMH All about the RNA: interferon-stimulated genes that interfere with viral RNA processes Front Immunol. 2020 11 605024 10.3389/fimmu.2020.605024 33362792 PMC7756014 Yang, E. & Li, M. M. H. All about the RNA: interferon-stimulated genes that interfere with viral RNA processes. Front Immunol. 11 33362792 10.3389/fimmu.2020.605024 PMC7756014 47. Alcorn JF Differential gene expression in peripheral blood mononuclear cells from children immunized with inactivated influenza vaccine Hum. Vaccin Immunother. 2020 16 1782 1790 10.1080/21645515.2020.1711677 32298194 PMC7482876 Alcorn, J. F. et al. Differential gene expression in peripheral blood mononuclear cells from children immunized with inactivated influenza vaccine. Hum. Vaccin Immunother. 16 32298194 10.1080/21645515.2020.1711677 PMC7482876 48. Lee HK Robust immune response to the BNT162b mRNA vaccine in an elderly population vaccinated 15 months after recovery from COVID-19 medRxiv 2021 10.1101/2021.09.08.21263284 Lee, H. K. et al. Robust immune response to the BNT162b mRNA vaccine in an elderly population vaccinated 15 months after recovery from COVID-19. medRxiv 49. Lee Y Jeong M Park J Jung H Lee H Immunogenicity of lipid nanoparticles and its impact on the efficacy of mRNA vaccines and therapeutics Exp. Mol. Med. 2023 55 2085 2096 10.1038/s12276-023-01086-x 37779140 PMC10618257 Lee, Y., Jeong, M., Park, J., Jung, H. & Lee, H. Immunogenicity of lipid nanoparticles and its impact on the efficacy of mRNA vaccines and therapeutics. Exp. Mol. Med. 55 37779140 10.1038/s12276-023-01086-x PMC10618257 50. Sebastiani F Apolipoprotein E binding drives structural and compositional rearrangement of mRNA-containing lipid nanoparticles ACS Nano 2021 15 6709 6722 10.1021/acsnano.0c10064 33754708 PMC8155318 Sebastiani, F. et al. Apolipoprotein E binding drives structural and compositional rearrangement of mRNA-containing lipid nanoparticles. ACS Nano 15 33754708 10.1021/acsnano.0c10064 PMC8155318 51. Guo S Size, shape, and sequence-dependent immunogenicity of RNA nanoparticles Mol. Ther. Nucleic Acids 2017 9 399 408 10.1016/j.omtn.2017.10.010 29246318 PMC5701797 Guo, S. et al. Size, shape, and sequence-dependent immunogenicity of RNA nanoparticles. Mol. Ther. Nucleic Acids 9 29246318 10.1016/j.omtn.2017.10.010 PMC5701797 52. Institute for Laboratory Animal Research. Guide for the Care and Use of Laboratory Animals. Available at: https://grants.nih.gov/grants/olaw/guide-for-the-care-and-use-of-laboratory-animals.pdf 53. Whitley J Development of mRNA manufacturing for vaccines and therapeutics: mRNA platform requirements and development of a scalable production process to support early phase clinical trials Transl. Res. 2022 242 38 55 10.1016/j.trsl.2021.11.009 34871810 PMC8641981 Whitley, J. et al. Development of mRNA manufacturing for vaccines and therapeutics: mRNA platform requirements and development of a scalable production process to support early phase clinical trials. Transl. Res. 242 34871810 10.1016/j.trsl.2021.11.009 PMC8641981 54. DeRosa F Improved efficacy in a fabry disease model using a systemic mRNA liver depot system as compared to enzyme replacement therapy Mol. Ther. 2019 27 878 889 10.1016/j.ymthe.2019.03.001 30879951 PMC6453518 DeRosa, F. et al. Improved efficacy in a fabry disease model using a systemic mRNA liver depot system as compared to enzyme replacement therapy. Mol. Ther. 27 30879951 10.1016/j.ymthe.2019.03.001 PMC6453518 55. Chivukula S Development of multivalent mRNA vaccine candidates for seasonal or pandemic influenza npj Vaccines 2021 6 153 10.1038/s41541-021-00420-6 34916519 PMC8677760 Chivukula, S. et al. Development of multivalent mRNA vaccine candidates for seasonal or pandemic influenza. npj Vaccines 6 34916519 10.1038/s41541-021-00420-6 PMC8677760 ",
  "metadata": {
    "Title of this paper": "Development of multivalent mRNA vaccine candidates for seasonal or pandemic influenza",
    "Journal it was published in:": "NPJ Vaccines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479783/"
  }
}