{
  "title": "Paper_901",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12487536 PMC12487536.1 12487536 12487536 41040758 10.7759/cureus.91400 1 Pediatrics Safe Airway Management in a Pediatric Case of PTEN Hamartoma Tumor Syndrome With Multiple Pharyngeal and Laryngeal Polyps: A Case Report Muacevic Alexander Adler John R Rie Chida 1 Shinichiro Morichi 2 Hiroki Ishii 2 Rika Matsumoto 3 Shigeo Nishimata 2 Yamanaka Gaku 2  1  2  3 Chida Rie eve.chi-cha@live.jp 1 9 2025 9 2025 17 9 495976 e91400 31 8 2025 01 09 2025 02 10 2025 03 10 2025 Copyright © 2025, Rie et al. 2025 Rie et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/386745-safe-airway-management-in-a-pediatric-case-of-pten-hamartoma-tumor-syndrome-with-multiple-pharyngeal-and-laryngeal-polyps-a-case-report Safe airway management is essential, as even brief airway obstruction under anesthesia can lead to brain injury. Patients with PTEN hamartoma tumor syndrome (PHTS) undergo tonsillectomy more frequently than the general population. Although physical features of PHTS are associated with difficult intubation, prior literature has not addressed airway management in pediatric PHTS cases. This case highlights the importance of preoperative airway evaluation and planning to ensure safe airway management. The case was a four-year and three-month-old boy with PHTS who visited our hospital with a one-month history of cough and snoring. His tonsils were remarkably enlarged, and sleep apnea was observed. Tonsillectomy was planned, and preoperative nasopharyngolaryngoscopy revealed multiple polyps in the hypopharynx and larynx. He was previously diagnosed with difficult intubation because macrocephaly limited head movement, obstructing visualization of the glottic orifice during colorectal polypectomy. Therefore, we considered that multiple polyps in the hypopharynx and larynx could be another risk factor for difficult intubation. For safety management, fiberoptic nasotracheal intubation was selected, and airway complications were prevented. Preoperative airway assessment beyond bedside physical examination is necessary to accurately identify the risk of difficult intubation and consider safe airway management plans to avoid the worst-case scenario of airway management. difficult intubation laryngeal polyp nasotracheal fiberoptic intubation pten hamartoma tumor syndrome upper airway obstruction pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction PTEN hamartoma tumor syndrome (PHTS) is an autosomal dominant cancer predisposition syndrome caused by mutations in the tumor suppressor gene PTEN (OMIM 601728), encompassing Cowden syndrome and Bannayan-Riley-Ruvalcaba syndrome [ 1 1 2 1 3 4 Herein, we report a pediatric case of PHTS that required fiberoptic nasotracheal intubation with spontaneous breathing due to difficult intubation caused by macrocephaly and multiple polyps in the hypopharynx and larynx. Case presentation A two-month-old boy was referred to our hospital for evaluation of macrocephaly (head circumference, 43 cm;＋4.4 standard deviations). He developed bloody stools and prolapsed rectal polyps at one year and six months, and endoscopic evaluation revealed multiple polyps in the entire intestine at two years and two months. Annual follow-up with polypectomy under general anesthesia has continued since then. During endotracheal intubation, the patient was diagnosed with difficult intubation due to macrocephaly, which limited head extension and prevented visualization of the glottic orifice. At three years old, informed consent was obtained for a single-nucleotide polymorphism array analysis, which revealed a PTEN gene mutation [46, XY, der(10)del(10)(q23.2q23.31)t(1;10)(p36.2;q23.31),t(2;7)(p13;p13)], and a definitive diagnosis of PHTS was confirmed. At four years and three months old, he visited our hospital with a one-month history of coughing and snoring. His body temperature, respiratory rate, and oxygen saturation in room air were 36.5°C, 16 breaths per minute, and 96%, respectively. Physical examination revealed grade 4 enlarged tonsils, forced breathing, and stridor. Chest radiography revealed pneumonia in the lower right lobe. He was admitted for pneumonia treatment and sleep apnea monitoring. On the second day of admission, sleep apnea was observed. Nasopharyngolaryngoscopy performed by an otolaryngologist revealed tonsillar enlargement and multiple polyps in the hypopharynx and larynx (Figures 1A 1B Figure 1 Nasopharyngolaryngoscopic findings (A) The patient at four years and three months old. Hyperplastic tonsils narrow the oral cavity. (B) The patient at four years and three months old. Multiple polyps in the hypopharynx. (C) The patient at seven years old. No relapse of tonsillar hyperplasia after tonsillectomy. (D) The patient at seven years old. Nonremarkable changes in laryngeal polyps after three years of observation. These polyps were not observed four months before polypectomy under general anesthesia, and tonsillectomy was performed for progressive acute airway obstruction. Fiberoptic nasotracheal intubation was selected for safe airway management because of intubation difficulties due to laryngeal polyps and a high risk of asphyxia without spontaneous breathing. Anesthesiologists performed intubation in the operating room, and tracheotomy was planned if intubation and mask ventilation were not possible. Numerous polyps were present in the hypopharynx and larynx. Since their removal could potentially cause airway narrowing and might develop another polyp, we decided to resect these polyps only if they were likely to cause airway obstruction. On the third day of admission, tracheal extubation was performed without complications. The tonsillar enlargement was histologically diagnosed as chronic active tonsillitis with follicular hyperplasia. Stridor did not recur, and hypopharyngeal and laryngeal polyps were not considered the cause of upper airway obstruction. Nasopharyngolaryngoscopic follow-up every six months was continued for three years after tonsillectomy without enlargement of hypopharyngeal and laryngeal polyps (Figures 1C 1D Discussion Herein, we report a pediatric case of PHTS that required fiberoptic nasotracheal intubation with spontaneous breathing due to difficulty in intubation caused by macrocephaly and multiple polyps in the hypopharynx and larynx. Difficult intubation due to papillomatous lesions in the tongue and pharynx has been reported in two adult cases of PHTS [ 5 6 Patients with PHTS present with benign and malignant tumors in various organs [ 1 7 8 4 4 To clarify the clinical characteristics of airway obstruction and management for PHTS in childhood, we searched the PubMed database using the terms “PTEN hamartoma tumor syndromes,” “child,” and “airway obstruction” and examined the references of the retrieved articles for additional articles. Our search identified four cases, including ours, and five cases of airway obstruction have been identified (Table 1 5 9 11 Table 1 Airway obstruction for children with PHTS PHTS: PTEN hamartoma tumor syndrome Variables Case 1 Case 2 Case 3 Case 4 Case 5 Sex Male Female Female Not available Male Age at airway obstruction detection 5 years 6 years 2 years 6 months 6 months 4 years Cause of airway obstruction Tonsillar papilloma Tonsillar hypertrophy Tonsillar hypertrophy and papilloma Hyperplastic tonsils and enlarged thymus Tonsillar hypertrophy Symptoms of airway obstruction Sleep apnea Not available Increased tonsillar mass in a short period Shortness of breath Sleep apnea Other symptoms External hydrocephalus, macrocephaly, pigmented penile macule, developmental delay, oropharyngeal papilloma Macrocephaly, multiple benign tumors, café-au-lait spots Macrocephaly, lipomas, café-au-lait spots Macrocephaly, cachexia, dysphagia, intestinal lymphoid hyperplasia Macrocephaly, developmental delay, intestinal polyps, bilateral cryptorchidism Treatment Adenotonsillectomy Tonsillectomy Tonsillectomy Sirolimus Tonsillectomy Intubation technique Direct laryngoscopy Not available Not available Not available Fiberoptic nasotracheal intubation Difficult intubation No Not available Not available Not available Yes Preoperative evaluation No Not available Not available Not available Yes Reference Sharma et al. [ 5 Latiff et al. [ 9 Piccione et al. [ 10 Schmid et al. [ 11 Present case The cause of airway obstruction in childhood was tonsillar papilloma or hyperplasia in all cases, and one case was accompanied by an enlarged thymus. Tonsillectomy was performed in four cases, and only one case was diagnosed as a difficult intubation. In addition, preoperative evaluation of the airway was not performed, except in the present case. This might be because most of the upper airway obstruction for PHTS is caused by tonsillar issues, and pharyngeal and laryngeal polyps rarely occur in childhood [ 12 Conclusions In conclusion, the symptoms of PHTS, such as macrocephaly and multiple polyps in the hypopharynx and larynx, are associated with difficulty in intubation. Although hypopharyngeal and laryngeal polyps are rare in pediatric cases of PHTS, preoperative airway assessment beyond bedside examination is essential to accurately assess intubation risk and develop safe airway management plans, potentially preventing catastrophic outcomes. Disclosures Human subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Supervision: References 1 PTEN hamartoma tumour syndrome: early tumour development in children Arch Dis Child Smpokou P Fox VL Tan WH 34 37 100 2015 25114091 10.1136/archdischild-2014-305997 2 PTEN-opathies: from biological insights to evidence-based precision medicine J Clin Invest Yehia L Ngeow J Eng C 452 464 129 2019 30614812 10.1172/JCI121277 PMC6355220 3 Effects of head posture on the oral, pharyngeal and laryngeal axis alignment in infants and young children by magnetic resonance imaging Paediatr Anaesth Vialet R Nau A Chaumoître K Martin C 525 531 18 2008 18363622 10.1111/j.1460-9592.2008.02530.x 4 Management of difficult intubation Eur J Anaesthesiol Janssens M Hartstein G 3 12 18 2001 11270007 10.1046/j.0265-0215.2000.00777.x 5 Airway obstruction caused by PTEN hamartoma (Bannayan-Riley-Ruvalcaba) syndrome Arch Otolaryngol Head Neck Surg Sharma MR Petty EM Lesperance MM 1157 1160 133 2007 18025323 10.1001/archotol.133.11.1157 6 Case of Cowden's disease that caused airway obstruction during induction of anesthesia Anesthesiology Omote K Kawamata T Imaizumi H Namiki A 1537 1540 91 1999 10551610 10.1097/00000542-199911000-00051 7 Exploring tonsil pathology in PTEN hamartoma syndrome: a cohort study J Laryngol Otol Cairns LM Findlay C Jayakody N Amonoo-Kuofi K Patel NN Lachlan KL 1100 1102 138 2024 38763900 10.1017/S0022215124000975 PMC11669465 8 The use of laryngeal mask airway for tonsillectomy and adenoidectomy Int J Pediatr Otorhinolaryngol Webb N Kars MS Butler AL Malesinska M Smith LP 110691 144 2021 33773427 10.1016/j.ijporl.2021.110691 9 Bannayan Riley Ruvalcaba syndrome Ann Acad Med Singap Latiff ZA Atmawidjaja RW RajaLope RJ Syed Omar SA Syed Zakaria SZ Jamal RA 578 572 39 2010 https://www.annals.edu.sg/pdf/39VolNo7Jul2010/V39N7p578.pdf 20697678 10 PTEN hamartoma tumor syndromes in childhood: description of two cases and a proposal for follow-up protocol Am J Med Genet A Piccione M Fragapane T Antona V Giachino D Cupido F Corsello G 2902 2908 161A 2013 24123798 10.1002/ajmg.a.36266 11 Sirolimus treatment of severe PTEN hamartoma tumor syndrome: case report and in vitro studies Pediatr Res Schmid GL Kässner F Uhlig HH 527 534 75 2014 24366516 10.1038/pr.2013.246 12 PTEN hamartoma tumor syndrome in childhood: a review of the clinical literature Am J Med Genet C Semin Med Genet Macken WL Tischkowitz M Lachlan KL 591 610 181 2019 31609537 10.1002/ajmg.c.31743 ",
  "metadata": {
    "Title of this paper": "PTEN hamartoma tumor syndrome in childhood: a review of the clinical literature",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487536/"
  }
}