{
  "title": "Paper_850",
  "abstract": "pmc JCEM Case Rep JCEM Case Rep 4514 jcemcr jcemcr JCEM Case Reports 2755-1520 Oxford University Press PMC12461566 PMC12461566.1 12461566 12461566 41018173 10.1210/jcemcr/luaf219 luaf219 1 Case Report AcademicSubjects/MED00010 AcademicSubjects/MED00160 AcademicSubjects/MED00250 AcademicSubjects/MED00300 AcademicSubjects/MED00905 A Case of Amyotrophic Lateral Sclerosis With Coexisting Maturity-onset Diabetes of the Young Type 5 https://orcid.org/0009-0009-8735-7435 Tanaka Satoshi  Diabetes and Metabolism, School of Medicine, Tokyo Women's Medical University Tokyo 162-8666 Japan  Institute for Comprehensive Medical Sciences, Tokyo Women's Medical University Tokyo 162-8666 Japan Kobayashi Masaki  Department of Neurology, School of Medicine, Tokyo Women's Medical University Tokyo 162-8666 Japan https://orcid.org/0000-0002-1197-1705 Ikeguchi Ryotaro  Department of Neurology, School of Medicine, Tokyo Women's Medical University Tokyo 162-8666 Japan https://orcid.org/0000-0002-1857-7890 Iwasaki Naoko  Diabetes and Metabolism, School of Medicine, Tokyo Women's Medical University Tokyo 162-8666 Japan  Institute for Comprehensive Medical Sciences, Tokyo Women's Medical University Tokyo 162-8666 Japan  Division of Diabetes, Endocrinology and Metabolism, Tokyo Women's Medical University Yachiyo Medical Center Chiba 276-8524 Japan Correspondence: iwasaki.naoko@twmu.ac.jp 11 2025 25 9 2025 3 11 497495 luaf219 11 7 2025 22 8 2025 25 9 2025 25 09 2025 26 09 2025 29 09 2025 © The Author(s) 2025. Published by Oxford University Press on behalf of the Endocrine Society. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs licence ( https://creativecommons.org/licenses/by-nc-nd/4.0/ Abstract We report the case of a 60-year-old Japanese woman with genetically confirmed maturity-onset diabetes of the young type 5 [MODY5; HNF1B (hepatocyte nuclear factor 1B)-MODY] who developed amyotrophic lateral sclerosis (ALS), a progressive neurodegenerative disorder. MODY is a rare monogenic form of diabetes mellitus, typically associated with urogenital anomalies and pancreatic hypoplasia. At the age of 25, she was diagnosed with diabetes mellitus. The clinical findings, including bilateral renal cysts, agenesis of the pancreatic body and tail, and impaired insulin secretion without β−cell-specific autoimmune autoantibodies, suggested HNF1B-MODY. A 1.4-Mb hemiallelic deletion on chromosome 17q12 encompassing HNF1B To our knowledge, this is the first reported case of concurrent ALS and HNF1B-MODY. While a direct genetic link is unclear, this co-occurrence may provide insights into the shared molecular pathways and warrants further investigation. amyotrophic lateral sclerosis ALS MODY maturity-onset diabetes of the young HNF-1B JSPS KAKENHI JP21K06281 25K09717 Ministry of Education, Culture, Sports, Science and Technology 10.13039/501100001700 Manpei Suzuki Diabetes Research Foundation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Amyotrophic lateral sclerosis (ALS) is a progressive neurodegenerative disorder characterized by the degeneration of both upper and lower motor neurons [ 1 2 Maturity-onset diabetes of the young type 5 [MODY5; HNF1B (hepatocyte nuclear factor 1B)-MODY] is a rare monogenic form of diabetes caused by pathogenic variants in HNF1B HNF1B 3 4 5 Although HNF1B-MODY has well-established endocrine and renal manifestations, neurological manifestations remain unclear. To the best of our knowledge, co-occurrence of ALS and HNF1B-MODY has not been reported. Here, we report the case of a patient with genetically confirmed HNF1B-MODY who was later diagnosed with ALS. Case Presentation Following symptoms of a respiratory infection, a 60-year-old Japanese woman developed persistent dysarthria that progressed over several weeks in association with slurred speech and limb weakness. Five months after the onset of the symptoms, she was referred to neurology and admitted for further evaluation. At the age of 25, she was diagnosed with diabetes mellitus (DM). She was lean and exhibited reduced insulin secretion but tested negative for glutamic acid decarboxylase antibodies. She had no family history of early-onset DM or neurological disorders, including ALS, at the time (2010; Fig. 1 Fig. 2 Figure 1. Pedigree as of genetic counseling in 2010. The proband is indicated by an arrow. No other family members had a history of early-onset diabetes. The patient's sister had hydrocephalus but was employed as a hospital nurse, indicating preserved cognitive function. Genetic testing was not conducted in other family members, as they declined to participate. Figure 2. Chromosomal microarray analysis identified a heterozygous deletion of approximately 1.4 Mb at chromosome 17q12, specifically at coordinates chr17:34815184_36241526 (hg19). The deleted region encompasses the HNF1B Diagnostic Assessment Upon admission at the age of 60, her height was 159.2 cm, her weight was 50.3 kg (body mass index 19.8 kg/m²), and her vital signs were stable. A neurological examination revealed dysarthria, tongue atrophy with fasciculations, and mild limb weakness. She exhibited an exaggerated jaw reflex, hyperreflexia in all limbs (left-dominant), and bilateral Babinski signs. Mild spasticity was observed in the lower limbs. Sensory and cerebellar examinations were normal. Laboratory findings, including screening for autoimmune and paraneoplastic antibodies, were unremarkable ( Table 1 Fig. 3 Table 2 Figure 3. Brain and spinal MRI at the time of admission. The brain MRI showed only age-related changes without any structural abnormalities. The cervical and thoracic spine MRI revealed only mild spondylotic changes. Abbreviation: MRI, magnetic resonance imaging. Table 1. Laboratory findings on admission Complete blood count [reference range] Biochemistry, continued [reference range] Biochemistry, continued [reference range] WBC 9.46 × 10⁹/L [4.0-10.0 ×10⁹/L] γ-GTP 40 U/L [7-32 U/L] IgG 1328 mg/dL (13.28 g/L) [700-1600 mg/dL (7-16 g/L)] Neutrophils 62.6% [40-70%] Creatine kinase 98 U/L [30-200 U/L] IgM 727 mg/dL (7.27 g/L) [40-230 mg/dL (0.4-2.3 g/L)] Lymphocytes 27.6% [20-45%] Urea nitrogen 27.6 mg/dL (9.86 mmol/L) [8-20 mg/dL (2.9-7.1 mmol/L)] IgA 83 mg/dL (0.83 g/L) [70-400 mg/dL (0.7-4.0 g/L)] Monocytes 4.2% [2-8%] Creatinine 1.31 mg/dL (115.9 µmol/L) [0.7-1.3 mg/dL (60-115 µmol/L)] Vitamin B12 516 pg/mL (380 pmol/L) [180-914 pg/mL (133-675 pmol/L)] Eosinophils 5.0% [1-4%] Estimated GFR 32.9 mL/min/1.73 m² [>60 mL/min/1.73 m²] Folate 4.0 ng/mL (9.07 nmol/L) [3-16 ng/mL (6.8-36.2 nmol/L)] Basophils 0.6% [0-1%] Sodium 141 mmol/L [135-145 mmol/L] Vitamin B1 29.0 ng/mL (85.8 nmol/L) [24-66 ng/mL (70-200 nmol/L)] RBC 4.22 × 10¹²/L [4.2-5.4 ×10¹²/L] Potassium 4.2 mmol/L [3.5-5.0 mmol/L] Rheumatoid factor 6 kU/L [<15 kU/L] Hemoglobin 13.2 g/dL (132 g/L) [13.5-17.6 g/dL (135-176 g/L)] Chloride 105 mmol/L [98-106 mmol/L] Antinuclear antibody <40× [<40×] Hematocrit 36.7% (0.367) [40-50% (0.40-0.50)] Calcium 9.5 mg/dL (2.37 mmol/L) [8.5-10.1 mg/dL (2.1-2.5 mmol/L)] Anti-dsDNA 1.8 IU/mL [<10 IU/mL] MCV 87.0 fL [80-100 fL] BNP 20.5 ng/L [<100 ng/L] Anti-SS-A/Ro 1.7 U/mL [<7 U/mL] MCH 28.9 pg [27-33 pg] Lactate 7.7 mg/dL (0.855 mmol/L) [4.5-19.8 mg/dL (0.5-2.2 mmol/L)] Anti-SS-B/La 1.3 U/mL [<10 U/mL] MCHC 33.2 g/dL (332 g/L) [32-36 g/dL (320-360 g/L)] Uric acid 0.43 mg/dL (25.6 µmol/L) [3.6-7.2 mg/dL (214-428 µmol/L)] MPO-ANCA <1.0 U/mL [<3.5 U/mL] Platelet 2.25 × 10¹¹/L [1.5-3.5 ×10¹¹/L] PT 11.1 seconds [10-13 seconds] PR3-ANCA 1.7 U/mL [<3.5 U/mL] Artery blood gas analysis (room air) [reference range] PT-INR 0.94 [0.8-1.2] pH 7.481 [7.35-7.45] APTT 26.1 seconds [25-35 seconds]  Cerebrospinal fluid test [reference range] pCO 2 35.7 mmHg (4.76 kPa) [35-45 mmHg (4.7-6.0 kPa)] D-dimer 0.5 mg/L [<1.0 mg/L] Opening pressure 150 mmH₂O [70-180 mmH₂O] pO 2 77.7 mmHg (10.34 kPa) [80-100 mmHg (10.7-13.3 kPa)] TAT 2.0 ng/mL [<3.0 ng/mL] Closing pressure 70 mmH₂O [50-150 mmH₂O] HCO3 26.1 mmol/L [22-26 mmol/L] HbA1c 6.9% (52 mmol/mol) [4.6-6.2% (20-44 mmol/mol)] Appearance Clear and transparent Anion gap 16.9 mmol/L [8-16 mmol/L] LDL-C 140 mg/dL (3.62 mmol/L) [<120 mg/dL (<3.1 mmol/L)] Cell Count 0.3 cells/μL [<5 cells/μL] AaDO2 30.2 mmHg (4.02 kPa) [<15 mmHg] Triglycerides 125 mg/dL (1.41 mmol/L) [<150 mg/dL (<1.7 mmol/L)] Lymphocytes 0.3 cells/μL [<5 cells/μL] Biochemistry [reference range] CEA 4.7 μg/L [<5.0 μg/L] Neutrophils 0.0 cells/μL [0 cells/μL] Albumin 4.2 g/dL (42 g/L) [3.5-5.0 g/dL (35-50 g/L)] CA19-9 <2 kU/L [<37 kU/L] Protein 33 mg/dL (330 mg/L) [15-45 mg/dL (150-450 mg/L)] CRP 0.04 mg/dL (0.4 mg/L) [<0.3 mg/dL (<3 mg/L)] CA125 14 kU/L [<35 kU/L] Glucose 64 mg/dL (3.55 mmol/L) [50-75 mg/dL (2.8-4.2 mmol/L)] AST 29 U/L [10-40 U/L] TSH 1.480 mIU/L [0.4-4.0 mIU/L] Interleukin-2 receptor <30 U/mL [<100 U/mL] ALT 8 U/L [5-40 U/L] Free T4 1.52 ng/dL (19.6 pmol/L) [0.8-1.8 ng/dL (10-23 pmol/L)] Basic protein ≤40.0 pg/mL [<60 pg/mL] LDH 226 U/L [120-245 U/L] Free T3 3.01 pg/mL (4.63 pmol/L) [2.3-4.2 pg/mL (3.5-6.5 pmol/L)] Interleukin-6 3.4 pg/mL [<10 pg/mL] Values in parentheses are System of Units. Abbreviations: AaDO₂, alveolar-arterial oxygen difference; ALT, alanine aminotransferase; Anti-dsDNA, anti–double-stranded DNA antibody; Anti-SS-A/Ro, anti-Sjögren's syndrome–related antigen A antibody; Anti-SS-B/La, anti-Sjögren's syndrome–related antigen B antibody; APTT, activated partial thromboplastin time; AST, aspartate aminotransferase; BNP, B-type natriuretic peptide; CA125, cancer antigen 125; CA19-9, carbohydrate antigen 19-9; CEA, carcinoembryonic antigen; CRP, C-reactive protein, GFR, glomerular filtration rate; HbA1c, hemoglobin A1c; HCO₃, bicarbonate; LDH, lactate dehydrogenase; LDL-C, low-density lipoprotein cholesterol; MCH, mean corpuscular hemoglobin; MCHC, mean corpuscular hemoglobin concentration; MCV, mean corpuscular volume; MPO-ANCA, myeloperoxidase-antineutrophil cytoplasmic antibody; pCO₂, partial pressure of carbon dioxide; pO₂, partial pressure of oxygen; PR3-ANCA, proteinase 3-antineutrophil cytoplasmic antibody; PT, prothrombin time; PT-INR, prothrombin time-international normalized ratio; RBC, red blood cell; TAT, thrombin-antithrombin complex; WBC, white blood cell; γ-GTP, gamma-glutamyl transpeptidase. Table 2. Needle electromyography findings across multiple spinal segments Region Muscle Fibrillation Positive sharp wave Fasciculation Recruitment Motor unit potential Normal High amplitude Long duration Low amplitude Short duration Polyphasic Bulbar Tongue Not evaluable a Not evaluable a Not evaluable a Markedly reduced 1+ 2+ 1+ — — — Sternocleidomastoid — — — Normal 3+ — — — — — Upper trapezius — — — Normal 3+ — — — — — Cervical Cervical paraspinal — — — Reduced 1+ 2+ 1+ — — — Biceps brachii — — — Normal 3+ — — — — — Cervico-thoracic Abductor pollicis brevis — — — Normal to reduced 1+ 2+ 1+ — — — Thoracic Thoracic paraspinal — 1+ — Normal to reduced 2+ — — — — 1+ Lumbar Vastus lateralis — — — Normal 3+ — — — — — Lumbosacral Tibialis anterior — — — Normal 3+ — — — — —   a Treatment After the diagnosis of ALS, the patient received multidisciplinary supportive care. A neurologist, speech-language therapist, dietitian, and physical therapist were involved in managing her symptoms. Applications for public assistance for intractable diseases were submitted, and the patient and her family received counseling regarding prognosis, advance care planning, and options for future interventions. The blood glucose level was within the normal range without insulin due to reduced dietary intake. Outcome and Follow-up After discharge, the patient continued regular outpatient follow-up for monitoring ALS progression and receiving the best supportive care. Over the subsequent months, her dysarthria gradually worsened, and mild progression of limb weakness was observed. She was hospitalized multiple times due to aspiration pneumonia. Despite supportive treatment, her condition gradually deteriorated, and she died at the age of 63. Discussion This report describes the first known case of ALS coexisting with HNF1B-MODY. Although each condition is rare and has a distinct pathogenesis, the coexistence of these 2 diseases warrants further investigation regarding potential genetic or molecular overlap. The prevalence of HNF1B-MODY is only 1% to 2% among genetically diagnosed MODY. HNF1B HNF1B HNF1B 6 HNF1B HNF1B In the present case, chromosomal microarray analysis revealed a heterozygous deletion at 17q12 spanning 34815184 to 36241526. The deleted region encompasses 15 genes, including ZNHIT3, MYO19, PIGW, GGNBP2, DHRS11, MRM1, LHX1, AATF, ACACA, C17orf78, TADA2A, DUSP14, SYNRG, DDX52, HNF1B Fig. 4 GGNBP2 SYNRG 7 8 MYO19 MRM1 9 AATF 10 Figure 4. The 17q12 deletion (chr17:34,815,184-36,241,526, hg19) identified in this case encompasses 15 protein-coding genes, including ZNHIT3 MYO19, PIGW, GGNBP2, DHRS11, MRM1, LHX1, AATF, ACACA, C17orf78, TADA2A, DUSP14, SYNRG, DDX52 HNF1B https://genome-euro.ucsc.edu/ In addition to HNF1B-MODY, 17q12 recurrent deletion syndrome is causative of neurodevelopmental and neuropsychiatric disorders, including developmental delay, intellectual disability, autism spectrum disorder, attention deficit/hyperactivity disorder, schizophrenia, anxiety, and bipolar disorder [ 5 Pathogenic variants in several genes are associated with ALS; however, whole-exome sequencing of the present case did not identify any known ALS-associated pathogenic variants, including ANXA11 C9ORF72 CHMP2B DCTN1 DNAJC7 DYNC1H1 ERBB4 FIG 4 FUS HNRNPA1 KIF5A MATR3 NEFH NEK1 OPTN PFN1 SARM1 SCFD1 SETX SIGMAR1 SOD1 SPG11 SQSTM1 TARDBP TBK1 TNIP1 TUBA4A UBQLN2 UNC13A VAPB VCP 11 SOD1, TARDBP, FUS C9ORF72 2 1 Interestingly, previous studies suggested a potential inverse association between early-onset DM and the risk of developing ALS [ 12 HNF1B SOD1 C9ORF72 As this is a single case, a causal relationship between HNF1B-MODY and ALS could not be established. The co-occurrence of HNF1B-MODY and ALS in this patient, however, represents a previously unreported clinical association that may provide a foundation for future genetic and functional studies. Further investigation into the role of HNF1B Learning Points This is the first reported case of ALS coexisting with genetically confirmed HNF1B-MODY. The 17q12 deletion identified in this patient included 15 genes, none of which have been previously linked to ALS. Further research is needed to explore whether HNF1B Acknowledgments We would like to thank Yumiko Sagisaka and Mitsue Tomioka for their technical assistance. We also acknowledge Toshiyuki Yamamoto for providing the microarray analyses. The super-computing resource was provided by the Human Genome Center (University of Tokyo). The authors also thank the editors of SciTechEdit International LLC (Highlands Ranch, CO, USA) for English-language editing. Contributors All authors made individual contributions to authorship. N.I. made a diagnosis of HNF1B-MODY for the case and managed the patient. S.T. collected all case-related data and drafted the initial manuscript. S.T. and N.I. finalized the manuscript. M.K. and R.I. examined the patient and made a definite diagnosis of ALS and contributed to manuscript writing. All authors approved the final version. Funding This work was partially supported by Japan Society for the Promotion of Science (JSPS) KAKENHI grant numbers JP21K06281 and JP25K09717 from the Ministry of Education, Culture, Sports, Science, and Technology, Japan (MEXT), and the Manpei Suzuki Diabetes Research Foundation to N.I. Disclosures None declared. Informed Patient Consent for Publication Signed informed consent was obtained directly from the patient. Data Availability Statement Some or all datasets generated and/or analyzed during the current study are not publicly available but are available from the corresponding author on reasonable request. References 1 Feldman EL Goutman SA Petri S et al Amyotrophic lateral sclerosis Lancet 2022 400 10360 1363 1380 36116464 10.1016/S0140-6736(22)01272-7 PMC10089700 2 Taylor JP Brown RH Jr Cleveland DW Decoding ALS: from genes to mechanism Nature 2016 539 7628 197 206 27830784 10.1038/nature20413 PMC5585017 3 Faguer S Decramer S Chassaing N et al Diagnosis, management, and prognosis of HNF1B nephropathy in adulthood Kidney Int 2011 80 7 768 776 21775974 10.1038/ki.2011.225 4 Edghill EL Bingham C Ellard S Hattersley AT Mutations in hepatocyte nuclear factor-1beta and their related phenotypes J Med Genet 2006 43 1 84 90 15930087 10.1136/jmg.2005.032854 PMC2564507 5 Mitchel MW Moreno-De-luca DM Myers SM et al 17q12 Recurrent deletion syndrome Adam MP Feldman J Mirzaa GM et al GeneReviews® [Internet] University of Washington 2016 1993 2025 27929632 6 Ferrè S Igarashi P New insights into the role of HNF-1β in kidney (patho)physiology Pediatr Nephrol 2019 34 8 1325 1335 29961928 10.1007/s00467-018-3990-7 PMC6312759 7 Li CY Yang TM Ou RW Wei QQ Shang HF Genome-wide genetic links between amyotrophic lateral sclerosis and autoimmune diseases BMC Med 2021 19 1 27 33541344 10.1186/s12916-021-01903-y PMC7863260 8 Liu D Zuo X Zhang P et al The novel regulatory role of lncRNA-miRNA-mRNA axis in amyotrophic lateral sclerosis: an integrated bioinformatics analysis Comput Math Methods Med 2021 2021 5526179 33953791 10.1155/2021/5526179 PMC8067776 9 Yin KF Chen T Gu XJ et al Identification of potential causal genes for neurodegenerative diseases by mitochondria-related genome-wide Mendelian randomization Mol Neurobiol 2025 62 3 3892 3902 39347895 10.1007/s12035-024-04528-3 10 Huseby CJ Delvaux E Brokaw DL Coleman PD Blood RNA transcripts reveal similar and differential alterations in fundamental cellular processes in Alzheimer's disease and other neurodegenerative diseases Alzheimers Dement 2023 19 6 2618 2632 36541444 10.1002/alz.12880 PMC11633037 11 Shatunov A Al-Chalabi A The genetic architecture of ALS Neurobiol Dis 2021 147 105156 33130222 10.1016/j.nbd.2020.105156 12 Vasta R D'Ovidio F Logroscino G Chiò A The links between diabetes mellitus and amyotrophic lateral sclerosis Neurol Sci 2021 42 4 1377 1387 33544228 10.1007/s10072-021-05099-0 PMC7955983 Abbreviations ALS amyotrophic lateral sclerosis DM diabetes mellitus HNF1B hepatocyte nuclear factor 1B MODY5 maturity-onset diabetes of the young 5 MRI magnetic resonance imaging ",
  "metadata": {
    "Title of this paper": "The links between diabetes mellitus and amyotrophic lateral sclerosis",
    "Journal it was published in:": "JCEM Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12461566/"
  }
}