{
  "title": "Paper_94",
  "abstract": "pmc Future Oncol Future Oncol 3069 futoncol Future Oncology 1479-6694 1744-8301 Taylor & Francis PMC12490354 PMC12490354.1 12490354 12490354 40916449 10.1080/14796694.2025.2555165 2555165 1 Version of Record Research Article Research Article Disease management landscape in patients with mantle cell lymphoma in Japan: a real-world study S. RAI ET AL. FUTURE ONCOLOGY Rai Shinya  a Tanizawa Yoshinori  b Terasawa Tomoko  b Tajimi Masaomi  b Ideue Ryuichi  b Burlison Helen  c Milloy Neil  c Simpson Amber  c Taipale Kaisa-Leena  b Jen Min-Hua  b Segall Grace  b Goebel Benjamin  b Kiran Amit  b a Kindai University Hospital Osakasayama Japan b Eli Lilly and Company Indianapolis IN USA c Adelphi Real World Bollington UK CONTACT Yoshinori Tanizawa tanizawa_yoshinori@lilly.com Lilly Plaza One Bldg. 5-1-28 Isogamidori, Chuo-Ku Kobe 651-0086 Japan 7 9 2025 2025 21 23 498190 3051 3062 07 09 2025 03 10 2025 03 10 2025 Integra 16 9 2025 Integra 16 9 2025 05 6 2025 28 8 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group. 2025 The Author(s) https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivatives License ( http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Aim The objective of this study was to describe the disease management landscape for patients with mantle cell lymphoma (MCL) in Japan. Methods We conducted a cross-sectional survey with retrospective data capture of physicians and their consulting patients between March and December 2022. Physicians completed patient record forms in a 1:2 ratio: one patient receiving first-line (1 L) treatment and two patients with relapsed/refractory disease, one of whom must have received and discontinued a Bruton's tyrosine kinase inhibitor (BTKi). Results Sixty-seven patients were included – most were male (74.6%) and diagnosed with classical MCL (76.1%), with a mean age of 69.4 years and median time since MCL diagnosis of 18.0 months. The most common initial symptom was painless swelling in the neck, armpit, stomach, or groin (72%). Overall, patients had a “complete response” to 1 L (32/67 [47.8%]) therapy and “partial response” to 2 L (24/45 [53.3%]) therapy. Side effects were less commonly reported with BTKi than with chemotherapy. The most important physician-perceived treatment goal was to “minimize impact on patient’s daily life” or “tumor response” for patients receiving BTKi or chemotherapy, respectively. Conclusion Patients’ disease was generally well-managed by their physicians; however, improvements in efficacy, safety, and quality of life are still needed. Plain Language Summary This study wanted to look at how people with a type of cancer called mantle cell lymphoma (MCL) are treated in Japan. This involved looking at the characteristics of people with MCL, what treatments they received, and what doctors thought of their treatment. We asked 24 doctors to complete surveys for 67 patients with MCL in Japan, between March and December 2022. We found that most patients with MCL were elderly males and were diagnosed with a type of cancer called classical MCL. For their treatment, chemotherapy was used widely, especially as a first treatment. For patients that received a second treatment, drugs called Bruton’s tyrosine kinase inhibitors (BTKi) that specifically target cancer cells and their development were most common. We found that patients typically had a full response to their first treatment, but a partial response to treatments received after this. Overall, nearly half of patients experienced side effects from their treatment, and the most common were a blood condition called anemia and tiredness. For patients that were on chemotherapy when the survey was completed, over half reported side effects, but this was around a quarter for patients receiving a BTKi. When doctors were asked about important benefits that drug treatment could give to patients, improving quality of life was mentioned the most. When asked about how drug treatment could be improved, doctors mostly said achieving a full response. Therefore, our study showed that we still need more effective treatments for MCL with fewer side effects. KEYWORDS Mantle cell lymphoma MCL Japan real world patient characteristics treatment patterns Eli Lilly and Company 10.13039/100004312 Data collection was undertaken by Adelphi Real World as part of an independent survey, entitled the Adelphi Real World MCL DSP. The analysis described here used data from the Adelphi Real World MCL DSP. The DSP is a wholly owned Adelphi Real World product. Eli Lilly and Company was one of multiple subscribers to the DSP. Eli Lilly and Company did not influence the original survey through either contribution to the design of questionnaires or data collection. Publication of survey results was not contingent on the subscriber’s approval or censorship of the manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Background Mantle cell lymphoma (MCL) is a B-cell lymphoma with a heterogenous clinical course ranging from indolent (e.g., leukemic non-nodal MCL) to highly aggressive (e.g., blastoid variant) [ 1–3 4 5 6–8 There is no clear evidence regarding the choice of induction therapy [ 3 5 9–11 12 9 6 9 6 13 In Japan, a previous real-world investigation using a hospital-sourced administrative claims database also reported that the most common 1 L treatment was BR (28%), followed by a combination of rituximab/cyclophosphamide/doxorubicin/vincristine/prednisolone (R-CHOP; 16%) and a combination of rituximab/tetrahydropyranyl-adriamycin/cyclophosphamide/vincristine/prednisolone (R-THP-COP; 7%). In that study, ibrutinib monotherapy was mainly prescribed as a second- (2 L) or third-line (3 L) treatment (10% and 12%, respectively) [ 14 Nevertheless, at present there is limited real-world evidence for patients with MCL in Japan, especially in areas beyond drug treatment patterns, such as clinical characteristics and physician-perceived treatment goals and benefits, and from sources other than claims databases. Hence, the objective of the present study was to describe the disease management landscape for patients with MCL in this Japanese study cohort, including patient demographics and clinical characteristics, patterns of tests and assessments, healthcare resource use, and physician-perceived treatment goals and benefits, in addition to treatment patterns and outcomes (effectiveness and safety), in patients on systemic therapy. 2. Methods Data were sourced from the Adelphi MCL Disease Specific Programme (DSP), a cross-sectional survey with retrospective data capture of physicians (hematologists and hem-oncologists) and their consulting patients conducted in Japan between March and December 2022. DSPs are independent, impartial data sources which are not designed to address any pre-specified research questions or hypotheses. The DSP methodology, which is the intellectual property of Adelphi Real World, has been previously described [ 15 16 17 18 PRFs are completed online, and physicians are given a unique ID to enter the survey where they are only allowed to complete up to the designated number of PRFs to prevent multiple participation. 2.1. Participants Physicians were identified by local fieldwork agents using physician panels and publicly available lists and subsequently invited to participate if they met the following criteria: actively involved in the management of patients with MCL, were seeing a minimum of four patients with MCL per month and agreed to adhere to all survey requirements. Physicians completed PRFs for up to three of their next consecutively consulting patients with MCL who met the eligibility criteria. Three PRFs were collected per physician where possible, according to incidence of eligible patients seen in the clinic and the physician’s willingness to complete the full quota. The PRFs reported patient demographics, clinical characteristics, and test and treatment patterns. During data collection, physicians completed PRFs to the following quota: one patient receiving first-line (1 L) treatment and two patients with relapsed/refractory disease, one of whom must have received and discontinued a BTKi during their treatment history. Physicians also reported their own demographic characteristics, as well as giving details on their prescribing behaviors and perceptions of and attitudes to MCL treatments. Patients were eligible for inclusion if they were aged ≥18 years at data collection, had a physician-confirmed diagnosis of MCL, were receiving systemic therapy, had not received stem cell transplantation for a reason other than MCL, and were not participating in a clinical trial at the time of data collection. Although data collection was conducted in 2022, the retrospective patient record review covered patient history prior to this, including MCL diagnosis. A total of 25 physicians screened into the survey, with the final sample including 24 physicians and 67 patients with MCL. From these sample sizes, confidence interval (CI) half-widths are expected to range from 12.47% to 20.88% for categorical variables and 0.24–0.42 for continuous variables. For categorical variables, a proportion of 50% has been used as it produces the widest CIs and for continuous variables, a standardized version has been chosen, whereby the standard deviation (SD) is 1. Due to the sampling methodology used, this sample cannot claim to be representative of the wider population of patients in Japan with MCL. However, this study provides insight into a real-world sample of patients with MCL in Japan, addressing areas scarcely studied such as physician perspectives on treatment. 2.2. Clinical characteristics assessment tools The Eastern Cooperative Oncology Group (ECOG) scale [ 19 20 The simplified Mantle Cell International Prognostic Index (sMIPI) [ 21 22 Patient stage was given using either the Ann Arbor staging system (which classifies patients into four stages, with stages I and II being considered as limited disease, and stages III and IV as advanced [ 23 24 2.3. Ethics Data collection was undertaken in line with the European Pharmaceutical Marketing Research Association (EphMRA) guidelines (EphMRA Code of Conduct 2019), and therefore ethics committee approval was not required. However, the questionnaires used in the Adelphi MCL DSP were reviewed, and given exemption by Pearl IRB (study protocol number AG9175). Data collection was performed in accordance with the principles stated in the Declaration of Helsinki. Physicians provided written informed consent for use of their anonymized and aggregated data. 2.4. Statistical analysis All data were de-identified and anonymized prior to data analysis. Analyses were descriptive (reported using UNICOM Intelligence Reporter v7.5 software), and results are presented as frequency, percentage, mean and standard deviation, or median and interquartile range (IQR). Analysis of data in Table 1 Table 2 Table 3 Table 3 Tables 4 and 5 Table 1. Patient demographics and characteristics (PRFs).  At diagnosis or initial presentation At time of data collection All patients 1 L Patients R/R Patients Age (in years)  n = 67 n = 22 n = 45 Mean (SD) 69.4 (10.0) 66.7 (11.63) 70.6 (8.88) Median (IQR) 72.0 (65.0, 75.0) 69.0 (57.5, 76.3) 73.0 (66.0, 75.0) Sex, n (%) n = 67 n = 22 n = 45 Male 50 (74.6) 17 (77.3) 33 (73.3) Female 17 (25.4) 5 (22.7) 12 (26.7) Time since diagnosis, months n = 65 n = 22 n = 43 Mean (SD) 28.2 (26.5) 13.0 (19.52) 35.9 (26.47) Median (IQR) 18.0 (6.5,45.5) 5.0 (2.8,14.3) 27.0 (16.0, 51.0) Type of MCL, n (%) n = 67 n = 22 n = 45 Classical 51 (76.1) 16 (72.7) 35 (77.8) Blastoid/pleomorphic 2 (3.0) 2 (9.1) 0 (0.0) Indolent 3 (4.5) 0 (0.0) 3 (6.7) Don’t know 11 (16.4) 4 (18.2) 7 (15.6) ECOG score, n (%) n = 67 n = 67 n = 22 n = 45 0 29 (43.3) 40 (59.7) 14 (63.6) 26 (57.8) 1 25 (37.3) 23 (34.3) 8 (36.4) 15 (33.3) 2 11 (16.4) 3 (4.5) 0 (0.0) 3 (6.7) 3 2 (3.0) 1 (1.5) 0 (0.0) 1 (2.2) 4 0 (0.0) 0 (0.0) 0 (0.0) 0 (0.0) sMIPI score, n (%)  n = 65 n = 22 n = 43 Low risk 27 (41.5) 11 (50) 16 (37.2) Intermediate risk 34 (52.3) 11 (50) 23 (53.5) High risk 4 (6.2) 0 (0.0) 4 (9.3) LDH test result, n (%) n = 67 n = 67 n = 22 n = 45 Normal 19 (28.4) 57 (85.1) 17 (77.3) 40 (88.9) ≥Upper limit of normal 48 (71.6) 10 (14.9) 5 (22.7) 5 (11.1) Ann Arbor staging classification (determined by Lugano staging classification), n (%) n = 67  Stage I 7 (10.4) Stage II 14 (20.9) Stage III 20 (29.9) Stage IV 26 (38.8) Unknown (not assessed) 0 (0.0) Number of nodal sites involved n = 59 n = 55 n = 19 n = 36 Mean (SD) 4.2 (2.5) 1.6 (2.2) 2.1 (2.9) 1.3 (1.79) Median (IQR) 4.0 (2.0, 6.0) 0.0 (0.0, 3.0) 1.0 (0.0, 4.0) 0 (0.0, 2.8) Number of extranodal sites involved n = 22 n = 6 n = 1 n = 5 Mean (SD) 1.5 (1.6) 1.8 (3.1) 8.0 (0) 0.6 (0.55) Median (IQR) 1.0 (1.0, 2.0) 1.0 (0.0, 2.8) 8.0 (8.0, 8.0) 1.0 (0, 1.0) Patient has caregiver, n (%)  n = 67 n = 22 n = 45 Yes 24 (35.8) 9 (40.9) 15 (33.3) No 34 (50.7) 10 (45.5) 24 (53.3) Don’t know 9 (13.4) 3 (13.6) 6 (13.3) Caregiver relationship to patient, n (%) n = 24 n = 9 n = 15 Partner/spouse 21 (87.5) 8 (88.9) 13 (86.7) Son/daughter ≥18 years 7 (29.2) 1 (11.1) 6 (40.0) Other relative(s) 1 (4.2) 1 (11.1) 0 (0) Professional caregiver(s) 1 (4.2) 0 (0.0) 1 (6.7) Abbreviations: 1 L: first-line; ECOG: Eastern Cooperative Oncology Group; IQR: interquartile range; LDH: lactate dehydrogenase; MCL: Mantle Cell Lymphoma; PRF: patient record form; R/R: Relapse/refractory; SD: standard deviation; sMPI: simplified Mantle Cell Lymphoma International Prognostic Index. Table 2. HCRU – most recent hospitalization in the 6 months prior to data collection (PRFs). Number of inpatient hospitalizations including surgery patient had in the previous 6 months in relation to their MCL, n (%) n = 67 0 37 (55.2) 1 23 (34.3) 2 5 (7.5) 3 1 (1.5) 4 1 (1.5) Mean (SD) 0.6 (0.8) Reason for the patient’s most recent inpatient hospitalization, n (%) n = 30 To manage a side effect of treatment 19 (63.3) Other reasons 6 (20.0) To treat a disease complication 5 (16.7) For surgery 0 (0.0) To receive a SCT 0 (0.0) Patient admitted through ER for their most recent inpatient hospitalization, n (%) n = 30 Yes 3 (10.0) No 27 (90.0) Most recent hospitalization type of admission, n (%) n = 30 Day 1 (3.3) Night 28 (93.3) Don’t know 1 (3.3) Number of nights spent in hospital during most recent hospitalization n = 28 Mean (SD) 10.2 (5.5) Median (IQR) 10.0 (5.5,14.0) Abbreviations: ER: emergency room; IQR: interquartile range; PRF: patient record form; SCT: stem cell transplantation; SD: standard deviation. Table 3. Treatment duration and TTNT. Treatment duration and TTNT – overall and by 1 L treatment subgroup (PRFs)  Overall BTKi All chemotherapy Number of months between initiation of drug treatment (1 L) and data collection n = 65 n = 14 n = 47 Mean (SD) 24.6 (25.0) 34.0 (21.4) 23.3 (26.1) Median (IQR) 16.0 (5.5, 37.5) 22.5 (17.5, 58.3) 13.0 (4.0, 37.0) Number of months between initial diagnosis of MCL and the initiation of drug treatment (1 L) n = 65 n = 14 n = 47 Mean (SD) 3.6 (11.1) 2.8 (4.6) 4.1 (12.8) Median (IQR) 1.0 (0.0, 1.0) 1.0 (0.0, 1.0) 1.0 (0.0, 1.0) Duration of primary therapy (1 L [months]) n = 42 n = 14 n = 26 Mean (SD) 4.5 (3.4) 5.3 (5.5) 4.2 (1.4) Median (IQR) 4.5 (3.0, 6.0) 5.5 (1.0, 8.0) 4.5 (3.0, 5.0) TTNT (number of months between the start of 1 L to start of 2 L) n = 43 n = 14 n = 27 Mean (SD) 20.8 (18.1) 25.1 (21.8) 19.9 (16.1) Median (IQR) 13.0 (7.0, 34.0) 14.0 (8.8, 43.8) 13.0 (7.0, 29.0) Treatment duration and TTNT – overall and by 2 L treatment subgroup (PRFs)  Overall BTKi All chemotherapy Duration of primary therapy (2 L [months]) n = 11 n = 10 n = 1 Mean (SD) 4.5 (4.7) 4.8 (4.8) 1.0 (0.0) Median (IQR) 3.0 (2.0, 3.0) 3.0 (2.0, 3.0) 1.0 (1.0, 1.0) TTNT (number of months between the start of 2 L to start of 3 L) n = 12 n = 10 n = 1 Mean (SD) 13.9 (18.1) 15.4 (19.6) 4.0 (0.0) Median (IQR) 8.5 (4.0, 16.3) 9.0 (3.8, 20.0) 4.0 (4.0, 4.0) Abbreviations: 1 L: first-line; 2 L: second-line; 3 L: third-line; IQR: interquartile range; PRF: patient record form; SD: standard deviation; TTNT: time to next treatment (defined as duration between the start of 1 L to start of 2 L, regardless of whether patient had induction only in 1 L or duration between the start of 2 L to start of 3 L, regardless of whether patient had induction only in 2 L). Four patients were not receiving a BTKi or chemotherapy treatment at 1 L. Two patients were not receiving a BTKi or chemotherapy treatment at 2 L. Table 4. Side effects at the time of data collection – overall and by subgroup (PRFs).  Overall BTKi All chemotherapy Side effects experienced, n (%) n = 67 n = 17 n = 42 Yes 31 (46.3) 3 (17.6) 25 (59.5) No 36 (53.7) 14 (82.4) 17 (40.5) Most frequent side effects experienced from MCL treatment*, n (%) n = 67 n = 17 n = 42 No side effects experienced 36 (53.7) 14 (82.4) 17 (40.5) Anemia 9 (13.4) 1 (5.9) 7 (16.7) Fatigue 7 (10.4) 1 (5.9) 6 (14.3) Constipation 7 (10.4) 0 (0) 5 (11.9) Nausea 4 (6.0) 0 (0) 3 (7.1) Hair loss 3 (4.5) 0 (0) 3 (7.1) Weight loss 3 (4.5) 0 (0) 3 (7.1) Neutropenia 3 (4.5) 0 (0) 3 (7.1) Other side effect 3 (4.5) 1 (5.9) 1 (2.4) Febrile neutropenia 2 (3.0) 0 (0) 2 (4.7) Diarrhea 2 (3.0) 0 (0) 2 (4.7) Loss of appetite 2 (3.0) 0 (0) 2 (4.7) Arthralgia 2 (3.0) 1 (5.9) 1 (2.4) Aches and pains 2 (3.0) 1 (5.9) 1 (2.4) *With ties, data given for the 10 most commonly reported adverse events in the base. Abbreviations: BTKi: Bruton’s tyrosine kinase inhibitors; MCL: Mantle cell lymphoma; PRF: patient record form. 1 2 Eight patients were not receiving a BTKi or chemotherapy treatment at the time of data collection. Table 5. Physician-reported treatment goals at the time of data collection (PRFs).  Overall BTKi All chemotherapy Physician-reported treatment goals at the time of data collection (reported for ≥ 20% of patients), n (%) n = 67 n = 17 n = 42 Shrink tumor(s)/lymph node(s) 32 (47.8) 8 (47.1) 21 (50.0) Overall survival 26 (38.8) 8 (47.1) 17 (40.5) Minimize impact on patient’s day-to-day life 19 (28.4) 9 (52.9) 7 (16.7) Relapse free survival 18 (26.9) 3 (17.6) 13 (31.0) Control the condition 14 (20.9) 5 (29.4) 7 (16.7) Improve patient QoL 12 (17.9) 2 (11.8) 9 (21.4) Abbreviations: BTKi: Bruton’s tyrosine kinase inhibitors; QoL: quality of life; PRF: patient record form. 1 2 Eight patients were not receiving a BTKi or chemotherapy treatment at the time of data collection. Physicians were able to choose patient treatment from a list of pre-specified options (with an option to enter alternative regimens as free-text). These answers were then used to generate treatment subgroupings for this analysis as follows. BTKi included acalabrutinib and ibrutinib and “all chemotherapy” included cytarabine (Ara-C), bendamustine + rituximab, bortezomib, high-dose cytarabine (HD-Ara-C), cyclophosphamide + vincristine sulfate + doxorubicin hydrochloride + dexamethasone (Hyper-CVAD), rituximab + cyclophosphamide + doxorubicin + vincristine + prednisone (R-CHOP), rituximab + cyclophosphamide + vincristine + doxorubicin + dexamethasone alternating with methotrexate and cytarabine combination (R-hyper-CVAD) and bortezomib + rituximab + cyclophosphamide + doxorubicin + prednisone (VR-CAP). Analysis for MCL treatment patterns to data collection and treatment response by line of treatment was conducted overall for the aggregated Japan sample and by line of therapy, limited to three lines of therapy due to low base sizes beyond third-line (patients that were receiving at data collection or had ever received 1 L[n = 67], 2 L[n = 45], or 3 L therapy [n = 13]). Analysis for physician-perceived main areas for improvement in MCL treatment for patients was conducted for the aggregated Japan sample (n = 67). Only patients who had already completed and had known start and end dates of a therapy line were included in the relevant analysis (data in Table 3 Missing data were not imputed; therefore, the base of patients for analysis could vary from variable to variable and is reported separately for each analysis. As such, for each variable reported, the base size is specified in text. 3. Results 3.1. Physician characteristics A total of 24 physicians (21 [87.5%] hematologists and 3 [12.5%] hem-oncologists) in Japan completed electronic PRFs for 67 patients with MCL. Most physicians had qualified as a hematologist/hem-oncologist between 1998 and 2018 (18/24 [75.0%]) and had never been involved in a clinical trial (15/24 [62.5%]). Twenty-two physicians gave details on their practice setting, with the majority spending most of their practice time in a local center (13/22 [59.1%]) or in a university (6/22 [27.3%]). The remaining physicians spent most of their practice time in a specialist center (2/22 [9.1%]) or gave an answer of “Other” (1/22 [4.5%]). 3.2. Patient demographics and characteristics Patients’ demographics and clinical characteristics (for the aggregated Japan sample [n = 67]) at diagnosis or initial presentation (where available) and at the time of data collection (defined as the point in time at which the physician consulted the patient and completed the PRF) are summarized in Table 1 Most patients were male (50 [74.6%]) and diagnosed with classical MCL (51 [76.1%]). Mean (SD) age was 69.4 (10.0) years and median (interquartile range (IQR)) time since MCL diagnosis was 18.0 (6.5, 45.5) months [n = 65]. Of the 24 patients who had a caregiver (35.8%), 21 patients (87.5%) had their spouse or partner as their main caregiver. Similar findings were generally observed in the 1 L and relapse/refractory subgroups at the time of data collection, although 1 L patients were numerically younger (mean [SD] 66.7 [11.6] years), had a numerically shorter median (IQR) time since MCL diagnosis (5.0 [2.8, 14.3] months), and numerically fewer were diagnosed with classical MCL (12/22 [72.7%]). Conversely, relapse/refractory patients had a numerically longer median (IQR) time since MCL diagnosis (27.0 [16.0, 51.0] months) ( Table 1 Most patients (48/67 [71.6%]) presented with painless swelling in the neck, armpit, stomach, or groin at diagnosis, with only one patient (1.5%) presenting as asymptomatic (Supplemental Table S1). ECOG score and lactate dehydrogenase (LDH) test results collected at diagnosis showed that the majority of patients had an ECOG score of 0 (29/67 [43.3%]) and an LDH test result greater than the upper limit of normal (> ULN) (48/67 [71.6%]). Physicians also reported that a median (IQR) 4.0 (2.0, 6.0) nodal sites were involved at the time of diagnosis (n = 59). In terms of type and location of nodal sites of MCL, involvement of cervical nodes was reported in most patients (48/57 [84.2%]), while axillary and inguinal nodes were reported in 27/57 (47.4%) patients each. At the time of diagnosis, a median (IQR) 1.0 (1.0, 2.0) extranodal sites were also involved (n = 22), mainly in the bone marrow (15/18 [83.3%]), gastrointestinal tract (4/18 [22.2%]), and stomach and liver (3/18 [16.7%], in both cases) ( Table 1 3.3. Tests and assessments Supplemental Table S2 presents the tests and assessments that >50% of patients had undergone as part of their diagnosis or initial work-up. Other than common, nonspecific tests such as blood chemistry, complete blood count, and physical examination, the most common tests used at diagnosis were LDH (59/67 [88.1%]), uric acid (54 [80.6%]), and beta-2-microglobulin (B2M) (37 [55.2%]) levels. Hepatitis B and C testing were undertaken in 44 (65.7%) and 43 (64.2%) patients, respectively, and human immunodeficiency virus (HIV) serology in 37 (55.2%) patients. The use of imaging was also common: computed tomography (CT) (46 [68.7%]), positron emission tomography (PET)-CT (37 [55.2%]). Supplemental Table S2 also presents the proportions of patients who underwent biomarker testing, including phenotype and prognosis markers typical for MCL, with the most common (of those also highlighted in the National Comprehensive Cancer Network (NCCN) Guidelines) [ 25 3.4. Patient clinical characteristics at data collection At data collection, 24/67 [35.8%] patients were described as asymptomatic (this was 10/22 [45.5%] in the 1 L subgroup and 14/45 [31.1%] in the refractory/relapse subgroup) (Supplemental Table S1). Over half of patients (40 [59.7%]) had an ECOG score of 0 (this was 14 [63.6%] and 26 [57.8%] in the 1 L and refractory/relapse subgroups, respectively), and 57 (85.1%) had a normal LDH test result (this was 17 [77.3%] and 40 [88.9%] in the 1 L and refractory/relapse subgroups, respectively) ( Table 1 3.5. Drug treatment patterns and effectiveness The median (IQR) time from initial diagnosis to start of drug treatment (1 L) was 30 (7, 62.5) days, and a median (IQR) of 16.0 (5.5, 37.5) months had passed from initiation of 1 L to data collection (n = 65 [ Table 3 Figure 1 Figure 1. MCL treatment patterns to data collection (1 L to 4 L+). 1 L: First-line treatment, 2 L: Second-line treatment, 3 L: Third-line treatment, 4 L+: Fourth-line or later treatment. Due to the nature of the Adelphi Disease Specific Programme, all patients are required to be receiving treatment at the time of data collection; hence for patients not shown to have progressed to a subsequent line of therapy, this is due to them receiving that line of therapy at the time of data collection. For data collection, physicians completed patient record forms in a 1:2 ratio: one patient receiving first-line (1 L) treatment and two patients with relapsed/refractory disease, one of whom must have received and discontinued a Bruton's tyrosine kinase inhibitor (BTKi). This chart includes patient’s current (at data collection) and previous lines of therapy, therefore for patients on third-line treatment at data collection, they are counted in the first-, second-, and third-line sample sizes. Best treatment response during 1 L, 2 L, and 3 L therapy in this study is shown in Figure 2 Figure 2. Treatment response by line of treatment (1 L to 3 L). 1 L: First-line treatment, 2 L: Second-line treatment, 3 L: Third-line treatment, ORR: Overall response rate (complete response rate combined with partial response rate). Table 3 Therapy lines after 3 L have not been included due to small base sizes. 3.6. Drug treatment side effects Drug treatment side effects were analyzed overall and by subgroup (BTKi and all chemotherapy). At the time of data collection, just under half of patients overall (31/67 [46.3%]) in this study cohort were experiencing side effects, with anemia (9/67 [13.4%]), fatigue, and constipation (7 [10.4%], in both cases) being the most common from a pre-defined list. In the BTKi subgroup, 17.6% of patients (3/17) had side effects; this figure was 59.5% in the chemotherapy subgroup (25/42) ( Table 4 Table 4 3.7. Healthcare resource utilization A total of 30 out of 67 (44.8%) Japanese patients in this study experienced at least 1 hospitalization (including hospitalizations for surgery) in relation to their MCL in the 6 months prior to data collection. Table 2 3.8. Treatment goals at the time of data collection Physician-perceived treatment goals for the patient at the time of data collection are shown in Table 5 3.9. Most important drug treatment benefits and areas for improvement in MCL drug treatment When asked about the most important benefit that a drug treatment could provide for their patients (other than a cure for their MCL), “improve quality of life” (QoL) and “no/nothing/none” were the most common physician-reported responses (selected for 13/67 patients [19.4%], in both cases), followed by “reduce hospitalization/home treatment/no need to visit the clinic” (selected for 9 patients [13.4%]). Physicians chose “achieves complete response” as the most important area for improvement in MCL drug treatment in general for the patient (selected for 30/67 patients [44.8%]), jointly followed by “good clinical data regarding overall survival” and “has the best evidence-based efficacy overall” (selected for 29 patients [43.3%], in both cases) ( Figure 3 Figure 3. Physician-perceived main areas for improvement in MCL treatment for patients (n = 67). OS: Overall survival. All responses with values ≥10% are shown. 4. Discussion The main objectives of the present real-world study were to describe demographics, clinical characteristics, and treatment patterns in Japanese patients with MCL on systemic therapy in this study cohort. Chemotherapy (R-CHOP or BR) and the BTKi ibrutinib were the most common regimens in 1 L and 2 L, respectively, although the inclusion criteria of this study are likely to have influenced treatment rates, as physicians were asked to complete PRFs in a 1:2 ratio: one patient receiving 1 L treatment and two patients with relapsed/refractory disease, one of whom must have received and discontinued a BTKi. BR was widely used throughout all lines of therapy, as previously also reported by Izutsu et al. [ 14 26 26 27 3 28 Largely similar 1 L and 2 L treatment patterns to those reported here have been observed in other countries utilizing data sets with data collection dates prior to 2022, despite the geographical differences in treatment guidelines, cohorts, and national reimbursement policies. For example, analysis of Medicare claims (2009–2019) revealed that the most common 1 L regimen in the US was BR (50%), with increased use of BTKi-based regimens (mainly ibrutinib) observed in 2 L (39%) [ 6 29 8 The most common symptom at initial presentation was painless swelling (72% of cases), indicating that patients tended to visit their physician as soon as they had noticed any swelling, even in the absence of other symptoms. Despite being older, patients in Japan may have less aggressive disease at diagnosis based on indicators such as LDH level and Ann Arbor staging classification (when descriptively compared with the Adelphi MCL DSP Europe population [unpublished data from study conducted in France, Germany, Italy, Spain, and the United Kingdom, using the same methodology as the present study]). This may be due to the universal insurance coverage and better access to healthcare, including health checkups, which have been implemented in Japan [ 30 In this study cohort, imaging tests were commonly conducted for diagnosis or initial work-up for MCL. Tests such as CD20 and Cyclin D1, which are recommended for the diagnosis of MCL in the NCCN Guidelines [ 25 The management of patients with relapsed/refractory MCL remains a challenge in clinical practice, as treatment response declines with each successive line of treatment [ 12 31 8 1 Nearly half of patients in Japan in our study were experiencing side effects of the therapies that they were receiving at the time of data collection. The most reported side effect with chemotherapy was anemia; side effects were uncommon with BTKi, with anemia, fatigue, aches and pains, and arthralgia being reported in only 6% of cases each. Although BTKi (especially first-generation compounds, such as ibrutinib) have been reported to cause cardiovascular adverse events (AEs) [ 32 33 Despite side-effect data indicating that these are common and were the leading cause of hospitalizations, it is interesting that “low incidence of serious events/severe side effects” and “manageable short-term toxicity” still ranked lower than efficacy in the most frequently identified areas of improvement for MCL drug treatments in the present study. This finding may reflect that efficacy is simply deemed more important by physicians, and that although side effects are common, physicians believe that they can be managed adequately, or that physicians believe that BTKis are already addressing side-effect concerns. However, the caveat that subgroup sample sizes were small, and significance testing was not performed, should be noted. Yang et al. conducted a systematic literature review of publications between 2010 and 2019, revealing that AEs in patients with MCL were associated with increased economic burden, with patients experiencing 3 − 4 AEs during 1 L therapy being almost 7-times more likely to require an inpatient admission than those experiencing only 1 − 2 AEs. Additionally, patients with ≥6 AEs had inpatient stays lasting 2.2 days longer than those with no AEs [ 34 14 29 In our study, for patients who were receiving BTKi therapy at the time of data collection, the most common goal of therapy was to “minimize impact on patient’s day-to-day life,” which was selected by physicians in over half of cases, closely followed by efficacy, specifically tumor response, and equally by the goal of improving “overall survival.” On the other hand, the most common goals for patients that were receiving chemotherapy at data collection were based around efficacy, specifically “shrink tumor/lymph node” and “overall survival,” rather than patient quality of life. Sineshaw et al. recently highlighted that, despite the recent approvals of novel therapies, outcomes remained poor for US patients with MCL who received 2 L+, with median OS from 1 L, 2 L, and 3 L initiation being 7, 4, and 2 years, respectively [ 35 The main goal of therapy for patients who were receiving chemotherapy in this study was tumor response. In addition to these treatment goals, when asked about the most important benefits of MCL treatment other than a cure in general, physicians selected improvements in patients’ QoL (19%), and reduced hospitalizations and convenience for the patients (13%). On the other hand, with regards to the aspects that needed improvement in current therapies in general, efficacy was the most prioritized need (chosen in over 40% of cases). This potential gap between the treatment goal, expected benefits and the needed improvement in current therapies may suggest that, while aspects like QoL and impact on patients’ daily life are important, these goals are currently being fairly well met by BTKi. Although the current study collected only physicians’ opinions on these aspects, caution is needed that there can be some discordance between physicians’ and patients’ opinions on priority of various treatment attributes, as reported in a small study investigating treatment preferences in relapsed/refractory MCL in Sweden and Germany [ 36 37 38 The present study has several important limitations: the patient data reported here may not reflect the general MCL population in Japan, due to the small sample size which lacked statistical power, and the inclusion criteria (physicians were asked to complete PRFs in a 1:2 ratio: one patient receiving 1 L treatment and two patients with relapsed/refractory disease, one of whom must have received and discontinued a BTKi) which resulted in a non-representative sample, two important factors which prevent us from generalizing the findings of this analysis. Also, participating patients had to have visited their physician to be included and patients who visit their physician more frequently may be more severely affected than those who do not consult their physician as frequently. Furthermore, due to the nature of the DSP methodology, patients would have had to be alive at data collection to consult with their physician for inclusion in the study, and hence we are not able to estimate survival outcomes, and no censorship was performed when calculating TTNT. Physicians were asked to provide data for a consecutive series of patients to avoid selection bias, but no formal patient selection verification procedures were in place. Recall bias might also have affected physicians’ responses to the questionnaires, which is a common limitation of most surveys. In addition, responses may have been subject to a “recency effect” but the data for these analyses were collected at the time of each patient’s appointment and this is expected to have reduced the likelihood of recall bias. Lastly, it should be noted that some of the observed drug use patterns, for example ibrutinib monotherapy as 1 L, are not consistent with the approved labels of these agents in Japan and whilst their off-label use is apparent in real-world clinical practice in this study cohort, this observation does not mean that these treatments are recommended. 5. Conclusion The present real-world investigation found that patients with MCL in this study cohort from Japan were diagnosed early, and their disease was generally well-managed by their physicians, but that improvements in efficacy, safety, QoL, and convenience in administration were still needed for future drug therapies. Supplementary Material Supplemental Material Acknowledgments We confirm that this work is original, and it is not currently under consideration for publication elsewhere. Some data featured in this manuscript was previously used in an abstract and poster published at the Japanese Society of Medical Oncology Annual Meeting in 2024, titled “Patient characteristics and treatment patterns in patients with Mantle Cell Lymphoma in Japan: a real-world study”. Article highlights  Currently, there is a paucity of real-world data on patients with mantle cell lymphoma (MCL) in Japan, particularly focusing on their clinical characteristics and work-up, as well as data surrounding physicians that treat MCL, including their attitudes toward treatment. This study involved data from a cross-sectional survey (the Adelphi MCL Disease Specific Programme (DSP)), which was conducted among hematologists and hem-oncologists and their consulting patients with MCL in Japan between March and December 2022. Twenty-four Japanese physicians provided data on 67 patients with MCL, including patient demographics and clinical characteristics; tests and assessments; drug treatment patterns and response to treatment; and healthcare resource utilization. Physicians also provided attitudinal data, including benefits that drug treatments could offer and areas for improvement in MCL drug treatment. Overall, patients in this study cohort were mostly male (74.6%), had a diagnosis of classical MCL (76.1%), and did not have a caregiver. The most common test undergone at MCL diagnosis was LDH. In terms of treatment patterns, bendamustine + rituximab (BR) or rituximab + cyclophosphamide + doxorubicin + vincristine + prednisone (R-CHOP) chemotherapy were the most common at first line (1 L) as received by 56.8% of patients, and ibrutinib was the most common at second line (2 L) as received by 53.3% of patients. There was no obvious standard therapy at third line (3 L) for this study cohort. Response to treatment was most commonly described as a complete response (47.8%) at 1 L and as a partial response (53.3%) at 2 L. Although highlighting that patients with MCL in this study were relatively well-managed with reasonable response to treatment, these results have indicated areas of need in the treatment of MCL in Japan, particularly in improving the efficacy and safety of novel drug treatments and reducing the impact of treatment on the patient. Author contributions Design of the work: HB, NM, AS, GS, AK Conception of the work: MJ, BG, KT, HB, NM, AS Acquisition of data for the work: HB, NM, AS Interpretation of data for the work: SR, YT, TT, MT, RI, HB, NM, AS, MJ, BG, AK Critical review of manuscript: SR, YT, TT, MT, RI, HB, NM, AS, KT, MJ, GS, BG, AK Disclosure statement Helen Burlison, Neil Milloy, and Amber Simpson are full-time employees of Adelphi Real World. Yoshinori Tanizawa, Tomoko Terasaw, Masaomi Tajimi, Ryuichi Ideue, Kaisa-Leena Taipale, Min-Hua Jen, Grace Segall, and Benjamin Goebel are employees and minor stock holders of Eli Lilly and Company. Amit Kiran was employed by Eli Lilly and Company at the time of the study. He is now an employee and a minor stock holder of GSK. Shinya Rai has no relevant affiliations or financial involvement with any organization or entity with a financial interest in or financial conflict with the subject matter or materials discussed in the manuscript. This includes employment, consultancies, honoraria, stock ownership or options, expert testimony, grants or patents received or pending, or royalties. Medical writing support was provided on behalf of Adelphi Real World (Bollington, United Kingdom) by Delia Randall, PhD, under the guidance of authors and in accordance with Good Publication Practice 2022 (GPP 2022) guidelines ( https://www.ismpp.org/gpp-2022 Reviewer disclosures Peer reviewers on this manuscript have no relevant financial or other relationships to disclose. Ethical disclosure statement Data collection was undertaken in line with the European Pharmaceutical Marketing Research Association guidelines (EphMRA Code of Conduct 2019), and therefore, ethics committee approval was not required. However, the questionnaires used in the Adelphi MCL DSP were reviewed and given exemption by Pearl IRB (study protocol number AG9175). Data collection was performed in accordance with the principles stated in the Declaration of Helsinki. Physicians provided written informed consent for use of their anonymized and aggregated data. Data availability statement All data, i.e., methodology, materials, data and data analysis, that support the findings of this survey are the intellectual property of Adelphi Real World. All requests for access should be addressed directly to Helen Burlison at helen.burlison@omc.com Supplementary Information Supplemental data for this article can be accessed online at https://doi.org/10.1080/14796694.2025.2555165 References  Papers of special note have been highlighted as either of interest (•) or of considerable interest (••) to readers. 1. Bock AM Gile JJ Larson MC Evolving treatment patterns and improved outcomes in relapsed/refractory mantle cell lymphoma: a prospective cohort study Blood Cancer J 2023 13 1 169 10.1038/s41408-023-00942-3 37957158 PMC10643454 2. Yoon DH Cao J Chen TY Treatment of mantle cell lymphoma in Asia: a consensus paper from the Asian Lymphoma Study Group J Hematol Oncol 2020 13 1 21 10.1186/s13045-020-00855-9 32183871 PMC7079508 3. Rai S Tanizawa Y Cai Z Outcomes for recurrent mantle cell lymphoma post-ibrutinib therapy: a retrospective cohort study from a Japanese administrative database Adv Ther 2022 39 10 4792 4807 10.1007/s12325-022-02258-3 35984628 PMC9464745  • A medical claims database study of patients with MCL in Japan between 2010 and 2020 looking specifically at treatment patterns and outcomes of patients that have received ibrutinib therapy. 4. Ye H Desai A Huang S Paramount therapy for young and fit patients with mantle cell lymphoma: strategies for front-line therapy J Exp Clin Cancer Res 2018 37 1 1 12 10.1186/s13046-018-0800-9 30005678 PMC6044039 5. Al-Mansour M. Treatment landscape of relapsed/refractory mantle cell lymphoma: an updated review Clin Lymphoma Myeloma Leuk 2022 22 11 e1019 e1031 10.1016/j.clml.2022.07.017 36068158 6. Squires P Puckett JT Ryland KE Real-world treatment patterns, overall survival, healthcare resource utilization, and costs among U.S. elderly patients with mantle cell lymphoma (MCL) after failure of covalent BTKi treatment Blood 2023 142 Supplement 1 2326 10.1182/blood-2023-181024 7. Phillips T Miller TA Wang J Real-world comparative effectiveness of covalent Bruton tyrosine kinase inhibitors among patients with relapsed/refractory mantle cell lymphoma EHA Library 2024 P1139 8. Minson A Hamad N Di Ciaccio P Death from mantle cell lymphoma limits sequential therapy, particularly after first relapse: patterns of care and outcomes in a series from Australia and the United Kingdom Br J Haematol 2024 204 2 548 554 10.1111/bjh.19179 37904342 9. Narkhede M Goyal G Shea L Evaluating real-world treatment patterns and outcomes of mantle cell lymphoma Blood Adv 2022 6 14 4122 4131 10.1182/bloodadvances.2022007247 35561314 PMC9327535 10. Eyre TA Cheah CY Wang ML Therapeutic options for relapsed/refractory mantle cell lymphoma Blood 2022 139 5 666 677 10.1182/blood.2021013326 34679161 PMC9710495 11. Burkart M Karmali R Relapsed/refractory mantle cell lymphoma: beyond BTK inhibitors J Pers Med 2022 12 3 376 10.3390/jpm12030376 35330376 PMC8954159 12. Hess LM Chen Y Abada PB Outcomes among patients with mantle cell lymphoma post-covalent BTK inhibitor therapy in the United States: a real-world electronic medical records study Adv Hematol 2022 2022 1 8 10.1155/2022/8262787 PMC9812614 36620778 13. Kumar SA Gao J Patel SA The shifting therapeutic paradigm for relapsed/refractory mantle cell lymphoma Leuk Res 2023 134 107385 10.1016/j.leukres.2023.107385 37672954 PMC10888497 14. Izutsu K Suzumiya J Takizawa J Real world treatment practices for mantle cell lymphoma in Japan: an observational database research study (CLIMBER-DBR) J Clin Exp hematop 2021 61 3 135 144 10.3960/jslrt.20056 34092722 PMC8519241  •• An observational database study in Japan providing insights into clinical characteristics, treatment patterns and healthcare resource utilization of patients with MCL. 15. Anderson P Benford M Harris N Real-world physician and patient behaviour across countries: disease-specific programmes - a means to understand Curr Med Res opin 2008 24 11 3063 3072 10.1185/03007990802457040 18826746 16. Anderson P Higgins V Courcy J Real-world evidence generation from patients, their caregivers and physicians supporting clinical, regulatory and guideline decisions: an update on disease specific programmes Curr Med Res opin 2023 39 12 1707 1715 10.1080/03007995.2023.2279679 37933204  • Reference assessing the value of Adelphi DSPs, as used as the methodology in this study, as multi-perspective real-world data sources on patient journey, treatment patterns and the burden of illness. 17. Babineaux SM Curtis B Holbrook T Evidence for validity of a national physician and patient-reported, cross-sectional survey in China and UK: the disease specific programme BMJ Open 2016 6 8 e010352 10.1136/bmjopen-2015-010352 PMC5013497 27531722 18. Higgins V Piercy J Roughley A Trends in medication use in patients with type 2 diabetes mellitus: a long-term view of real-world treatment between 2000 and 2015 Dia Metabolic Syndr Obes Targets Ther 2016 9 371 380 10.2147/DMSO.S120101 PMC5098530 27843332 19. Oken MM Creech RH Tormey DC Toxicity and response criteria of the Eastern Cooperative Oncology Group Am J Clin Oncol 1982 5 6 649 656 10.1097/00000421-198212000-00014 7165009 20. Datta SS Ghosal N Daruvala R How do clinicians rate patient’s performance status using the ECOG performance scale? A mixed-methods exploration of variability in decision-making in oncology Ecancermedicalscience 2019 13 10.3332/ecancer.2019.913 PMC6467460 31123496 21. Hoster E Dreyling M Klapper W A new prognostic index (MIPI) for patients with advanced-stage mantle cell lymphoma J Am Soc Hematol 2008 111 2 558 565 10.1182/blood-2007-06-095331 17962512 22. Vose JM Mantle cell lymphoma: 2012 update on diagnosis, risk‐stratification, and clinical management Am J Hematol 2012 87 6 604 609 10.1002/ajh.23176 22615102 23. Rosenberg SA Boiron M DeVita VT Jr Report of the committee on Hodgkin’s disease staging procedures Cancer Res 1971 31 11 1862 1863 5121695 24. Cheson BD Staging and response assessment in lymphomas: the new Lugano classification Chin Clin Oncol 2015 4 1 5 10.3978/j.issn.2304-3865.2014.11.03 25841712 25. National Comprehensive Cancer Network I Clinical practice guidelines in oncology (NCCN guidelines®) for B-cell lymphomas. National Comprehensive Cancer Network, Inc. 2024. All rights reserved. Accessed [June 19th, 2024]. To view the most recent and complete version of the guideline, go online to NCCN.org. NCCN makes no warranties of any kind whatsoever regarding their content, use or application and disclaims any responsibility for their application or use in any way 2024 Available from: https://www.nccn.org/login?ReturnURL=https://www.nccn.org/professionals/physician_gls/pdf/b-cell.pdf 26. Jerkeman M Ekberg S Glimelius I Nationwide assessment of patient trajectories in mantle cell lymphoma: the Swedish MCLcomplete project HemaSphere 2023 7 8 e928 10.1097/HS9.0000000000000928 37529083 PMC10389756 27. Ye H Desai A Zeng D Frontline treatment for older patients with mantle cell lymphoma Oncologist 2018 23 11 1337 1348 10.1634/theoncologist.2017-0470 29895632 PMC6291324 28. Rai S Hess LM Chen Y Outcomes for patients with mantle cell lymphoma post-covalent BTK inhibitor therapy in the United States and Japan: a study of two real-world databases Blood 2021 138 Supplement 1 4523 10.1182/blood-2021-148265 29. Keating SJ Inguva S Qian J Real-world treatment patterns, healthcare resource utilization and total cost of care in mantle cell lymphoma from US commercial claims Int J Hematologic Oncol 2023 12 4 IJH45 10.2217/ijh-2023-0002 30. Katori T Japan’s healthcare delivery system: from its historical evolution to the challenges of a super-aged society Global Health Med 2024 6 1 6 12 10.35772/ghm.2023.01121 PMC10912799 38450110 31. Yang P Qq C Zhang W Real-world treatment and outcome patterns of patients with mantle cell lymphoma in China: a large, multicenter retrospective analysis Cancer Med 2023 12 12 13204 13216 10.1002/cam4.6009 37148540 PMC10315753 32. Aghel N Baro Vila RC Lui M Diagnosis and management of cardiovascular effects of Bruton’s tyrosine kinase inhibitors Curr Cardiol Rep 2023 25 9 941 958 10.1007/s11886-023-01916-4 37498449 33. Avalon JC Fuqua J Miller T Pre-existing cardiovascular disease increases risk of atrial arrhythmia and mortality in cancer patients treated with ibrutinib Cardio-Oncology 2021 7 1 1 8 10.1186/s40959-021-00125-8 PMC8603583 34798905 34. Yang KK Lucas E Lesher B A systematic review of the epidemiology and economic burden of mantle cell lymphoma (MCL) Blood 2019 134 Supplement_1 5831 10.1182/blood-2019-129677 35. Sineshaw HM Bai C De Nigris E Real-world characteristics, treatment patterns, and outcomes of patients with mantle cell lymphoma by LOT Blood 2024 144 Supplement 1 6279 10.1182/blood-2024-194230 36. Eriksson J Landfeldt E Ireland S Stated preferences for relapsed or refractory mantle cell lymphoma treatments in Sweden and Germany Future Oncol 2020 16 13 859 868 10.2217/fon-2020-0018 32292062 37. Kiguchi T Hiramatsu Y Ota S Patient perspectives on treatment for mantle cell lymphoma and chronic lymphocytic leukemia in Japan J Clin Exp Hematopathol 2024 64 2 119 128 10.3960/jslrt.24016 PMC11303965 38749721 38. Morikawa M Shirai Y Qualitative analysis of the roles of physicians and nurses in providing decision support to patients with relapsed or refractory leukemia and lymphoma Cancer Control 2022 29 10732748221131003 10.1177/10732748221131003 36268680 PMC9597203 ",
  "metadata": {
    "Title of this paper": "Qualitative analysis of the roles of physicians and nurses in providing decision support to patients with relapsed or refractory leukemia and lymphoma",
    "Journal it was published in:": "Future Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490354/"
  }
}