{
  "title": "Paper_1107",
  "abstract": "pmc J Robot Surg J Robot Surg 365 springeropen Journal of Robotic Surgery 1863-2483 1863-2491 pmc-is-collection-domain yes pmc-collection-title Springer PMC12477092 PMC12477092.1 12477092 12477092 41015968 10.1007/s11701-025-02798-0 2798 1 Research Global research landscape of robotic surgery in gynecologic oncology: a bibliometric analysis (2005–2025) Li Xinshu 1 Li Min 1 2 Cui Huijie 1 2 Du Xinyue 1 Li Bowei 1 Ha Chunfang hachunfang@163.com 2 3 1 https://ror.org/02h8a1848 grid.412194.b 0000 0004 1761 9803 Ningxia Medical University, 2 https://ror.org/02h8a1848 grid.412194.b 0000 0004 1761 9803 Department of Gynecology, General Hospital of Ningxia Medical University, 3 https://ror.org/02h8a1848 grid.412194.b 0000 0004 1761 9803 Key Laboratory of Fertility Preservation & Maintenance of Ministry of Education, Ningxia Medical University, 28 9 2025 2025 19 1 497747 641 13 8 2025 10 9 2025 28 09 2025 30 09 2025 30 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Robotic surgery has transformed gynecologic oncology by enhancing surgical precision and reducing complications, particularly for endometrial, cervical, and ovarian cancers. This study employs bibliometric analysis to systematically evaluate the scientific trajectory, research trends, and international collaboration in robotic surgery for gynecologic malignancies over nearly two decades (2005–2025). Using the Web of Science database, a total of 561 publications were identified and analyzed with Citespace, VOSviewer, and R-bibliometrix. The United States emerged as the most productive nation, with the Università Cattolica del Sacro Cuore (Italy) as the leading institution. The Journal of Gynecologic Oncology published the highest volume of research, and Giovanni Scambia was the most prolific author. Key research themes included endometrial cancer, robotic surgery, laparoscopy, lymphadenectomy, radical hysterectomy, cervical cancer, recurrence, and survival outcomes. Future progress depends on multicenter randomized-controlled trials (RCTs), global partnerships, and AI integration to advance therapeutic potential and promote equitable global access. Keywords Bibliometrics Gynecologic oncology Robotic-assisted surgery VOSviewer Citespace Provincial key research and development program 2023BEG01001 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer-Verlag London Ltd., part of Springer Nature 2025 Introduction Gynecological cancers, including ovarian, endometrial, and cervical cancers, represent a significant global health burden, contributing substantially to cancer-related morbidity and mortality among women worldwide. Surgical intervention remains a cornerstone of curative treatment for many of these cancers, aiming for optimal cytoreduction and accurate staging. The evolution of minimally invasive surgery (MIS) has transformed the surgical landscape, offering benefits such as reduced blood loss, shorter hospital stays, and faster recovery compared to traditional open approaches [ 1 Robotic-assisted surgery, epitomized by the da Vinci Surgical System, has emerged as a prominent technological advancement within minimally invasive surgery (MIS) for gynecological oncology. It offers distinct technical advantages, including enhanced three-dimensional (3D) visualization with magnification, wristed instruments providing greater dexterity and precision in confined anatomical spaces [ 2 3 Despite its widespread adoption, particularly in resource-rich settings, robotic surgery in gynecological oncology is not without significant controversy. Key areas of ongoing debate include its high cost-effectiveness ratio compared to conventional laparoscopy [ 4 5 6 7 8 While numerous narrative and systematic reviews have recently synthesized clinical outcomes data [ 7 9 12 Therefore, this study aims to conduct the comprehensive bibliometric analysis of scientific literature focusing on robotic surgery in gynecological malignancies. Our primary objectives are: 1. To quantify and visualize the global research output trends, including publication volume growth and geographical distribution. 2. To identify and analyze the contributions of leading countries, institutions, and authors, and map their collaborative networks. 3. To determine the core literature (highly cited publications), influential journals, and prolific authors shaping the field. 4. To identify major research themes, hotspots, and emerging frontiers through keyword co-occurrence, clustering, and burst detection analysis. 5. To elucidate the evolution of research focus and predict potential future directions based on the bibliometric evidence. This analysis will provide researchers, clinicians, and policymakers with a data-driven overview of the field's development, highlight areas of strength and gaps in knowledge, and inform strategic planning for future research endeavors. Methods Data sources To ensure the coverage and authority of the data analyzed, the Web of Science (core collection) was selected as the datasource, and the indexes were selected as SSCI and SCI-Expended. The search strategy selected was TS = ((\"gynecologic* cancer\" OR \"endometrial cancer\" OR \"uterine corpus cancer\" OR \"cervical cancer\" OR \"ovar* cancer\" OR \"vaginal cancer\") AND (\"robot* surger*\")), with a time span starting from January 2005 to June 2025, a search time cutoff of June 27,2025, and a literature type selected as “Articles and Review” and a language of English, and 614 literature records were obtained after the search. However, the data directly obtained through the search formula may have some problems such as inconsistency with the subject, so the data need to be pre-processed before the analysis to avoid the results of the analysis due to the quality of the data itself. After the two researchers screened each article, 561 valid documents were finally obtained. Figure 1 Fig. 1 Bibliometric literature screening flowchart Analytical tools R-bibliometrix: CiteSpace: VOSviewer: Scimago Graphica: Results Trend analysis of annual publication volume A corpus of 561 relevant publications was identified for this study. Annual output trends (2005–2025) are illustrated in Fig. 2 Fig. 2 Distribution of publications from 2005 to 2025 Analysis of countries/regions A total of 42 nations contributed to the literature within this domain. Among these, 23 countries and regions have published more than 5 articles. The global distribution of contributions, illustrated on a world map (Fig. 3 1 n n n n n n n n Fig. 3 Geographic distribution of publication counts for countries contributing ≥ 5 articles to robotic gynecologic oncology surgery, 2005–2025 Table 1 Top ten most productive countries in robotic gynecologic oncology surgery, 2005–2025 TP TC Analysis of institution Network analysis revealed significant structural centrality variations among leading institutions. Mayo Clinic exhibited the highest centrality (0.16), indicating its prominent brokerage role in global collaboration networks. Catholic University of the Sacred Heart (0.13) and the University of Texas System (0.12) ranked second and third, respectively (Table 2 Table 2 Top ten leading institutions in robotic gynecologic oncology surgery, 2005–2025 TP PY_start Temporal analysis showed divergent institutional engagement patterns (Fig. 4 Fig. 4 Global institutional landscape of robotic gynecologic oncology surgery, 2005–2025 Analysis of journal A comprehensive bibliometric analysis of robotic surgery literature identified 114 contributing journals. Application of a minimum yield threshold (≥ 5 articles per journal) revealed 29 high-productivity outlets (Fig. 5 3 Fig. 5 Density overlay of publication counts for journals contributing ≥ 5 articles to robotic gynecologic oncology surgery, 2005–2025 Table 3 Top 12 highly productive journals in robotic gynecologic oncology surgery, 2005–2025 TP TC HI GI MI PY_start IF JQ Gynecologic Oncology demonstrated the highest publication volume (71 articles, 12.66%), followed by the International Journal of Gynecological Cancer (45, 8.02%) and the Journal of Minimally Invasive Gynecology (43, 7.66%). Citation analysis showed Gynecologic Oncology as the most influential journal (total citations = 3,649), substantially ahead of the International Journal of Gynecological Cancer (1,224) and the Journal of Minimally Invasive Gynecology (1,219). This dominance was further reflected in the H-index metric (Gynecologic Oncology: h-index = 37 vs. 23 and 21 for the second and third-ranked journals, respectively). The American Journal of Obstetrics & Gynecology held the highest impact factor among leading journals, with the International Journal of Gynecological Cancer (IF = 4.7) and Gynecologic Oncology (IF = 4.5) ranked second and third. Analysis of author A systematic analysis of authorship patterns in robotic gynecologic oncology surgery research reveals that 2,417 individual researchers have contributed to scholarly publications in this domain. The top ten contributing authors, ranked by publication volume, are presented in Table 4 6 Table 4 Top ten most prolific authors in robotic gynecologic oncology surgery, 2005–2025 TP TC AC Avg.Pub.Year Fig. 6 Co-authorship map of authors possessing ≥ 4 publications in robotic gynecologic oncology surgery, 2005–2025 Analysis of citation Bibliometric profiling of 561 publications on robotic gynecologic oncology surgery (2005–2025) uncovered a citation spectrum of 0–242, accumulating 13,597 citations in total. By imposing a ≥ 30 citation threshold, 143 high-impact articles were isolated for subsequent network visualization in VOSviewer (Fig. 7 5 6 Fig. 7 Network map of total citation analysis of documents with more than 30 citations, 2005–2025 Table 5 Top ten most total cited papers in robotic gynecologic oncology surgery, 2005–2025 TC TC per year Table 6 Top ten most local cited papers in robotic gynecologic oncology surgery, 2005–2025 LC TC LC/TC Analysis of references Co-citation reference landscapes were mapped with VOSviewer (Fig. 8 ) 7 8 Fig. 8 Visualization of reference data analysis in robotic gynecologic oncology surgery, 2005–2025 A B Table 7 Top ten most frequently cited references in robotic gynecologic oncology surgery, 2005–2025 LC Analysis of keyword In our bibliometric analysis of robotic surgery applications in gynecological oncology from 2005 to 2025, we identified 61 high-frequency keywords occurring ≥ 15 times across 561 articles. Co-occurrence analysis revealed four thematic clusters, each represented by a distinct color on the network map (Fig. 9 9 9 9 Fig. 9 Visualization of keywords data analysis in robotic gynecologic oncology surgery, 2005–2025. A B C Correlation analysis between economic statistical indicators and bibliometric indices Table 8 p p p p p p Table 8 Correlation analysis between economic statistical indicators and bibliometric indices in robotic gynecologic oncology surgery TP TC p p p Discussion This is a bibliometric analysis to identify papers on robotic surgery in gynecology oncology as well as to analyze their bibliometric characteristics. In this study, we used the WOSCC to find 561 relevant papers from 2005 to 2025. In line with previous bibliometric analyses exploring the adoption of robotic surgery across surgical disciplines [ 13 16 13 16 17 8 p p p 18 p 19 p p 18 Geographically, the scientific output on robot-assisted surgery for gynaecological cancers is imbalanced: while global interest is evident, scholarly production remains heavily concentrated in high-income regions. In our study, the hegemony of the United States (216/561 publications; 38.5%) is consistent with prior scientometric reports identifying North America as the epicenter of robotic innovation [ 13 14 16 8 16 8 15 20 Among institutions, Catholic University of the Sacred Heart (Italy) is the most productive institution (TP = 32), though its research initiation was relatively recent (2013). The Mayo Clinic in USA, while not the most productive in terms of publication volume (TP = 12), exhibits exceptional betweenness centrality (C = 0.16), positioning it as a primary knowledge broker within the global network. This role is crucial for the dissemination of innovative surgical techniques and best practices, aligning with the findings of previous bibliometric studies that highlight the importance of such intermediary institutions in accelerating the adoption of new technologies [ 13 8 Through journal data collection, we identified 114 journals publishing on robotic surgery in gynecologic oncology. Among them, Gynecologic Oncology International Journal of Gynecological Cancer Journal of Minimally Invasive Gynecology With respect to the authors, Professor Giovanni Scambia, from the Catholic University of the Sacred Heart (Italy), ranked first in the number of papers published, with 26 papers related to robotic surgery in gynecologic oncology. Author collaboration networks disclosed a cohesive but clustered community (143 core authors, 11 clusters), with Giovanni Scambia occupying a central position akin to the “hub-and-spoke” configuration reported for Alexandre Mottrie in general robotic surgery [ 13 20 Thematic analysis identified “endometrial cancer”, “radical hysterectomy”, and “lymphadenectomy” as dominant keywords, aligning with the keyword clusters reported by Levin et al. [ 8 14 20 21 Our study's findings, while showing a significant growth in the field, also reveal important gaps. The low percentage of randomized-controlled trials (RCTs) at 2.3% is concerning, as it is even lower than the 3.9% reported in other studies [ 8 14 21 8 Additionally, the near-absence of publications from low- and lower-middle-income countries (0%) contrasts sharply with the 8.4% contribution from middle-income nations in recent years [ 8 Furthermore, the integration of artificial intelligence (AI) with robotic platforms—an emerging hotspot identified by Song et al. [ 13 Recently, robotic gynecological oncology surgery has seen many exciting advances. The Da Vinci 5 model was granted the EU CE certification on August 1, 2025. This new generation of platform will integrate force feedback, AI-based navigation, and enhanced 3D visual effects to optimize the precision of complex anatomical operations (such as pelvic resection for advanced malignant tumors). While systems such as DEXTER® (Distalmotion) expand outpatient applications like sacrocolpopexy and myomectomy through streamlined workflows. Second, single-port robotics is emerging as a frontier for ultra-minimally invasive procedures [ 6 22 23 24 25 Limitations Although Web of Science Core Collection represents one of the most comprehensive academic databases, this bibliometric analysis exclusively relied on its indexed literature. Consequently, publications from non-Web of Science journals may have been omitted. Our search strategy emphasized core search terms (e.g., cancer types and \"robotic surgery\") to optimize the balance sensitivity and specificity. While this approach might have excluded studies focused on specific procedural techniques (such as lymph-node dissection), such omissions are not expected to impact the principal findings. Finally, given the continuous daily addition of new publications, the influence of recently released studies remains unaccounted for in this analysis. Conclusions Robotic surgery in gynecologic oncology has transitioned from a novel technique to a prolific research domain dominated by high-income nations and centered on endometrial cancer. The field must now pivot toward multi-center RCTs, global collaborations with low-resource settings, and integration of AI to consolidate its therapeutic promise and ensure equitable worldwide dissemination. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions XL and ML downloaded and analyzed the bibliometric data. XL wrote the initial draft of the manuscript. HC and XD assisted with data analysis and visualization. BL contributed to the interpretation of the results. CH supervised the project, provided critical feedback, and helped shape the research and manuscript. All authors reviewed and approved the final version of the manuscript. Funding Provincial key research and development program, 2023BEG01001. Data availability No datasets were generated or analysed during the current study. Declarations Conflict of interests The authors declare no competing interests. References 1. Obermair A Simunovic M Isenring L Janda M Nutrition interventions in patients with gynecological cancers requiring surgery Gynecol Oncol 2017 145 1 192 199 10.1016/j.ygyno.2017.01.028 28173966 Obermair A, Simunovic M, Isenring L, Janda M (2017) Nutrition interventions in patients with gynecological cancers requiring surgery. Gynecol Oncol 145(1):192–199. 10.1016/j.ygyno.2017.01.028 28173966 10.1016/j.ygyno.2017.01.028 2. Nobbenhuis M Gul N Barton-Smith P O'Sullivan O Moss E Ind T Robotic surgery in gynaecology: scientific impact paper No. 71 (July 2022) BJOG 2023 130 1 e1 e8 10.1111/1471-0528.17242 35844092 Nobbenhuis M, Gul N, Barton-Smith P, O’Sullivan O, Moss E, Ind T (2023) Robotic surgery in gynaecology: scientific impact paper No. 71 (July 2022). BJOG 130(1):e1–e8. 10.1111/1471-0528.17242 35844092 10.1111/1471-0528.17242 3. Dou L Zhang Y Tips and details for successful robotic myomectomy: single-center experience with the first 125 cases J Clin Med 2022 10.3390/jcm11113221 35683608 PMC9181482 Dou L, Zhang Y (2022) Tips and details for successful robotic myomectomy: single-center experience with the first 125 cases. J Clin Med. 10.3390/jcm11113221 35683608 10.3390/jcm11113221 PMC9181482 4. Lundin ES Carlsson P Wodlin NB Nilsson L Kjölhede P Cost-effectiveness of robotic hysterectomy versus abdominal hysterectomy in early endometrial cancer Int J Gynecol Cancer 2020 30 11 1719 1725 10.1136/ijgc-2020-001611 32863275 Lundin ES, Carlsson P, Wodlin NB, Nilsson L, Kjölhede P (2020) Cost-effectiveness of robotic hysterectomy versus abdominal hysterectomy in early endometrial cancer. Int J Gynecol Cancer 30(11):1719–1725. 10.1136/ijgc-2020-001611 32863275 10.1136/ijgc-2020-001611 5. Gala RB Margulies R Steinberg A Systematic review of robotic surgery in gynecology: robotic techniques compared with laparoscopy and laparotomy J Minim Invasive Gynecol 2014 21 3 353 361 10.1016/j.jmig.2013.11.010 24295923 Gala RB, Margulies R, Steinberg A et al (2014) Systematic review of robotic surgery in gynecology: robotic techniques compared with laparoscopy and laparotomy. J Minim Invasive Gynecol 21(3):353–361. 10.1016/j.jmig.2013.11.010 24295923 10.1016/j.jmig.2013.11.010 6. Chiofalo B Bruno V Mancini E Feasibility and safety of robotic single-port surgical staging in epithelial ovarian cancer using the da Vinci SP platform: a preliminary experience Int J Gynecol Cancer 2025 35 8 101977 10.1016/j.ijgc.2025.101977 40669141 Chiofalo B, Bruno V, Mancini E et al (2025) Feasibility and safety of robotic single-port surgical staging in epithelial ovarian cancer using the da Vinci SP platform: a preliminary experience. Int J Gynecol Cancer 35(8):101977. 10.1016/j.ijgc.2025.101977 40669141 10.1016/j.ijgc.2025.101977 7. čelebić A Jakimovska SM Miladinović M Calleja-Agius J Starič KD Evaluating the role of robotic surgery in gynecological cancer treatment Eur J Surg Oncol 2025 51 4 109630 10.1016/j.ejso.2025.109630 40348472 čelebić A, Jakimovska SM, Miladinović M, Calleja-Agius J, Starič KD (2025) Evaluating the role of robotic surgery in gynecological cancer treatment. Eur J Surg Oncol 51(4):109630 40348472 10.1016/j.ejso.2025.109630 8. Levin G Gotlieb WH Zand B Robotic surgery in gynecologic oncology-a bibliometric study J Minim Invasive Gynecol 2024 31 10 882 889 10.1016/j.jmig.2024.07.002 38992749 Levin G, Gotlieb WH, Zand B et al (2024) Robotic surgery in gynecologic oncology-a bibliometric study. J Minim Invasive Gynecol 31(10):882–889. 10.1016/j.jmig.2024.07.002 38992749 10.1016/j.jmig.2024.07.002 9. Lauterbach R Matanes E Lowenstein L Review of robotic surgery in gynecology-The future is here Rambam Maimonides Med J 2017 10.5041/RMMJ.10296 28467761 PMC5415365 Lauterbach R, Matanes E, Lowenstein L (2017) Review of robotic surgery in gynecology-The future is here. Rambam Maimonides Med J. 10.5041/RMMJ.10296 28467761 10.5041/RMMJ.10296 PMC5415365 10. Baba T Hiraike O Iwase A Current trends and challenges in minimally invasive surgical treatment for gynecologic cancers in Japan: a cancer statistics report Int J Clin Oncol 2025 30 5 837 843 10.1007/s10147-025-02735-z 40057906 Baba T, Hiraike O, Iwase A et al (2025) Current trends and challenges in minimally invasive surgical treatment for gynecologic cancers in Japan: a cancer statistics report. Int J Clin Oncol 30(5):837–843. 10.1007/s10147-025-02735-z 40057906 10.1007/s10147-025-02735-z 11. Kim J Chang HK Paek J Park HJ Moon HY Robotic radical hysterectomy for cervical cancer: current trends and controversies J Cancer 2024 15 16 5134 5139 10.7150/jca.99705 39247605 PMC11375555 Kim J, Chang HK, Paek J, Park HJ, Moon HY (2024) Robotic radical hysterectomy for cervical cancer: current trends and controversies. J Cancer 15(16):5134–5139. 10.7150/jca.99705 39247605 10.7150/jca.99705 PMC11375555 12. Ronsini C Fordellone M Braca E Safety and efficacy outcomes of robotic, laparoscopic, and laparotomic surgery in severe obese endometrial cancer patients: a network meta-analysis Cancers (Basel) 2025 10.3390/cancers17122018 40563674 PMC12191126 Ronsini C, Fordellone M, Braca E et al (2025) Safety and efficacy outcomes of robotic, laparoscopic, and laparotomic surgery in severe obese endometrial cancer patients: a network meta-analysis. Cancers (Basel). 10.3390/cancers17122018 40563674 10.3390/cancers17122018 PMC12191126 13. Song M Liu Q Guo H Wang Z Zhang H Global trends and hotspots in robotic surgery over the past decade: a bibliometric and visualized analysis J Robot Surg 2024 19 1 33 10.1007/s11701-024-02203-2 39729231 Song M, Liu Q, Guo H, Wang Z, Zhang H (2024) Global trends and hotspots in robotic surgery over the past decade: a bibliometric and visualized analysis. J Robot Surg 19(1):33. 10.1007/s11701-024-02203-2 39729231 10.1007/s11701-024-02203-2 14. Fan G Zhou Z Zhang H Global scientific production of robotic surgery in medicine: a 20-year survey of research activities Int J Surg 2016 30 126 131 10.1016/j.ijsu.2016.04.048 27154617 Fan G, Zhou Z, Zhang H et al (2016) Global scientific production of robotic surgery in medicine: a 20-year survey of research activities. Int J Surg 30:126–131. 10.1016/j.ijsu.2016.04.048 27154617 10.1016/j.ijsu.2016.04.048 15. Xiao P Li L Qu J Wang G Global research hotspots and trends on robotic surgery in obstetrics and gynecology: a bibliometric analysis based on VOSviewer Front Surg 2024 11 1308489 10.3389/fsurg.2024.1308489 38404294 PMC10884115 Xiao P, Li L, Qu J, Wang G (2024) Global research hotspots and trends on robotic surgery in obstetrics and gynecology: a bibliometric analysis based on VOSviewer. Front Surg 11:1308489. 10.3389/fsurg.2024.1308489 38404294 10.3389/fsurg.2024.1308489 PMC10884115 16. Vidal M Tantengco O Gamo N Lee KY Scientometric analysis of global research output in robotic gynecologic surgery Int J Surg Open 2022 10.1016/j.ijso.2022.100544 Vidal M, Tantengco O, Gamo N, Lee KY (2022) Scientometric analysis of global research output in robotic gynecologic surgery. Int J Surg Open. 10.1016/j.ijso.2022.100544 17. Walker JL Piedmonte MR Spirtos NM Laparoscopy compared with laparotomy for comprehensive surgical staging of uterine cancer: Gynecologic Oncology Group Study LAP2 J Clin Oncol 2009 27 32 5331 5336 10.1200/JCO.2009.22.3248 19805679 PMC2773219 Walker JL, Piedmonte MR, Spirtos NM et al (2009) Laparoscopy compared with laparotomy for comprehensive surgical staging of uterine cancer: Gynecologic Oncology Group Study LAP2. J Clin Oncol 27(32):5331–5336. 10.1200/JCO.2009.22.3248 19805679 10.1200/JCO.2009.22.3248 PMC2773219 18. Sofer A Magnezi R Eitan R Robotic vs. open surgery in obese women with low-grade endometrial cancer: comparison of costs and quality of life measures Isr J Health Policy Res 2020 9 1 60 10.1186/s13584-020-00412-2 33138857 PMC7607708 Sofer A, Magnezi R, Eitan R et al (2020) Robotic vs. open surgery in obese women with low-grade endometrial cancer: comparison of costs and quality of life measures. Isr J Health Policy Res 9(1):60. 10.1186/s13584-020-00412-2 33138857 10.1186/s13584-020-00412-2 PMC7607708 19. Hinshaw SJ Gunderson S Eastwood D Bradley WH Endometrial carcinoma: the perioperative and long-term outcomes of robotic surgery in the morbidly obese J Surg Oncol 2016 114 7 884 887 10.1002/jso.24417 27566529 Hinshaw SJ, Gunderson S, Eastwood D, Bradley WH (2016) Endometrial carcinoma: the perioperative and long-term outcomes of robotic surgery in the morbidly obese. J Surg Oncol 114(7):884–887. 10.1002/jso.24417 27566529 10.1002/jso.24417 20. Shi XT Shen J Sun YY Bibliometric analysis of research trends and hotspots on robot-assisted thyroid surgery Medicine (Baltimore) 2024 103 14 e37588 10.1097/MD.0000000000037588 38579095 PMC10994498 Shi XT, Shen J, Sun YY (2024) Bibliometric analysis of research trends and hotspots on robot-assisted thyroid surgery. Medicine (Baltimore) 103(14):e37588. 10.1097/MD.0000000000037588 38579095 10.1097/MD.0000000000037588 PMC10994498 21. Ramirez PT Frumovitz M Pareja R Minimally invasive versus abdominal radical hysterectomy for cervical cancer N Engl J Med 2018 379 20 1895 1904 10.1056/NEJMoa1806395 30380365 Ramirez PT, Frumovitz M, Pareja R et al (2018) Minimally invasive versus abdominal radical hysterectomy for cervical cancer. N Engl J Med 379(20):1895–1904. 10.1056/NEJMoa1806395 30380365 10.1056/NEJMoa1806395 22. Gong P Mao H He T Initial outcomes and methodologies of a novel single-port robotic surgery in gynecology JSLS 2024 10.4293/JSLS.2024.00047 39831275 PMC11741202 Gong P, Mao H, He T et al (2024) Initial outcomes and methodologies of a novel single-port robotic surgery in gynecology. JSLS. 10.4293/JSLS.2024.00047 39831275 10.4293/JSLS.2024.00047 PMC11741202 23. Chang R Ping D Yang S Effectiveness and safety of SR-ENS-600endoscopic surgical system in benign and malignant gynecological diseases: a prospective, multicenter, clinical trial with 63 cases J Robot Surg 2024 18 1 210 10.1007/s11701-024-01871-4 38727869 PMC11087307 Chang R, Ping D, Yang S et al (2024) Effectiveness and safety of SR-ENS-600endoscopic surgical system in benign and malignant gynecological diseases: a prospective, multicenter, clinical trial with 63 cases. J Robot Surg 18(1):210. 10.1007/s11701-024-01871-4 38727869 10.1007/s11701-024-01871-4 PMC11087307 24. Zhao L Cong R Pan Z Xue Y Li Y Li Q The feasibility and short-term safety of single-site hysterectomy: a retrospective cohort study of a novel robotic platform Surg Endosc 2025 39 2 1362 1371 10.1007/s00464-025-11533-7 39806178 Zhao L, Cong R, Pan Z, Xue Y, Li Y, Li Q (2025) The feasibility and short-term safety of single-site hysterectomy: a retrospective cohort study of a novel robotic platform. Surg Endosc 39(2):1362–1371. 10.1007/s00464-025-11533-7 39806178 10.1007/s00464-025-11533-7 25. Alkatout I O'Sullivan O Peters G Maass N Expanding robotic-assisted surgery in gynecology using the potential of an advanced robotic system Medicina (Kaunas) 2023 10.3390/medicina60010053 38256313 PMC10818539 Alkatout I, O’Sullivan O, Peters G, Maass N (2023) Expanding robotic-assisted surgery in gynecology using the potential of an advanced robotic system. Medicina (Kaunas). 10.3390/medicina60010053 38256313 10.3390/medicina60010053 PMC10818539 ",
  "metadata": {
    "Title of this paper": "Expanding robotic-assisted surgery in gynecology using the potential of an advanced robotic system",
    "Journal it was published in:": "Journal of Robotic Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477092/"
  }
}