{
  "title": "Paper_183",
  "abstract": "pmc J Glob Infect Dis J Glob Infect Dis 1193 jginfectdis JGID J Global Infect Dis Journal of Global Infectious Diseases 0974-777X 0974-8245 Wolters Kluwer -- Medknow Publications PMC12494316 PMC12494316.1 12494316 12494316 10.4103/jgid.jgid_166_24 JGID-17-131 1 Original Article Sexually Transmitted Infections in Women from a Traditional Quilombola Community in Northeastern Brazil Piancó Elaine dos Santos 1 Carvalho Larissa Helena Sousa Baldez 2 Carvalho Clara Vitória Cavalcante 3 Neto Antonio da Silva Lima 2 Soares Paulo Eduardo Silva 2 Côra Gabriel Rodrigues 4 Machado Rayane Alves 4 de Ribamar Ross Jose 5 Vidal Flavia Castello Branco 1 1 2 3 4 5 Address for correspondence: flavia.vidal@ufma.br Jul-Sep 2025 22 9 2025 17 3 498281 131 138 14 8 2024 09 1 2025 03 2 2025 22 09 2025 04 10 2025 04 10 2025 Copyright: © 2025 Journal of Global Infectious Diseases 2025 https://creativecommons.org/licenses/by-nc-sa/4.0/ This is an open access journal, and articles are distributed under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike 4.0 License, which allows others to remix, tweak, and build upon the work non-commercially, as long as appropriate credit is given and the new creations are licensed under the identical terms. Introduction: Sexually transmitted infections (STIs) affect approximately more than 1 million people around the world. Specific populations are more predisposed to diseases caused by poor access to health care, especially sexual health. This is the case for Indigenous people and other traditional communities around the globe. This work aimed to evaluate the prevalence of some STIs in traditional quilombola communities in the northern region of Brazil. Methods: A cross-sectional and prospective study was carried out from March 2021 to March 2022 of quilombola women from 5 communities. A questionnaire was applied to collect sociodemographic, behavioral, and clinical information. A gynecological examination was performed to collect cervical cells for oncotic cytology and to detect the agents through polymerase chain reaction analysis. Results: Almost half of the women (48.3%) had at least one sexually transmitted agent. Human papillomavirus (HPV) was the most observed ( P P P P P Conclusions: Almost half of the quilombola women had at least one sexually transmitted agent. HPV infection was the most common. The location of the Quilombola community and women’s profession was associated with the prevalence of STIs. Low monthly income and not being in menopause were associated with a higher prevalence of STIs. Quilombola risk factors sexually transmitted infections vulnerable populations Nil. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes I NTRODUCTION Sexually transmitted infections (STIs) can be caused by protozoa, viruses, bacteria, and other microorganisms that are commonly transmitted through oral, vaginal, or anal sexual contact. These infections represent a public health problem, with approximately 1 million people infected daily worldwide.[ 1 2 Economic and cultural factors are associated with a higher rate of STI infection due to lack of knowledge of sexual health, difficulty accessing health services, conservative culture, and poor education, which contribute to the persistence of the sexually transmitted agent and the infection of other sexual partners.[ 3 4 Even within underdeveloped countries, there are specific populations that are in more vulnerable conditions that make them predisposed to diseases caused by poor access to health care, especially sexual health. This is the case for Indigenous people and other traditional communities around the globe.[ 4 5 6 7 Quilombolas are a traditional Brazilian community composed of individuals descended from Africans enslaved between the 16 th th 8 This study was conducted in a region in northeastern Brazil with the second-largest population of quilombolas in Brazil.[ 9 3 8 10 11 Information on the prevalence of STIs among these African-descendant women will contribute to expanding knowledge on the epidemiological profile of these infections, generating support for the implementation of public policies for the control of STIs in vulnerable populations. Therefore, the objective of the work is to ascertain the prevalence and factors associated with STIs in African-descendant women from quilombola communities in the Caxias region, Maranhão, Brazil. M ETHODS Sample size population This work followed the guidelines for reporting observational studies (STROBE) and the Microbiology Investigation Criteria for Reporting Objectively (MICRO) guidelines which contain a selection list of items that should be examined in reports of studies involving human clinical microbiology data.[ 12 13 The study was conducted in a region of northeastern Brazil called Maranhão, located at a latitude of 4°51’32” south and a longitude of 43°21’22” west, at an altitude of 66 m. Maranhão is the second Brazilian state with the largest number of quilombola communities.[ 9 14 15 https://www.surveymonkey.com/mp/sample-size-calculator/ Study design and sites This was a cross-sectional analytical study, with 145 women from six quilombola areas: Cana Brava, Jenipapo, Lavras, Soledade, Lagoa dos Pretos, and Vilarias. All these communities, except Soledade and Vilarias, which are close to the city of Caxias, are located in rural areas.[ 14 15 12 The inclusion criteria were women over 18 years of age, sexually active, and living in the quilombola areas. The exclusion criteria were any mental or cognitive condition that would affect the completion of the questionnaire, bleeding, or uterine diseases that contraindicated the collection of endometrial and ectocervical samples. Also excluded were women who had had a hysterectomy or who used vaginal treatments based on creams, ova, lubricants, or spermicides in the last 48 h, undergoing chemotherapy and/or radiation therapy. Data collection and cervical cytology After understanding and consenting upon acceptance, selected women were invited to participate in the study signed the Free and Informed Consent Form and responded to a questionnaire to collect sociodemographic data and risk factors for STIs. Subsequently, they were sent to an examination room where biological samples were collected for analysis of conventional cervical oncotic cytology. Sampling followed routine clinical practice, and the specimens were classified as community-acquired (CAI).[ 12 A qualified professional read the slides. Sample results and degree of cervical atypia were interpreted according to the Bethesda 2001 system. For molecular analysis, biological samples of the cervix were obtained using a sterile brush of the HC2 DNA Collection Device kit (QIAGEN, Valencia, CA). The brush was immediately immersed in the conservative medium and stored at −20°C. The sampling period was from January 2020 to March 2021. Molecular detection of STI agents The species of microorganisms evaluated were Neisseria gonorrhoeae Chlamydia trachomatis, Trichomonas vaginalis, The conservative medium containing the samples was centrifuged at 3075 g for 10 min, and the samples underwent extraction DNA extraction by Dneasy Blood and Tissue Kit (QIAGEN, Valencia, CA) according to the manufacturer’s instructions. For HPV detection, a Nested-polymerase reaction (PCR) was performed using two pairs of primers specific for the L1 protein of the viral capsid, PGMY09/PGMY11 and GP +5/GP +6.[ 16 N. gonorrhoeae C. trachomatis T. vaginalis 17 18 The amplicons were visualized by electrophoresis on a 1.5 or 2% agarose gel in 1X TBE buffer. Electrophoresis was performed for 60 min at 100 v/cm² in a horizontal tank (Life Technologies, USA). Amplified DNA fragments were visualized on an ultraviolet light transilluminator (BIO-RAD Laboratories, USA). According to the manufacturer’s protocol, HPV-positive samples were subjected to automatic sequencing for viral genotyping using the MegaBACE 1000 sequencer (GE Healthcare, UK) with the BigDyeTM Terminator v3.1 cycle sequencing kit (Thermo Fisher Scientific). The Chromas program was used for the analysis and alignment of the nucleotide sequences obtained in the sequencing, obtaining electropherograms of HPV DNA sequences present in the samples. To confirm and identify HPV type, the nucleotide sequences of the sequenced samples were compared and submitted to the World Nucleotide Database – Gene Bank, using the BLAST program (NCBI). Statistical analyses All variables are characterized by absolute and relative frequency. The Chi-square test was used to associate with the diagnosis of two sexually transmitted agents, chlamydia and trichomoniasis. Associations were also tested between independent variables and people who were not diagnosed with any STI and those who were infected with only one STI. The odds ratio was calculated to verify the probability that agents occurred for each significant variable in the study. The data were analyzed using SPSS (Statistical Package for the Social Sciences) software Version 22 (IBM Company, Endicott, Nova York, EUA), and a significance level of 0.05% was used throughout. R ESULTS In total, 145 women from quilombola areas were analyzed in the municipality of Caxias, in the state of Maranhão. The percentage of women from quilombola areas evaluated, respectively, was Lavras (38%), Vilarias (15%), Soledade (14%), Canabrava (13%), Jenipapo (13%), and Lagoa dos Pretos (7%). Almost half of the women, 48.3%, had at least one sexually transmitted agent. HPV was the most common among them, whereas the bacterium Neisseria gonorrhea Table 1 Table 1 Prevalence of genital infection and human papillomavirus infection, Chlamydia trachomatis, Trichomonas vaginalis Neisseria gonorrhea Sexual infection n 95% CI No infection 75 (51.7) 43.4–60.0 Any infection* 70 (48.3) 40.0–56.6 HPV** 48 (33.1) 25.5–40.7 Chlamydia trachomatis 19 (13.1) 7.6–18.6 Trichomonas vaginalis 16 (11.0) 6.2–16.6 Neisseria gonorrhea 0 - *Main outcome. One or more sexual infections may be considered, **Sexual infection is used to classify genital infection. 95% CI: 95% confidence interval, HPV: Human papillomavirus The following tables show the statistical tests performed between the variables (rows) and 3 classification categories depending on the absence of an STI (negative), at least one STI (one STI), and the presence of two STIs (two STIs). Table 2 P P Table 2 Analysis of sociodemographic characteristics associated with sexually transmitted infections detected in 145 quilombola women from the municipality of Caxias, Maranhão, Brazil Variables Total, n Negative, n One STI, n Two STI, n Quilombola área Canabrava* 19 (13.1) 11 (9.7) 8 (29.6) 0 Jenipapo 19 (13.1) 18 (15.9) 1 (3.7) 0 Lagoa dos pretos 10 (6.9) 8 (7.1) 2 (7.4) 0 Lavras* 55 (37.9) 48 (42.5) 5 (18.5) 1 (25) Soledade 20 (13.8) 15 (13.3) 2 (7.4) 3 (75) Vilarias* 22 (15.2) 13 (11.5) 9 (33.3) 0 Age group (years) <30 49 (33.8) 41 (36.3) 8 (29.6) 0 30–50 56 (38.6) 39 (34.5) 16 (59.3) 0 50 and 64 40 (27.6) 33 (29.2) 3 (11.1) 4 (100) Profession House worker 12 (8.3) 8 (7.1) 4 (14.8) 0 Farmer* 97 (66.9) 77 (68.1) 18 (66.7) 1 (25) Retired 24 (16.6) 22 (19.5) 1 (3.7) 1 (25) Autonomous* 12 (8.3) 6 (5.3) 4 (14.8) 2 (50) Education Illiterate 55 (37.9) 44 (38.9) 7 (25.9) 3 (75) Elementary school 60 (41.4) 48 (42.5) 11 (40.7) 1 (25) High school 29 (20) 21 (18.6) 8 (29.6) 0 Higher education 1 (0.7) 0 1 (3.7) 0 Marital status Single 34 (23.4) 27 (23.9) 7 (25.9) 0 Married 50 (34.5) 39 (34.5) 7 (25.9) 3 (75) Stable union 55 (37.9) 43 (38.1) 12 (44.4) 0 Widowed 6 (4.1) 4 (3.5) 1 (3.7) 1 (25) Monthly income Up to 1 minimum wage* 82 (56.6) 60 (53.1) 20 (74.1) 1 (25) More than 1 salário minimum wage 63 (43.4) 53 (46.9) 7 (25.9) 3 (75) Self-declared color Black 112 (77.2) 90 (79.6) 18 (66.7) 4 (100) Brown 25 (17.2) 17 (15) 8 (29.6) 0 White 8 (5.5) 6 (5.3) 1 (3.7) 0 *Chi-square test significant at 0.05%. STI: Sexually transmitted infection The predominant age group was between 30 and 50 years old and there was no statistical association between age and the presence of STIs. Most women’s professions were farmers. This group had the lowest rates of STI infection ( P P In general, Quilombola women had low education. Almost half had only elementary education and 37.9% were illiterate. Women with both STIs tend to have lower levels of education, but it was not statistically significant. Regarding monthly income, women who earned up to 1 minimum wage (approximately $285,96) were the majority and had a higher prevalence of one STI ( P Marital status and color were not associated with the presence or absence of STIs ( P Smoking and alcohol consumption were not predominant habits in this population and were not associated with the presence of STIs. Regarding risk factors associated with sexual behavior, the majority reported starting their sexual life before the age of 15, having had a maximum of 3 partners throughout their lives, and not using the male condom regularly [ Table 3 P Table 3 Analysis of the characteristics of sexual life associated with sexually transmitted infections detected in quilombola women in the municipality of Caxias, Maranhão, Brazil Variable Total, n Negative, n One STI, n Two STI, n Tabagism Yes 12 (8.3) 10 (8.8) 2 (7.4) 0 No 133 (91.7) 103 (91.2) 25 (92.6) 4 (100) Etilism Yes 72 (49.7) 57 (50.4) 12 (44.4) 3 (75) No 73 (50.3) 56 (49.6) 15 (55.6) 1 (25) Active sex life Yes 123 (84.8) 95 (84.1) 24 (88.9) 3 (75) No 22 (15.2) 18 (15.9) 3 (11.1) 1 (25) Age at first sexual intercourse (years) <10 1 (0.7) 1 (0.9) 0 0 10–12 13 (9) 11 (9.7) 2 (7.4) 0 13–15 63 (43.4) 52 (46) 10 (37) 0 16–18 43 (29.7) 32 (28.3) 11 (40.7) 0 More than 19 25 (17.2) 17 (15) 4 (14.8) 4 (100) Age at menarche (years) 10–12 57 (39.3) 44 (38.9) 11 (40.7) 2 (50) 13–15 79 (54.5) 61 (54) 15 (55.6) 2 (50) More than 15 9 (6.2) 8 (7.1) 1 (3.7) 0 Number of sexual partners during life 1 57 (39.3) 42 (37.2) 12 (44.4) 2 (50) 2–3 54 (37.2) 47 (41.6) 6 (22.2) 1 (25) 4–5 11 (7.6) 8 (7.1) 2 (7.4) 1 (25) 6–10 15 (10.3) 10 (8.8) 5 (18.5) 0 More than 10 8 (5.5) 6 (5.3) 2 (7.4) 0 Condom use No 49 (33.8) 39 (34.5) 8 (29.6) 1 (25) Sometimes 82 (56.6) 65 (57.5) 14 (51.9) 3 (75) Always 14 (9.7) 9 (8) 5 (18.5) 0 STI: Sexually transmitted infection About the stage of the reproductive life cycle, 66.2% of the women were at fertile age compared to 33.8% who had already entered menopause. Statistical evaluation showed that those who were not in menopause had a higher rate of infection with an STI ( P Table 4 Table 4 Analysis of physiological and gestational characteristics associated with sexually transmitted infections detected in quilombola women in the municipality of Caxias, Maranhão, Brazil Variable Total, n Negative, n One STI, n Two STIs, n Menopause Yes 49 (33.8) 41 (36.3) 4 (14.8) 4 (100) No* 96 (66.2) 72 (63.7) 23 (85.2) 0 Hormone replacement Yes 15 (30.6) 13 (31.7) 2 (50.0) 0 No 34 (69.4) 28 (68.3) 2 (50.0) 4 (100) Pregnancy number Never 9 (6.2) 6 (5.3) 3 (11.1) 0 1 pregnancy 20 (13.8) 17 (15.0) 3 (11.1) 0 2–3 pregnancies 52 (35.9) 37 (32.7) 12 (44.4) 3 (75) 4–5 pregnancies 33 (22.8) 27 (23.9) 5 (18.5) 0 More than 6 pregnancies 31 (21.4) 26 (23.0) 4 (14.8) 1 (25) Age at first pregnancy (years) 10–14 19 (14.1) 16 (15.1) 3 (12.5) 0 15–19 76 (56.3) 63 (59.4) 13 (54.2) 0 20–24 32 (23.7) 20 (18.9) 7 (29.2) 4 (100) 25–30 7 (5.2) 6 (5.7) 1 (4.2) 0 >31 1 (0.7) 1 (0.9) 0 0 *Chi-square test significant at 0.05%. STI: Sexually transmitted infection Other variables related to gestational characteristics such as the number of pregnancies and the age of the first pregnancy did not show a statistical association [ Table 4 Table 5 Table 5 Analysis of sexually transmitted infections and pap smear characteristics associated with sexually transmitted infections detected in quilombola women in the municipality of Caxias, Maranhão, Brazil Variables Total, n Negative, n One STI, n Two STIs, n Previous STI Yes 24 (16.6) 16 (14.2) 7 (25.9) 1 (25) No 110 (75.9) 88 (77.9) 18 (66.7) 3 (75) Don’t know/don’t remember 11 (7.6) 9 (8.0) 2 (7.4) 0 Use of contraceptive pill Yes 48 (33.1) 37 (32.7) 10 (37) 1 (25) No 97 (66.9) 76 (67.3) 17 (63) 3 (75) Use of injectable contraceptive Yes 34 (23.4) 27 (23.9) 6 (22.2) 1 (25) No 111 (76.6) 86 (76.1) 21 (77.8) 3 (75) Knowledge about the pap smear exam Yes 79 (54.5) 59 (52.2) 17 (63) 3 (75) No 66 (45.5) 54 (47.8) 10 (37) 1 (25) Had already had a pap smear Yes 114 (78.6) 90 (79.6) 21 (77.8) 3 (75) No 31 (21.4) 23 (20.4) 6 (22.2) 1 (25) Pap smear frequency More than 1 time a year 1 (0.9) 1 (1.1) 0 0 Once a year 29 (25.4) 22 (24.4) 6 (28.6) 1 (33.3) 2 in 2 years 14 (12.3) 12 (13.3) 1 (4.8) 1 (33.3) 3 in 3 years 21 (18.4) 16 (17.8) 5 (23.8) 0 No regularity 49 (43.0) 39 (43.3) 9 (42.9) 1 (33.3) Atypical diagnosis on cytology Yes 9 (6.2) 9 (8.0) 0 0 No 136 (93.8) 104 (92.0) 27 (100) 4 (100) Type of atypia No atypia 136 (93.8) 104 (92.0) 27 (100) 4 (100) ACS-US 4 (2.8) 4 (3.5) 0 0 ASC-H 2 (1.4) 2 (1.8) 0 0 LSIL 2 (1.4) 2 (1.8) 0 0 HSIL 1 (0.7) 1 (0.9) 0 0 HSIL: High-grade intraepithelial lesion, LSIL: Low-grade intraepithelial lesion, ASC-US: Atypical squamous cells of undetermined significance, ASC-H: Atypical squamous cells, STI: Sexually transmitted infection Regarding knowledge about the Pap smear exam, just over half knew what the test was about (54.5%) and 78.6% had already taken it at least once; however, 43% did not do it regularly. Despite this, only 9 women (6.2%) presented atypia on cytological examination, most of them, ASC-US and only one had a high-grade intraepithelial lesion. No variable was associated with the presence of evaluated STIs [ Table 5 The next phase was statistical analysis using binary logistic regression with the calculation of odds (odds ratio) for the variables that gave significance. A category was taken as a reference (REF) to compare the others. The first analysis was for the variables associated with being negative for both STIs. Quilombola Jenipapo women had a 13.09 times higher chance of being negative for both diseases than Canabrava women, a significant value ( P Table 6 Table 6 Binary logistic regression of factors associated with being negative for both diseases OR 95% CI Teste wald  P Quilombola area Canabrava Reference - - - Jenipapo 13.091 1.44–19.34 5.202 0.022* Lagoa dos pretos 2.909 0.48–17.55 1.356 0.244 Lavras 5.818 1.68–20.20 7.687 0.006* Soledade 2.182 0.56–8.51 1.261 0.261 Vilarias 1.051 0.30–3.65 0.006 0.938 Profession House worker 2.0 0.38–10.41 0.678 0.410 Farmer 4.053 1.18–13.98 4.908 0.027* Retired 11.0 1.75–69.08 6.543 0.011* Autonomous Reference - - - *OR significant at 0.05%. OR: Odds ratio, CI: Confidence interval Regarding the profession, farmers were 4.053 times more likely to be negative for both STIs than autonomous women. Retired women are 11 times more likely to be negative for both diseases than autonomous women. Table 7 Table 7 Binary logistic regression of factors associated with an sexually transmitted infection OR 95% CI Teste wald  P Quilombola area Canabrava Reference - - - Jenipapo 0.076 0.01–0.69 5.2 0.022* Lagoa dos pretos 0.344 0.06–2.07 1.36 0.244 Lavras 0.140 0.04–0.51 8.84 0.003* Soledade 0.153 0.03–0.85 4.58 0.032* Vilaarias 0.952 0.27–3.31 0.01 0.938 Monthly income Up to 1 minimum wage Reference - - - More than 1 salário minimum wage 0.381 0.15–0.97 4.09 0.043* Menopause Yes Reference - - - No 3.59 1.17–11.07 4.97 0.026* *OR significant at 0.05%. OR: Odds ratio, CI: Confidence interval Residents of Jenipapo (1–0.076), Lavras were 0.86 (1–0.140), and Soledade (1–0.153) were less likely to have an STI than residents of Canabrava [ Table 7 Women with an income >1 salary were 0.619 (1–0.381) times less likely to have an STI than women with an income of up to 1 salary. Women who were not in menopause were 3.59 times more likely to have an STI than women who were in menopause [ Table 7 Table 8 Table 8 Binary logistic regression of factors associated with two sexually transmitted infections OR 95% CI Teste wald  P Profession House worker - - - - Farmer 0.053 0.004–0.633 5.383 0.020* Retired 0.217 0.018–2.682 1.417 0.234 Autonomous Reference - - - *OR significant at 0.05%. OR: Odds ratio, CI: Confidence interval D ISCUSSION In this study, the prevalence of four common ISTs was evaluated in the population of quilombola. At least one STI was detected in 48.3% of women. The highest infection was HPV (33.1%), followed by C. trachomatis T. vaginalis N. gonorrhoeae et al T. vaginali C. trachomatis N. gonorrhoeae 8 We observed differences in the prevalence of STIs between the communities analyzed in this work ( P 19 20 21 Decades after the discovery of Brazilian territory (1500), the first enslaved Africans were brought to work in the extraction of natural resources and planting the land. These individuals from different African countries resisted the brutality of the slave regime and ran away to create Quilombos, which were communities formed by slaves who escaped from farms.[ 22 Today, the remnants of the quilombos are called quilombolas.[ 15 23 8 11 14 People generally live in precarious conditions, with low monthly income, lack of basic sanitation, and restricted access to education and health services.[ 8 10 14 According to Dias et al. ( 8 P P Profession appears to be a significant variable in the prevalence of STIs, as does the location of the quilombo. This fact may be due to the specific characteristics of the local population. There are communities in which individuals work as farmers and therefore do not leave the region. On the other hand, there are quilombos where people work outside and may interact with outsiders. Indeed, we observed that women who worked on the land had a lower prevalence of STIs than those who were self-employed (tradespeople, teachers, businesswomen, etc.). In quilombola communities, there is a certain territorial isolation, with sexual activities carried out between members of the same quilombo. We suggest that this increase in prevalence is due to the greater contact of self-employed women with people from nearby cities, as they travel outside the quilombola community to work and may have sexual contact. The sexual behaviors of quilombola women, such as age at the first sexual intercourse, age at menarche, number of sexual partners, and use of condoms, were not related to the prevalence of STIs. However, it is important to note that, as in other studies with this type of population, regular condom use is low and the first sexual intercourse is before 15 years old.[ 8 11 The literature reveals that the prevalence of STIs has increased in women after menopause, especially due to the start of new relationships (divorce or widowhood), the nonuse of condoms, as they considered condoms for contraceptive reasons rather than for the prevention of STIs and an increasing number of sexual.[ 23 24 Unlike the literature, our study reveals that women who were not in menopause had a higher prevalence of STIs than those in menopause ( P 8 It is interesting to note that quilombola women have access to reproductive health services by taking contraceptive pills or injections, or hormone therapy for the menopausal ones. However, there is a need for more efforts in actions aimed at health education in the prevention of STIs among quilombola people. Traditional communities are present worldwide, whether indigenous tribes, Australian aborigines, or other ethnic groups. They all have their own culture, including those related to sexual and reproductive behavior.[ 25 C ONCLUSIONS Almost half of the quilombola women had at least one sexually transmitted agent and HPV was the most common. The location of the Quilombola community and the profession of the women were associated with the prevalence of STIs. Low monthly income and not being in menopause were associated with a higher prevalence of STIs. Research quality and ethics statement This study was carried out according to the Declaration of Helsinki (1964), following the regulations set out in the Brazilian Resolution CNS/MS No. 466/2012 for human research. It was approved by the Ethics and Research Committee (CEP) of the Centro de Estudos Superiores de Caxias-UEMA, No. 2.867.682. The authors followed applicable EQUATOR Network guidelines during the conduction of this research project. Conflicts of interest There are no conflicts of interest. R EFERENCES 1. Wohlmeister D Vianna DR Helfer VE Gimenes F Consolaro ME Barcellos RB Association of human papillomavirus and Chlamydia trachomatis Mem Inst Oswaldo Cruz 2016 111 106 13 26841046 10.1590/0074-02760150330 PMC4750450 2. Korenromp EL Rowley J Alonso M Mello MB Wijesooriya NS Mahiané SG Global burden of maternal and congenital syphilis and associated adverse birth outcomes-estimates for 2016 and progress since 2012 PLoS One 2019 14 e0211720 30811406 10.1371/journal.pone.0211720 PMC6392238 3. Quaresma FR Maciel ED Barasuol AM Pontes-Silva A Fonseca FL Adami F Quality of primary health care for quilombolas’ afro-descendant in Brazil: A cross-sectional study Rev Assoc Med Bras (1992) 2022 68 482 9 35649071 10.1590/1806-9282.20210994 4. Barbosa MD Andrade de Souza IB Schnaufer EC Silva LF Maymone Gonçalves CC Simionatto S Prevalence and factors associated with Trichomonas vaginalis PLoS One 2020 15 e0240323 33064733 10.1371/journal.pone.0240323 PMC7567381 5. Warner ZC Reid B Auguste P Joseph W Kepka D Warner EL Awareness and knowledge of HPV, HPV vaccination, and cervical cancer among an indigenous Caribbean community Int J Environ Res Public Health 2022 19 5694 35565089 10.3390/ijerph19095694 PMC9105034 6. Riza E Karakosta A Tsiampalis T Lazarou D Karachaliou A Ntelis S Knowledge, attitudes and perceptions about cervical cancer risk, prevention and human papilloma virus (HPV) in vulnerable women in Greece Int J Environ Res Public Health 2020 17 6892 32967173 10.3390/ijerph17186892 PMC7559737 7. Raçi PZ Raçi F Hadri T Kosovo women’s knowledge and awareness of human papillomavirus (HPV) infection, HPV vaccination, and its relation to cervical cancer BMC Womens Health 2021 21 354 34627223 10.1186/s12905-021-01496-x PMC8502331 8. Dias JA Luciano TV Santos MC Musso C Zandonade E Spano LC Sexually transmissible infections in African-descendant women in maroon communities in Brazil: Prevalence and associated factors Cad Saude Publica 2021 37 e00174919 33624738 10.1590/0102-311X00174919 9. IBGE - Brazilian Institute of Geography and Statistics Demographic census 2022: First Results from the Quilombola Universe Ministry of Planning and Budget Rio de Janeiro 2023 48 10. Célia Barbosa Guedes A Nilo Lima da Silva F Historical, economic and social account of the quilombo of Santa Rita de Barreira, São Miguel do Guama, State of Pará, Brazil Res Soc Dev 2020 9 1 16 11. Passos TS Almeida-Santos MA Hora AB Oliveira CC Condom use and vulnerabilities to sexually transmitted infections in quilombola communities: A descriptive study, Sergipe, Brazil, 2016–2017 Epidemiol Serv Saude 2021 30 e2020617 33978128 10.1590/S1679-49742021000200011 12. Turner P Fox-Lewis A Shrestha P Dance DA Wangrangsimakul T Cusack TP Microbiology investigation criteria for reporting objectively (MICRO): A framework for the reporting and interpretation of clinical microbiology data BMC Med 2019 17 70 30922309 10.1186/s12916-019-1301-1 PMC6440102 13. Gharaibeh A Koppikar S Bonilla-Escobar FJ Strengthening the reporting of observational studies in epidemiology (STROBE) in the International Journal of Medical Students Int J Med Stud 2014 2 36 7 14. Lima LB de Melo AF Barbosa DR The quilombola territory in communities in the interior of northeastern Brazil: Characterization socioeconomic and structural Res Soc Dev 2021 10 e452101320899 15. de Ribamar Ross J Marinelli NP Vidal FC da Costa Fraga E do Desterro Soares Brandão Nascimento M Safádi MA Frequency of human papilomavirus and associated factors in gypsy and quilombola women: Human papillomavirus in gypsy and quilombola women BMC Womens Health 2023 23 160 37016349 10.1186/s12905-023-02239-w PMC10072018 16. Gravitt PE Peyton CL Alessi TQ Wheeler CM Coutlée F Hildesheim A Improved amplification of genital human papillomaviruses J Clin Microbiol 2000 38 357 61 10618116 10.1128/jcm.38.1.357-361.2000 PMC88724 17. Amorim AT Marques LM Campos GB Lobão TN de Souza Lino V Cintra RC Co-infection of sexually transmitted pathogens and human papillomavirus in cervical samples of women of Brazil BMC Infect Dis 2017 17 769 29246195 10.1186/s12879-017-2835-5 PMC5732421 18. Paula Almeida Cunha A Kassandra Pereira Belfort I Pedro Belfort Mendes F Rodrigues Bastos Dos Santos G Henrique de Lima Costa L de Matos Monteiro P Human papillomavirus and its association with other sexually transmitted coinfection among sexually active women from the Northeast of Brazil Interdiscip Perspect Infect Dis 2020 2020 8838317 33178264 10.1155/2020/8838317 PMC7647780 19. Kochergin CN Proietti FA César CC Slave-descendent communities in Vitória da Conquista, Bahia State, Brazil: Self-rated health and associated factors Cad Saude Publica 2014 30 1487 501 25166945 10.1590/0102-311x00141213 20. Pimentel Águas CL Folias and “congadas”: Memory and resistance in the narratives of Brazil’s quilombolas Topoi (Brazil) 2022 23 171 92 21. Fu L Sun Y Han M Wang B Xiao F Zhou Y Incidence trends of five common sexually transmitted infections excluding HIV from 1990 to 2019 at the global, regional, and national levels: Results from the Global Burden of Disease Study 2019 Front Med (Lausanne) 2022 9 851635 35308518 10.3389/fmed.2022.851635 PMC8924524 22. Bastos MQ Santos RV de Souza SM Rodrigues-Carvalho C Tykot RH Cook DC Isotopic study of geographic origins and diet of enslaved Africans buried in two Brazilian cemeteries J Archaeol Sci 2016 70 82 90 23. Monsell E McLuskey J Factors influencing STI transmission in middle-aged heterosexual individuals Br J Nurs 2016 25 676 80 27345071 10.12968/bjon.2016.25.12.676 24. Minkin MJ Sexually transmitted infections and the aging female: Placing risks in perspective Maturitas 2010 67 114 6 20541880 10.1016/j.maturitas.2010.05.003 25. Buunk AP Van Brummen-Girigori OJ Leckie GL Ethnic culture as related to sexual and reproductive behavior in the republic of Suriname: The pervasiveness of culture Arch Sex Behav 2021 50 3695 702 34427844 10.1007/s10508-021-02013-9 PMC8604846 ",
  "metadata": {
    "Title of this paper": "Ethnic culture as related to sexual and reproductive behavior in the republic of Suriname: The pervasiveness of culture",
    "Journal it was published in:": "Journal of Global Infectious Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494316/"
  }
}