{
  "title": "Paper_109",
  "abstract": "pmc Oncol Lett Oncol Lett 1736 onclett OL Oncology Letters 1792-1074 1792-1082 Spandidos Publications PMC12489531 PMC12489531.1 12489531 12489531 10.3892/ol.2025.15293 OL-30-6-15293 1 Corrigendum [Corrigendum] Characteristics of primary side population cervical cancer cells Wei Zhen-Tong Yu Xiao-Wei He Jia-Xue Liu Yan Zhang Song-Ling 12 2025 23 9 2025 30 6 498062 547 23 09 2025 03 10 2025 03 10 2025 Copyright: © 2025 Wei et al. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Characteristics of primary side population cervical cancer cells 14 3 18 7 2017 3536 3544 Oncology Letters 10.3892/ol.2017.6606 PMC5588017 28927110 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Oncol Lett 14: 3536–3544 Following the publication of the above article, the authors have contacted the Editor to explain that, in the originally published version of Fig. 6 Fig. 6 The revised version of Fig. 6 5 Fig. 6C Oncology Letters Figure 6. Tumorigenicity assay for SP and NSP cells isolated from patient primary cervical cancer cells. (A) Image of a mouse with a tumor developed following injection of 1×10 3 4 5 Figure 6. Tumorigenicity assay for SP and NSP cells isolated from patient primary cervical cancer cells. (A) Image of a mouse with a tumor developed following injection of 1×10 3 SP cells and NSP cell... ",
  "metadata": {
    "Title of this paper": "Characteristics of primary side population cervical cancer cells",
    "Journal it was published in:": "Oncology Letters",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489531/"
  }
}