{
  "title": "Paper_271",
  "abstract": "pmc Invest Ophthalmol Vis Sci Invest Ophthalmol Vis Sci 1229 iovs IOVS Investigative Ophthalmology & Visual Science 0146-0404 1552-5783 Association for Research in Vision and Ophthalmology PMC12489862 PMC12489862.1 12489862 12489862 41025873 10.1167/iovs.66.12.70 IOVS-25-43682 1 Retinal Cell Biology Retinal Cell Biology Novel Role of Copper Transporter CTR1 and Therapeutic Potential of Copper Chelators in Retinal Ischemia-Reperfusion Injury Cu Transporter CTR1 and Ischemic Retinopathy Yamamoto Mai  1  2 Ash Dipankar  1  3  4 Sudhahar Varadarajan  1  4  5 Zaidi Syed Adeel H.  1  2  3 Rojas Modesto A.  1  2  5 Xu Zhimin  1  2 Kelley Spears Stephanie  1 Caldwell Ruth B.  1  2  6 Fukai Tohru  1  4  5 Ushio-Fukai Masuko  1  3 1 2 3 4 5 6 # mfukai@augusta.edu Tohru Fukai, Vascular Biology Center, Department of Pharmacology and Toxicology, Medical College of Georgia, at Augusta University, at Augusta University, 1460 Laney-Walker Blvd., Augusta, GA 30912, USA; tfukai@augusta.edu * MUF and TF contributed equally to this study and should be considered co-senior authors. 30 9 2025 9 2025 66 12 496268 70 04 9 2025 21 5 2025 30 09 2025 03 10 2025 03 10 2025 Copyright 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License. Purpose Retinal ischemia contributes to vision loss in ischemic and diabetic retinopathies through oxidative stress, neurovascular injury, and inflammation. Copper (Cu), whereas an essential micronutrient, can be toxic in excess and is regulated by Cu transporters such as CTR1. However, the role of CTR1 in ischemic retinopathy remains unclear. Methods and Results Retinal ischemia-reperfusion (IR) injury was induced by elevating intraocular pressure (IOP) to 110 millimeters of mercury (mm Hg) for 40 minutes in the right eyes of Ctr1 heterozygous (Ctr1 +/− +/− +/− O 2 - +/− Conclusions CTR1 plays a central role in mediating Cu-dependent oxidative stress, neurovascular degeneration, and inflammation following retinal IR injury. Targeting the CTR1–Cu axis may represent a novel therapeutic strategy for ischemic retinopathy. ischemic retinopathy copper (Cu) copper transporter oxidative stress neurovascular damage pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Retinal ischemia is a major contributor of visual impairment and plays a key role in several retinal disorders, including glaucoma, diabetic retinopathy, age-related macular degeneration (AMD), and retinopathy of prematurity. 1 – 4 5 – 7 8 – 12 13 14 Copper (Cu) is an essential trace element that supports numerous physiological processes, including oxidative phosphorylation, iron metabolism, and the activity of Cu-dependent antioxidant enzymes. However, disruption of Cu homeostasis has been linked to various pathological conditions. 15 – 18 19 20 cuproptosis 21 18 , 22 We recently reported that Cu importer CTR1 expression are markedly increased in the hippocampus of a mouse model of Alzheimer's disease, as well as in brain endothelial cells (ECs) exposed to amyloid β42, which are associated with elevated Cu levels. 23 24 25 26 27 In this study, we demonstrate that the CTR1-Cu axis plays a critical role in promoting neurovascular injury and inflammation in response to retinal IR injury. Using Ctr1 +/− Materials and Methods Animal Study The use of mice was in accordance with the National Institutes of Health Guide for the Care and Use of Laboratory Animals and relevant ethical regulations. The animal protocol used in this study was approved by the institutional Animal Care committee and institutional Biosafety Committee of Augusta University. Mouse Retinal IR Injury Model and Tetrathiomolybdate Administration Both male and female Ctr1 +/− 24 14 , 28 – 30 Optical Coherence Tomography Mice were placed on the imaging platform of the Phoenix Micron III retinal imaging microscope, supplemented with an optical coherence tomography (OCT) imaging device (Phoenix Research Laboratories, Pleasanton, CA, USA). The eyes of mice were dilated with 1% tropicamide (Akron Pharmaceuticals, Lake Forest, IL, USA) and genteal gel was applied during imaging to keep the eye moist under ketamine/xylazine anesthesia. Retinal Thickness Measurement Retinal thickness was studied on retinal fresh frozen sections from mice on 7 days after the IR injury. Cross-sections with optic nerve attachment were prepared (7 µm) followed by hematoxylin and eosin (H&E) staining for morphological observation. Inner nuclear layer thicknesses at three different distances from the optic nerve head was determined using ImageJ software and averaged. Averaged retinal thickness was presented as a percentage compared with WT sham eyes. For this experiment, a total of nine WT mice, eight Ctr1 +/− Electroretinography for Visual Function A full scotopic electroretinogram (ERG) was recorded on day 7 post-IR, as previously described with some modification. 31 , 32 2 31 , 32 +/− Copper Measurements Cu contents were analyzed by inductively coupled plasma mass spectrometry (ICP-MS) using a PlasmaQuad3, as reported previously. 23 Dihydroethidium Staining for Detection of Superoxide Dihydroethidium (DHE) staining was used to evaluate superoxide (O 2 − +/− Immunofluorescence Cryostat sections with a thickness of 7 to 12 µm were used for immunofluorescence staining. Fresh frozen sections were used for GFAP staining, whereas sections fixed in 4% paraformaldehyde (PFA) and embedded in optimal cutting temperature compound were used for Ctr1 and Iba1 staining. To prepare the 4% PFA-fixed optimal cutting temperature sections, eyes were fixed overnight in 4% PFA at 4°C. The following day, the eyeballs were thoroughly washed in phosphate-buffered saline (PBS) and then incubated in 15% and 30% sucrose at 4°C for 1 hour for cryoprotection. After sucrose infiltration, the tissues were snap frozen in optimal cutting temperature compound. The sections were blocked in 10% normal goat serum for 1 hour to prevent nonspecific binding. The sections were subsequently incubated with primary antibodies overnight at 4°C ( Table 1 +/− Table 1. List of Antibodies Used in IF and Western Blot Antibody Company Catalog No Dilution Anti-CTR1 Homemade IF (1:100) WB (1:500) Anti-NeuN Sigma-aldrich ABN78 IF (1:300) Anti-Iba1 Wako 019-19741 IF (1:250) Anti-GFAP BD pharmingen 556330 IF (1:50) Goat anti-rabbit IgG (H+L), Alexa fluor 488 Thermo fisher scientific A-11008 IF (1:500) Goat anti-mouse IgG (H+L), Alexa fluor 488 Thermo fisher scientific A-11001 IF (1:500) Goat anti-mouse IgG1, Alexa fluor 488 Thermo fisher scientific A-21121 IF (1:400) Anti-beta actin Santa cruz sc-47778 WB (1:1000) Anti-NF-κB p65 Cell signaling 8242 WB (1:1000) Anti-phospho-NF-κB p65 (Ser536) Cell signaling 3033 WB (1:1000) Goat anti-mouse IgG (H+L)-HRP conjugate Bio-rad 1721011 WB (1:2000) Goat anti-rabbit IgG (H + L)-HRP conjugate Bio-rad 1706515 WB (1:2000) IF, immunofluorescence; WB, western blot. Tdt-dUTP Terminal Nick-End Labeling Staining for Apoptosis The DNA fragmentation of apoptotic cells was analyzed by terminal dUTP TUNEL assay (In Situ Cell Death Detection Kit, Fluorescein; MilliporeSigma, Burlington, MA, USA) following the manufacturer's instructions. The assay measures the fragmented DNA of apoptotic cells by catalytically incorporating fluorescein-12-dUTP at the 3′-OH DNA ends using the enzyme terminal deoxynucleotidyl transferase (TdT). Images were using a fluorescence microscope (Keyence, BZ-X700). For this experiment, a total of four WT mice, five Ctr1 +/− Evaluation of Neurodegeneration Using NeuN Staining Neuronal degeneration was assessed 7 days after IR injury, as described previously. 14 , 28 – 30 +/− +/− Retinal Vasculature Trypsin Digestion and Counting of Acellular Capillaries Eyeballs were isolated on day 14 after IR injury and fixed overnight in 4% PFA. The retinal vasculature was isolated by trypsin digestion as reported. 28 , 29 28 , 29 +/− Western Blot Analysis Retina protein extracts were prepared using RIPA buffer with added protease and phosphatase inhibitors. Protein (25–50 ug) were subjected to SDS-PAGE, transferred to nitrocellulose membranes, and blocked in 5% milk or 2% BSA. Membranes were incubated overnight at 4°C with primary antibodies (see Table 1 +/− Quantitative Real-Time PCR Total RNA was extracted from frozen retinal tissue using TRI Reagent (Molecular Research Center Inc., Cincinnati, OH, USA). Reverse transcription was carried out using the high-capacity cDNA reverse transcription kit (Applied Biosystems, Waltham, MA, USA) using 2 µg of total RNA. Quantitative PCR was performed with the SYBR Green PCR kit (Qiagen, Germantown, MD, USA) and ABI Prism 7000. The primer sequences for specific genes are shown in Table 2 +/− Table 2. Primer Sequences Used in qPCR Analysis Gene Primer Sequences  Ctr1 Forward-5′-ACCACCTCAGCCTCACACTC-3 Reverse-5′-TCTCGGGCTATCTTGAGTCC-3′  Nox1 Forward, 5′-CAGTTATTCATATCATTGCACACCTATTT-3′ Reverse, 5′-CAGAAGCGAGAGATCCATCCA-3′  Nox2 Forward, 5′-CAAGATGGAGGTGGGACAGT-3′ Reverse, 5′-GCTTATCACAGCCACAAGCA-3′  Nox4 Forward, 5′-TGTTGCATGTTTCAGGTGGT-3′ Reverse, 5′-AAAACCCTCGAGGCAAAGAT-3′  p22phox Forward, 5′-GCTCATCTGTCTGCTGGAGTATC-3′ Reverse, 5′-CGGACGTAGTAATTCCTGGTGAG-3′  p47phox Forward, 5′-GCTGACTACGAGAAGAGTTCGG-3′ Reverse, 5′-CCTCGCTTTGTCTTCATCTGGC-3′  Hprt Forward, 5′-CTGGTGAAAAGGACCTCTCGAAG-3′ Reverse, 5′-CCAGTTTCACTAATGACACAAACG-3′ Statistical Analysis All imaging and data quantification were performed in a blinded manner with respect to the experimental groups. Data are presented as mean ± SEM. Statistical tests were performed using Prism software version 9 (GraphPad Software, San Diego, CA, USA). Data were compared between groups of animals by a 2-tailed unpaired Student t n P P P Results CTR1 Expression and Cu Levels are Increased in the Retina After IR Injury To investigate the role of the Cu uptake transporter CTR1 in ischemic retinopathy, we utilized a mouse model of retinal IR injury. Mice were subjected to 40 minutes of ischemia on the right eye followed by reperfusion, whereas the left eye served as a sham control. 14 Fig. 1 Fig. 1 Fig. 1 Fig. 1 Supplementary Fig. S1 Figure 1. CTR1 protein expression and Cu levels are increased following retinal IR injury in mice. A n B Scale bar C n P Ctr1 +/− To investigate the role of endogenous CTR1 in retinal IR injury, we utilized heterozygous Ctr1 knockout mice (Ctr1 +/− 33 , 34 +/− Supplementary Fig. S2 28 +/− Fig. 2 Supplementary Fig. S3 19 , 27 +/− Fig. 2 Figure 2. Ctr1 +/− A +/− n B +/− r ed arrows 2 n C +/− n D +/− y ellow arrow P P P Scale bar Ctr1 +/− Retinal IR injury primarily affects the inner retinal layers including the GCL, inner plexiform layer (IPL), and inner nuclear layer (INL), resulting in significant thinning of the inner retina. 14 , 35 Fig. 2 +/− +/− Fig. 2 Ctr1 +/− To explore the mechanisms underlying reduced retinal cell death in Ctr1 +/− 8 , 36 +/− Fig. 3 Figure 3.  Ctr1 +/− A +/− n B +/− n C +/− n P P P Scale bar IR injury is also characterized by robust inflammatory responses. 8 , 36 , 37 +/− Fig. 3 38 , 39 +/− Fig. 3 Ctr1 +/− To evaluate the role of CTR1 on retinal function following IR injury, ERG was performed 7 days post-injury. 40 Figs. 4 4 +/− Figure 4.  Ctr1 +/− A 2 +/− B n P P Ctr1 +/− Oxidative stress mediated by NADPH oxidase is a critical factor in retinal IR injury. DHE staining showed a marked increase in O 2 - +/− Fig. 5 14 O 2 - Nox2 p22phox p47phox +/− Fig. 5 +/− Fig. 5 Figure 5.  Ctr1 +/− A 2 − +/− n P Scale bar B n C n P P P Cu Chelator TTM Treatment Protects Against Neurovascular Degeneration Following Retinal IR Injury To determine whether the protective effects observed in Ctr1 +/− Supplementary Fig. S2 Fig. 6 Supplementary Fig. S3 Fig. 6 Fig. 6 Fig. 6 Figure 6. Cu chelator TTM treatment protects against neurovascular degeneration following retinal IR injury. A n B r ed arrows 2 n C n D y ellow arrow P P P Scale bar Cu Chelator TTM Treatment Reduces Retinal Apoptosis and Inflammation Following IR Injury To further investigate the role of Cu in retinal cell death observed in Ctr1 +/− Fig. 7 Fig. 7 Fig. 7 Figure 7.  Cu chelator TTM treatment reduces retinal apoptosis and inflammation following IR injury. A n B n C n A–C P P P Scale bar Cu Chelator TTM Treatment Reduces Oxidative Stress Following Retinal IR Injury To investigate the mechanisms underlying protective effects of TTM, we evaluated retinal ROS production after IR injury. DHE staining demonstrated that TTM treatment markedly reduced O 2 - Fig. 8 +/− Figure 8.  Cu chelator TTM treatment attenuates oxidative stress following retinal IR i njury. A O 2 - n P P Scale bar B +/− Discussion Retinal IR injury is marked by oxidative stress, inflammation, neuronal loss, microvascular degeneration, and subsequent visual dysfunction; however, underlying molecular mechanisms remain unclear. Elevated Cu has been linked to retinal diseases, such as diabetic retinopathy and AMD, 19 , 20 15 25 , 41 +/− Degeneration of neurons in the GCL is a key feature of retinal injury following IR insult. 36 , 42 +/− 27 +/− 36 Glial activation is an early and critical event in retinal injury and has been closely linked to visual dysfunction in conditions such as IR injury, hypoxia, and diabetes. 43 , 44 43 , 45 +/− +/− Oxidative stress is a central driver of vascular degeneration, neuronal loss, and inflammation in the ischemic retina. Building on our prior work linking CTR1 to ROS production in brain microvascular ECs, 23 +/− 46 12 47 To assess the contribution of Cu to retinal IR pathology, we utilized the Cu chelator TTM in our retinal IR model. TTM is a small hydrophilic compound that chelates Cu with high specificity, which has been used in rodents and humans (for treatment of patients with Wilson disease who exhibit Cu toxicity and clinical trial for patients with cancer). 48 49 – 51 This study has several limitations. First, our temporal analysis of CTR1 expression and Cu levels was confined to the acute phase (up to 24 hours) after retinal IR injury. Although CTR1 expression was not elevated at days 2 and 7 post-injury, Cu levels were not examined at these later stages. Thus, we cannot rule out the possibility of delayed or secondary Cu elevation that could influence the chronic phase of retinal injury. Future studies including extended time points are needed to more fully define the temporal dynamics of CTR1-Cu signaling and their relationship to long-term retinal damage. Second, whereas our findings in Ctr1 +/− 52 In summary, our findings underscore the critical role of CTR1 and Cu in regulating oxidative stress, inflammation, and neurovascular degeneration during retinal IR injury, pointing to promising therapeutic opportunities. Cu chelation approaches, such as TTM treatment, may also hold potential for broader application in other ischemic and neurodegenerative disorders linked to oxidative stress and Cu imbalance. Future studies should evaluate the long-term impact of CTR1 modulation and Cu chelation on visual function and examine their possible synergy with current treatment strategies. Additionally, deeper investigation into the molecular pathways through which Cu interacts with other cellular signaling networks may further elucidate its role in retinal pathology. By identifying the CTR1-Cu axis as a viable therapeutic target, this work lays the groundwork for advancing novel treatments for ischemic retinal and neurovascular conditions. Supplementary Material Supplement 1 Supplement 2 Acknowledgments The authors thank Chihiro Nakata in Hiroshima University Medical School in Japan for assisting immunofluorescence and Western blotting analysis. Supported by National Institute of Health (NIH: https://grants.nih.gov/policy/federal-funding.htm  Author Contributions:  Data and Materials Availability: Disclosure: M. Yamamoto D. Ash V. Sudhahar S.A.H. Zaidi M.A. Rojas Z. Xu S. Kelley Spears R.B. Caldwell T. Fukai M. Ushio-Fukai References 1. Fortmann SD Grant MB. Molecular mechanisms of retinal ischemia Curr Opin Physiol 2019 7 41 48 34322649 10.1016/j.cophys.2018.12.008 PMC8315104 2. Osborne NN Casson RJ Wood JPM Chidlow G Graham M Melena J. Retinal ischemia: mechanisms of damage and potential therapeutic strategies Prog Retin Eye Res 2004 23 1 91 147 14766318 10.1016/j.preteyeres.2003.12.001 3. Cuenca N Fernández-Sánchez L Campello L et al Cellular responses following retinal injuries and therapeutic approaches for neurodegenerative diseases Prog Retin Eye Res 2014 43 17 75 25038518 10.1016/j.preteyeres.2014.07.001 4. Minhas G Sharma J Khan N. Cellular stress response and immune signaling in retinal ischemia-reperfusion injury Front Immunol 2016 7 444 27822213 10.3389/fimmu.2016.00444 PMC5075763 5. Hartsock MJ Cho H Wu L Chen WJ Gong J Duh EJ. A mouse model of retinal ischemia-reperfusion injury through elevation of intraocular pressure J Vis Exp 2016 113 54065 27501124 10.3791/54065 PMC5091361 6. D'Onofrio PM Koeberle PD What can we learn about stroke from retinal ischemia models? Acta Pharmacol Sin 2013 34 1 91 103 23202803 10.1038/aps.2012.165 PMC4086506 7. Garner MA Strickland RG Girkin CA Gross AK. Mechanisms of retinal ganglion cell injury following acute increases in intraocular pressure Front Ophthalmol (Lausanne) 2022 2 1007103 38983517 10.3389/fopht.2022.1007103 PMC11182138 8. Wei Y Gong J Yoshida T et al Nrf2 has a protective role against neuronal and capillary degeneration in retinal ischemia-reperfusion injury Free Radic Biol Med 2011 51 1 216 224 21545836 10.1016/j.freeradbiomed.2011.04.026 PMC3997112 9. Zhang F Lin B Huang S et al Melatonin alleviates retinal ischemia-reperfusion injury by inhibiting p53-mediated ferroptosis Antioxidants (Basel) 2023 12 6 1173 37371903 10.3390/antiox12061173 PMC10295547 10. Liu Y Tang L Chen B. Effects of antioxidant gene therapy on retinal neurons and oxidative stress in a model of retinal ischemia/reperfusion Free Radic Biol Med 2012 52 5 909 915 22240151 10.1016/j.freeradbiomed.2011.12.013 11. Pan H He M Liu R Brecha NC Yu AC Pu M. Sulforaphane protects rodent retinas against ischemia-reperfusion injury through the activation of the Nrf2/HO-1 antioxidant pathway PLoS One 2014 9 12 e114186 25470382 10.1371/journal.pone.0114186 PMC4254947 12. Ruan Y Jiang S Musayeva A Gericke A. Oxidative stress and vascular dysfunction in the retina: therapeutic strategies Antioxidants (Basel) 2020 9 8 761 32824523 10.3390/antiox9080761 PMC7465265 13. Rojas M Zhang W Xu Z et al Requirement of NOX2 expression in both retina and bone marrow for diabetes-induced retinal vascular injury PLoS One 2013 8 12 e84357 24358357 10.1371/journal.pone.0084357 PMC3866146 14. Yokota H Narayanan SP Zhang W et al Neuroprotection from retinal ischemia/reperfusion injury by NOX2 NADPH oxidase deletion Invest Ophthalmol Vis Sci 2011 52 11 8123 8131 21917939 10.1167/iovs.11-8318 PMC3208002 15. Kaplan JH Maryon EB. How mammalian cells acquire copper: an essential but potentially toxic metal Biophys J 2016 110 1 7 13 26745404 10.1016/j.bpj.2015.11.025 PMC4805867 16. Kim BE Nevitt T Thiele DJ. Mechanisms for copper acquisition, distribution and regulation Nat Chem Biol 2008 4 3 176 185 18277979 10.1038/nchembio.72 17. Festa RA Thiele DJ. Copper: an essential metal in biology Curr Biol 2011 21 21 R877 R883 22075424 10.1016/j.cub.2011.09.040 PMC3718004 18. Fukai T Ushio-Fukai M Kaplan JH. Copper transporters and copper chaperones: roles in cardiovascular physiology and disease Am J Physiol Cell Physiol 2018 315 2 C186 C201 29874110 10.1152/ajpcell.00132.2018 PMC6139499 19. Dascalu AM Anghelache A Stana D et al Serum levels of copper and zinc in diabetic retinopathy: potential new therapeutic targets (Review) Exp Ther Med 2022 23 5 324 35386624 10.3892/etm.2022.11253 PMC8972839 20. Aloysius Dhivya M Aberami S Nikhalashree S et al Copper mediates mitochondrial biogenesis in retinal pigment epithelial cells Biochim Biophys Acta Mol Basis Dis 2020 1866 10 165843 32454166 10.1016/j.bbadis.2020.165843 21. Tsvetkov P Coy S Petrova B et al Copper induces cell death by targeting lipoylated TCA cycle proteins Science 2022 375 6586 1254 1261 35298263 10.1126/science.abf0529 PMC9273333 22. Lutsenko S Roy S Tsvetkov P. Mammalian copper homeostasis: physiological roles and molecular mechanisms Physiol Rev 2025 105 1 441 491 39172219 10.1152/physrev.00011.2024 PMC11918410 23. Hossain MS Das A Rafiq AM et al Altered copper transport in oxidative stress-dependent brain endothelial barrier dysfunction associated with Alzheimer's disease Vascul Pharmacol 2024 157 107433 39317307 10.1016/j.vph.2024.107433 PMC11624991 24. Das A Ash D Fouda AY et al Cysteine oxidation of copper transporter CTR1 drives VEGFR2 signalling and angiogenesis Nat Cell Biol 2022 24 1 35 50 35027734 10.1038/s41556-021-00822-7 PMC8851982 25. Zimnicka AM Tang H Guo Q et al Upregulated copper transporters in hypoxia-induced pulmonary hypertension PLoS One 2014 9 3 e90544 24614111 10.1371/journal.pone.0090544 PMC3948681 26. Gomathy Narayanan I Saravanan R Bharathselvi M Biswas J Sulochana KN Localization of human copper transporter 1 in the eye and its role in Eales disease Ocul Immunol Inflamm 2016 24 6 678 683 26807780 10.3109/09273948.2015.1071404 27. Elner SG Elner VM Yoshida A Dick RD Brewer GJ. Effects of tetrathiomolybdate in a mouse model of retinal neovascularization Invest Ophthalmol Vis Sci 2005 46 1 299 303 15623788 10.1167/iovs.04-0180 28. Shosha E Xu Z Yokota H et al Arginase 2 promotes neurovascular degeneration during ischemia/reperfusion injury Cell Death Dis 2016 7 11 e2483 27882947 10.1038/cddis.2016.295 PMC5260867 29. Fouda AY Xu Z Shosha E et al Arginase 1 promotes retinal neurovascular protection from ischemia through suppression of macrophage inflammatory responses Cell Death Dis 2018 9 10 1001 30254218 10.1038/s41419-018-1051-6 PMC6156564 30. Shosha E Fouda AY Lemtalsi T et al Endothelial arginase 2 mediates retinal ischemia/reperfusion injury by inducing mitochondrial dysfunction Mol Metab 2021 53 101273 34139341 10.1016/j.molmet.2021.101273 PMC8274341 31. Ji K Li Z Lei Y et al Resveratrol attenuates retinal ganglion cell loss in a mouse model of retinal ischemia reperfusion injury via multiple pathways Exp Eye Res 2021 209 108683 34181937 10.1016/j.exer.2021.108683 32. Shahror RA Shosha E Morris C et al Deletion of myeloid HDAC3 promotes efferocytosis to ameliorate retinal ischemic injury J Neuroinflammation 2024 21 1 170 38997746 10.1186/s12974-024-03159-8 PMC11241909 33. Kuo YM Zhou B Cosco D Gitschier J. The copper transporter CTR1 provides an essential function in mammalian embryonic development Proc Natl Acad Sci USA 2001 98 12 6836 6841 11391004 10.1073/pnas.111057298 PMC34439 34. Lee J Prohaska JR Thiele DJ. Essential role for mammalian copper transporter Ctr1 in copper homeostasis and embryonic development Proc Natl Acad Sci USA 2001 98 12 6842 6847 11391005 10.1073/pnas.111058698 PMC34440 35. Rosenbaum DM Rosenbaum PS Gupta H et al The role of the p53 protein in the selective vulnerability of the inner retina to transient ischemia Invest Ophthalmol Vis Sci 1998 39 11 2132 2139 9761292 36. Zheng L Gong B Hatala DA Kern TS. Retinal ischemia and reperfusion causes capillary degeneration: similarities to diabetes Invest Ophthalmol Vis Sci 2007 48 1 361 367 17197555 10.1167/iovs.06-0510 37. Abcouwer SF Lin CM Shanmugam S Muthusamy A Barber AJ Antonetti DA. Minocycline prevents retinal inflammation and vascular permeability following ischemia-reperfusion injury J Neuroinflammation 2013 10 149 24325836 10.1186/1742-2094-10-149 PMC3866619 38. Dyer MA Cepko CL. Control of Müller glial cell proliferation and activation following retinal injury Nat Neurosci 2000 3 9 873 880 10966617 10.1038/78774 39. Rungger-Brändle E Dosso AA Leuenberger PM. Glial reactivity, an early feature of diabetic retinopathy Invest Ophthalmol Vis Sci 2000 41 7 1971 1980 10845624 40. Block F Schwarz M. The b-wave of the electroretinogram as an index of retinal ischemia Gen Pharmacol 1998 30 3 281 287 9510075 10.1016/s0306-3623(97)00359-5 41. White C Kambe T Fulcher YG et al Copper transport into the secretory pathway is regulated by oxygen in macrophages J Cell Sci 2009 122 Pt 9 1315 1321 19351718 10.1242/jcs.043216 PMC2671928 42. Lam TT Abler AS Tso MO. Apoptosis and caspases after ischemia-reperfusion injury in rat retina Invest Ophthalmol Vis Sci 1999 40 5 967 975 10102294 43. Lewis GP Fisher SK. Up-regulation of glial fibrillary acidic protein in response to retinal injury: its potential role in glial remodeling and a comparison to vimentin expression Int Rev Cytol 2003 230 263 290 14692684 10.1016/s0074-7696(03)30005-1 44. Gallego BI Salazar JJ de Hoz R et al IOP induces upregulation of GFAP and MHC-II and microglia reactivity in mice retina contralateral to experimental glaucoma J Neuroinflammation 2012 9 92 22583833 10.1186/1742-2094-9-92 PMC3410794 45. Wu KH Madigan MC Billson FA Penfold PL. Differential expression of GFAP in early v late AMD: a quantitative analysis Br J Ophthalmol 2003 87 9 1159 1166 12928288 10.1136/bjo.87.9.1159 PMC1771844 46. Kuo YM Gybina AA Pyatskowit JW Gitschier J Prohaska JR. Copper transport protein (Ctr1) levels in mice are tissue specific and dependent on copper status J Nutr 2006 136 1 21 26 16365053 10.1093/jn/136.1.21 PMC2718570 47. Anrather J Racchumi G Iadecola C. NF-kappaB regulates phagocytic NADPH oxidase by inducing the expression of gp91phox J Biol Chem 2006 281 9 5657 5667 16407283 10.1074/jbc.M506172200 48. Brewer GJ. Anticopper therapy against cancer and diseases of inflammation and fibrosis Drug Discov Today 2005 10 16 1103 1109 16182195 10.1016/S1359-6446(05)03541-5 49. Han D Kang SH Yoon CH Youn TJ Chae IH. Attenuation of ischemia-reperfusion injury by intracoronary chelating agent administration Sci Rep 2022 12 1 2050 35136090 10.1038/s41598-022-05479-2 PMC8825805 50. Borchard S Raschke S Zak KM et al Bis-choline tetrathiomolybdate prevents copper-induced blood-brain barrier damage Life Sci Alliance 2022 5 3 e202101164 34857647 10.26508/lsa.202101164 PMC8675913 51. Wei H Frei B Beckman JS Zhang WJ. Copper chelation by tetrathiomolybdate inhibits lipopolysaccharide-induced inflammatory responses in vivo Am J Physiol Heart Circ Physiol 2011 301 3 H712 H720 21724870 10.1152/ajpheart.01299.2010 PMC3191088 52. Chen GF Sudhahar V Youn SW et al Copper transport protein antioxidant-1 promotes inflammatory neovascularization via chaperone and transcription factor function Sci Rep 2015 5 14780 26437801 10.1038/srep14780 PMC4594038 ",
  "metadata": {
    "Title of this paper": "Copper transport protein antioxidant-1 promotes inflammatory neovascularization via chaperone and transcription factor function",
    "Journal it was published in:": "Investigative Ophthalmology & Visual Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489862/"
  }
}