{
  "title": "Paper_1076",
  "abstract": "RSC Med Chem RSC Med Chem 3795 rscmedchem MD RSC Medicinal Chemistry 2632-8682 Royal Society of Chemistry PMC12478454 PMC12478454.1 12478454 12478454 41030312 10.1039/d5md00616c d5md00616c 1 Chemistry Pan-cancer analysis reveals HMOX1 as a cancer prognosis and immune infiltration-related biomarker Men Yingli a † Wang Hui a † Xu Xiaoyan b Yang Miling b Feng Ruiting a Zhao Jizhi a Liu Ying a Yang Lu a Song Yinsen a https://orcid.org/0000-0001-9449-685X Ding Cong c  a Translational Medicine Research Center, The Fifth Clinical Medical College of Henan University of Chinese Medicine (Zhengzhou People's Hospital) Zhengzhou Henan China df13607670608@163.com  b Department of Pathology, The Fifth Clinical Medical College of Henan University of Chinese Medicine (Zhengzhou People's Hospital) Zhengzhou Henan China  c Respiratory and immune Diseases Laboratory, Children's Hospital Affiliated to Zhengzhou University 33 Longhu Waihuan East Road Zhengzhou Henan 450018 P.R. China dingcong8866@163.com † These authors contributed equally to this work. 29 9 2025 474398 14 7 2025 3 9 2025 29 09 2025 30 09 2025 01 10 2025 This journal is © The Royal Society of Chemistry 2025 RSC https://www.rsc.org/journals-books-databases/author-and-reviewer-hub/authors-information/licences-copyright-permissions/ This journal is © The Royal Society of Chemistry. You must request permission to use material from this article in other publications, see RSC reuse permissions guidance HMOX1 has gained increasing recognition across multiple malignancies; however, its precise oncogenic or tumor-suppressive roles remain incompletely defined. In this study, we comprehensively investigated HMOX1 across diverse tumor types utilizing the cancer genome atlas (TCGA). We further integrated data from multiple bioinformatics platforms, including TIMER2, UALCAN, GEPIA2, cBioPortal, R, GSCA, and LinkedOmics. Western blotting and quantitative real-time PCR (qRT-PCR) confirmed differential HMOX1 expression between normal renal epithelial cells and KIRC cells. Functional assays in vitro in vivo P P P −4 + ρ −8 ρ −13 in vitro in vivo This study performs a pan-cancer analysis of Heme oxygenase 1 (HMOX1) to examine its expression patterns, prognostic value, and therapeutic links in various cancers, with a focus on kidney renal clear cell carcinoma (KlRC). Henan Provincial Science and Technology Research Project 10.13039/501100017700 242102310121 242102310291 252102311178 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf yes pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes pubstatus Advance Article ",
  "metadata": {
    "Title of this paper": "Pan-cancer analysis reveals HMOX1 as a cancer prognosis and immune infiltration-related biomarker",
    "Journal it was published in:": "RSC Medicinal Chemistry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478454/"
  }
}