{
  "title": "Paper_10",
  "abstract": "pmc BMC Gastroenterol BMC Gastroenterol 30 bmcgast BMC Gastroenterology 1471-230X BMC PMC12495720 PMC12495720.1 12495720 12495720 41044492 10.1186/s12876-025-04295-y 4295 1 Research TPD52 promotes the proliferation and metastasis of gastric cancer cells Zhang Shunhao 1 Geng Zhixin 2 Sun Jian 1 Chen Nan 1 Liu Man 1 Wang Yuting 1 Gu Xinliang guxinliang1230@hotmail.com 3 Pei Bing sqpeibing@njmu.edu.cn 1 2 1 https://ror.org/059gcgy73 grid.89957.3a 0000 0000 9255 8984 Department of Laboratory Medicine, The Affiliated Suqian First People’s Hospital of Nanjing Medical University, 2 https://ror.org/04fe7hy80 grid.417303.2 0000 0000 9927 0537 The Suqian Clinical College of Xuzhou Medical University, 3 https://ror.org/059gcgy73 grid.89957.3a 0000 0000 9255 8984 General Clinical Research Center, Nanjing First Hospital, Nanjing Medical University, 3 10 2025 2025 25 478338 690 23 6 2025 2 9 2025 03 10 2025 05 10 2025 05 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Immunotherapy has improved outcomes for tumor patients, but only a small proportion benefits due to genetic and immunological resistance. Enhancing its efficacy is crucial. Tumor protein D52 (TPD52), a novel immune checkpoint expressed in T cells, B cells, and NK cells, plays a key role in immune regulation. This research aimed to investigate the prognostic value of TPD52 in gastric cancer (GC) and explore its biological functions. We analyzed the TCGA and GEO dataset to assess the transcriptional expression, prognostic significance, immune infiltration, and related biological functions of TPD52. Biological functions of TPD52 in GC cells were studied using CCK-8, colony formation, and transwell assays, while quantitative real-time PCR was used to assess TPD52 expression in the serum of GC patients. ROC analysis evaluated its diagnostic efficiency for GC. Results showed that TPD52 was dysregulated in most tumors and adjacent normal tissues, significantly impacting prognosis. TPD52 expression was strongly correlated with immune cell infiltration, tumor molecular subtypes, and immune checkpoint-regulated genes. Elevated TPD52 expression in GC cell lines promoted cell proliferation, migration, and invasion. Additionally, TPD52 levels were higher in the serum of GC patients, and their combination with CEA and CA199 enhanced its diagnostic efficiency for GC. In conclusion, TPD52 influences immune responses, immune cell infiltration, and tumor malignancy, making it a promising therapeutic target and biomarker for GC prognosis and immune infiltration. Supplementary Information The online version contains supplementary material available at 10.1186/s12876-025-04295-y. Keywords TPD52 Gastric cancer Prognosis Immune infiltration Biomarker Suqian Sci&Tech Program KY202311 Zhang Shunhao pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Currently, according to the data released by the International Agency for Research on Cancer, cancer has been a major public health problem worldwide, with its morbidity and mortality rates increasing year by year and gradually becoming the number one killer threatening human health [ 1 3 4 6 7 11 5 12 14 7 15 17 As a tumor-associated gene, tumor protein D52 (TPD52) is located on chromosome 8, q21.13, with a sequence of 80034745–80231232, and it is commonly genotyped with three genotypes, TPD52L1 (D53, hD53, TPD53), TPD52L2 (D54, hD54, TPD54), and TPD52L3 (D55, NYD-SP25, TPD55). It has been reported that TPD52 is highly expressed in a wide range of tumors and plays an important modulating role in the proliferation, apoptosis, and metastasis of tumor cells. For example, Kang et al. found that the high expression of TPD52 was clearly observed during the G2/M transition in breast cancer cells, and thus, TPD52 could be involved in the modulation of the tumor cell cycle [ 18 19 20 21 + 22 23 Materials and methods Patient samples Serum was collected from 60 pairs of GC patients and healthy donors between 20 November 2023 and 1 June 2024 at the Affiliated Suqian First People’s Hospital of Nanjing Medical University (Jiangsu, China). All patients were diagnosed by pathologists and did not undergo chemotherapy or radiotherapy before surgery. Approval for this research was granted by the Research Ethics Committee of the Affiliated Suqian First People’s Hospital of Nanjing Medical University, and informed consent was signed by the participants. Data source The Cancer Genome Atlas (TCGA) pan-cancer datasets were downloaded from the UCSC Cancer Genome Browser ( https://xenabrowser.net/datapages/ TPD52 and immune cell infiltration The Tumor Immune Estimation Resource (TIMER; http://timer.cistrome.org/ Cell culture AGS, HGC-27, MKN-45, and the GES-1 were acquired from the Cell Bank of the Chinese Academy of Sciences (Shanghai, China). All cell Lines were cultured in RPMI 1640 medium (Procell, Hubei, Wuhan, China), supplemented with 10% fetal bovine serum (Procell) and 1% penicillin and streptomycin. The culture medium was refreshed every two days, and the cells were Maintained in an incubator set at 37 °C with 5% CO2. Cell transfection The small interfering RNA (siRNA) of TPD52 (si-TPD52) were synthesized by GeneAdv (Huzhou, Zhejiang, China) and performed according to the manufacturer’s instructions. CCK-8 and clone formation assays Two days after cell transfection, 2000 cells were seeded per well in a 96-well plate. Once the cells adhered to the surface, 10 µL of CCK-8 reagent was added to each well. After a 2-hour incubation, absorbance at 450 nm was measured using a microplate reader. For the clone formation assays, 1000 transfected cells were seeded per well in a 6-well plate. The culture medium was replaced every 4 days to support normal cell growth for 2 weeks. Cells were then fixed with 1 mL of 4% paraformaldehyde for 12 h, stained with crystal violet for 10 min, washed with PBS, and photographed. Transwell assay The Transwell assay consisted of both migration and invasion assays. Cells were harvested 24–48 h post-transfection, and 50,000 cells were seeded per migration well, while 80,000 cells were seeded per invasion well. For migration, cells were uniformly seeded into a 24-well plate, while for invasion, cells were seeded into a 24-well plate pre-coated with Matrigel. The plates were then gently shaken and cultured at 37 °C with 5% CO2. After 48 h, cells were fixed with 4% paraformaldehyde for 12 h. After fixation, cells were stained with crystal violet for 10 min and photographed under a microscope. For quantification, three random fields from each sample were selected and counted using ImageJ software. Quantitative real-time PCR (qRT-PCR) Total RNA was extracted from the sample using TRIzol (Invitrogen Life Technology, USA) and diluted with 30 µL of nuclease-free water per sample. The RNA concentration was measured using the nanodrop method. Complementary DNA (cDNA) was obtained from total RNA using the RevertAid First Strand cDNA Synthesis Kit (K1622, Thermo Scientific, USA) by selecting the samples required for the reverse transcription reaction. A Mastercycler nexus PCR machine (Eppendorf, Germany) was used, and the following conditions were set: one cycle of 10 s at 95 °C (pre-denaturation), followed by 40 cycles of 10 s each at 95 °C, 30 s at 60 °C, and 30 s at 70 °C. The qRT-PCR primer sequences are provided in the Supplementary Table. GAPDH was selected as the internal reference, and the 2 –ΔΔCt Statistical analysis Four of the clinical survival types, including overall survival (OS), progression-free interval (PFI), disease-specific survival (DSS), and disease-free interval (DFI), were selected for this pan-cancer analysis. Kaplan-Meier (KM) survival curves, P-values, and hazard ratios (HR) at 95% confidence intervals (CIs) were derived by applying the Log-rank tests and Cox proportional hazards regression. Kyoto Encyclopedia of Genes and Genomes (KEGG) enrichment analysis was used to investigate the potential signaling pathways related to TPD52 expression and biological functions in GC. Tumor Immune Dysfunction and Exclusion (TIDE) was employed to investigate the efficacy of the TPD52 and ICIs combination on tumor patient prognosis. R language was used for all analyses, and P Results Expression landscape of TPD52 To explore the expression profile of TPD52 in human tissues, we evaluated the expression of TPD52 in various human tissues using the Human Protein Atlas (HPA) dataset. As shown in Fig. 1 1 1 1  Fig. 1 Expression profiles of TPD52 in human normal and tumor tissues. A B D E P P P P Differential expression of TPD52 notably affects the prognosis of tumor patients To investigate how TPD52 affects the prognosis of tumor patients, we used the TCGA dataset to analyze the relationship between TPD52 and the survival outcomes of tumor patients. Interestingly, aberrant expression of TPD52 significantly affected the prognosis of tumor patients. Cox regression modeling confirmed that high TPD52 expression in KIRC (HR = 0.78, 95% CI = 0.67–0.92, P P P P P P P P 2 1 P P P P P 2  Fig. 2 Kaplan-Meier and forest plots explore the effect of high and low expression of TPD52 on pan-cancer overall survival. A B G  Table 1 Exploring the effect of TPD52 expression on OS, PFI, DSS, and DFI in pan-cancer Cancer OS PFI DSS DFI HR HR(95%CI)  P HR HR(95%CI)  P HR HR(95%CI)  P HR HR(95%CI)  P ACC 0.88 0.73–1.05 0.15 0.94 0.79–1.11 0.45 0.87 0.72–1.04 0.13 0.95 0.71–1.27 0.71 BLCA 0.92 0.79–1.07 0.27 1.01 0.86–1.17 0.93 0.92 0.77–1.11 0.40 1.02 0.70–1.49 0.91 BRCA 1.26 1.08–1.47 3.8e-3 0.97 0.83–1.12 0.66 1.10 0.90–1.35 0.37 0.96 0.79–1.17 0.70 CESC 1.18 0.92–1.51 0.20 1.30 1.01,1.66 0.04 1.27 0.96–1.68 0.10 1.35 0.91–1.99 0.13 CHOL 0.84 0.53–1.33 0.45 0.89 0.59–1.34 0.59 0.85 0.52–1.36 0.49 0.73 0.42–1.28 0.27 COAD 0.84 0.60–1.16 0.29 0.80 0.59–1.08 0.15 0.77 0.49–1.20 0.25 0.72 0.37–1.39 0.33 DLBC 0.99 0.66–1.49 0.97 1.00 0.69–1.44 0.99 0.98 0.57–1.69 0.94 0.54 0.26–1.12 0.06 ESCA 1.05 0.85–1.30 0.64 1.03 0.84–1.27 0.77 0.98 0.75–1.27 0.87 0.73 0.46–1.18 0.21 GBM 0.96 0.79–1.15 0.62 1.07 0.88–1.30 0.50 0.96 0.79–1.18 0.71 0.87 0.55–1.38 0.55 HNSC 0.99 0.88–1.10 0.79 0.93 0.83–1.05 0.24 0.94 0.82–1.08 0.38 0.90 0.66–1.23 0.50 KICH 1.34 0.71–2.51 0.37 1.15 0.68–1.94 0.61 1.33 0.65–2.71 0.43 1.11 0.44–2.80 0.82 KIRC 0.78 0.67–0.92 3.0e-3 0.87 0.73–1.03 0.10 0.72 0.60–0.87 8.4e-4 1.29 0.68–2.47 0.44 KIRP 1.64 1.25–2.13 2.8e-4 1.44 1.14–1.80 1.9e-3 2.16 1.55–3.01 5.6e-6 1.59 1.09–2.32 0.01 LGG 1.21 0.99–1.49 0.07 1.09 0.92–1.28 0.32 1.16 0.93–1.44 0.20 0.84 0.52–1.35 0.47 LIHC 1.21 1.03–1.42 0.02 1.12 0.99–1.28 0.08 1.17 0.96–1.43 0.12 1.10 0.95–1.27 0.22 LUAD 1.02 0.87–1.20 0.76 1.01 0.87–1.17 0.90 1.03 0.84–1.25 0.78 1.09 0.87–1.37 0.44 LUSC 1.05 0.89–1.24 0.56 1.02 0.84–1.24 0.82 1.00 0.77–1.28 0.97 1.44 1.05–1.98 0.02 MESO 0.89 0.69–1.14 0.36 0.91 0.69–1.20 0.52 0.87 0.64–1.18 0.36 0.79 0.28–2.26 0.66 OV 0.92 0.82–1.05 0.22 0.91 0.82–1.02 0.11 0.91 0.80–1.03 0.13 0.97 0.76–1.24 0.81 PAAD 0.98 0.80–1.19 0.84 0.86 0.71–1.05 0.14 0.96 0.77–1.19 0.68 0.87 0.58–1.32 0.52 PCPG 1.14 0.43–3.06 0.79 0.69 0.45–1.04 0.08 0.89 0.30–2.59 0.83 0.56 0.25–1.22 0.15 PRAD 1.30 0.62–2.75 0.49 1.03 0.81–1.32 0.78 1.58 0.52–4.77 0.42 1.13 0.73–1.74 0.57 READ 0.61 0.34–1.10 0.10 0.99 0.53–1.86 0.99 1.15 0.28–4.63 0.85 0.16 0.02–1.22 0.08 SARC 0.98 0.87–1.09 0.68 1.02 0.92–1.12 0.74 1.04 0.91–1.17 0.58 0.96 0.83–1.10 0.54 SKCM 1.02 0.82–1.28 0.85 1.20 0.94–1.54 0.13 1.07 0.82–1.39 0.63 0.79 0.28–2.26 0.66 STAD 0.95 0.81–1.12 0.53 0.95 0.80–1.13 0.57 0.93 0.75–1.14 0.47 0.88 0.64–1.21 0.44 TGCT 1.15 0.35–3.78 0.82 1.00 0.69–1.43 0.98 0.78 0.21–2.92 0.72 0.92 0.82–1.05 0.22 THCA 1.26 0.63–2.49 0.51 1.06 0.72–1.56 0.76 0.84 0.33–2.14 0.72 1.09 0.64–1.85 0.76 THYM 1.66 0.93–2.95 0.07 1.25 0.91–1.72 0.17 1.44 0.67–3.08 0.34 1.19 0.86–1.64 0.29 UCEC 1.19 0.86–1.64 0.29 1.22 0.92–1.61 0.17 1.38 0.92–2.09 0.12 1.26 0.82–1.94 0.29 UVM 1.25 1.03–1.51 0.02 1.17 0.99–1.39 0.07 1.32 1.07–1.63 7.7e-3 0.61 0.34–1.10 0.10 TPD52 expression is associated with immune infiltration in TME To understand the relationship between TPD52 expression and immune cell infiltration in tumor microenvironment (TME), we estimated the proportion of immune cells using the TCGA pan-cancer dataset with multiple algorithms, including CIRBERSORT, TIMER, and MCPCOUNTER. The results showed that TPD52 expression was negatively correlated with the infiltration of some immune cells, including CD8 + P P P 3 4 3  Fig. 3 Relationship of TPD52 expression with tumor purity and immune cell infiltration. A B P P P P C  Fig. 4 Correlation of TPD52 expression with CD8 + TPD52 is differentially expressed in tumor molecular and immune subtypes Next, we explored the mRNA expression pattern of TPD52 in different molecular subtypes and immune subtypes. Surprisingly, in different molecular subtypes of ESCA, STAD, and COAD, such as Chromosomal instability (CIN), Epstein-Barr virus (EBV), Genetically stabilized (GS), Microsatellite instability (MSI), Hypermutation-SNV (HM-SNV) and Hypermutation-indel (HM-indel) [ 24 25 5 25 28 5 25  Fig. 5 Expression of TPD52 mRNA in different molecular subtypes and immune subtypes of ESCA, STAD, and COAD was analyzed using TISIDB Correlation analysis of TPD52 with checkpoint gene markers To further explore the potential mechanisms of immune suppression of TPD52 signaling, we investigated the association of TPD52 mRNA expression with multiple immune checkpoint markers in different tumor types using the TCGA dataset, including Chemokine, Receptor, MHC, Immunity inhibitor, and Immunity stimulator. We found that TPD52 expression was positively correlated with the expression of BTLA, LAG3, PDCD1 (PD-1), CD274 (PD-L1), CTLA4, and TIGIT in a wide range of tumor types. Interestingly, in poor prognostic tumors, TPD52 seems positively correlated with TNFRSF4 and TNFRSF25 in ESCA and STAD. In contrast, this correlation seems weak or negative in good prognostic tumors (SKCM, BLCA) (Fig. 6 + + 29 P P 7 P  Fig. 6 Correlation of TPD52 expression with immune checkpoint gene expression in multiple tumors  Fig. 7 High expression of TPD52 predicts the favorable efficacy of ICIs in SKCM and BLCA TPD52 can promote the proliferation, migration and invasion of GC cells To explore whether TPD52 regulates GC progression, we first detected the expression level of TPD52 in GC cells. The results of qRT-PCR showed that the expression levels of TPD52 in AGS, HGC-27, and MKN-45 were significantly increased (Fig. 8 8 8 8  Fig. 8 TPD52 can promote the proliferation, migration and invasion of GC cells. A B C E F Expression level and diagnostic value of serum TPD52 in GC We then investigated the expression level and diagnostic role of serum TPD52 in GC to confirm whether TPD52 can be utilized as an emerging diagnostic marker. We examined the expression of TPD52 in 60 pairs of serum from GC patients and healthy donors using qRT-PCR. The results showed smooth single-peak melting curves indicating high stability and specificity of TPD52 and significantly higher expression of TPD52 mRNA in serum from GC patients relative to healthy donors ( P 9 https://www.proteinatlas.org/ 9 P P P 9 P 9  Fig. 9 Expression level of serum TPD52 in GC and diagnostic value. A B C n P D E F Functional analysis of gene set enrichment involving TPD52 in GC Finally, we explored the potential mechanism of TPD52 involved in GC development. Firstly, we analyzed the Top50 genes positively or negatively correlated with TPD52 expression in GC by GSEA and then predicted the molecular pathways in which TPD52 might be involved. We found that TPD52 was positively correlated with the CDH17 gene in GC ( P 10 30 10  Fig. 10 Functional analysis of gene set enrichment involved in TPD52 in GC. A B C Discussion Our current work elucidates the workflow of TPD52 pan-cancer analysis and delves into the role of TPD52 in multiple tumors. First of all, we assessed the expression of TPD52 in multiple tumor types by employing the TCGA dataset. We were surprised to find significant variability in the expression of TPD52 in tumor and normal tissues. Furthermore, the expression of TPD52 was significantly higher in ESCA, COAD, and STAD than in paracancerous tissues but significantly lower in KIRP, SCKM, and KICH. Secondly, the differential expression of TPD52 also significantly affected the prognosis of tumor patients, and representative K-M survival curves showed that high expression of TPD52 had a better prognosis in BLCA and SKCM; on the contrary, high expression of TPD52 had a worse prognosis in ESCA and STAD. Notably, poor prognosis may be associated with cancer-associated fibroblasts (CAFs) in the TME.CAFs have a variety of pro-tumorigenic functions and play a crucial role in drug resistance through several mechanisms, including extracellular matrix remodeling, production of growth factors, cytokines, and chemokines, and regulation of metabolism and angiogenesis. Thus, specific CAF subpopulations modulate the immunosuppressive microenvironment characterized by immune cell evasion [ 31 34 Meanwhile, the expression of TPD52 in clinicopathologic stages and molecular immune subtypes was similarly significant and differentiated. TPD52 was most highly expressed in the C2 (IFN-γ dominant) subtypes of STAD and COAD and the C4 (lymphocyte depleted) subtype of ESCA. Wang et al. found that the genotyping of TPD52, TPD52L2 was up-regulated in colorectal cancer and was significantly associated with poor prognosis of colorectal cancer. Thus, TPD52L2 is expected to be a potentially valuable immunotherapy and efficacy assessment target [ 35 26 36 Furthermore, the function of a gene is usually achieved through the cooperation of genes that co-express and interact with it, and TME plays a crucial role in tumor progression through complex molecular interactions [ 35 37 38 41 42 43 38 39 40 Overall, this research identified that TPD52 may be involved in tumor development, chemotherapy resistance, and recurrent metastasis by modulating the malignant biological behavior of tumor cells and infiltration of immune cells and is an independent diagnostic risk factor affecting the prognosis of tumor patients. More interestingly, we also discovered that TPD52 may have a synergistic effect with existing immune checkpoint inhibitors (anti-PD-1, anti-PD-L1, anti-CTLA-4), thus helping personalized diagnosis and treatment of tumor patients, and is expected to be an emerging biomarker. However, we have identified some limitations in this research. Firstly, the research utilized a limited number of gastric cancer cell lines, which rendered the research insufficiently rigorous. Additionally, it is necessary to further confirm the immunomodulatory role of TPD52 in the tumor microenvironment through in vivo functional experiments such as oxaliplatin, decitabine, or anti-PD-1 combination therapy [ 44 47 Conclusions TPD52 was involved in multiple immune responses, influenced immune cell infiltration, and affected the malignant properties of multiple tumors. We found that TPD52 was significantly differentially expressed in gastrointestinal tissues through the TCGA dataset and could effectively influence the prognosis of tumor patients. Elevated TPD52 expression in GC cell lines promoted cell proliferation, migration, and invasion. qRT-PCR detection of TPD52 expression in serum in conjunction with the tumor markers CEA and CA199 could effectively improve the diagnosis of GC. Thus, it can be utilized as a potential clinical therapeutic target and biomarker to determine the prognosis and immune infiltration of GC patients. Supplementary Information  Supplementary Material 1. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Shunhao Zhang, Zhixin Geng and Jian Sun contributed equally to this work. Acknowledgements This research is greatly grateful to Professor Xudong Wang of the Affiliated Hospital of Nantong University for his guidance. Authors’ contributions Z.S., G.Z., and S.J participated in collecting and arranging data and pictures. Z.S wrote and edited the manuscript. C.N., L.M., and W.Y. were involved in data analysis and reference collection. G.X. and P.B. provided the resource and critically revised the intellectual content of the manuscript. All authors read and approved the final manuscript. Funding This research is supported by the Suqian Sci&Tech Program (Grant No. KY202311 Data availability All study-related data are included in the article or uploaded as supplementary information. Additional inquiries should be directed to the corresponding author. Declarations Ethics approval and consent to participate This research was conducted in accordance with the principles outlined in the Declaration of Helsinki. The protocol of this study was approved by the institutional ethics commission of the Affiliated Suqian First People’s Hospital of Nanjing Medical University, and all participants wrote informed consent (2024-SL-0063). Consent for publication All authors have provided their consent for publication. Competing interests The authors declare no competing interests. References 1. Siegel RL Miller KD Wagle NS Jemal A Cancer statistics, 2023 CA Cancer J Clin 2023 73 17 48 36633525 10.3322/caac.21763 Siegel RL, Miller KD, Wagle NS, Jemal A. Cancer statistics, 2023. CA Cancer J Clin. 2023;73:17–48. 36633525 10.3322/caac.21763 2. Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 209 49 33538338 10.3322/caac.21660 Sung H, Ferlay J, Siegel RL, Laversanne M, Soerjomataram I, Jemal A, et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71:209–49. 33538338 10.3322/caac.21660 3. Siegel RL Giaquinto AN Jemal A Cancer statistics, 2024 CA Cancer J Clin 2024 74 12 49 38230766 10.3322/caac.21820 Siegel RL, Giaquinto AN, Jemal A. Cancer statistics, 2024. CA Cancer J Clin. 2024;74:12–49. 38230766 10.3322/caac.21820 4. Katsikis PD Ishii KJ Schliehe C Challenges in developing personalized neoantigen cancer vaccines Nat Rev Immunol 2024 24 213 27 10.1038/s41577-023-00937-y 37783860 PMC12001822 Katsikis PD, Ishii KJ, Schliehe C. Challenges in developing personalized neoantigen cancer vaccines. Nat Rev Immunol. 2024;24:213–27. 37783860 10.1038/s41577-023-00937-y PMC12001822 5. Tjader NP Toland AE Immunotherapy for colorectal cancer: insight from inherited genetics Trends Cancer 2024 10.1016/j.trecan.2024.01.008 38360438 PMC11096082 Tjader NP, Toland AE. Immunotherapy for colorectal cancer: insight from inherited genetics. Trends Cancer. 2024. 10.1016/j.trecan.2024.01.008. 38360438 10.1016/j.trecan.2024.01.008 PMC11096082 6. Liu Y Yan Q Zeng Z Fan C Xiong W Advances and prospects of mRNA vaccines in cancer immunotherapy Biochimica et Biophysica Acta (BBA) 2024 1879 189068 10.1016/j.bbcan.2023.189068 38171406 Liu Y, Yan Q, Zeng Z, Fan C, Xiong W. Advances and prospects of mRNA vaccines in cancer immunotherapy. Biochimica et Biophysica Acta (BBA). 2024;1879:189068. 10.1016/j.bbcan.2023.189068 38171406 7. Huseni MA Wang L Klementowicz JE Yuen K Breart B Orr C CD8(+) T cell-intrinsic IL-6 signaling promotes resistance to anti-PD-L1 immunotherapy Cell Rep Med 2023 4 100878 10.1016/j.xcrm.2022.100878 36599350 PMC9873827 Huseni MA, Wang L, Klementowicz JE, Yuen K, Breart B, Orr C, et al. CD8(+) T cell-intrinsic IL-6 signaling promotes resistance to anti-PD-L1 immunotherapy. Cell Rep Med. 2023;4:100878. 36599350 10.1016/j.xcrm.2022.100878 PMC9873827 8. Sharma P Goswami S Raychaudhuri D Siddiqui BA Singh P Nagarajan A Immune checkpoint therapy-current perspectives and future directions Cell 2023 186 1652 69 10.1016/j.cell.2023.03.006 37059068 Sharma P, Goswami S, Raychaudhuri D, Siddiqui BA, Singh P, Nagarajan A, et al. Immune checkpoint therapy-current perspectives and future directions. Cell. 2023;186:1652–69. 37059068 10.1016/j.cell.2023.03.006 9. Wang DX Long JY Li RZ Zhang DL Liu H Liu J Mutation status of the KMT2 family associated with immune checkpoint inhibitors (ICIs) therapy and implicating diverse tumor microenvironments Mol Cancer 2024 23 15 10.1186/s12943-023-01930-8 38225603 PMC10789049 Wang DX, Long JY, Li RZ, Zhang DL, Liu H, Liu J, et al. Mutation status of the KMT2 family associated with immune checkpoint inhibitors (ICIs) therapy and implicating diverse tumor microenvironments. Mol Cancer. 2024;23:15. 38225603 10.1186/s12943-023-01930-8 PMC10789049 10. Wang X Yang K Yang Y Wang X Yuan K Immunotherapy rechallenge of advanced lung adenocarcinoma with cadonilimab (PD-1/CTLA-4 bi-specific antibody): a case report Anticancer Drugs 2024 35 288 91 10.1097/CAD.0000000000001557 37982205 Wang X, Yang K, Yang Y, Wang X, Yuan K. Immunotherapy rechallenge of advanced lung adenocarcinoma with cadonilimab (PD-1/CTLA-4 bi-specific antibody): a case report. Anticancer Drugs. 2024;35:288–91. 37982205 10.1097/CAD.0000000000001557 11. Eylemer Mocan E Yekedüz E Karataş G Yazgan SC Köksoy EB Çay Şenler F Utkan G Demirkazik A Akbulut H Ürün Y Impact of antihistamine use on the survival outcomes of immune checkpoint inhibitors in advanced cancer patients Anticancer Drugs 2024 35 190 4 10.1097/CAD.0000000000001498 38018837 Eylemer Mocan E, Yekedüz E, Karataş G, Yazgan SC, Köksoy EB, Çay Şenler F, Utkan G, Demirkazik A, Akbulut H, Ürün Y. Impact of antihistamine use on the survival outcomes of immune checkpoint inhibitors in advanced cancer patients. Anticancer Drugs. 2024;35:190–4. 38018837 10.1097/CAD.0000000000001498 12. Liu C Liu R Wang B Lian J Yao Y Sun H Zhang C Fang L Guan X Shi J Blocking IL-17A enhances tumor response to anti-PD-1 immunotherapy in microsatellite stable colorectal cancer J Immunother Cancer 2021 9 e001895 10.1136/jitc-2020-001895 33462141 PMC7813395 Liu C, Liu R, Wang B, Lian J, Yao Y, Sun H, Zhang C, Fang L, Guan X, Shi J, et al. Blocking IL-17A enhances tumor response to anti-PD-1 immunotherapy in microsatellite stable colorectal cancer. J Immunother Cancer. 2021;9:e001895. 33462141 10.1136/jitc-2020-001895 PMC7813395 13. Wang X Zhou T Chen X Wang Y Ding Y Tu H System analysis based on the cancer-immunity cycle identifies ZNF207 as a novel immunotherapy target for hepatocellular carcinoma J Immunother Cancer 2022 10.1136/jitc-2021-004414 35246476 PMC8900045 Wang X, Zhou T, Chen X, Wang Y, Ding Y, Tu H, et al. System analysis based on the cancer-immunity cycle identifies ZNF207 as a novel immunotherapy target for hepatocellular carcinoma. J Immunother Cancer. 2022. 10.1136/jitc-2021-004414. 35246476 10.1136/jitc-2021-004414 PMC8900045 14. Cosso F Lavacchi D Messerini L Briganti V Castiglione F Brugia M Pathological complete response achieved with FLOT chemotherapy in two patients with MSI-H esophagogastric junction and gastric adenocarcinoma Anticancer Drugs 2024 10.1097/CAD.0000000000001652 39119711 PMC11634140 Cosso F, Lavacchi D, Messerini L, Briganti V, Castiglione F, Brugia M, et al. Pathological complete response achieved with FLOT chemotherapy in two patients with MSI-H esophagogastric junction and gastric adenocarcinoma. Anticancer Drugs. 2024. 10.1097/CAD.0000000000001652. 39119711 10.1097/CAD.0000000000001652 PMC11634140 15. Wu Q Yue X Liu H Zhu Y Ke H Yang X Map7d2 reduces CD8(+) cytotoxic T lymphocyte infiltration through MYH9-HMGB1 axis in colorectal cancer Mol Ther 2023 31 90 104 10.1016/j.ymthe.2022.09.001 36081350 PMC9840115 Wu Q, Yue X, Liu H, Zhu Y, Ke H, Yang X, et al. Map7d2 reduces CD8(+) cytotoxic T lymphocyte infiltration through MYH9-HMGB1 axis in colorectal cancer. Mol Ther. 2023;31:90–104. 36081350 10.1016/j.ymthe.2022.09.001 PMC9840115 16. Cui A Huang T Li S Ma A Pérez JL Sander C Dictionary of immune responses to cytokines at single-cell resolution Nature 2024 625 377 84 10.1038/s41586-023-06816-9 38057668 PMC10781646 Cui A, Huang T, Li S, Ma A, Pérez JL, Sander C, et al. Dictionary of immune responses to cytokines at single-cell resolution. Nature. 2024;625:377–84. 38057668 10.1038/s41586-023-06816-9 PMC10781646 17. Vivier E Rebuffet L Narni-Mancinelli E Cornen S Igarashi RY Fantin VR Natural killer cell therapies Nature 2024 626 727 36 10.1038/s41586-023-06945-1 38383621 Vivier E, Rebuffet L, Narni-Mancinelli E, Cornen S, Igarashi RY, Fantin VR. Natural killer cell therapies. Nature. 2024;626:727–36. 38383621 10.1038/s41586-023-06945-1 18. Kang JW Kim Y Lee Y Myung K Kim YH Oh CK AML poor prognosis factor, TPD52, is associated with the maintenance of haematopoietic stem cells through regulation of cell proliferation J Cell Biochem 2021 122 403 12 10.1002/jcb.29869 33166425 Kang JW, Kim Y, Lee Y, Myung K, Kim YH, Oh CK. AML poor prognosis factor, TPD52, is associated with the maintenance of haematopoietic stem cells through regulation of cell proliferation. J Cell Biochem. 2021;122:403–12. 33166425 10.1002/jcb.29869 19. Roslan N Bièche I Bright RK Lidereau R Chen Y Byrne JA TPD52 represents a survival factor in ERBB2-amplified breast cancer cells Mol Carcinog 2014 53 807 19 10.1002/mc.22038 23661506 Roslan N, Bièche I, Bright RK, Lidereau R, Chen Y, Byrne JA. TPD52 represents a survival factor in ERBB2-amplified breast cancer cells. Mol Carcinog. 2014;53:807–19. 23661506 10.1002/mc.22038 20. Jiang X Peng J Xie Y Xu Y Liu Q Cheng C Oxoglutarate dehydrogenase-like inhibits the progression of hepatocellular carcinoma by inducing DNA damage through non-canonical function Cell Death Differ 2023 30 1931 42 10.1038/s41418-023-01186-1 37419985 PMC10406884 Jiang X, Peng J, Xie Y, Xu Y, Liu Q, Cheng C, et al. Oxoglutarate dehydrogenase-like inhibits the progression of hepatocellular carcinoma by inducing DNA damage through non-canonical function. Cell Death Differ. 2023;30:1931–42. 37419985 10.1038/s41418-023-01186-1 PMC10406884 21. Fan Y Hou T Gao Y Dan W Liu T Liu B Acetylation-dependent regulation of TPD52 isoform 1 modulates chaperone-mediated autophagy in prostate cancer Autophagy 2021 17 4386 400 10.1080/15548627.2021.1917130 34034634 PMC8726735 Fan Y, Hou T, Gao Y, Dan W, Liu T, Liu B, et al. Acetylation-dependent regulation of TPD52 isoform 1 modulates chaperone-mediated autophagy in prostate cancer. Autophagy. 2021;17:4386–400. 34034634 10.1080/15548627.2021.1917130 PMC8726735 22. Elizondo CR Bright JD Bright RK Vaccination with a shared oncogenic tumor-self antigen elicits a population of CD8 + T cells with a regulatory phenotype Hum Vaccin Immunother 2022 18 2108656 10.1080/21645515.2022.2108656 36069634 PMC9746449 Elizondo CR, Bright JD, Bright RK. Vaccination with a shared oncogenic tumor-self antigen elicits a population of CD8 + T cells with a regulatory phenotype. Hum Vaccin Immunother. 2022;18:2108656. 36069634 10.1080/21645515.2022.2108656 PMC9746449 23. Elizondo CR Bright JD Byrne JA Bright RK Analysis of the CD8 + IL-10 + T cell response elicited by vaccination with the oncogenic tumor-self protein D52 Hum Vaccin Immunother 2020 16 1413 23 10.1080/21645515.2019.1689746 31769704 PMC7482783 Elizondo CR, Bright JD, Byrne JA, Bright RK. Analysis of the CD8 + IL-10 + T cell response elicited by vaccination with the oncogenic tumor-self protein D52. Hum Vaccin Immunother. 2020;16:1413–23. 31769704 10.1080/21645515.2019.1689746 PMC7482783 24. Liu Y Sethi NS Hinoue T Schneider BG Cherniack AD Sanchez-Vega F Seoane JA Farshidfar F Bowlby R Islam M Comparative molecular analysis of Gastrointestinal adenocarcinomas Cancer Cell 2018 33 721 e735728 10.1016/j.ccell.2018.03.010 29622466 PMC5966039 Liu Y, Sethi NS, Hinoue T, Schneider BG, Cherniack AD, Sanchez-Vega F, Seoane JA, Farshidfar F, Bowlby R, Islam M, et al. Comparative molecular analysis of Gastrointestinal adenocarcinomas. Cancer Cell. 2018;33:721–e735728. 29622466 10.1016/j.ccell.2018.03.010 PMC5966039 25. Yue T Liu X Zuo S Zhu J Li J Liu Y Chen S Wang P BCL2A1 and CCL18 are predictive biomarkers of cisplatin chemotherapy and immunotherapy in colon cancer patients Front Cell Dev Biol 2021 9 799278 10.3389/fcell.2021.799278 35265629 PMC8898943 Yue T, Liu X, Zuo S, Zhu J, Li J, Liu Y, et al. BCL2A1 and CCL18 are predictive biomarkers of cisplatin chemotherapy and immunotherapy in colon cancer patients. Front Cell Dev Biol. 2021;9:799278. 35265629 10.3389/fcell.2021.799278 PMC8898943 26. Shen X Wu S Zhang J Li M Xu F Wang A Wild–type IDH1 affects cell migration by modulating the PI3K/AKT/mTOR pathway in primary glioblastoma cells Mol Med Rep 2020 22 1949 57 10.3892/mmr.2020.11250 32705169 PMC7411459 Shen X, Wu S, Zhang J, Li M, Xu F, Wang A, et al. Wild–type IDH1 affects cell migration by modulating the PI3K/AKT/mTOR pathway in primary glioblastoma cells. Mol Med Rep. 2020;22:1949–57. 32705169 10.3892/mmr.2020.11250 PMC7411459 27. Huang B Chen Q Ye Z Zeng L Huang C Xie Y Construction of a matrix cancer-associated fibroblast signature gene-based risk prognostic signature for directing immunotherapy in patients with breast cancer using single-cell analysis and machine learning Int J Mol Sci 2023 10.3390/ijms241713175 37685980 PMC10487765 Huang B, Chen Q, Ye Z, Zeng L, Huang C, Xie Y, et al. Construction of a matrix cancer-associated fibroblast signature gene-based risk prognostic signature for directing immunotherapy in patients with breast cancer using single-cell analysis and machine learning. Int J Mol Sci. 2023. 10.3390/ijms241713175. 37685980 10.3390/ijms241713175 PMC10487765 28. Dong QT Ma DD Gong Q Lin ZY Li ZH Ye JX FAM3 family genes are associated with prognostic value of human cancer: a pan-cancer analysis Sci Rep 2023 13 15144 10.1038/s41598-023-42060-x 37704682 PMC10499837 Dong QT, Ma DD, Gong Q, Lin ZY, Li ZH, Ye JX, et al. FAM3 family genes are associated with prognostic value of human cancer: a pan-cancer analysis. Sci Rep. 2023;13:15144. 37704682 10.1038/s41598-023-42060-x PMC10499837 29. Wang C Li Y Jia L Kim JK Li J Deng P Zhang W Krebsbach PH Wang CY CD276 expression enables squamous cell carcinoma stem cells to evade immune surveillance Cell Stem Cell 2021 28 1597 e16131597 10.1016/j.stem.2021.04.011 33945793 PMC8419062 Wang C, Li Y, Jia L, Kim JK, Li J, Deng P, et al. CD276 expression enables squamous cell carcinoma stem cells to evade immune surveillance. Cell Stem Cell. 2021;28:1597-e16131597. 33945793 10.1016/j.stem.2021.04.011 PMC8419062 30. Feng Z He X Zhang X Wu Y Xing B Knowles A Potent suppression of neuroendocrine tumors and gastrointestinal cancers by CDH17CAR T cells without toxicity to normal tissues Nat Cancer 2022 3 581 94 10.1038/s43018-022-00344-7 35314826 Feng Z, He X, Zhang X, Wu Y, Xing B, Knowles A, et al. Potent suppression of neuroendocrine tumors and gastrointestinal cancers by CDH17CAR T cells without toxicity to normal tissues. Nat Cancer. 2022;3:581–94. 35314826 10.1038/s43018-022-00344-7 31. Mhaidly R Mechta-Grigoriou F Role of cancer-associated fibroblast subpopulations in immune infiltration, as a new means of treatment in cancer Immunol Rev 2021 302 259 72 10.1111/imr.12978 34013544 PMC8360036 Mhaidly R, Mechta-Grigoriou F. Role of cancer-associated fibroblast subpopulations in immune infiltration, as a new means of treatment in cancer. Immunol Rev. 2021;302:259–72. 34013544 10.1111/imr.12978 PMC8360036 32. Luo W Wen T Qu X Tumor immune microenvironment-based therapies in pancreatic ductal adenocarcinoma: time to update the concept J Exp Clin Cancer Res 2024 43 8 10.1186/s13046-023-02935-3 38167055 PMC10759657 Luo W, Wen T, Qu X. Tumor immune microenvironment-based therapies in pancreatic ductal adenocarcinoma: time to update the concept. J Exp Clin Cancer Res. 2024;43:8. 38167055 10.1186/s13046-023-02935-3 PMC10759657 33. Hu Y Recouvreux MS Haro M Taylan E Taylor-Harding B Walts AE INHBA(+) cancer-associated fibroblasts generate an immunosuppressive tumor microenvironment in ovarian cancer NPJ Precis Oncol 2024 8 35 10.1038/s41698-024-00523-y 38360876 PMC10869703 Hu Y, Recouvreux MS, Haro M, Taylan E, Taylor-Harding B, Walts AE, et al. INHBA(+) cancer-associated fibroblasts generate an immunosuppressive tumor microenvironment in ovarian cancer. NPJ Precis Oncol. 2024;8:35. 38360876 10.1038/s41698-024-00523-y PMC10869703 34. Li C Yang L Zhang Y Hou Q Wang S Lu S Tao Y Hu W Zhao L Integrating single-cell and bulk transcriptomic analyses to develop a cancer-associated fibroblast-derived biomarker for predicting prognosis and therapeutic response in breast cancer Front Immunol 2023 14 1307588 10.3389/fimmu.2023.1307588 38235137 PMC10791883 Li C, Yang L, Zhang Y, Hou Q, Wang S, Lu S, et al. Integrating single-cell and bulk transcriptomic analyses to develop a cancer-associated fibroblast-derived biomarker for predicting prognosis and therapeutic response in breast cancer. Front Immunol. 2023;14:1307588. 38235137 10.3389/fimmu.2023.1307588 PMC10791883 35. Wang H Liu Z Du Y Cheng X Gao S Gao Y TPD52L2 as a potential prognostic and immunotherapy biomarker in clear cell renal cell carcinoma Front Oncol 2023 13 1210910 10.3389/fonc.2023.1210910 38074636 PMC10701739 Wang H, Liu Z, Du Y, Cheng X, Gao S, Gao Y, et al. TPD52L2 as a potential prognostic and immunotherapy biomarker in clear cell renal cell carcinoma. Front Oncol. 2023;13:1210910. 38074636 10.3389/fonc.2023.1210910 PMC10701739 36. Ye W Luo C Liu F Liu Z Chen F CD96 correlates with immune infiltration and impacts patient prognosis: a pan-cancer analysis Front Oncol 2021 11 634617 10.3389/fonc.2021.634617 33680972 PMC7935557 Ye W, Luo C, Liu F, Liu Z, Chen F. CD96 correlates with immune infiltration and impacts patient prognosis: a pan-cancer analysis. Front Oncol. 2021;11:634617. 33680972 10.3389/fonc.2021.634617 PMC7935557 37. Lai SW Cheng YC Kiu KT Yen MH Chen YW Yadav VK PROX1 interaction with α-SMA-rich cancer-associated fibroblasts facilitates colorectal cancer progression and correlates with poor clinical outcomes and therapeutic resistance Aging 2024 16 2 1620 39 10.18632/aging.205447 38244581 PMC10866434 Lai SW, Cheng YC, Kiu KT, Yen MH, Chen YW, Yadav VK, et al. PROX1 interaction with α-SMA-rich cancer-associated fibroblasts facilitates colorectal cancer progression and correlates with poor clinical outcomes and therapeutic resistance. Aging. 2024;16(2):1620–39. 38244581 10.18632/aging.205447 PMC10866434 38. Yan Q Fang X Liu X Guo S Chen S Luo M Lan P Guan XY Loss of ESRP2 activates TAK1-MAPK signaling through the fetal RNA-Splicing program to promote hepatocellular carcinoma progression Adv Sci (Weinh) 2024 11 e2305653 10.1002/advs.202305653 37985644 PMC10767434 Yan Q, Fang X, Liu X, Guo S, Chen S, Luo M, Lan P, Guan XY. Loss of ESRP2 activates TAK1-MAPK signaling through the fetal RNA-Splicing program to promote hepatocellular carcinoma progression. Adv Sci (Weinh). 2024;11:e2305653. 37985644 10.1002/advs.202305653 PMC10767434 39. Xiong JX Li YT Tan XY Chen T Liu BH Fu L Targeting PRSS23 with Tipranavir induces gastric cancer stem cell apoptosis and inhibits growth of gastric cancer via the MKK3/p38 MAPK-IL24 pathway Acta Pharmacol Sin 2024 45 405 21 10.1038/s41401-023-01165-9 37814123 PMC10789761 Xiong JX, Li YT, Tan XY, Chen T, Liu BH, Fu L. Targeting PRSS23 with Tipranavir induces gastric cancer stem cell apoptosis and inhibits growth of gastric cancer via the MKK3/p38 MAPK-IL24 pathway. Acta Pharmacol Sin. 2024;45:405–21. 37814123 10.1038/s41401-023-01165-9 PMC10789761 40. Ma L Hostetler A Morgan DM Maiorino L Sulkaj I Whittaker CA Neeser A Pires IS Yousefpour P Gregory J Vaccine-boosted CAR T crosstalk with host immunity to reject tumors with antigen heterogeneity Cell 2023 186 3148 e31653120 10.1016/j.cell.2023.06.002 37413990 PMC10372881 Ma L, Hostetler A, Morgan DM, Maiorino L, Sulkaj I, Whittaker CA, Neeser A, Pires IS, Yousefpour P, Gregory J, et al. Vaccine-boosted CAR T crosstalk with host immunity to reject tumors with antigen heterogeneity. Cell. 2023;186:3148–e31653120. 37413990 10.1016/j.cell.2023.06.002 PMC10372881 41. Das A Fernandez NR Levine A Bianchi V Stengs LK Chung J Combined immunotherapy improves outcome for Replication-Repair-Deficient (RRD) high-grade glioma failing anti-PD-1 monotherapy: a report from the international RRD consortium Cancer Discov 2024 14 258 73 10.1158/2159-8290.CD-23-0559 37823831 PMC10850948 Das A, Fernandez NR, Levine A, Bianchi V, Stengs LK, Chung J, et al. Combined immunotherapy improves outcome for Replication-Repair-Deficient (RRD) high-grade glioma failing anti-PD-1 monotherapy: a report from the international RRD consortium. Cancer Discov. 2024;14:258–73. 37823831 10.1158/2159-8290.CD-23-0559 PMC10850948 42. Cao GD Chen K Chen B Xiong MM Positive prognostic value of HER2-HER3 co-expression and p-mTOR in gastric cancer patients BMC Cancer 2017 17 841 10.1186/s12885-017-3851-y 29233126 PMC5727869 Cao GD, Chen K, Chen B, Xiong MM. Positive prognostic value of HER2-HER3 co-expression and p-mTOR in gastric cancer patients. BMC Cancer. 2017;17:841. 29233126 10.1186/s12885-017-3851-y PMC5727869 43. Cao GD Chen K Xiong MM Chen B HER3, but not HER4, plays an essential role in the clinicopathology and prognosis of gastric cancer: a meta-analysis PLoS ONE 2016 11 e0161219 10.1371/journal.pone.0161219 27536774 PMC4990181 Cao GD, Chen K, Xiong MM, Chen B. HER3, but not HER4, plays an essential role in the clinicopathology and prognosis of gastric cancer: a meta-analysis. PLoS ONE. 2016;11:e0161219. 27536774 10.1371/journal.pone.0161219 PMC4990181 44. Qu X Liu B Wang L Liu L Zhao W Liu C Loss of cancer-associated fibroblast-derived exosomal DACT3-AS1 promotes malignant transformation and ferroptosis-mediated oxaliplatin resistance in gastric cancer Drug Resist Updat 2023 68 100936 10.1016/j.drup.2023.100936 36764075 Qu X, Liu B, Wang L, Liu L, Zhao W, Liu C, et al. Loss of cancer-associated fibroblast-derived exosomal DACT3-AS1 promotes malignant transformation and ferroptosis-mediated oxaliplatin resistance in gastric cancer. Drug Resist Updat. 2023;68:100936. 36764075 10.1016/j.drup.2023.100936 45. Shapir Itai Y Barboy O Salomon R Bercovich A Xie K Winter E Shami T Porat Z Erez N Tanay A Bispecific dendritic-T cell engager potentiates anti-tumor immunity Cell 2024 187 375 e389318 10.1016/j.cell.2023.12.011 38242085 Shapir Itai Y, Barboy O, Salomon R, Bercovich A, Xie K, Winter E, Shami T, Porat Z, Erez N, Tanay A, et al. Bispecific dendritic-T cell engager potentiates anti-tumor immunity. Cell. 2024;187:375–e389318. 38242085 10.1016/j.cell.2023.12.011 46. Ricciuti B Lamberti G Puchala SR Mahadevan NR Lin JR Alessi JV Chowdhury A Li YY Wang X Spurr L Genomic and immunophenotypic landscape of acquired resistance to PD-(L)1 Blockade in Non-Small-Cell lung cancer J Clin Oncol 2024 42 1311 10.1200/JCO.23.00580 38207230 PMC11095860 Ricciuti B, Lamberti G, Puchala SR, Mahadevan NR, Lin JR, Alessi JV, Chowdhury A, Li YY, Wang X, Spurr L, et al. Genomic and immunophenotypic landscape of acquired resistance to PD-(L)1 Blockade in Non-Small-Cell lung cancer. J Clin Oncol. 2024;42:1311. 10.1200/JCO.23.00580. 38207230 10.1200/JCO.23.00580 PMC11095860 47. Li J Hu H Qin G Bai F Wu X Ke H Biomarkers of pathologic complete response to neoadjuvant immunotherapy in mismatch Repair-Deficient colorectal cancer Clin Cancer Res 2024 30 368 78 10.1158/1078-0432.CCR-23-2213 37906636 Li J, Hu H, Qin G, Bai F, Wu X, Ke H, et al. Biomarkers of pathologic complete response to neoadjuvant immunotherapy in mismatch Repair-Deficient colorectal cancer. Clin Cancer Res. 2024;30:368–78. 37906636 10.1158/1078-0432.CCR-23-2213 ",
  "metadata": {
    "Title of this paper": "Biomarkers of pathologic complete response to neoadjuvant immunotherapy in mismatch Repair-Deficient colorectal cancer",
    "Journal it was published in:": "BMC Gastroenterology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495720/"
  }
}