{
  "title": "Paper_1004",
  "abstract": "pmc BMJ Open BMJ Open 1609 bmjo bmjopen BMJ Open 2044-6055 BMJ Publishing Group PMC12481397 PMC12481397.1 12481397 12481397 41005780 10.1136/bmjopen-2025-100241 bmjopen-2025-100241 1 Protocol Oncology 1717 1506 Single-arm, open-label, multicentre phase 1b/2 study to evaluate the safety and efficacy of fruquintinib combined with sintilimab and CAPEOX as a first-line treatment for advanced gastric or gastroesophageal junction adenocarcinoma (FUNCTION study): a study protocol Chen Beibei 1 Zhao Jing 1 Lv Huifang 1 Xu Weifeng 1 Wang Jianzheng 1 Nie Caiyun 1 He Yunduan 1 Zhang Bin 2 Huang Jinxi 2 Liu Yingjun 2 Ma Fei 2 Zhang He 3 Guo Lanwei 4 Liu Yudong 5 Li Peng 6 https://orcid.org/0000-0002-0754-951X Chen Xiaofeng 7 8 * https://orcid.org/0000-0002-6831-1417 Chen Xiaobing 1 1 Department of Medical Oncology The Affiliated Cancer Hospital of Zhengzhou University and Henan Cancer Hospital Zhengzhou China 2 Department of Gastrointestinal Surgery The Affiliated Cancer Hospital of Zhengzhou University and Henan Cancer Hospital Zhengzhou China 3 Department of Pathology The Affiliated Cancer Hospital of Zhengzhou University and Henan Cancer Hospital Zhengzhou China 4 Department of Clinical Research Management The Affiliated Cancer Hospital of Zhengzhou University and Henan Cancer Hospital Zhengzhou China 5 Department of Radiology The Affiliated Cancer Hospital of Zhengzhou University and Henan Cancer Hospital Zhengzhou China 6 Department of PET-CT Cancer The Affiliated Cancer Hospital of Zhengzhou University and Henan Cancer Hospital Zhengzhou China 7 Department of Oncology The First Affiliated Hospital of Nanjing Medical University Nanjing China 8 Gastric Cancer Center The First Affiliated Hospital of Nanjing Medical University Nanjing China Supplemental material This content has been supplied by the author(s). It has not been vetted by BMJ Publishing Group Limited (BMJ) and may not have been peer-reviewed. Any opinions or recommendations discussed are solely those of the author(s) and are not endorsed by BMJ. BMJ disclaims all liability and responsibility arising from any reliance placed on the content. Where the content includes any translated material, BMJ does not warrant the accuracy and reliability of the translations (including but not limited to local regulations, clinical guidelines, terminology, drug names and drug dosages), and is not responsible for any error and/or omissions arising from translation and adaptation or otherwise. None declared. Dr Xiaobing Chen; zlyychenxb0807@zzu.edu.cn Dr Xiaofeng Chen; chenxiaofengnjmu@163.com 2025 26 9 2025 15 9 496158 e100241 05 2 2025 11 8 2025 26 09 2025 01 10 2025 01 10 2025 Copyright © Author(s) (or their employer(s)) 2025. Re-use permitted under CC BY-NC. No commercial re-use. See rights and permissions. Published by BMJ Group. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article distributed in accordance with the Creative Commons Attribution Non Commercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited, appropriate credit is given, any changes made indicated, and the use is non-commercial. See: http://creativecommons.org/licenses/by-nc/4.0/ Abstract Introduction Systemic therapies for advanced gastric cancer (GC), including chemotherapy, targeted therapy and immunotherapy, have evolved significantly in the past few years. The combination of immune checkpoint inhibitors (ICIs) and chemotherapy has become the standard first-line (1L) treatment for advanced gastric or gastro-oesophageal junction (G/GEJ) cancer, although there remains a need for improvement in efficacy. Fruquintinib, an oral and highly selective vascular endothelial growth factor receptor inhibitor, has shown a synergistic antitumour effect when paired with ICI or chemotherapy. Moreover, it has demonstrated a tolerable safety profile and high potential for synergy with chemotherapy or immunotherapy, suggesting that a combination of fruquintinib, sintilimab and oxaliplatin+capecitabine (CAPEOX) can be a promising treatment for locally advanced G/GEJ cancer. This phase 1b/2 study aims to investigate the safety and efficacy of the combination of fruquintinib, sintilimab and CAPEOX regimen as a 1L combination therapy for unresectable advanced or metastatic G/GEJ cancer. Methods and analysis The FUNCTION trial ( NCT06329973 , 2 , 2 Ethics and dissemination This study will be conducted in full compliance with the ICH (The International Council for Harmonisation of Technical Requirements for Pharmaceuticals for Human Use, ICH) GCP (Good Clinical Practice, GCP) guidelines, the rules of the Declaration of Helsinki and ICH E2A (Clinical Safety Data Management: Definitions and Standards for Expedited Reporting) Guidelines . The study protocol has received approval from the Henan Cancer Hospital ethical committee (Approval No. 2023-237-002). Written informed consent will be obtained from all patients prior to enrolment. For patients who have the mental capacity for informed consent, their consent for participation will be sought and will not be overridden by their family members. For patients who have impaired cognition, informed consent will be sought from their legally acceptable representative. On completion of the analyses, the study findings will be disseminated locally and internationally through manuscript publications in peer-reviewed journals and conference presentations. Trial registration NCT06329973 Gastrointestinal tumours CHEMOTHERAPY Clinical Protocols China Medical Science and Technology Research Project LHGJ20210172 http://dx.doi.org/10.13039/501100006407 Natural Science Foundation of Henan Province 242300420091 Science and Technique Foundation of Henan Province 222102310424 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes STRENGTHS AND LIMITATIONS OF THIS STUDY One key strength of our study is its multicentre phase 1b/2 design, which incorporates both a dose-escalation phase and an expansion cohort. In this study, a novel first-line combinatorial therapy regimen for advanced gastric and gastro-oesophageal junction cancer was established, integrating fruquintinib, sintilimab and the oxaliplatin+capecitabine regimen. The study design has several limitations, primarily the loss of research equipoise due to its open-label nature, as well as potential biases and interpretational challenges inherent in single-arm study designs. Introduction According to GLOBOCAN 2022, gastric cancer (GC) accounted for approximately 4.9% of all new cancer cases and 6.8% of all cancer deaths globally. 1 2 3 4 2 5 6 Chemotherapeutic regimens for gastric/gastro-oesophageal junction (G/GEJ) cancer primarily consist of fluorouracil (antimetabolite), platinum and paclitaxel, often in various combinations. 7 8 9 12 At present, targeted anti-programmed cell death 1 protein (anti-PD-1) monoclonal antibodies such as pembrolizumab and nivolumab have been approved by the US Food and Drug Administration for use in GC. 13 15 16 17 18 19 The National Comprehensive Cancer Network (NCCN) and Japanese guidelines recommend zolbetuximab (Vyloy) combination therapy as 1L treatment for CLDN18.2-positive, human epidermal growth factor receptor 2 (HER2 overexpression negative, unresectable advanced or recurrent GC, based on phase 3 SPOTLIGHT and GLOW trial data. In these trials, zolbetuximab plus mFOLFOX6 (5-fluorouracil, leucovorin, oxaliplatin) prolonged median progression-free survival (mPFS) and OS to 10.61 months and 18.23 months, whereas zolbetuximab plus CAPOX (capecitabine, oxaliplatin) achieved 8.21 months and 14.39 months. 20 21 From a mechanistic standpoint, successful immunotherapy requires not just the infiltration of immune cells, but also an immune-supportive microenvironment that fosters the proliferation and functionality of T cells. 22 9 23 24 26 27 28 Fruquintinib, a highly selective small molecule inhibitor of VEGF receptor (VEGFR) specifically targets the VEGFR kinase family (VEGFR1, VEGFR2 and VEGFR3), was approved in September 2018 for third-line treatment of metastatic colorectal cancer (CRC) in patients who had received prior fluorouracil-based, oxaliplatin-based and irinotecan-based chemotherapy and were resistant or ineligible for VEGF/VEGFR-targeted therapy. 29 30 32 The SPACE trial demonstrated encouraging outcomes of camrelizumab plus apatinib and chemotherapy as a 1L treatment for advanced GC. The mPFS was reported to be 8.4 months, ORR 76.5%, while the disease control rate (DCR) reached 91.2%. 33 34 It is proposed that incorporating fruquintinib with chemotherapy, in conjunction with immunotherapy, could have the potential to modulate the immune microenvironment. This combination has the potential to transit the tumour microenvironment from an immunosuppressive phase to the one that supports immune activity. Furthermore, chemotherapy-induced tumour cell death may enhance immunogenicity and may work synergistically with ICIs, thereby potentially enhancing both short-term and long-term treatment outcomes for patients with advanced G/GEJ cancer. Two studies aiming to investigate the safety and efficacy of fruquintinib combined with sintilimab and chemotherapy for the treatment of advanced G/GEJ cancer have been sequentially initiated. In a single-arm, phase 2 trial, fruquintinib in combination with sintilimab and SOX (S-1 and oxaliplatin) is designed to evaluate the efficacy and safety of fruquintinib plus SOX as conversion therapy for initially unresectable G/GEJ adenocarcinoma who have not received prior antitumour therapy, and the preliminary results showed an acceptable toxicity and induced very high R0 resection (100%), pathological complete response (CR) (11.1%) and downstaging rate (72.2%) in patients with primary unresectable GC/GEJC. 35 Methods and analysis Study design FUNCTION study ( NCT06329973 figure 1 Figure 1 Study design with dose escalation and dose expansion phases. bid, twice a day; i.v., intravenous; po, per oral; qd, once a day; RP2D, recommended phase 2 dose. Treatment All patients will undergo a screening period (up to 28 days) followed by a treatment period (until the investigator determines that the study drug is no longer used), safety follow-up (after the administration of last dose of the study drug or before the start of new anticancer treatment, whichever occurs first) and survival follow-up (until death, loss to follow-up, withdrawal of consent or termination of the study). The study flowchart is detailed in the online supplemental figure S1 The dose-escalating phase of this study will use a 3+3 design, incorporating an escalating oral daily dosage of fruquintinib ranging from statistics 3–5 mg (increasing 1 mg per level) fruquintinib for days 1–14. This will be combined with intravenous administration of sintilimab 200 mg on day 1, capecitabine at 800 mg/m 2 2 Patients likely to undergo radical resection after treatment or those who can achieve a disease-free state via a combination of surgery and radiofrequency are eligible for various interventions, including surgery, radiofrequency, microwave, radiotherapy or other localised treatment options aimed at achieving a disease-free state. Fruquintinib should be discontinued one cycle prior to surgery. On achieving a disease-free state, sintilimab combined with chemotherapy is recommended as the adjuvant treatment (oxaliplatin up to eight cycles). Study population and recruitment A total of 70 eligible patients with HER2 negative/unknown status G/GEJ cancer will be enrolled from 16 hospitals in China based on the inclusion and exclusion criteria. The study is planned to be conducted at 16 public hospitals. To date, eight centres have obtained ethical approval and commenced patient recruitment, including the Affiliated Cancer Hospital of Zhengzhou University & Henan Cancer Hospital, Luohe Central Hospital, The First People’s Hospital of Shangqiu, Luoyang Central Hospital and Luoyang Central Hospital Affiliated to Zhengzhou University, Xinyang Central Hospital, Jiangsu Province Hospital and The First Affiliated Hospital with Nanjing Medical University and Jiangsu Women and Children Health Hospital, Longgang District People’s Hospital of Shenzhen and The Second Affiliated Hospital, The Chinese University of Hong Kong, Shanxi Cancer Hospital. Hunan Cancer Hospital and The Affiliated Cancer Hospital of Xiangya School of Medicine, Central South University, and Mengjin People’s Hospital of Luoyang are in the process of preparing ethical documentation and six centres are pending activation. Six public hospitals remain pending initiation. Participant enrolment, initiated on 28 February 024, is ongoing, with 38 participants enrolled to date (see online supplemental appendix 5 Inclusion criteria The patients aged 18–75 years (inclusive), weighing ≥40 kg or with a body mass index (BMI) >18.5, with adequate organ functions, with histologically and/or cytologically confirmed unresectable advanced/refractory HER2-negative or unknown HER2 status with G/GEJ cancer; with at least one measurable lesion as per RECIST (Response Evaluation Criteria in Solid Tumors) 1.1 ; with Eastern Cooperative Oncology Group performance score of 0 or 1; with a life expectancy of at least 3 months; without prior exposure to anti-cancer treatment. Additionally, patients who had received platinum, paclitaxel or 5-FU as adjuvant treatments and had refractory disease after at least 6 months with grade ≤2 toxicities; anti-VEGFR or anti-PD-1/PD-L1 treatment-naïve patients will also be included. Detailed inclusion criteria are presented in online supplemental appendix 3 Exclusion criteria Patients with other malignant tumours, except cured early-stage tumours like basal cell carcinoma of the skin, cervical carcinoma in situ, stage I lung cancer, stage I CRC, etc, which do not affect patient’s life in short term as determined by the investigator; had participated in other clinical trials within <4 weeks; with swallowing difficulties, chronic diarrhoea and intestinal obstruction, which can affect the effectiveness of the oral medication, with a history of immunodeficiency, severe chronic autoimmune diseases or hypersensitivity, bleeding or any bleeding event with grade ≥3 according to the NCI CTCAE V.5.0 within 4 weeks before screening and with known hypersensitivities will be excluded. Detailed exclusion criteria are presented in online supplemental appendix 3 Follow-up Safety follow-up will be carried out within 30 days (±7 days) after end-of-treatment (EOT) (or before the start of new anticancer treatment, whichever occurs first) in patients with at least one dose of study treatment. EOT visit during which tumour efficacy assessments indicate disease progression and lead to discontinuation of treatment for that patient may serve as safety follow-up. Furthermore, patients will be followed up after 60 days (±7 days) and 90 days (±7 days) after EOT to assess immune-related adverse events and concomitant medications. After patients discontinue study treatment, information on survival and further anticancer treatment will be collected every 3 months (±14 days) after the safety visit or until death or until loss to follow-up or withdrawal of consent or until termination of the study. Outcome measurements The primary endpoints comprise MTD and ORR. MTD is defined as the combination of fruquintinib, sintilimab and CAPEOX after the patient enters the dose escalation phase. If ≤1 patient experiences DLT during the first 21 days of treatment, they will move on to the higher-dose combination group. However, if ≥2 patients do experience DLT, the previous combination group is considered the MTD. If ≤1 patient experienced DLT at the 5 mg dose level, then that dose level was declared the MTD. If ≥2 patients in the first dose cohort experience DLT, 3 additional patients should be enrolled. If ≥2 of these additional patients experience DLT, the chemotherapy dosage should be reduced. ORR is defined as the percentage of patients whose tumours shrink and stay reduced for a certain duration, which includes both CR and partial response (PR). The evaluation of tumour response will be conducted using the RECIST 1.1 criteria 36 37 online supplemental appendix 1 and 2 Statistical analysis The statistical analysis will be conducted after the completion of the study and database lock. The intention-to-treat analysis set will include all the enrolled patients whereas the safety analysis set will include all the patients who received at least one dose of study drug. Further safety analysis will include PD-L1-positive analysis set and TMB-H analysis set. PD-L1-positive analysis set will include all the patients who are PD-L1 positive while the tumour mutational burden (TMB-H) analysis set will include patients with TMB ≥10 mut/Mb. The Kaplan-Meier method will be used to estimate the median mPFS and OS. Descriptive statistics will be used to present the number of cases and percentages, and the 95% CI of the percentages will be also computed. The safety data set will be analysed to evaluate safety and tolerability using descriptive statistics. Adverse events and the results from biochemical and other laboratory test results will be summarised and listed using medical dictionary for regulatory activities terminology. The analysis will include vital signs, physical examinations, electrocardiograms and clinical outcomes (refer to online supplemental appendix 4 The patient and public involvement There was no patient or public involvement in the design and conduct of this study. Sample size calculation In the phase three randomised controlled ORIENT-16 study, chemotherapy (XELOX regimen) combined with 1L sintilimab + maintenance therapy had an ORR of 58.2% in all randomised control populations. 18 Discussion China is the country with the highest incidence rates of mortality rates of GC globally, with 20% of its population accounting for approximately 50% of global statistics. 38 39 40 41 42 12 16 18 43 44 The response rate for ICIs combined with chemotherapy as a 1L treatment for HER2-negative/unknown advanced GC ranges from 50% to 60%, which varies based on factors like PD-L1 expression. Further investigation is needed to identify potentially more effective treatment regimens, including surgery options for patients with unresectable diseases. Several studies indicate that small-molecule anti-angiogenic agents used alongside immunotherapy can improve the tumour immune microenvironment, thereby enhancing anti-cancer efficacy. These agents help normalise aberrant blood vessels, improving blood flow, by which the sensitivity to chemotherapy is increased with intravascular drug delivery and the cytotoxicity to tumour cells and/or endothelial cells. Previous studies such as SPACE and TALENT, along with our clinical experience, indicate that the combination of antiangiogenic agents, chemotherapy and PD-1 blockade may lead to improved outcomes for advanced GC with manageable toxicity. 33 34 Fruquintinib is a highly selective small-molecule inhibitor targeting VEGFR-1, VEGFR-2 and VEGFR-3. In a GC patient-derived xenograft model, the combination of fruquintinib plus chemotherapy significantly enhanced the anti-tumour response without exacerbating the weight loss associated with chemotherapy. 45 46 47 We designed this single-arm, open-label, multicentre phase 1b/2 trial to evaluate the efficacy of fruquintinib in combination with sintilimab and CAPEOX as a 1L treatment for unresectable or metastatic G/GEJ cancer. The trial is aimed at identifying a more effective treatment regimen with manageable toxicity for further clinical practice. Stratification analysis will be conducted based on Lauren subtype, expression of PD-L1 and Claudin 18.2, EBV(Epstein-Barr Virus), MMR and other factors. Next-generation sequencing and immune microenvironment assessments will be performed for biomarker exploration. Further, the QoL will be evaluated through EORTC QLQ-C30 and EQ-5D questionnaires. To the best of our knowledge, this is the first study to assess the combination of fruquintinib, sintilimab and CAPEOX regimen for its clinical efficacy and safety in treating G/GEJ cancers. However, this study has some limitations. This is an open-label prospective study, without a control group and no randomisation. Furthermore, the single-arm design may result in a treatment bias which could be challenging in distinguishing the individual treatment efficacy of each component in the combination. As this will be initially assessed in Chinese patients which might limit the wide applicability and generalisability of the outcomes. To the best of our knowledge, this is the first study to assess the combination of fruquintinib, sintilimab and CAPEOX regimen for its clinical efficacy and safety in treating G/GEJ cancers. However, this study has some limitations. This is an open-label prospective study, without a control group, and no randomisation. Furthermore, the single-arm design may result in a treatment bias which could be challenging in distinguishing the individual treatment efficacy of each component in the combination. As this will be initially assessed in Chinese patients which might limit the wide applicability and generalisability of the outcomes. Overall, this trial has the potential to enhance 1L treatment options for patients with advanced HER2-negative/unknown G/GEJ cancer. It may facilitate a better understanding of the efficacy and practicality of antiangiogenic agents alongside ICIs and chemotherapy for advanced GC. The exploration of biomarkers could refine the approach to precision medicine. Moreover, this trial has the potential to increase the surgical conversion rate, thereby necessitating a larger-scale RCT in the future. Ethics and dissemination This study will be conducted in full compliance with the ICH GCP guidelines, the rules of the Declaration of Helsinki and ICH E2A Guidelines (Clinical Research Data Management: Definitions and Standards for Expedited Reporting). The study protocol has received approval from the Henan Cancer Hospital ethical committee (approval No. 2023-237-002). To date, nine other public hospitals have either obtained ethical approval or are undergoing ethical review, while six public hospitals have yet to initiate the process. Participant enrolment commenced on 28 February 2024 and is ongoing, with 38 participants enrolled so far (see online supplemental appendix 5 online supplemental material S1 Supplementary material 10.1136/bmjopen-2025-100241 online supplemental file 1 10.1136/bmjopen-2025-100241 online supplemental file 2 Acknowledgements The authors are grateful to the patients participating in this study and their families. The authors would like to acknowledge Ravi Kiran Ammu, PhD, and Deepak Pakalapati, PhD, from Indegene, India, for their medical writing and editorial assistance under the guidance of authors, which was funded by HUTCHMED (China). Funding: Prepublication history and additional supplemental material for this paper are available online. To view these files, please visit the journal online ( https://doi.org/10.1136/bmjopen-2025-100241 Provenance and peer review: Patient consent for publication: Patient and public involvement: References 1 Bray F Laversanne M Sung H et al Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA A Cancer J Clinicians 2024 74 229 63 10.3322/caac.21834 38572751 2 Sung H Ferlay J Siegel RL et al Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J Clin 2021 71 209 49 10.3322/caac.21660 33538338 3 Zhu X Li J Gastric carcinoma in China: Current status and future perspectives (Review) Oncol Lett 2010 1 407 12 10.3892/ol_00000071 22966316 PMC3436419 4 Lu J Wang Q Zhang H et al Analysis of endoscopic and pathological features of 6961 cases of gastric cancer Sci Rep 2024 14 7159 10.1038/s41598-024-58018-6 38532198 PMC10965891 5 Mantziari S St Amour P Abboretti F et al A Comprehensive Review of Prognostic Factors in Patients with Gastric Adenocarcinoma Cancers (Basel) 2023 15 1628 10.3390/cancers15051628 36900419 PMC10000968 6 Mukkamalla SKR Recio-Boiles A Babiker HM Gastric cancer StatPearls Treasure Island (FL) StatPearls Publishing 2024 Available http://www.ncbi.nlm.nih.gov/books/NBK459142/ 7 Dai X Zhang X Wang C et al Paclitaxel/oxaliplatin/fluorouracil (TOF) regimen versus S-1/oxaliplatin (SOX) regimen for metastatic gastric cancer patients Oncotarget 2017 8 30495 501 10.18632/oncotarget.13721 27911869 PMC5444759 8 Ren C Xu R-H The drug treatment research of gastrointestinal cancer in China Eur J Surg Oncol 2020 46 e3 6 10.1016/j.ejso.2020.06.004 32591201 9 Apte RS Chen DS Ferrara N VEGF in Signaling and Disease: Beyond Discovery and Development Cell 2019 176 1248 64 10.1016/j.cell.2019.01.021 30849371 PMC6410740 10 Sato Y Okamoto K Kida Y et al Overview of Chemotherapy for Gastric Cancer J Clin Med 2023 12 1336 10.3390/jcm12041336 36835872 PMC9959005 11 Janjigian YY Kawazoe A Bai Y et al Pembrolizumab plus trastuzumab and chemotherapy for HER2-positive gastric or gastro-oesophageal junction adenocarcinoma: interim analyses from the phase 3 KEYNOTE-811 randomised placebo-controlled trial The Lancet 2023 402 2197 208 10.1016/S0140-6736(23)02033-0 37871604 12 Janjigian YY Shitara K Moehler M et al First-line nivolumab plus chemotherapy versus chemotherapy alone for advanced gastric, gastro-oesophageal junction, and oesophageal adenocarcinoma (CheckMate 649): a randomised, open-label, phase 3 trial The Lancet 2021 398 27 40 10.1016/S0140-6736(21)00797-2 PMC8436782 34102137 13 Ajani JA D’Amico TA Bentrem DJ et al Gastric Cancer, Version 2.2022, NCCN Clinical Practice Guidelines in Oncology J Natl Compr Canc Netw 2022 20 167 92 jnccn2002gls 10.6004/jnccn.2022.0008 35130500 14 Center for Drug Evaluation and Research FDA approves pembrolizumab with chemotherapy for her2-negative gastric or gastroesophageal junction adenocarcinoma FDA 2024 Available https://www.fda.gov/drugs/resources-information-approved-drugs/fda-approves-pembrolizumab-chemotherapy-her2-negative-gastric-or-gastroesophageal-junction 15 Twomey JD Zhang B Cancer Immunotherapy Update: FDA-Approved Checkpoint Inhibitors and Companion Diagnostics AAPS J 2021 23 39 10.1208/s12248-021-00574-0 33677681 PMC7937597 16 Kang Y-K Chen L-T Ryu M-H et al Nivolumab plus chemotherapy versus placebo plus chemotherapy in patients with HER2-negative, untreated, unresectable advanced or recurrent gastric or gastro-oesophageal junction cancer (ATTRACTION-4): a randomised, multicentre, double-blind, placebo-controlled, phase 3 trial Lancet Oncol 2022 23 234 47 10.1016/S1470-2045(21)00692-6 35030335 17 Janjigian YY Shitara K Moehler M et al First-line nivolumab plus chemotherapy versus chemotherapy alone for advanced gastric, gastro-oesophageal junction, and oesophageal adenocarcinoma (CheckMate 649): a randomised, open-label, phase 3 trial Lancet 2021 398 27 40 10.1016/S0140-6736(21)00797-2 34102137 PMC8436782 18 Xu J Jiang H Pan Y et al Sintilimab Plus Chemotherapy for Unresectable Gastric or Gastroesophageal Junction Cancer: The ORIENT-16 Randomized Clinical Trial JAMA 2023 330 2064 74 10.1001/jama.2023.19918 38051328 PMC10698618 19 Shitara K Van Cutsem E Bang Y-J et al Efficacy and Safety of Pembrolizumab or Pembrolizumab Plus Chemotherapy vs Chemotherapy Alone for Patients With First-line, Advanced Gastric Cancer: The KEYNOTE-062 Phase 3 Randomized Clinical Trial JAMA Oncol 2020 6 1571 80 10.1001/jamaoncol.2020.3370 32880601 PMC7489405 20 Shitara K Lordick F Bang Y-J et al Zolbetuximab plus mFOLFOX6 in patients with CLDN18.2-positive, HER2-negative, untreated, locally advanced unresectable or metastatic gastric or gastro-oesophageal junction adenocarcinoma (SPOTLIGHT): a multicentre, randomised, double-blind, phase 3 trial Lancet 2023 401 1655 68 10.1016/S0140-6736(23)00620-7 37068504 21 Shah MA Shitara K Ajani JA et al Zolbetuximab plus CAPOX in CLDN18.2-positive gastric or gastroesophageal junction adenocarcinoma: the randomized, phase 3 GLOW trial Nat Med 2023 29 2133 41 10.1038/s41591-023-02465-7 37524953 PMC10427418 22 Waldman AD Fritz JM Lenardo MJ A guide to cancer immunotherapy: from T cell basic science to clinical practice Nat Rev Immunol 2020 20 651 68 10.1038/s41577-020-0306-5 32433532 PMC7238960 23 Mpekris F Voutouri C Baish JW et al Combining microenvironment normalization strategies to improve cancer immunotherapy Proc Natl Acad Sci USA 2020 117 3728 37 10.1073/pnas.1919764117 32015113 PMC7035612 24 Gerber HP Ferrara N Pharmacology and Pharmacodynamics of Bevacizumab as Monotherapy or in Combination with Cytotoxic Therapy in Preclinical Studies Cancer Res 2005 65 671 80 10.1158/0008-5472.671.65.3 15705858 25 Klement G Baruchel S Rak J et al Continuous low-dose therapy with vinblastine and VEGF receptor-2 antibody induces sustained tumor regression without overt toxicity J Clin Invest 2000 105 R15 24 10.1172/JCI8829 10772661 PMC517491 26 Sweeney CJ Miller KD Sissons SE et al The antiangiogenic property of docetaxel is synergistic with a recombinant humanized monoclonal antibody against vascular endothelial growth factor or 2-methoxyestradiol but antagonized by endothelial growth factors Cancer Res 2001 61 3369 72 11309294 27 Jain RK Normalization of tumor vasculature: an emerging concept in antiangiogenic therapy Science 2005 307 58 62 10.1126/science.1104819 15637262 28 Willett CG Boucher Y di Tomaso E et al Direct evidence that the VEGF-specific antibody bevacizumab has antivascular effects in human rectal cancer Nat Med 2004 10 145 7 10.1038/nm988 14745444 PMC2693485 29 Ding X Liu Y Zhang Y et al Efficacy and safety of fruquintinib as third- or further-line therapy for patients with advanced bone and soft tissue sarcoma: a multicenter retrospective study Anticancer Drugs 2023 34 877 82 10.1097/CAD.0000000000001482 36539356 PMC10344427 30 Zheng W Qian C Tang Y et al Manipulation of the crosstalk between tumor angiogenesis and immunosuppression in the tumor microenvironment: Insight into the combination therapy of anti-angiogenesis and immune checkpoint blockade Front Immunol 2022 13 1035323 10.3389/fimmu.2022.1035323 36439137 PMC9684196 31 Ciciola P Cascetta P Bianco C et al Combining Immune Checkpoint Inhibitors with Anti-Angiogenic Agents J Clin Med 2020 9 675 10.3390/jcm9030675 32138216 PMC7141336 32 Sugiyarto G Lau D Hill SL et al Reactivation of low avidity tumor-specific CD8 + J Immunother Cancer 2023 11 e007114 10.1136/jitc-2023-007114 37586767 PMC10432680 33 Chen X Xu H Chen X et al First-line camrelizumab (a PD-1 inhibitor) plus apatinib (an VEGFR-2 inhibitor) and chemotherapy for advanced gastric cancer (SPACE): a phase 1 study Sig Transduct Target Ther 2024 9 73 10.1038/s41392-024-01773-9 PMC10963362 38528050 34 Chen X Wang D Yuan Y et al Tislelizumab combined with anlotinib and chemotherapy (XELOX) in the treatment of advanced gastric carcinoma: Preliminary results of a single-arm, open-label phase I/IIa trial (TALENT study) JCO 2023 41 396 10.1200/JCO.2023.41.4_suppl.396 35 Ma F Luo S Zhang B et al Fruquintinib combined with sintilimab and SOX as conversion therapy for unresectable locally advanced or metastatic gastric/gastroesophageal junction adenocarcinoma (GC/GEJC): A single-arm, open-label, phase 2 clinical trial JCO 2024 42 e16021 10.1200/JCO.2024.42.16_suppl.e16021 36 Eisenhauer EA Therasse P Bogaerts J et al New response evaluation criteria in solid tumours 2009 45 228 47 10.1016/j.ejca.2008.10.026 19097774 37 Questionnaires EORTC – quality of life 2017 Available https://qol.eortc.org/questionnaires/ 38 Yan X Lei L Li H et al Stomach cancer burden in China: Epidemiology and prevention Chin J Cancer Res 2023 35 81 91 10.21147/j.issn.1000-9604.2023.02.01 37180831 PMC10167608 39 Chen Q-Y Zhong Q Liu Z-Y et al Advances in laparoscopic surgery for the treatment of advanced gastric cancer in China Eur J Surg Oncol 2020 46 e7 13 10.1016/j.ejso.2020.07.015 32709375 40 Zhao L Li J Bai C et al Multi-Modality Treatment for Patients With Metastatic Gastric Cancer: A Real-World Study in China Front Oncol 2019 9 1155 10.3389/fonc.2019.01155 31737573 PMC6839024 41 Fanotto V Cordio S Pasquini G et al Prognostic factors in 868 advanced gastric cancer patients treated with second-line chemotherapy in the real world Gastric Cancer 2017 20 825 33 10.1007/s10120-016-0681-6 28028664 42 Bang Y-J Van Cutsem E Feyereislova A et al Trastuzumab in combination with chemotherapy versus chemotherapy alone for treatment of HER2-positive advanced gastric or gastro-oesophageal junction cancer (ToGA): a phase 3, open-label, randomised controlled trial The Lancet 2010 376 687 97 10.1016/S0140-6736(10)61121-X 20728210 43 Qiu M-Z Oh D-Y Kato K et al Tislelizumab plus chemotherapy versus placebo plus chemotherapy as first line treatment for advanced gastric or gastro-oesophageal junction adenocarcinoma: RATIONALE-305 randomised, double blind, phase 3 trial BMJ 2024 385 e078876 10.1136/bmj-2023-078876 38806195 44 Tabernero J Bang Y-J Van Cutsem E et al KEYNOTE-859: a Phase III Study of Pembrolizumab Plus Chemotherapy in Gastric/Gastroesophageal Junction Adenocarcinoma Future Oncol 2021 17 2847 55 10.2217/fon-2021-0176 33975465 PMC9892960 45 Sun Q Zhou J Zhang Z et al Discovery of fruquintinib, a potent and highly selective small molecule inhibitor of VEGFR 1, 2, 3 tyrosine kinases for cancer therapy Cancer Biology & Therapy 2014 15 1635 45 10.4161/15384047.2014.964087 25482937 PMC4622458 46 Zhang Y Wang Z Shen L et al A phase Ib/II study of fruquintinib in combination with paclitaxel as the second‐line therapy for advanced gastric cancer Cancer Commun 2023 43 150 3 10.1002/cac2.12379 PMC9859731 36331272 47 Wang F Shen L Guo W et al Fruquintinib plus paclitaxel versus placebo plus paclitaxel for gastric or gastroesophageal junction adenocarcinoma: the randomized phase 3 FRUTIGA trial Nat Med 2024 30 2189 98 10.1038/s41591-024-02989-6 38824242 Data availability statement Data are available upon reasonable request. Review Process File 26 09 2025 ",
  "metadata": {
    "Title of this paper": "Review Process File",
    "Journal it was published in:": "BMJ Open",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481397/"
  }
}