{
  "title": "Paper_966",
  "abstract": "Nat Biotechnol Nat Biotechnol 319 nihpa Nature biotechnology 1087-0156 1546-1696 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12483193 PMC12483193.1 12483193 12483193 NIHMS2111129 40185952 10.1038/s41587-025-02618-8 NIHMS2111129 NIHPA2111129 1 Article Severus detects somatic structural variation and complex\nrearrangements in cancer genomes using long-read sequencing http://orcid.org/0000-0002-3934-8587 Keskus Ayse G. 1 http://orcid.org/0009-0005-9132-782X Bryant Asher 1 Ahmad Tanveer 1 Yoo Byunggil 2 Aganezov Sergey 3 http://orcid.org/0009-0007-6595-9318 Goretsky Anton 1 4 Donmez Ataberk 1 4 Lansdon Lisa A. 2 Rodriguez Isabel 5 Park Jimin 6 Liu Yuelin 1 4 Cui Xiwen 1 Gardner Joshua 6 McNulty Brandy 6 Sacco Samuel 6 Shetty Jyoti 7 http://orcid.org/0000-0003-0800-4658 Zhao Yongmei 8 Tran Bao 7 http://orcid.org/0000-0003-1118-8849 Narzisi Giuseppe 9 Helland Adrienne 9 Cook Daniel E. 10 http://orcid.org/0000-0003-3021-6446 Chang Pi-Chuan 10 Kolesnikov Alexey 10 http://orcid.org/0000-0002-4824-6689 Carroll Andrew 10 Molloy Erin K. 4 Bi Chengpeng 2 Walter Adam 2 Gibson Margaret 2 http://orcid.org/0000-0002-0862-1923 Pushel Irina 2 Guest Erin 2 http://orcid.org/0000-0003-4016-5021 Pastinen Tomi 2 http://orcid.org/0000-0001-5252-3434 Shafin Kishwar 5 http://orcid.org/0000-0002-3670-4507 Miga Karen H. 6 http://orcid.org/0000-0002-4215-5655 Malikic Salem 1 http://orcid.org/0000-0001-5200-2372 Day Chi-Ping 1 http://orcid.org/0000-0001-5698-8183 Robine Nicolas 9 http://orcid.org/0000-0002-2170-2808 Sahinalp Cenk 1 Dean Michael 5 Farooqi Midhat S. 2 http://orcid.org/0000-0001-8863-3539 Paten Benedict 6 http://orcid.org/0000-0002-5489-9045 Kolmogorov Mikhail 1 ✉ 1 2 3 4 5 6 7 8 9 10 Author contributions A.G.K., A.B. and M.K. conceived the overall methods design, analyzed\nthe data, coordinated activities from coauthors and wrote the first draft of\nthe paper. A.G.K. developed Severus. A.B. developed Minda. T.A., S.A., A.G.,\nA.D. I.R., Y.L., S.M., E.K.M., C.-P.D., C.S. and M.D. contributed additional\ndata analysis and algorithm conceptualization. I.R., J.P., Y.L., X.C., S.M.,\nC.-P.D., C.S. and M.D. tested and validated Severus results on an orthogonal\nset of samples. J.G., B.M., S.S., J.S., Y.Z., B.T., D.E.C., P.-C.C., A.K.,\nA.C., K.S., K.H.M. and B.P. contributed multitechnology cell line panel\nsequencing and data analysis. G.N., A.H. and N.R. contributed additional\nHCC1395 ONT sequencing. S.A. contributed COLO829 ONT sequencing and\nanalysis. B.Y., L.A.L., I.P., E.G., C.B., A.W., M.G., T.P. and M.S.F.\ncontributed clinical sample sequencing and analysis. M.K. supervised the\nwork. All authors revised the paper. ✉ Correspondence and requests for\nmaterials mikhail.kolmogorov@nih.gov Competing interests S.A. is an employee and stockholder of ONT. A.K., P.C., K.S., D.C. and\nA.C. are employees of Google and own Alphabet stock as part of the standard\ncompensation package. E.G. served on advisory boards for Jazz Pharmaceuticals\nand Syndax Pharmaceuticals. M.S.F. is part of the speakers bureau for Bayer and\nPacBio. The other authors declare no competing interests. 04 4 2025 497820 10.1038/s41587-025-02618-8 23 09 2025 30 09 2025 01 10 2025 01 10 2025 Reprints and permissions information www.nature.com/reprints For the detection of somatic structural variation (SV) in cancer genomes,\nlong-read sequencing is advantageous over short-read sequencing with respect to\nmappability and variant phasing. However, most current long-read SV detection\nmethods are not developed for the analysis of tumor genomes characterized by\ncomplex rearrangements and heterogeneity. Here, we present Severus, a breakpoint\ngraph-based algorithm for somatic SV calling from long-read cancer sequencing.\nSeverus works with matching normal samples, supports unbalanced cancer\nkaryotypes, can characterize complex multibreak SV patterns and produces\nhaplotype-specific calls. On a comprehensive multitechnology cell line panel,\nSeverus consistently outperforms other long-read and short-read methods in terms\nof SV detection F1 score (harmonic mean of the precision and recall). We also\nillustrate that compared to long-read methods, short-read sequencing\nsystematically misses certain classes of somatic SVs, such as insertions or\nclustered rearrangements. We apply Severus to several clinical cases of\npediatric leukemia/lymphoma, revealing clinically relevant cryptic\nrearrangements missed by standard genomic panels. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf yes pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Severus detects somatic structural variation and complex\nrearrangements in cancer genomes using long-read sequencing",
    "Journal it was published in:": "Nature biotechnology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483193/"
  }
}