{
  "title": "Paper_1214",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472545 PMC12472545.1 12472545 12472545 41011134 10.3390/ph18091263 pharmaceuticals-18-01263 1 Article Expanding the Knowledge of the Molecular Effects and Therapeutic Potential of Incomptine A for the Treatment of Non-Hodgkin Lymphoma: In Vivo and Bioinformatics Studies, Part III https://orcid.org/0000-0001-6021-8309 García-Hernández Normand Conceptualization Validation Formal analysis Resources Writing – original draft Writing – review & editing Supervision Project administration Funding acquisition 1 * https://orcid.org/0000-0003-1851-5988 Calzada Fernando Conceptualization Validation Formal analysis Resources Writing – original draft Writing – review & editing Visualization Project administration Funding acquisition 2 * https://orcid.org/0000-0002-7050-9182 Bautista Elihú Methodology Investigation 3 https://orcid.org/0000-0002-1349-4746 Sánchez-López José Manuel Methodology Software Investigation Writing – original draft 4 5 https://orcid.org/0000-0001-7401-303X Valdes Miguel Methodology Software Investigation Writing – original draft 2 6 7 https://orcid.org/0000-0003-0546-5969 Velázquez Claudia Methodology Investigation Data curation 8 https://orcid.org/0000-0002-7111-7922 Barbosa Elizabeth Methodology Investigation Data curation 6 Gavriilaki Eleni Academic Editor 1 2 valdesguevaramiguel@gmail.com 3 francisco.bautista@ipicyt.edu.mx 4 cienciaflosan@gmail.com 5 6 rebc78@yahoo.com.mx 7 8 cvg09@yahoo.com * normandgarcia@gmail.com fercalber10@gmail.com 25 8 2025 9 2025 18 9 497460 1263 29 7 2025 19 8 2025 19 8 2025 25 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives IA IA Methods IA Results IA IA Conclusions IA incomptine A non-Hodkin lymphoma antilymphoma activity Tandem Mass Tag network pharmacology molecular docking toxicoinformatic pharmaceutical analysis Instituto Mexicano del Seguro Social FIS/IMSS/PROT/EMER18/1846 This research was funded by the Instituto Mexicano del Seguro Social, contract grant sponsor Fondo de Investigación en Salud: FIS/IMSS/PROT/EMER18/1846 (Approval no: R-2018-785-111). This research did not receive external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Non-Hodgkin lymphoma (NHL) is a kind of blood cancer that generally develops in lymph nodes or in lymphatic tissue present in the organs of the human body such as the skin, intestines, or stomach. NHL is characterized by the malignant transformation of NK, T, or B cells and is associated with an increased proliferation and reduction in apoptosis [ 1 1 2 3 4 5 5 6 7 8 9 10 11 12 13 14 15 Incomptine A (IA), a heliangolide sesquiterpene lactone isolated from the roots and leaves of Decachaeta incompta 16 Figure 1 Figure 2 10 16 17 As a part of our study of the antitumor properties of IA 10 17 IA 2. Results 2.1. Isolation and Identification of Sesquiterpene Lactone Incomptine A from Decachaeta Incompta Dichloromethane extract from Decachaeta incompta IA 16 IA Figure 3 Table 1 2 2 IA 1 13 Table 2 13 1 13 Table 2 α β γ δ H J J γ δ C δ H J δ C δ C δ H J δ H J δ C δ C δ H J δ C δ C δ H δ C δ H δ C δ H δ C δ C 1 13 16 Figure 4 16 2.2. In Silico Prediction of Pharmacokinetics and Toxicological and Physicochemical Properties of Incomptine A and Methotrexate The absorption, distribution, metabolism, excretion, and toxicity (ADMET) properties of incomptine ( IA MTX 13 18 19 IA MTX Table 3 IA IA MTX IA MTX, MTX MTX MTX IA, Physicochemical properties are important parameters measured in medicinal chemistry to know the probability of the molecules submitted for study to be a candidate for the development of new drugs and their possibility of being administered orally ( Table 4 IA MTX IA MTX IA IA MTX, 2.3. Cytotoxic Activity of Incomptine A and Methotrexate The cytotoxic activities of incomptine A ( IA MTX IA MTX 5 IA MTX Figure 5 IA MTX Table 5 2.4. Antilymphoma Activity of Sesquiterpene Lactone, Incomptine A, and Methotrexate To evaluate the antilymphoma effect of sesquiterpene lactone, incomptine A ( IA MTX Table 6 IA MTX. 50 MTX IA In addition, the proteomics study was performed at a dose of 10 mg/kg; the antilymphoma activity was studied in these conditions. IA MTX MTX 2.5. Identification of Differentially Expressed Proteins in Lymph Nodes from Male Balb/C Mice with Non-Hodgkin Lymphoma and Treated with Incomptine A To delve deeper and explore the changes induced in the proteome of the lymph nodes from male Balb/c mice with non-Hodgkin lymphoma and treated with IA MTX The lymph nodes were clustered as pools of all mice in each group, including the 10 mg/kg and 1.25 mg/kg IA MTX Table 7 In total, we obtained 106 significant DEPs, including 66 downregulated and 40 upregulated; among these, IA IA Table 8 IA MTX Table 9 MTX Table 8 IA 2.6. Bioinformatic Analysis 2.6.1. Protein–Protein Interaction Network of Incomptine A Potential Targets for the Treatment of Non-Hodgkin Lymphoma In order to find the most important protein clusters altered and potential core targets of incomptine A ( IA Table 8 Table 9 Figure 6 2.6.2. Results of the Enrichment Study Performed with G: Profiler, Gene Ontology, Reactome, and Kyoto Encyclopedia of Genes and Genomes To visually disclose the enrichment pathways of the 106 DEPs, g: Profiler, gene ontology (GO), Reactome (REAC), and Kyoto Encyclopedia of Genes and Genomes (KEGG) analyses were carried out for a bioinformatics analysis. A large number of pathways were enriched according to g: Profiler analysis of the GO, REAC, and KEGG databases ( Figure 7 In total, 190 terms were significantly enriched with 179, 8, and 3 related with GO, KEGG, and REAC, respectively. In the case of GO, 25, 115, and 39 terms corresponded with molecular function (MF), biological process (BP), and cellular component (CC), respectively. The top 30 significantly enriched terms by GO, KEGG, and REAC are displayed in Figure 7 2.6.3. Results of the Gene Ontology Enrichment Study Gene ontology (GO) enrichment analysis was further utilized to explore the enriched biological process (BP), cellular component (CC), and molecular function (MF) terms. For the BP terms, muscle system process and muscle contraction were the most abundant among the top 10 biological processes ( Figure 8 Figure 8 2.6.4. Gene Ontology Enrichment Analysis and Kyoto Encyclopedia of Genes and Genomes Pathway Analysis The GO and KEGG enrichment analyses were carried out through the DAVID database to forecast the pathway and the functional annotation enrichment related to incomptine A (IA) for the treatment of NHL in male Balb/c mice. The full analysis of 106 DEPs performed through Gene ontology (GO) functional analysis yielded 179 entries, with 115 associated with biological process (BP), 39 under cellular component (CC), and 25 under molecular function (MF). These pathways showed the 10 most important pathways that are affected by the 105 DEPs. Figure 9 KEGG analysis was associated with cytoskeleton in muscle cells and motor proteins (D). Necroptosis ( Figure 10 Figure 10 2.6.5. Results of the Reactome Enrichment Analysis The analysis of Reactome (REAC) exhibited nine important networks: glycolysis, glucose metabolism, metabolism of carbohydrates, transport of small molecules, striated muscle contraction, muscle contraction, hemostasis, platelet activation signaling and aggregation, and transcriptional regulation by small RNAs, among others, were enriched in several DEPs ( Figure 11 Among these, glycolysis, glucose metabolism, and metabolism of carbohydrates were enriched in three downregulated genes, Eno2, Eno3, and Pgam2. Transport of small molecules was enriched in five genes; among these, Mb, Slc4a1, and Slc25a4 were downregulated, and Apod and Apoa4 were upregulated. Muscle contraction and striated muscle contraction were enriched in 14 downregulated genes: Tmod4, Tnnc2, Myh3, Myh8, Tpm1, Mybpc2, Myl3, Actn3, Myl1, Tpm2, Myl2, Acta1, Tnnt3, and Tnn12. Hemostasis was enriched in three downregulated genes containing Tgfb1, Actn2, and Atp2a1. Platelet activation signaling and aggregation was enriched in one downregulated gene, Tgfb1. Finally, transcriptional regulation by small RNAs was enriched in four upregulated proteins containing H4c11, Polr2e, H3f3b, and H2ax. 2.6.6. Molecular Docking Studies of the Sesquiterpene Lactone, Incomptine A Against Six Differentially Expressed Proteins in Non-Hodgkin Lymphoma in Mice We carried out molecular docking studies with the aim of deepening the antilymphoma properties of the sesquiterpene lactone, incomptine A ( IA IA MTX IA MTX MTX IA MTX, Table 9 IA MTX Table 10 Figure 12 3. Discussion Non-Hodgkin lymphomas (NHLs) are the 10th most common malignant neoplasm that are an important cause of mortality and morbidity around the world. In this sense, nearly 544,352 persons are diagnosed with NHL annually, resulting in nearly 259,793 deaths in 2020 [ 1 20 21 22 2 3 4 The first-line treatments for NHLs are chemotherapy and chemoimmunotherapy, including drugs such as prednisone, cisplatin, fludarabine, doxorubicin, vincristine, methotrexate, cyclophosphamide, etoposide, and rituximab. However, several of these drugs show limited efficacy, and some types of aggressive lymphomas relapse and progress into refractory lymphoma [ 23 24 25 3 5 Part of our ongoing research involves new anti-NHL drugs isolated from Mexican medicinal plants. Previously, we reported the antilymphoma activity in a mouse model at a dose of 5 mg/kg of the sesquiterpene lactone incomptine A ( IA 10 IA IA First, the dichloromethane extract of the leaves of Decachaeta incompta IA Figure 3 Table 1 Figure 4 Table 2 16 Once the identification of IA 18 26 27 28 IA MTX, 17 27 28 28 IA MTX MTX IA 1/2 MTX IA MTX IA MTX, 50 IA MTX. IA MTX IA MTX, 50 MTX 29 30 31 IA 32 MTX 33 34 MTX 5 35 IA the MTX 36 IA MTX IA After the ADMET analysis of IA 37 IA MTX Table 5 Figure 5 IA, 38 IA 10 17 IA 17 IA 39 40 41 42 43 Then, antilymphoma activity was tested by comparing the effect of IA MTX 3 IA MTX Table 6 IA 10 35 38 IA α γ 39 MTX 43 The next step of this work was to delve deeper and explore the changes induced in the proteome of the lymph nodes from male Balb/c mice with non-Hodgkin lymphoma and treated with IA 10 IA IA The results of antilymphoma activity showed that IA caused 62% growth inhibition of lymph nodes in male Balb/c mice. The case of MTX MTX Table 6 IA MTX Table 8 Table 9 IA 10 All DEPs altered by IA Figure 6 10 Figure 7 Figure 8 Figure 9 Figure 10 Figure 11 Four and a half LIM domains protein 1 (Fhl1) resulted in the most important cluster altered and a potential core target of IA 44 In relation to the proteins, Il1rap, Ifi44, Timd4, Apoa4, Fabp3, Myh3, Eno 2, and H4c11 showed ≤ 24 direct or indirect interaction relationships with other DEPs. These eight DEPs have been reported to be associated with one or more cancers including pancreatic, kidney, tongue, colorectal, breast, bone, cervical, stomach, small-cell lung, non-small-cell lung, head, neck, lung, liver, and nasopharyngeal cancer, among others, as well as myeloblastic, chronic myeloid, acute myeloid, and acute lymphoblastic leukemias. It is important to note that Il1rap, Ifi44, Timd4, Fabp3, and Eno 2 have been reported as potential therapeutic targets and potential prognostic biomarkers for several cancers [ 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 Molecular docking assay was performed to obtain additional information about the interaction between the sesquiterpene lactone IA 61 62 The results of molecular docking showed that IA MTX ΔG MTX IA MTX IA MTX In agreement with the GO, REAC, and KEGG pathway as well as TMT, PPI network, and molecular docking analyses, the sesquiterpene lactone IA IA IA IA 4. Materials and Methods 4.1. Isolation of Incomptine A from Dichloromethane Extract of Decachaeta Incompta The sesquiterpene lactone IA Decachaeta incompta 16 IA IA MTX 4.2. Chemicals and Instrumentation Triethylammonium bicarbonate buffer (1.0 M, pH 8.5 ± 0.1), tris (2-carboxyethyl) phosphine hydrochloride solution (0.5 M, pH 7.0), iodoacetamide (IAA), formic acid (FA), acetonitrile (ACN), methanol were purchased from Sigma Aldrich (St. Louis, MO, USA), trypsin from bovine pancreas Promega (Madison, WI, USA), ultrapure water (Millipore, Burlington, MA, USA), TMT 6-plex Isobaric Label Reagent, and Pierce Quantitative Colorimetric Peptide Assay Thermo Scientific (Waltham, MA, USA). were used in this work. An Ultimate 3000 nano UHPLC system was coupled to a Q Exactive HF MS equipped with a Nano spray Flex Ion Source Thermo Scientific (Waltham, MA, USA). TMT-based Quantification Analytical Service was provided by Creative Proteomics (Shirley, NY, USA). 4.3. Cell Culture Conditions U-937 cells were acquired from the American Type Culture Collection (CRL-1593,2, histiocytic lymphoma). To develop the mice model, U-937 cells were cultured at 37 °C in RPMI 1640 culture medium (GIBCO Cat: 11875-093) supplemented with 5% fetal bovine serum (GIBCO Cat: 16000044), streptomycin (100 μg/mL)/penicillin (100 U/mL), and 5% CO2. In vivo tests were realized using cell cultures at a density of 2.5 × 10 6 The cytotoxic activity of incomptine A ( IA 3 IA MTX 2 2 v v 50 p 4.4. Animals To induce the lymphoma model, healthy male Balb/c mice (25 ± 3g) were provided by the animal house of the Centro Medico Nacional Siglo XXI, from Instituto Mexicano del Seguro Social. The research had ethical authorization by the National Committee of Scientific Research from the Instituto Mexicano del Seguro Social with registration numbers: R-2018-785-111 and R-2020-3601-186. Mice were maintained in polyvinyl cages at 22 °C and light–dark periods of 12 h, with ad libitum access to food and water in agreement with Mexican Official Norma, NOM-062-ZOO-1999 [ 63 4.4.1. Antilymphoma Test Briefly, healthy male Balb/c mice were divided into 9 groups with 5 mice per group: LNNHL1, LNNHL, LNNHLTIA [LNNHLTIAa, LNNHLTIAb, LNNHLTIAc, and beingLNNHLTIAd], and LNNHLTMTX [LNNHLTMTXa, LNNHLTMTXb, and LNNHLTMTX c]. For comparison, LNNHL1, designated as the healthy group, was treated with tween 80 in water (2% v v 6 6 IA −1 MTX −1 50 The ED 50 n p 4.4.2. Non-Hodgkin’s Lymphoma Protein Expression Induced Through IA or MTX To evaluate the effects in the proteome of the non-Hodgkin lymphoma experimental model, we clustered the lymph nodes as pools of all mice in each group, concerning IA MTX MTX IA 4.4.3. Nano UHPLC-MS/MS Analyses The labeled peptides obtained in Section 4.4.2 5 4.4.4. Protein Identification The six raw MS files were subjected to analysis and compared against mouse protein database using Maxquant (v2.6.7.0), ProteoWizard (version 3), and Proteome Discoverer 3.2 (ThermoFisher, Waltham, MA, USA). The parameters were set as follows: The protein modifications were oxidation (M, variable), carbamidomethylation (C, fixed), and TMT-6Plex. Enzyme specificity was set to trypsin, the precursor ion mass tolerance was set to 10 ppm, the maximum missed cleavages were set to 2, and MS/MS tolerance was 0.6 Da. The distribution of all the proteins identified according to the protein mass (kDa), the distribution of 20,453 peptides identified according to the length, and the distribution of 2717 of the proteins identified according to sequence coverage, were performed. Data analytical report was carried out by Analytical Service from Creative Proteomics (New York, NY, USA) with p 4.4.5. Differentially Expressed Protein Analysis A total of 2717 proteins were identified for this work, with (C-)/TMT and MTX IA IA IA 4.5. Bioinformatic Methodology The log ratio data matrix was used to feed the algorithms for the analysis of cellular process enrichment networks and signaling pathways through programming language R v4.2.2 and RStudio v3.1.4, applying the clusterProfiler v4.2.2, MSigDB in R (Molecular Signatures Database, accessed 24 May 2025), enrich plot, and ggplo2 packages (accessed 24 May 2025). Also, we used symbol. mouse ID data (org.Mm.eg.db, accessed 24 May 2025), KEGG (Kyoto Encyclopedia of Genes and Genomes), gene ontology (GO), biological process (BP), molecular function (MF), and cellular component (CC), and Reactome databases. The enrichGO, compareCluster, and enrichKEGG functions were applied. The results were plotted with the functions “emapplot”, “aplot_list”, “dotplot”, and “cnetplot” for visualization. Dotplot and three onthologies plots enrichment was performed with the ClusterProfiler package of the R v4.2.2 tool, following the steps proposed by the developer, using the GO databases (BP, MF, CC) and FDR < 0.05 as the value of statistical significance. Additionally, enrichment networks were performed in Cytoscape plug-in using the ClueGo (Version 2.5.10) as well as STRING plugins (confidence cutoff of 0.4) for both analyses, following the developer’s manual using KEGG and GO databases and setting a p 64 4.5.1. Comparison of Shared Processes and Molecules Differentially expressed proteins obtained for each treatment were analyzed with the g: Profiler tool available online. Graphs and pathway enrichment tables and figures were generated by comparing with KEGG, GO, and Reactome databases. Enrichment plot images generated in the x-axis show the number of different enriched processes according to each database, while the y-axis plots the significance value obtained in ascending order (−log10 adj- p p 65 66 67 http://geneontology.org/ https://www.uniprot.org/ www.genome.jp/kegg/pathway.html 4.5.2. In Silico Physicochemical, Pharmacokinetic, and Toxicological Properties To determine the physicochemical, pharmacokinetic, and toxicological properties of IA MTX 68 19 69 70 IA MTX IA MTX 4.5.3. Molecular Docking Studies Blind docking experiments were carried out in order to determine the probability of the ligands MTX and IA to bind to the proteins proposed in the study. The apolipoprotein A-IV (Apoa4, ID: P06728 P11404 P97447 Q8BV66 Q61730 https://www.uniprot.org/ For ligands optimization, the two-dimensional (2D) structure of methotrexate (CID: 126941) was retrieved from the chemical library PubChem ( https://pubchem.ncbi.nlm.nih.gov/ 71 Docking analysis was carried out using Autodock 4.2 software [ 72 3 7 https://www.3ds.com/products/biovia/discovery-studio 73 5. Conclusions In conclusion, we used GO, REAC, and KEGG pathways as well as TMT, PPI network, ADMET, and molecular docking analyses and identified 106 differentially expressed lymph node proteins in NHL. We likewise found that Fhl1 was the most important core protein expressed in this study, suggesting that it plays an important role in the pathology of NHL. Also, the results suggest that Fhl1 could be a potential therapeutic target and potential prognostic biomarker of NHL. In addition, we provide additional evidence that supports IA IA Acknowledgments The authors would like to thank Donovan García García for the technical support given to create and upload the mass spectrometry proteomics data to BS. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, F.C. and N.G.-H.; Methodology, E.B. (Elihú Bautista), E.B. (Elizabeth Barbosa), C.V., J.M.S.-L. and M.V.; Software, J.M.S.-L. and M.V.; Validation, N.G.-H. and F.C.; Formal analysis N.G.-H. and F.C.; Investigation, E.B. (Elihú Bautista), E.B. (Elizabeth Barbosa), C.V., J.M.S.-L. and M.V.; Resources, F.C. and N.G.-H.; Data curation, C.V. and E.B. (Elizabeth Barbosa); Writing—original draft preparation, F.C., M.V., J.M.S.-L. and N.G.-H.; Writing—review and editing, F.C. and N.G.-H.; Visualization, F.C.; Supervision, N.G.-H.; Project administration and funding acquisition, F.C. and N.G.-H. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Study was approved by the National Ethics Committee of the Instituto Mexicano del Seguro Social, protocol codes R-2018-785-111 (9 October 2018) and R-2020-3601-186 (12 August 2020). Informed Consent Statement This research study did not involve humans. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author(s). Conflicts of Interest Authors declare they have no conflicts of interest. References 1. Rapier-Sharman N. Clancy J. Pickett B.E. Joint secondary transcriptomic analysis of non-Hodgkin’s B-cell lymphomas predicts reliance on pathways associated with the extracellular matrix and robust diagnostic biomarkers J. Bioinform. Syst. Biol. 2022 5 119 135 10.26502/jbsb.5107040 36873459 PMC9980876 2. Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram L. Jemal A. Bray F. Glabal cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2021 71 209 249 33538338 10.3322/caac.21660 3. Hernández-Ruiz E. Alvarado-Ibarra M. Lien-Chang L.E. Banda-Garcia L. Aquino-Salgado J.L. Barragan-Ibanez G. Ramirez-Romero E.F. Nolasco-Cancino C. Herrera-Olivares W. Morales-Adrian J.J. Epidemiology and clinical characteristics of non-Hodgkin lymphoma in Mexico World J. Oncol. 2021 12 28 33 10.14740/wjon1351 33738003 PMC7935617 4. Palacio-Mejia L.S. Hernandez-Avila J.E. Hernandez-Avila M. Dyer-Leal D. Barranco A. Quezada-Sanchez A.D. Alvarez-Aceves M. Cortes-Alcala R. Fernandez-Wheatley J.L. Ordonez-Hernandez I. Leading causes of excess mortality in Mexico during the COVID-19 pandemic 2020–2021: A death certificates study in a middle-income country Lancet Reg. Health Am. 2022 13 100303 10.1016/j.lana.2022.100303 35782204 PMC9230439 5. Howard S.C. McCormick J. Pui C.H. Buddington R.K. Harvey R.D. Preventing and managing toxicities of high-dose methotrexate Oncologist 2016 21 1471 1482 10.1634/theoncologist.2015-0164 27496039 PMC5153332 6. Zeng J. Luo Q. Wang X. Xie W. Dong S. Fu H. Wei Y. Liu T. Network pharmacology- and molecular docking-base investigation of the therapeutical potential and mechanism of daucosterol against multiple myeloma Transl. Cancer Res. 2023 12 1006 1020 10.21037/tcr-23-456 37180669 PMC10174762 7. Zhu C. Cheng H. Li N. Liu T. Ma Y. Isobaric tags for relative and absolute quantification-based proteomics reveals candidate proteins of fat deposition in Chinese indigenous sheep with morphologically different tails Front. Genet. 2021 12 710449 10.3389/fgene.2021.710449 34868196 PMC8634704 8. Zhang H.-J. Lan H.-Q. Wang M.-Y. Wang C.-F. Wei L.-G. Xu C. Transcriptome analysis reveals norathyriol prolongs the lifespan via regulation metabolism in C. elegans Metabolites 2024 14 716 10.3390/metabo14120716 39728497 PMC11678140 9. Wang S. Hong H. Yuan Y. Yin Y. Zeng J. Xiao J. Exploring the mechanism of action of quercetin for the treatment of cervical high-risk human papilloma virus using network pharmacology and molecular docking Chin. Med. Nat. Prod. 2024 4 e35 e42 10.1055/s-0044-1782158 10. Calzada F. García-Hernández N. Bautista E. Sánchez-López J.M. Valdes M. Velázquez C. Barbosa E. Understanding the molecular mechanisms of incomptine A in treating non-Hodgkin lymphoma associated with U-937 cells: Bioinformatics approaches, Part I Pharmaceuticals 2024 18 5 10.3390/ph18010005 39861068 PMC11768224 11. Merzouki O. Arrousse N. Ech-chihbi E. Alanazi A.S. Mabrouk E.H. Hefnawy M. El Moussaoui A. Touijer H. El Barnossi A. Taleb M. Enveironmentally friendly synthesis of new mono. And bis-pyrazole derivatives; in vitro antimicrobial, antifungal, and antioxidant activity; and in silico studies: DFT, ADMETox, and molecular docking Pharmaceuticals 2025 18 167 10.3390/ph18020167 40005981 PMC11858278 12. Kalitin N. Koroleva N. Lushnikova A. Babaeva M. Samoylenkova N. Savchenko E. Smirnova G. Borisova Y. Kostarev A. Karamysheva A. N-glycoside of indolo [2, 3- a c Pharmaceuticals 2024 17 1642 10.3390/ph17121642 39770484 PMC11676706 13. Bulbul M.V. Mermer A. Kolbasi B. Kocabas F. Kalender S.M. Kirectepe Aydin K.A. Demiorcan T. Keskin I. mTor pathway inhibition, anticancer activity and in silico calculations of novel hydazone derivatives in two- and three-dimensional cultured type 1 endometrial cancer cells Pharmaceuticals 2024 17 1562 10.3390/ph17121562 39770404 PMC11678851 14. Kolberg L. Raudvere U. Kuzmin I. Adler P. Vilo J. Peterson H. g: Profiler-interoperable web service for functional enrichment analysis and gene identifier mapping (2023 update) Nucleic Acids Res. 2023 51 W207 W212 10.1093/nar/gkad347 37144459 PMC10320099 15. Li D.-F. Cui Z.-H. Wang L.-Y. Zhang K.-H. Cao L.-T. Zheng S.-J. Zhang L.-X. Tandem mas tag (TMT)-based proteomic analysis of Cryptosporidium andersoni Parasit. Vectors 2021 14 608 10.1186/s13071-021-05113-6 34922597 PMC8683822 16. Bautista E. Calzada F. Yepez-Mulia L. Chavez-Soto M. Ortega A. Incomptines C and D, two heliangolides from Decachaeta incompta Planta Med. 2012 78 1698 1701 10.1055/s-0032-1315255 22948610 17. Arietta-García A.G. Calzada F. Ramírez-Sánchez I. Bautista E. García-Hernandez N. Ordoñez-Razo R.M. Advances in the properties of incomptine A: Cytotoxic activity and downregulation of hexokinase II in breast cancer cell lines Int. J. Mol. Sci. 2023 24 12406 10.3390/ijms241512406 37569780 PMC10419048 18. Taslimi P. Akhundova F. Kurbanova M. Türkan F. Tuzum B. Sujayev A. Sadeghian N. Maharramov A. Farzaliyev V. Gülcin I. Biological activity and molecular docking study of some bicyclic structures: Antidiabetic and anticholinergic potentials Polycycl. Aromat. Comp. 2022 42 6003 6016 10.1080/10406638.2021.1981405 19. Daina A. Michielin O. Zoete V. SwissADME: A free web tool to evaluate pharmacokinetics, drug-likeness and medicinal chemistry friedlieness of small molecules Sci. Rep. 2017 7 42717 10.1038/srep42717 28256516 PMC5335600 20. Ferlay J. Colombet M. Soerjomataram I. Parkin D.M. Piñeros M. Znaor A. Bray F. Cancer statistics for the year 2020: An overview Int. J. Cancer 2021 149 778 789 10.1002/ijc.33588 33818764 21. Lasater E.A. Amin D.N. Bannerji R. Mali R.S. Barret K. Rys R.N. Oeh J. Lin E. Sterne-Weiler T. Ingalla E.R. Targeting MCL-1 and BCL-2 with polatuzumab, vedotin and venetoclax overcomes treatment resistance in R/R non-Hodgkin lymphoma: Results from preclinical models and a phase IB study Am. J. Hematol. 2023 98 449 463 10.1002/ajh.26809 36594167 22. Cho-Vega J.H. Rassidakis G.Z. Admirand J.H. Oyarzo M. Ramalingam P. Paraguaya A. Medeiros L.J. MCL-1 expression in B-cell non-Hodgkin’s lymphomas Hum. Pathol. 2004 35 1095 1100 10.1016/j.humpath.2004.04.018 15343511 23. Zare-Shahneh F. Valiyari S. Barandaran B. Abdolalizadeh J. Bandehagh A. Azadmehr A. Hajiaghaee R. Inhibitory and cytotoxic activities of Salvia officinais Adv. Pharm. Bull. 2013 3 51 55 24312812 10.5681/apb.2013.009 PMC3846054 24. Cvetkovic’ Z. Markovic’ O. Marinkovic’ G. Pejic’ S. Vucic’ V. Tumor microenvironment, inflammation, and inflammatory prognostic indices in diffuse large B-cell lymphomas: A Narrative review Int. J. Mol. Sci. 2025 26 5670 10.3390/ijms26125670 40565133 PMC12192974 25. Swerdlow S.H. Campo E. Pileri S.A. Harris N.L. Stein H. Siebert R. Advani R. Ghielmini M. Salles G.A. Zelenetz A.D. The 2016 revision of the World Health Organization classification of lymphoid neoplasms Blood J. Am. Soc. Hematol. 2016 127 2375 2390 10.1182/blood-2016-01-643569 26980727 PMC4874220 26. Liu Y. Lawless M. Li M. Fairman K. Embry M. Mitchell C.A. Prediction of physicochemical and pharmacokinetic properties of botanical constituents by computational models J. Appl. Toxicol. 2024 44 1236 1245 10.1002/jat.4617 38655841 27. Khan T. Lawrence A. Azad I. Raza S. Joshi S. Khan A. Computational drug design and prediction of important parameters using in silico methods—A review Curr. Comput. Aided Drug Des. 2019 15 384 397 10.2174/1573399815666190326120006 30914032 28. Cheng F. Li W. Liu G. Tang Y. In silico ADMET prediction: Recent advances, current challenges and future trends Curr. Top. Med. Chem. 2013 13 1273 1289 10.2174/15680266113139990033 23675935 29. Widemann B. Adamson P. Understanding and managing methotrexate nephrotoxicity Oncologist 2006 11 694 703 10.1634/theoncologist.11-6-694 16794248 30. Rizvi S. Shahzad Y. Saleh A. Muhammad N. Dose issues in cancer chemotherapy Oncology 2020 98 520 527 10.1159/000506705 32369814 31. Guellec C. Blasco H. Benz I. Hulin A. Therapeutic drug monitoring of methotrexate after its administration in high-dose protocols Therapie 2010 65 163 169 10.2515/therapie/2010016 20699066 32. Calzada F. Bautista E. Hidalgo-Figueroa S. Garcia-Hernandez N. Barbosa E. Velazquez C. Ordoñez-Razo R.M. Arietta-Garcia A.G. Antilymphoma effect of incomptine A: In Vivo, in silico, and toxicological studies Molecules 2021 26 6646 10.3390/molecules26216646 34771055 PMC8588555 33. Widemann B. Balis F. Kempf-Bielak B. Bielak S. Pratt C. Ferari S. Bacci G. Craft A. Adamson P. High-dose methotrexate-induced nephrotoxicity in patients with osteosarcoma Cancer 2004 100 2222 2223 10.1002/cncr.20255 15139068 34. Darmon M. Ciroldi M. Thiery G. Schelmmer B. Azoulay E. Clinical review: Specific aspects of acute renal failure in cancer patients Crit. Care 2006 10 211 10.1186/cc4907 16677413 PMC1550893 35. Calzada F. Solares-Pascasio J.I. Valdes M. Garcia-Hernandez N. Velazquez C. Ordoñez-Razo R.M. Barbosa E. Antilymphoma potential of the ethanol extract and rutin obtained of the leaves from Schinus mole Phcog. Res. 2018 10 119 123 10.4103/pr.pr_90_17 36. Campbell M. Perrier D. Dorr R. Alberts D. Finley P. Methotrexate: Bioability and pharmacokinetics Cancer Treat. Rep. 1985 69 833 838 3893694 37. Zubair A.C. Ali S.A. Rees R.C. Goepel J.R. Winfield D.A. Goysns M.H. Analysis of the colonization of unirradiated and irradiated SCID mice by human lymphoma and non-malignant lymphoid cells Leuk. Lymphoma 1996 22 463 471 10.3109/10428199609054785 8882960 38. Calzada F. Ramírez-Santos J. Ordoñez-Razo R.M. Valdes M. Velazquez C. Barbosa E. Anti-lymphoma activity of acyclic terpénoids and its structure-activity relationship: In vitro, in vitro, and in silico studies Int. J. Mol. Sci. 2025 26 5683 10.3390/ijms26125683 40565145 PMC12192932 39. Babaei G. Aliarab A. Abroon S. Rasmi Y. Aziz S.G. Application of sesquiterpene lactone: A new promising from cancer therapy based on anticancer activity Biomed. Pharmacother. 2018 105 239 246 10.1016/j.biopha.2018.06.131 29966966 40. Abdolmohamma M.H. Fouladdel S. Shafiee A. Amin G. Ghaffari S. Azizi E. Anticancer effects and cell cycle analysis on human breast cancer T47D cells treated with extracts of Astrodaucus persicus J. Pharm. Sci. 2008 16 112 118 41. Perumal A. AlSalhi M.S. Kanakarajan S. Devanesan S. Selvaraj R. Tamizhazhagan V. Phytochemical evaluation and anticancer activity of rambutan ( Nephelium lappaceum Saudi J. Biol. Sci. 2021 28 1816 1825 10.1016/j.sjbs.2020.12.027 33732067 PMC7938207 42. Suffness M. Douros J. Current status of the NCI plant and animal product program J. Nat. Prod. 1982 45 1 14 10.1021/np50019a001 7069421 43. Shetty A. Cho W. Alazawi W. Syn W.K. Methotrexate hepatotoxicity and the impact of nonalcoholic fatty liver disease Am. J. Med. Sci. 2017 354 172 181 10.1016/j.amjms.2017.03.014 28864376 44. Tao Y. Wu Y. Shen R. He S. Miao X. Role of four and half LIM domain protein 1 in tumors (Review) Oncol. Lett. 2024 29 37 10.3892/ol.2024.14783 39512507 PMC11542161 45. Frenay J. Belleye P.-S. Oudot A. Helbling A. Petitot C. Ferrand C. Collin B. Dias A.M.M. IL-1RAP, a key therapeutic target in cancer Int. J. Mol. Sci. 2022 23 14918 10.3390/ijms232314918 36499246 PMC9735758 46. Pan H. Wang H. Huang W. Dai Y. Yang M. Liang H. Wu X. Zhang L. Huang W. Yuan L. Interferon-induced protein 44 correlated with immune infiltration serves as a potential prognostic indicator in head and neck squamous cell carcinoma Frotn. Oncol. 2020 10 557157 10.3389/fonc.2020.557157 PMC7573551 33123469 47. Li H. Zhang J. Zhang Y. Li Z. Han Y. Lun Y. A Pan-cancer study of tumor associated efferocytosis core genes and preliminary exploration of TIMD4 in renal cell carcinoma J. Cell. Mol. Med. 2025 29 e70671 10.1111/jcmm.70671 40576208 PMC12203409 48. Darwish N.M. Al-Hail M.K. Mohamed Y. Saady R.A. Mohsen S. Zar A. Al-Mansoori L. Pederson S. Apolipoproteins in the commonest cancers Cancers 2023 15 5565 10.3390/cancers15235565 38067270 PMC10705282 49. Tang Z. Shen Q. Xie H. Zhou X. Li J. Feng J. Liu H. Wang W. Zhang S. Ni S. Elevated expression of FABP3 and FABP4 cooperatively correlates with porr prognosis in non-small cell lung cancer (NSCLC) Oncotarget 2016 7 46253 46261 10.18632/oncotarget.10086 27323829 PMC5216795 50. Toydemir R.M. Rutherford A. Whitby F.G. Jorde L.B. Carey J.C. Bamshad M.J. Mutations in embryonic myosin heavy chain (MYH3) cause Freeman-Sheldon syndrome and Sheldon-Hall syndrome Nat. Genet. 2006 38 561 565 10.1038/ng1775 16642020 51. Hu G. Yao H. Wei Z. Li L. Yu Z. Li J. Luo X. Guo Z. A bioinformatic approach to identify a disufidptosis-related gene signature for prognostic implication in colon adenocarcinoma Sci. Rep. 2023 13 12403 37524774 10.1038/s41598-023-39563-y PMC10390519 52. Lee D.-Y. Kang Y. Im N.-R. Kim B. Kwon T.-K. Jung K.-Y. Baek S.-K. Actin-associated gene expression is aassociated with early regional metastasis of tongue cancer Laryngoscope 2021 131 813 819 10.1002/lary.29025 33237593 53. Yu X.-J. Yang M.-J. Zhou B. Wang G.-Z. Huang Y.-C. Wu L.-C. Cheng X. Wen Z.-S. Huang J.-Y. Zhang Y.-D. Characterization of somatic mutations in air pollution-related lung cancer EBioMedicine 2015 2 583 590 10.1016/j.ebiom.2015.04.003 26288819 PMC4534757 54. Sun J. Li S. Wang F. Fan C. Wang J. Idetification of key pathways and genes in PTEN mutation prostae cancer by bioinformatics analysis BMC Med. Genet. 2019 20 191 10.1186/s12881-019-0923-7 31791268 PMC6889628 55. Pan D. Chen J. Feng C. Wu W. Wang Y. Tong J. Zhou D. Preferential localization of MUC1 glycoprotein in exosomes secreted by non-small cell lung carcinoma cells Int. J. Mol. Sci. 2019 20 323 10.3390/ijms20020323 30646616 PMC6358839 56. Zhang Q. Hu H. Chen S.-Y. Liu C.-J. Hu F.-F. Yu J. Wu Y. Guo A.-Y. Transcriptome and regulatory network analyses of CD-19-CART-T immunotherapy for B-ALL Genom. Proteom. Bioinform. 2019 17 190 200 10.1016/j.gpb.2018.12.008 PMC6620363 31201998 57. Yan G. Dai M. Poulet S. Wang N. Boudreault J. Daliah G. Ali S. Lebrun J.-J. Combined in vitro/in vivo genome-wide CRISPR screens in triple negative breast cancer identify cancer stemness regulators in paclitaxel resistence Oncogenesis 2023 12 51 10.1038/s41389-023-00497-9 37932309 PMC10628277 58. Liu C.-C. Wang H. Wang W.-D. Wang L. Liu W.-J. Wang J.-H. Geng Q.-R. ENO2 promotes cell proliferation, glycolys, and glucocorticoid-resistance inn acute lymphoblastic leukemia Cell. Physiol. Biochem. 2018 46 1525 1535 10.1159/000489196 29689546 59. Isgró M.A. Bottoni P. Scatena R. Neuron-specif enolase as a biomarker: Biochemical and clinical aspects Advances in Cancer Biomarkers Advances in Experimental Medicine and Biology 867 Springer Science Dordrecht, The Netherlands 2015 867 126 143 10.1007/978-94-017-7215-0_9 26530364 60. Gao L. Yang F. Tang D. Xu Z. Tang Y. Tang Y. Yang D. Sun D. Chen Z. Teng Y. Mediation of PKM2-dependent glycolytic and non-glycolytic pathways by ENO2 in head and neck cancer development J. Exp. Clin. Cancer Res. 2023 42 1 10.1186/s13046-022-02574-0 36588153 PMC9806895 61. Agu P. Afiukwa C. Orji O. Ezeh E. Ofole I. Ogbu C. Uwuja E. Aja P. Molecular docking as a tool for the discovery of molecular targets of nutraceuticals in diseases management Sci. Rep. 2023 7 13384 13421 10.1038/s41598-023-40160-2 PMC10435576 37592012 62. Ferreira L. N dos Santos R. Oliva C. Anridopulo A. Molecular Docking and Structure-Based Drugs Design Strategies Molecules 2013 20 13384 13421 10.3390/molecules200713384 PMC6332083 26205061 63. NOM-062-ZOO-1999 Norma Oficial Mexicana. Especificaciones Técnicas para la Producción, Cuidado y uso de Animales de Laboratorio Diario Oficial de la Federación Mexico City, Mexico 2001 Available online: https://www.gob.mx/cms/uploads/attachment/file/203498/NOM-062-ZOO-1999_220801.pdf (accessed on 13 January 2025) 64. Wu T. Hu E. Xu S. Chen M. Guo P. Dai Z. Feng T. Zhou L. Tang W. Zhan L. clusterProfiler 4.0: A universal enrichment tool for interpreting omics data Innovation 2021 2 100141 10.1016/j.xinn.2021.100141 34557778 PMC8454663 65. Raudvere U. Kolberg L. Kuzmin I. Arak T. Adler P. Peterson H. Vilo J. g: Profiler: A web server for functional enrichment analysis and conversions of gene lists (2019 update) Nucleic Acids Res. 2019 47 W191 W198 10.1093/nar/gkz369 31066453 PMC6602461 66. Sun L. Dong S. Ge Y. Fonseca J.P. Robinson Z.T. Mysore K.S. Mehta P. DiVenn: An Interactive and integrated web-based visualization tool for comparing gene lists Front. Genet. 2019 10 421 10.3389/fgene.2019.00421 31130993 PMC6509638 67. Oliveros J.C. Venny. An interactive Tool for Comparing Lists with Venn’s Diagrams Available online: https://bioinfogp.cnb.csic.es/tools/venny/index.html (accessed on 11 May 2025) 68. Xiong G. Wu Z. Yi J. Fu L. Yang Z. Hsieh C. Yin M. Zeng X. Wu C. Lu A. ADMETlab 2.0: An integrative online plataform for accurate and comprehensive predictions of ADMET properties Nucleic Acids Res. 2021 49 W5 W14 10.1093/nar/gkab255 33893803 PMC8262709 69. Cheng F.X. Li W.H. Zhou Y.D. Shen J. Wu Z.R. Liu G.X. Lee P.W. Tang Y. admetSAR: A Comprehensive source and free tool for assessment of chemical ADMET properties J. Chem. Inf. Model. 2012 52 3099 3105 10.1021/ci300367a 23092397 70. Banerjee P. Kemmler E. Dunkel M. Preissner R. ProTox 3.0: A webserver for the prediction of toxicity of chemicals Nucleic Acids Res. 2024 52 W513 W520 10.1093/nar/gkae303 38647086 PMC11223834 71. Hanwell M. Curtis D. Lonie D. Vandermeersch T. Zurek E. Hutchison G. Avogadro: An advanced semantic chemical editor, visualization, and analysis platform J. Cheminform. 2012 4 17 10.1186/1758-2946-4-17 22889332 PMC3542060 72. Morris G. Lindstrom W. Sanner M. Belew R. Goodshell D. Olson A. Autodock4 and AutodockTools4: Automated docking with selective receptor flexibility J. Comput. Chem. 2009 30 2785 2791 10.1002/jcc.21256 19399780 PMC2760638 73. Drug Discovery BIOVIA Discovery Studio Visualizer Version 20.1.0.19295 Dassault Systems BIOVIA Waltham, MA, USA 2025 Available online: https://www.3ds.com/products/biovia/discovery-studio (accessed on 22 May 2025) Figure 1 Pharmacological activities reported for incomptine A ( IA Figure 2 Decachaeta incompta Figure 3 Chromatographic profile (240 nm) of dichloromethane extract from Decachaeta incompta (DCEDi) leaves ( A B Figure 4 Thin-layer chromatography of presumptive identification of incomptine A ( IA Decachaeta incompta 3 254 2 4 Figure 5 Cytotoxic activity of IA MTX IA A MTX B n p 50 50 Figure 6 PPI network map of protein clusters and core targets in male Balb/c mice with non-Hodgkin lymphoma treated with incomptine A. The green color shows downregulated proteins and the red/cream color shows upregulated proteins. PPI, protein–protein interaction. Figure 7 Results of bioinformatics analysis using g: Profiler. ( A B Figure 8 Gene ontology (GO) enrichment analysis of DEPs obtained from male Balb/c mice with non-Hodgkin lymphoma treated with incomptine A. BP, biological process; CC, cellular component; MF, molecular function. Figure 9 GO enrichment analysis and KEGG pathway analysis in male Balb/c mice with non-Hodgkin lymphoma. ( A B C D Figure 10 Correlation between DEPs and pathways in KEGG analysis: ( A B Figure 11 Correlation between DEPs and networks in REAC analysis. Figure 12 The interaction mode between incomptine A ( 1 2 A B C D E F pharmaceuticals-18-01263-t001_Table 1 Table 1 HPLC coupled to diode array, retention time, and percentage in area of incomptine A identified of the dichloromethane extract from Decachaeta incompta leaves. Compound R.T. * (min) Area (%) Molecular Weight (g/mol) Molecular Formula Incomptine A 44.95 10.42 304.35 C 17 20 5 * R.T.: Retention time. pharmaceuticals-18-01263-t002_Table 2 Table 2 1 13 IA 3 Position Incomptine A δ H J δ C 1 3.26 dd (7.5, 1.0) 60.4 2 5.55 dd (11.5, 7.5 128.3 3 6.14 d (11.5) 132.3 4 - 136.0 5 5.31 dq (11.0, 1.5) 126.1 6 5.01 dd (11.0, 1.5) 75.7 7 2.94 quin (3.0, 1.5) 50.1 8 5.20 ddd (4.5, 3.0, 2.0) 77.0 9 2.70 dd (14.5, 4.5) 43.0 9’ 1.38 ddd (14.5, 3.0, 0.5  10 - 61.2 11 - 137.2 12 - 169.7 13 6.40 dd (2.0, 0.5) 124.8 13’ 5.80 d (2.0  14 1.41 s 19.7 15 1.88 s 23.7 Ac (C=O) - 169.2 Ac (CH 3 2.02 s 20.7 pharmaceuticals-18-01263-t003_Table 3 Table 3 Expected pharmacokinetic and toxicological properties for incomptine A (IA) and methotrexate (MTX). Pharmacokinetics Properties  Absorption   Metabolism   IA  MTX    IA  MTX Gastrointestinal absorption High Low  CYP2C9 substrate No No Hematoencephalic barrier Yes No  CYP2D6 substrate No No Caco-2 permeability High Low  CYP3A4 substrate Yes Yes p-glycoprotein substrate Yes Yes  CYP2C9 inhibitor No No p-glycoprotein inhibitor No No  CYP2D6 inhibitor No No Log Kp (skin permeation) –6.89 cm/s –10.39 cm/s  CYP3A4 inhibitor No No   CYP1A2 inhibitor No No     CYP2C19 inhibitor No No  Distribution   Excretion Mitochondrial Yes Yes  CL 4.64 mL/min/Kg 2.41 mL/min/Kg Protein plasma binding 75.9% 63.4%  T 1/2 0.78 h 0.39 h Volume distribution 1.38 L/Kg 0.32 L/Kg      Toxicity   IA  MTX    IA  MTX Hepatotoxicity Inactive Active  Carcinogenicity Inactive Inactive Neurotoxicity Inactive Active  Immunotoxicity Inactive Inactive Nephrotoxicity Inactive Inactive  Mutagenicity Inactive Inactive Respiratory toxicity Active Active  Cytotoxicity Inactive Inactive Cardiotoxicity Inactive Inactive     Predicted rats LD 50 2.68 mol/Kg 3.49 mol/Kg     Predicted human LD 50 1330 mg/Kg 3.0 mg/Kg     Expected toxicity class * IV I     Predictions were obtained from ADMETlab, SwissADME, admetSAR, and PROTOX web servers. T 1/2 50 50 50 50 50 50 50 pharmaceuticals-18-01263-t004_Table 4 Table 4 Physicochemical properties for IA MTX  Physicochemical Properties    IA  MTX  Drug-Likeness Molecular formula C 17 22 5 C 20 22 8 5  Molecular weight 306.35 g/mol 454.44 g/mol   IA  MTX TPSA 65.13 Å 2 210.54 Å 2 Lipinsky Yes Yes Lipophilicity (LogP) 2.33 −0.32 Ghose Yes Yes Water solubility (LogS) −2.71 −2.41 Veber Yes No, 1 violation Solubility class Soluble Very soluble Egan Yes No, 1 violation Number of rotating links 2 10 Muegge Yes No, 1 violation Number of H-bond donors 0 5 PAINS 0 0 Number of H-bond acceptors 5 9    Predictions were obtained from ADMETlab and SwissADME. pharmaceuticals-18-01263-t005_Table 5 Table 5 Median cytotoxic concentration calculated against U-937 cell line from IA MTX Compound CC 50 a Incomptine A ( IA 0.29 ± 0.01 * Methotrexate ( MTX 1.60 ± 0.02 a 50 n p pharmaceuticals-18-01263-t006_Table 6 Table 6 Results of the antilymphoma activity after the treatment with IA MTX Compound % Inhibition (10 mg/kg) in Male Balb/c Mice a ED 50 b Incomptine A ( IA 62.0 ± 1.5 7.5 ± 0.01 Methotrexate ( MTX ND * 1.4 ± 0.02 a n p b pharmaceuticals-18-01263-t007_Table 7 Table 7 Differentially expressed proteins for the treatment of IA MTX C-(DMSO) vs Downregulated FC < 0.66 (1/1.5) Upregulated FC > 1.5 MTX 57 7 IA 66 40 Data represents the fold change (FC) with the number of DEPs. IA MTX pharmaceuticals-18-01263-t008_Table 8 Table 8 Proteins altered for IA IA MTX Protein ID Protein Name Gene Name IA (FC) MTX (FC) P04202 Transforming growth factor beta 1 Tgfb1 0.643493 WC P97434 Myosin phosphatase Rho interacting protein Mprip 0.637507 WC Q9EQN3 Domain family member 4 Tsc22d4 0.621895 WC P49717 DNA replication licensing factor MCM4 Mcm4 0.605720 WC P56375 Acylphosphatase-2 Acyp2 0.612446 WC Q64339 Ubiquitin-like protein ISG15 Isg15 0.596993 WC Q8CI51 PDZ and LIM domain protein 5 Pdlim5 0.610126 WC Q9QXV3 Inhibitor of growth protein 1 Ing1 0.612365 WC Q9WVR4 RNA-binding protein Fxr2 0.604267 WC P15089 Mast cell carboxypeptidase A Cpa3 1.684613 WC P57746 V-type proton ATPase subunit D Atp6v1d 1.692460 WC Q00623 Apolipoprotein A-I Apoa1 1.714051 WC Q61490 CD 106 antigen Alcam 1.592873 WC Q64314 Hematopoietic progenitor cell antigen CD34 Cd34 1.557006 WC Q80SZ7 Guanine nucleotide-binding protein G(I)/G(S)/G(O) Gng5 1.847469 WC Q8C3X2 Coiled-coil domain-containing protein 90B Ccdc90b 1.602073 WC Q9CQI7 U2 small nuclear ribonucleoprotein B Snrpb2 1.583845 WC Q9D0M1 Phosphoribosyl pyrophosphate synthase-associated protein 1 Prpsap1 1.605011 WC Q9D7M1 Glucose-induced degradation protein 8 homolog Gid8 1.630454 WC Q9JL35 High mobility group nucleosome-binding domain containing protein 5 Hmgn5 1.665424 WC O09167 Large ribosomal subunit protein eL21 Rpl21 2.107700 WC O35387 HCLS1-associated protein X-1 Hax1 1.777345 WC O70494 Transcription factor Sp3 Sp3 1.687230 WC P84244 Histone H3.3 H3f3a; H3f3b 2.804078 WC Q8CGP2 Histone H2B type 1-P Hist1h2bp 2.244255 WC P12246 Serum amyloid P-component Apcs 1.636670 WC P15864 Histone H1.2 H1-2 or Hist1h1c 2.578941 WC P27661 Histone H2AX H2ax or H2afx 2.641841 WC P28184 Metallothionein-3 Mt3 1.630307 WC P51910 Apolipoprotein D Apod 1.835178 WC P62806 Histone H4 H4c11 or Hist1h4a 3.246594 WC P97315 Cysteine and glycine-rich protein 1 Csrp1 1.620372 WC P97864 Caspase-7 Casp7 1.611143 WC Q80UW8 DNA-directed RNA polymerases I, II, and III subunit RPABC1 Polr2e 1.715163 WC Q8BTS4 Nuclear pore complex protein Nup54 Nup54 1.595948 WC Q8BX10 Serine/threonine-protein phosphatase PGAM5, mitochondrial Pgam5 1.578568 WC Q8CGP5 Histone H2A type 1-F Hist1h2af 2.449976 WC Q8JZY2 COMM domain-containing protein 10 Commd10 1.674767 WC Q9D0A3 Arpin Arpin 1.560642 WC Q9D820 Prolyl-tRNA synthetase associated domain-containing protein 1 Prorsd1 1.790119 WC Q9QZQ8 Core histone macro-H2A.1 Macroh2a1 or H2afy 2.275530 WC Q9Z2D6 Methyl-CpG-binding protein 2 Mecp2 1.942897 WC FC, fold change; WC, without change. pharmaceuticals-18-01263-t009_Table 9 Table 9 Proteins altered by IA MTX Protein ID Protein Name Gene Name IA (FC) MTX (FC) O09165 Calsequestrin-1 Casq1 0.116192 0.168875 O70250 Phosphoglycerate mutase 2 Pgam2 0.130508 0.153858 P13412 Troponin I, fast skeletal muscle Tnni2 0.124295 0.155632 P20801 Troponin C, skeletal muscle Tnnc2 0.138595 0.178338 P17183 Gamma-enolase Eno2 0.151492 0.204480 Q9QZ47 Troponin T, fast skeletal muscle Tnnt3 0.168688 0.187661 P97457 Myosin regulatory light chain 2, skeletal muscle isoform Mylpf 0.160783 0.185690 P13542 Myosin-8 Myh8 0.167594 0.188003 Q9WUZ7 SH3 domain-binding glutamic acid-rich protein Sh3bgr 0.181164 0.214274 P05977 Myosin light chain 1/3, skeletal muscle isoform Myl1 0.180140 0.223749 Q5SX39 Myosin-4 Myh4 0.188800 0.191696 P58774 Tropomyosin beta chain Tpm2 0.183496 0.197290 P32848 Parvalbumin alpha Pvalb 0.186871 0.197277 Q5SX40 Myosin-1 Myh1 0.193077 0.224988 Q9JKS4 LIM domain-binding protein 3 Ldb3 0.210207 0.245489 P07310 Creatine kinase M-type Ckm 0.205044 0.218269 P58771 Tropomyosin alpha-1 chain Tpm1 0.211997 0.215467 Q9JK37 Myozenin-1 Myoz1 0.212286 0.240133 Q8R429 Sarcoplasmic/endoplasmic reticulum calcium ATPase 1 Atp2a1 0.241364 0.246236 Q62234 Myomesin-1 Myom1 0.235461 0.252929 Q6P8J7 Creatine kinase S-type, mitochondrial Ckmt2 0.237430 0.265434 Q8R1X6 Spartin Spg20 0.255282 0.309371 P51667 Myosin regulatory light chain 2, ventricular/cardiac My12 0.244251 0.292434  muscle isoform    P09542 Myosin light chain 3 My13 0.238113 0.2115191 Q5XKE0 Myosin-binding protein C, fast-type Mybpc2 0.257520 0.274625 Q9WUB3 Glycogen phosphorylase, muscle form Pygm 0.250124 0.280577 P13541 Myosin-3 Myh3 0.245456 0.259989 A2ASS6 Titin Ttn 0.278499 0.310760 P21550 Beta-enolase Eno3 0.287361 0.301657 P23927 Alpha-crystallin B chain Cryab 0.280105 0.307071 Q9JI91 Alpha-actinin-2 Actn2 0.282126 0.349733 O88990 Alpha-actinin-3 Actn3 0.309565 0.335477 P04247 Myoglobin Mb 0.327717 0.314839 Q9JLH8 Tropomodulin-4 Tmod4 0.342717 0.419507 P97447 Four and a half LIM domains protein 1 Fhl1 0.359150 0.385025 P11404 Fatty acid-binding protein, heart Fabp3 0.375626 0.505352 P68134 Actin, alpha skeletal muscle Acta1 0.401163 0.351810 Q9JIF9 Myotilin Myot 0.393725 0.442669 P48962 ADP/ATP translocase 1 Slc25a4 0.434997 0.292006 Q9DAZ9 Abscission/NoCut checkpoint regulator Zfyve19 0.463985 0.424291 Q64345 Interferon-induced protein with tetratricopeptide repeats 3 Ifit3 0.408482 0.500078 Q9R0Y5 Adenylate kinase isoenzyme 1 Ak1 0.394418 0.342173 Q7TQ48 Sarcalumenin Srl 0.417223 0.452027 Q3TJD7 PDZ and LIM domain protein 7 Pdlim7 0.423444 0.581780 Q8VHX6 Filamin-C Flnc 0.460515 0.528664 Q91Z83 Myosin-7 Myh7 0.450777 0.432883 A2ABU4 Myomesin-3 Myom3 0.447776 0.505737 Q8BV66 Interferon-induced protein 44 Ifi44 0.549142 0.481085 P15307 Proto-oncogene c-Rel Rel 0.513074 0.548115 P04919 Band 3 anion transport protein Slc4a1 0.506732 0.390399 Q99NB8 Ubiquilin-4 Ubqln4 0.453602 0.576117 Q9CQC7 NADH dehydrogenase [ubiquinone] 1 beta subcomplex Ndufb4 0.581219 0.459827  subunit 4    P45591 Cofilin-2 Cfl2 0.597159 0.624516 Q9DA08 SAGA-associated factor 29 homolog Ccdc101 0.594209 0.656104 Q9D1L0 Coiled-coil-helix-coiled-coil-helix domain-containing protein 2 Chchd2 0.580712 0.635534 Q9CXW2 28S ribosomal protein S22, mitochondrial Mrps22 0.635789 0.602915 Q9R059 Four and a half LIM domains protein 3 Fhl3 0.645077 0.581828 P06728 Apolipoprotein A-IV Apoa4 1.522175 1.508959 P01645 Ig kappa chain V-V region HP 93G7 KV5AC 1.748303 1.688753 P47955 Large ribosomal subunit protein P1 Rplp1 1.574290 1.558623 Q501J7 Phosphatase and actin regulator 4 Phactr4 1.603299 1.505982 Q6U7R4 T-cell immunoglobulin and mucin domain-containing protein 4 Timd4 1.725275 1.539719 Q61730 Interleukin-1 receptor accessory protein Il1rap 1.665689 1.502210 P26645 Myristoylated alanine-rich C-kinase substrate Marcks 1.891390 1.679438 FC, fold change. pharmaceuticals-18-01263-t010_Table 10 Table 10 Protein–ligand interactions from molecular docking, ∆G (kcal/mol), and Ki (µM).  Protein  Ligands  Incomptine A (IA)   Methotrexate (M)  ΔG  Ki  H-BR  NPI   ΔG  Ki  H-BR  NPI Apoa4 −6.35 22.12 Phe303, Thr357, Leu358, Glu359, Lys361, Gly361 Met194, Leu197, Leu263, Val300, Arg304, Lys360  −4.27 744.4 Glo308, Gly311, Glu312, Asn315, Glu349, Asn352, Ser353, Ser356, Glu359 Arg348, Met355 Fabp3 −7.17 5.53 Phe17, Tyr20, Thr54, Lys59, Thr61, Thr75, Ala76, Asp77, Arg79, Gln96 Met21, Leu24, Val26, Leu105, Leu116, Leu118  −4.84 284.07 Asn60, Thr61, Glu62, Asn64, Phe65, Phe71, Asp72, Glu73, Thr75, Ala76, Asp78 Lys59, Ile63, Val74 Fhl1 −6.86 9.38 Gly103, Thr120, Trp122, Cys126, Thr128, Ser130, Lys133, Glu146, Asp147 Lys102, Phe127, Phe148  −4.92 284.1 Arg100, Cys101, Tyr117, Gly119, Thr120, Val121, Trp122, Gly145, Glu146, Phe148 Lys102, Phe105, Lys118 IFi44 −6.55 15.9 Thr8, Gln10, Gln11, Lys58, Cys59, Val60, Gln82, Glu83, Phe86 Cys14, Leu81  −5.72 64.22 Ile356, Tyr357, Asn358, Lys363, Leu366, Ser378, Leu381, Val382, Val383, Met398, Leu399, Ser402, Ala403, Glu406 Leu377 Il1rap −7.15 5.74 Gln34, Gln36, Arg143, Arg143 Ile35, Met142, Phe144, Pro145  −6.02 38.51 Thr31, Met32, Arg33, Gln34, Ile35, Gln36, Phe144, Pro145, Pro161, Asn162, Arg227, Thr228, Val229 Val37, Met142, Arg143 Timd4 −7.24 4.9 Arg113, Phe120, Asn121, Asp122, Val123, Leu300, Gly303, Thr306 Lys124, Phe299, Arg302  −5.11 180.54 Ala23, Ser24, Glu25, Thr37, Leu38, Pro39, Cys40, His41, Ser96, Ala124, Asn126, Val127, Cys310, Gln312, Asp26, Lys215, Leu311, Arg313, His314 Apoa4: apolipoprotein A-IV, Fabp3: fatty acid-binding, Fhl1: four and a half LIM domains protein 1, Ifi44: interferon-induced protein 44, Il1rap: interleukin-1 receptor accessory protein, Timd4: T-cell immunoglobulin and mucin domain-containing protein 4. ",
  "metadata": {
    "Title of this paper": "Autodock4 and AutodockTools4: Automated docking with selective receptor flexibility",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472545/"
  }
}