{
  "title": "Paper_16",
  "abstract": "pmc Comput Struct Biotechnol J Comput Struct Biotechnol J 2373 csbj Computational and Structural Biotechnology Journal 2001-0370 Research Network of Computational and Structural Biotechnology PMC12495422 PMC12495422.1 12495422 12495422 10.1016/j.csbj.2025.09.013 S2001-0370(25)00373-3 1 Research Article Identifying Alzheimer’s disease-related pathways based on whole-genome sequencing data Wang Yongheng yhwang@stu.cqmu.edu.cn a b c 1 Liu Taihang liuth@cqmu.edu.cn a 1 He Yijie heyijie456@163.com a Tang Yaqin yqtang@cqmu.edu.cn a Tan Pengcheng tanpengcheng@cqmu.edu.cn a Huang Lin huanglin.bio@outlook.com a d Huang Dongyu huangdongyu@stu.cqmu.edu.cn a d Wen Tong wentong@stu.cqmu.edu.cn a Shao Lizhen shaolizhen@stu.cqmu.edu.cn a Wang Jia 17382892177@163.com a Wang Yingxiong yxwang@cqmu.edu.cn a ⁎ Han Zhijie zhijiehan@cqmu.edu.cn a c d ⁎⁎ a b c d ⁎ yxwang@cqmu.edu.cn ⁎⁎ zhijiehan@cqmu.edu.cn 1 These authors contributed equally to this work. 2025 12 9 2025 27 478314 4132 4144 1 4 2025 8 9 2025 9 9 2025 12 09 2025 05 10 2025 05 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Alzheimer’s disease (AD) is a highly inheritable neurodegenerative disorder for which pathway-specific genetic profiling provides insights into its key biological mechanisms and potential treatment targets. Traditional disease-pathway analyses for AD have certain limitations, such as environmental interference and arbitrary sample division. We present a comprehensive framework that starts with genome data, avoiding these drawbacks and offering intrinsic pathway-specific genetic profiling for AD. Whole genome sequencing data from 173 individuals were used to quantify transcriptomes in 14 brain regions, estimate individual-level pathway variant scores, and analyze AD risk for each patient. These results were combined to identify AD-related pathways and quantify their interactions. The predicted expression levels were consistent with previous findings, and the estimated AD risk showed a significant correlation with Braak/Thal scores. A total of 3798 pathways were identified as potentially associated with AD, with about 19.7 % previously reported. The pathways identified as AD risk related primarily address six core biological themes, including: Immunity and inflammation, Metabolism, Protein homeostasis, DNA/RNA and Epigenetics, Synapse and structure, Cell cycle. Specifically, key pathways, such as NF-κB signaling and GSK3β activation, were linked to AD pathogenesis. The interactions among pathways highlighted shared gene functions in AD. In summary, we provided an effective framework for disease-pathway analysis, revealing the interdependence or compensatory effects of pathways in AD. Graphical Abstract Highlights • This study presented a novel comprehensive framework starting from genome data to identify the Alzheimer’s disease (AD)-related pathways. • The framework can overcome the limitations of traditional disease-pathway analyses for AD, such as environmental interference and arbitrary sample division. • The largest number of novel pathways related to AD was identified, and numerous previously reported findings were confirmed. • The interactions among pathways emphasized shared gene functions in AD. Keywords Alzheimer’s disease Pathway Polygenic risk score Single sample gene set variation analysis Structural equation modeling pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Alzheimer’s disease (AD) is a progressive neurodegenerative disorder with a high heritability estimated between 60 % and 80 % [1] [2] [3] [4] [5] [6] [7] [8] [9] [10] [11] However, the case-control design has several key limitations: (1) These analyses require artificially dividing samples into disease and control groups. For a progressive disease like AD, establishing a progressive state of risk and severity, it is challenging to establish a clear standard for distinguishing whether a person is diseased or not. For example, early AD diagnosis relies on assessing AD neuropathological changes, including neurofibrillary tangle distribution (Braak NFT stage), amyloid-beta plaques (Thal stage), and the neuronal plaques density in the neocortex (CERAD score). In the preclinical (asymptomatic) phase of the AD continuum, misdiagnosis and missed diagnosis may occur [12] [13] [14] Genomic information provides valuable insights into the original genetic characteristics and the molecular basis of pathogenesis. Disease-related single nucleotide polymorphisms (SNPs), genes, and individual disease risks can be identified from genomic data using methods like genome-wide association studies (GWAS), fine-mapping, linkage disequilibrium score regression (LDSC), and polygenic risk score (PRS) [15] [16] [17] [18] [19] [18] [17] To address these limitations, this study developed a novel framework that investigate the genetic characteristics of AD pathways directly from the genome. Our approach successfully identified pathways related to AD across different brain regions based on their genetic characteristics. The advantages of our analysis are noteworthy: it requires only genotyping data (obtaining brain tissue is challenging, but blood samples are easily accessible), does not require discrete case-control labels and can analyze continuous phenotypes. By starting our analysis directly from the genome, our framework provides results that reflect primary genetic characteristics, minimizing potential confounding from downstream biological or environmental factors. We believe this framework holds promise for providing quantitative insights into the combined effects between pathways in complex diseases. 2 Results 2.1 Pipeline overview To investigate the genetic characteristics of AD, we used whole genome sequencing (WGS) data from 173 individuals (including 92 AD cases and 81 controls according to the original annotations) obtained from the MayoRNAseq ( https://doi.org/10.7303/syn10901601 [20] [21] [22] [23] [24] Fig. 1 Fig. 1 Pipeline schematic of investigating the original genetic characteristics of AD pathways. In this pipeline, only genotype data is required, which can be obtained through various methods such as WGS, whole exome sequencing (WES), or SNP array analysis. Pathway scores and disease risk scores for each individual were calculated based on their genotype data. Subsequently, analyses were conducted to explore AD-related pathways and the interaction models between these pathways. This genotype data-driven approach eliminates potential confounding factors that influence gene expression levels, allowing for a focused investigation into genetic regulation. Furthermore, this approach can also be adapted for analyzing genetic regulatory pathways in other diseases. Fig. 1 2.2 Transcriptome prediction and gene sets variation analysis based on genotype data The total measured expression level of a gene (e.g. obtained through RNA-seq) can be conceptually divided into the following parts: Total Measured Expression = Genetically Regulated Expression + Non-heritable Genetic Effects + Environmental Effects + Cell type Heterogeneity Effects + Stochastic Noise + Technical Artifacts This research focus on the original genetic characteristics of AD, the Genetically Regulated Expression part. To measure this part, we predicted the gene expression from the genomic data by GReX method [22] P Fig. 2 A Fig. 2 B [25] Fig. 2 Performance of GReX and ssGSVA. ( A B C D E F Fig. 2 In addition, we evaluated the correlation between predicted expression profile and RNA-seq gene expression data of cerebellum region, revealing a weak but expected association (range: −0.012–0.031; Fig. 2 Supplementary Table S1 Further, to identify AD-related pathways, we performed non-parametric, unsupervised ssGSVA [23] [26] [27] [28] [29] [30] [31] [32] Supplementary Table S2 Fig. 2 D Fig. 2 E P P Fig. 2 F 2.3 Identification of AD risk associated pathways To estimate the genetic liability to AD risk in individuals, we performed PRS analysis. Following PRS guidelines, we retained 173 samples (92 AD cases and 81 controls according to the original annotations) and 10,070,779 SNPs after applying filters and quality control (QC). By combining with the QCed AD GWAS summary data based on Jansen et al. [33] R P −11 R P −14 R P −12 Fig. 3 A P Fig. 3 B Fig. 3 Performance of PRS and identification of AD-related pathways. ( A B C D E F Fig. 3 Further, we identified the AD risk associated pathways. Since most ssGSVA scores do not follow a normal distribution (Shapiro-Wilk test, P [34] [35] P Supplementary Table S3 Table 1 Table 2 Table 3 Fig. 3 C Fig. 3 D R P −4 Table 1 Overview of the pathways predicted in 14 brain regions when using 31,824 pathways with the number of genes limitation in: 10–300. Table 1 Brain region Immunity and inflammation Metabolism Protein homeostasis DNA/RNA and Epigenetics Synapse and structure Cell cycle Other Total Amygdala 15 0 1 3 0 0 1 20 Anterior cingulate cortex BA24 1 0 0 0 0 0 0 1 Caudate basal ganglia 12 0 0 1 1 2 8 24 Cerebellar hemisphere 7 0 0 1 0 0 3 11 Cerebellum 13 1 2 0 1 0 5 22 Cortex 15 2 1 1 1 0 8 28 Frontal cortex BA9 15 0 3 6 4 1 6 35 Hippocampus 4 0 1 3 0 0 0 8 Hypothalamus 17 2 3 1 1 1 7 32 Nucleus accumbens basal ganglia 19 4 1 1 4 0 8 37 Putamen basal ganglia 7 3 0 0 0 0 0 10 Spinal cord cervical c−1 8 2 0 1 1 0 2 14 Substantia nigra 8 0 1 1 1 0 1 12 Pituitary 2 0 0 0 1 0 1 4 Table 2 Overview of the pathways predicted in 14 brain regions when using all pathways. Table 2 Brain region Immunity and inflammation Metabolism Protein homeostasis DNA/RNA and Epigenetics Synapse and structure Cell cycle Amygdala 25 14 9 39 10 29 Anterior cingulate cortex BA24 2 4 1 7 2 16 Caudate basal ganglia 23 19 12 28 5 28 Cerebellar hemisphere 14 10 6 18 8 21 Cerebellum 18 22 15 31 11 45 Cortex 24 18 14 35 20 52 Frontal cortex BA9 22 12 10 33 15 38 Hippocampus 11 8 7 15 6 12 Hypothalamus 23 16 18 30 9 35 Nucleus accumbens basal ganglia 19 15 11 29 10 31 Putamen basal ganglia 15 11 8 21 7 25 Spinal cord cervical c−1 5 3 2 6 4 8 Substantia nigra 20 14 10 26 9 29 Pituitary 10 7 9 14 5 13 Table 3 Overview of the genes and pathways predicted in 14 brain regions when using all pathways with the number of genes > 1. Table 3 Brain region Pathway Gene ssGSVA AD risk- related Literature-reported AD-related Percentage a predicted In literature-reported AD pathways Percentage b Amygdala 140665 224 50 22.32 % 5230 1038 19.85 % Anterior cingulate cortex BA24 151201 48 10 20.83 % 6313 160 2.53 % Caudate basal ganglia 211425 253 59 23.32 % 7998 1015 12.69 % Cerebellar hemisphere 239101 152 44 28.95 % 8250 1007 12.21 % Cerebellum 254105 797 76 9.54 % 9186 906 9.86 % Cortex 237011 843 72 8.54 % 8436 4078 48.34 % Frontal cortex BA9 198891 452 64 14.16 % 7363 786 10.67 % Hippocampus 155530 111 27 24.32 % 6450 431 6.68 % Hypothalamus 177654 355 83 23.38 % 6488 2494 38.44 % Nucleus accumbens basal ganglia 200953 741 187 25.24 % 7822 1567 20.03 % Putamen basal ganglia 203271 152 34 22.37 % 7341 651 8.87 % Spinal cord cervical c−1 171460 201 43 21.39 % 5634 398 7.06 % Substantia nigra 128873 128 29 22.66 % 5013 254 5.07 % Pituitary 230222 58 12 20.69 % 8582 109 1.27 % Percentage a b 2.4 Literature reported relation between AD risk-related pathways and AD To verify the relevance of the identified pathways to AD, we investigated the literature-reported correlation between the 3798 AD risk-related pathways identified across 14 brain regions and AD. These correlations were classified as direct, indirect (associated with features linked to AD), or unrelated (Detailed definition scheme is in Methods). Table 3 Supplementary Table S4 Fig. 3 E We also evaluated the impact of pathway size on our findings, with detailed results listed in Table 3 2.5 Quantitatively investigate the interaction relationships among pathways Given that pathways do not work independently [36] [37] Table 4 Supplementary Table S5 to S17 Table 4 Table 3 Fig. 3 F Fig. 4 [38] Supplementary Table S13 Table 4 SEM analysis results of 14 brain regions when using all pathways with the number of genes > 1. Table 4 Brain region KMO Bartlett Number of pathways in module Number of factors Number of literature-reported AD-related pathways Percentage Brain amygdala 0.516 0.000 16 5 1 6.25 % Brain anterior cingulate cortex BA24 0.483 0.000 NA NA NA NA Brain caudate basal ganglia 0.588 0.000 44 9 5 11.36 % Brain cerebellar hemisphere 0.615 0.000 13 3 3 23.08 % Brain cerebellum 0.617 0.000 541 9 9 1.66 % Brain cortex 0.632 0.000 551 9 13 2.36 % Brain frontal cortex BA9 0.493 0.000 12 5 3 25.00 % Brain hippocampus 0.539 0.000 14 6 5 35.71 % Brain hypothalamus 0.607 0.000 44 11 8 18.18 % Brain nucleus accumbens basal ganglia 0.649 0.000 275 11 78 28.36 % Brain putamen basal ganglia 0.506 0.000 20 8 6 30.00 % Brain spinal cord cervical c−1 0.516 0.000 13 6 6 46.15 % Brain substantia nigra 0.506 0.000 11 4 2 18.18 % Pituitary 0.499 0.000 8 4 3 37.50 % Number of pathways in module: pathways in module including those with replicated ssGSVA score. Percentage: Number of literature-reported AD-related pathways/Number of pathways in module. More detailed results of each brain region can be found in Supplementary Table S5-S17 . Fig. 4 The SEM result of nucleus accumbens basal ganglia. The red numbers in parentheses represent number of pathways with the same ssGSVA score as this pathway in this model. The inter-factor correlations in this brain region can be found in Supplementary Table S13 Fig. 4 3 Discussion In this study, we predicted transcriptomes of 14 brain regions based on genotype data. We then combined these transcriptomes with GWAS summary data to estimate the PRS for AD risk. Subsequently, we characterized the primary inheritance pathways associated with AD. This framework for identifying disease-related pathways offers three main advantages: (1) By starting from genome data, we avoided environmental factors' interference, yielding results that more accurately reflect the disease's intrinsic genetic mechanisms. (2) Our approach relied solely on genotype data, eliminating the need to divide samples into disease or control groups. This enabled us to analyze continuous variables, which provide a more nuanced representation of the real-world disease landscape. (3) Our research covered the entire genome without imposing an arbitrary threshold, preventing the loss of important genomic information. By translating genetic evidence into gene expression, our approach can circumvent non-genetic confounding factors, a strategy similarly applied by Chen et al. (2021) [39] [21] [40] [41] The trend of pathway numbers enriched by ssGSVA aligned with the predicted gene numbers. The PRS reflected the genetic risk for AD and showed a significant correlation with AD/control grouping, as well as the Braak and Thal stages of the samples. Overall, the higher the Braak and Thal stages, the greater the AD risk. There is a significant difference in pathway GSVA score between the AD/high AD risk group and the contra/low AD risk group. Therefore, we further screened pathways significantly associated with AD risk score. Through correlation analysis, we identified pathways associated with AD risk in each brain region. Of these pathways, 19.7 % have been previously reported to be related to AD, while 39.7 % may potentially be associated with AD. Both PRS and ssGSVA scores are derived from genomic data, allowing us to elucidate AD-related pathways purely from a genetic perspective. Further, the SEM analysis enabled us to assess the interaction and coefficient among pathways. Pathways assigned to one factor tended to share more genes and exhibit similar functions. Research on AD encompasses various aspects such as immune regulation [42] [43] [44] [45] Fig. 5 [46] [47] [48] [48] [49] [50] [51] [52] Fig. 5 A pathway network summarized by consolidating several AD-related pathways that we have identified. Fig. 5 Based on our previous research on AD and genomic data [53] [54] In conclusion, given the numerous alterations observed in various pathways in AD, targeting a single process will likely prove insufficient to halt disease progression. More importantly, our findings have pinpointed specific categories that could serve as a reference for investigating pathway-dependent AD risk, offering valuable quantitative insights into the interdependence or compensatory effects among pathways. Further research is warranted to explore the precise roles of pathways and their interrelationships with AD. 4 Methods 4.1 Whole genomic data The WGS data from the MayoRNAseq study were utilized in this study. All samples passed data QC as described. Based on the phenotypic information provided, the samples were diagnosed according to the NINCDS-ADRDA criteria and the neuropathologic evaluation [55] [56] [39] 4.2 Genome-wide gene expression prediction The gene expression patterns in different brain regions of individuals were assessed based on GReX approach from the MetaXcan project ( https://github.com/hakyimlab/MetaXcan [22] 4.3 Gene-pathway association collection and ssGSVA We build a comprehensive, yet non-redundant, knowledge base that integrates established, manually curated biological pathways with broader, interaction-based networks to maximize our discovery potential for complex diseases like AD. We integrated the mapping relationships between pathways and genes from several authoritative databases. Since the pathway data were collected in various formats, we converted them into the list format necessary for conducting ssGSVA. First, we filtered out pathways from various databases that encompassed multiple species, including PathBank ( https://pathbank.org/ [32] https://david.ncifcrf.gov/ [27] http://netpath.org/ [29] https://reactome.org/ [28] https://classic.wikipathways.org/index.php/ [31] https://www.gsea-msigdb.org/gsea/index.jsp [26] http://www.pantherdb.org/ [30] https://github.com/BFGBgroup/Pathway/blob/main/geneSets.Rdata 4.4 PRS analysis The GWAS summary statistics data used in this study were obtained from the research of Jansen et al. [33] https://ctg.cncr.nl/software/summary_statistics/ [57] [58] [59] [56] 4.5 Correlation analysis between PRS and ssGSVA score The Shapiro-Wilk test was used to assess the normality of pathway ssGSVA scores. Prior to analysis, outliers were adjusted using the winsor function from the R package psych. The R package ‘HHG’ was employed to calculate the correlation between ssGSVA scores and PRS [34] [35] P P P P P P P P P 4.6 SEM analysis To quantitatively investigate the interactions among multiple pathways, we conducted a SEM analysis. Because factor analysis in SEM does not allow for identical variables, we temporarily randomly excluded pathways with identical ssGSVA scores from the analysis. It's important to note that the pathways temporarily excluded from the model input were not discarded from our overall interpretation. First, we used SPSS software (V26.0) to determine the relationship between pathways and factors. Specifically, we obtained the factor loading matrix using principal component analysis (PCA). The number of factors extracted was based on those with eigenvalues greater than 1. We examined the factor loading coefficients in the rotated factor matrix, and variables with inadequate loadings were removed. Specifically, variables were deleted if their loadings on different factors were all below 0.6. This deletion process was repeated until all variables had meaningful associations with the factors. Additionally, factors with only one variable were removed. Subsequently, the model was constructed and evaluated using LISREL software (V8.7). The model was built based on the Spearman correlation coefficient matrix between pathways and the correspondence between pathways and factors. Modification indices were used to guide the model development. Model improvements were made by considering these indices and the significance of loadings. Specifically, the standard error of the loading of the pathway within their respective factors was considered significant (generally t value >2), and the modification indices for the pathways in other factors remained relatively low. Once the model was finalized, we added the pathways that were temporarily excluded from the model input back to the model results. 4.7 Validation with literature evidence We manually retrieved and summarized AD-related pathways from the literature that were validated by high-throughput data analysis or experiments. To determine the association between identified pathways and AD, we performed an extensive manual literature review. This process involved systematic searches in databases including PubMed and Google Scholar, using keywords such as the pathway name, its critical genes, and Alzheimer's Disease. We defined an association based on published evidence directly linking a pathway to AD or strong evidence linking its key genes to other established AD-related genes or pathways. To ensure the reliability of our findings, all curated associations were independently reviewed and confirmed by multiple team members. These correlations were classified as direct, indirect, or unrelated. \"Direct\" refers to a direct association of the pathway or factors within the pathway with AD. \"Indirect\" means the pathway or its factors are correlated with a specific feature that is linked to AD. Other pathways were deemed unrelated to AD. CRediT authorship contribution statement Jia Wang: Yijie He: Yaqin Tang: Yongheng Wang: Yingxiong Wang: Taihang Liu: Zhijie Han: Lin Huang: Dongyu Huang: Pengcheng Tan: Zeng Jie: Tong Wen: Lizhen Shao: Consent statement The study procedures received approval from the Chongqing Medical University Institutional Review Board. Funding This research is financially supported by the Science and Technology Research Program of National Natural Science Foundation of China 32200446 CQMU Program for Youth Innovation in Future Medicine W0147 10.13039/501100007957 Chongqing Municipal Education Commission KJQN202100402 Declaration of Competing Interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Gatz M. Reynolds C.A. Fratiglioni L. Johansson B. Mortimer J.A. Berg S. Role of genes and environments for explaining Alzheimer disease Arch Gen Psychiatry 63 2 2006 168 174 16461860 10.1001/archpsyc.63.2.168 2 Sherrington R. Rogaev E.I. Liang Y. Rogaeva E.A. Levesque G. Ikeda M. Cloning of a gene bearing missense mutations in early-onset familial Alzheimer’s disease Nature 375 6534 1995 754 760 7596406 10.1038/375754a0 3 Rovelet-Lecrux A. Hannequin D. Raux G. Le Meur N. Laquerriere A. Vital A. APP locus duplication causes autosomal dominant early-onset Alzheimer disease with cerebral amyloid angiopathy Nat Genet 38 1 2006 24 26 16369530 10.1038/ng1718 4 Levy-Lahad E. Wasco W. Poorkaj P. Romano D.M. Oshima J. Pettingell W.H. Candidate gene for the chromosome 1 familial Alzheimer’s disease locus Science 269 5226 1995 973 977 7638622 10.1126/science.7638622 5 Corder E.H. Saunders A.M. Risch N.J. Strittmatter W.J. Schmechel D.E. Gaskell P.C. Jr. Protective effect of apolipoprotein E type 2 allele for late onset Alzheimer disease Nat Genet 7 2 1994 180 184 7920638 10.1038/ng0694-180 6 Hall A. Bandres-Ciga S. Diez-Fairen M. Quinn J.P. Billingsley K.J. Genetic risk profiling in parkinson's disease and utilizing genetics to gain insight into disease-related biological pathways Int J Mol Sci 21 19 2020 10.3390/ijms21197332 PMC7584037 33020390 7 Bellenguez C. Kucukali F. Jansen I.E. Kleineidam L. Moreno-Grau S. Amin N. New insights into the genetic etiology of Alzheimer’s disease and related dementias Nat Genet 54 4 2022 412 436 35379992 10.1038/s41588-022-01024-z PMC9005347 8 Ray M. Ruan J. Zhang W. Variations in the transcriptome of alzheimer's disease reveal molecular networks involved in cardiovascular diseases Genome Biol 9 10 2008 R148 10.1186/gb-2008-9-10-r148 PMC2760875 18842138 9 Raj T. Li Y.I. Wong G. Humphrey J. Wang M. Ramdhani S. Integrative transcriptome analyses of the aging brain implicate altered splicing in Alzheimer’s disease susceptibility Nat Genet 50 11 2018 1584 1592 30297968 10.1038/s41588-018-0238-1 PMC6354244 10 Walker K.A. Chen J. Shi L. Yang Y. Fornage M. Zhou L. Proteomics analysis of plasma from middle-aged adults identifies protein markers of dementia risk in later life Sci Transl Med 15 705 2023 eadf5681 37467317 10.1126/scitranslmed.adf5681 PMC10665113 11 Modeste E.S. Ping L. Watson C.M. Duong D.M. Dammer E.B. Johnson E.C.B. Quantitative proteomics of cerebrospinal fluid from African Americans and Caucasians reveals shared and divergent changes in Alzheimer’s disease Mol Neurodegener 18 1 2023 48 37468915 10.1186/s13024-023-00638-z PMC10355042 12 2023 alzheimer's disease facts and figures Alzheimers Dement 19 4 2023 1598 1695 36918389 10.1002/alz.13016 13 Head E. Corrada M.M. Kahle-Wrobleski K. Kim R.C. Sarsoza F. Goodus M. Synaptic proteins, neuropathology and cognitive status in the oldest-old Neurobiol Aging 30 7 2009 1125 1134 18006193 10.1016/j.neurobiolaging.2007.10.001 PMC7295175 14 Kraemer H.C. Schultz S.K. Arndt S. Biomarkers in psychiatry: methodological issues Am J Geriatr Psychiatry 10 6 2002 653 659 12427574 15 Farh K.K. Marson A. Zhu J. Kleinewietfeld M. Housley W.J. Beik S. Genetic and epigenetic fine mapping of causal autoimmune disease variants Nature 518 7539 2015 337 343 25363779 10.1038/nature13835 PMC4336207 16 Bulik-Sullivan B.K. Loh P.R. Finucane H.K. Ripke S. Yang J. Schizophrenia Working Group of the Psychiatric Genomics C LD Score regression distinguishes confounding from polygenicity in genome-wide association studies Nat Genet 47 3 2015 291 295 25642630 10.1038/ng.3211 PMC4495769 17 Finucane H.K. Bulik-Sullivan B. Gusev A. Trynka G. Reshef Y Loh PR Partitioning heritability by functional annotation using genome-wide association summary statistics Nat Genet 47 11 2015 1228 1235 26414678 10.1038/ng.3404 PMC4626285 18 de Leeuw C.A. Mooij J.M. Heskes T. Posthuma D. Magma: generalized gene-set analysis of gwas data PLoS Comput Biol 11 4 2015 e1004219 10.1371/journal.pcbi.1004219 PMC4401657 25885710 19 Choi S.W. Garcia-Gonzalez J. Ruan Y. Wu H.M. Porras C. Johnson J. PRSet: Pathway-based polygenic risk score analyses and software PLoS Genet 19 2 2023 e1010624 10.1371/journal.pgen.1010624 PMC9937466 36749789 20 Barbeira A.N. Dickinson S.P. Bonazzola R. Zheng J. Wheeler H.E. Torres J.M. Exploring the phenotypic consequences of tissue specific gene expression variation inferred from GWAS summary statistics Nat Commun 9 1 2018 1825 29739930 10.1038/s41467-018-03621-1 PMC5940825 21 Consortium GT. The gtex consortium Atlas of genetic regulatory effects across human tissues Science 369 6509 2020 1318 1330 32913098 10.1126/science.aaz1776 PMC7737656 22 Gamazon E.R. Wheeler H.E. Shah K.P. Mozaffari S.V. Aquino-Michaels K. Carroll R.J. A gene-based association method for mapping traits using reference transcriptome data Nat Genet 47 9 2015 1091 1098 26258848 10.1038/ng.3367 PMC4552594 23 Hanzelmann S. Castelo R. Guinney J. Gsva: gene set variation analysis for microarray and rna-seq data BMC Bioinforma 14 2013 7 10.1186/1471-2105-14-7 PMC3618321 23323831 24 Heller R., Heller Y., Gorfine M.J.B. A consistent multivariate test of association based on ranks of distances. 2013;100(2):503-510. 25 Qi T. Wu Y. Zeng J. Zhang F. Xue A. Jiang L. Identifying gene targets for brain-related traits using transcriptomic and methylomic data from blood Nat Commun 9 1 2018 2282 29891976 10.1038/s41467-018-04558-1 PMC5995828 26 Subramanian A. Tamayo P. Mootha V.K. Mukherjee S. Ebert B.L. Gillette M.A. Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles Proc Natl Acad Sci U S A 102 43 2005 15545 15550 16199517 10.1073/pnas.0506580102 PMC1239896 27 Sherman B.T. Hao M. Qiu J. Jiao X. Baseler M.W. Lane H.C. a web server for functional enrichment analysis and functional annotation of gene lists (2021 update) Nucleic Acids Res 50 W1 2022 W216 W221 35325185 10.1093/nar/gkac194 PMC9252805 28 Gillespie M. Jassal B. Stephan R. Milacic M. Rothfels K. Senff-Ribeiro A. The reactome pathway knowledgebase 2022 Nucleic Acids Res 50 D1 2022 D687 D692 34788843 10.1093/nar/gkab1028 PMC8689983 29 Kandasamy K. Mohan S.S. Raju R. Keerthikumar S. Kumar G.S. Venugopal A.K. NetPath: a public resource of curated signal transduction pathways Genome Biol 11 1 2010 R3 20067622 10.1186/gb-2010-11-1-r3 PMC2847715 30 Thomas PD, Ebert D, Muruganujan A, Mushayahama T, Albou LP, Mi H. PANTHER: Making genome-scale phylogenetics accessible to all. Protein Sci 2022;31(1):8-22. 10.1002/pro.4218 PMC8740835 34717010 31 Slenter D.N. Kutmon M. Hanspers K. Riutta A. Windsor J. Nunes N. WikiPathways: a multifaceted pathway database bridging metabolomics to other omics research Nucleic Acids Res 46 D1 2018 D661 D667 29136241 10.1093/nar/gkx1064 PMC5753270 32 Wishart D.S. Li C. Marcu A. Badran H. Pon A Budinski Z PathBank: a comprehensive pathway database for model organisms Nucleic Acids Res 48 D1 2020 D470 D478 31602464 10.1093/nar/gkz861 PMC6943071 33 Jansen I.E. Savage J.E. Watanabe K. Bryois J. Williams D.M. Steinberg S. Genome-wide meta-analysis identifies new loci and functional pathways influencing Alzheimer’s disease risk Nat Genet 51 3 2019 404 413 30617256 10.1038/s41588-018-0311-9 PMC6836675 34 Heller R. Heller Y. Gorfine M.J.B. A consistent multivariate test of association based on ranks of distances Biometrika 100 2 2013 503 510 35 de Siqueira Santos S. Takahashi D.Y. Nakata A. Fujita A. A comparative study of statistical methods used to identify dependencies between gene expression signals Brief Bioinform 15 6 2014 906 918 23962479 10.1093/bib/bbt051 36 Schaefer C.F. Anthony K. Krupa S. Buchoff J. Day M. Hannay T. PID: the Pathway Interaction Database Nucleic Acids Res 2009 37 (Database issue) D674-9. 10.1093/nar/gkn653 PMC2686461 18832364 37 Aguirre A. Rubio M.E. Gallo V. Notch and egfr pathway interaction regulates neural stem cell number and self-renewal Nature 467 7313 2010 323 327 20844536 10.1038/nature09347 PMC2941915 38 Collister K.A. Albensi BC. Potential therapeutic targets in the nf-kappab pathway for alzheimer's disease Drug N Perspect 18 10 2005 623 629 10.1358/dnp.2005.18.10.959576 16491164 39 Chen H.H. Petty L.E. Sha J. Zhao Y. Kuzma A. Valladares O. Genetically regulated expression in late-onset Alzheimer’s disease implicates risk genes within known and novel loci Transl Psychiatry 11 1 2021 618 34873149 10.1038/s41398-021-01677-0 PMC8648734 40 Consortium GT. Human genomics. The genotype-tissue expression (gtex) pilot analysis: multitissue gene regulation in humans Science 348 6235 2015 648 660 25954001 10.1126/science.1262110 PMC4547484 41 Parrish R.L. Gibson G.C. Epstein M.P. Yang J. Tigar-v2: efficient twas tool with nonparametric Bayesian eqtl weights of 49 tissue types from gtex v8 HGG Adv 3 1 2022 100068 10.1016/j.xhgg.2021.100068 PMC8756507 35047855 42 Heppner F.L. Ransohoff R.M. Becher B. Immune attack: the role of inflammation in alzheimer disease Nat Rev Neurosci 16 6 2015 358 372 25991443 10.1038/nrn3880 43 Zhang Z. Yang X. Song Y.Q. Tu J. Autophagy in alzheimer's disease pathogenesis: therapeutic potential and future perspectives Ageing Res Rev 72 2021 101464 10.1016/j.arr.2021.101464 34551326 44 Hung C. Livesey F.J. Endolysosome and autophagy dysfunction in alzheimer disease Autophagy 17 11 2021 3882 3883 34429033 10.1080/15548627.2021.1963630 PMC8632268 45 Kerr J.S. Adriaanse B.A. Greig N.H. Mattson M.P. Cader M.Z. Bohr V.A. Mitophagy and Alzheimer’s Disease: Cellular and Molecular Mechanisms Trends Neurosci 40 3 2017 151 166 28190529 10.1016/j.tins.2017.01.002 PMC5341618 46 Sanford S.A.I. McEwan W.A. Type-I interferons in alzheimer's disease and other tauopathies Front Cell Neurosci 16 2022 949340 10.3389/fncel.2022.949340 PMC9334774 35910253 47 Dou Y. Tian X. Zhang J. Wang Z. Chen G. Roles of traf6 in central nervous system Curr Neuropharmacol 16 9 2018 1306 1313 29651950 10.2174/1570159X16666180412094655 PMC6251041 48 Wang X. Qi Y. Zhou X. Zhang G. Fu C. Alteration of scaffold: possible role of macf1 in alzheimer's disease pathogenesis Med Hypotheses 130 2019 109259 10.1016/j.mehy.2019.109259 31383338 49 Cavallini A. Brewerton S. Bell A. Sargent S. Glover S. Hardy C. An unbiased approach to identifying tau kinases that phosphorylate tau at sites associated with Alzheimer disease J Biol Chem 288 32 2013 23331 23347 23798682 10.1074/jbc.M113.463984 PMC3743503 50 Li V.S. Ng S.S. Boersema P.J. Low T.Y. Karthaus W.R. Gerlach J.P. Wnt signaling through inhibition of beta-catenin degradation in an intact Axin1 complex Cell 149 6 2012 1245 1256 22682247 10.1016/j.cell.2012.05.002 51 Tapia-Rojas C. Inestrosa N.C. Loss of canonical wnt signaling is involved in the pathogenesis of alzheimer's disease Neural Regen Res 13 10 2018 1705 1710 30136680 10.4103/1673-5374.238606 PMC6128062 52 Salminen A. Ojala J. Kaarniranta K. Hiltunen M. Soininen H. Hsp90 regulates tau pathology through co-chaperone complexes in alzheimer's disease Prog Neurobiol 93 1 2011 99 110 21056617 10.1016/j.pneurobio.2010.10.006 53 He Y. Tang Y. Tan P. Huang D. Wang Y. Wen T. Genetic regulation of lncRNA expression in whole human brain and their contribution to CNS disorders Brief Bioinform 26 3 2025 10.1093/bib/bbaf291 PMC12205935 40542816 54 Han Z. Xue W. Tao L. Zhu F. Identification of key long non-coding rnas in the pathology of alzheimer's disease and their functions based on genome-wide associations study, microarray, and rna-seq data J Alzheimers Dis 68 1 2019 339 355 30776002 10.3233/JAD-181051 55 McKhann G. Drachman D. Folstein M. Katzman R. Price D. Stadlan E.M. Clinical diagnosis of Alzheimer’s disease: report of the NINCDS-ADRDA Work Group under the auspices of Department of Health and Human Services Task Force on Alzheimer’s Disease Neurology 34 7 1984 939 944 6610841 10.1212/wnl.34.7.939 56 Chang C.C. Chow C.C. Tellier L.C. Vattikuti S. Purcell S.M. Lee J.J. Second-generation PLINK: rising to the challenge of larger and richer datasets Gigascience 4 7 2015 10.1186/s13742-015-0047-8 PMC4342193 25722852 57 Choi S.W. Mak T.S. O'Reilly P.F. Tutorial: a guide to performing polygenic risk score analyses Nat Protoc 15 9 2020 2759 2772 32709988 10.1038/s41596-020-0353-1 PMC7612115 58 Ge T. Chen C.Y. Ni Y. Feng Y.A. Smoller J.W. Polygenic prediction via Bayesian regression and continuous shrinkage priors Nat Commun 10 1 2019 1776 30992449 10.1038/s41467-019-09718-5 PMC6467998 59 Genomes Project C. Auton A. Brooks L.D. Durbin R.M. Garrison E.P. Kang H.M. A global reference for human genetic variation Nature 526 7571 2015 68 74 26432245 10.1038/nature15393 PMC4750478 Yongheng Wang, Dr. Taihang Liu, Dr. Yijie He, M.S. Yaqin Tang, M.S. Pengcheng Tan, M.S. Lin Huang, M.S. Dongyu Huang, M.S. Tong Wen, M.S. Lizhen Shao, M.S. Jia Wang, M.S. Yingxiong Wang, Dr. Zhijie Han, Dr. https://scholar.google.com/citations?hl=zhCN&user=rnIERmUAAAAJ Appendix A Supplementary material  Supplementary material Data Availability The data used in this study include MayoRNAseq whole-genome sequencing variant call formats ( https://www.synapse.org/#!Synapse:syn11724002 https://zenodo.org/records/3842289#.YrvrM7FBVYA https://ctg.cncr.nl/software/summary_statistics/ We used publicly available software for all analyses, including Plink 1.9 ( https://www.cog-genomics.org/plink2/ https://github.com/getian107/PRScs https://choishingwan.github.io/PRS-Tutorial https://github.com https://github.com/hakyimlab/MetaXcan/wiki/Individual-level-PrediXcan:-introduction,-tutorials-and-manual Our framework is stored in Github: https://github.com/BFGBgroup/Pathway/tree/main Acknowledgements Authors would like to thank the Dr. Nilüfer Ertekin-Taner who leads MayoRNAseq study. The results published here are in whole or in part based on MayoRNAseq data obtained from the AD Knowledge Portal. We also thank the Supercomputer Center of Chongqing Medical University for their computing power and technical support. Appendix A Supplementary data associated with this article can be found in the online version at doi:10.1016/j.csbj.2025.09.013 ",
  "metadata": {
    "Title of this paper": "A global reference for human genetic variation",
    "Journal it was published in:": "Computational and Structural Biotechnology Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495422/"
  }
}