{
  "title": "Paper_238",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12491298 PMC12491298.1 12491298 12491298 10.3389/fimmu.2025.1659342 1 Immunology Review Therapeutic roles and molecular mechanisms of Cuscutae Semen in reproductive diseases Li Kun  1  * Zheng Haixia  1  2 Hao Wenjie  1  2 Kong Yanni  3 Zhou Qianru  3  *  1 School of Pharmacy, Hangzhou Medical College Hangzhou, Zhejiang China  2 School of Basic Medical Sciences and Forensic Medicine, Hangzhou Medical College Hangzhou, Zhejiang China  3 Center for Reproductive Medicine, Department of Traditional Chinese Medicine, Zhejiang Provincial People’s Hospital (Affiliated People's Hospital), Hangzhou Medical College Hangzhou, Zhejiang China Edited by: Uday Kishore Reviewed by: Md Sadique Hussain  Yafei Guo *Correspondence: Kun Li, likun@hmc.edu.cn zhouqianru@hmc.edu.cn 19 9 2025 2025 16 480569 1659342 09 7 2025 04 9 2025 19 09 2025 04 10 2025 04 10 2025 Copyright © 2025 Li, Zheng, Hao, Kong and Zhou. 2025 Li, Zheng, Hao, Kong and Zhou https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Cuscutae Semen (CS), one of the herbs in traditional Chinese medicine, has been recorded for a long time and contains various bioactive compounds, including flavonoids, phenolic acids, lignans, and polysaccharides. These compounds contribute to the medicinal effects on reproductive health. This review examines the therapeutic applications of CS in male and female reproductive diseases, its toxicity, and potential herb-drug interactions. This study focused on the medicinal roles and possible molecular mechanisms of CS in the treatment of reproductive diseases, such as male and female infertility, premature ovarian insufficiency, recurrent spontaneous abortion, and polycystic ovary syndrome. This review examines the mechanisms by which CS regulates the hypothalamic-pituitary-gonadal axis, hormone levels, and key molecules and signaling pathways crucial for reproductive health. By elucidating the potential mechanisms of CS action in reproductive endocrine disorders, this study aimed to provide a scientific basis and evidence for its clinical application in these conditions. These findings provide insights into the molecular mechanisms by which CS has significant potential for treating a range of reproductive disorders. Cuscutae Semen herb reproductive disease infertility premature ovarian insufficiency recurrent spontaneous abortion polycystic ovary syndrome hypothalamus-pituitary-gonadal axis The author(s) declare financial support was received for the research and/or publication of this article. This research was funded by the Clinical and Basic Joint Research Project of ZJPPH (C-2023-YXLH11) and the Zhejiang Provincial Program for the Cultivation of High-level Innovative Health Talents (Year 2018). APC was funded by the Clinical and Basic Joint Research Project of ZJPPH (grant number C-2023-YXLH11). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Molecular Innate Immunity 1 Introduction  Cuscuta chinensis C. chinensis 1 2 3 4 5 6 7 8 Furthermore, CS has been used to treat both male and female reproductive disorders (  Figure 1 9 10 11 14 1 9 15 16 17 18 19 20 21 Figure 1 Main reproductive disorders treated with CS. Circular diagram is divided into five segments around a central circle labeled Cuscutae Semen. The segments list the treated reproductive diseases: male infertility, female infertility, premature ovarian insufficiency, recurrent spontaneous abortion, and polycystic ovary syndrome. 2 The origin of CS for disease therapy CS has been utilized as an herbal remedy, as documented in numerous classical studies of Chinese traditional medicine. CS, classified as a top-grade herb, was initially mentioned in Shennong’s Herbal Classic Shennong’s Herbal Classic 11 16 Cuscuta australis (C. australis) Lei Gong processed medicinal solutions the Collected Works of Materia Medica Classified Canon C. australis The Secret Records of the Stone Chamber C. australis Golden Mirror of Medicine C. australis Medical Prescriptions C. australis The Outline of Jiyang Cuscutae chinensis The Complete Collection in a Plate of Pearls 3 Major Bioactive Compounds of CS CS contains a variety of bioactive compounds (  Figure 2 1 22 9 23 24 23 3 25 26 22 27 28 29 Figure 2 Predominant bioactive compounds in CS. Circular diagram illustrating the composition of Cuscutae Semen, divided into segments labeled: Flavonoids, Phenolic Acid, Lignans, Polysaccharides, Fatty Acids, Terpenes, Alkaloids, Trace Elements, Amino Acids, Volatile Components, and Steroids. 3.1 Flavonoids Approximately 40 primary flavonoids have been identified in CS ( 1 23 26 27 3.2 Phenolic Acids More than 20 different phenolic acids have been identified in CS, with phenolic acids being the main components of C. australis 1 3.3 Lignans More than 20 different lignans have been identified in C. chinensis 1 C. chinensis 23 24 3.4 Polysaccharides CS contains several neutral heteropolysaccharides, such as galactose, glucose, mannose, rhamnose, arabinose, and xylose. Glycosidic bonds are linked to complex molecules. One notable polysaccharide derived from C. chinensis 1 30 3.5 Fatty acids Fatty acids are organic compounds composed of carbon, hydrogen, and oxygen, featuring extended carbon chains and carboxyl groups that are essential for biological functions. The fatty acid structure plays a crucial role in various biological processes. 3.6 Steroids Steroids are organic compounds characterized by a fundamental structure consisting of a cyclopentane polyhydrophenanthrene nucleus. Among the four constituent rings, the steroid core exhibited various ring fusion patterns. The hydroxyl groups at the C-3 position often form chemical bonds with sugar molecules, resulting in compounds classified as glycosides. 3.7 Terpenes Terpenoids are compounds derived from mevalonate, which contains diene units (C5 units) as fundamental structural components. The molecular framework of terpenoids is predominantly chain-like or cyclic, incorporating various functional groups, including alcohols, aldehydes, ketones, carboxylic acids, and esters. 3.8 Alkaloids Alkaloids are naturally occurring nitrogen-containing compounds with basic properties. These compounds typically have complex ring structures and exert significant physiological effects. Alkaloids are the key active components of Cuscutae. 3.9 Trace elements Research has revealed the presence of essential trace elements in Cuscutae, including Mn, Cu, Mn, Fe, Zn, P, and Se ( 31 3.10 Amino acids CS contains various amino acids ( 32 33 3.11 Volatile components Volatile components are among the primary constituents of CS, a seed-based medicinal material rich in oil. Diverse bioactive compounds in CS have multidimensional medicinal functions. Additionally, CS from C. chinensis australis chinensis C. australis 24 C. australis C. australis 34 C. chinensis It is important to note that the major bioactive compounds of Cuscuta species can exhibit variability depending on several factors, including the specific species, the host plant it parasitizes, the geographical location where it grows, and prevailing environmental conditions. This inherent variability underscores the necessity of carefully specifying the Cuscuta species and its origin in both research investigations and therapeutic applications to ensure the consistency and reproducibility of results. 3.12 Material basis for medicinal effects The bioactive compounds in CS exhibit therapeutic effects. Flavonoids are the primary material for treating premature ovarian insufficiency (POI) and recurrent spontaneous abortion (RSA) by modulating PI3K/AKT and inflammatory pathways ( 10 17 20 28 9 16 35 18 22 24 4 Reproduction diseases treated by CS 4.1 Male and female infertility CS, particularly C. chinensis, is 25 36 14 37 38 39 40 Recent evidence has provided insights into the efficacy and mechanism of CS in treating infertility ( 41 43 in vitro 44 42 45 18 41 43 The action of CS in treating infertility includes nourishing the kidneys, regulating hormones ( 35 46 48 17 49 14 35 48 4.2 POI CS has beneficial effects on POI ( 50 51 10 52 53 CS and its active components, particularly flavonoids such as quercetin, show promise in the treatment of POI by modulating key signaling pathways and improving ovarian function ( 10 17 54 10 52 19 17 49 55 56 52 50 4.3 RSA CS has shown promising effects in the treatment of RSA and in enhancing overall reproductive health ( 13 20 57 58 59 3 60 61 4.4 Polycystic ovary syndrome (PCOS) A recent study demonstrated the effects of CS in an established PCOS rat model ( 62 63 15 64 60 4.5 Clinical evidence on CS treatments for reproductive disorders Some clinical evidence involving CS is emerging, while most research on CS is preclinical in nature. Meta-analyses support CS-containing formulations for reproductive disorders, although treatments using CS alone have been less investigated. A recent meta-analysis systematically evaluated the effectiveness of CS-containing Wuzi Yanzong pills in the treatment of oligoasthenospermia in male infertility. The analysis included a total of 16 studies involving 1960 patients, demonstrating that the Wuzi Yanzong pill alone is superior to Western medicine in improving sperm density, sperm motility, conjugal pregnancy rate, and total effective rate ( 65 25 Moreover, a Taiwanese cohort study identified CS as the most commonly prescribed herb for addressing female infertility ( 41 43 50 51 In addition to the meta-analysis, a clinical trial involving a CS-containing formula, designed as a multicenter, randomized, double-anonymized, placebo-controlled study, has been conducted as a therapeutic option for reviving residual follicles in POI, and the study presented a promising strategy to delay ovarian decline and produce significant clinical evidence ( 66 However, clinical trials on single CS therapy are lacking, except for clinical trials on formulations containing CS. Meanwhile, the methodological quality of the RCTs may have been poor, although the risk of bias in the included RCTs was generally low. Therefore, more high-quality clinical trials are required to confirm these findings. 5 Molecular mechanisms by which CS play the medicinal roles in treating reproductive diseases 5.1 Effects of CS on reproductive endocrine CS has garnered attention for its medicinal effects on the reproductive system, particularly through its influence on the hypothalamus-pituitary-gonadal (HPG) axis ( 60  Figure 3 Figure 3 CS plays a medicinal role in reproductive diseases via the hypothalamus-pituitary-gonadal axis and hormones. E, Estrogen; FSH, Follicle-Stimulating Hormone; LH, Luteinizing Hormone; P4, Progesterone; T, Testosterone; HCG, Human Chorionic Gonadotropin. Flowchart illustrating the hormonal regulation of CS (Cuscutae Semen) on reproductive functions. It displays pathways involving the hypothalamus, pituitary gland, testis, and ovary. Hormones like FSH, LH, T, E, P4, and HCG are depicted. Processes include spermatogenesis, ovulation, and embryo development. Areas labeled with CS indicate Cuscutae Semen's therapeutic roles in reproductive diseases like infertility, premature ovarian insufficiency, recurrent spontaneous abortion, and polycystic ovary syndrome are highlighted at the bottom. 5.1.1 HPG axis CS modulates the HPG axis to regulate reproductive health. Specifically, studies have shown that CS total flavonoids promote the synthesis and secretion of gonadotropin-releasing hormone (GnRH) from the hypothalamus ( 67 5.1.2 Hypothalamus The hypothalamus plays a crucial role in regulating endocrine activity by secreting GnRH, which acts on the pituitary gland to stimulate the synthesis of prolactin and gonadotropic hormones ( 68 15 5.1.3 Pituitary The pituitary gland synthesizes and secretes FSH and LH, which are essential for steroid production in the gonads. Furthermore, flavonoids from CS increase LH levels in the anterior pituitaries ( 15 69 5.1.4 Gonads In males, LH promotes the differentiation of Leydig cells, leading to androgen production in the testes, whereas FSH stimulates spermatogenesis. Evidence also shows that CS increases testicular, epididymal, and pituitary weights and stimulates testosterone and LH secretion in rats ( 16 18 70 In females, hormones and their receptors are critical for follicular growth. Upstream signals triggered by total flavonoids from CS can lead to a significant increase in E2, LH, and hCG levels as well as changes in FSHR receptors ( 59 60 69 5.2 Involvement of CS in diverse signaling pathways CS exerts various medicinal effects on the reproductive system by regulating specific molecules and signaling pathways. The different pathways are illustrated in  Figure 4  Table 1 Figure 4 Cell signaling by which CS plays a medicinal role in treating reproductive diseases. Abbreviation: AR, Androgen Receptor; BAD, Bcl-2-Associated Death Promoter; BAX, Bcl-2-Associated X Protein; BCL2, B Cell Lymphoma 2; CASP3, Caspase-3; CCND1, Cyclin D1; COX, Cyclooxygenase; DNMT3L, DNA Methyltransferase 3-Like; EGF, Epidermal Growth Factor; EGFR, Epidermal Growth Factor Receptor; ER, Estrogen receptor; FOS, FBJ murine osteosarcoma viral oncogene homolog; HIF-1, Hypoxia-Inducible Factor-1; HIF1A, Hypoxia-Inducible Factor 1-Alpha; IL6, Interleukin-6; IR, Insulin Receptor; JUN, Jun oncogene; MAPK, Mitogen-Activated Protein Kinase; MMP9, Matrix Metalloproteinase 9; MYC, myelocytomatosis oncogene; NF-κB, Nuclear Factor-Kappa B; Nrf2, Nuclear Factor Erythroid 2-Related Factor 2; OPG, Osteoprotegerin; PI3K, Phosphatidylinositol 3-Kinase; TNF-α, RANKL, Receptor Activator of Nuclear Factor-κB ligand; Tumor Necrosis Factor-Alpha; TP53, TR, Thyroid hormone receptor; Tumor Protein P53; TRACP-5b, Tartrate-resistant Acid Phosphatase 5b; VEGFA, Vascular Endothelial Growth Factor A; TRACP-5b, Tartrate-resistant Acid Phosphatase 5b; VEGFA, Vascular Endothelial Growth Factor A. Diagram illustrating that CS (Cuscutae Semen) is involved in diverse cellular signaling pathways. Labels in different colors show different signaling pathways: inflammatory signaling, apoptosis and cell death pathways, metabolic pathways, gene regulation, epigenetic modifications, cellular markers, tumorigenesis and progression, growth factor signaling, and other potential signals. Table 1 Signaling pathways, molecules, and their functions involved in the pharmacological roles of CS. Signaling pathways Molecules Functions References Growth Factor Signaling EGFR and EGF Epidermal growth factor receptor signaling ( 17 59 71 72 VEGFA Vascular endothelial growth factor signaling ( 71 72 Insulin Insulin receptor signaling ( 73 AR Androgen signaling ( 18 Estrogen Receptor Estrogen receptor signaling ( 19 74 Thyroid Hormone Receptor Thyroid hormone receptor signaling ( 47 Proliferation and Differentiation Signaling PI3K/Akt and MAPK Cell growth and survival ( 10 17 20 21 45 48 54 70 72 76 Notch Cell fate determination ( 20 Cellular Stress and Survival Signaling Calcium Calcium signaling ( 76 Nrf2 Nrf2 pathway activation, antioxidant response signaling ( 17 52 78 HIF-1 and HIF1A HIF1A hypoxia response signaling ( 13 Inflammatory Signaling NF-κB Inflammatory response and immune regulation ( 58 79 TNF-α Tumor necrosis factor signaling ( 13 57 58 79 Oxidative Stress Molecules Pathway response to oxidative stress ( 16 17 35 49 52 54 55 78 79 Apoptosis and Cell Death Regulation BAD, BAX, Cleaved CASP3, CASP3 Inducers of apoptosis and cell death regulation ( 80 Cleaved CASP3, Apoptosis and cell death regulation ( 48 54 58 Bax Regulation of pro-apoptotic protein Bax ( 54 BCL2 Anti-apoptotic protein ( 46 SCF/c-kit-PI3K-Bcl2 Survival signaling pathway ( 48 Tumorigenesis and Progression MYC Cell cycle regulation ( 74 Proteoglycans Tumor biology ( 13 COX Cancer and inflammation ( 57 58 79 IL6 Cytokine involved in cancer progression ( 72 CCND1 Cell cycle regulation ( 72 Ki67 Proliferation marker in cancer ( 42 Metabolism Tryptophan Pathways involving tryptophan ( 4 82 Phenylalanine Pathways involving phenylalanine ( 4 82 Lysine and Vitamin B6 Amino acid degradation and vitamin metabolism ( 4 Taurine and Hypotaurine Taurine metabolism ( 4 Arachidonic Acid Inflammatory processes ( 4 83 Sphingomyelin Lipid metabolism related to cellular membranes ( 4 Starch and Sucrose Carbohydrate breakdown ( 4 Glucose Transporter Regulation of glucose uptake ( 81 Primary Bile Acid Synthesis of bile acids ( 4 Steroid Hormone Synthesis of steroid hormones ( 4 Terpenoid Backbone Synthesis of terpenoids ( 3 4 Gene Regulation TP53 Tumor suppressor and transcription factor ( 19 71 FOS Immediate early gene and transcription factor ( 3 84 JUN Transcriptional regulation ( 26 48 88 Epigenetic DNMT3 L Epigenetic regulation ( 47 73 Cellular Markers and Indicators TRACP-5b Marker for bone resorption ( 3 86 87 Cellular Functions and Modulation Endothelial Function Modulation Proteins Regulation of endothelial cell function ( 14 72 Other potential signals MMP9 Tissue remodeling ( 20 Occludin Cell adhesion ( 88 Osteoprotegerin (OPG) Metabolism ( 86 88 Receptor Activator of Nuclear Factor-κB (RANKL) Bone remodeling ( 3 86 88 Cytokine Immune modulation ( 7 14 79 Cholinergic Immune modulation ( 8 89 AR, Androgen Receptor; BAD, Bcl-2-Associated Death Promoter; BAX, Bcl-2-Associated X Protein; BCL2, B Cell Lymphoma 2; CASP3, Caspase-3; CCND1, Cyclin D1; COX, Cyclooxygenase; DNMT3L, DNA Methyltransferase 3-Like; EGF, Epidermal Growth Factor; EGFR, Epidermal Growth Factor Receptor; FOS, FBJ murine osteosarcoma viral oncogene homolog; HIF-1, Hypoxia-Inducible Factor-1; HIF1A, Hypoxia-Inducible Factor 1-Alpha; IL6, Interleukin-6; JUN, Jun oncogene; MAPK, Mitogen-Activated Protein Kinase; MMP9, Matrix Metalloproteinase 9; MYC, myelocytomatosis oncogene; NF-κB, Nuclear Factor-Kappa B; Nrf2, Nuclear Factor Erythroid 2-Related Factor 2; PI3K, Phosphatidylinositol 3-Kinase; TNF-α, Tumor Necrosis Factor-Alpha; TP53, Tumor Protein P53; TRACP-5b, Tartrate-resistant Acid Phosphatase 5b; VEGFA, Vascular Endothelial Growth Factor A; TRACP-5b, Tartrate-resistant Acid Phosphatase 5b; VEGFA, Vascular Endothelial Growth Factor A. 5.2.1 Growth factor signaling CS affects growth factor signaling, which is vital for cell proliferation and differentiation. There are many different signaling molecules, including EGFR, EGF ( 17 59 71 72 71 72 73 18 19 74 19 74 5.2.2 Proliferation and survival signaling CS may enhance the activation of this pathway, promoting cell proliferation and survival in reproductive tissues via the PI3K/AKT Pathway, which is involved in cell survival, growth, metabolism ( 10 17 48 54 70 75 17 20 21 45 54 72 76 20 20 77 76 17 52 78 13 5.2.3 Inflammatory signaling CS may modulate inflammatory responses and immunity via inflammatory signaling pathways, including NF-κB Signaling ( 58 79 13 57 58 79 Furthermore, CS affects oxidative stress, which is closely linked to inflammation. The polysaccharides and flavonoids found in CS exhibit antioxidant properties that protect reproductive cells from oxidative stress ( 16 35 52 9 16 5.2.4 Apoptosis and cell death signaling CS may regulate apoptosis by modulating pro- and anti-apoptotic proteins. By balancing these proteins, CS can influence cell survival and death in reproductive tissues, potentially protecting cells against stress-induced apoptosis ( 80 48 48 54 46 5.2.5 Metabolic pathways CS is involved in various metabolic pathways that are crucial for cellular energy production and material transformation. Key metabolic processes influenced by CS include carbohydrate breakdown and regulation of glucose uptake, which are essential for cellular energy production. CS may enhance metabolic activity, including starch and sucrose metabolism, as well as glucose transporter regulation ( 81 Amino acid metabolism includes tryptophan metabolism ( 4 82 4 82 4 4 4 83 4 5.2.6 Gene regulation CS has been implicated in the regulation of gene expression through various mechanisms, including the modulation of transcription factors, such as the tumor suppressor p53 ( 19 71 3 84 26 48 5.2.7 Epigenetic modifications Research suggests that CS may play a role in epigenetic regulation, affecting gene expression without altering the DNA sequence, such as DNA methylation regulated by DNMT3L and DNA methyltransferase, which are involved in the regulation of epigenetic modifications ( 47 73 85 5.2.8 Cellular markers CS may influence specific cellular markers that are crucial for identifying and classifying cell types in the reproductive system. These markers include proteins, enzymes, and other biomarkers involved in cellular function and differentiation. For example, CS affects Tartrate-resistant Acid Phosphatase 5b (TRACP-5b), a marker of bone resorption ( 3 86 87 5.2.9 Other potential signals CS also regulates other signals, including MMP9 in Tissue remodeling ( 20 42 3 86 88 7 14 79 8 89 5.3 Integration of molecular mechanisms Molecular mechanisms of several defined compounds in CS therapy for reproductive diseases have been documented, mainly including five primary chemical classes: polysaccharides, flavonoids, phenolic acids, fatty acids, and steroids. These different components play an important role in reproductive diseases through diverse signaling pathways (integrated in  Figure 5 Figure 5 Integration of Molecular Mechanisms of CS Therapy for Reproductive Diseases. The schematic delineates the multifaceted pharmacological profile of CS by illustrating the interconnections among the documented bioactive constituents, underlying molecular mechanisms, and therapeutic efficacies in male infertility, female infertility, primary ovarian insufficiency (POI), polycystic ovary syndrome (PCOS), and recurrent spontaneous abortion (RSA). The figure illustrates that the signaling pathways associated with the five primary chemical classes originate from CS: polysaccharides (green), flavonoids (red), phenolic acids (blue), fatty acids (purple), and steroids (cyan). The lines without arrows represent the parallel relationships between different signal molecules. Flowchart depicting the molecular mechanisms of compounds of Cuscutae Semen (CS), polysaccharides, flavonoids, phenolic acids, fatty acids, and steroids. Arrows indicate signaling pathways through HPG axis, oxidative stress, inflammatory signaling, metabolic pathways, and hormone synthesis, playing an essential role in treating male and female infertility, POI, PCOS, and RSA. CS influences the reproductive system through complex interactions between targeted molecules and signaling pathways. Such interactions result in a wide range of physiological responses. The effect of CS on the reproductive system is further highlighted by its ability to regulate key proteins or receptors. The intricate mechanisms through which CS exerts its effects underscore its potential as a valuable therapeutic agent for various reproductive disorders. 6 Other profiles of CS 6.1 Toxicity and safety The toxicity and safety of CS have been investigated ( 90 Cuscuta chinensis 90 50 90 CS has low toxicity and is considered safe because its safe dosage is significantly higher than the 6–12 g of dried crude herb recommended daily for humans by the China Pharmacopoeia, although standardized dosing guidelines are not well established. At a dosage of 1250 mg/kg CLW, the safe dosage in mice ( 90 90 6.2 Composition consistency The consistency of the diverse chemical compositions of CS should be considered. CS contains a wide and distinct array of flavonoids, chlorogenic acids, and lignans ( 23 88 C. chinensis C. australis 27 34 C. chinensis C. australis 24 6.3 Herb-drug interaction CS may be involved in herb-drug interactions, including hormonal drugs, antidiabetic drugs, immunosuppressants, and drug metabolism, although most interactions are based on preclinical studies or theoretical mechanisms. 1) The hormonal drug flavonoids from CS can promote testosterone secretion and expression of androgen receptor ( 9 18 61 64 91 7 57 92 93 7 Conclusion and future direction In summary, CS 18 16 35 53 60 There are still many limitations that need to be addressed in future research. Continued efforts to elucidate the precise molecular mechanisms of action, including the identification of specific cellular targets, receptors, and downstream signaling events involved in the effects of CS on reproductive tissues and endocrine function, are also warranted. Comprehensive pharmacokinetic and pharmacodynamic studies should be performed to fully elucidate the absorption, distribution, metabolism, and excretion of key CS compounds. The potential synergistic or antagonistic effects of the various compounds present in CS, which are crucial for optimizing therapeutic formulations, including herb-drug interactions, should be investigated through both in vitro in vivo Future studies should explore the optimal dosage, formulation (including the potential for targeted delivery), and duration of CS-based interventions for different reproductive endocrine disorders. Finally, investigating the potential of CS to address specific symptoms and subtypes of reproductive endocrine disorders will contribute to a more refined and personalized approach for its therapeutic application. For CS to be developed into a standardized modern therapeutic, future studies must focus on developing standardized extracts with consistent chemical profiles and predictable efficacy, which is essential for ensuring the safety and reproducibility of clinical outcomes. Acknowledgments The authors would like to thank the funding sources, Zhejiang Provincial Program for the Cultivation of High-level Innovative Health Talents, and Clinical and Basic Joint Research Project of ZJPPH. Author contributions KL: Conceptualization, Funding acquisition, Project administration, Supervision, Visualization, Writing – original draft, Writing – review & editing. HZ: Writing – review & editing. WH: Writing – review & editing. YK: Writing – review & editing. QZ: Conceptualization, Funding acquisition, Project administration, Supervision, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that Generative AI was used in the creation of this manuscript. The partial text has only been polished by Grammarly (Ver 6.8.263) and Paperpal. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Chen L Hu Y Xin G Chen Y Zong Z Song H Research progress on chemical components and pharmacological effects of Cuscuta chinensis and prediction of its quality markers (Q-markers) Chin Herbal Med 2024 55 5298–314 10.7501/j.issn.0253-2670.2024.15.029 2 Ju IG Kim N Choi JG Lee JK Oh MS Cuscutae Japonicae semen ameliorates memory dysfunction by rescuing synaptic damage in Alzheimer’s disease models Nutrients 2019 11 2591 10.3390/nu11112591 31661844 PMC6893468 3 Yang Y Wei Q An R Zhang HM Shen JY Qin XY Anti-osteoporosis effect of Semen Cuscutae in ovariectomized mice through inhibition of bone resorption by osteoclasts J Ethnopharmacol 2022 285 114834 10.1016/j.jep.2021.114834 34801609 4 Fan RH Liu CG Zhang Z Xing MQ Han YM Zhou T Metabolomics analysis of Semen Cuscutae protection of kidney deficient model rats using ultra high-performance liquid chromatography-quadrupole time-of-flight Mass Spectrometry J Pharm BioMed Anal 2022 207 114432 10.1016/j.jpba.2021.114432 34715580 5 Liu M Di YM Zhang L Yang L Zhang L Chen J Oral Chinese Herbal Medicine plus usual care for diabetic kidney disease: study protocol for a randomized, double-blind, placebo-controlled pilot trial Front Endocrinol (Lausanne) 2024 15 1334609 10.3389/fendo.2024.1334609 38390199 PMC10881862 6 Liu H Huang Y Yang J Xu X Dai Q Zhang Y Involvement of estrogen receptor activation in kaempferol-3-O-glucoside’s protection against aging-related cognition impairment and microglial inflammation Exp Cell Res 2023 433 113849 10.1016/j.yexcr.2023.113849 37926343 7 Lin MK Yu YL Chen KC Chang WT Lee MS Yang MJ Kaempferol from Semen cuscutae attenuates the immune function of dendritic cells Immunobiology 2011 216 1103–9 10.1016/j.imbio.2011.05.002 21621872 8 Lin MK Lee MS Huang HC Cheng TJ Cheng YD Wu CR Cuscuta chinensis and C. campestris attenuate Scopolamine-induced memory deficit and oxidative damage in mice Molecules 2018 23 3060 10.3390/molecules23123060 30467292 PMC6320855 9 Yang S Xu X Xu H Xu S Lin Q Jia Z Purification, characterization and biological effect of reversing the kidney-yang deficiency of polysaccharides from semen cuscutae Carbohydr Polym 2017 175 249–56 10.1016/j.carbpol.2017.07.077 28917863 10 Huang C Ning Y Guan Y-H Luo M Tan N Luo S-Y Quercetin and flavonoids from Cuscuta chinensis lam. inhibit tripteryg ium glycoside-induced premature ovarian failure progression via PI3K-A Pharmacogn Mag 2021 17 475–81 10.4103/pm.pm_25_20 11 Donnapee S Li J Yang X Ge AH Donkor PO Gao XM Cuscuta chinensis Lam.: A systematic review on ethnopharmacology, phytochemistry and pharmacology of an important traditional herbal medicine J Ethnopharmacol 2014 157 292 308 10.1016/j.jep.2014.09.032 25281912 12 Fu Y Ding DN Shen Y Jia LY Yan MY Wei W Complementary and alternative medicine for premature ovarian insufficiency: A review of utilization and mechanisms Evid Based Complement Alternat Med 2022 2022 9053930 10.1155/2022/9053930 35399635 PMC8993576 13 Zheng W Lei M Yao Y Zhan J Zhang Y Zhou Q Mechanisms underlying the therapeutic effects of Semen cuscutae in treating recurrent spontaneous abortion based on network pharmacology and molecular docking Front Mol Biosci 2024 11 1282100 10.3389/fmolb.2024.1282100 38872917 PMC11170108 14 Yuan S Zhu S Sun C Zhong X Hu Z Wang X Advances in cytokine-based herbal medicine against premature ovarian insufficiency: A review J Ethnopharmacol 2024 333 118477 10.1016/j.jep.2024.118477 38909824 15 Wang J Wang M Ou Y Wu Q Effects of flavonoids from semen Cuscutae on changes of beta-EP in hypothalamuses and FSH and LH in anterior pituitaries in female rats exposed to psychologic stress Zhong Yao Cai 2002 25 886–8 10.13863/j.issn1001-4454.2002.12.015 12685350 16 Zhao Q Liu Y Wang X Zhu Y Jiao Y Bao Y Cuscuta chinensis flavonoids reducing oxidative stress of the improve sperm damage in bisphenol A exposed mice offspring Ecotoxicol Environ Saf 2023 255 114831 10.1016/j.ecoenv.2023.114831 36966614 17 Yan F Zhao Q Gao H Wang X Xu K Wang Y Exploring the mechanism of (-)-Epicatechin on premature ovarian insufficiency based on network pharmacology and experimental evaluation Biosci Rep 2021 41 BSR20203955 10.1042/BSR20203955 33521822 PMC7881164 18 Yang J Wang Y Bao Y Guo J The total flavones from Semen cuscutae reverse the reduction of testosterone level and the expression of androgen receptor gene in kidney-yang deficient mice J Ethnopharmacol 2008 119 166–71 10.1016/j.jep.2008.06.027 18640256 19 Lu D Shang J Guo X Zhang Y Assessing themechanism of action of “Fructus Ligustri Lucidi-Cuscutae Semen” in prostate cancer treatment using network pharmacology and molecular docking Comput Math Methods Med 2022 2022 1 16 10.1155/2022/9519864 36330452 PMC9626213 20 Gao F Zhou C Qiu W Wu H Li J Peng J Total flavonoids from Semen Cuscutae target MMP9 and promote invasion of EVT cells via Notch/AKT/MAPK signaling pathways Sci Rep 2018 8 17342 10.1038/s41598-018-35732-6 30478366 PMC6255888 21 Wu HW Feng YH Wang DY Qiu WY Yu QY Yang LL Effect of total flavones from Cuscuta chinensis on anti-abortion via the MAPK signaling pathway Evid Based Complement Alternat Med 2018 2018 6356190 10.1155/2018/6356190 30369955 PMC6189658 22 Li Y Ye M Liu H Ji X Yan Y Characterization and analysis of Semen Cuscutae by capillary gas chromatography and gas chromatography-mass spectrometry J Sep Sci 2002 25 255–9 10.1002/jssc.200290030 23 Zhang Y Xiong H Xu X Xue X Liu M Xu S Compounds identification in Semen Cuscutae by Ultra-High-Performance Liquid Chromatography (UPLCs) coupled to electrospray ionization mass spectrometry Molecules 2018 23 1199 10.3390/molecules23051199 29772791 PMC6100538 24 Ye M Yan Y De An G Characterization of phenolic compounds in the Chinese herbal drug Tu-Si-Zi by liquid chromatography coupled to electrospray ionization mass spectrometry Rapid Commun Mass Spectrom 2005 19 1469–84 10.1002/rcm.1580 15880618 25 Liu ZH Li SY Li BJ Zhang F Li XG Li X Deciphering the therapeutic mechanisms of Wuzi Yanzong Pill for asthenozoospermia: A synergistic approach combining bioinformatics and molecular dynamics Cell Biochem Biophys 2025 10.1007/s12013-025-01835-x 40783635 26 Shen J Jia Q Huang X Yao G Ma W Zhang H Development of a HPLC-MS/MS method to determine the 13 elements of Semen Cuscutae and application to a pharmacokinetic study in rats Evid Based Complement Alternat Med 2019 2019 1 11 10.1155/2019/3816304 31885656 PMC6925736 27 Lin HB Lin JQ Lu N Lin JQ Study of quality control on Cuscuta chinensis and C. Australia Zhong Yao Cai 2007 30 1446–9 10.13863/j.issn1001-4454.2007.11.034 18323218 28 Sun X Zhao M Liang W Song H Qu Z Sui L Reverse traceability analysis of estrogenic active ingredients in Cuscutae semen based on intestinal and hepatic metabolism J Pharm BioMed Anal 2025 260 116819 10.1016/j.jpba.2025.116819 40090130 29 Zhang Y Xu SY Liu MN Jia TY Qu WJ Han T Comparative studies on chemical contents and effect in kidney-yang deficiency rats of salt-processed product and wine-processed product of cuscutae semen Evid Based Complement Alternat Med 2019 2019 2049497 10.1155/2019/2049497 31558908 PMC6735186 30 Yang S Xu H Zhao B Li S Li T Xu X The difference of chemical components and biological activities of the crude products and the salt-processed product from Semen Cuscutae Evid Based Complement Alternat Med 2016 2016 8656740 10.1155/2016/8656740 27610186 PMC5004005 31 Yue Y Yang X Li R Wang X Gong C Tang Z Determination and analysis of trace elements in Cuscuta Beverage Indus 2014 000 46–9 32 Lin H Lin J Lin J Ran M Li Y Comparative study on amino acids of four kinds of Cuscuta seeds in Shandong Shizhen Tradit Chin Med 2001 12 195 10.3969/j.issn.1008-0805.2001.03.002 33 John NA Joseph L Role of herbal, nutraceutical and synthetic agents in oligoasthenoteratozoospermia: A comparative assessment NRFHH 2023 3 293 314 10.53365/nrfhh/166370 34 Park I Yang S Choi G Moon BC Song JH An integrated approach for efficient and accurate medicinal cuscutae semen identification Plants (Basel) 2020 9 1410 10.3390/plants9111410 33105814 PMC7690581 35 Cui H Dong P Chen B Effect of total flavonoids of Cuscuta chinensis Lam. (Convolvulaceae) on oxidative stress injury in mouse testis and epididymis, and on serum levels of reproductive hormones in oligoasthenospermia mice model Trop J Pharm Res 2021 18 1253–8 10.4314/tjpr.v18i6.15 36 Qiu W Fu F Wan X Dong Z Wang X Lin T Research overview of classic prescription Wuzi Yanzong Pill in the treatment of male infertility J Pract Trad Chin Inter Med 2025 https://link.cnki.net/urlid/21.1187.R.20250530.1135.008 Accessed May 30, 2025 37 Che Y Guo J-Y Wang D Song K Ding S-L Research progress on the application of the main components of Cuscuta sinensis in the urogenital system Pharmacol Discov 2023 3 12–7 10.53388/PR202303012 38 Wu X Xu L Observation on the effect of modified Cistanche Cuscuta Pills in treating endometrial hyperplasia according to symptoms Pract Gynecol Endocrinol 2022 9 88 91 10.3969/j.issn.2095-8803.2022.06.025 39 Fu J Xia Y Treatment of 56 cases of light-weight polycystic ovary syndrome with modified Cistanche Cuscuta chinensis pills Sichuan Tradit Chin Med 2011 29 90–1 40 Liu N Observation on the efficacy of Shoutai Pills in treating 40 cases of fetal leakage and fetal movement disorder Chin Prac Med 2018 13 140–1 10.14163/j.cnki.11-5547/r.2018.15.083 41 Hung YC Kao CW Lin CC Liao YN Wu BY Hung IL Chinese herbal products for female infertility in Taiwan: A population-based cohort study Med (Baltimore) 2016 95 e3075 10.1097/MD.0000000000003075 26986137 PMC4839918 42 Liu CX Hu SQ Liu DL Xu YH Hu K Guo J The effect of semen cuscutae flavonoid on Sertoli cells and blood-testis barrier in male infertility: integrating network pharmacology and experimental verification Pharm Biol 2023 61 986–99 10.1080/13880209.2023.2229380 37386769 PMC10316745 43 Hyun JY Jung HS Park JY Herbal therapeutics for female infertility: A systematic review and meta-analysis J Ethnopharmacol 2024 319 117258 10.1016/j.jep.2023.117258 37778518 44 Han S Dai Y Sun L Xing Y Ding Y Zhang X Molecular mechanism of Cuscutae semen-radix rehmanniae praeparata in relieving reproductive injury of male rats induced with tripterygium wilfordii multiglycosides: A tandem mass tag-based proteomics analysis Front Pharmacol 2023 14 1050907 10.3389/fphar.2023.1050907 36874004 PMC9982038 45 Wong EW Cheng CY Impacts of environmental toxicants on male reproductive dysfunction Trends Pharmacol Sci 2011 32 290–9 10.1016/j.tips.2011.01.001 21324536 PMC3090518 46 Guan S Zhu Y Wang J Dong L Zhao Q Wang L A combination of Semen Cuscutae and Fructus Lycii improves testicular cell proliferation and inhibits their apoptosis in rats with spermatogenic dysfunction by regulating the SCF/c-kit-PI3K-Bcl2 pathway J Ethnopharmacol 2020 251 112525 10.1016/j.jep.2019.112525 31904495 47 Zhang B Su H Ren XQ Li WX Ding Y Zhang X Study on mechanism of Cuscutae Semen flavonoids in improving reproductive damage of Tripterygium Glycosides Tablets in rats based on high-throughput transcriptome sequencing Zhongguo Zhong Yao Za Zhi 2019 44 3478–85 10.19540/j.cnki.cjcmm.20190527.402 31602912 48 Wang J Bao B Meng F Deng S Dai H Feng J To study the mechanism of Cuscuta chinensis Lam. And Lycium barbarum L. in the treatment of asthenospermia based on network pharmacology J Ethnopharmacol 2021 270 113790 10.1016/j.jep.2021.113790 33460759 49 Sayed SMA Alseekh S Siems K Fernie AR Luyten W Schmitz-Linneweber C Identification of a hydroxygallic acid derivative, zingibroside R1 and a sterol lipid as potential active ingredients of Cuscuta chinensis extract that has neuroprotective and antioxidant effects in aged Caenorhabditis elegans Nutrients 2022 14 4199 10.3390/nu14194199 36235851 PMC9570774 50 Li Y Xia G Tan Y Shuai J Acupoint stimulation and Chinese herbal medicines for the treatment of premature ovarian insufficiency: A systematic review and meta-analysis Complement Ther Clin Pract 2020 41 101244 10.1016/j.ctcp.2020.101244 33039750 51 Shen HS Chang WC Chen YL Wu DL Wen SH Wu HC Chinese herbal medicines have potentially beneficial effects on the perinatal outcomes of pregnant women Front Pharmacol 2022 13 831690 10.3389/fphar.2022.831690 35734397 PMC9207412 52 Chen Y Fan X Ma K Wang K Tian C Li M Bushen Culuan Decoction ameliorates premature ovarian insufficiency by acting on the Nrf2/ARE signaling pathway to alleviate oxidative stress Front Pharmacol 2022 13 857932 10.3389/fphar.2022.857932 35462905 PMC9019758 53 Zhu XN Zong LL Zhang CM Guan YC Hao S Effect of Cuscutae Semen and its major components flavones on kidney deficiency and ovulation inhibition in rats Chin J Exp Tradit Med Formul 2014 20 169–72 54 Wang Y Teng X Liu J Research progress on the effect of traditional chinese medicine on signal pathway related to premature ovarian insufficiency Evid Based Complement Alternat Med 2022 2022 7012978 10.1155/2022/7012978 36159578 PMC9492371 55 Zhang Y Xu S Liu M Xu X Han T Jia Z Pharmacokinetic/pharmacodynamic study of salt-processed product of cuscutae semen with hepatoprotective effects Curr Drug Metab 2022 23 964–72 10.2174/1389200224666221118112009 36411565 56 Xie Y Zeng Z Zhang J Han Q Song C Jin S Cuscutae Semen in depression-induced ovarian dysfunction: metabolomics with UPLC-QToF-MS in female mice Front Mol Biosci 2025 12 1595602 10.3389/fmolb.2025.1595602 40370520 PMC12074923 57 Liao JC Chang WT Lee MS Chiu YJ Chao WK Lin YC Antinociceptive and anti-inflammatory activities of cuscuta chinensis seeds in mice Am J Chin Med 2014 42 223–42 10.1142/S0192415X14500153 24467546 58 Suresh V Sruthi V Padmaja B Asha VV  In vitro J Ethnopharmacol 2011 134 872–7 10.1016/j.jep.2011.01.043 21295129 59 Ma HX You ZL Wang XY Effect of total flavones from Cuscuta chinensis on expression of Fas/FasL, PCNA and HB-EGF in SD rats model with bromocriptine-induced abortion Zhong Yao Cai 2008 31 1706-9 10.13863/j.issn1001-4454.2008.11.050 19260287 60 Ke J Duan R Effects of flavonoids from semen cuscutae on the hippocampal-hypothalamic-pituitary-ovarian sex hormone receptors in female rats exposed to psychological stress Clin Exp Obstet Gynecol 2013 40 271–4 10.1556/CEOG.40.2013.2.10 23971257 61 Sun L Yuan Z Jian L Jiang Q Zhang S Tan J The Modified Bushen Antai Recipe upregulates estrogen and progesterone receptors at the maternal-fetal interface in pregnant rats with mifepristone-induced pregnancy loss Evid Based Complement Alternat Med 2019 2019 8312020 10.1155/2019/8312020 30792746 PMC6354171 62 Xu D Lu M Liu Y Chen W Yang X Xu M An analysis of the clinical medication rules of traditional chinese medicine for polycystic ovary syndrome based on data mining Evid Based Complement Alternat Med 2023 2023 6198001 10.1155/2023/6198001 36865746 PMC9974250 63 Zhang YY Ma JX Zhu YT Wang YX Chen WQ Sun X Investigation of the mechanisms and experimental verification of Cuscuta-Salvia in the treatment of polycystic ovary syndrome (PCOS) via network pharmacology J Ovarian Res 2022 15 40 10.1186/s13048-022-00964-8 35379295 PMC8978390 64 Chen K Liu X Meng X Li H Yang C Wang X Efficacy and safety of Gushen Antai Pills combined with dydrogesterone in the treatment of threatened miscarriage: a systematic review and meta-analysis Front Pharmacol 2023 14 1138968 10.3389/fphar.2023.1138968 37332346 PMC10275364 65 Duan J Ma W Wuzi Yanzong Pill in the treatment of male oligoasthenospermia: A meta-analysis J Yunnan Univ Chin Med 2024 47 106–12 10.19288/j.cnki.issn.1000-2723.2024.04.018 66 Peng Y Liu J Li Y Nie G Cheng F Feng D Efficacy and safety of HYYK formula for residual follicle revival in premature ovarian insufficiency: a multicenter, randomized, double-blind, placebo-controlled trial protocol BMC Complement Med Ther 2025 25 46 10.1186/s12906-025-04803-3 39934764 PMC11817039 67 Yang Z Chen K Zhang Y Xu B Huang Y Zhang X Study on pharmacokinetic and tissue distribution of hyperin, astragalin, kaempferol-3-O-beta-D-glucuronide from rats with multiple administrations of Semen Cuscutae processed with salt solution with effect of treating recurrent spontaneous abortion Front Pharmacol 2024 15 1440810 10.3389/fphar.2024.1440810 39351087 PMC11439818 68 Abbara A Dhillo WS Astrocytes: a star emerges in the control of reproductive hormones J Clin Invest 2024 134 e182669 10.1172/JCI182669 39087475 PMC11290961 69 Krause BT Ohlinger R Haase A Lutropin alpha, recombinant human luteinizing hormone, for the stimulation of follicular development in profoundly LH-deficient hypogonadotropic hypogonadal women: a review Biologics 2009 3 337–47 10.2147/btt.2009.3306 19707419 PMC2726078 70 Qin DN She BR She YC Wang JH Effects of flavonoids from Semen Cuscutae on the reproductive system in male rats Asian J Androl 2000 2 99 102 11232800 71 Cao Y Chen Y Wang P Lu J Han X She J Network pharmacology and experimental validation to explore the molecular mechanisms of Bushen Huoxue for the treatment of premature ovarian insufficiency Bioengineered 2021 12 10345–62 10.1080/21655979.2021.1996317 34753385 PMC8810062 72 Dai W Sun Y Zhong G A network pharmacology approach to estimate the active ingredients and potential targets of Cuscutae semen in the treatment of osteoporosis Med Sci Monit 2020 26 e920485 10.12659/MSM.920485 32081843 PMC7047917 73 Wei Y Han C Li S Cui Y Bao Y Shi W Cuscuta chinensis flavonoids down-regulate the DNA methylation of the H19/Igf2 imprinted control region and estrogen receptor alpha promoter of the testis in bisphenol A exposed mouse offspring Food Funct 2020 11 787–98 10.1039/C9FO02770J 31930238 74 Zhang W Yuan Y Huang G Network pharmacology and molecular docking approach to reveal the immunotherapeutic mechanism of Cuscutae Semen in treating thin endometrium J Immunol Res 2022 2022 4333128 10.1155/2022/4333128 36249421 PMC9553449 75 Zhou J Guo Z Peng X Wu B Meng Q Lu X Chrysotoxine regulates ferroptosis and the PI3K/AKT/mTOR pathway to prevent cervical cancer J Ethnopharmacol 2025 338 119126 10.1016/j.jep.2024.119126 39557107 76 Jang JY Kim HN Kim YR Choi YH Kim BW Shin HK Aqueous fraction from Cuscuta japonica seed suppresses melanin synthesis through inhibition of the p38 mitogen-activated protein kinase signaling pathway in B16F10 cells J Ethnopharmacol 2012 141 338–44 10.1016/j.jep.2012.02.043 22414478 77 Gao Y Wang C Wang K He C Hu K Liang M The effects and molecular mechanism of heat stress on spermatogenesis and the mitigation measures Syst Biol Reprod Med 2022 68 331–47 10.1080/19396368.2022.2074325 35722894 78 Shu J Li L Yu H Zhang D Fertility-enhancing potential of ethanol extract of Cuscuta chinensis seeds in a rat model of unilateral cryptorchidism Trop J Pharm Res 2022 20 995 1002 10.4314/tjpr.v20i5.16 79 Hou L Yang L Zhu C Miao J Zhou W Tang Y Cuscutae semen alleviates CUS-induced depression-like behaviors in mice via the gut microbiota-neuroinflammation axis Front Pharmacol 2023 14 1107781 10.3389/fphar.2023.1107781 36909192 PMC9998491 80 Qin D Tang Y Wang X Mao Y Feng Z Antagonistic effect of cuscuta chinensis on a rat model with unilateral cryptorchidism Med Sci Monit 2019 25 6727–35 10.12659/MSM.916893 31493333 PMC6752106 81 Li Y Xu Y Zhang B Wang Z Ma L Sun L Atractylodes macrocephala Koidz. and Cuscuta chinensis Lam. extract relieves insulin resistance via PI3K/Akt signalling in diabetic Drosophila J Tradit Complement Med 2024 14 424–34 10.1016/j.jtcme.2024.01.010 39035690 PMC11259714 82 Wang X Gao H Tan S Xu C Xu F Wang T An integrated approach to uncover quality markers of stir-baking Semen Cuscuta with salt solution preventing recurrent spontaneous abortion based on chemical and metabolomic profiling J Chromatogr B Analyt Technol BioMed Life Sci 2021 1177 122727 10.1016/j.jchromb.2021.122727 34102535 83 Bai X Tang Y Li Q Liu D Liu G Fan X An integrated analysis of network pharmacology, molecular docking, and experiment validation to explore the new candidate active component and mechanism of Cuscutae Semen-Mori Fructus coupled-herbs in treating oligoasthenozoospermia Drug Des Devel Ther 2021 15 2059–89 10.2147/DDDT.S307015 34040346 PMC8139735 84 Liu H Zhang H Fan H Tang S Weng J The preventive effect of Cuscutae Semen polysaccharide on bone loss in the ovariectomized rat model BioMed Pharmacother 2020 130 110613 10.1016/j.biopha.2020.110613 34321160 85 Sun Y Zong C Liu J Zeng L Li Q Liu Z C-myc promotes miR-92a-2-5p transcription in rat ovarian granulosa cells after cadmium exposure Toxicol Appl Pharmacol 2021 421 115536 10.1016/j.taap.2021.115536 33865896 86 Xu C Shi Y Xu H Zhao G Niu S Yao J Comparative Investigation between raw and stir-frying processed Cuscutae Semen based on HPLC fingerprints coupled with chemometric methods J AOAC Int 2023 106 1037–47 10.1093/jaoacint/qsad002 36610995 87 Kim EY Kim EK Lee HS Sohn Y Soh Y Jung HS Protective effects of Cuscutae semen against dimethylnitrosamine-induced acute liver injury in Sprague-Dawley rats Biol Pharm Bull 2007 30 1427–31 10.1248/bpb.30.1427 17666798 88 Mo H Zhang N Li H Li F Pu R Beneficial effects of Cuscuta chinensis extract on glucocorticoid-induced osteoporosis through modulation of RANKL/OPG signals Braz J Med Biol Res 2019 52 e8754–e 10.1590/1414-431X20198754 31826180 PMC6903142 89 Patel S Sharma V Chauhan NS Dixit VK An updated review on the parasitic herb of Cuscuta reflexa Roxb Zhong Xi Yi Jie He Xue Bao 2012 10 249–55 10.3736/jcim20120302 22409913 90 Maimaiti A Li JJ Shi L Investigating the acute and sub-acute toxicity of medicinal Cuscuta chinensis Lam plant J Ethnopharmacol 2021 273 114005 10.1016/j.jep.2021.114005 33705922 91 Kim JH Seo HJ Noh BW He MT Choi YH Cho EJ Protective effects of Cuscuta chinensis Lam. extract against learning and memory dysfunction induced by streptozotocin and amyloid beta(25-35) in vivo Arch Physiol Biochem 2025 1 13 10.1080/13813455.2025.2502861 Accessed May 12, 2025 40353733 92 Zheng J Zhou HH Effects of the flavonoids on cytochrome P-450 CYP1, 2E1, 3A4 and 19 Yao Xue Xue Bao 2007 42 8 12 17520800 93 Wang D Song Y Zhu Y Wang Y Li H Ge G Carboxylesterases mediated herb-drug interactions: A systematic review J TMR Mod Herb Med 2019 2 147 10.12032/TMRmhm2017B40 Glossary AR Androgen Receptor BAD Bcl-2 Antagonist of Cell Death BAX Bcl-2-Associated X Protein BCL2 B-cell Lymphoma 2 CASP3 Caspase 3 CCND1 Cyclin D1 CRF Corticotropin-Releasing Factor DNMT3 L DNA Methyltransferase 3 Like E2 Estradiol EGF Epidermal Growth Factor EGFR Epidermal Growth Factor Receptor FOS Fos Proto-Oncogene FSH Follicle-Stimulating Hormone FSHR Follicle-Stimulating Hormone Receptor GnRH Gonadotropin-Releasing Hormone hCG Human Chorionic Gonadotropin HIF-1 Hypoxia-Inducible Factor 1 HIF1A Hypoxia-Inducible Factor 1 Alpha HPG Hypothalamus-Pituitary-Gonadal IL6 Interleukin 6 JUN Jun Proto-Oncogene Ki67 MKI67 (marker of proliferation Kiel 67) LH Luteinizing Hormone LHR Luteinizing Hormone Receptor MAPK Mitogen-Activated Protein Kinase MMP9 Matrix Metalloproteinase 9 NF-κB Nuclear Factor Kappa-B Nrf2 Nuclear Factor Erythroid 2-Related Factor 2 OCCLUDIN Occludin OPG Osteoprotegerin PCOS Polycystic Ovary Syndrome PI3K/AKT Phosphatidylinositol 3-Kinase/Akt POI Premature Ovarian Insufficiency RANKL Receptor Activator of Nuclear Factor-κB Ligand RSA Recurrent Spontaneous Abortion SCF/c-kit–PI3K–Bcl-2 Stem Cell Factor/c-kit–Phosphatidylinositol 3-Kinase–Bcl-2 TCM Traditional Chinese Medicine TNF-α Tumor Necrosis Factor-α TP53 Tumor Protein 53 TRACP-5b Tartrate-Resistant Acid Phosphatase 5b VEGF Vascular Endothelial Growth Factor VEGFA Vascular Endothelial Growth Factor A β-EP β-Endorphin ",
  "metadata": {
    "Title of this paper": "Carboxylesterases mediated herb-drug interactions: A systematic review",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491298/"
  }
}