{
  "title": "Paper_1126",
  "abstract": "pmc World J Nephrol 2210 wjn WJN World Journal of Nephrology 2220-6124 Baishideng Publishing Group Inc PMC12476775 PMC12476775.1 12476775 12476775 41024955 10.5527/wjn.v14.i3.107955 jWJN.v14.i3.eid107955 1 Editorial Diagnostic challenges and treatment approaches for hydatid cysts in atypical localizations Semash K et al Semash Konstantin Department of Minimally Invasive Pediatric Surgery and Transplantation, National Children's Medical Center, Tashkent 100171, Uzbekistan. doctorsemash@gmail.com Voskanov Mikhail Department of Emergency Medicine, Mayo Clinic, Rochester, MN 55905, United States Author contributions: Semash K, Voskanov M was responsible for the conception, writing, critical content development, and final approval of this editorial manuscript. Corresponding author: Konstantin Semash, MD, PhD, Department of Minimally Invasive Pediatric Surgery and Transplantation, National Children's Medical Center, Parkent Street 294, Tashkent 100171, Uzbekistan. doctorsemash@gmail.com 25 9 2025 25 9 2025 14 3 497736 107955 2 4 2025 22 4 2025 23 6 2025 25 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ Hydatid disease, caused by the Echinococcus granulosus parasite, is traditionally associated with liver and lung involvement. However, recent years have seen an increase in cases with atypical localizations, such as the kidneys, thyroid, soft tissues, and bones. The study by Celik et al Echinococcosis Echinococcosis granulosus Hydatid disease Atypical localization Diagnosis Surgery Imaging Multidisciplinary management pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: et al INTRODUCTION Echinococcosis is a parasitic disease caused by the larval stage of the tapeworm Echinococcus granulosus[ 1 via 2 According to literature data, renal hydatid cysts occur in 1%-3% of cases, osseous involvement in fewer than 2%, while involvement of the thyroid, pancreas, soft tissues, facial bones, and other unusual sites is mostly limited to isolated case reports. In endemic regions such as Turkey, Iran, Uzbekistan, Kazakhstan, North Africa, and South America, the incidence of echinococcosis may reach 6-30 cases per 100000 population annually and exceed 50 per 100000 in some rural areas (Figure 1 2 4 1 3 Figure 1  Global endemicity of cystic echinococcosis by country. Echinococcus granulosus COMMON VS The most common localizations of hydatid cysts are the liver (up to 65%-70% of cases) and lungs (20%-25%)[ 2 5 Recent literature emphasizes the increasing clinical relevance of hydatid disease in atypical anatomical locations beyond the liver and lungs. Shahriarirad et al 5 et al 6 et al 7 et al 8 et al 9 et al 10 et al 11 CLINICAL PRESENTATION AND DIAGNOSTIC CONSIDERATIONS Rare forms of echinococcosis often mimic other conditions, such as tumors, abscesses, cysts, or fibrotic lesions. This can lead to diagnostic errors and delayed treatment[ 12 Diagnosis of echinococcosis relies on a combination of clinical history, epidemiological context, serological tests, and imaging. The key imaging modalities are ultrasound, computed tomography (CT), and magnetic resonance imaging (MRI)[ 1 12 13 Ultrasonography is a crucial first-line tool in endemic regions for evaluating cystic thyroid nodules, and when echinococcosis is suspected, fine-needle aspiration (FNA) should be avoided due to the risk of cyst rupture[ 14 Diagnosis of complicated and rare forms of echinococcosis presents significant challenges, particularly in the presence of secondary changes within the cyst structure. The development of superinfection, intracystic hemorrhage, or rupture into the biliary tract, peritoneal cavity, or surrounding tissues can significantly alter the ultrasound and tomographic appearance, potentially leading to diagnostic errors[ 15 5 11 In their comprehensive imaging-based review, Srinivas et al 13 Aledavoud et al 16 In a retrospective study, Shahriarirad et al 5 Mutafchiyski et al 17 Serological diagnosis includes several techniques, each with varying sensitivity depending on the cyst location. The enzyme-linked immunosorbent assay (ELISA) is widely used due to its high sensitivity (up to 95%) for hepatic echinococcosis, but its accuracy decreases significantly for extrahepatic sites, sometimes falling below 50%[ 2 14 2 14 17 2 14 However, the diagnosis cannot always be made based on the available diagnostic capabilities. Thus, Kbir et al 18 18 et al 19 19 Ramos Pascua et al 20 et al 21 All these studies reinforce the diagnostic complexity and surgical importance of managing hydatid disease in rare localizations. TREATMENT STRATEGIES The treatment of echinococcosis is multimodal. Management strategies for cystic echinococcosis must be individualized and guided by cyst stage, localization, patient condition, and available resources. According to WHO guidelines, observation (“watch and wait”) is appropriate for asymptomatic patients with small (< 5 cm), calcified, or degenerative cysts (CE4-CE5), especially in elderly or high-risk patients. This conservative approach includes serial imaging (CT or ultrasound every 3-6 months for the first two years, then annually), serologic monitoring, and clinical follow-up[ 1 Medical therapy with albendazole is indicated for cysts measuring 5-7 cm, inoperable cases, patients with multiple cysts, or when there is a high risk of intraoperative dissemination. Albendazole is also used as perioperative prophylaxis (4-6 weeks before and up to 3 months after surgery)[ 1 12 22 In selected cases, particularly involving accessible cysts in the abdominal cavity or soft tissues, the puncture, aspiration, injection, and reaspiration (PAIR) technique may be considered as a minimally invasive treatment option[ 1 12 22 Surgery remains the mainstay for symptomatic, complicated, or high-risk cysts. Indications include cyst rupture, infection, compression of adjacent structures, and locations with high rupture risk ( e.g. 22 2 e.g. 1 Surgical management of hydatid cysts in rare locations requires meticulous preoperative planning, particularly for the involvement of bones, kidneys, the central nervous system, soft tissues, and the thyroid gland[ 14 16 22 24 9 23 14 et al 16 PROGNOSIS IN PATIENTS WITH HYDATID DISEASE IN RARE ANATOMICAL LOCALIZATIONS The overall prognosis of patients with cystic echinococcosis in atypical or rare anatomical sites largely depends on the timing of diagnosis, the involved organ, and the adequacy of treatment[ 2 4 A favorable prognosis is typically observed in superficial localizations ( e.g. 14 17 21 22 5 22 An unfavorable prognosis may be associated with involvement of the central nervous system, heart, bones, or spinal canal. These sites are associated with higher risks of complications such as rupture, neurological deficits, or anaphylaxis[ 24 25 26 Delays in diagnosis, particularly in non-endemic countries or among non-specialist clinicians, can worsen outcomes due to complications such as infection, rupture, or mass effect[ 1 4 1 CRITICAL APPRAISAL OF THE CELIK ET AL STUDY The report by Celik et al 11 Despite these limitations, the article by Celik et al 11 et al 11 Therapeutically, surgery remains the mainstay for most rare echinococcal localizations, particularly when cysts are symptomatic, rapidly enlarging, or pose a risk of rupture[ 27 e.g. en bloc 1 Table 1 Diagnostic and therapeutic strategy for rare forms of echinococcosis  Localization  Preferred imaging  Surgical considerations  Medical therapy  Special notes Brain/CNS MRI Craniotomy with cyst excision Albendazole perioperatively High risk of rupture; pre-op imaging critical Bone/spine CT/MRI  En bloc Long-term albendazole Often mimics tumors; recurrence risk high Kidneys CT/US Partial/total nephrectomy Albendazole + scolicidal agents Differentiate from neoplasms Thyroid/neck MRI/US Organ-preserving resection if feasible Short course albendazole Careful dissection to avoid dissemination. FNAB is also appropriate Breast US, MRI Pericystectomy Albendazole pre- and postoperatively Rare; can mimic malignancy. Diagnosis requires high index of suspicion. Retroperitoneum CT/MRI Surgical excision where accessible Albendazole pre- and postoperatively Risk of incomplete resection Soft tissues/muscle MRI Complete cyst removal Adjunctive therapy recommended Often misdiagnosed as sarcoma or abscess Pelvic organs MRI Organ-sparing surgery if possible Albendazole + scolicidal agents May mimic gynecologic tumors CNS: Central nervous system; MRI: Magnetic resonance imaging; CT: Computed tomography; US: Ultrasound. These findings reinforce the notion that successful management of echinococcosis in atypical locations relies on individualized diagnostic and therapeutic strategies, built upon a multidisciplinary foundation and informed by an evolving global literature. CONCLUSION In conclusion, the presented clinical review not only broadens our understanding of the potential manifestations of hydatid disease in rare localization but also reinforces the need for a systematic, multidisciplinary approach to diagnosis and treatment. It serves as a reminder that even rare localizations of parasitic diseases require clinical attention and integrated care strategies. Clinicians should maintain a high index of suspicion for echinococcosis even in rare anatomical sites, especially in endemic areas. Development of standardized diagnostic and therapeutic algorithms and reporting systems will be critical in improving outcomes for these complex cases.  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Brunetti E Kern P Vuitton DA Writing Panel for the WHO-IWGE Expert consensus for the diagnosis and treatment of cystic and alveolar echinococcosis in humans Acta Trop 2010 114 1 16 19931502 10.1016/j.actatropica.2009.11.001 2 Wen H Vuitton L Tuxun T Li J Vuitton DA Zhang W McManus DP Echinococcosis: Advances in the 21st Century Clin Microbiol Rev 2019 32 e00075 18 30760475 10.1128/CMR.00075-18 PMC6431127 3 Vuitton DA McManus DP Rogan MT Romig T Gottstein B Naidich A Tuxun T Wen H Menezes da Silva A World Association of Echinococcosis International consensus on terminology to be used in the field of echinococcoses Parasite 2020 27 41 32500855 10.1051/parasite/2020024 PMC7273836 4 Deplazes P Rinaldi L Alvarez Rojas CA Torgerson PR Harandi MF Romig T Antolova D Schurer JM Lahmar S Cringoli G Magambo J Thompson RC Jenkins EJ Global Distribution of Alveolar and Cystic Echinococcosis Adv Parasitol 2017 95 315 493 28131365 10.1016/bs.apar.2016.11.001 5 Shahriarirad R Erfani A Eskandarisani M Rastegarian M Sarkari B Uncommon Locations of Cystic Echinococcosis: A Report of 46 Cases from Southern Iran Surg Res Pract 2020 2020 2061045 33015320 10.1155/2020/2061045 PMC7520003 6 Alekya K Meraj M Moorthy NLN Imaging features of hydatid cyst in unusual locations: A case series Indian J Med Sci 2024 0 1 4 7 Bennane W Moussahim A Chakir Y Soussi Abdallaoui M Fadil A Aboutaeib R Multiple Disseminated Hydatidosis with Rare Locations: Mediastinal, Pancreatic and Pelvic (Case Report) Eur J Med Health Sci 2024 6 20 22 8 Gader G Slimane A Sliti F Kherifech M Belhaj A Bouhoula A Kallel J Hydatid cyst of the brainstem: The rarest of the rare locations for echinococcosis Radiol Case Rep 2024 19 4422 4425 39185433 10.1016/j.radcr.2024.07.010 PMC11342087 9 Yordanov A Boncev R Kostov S Kornovski Y Ivanova Y Slavchev S Todorova V Karakadieva K Tranchev L Vasileva-Slaveva M A very rare case of echinococcus granulosus arising in the ovary and the uterus Prz Menopauzalny 2023 22 236 239 38239398 10.5114/pm.2023.133791 PMC10793605 10 Di Giambenedetto S Fagotti A Quaranta G Iannone V Fancello G Steiner RJ Mazzon G Masucci L Teodorico E Borghetti A Naldini A Scambia G Reporting a single case of cystic echinococcosis in retroperitoneal mass of uncertain origin Parasitol Res 2023 123 40 38095718 10.1007/s00436-023-08018-8 11 Celik AS Yosunkaya H Yayilkan Ozyilmaz A Memis KB Aydin S  Echinococcus granulosus World J Nephrol 2025 14 103027 40568337 10.5527/wjn.v14.i2.103027 PMC12001228 12 Yuksel M Demirpolat G Sever A Bakaris S Bulbuloglu E Elmas N Hydatid disease involving some rare locations in the body: a pictorial essay Korean J Radiol 2007 8 531 540 18071284 10.3348/kjr.2007.8.6.531 PMC2627456 13 Srinivas MR Deepashri B Lakshmeesha MT Imaging Spectrum of Hydatid Disease: Usual and Unusual Locations Pol J Radiol 2016 81 190 205 27231490 10.12659/PJR.895649 PMC4868106 14 Aydin S Tek C Dilek Gokharman F Fatihoglu E Nercis Kosar P Isolated hydatid cyst of thyroid: An unusual case Ultrasound 2018 26 251 253 30479640 10.1177/1742271X18770926 PMC6243454 15 Karmazanovsky GG Stepanova YA Kondratyev EV Stashkiv VI Hepatic echinococcosis: difficulties in diagnosis at the early stages of progression and with complications (literature review) Ann Hir Gepatol 2021 26 18 23 16 Aledavoud A Mohammadi M Ataei A Shahesmaeilinejad A Harandi MF Thyroid involvement in cystic echinococcosis: a systematic review BMC Infect Dis 2024 24 889 39210268 10.1186/s12879-024-09778-z PMC11363358 17 Mutafchiyski VM Popivanov GI Tabakov MS Vasilev VV Kjossev KT Cirocchi R Philipov AT Vaseva VS Baitchev GT Ribarov R Konaktchieva MN Cystic Echinococcosis of the Breast - Diagnostic Dilemma or just a Rare Primary Localization Folia Med (Plovdiv) 2020 62 23 30 32337894 10.3897/folmed.62.e47740 18 Kbir GH Messaoudi S Selmi M Maatouk M Bouzidi MT Ennaceur F Ben Moussa M An unusual localization of echinococcosis: Gallbladder hydatid cyst IDCases 2022 27 e01455 35242561 10.1016/j.idcr.2022.e01455 PMC8866152 19 Koppen T Barth TFE Eichhorn KW Gabrielpillai J Kader R Bootz F Send T Alveolar Echinococcosis of the Parotid Gland-An Ultra Rare Location Reported from Western Europe Pathogens 2021 10 426 33916650 10.3390/pathogens10040426 PMC8067166 20 Ramos Pascua L Santos Sanchez JA Samper Wamba JD Alvarez Castro A Rodriguez Altonaga J Atypical image findings in a primary subcutaneous hydatid cyst in the gluteal area Radiography (Lond) 2017 23 e65 e67 28687303 10.1016/j.radi.2017.03.017 21 Chablou M Id M'barek A Chacha R Merhom A Tahi M A Solitary Abscessed Hydatid Cyst of the Buttock: A Rare Case Cureus 2023 15 e38823 37303317 10.7759/cureus.38823 PMC10251732 22 Mona C Meryam M Nizar K Yazid B Amara A Haithem Z Dhafer H Anis BM Exploring rare locations of hydatid disease: a retrospective case series BMC Surg 2024 24 160 38760696 10.1186/s12893-024-02443-x PMC11100243 23 El Mahi N Siouri H Mojahid A Haddar K Ziani H Nasri S Kamaoui I Skiker I Femoral hydatid cyst: A rare localization of bone echinococcosis: A case report Radiol Case Rep 2025 20 1691 1694 39868062 10.1016/j.radcr.2024.12.035 PMC11760300 24 Yousofi Darani H Jafari R Renal echinococcosis; the parasite, host immune response, diagnosis and management J Infect Dev Ctries 2020 14 420 427 32525824 10.3855/jidc.11496 25 Firouzi A Neshati Pir Borj M Alizadeh Ghavidel A Cardiac hydatid cyst: A rare presentation of echinococcal infection J Cardiovasc Thorac Res 2019 11 75 77 31024677 10.15171/jcvtr.2019.13 PMC6477106 26 Martinese G Lucidi V Masi PD Adduci F Cappelli A Renzulli M De Paolis M Fiore M Golfieri R Bone echinococcosis with hip localization: A case report with evaluation of imaging features Radiol Case Rep 2022 17 3389 3394 35874867 10.1016/j.radcr.2022.06.065 PMC9305309 27 Versaci A Scuderi G Rosato A Angiò LG Oliva G Sfuncia G Saladino E Macrì A Rare localizations of echinococcosis: personal experience ANZ J Surg 2005 75 986 991 16336394 10.1111/j.1445-2197.2005.03588.x ",
  "metadata": {
    "Title of this paper": "Rare localizations of echinococcosis: personal experience",
    "Journal it was published in:": "World Journal of Nephrology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476775/"
  }
}