{
  "title": "Paper_1212",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472679 PMC12472679.1 12472679 12472679 41011179 10.3390/ph18091308 pharmaceuticals-18-01308 1 Article Phytochemical Profiling, Antioxidant Activity, and In Vitro Cytotoxic Potential of Mangrove Avicennia marina https://orcid.org/0000-0001-9461-0595 Cerri Federico Investigation Writing – original draft Writing – review & editing 1 2 † https://orcid.org/0009-0001-1503-7645 De Santes Beatrice Investigation Writing – original draft 1 3 † Spena Francesca Investigation Writing – original draft 1 3 † https://orcid.org/0000-0002-9385-5926 Salvioni Lucia Writing – review & editing Supervision 3 4 https://orcid.org/0000-0002-9706-4654 Forcella Matilde Writing – review & editing Supervision 3 https://orcid.org/0000-0002-2746-1742 Fusi Paola Resources Supervision 3 https://orcid.org/0000-0002-1381-042X Pagliari Stefania Investigation Writing – review & editing 3 * Stahl Henrik 5 https://orcid.org/0000-0002-6065-8192 Galli Paolo Conceptualization Resources Writing – review & editing Supervision Funding acquisition 1 2 https://orcid.org/0000-0003-3428-5668 Colombo Miriam Conceptualization Resources Writing – review & editing Supervision 3 4 https://orcid.org/0000-0002-9122-8515 Giustra Marco Writing – review & editing Supervision 3 4 * https://orcid.org/0000-0002-4729-2384 Campone Luca Conceptualization Resources Writing – review & editing Supervision 3 Zgórka Grażyna Academic Editor 1 federico.cerri@unimib.it b.desantes@campus.unimib.it f.spena2@campus.unimib.it paolo.galli@unimib.it 2 3 lucia.salvioni@unimib.it matilde.forcella@unimib.it paola.fusi@unimib.it miriam.colombo@unimib.it luca.campone@unimib.it 4 5 henrik.stahl@ukf.ac.ae * stefania.pagliari@unimib.it marco.giustra@unimib.it † These authors contribute equally to this work. 31 8 2025 9 2025 18 9 497460 1308 21 7 2025 21 8 2025 27 8 2025 31 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Avicennia marina A. marina Methods: Results: A. marina 50 Conclusions: A. marina mangroves Avicennia marina natural products bioactive compounds phytochemical analysis UPLC-HRMS antioxidant activity cytotoxicity triterpene saponins the European Union—NextGenerationEU PE0000003 This research was funded under the National Recovery and Resilience Plan (NRRP), Mission 4, Component 2 Investment 1.3—Call for tender No. 3138, 16 December 2021, rectified by Decree n. 341 of 15 March 2022 of the Italian Ministry of University and Research funded by the European Union—NextGenerationEU; Project code PE0000003 ON FOODS—CUP:H43C22000820001—Spoke 6, Project title “ON Foods—Research and innovation network on food and nutrition Sustainability, Safety and Security—Working ON Foods”. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Avicennia marina 1 1 2 3 The chemical profile of A. marina 3 4 5 6 7 8 Traditionally, A. marina 9 10 3 11 3 A. marina 12 A. marina 9 13 A. marina 14 15 10 11 16 17 18 Previous phytochemical studies on A. marina 9 10 11 A. marina 19 20 21 3 11 16 22 23 24 25 26 27 In addition to these methodological gaps, the limited geographical scope of previous studies represents a crucial limitation in fully understanding the phytochemical diversity and bioactivity of A. marina 28 29 30 31 32 33 34 35 36 37 38 39 It is plausible that A. marina 40 A. marina Unlike previous studies, this work employs UPLC-HRMS to present a detailed phytochemical profile of each tissue type, allowing for the identification of specific compounds of A. marina A. marina 3 11 2. Results 2.1. Characterization of Avicennia marina Extracts Roots, leaves, cotyledons, pericarps, and propagules of A. marina Supplementary Material (Figures S1–S5) Table 1 Section 4.4 Analysis detected a total of 49 compounds across all plant parts. Triterpene saponins are a heterogeneous secondary metabolite consisting of a terpene-based aglycone linked to one or more sugar chains, commonly glucose (−162 Da), glucuronic acid (−176 Da), and pentoses (−146 Da) [ 72 42 66 15 m z 66 67 69 70 71 Phenylethanoid glycosides are often based on β-D-glucosides of 2-phenylethanol, often with α-L-rhamnose (Rha) substitution at C-3′ of the glucose, resembling variants of verbascoside [ 73 m z m z 2 74 Flavonoid glycosides are a group of secondary metabolites that are widely distributed throughout the plant kingdom. Depending on the bond of the sugar portion, they are divided into O 75 Iridoid glycosides exhibit distinct fragmentation patterns that depend on the structure of the aglycone ring, the presence of functional groups, and the degree of unsaturation. Typically, a neutral loss of 162 Da is observed, corresponding to the breakage of the bond with the glucoside fraction. Subsequently, the formation of fragments due to the loss of water (18 Da) and the carboxyl group (44 Da) is also observed, together with characteristic fragments resulting from aglycone ring cleavage. Peak 3 with m z 16 22 10 m z m z 76 Tissue-specific profiling revealed clear metabolic differentiation among parts, with the leaves containing the highest number of secondary metabolites (26), followed by the pericarps (23), roots (23), cotyledons (10), and propagules (6). Notably distinct distribution patterns were observed for specific classes of compounds across the different A. marina Analysis confirmed several compounds previously reported in A. marina O O O 5 7 77 78 79 80 O A. marina 81 82 2.2. Antioxidant Activity 2.2.1. DPPH and ABTS Assays The antioxidant potential of A. marina Figure 1 The DPPH assay showed that the pericarp extract exhibited the highest radical scavenging activity, with a Trolox equivalent antioxidant capacity (TEAC) value of 187.14 ± 2.87 μmol TE/g. This was followed by the extracts of root (128.25 ± 1.12 μmol TE/g), cotyledon (58.23 ± 3.49 μmol TE/g), leaf (55.12 ± 1.52 μmol TE/g), and propagule (38.72 ± 6.96 μmol TE/g). Similarly, the ABTS assay confirmed that the root and pericarp extracts exhibit high antioxidant activity compared to the other parts of the plant. In fact, the pericarp extracts again displayed the highest TEAC value (217.16 ± 2.67 μmol TE/g), followed by the root (147.21 ± 2.42 μmol TE/g), leaf (64.98 ± 0.84 μmol TE/g), cotyledon (54.46 ± 1.95 μmol TE/g), and propagule (32.23 ± 2.53 μmol TE/g) extracts. 2.2.2. Correlation Between Compound Classes and Antioxidant Activity The pericarp and root extracts, which exhibited the highest antioxidant activity, are also the ones that contain a high number of phenylethanoid glycosides, compared to the other extracts, which may explain their higher activity. To explore the potential associations between the phytochemical composition of each extract and their antioxidant capacity, a Spearman correlation analysis was performed between the number of compounds in each major chemical class and the measured antioxidant activities (DPPH and ABTS assay) across the five plant-part extracts (n = 5) ( Table 2 p p p 2.3. In Vitro Cytotoxic Activity The cytotoxic effects of A. marina Figure 2 Figure 3 Figure 4 Table S1 Among the extracts, cotyledon, pericarp, and propagule generally exhibited the lowest cytotoxic activity, reducing cell viability by no more than 70% at the highest concentration (540 μg/mL) across all cell lines. The exception was the pericarp extract, which reduced viability of HeLa cells to 60.30%. The leaf extract showed low cytotoxicity at lower concentrations. At 60 μg/mL, cell viability remains near 80% for SW480, E705, and MDA-MB-231 and was 70.44% for HeLa. In the non-cancerous cell lines, viability was even higher: 88.59% and 86.86% for CCD 841 and MRC-5, respectively. However, at 540 μg/mL, the extract reduced viability to 50–60% in most cell lines, particularly 50.98% for SW480, 63.91% for E705, 53.00% for MDA-MB-231, 59.77% for U-87, 54.96% for HeLa, and 61.01% for CCD 841, while the least reduction occurred in MRC-5 (71.26%). Among all extracts, the root extract exhibited the highest cytotoxic activity. At 180 μg/mL, it reduced cell viability to 29.47% (SW480), 42.40% (E705), 35.26% (MDA-MB-231), 53.06% (U87), 52.00% (HeLa), 46.60% (CCD 841), and 60.15% (MRC-5). These reductions were statistically significant compared to all other extracts, except for E705, where differences with the leaf extract were not significant, and for HeLa. At 540 μg/mL, cytotoxicity remained similar across most lines, although viability dropped further in SW480 and E705 (22.93% and 27.03%, respectively). These findings highlight the notable activity of the root extract, particularly at the highest concentrations, against SW480, E705, and MDA-MB-231 cell lines ( Figure 5 Given this pronounced response, the analysis focused on dose–response effects in SW480, E705, and MDA-MB-231. Each cell line was treated with ten increasing concentrations of root extract (2 to 540 μg/mL; Figure S6 50 2.4. In Silico Analysis Given the strong cytotoxic activity observed for the A. marina 83 84 Table S2 in the Supplementary Materials Among the primary peaks detected in the root extract, the triterpene saponins medicoside G and azukisaponin III were found exclusively in the root extract, while esculentoside C was detected at high levels in the roots and in trace amounts in other extracts. These compounds showed high predicted probabilities (Pa) for antineoplastic activity (0.870, 0.905, and 0.908 for medicoside G, esculentoside C, and azukisaponin III, respectively), caspase 3/8 stimulation (0.994/0.984, 0.989/0.986, and 0.964/0.934), apoptosis agonism (0.901, 0.862, and 0.883), and NF-κB stimulation (0.965, 0.917, and 0.904). They were also predicted to inhibit ICAM-1 expression (0.908, 0.961, and 0.987) and lipid peroxidase activity (0.927, 0.952, and 0.991). Additional compounds found exclusively in the root extract, including I, suspensaside A, kaempferol 3-O-glucoside, and quercetin 3-O-hexoside, were also predicted to exhibit antineoplastic activity with Pa values of 0.804, 0.863, 0.834, and 0.833, respectively. Kaempferol 3-O-glucoside and quercetin 3-O-hexoside also showed cytostatic activity (Pa: 0.811 and 0.825), enhancement of TP53 expression (Pa: 0.952 and 0.959) and lipid peroxidase inhibition (0.960 and 0.976, resp.). 3. Discussion UHPLC-ESI/HRMS analyses enabled the characterization of A. marina 85 86 87 The compounds identified, including phenylethanoid glycosides, flavonoid glycosides, iridoid glycosides, hydroxycinnamic acid and derivatives, and triterpene saponins, are well known for their ecological roles in protecting plants from abiotic stressors such as drought, high salinity, intense sunlight, and elevated temperatures [ 33 34 35 36 38 A. marina 10 However, differences from previous studies were observed. Firstly, a distinctive feature of A. marina 10 8 A. marina 33 35 88 10 A. marina 36 38 89 A. marina 40 90 The identified metabolite classes are associated with various biological activities, including antioxidant, anticancer, antimicrobial, and anti-inflammatory [ 91 92 93 94 95 91 96 97 p 98 99 100 In terms of cytotoxic activity, the cotyledon, pericarp, and propagule extracts showed negligible effects on cancer cell lines, even at the highest concentrations. In contrast, the leaf and root extracts displayed cytotoxicity at higher doses. The leaf extract showed limited cytotoxicity at lower concentrations but reduced viability (50–60%) at 540 μg/mL in several cancer cell lines. This agrees with Momtazi-Borojeni et al. [ 101 102 50 50 103 104 105 Triterpene saponins are gaining attention in cancer research due to their ability to target tumor-related pathways while maintaining low toxicity [ 106 107 108 82 108 O Given that the root extract exhibited the highest cytotoxicity, further work will focus on bioactivity-guided fractionation of this extract, with particular emphasis on isolating the triterpene saponin-rich fraction. These purified fractions will be tested for cytotoxicity alongside a standard anticancer drug (e.g., doxorubicin) to identify the compounds responsible for the observed activity. Mechanistic studies, including apoptosis assays, cell cycle analysis, and molecular pathway investigations, will be conducted to elucidate the modes of action. Such comprehensive analyses, together with the targeted quantification of candidate constituents, will clarify structure–activity correlations and enhance both therapeutic efficacy and selectivity. Importantly, these efforts, combined with further purification and structural elucidation, could identify promising novel lead compounds suitable for subsequent in vivo evaluation and development as potential anticancer agents. 4. Materials and Methods 4.1. Chemicals Ethanol absolute, analytical-grade methanol, 1,1-diphenyl-2-picrylhydrazyl (DPPH • •+ 4.2. Plant Material Samples were collected from different parts of A. marina 109 A. marina 14 110 111 For more precise phytochemical characterization, propagules were separated into the pericarp, representing the external protective tissue, and the internal tissues. Thus, in the manuscript, the term pericarp (and pericarp extract) refers exclusively to the external part, while the generic term propagule (and propagule extract) refers to the internal tissues. Each type of plant material (e.g., all collected leaves, roots, pericarps, propagules, and cotyledons) was pooled by type and immediately freeze-dried after collection. The dried samples were homogenized using a Grindomix GM 200 knife mill (Retsch, Haan, Germany) and then sieved through a test sieve (Retsch AS 200, Haan, Germany) with a mesh size range of 300–600 μm to obtain powders with uniform particle size distribution. 4.3. Sample Preparation and Extraction Root, leaf, cotyledon, pericarp, and propagule samples of A. marina v v w v 112 113 114 115 116 To ensure complete extraction, the process was repeated three times with fresh solvent. Following each extraction, the mixtures were centrifuged (13,000× g The extraction yields of A. marina 4.4. Characterization of Extracts The chemical characterization of extracts was performed in negative mode using liquid chromatography coupled with electrospray ionization (ESI) and high-resolution mass spectrometry (UPLC-ESI/HRMS). A Waters ACQUITY UPLC system coupled with a Waters Xevo G2-XS QTof Mass Spectrometer (Waters Corp., Milford, MA, USA) was used. The extracts were dissolved in ultrapure water at a concentration of 100 μg/mL, and then 5 μL of each sample was injected into a Biphenyl column (100 mm × 2.1 mm, 2.6 μm; Phenomenex, Torrance, CA, USA). The chromatographic gradient was conducted with solvent A (0.1% formic acid in water) and solvent B (0.1% formic acid in methanol), starting with 95% A for 1 min, followed by a linear gradient to 95% B over 10 min, and 4 min of column washing at 95% B. The flow rate was maintained at 0.4 mL/min. The ESI source was operated under the following conditions: electrospray capillary voltage of 1.5 kV, source temperature of 140 °C, and desolvation temperature of 600 °C. MS spectra were acquired in full range mode, covering a mass range of 100–1000 m z Table 1 Novelty verification was performed using general literature databases (e.g., Google Scholar) and the chemical database SciFinder n n Avicennia marina Avicennia A. marina Avicennia 4.5. Determination of Antioxidant Activity The antioxidant capacities (AOCs) of the exhaustive extracts of A. marina • •+ 117 In the DPPH assay the stock solution of DPPH (5 mM) was prepared by dissolving 3.9 mg of DPPH in 100 mL of methanol and subsequently diluted to 100 μM to obtain the operating solution. This solution was prepared just before use and protected from light due to the photosensitivity of the reagent. The assay was set up in an Eppendorf by mixing 50 μL of sample with 950 μL of operative DPPH, and the mixture was incubated in the dark for 30 min. Subsequently, 200 μL of the solution was transferred to an absorbance reading plate at the 515 nm wavelength. For the ABTS assay, the stock solution of ABTS (7 mM) was diluted with phosphate-buffered saline (PBS; 5 mM, pH 7.4) to achieve working concentrations. The assay was performed by combining 5 μL of diluted sample (or PBS control) and 500 μL of ABTS radical cation solution (0.1 mM in PBS). The reaction mixtures were protected from light and incubated at 30 °C for 60 min to allow complete radical scavenging. Absorbance measurements were then recorded at 734 nm using a microplate reader. 4.6. Cytotoxicity Evaluation 4.6.1. Cell Lines and Culture Conditions Normal human fibroblasts (MRC-5), human glioblastoma (U-87), human triple-negative breast cancer (MDA-MB-231), human colorectal cancer (SW480), and human healthy mucosa (CCD841) cell lines were purchased from the American Type Culture Collection (Manassas, VA, USA). The human cervical cancer cell line (HeLa) was acquired from System Biosciences, and the human colon cancer cell line (E705) was provided by the Fondazione IRCCS Istituto Nazionale dei Tumori (Milan, Italy). The E705 cell line represents epithelial tissue cells of colorectal adenocarcinoma derived from a patient at the National Cancer Institute in Milan. MRC-5, U-87, and HeLa cells were cultured in Dulbecco’s Modified Eagle Medium (DMEM) high glucose medium supplemented with 10% heat-inactivated fetal bovine serum (FBS), 1% penicillin/streptomycin (P/S), and 2 mM L-glutamine. MDA-MB-231 cells were maintained in Minimum Essential Medium (MEM) with Earl’s Salts supplemented with 10% heat-inactivated FBS, 1% P/S, 2 mM L-glutamine, and 0.1 mM MEM Non-Essential Amino Acids (MEM NEAA). E705 and SW480 cell lines were cultured in RPMI 1640 medium supplemented with 10% heat-inactivated FBS, 100 U/mL penicillin, 100 μg/mL streptomycin, and 2 mM L-glutamine. The CCD 841 cell line was grown in EMEM medium supplemented with 10% heat-inactivated FBS, 1% P/S, 2 mM L-glutamine, and 0.1 mM non-essential amino acids. All cell lines were incubated at 37 °C in a humidified atmosphere containing 5% CO 2 4.6.2. Viability Assay The cytotoxicity of A. marina ® 50 50 No positive control drugs were included in this preliminary screening, as the primary objective was to assess and compare the relative cytotoxicity of different A. marina Briefly, HeLa, MRC-5, U-87, and MDA-MB-231 cells were seeded into 96-well plates (from Euroclone, Pero, Italy) at a density of 5 × 10 3 3 2 A. marina Cell viability was expressed as a percentage relative to untreated cells (negative control), and medium with MilliQ water at equivalent concentrations (10% v v 50 4.7. In Silico Prediction for Anticancer Activity To identify potential bioactive compounds responsible for the cytotoxic effect, an in silico prediction of biological activity was performed using PASS Online software ( https://www.way2drug.com/PASSOnline/index.php 118 119 120 The canonical Simplified Molecular Input Line Entry System (SMILES) of each compound was gathered from SciFinder n 121 118 The predicted anticancer-related activities included antineoplastic activity, apoptosis-related effects (apoptosis agonist, caspase 3/8 stimulation), TP53 expression enhancement, NF-kB modulation, cytostatic activity, lipid peroxidase inhibition, and ICAM-1 expression inhibition. These results were analyzed in relation to the cytotoxicity data of the MTT assay to establish potential correlations between the phytochemical composition and the observed cytotoxicity against cancer cells. 4.8. Statistical Analysis Statistical analyses were conducted on data generated from three replicates. Cytotoxic activity results are presented as mean ± standard error of the mean (SEM). Antioxidant activity results are reported as mean ± standard deviation (SD). Before statistical analysis, the assumption of normality was assessed using the Shapiro–Wilk test. The homogeneity of the variances was evaluated using Levene’s test. When normality and homogeneity assumptions were met, a one-way analysis of variance (ANOVA) was performed, followed by Tukey’s honest significant difference (HSD) post hoc test to assess pairwise differences between the means of the group. In cases where the assumption of homogeneity of the variances was not met, Welch’s ANOVA was applied, followed by the Games–Howell post hoc test. Statistical significance was considered when p The correlation between phytochemical composition and antioxidant activity was assessed using Spearman’s rank correlation coefficient (two-tailed). For each plant-part extract (n = 5), the number of tentatively identified compounds in each major chemical class (phenylethanoid glycosides, flavonoid glycosides, iridoid glycosides, hydroxycinnamic acids and derivatives, and triterpene saponins) was correlated with antioxidant activity (DPPH and ABTS, mean values). Statistical significance was set at p All analyses were conducted with IBM SPSS Statistics v29.0.2.0. 5. Conclusions The findings of this study highlight A. marina 50 The detection of triterpene saponins not previously reported from mangroves, together with several phenylethanoid glycosides and other compounds not earlier described in A. marina A. marina To advance these observations towards pharmacological relevance, future work should focus on bioactivity-guided fractionation of the extracts, structural elucidation, and targeted quantification of key compounds, along with mechanistic in vitro assays. These efforts will help clarify structure–activity correlations and potentially lead to the identification of a novel therapeutic candidate from this stress-adapted mangrove species. Acknowledgments The authors thank the National Biodiversity Future Center (NBFC), Palermo, Italy. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ph18091308/s1 A. marina Avicennia marina A. marina Author Contributions Conceptualization, P.G., M.C. and L.C.; investigation, F.C. (cell line experiment on SW480, E705, and CCD 841 and chemical investigation), B.D.S. (cell line experiment on U-87 and MRC-5), F.S. (cell line experiment on MDA-MB-231 and HeLa), S.P. (chemical analysis); resources, P.F., P.G., M.C. and L.C.; writing—original draft preparation, F.C., B.D.S. and F.S.; writing—review and editing, F.C., S.P., M.F., M.G., L.S., P.G., M.C., L.C.; supervision, H.S., M.F., P.F., M.G., L.S., P.G., M.C. and L.C.; funding acquisition, P.G. All authors have read and agreed to the published version of the manuscript. Data Availability Statement Data presented in this study is contained within the article and Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. References 1. Kathiresan K. Bingham B.L. Biology of Mangroves and Mangrove Ecosystems Adv. Mar. Biol. 2001 40 81 251 10.1016/s0065-2881(01)40003-4 2. Cerri F. Louis Y.D. Fallati L. Siena F. Mazumdar A. Nicolai R. Zitouni M.S. Adam A.S. Mohamed S. Lavorano S. Mangroves of the Maldives: A Review of Their Distribution, Diversity, Ecological Importance and Biodiversity of Associated Flora and Fauna Aquat. Sci. 2024 86 44 10.1007/s00027-024-01061-2 3. Cerri F. Giustra M. Anadol Y. Tomaino G. Galli P. Labra M. Campone L. Colombo M. Natural Products from Mangroves: An Overview of the Anticancer Potential of Avicennia marina Pharmaceutics 2022 14 2793 10.3390/pharmaceutics14122793 36559286 PMC9787599 4. Han L. Huang X. Dahse H.M. Moellmann U. Fu H. Grabley S. Sattler I. Lin W. Unusual Naphthoquinone Derivatives from the Twigs of Avicennia marina J. Nat. Prod. 2007 70 923 927 10.1021/np060587g 17500572 5. Sharaf M. El-Ansari M.A. Saleh N.A.M. New Flavonoids from Avicennia marina Fitoterapia 2000 71 274 277 10.1016/S0367-326X(99)00169-0 10844167 6. Feng Y. Li X.M. Duan X.J. Wang B.G. Iridoid Glucosides and Flavones from the Aerial Parts of Avicennia marina Chem. Biodivers. 2006 3 799 806 10.1002/cbdv.200690082 17193312 7. Sun Y. Ouyang J. Deng Z. Li Q. Lin W. Structure Elucidation of Five New Iridoid Glucosides from the Leaves of Avicennia marina Magn. Reson. Chem. 2008 46 638 642 10.1002/mrc.2224 18395881 8. Han L. Huang X. Dahse H.-M. Moellmann U. Grabley S. Lin W. Sattler I. New Abietane Diterpenoids from the Mangrove Avicennia marina Planta Med. 2008 74 432 437 10.1055/s-2008-1034318 18484538 9. Nabeelah Bibi S. Fawzi M.M. Gokhan Z. Rajesh J. Nadeem N. Rengasamy Kannan R.R. Albuquerque R.D.D.G. Pandian S.K. Ethnopharmacology, Phytochemistry, and Global Distribution of Mangroves—A Comprehensive Review Mar. Drugs 2019 17 231 10.3390/md17040231 31003533 PMC6520788 10. Zhou P. Hu H. Wu X. Feng Z. Li X. Tavakoli S. Wu K. Deng L. Luo H. Botany, traditional uses, phytochemistry, pharmacological activities, and toxicity of the mangrove plant Avicennia marina Phytochem. Rev. 2025 1 36 10.1007/s11101-025-10080-2 11. ElDohaji L.M. Hamoda A.M. Hamdy R. Soliman S.S. Avicennia marina J. Ethnopharmacol. 2020 263 113179 10.1016/j.jep.2020.113179 32768642 12. El-Tarabily K.A. Sham A. Elbadawi A.A. Hassan A.H. Alhosani B.K.K. El-Esawi M.A. AlKhajeh A.S. AbuQamar S.F. A Consortium of Rhizosphere-Competent Actinobacteria Exhibiting Multiple Plant Growth-Promoting Traits Improves the Growth of Avicennia marina Front. Mar. Sci. 2021 8 715123 10.3389/fmars.2021.715123 13. Department of Health—Abu Dhabi Encyclopedia of Medicine Plant of UAE Available online: https://www.medicinalplants.doh.gov.ae/Encyclopedia-of-medicine-plant-of-UAE (accessed on 12 August 2025) 14. Friis G. Killilea M.E. Mangrove Ecosystems of the United Arab Emirates A Natural History of the Emirates Burt J.A. Springer Cham, Switzerland 2023 217 240 15. Haseeba K.P. Aboobacker V.M. Vethamony P. Al-Khayat J.A. Significance of Avicennia Marina Wetlands 2025 45 16 10.1007/s13157-025-01899-8 40220548 16. Mitra S. Naskar N. Lahiri S. Chaudhuri P. A study on phytochemical profiling of Avicennia marina Sustain. Chem. Environ. 2023 4 100041 10.1016/j.scenv.2023.100041 17. Khattab R.A. Temraz T.A. Mangrove Avicennia marina Egypt. J. Aquat. Biol. Fish. 2017 21 45 54 10.21608/ejabf.2017.4003 18. Al-Mur B.A. Biological activities of Avicennia marina Arab. J. Sci. Eng. 2021 46 5407 5419 10.1007/s13369-020-05272-1 19. Mohammed H.A. Phytochemical Analysis, Antioxidant Potential, and Cytotoxicity Evaluation of Traditionally Used Artemisia Absinthium Plants 2022 11 1028 10.3390/plants11081028 35448756 PMC9029736 20. Alzandi A.A. Taher E.A. Al-Sagheer N.A. Al-Khulaidi A.W. Azizi M. Naguib D.M. Phytochemical components, antioxidant and anticancer activity of 18 major medicinal plants in Albaha region, Saudi Arabia Biocatal. Agric. Biotechnol. 2021 34 102020 10.1016/j.bcab.2021.102020 21. Youssef A.M.M. Maaty D.A.M. Al-Saraireh Y.M. Phytochemistry and Anticancer Effects of Mangrove ( Rhizophora mucronata Pharmaceuticals 2022 16 4 10.3390/ph16010004 36678500 PMC9865503 22. Botosoa E.P. Shahidi F. Phenolics and polyphenolics in mangrove plants: Antioxidant activity and recent trends in food application—A review Crit. Rev. Food Sci. Nutr. 2025 1 35 10.1080/10408398.2025.2525449 40671460 23. Wang Y. Xing L. Zhang J. Chen Y. Lu S. Simultaneous Determination of 32 Polyphenolic Compounds in Berries via HPLC–MS/MS Molecules 2025 30 2008 10.3390/molecules30092008 40363812 PMC12073267 24. Kodikara C. Netticadan T. Bandara N. Wijekoon C. Sura S. A new UHPLC-HRMS metabolomics approach for the rapid and comprehensive analysis of phenolic compounds in blueberry, raspberry, blackberry, cranberry and cherry fruits Food Chem. 2024 445 138778 10.1016/j.foodchem.2024.138778 38394909 25. Singh A. Choudhary K.K. Utilizing UHPLC-HRMS-metabolomic profiling to uncover enhanced bioactive potential and health benefits in chili ( Capsicum annum Food Chem. 2025 483 144255 10.1016/j.foodchem.2025.144255 40220443 26. Lee I.Y. Lee D.H. Park J.H. Joo N. UHPLC-HRMS/MS–Based Metabolic Profiling and Quantification of Phytochemicals in Different Parts of Coccinia grandis Food Sci. Nutr. 2025 13 e70004 10.1002/fsn3.70004 39931272 PMC11808390 27. Zanatta A.C. Vilegas W. Edrada-Ebel R. UHPLC-(ESI)-HRMS and NMR-Based Metabolomics Approach to Access the Seasonality of Byrsonima intermedia Serjania marginata Front. Chem. 2021 9 534 10.3389/fchem.2021.710025 PMC8290060 34295876 28. Mateos-Molina D. Ben Lamine E. Antonopoulou M. Burt J.A. Das H.S. Javed S. Judas J. Khan S.B. Muzaffar S.B. Pilcher N. Synthesis and Evaluation of Coastal and Marine Biodiversity Spatial Information in the United Arab Emirates for Ecosystem-Based Management Mar. Pollut. Bull. 2021 167 112319 10.1016/j.marpolbul.2021.112319 33845352 29. United Arab Emirates—Climatology | Climate Change Knowledge Portal Available online: https://climateknowledgeportal.worldbank.org/country/united-arab-emirates/climate-data-historical#cckp-watershed-map (accessed on 1 April 2025) 30. Jin J. Koroleva O.A. Gibson T. Swanston J. Maganj J. Zhang Y.A.N. Rowland I.R. Wagstaff C. Analysis of Phytochemical Composition and Chemoprotective Capacity of Rocket (Eruca Sativa and Diplotaxis Tenuifolia) Leafy Salad Following Cultivation in Different Environments J. Agric. Food Chem. 2009 57 5227 5234 10.1021/jf9002973 19489541 31. Abd-Elgawad A.M. Elshamy A.I. Al-Rowaily S.L. El-Amier Y.A. Habitat Affects the Chemical Profile, Allelopathy, and Antioxidant Properties of Essential Oils and Phenolic Enriched Extracts of the Invasive Plant Heliotropium curassavicum Plants 2019 8 482 10.3390/plants8110482 31703432 PMC6918439 32. Rozirwan Nugroho R.Y. Hendri M. Fauziyah Putri W.A.E. Agussalim A. Phytochemical Profile and Toxicity of Extracts from the Leaf of Avicennia marina S. Afr. J. Bot. 2022 150 903 919 10.1016/j.sajb.2022.08.037 33. Neugart S. Krumbein A. Zrenner R. Influence of Light and Temperature on Gene Expression Leading to Accumulation of Specific Flavonol Glycosides and Hydroxycinnamic Acid Derivatives in Kale ( Brassica oleracea Front. Plant Sci. 2016 7 181383 10.3389/fpls.2016.00326 27066016 PMC4812050 34. Wang D.H. Du F. Liu H.Y. Liang Z.S. Drought stress increases iridoid glycosides biosynthesis in the roots of Scrophularia ningpoensis J. Med. Plants 2010 4 2691 2699 10.5897/JMPR09.338 35. Ferdinando M.D. Brunetti C. Fini A. Tattini M. Flavonoids as antioxidants in plants under abiotic stresses Abiotic Stress Responses in Plants: Metabolism, Productivity and Sustainability Ahmad P. Prasad M.N.V. Springer Berlin/Heidelberg, Germany 2012 36. Falahi H. Sharifi M. Maivan H.Z. Chashmi N.A. Phenylethanoid Glycosides Accumulation in Roots of Scrophularia Striata Environ. Exp. Bot. 2018 147 13 21 10.1016/j.envexpbot.2017.11.003 37. Franzoni G. Trivellini A. Bulgari R. Cocetta G. Ferrante A. Bioactive molecules as regulatory signals in plant responses to abiotic stresses Plant Signaling Molecules Khan M.I.R. Reddy P.S. Ferrante A. Khan N. Woodhead Publishing Duxford, UK 2019 Volume 1 169 182 38. Sarri E. Termentzi A. Abraham E.M. Papadopoulos G.K. Baira E. Machera K. Loukas V. Komaitis F. Tani E. Salinity Stress Alters the Secondary Metabolic Profile of M. sativa M. arborea Int. J. Mol. Sci. 2021 22 4882 10.3390/ijms22094882 34063053 PMC8124458 39. Toscano S. Trivellini A. Cocetta G. Bulgari R. Francini A. Romano D. Ferrante A. Effect of preharvest abiotic stresses on the accumulation of bioactive compounds in horticultural produce Front. Plant Sci. 2019 10 1212 10.3389/fpls.2019.01212 31636647 PMC6788460 40. Das S.K. Patra J.K. Thatoi H. Antioxidative response to abiotic and biotic stresses in mangrove plants: A review Int. Rev. Hydrobiol. 2015 101 3 19 10.1002/iroh.201401744 41. Galasso S. Pacifico S. Kretschmer N. Pan S.P. Marciano S. Piccolella S. Monaco P. Bauer R. Influence of Seasonal Variation on Thymus longicaulis Phytochemistry 2014 107 80 90 10.1016/j.phytochem.2014.08.015 25239551 42. Fiori J. Amadesi E. Fanelli F. Tropeano C.V. Rugolo M. Gotti R. Cellular and Mitochondrial Determination of Low Molecular Mass Organic Acids by LC–MS/MS J. Pharm. Biomed. Anal. 2018 150 33 38 10.1016/j.jpba.2017.11.071 29216582 43. Wang D.-D. Liang J. Yang W.-Z. Hou J.j. Yang M. Da J. Wang Y. Jiang B.h. Liu X. Wu W.y. HPLC/QTOF-MS-Oriented Characteristic Components Data Set and Chemometric Analysis for the Holistic Quality Control of Complex TCM Preparations: Niuhuang Shangqing Pill as an Example J. Pharm. Biomed. Anal. 2014 89 130 141 10.1016/j.jpba.2013.10.042 24284229 44. Seo O.N. Kim G.S. Park S. Lee J.H. Kim Y.H. Lee W.S. Lee S.J. Kim C.Y. Jin J.S. Choi S.K. Determination of Polyphenol Components of Lonicera japonica Food Chem. 2012 134 572 577 10.1016/j.foodchem.2012.02.124 45. Amessis-Ouchemoukh N. Abu-Reidah I.M. Quirantes-Piné R. Rodríguez-Pérez C. Madani K. Fernández-Gutiérrez A. Segura-Carretero A. Tentative Characterisation of Iridoids, Phenylethanoid Glycosides and Flavonoid Derivatives from Globularia alypum Phytochem. Analy 2014 25 389 398 10.1002/pca.2506 24677200 46. Xie G. Xu Q. Li R. Shi L. Han Y. Zhu Y. Wu G. Qin M. Chemical Profiles and Quality Evaluation of Buddleja officinalis J. Pharm. Biomed. Anal. 2019 164 283 295 10.1016/j.jpba.2018.10.030 30412801 47. Kiss A.K. Michalak B. Patyra A. Majdan M. UHPLC-DAD-ESI-MS/MS and HPTLC Profiling of Ash Leaf Samples from Different Commercial and Natural Sources and Their in Vitro Effects on Mediators of Inflammation Phytochem. Anal. 2020 31 57 67 10.1002/pca.2866 31286597 48. García-Villegas A. Fernández-Ochoa Á. Alañón M.E. Rojas-García A. Arráez-Román D. De La Luz Cádiz-Gurrea M. Segura-Carretero A. Bioactive Compounds and Potential Health Benefits through Cosmetic Applications of Cherry Stem Extract Mar. Drugs 2024 25 3723 10.3390/ijms25073723 38612532 PMC11011441 49. Han J. Ye M. Guo H. Yang M. Wang B.-R. Guo D.-A. Analysis of Multiple Constituents in a Chinese Herbal Preparation Shuang-Huang-Lian Oral Liquid by HPLC-DAD-ESI-MSn J. Pharm. Biomed. Anal. 2007 44 430 438 10.1016/j.jpba.2007.02.023 17391890 50. Zhou F. Peng J. Zhao Y. Huang W. Jiang Y. Li M. Wu X. Lu B. Varietal Classification and Antioxidant Activity Prediction of Osmanthus fragrans Food Chem. 2017 217 490 497 10.1016/j.foodchem.2016.08.125 27664663 51. Zhang Y.-D. Huang X. Zhao F.L. Tang Y.L. Yin L. Study on the Chemical Markers of Caulis Lonicerae japonicae Anal. Methods 2015 7 2064 2076 10.1039/C4AY02744B 52. Petreska J. Stefova M. Ferreres F. Moreno D.A. Tomás-Barberán F.A. Stefkov G. Kulevanova S. Gil-Izquierdo A. Potential Bioactive Phenolics of Macedonian sideritis Food Chem. 2011 125 13 20 10.1016/j.foodchem.2010.08.019 53. Hvattum E. Determination of Phenolic Compounds in Rose Hip ( Rosa canina Rapid Commun. Mass Spectrom. 2002 16 655 662 10.1002/rcm.622 11921243 54. Kammerer D. Carle R. Schieber A. Characterization of Phenolic Acids in Black Carrots ( Daucus carota sativus atrorubens Rapid Commun. Mass Spectrom. 2004 18 1331 1340 10.1002/rcm.1496 15174188 55. Gu D. Yang Y. Bakri M. Chen Q. Xin X. Aisa H.A. A LC/QTOF–MS/MS Application to Investigate Chemical Compositions in a Fraction with Protein Tyrosine Phosphatase 1B Inhibitory Activity from Rosa rugosa Phytochem. Anal. 2013 24 661 670 10.1002/pca.2451 23813906 56. Innocenti M. La Marca G. Malvagia S. Giaccherini C. Vincieri F.F. Mulinacci N. Electrospray Ionisation Tandem Mass Spectrometric Investigation of Phenylpropanoids and Secoiridoids from Solid Olive Residue Rapid Commun. Mass Spectrom. 2006 20 2013 2022 10.1002/rcm.2556 16755600 57. Matos P. Figueirinha A. Paranhos A. Nunes F. Cruz P. Geraldes C.F.G.C. Cruz M.T. Batista M.T. Bioactivity of Acanthus Mollis J. Ethnopharmacol. 2018 227 198 205 10.1016/j.jep.2018.09.013 30201231 58. Seeram N.P. Lee R. Scheuller H.S. Heber D. Identification of Phenolic Compounds in Strawberries by Liquid Chromatography Electrospray Ionization Mass Spectroscopy Food Chem. 2006 97 1 11 10.1016/j.foodchem.2005.02.047 59. Zhang Y. Shi P. Qu H. Cheng Y. Characterization of Phenolic Compounds in Erigeron breviscapus Rapid Commun. Mass Spectrom. 2007 21 2971 2984 10.1002/rcm.3166 17703480 60. Zhang Y. Liu C. Zhang Z. Wang J. Wu G. Li S. Comprehensive Separation and Identification of Chemical Constituents from Apocynum venetum J. Chromatogr. B 2010 878 3149 3155 10.1016/j.jchromb.2010.09.027 20965796 61. Nijat D. Abdulla R. Liu G.-Y. Luo Y.-Q. Aisa H.A. Identification and Quantification of Meiguihua Oral Solution Using Liquid Chromatography Combined with Hybrid Quadrupole-Orbitrap and Triple Quadrupole Mass Spectrometers J. Chromatogr. B 2020 1139 121992 10.1016/j.jchromb.2020.121992 31991318 62. Parejo I. Jauregui O. Sánchez-Rabaneda F. Viladomat F. Bastida J. Codina C. Separation and Characterization of Phenolic Compounds in Fennel ( Foeniculum vulgare J. Agric. Food Chem. 2004 52 3679 3687 10.1021/jf030813h 15186082 63. Ibrahim R.M. Fayez S. Eltanany B.M. Abu-Elghait M. El-Demerdash A. Badawy M.S.E.M. Pont L. Benavente F. Saber F.R. Agro-Byproduct Valorization of Radish and Turnip Leaves and Roots as New Sources of Antibacterial and Antivirulence Agents through Metabolomics and Molecular Networking Sci. Hortic. 2024 328 112924 10.1016/j.scienta.2024.112924 64. Wang Z. Yao M. Ouyang H. He M. Zhao W. Wei W. Cui Y. Yang S. Zhong G. Feng Y. Characterization of Chemical Constituents and Metabolites in Rat Plasma after Oral Administration of Ainsliaea fragrans J. Chromatogr. B 2024 1244 124259 10.1016/j.jchromb.2024.124259 39089065 65. Lei H. Xin J. Lv Y. Chen W. Xu X. Wang J. Tian S. Xie B. Shen Y. Zu X. Effects of Processing on the Efficacy and Metabolites of Cistanche tubulosa Biomed. Chromatogr. 2023 37 e5621 10.1002/bmc.5621 36895149 66. Schliemann W. Ammer C. Strack D. Metabolite Profiling of Mycorrhizal Roots of Medicago truncatula Phytochemistry 2008 69 112 146 10.1016/j.phytochem.2007.06.032 17706732 67. Huhman D.V. Sumner L.W. Metabolic Profiling of Saponins in Medicago Sativa Medicago Truncatula Phytochemistry 2002 59 347 360 10.1016/S0031-9422(01)00432-0 11830145 68. Zhao D. Chen X. Wang R. Pang H. Wang J. Liu L. Determining the Chemical Profile of Caragana jubata J. Ethnopharmacol. 2023 309 116275 10.1016/j.jep.2023.116275 36806344 69. Saleri F.D. Chen G. Li X. Guo M. Comparative Analysis of Saponins from Different Phytolaccaceae Molecules 2017 22 1077 10.3390/molecules22071077 28661449 PMC6152185 70. Tavares-Silva C. Holandino C. Homsani F. Luiz R.R. Prodestino J. Farah A. Lima J.d.P. Simas R.C. Castilho C.V.V. Leitão S.G. Homeopathic Medicine of Melissa officinalis Phytolacca decandra Phytomedicine 2019 58 152869 10.1016/j.phymed.2019.152869 30831467 71. Liu R. Cai Z. Xu B. Characterization and Quantification of Flavonoids and Saponins in Adzuki Bean ( Vigna angularis Chem. Cent. J. 2017 11 93 10.1186/s13065-017-0317-x 29086903 PMC5610137 72. Pham H.N. Tran C.A. Trinh T.D. Nguyen Thi N.L. Tran Phan H.N. Le V.N. Le N.H. Phung V.T. UHPLC-Q-TOF-MS/MS Dereplication to Identify Chemical Constituents of Hedera Helix Leaves in Vietnam J. Anal. Methods Chem. 2022 8 1167265 10.1155/2022/1167265 PMC9377918 35979140 73. Kite G.C. Characterization of phenylethanoid glycosides by multiple-stage mass spectrometry Rapid Commun. Mass Spectrom. 2020 34 e8563 10.1002/rcm.8563 31465586 74. Qi M. Xiong A. Geng F. Yang L. Wang Z. A Novel Strategy for Target Profiling Analysis of Bioactive Phenylethanoid Glycosides in Plantago J. Sep. Sci. 2012 35 1470 1478 10.1002/jssc.201200010 22740256 75. Pagliari S. Sicari M. Pansera L. Guidi Nissim W. Mhalhel K. Rastegar S. Germanà A. Cicero N. Labra M. Cannavacciuolo C. A comparative metabolomic investigation of different sections of Sicilian Citrus x limon J. Food Sci. 2024 89 3729 3744 10.1111/1750-3841.17079 38709878 76. Fu Z. Xue R. Li Z. Chen M. Sun Z. Hu Y. Huang C. Fragmentation patterns study of iridoid glycosides in Fructus Gardeniae by HPLC-Q/TOF-MS/MS Biomed. Chromatogr. 2014 28 1795 1807 10.1002/bmc.3223 24782425 77. Mohamed A.S. Elmi A. Spina R. Kordofani M.A.Y. Laurain-Mattar D. Nour H. Abchir O. Chtita S. In Vitro and In Silico Analysis for Elucidation of Antioxidant Potential of Djiboutian Avicennia marina J. Biomol. Struct. Dyn. 2024 42 3410 3425 10.1080/07391102.2023.2213338 37194334 78. Zhang Y.C. Zhuang L.H. Zhou J.J. Song S.W. Li J. Huang H.Z. Chi B.J. Zhong Y.H. Liu J.W. Zheng H.L. Combined Metabolome and Transcriptome Analysis Reveals a Critical Role of Lignin Biosynthesis and Lignification in Stem-like Pneumatophore Development of the Mangrove Avicennia marina Planta 2024 259 12 10.1007/s00425-023-04291-0 38057597 79. Sun Y. Ding Y. Lin W.H. Isolation and Identification of Compounds from Marine Mangrove Plant Avicennia marina Beijing Da Xue Xue Bao Yi Xue Ban J. Peking Univ. Health Sci. 2009 41 221 225 19377635 80. Kartikaningsih H. Djamaludin H. Fauziyah J.N. Audina N. Noviyanti L. Saputra D. Green extraction of Avicennia marina Rasayan J. Chem. 1123 17 1123 1133 10.31788/RJC.2024.1738923 81. Wu J. Huang J. Xiao Q. Zhang S. Xiao Z. Li Q. Long L. Huang L. Complete Assignments of 1H and 13C NMR Data for 10 Phenylethanoid Glycosides Magn. Reson. Chem. 2004 42 659 662 10.1002/mrc.1393 15181637 82. Vinh L.B. Nguyet N.T.M. Yang S.Y. Kim J.H. Van Thanh N. Cuong N.X. Nam N.H. Van Minh C. Hwang I. Kim Y.H. Cytotoxic Triterpene Saponins from the Mangrove Aegiceras corniculatum Nat. Prod. Res. 2019 33 628 634 10.1080/14786419.2017.1402320 29143535 83. Clemente S.M. Martínez-Costa O.H. Monsalve M. Samhan-Arias A.K. Targeting Lipid Peroxidation for Cancer Treatment Molecules 2020 25 5144 10.3390/molecules25215144 33167334 PMC7663840 84. Kang J.H. Uddin N. Kim S. Zhao Y. Yoo K.C. Kim M.J. Hong S.A. Bae S. Lee J.Y. Shin I. Tumor-Intrinsic Role of ICAM-1 in Driving Metastatic Progression of Triple-Negative Breast Cancer through Direct Interaction with EGFR Mol. Cancer 2024 23 230 10.1186/s12943-024-02150-4 39415210 PMC11481280 85. Tomlinson P. The Botany of Mangroves Cambridge University Press Cambridge, UK 2016 1-316-79065-7 86. Rosental L. Nonogaki H. Fait A. Activation and Regulation of Primary Metabolism during Seed Germination Seed Sci. Res. 2014 24 1 15 10.1017/S0960258513000391 87. Sharif Y. Chen H. Deng Y. Ali N. Khan S.A. Zhang C. Xie W. Chen K. Cai T. Yang Q. Cloning and Functional Characterization of a Pericarp Abundant Expression Promoter (AhGLP17-1P) From Peanut ( Arachis hypogaea Front. Genet. 2022 12 821281 10.3389/fgene.2021.821281 35126474 PMC8811503 88. Zietz M. Weckmuller A. Schmidt S. Rohn S. Schreiner M. Krumbein A. Kroh L.W. Genotypic and climatic influence on the antioxidant activity of flavonoids in kale ( Brassica oleracea sabellica J. Agric. Food Chem. 2010 58 2123 2130 10.1021/jf9033909 20095605 89. Wu J.Y. Wong K. Ho K.P. Zhou L.G. Enhancement of saponin production in Panax ginseng Enzym. Microb. Technol. 2005 36 133 138 10.1016/j.enzmictec.2004.07.010 90. Oku 2003Oku H. Baba S. Koga H. Takara K. Iwasaki H. Lipid composition of mangrove and its relevance to salt tolerance J. Plant Res. 2003 116 37 45 10.1007/s10265-002-0069-z 12605298 91. Xue Z. Yang B. Phenylethanoid Glycosides: Research Advances in Their Phytochemistry, Pharmacological Activity and Pharmacokinetics Molecules 2016 21 991 10.3390/molecules21080991 27483229 PMC6273160 92. Sova M. Saso L. Natural Sources, Pharmacokinetics, Biological Activities and Health Benefits of Hydroxycinnamic Acids and Their Metabolites Nutrients 2020 12 2190 10.3390/nu12082190 32717940 PMC7468728 93. Yang B. Liu H. Yang J. Gupta V.K. Jiang Y. New Insights on Bioactivities and Biosynthesis of Flavonoid Glycosides Trends Food Sci. Technol. 2018 79 116 124 10.1016/j.tifs.2018.07.006 94. Wang C. Gong X. Bo A. Zhang L. Zhang M. Zang E. Zhang C. Li M. Iridoids: Research Advances in Their Phytochemistry, Biological Activities, and Pharmacokinetics Molecules 2020 25 287 10.3390/molecules25020287 31936853 PMC7024201 95. Sparg S.G. Light M.E. Van Staden J. Biological Activities and Distribution of Plant Saponins J. Ethnopharmacol. 2004 94 219 243 10.1016/j.jep.2004.05.016 15325725 96. De Marino S. Festa C. Zollo F. Incollingo F. Raimo G. Evangelista G. Iorizzi M. Antioxidant activity of phenolic and phenylethanoid glycosides from Teucrium polium Food Chem. 2012 133 21 28 10.1016/j.foodchem.2011.12.054 97. Budzianowska A. Kikowska M. Budzianowski J. Phenylethanoid glycosides accumulation and antiradical activity of fractionated extracts of Plantago ovata Plant Cell Tissue Organ Cult. 2024 156 54 10.1007/s11240-023-02635-y 98. Lu S.-H. Zuo H.-J. Huang J. Li W.-N. Huang J.-L. Li X.-X. Chemical constituents from the leaves of Ligustrum robustum Molecules 2023 28 362 10.3390/molecules28217274 36615556 PMC9822135 99. Ji S.L. Cao K.K. Zhao X.X. Kang N.X. Zhang Y. Xu Q.M. Yang S.L. Liu Y.L. Wang C. Antioxidant activity of phenylethanoid glycosides on glutamate-induced neurotoxicity Biosci. Biotechnol. Biochem. 2019 83 2016 2026 10.1080/09168451.2019.1637243 31272310 100. Wei W. Lan X.B. Liu N. Yang J.M. Du J. Ma L. Zhang W.J. Niu J.G. Sun T. Yu J.Q. Echinacoside Alleviates Hypoxic-Ischemic Brain Injury in Neonatal Rat by Enhancing Antioxidant Capacity and Inhibiting Apoptosis Neurochem. Res. 2019 44 1582 1592 10.1007/s11064-019-02782-9 30911982 101. Momtazi-Borojeni A.A. Behbahani M. Sadeghi-Aliabadi H. Antiproliferative Activity and Apoptosis Induction of Crude Extract and Fractions of Avicennia marina Iran. J. Basic Med. Sci. 2013 16 1203 24494074 PMC3909633 102. Tanjung I.B. Azizah N.N. Arsianti A. Anisa A.S. Audah K.A. Evaluation of the Ethyl Acetate Extract of the Roots of Avicennia marina Proceedings of the 6th International Conference of Food, Agriculture, and Natural Resource (IC-FANRES 2021) Tangerang, Indonesia 4–5 August 2021 Atlantis Press Dordrecht, The Netherlands 2022 Volume 16 75 81 10.2991/absr.k.220101.011 103. Geran R.I. Greenberg N.H. McDonald M.M. Protocols for Screening Chemical Agents and Natural Products against Animal Tumors and Other Biological Systems Cancer Chemother. Rep. 1972 3 1 103 104. Niksic H. Becic F. Koric E. Gusic I. Omeragic E. Muratovic S. Miladinovic B. Duric K. Cytotoxicity screening of Thymus vulgaris Sci. Rep. 2021 11 13178 10.1038/s41598-021-92679-x 34162964 PMC8222331 105. Addy B.S. Firempong C.K. Komlaga G. Addo-Fordjour P. Domfeh S.A. Afolayan O. Emikpe B.O. In vitro antiproliferative activities of some Ghanaian medicinal plants Clin. Phytosci 2024 10 19 10.1186/s40816-024-00383-w 106. Du J.R. Long F.Y. Chen C. Research Progress on Natural Triterpenoid Saponins in the Chemoprevention and Chemotherapy of Cancer Enzymes 2014 36 95 130 10.1016/b978-0-12-802215-3.00006-9 27102701 107. da Silva Magedans Y.V. Phillips M.A. Fett-Neto A.G. Production of Plant Bioactive Triterpenoid Saponins: From Metabolites to Genes and Back Phytochem. Rev. 2020 20 461 482 10.1007/s11101-020-09722-4 108. Yang X.W. Dai Z. Wang B. Liu Y.P. Zhao X.D. Luo X.D. Antitumor Triterpenoid Saponin from the Fruits of Avicennia marina Nat. Prod. Bioprospect 2018 8 347 353 10.1007/s13659-018-0167-9 29802619 PMC6109444 109. Duke N.C. A Systematic Revision of the Mangrove Genus Avicennia Aust. Syst. Bot. 1991 4 299 324 10.1071/SB9910299 110. Friis G. Vizueta J. Smith E.G. Nelson D.R. Khraiwesh B. Qudeimat E. Salehi-Ashtiani K. Ortega A. Marshell A. Duarte C.M. A high-quality genome assembly and annotation of the gray mangrove, Avicennia marina G3 Genes Genomes Genet. 2021 11 jkaa025 10.1093/g3journal/jkaa025 PMC8022769 33561229 111. Friis G. Smith E.G. Lovelock C.E. Ortega A. Marshell A. Duarte C.M. Burt J.A. Rapid diversification of grey mangroves ( Avicennia marina Mol. Ecol. 2024 33 e17260 10.1111/mec.17260 38197286 112. Che Sulaiman I.S. Basri M. Fard Masoumi H.R. Chee W.J. Ashari S.E. Ismail M. Effects of Temperature, Time, and Solvent Ratio on the Extraction of Phenolic Compounds and the Anti-Radical Activity of Clinacanthus nutans Chem. Cent. J. 2017 11 54 10.1186/s13065-017-0285-1 29086900 PMC5471285 113. Lim K.J.A. Cabajar A.A. Lobarbio C.F.Y. Taboada E.B. Lacks D.J. Extraction of Bioactive Compounds from Mango ( Mangifera indica Carabao J. Food Sci. Technol. 2019 56 2536 2544 10.1007/s13197-019-03732-7 31168135 PMC6525705 114. Plaskova A. Mlcek J. New Insights of the Application of Water or Ethanol-Water Plant Extract Rich in Active Compounds in Food Front. Nutr. 2023 10 1118761 10.3389/fnut.2023.1118761 37057062 PMC10086256 115. Huamán-Castilla N.L. Díaz Huamaní K.S. Palomino Villegas Y.C. Allcca-Alca E.E. León-Calvo N.C. Colque Ayma E.J. Zirena Vilca F. Mariotti-Celis M.S. Exploring a Sustainable Process for Polyphenol Extraction from Olive Leaves Foods 2024 13 265 10.3390/foods13020265 38254566 PMC10814471 116. Palaiogiannis D. Chatzimitakos T. Athanasiadis V. Bozinou E. Makris D.P. Lalas S.I. Successive Solvent Extraction of Polyphenols and Flavonoids from Cistus creticus Oxygen 2023 3 274 286 10.3390/oxygen3030018 117. Cannavacciuolo C. Pagliari S. Giustra C.M. Carabetta S. Guidi Nissim W. Russo M. Branduardi P. Labra M. Campone L. LC-MS and GC-MS Data Fusion Metabolomics Profiling Coupled with Multivariate Analysis for the Discrimination of Different Parts of Faustrime Fruit and Evaluation of Their Antioxidant Activity Antioxidants 2023 12 565 10.3390/antiox12030565 36978813 PMC10045819 118. Verbanac D. Jain S.C. Jain N. Chand M. Paljetak H.C. Matijašic M. Peric M. Stepanic V. Saso L. An efficient and convenient microwave-assisted chemical synthesis of (thio)xanthones with additional in vitro and in silico characterization Bioorg. Med. Chem. 2012 20 3180 3185 10.1016/j.bmc.2012.03.074 22537683 119. Filimonov D.A. Lagunin A.A. Gloriozova T.A. Rudik A.V. Druzhilovskii D.S. Pogodin P.V. Poroikov V.V. Prediction of the Biological Activity Spectra of Organic Compounds Using the PASS Online Web Resource Chem. Heterocycl. Compd. 2014 50 444 457 10.1007/s10593-014-1496-1 120. Desai T.H. Joshi S.V. In Silico Evaluation of Apoptogenic Potential and Toxicological Profile of Triterpenoids Indian J. Pharmacol. 2019 51 181 207 10.4103/ijp.IJP_90_18 31391686 PMC6644186 121. Lagunin A. Stepanchikova A. Filimonov D. Poroikov V. PASS: Prediction of Activity Spectra for Biologically Active Substances Bioinformatics 2000 16 747 748 10.1093/bioinformatics/16.8.747 11099264 Figure 1 DPPH ( a b A. marina p Figure 2 Cell viability (%) of SW480 ( a b A. marina p Figure 3 Cell viability (%) of MDA-MB-231 ( a b c A. marina p Figure 4 Cell viability (%) of CCD 841 ( a b A. marina p Figure 5 Cell viability (%) of the cancer cell lines treated with A. marina p pharmaceuticals-18-01308-t001_Table 1 Table 1 UHPLC-ESI/HRMS data of compounds detected in Avicennia marina No. RT (min) [M − H] − Formula Δ ppm MS/MS Name Class Part IL Ref. 1 0.58 701.1893 − C 24 42 21 −2.1677 665.2134, 485.1499, 443.1393, 383.1182 Stachyose Tetrasaccharides Cotyledons/pericarps/propagules/roots IL2 [ 41 2 0.99 191.0188 C 6 8 7 6.3850 111.0073 Citric acid Tricarboxylic acids Cotyledons/pericarps IL2 [ 42 3 3.87 373.1139 C 16 22 10 0.3221 211.0605, 167.0700, 149.0597, 123.0440 Geniposidic acid Iridoid glycosides Leaves/cotyledons/pericarps/propagules/roots IL2 [ 43 4 4.03 353.0875 C 16 18 9 0.8633 191.0551 Caffeoylquinic acid isomer Hydroxycinnamic acids and derivatives Roots IL2 [ 44 5 4.05 375.1291 C 16 24 10 1.5167 213.0756, 169.0857, 151.0753 Mussaenosidic acid Iridoid glycosides Leaves/cotyledons/pericarps/propagules IL2 [ 45 6 4.33 375.1285 C 16 24 10 3.1119 213.0747, 169.0854, 151.0748 (Epi)loganic acid Iridoid glycosides Leaves IL2 [ 45 7 4.53 487.1451 C 21 28 13 1.2588 179.0334 Cistanoside F Phenylethanoid glycosides Pericarps IL2 [ 46 8 4.80 327.0715 C 14 16 9 1.9983 179.0335, 165.0389, 147.0283, 135.0434 Unidentified - Leaves   9 5.09 353.0871 C 16 18 9 −3.0904 191.0550 Caffeoylquinic acid isomer Hydroxycinnamic acids and derivatives Leaves/cotyledons/pericarps/propagules/roots IL2 [ 44 10 5.47 371.0982 C 15 16 11 −8.7858 209.0635 Caffeoyl hexaric acid Hydroxycinnamic acids and derivatives Leaves IL2 [ 47 11 5.60 443.0655 C 18 20 11 −0.3243 275.0218, 167.0338 152.0105 Unidentified - Roots   12 5.65 415.1603 C 19 28 10 1.6114 235.0963, 191.1062 Icariside D1 Flavonoid glycosides Leaves IL2 [ 48 13 5.93 639.1964 C 29 36 16 −5.2193 621.1807, 529.1554, 459.1488, 251.0549, 179.0337, 161.0232 Suspensaside isomer Phenylethanoid glycosides Pericarps/roots IL2 [ 49 50 14 5.95 639.1964 C 29 36 16 −5.2193 621.1807, 529.1554, 459.1488, 251.0549, 179.0337, 161.0232 Suspensaside isomer Phenylethanoid glycosides Pericarps/roots IL2 [ 49 50 15 6.14 537.1628 C 25 30 13 −2.6672 493.1708, 375.1275, 323.0758, 213.0752, 179.0334, 169.0854, 161.0230 Grandifloroside Hydroxycinnamic acid and derivatives Leaves IL2 [ 51 16 6.33 619.1644 C 29 32 15 3.9407 383.0758, 311.0549 Unidentified - Pericarps/roots   17 6.41 639.1929 C 29 36 16 0.2477 621.1817 179.0338 Suspensaside isomer Phenylethanoid glycosides Roots IL2 [ 49 50 18 6.65 521.1658 C 25 30 12 1.2446 357.1176, 169.0854, 163.0385, 151.0749, 145.0280, 125.0591, 119.0486, 117.0329, 107.0486 Marinoid C Iridoid glycosides Leaves/cotyledons/pericarps IL3 [ 7 19 6.65 653.2091 C 29 34 17 9.55333 621.1822, 459.1499, 179.0338, 161.0234 Suspensaside methyl ether Phenylethanoid glycosides Roots IL2 [ 49 50 20 6.79 623.1981 C 29 36 15 0.0705 461.1657, 161.0233 Verbascoside (acteoside) isomer Phenylethanoid glycosides Leaves/pericarps/roots IL2 [ 52 21 6.9 463.0874 C 21 20 12 1.7229 301.0324, 300.0264, Quercetin 3- O Flavonoid glycosides Roots IL2 [ 53 54 55 22 7.02 667.2239 C 31 40 16 0.6864 621.1824, 459.1499, 179.0338 161.0235 β-ethyl-OH-verbascoside Phenylethanoid glycosides Pericarps IL2 [ 56 57 23 7.11 623.2001 C 29 36 15 −3.1336 461.1661, 161.0235 Verbascoside (acteoside) isomer Phenylethanoid glycosides Leaves/pericarps/roots IL2 [ 52 24 7.21 621.1838 C 29 34 15 −2.0992 461.1652, 179.0337, 161.0233 Suspensaside A Phenylethanoid glycosides Roots IL2 [ 49 50 25 7.21 461.0718 C 21 18 12 1.6222  285.0391 Kaempferol-3- O Flavonoid glycosides Leaves IL2 [ 58 26 7.21 681.2063 C 31 38 17 −3.9236 519.1708, 490.1321, 181.0129, 179.0334, 161.0230 Unidentified - Pericarps   27 7.3 447.0926 C 21 20 11 1.5287 327.0494, 285.0648, 284.0315 Kaempferol 3- O Flavonoid glycosides Roots IL2 [ 55 59 60 61 28 7.40 623.1658 C 28 32 16 −6.4750 315.0494 Isorhamnetin-3- O Flavonoid glycosides Leaves/pericarps IL2 [ 62 29 7.40 491.0828 C 22 20 13 0.6385 315.0499 Isorhamnetin glucuronide Flavonoid glycosides Leaves IL2 [ 63 30 7.51 535.1477 C 25 28 13 −3.7032 329.1021, 179.0338 Unidentified - Leaves/Pericarps   31 7.51 477.1036 C 22 22 12 −5.1250 315.0467, 314.0420 Isorhamnetin 7-glucoside Flavonoid glycosides Leaves IL2 [ 63 32 7.61 471.1874 C 22 32 11 −0.4545 287.1273, 263.1278 Unidentified - Pericarps   33 7.86 519.1143 C 24 24 13 0.2199 315.0472, 314.0423 Unidentified - Leaves   34 7.90 553.1556 C 25 30 14 1.2256 329.1021, 197.0445 Marinoid D Iridoid glycosides Cotyledons/pericarps/propagules/roots IL3 [ 7 35 7.95 505.1757 C 25 29 11 0.2000 357.1184, 213.0757, 195.0650, 169.0857, 151.0753, 147.0439 Marinoid A Iridoid glycosides Leaves IL3 [ 7 36 8.03 519.1505 C 25 28 12 0.5766 313.1072, 295.0961, 163.0388 Unidentified - Leaves/cotyledons/pericarps/roots   37 8.03 475.0887 C 22 20 12 −1.0510 300.0589, 299.0554 284.0318. Diosmetin 7-glucuronide Flavonoid glycosides Leaves IL2 [ 64 38 8.24 549.1616 C 26 30 13 −0.4279 343.1176, 325.1064, 193.0495 Unidentified - Leaves/cotyledons/pericarps/roots   39 8.36 591.2119 C 29 36 13 −6.0539 179.0333, 161.0234 Jionoside C Phenylethanoid glycosides Pericarps IL2 [ 65 40 8.62 825.4276 C 44 66 16 0.2536 663.3744 Unknown triterpene saponin Triterpene saponins Roots IL3 [ 66 67 41 8.70 539.2152 C 26 36 12 −3.3318 193.0485, 183.1010, 175.0382, 149.0591, 131.0485, 121.0642 Unidentified - Leaves   42 8.80 541.2285 C 26 38 12 1.0147 193.0485, 185.1166, 175.0382, 149.0591, 131.0485, 121.0642 Unidentified - Leaves   43 8.88 825.4285 C 42 66 16 −0.8354 663.3744 Unknown triterpene saponin Triterpene saponins Roots IL3 [ 66 67 44 8.97 299.0546 C 16 12 6 5.0379 285.0345, 284.0313 Trihydroxy-methoxyflavone Flavones Leaves IL2 [ 68 45 8.99 825.4273 C 42 66 16 0.6166 663.3744 Medicoside G (medicagenic acid 3,28-di-glucoside) Triterpene saponins Roots IL2 [ 66 67 46 9.08 809.4316 C 42 66 15 1.5979 689.3884, 647.3788 Esculentoside C (phycolaccoside D) Triterpene saponins Cotyledons/pericarps/propagules/roots IL2 [ 69 70 47 9.30 505.1711 C 25 30 11 0.8600 281.1170, 195.0649, 151.0750, 147.0438 Unidentified - Leaves   48 9.38 503.1572 C 25 28 11 −2.6077 279.1010, 253,0854, 209.0954, 195.0647, 147.0437 Unidentified - Leaves/pericarps   49 9.54 809.4342 C 42 66 15 −1.6102 647.3797 Azukisaponin III Triterpene saponins Roots IL2 [ 71 pharmaceuticals-18-01308-t002_Table 2 Table 2 Spearman correlation coefficients (ρ) between the number of compounds per chemical class and the antioxidant activity (DPPH and ABTS assays). Statistically significant correlations are indicated in bold ( p Compound Class DPPH ABTS ρ-Value p p p Iridoid glycosides −0.103 0.870 0.510 0.935 Hydroxycinnamic acid and derivatives −0.112 0.858 0.224 0.718 Phenylethanoid glycosides 0.791 0.111 0.949  0.014 Flavonoid glycosides 0.205 0.741 0.574 0.322 Triterpene saponins 0.447 0.450 0.224 0.718 ",
  "metadata": {
    "Title of this paper": "PASS: Prediction of Activity Spectra for Biologically Active Substances",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472679/"
  }
}