{
  "title": "Paper_1241",
  "abstract": "pmc Mar Drugs Mar Drugs 590 mardrugs marinedrugs Marine Drugs 1660-3397 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471600 PMC12471600.1 12471600 12471600 41003302 10.3390/md23090333 marinedrugs-23-00333 1 Article Sea Anemone Stichodactyla Haddoni Huang Meiling † Li Ming † Zhu Rong Mao Kailin Pan Kun Liu Xuefeidan https://orcid.org/0000-0003-1042-1768 Gao Bingmiao * Jiménez-Tenorio Manuel Academic Editor Hainan Key Laboratory for Research and Development of Tropical Herbs, Engineering Research Center of Tropical Medicine Innovation and Transformation of Ministry of Education, School of Pharmacy, Hainan Medical University, Haikou 571199, China * gaobingmiao@muhn.edu.cn † These authors contributed equally to this work. 23 8 2025 9 2025 23 9 497656 333 16 7 2025 13 8 2025 21 8 2025 23 08 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Sea anemone venoms contain diverse toxins that have significant pharmacological potential, including anticancer, ecticidal, and immunotherapeutic properties. However, critically, the extraction methodology influences venom composition and bioactivity. This study characterized venom from Stichodactyla haddoni Tenebrio molitor S. haddoni sea anemone Stichodactyla haddoni venom extraction functional proteomics cytotoxicity insecticidal activity Hainan Provincial Key Point Research and Invention Program ZDYF2022SHFZ309 National Natural Science Foundation of China 82060686 Hainan Province Science and Technology Special Fund GHYF2025048 Innovation Training Program S202411810015 Hainan Province Higher Education Science Research Project Hnky2024-25 This work is supported by Hainan Provincial Key Point Research and Invention Program (no. ZDYF2022SHFZ309), National Natural Science Foundation of China (no. 82060686), Hainan Province Science and Technology Special Fund (GHYF2025048), Innovation Training Program (S202411810015), and Hainan Province Higher Education Science Research Project (no. Hnky2024-25). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Sea anemones represent an abundant marine resource, with over a thousand species distributed worldwide. Among them, Stichodactyla haddoni 1 2 3 4 5 6 7 8 Research on the venom of the sea anemone S. haddoni 9 10 9 50 9 11 12 13 14 15 16 Interest in sea-anemone-derived bioactive peptides has grown significantly in recent decades due to their unique structures and potential as nervous-system-targeting drug candidates [ 17 18 19 Heteractis magnifica 20 21 22 23 Bunodosoma caissarum 24 25 This study directly compares venoms obtained using different extraction techniques, focusing on compositional differences and their effects on biological activity. We analyzed protein content and composition via high-performance liquid chromatography combined with ultraviolet spectrophotometry (HPLC-UV), sodium dodecyl sulfate–polyacrylamide gel electrophoresis (SDS-PAGE), and proteomic analysis. We also evaluated the anticancer and insecticidal activities of the venoms extracted by each method. Our findings provide a scientific basis for selecting appropriate venom-extraction techniques, highlighting how methodology influences venom composition and activity. This work offers methodological support and a technical reference for novel venom research, significantly advancing the exploration of venom’s medicinal potential. 2. Results 2.1. Venom Protein Characteristics Crude venom extracts from three healthy sea anemone S. haddoni Figure 1 Venom composition was assessed using SDS-PAGE ( Figure 1 Figure 1 2.2. Protein Identification Statistics Using a proteomic database derived from S. haddoni Figure 2 Figure 2 2.3. Differential Protein Abundance Analysis Label-free quantitative proteomics (LFQ) was employed to compare protein abundance profiles across the venoms obtained by milking, electrical stimulation, and homogenization. Hierarchical clustering heatmaps ( Figure 3 p Figure 3 Figure 3 2.4. Cytotoxicity Assessment of Crude Venom Evaluation of the cytotoxic activity of S. haddoni Figure 4 Figure 4 50 Figure 4 Figure 4 50 Figure 4 2.5. Insecticidal Activity of Crude Venom The insecticidal potential of S. haddoni Tenebrio molitor 50 Figure 5 T. molitor 50 Figure 5 Figure 5 3. Discussion The venom produced by sea anemones has a wide scope for medicinal development, and the extraction of sea anemone venom is important for its research and development. However, there is a lack of information on the best method for the extraction of crude sea anemone venom. There is also no systematic comparison of the venoms extracted through different techniques. In this study, to investigate different methods for obtaining sea anemone venom, we combined proteomics with traditional activity studies to compare venoms extracted via three different methods. Homogenized venom showed higher toxin complexity compared to electrical-stimulation-derived and milked venoms ( Figure 2 S. haddoni S. haddoni S. haddoni Sea anemone venom has been reported to have multiple biological effects, including anticancer and insecticidal properties [ 18 26 27 28 S. haddoni 28 29 50 Heteractis magnifica 30 31 The same pattern was observed for venoms extracted by all three methods in insecticidal activity studies. Therefore, we conclude that extraction methodology fundamentally shapes venom bioactivity through differential neurotoxin recovery. While all venoms showed dose-dependent toxicity in mealworm larvae, milking-derived venom consistently exhibited the strongest potency across models—attributable to its superior neurotoxin concentration per biomass, higher than electrical stimulation despite homogenization’s higher absolute neurotoxin yield. This neurotoxin density directly explains milking’s dominant efficacy (lowest LD 50 50 The observed variation in composition and toxicity among the sea anemone crude venom samples can be attributed to a primary factor. Differences in the purity of the crude venom and the presence of high-molecular-weight compounds with low toxicity, such as receptor proteins and enzyme proteins, may contribute to these variations [ 32 It is worth noting that the homogenization method allows for the extraction of more toxins. However, it must be noted that this method can only extract anemone venom in an unsustainable and non-reproducible manner. Compared with the other methods, the results for toxin extraction via electrical stimulation are relatively poor, mainly due to the fact that the high voltage and current of the electrical stimulation process can cause severe damage or even death to the anemones, as well as lead to alteration of anemone toxins. The milking method gives rapid access to highly active venom, which can be sustainably extracted from the same anemone. However, proteomic studies showed that the amount of toxin obtained using the milking method is lower than that when using the homogenization method. It is also worth noting that the yield of toxin obtained by the milking method is relatively low. These considerations highlight the need to carefully evaluate the advantages and disadvantages of different venom-extraction methods in order to select the appropriate extraction method for venom research. The results of this study reveal that the method of extraction has a significant effect on the crude toxins obtained from sea anemones. Understanding these distinctions is essential to better investigate the potential applications of sea anemone crude toxins in the field of pharmacological research and development. 4. Materials and Methods 4.1. Sample Preparation S. haddoni 4.2. Venom Acquisition Homogenization: A total of three healthy anemones weighing about 20.78 g were selected for this experiment. The anemones were carefully placed on a clean bench, the tentacles were cut off with clean scissors, and the tentacle tissue from each anemone was combined in a homogenizer. Distilled water was used in the homogenization process. The sample was then centrifuged at 10,528× g 33 34 Electrical stimulation: Three individual S. haddoni 35 36 Milking: Three individual healthy S. haddoni 18 37 38 4.3. SDS–PAGE Analysis Crude toxin extract was dissolved in ddH 2 g 39 40 v v 4.4. RP-HPLC Analysis The sea anemone toxins extracted using different methods were analyzed on the Shi-madzu system using a 0.46 × 15 cm Shimadzu pack GIST C18 column (Shimadzu Corporation, Kyoto, Japan). Solvents A and B contained 0.1% TFA in HPLC-grade water and HPLC-grade acetonitrile, respectively. The column was initially equilibrated with 5% acetonitrile at room temperature. The toxin was filtered through 0.45 μm syringe filters, and the injection volume was 100 μL. Samples containing 10 mg crude toxin in 1 mL of solution were analyzed by applying a linear gradient of 5–70% acetonitrile over 65 min at 1 mL/min. The chromatographically separated compounds were detected with UV at a wavelength of 214 nm. 4.5. RNA Extraction, mRNA Library Synthesis, and Illumina Sequencing The tentacles and columnar tissue of S. haddoni S. haddoni ® 4.6. Protein Digestion The amount of venom obtained through the three extraction methods was quantified using the BCA method. An appropriate amount of protein was taken from each sample and subjected to trypsin digestion using the filter-aided proteome preparation (FASP) method [ 41 4 3 wt wt v v 4.7. Mass Spectrometric Identification LC-MS/MS analysis was performed on a tims TOF Pro mass spectrometer (Bruker Daltonics, Billerica, MA, USA) coupled to Easy nLC (Thermo Fisher Scientific, Waltham, MA, USA,). The peptides were loaded onto a reverse-phase trap column (Thermo Scientific Acclaim PepMap100, 100 μm × 2 cm, nanoViper C18) connected to the C18 reverse-phase analytical column (Thermo Scientific Easy Column, 10 cm, 75 μm inner diameter, 3 μm) in buffer A (0.1% formic acid in water) and separated with a linear gradient of buffer B (84% acetonitrile and 0.1% formic acid) at a flow rate of 300 nL/min. The mass spectrometer was operated in positive-ion mode. MS data were acquired using a data-dependent top 20 method, dynamically choosing the most abundant precursor ions from the survey scan (300–1800 m z m z m z m z 4.8. Protein Identification The raw data files generated by the mass spectrometer were searched in the transdecoder database built from the S. haddoni 42 4.9. Quantitative Data Analysis Label-free quantitative (LFQ) analysis utilizes protein identification results obtained through insolution tryptic digestion and LC-MS/MS and performs relative quantitative analysis of proteins based on the integrated area of ion peak intensity detected by mass spectrometry. MaxQuant software (version 1.6.14) was employed for data analysis. In the analysis, LFQ intensities were normalized and consideration was given to unique and razor peptides, with the minimal ratio count set to 1. Before the analysis, the contaminants and reverse identifications were removed and the values of LFQ intensities were transformed to log2. Significance B was applied exclusively to protein groups that were quantified consistently across all technical replicates within the three groups (homogenization, electrical stimulation, and milking extraction). Fold-change values for protein groups showing statistical significance between samples were calculated using LFQ intensities. 4.10. Cell Line and Cell Culture The human cell lines HeLa (cervical carcinoma) and A549 (lung cancer) and the Spodoptera frugiperda sf9 cell line were obtained from Hainan Provincial Key Laboratory of Carcinogenesis and Intervention. SF9 cells were grown in Sf-900 II SFM medium containing 10% fetal bovine serum (Gibco, Livonia, MI, USA,) and 1% penicillin/streptomycin (Gibco), while the HeLa and A549 cell lines were grown in DMEM medium containing 10% fetal bovine serum (Gibco) and 1% penicillin/streptomycin (Gibco). SF9 cells were cultured in a fully humidified incubator at 27 °C, while HeLa and A549 cell lines were incubated in a humidified incubator at 37 °C with 5% CO 2 4.11. Cytotoxicity Assay The cytotoxicity of crude toxin samples obtained via different extraction methods was evaluated using cell-counting kit-8 [ 43 4 2 2 4.12. Lethality Assays Tenebrio molitor Tenebrio molitor tenebrio molitor 50 5. Conclusions This study demonstrates that the method of extraction significantly impacts the yield, composition, and bioactivity of Stichodactyla haddoni Disclaimer/Publisher’s Note: Author Contributions B.G. conceived and designed the project; M.H. and M.L. wrote the paper; M.L. and R.Z. analyzed the data; B.G., M.H., K.M., X.L., and K.P. revised the manuscript. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement All the data generated in this study, including the original files of the proteome and transcriptome, have been published online. Specifically, the proteome dataset and atlas of Stichodactyla haddoni Stichodactyla haddoni Conflicts of Interest The authors declare no conflicts of interest. References 1. Fautin D.G. Allen G.R. Allen G.R. Naturalist A. Allen G.R. Naturaliste A. Field guide to anemonefishes and their host sea anemones Copeia 1992 1993 899 2. García P. Schein R.M.H. Burnett J.E.C. Fulminant Hepatic Failure from a Sea Anemone Sting Ann. Intern. Med. 1994 120 665 666 10.7326/0003-4819-120-8-199404150-00007 8135451 3. Mizuno M. Nishikawa K. Yuzawa Y. Kanie T. Mori H. Araki Y. Hotta N. Matsuo S. Acute renal failure after a sea anemone sting Am. J. Kidney Dis. 2000 36 e10.1 e10.4 10.1053/ajkd.2000.9006 10922331 4. Matsumura K. Shimomura T. Kubo Y. Oka T. Kobayashi N. Imai S. Yanase N. Akimoto M. Fukuda M. Yokogawa M. Mechanism of hERG inhibition by gating-modifier toxin, APETx1, deduced by functional characterization BMC Mol. Cell Biol. 2021 22 3 10.1186/s12860-020-00337-3 33413079 PMC7791793 5. Cuypers E. Peigneur S. Debaveye S. Shiomi K. Tytgat J. TRPV1 channel as new target for marine toxins: Example of Gigantoxin I, a sea anemone toxin acting Via modulation of the PLA2 pathway Acta Chim. Slov. 2011 58 735 741 24061123 6. Panmin H. Ming L. Jinxing F. Yanling L. Bo Y. Diversity of biological activities of crude venom extracted from five species of South China Sea anemones Front. Mar. Sci. 2024 11 745 754 10.3389/fmars.2024.1480745 7. Wanke E. Zaharenko A.J. Redaelli E. Schiavon E. Actions of sea anemone type 1 neurotoxins on voltage-gated sodium channel isoforms Toxicon 2009 54 1102 1111 10.1016/j.toxicon.2009.04.018 19393679 8. Prentis P.J. Pavasovic A. Norton R.S. Sea anemones: Quiet achievers in the field of peptide toxins Toxins 2018 10 36 10.3390/toxins10010036 29316700 PMC5793123 9. Honma T. Kawahata S. Ishida M. Nagai H. Nagashima Y. Shiomi K. Novel peptide toxins from the sea anemone Stichodactyla haddoni Peptides 2008 29 536 544 10.1016/j.peptides.2007.12.010 18243416 10. Madio B. Undheim E.A. King G.F. Revisiting venom of the sea anemone Stichodactyla haddoni J. Proteom. 2017 166 83 92 10.1016/j.jprot.2017.07.007 28739511 11. Diochot S. Schweitz H. Béress L. Lazdunski M. Sea anemone peptides with a specific blocking activity against the fast inactivating potassium channel Kv3. 4 J. Biol. Chem. 1998 273 6744 6749 10.1074/jbc.273.12.6744 9506974 12. Suarez-Carmona M. Hubert P. Delvenne P. Herfs M. Defensins:“Simple” antimicrobial peptides or broad-spectrum molecules? Cytokine Growth Factor Rev. 2015 26 361 370 10.1016/j.cytogfr.2014.12.005 25578522 13. Shafee T.M. Lay F.T. Hulett M.D. Anderson M.A. The defensins consist of two independent, convergent protein superfamilies Mol. Biol. Evol. 2016 33 2345 2356 10.1093/molbev/msw106 27297472 14. Hermann P.M. Schein C.H. Nagle G.T. Wildering W.C. Lymnaea EGF and Gigantoxin I, novel invertebrate members of the epidermal growth factor family Curr. Pharm. Des. 2004 10 3885 3892 10.2174/1381612043382503 15579077 15. Pennington M.W. Byrnes M.E. Zaydenberg I. Khaytin I. de Chastonay J. Krafte D.S. Hill R. Mahnir V.M. Volberg W.A. Gorczyca W. Chemical synthesis and characterization of ShK toxin: A potent potassium channel inhibitor from a sea anemone Int. J. Pept. Protein Res. 1995 46 354 358 10.1111/j.1399-3011.1995.tb01068.x 8567178 16. Dang B. Kubota T. Mandal K. Bezanilla F. Kent S.B. Native chemical ligation at Asx-Cys, Glx-Cys: Chemical synthesis and high-resolution X-ray structure of ShK toxin by racemic protein crystallography J. Am. Chem. Soc. 2013 135 11911 11919 10.1021/ja4046795 23919482 PMC3838204 17. Kvetkina A. Leychenko E. Chausova V. Zelepuga E. Chernysheva N. Guzev K. Pislyagin E. Yurchenko E. Menchinskaya E. Aminin D. A new multigene HCIQ subfamily from the sea anemone Heteractis crispa Sci. Rep. 2020 10 4205 10.1038/s41598-020-61034-x 32144281 PMC7060258 18. Arulvasu C. Sekaran G.D. Prabhakaran B. Kalaiselvi V. Kathirvel N. Lakshmanan V. Cytotoxic effect of crude venom isolated from Sea anemone Calliactis tricolor Indian J. Geo-Mar. Sci. 2020 49 601 609 19. Kalina R. Gladkikh I. Dmitrenok P. Chernikov O. Koshelev S. Kvetkina A. Kozlov S. Kozlovskaya E. Monastyrnaya M. New APETx-like peptides from sea anemone Heteractis crispa Peptides 2018 104 41 49 10.1016/j.peptides.2018.04.013 29684594 20. Khoo K.S. Kam W.K. Khoo H.E. Gopalakrishnakone P. Chung M.C. Purification and partial characterization of two cytolysins from a tropical sea anemone, Heteractis magnifica Toxicon 1993 31 1567 1579 10.1016/0041-0101(93)90341-F 8146870 21. Schweitz H. Bidard J.N. Frelin C. Pauron D. Vijverberg H.P. Mahasneh D.M. Lazdunski M. Vilbois F. Tsugita A. Purification, sequence, and pharmacological properties of sea anemone toxins from Radianthus paumotensis. A new class of sea anemone toxins acting on the sodium channel Biochemistry 1985 24 3554 3561 10.1021/bi00335a025 2412579 22. Razpotnik A. Križaj I. Kem W.R. Maček P. Turk T. A new cytolytic protein from the sea anemone Urticina crassicornis Toxicon 2009 53 762 769 10.1016/j.toxicon.2009.02.007 19232528 23. Razpotnik A. Križaj I. Šribar J. Kordiš D. Maček P. Frangež R. Kem W.R. Turk T. A new phospholipase A2 isolated from the sea anemone Urticina crassicornis FEBS J. 2010 277 2641 2653 10.1111/j.1742-464X.2010.07674.x 20553498 24. Lagos P. Duran R. Cerveñansky C. Freitas J.C.d. Silveira R. Identification of hemolytic and neuroactive fractions in the venom of the sea anemone Bunodosoma cangicum Braz. J. Med. Biol. Res. 2001 34 895 902 10.1590/S0100-879X2001000700009 11449308 25. Zaharenko A.J. Ferreira Jr W.A. de Oliveira J.S. Konno K. Richardson M. Schiavon E. Wanke E. de Freitas J.C. Revisiting cangitoxin, a sea anemone peptide: Purification and characterization of cangitoxins II and III from the venom of Bunodosoma cangicum Toxicon 2008 51 1303 1307 10.1016/j.toxicon.2008.01.011 18342901 26. Yamaguchi Y. Hasegawa Y. Honma T. Nagashima Y. Shiomi K. Screening and cDNA cloning of Kv1 potassium channel toxins in sea anemones Mar. Drugs 2010 8 2893 2905 10.3390/md8122893 21339955 PMC3039155 27. Bosmans F. Tytgat J. Sea anemone venom as a source of insecticidal peptides acting on voltage-gated Na + Toxicon 2007 49 550 560 10.1016/j.toxicon.2006.11.029 17224168 PMC1868498 28. Bosmans F. Aneiros A. Tytgat J. The sea anemone Bunodosoma granulifera FEBS Lett. 2002 532 131 134 10.1016/S0014-5793(02)03653-0 12459477 29. Moreels L. Peigneur S. Galan D.T. De Pauw E. Béress L. Waelkens E. Pardo L.A. Quinton L. Tytgat J. APETx4, a Novel Sea Anemone Toxin and a Modulator of the Cancer-Relevant Potassium Channel K V Mar. Drugs 2017 15 287 304 10.3390/md15090287 28902151 PMC5618426 30. Abdzadeh E. Heidari B. Hadavi M. Sea anemone ( Stichodactyla haddoni Biologia 2020 75 1203 1211 10.2478/s11756-020-00417-x 31. Ramezanpour M. Da Silva K.B. Sanderson B.J. The effect of sea anemone ( H. magnifica Cytotechnology 2014 66 845 852 10.1007/s10616-013-9636-5 23989939 PMC4158024 32. Ramezanpour M. Burke da Silva K. Sanderson B. Differential susceptibilities of human lung, breast and skin cancer cell lines to killing by five sea anemone venoms J. Venom. Anim. Toxins Incl. Trop. Dis. 2012 18 157 163 10.1590/S1678-91992012000200005 33. Mahnir V.M. Kozlovskaya E.P. Kalinovsky A.I. Sea anemone Radianthus macrodactylus Toxicon 1992 30 1449 1456 10.1016/0041-0101(92)90520-F 1362473 34. Béress L. Béress R. Wunderer G. Purification of three polypeptides with neuroand cardiotoxic activity from the sea anemone Anemonia sulcata Toxicon 1975 13 359 368 10.1016/0041-0101(75)90196-8 1876 35. Kvetkina A. Malyarenko O. Pavlenko A. Dyshlovoy S. von Amsberg G. Ermakova S. Leychenko E. Sea anemone Heteractis crispa Molecules 2020 25 5979 5992 10.3390/molecules25245979 33348592 PMC7766076 36. Malpezzi E.L. de Freitas J. Muramoto K. Kamiya H. Characterization of peptides in sea anemone venom collected by a novel procedure Toxicon 1993 31 853 864 10.1016/0041-0101(93)90220-D 8105563 37. van Losenoord W. Krause J. Parker-Nance S. Krause R. Stoychev S. Frost C.L. Purification and biochemical characterisation of a putative sodium channel agonist secreted from the South African Knobbly sea anemone Bunodosoma capense Toxicon 2019 168 147 157 10.1016/j.toxicon.2019.06.222 31330191 38. Sencic L. Macek P. New method for isolation of venom from the sea anemone Actinia cari Comp. Biochem. Physiol. Part B Biochem. Mol. Biol. 1990 97 687 693 10.1016/0305-0491(90)90108-6 1982253 39. Yanagita T. Physiological mechanism of nematocyst responses in sea-anemone—III excitation and anaesthetization of the nettling response system Comp. Biochem. Physiol. 1960 1 123 139 10.1016/0010-406X(60)90045-1 40. Laemmli U.K. Cleavage of structural proteins during the assembly of the head of bacteriophage T4 Nature 1970 227 680 685 10.1038/227680a0 5432063 41. Santhosh K.N. Pavana D. Shruthi B.R. Thippeswamy N.B. Protein profile of scorpion venom from Hottentotta rugiscutis and its immunogenic potential in inducing long term memory response Toxicon 2022 15 71 78 10.1016/j.toxicon.2021.11.121 34826434 42. Wiśniewski J.R. Zougman A. Nagaraj N. Mann M. Universal sample preparation method for proteome analysis Nat. Methods 2009 6 359 362 10.1038/nmeth.1322 19377485 43. Fedorov S. Dyshlovoy S. Monastyrnaya M. Shubina L. Leychenko E. Kozlovskaya E. Jin J.-O. Kwak J.-Y. Bode A.M. Dong Z. The anticancer effects of actinoporin RTX-A from the sea anemone Heteractis crispa Radianthus macrodactylus Toxicon 2010 55 811 817 10.1016/j.toxicon.2009.11.016 19944712 PMC2823821 Figure 1 Extraction and analysis of crude venom from S. haddoni A B C Figure 2 Proteomic characterization of S. haddoni A B Figure 3 Comparisons of proteomic analysis of S. haddoni A B D B C D Figure 4 Method-dependent cytotoxicity profiles of S. haddoni A B 50 C D 50 n p p p Figure 5 Insecticidal activity of S. haddoni A B 50 C Tenebrio molitor D 50 T. molitor n p p p ",
  "metadata": {
    "Title of this paper": "The anticancer effects of actinoporin RTX-A from the sea anemone ",
    "Journal it was published in:": "Marine Drugs",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471600/"
  }
}