{
  "title": "Paper_80",
  "abstract": "pmc J Cancer J Cancer 1305 jcanc jca Journal of Cancer 1837-9664 Ivyspring International Publisher PMC12491166 PMC12491166.1 12491166 12491166 10.7150/jca.119306 jcav16p4037 1 Review Epigenetic regulation espeically histone modifications in breast cancer: A viable and emerging targeted therapeutic strategy Zhou Yibing 1 † Liu Haotian 2 † Hong Weimin 3 † Su Haotian 2 Mu Yuxiao 2 Cheng Yijie 4 Wu Chaoshen 1 ✉ Meng Xuli 2 ✉ Qian Da 1 ✉ 1 2 3 4 ✉ Corresponding authors: Chaoshen Wu, Chaoshen_Wu@outlook.com mxlmail@126.com qianda0215@suda.edu.cn † Competing Interests: The authors have declared that no competing interest exists. 2025 22 9 2025 16 13 498219 4037 4046 10 6 2025 7 9 2025 22 09 2025 04 10 2025 04 10 2025 © The author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ https://ivyspring.com/terms Epigenetic regulation, encompassing DNA methylation, histone modifications, and non-coding RNA activities, is a crucial mechanism through which gene expression is modified without corresponding changes in genomic DNA sequences. Dysregulation of these mechanisms can lead to histone and DNA modifications that either suppress or enhance the expression of disease progression-related genes. Among these regulatory processes, histone modifications are particularly significant, as they contribute to genomic stability, DNA repair, and chromatin dynamics, all of which influence breast cancer initiation and progression. This review offers a detailed analysis of the current state of research centered on epigenetic regulatory factors, with a particular focus on the role that histone modifications play in the treatment of breast cancer. It also examines the interplay between epigenetic modifications and the effectiveness of radiotherapy and chemotherapy when treating breast cancer. Lastly, this article explores the potential of epigenetic regulatory factors as viable targets for the future design of new anticancer therapies. breast cancer epigenetic regulation histone modification histone target inhibitors DNA methylation inhibitors pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Breast cancer is among the most widely diagnosed malignancies and remains a prominent driver of global cancer-related mortality in women 1 2 3 4 5 6 7 2. Epigenetic Regulatory Mechanisms Epigenetics consists of a class of heritable, reversible modifications capable of regulating gene expression without affecting the sequence of the underlying DNA. These mechanisms can entail DNA methylation, histone modifications, non-coding RNA activities, the remodeling of the chromatin, and nucleosome positioning 8 9 1 2.1 Breast cancer-related histone modifications Histone modifications entail covalent chemical changes at the N-terminal histone tails, and can consist of phosphorylation, methylation, acetylation, and ubiquitination, among other post-translational modifications 10 11 2.1.1 Histone acetylation Histone acetylation is a process through which acetyl groups (-COCH₃) are enzymatically added to lysine residues, primarily on histones H3 and H4. Key acetylation sites can include H3K9, H3K14, H3K27, H4K5, H4K8, H4K12, and H4K16 12 13 14 In breast cancer, histone acetylation is a major driver of tumor development through its ability to modulate gene expression. A notable observation in cancer is the global reduction of H4K16 acetylation, which is thought to occur early in breast tumorigenesis 15 16 17 18 2.1.2 Histone methylation Histone methylation occurs on arginine, lysine, and histidine residue side chains, influencing gene expression through distinct methylation patterns. Lysine residues can undergo mono-, di-, or tri-methylation, while the asymmetric or symmetric methylation of arginine residues can take place. The types of histone methylation most commonly reported in the literature are H3K4, H3K9, H3K27, H3K36, H3K79, and H4K20 19 20 21 The tumor suppressor gene p53, which is frequently mutated or dysregulated in breast cancer, plays a crucial role in preventing oncogenesis 22 23 24 25 26 27 2.1.3 Histone phosphorylation and ubiquitination Beyond acetylation and methylation, histone phosphorylation and ubiquitination also play vital roles in the control of chromatin dynamics and the expression of genes. Histone H1 phosphorylation is closely linked with chromatin relaxation during interphase and its condensation in mitosis 28 Histone ubiquitination, primarily facilitated by the Polycomb Repressive Complex 1 (PRC1), is integral to gene silencing in human cells 29 30 31 2.2 Breast cancer-associated DNA methylation DNA methylation is among the most widespread epigenetic modifications, typically occurring within CpG islands 32 33 34 In the context of breast cancer, multiple genes undergo significant methylation alterations 35 9 DNA methylation markers provide several advantages over other types of tumor biomarkers in the context of breast cancer diagnostics, including improved sensitivity, non-invasiveness, and early detection 36 37 38 39 40 The methylation status of specific genes serves as a valuable prognostic indicator for breast cancer patients. For instance, BRCA1 promoter hypermethylation is related to poor triple-negative breast cancer patient outcomes, while ESR1 gene methylation may predict responsiveness to endocrine therapy 41 42 2.3 miRNA expression in breast cancer MicroRNAs (miRNAs) are small, non-coding RNAs, typically 21-23 nucleotides in length, that play vital roles in post-transcriptional gene regulation 43 44 45 The first established link between miRNAs and cancer was demonstrated by Croce et al., who found that miR-15 and miR-16-1 can suppress tumor development via targeting the anti-apoptotic protein Bcl-2 46 47 48 miRNAs also hold promise as biomarkers for breast cancer subtyping, metastasis prediction, and therapy resistance assessment 49 50 51 52 2.4 Chromatin remodeling and nucleosome positioning Chromatin remodeling is driven by ATP-dependent chromatin remodeling complexes that modulate nucleosome positioning to regulate gene transcription. Nucleosomes, which serve as the fundamental chromatin units, are composed of DNA that wrap around histone octamers, facilitating DNA organization and protection within the nucleus. The positioning of nucleosomes determines the precise genomic arrangement of nucleosomes throughout chromatin landscapes 53 54 55 3. Epigenetic Drugs in the Treatment of Breast Cancer 3.1 Histone target inhibitors Histone targeting inhibitors represent a class of pharmacologically active compounds that modulate gene expression, chromatin architecture, and cellular differentiation through the regulation of histone function and post-translational modifications. These therapeutic agents exert their anti-neoplastic effects in breast cancer by specifically inhibiting various classes of histone-modifying enzymes (Figure 2 3.1.1 Histone deacetylase inhibitors (HDACi) HDACs are often overexpressed in tumor cells, leading to excessive histone deacetylation, which in turn suppresses the transcription of essential housekeeping and tumor suppressor genes. This epigenetic silencing plays a role in malignant transformation 56 57 58 59 64 HDACi are classified based on their chemical structure into short-chain fatty acids, benzamides, cyclic peptides, and hydroxamic acids 65 66 67 68 NCT02393794 69 70 71 NCT00365599 72 73 3.1.2 Histone methyltransferase inhibitors (HMTi) Histone methyltransferases (HMTs) catalyze the methylation of specific histone residues, playing crucial roles in chromatin remodeling and gene expression regulation 74 75 EZH2, the catalytic subunit of PRC2, mediates H3K27 trimethylation, leading to gene silencing. Silencing of PPP2R2B by EZH2 has been linked to poor prognosis in HER2-positive breast cancer and HER2-targeted therapy resistance, including trastuzumab and lapatinib. Inhibitors of EZH2, including GSK126 and EPZ-6438, have been shown to restore PPP2R2B expression, thereby mitigating resistance to HER2-targeted treatments 76 77 NCT01897571 78 79 80 81 82 These HMTi not only exhibit standalone antitumor effects but also hold potential for combination therapies that enhance treatment efficacy. For example, combining EZH2 inhibitors with PARP inhibitors has been demonstrated to markedly enhance cytotoxicity in BRCA1-mutated breast cancer cells 83 84 3.1.3 Histone lysine demethylase inhibitors (HDMi) Histone lysine demethylases are enzymes that remove methyl groups from specific histone lysine residues, thereby modulating gene expression. In accordance with their catalytic mechanisms, these enzymes are classified into lysine-specific demethylases (LSDs) and the Jumonji C (JmjC) domain-containing family 85 86 87 Among histone demethylases, LSD1 is particularly well-studied due to its frequent overexpression in breast cancer 88 89 90 91 92 93 94 95 3.1.4 Histone acetyltransferase inhibitors (HATi) HATs play a dual role in cancer biology, functioning as both tumor suppressors and oncogenic drivers depending on the context 96 97 HATi are broadly divided into bisubstrate inhibitors and small-molecule inhibitors 96 98 99 100 101 102 3.2 DNA methylation inhibitors (DNMTi) DNA methylation, a critical epigenetic modification, is primarily mediated by DNA methyltransferases (DNMTs) 103 104 105 106 107 108 109 110 111 112 113 4. Summary and Future Perspectives Epigenetic alterations, particularly aberrant histone modifications and DNA methylation, are central to breast cancer development and therapeutic resistance. HDACi have been widely explored, but their use as monotherapies has shown only limited efficacy in clinical trials. Consequently, current research is focused on their combination together with chemotherapy and targeted treatments to enhance therapeutic outcomes. A number of clinical trials are underway. Currently, emerging epigenetic targets and innovative drugs mainly include KAT6A/6B inhibitors, NSD2/WHSC1-targeted therapies, and super-enhancer regulation. The first-in-class KAT6 inhibitor, PF-07248144, demonstrated promising and durable anti-tumor activity in later-line treatment of ER+/HER2- advanced breast cancer. When combined with fulvestrant, the objective response rate (ORR) reached 30.2%, with a median duration of response (DOR) of 9.2 months. The median progression-free survival (PFS) was 10.7 months—significantly longer than the 1-2 months observed with fulvestrant monotherapy—and efficacy was independent of ESR1 or PIK3CA mutations 114 115 116 Despite the promise of histone modification-based therapies, a major challenge lies in their broad-spectrum activity, which can lead to off-target effects and toxicity as a result of the disruption of gene expression within healthy cells. Therefore, improving the selectivity of epigenetic drugs remains a key priority in drug development. Precision medicine demands the multi-dimensional integration of molecular data to shift from \"one drug for one disease\" to \"one strategy for one patient.\" PIK3CA is one of the most prevalent mutated genes in breast cancer. For patients with hormone receptor-positive, HER2-negative locally advanced or metastatic breast cancer, PIK3CA testing should be routinely performed before first-line treatment. If mutations are detected, patients may benefit from treatment with PI3K inhibitors such as inavolisib and alpelisib 117 We thank the State Administration of Traditional Chinese Medicine, Zhejiang Provincial Key Laboratory, Key Laboratory for diagnosis and treatment of upper limb edema and stasis of breast cancer and figure support was provided by Figdraw. Funding This research was supported by the National Natural Science Foundation of China (Grant No. 82404685), Research Project of Jiangsu Association of Chinese Medicine (CYTF2024050), Suzhou Science and Technology Development Program (SKYD2023087), Changshu Medical Key Subjects (CSZDXK202301, CSZDXK202302), and Changshu Health Commission Science and Technology Program (CSWS202208、CSWS 202211). Author contributions Yibing Zhou Haotian Liu: Weimin Hong: Haotian Su: Yuxiao Mu: Yijie Cheng: Chaoshen Wu: Xuli Meng: Da Qian: 1 Akram M Iqbal M Daniyal M Awareness and current knowledge of breast cancer Biol Res 2017 50 1 33 28969709 10.1186/s40659-017-0140-9 PMC5625777 2 Bray F Laversanne M Sung H Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 3 229 263 38572751 10.3322/caac.21834 3 Qian D Hong W Li S Trends in the global, national, and regional burden of breast cancer among adolescents and young adults from 1990 to 2021: Analyses of the 2021 global burden of disease study Breast 2025 82 104486 40347584 10.1016/j.breast.2025.104486 PMC12282449 4 Shien T Iwata H Adjuvant and neoadjuvant therapy for breast cancer Jpn J Clin Oncol 2020 50 3 225 229 32147701 10.1093/jjco/hyz213 5 He M Jiang Y Z Gong Y Intensive chemotherapy versus standard chemotherapy among patients with high risk, operable, triple negative breast cancer based on integrated mRNA-lncRNA signature (BCTOP-T-A01): randomised, multicentre, phase 3 trial Bmj 2024 387 e079603 39442958 10.1136/bmj-2024-079603 PMC11497771 6 Lin Y Zhu S Hu C Cross-Species Suppression of Hepatoma Cell Growth and Migration by a Schistosoma japonicum MicroRNA Mol Ther Nucleic Acids 2019 18 400 412 31655260 10.1016/j.omtn.2019.09.006 PMC6831938 7 Joshi DC Sharma A Prasad S Novel therapeutic agents in clinical trials: emerging approaches in cancer therapy Discov Oncol 2024 15 1 342 39127974 10.1007/s12672-024-01195-7 PMC11317456 8 Zhang L Lu Q Chang C Epigenetics in Health and Disease Adv Exp Med Biol 2020 1253 3 55 32445090 10.1007/978-981-15-3449-2_1 9 Mathur R Jha NK Saini G Epigenetic factors in breast cancer therapy Front Genet 2022 13 886487 36212140 10.3389/fgene.2022.886487 PMC9539821 10 Chen W Dong L Wei C Role of epigenetic regulation in diminished ovarian reserve J Assist Reprod Genet 2025 42 2 389 403 39644448 10.1007/s10815-024-03301-8 PMC11871224 11 Li W Wu H Sui S Targeting Histone Modifications in Breast Cancer: A Precise Weapon on the Way Front Cell Dev Biol 2021 9 736935 34595180 10.3389/fcell.2021.736935 PMC8476812 12 Thakur C Qiu Y Fu Y Epigenetics and environment in breast cancer: New paradigms for anti-cancer therapies Front Oncol 2022 12 971288 36185256 10.3389/fonc.2022.971288 PMC9520778 13 Yao W Wang T Huang F p300/CBP as a Key Nutritional Sensor for Hepatic Energy Homeostasis and Liver Fibrosis Biomed Res Int 2018 2018 8168791 29862292 10.1155/2018/8168791 PMC5976926 14 Abballe L Miele E Epigenetic modulators for brain cancer stem cells: Implications for anticancer treatment World J Stem Cells 2021 13 7 670 684 34367473 10.4252/wjsc.v13.i7.670 PMC8316861 15 Kumar R Paul A M Rameshwar P Epigenetic Dysregulation at the Crossroad of Women's Cancer Cancers (Basel) 2019 11 8 1193 31426393 10.3390/cancers11081193 PMC6721458 16 Pramanik SD Kumar Halder A Mukherjee U Potential of histone deacetylase inhibitors in the control and regulation of prostate, breast and ovarian cancer Front Chem 2022 10 948217 36034650 10.3389/fchem.2022.948217 PMC9411967 17 Messier T L Gordon J A Boyd J R Histone H3 lysine 4 acetylation and methylation dynamics define breast cancer subtypes Oncotarget 2016 7 5 5094 109 26783963 10.18632/oncotarget.6922 PMC4868673 18 Guo P Chen W Li H The Histone Acetylation Modifications of Breast Cancer and their Therapeutic Implications Pathol Oncol Res 2018 24 4 807 813 29948617 10.1007/s12253-018-0433-5 19 Ning B Li W Zhao W Targeting epigenetic regulations in cancer Acta Biochim Biophys Sin (Shanghai) 2016 48 1 97 109 26508480 10.1093/abbs/gmv116 PMC4689160 20 McCornack C Woodiwiss T Hardi A The function of histone methylation and acetylation regulators in GBM pathophysiology Front Oncol 2023 13 1144184 37205197 10.3389/fonc.2023.1144184 PMC10185819 21 Ohguchi H Hideshima T Anderson KC The biological significance of histone modifiers in multiple myeloma: clinical applications Blood Cancer J 2018 8 9 83 30190472 10.1038/s41408-018-0119-y PMC6127133 22 Marvalim C Datta A Lee SC Role of p53 in breast cancer progression: An insight into p53 targeted therapy Theranostics 2023 13 4 1421 1442 36923534 10.7150/thno.81847 PMC10008729 23 Majer AD Hua X Katona BW Menin in Cancer Genes (Basel) 2024 15 9 1231 39336822 10.3390/genes15091231 PMC11431421 24 Xu C Xu Q Yang H H3K27 Acetylation-Activated GLDC Accelerated the Advancement of Oral Squamous Cell Carcinoma by Suppressing the p53 Signaling Pathway Environ Toxicol 2025 40 1 140 151 39415627 10.1002/tox.24379 25 Tay JY Ho JX Cheo FF The Tumour Microenvironment and Epigenetic Regulation in BRCA1 Pathogenic Variant-Associated Breast Cancers Cancers (Basel) 2024 16 23 3910 39682099 10.3390/cancers16233910 PMC11639800 26 Gorodetska I Lukiyanchuk V Peitzsch C BRCA1 and EZH2 cooperate in regulation of prostate cancer stem cell phenotype Int J Cancer 2019 145 11 2974 2985 30968962 10.1002/ijc.32323 27 Judes G Dagdemir A Karsli-Ceppioglu S H3K4 acetylation, H3K9 acetylation and H3K27 methylation in breast tumor molecular subtypes Epigenomics 2016 8 7 909 24 27424567 10.2217/epi-2016-0015 28 Hu X Chen LF Pinning Down the Transcription: A Role for Peptidyl-Prolyl cis-trans Isomerase Pin1 in Gene Expression Front Cell Dev Biol 2020 8 179 32266261 10.3389/fcell.2020.00179 PMC7100383 29 Saygin C Godley LA Genetics of Myelodysplastic Syndromes Cancers (Basel) 2021 13 14 3380 34298596 10.3390/cancers13143380 PMC8304604 30 Tommasini D Fox R Ngo KJ Alterations in oligodendrocyte transcriptional networks reveal region-specific vulnerabilities to neurological disease iScience 2023 26 4 106358 36994077 10.1016/j.isci.2023.106358 PMC10040735 31 Ismail IH McDonald D Strickfaden H A small molecule inhibitor of polycomb repressive complex 1 inhibits ubiquitin signaling at DNA double-strand breaks J Biol Chem 2013 288 37 26944 54 23902761 10.1074/jbc.M113.461699 PMC3772243 32 Hao X Luo H Krawczyk M DNA methylation markers for diagnosis and prognosis of common cancers Proc Natl Acad Sci U S A 2017 114 28 7414 7419 28652331 10.1073/pnas.1703577114 PMC5514741 33 Liu Y Leng P Liu Y Crosstalk between Methylation and ncRNAs in Breast Cancer: Therapeutic and Diagnostic Implications Int J Mol Sci 2022 23 24 15759 36555400 10.3390/ijms232415759 PMC9779155 34 Schmitz RJ Lewis ZA Goll MG DNA Methylation: Shared and Divergent Features across Eukaryotes Trends Genet 2019 35 11 818 827 31399242 10.1016/j.tig.2019.07.007 PMC6825889 35 Zhao J Cheng G Liu J Combination of intensity modulated radiotherapy followed treatment with p38 MAPK activation inhibitor inhibits the proliferation of MCF-7 breast cancer cells Saudi J Biol Sci 2018 25 1 10 14 29379349 10.1016/j.sjbs.2017.01.061 PMC5775077 36 Hum M Lee ASG DNA methylation in breast cancer: early detection and biomarker discovery through current and emerging approaches J Transl Med 2025 23 1 465 40269936 10.1186/s12967-025-06495-2 PMC12020129 37 Stastny I Zubor P Kajo K Aberrantly Methylated cfDNA in Body Fluids as a Promising Diagnostic Tool for Early Detection of Breast Cancer Clin Breast Cancer 2020 20 6 e711 e722 32792225 10.1016/j.clbc.2020.05.009 38 Khakpour G Noruzinia M Izadi P Methylomics of breast cancer: Seeking epimarkers in peripheral blood of young subjects Tumour Biol 2017 39 3 1010428317695040 28349825 10.1177/1010428317695040 39 Tang Q Cheng J Cao X Blood-based DNA methylation as biomarker for breast cancer: a systematic review Clinical Epigenetics 2016 8 1 115 27895805 10.1186/s13148-016-0282-6 PMC5109688 40 Nguyen VTC Nguyen TH Doan NNT Multimodal analysis of methylomics and fragmentomics in plasma cell-free DNA for multi-cancer early detection and localization Elife 2023 12 RP89083 37819044 10.7554/eLife.89083 PMC10567114 41 Lung DK Reese RM Alarid ET Intrinsic and Extrinsic Factors Governing the Transcriptional Regulation of ESR1 Horm Cancer 2020 11 3-4 129 147 32592004 10.1007/s12672-020-00388-0 PMC7384552 42 Sheng X Guo Y Lu Y Prognostic role of methylated GSTP1, p16, ESR1 and PITX2 in patients with breast cancer: A systematic meta-analysis under the guideline of PRISMA Medicine (Baltimore) 2017 96 28 e7476 28700487 10.1097/MD.0000000000007476 PMC5515759 43 Treiber T Treiber N Meister G Publisher Correction: Regulation of microRNA biogenesis and its crosstalk with other cellular pathways Nat Rev Mol Cell Biol 2019 20 5 321 10.1038/s41580-019-0106-6 30728477 44 Shah V Shah J Recent trends in targeting miRNAs for cancer therapy J Pharm Pharmacol 2020 72 12 1732 1749 32783235 10.1111/jphp.13351 45 Caetano S Garcia AR Figueira I MEF2C and miR-194-5p: New Players in Triple Negative Breast Cancer Tumorigenesis Int J Mol Sci 2023 24 18 14297 37762600 10.3390/ijms241814297 PMC10531597 46 Abdi J Jian H Chang H Role of micro-RNAs in drug resistance of multiple myeloma Oncotarget 2016 7 37 60723 60735 27494872 10.18632/oncotarget.11032 PMC5312415 47 Bai W Peng H Zhang J LINC00589-dominated ceRNA networks regulate multiple chemoresistance and cancer stem cell-like properties in HER2(+) breast cancer NPJ Breast Cancer 2022 8 1 115 36309503 10.1038/s41523-022-00484-0 PMC9617889 48 Shibuya N Kakeji Y Shimono Y MicroRNA-93 targets WASF3 and functions as a metastasis suppressor in breast cancer Cancer Sci 2020 111 6 2093 2103 32307765 10.1111/cas.14423 PMC7293106 49 Ahmed R Samanta S Banerjee J Modulatory role of miRNAs in thyroid and breast cancer progression and insights into their therapeutic manipulation Curr Res Pharmacol Drug Discov 2022 3 100131 36568259 10.1016/j.crphar.2022.100131 PMC9780070 50 Mussell A Shen H Chen Y USP1 Regulates TAZ Protein Stability Through Ubiquitin Modifications in Breast Cancer Cancers (Basel) 2020 12 11 3090 33114077 10.3390/cancers12113090 PMC7690829 51 Zhang L Lin Y Zhang X Research progress of exosomes in orthopedics Front Genet 2022 13 915141 36081990 10.3389/fgene.2022.915141 PMC9445804 52 Cheng W Xiao X Liao Y Conducive target range of breast cancer: Hypoxic tumor microenvironment Front Oncol 2022 12 978276 36226050 10.3389/fonc.2022.978276 PMC9550190 53 Lai WKM Pugh BF Understanding nucleosome dynamics and their links to gene expression and DNA replication Nat Rev Mol Cell Biol 2017 18 9 548 562 28537572 10.1038/nrm.2017.47 PMC5831138 54 Nodelman IM Bowman GD Biophysics of Chromatin Remodeling Annu Rev Biophys 2021 50 73 93 33395550 10.1146/annurev-biophys-082520-080201 PMC8428145 55 Do SI Yoon G Kim HS Increased Brahma-related Gene 1 Expression Predicts Distant Metastasis and Shorter Survival in Patients with Invasive Ductal Carcinoma of the Breast Anticancer Res 2016 36 9 4873 82 27630343 10.21873/anticanres.11051 56 Vanaja GR Ramulu HG Kalle AM Overexpressed HDAC8 in cervical cancer cells shows functional redundancy of tubulin deacetylation with HDAC6 Cell Commun Signal 2018 16 1 20 29716651 10.1186/s12964-018-0231-4 PMC5930436 57 Gu S Hou Y Dovat K Synergistic effect of HDAC inhibitor Chidamide with Cladribine on cell cycle arrest and apoptosis by targeting HDAC2/c-Myc/RCC1 axis in acute myeloid leukemia Exp Hematol Oncol 2023 12 1 23 36849955 10.1186/s40164-023-00383-5 PMC9972767 58 Parveen R Harihar D Chatterji BP Recent histone deacetylase inhibitors in cancer therapy Cancer 2023 129 21 3372 3380 37560925 10.1002/cncr.34974 59 Liu S Zou Q Chen JP Targeting enhancer reprogramming to mitigate MEK inhibitor resistance in preclinical models of advanced ovarian cancer J Clin Invest 2021 131 20 e145035 34464356 10.1172/JCI145035 PMC8516457 60 Song X Wu X Yang J Effect of histone deacetylases on pancreatic physiology and pathology: a review Int J Biol Macromol 2025 318 Pt 1 144837 40460952 10.1016/j.ijbiomac.2025.144837 61 Mustafa NM Mustafa MT Abushanab AK Efficacy and safety of entinostat plus exemestane in hormone receptor-positive breast cancer: a systematic review meta-analysis of randomized controlled trials Breast Cancer Res Treat 2025 212 3 417 426 40448813 10.1007/s10549-025-07737-z 62 Wang M Chen Y Tian L Vascular Normalization Augments the Anti-tumor Efficacy of Combined HDAC Inhibitor with Immunotherapy in Solid Tumors Cancer Discovery 2025 15 9 1883 1904 40452600 10.1158/2159-8290.CD-24-1033 63 Shi Z Liu M Zhang X A novel selenium analog of HDACi-based twin drug induces apoptosis and cell cycle arrest via CDC25A to improve prostate cancer therapy Theranostics 2024 14 9 3565 3582 38948069 10.7150/thno.92119 PMC11209715 64 Cai X Sun R Yang L Proteomic analysis reveals modulation of key proteins in follicular thyroid cancer progression Chin Med J (Engl) 2025 10.1097/CM9.0000000000003645 40394764 65 Xu X Li X Zhao Y Immunomodulatory Effects of Histone Deacetylation Inhibitors in Graft-vs.-Host Disease After Allogeneic Stem Cell Transplantation Front Immunol 2021 12 641910 33732262 10.3389/fimmu.2021.641910 PMC7959724 66 Westheim AJF Stoffels LM Dubois LJ The Modulatory Effects of Fatty Acids on Cancer Progression Biomedicines 2023 11 2 280 36830818 10.3390/biomedicines11020280 PMC9953116 67 Yuksel B Deveci Ozkan A Aydın D Evaluation of the antioxidative and genotoxic effects of sodium butyrate on breast cancer cells Saudi J Biol Sci 2022 29 3 1394 1401 35280546 10.1016/j.sjbs.2021.12.061 PMC8913555 68 Xu B Zhang Q Hu X Entinostat, a class I selective histone deacetylase inhibitor, plus exemestane for Chinese patients with hormone receptor-positive advanced breast cancer: A multicenter, randomized, double-blind, placebo-controlled, phase 3 trial Acta Pharm Sin B 2023 13 5 2250 2258 37250148 10.1016/j.apsb.2023.02.001 PMC10213795 69 Das C Bhattacharya A Adhikari S A prismatic view of the epigenetic-metabolic regulatory axis in breast cancer therapy resistance Oncogene 2024 43 23 1727 1741 38719949 10.1038/s41388-024-03054-9 PMC11161412 70 Sharma P Abramson V G O'Dea A Romidepsin (HDACi) plus cisplatin and nivolumab triplet combination in patients with metastatic triple negative breast cancer (mTNBC) Journal of Clinical Oncology 2021 39 15_suppl 1076 1076 71 Pojani E Barlocco D Romidepsin (FK228), A Histone Deacetylase Inhibitor and its Analogues in Cancer Chemotherapy Curr Med Chem 2021 28 7 1290 1303 32013816 10.2174/0929867327666200203113926 72 Thang NX Yoo S La H Epigenetic Factors as Etiological Agents, Diagnostic Markers, and Therapeutic Targets for Luminal Breast Cancer Biomedicines 2022 10 4 748 35453496 10.3390/biomedicines10040748 PMC9031900 73 Sellars E Savguira M Wu J A high-throughput approach to identify BRCA1-downregulating compounds to enhance PARP inhibitor sensitivity iScience 2024 27 7 110180 38993666 10.1016/j.isci.2024.110180 PMC11238136 74 Wang J Shen F Liu F Histone Modifications in Acute Kidney Injury Kidney Dis (Basel) 2022 8 6 466 477 36590679 10.1159/000527799 PMC9798838 75 Kaur J Daoud A Eblen ST Targeting Chromatin Remodeling for Cancer Therapy Curr Mol Pharmacol 2019 12 3 215 229 30767757 10.2174/1874467212666190215112915 PMC6875867 76 Elshazly AM Gewirtz DA An overview of resistance to Human epidermal growth factor receptor 2 (Her2) targeted therapies in breast cancer Cancer Drug Resist 2022 5 2 472 486 35800378 10.20517/cdr.2022.09 PMC9255238 77 Bao Y Oguz G Lee W C EZH2-mediated PP2A inactivation confers resistance to HER2-targeted breast cancer therapy Nat Commun 2020 11 1 5878 33208750 10.1038/s41467-020-19704-x PMC7674491 78 Vougiouklakis T Bernard BJ Nigam N Clinicopathologic significance of protein lysine methyltransferases in cancer Clin Epigenetics 2020 12 1 146 33050946 10.1186/s13148-020-00897-3 PMC7557092 79 Huang H Li H Zhao T TSPAN1-elevated FAM110A promotes pancreatic cancer progression by transcriptionally regulating HIST1H2BK J Cancer 2022 13 3 906 917 35154458 10.7150/jca.66404 PMC8824879 80 Zhao Z Feng L Peng X Role of histone methyltransferase SETDB1 in regulation of tumourigenesis and immune response Front Pharmacol 2022 13 1073713 36582533 10.3389/fphar.2022.1073713 PMC9793902 81 Wang X Cao C Tan X SETD8, a frequently mutated gene in cervical cancer, enhances cisplatin sensitivity by impairing DNA repair Cell Biosci 2023 13 1 107 37308924 10.1186/s13578-023-01054-y PMC10262521 82 Neeli PK Sahoo S Karnewar S DOT1L regulates MTDH-mediated angiogenesis in triple-negative breast cancer: intermediacy of NF-κB-HIF1α axis FEBS J 2023 290 2 502 520 36017623 10.1111/febs.16605 83 Chen MK Efficacy of PARP inhibition combined with EZH2 inhibition depends on BRCA mutation status and microenvironment in breast cancer FEBS J 2021 288 9 2884 2887 33570247 10.1111/febs.15730 PMC8096666 84 Zhang L Zhang X Shi Y Role and potential therapeutic value of histone methyltransferases in drug resistance mechanisms in lung cancer Front Oncol 2024 14 1376916 38525426 10.3389/fonc.2024.1376916 PMC10957659 85 Yang Y Luan Y Feng Q Epigenetics and Beyond: Targeting Histone Methylation to Treat Type 2 Diabetes Mellitus Front Pharmacol 2021 12 807413 35087408 10.3389/fphar.2021.807413 PMC8788853 86 Yang J Talibov VO Peintner S Macrocyclic Peptides Uncover a Novel Binding Mode for Reversible Inhibitors of LSD1 ACS Omega 2020 5 8 3979 3995 32149225 10.1021/acsomega.9b03493 PMC7057333 87 Yin F Hu Y Cao X JmjC domain-containing histone demethylase gene family in Chinese cabbage: Genome-wide identification and expressional profiling PLoS One 2024 19 11 e0312798 39546552 10.1371/journal.pone.0312798 PMC11567544 88 Hu X Xiang D Xie Y LSD1 suppresses invasion, migration and metastasis of luminal breast cancer cells via activation of GATA3 and repression of TRIM37 expression Oncogene 2019 38 44 7017 7034 31409898 10.1038/s41388-019-0923-2 PMC6823153 89 Liu J Feng J Li L Arginine methylation-dependent LSD1 stability promotes invasion and metastasis of breast cancer EMBO Rep 2020 21 2 e48597 31833203 10.15252/embr.201948597 PMC7001506 90 Cuyàs E Gumuzio J Verdura S The LSD1 inhibitor iadademstat (ORY-1001) targets SOX2-driven breast cancer stem cells: a potential epigenetic therapy in luminal-B and HER2-positive breast cancer subtypes Aging (Albany NY) 2020 12 6 4794 4814 32191225 10.18632/aging.102887 PMC7138538 91 Orouji E Utikal J Tackling malignant melanoma epigenetically: histone lysine methylation Clin Epigenetics 2018 10 1 145 30466474 10.1186/s13148-018-0583-z PMC6249913 92 McCann TS Sobral LM Self C Biology and targeting of the Jumonji-domain histone demethylase family in childhood neoplasia: a preclinical overview Expert Opin Ther Targets 2019 23 4 267 280 30759030 10.1080/14728222.2019.1580692 PMC6509558 93 Li CY Wang W Leung CH KDM5 family as therapeutic targets in breast cancer: Pathogenesis and therapeutic opportunities and challenges Mol Cancer 2024 23 1 109 38769556 10.1186/s12943-024-02011-0 PMC11103982 94 Das P Taube JH Regulating Methylation at H3K27: A Trick or Treat for Cancer Cell Plasticity Cancers (Basel) 2020 12 10 2792 33003334 10.3390/cancers12102792 PMC7600873 95 Taube JH Sphyris N Johnson KS The H3K27me3-demethylase KDM6A is suppressed in breast cancer stem-like cells, and enables the resolution of bivalency during the mesenchymal-epithelial transition Oncotarget 2017 8 39 65548 65565 29029452 10.18632/oncotarget.19214 PMC5630352 96 Wapenaar H Dekker FJ Histone acetyltransferases: challenges in targeting bi-substrate enzymes Clin Epigenetics 2016 8 59 27231488 10.1186/s13148-016-0225-2 PMC4881052 97 McCullough CE Marmorstein R Molecular Basis for Histone Acetyltransferase Regulation by Binding Partners, Associated Domains, and Autoacetylation ACS Chem Biol 2016 11 3 632 642 26555232 10.1021/acschembio.5b00841 PMC5067162 98 Li F Yan W Dong W PNSC928, a plant-derived compound, specifically disrupts CtBP2-p300 interaction and reduces inflammation in mice with acute respiratory distress syndrome Biol Direct 2024 19 1 48 38902802 10.1186/s13062-024-00491-0 PMC11191317 99 Jiang Y Han L Yang J Identification of a novel immune checkpoint molecule V-set immunoglobulin domain-containing 4 that leads to impaired immunity infiltration in pancreatic ductal adenocarcinoma Cancer Immunol Immunother 2023 72 8 2701 2716 37097516 10.1007/s00262-023-03438-y PMC10361881 100 Kim E Zucconi BE Wu M MITF Expression Predicts Therapeutic Vulnerability to p300 Inhibition in Human Melanoma Cancer Res 2019 79 10 2649 2661 30910803 10.1158/0008-5472.CAN-18-2331 PMC6522293 101 van den Bosch T Boichenko A Leus NGJ The histone acetyltransferase p300 inhibitor C646 reduces pro-inflammatory gene expression and inhibits histone deacetylases Biochem Pharmacol 2016 102 130 140 26718586 10.1016/j.bcp.2015.12.010 PMC4871277 102 Wu J Zhu H Wu J Inhibition of N-acetyltransferase 10 using remodelin attenuates doxorubicin resistance by reversing the epithelial-mesenchymal transition in breast cancer Am J Transl Res 2018 10 1 256 264 29423010 PMC5801363 103 Correa LO Jordan MS Carty SA DNA Methylation in T-Cell Development and Differentiation Crit Rev Immunol 2020 40 2 135 156 32749092 10.1615/CritRevImmunol.2020033728 PMC8048391 104 Majchrzak-Celińska A Warych A Szoszkiewicz M Novel Approaches to Epigenetic Therapies: From Drug Combinations to Epigenetic Editing Genes (Basel) 2021 12 2 208 33572577 10.3390/genes12020208 PMC7911730 105 Fàbrega C Clua A Eritja R Oligonucleotides Carrying Nucleoside Antimetabolites as Potential Prodrugs Curr Med Chem 2023 30 11 1304 1319 34844535 10.2174/0929867328666211129124039 PMC11497139 106 Suraweera A O'Byrne KJ Richard DJ Epigenetic drugs in cancer therapy Cancer Metastasis Rev 2025 44 1 37 40011240 10.1007/s10555-025-10253-7 PMC11865116 107 Montalvo-Casimiro M González-Barrios R Meraz-Rodriguez MA Epidrug Repurposing: Discovering New Faces of Old Acquaintances in Cancer Therapy Front Oncol 2020 10 605386 33312959 10.3389/fonc.2020.605386 PMC7708379 108 Bataller A Sasaki K Urrutia S Oral decitabine cedazuridine with and without venetoclax in higher-risk myelodysplastic syndromes or chronic myelomonocytic leukemia: a propensity score-matched study Blood Cancer J 2025 15 1 50 40164584 10.1038/s41408-025-01245-5 PMC11958769 109 Pasvolsky O Saliba RM Popat UR Azacitidine Post-transplant Maintenance Improves Disease Progression in High-Risk Acute Myeloid Leukemia and Myelodysplastic Syndrome Clin Lymphoma Myeloma Leuk 2024 24 5 e196 e204 38403505 10.1016/j.clml.2024.01.012 110 Ben-Kasus T Ben-Zvi Z Marquez VE Metabolic activation of zebularine, a novel DNA methylation inhibitor, in human bladder carcinoma cells Biochem Pharmacol 2005 70 1 121 133 15885659 10.1016/j.bcp.2005.04.010 111 Yap ZH Kong WY Azeez AR Anti-Cancer Effects of Epigenetics Drugs Scriptaid and Zebularine in Human Breast Adenocarcinoma Cells Anticancer Agents Med Chem 2022 22 8 1582 1591 34102995 10.2174/1871520621666210608103251 112 Zhang Z Wang G Li Y Recent progress in DNA methyltransferase inhibitors as anticancer agents Front Pharmacol 2022 13 1072651 37077808 10.3389/fphar.2022.1072651 PMC10107375 113 Pechalrieu D Etievant C Arimondo PB DNA methyltransferase inhibitors in cancer: From pharmacology to translational studies Biochem Pharmacol 2017 129 1 13 27956110 10.1016/j.bcp.2016.12.004 114 Mukohara T Park YH Sommerhalder D Inhibition of lysine acetyltransferase KAT6 in ER+HER2- metastatic breast cancer: a phase 1 trial Nat Med 2024 30 8 2242 2250 38824244 10.1038/s41591-024-03060-0 PMC11333285 115 Chen D Chen X Yang M H3K36me2 methyltransferase NSD2/WHSC1 promotes triple-negative breast cancer metastasis via activation of ULK1-dependent autophagy Autophagy 2025 21 8 1824 1842 40097917 10.1080/15548627.2025.2479995 PMC12283020 116 Huang H Hu J Maryam A Defining super-enhancer landscape in triple-negative breast cancer by multiomic profiling Nat Commun 2021 12 1 2242 33854062 10.1038/s41467-021-22445-0 PMC8046763 117 Xiong X Zheng L W Ding Y Breast cancer: pathogenesis and treatments Signal Transduct Target Ther 2025 10 1 49 39966355 10.1038/s41392-024-02108-4 PMC11836418 Figure 1 Various epigenetic alterations in breast cancer. Figure 2 Histone targeting inhibitors agents exert their anti-neoplastic effects in breast cancer by specifically inhibiting various classes of histone-modifying enzymes. ",
  "metadata": {
    "Title of this paper": "Breast cancer: pathogenesis and treatments",
    "Journal it was published in:": "Journal of Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491166/"
  }
}