{
  "title": "Paper_882",
  "abstract": "pmc Semin Reprod Med Semin Reprod Med 3405 thiemesd Seminars in Reproductive Medicine 1526-8004 1526-4564 pmc-is-collection-domain yes pmc-collection-title Thieme Open Access PMC12488262 PMC12488262.1 12488262 12488262 40368386 10.1055/s-0045-1809040 SRM-D-24-00037 1 Review Article Common Mistakes in Musculoskeletal Imaging Guest Editors, James F. Griffith, MD, MRCP, FRCR, FHKCR, FHKAM and Filip M. Vanhoenacker, MD, PhD The Impact of Radiotherapy on the Uterus and Its Implications for Pregnancy http://orcid.org/0000-0003-0497-3814 van der Kooi Anne-Lotte L.F. MD, PhD 1 van Dorp Wendy MD, PhD 1 1 Division of Reproductive Endocrinology and Infertility, Department of Obstetrics and Gynecology, Rotterdam, The Netherlands Address for correspondence Division of Reproductive Endocrinology and Infertility, Department of Obstetrics and Gynecology Erasmus MC, PO Box 2040, 3000 CA Rotterdam The Netherlands avanderkooi@gmail.com 14 5 2025 3 2025 43 1 498127 16 22 01 05 2025 02 10 2025 03 10 2025 The Author(s). This is an open access article published by Thieme under the terms of the Creative Commons Attribution License, permitting unrestricted use, distribution, and reproduction so long as the original work is properly cited. ( https://creativecommons.org/licenses/by/4.0/ 2025 The Author(s). https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use,\ndistribution, and reproduction in any medium, provided the original work is properly cited. Radiotherapy is an effective treatment for various cancers, but it can cause significant side effects on various organ systems, including the reproductive organs, which is a major concern for women of reproductive age. A well-known long-term effect of oncological treatment is premature ovarian insufficiency. Another critical but sometimes overlooked organ at risk in female cancer survivors is the uterus. This review focuses on the impact of radiotherapy on uterine physiology, highlighting key issues such as the development of fibrosis and loss of elasticity, vascular damage, and hormonal disruption, all of which can compromise uterine function. These changes can negatively impact fertility and pregnancy outcomes, such as miscarriage, preterm birth, and low birth weight. Limited evidence is also available suggesting that radiotherapy may affect endometrial receptivity and contribute to abnormal placentation. We conclude by discussing strategies aimed at mitigating the damage caused by radiotherapy, such as fertility-preserving treatments and hormonal interventions. A thorough understanding of these effects is essential for healthcare providers to offer informed support to women who wish to maintain their fertility and have children following cancer treatment. Keywords cancer radiotherapy uterus pregnancy survivorship pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Radiotherapy is a well-established treatment modality for various cancers, including those affecting the pelvic region, such as cervical, ovarian, and endometrial cancers. While effective in targeting malignant cells, radiation therapy often carries significant side effects, particularly when the treatment field involves the reproductive organs. 1 A well-known long-term effect of oncological treatment is premature ovarian insufficiency (POI). 2 Radiotherapy and Uterine Physiology Radiotherapy works by delivering high doses of ionizing radiation to kill cancerous cells, but this can also affect healthy surrounding tissues. The uterus, when exposed to radiation during the treatment of pelvic cancers, undergoes significant changes that can impair its normal physiological function. 3 Fibrosis and Loss of Elasticity One of the most significant consequences of radiotherapy is the induction of fibrosis in the uterine tissues. Fibrosis refers to the excessive formation of fibrous connective tissue, resulting from the inflammatory response initiated by radiation exposure. The radiation causes damage to the cellular DNA and disrupts normal tissue repair mechanisms, leading to the deposition of collagen and other extracellular matrix proteins. 3 Already in 1999, uterine volume was shown to be decreased in 12 pediatric cancer survivors treated with total body irradiation (TBI), prior to which they had received chemotherapy. At adulthood, these women all had below-average small uteri, with a median uterine volume of −2.6 standard deviation scores (range: −6.3 to −0.6), despite the fact that 8 of the 12 had received HRT. 4 5 p 6 7 7 The level of fibrosis correlates with the radiation dose, with higher doses resulting in more pronounced fibrotic changes. 7 8 4 Vascular Damage and Ischemia Radiotherapy can also lead to damage in the blood vessels supplying the uterus, including the endometrium and myometrium. Healthy vasculature is critical for maintaining an appropriate uterine environment, particularly during pregnancy, when the demand for blood flow increases significantly to support placental function and fetal growth. Radiation can cause endothelial damage, leading to the thickening of blood vessel walls and reduced blood flow to the uterine tissues. 9 Radiotherapy-induced vascular damage can lead to uterine ischemia, which in turn reduces the availability of oxygen and nutrients to the endometrium and myometrium. This ischemic environment may impair the ability of the uterus to support implantation, leading to infertility, recurrent miscarriage, and fetal growth restriction (FGR) in pregnancies that do progress beyond the first trimester. For instance, in the article by Holm et al., 4 p 6 Hormonal Disruption Even if the primary focus of radiotherapy is the direct effect on uterine tissue, it can also disrupt the hormonal environment necessary for maintaining uterine function. More often, radiotherapy will be focused on a specific abdominal organ, and scatter radiation will possibly affect both the uterus and the ovaries. In the case of TBI, both reproductive organs are affected as well. Radiotherapy to areas exposing the ovaries or the hypothalamic–pituitary–ovarian axis can lead to low estrogen and progesterone levels, hormones critical for preparing the endometrium for implantation and maintaining pregnancy. In women who retain some ovarian function postradiotherapy, hormonal insufficiency may still occur, leading to an atrophic endometrium. A thin, underdeveloped endometrial lining is less capable of supporting embryo implantation, which further exacerbates infertility and miscarriage risk. Importantly, hormonal imbalances can contribute to irregular menstrual cycles and anovulation, which can be a sign of POI. As this can go hand in hand with estrogen deprivation, sex hormone replacement therapy should be considered. 2 10 Childhood Cancer Survivors In summary, radiotherapy during childhood, particularly before menarche, significantly increases the risk of impaired uterine function, as outlined earlier. The uterine developmental stage in premenarchal girls seems especially susceptible to radiation-induced damage. While sex hormones may offer some degree of remedy, 7 Fertility Outcomes after Radiotherapy Women of reproductive age undergoing pelvic radiotherapy face significant challenges in preserving fertility and achieving successful pregnancies. The effects of radiotherapy on reproductive potential are multifaceted, involving both direct damage to the uterus and indirect effects on the ovaries and hormonal regulation. The toxicity of radiotherapy on the ovaries and its hormonal effects are not explored in depth, as they fall outside the primary scope of this article, which centers on the uterus. However, in the context of fertility, it is important to address a few key points. Infertility is one of the most significant long-term effects of pelvic radiotherapy. Women who were treated with radiotherapy to which the ovaries were potentially exposed are at an increased risk for developing POI. 11 12 13 2 14 15 16 Pregnancy Outcomes after Radiotherapy Women who conceive after undergoing pelvic radiotherapy are at an increased risk of pregnancy complications, even if fertility is preserved. These complications arise from radiation-induced damage to the uterine structure and vasculature, which could impair the uterus's ability to support a pregnancy ( Fig 1 Fig. 1 Summary of effects of radiotherapy on the uterus. Miscarriage Miscarriage rates are significantly higher in women who have undergone pelvic radiotherapy. The combination of endometrial damage, uterine fibrosis, and poor vascularization makes it difficult for embryos to implant successfully and for pregnancies to progress beyond the first trimester. The definition of miscarriage varied among reported studies, typically encompassing pregnancies that ended before 20 weeks of gestation or, in the context of the British Childhood Cancer Survivor Study, before 24 weeks. Three large cohorts of survivors of pediatric cancer reported increased risks with regard to miscarriage. Relative risks on self-reported miscarriages of 1.73 (1.49–2.00) compared to siblings were reported in the North American Childhood Cancer Survivor Study, 17 18 19 20 Preterm Labor and Birth The loss of elasticity in the uterine wall due to fibrosis can lead to preterm labor. Preterm labor occurs when the uterus begins contracting before the fetus has reached full term, often resulting in the delivery of a premature infant. Preterm birth is associated with various neonatal complications, including respiratory distress, developmental delays, and increased rates of infant mortality. Research shows that women exposed to pelvic radiotherapy are over two times more likely to experience preterm birth compared to the general population. 21 22 23 24 25 18 In addition to the loss of uterine elasticity, preterm labor can also occur due to iatrogenic factors. A large retrospective cohort study conducted in the United States, which included commercially insured cancer survivors, found that the incidence of preterm labor was 14.8% among cancer survivors compared to 12.4% among women without a cancer history (adjusted risk ratio: 1.19, 95% CI: 1.06–1.34). Not surprisingly, cancer survivors exhibited a higher prevalence of maternal comorbidities both prior to and during pregnancy. Approximately 26% of the association between cancer and preterm birth was mediated by these comorbidities. 26 Low Birth Weight and Fetal Growth Restriction Uterine ischemia resulting from vascular damage may restrict blood flow to the fetus, leading to FGR. Babies born with FGR are more likely to have low birth weights and experience complications such as hypoglycemia, difficulty breathing, and long-term developmental issues. An increased risk of FGR after radiotherapy was not detected in one study, 27 23 p p 23 Other studies showed relative risks on low birth weight ranging from 1.38 (95% CI: 1.03–1.85) after any radiotherapy versus controls 28 29 5 All in all, the heightened likelihood of low birth weight and FGR is not merely theoretical; it has been documented in diverse populations across multiple studies. This evidence underscores the real-world implications of these conditions, emphasizing the importance of monitoring and addressing these risks in affected groups. Endometrial Receptivity, Decidualization, and Placental Abnormalities Placental abnormalities, such as placenta previa (where the placenta implants in the lower part of the uterus) and placental abruption (premature detachment of the placenta), are more common in women who have undergone pelvic radiotherapy. These conditions can possibly lead to life-threatening hemorrhage during pregnancy and delivery, placing both the mother and fetus at significant risk. Griffiths et al showed the importance of radiotherapy on the uterus in mouse models. They transferred donor mice's embryos into ovariectomized mice that had been exposed to TBI, and compared their outcome with mice not treated with radiotherapy. Blastocyst attachment, implantation, and cytokines were similar between both groups, but blood-vessel area was significantly reduced in the irradiated mice. The uteri of radiated mice also showed a reduced decidualization response. Decidualization involves the differentiation of endometrial stromal cells into large, round decidual cells. It is hormone-driven and essential for ongoing pregnancy and early placental development. In the radiated mice, transcript levels of the hormonally regulated target gene and key regulator of decidualization Bmp2 30 In a comparative study of oocyte donation outcomes, 142 women previously treated and cured of cancer underwent 333 cycles of oocyte donation, while the control group consisted of 17,844 women who experienced 29,778 cycles. It must be noted that like most retrospective cohort studies, this population consisted of a mix of treatments with often chemotherapy including radiotherapy and also partially chemotherapy without radiotherapy. Subanalysis often yields power problems in these studies. In this Spanish study, the cancer survivors received a higher average number of donated oocytes (11.5) compared to the controls (10.9) ( p p p 31 Placental abnormalities are rarely reported in epidemiological studies. A relatively small Dutch study had found an increased risk in abdominally radiated survivors on postpartum hemorrhage. 32 25 32 29 Mode of Delivery Studies that investigated the risk of emergency cesarean sections following radiotherapy or abdominal radiotherapy reported no significant increase in risk. 25 29 Overall, these studies contribute to a growing body of literature suggesting that while radiotherapy can have various effects on reproductive health, the specific risk of emergency cesarean sections does not seem to be one of them. Further research may continue to explore this relationship, ensuring that pregnant individuals with a history of radiotherapy receive appropriate care and support throughout their pregnancies. Congenital Abnormalities While many have feared the possible mutagenic effects on germ cells, research clearly indicates that radiotherapy imposes no increased risk of congenital abnormalities. A meta-analysis of five studies that had reported incidence numbers of congenital abnormalities after high-risk radiation showed a nonsignificant relative risk of 1.18 (95% CI: 0.77–1.79) 24 32 33 34 Preserving Fertility and Pregnancy Outcomes Given the significant risks associated with pelvic radiotherapy, several strategies have been developed to help women preserve their fertility and improve pregnancy outcomes. 35 Fertility preservation is a critical consideration for women of reproductive age who are about to undergo cancer treatment. Several methods can be employed to protect the ovaries and reduce the impact of radiation on reproductive potential. Cryopreservation Cryopreservation of oocytes, embryos, or ovarian tissue is the standard care for women who wish to preserve their fertility. This technique allows women to undergo assisted reproductive technologies (ARTs), such as in vitro fertilization (IVF), after cancer treatment. While cryopreservation does not protect the uterus from radiation damage, it provides an opportunity for conception if ovarian function is compromised. For prepubertal girls at high risk for POI, cryopreservation of ovarian tissue is the only option as the dormancy of their hypothalamic–pituitary axis still lies dormant, inhibiting the possibility of cryopreservation of oocytes, let alone embryos. 36 37 38 39 Assisted Reproductive Technologies Women who experience infertility or difficulty conceiving postradiotherapy may benefit from ART. IVF is one of the most commonly used methods to assist women in achieving pregnancy. IVF bypasses some of the barriers to natural conception by fertilizing an oocyte outside the body and then implanting the embryo into the uterus. For women with significant uterine damage, surrogacy may also be an option, where a surrogate carries the pregnancy to term using the couple's fertilized embryo. While surrogacy can overcome the limitations of a damaged uterus, it may not be a feasible or accessible option for all patients due to legal, ethical, and possibly financial considerations. Uterine Transposition A more experimental approach is the option of uterine transposition. In a small study of eight patients, uterine transposition at a median age of 30.5 years (range: 19–37) was performed. The uterus was successfully preserved in six patients, accompanied by normal menses, hormonal levels, and vaginal intercourse after treatment. Cervical ischemia was the most common postsurgical complication in three (37.5%) patients. Three patients attempted to conceive, and two (66%) were spontaneously successful and delivered healthy babies at 36 and 38 weeks by cesarean section without complications. 40 Potential Treatment Modalities The study conducted by Bath et al. found that steroid treatment positively influenced uterine volume in women with ovarian failure. Four participants (age range at TBI: 4–14 years) with reduced uterine volume, undetectable blood supply, and an absent endometrium are reported. After 3 months of physiological sex steroid replacement therapy, uterine blood supply and endometrial response were comparable to those in the control group. While uterine volume showed improvement, it remained significantly smaller than that of the controls, and the degree of improvement correlated with the age at which the participants received TBI. Three patients treated prepubertally showed a larger improvement than the one patient treated postpubertally. These findings might suggest that steroid replacement therapy may lead to restore certain uterine functions in this population. 7 10 There is preliminary evidence suggesting that the addition of pentoxifylline and tocopherol (vitamin E) to hormone therapy may have a therapeutic effect on uterine function following radiation exposure. 41 42 Uterine Monitoring and Pregnancy Management For women who conceive after pelvic radiotherapy, close monitoring of the pregnancy is essential to identify and manage potential complications early. Regular ultrasounds can help assess uterine function, placental health, and fetal growth. High-risk pregnancy specialists may also recommend interventions to prevent preterm labor, such as cervical cerclage or the use of progesterone supplements to support the pregnancy. Cardiomyopathy surveillance is advised for all female survivors treated with anthracyclines and chest radiation, preferably preconceptionally or in the first trimester of the pregnancy. 20 In some cases, women with a history of pelvic radiotherapy may require delivery via cesarean section, particularly if placental abnormalities (such as placenta accreta spectrum) are present. This approach minimizes the risk of postpartum hemorrhage and other complications during vaginal delivery. It must be noted, however, that most women will be able to deliver vaginally in a safe matter. A gap in current knowledge remains regarding which patients are exactly at most risk, at what timing induction of labor would possibly be beneficial, and which extensive monitoring is beneficial and cost-effective. Conclusion A well-known long-term effect of oncological treatment is POI, but another critical and sometimes overlooked organ at risk in female cancer survivors is the uterus. The impact of radiotherapy on the uterus is profound, particularly for women prior to or of reproductive age who wish to preserve their fertility and pursue pregnancy posttreatment. Radiotherapy can cause significant damage to the uterine structure and function, including fibrosis, vascular damage, and hormonal disruption. These changes increase the risk of infertility, miscarriage, low birth weight, and other pregnancy complications ( Fig. 1 Advancements in fertility preservation techniques and ARTs have provided hope for women affected by pelvic radiotherapy. However, protecting or preserving oocytes is only one step; the next is protecting the uterus so that it can safely grow an embryo and fetus. Further research is needed to develop more effective ways to protect the uterus from radiation damage and improve pregnancy outcomes for cancer survivors. With continued innovation in cancer treatment and fertility preservation, women can have a better chance of achieving successful pregnancies and maintaining their reproductive autonomy after cancer treatment. It is essential to ensure that pregnant individuals with a history of radiotherapy receive comprehensive care and support throughout their pregnancies. This includes not only regular monitoring of maternal and fetal health but also specialized assessments that take into account the potential effects of previous radiation exposure. Healthcare providers should be well-informed about the unique challenges faced by these individuals, enabling them to offer tailored guidance on managing risks associated with their medical history. Conflict of Interest References 1 Citrin D E Recent developments in radiotherapy N Engl J Med 2017 377 11 1065 1075 28902591 10.1056/NEJMra1608986 2 van Dorp W Mulder R L Kremer L C Recommendations for premature ovarian insufficiency surveillance for female survivors of childhood, adolescent, and young adult cancer: a report from the International Late Effects of Childhood Cancer Guideline Harmonization Group in Collaboration with the PanCareSurFup Consortium J Clin Oncol 2016 34 28 3440 3450 27458300 10.1200/JCO.2015.64.3288 PMC5569686 3 Nguyen H Q To N H Zadigue P Ionizing radiation-induced cellular senescence promotes tissue fibrosis after radiotherapy. A review Crit Rev Oncol Hematol 2018 129 13 26 30097231 10.1016/j.critrevonc.2018.06.012 4 Holm K Nysom K Brocks V Hertz H Jacobsen N Müller J Ultrasound B-mode changes in the uterus and ovaries and Doppler changes in the uterus after total body irradiation and allogeneic bone marrow transplantation in childhood Bone Marrow Transplant 1999 23 03 259 263 10084257 10.1038/sj.bmt.1701569 5 DCOG LATER-VEVO Study Group van de Loo L EXM van den Berg M H Overbeek A Uterine function, pregnancy complications, and pregnancy outcomes among female childhood cancer survivors Fertil Steril 2019 111 02 372 380 30691634 10.1016/j.fertnstert.2018.10.016 6 Beneventi F Locatelli E Giorgiani G Adolescent and adult uterine volume and uterine artery Doppler blood flow among subjects treated with bone marrow transplantation or chemotherapy in pediatric age: a case-control study Fertil Steril 2015 103 02 455 461 25497446 10.1016/j.fertnstert.2014.10.043 7 Bath L E Critchley H O Chambers S E Anderson R A Kelnar C J Wallace W H Ovarian and uterine characteristics after total body irradiation in childhood and adolescence: response to sex steroid replacement Br J Obstet Gynaecol 1999 106 12 1265 1272 10609720 10.1111/j.1471-0528.1999.tb08180.x 8 Rozen G Rogers P Chander S Clinical summary guide: reproduction in women with previous abdominopelvic radiotherapy or total body irradiation Hum Reprod Open 2020 2020 04 hoaa045 33134561 10.1093/hropen/hoaa045 PMC7585646 9 Satyamitra M M DiCarlo A L Taliaferro L Understanding the pathophysiology and challenges of development of medical countermeasures for radiation-induced vascular/endothelial cell injuries: report of a NIAID Workshop, August 20, 2015 Radiat Res 2016 186 02 99 111 27387859 10.1667/RR14436.1 PMC5050526 10 Critchley H O Bath L E Wallace W H Radiation damage to the uterus – review of the effects of treatment of childhood cancer Hum Fertil (Camb) 2002 5 02 61 66 12082209 10.1080/1464727022000198942 11 Barton S E Najita J S Ginsburg E S Infertility, infertility treatment, and achievement of pregnancy in female survivors of childhood cancer: a report from the Childhood Cancer Survivor Study cohort Lancet Oncol 2013 14 09 873 881 23856401 10.1016/S1470-2045(13)70251-1 PMC3845882 12 Sklar C A Mertens A C Mitby P Premature menopause in survivors of childhood cancer: a report from the childhood cancer survivor study J Natl Cancer Inst 2006 98 13 890 896 16818852 10.1093/jnci/djj243 13 DCOG LATER-VEVO Study Group van den Berg M H Overbeek A Lambalk C B Long-term effects of childhood cancer treatment on hormonal and ultrasound markers of ovarian reserve Hum Reprod 2018 33 08 1474 1488 29982673 10.1093/humrep/dey229 14 Anderson R A Mitchell R T Kelsey T W Spears N Telfer E E Wallace W H Cancer treatment and gonadal function: experimental and established strategies for fertility preservation in children and young adults Lancet Diabetes Endocrinol 2015 3 07 556 567 25873571 10.1016/S2213-8587(15)00039-X 15 Wallace W H Thomson A B Kelsey T W The radiosensitivity of the human oocyte Hum Reprod 2003 18 01 117 121 12525451 10.1093/humrep/deg016 16 Im C Lu Z Mostoufi-Moab S Development and validation of age-specific risk prediction models for primary ovarian insufficiency in long-term survivors of childhood cancer: a report from the Childhood Cancer Survivor Study and St Jude Lifetime Cohort Lancet Oncol 2023 24 12 1434 1442 37972608 10.1016/S1470-2045(23)00510-7 PMC10842148 17 Green D M Whitton J A Stovall M Pregnancy outcome of female survivors of childhood cancer: a report from the Childhood Cancer Survivor Study Am J Obstet Gynecol 2002 187 04 1070 1080 12389007 10.1067/mob.2002.126643 18 Haggar F A Pereira G Preen D Holman C D Einarsdottir K Adverse obstetric and perinatal outcomes following treatment of adolescent and young adult cancer: a population-based cohort study PLoS One 2014 9 12 e113292 25485774 10.1371/journal.pone.0113292 PMC4259305 19 Winther J F Boice J D Jr Svendsen A L Frederiksen K Stovall M Olsen J H Spontaneous abortion in a Danish population-based cohort of childhood cancer survivors J Clin Oncol 2008 26 26 4340 4346 18779621 10.1200/JCO.2007.15.2884 PMC2653117 20 van der Kooi A LF Mulder R L Hudson M M Counseling and surveillance of obstetrical risks for female childhood, adolescent, and young adult cancer survivors: recommendations from the International Late Effects of Childhood Cancer Guideline Harmonization Group Am J Obstet Gynecol 2021 224 01 3 15 32502557 10.1016/j.ajog.2020.05.058 21 Madanat-Harjuoja L M Malila N Lähteenmäki P M Boice J D Jr Gissler M Dyba T Preterm delivery among female survivors of childhood, adolescent and young adulthood cancer Int J Cancer 2010 127 07 1669 1679 20054856 10.1002/ijc.25157 PMC2919618 22 Langagergaard V Horvath-Puho E Nørgaard M Nørgård B Sørensen H T Hodgkin's disease and birth outcome: a Danish nationwide cohort study Br J Cancer 2008 98 01 183 188 18059394 10.1038/sj.bjc.6604126 PMC2359687 23 Signorello L B Cohen S S Bosetti C Female survivors of childhood cancer: preterm birth and low birth weight among their children J Natl Cancer Inst 2006 98 20 1453 1461 17047194 10.1093/jnci/djj394 PMC2730161 24 van der Kooi A LF Kelsey T W van den Heuvel-Eibrink M M Laven J SE Wallace W HB Anderson R A Perinatal complications in female survivors of cancer: a systematic review and meta-analysis Eur J Cancer 2019 111 126 137 30849686 10.1016/j.ejca.2019.01.104 25 Melin J Heinävaara S Malila N Tiitinen A Gissler M Madanat-Harjuoja L Adverse obstetric outcomes among early-onset cancer survivors in Finland Obstet Gynecol 2015 126 04 803 810 26348187 10.1097/AOG.0000000000001035 26 Desai M Zhou B Nalawade V Maternal comorbidity and adverse perinatal outcomes in survivors of adolescent and young adult cancer: a cohort study BJOG 2023 130 07 779 789 36655360 10.1111/1471-0528.17380 PMC10401611 27 Anderson C Engel S M Mersereau J E Birth outcomes among adolescent and young adult cancer survivors JAMA Oncol 2017 3 08 1078 1084 28334337 10.1001/jamaoncol.2017.0029 PMC5824217 28 Mueller B A Chow E J Kamineni A Pregnancy outcomes in female childhood and adolescent cancer survivors: a linked cancer-birth registry analysis Arch Pediatr Adolesc Med 2009 163 10 879 886 19805705 10.1001/archpediatrics.2009.112 PMC2758647 29 Reulen R C Bright C J Winter D L Pregnancy and labor complications in female survivors of childhood cancer: the British Childhood Cancer Survivor Study J Natl Cancer Inst 2017 109 11 djx056 28419299 10.1093/jnci/djx056 PMC5409032 30 Griffiths M J Marshall S A Cousins F L Radiotherapy exposure directly damages the uterus and causes pregnancy loss JCI Insight 2023 8 06 e163704 36946464 10.1172/jci.insight.163704 PMC10070119 31 Muñoz E Fernandez I Martinez M Oocyte donation outcome after oncological treatment in cancer survivors Fertil Steril 2015 103 01 205 213 25439848 10.1016/j.fertnstert.2014.09.027 32 Lie Fong S van den Heuvel-Eibrink M M Eijkemans M J Schipper I Hukkelhoven C W Laven J S Pregnancy outcome in female childhood cancer survivors Hum Reprod 2010 25 05 1206 1212 20172864 10.1093/humrep/deq029 33 Seppänen V I Artama M S Malila N K Risk for congenital anomalies in offspring of childhood, adolescent and young adult cancer survivors Int J Cancer 2016 139 08 1721 1730 27280956 10.1002/ijc.30226 34 Winther J F Boice J D Jr Frederiksen K Radiotherapy for childhood cancer and risk for congenital malformations in offspring: a population-based cohort study Clin Genet 2009 75 01 50 56 19021636 10.1111/j.1399-0004.2008.01109.x PMC2697125 35 Donnez J Dolmans M M Fertility preservation in women N Engl J Med 2017 377 17 1657 1665 29069558 10.1056/NEJMra1614676 36 vanderKooi A LF Wallace W HB Fertility preservation in women N Engl J Med 2018 378 04 399 400 10.1056/NEJMc1715731 29372987 37 PanCareLIFE Consortium Mulder R L Font-Gonzalez A Hudson M M Fertility preservation for female patients with childhood, adolescent, and young adult cancer: recommendations from the PanCareLIFE Consortium and the International Late Effects of Childhood Cancer Guideline Harmonization Group Lancet Oncol 2021 22 02 e45 e56 33539753 10.1016/S1470-2045(20)30594-5 38 Raimondo D Raspollini A Bertoldo L Laparoscopic medulla-sparing ovarian tissue biopsy for cryopreservation: step-by-step surgical technique Fertil Steril 2024 122 01 184 186 38492928 10.1016/j.fertnstert.2024.03.011 39 van der Perk M EM van der Kooi A LF van de Wetering M D Oncofertility care for newly diagnosed girls with cancer in a national pediatric oncology setting, the first full year experience from the Princess Máxima Center, the PEARL study PLoS One 2021 16 03 e0246344 33667234 10.1371/journal.pone.0246344 PMC7935241 40 Ribeiro R Baiocchi G Moretti-Marques R Linhares J C Costa C N Pareja R Uterine transposition for fertility and ovarian function preservation after radiotherapy Int J Gynecol Cancer 2023 33 12 1837 1842 37898483 10.1136/ijgc-2023-004723 41 Teh W T Stern C Chander S Hickey M The impact of uterine radiation on subsequent fertility and pregnancy outcomes BioMed Res Int 2014 2014 482968 25165706 10.1155/2014/482968 PMC4140124 42 Krief F Simon C Goldstein R Ellenberg L P Ledee N Efficacy of tocopherol and pentoxifylline combined therapy for women undergoing assisted reproductive treatment with poor endometrial development: a retrospective cohort study on 143 patients Hum Fertil (Camb) 2021 24 05 367 375 31597488 10.1080/14647273.2019.1673906 ",
  "metadata": {
    "Title of this paper": "Efficacy of tocopherol and pentoxifylline combined therapy for women undergoing assisted reproductive treatment with poor endometrial development: a retrospective cohort study on 143 patients",
    "Journal it was published in:": "Seminars in Reproductive Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488262/"
  }
}