{
  "title": "Paper_566",
  "abstract": "pmc Viruses Viruses 1559 viruses viruses Viruses 1999-4915 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474283 PMC12474283.1 12474283 12474283 41012632 10.3390/v17091204 viruses-17-01204 1 Article Identification and Characterization of MmuPV1 Causing Papillomatosis Outbreak in an Animal Research Facility https://orcid.org/0000-0003-2907-4583 Majerciak Vladimir Conceptualization Methodology Formal analysis Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0002-5400-1231 Killoran Kristin E. Methodology Investigation Writing – review & editing 2 https://orcid.org/0000-0003-0309-9520 Yu Lulu Methodology Investigation Writing – review & editing 1 Gotte Deanna Methodology Investigation Writing – review & editing 1 https://orcid.org/0000-0002-6106-3705 Edmondson Elijah Methodology Investigation 3 Breed Matthew W. 2 https://orcid.org/0000-0002-6540-3834 King Renee E. Methodology Investigation Writing – review & editing Funding acquisition 4 https://orcid.org/0009-0008-0622-7923 Roelke-Parker Melody E. Methodology Investigation 2 https://orcid.org/0000-0001-7983-2755 Lambert Paul F. Conceptualization Writing – review & editing Supervision Funding acquisition 4 Kramer Joshua A. Conceptualization Resources Writing – review & editing Supervision Funding acquisition 2 https://orcid.org/0000-0001-5547-7912 Zheng Zhi-Ming Conceptualization Resources Writing – original draft Writing – review & editing Supervision Project administration Funding acquisition 1 * Mymryk Joe S. Academic Editor 1 vladimir.majerciak@nih.gov lulu.yu@nih.gov 2 kristin.killoran@nih.gov mbreed@clemson.edu melody.roelke-parker@nih.gov josh.kramer@nih.gov 3 elijah.edmondson@nih.gov 4 renee.king@wisc.edu plambert@wisc.edu * zhengt@exchange.nih.gov 01 9 2025 9 2025 17 9 497677 1204 28 7 2025 28 8 2025 29 8 2025 01 09 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Mouse papillomavirus (MmuPV1) is the first papillomavirus known to infect laboratory mice, making it an irreplaceable tool for research on papillomaviruses. Despite wide use, standardized techniques for conducting MmuPV1 animal research are lacking. In this report, we describe an unexpected MmuPV1 outbreak causing recurrent papillomatosis in a specific pathogen-free animal research facility. The infected mice displayed characteristic papillomatosis lesions from the muzzles, tails, and feet with histological signs including anisocytosis, epithelial dysplasia, and typical koilocytosis. Etiology studies showed that the papilloma tissues exhibited MmuPV1 infection with expression of viral early and late genes detected by RNA-ISH using MmuPV1 antisense probe to viral E6E7 region and antisense probe to viral L1 region. The viral L1 protein was detected by an anti-MmuPV1 L1 antibody. PCR amplification and cloning of the entire viral genome showed that the origin of the outbreak virus, named MmuPV1 Bethesda strain (GenBank Acc. No. PX123224 MmuPV1 papillomavirus laboratory animal infection PCR viral genome Intramural Research Program of the NIH, National Cancer Institute, Center for Cancer Research ZIA SC 010357 NCI T32CA090217 NIDCD K99DC021983 National Cancer Institute, National Institute of Health HHSN26120150003I This study was supported by the Intramural Research Program of the NIH, National Cancer Institute, Center for Cancer Research (ZIA SC 010357 to Z.-M.Z.). This project was also funded by NCI T32CA090217 and NIDCD K99DC021983 to Renee E. King and with federal funds from the National Cancer Institute, National Institute of Health, under Contract No. HHSN26120150003I. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Papillomaviruses are small non-enveloped, double-stranded circular DNA viruses and infect numerous species of animals, from fish to humans [ 1 2 3 4 4 5 Infections with papillomaviruses are species- and tissue-specific, and, thus, no animals can be infected with any human papillomavirus. However, given the wide range of species-specific viruses, other animal papillomaviruses have been used as HPV surrogates. Historically, bovine papillomavirus (BPV) cow infection and cottontail rabbit papillomavirus (CRPV) rabbit infection were two animal models used to understand papillomavirus infection and pathogenesis [ 6 7 Mus musculus 8 9 10 11 12 13 To date, numerous studies have been conducted using MmuPV1 infection in different experimental settings. In this report, we describe an unanticipated recurrent outbreak of MmuPV1 infection in an animal facility three years after the facility was used for MmuPV1 research. We show the widespread and long persistence of infectious MmuPV1 throughout the animal facility and multiple unintended infections of susceptible animals [ 14 2. Materials and Methods 2.1. Ethical Statement All animals were maintained in accordance with the Guide for the Care and Use of Laboratory Animals in a facility accredited by AAALAC International. Animal use was conducted humanely and approved by the National Cancer Institute-Bethesda’s Animal Care and Use Committee (NCI-ACUC) on an animal protocol ASB-001 titled “Infectious Disease Monitoring in NCI Rodent Facilities” that was approved on 4 August 2021. 2.2. RNA In Situ Hybridization (RNA-ISH) A detailed description of RNA-ISH using RNAscope technology (Advanced Cell Diagnostics or ACD, Newark, CA, USA) can be found in our previous publication [ 4 13 2.3. Indirect Fluorescent Antibody (Ifa) Staining Serial Formalin-Fixed Paraffin-Embedded (FFPE) tissue sections were dually stained for MmuPV1 L1 capsid protein and K14 using the TSA system, as previously described [ 13 2 2 2 2 P36970 https://imagej.net/ij/ 2.4. Total DNA Isolation Total DNA from papilloma tissues was extracted using Quick-DNA Miniprep Plus Kit (Zymo Research, cat. # D4068, Irvine, CA, USA) according to manufacturers’ protocol. Papilloma tissues (~10 mg) were cut into small pieces and treated with proteinase K for 5 h at 55 °C while shaking at 300 rpm. The undigested debris was removed via centrifugation at 12,000× g 2.5. Polymerase Chain Reaction (PCR) PCR amplification was performed in reactions containing 1 × Platinum SuperFi II Green PCR Master Mix (Thermo Fisher Scientific, cat. # 12369010), 100 pmol of primers and ~250 ng of total genomic DNA using 35 amplification cycles with 2–10 min extension time. The primers used for amplification are summarized in Table 1 2.6. Genome Sequence Alignment The original genome sequences were modified such that the first position corresponds to the first nucleotide of E6 open reading frame (ORF). The modified sequences were aligned by Clustal Omega (accessed on 25 June 2025, https://www.ebi.ac.uk/jdispatcher/msa/clustalo 2.7. Cloning of the MmuPV1 Bethesda Strain Genome The full-length MmuPV1 Bethesda strain genome was PCR-amplified from total DNA isolated from papilloma tissues using Platinum SuperFi II Taq polymerase and paired primers summarized in Table 1 Bgl Not https://www.addgene.org/vector-database/1621/ https://www.addgene.org/50005/ Bam E. coli 3. Results 3.1. MmuPV1 Outbreak in an Animal Research Facility Papilloma-bearing mice initially in rooms A1 and A2 and subsequently in room B five months later were identified in a specific-pathogen-free rodent facility, in which experiments using MmuPV1, a virus that can induce papillomas in laboratory mice, had been carried out in another room (room D) under ABSL-2 conditions as recently as three years prior ( Figure 1 Figure 1 14 14 No MmuPV1 was previously used in any of the other affected rooms outside room D. All affected animals with clinical signs were 5–10-month-old immunodeficient mice and imported from different vendors, where there was no previous history of MmuPV1 infection. 3.2. Necropsy Evaluation of Papilloma-Bearing Animals Female athymic NMRI-Foxn1 nu nu n Figure 1 The proliferative lesions observed on the muzzle, tail, and paw were histologically consistent with virus-induced papillomas. One muzzle lesion appeared invasive with evidence of malignant transformation. The H&E staining showed the hyperplastic epidermis composed of epithelial cells that formed papillary projections supported by thin fibrovascular cores ( Figure 2 Figure 2 Additional pathologies observed in these infected mice included mild pneumonia for one mouse characterized by a dorsoventral distribution of vasculitis, inflammatory infiltrates, and type II pneumocyte hyperplasia. Additional inflammatory lesions were observed in the uterus and colon. 3.3. Characterization of MmuPV1 Gene Expression in the Detected Papillomas To identify whether MmuPV1 infection was causing the observed papillomatosis in the mouse muzzles and tails, serial tissue sections from the mouse papillomas were subjected to RNA-FISH detection using antisense RNAscope probes targeting MmuPV1 early (E6/E7) and late (L1/L2) transcripts, which were successfully used to detect MmuPV1 RNAs in our previous reports [ 4 13 Figure 2 15 4 13 Figure 2 Figure 2 In conclusion, the papilloma tissues collected from affected animals not only showed typical histopathological changes associated with papillomavirus infection, but the detection of MmuPV1 RNA transcripts and L1 protein further confirmed MmuPV1 as a causative agent responsible for this recurrent papillomatosis outbreak in the animal facility. Subsequently, we named this causative agent as the MmuPV1 Bethesda strain. 3.4. Tracing the Origin of Outbreak MmuPV1 To trace the origin of the MmuPV1 Bethesda strain causing the recurrent papillomatosis outbreak in the animal facility, the extracted total DNA from a representative muzzle papilloma tissue was examined via five separate overlapping PCR reactions with the primer pairs spanning the entire MmuPV1 genome ( Figure 3 Table 1 Figure 3 NC_014326 10 GU808564 16 PX245442 17 HQ625439 18 PX123224 NC_014326 10 19 PX245442 Figure 3 HQ625439 PX245442 Figure 3 Figure S1 3.5. Cloning of the Outbreak MmuPV1 Genome To clone the MmuPV1 Bethesda strain virus from the affected animals in this outbreak, we amplified the entire viral genome from the collected papilloma tissues using primers (Pr) containing unique restriction enzyme cutting sites (E) and cloned into two corresponding plasmid vectors ( Figure 4 Bgl Not Figure 4 Bam Figure 4 cmv Bam 4. Discussion Animal papillomavirus infections are common. To date, more than 200 species-specific animal papillomavirus types have been reported (accessed on 28 August 2025, https://pave.niaid.nih.gov 7 11 12 In this report, we described an unanticipated recurrent MmuPV1 papillomatosis outbreak in an animal facility. Numerous visible skin lesions characteristic of MmuPV1 infection at various animal anatomical sites were observed in immunocompromised mice highly susceptible to MmuPV1 infection [ 19 20 The molecular analysis of the MmuPV1 Bethesda strain genome sequences revealed its origination from the synthetic MmuPV1 genome (reference sequence NC_014326 9 10 16 GU808564 16 9 10 NC_014326 PX123224 PX245442 17 Figure 3 GU808564 NC_014326 16 17 GU808564 PX245442 21 22 23 NC_014326 HQ625439 18 PX245442 NC_014326 PX245442 Supplemental Figure S1 24 The unexpected recurrent MmuPV1 outbreak in a specific pathogen-free animal facility, caused by the virus used in studies conducted three years earlier, was surprising, as no similar cases have been reported in the literature. Our observation and systemic investigation suggest that MmuPV1 can survive and persist in a contaminated environment for extended periods, raising important implications for biosecurity and facility decontamination protocols. This is consistent with previous research demonstrating the high stability of MmuPV1 in the cornified layer and its resistance to many widely used disinfectants and cleaning solutions [ 25 26 27 14 Therefore, our study strongly advocates the development of strict guidelines for the experimental use of MmuPV1, including proper prevention, monitoring and elimination of unintended spread of MmuPV1 infection among laboratory animals. The naturally occurring nucleotide substitutions in the MmuPV1 genome described in this report may represent a traceable molecular marker to identify the source of the infection. Acknowledgments We would like to thank Theresa Albers from Charles River Laboratories for gross images from necropsy. The contributions of the NIH author(s) were made as part of their official duties as NIH federal employees in compliance with agency policy requirements and thus the works of the United States Government. However, the findings and conclusions presented in this paper are those of the author(s) and do not necessarily reflect the views of the NIH or the U.S. Department of Health and Human Services. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/v17091204/s1 PX123224 NC_014326 PX245442 HQ625439 Author Contributions Conceptualization, V.M., Z.-M.Z., P.F.L. and J.A.K.; methodology and investigation, V.M., K.E.K., L.Y., D.G., E.E., M.W.B., R.E.K. and M.E.R.-P.; resources, P.F.L., J.A.K. and Z.-M.Z.; writing: original draft preparation, V.M. and Z.-M.Z.; writing, review and editing, V.M., K.E.K., L.Y., D.G., R.E.K., P.F.L., J.A.K. and Z.-M.Z.; supervision, P.F.L., J.A.K. and Z.-M.Z.; project administration, J.A.K. and Z.-M.Z.; funding acquisition, R.E.K., P.F.L., J.A.K. and Z.-M.Z. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Guide for the Care and Use of Laboratory Animals in a facility accredited by AAALAC International. Animal use was conducted humanely and approved by the National Cancer Institute-Bethesda’s Animal Care and Use Committee (NCI-ACUC) on an animal protocol ASB-001 titled “Infectious Disease Monitoring in NCI Rodent Facilities” that was approved on 4 August 2021. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding authors. The genomic sequence of MmuPV1 Bethesda strain is accessible at the NCBI GenBank under Accession No. PX123224 PX245442 Conflicts of Interest The authors declare no conflict of interests. The funders had no role in the design of the study; the collection, analyses, or interpretation of data; the writing of the manuscript; or the decision to publish the results. References 1. de Villiers E.M. Fauquet C. Broker T.R. Bernard H.U. zur Hausen H. Classification of papillomaviruses Virology 2004 324 17 27 10.1016/j.virol.2004.03.033 15183049 2. zur Hausen H. Papillomaviruses and cancer: From basic studies to clinical application Nat. Rev. Cancer 2002 2 342 350 10.1038/nrc798 12044010 3. Graham S.V. The human papillomavirus replication cycle, and its links to cancer progression: A comprehensive review Clin Sci. 2017 131 2201 2221 10.1042/CS20160786 28798073 4. Yu L. Majerciak V. Xue X.Y. Uberoi A. Lobanov A. Chen X. Cam M. Hughes S.H. Lambert P.F. Zheng Z.M. Mouse papillomavirus type 1 (MmuPV1) DNA is frequently integrated in benign tumors by microhomology-mediated end-joining PLoS Pathog. 2021 17 e1009812 10.1371/journal.ppat.1009812 34343212 PMC8362953 5. Yu L. Majerciak V. Lobanov A. Mirza S. Band V. Liu H. Cam M. Hughes S.H. Lowy D.R. Zheng Z.M. HPV oncogenes expressed from only one of multiple integrated HPV DNA copies drive clonal cell expansion in cervical cancer mBio 2024 15 e0072924 10.1128/mbio.00729-24 38624210 PMC11077993 6. Christensen N.D. Budgeon L.R. Cladel N.M. Hu J. Recent advances in preclinical model systems for papillomaviruses Virus Res. 2017 231 108 118 10.1016/j.virusres.2016.12.004 27956145 PMC5361623 7. Spurgeon M.E. Lambert P.F. Mus musculus Papillomavirus 1: A New Frontier in Animal Models of Papillomavirus Pathogenesis J. Virol. 2020 94 e0000220 10.1128/JVI.00002-20 PMC7163119 32051276 8. Ingle A. Ghim S. Joh J. Chepkoech I. Bennett Jenson A. Sundberg J.P. Novel laboratory mouse papillomavirus (MusPV) infection Vet. Pathol. 2011 48 500 505 10.1177/0300985810377186 20685915 9. Cladel N.M. Budgeon L.R. Cooper T.K. Balogh K.K. Hu J. Christensen N.D. Secondary infections, expanded tissue tropism, and evidence for malignant potential in immunocompromised mice infected with Mus musculus papillomavirus 1 DNA and virus J. Virol. 2013 87 9391 9395 10.1128/JVI.00777-13 23785210 PMC3754027 10. Handisurya A. Day P.M. Thompson C.D. Buck C.B. Pang Y.Y. Lowy D.R. Schiller J.T. Characterization of Mus musculus papillomavirus 1 infection in situ reveals an unusual pattern of late gene expression and capsid protein localization J. Virol. 2013 87 13214 13225 10.1128/JVI.02162-13 24067981 PMC3838223 11. Hu J. Cladel N.M. Budgeon L.R. Balogh K.K. Christensen N.D. The Mouse Papillomavirus Infection Model Viruses 2017 9 246 10.3390/v9090246 28867783 PMC5618012 12. Uberoi A. Yoshida S. Lambert P.F. Development of an in vivo infection model to study Mouse papillomavirus-1 (MmuPV1) J. Virol. Methods 2018 253 11 17 10.1016/j.jviromet.2017.12.002 29253496 PMC5898621 13. Xue X.Y. Majerciak V. Uberoi A. Kim B.H. Gotte D. Chen X. Cam M. Lambert P.F. Zheng Z.M. The full transcription map of mouse papillomavirus type 1 (MmuPV1) in mouse wart tissues PLoS Pathog. 2017 13 e1006715 10.1371/journal.ppat.1006715 29176795 PMC5720830 14. Killoran K.E. Breed M.W. Roelke-Parker M.E. Carney S. Edmondson E. Thompson C.D. Schiller J.T. Henderson K. Woods C.L. Albers T.M. Mouse papillomavirus outbreak in a research facility J. Am. Assoc. Lab. Anim. Sci. 2025 in press 10.30802/AALAS-JAALAS-25-100 40987458 15. Yu L. Majerciak V. Zheng Z.M. HPV16 and HPV18 Genome Structure, Expression, and Post-Transcriptional Regulation Int. J. Mol. Sci. 2022 23 4943 10.3390/ijms23094943 35563334 PMC9105396 16. Joh J. Jenson A.B. King W. Proctor M. Ingle A. Sundberg J.P. Ghim S.J. Genomic analysis of the first laboratory-mouse papillomavirus J. Gen. Virol. 2011 92 692 698 10.1099/vir.0.026138-0 21084500 17. Uberoi A. Yoshida S. Frazer I.H. Pitot H.C. Lambert P.F. Role of Ultraviolet Radiation in Papillomavirus-Induced Disease PLoS Pathog. 2016 12 e1005664 10.1371/journal.ppat.1005664 27244228 PMC4887022 18. Schulz E. Gottschling M. Ulrich R.G. Richter D. Stockfleth E. Nindl I. Isolation of three novel rat and mouse papillomaviruses and their genomic characterization PLoS ONE 2012 7 e47164 10.1371/journal.pone.0047164 23077564 PMC3471917 19. Handisurya A. Day P.M. Thompson C.D. Bonelli M. Lowy D.R. Schiller J.T. Strain-specific properties and T cells regulate the susceptibility to papilloma induction by Mus musculus papillomavirus 1 PLoS Pathog. 2014 10 e1004314 10.1371/journal.ppat.1004314 25121947 PMC4133403 20. Sundberg J.P. Stearns T.M. Joh J. Proctor M. Ingle A. Silva K.A. Dadras S.S. Jenson A.B. Ghim S.J. Immune status, strain background, and anatomic site of inoculation affect mouse papillomavirus (MmuPV1) induction of exophytic papillomas or endophytic trichoblastomas PLoS ONE 2014 9 e113582 10.1371/journal.pone.0113582 25474466 PMC4256377 21. Chan S.Y. Ho L. Ong C.K. Chow V. Drescher B. Durst M. ter Meulen J. Villa L. Luande J. Mgaya H.N. Molecular variants of human papillomavirus type 16 from four continents suggest ancient pandemic spread of the virus and its coevolution with humankind J. Virol. 1992 66 2057 2066 10.1128/jvi.66.4.2057-2066.1992 1312620 PMC288996 22. Burk R.D. Terai M. Gravitt P.E. Brinton L.A. Kurman R.J. Barnes W.A. Greenberg M.D. Hadjimichael O.C. Fu L. McGowan L. Distribution of human papillomavirus types 16 and 18 variants in squamous cell carcinomas and adenocarcinomas of the cervix Cancer Res. 2003 63 7215 7220 14612516 23. Bodaghi S. Wood L.V. Roby G. Ryder C. Steinberg S.M. Zheng Z.M. Could Human Papillomaviruses Be Spread through Blood? J. Clin. Microbiol. 2005 43 5428 5434 10.1128/JCM.43.11.5428-5434.2005 16272465 PMC1287818 24. Cladel N.M. Hu J. Balogh K.K. Christensen N.D. Differences in methodology, but not differences in viral strain, account for variable experimental outcomes in laboratories utilizing the cottontail rabbit papillomavirus model J. Virol. Methods 2010 165 36 41 10.1016/j.jviromet.2009.12.014 20036285 PMC2845176 25. Meyers J. Ryndock E. Conway M.J. Meyers C. Robison R. Susceptibility of high-risk human papillomavirus type 16 to clinical disinfectants J. Antimicrob. Chemother. 2014 69 1546 1550 10.1093/jac/dku006 24500190 PMC4019329 26. Ozbun M.A. Bondu V. Patterson N.A. Sterk R.T. Waxman A.G. Bennett E.C. McKee R. Sharma A. Yarwood J. Rogers M. Infectious titres of human papillomaviruses (HPVs) in patient lesions, methodological considerations in evaluating HPV infectivity and implications for the efficacy of high-level disinfectants EBioMedicine 2021 63 103165 10.1016/j.ebiom.2020.103165 33422988 PMC7808919 27. Egawa N. Shiraz A. Crawford R. Saunders-Wood T. Yarwood J. Rogers M. Sharma A. Eichenbaum G. Doorbar J. Dynamics of papillomavirus in vivo disease formation & susceptibility to high-level disinfection-Implications for transmission in clinical settings EBioMedicine 2021 63 103177 10.1016/j.ebiom.2020.103177 33421945 PMC7806788 Figure 1 Natural history of recurrent papillomatosis outbreak in animal research facility. ( A B C upper panel lower panel Figure 2 Detection of MmuPV1 expression in the muzzle skin papilloma. ( A B A C A 13 Figure 3 Sequence analysis of the MmuPV1 Bethesda strain genome. ( A B 13 C D PX123224 NC_014326 16 PX245442 17 HQ625439 18 E Figure 4 Cloning of MmuPV1 Bethesda strain genome. ( A Bgl Not Bam Bam B C B Not Bgl cmv C Bam E. coli Bam viruses-17-01204-t001_Table 1 Table 1 Oligo primers used in this study. All nucleotide positions are based on the MmuPV1 reference genome GenBank Acc. No. NC_014326 Name Strand 5′ (nt) 3′ (nt) Locus Restriction Site Sequence oLLY33 B 3874 3855 L2 N/A TGTCAGCAAGTGTGTTTCCT oXYX11 B 5452 5433 L1 N/A TTCGTCTGTGCTCTGCACTT oXYX18 F 7140 7160 URR N/A TGTTGGCTGTGTGCTCTCTAA oXYX19 B 827 807 E1 N/A AAGGAACCCACATCATCCACA oXYX28 B 7237 7216 URR N/A CAAATTGGCTGGAGTTTATGCT oXYX32 F 742 762 E1 N/A ATGGAAAACGATAAAGGTACA oXYX33 B 2601 2582 E1/E2 N/A CTGCCTTTCTCGTAAAGGTT oXYX37 F 2534 2554 E1/E2 N/A ATGAACAGCCTGGAAACACGT oXYX45 F 5372 5391 L1 N/A ATGGCAATGTGGACACCCCA oXYX47 F 3745 3763 L2 N/A ATGGTGTCTGCTGACAGAA oLLY547 B 7502 7483 URR Bgl ATCATAT AGATCT/ oDG33 F 7503 12 URR/E6 Not GCGCATACT GCGGCCGC/ oLLY542 F 6689 6716 L1 Bam GAAAGAGA GGATCC oLLY543 B 6708 6681 L1 Bam TTGTAA GGATCC ",
  "metadata": {
    "Title of this paper": "Dynamics of papillomavirus in vivo disease formation & susceptibility to high-level disinfection-Implications for transmission in clinical settings",
    "Journal it was published in:": "Viruses",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474283/"
  }
}