{
  "title": "Paper_1022",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12479834 PMC12479834.1 12479834 12479834 41023383 10.1038/s41598-025-19839-1 19839 1 Article Chroococcus turigidus Gamal Reham 1 El-Fakharany Esmail M. 2 Elsayed Khaled N. M. 3 El Sharkawy Amany Salama 1 Elsayed Nader Saad 4 5 Shalaby Ola Kh. ola_shalaby2012@yahoo.com 1 1 https://ror.org/052cjbe24 grid.419615.e 0000 0004 0404 7762 National Institute of Oceanography and Fisheries, NIOF, 2 https://ror.org/00pft3n23 grid.420020.4 0000 0004 0483 2576 Protein Research Department, Genetic Engineering and Biotechnology Research Institute (GEBRI), City of Scientific Research and Technological Applications (SRTA-City), New Borg El-Arab, 3 https://ror.org/05pn4yv70 grid.411662.6 0000 0004 0412 4932 Botany and Microbiology Department, Faculty of Science, Beni-Suef University, 4 https://ror.org/00mzz1w90 grid.7155.6 0000 0001 2260 6941 Soil and Agricultural Chemistry Department, Faculty of Agriculture (Saba-Basha), Alexandria University, 5 https://ror.org/01dzed356 grid.257160.7 0000 0004 1761 0331 College of Resources, Hunan Agricultural University, 29 9 2025 2025 15 478255 33327 11 7 2025 10 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ The anti-leukemic drug enzyme L-asparaginase is highly sought for its potential in treating various solid tumors; as well as its application in food production for mitigation of the carcinogenic acrylamide. Marine microalgae are well known for their diverse bioactive products and ease of cultivation, making them ideal candidates for large-scale production. Seven marine microalgae were isolated based on their L-asparaginase production, and the isolate Chroococcus turigidus 50 50 Chroococcus turigidus Chroococcus turigidus Keywords Anti-cancer Asparaginase Chroococcus turigidus Marine microalgae Subject terms Biochemistry Biotechnology Cancer Microbiology Plant sciences National Institute of Oceanography & Fisheries (NIOF) Open access funding provided by The Science, Technology & Innovation Funding Authority (STDF) in cooperation with The Egyptian Knowledge Bank (EKB). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Marine microalgae are categorized into three main groups: blue-green algae (Cyanobacteria), diatoms (Bacillariophyta), and dinoflagellates (Dinophyceae) 1 2 6 Cervical cancer develops primarily from persistent high-risk human papillomavirus (HPV) infections. When HPV enters cervical cells, it disrupts their normal physiology, leading to precancerous lesions and, over time, malignant transformation 7 8 7 It is known that L-asparaginase is an amidohydrolase 9 10 11 Recently, L-asparaginase has been used in food technology as a potent mitigating agent for reducing acrylamide (AA, CH 2 2 12 13 In terms of yield, Spirulina maxima Oscillatoria terebriformis Aspergillus sydowii Fusarium oxysporum Melioribacter roseus 14 Recently, L-asparaginase production from blue-green microalgae has been receiving more attention because they have many advantages, such as high nutrient contents, low cost of production, cost-effectiveness, no seasonal variation, highly efficient producers, being easily cultured and harvested at large scales, cheaper and easier extraction, and higher yields and purification of protein and enzymes by simple methods are available. However, few reports regarding the production of enzymes by blue-green algae have been recorded 15 16 17 Materials and methods Algal species isolation Marine water samples were collected by the EL-YARMOUK research vessel team during September 2023. Sampling sites were from the Mediterranean Sea (north of Delta, Egypt), surveying from 31° 13′ 15.6\" N 29° 53′ 06.0\" E to 31° 40′ 40.8\" N 31° 51′ 39.6\" E, at 10 m depth (Fig. 1 −2 −1  Fig. 1 Marine water samples were collected by the EL-YARMOUK research vessel team during September 2023. Sampling sites were from the Mediterranean Sea (North of Delta, Egypt) surveying from 31° 13′ 15.6″ N 29° 53′ 06.0″ E to 31° 40′ 40.8″ N 31° 51′ 39.6″ E at 10 m depth using Google Maps. (2025). Los Angeles, CA., from https://www.google.com/maps Screening for microalgae L-asparaginase production L-asparaginase production can be determined by two techniques: qualitative methods and quantitative methods. Qualitative method (primary screening of L-asparaginase production) Rapid screening of L-asparaginase produced from algal cultures was assessed using phenol red as a pH indicator in the medium 18 Quantitative method The modified F/2 medium (containing phenol red as a pH indicator) served as a production medium (was adjusted to pH 7.0 before autoclaving). After sterilization, the medium (50 ml placed in 250 ml Erlenmeyer flasks) was inoculated with 5 ml of old seeded microalgae cultures and incubated at 30 °C for 20 days 19 L-asparaginase enzyme assay L-asparaginase enzyme activity of the isolated marine microalga was estimated by determining the amount of released ammonia derived from hydrolysis of L-asparagine by L-asparaginase according to a previously reported method using a reagent with slight modifications 20 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:Enzyme\\:activity\\:(IU/\\text{m}\\text{L})\\:=\\:\\frac{(Abs480\\times\\:Vt)}{(\\epsilon\\:\\times\\:l\\times\\:t\\times\\:Vs)}$$\\end{document} 480 −1 −1 Anti-cancer effect The effect of the algal extract on the viability of normal and cancer cell lines was examined using the colorimetric MTT (3-(4, 5-dimethylthiazol-2-yl)−2, 5-diphenyltetrazolium bromide) assay (Orabi et al., 2020). HSF (somatic cells obtained from normal human skin tissue), HepG-2 (hepatoma), HepG-2 (hepatoma cells derived from human liver tissue), and MDA (breast cancer) cell lines (1.0 × 104) were seeded in four 96-well tissue culture sterile microplates at 37 °C for 24 h in a 5% CO₂ incubator. HSF and MDA cells were cultured in DMEM media (SERANA, Germany); however, HepG-2 cells were cultured in RPMI-1640 media (Elabscience, China) supplemented with 10% fetal bovine serum (FBS, Gibco, USA). The cells were exposed to the algal extract at different concentrations (12.5, 25, 50, 100, 200, and 400 µg/mL) and incubated at 37 °C in a 5% CO₂ incubator. After incubation for 24 and 48 h, the cells were washed three times with PBS to remove the exposed extract, debris, and dead cells. Then, MTT solution (0.5 mg/mL) was added to the cells and incubated at 37 °C for 3 h. The formed formazan crystals were dissolved in dimethyl sulfoxide (DMSO), and absorbance was read using a microplate ELISA reader at 570 nm. All experiments were done in triplicates; the data were graphically depicted as viability versus concentrations. The half-maximal inhibitory concentration (IC50) value of the algal extract was calculated using the GraphPad Prism 8.0 software. Furthermore, the selectivity index (SI) value of the algal extract was estimated by dividing the IC50 value of normal HSF cells by the IC50 value of the treated cancer cells (Habib et al., 2022; Ebraheem et al., 2024). In addition, the effect of the algal extract on the morphology of the treated cells was investigated at different doses (50, 100, and 200 µg/mL) and visualized under ZOE fluorescence phase-contrast microscopy (BIO RAD, Singapore) and compared to untreated cells as reference cells. All cell lines used (HSF, HepG-2, and MDA) were obtained from the American Type Culture Collection (ATCC). Experiments were performed following institutional biosafety guidelines approved by the National Institute of Oceanography and Fisheries, Egypt. Nuclear staining analysis The apoptotic effect of algal extract on HepG-2 cells was studied using propidium iodide (PI) as a single nuclear staining dye and ethidium bromide/acridine orange (EB/AO) as double nuclear staining dyes. After culturing HepG-2 cells overnight, cells were exposed to the algal extract at concentrations of 50, 100, and 200 µg/mL for 48 h. The apoptotic effect was examined, and microphotographs were captured using ZOE fluorescent microscopy (BIO RAD, Singapore), as previously reported 21 Migration Inhibition assay HepG-2 cells were cultivated in a 12-well tissue culture plate until 90% confluence and then examined for migration inhibition using a wound healing assay. A sterile tip was used to scratch HepG-2 cells before treatment with the algal extract at concentrations of 50, 100, and 200 µg/mL. The wound closure area was determined and captured by imaging analysis CellSens software v1.16 after treatment for 24 h. The wound gap area measurements at zero time and treatments were determined, and the inhibitory migration factors were represented by the gap area value of treated cells over the initial scratch area 22 Statistical analysis All measurements were carried out in triplicate. Statistical analyses were performed using one-way analysis of variance (ANOVA), and the significance of the difference between means was determined by Duncan’s multiple range tests. Differences at p Results Screening for isolates with the highest L-asparaginase production Seven microalgae ( Oscillatoria nigroriridus Chroococcus turigidus Oscilatoria acitissima Ocillatoria simplissima Closterium navicular Oscillatoria sp. 2 Chroococcus turigidus Chroococcus turigidus 3  Fig. 2 The microalgal isolates were allowed to grow on a modified F/2 medium (supplemented with phenol red as an indicator) at a temperature of 30 °C and pH 8.  Fig. 3 Seven microalgae ( Oscillatoria nigroriridus (1) Anabaena sp.(2) Chroococcus turigidus (3) Oscilatoria acitissima(4) Ocillatoria simplissima (5) Closterium navicular(6)r and Oscillatoria sp.(7) Anticancer determination Anti-proliferative effect assessment The anticancer effect of the algal extract was estimated in vitro against breast carcinoma (MDA) and hepatoma (HepG-2) cell lines in comparison with normal human skin fibroblast (HSF) cell line. The IC 50 1 4 4 50 1 50 4 Nuclear staining assessment The apoptotic efficacy of the algal extract was confirmed by fluorescence analysis of the treated HepG-2 cells, after staining with dual AO/EB stain, which shows yellow to reddish-orange fluorescence of apoptotic nuclei in comparison with green fluoresce of healthy nuclei of the reference (untreated) cells. The nuclei of the treated-HepG-2 cells Demonstrate yellowish fluorescence at a low concentration of 50 µg/mL, which converts to orange fluorescence after treatment with a concentration of 100 µg/mL, and reddish-orange fluorescence after treatment with a concentration of 200 µg/mL confirming its potent apoptotic activity (Fig. 5 Anti-migration potency assessment Interestingly, the anti-metastatic activity of the algal extract was Determined using a wound-healing assay. The anti-migration efficacy is Dependent on the inhibition of the activity of migration-related proteases. After treatment for 24 h, the algal extract exhibited high potency to inhibit migration of the treated HepG-2 by 100% compared to untreated control cells, which showed a normal migration property (Fig. 5  Table 1 The antitumor activity of the algal extract against MDA and HepG-2 cells as compared to normal human cells (HSF) expressed in IC 50 Time Value HSF MDA HepG-2 24 h IC 50 844.4 ± 25.45 169.8 ± 10.46 126.3 ± 7.36 SI – 4.97 ± 0.15 6.69 ± 0.21 48 h IC 50 730.5 ± 17.99 109.9 ± 6.38 71.88 ± 4.17 SI – 6.65 ± 0.16 10.16 ± 0.42  Fig. 4 ( A n p B  Fig. 5 Apoptotic effect of algal extract on the treated cancer cells. ( A B Discussion The marine environment is a very rich source of different kinds of microorganisms producing many bioactive natural products. L-asparaginase (E.C. 3.5.1.1), is among the relevant enzymes that can be obtained from marine sources. Cyanobacteria and eukaryotic microalgae have great economic and ecological importance. Cyanobacteria, formerly named blue-green algae are the only known prokaryotes capable of oxygenic photosynthesis 23 24 Seven microalgae were tested for their ability to produce L-asparaginase enzyme. The growth of microalgae increased and reached its maximum value at the stationary phase. Then, started to decrease, in this respect, most studies on the biochemical production of algal and their analysis were carried out in the stationary phase of growth period 25 26 27 A limitation of this study is that we did not purify the enzyme, and therefore the observed anticancer effects may be influenced by other metabolites present in the crude extract. Future work should focus on enzyme purification, structural characterization, and in vivo validation. Additionally, comparative safety assessments with bacterial L-asparaginases, which are often associated with immunogenicity, are warranted. Conclusion This research demonstrates that the marine cyanobacterium of L-asparaginase enzyme. These findings suggest that this algal could serve as an alternative candidate for applications in pharmaceutical and biotechnological processes. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We did not receive any grants from funding agencies in the public, commercial, or not-for-profit sectors for this work. Author contributions Reham Gamal: methodology, investigation, data curation, formal analysis, writing original draft, review and editing. Esmail M. El-Fakharany: methodology, software, curation data, writing review, and editing. Khaled N. M. Elsayed: Conceptualization, methodology, investigation, visualization, data curation, writing original draft, review and editing. Amany Salama El Sharkawy: methodology, writing, software, data curation, software and editing. All authors contributed to the article and approved the submitted version. Nader Saad Elsayed, and Ola Kh Shalaby contributed to writing—review and editing. Funding Open access funding provided by The Science, Technology & Innovation Funding Authority (STDF) in cooperation with The Egyptian Knowledge Bank (EKB). Data availability The datasets utilized in this research can be found in publicly accessible databases as referenced in the paper citations. However, the data and figures generated throughout this study can be obtained upon request from the corresponding author. Declarations Competing interests The authors declare no competing interests. References 1. Sathasivam R Radhakrishnan R Hashem A Abd Allah EF Microalgae metabolites: A rich source for food and medicine Saudi J. Biol. Sci. 2019 26 4 709 722 10.1016/j.sjbs.2017.11.003 31048995 PMC6486502 Sathasivam, R., Radhakrishnan, R., Hashem, A. & Abd Allah, E. F. Microalgae metabolites: A rich source for food and medicine. Saudi J. Biol. Sci. 26 31048995 10.1016/j.sjbs.2017.11.003 PMC6486502 2. Barzkar N Jahromi T Poorsaheli HB Vianello F Metabolites from marine microorganisms, micro, and macroalgae: immense scope for Pharmacology Mar. Drugs 2019 17 8 464 10.3390/md17080464 31398953 PMC6723029 Barzkar, N., Jahromi, T., Poorsaheli, H. B. & Vianello, F. Metabolites from marine microorganisms, micro, and macroalgae: immense scope for Pharmacology. Mar. Drugs 17 31398953 10.3390/md17080464 PMC6723029 3. Singh J Saxena RC An introduction to microalgae: Diversity and significance. Handbook of marine microalgae Biotechnol. Adv. 2015 10.1016/b978-0-12-800776-1.00002-9 Singh, J. & Saxena, R. C. An introduction to microalgae: Diversity and significance. Handbook of marine microalgae. Biotechnol. Adv. 4. Fathy W Recombinant overexpression of the Escherichia coli Synechocystis J. Basic. Microbiol. 2021 10.1002/jobm.202000656 33599337 Fathy, W. et al. Recombinant overexpression of the Escherichia coli Synechocystis J. Basic. Microbiol. 33599337 10.1002/jobm.202000656 5. Omar R Ibraheem IBM Hassan S Elsayed KNM Biogenic synthesis of different forms of Bio-caped silver nanoparticles using Microcystis Curr. Nanosci. 2023 19 850 862 10.2174/1573413719666230202122334 Omar, R., Ibraheem, I. B. M., Hassan, S. & Elsayed, K. N. M. Biogenic synthesis of different forms of Bio-caped silver nanoparticles using Microcystis Curr. Nanosci. 19 6. Fathy WA Glycine differentially improved the growth and biochemical composition of Synechocystis sp Chlorella variabilis Front. Bioeng. Biotechnol. 2023 11 1161911 10.3389/fbioe.2023.1161911 37324419 PMC10267400 Fathy, W. A. et al. Glycine differentially improved the growth and biochemical composition of Synechocystis sp Chlorella variabilis Front. Bioeng. Biotechnol. 11 37324419 10.3389/fbioe.2023.1161911 PMC10267400 7. Okunade KS Salako O Adejimi AA Akinsola OJ Fatiregun O Adenekan MA Berek JS Impact of mobile technologies on cervical cancer screening practices in Lagos, Nigeria (mHealth-Cervix): Protocol for a randomised controlled trial F1000Research 2020 9 322 10.12688/f1000research.22991.1 32528665 PMC7265590 Okunade, K. S. et al. Impact of mobile technologies on cervical cancer screening practices in Lagos, Nigeria (mHealth-Cervix): Protocol for a randomised controlled trial. F1000Research 9 32528665 10.12688/f1000research.22991.1 PMC7265590 8. El-Salem F Real-time PCR HPV genotyping in fine needle aspirations of metastatic head and neck squamous cell carcinoma: exposing the limitations of conventional p16 immunostaining Oral Oncol. 2019 90 74 79 10.1016/j.oraloncology.2019.02.006 30846180 El-Salem, F. et al. Real-time PCR HPV genotyping in fine needle aspirations of metastatic head and neck squamous cell carcinoma: exposing the limitations of conventional p16 immunostaining. Oral Oncol. 90 30846180 10.1016/j.oraloncology.2019.02.006 9. Pedreschi F Mariotti-Celis MS Granby K Risum J Acrylamide reduction in potato chips using commercial asparaginase in combination with conventional bleaching LWT Food Sci. Technol. 2011 44 6 1473 1476 10.1016/j.lwt.2011.02.004 Pedreschi, F., Mariotti-Celis, M. S., Granby, K. & Risum, J. Acrylamide reduction in potato chips using commercial asparaginase in combination with conventional bleaching. LWT Food Sci. Technol. 44 10. Shakambari G Hemocompatible glutaminase free L-asparaginase from marine Bacillus tequilensis PV9W with anticancer potential modulating p53 expression RSC Adv. 2016 6 38 25943 25951 10.1039/C6RA00727A Shakambari, G. et al. Hemocompatible glutaminase free L-asparaginase from marine Bacillus tequilensis PV9W with anticancer potential modulating p53 expression. RSC Adv. 6 11. Nunes JC L-Asparaginase-based biosensors Encyclopedia 2021 1 3 848 858 10.3390/encyclopedia1030065 Nunes, J. C. et al. L-Asparaginase-based biosensors. Encyclopedia 1 12. Bongers ML Dietary acrylamide intake and the risk of lymphatic malignancies: the Netherlands cohort study on diet and cancer PLoS ONE 2012 7 6 e38016 10.1371/journal.pone.0038016 22723843 PMC3377662 Bongers, M. L. et al. Dietary acrylamide intake and the risk of lymphatic malignancies: the Netherlands cohort study on diet and cancer. PLoS ONE 7 22723843 10.1371/journal.pone.0038016 PMC3377662 13. Baskar G Anticancer activity of fungal L-asparaginase conjugated with zinc oxide nanoparticles J. Mater. Sci. Mater. Med. 2015 26 1 7 10.1007/s10856-015-5380-z 25589205 Baskar, G. et al. Anticancer activity of fungal L-asparaginase conjugated with zinc oxide nanoparticles. J. Mater. Sci. Mater. Med. 26 10.1007/s10856-015-5380-z 25589205 14. Abd El Baky HH El Baroty GS Optimization of Growth Conditions for Purification and Production of L-Asparaginase by Spirulina maxima Evid. Based Complement. Alternat Med. 2016 10.1155/2016/1785938 27525017 PMC4976183 Abd El Baky, H. H. & El Baroty, G. S. Optimization of Growth Conditions for Purification and Production of L-Asparaginase by Spirulina maxima Evid. Based Complement. Alternat Med. 27525017 10.1155/2016/1785938 PMC4976183 15. Prihanto AA Wakayama M Combination of environmental stress and localization of l asparaginase in Arthrospira platensis 3 Biotech. 2014 4 647 653 10.1007/s13205-014-0215-z 28324309 PMC4235887 Prihanto, A. A. & Wakayama, M. Combination of environmental stress and localization of l asparaginase in Arthrospira platensis 3 Biotech. 4 28324309 10.1007/s13205-014-0215-z PMC4235887 16. Morgan-Kiss RM Priscu JC Pocock T Gudynaite-Savitch L Huner NPA Adaptation and acclimation of photosynthetic microorganisms to permanently cold environments Microbiol. Mol. Biol. Rev. 2006 70 1 222 252 10.1128/MMBR.70.1.222-252.2006 16524924 PMC1393254 Morgan-Kiss, R. M., Priscu, J. C., Pocock, T., Gudynaite-Savitch, L. & Huner, N. P. A. Adaptation and acclimation of photosynthetic microorganisms to permanently cold environments. Microbiol. Mol. Biol. Rev. 70 16524924 10.1128/MMBR.70.1.222-252.2006 PMC1393254 17. Mosier AC Metabolites associated with adaptation of microorganisms to an acidophilic, metal-rich environment identified by stable-isotope-enabled metabolomics MBio 2013 4 2 e00484 e00412 10.1128/mBio.00484-12 23481603 PMC3604775 Mosier, A. C. et al. Metabolites associated with adaptation of microorganisms to an acidophilic, metal-rich environment identified by stable-isotope-enabled metabolomics. MBio 4 23481603 10.1128/mBio.00484-12 PMC3604775 18. Gulati R Saxena RK Gupta R A rapid plate assay for screening l-asparaginase producing micro-organisms Lett. Appl. Microbiol. 1997 24 1 23 26 10.1046/j.1472-765x.1997.00331.x 9024001 Gulati, R., Saxena, R. K. & Gupta, R. A rapid plate assay for screening l-asparaginase producing micro-organisms. Lett. Appl. Microbiol. 24 9024001 10.1046/j.1472-765x.1997.00331.x 19. Pradhan B Dash SK Sahoo S Screening and characterization of extracelluar L-asparaginase producing Bacillus subtilis Asian Pac. J. Trop. Biomed. 2013 3 12 936 941 10.1016/S2221-1691(13)60182-3 24093783 PMC3805100 Pradhan, B., Dash, S. K. & Sahoo, S. Screening and characterization of extracelluar L-asparaginase producing Bacillus subtilis Asian Pac. J. Trop. Biomed. 3 24093783 10.1016/S2221-1691(13)60182-3 PMC3805100 20. Chi H Characterization of a novel and glutaminase-free type II L-asparaginase from Corynebacterium glutamicum and its acrylamide alleviation efficiency in potato chips Int. J. Biol. Macromol. 2022 221 1384 1393 10.1016/j.ijbiomac.2022.09.162 36130640 Chi, H. et al. Characterization of a novel and glutaminase-free type II L-asparaginase from Corynebacterium glutamicum and its acrylamide alleviation efficiency in potato chips. Int. J. Biol. Macromol. 221 36130640 10.1016/j.ijbiomac.2022.09.162 21. Habib HM El-Fakharany EM Kheadr E Ibrahim WH Grape seed Proanthocyanidin extract inhibits DNA and protein damage and labile iron, enzyme, and cancer cell activities Sci. Rep. 2023 12 1 12393 10.1038/s41598-022-16608-2 PMC9300616 35859159 Habib, H. M., El-Fakharany, E. M., Kheadr, E. & Ibrahim, W. H. Grape seed Proanthocyanidin extract inhibits DNA and protein damage and labile iron, enzyme, and cancer cell activities. Sci. Rep. 12 10.1038/s41598-022-16608-2 PMC9300616 35859159 22. El-Sherbiny GM Nanoemulsion of cinnamon oil to combat colistin-resistant Klebsiella pneumoniae and cancer cells Microb. Pathog 2024 192 106705 10.1016/j.micpath.2024.106705 38761892 El-Sherbiny, G. M. et al. Nanoemulsion of cinnamon oil to combat colistin-resistant Klebsiella pneumoniae and cancer cells. Microb. Pathog 192 38761892 10.1016/j.micpath.2024.106705 23. Tamagnini P Hydrogenases and hydrogen metabolism of cyanobacteria Microbiol. Mol. Biol. Rev. 2002 66 1 1 20 10.1128/MMBR.66.1.1-20.2002 11875125 PMC120778 Tamagnini, P. et al. Hydrogenases and hydrogen metabolism of cyanobacteria. Microbiol. Mol. Biol. Rev. 66 11875125 10.1128/MMBR.66.1.1-20.2002 PMC120778 24. Saad A Atia A Review on freshwater blue-green algae (Cyanobacteria): occurrence, classification and toxicology Biosci. Biotechnol. Res. Asia 2014 11 1319 1325 10.13005/bbra/1522 Saad, A. & Atia, A. Review on freshwater blue-green algae (Cyanobacteria): occurrence, classification and toxicology. Biosci. Biotechnol. Res. Asia 11 http://dx.doi.org/http: 25. Beker EW Microalgae: Biotechnology and Microbiology 1994 Cambridge University Press 230 Beker, E. W. Microalgae: Biotechnology and Microbiology 26. Ellaiah P Srinivasulu B Adinarayana K A review on microbial alkaline proteases J. Scient Indus Res. 2002 61 9 690 704 Ellaiah, P., Srinivasulu, B. & Adinarayana, K. A review on microbial alkaline proteases. J. Scient Indus Res. 61 27. De D Chowdhury P Panda SK Ghosh U Ethanolic extract of leaf of Dillenia Pentagyna reduces in-vitro cell migration and induces intrinsic pathway of apoptosis via downregulation of NF-κβ in human NSCLC A549 cells J. Cell. Biochem. 2019 120 12 19841 19857 10.1002/jcb.29289 31318086 De, D., Chowdhury, P., Panda, S. K. & Ghosh, U. Ethanolic extract of leaf of Dillenia Pentagyna reduces in-vitro cell migration and induces intrinsic pathway of apoptosis via downregulation of NF-κβ in human NSCLC A549 cells. J. Cell. Biochem. 120 31318086 10.1002/jcb.29289 ",
  "metadata": {
    "Title of this paper": "Ethanolic extract of leaf of Dillenia Pentagyna reduces in-vitro cell migration and induces intrinsic pathway of apoptosis via downregulation of NF-κβ in human NSCLC A549 cells",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479834/"
  }
}