{
  "title": "Paper_24",
  "abstract": "pmc Clin Case Rep Clin Case Rep 2542 ccr CCR3 Clinical Case Reports 2050-0904 Wiley PMC12495128 PMC12495128.1 12495128 12495128 10.1002/ccr3.71131 CCR371131 CCR3-2025-02-0564.R1 1 Case Report Case Report Microscopic Primary Tubal Serous Carcinoma With Colon Metastasis and Paraneoplastic Neurological Syndrome: A Case Report Ye Tyler https://orcid.org/0009-0007-3674-4019  1 22038888@student.westernsydney.edu.au De Silva Dinuke https://orcid.org/0009-0002-5012-7547  2 Santos Leonardo D.  2 Roncolato Felicia https://orcid.org/0000-0002-5609-0012  3 Levy Stanley https://orcid.org/0000-0002-4852-1193  4 Hamilton Auerilius Erastus Ricardo https://orcid.org/0000-0002-7611-8481  5   1 School of Medicine Western Sydney University Campbelltown New South Wales Australia   2 Department of Anatomical Pathology Liverpool Hospital Liverpool New South Wales Australia   3 Department of Medical Oncology Campbelltown Hospital Campbelltown New South Wales Australia   4 Department of Neurology Campbelltown Hospital Campbelltown New South Wales Australia   5 Department of General Surgery Campbelltown Hospital Campbelltown New South Wales Australia * Correspondence: 22038888@student.westernsydney.edu.au 04 10 2025 10 2025 13 10 497443 10.1002/ccr3.v13.10 e71131 17 9 2025 01 3 2025 20 9 2025 04 10 2025 05 10 2025 05 10 2025 © 2025 The Author(s). Clinical Case Reports https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT This case report discusses a rare instance of a 69‐year‐old woman presenting with lower limb paresthesia, whose imaging showed suspicious nodules in the sigmoid colon and no other obvious sites of malignancy. Laparoscopic anterior resection was performed and subsequent immunohistochemical examination revealed an unexpected diagnosis of colonic metastasis from a carcinoma of tubo‐ovarian origin, which necessitated a second surgery. Metastatic lesions of the colon from other organs are uncommon, and accurate diagnosis without clear evidence of the primary tumor poses a challenge. This case emphasizes the consideration for re‐biopsy when initial samples lack sufficient tissue for thorough immunohistochemical examination, highlighting the importance of detailed histopathology in guiding diagnosis and treatment in metastatic cases. We also discuss the utility of identifying paraneoplastic neurological syndromes and onconeural antibodies in determining the tubo‐ovarian origin of cancer. anti‐Yo antibody colon biopsy colonic metastasis fallopian tube neoplasm high‐grade serous carcinoma paraneoplastic neurological syndrome pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:04.10.2025  T. Ye D. De Silva L. D. Santos F. Roncolato S. Levy A. E. R. Hamilton Microscopic Primary Tubal Serous Carcinoma With Colon Metastasis and Paraneoplastic Neurological Syndrome: A Case Report Clinical Case Reports 13 10 2025 e71131 10.1002/ccr3.71131  Funding:  Summary  Colonic metastasis from primary fallopian tube carcinoma is rare and can mimic primary colorectal cancer. This case highlights the diagnostic challenge and underscores the importance of considering paraneoplastic neurological syndromes as an initial presentation of an occult gynecological malignancy. 1 Introduction Secondary metastatic lesions to the colorectum are infrequent, occurring in approximately 1% of all colorectal neoplasms [ 1 2 3 4 5 6 3 4 5 7 8 9 2 Case History and Examination A 69‐year‐old woman with an 18‐month history of lower limb paresthesia was referred to a neurology clinic for investigation. She had a past medical history of hypothyroidism, diverticular disease, anxiety, and asthma, and had a previous right ovarian cyst resection at age 30. The patient had a family history of pancreatic cancer in one first‐degree relative and colorectal cancer in another first‐degree relative. Electromyography and nerve conduction studies showed predominantly sensory demyelinating peripheral neuropathy and bilateral common peroneal neuropathy at the level of the fibular neck. Autoimmune serology was positive for anti‐Yo antibodies and anti‐Ro52 antibodies, which prompted investigation for a paraneoplastic etiology by means of computed tomography (CT) of the chest, abdomen, and pelvis (CAP) (Figure 1 FIGURE 1 CT images. (a) A bilobed solid lesion was seen within the pericolic fat posteriorly abutting the sigmoid colon. The lesion extended over a length of 38 mm in the coronal plane. (b) The solid lesion measured 25 mm in the axial plane. (c) Focal ovoid area of soft tissue thickening within the sigmoid colon at the left iliac fossa. The lesion involved the colonic wall and measured approximately 35 mm. 3 Investigation, Differential Diagnoses and Treatment The patient was subsequently referred to our hospital based on suspicion of paraneoplastic syndrome associated with primary colon cancer. Blood examination results showed elevated tumor marker levels (carbohydrate antigen 125 = 88 U/mL [reference range: < 35 U/mL] and carbohydrate antigen 19–9 = 69 U/mL [reference range: < 37 U/mL]). A colonoscopy showed localized inflammation and thickening in the sigmoid colon and scattered diverticula in the descending colon (Figure 2 3 4 FIGURE 2 Colonoscopy showing diverticulosis in the descending colon and localized thickening and inflammation in the sigmoid colon. FIGURE 3 Histological evaluation of the colon biopsy (hematoxylin and eosin, magnification 40×). Within the submucosa, there is a lesional nodule composed of neoplastic epithelioid cells with hyperchromatic nuclei and abundant eosinophilic cytoplasm. The lesion does not involve the overlying mucosa. FIGURE 4 PET Whole Body FDG Study. (a) Coronal view showing two foci of FDG uptake. The crosshairs indicate the location of the soft tissue sigmoid lesion. (b) Axial view showing intense FDG uptake in the soft tissue sigmoid lesion. Following multi‐disciplinary discussion, the consensus was that the patient had a paraneoplastic neurological syndrome associated with anti‐Yo antibodies secondary to multiple colonic malignancies. It was unclear at this point whether the lesions were primary or metastatic. Given the diagnostic uncertainty, an extensive workup was required, which accounted for the 6‐month interval between initial presentation and surgery. Immunomodulating therapies such as corticosteroids or intravenous immunoglobulin were not administered, given the limited evidence of benefit in paraneoplastic subacute sensory neuropathy and the prioritization of definitive oncological surgery. Laparoscopic high anterior resection was subsequently performed. At the time of the initial surgery, the ovaries were grossly atrophic, consistent with the patient's age. The resected specimen (Figure 5 6 FIGURE 5 Postoperative evaluation of the colonic resection. (a) Multiple pale lesions seen on serosal surface. (b) Cut surface showing a gray lesion within the bowel wall that is not originating from the mucosa. (c) Nodule located within the pericolic fat. FIGURE 6 Histological evaluation of the colonic resection. (a) Within the muscularis propria and submucosa, there is an unencapsulated lesion composed of discohesive sheets of epithelioid cells. The lesion does not involve the overlying mucosa (hematoxylin and eosin, magnification 100×). (b) At higher power, the lesional cells contain enlarged, hyperchromatic, pleomorphic nuclei with prominent nucleoli, coarse chromatin, and moderate amounts of eosinophilic cytoplasm (hematoxylin and eosin, magnification 200×). (c) The lesional cells show patchy nuclear positivity for PAX8. (d) The lesional cells show diffuse nuclear positivity for WT1. Whilst the location of the potential primary cancer was not confirmed, six cycles of chemotherapy with carboplatin/paclitaxel (dose reduced for her pre‐existing peripheral neuropathy) were administered, with interval debulking, based on histopathology and radiological findings. Interval cytoreductive surgery, which included total laparoscopic hysterectomy, bilateral salpingo‐oophorectomy, and infra‐colic omentectomy, was performed after the 4th cycle of chemotherapy. The right fallopian tube was intraoperatively found to be adherent to the small bowel mesentery. Histopathological examination was conducted on the postoperative specimens using the sectioning and extensively examining the fimbriated end (SEE‐FIM) protocol, which revealed a 1 mm focus of HGSC associated with the right fallopian tube fimbriae (Figure 7 FIGURE 7 Histological evaluation of the fallopian tube. (a) Sections show the fimbriae of the right fallopian tube containing a well‐circumscribed nodule of lesional cells surrounded by reactive lymphocytes (hematoxylin and eosin, magnification 40×). (b) At higher power, the lesional cells are epithelioid with enlarged, pleomorphic nuclei and abundant clear to eosinophilic cytoplasm (hematoxylin and eosin, magnification 200×). (c) The lesional cells show diffuse nuclear positivity for PAX8. (d) The lesional cells show diffuse nuclear positivity for WT1. 4 Outcome and Follow‐Up The patient completed chemotherapy 6 weeks after cytoreductive surgery. Subsequent serum tumor markers were normal, and repeat CT CAP and PET scans showed no evidence of disease. Improvement in her neurological symptoms was first noted 4 months after completing chemotherapy. The patient has been followed up every 3 months with an oncologist and periodically with a neurologist. Over the 2‐year follow‐up period since the operation, there has been no evidence of recurrent disease, and the patient's neurological symptoms have significantly improved but remain present. A timeline of the patient's clinical course is shown in Figure 8 FIGURE 8 Timeline of the patient's clinical course. 5 Discussion Diagnosis of colonic metastasis from a carcinoma of tubo‐ovarian origin can be challenging, especially when there are no signs of the primary tumor. To our knowledge, this is the only reported case of a primary fallopian tube carcinoma with a colon metastasis presenting with neurological symptoms in the absence of gynecological or gastrointestinal symptoms. The radiological findings of our patient were compatible with primary colon cancer, and the bilateral ovaries and fallopian tubes showed no radiological signs of malignancy, possibly due to the small size of the primary tumor. Usui et al. [ 6 The initial presentation of our patient was characterized by lower limb paresthesia, which was attributed to a paraneoplastic neurological syndrome. The presence of onconeural antibodies is highly suggestive of an underlying tumor, and if a malignancy is not initially identified, the presence of an occult neoplasm must be assumed [ 7 7 8 8 9 8 10 9 11 12 13 14 15 16 17 18 19 Additionally, anti‐Ro52 antibody, which was detected in our patient, has been described to be significantly more prevalent in patients with ovarian cancer compared to in patients with colorectal cancer [ 20 Furthermore, perhaps re‐biopsy of the thickened sigmoid could have been performed to provide sufficient material for IHC examination before colonic resection. This potentially could have changed the sequence of this patient's surgeries and chemotherapy. The staining pattern of our patient's sigmoid tumors showed KRT7+/KRT20– and positive PAX8 and WT1, which was highly suggestive of an ovarian origin [ 21 22 1 TABLE 1 Summary of the IHC results. Colonic resection Fallopian tube KRT7 Positive Not performed KRT20 Negative Not performed CDX2 Negative Not performed MNF116 Positive Positive PAX8 Positive Positive WT1 Positive Positive ER Positive Positive PR Positive Negative p53 Positive Positive p16 Positive Positive SATB2 Negative Not performed TTF1 Negative Not performed GATA3 Negative Not performed Chromogranin Negative Not performed Synaptophysin Negative Not performed Calretinin Negative Not performed KRT5/6 Negative Not performed D2‐40 Negative Not performed  Note: In conclusion, we present our lessons learned from an unusual case of HGSC of the right fallopian tube fimbriae with colon metastasis presenting with lower limb paresthesia. The presence of neurological symptoms and anti‐Yo antibodies should warrant aggressive investigation for an underlying malignancy, even when clinical or radiological signs are absent. A microscopic HGSC should be considered in female patients presenting with a cancer of unknown origin, particularly when associated paraneoplastic syndromes and antibodies are present. It is important to recognize the diagnostic utility of IHC examination and its effect on treatment decisions. As a result, re‐biopsy should be conducted if insufficient tissue was collected during the initial biopsy of a lesion. Author Contributions  Tyler Ye: Dinuke De Silva: Leonardo D. Santos: Felicia Roncolato: Stanley Levy: Auerilius Erastus Ricardo Hamilton: Consent Written patient consent was obtained for the publication of this case. Conflicts of Interest The authors declare no conflicts of interest. Acknowledgments The authors would like to thank the patient for permitting the publication of their case. Open access publishing facilitated by Western Sydney University, as part of the Wiley–Western Sydney University agreement via the Council of Australian University Librarians. Data Availability Statement Data sharing not applicable to this article as no datasets were generated or analyzed during the current study. References 1 M. Galanopoulos F. Gkeros C. Liatsos Secondary Metastatic Lesions to Colon and Rectum Annals of Gastroenterology 31 3 2018 282 287 29720853 10.20524/aog.2018.0244 PMC5924850 2 D. Pectasides E. Pectasides T. Economopoulos Fallopian Tube Carcinoma: A Review Oncologist 11 8 2006 902 912 16951394 10.1634/theoncologist.11-8-902 3 A. Deliveliotou S. Fotiou E. Karvouni D. Hassiakos G. K. Creatsas Isolated Sigmoid Colon Metastasis From a Primary Fallopian Tube Carcinoma: A Case Report European Journal of Gynaecological Oncology 32 5 2011 585 587 22053683 4 A. K. Gupta O. A. Vazquez Fallopian Tube Tumor Mimicking Primary Gastrointestinal Malignancy Cureus 12 8 2020 e9795 32953309 10.7759/cureus.9795 PMC7494413 5 J. T. Schouten J. L. Weese D. A. Buchler Obstructing Intracolonic Metastases Secondary to Fallopian Tube Adenocarcinoma Wisconsin Medical Journal 81 9 1982 18 20 7147990 6 G. Usui Y. Masuda H. Hashimoto Colon Metastasis From Microscopic Serous Carcinoma of the Fallopian Tube Fimbria Mimicking a Primary Colon Cancer International Journal of Surgical Pathology 27 4 2019 390 395 30663467 10.1177/1066896918824028 7 M. R. Rosenfeld J. Dalmau Diagnosis and Management of Paraneoplastic Neurologic Disorders Current Treatment Options in Oncology 14 4 2013 528 538 23900965 10.1007/s11864-013-0249-1 PMC3844017 8 F. Graus A. Vogrig S. Muniz‐Castrillo Updated Diagnostic Criteria for Paraneoplastic Neurologic Syndromes Neurology Neuroimmunology & Neuroinflammation 8 4 2021 1298 10.1212/NXI.0000000000001014 PMC8237398 34006622 9 M. Viau M. C. Renaud J. Gregoire A. Sebastianelli M. Plante Paraneoplastic Syndromes Associated With Gynecological Cancers: A Systematic Review Gynecologic Oncology 146 3 2017 661 671 28655412 10.1016/j.ygyno.2017.06.025 10 M. Chatterjee L. C. Hurley M. A. Tainsky Paraneoplastic Antigens as Biomarkers for Early Diagnosis of Ovarian Cancer Gynecologic Oncology Reports 21 2017 37 44 28653032 10.1016/j.gore.2017.06.006 PMC5476453 11 S. I. Labidi‐Galy E. Papp D. Hallberg High Grade Serous Ovarian Carcinomas Originate in the Fallopian Tube Nature Communications 8 1 2017 1093 10.1038/s41467-017-00962-1 PMC5653668 29061967 12 C. J. Reade R. M. McVey A. A. Tone The Fallopian Tube as the Origin of High Grade Serous Ovarian Cancer: Review of a Paradigm Shift Journal of Obstetrics and Gynaecology Canada 36 2 2014 133 140 24518912 10.1016/S1701-2163(15)30659-9 13 B. K. Erickson M. G. Conner C. N. Landen Jr. The Role of the Fallopian Tube in the Origin of Ovarian Cancer American Journal of Obstetrics and Gynecology 209 5 2013 409 414 23583217 10.1016/j.ajog.2013.04.019 PMC3937451 14 Y. Wang Y. Bian F. Qiu P. Fang Fallopian Tube Serous Adenocarcinoma With Dizziness as the Initial Symptom: A Case Report Journal of International Medical Research 48 2 2020 1744 10.1177/0300060519871744 PMC7593669 31500488 15 M. Campero A. E. Selman Paraneoplastic Cerebellar Degeneration in a Patient With a Primary Fallopian Tube Adenocarcinoma. A Case Report and Brief Review. Gynecol Oncology Reports 20 2017 90 92 10.1016/j.gore.2017.03.019 PMC5374856 28386581 16 K. J. Selby J. Warner S. Klempner P. A. Konstantinopoulos J. L. Hecht Anti‐Yo Antibody Associated With Occult Fallopian Tube Carcinoma International Journal of Gynecological Pathology 30 6 2011 536 538 21979588 10.1097/PGP.0b013e3182237ca6 17 Y. Tanaka N. Suzuki M. Takao A. Ichikawa N. Susumu D. Aoki Paraneoplastic Cerebellar Degeneration With Fallopian Tube Adenocarcinoma Gynecologic Oncology 99 2 2005 500 503 16126258 10.1016/j.ygyno.2005.06.064 18 R. Land J. Carter R. Houghton K. Atkinson C. Dalrymple Gynaecology Meets Neurology: Paraneoplastic Cerebellar Degeneration Australian & New Zealand Journal of Obstetrics & Gynaecology 45 1 2005 79 81 15730373 10.1111/j.1479-828X.2005.00330.x 19 A. Cain L. Buckingham A. Staley L. H. Clark Paraneoplastic Cerebellar Degeneration Heralding Recurrence of Fallopian Tube Adenocarcinoma: A Case Report and Literature Review Gynecologic Oncology Reports 33 2020 100624 32904367 10.1016/j.gore.2020.100624 PMC7452669 20 D. P. Bogdanos A. Gkoutzourelas V. Papadopoulos Anti‐Ro52 Antibody Is Highly Prevalent and a Marker of Better Prognosis in Patients With Ovarian Cancer Clinica Chimica Acta 521 2021 199 205 10.1016/j.cca.2021.07.006 34245687 21 J. Selves E. Long‐Mira M. C. Mathieu P. Rochaix M. Ilie Immunohistochemistry for Diagnosis of Metastatic Carcinomas of Unknown Primary Site Cancers (Basel) 10 4 2018 108 29621151 10.3390/cancers10040108 PMC5923363 22 K. A. Oien J. L. Dennis Diagnostic Work‐Up of Carcinoma of Unknown Primary: From Immunohistochemistry to Molecular Profiling Annals of Oncology 23 Suppl 10 2012 271 277 10.1093/annonc/mds357 22987975 ",
  "metadata": {
    "Title of this paper": "Diagnostic Work‐Up of Carcinoma of Unknown Primary: From Immunohistochemistry to Molecular Profiling",
    "Journal it was published in:": "Clinical Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495128/"
  }
}