{
  "title": "Paper_941",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12484456 PMC12484456.1 12484456 12484456 41026326 10.1007/s12672-025-03633-6 3633 1 Research Comparative evaluation of CD34 immunohistochemistry and hematoxylin and eosin staining for detection of lymphovascular emboli in oral squamous cell carcinoma: a retrospective cross-sectional study in a developing country Hatgaonkar Kajal kajalhatgaonkar@gmail.com 1 Hatgaonkar Anand 2 Dawande Pratibha 1 Sonkusale Shweta 1 Deshpande Shruti 1 1 2 30 9 2025 12 2025 16 478248 1793 6 5 2025 10 9 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Objectives The primary objective was to evaluate and compare the sensitivity and specificity of CD34 immunohistochemistry (IHC) versus conventional hematoxylin and eosin (H&E) staining in detecting lymphovascular emboli (LVE) in oral squamous cell carcinoma (OSCC). The secondary objective was to correlate LVE detection with tumor size, grade, perineural invasion (PNI), depth of invasion (DOI), worst pattern of invasion (WPOI), and lymph node involvement, with or without extranodal extension (ENE). Methodology A retrospective, cross-sectional comparative analysis based on archival cases from the period of January 2021 to December 2023, in pathology department in a tertiary care hospital in central India. A total of 93 patients diagnosed with OSCC were included. All cases had available formalin-fixed, paraffin-embedded (FFPE) tissue blocks. Inclusion criteria: histologically confirmed OSCC with adequate archived material from all age groups of both sexes. Exclusion criteria: non-oral head and neck malignancies and inadequate tissue blocks. Results A total of 21 cases with LVE were detected. All these LVE were identified by CD34 immunohistochemistry, out of which, 20 cases were also detected by H&E stain. CD34 identified only one additional case of LVE as compared to H&E stain. The difference was not statistically significant (Chi-square = 0.03, p p p p p p p p Conclusions CD34 IHC does not significantly improve detection of LVE over conventional H&E staining in OSCC. However, LVE shows strong associations with several high-risk histopathological features, reaffirming its prognostic importance. In a properly processed sample with competent histopathologists, the routine use of CD34 may not be necessary for detecting LVE in cases of OSCC. Trial registration Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03633-6. Datta Meghe Institute of Higher Education and Research Open access funding provided by Datta Meghe Institute of Higher Education and Research. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction The 16th most prevalent cancer in the world is oral cancer. India tops the list of the highest incidence of oral cancer in both men and women [ 1 2 3 4 5 The American Joint Committee on Cancer (AJCC), eighth edition, takes into consideration the tumor size, local lymph node status, and distant metastatic spread as the parameters for staging the oral cancers [ 6 7 8 The presence of LVE is an important prognostic factor predicting the recurrence of the disease [ 9 10 11 This study takes into consideration the role of CD34 in identifying LVE in all cases of oral cancer, especially those with negative LVE by H&E and lymph node negative status. Aim and objectives The primary objectives of the study were:  To evaluate and compare the sensitivity and specificity of CD34 immunohistochemistry staining and conventional hematoxylin and eosin (H&E) staining in identifying lymphovascular emboli in oral squamous cell carcinoma cases. To investigate the degree of concordance between CD34 immunohistochemistry staining and H&E staining results in identifying lymphovascular emboli, exploring instances of agreement and discrepancy. The secondary objective of the study was to correlate the presence of lymphovascular emboli identified by CD34 staining and H&E staining with other prognostic indicators such as tumor stage, grade, perineural invasion, worst pattern of invasion (WPOI), and lymph node involvement, with or without extranodal extension (ENE). Methods and material This study has employed a retrospective comparative analysis design, involving the examination of all cases of oral squamous cell carcinoma from the period of July 2021 to July 2024. Inclusion criteria All the archived cases of oral squamous cell carcinoma, whose formalin-fixed paraffin-embedded tissue blocks were available in the department of pathology. The oral cavity subsites included were tongue, buccal mucosa & alveolus. The histological subtype included was squamous cell carcinoma. Exclusion criteria Malignancy in the head & neck region apart from those involving tongue, buccal mucosa & alveolus (oral cavity), or any case whose blocks were not available in the archive, were not included in the study. Histological subtype other than squamous cell carcinoma were not included. CD34 immunohistochemistry staining and conventional hematoxylin and eosin (H&E) staining have been performed on sections from each tissue block according to standard protocols. The monoclonal anti-CD34 antibody, clone QBEnd/10, and the Himedia’s Harris Hematoxylin and Eosin stain solution (2%) from Qualigens were used. Appropriate external control was used for H&E stain, while the endothelial lining of the normal vasculature of the oral mucosa acted as internal control for CD34. The histological slides were evaluated by two competent histopathologists. Lymphovascular emboli (LVE) positivity was defined as the presence of tumor cell aggregates within an endothelial-lined space. The statistical analysis was done by using descriptive and inferential statistics using Chi-square, and the software used in the analysis was SPSS 27.0 version and GraphPad 7.0 version. The p value of < 0.05 is considered the level of significance. Observations and results Population characteristics Out of the 93 patients, most were in the age group of 40–50 years, with the mean age being 49 years, and the majority being male patients (57, 61%). The most commonly affected subsite was the buccal mucosa (47, 51%), followed by the alveolus (30, 32%) and lastly the tongue (16, 17%). The most common tumor stage was T3 (47, 51%), followed by T2 (26, 28%), T1 (14, 15%), and T4 (6, 6%). (Fig. 1 2  Fig. 1 Tumor distribution as per location in the oral cavity  Fig. 2 Distribution of patients according to grade of the tumor Among the study groups, a total of 21 cases with LVE were detected. All these LVE were identified by CD34 immunohistochemistry, out of which, 20 cases were also detected by H&E stain. In only one case was the LVE detected by CD34, which was not identified by the regular H&E stain. The chi-square statistic was 0.03. The p-value was 0.86 ( p 1 3 4 5 6  Table 1 Detection of LVI using H&E and CD34  Fig. 3 H & E stained section showing invasive squamous cell carcinoma (yellow arrow), vein (red arrow) and numerous LVI (blue arrow). [100X magnification]  Fig. 4 CD34 stained section showing membranous staining of the endothelial lining of the vein (red arrow). Numerous LVI represented by tumor cell deposits surrounded by CD34 positive endothelial cells (blue arrow). The invasive squamous cell carcinoma is also seen (yellow arrow). [100X magnification]  Fig. 5 H & E stained section showing LVI (blue arrow). Note the endothelial cells are not easily recognised, creating a suspicion of artifactual retraction. [100X magnification]  Fig. 6 CD34 stained section highlighting the endothelial cell lining surrounding the tumor cells, confirming LVI (blue arrow). [100X magnification] Association of LVE with other histological parameters (Table 2  Table 2 Correlation of LVI with other histological parameters Association of lymph node (LN) involvement and LVE In the 60 cases that showed LN involvement, 20 (33.33%) had LVE positive, whereas 40 (66.67%) had LVE negative. In the 33 cases where LN involvement was not seen, LVE was detected in only one (3.03%) case, while the rest of the 32 (96.97%) cases were negative for LVE. The chi-square statistic was 11.18. The p-value was 0.0008. The result is significant at p Association of tumor grade and LVE Five (9.61%) out of 52 WDSCC showed LVE positivity, while 47 (90.38%) were negative. For MDSCC, 13 (35.14%) out of 37 were LVE positive and 24 (64.86%) were negative. For PDSCC, three (75%) out of four were LVE positive and one (25%) was negative. The chi-square statistic was 14.62. The p-value was 0.0007. The result is significant at p Association of perineural invasion (PNI) and LVE 20 (37.74%) cases had both LVE and PNI, while 39 (97.5%) cases had neither. 33 (62.26%) had PNI but did not show LVE. The chi-square statistic was 16.19. The p-value was 0.00006. The result is significant at p Association of depth of invasion (DOI) and LVE 19 (38.78%) cases with DOI > 1.0 cm displayed LVE, whereas only 1 (7.14%) and 1 (3.33%) with DOI of less than or equal to 0.5 cm and between 0.5 and 1.0 cm had LVE. The chi-square statistic was 15.62. The p-value was 0.0004. The result is significant at p Association of worst pattern of invasion (WPOI) and LVE 19 (63.33%) of type 4 WPOI had LVE, whereas 50 (96.15%) of type 3 did not have LVE. (Fig. 7 p  Fig. 7 Worst Pattern of Invasion (WPOI). Pattern I (A); Pattern II (B); Pattern III (C); Pattern IV (D); Pattern V (E). [H & E; 40X magnification] Association of tumor size (T) and LVE In the current study, none of the tumors larger than 4 cm showed LVE, whereas 10 (31.25%) tumors with size ≤ 2 cm and 11 (22.0%) tumors with sizes between 2 and 4 cm had LVE. The chi-square statistic was 4.59. The p-value was 0.1005 ( p Association of extra-nodal extension (ENE) and LVE Although LN involvement showed a significant association with LVE, extra-nodal extension did not, with the chi-square statistic value of 1.75 and the p-value of 0.19 ( p Discussion There are several microscopic features that affect the prognosis of oral cancer that are not included in the AJCC TNM staging. The features have been shown to affect the prognosis of the patients. Many patients have a combination of two or more adverse histopathological features. The study showed a positive correlation of LVE with LN involvement, tumor grade, PNI, WPOI, and DOI, whereas no positive correlation was observed with tumor size and ENE. The study showed that CD34 immunohistostaining to diagnose lymphovascular emboli is unnecessary in practical settings, and H&E staining may be sufficient to diagnose lymphovascular emboli. LVE detection by IHC CD34 AND H&E The current study explored the detection of lymphovascular emboli (LVE) using CD34 immunohistochemistry (IHC) compared to the conventional Hematoxylin & Eosin (H&E) staining method. The study found that CD34 detected LVE in 21 cases, while H&E detected it in 20 cases. The chi-square statistic of 0.03 and a p-value of 0.86 suggest no significant difference between the two methods in LVE detection ( p 12 13 Correlation of LVE with tumor size (T stage) The current study found no significant correlation between tumor size (T stage) and LVE, with the chi-square statistic at 4.59 and a p-value of 0.1005 ( p 14 p Correlation of LVE with lymph node involvement A significant association between LVE and lymph node (LN) involvement was observed in the current study (Chi-square = 11.18, p 15 14 p p Correlation of LVE with tumor grade The current study demonstrated a significant correlation between LVE and tumor grade (Chi-square = 14.62, p 13 p 16 Correlation of LVE with WPOI The current study found a significant correlation between LVE and worst pattern of invasion (WPOI) (Chi-square = 35.96, p 17 P Correlation of LVE with PNI The current study demonstrated a significant association between LVE and perineural invasion (PNI) (Chi-square = 16.19, p 14 p 13 Correlation of LVE with DOI p 18 p Each of the above histological parameters are recognised as poor prognostic factors, individually. The combined presence of LVE with a higher tumor grade, greater DOI, presence of PNI, higher WPOI, and lymph node involvement, suggest a higher likelihood of metastases extension or recurrence of the tumor. Thus, their combined presence often leads to more aggressive treatment protocol in the form of postoperative chemotherapy and/or radiotherapy. A more intense surveillance may be suggested to monitor for metastases or recurrence in such cases [ 14 19 Conclusion The study showed that using the immunohistochemistry marker for endothelial cells—CD34—does not improve the diagnostic efficacy for lymphovascular emboli over careful examination of the routine Hematoxyline & Eosin-stained sections. The combined presence of lymphovascular emboli with a higher tumor grade, greater depth of invasion, presence of perineural invasion, higher worst pattern of invasion, and lymph node involvement, suggest a higher likelihood of metastases extension or recurrence of the tumor. Their combined presence suggests a higher likelihood of metastases extension or recurrence of the tumor. Thus, a combined comprehensive evaluation of several clinical and histopathological factors might be a more definitive way to predict the outcome and often helping in planning a more aggressive treatment protocol and a more intense surveillance program to monitor for metastases or tumor recurrence. Strengths and limitations of this study Strengths The study utilized a dual staining protocol (H&E and CD34 IHC), allowing direct methodological comparison within the same tissue samples. Histopathological evaluation was performed by two independent, experienced pathologists, reducing inter-observer variability. The retrospective design enabled analysis of real-world, archived clinical material with a practical, cost-effective approach. Limitations Being a single-centre study limits external validity and may not capture institutional or regional variations in specimen processing or interpretation. The relatively small sample size also limits the range of patients with different environmental and genetic influences. Lack of association of the presence of lymphovascular emboli and other histological parameters with the long-term follow-up & clinical outcome data, such as recurrence or disease-free survival, limits prognostic interpretation. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions K.H. was the principal investigator and wrote the main script.A.H. helped with the script editing, figures, and tables.P. D. was the guide for the research work and the script reviewer.S.S. and S. D. helped with the statistical analysis, editing, and review of the article. Funding Open access funding provided by Datta Meghe Institute of Higher Education and Research. This research received no specific grant from any funding agency in the public, commercial, or not-for-profit sectors. Data availability Data is provided within the manuscript and the supplementary information files. Declarations Ethics approval and consent to participate The authors confirm that the study was approved by the institutional research ethics committee- DMIHER(DU) via letter number DMIHER(DU)/2024/105 and certify that the study was performed in accordance with the ethical standards as laid down in the 1964 Declaration of Helsinki and its later amendments or comparable ethical standards. The authors affirm that informed consent was obtained from all individual to participate in the study. Consent for publication The authors affirm that informed consent was obtained from all individual for publication of their data and histological images. Competing interests The authors declare no competing interests. References 1. Mouth and oral cancer statistics. WCRF International. https://www.wcrf.org/cancer-trends/mouth-and-oral-cancer-statistics/15.08.2024 2. Balgobind S Cheung VKY Luk P Low THH Wykes J Wu R Prognostic and predictive biomarkers in head and neck cancer: something old, something new, something borrowed, something blue and a sixpence in your shoe Pathology 2024 56 2 170 85 10.1016/j.pathol.2023.11.005 38218691 Balgobind S, Cheung VKY, Luk P, Low THH, Wykes J, Wu R, et al. Prognostic and predictive biomarkers in head and neck cancer: something old, something new, something borrowed, something blue and a sixpence in your shoe. Pathology. 2024;56(2):170–85. 38218691 10.1016/j.pathol.2023.11.005 3. Prabhash K Babu G Chaturvedi P Kuriakose M Birur P Anand AK Indian clinical practice consensus guidelines for the management of squamous cell carcinoma of head and neck Indian J Cancer 2020 57 S1 5 10.4103/0019-509X.278971 32167063 Prabhash K, Babu G, Chaturvedi P, Kuriakose M, Birur P, Anand AK, et al. Indian clinical practice consensus guidelines for the management of squamous cell carcinoma of head and neck. Indian J Cancer. 2020;57:S1–5. 32167063 10.4103/0019-509X.278971 4. Jerjes W Upile T Petrie A Riskalla A Hamdoon Z Vourvachis M Karavidas K Jay A Sandison A Thomas GJ Kalavrezos N Hopper C Clinicopathological parameters, recurrence, locoregional and distant metastasis in 115 T1-T2 oral squamous cell carcinoma patients Head Neck Oncol 2010 2 9 10.1186/1758-3284-2-9 20406474 PMC2882907 Jerjes W, Upile T, Petrie A, Riskalla A, Hamdoon Z, Vourvachis M, Karavidas K, Jay A, Sandison A, Thomas GJ, Kalavrezos N, Hopper C. Clinicopathological parameters, recurrence, locoregional and distant metastasis in 115 T1-T2 oral squamous cell carcinoma patients. Head Neck Oncol. 2010;2:9. 10.1186/1758-3284-2-9. 20406474 10.1186/1758-3284-2-9 PMC2882907 5. Comer J Harris A Hess A Hitchcock K Mendenhall W Bates J Dziegielewski P Does lymphovascular invasion predict survival in oral cancer? A population-based analysis Oral Oncol 2023 140 106387 10.1016/j.oraloncology.2023.106387 37011428 Comer J, Harris A, Hess A, Hitchcock K, Mendenhall W, Bates J, Dziegielewski P. Does lymphovascular invasion predict survival in oral cancer? A population-based analysis. Oral Oncol. 2023;140:106387. 10.1016/j.oraloncology.2023.106387. 37011428 10.1016/j.oraloncology.2023.106387 6. American Joint Committee on Cancer. ACS. 2023. http://www.cancerstaging.org 7. Gangane NM Ghongade PV Patil BU Manisha Atram Oral cavity cancer incidence and survival trends: A population-based study J Cancer Res Ther 2024 10.4103/jcrt.jcrt_2720_22 38261454 Gangane NM, Ghongade PV, Patil BU, Manisha Atram. Oral cavity cancer incidence and survival trends: A population-based study. J Cancer Res Ther. 2024. 10.4103/jcrt.jcrt_2720_22. 38261454 10.4103/jcrt.jcrt_2720_22 8. Tan A Taskin T Tumor budding should be in oral cavity cancer reporting: A retrospective cohort study based on tumor microenvironment Cancers 2023 15 3905 10.3390/cancers15153905 37568721 PMC10416929 Tan A, Taskin T. Tumor budding should be in oral cavity cancer reporting: A retrospective cohort study based on tumor microenvironment. Cancers. 2023;15:3905. 10.3390/cancers15153905. 37568721 10.3390/cancers15153905 PMC10416929 9. Cassidy R Switchenko J Jegadeesh N Association of lymphovascular space invasion with locoregional failure and survival in patients with Node-Negative oral tongue cancers JAMA Otolaryngol Head Neck Surg 2017 143 4 382 8 10.1001/jamaoto.2016.3795 28097311 PMC5398912 Cassidy R, Switchenko J, Jegadeesh N, et al. Association of lymphovascular space invasion with locoregional failure and survival in patients with Node-Negative oral tongue cancers. JAMA Otolaryngol Head Neck Surg. 2017;143(4):382–8. 10.1001/jamaoto.2016.3795. 28097311 10.1001/jamaoto.2016.3795 PMC5398912 10. Chaturvedi P Prabhash K Babu KG Kuriakose M Birur P Anand AK Indian clinical practice consensus guidelines for the management of oral cavity cancer: update 2022 Cancer Res Stat Treat 2024 7 S6 11 10.4103/crst.crst_119_23 32167064 Chaturvedi P, Prabhash K, Babu KG, Kuriakose M, Birur P, Anand AK, et al. Indian clinical practice consensus guidelines for the management of oral cavity cancer: update 2022. Cancer Res Stat Treat. 2024;7:S6–11. 10.4103/crst.crst_119_23. 10.4103/0019-509X.278975 32167064 11. Alves AP Paula DS Lima LV Dantas TS Mota MR Sousa FB Silva PG Is immunohistochemistry more sensitive than hematoxylin-eosin staining for identifying perineural or lymphovascular invasion in oral squamous cell carcinoma? A systematic review and meta-analysis Med Oral Patol Oral Cir Bucal 2022 27 3 e238 47 10.4317/medoral.25114 35420066 PMC9054170 Alves AP, Paula DS, Lima LV, Dantas TS, Mota MR, Sousa FB, Silva PG. Is immunohistochemistry more sensitive than hematoxylin-eosin staining for identifying perineural or lymphovascular invasion in oral squamous cell carcinoma? A systematic review and meta-analysis. Med Oral Patol Oral Cir Bucal. 2022;27(3):e238–47. 10.4317/medoral.25114. 35420066 10.4317/medoral.25114 PMC9054170 12. O’Donnell RK Feldman M Mick R Muschel RJ Immunohistochemical method identifies lymphovascular invasion in a majority of oral squamous cell carcinomas and discriminates between blood and lymphatic vessel invasion J Histochem Cytochem 2008 56 9 803 10 10.1369/jhc.2008.950790 18505934 PMC2516958 O’Donnell RK, Feldman M, Mick R, Muschel RJ. Immunohistochemical method identifies lymphovascular invasion in a majority of oral squamous cell carcinomas and discriminates between blood and lymphatic vessel invasion. J Histochem Cytochem. 2008;56(9):803–10. 10.1369/jhc.2008.950790. 18505934 10.1369/jhc.2008.950790 PMC2516958 13. Mascitti M Togni L Caponio VCA Zhurakivska K Bizzoca ME Contaldo M Lymphovascular invasion as a prognostic tool for oral squamous cell carcinoma: a comprehensive review Int J Oral Maxillofac Surg 2022 51 1 1 9 10.1016/j.ijom.2021.03.007 33814227 Mascitti M, Togni L, Caponio VCA, Zhurakivska K, Bizzoca ME, Contaldo M, et al. Lymphovascular invasion as a prognostic tool for oral squamous cell carcinoma: a comprehensive review. Int J Oral Maxillofac Surg. 2022;51(1):1–9. 10.1016/j.ijom.2021.03.007. 33814227 10.1016/j.ijom.2021.03.007 14. Huang Q Huang Y Chen C Prognostic impact of lymphovascular and perineural invasion in squamous cell carcinoma of the tongue Sci Rep 2023 13 3828 10.1038/s41598-023-30939-8 36882521 PMC9992656 Huang Q, Huang Y, Chen C, et al. Prognostic impact of lymphovascular and perineural invasion in squamous cell carcinoma of the tongue. Sci Rep. 2023;13:3828. 10.1038/s41598-023-30939-8. 36882521 10.1038/s41598-023-30939-8 PMC9992656 15. Huang S, Zhu Y, Cai H, Zhang Y, Hou J. Impact of lymphovascular invasion in oral squamous cell carcinoma: a meta-analysis. Oral Surg Oral Med Oral Pathol Oral Radiol. 2021;131(3):319-328.e1. doi.org/10.1016/j.0000.2020.10.026. 10.1016/j.oooo.2020.10.026 33309267 16. Khan SJ Gawande M Hande AH Patil SK Sonone AM Correlation of pattern of invasion, stromal inflammation and lymphovascular invasion with histopathological grading in oral squamous cell carcinoma: A retrospective study Cureus 2024 16 1 e52233 10.7759/cureus.52233 38352087 PMC10861803 Khan SJ, Gawande M, Hande AH, Patil SK, Sonone AM. Correlation of pattern of invasion, stromal inflammation and lymphovascular invasion with histopathological grading in oral squamous cell carcinoma: A retrospective study. Cureus. 2024;16(1):e52233. 10.7759/cureus.52233. 38352087 10.7759/cureus.52233 PMC10861803 17. Yasuda M Chiodo C Lilley C Mehrotra S Ananthanarayanan V Ziegler A Thorpe E Relationship between worst pattern of invasion and extranodal extension in oral tongue squamous cell carcinomas Head Neck Pathol 2023 17 2 460 6 10.1007/s12105-023-01531-3 36723853 PMC10293494 Yasuda M, Chiodo C, Lilley C, Mehrotra S, Ananthanarayanan V, Ziegler A, Thorpe E. Relationship between worst pattern of invasion and extranodal extension in oral tongue squamous cell carcinomas. Head Neck Pathol. 2023;17(2):460–6. 10.1007/s12105-023-01531-3. 36723853 10.1007/s12105-023-01531-3 PMC10293494 18. Moore AE Alvi SA Tarabichi O Zhu VL Buchakjian MR Role of lymphovascular invasion in oral cavity squamous cell carcinoma regional metastasis and prognosis. Annals of otology Rhinology Laryngology 2024 133 3 300 6 10.1177/00034894231211116 PMC11578272 37927046 Moore AE, Alvi SA, Tarabichi O, Zhu VL, Buchakjian MR. Role of lymphovascular invasion in oral cavity squamous cell carcinoma regional metastasis and prognosis. Annals of otology. Rhinology Laryngology. 2024;133(3):300–6. 10.1177/00034894231211116. 10.1177/00034894231211116 PMC11578272 37927046 19. Rahat M, Aslam Shahzad U, Ara N, Ud Din H, Parveen B, Khan N, Munir S, Mumtaz H. Worst pattern of invasion in oral squamous cell carcinoma: an independent prognostic indicator. J Oral Biol Craniofac Res 2025 May-Jun;15(3):638–44. 10.1016/j.jobcr.2024.12.008. 10.1016/j.jobcr.2024.12.008 PMC12013481 40265143 ",
  "metadata": {
    "Title of this paper": "Role of lymphovascular invasion in oral cavity squamous cell carcinoma regional metastasis and prognosis. Annals of otology",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484456/"
  }
}