{
  "title": "Paper_771",
  "abstract": "pmc Adv Radiat Oncol Adv Radiat Oncol 3239 adro Advances in Radiation Oncology 2452-1094 Elsevier PMC12466126 PMC12466126.1 12466126 12466126 41020280 10.1016/j.adro.2025.101879 S2452-1094(25)00166-6 101879 1 Scientific Article Clinical Efficacy of Hydrogen Therapy on Acute Radiation Enteritis and Inflammatory Response in Patients with Cervical Cancer Undergoing Concurrent Chemoradiation Therapy Liu Bo PhD a b c 1 Bao Yao MD a 1 Ma Jinan PhD a 1 Wang Xiaodong PhD a Feng Yeqian PhD fengyeqian@csu.edu.cn a ⁎ a b c ⁎ fengyeqian@csu.edu.cn 1 B.L., Y.B., and J.M. contributed equally to this work. 11 2025 19 8 2025 10 11 497594 101879 21 11 2024 31 7 2025 19 08 2025 27 09 2025 29 09 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Purpose Acute radiation enteritis (ARE) is a common toxic inflammatory reaction in patients with cervical cancer undergoing concurrent chemoradiation therapy (CCRT). Molecular hydrogen, as a novel antioxidant and anti-inflammatory agent, may alleviate treatment-related toxicity. This study aimed to evaluate the efficacy of inhaled hydrogen in preventing ARE and modulating systemic inflammation. Methods Eligible patients with cervical cancer undergoing CCRT were prospectively enrolled and randomized into an experimental group (n = 28) or a control group (n = 30). The experimental group received inhalation therapy with a hydrogen-oxygen gas mixture (66.6% hydrogen, 33.3% oxygen; 3 L/min, 2 h/d) on each radiation therapy day. Inflammatory biomarkers—including C-reactive protein, neutrophil-to-lymphocyte ratio, platelet-to-lymphocyte ratio, and interleukin 6—as well as hemogram parameters, fecal occult blood, Late Effects Normal Tissue Task Force—Subjective, Objective, Management, and Analytic scores; Patient-Generated Subjective Global Assessment scores; and Radiation Therapy Oncology Group enteritis grades were monitored during treatment and Response Evaluation Criteria in Solid Tumors scores. Results Baseline characteristics (age, tumor stage, pathology, and surgical history) were balanced between groups ( P P P Conclusion Hydrogen inhalation is a safe and effective adjunctive therapy that significantly alleviates inflammation and mitigates clinical symptoms of ARE in patients with cervical cancer who are undergoing CCRT, without compromising antitumor treatment outcomes. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Cervical cancer is the fourth most common cancer among women worldwide and ranks as one of the leading causes of cancer-related deaths. 1 2 3 4 5 6 6 , 7 7 , 8 Recently, hydrogen therapy has emerged as a promising anti-inflammatory and antioxidant intervention owing to its unique biological properties. 9 10 , 11 10 12 13 9 , 14 Key clinical and inflammatory biomarkers have emerged as crucial indicators of systemic inflammatory responses and prognostic outcomes in cancer patients. The neutrophil-to-lymphocyte ratio (NLR) and platelet-to-lymphocyte ratio (PLR) reflect the balance between tumor-associated inflammation and antitumor immune surveillance and have been shown to be valuable tools for monitoring treatment response and disease progression. 15 16 17 , 18 19 20 21 22 23 , 24 Given the unique anti-inflammatory and antioxidant properties of hydrogen, this prospective clinical study aimed to systematically evaluate its therapeutic potential in the prevention and mitigation of ARE. Specifically, the study investigated the impact of hydrogen inhalation on inflammatory biomarkers (NLR, PLR, and IL-6), nutritional status (PG-SGA sores), patient-reported gastrointestinal symptoms, and overall QoL in patients with cervical cancer undergoing CCRT. Methods and Materials Object of research This prospective study enrolled patients with a pathologic diagnosis of cervical cancer who received CCRT at the oncology department of Hospital A between February 2023 and December 2023. Inclusion criteria were as follows: (1) pathologic confirmation of cervical cancer (including squamous cell carcinoma, adenocarcinoma, and adenosquamous carcinoma) with indications for CCRT as per the National Comprehensive Cancer Network Cervical Cancer Guidelines 25 Regimen of concurrent CCRT All patients in this study received concurrent CCRT. The chemotherapy regimen followed the recommendations of the National Comprehensive Cancer Network Cervical Cancer Guidelines (2023 version 1) and the Chinese Society of Clinical Oncology Cervical Cancer Treatment Guidelines (2023). 25 , 26 For the RT regimen, patients who required adjuvant treatment after surgery (with a vaginal margin distance > 0.5 cm) received pelvic external beam RT using intensity modulated RT, with a dose of 45 to 50 Gy in 25 fractions (5 days per week, with weekends off), over a period of 5 weeks. Patients who did not undergo surgery or had a vaginal margin distance ≤ 0.5 cm after surgery received intracavitary brachytherapy, with a dose of 6 Gy per fraction, administered in 5 sessions. Patients with positive pelvic or abdominal lymph nodes could receive an additional 10 to 15 Gy. Methods The experimental group received concurrent hydrogen inhalation therapy from days 1 to 25 of RT. Specifically, on each RT day, patients inhaled a hydrogen-oxygen gas mixture (66.6% hydrogen and 33.3% oxygen by volume) via a nasal cannula either before or after RT, with each session lasting for 2 hours at a flow rate of 3 L/min. The hydrogen-oxygen gas mixture was prepared using a hydrogen-oxygen nebulizer, with purified water as the source material, by electrolyzing water to generate the gas. This solution was administered 5 times per week, totaling 25 sessions, on the same days as external beam RT. The hydrogen-oxygen gas mixture was prepared using the AMS-H-03 hydrogen-oxygen nebulizer, manufactured by Shanghai Asclepius Meditech Co, Ltd. The control group did not receive any additional gas inhalation during RT. According to the Radiation Therapy Oncology Group (RTOG)/European Organization for Research and Treatment of Cancer criteria, patients who developed grade 2 radiation enteritis were treated with “montmorillonite powder, 1 sachet 3 times daily” or “loperamide, 2 capsules initially, followed by 1 capsule after each episode of diarrhea.” 27 27 Evaluation indicators During RT, samples were regularly sent to the laboratory of Hospital A for testing relevant indicators. Testing was conducted on days 0, 5, 10, 15, 20, and 25 of RT. The tests included estimation of hemoglobin levels, platelet counts, neutrophil counts, lymphocyte counts, C-reactive protein (CRP) levels, IL-6 levels, and presence of fecal occult blood. On days 0, 5, 10, 15, 20, and 25 of RT, the Late Effects Normal Tissue Task Force—Subjective, Objective, Management, Analytic (LENT-SOMA) scale 28 On day 25 of RT, the RTOG acute radiation injury grading system was used to assess intestinal reactions, categorized as grade 0 (no significant discomfort), grade 1 (increased bowel movements or altered bowel habits without medication), grade 2 (diarrhea and pain requiring symptomatic treatment), grade 3 (abdominal distension with intestinal dilation on radiograph, requiring parenteral nutrition), and grade 4 (intestinal obstruction, perforation, fistula, or significant bleeding requiring transfusion). The severity of acute enteritis was compared between the 2 groups. On day 25 of RT, the Response Evaluation Criteria in Solid Tumors (RECIST) was used to assess tumor response. The RECIST criteria classify tumor response into complete response (CR, disappearance of all target lesions), partial response (PR, at least a 30% decrease in the sum of diameters of target lesions), stable disease (no significant change in the sum of diameters of target lesions), and progressive disease (PD, at least a 20% increase in the sum of diameters of target lesions or the appearance of new lesions). The treatment responses of the 2 groups were compared to evaluate the effectiveness of hydrogen therapy for tumor control. Statistical analysis Statistical analysis was performed using SPSS version 25.0 (IBM Corp). Continuous variables with normal distribution were expressed as the mean ± standard deviation (mean ± SD) and compared between groups using the independent samples t-test. For non-normally distributed data, the Wilcoxon rank-sum test was applied. Categorical variables were presented as frequency and percentage (n, %) and compared using the χ 2 P Results Baseline characteristics and safety profile A total of 66 patients were initially enrolled. After accounting for attrition, 28 patients in the experimental group and 30 in the control group were included in the final analysis. There were no statistically significant differences between the 2 groups in terms of age, body mass index (kg/m 2 Table 1 Table E1 Table 1 Baseline characteristics of experimental and control groups Table 1 Characteristic Experimental group (n = 28) Control group (n = 30) t/x2 value P Age, y (n [%]) <60 21 (75.0) 23 (76.7) 0.02 .88 ≥60 7 (25.0) 7 (23.3) BMI kg/m 2 <23.9 17 (60.7) 20 (66.7) 0.22 .63 ≥23.9 11 (39.3) 10 (33.3) FIGO2018 stages II 10 (35.7) 13 (43.3) 0.49 .78 III 18 (64.3) 17 (56.7) Tumor diameter (cm) 4.56 ± 1.55 3.95 ± 1.15 1.69 .095 Pathologic differentiation (n [%]) Well 5 (17.9) 0 (0.0) 8.09 .064 Moderately 15 (53.6) 24 (80.0) Poorly 8 (28.5) 6 (20.0) Pathology (n [%]) Squamous cell carcinoma 24 (85.7) 25 (83.3) 0.06 .8 Adenocarcinoma 4 (14.3) 5 (16.7) Surgery (n [%]) No 21 (75.0) 20 (66.7) 0.48 .48 Yes 7 (25.0) 10 (33.3) Abbreviations: Hydrogen therapy attenuates inflammatory responses and radiation-induced intestinal injury Radiation-induced inflammatory responses play a pivotal role in the pathogenesis of ARE. In this study, a comprehensive panel of biomarkers—including CRP, IL-6, NLR, PLR, fecal occult blood positivity, LENT-SOMA, PG-SGA, and RTOG scores—was used to assess inflammatory responses and radiation-induced intestinal injury. CRP: A systemic inflammation marker CRP, a sensitive acute-phase reactant, serves as a reliable marker of systemic inflammation. 29 Fig. 1 P P P Figure 1 Changes in inflammatory biomarkers and clinical assessment scores between the experimental and control groups during radiation therapy. (A) C-reactive protein (CRP) levels, (B) neutrophil-to-lymphocyte ratio (NLR), (C) platelet-to-lymphocyte ratio (PLR), (D) interleukin-6 (IL-6) levels, (E) Patient-generated subjective global assessment (PG-SGA) scores, and (F) Late effects normal tissue task force – subjective, objective, management, analytic (LENT-SOMA) scores. The data are presented as the mean ± SD. Statistical significance between groups was analyzed at each time point. * P P P P Figure 1 NLR and PLR: Composite hematologic inflammation markers NLR is a widely recognized marker of systemic inflammation, reflecting the dynamic balance between innate immune activation (neutrophils) and adaptive immune competence (lymphocytes). 16 Fig. 1 P P P PLR is another hematologic inflammatory marker associated with immune dysregulation and endothelial activation. 16 Fig. 1 P P IL-6: A key cytokine in ARE IL-6 is a key pro-inflammatory cytokine implicated in radiation-induced tissue damage and mucosal barrier disruption. 19 Fig. 1 P P P P P Fecal occult blood positivity: Indicator of intestinal mucosa integrity Fecal occult blood positivity serves as a noninvasive indicator of radiation-induced intestinal mucosal injury and microbleeding, 30 Table 2 P P P P Table 2 Fecal occult blood positivity (%, n) during radiation therapy (RT) in experimental and control groups Table 2 RT period Experimental group (n = 28) Control group (n = 30) χ 2 P Day 0 17.86% (5) 23.33% (7) 0.613 .43369 Day 5 10.71% (3) 30.00% (9) 4.327 .0375 Day 10 42.86% (12) 56.67% (17) 2.486 .11488 Day 15 39.29% (11) 43.33% (13) 0.569 .451 Day 20 32.14% (9) 60.00% (18) 6.842 .009 Day 25 42.86% (12) 66.67% (20) 5.784 .016 Intergroup comparison 16.278 0 Notes LENT-SOMA score: Integrated evaluation of radiation-induced intestinal toxicity The LENT-SOMA scoring system provides a validated, clinician-assessed measure of gastrointestinal toxicity, especially suited to evaluating radiation-induced intestinal injury. 28 Fig. 1 P P P P P PG-SGA: Nutritional impact of ARE The PG-SGA score is a tool for evaluating nutritional status and symptoms affecting food intake, widely used in oncology supportive care. 22 Fig. 1 P P P RTOG toxicity grading: Overall clinical enteritis severity The RTOG criteria were used to grade the severity of ARE based on clinician-observed gastrointestinal toxicities. 27 Table 3 P Table 3 Radiation Therapy Oncology Group (RTOG) scores at different radiation therapy (RT) days in experimental and control groups Table 3 RT period Experimental group (n = 28) Control group (n = 30) χ 2 P Grade 0 3 (10.71%) 0 (0.00%) Grade 1 18 (64.29%) 9 (30.00%) Grade 2 8 (28.57%) 19 (63.33%) Grade 3 1 (3.57%) 2 (6.67%) Intergroup comparison 9.516 .023 Tumor response remains unaffected by hydrogen inhalation A crucial concern in supportive therapies is whether they interfere with the therapeutic efficacy of RT and chemotherapy. 31 Table 4 P Table 4 Response Evaluation Criteria in Solid Tumors (RECIST) scores at different radiation therapy (RT) days in experimental and control groups Table 4 RT period Experimental group (n = 28) Control group (n = 30) χ 2 P Complete response 20 (71.43%) 24 (80.00%) Partial response 5 (17.86%) 3 (10.00%) Stable disease 1 (3.57%) 0 (0.00%) Progressive disease 2 (7.14%) 3 (10.00%) Intergroup comparison 1.997 .573 Discussion ARE is a frequent and debilitating complication in patients with cervical cancer undergoing RT, primarily resulting from direct radiation-induced injury to the intestinal mucosa and subsequent activation of inflammatory pathways. 4 32 Such adverse effects not only compromise patients’ QoL but may also necessitate treatment interruptions, ultimately diminishing the overall therapeutic efficacy. Molecular hydrogen has demonstrated a unique capacity to selectively scavenge cytotoxic ROS, particularly hydroxyl radicals and peroxynitrite, which are potent mediators of oxidative tissue damage. 13 12 10 , 14 Although no significant differences were observed in levels of hemoglobin, neutrophils, platelets, and lymphocytes between the experimental and control groups during treatment, a marked decline in these indicators was noted over the course of treatment in both groups. This decline is consistent with the myelosuppressive effects of RT, indicating that the impact of RT and chemotherapy on bone marrow hematopoiesis is inevitable. 33 34 NLR and PLR are 2 inflammatory markers that have been extensively studied in recent years in the context of tumors and inflammatory diseases. 16 17 35 , 36 37 P 38 , 39 P 40 19 P 41 The LENT-SOMA scoring system encompasses clinical symptoms and functional assessments, making it suitable for a comprehensive evaluation of post-RT toxicity. Fecal occult blood positivity has been positively correlated with ARE severity and is often accompanied by higher LENT-SOMA scores and more advanced RTOG grades. 30 , 42 28 P 22 P 24 P 7 , 13 Nevertheless, this study has several limitations. The relatively small sample size and short follow-up duration may limit the generalizability of the results. Future studies should incorporate larger, multicenter cohorts with extended follow-up to improve the robustness and external validity of the findings. Additionally, interindividual variability, differences in treatment adherence, and lifestyle factors may have confounded the observed outcomes. Subsequent research should aim to control for these potential confounders to ensure more accurate and reliable conclusions. Conclusion In summary, this study demonstrated that hydrogen inhalation therapy, when administered concurrently with CCRT, significantly attenuates radiation-induced inflammatory responses and intestinal injury in cervical cancer patients, without compromising antitumor efficacy. The favorable safety profile and anti-inflammatory effects of hydrogen suggest its potential as a supportive strategy in the management of acute radiation enteritis. Further studies with larger sample sizes and extended follow-up are warranted to validate these findings and to explore the long-term clinical benefits and mechanisms of hydrogen therapy in oncologic settings. References 1 Bray F. Laversanne M. Sung H. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 74 2024 229 263 38572751 10.3322/caac.21834 2 Chemoradiotherapy for Cervical Cancer Meta-Analysis Collaboration Reducing uncertainties about the effects of chemoradiotherapy for cervical cancer: A systematic review and meta-analysis of individual patient data from 18 randomized trials J Clin Oncol 26 2008 5802 5812 19001332 10.1200/JCO.2008.16.4368 PMC2645100 3 Murai T. Matsuo M. Tanaka H. Efficacy of herbal medicine TJ-14 for acute radiation-induced enteritis: A multi-institutional prospective Phase II trial J Radiat Res 61 2020 140 145 31691810 10.1093/jrr/rrz025 PMC7022136 4 Lu L. Li W. Chen L. Radiation-induced intestinal damage: Latest molecular and clinical developments Future Oncol 15 2019 4105 4118 31746639 10.2217/fon-2019-0416 5 Ding X. Li Q. Li P. Fecal microbiota transplantation: A promising treatment for radiation enteritis? Radiother Oncol 143 2020 12 18 32044171 10.1016/j.radonc.2020.01.011 6 Jian Y. Zhang D. Liu M. Wang Y. Xu ZX. The impact of gut microbiota on radiation-induced enteritis Front Cell Infect Microbiol 11 2021 586392 10.3389/fcimb.2021.586392 PMC8358303 34395308 7 Liu D. Wei M. Yan W. Potential applications of drug delivery technologies against radiation enteritis Expert Opin Drug Deliv 20 2023 435 455 36809906 10.1080/17425247.2023.2183948 8 Yang Q. Qin B. Hou W. Qin H. Yin F. Pathogenesis and therapy of radiation enteritis with gut microbiota Front Pharmacol 14 2023 1116558 10.3389/fphar.2023.1116558 PMC10102376 37063268 9 Johnsen H.M. Hiorth M. Klaveness J. Molecular hydrogen therapy-a review on Clinical studies and outcomes Molecules 28 2023 7785 38067515 10.3390/molecules28237785 PMC10707987 10 Kura B. Slezak J. The protective role of molecular hydrogen in ischemia/reperfusion injury Int J Mol Sci 25 2024 7884 39063126 10.3390/ijms25147884 PMC11276695 11 Chen Y. Yang Y. Tang H. Zhang Z. Zhou X. Xu W. ROS-responsive and pH-sensitive aminothiols dual-prodrug for radiation enteritis Antioxidants (Basel) 11 2022 2145 36358517 10.3390/antiox11112145 PMC9686648 12 Zhao S. Yang Y. Liu W. Protective effect of hydrogen-rich saline against radiation-induced immune dysfunction J Cell Mol Med 18 2014 938 946 24618260 10.1111/jcmm.12245 PMC4119399 13 Hirano S.I. Takefuji Y. Molecular hydrogen protects against various tissue injuries from side effects of anticancer drugs by reducing oxidative stress and inflammation Biomedicines 12 2024 1591 39062164 10.3390/biomedicines12071591 PMC11274581 14 Alwazeer D. Liu F.F. Wu X.Y. LeBaron TW. Combating oxidative stress and inflammation in COVID-19 by molecular hydrogen therapy: Mechanisms and perspectives Oxid Med Cell Longev 2021 2021 5513868 10.1155/2021/5513868 PMC8505069 34646423 15 Nøst T.H. Alcala K. Urbarova I. Systemic inflammation markers and cancer incidence in the UK Biobank Eur J Epidemiol 36 2021 841 848 34036468 10.1007/s10654-021-00752-6 PMC8416852 16 Trinh H. Dzul S.P. Hyder J. Prognostic value of changes in neutrophil-to-lymphocyte ratio (NLR), platelet-to-lymphocyte ratio (PLR) and lymphocyte-to-monocyte ratio (LMR) for patients with cervical cancer undergoing definitive chemoradiotherapy (dCRT) Clin Chim Acta 510 2020 711 716 32919942 10.1016/j.cca.2020.09.008 17 Chen J.L. Huang C.Y. Shih I.L. Prognostic nutritional index and neutrophil-lymphocyte ratio predict toxicities and prognosis in patients with cervical cancer treated with curative radiochemotherapy J Formos Med Assoc 123 2024 671 678 37996325 10.1016/j.jfma.2023.10.022 18 Chen F. Gong X. Zhang K. Nomogram predicting grade ≥2 acute radiation enteritis in patients with cervical cancer receiving concurrent chemoradiotherapy Am J Clin Oncol 47 2024 317 324 38488761 10.1097/COC.0000000000001096 PMC11191554 19 Orange S.T. Leslie J. Ross M. Mann D.A. Wackerhage H. The exercise IL-6 enigma in cancer Trends Endocrinol Metab 34 2023 749 763 37633799 10.1016/j.tem.2023.08.001 20 Eom K.Y. Wee C.W. Song C. The association between diarrhea and serum cytokines in patients with gynecologic cancer treated with surgery and pelvic chemoradiotherapy Clin Transl Radiat Oncol 29 2021 60 64 34159263 10.1016/j.ctro.2021.05.010 PMC8203500 21 Yu W. Xu H. Chen F. Development and validation of a radiomics-based nomogram for the prediction of postoperative malnutrition in stage IB1-IIA2 cervical carcinoma Front Nutr 10 2023 1113588 10.3389/fnut.2023.1113588 PMC9936189 36819703 22 Argefa T.G. Roets L. Malnutrition and the survival of cervical cancer patients: A prospective cohort study using the PG-SGA tool Nutr Cancer 74 2022 605 612 33899611 10.1080/01635581.2021.1910320 23 Ma C.Y. Zhao J. Qian K.Y. Xu Z. Xu X.T. Zhou JY. Analysis of nutritional risk, skeletal muscle depletion, and lipid metabolism phenotype in acute radiation enteritis World J Gastrointest Surg 15 2023 2831 2843 38222011 10.4240/wjgs.v15.i12.2831 PMC10784828 24 Mota A.P. Aredes M.A. De Oliveira Miguel J. Chaves GV. Nutritional status assessed by Patient-Generated Subjective Global Assessment is associated with toxicity to chemoradiotherapy in women with cervical cancer: A prospective study Eur J Clin Nutr 76 2022 1740 1747 35854132 10.1038/s41430-022-01180-9 25 Abu-Rustum N.R. Yashar C.M. Arend R. NCCN Guidelines® Insights: Cervical Cancer, Version 1.2024 J Natl Compr Canc Netw 21 2023 1224 1233 38081139 10.6004/jnccn.2023.0062 26 Xia C. Basu P. Kramer B.S. Cancer screening in China: A steep road from evidence to implementation Lancet Public Health 8 2023 e996 e1005 38000379 10.1016/S2468-2667(23)00186-X PMC10665203 27 Small W. Jr Bosch W.R. Harkenrider M.M. NRG Oncology/RTOG consensus guidelines for delineation of clinical target volume for intensity modulated pelvic radiation therapy in postoperative treatment of endometrial and cervical cancer: An update Int J Radiat Oncol Biol Phys 109 2021 413 424 32905846 10.1016/j.ijrobp.2020.08.061 PMC7856050 28 Anacak Y. Yalman D. Ozsaran Z. Haydaroğlu A. Late radiation effects to the rectum and bladder in gynecologic cancer patients: The comparison of LENT/SOMA and RTOG/EORTC late-effects scoring systems Int J Radiat Oncol Biol Phys 50 2001 1107 1112 11483319 10.1016/s0360-3016(01)01527-9 29 Khalid U. Norman A.R. Andreyev HJ. Elevated C-reactive protein levels are not a feature of uncomplicated radiation-induced bowel injury Eur J Cancer Care (Engl) 16 2007 346 350 17587359 10.1111/j.1365-2354.2006.00759.x 30 Zhang H.X. Li Y.Y. Liu Z.J. Wang JF. Quercetin effectively improves LPS-induced intestinal inflammation, pyroptosis, and disruption of the barrier function through the TLR4/NF-κB/NLRP3 signaling pathway in vivo and in vitro Food Nutr Res 66 2022 10.29219/fnr.v66.8948 PMC9899048 36793340 31 Lorusso D. Xiang Y. Hasegawa K. Pembrolizumab or placebo with chemoradiotherapy followed by pembrolizumab or placebo for newly diagnosed, high-risk, locally advanced cervical cancer (ENGOT-cx11/GOG-3047/KEYNOTE-A18): Overall survival results from a randomised, double-blind, placebo-controlled, phase 3 trial Lancet. 404 2024 1321 1332 39288779 10.1016/S0140-6736(24)01808-7 32 Anderson P.M. Lalla RV. Glutamine for amelioration of radiation and chemotherapy associated mucositis during cancer therapy Nutrients 12 2020 1675 32512833 10.3390/nu12061675 PMC7352314 33 He M. Wang N. Zheng W. Ameliorative effects of ginsenosides on myelosuppression induced by chemotherapy or radiotherapy J Ethnopharmacol 268 2021 113581 10.1016/j.jep.2020.113581 33189841 34 Luo P. Ding Y. He Y. Hydrogen-oxygen therapy alleviates clinical symptoms in twelve patients hospitalized with COVID-19: A retrospective study of medical records Medicine (Baltimore) 101 2022 e27759 10.1097/MD.0000000000027759 PMC8896485 35244034 35 Wisdom A.J. Hong C.S. Lin A.J. Neutrophils promote tumor resistance to radiation therapy Proc Natl Acad Sci U S A 116 2019 18584 18589 31462499 10.1073/pnas.1901562116 PMC6744874 36 Khan S. Mittal S. McGee K. Role of neutrophils and myeloid-derived suppressor cells in glioma progression and treatment resistance Int J Mol Sci 21 2020 1954 32182988 10.3390/ijms21061954 PMC7139844 37 Qin J. Yi S. Zhou H. Efficacy of radiotherapy in combination with first-line immunotherapy and chemotherapy for advanced lung squamous cell carcinoma: A propensity score analysis Front Immunol 14 2023 1138025 10.3389/fimmu.2023.1138025 PMC10227428 37261356 38 Chen F. Chu C. Wang X. Hesperetin attenuates sepsis-induced intestinal barrier injury by regulating neutrophil extracellular trap formation via the ROS/autophagy signaling pathway Food Funct 14 2023 4213 4227 37067254 10.1039/d2fo02707k 39 Zhai Y. Zhou X. Dai Q. Fan Y. Huang X. Hydrogen-rich saline ameliorates lung injury associated with cecal ligation and puncture-induced sepsis in rats Exp Mol Pathol 98 2015 268 276 25746665 10.1016/j.yexmp.2015.03.005 40 Ye D. Li S. Ma Z. Ding Y. He R. Diagnostic value of platelet to lymphocyte ratio in preeclampsia: A systematic review and meta-analysis J Matern Fetal Neonatal Med 36 2023 2234540 10.1080/14767058.2023.2234540 37455131 41 He G. Karin M. NF-κB and STAT3 - key players in liver inflammation and cancer Cell Res 21 2011 159 168 21187858 10.1038/cr.2010.183 PMC3193410 42 Zakaria Z. Toomey D. Deasy J. Radiation-induced distal ileal obstruction complicating ileostomy closure Tech Coloproctol 18 2014 195 198 23512579 10.1007/s10151-013-0997-8 Appendix Supplementary materials  Supplementary materials Image, application 1 Disclosures This work was supported by grants from the research project of xinrui tumor suportive therapy (cphcf-2023-035) for Yeqian Feng. The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Acknowledgments We thank MJEditor ( www.mjeditor.com Sources of support: This work was supported by grants from the research project of xinrui tumor suportive therapy (cphcf-2023-035). Research data are stored in an institutional repository and will be shared upon request to the corresponding author. Supplementary material associated with this article can be found in the online version at doi:10.1016/j.adro.2025.101879 ",
  "metadata": {
    "Title of this paper": "Radiation-induced distal ileal obstruction complicating ileostomy closure",
    "Journal it was published in:": "Advances in Radiation Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466126/"
  }
}