{
  "title": "Paper_873",
  "abstract": "pmc Drugs R D Drugs R D 2559 drugsrd Drugs in R&D 1174-5886 1179-6901 Springer PMC12460200 PMC12460200.1 12460200 12460200 40650795 10.1007/s40268-025-00513-w 513 1 Original Research Article A Bioequivalence Study of Recombinant Human Follicle-Stimulating Hormone Injection Versus Recombinant Human Follitropin For Injection in Healthy Chinese Adult Women Zhang Jigang 1 Zhang Mingjian 1 Xue Wenyuan 1 Zha Yixin 1 Jin Shujing 1 Luo Tianhong 2 Ding Ying 2 Gao Weiwei 2 Ding Xueying dingxueying@126.com 1 Zhu Xiaoyan zhuxiaoyan01@genscigroup.com 2 1 https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 Clinical Research Center, Shanghai General Hospital, Shanghai Jiao Tong University School of Medicine, 2 12 7 2025 9 2025 25 3 497476 241 252 12 5 2025 12 07 2025 26 09 2025 26 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc/4.0/ Open Access http://creativecommons.org/licenses/by-nc/4.0/ Background and Objective This study aimed to evaluate the bioequivalence of a novel prefilled recombinant human follicle-stimulating hormone (rh-FSH) injection (GenSci008) compared with the existing rh-FSH for injection (Jinfollin ® Methods This open-label, randomized, single-center, two-period, two-sequence crossover study involved 24 healthy female volunteers who received single subcutaneous doses of both formulations, separated by a 10-day washout period. Participants underwent pituitary down-regulation using Diphereline ® C max 0-t 0-∞ Results The geometric mean ratios (GMRs) and 90% CIs for baseline-corrected AUC 0-t 0-∞ C max Conclusion The novel prefilled rh-FSH injection (GenSci008) is bioequivalent to the reference formulation (Jinfollin ® GeneScience pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Switzerland AG 2025 Key Points  The studied recombinant human follicle-stimulating hormone (rh-FSH) injection (GenSci008) is bioequivalent to the reference formulation (Jinfollin ® The test and reference formulations showed similar pharmacokinetic profiles in the body, confirming they are bioequivalent. The safety profiles of the two formulations—rh-FSH injection (GenSci008) and the reference formulation (Jinfollin ® Introduction Recombinant human follicle-stimulating hormone (rh-FSH) products have been on the market since 1997 and are mainly used for the treatment of infertility. The approved indications in China, according to the guidelines [ 1 2 Jinfollin ® Currently, the rh-FSH injections available in China include Puregon ® ® By using a prefilled, multi-dose pen injector to deliver rh-FSH subcutaneously with a novel liquid formulation that requires no reconstitution, the treatment process is simplified for both healthcare professionals and patients, enabling more accurate dosing, reducing preparation errors, and increasing overall ease of use [ 3 4 5 6 In addition, due to the strong demand for follicle-stimulating hormone (FSH) products in China and the withdrawal of some urinary-derived FSH options, the introduction of this new rh-FSH injection—offered in an easy-to-use format—is expected to help meet medical needs for flexible dosage adjustment and fill a significant gap in market demand. The clinical use of urinary-derived FSH continues to decline due to several inherent limitations, including reliance on urine for production, batch-to-batch variability, potential adverse effects from urinary protein contaminants, and the theoretical risk of prion transmission. In contrast, rh-FSH formulations overcome these challenges, offering consistent manufacturing quality, stable therapeutic efficacy, and improved safety profiles—factors contributing to their increasing adoption in clinical practice. Furthermore, in some countries, both physicians and patients have recognized that biosimilars offer a more affordable alternative [ 7 8 According to Chinese law and regulation, bioequivalence studies were required to determine whether the test formulation (T) GenSci008 is bioequivalent to the reference formulation (R) Jinfollin ® Material and Methods Ethics and Study Conducts This study was a bioequivalence, randomized, single-center, open-label, two-period, two-sequence crossover study (protocol number: GenSci0082020BE). The study evaluation included pharmacokinetic (PK) parameters, safety parameters, and immunogenicity markers. Participants were admitted to the Phase I unit and stayed for 18 days after being randomized on D0. There was no safety follow-up period. The research protocol, informed consent form, case report form, investigator's brochure, and other related study documentation were approved by the Ethics Committee (EC) of Shanghai General Hospital on Nov 11, 2021. This study was conducted in accordance with the Declaration of Helsinki and followed the standards of Good Clinical Practice (GCP) and any other applicable regulations. All participants provided signed informed consent prior to any procedure. Study Objectives and Endpoints The primary objective of this study was to evaluate the PK profiles of the two formulations (test formulation: rh-FSH injection prefilled pen [Gensci008]; reference formulation: rh-follitropin for injection [Jinfollin ® Primary PK parameters measured included peak concentration ( C max t 0- t 0-∞ T max t ½ z Safety and immunogenicity were also evaluated in this study in both the test sequence and the reference sequence. Adverse events (AEs), serious adverse events (SAEs), physical examination, vital signs, sex hormone levels, gynecological examination, vaginal ultrasound, abdominal ultrasound, laboratory tests, and 12-lead electrocardiogram (ECG) were collected throughout. Antidrug antibody (ADA) screening and confirmation testing were performed before dosing on D1, D11, and D18. If necessary, samples confirmed to be ADA positive would be tested for titers and neutralizing antibodies. Participant Eligibility Healthy female volunteers who fulfilled the following inclusion criteria were eligible: age between 18 and 45 years; body mass index (BMI) between 19 and 28 kg/m 2 The 18–45 age range reflects standard reproductive care guidelines, as ovarian stimulation is generally contraindicated in individuals under 18 years—except for medically necessary fertility preservation—and patients over 45 years typically present with diminished ovarian reserve and significantly lower IVF success rates. This age range also aligns with the demographic profile commonly seen in Chinese assisted reproduction clinics. BMI restrictions (between 19 and 28 kg/m 2 Other key inclusion criteria included (i) baseline sex hormone levels met criteria with FSH <12 IU/L and E2 ≤100 pg/mL; and (ii) the requirement to practice birth control for at least one menstrual cycle and throughout the study period. In addition, other key exclusion criteria were (i) history of FSH hypersensitivity (i.e., OHSS) or PCOS; (ii) history of endocrine disease and thrombotic disorder; (iii) presence of hepatic and renal impairment; (iv) ultrasound-confirmed uterine and bilateral ovarian abnormalities, and abnormal cervical Thinprep Cytologic Test (TCT); and (v) drug and alcohol abuse. Study Design and Process Twenty-four participants were randomized into two sequences, A and B, with 12 participants in each sequence. Both sequences were required to receive a single dose of each test formulation and the reference formulation, and the two sequences were treated simultaneously with crossover administration, with an intermediate washout period of 10 days (Fig. 1 Fig. 1 Study design. T: Gensci008; R: Jinfollin ® Since FSH is an endogenous hormone, pituitary downregulation is necessary to suppress its natural production and ensure a standardized baseline across the study population. Although various agents can achieve this, we selected Diphereline ® 9 All screened participants underwent pituitary downregulation (lead-in phase) by intramuscular injection of Diphereline ® ® For Sequence A participants, a single subcutaneous injection of T 225 IU was given on D1, and serum FSH level was reassessed on D10 to confirm compliance (criteria for FSH: <4 IU/L, elongate washout period for a maximum of another 2 days if not met) before a single subcutaneous injection of R 225 IU was given on day D11. For Sequence B participants, a single subcutaneous injection of R 225 IU was given on D1, and FSH was reassessed on D10 to confirm compliance before receiving a single subcutaneous injection of T 225 IU on D11. Time points for participant PK blood sample collection in each study period were 1 hour prior to dosing and 0.5, 2, 4, 6, 8, 10, 12, 16, 24, 48, 72, 96, 120, 144, and 168 hours after dosing. For the purposes of immunogenicity analysis, participants' blood samples were collected at the following three time points: 1 hour before administration on D1 and D11 and on the day of the D18 second cycle. In order to minimize subject burden, blood samples were collected at the same time as PK blood samples. All PK samples were measured by a validated, double-sandwich, bioanalytical method (MSD ® Blinding and Randomization Participants in this study were randomized using the block sequence randomization method. A total of 24 participants were enrolled and randomized using the SAS 9.4 software PLAN process, which sets the number of seeds. Statistical Analyses Sample Size Lugan et al. enrolled 24 subjects in a pharmacokinetic bioequivalence study comparing the liquid and freeze-dried formulations of Gonal-f, based on an estimated intra-subject coefficient of variation (ISCV) of 15% [ 10 11 ® Pharmacokinetic Analyses In this study, the PK parameters AUC 0-t 0-∞ C max T max z t ½ 0- t 0-∞ C max C max The test and reference formulations were considered equivalent if the 90% CI of the GMR (test/reference) of baseline-corrected AUC 0- t 0-∞ C max C max 0- t 0-∞ 12 T max p Safety Analyses The evaluation of adverse events (AEs) was based on AEs occurring during treatment, defined as treatment-emergent adverse events (TEAEs). The adverse event of special interest (AESI) in this study was OHSS. The adverse events evaluated by the investigators were coded according to System Organ Classification (SOC) and Preferred Term (PT) using the Medical Dictionary for Regulatory Activities (MedDRA) version 25.0. Adverse events were graded according to the National Cancer Institute Common Terminology Criteria for Adverse Events (NCI-CTCAE) version 5.0. Descriptive statistics were performed for safety parameters such as laboratory tests, sex hormones, vital signs, physical examination, 12-lead electrocardiogram, vaginal ultrasound, and gynecological examination, and summaries in shift tables were performed to present normal/abnormal changes (as judged by clinical significance) before and after treatment. Immunogenicity The ADA analytical method is based on a bridging electrochemiluminescence immunoassay (Bridging-ECLIA) using the MSD platform, which includes a screening assay, confirmation assay, and titer assay. Method validation and sample analysis were conducted in accordance with Good Laboratory Practice (GCP) and ICH M10 bioanalytical guidelines. Results Participant Dispositions In this study, a total of 77 participants were screened, of whom 53 failed the screening process (32 participants did not meet the inclusion criteria or met the exclusion criteria, 2 participants withdrew voluntarily, and 19 participants failed the screening for other reasons). A total of 29 participants entered the lead-in phase; 24 participants were randomized, and all of them were given the study drug in the first period; 23 participants were given the study drug in the second period (11 participants in sequence A and 12 participants in sequence B), and 23 participants (11 participants in sequence A [91.7%] and 12 participants in sequence B [100%]) completed the study. One participant discontinued the study due to FSH ≥4 IU/L as assessed by D10 prior to administration in the second period (Fig. 2 Fig. 2 Participant flow diagram Demographics Of the 24 female participants included in the full analysis set, the oldest was 42 years, and the youngest was 23 years, with a mean age of 33.7 ± 4.85 years; 23 (95.8%) were Han Chinese, and 1 (4.2%) was ‘other ethnicities’; the mean height was 157.44 ± 5.781 cm; the mean weight was 58.16 ± 7.475 kg; the mean BMI was 23.45 ± 2.599 kg/m 2 Pharmacokinetics of Gensci008 vs Jinfollin ® The baseline-corrected semi-logarithmic curves of blood concentration time after single 225-IU subcutaneous doses of Gensci008 versus Jinfollin ® 3 Fig. 3 Mean (±SD) corrected semi-log curves of serum concentration–time profile for test formulation (T) and reference formulation (R) The PK parameters for test formulations and reference formulations are shown in Table 1 0- t 0-∞ C max t 0- t 0-∞ C max Table 1 Primary and secondary baseline-corrected PK parameters for test formulations (GenSci008) and reference formulations (Jinfollin ® PK parameter s Statistic Test formulation ( N Reference formulation ( N AUC 0- t N 24 (0) 23 (1) Mean (SD) 43,494.15 (10,148.66) 43,189.12 (9965.68) Geo-Mean 42,284.70 41,968.32 Median 44,986.73 42,688.11 Min, Max 27,158.05, 62,356.52 21,902.29, 64,708.98 AUC 0-∞ N 24 (0) 23 (1) Mean (SD) 50,054.66 (13,236.96) 48,113.36 (11,231.41) Geo-Mean 48,239.97 46,666.28 Median 49,079.50 51,356.70 Min, Max 27,812.43, 74,975.47 24,626.30, 68,035.65 C max N 24 (0) 23 (1) Mean (SD) 566.9 (152.58) 599.43 (152.57) Geo-CV% 29.2 29.1 Median 572.50 611.00 Min, Max 282, 917 253, 957 T max N 24 (0) 23(1) Mean (SD) 21.15 (4.75) 19.90 (8.01) Geo-Mean 20.49 18.64 Median 23.97 16.03 Min, Max 9.98, 24.03 10.02, 48.02 t ½ N 24 (0) 23 (1) Mean (SD) 48.29 (18.99) 44.67 (13.79) Geo-Mean 43.92 42.39 Median 53.31 43.87 Min, Max 14.10, 88.65 15.36, 80.84 AUC 0-∞ AUC 0-t C max Geo-Mean n PK SD T max C max t ½ a Equivalence CIs were also analyzed for the baseline-corrected major PK parameters; GMRs and their 90% CIs for AUC 0- t 0-∞ C max 2 t 0- t 0-∞ C max 0- t 0-∞ C max 3 C max 0- t 0-∞ p Table 2 Statistical comparison of primary baseline-corrected PK parameters for test formulation (GenSci008) and reference formulation (Jinfollin ® Parameter a T/R ratio (%) 90% CI ISCV (%) Power AUC 0-t 99.99 93.57–106.86 13.18 >0.999 AUC 0-∞ 102.70 93.31–113.03 19.16 0.958 C max 93.41 87.77–99.41 12.34 0.994 AUC 0-∞ AUC 0-t C max a Table 3 ANOVA results for baseline-corrected AUC 0-t 0-∞ C max Main factors p AUC 0- t AUC 0-∞ C max Formulations >0.999 0.637 0.074 Sequences 0.844 0.927 0.847 Periods 0.332 0.693 0.149 AUC 0-∞ AUC 0-t C max A Wilcoxon sign test for the PK parameter T max p p T max Safety Of the 24 participants enrolled in the safety set, a total of 16 AEs occurred in nine participants with an incidence of 37.5%, all of which were TEAEs (Table 4 Table 4 Comparison of treatment-emergent adverse events after receiving the test formulation (Gensci008) or reference formulation (Jinfollin ® Test formulation ( N Reference formulation ( N Events, N Participants, N (%) a Events, N Participants, N (%) Total TEAEs 10 6 (25.0) 6 5 (21.7) Drug-related TEAEs b 8 4 (16.7) 2 2 (8.7) Serious AEs 0 0 0 0 Severe TEAEs 0 0 0 0 TEAEs leading to drug discontinuation 0 0 0 0 AESI (OHSS) 0 0 0 0 Total TEAEs by SOC/PT c Investigations 7 4 (16.7) 5 4 (17.4) Glutamate dehydrogenase increased 2 2 (8.3) 1 1 (4.3) Electrocardiogram T wave abnormal 0 0 2 2 (8.7) Alanine aminotransferase increased 1 1 (4.2) 0 0 Neutrophil count decreased 1 1 (4.2) 0 0 Aspartate aminotransferase increased 1 1 (4.2) 0 0 Urine leukocyte esterase positive 0 0 1 1 (4.3) White blood cells urine positive 0 0 1 1 (4.3) Heart rate decreased 1 1 (4.2) 0 0 Electrocardiogram QT prolonged 1 1 (4.2) 0 0 Infections and infestations 1 1 (4.2) 0 0 Upper respiratory tract infection 1 1 (4.2) 0 0 Reproductive system and breast disorders 0 0 1 1 (4.3) Uterine hemorrhage 0 0 1 1 (4.3) Skin and subcutaneous tissue disorders 1 1 (4.2) 0 0 Dermatitis allergic 1 1 (4.2) 0 0 Gastrointestinal disorders 1 1 (4.2) 0 0 Abdominal pain 1 1 (4.2) 0 0 AE AESI PT TEAE a b c For the test formulation phase, there were eight TEAEs in four participants regarded as related to the study drug, with an incidence rate of 16.7%. For the reference formulation phase, a total of two participants experienced two TEAEs regarded as related to the study drug, with an incidence rate of 8.7%. All TEAEs were graded 1–2 in severity, and those graded 2 in severity included ‘neutrophil count decreased’ and ‘dermatitis allergic’, while the remaining TEAEs were all grade 1. All TEAEs were resolved/recovered, except for one participant whose resolution was unknown due to loss of follow-up. The clinical incidence of liver enzyme abnormalities was low, and our single-dose 225-IU design significantly limits cumulative estrogen exposure and hepatic burden. Strict exclusion criteria (ALT/AST >1.5 × upper limit of normal [ULN]; total bilirubin >1.2 × ULN) were implemented to minimize baseline hepatopathy risk. No protocol-defined liver function abnormalities were observed during the study, confirming that the safety profile meets the requirements for bioequivalence trials. The results of safety-related investigations such as clinical laboratory tests, sex hormones, vital signs, physical examination, 12-lead ECG, vaginal ultrasound, and gynecological examination were also generally consistent between the two sequences. No unanticipated safety risks were observed. There were no SAEs, AESIs, serious TEAEs, TEAEs leading to withdrawal, death, TEAEs leading to drug discontinuation, or TEAEs leading to dose reductions that occurred during the course of the study. The AESI for this study was OHSS, and no OHSS occurred during the study. All ADA samples were confirmed to be negative, thus titer and NAb analyses were not conducted. Discussion In this study, we were able to demonstrate the bioequivalence of the rh-FSH injection prefilled pen, Gensci008. As China’s first domestically developed rh-FSH pen device shown to be bioequivalent to the Jinfollin ® Ovarian reserve is usually assessed using biomarkers such as anti-Müllerian hormone (AMH), follicle-stimulating hormone, and estradiol (E2), along with antral follicle count (AFC) and chronological age, all of which provide important predictive information. Although serum AMH levels are widely recognized as a reliable marker of ovarian reserve, they were not considered when determining dosing in this study. As this was a PK-focused bioequivalence study, a fixed-dose regimen was used to minimize variability between subjects. Participants were selected based on baseline FSH (<12 IU/L) and E2 (≤100 pg/mL) levels to ensure a controlled and homogeneous study population, thereby limiting variability unrelated to the rh-FSH formulations. Participants’ age is a critical factor in establishing bioequivalence, as it can influence PK and treatment response. This randomized crossover trial demonstrated a well-balanced age distribution between the two sequence groups (Group A: mean age 34.4 years; Group B: 33.0 years). The randomized allocation and crossover design further minimized the potential for age-related confounding by allowing intra-individual comparisons, thereby strengthening the validity of the bioequivalence assessment. Many patents on biologic agents are nearing expiration, yet the development of new biologics that mimic the original, innovative products has been slow. The development of such agents has been hindered by the difficulties associated with manufacturing and extracting an exact copy of the desired therapeutic protein from living cells. The European Medicines Agency (EMA) has published a number of guidelines regarding the regulatory pathway manufacturers must follow to gain marketing approval for biosimilars [ 8 13 Provisions for Drug Registration 14 Requirements for Registration Classification and Application Dossiers of Biological Products 15 ® Bioequivalence alone does not establish clinical efficacy, which must be demonstrated through further evaluation prior to market use [ 16 ® ® ® 17 18 ® In PK analyses, it is generally necessary to standardize compound levels to assess the bioequivalence of endogenous drugs from a regulatory standpoint, a practice widely supported in numerous studies. Standardizing the baseline often involves subtracting the baseline value of the endogenous compound from its post-treatment value. However, exogenous analogs might influence the production of endogenous substances, and applying a consistent subtraction of the baseline value from all post-treatment values could lead to overcorrection. In order to overcome this hurdle, Diphereline ® ® ® ® This bioequivalence study achieved its goal of demonstrating significant bioequivalence of single 225-IU subcutaneous doses of Gensci008 to the reference formulation, Jinfollin ® 0- t 0-∞ C max T max, C max T max p T max The PK results, after correction, confirmed the bioequivalence of the two formulations. However, the differences can be observed between periods in C max 0- t 0-∞ No statistically significant differences were observed in baseline-corrected C max 0- t 0-∞ p The most common TEAEs that occurred in this study were ‘investigations’. Three participants in this study had an abnormal liver function: one with ‘glutamate dehydrogenase increased’, ‘alanine aminotransferase increased’, and ‘aspartate aminotransferase increased’, two with ‘glutamate dehydrogenase increased’, all of which were found to be abnormal in liver function tests at D18 end-of-study visit. The investigator determined that it was ‘probably related’ to the down-regulating drug—Diphereline ® ® ® ® ® 19 20 ® 21 ® Conclusions The recombinant human follicle-stimulating hormone injection (GenSci008 aqueous injection) developed by GenSci and the marketed recombinant human follitropin for injection (Jinfollin ® We thank Zhe Wang from TransPerfect LLC for the medical writing service provided during the manuscript preparation and submission. Declarations Funding GeneScience sponsored the study. Conflict of Interest Tianhong Luo, Ying Ding, Xiaoyan Zhu, and Weiwei Gao are employees of GeneScience. We have fully considered the conflicts of interest policy, according to the Journal. Availability of Data and Material The data supporting this study's findings are not openly available due to reasons of sensitivity and are available from the corresponding author upon reasonable request. Ethics Approval This study was performed in line with the principles of the Declaration of Helsinki. Approval was granted by the Ethics Committee of Shanghai General Hospital (Date 11 Nov 021/No.[2021]146). Consent to Participate Informed consent was obtained from all individual participants included in the study. Consent for Publication All authors read, approved the final manuscript, and consented to its publication. Code Availability Not applicable. The study used only licensed commercial software without any custom code. Authors’ Contribution All authors contributed to the study's conception and design. Material preparation, data collection, and analysis were performed by Jigang Zhang, Mingjian Zhang, Wenyuan Xue, Yixin Zha, Shujing Jin, Tianhong Luo, Ying Ding, Xiaoyan Zhu, Weiwei Gao, and Xueying Ding. The first draft of the manuscript was written by Jigang Zhang, and all authors commented on previous versions. References 1. Lin-Li H Guo-ning H Hai-xiang H Li-Qing F Yun F Huang S CSRM guideline for the use of ovulation induction drug J Reprod Med 2017 26 302 307 Lin-Li H, Guo-ning H, Hai-xiang H, Li-Qing F, Yun F, Huang S. CSRM guideline for the use of ovulation induction drug. J Reprod Med. 2017;26:302–7. 2. Qiao JM Liu CH Ma JY Li X Yang S Zhang Y La B Wang X Zhu X A consensus of poor ovarian response Chin J Reprod Contracept 2015 35 4 211 223 Qiao JM, Liu CH, Ma JY, Li X, Yang S, Zhang Y, La B, Wang X, Zhu X. A consensus of poor ovarian response. Chin J Reprod Contracept. 2015;35(4):211–23. 3. Schertz J Worton H Patient evaluation of the redesigned follitropin alfa pen injector Expert Opin Drug Deliv 2017 14 4 473 481 10.1080/17425247.2017.1289174 28140682 Schertz J, Worton H. Patient evaluation of the redesigned follitropin alfa pen injector. Expert Opin Drug Deliv. 2017;14(4):473–81. 28140682 10.1080/17425247.2017.1289174 4. Bühler K Managing infertility with the follitropin alfa prefilled pen injector–patient considerations 2015 UK Taylor & Francis 995 1001 10.2147/TCRM.S64222 PMC4492655 26170678 Bühler K. Managing infertility with the follitropin alfa prefilled pen injector–patient considerations. UK: Taylor & Francis; 2015. p. 995–1001. 10.2147/TCRM.S64222 PMC4492655 26170678 5. Jeannerot F Cusin A Schertz J Dose accuracy of the redesigned follitropin alfa pen injector for infertility treatment Expert Opin Drug Deliv 2016 13 12 1661 1669 10.1080/17425247.2017.1237940 27636195 Jeannerot F, Cusin A, Schertz J. Dose accuracy of the redesigned follitropin alfa pen injector for infertility treatment. Expert Opin Drug Deliv. 2016;13(12):1661–9. 27636195 10.1080/17425247.2017.1237940 6. Abbotts C Salgado-Braga C Audibert-Gros C A redesigned follitropin alfa pen injector for infertility: results of a market research study Patient Preference Adher. 2011 10.2147/PPA.S21421 PMC3140313 21792303 Abbotts C, Salgado-Braga C, Audibert-Gros C. A redesigned follitropin alfa pen injector for infertility: results of a market research study. Patient Preference Adher. 2011. 10.2147/PPA.S21421. 10.2147/PPA.S21421 PMC3140313 21792303 7. Kiose KI Storr A Kolibianakis EM Mol BW Venetis CA Biosimilars versus the originator of follitropin alfa for ovarian stimulation in ART: a systematic review and meta-analysis Hum Reprod 2025 40 2 343 359 10.1093/humrep/deae274 39719046 PMC11788201 Kiose KI, Storr A, Kolibianakis EM, Mol BW, Venetis CA. Biosimilars versus the originator of follitropin alfa for ovarian stimulation in ART: a systematic review and meta-analysis. Hum Reprod. 2025;40(2):343–59. 39719046 10.1093/humrep/deae274 PMC11788201 8. EMA. Guideline on similar biological medicinal products. https://www.ema.europa.eu/en/similar-biological-medicinal-products-scientific-guideline 9. National Institute of Diabetes and Digestive and Kidney Diseases LiverTox: clinical and research information on drug-induced liver injury 2012 USA National Institute of Diabetes and Digestive and Kidney Diseases National Institute of Diabetes and Digestive and Kidney Diseases. LiverTox: clinical and research information on drug-induced liver injury. USA: National Institute of Diabetes and Digestive and Kidney Diseases; 2012. 10. Lugan I Febbraro S Lecuelle H Papasouliotis O Ho-Nguyen Q Buraglio M Bioequivalence of liquid and freeze-dried recombinant human follicle-stimulating hormone Curr Med Res Opin 2005 21 1 121 125 10.1185/030079904X18027 15881483 Lugan I, Febbraro S, Lecuelle H, Papasouliotis O, Ho-Nguyen Q, Buraglio M. Bioequivalence of liquid and freeze-dried recombinant human follicle-stimulating hormone. Curr Med Res Opin. 2005;21(1):121–5. 15881483 10.1185/030079904x18027 11. Wolzt M Comparison of pharmacokinetic and safety profiles between Bemfola® and Gonal-f® after subcutaneous application Eur J Drug Metab Pharmacokinet 2016 41 259 265 10.1007/s13318-015-0257-6.pdf 25633239 PMC4866993 Wolzt M, et al. Comparison of pharmacokinetic and safety profiles between Bemfola® and Gonal-f® after subcutaneous application. Eur J Drug Metab Pharmacokinet. 2016;41:259–65. 10.1007/s13318-015-0257-6.pdf. 25633239 10.1007/s13318-015-0257-6 PMC4866993 12. Hollander M Wolfe DA Chicken E Nonparametric statistical methods 2013 New York John Wiley & Sons Hollander M, Wolfe DA, Chicken E. Nonparametric statistical methods. New York: John Wiley & Sons; 2013. 13. EMA. Guideline on non-clinical and clinical development of similar biological medicinal products containing recombinant human follicle stimulating hormone (r-hFSH). https://www.ema.europa.eu/en/documents/scientific-guideline/guideline-non-clinical-and-clinical-development-similar-biological-medicinal-products-containing-recombinant-human-follicle-stimulating-hormone-r-hfsh_en.pdf 14. N. M. P. A. (NMPA). Provisions for Drug Registration 2020. http://english.nmpa.gov.cn/2022-06/30/c_785628_6.htm 15. N. M. P. A. (NMPA). Requirements for registration classification and application dossiers of biological products 2020. https://english.nmpa.gov.cn/2020-06/30/c_528660.htm 16. Chow SC Bioavailability and bioequivalence in drug development Wiley Interdiscip Rev Comput Stat 2014 6 4 304 312 10.1002/wics.1310 25215170 PMC4157693 Chow SC. Bioavailability and bioequivalence in drug development. Wiley Interdiscip Rev Comput Stat. 2014;6(4):304–12. 10.1002/wics.1310. 25215170 10.1002/wics.1310 PMC4157693 17. Zhou Y A randomized, single-blind, parallel-controlled and multicentre study: compare the efficacy and safety of domestic and imported human recombinant FSH in WHO group II anovulatory infertility Zhonghua Fu Chan Ke Za Zhi 2016 51 4 258 263 27116983 10.3760/cma.j.issn.0529-567X.2016.04.004 Zhou Y, et al. A randomized, single-blind, parallel-controlled and multicentre study: compare the efficacy and safety of domestic and imported human recombinant FSH in WHO group II anovulatory infertility. Zhonghua Fu Chan Ke Za Zhi. 2016;51(4):258–63. 27116983 10.3760/cma.j.issn.0529-567X.2016.04.004 18. Yang Rui LX Zhu Y Li Y Yang D Diao F Yin P Li T Liu A Li Y Li L Wang J Xiong H Li R Clinical application of domestic recombinant human follicle-stimulating hormone in controlled ovarian hyperstimulation with assisted reproductive technology Chin J Reprod Contracept 2021 41 2 1387 1394 Yang Rui LX, Zhu Y, Li Y, Yang D, Diao F, Yin P, Li T, Liu A, Li Y, Li L, Wang J, Xiong H, Li R. Clinical application of domestic recombinant human follicle-stimulating hormone in controlled ovarian hyperstimulation with assisted reproductive technology. Chin J Reprod Contracept. 2021;41(2):1387–94. 19. Changchun L. GeneScience Pharmaceutical Co., Jinfollin®(Recombinant human follitropin for injection) [package insert]. Changchun, Jilin, China; 2015. 20. EMD-Serono. GONAL-F® (follitropin alfa for injection). https://www.accessdata.fda.gov/drugsatfda_docs/label/2020/020378s045,s067,s075lbl.pdf 21. Ipsen-Pharma. Diphereline (triptorelin acetate for injection) [package insert]. China; 2017. ",
  "metadata": {
    "Title of this paper": "Clinical application of domestic recombinant human follicle-stimulating hormone in controlled ovarian hyperstimulation with assisted reproductive technology",
    "Journal it was published in:": "Drugs in R&D",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12460200/"
  }
}