{
  "title": "Paper_1191",
  "abstract": "pmc Viruses Viruses 1559 viruses viruses Viruses 1999-4915 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474018 PMC12474018.1 12474018 12474018 41012592 10.3390/v17091164 viruses-17-01164 1 Article Optimization of a High-Throughput Human Papillomavirus Neutralizing Antibody Assay Based on Pseudotyped Viruses for the 15-Valent Human Papillomavirus Vaccine Types Liu Huan Conceptualization Methodology Formal analysis Writing – original draft 1 2 † Qin Haiyang Conceptualization Methodology Writing – original draft 1 † Nie Lingling Methodology 1 Shen Yanru Formal analysis 1 Li Jiayi Methodology 1 Xiu Pengcheng Methodology 1 Wang Shasha Methodology 3 Wang Meng Formal analysis 1 Wang Youchun Writing – review & editing 4 * https://orcid.org/0000-0002-1474-0427 Nie Jianhui Conceptualization Writing – review & editing Supervision 1 * https://orcid.org/0000-0002-4246-8889 Huang Weijin Writing – review & editing Supervision 1 * https://orcid.org/0000-0001-6198-4064 Zhang Li Conceptualization Writing – review & editing Supervision 1 * Mymryk Joe S. Academic Editor 1 lh3253936@163.com qinhaiyang@nifdc.org.cn 2 3 4 * wangyc@imbcams.com.cn niejianhui@nifdc.org.cn huangweijin@nifdc.org.cn zhangli@nifdc.org.cn † These authors equally contributed to this study. 26 8 2025 9 2025 17 9 497677 1164 03 8 2025 23 8 2025 23 8 2025 26 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Vaccination is highly effective in preventing human papillomavirus (HPV) infection, but traditional pseudovirion-based neutralization assays (PBNA) are technically demanding, labor-intensive, and costly, limiting their use in multivalent vaccine studies. We developed and validated an automated, high-throughput PBNA in a 384-well format that quantifies neutralizing antibodies against 15 HPV types using triple-color pseudotyped viruses. Non-interfering type triplets were defined from cross-neutralization assays of serum against pseudotyped viruses, enabling simultaneous detection of three fluorescence signals per well. The workflow integrates a cap-decapper, semi-automatic sample addition and dilution, and a microplate stacker with automated imaging to reduce hands-on time. The 384-well method showed strong concordance with the conventional 96-well PBNA while increasing daily sample throughput by approximately 6.7-fold, reducing assay duration (including ~4-fold faster imaging), and lowering reaction volume by ~5-fold. Analytical validation demonstrated acceptable specificity, accuracy, repeatability, linearity and robustness for high-throughput use. Serostatus cutoff values were established in an age-appropriate female population to support classification of positive versus negative sera. This platform provides a scalable tool for evaluating neutralizing antibodies after natural infections or vaccination and is well suited for large clinical trials and the development of next-generation and multivalent HPV vaccines. human papillomavirus pseudovirion-based neutralization assay (PBNA) immunogenicity high-throughput assay National Key Research and Development Program of China 2025YFC2311705 This research was funded by National Key Research and Development Program of China, grant number 2025YFC2311705. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Globally, cervical cancer is the fourth most common cause of cancer incidence and mortality among women, with an estimated 660,000 new cases and about 350,000 deaths each year [ 1 2 3 4 5 6 7 Assessing the immunogenicity of these vaccines relies on functional antibody measurements. While pivotal randomized HPV vaccine trials demonstrated efficacy by showing a significant reduction in CIN2+ incidence among vaccinated individuals compared to placebo controls, neutralizing antibodies remain a widely accepted surrogate marker of protection in clinical trials [ 8 9 10 The procedures of HPV-specific PBNA include co-transfecting mammalian cells with reporter plasmids by utilizing two late capsid genes of HPV, L1 and L2. This process produces high-infectivity pseudotyped virus particles that possess surface conformational epitopes similar to those of natural viral particles-alike [ 11 12 13 14 15 16 Here, we optimize and validate an automated, high-throughput PBNA in a 384-well format that uses triple-color pseudotyped viruses to measure neutralizing antibodies against 15 HPV types. By selecting non-interfering type triplets and integrating semi-automated liquid handling with automated fluorescence readout, the assay reduces sample volume and assay time while enabling simultaneous detection of three types per well. We also establish serostatus cutoffs in an age-appropriate population, supporting applications in large-scale clinical trials and the development of multivalent HPV vaccines. 2. Materials and Methods 2.1. Cells, Serum, and Plasmids We used 293FT cells (Invitrogen, R70007 2 New Zealand white rabbits (2.8–3.0 kg of weight, female) were subcutaneously injected with 100 μg monovalent HPV L1 virus-like particles (VLPs) with the adjuvant of aluminum hydroxide and 15-valent HPV vaccine candidate. Immunization was repeated three times with a 4-week interval, and serum was obtained 1 day before immunization and 3 weeks after final immunization. The monovalent vaccines were sourced from three candidate vaccines, Beijing Health Guard Biotechnology Inc. (Beijing, China), Sinocelltech Ltd. (Beijing, China), Chengdu Institute of Biological Products Co., Ltd (Chengdu, Sichuan Province, China). The 15-valent HPV vaccine candidate was from Beijing Health Guard Biotechnology Inc (Beijing, China). The 57 positive serum samples were collected after the administrations of three doses of the nonavalent vaccine candidate (Shanghai Bovax Biotechnology Co., Ltd., Shanghai, China) and 200 samples of negative serum from women with aged ranged 16 to 26 were collected by the Zhejiang Provincial Center For Disease Control and Prevention. The HPV L1/L2 expressing plasmids and the red fluorescent protein (RFP) reporter plasmid pRwB were kindly provided by John Schiller (National Cancer Institute, Bethesda, MD, USA). E2-CFP (Clontech, 632554) expresses the E2-crimson fluorescent protein (CFP). The EGFP reporter plasmid was constructed by inserting the EGFP gene into the pCDNA3.1 vector. 2.2. Preparation and Titration of HPV Pseudotyped Virus 2.2.1. Production of Pseudotyped Virus HPV pseudotyped virus was constructed in 293FT cells as described in previous studies [ 15 16 ® g 2.2.2. Titration Pseudotyped virus from each tube was prediluted by 1000-fold in 96-well U-shaped plates, then a 2-fold serial dilution was performed to obtain a total of seven different dilution multiples. Subsequently, sterile water (70 µL per well) was added to the edges of the 384-well plates to prevent the edge effects caused by internal liquid evaporation. Next, the diluted liquid was transferred from the 96-well U-shaped plates to the 384-well plates using a liquid handling workstation (VIAFLO, INTEGRA Biosciences, Zizers, Switzerland). Next, 293 FT cells (3 × 10 3 2 2.3. Pseudovirion-Based Neutralization Assay 2.3.1. Traditional 96-Well Plate Method The 293FT cells were seeded in a 96-well cell culture plate at a density of 1.5 × 10 4 2 2 2.3.2. High-Throughput 384-Well Plate Method In this high-throughput 384-well plate neutralization assay, the dilution and addition of samples, cells, and pseudotyped virus, as well as the detection of fluorescent spots, are integrated into an automated process ( Figure 1 50 5 2 50 2.4. Statistical Analysis The Pearson correlation coefficient was used to analyze the strength of linear relationships; the correlation coefficients should meet the predefined acceptance criterion (r ≥ 0.90). To evaluate the establishment and validation parameters, the Geometric Coefficient of Variation (GCV) was determined. The acceptance criterion requires that the GCV values from each independent condition should be ≤50%. The analysis of variance (ANOVA) test was used to assess the difference in quantitative results obtained from triple-type and single-type pseudotyped virus comparative assay, as well as the difference in quantitative results obtained from high-throughput PBNA and traditional PBNA. To evaluate the intra-assay variability and the inter-assay variability, the acceptance criterion requires that the Coefficient of Variation (CV) values from each independent condition should be ≤50%. The data were analyzed with SPSS V25.0 (Statistical Package for Social Science V.25.0) and GraphPad Prism 8.0 software (GraphPad, San Diego, CA, USA). The presentation of the results includes means ± standard deviation (SD). Significance thresholds: * p p 3. Results 3.1. Selection of Pseudotyped Virus Combinations with Three Types In order to improve the throughput, the method based on the triple-color PBNA developed previously was optimized [ 16 17 Table S1 Figure 2 Table S1 Table 1 3.2. Comparison Between Triple-Type and Single-Type Pseudotyped Virus Detection To determine whether the presence of three-HPV pseudotyped virus affects the high-throughput PBNA results, the same serum sample was tested by triple-type virus combinations and single-type virus, respectively. It was shown that the inhibition rates of the serum against the same virus exhibited similar typical four-parameter logistic inhibition rate curves. The curves indicated that there was no distinct difference between the two assays (R 2 Figure 3 50 Table S2 50 p Table S2 3.3. Establishment of High-Throughput Neutralization Assay Based on the Three-Type HPV Pseudotyped Virus 3.3.1. Cell Concentration To determine the ideal concentration of 293 FT cells for use in the PBNA, the values of a 15-valent post-vaccination serum sample (15v antibody serum) were measured. The HPV neutralization antibody titers were then compared at cell concentrations of 750 cells/well, 1500 cells/well, 3000 cells/well, 6000 cells/well, and 12,000 cells/well. Following increased cell concentration, the ID 50 Figure 4 Table 2 3.3.2. Virus-Serum Neutralization Time To determine the optimal pre-incubation time, cells were incubated with five combinations of HPV pseudotyped virus separately for 0 h, 0.5 h, 1 h, and 2 h to study the impacts of various pre-incubation durations on PBNA. Results demonstrated that the standard samples have exhibited a relatively low variability in neutralizing titer against five combinations of HPV pseudotyped virus despite the alternation of incubation time (GCV: 3.6–46.7%) ( Table 2 Figure 4 3.3.3. Incubation Time To determine the optimal detection time, the number of fluorescent positive cells at 24, 48, 60, 72, 96, and 120 h post co-culture of the serum pseudotyped virus mixture with cells were assessed. After 24 h of incubation, almost no fluorescent positive cells were observed. When detected after 48 h of incubation and beyond, the number of fluorescent positive cells gradually increased. It was shown that the sample ID 50 Table 2 Figure 4 3.4. Validation of High-Throughput Neutralization Assay Based on the Three-Type HPV Pseudotyped Virus 3.4.1. Specificity Neutralization assays were performed using serially diluted antisera from rabbits immunized with the 15-valent vaccine against five combinations of HPV pseudotyped virus types. The results demonstrated characteristic sigmoidal dose–response curves with a goodness of fit (R 2 Figure 5 Figure S1 3.4.2. Serostatus Cutoff In previous studies, the determination of the cutoff value for human serum neutralizing antibody titers was predicated on the analysis of 20 seronegative samples derived from infants aged 12 months. This assessment utilized pseudotyped viruses corresponding to HPV6, HPV11, HPV16, and HPV18, in conjunction with the non-related virus Bovine papillomavirus (BPV) as a control. The cutoff value of the method was set to 40; meanwhile, when the serum ID 50 50 18 To obtain a cutoff for neutralization tests accurately, 200 negative serum samples from females aged 16 to 26 were subjected to three repeated tests in this study. The negative sera samples were initially diluted 10-fold, followed by 2-fold serial dilutions to calculate ID 50 50 Table 2 3.4.3. Linearity As illustrated in Figure 6 50 50 3.4.4. Repeatability To determine the robustness of the method, three operators were used to detect the 15-valent post-vaccination rabbit serum sample; each operator was repeatedly run three times and a total of 10 times each test for each sample. The intra-assay variability among different operators of positive serum was 10.9–19.4%, and the inter-assay variability was 13.4–33.1% ( Table 2 3.4.5. Cell Passages As an important material for PBNA, cell culture is of great significance in biological assays involving pseudotyped virus infections. In order to investigate whether different cell passages have an impact on the results, neutralizing antibody detection was performed on the 293FT cells from the P22, P25, P28, and P31 generations. When the cell passage was within P31 generations, the GCV of different cell passages was 7.0% to 46.0% ( Table 2 3.4.6. Z-Factor Z-factor is a statistical parameter used to validate the robustness and applicability of high-throughput screening (HTS) experiments [ 19 20 3.5. Comparison with Traditional 96-Well Plate Assay and High-Throughput 384-Well Plate Assay Only four samples are allowed to be detected in one 96-well plate by using traditional PBNA, while 20 samples could be tested in one 384-well plate. Meanwhile, the volume of the reaction system, which was 200 μL in the 96-well plate assay, was reduced to 40 μL in the 384-well plate assay, resulting in a 5-fold reduction in the use of samples and pseudotyped viruses. Considering the efficiency and time required for detection, the 96-well plate assay can detect 120 15-valent samples per day, whereas the 384-well plate assay can detect up to 800 samples; thus, the detection throughput was increased by 6.7 times. The enhanced detection throughput achieved with the 384-well plate assay can be attributed to several key factors: the skipping of the pre-seeding step for cells, the cancellation of pseudovirus-serum neutralization time, and the synergistic use of a semi-automated liquid sample handling workstation along with an automated plate reader. To assess the consistency of fluorescence-positive cell numbers between the two methods, each sample immunized with nonavalent vaccine was processed at six different dilution gradients. Positive cell numbers obtained by both methods were then compared at identical dilutions. The Pearson correlation coefficient indicated a strong positive correlation, with r ≥ 0.90 (range 0.925–0.992) ( Table 3 50 p 50 2 Figure 7 4. Discussion Cervical cancer remains a major cause of cancer incidence and mortality among women worldwide. Vaccination is the cornerstone of primary prevention, yet the evaluation of next-generation multivalent vaccines requires scalable, functional immunogenicity assays. Although a definitive serological correlate of protection for HPV has not been established, pseudovirion-based neutralization assays (PBNA) are widely used to quantify neutralizing antibodies. Traditional PBNA formats, however, are labor-intensive, time-consuming, and limited in throughput. Here, we describe an automated 384-well PBNA that uses triple-color pseudotyped viruses to measure neutralizing antibodies against 15 HPV types. By selecting non-interfering type triplets based on cross-neutralization profiles and integrating semi-automated liquid handling with automated fluorescence readout, the assay reduces sample volume and assay duration while preserving concordance with the conventional 96-well format. We also establish serostatus cutoffs in an age-appropriate population, facilitating interpretation in clinical trials and vaccine development. The strengths of this approach include multiplex detection of three types per well without measurable interference, analytical validation across specificity, accuracy, precision, linearity, and robustness, and operational scalability suitable for large studies. Remaining considerations include the absence of an accepted correlate of protection, the need for harmonization to external standards and cross-laboratory comparability, potential residual interference among closely related types, and the possibility that serostatus cutoffs require recalibration in other populations. Our lab previously developed a PBNA based on Gluc [ 15 16 Importantly, the fluorescent proteins in the same combination should not interfere with each other under different excitation and emission light conditions. After comparison, green fluorescent protein (480/520 nm), red fluorescent protein (570/600 nm), and deep red fluorescent protein (630/670 nm) were selected as the combination for simultaneous detection. In this optimization study, the same reporter gene combination was used for high-throughput PBNA detection; due to the sequence similarity of HPV L1 within the same genus, the viruses that are distant relatives are preferred as a group when detecting multi-type antibodies to avoid interactions between different types [ 17 16 The cross-neutralization among various HPV types is a crucial factor in the classification of multi-type pseudotyped virus particle combinations. High-titer type-specific antibodies can be generated after vaccination with HPV types, and those antibodies also can simultaneously cross-neutralize the virus of another HPV type to varying degrees in vitro [ 21 22 23 16 24 The cutoff value serves as a critical benchmark for determining the positivity of serum samples. To set the cutoff values, it is essential to assess the baseline serum titers values among individuals who will receive the vaccine in the future. In this study, we have successfully determined effective serostatus cutoff values (mean + 3 SD). The defined cutoff titers against HPV 6/11/16/18/31/33/35/39/45/51/52/56/58/59/68 were as follows: 177, 97, 85, 100, 77, 112, 82, 48, 148, 52, 84, 130, 125, 97, and 68. In a clinical trial targeting the nonavalent human papillomavirus L1 VLPs vaccine, the study used the threshold established in this research as the cutoff values for neutralizing antibodies against HPV. The results showed that the baseline seropositive rates of HPV 16 (4.5%), HPV 18 (1.4%), HPV 45 (0.6%), and HPV 52 (3.2%) were consistent with the prevalence rates reported in previous studies in China [ 25 26 We developed an automated, high-throughput PBNA in a 384-well format to assess immunogenicity across 15 HPV types relevant to multivalent vaccine development. Replacing 96-well plates with 384-well plates and integrating semi-automated liquid-handling workstations improved operational stability and expanded type coverage. Guided by cross-neutralization profiling, the 15 pseudotyped viruses were partitioned into five triple-color combinations, enabling simultaneous detection of three fluorescence signals per well and thereby shortening assay time. Automated imaging on the Cytation 5 allows precise quantification of cells expressing distinct fluorescent proteins; combined with a microplate stacker, the workflow supports unattended (“lights-out”) runs. Compared with the conventional 96-well method, daily sample throughput increased ~6.7-fold, and for an equivalent sample load the imaging time decreased ~4-fold (from ~75 to ~19 min versus the ELISPOT ImmunoSpot reader). Z-factor analysis further supports the suitability of this platform for high-throughput applications. 5. Conclusions We optimized and validated an automated pseudovirion-based neutralization assay in a 384-well format that quantifies neutralizing antibodies against 15 HPV types using triple-color readouts. This platform enables scalable, multiplex functional immunogenicity assessment for current and next-generation multivalent HPV vaccines and is suitable for large clinical studies and seroepidemiology. Future work should prioritize cross-laboratory harmonization to international standards and evaluate how neutralization titers relate to protection across diverse populations. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/v17091164/s1 Author Contributions Conceptualization, L.Z., J.N., H.Q. and H.L.; lab experiments, H.L., H.Q., L.N., J.L., S.W. and P.X.; statistical analyses, H.L., Y.S. and M.W.; supervision, L.Z., W.H. and J.N.; writing—original draft preparation, H.L. and H.Q.; writing—review and editing, W.H., J.N., L.Z. and Y.W. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethics approval for human serum was obtained from the Zhejiang Provincial Center for Disease Control and Prevention (protocol code T-043-R, approved 28 October 2019). The experiments on the New Zealand white rabbits were conducted under the approval of the Institutional Animal Care and Use Committee at the National Institutes for Food and Drug Control (NIFDC). The experiments on rabbits were approved by the Guide for the Care and Use of Laboratory Animals (Ethics number: 2024(B) 003, approved 23 February 2024). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement All data supporting this study are included in the article and its supplementary materials Conflicts of Interest The authors declare no conflicts of interest. References 1. Bray F. Laversanne M. Sung H. Ferlay J. Siegel R.L. Soerjomataram I. Jemal A. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 2. Mühr L.S.A. Eklund C. Dillner J. Towards quality and order in human papillomavirus research Virology 2018 519 74 76 10.1016/j.virol.2018.04.003 29679790 3. De Villiers E.M. Cross-roads in the classification of papillomaviruses Virology 2013 445 2 10 10.1016/j.virol.2013.04.023 23683837 4. International Human Papillomavirus Reference Center HPV Reference Clones 2023 Available online: https://www.hpvcenter.se/human_reference_clones/ (accessed on 20 August 2025) 5. Scarth J.A. Patterson M.R. Morgan E.L. Macdonald A. The human papillomavirus oncoproteins: A review of the host pathways targeted on the road to transformation J. Gen. Virol. 2021 102 001540 10.1099/jgv.0.001540 33427604 PMC8148304 6. Williamson A.L. Recent Developments in Human Papillomavirus (HPV) Vaccinology Viruses 2023 15 1440 10.3390/v15071440 37515128 PMC10384715 7. Zhang X. Meng D. Li H. Li X. Li J. Hu P. Zhao L. Wang R. Zhao C. Luo C. Validation of Luminex immunological and competitive Luminex immunological assays for clinical immunogenicity assessment of a 14-valent recombinant human papillomavirus vaccine J. Med. Virol. 2023 95 e29050 10.1002/jmv.29050 37635425 8. Villa L.L. Costa R.L. Petta C.A. Andrade R.P. Ault K.A. Giuliano A.R. Wheeler C.M. Koutsky L.A. Malm C. Lehtinen M. Prophylactic quadrivalent human papillomavirus (types 6, 11, 16, and 18) L1 virus-like particle vaccine in young women: A randomised double-blind placebo-controlled multicentre phase II efficacy trial Lancet Oncol. 2005 6 271 278 10.1016/S1470-2045(05)70101-7 15863374 9. Mao C. Koutsky L.A. Ault K.A. Wheeler C.M. Brown D.R. Wiley D.J. Alvarez F.B. Bautista O.M. Jansen K.U. Barr E. Efficacy of human papillomavirus-16 vaccine to prevent cervical intraepithelial neoplasia: A randomized controlled trial Obstet. Gynecol. 2006 107 18 27 10.1097/01.AOG.0000192397.41191.fb 16394035 10. WHO Human Papillomavirus Laboratory Manual 1st ed. WHO Geneva, Switzerland 2009 11. Buck C.B. Pastrana D.V. Lowy D.R. Schiller J.T. Efficient intracellular assembly of papillomaviral vectors J. Virol. 2004 78 751 757 10.1128/JVI.78.2.751-757.2004 14694107 PMC368835 12. Buck C.B. Pastrana D.V. Lowy D.R. Schiller J.T. Generation of HPV pseudovirions using transfection and their use in neutralization assays Methods Protoc. 2005 119 445 462 10.1385/1-59259-982-6:445 16350417 13. Pastrana D.V. Buck C.B. Pang Y.Y. Thompson C.D. Castle P.E. FitzGerald P.C. Kjaer S.K. Lowy D.R. Schiller J.T. Reactivity of human sera in a sensitive, high-throughput pseudovirus-based papillomavirus neutralization assay for HPV16 and HPV18 Virology 2004 321 205 216 10.1016/j.virol.2003.12.027 15051381 14. Sehr P. Rubio I. Seitz H. Putzker K. Ribeiro-Müller L. Pawlita M. Müller M. High-throughput pseudovirion-based neutralization assay for analysis of natural and vaccine-induced antibodies against human papillomaviruses PLoS ONE 2013 8 e75677 10.1371/journal.pone.0075677 24124504 PMC3790823 15. Nie J. Huang W. Wu X. Wang Y. Optimization and validation of a high throughput method for detecting neutralizing antibodies against human papillomavirus (HPV) based on pseudovirons J. Med Virol. 2014 86 1542 1555 10.1002/jmv.23995 24895216 16. Nie J. Liu Y. Huang W. Wang Y. Development of a Triple-Color Pseudovirion-Based Assay to Detect Neutralizing Antibodies against Human Papillomavirus Viruses 2016 8 107 10.3390/v8040107 27120611 PMC4848601 17. De Vincenzo R. Ricci C. Conte C. Scambia G. HPV vaccine cross-protection: Highlights on additional clinical benefit Gynecol. Oncol. 2013 130 642 651 10.1016/j.ygyno.2013.05.033 23747835 18. Wu X. Nie J. Wang Y. Pseudotyped Virus for Papillomavirus Adv. Exp. Med. Biol. 2023 1407 85 103 36920693 10.1007/978-981-99-0113-5_5 19. Martins Lima A. Bragina M.E. Burri O. Bortoli Chapalay J. Costa-Fraga F.P. Chambon M. Fraga-Silva R.A. Stergiopulos N. An optimized and validated 384-well plate assay to test platelet function in a high-throughput screening format Platelets 2019 30 563 571 10.1080/09537104.2018.1514106 30183501 20. Zhang J.H. Chung T.D. Oldenburg K.R. A Simple Statistical Parameter for Use in Evaluation and Validation of High Throughput Screening Assays J. Biomol. Screen. 1999 4 67 73 10.1177/108705719900400206 10838414 21. GlaxoSmithKline Vaccine HPV-007 Study Group Romanowski B. de Borba P.C. Naud P.S. Roteli-Martins C.M. De Carvalho N.S. Teixeira J.C. Aoki F. Ramjattan B. Shier R.M. Sustained efficacy and immunogenicity of the human papillomavirus (HPV)-16/18 AS04-adjuvanted vaccine: Analysis of a randomised placebo-controlled trial up to 6.4 years Lancet 2009 374 1975 1985 19962185 10.1016/S0140-6736(09)61567-1 22. Kavanagh K. Pollock K.G. Cuschieri K. Palmer T. Cameron R.L. Watt C. Bhatia R. Moore C. Cubie H. Cruickshank M. Changes in the prevalence of human papillomavirus following a national bivalent human papillomavirus vaccination programme in Scotland: A 7-year cross-sectional study Lancet Infect. Dis. 2017 17 1293 1302 10.1016/S1473-3099(17)30468-1 28965955 23. Hoes J. King A.J. Berkhof J. de Melker H.E. High vaccine effectiveness persists for ten years after HPV16/18 vaccination among young Dutch women Vaccine 2023 41 285 289 10.1016/j.vaccine.2022.11.057 36470686 24. Gao S. Zhao D. Feng C. Kou Y. Lu J. Luo C. Li X. Wang Y. Xie L. Validation of a triple-color pseudovirion-based neutralization assay for immunogenicity assessment of a 14-valent recombinant human papillomavirus vaccine J. Med. Virol. 2024 96 e29859 10.1002/jmv.29859 39145587 25. Zeng Z. Austin R.M. Wang L. Guo X. Zeng Q. Zheng B. Zhao C. Nationwide Prevalence and Genotype Distribution of High-Risk Human Papillomavirus Infection in China Am. J. Clin. Pathol. 2022 157 718 723 10.1093/ajcp/aqab181 34724029 26. Wang R. Guo X.L. Wisman G.B. Schuuring E. Wang W.F. Zeng Z.Y. Zhu H. Wu S.W. Nationwide prevalence of human papillomavirus infection and viral genotype distribution in 37 cities in China BMC Infect. Dis. 2015 15 257 10.1186/s12879-015-0998-5 26142044 PMC4491249 Figure 1 Establishment of an automatic neutralization test for HPV pseudotyped virus in a 384-well plate. This figure was drawn using Biorender. 1 2 3 4 5 6 7 2 8 Figure 2 Heatmap of type-specific antibodies and cross-reactive antibodies titers. In this experiment, 15 types of HPV pseudotyped viruses were used to detect 15 positive rabbit sera after monovalent immunization. Serum samples were diluted at an initial dilution ratio of 400 times, and then continuously diluted at a gradient of four times per step to obtain neutralizing antibody titers. Figure 3 Comparison of triple-type and single-type pseudotyped virus in detecting inhibition rates. The graph shows the dilution fold and corresponding inhibition rate using triple-type and single-type pseudotyped virus. The red circle represents the inhibition rates against the triple-type pseudotyped virus, and the blue square represents the inhibition rates against the corresponding single-type pseudotyped virus. The horizontal axis shows the logarithmic dilutions of sera, while the vertical axis indicates the corresponding inhibition rates (%). Figure 4 Optimization of the method for PBNA in a 384-well plate format. The graph illustrates the robustness of the assay across various experimental parameters, including cell concentration ( A B C Figure 5 Specificity: rabbit serum immunized with a 15-valent vaccine (15v antibody serum) was subjected to neutralization tests against five combinations of HPV pseudotyped virus. Negative serum and irrelevant monoclonal antibodies (SARS-CoV-2) were used as controls in the neutralization tests. The red circle represents the rabbit serum immunized with a 15-valent vaccine, the blue square represents negative serum, and the green triangle represents the irrelevant monoclonal antibodies (SARS-CoV-2). The horizontal axis shows the logarithmic dilutions of sera, while the vertical axis indicates the corresponding inhibition rates (%). Figure 6 Linearity: standard antibodies for HPV6, HPV18, HPV33, HPV45, HPV52, and HPV58 produced by National Institutes for Food and Drug Control were subjected to neutralization tests against corresponding HPV pseudotyped virus. The r value indicates the correlation between the logarithmic theoretical and measured ID 50 50 50 50 50 Figure 7 Comparison between traditional 96-well plate and high-throughput 384-well plate PBNA detection. The ID 50 50 50 viruses-17-01164-t001_Table 1 Table 1 The groups of triple-color pseudotyped virus. Fluorescent Protein GFP RFP CFP Group 1 HPV6 HPV33 HPV45 Group 2 HPV31 HPV11 HPV58 Group 3 HPV16 HPV18 HPV68 Group 4 HPV39 HPV51 HPV35 Group 5 HPV59 HPV56 HPV52 viruses-17-01164-t002_Table 2 Table 2 Establishment and validation parameter summary table. Characteristic HPV Types HPV6 HPV11 HPV16 HPV18 HPV31 HPV33 HPV35 HPV39 HPV45 HPV51 HPV52 HPV56 HPV58 HPV59 HPV68 Serostatus cutoff (ID 50 177 97 85 100 77 112 82 48 148 52 84 130 125 97 68 Positive rate (%) 1.4 2.0 3.6 2.9 3.4 1.3 1.7 1.0 1.2 2.2 3.0 2.7 1.5 2.3 1.0 Intra-assay precision (CV%) 16.3 14.5 21.4 13.7 14.9 10.9 12.6 16.8 12.3 11.5 14.2 16.0 12.4 19.4 13.9 Inter-assay precision (CV%) 24.1 19.6 27.8 18.3 24.0 21.5 14.3 17.1 23.7 13.4 21.1 23.3 26.4 33.1 22.0 Cell concentration (GCV%)                750 cells/well 26.1 9.4 12.5 16.7 6.2 11.1 7.9 4.3 9.6 7.6 7.4 7.6 9.5 8.0 13.8 1500 cells/well 14.4 6.5 17.1 9.5 9.4 7.5 8.1 7.2 6.9 13.6 4.8 10.6 12.1 8.9 7.7 3000 cells/well 31.6 12.6 40.4 17.5 22.7 23.0 23.5 24.1 20.6 19.5 17.2 10.9 27.3 19.3 25.5 6000 cells/well 39.1 20.4 60.4 31.3 46.6 23.1 22.1 22.3 24.2 13.7 20.9 17.6 24.2 29.8 43.9 12,000 cells/well 49.3 31.1 119.4 27.3 43.9 29.2 24.0 20.4 30.7 40.0 33.7 42.9 39.8 46.7 59.1 Virus-serum neutralization time (GCV%)                0 h 15.0 6.8 39.2 34.3 21.0 14.1 7.5 3.6 15.1 7.6 10.7 11.7 29.1 9.7 33.9 0.5 h 12.3 9.9 46.7 35.9 7.8 16.7 7.1 4.3 15.2 6.3 13.6 16.1 24.1 20.1 44.1 1 h 29.4 6.4 17.1 13.1 19.7 13.5 10.5 8.3 13.4 7.7 11.9 15.2 23.1 16.4 9.1 2 h 11.4 6.5 10.3 16.0 12.4 16.3 10.6 6.4 12.8 10.2 8.6 13.1 24.9 16.2 21.2 Incubation time (GCV%)                48 h 22.0 39.6 35.7 29.8 39.8 51.0 180.7 29.2 29.4 27.9 42.6 39.6 112.4 13.6 12.2 60 h 29.1 24.1 19.6 18.0 26.6 30.3 24.5 28.0 28.0 19.6 22.4 15.8 38.2 9.1 28.9 72 h 24.1 22.3 19.8 22.8 21.5 26.5 28.5 19.4 30.6 20.3 15.4 12.8 43.8 5.2 22.0 96 h 36.0 23.8 21.6 20.0 21.4 25.9 22.2 16.7 26.6 20.4 15.7 11.4 40.5 8.7 18.5 120 h 50.3 24.5 17.7 27.2 36.1 34.6 21.8 22.0 39.4 26.8 11.1 12.6 45.0 9.4 16.2 Cell passages (GCV%)                P22 23.6 16.4 24.2 13.5 12.7 10.4 10.2 13.5 10.7 11.5 10.4 16.1 9.0 15.9 15.2 P25 11.1 15.7 46.0 23.6 10.4 12.1 22.9 19.1 8.3 16.5 9.5 11.4 11.0 10.8 20.6 P28 12.5 11.8 19.6 13.3 10.5 8.9 17.5 17.5 8.2 11.5 7.0 12.1 15.6 12.3 18.7 P31 15.6 10.5 21.6 12.8 12.4 9.1 12.2 11.7 9.5 8.7 8.4 13.4 12.8 11.6 14.7 viruses-17-01164-t003_Table 3 Table 3 The correlation of fluorescent positive cell numbers between the 96-well plate assay and the 384-well plate assay. Pseudotyped HPV Pearson’s Correlation Coefficient (r) HPV6-EGFP 0.985 HPV16-EGFP 0.992 HPV31-EGFP 0.988 HPV11-RFP 0.986 HPV18-RFP 0.984 HPV33-RFP 0.987 HPV45-CFP 0.925 HPV52-CFP 0.932 HPV58-CFP 0.989 ",
  "metadata": {
    "Title of this paper": "Nationwide prevalence of human papillomavirus infection and viral genotype distribution in 37 cities in China",
    "Journal it was published in:": "Viruses",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474018/"
  }
}