{
  "title": "Paper_930",
  "abstract": "pmc Clin Case Rep Clin Case Rep 2542 ccr CCR3 Clinical Case Reports 2050-0904 Wiley PMC12485284 PMC12485284.1 12485284 12485284 41040834 10.1002/ccr3.71067 CCR371067 CCR3-2025-01-0046.R1 1 Case Report Case Report A Massive Interstitial Cervical Leiomyoma Successfully Treated With Myomectomy: A Case Report Mansour Marah https://orcid.org/0000-0002-6129-5733  1  2 Swaid Komait https://orcid.org/0000-0002-1365-3153  3 komaitswaid@gmail.com Razouk Marah  4  5 Ibrahim Abdeen Samaya  4 Baki Siba  6 Kwara Mais  3  7 Kanbour Ilda  8   1 Faculty of Medicine Tartous University Tartous Syrian Arab Republic   2 Division of Colon and Rectal Surgery, Department of Surgery Mayo Clinic Rochester Minnesota USA   3 Faculty of Medicine University of Aleppo Aleppo Syrian Arab Republic   4 Faculty of Medicine Al Baath University Homs Syrian Arab Republic   5 Al Bassel Hospital Homs Syrian Arab Republic   6 Department of Pathology Damascus Hospital Damascus Syrian Arab Republic   7 Department of Internal Medicine Aleppo University Hospital Aleppo Syrian Arab Republic   8 Maternity University Hospital Damascus Syrian Arab Republic * Correspondence: komaitswaid@gmail.com 01 10 2025 10 2025 13 10 497443 10.1002/ccr3.v13.10 e71067 23 5 2025 19 2 2025 20 9 2025 01 10 2025 02 10 2025 03 10 2025 © 2025 The Author(s). Clinical Case Reports https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Cervical leiomyomas are rare pelvic tumors, with interstitial subtypes being the least common. This case highlights a 44‐year‐old female with a 14‐mm interstitial cervical leiomyoma, successfully treated with myomectomy. This approach preserved fertility, demonstrating its feasibility as an alternative to hysterectomy for select patients. case report cervical fibroid interstitial leiomyoma myomectomy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  M. Mansour K. Swaid M. Razouk A Massive Interstitial Cervical Leiomyoma Successfully Treated With Myomectomy: A Case Report Clinical Case Reports 13 10 2025 e71067 10.1002/ccr3.71067  Funding: Marah Mansour is the guarantor of this article.  Summary  Myomectomy is a viable fertility‐preserving option for interstitial cervical leiomyomas, even in challenging cases. This report emphasizes tailored surgical management based on tumor characteristics and patient preferences, avoiding the need for hysterectomy. Abbreviations AUB abnormal uterine bleeding CT computed tomography GnRH gonadotropin‐releasing hormone MRI magnetic resonance imaging 1 Introduction Leiomyomas, or fibroids, are the most common solid benign uterine tumors, affecting 20%–40% of women over 35. They arise from the clonal proliferation of myometrial cells and are hormonally responsive, primarily affecting reproductive‐age women. While 95% occur in the uterine corpus, cervical leiomyomas are rare (0.6%) [ 1 2 1 2 3 1 3 3 4 2 5 1 2 1 2 2 Case History A 44‐year‐old female patient, Gravida 5, Para 4, with a history of four vaginal deliveries (the last vaginal delivery was 13 years ago), presented with a 10‐year history of gradually increasing pelvic pressure and a sensation of pelvic heaviness. The patient also reported experiencing dyschezia (painful bowel movements) for the past 5 years and dyspareunia (painful intercourse) following her recent marriage. The patient denied significant menstrual bleeding. The patient is currently in the premenopausal stage. Her surgical history only includes ophthalmic surgery, with no medication or family history. Previous medical consultations indicated a high tumor likelihood and the potential requirement of a hysterectomy. 3 Differential Diagnosis, Investigations, and Treatment On examination, a bimanual uterine examination revealed a palpable, non‐tender abdominal mass in the left iliac fossa, with indistinct inferior borders and restricted mobility. Laboratory investigations, including complete blood count, renal and liver function tests, and coagulation parameters, were unremarkable, except for a PTT value of 100 and a hemoglobin of 10.8 g/dL, consistent with mild anemia. A CA‐125 test was negative, ruling out ovarian malignancy. Abdominal ultrasound revealed an oval‐shaped mass with clear edges, a hypoechoic appearance, and heterogeneity, measuring (147 × 145 × 114.5 mm) (Figure 1 2 3 4 5 FIGURE 1 A Pelvic ultrasound shows cervix leiomyoma. The size of the mass is approximately 147 × 145 × 114.5 mm. FIGURE 2 A mass of oval shape, characterized by clear boundaries, a hypoechoic appearance, heterogeneous internal structure, and the presence of fluid‐filled regions. The mass was identified on the left side of the pelvis, raising the possibility of a mixed ovarian cyst or neoplastic lesion. FIGURE 3 Postoperative image of the cervix pedunculated leiomyoma (fibroid) measures 16 × 11 × 5 cm. The cut surface reveals homogenous white tissue without necrosis or hemorrhage. FIGURE 4 Intraoperative appearance of the large leiomyoma being suctioned/aspirated. FIGURE 5 Histopathology, the proliferation of uniform, elongated, spindle‐shaped cells with a cigar‐shaped nucleus and the formation of bundles with different directions (whorled), with hyalinization, with few mitoses (less than 5 in HPF), consistent with leiomyoma, no evidence of malignancy. 4 Outcome and Follow‐Up The hospitalization period operation was uneventful. After we removed the suture, the patient's condition is stable, with regular menstruation resumed and no further complaints. Gonadotropin‐releasing hormone (GnRH) analogs were not used before surgery due to concerns about adverse effects. Postoperatively, the patient reported an unexpected increase in sexual desire, though the cause remains unclear. At the two‐year follow‐up, the patient remains asymptomatic with no recurrence of pelvic symptoms. A specialized pelvic ultrasound showed normal findings, with no evidence of mass recurrence (Figure 6 FIGURE 6 Two‐year follow‐up pelvic ultrasound performed with a half‐full bladder. The uterus is anteverted and positioned anteriorly. Uterine size and morphology are within normal limits. Both ovaries and adnexal structures appear normal, with no evidence of masses, cysts, or abnormal fluid collections. 5 Discussion Uterine fibroids are the most common benign neoplasms affecting women, affecting 70% of women by menopause, originating from myometrial smooth muscle [ 3 1 3 5 6 7 8 9 1 1 1 7 10 3 5 7 8 1 7 5 8 10 9 3 3 4 3 5 6 7 8 10 9 3 1 11 1 6 1 1 6 1 1 4 7 6 Conclusion Massive cervical leiomyomas are rare, predominantly affecting reproductive‐age women. Management options include a hysterectomy or myomectomy, guided by the patient's age and fertility goals. Surgical intervention, often complex due to bleeding risks, necessitates expertise and advanced hemostatic techniques to ensure optimal outcomes. Author Contributions  Marah Mansour: Komait Swaid: Marah Razouk: Samaya Ibrahim Abdeen: Siba Baki: Mais Kwara: Ilda Kanbour: Ethics Statement The authors have nothing to report. Consent Written informed consent was obtained from the patient for publishing this case report and any accompanying images. A copy of the written consent is available for review by the Editor‐in‐Chief of this journal on request. Conflicts of Interest The authors declare no conflicts of interest. Acknowledgments A preprint version of this case report is available on Authorea at: https://doi.org/10.22541/au.174011407.70904995/v1 Data Availability Statement The authors have nothing to report. All data (of the patient) generated during this study is included in this published article. References 1 F. Ferrari S. Forte G. Valenti Current Treatment Options for Cervical Leiomyomas: A Systematic Review of Literature Medicina 57 2 2021 92 10.3390/medicina57020092 33494297 PMC7911900 2 E. Giuliani S. As‐Sanie E. E. Marsh Epidemiology and Management of Uterine Fibroids International Journal of Gynecology & Obstetrics 149 1 2020 3 9 10.1002/ijgo.13102 31960950 3 K. Kotowski P. Małyszczak M. Towarek A. Jagasyk M. Murawski R. Sozański An Unusual Coincidence of Giant Cervical Leiomyoma and Incidental Ovarian Granulosa Cell Tumor: A Case Report Medicine 102 30 2023 e34387 10.1097/md.0000000000034387 37505129 PMC10378814 4 H. Oh S. B. Park H. J. Park Ultrasonographic Features of Uterine Cervical Lesions British Journal of Radiology 94 1121 2021 20201242 10.1259/bjr.20201242 33560888 PMC8506186 5 A. Palicelli L. Ardighieri G. Broggi Lipoleiomyomas of the Uterine Cervix: A New Series Including the First Recurrent Case and the First Systematic Literature Review Journal of Personalized Medicine 12 11 2022 1852 10.3390/jpm12111852 36579603 PMC9698632 6 K. R. Gari Y. L. Nalini P. R. Bai S. Rani V. Lakshmi Cervical Leiomyoma: An Uncommon Presentation MRIMS Journal of Health Sciences 8 3 2020 71 10.4103/mjhs.mjhs_9_20 7 S. A. Khade B. Jadhav R. Raut Huge Cervical Pedunculated Leiomyoma With Uterine Prolapse: A Case Report International Journal of Reproduction, Contraception, Obstetrics and Gynecology 8 2 2019 772 776 8 I. Zemni M. Aloui F. Saadallah H. Mansouri R. Chargui T. Ben Dhiab A Huge Prolapsed Cervical Leiomyoma: A Case Report International Journal of Surgery Case Reports 106 2023 108139 10.1016/j.ijscr.2023.108139 37054542 PMC10139963 9 A. Kausha M. Kaur V. Bhalla D. Kaur Unusual Giant Central Cervical Leiomyoma: Surgical Challenge International Journal of Reproduction, Contraception, Obstetrics and Gynecology 7 12 2018 5197 5201 10 J. Zhang B. Zou K. Wang Spontaneous Expulsion of a Huge Cervical Leiomyoma From the Vagina After Cesarean Medicine 97 33 2018 e11766 10.1097/md.0000000000011766 30113462 PMC6112979 11 S. Singhal N. Acharya M. Agrawal N. Singh N. Verma Lantern on Dome of St. Paul's Cathedral – An Apt Metaphor for a Challenging Leiomyoma Journal of Mid‐Life Health 11 3 2020 181 10.4103/jmh.jmh_143_19 33384545 PMC7718941 ",
  "metadata": {
    "Title of this paper": "Lantern on Dome of St. Paul's Cathedral – An Apt Metaphor for a Challenging Leiomyoma",
    "Journal it was published in:": "Clinical Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485284/"
  }
}