{
  "title": "Paper_876",
  "abstract": "pmc Front Oncol Front Oncol 1755 frontonco Front. Oncol. Frontiers in Oncology 2234-943X Frontiers Media SA PMC12460128 PMC12460128.1 12460128 12460128 41018072 10.3389/fonc.2025.1608710 1 Oncology Original Research GADD45G as a novel prognostic biomarker and therapeutic target in glioma: integrative analysis of bulk and single-cell RNA sequencing Shen Cong  1  2  † Cai Haiping  2  † Mao Chengliang  2 Yang Jiahao  2 Tang Kai  2  *  1 Shantou University Medical College Shantou China  2 Department of Neurosurgery, Guangdong Provincial People’s Hospital (Guangdong Academy of Medical Sciences), Southern Medical University Guangzhou China Edited by: Fabio Torregrossa Reviewed by: Jaldeep Langhnoja  Xin Xu  Yohei Niikura *Correspondence: Kai Tang, tangkai@gdph.orn.cn †These authors have contributed equally to this work 11 9 2025 2025 15 480898 1608710 09 4 2025 27 8 2025 11 09 2025 26 09 2025 29 09 2025 Copyright © 2025 Shen, Cai, Mao, Yang and Tang. 2025 Shen, Cai, Mao, Yang and Tang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Gliomas make up almost half of primary central nervous system tumors. Despite advancements in surgery and neuro-oncology, developing an effective treatment remains challenging. The protein Growth Arrest and DNA-Damage-Inducible, Gamma (GADD45G) is crucial for key cellular functions like DNA repair, genomic stability, and apoptosis. While GADD45G dysregulation has been found in various cancers, its role in glioma is still unclear. Methods We analyzed unified pan-cancer datasets (TCGA, TARGET, GTEx) from UCSC Xena and integrated glioma data from CGGA and GEO ( GSE108476 GSE103224 GSE138794 GSE173278 Results Through comprehensive analysis across multiple datasets, it was found that GADD45G expression is higher in glioma patients compared to normal individuals, and its expression is generally higher in lower-grade gliomas than in glioblastoma. Cox regression analysis indicated that GADD45G has a protective effect. Survival curves further demonstrated that elevated GADD45G levels are associated with improved overall survival in patients. In this study, we identified four highly heterogeneous GBM cell subpopulations using single-cell data. The MES-like cells was significantly associated with poor prognosis. Spearman correlation analysis revealed the correlation between GADD45G and VIM. Further experiments revealed that GADD45G modulates glioma cell invasion and migration, potentially through its effects on EMT-like phenotypic features. Conclusion GADD45G expression is significantly associated with glioma outcomes and may serve as a promising biomarker for prognosis evaluation. Its involvement in regulating EMT-like phenotypic traits further highlights its therapeutic potential. GADD45G gliomas prognostic biomarker therapeutic target EMT-like The author(s) declare financial support was received for the research and/or publication of this article. The study design, data collection, data analysis, manuscript preparation and publication decisions of this work were supported by NSFC Incubation Project of Guangdong Provincial People’s Hospital (KY0120220043) and National Natural Science Foundation of China (No. 82203081) to HC; Guangzhou Municipal Science and Technology Bureau (201904010348) to KT. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Neuro-Oncology and Neurosurgical Oncology Background Gliomas constitute approximately 50% of primary central nervous system tumors. Despite advancements in surgical techniques and neuro-oncology, the prognosis for gliomas remains dismal. Glioblastoma multiforme (GBM), the most malignant variant of glioma, exhibits a 1-year survival rate of approximately 30% and a 5-year survival rate of less than 5% ( 1 The growth arrest and DNA damage-inducible gene (GADD45) family, consisting of GADD45A, GADD45B, and GADD45G, is involved in various fundamental processes such as DNA repair ( 2 3 4 5 6 7 6 3 8 9 10 10 11 13 14 15 16 In this study, we conducted a comprehensive analysis of gliomas using bulk and single-cell RNA sequencing data, and further explored the potential role of GADD45G in glioma progression through in vitro Materials and methods Gene expression and survival analysis The pan-cancer datasets TCGA, TARGET, and GTEx, which have been unified and standardized, were downloaded from the UCSC database ( https://xenabrowser.net/ http://www.cgga.org.cn/ GSE108476 https://www.ncbi.nlm.nih.gov/geo/ GSE108476 https://gliovis.bioinfo.cnio.es/ ScRNA-seq data processing and integration The scRNA-seq data from the GEO database, including GSE103224 GSE138794 GSE173278 17 18 19 20 Inference of CNV and downstream analysis in typical malignant cells To differentiate malignant cells from normal cells, 400 cells from each cell type were isolated, and copy number variations (CNV) were inferred using the infercnv package. Genes with low expression (median expression < 0.1) were excluded. Genes were annotated based on their chromosomal locations, and CNV scores were computed using a moving average of 100 genes. Hierarchical clustering was conducted to distinguish non-malignant cells from malignant cells characterized by distinct chromosomal deletions or amplifications. A total of 1,000 cells from each typical malignant subpopulation were isolated to construct a single-cell reference matrix. We performed phylogenetic analysis of the four single-cell subtypes using the BuildClusterTree function to construct a phylogenetic tree. Cell-type proportions in GBM patients from the CGGA dataset were estimated using the default settings of CIBERSORTX ( https://cibersortx.stanford.edu/ https://broadinstitute.github.io/gistic2/ Correlation analysis Single-cell transcriptomic data were used to extract the expression levels of the target gene GADD45G, which were then subjected to Spearman correlation analysis. The ten genes most strongly correlated with GADD45G were identified. The expression patterns of these selected genes were visualized on a UMAP plot using the FeatureDimPlot function from the SCP package. Immune cell infiltration analysis Based on the bulk RNA-seq expression profiles of tumor tissue samples in the TCGA-GBM dataset, the relative abundance of immune cells in the tumor microenvironment was estimated using the single-sample gene set enrichment analysis (ssGSEA) method. The signature gene sets for various immune cell types were constructed from their representative marker genes. Through enrichment analysis, enrichment scores of each immune cell type were obtained for every sample. Subsequently, Spearman correlation analysis was performed to assess the relationship between GADD45G expression levels and the degree of immune cell infiltration. Drug analysis Drugs capable of regulating the transcriptional expression levels of GADD45G were identified from the CTD database ( https://ctdbase.org/ https://guolab.wchscu.cn/GSCA/#/ Cell culture and transfection The SKMG1 cell line was maintained by the State Key Laboratory of Oncology in South China, while the A172 cell line was provided by Dr. Shing-shun Tony To, from the Department of Health Technology and Informatics, The Hong Kong Polytechnic University. All cell lines were authenticated by short tandem repeat (STR) profiling within the last six months. The cells were cultured in Dulbecco’s Modified Eagle Medium (DMEM; Carlsbad, USA) supplemented with 10% fetal bovine serum (FBS; Gemini Bio-Products, West Sacramento, CA, USA), 100 U/mL penicillin-streptomycin (HyClone, Logan, UT, USA), and 2 mM glutamine (HyClone). Cells were maintained at 37 °C in 5% CO 2 NM_006705.4 H23990 Reverse transcription quantitative PCR Total RNA was extracted using the RNA extraction kit (ESScience) following the manufacturer’s instructions. The RNA concentration was measured, and complementary DNA (cDNA) was synthesized via reverse transcription. This was followed by amplification and quantitative analysis of the cDNA using real-time PCR (qPCR) technology. The primers were synthesized by Sangon Biotech (Shanghai, China). The primer sequences were as follows: GADD45G: 5′-CAGATCCATTTTACGCTGATCCA-3′ (forward) and 5′-TCCTCGCAAAACAGGCTGAG-3′ (reverse). Glyceraldehyde 3-phosphate dehydrogenase (GAPDH) served as the internal control. Western blot analysis Proteins were separated by SDS-PAGE and transferred to PVDF membranes. The membranes were blocked with 5% non-fat milk and incubated overnight at 4°C with the primary antibody (GADD45G, 1:1000, Santa Cruz Biotechnology). Afterward, the membranes were incubated for 2 hours with a secondary antibody (1:5000). Protein levels were detected using a chemiluminescence and fluorescence imaging system. Scratch assay Cells were cultured in dishes until they reached 80%-90% confluency. A straight-line scratch was created in the monolayer using a cell scraper. Photographs of the scratch area were taken at 0, 24, and 48 hours to document the healing process. Transwell migration assay A cell suspension in serum-free medium was added to the upper chamber of the Transwell insert at a density of 5×10 4 2 Transwell invasion assay Cell suspensions (5×10 4 2 CCK-8 assay A172 and SKMG1 cells were seeded at 2,000 cells/well in 96-well plates and cultured for 24 – 96 hours. Then, 10 µL of CCK - 8 reagent (Dojindo) was added per well and mixed. The plates were incubated for 1 hour. Absorbance was measured at 450 nm, followed by statistical analysis. Cell apoptosis assay The apoptosis assay was performed using the Annexin V-FITC Apoptosis Detection Kit (Beyotime) following the manufacturer’s instructions. Cells were first collected and washed twice with PBS. The cells were then resuspended in 1X Annexin V binding buffer, and 5 µL of Annexin V-FITC and 5 µL of PI were added to each sample. The samples were gently mixed and incubated in the dark at room temperature for 15 minutes. After incubation, the apoptosis rate was measured using a flow cytometer. Statistics and analysis Statistical analyses and graphical representations were performed using R (v4.3.1), Python (v3.10.9), and GraphPad Prism (v8.3). Kaplan-Meier survival analysis was conducted using the log-rank test, and Pearson’s correlation coefficient was utilized to assess linear relationships. Comparisons between two groups were performed using Student’s t test, while comparisons among three or more groups were performed using one-way analysis of variance (ANOVA). P-values are shown within the plots to indicate statistical significance (*P < 0.05, **P < 0.01, ***P < 0.001, ****P < 0.0001, ns: not significant). Result Differential expression of GADD45G in glioma We analyzed the expression of GADD45G across various tumors and corresponding normal tissues using pan-cancer datasets from TCGA, TARGET, and GTEx (  Figure 1A  Figure 1A  Supplementary Table 1  Supplementary Figure S1  Figure 1A  Figure 1A  Figures 1B, C  Figures 1D, E  Figures 1F–H Figure 1 Differential expression of GADD45G in gliomas. (A) (B–H) GSE108476 (B, C) (D) (F–H)  Supplementary Table 1 A series of eight graphs display GADD45G expression across different conditions. Graph A is a violin plot comparing tumor and normal groups. Graphs B, C, D, E, F, G, and H are box plots showcasing mRNA expression levels in various histological types, subtypes, and grades based on datasets GSE108476 GADD45G as a prognostic marker for favorable outcome in glioma To assess the prognostic significance of GADD45G in glioma, we conducted a multivariate Cox regression analysis on TCGA-GBM data, categorizing patients into high-risk and low-risk groups based on their computed risk scores (  Figure 2A  Figures 2B, C  Figure 2D  Figure 2E  Figures 2F–K  Supplementary Figure S2 Figure 2 Prognostic significance of GADD45G in gliomas. (A) (B, C) (D) (E) (F–K) GSE108476 Graphical panel with multiple sub-figures analyzing risk scores and survival data. A: Line graph showing patient risk scores, differentiating high and low risk with red and green dots. B: Scatter plot of survival time versus risk score. C: Heat map comparing risk score types and status. D: Hazard ratio table for GADD45G, indicating a significant value. E: Expression level z-score heat map for GADD45G. F-K: Kaplan-Meier survival curves for glioma and GBM across different datasets, contrasting high and low GADD45G expression, with log-rank p-values noted. Analysis of tumor microenvironment through single-cell data Conventional bulk transcriptome analysis cannot fully capture the characteristics of different tumor cell subtypes. Therefore, we further investigate the relationship between GADD45G and glioblastoma (GBM) by utilizing single-cell data. We integrated GBM scRNA-seq data collected from three independent datasets and analyzed a total of 98,216 cells. Six important cell clusters were color-coded and labeled as shown in the figure (  Figure 3A  Figure 3B 21  Figure 3C  Figure 3D  Figure 3E 18  Figure 3F  Figure 3G Figure 3 Analysis of the tumor microenvironment based on single-cell data. (A, B) (C) (D, E) (F) (G) A set of panels illustrating single-cell RNA sequencing data and analysis. Panel A shows a UMAP plot of cell clusters from various cell types, including malignant cells and T cells, with three datasets referenced. Panel B is a dot plot showing gene expression levels across different cell types. Panel C depicts expression heatmaps for genomic regions. Panel D presents another UMAP plot with different clustering of cell types like NPC_like and AC_like cells. Panel E provides score overlays for different cellular characteristics on UMAPs. Panel F contains box plots of gene expression across cell types. Panel G displays a dendrogram of cell type clusters. Characterization of malignant GBM subpopulations The proportions of cell subtypes vary significantly across different samples, reflecting the heterogeneity of GBM (  Figure 4A  Figures 4B, C  Figures 4D–G  Figure 4H  Figure 4I Figure 4 Characterization of malignant cell subpopulations. (A) (B, C) (D–G) (H, I) A series of graphs and charts illustrating cell type data analysis, including: A) A stacked bar chart showing the distribution of four cell types (OPC-like, MES-like, NPC-like, AC-like) across different samples. B) Another stacked bar chart displaying the fractional representation of the same cell types. C) A box plot comparing the estimated proportion of each cell type across groups. D-G) Kaplan-Meier survival plots comparing high and low expressions of each cell type, with corresponding p-values. H) A dot plot showing gene ontology terms by cell type with gene ratios and p-values. I) A heatmap highlighting hallmark gene sets across cell types. Expression levels of GADD45G and its correlated genes in malignant GBM cells To examine the expression pattern of GADD45G across distinct cellular subpopulations in GBM, we employed single-cell RNA sequencing (scRNA-seq) data to map its distribution among NPC-like, OPC-like, AC-like, and MES-like cell populations (  Figures 5A, B  Supplementary Figure S3  Figures 5C, D  Figures 5E–H Figure 5 Analysis of GADD45G and its related genes in cell subpopulations. (A, B) (C, D) (E–H) A multi-panel figure displays various analyses of gene expression across different cell types. Panel A shows a UMAP plot of GADD45G expression. Panel B presents violin plots of GADD45G expression levels across cell types NPC_like, OPC_like, AC_like, and MES_like. Panels C and D depict scatter plots with regression lines for genes CST3, FABP7, MT2A, MT3, VIM, DLL3, FERMT1, HES6, MLLT11, and SOX4, indicating correlations. Panels E and G feature UMAP plots for these genes. Panels F and H offer violin plots for expression levels across the same cell types, with statistical significance indicated by asterisks. The role of GADD45G in cell invasion and migration in glioma through regulation of EMT-like phenotypes In the present study, we demonstrated that MES-like cells are significantly enriched in the EMT-related gene sets, and Spearman correlation analysis revealed a strong negative correlation between GADD45G and VIM. Although gliomas are not epithelial in origin and do not undergo classical epithelial-to-mesenchymal transition (EMT), they can exhibit an EMT-like transcriptional program characterized by loss of polarity, enhanced motility, and expression of mesenchymal markers ( 22 24  Figures 6A, B  Figures 6C–G 25 26  Figure 6H  Figures 6I, J  Figures 6K, L Figure 6 Functional effects of GADD45G on glioma cells. (A) (B) (C, D) (E–G) (H) (I, J) (K, L) A multi-panel scientific figure presents various experimental results related to Gadd45g expression and cell behavior in A172 and SKMG1 cell lines. Panels A and H show Western blots for protein expression, while B and D display bar graphs indicating relative mRNA expression and cell migration/invasion numbers. Panels C, E, and F feature images of cell migration/invasion assays. Panel G contains bar graphs of migration index over time. I and J illustrate line graphs of optical density at four hundred fifty nanometers over time, suggesting cell proliferation. K and L present flow cytometry plots and a bar graph for cell apoptosis percentages, respectively. Discussion Gliomas, particularly Glioblastoma multiforme (GBM), are characterized by high invasiveness, rapid growth, and the ability to spread to other brain regions, which complicates complete surgical resection. An urgent need exists for the development of novel early diagnostic and prognostic targets to overcome the challenges associated with glioma treatment. A significant body of research has focused on identifying potential biomarkers that could open new therapeutic avenues for gliomas ( 27 30 Notably, during the development of various cancer types, GADD45G is underexpressed and is regarded as a functional tumor suppressor. Comprehensive analysis of multiple databases has revealed that GADD45G is highly expressed in glioma patients, suggesting its potential role as an oncogene. However, Cox regression analysis indicates that GADD45G possess a protective function. Survival curves further demonstrate that elevated levels of GADD45G are correlated with improved overall survival in patients. To explore this further, we modulated GADD45G expression using plasmid overexpression, thereby confirming its tumor-suppressive role in glioma. Notably, GADD45G expression is markedly reduced in glioblastoma relative to lower-grade gliomas. GADD45G expression can be induced by cellular stress and certain subsets of cytokines ( 11 13 31 32 in vitro Prior to the advent of single-cell RNA sequencing (scRNA-seq), traditional transcriptomic approaches were the primary methods used for identifying prognostic biomarkers and anti-cancer targets. However, bulk RNA sequencing, which cannot capture the expression profiles of individual cells, is limited in its ability to detect the tumor microenvironment at the cellular level. Therefore, we utilized scRNA-seq data from GBM samples to investigate the heterogeneity within GBM tumor subgroups. In this study, we systematically identified four highly heterogeneous GBM cell subgroups through a series of stringent protocols. In contrast, MES-like cells were predominantly characterized by epithelial-mesenchymal transition (EMT), hypoxic conditions, and wound healing pathways. Survival analysis revealed a significant association between the mesenchymal (MES) subtype and poor patient prognosis, suggesting that the MES subtype may represent the most aggressive form of glioblastoma. As demonstrated in the study by Yang et al., the MES subtype corresponds to the terminal stage of GBM cellular evolution ( 33 Although gliomas are not epithelial in origin, the concept of an epithelial-to-mesenchymal transition-like (EMT-like) process has been increasingly discussed in the context of glioma biology, particularly to describe transcriptional programs associated with enhanced cell plasticity and invasion. EMT-like programs refer not to a full transdifferentiation between epithelial and mesenchymal cell states, but rather to a transcriptional and phenotypic shift that promotes tumor cell plasticity, invasiveness, and resistance to treatment. This concept is supported by transcriptomic analyses showing that glioma cells, including primary GBM and established cell lines, express a mesenchymal signature comparable to TGF-β-induced EMT in epithelial tumors ( 34 35 43 10 44 45 p53 is a classical tumor suppressor that plays a pivotal role in cellular stress responses, DNA repair, apoptosis, and cell cycle regulation. It can inhibit tumor growth by inducing apoptosis or causing cell cycle arrest ( 46 47 12 48 49 The Gadd45 family has been widely studied in the context of various cancers, such as pancreatic, hepatocellular, lung, cervical, and gastrointestinal cancers, as well as different types of lymphomas. These studies highlight the dysfunctional roles and regulatory mechanisms of the Gadd45 family in tumorigenesis. Consequently, the Gadd45 family has been identified as a promising target for cancer therapies ( 50 51 52 55 52 Our study uncovers the regulatory mechanism of tumor development mediated by GADD45G in glioma, offering a promising avenue for future research. Future research focused on understanding how GADD45 pathways are regulated by the tumor microenvironment and cancer stem cells will offer new opportunities to target and manipulate GADD45 function. Moreover, we explored the correlation between GADD45G and various cancer drugs through the CTD database. Many of these drugs were found to upregulate the expression of GADD45G, which is clearly a research avenue worth further exploration. Although this study integrates multiple bioinformatics analyses and in vitro in vivo in vitro Data availability statement The original contributions presented in the study are included in the article/  Supplementary Material Ethics statement Ethical approval was not required for the studies on humans in accordance with the local legislation and institutional requirements because only commercially available established cell lines were used. Ethical approval was not required for the studies on animals in accordance with the local legislation and institutional requirements because only commercially available established cell lines were used. Author contributions CS: Visualization, Formal Analysis, Validation, Data curation, Writing – original draft. HC: Visualization, Validation, Funding acquisition, Writing – original draft, Data curation. CM: Visualization, Validation, Writing – original draft. JY: Writing – original draft, Visualization, Validation. KT: Project administration, Visualization, Funding acquisition, Writing – review & editing, Data curation, Supervision, Writing – original draft. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fonc.2025.1608710/full#supplementary-material References 1 Stupp R Mason WP van den Beuf MJ Radiotherapy plus concomitant and adjuvant temozolomide for newly diagnosed glioblastoma Ann Oncol 2005 16 949– 10.1056/NEJMoa043330 15758009 2 Smith ML Chen IT Zhan Q Bae I Chen CY Gilmer TM Interaction of the p53-regulated protein Gadd45 with proliferating cell nuclear antigen Science 1994 266 1376–80 10.1126/science.7973727 7973727 3 Hollander MC Sheikh MS Bulavin DV Lundgren K Augeri-Henmueller L Shehee R Genomic instability in Gadd45a-deficient mice Nat Genet 1999 23 176–84 10.1038/13802 10508513 4 Wang XW Zhan Q Coursen JD Khan MA Kontny HU Yu L GADD45 induction of a G2/M cell cycle checkpoint Proc Natl Acad Sci U S A 1999 96 3706–11 10.1073/pnas.96.7.3706 10097101 PMC22358 5 Harkin DP Bean JM Miklos D Song YH Truong VB Englert C Induction of GADD45 and JNK/SAPK-dependent apoptosis following inducible expression of BRCA1 Cell 1999 97 575–86 10.1016/S0092-8674(00)80769-2 10367887 6 Tamura RE de Vasconcellos JF Sarkar D Libermann TA Fisher PB Zerbini LF GADD45 proteins: central players in tumorigenesis Curr Mol Med 2012 12 634–51 10.2174/156652412800619978 22515981 PMC3797964 7 Hoffman B Liebermann DA Gadd45 modulation of intrinsic and extrinsic stress responses in myeloid cells J Cell Physiol 2009 218 26 31 10.1002/jcp.21582 18780287 8 Qiu W David D Zhou B Chu PG Zhang B Wu M Down-regulation of growth arrest DNA damage-inducible gene 45beta expression is associated with human hepatocellular carcinoma Am J Pathol 2003 162 1961–74 10.1016/S0002-9440(10)64329-5 12759252 PMC1868146 9 Wang W Huper G Guo Y Murphy SK Olson JA Jr. Marks JR Analysis of methylation-sensitive transcriptome identifies GADD45a as a frequently methylated gene in breast cancer Oncogene 2005 24 2705–14 10.1038/sj.onc.1208464 15735726 10 Guo W Zhu T Dong Z Cui L Zhang M Kuang G Decreased expression and aberrant methylation of Gadd45G is associated with tumor progression and poor prognosis in esophageal squamous cell carcinoma Clin Exp Metastasis 2013 30 977–92 10.1007/s10585-013-9597-2 23793925 11 Zhang W Bae I Krishnaraju K Azam N Fan W Smith K CR6: A third member in the MyD118 and Gadd45 gene family which functions in negative growth control Oncogene 1999 18 4899–907 10.1038/sj.onc.1202885 10490824 12 Takekawa M Saito H A family of stress-inducible GADD45-like proteins mediate activation of the stress-responsive MTK1/MEKK4 MAPKKK Cell 1998 95 521–30 10.1016/S0092-8674(00)81619-0 9827804 13 Chakravarty D Cai Q Ferraris JD Michea L Burg MB Kultz D Three GADD45 isoforms contribute to hypertonic stress phenotype of murine renal inner medullary cells Am J Physiol Renal Physiol 2002 283 F1020–9 10.1152/ajprenal.00118.2002 12372778 14 Chung HK Yi YW Jung NC Kim D Suh JM Kim H Gadd45gamma expression is reduced in anaplastic thyroid cancer and its reexpression results in apoptosis J Clin Endocrinol Metab 2003 88 3913–20 10.1210/jc.2002-022031 12915687 15 Zhang W Li T Shao Y Zhang C Wu Q Yang H Semi-quantitative detection of GADD45-gamma methylation levels in gastric, colorectal and pancreatic cancers using methylation-sensitive high-resolution melting analysis J Cancer Res Clin Oncol 2010 136 1267–73 10.1007/s00432-010-0777-z 20111973 PMC11828201 16 Ying J Srivastava G Hsieh WS Gao Z Murray P Liao SK The stress-responsive gene GADD45G is a functional tumor suppressor, with its response to environmental stresses frequently disrupted epigenetically in multiple tumors Clin Cancer Res 2005 11 6442–9 10.1158/1078-0432.CCR-05-0267 16166418 17 Stuart T Butler A Hoffman P Hafemeister C Papalexi E Mauck WM 3rd Comprehensive integration of single-cell data Cell 2019 177 1888 902.e21 10.1016/j.cell.2019.05.031 31178118 PMC6687398 18 Neftel C Laffy J Filbin MG Hara T Shore ME Rahme GJ An integrative model of cellular states, plasticity, and genetics for glioblastoma Cell 2019 178 835 49.e21 10.1016/j.cell.2019.06.024 31327527 PMC6703186 19 Darmanis S Sloan SA Croote D Mignardi M Chernikova S Samghababi P Single-cell RNA-seq analysis of infiltrating neoplastic cells at the migrating front of human glioblastoma Cell Rep 2017 21 1399–410 10.1016/j.celrep.2017.10.030 29091775 PMC5810554 20 Xiong A Zhang J Chen Y Zhang Y Yang F Integrated single-cell transcriptomic analyses reveal that GPNMB-high macrophages promote PN-MES transition and impede T cell activation in GBM EBioMedicine 2022 83 104239 10.1016/j.ebiom.2022.104239 36054938 PMC9437813 21 Brennan CW Verhaak RG McKenna A Campos B Noushmehr H Salama SR The somatic genomic landscape of glioblastoma Cell 2013 155 462–77 10.1016/j.cell.2013.09.034 24120142 PMC3910500 22 Christiansen JJ Rajasekaran AK Reassessing epithelial to mesenchymal transition as a prerequisite for carcinoma invasion and metastasis Cancer Res 2006 66 8319–26 10.1158/0008-5472.CAN-06-0410 16951136 23 Li S Wang J Lu Y Zhao Y Prinz RA Xu X Inhibition of the sonic hedgehog pathway activates TGF-beta-activated kinase (TAK1) to induce autophagy and suppress apoptosis in thyroid tumor cells Cell Death Dis 2021 12 459 10.1038/s41419-021-03744-2 33966040 PMC8106679 24 Tan TZ Miow QH Miki Y Noda T Mori S Huang RY Epithelial-mesenchymal transition spectrum quantification and its efficacy in deciphering survival and drug responses of cancer patients EMBO Mol Med 2014 6 1279–93 10.15252/emmm.201404208 25214461 PMC4287932 25 Bakir B Chiarella AM Pitarresi JR Rustgi AK. EMT MET, plasticity, and tumor metastasis Trends Cell Biol 2020 30 764–76 10.1016/j.tcb.2020.07.003 32800658 PMC7647095 26 Wu D Zhao B Qi X Peng F Fu H Chi X Nogo-B receptor promotes epithelial-mesenchymal transition in non-small cell lung cancer cells through the Ras/ERK/Snail1 pathway Cancer Lett 2018 418 135–46 10.1016/j.canlet.2018.01.030 29331415 PMC7385903 27 Wang F Zhao F Zhang L Xiong L Mao Q Liu Y CDC6 is a prognostic biomarker and correlated with immune infiltrates in glioma Mol Cancer 2022 21 153 10.1186/s12943-022-01623-8 35879762 PMC9316328 28 Zhu C Zhao Y Zheng W CDC14B is a favorable biomarker for recurrence and prognosis of GBM Clin Neurol Neurosurg 2023 227 107665 10.1016/j.clineuro.2023.107665 36898299 29 Xu L Shao F Luo T Li Q Tan D Tan Y Pan-cancer analysis identifies CHD5 as a potential biomarker for glioma Int J Mol Sci 2022 23 8489 10.3390/ijms23158489 35955624 PMC9369136 30 Liu Y Yao R Shi Y Liu Y Liu H Liu J Identification of CD101 in glioma: A novel prognostic indicator expressed on M2 macrophages Front Immunol 2022 13 845223 10.3389/fimmu.2022.845223 35350788 PMC8957828 31 Fornace AJ Jr. Nebert DW Hollander MC Luethy JD Papathanasiou M Fargnoli J Mammalian genes coordinately regulated by growth arrest signals and DNA-damaging agents Mol Cell Biol 1989 9 4196–203 10.1128/mcb.9.10.4196-4203.1989 2573827 PMC362498 32 Fornace AJ Jr. Alamo I Jr. Hollander MC DNA damage-inducible transcripts in mammalian cells Proc Natl Acad Sci U S A 1988 85 8800–4 10.1073/pnas.85.23.8800 3194391 PMC282594 33 Yang Y Liu Z Wei Y He S Gu A Li Z Single-cell multi-omics analysis reveals candidate therapeutic drugs and key transcription factor specifically for the mesenchymal subtype of glioblastoma Cell Biosci 2024 14 151 10.1186/s13578-024-01332-3 39707474 PMC11662595 34 Iser IC Pereira MB Lenz G Wink MR The epithelial-to-mesenchymal transition-like process in glioblastoma: an updated systematic review and in silico investigation Med Res Rev 2017 37 271 313 10.1002/med.21408 27617697 35 Myung JK Choi SA Kim SK Wang KC Park SH Snail plays an oncogenic role in glioblastoma by promoting epithelial mesenchymal transition Int J Clin Exp Pathol 2014 7 1977–87 24966907 PMC4069885 36 Siebzehnrubl FA Silver DJ Tugertimur B Deleyrolle LP Siebzehnrubl D Sarkisian MR The ZEB1 pathway links glioblastoma initiation, invasion and chemoresistance EMBO Mol Med 2013 5 1196–212 10.1002/emmm.201302827 23818228 PMC3944461 37 Expression of concern: ZEB2 mediates multiple pathways regulating cell proliferation, migration, invasion, and apoptosis in glioma PLoS One 2020 15 e0231386 10.1371/journal.pone.0231386 32236135 PMC7112199 38 Mikheeva SA Mikheev AM Petit A Beyer R Oxford RG Khorasani L TWIST1 promotes invasion through mesenchymal change in human glioblastoma Mol Cancer 2010 9 194 10.1186/1476-4598-9-194 20646316 PMC2920263 39 Velpula KK Dasari VR Tsung AJ Dinh DH Rao JS Cord blood stem cells revert glioma stem cell EMT by down regulating transcriptional activation of Sox2 and Twist1 Oncotarget 2011 2 1028–42 10.18632/oncotarget.367 22184289 PMC3282065 40 Seoane J Le HV Shen L Anderson SA Massague J Integration of Smad and forkhead pathways in the control of neuroepithelial and glioblastoma cell proliferation Cell 2004 117 211–23 10.1016/S0092-8674(04)00298-3 15084259 41 Joseph JV Conroy S Tomar T Eggens-Meijer E Bhat K Copray S TGF-beta is an inducer of ZEB1-dependent mesenchymal transdifferentiation in glioblastoma that is associated with tumor invasion Cell Death Dis 2014 5 e1443 10.1038/cddis.2014.395 25275602 PMC4649508 42 Liu C Tu Y Sun X Jiang J Jin X Bo X Wnt/beta-Catenin pathway in human glioma: expression pattern and clinical/prognostic correlations Clin Exp Med 2011 11 105–12 10.1007/s10238-010-0110-9 20809334 43 Kahlert UD Maciaczyk D Doostkam S Orr BA Simons B Bogiel T Activation of canonical WNT/beta-catenin signaling enhances in vitro Cancer Lett 2012 325 42 53 10.1016/j.canlet.2012.05.024 22652173 44 Zhang X Li Y Ji J Wang X Zhang M Li X Gadd45g initiates embryonic stem cell differentiation and inhibits breast cell carcinogenesis Cell Death Discov 2021 7 271 10.1038/s41420-021-00667-x 34601500 PMC8487429 45 Flores O Burnstein KL GADD45gamma: a new vitamin D-regulated gene that is antiproliferative in prostate cancer cells Endocrinology 2010 151 4654–64 10.1210/en.2010-0434 20739400 PMC2946153 46 Liu Y Su Z Tavana O Gu W Understanding the complexity of p53 in a new era of tumor suppression Cancer Cell 2024 42 946–67 10.1016/j.ccell.2024.04.009 38729160 PMC11190820 47 Castellino RC Durden DL Mechanisms of disease: the PI3K-Akt-PTEN signaling node–an intercept point for the control of angiogenesis in brain tumors Nat Clin Pract Neurol 2007 3 682–93 10.1038/ncpneuro0661 18046441 48 Vairapandi M Balliet AG Hoffman B Liebermann DA GADD45b and GADD45g are cdc2/cyclinB1 kinase inhibitors with a role in S and G2/M cell cycle checkpoints induced by genotoxic stress J Cell Physiol 2002 192 327–38 10.1002/jcp.10140 12124778 49 Azam N Vairapandi M Zhang W Hoffman B Liebermann DA Interaction of CR6 (GADD45gamma) with proliferating cell nuclear antigen impedes negative growth control J Biol Chem 2001 276 2766–74 10.1074/jbc.M005626200 11022036 50 Sultan FA Sweatt JD The role of the Gadd45 family in the nervous system: a focus on neurodevelopment, neuronal injury, and cognitive neuroepigenetics Adv Exp Med Biol 2013 793 81 119 10.1007/978-1-4614-8289-5_6 24104475 51 Jinawath N Vasoontara C Yap KL Thiaville MM Nakayama K Wang TL NAC - 1, a potential stem cell pluripotency factor, contributes to paclitaxel resistance in ovarian cancer through inactivating Gadd45 pathway Oncogene 2009 28 1941–8 10.1038/onc.2009.37 19305429 PMC2679096 52 Zerbini LF Czibere A Wang Y Correa RG Otu H Joseph M A novel pathway involving melanoma differentiation associated gene-7/interleukin-24 mediates nonsteroidal anti-inflammatory drug-induced apoptosis and growth arrest of cancer cells Cancer Res 2006 66 11922–31 10.1158/0008-5472.CAN-06-2068 17178890 53 Jiang H Lin JJ Su ZZ Goldstein NI Fisher PB Subtraction hybridization identifies a novel melanoma differentiation associated gene, mda-7, modulated during human melanoma differentiation, growth and progression Oncogene 1995 11 2477–86 8545104 54 Jiang H Su ZZ Lin JJ Goldstein NI Young CS Fisher PB The melanoma differentiation associated gene mda-7 suppresses cancer cell growth Proc Natl Acad Sci U S A 1996 93 9160–5 10.1073/pnas.93.17.9160 8799171 PMC38612 55 Zerbini LF Tamura RE Correa RG Czibere A Cordeiro J Bhasin M Combinatorial effect of non-steroidal anti-inflammatory drugs and NF-kappaB inhibitors in ovarian cancer therapy PLoS One 2011 6 e24285 10.1371/journal.pone.0024285 21931671 PMC3171406 ",
  "metadata": {
    "Title of this paper": "Combinatorial effect of non-steroidal anti-inflammatory drugs and NF-kappaB inhibitors in ovarian cancer therapy",
    "Journal it was published in:": "Frontiers in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12460128/"
  }
}