{
  "title": "Paper_1161",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12475007 PMC12475007.1 12475007 12475007 41006400 10.1038/s41598-025-16913-6 16913 1 Article Design of electrochemical aptameric biosensor for the specific and selective detection of chemotherapeutic drugs: Application for paclitaxel and leucovorin Alanazi Shamsa 1 Rhouati Amina 1 Chrouda Amani 2 Cialla-May Dana 3 4 Popp Jürgen 3 4 Zourob Mohammed MZOUROB@ALFAISAL.EDU 1 1 https://ror.org/00cdrtq48 grid.411335.1 0000 0004 1758 7207 Department of Chemistry, Alfaisal University, 2 https://ror.org/01mcrnj60 grid.449051.d 0000 0004 0441 5633 Department of Chemistry, College of Science Al Zulfi, Majmaah University, 3 https://ror.org/05qpz1x62 grid.9613.d 0000 0001 1939 2794 Institute of Physical Chemistry (IPC) and Abbe Center of Photonics (ACP), Friedrich Schiller University Jena, Member of the Leibniz Centre for Photonics in Infection Research (LPI), 4 https://ror.org/02se0t636 grid.418907.3 0000 0004 0563 7158 Leibniz Institute of Photonic Technology, Member of Leibniz Health Technologies, Member of the Leibniz Centre for Photonics in Infection Research (LPI), 26 9 2025 2025 15 478255 33295 19 3 2025 20 8 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Chemotherapy continues to be a fundamental approach in treating various cancers, with combination therapies frequently improving effectiveness while minimizing toxicity. Recently, the therapeutic potential of combining Paclitaxel and Leucovorin drugs has been highlighted in cancer treatment. However, both agents pose challenges in terms of toxicity and necessitate careful dosing and monitoring. To address this, we report the selection of two ssDNA aptamers and their use in the electrochemical biosensing of Paclitaxel and Leucovorin. Using the SELEX process, five sequences were generated for paclitaxel, labeled P1 to P5, while four aptamers for leucovorin were identified (L1 to L4). Based on affinity studies, the aptamers P3 and L1 exhibiting the lowest dissociation constants, were selected for the design of Paclitaxel and Leucovorin biosensors, respectively. The developed aptasensors were applicable within the ranges of 10–1000 pg/mL and 3–500 pg/mL with the low detection limits of 0.02 and 0.0077 pg/mL for Paclitaxel and Leucovorin, respectively. A good selectivity was also attained against different drugs, including chemotherapeutic compounds. Finally, real samples analysis was also carried out showing good recovery rates ranging from 91.3% to 109% with RSDs lower than 5%. In comparison to traditional techniques, this platform shows high performance and is user-friendly, presenting a novel and efficient approach for monitoring paclitaxel and leucovorin in chemotherapy regimens. Keywords Chemotherapeutic drug Paclitaxel Leucovorin Aptamer SELEX Electrochemical Biosensor Subject terms Analytical chemistry Bioanalytical chemistry pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction The World Health Organization (WHO) reported that cancer is one of the leading causes of death globally, with 20 million new cases and 9.7 million cancer-related deaths recorded in 2022 1 2 3 5 6 8 9 10 11 12 13 14 15 While these drugs are highly effective in treating cancer, the variability in patient response, drug resistance, and potential toxicity necessitate precise monitoring of their concentrations in biological samples. Currently, high-performance liquid chromatography (HPLC) 16 17 18 19 20 21 22 23 24 Various transducers have been employed in aptasensor design, where electrochemical strategies achieved significant advancements. Electrochemical aptasensors leverage the high specificity of aptamers and the sensitivity of electrochemical transduction, enabling rapid, real-time analysis of drug concentrations with high accuracy. This combination offers a versatile and scalable approach to the development of biosensors tailored for specific applications, such as chemotherapeutic drug detection 25 27 Experimental section Chemicals and instrumentation The list of chemicals and the instruments used in this study are mentioned in Supporting Information. In vitro Selection of Paclitaxel and leucovorin aptamers First, the DNA library was heated for five minutes at 90 °C, then cooled at 4 °C for 10 min. In parallel, Paclitaxel and Leucovorin were conjugated, separately, to n-hydroxysucciniamide (NHS)-activated Sepharose, according to the manufacturer’s protocol. In brief, 1 mg/mL of Paclitaxel and Leucovorin solutions were incubated with 100 μL of the washed beads and put on a rotator overnight, at 4 °C. Then, the mixture was centrifuged for 5 min at 300 rpm and the supernatant was discarded. Afterwards, the beads were washed three times with alternate pH buffers: 0.1 M Tris (pH 8.0) and 0.1 M Acetate NaCl (pH 4.0). Then, 300 nmol of the library were incubated with 100 µL of chemotherapeutic drug-conjugated beads, prepared in binding buffer (BB), under rotation in a centrifuge filter tube for 2 h. Following that, a washing step was carried out by using 400 μL of binding buffer five times. 300 μL of heated elution buffer (90°C) were then added to elute the DNA bound to the chemotherapeutic drugs-coupled beads. After 10 min of incubation, the eluted DNA was collected in a 3 kDa cutoff membrane filter. Finally, ssDNA was amplified by PCR by using a FAM-labelled forward primer. The amplified dsDNA was run on 2% agarose gel electrophoresis for 40 min. The dsDNA PCR band was precipitated by adding 250 μL of 3 M sodium acetate and 750 μL of cold ethanol and incubated at 80 °C for two hours. After 30 min of centrifugation at 4 °C, the collected DNA was re-suspended in a mixture of 1 to 1 BB and loading dye, for 5 min. The fluorescent dsDNA was run on 10% denaturing PAGE at 300 V for 2 h. The obtained band was subsequently cut from the gel, added to 400 μL of TE (Tris–EDTA) buffer and incubated in an incubator overnight at 37°C. Finally, the eluted ssDNA was ultra-filtrated by using a 3 kDa cutoff membrane filter and used as a pool for the next round. After the seventh cycle of SELEX, the ssDNA was conjugated with blank beads. The aim of this counter selection is to eliminate the non-specific sequence by using the same protocol. The collected DNA was concentrated by the cut-off filter then eluted and used to start the next cycle of SELEX. Cloning, sequencing, and alignment By the end of the eleventh cycle of SELEX, the ssDNA was cloned to select the best sequences. We performed fresh PCR from the last cycle of SELEX and ligated with a cloning vector, then it was added into competent E. coli Determination of the dissociation constants (K d ) After selection, the obtained sequences were labelled with carboxyfluorescein to perform the affinity studies. First, aptamer solutions were heated at 90 °C for 10 min, then cooled at 4 °C for 10 min and at 25 °C for 5 min. A fluorescence binding assay was used by incubating different concentrations of the FAM-labeled aptamers, prepared in BB (10, 50, 100, 200 and 300 nM) with Paclitaxel/Leucovorin-conjugated, on a rotator for 1 h at room temperature. After washing with BB, the bound DNA was eluted from the beads by adding the elution buffer at 90 °C for 10 min and centrifuging at 13,000 rpm for 1 min. Then, the DNA amount eluted from each sample was determined by fluorescence measurement with the excitation and emission wavelengths of 470 ± 10 nm and 515nm, respectively. The fluorescence intensities obtained for each aptamer sequence were plotted, and the dissociation constants ( K d Electrochemical aptasensing of Paclitaxel and leucovorin To develop the electrochemical aptasensors, we selected the aptamers exhibiting the lowest K d 6 3-/4- Results and discussion Selection of ssDNA aptamers against Paclitaxel and Leucovorin The conjugation between Paclitaxel/Leucovorin drugs and the solid matrix is a crucial step in SELEX 28 2 Figure 1 .a b 29 Fig. 1 The fluorescence intensity of the recovered amount of DNA measured after each round of SELEX for Paclitaxel ( a b c d The SELEX process was concluded after 11 cycles, where the enriched ssDNA pool was sufficient for the target drugs. The recovered DNA was then cloned into E. coli competent cells for amplification. Selected colonies were picked for PCR and sequencing, and the resulting sequences were analyzed using a multiple sequence alignment using PRALINE program ( https://www.ibi.vu.nl/programs/pralinewww/ 1 .c d Binding affinity studies of the selected aptamers towards Paclitaxel and Leucovorin. The aptamer sequences selected from the cloning went through a binding affinity study, to identify the most specific aptamers to our targeted analytes. A fluorescent binding assay was employed by incubating 50 µL of Paclitaxel/Leucovorin-conjugated beads with different concentrations (10, 50, 100, 200, 300, and 400 nM) of each sequence, individually. Then, a washing step was performed to eliminate the nonconjugated sequences. In parallel, the bound aptamers were eluted, and their fluorescence intensities were measured at an emission wavelength of 515 nm. The fluorescence intensities were then plotted against the concentrations of each aptamer. Finally, the resulting binding curves were analyzed by a non-linear regression to determine the dissociation constants of each sequence. Table 1 K d Table 1 Dissociation constants ( K d Aptamer Sequence K d Paclitaxel P1 TGC GGA GCG AGG CCC TAG GCG TGG TGG CAT TGA TTT GTA T 139.2 P2 AGA CGT GAT GAA GTT CAA TCA GGA TGC AAT GTA TTA ATG G 484.2 P3 CCA AGC ATC GTC ACA TCA CAT TAT CAC ACA TTG TCG TCC GT 38.02 P4 TGT GCA TTC GTG TGA ATT AAC TCG TCC ACC AGA GCC CGT G 208.1 P5 ACA TGT GTA GGC GGT TGG ATG CAT TAT GAG ATG GGA CAT G 54.07 Leucovorin L1 CAG TCT GCG CCG ATT TCT CGC GGA TTG CGA CGA GGA TAC G 125.7 L2 CCC ATC ACC ACA TTG TCA CAT CAC TCG TCA CAT ACA GCC CG 284.2 L3 CAC ACA TAC GGG AGA GGC CCC ATA AAC TCA TGC ACG TCC TG 225.7 L4 TAA GCC CGG CTG AGA TAA CGG TTG ATC CGA AGC TGG TTT T 285.7 From the table, we can note that P3 aptamer exhibited the highest affinity for Paclitaxel with a K d K d Electrochemical biosensing of Paclitaxel/Leucovorin drug using the selected aptamers Electrochemical characterization of the biosensor fabrication steps The selected aptamers were conjugated with a thiol group in 5’ end and covalently immobilized onto the SPGEs. Thiol chemistry was chosen for its simplicity and efficiency; the spontaneous adsorption of sulfur groups onto metal surfaces enables the formation of uniform layers of well-oriented bioreceptors 30 Figures 2 .a b 31 Fig. 2 Cyclic voltammograms and EIS of the paclitaxel/Leucovorin aptasensor fabrication steps; bare SPGE (black), Pacli/Leuco aptamer/SPGE (red) and MCH/aptamer/SPGE (blue). CV was performed in 5mM ferri/ferrocyanide solution prepared in PBS buffer pH 7.4, potential range of (−0.6 to 0.6 V) and a scan rate of 100 mV/s. EIS was performed in the same electrolyte, over the frequency range from 10 5 In parallel, electrochemical impedance spectroscopy (EIS) can provide complementary insights into the surface modifications. Figure 2 .c and d 31 Paclitaxel/Leucovorin aptasensing via square wave voltammetry To confirm the feasibility of the fabricated aptasensors for Paclitaxel and Leucovorin determination. Each aptasensor was incubated with increasing concentrations of its respective targeted drug. Scheme 1 3 Scheme 1 Schematic illustration of the mechanism of detection of Paclitaxel and Leucovorin using the designed aptasensors. Fig. 3 Square wave voltammograms obtained for increasing concentrations of ( a b ((i 0 -i/i 0 ) %) c d −1 To better visualize this variation, the analytical response was calculated as ((i 0 -i)/i 0 % i 0 i 3 .c d) 2 ((i 0 -i)/i 0 % ((i 0 -i)/i 0 % 2 To highlight the originality of the present work, a bibliographic investigation was conducted to compare the performance of various sensors developed for the detection of Leucovorin and Paclitaxel. Different electrochemical sensors were developed for the detection of Leucovorin and Paclitaxel (Table 2 Table 2 Comparison of the analytical performance of the developed aptasensors with other biosensors reported in the literature for Paclitaxel and Leucovorin. Transducer Surface modification Analytical range LOD Ref Leucovorin Electrochemical SPCEs 0.5 to 30 μM 2.63 μM 32 Electrochemical SPCE 0 to 10 µM 0.509 µM 33 Electrochemiluminescence SPE 6.25 to 100 µM 6.25 µM 34 Electrochemical Aptamer-functionalized SPGE 6.34 pM to 1.05 µM 0.016 pM The present work Paclitaxel Luminescence MIP-QDs 0.1 to 2.0 μM 0.043 μM 35 Electrochemical β-CD/CNT/GCE 5 to 1060 μM 1.7 nM 36 Electrochemical Aptamer-functionalized SPGE 11.72 pM to 1.72 μM 0.023 pM The present work MIP-QDs: Molecularly imprinted polymers-Quantum dots, β-CD/CNT/GCE: β-cyclodextrin/carbon nanotubes/glassy carbon electrode. Selectivity studies and real sample applications To confirm the specificity of the aptasensors for their respective targeted analytes, the as prepared aptamer-functionalized SPCEs were subjected to a variety of potential interfering drugs. The selectivity study was carried out by incubating the aptasensors with a fixed concentration of the different drugs (10 pg/mL), separately. Different chemotherapeutics and antibiotics were tested; Cabazitaxel, 5-Fluorouracil, Penicillin G and Amoxicillin. The analytical procedure was performed in the same experimental conditions and according to the protocol previously described for detection. Figure 4 .a b ((i 0 -i/i 0 ) %) Fig. 4 Cross-reactivity study of the electrochemical aptasensors for: ( a b To demonstrate that the designed aptamer-based strategy could be applied in blood patients’ samples without matrix effects, the aptasensors were tested with serum samples. The developed aptasensors were incubated with serum samples diluted in BB (1:50) and spiked with two concentrations of Paclitaxel/Leucovorin drugs (10 and 100 pg/mL). Then, square wave voltammograms were recorded by using the same experimental conditions described above. Table 3 Table 3 Applicability of the proposed aptasensor for Paclitaxel/Leucovorin detection in spiked serum samples. Added concentration (pg/mL) Found concentration (pg/mL) Recovery percentage (%) R.S.D (%) Paclitaxel 10 9.5 95 1.5 100 91.3 91.3 3.2 Leucovorin 10 10.9 109 3.46 100 96.4 96.4 0.86 The recovery percentage was calculated by comparing the analytical response of the aptasensor obtained in the binding buffer with that obtained in serum samples by using the equation: R% = measured concentration/added concentration. Excellent percentages were obtained showing that the developed Paclitaxel/Leucovorin aptasensors could be successfully applied in biological fluids without interferences or matrix effects. Conclusion In summary, we successfully selected and characterized single-stranded DNA aptamers for the chemotherapeutic drugs Paclitaxel and Leucovorin. Affinity studies demonstrated that the selected aptamers, P3 and L1, exhibited the lowest K d Supplementary Information  Supplementary Information. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-16913-6. Acknowledgements Authors would like to acknowledge the generous support from the Research, Development and Innovation Agency (RDIA) for the support (Project No. 12813-alfaisal-2023-FU-R-2-1-HW-). Author contributions S. A, A. R. and A. C. did most of the experimental work and wrote first draft of the manuscript. D.C-M., J.P., and M. Z. supervised the work and proof read the manuscript. Data availability The data that support the findings of this study are available from the corresponding author upon reasonable request. Declarations Competing interests The authors declare no competing interests. References: 1. Siegel, R.L., A.N. Giaquinto, and A. Jemal, Cancer statistics 2024. 74 10.3322/caac.21820 38230766 2. Bray F Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries J. Clin. 2024 74 3 229 263 10.3322/caac.21834 38572751 Bray, F. et al. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. J. Clin. 74 10.3322/caac.21834 38572751 3. Shuel SL Targeted cancer therapies: Clinical pearls for primary care Can. Fam. Phys. 2022 68 7 515 10.46747/cfp.6807515 PMC9842142 35831091 Shuel, S. L. Targeted cancer therapies: Clinical pearls for primary care. Can. Fam. Phys. 68 10.46747/cfp.6807515 PMC9842142 35831091 4. Liu B Exploring treatment options in cancer: Tumor treatment strategies Signal Transduct. Target. Ther. 2024 9 1 175 10.1038/s41392-024-01856-7 39013849 PMC11252281 Liu, B. et al. Exploring treatment options in cancer: Tumor treatment strategies. Signal Transduct. Target. Ther. 9 39013849 10.1038/s41392-024-01856-7 PMC11252281 5. Dailah, H.G., et al., Potential role of immunotherapy and targeted therapy in the treatment of cancer: A contemporary nursing practice. 10.1016/j.heliyon.2024.e24559 PMC10828696 38298714 6. Anand U Cancer chemotherapy and beyond: Current status, drug candidates, associated risks and progress in targeted therapeutics Genes & Diseases 2023 10 4 1367 1401 10.1016/j.gendis.2022.02.007 37397557 PMC10310991 Anand, U. et al. Cancer chemotherapy and beyond: Current status, drug candidates, associated risks and progress in targeted therapeutics. Genes & Diseases 10 37397557 10.1016/j.gendis.2022.02.007 PMC10310991 7. Jan, N., et al., Metronomic chemotherapy and drug repurposing: A paradigm shift in oncology. 10.1016/j.heliyon.2024.e24670 PMC10837507 38314272 8. Garg P Emerging therapeutic strategies to overcome drug resistance in cancer cells Cancers 2024 16 13 2478 10.3390/cancers16132478 39001539 PMC11240358 Garg, P. et al. Emerging therapeutic strategies to overcome drug resistance in cancer cells. Cancers 16 39001539 10.3390/cancers16132478 PMC11240358 9. Santos ES Drug shortages in oncology: ASCO clinical guidance for alternative treatments JCO Oncol. Pract. 2024 20 1 19 32 10.1200/OP.23.00545 37963306 Santos, E. S. et al. Drug shortages in oncology: ASCO clinical guidance for alternative treatments. JCO Oncol. Pract. 20 37963306 10.1200/OP.23.00545 10. Khanna C Rosenberg M Vail D A review of paclitaxel and novel formulations including those suitable for use in dogs J. Vet. Intern. Med. 2015 29 4 1006 1012 10.1111/jvim.12596 26179168 PMC4895360 Khanna, C., Rosenberg, M. & Vail, D. A review of paclitaxel and novel formulations including those suitable for use in dogs. J. Vet. Intern. Med. 29 26179168 10.1111/jvim.12596 PMC4895360 11. Alalawy AI Key genes and molecular mechanisms related to paclitaxel resistance Cancer Cell Int. 2024 24 1 244 10.1186/s12935-024-03415-0 39003454 PMC11245874 Alalawy, A. I. Key genes and molecular mechanisms related to paclitaxel resistance. Cancer Cell Int. 24 39003454 10.1186/s12935-024-03415-0 PMC11245874 12. Nawara HM Paclitaxel-based chemotherapy targeting cancer stem cells from mono-to combination therapy Biomedicines 2021 9 5 500 10.3390/biomedicines9050500 34063205 PMC8147479 Nawara, H. M. et al. Paclitaxel-based chemotherapy targeting cancer stem cells from mono-to combination therapy. Biomedicines 9 34063205 10.3390/biomedicines9050500 PMC8147479 13. Sati P Paclitaxel and its semi-synthetic derivatives: Comprehensive insights into chemical structure, mechanisms of action, and anticancer properties Eur. J. Med. Res. 2024 29 1 90 10.1186/s40001-024-01657-2 38291541 PMC10826257 Sati, P. et al. Paclitaxel and its semi-synthetic derivatives: Comprehensive insights into chemical structure, mechanisms of action, and anticancer properties. Eur. J. Med. Res. 29 38291541 10.1186/s40001-024-01657-2 PMC10826257 14. Lan Y-Q Paclitaxel, oxaliplatin, 5-fluorouracil and leucovorin combination chemotherapy in patients with recurrent or metastatic gastric cancer Tumori. J. 2018 104 1 22 29 10.5301/tj.5000665 28777427 Lan, Y.-Q. et al. Paclitaxel, oxaliplatin, 5-fluorouracil and leucovorin combination chemotherapy in patients with recurrent or metastatic gastric cancer. Tumori. J. 104 10.5301/tj.5000665 28777427 15. Wang HM Cisplatin, tegafur, and leucovorin: A moderately effective and minimally toxic outpatient neoadjuvant chemotherapy for locally advanced squamous cell carcinoma of the head and neck Cancer: Interdiscip. Int. J. Am. Cancer Soc. 2002 94 11 2989 2995 10.1002/cncr.10570 12115388 Wang, H. M. et al. Cisplatin, tegafur, and leucovorin: A moderately effective and minimally toxic outpatient neoadjuvant chemotherapy for locally advanced squamous cell carcinoma of the head and neck. Cancer: Interdiscip. Int. J. Am. Cancer Soc. 94 10.1002/cncr.10570 12115388 16. Tekade RK Extraction and RP-HPLC determination of taxol in rat plasma, cell culture and quality control samples J. Biomed. Res. 2013 27 5 394 10.7555/JBR.27.20120123 24086173 PMC3783825 Tekade, R. K. et al. Extraction and RP-HPLC determination of taxol in rat plasma, cell culture and quality control samples. J. Biomed. Res. 27 24086173 10.7555/JBR.27.20120123 PMC3783825 17. Duan GL High-performance liquid chromatographic method for determination of leucovorin in plasma: Validation and application to a pharmacokinetic study in healthy volunteers Biomed. Chromatogr. 2002 16 4 282 286 10.1002/bmc.155 11933030 Duan, G. L. et al. High-performance liquid chromatographic method for determination of leucovorin in plasma: Validation and application to a pharmacokinetic study in healthy volunteers. Biomed. Chromatogr. 16 11933030 10.1002/bmc.155 18. Huang H The quantification of paclitaxel and its two major metabolites in biological samples by HPLC-MS/MS and its application in a pharmacokinetic and tumor distribution study in xenograft nude mouse Molecules 2023 28 3 1027 10.3390/molecules28031027 36770692 PMC9919154 Huang, H. et al. The quantification of paclitaxel and its two major metabolites in biological samples by HPLC-MS/MS and its application in a pharmacokinetic and tumor distribution study in xenograft nude mouse. Molecules 28 36770692 10.3390/molecules28031027 PMC9919154 19. Lim C-K Lord G Current developments in LC-MS for pharmaceutical analysis Biol. Pharm. Bull. 2002 25 5 547 557 10.1248/bpb.25.547 12033491 Lim, C.-K. & Lord, G. Current developments in LC-MS for pharmaceutical analysis. Biol. Pharm. Bull. 25 12033491 10.1248/bpb.25.547 20. İnce B Kavacık M Sezgintürk MK Electrochemical aptamer-based biosensors for disease biomarkers Essential Chem. 2024 1 1 1 23 10.1080/28378083.2024.2386517 İnce, B., Kavacık, M. & Sezgintürk, M. K. Electrochemical aptamer-based biosensors for disease biomarkers. Essential Chem. 1 21. Fallah A Recent advances in aptamer discovery, modification and improving performance Biochem. Biophys. Rep. 2024 40 101852 39525567 10.1016/j.bbrep.2024.101852 PMC11546948 Fallah, A. et al. Recent advances in aptamer discovery, modification and improving performance. Biochem. Biophys. Rep. 40 39525567 10.1016/j.bbrep.2024.101852 PMC11546948 22. Kohlberger M Gadermaier G SELEX: Critical factors and optimization strategies for successful aptamer selection Biotechnol. Appl. Biochem. 2022 69 5 1771 1792 10.1002/bab.2244 34427974 PMC9788027 Kohlberger, M. & Gadermaier, G. SELEX: Critical factors and optimization strategies for successful aptamer selection. Biotechnol. Appl. Biochem. 69 34427974 10.1002/bab.2244 PMC9788027 23. Bauer M Anything you can do, I can do better: Can aptamers replace antibodies in clinical diagnostic applications? Molecules 2019 24 23 4377 10.3390/molecules24234377 31801185 PMC6930532 Bauer, M. et al. Anything you can do, I can do better: Can aptamers replace antibodies in clinical diagnostic applications?. Molecules 24 31801185 10.3390/molecules24234377 PMC6930532 24. Toh SY Aptamers as a replacement for antibodies in enzyme-linked immunosorbent assay Biosens. Bioelectron. 2015 64 392 403 10.1016/j.bios.2014.09.026 25278480 Toh, S. Y. et al. Aptamers as a replacement for antibodies in enzyme-linked immunosorbent assay. Biosens. Bioelectron. 64 25278480 10.1016/j.bios.2014.09.026 25. Napit R Aptasensors and advancement in molecular recognition technology Adv. Mater. Technol. 2024 10 1 2400504 10.1002/admt.202400504 Napit, R. et al. Aptasensors and advancement in molecular recognition technology. Adv. Mater. Technol. 10 26. Radi A-E Electrochemical aptamer-based biosensors: Recent advances and perspectives Int. J. Electrochem. 2011 2011 1 863196 Radi, A.-E. Electrochemical aptamer-based biosensors: Recent advances and perspectives. Int. J. Electrochem. 2011 27. Farid S Aptamer-based optical and electrochemical sensors: A review Chemosensors 2023 11 12 569 10.3390/chemosensors11120569 Farid, S. et al. Aptamer-based optical and electrochemical sensors: A review. Chemosensors 11 28. Lakhin A Tarantul VZ Gening L Aptamers: Problems, solutions and prospects Acta Naturae (aнглoязычнaя вepcия) 2013 5 34 43 10.32607/20758251-2013-5-4-34-43 PMC3890987 24455181 Lakhin, A., Tarantul, V. Z. & Gening, L. Aptamers: Problems, solutions and prospects. Acta Naturae (aнглoязычнaя вepcия) 5 PMC3890987 24455181 29. Mayer G Fluorescence-activated cell sorting for aptamer SELEX with cell mixtures Nat. Protoc. 2010 5 12 1993 2004 10.1038/nprot.2010.163 21127492 Mayer, G. et al. Fluorescence-activated cell sorting for aptamer SELEX with cell mixtures. Nat. Protoc. 5 21127492 10.1038/nprot.2010.163 30. Oberhaus FV Frense D Beckmann D Immobilization techniques for aptamers on gold electrodes for the electrochemical detection of proteins: a review Biosensors 2020 10 5 45 10.3390/bios10050045 32354207 PMC7277302 Oberhaus, F. V., Frense, D. & Beckmann, D. Immobilization techniques for aptamers on gold electrodes for the electrochemical detection of proteins: a review. Biosensors 10 32354207 10.3390/bios10050045 PMC7277302 31. Formisano N Optimisation of an electrochemical impedance spectroscopy aptasensor by exploiting quartz crystal microbalance with dissipation signals Sens. Actuators, B Chem. 2015 220 369 375 10.1016/j.snb.2015.05.049 Formisano, N. et al. Optimisation of an electrochemical impedance spectroscopy aptasensor by exploiting quartz crystal microbalance with dissipation signals. Sens. Actuators, B Chem. 220 32. Shum PH Dennany L Towards voltammetric point of care detection of leucovorin Analyst 2024 149 9 2655 2663 10.1039/D4AN00227J 38563222 Shum, P. H. & Dennany, L. Towards voltammetric point of care detection of leucovorin. Analyst 149 38563222 10.1039/d4an00227j 33. Shum PH Dennany L Dual electrochemical detection of leucovorin and its metabolite 5-methyltetrahydrofolic acid J. Electroanal. Chem. 2024 973 118666 10.1016/j.jelechem.2024.118666 Shum, P. H. & Dennany, L. Dual electrochemical detection of leucovorin and its metabolite 5-methyltetrahydrofolic acid. J. Electroanal. Chem. 973 34. Brown K Dennany L Assessment of [Ru (bpy) 2] 3+ and [Os (diars) 2 (bthp)] 2+ for the electrochemiluminescence detection of gemcitabine and leucovorin toward diagnostic point-of-care sensors within precision medicine Sens. Actuators Rep. 2021 3 100065 10.1016/j.snr.2021.100065 Brown, K. & Dennany, L. Assessment of [Ru (bpy) 2] 3+ and [Os (diars) 2 (bthp)] 2+ for the electrochemiluminescence detection of gemcitabine and leucovorin toward diagnostic point-of-care sensors within precision medicine. Sens. Actuators Rep. 3 35. Bai J A novel luminescence sensor based on porous molecularly imprinted polymer-ZnS quantum dots for selective recognition of paclitaxel Colloids Surf., A 2021 610 125696 10.1016/j.colsurfa.2020.125696 Bai, J. et al. A novel luminescence sensor based on porous molecularly imprinted polymer-ZnS quantum dots for selective recognition of paclitaxel. Colloids Surf., A 610 36. Zhang C Lang R Wen X An electrochemical biosensor based on β-cyclodextrin modified electrode to determine Paclitaxel as an important agent in treatment of breast cancer Alex. Eng. J. 2024 91 550 557 10.1016/j.aej.2024.02.017 Zhang, C., Lang, R. & Wen, X. An electrochemical biosensor based on β-cyclodextrin modified electrode to determine Paclitaxel as an important agent in treatment of breast cancer. Alex. Eng. J. 91 ",
  "metadata": {
    "Title of this paper": "An electrochemical biosensor based on β-cyclodextrin modified electrode to determine Paclitaxel as an important agent in treatment of breast cancer",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475007/"
  }
}