{
  "title": "Paper_856",
  "abstract": "pmc Biomol Biomed Biomol Biomed 4372 biomolbiomed Biomolecules and Biomedicine 2831-0896 2831-090X Association of Basic Medical Sciences of Federation of Bosnia and Herzegovina PMC12461268 PMC12461268.1 12461268 12461268 40613523 10.17305/bb.2025.12053 BB-25-2696 1 Research Article Role of telomere maintenance genes as a predictive biomarker for colorectal cancer immunotherapy response and prognosis Wang Zhikai https://orcid.org/0009-0004-7445-3229 1 # Zhao Chunyan https://orcid.org/0009-0006-3976-8326 2 # Huang Yifen https://orcid.org/0009-0004-3829-3061 3 * Li Chong https://orcid.org/0009-0008-1818-6591 2 * 1 2 3 * 3516882473@qq.com 152389@hospital.cqmu.edu.cn # Zhikai Wang and Chunyan Zhao contributed equally to this work. 19 9 2025 2 7 2025 25 12 497497 2696 2711 14 1 2025 2 7 2025 22 5 2025 02 07 2025 26 09 2025 26 09 2025 © 2025 Wang et al. 2025 https://creativecommons.org/licenses/by/4.0/ This article is available under a Creative Commons License (Attribution 4.0 International, as described at https://creativecommons.org/licenses/by/4.0/ Colorectal cancer (CRC) represents a significant global health challenge. Although telomere maintenance plays a crucial role in tumorigenesis, the prognostic value and immunotherapeutic relevance of telomere maintenance genes (TMGs) in CRC remain poorly understood. In this study, relevant data were retrieved from The Cancer Genome Atlas (TCGA) and the Gene Expression Omnibus (GEO) databases. TMG scores were calculated using the single-sample gene set enrichment analysis (ssGSEA) method, and TMGs associated with prognosis were subsequently identified. TCGA-CRC samples were classified into subtypes via consensus clustering (ConsensusClusterPlus). A risk prediction model was then constructed using univariate and Lasso Cox regression analyses. Survival analysis was performed using Kaplan–Meier curves generated with the survival package. Key genes were validated in vitro in vitro. Immunotherapy risk model prognostic signature telomere maintenance gene TMG colorectal cancer CRC pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Colorectal cancer (CRC) ranks among the most prevalent malignancies of the digestive system [ 1 2 3 4 4 5 6 7 8 9 10 Telomeres, which consist of protective proteins and TTAGGG repeats [ 11 12 13 14 15 16 17 13 18 19 20 21 22 23 24 25 26 27 This study was designed to systematically evaluate the expression patterns, molecular subtypes, and prognostic significance of TMGs in CRC, along with their interactions with the immune microenvironment and correlations with treatment responses. Using transcriptomic data from public CRC databases, the single-sample gene set enrichment analysis (ssGSEA) method was employed to compute TMG expression scores, and key survival-related genes were identified. Molecular subtypes were classified based on prognostically correlated TMGs using a consensus clustering method. Differential expression and functional enrichment analyses were then performed to explore the potential biological mechanisms. A RiskScore model was developed to assess the performance of TMGs in evaluating immune cell infiltration, immunotherapy response, chemotherapy sensitivity, and survival outcomes in CRC patients. Finally, in vitro Materials and methods Acquisition and preprocessing of data CRC data, including clinical information for both colon and rectum adenocarcinomas, copy number variations (CNVs), and somatic mutations, were retrieved from The Cancer Genome Atlas (TCGA) database ( https://portal.gdc.cancer.gov/ GSE17537 https://www.ncbi.nlm.nih.gov/geo GSE17537 28 Identification of CRC-related TMGs and analysis of their mutations and CNVs Using the ssGSEA method, TMG scores for the TCGA-CRC dataset were computed. DEGs between tumor and adjacent tissues were identified and intersected with TMG signatures. Prognosis-correlated TMGs were then selected through univariate Cox regression analysis. CNV and mutation data from the TCGA database were collected. Briefly, MuTect2 [ 29 30 31 Molecular clustering Consensus clustering was performed on the tumor samples using the ConsensusClusterPlus package [ 32 k Enrichment analysis DEGs between C1 and C2 were identified using the limma package (false discovery rate < 0.05 & |log2FC| >log2(1.5)) [ 33 34 35 Establishment of a risk model The prognosis-correlated DEGs were screened using univariate Cox regression analysis, followed by refinement of the risk model with Lasso Cox regression from the glmnet package [ 36 (1) Where βi represents the coefficient of a gene in the Cox regression model, and Expi represents the gene expression. The samples were divided into low- and high-risk groups based on the median RiskScore as the threshold. Survival differences between the two groups were then analyzed using Kaplan–Meier (KM) curves with the survival package [ 37 38 39 Tumor microenvironment (TME) differences across the risk groups Immune cell infiltration in each risk groups was comprehensively examined using the ssGSEA algorithm, the MCPcounter package [ 40 http://cistrome.org/TIMER Culture and transfection of cells Human colon adenocarcinoma cells (SW1116, BNCC100262) and normal human colon epithelial cells (NCM460, BNCC339288), both obtained from the BeiNa Culture Collection (Xinyang, China), were cultured in either RPMI Medium 1640 (31800, Solarbio Lifesciences, Beijing, China) or Leibovitz’s L-15 Cell Culture Medium (LA9510, Solarbio Lifesciences). Both media were supplemented with 10% FBS (S9020, Solarbio Lifesciences). The cultures were maintained at 37 ∘ 2 41 Wound healing assay A controlled artificial wound was created on the cell monolayers using a 10 µL pipette tip after culturing the transfected CRC cells SW1116 (1 × 10 5 ∘ Transwell assay Matrigel (50 µL, Corning, Inc., Corning, NY, USA) was used to pre-coat the transwell chambers (pore size: 8 µm, 3422, Corning, Inc.), which were placed on 24-well plates. Next, the transfected SW1116 cells in serum-free medium (200 µL) were planted into the upper chamber at 1 × 10 5 QRT-PCR analysis Total RNA was extracted from NCM460 and SW1116 cells using the TriZol kit (15596026CN, Invitrogen, Carlsbad, CA, USA) and then reverse transcribed into cDNA with a first-strand cDNA synthesis kit (1708890, Bio-Rad Laboratories, Hercules, CA, USA). Quantitative PCR (qPCR) amplification was performed using a CFX384 qPCR System (1855484, Bio-Rad Laboratories) with SYBR Green Supermix (1708880, Bio-Rad Laboratories), under the following cycling conditions: initial denaturation at 95 ∘ ∘ ∘ ∘ ‑ΔΔct 42 Table S1 Immunotherapy and drug sensitivity Immunotherapy responses were predicted by standardizing the transcriptome data applying TIDE ( http://tide.dfci.harvard.edu/ 43 50 Statistical analysis All computational analyses were conducted using R (version 3.6.0). The normality of data distribution was assessed with the Shapiro–Wilk test prior to testing for variance. For comparisons between two independent groups of continuous variables, the Wilcoxon rank-sum test was applied. The Kruskal–Wallis test was used to examine differences in continuous variables among three groups. The chi-square test was employed to assess disparities in categorical variables across different groups. Additionally, the log-rank test was used to compare survival times between patients in different groups. P in vitro t http://sangerbox.com/ 44 Results Genomic landscape of the TMGs in CRC Using ssGSEA analysis, we first computed the TMG scores in the TCGA-CRC dataset. The results showed that tumor tissues exhibited significantly higher TMG scores than adjacent non-tumor tissues ( Figure 1A Figure 1B Figure 1C Figure 1D Figure 1E Figure 1. Genomic landscape analysis of TMGs in CRC. P Identification of CRC molecular subtypes based on TMGs In this study, we use consistency clustering to analyze TCGA-CRC samples, utilizing a combination of CDF curves, Delta Area plots, and consistency matrix heatmaps. The stability and reasonableness of different clustering numbers ( k Figure 2A k k k Figure 2B k k k k Figure 2C k k Figure 2D P Figure 2E Figure 2. Classification and prognostic variations among TCGA- CRC samples. k Enrichment analysis results of the DEGs Differential expression analysis using limma package [ 45 Figure 3A 3D Figure 3E 3H Figure 3. Differential gene identification and enrichment analysis. Development of a risk model based using the seven TMGs Through univariate Cox analysis, we identified 101 prognostic DEGs ( P CDC25C, CXCL1, RTL8C, FABP4, ITLN1, MUC12, ERI1 Figure 4A Figure 4B (1) Figure 4. Development and validation of a TMGs-based risk model. Figure 5. Nomogram development for CRC prognosis assessment. P P Patients were allocated by the median value of RiskScore into low-risk and high-risk groups. KM survival curve demonstrated that the two risk groups in the TCGA-CRC training cohort differed significantly in patients’ survival, with those having a higher RiskScore showing shorter OS ( Figure 4C 38 Figure 4C Figure 4D The robustness of the RiskScore was confirmed using the validation dataset GSE17537 Figure 4E 4F P Figure 4G 4I Validation of the TMG-related risk model Analysis of the TCGA-CRC cohort revealed strong associations between risk groups and pathological staging, with the high-risk group showing a higher prevalence of the C2 subtype and metastasis cases. This finding aligns with our previous research, which demonstrated that the C2 cluster is enriched in metastasis-related pathways. Further analysis indicated that the RiskScore correlated positively with more advanced clinical stages (T.stage, N.stage, and overall stage). Figure 5A 5B Figure 5C 5D Figure 5E Figure 5F Figure 5G In vitro The relative expressions of the seven genes ( CDC25C CXCL1 RTL8C FABP4 ITLN1 MUC12 ERI1 ITLN1 ERI1 CDC25C CXCL1 RTL8C FABP4 MUC12 Figure 6A 6G P Figure 6. In vitro P P P P Previous study found the potential of MUC12 46 47 MUC12 Figure 6H 6I MUC12 P MUC12 Differences in the TME between CRC patients with different risks The ssGSEA analysis showed that the infiltration of Type 17 T helper cells, neutrophils, activated B cells, Type 2 T helper cells, activated CD4 T cells, and activated CD8 T cells—immune cells typically involved in killing tumor cells [ 48 Figure 7A Figure 7B Figure 7C Figure 7. Analysis of immune infiltration levels between high- and low-risk groups. ns P P P P P Immunotherapy and drug sensitivity analysis for CRC patients in different risk groups TIDE analysis revealed significantly lower TIDE scores in the low-risk group ( Figure 8A Figure 8B 49 Figure 8C 8E Figure 8F Figure 8. Immunotherapy and drug sensitivity studies between high- and low-risk groups. ns P P P P Discussion CRC diagnosis remains challenging due to its asymptomatic nature in the early stages, which results in a poor prognosis. This underscores the need for effective prognostic biomarkers to reduce the mortality rate in CRC patients [ 7 50 51 52 52 53 54 55 56 57 58 in vitro 59 60 61 62 63 64 65 66 67 68 in vitro 69 70 in vivo For cancer pathogenesis, the TME is a crucial factor, and its compositional changes can provide insights into patient responses to immunotherapy [ 71 72 59 73 74 There are several limitations in this study that should be acknowledged. First, while we utilized clinical data and large-scale RNA-seq data from public databases, potential biases could arise from inter-sample heterogeneity, differences in sequencing platforms, and incomplete clinical annotations. These factors may affect the generalizability of our model. Future multicenter prospective studies with larger, independent cohorts are needed to validate and enhance the clinical applicability and robustness of our risk model. Second, while we observed significant differences in immune cell infiltration and immune checkpoint expression between the two risk groups, the precise molecular mechanisms by which TMGs modulate the TME or contribute to immune evasion remain unclear. Future investigations should integrate single-cell transcriptomics, multi-omics approaches, and functional experiments to systematically explore the immunoregulatory roles of key TMGs and their potential as targets for combination immunotherapy. Lastly, our in vitro Conclusion This study is the first to systematically identify TMGs closely linked to the prognosis of CRC at the whole-genome level and to construct a CRC prognostic risk model consisting of seven key TMGs (CDC25C, CXCL1, RTL8C, FABP4, ITLN1, MUC12, and ERI1). The model demonstrated strong predictive ability across multiple independent cohorts and was also effective in identifying differences in the immune microenvironment and drug sensitivity of CRC patients. Our findings suggest that TMGs influence clinical outcomes in CRC patients by modulating tumor immune escape mechanisms. Combined with in vitro Supplemental data Table S1 Primer sequences used in the study  Gene  Accession no.  Primers (5′-3′)  Forward  Reverse  CDC25C NM_001790 AAGGCGGCTACAGAGACTTCTT AGAGTTGGCTGGCTTGTGAGA  CXCL1 NM_001511 TGCTGCTCCTGCTCCTGGTA GCTTTCCGCCCATTCTTGAGTG  RTL8C NM_001078171 AAGCGAGGAGCAGCGATGGA TGTGAGGCGGGTGATGAGGAA  FABP4 NM_001442 TGCAGCTTCCTTCTCACCTTGA TGACGCATTCCACCACCAGTT  ITLN1 NM_017625 AACGCCTTGTGTGCTGGAATGA ATCTCACGGCTGCTGCTGTAAC  MUC12 NM_001164462 CCTCAACTCACACGACGCCTTC TGCTGCTGTAGACGGTGGTAGA  ERI1 NM_153332 ATCCTCTTGCCTCAGCCTCCT TTCAAGACCAGCCTGACCAACA  GAPDH NM_002046 GTCTCCTCTGACTTCAACAGCG ACCACCCTGTTGCTGTAGCCAA Conflicts of interest: Authors declare no conflicts of interest. Funding: The study was supported by Chongqing Natural Science Foundation General Project (CSTB2023NSCQ-MSX0502) and Chongqing Dazu District Science and Technology Development Project (DZKJ2022JSYJ-KWXM1003). Data Availability The datasets generated and/or analyzed during the current study are available in the [ GSE17537 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE17537 References 1 Li JX Han T Wang X Wang YC Chen X Chen WS Identification of prognostic immune-related lncRNA signature predicting the overall survival for colorectal cancer Sci Rep 2023 13 1 1333 https://doi.org/10.1038/s41598-023-28305-9 36693898 10.1038/s41598-023-28305-9 PMC9873726 2 Ruan Y Lu G Yu Y Luo Y Wu H Shen Y PF-04449913 Inhibits proliferation and metastasis of colorectal cancer cells by down-regulating MMP9 expression through the ERK/p65 pathway Curr Mol Pharmacol Online ahead of print https://doi.org/10.2174/1874467217666230915125622 10.2174/1874467217666230915125622 37724680 3 Sharma P Bora K Kasugai K Balabantaray B-K Two stage classification with CNN for colorectal cancer detection Oncologie 2020 22 3 129 45 https://doi.org/10.32604/oncologie.2020.013870 4 Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Global cancer statistics 2022:GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 3 229 63 https://doi.org/10.3322/caac.21834 38572751 10.3322/caac.21834 5 Shi X Wang Y Li C Fu W Zhang X Gong A Knockdown of RCN1 contributes to the apoptosis of colorectal cancer via regulating IP3R1 Biocell 2024 48 5 835 45 https://doi.org/10.32604/biocell.2024.048076 6 Malki A ElRuz RA Gupta I Allouch A Vranic S Al Moustafa A-E Molecular mechanisms of colon cancer progression and metastasis: recent insights and advancements Int J Mol Sci 2021 22 1 130 https://doi.org/10.3390/ijms22010130 10.3390/ijms22010130 PMC7794761 33374459 7 Dekker E Tanis PJ Vleugels JL Kasi PM Wallace MB Colorectal cancer Lancet Diabetes Endocrinol 2019 394 10207 1467 80 https://doi.org/10.1016/S0140-6736(19)32319-0 10.1016/S0140-6736(19)32319-0 31631858 8 Wang Y Zhang Z Sun W Zhang J Xu Q Zhou X Ferroptosis in colorectal cancer: potential mechanisms and effective therapeutic targets Biomed Pharmacother 2022 153 113524 https://doi.org/10.1016/j.biopha.2022.113524 36076606 10.1016/j.biopha.2022.113524 9 Duan L Yang W Wang X Zhou W Zhang Y Liu J Advances in prognostic markers for colorectal cancer* Expert Rev Mol Diagn 2019 19 4 313 24 https://doi.org/10.1080/14737159.2019.1592679 30907673 10.1080/14737159.2019.1592679 10 Cherri S Oneda E Zanotti L Zaniboni A Optimizing the first-line treatment for metastatic colorectal cancer Front Oncol 2023 13 1246716 https://doi.org/10.3389/fonc.2023.1246716 37909027 10.3389/fonc.2023.1246716 PMC10614157 11 Makarov VL Hirose Y Langmore JP Long G tails at both ends of human chromosomes suggest a C strand degradation mechanism for telomere shortening Cell Mol Life Sci 1997 88 5 657 66 https://doi.org/10.1016/S0092-8674(00)81908-X 10.1016/s0092-8674(00)81908-x 9054505 12 Brabletz T Kalluri R Nieto MA Weinberg RA EMT in cancer Nat Rev Cancer 2018 18 2 128 34 https://doi.org/10.1038/nrc.2017.118 29326430 10.1038/nrc.2017.118 13 Nassour J Schmidt TT Karlseder J Telomeres and cancer: resolving the paradox Annu Rev Cancer Biol 2021 5 59 77 https://doi.org/10.1146/annurev-cancerbio-050420-023410 34532611 10.1146/annurev-cancerbio-050420-023410 PMC8442540 14 Alder JK Armanios M Telomere-mediated lung disease Physiol Rev 2022 102 4 1703 20 https://doi.org/10.1152/physrev.00046.2021 35532056 10.1152/physrev.00046.2021 PMC9306791 15 Brandt M Dörschmann H Khraisat SA Knopp T Ringen J Kalinovic S Telomere shortening in hypertensive heart disease depends on oxidative DNA damage and predicts impaired recovery of cardiac function in heart failure Hypertension 2022 79 10 2173 84 https://doi.org/10.1161/HYPERTENSIONAHA.121.18935 35862118 10.1161/HYPERTENSIONAHA.121.18935 16 Kim NW Piatyszek MA Prowse KR Harley CB West MD Ho PL Specific association of human telomerase activity with immortal cells and cancer Science 1994 266 5193 2011 5 https://doi.org/10.1126/science.7605428 7605428 10.1126/science.7605428 17 Wang F Tang ML Zeng ZX Wu RY Xue Y Hao YH Telomere-and telomerase-interacting protein that unfolds telomere G-quadruplex and promotes telomere extension in mammalian cells Proc Nat Acad Sci 2012 109 50 20413 8 https://doi.org/10.1073/pnas.1200232109 23184978 10.1073/pnas.1200232109 PMC3528488 18 in der Stroth L Tharehalli U Guenes C Lechel A Telomeres and telomerase in the development of liver cancer Cancers 2020 12 8 2048 https://doi.org/10.3390/cancers12082048 32722302 10.3390/cancers12082048 PMC7464754 19 Savage SA Telomere length and cancer risk: finding Goldilocks Biogerontology 2024 25 2 265 78 https://doi.org/10.1007/s10522-023-10080-9 38109000 10.1007/s10522-023-10080-9 20 Xiao Y Xu D Jiang C Huili Y Nie S Zhu H Telomere maintenance-related genes are important for survival prediction and subtype identification in bladder cancer Front Genet 2023 13 1087246 https://doi.org/10.3389/fgene.2022.1087246 36685927 10.3389/fgene.2022.1087246 PMC9853053 21 Günes C Wezel F Southgate J Bolenz C Implications of TERT promoter mutations and telomerase activity in urothelial carcinogenesis Nat Rev Urol 2018 15 6 386 93 https://doi.org/10.1038/s41585-018-0001-5 29599449 10.1038/s41585-018-0001-5 22 Liu X Wang J Su D Wang Q Li M Zuo Z Development and validation of a glioma prognostic model based on telomere-related genes and immune infiltration analysis Transl Cancer Res 2024 13 7 3182 99 https://doi.org/10.21037/tcr-23-2294 39145097 10.21037/tcr-23-2294 PMC11319981 23 Shay JW Wright WE Role of telomeres and telomerase in cancer Semin Cancer Biol 2011 21 6 349 53 https://doi.org/10.1016/j.semcancer.2011.10.001 22015685 10.1016/j.semcancer.2011.10.001 PMC3370415 24 Bryan TM Englezou A Dalla-Pozza L Dunham MA Reddel RR Evidence for an alternative mechanism for maintaining telomere length in human tumors and tumor-derived cell lines Nat Med 1997 3 11 1271 4 https://doi.org/10.1038/nm1197-1271 9359704 10.1038/nm1197-1271 25 Heidenreich B Kumar R TERT promoter mutations in telomere biology Mutat Res Rev Mutat Res 2017 771 15 31 https://doi.org/10.1016/j.mrrev.2016.11.002 28342451 10.1016/j.mrrev.2016.11.002 26 Yan M Zhang Z Wang L Huang H Wang J Zhu C Cross-talk of three molecular subtypes of telomere maintenance defines clinical characteristics and tumor microenvironment in gastric cancer J Cancer 2024 15 10 3227 41 https://doi.org/10.7150/jca.92207 38706908 10.7150/jca.92207 PMC11064253 27 Barthel FP Wei W Tang M Martinez-Ledesma E Hu X Amin SB Systematic analysis of telomere length and somatic alterations in 31 cancer types Nat Genet 2017 49 3 349 57 https://doi.org/10.1038/ng.3781 28135248 10.1038/ng.3781 PMC5571729 28 Zou JJ Chu SD Bao QF Zhang YY Telomere maintenance genes-derived prognosis signature characterizes immune landscape and predicts prognosis of head and neck squamous cell carcinoma Medicine 2023 102 31 e34586 https://doi.org/10.1097/MD.0000000000034586 37543795 10.1097/MD.0000000000034586 PMC10402981 29 Patiyal S Dhall A Raghava GPS Prediction of risk-associated genes and high-risk liver cancer patients from their mutation profile: benchmarking of mutation calling techniques Biol Methods Protoc 2022 7 1 bpac012 https://doi.org/10.1093/biomethods/bpac012 35734767 10.1093/biomethods/bpac012 PMC9204470 30 Mayakonda A Lin DC Assenov Y Plass C Koeffler HP Maftools: efficient and comprehensive analysis of somatic variants in cancer Genome Res 2018 28 11 1747 56 https://doi.org/10.1101/gr.239244.118 30341162 10.1101/gr.239244.118 PMC6211645 31 Zheng S Wang X Fu Y Li B Xu J Wang H Targeted next-generation sequencing for cancer-associated gene mutation and copy number detection in 206 patients with non-small-cell lung cancer Bioengineered 2021 12 1 791 802 https://doi.org/10.1080/21655979.2021.1890382 33629637 10.1080/21655979.2021.1890382 PMC8291840 32 Li J Xie L Xie Y Wang F Bregmannian consensus clustering for cancer subtypes analysis Comput Methods Programs Biomed 2020 189 105337 https://doi.org/10.1016/j.cmpb.2020.105337 31962279 10.1016/j.cmpb.2020.105337 33 Storey JD Tibshirani R Statistical significance for genomewide studies Proc Nat Acad Sci 2003 100 16 9440 5 https://doi.org/10.1073/pnas.1530509100 12883005 10.1073/pnas.1530509100 PMC170937 34 Yu G Wang L-G Han Y He Q-Y clusterProfiler: an R package for comparing biological themes among gene clusters OMICS 2012 16 5 284 7 https://doi.org/10.1089/omi.2011.0118 22455463 10.1089/omi.2011.0118 PMC3339379 35 Xia S Tao H Su S Chen X Ma L Li J DNA methylation variation is identified in monozygotic twins discordant for congenital heart diseases Congenit Heart Dis 2024 19 2 247 56 https://doi.org/10.32604/chd.2024.052583 36 Li Q Chu Y Yao Y Song Q A Treg-related riskscore model may improve the prognosis evaluation of colorectal cancer J Gene Med 2024 26 2 e3668 https://doi.org/10.1002/jgm.3668 38342959 10.1002/jgm.3668 37 Therneau TM Lumley T Package ‘survival’ R Top Doc 2015 128 10 28 33 https://doi.org/10.32614/CRAN.package.survival 38 Blanche P Dartigues JF Jacqmin-Gadda H Estimating and comparing time-dependent areas under receiver operating characteristic curves for censored event times with competing risks Stat Med 2013 32 30 5381 97 https://doi.org/10.1002/sim.5958 24027076 10.1002/sim.5958 39 Li M Wei X Zhang SS Li S Chen SH Shi SJ Recognition of refractory Mycoplasma pneumoniae pneumonia among Myocoplasma pneumoniae pneumonia in hospitalized children: development and validation of a predictive nomogram model BMC Pulm Med. 2023 23 1 383 https://doi.org/10.1186/s12890-023-02684-1 37817172 10.1186/s12890-023-02684-1 PMC10566172 40 Becht E Giraldo NA Lacroix L Buttard B Elarouci N Petitprez F Estimating the population abundance of tissue-infiltrating immune and stromal cell populations using gene expression Genome Biol 2016 17 1 218 https://doi.org/10.1186/s13059-016-1070-5 27765066 10.1186/s13059-016-1070-5 PMC5073889 41 Zhang X Jin M Yao X Liu J Yang Y Huang J Upregulation of LncRNA WT1-AS inhibits tumor growth and promotes autophagy in gastric cancer via suppression of PI3K/Akt/mTOR pathway Curr Mol Pharmacol 2024 17 e18761429318398 https://doi.org/10.2174/0118761429318398240918063450 39592900 10.2174/0118761429318398240918063450 42 Amuthalakshmi S Sindhuja S Nalini CN A review on PCR and POC-PCR—a boon in the diagnosis of COVID-19 Curr Pharmaceut Anal 2022 18 8 745 64 https://doi.org/10.2174/1573412918666220509032754 43 Geeleher P Cox N Huang RS pRRophetic: an R package for prediction of clinical chemotherapeutic response from tumor gene expression levels Plos One 2014 9 9 e107468 https://doi.org/10.1371/journal.pone.0107468 25229481 10.1371/journal.pone.0107468 PMC4167990 44 Shen W Song Z Zhong X Huang M Shen D Gao P Sangerbox: a comprehensive, interaction-friendly clinical bioinformatics analysis platform Imeta 2022 1 3 e36 https://doi.org/10.1002/imt2.36 38868713 10.1002/imt2.36 PMC10989974 45 Song ZG Yu JB Wang MM Shen WT Wang CC Lu TY CHDTEPDB: transcriptome expression profile database and interactive analysis platform for congenital heart disease Congenit Heart Dis 2023 18 6 693 701 https://doi.org/10.32604/chd.2024.048081 46 Zhang L Li D Du F Huang H Yuan C Fu J A panel of differentially methylated regions enable prognosis prediction for colorectal cancer Genomics 2021 113 5 3285 93 https://doi.org/10.1016/j.ygeno.2021.07.010 34302946 10.1016/j.ygeno.2021.07.010 47 Iranmanesh H Majd A Nazemalhosseini Mojarad E Zali MR Hashemi M Investigating the relationship between the expression level of membrane-bound mucin (MUC12) and clinicopathological characterization of colorectal cancer Arch Adv Biosci 2021 12 1 31 6 https://doi.org/10.22037/aab.v12i1.34371 10.31661/gmj.v10i0.2030 PMC9086863 35572847 48 Hedrick CC Malanchi I Neutrophils in cancer: heterogeneous and multifaceted Nat Rev Immunol 2022 22 3 173 87 https://doi.org/10.1038/s41577-021-00571-6 34230649 10.1038/s41577-021-00571-6 49 Hu J Yu A Othmane B Qiu D Li H Li C Siglec15 shapes a non-inflamed tumor microenvironment and predicts the molecular subtype in bladder cancer Theranostics 2021 11 7 3089 108 https://doi.org/10.7150/thno.53649 33537076 10.7150/thno.53649 PMC7847675 50 Tomasova K Kroupa M Forsti A Vodicka P Vodickova L Telomere maintenance in interplay with DNA repair in pathogenesis and treatment of colorectal cancer Mutagenesis 2020 35 3 261 71 https://doi.org/10.1093/mutage/geaa005 32083302 10.1093/mutage/geaa005 51 Ma SZ Zhu XM Xin C Cao F Xu MN Han XL RCN3 expression indicates prognosis in colorectal cancers Oncologie 2022 24 4 823 33 https://doi.org/10.32604/oncologie.2022.025411 52 Louzon M Zahn S Capelli N Massemin S Coeurdassier M Pauget B Impact of ageing and soil contaminants on telomere length in the land snail Ecotoxicol Environ Saf 2020 201 110766 https://doi.org/10.1016/j.ecoenv.2020.110766 32531572 10.1016/j.ecoenv.2020.110766 53 Hambleton P Barbieri M-A A hypothesis for a novel role of RIN1-the modulation of telomerase function by the MAPK signaling pathway BioCell 2020 44 4 525 34 https://doi.org/10.32604/biocell.2020.011407 54 Huang Z Zhang Z Zhou C Liu L Huang C Epithelial–mesenchymal transition: the history, regulatory mechanism, and cancer therapeutic opportunities MedComm 2022 3 2 e144 https://doi.org/10.1002/mco2.144 35601657 10.1002/mco2.144 PMC9115588 55 Suzuki T Conant A Curow C Alexander A Ioffe Y Unternaehrer JJ Role of epithelial-mesenchymal transition factor SNAI1 and its targets in ovarian cancer aggressiveness J Cancer Metastasis Treatment 2023 9 25 https://doi.org/10.20517/2394-4722.2023.34 10.20517/2394-4722.2023.34 PMC10673625 38009093 56 Tran HD Luitel K Kim M Zhang K Longmore GD Tran DD Transient SNAIL1 expression is necessary for metastatic competence in breast cancer Cancer Res 2014 74 21 6330 40 https://doi.org/10.1158/0008-5472.CAN-14-0923 25164016 10.1158/0008-5472.CAN-14-0923 PMC4925010 57 Fang J Ding Z SNAI1 is a prognostic biomarker and correlated with immune infiltrates in gastrointestinal cancers Aging 2020 12 17 17167 208 https://doi.org/10.18632/aging.103667 32833672 10.18632/aging.103667 PMC7521489 58 Qing F Xue J Sui L Xiao Q Xie T Chen Y Intestinal epithelial SNAI1 promotes the occurrence of colorectal cancer by enhancing EMT and Wnt/β-catenin signaling Med Oncol (Northwood, London, England) 2023 41 1 34 https://doi.org/10.1007/s12032-023-02253-w 10.1007/s12032-023-02253-w 38150048 59 Galindo-Pumariño C Collado M Castillo ME Barquín J Romio E Larriba MJ SNAI1-expressing fibroblasts and derived-extracellular matrix as mediators of drug resistance in colorectal cancer patients Toxicol Appl Pharmacol 2022 450 116171 https://doi.org/10.1016/j.taap.2022.116171 35878797 10.1016/j.taap.2022.116171 60 Molparia B Oliveira G Wagner JL Spencer EG Torkamani A A feasibility study of colorectal cancer diagnosis via circulating tumor DNA derived CNV detection Plos One 2018 13 5 e0196826 https://doi.org/10.1371/journal.pone.0196826 29791457 10.1371/journal.pone.0196826 PMC5965833 61 Liu K Zheng M Lu R Du J Zhao Q Li Z The role of CDC25C in cell cycle regulation and clinical cancer therapy: a systematic review Cancer Cell Int 2020 20 1 213 https://doi.org/10.1186/s12935-020-01304-w 32518522 10.1186/s12935-020-01304-w PMC7268735 62 Korbecki J Bosiacki M Barczak K Łagocka R Brodowska A Chlubek D Involvement in tumorigenesis and clinical significance of CXCL1 in reproductive cancers: breast cancer, cervical cancer, endometrial cancer, ovarian cancer and prostate cancer Int J Mol Sci 2023 24 8 7262 https://doi.org/10.3390/ijms24087262 37108425 10.3390/ijms24087262 PMC10139049 63 Sun NH Zhao X Therapeutic implications of FABP4 in cancer: an emerging target to tackle cancer Front Pharmacol 2022 13 948610 https://doi.org/10.3389/fphar.2022.948610 35899119 10.3389/fphar.2022.948610 PMC9310032 64 Chen HP Chen SY Chen C Li AF Wei ZX Leucine zipper downregulated in cancer 1 may serve as a favorable prognostic biomarker by influencing proliferation, colony formation, cell cycle, apoptosis, and migration ability in hepatocellular carcinoma Front Genet 2022 13 900951 https://doi.org/10.3389/fgene.2022.900951 35957693 10.3389/fgene.2022.900951 PMC9358146 65 Li H Liu J Liu WH Zheng L Chen JH Investigation of potential prognostic biomarkers for colorectal cancer Arch Med Sci 2023 21 2 425 36 https://doi.org/10.5114/aoms/167397 40395892 10.5114/aoms/167397 PMC12087331 66 Paval DR Di Virgilio TG Skipworth RJ Gallagher IJ The emerging role of intelectin-1 in cancer Front Oncol 2022 12 767859 https://doi.org/10.3389/fonc.2022.767859 35186726 10.3389/fonc.2022.767859 PMC8850632 67 Iranmanesh H Majd A Mojarad EN Zali MR Hashemi M Investigating the relationship between the expression level of mucin gene cluster (MUC2, MUC5A, and MUC5B) and clinicopathological characterization of colorectal cancer Galen Med J 2021 10 e2030 https://doi.org/10.31661/gmj.v10i0.2030 35572847 10.31661/gmj.v10i0.2030 PMC9086863 68 Williams SJ McGuckin MA Gotley DC Eyre HJ Sutherland GR Antalis TM Two novel mucin genes down-regulated in colorectal cancer identified by differential display Cancer Res 1999 59 16 4083 9 PMID: 10463611 10463611 69 Cox KE Liu S Lwin TM Hoffman RM Batra SK Bouvet M The mucin family of proteins: candidates as potential biomarkers for colon cancer Cancers (Basel) 2023 15 5 1491 https://doi.org/10.3390/cancers15051491 36900282 10.3390/cancers15051491 PMC10000725 70 Pothuraju R Chaudhary S Rachagani S Kaur S Roy HK Bouvet M Mucins, gut microbiota, and postbiotics role in colorectal cancer Gut Microbes 2021 13 1 1974795 https://doi.org/10.1080/19490976.2021.1974795 34586012 10.1080/19490976.2021.1974795 PMC8489937 71 Tiwari A Trivedi R Lin S-Y Tumor microenvironment: barrier or opportunity towards effective cancer therapy J Biomed Sci 2022 29 1 83 https://doi.org/10.1186/s12929-022-00866-3 36253762 10.1186/s12929-022-00866-3 PMC9575280 72 De Visser KE Joyce JA The evolving tumor microenvironment: from cancer initiation to metastatic outgrowth Cancer Cell Int 2023 41 3 374 403 https://doi.org/10.1016/j.ccell.2023.02.016 10.1016/j.ccell.2023.02.016 36917948 73 Folkman J. Role of angiogenesis in tumor growth and metastasis. Amsterdam: Elsevier; 2002. p. 15–8. https://doi.org/10.1053/sonc.2002.37263 10.1053/sonc.2002.37263 12516034 74 Plikus MV Wang X Sinha S Forte E Thompson SM Herzog EL Fibroblasts: origins, definitions, and functions in health and disease Cell Div 2021 184 15 3852 72 https://doi.org/10.1016/j.cell.2021.06.024 10.1016/j.cell.2021.06.024 PMC8566693 34297930 ",
  "metadata": {
    "Title of this paper": "Fibroblasts: origins, definitions, and functions in health and disease",
    "Journal it was published in:": "Biomolecules and Biomedicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12461268/"
  }
}