{
  "title": "Paper_669",
  "abstract": "pmc Foods Foods 3129 foods foods Foods 2304-8158 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469440 PMC12469440.1 12469440 12469440 41008230 10.3390/foods14183258 foods-14-03258 1 Article Anti-Inflammatory and Antioxidant Effects of Crude Polysaccharides from Dendrobium denneanum Wu Zenglin Conceptualization Methodology Software Formal analysis 1 † Tang Xuzhong Conceptualization Validation 1 † Wu Lijuan Validation 1 Xie Lei Validation 1 Yu Qing Investigation 1 Zhao Xinyi Formal analysis 1 Tian Yixue Data curation 1 Liu Zhiming Visualization 1 Mi Yadong Resources 2 Zhong Weiping Resources 2 Li Rui Project administration Writing – original draft 1 3 * Tian Mengliang Supervision Project administration 1 * 1 2 3 * 71352@sicau.edu.cn secondat@sicau.edu.cn † These authors contributed equally to this work. 19 9 2025 9 2025 14 18 497635 3258 21 8 2025 01 9 2025 09 9 2025 19 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Dendrobium denneanum Dendrobium denneanum D. denneanum 50 −1 −1 2 Dendrobium denneanum gastric ulcer crude polysaccharides antioxidation anti-inflammation Tian Mengliang Expert Workstation of Yunnan Province—Yunnan Provincial Science and Technology Talent and Platform Program 202505AF350023 the National Modern Agricultural Industrial Technology System, Sichuan Innovation Team Project, Genuine Traditional Chinese Medicine Innovation Team SCCXTD-2025-19 the Bazhong Science and Technology Program 1. This research was funded by Tian Mengliang Expert Workstation of Yunnan Province—Yunnan Provincial Science and Technology Talent and Platform Program, Grant number 202505AF350023; 2. This research was funded by the National Modern Agricultural Industrial Technology System, Sichuan Innovation Team Project, Genuine Traditional Chinese Medicine Innovation Team, grant number SCCXTD-2025-19; 3. This research was funded by the Bazhong Science and Technology Program, grant number. Selection and Technological Integration of Medicinal and Edible Species for Under-Forest. “Grain Bank” Systems. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Dendrobium 1 Dendrobium nobile Dendrobium chrysotoxum Dendrobium fimbriatum Dendrobium denneanum Dendrobium Dendrobium 2 D. denneanum The stems of D. denneanum 3 4 5 Dendrobium 6 7 8 9 10 Acute gastric ulcer is characterized by acute mucosal defects, bleeding, and inflammatory cell infiltration [ 5 11 2 12 Given the significant gastroprotective activity of Dendrobium D. denneanum D. denneanum D. denneanum 2. Materials and Methods 2.1. Materials and Chemicals The material used in this experiment was the dried stems of 3-year-old Dendrobium denneanum Table 1 Samples were first cleaned to remove dust, and the outer sheathing leaves were peeled off by rubbing. Subsequently, the samples were blanched in an oven at 105 °C for 1 h, then dried to a constant weight at 65 °C for later use. All animal studies and procedures were conducted in accordance with the guidelines and regulations approved by the Ethics Committee of Sichuan Agricultural University (Confirmation number: DYXY141642024), the Regulations on the Management of Laboratory Animals Guide for the Care and Use of Laboratory Animals During the experiment, the rat rearing room was well-ventilated; the temperature was maintained at approximately 30 °C by air conditioning, and the humidity was controlled within the normal range of 45–55%. A 12 h light/12 h dark circadian cycle was adopted daily. All rats were reared under uniform conditions, with free movement in cages and ad libitum access to food and water. Before the formal experiment, the rats were acclimatized to the environment for 7 days. 2.2. Preparation of Crude Polysaccharides from Dendrobium denneanum Kerr (Different Habitats) D. denneanum 2.3. Determination of Substance Contents in Crude Polysaccharides from Dendrobium denneanum (Different Habitats) 2.3.1. Total Sugar Content Precisely weigh 50 mg of glucose standard, place it in a 50 mL volumetric flask, dissolve it with pure water, and dilute to the marked volume. After shaking well, a 1 mg/mL glucose standard solution (reference solution) was obtained. Precisely measure 0.1, 0.2, 0.4, 0.6, 0.8, and 1.0 mL of this reference solution, and place them in clean glass reaction tubes, respectively. Add 200 μL of 5% phenol solution to each tube, mix well, then quickly add 1.0 mL of concentrated sulfuric acid, shake thoroughly, and react at room temperature for 30 min. Meanwhile, 200 μL of pure water was used instead of the standard solution as a blank control. The absorbance of each tube was measured at 490 nm using a microplate reader. A standard curve was plotted with glucose concentration as the abscissa and absorbance value as the ordinate. Weigh 20 mg of crude polysaccharide powder from D. denneanum 13 2.3.2. Total Phenol Content Weigh 1.7 mg of gallic acid, dissolve it with pure water, and dilute to 25 mL to obtain a gallic acid standard stock solution. The Folin–Ciocalteu reagent was diluted 10-fold, and a saturated sodium carbonate solution was prepared for later use. Take 10 10 mL test tubes, numbered 1–10, and precisely measure 0, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, and 0.9 mL of the gallic acid standard stock solution, respectively. Add 1, 0.9, 0.8, 0.7, 0.6, 0.5, 0.4, 0.3, 0.2, and 0.1 mL of pure water correspondingly to make the total volume of each tube 1 mL. Add 1 mL of 10-fold diluted Folin–Ciocalteu reagent (strictly protected from light during operation) and 2 mL of saturated sodium carbonate solution to each tube, mix well, place at room temperature for 2 min, then incubate in the dark for 1 h. Pipette 200 μL of the reaction solution into a 96-well microplate according to the concentration gradient, and measure the absorbance at 750 nm to plot the standard curve. Crude polysaccharide samples from 22 habitats were dissolved in pure water to prepare 10 mg/mL sample solutions. Subsequent operations such as reagent addition, dark reaction, and absorbance measurement were identical to those for standard curve preparation. The total phenol content of each sample was calculated based on the standard curve [ 14 2.3.3. Crude Polysaccharide Yield Calculated via Equation (1) Crude polysaccharide yield (%) = (Mass of lyophilized crude polysaccharides/Mass of test sample) × 100% (1) 2.4. In Vitro Antioxidant Activity Determination of Crude Polysaccharides from Dendrobium denneanum (Different Habitats) 2.4.1. Hydroxyl Radical Scavenging Activity Assay Prepare the 22 crude polysaccharide samples into concentration gradients of 0–3 mg/mL. For each sample, first add 50 µL of 6 mM FeSO 4 2 2 15 Scavenging rate (%) = [1 − (A 0 1 0 (2) Here, A 0 1 2.4.2. ABTS Radical Scavenging Activity Assay Prepare the 22 crude polysaccharide samples into concentration gradients of 0–3 mg/mL. Determine the scavenging rate following the protocol provided with the ABTS assay kit (Catalog No. BC4770, Solarbio Life Sciences Co., Ltd., Beijing, China). 2.4.3. DPPH Radical Scavenging Activity Assay Set the 22 crude polysaccharide samples into concentration gradients of 0–3 mg/mL. Take 200 μL of each sample and mix with 400 μL of 0.04% DPPH-ethanol solution. Incubate the mixture at 37 °C in the dark for 30 min, then measure the absorbance at 516 nm. Vc was used as the positive control, and the 0 mg/mL sample served as the blank. The scavenging rate was calculated using Equation (3) [ 16 [(A 0 1 0 (3) 2.5. Primary Structure Analysis of Crude Polysaccharides from Dendrobium denneanum (Selected Habitats) 2.5.1. Screening of Crude Polysaccharide Samples The in vitro antioxidant activities (DPPH, ABTS, and hydroxyl radical scavenging capacities) of Dendrobium denneanum 50 Dendrobium denneanum Dendrobium denneanum Dendrobium denneanum 2.5.2. Molecular Weight Determination of Crude Polysaccharides Dextran standards and crude polysaccharide samples were dissolved in 0.2 mol/L sodium nitrate (NaNO 3 3 2.5.3. Monosaccharide Composition Determination of Crude Polysaccharides Weigh 5 mg of each crude polysaccharide sample, add 2 mL of 3 mol/L trifluoroacetic acid (TFA), and hydrolyze at 120 °C for 3 h. After hydrolysis, the mixture was dried by nitrogen blowing, redissolved with 5 mL of distilled water, diluted at a ratio of 1:20, centrifuged at 12,000 rpm for 5 min, and 25 μL of the supernatant was taken for injection. A Dionex Carbopac PA20 chromatographic column (Thermo Fisher Scientific, Waltham, MA, USA) was used, with three solutions as mobile phases: Phase A (distilled water), Phase B (15 mM sodium hydroxide), and Phase C (15 mM sodium hydroxide + 100 mM sodium acetate); the flow rate was 0.3 mL/min with gradient elution, and the column temperature was 30 °C. A pulsed amperometric detector (PAD, Thermo Fisher Scientific, Waltham, MA, USA) was used for detection. 2.5.4. FT-IR Spectral Analysis of Crude Polysaccharides Under an incandescent lamp, potassium bromide (KBr) and each crude polysaccharide sample were separately ground into fine powders in a dry mortar. After mixing and tableting, the baseline and sample infrared spectra were scanned in the wavelength range of 3500–500 cm −1 2.6. Therapeutic Effect of Crude Polysaccharides from Dendrobium denneanum (Different Habitats) on Rats with Acute Gastric Ulcer 2.6.1. Grouping of Experimental Animals and Establishment of Gastric Ulcer Model Fifty-four male Sprague-Dawley (SD) rats were selected, with 6 rats in each group. The rats were randomly divided into 9 groups: blank group, model group, positive drug prevention group (PRE), DDP5 low-dose group (100 mg/kg/d, DDP5L), DDP5 high-dose group (400 mg/kg/d, DDP5H), DDP9 low-dose group (100 mg/kg/d, DDP9L), DDP9 high-dose group (400 mg/kg/d, DDP9H), DDP14 low-dose group (100 mg/kg/d, DDP14L), and DDP14 high-dose group (400 mg/kg/d, DDP14H). All rats were labeled, and their body weights were recorded. They were housed in separate cages for feeding. Gavage administration was conducted every morning, with a dosage of 2 mL per rat. The blank group received the same volume of normal saline via gavage, and the gavage was continued for 14 consecutive days. During the administration period, the rats had free access to food and water, and the environmental temperature was controlled between 25 and 30 °C. On the 14th day of gavage, the rats were fasted but allowed to drink water. On the 15th day, the rats were gavaged with 95% anhydrous ethanol; 1 h later, blood was collected from the orbital venous plexus, and the rats were sacrificed by cervical dislocation. The blank group was not gavaged with 95% anhydrous ethanol. One hour after intragastric administration, the gastric cavity was opened by incising along the greater curvature of the stomach. The gastric contents were rinsed thoroughly with normal saline, and the stomach was then flattened on filter paper for observation. Cases with no damage were excluded: if the gastric mucosa of rats in the model group appeared smooth without defects or hyperemia, it indicated that the ethanol-induced gastric ulcer model failed. As shown in Figure 1 2.6.2. Blood Collection and Sample Processing One hour after gavage with 95% anhydrous ethanol, orbital blood collection was performed immediately, followed by rat sacrifice via cervical dislocation. The blood samples were allowed to stand at 4 °C for 30 min, then centrifuged at 3500 r/min for 20 min. The serum was collected and stored in a −80 °C refrigerator for subsequent determination of relevant serum indices. 2.6.3. Gastric Tissue Sample Processing The gastric tissue was completely isolated, first carefully incised along the greater curvature of the stomach, and gently rinsed with normal saline to thoroughly remove residual food and other contents in the stomach. After rinsing, the gastric tissue was divided into two parts for processing: an appropriate amount of gastric tissue was quickly rinsed with pre-cooled normal saline to remove possible residual blood and other impurities, gently blotted dry with filter paper to remove surface moisture, and immediately placed in a mortar pre-cooled with liquid nitrogen. An appropriate amount of liquid nitrogen was poured into the mortar to completely submerge the tissue; during the continuous volatilization of liquid nitrogen, the tissue was ground quickly and vigorously with a pestle, and liquid nitrogen was added appropriately during the process until the tissue was ground into a uniform powder. The ground tissue powder was quickly transferred to a sterile centrifuge tube, precisely weighed, aliquoted according to experimental needs, and immediately stored in a −80 °C refrigerator for subsequent experiments. A properly sized gastric tissue block (approximately 1 cm × 1 cm) was cut and placed in 4% paraformaldehyde solution for fixation. The volume of the fixative should be more than 10 times the volume of the tissue block to ensure fixation effect. Fixation was carried out at room temperature for 24–48 h to fully fix the tissue. After fixation, the tissue block was transferred to 70% ethanol solution for storage, which could prevent over-fixation of the tissue while maintaining the tissue morphology, facilitating subsequent pathological section preparation and histopathological observation. 2.6.4. Ulcer Index Analysis Image-Pro Plus 6.0 software was used, with “pixel area” as the unified standard unit. The tissue pixel area corresponding to the ulcer area in each gastric tissue anatomical image was measured separately to calculate the ulcer area percentage and ulcer inhibition rate using Equations (4) and (5). Ulcer area percentage (%) = (Ulcer pixel area/Tissue pixel area) × 100 (4) Ulcer pixel area of experimental group/Average ulcer pixel area of model group × 100 (5) 2.6.5. Gastric Tissue Pathological Analysis After fixation in 4% paraformaldehyde, the gastric tissues were rinsed with running water for 24 h, dehydrated in a gradient of ethanol, cleared with xylene, and embedded in paraffin. The paraffin blocks were pre-cooled at −20 °C, then sectioned into 4 μm slices. The slices were spread at 40 °C and baked at 37 °C for 12 h. Subsequently, the sections were subjected to hematoxylin-eosin (HE) staining and mounted with neutral balsam. Indices such as inflammation were scored under a microscope [ 17 Table 2 2.6.6. Effects on Oxidative Stress and Inflammatory Indices in Serum and Gastric Tissue Blood samples were collected into serum separation tubes and centrifuged at 3000 rpm for 10 min at 4 °C to prepare serum. Gastric tissues were homogenized in pre-cooled PBS, lysed on ice for 1 h, and then centrifuged at 13,000 rpm for 20 min at 4 °C to obtain the supernatant. The protein concentration in the supernatant was analyzed by the BCA method. Commercial kits were used to determine the levels of TNF-α (Cat. No. SEKR0009, Solarbio), IL-6 (Cat. No. SEKR0005, Solarbio), SOD (Cat. No. BC0175, Solarbio), GSH-Px (Shanghai Yuanye Bio-Technology Co., Ltd., Shanghai, China, Cat. No. R21876 2.6.7. SEM Analysis Fresh gastric tissue was cut into 1 mm 3 2.7. Statistical Analysis Statistical analysis of the results was performed using SPSS software (Version 23.0, SPSS Inc., Chicago, IL, USA), and data were expressed as mean ± standard deviation. Duncan’s multiple range test was used to assess differences between means, with statistical significance set at p 3. Results 3.1. Subsection 3.1.1. Results of Substance Content Determination in Crude Polysaccharides from Dendrobium denneanum As presented in Table 3 D. denneanum p The total phenol contents of crude polysaccharides from all 22 habitats were approximately 3%, which were much lower than the total sugar contents. This phenomenon might be attributed to the use of anhydrous ethanol for impurity removal during the extraction process, as most phenolic compounds were eliminated by the organic solvent. Regarding the yield of crude polysaccharides, 82% of the samples showed yields ranging from 0.3% to 0.7%. Among them, Sample No. 7 had the highest yield (1.76%), whereas Sample No. 15 had the lowest (0.29%). 3.1.2. In Vitro Antioxidant Activity Assay of Crude Polysaccharides from Dendrobium denneanum As shown in Table 4 50 p 50 For DPPH radical scavenging activity, the IC 50 p p In terms of hydroxyl radical scavenging activity, the IC 50 D. denneanum 50 p p 3.1.3. Molecular Weight of Crude Polysaccharides from Dendrobium denneanum The elution curve revealed that the crude polysaccharides exhibited a single symmetric peak within a specific molecular weight range. Specifically, the weight-average molecular weight (Mw) of D. denneanum Figure 2 Table 5 The Mw values of crude polysaccharides from Habitat No. 5 and No. 9 were similar, while that from Habitat No. 14 was lower. 3.1.4. Monosaccharide Composition of Crude Polysaccharides from Dendrobium denneanum The results are shown in Table 6 DDP14 did not contain fucose (Fuc), and its molar ratio was 12.25:0.13:0.32:0.15:0.44:84.73:0.96:0.42:0.62. 3.1.5. FT-IR Spectral Structure of Crude Polysaccharides from Dendrobium denneanum As illustrated in Figure 3 −1 −1 An absorption peak related to C-H stretching vibration was detected in the range of 3000–2800 cm −1 −1 −1 −1 −1 Additionally, a weak absorption peak near 670 cm −1 3.1.6. Gastric Mucosal Macroscopic Observation and Ulcer Index Analysis As shown in Figure 4 Following the administration of D. denneanum D. denneanum As presented in Table 7 D. denneanum 3.1.7. Histopathological Analysis of Acute Gastric Ulcer Treated with Dendrobium denneanum As depicted in Figure 5 Based on the results of gastric tissue morphological analysis in each group mentioned above, and evaluated in accordance with the criteria outlined in Table 2 Table 8 3.1.8. Scanning Electron Microscopy (SEM) Analysis of Gastric Pits As shown in Figure 6 3.1.9. Effects of Dendrobium denneanum As presented in Table 9 As shown in Table 10 Dendrobium denneanum 4. Discussion This study systematically analyzed the content, structural characteristics, in vitro antioxidant activity, and gastric mucosal protective effect of Dendrobium denneanum This study found that the total sugar content (20–51.49%) and yield (0.29–1.76%) of DDP from 22 habitats varied significantly, which may be closely related to local cultivation methods and environmental conditions [ 18 P. purpureum 19 Sinopodophyllum hexandrum 20 Schizonepeta tenuifolia 6 21 22 The biological activity of polysaccharides is determined by their structural characteristics. In this study, the structural data obtained via gel permeation chromatography (GPC), high-performance liquid chromatography (HPLC), and Fourier transform infrared spectroscopy (FT-IR) directly correspond to the in vitro antioxidant activity and gastric mucosal protective activity, clarifying the core mechanism of the “structure-function” relationship of DDP. GPC results showed that the weight-average molecular weight (Mw) of DDP from 3 representative habitats was all less than 20 kDa. Among them, DDP5 (10.326 kDa) and DDP9 (10.991 kDa) were concentrated in the range of 10–11 kDa, while DDP14 (5.05 kDa) was a low-molecular-weight component. This is consistent with the research conclusion that low-molecular-weight polysaccharides have activity advantages: for instance, a comparison between two Tremella fuciformis 23 Taraxacum mongolicum Taraxacum mongolicum 2 2 24 −1 HPLC analysis revealed that DDP from the 3 habitats was mainly composed of glucose (Glc, 49.67–84.73%), mannose (Man, 8.29–12.25%), and galactose (Gal, 0.96–16.41%), but differences in their molar ratios directly affected activity. DDP5 had the highest Gal content (16.41%), with a Man:Glc:Gal molar ratio of 10.39:49.67:16.41. The characteristic peak of β-glycosidic bonds at 890 cm −1 50 Limosilactobacillus fermentum 25 The Man content of DDP9 (18.29%) was significantly higher than that of other samples. It is speculated that DDP9 may bind to immunoglobulin-like receptors (e.g., CD206) via the C-2 hydroxyl groups of Man residues [ 26 27 −1 FT-IR analysis showed that the strong absorption peak of DDP at 3420 cm −1 −1 −1 −1 Sargassum carpophyllum 28 Based on experimental data, the protective effect of DDP against ethanol-induced acute gastric ulcers can be summarized as a “triple synergistic mechanism,” which is directly associated with structural characteristics: Antioxidant damage: Low-molecular-weight DDP (e.g., DDP14) can penetrate cell membranes, significantly increasing the activities of SOD (2.3 ± 0.2 U/mg prot) and CAT (1.8 ± 0.1 U/mg prot) in gastric tissue, while decreasing MDA content (1.5 ± 0.1 nmol/mg prot). This is consistent with its structural characteristic of sufficient hydroxyl group exposure. Anti-inflammatory regulation: DDP9 with high Man content can more effectively reduce the levels of TNF-α (23.5 ± 2.1 pg/mL) and IL-6 (35.2 ± 2.8 pg/mL), while increasing PGE 2 In addition, this study found that the approximately 3% total phenols in DDP may have a synergistic effect with polysaccharides: the phenolic hydroxyl groups of phenolic substances can form hydrogen bonds with the hydroxyl groups of polysaccharides, further enhancing free radical scavenging ability [ 29 30 This study speculates that signaling pathways such as Nrf2/ARE and NF-κB may be involved in the protective effect of DDP, but direct experimental evidence is currently lacking. This is only a reasonable hypothesis based on existing results, not a definitive conclusion. In the future, it will be necessary to detect the expression levels of Nrf2, HO-1 (Nrf2 downstream target protein), and p65 (NF-κB subunit) via Western blot to verify whether these pathways are involved. Based on the above limitations, future research can be carried out in three directions: Directional screening of high-quality raw materials: Combine environmental data (e.g., light, soil nutrients) of different habitats with DDP activity, use multiple regression analysis to identify key environmental factors, and establish a “habitat-structure-activity” prediction model to guide the standardized cultivation of high-quality DDP raw materials. Elucidation of specific mechanisms of action: Use Western blot and RT-PCR to detect the expression of Nrf2/ARE pathway-related genes (e.g., SOD1, CAT) and tight junction proteins (occludin, ZO-1), so as to clarify the molecular targets of DDP in regulating the gastric mucosal barrier. Advancement of preclinical translational research: Conduct in vivo pharmacokinetic studies of DDP (e.g., determination of half-life and bioavailability), and evaluate its safety through long-term administration experiments (e.g., 3-month gavage), so as to provide complete data support for the development of functional foods or candidate drugs. In conclusion, this study is the first to clarify the structure-activity relationship of DDP from different habitats, confirming that DDP protects gastric mucosa through a “antioxidant-anti-inflammatory-mucosal repair” synergistic effect. Moreover, DDP with low molecular weight and high Gal/Man ratio exhibits better activity, which provides a core basis for the precise development of DDP. 5. Conclusions This study compared the active component contents and in vitro/in vivo antioxidant activities of crude polysaccharides from Dendrobium denneanum D. denneanum D. denneanum Acknowledgments We thank Wuhan Servicebio Technology Co., Ltd. for their expert assistance with histopathological sectioning and analysis, and Chengdu Lai Lai Biotechnology Co., Ltd. for their technical support in scanning electron microscopy. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, Z.W. and X.T.; methodology, Z.W.; software, Z.W.; validation, X.T., L.W. and L.X.; formal analysis, Z.W. and X.Z.; investigation, Q.Y.; resources, Y.M. and W.Z.; data curation, Y.T.; writing—original draft preparation, Z.W.; writing—review and editing, R.L.; visualization, Z.L.; supervision, M.T.; project administration, R.L.; funding acquisition, M.T. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement All animal studies and procedures were conducted in accordance with the guidelines and regulations approved by the Ethics Committee of Sichuan Agricultural University (Confirmation number: DYXY141642024). Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in the study are included in the article, further inquiries can be directed to the corresponding authors. Conflicts of Interest The authors declare no conflicts of interest. References 1. da Silva J.A.T. Hossain M.M. Sharma M. Dobránszki J. Cardoso J.C. Zeng S.J. Acclimatization of in Vitro-Derived Dendrobium Hortic. Plant J. 2017 3 110 124 10.1016/j.hpj.2017.07.009 2. Wu J.N. Research on Resource Collection, Evaluation and Cultivation Adaptability of Dendrobium Plants Master’s Thesis Hainan University Haikou, China 2023 (In Chinese) 3. Wang H. He S.Y. Fan Y.J. Li T. Xu L. Ma J. Wu J. Liu H. Liu X. Mou C. Light intensity is a crucial factor that regulates growth, physiological traits, antioxidant defense, and metabolite acquisition in Dendrobium denneanum Physiol. Mol. Biol. Plants 2025 31 895 911 10.1007/s12298-025-01627-w 40756444 PMC12314299 4. Fan Y. Tan X. Zhao J. Yang K. Wu S. Zhang J. Pu S. Wang G. Luo A. Screening and characterization of an acid polysaccharide with antioxidant activity in vitro and in vivo from Dendrobium aurantiacum var. denneanum (Kerr) Pharmacogn. Mag. 2022 18 44 51 10.4103/pm.pm_580_20 5. Park J.-H. Jang K.-J. Kim C.-H. Lee Y.-H. Lee S.-J. Kim B.-H. Yoon H.-M. Ganoderma lucidum Pharmacopuncture for the Treatment of Acute Gastric Ulcers in Rats J. Pharmacopunct. 2014 17 40 49 10.3831/KPI.2014.17.025 PMC4332011 25780708 6. Fan Y. Ma J. Wang G. Li X. Liu Y. Xu E. Luo A. Ultrasonic extraction, structural modification and Gastric mucosal cells protective activity of a polysaccharide from Dendrobium denneanum Arab. J. Chem. 2023 16 105033 10.1016/j.arabjc.2023.105033 7. Fan Y. Yang K. Miao R. Wang G. Chun Z. Wu S. Pu S. Luo A. Transcriptome analysis reveals the effects of red and blue light on the physiological and medicinal components of Dendrobium denneanum Ind. Crops Prod. 2022 180 114798 10.1016/j.indcrop.2022.114798 8. Wang Q. Liang J. Stephen Brennan C. Ma L. Li Y. Lin X. Liu H. Wu J. Anti-inflammatory effect of alkaloids extracted from Dendrobium aphyllum on macrophage RAW 264.7 cells through NO production and reduced IL-1, IL-6, TNF-α and PGE2 expression Int. J. Food Sci. Technol. 2020 55 1255 1264 10.1111/ijfs.14404 9. Zeng Q. Ko C.-H. Siu W.-S. Li L.-F. Han X.-Q. Yang L. Lau C.B.-S. Hu J.-M. Leung P.-C. Polysaccharides of Dendrobium officinale Kimura & Migo protect gastric mucosal cell against oxidative damage-induced apoptosis in vitro and in vivo J. Ethnopharmacol. 2017 208 214 224 10.1016/j.jep.2017.07.006 28684298 10. Zhang Y.X. Li X. Wang Y. Chen J. Liu Z. Zhao Y. Sun H. Wu Q. Zhou L. Huang M. Protective Effect of Dendrobium officinale Polysaccharide on Small Intestinal Epithelial Barrier Mod. Food Sci. Technol. 2025 41 28 35 11. Ye B. Zhou P.-Y. Jia M. Cheng X.-S. Jia Y.-T. Xu S.-G. Absence of NF-κB subunit p50 ameliorates cold immobilization stress-induced gastric ulcers Biochem. Biophys. Res. Commun. 2013 434 547 551 10.1016/j.bbrc.2013.03.112 23583384 12. Ding L.T. Pan S.J. Hu J.L. Zhong Y.D. Zhao M.J. Wu T. Fang F. Huang Z. Nie S. Yao M. Protective Effect of Oat Polysaccharides against Acute Gastric Mucosal Injury in Mice Shipin Kexue/Food Sci. 2022 43 150 157 13. Soleimanian-Zad S. Soroushmanesh F. Mustafa M.H. Kiani A. Effects of different washing and precipitating solutions on sugar content, cytotoxicity, chemical structure and prebiotic potential of pistachio hull polysaccharide Bioresour. Technol. Rep. 2024 27 101921 10.1016/j.biteb.2024.101921 14. Dehghan H. Rafati A. Tavakolipour H. Mokhtarian M. Ultrasound-assisted extraction of polysaccharides from faba bean ( Vicia faba J. Food Meas. Charact. 2024 18 1889 1899 10.1007/s11694-023-02282-z 15. Wang X. Du R. Liu Y. Wang L. Wang L. Investigation of the repairing effects and mechanisms of Polygonatum Odoratum polysaccharides on myofibrillar protein gelation under hydroxyl radical-induced oxidative stress Food Chem. X 2025 28 102573 10.1016/j.fochx.2025.102573 40520706 PMC12166840 16. Yang R. Guo Y. Mao Y. Zhang W. Wang F. Zhu Z. Isolation of a novel polysaccharide from Tribonema minus and preparation of polysaccharide–selenium nanoparticles with enhanced antioxidant activity Algal Res. 2025 88 104020 10.1016/j.algal.2025.104020 17. Toyoshima O. Nishizawa T. Yoshida S. Sakaguchi Y. Nakai Y. Watanabe H. Suzuki H. Tanikawa C. Matsuda K. Koike K. Endoscopy-based Kyoto classification score of gastritis related to pathological topography of neutrophil activity World J. Gastroenterol. 2020 26 5146 5155 10.3748/wjg.v26.i34.5146 32982115 PMC7495031 18. Li P. Shen T. Li L. Wang Y. Optimization of the selection of suitable harvesting periods for medicinal plants: Taking Dendrobium officinale as an example Plant Methods 2024 20 43 10.1186/s13007-024-01172-9 38493140 PMC10943765 19. Lu X.D. Nan F.R. Feng J. Lv J.P. Liu Q. Liu X.D. Xie S.L.A. Effects of Different Environmental Factors on the Growth and Bioactive Substance Accumulation of Porphyridium purpureum Int. J. Environ. Res. Public Health 2020 17 2221 10.3390/ijerph17072221 32224974 PMC7177824 20. Wang X. Li Z. Zhang Y. Chen J. Liu H. Zhao Q. Sun M. Wu D. Hu S. Yang L. Influence of Ecological Factors on the Production of Active Substances in the Anti-Cancer Plant Sinopodophyllum hexandrum PLoS ONE 2021 16 e0122981 10.1371/journal.pone.0122981 PMC4398539 25874701 21. Liu J. Chen Y. Huang Z. Wang H. Jin H. Zhang Y. Li X. Zhao Q. Sun M. Wu D. N 6 Schizonepeta tenuifolia Plant Biotechnol. J. 2025 23 113001 10.1111/pbi.70226 PMC12392929 40567049 22. Su J.M. Wang Y.Y. Bai M. Li J.H. Zhao Q.Y. Chen H.L. Liu X.P. Sun P.W. Guo J.H. Zhang Y.L. Soil Conditions and the Plant Microbiome Boost the Accumulation of Monoterpenes in the Fruit of Citrus reticulata Microbiome 2023 11 61 10.1186/s40168-023-01504-2 36973820 PMC10044787 23. Lee Q.C. Xue Z.X. Luo Y.J. Wang H.Y. Chen L.M. Zhang Y.F. Li X.J. Zhao Q.H. Sun M.L. Wu D.G. Low molecular weight polysaccharide of Tremella fuciformis Int. J. Biol. Macromol. 2024 281 136097 10.1016/j.ijbiomac.2024.136097 39353518 24. Ni S. Zhao H.L. Yang S.H. Li M.Y. Wang Q. Chen J.L. Liu X.Y. Sun P.W. Guo J.H. Zhang Y.L. The Effect of Ultrasonic-Assisted Enzyme Extraction on Antioxidant Polysaccharide Activity in Dandelion Ultrason. Sonochem. 2025 116 107329 10.1016/j.ultsonch.2025.107329 40158263 PMC11994387 25. Wei Y.L. Li F. Li Q.H. Zhang H.Y. Chen J.W. Liu X.M. Wang Q.F. Sun X.L. Guo J.Y. Liu S.Q. Structural characterization, antioxidant activities and physicochemical properties analysis of a galactose-rich exopolysaccharide produced by Limosilactobacillus fermentum LWT 2024 211 116893 10.1016/j.lwt.2024.116893 26. Liao J.H. Huang J.Y. Chi X.Y. Zhang L.N. Wang Y.H. Chen J.W. Liu X.M. Sun X.L. Guo J.Y. Liu S.Q. D-Mannose-Modified Nanoliposomes Enhance the Targeted Delivery of Ovalbumin to Improve Its Anti-Inflammatory, Antioxidant, and Macrophage Polarization Effects J. Funct. Foods 2025 124 106653 10.1016/j.jff.2024.106653 27. Lin Q.Z. Wang Y. Li J. Zhang H. Chen L. Liu X. Sun M. Wu D. Hu S. Yang L. Characterization and Antioxidant Activity of Short Linear Glucan-Lysine Nanoparticles Prepared by Maillard Reaction Food Hydrocol. 2019 92 86 93 10.1016/j.foodhyd.2019.01.054 28. Li Z.H. Zhang Z.Y. Feng Y.Q. Wang L.J. Chen H.M. Zhao X.Y. Liu J.F. Sun P.H. Guo Y.L. Huang Z.W. Insight into the anti-inflammatory sulfated polysaccharides from Sargassum carpophyllum Algal Res. 2025 85 103841 10.1016/j.algal.2024.103841 29. Xue B. Wang M.L. Wang Z.Y. Li J.F. Zhao Y.N. Chen H.L. Liu X.Q. Sun P.W. Guo J.H. Zhang Y.L. Analysis of Synergism between Extracellular Polysaccharide from Bacillus thuringiensis kurstaki Toxins 2023 15 590 10.3390/toxins15100590 37888621 PMC10610938 30. Božović M. Petrović D. Caković D. Jovanović S. Marković L. Stojanović G. Nikolić V. Popović M. Đorđević S. Krstić M. Phenolic Content and Antioxidant Potential of Wine Extracts Nat. Prod. Commun. 2025 20 1934578X251327227 10.1177/1934578X251327227 Figure 1 Flow Diagram for Acute Gastric Ulcer Rat Experiment. Figure 2 Molecular weights of DDP5 ( A B C Figure 3 Fourier-transform infrared spectroscopic structure of crude polysaccharides from Dendrobium denneanum Figure 4 Macroscopic Observation of Gastric Mucosa(( A B C D E F G H I Figure 5 Histopathological Analysis ( A B C D E F G H I → → → → → Figure 6 Scanning Electron Microscopic Analysis of Gastric Pits (( A B C D E F G H I foods-14-03258-t001_Table 1 Table 1 Sample origin. No. Longitude (°E) Latitude (°N) Elevation (m) Origin 1 98.324 27.221 1331.7 Mengzhong Village, Xieluo Township, Shimian County, Ya’an City, Sichuan, China 2 103.336 29.667 1300.5 Xinlin Group 4, Qiliping Town, Taoyuan County, Meishan City, Sichuan, China 3 103.765 29.552 721.1 Chuanxi Community, Huatou Town, Jiajiang County, Leshan City, Sichuan, China 4 102.468 29.242 1200.3 Xinle Village, Xieluo Township, Shimian County, Ya’an City, Sichuan, China 5 114.654 29.242 1300.9 Hualin Group 4, Qiliping Town, Taoyuan County, Meishan City, Sichuan, China 6 103.355 29.242 621.2 Liuxi Village, Maliu Township, Jiajiang County, Leshan City, Sichuan, China 7 103.574 29.242 548.4 Zhengjie Village, Huatou Town, Jiajiang County, Leshan City, Sichuan, China 8 102.476 29.242 1311.7 Dalin Village, Yonghe Township, Shimian County, Ya’an City, Sichuan, China 9 103.281 29.242 810.6 Tongsheng Community, Zhongbao Town, Hongya County, Meishan City, Sichuan, China 11 102.283 29.242 900.2 Lashu Village, Fengle Township, Shimian County, Ya’an City, Sichuan, China 12 103.574 29.242 632.8 Qianfeng Village, Maliu Township, Jiajiang County, Leshan City, Sichuan, China 13 103.285 29.242 800.8 Qiaokou Village, Dongyue Town, Hongya County, Meishan City, Sichuan, China 14 103.571 29.242 700.3 Lianhe Xincun Group 4, Xiema Township, Jiajiang County, Leshan City, Sichuan, China 15 102.22 29.242 920.1 Jiefang Village, Anshun Town, Shimian County, Ya’an City, Sichuan, China 16 100.322 29.242 1320 Dawan Village Group 3, Xieluo Township, Shimian County, Ya’an City, Sichuan, China 17 103.571 29.242 621.4 Fuxing Village, Xiema Township, Jiajiang County, Leshan City, Sichuan, China 18 102.468 29.242 1353.2 Gaoqiao Village, Fengle Township, Shimian County, Ya’an City, Sichuan, China 19 106.053 29.242 645.6 Yuanmen Village, Maliu Township, Jiajiang County, Leshan City, Sichuan, China 20 106.231 29.242 722.9 Yongxin Group 7, Huatou Town, Jiajiang County, Leshan City, Sichuan, China 21 102.345 29.242 1010.2 Jinping Village, Anshun Town, Shimian County, Ya’an City, Sichuan, China 22 103.21 29.242 800.6 Zhonghe Village, Gaomiao Town, Hongya County, Meishan City, Sichuan, China foods-14-03258-t002_Table 2 Table 2 Scoring criteria for gastric histological injury. Score Mucosal Edema Hemorrhage Inflammatory-Cell Infiltration Epithelial-Cell Loss 0 No lesion No lesion No infiltration No ulcer 1 Mild edema Congestion Superficial mucosal infiltration A few small ulcers 2 Mucosal edema Petechial hemorrhage Marked mucosal infiltration Large ulcers 3 Mucosal and submucosal micro-edema Micro-hemorrhagic foci Mucosal and submucosal micro-infiltration Ulcers throughout the stomach 4 Severe mucosal and submucosal edema Extensive hemorrhage Severe mucosal and submucosal infiltration Perforation of the stomach foods-14-03258-t003_Table 3 Table 3 Determination of Crude Polysaccharide Content in Dendrobium denneanum No. Total Sugar (%) Total Phenolics (%) Crude Polysaccharide Yield (%) 1 27.38 ± 2.73 c 3.11 ± 0.24 ab 0.58 ± 0.04 c 2 22.12 ± 0.75 c 2.64 ± 0.09 d 0.69 ± 0.07 bc 3 27.63 ± 2.42 c 2.89 ± 0.07 c 0.39 ± 0.05 e 4 27.97 ± 2.08 c 2.86 ± 0.11 c 0.43 ± 0.02 d 5 26.59 ± 0.66 c 3.58 ± 0.25 a 0.31 ± 0.04 e 6 29.26 ± 2.67 bc 3.04 ± 0.10 b 0.70 ± 0.05 b 7 30.16 ± 1.90 bc 3.21 ± 0.08 ab 1.76 ± 0.08 a 8 29.01 ± 3.49 c 3.23 ± 0.02 a 0.47 ± 0.10 d 9 20.23 ± 0.09 d 2.68 ± 0.07 d 0.37 ± 0.08 e 10 51.49 ± 2.94 a 2.74 ± 0.05 c 0.93 ± 0.03 b 11 25.50 ± 0.59 cd 3.05 ± 0.10 b 0.49 ± 0.09 d 12 38.66 ± 2.67 b 3.12 ± 0.06 ab 0.35 ± 0.09 e 13 44.25 ± 1.80 a 3.49 ± 0.30 a 0.45 ± 0.03 d 14 29.62 ± 2.84 bc 3.06 ± 0.09 b 0.41 ± 0.04 d 15 27.53 ± 3.56 cd 3.01 ± 0.20 bc 0.29 ± 0.07 e 16 33.18 ± 2.15 bc 2.87 ± 0.03 c 1.04 ± 0.07 b 17 33.73 ± 1.74 bc 3.03 ± 0.03 b 0.42 ± 0.03 d 18 23.91 ± 1.00 cd 3.22 ± 0.12 ab 0.84 ± 0.03 b 19 31.54 ± 2.86 bc 3.01 ± 0.17 bc 0.37 ± 0.02 e 20 24.79 ± 2.84 cd 3.10 ± 0.15 b 0.33 ± 0.01 e 21 23.97 ± 0.80 cd 2.73 ± 0.09 d 0.54 ± 0.06 c 22 26.33 ± 1.19 cd 3.37 ± 0.36 a 0.66 ± 0.02 bc Different letters in each column indicate significant differences at p n foods-14-03258-t004_Table 4 Table 4 Determination of in vitro antioxidant capacity of crude polysaccharides from Dendrobium denneanum No. ABTS Radical Scavenging IC 50 DPPH Radical Scavenging IC 50 Hydroxyl Radical Scavenging IC 50 1 1.18 ± 0.17 c 1.37 ± 0.09 bc 1.44 ± 0.13 b 2 1.38 ± 0.13 b 1.67 ± 0.08 b 1.69 ± 0.16 b 3 1.09 ± 0.11 c 1.23 ± 0.08 c 1.39 ± 0.08 b 4 1.62 ± 0.16 a 2.13 ± 0.19 a 2.20 ± 0.07 a 5 0.61 ± 0.18 d 0.99 ± 0.04 d 1.02 ± 0.18 c 6 1.01 ± 0.07 c 1.21 ± 0.08 c 1.35 ± 0.13 b 7 0.62 ± 0.11 d 1.01 ± 0.06 d 1.04 ± 0.08 c 8 1.22 ± 0.13 bc 1.52 ± 0.13 b 1.48 ± 0.09 b 9 1.52 ± 0.12 a 2.11 ± 0.16 a 2.18 ± 0.09 a 10 1.41 ± 0.13 b 1.75 ± 0.17 b 1.71 ± 0.12 b 11 0.99 ± 0.02 c 1.21 ± 0.03 c 1.34 ± 0.09 b 12 0.97 ± 0.05 c 1.08 ± 0.12 d 1.09 ± 0.08 c 13 1.18 ± 0.08 c 1.27 ± 0.09 c 1.43 ± 0.08 b 14 1.56 ± 0.15 a 2.08 ± 0.11 a 2.04 ± 0.13 a 15 0.96 ± 0.08 c 1.03 ± 0.05 d 1.09 ± 0.07 c 16 1.42 ± 0.15 b 2.08 ± 0.11 a 2.08 ± 0.08 a 17 1.36 ± 0.12 b 1.62 ± 0.13 b 1.68 ± 0.19 b 18 1.35 ± 0.07 b 1.59 ± 0.08 b 1.51 ± 0.16 b 19 0.98 ± 0.14 c 1.11 ± 0.09 d 1.22 ± 0.09 bc 20 0.93 ± 0.09 c 1.02 ± 0.12 d 1.04 ± 0.12 c 21 1.33 ± 0.07 b 1.56 ± 0.08 b 1.51 ± 0.08 b 22 1.02 ± 0.05 c 1.22 ± 0.08 c 1.35 ± 0.18 b Different letters in each column indicate significant differences at p n foods-14-03258-t005_Table 5 Table 5 Molecular weight of crude polysaccharides from Dendrobium denneanum Sample MP Mw Mn Polydispersity DDP1 7368 10,326 6407 1.611733 DDP12 7488 10,991 6842 1.606471 DDP22 2716 5054 3699 1.366575 foods-14-03258-t006_Table 6 Table 6 Monosaccharide composition of crude polysaccharides from Dendrobium denneanum Monosaccharide DDP5 DDP9 DDP14 mol % RT (min) mol % RT (min) mol % RT (min) Man 10.39 12.63 18.29 12.55 12.25 12.58 Rib 2.1 16.42 1.88 16.31 0.13 16.37 Rha 3.9 17.16 3.09 17.05 0.32 17.11 GlcA 3 20.58 1.15 20.4 0.15 20.44 GalA 1.1 21.9 0.58 21.86 0.44 21.5 Glc 49.67 26.93 53.62 26.72 84.73 26.65 Gal 16.41 30.85 11.26 30.62 0.96 30.76 Xyl 3.22 32.57 2.72 32.34 0.42 32.46 Ara 9.1 33.76 6.54 33.51 0.62 33.67 Fuc 1 38.86 0.89 38.56 0 0 foods-14-03258-t007_Table 7 Table 7 Ulcer index analysis. Group Ulcer Area Percentage (%) Ulcer Area Inhibition Rate (%) Control 0 ± 0 d 100 ± 0 a Model 19.89 ± 1.32 a 0 ± 0 c PRE 2.31 ± 0.18 c 93.16 ± 2.33 a DDP5L 14.87 ± 1.47 b 48.47 ± 1.48 c DDP5H 6.12 ± 1.02 c 81.62 ± 1.56 a DDP9L 13.92 ± 2.27 b 46.91 ± 1.28 c DDP9H 4.86 ± 0.89 c 82.47 ± 2.44 a DDP14L 12.15 ± 1.77 b 48.72 ± 1.72 c DDP14H 2.12 ± 0.15 c 69.26 ± 1.09 b Different letters in each column indicate significant differences at p n foods-14-03258-t008_Table 8 Table 8 Scoring criteria for gastric histological injury. Group Mucosal Edema Hemorrhage Inflammatory-Cell Infiltration Epithelial-Cell Loss Control 0 0 0 0 Model 4 3 3 2 OME 0 2 3 1 DDP5L 0 2 3 1 DDP5H 0 2 2 0 DDP9L 0 2 3 1 DDP9H 0 2 2 0 DDP14L 0 2 3 1 DDP14H 0 2 2 0 foods-14-03258-t009_Table 9 Table 9 Effects of crude polysaccharides from Dendrobium denneanum Group Stomach Serum CAT (U/mL) SOD (U/mL) MDA (nmol/mL) GSH-PX (U/mL) NO (μmol/g prot) CAT (U/mL) SOD (U/mL) MDA (nmol/mL) GSH-PX (U/mL) NO (μmol/g prot) Control 36.82 ± 7.14 b 343.41 ± 27.51 a 0.69 ± 0.09 c 106.48 ± 10.00 a 0.075 ± 0.005 b 443.63 ± 6.82 a 14.50 ± 1.90 b 1.34 ± 0.49 d 28.72 ± 0.50 a 0.352 ± 0.050 b Model 15.28 ± 1.59 d 126.74 ± 26.53 d 1.63 ± 0.21 a 49.02 ± 14.65 c 0.039 ± 0.009 c 105.89 ± 16.19 e 11.14 ± 1.70 c 11.07 ± 1.09 a 5.70 ± 1.51 d 0.207 ± 0.099 d PRE 44.46 ± 2.88 a 328.92 ± 32.07 a 0.79 ± 0.16 b 116.75 ± 8.83 a 0.082 ± 0.009 a 357.31 ± 36.06 b 12.13 ± 1.56 c 1.76 ± 0.44 d 20.72 ± 0.50 b 0.363 ± 0.089 b DDP5L 34.50 ± 3.54 bc 278.56 ± 31.18 b 1.12 ± 0.04 b 84.73 ± 5.11 b 0.042 ± 0.013 c 189.33 ± 52.16 d 13.64 ± 1.01 b 1.90 ± 0.49 d 7.22 ± 1.00 c 0.252 ± 0.038 c DDP5H 42.59 ± 2.35 a 370.48 ± 6.97 a 0.83 ± 0.06 b 118.11 ± 8.15 a 0.112 ± 0.016 a 266.78 ± 22.82 c 15.80 ± 1.75 a 1.18 ± 0.51 d 8.39 ± 0.81 c 0.336 ± 0.064 b DDP9L 33.04 ± 1.56 c 248.14 ± 13.86 c 1.07 ± 0.16 b 76.86 ± 4.57 b 0.045 ± 0.005 c 233.41 ± 8.81 c 14.60 ± 1.19 b 5.07 ± 0.79 b 10.22 ± 1.00 c 0.327 ± 0.056 b DDP9H 41.99 ± 2.85 a 321.96 ± 17.50 a 0.79 ± 0.12 b 116.53 ± 9.02 a 0.098 ± 0.014 a 265.68 ± 12.81 c 15.67 ± 1.36 a 2.57 ± 1.25 c 16.22 ± 1.00 b 0.451 ± 0.044 a DDP14L 29.08 ± 6.02 c 272.18 ± 28.05 b 1.51 ± 0.27 a 88.45 ± 4.78 b 0.048 ± 0.009 c 102.95 ± 6.79 e 14.41 ± 1.77 b 3.95 ± 1.37 b 8.32 ± 0.47 c 0.179 ± 0.041 d DDP14H 36.53 ± 5.35 b 307.51 ± 23.32 b 1.23 ± 0.30 ab 105.17 ± 10.89 a 0.058 ± 0.007 c 296.79 ± 50.98 bc 15.83 ± 0.76 a 1.43 ± 0.25 d 18.72 ± 0.50 b 0.311 ± 0.094 b Different letters in each column indicate significant differences at p n foods-14-03258-t010_Table 10 Table 10 Effects of crude polysaccharides from Dendrobium denneanum on inflammation-related indicators in serum and gastric tissue. Group Stomach Serum IL-6 (pg/mL) TNF-α (pg/mL) PGE 2 IL-6 (pg/mL) TNF-α (pg/mL) Control 83.63 ± 3.03 c 22.95 ± 0.52 d 75.90 ± 8.80 b 42.95 ± 0.52 c 16.29 ± 5.31 d Model 142.85 ± 8.56 a 114.41 ± 13.16 a 38.06 ± 2.37 e 71.08 ± 2.15 a 57.74 ± 10.02 a OME 88.43 ± 3.44 c 51.06 ± 1.33 bc 85.09 ± 4.02 a 47.72 ± 4.39 b 24.39 ± 2.62 c DQP5L 113.76 ± 9.91 b 76.37 ± 10.11 b 73.15 ± 3.10 b 53.04 ± 2.38 b 33.04 ± 2.38 b DQP5H 86.20 ± 6.69 c 34.92 ± 0.64 c 36.12 ± 2.29 e 44.92 ± 0.25 c 24.92 ± 0.25 c DQP9L 101.96 ± 6.89 b 80.12 ± 1.66 b 44.21 ± 5.76 d 53.45 ± 4.27 b 33.45 ± 2.27 b DQP9H 85.26 ± 10.61 d 43.51 ± 2.89 c 41.70 ± 10.39 d 43.51 ± 3.20 c 23.51 ± 3.20 c DQP14L 104.10 ± 8.01 b 79.32 ± 9.54 b 73.63 ± 6.63 b 59.32 ± 1.49 b 35.98 ± 2.66 b DQP14H 84.64 ± 8.60 c 48.93 ± 2.66 c 40.32 ± 10.39 d 42.27 ± 2.90 c 22.27 ± 2.90 c Different letters in each column indicate significant differences at p n ",
  "metadata": {
    "Title of this paper": "Phenolic Content and Antioxidant Potential of Wine Extracts",
    "Journal it was published in:": "Foods",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469440/"
  }
}