{
  "title": "Paper_644",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470299 PMC12470299.1 12470299 12470299 41009741 10.3390/ijms26189181 ijms-26-09181 1 Article Lactobacillus fermentum You Xiaoyan Methodology Investigation Writing – original draft Writing – review & editing 1 Shi Pengcheng Data curation Writing – original draft Writing – review & editing 1 Liu Wenjing Formal analysis Data curation 2 https://orcid.org/0009-0001-7240-2039 Zheng Mengyi Validation 2 Jin Lixia Conceptualization Writing – review & editing Supervision 2 * https://orcid.org/0000-0002-3343-4652 Liu Wei Conceptualization Writing – review & editing Supervision Funding acquisition 3 * Mattner Jochen Academic Editor 1 xiaoyanyou@haust.edu.cn 15290945612@163.com 2 15170246889@163.com mengyizheng02@zcmu.edu.cn 3 * windyjinlx@zcmu.edu.cn liuw@zaas.ac.cn 19 9 2025 9 2025 26 18 497349 9181 15 8 2025 15 9 2025 17 9 2025 19 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Ulcerative colitis (UC) is a chronic inflammatory disorder difficult to cure with current treatments. Therefore, preventive interventions for UC are crucial. This research investigated the intervention potential of Lactobacillus (L. fermentum L. fermentum L. fermentum Akkermansia Ligilactobacillus Turicibacter Prevotella L. fermentum L. fermentum Lactobacillus fermentum colitis intestinal microbiota metabolomics Zhejiang Province Public Welfare Projects LGN22C030008 Science and Technology Tackling Project of Henan Province 242102310434 Zhejiang Province Public Welfare Projects funded this work (No. LGN22C030008). Science and Technology Tackling Project of Henan Province (No. 242102310434). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Ulcerative colitis (UC) is a chronic, recurrent inflammatory bowel disease (IBD) distinguished by persistent mucosal inflammation that typically begins in the rectum and can progress proximally to involve part or all of the colon [ 1 2 3 4 At the beginning of the 20th century, IBD was almost exclusively observed in Europe. However, IBD incidence in Asian populations has gradually increased over the past five decades, with a rapid increase in newly industrialized countries. Consequently, IBD has developed into a global disease [ 5 6 Currently, the primary treatments for IBD are surgery and medication. However, surgical treatment frequently results in a high postoperative mortality rate [ 7 8 Probiotics are live microorganisms that, when provided in sufficient quantities, have an advantageous impact on the host [ 9 8 9 10 11 Lactobacillus 12 Lactobacillus johnsonii 13 Lactobacillus plantarum 14 Lactobacillus rhamnosus 15 Probiotics are strain-specific, and their mechanisms are still being studied [ 16 Lactobacillus L fermentum 17 18 19 20 L. fermentum L. fermentum L. fermentum L. fermentum L. fermentum 2. Results 2.1. L. fermentum S1 Intervention Improved UC Symptoms To examine the interventional impacts of L. fermentum L. fermentum On the 7th day, compared to the control (Con) group, the DSS group mice depicted a significantly reduced body weight and a significantly elevated DAI value ( Figure 1 Figure 1 L. fermentum 2.2. L. fermentum S1 Intervention Attenuated Colonic Tissue Damage To assess the mitigating effect of L. fermentum Figure 2 2.3. L. fermentum S1 Intervention Enhances Gut Barrier Integrity To examine the protective impact of L. fermentum Figure 3 L. fermentum Figure 3 L. fermentum 2.4. L. fermentum S1 Intervention Attenuates Immune Factors To understand the immunomodulatory impacts of L. fermentum L. fermentum Figure 4 Figure 4 2.5. L. fermentum S1 Intervention Restores SCFAs To examine the influence of L. fermentum L. fermentum Figure 5 Figure 5 2.6. L. fermentum S1 Intervention Ameliorates Gut Dysbiosis To examine the influence of L. fermentum L. fermentum Figure 6 L. fermentum Figure 6 Subsequently, our investigation into the composition of the GM in each group was expanded to include analyses at both the phylum and genus levels. At the phylum level, Bacteroidota Firmicutes Figure 6 Bacteroidota Firmicutes Bacteroidota Firmicutes L. fermentum Bacteroidota Firmicutes Figure 6 Unclassified_Muribaculaceae Bacteroides Ileibacterium Parabacteroides Figure 6 Turicibacter Akkermansia Ligilactobacillus Prevotella_9 Parabacteroides Acinetobacter Figure 6 2.7. L. fermentum S1 Intervention Alters Metabolites To investigate the metabolic alterations in the colon of mice with UC and determine the impact of L. fermentum Principal component analysis (PCA) illustrated significantly separated metabolites between groups in the Con, DSS, and LF groups ( Figure 7 p Figure 7 L. fermentum Figure 7 We compared the metabolites that changed in the DSS group with those that changed in the Con group and those that changed in the LF group with those that changed in the DSS group and identified 18 co-varying metabolites ( Figure 7 Figure 7 L. fermentum Supplementary Table S1 To explore the potential metabolic pathways of L. fermentum L. fermentum Figure 7 2.8. Relationship Between GM and Metabolomics We performed a correlation analysis to determine whether there is a correlation between GM and metabolomics. The results indicated that Marvinbryantia Unclassified_Bacilli Turicibacter Figure 7 Turicibacter 3. Discussion Probiotics, especially lactic acid bacteria, have attracted considerable scholarly interest due to their potential role in modulating GM and augmenting immune function. Evidence suggests that probiotics can affect host health through various mechanisms, such as inhibiting pathogenic organisms, enhancing barrier functions, regulating immune responses, and facilitating neurotransmitter production [ 21 22 L. fermentum UC develops through a complex process involving IB defects, dysregulated immune responses, and GM imbalances, all of which are vital in starting and sustaining inflammation [ 4 23 24 25 26 27 28 29 L. fermentum L. fermentum Moreover, inflammation is the primary symptom in UC, and the immune response dysregulation is the key pathogenic mechanism. Research has suggested that the dysregulation of the production and inhibition of pro-inflammatory cytokines is closely related to the IBD pathogenesis [ 30 31 32 33 34 L. fermentum L. fermentum SCFAs are major metabolites of the GM, including acids like formic, acetic, propionic, butyric, isobutyric, isovaleric, and valeric, which have a vital function in gut health [ 35 36 37 38 39 L. fermentum Investigations have indicated a link between UC and an imbalance in GM [ 40 41 42 L. fermentum L. fermentum Bacteroidota Firmicutes 43 Firmicutes Bacteroidetes 44 Bacteroidota Firmicutes L. fermentum Bacteroidota Firmicutes L fermentum Parabacteroides Acinetobacter Parabacteroides Parabacteroides 45 Acinetobacter 46 47 Akkermansia Ligilactobacillus Turicibacter, Unclassified_Vicinamibacterales Lactobacilli 48 Lactobacillus 49 50 Akkermansia muciniphila 51 52 Akkermansia muciniphila 53 Turicibacter Turicibacter 54 L. fermentum Unclassified_Vicinamibacterales L. fermentum Metabolites generated by the GM are pivotal in organismal signaling and regulating the immune system, serving as essential mediators of communication between the host and the gut microbiome. Metabolomics analyses exhibited significant variations in metabolite composition between groups, with gavage L. fermentum L. fermentum 55 Furthermore, correlation analysis illustrated correlations between certain differential metabolites and differential flora, with statistically significant results. Turicibacter Turicibacter 56 Marvinbryantia Marvinbryantia 57 L. fermentum L. fermentum 4. Materials and Methods 4.1. Preparing L. fermentum S1 Suspensions L. fermentum L. fermentum 9 4.2. Animal Experiment Design Male C57BL/6J mice (six weeks old, n Figure 1 58 L. fermentum 9 4.3. Sample Collection Following seven days of treatment, isoflurane inhalation was used to euthanize the mice, followed by cervical dislocation. The collection of blood samples was conducted through eyeball extraction. Fresh blood was collected in tubes without any anticoagulant and spun (4000 rpm, 15 min) to separate the serum, which was then kept at −80 °C until additional analysis. The mice were then euthanized, and feces, colon tissue, colon contents, and the contents of the cecum were gathered for further analysis. Fecal samples were analyzed individually for sequencing. 4.4. DAI Scoring Daily evaluations were made during the trial to demonstrate the existence of stool characteristics, body weight, and occult blood in feces, which were used to calculate DAI [ 59 4.5. Histopathological Analysis For histopathological analysis, distal colon tissue was excised, followed by fixing in 4% paraformaldehyde, embedding in paraffin, and slicing into 5 µm slices. H&E was utilized to stain the slices for general histological assessment, and inflammation and crypt injury were assessed using a previously established scoring system [ 13 4.6. IHC Analysis IHC staining was carried out to analyze the ZO-1, occludin, and MUC2 expression. In brief, colon tissue slices (5 µm) were dewaxed via xylene, rehydrated with ethanol of varying concentrations. Subsequently, the slides were exposed to 3% hydrogen peroxide, and goat serum was utilized to block them at 37 °C for 1 h. The incubation of slides was then conducted with primary antibodies at a dilution of 1:400 at 4 °C. The slides were subsequently incubated in PBS with a biotinylated secondary antibody for an hour at room temperature. Streptavidin-horseradish peroxidase (HRP) was conjugated to the secondary antibody prior to treatment with diaminobenzidine. Lastly, the slides were counterstained with hematoxylin. Microscopic examination of the images was conducted using a Nikon Eclipse C1 microscope (Nikon, Japan), and ImageJ software (Version 1.54) analyzed the intensity, focusing on relative protein expression and average optical density. Hematoxylin gives the nucleus a blue hue, whereas diaminobenzidine’s positive expression is brown-yellow. 4.7. Cytokine Assay An enzyme-linked immunosorbent assay (ELISA) kit was employed to assess the cytokine levels, including IL-1β/6/10 and TNF-α (all from Lunchangshuo Biotech, Xiamen, China) in mouse serum samples, following the manufacturer’s guidelines. 4.8. SCFAs Detection The concentration of SCFAs was quantified using gas chromatography (GC) with a DB-FFAP column (0.32 mm × 30 m × 0.5 µm) and a hydrogen flame ionization detector, using crotonic acid as the internal standard. GC operational conditions were as follows: the inlet temperature was 250 °C, with an injection volume of 1 µL. N 2 2 Sample pretreatment process: The contents of the cecum were diluted 10-fold with PBS, shaken (2 min), spun (12,000 rpm, 2 min), and then 500 µL of supernatant and 100 µL of internal standard solution were mixed thoroughly and acidified in a refrigerator (−30 °C, 24 h). The supernatant was aspirated and filtered through a 0.22 µm aqueous filtration membrane. After thawing, the sample aspiration was conducted with a disposable syringe and filtered through a 0.22 µm aqueous filtration membrane. Then, it was positioned in a centrifuge tube of 1.5 mL, and 150 µL of the filtered solution was added to a rubber-legged cannula of a gas phase sample bottle, which was subsequently capped tightly to exclude bubbles before sampling. 4.9. GM Analysis Total DNA extraction from mouse fecal samples was conducted via the TGuide S96 Magnetic Soil/Stool DNA Kit (Beijing Tiangen Biotech Co., Ltd., Beijing, China) as per the manufacturer’s protocol. The amplification of the V3–V4 hypervariable region of the bacterial 16S rRNA gene was conducted with primers 338F (5′-ACTCCTACGGGAGGCAGCA-3′) and 806R (5′-GGACTACHVGGGTWTCTAAT-3′). The verification of PCR products was conducted on agarose gel, followed by purification using the Omega DNA purification kit (Norcross, GA, USA), and sequencing via paired-end sequencing (2 × 250 bp) on the Illumina NovaSeq 6000 platform. Additionally, constructing and sequencing the 16S amplicon libraries were conducted on the Illumina HiSeq 2500 platform at Biomarker Technologies Co., Ltd. (Beijing, China). Sequence processing, taxonomic assignment, and alpha/beta diversity analyses were conducted using QIIME2 (version 2022.8), with taxonomic classification based on the SILVA database (version 138). Differential abundance was assessed using LEfSe with an LDA score threshold > 4.0 [ 60 4.10. Metabolomics Analysis Extraction of colon contents (50 mg) was conducted with 1000 µL of solution (methanol/acetonitrile/water = 2:2:1, internal standard 20 mg/L), followed by vortexing (30 s), grounding (45 Hz, 10 min), sonicating (ice bath, 10 min), and incubating (−20 °C, 1 h). Samples were spun (12,000 rpm, 15 min, 4 °C), and the collection of 500 µL of supernatant was conducted. A vacuum concentrator was utilized to dry the extract, followed by re-dissolving in 160 µL of acetonitrile/water (1:1), vortexing (30 s), and sonication (10 min, ice bath). After centrifugation (12,000 rpm, 15 min, 4 °C), 120 µL of supernatant was placed in an injection vial of 2 mL. In the end, a quality control sample was created by combining 10 µL of each sample. A Thermo Scientific Ulti3000 HPLC tandem and a Thermo Scientific Orbitrap Exploris 480 high-resolution mass spectrometer (Thermo Fisher Scientific, Waltham, MA, USA) made up the liquid-mass spectrometry system for metabolomics analysis. The Waters Acquity UPLC HSS T3 column (1.8 µm, 2.1 × 100 mm) was utilized with a scanning range of 67–1000 m/z. Electrospray ionization source settings were positive ion 3.5 kV, sweep gas flow 1 arb, negative ion 2.5 kV, sheath gas flow rate: 50 arb, ion transfer tube temp: 325 °C, aux gas flow rate: 10 arb, and vaporizer temp 350 °C. 4.11. Statistical Analysis All samples underwent triplicate analysis, and data are reported as mean ± standard deviation or standard error of mean. Normality was assessed with the Shapiro–Wilk test. When comparing two separate groups of mice data, a two-tailed unpaired t-test was employed for normally distributed data, and the Mann–Whitney rank sum test was used for data that was not normally distributed. In instances where the data were normally distributed but exhibited unequal variances among groups, the Welch correction was applied. For analyses involving more than two independent groups, one-way ANOVA were applied for comparisons. After confirming significant variations by one-way ANOVA, Tukey’s honestly significant difference (HSD) test was utilized to conduct post hoc comparisons between groups, which adjusts p p 5. Conclusions L. fermentum L. fermentum Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26189181/s1 Author Contributions Writing—Original Draft: X.Y. and P.S.; Conceptualization: L.J. and W.L. (Wei Liu); Writing—Review & Editing: P.S., L.J. and W.L. (Wei Liu); Validation: X.Y., P.S. and M.Z.; Methodology: X.Y. and P.S.; Investigation: X.Y.; Data Curation: P.S. and W.L. (Wenjing Liu); Formal Analysis: P.S. and W.L. (Wenjing Liu); Supervision: L.J. and W.L. (Wei Liu); Funding Acquisition: W.L. (Wei Liu). All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The Animal Research Ethics Committee at Zhejiang Academy of Agricultural Sciences gave its approval to all animal trials (application number: 2022ZAASLA54, 20 July 2022). Informed Consent Statement Not Applicable. Data Availability Statement All 16S rRNA gene sequencing data were submitted to the NCBI with the accession number PRJNA1238789. Conflicts of Interest The authors declare no conflicts of interest. References 1. Ungaro R. Mehandru S. Allen P.B. Peyrin-Biroulet L. Colombel J.F. Ulcerative colitis Lancet 2017 389 1756 1770 10.1016/S0140-6736(16)32126-2 27914657 PMC6487890 2. De Boer A.G. Bennebroek Evertsz F. Stokkers P.C. Bockting C.L. Sanderman R. Hommes D.W. Sprangers M.A. Frings-Dresen M.H. Employment status, difficulties at work and quality of life in inflammatory bowel disease patients Eur. J. Gastroenterol. Hepatol. 2016 28 1130 1136 10.1097/MEG.0000000000000685 27340897 3. Gros B. Kaplan G.G. Ulcerative Colitis in Adults: A Review JAMA 2023 330 951 965 10.1001/jama.2023.15389 37698559 4. Le Berre C. Honap S. Peyrin-Biroulet L. Ulcerative colitis Lancet 2023 402 571 584 10.1016/S0140-6736(23)00966-2 37573077 5. Kaplan G.G. The global burden of IBD: From 2015 to 2025 Nat. Rev. Gastroenterol. Hepatol. 2015 12 720 727 10.1038/nrgastro.2015.150 26323879 6. Han S.W. McColl E. Barton J.R. James P. Steen I.N. Welfare M.R. Predictors of quality of life in ulcerative colitis: The importance of symptoms and illness representations Inflamm. Bowel Dis. 2005 11 24 34 10.1097/00054725-200501000-00004 15674110 7. Singh S. Al-Darmaki A. Frolkis A.D. Seow C.H. Leung Y. Novak K.L. Ghosh S. Eksteen B. Panaccione R. Kaplan G.G. Postoperative Mortality Among Patients with Inflammatory Bowel Diseases: A Systematic Review and Meta-analysis of Population-Based Studies Gastroenterology 2015 149 928 937 10.1053/j.gastro.2015.06.001 26055136 8. Panes J. Alfaro I. New treatment strategies for ulcerative colitis Expert Rev. Clin. Immunol. 2017 13 963 973 10.1080/1744666X.2017.1343668 28617055 9. Sanders M.E. Probiotics: Considerations for human health Nutr. Rev. 2003 61 91 99 10.1301/nr.2003.marr.91-99 12723641 PMC7167708 10. Huang C. Hao W. Wang X. Zhou R. Lin Q. Probiotics for the treatment of ulcerative colitis: A review of experimental research from 2018 to 2022 Front. Microbiol. 2023 14 1211271 10.3389/fmicb.2023.1211271 37485519 PMC10358780 11. Cano-Garrido O. Seras-Franzoso J. Garcia-Fruitos E. Lactic acid bacteria: Reviewing the potential of a promising delivery live vector for biomedical purposes Microb. Cell Factories 2015 14 137 10.1186/s12934-015-0313-6 26377321 PMC4573465 12. Abid S. Farid A. Abid R. Rehman M.U. Alsanie W.F. Alhomrani M. Alamri A.S. Asdaq S.M.B. Hefft D.I. Saqib S. Identification, Biochemical Characterization, and Safety Attributes of Locally Isolated Lactobacillus fermentum Bubalus bubalis Microorganisms 2022 10 954 10.3390/microorganisms10050954 35630398 PMC9144466 13. Jia D.J. Wang Q.W. Hu Y.Y. He J.M. Ge Q.W. Qi Y.D. Chen L.Y. Zhang Y. Fan L.N. Lin Y.F. Lactobacillus johnsonii Gut Microbes 2022 14 2145843 10.1080/19490976.2022.2145843 36398889 PMC9677986 14. Khan I. Wei J. Li A. Liu Z. Yang P. Jing Y. Chen X. Zhao T. Bai Y. Zha L. Lactobacillus plantarum Int. Microbiol. 2022 25 587 603 10.1007/s10123-022-00243-y 35414032 15. Nenu I. Baldea I. Coada C.A. Craciun R.C. Moldovan R. Tudor D. Petrushev B. Toma V.A. Stefanescu H. Procopet B. Lactobacillus rhamnosus Food Chem. Toxicol. 2024 183 114314 10.1016/j.fct.2023.114314 38052407 16. McFarland L.V. Evans C.T. Goldstein E.J.C. Strain-Specificity and Disease-Specificity of Probiotic Efficacy: A Systematic Review and Meta-Analysis Front. Med. 2018 5 124 10.3389/fmed.2018.00124 PMC5949321 29868585 17. Jang Y.J. Kim W.K. Han D.H. Lee K. Ko G. Lactobacillus fermentum species ameliorate dextran sulfate sodium-induced colitis by regulating the immune response and altering gut microbiota Gut Microbes 2019 10 696 711 10.1080/19490976.2019.1589281 30939976 PMC6866707 18. Cao L. Yang X.J. Li Z.J. Sun F.F. Wu X.H. Yao J.H. Reduced lesions in chickens with Clostridium perfringens-induced necrotic enteritis by Lactobacillus fermentum 1.20291 Poult. Sci. 2012 91 3065 3071 Erratum in Poult. Sci. 2013 92 10.3382/ps.2012-02548 23155014 19. Linninge C. Xu J. Bahl M.I. Ahrné S. Molin G. Lactobacillus fermentum and Lactobacillus plantarum Benef. Microbes 2019 10 413 424 10.3920/BM2018.0074 30957532 20. Zhang H. Wang H. Li Y. Leng Y. Lin K. Ren D. Uncovering the Beneficial Role of Limosilactobacillus fermentum Foods 2025 14 137 10.3390/foods14010137 39796427 PMC11719463 21. Bay V. Gillespie A. Ganda E. Evans N.J. Carter S.D. Lenzi L. Lucaci A. Haldenby S. Barden M. Griffiths B.E. The bovine foot skin microbiota is associated with host genotype and the development of infectious digital dermatitis lesions Microbiome 2023 11 4 10.1186/s40168-022-01440-7 36624507 PMC9830885 22. Chaucheyras-Durand F. Durand H. Probiotics in animal nutrition and health Benef. Microbes 2010 1 3 9 10.3920/BM2008.1002 21840795 23. Camilleri M. Madsen K. Spiller R. Greenwood-Van Meerveld B. Verne G.N. Intestinal barrier function in health and gastrointestinal disease Neurogastroenterol. Motil. 2012 24 503 512 10.1111/j.1365-2982.2012.01921.x 22583600 PMC5595063 24. Chen X. Li X. Sun-Waterhouse D. Zhu B. You L. Hileuskaya K. Polysaccharides from Sargassum fusiforme Food Funct. 2021 12 11747 11759 10.1039/D1FO02708E 34806724 25. Zhang F.Y. Li R.Z. Xu C. Fan X.X. Li J.X. Meng W.Y. Wang X.R. Liang T.L. Guan X.X. Pan H.D. Emodin induces apoptosis and suppresses non-small-cell lung cancer growth via downregulation of sPLA2-IIa Phytomedicine 2022 95 153786 10.1016/j.phymed.2021.153786 34785104 26. Salvo Romero E. Alonso Cotoner C. Pardo Camacho C. Casado Bedmar M. Vicario M. The intestinal barrier function and its involvement in digestive disease Rev. Esp. Enferm. Dig. 2015 107 686 696 10.17235/reed.2015.3846/2015 26541659 27. Wyatt J. Vogelsang H. Hubl W. Waldhoer T. Lochs H. Intestinal permeability and the prediction of relapse in Crohn’s disease Lancet 1993 341 1437 1439 10.1016/0140-6736(93)90882-H 8099141 28. Bergstrom K.S. Kissoon-Singh V. Gibson D.L. Ma C. Montero M. Sham H.P. Ryz N. Huang T. Velcich A. Finlay B.B. Muc2 protects against lethal infectious colitis by disassociating pathogenic and commensal bacteria from the colonic mucosa PLoS Pathog. 2010 6 e1000902 10.1371/journal.ppat.1000902 20485566 PMC2869315 29. Wei J. Chen C. Feng J. Zhou S. Feng X. Yang Z. Lu H. Tao H. Li L. Xv H. Muc2 mucin O-glycosylation interacts with enteropathogenic Escherichia coli J. Transl. Med. 2023 21 793 10.1186/s12967-023-04687-2 37940996 PMC10631195 30. Neurath M.F. Targeting cytokines in inflammatory bowel disease Sci. Transl. Med. 2022 14 eabq4473 10.1126/scitranslmed.abq4473 36516267 31. Aschenbrenner D. Quaranta M. Banerjee S. Ilott N. Jansen J. Steere B. Chen Y.H. Ho S. Cox K. Arancibia-Carcamo C.V. Deconvolution of monocyte responses in inflammatory bowel disease reveals an IL-1 cytokine network that regulates IL-23 in genetic and acquired IL-10 resistance Gut 2021 70 1023 1036 10.1136/gutjnl-2020-321731 33037057 PMC8108288 32. Guo Y. Wang B. Wang T. Gao L. Yang Z.J. Wang F.F. Shang H.W. Hua R. Xu J.D. Biological characteristics of IL-6 and related intestinal diseases Int. J. Biol. Sci. 2021 17 204 219 10.7150/ijbs.51362 33390844 PMC7757046 33. Keubler L.M. Buettner M. Hager C. Bleich A. A Multihit Model: Colitis Lessons from the Interleukin-10-deficient Mouse Inflamm. Bowel Dis. 2015 21 1967 1975 10.1097/MIB.0000000000000468 26164667 PMC4511684 34. Sands B.E. Kaplan G.G. The role of TNFalpha in ulcerative colitis J. Clin. Pharmacol. 2007 47 930 941 10.1177/0091270007301623 17567930 35. Koh A. De Vadder F. Kovatcheva-Datchary P. Backhed F. From Dietary Fiber to Host Physiology: Short-Chain Fatty Acids as Key Bacterial Metabolites Cell 2016 165 1332 1345 10.1016/j.cell.2016.05.041 27259147 36. Gaudier E. Rival M. Buisine M.P. Robineau I. Hoebler C. Butyrate enemas upregulate Muc genes expression but decrease adherent mucus thickness in mice colon Physiol. Res. 2009 58 111 119 10.33549/physiolres.931271 18198997 37. Goncalves P. Araujo J.R. Di Santo J.P. A Cross-Talk Between Microbiota-Derived Short-Chain Fatty Acids and the Host Mucosal Immune System Regulates Intestinal Homeostasis and Inflammatory Bowel Disease Inflamm. Bowel Dis. 2018 24 558 572 10.1093/ibd/izx029 29462379 38. Segain J.P. Raingeard de la Bletiere D. Bourreille A. Leray V. Gervois N. Rosales C. Ferrier L. Bonnet C. Blottiere H.M. Galmiche J.P. Butyrate inhibits inflammatory responses through NFkappaB inhibition: Implications for Crohn’s disease Gut 2000 47 397 403 10.1136/gut.47.3.397 10940278 PMC1728045 39. Xu D. Zhuang L. Gao S. Ma H. Cheng J. Liu J. Liu D. Fu S. Hu G. Orally Administered Ginkgolide C Attenuates DSS-Induced Colitis by Maintaining Gut Barrier Integrity, Inhibiting Inflammatory Responses, and Regulating Intestinal Flora J. Agric. Food Chem. 2022 70 14718 14731 10.1021/acs.jafc.2c06177 36375817 40. Ott S.J. Musfeldt M. Wenderoth D.F. Hampe J. Brant O. Folsch U.R. Timmis K.N. Schreiber S. Reduction in diversity of the colonic mucosa associated bacterial microflora in patients with active inflammatory bowel disease Gut 2004 53 685 693 10.1136/gut.2003.025403 15082587 PMC1774050 41. Sartor R.B. Wu G.D. Roles for Intestinal Bacteria, Viruses, and Fungi in Pathogenesis of Inflammatory Bowel Diseases and Therapeutic Approaches Gastroenterology 2017 152 327 339 e324 10.1053/j.gastro.2016.10.012 27769810 PMC5511756 42. Manichanh C. Rigottier-Gois L. Bonnaud E. Gloux K. Pelletier E. Frangeul L. Nalin R. Jarrin C. Chardon P. Marteau P. Reduced diversity of faecal microbiota in Crohn’s disease revealed by a metagenomic approach Gut 2006 55 205 211 10.1136/gut.2005.073817 16188921 PMC1856500 43. Beheshti-Maal A. Shahrokh S. Ansari S. Mirsamadi E.S. Yadegar A. Mirjalali H. Zali M.R. Gut mycobiome: The probable determinative role of fungi in IBD patients Mycoses 2021 64 468 476 10.1111/myc.13238 33421192 44. Fries W. Comunale S. Ulcerative colitis: Pathogenesis Curr. Drug Targets 2011 12 1373 1382 10.2174/138945011796818261 21466489 45. Walujkar S.A. Kumbhare S.V. Marathe N.P. Patangia D.V. Lawate P.S. Bharadwaj R.S. Shouche Y.S. Molecular profiling of mucosal tissue associated microbiota in patients manifesting acute exacerbations and remission stage of ulcerative colitis World J. Microbiol. Biotechnol. 2018 34 76 10.1007/s11274-018-2449-0 29796862 46. Glover J. Browning B. Ticer T. Dooley S. Digrazia J. Engevik A. Engevik M. Elucidating the role of Acinetobacter calcoaceticus Physiology 2023 38 5734284 10.1152/physiol.2023.38.S1.5734284 47. Glover J. Sullivan K. Browning B. Ticer T. Gutierrez A. Dooley S. Engevik A. Hartman J. Engevik M. Identifying the role of Acinetobacter calcoaceticus Inflamm. Bowel Dis. 2024 30 S63 10.1093/ibd/izae020.134 48. Qi H. Li Y. Yun H. Zhang T. Huang Y. Zhou J. Yan H. Wei J. Liu Y. Zhang Z. Lactobacillus maintains healthy gut mucosa by producing L-Ornithine Commun. Biol. 2019 2 171 10.1038/s42003-019-0424-4 31098404 PMC6506532 49. Eslami M. Yousefi B. Kokhaei P. Hemati M. Nejad Z.R. Arabkari V. Namdar A. Importance of probiotics in the prevention and treatment of colorectal cancer J. Cell. Physiol. 2019 234 17127 17143 10.1002/jcp.28473 30912128 50. Kim W.K. Han D.H. Jang Y.J. Park S. Jang S.J. Lee G. Han H.S. Ko G. Alleviation of DSS-induced colitis via Lactobacillus acidophilus Food Funct. 2021 12 340 350 10.1039/D0FO01724H 33325946 51. Zhang T. Li Q. Cheng L. Buch H. Zhang F. Akkermansia muciniphila Microb. Biotechnol. 2019 12 1109 1125 10.1111/1751-7915.13410 31006995 PMC6801136 52. Zhao Y. Yang H. Wu P. Yang S. Xue W. Xu B. Zhang S. Tang B. Xu D. Akkermansia muciniphila Virulence 2024 15 2375555 10.1080/21505594.2024.2375555 39192579 PMC11364076 53. Akhtar M. Chen Y. Ma Z. Zhang X. Shi D. Khan J.A. Liu H. Gut microbiota-derived short chain fatty acids are potential mediators in gut inflammation Anim. Nutr. 2022 8 350 360 10.1016/j.aninu.2021.11.005 35510031 PMC9040132 54. Liu X. Zhang Y. Li W. Zhang B. Yin J. Liuqi S. Wang J. Peng B. Wang S. Fucoidan Ameliorated Dextran Sulfate Sodium-Induced Ulcerative Colitis by Modulating Gut Microbiota and Bile Acid Metabolism J. Agric. Food Chem. 2022 70 14864 14876 10.1021/acs.jafc.2c06417 36378195 55. Ingawale D.K. Patel S.S. Hecogenin exhibits anti-arthritic activity in rats through suppression of pro-inflammatory cytokines in Complete Freund’s adjuvant-induced arthritis Immunopharmacol. Immunotoxicol. 2018 40 59 71 10.1080/08923973.2017.1405439 29192804 56. Huang Y. Zheng Y. Yang F. Feng Y. Xu K. Wu J. Qu S. Yu Z. Fan F. Huang L. Lycium barbarum Front. Cell. Infect. Microbiol. 2022 12 921075 Erratum in Front. Cell. Infect. Microbiol. 2022 17 10.3389/fcimb.2022.921075 36017369 PMC9395742 57. Chang H.Y. Tong X.Y. Yang H.Q. Peng Y. Sun Q.C. Chinese yam ( Dioscorea opposita Curr. Opin. Food Sci. 2024 55 101121 10.1016/j.cofs.2023.101121 58. Wei F. Lang Y. Shen Q. Xu L. Cheng N. Chu Y. Lyu H. Chen F. Osteopontin-loaded PLGA nanoparticles enhance the intestinal mucosal barrier and alleviate inflammation via the NF-kappaB signaling pathway Colloids Surf. B Biointerfaces 2020 190 110952 10.1016/j.colsurfb.2020.110952 32172161 59. Maslowski K.M. Mackay C.R. Diet, gut microbiota and immune responses Nat. Immunol. 2011 12 5 9 10.1038/ni0111-5 21169997 60. Guo F. Geng Y. Abbas W. Zhen W. Wang S. Huang Y. Guo Y. Ma Q. Wang Z. Vitamin D(3) Nutritional Status Affects Gut Health of Salmonella-Challenged Laying Hens Front. Nutr. 2022 9 888580 10.3389/fnut.2022.888580 35619956 PMC9127613 Figure 1 L. fermentum A B n C D n E F n p Figure 2 H&E staining of colon tissue slices from all groups. Top shows 10× magnified views, and scale bar is 200 µm. Bottom shows 30× magnified views, and scale bar is 100 µm. Figure 3 L. fermentum A B D n p Figure 4 L. fermentum A C D n p Figure 5 L. fermentum A B C D E F n p Figure 6 L. fermentum A B C D E F G p n Figure 7 Impacts of L. fermentum A B C D E F G p n ",
  "metadata": {
    "Title of this paper": "Vitamin D(3) Nutritional Status Affects Gut Health of Salmonella-Challenged Laying Hens",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470299/"
  }
}