{
  "title": "Paper_997",
  "abstract": "pmc BMC Womens Health BMC Womens Health 68 bmcwh BMC Women's Health 1472-6874 BMC PMC12481797 PMC12481797.1 12481797 12481797 41023971 10.1186/s12905-025-04001-w 4001 1 Research Interaction between toll-like receptor 4 polymorphism and abdominal obesity on ovarian cancer risk in Chinese women Zhu Jiamin 1 Yang Baixia 2 Zhai Xiaogang 2 Ni Feng 2 Tao Dan 1 Tan Cheng tanchengtc686@163.com 2 1 https://ror.org/02afcvw97 grid.260483.b 0000 0000 9530 8833 Department of Oncology, the Affiliated Jiangyin Hospital of Nantong University, 2 https://ror.org/01egmr022 grid.410730.1 0000 0004 1799 4363 Department of Radiotherapy, Nantong Tumor Hospital, Tumor Hospital Affiliated to Nantong University, 29 9 2025 2025 25 478356 452 28 3 2025 25 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Objectives the aim of this study was to evaluate the impact of TLR4 TLR4 Methods Generalized multifactor dimensionality reduction method were utilized to identify the most informative interactions between four SNPs in the TLR4 TLR4 Results The analysis of logistic regression indicated a markedly elevated risk of OC in individuals carrying either the rs4986790-G or rs11536889-C alleles in the TLR4 p p Conclusions The findings suggested that TLR4 Supplementary Information The online version contains supplementary material available at 10.1186/s12905-025-04001-w. Keywords Abdominal obesity Ovarian cancer Single nucleotide polymorphisms Toll-like receptors Interaction The Youth Project of Wuxi Municipal Health Commission Q202310 Zhu Jiamin pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Ovarian cancer (OC) is the third most common type of gynecological cancer but is the deadliest [ 1 2 3 4 5 7 8 9 Microglia express toll-like receptors (TLRs), which can detect harmful pathogens and trigger inflammatory responses. Specifically, the TLR4 10 TLR4 11 12 13 14 15 16 TLR4 17 18 19 TLR4 TLR4 Materials and methods Subjects From January 2019 to September 2022, all patients with OC were recruited from the Affiliated Jiangyin Hospital of Nantong University and Nantong Tumor Hospital. All patients were diagnosed and classified according to the guidelines of the International Federation of Gynecology and Obstetrics (FIGO) [ 20 21 2 2 1 1 2 Trained staff administered questionnaires to all participants to collect general demographic information, lifestyle information, and clinical gynecological data. They obtained this information through a survey questionnaire (supplementary file 1) and clinical data. Abdominal obesity was defined as a waist circumference (WC) ≥ 90 cm for men and ≥ 80 cm for women [ 22 Genomic DNA extraction and genotyping Four SNPs (rs4986791, rs4986790, rs11536889 and rs7873784) of TLR4 https://www.ncbi.nlm.nih.gov/snp/ PCR-based RFLP was utilized to determine the genotypes of four selected SNPs. The 25 µ L PCR reaction system includes: 50–100 ng DNA sample, forward and reverse primers 0.5 µ M, 200 µ M dNTPs, 1 U Taq enzyme, 1 x buffer, 1.5 mM MgCl 2 1  Table 1 Description and primers used for genotyping for 4 SNPs with in TLR4 gene ID Chromosome Functional Consequence Primers (5’→3’) Restriction endonucleases Thr399Ile 1196 C > T (rs4986791) 9:117713324 Coding sequence variant missense variant Forward: 5′-GGTTGCTGTTCTCAAAGTGATTTTGGGAGAA − 3′ Reverse: 5′-ACCTGAAGACTGGAGAGTGAGTTAAATGCT − 3′  HinfI 896 A > G Asp299Gly (rs4986790) 9:117713024 Coding sequence variant missense variant Forward: 5′-GATTAGCATACTTAGACTACTACCTCCATG − 3′ Reverse: 5′- GATCAACTTCTGAAAAAGCATTCCCAC − 3′  NcoI rs7873784 (C > G) 9:117716658 3′ UTR Forward: 5′- ACGTTGGATGGTATGCAAGATGAAT TAGCT − 3′ Reverse: 5′- ACGTTGGATGGAACACTTAACATGA GAGGT − 3′  XhoI rs11536889 + 7263G/C 9:117715853 3′ UTR Forward: 5′- ACAAGTGATGTTTGATGGAC − 3′ Reverse: 5′- GCCATTCTACCTGGTATAAG − 3′  EarI Statistical analysis In the current study, the SPSS 22.0 software package (SPSS Inc, Chicago) was used for all statistical analyses. For normally distributed continuous variables, the means and standard deviations (SDs) were calculated. For categorical variables, percentages were calculated. To compare the means and SDs between two groups, Student’s t test was used. To compare the percentages between two groups, χ 2 http://bioinfo.iconcologia.net/SNPstats 23 TLR4 TLR4 p Results This case-control study enrolled 930 participants, consisting of 310 °C patients and 620 normal controls. The mean age of all participants was 61.9 ± 11.8 years. Among them, the mean age of OC patients was 62.7 ± 11.2 years, while that of normal controls was 61.4 ± 10.8 years. Table 2  Table 2 General and clinical characteristics of study participants in OC patients and normal controls Variables OC patients n Normal controls n p Age (years) 62.7 ± 11.2 61.4 ± 10.8 0.088 Smoking, N (%) 8 (2.6) 12 (1.9) 0.522 WC (cm) 84.3 ± 13.6 80.2 ± 12.6 < 0.001 Tubal ligation, N (%) 10 (3.2) 44 (7.1) 0.017 Menopause status, N (%) < 0.001 Pre 98 (31.6) 276 (44.5) Post 212 (68.4) 344 (55.5) Number of pregnancies, N (%) 0.515 1 or 2 267 (86.1) 524 (84.5) More than 3 43 (13.9) 96 (15.5) Differentiation, N (%) Middle/high 90 (29.0) Low 220 (71.0) Means ± standard deviation for age and WC WC In this study, the genotype frequencies of four SNPs conformed to HWE, with all p TLR4 TLR4 3  Table 3 Logistic regression on association between TLR4 gene genotypes and OC risk SNPs Genotypes and alleles Frequencies, N OR (95%CI) * p OC patients ( n Normal Control ( n C1196T, Thr399Ile (rs4986791) Co-dominant CC 176 (56.8) 398 (64.2) 1.00 0.274 CT 114 (36.8) 192 (31.0) 1.31 (0.90–1.75) TT 40 (6.4) 30 (4.8) 1.42 (0.81–2.03) Dominant CC 176 (56.8) 398 (64.2) 1.00 CT + TT 134 (43.2) 222 (35.8) 1.36 (0.88–1.87) Allele, T (%) 154 (24.8) 252 (20.3) 896 A > G Asp299Gly (rs4986790) Co-dominant AA 161 (51.9) 404 (65.2) 1.00 0.155 AG 121 (39.0) 189 (30.5) 1.54 (1.21–1.89) GG 28 (9.0) 27 (4.3) 1.87 (1.16–2.61) Dominant AA 161 (51.9) 404 (65.2) 1.00 AG + GG 149 (48.1) 216 (34.8) 1.61 (1.28–1.96) Allele, G (%) 177 (28.6) 243 (19.6) + 7263G/C, rs11536889 Co-dominant GG 172 (55.5) 405 (65.3) 1.00 0.649 GC 119 (38.4) 195 (31.5) 1.43 (1.06–1.83) CC 19 (6.1) 20 (3.2) 1.62 (1.13–2.17) Dominant GG 172 (55.5) 405 (65.3) 1.00 GC + CC 138 (44.5) 215 (34.7) 1.48 (1.09–1.91) Allele, C (%) 157 (25.3) 235 (19.0) rs7873784 Co-dominant CC 191 (61.6) 411 (66.3) 1.00 0.443 CG 105 (33.9) 192 (31.0) 1.25 (0.89–1.63) GG 14 (4.5) 17 (2.7) 1.58 (0.80–2.37) Dominant CC 191 (61.6) 411 (66.3) 1.00 CG + GG 119 (38.4) 209 (33.7) 1.29 (0.87–2.05) Allele, G (%) 133 (21.5) 226 (18.2) *Adjusted for age, smoking, WC, tubal ligation and menopause status In this study, we used the GMDR model to screen the best SNP- SNP and SNP- AO interactions for 4 SNPs within the TLR4 4 P P  Table 4 Best gene–gene and gene- AO interaction combinations in GMDR model Locus no. Best combination Sign test p Testing balanced accuracy Cross-validation consistency SNP- SNP interaction 1 2 rs4986790, rs11536889 0.018 0.608 10/10 3 rs4986790, rs11536889, rs4986791 0.426 0.540 7/10 4 rs4986790, rs11536889, rs4986791, rs7873784 0.532 0.496 6/10 Gene- AO interaction 2 2 rs4986790, AO 0.001 0.622 10/10 3 rs4986790, rs4986791, AO 0.256 0.549 8/10 4 rs4986790, rs4986791, rs11536889, AO 0.359 0.512 7/10 5 rs4986790, rs4986791, rs11536889, rs7873784, AO 0.624 0.496 6/10 1 2 We also employed logistic regression analysis to examine the SNP- SNP interaction between rs4986790 and rs11536889, as well as the SNP- AO interaction effect between rs4986790 and AO. We found that the risk of OC was highest in participants with the rs4986790- AG/GG and rs11536889-GC/CC genotypes, compared to those with rs4986790-AA and rs11536889-GG genotypes, OR (95%CI) = 2.58 (1.46–3.71). We also found that among participants with rs4986790 - AG/GG genotype, the risk of OC was highest in those with AO. When compared to non- abdominal obese participants with rs4986790 - AA genotype, the OR (95%CI) = 3.17 (1.78–4.58) (Table 5  Table 5 Analysis for SNP-SNP and gene - AO interaction by using logistic regression Variables OR (95% CI) * p SNP- SNP interaction 1 rs4986790-AA and rs11536889-GG 1.00 - rs4986790-AA and rs11536889-GC/CC 1.25 (0.94–1.61) 0.306 rs4986790-AG/GG and rs11536889-GG 1.59 (1.08–2.12) 0.028 rs4986790- AG/GG and rs11536889-GC/CC 2.58 (1.46–3.71) 0.001 Gene- AO interaction 2 rs4986790-AA and normal WC 1.00 - rs4986790-AA and AO 1.36 (1.07–1.69) 0.021 rs4986790-AG/GG and normal WC 1.47 (1.11–1.87) 0.012 rs4986790- AG/GG and AO 3.17 (1.78–4.58) < 0.001 1 2 Discussion In the current study, we found that carriers with the G allele of rs4986790 and the C allele of rs11536889 within the TLR4 TLR2 TLR3 TLR4 TLR5 TLR9. TLR4 24 25 TLR4 26 Previous studies have indicated a statistical association between TLR4 27 28 29 TLR4 15 30 TLR4 TLR4 Asp299Gly 16 The precise biological mechanism by which TLR4 31 TLR4 32 33 The onset of OC is contributed to by many factors, including genetic and environmental factors, as well as their synergistic effects [ 7 TLR4 34 35 36 37 TLR4 TLR4 TLR4 This study had several limitations. First, the sample size of OC patients was limited, which might result in unstable results. In the future, more OC patients should be included to validate the findings of this study. Secondly, all the participants enrolled in this study were of the Chinese Han population. Therefore, the results obtained from this study may not necessarily be representative of populations of other races. In conclusion, this case-control study indicated a statistically significant association between the rs4986790- G allele or with the rs11536889- C allele within TLR4 TLR4 TLR4 Supplementary Information  Supplementary Material 1. Abbreviations AO Abdominal obesity BMI Body mass index SNPs Single nucleotide polymorphisms GMDR Generalized multifactor dimensionality reduction OC Ovarian cancer FIGO International Federation of Gynecology and Obstetrics SD Standard deviation HWE Hardy- Weinberg equilibrium WC Waist circumference Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We appreciate the cooperation of the partners and staff who cooperated in this study. Authors’ contributions The manuscript writing, editing, and review were conducted by Zhu J and Tan C, Yang B and Zhai X participated in the genomic DNA extraction and genotyping. Ni Feng and Tao D participated information collection and questionnaire investigation. Funding This study was supported by the Youth Project of Wuxi Municipal Health Commission (Q202310). Data availability The data and tables generated and analyzed during this study are available from the corresponding authors upon reasonable request. Declarations Ethics approval and consent to participate Each participant understood the study process and signed a written informed consent before the study. The protocol was approved by committee of the Affiliated Jiangyin Hospital of Nantong University (2024-L044) in accordance with the Declaration of Helsinki. Competing interests The authors declare no competing interests. References 1. 1. Ferlay J, Ervik M, Lam F, Laversanne M, Colombet M, Mery L, Piñeros M, Znaor A, Soerjomataram I, Bray F. Global Cancer Observatory: Cancer Today. Lyon, France: International Agency for Research on Cancer, 2024. Available from: https://gco.iarc.who.int/today 2. Momenimovahed Z Ghoncheh M Pakzad R Hasanpour H Salehiniya H Incidence and mortality of uterine cancer and relationship with human development index in the world Cukurova Med J. 2017 42 2 233 240 10.17826/cutf.322865 Momenimovahed Z, Ghoncheh M, Pakzad R, Hasanpour H, Salehiniya H. Incidence and mortality of uterine cancer and relationship with human development index in the world. Cukurova Med J. 2017;42(2):233–40. 3. Han B Zheng R Zeng H Wang S Sun K Chen R Li L Wei W He J Cancer incidence and mortality in China, 2022 J Natl Cancer Cent. 2024 4 1 47 53 39036382 10.1016/j.jncc.2024.01.006 PMC11256708 Han B, Zheng R, Zeng H, Wang S, Sun K, Chen R, Li L, Wei W, He J. Cancer incidence and mortality in China, 2022. J Natl Cancer Cent. 2024;4(1):47–53. 39036382 10.1016/j.jncc.2024.01.006 PMC11256708 4. Wojtyła C Bertuccio P Giermaziak W Santucci C Odone A Ciebiera M Negri E Wojtyła A La Vecchia C European trends in ovarian cancer mortality, 1990–2020 and predictions to 2025 Eur J Cancer. 2023 194 113350 10.1016/j.ejca.2023.113350 37837925 Wojtyła C, Bertuccio P, Giermaziak W, Santucci C, Odone A, Ciebiera M, Negri E, Wojtyła A, La Vecchia C. European trends in ovarian cancer mortality, 1990–2020 and predictions to 2025. Eur J Cancer. 2023;194:113350. 37837925 10.1016/j.ejca.2023.113350 5. Lichtenstein P Holm NV Verkasalo PK Iliadou A Kaprio J Koskenvuo M Pukkala E Skytthe A Hemminki K Environmental and heritable factors in the causation of cancer-analyses of cohorts of twins from Sweden, Denmark, and Finland N Engl J Med. 2000 343 78 85 10.1056/NEJM200007133430201 10891514 Lichtenstein P, Holm NV, Verkasalo PK, Iliadou A, Kaprio J, Koskenvuo M, Pukkala E, Skytthe A, Hemminki K. Environmental and heritable factors in the causation of cancer-analyses of cohorts of twins from Sweden, Denmark, and Finland. N Engl J Med. 2000;343:78–85. 10891514 10.1056/NEJM200007133430201 6. Ali AT Al-Ani O Al-Ani F Epidemiology and risk factors for ovarian cancer Prz Menopauzalny. 2023 22 2 93 104 37674925 10.5114/pm.2023.128661 PMC10477765 Ali AT, Al-Ani O, Al-Ani F. Epidemiology and risk factors for ovarian cancer. Prz Menopauzalny. 2023;22(2):93–104. 37674925 10.5114/pm.2023.128661 PMC10477765 7. Momenimovahed Z Tiznobaik A Taheri S Salehiniya H Ovarian cancer in the world: epidemiology and risk factors Int J Womens Health. 2019 11 287 299 10.2147/IJWH.S197604 31118829 PMC6500433 Momenimovahed Z, Tiznobaik A, Taheri S, Salehiniya H. Ovarian cancer in the world: epidemiology and risk factors. Int J Womens Health. 2019;11:287–99. 31118829 10.2147/IJWH.S197604 PMC6500433 8. Torre LA Trabert B DeSantis CE Miller KD Samimi G Runowicz CD Gaudet MM Jemal A Siegel RL Ovarian cancer statistics, 2018 CA Cancer J Clin. 2018 68 4 284 296 29809280 10.3322/caac.21456 PMC6621554 Torre LA, Trabert B, DeSantis CE, Miller KD, Samimi G, Runowicz CD, Gaudet MM, Jemal A, Siegel RL. Ovarian cancer statistics, 2018. CA Cancer J Clin. 2018;68(4):284–96. 29809280 10.3322/caac.21456 PMC6621554 9. Burghaus S Fasching PA Häberle L Rübner M Büchner K Blum S Engel A Ekici AB Hartmann A Hein A Beckmann MW Renner SP Genetic risk factors for ovarian cancer and their role for endometriosis risk Gynecol Oncol. 2017 145 1 142 147 10.1016/j.ygyno.2017.02.022 28214017 Burghaus S, Fasching PA, Häberle L, Rübner M, Büchner K, Blum S, Engel A, Ekici AB, Hartmann A, Hein A, Beckmann MW, Renner SP. Genetic risk factors for ovarian cancer and their role for endometriosis risk. Gynecol Oncol. 2017;145(1):142–7. 28214017 10.1016/j.ygyno.2017.02.022 10. Kutikhin AG Impact of Toll-like receptor 4 polymorphisms on risk of cancer Hum Immunol 2011 72 2 193 206 10.1016/j.humimm.2010.11.003 21081146 Kutikhin AG. Impact of Toll-like receptor 4 polymorphisms on risk of cancer. Hum Immunol. 2011;72(2):193–206. 21081146 10.1016/j.humimm.2010.11.003 11. Liu H Qi S He W Chang C Chen Y Yu J Association of single-nucleotide polymorphisms in TLR4 gene and gene-environment interaction with primary open angle glaucoma in a Chinese northern population J Gene Med. 2020 22 1 e3139 10.1002/jgm.3139 31697008 Liu H, Qi S, He W, Chang C, Chen Y, Yu J. Association of single-nucleotide polymorphisms in TLR4 gene and gene-environment interaction with primary open angle glaucoma in a Chinese northern population. J Gene Med. 2020;22(1):e3139. 31697008 10.1002/jgm.3139 12. Li Z Song A Yu H Interaction between toll-like receptor 4 (TLR4) gene and alcohol drinking on Parkinson’s disease risk in Chinese Han population J Clin Neurosci. 2019 62 128 132 10.1016/j.jocn.2018.12.002 30594449 Li Z, Song A, Yu H. Interaction between toll-like receptor 4 (TLR4) gene and alcohol drinking on Parkinson’s disease risk in Chinese Han population. J Clin Neurosci. 2019;62:128–32. 30594449 10.1016/j.jocn.2018.12.002 13. Jing YY Han ZP Sun K Zhang SS Hou J Liu Y Li R Gao L Zhao X Zhao QD Wu MC Wei LX Toll-like receptor 4 signaling promotes epithelial-mesenchymal transition in human hepatocellular carcinoma induced by lipopolysaccharide BMC Med. 2012 10 98 10.1186/1741-7015-10-98 22938142 PMC3482562 Jing YY, Han ZP, Sun K, Zhang SS, Hou J, Liu Y, Li R, Gao L, Zhao X, Zhao QD, Wu MC, Wei LX. Toll-like receptor 4 signaling promotes epithelial-mesenchymal transition in human hepatocellular carcinoma induced by lipopolysaccharide. BMC Med. 2012;10:98. 22938142 10.1186/1741-7015-10-98 PMC3482562 14. Rakhesh M Cate M Vijay R Shrikant A Shanjana A A TLR4-interacting peptide inhibits lipopolysaccharide-stimulated inflammatory responses, migration and invasion of colon cancer SW480 cells Oncoimmunology 2012 1 1495 1506 10.4161/onci.22089 23264896 PMC3525605 Rakhesh M, Cate M, Vijay R, Shrikant A, Shanjana A. A TLR4-interacting peptide inhibits lipopolysaccharide-stimulated inflammatory responses, migration and invasion of colon cancer SW480 cells. Oncoimmunology. 2012;1:1495–506. 23264896 10.4161/onci.22089 PMC3525605 15. Wang AC Wu FX Gao YS Sheng XG Toll-like receptor 4 single-nucleotide polymorphisms Asp299Gly and Thr399Ile in ovarian cancers Oncol Lett. 2014 8 1 438 440 10.3892/ol.2014.2113 24959291 PMC4063650 Wang AC, Wu FX, Gao YS, Sheng XG. Toll-like receptor 4 single-nucleotide polymorphisms Asp299Gly and Thr399Ile in ovarian cancers. Oncol Lett. 2014;8(1):438–40. 24959291 10.3892/ol.2014.2113 PMC4063650 16. Kania KD Haręża D Wilczyński JR Wilczyński M Jarych D Malinowski A Paradowska E The Toll-like Receptor 4 Polymorphism Asp299Gly Is Associated with an Increased Risk of Ovarian Cancer Cells. 2022 11 19 3137 10.3390/cells11193137 36231099 PMC9563956 Kania KD, Haręża D, Wilczyński JR, Wilczyński M, Jarych D, Malinowski A, Paradowska E. The Toll-like Receptor 4 Polymorphism Asp299Gly Is Associated with an Increased Risk of Ovarian Cancer. Cells. 2022;11(19):3137. 36231099 10.3390/cells11193137 PMC9563956 17. Snider AP Wood JR Obesity induces ovarian inflammation and reduces oocyte quality Reproduction. 2019 158 3 R79 R90 10.1530/REP-18-0583 30999278 Snider AP, Wood JR. Obesity induces ovarian inflammation and reduces oocyte quality. Reproduction. 2019;158(3):R79–90. 30999278 10.1530/REP-18-0583 18. Liu Z Zhang TT Zhao JJ Qi SF Du P Liu DW Tian QB The association between overweight, obesity and ovarian cancer: a meta-analysis Jpn J Clin Oncol. 2015 45 12 1107 15 26491203 10.1093/jjco/hyv150 Liu Z, Zhang TT, Zhao JJ, Qi SF, Du P, Liu DW, Tian QB. The association between overweight, obesity and ovarian cancer: a meta-analysis. Jpn J Clin Oncol. 2015;45(12):1107–15. 26491203 10.1093/jjco/hyv150 19. Urbute A Frederiksen K Kjaer SK Early adulthood overweight and obesity and risk of premenopausal ovarian cancer, and premenopausal breast cancer including receptor status: prospective cohort study of nearly 500,000 Danish women Ann Epidemiol 2022 70 61 67 10.1016/j.annepidem.2022.03.013 35405346 Urbute A, Frederiksen K, Kjaer SK. Early adulthood overweight and obesity and risk of premenopausal ovarian cancer, and premenopausal breast cancer including receptor status: prospective cohort study of nearly 500,000 Danish women. Ann Epidemiol. 2022;70:61–7. 35405346 10.1016/j.annepidem.2022.03.013 20. Meeting Report The new FIGO staging system for cancers of the vulva, cervix, endometrium and sarcomas Gynecol Oncol. 2009 115 325 8 10.1016/j.ygyno.2009.10.050 Meeting Report. The new FIGO staging system for cancers of the vulva, cervix, endometrium and sarcomas. Gynecol Oncol. 2009;115:325–8. 21. 21. Ryan, Thomas P. Sample Size Determination and Power. John Wiley & Sons. Hoboken, New Jersey, 2013. 22. 22. IDF: International Diabetes Federation. Worldwide definition of the metabolicsyndrome. Available at http://www.idf.org/webdata/docs/Metabolic_syndrome_definition.pdf 23. Lou XY Chen GB Yan L Ma JZ Zhu J Elston RC Li MD A generalized combinatorial approach for detecting gene-by gene and gene-by-environment interactions with application to nicotine dependence Am J Hum Genet 2007 80 6 1125 1137 10.1086/518312 17503330 PMC1867100 Lou XY, Chen GB, Yan L, Ma JZ, Zhu J, Elston RC, Li MD. A generalized combinatorial approach for detecting gene-by gene and gene-by-environment interactions with application to nicotine dependence. Am J Hum Genet. 2007;80(6):1125–37. 17503330 10.1086/518312 PMC1867100 24. Anthoney N Foldi I Hidalgo A Toll and Toll-like receptor signalling in development Development. 2018 145 9 dev156018 10.1242/dev.156018 29695493 Anthoney N, Foldi I, Hidalgo A. Toll and Toll-like receptor signalling in development. Development. 2018;145(9):dev156018. 29695493 10.1242/dev.156018 25. Shafeghat M Kazemian S Aminorroaya A Aryan Z Rezaei N Toll-like receptor 7 regulates cardiovascular diseases Int Immunopharmacol 2022 113 Pt A 109390 10.1016/j.intimp.2022.109390 36330918 Shafeghat M, Kazemian S, Aminorroaya A, Aryan Z, Rezaei N. Toll-like receptor 7 regulates cardiovascular diseases. Int Immunopharmacol. 2022;113(Pt A);109390. 36330918 10.1016/j.intimp.2022.109390 26. Semeraro F Ammollo CT Morrissey JH Dale GL Friese P Esmon NL Esmon CT Extracellular histones promotethrombin generation through platelet-dependent mechanisms: Involvement of platelet TLR2 and TLR4 Blood 2011 118 1952 1961 10.1182/blood-2011-03-343061 21673343 PMC3158722 Semeraro F, Ammollo CT, Morrissey JH, Dale GL, Friese P, Esmon NL, Esmon CT. Extracellular histones promotethrombin generation through platelet-dependent mechanisms: Involvement of platelet TLR2 and TLR4. Blood. 2011;118:1952–61. 21673343 10.1182/blood-2011-03-343061 PMC3158722 27. Khademalhosseini M Arababadi MK Toll-like receptor 4 and breast cancer: an updated systematic review Breast Cancer. 2019 26 3 265 271 10.1007/s12282-018-00935-2 30543015 Khademalhosseini M, Arababadi MK. Toll-like receptor 4 and breast cancer: an updated systematic review. Breast Cancer. 2019;26(3):265–71. 30543015 10.1007/s12282-018-00935-2 28. Pandey NO Chauhan AV Raithatha NS Patel PK Khandelwal R Desai AN Choxi Y Kapadia RS Jain ND Association of TLR4 and TLR9 polymorphisms and haplotypes with cervical cancer susceptibility Sci Rep. 2019 9 1 9729 10.1038/s41598-019-46077-z 31278284 PMC6611874 Pandey NO, Chauhan AV, Raithatha NS, Patel PK, Khandelwal R, Desai AN, Choxi Y, Kapadia RS, Jain ND. Association of TLR4 and TLR9 polymorphisms and haplotypes with cervical cancer susceptibility. Sci Rep. 2019;9(1):9729. 31278284 10.1038/s41598-019-46077-z PMC6611874 29. Luo XZ He QZ Wang K Expression of Toll-like receptor 4 in ovarian serous adenocarcinoma and correlation with clinical stage and pathological grade Int J Clin Exp Med. 2015 8 8 14323 7 26550417 PMC4613102 Luo XZ, He QZ, Wang K. Expression of Toll-like receptor 4 in ovarian serous adenocarcinoma and correlation with clinical stage and pathological grade. Int J Clin Exp Med. 2015;8(8):14323–7. 26550417 PMC4613102 30. Kutikhin AG Yuzhalin AE Volkov AN Zhivotovskiy AS Brusina EB Correlation between genetic polymorphisms within IL-1B and TLR4 genes and cancer risk in a Russian population: a case-control study Tumour Biol. 2014 35 5 4821 30 10.1007/s13277-014-1633-6 24446182 Kutikhin AG, Yuzhalin AE, Volkov AN, Zhivotovskiy AS, Brusina EB. Correlation between genetic polymorphisms within IL-1B and TLR4 genes and cancer risk in a Russian population: a case-control study. Tumour Biol. 2014;35(5):4821–30. 24446182 10.1007/s13277-014-1633-6 31. Jiang C Qu X Ke H Gong W Chen R Yang W Cheng Z Association between the HMGB1/TLR4 signaling pathway and the clinicopathological features of ovarian cancer Mol Med Rep. 2018 18 3 3093 3098 30015957 10.3892/mmr.2018.9271 Jiang C, Qu X, Ke H, Gong W, Chen R, Yang W, Cheng Z. Association between the HMGB1/TLR4 signaling pathway and the clinicopathological features of ovarian cancer. Mol Med Rep. 2018;18(3):3093–8. 30015957 10.3892/mmr.2018.9271 32. Lupi LA Cucielo MS Silveira HS Gaiotte LB Cesário RC Seiva FRF de Almeida Chuffa LG The role of Toll-like receptor 4 signaling pathway in ovarian, cervical, and endometrial cancers Life Sci. 2020 247 117435 10.1016/j.lfs.2020.117435 32081661 Lupi LA, Cucielo MS, Silveira HS, Gaiotte LB, Cesário RC, Seiva FRF, de Almeida Chuffa LG. The role of Toll-like receptor 4 signaling pathway in ovarian, cervical, and endometrial cancers. Life Sci. 2020;247:117435. 32081661 10.1016/j.lfs.2020.117435 33. Shea AA Heffron CL Grieco JP Roberts PC Schmelz EM Obesity modulates the cellular and molecular microenvironment in the peritoneal cavity: implication for ovarian cancer risk Front. Immunol. 2024 14 1323399 10.3389/fimmu.2023.1323399 38264656 PMC10803595 Shea AA, Heffron CL, Grieco JP, Roberts PC, Schmelz EM. Obesity modulates the cellular and molecular microenvironment in the peritoneal cavity: implication for ovarian cancer risk. Front Immunol. 2024;14:1323399. 38264656 10.3389/fimmu.2023.1323399 PMC10803595 34. Delort L Kwiatkowski F Chalabi N Satih S Bignon YJ Bernard-Gallon DJ Central adiposity as a major risk factor of ovarian cancer Anticancer Res. 2009 29 12 5229 5234 20044641 Delort L, Kwiatkowski F, Chalabi N, Satih S, Bignon YJ, Bernard-Gallon DJ. Central adiposity as a major risk factor of ovarian cancer. Anticancer Res. 2009;29(12):5229–34. 20044641 35. Rodriguez C Calle EE Fakhrabadi-Shokoohi D Jacobs EJ Thun MJ Body mass index, height, and the risk of ovarian cancer mortality in a prospective cohort of postmenopausal women Cancer Epidemiol Biomarkers Prev. 2002 11 9 822 828 12223425 Rodriguez C, Calle EE, Fakhrabadi-Shokoohi D, Jacobs EJ, Thun MJ. Body mass index, height, and the risk of ovarian cancer mortality in a prospective cohort of postmenopausal women. Cancer Epidemiol Biomarkers Prev. 2002;11(9):822–8. 12223425 36. Zhang H Zhou L Single nucleotide polymorphism of PIK3CA and its interaction with the environment are risk factors for Chinese Han ovarian cancer Pathol Res Pract. 2019 215 9 152520 10.1016/j.prp.2019.152520 31288947 Zhang H, Zhou L. Single nucleotide polymorphism of PIK3CA and its interaction with the environment are risk factors for Chinese Han ovarian cancer. Pathol Res Pract. 2019;215(9):152520. 31288947 10.1016/j.prp.2019.152520 37. Kim S Wang M Tyrer JP Jensen A Wiensch A Liu G Lee AW Ness RB Salvatore M Tworoger SS Whittemore AS Anton-Culver H Sieh W Olson SH Berchuck A Goode EL Goodman MT Doherty JA Chenevix-Trench G Rossing MA Webb PM Giles GG Terry KL Ziogas A Fortner RT Menon U Gayther SA Wu AH Song H Brooks-Wilson A Bandera EV Cook LS Cramer DW Milne RL Winham SJ Kjaer SK Modugno F Thompson PJ Chang-Claude J Harris HR Schildkraut JM Le ND Wentzensen N Trabert B Høgdall E Huntsman D Pike MC Pharoah PDP Pearce CL Mukherjee B A comprehensive gene-environment interaction analysis in Ovarian Cancer using genome-wide significant common variants Int J Cancer. 2019 144 9 2192 2205 10.1002/ijc.32029 30499236 PMC6399057 Kim S, Wang M, Tyrer JP, Jensen A, Wiensch A, Liu G, Lee AW, Ness RB, Salvatore M, Tworoger SS, Whittemore AS, Anton-Culver H, Sieh W, Olson SH, Berchuck A, Goode EL, Goodman MT, Doherty JA, Chenevix-Trench G, Rossing MA, Webb PM, Giles GG, Terry KL, Ziogas A, Fortner RT, Menon U, Gayther SA, Wu AH, Song H, Brooks-Wilson A, Bandera EV, Cook LS, Cramer DW, Milne RL, Winham SJ, Kjaer SK, Modugno F, Thompson PJ, Chang-Claude J, Harris HR, Schildkraut JM, Le ND, Wentzensen N, Trabert B, Høgdall E, Huntsman D, Pike MC, Pharoah PDP, Pearce CL, Mukherjee B. A comprehensive gene-environment interaction analysis in Ovarian Cancer using genome-wide significant common variants. Int J Cancer. 2019;144(9):2192–205. 30499236 10.1002/ijc.32029 PMC6399057 ",
  "metadata": {
    "Title of this paper": "A comprehensive gene-environment interaction analysis in Ovarian Cancer using genome-wide significant common variants",
    "Journal it was published in:": "BMC Women's Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481797/"
  }
}