{
  "title": "Paper_339",
  "abstract": "pmc Clin Case Rep Clin Case Rep 2542 ccr CCR3 Clinical Case Reports 2050-0904 Wiley PMC12485269 PMC12485269.1 12485269 12485269 41040826 10.1002/ccr3.71077 CCR371077 CCR3-2025-02-0658.R2 1 Case Report Case Report Topical Estradiol Gel Leading to Laboratory Error in Serum Estradiol Measurement: A Diagnostic Pitfall Sato Takeki https://orcid.org/0009-0005-8392-0623  1 takeki.sato.e5@tohoku.ac.jp Tachibana Masahito  1  2 Hiraga Hiroaki https://orcid.org/0000-0002-0813-4068  1 Yokoyama Emi  1 Watanabe Zen https://orcid.org/0000-0002-0621-4435  1 Saito Masatoshi  1  2   1 Department of Obstetrics and Gynecology Tohoku University Hospital Sendai Miyagi Japan   2 Department of Perinatology Tohoku University Graduate School of Medicine Sendai Miyagi Japan * Correspondence: takeki.sato.e5@tohoku.ac.jp 01 10 2025 10 2025 13 10 497443 10.1002/ccr3.v13.10 e71077 29 6 2025 24 2 2025 20 9 2025 01 10 2025 02 10 2025 03 10 2025 © 2025 The Author(s). Clinical Case Reports https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc/4.0/ ABSTRACT Estradiol gel is commonly used as an estrogen replacement therapy for patients with menopausal symptoms. Herein, we present a case of a patient with iatrogenic primary ovarian insufficiency who exhibited an abnormally elevated serum estradiol concentration (5634.0 pg/mL) during routine estradiol monitoring. A detailed interview revealed that the cause of these elevated levels was contamination of the needle used to draw her blood with gel from her skin. To the best of our knowledge, this is the first report of estradiol concentrations exceeding 2000 pg/mL due to such contamination. This phenomenon is not well known and is not described in package inserts or guidelines. There is a risk that misleadingly high serum estradiol concentrations may lead to inappropriate dose adjustments, potentially negatively affecting the health of the patients. Thus, clinicians must provide precise instructions to patients to avoid applying the gel around the area where venipuncture is to be performed.  contamination estrogen replacement therapy menopausal symptoms primary ovarian insufficiency serum estradiol concentration pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  T. Sato M. Tachibana H. Hiraga E. Yokoyama Z. Watanabe M. Saito Topical Estradiol Gel Leading to Laboratory Error in Serum Estradiol Measurement: A Diagnostic Pitfall Clinical Case Reports 13 10 2025 e71077 10.1002/ccr3.71077  Funding:  Summary  The contamination of blood samples with estradiol gel could cause misleadingly high serum estradiol concentrations, which may result in inappropriate dose adjustments, negatively affecting patients' health. Our report highlights the importance of informing patients about this issue. Including information on package inserts and guidelines may help prevent such a pitfall. 1 Introduction Supplemental estrogen administration is a necessary component of management for treating patients who experience the loss of ovarian function before the age of 40 years, a condition known as primary ovarian insufficiency (POI). Owing to a decreased or complete lack of estrogen, patients often experience hormone‐related health problems, such as hot flashes, anxiety, and vaginal dryness. Additionally, patients with POI may be at risk for long‐term health complications, such as osteoporosis, heart or vascular disease, dyslipidemia, and dementia. The absorption of supplemental estrogen varies widely among individuals [ 1 2 1 2 3 4 In this report, we present a case of a patient with iatrogenic POI who exhibited unexpectedly high serum E2 concentrations on a peripheral blood test during ERT, representing an example of a potential clinical pitfall in ERT management. Although underreported in the literature, elevated sex steroid levels due to topical contamination have recently been reported with both E2 and testosterone gels [ 5 6 2 Case History We present a case of a 38‐year‐old, gravida 1 para 0, Japanese woman who had undergone treatment for uterine cervical cancer (squamous cell carcinoma, International Federation of Gynecology and Obstetrics 2018 stage IIIC1r). Her height and body weight were 147.3 cm and 43.5 kg, respectively. She had no significant medical or family history. The patient underwent concurrent chemoradiotherapy, which included a weekly cisplatin regimen (40 mg/m 2 3 Methods (Differential Diagnosis, Investigation, and Treatment) We changed the dosage and form of her supplemental E2 administration to a half dose (1 push/0.9 g daily) of the estradiol 0.06% gel pump pack (L'ESTROGEL, Fuji Pharma Co. Ltd.), which was eventually increased to a full dose (2 pushes/1.8 g daily). Ultrasound revealed no endometrial thickening. Her symptoms subsided, and she successfully continued ERT with the E2 gel, with a scheduled blood test as per the manufacturer's instructions. At the 1‐year follow‐up, the serum E2 and FSH concentrations of the patient were 5634.0 pg/mL and 74.30 mIU/mL, respectively. As the serum E2 concentration was unexpectedly high, we re‐evaluated both the serum E2 and FSH concentrations a few days later and obtained similarly elevated results (E2: 2850.0 pg/mL, FSH: 58.20 mIU/mL). Given that her serum E2 concentration dropped significantly to an undetectable level (E2: < 0.5 pg/mL, FSH: 91.00 mIU/mL) 1 month after cessation of use of the E2 gel, the elevated serum E2 concentration was evidently due to exogenous E2 administration (Figure 1 FIGURE 1 Changes in serum E2 and FSH concentrations. E2, estradiol; FSH, follicle‐stimulating hormone. 4 Conclusion and Results (Outcome and Follow‐Up) We performed a detailed assessment to confirm how the patient was using the gel. During this process, she explained that she had “applied the gel from both shoulders to wrists in the morning,” after which she went to the hospital for her appointment and underwent blood sampling from the left cubital vein before noon. Based on this information, we suspected that the needle had become contaminated with the E2 gel during blood sampling. Therefore, we advised the patient to avoid applying the gel near both cubital fossae. One month later, her serum E2 concentration returned to expected levels (E2: 24.3 pg/mL, FSH: 75.20 mIU/mL), as depicted in Figure 1 5 Discussion We report a clinical pitfall that should be considered during estrogen supplementation. We observed an extremely elevated serum E2 concentration, which we attributed to contamination of a blood sample with the E2 gel, despite the appropriate dose being used. According to the package insert of the E2 gel, the average serum E2 concentration at steady state was 26.3 ± 4.8 pg/mL in the 1.25 g/day group and 60.8 ± 22.6 pg/mL in the 1.8 g/day group. However, the present case exhibited a 94‐fold increase in the expected values. Regarding the cause of this abnormally high serum E2 concentration, our concern was whether there had been an error in gel usage or an abnormality in E2 metabolism. The package insert specified that the gel should be applied to the broad area from the shoulders to the wrists once a day. Therefore, the patient correctly followed the manufacturer's instructions. As for E2 metabolism, no liver or renal dysfunction was observed in this patient. A potential drug interaction was also considered, as drugs that inhibit the drug‐metabolizing enzyme cytochrome P450 (CYP3A4) can affect serum E2 concentrations [ 4 7 Although determining that blood sample contamination was the cause of the patient's abnormally elevated serum E2 concentration initially posed a challenge, the solution was simple once we had identified the underlying cause. However, this clinical pitfall is poorly recognized. We searched PubMed using keywords such as “estradiol gel,” “serum concentration,” “contamination,” and “error” and found only two papers that discussed this issue in detail [ 1 5 3 4 In conclusion, we report a case of a patient with iatrogenic POI who exhibited an unexpectedly elevated serum E2 concentration on a blood test during the course of gel ERT follow‐up. Our report highlights the importance of clinicians informing patients about the potential for sample contamination before blood tests and ensuring careful screening of the area where the E2 gel is applied. Advising patients to apply gel to the thigh or areas away from phlebotomy sites before blood draws may be helpful. Furthermore, including this information on package inserts and guidelines may help prevent such a clinical pitfall. Author Contributions  Takeki Sato: Masahito Tachibana: Hiroaki Hiraga: Emi Yokoyama: Zen Watanabe: Masatoshi Saito: Ethics Statement The Ethics Committee at Tohoku University Hospital approved this study (No. 36575). Consent Written informed consent was obtained from the patient for the publication of this case report. Conflicts of Interest The authors declare no conflicts of interest. Acknowledgments The authors have nothing to report. Data Availability Statement Data sharing is not applicable to this article as no datasets were generated or analyzed during the current study. References 1 T. Vihtamäki T. Luukkaaka R. Tuimala Skin Contamination by Oestradiol Gel‐A Remarkable Source of Error in Plasma Oestradiol Measurements During Percutaneous Hormone Replacement Therapy Maturitas 48 4 2004 347 353 15283926 10.1016/S0378-5122(03)00043-4 2 I. Sriprasert N. Kono R. Karim Factors Associated With Serum Estradiol Levels Among Postmenopausal Women Using Hormone Therapy Obstetrics and Gynecology 136 4 2020 675 684 32925623 10.1097/AOG.0000000000004006 PMC7529896 3 C. A. Stuenkel S. R. Davis A. Gompel Treatment of Symptoms of the Menopause: An Endocrine Society Clinical Practice Guideline Journal of Clinical Endocrinology and Metabolism 100 11 2015 3975 4011 26444994 10.1210/jc.2015-2236 4 Japan Society of Obstetrics and Gynecology/Japan Association of Obstetricians and Gynecologists Editing/Supervision Hormone Replacement Therapy Guideline 2017 Japan Society of Obstetrics and Gynecology Secretariat 2017 86 91 5 R. A. Maggacis A. S. Cheung B. J. Nolan Serum Estradiol Concentrations With Estradiol 0.06% Gel in Transgender and Gender‐Diverse Adults Clinical Endocrinology 2025 10.1111/cen.15217 39949293 6 A. P. Pichilingue D. N. Greene M. D. Krasowski Falsely Elevated Serum Testosterone Measurements Resulting From Testosterone Topical Gel Contamination of the Venipuncture Site: Case Series and Retrospective Review Heliyon 9 12 2023 e22819 38094062 10.1016/j.heliyon.2023.e22819 PMC10716548 7 H. Kuhl Pharmacology of Estrogens and Progestogens: Influence of Different Routes of Administration Climacteric 8 Suppl 1 2005 3 63 10.1080/13697130500148875 16112947 ",
  "metadata": {
    "Title of this paper": "Pharmacology of Estrogens and Progestogens: Influence of Different Routes of Administration",
    "Journal it was published in:": "Clinical Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485269/"
  }
}