{
  "title": "Paper_1025",
  "abstract": "pmc Front Cardiovasc Med Front Cardiovasc Med 2863 fcvm Front. Cardiovasc. Med. Frontiers in Cardiovascular Medicine 2297-055X Frontiers Media SA PMC12479519 PMC12479519.1 12479519 12479519 41035698 10.3389/fcvm.2025.1626769 1 Cardiovascular Medicine Original Research Vitamin A deficiency attenuates cardiac rupture in Stra6- Smolenski Yannick  1  † Froese Natali  1  † Galuppo Paolo  1 Werlein Christopher  2 Gigina Anna  1 Talbot Steven R.  3 Erschow Sergej  1 Wedekind Dirk  3 Geffers Robert  4 Ghyselinck Norbert B.  5 Bähre Heike  6 Kamp Jan C.  7  8 Neubert Lavinia  2  8 Ricke-Hoch Melanie  1 Bauersachs Johann  1 Riehle Christian  1 * 1 Department of Cardiology and Angiology, Hannover Medical School Hannover Germany 2 Institute of Pathology, Hannover Medical School Hannover Germany 3 Institute for Laboratory Animal Science, Hannover Medical School Hannover Germany 4 Helmholtz Center for Infection Research, Research Group Genome Analytics Braunschweig Germany 5 Institut de Génétique et de Biologie Moléculaire et Cellulaire (IGBMC), Département de Génétique Fonctionnelle et Cancer, Centre National de la Recherche Scientifique (CNRS UMR7104), Institut National de la Santé et de la Recherche Médicale (INSERM U1258), Université de Strasbourg Illkirch France 6 Research Core Unit Metabolomics, Institute of Pharmacology, Hannover Medical School Hannover Germany 7 Department of Respiratory Medicine, Hannover Medical School Hannover Germany 8 German Center for Lung Research (DZL), Biomedical Research in Endstage and Obstructive Lung Disease Hannover (BREATH) Hannover Germany Edited by: Zhen Yang Reviewed by: Chikai Zhou Ian Gans * Correspondence: riehle.christian@mh-hannover.de  † These authors have contributed equally to this work and share first authorship 16 9 2025 2025 12 480653 1626769 11 5 2025 28 8 2025 16 09 2025 01 10 2025 02 10 2025 © 2025 Smolenski, Froese, Galuppo, Werlein, Gigina, Talbot, Erschow, Wedekind, Geffers, Ghyselinck, Bähre, Kamp, Neubert, Ricke-Hoch, Bauersachs and Riehle. 2025 Smolenski, Froese, Galuppo, Werlein, Gigina, Talbot, Erschow, Wedekind, Geffers, Ghyselinck, Bähre, Kamp, Neubert, Ricke-Hoch, Bauersachs and Riehle https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) Background Stimulated by retinoic acid gene 6 (STRA6) is a cell surface receptor that regulates cellular uptake of vitamin A metabolites and cardiac development. We hypothesized that Stra6 Methods MI was induced in mice with Stra6 lecithin-retinol acyltransferase (Lrat) Results Stra6 Stra6 Stra6 Conclusion The present study identifies an unexpected role for VitAD, which preserves Wnt signaling and attenuates cardiac rupture in Stra6 myocardial infarction heart failure cardiac remodeling wnt signaling vitamin A stimulated by retinoic acid gene 6 German Research Foundation RI 2417/4-1 Dr. Dorka Foundation The author(s) declare that financial support was received for the research and/or publication of this article. This research was supported by grants from the German Research Foundation (RI 2417/4-1) and the Dr. Dorka Foundation to CR. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Cardiovascular Epidemiology and Prevention 1 Introduction Vitamin A (retinol) is critical for the development and energy homeostasis of mammalian cells, as evidenced by growth retardation and congenital malformations, including cardiac defects, under vitamin A-deficient conditions ( 1 2 3 4 6 7 5 3 4 6 8 Retinol is also converted to retinoic acid (RA), which activates a broad transcriptional program by binding to the nuclear receptors retinoic acid receptor (RAR) and retinoid X receptor (RXR), which function as heterodimers that bind to retinoic acid response elements (RARE) located in the promoter regions of target genes ( 9 10 11 12 13 14 15 Stra6 Stra6 5 16 Stra6 17 19 Stra6 Stra6 2 Materials and methods 2.1 Animals Lrat Lrat −/− 20 Lrat −/− Stra6 Stra6 −/− Lrat Stra6 Lrat −/− Stra6 −/− 21 20 21 Stra6 −/− Lrat −/− ad libitum Guide for the Care and Use of Laboratory Animals 2.2 Quantitative RT-PCR analysis Total RNA from the infarct border zone was isolated using the NucleoSpin RNA kit (Macherey-Nagel, Düren, Germany) and cDNA synthesis was performed (MaximaTM H Minus First Strand cDNA Synthesis kit, Thermo Fisher Scientific, Waltham, MA, USA) according to the manufacturers’ instructions. Quantitative RT-PCR analysis was performed using the Luna® Universal qPCR Master Mix (New England Biolabs, Ipswich, MA, USA) and a LightCycler® 96 PCR system (Roche, Mannheim, Germany) ( 22 Supplementary Table S1 2.3 Measurement of retinoid levels Retinoids were extracted from liver tissue. All- trans trans 14 2.4 Coronary artery ligation MI was induced by left anterior descending coronary artery (LAD) ligation. Mice were pre-treated with metamizole (1A Pharma, Holzkirchen, Germany) dissolved in drinking water (500 mg/kg) the day before surgery. Before surgery, mice were treated by intraperitoneal injection of butorphanol (2 mg/kg; Cp-Pharma, Burgdorf, Germany) and subcutaneous injection of carprofen (5 mg/kg; Cp-Pharma, Burgdorf, Germany). Anesthesia was induced with 2%–4% isoflurane dissolved in oxygen. After oral intubation, mice were mechanically ventilated (MiniVent Type 683, Harvard Apparatus, Holliston, MA, USA), and anesthesia was maintained with 1%–4% isoflurane dissolved in oxygen. Mice were placed on a heating pad (37°C), and an eye care solution was applied to prevent corneal injury. Local anesthesia (a combination of 0.5% lidocaine and 0.25% bupivacaine) was applied before a left thoracotomy in the fifth intercostal space. After opening the pericardium, the LAD was ligated using a 6-0 Prolene suture (Ethicon, Norderstedt, Germany). MI was evident from LV discoloration. The thorax was closed, and mice recovered at 32°C. Animals received subcutaneous injections of carprofen (5 mg/kg) for an additional 3 days post-surgery. Sham-operated mice were subjected to similar surgery, except that no ligature around the LAD was placed. 2.5 Transthoracic echocardiography Transthoracic echocardiography was performed under isoflurane anesthesia (induced at a concentration of 5% and sustained with 1% isoflurane). Mice were placed in the supine position on a heating pad (37°C). An eye care solution was applied to prevent corneal injury. Two-dimensional B-mode images were acquired, and endocardial silhouettes were traced manually. Ejection fraction was determined in long-axis projection using the VevoStrain software (VisualSonics Inc.). LV end-diastolic area (LVEDA) and LV end-systolic area (LVESA) were determined in long-axis parasternal projections. Fractional area change (FAC) was calculated as [(LVEDA—LVESA)/LVEDA] * 100 ( 14 22 2.6 Histological analysis and quantification of cardiac fibrosis Paraffin sections of cardiac tissue were prepared, stained with hematoxylin and eosin (H&E) or Picrosirius red (PSR) staining solutions, and quantified as previously described ( 14 23 2.7 Immunoblotting analysis Protein extraction from the infarct border zone, immunoblotting, and densitometric analysis were performed as previously described ( 22 Supplementary Table S2 2.8 RNA sequencing Total RNA from the infarct border zone was isolated using the NucleoSpin RNA kit (Macherey-Nagel, Düren, Germany). Quality/integrity control of total RNA was performed using a 2100 Bioanalyzer System (Agilent Technologies, Waldbronn, Germany) ( 22 TM 7 https://www.bioinformatics.babraham.ac.uk/projects/fastqc https://expressionanalysis.github.io/ea-utils/ 24 25 26 27 28 31 32 40 https://digitalinsights.qiagen.com/products-overview/discovery-insights-portfolio/analysis-and-visualization/qiagen-ipa https://www.genome.jp/kegg 41 44 P p 2.9 Statistics Data are expressed as mean ± SEM. Two-way ANOVA was performed to analyze differences after Stra6 −/− Lrat −/− Stra6 −/− Stra6 −/− post hoc Stra6 post hoc p 3 Results 3.1 Induction of VitAD independent of Stra6 RT-PCR analysis of LV tissue confirmed deletion of Lrat Lrat −/− Stra6 Stra6 −/− Figures 1A,B 45 46 Lrat Lrat −/− 15 20 47 48 Stra6 Lrat −/− Stra6 −/− Stra6 −/− Stra6 −/− Figure 1C trans trans Stra6 −/− trans Stra6 −/− Stra6 −/− trans Stra6 −/− Stra6 −/− Figures 1D,E Stra6 49 51 Cyp26a1 p Supplementary Figure S1 Figure 1 Experimental setup and induction of vitamin A deficiency. (A,B) Lrat Stra6 Gapdh Stra6 Stra6 −/− Lrat Lrat −/− n p Stra6 +/+ Lrat p Lrat +/+ Stra6 Stra6 −/− Lrat −/− p Stra6 −/− p Lrat −/− p Stra6 −/− Lrat −/− (C) Lrat −/− (D) trans (E) trans n p Stra6 Stra6 −/− p Graphs A and B show mRNA expression of Lrat and Stra6, with fold change vs. WT, highlighting differences in expression across WT, Stra6-/-, Lrat-/-, and DKO groups. Graph C outlines dietary conditions and surgical timeline for different genotypes. Graphs D and E display levels of all-trans-retinal and all-trans-retinol in pmol/mg tissue, comparing WT, Stra6-/-, and vitamin A-deficient groups. 3.2 VitAD attenuates increased mortality in Stra6 −/− Following ischemic injury, we observed increased mortality in Stra6 −/− Figure 2A Stra6 −/− Stra6 Figures 2B–D Supplementary Table S3 Figures 2E,F Supplementary Table S3 Figure 2G Supplementary Table S4 Figures 2H,I Stra6 Stra6 Supplementary Figure S2 Figures 2J,K 18 Stat5a 17 17 19 52 53 Stra6 Stra6 Supplementary Figure S3 Stra6 Stra6 −/− Figure 2 Vitamin A deficiency attenuates increased mortality in Stra6 −/− (A) n (B) (C,D) n (E,F) n (G) n (H,I) (H) Nppa (I) Nppb Gapdh n (J) n (K) p Stra6 p Stra6 +/+ p Stra6 Stra6 −/− p p Stra6 −/− Stra6 −/− p This image contains multiple panels illustrating a study on cardiac function. Panel A shows a survival curve comparing different groups post-surgery. Panel B displays ultrasound images of heart sections across four groups (WT, Stra6-/-, VitAD, and Stra6-/-×VitAD) under sham and myocardial infarction (MI) conditions. Panels C-F show graphs of left ventricular end-diastolic area (LVEDA) and ejection fraction at 3 and 4 weeks. Panel G presents heart weight to tibia length ratios. Panels H and I show mRNA expression changes for Nppa and Nppb. Panel J depicts fibrosis percentages. Panel K features histopathology images of heart tissue stained with PSR and H&E. 3.3 VitAD reverses the decrease in Wnt signaling in Stra6 To delineate the mechanisms contributing to cardiac rupture in Stra6- Supplementary Table S5 Figure 3A Figure 3B Supplementary Table S6 p Supplementary Table S7 Supplementary Figure S4A Supplementary Figure S4B Figure 3 Gene expression 3 days post-surgery as determined by RNA sequencing. (A) Stra6 n (B) (C–N) 2 n 2 2 A series of charts and graphs analyzing gene expression data. Panel A displays a principal component analysis plot with groups distinguished by color-coded ellipses. Panel B features a heatmap illustrating the expression levels across different conditions. Panels C to N contain scatter plots with log2 fold change against the mean of normalized counts, highlighting differential expression with red and blue dots. Each plot compares different groups, marked with titles indicating the specific comparisons. Data points are categorized based on statistical significance and magnitude of change. We explored differences in gene expression using pairwise comparisons of groups. We investigated 12 comparisons representing differences in surgery performed (comparisons I–IV), in Stra6 Figures 3C–N Stra6 −/− Stra6 −/− Stra6 −/− Stra6 −/− Figures 3C–F Figures 3G–N Stra6 Supplementary Figure S5 Supplementary Table S6 Stra6 Supplementary Figure S6 Next, we focused on differentially expressed genes between MI-operated groups (comparisons VI, VIII, X, and XII; Figure 4A Supplementary Table S8 Stra6 −/− Stra6 Stra6 −/− Stra6 −/− Figures 4B,C 2 p Figure 4A Figures 4D,E Supplementary Table S8 2 p Figure 4D 2 p Figure 4F Figure 4B Wnt5b, Wnt9b, secreted frizzled-related protein (Sfrp5) Figure 4G 54 58 Figure 4H Stra6 Wnt5b, Wnt9b, Sfrp5 Figure 4 Differential gene expression analysis 3 days post-ischemic injury as determined by RNA sequencing. (A) 2 p (B–D) 2 p (E) Stra6 −/− Stra6 −/− Stra6 −/− 2 p n (F) Stra6 −/− x y 2 p Stra6 (G) 2 n p (H) n p Venn diagram (A) shows the regulation of transcripts with comparisons of different conditions. Bar charts (B, C, D) illustrate pathways with p-values. Heatmap (E) displays transcript expression levels. Line graph (F) indicates enrichment scores for gene sets. Bar graphs (G) show log fold changes in Wnt signaling pathway genes. Scatter plots (H) present expression data with statistical significance marked by asterisks. 4 Discussion The impact of Stra6 Stra6- Stra6 56 57 Stra6 59 60 57 61 57 61 2+ 56 61 56 56 The present study identified decreased Wnt5b Wnt9b Stra6- Wnt5b Wnt9b 58 Wnt5b Wnt9b Stra6- Sfrp5 Stra6- Sfrp5 54 55 Sfrp5 Stra6- α 62 63 64 Stra6 Stra6 STRA6 mutations cause Matthew-Wood syndrome, which is characterized by malformations, including congenital heart defects ( 16 Lrat Stra6 −/− Cyp26a1 Stra6 −/− Stra6 21 65 68 69 Limitations of the present study include investigating adult male mice at a relatively young age. This contrasts with patients, who typically suffer from MI and ischemic heart disease at a higher age. Also, sex-related differences in cardiac function post-MI have been reported for murine models, with male mice exhibiting impaired contractile function during decompensation to HF relative to female mice ( 70 71 Stra6 71 Stra6 Lrat −/− 47 45 46 trans trans Stra6 −/− Stra6 Lrat, Stra6 72 73 In summary, present study identifies an unexpected role for VitAD, which preserves Wnt signaling and attenuates cardiac rupture in Stra6 Figure 5 Stra6 Figure 5 Relationship between Stra6 expression and vitamin A deficiency following ischemic heart injury. Stra6 Stra6 Servier Medical Art CC BY 3.0 Diagram illustrating the impact of vitamin A deficiency on the heart. On the left, the lack of Stra6 gene leads to decreased Wnt signaling and myocardial rupture. On the right, vitamin A deficiency increases Wnt signaling, resulting in survival. Acknowledgments The authors thank Anja Guba-Quint, Melanie Killies, and Silke Pretzer for technical assistance. Data availability statement The original contributions presented in the study are publicly available. This data can be found here: GEO ( https://www.ncbi.nlm.nih.gov/geo/ GSE307187 Ethics statement The animal study was approved by Niedersächsisches Landesamt für Verbraucherschutz und Lebensmittelsicherheit (protocol numbers: 23/00360 and 24/00719). The study was conducted in accordance with the local legislation and institutional requirements. Author contributions YS: Data curation, Formal analysis, Investigation, Methodology, Project administration, Writing – review & editing. NF: Data curation, Formal analysis, Investigation, Methodology, Project administration, Writing – review & editing. PG: Data curation, Formal analysis, Investigation, Methodology, Visualization, Writing – review & editing. CW: Data curation, Formal analysis, Investigation, Methodology, Writing – review & editing. AG: Data curation, Formal analysis, Investigation, Methodology, Writing – review & editing. ST: Formal analysis, Writing – review & editing. SE: Data curation, Formal analysis, Investigation, Methodology, Writing – review & editing. DW: Data curation, Formal analysis, Investigation, Methodology, Writing – review & editing. RG: Data curation, Formal analysis, Investigation, Methodology, Writing – review & editing. NG: Resources, Writing – review & editing. HB: Data curation, Formal analysis, Investigation, Methodology, Writing – review & editing. JK: Data curation, Formal analysis, Investigation, Methodology, Writing – review & editing. LN: Data curation, Formal analysis, Investigation, Methodology, Writing – review & editing. MR-H: Resources, Writing – review & editing. JB: Resources, Writing – review & editing. CR: Conceptualization, Data curation, Formal analysis, Funding acquisition, Methodology, Project administration, Resources, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fcvm.2025.1626769/full#supplementary-material References 1. Clagett-Dame M DeLuca HF The role of vitamin A in mammalian reproduction and embryonic development Annu Rev Nutr 2002 22 347 81 10.1146/annurev.nutr.22.010402.102745E 12055350 2. Wilson JG Warkany J Aortic-arch and cardiac anomalies in the offspring of vitamin A deficient rats Am J Anat 1949 85 1 113 55 10.1002/aja.1000850106 18138113 3. O'Byrne SM Blaner WS Retinol and retinyl esters: biochemistry and physiology J Lipid Res 2013 54 7 1731 43 10.1194/jlr.R037648 23625372 PMC3679378 4. Li Y Wongsiriroj N Blaner WS The multifaceted nature of retinoid transport and metabolism Hepatobiliary Surg Nutr 2014 3 3 126 39 10.3978/j.issn.2304-3881.2014.05.04 25019074 PMC4073323 5. Kawaguchi R Yu J Honda J Hu J Whitelegge J Ping P A membrane receptor for retinol binding protein mediates cellular uptake of vitamin A Science 2007 315 5813 820 5 10.1126/science.1136244 17255476 6. Kelly M von Lintig J STRA6: role in cellular retinol uptake and efflux Hepatobiliary Surg Nutr 2015 4 4 229 42 10.3978/j.issn.2304-3881.2015.01.12 26312242 PMC4526761 7. van Bennekum AM Wei S Gamble MV Vogel S Piantedosi R Gottesman M Biochemical basis for depressed serum retinol levels in transthyretin-deficient mice J Biol Chem 2001 276 2 1107 13 10.1074/jbc.M008091200 11036082 8. Kawaguchi R Zhong M Kassai M Ter-Stepanian M Sun H STRA6-catalyzed vitamin A influx, efflux, and exchange J Membr Biol 2012 245 11 731 45 10.1007/s00232-012-9463-1 22815070 PMC3770467 9. Zhang R Wang Y Li R Chen G Transcriptional factors mediating retinoic acid signals in the control of energy metabolism Int J Mol Sci 2015 16 6 14210 44 10.3390/ijms160614210 26110391 PMC4490549 10. Parker LE Papanicolaou KN Zalesak-Kravec S Weinberger EM Kane MA Foster DB Retinoic acid signaling and metabolism in heart failure Am J Physiol Heart Circ Physiol 2025 328 4 H792 813 10.1152/ajpheart.00871.2024 39933792 PMC12306655 11. Choudhary R Palm-Leis A Scott RC 3rd Guleria RS Rachut E Baker KM All-trans retinoic acid prevents development of cardiac remodeling in aortic banded rats by inhibiting the renin-angiotensin system Am J Physiol Heart Circ Physiol 2008 294 2 H633 44 10.1152/ajpheart.01301.2007 18156191 12. Paiva SA Matsubara LS Matsubara BB Minicucci MF Azevedo PS Campana AO Retinoic acid supplementation attenuates ventricular remodeling after myocardial infarction in rats J Nutr 2005 135 10 2326 8 10.1093/jn/135.10.2326 16177190 13. Minicucci MF Azevedo PS Oliveira SA Jr. Martinez PF Chiuso-Minicucci F Polegato BF Tissue vitamin A insufficiency results in adverse ventricular remodeling after experimental myocardial infarction Cell Physiol Biochem 2010 26 4–5 523 30 10.1159/000322320 21063090 14. Naasner L Froese N Hofmann W Galuppo P Werlein C Shymotiuk I Vitamin A preserves cardiac energetic gene expression in a murine model of diet-induced obesity Am J Physiol Heart Circ Physiol 2022 323 6 H1352 64 10.1152/ajpheart.00514.2022 36399384 PMC11687967 15. Asson-Batres MA Ryzhov S Tikhomirov O Duarte CW Congdon CB Lessard CR Effects of vitamin A deficiency in the postnatal mouse heart: role of hepatic retinoid stores Am J Physiol Heart Circ Physiol 2016 310 11 H1773 89 10.1152/ajpheart.00887.2015 27084391 PMC4935514 16. Pasutto F Sticht H Hammersen G Gillessen-Kaesbach G Fitzpatrick DR Nurnberg G Mutations in STRA6 cause a broad spectrum of malformations including anophthalmia, congenital heart defects, diaphragmatic hernia, alveolar capillary dysplasia, lung hypoplasia, and mental retardation Am J Hum Genet 2007 80 3 550 60 10.1086/512203 17273977 PMC1821097 17. Yamaura G Turoczi T Yamamoto F Siddqui MA Maulik N Das DK STAT Signaling in ischemic heart: a role of STAT5A in ischemic preconditioning Am J Physiol Heart Circ Physiol 2003 285 2 H476 82 10.1152/ajpheart.00079.2003 12860560 18. Berry DC Jin H Majumdar A Noy N Signaling by vitamin A and retinol-binding protein regulates gene expression to inhibit insulin responses Proc Natl Acad Sci U S A 2011 108 11 4340 5 10.1073/pnas.1011115108 21368206 PMC3060239 19. Zhang J Liu XB Cheng C Xu DL Lu QH Ji XP Rho-kinase inhibition is involved in the activation of PI3-kinase/akt during ischemic-preconditioning-induced cardiomyocyte apoptosis Int J Clin Exp Med 2014 7 11 4107 14 25550920 PMC4276178 20. Batten ML Imanishi Y Maeda T Tu DC Moise AR Bronson D Lecithin-retinol acyltransferase is essential for accumulation of all-trans-retinyl esters in the eye and in the liver J Biol Chem 2004 279 11 10422 32 10.1074/jbc.M312410200 14684738 PMC1351249 21. Berry DC Jacobs H Marwarha G Gely-Pernot A O'Byrne SM DeSantis D The STRA6 receptor is essential for retinol-binding protein-induced insulin resistance but not for maintaining vitamin A homeostasis in tissues other than the eye J Biol Chem 2013 288 34 24528 39 10.1074/jbc.M113.484014 23839944 PMC3750151 22. Froese N Szaroszyk M Galuppo P Visker JR Werlein C Korf-Klingebiel M Hypoxia attenuates pressure overload-induced heart failure J Am Heart Assoc 2024 13 3 e033553 10.1161/JAHA.123.033553 38293923 PMC11056135 23. Froese N Cordero J Abouissa A Trogisch FA Grein S Szaroszyk M Analysis of myocardial cellular gene expression during pressure overload reveals matrix based functional intercellular communication iScience 2022 25 3 103965 10.1016/j.isci.2022.103965 35281736 PMC8908217 24. Dobin A Davis CA Schlesinger F Drenkow J Zaleski C Jha S STAR: ultrafast universal RNA-Seq aligner Bioinformatics 2013 29 1 15 21 10.1093/bioinformatics/bts635 23104886 PMC3530905 25. R Core Team R: A Language and Environment for Statistical Computing Vienna, Austria R Foundation for Statistical Computing 2020 Available online at: https://www.R-project.org/ 26. Durinck S Moreau Y Kasprzyk A Davis S De Moor B Brazma A Biomart and bioconductor: a powerful link between biological databases and microarray data analysis Bioinformatics 2005 21 16 3439 40 10.1093/bioinformatics/bti525 16082012 27. Liao Y Smyth GK Shi W Featurecounts: an efficient general purpose program for assigning sequence reads to genomic features Bioinformatics 2014 30 7 923 30 10.1093/bioinformatics/btt656 24227677 28. Love MI Huber W Anders S Moderated estimation of fold change and dispersion for RNA-Seq data with DESeq2 Genome Biol 2014 15 12 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 29. Fraccarollo D Neuser J Moller J Riehle C Galuppo P Bauersachs J Expansion of CD10(neg) neutrophils and CD14(+)HLA-DR(neg/low) monocytes driving proinflammatory responses in patients with acute myocardial infarction Elife 2021 10 1 31 10.7554/eLife.66808 PMC8324297 34289931 30. Galuppo P Vettorazzi S Hovelmann J Scholz CJ Tuckermann JP Bauersachs J The glucocorticoid receptor in monocyte-derived macrophages is critical for cardiac infarct repair and remodeling FASEB J 2017 31 11 5122 32 10.1096/fj.201700317R 28768721 PMC5636710 31. Fraccarollo D Thomas S Scholz CJ Hilfiker-Kleiner D Galuppo P Bauersachs J Macrophage mineralocorticoid receptor is a pleiotropic modulator of myocardial infarct healing Hypertension 2019 73 1 102 11 10.1161/HYPERTENSIONAHA.118.12162 30543467 PMC6291261 32. Gudas LJ Retinoids and vertebrate development J Biol Chem 1994 269 22 15399 402 10.1016/S0021-9258(17)40689-2 7910825 33. Chambon P A decade of molecular biology of retinoic acid receptors FASEB J 1996 10 9 940 54 10.1096/fasebj.10.9.8801176 8801176 34. Budhu AS Noy N Direct channeling of retinoic acid between cellular retinoic acid-binding protein II and retinoic acid receptor sensitizes mammary carcinoma cells to retinoic acid-induced growth arrest Mol Cell Biol 2002 22 8 2632 41 10.1128/MCB.22.8.2632-2641.2002 11909957 PMC133717 35. Balmer JE Blomhoff R Gene expression regulation by retinoic acid J Lipid Res 2002 43 11 1773 808 10.1194/jlr.R100015-JLR200 12401878 36. Sandell LL Sanderson BW Moiseyev G Johnson T Mushegian A Young K RDH10 Is essential for synthesis of embryonic retinoic acid and is required for limb, craniofacial, and organ development Genes Dev 2007 21 9 1113 24 10.1101/gad.1533407 17473173 PMC1855236 37. Niederreither K Dolle P Retinoic acid in development: towards an integrated view Nat Rev Genet 2008 9 7 541 53 10.1038/nrg2340 18542081 38. Adams MK Belyaeva OV Wu L Kedishvili NY The retinaldehyde reductase activity of DHRS3 is reciprocally activated by retinol dehydrogenase 10 to control retinoid homeostasis J Biol Chem 2014 289 21 14868 80 10.1074/jbc.M114.552257 24733397 PMC4031538 39. Stefanovic S Zaffran S Mechanisms of retinoic acid signaling during cardiogenesis Mech Dev 2017 143 9 19 10.1016/j.mod.2016.12.002 28007475 40. Blaner WS Vitamin A signaling and homeostasis in obesity, diabetes, and metabolic disorders Pharmacol Ther 2019 197 153 78 10.1016/j.pharmthera.2019.01.006 30703416 PMC6520171 41. Subramanian A Tamayo P Mootha VK Mukherjee S Ebert BL Gillette MA Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles Proc Natl Acad Sci U S A 2005 102 43 15545 50 10.1073/pnas.0506580102 16199517 PMC1239896 42. Mootha VK Lindgren CM Eriksson KF Subramanian A Sihag S Lehar J PGC-1alpha-responsive genes involved in oxidative phosphorylation are coordinately downregulated in human diabetes Nat Genet 2003 34 3 267 73 10.1038/ng1180 12808457 43. Riehle C Weatherford ET McCarty NS Seei A Jaishy BP Manivel R Insulin and insulin-like growth factor 1 signaling preserves sarcomere integrity in the adult heart Mol Cell Biol 2022 42 10 e0016322 10.1128/mcb.00163-22 36125265 PMC9583714 44. Fraccarollo D Geffers R Galuppo P Bauersachs J Mineralocorticoid receptor promotes cardiac macrophage inflammaging Basic Res Cardiol 2024 119 2 243 60 10.1007/s00395-024-01032-6 38329499 PMC11008080 45. Tanumihardjo SA Russell RM Stephensen CB Gannon BM Craft NE Haskell MJ Biomarkers of nutrition for development (BOND)-vitamin A review J Nutr 2016 146 9 1816S 48 10.3945/jn.115.229708 27511929 PMC4997277 46. Tanumihardjo SA Vitamin A: biomarkers of nutrition for development Am J Clin Nutr 2011 94 2 658S 65 10.3945/ajcn.110.005777 21715511 PMC3142734 47. O'Byrne SM Wongsiriroj N Libien J Vogel S Goldberg IJ Baehr W Retinoid absorption and storage is impaired in mice lacking lecithin:retinol acyltransferase (LRAT) J Biol Chem 2005 280 42 35647 57 10.1074/jbc.M507924200 16115871 PMC1352312 48. Liu L Gudas LJ Disruption of the lecithin:retinol acyltransferase gene makes mice more susceptible to vitamin A deficiency J Biol Chem 2005 280 48 40226 34 10.1074/jbc.M509643200 16174770 49. Abu-Abed S Dolle P Metzger D Beckett B Chambon P Petkovich M The retinoic acid-metabolizing enzyme, CYP26A1, is essential for normal hindbrain patterning, vertebral identity, and development of posterior structures Genes Dev 2001 15 2 226 40 10.1101/gad.855001 11157778 PMC312609 50. Emoto Y Wada H Okamoto H Kudo A Imai Y Retinoic acid-metabolizing enzyme Cyp26a1 is essential for determining territories of hindbrain and spinal cord in zebrafish Dev Biol 2005 278 2 415 27 10.1016/j.ydbio.2004.11.023 15680360 51. Kedishvili NY Enzymology of retinoic acid biosynthesis and degradation J Lipid Res 2013 54 7 1744 60 10.1194/jlr.R037028 23630397 PMC3679379 52. Zhou Y Zhou R Wang N Zhao T Qiu P Gao C Inhibition of STRA6 suppresses NSCLC growth via blocking STAT3/SREBP-1c axis-mediated lipogenesis Mol Cell Biochem 2025 480 3 1715 30 10.1007/s11010-024-05085-y 39168951 53. Kleinbongard P Perspective: mitochondrial STAT3 in cardioprotection Basic Res Cardiol 2023 118 1 32 10.1007/s00395-023-01003-3 37620559 PMC10449977 54. Nakamura K Sano S Fuster JJ Kikuchi R Shimizu I Ohshima K Secreted frizzled-related protein 5 diminishes cardiac inflammation and protects the heart from ischemia/reperfusion injury J Biol Chem 2016 291 6 2566 75 10.1074/jbc.M115.693937 26631720 PMC4742726 55. Tong S Ji Q Du Y Zhu X Zhu C Zhou Y Sfrp5/wnt pathway: a protective regulatory system in atherosclerotic cardiovascular disease J Interferon Cytokine Res 2019 39 8 472 82 10.1089/jir.2018.0154 31199714 PMC6660834 56. Daskalopoulos EP Blankesteijn WM Effect of interventions in WNT signaling on healing of cardiac injury: a systematic review Cells 2021 10 2 1 27 10.3390/cells10020207 PMC7912185 33494313 57. Ni B Sun M Zhao J Wang J Cao Z The role of beta-catenin in cardiac diseases Front Pharmacol 2023 14 1157043 10.3389/fphar.2023.1157043 37033656 PMC10073558 58. Akoumianakis I Polkinghorne M Antoniades C Non-canonical WNT signalling in cardiovascular disease: mechanisms and therapeutic implications Nat Rev Cardiol 2022 19 12 783 97 10.1038/s41569-022-00718-5 35697779 PMC9191761 59. Lin L Xiao J Shi L Chen W Ge Y Jiang M STRA6 exerts oncogenic role in gastric tumorigenesis by acting as a crucial target of miR-873 J Exp Clin Cancer Res 2019 38 1 452 10.1186/s13046-019-1450-2 31694721 PMC6836487 60. Szeto W Jiang W Tice DA Rubinfeld B Hollingshead PG Fong SE Overexpression of the retinoic acid-responsive gene Stra6 in human cancers and its synergistic induction by wnt-1 and retinoic acid Cancer Res 2001 61 10 4197 205 11358845 61. Suthon S Perkins RS Bryja V Miranda-Carboni GA Krum SA WNT5B In physiology and disease Front Cell Dev Biol 2021 9 667581 10.3389/fcell.2021.667581 34017835 PMC8129536 62. Lu Y Bertran S Samuels TA Mira-y-Lopez R Farias EF Mechanism of inhibition of MMTV-neu and MMTV-wnt1 induced mammary oncogenesis by RARalpha agonist AM580 Oncogene 2010 29 25 3665 76 10.1038/onc.2010.119 20453882 PMC2891995 63. Lorberbaum DS Kishore S Rosselot C Sarbaugh D Brooks EP Aragon E Retinoic acid signaling within pancreatic endocrine progenitors regulates mouse and human beta cell specification Development 2020 147 12 1 10 10.1242/dev.189977 PMC7328135 32467243 64. Osei-Sarfo K Gudas LJ Retinoic acid suppresses the canonical wnt signaling pathway in embryonic stem cells and activates the noncanonical wnt signaling pathway Stem Cells 2014 32 8 2061 71 10.1002/stem.1706 24648413 PMC4106995 65. Lambadiari V Kadoglou NP Stasinos V Maratou E Antoniadis A Kolokathis F Serum levels of retinol-binding protein-4 are associated with the presence and severity of coronary artery disease Cardiovasc Diabetol 2014 13 121 10.1186/s12933-014-0121-z 25142320 PMC4156962 66. Cubedo J Padro T Cinca J Mata P Alonso R Badimon L Retinol-binding protein 4 levels and susceptibility to ischaemic events in men Eur J Clin Invest 2014 44 3 266 75 10.1111/eci.12229 24720534 67. Pan Y Wang L Xie Y Tan Y Chang C Qiu X Characterization of differentially expressed plasma proteins in patients with acute myocardial infarction J Proteomics 2020 227 103923 10.1016/j.jprot.2020.103923 32736138 68. Wang H Zhou P Zou D Liu Y Lu X Liu Z The role of retinol-binding protein 4 and its relationship with sex hormones in coronary artery disease Biochem Biophys Res Commun 2018 506 1 204 10 10.1016/j.bbrc.2018.09.159 30342852 69. Zhang KZ Shen XY Wang M Wang L Sun HX Li XZ Retinol-binding protein 4 promotes cardiac injury after myocardial infarction via inducing cardiomyocyte pyroptosis through an interaction with NLRP3 J Am Heart Assoc 2021 10 22 e022011 10.1161/JAHA.121.022011 34726071 PMC8751920 70. DeLeon-Pennell KY Lindsey ML Somewhere over the sex differences rainbow of myocardial infarction remodeling: hormones, chromosomes, inflammasome, oh my Expert Rev Proteomics 2019 16 11–12 933 40 10.1080/14789450.2019.1664293 31483157 PMC7007969 71. Shioura KM Geenen DL Goldspink PH Sex-related changes in cardiac function following myocardial infarction in mice Am J Physiol Regul Integr Comp Physiol 2008 295 2 R528 34 10.1152/ajpregu.90342.2008 18550865 PMC2519934 72. Huang Z Liu Y Qi G Brand D Zheng SG Role of vitamin A in the immune system J Clin Med 2018 7 9 1 16 10.3390/jcm7090258 PMC6162863 30200565 73. Brossaud J Pallet V Corcuff JB Vitamin A, endocrine tissues and hormones: interplay and interactions Endocr Connect 2017 6 7 R121 30 10.1530/EC-17-0101 28720593 PMC5551430 ",
  "metadata": {
    "Title of this paper": "Vitamin A, endocrine tissues and hormones: interplay and interactions",
    "Journal it was published in:": "Frontiers in Cardiovascular Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479519/"
  }
}