{
  "title": "Paper_998",
  "abstract": "pmc BMC Cancer BMC Cancer 16 bmccanc BMC Cancer 1471-2407 BMC PMC12481729 PMC12481729.1 12481729 12481729 41029533 10.1186/s12885-025-14785-7 14785 1 Research Enhanced prognosis prediction model in esophageal cancer via lymph node assessment post-neoadjuvant Zhou Yehan 1 Xiao Meng 2 Li Jiayu 1 Yang Hong 1 Wang Yi 3 Wang Qifeng 3 Leng Xuefeng 4 He Wenwu 4 Han Yongyao 4 Huang Zongyao huangzongyao@scszlyy.org.cn 1 Liu Yang liuyanglyon@uestc.edu.cn 1 1 https://ror.org/04qr3zq92 grid.54549.39 0000 0004 0369 4060 Department of Pathology, Sichuan Cancer Center, School of Medicine, Sichuan Cancer Hospital & Institute, University of Electronic Science and Technology of China, 2 https://ror.org/01qh26a66 grid.410646.1 0000 0004 1808 0950 The Geriatric Respiratory Department, Sichuan academy of medical sciences and Sichuan Provincial People’s Hospital, 3 https://ror.org/04qr3zq92 grid.54549.39 0000 0004 0369 4060 Department of Radiotherapy, Sichuan Cancer Center, School of Medicine, Sichuan Cancer Hospital & Institute, University of Electronic Science and Technology of China, 4 https://ror.org/04qr3zq92 grid.54549.39 0000 0004 0369 4060 Department of Thoracic Surgery, Sichuan Cancer Center, School of Medicine, Sichuan Cancer Hospital & Institute, University of Electronic Science and Technology of China, 30 9 2025 2025 25 478185 1468 24 8 2024 31 7 2025 30 09 2025 01 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Abstract Develop an improved lymph node evaluation system for prognosis prediction in esophageal squamous cell carcinoma (ESCC) patients receiving neoadjuvant therapy. Methods Studied 282 ESCC patients who underwent neoadjuvant chemoradiotherapy (NCRT) and surgery. Evaluated lymph node factors like number, size, location, and intra-nodal cancer status. Developed and validated a prognostic model using these factors. Results Cases with a clearance of 17–30 lymph nodes during surgery showed improved overall survival (OS) compared to those with fewer than 17 or more than 30 cleared nodes. Patients with a lower tumor regression grade of lymph nodes (LN-TRG) experienced improved OS and recurrence-free survival (RFS). Patients with LN extracapsular invasion had worse OS and RFS. Abdominal lymph nodes showed the highest ratio of residual cancer, highest hazard ratio (HR), and the largest number and proportion of positive cases. The five most relevant factors for prognosis, as revealed by Lasso regression and Cox univariate analysis, were LN-TRG, LN total tumor diameter, the clearance of 17–30 lymph nodes, the proportion of positive lymph nodes, and LN extracapsular invasion. The predictive model, based on these factors, achieved good risk stratification for OS and RFS (AUC = 0.705, 0.679), surpassing pathology N (pN) staging. Conclusion A comprehensive lymph node assessment using a predictive model enables improved prognosis prediction and risk stratification compared to pN staging for patients undergoing neoadjuvant therapy. This approach contributes to the accurate evaluation of clinical prognosis and assists in guiding treatment strategies. Supplementary Information The online version contains supplementary material available at 10.1186/s12885-025-14785-7. Keywords Predictive model Neoadjuvant chemoradiotherapy Esophageal cancer Prognosis Lymph nodes Scientific Research Funds project of Science and Technology Department of Sichuan Province (2021YJ0121) Liu Yang pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Almost half of esophageal cancer cases globally occur in China, ranking fourth in cancer-related deaths. Diagnosis is often late, worsening prognosis [ 1 2 3 4 6 7 8 9 Lymph node status is crucial in prognosis and risk stratification. In neoadjuvant therapy patients, its impact on recurrence may exceed that of the primary tumor [ 7 9 10 11 12 13 For neoadjuvant therapy patients, primary tumor (PT) and lymph node (LN) status are vital for prognosis. However, no standardized LN-focused prognostic system exists. This study aims to evaluate LN status, identify prognostic factors, and develop a predictive model to facilitate precise prognosis and guide clinical treatment decisions. Study subjects and methods Subjects We analyzed 282 esophageal cancer patients from Sichuan Cancer Hospital, treated surgically from June 2017 to June 2021. They had primary, locally-advanced esophageal squamous cell carcinoma, no other malignancies, underwent neoadjuvant chemo-radiotherapy, curative esophagectomy, and had no distant metastasis. All patients received 1.99 ± 0.52 cycles of neoadjuvant chemotherapy. They underwent image-guided IMRT for the primary tumor, positive lymph nodes, subclinical lesions, and lymph node drainage areas. Radiation doses were: GTV 2.0 Gy/f, GTVInL 2.0 Gy/f, GTVInR 2.0 Gy/f, CTV 1.8 Gy/f. Total dose was 40.49 ± 1.75 Gy in 20.32 ± 1.14 sessions. Methods Specimen processing included formalin fixation, paraffin embedding, sectioning, and H&E staining. Tumor regression grading followed the Becker criteria: Grade 1 (0% residual), Grade 2 (< 10% residual), Grade 3 (10%−50% residual), and Grade 4 (> 50% residual) [ 14 P Data analysis We analyzed RFS and OS using Cox, Kaplan-Meier, and log-rank tests. We split the data 50–50 into training and validation sets. We selected variables via univariate and LASSO regression, then built a predictive model. The optimal lambda (λ) value for LASSO regression was selected through 10-fold cross-validation with the “minimum MSE” criterion (R package glmnet). Model performance was assessed using ROC curves. All analyses were done in R and Free Statistics. RFS was defined as time from surgery to recurrence/death, while OS was time from surgery to death. A p Results In all patients, the number of lymph node dissections ranged from 2 to 44, with an average of 18.54 ± 8.28 nodes. The curve analysis revealed a non-linear relationship between the number of lymph node dissections and HR values for OS and RFS. An optimal range of 17 to 30 lymph node dissections was associated with a favorable OS (HR < 1), while fewer than 17 or more than 30 dissections were unfavorable (HR > 1), particularly for OS. However, this effect was less pronounced for RFS (Fig. 1 P P 1 1 1 1  Fig. 1 HR for OS was lower and survival was higher when the number of dissected lymph nodes was between 17 and 30. When the number of dissected lymph nodes was less than 17 or more than 30, the HR of OS was higher and the survival rate was lower ( AC BD EF GH  Table 1 Univariate analysis of OS and RFS Item OS RFS HR(95%CI) P P HR(95%CI) P P Sex: Male vs. Female 0.75 (0.36,1.56) 0.443 0.426 0.67 (0.35,1.29) 0.233 0.209 Age: >65 vs. ≤ 65 1.03 (0.62,1.71) 0.901 0.902 1.12 (0.73,1.71) 0.615 0.618 Smoking: Yes vs. No 1.33 (0.78,2.26) 0.302 0.291 1.08 (0.7,1.68) 0.728 0.727 Drinking: Yes vs. No 1.24 (0.74,2.08) 0.41 0.403 1.17 (0.75,1.81) 0.49 0.486 Location: ref.=Up 0.279 0.211 Middle 1.64 (0.76,3.55) 0.207 1.75 (0.88,3.48) 0.112 Low 1.18 (0.54,2.59) 0.674 1.37 (0.69,2.74) 0.368 Differentiation: well- Middle vs. Poor 1.21 (0.76,1.93) 0.42 0.421 1.19 (0.79,1.78) 0.405 0.407 Surgical Margin: Positive vs. Negative 2.64 (0.65,10.79) 0.177 0.241 1.78 (0.44,7.24) 0.42 0.46 cT: ref.=T2 0.31 0.392 T3 1.72 (0.54,5.53) 0.361 0.81 (0.39,1.68) 0.567 T4a 1.79 (0.47,6.76) 0.389 0.67 (0.25,1.78) 0.416 T4b 3.1 (0.84,11.45) 0.09 1.36 (0.55,3.39) 0.507 cN: ref.=N0 0.164 0.288 N1 0.59 (0.18,2) 0.4 0.89 (0.27,2.92) 0.85 N2 0.6 (0.18,1.96) 0.396 0.79 (0.24,2.55) 0.694 N3 1.2 (0.34,4.2) 0.777 1.43 (0.42,4.94) 0.57 ypT: ref.=T0 0.217 0.016 T1 1.1 (0.53,2.31) 0.795 1.4 (0.76,2.6) 0.285 T2 0.89 (0.43,1.86) 0.757 0.81 (0.41,1.57) 0.531 T3 1.78 (1.03,3.09) 0.039 1.9 (1.17,3.09) 0.009 T4 1.79 (0.24,13.28) 0.569 3.49 (1.06,11.44) 0.039 ypN: ref.=N0 0.008 N1 1.88 (1.1,3.2) 0.02 1.99 (1.26,3.15) 0.003 N2 2.21 (1.1,4.44) 0.025 2.76 (1.52,5) N3 8.38 (1.98,35.34) 0.004 5.64 (1.36,23.46) 0.017 pCR: Yes vs. No 1.34 (0.79,2.26) 0.275 0.265 1.57 (0.98,2.51) 0.06 0.051 LN-TRG: ref.= 0 0.008 1 1.31 (0.54,3.15) 0.548 0.95 (0.4,2.25) 0.915 2 1.12 (0.39,3.15) 0.837 1.05 (0.42,2.65) 0.919 3 2.26 (1.04,4.89) 0.039 3.36 (1.84,6.14) 4 2.77 (1.6,4.81) 2.8 (1.73,4.54) LN average diameter (cont. var.) 0.45 (0.12,1.67) 0.232 0.225 0.54 (0.17,1.66) 0.28 0.274 LN max diameter (cont. var.) 0.79 (0.52,1.2) 0.265 0.262 0.84 (0.59,1.2) 0.344 0.341 LN total tumor diameter (cont. var.) 3.09 (1.9,5.03) 3.26 (2.17,4.9) LN extracapsular invasion: Yes vs. No 4.15 (1.66,10.4) 0.002 0.012 5.72 (2.75,11.88) number of LN dissected (cont. var.) 0.99 (0.96,1.02) 0.463 0.458 0.9957 (0.971,1.0211) 0.739 0.738 number of LN dissected: <17 or=\"\">30 vs17-3017> 1.83 (1.11,3.03) 0.018 0.014 1.41 (0.93,2.12) 0.107 0.103 Proportion of positive lymph nodes (cont. var.) 59.06 (8.03,434.31) 69.08 (11.63,410.47) High-risk Regional lymph nodes: Positive vs. Negative 1.89 (1.15,3.13) 0.012 0.017 2.01 (1.3,3.1) 0.002 0.003 Number of Positive LN (cont. var.) 1.27 (1.11,1.46) 0.002 1.29 (1.15,1.45) Of the 282 patients, 112 (39.7%) had lymph node metastasis or a history of lymph node cancer involvement. Residual cancer in lymph nodes was classified into four levels based on TRG grading criteria. Higher TRG levels were associated with poorer OS and RFS, especially for RFS ( P 2 P 2  Fig. 2 Four grades of residual cancer in lymph nodes ( E-H AB CD The bubble chart illustrates the distribution of positive lymph nodes across different regions. Positive lymph nodes were most commonly found in abdominal (26.6%), upper mediastinal (19.5%), middle mediastinal (9.9%), lower mediastinal (5.7%), and neck regions (3.9%) (Fig. 3 2 P P P P 3  Fig. 3 Distribution of lymph nodes according to region, showing the proportion of positive lymph nodes and the HR in each region( A B C P DE P FG  Table 2 Lymph node positive rate and cancer residual rate at different node region/station Node Region Number of patients with positive lymph nodes Proportion of patients with positive lymph nodes(%) Proportion of residual cancer(%) Station Number(AJCC) Name of Node Station (AJCC) Number of patients with positive lymph nodes Proportion of patients with positive lymph nodes(%) Proportion of residual cancer(%) Cervical 11 3.9% 31.9% 1R Right lower cervical paratracheal lymph nodes 9 3.2% 27.9% 1 L Left lower cervical paratracheal lymph nodes 2 0.7% 50.0% Upper mediastinal 55 19.5% 49.5% 8Up Posterior mediastinal lymph nodes 3 1.1% 43.3% 2R Right upper paratracheal nodes 35 12.4% 44.6% 2 L Left upper paratracheal nodes 12 4.3% 52.5% 4R Right lower paratrachal lymph nodes 1 0.4% 50.0% 4 L Left lower paratrachal lymph nodes 4 1.4% 87.5% Middle mediastinal 28 9.9% 44.4% 7 Subcarinal lymph nodes 21 7.4% 40.3% 8 M Middle thoracic paraesophageal lymph nodes 7 2.5% 51.7% Lower mediastinal 16 5.7% 35.2% 8Lo Lower thoracic paraesophageal lymph nodes 13 4.6% 42.8% 15 Diaphragmatic lymph nodes 1 0.4% 1.0% 9R Right pulmonary ligament nodes 1 0.4% 1.0% 9 L Left pulmonary ligament nodes 1 0.4% 5.0% Abdominal 75 26.6% 54.5% 16 Paracardial nodes 12 4.3% 55.9% 17 Left gastric nodes 50 17.7% 53.1% 18 Common hepatic nodes 3 1.1% 50.0% 19 Splenic nodes 4 1.4% 47.5% 20 Celiac nodes 6 2.1% 70.6% Different lymph node stations showed varying proportions of positive cases, with station 17, 2R, 7, and 8Lo having the highest numbers of positive cases (Table 2 3 Regarding the remaining tumor proportions after neoadjuvant therapy, abdominal lymph nodes had the highest proportion at 54.5%, followed by upper mediastinal, middle mediastinal, lower mediastinal, and neck lymph nodes. The proportions varied across stations, with stations 4 L, 20, 16, 17, 2 L, 8 M, 4R, 1 L, 18, 19, 2R, 8U, 8Lo, 1R, 9R, and 15 having the highest proportions (Fig. 3 2 In summary, abdominal and station 4 L lymph nodes demonstrated the highest HRs for OS, while lower mediastinal and station 18 lymph nodes showed the highest HRs for RFS. Abdominal and left gastric lymph nodes had the highest number and proportion of positive cases, while abdominal and station 4 L lymph nodes had the highest proportion of residual cancer. Univariate analysis identified ypN, LN-TRG, LN total tumor diameter, lymph node dissections (17–30), proportion of positive lymph nodes, positive lymph nodes in high-risk areas, number of positive lymph nodes, and LN extracapsular invasion as significant factors for OS and RFS (Table 1 4 4 Fig. 4 Selection of the factors most associated with OS and RFS using LASSO regression and univariate analysis. The λ coefficient decreased with the increase of the number of factors. When λ was the best value, LASSO regression screened out the relevant factors ( A-D EF We devised an OS predictive model based on the five most pertinent factors, as illustrated in the nomogram (Fig. 5 5 5 5  Fig. 5 The selected factors were used to establish a prediction model for OS and RFS and to make a nomogram ( AD CDEF GI HJ Using linear predictor coefficients, patients were categorized into high-risk and low-risk groups based on cutoff values (−0.11 for OS and − 0.17 for RFS) (Fig. 5 5 Discussion In this study, we conducted a comprehensive assessment of lymph node status in patients undergoing neoadjuvant therapy and found that several factors significantly impacted prognosis, including the number of dissected lymph nodes (17–30), the count and proportion of positive lymph nodes, the location of positive lymph nodes, the overall diameter of residual cancer within lymph nodes, LN extracapsular invasion, and LN-TRG. These factors were utilized to develop predictive models for OS and RFS, which demonstrated superior performance compared to pN staging, providing a reliable basis for clinical prognosis assessment and treatment decision-making. Specifically, we initially evaluated the prognostic impact of the number of dissected lymph nodes and found that insufficient lymph node dissection increased the risk of death, consistent with previous research. While prior studies suggested that a greater number of dissected lymph nodes could improve patient survival [ 11 12 Further evidence is required for precise lymph node dissection. Thus, we investigated lymph node characteristics, including location and positivity probability, in esophageal cancer patients post neoadjuvant therapy. Our findings reveal a higher lymph node positivity rate in the abdominal region compared to simple surgery [ 15 16 The proportion of positive lymph nodes emerges as a robust prognostic indicator, consistent with multicenter studies on colon and breast cancer, where it correlates positively with HR [ 17 18 19 20 21 22 23 While the aforementioned factors have varying impacts on prognosis, they each carry different weight. To achieve a precise prognosis assessment, we used univariate and LASSO regression analyses to identify the most relevant factors and determine their intersection. LN-TRG, total tumor diameter in lymph nodes, the number of removed lymph nodes (less than 17 or greater than 30), proportion of positive lymph nodes, and lymph node extracapsular invasion were selected as the five factors for establishing OS and RFS predictive models. These models performed well in the training set and showed comparable efficacy in the validation set. Existing studies have established lymph node status as a critical prognostic indicator following neoadjuvant therapy for esophageal squamous cell carcinoma (ESCC). Previous reports [ 24 26 27 28 This study has several limitations. Most notably, its single-center design inherently limits the external validity of the predictive model. While the model demonstrated robust performance within our cohort, its generalizability to broader populations or diverse healthcare settings remains uncertain due to potential variations in demographic and clinical characteristics across institutions. We explicitly acknowledge that external validation is imperative to establish the model’s clinical applicability and robustness. Future multi-center studies are essential to verify the model’s transportability and real-world utility. Reliance on subjective judgments from pathologists for some parameters may decrease reproducibility. This study offers a comprehensive evaluation of lymph node status and establishes a scientifically objective method for prognosis assessment. It has improved prognostic predictions and risk stratification, facilitating precise prognosis assessment and treatment strategy adjustments in clinical practice. Supplementary Information  Supplementary Material 1. Abbreviations ESCC Esophageal Squamous Cell Carcinoma NCRT Neoadjuvant Chemoradiotherapy OS Overall Survival RFS Recurrence-free Survival LN Lymph Nodes LN-TRG Tumor regression grade of lymph nodes PT Primary Tumor HR Hazard Ratio GTV Gross Tumor Volume CTV Clinical Target Volume PCR Pathological Complete Response Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Yehan Zhou, Meng Xiao and Jiayu Li contributed equally to this work. Acknowledgements Not applicable. Authors’ contributions ZYH and XM analyzed the data, performed statistical analysis, and wrote the paper together with LJY. YH and LJY interpreted the H&E staining. WY，WQF，LXF，HWW，and HYT contributed to the data collection. ZYH and HZY carried out statistical analyses. LY and HZY provided laboratory infrastructure. HZY conceived the project, drafted the paper, and supervised the analyses together with LY and ZYH. All authors read and approved the final manuscript. Funding This work has been supported by the Scientific Research Funds project of Science and Technology Department of Sichuan Province (2021YJ0121). Data availability The data that support the findings of this study are available from the corresponding author upon reasonable request. Declarations Ethics approval and consent to participate Ethical approval Permission has been obtained from the Ethics Committee for Medical Research and New Medical Technology of Sichuan Cancer Hospital (SCCHEC-02-2023-029). As this study involves retrospective data analysis without direct intervention in patient treatment or collection of biological samples containing identifiable personal information, informed consent has been exempted upon the approval of the Ethics Committee. According to Article 32 of the “Measures for Ethical Review of Biomedical Research Involving Human Subjects” issued by the National Health and Family Planning Commission of the People’s Republic of China, ethical review can be exempted for life sciences and medical research involving human subjects that utilize human information data or biological samples under circumstances where no harm is inflicted on humans, and no sensitive personal information or commercial interests are involved. The research was performed in accordance with the Declaration of Helsinki and all methods were carried out in accordance with relevant guidelines and regulations. Consent for publication All authors have no conflicts of interest to declare. All authors have seen and agree with the contents of the manuscript, and there is no financial interest to report. We certify that the submission is original work and is not under review at any other publication. Competing interests The authors declare no competing interests. References 1. Sung H Ferlay J Siegel RL Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries. Ca-cancer j clin 2021 71 209 249 10.3322/caac.21660 33538338 Sung H, Ferlay J, Siegel RL, et al. Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries. Ca-cancer j clin. 2021;71:209–49. 33538338 10.3322/caac.21660 2. Lagergren J Smyth E Cunningham D Lagergren P Oesophageal cancer Lancet 2017 390 2383 96 10.1016/S0140-6736(17)31462-9 28648400 Lagergren J, Smyth E, Cunningham D, Lagergren P. Oesophageal cancer. Lancet. 2017;390:2383–96. 28648400 10.1016/S0140-6736(17)31462-9 3. Hirohata R Hamai Y Hihara J Evaluation of neoadjuvant chemoradiotherapy followed by surgery for borderline resectable esophageal squamous cell carcinoma World J Surg 2022 46 1934 43 10.1007/s00268-022-06568-z 35508816 Hirohata R, Hamai Y, Hihara J, et al. Evaluation of neoadjuvant chemoradiotherapy followed by surgery for borderline resectable esophageal squamous cell carcinoma. World J Surg. 2022;46:1934–43. 35508816 10.1007/s00268-022-06568-z 4. Yang H Liu H Chen Y Neoadjuvant chemoradiotherapy followed by surgery versus surgery alone for locally advanced squamous cell carcinoma of the esophagus (NEOCRTEC5010): a phase III multicenter, randomized, open-label clinical trial J Clin Oncol 2018 36 2796 803 10.1200/JCO.2018.79.1483 30089078 PMC6145832 Yang H, Liu H, Chen Y, et al. Neoadjuvant chemoradiotherapy followed by surgery versus surgery alone for locally advanced squamous cell carcinoma of the esophagus (NEOCRTEC5010): a phase III multicenter, randomized, open-label clinical trial. J Clin Oncol. 2018;36:2796–803. 30089078 10.1200/JCO.2018.79.1483 PMC6145832 5. Yang H Liu H Chen Y Long-term efficacy of neoadjuvant chemoradiotherapy plus surgery for the treatment of locally advanced esophageal squamous cell carcinoma: the NEOCRTEC5010 randomized clinical trial JAMA Surg 2021 156 721 9 10.1001/jamasurg.2021.2373 34160577 PMC8223138 Yang H, Liu H, Chen Y, et al. Long-term efficacy of neoadjuvant chemoradiotherapy plus surgery for the treatment of locally advanced esophageal squamous cell carcinoma: the NEOCRTEC5010 randomized clinical trial. JAMA Surg. 2021;156:721–9. 34160577 10.1001/jamasurg.2021.2373 PMC8223138 6. Shapiro J van Lanschot JJB Hulshof M Neoadjuvant chemoradiotherapy plus surgery versus surgery alone for oesophageal or junctional cancer (CROSS): long-term results of a randomised controlled trial Lancet Oncol 2015 16 1090 8 10.1016/S1470-2045(15)00040-6 26254683 Shapiro J, van Lanschot JJB, Hulshof M, et al. Neoadjuvant chemoradiotherapy plus surgery versus surgery alone for oesophageal or junctional cancer (CROSS): long-term results of a randomised controlled trial. Lancet Oncol. 2015;16:1090–8. 26254683 10.1016/S1470-2045(15)00040-6 7. Blackham AU Naqvi H Schell SM Recurrence patterns and associated factors of locoregional failure following neoadjuvant chemoradiation and surgery for esophageal cancer J Surg Oncol 2018 117 150 9 10.1002/jso.24808 28833197 PMC7771345 Blackham AU, Naqvi H, Schell SM. Recurrence patterns and associated factors of locoregional failure following neoadjuvant chemoradiation and surgery for esophageal cancer. J Surg Oncol. 2018;117:150–9. 28833197 10.1002/jso.24808 PMC7771345 8. He W Wang C Wu L Tislelizumab plus chemotherapy sequential neoadjuvant therapy for non-cCR patients after neoadjuvant chemoradiotherapy in locally advanced esophageal squamous cell carcinoma (ETNT): an exploratory study Front Immunol 2022 13 853922 10.3389/fimmu.2022.853922 35720312 PMC9201912 He W, Wang C, Wu L, et al. Tislelizumab plus chemotherapy sequential neoadjuvant therapy for non-cCR patients after neoadjuvant chemoradiotherapy in locally advanced esophageal squamous cell carcinoma (ETNT): an exploratory study. Front Immunol. 2022;13:853922. 35720312 10.3389/fimmu.2022.853922 PMC9201912 9. Kelly RJ Ajani JA Kuzdzal J Adjuvant nivolumab in resected esophageal or gastroesophageal junction cancer N Engl J Med 2021 384 1191 203 10.1056/NEJMoa2032125 33789008 Kelly RJ, Ajani JA, Kuzdzal J, et al. Adjuvant nivolumab in resected esophageal or gastroesophageal junction cancer. N Engl J Med. 2021;384:1191–203. 33789008 10.1056/NEJMoa2032125 10. Ding T Liu C Huang B A survival prediction nomogram for esophageal squamous cell carcinoma treated with neoadjuvant chemoradiotherapy followed by surgery Cancer Manag Res 2021 13 7771 82 10.2147/CMAR.S329687 34675672 PMC8519412 Ding T, Liu C, Huang B, et al. A survival prediction nomogram for esophageal squamous cell carcinoma treated with neoadjuvant chemoradiotherapy followed by surgery. Cancer Manag Res. 2021;13:7771–82. 34675672 10.2147/CMAR.S329687 PMC8519412 11. Guo X Wang Z Yang H Impact of lymph node dissection on survival after neoadjuvant chemoradiotherapy for locally advanced esophageal squamous cell carcinoma: from the results of NEOCRTEC5010, a randomized multicenter study Ann Surg 2023 277 259 66 10.1097/SLA.0000000000004798 33605586 Guo X, Wang Z, Yang H, et al. Impact of lymph node dissection on survival after neoadjuvant chemoradiotherapy for locally advanced esophageal squamous cell carcinoma: from the results of NEOCRTEC5010, a randomized multicenter study. Ann Surg. 2023;277:259–66. 33605586 10.1097/SLA.0000000000004798 12. Deng H Zhou J Chen H Impact of lymphadenectomy extent on immunotherapy efficacy in postresectional recurred non-small cell lung cancer: a multi-institutional retrospective cohort study Int J Surg 2024 110 1 238 52 10.1097/JS9.0000000000000774 37755384 PMC10793742 Deng H, Zhou J, Chen H, et al. Impact of lymphadenectomy extent on immunotherapy efficacy in postresectional recurred non-small cell lung cancer: a multi-institutional retrospective cohort study. Int J Surg. 2024;110(1):238–52. 10.1097/JS9.0000000000000774. 37755384 10.1097/JS9.0000000000000774 PMC10793742 13. Hamai Y Emi M Ibuki Y Distribution of lymph node metastasis in esophageal squamous cell carcinoma after trimodal therapy Ann Surg Oncol 2021 28 1798 807 10.1245/s10434-020-09106-0 32885399 Hamai Y, Emi M, Ibuki Y, et al. Distribution of lymph node metastasis in esophageal squamous cell carcinoma after trimodal therapy. Ann Surg Oncol. 2021;28:1798–807. 32885399 10.1245/s10434-020-09106-0 14. Becker K Mueller JD Schulmacher C Histomorphology and grading of regression in gastric carcinoma treated with neoadjuvant chemotherapy Cancer 2003 98 1521 30 10.1002/cncr.11660 14508841 Becker K, Mueller JD, Schulmacher C, et al. Histomorphology and grading of regression in gastric carcinoma treated with neoadjuvant chemotherapy. Cancer. 2003;98:1521–30. 14508841 10.1002/cncr.11660 15. Anderegg MC Lagarde SM Jagadesham VP Prognostic significance of the location of lymph node metastases in patients with adenocarcinoma of the distal esophagus or gastroesophageal junction Ann Surg 2016 264 847 53 10.1097/SLA.0000000000001767 27429034 Anderegg MC, Lagarde SM, Jagadesham VP, et al. Prognostic significance of the location of lymph node metastases in patients with adenocarcinoma of the distal esophagus or gastroesophageal junction. Ann Surg. 2016;264:847–53. 27429034 10.1097/SLA.0000000000001767 16. Park SY, Lee J, Jeon YJ, et al. Clinical and Pathologic Supraclavicular Lymph Node Metastases in Esophageal Squamous Cell Carcinoma Treated by Esophagectomy with Three-Field Lymph Node Dissection. Ann Surg Oncol. 2024;31(5):3399-3408. 10.1245/s10434-023-14555-4. 10.1245/s10434-023-14555-4 38082171 17. Parsons HM Tuttle TM Kuntz KM Association between lymph node evaluation for colon cancer and node positivity over the past 20 years JAMA 2011 306 1089 97 10.1001/jama.2011.1285 21917579 Parsons HM, Tuttle TM, Kuntz KM, et al. Association between lymph node evaluation for colon cancer and node positivity over the past 20 years. JAMA. 2011;306:1089–97. 21917579 10.1001/jama.2011.1285 18. Rawicz-Pruszyński K Ciseł B Mlak R The role of the lymph node ratio in advanced gastric cancer after neoadjuvant chemotherapy Cancers (Basel) 2019 11 null 10.3390/cancers11121914 PMC6966566 31805755 Rawicz-Pruszyński K, Ciseł B, Mlak R, et al. The role of the lymph node ratio in advanced gastric cancer after neoadjuvant chemotherapy. Cancers (Basel). 2019;11:null. 10.3390/cancers11121914 PMC6966566 31805755 19. Galimberti V Cole BF Viale G Axillary dissection versus no axillary dissection in patients with breast cancer and sentinel-node micrometastases (IBCSG 23 – 01): 10-year follow-up of a randomised, controlled phase 3 trial Lancet Oncol 2018 19 1385 93 10.1016/S1470-2045(18)30380-2 30196031 Galimberti V, Cole BF, Viale G, et al. Axillary dissection versus no axillary dissection in patients with breast cancer and sentinel-node micrometastases (IBCSG 23 – 01): 10-year follow-up of a randomised, controlled phase 3 trial. Lancet Oncol. 2018;19:1385–93. 30196031 10.1016/S1470-2045(18)30380-2 20. Jianyong L Jinjing Z Zhihui L A nomogram based on the characteristics of metastatic lymph nodes to predict papillary thyroid carcinoma recurrence Thyroid 2018 28 301 10 10.1089/thy.2017.0422 29439612 Jianyong L, Jinjing Z, Zhihui L, et al. A nomogram based on the characteristics of metastatic lymph nodes to predict papillary thyroid carcinoma recurrence. Thyroid. 2018;28:301–10. 29439612 10.1089/thy.2017.0422 21. Roy P Mallick I Arun I Nodal yield and topography of nodal metastases from oral cavity squamous cell carcinoma - an audit of 1004 cases undergoing primary surgical resection Oral Oncol 2021 113 105115 10.1016/j.oraloncology.2020.105115 33341004 Roy P, Mallick I, Arun I, et al. Nodal yield and topography of nodal metastases from oral cavity squamous cell carcinoma - an audit of 1004 cases undergoing primary surgical resection. Oral Oncol. 2021;113: 105115. 33341004 10.1016/j.oraloncology.2020.105115 22. Wong IYH Chung JCY Zhang RQ A novel tumor staging system incorporating tumor regression grade (TRG) with lymph node status (ypN-category) results in better prognostication than YpTNM stage groups after neoadjuvant therapy for esophageal squamous cell carcinoma Ann Surg 2022 276 784 91 10.1097/SLA.0000000000005636 35876374 Wong IYH, Chung JCY, Zhang RQ, et al. A novel tumor staging system incorporating tumor regression grade (TRG) with lymph node status (ypN-category) results in better prognostication than YpTNM stage groups after neoadjuvant therapy for esophageal squamous cell carcinoma. Ann Surg. 2022;276:784–91. 35876374 10.1097/SLA.0000000000005636 23. Hall WA Li J You YN Prospective correlation of magnetic resonance tumor regression grade with pathologic outcomes in total neoadjuvant therapy for rectal adenocarcinoma J Clin Oncol 2023 41 4643 51 10.1200/JCO.22.02525 37478389 PMC10564288 Hall WA, Li J, You YN, et al. Prospective correlation of magnetic resonance tumor regression grade with pathologic outcomes in total neoadjuvant therapy for rectal adenocarcinoma. J Clin Oncol. 2023;41:4643–51. 37478389 10.1200/JCO.22.02525 PMC10564288 24. Yap WK Chang YC Hsieh CH Favorable versus unfavorable prognostic groups by post-chemoradiation FDG-PET imaging in node-positive esophageal squamous cell carcinoma patients treated with definitive chemoradiotherapy Eur J Nucl Med Mol Imaging 2017 45 5 689 98 10.1007/s00259-017-3901-3 29188300 Yap WK, Chang YC, Hsieh CH, et al. Favorable versus unfavorable prognostic groups by post-chemoradiation FDG-PET imaging in node-positive esophageal squamous cell carcinoma patients treated with definitive chemoradiotherapy. Eur J Nucl Med Mol Imaging. 2017;45(5):689–98. 10.1007/s00259-017-3901-3. 29188300 10.1007/s00259-017-3901-3 25. Lin CH Hung TM Chang YC Prognostic value of lymph node-to-primary tumor standardized uptake value ratio in esophageal squamous cell carcinoma treated with definitive chemoradiotherapy Cancers (Basel) 2020 10.3390/cancers12030607 32155748 PMC7139766 Lin CH, Hung TM, Chang YC, et al. Prognostic value of lymph node-to-primary tumor standardized uptake value ratio in esophageal squamous cell carcinoma treated with definitive chemoradiotherapy. Cancers (Basel). 2020. 10.3390/cancers12030607. 32155748 10.3390/cancers12030607 PMC7139766 26. Yap WK Chang YC Tseng CK Predictive value of nodal maximum standardized uptake value of pretreatment [18F]fluorodeoxyglucose positron emission tomography imaging in patients with esophageal cancer Dis Esophagus 2017 30 8 1 10 10.1093/dote/dox021 28575243 Yap WK, Chang YC, Tseng CK, et al. Predictive value of nodal maximum standardized uptake value of pretreatment [18F]fluorodeoxyglucose positron emission tomography imaging in patients with esophageal cancer. Dis Esophagus. 2017;30(8):1–10. 10.1093/dote/dox021. 28575243 10.1093/dote/dox021 27. Yap WK Shih MC Chang YC Adjuvant chemoradiotherapy associated with improved overall survival in resected esophageal squamous cell carcinoma after neoadjuvant chemoradiotherapy in intensity-modulated radiotherapy era Biomedicines 2022 10.3390/biomedicines10112989 36428557 PMC9687609 Yap WK, Shih MC, Chang YC, et al. Adjuvant chemoradiotherapy associated with improved overall survival in resected esophageal squamous cell carcinoma after neoadjuvant chemoradiotherapy in intensity-modulated radiotherapy era. Biomedicines. 2022. 10.3390/biomedicines10112989. 36428557 10.3390/biomedicines10112989 PMC9687609 28. Yap WK Hsiao IT Yap WL A radiotherapy dose map-guided deep learning method for predicting pathological complete response in esophageal cancer patients after neoadjuvant chemoradiotherapy followed by surgery Biomedicines 2023 10.3390/biomedicines11113072 38002072 PMC10669191 Yap WK, Hsiao IT, Yap WL, et al. A radiotherapy dose map-guided deep learning method for predicting pathological complete response in esophageal cancer patients after neoadjuvant chemoradiotherapy followed by surgery. Biomedicines. 2023. 10.3390/biomedicines11113072. 38002072 10.3390/biomedicines11113072 PMC10669191 ",
  "metadata": {
    "Title of this paper": "A radiotherapy dose map-guided deep learning method for predicting pathological complete response in esophageal cancer patients after neoadjuvant chemoradiotherapy followed by surgery",
    "Journal it was published in:": "BMC Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481729/"
  }
}