{
  "title": "Paper_903",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12487521 PMC12487521.1 12487521 12487521 41040744 10.7759/cureus.91399 1 Internal Medicine Cardiac/Thoracic/Vascular Surgery Oncology Primary Mediastinal Germ Cell Tumor in a Woman Presenting With Superior Vena Cava Syndrome: A Case Report Muacevic Alexander Adler John R Abouafech Alex 1 Lorenz Nicholas 1 Stauffer John 1 Milian Cardoso Oscar 2  1  2 Alex Abouafech aabouafech87597@med.lecom.edu 1 9 2025 9 2025 17 9 495976 e91399 4 8 2025 31 8 2025 01 09 2025 02 10 2025 03 10 2025 Copyright © 2025, Abouafech et al. 2025 Abouafech et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/401886-primary-mediastinal-germ-cell-tumor-in-a-woman-presenting-with-superior-vena-cava-syndrome-a-case-report Mediastinal germ cell tumors (MGCTs) are rare neoplasms that typically occur in young men, with nonseminomatous subtypes predominating in this population. The occurrence of such tumors in women is exceedingly uncommon, accounting for a very small fraction of all extragonadal germ cell tumors (GCTs). We present a rare case of a 44-year-old woman diagnosed with a primary mediastinal germ cell tumor (PMGCT) complicated by superior vena cava (SVC) syndrome. The patient initially presented with severe respiratory distress, chest pain, and signs of venous congestion. Imaging revealed a large anterior mediastinal mass compressing the SVC. She was started on systemic chemotherapy with cisplatin and bleomycin, with partial symptomatic relief. Her hospital course was further complicated by anemia, volume overload, and pulmonary infiltrates. This case underscores the importance of considering MGCTs in the differential diagnosis of anterior mediastinal masses in women and highlights the potential for life-threatening complications such as SVC syndrome. Prompt recognition and multidisciplinary management are essential to improving outcomes in these rare but aggressive tumors. primary mediastinal germ cell tumor superior vena cava (svc) syndrome svc compression thrombosis of the internal jugular vein unexpected malignancy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Primary mediastinal germ cell tumors (PMGCTs) are rare neoplasms that account for only 1%-3% of all germ cell tumors (GCTs) and 15% of all mediastinal tumors [ 1 2 PMGCTs can grow rapidly and exert mass effects on mediastinal structures, leading to serious complications such as superior vena cava (SVC) syndrome, internal jugular vein thrombosis (IJVT), and pulmonary compromise. IJVT can result from the direct compression of certain malignancies (i.e., Trousseau’s syndrome), in which procoagulant factors such as tissue factor activate the coagulation cascade and lead to hypercoagulability [ 3 4 Nonseminomatous PMGCTs, which comprise the majority of these tumors in the mediastinum, are particularly aggressive and are associated with a poorer prognosis compared to their gonadal counterparts [ 5 Case presentation A 44-year-old woman with no significant past medical history was diagnosed with a nonseminomatous primary mediastinal germ cell tumor (MGCTs), with metastases to lymph nodes, the bone, and possibly the liver. She initially presented with a two-week history of severe respiratory distress, chest pain, fever, and headaches. Prior to presentation, a computed tomography (CT) scan performed for the evaluation of a neck deep vein thrombosis revealed pulmonary nodules, prompting her primary care physician to refer her to the ED. Imaging identified a new anterior mediastinal mass as shown in Figure 1 Figure 1 Large superior mediastinal mass seen on contrast-enhanced axial computed tomography (blue lines numbered 1 and 2, approximately 10 × 7.3 × 12.3 cm) with the extensive involvement of vascular structures (the superior vena cava, brachiocephalic vein, and ascending aorta) and adjacent airways (the trachea and right main bronchus), consistent with malignancy. The patient was transferred to the progressive care unit, where she received her first dose of chemotherapy. During her hospitalization, she developed volume overload, which was managed with intravenous furosemide. CT imaging revealed bilateral pulmonary infiltrates, and she developed sinus tachycardia, attributed to systemic inflammation from malignancy. She received supportive care, including Granix (tbo-filgrastim) and blood and platelet transfusions per oncology recommendations, and anticoagulation was held due to thrombocytopenia. The patient showed clinical improvement and was discharged in stable condition with close outpatient follow-up. Two weeks later, she returned to the ED with neck tightness, shortness of breath, and new-onset hallucinations and confusion following chemotherapy. CT angiography showed an occlusive thrombus in the left internal jugular vein and a 7.9 cm anterior mediastinal mass causing significant SVC compression, as shown in Figure 2 Figure 2 The sagittal computed tomography findings are consistent with superior vena cava (SVC) syndrome, characterized by the near-complete compression of the SVC by a large, invasive anterior mediastinal mass. The SVC appears severely narrowed to a slit-like configuration, and there is an encasement of the left brachiocephalic vein, likely resulting in occlusion. After six months of chemotherapy, the patient again presented to the ED with acute hypoxia and fever during outpatient follow-up. Imaging demonstrated bilateral pneumonia, small pleural effusions, the progression of the mediastinal mass, and new hepatic metastases. She improved with intravenous antibiotics and supplemental oxygen and was discharged on home oxygen therapy. However, three days later, she returned to the ED with worsening shortness of breath, neck and chest congestion, and profound fatigue. Laboratory values upon re-admission are listed in Table 1 3 Table 1 Patient’s laboratory values upon re-admission. Laboratory test Result Reference range Hemoglobin 7.0 g/dL 12.0-16.0 g/dL Platelet count 47 × 10³/µL 150-450 × 10³/µL White blood cell count 2.0 × 10⁹/L 4.0-10.0 × 10⁹/L Blood urea nitrogen 37 mg/dL 7-20 mg/dL Creatinine 1.2 mg/dL 0.6-1.3 mg/dL Procalcitonin 0.5 ng/mL <0.1 ng/mL Lactate 2.6 mmol/L 0.5-2.2 mmol/L Figure 3 Sagittal computed tomography angiogram showing further progression of the infiltrative mediastinal mass, now extending into the pericardium and encasing the aortic arch as circled in red. She was admitted for supportive management and treatment of acute-on-chronic anemia, receiving one unit of A+ packed red blood cells. Hematology/oncology initiated intravenous corticosteroids and oral imatinib. Despite these efforts, her respiratory status continued to deteriorate. Pulmonology recommended continued oncologic management. Interventional radiology placed an SVC stent to relieve vascular obstruction; however, her condition worsened, requiring high-flow nasal cannula oxygen therapy. Given the progression of the disease and poor prognosis, palliative care was consulted. After extensive goals-of-care discussions, the patient elected for comfort-focused management and was discharged to an inpatient hospice facility. Discussion This case underscores the aggressive clinical course and multisystem involvement characteristic of nonseminomatous primary mediastinal germ cell tumors, particularly in the rare setting of a female patient. These tumors are not only biologically aggressive but also strategically located in a confined anatomic compartment, allowing even moderate tumor growth to result in life-threatening complications. Delayed diagnosis is common due to vague and nonspecific initial symptoms such as dyspnea, cough, or upper extremity edema, which are often misattributed to more common cardiopulmonary conditions. In this case, the initial respiratory symptoms and facial swelling reflected early signs of superior vena cava syndrome, which progressed due to unchecked tumor growth and venous obstruction. SVC syndrome is a hallmark complication of mediastinal masses, occurring when the tumor compresses or invades the SVC, leading to increased venous pressure in the upper body. This results in facial and neck swelling, dilated thoracic and cervical collateral veins, dyspnea, orthopnea, and, in severe cases, cerebral edema or airway compromise. The simultaneous development of internal jugular vein thrombosis further compounded venous obstruction and highlights the tumor’s propensity for both compressive and thrombotic vascular complications. These findings reflect not just mechanical obstruction but also a prothrombotic paraneoplastic state. Systemic complications further illustrate the tumor’s widespread impact. Chemotherapy-induced immunosuppression predisposed the patient to multifocal pneumonia and severe neutropenia, while profound anemia likely reflected both marrow suppression and tumor-associated inflammation [ 6 7 8 Despite initial radiologic response to chemotherapy, the patient experienced continued disease progression, including hepatic metastases and pericardial involvement, features indicative of a poor prognosis. Nonseminomatous PMGCTs are known for their chemoresistance, early dissemination, and limited surgical resectability due to their location and vascular invasion. In the mediastinum, these germ cell tumors are associated with poorer outcomes than their gonadal counterparts, with significantly lower complete response rates and survival. In one retrospective cohort of poor-risk NSGCTs, mediastinal tumors exhibited a complete response rate of just 38%, compared to 61% for retroperitoneal and 38% for testicular primaries. Patients with mediastinal NSGCTs experienced the lowest event-free survival of all locations and were more prone to relapse following chemotherapy [ 9 This case not only exemplifies the diverse complications associated with PMGCTs but also serves as a reminder of the importance of early recognition, multidisciplinary care, and the anticipatory management of complications such as SVC syndrome, immunosuppression, and treatment-limiting toxicities. For rare presentations in women, a high index of suspicion is essential to avoid delays that can drastically affect outcomes. Conclusions In this rare case, we observe the progression of a primary mediastinal nonseminomatous germ cell tumor in a female patient, a clinical scenario that is exceptionally uncommon. These tumors are multifactorial due to their local invasiveness, vascular compression, and rapid progression. Early imaging, prompt tissue diagnosis, and coordinated multidisciplinary management are essential for optimizing outcomes. This case highlights the need for heightened clinical suspicion in atypical populations, the importance of recognizing SVC syndrome, and the challenges of managing chemotherapy-related complications while anticipating multisystem involvement during treatment. Disclosures Human subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Supervision: References 1 Mediastinal germ cell tumours: where we are and where we are going-a narrative review Mediastinum Marandino L Vogl UM 7 6 2022 35340835 10.21037/med-21-33 PMC8841536 2 Primary mediastinal choriocarcinoma in a female patient: case report and review of the literature Gynecol Oncol Rep Batman S Morgan T Brunetti M Strandabø RA Micci F Moffitt M Pejovic T 99 101 26 2018 30456287 10.1016/j.gore.2018.10.013 PMC6232631 3 Internal jugular venous thrombosis due to Trousseau's syndrome as the presenting feature of metastatic prostate carcinoma: a case report J Med Case Rep Bandara AR Wimalarathna H Kalupahana R Gunathilake SS 104 10 2016 27097872 10.1186/s13256-016-0884-9 PMC4839162 4 Superior vena cava syndrome StatPearls [Internet] Seligson MT Surowiec SM Treasure Island, FL StatPearls Publishing 2022 https://www.ncbi.nlm.nih.gov/books/NBK441981/ 28723010 5 Primary mediastinal germ cell tumors: a thorough literature review Biomedicines Ozgun G Nappi L 487 11 2023 36831022 10.3390/biomedicines11020487 PMC9953372 6 Oncologic emergencies and urgencies: a comprehensive review CA Cancer J Clin Gould Rothberg BE Quest TE Yeung SJ 570 593 72 2022 35653456 10.3322/caac.21727 7 Platinum-based drugs for cancer therapy and anti-tumor strategies Theranostics Zhang C Xu C Gao X Yao Q 2115 2132 12 2022 35265202 10.7150/thno.69424 PMC8899578 8 Prevalence of cognitive impairment following chemotherapy treatment for breast cancer: a systematic review and meta-analysis Sci Rep Whittaker AL George RP O'Malley L 2135 12 2022 35136066 10.1038/s41598-022-05682-1 PMC8826852 9 Extragonadal and poor risk nonseminomatous germ cell tumors. Survival and prognostic features Cancer Toner GC Geller NL Lin SY Bosl GJ 2049 2057 67 1991 1848473 10.1002/1097-0142(19910415)67:8<2049::aid-cncr2820670807>3.0.co;2-h ",
  "metadata": {
    "Title of this paper": "Extragonadal and poor risk nonseminomatous germ cell tumors. Survival and prognostic features",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487521/"
  }
}