{
  "title": "Paper_1013",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12480698 PMC12480698.1 12480698 12480698 41023097 10.1038/s41598-025-18290-6 18290 1 Article HJ-4, a novel piperine derivative, inhibits tumor growth and angiogenesis via p53 activation and oncogenic pathway inhibition in colorectal cancer models Zhang Luyao 1 Liu Shunfang 2 Wang Dan 1 Zhang Xingyu 1 Hu Zhongke 1 Zou Xun 1 Li Xiuming 1 Wang Xiujun 1 Xu Dandan 2024000070@jou.edu.cn 1 Liu Wei weiliu@mcw.edu 3 Liu Bin liubin@jou.edu.cn 1 1 https://ror.org/031zps173 grid.443480.f 0000 0004 1800 0658 Jiangsu Key Laboratory of Marine Pharmaceutical Compound Screening, College of Pharmacy, Jiangsu Ocean University, 2 https://ror.org/00p991c53 grid.33199.31 0000 0004 0368 7223 Department of Oncology, Tongji Hospital of Tongji Medical College, Huazhong University of Science and Technology, 3 https://ror.org/00qqv6244 grid.30760.32 0000 0001 2111 8460 Cancer Center and Department of Pharmacology and Toxicology, Medical College of Wisconsin, 29 9 2025 2025 15 478255 33541 1 12 2024 1 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Colorectal cancer (CRC) remains a major cause of cancer-related mortality worldwide, especially in advanced and metastatic stages where treatment options are limited. HJ-4, a novel piperine derivative, demonstrated strong tumor-selective inhibition. Within safe concentrations (cell viability > 85%), HJ-4 dose-dependently suppressed colony formation and DNA synthesis in CRC cells, showing potent anti-proliferative effects. It also significantly inhibited cell adhesion, wound healing, and invasion, indicating robust anti-migration and anti-invasion properties. In vivo, the CAM model confirmed that HJ-4 reduced both tumor volume and angiogenesis. Mechanistically, HJ-4 activated the p53-dependent apoptosis pathway while suppressing the Wnt/β-catenin axis and E2F transcriptional activity, effectively impeding tumor progression. Overall, HJ-4 exhibits promising tumor specificity and multiple antitumor mechanisms, supporting its potential for clinical development in CRC treatment. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-18290-6. Keywords Colorectal cancer (CRC) Piperine derivative HJ-4 Angiogenesis inhibition p53-mediated apoptosis Chicken embryo chorioallantoic membrane (CAM) model Subject terms Biological techniques Cancer Drug discovery Scientific Research Foundation for Returned Scholars of Tongji Hospital 2022hgry021 2022hgry021 Liu Shunfang Liu Bin Scientific Research Fund of Tongji Hospital 2023A09 2023A09 Liu Shunfang Liu Bin http://dx.doi.org/10.13039/501100001809 National Natural Science Foundation of China 82273167 Liu Bin Jiangsu Province Basic Research Program Natural Science Foundation BK20220063 Liu Bin the Key Program of Basic Science (Natural Science) of Jiangsu Province 22KJA350001 Liu Bin Chen Xiao-Ping Foundation for the Development of Science and Technology of Hubei Province CXPJJH123003-027 Liu Bin pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Colorectal cancer (CRC) is the third most commonly diagnosed malignancy and the second leading cause of cancer-related deaths worldwide, accounting for over 900,000 deaths annually 1 2 3 The initiation and progression of CRC involve multiple hallmarks of cancer, such as uncontrolled proliferation, evasion of apoptosis, angiogenesis, and metastasis 4 5 7 8 9 10 11 12 Due to the limitations of conventional therapies, natural compounds have attracted significant attention in cancer prevention and treatment for their multi-targeted activities and low toxicity profiles 13 14 15 16 17 18 In this study, we report the synthesis and biological evaluation of HJ-4 in CRC, focusing on its ability to inhibit proliferation, migration, invasion, angiogenesis, and tumor growth. Mechanistic investigations were conducted to elucidate the molecular pathways regulated by HJ-4, with particular emphasis on its modulation of p53 signaling and apoptosis pathways. Our findings suggest that HJ-4 is a promising therapeutic candidate for CRC, demonstrating significantly improved potency and selectivity compared to piperine, and offering potential solutions to current challenges in CRC treatment. Materials and methods General materials and instruments All reagents and solvents were purchased from commercial suppliers and used as received unless otherwise specified. Analytical-grade solvents were used for synthesis and purification. Thin-layer chromatography (TLC) was performed on silica gel 60 F-254 plates (Merck, Germany) and visualized under UV light (254 nm) or iodine vapor to monitor reactions. Column chromatography was conducted using silica gel (200–300 mesh or 300–400 mesh, Qingdao Marine Chemical Factory, China). The melting point of HJ-4 was determined using an X4 melting point tester (Shanghai Precision Scientific Instrument Co., China). NMR spectra were acquired using Bruker Avance DRX spectrometers at 500 and 126 MHz with CDCl₃ as the solvent, and tetramethylsilane (TMS) as the internal standard. Chemical shifts (δ) are reported in parts per million (ppm), and coupling constants ( J 3 Synthesis of HJ-4 Step 1: hydrolysis of Piperine to intermediate (2) Piperine (5.85 g, 20.5 mmol) was dissolved in 20 mL of 20% potassium hydroxide (KOH) in ethanol and refluxed at 80 °C for 6 h with constant stirring under nitrogen atmosphere. The reaction mixture was cooled to room temperature, and the solid product was collected by filtration. The solid was dissolved in water, washed with methylene chloride (3 × 20 mL) to remove impurities, and the remaining aqueous phase was gradually acidified with 0.5 M hydrochloric acid (HCl) under stirring until the white precipitate formed. The precipitate was collected by vacuum filtration, washed with cold ethanol, and recrystallized to yield compound ( 2 Step 2: coupling of intermediate (2) with 1-(2-Methoxyphenyl)piperazine Intermediate ( 2 1 3 J J J S1 13 3 S2 m/z + 23 25 2 4 S3 S4 Cell lines and culture conditions Human colorectal cancer cell lines HCT116 and SW480, cervical cancer cell line HeLa, kidney cancer cell line A498, and human renal epithelial cell line 293T were obtained from the American Type Culture Collection (ATCC). All cell lines were authenticated by short tandem repeat (STR) profiling and routinely tested for mycoplasma contamination using a MycoAlert Mycoplasma Detection Kit (Lonza, USA) before use. HCT116 cells were cultured in McCoy’s 5 A medium supplemented with 10% fetal bovine serum (FBS) and 1% penicillin/streptomycin. SW480 cells were maintained in Iscove’s Modified Dulbecco’s Medium (IMDM) supplemented with 10% FBS and 1% penicillin/streptomycin. HeLa and 293T cells were cultured in high-glucose Dulbecco’s Modified Eagle Medium (DMEM) supplemented with 10% FBS and 1% penicillin/streptomycin. A498 cells were grown in Minimum Essential Medium (MEM) containing 10% FBS and 1% penicillin/streptomycin. All cells were maintained in a humidified atmosphere of 5% CO₂ at 37 °C. Cells were passaged every 2–3 days using 0.25% trypsin-EDTA (Gibco, USA) and used within 10 passages for all experiments to ensure reproducibility. Cell viability assay HCT116, SW480, A498, HeLa, and 293T cells were seeded into a 96-well plate at a density of 5 × 10³ cells per well. After allowing them to adhere overnight in a 37 °C, 5% CO₂ incubator, the cells were treated with HJ-4 or piperine at concentrations ranging from 3.125 to 100 µM for 24 h. After treatment, 10 µL of MTT solution (5 mg/mL) was added to each well, and the cells were incubated for an additional 4 h at 37 °C to allow for the formation of formazan crystals. Following incubation, the supernatant was carefully removed, and 100 µL of DMSO was added to dissolve the purple crystals. The absorbance at 490 nm was measured using a microplate reader to determine the optical density (OD) of each well. The relative cell viability was calculated by comparing the OD values between the experimental and control groups. The experiment included three replicate wells for each condition, along with untreated controls and blank wells to ensure the reliability of the data. Colony formation assay HCT116 and SW480 cells were seeded in 12-well plates at a density of 500 cells per well and treated with HJ-4 (8, 16, and 32 µM) or piperine (32 µM) for 48 h. After treatment, the medium was replaced with drug-free complete medium, and cells were allowed to grow for 10–14 days. Colonies were fixed with 4% paraformaldehyde for 15 min, stained with 0.1% crystal violet for 30 min, and imaged using a digital scanner. Colonies containing more than 50 cells were manually counted using ImageJ software, and the average colony area was also analyzed. EdU incorporation assay HCT116 and SW480 cells were seeded on coverslips in 24-well plates and treated with HJ-4 or piperine for 24 h. Cells were incubated with 5 µM EdU (Click-iT EdU Imaging Kit, Thermo Fisher Scientific) for 2 h, then fixed in 4% paraformaldehyde and permeabilized with 0.1% Triton X-100. The Click reaction was performed according to the manufacturer’s protocol, and nuclei were counterstained with Hoechst 33,342. Images were captured using a Zeiss LSM 880 confocal microscope, and the percentage of EdU-positive cells was quantified using ImageJ software. Adhesion assays 96-well plates were coated with 10 µg/mL human plasma fibronectin in PBS for 2 h at room temperature. After removing the coating solution, wells were blocked with 200 µL PBS containing 1% heat-denatured BSA at 37 °C for 1 h. HCT116 and SW480 cells were resuspended in serum-free medium with HJ-4 or piperine and seeded at 5 × 10 4 Migration assays HCT116/SW480 cells were seeded in 6-well plates at a density of 5 × 10⁵ cells per well. After the cells reached approximately 90% confluence, a linear wound was created by vertically drawing a line with a sterile 10 µL pipette tip approximately 800 μm wide along a ruler, perpendicular to the bottom of the plate. After washing with PBS to remove detached cells, the medium was replaced with serum-free medium containing different concentrations of drugs (HJ-4/Piperine). The plate was placed under an inverted fluorescence microscope, and images were captured at 0, 24, and 48 h using a 10× objective lens (3 random fields per well). Image analysis was performed using ImageJ: the images were first converted to 8-bit grayscale, and a fixed threshold (default settings) was applied to identify the wound edges. Invasion assays The Transwell chamber’s base membrane was pre-coated with Matrigel matrix gel, diluted at a 1:8 ratio with pre-chilled serum-free medium, and 100 µL of this solution was added per well and allowed to solidify at 37 °C for 4 h. Drug-pretreated HCT116/SW480 cells (5 × 10 4 RNA sequencing and transcriptomic analysis HCT116 cells were treated with HJ-4 (32 µM) or DMSO (control) for 24 h in biological triplicates. Total RNA was extracted using the RNeasy Mini Kit (Qiagen, Germany) according to the manufacturer’s protocol. RNA quality and concentration were assessed using a NanoDrop 2000 spectrophotometer (Thermo Fisher Scientific, USA) and an Agilent 2100 Bioanalyzer (Agilent Technologies, USA). Samples with an RNA integrity number (RIN) ≥ 8.0 were used for library preparation. RNA sequencing libraries were constructed using the TruSeq RNA Sample Preparation Kit v2 (Illumina, USA). Libraries were sequenced on an Illumina NovaSeq 6000 platform to generate 150 bp paired-end reads. Raw sequencing reads were quality-checked using FastQC (v0.11.9) and trimmed with Trimmomatic (v0.39) to remove low-quality bases and adapters. Reads were aligned to the human reference genome (GRCh38) using STAR (v2.7.9a). FeatureCounts (v2.0.1) was used to quantify gene expression levels, and normalization was performed using the transcripts per million (TPM) method. Differentially expressed genes (DEGs) between HJ-4-treated and control groups were identified using the “limma” package in R (v4.1.0) with thresholds of |log₂ fold change| > 1.2 and adjusted p Western blot analysis HCT116 and SW480 cells were treated with HJ-4 (8, 16, and 32 µM) or piperine (32 µM) for 24 h. After treatment, cells were washed twice with ice-cold phosphate-buffered saline (PBS) and lysed on ice in RIPA buffer (Thermo Fisher Scientific, USA) supplemented with protease inhibitors (Roche, Switzerland) and phosphatase inhibitors (Sigma-Aldrich, USA). Cell lysates were centrifuged at 12,000 × g for 15 min at 4 °C, and the supernatant was collected. Protein concentrations were determined using the BCA Protein Assay Kit (Thermo Fisher Scientific, USA) according to the manufacturer’s protocol. Equal amounts of protein (30–50 µg) were loaded onto 10–12% SDS-polyacrylamide gels, separated by electrophoresis, and transferred to polyvinylidene fluoride (PVDF) membranes (Millipore, USA) using a Bio-Rad wet transfer system at 100 V for 90 min. Membranes were blocked with 5% non-fat milk in TBS-T buffer (Tris-buffered saline containing 0.1% Tween-20) for 1 h at room temperature and incubated overnight at 4 °C with primary antibodies diluted in blocking buffer. The following primary antibodies were used: p53 (Cell Signaling Technology, CST 2524T, 1:1000), BAX (Proteintech, 60267-1-Ig, 1:1000), BCL-2 (Proteintech, 68103-1-Ig, 1:1000), PARP (Santa Cruz Biotechnology, sc-8007, 1:1000), cleaved PARP (Santa Cruz Biotechnology, sc-56196, 1:1000), caspase-3 (Beyotime, AF1213, 1:1000), cleaved caspase-3 (Beyotime, AF1261, 1:1000), and β-actin (Cell Signaling Technology, CST 4970, 1:2000), which served as the loading control. After washing three times with TBS-T, membranes were incubated with HRP-conjugated secondary antibodies (anti-mouse or anti-rabbit, CST 7076 S/7074S, 1:5000) for 1 h at room temperature, followed by three washes with TBS-T. Proteins were detected using an enhanced chemiluminescence (ECL) substrate (Thermo Fisher Scientific, USA), and images were captured using a Bio-Rad ChemiDoc XRS + Imaging System. Band intensities were quantified using ImageJ software, normalized to β-actin, and expressed as fold changes relative to the control group. Immunofluorescence assays After HCT116 and SW480 cells were seeded onto glass coverslips, they were treated with HJ-4 (8, 16, 32 µM) and piperine (32 µM) for 24 h, respectively. After treatment, the cells were fixed with 4% paraformaldehyde at room temperature for 15 min, permeabilized with 0.1% Triton X-100 for 10 min to enhance membrane permeability, and then blocked with 5% BSA for 1 h to prevent nonspecific binding. The cells were incubated overnight at 4 °C with primary antibodies against p53 and BAX. Following this, corresponding species-specific Alexa Fluor secondary antibodies were applied and incubated at room temperature for 1 h in the dark. Finally, the cell nuclei were stained with DAPI for 5 min. After mounting with anti-fade mounting medium, samples were analyzed using a fluorescence microscope with multiple channels for image acquisition. Image overlay analysis was performed using ImageJ software. The untreated group was set as a negative control, and the experiment was repeated three times to verify the reliability of the results. YO-PRO-1/PI staining HCT116 cells were seeded onto sterile cover slips placed in a 6-well plate and incubated overnight at 37 °C in a 5% CO₂ incubator to allow cell attachment. After attachment, different concentrations of HJ-4 (e.g., 8, 16, 32 µM) were added for 24 h. Following treatment, the culture medium was discarded, and cells were gently washed three times with pre-warmed PBS to remove any residual drug. After PBS removal, 1 µM YO-PRO-1 and 5 µg/mL propidium iodide (PI) were added as a mixed staining solution to each well, and cells were stained for 30 min at 37 °C in the dark. After staining, cells were washed again with PBS to remove excess dye, and the cover slips were inverted onto slides. Images were captured using a fluorescence microscope equipped with dual-channel filters, and the images were analyzed using ImageJ software to calculate the apoptosis/necrosis ratio for each treatment group. Chicken embryo chorioallantoic membrane (CAM) model This study utilized the chicken embryo chorioallantoic membrane (CAM) model to evaluate the anti-tumor and anti-angiogenic effects of HJ-4. Fertilized eggs were obtained from Wufeng Poultry Farm in Tongling City, Anhui Province, China, and incubated at 37 °C with 50% humidity until the seventh day of embryonic development (E7). The eggs were opened at the air sac end (approximately 1.5 cm in diameter) using sterile techniques to expose the CAM. Tumor spheroids derived from HCT116 and SW480 colon cancer cell lines (prepared by adding 1 × 10⁶ cells to 50 µL of matrigel) were implanted into the vascular-rich regions of the CAM. Subsequently, HJ-4 (8, 16, 32 µM) or the positive control piperine (32 µM) was applied locally to the tumor site daily for 7 days. Tumor tissues were excised, weighed using an analytical balance, and morphological characteristics were recorded. Additionally, the number of tertiary blood vessels radiating in a 2 mm radius around the tumor was quantified to assess the anti-angiogenic effect. All procedures strictly followed the guidelines of the Biological Ethics Committee of Jiangsu Ocean University, and the egg windows were kept sealed throughout the experiment to ensure embryo survival. Each group consisted of six biological replicates to ensure data reliability. Statistical analysis Data are presented as mean ± standard deviation (SD) from at least three independent experiments. Statistical comparisons between groups were performed using one-way analysis of variance (ANOVA) followed by Tukey’s post hoc test for multiple comparisons or Student’s t-test for two-group comparisons. p Results Synthesis of HJ-4 Synthetic approach to HJ-4 is concise and described in Fig. 1 2 2  Fig. 1 Synthetic approach to HJ-4. Reagents and conditions: ( a b N N 3 In vitro antitumor activity of HJ-4 Human renal epithelial cells (293T) were used as a non-tumorigenic control to evaluate the in vitro antitumor activity of HJ-4 across a panel of cancer cell lines, including renal (A498), cervical (HeLa), and colorectal (HCT116 and SW480) cancer cells. Cell viability was assessed using the MTT assay, and results showed that HJ-4 significantly inhibited the growth of these cancer cells. Notably, HJ-4 exhibited a markedly lower IC 50 50 50 2 2 2 2 2  Fig. 2 Evaluation of the in vitro antitumor activity of HJ-4. ( A 50 50 50 B C D C D E G E G F H n p p p p p p p p HJ-4 inhibits adhesion, migration and invasion of colon cancer cells Adhesion, migration, and invasion assays were performed in colon cancer cell lines HCT116 and SW480 to evaluate the anti-metastatic effects of HJ-4. In the cell adhesion assays, HJ-4 significantly inhibited the adhesion of both HCT116 and SW480 cells in a dose-dependent manner. As shown in Fig. 3 3 3 3 3  Fig. 3 Effects of HJ-4 on adhesion, migration and invasion of HCT116 and SW480 cells. ( A B A B C F C E C E D F G H G H n p p p p p p p p HJ-4 potently inhibits angiogenesis and tumor growth in colon cancer models To evaluate the anti-angiogenic and anti-tumor activities of HJ-4, we employed the chick embryo chorioallantoic membrane (CAM) model based on the following considerations: (1) The CAM model is simple to operate, time-efficient, cost-effective, and subject to minimal ethical restrictions, making it suitable for the preliminary screening of novel compounds; (2) its rich vascular network allows for intuitive observation of tumor growth and angiogenesis; (3) our laboratory has established a well-optimized CAM assay system with strong technical feasibility. Representative images (Fig. 4 4 4 4  Fig. 4 HJ-4 suppresses angiogenesis and tumor growth in colon cancer models. Colon cancer spheroids derived from HCT116 and SW480 cells were implanted into the vascular-rich region of the CAM. HJ-4 (8, 16, and 32 µM) or the positive control Piperine (32 µM) was topically applied to the tumor area daily for 7 consecutive days. Tumors were then excised, weighed, and vascular-like structures were recorded. ( A B C B C n D E D E F G F G n p p p p p p p p HJ-4 induces apoptosis via activation of p53 signaling in colon cancer cells To elucidate the molecular mechanisms underlying the antitumor effects of HJ-4, transcriptomic and protein expression analyses were performed. Transcriptome analysis identified a total of 257 differentially expressed genes, among which pro-apoptotic genes—such as PUMA (also known as BBC3)—were significantly upregulated (Fig. 5 p p p p 5 5 5  Fig. 5 Transcriptomic analysis of HCT116 cells treated with HJ-4, emphasizing the activation of p53 signaling and apoptosis pathways. ( A B A B p C D p p p p E F G F G H At the protein level, Western blot analysis confirmed a dose-dependent upregulation of p53, PUMA, and BAX, along with the activation of cleaved caspase-3 and cleaved PARP (Fig. 6 S5 S6 6 6 6 6 6  Fig. 6 HJ-4 induces apoptosis through p53 pathway activation in HCT116 cells. ( A B C D E F n p p p p p p p p Discussion This study systematically evaluated the antitumor activity and mechanism of action of HJ-4, a novel piperine derivative in colorectal cancer. The results showed that HJ-4 exhibited good tumor selectivity and multi-target intervention ability, significantly inhibiting the proliferation, migration, invasion, angiogenesis, and growth of colorectal cancer cells, demonstrating a high potential for clinical translation. HJ-4 exhibits excellent target specificity, demonstrating significantly stronger cytotoxicity than its parent compound, piperine, in the HCT116 cell model, with a 2.6-fold increase in potency. Notably, while HJ-4 effectively eliminates cancer cells, it shows minimal toxicity toward normal human renal epithelial cells, indicating a favorable safety profile. In addition to its selective cytotoxicity, HJ-4 displays multi-faceted anti-tumor activities. In vitro studies revealed that it not only markedly inhibits the proliferation of colorectal cancer cells but also effectively suppresses their adhesion, migration, and invasion, highlighting its potent anti-proliferative and anti-invasive properties 19 20 In mechanistic studies, transcriptomic analysis revealed that HJ-4 simultaneously regulates both p53-dependent and independent pathways, including the inhibition of E2F_TARGETS and Wnt/β-catenin signaling pathways 21 23 24 25 26 27 The clarity of the molecular mechanisms of HJ-4, along with its significant antitumor activity both in vitro and in vivo, lays a solid foundation for its preclinical translation and widespread application in malignant tumors such as colorectal cancer. However, several key issues still need to be explored, including elucidating its pharmacokinetic properties in vivo, establishing a safe dose range through preclinical toxicity studies, expanding its efficacy evaluation in p53 wild-type and mutant tumors, and exploring combination therapy 28 In summary, HJ-4, as an anticancer candidate drug derived from the structural optimization of piperine, shows significant advantages in multi-target antitumor effects and represents an important advance in the development of drugs for colorectal cancer. This study systematically elucidated its mechanism of action and in vitro and in vivo activity, laying a solid foundation for its preclinical research and future application in solid tumors such as colorectal cancer. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Luyao Zhang, Shunfang Liu, Dan Wang and Xingyu Zhang contributed equally to this work. Author contributions B.L. and W.L. designed the study. L.Z., S.L., D.W., X.Z., Z.H., X.Z., X.L. and X.W. performed the experimental work. L.Z., S.L., D.W., X.Z., Z.H., X.Z., X.L. and X.W. analyzed the experimental results. B.L., L.Z. and D.X. curated the data, performed the statistical analysis and created the figures. B.L., L.Z. and D.X. drafted the paper and corrected the manuscript. All the authors have accepted the final version of the manuscript. Funding This study was supported by the National Natural Science Foundation of China (82273167), Jiangsu Province Basic Research Program Natural Science Foundation (Outstanding Youth Fund Project, BK20220063), the Key Program of Basic Science (Natural Science) of Jiangsu Province (22KJA350001), “Huaguo Mountain Talent Plan” of Lianyungang City (Innovative Talents Liu Bin), Chen Xiao-Ping Foundation for the Development of Science and Technology of Hubei Province (project No.CXPJJH123003-027), Scientific Research Foundation for Returned Scholars of Tongji Hospital (project No.2022hgry021), and Scientific Research Fund of Tongji Hospital (project No.2023A09). Data availability The data discussed in this article have been deposited in the Gene Expression Omnibus (GEO) database at NCBI (Edgar et al., 2002) and are accessible through GEO Series Accession Number GSE282967 GSE282967 Declarations Competing interests The authors declare no competing interests. References 1. Dekker E Tanis PJ Vleugels JLA Kasi PM Wallace MB Colorectal cancer Lancet 2019 394 1467 1480 10.1016/s0140-6736(19)32319-0 31631858 Dekker, E., Tanis, P. J., Vleugels, J. L. A., Kasi, P. M. & Wallace, M. B. Colorectal cancer. Lancet 394 31631858 10.1016/S0140-6736(19)32319-0 2. Li J Ma X Chakravarti D Shalapour S DePinho RA Genetic and biological hallmarks of colorectal cancer Genes Dev. 2021 35 787 820 10.1101/gad.348226.120 34074695 PMC8168558 Li, J., Ma, X., Chakravarti, D., Shalapour, S. & DePinho, R. A. Genetic and biological hallmarks of colorectal cancer. Genes Dev. 35 34074695 10.1101/gad.348226.120 PMC8168558 3. Patel SG Karlitz JJ Yen T Lieu CH Boland CR The rising tide of early-onset colorectal cancer: A comprehensive review of epidemiology, clinical features, biology, risk factors, prevention, and early detection Lancet Gastroenterol. Hepatol. 2022 7 262 274 10.1016/s2468-1253(21)00426-x 35090605 Patel, S. G., Karlitz, J. J., Yen, T., Lieu, C. H. & Boland, C. R. The rising tide of early-onset colorectal cancer: A comprehensive review of epidemiology, clinical features, biology, risk factors, prevention, and early detection. Lancet Gastroenterol. Hepatol. 7 35090605 10.1016/S2468-1253(21)00426-X 4. Hanahan D Hallmarks of cancer: New dimensions Cancer Discov. 2022 12 31 46 10.1158/2159-8290.Cd-21-1059 35022204 Hanahan, D. Hallmarks of cancer: New dimensions. Cancer Discov 12 35022204 10.1158/2159-8290.CD-21-1059 5. Chen, J. The cell-cycle arrest and apoptotic functions of p53 in tumor initiation and progression. Cold Spring Harb. Perspect. Med. 6 10.1101/cshperspect.a026104 PMC4772082 26931810 6. Vaddavalli PL Schumacher B The p53 network: Cellular and systemic DNA damage responses in cancer and aging Trends Genet. 2022 38 598 612 10.1016/j.tig.2022.02.010 35346511 Vaddavalli, P. L. & Schumacher, B. The p53 network: Cellular and systemic DNA damage responses in cancer and aging. Trends Genet. 38 35346511 10.1016/j.tig.2022.02.010 7. Engeland K Cell cycle arrest through indirect transcriptional repression by p53: I have a DREAM Cell. Death Differ. 2018 25 114 132 10.1038/cdd.2017.172 29125603 PMC5729532 Engeland, K. Cell cycle arrest through indirect transcriptional repression by p53: I have a DREAM. Cell. Death Differ. 25 29125603 10.1038/cdd.2017.172 PMC5729532 8. Liebl, M. C. & Hofmann, T. G. The role of p53 signaling in colorectal cancer. Cancers (Basel) 13 10.3390/cancers13092125 PMC8125348 33924934 9. Liu J Wnt/β-catenin signalling: Function, biological mechanisms, and therapeutic opportunities Signal. Transduct. Target. Ther. 2022 7 3 10.1038/s41392-021-00762-6 34980884 PMC8724284 Liu, J. et al. Wnt/β-catenin signalling: Function, biological mechanisms, and therapeutic opportunities. Signal. Transduct. Target. Ther. 7 34980884 10.1038/s41392-021-00762-6 PMC8724284 10. Yu F Wnt/β-catenin signaling in cancers and targeted therapies Signal. Transduct. Target. Ther. 2021 6 307 10.1038/s41392-021-00701-5 34456337 PMC8403677 Yu, F. et al. Wnt/β-catenin signaling in cancers and targeted therapies. Signal. Transduct. Target. Ther. 6 34456337 10.1038/s41392-021-00701-5 PMC8403677 11. Kent LN Leone G The broken cycle: E2F dysfunction in cancer Nat. Rev. Cancer 2019 19 326 338 10.1038/s41568-019-0143-7 31053804 Kent, L. N. & Leone, G. The broken cycle: E2F dysfunction in cancer. Nat. Rev. Cancer 19 31053804 10.1038/s41568-019-0143-7 12. Malki, A. et al. Molecular mechanisms of colon cancer progression and metastasis: Recent insights and advancements. Int. J. Mol. Sci. 22 10.3390/ijms22010130 PMC7794761 33374459 13. Atanasov AG Zotchev SB Dirsch VM Supuran CT Natural products in drug discovery: Advances and opportunities Nat. Rev. Drug Discov 2021 20 200 216 10.1038/s41573-020-00114-z 33510482 PMC7841765 Atanasov, A. G., Zotchev, S. B., Dirsch, V. M. & Supuran, C. T. Natural products in drug discovery: Advances and opportunities. Nat. Rev. Drug Discov. 20 33510482 10.1038/s41573-020-00114-z PMC7841765 14. Benayad, S. et al. The promise of Piperine in cancer chemoprevention. Cancers (Basel) 15 10.3390/cancers15225488 PMC10670142 38001748 15. Rather RA Bhagat M Cancer chemoprevention and piperine: Molecular mechanisms and therapeutic opportunities Front. Cell. Dev. Biol. 2018 6 10 10.3389/fcell.2018.00010 29497610 PMC5818432 Rather, R. A. & Bhagat, M. Cancer chemoprevention and piperine: Molecular mechanisms and therapeutic opportunities. Front. Cell. Dev. Biol. 6 29497610 10.3389/fcell.2018.00010 PMC5818432 16. Ran S Piperine alleviates nonalcoholic steatohepatitis by inhibiting NF-κB-mediated hepatocyte pyroptosis PLoS One 2024 19 e0301133 10.1371/journal.pone.0301133 38547097 PMC10977780 Ran, S. et al. Piperine alleviates nonalcoholic steatohepatitis by inhibiting NF-κB-mediated hepatocyte pyroptosis. PLoS One 19 38547097 10.1371/journal.pone.0301133 PMC10977780 17. Hakeem AN Piperine enhances doxorubicin sensitivity in triple-negative breast cancer by targeting the PI3K/Akt/mTOR pathway and cancer stem cells Sci. Rep. 2024 14 18181 10.1038/s41598-024-65508-0 39107323 PMC11303729 Hakeem, A. N. et al. Piperine enhances doxorubicin sensitivity in triple-negative breast cancer by targeting the PI3K/Akt/mTOR pathway and cancer stem cells. Sci. Rep. 14 39107323 10.1038/s41598-024-65508-0 PMC11303729 18. Xia Y Piperine inhibits IL-1β-induced IL-6 expression by suppressing p38 MAPK and STAT3 activation in gastric cancer cells Mol. Cell. Biochem. 2015 398 147 156 10.1007/s11010-014-2214-0 25234193 Xia, Y. et al. Piperine inhibits IL-1β-induced IL-6 expression by suppressing p38 MAPK and STAT3 activation in gastric cancer cells. Mol. Cell. Biochem. 398 25234193 10.1007/s11010-014-2214-0 19. Trepat X Chen Z Jacobson K Cell migration Compr. Physiol. 2012 2 2369 2392 10.1002/cphy.c110012 23720251 PMC4457291 Trepat, X., Chen, Z. & Jacobson, K. Cell migration. Compr. Physiol. 2 23720251 10.1002/cphy.c110012 PMC4457291 20. Tang Q TM4SF1 promotes EMT and cancer stemness via the Wnt/β-catenin/SOX2 pathway in colorectal cancer J. Exp. Clin. Cancer Res. 2020 39 232 10.1186/s13046-020-01690-z 33153498 PMC7643364 Tang, Q. et al. TM4SF1 promotes EMT and cancer stemness via the Wnt/β-catenin/SOX2 pathway in colorectal cancer. J. Exp. Clin. Cancer Res. 39 33153498 10.1186/s13046-020-01690-z PMC7643364 21. Bian, J., Dannappel, M., Wan, C. & Firestein, R. Transcriptional regulation of Wnt/β-Catenin pathway in colorectal cancer. Cells 9 10.3390/cells9092125 PMC7564852 32961708 22. Cheng X Xu X Chen D Zhao F Wang W Therapeutic potential of targeting the Wnt/β-catenin signaling pathway in colorectal cancer Biomed. Pharmacother. 2019 110 473 481 10.1016/j.biopha.2018.11.082 30530050 Cheng, X., Xu, X., Chen, D., Zhao, F. & Wang, W. Therapeutic potential of targeting the Wnt/β-catenin signaling pathway in colorectal cancer. Biomed. Pharmacother. 110 30530050 10.1016/j.biopha.2018.11.082 23. Fukumura D Kloepper J Amoozgar Z Duda DG Jain RK Enhancing cancer immunotherapy using antiangiogenics: Opportunities and challenges Nat. Rev. Clin. Oncol. 2018 15 325 340 10.1038/nrclinonc.2018.29 29508855 PMC5921900 Fukumura, D., Kloepper, J., Amoozgar, Z., Duda, D. G. & Jain, R. K. Enhancing cancer immunotherapy using antiangiogenics: Opportunities and challenges. Nat. Rev. Clin. Oncol. 15 29508855 10.1038/nrclinonc.2018.29 PMC5921900 24. Hassin O Oren M Drugging p53 in cancer: One protein, many targets Nat. Rev. Drug Discov. 2023 22 127 144 10.1038/s41573-022-00571-8 36216888 PMC9549847 Hassin, O. & Oren, M. Drugging p53 in cancer: One protein, many targets. Nat. Rev. Drug Discov. 22 36216888 10.1038/s41573-022-00571-8 PMC9549847 25. Li M The role of P53 up-regulated modulator of apoptosis (PUMA) in ovarian development, cardiovascular and neurodegenerative diseases Apoptosis 2021 26 235 247 10.1007/s10495-021-01667-z 33783663 PMC8197724 Li, M. The role of P53 up-regulated modulator of apoptosis (PUMA) in ovarian development, cardiovascular and neurodegenerative diseases. Apoptosis 26 33783663 10.1007/s10495-021-01667-z PMC8197724 26. Spitz AZ Gavathiotis E Physiological and Pharmacological modulation of BAX Trends Pharmacol. Sci. 2022 43 206 220 10.1016/j.tips.2021.11.001 34848097 PMC8840970 Spitz, A. Z. & Gavathiotis, E. Physiological and Pharmacological modulation of BAX. Trends Pharmacol. Sci. 43 34848097 10.1016/j.tips.2021.11.001 PMC8840970 27. Yuan Z Dewson G Czabotar PE Birkinshaw RW VDAC2 and the BCL-2 family of proteins Biochem. Soc. Trans. 2021 49 2787 2795 10.1042/bst20210753 34913469 PMC8786305 Yuan, Z., Dewson, G., Czabotar, P. E. & Birkinshaw, R. W. VDAC2 and the BCL-2 family of proteins. Biochem. Soc. Trans. 49 34913469 10.1042/BST20210753 PMC8786305 28. Zhu S Combination strategies to maximize the benefits of cancer immunotherapy J. Hematol. Oncol. 2021 14 156 10.1186/s13045-021-01164-5 34579759 PMC8475356 Zhu, S. et al. Combination strategies to maximize the benefits of cancer immunotherapy. J. Hematol. Oncol. 14 34579759 10.1186/s13045-021-01164-5 PMC8475356 ",
  "metadata": {
    "Title of this paper": "Combination strategies to maximize the benefits of cancer immunotherapy",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480698/"
  }
}