{
  "title": "Paper_664",
  "abstract": "pmc Int J Environ Res Public Health Int J Environ Res Public Health 876 ijerph ijerph International Journal of Environmental Research and Public Health 1661-7827 1660-4601 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469662 PMC12469662.1 12469662 12469662 41007466 10.3390/ijerph22091322 ijerph-22-01322 1 Communication Strengthening Integrative Microbiome Research Through Regional Leadership https://orcid.org/0000-0003-1880-0498 Godoy-Vitorino Filipa Prescott Susan Academic Editor Department of Microbiology and Medical Zoology, University of Puerto Rico, Medical Sciences Campus, San Juan, PR 00936, USA; filipa.godoy@upr.edu 26 8 2025 9 2025 22 9 497640 1322 23 6 2025 03 8 2025 04 8 2025 26 08 2025 27 09 2025 29 09 2025 © 2025 by the author. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Microbiome science has revolutionized modern biology, shifting the focus from pathogens to the essential roles of beneficial microbes in health, metabolism, and ecosystems. Advances in genomic technologies like metagenomics have rapidly expanded our understanding of microbial diversity and function. Despite this progress, global microbiome research remains concentrated in high-resource regions, limiting diverse perspectives and opportunities in places like the Caribbean. This communication discusses the establishment of the first Center for Microbiome Sciences in Puerto Rico, which addresses this gap by providing local researchers with access to advanced tools, training, and infrastructure through broader collaboration. Novelty, services, and ideas on the integration of activities among local centers for the scientific improvement of the region are addressed. Additionally, how the center is poised to contribute to improving public and environmental health is also highlighted. microbiome training the Puerto Rico Center for Microbiome Sciences Institutional National Institute of General Medical Sciences of the National Institutes of Health NIGMS-NIH COBRE Puerto Rico Center for Microbiome Sciences #1P20GM156713-01 PR-INBRE P20 GM103475 Center for Collaborative Research in Minority Health and Health Disparities 2U54MD007600 This article was supported by the Institutional National Institute of General Medical Sciences of the National Institutes of Health (NIGMS-NIH COBRE Puerto Rico Center for Microbiome Sciences, award #1P20GM156713-01). Partial support was given by PR-INBRE P20 GM103475 and the Center for Collaborative Research in Minority Health and Health Disparities 2U54MD007600. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The rapid growth of microbiome research has fundamentally reshaped modern biology, significantly influencing our understanding of health and disease. Microbiologists have progressively moved from studying isolated pathogenic bacteria toward exploring entire microbiomes, with a particular emphasis on beneficial microbes, their roles, and their interactions within hosts. The accessibility and affordability of sequencing technologies have significantly accelerated these advancements. It is increasingly recognized that animals, including humans, host coevolving microbial communities, known collectively as microbiomes [ 1 2 Numerous studies have shown that beneficial microbes play a critical role in maintaining the health of nearly all organisms, including humans. Microbial cells are at least as abundant as human cells, and microbial genes outnumber human genes within the combined entity known as the holobiont [ 3 However, microbiome research and training is primarily conducted in research-intensive areas of the world, located largely in economically privileged regions such as North America and Europe [ 4 2. The Microbiome as a Critical Interface Between Human and Environmental Health Microbial–host interactions occur both locally and systemically, shaping key biological processes such as immune regulation, developmental signaling, energy metabolism, and the maintenance of epithelial integrity [ 5 6 7 6 8 4 9 10 10 11 12 13 14 Preserving microbial diversity is essential for the stability and long-term sustainability of global ecosystems and genetic resources, including those within the human body. While outdoor environments harbor significantly greater microbial diversity due to interactions with plants, animals, soil, and air, built environments (BEs) such as homes, schools, and hospitals are also dynamic microbial ecosystems shaped by human activity and environmental exposure [ 15 Understanding the interplay between human microbiota, environmental exposures, public health, and lifestyle is critical for advancing our knowledge of health and disease. To support this integrated vision, microbiome centers—such as the COBRE Puerto Rico Center for Microbiome Sciences—are vital. These centers are uniquely positioned to lead efforts in microbial inventorying, interdisciplinary training, and the development of regionally relevant research priorities. This mission aligns closely with the One Health framework, which emphasizes the interconnectedness of human, animal, and environmental health [ 16 In parallel, global efforts like the Microbiota Vault Initiative [ 17 17 3. Role of a Microbiome Center to Foster Regional Scientific Development Despite the Caribbean’s rich biodiversity and unique public health challenges, microbiome research from the region remains severely underrepresented in the global scientific literature [ 4 Lactobacillus iners 18 19 20 21 22 23 Diadema antillarum 24 Tripneustes ventricosus 25 26 27 Staphylococcus Streptococcus 28 Alternaria 29 30 31 32 32 32 The establishment of the COBRE Puerto Rico Center for Microbiome Sciences (PR-CMS) represents a significant step toward advancing and expanding scientific development by addressing key needs in microbiome research. The Center will play a pivotal role in nurturing junior investigators, guiding them toward becoming competitive, independent researchers and developing independent microbiome projects. The Center will support innovative projects with broad biomedical relevance by selecting meritorious junior faculty for dedicated mentorship and providing resources for their development. A structured mentorship program that integrates guidance from program leaders, project mentors, and advisory committees ensures comprehensive professional growth. The infrastructure basically composes three areas, an administrative core, where most training and management activities derive from; a research support core, where microbiome analyses are at its heart, providing novel services for the community; and a faculty development core, offering unique opportunities for the training of faculty into more competitive researchers. This core will help faculty become better mentors, become more productive researchers in terms of lab and time management skills, grantsmanship, and navigate institutional processes. The COBRE will facilitate interdisciplinary collaborations that are essential for advancing microbiome research at both the fundamental and translational levels. It will organize faculty career enhancement activities, including laboratory management, grant writing, and manuscript preparation, while promoting a collaborative culture through seminars, conferences, and meetings. These initiatives enhance the professional skills of researchers at all levels, expanding their research capabilities and fostering collaborations in the U.S. and globally. The dedicated Microbiome Research Core will be its primary staple, by providing the state-of-the-art instrumentation and technical expertise essential for advanced microbiome research. Most microbiome research published in Puerto Rico has depended on a single lab’s short-term data analyses support (Godoy lab), with most of the support being offered on a voluntary and collaborative basis and involving students. Additional support is often given to predominantly undergraduate institution (PUI) projects, mostly supported by PR-INBRE, whose mission is to promote biomedical research infrastructure in Puerto Rico, advancing research resources and opportunities for PUIs. An exclusive microbiome research core will be transformative for the region, as it will support meritorious scientists and students, facilitating complex genomic analyses and bioinformatics support, as well as support the development of SOPs and biosafety protocols. Additionally, workshops will be available to train students and faculty on the use of bioinformatic pipelines and best practices, including partnerships in training opportunities with other microbiome centers. Through specialized services, this research core will expand technical competencies and increase the publication output in microbiome research in Puerto Rico, positioning local researchers at the forefront of microbiome science. Overall, this center will be unique in its capacity to foster a collaborative and innovative research environment, equipping local scientists with the essential tools, resources, and expertise to significantly enhance scientific development and drive meaningful advancements in microbiome sciences. As previously highlighted, microbiome centers significantly enhance the regional research capacity by functioning as interdisciplinary hubs [ 33 34 4. Strengthening Infrastructure and Research Capabilities in Microbiome Research This novel project is transformative at all levels, but is most important due to its unique offering of centralized support for the analysis and integration of microbial community data. This includes the characterization of microbiomes via amplicon sequencing (e.g., 16S, ITS, and 18S rRNA) and the construction of high-quality metagenomes from complex, host-associated, or environmental samples. These services will be coupled with expertise in meta-omics data integration, supporting a wide range of biomedical and ecological research applications. It will also be open to industry and medical doctors for microbiome services and reports of biodiversity with expert analyses. Designed to support both clinical and environmental studies, it will offer services to a wide range of researchers, from academic scientists to healthcare professionals and industry partners. As the first dedicated microbiome-focused core of its kind in Puerto Rico, the facility establishes a much-needed hub for microbiome science. Its primary mission is to enable innovative, interdisciplinary research that addresses questions regarding microbial diversity and function across health, agriculture, and environmental sciences. It will help design, develop, and publish innovative work in microbiome discovery. In doing so, it will complement and amplify the capabilities of existing institutional cores, creating a more integrated and efficient research ecosystem. In detail, it will have two main goals: (1) To provide a metagenomics sample preparation area that will feature automated systems for nucleic acid extraction and library preparation, enabling high-throughput sequencing of diverse biological samples—including soil, water, plant, animal, and human sources. It will support biosafety planning, study design, and downstream molecular analysis with efficient, high-quality workflows. (2) To become the first data analysis bioinformatics center that provides access to advanced computing resources and expert bioinformatics support in microbiome research, assisting researchers in processing, analyzing, and visualizing microbiome data. Bioinformaticians and microbiome scientists will support workflow design, data standardization, and reproducibility, with user guides and SOPs to ensure accessibility for all experience levels. This integrated facility will be designed to serve the PR-CMS investigators and function as a shared resource that benefits researchers across the island and links with national and international partners. Importantly, the PR-CMS Core will also become part of the U.S. Microbiome Centers of Excellence Consortium (US-MCC) [ 34 35 36 This national integration will enable PR-CMS to access and share protocols, collaborate on multi-site projects, and participate in data-sharing and workforce development initiatives at scale. Through these relationships, the PR-CMS will facilitate tailored training programs and short courses to develop the skills needed by early-career investigators and student researchers, further strengthening Puerto Rico’s scientific workforce. Together, this coordinated infrastructure will expand access to critical tools and expertise, foster interdisciplinary collaboration, and create lasting capacity for excellence in microbiome science—serving Puerto Rico, the region, and the global scientific community. 5. Maximizing Multiple Center Grants Can Lead to Real Competitive Change Puerto Rico has a vibrant scientific ecosystem. It benefits from an active and collaborative scientific environment that is supported by multiple NIH and NSF programs and the Puerto Rico Science, Technology and Research Trust a nonprofit organization sustaining and advancing R&D in Puerto Rico. Now, the PR-CMS, focusing on advancing microbiome-driven projects, is expected to be integrated into this environment, working synergistically with other research centers to strengthen biomedical innovation across the island. The PR-CMS Microbiome Research Core will align closely with existing NIH-supported infrastructure across Puerto Rico, including the Data Science Core (DSC), the PR-INBRE Genomics and Metabolomics Cores, the High-Performance Computing Facility (HPCF), and the Sequencing and Genotyping Facility (SGF) (P20GM103475-22). These already established cores, with sequencers, servers, and bioinformaticians, will contribute in turn to this new COBRE center. These facilities, located within the UPR system, already serve as a foundational platform for molecular and computational research. The PR-CMS Core will enhance its capacity by contributing specialized personnel, technical expertise, and complementary resources to support advanced microbiome studies and will leverage shared infrastructure for training, data analysis, and joint programming. Further integration with NIH Centers of Biomedical Research Excellence (COBRE) programs will expand scientific scope. The COBRE Phase III Center for Neuroplasticity (5P30GM149367-02), based at UPR-Rio Piedras, presents natural opportunities for interdisciplinary collaboration on gut–brain–microbiome interactions, behavior, and neurological disorders. The COBRE Center for the Promotion of Cancer Health Equity (CePCHE) (1P20GM148324-01) aligns with PR-CMS in exploring microbiome-related cancer disparities affecting Hispanic populations. Through shared efforts in basic, translational, and clinical research, these centers will collectively enhance UPR’s capacity in cancer and neuroscience. In addition, the Center for Collaborative Research in Health Disparities/RCMI program (5U54MD007600-38) at UPR supports most translational studies in health disparities affecting the Puerto Rican population and offers strong potential for collaboration in extending microbiome science to underserved communities. For studies on the human microbiome, another clear partner is The Alliance 6. Implications for Health Promotion, Environmental Research, and Public Health Outcomes The establishment of the Puerto Rico Center for Microbiome Sciences (PR-CMS) represents a transformative initiative with direct implications for health promotion, environmental research, and public well-being. As awareness of the human microbiome is emerging as a powerful catalyst for healthier living and more ecologically attuned mindsets, this center will strengthen this, as not only research but education will be supported. As highlighted in recent research [ 37 7. Conclusions Microbial–host interactions are fundamental to health, influencing immunity, development, and metabolism, with niche-specific microbiomes—especially in the gut—providing essential yet individualized functions shaped by environment, lifestyle, and genetics. The integration of microbiome science into One Health underscores the interconnectedness of human, animal, and ecosystem health, highlighting the need for regional microbiome research centers. The launch of the Puerto Rico Center for Microbiome Sciences (PR-CMS) marks a significant step in positioning Puerto Rico as a leader in microbiome research. As the first center of its kind in the Caribbean and a member of the U.S. Microbiome Centers of Excellence Consortium, PR-CMS will support world-class science while expanding global partnerships. With microbiome science advancing rapidly, this new Center will address critical health and environmental questions. Its research will be grounded in Puerto Rico’s public health priorities and unique ecosystems, offering global relevance and local impact. PR-CMS will combine advanced bioinformatics capabilities with local, national, and international collaboration through joint symposia and training programs. This initiative strengthens Puerto Rico’s research infrastructure while providing a platform for inclusive discovery and innovation. Therefore, Puerto Rico is not just participating in the microbiome revolution but helping lead it. Disclaimer/Publisher’s Note: Conflicts of Interest The author declares no conflicts of interest. References 1. Godoy-Vitorino F. Human microbial ecology and the rising new medicine Ann. Transl. Med. 2019 7 342 10.21037/atm.2019.06.56 31475212 PMC6694241 2. Dominguez-Bello M.G. Godoy-Vitorino F. Knight R. Blaser M.J. Role of the microbiome in human development Gut 2019 68 1108 1114 10.1136/gutjnl-2018-317503 30670574 PMC6580755 3. Rosenberg E. Zilber-Rosenberg I. Microbiotas Are Transmitted Between Holobiont Generations The Hologenome Concept: Human, Animal and Plant Microbiota Springer Cham, Switzerland 2014 4. Godoy-Vitorino F. Solutions to expand microbiome sciences in the Caribbean Region: An insider’s perspective Trends Microbiol. 2025 33 475 478 10.1016/j.tim.2024.12.005 39788811 PMC12058410 5. Chung H. Pamp S.J. Hill J.A. Surana N.K. Edelman S.M. Troy E.B. Reading N.C. Villablanca E.J. Wang S. Mora J.R. Gut immune maturation depends on colonization with a host-specific microbiota Cell 2012 149 1578 1593 10.1016/j.cell.2012.04.037 22726443 PMC3442780 6. Costello E.K. Lauber C.L. Hamady M. Fierer N. Gordon J.I. Knight R. Bacterial Community Variation in Human Body Habitats Across Space and Time Science 2009 326 1694 1697 10.1126/science.1177486 19892944 PMC3602444 7. Li J. Jia H. Cai X. Zhong H. Feng Q. Sunagawa S. Arumugam M. Kultima J.R. Prifti E. Nielsen T. An integrated catalog of reference genes in the human gut microbiome Nat. Biotechnol. 2014 32 834 841 10.1038/nbt.2942 24997786 8. Lloyd-Price J. Mahurkar A. Rahnavard G. Crabtree J. Orvis J. Hall A.B. Brady A. Creasy H.H. McCracken C. Giglio M.G. Strains, functions and dynamics in the expanded Human Microbiome Project Nature 2017 550 61 66 10.1038/nature23889 28953883 PMC5831082 9. Abdill R.J. Adamowicz E.M. Blekhman R. Public human microbiome data are dominated by highly developed countries PLoS Biol 2022 20 e3001536 10.1371/journal.pbio.3001536 35167588 PMC8846514 10. Barratt M.J. Nuzhat S. Ahsan K. Frese S.A. Arzamasov A.A. Sarker S.A. Islam M.M. Palit P. Islam M.R. Hibberd M.C. Bifidobacterium infantis treatment promotes weight gain in bangladeshi infants with severe acute malnutrition Sci. Transl. Med. 2022 14 eabk1107 10.1126/scitranslmed.abk1107 35417188 PMC9516695 11. Maghini D.G. Oduaran O.H. Olubayo L.A.I. Cook J.A. Smyth N. Mathema T. Belger C.W. Agongo G. Boua P.R. Choma S.S.R. Expanding the human gut microbiome atlas of africa Nature 2025 638 718 728 10.1038/s41586-024-08485-8 39880958 PMC11839480 12. Becraft E.D. Woyke T. Jarett J. Ivanova N. Godoy-Vitorino F. Poulton N. Brown J.M. Brown J. Lau M.C.Y. Onstott T. Rokubacteria: Genomic giants among the uncultured bacterial phyla Front. Microbiol. 2017 8 2264 10.3389/fmicb.2017.02264 29234309 PMC5712423 13. Reynoso-Garcia J. Santiago-Rodriguez T.M. Narganes-Storde Y. Cano R.J. Toranzos G.A. Edible flora in pre-columbian caribbean coprolites: Expected and unexpected data PLoS ONE 2023 18 e0292077 10.1371/journal.pone.0292077 37819893 PMC10566737 14. Cano R.J. Rivera-Perez J. Toranzos G.A. Santiago-Rodriguez T.M. Narganes-Storde Y.M. Chanlatte-Baik L. García-Roldán E. Bunkley-Williams L. Massey S.E. Paleomicrobiology: Revealing fecal microbiomes of ancient indigenous cultures PloS ONE 2014 9 e106833 10.1371/journal.pone.0106833 25207979 PMC4160228 15. Prussin A.J. 2nd Marr L.C. Sources of airborne microorganisms in the built environment Microbiome 2015 3 78 10.1186/s40168-015-0144-z 26694197 PMC4688924 16. Pitt S.J. Gunn A. The One Health Concept Br. J. Biomed. Sci. 2024 81 12366 10.3389/bjbs.2024.12366 38434675 PMC10902059 17. Dominguez-Bello M.G. Steiger D. Fankhauser M. Egli A. Vonaesch P. Bokulich N.A. Lavrinienko A. Hoffmann C. Zimmermann P. Muhummed A. The microbiota vault initiative: Safeguarding Earth’s microbial heritage for future generations Nat. Commun. 2025 16 5373 10.1038/s41467-025-61008-5 40579417 PMC12205078 18. Vargas-Robles D. Romaguera J. Alvarado-Velez I. Tosado-Rodríguez E. Dominicci-Maura A. Sanchez M. Wiggin K.J. Martinez-Ferrer M. Gilbert J.A. Forney L.J. The cervical microbiota of Hispanics living in Puerto Rico is nonoptimal regardless of HPV status mSystems 2023 8 e0035723 10.1128/msystems.00357-23 37534938 PMC10469956 19. Vargas-Robles D. Morales N. Rodríguez I. Nieves T. Godoy-Vitorino F. Alcaraz L.D. Pérez M.-E. Ravel J. Forney L.J. Domínguez-Bello M.G. Changes in the vaginal microbiota across a gradient of urbanization Sci. Rep. 2020 10 12487 10.1038/s41598-020-69111-x 32719372 PMC7385657 20. Godoy-Vitorino F. Romaguera J. Zhao C. Vargas-Robles D. Ortiz-Morales G. Vázquez-Sánchez F. Sanchez-Vázquez M. de la Garza-Casillas M. Martinez-Ferrer M. White J.R. Cervicovaginal Fungi and Bacteria Associated With Cervical Intraepithelial Neoplasia and High-Risk Human Papillomavirus Infections in a Hispanic Population Front. Microbiol. 2018 9 2533 10.3389/fmicb.2018.02533 30405584 PMC6208322 21. Godoy-Vitorino F. Romaguera J. Morales G.O. Vázquez-Sánchez F. Dominicci-Maura A. Ortiz A. Malassezia globosa and Malassezia restricta are associated with high-risk HPV infections in the anogenital tract J. Low. Genit. Tract Dis. 2019 22 22. Godoy-Vitorino F. Ortiz-Morales G. Romaguera J. Sanchez M.M. Martinez-Ferrer M. Chorna N. Natarajaseenivasan K. Discriminating high-risk cervical Human Papilloma Virus infections with urinary biomarkers via non-targeted GC-MS-based metabolomics PLoS ONE 2018 13 e0209936 10.1371/journal.pone.0209936 30592768 PMC6310238 23. Diaz-Rivera J. Rodríguez-Rivera M.A. Meléndez-Vázquez N.M. Godoy-Vitorino F. Dorta-Estremera S.M. Immune and Microbial Signatures Associated with PD-1 Blockade Sensitivity in a Preclinical Model for HPV+ Oropharyngeal Cancer Cancers 2024 16 2065 10.3390/cancers16112065 38893183 PMC11171047 24. Ruiz-Barrionuevo J.M. Kardas E. Rodríguez-Barreras R. Quiñones-Otero M.A. Ruiz-Diaz C.P. Toledo-Hernández C. Godoy-Vitorino F. Shifts in the gut microbiota of sea urchin Diadema antillarum associated with the 2022 disease outbreak Front. Microbiol. 2024 15 1409729 10.3389/fmicb.2024.1409729 39135877 PMC11317302 25. Rodriguez-Barreras R. Tosado-Rodríguez E.L. Dominicci-Maura A. Godoy-Vitorino F. Effects of temperature and size class on the gut digesta microbiota of the sea urchin Tripneustes ventricosus PeerJ 2024 12 e18298 10.7717/peerj.18298 39619195 PMC11608566 26. Rodriguez-Barreras R. Dominicci-Maura A. Tosado-Rodríguez E.L. Godoy-Vitorino F. The Epibiotic Microbiota of Wild Caribbean Sea Urchin Spines Is Species Specific Microorganisms 2023 11 391 10.3390/microorganisms11020391 36838357 PMC9966300 27. Rodriguez-Barreras R. Tosado-Rodriguez E.L. Godoy-Vitorino F. Trophic niches reflect compositional differences in microbiota among Caribbean sea urchins PeerJ 2021 9 e12084 10.7717/peerj.12084 34540373 PMC8415288 28. Lee S. Zhang A. Florets M.A. de Ángel Solá D. Cao L. Bolanos-Rosero B. Wang L. Godoy-Vitorino F. Matos N.R. Wang L. Prenatal exposure to Hurricane Maria is associated with an altered infant nasal microbiome J. Allergy Clin. Immunol. Glob. 2022 1 128 137 10.1016/j.jacig.2022.05.001 36091489 PMC9461092 29. Wang R. de Ángel Solá D. Rivera-Mariani F.E. Rosero B.B. Matos N.R. Wang L. Dysbiosis in the Nasal Mycobiome of Infants Born in the Aftermath of Hurricane Maria Microorganisms 2025 13 1784 10.3390/microorganisms13081784 40871288 PMC12388473 30. Ortiz A.P. Acosta-Pagán K.T. Oramas-Sepúlveda C. Castañeda-Avila M.A. Vilanova-Cuevas B. Ramos-Cartagena J.M. Vivaldi J.A. Pérez-Santiago J. Pérez C.M. Godoy-Vitorino F. Oral microbiota and periodontitis severity among Hispanic adults Front. Cell. Infect. Microbiol. 2022 12 965159 10.3389/fcimb.2022.965159 36452304 PMC9703052 31. Sepúlveda-Rivera V. Olivieri-Henry G. Morales-González H. Ruiz-Adames J. Herrero-Rivera C. Rentas-Echeverria A. Cardona-Berdecia V. Soler-Llompart C. Sala-Morales A.C. Pérez-Montero G. Gut microbiota distinguishes aging hispanics with Alzheimer’s disease: Associations with cognitive impairment and severity Sci Rep. 2025 15 28505 10.1038/s41598-025-13262-2 40764790 PMC12325907 32. Acosta-Pagán K. Bolaños-Rosero B. Pérez C. Ortíz A.P. Godoy-Vitorino F. Ecological Competition in the Oral Mycobiome of Hispanic adults Living in Puerto Rico associates with Periodontitis J. Oral Microbiol. 2024 16 2316485 10.1080/20002297.2024.2316485 38390467 PMC10883086 33. Stulberg E. Bolaños-Rosero B. Pérez C. Ortíz A.P. Godoy-Vitorino F. An assessment of US microbiome research Nat. Microbiol. 2016 1 15015 10.1038/nmicrobiol.2015.15 27571759 34. Martiny J.B.H. Whiteson K.L. Bohannan B.J.M. David L.A. Hynson N.A. McFall-Ngai M. Rawls J.F. Schmidt T.M. Abdo Z. Blaser M.J. The emergence of microbiome centres Nat. Microbiol. 2020 5 2 3 10.1038/s41564-019-0644-x 31857734 35. Ruiz Barrionuevo J.M. Vilanova-Cuevas B. Alvarez A. Martín E. Malizia A. Galindo-Cardona A. de Cristóbal R.E. Occhionero M.A. Chalup A. Monmany-Garzia A.C. The Bacterial Fungal Gut Microbiota of the Greater Wax Moth, Galleria mellonella Front. Microbiol. 2022 13 918861 10.3389/fmicb.2022.918861 35865934 PMC9294514 36. Abarca J.G. Zuniga I. Ortiz-Morales G. Lugo A. Viquez-Cervilla M. Rodriguez-Hernandez N. Vázquez-Sánchez F. Murillo-Cruz C. Torres-Rivera E.A. Pinto-Tomás A.A. Characterization of the Skin Microbiota of the Cane Toad Rhinella cf. marina in Puerto Rico and Costa Rica Front. Microbiol. 2017 8 2624 10.3389/fmicb.2017.02624 29354109 PMC5760547 37. Rook O. Zwart H. Awareness of human microbiome may promote healthier lifestyle and more positive environmental attitudes Commun. Med. 2025 5 39 10.1038/s43856-025-00747-4 39930028 PMC11811053 ",
  "metadata": {
    "Title of this paper": "Awareness of human microbiome may promote healthier lifestyle and more positive environmental attitudes",
    "Journal it was published in:": "International Journal of Environmental Research and Public Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469662/"
  }
}