{
  "title": "Paper_1097",
  "abstract": "pmc Front Pharmacol Front Pharmacol 1524 frontpharmacol Front. Pharmacol. Frontiers in Pharmacology 1663-9812 Frontiers Media SA PMC12477430 PMC12477430.1 12477430 12477430 41031162 10.3389/fphar.2025.1663717 1663717 1 Pharmacology Original Research Comparison between the protective effect of the orally administered atorvastatin and safflower ( Carthamus tinctorius) El Rabey et al. 10.3389/fphar.2025.1663717 El Rabey Haddad A.  1 * Attia Eman S.  2  3 Bakry Nadia  4 Rezk Samar M.  5 Sharfeldin Asmaa Y.  6  1 Biochemistry Department Faculty of Science University of Tabuk Tabuk Saudi Arabia  2 School of International Education Hainan College of Economics and Business Hainan China  3 National Nutrition Institute Egypt Ministry of Health and populations Cairo Egypt  4 Bone Marrow Transplantation and Cord Blood Unit Mansoura University Mansoura Egypt  5 Clinical Nutrition Department Mahalla Hepatology Teaching Hospital Egypt Ministry of Health and Populations El-Mahalla El-Kubra Gharbyia Egypt  6 Department of Public Health and Community Medicine Faculty of Medicine Menoufia University Shebin El Kom Egypt  Edited by: Suresh Kumar Mohankumar  Reviewed by: Wahyu Widowati  Iman Nabilah Abd Rahim *Correspondence: Haddad A. El Rabey, helrabey@ut.edu.sa elrabey@hotmail.com 15 9 2025 2025 16 480654 1663717 11 7 2025 29 8 2025 15 09 2025 30 09 2025 01 10 2025 Copyright © 2025 El Rabey, Attia, Bakry, Rezk and Sharfeldin. 2025 El Rabey, Attia, Bakry, Rezk and Sharfeldin https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Hyperlipidemia is correlated with the elevation of cholesterol and triglyceride levels in the blood that increase the risk of cardiovascular events, such as heart attacks and strokes. This study aimed to test the hypolipidemic activity and other health benefits of atorvastatin and safflower ( Carthamus tinctorius Asteraceae adrenaline atorvastatin hypercholesterolemia safflower troponin vitamin D The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Ethnopharmacology 1 Introduction Hypercholesterolemia or dyslipidemia occurs when low-density lipoprotein (LDL) rises and accumulates fat in the arteries (atherosclerosis) and cardiovascular diseases, increasing the risk of heart attacks and contributing to more deaths ( El Rabey et al., 2018 Guo et al., 2022 Li et al., 2023 Al-Sieni et al., 2020 Jomova, et al., 2023 Li et al., 2023 In addition, hyperlipidemia induces oxidative stress through the buildup and oxidation of low-density lipoproteins (LDL) cholesterol in artery walls, which leads to inflammation and ultimately artery narrowing that, in turn, raises the risk of heart attacks, strokes, and cardiovascular diseases ( Zmysłowski and Szterk, 2017 Prasad and Mishra, 2022 Sawhney and Madan, 2024 Vaezi and Amini, 2025 Vaezi and Amini, 2025 Sawhney and Madan, 2024 Chemical-based medicines may cause adverse reactions, such as liver problems, nausea, drowsiness, diarrhea, or allergic reactions, known as an adverse drug reaction (ADR) ( Kommu et al., 2025 Coleman and Pontefract, 2016 El Rabey et al., 2018 Al-Sieni et al., 2020 Alshareef et al., 2024 The safflower ( Carthamus tinctorius Asteraceae Delshad et al., 2018 Adamska and Biernacka, 2021 Delshad et al., 2018 Worldwide, safflower seeds have long been used to prevent osteoporosis and encourage bone growth ( Che et al., 2016 Delshad et al., 2018 Adamska and Biernacka (2021) The FDA-approved medication atorvastatin, often known as Lipitor, is a synthetic drug of the statin class used to treat high blood pressure and heart issues by preventing cardiovascular illnesses in patients with dyslipidemia and cardiac risk factors ( Livingstone et al., 2016 Abd-Elmonsif and Gamal, 2025 Vitamin D is a micronutrient, sunlight-dependent vitamin that maintains a healthy skeleton and guards against liver fibrosis and is considered vital for numerous metabolic processes ( Che et al., 2016 Keane et al., 2018 Zhang et al., 2017 Deepika et al., 2025 in vitro in vivo Al Refaie et al., 2022 As a chemical messenger that serves as a central nervous system neurotransmitter to convey nerve impulses within nerve, muscle, or gland cells, adrenaline, also known as epinephrine, is generated by the adrenal glands and is “a part of the emergency response system to the fight-or-flight response.” Costa and Schoenbaum, 2022 Fulton et al., 2022 This study was focused at clarifying the probable hypolipidemic effect of atorvastatin and safflower in male rats with induced hypercholesterolemia. Some other therapeutic activities of both materials were also studied. 2 Materials and methods 2.1 Chemicals and test materials The safflower flowers were purchased from a spice store in Mansoura City, Egypt. The safflower flowers were identified by Dr Yasser El-Amier - A plant taxonomist at Botany Department, Faculty of Science, Mansoura University- as Carthamus tinctorius 2.2 Test diet The basal diet Ain-93, developed by the American Institute of Nutrition (AIN), was purchased from a local rodent care shop in Mansoura City, Egypt. The diet contains a balanced combination of casein, soybean oil, cellulose, cornstarch, a mineral mix, sucrose, and a vitamin mix. A 5% cholesterol was added to the basal diet for preparing the high-fat diet ( Oyetayo et al., 2020 2.3 Test animals and work plan A 7-week-old male Sprague-Dawley albino rats (n = 24, weight: 172.3 ± 0.6 g) were obtained from the Agricultural Research Center in Giza, Egypt as lab experimental animals for this study. Rats were kept in stainless steel cages (6/each) and monitored for a week before the experiment’s commencement in a controlled environment with consistent lighting (12 h light/12 h dark cycle), 30%–40% humidity and 25 °C room temperature. On 30-09-2024, the Ethical Committee of the Faculty of Pharmacy at Mansoura University approved the study plan (Key: MD-ACUC-SC.R.24.09.18), and the experiment was conducted for 4 weeks based on this approved study plan. The rats were divided into four groups (n = 6) as follows: the first group (G1), as a negative control, received 1 mL of distilled water by gavage and fed a basal rodent diet. To induce hypercholesterolemia, the other 18 rats were divided into three groups and received a fat-rich diet with 5% cholesterol ( Oyetayo et al., 2020 Karami et al., 2017 Jabir and Jaffat, 2018 ad libitum 2.4 Safflower aqueous extract preparation For daily treatment, 5 g of the powdered flowers are macerated in 100 mL of heated distilled water for 1 h until they cool, and then used ( Karami et al., 2017 2.5 HPLC analysis of safflower aqueous extract The polyphenols of safflower aqueous extract were determined using the HPLC system at the National Research Center (NRC) in Giza, Egypt, according to UV and diode array detection (DAD) methods ( Mizzi et al., 2020 2.6 Collection of blood and samples After the experiment period (4 weeks) and following a 12-h fast, the rats were euthanized by CO 2 El Rabey et al., 2023 2 2.7 Preparation of liver homogenate To estimate the lipid peroxidation and antioxidant activity, the liver tissue homogenate was prepared according to El Rabey et al. (2020) 2.8 Biochemical evaluations 2.8.1 Liver parameters The BSM Bioscience medical kits, Madrid (Spain), were used to estimate alkaline phosphatase (ALP), aspartate transaminase (AST), and alanine aminotransferase (ALT) using an optimized IFCC. Enzymatic – UV 2.8.2 Parameters of the lipid profile The BT kits from Rome (Italy) were used to estimate triglycerides (TG), total cholesterol (TC), high-density lipoproteins (HDL), and low-density lipoproteins (LDL) using the enzymatic colorimetric GPO-PAP method (Cat. No.: 315L for TG, 135L for TC, 143L for HDL, and 145L for LDL). Furthermore, the very low-density lipoprotein (vLDL) was 1/5 of the triglycerides. 2.8.3 Lipid peroxidation and antioxidants Following the supplier’s instructions, the activities of catalase (Cat), glutathione-s-transferase (GST), and superoxide dismutase (SOD) were measured spectrophotometrically using the Biodiagnostic Kit (Cat. No.: GR 25 11), Cairo (Egypt). The Biodiagnostic Kit was also used to assay the lipid peroxidation product, malondialdehyde (MDA), in the liver tissue homogenate according to the supplier’s instructions. 2.8.4 Estimation of troponin and creatine kinase (CK) Rat Troponin I ELISA Kit (Cat. No.: MBS765393) from ABCAM, Cambridge (UK) was used to estimate the heart serum troponin, and the MG KIT (Cat No.: MBS269244) of My BioSource, San Diego (USA) was used to quantify creatine kinase (CK). 2.8.5 Evaluation of vitamin D (Vit D) and adrenaline Vit D was also determined by ELISA using My BioSource San Diego (USA) Rat kit (1,25-Dihydroxyvitamin D3, Calcitriol) ELISA Kit (Cat. No.: MBS2601701. The Rat Epinephrine, EPI ELISA Kit (Cat. No.: EA0043Ra), Shanghai (China), was used for serum adrenaline estimation. All analyses were conducted as described in the supplier’s guidelines. 2.8.6 Serum Ca ++ The Bioteciva kit and the Bioteciva instrument S.P.A. 1600 Rome (Italy) were used to estimate the serum levels of Ca ions (Cat. No.: 432L). 2.9 Histopathological investigations 4–5 μm thin sections of both liver and heart were prepared from the 10% formalin fixed samples (after ethanol dehydration, xylene clearance, and embedding in paraffin), stained with hematoxylin and eosin dye, and finally examined using an Olympus light microscope with a digital camera ( Gurina and Simms, 2025 2.10 Analysis of statistics To determine the Mean ± SE and the t-test values (∗∗∗ P P P P 3 Results 3.1 HPLC analysis of the safflower extract 15 polyphenols were obtained from the HPLC analysis of the polyphenols of the safflower extract as follows: quercetin was the highest constituent (52289.14 μg/g), chlorogenic acid (18761.89 μg/g), Syringic acid (5193.76 μg/g), Cinnamic acid (1923.21 76 μg/g), Gallic acid (1509.43 μg/g), Rosmarinic acid (1311.60 μg/g), Methyl gallate (943.14 μg/g), Naringenin (707.92 μg/g), Ellagic acid (591.76 μg/g), Daidzein (525.72 μg/g), Ferulic acid (507.30 μg/g), Vanillin (413.68 μg/g), Hesperetin (217.09 μg/g), Kaempferol (139.51 μg/g), and the lowest was coumaric acid (126.65 μg/g) ( Supplementary Figure S1 3.2 Effect of safflower and atorvastatin on lipid profile in induced hypercholesterolemic rats  Table 1 P P P P TABLE 1 The hypolipidemic effect of safflower and atorvastatin administration on lipid profile in induced hypercholesterolemic male rats. Variables Statistics G1 −ve control G2 +ve control G3 safflower G4 Atorvastatin T. cholesterol Mean ± SE 156.3 ± 1.5 a 273.3 ± 1.1 d 227.7 ± 1.1 b 202.3 ± 3.3 c TG Mean ± SE 126.7 ± 2.0 a 223.0 ± 4.1 d 205.0 ± 0.7 b 193.3 ± 2.8 c HDL Mean ± SE 49.3 ± 0.9 a 22.0 ± 0.9 40.0 ± 0.4 36.7 ± 0.6 LDL Mean ± SE 81.3 ± 1.8 a 204.7 ± 0.9 d 146.3 ± 0.6 b 127.0 ± 4.7 c VLDL Mean ± SE 25.3 ± 0.4 a 44.6 ± 0.8 d 41.0 ± 0.1 b 38.7 ± 0.6 c Data are represented as Mean ± SE. t-test value “∗∗∗” means highly significant at P P P T. Cholesterol: Total cholesterol, TG, Triglycerides; HDL, High-density lipoprotein; LDL, Low-density lipoprotein; VLDL, Very Low-density lipoprotein. 3.3 Effect of safflower and atorvastatin on antioxidants and lipid peroxidation  Figure 1 Supplementary Table S1 P P FIGURE 1 Effect of safflower and atorvastatin administration on antioxidants and lipid peroxidation of hypercholesterolemic male rats. (a) (b) (c) P P Bar charts showing biochemical markers. Chart a displays SOD and GST levels for four groups: G1 (negative control), G2 (positive control), G3 (Safflower), and G4 (Ator), with G1 having the highest SOD. Chart b shows Catalase levels, highest in G4. Chart c illustrates MDA levels, with G2 having the highest. Statistically significant differences are indicated with asterisks. 3.4 Effect of safflower and atorvastatin on liver function in induced hypercholesterolemic rats The analyzed liver function markers, ALT, AST, ALP, and bilirubin, exhibited a significant ( P Figure 2 Supplementary Table S2 P FIGURE 2 Effect of safflower and atorvastatin administration on liver function of hypercholesterolemic male rats. (a) (b) (c) (d) P P Bar charts labeled a to d display liver function tests across four groups: G1 (-ve control), G2 (+ve control), G3 (Safflower), and G4 (Ator). Chart a shows ALT and AST levels, chart b shows ALP levels, chart c shows total protein levels, and chart d shows total and direct bilirubin levels. Significant differences are marked with letters and asterisks indicating statistical tests. The charts illustrate variations in enzyme levels and bilirubin across different groups, with statistical significance annotated. 3.5 Effect of safflower and atorvastatin on heart function enzymes in induced hypercholesterolemic rats The induced hypercholesterolemia significantly increased the heart function enzymes, CK and Troponin, in G2 compared to the negative control G1 ( P Figure 3 Supplementary Table S3 P FIGURE 3 Effect of safflower and atorvastatin administration on heart function enzymes in hypercholesterolemic male rats. (a) (b) P P Bar charts displaying CK (U/L) and Troponin (ng/mL) levels across four groups: G1 (-ve control), G2 (+ve control), G3 (Safflower), and G4 (Ator). G2 shows the highest values in both graphs, followed by G3 and G4, with G1 having the lowest. Statistical significance is marked with asterisks. 3.6 Effect of safflower and atorvastatin administration on Vit D and C ++  Figure 4 Supplementary Table S3 P FIGURE 4 Effect of safflower and atorvastatin administration on calcium and vitamin D in hypercholesterolemic male rats. (a) ++ (b) P P Two bar graphs compare the levels of calcium (mmol/L) and vitamin D (ng/mL) across four groups: G1 (negative control), G2 (positive control), G3 (Safflower), and G4 (Ator). The calcium levels are higher in G1 and G4, with G4 having the highest. The vitamin D levels are also highest in G4, with G1 following. Asterisks indicate statistical significance across groups. 3.7 Effect of safflower and atorvastatin on serum adrenaline level  Figure 5 Supplementary Table S3 P P FIGURE 5 Effect of safflower and atorvastatin administration on adrenaline in hypercholesterolemic male rats. Different superscripts (a, b, c, or d) show significant difference at P P Bar chart showing adrenaline levels in picograms per milliliter for four groups: G1 (-ve control) at approximately 10, G2 (+ve control) at 40, G3 (Safflower) at 30, and G4 (Ator) at 25. Statistical significance is indicated with asterisks and letters above the bars. 3.8 Correlation of the studied criteria  Table 2 TABLE 2 The correlation between different studied parameters. Variables T.cholesterol TG HDL LDL VLDL ALT AST ALP T.BILLI D.BILLI TP Ca++ Adrenaline Catalase SOD GST MDA TROPONIN CK VIT D T.cholesterol 0.924** −0.922** 0.995** 0.924** 0.988** 0.972** 0.955** 0.948** −0.092- −0.258 −0.976** 0.199 −0.977** −0.968** −0.972** 0.983** 0.963** 0.973** −0.958-** TG 0.924** −0.860** 0.897** 1.000** 0.926** 0.891** 0.913** 0.798** 0.059 −0.295 −0.918** 0.24 −0.939** −0.878** −0.959** 0.945** 0.820** 0.839** −0.868** HDL −0.922** −0.860** −0.944** −0.860** −0.890** −0.826** −0.876** −0.894** 0.06 0.421* 0.865** −0.056 0.863** 0.844** 0.878** −0.891** −0.894** −0.946** 0.861** LDL 0.995** 0.897** −0.944** 0.897** 0.974** 0.952** 0.945** 0.962** −0.113 −0.291 −0.961** 0.163 −0.959** −0.950** −0.952** 0.966** 0.967** 0.986** −0.952-** VLDL 0.924** 1.000** −0.860** 0.897** 0.926** 0.891** 0.913** 0.798** 0.059 −0.295 −0.918** 0.24 −0.939** −0.878** −0.959** 0.945** 0.820** 0.839** −0.868-** ALT 0.988** 0.926** −0.890** 0.974** 0.926** 0.979** 0.960** 0.933** 0.005 −0.235 −0.980** 0.208 −0.969** −0.985** −0.976** 0.987** 0.951** 0.957** −0.939-** AST 0.972** 0.891** −0.826** 0.952** 0.891** 0.979** 0.930** 0.898** −0.093 −0.181 −0.972** 0.268 −0.966** −0.980** −0.943** 0.962** 0.943** 0.919** −0.946-** ALP 0.955** 0.913** −0.876-** 0.945** 0.913** 0.960** 0.930** 0.930** 0.1 −0.397 −0.941** 0.166 −0.962** −0.943** −0.968** 0.967** 0.925** 0.929** −0.888-** T.BILLI 0.948** 0.798** −0.894** 0.962** 0.798** 0.933** 0.898** 0.930** −0.060 −0.347 −0.920** 0.142 −0.905** −0.928** −0.910** 0.931** 0.967** 0.982** −0.924** D.BILLI −0.092- 0.059 0.06 −0.113 0.059 0.005 −0.093 0.1 −0.060 −0.243 −0.025 0.211 0.006 −0.009 −0.033 0.034 −0.150 −0.070 0.211 TP −0.258 −0.295 0.421* −0.291 −0.295 −0.235 −0.181 −0.397 −0.347 −0.243 0.209 0.016 0.26 0.206 0.243 −0.274 −0.331- −0.310- 0.274 Ca++ −0.976** −0.918** 0.865** −0.961** −0.918** −0.980** −0.972** −0.941** −0.920** −0.025 0.209 −0.307 0.979** 0.979** 0.971** −0.987** −0.930** −0.935** 0.952** Adrenaline 0.199 0.24 −0.056 0.163 0.24 0.208 0.268 0.166 0.142 0.211 0.016 −0.307 −0.328 −0.265 −0.191 0.274 0.13 0.137 −0.216- Catalase −0.977** −0.939-** 0.863** −0.959** −0.939** −0.969-** −0.966** −0.962** −0.905** 0.006 0.26 0.979** −0.328 0.963** 0.975** −0.985** −0.925** −0.921** 0.934** SOD −0.968** −0.878-** 0.844** −0.950** −0.878** −0.985-** −0.980** −0.943** −0.928** −0.009 0.206 0.979** −0.265 0.963** 0.957** −0.979** −0.960** −0.941** 0.942** GST −0.972** −0.959** 0.878** −0.952** −0.959** −0.976** −0.943** −0.968** −0.910** −0.033 0.243 0.971** −0.191 0.975** 0.957** −0.990** −0.915** −0.922** 0.926** MDA 0.983** 0.945** −0.891** 0.966** 0.945** 0.987** 0.962** 0.967** 0.931** 0.034 −0.274 −0.987** 0.274 −0.985** −0.979** −0.990** 0.941** 0.945** −0.946** TROPONIN 0.963** 0.820** −0.894** 0.967** 0.820** 0.951** 0.943** 0.925** 0.967** −0.150- −0.331 −0.930** 0.13 −0.925** −0.960** −0.915** 0.941** 0.971** −0.958** CK 0.973** 0.839** −0.946** 0.986** 0.839** 0.957** 0.919** 0.929** 0.982** −0.070 −0.310 −0.935** 0.137 −0.921** −0.941** −0.922** 0.945** 0.971** −0.925** VIT D −0.958** −0.868** 0.861** −0.952** −0.868** −0.939** −0.946** −0.888** −0.924** 0.211 0.274 0.952** −0.216 .934** 0.942** 0.926** −0.946** −0.958** −0.925** **T.cholesterol, Total cholesterol; TG, Triglycerides; HDL, High Density Lipoprotein; LDL, Low Density Lipoprotein; VLDL, Very Low Density Lipoprotein; ALT, Alanine Aminotransferase; AST, Aspartate Aminotransferase; ALP, Alkaline phosphatase; T. Bilirubin, Total Bilirubin; D. Bilirubin, direct Bilirubin; TP, Total Protein; Ca+, Calcium ion; SOD, Superoxide dismutase; MDA, Malondialdehyde; CK, Creatinine Kinase. 3.9 Histopathology of the liver  Figure 6 Figure 4A Figure 6B Figure 6C Figure 6D FIGURE 6  (a) (b) (c) (d) Histological images of liver tissue under a microscope, labeled a, b, c, and d. Each panel shows pink-stained cells with varying densities and structures. Arrows indicate the direction of tissue organization. Scale bars in panels a, b, and d are 200 pixels, while panel c is 100 pixels. 3.10 Histopathology of the heart  Figure 7 Figure 7a Figure 7b Figure 7c Figure 7d FIGURE 7  (a) (b) (c) (d) Four-panel microscopic images of cardiac muscle tissue stained pink, each showing different levels of magnification and muscle fiber alignment. Panels a and d show more structured striations, while b and c display less distinct organization with some cellular detail. Each panel includes a black arrow indicating fiber direction. Scale bars indicate sizes of either one hundred or two hundred pixels. 3.11 The total body weight The total body weight was significantly ( P Table 3 P TABLE 3 Effect of treating hypercholesterolemic rats with safflower and atorvastatin for 4 weeks on total body weight (g). Variables Statistics G1 −ve control G2 +ve control G3 Safflower G4 Atorvastatin Initial weight (g) Mean ± SE 182.3 ± 0.6 a 182.3 ± 0.9 a 182.3 ± 0.6 a 183.7 ± 0.6 a NS 1st week (g) Mean ± SE 186.3 ± 0.6 a 187.0 ± 0.4 a NS 186.3 ± 0.9 a 186.0 ± 0.7 a NS 2nd week (g) Mean ± SE 190.7 ± 0.4 c 193.7 ± 0.6 b 191.3 ± 0.4 c NS 190.0 ± 0.7 c NS 3rd week (g) Mean ± SE 194.0 ± 0.4 c 200.7 ± 0.6 b 196.3 ± 0.4 c 195.3 ± 0.8 c NS 4th week (g) Mean ± SE 199.0 ± 0.6 c 209.3 ± 0.4 b 204.0 ± 0.4 d 200.3 ± 0.8 c NS Data are represented as Mean ± SE. t-test value “∗∗∗” means highly significant at P P P P 4 Discussion This study evaluated the therapeutic advantages of C. tinctorius aqueous Adamska and Biernacka, 2021 Alshareef et al., 2024 Administration of a fat-rich food to the experimental animals resulted in hypercholesterolemia in the positive control group, as evidenced by increased triglycerides, total cholesterol, LDL, and vLDL, alongside a reduction in HDL ( El Rabey et al., 2018 Alshareef et al., 2024 C. tinctorius Che et al., 2016 Adamska and Biernacka, 2021 Sandoval et al., 2020 Livingstone et al., 2016 Abd-Elmonsif and Gamal, 2025 McIver and Siddique, 2025 Dagli-Hernandez et al., 2022 Abd-Elmonsif and Gamal, 2025 The induction of hypercholesterolemia in the positive control group markedly impacted liver function, elevating liver enzymes and bilirubin levels while diminishing total protein ( Alshareef et al., 2024 Al-Sieni et al., 2020 Ruyvaran et al., 2022 Alshareef et al., 2024 Livingstone et al., 2016 Abd-Elmonsif and Gamal, 2025 Alshareef et al., 2024 The induction of hypercholesterolemia resulted in increased lipid peroxidation, as indicated by elevated MDA levels and reduced activity of the antioxidant enzymes catalase, SOD, and GSH, in comparison to the negative control group. Conversely, treatment with safflower and atorvastatin improved these disrupted oxidative stress parameters. Furthermore, the hepatoprotective properties of safflower may be attributed to polyphenols such as quercetin, chlorogenic acid, and HSYA’s ability to augment the synthesis of hepatic antioxidative enzymes that regulate obesity. Additionally, the administration of safflower extract, which comprises both HSYA and safflower yellow (also known as carthamine yellow), elevates the mRNA levels of antioxidative enzymes and enhances the superoxide dismutase (SOD) activity in liver homogenates ( Yan et al., 2020 Adamska and Biernacka, 2021 The elevation of heart function enzyme activity (troponin and CK) in the hypercholesterolemic positive control group is corroborated by histological analyses that indicated damaged cardiac tissues and oxidative stress markers ( El Rabey et al., 2018 Al-Sieni et al., 2020 Yan et al., 2020 Abd-Elmonsif and Gamal, 2025 Kim et al., 2017 Olamoyegun et al., 2016 Alloubani et al., 2021 The current findings indicated a notable reduction in vitamin D and calcium levels due to induced hypercholesterolemia in the positive control group, while treatment with safflower and atorvastatin resulted in an elevation of these levels. Calcium and vitamin D levels exhibit a positive correlation; therefore, calcium is essential for vitamin D production. Recent research indicates that hypercholesterolemia is associated with a deficiency in vitamin D levels and vice versa Dibaba, 2019 Han et al., 2021 Mattioli et al., 2025 Che et al. (2016) Izzo et al., 2024 Elangovan et al., 2017 Keane et al., 2018 The induced hypercholesterolemia markedly elevated adrenaline levels in the present investigation. This finding is consistent with earlier research linking hypercholesterolemia to elevated adrenaline levels ( Maduka et al., 2015 Fulton et al., 2022 Lelou et al., 2022 Jiang et al., 2019 El Rabey et al., 2018 Liu et al., 2022 Al Refaie et al., 2022 The induced hypercholesterolemia also caused hepatic and cardiac histological alterations in the positive control group relative to the negative control ( El Rabey et al., 2018 Al-Sieni et al., 2020 Lelou et al., 2022 Ognik et al., 2021 Lelou et al., 2022 Liu et al., 2022 The total body weight was gradually increased with increasing hypercholesterolemia ( Al-Sieni et al., 2020 El Rabey et al., 2020 Liu et al., 2022 Jiang et al., 2019 Tahir et al., 2023 Livingstone et al., 2016 Abd-Elmonsif and Gamal, 2025 Atorvastatin is an effective cholesterol-lowering medication recommended by the FDA ( Livingstone et al., 2016 Abd-Elmonsif and Gamal, 2025 Fulton et al., 2022 Alshareef et al., 2024 Deepika et al., 2025 Safflower extract has been used in folk medicine for short periods and in specific doses to avoid toxicity resulting from large doses. It is used to treat many diseases such as hyperlipidemia, diabetes, and many symptoms associated with anxiety, stress, and fear. Hence, the idea for this study arose, and we hope that the results of this study will be used to develop pharmaceutical formulations of safflower to treat these diseases and alleviate pain. The dosage of safflower extract may need to be elevated to achieve enhanced protective efficacy. Additional research is necessary to investigate the function of each component in improving health and elucidating its protective effects on different organs. In addition, this study was conducted on rats, despite they do not accurately model human lipoprotein profiles or atherosclerosis progression, because rodents are considered ideal for atherosclerosis research because of their fast breeding, low cost of production, and short time needed for developing atherosclerosis ( Daniels et al., 2018 Zhao et al., 2020 Safflower and atorvastatin exhibited numerous health advantages. They elevated antioxidant and vitamin D levels and reduced hyperlipidemia, lipid peroxidation, CK, troponin, and adrenaline. They further safeguarded the liver and heart of the generated hypercholesterolemic animals. They also function as anxiolytics by reducing adrenaline levels. Atorvastatin has shown superior efficacy compared to safflower in safeguarding against hypercholesterolemia and its associated consequences. The authors extend their thanks and gratitude to Hassan Alsuwat Company, Tabuk (KSA), for funding this research project. Data availability statement The original contributions presented in the study are included in the article/ Supplementary Material Ethics statement The animal study was approved by The Ethical Committee of Faculty of Pharmacy at Mansoura University approved the study plan (Key: MD-ACUC-SC.R.24.09.18). The study was conducted in accordance with the local legislation and institutional requirements. Author contributions HE: Conceptualization, Formal Analysis, Funding acquisition, Investigation, Methodology, Supervision, Writing – original draft, Writing – review and editing. EA: Formal Analysis, Methodology, Resources, Software, Writing – original draft. NB: Data curation, Investigation, Resources, Validation, Visualization, Writing – original draft. SR: Data curation, Formal Analysis, Methodology, Resources, Visualization, Writing – original draft. AS: Conceptualization, Data curation, Formal Analysis, Resources, Software, Validation, Writing – original draft. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fphar.2025.1663717/full#supplementary-material SUPPLEMENTARY FIGURE 1 Polyphenols of safflower aqueous extract. Abbreviations ADR, Adverse drug reaction; ALP, alkaline phosphatase; ALT, Alanine aminotransferase; ANOVA, analysis of variance; AST, aspartate transaminase; Cat, Catalase; Cat, catalase; CK, creatine kinase; CK, Creatine kinase; GST, glutathione-s-transferase; GST, glutathione-s-transferase; HDL, high-density lipoprotein; HSYA, hydroxysafflor; IFCC, International Federation of Clinical Chemistry and Laboratory Medicine; LDL, low-density lipoproteins; LSD, least significant difference; MDA, malondialdehyde; MDA, malondialdehyde; SOD, super oxide dismutase; TC, total cholesterol; TG, triglycerides; TP, total protein; vLDL, very low-density lipoproteins. References Abd-Elmonsif N. M. Gamal S. 2025 The implications of atorvastatin administration and the potential protective role of omega-3 on the submandibular salivary gland of albino rats (histological, histochemical, ultrastructure, and biochemical study) J. Stomatol. Oral Maxillofac. Surg. 126 3 102097 10.1016/j.jormas.2024.102097 39357807 Adamska I. Biernacka P. 2021 Bioactive substances in safflower flowers and their applicability in medicine and health-promoting foods Int. J. Food Sci. 2021 6657639 10.1155/2021/6657639 34136564 PMC8175185 Al Refaie A. Baldassini L. De Vita M. Gonnelli S. Caffarelli C. 2022 Vitamin D and adrenal gland: myth or reality? A systematic review Front. Endocrinol 13 1001065 10.3389/fendo.2022.1001065 36313775 PMC9606701 Al-Sieni A. I. El Rabey H. A. Al- Seeni M. N. 2020 The aqueous extract of Christ’s thorn ( Ziziphus spina-christi Biomed. Res. 31 3 71 78 Alloubani A. Nimer R. Samara R. 2021 Relationship between hyperlipidemia, cardiovascular disease and stroke: a systematic review Curr. Cardiol. Rev. 17 6 e051121189015 10.2174/1573403X16999201210200342 33305711 PMC8950504 Alshareef N. S. AlSedairy S. A. Al-Harbi L. N. Alshammari G. M. Yahya M. A. 2024  Carthamus tinctorius via Antioxidants 13 9 1098 10.3390/antiox13091098 39334757 PMC11428842 Che C.-T. Wong M. S. Lam C. W. K. 2016 Natural products from Chinese medicines with potential benefits to bone health Molecules 21 3 239 10.3390/molecules21030239 26927052 PMC6274145 Coleman J. J. Pontefract S. K. 2016 Adverse drug reactions Clin. Med 16 5 481 485 10.7861/clinmedicine.16-5-481 27697815 PMC6297296 Costa K. M. Schoenbaum G. 2022 Dopamine Curr. Biol. 32 15 817 824 10.1016/j.cub.2022.06.060 35944478 Dagli-Hernandez C. Zhou Y. Lauschke V. M. Genvigir F. D. V. Hirata T. D. C. Hirata M. H. 2022 Pharmacogenomics of statins: lipid response and other outcomes in Brazilian cohorts Pharmacol. Rep. 74 1 47 66 10.1007/s43440-021-00319-y 34403130 Daniels L. J. Wallace R. S. Nicholson O. M. Wilson G. A. McDonald F. J. Jones P. P. 2018 Inhibition of calcium/calmodulin-dependent kinase II restores contraction and relaxation in isolated cardiac muscle from type 2 diabetic rats Cardiovasc. Diabetol. 17 89 15 10.1186/s12933-018-0732-x 29903013 PMC6001139 Deepika A. K. Singh S. Faruque A. Ahmad M. F. Chaki D. Poria V. 2025 Vitamin D: recent advances, associated factors, and its role in combating non-communicable diseases npj Sci. Food 9 100 10.1038/s41538-025-00460-5 40514375 PMC12166060 Delshad E. Yousefi M. Sasannezhad P. Rakhshandeh H. Ayati Z. 2018 Medical uses of Carthamus tinctorius L. Electron. Physician 10 4 6672 6681 10.19082/6672 29881530 PMC5984022 Dibaba D. T. 2019 Effect of vitamin D supplementation on serum lipid profiles: a systematic review and meta-analysis Nutr. Rev. 77 12 890 902 10.1093/nutrit/nuz037 31407792 El Rabey H. A. Almutairi F. M. Al-Sieni A. I. Al-Seeni M. N. Al-Duais M. A. Sakran M. I. 2018  Salvadora persica Biomed. Res. 29 11 2424 2434 10.4066/biomedicalresearch.64-18-549 El Rabey H. A. Al-Sieni A. I. Al-Seeni M. N. Alsieni M. A. Alalaw A. I. Almutairi F. M. 2020 The antioxidant and antidiabetic activity of the Arabian balsam tree “ Commiphora J. Taibah Univ. Sci. 14 1 831 841 10.1080/16583655.2020.1780020 El Rabey H. A. Alamri S. Alzahrani O. R. Salah N. M. Attia E. S. Rezk S. M. 2023 Silymarin and vanillic acid silver nanoparticles alleviate the carbon tetrachloride-induced nephrotoxicity in Male rats Int. J. Polym. Sci. 2023 1 11 10.1155/2023/4120553 Elangovan H. Chahal S. Gunton J. E. 2017 Vitamin D in liver disease: current evidence and potential directions BBA - Mol. Basis Dis. 1863 4 907 916 10.1016/j.bbadis.2017.01.001 28064017 Fulton S. Décarie-Spain L. Fioramonti X. Guiard B. Nakajima S. 2022 menace Obes. Depress. anxiety Preval. Tends Oncol. Metabol 33 1 18 35 10.1016/j.tem.2021.10.005 34750064 Guo J. Huang X. Dou L. Yan M. Shen T. Tang W. 2022 Aging and aging-related diseases: from molecular mechanisms to interventions and treatments Signal Transduct. Target. Ther. 7 391 10.1038/s41392-022-01251-0 36522308 PMC9755275 Gurina T. S. Simms L. 2025 “Histology Staining” StatPearls Treasure Island (FL) StatPearls Publishing Available online at: https://www.ncbi.nlm.nih.gov/books/NBK557663/ 32491595 Han Y. Hsu S. H. Su T. 2021 Association between vitamin D deficiency and high serum levels of small dense LDL in middle-aged adults Biomed 9 5 464 10.3390/biomedicines9050464 33923190 PMC8145029 Izzo C. Secondulfo C. Bilancio G. Visco V. Virtuoso N. Migliarino S. 2024 Chronic kidney disease with mineral bone disorder and vascular calcification: an overview Life 14 3 418 10.3390/life14030418 38541742 PMC10971621 Jabir S. A. Jaffat H. S. 2018 Effects of atorvastatin drug in albino Male rats J. Pharm. Sci. Res. 10 11 2924 2928 Available online at: https://www.researchgate.net/publication/329752625_Effects_of_atorvastatin_drug_in_albino_male_rats Jiang X. Yu J. Wang X. Ge J. Li N. 2019 Quercetin improves lipid metabolism via SCAP-SREBP2-LDLr signaling pathway in early stage diabetic nephropathy Diabetes Metab. Syndr. Obes. 12 827 839 10.2147/DMSO.S195456 31239739 PMC6554005 Jomova K. Raptova R. Alomar S. Y. Alwasel S. H. Nepovimova E. Kuca K. 2023 Reactive oxygen species, toxicity, oxidative stress, and antioxidants: chronic diseases and aging Arch. Toxicol. 97 2499 2574 10.1007/s00204-023-03562-9 37597078 PMC10475008 Karami S. Sabzalian M. Khorsandi L. Rahimmalek M. 2017 Safety assessment of a new pigmented safflower seed coat (A82) by a feeding study on rat Braz. Arch. Biol. Technol. 60 e17160564 10.1590/1678-4324-2017160564 Keane J. T. Elangovan H. Stokes R. A. Gunton J. E. 2018 Vitamin D and the liver-correlation or cause? Nutrients 10 4 496 10.3390/nu10040496 29659559 PMC5946281 Kim M. K. Han K. Kim H.-S. Park Y.-M. Kwon H.-S. Yoon K.-H. 2017 Cholesterol variability and the risk of mortality, myocardial infarction, and stroke: a nationwide population-based study Eur. Heart. J. 38 48 3560 3566 10.1093/eurheartj/ehx585 29069458 PMC6251576 Kommu S. Carter C. Whitfield P. 2025 Adverse drug reactions StatPearls Treasure Island (FL) StatPearls Publishing Available online at: https://www.ncbi.nlm.nih.gov/books/NBK599521/ 38261714 Lelou E. Corlu A. Nesseler N. Rauch C. Mallédant Y. Seguin P. 2022 The role of catecholamines in pathophysiological liver processes Cells 11 6 1021 10.3390/cells11061021 35326472 PMC8947265 Li H. Ren J. Li Y. Wu Q. Wei J. 2023 Oxidative stress: the nexus of obesity and cognitive dysfunction in diabetes Front. Endocrinol. 14 1134025 10.3389/fendo.2023.1134025 37077347 PMC10107409 Liu Y. Liu C. Kou X. Wang Y. Yu Y. Zhen N. 2022 Synergistic hypolipidemic effects and mechanisms of phytochemicals: a review Foods 11 18 2774 10.3390/foods11182774 36140902 PMC9497508 Livingstone S. J. Looker H. C. Akbar T. Betteridge D. J. Durrington P. N. Hitman G. A. 2016 Effect of atorvastatin on glycaemia progression in patients with diabetes: an analysis from the collaborative atorvastatin in diabetes trial (CARDS) Diabetologia 59 2 299 306 10.1007/s00125-015-3802-6 26577796 PMC4705133 Maduka I. C. Neboh E. E. Ufelle S. A. 2015 The relationship between serum cortisol, adrenaline, blood glucose and lipid profile of undergraduate students under examination stress Afr. Health Sci. 15 1 131 136 10.4314/ahs.v15i1.18 25834541 PMC4370130 Mattioli A. V. Coppi F. Severino P. Penna C. Pagliaro P. Dei Cas A. 2025 A personalized approach to vitamin D supplementation in cardiovascular health beyond the bone: an expert consensus by the Italian national institute for cardiovascular research Nutrients 17 1 115 10.3390/nu17010115 39796548 PMC11722835 McIver L. A. Siddique M. S. 2025 Atorvastatin StatPearls Treasure Island (FL) StatPearls Publishing Available online at: https://www.ncbi.nlm.nih.gov/books/NBK430779/ 28613530 Mizzi L. Chatzitzika C. Gatt R. Valdramidis V. 2020 HPLC analysis of phenolic compounds and flavonoids with overlapping peaks Food Technol. Biotechnol. 58 1 12 19 10.17113/ftb.58.01.20.6395 32684783 PMC7365340 Ognik K. Dworzański W. Sembratowicz I. Fotschki B. Cholewińska E. Listos P. 2021 The effect of the high-fat diet supplemented with various forms of chromium on rats body composition, liver metabolism and organ histology Cr in liver metabolism and histology of selected organs J. Trace Elem. Med. Biol. 64 126705 10.1016/j.jtemb.2020.126705 33383354 Olamoyegun M. A. Akinlade A. T. Fawale M. B. Ogbera A. O. 2016 Dyslipidaemia as a risk factor in the occurrence of stroke in Nigeria: prevalence and patterns Pan. Afr. Med. J. 25 72 10.11604/pamj.2016.25.72.6496 28292035 PMC5324148 Oyetayo F. L. Akomolafe S. F. Ogundumi O. A. 2020 Anti-hypercholesterolemic potential of diet supplemented with Anchomanes difformis Pleurotus tuberregium J. Diabetes Metab. Disord. 19 2 1139 1155 10.1007/s40200-020-00615-z 33520831 PMC7843785 Prasad K. Mishra M. 2022 Mechanism of hypercholesterolemia-induced atherosclerosis Rev. Cardiovasc. Med. 23 6 212 10.31083/j.rcm2306212 39077184 PMC11273781 Ruyvaran P. M. Zamani A. Mohamadian A. Zarshenas M. M. Eftekhari M. H. Pourahmad S. 2022 Safflower ( Carthamus tinctorius J. Ethnopharmacol. 282 114590 10.1016/j.jep.2021.114590 34487844 Sandoval V. Sanz-Lamora H. Arias G. Marrero P. F. Haro D. Relat J. 2020 Metabolic impact of flavonoids consumption in obesity: from central to peripheral Nutrients 12 8 2393 10.3390/nu12082393 32785059 PMC7469047 Sawhney J. P. S. Madan K. 2024 Familial hypercholesterolemia Indian Heart J. 76 1 108 112 10.1016/j.ihj.2023.12.002 38599725 PMC11019323 Tahir F. Ahmed A. Kiran G. K. Badar R. 2023 Ameliorative effect of quercetin on lipid, enzymatic, hormonal and biochemical profiling of stz-induced diabetic rats J. Popul. Ther. Clin. Pharmacol. 30 17 1950 1967 10.53555/jptcp.v30i17.2898 Vaezi Z. Amini A. 2025 Familial hypercholesterolemia StatPearls Treasure Island (FL) StatPearls Publishing Available online at: https://www.ncbi.nlm.nih.gov/books/NBK556009/ 32310469 Yan K. Wang X. Pan H. Wang L. Yang H. Liu M. 2020 Safflower yellow and its main component HSYA alleviate diet-induced obesity in mice: possible involvement of the increased antioxidant enzymes in liver and adipose tissue Front. Pharmacol. 11 482 10.3389/fphar.2020.00482 32372961 PMC7186386 Zhang R. Li B. Gao X. Tian R. Pan Y. Jiang Y. 2017 Serum 25-hydroxyvitamin D and the risk of cardiovascular disease: dose-response meta-analysis of prospective studies Am. J. Clin. Nutr. 105 4 810 819 10.3945/ajcn.116.140392 28251933 Zhao Y. Qu H. Wang Y. Xiao W. Zhang Y. Shi D. 2020 Small rodent models of atherosclerosis Biomed. Pharmacother. 129 110426 10.1016/j.biopha.2020.110426 32574973 Zmysłowski A. Szterk A. 2017 Current knowledge on the mechanism of atherosclerosis and pro-atherosclerotic properties of oxysterols Lipids Health Dis. 16 188 10.1186/s12944-017-0579-2 28969682 PMC5625595 ",
  "metadata": {
    "Title of this paper": "Current knowledge on the mechanism of atherosclerosis and pro-atherosclerotic properties of oxysterols",
    "Journal it was published in:": "Frontiers in Pharmacology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477430/"
  }
}