{
  "title": "Paper_119",
  "abstract": "pmc EMBO J EMBO J 78 emboj The EMBO Journal 0261-4189 1460-2075 Nature Publishing Group PMC12489102 PMC12489102.1 12489102 12489102 40836034 10.1038/s44318-025-00524-y 524 1 Article BBS8-dependent ciliary Hedgehog signaling governs cell fate in the white adipose tissue http://orcid.org/0009-0008-0336-8835 Sieckmann Katharina 1 Winnerling Nora 1 Silva Ribeiro Dalila Juliana 1 http://orcid.org/0000-0002-9317-9171 Yüksel Seniz 1 http://orcid.org/0009-0004-3649-2024 Kardinal Ronja 1 Steinheuer Lisa Maria 2 http://orcid.org/0009-0003-1279-2842 Frechen Fabian 1 Corrêa Luis Henrique 3 4 Schermann Geza 5 6 Klausen Christina 1 Blank-Stein Nelli 7 Schulte-Schrepping Jonas 8 http://orcid.org/0000-0002-1093-5147 Osei-Sarpong Collins 8 http://orcid.org/0000-0002-7120-4508 Becker Matthias 8 http://orcid.org/0000-0001-9675-7208 Bonaguro Lorenzo 8 http://orcid.org/0000-0001-9704-148X Beyer Marc 8 9 May-Simera Helen Louise 10 http://orcid.org/0000-0002-5932-4849 Zurkovic Jelena 11 http://orcid.org/0000-0001-5161-2558 Thiele Christoph 11 http://orcid.org/0000-0002-7217-2755 Thurley Kevin 2 http://orcid.org/0000-0001-7704-7921 Sorokin Lydia 3 4 http://orcid.org/0000-0001-5975-7815 Ruiz de Almodovar Carmen 5 6 http://orcid.org/0000-0003-2318-2356 Mass Elvira 7 http://orcid.org/0000-0003-4800-6332 Wachten Dagmar dwachten@uni-bonn.de 1 1 https://ror.org/041nas322 grid.10388.32 0000 0001 2240 3300 Institute of Innate Immunity, Biophysical Imaging, Medical Faculty, University of Bonn, 2 https://ror.org/01xnwqx93 grid.15090.3d 0000 0000 8786 803X Institute of Experimental Oncology, Biomathematics Division, University Hospital Bonn, 3 https://ror.org/00pd74e08 grid.5949.1 0000 0001 2172 9288 Institute of Physiological Chemistry and Pathobiochemistry, University of Muenster, 4 https://ror.org/00pd74e08 grid.5949.1 0000 0001 2172 9288 Cells-in-Motion Interfaculty Centre (CIMIC), University of Muenster, 5 https://ror.org/041nas322 grid.10388.32 0000 0001 2240 3300 Institute for Neurovascular Cell Biology, Medical Faculty, University of Bonn, 6 https://ror.org/041nas322 grid.10388.32 0000 0001 2240 3300 Schlegel Chair for Neurovascular Cell Biology, University of Bonn, 7 https://ror.org/041nas322 grid.10388.32 0000 0001 2240 3300 Life and Medical Sciences (LIMES) Institute, Developmental Biology of the Immune System, University of Bonn, 8 https://ror.org/043j0f473 grid.424247.3 0000 0004 0438 0426 Platform for Single Cell Genomics and Epigenomics (Precise), German Center for Neurodegenerative Diseases and University of Bonn, 9 https://ror.org/043j0f473 grid.424247.3 0000 0004 0438 0426 Immunogenomics & Neurodegeneration, German Center for Neurodegenerative Diseases (DZNE), 10 https://ror.org/023b0x485 grid.5802.f 0000 0001 1941 7111 Institute of Molecular Physiology, Johannes Gutenberg-University, 11 https://ror.org/041nas322 grid.10388.32 0000 0001 2240 3300 Life and Medical Sciences Institute, Biochemistry and Cell Biology of Lipids, University of Bonn, 20 8 2025 10 2025 44 19 498146 5315 5336 20 6 2024 25 6 2025 14 7 2025 20 08 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ The primary cilium plays a crucial role in regulating whole-body energy metabolism, as reflected in Bardet-Biedl syndrome (BBS), where ciliary dysfunction leads to obesity due to hyperphagia and white adipose tissue (WAT) remodeling. Regulation of the fate and differentiation of adipocyte precursor cells (APCs) is essential for maintaining WAT homeostasis during obesity. Using Bbs8 −/− Bbs8 −/− Synopsis  Disruption of ciliogenesis in Bardet-Biedl syndrome (BBS) leads to obesity and disrupted adipogenesis. This study reveals that ciliary dysfunction in a mouse model of BBS induces a a cell fate switch that disrupts white adipose tissue homeostasis and predisposes to obesity.  Bbs8 −/− Bbs8 −/− Fibrogenic transition is marked by extracellular matrix remodeling and increased fibrosis marker CD9 expression before obesity onset. Ectopic ciliary Hedgehog signaling due to BBS8 Ciliary dysfunction in a mouse model of Bardet-Biedl syndrome induces a fibrogenic progenitor fate establishment in adipocyte precursors.  Keywords Cilia BBS Adipose Tissue Cell Fate Subject terms Cell Adhesion, Polarity & Cytoskeleton Molecular Biology of Disease Stem Cells & Regenerative Medicine http://dx.doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft (DFG) SFB 1454 - Project-ID 432325352 TRR333/1 - Project-ID 450149205 FOR5547 - Project-ID 503306912 EXC2151 - Project-ID 390873048 FOR5547 - Project-ID 503306912 WA 3382/8-1 - Project-ID 513767027 Walter Benjamin Program SFB1366 - Project-ID - 394046768 SFB1366 - Project-ID - 394046768 Microscopy Core Facility: 388168919,388158066,01EO2107,266686698 Flow Cytometry Core Facility : 216372545 and 471514137 Sieckmann Katharina Silva Ribeiro Dalila Juliana May-Simera Helen Louise Wachten Dagmar Else Kröner Fresenius Foundation 2021.EKFSE.53 Wachten Dagmar http://dx.doi.org/10.13039/100019180 EC | ERC | HORIZON EUROPE European Research Council (ERC) 851257 864875 Mass Elvira http://dx.doi.org/10.13039/501100004350 Studienstiftung des Deutschen Volkes (Studienstiftung) PhD grant Sieckmann Katharina http://dx.doi.org/10.13039/100005156 Alexander von Humboldt-Stiftung (AvH) Sofja Kovalevskaja Award May-Simera Helen Louise pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © European Molecular Biology Organization 2025 Introduction Obesity is a global challenge, affecting hundreds of millions of people worldwide and leading to metabolic disorders like type 2 diabetes, non-alcoholic fatty liver disease, and cardiovascular disease (Blüher, 2019 2022 2003 2022 2006 2019 2017 2023 Various signaling pathways have been shown to regulate the intricate process of adipogenesis and, thereby, WAT homeostasis (Ye et al, 2023 2023 2023 2018 2022 2021 Primary cilia are present on mesenchymal stem cells (MSCs) and cells committed to the adipocyte lineage but are absent from mature adipocytes (Hilgendorf et al, 2019 2021 2019 2021 Primary cilia dysfunction leads to severe disorders commonly termed ciliopathies, some of which are associated with obesity. This includes the Bardet-Biedl syndrome (BBS), caused by mutations in one of the BBS 2013 BBS mouse models recapitulate the human phenotype and develop obesity over time. At the cellular level, this seems to be due to dysfunction of primary cilia in hypothalamic neurons, leading to hyperphagia, accompanied by decreased locomotion and hyperleptinemia (Brewer et al, 2022 2023 2021 2008 2008 Recent breakthroughs in single-cell technologies have revealed that APCs are a highly heterogeneous cell population. Based on gene expression analysis, lineage tracing, and surface marker expression (Altun et al, 2022 2022 2018 2018 2019 2022 2021 2021 2018 1A Figure 1 Primary cilia regulate the adipogenic potential of adipocyte precursor subpopulations (APCs). ( A B C D + E F n n p G H n p t I J n p Source data are available online for this figure Here, we investigated the role of primary cilia in controlling the fate and function of APC subpopulations in WAT under physiological conditions and during primary cilia dysfunction, i.e., in a BBS mouse model before the onset of obesity. Our results demonstrate that BBS8-dependent signaling determines the fate of APCs, in particular of the stem-cell-like P1 subpopulation. Loss of the BBSome component BBS8 reduces the stem-cell pool by inducing a phenotypic switch of P1 cells into a fibrogenic progenitor subpopulation, characterized by ectopic ciliary Hh signaling and loss of Hh responsiveness even before the onset of obesity in the lean state. In turn, this affects the adipogenic potential of APCs and their lipid uptake. Altogether, our data demonstrate a key function for primary cilia signaling in determining APC fate and function in WAT, and provide mechanistic insights into phenotypic fate changes underlying cellular remodeling in tissue niches Results Primary cilia control adipocyte precursor subpopulations We first analyzed whether primary cilia are present on all APCs. Based on results by others, we established a flow cytometry antibody marker panel to identify and sort the different subpopulations from the stromal vascular fraction (SVF) of subcutaneous inguinal WAT (iWAT): After lineage depletion (Lin: TER119 + + + + + 2019 2020 2018 1A–C 1A 2019 2018 1D 1E,F 1B Next, we tested whether the different subpopulations maintain their in vivo characteristics when cultured in vitro for 48 h. To determine the differentiation state of the different APCs, we analyzed FABP4 expression, an adipocyte commitment marker. Since it has been shown that regulatory P3 cells are resistant to undergoing adipogenesis, we focused on the P1 and P2 subpopulations (Schwalie et al, 2018 1G,H 2019 2018 To investigate cilia-specific roles during adipogenesis, a minimal induction medium that allows to observe downstream effects of ciliary signaling is a prerequisite (Hilgendorf et al, 2019 1I,J 2019 1J Loss of BBS8 results in obesity To investigate whether primary cilia dysfunction, in particular loss of a BBS protein, affects fate and function of APCs, we used a mouse model that lacks BBS8 ( Bbs8 −/− 2011 Bbs8 −/− 2A 2B 2022 Bbs8 −/− Bbs8 +/+ 2C–F Bbs8 −/− 2F Bbs8 Pdgfra +/cre Bbs8 flox/flox Bbs8 −/− 2A 2G 2H Figure 2 Loss of BBS8 in APCs results in obesity. ( A Bbs8 +/+ Bbs8 −/− p p n B p t C p t D E F D E F p n G Pdgfra +/+ Bbs8 flox/flox Pdgfra Cre/+ Bbs8 flox/flox p t H p t Source data are available online for this figure Loss of BBS8 induces a fibrogenic switch and ECM remodeling As we aimed to investigate the role of primary cilia in controlling APC fate and function independent of secondary effects due to obesity development, we focused all our subsequent analyses on the lean time point (5–9 weeks) for all mouse models. To investigate the role of BBS8 in the P1–P3 APC subpopulations, we first compared their relative frequencies in the SVF from iWAT of lean Bbs8 +/+ Bbs8 −/− Bbs8 +/+ Bbs8 −/− 3A Bbs8 −/− Pdgfra +/cre Bbs8 flox/flox 2B Figure 3 Loss of Bbs8 induces a fibrogenic switch and ECM remodeling. ( A Bbs8 +/+ n Bbs8 −/− n P t B Bbs8 +/+ Bbs8 −/− n C n D Bbs8 −/− Bbs8 +/+ n E Bbs8 −/− Bbs8 +/+ F Bbs8 +/+ Bbs8 − − n G Bbs8 +/+ Bbs8 −/− Bbs8 +/+ H Bbs8 +/+ Bbs8 −/− high + Bbs8 +/+ Bbs8 −/− p t n I Bbs8 +/+ Bbs8 −/− J I n p t K + hi Bbs8 −/− L + high Bbs8 −/− n p t M Bbs8 +/+ Bbs8 −/− Bbs8 +/+ n p t Source data are available online for this figure To investigate whether this change in frequency distribution resulted in cellular changes, we sorted P1–P3 from Bbs8 +/+ Bbs8 −/− 3B Creb5 Ly6a Cd34 Pparg Fasn Fabp4 F3 Fmo2 Rbp1 3C 3A 1 Bbs8 +/+ Bbs8 −/− 3B 3D 3C–F Bbs8 −/− 3E Col1a1 Col3a1 Col5a1 Col6a1 Loxl2 Mmp3 Adamts2 Lama4 3F Bbs8 −/− 3G 2023 2013 2023 2023 2023 Bbs8 −/− Our data suggests that loss of BBS8 drives a fibrogenic, phenotypic shift in Pdgfrα-expressing progenitor cells in lean WAT. So far, a fibrogenic shift in this cell population has only been observed during obesity, associated with a shift from a CD9 low CD9 high 2017 Bbs8 +/+ Bbs8 −/− high vs low 3H 3H high Bbs8 −/− Bbs8 +/+ 3H 3H Bbs8 +/+ Bbs8 −/− 3I,J Pdgfra + Bbs8 floxl Pdgfra Cre Bbs8 floxl 3I,J Bbs8 −/− 3K In summary, our data demonstrate that loss of the BBSome component BBS8 dysregulates the fate of the APC P1 population in the lean state. In fact, loss of BBS8 shifts P1 towards a fibrogenic phenotype, with enhanced fibrillar collagen synthesis and, thereby, WAT remodeling in the lean state. Phenotypic switch of P1 cells impairs adipogenesis and promotes lipid uptake To investigate whether the changes in Bbs8 −/− high 2017 high Bbs8 −/− 1J 2019 high Bbs8 −/− 3K,L high 2017 Bbs8 +/+ Bbs8 −/− Bbs8 −/− Bbs8 +/+ 3M Bbs8 −/− Loss of BBS8 drives P1 cells towards a fibrogenic fate To analyze the fibrogenic switch in more detail, we performed single-cell RNA-sequencing (scRNA-seq) of the iWAT SVF from lean Bbs8 +/+ Bbs8 −/− 4A 4A 4B,C 2 Bbs8 −/− Dpp4 Pi16 Col15a1 Mmp3 Bgn 4B,D 2019 2018 Bbs8 +/+ Bbs8 −/− Bbs8 −/− +/+ 4C,E 4D,E 4F 3 4 Figure 4 Loss of BBS8 drives P1 cells into fibrogenic cells. ( A Bbs8 +/+ Bbs8 −/− B n C Bbs8 +/+ Bbs8 −/− D C E Bbs8 −/− Bbs8 +/+ F Bbs8 +/+ Bbs8 −/− G F n p t H I J K L Bbs8 +/+ Bbs8 −/− p Source data are available online for this figure To spatially analyze the fibrogenic switch in the adipose tissue on the protein level, we performed whole-mount labeling of adipose tissue from lean Bbs8 +/+ Bbs8 −/− Pdgfra + Bbs8 flox flox Pdgfra Cre Bbs8 flox flox Bbs8 −/ Pdgfra Cre Bbs8 flox flox Bbs8 +/+ Pdgfra + Bbs8 flox flox 4F,G 4G,H To investigate the fate change at the single-cell level, we performed computational trajectory inferences on the P1–P3 subpopulations and the FPCs (Fig. 4H 2019 2018 4H 4H Bbs8 −/− 4H A subpopulation of P2 cells preferably interacts with the WAT vasculature, and their interactions are enriched in Bbs8 −/− A change in cell fate not only alters cell-autonomous functions but also determines how cells communicate in the tissue niche. APCs interact with various cell types in the different WAT depots (Hildreth et al, 2021 2023 2020 2019 niche 2012 2008 2021 Bbs8 +/+ Bbs8 −/− 4I 4I 5 5 4J 4K 4I Bbs8 −/− Bbs8 +/+ 4L 4I Altogether, our data indicate that loss of BBS8 leads to stronger interactions of the APCs, in particular P2_1, with the vasculature due to an increase in the expression of laminin and collagen ECM components. This suggests that primary cilia dysfunction in APCs upon loss of BBS8 not only causes a fibrogenic switch in the stem-cell-like P1 APCs but also alters the cellular interactions of committed APCs (P2_1) in the perivascular niche Loss of BBS8 results in ectopic Hedgehog signaling and diminishes the Hh-dependent signaling response To investigate the molecular mechanisms underlying the cilia-dependent change in cell fate, we analyzed primary cilia signaling in APCs isolated from lean Bbs8 +/+ Bbs8 −/− Bbs8 −/− Bbs8 +/+ 5A 5A–C 5D,E Col1a1, Sparc, and Tnc 5B Figure 5 Loss of BBS8 results in ectopic Hedgehog (Hh) signaling and diminishes the Hh-dependent signaling response, promoting fibrogenic gene expression. ( A Bbs8 +/+ Bbs8 −/− p B 2 n C D Bbs8 +/+ Bbs8 −/− C D 2 E C n n p F D n n p G Gli1 Ptch1 Bbs8 +/+ Bbs8 −/− Bbs8 +/+ p t H Gli1 Ptch1 Bbs8 +/+ Bbs8 −/− Bbs8 +/+ p t I Gli1 Ptch1 Bbs8 −/− p t J Bbs8 +/+ Bbs8 −/− Bbs8 +/+ p K Bbs8 −/− Bbs8 +/+ n n p t L Gli1 Bbs8 −/− Bbs8 +/+ Bbs8 −/− Gli1 P t n M high + Bbs8 −/− p t n Source data are available online for this figure To test whether Hh signaling is affected in Bbs8 −/− Bbs8 +/+ Bbs8 −/− 5C,E 5F,G Bbs8 +/+ Bbs8 −/− Bbs8 −/− Bbs8 +/+ 5C,E 5F,G 2013 Bbs8 +/+ 5D,F Bbs8 −/− 5D,F To investigate whether higher basal ciliary SMO levels and higher ciliary GPR161 levels affect downstream Hh signaling, we analyzed the expression of Hh target genes. Under basal conditions, the mRNA expression of Gli1 Ptch1 Bbs8 −/− Bbs8 +/+ 5G 5H Bbs8 −/− Bbs8 +/+ 5H 5I Bbs8 −/− Bbs8 +/+ Bbs8 −/− Bbs8 −/− Bbs8 +/+ 5J 5J Ptch1 Bbs8 −/− Bbs8 +/+ 5K 5L Bbs8 −/− 5M,N Bbs8 −/− 5O Ptch1 5P Next, we tested whether the phenotype observed in Bbs8 −/− BBS1 2007 BBS1 M390R M390R BBS1 +/+ 6A,B Bbs8 −/− We also analyzed a model of constitutive Hh signaling based on the loss of Ptch1 Pdgfra +/creERT2 Ptch1 fl/fl Ptch1 Pdgfra +/creERT2 Ptch1 fl/fl Ptch1 Gli1 6C–E Ptch1 2023 To assess whether complete loss of the primary cilium induces a fate change in APCs, we generated mice that lack primary cilia in Pdgfrα-expressing cells ( Pdgfra +/cre Ift20 fl/fl + 2011 + 6F–I Pdgfra +/cre Ift20 fl/fl Gli1 Ptch1 6J 6K To test whether inhibiting SMO activity is sufficient to reduce the expression of Hh target genes in Bbs8 −/− Bbs8 −/− Bbs8 −/− Gli1 5I Col1a Bbs8 −/− Bbs8 +/+ 5J Col5a Loxl2 5J Bbs8 −/− Bbs8 −/− 5K Gli1 5L Bbs8 −/− high Bbs8 −/− high Bbs8 −/− 5M 2011 2012 Thus, we demonstrate that loss of BBS8 affects the ciliary localization of Hh signaling components, i.e., it promotes ciliary SMO accumulation under basal conditions and retains GPR161 in the cilium upon stimulation of the pathway. This evokes ectopic Hh signaling under basal conditions, while the response to stimulation of Hh signaling is dampened. This phenotype can be reversed in vitro and in vivo by vismodegib treatment, rescuing ectopic Hh signaling and the fibrogenic gene expression. In summary, our results demonstrate that BBS8 regulates canonical Hh signaling in APCs of WAT to control APC cell fate. Discussion Tightly orchestrated commitment and differentiation of progenitor cells in the adipose tissue is key to maintain tissue homeostasis and function. Our study revealed that BBSome (BBS8)-dependent primary cilia signaling maintains the identity of APCs, specifically of the stem cell-like P1 subpopulation. In turn, primary cilia dysfunction upon loss of Bbs8 BBS proteins control ciliary trafficking of GPCRs (Nachury, 2018 2018 2021 2011 2013 2013 Previous reports have shown that ciliary Hh signaling determines the fate of mesenchymal progenitor cells in skeletal muscle, the so-called fibro/adipogenic progenitors (FAPs) (Kopinke et al, 2021 2017 2021 2017 2023 Bbs8 −/− 2017 2023 2012 2021 2017 ECM remodeling in the adipose tissue is not per se pathological. In fact, ECM remodeling seems to be crucial for differentiation of a mesenchymal cell into an adipocyte, which undergoes dramatic morphological and cell size changes when storing triglycerides in lipid droplets (Jääskelainen et al, 2023 2022 The change in differentiation trajectory and remodeling of ECM in WAT of Bbs8 −/− 2023 Bbs8 −/− 2023 2012 2022 Targeting Hh signaling is a major aim in cancer research as oncogenic Hh pathway activation occurs in many tumors. Vismodegib as a SMO inhibitor has been used to treat basal cell carcinoma (Meiss et al, 2018 Bbs8 −/− Methods  Reagents and tools table Reagent/resource Reference or source Identifier or catalog number  Experimental models Bbs8 −/− M. musculus Tadenev et al, ( 2011 N/A Bbs8 −/− M. musculus This study Stock Nr. 050244-UCD (MMRRC) Pdgfra M. musculus Krueger et al, ( 2014 JAX 013148 Ift20 fl/fl M. musculus Jonassen et al ( 2008 N/A Ptch1 fl/fl M. musculus Gift from Heidi Hahn (University of Göttingen) N/A Pdgfra +/creERT2 M. musculus Chung et al, ( 2018 JAX #032770 3T3-L1 cell clone #27 ( M. musculus Gift from Christoph Thiele (LIMES, Bonn) N/A hiPSC BBS1 M390R/M390R Cell Programming Core Facility, University Hospital Bonn, Germany N/A MEF ( M. musculus This study N/A  Recombinant DNA hCMV-mTtc8--3 x HA-hPGK-Blasticidin This study N/A  Antibodies Rabbit anti-SMO Anderson Lab N/A Rabbit anti-GPR161 Mukhopadhyay Lab N/A Mouse anti-Arl13b Abcam ab136648 Rabbit anti-Arl13b Proteintech 17711-1-AP Mouse anti-Tubulin, gamma Sigma T6793 Goat anti-FABP4 R&D Systems AF1443 Goat anti-GLI1 R&D Systems AF3455-SP Goat anti-GLI3 R&D Systems AF3690-SP Rat anti-CD9 Thermo Fisher 12-0091-81 Rabbit anti-Fibronectin Sigma F3648 Goat anti-PDGFRα R&D Systems AF1062-SP Mouse anti-Tubulin, beta Sigma T4026 Streptavidin BV785 BioLegend 405249 Rat anti-CD31 Biotin BioLegend 102503 Rat anti-CD31 BV785 BioLegend 102435 Rat anti-CD45 Biotin BioLegend 103103 Rat anti-CD45 AF700 BioLegend 147716 Mouse anti-TER119 Biotin BioLegend 116203 Rat anti-TER119 AF700 BioLegend 116220 Rat anti-CD26 (DPP4) PE/Cy7 BioLegend 137809 Rat anti-CD9 PerCP/Cyanine5.5 BioLegend 124818 Rat anti-CD140a (Pdgfra) BV421 BioLegend 135923 Armenian Hamster anti-CD55 APC BioLegend 122513 Armenian Hamster anti-CD29 PerCP-efluor710 eBioscience (Thermo) 46-0291 Rabbit anti-CD142 PE Sino Biological 50413-R001 Rat anti-SCA1 BV510 BioLegend 108129 Rat anti-CD54 APC-Fire 750 BioLegend 116125 Rat anti-VAP1 Abcam ab81673 Rat anti anti-CD54 Biotin BioLegend 116103 Goat anti-mouse IgG1 (y1) Alexa Fluor 488 Thermo Fisher #A21121 Donkey anti-rat Alexa Fluor 488 Dianova 712-545-153 Donkey anti-rabbit Cy3 Dianova 711-165-152 Donkey anti-rat Alexa Fluor 647 Dianova 712-605-153 Donkey anti-goat Alexa Fluor 647 Life Technologies A21447 Goat anti-mouse IgG2a (y2a) Alexa Fluor 647 Thermo Fisher #A21241 IRDye 680RD Mouse IgG (H + L) LICORBio 926-68070 IRDye 800RD Goat IgG (H + L) LICORBio 926-32214 Rat IgG (H + L), pre-absorbed Alexa Fluor 588 Abcam ab150155 Goat IgG (H + L) Alexa Fluor 594 Abcam ab150136 Rabbit IgG (H + L) Alexa Fluor 488 Abcam ab150065  Oligonucleotides and other sequence-based reagents qPCR Primers This study Appendix Table S1 SMART PCR Primer AAGCAGTGGTATCAACGCAGAGT N/A  Chemicals, Enzymes and other reagents Collagenase II Merck C6885 DNAse I PanReac AppliChem A3778 Red blood cell lysis buffer BioLegend 420301 Trypsin-EDTA (0.05%) Thermo Fisher 25200072 EDTA Thermo Fisher 15575020 DMEM/F-12, GlutaMAX™ Gibco 10565018 DMEM/GlutaMAX TM Gibco 31966047 StemMACS iPS Brew XF Medium Miltenyi Biotec 130-104-368 RPMI1640 Gibco 11875093 Penicillin Strep Gibco 15140122 Recombinant human Vitronectin Thermo Fisher A14700 Hoechst 33258 Thermo Fisher H3569 Paraformaldehyde Alfa Aesa 12789044 DAPI Invitrogen 10184322 LD540 Spandl et al, ( 2009 N/A Biotin Sigma-Aldrich B4510 D-pantothenate Sigma-Aldrich P5155 Insulin Sigma-Aldrich I9278 Dexamethasone Sigma-Aldrich D1756 3-Isobutyl-1-methylxanthine (IBMX) Sigma-Aldrich I5879 Rosiglitazone Sigma-Aldrich R2408 TUG-891 Tocris #4601 Smoothend Agonist (SAG) Sigma-Aldrich SML1314 Vismodegib LC Laboratories V-4050 ChemiBLOCKER Merck 2170 Triton X-100 Sigma-Aldrich X-100 FA 11:0;Y TCI Deutschland GmbH N/A FA 18:2;Y multistep synthesis done by Dr. Christoph Thiele N/A 13C6-FA 16:0;Y multistep synthesis done by Dr. Christoph Thiele N/A Streptavidin MicroBeads Miltenyi Biotec 130-048-101 mPIC Sigma-Aldrich P8340 Protein Marker VI AppliChem A8889 Intercept™ Blocking Buffer LI‐COR Biosciences 927‐70001 Tween® 20 Sigma-Aldrich P9416 TRI Reagent® Sigma-Aldrich T9424 Mowiol® 4-88 solution Merck 475904 Mayer′s hemalum solution Sigma-Aldrich 1.09249 Eosin Y Carl Roth 7089.1 Resorcinol-Fuchsin Carl Roth  X877.1 Picro-Sirius Red Solution abcam ab246832 Barcoded mRNA capture beads ChemGenes MACOSKO-2011-10 AMPure XP SPRI Reagent Beckman Coulter A63882  Software FlowJo software (Version 10)  https://www.flowjo.com/flowjo/overview N/A ImageJ  ImageJ N/A FIJI (Version 2.14) ImageJ N/A Imaris software (Version 9.9) Oxford Instruments N/A Zen Blue (Version 3.0 or 3.1) Zeiss N/A nf-core RNA-seq (v1.4.2) Ewels et al, ( 2020 N/A STAR Dobin et al, ( 2013 N/A bcl2fastq2 (v2.20) Illumina N/A Seurat analysis pipeline (v4.1.1)  https://satijalab.org/seurat/ N/A monocle3 package (Version 1.0.0)  https://cole-trapnell-lab.github.io/monocle3/ N/A CellChat (Versio 1.6.1) Jin et al, 2021 N/A GraphPad Prism (Version 10)  https://www.graphpad.com N/A  Other 4D-Nucleofector X Unit Lonza AAF-1003X Amaxa TM Lonza V4XP-4024 LIVE/DEAD™ Fixable Near-IR Dead Cell Stain Kit Thermo Fisher L34975 Pierce™ BCA Protein Assay Kit Thermo Fisher 23227 NuPAGE TM Invitrogen NP0321PK2 High-Capacity cDNA Reverse Transcription Kit Thermo Fisher 4368813 FastStart Universal SYBR Green Mastermix Roche® Life Science 4913914001 PureLink® RNA Mini Kit Thermo Fisher miRNeasy Micro Kit Qiagen 217084 iScript TM cDNA synthesis Kit Bio-Rad 1708840 LD columns Miltenyi Biotec 130-042-901 MS columns Miltenyi Biotec 130-042-201 Tapestation 4200 system Agilent Smart‐seq2 NovaSeq6000 system Illumina Nextera XT kit Illumina KAPA HiFi Hotstart Readymix PCR Kit Kapa Biosystems KK2602 Nextera XT DNA Library Preparation Kit Illumina Qubit™ 1X dsDNA High Sensitivity (HS) and Broad Range (BR) Assay Kits Thermo Fisher Q33230 Attune NxT Flow Cytometer Thermo Fisher Fluoview FV1000 confocal microscope Olympus BD FACSAria III BD Biosciences ID7000 Spectral Cell Analyzer 5 L Sony Biotechnology Leica SP8 AOTF Leica Leica Stellaris 8 Leica Zeiss Laser Scanning Microscope LSM 900 Zeiss Nanodrop NanoDrop Products Odyssey Imaging System LI‐COR Biosciences PCR cycler SensoQuest QuantStudio TM Thermo Fisher Thermocycler (Labcycler) SensoQuest Vi-CELL BLU Beckmann Coulter Zeiss AXIO SCAN.Z1 Zeiss Zeiss CELLDISCOVERER 7 Zeiss Animal Studies All animal experiments were performed in agreement with the German law of animal protection and local institutional animal care committees (Landesamt für Natur, Umwelt und Verbraucherschutz, LANUV). Mice were kept in individually ventilated cages in the mouse facility of University Hospital Bonn (Haus für Experimentelle Therapie [HET], Universitätsklinikum, Bonn). Mice were raised under a normal circadian light/dark cycle of each 12 h, and animals were given water and a complete diet (ssniff Spezialdiäten) ad libitum (LANUV Az 81-02.04.2019.A170). Mice were sacrificed using cervical dislocation. Generation and breeding of Bbs8 −/− 2011 Bbs8 +/+ Bbs8 −/− Bbs8 e 2000 Bbs8 flox/flox Pdgfra +/cre 2014 Pdgfra +/creERT2 2018 Vismodegib (SelleckChem Cat. No. S1082; Batch: S108207) was dissolved and stored in DMSO. For administration, it was further dissolved in corn oil, and mice were injected with 5 mg/kg i.p. every other day for a total duration of 20 days (AZ 81-02.04.2023.A233). Cell lines and cell culture The 3T3-L1 cell clone #27 was kindly provided by Christoph Thiele, LIMES Institute, University of Bonn, Germany. Cells were maintained in DMEM, supplemented with 1% GlutaMAX-I (both: Life Technologies/Life Technologies) and 10% fetal calf serum (FCS, Biochrom) at 37 °C and 5% CO 2 Adipose tissue progenitor cell isolation Progenitor cell isolation from the stromal vascular fraction (SVF) was performed as previously described (Sieckmann et al, 2022 g g Isolation and Immortalization of mouse embryonic fibroblasts For the isolation of mouse embryonic fibroblasts (MEFs), timed matings were set up with one male and two females of the desired genotype. At day 13, the pregnant mouse was anesthetized using isoflurane (Piramal Healthcare), followed by a cervical dislocation. The lower abdomen was opened by an abdominal incision to extract the two uterine horns. Embryos were isolated, transferred into a 24-well plate filled with PBS, and the head and the red organs (heart and liver) were removed. The rest of the embryo was placed into a 12-well plate filled with 2 ml ice-cold 0.25% Trypsin/PBS (diluted from 2.5% Trypsin, Gibco). The embryos were chopped into small pieces and incubated overnight at 4 °C. Then, the trypsin solution was discarded, and the remaining Trypsin/tissue mixture was incubated for 30 min in a 37 °C water bath. Afterwards of medium (composition: DMEM/Glutamax, 10% FCS, 1% sodium pyruvate (100x), 1% Pen Strep), was added, and the cell suspension was pipetted vigorously up and down to break up the digested tissue into a single cell suspension. After 1 min to allow sedimentation of the remaining tissue, the cell suspension was transferred into a new tube. This step was repeated, and afterwards, the cell suspension was filtered through a 100-μm-cell-strainer (Corning). Cells were plated and after 24 h, the medium was changed. Immortalization of MEFs was performed as described previously (Todaro and Green, 1963 Nucleofection of MEFs For transient expression of Bbs8 (hCMV-mTtc8-3 x HA-hPGK-Blasticidin, generated and provided by Rainer Stahl, University of Bonn) in MEFs, 200,000 cells were spun down at 400 × g 2 iPSC culture The hiPSC BBS1 M390R/M390R Ex vivo gonadal adipose tissue explants To investigate adipose tissue development, pre-gWAT of male mice on P4 was dissected and separated from the testis, epididymis, and vas deferens. Tissues were either fixed immediately with 4% PFA for 1 h to prepare for immunostaining. Alternatively, tissues were cultivated for 24 h in RPMI1640 medium (Gibco) containing 10% FCS and 1% Pen/ Strep (Gibco/ Life Technologies) for pharmacological stimulation and subsequently frozen for RNA extraction. Magnetic activated cell sorting (MACS) MACS was performed according to the manufacturer’s instructions (Miltenyi Biotec). For negative selection, suspended cells were incubated with biotinylated anti-CD45, anti-CD31, and anti-TER119 antibodies (Biolegend), followed by incubation with Streptavidin MicroBeads (Miltenyi Biotec). Samples were run through LD columns (Miltenyi Biotec) followed by three washes with MACS buffer (0.5% BSA, 2.5 mM EDTA in PBS). Unlabeled cells were collected and either cultured (referred to as SVF Lin- cells or further incubated with anti-CD54 (Biolegend) and anti-VAP1 (abcam) antibodies, followed by Streptavidin MicroBeads. Unlabeled cells were collected using MS columns (Miltenyi Biotec). After three washes with MACS buffer, cells were eluted and used for downstream applications. Flow cytometry and fluorescence-assisted cell sorting (FACS) Mouse antibodies for flow cytometry were purchased from Biolegend, Thermo Fisher Scientific, Miltenyi Biotec, and BD Biosciences (Reagents and Tools Table). Isolated SVF cells were stained with primary antibodies for 30 min on ice, washed, and stained with the secondary antibody for 15 min on ice. Hoechst 33258 (Thermo Fisher) or LIVE/DEAD™ Fixable Near-IR Dead Cell Stain Kit (Thermo Fisher) were used to exclude dead cells. Data were acquired on a Sony ID700 spectral cytometer (BD Biosciences) or the Attune NxT Flow Cytometer (Thermo Fisher Scientific) and analyzed with the FlowJo software (Tree Star). To generate the UMAP, the SCA1 + Immunocytochemistry Cells were fixed with 4% paraformaldehyde (PFA, 16% wt/vol ag. Soln., methanol free, Alfa Aesa) for 10 min and subsequently washed with PBS before blocking with CT (0.5% Triton X-100 (Sigma-Aldrich), 5% ChemiBLOCKER (Merck Millipore) in 0.1 M NaP, pH 7.0) for 30 min at room temperature. Primary and secondary antibodies were diluted in CT and incubated for 60 min at room temperature. DAPI (4′,6-diamidino-2-phenylindole, dihydrochloride, 1:10,000, Invitrogen) was used as a DNA counterstain together with the secondary antibody. For staining of lipid droplets, cells were incubated with the lipophilic dye LD540 (1:10,000) (Spandl et al, 2009 SVF culture and in vitro assays Cells were maintained in maintenance medium containing DMEM/F-12 (1:1), supplemented with 1% GlutaMAX-I, 1% penicillin-streptomycin (all Life Technologies/Life Technologies), 10% FCS (Biochrom), 33 mM biotin (Sigma), and 17 mM d 2 For the adipogenesis assay, isolated APCs were seeded on CellCarrier Ultra 96- or 384- well plates. When cells reached confluency, adipogenesis was induced by switching to their respective induction cocktail: (a) Full Induction (FI) containing 5 µg/ml insulin, 1 µM Dexamethasone, 100 µM IBMX, and 1 µM rosiglitazone (Sigma); (b) Minimal Induction (MI) (Hilgendorf et al, 2019 The medium was exchanged to freshly prepared maintenance medium, containing 1 µg/ml insulin on days 3 and 5. Additionally, as a negative control, undifferentiated cells without induction medium were kept in maintenance medium. To induce Hh signaling in APCs or MEF cells, APCs were starved for 12 or 24 h, respectively. Cells were then stimulated with 1 µM Smoothend Agonist (SAG, Sigma) or H 2 To activate Hh signaling in 3T3-L1 cells, the cells were seeded and grown to full confluency over 48 h. Then, cells were stimulated with 100 nM SAG (Sigma) for 24 h and harvested for RNA isolation. To investigate Hh signaling in hiPSCs, BBS1 M390R M390R BBS1 +/+ To block Hh signaling in APCs, the cells were incubated with 2 µM vismodegib (LC Laboratories) or DMSO (vehicle) for 48 h. Cells were then harvested for RNA isolation. Pulse chase analysis of fatty acid incorporation Pulse chase analysis using alkyne-labeled fatty acids followed the protocol described in (Wunderling et al, 2023 Lipid extraction and click reaction All solvents were HPLC grade or LC-MS grade and were purchased from VWR International GmbH (Darmstadt, Germany) and Merck KGaA (Darmstadt, Germany). To each well, 500 µl of extraction mix (490 µl MeOH/CHCl 3 2023 g 3 g 3 4 4 To the samples clicked with C175-7x, 100 µl CHCl 3 g Mass spectrometry The dissolved lipids were analyzed on a Thermo Q Exactive Plus spectrometer equipped with a standard heated electrospray ionization source and established data analysis procedure (Wunderling et al, 2023 Protein preparation and Western blot analysis All steps were performed at 4 °C and in the presence of a mammalian protease inhibitor cocktail (mPIC, Sigma-Aldrich, #P8340‐1 ML). Cells were washed with PBS and lysed in the plates using RIPA buffer (20 mM Tris‐HCl pH 7.4, 150 mM NaCl, 1 mM EDTA, 1% Triton X‐100, 10% glycerol, 0.1% SDS, and 0.5% deoxycholate). The protein concentration was determined with a Pierce™ BCA Protein Assay Kit (Thermo Fisher Scientific, #23227) according to the manufacturer’s instructions. Samples were suspended in SDS sample buffer (200 mM Tris/HCl, pH 6.8, 8% SDS, 4% ß‐mercapto‐ethanol, 50% Glycerin, and 0.04% bromphenol blue). Discontinuous gels were casted with a 10% separation gel (1.5 mL Tris-HCl (pH 8.8), 60 µL 10% (w/v) SDS, 40 µL (w/v) APS, 6 µL TEMED, 2 mL 30% (v/v) acrylamide/bis-acrylamide (37.5:1) solution, and 2.42 mL H2O), and a 5% stacking gel (0.5 mL Tris-HCl (pH 6.8), 20 µL 10% (w/v) SDS, 40 µL (w/v) APS, 6 µL TEMED, 340 µL 30% (v/v) acrylamide/bis-acrylamide(37.5:1) solution, and 1.12 mL H2O). Alternatively, NuPAGE TM Quantitative RT-PCR To isolate mRNA, primary adipocytes and adipose tissues were lysed within a monophasic solution of phenol and guanidine isothiocyanate reagent (TRI Reagent®, Sigma-Aldrich #T9424) following silica-based RNA spin column enrichment and eluted with RNAse/DNAse-free water. RNA concentrations were measured using a spectrophotometer (Nanodrop, Thermo Fisher), and RNA were used for reverse transcription (High-Capacity cDNA Reverse Transcription Kit, Thermo Fisher #4368813). Abundance of genes of interest was quantified using the SYBR Green-based quantification method (FastStart Universal SYBR Green Mastermix, Roche® Life Science #4913914001) and mRNA abundance was calculated using relative quantification methods (Pfaffl Method; Pfaffl et al, 2001). Transcript levels of mRNAs were normalized to glycerinaldehyde-3-phosphate-dehydrogenase ( Gapdh Tatabp S1 Histology Histological analysis was performed as previously described (Sieckmann et al, 2022 For histological analysis WAT sections were stained with Hematoxylin and Eosin (H&E) or Sirius Red and Elastika van Gieson (EvG) and using the Leica ST5020 Multistainer combined with Leica CV5030 Fully Automated Glass Coverslipper. Deparaffinization of paraffin-embedded WAT slices was performed and three subsequent steps in xylene before incubation in a graded alcohol series (100–70% ethanol) to rehydrate the tissue sections and ending with a final rinsing step in sterile distilled water (dH2O). Next, tissue slices were stained with Mayer’s hemalum solution (Sigma-Aldrich). To counterstain with Eosin Y solution (1% in water, Roth), slides were immersed in eosin. For the Sirius Red and EvG staining slides were firstly incubated in Resorcinol-Fuchsin, following staining in haematoxylin and finally Picro-Sirius Red solution. Next, slices were washed in 30% acetic acid and shortly stained in Picric Fuchsine. After each respective staining, the slides were incubated in a graded alcohol series (70–100% ethanol) to dehydrate the tissue. Paraffin embedding, slicing, and staining were conducted by the histology facility at University Hospital Bonn. Whole-mount staining For whole-mount staining, tissues were fixed with 4% PFA for 2 h at 4°C and subsequently washed with PBS. Tissues were then cut into small pieces (~2 × 2 mm) and placed into a 24-well plate. Blocking solution (1% (w/v) BSA + 1% (v/v) Triton X-100 in PBS) was added, and samples were incubated for 2 h at RT on a rocking platform. Following fixation and blocking, primary antibodies were applied. Antibodies were diluted in blocking solution, and tissues were incubated overnight at 4 °C on a rocking platform. After washing samples with PBS, secondary antibodies, diluted in DAPI solution, was added to each sample. Tissues were incubated overnight at 4 °C, protected from light. After incubation time, samples were washed with PBS and mounted in Elvanol, covered with a glass cover slip, and stored at 4 °C until imaged. To prepare a 25% (w/v) Mowiol® 4-88 solution, the powder was dissolved in PBS and stirred continuously at room temperature (RT) overnight. The following day, the solution was heated to 50 °C and stirred for an additional 2–3 h to ensure complete dissolution. Afterward, 50 ml of glycerol was added, and the mixture was stirred at RT overnight. The solution was then centrifuged at 12,000× g Microscopy and image analyses Confocal z-stacks were recorded with a confocal microscope at the Microscopy Core Facility of the Medical Faculty at the University of Bonn (Leica SP8) or an Olympus Fluoview FV1000 confocal microscope at the Caesar Institute (Bonn). For quantifying fluorescence signals, z-stacks were recorded from at least two random positions per experiment and analyzed using “CiliaQ” (Hansen et al, 2021 Fluorescence images of adipogenesis assays were taken at the CellDiscoverer 7 widefield microscope (Zeiss) using automated image acquisition. Two or four images were acquired per well, each in a z-stack (step size 4 µm, 10× magnification). Depicted images are shown as a projection of the sharpest plane, including the plane above and below. A maximum projection around the sharpest plane was generated using the ImageJ plugin ExtractSharpestPlane_JNH (10.5281/zenodo.5646492) (Hansen et al, 2021 2022 Bulk RNA-sequencing and analysis Subpopulations were sorted as described above and immediately stored in Trizol. Total RNA was extracted using the miRNeasy Micro kit (Qiagen) according to the manufacturer’s protocol. RNA was quantified, and RNA integrity was determined using the HS RNA assay on a Tapestation 4200 system (Agilent). Smart‐seq2 was used for the generation of non‐strand‐specific, full transcript sequencing libraries using standard reagents and procedures as previously described (Picelli et al, 2014 The RNA-seq 3′ data were processed with nf-core RNA-seq v1.4.2 (Ewels et al, 2020 2013 2014 2019 2014 2010 2016 2005 2010 2021 Single-cell RNA-sequencing—sample preparation Sequencing primarily relied on the Seq-Well S 3 2020 2017 2020 https://github.com/Hoohm/dropSeqPipe 2015 Single-cell RNA-sequencing—data analysis The scRNA-seq data analysis was conducted using the Seurat analysis pipeline (version 4.1.1) unless otherwise specified. To address differences in sequencing depth, the downsampleBatches function from the scuttle package (version 1.0.4) was employed using default parameter settings. Cells expressing fewer than 100 or more than 1000 genes, as well as those with more than 20 percent mitochondrial genes, were removed. The individual sequencing samples were integrated using 2000 variable features. Using the first 30 dimensions, the Louvain algorithm detected 16 cell clusters, which were annotated using known marker gene panels (see Appendix Fig. S 4C To account for sample size differences due to varying sequencing depths, the Bbs8 −/− Bbs8 +/+ Bbs8 −/− Bbs8 +/+ Bbs8 −/− Differences in the murine GSEA Hallmark-Hedgehog (Hh) signature across genotypes within the APC and FPC subpopulation were assessed using Seurat’s AddModuleScore function. First, the Hallmark genes were filtered for expressed genes before calculating cell-wise Hh-signature scores. Those scores were grouped per genotype and compared using a Wilcoxon test within the downsampled subset. Further characterization of the FPC population involved an overrepresentation analysis (ORA) employing the C2 MsigDB data repository, using the top 50 up- and down-regulated genes between FPCs and all other cell populations, as described (Kwon et al, 2023 p q CellChat (v1.6.1) (Jin et al, 2021 Bbs8 +/+ Bbs8 −/− Interaction difference heatmaps were created using the ComplexHeatmap package. Complex heatmaps reveal patterns and correlations in multidimensional genomic data (Gu et al, 2016 In search for vessel-associated APC cells, the Seurat object was subset to contain only the three APC populations with the Fibroblast cluster. The “FindSubCluster” command was used with the “resolution = 0.3” argument to create two subclusters of the APC P2 cluster. 90.50, 88.46, and 87.34% of the cells of interest (“APC P2_1”) still cluster together with 3, 4, or 5 subclusters created, respectively. The marker list (Dataset EV 3 Quantification, statistical analysis, and reproducibility Results are presented as mean ± SEM or mean ± SD as indicated. The lean time point for each mouse line was chosen based on the mean body weight with the most similar value and the smallest standard deviation. All body weights were then normalized to this mean, respective for each genotype. Each mouse represents an independent biological sample. Prism 8.2.0 and 10.4.1 software was used to calculate P t t- P n The CD9 and FBN intensity in whole-mount stainings were quantified with the Imaris software. For CD9 intensity quantification, high-resolution confocal images in. ims format were opened using the 3D view in the Surpass interface. A 3D surface was created based on the PDGFRα signal using the “Add Surfaces” function. The mean intensity of the CD9 staining within this surface was measured using the “Statistics” tool. For FBN intensity quantification, high-resolution confocal images were similarly visualized in 3D, and the mean intensity was obtained directly from the FBN signal using the “Volume” and “Statistics” functions. Graphics The Synopsis and Fig. 1A Supplementary information  Appendix Peer Review File Dataset EV1 Dataset EV2 Dataset EV3 Dataset EV4 Dataset EV5 Source date Fig. 1 Figure1c Source Data - part 1 Figure1c Source Data - part 2 Source date Fig. 2 Source date Fig. 3 Figure 3h Source Data - part 1 Fig. 3h Source Data - part 2 Figure 3h Source Data - part 3 Figure 3h Source Data - part 4 Figure 3h Source Data - part 5 Figure 3h Source Data - part 6 Figure 3h Source Data - part 7 Figure 3h Source Data - part 8 Source date Fig. 4 Source date Fig. 5 Figure 5m Source Data - part 1 Figure 5m Source Data - part 2 Figure 5m Source Data - part 3 Figure 5m Source Data - part 4 These authors contributed equally: Katharina Sieckmann, Nora Winnerling. Supplementary information Expanded view data, supplementary information, appendices are available for this paper at 10.1038/s44318-025-00524-y. Acknowledgements We thank Jens-Henning Krause, Maximilian Rothe, Rainer Stahl, and Romina Kaiser for technical support. We thank Heidi Hahn for providing Ptch1 Pdgfr 2 Author contributions Katharina Sieckmann Nora Winnerling Dalila Juliana Silva Ribeiro Seniz Yüksel Ronja Kardinal Lisa Maria Steinheuer Fabian Frechen Luis Henrique Corrêa Geza Schermann Christina Klausen Nelli Blank-Stein Jonas Schulte-Schrepping Collins Osei-Sarpong Matthias Becker Lorenzo Bonaguro Marc Beyer Helen Louise May-Simera Jelena Zurkovic Christoph Thiele Kevin Thurley Lydia Sorokin Carmen Ruiz de Almodovar Elvira Mass Dagmar Wachten Source data underlying figure panels in this paper may have individual authorship assigned. Where available, figure panel/source data authorship is listed in the following database record: biostudies:S-SCDT-10_1038-S44318-025-00524-y Funding Open Access funding enabled and organized by Projekt DEAL. Data availability Non-commercially available reagents or mouse lines can be made available under a material transfer agreement with the University Hospital Bonn. All data inquiries should be addressed to DW. The datasets produced in this study are available in the following databases: Imaging data: Figshare  https://figshare.com/projects/BBSome-dependent_ciliary_Hedgehog_signaling_governs_cell_fate_in_the_white_adipose_tissue/193025 RNA-seq data: Gene Expression Omnibus GSE254259 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE254259 This paper does not report original code. All codes used in this paper are available from DW upon request. The source data of this paper are collected in the following database record: biostudies:S-SCDT-10_1038-S44318-025-00524-y Disclosure and competing interests statement The authors declare no competing interests. References Altun I Yan X Ussar S Immune cell regulation of white adipose progenitor cell fate Front Endocrinol 2022 13 859044 10.3389/fendo.2022.859044 PMC9001836 35422761 Altun I, Yan X, Ussar S (2022) Immune cell regulation of white adipose progenitor cell fate. Front Endocrinol 13:859044 10.3389/fendo.2022.859044 PMC9001836 35422761 Anders S Huber W Differential expression analysis for sequence count data Genome Biol 2010 11 R106 10.1186/gb-2010-11-10-r106 20979621 PMC3218662 Anders S, Huber W (2010) Differential expression analysis for sequence count data. Genome Biol 11:R106 20979621 10.1186/gb-2010-11-10-r106 PMC3218662 Blüher M Obesity: global epidemiology and pathogenesis Nat Rev Endocrinol 2019 15 288 298 10.1038/s41574-019-0176-8 30814686 Blüher M (2019) Obesity: global epidemiology and pathogenesis. Nat Rev Endocrinol 15:288–298 30814686 10.1038/s41574-019-0176-8 Boutari C Mantzoros CS A 2022 update on the epidemiology of obesity and a call to action: as its twin COVID-19 pandemic appears to be receding, the obesity and dysmetabolism pandemic continues to rage on Metabolism 2022 133 155217 10.1016/j.metabol.2022.155217 35584732 PMC9107388 Boutari C, Mantzoros CS (2022) A 2022 update on the epidemiology of obesity and a call to action: as its twin COVID-19 pandemic appears to be receding, the obesity and dysmetabolism pandemic continues to rage on. Metabolism 133:155217 35584732 10.1016/j.metabol.2022.155217 PMC9107388 Brewer KM Brewer KK Richardson NC Berbari NF Neuronal cilia in energy homeostasis Front Cell Dev Biol 2022 10 1082141 10.3389/fcell.2022.1082141 36568981 PMC9773564 Brewer KM, Brewer KK, Richardson NC, Berbari NF (2022) Neuronal cilia in energy homeostasis. Front Cell Dev Biol 10:1082141 36568981 10.3389/fcell.2022.1082141 PMC9773564 Burl RB Ramseyer VD Rondini EA Pique-Regi R Lee YH Granneman JG Deconstructing adipogenesis induced by beta3-adrenergic receptor activation with single-cell expression profiling Cell Metab 2018 28 300 309.e304 10.1016/j.cmet.2018.05.025 29937373 PMC6082711 Burl RB, Ramseyer VD, Rondini EA, Pique-Regi R, Lee YH, Granneman JG (2018) Deconstructing adipogenesis induced by beta3-adrenergic receptor activation with single-cell expression profiling. Cell Metab 28:300–309.e304 29937373 10.1016/j.cmet.2018.05.025 PMC6082711 Cho DS Lee B Doles JD Refining the adipose progenitor cell landscape in healthy and obese visceral adipose tissue using single-cell gene expression profiling Life Sci Alliance 2019 2 e201900561 10.26508/lsa.201900561 31767614 PMC6878222 Cho DS, Lee B, Doles JD (2019) Refining the adipose progenitor cell landscape in healthy and obese visceral adipose tissue using single-cell gene expression profiling. Life Sci Alliance 2:e201900561 31767614 10.26508/lsa.201900561 PMC6878222 Chouchani ET Kajimura S Metabolic adaptation and maladaptation in adipose tissue Nat Metab 2019 1 189 200 10.1038/s42255-018-0021-8 31903450 PMC6941795 Chouchani ET, Kajimura S (2019) Metabolic adaptation and maladaptation in adipose tissue. Nat Metab 1:189–200 31903450 10.1038/s42255-018-0021-8 PMC6941795 Chung MI Bujnis M Barkauskas CE Kobayashi Y Hogan BLM Niche-mediated BMP/SMAD signaling regulates lung alveolar stem cell proliferation and differentiation Development 2018 145 dev163014 10.1242/dev.163014 29752282 PMC5992594 Chung MI, Bujnis M, Barkauskas CE, Kobayashi Y, Hogan BLM (2018) Niche-mediated BMP/SMAD signaling regulates lung alveolar stem cell proliferation and differentiation. Development 145:dev163014 29752282 10.1242/dev.163014 PMC5992594 Das SK Roberts SB Kehayias JJ Wang J Hsu LK Shikora SA Saltzman E McCrory MA Body composition assessment in extreme obesity and after massive weight loss induced by gastric bypass surgery Am J Physiol Endocrinol Metab 2003 284 E1080 1088 10.1152/ajpendo.00185.2002 12604503 Das SK, Roberts SB, Kehayias JJ, Wang J, Hsu LK, Shikora SA, Saltzman E, McCrory MA (2003) Body composition assessment in extreme obesity and after massive weight loss induced by gastric bypass surgery. Am J Physiol Endocrinol Metab 284:E1080–1088 12604503 10.1152/ajpendo.00185.2002 Davis RE Swiderski RE Rahmouni K Nishimura DY Mullins RF Agassandian K Philp AR Searby CC Andrews MP Thompson S A knockin mouse model of the Bardet-Biedl syndrome 1 M390R mutation has cilia defects, ventriculomegaly, retinopathy, and obesity Proc Natl Acad Sci USA 2007 104 19422 19427 10.1073/pnas.0708571104 18032602 PMC2148305 Davis RE, Swiderski RE, Rahmouni K, Nishimura DY, Mullins RF, Agassandian K, Philp AR, Searby CC, Andrews MP, Thompson S et al (2007) A knockin mouse model of the Bardet-Biedl syndrome 1 M390R mutation has cilia defects, ventriculomegaly, retinopathy, and obesity. Proc Natl Acad Sci USA 104:19422–19427 18032602 10.1073/pnas.0708571104 PMC2148305 DeMars KM Ross MR Starr A McIntyre JC Neuronal primary cilia integrate peripheral signals with metabolic drives Front Physiol 2023 14 1150232 10.3389/fphys.2023.1150232 37064917 PMC10090425 DeMars KM, Ross MR, Starr A, McIntyre JC (2023) Neuronal primary cilia integrate peripheral signals with metabolic drives. Front Physiol 14:1150232 37064917 10.3389/fphys.2023.1150232 PMC10090425 Dobin A Davis CA Schlesinger F Drenkow J Zaleski C Jha S Batut P Chaisson M Gingeras TR STAR: ultrafast universal RNA-seq aligner Bioinformatics 2013 29 15 21 10.1093/bioinformatics/bts635 23104886 PMC3530905 Dobin A, Davis CA, Schlesinger F, Drenkow J, Zaleski C, Jha S, Batut P, Chaisson M, Gingeras TR (2013) STAR: ultrafast universal RNA-seq aligner. Bioinformatics 29:15–21 23104886 10.1093/bioinformatics/bts635 PMC3530905 Engle SE Bansal R Antonellis PJ Berbari NF Cilia signaling and obesity Semin Cell Dev Biol 2021 110 43 50 10.1016/j.semcdb.2020.05.006 32466971 PMC8739279 Engle SE, Bansal R, Antonellis PJ, Berbari NF (2021) Cilia signaling and obesity. Semin Cell Dev Biol 110:43–50 32466971 10.1016/j.semcdb.2020.05.006 PMC8739279 Ewels PA Peltzer A Fillinger S Patel H Alneberg J Wilm A Garcia MU Di Tommaso P Nahnsen S The nf-core framework for community-curated bioinformatics pipelines Nat Biotechnol 2020 38 276 278 10.1038/s41587-020-0439-x 32055031 Ewels PA, Peltzer A, Fillinger S, Patel H, Alneberg J, Wilm A, Garcia MU, Di Tommaso P, Nahnsen S (2020) The nf-core framework for community-curated bioinformatics pipelines. Nat Biotechnol 38:276–278 32055031 10.1038/s41587-020-0439-x Ewerling A Maissl V Wickstead B May-Simera HL Neofunctionalization of ciliary BBS proteins to nuclear roles is likely a frequent innovation across eukaryotes iScience 2023 26 106410 10.1016/j.isci.2023.106410 37034981 PMC10074162 Ewerling A, Maissl V, Wickstead B, May-Simera HL (2023) Neofunctionalization of ciliary BBS proteins to nuclear roles is likely a frequent innovation across eukaryotes. iScience 26:106410 37034981 10.1016/j.isci.2023.106410 PMC10074162 Ferrero R Rainer P Deplancke B Toward a consensus view of mammalian adipocyte stem and progenitor cell heterogeneity Trends Cell Biol 2020 30 937 950 10.1016/j.tcb.2020.09.007 33148396 Ferrero R, Rainer P, Deplancke B (2020) Toward a consensus view of mammalian adipocyte stem and progenitor cell heterogeneity. Trends Cell Biol 30:937–950 33148396 10.1016/j.tcb.2020.09.007 Forsythe E Beales PL Bardet-Biedl syndrome Eur J Hum Genet 2013 21 8 13 10.1038/ejhg.2012.115 22713813 PMC3522196 Forsythe E, Beales PL (2013) Bardet-Biedl syndrome. Eur J Hum Genet 21:8–13 22713813 10.1038/ejhg.2012.115 PMC3522196 Gascue C Tan PL Cardenas-Rodriguez M Libisch G Fernandez-Calero T Liu YP Astrada S Robello C Naya H Katsanis N Direct role of Bardet-Biedl syndrome proteins in transcriptional regulation J Cell Sci 2012 125 362 375 10.1242/jcs.089375 22302990 PMC3283873 Gascue C, Tan PL, Cardenas-Rodriguez M, Libisch G, Fernandez-Calero T, Liu YP, Astrada S, Robello C, Naya H, Katsanis N et al (2012) Direct role of Bardet-Biedl syndrome proteins in transcriptional regulation. J Cell Sci 125:362–375 22302990 10.1242/jcs.089375 PMC3283873 Gierahn TM Wadsworth MH 2nd Hughes TK Bryson BD Butler A Satija R Fortune S Love JC Shalek AK Seq-Well: portable, low-cost RNA sequencing of single cells at high throughput Nat Methods 2017 14 395 398 10.1038/nmeth.4179 28192419 PMC5376227 Gierahn TM, Wadsworth 2nd MH, Hughes TK, Bryson BD, Butler A, Satija R, Fortune S, Love JC, Shalek AK (2017) Seq-Well: portable, low-cost RNA sequencing of single cells at high throughput. Nat Methods 14:395–398 28192419 10.1038/nmeth.4179 PMC5376227 Gopalakrishnan J Feistel K Friedrich BM Grapin-Botton A Jurisch-Yaksi N Mass E Mick DU Muller RU May-Simera H Schermer B Emerging principles of primary cilia dynamics in controlling tissue organization and function EMBO J 2023 42 e113891 10.15252/embj.2023113891 37743763 PMC10620770 Gopalakrishnan J, Feistel K, Friedrich BM, Grapin-Botton A, Jurisch-Yaksi N, Mass E, Mick DU, Muller RU, May-Simera H, Schermer B et al (2023) Emerging principles of primary cilia dynamics in controlling tissue organization and function. EMBO J 42:e113891 37743763 10.15252/embj.2023113891 PMC10620770 Gu Z, Eils R, Schlesner M (2016) Complex heatmaps reveal patterns and correlations in multidimensional genomic data. Bioinformatics 32:2847–2849 10.1093/bioinformatics/btw313 27207943 Gupta RK Mepani RJ Kleiner S Lo JC Khandekar MJ Cohen P Frontini A Bhowmick DC Ye L Cinti S Zfp423 expression identifies committed preadipocytes and localizes to adipose endothelial and perivascular cells Cell Metab 2012 15 230 239 10.1016/j.cmet.2012.01.010 22326224 PMC3366493 Gupta RK, Mepani RJ, Kleiner S, Lo JC, Khandekar MJ, Cohen P, Frontini A, Bhowmick DC, Ye L, Cinti S et al (2012) Zfp423 expression identifies committed preadipocytes and localizes to adipose endothelial and perivascular cells. Cell Metab 15:230–239 22326224 10.1016/j.cmet.2012.01.010 PMC3366493 Han J Lee JE Jin J Lim JS Oh N Kim K Chang SI Shibuya M Kim H Koh GY The spatiotemporal development of adipose tissue Development 2011 138 5027 5037 10.1242/dev.067686 22028034 Han J, Lee JE, Jin J, Lim JS, Oh N, Kim K, Chang SI, Shibuya M, Kim H, Koh GY (2011) The spatiotemporal development of adipose tissue. Development 138:5027–5037 22028034 10.1242/dev.067686 Hansen JN Rassmann S Stüven B Jurisch-Yaksi N Wachten D CiliaQ: a simple, open-source software for automated quantification of ciliary morphology and fluorescence in 2D, 3D, and 4D images Eur Phys J E Soft Matter 2021 44 18 10.1140/epje/s10189-021-00031-y 33683488 PMC7940315 Hansen JN, Rassmann S, Stüven B, Jurisch-Yaksi N, Wachten D (2021) CiliaQ: a simple, open-source software for automated quantification of ciliary morphology and fluorescence in 2D, 3D, and 4D images. Eur Phys J E Soft Matter 44:18 33683488 10.1140/epje/s10189-021-00031-y PMC7940315 Hasegawa Y New perspectives on obesity-induced adipose tissue fibrosis and related clinical manifestations Endocr J 2022 69 739 748 10.1507/endocrj.EJ22-0035 35675998 Hasegawa Y (2022) New perspectives on obesity-induced adipose tissue fibrosis and related clinical manifestations. Endocr J 69:739–748 35675998 10.1507/endocrj.EJ22-0035 Hepler C Shan B Zhang Q Henry GH Shao M Vishvanath L Ghaben AL Mobley AB Strand D Hon GC Identification of functionally distinct fibro-inflammatory and adipogenic stromal subpopulations in visceral adipose tissue of adult mice eLife 2018 7 e39636 10.7554/eLife.39636 30265241 PMC6167054 Hepler C, Shan B, Zhang Q, Henry GH, Shao M, Vishvanath L, Ghaben AL, Mobley AB, Strand D, Hon GC et al (2018) Identification of functionally distinct fibro-inflammatory and adipogenic stromal subpopulations in visceral adipose tissue of adult mice. eLife 7:e39636 30265241 10.7554/eLife.39636 PMC6167054 Hey CAB Larsen LJ Tumer Z Brondum-Nielsen K Gronskov K Hjortshoj TD Moller LB BBS proteins affect ciliogenesis and are essential for hedgehog signaling, but not for formation of iPSC-derived RPE-65 expressing RPE-like cells Int J Mol Sci 2021 22 1345 10.3390/ijms22031345 33572860 PMC7866284 Hey CAB, Larsen LJ, Tumer Z, Brondum-Nielsen K, Gronskov K, Hjortshoj TD, Moller LB (2021) BBS proteins affect ciliogenesis and are essential for hedgehog signaling, but not for formation of iPSC-derived RPE-65 expressing RPE-like cells. Int J Mol Sci 22:1345 33572860 10.3390/ijms22031345 PMC7866284 Hildreth AD Ma F Wong YY Sun R Pellegrini M O’Sullivan TE Single-cell sequencing of human white adipose tissue identifies new cell states in health and obesity Nat Immunol 2021 22 639 653 10.1038/s41590-021-00922-4 33907320 PMC8102391 Hildreth AD, Ma F, Wong YY, Sun R, Pellegrini M, O’Sullivan TE (2021) Single-cell sequencing of human white adipose tissue identifies new cell states in health and obesity. Nat Immunol 22:639–653 33907320 10.1038/s41590-021-00922-4 PMC8102391 Hilgendorf KI Primary cilia are critical regulators of white adipose tissue expansion Front Physiol 2021 12 769367 10.3389/fphys.2021.769367 34759842 PMC8573240 Hilgendorf KI (2021) Primary cilia are critical regulators of white adipose tissue expansion. Front Physiol 12:769367 34759842 10.3389/fphys.2021.769367 PMC8573240 Hilgendorf KI Johnson CT Mezger A Rice SL Norris AM Demeter J Greenleaf WJ Reiter JF Kopinke D Jackson PK Omega-3 fatty acids activate ciliary FFAR4 to control adipogenesis Cell 2019 179 1289 1305.e1221 10.1016/j.cell.2019.11.005 31761534 PMC7332222 Hilgendorf KI, Johnson CT, Mezger A, Rice SL, Norris AM, Demeter J, Greenleaf WJ, Reiter JF, Kopinke D, Jackson PK (2019) Omega-3 fatty acids activate ciliary FFAR4 to control adipogenesis. Cell 179:1289–1305.e1221 31761534 10.1016/j.cell.2019.11.005 PMC7332222 Horwitz A Birk R BBS4 is essential for nuclear transport of transcription factors mediating neuronal ER stress response Mol Neurobiol 2021 58 78 91 10.1007/s12035-020-02104-z 32894499 Horwitz A, Birk R (2021) BBS4 is essential for nuclear transport of transcription factors mediating neuronal ER stress response. Mol Neurobiol 58:78–91 32894499 10.1007/s12035-020-02104-z Horwitz A Birk R Adipose tissue hyperplasia and hypertrophy in common and syndromic obesity-the case of BBS obesity Nutrients 2023 15 3445 10.3390/nu15153445 37571382 PMC10421039 Horwitz A, Birk R (2023) Adipose tissue hyperplasia and hypertrophy in common and syndromic obesity-the case of BBS obesity. Nutrients 15:3445 37571382 10.3390/nu15153445 PMC10421039 Hughes TK Wadsworth MH 2nd Gierahn TM Do T Weiss D Andrade PR Ma F de Andrade Silva BJ Shao S Tsoi LC Second-strand synthesis-based massively parallel scRNA-seq reveals cellular states and molecular features of human inflammatory skin pathologies Immunity 2020 53 878 894.e877 10.1016/j.immuni.2020.09.015 33053333 PMC7562821 Hughes TK, Wadsworth 2nd MH, Gierahn TM, Do T, Weiss D, Andrade PR, Ma F, de Andrade Silva BJ, Shao S, Tsoi LC et al (2020) Second-strand synthesis-based massively parallel scRNA-seq reveals cellular states and molecular features of human inflammatory skin pathologies. Immunity 53:878–894.e877 33053333 10.1016/j.immuni.2020.09.015 PMC7562821 Jääskelainen I Petäisto T Mirzarazi Dahagi E Mahmoodi M Pihlajaniemi T Kaartinen MT Heljasvaara R Collagens regulating adipose tissue formation and functions Biomedicines 2023 11 1412 10.3390/biomedicines11051412 37239083 PMC10216475 Jääskelainen I, Petäisto T, Mirzarazi Dahagi E, Mahmoodi M, Pihlajaniemi T, Kaartinen MT, Heljasvaara R (2023) Collagens regulating adipose tissue formation and functions. Biomedicines 11:1412 37239083 10.3390/biomedicines11051412 PMC10216475 Jin S Guerrero-Juarez CF Zhang L Chang I Ramos R Kuan CH Myung P Plikus MV Nie Q Inference and analysis of cell-cell communication using CellChat Nat Commun 2021 12 1088 10.1038/s41467-021-21246-9 33597522 PMC7889871 Jin S, Guerrero-Juarez CF, Zhang L, Chang I, Ramos R, Kuan CH, Myung P, Plikus MV, Nie Q (2021) Inference and analysis of cell-cell communication using CellChat. Nat Commun 12:1088 33597522 10.1038/s41467-021-21246-9 PMC7889871 Jonassen et al (2008) Deletion of IFT20 in the mouse kidney causes misorientation of the mitotic spindle and cystic kidney disease. J Cell Biol. 183:377–384 10.1083/jcb.200808137 PMC2575779 18981227 Kopinke D Norris AM Mukhopadhyay S Developmental and regenerative paradigms of cilia regulated hedgehog signaling Semin Cell Dev Biol 2021 110 89 103 10.1016/j.semcdb.2020.05.029 32540122 PMC7736055 Kopinke D, Norris AM, Mukhopadhyay S (2021) Developmental and regenerative paradigms of cilia regulated hedgehog signaling. Semin Cell Dev Biol 110:89–103 32540122 10.1016/j.semcdb.2020.05.029 PMC7736055 Kopinke D Roberson EC Reiter JF Ciliary hedgehog signaling restricts injury-induced adipogenesis Cell 2017 170 340 351.e312 10.1016/j.cell.2017.06.035 28709001 PMC5617351 Kopinke D, Roberson EC, Reiter JF (2017) Ciliary hedgehog signaling restricts injury-induced adipogenesis. Cell 170:340–351.e312 28709001 10.1016/j.cell.2017.06.035 PMC5617351 Krueger KC Costa MJ Du H Feldman BJ Characterization of Cre recombinase activity for in vivo targeting of adipocyte precursor cells Stem Cell Rep 2014 3 1147 1158 10.1016/j.stemcr.2014.10.009 PMC4264060 25458893 Krueger KC, Costa MJ, Du H, Feldman BJ (2014) Characterization of Cre recombinase activity for in vivo targeting of adipocyte precursor cells. Stem Cell Rep 3:1147–1158 10.1016/j.stemcr.2014.10.009 PMC4264060 25458893 Liao Y Smyth GK Shi W featureCounts: an efficient general purpose program for assigning sequence reads to genomic features Bioinformatics 2014 30 923 930 10.1093/bioinformatics/btt656 24227677 Liao Y, Smyth GK, Shi W (2014) featureCounts: an efficient general purpose program for assigning sequence reads to genomic features. Bioinformatics 30:923–930 24227677 10.1093/bioinformatics/btt656 Kwon G, Wiedemann A, Steinheuer LM, Stefanski AL, Szelinski F, Racek T, Frei AP, Hatje K, Kam-Thong T, Schubert D et al (2023) Transcriptional profiling upon T cell stimulation reveals down-regulation of inflammatory pathways in T and B cells in SLE versus Sjogren’s syndrome. NPJ Syst Biol Appl 9:62 10.1038/s41540-023-00319-z PMC10724199 38102122 Love MI Huber W Anders S Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol 2014 15 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 Love MI, Huber W, Anders S (2014) Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2. Genome Biol 15:550 25516281 10.1186/s13059-014-0550-8 PMC4302049 Macosko EZ, Basu A, Satija R, Nemesh J, Shekhar K, Goldman M, Tirosh I, Bialas AR, Kamitaki N, Martersteck EM et al (2015) Highly parallel genome-wide expression profiling of individual cells using nanoliter droplets. Cell 161:1202–1214 10.1016/j.cell.2015.05.002 PMC4481139 26000488 Marcelin G Ferreira A Liu Y Atlan M Aron-Wisnewsky J Pelloux V Botbol Y Ambrosini M Fradet M Rouault C A PDGFRalpha-mediatedswitch toward CD9(high) adipocyte progenitors controls obesity-induced adipose tissue fibrosis Cell Metab 2017 25 673 685 10.1016/j.cmet.2017.01.010 28215843 Marcelin G, Ferreira A, Liu Y, Atlan M, Aron-Wisnewsky J, Pelloux V, Botbol Y, Ambrosini M, Fradet M, Rouault C et al (2017) A PDGFRalpha-mediatedswitch toward CD9(high) adipocyte progenitors controls obesity-induced adipose tissue fibrosis. Cell Metab 25:673–685 28215843 10.1016/j.cmet.2017.01.010 Marion V Mockel A De Melo C Obringer C Claussmann A Simon A Messaddeq N Durand M Dupuis L Loeffler JP BBS-induced ciliary defect enhances adipogenesis, causing paradoxical higher-insulin sensitivity, glucose usage, and decreased inflammatory response Cell Metab 2012 16 363 377 10.1016/j.cmet.2012.08.005 22958920 Marion V, Mockel A, De Melo C, Obringer C, Claussmann A, Simon A, Messaddeq N, Durand M, Dupuis L, Loeffler JP et al (2012) BBS-induced ciliary defect enhances adipogenesis, causing paradoxical higher-insulin sensitivity, glucose usage, and decreased inflammatory response. Cell Metab 16:363–377 22958920 10.1016/j.cmet.2012.08.005 Massier L Jalkanen J Elmastas M Zhong J Wang T Nono Nankam PA Frendo-Cumbo S Backdahl J Subramanian N Sekine T An integrated single cell and spatial transcriptomic map of human white adipose tissue Nat Commun 2023 14 1438 10.1038/s41467-023-36983-2 36922516 PMC10017705 Massier L, Jalkanen J, Elmastas M, Zhong J, Wang T, Nono Nankam PA, Frendo-Cumbo S, Backdahl J, Subramanian N, Sekine T et al (2023) An integrated single cell and spatial transcriptomic map of human white adipose tissue. Nat Commun 14:1438 36922516 10.1038/s41467-023-36983-2 PMC10017705 Meiss F Andrlova H Zeiser R Vismodegib Recent Results Cancer Res 2018 211 125 139 10.1007/978-3-319-91442-8_9 30069764 Meiss F, Andrlova H, Zeiser R (2018) Vismodegib. Recent Results Cancer Res 211:125–139 30069764 10.1007/978-3-319-91442-8_9 Merrick D Sakers A Irgebay Z Okada C Calvert C Morley MP Percec I Seale P Identification of a mesenchymal progenitor cell hierarchy in adipose tissue Science 2019 364 eaav2501 10.1126/science.aav2501 31023895 PMC6816238 Merrick D, Sakers A, Irgebay Z, Okada C, Calvert C, Morley MP, Percec I, Seale P (2019) Identification of a mesenchymal progenitor cell hierarchy in adipose tissue. Science 364:eaav2501 31023895 10.1126/science.aav2501 PMC6816238 Mill P Christensen ST Pedersen LB Primary cilia as dynamic and diverse signalling hubs in development and disease Nat Rev Genet 2023 24 421 441 10.1038/s41576-023-00587-9 37072495 PMC7615029 Mill P, Christensen ST, Pedersen LB (2023) Primary cilia as dynamic and diverse signalling hubs in development and disease. Nat Rev Genet 24:421–441 37072495 10.1038/s41576-023-00587-9 PMC7615029 Mukhopadhyay S Wen X Ratti N Loktev A Rangell L Scales SJ Jackson PK The ciliary G-protein-coupled receptor Gpr161 negatively regulates the Sonic hedgehog pathway via cAMP signaling Cell 2013 152 210 223 10.1016/j.cell.2012.12.026 23332756 Mukhopadhyay S, Wen X, Ratti N, Loktev A, Rangell L, Scales SJ, Jackson PK (2013) The ciliary G-protein-coupled receptor Gpr161 negatively regulates the Sonic hedgehog pathway via cAMP signaling. Cell 152:210–223 23332756 10.1016/j.cell.2012.12.026 Nachury MV The molecular machines that traffic signaling receptors into and out of cilia Curr Opin Cell Biol 2018 51 124 131 10.1016/j.ceb.2018.03.004 29579578 PMC5949257 Nachury MV (2018) The molecular machines that traffic signaling receptors into and out of cilia. Curr Opin Cell Biol 51:124–131 29579578 10.1016/j.ceb.2018.03.004 PMC5949257 Nahmgoong H Jeon YG Park ES Choi YH Han SM Park J Ji Y Sohn JH Han JS Kim YY Distinct properties of adipose stem cell subpopulations determine fat depot-specific characteristics Cell Metab 2022 34 458 472.e456 10.1016/j.cmet.2021.11.014 35021043 Nahmgoong H, Jeon YG, Park ES, Choi YH, Han SM, Park J, Ji Y, Sohn JH, Han JS, Kim YY et al (2022) Distinct properties of adipose stem cell subpopulations determine fat depot-specific characteristics. Cell Metab 34:458–472.e456 35021043 10.1016/j.cmet.2021.11.014 Nguyen HP Lin F Yi D Xie Y Dinh J Xue P Sul HS Aging-dependent regulatory cells emerge in subcutaneous fat to inhibit adipogenesis Dev Cell 2021 56 1437 1451.e1433 10.1016/j.devcel.2021.03.026 33878347 PMC8137669 Nguyen HP, Lin F, Yi D, Xie Y, Dinh J, Xue P, Sul HS (2021) Aging-dependent regulatory cells emerge in subcutaneous fat to inhibit adipogenesis. Dev Cell 56:1437–1451.e1433 33878347 10.1016/j.devcel.2021.03.026 PMC8137669 Norris AM Appu AB Johnson CD Zhou LY McKellar DW Renault MA Hammers D Cosgrove BD Kopinke D Hedgehog signaling via its ligand DHH acts as cell fate determinant during skeletal muscle regeneration Nat Commun 2023 14 3766 10.1038/s41467-023-39506-1 37355632 PMC10290686 Norris AM, Appu AB, Johnson CD, Zhou LY, McKellar DW, Renault MA, Hammers D, Cosgrove BD, Kopinke D (2023) Hedgehog signaling via its ligand DHH acts as cell fate determinant during skeletal muscle regeneration. Nat Commun 14:3766 37355632 10.1038/s41467-023-39506-1 PMC10290686 Park K Leroux MR Composition, organization and mechanisms of the transition zone, a gate for the cilium EMBO Rep 2022 23 e55420 10.15252/embr.202255420 36408840 PMC9724682 Park K, Leroux MR (2022) Composition, organization and mechanisms of the transition zone, a gate for the cilium. EMBO Rep 23:e55420 36408840 10.15252/embr.202255420 PMC9724682 Philips GM Chan IS Swiderska M Schroder VT Guy C Karaca GF Moylan C Venkatraman T Feuerlein S Syn WK Hedgehog signaling antagonist promotes regression of both liver fibrosis and hepatocellular carcinoma in a murine model of primary liver cancer PLoS ONE 2011 6 e23943 10.1371/journal.pone.0023943 21912653 PMC3166282 Philips GM, Chan IS, Swiderska M, Schroder VT, Guy C, Karaca GF, Moylan C, Venkatraman T, Feuerlein S, Syn WK et al (2011) Hedgehog signaling antagonist promotes regression of both liver fibrosis and hepatocellular carcinoma in a murine model of primary liver cancer. PLoS ONE 6:e23943 21912653 10.1371/journal.pone.0023943 PMC3166282 Picelli S Faridani OR Bjorklund AK Winberg G Sagasser S Sandberg R Full-length RNA-seq from single cells using Smart-seq2 Nat Protoc 2014 9 171 181 10.1038/nprot.2014.006 24385147 Picelli S, Faridani OR, Bjorklund AK, Winberg G, Sagasser S, Sandberg R (2014) Full-length RNA-seq from single cells using Smart-seq2. Nat Protoc 9:171–181 24385147 10.1038/nprot.2014.006 Picon-Galindo E Latz E Wachten D Primary cilia and their effects on immune cell functions and metabolism: a model Trends Immunol 2022 43 366 378 10.1016/j.it.2022.03.001 35361534 Picon-Galindo E, Latz E, Wachten D (2022) Primary cilia and their effects on immune cell functions and metabolism: a model. Trends Immunol 43:366–378 35361534 10.1016/j.it.2022.03.001 Pratap A Singh S Mundra V Yang N Panakanti R Eason JD Mahato RI Attenuation of early liver fibrosis by pharmacological inhibition of smoothened receptor signaling J Drug Target 2012 20 770 782 10.3109/1061186X.2012.719900 22994359 Pratap A, Singh S, Mundra V, Yang N, Panakanti R, Eason JD, Mahato RI (2012) Attenuation of early liver fibrosis by pharmacological inhibition of smoothened receptor signaling. J Drug Target 20:770–782 22994359 10.3109/1061186X.2012.719900 R Core Team RFfSC (2019) R: A Language and Environment for Statistical Computing. Vienna, Austria Rahmouni K Fath MA Seo S Thedens DR Berry CJ Weiss R Nishimura DY Sheffield VC Leptin resistance contributes to obesity and hypertension in mouse models of Bardet-Biedl syndrome J Clin Invest 2008 118 1458 1467 10.1172/JCI32357 18317593 PMC2262028 Rahmouni K, Fath MA, Seo S, Thedens DR, Berry CJ, Weiss R, Nishimura DY, Sheffield VC (2008) Leptin resistance contributes to obesity and hypertension in mouse models of Bardet-Biedl syndrome. J Clin Invest 118:1458–1467 18317593 10.1172/JCI32357 PMC2262028 Rodriguez CI Buchholz F Galloway J Sequerra R Kasper J Ayala R Stewart AF Dymecki SM High-efficiency deleter mice show that FLPe is an alternative to Cre-loxP Nat Genet 2000 25 139 140 10.1038/75973 10835623 Rodriguez CI, Buchholz F, Galloway J, Sequerra R, Kasper J, Ayala R, Stewart AF, Dymecki SM (2000) High-efficiency deleter mice show that FLPe is an alternative to Cre-loxP. Nat Genet 25:139–140 10835623 10.1038/75973 Rosen ED MacDougald OA Adipocyte differentiation from the inside out Nat Rev Mol Cell Biol 2006 7 885 896 10.1038/nrm2066 17139329 Rosen ED, MacDougald OA (2006) Adipocyte differentiation from the inside out. Nat Rev Mol Cell Biol 7:885–896 17139329 10.1038/nrm2066 Sarvari AK Van Hauwaert EL Markussen LK Gammelmark E Marcher AB Ebbesen MF Nielsen R Brewer JR Madsen JGS Mandrup S Plasticity of epididymal adipose tissue in response to diet-induced obesity at single-nucleus resolution Cell Metab 2021 33 437 453.e435 10.1016/j.cmet.2020.12.004 33378646 Sarvari AK, Van Hauwaert EL, Markussen LK, Gammelmark E, Marcher AB, Ebbesen MF, Nielsen R, Brewer JR, Madsen JGS, Mandrup S (2021) Plasticity of epididymal adipose tissue in response to diet-induced obesity at single-nucleus resolution. Cell Metab 33:437–453.e435 33378646 10.1016/j.cmet.2020.12.004 Scamfer SR Lee MD Hilgendorf KI Ciliary control of adipocyte progenitor cell fate regulates energy storage Front Cell Dev Biol 2022 10 1083372 10.3389/fcell.2022.1083372 36561368 PMC9763467 Scamfer SR, Lee MD, Hilgendorf KI (2022) Ciliary control of adipocyte progenitor cell fate regulates energy storage. Front Cell Dev Biol 10:1083372 36561368 10.3389/fcell.2022.1083372 PMC9763467 Schwalie PC Dong H Zachara M Russeil J Alpern D Akchiche N Caprara C Sun W Schlaudraff KU Soldati G A stromal cell population that inhibits adipogenesis in mammalian fat depots Nature 2018 559 103 108 10.1038/s41586-018-0226-8 29925944 Schwalie PC, Dong H, Zachara M, Russeil J, Alpern D, Akchiche N, Caprara C, Sun W, Schlaudraff KU, Soldati G et al (2018) A stromal cell population that inhibits adipogenesis in mammalian fat depots. Nature 559:103–108 29925944 10.1038/s41586-018-0226-8 Scott CA Marsden AN Rebagliati MR Zhang Q Chamling X Searby CC Baye LM Sheffield VC Slusarski DC Nuclear/cytoplasmic transport defects in BBS6 underlie congenital heart disease through perturbation of a chromatin remodeling protein PLoS Genet 2017 13 e1006936 10.1371/journal.pgen.1006936 28753627 PMC5550010 Scott CA, Marsden AN, Rebagliati MR, Zhang Q, Chamling X, Searby CC, Baye LM, Sheffield VC, Slusarski DC (2017) Nuclear/cytoplasmic transport defects in BBS6 underlie congenital heart disease through perturbation of a chromatin remodeling protein. PLoS Genet 13:e1006936 28753627 10.1371/journal.pgen.1006936 PMC5550010 Seo S Zhang Q Bugge K Breslow DK Searby CC Nachury MV Sheffield VC A novel protein LZTFL1 regulates ciliary trafficking of the BBSome and Smoothened PLoS Genet 2011 7 e1002358 10.1371/journal.pgen.1002358 22072986 PMC3207910 Seo S, Zhang Q, Bugge K, Breslow DK, Searby CC, Nachury MV, Sheffield VC (2011) A novel protein LZTFL1 regulates ciliary trafficking of the BBSome and Smoothened. PLoS Genet 7:e1002358 22072986 10.1371/journal.pgen.1002358 PMC3207910 Sieckmann K Winnerling N Huebecker M Leyendecker P Juliana Silva Ribeiro D Gnad T Pfeifer A Wachten D Hansen JN AdipoQ-a simple, open-source software to quantify adipocyte morphology and function in tissues and in vitro Mol Biol Cell 2022 33 br22 10.1091/mbc.E21-11-0592 35947507 PMC9635306 Sieckmann K, Winnerling N, Huebecker M, Leyendecker P, Juliana Silva Ribeiro D, Gnad T, Pfeifer A, Wachten D, Hansen JN (2022) AdipoQ-a simple, open-source software to quantify adipocyte morphology and function in tissues and in vitro. Mol Biol Cell 33:br22 35947507 10.1091/mbc.E21-11-0592 PMC9635306 Spandl J White DJ Peychl J Thiele C Live cell multicolor imaging of lipid droplets with a new dye, LD540 Traffic 2009 10 1579 1584 10.1111/j.1600-0854.2009.00980.x 19765264 Spandl J, White DJ, Peychl J, Thiele C (2009) Live cell multicolor imaging of lipid droplets with a new dye, LD540. Traffic 10:1579–1584 19765264 10.1111/j.1600-0854.2009.00980.x Subramanian A Tamayo P Mootha VK Mukherjee S Ebert BL Gillette MA Paulovich A Pomeroy SL Golub TR Lander ES Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles Proc Natl Acad Sci USA 2005 102 15545 15550 10.1073/pnas.0506580102 16199517 PMC1239896 Subramanian A, Tamayo P, Mootha VK, Mukherjee S, Ebert BL, Gillette MA, Paulovich A, Pomeroy SL, Golub TR, Lander ES et al (2005) Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles. Proc Natl Acad Sci USA 102:15545–15550 16199517 10.1073/pnas.0506580102 PMC1239896 Sun K Li X Scherer PE Extracellular matrix (ECM) and fibrosis in adipose tissue: overview and perspectives Compr Physiol 2023 13 4387 4407 10.1002/j.2040-4603.2023.tb00254.x 36715281 PMC9957663 Sun K, Li X, Scherer PE (2023) Extracellular matrix (ECM) and fibrosis in adipose tissue: overview and perspectives. Compr Physiol 13:4387–4407 36715281 10.1002/cphy.c220020 PMC9957663 Tadenev AL Kulaga HM May-Simera HL Kelley MW Katsanis N Reed RR Loss of Bardet-Biedl syndrome protein-8 (BBS8) perturbs olfactory function, protein localization, and axon targeting Proc Natl Acad Sci USA 2011 108 10320 10325 10.1073/pnas.1016531108 21646512 PMC3121838 Tadenev AL, Kulaga HM, May-Simera HL, Kelley MW, Katsanis N, Reed RR (2011) Loss of Bardet-Biedl syndrome protein-8 (BBS8) perturbs olfactory function, protein localization, and axon targeting. Proc Natl Acad Sci USA 108:10320–10325 21646512 10.1073/pnas.1016531108 PMC3121838 Tang W Zeve D Suh JM Bosnakovski D Kyba M Hammer RE Tallquist MD Graff JM White fat progenitor cells reside in the adipose vasculature Science 2008 322 583 586 10.1126/science.1156232 18801968 PMC2597101 Tang W, Zeve D, Suh JM, Bosnakovski D, Kyba M, Hammer RE, Tallquist MD, Graff JM (2008) White fat progenitor cells reside in the adipose vasculature. Science 322:583–586 18801968 10.1126/science.1156232 PMC2597101 Todaro GJ Green H Quantitative studies of the growth of mouse embryo cells in culture and their development into established lines J Cell Biol 1963 17 299 313 10.1083/jcb.17.2.299 13985244 PMC2106200 Todaro GJ, Green H (1963) Quantitative studies of the growth of mouse embryo cells in culture and their development into established lines. J Cell Biol 17:299–313 13985244 10.1083/jcb.17.2.299 PMC2106200 Toyoda S Shin J Fukuhara A Otsuki M Shimomura I Transforming growth factor beta1 signaling links extracellular matrix remodeling to intracellular lipogenesis upon physiological feeding events J Biol Chem 2022 298 101748 10.1016/j.jbc.2022.101748 35189145 PMC8931428 Toyoda S, Shin J, Fukuhara A, Otsuki M, Shimomura I (2022) Transforming growth factor beta1 signaling links extracellular matrix remodeling to intracellular lipogenesis upon physiological feeding events. J Biol Chem 298:101748 35189145 10.1016/j.jbc.2022.101748 PMC8931428 Vegiopoulos A Rohm M Herzig S Adipose tissue: between the extremes EMBO J 2017 36 1999 2017 10.15252/embj.201696206 28623240 PMC5509999 Vegiopoulos A, Rohm M, Herzig S (2017) Adipose tissue: between the extremes. EMBO J 36:1999–2017 28623240 10.15252/embj.201696206 PMC5509999 Vijay J Gauthier MF Biswell RL Louiselle DA Johnston JJ Cheung WA Belden B Pramatarova A Biertho L Gibson M Single-cell analysis of human adipose tissue identifies depot and disease specific cell types Nat Metab 2020 2 97 109 10.1038/s42255-019-0152-6 32066997 PMC7025882 Vijay J, Gauthier MF, Biswell RL, Louiselle DA, Johnston JJ, Cheung WA, Belden B, Pramatarova A, Biertho L, Gibson M et al (2020) Single-cell analysis of human adipose tissue identifies depot and disease specific cell types. Nat Metab 2:97–109 32066997 10.1038/s42255-019-0152-6 PMC7025882 Wachten D Mick DU Signal transduction in primary cilia - analyzing and manipulating GPCR and second messenger signaling Pharmacol Ther 2021 224 107836 10.1016/j.pharmthera.2021.107836 33744260 Wachten D, Mick DU (2021) Signal transduction in primary cilia - analyzing and manipulating GPCR and second messenger signaling. Pharmacol Ther 224:107836 33744260 10.1016/j.pharmthera.2021.107836 Watt FM Huck WT Role of the extracellular matrix in regulating stem cell fate Nat Rev Mol Cell Biol 2013 14 467 473 10.1038/nrm3620 23839578 Watt FM, Huck WT (2013) Role of the extracellular matrix in regulating stem cell fate. Nat Rev Mol Cell Biol 14:467–473 23839578 10.1038/nrm3620 White U Adipose tissue expansion in obesity, health, and disease Front Cell Dev Biol 2023 11 1188844 10.3389/fcell.2023.1188844 37181756 PMC10169629 White U (2023) Adipose tissue expansion in obesity, health, and disease. Front Cell Dev Biol 11:1188844 37181756 10.3389/fcell.2023.1188844 PMC10169629 Wickham H (2016) Ggplot2: Elegant graphics for data analysis. Springer International Publishing Wingfield JL Lechtreck KF Lorentzen E Trafficking of ciliary membrane proteins by the intraflagellar transport/BBSome machinery Essays Biochem 2018 62 753 763 10.1042/EBC20180030 30287585 PMC6737936 Wingfield JL, Lechtreck KF, Lorentzen E (2018) Trafficking of ciliary membrane proteins by the intraflagellar transport/BBSome machinery. Essays Biochem 62:753–763 30287585 10.1042/EBC20180030 PMC6737936 Wu T Hu E Xu S Chen M Guo P Dai Z Feng T Zhou L Tang W Zhan L clusterProfiler 4.0: a universal enrichment tool for interpreting omics data Innovation (Camb) 2021 2 100141 34557778 10.1016/j.xinn.2021.100141 PMC8454663 Wu T, Hu E, Xu S, Chen M, Guo P, Dai Z, Feng T, Zhou L, Tang W, Zhan L et al (2021) clusterProfiler 4.0: a universal enrichment tool for interpreting omics data. Innovation (Camb) 2:100141 34557778 10.1016/j.xinn.2021.100141 PMC8454663 Wunderling K Zurkovic J Zink F Kuerschner L Thiele C Triglyceride cycling enables modification of stored fatty acids Nat Metab 2023 5 699 709 10.1038/s42255-023-00769-z 37012495 PMC10132980 Wunderling K, Zurkovic J, Zink F, Kuerschner L, Thiele C (2023) Triglyceride cycling enables modification of stored fatty acids. Nat Metab 5:699–709 37012495 10.1038/s42255-023-00769-z PMC10132980 Yanardag S Pugacheva EN Primary cilium is involved in stem cell differentiation and renewal through the regulation of multiple signaling pathways Cells 2021 10 1428 10.3390/cells10061428 34201019 PMC8226522 Yanardag S, Pugacheva EN (2021) Primary cilium is involved in stem cell differentiation and renewal through the regulation of multiple signaling pathways. Cells 10:1428 34201019 10.3390/cells10061428 PMC8226522 Ye J Gao C Liang Y Hou Z Shi Y Wang Y Characteristic and fate determination of adipose precursors during adipose tissue remodeling Cell Regen 2023 12 13 10.1186/s13619-023-00157-8 37138165 PMC10156890 Ye J, Gao C, Liang Y, Hou Z, Shi Y, Wang Y (2023) Characteristic and fate determination of adipose precursors during adipose tissue remodeling. Cell Regen 12:13 37138165 10.1186/s13619-023-00157-8 PMC10156890 Young MD Wakefield MJ Smyth GK Oshlack A Gene ontology analysis for RNA-seq: accounting for selection bias Genome Biol 2010 11 R14 10.1186/gb-2010-11-2-r14 20132535 PMC2872874 Young MD, Wakefield MJ, Smyth GK, Oshlack A (2010) Gene ontology analysis for RNA-seq: accounting for selection bias. Genome Biol 11:R14 20132535 10.1186/gb-2010-11-2-r14 PMC2872874 Zhang Q Nishimura D Vogel T Shao J Swiderski R Yin T Searby C Carter CS Kim G Bugge K BBS7 is required for BBSome formation and its absence in mice results in Bardet-Biedl syndrome phenotypes and selective abnormalities in membrane protein trafficking J Cell Sci 2013 126 2372 2380 23572516 10.1242/jcs.111740 PMC3679484 Zhang Q, Nishimura D, Vogel T, Shao J, Swiderski R, Yin T, Searby C, Carter CS, Kim G, Bugge K et al (2013) BBS7 is required for BBSome formation and its absence in mice results in Bardet-Biedl syndrome phenotypes and selective abnormalities in membrane protein trafficking. J Cell Sci 126:2372–2380 23572516 10.1242/jcs.111740 PMC3679484 ",
  "metadata": {
    "Title of this paper": "BBS7 is required for BBSome formation and its absence in mice results in Bardet-Biedl syndrome phenotypes and selective abnormalities in membrane protein trafficking",
    "Journal it was published in:": "The EMBO Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489102/"
  }
}