{
  "title": "Paper_1168",
  "abstract": "pmc Drug Des Devel Ther Drug Des Devel Ther 958 dddt dddt Drug Design, Development and Therapy 1177-8881 Dove Press PMC12474739 PMC12474739.1 12474739 12474739 41017806 10.2147/DDDT.S531720 531720 1 Original Research Integrative Metabolomics and Ionomics Identify Organ-Specific Responses Associated with Cisplatin Treatment in Mice Sun et al Sun et al Sun Rong  1 * Xiao Qin  2 * Long Houlong  1 Dang Ruili  3  4 Zhao Shiyuan  3  4 http://orcid.org/0000-0001-6565-8880 Guo Jinxiu  3  4 Chu Xue  3  4 Sun Haosen  5 Zhang Yazhou  6 Jiang Pei  3  4 1 Department of Thyroid and Breast Surgery, Tengzhou Central People’s Hospital, Xuzhou Medical University Tengzhou 277500 People’s Republic of China 2 Department of Burn and Wound Repair Surgery, Tengzhou Central People’s Hospital, Xuzhou Medical University Tengzhou 277500 People’s Republic of China 3 Institute of Translational Pharmacy, Jining Medical Research Academy Jining 272000 People’s Republic of China 4 Translational Pharmaceutical Laboratory, Jining First People’s Hospital, Shandong First Medical University Jining 272000 People’s Republic of China 5 Financial Management, Grade 2023, Panhe Campus, Shandong Agricultural University Taian 271000 People’s Republic of China 6 Department of Foot and Ankle Surgery, Tengzhou Central People’s Hospital,Xuzhou Medical University Tengzhou 277500 People’s Republic of China Correspondence: Yazhou Zhang, Department of Foot and Ankle Surgery, Tengzhou Central People’s Hospital, Xuzhou Medical University Tengzhou 277500 People’s Republic of China Pei Jiang, Translational Pharmaceutical Laboratory, Jining First People’s Hospital, Shandong First Medical University Jining 272000 People’s Republic of China * These authors contributed equally to this work 22 9 2025 2025 19 478870 8613 8639 22 4 2025 10 9 2025 22 09 2025 28 09 2025 29 09 2025 © 2025 Sun et al. 2025 Sun et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Background Cisplatin is a widely used chemotherapeutic agent effective against various malignant tumors. However, its clinical application is limited by severe toxic side effects on multiple vital organs. Understanding the systemic metabolic and elemental alterations associated with cisplatin is essential for developing strategies to mitigate its toxicity. Methods An integrative metabolomics and ionomics approach was employed to investigate organ-specific responses to cisplatin treatment in mice. Gas chromatography-mass spectrometry (GC-MS) and inductively coupled plasma-mass spectrometry (ICP-MS) were used to analyze metabolic and elemental changes in multiple organs, including the heart, liver, spleen, lungs, kidneys, cortex, hippocampus, brown adipose tissue, and blood. Histopathological evaluation was also performed to complement biochemical analyses. Results Multivariate statistical analysis indicated that cisplatin was accompanied by significant changes in the levels of several key metabolites, including amino acids, fatty acids, and tricarboxylic acid cycle intermediates. A total of 9 metabolic pathways were implicated, particularly those involved in amino acid biosynthesis, energy metabolism, and redox regulation. In parallel, notable variations in metal ion concentrations, such as Ag, Na, Ca, Zn, Cu, Mg and Fe, were observed across organs. These changes may be linked to alterations in enzyme activity and antioxidant functions. Conclusion This study provides a comprehensive overview of metabolic and elemental disturbances in vital organs correlated with cisplatin exposure. The findings suggest that modulation of specific metabolites and trace elements may help reduce cisplatin toxicity. The integrative omics approach offers novel insights into the pathways potentially underlying chemotherapy-induced side effects and highlights possible therapeutic targets. Graphical Abstract  Keywords metabolomics ionomics cisplatin organ toxicity This study was supported by the National Natural Science Foundation of China (No. 82373585), the Natural Science Foundation of Shandong Province (No. ZR2022MH007), and the Development Fund Project of the Affiliated Hospital of Xuzhou Medical University (No. XYFY202417). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Cisplatin (CDDP) is an effective platinum-based chemotherapy drug used to treat a variety of solid tumors, 1 2 3 4 5 To comprehensively dissect the complex pathophysiological mechanisms of CDDP toxicity across organs, integrative metabolomics and ionomics analysis can provide a more comprehensive understanding. Metabolomics, by profiling endogenous small molecules, reveals dysregulated metabolic pathways reflecting physiological and pathological states, 6 7 8 9 10 11 12 In this study, we employed gas chromatography–mass spectrometry (GC–MS) and inductively coupled plasma mass spectrometry (ICP–MS) to analyze metabolic and elemental alterations in multiple organs of cisplatin-treated mice. By integrating statistical analyses and correlation networks, we systematically investigated the organ-specific response to CDDP and the potential interplay between metabolites and ions. Our findings provide novel insights into the mechanisms of cisplatin-induced multi-organ toxicity and offer a basis for future studies aimed at toxicity mitigation. Materials and Methods Chemicals and Reagents Cisplatin was obtained from Shanghai Yuanye Biotechnology Co., Ltd., and 0.9% sodium chloride injection was procured from Shandong Qidu Pharmaceutical Co., Ltd. Heptadecanoic acid, N, O-bis (trimethylsilyl) trifluoroacetamide (BSTFA + 1% TMCS), and multi-element calibration standards (with each element concentration of 100 mg/L) were purchased from Merck. 65% nitric acid (trace analysis grade) was sourced from Thermo Fisher Scientific, and was primarily used for sample digestion and pretreatment to ensure the accuracy and sensitivity of the analysis. Methanol and pyridine (chromatographic grade) were obtained from Shanghai MacLean Biochemical Co., Ltd., and are commonly used in gas and liquid chromatography analyses to provide high-purity solvents that prevent interference. o-Methylhydroxylamine hydrochloride was obtained from Beijing J&K Science Co., Ltd. and used as a derivatization reagent to enhance the detection sensitivity of ketones and aldehydes in the sample. Ultrapure water from Hangzhou Wahaha Company was used for all chemical reagents and sample preparation to ensure the reliability and repeatability of the experimental results. Animals Treatment Male C57BL/6J mice, 8 weeks old, weighing 20–25 g, were obtained from Jinan Pengyue Experimental Animal Breeding Co., Ltd. Prior to the experiment, the mice were acclimated for one week to adapt to the experimental environment. Fourteen mice were randomly assigned to two groups: a control group (n=7) and a cisplatin-treated group (n = 7). Each mouse was considered an independent biological replicate. All subsequent analyses, including metabolomics, ionomics, and histopathological assessments, were independently conducted on samples from each individual mouse. No technical replicates were pooled. The sample size was determined based on prior studies and practical feasibility, aiming to ensure sufficient statistical power while minimizing animal use. Unless otherwise specified, all experiments were performed using independent biological replicates (n = 7 per group). The cisplatin-treated group received intraperitoneal injections of cisplatin (2 mg/kg/day), while the control group received equivalent volumes (0.2 mL) of 0.9% saline. The experiment lasted for two weeks, during which the weight and overall health of the mice were monitored regularly to evaluate the drug’s effects on their physiological state. The cisplatin dose and treatment duration were selected based on previous studies and relevant academic literature to ensure the scientific validity and rationale of the experimental design. 13 https://arriveguidelines.org Sample Collection and Preparation At the conclusion of the study, all mice were anesthetized with sodium pentobarbital to induce unconsciousness. Subsequently, blood was collected from the portal vein, and the mice were sacrificed by cervical dislocation while unconscious. Serum was then obtained by centrifugation. Dissection was performed in a low-temperature environment to ensure the rapid collection of organs, including the heart, liver, spleen, lungs, kidneys, cerebral cortex, hippocampus, and brown adipose tissue. The collected tissue samples were immediately washed in phosphate-buffered saline (PBS) to remove blood residues, rapidly frozen in liquid nitrogen, and stored at −80°C for subsequent analysis. Hematoxylin and Eosin (H&E) Staining Tissue samples were fixed in 4% paraformaldehyde for 24 hours to ensure adequate fixation, followed by dehydration and paraffin embedding with a section thickness of 5 µm. The sections were deparaffinized in xylene to remove residual paraffin. Subsequently, the sections were rehydrated using graded ethanol solutions (100%, 95%, 70%). The sections were then stained with hematoxylin for 5–10 minutes, rinsed, and differentiated with 0.5% hydrochloric acid ethanol to enhance contrast. Following this, the sections were stained with eosin for 2–5 minutes and rinsed. Finally, the sections were dehydrated in 70% ethanol, cleared in xylene, and sealed using neutral resin. The prepared sections were observed under an optical microscope to evaluate changes in tissue morphology and cellular structure. Metabolomics and GC-MS Analysis Serum samples (100μL) were mixed with 50μL of 100μg/mL heptadecanoic acid (internal standard) in methanol, vortexed, and centrifuged at 3000 rpm for 10 min at 4°C. The supernatant was evaporated under nitrogen at 37°C. Derivatization was carried out by adding 80μL of methoxyamine hydrochloride in pyridine and incubating at 70°C for 1.5 h, followed by 100μL of BSTFA with 1% TMCS for an additional 1 h. After centrifugation, the supernatant was filtered through a 0.45μm membrane. Tissue samples (~50 mg) were homogenized in methanol, spiked with the same internal standard, and processed similarly. QC samples were prepared by pooling equal aliquots from all samples. GC-MS analysis was conducted using an Agilent 7890B GC coupled to a 7000C triple quadrupole MS and an HP-5MS column. The oven temperature program started at 60°C (held for 4 min), increased to 300°C at 8°C/min, and was held for 5 min. The injection volume was 1μL, with helium as the carrier gas at 1 mL/min. The inlet, transfer line, and ion source were set at 280°C, 250°C, and 230°C, respectively. Electron ionization (70 eV) was used, and full scan data were acquired over m/z 50–800. QC samples were analyzed every five runs to ensure data quality and instrument stability. Ionomics and ICP-MS Analysis Serum (50 μL) or tissue (50 mg) samples were digested with 1 mL of 65% nitric acid at 130 °C for 2 h. All containers were pre-cleaned by soaking in 6 M nitric acid overnight, rinsed with ultrapure water, and air-dried. After cooling, the digested solutions were neutralized and diluted with ultrapure water to the required volume. Elemental analysis was performed using a NexION 1000G ICP–MS (PerkinElmer, USA) equipped with a helium collision cell. Instrumental optimization was conducted prior to measurement. Scandium, germanium, indium, and rhenium (20 μg/L) were used as internal standards and introduced online via a peristaltic pump. Instrument settings included a nebulizer flow rate of 1.04 L/min, auxiliary gas flow of 1.20 L/min, plasma gas flow of 15 L/min, RF power of 1600 W, analog voltage of –1862 V, and pulse voltage of 1250 V. A total of 35 elements were initially targeted, including Li, Be, B, Na, Mg, Al, Si, P, K, Ca, Ti, V, Cr, Mn, Fe, Co, Ni, Cu, Zn, As, Se, Sr, Zr, Mo, Ag, Cd, Sn, Sb, Ba, Tl, Pb, Bi, Hg, Ir, and Pt. After quality filtering, 31 elements were quantified reliably: Li, Be, Na, Mg, Al, P, K, Ca, Ti, V, Cr, Mn, Fe, Co, Ni, Cu, Zn, As, Se, Sr, Zr, Mo, Ag, Sn, Cd, Sb, Ba, Tl, Pb, Bi, and Pt. Multivariate Statistical Analyses We used Agilent Unknowns and MassHunter analysis software (Agilent Technologies, California, USA) to process the acquired GC-MS data. First, chromatographic peaks were extracted from the GC-MS data, and important peaks were identified through signal-to-noise ratio filtering and deconvolution, which enhanced the accuracy of metabolite identification. The resulting mass spectral data were then cross-referenced with the NIST14.0 mass spectral library for metabolite identification. Multivariate statistical analysis was performed on the normalized peak area, corresponding to the proportion of each peak area relative to the total peak area, using SIMCA 14.0 software (Umetrics, Umea, Sweden). Prediction models were constructed using orthogonal partial least squares discriminant analysis (OPLS-DA). Additionally, a two-tailed Student’s t http://www.metaboanalyst.ca http://www.kegg.jp In the ICP-MS data analysis, the k-nearest neighbor algorithm (k-NN) based on Euclidean distance was initially employed to impute missing data. Statistical analyses were conducted using the R programming software package. Differential ions were analyzed using a t Results Clinical Parameters During the experiment, we systematically monitored both groups of mice, assessing survival status and measuring body weight every two days. Throughout the experiment, the mice in both groups showed no signs of mortality. The weight measurement results indicated no statistically significant difference between the two groups on days 1 and 4. However, on days 5, 7, 9, 11, and 13, a statistically significant difference in body weight was observed (P < 0.0001; Figure 1 Figure 1 Effect of cisplatin on body weight in mice. Mice were intraperitoneally administered cisplatin (2 mg/kg/day; n = 7) or vehicle (control; n = 7) once daily for 14 consecutive days. Body weight was recorded every 2 days throughout the experiment. Cisplatin-treated mice exhibited a significant reduction in body weight compared to the control group starting from day 5 (****P < 0.0001; Student’s t Histopathological Analysis The morphological effects of cisplatin on the organ tissues of mice were evaluated using hematoxylin-eosin (HE) staining ( Figure 2 Figure 2 Histopathological Results of Hematoxylin-Eosin (HE) Staining: Comparison of Organ Tissues Between Control and Cisplatin-Treated Mice ( A B C D E F Metabolomic Analysis GC-MS Total Ion Chromatograms of Serum and Various Organ Tissues Figure S1 Utilization of OPLS-DA for Metabolic Differentiation This study employed orthogonal partial least squares discriminant analysis (OPLS-DA) to analyze the metabolic data from the two groups, resulting in a clear separation between the sample groups and suggesting the presence of notable metabolic differences. Additionally, the minimal within-group variability supports the consistency and reliability of the experimental approach. As shown in Table 1 Figure S2 Table 1 The OPLS-DA Parameters in Target Organ Tissues Tissue R2X (cum) R2Y (cum) Q2 (cum) Heart 0.608 0.986 0.768 Liver 0.719 0.982 0.875 Spleen 0.710 0.998 0.947 Lung 0.660 0.999 0.888 Kidney 0.555 0.999 0.786 Cerebral cortex 0.730 1.000 0.767 Hippocampus 0.577 0.999 0.878 Brown fat 0.585 0.998 0.961 Serum 0.783 1.000 0.954 Tissue Metabolite Cluster Analysis Cluster analysis of tissue metabolites suggested that samples were separated into two distinct clusters based on intervention conditions (control group and cisplatin-treated group) ( Figure 3 Figure 3 Heatmap visualization of differential metabolites identified in ( A B C D E F G H I Differential Metabolites To comprehensively investigate the metabolic differences between the control and cisplatin-treated groups, detailed metabolite analysis was conducted using SIMCA 14.0 and SPSS 27.0 software. The criteria for selecting differential metabolites were VIP values greater than 1.0 and P adjusted less than 0.05. The analysis identified 58 metabolites with significant differences between the control and cisplatin-treated groups, primarily in major organ tissues such as the heart, liver, spleen, lung, kidney, cerebral cortex, hippocampus, brown fat, and serum. These metabolite changes may be associated with the effects of cisplatin treatment on metabolic pathways in mice, potentially providing insights into the molecular processes involved in cisplatin toxicity. Table 2 Table 2 List of Altered Metabolites in Heart, Liver, Spleen, Lung, Kidney, Cerebral Cortex, Hippocampus, Brown Fat, and Serum Following Cisplatin Exposure Metabolite HMDB Heart Liver Spleen Lung Kidney Cerebral Cortex Hippocampus Brown Fat Serum VIP FC VIP FC VIP FC VIP FC VIP FC VIP FC VIP FC VIP FC VIP FC Ethanolamine HMDB0000149 1.4125 0.38174 1.2348 4.7704E-06 1.9398 7.5698E-05 1.7541 0.000103925 1.4654 0.00029955 1.64292 0.0001033 1.2422 6.2631E-06 Palmitic Acid HMDB0000220 1.0997 0.53411 1.0125 5.8462E-07 1.2821 4.7872E-06 1.1293 0.000602762 1.0387 0.00037732 1.2234 0.00153349 1.3460 5.7500E-07 9H-Purin-6-ol HMDB0000157 1.2305 0.44792 1.3028 2.7836E-05 1.5953 1.5565e-005 1.0978 0.00543321 2.13781 2.8545E-05 1.1434 0.0234981 Glycerol HMDB0000131 1.1170 0.55622 1.2397 3.0333E-07 1.2902 1.8385E-05 1.0625 0.00484103 0.23015 0.568041 1.3779 0.00398536 1.0180 0.00303664 L-Threonine HMDB0000167 1.0954 0.54035 1.0842 0.00019967 1.9547 1.0699E-05 1.6339 0.000135117 1.4706 3.9459E-05 1.0510 0.0154368 Stearic acid HMDB0000827 1.3652 0.37999 1.0299 8.2932E-05 1.2597 0.000279507 1.2460 0.00353172 1.1294 1.0768E-05 L-Proline HMDB0000162 1.3629 0.41909 2.2266 1.4228E-05 1.5377 0.00359307 1.66271 3.0442E-05 1.2504 0.00164835 Uracil HMDB0000300 1.1922 0.48221 1.5099 0.00018683 1.0945 0.00237322 2.09297 4.9197E-06 1.5431 0.00090199 Myristic acid HMDB0000806 1.0531 0.52513 1.0356 1.2765E-06 1.2851 1.7277E-06 1.16377 0.00038786 1.4170 0.00050645 Serine HMDB0000187 1.0764 0.00017294 2.0928 1.3213E-06 1.7073 0.000973406 1.13703 0.00700251 1.0189 0.00427489 L-Glutamic acid HMDB0000148 1.0991 3.1844E-05 1.3377 1.3177E-06 1.0295 0.0106111 1.1793 0.00194966 1.47395 1.7255E-05 L-Lysine HMDB0000182 1.3908 0.39741 2.2452 1.8009E-05 1.50297 0.00102417 1.5052 2.6283E-05 4-Aminobutanoic acid HMDB0000112 1.2962 0.45165 1.0897 0.00057395 1.6463 0.00132302 1.3210 0.00017896 L-Leucine HMDB0000687 1.2833 0.43847 1.4491 0.000606563 1.92625 9.0913E-06 1.2242 0.00156817 L-Valine HMDB0000883 1.2650 0.43488 1.0060 0.00082610 1.8835 3.5753E-05 1.6667 9.3422E-05 1.1254 0.00516421 1.0945 0.00835194 L-Aspartic acid HMDB0000191 1.0943 0.52829 1.1846 4.3227E-06 1.0508 0.00013334 1.3204 0.00733524 1.9456 2.7537E-05 Uridine HMDB0000296 1.1084 0.00124675 1.5203 4.2347E-06 1.6270 6.8635E-06 1.39652 0.00418506 Urea HMDB0000294 1.2181 0.00018573 1.2082 0.0130699 1.1882 0.00206006 1.0112 0.00152231 L-5-Oxoproline HMDB0000267 1.4216 0.00087290 1.0866 0.00326159 1.3979 0.00051810 1.0206 0.00139827 Myo-Inositol HMDB0000211 1.3779 0.44824 1.0358 0.00999176 1.3676 5.6592E-06 1.6963 0.00040347 Cholesterol HMDB0000067 1.325 0.41653 1.1647 0.00025915 1.3402 5.7116E-07 1-Monopalmitin HMDB0011564 1.3016 0.44288 1.1738 1.8675E-06 1.2029 4.2379E-05 Phenylalanine HMDB0000159 1.1655 0.50869 1.7080 8.43382E-0 1.2407 0.00132317 Niacinamide HMDB0001406 1.1938 1.7800E-06 1.0738 0.0080055 1.5558 6.3920E-05 Tyrosine HMDB0000158 1.2444 1.8033E-05 1.1011 0.00073175 1.36331 0.00652301 Doconexent HMDB0002183 1.0016 3.4876E-05 1.2884 0.00011176 1.4195 8.7526e-005 beta.-Alanine HMDB0000056 1.1128 9.3181E-05 1.2238 0.00107926 1.80157 0.00017896 Glycine HMDB0000123 1.4581 0.000262648 1.3286 0.00280989 1.1200 0.0172852 Citric acid HMDB0000094 2.15146 2.1906E-07 1.6762 6.9689E-05 1.5999 8.8431E-06 L-Tyrosine HMDB0000158 1.4054 0.38419 1.3202 1.6422E-05 Xylitol HMDB0242149 1.3684 0.39332 1.0951 0.00050415 L-Alanine HMDB0000161 1.1702 0.48928 1.5907 0.000432417 1.59937 0.00012332 Scyllo-Inositol HMDB0006088 1.0826 0.55918 1.2373 0.00031951 2-Palmitoylglycerol HMDB0011533 1.3482 1.0112E-06 1.2433 8.6209E-06 Inosine HMDB0000195 1.1652 0.00250839 1.6181 0.00069613 Malic acid HMDB0000156 1.2138 0.00026499 1.5105 0.00065574 Phosphorylethanolamine HMDB0000224 1.626 0.00025522 1.18025 0.00483338 Arachidonic acid HMDB0001043 1.4800 0.34235 1.7192 0.00065238 1.41328 3.9564E-05 L-(+)-Lactic acid HMDB0000190 1.1768 2.7064E-05 1.8304 8.5183E-05 1.5977 3.0577E-06 L-Phenylalanine HMDB0000159 1.6839 6.5388E-05 1.1749 0.00019972 L-Isoleucine HMDB0000172 1.2800 0.00048728 1.0387 0.0132208 L-Norleucine HMDB0001645 1.4041 0.39834 N-Acetyl-L-glutamic acid HMDB0001138 1.1640 0.48020 L-Serine HMDB0000187 1.4234 4.8925E-08 DL-Phenylalanine HMDB0250791 1.1319 0.00043910 1,5-Anhydroglucitol HMDB0002712 1.2797 0.38055 D-Glucitol HMDB0000247 1.0543 4.0947E-05 D-Gluconic acid HMDB0000625 1.1029 0.00028432 Palmitelaidic acid HMDB0012328 1.0749 4.3161E-05 Taurine HMDB0000251 1.0738 0.00591307 1.8112 0.00132983 Petroselinic acid HMDB0002080 1.1153 0.00095757 Niacin HMDB0001406 1.5439 6.2962e-005 L-Methionine HMDB0000696 1.9082 6.18021e-00 Squalene HMDB0000256 1.5803 8.89141E-0 Tryptophol HMDB0003447 1.3781 0.00026286 Butanedioic acid HMDB0000254 1.3614 0.00110921 Dodecanoic acid HMDB0000638 1.2625 4.6884E-05 Glycolic acid HMDB0000115 1.5978 3.0448E-06 Abbreviations Metabolic Pathway Analysis MetaboAnalyst 6.0 was employed to perform metabolic pathway analysis of the differential metabolites between the two groups ( Figure 4 Table 3 Table 3 Metabolic Pathways Related to the Cisplatin Exposure Intervention Mechanism Pathway Name Tissue Match Status Hit P P Adjusted Impact Phenylalanine, tyrosine and tryptophan biosynthesis Heart 2/4 L-Phenylalanine; L-Tyrosine 0.0014812 0.0318458 1 Arginine biosynthesis Spleen 3/14 L-Glutamate; L-Aspartate;Urea 0.00052861 0.01638691 0.12234 Alanine, aspartate and glutamate metabolism Kidney 4/28 L-Aspartate; L-Alanine; L-Glutamate; 4-Aminobutanoate 0.00041973 0.01511028 0.50722 One carbon pool by folate 3/26 Glycine; L-Methionine; L-Serine 0.0046139 0.04112928 0.10714 Glutathione metabolism 3/28 Glycine; L-Glutamate; 5-Oxoproline 0.0057124 0.04112928 0.11548 Pantothenate and CoA biosynthesis Cerebral cortex 3/20 L-Aspartate; beta-Alanine; Uracil 0.00093595 0.01736 0.04762 Beta-Alanine metabolism 3/21 Beta-Alanine; L-Aspartate; Uracil 0.001085 0.01736 0.39925 Phenylalanine, tyrosine and tryptophan biosynthesis Hippocampus 2/4 L-Phenylalanine; L-Tyrosine 0.0010405 0.0176885 1 Pantothenate and CoA biosynthesis 3/20 L-Valine; beta-Alanine; Uracil 0.0021325 0.0241683333333333 0.04762 Alanine, aspartate and glutamate metabolism 3/28 L-Alanine; L-Glutamate; Citrate 0.0057124 0.0473189333333333 0.19712 Phenylalanine metabolism 2/10 L-Phenylalanine; L-Tyrosine 0.0074276 0.0473189333333333 0.35714 Glyoxylate and dicarboxylate metabolism 3/32 L-Serine; L-Glutamate; Citrate 0.0083504 0.0473189333333333 0.10667 Phenylalanine, tyrosine and tryptophan biosynthesis Brown fat 2/4 L-Phenylalanine; L-Tyrosine; 0.0010405 0.01820875 1 Glyoxylate and dicarboxylate metabolism Serum 3/32 (S)-Malate; Glycine; Citrate 0.0025228 0.031535 0.16333 Figure 4 Pathway analysis using MetaboAnalyst 6.0 for ( A B C D E F G H I Ionomics Analysis Methodological Validation Under the set instrument working conditions, a mixed standard solution of multiple metal elements was employed as the sample for analysis. The instrument signal response ratio relative to the internal standard signal was plotted against the mass concentration on the x-axis to generate the standard curve ( Figure S3 Table 4 Table 4 Table 4 Accuracy and Repeatability of the Measured Trace Elements Element Correlation Coefficient (r) Repeatability Cv [%] Trueness/Recovery [%] Limit of Quantification (μg/L) Li 0.9999 3.40 98.9 0.006 Na 0.9946 7.72 85.5 6.807 Mg 0.9994 5.57 99.8 0.128 Al 0.9993 5.63 97.1 0.020 P 0.9992 12.78 91.5 0.218 K 0.9995 13.51 82.8 0.893 Ca 0.9989 14.65 94.7 0.974 Ti 0.9999 4.61 83.9 0.008 V 0.9997 4.57 83.1 0.001 Cr 0.9908 4.65 85.6 0.003 Mn 0.9999 4.69 83.2 0.001 Fe 0.9988 4.27 99.2 0.099 Co 0.9998 4.41 84.7 0.001 Ni 0.9968 4.59 83.2 0.005 Cu 0.9999 4.66 91.7 0.010 Zn 0.9975 5.20 89.7 0.044 As 0.9987 4.42 82.1 0.016 Se 0.9998 5.43 82.6 0.029 Sr 0.9797 4.53 81.5 0.003 Zr 0.9980 8.51 92.0 0.002 Mo 0.9998 4.38 85.2 0.001 Ag 0.9992 4.45 87.3 0.002 Cd 0.9999 4.96 81.2 0.001 Sn 0.9979 4.84 81.7 0.001 Sb 0.9998 4.91 81.8 0.001 Ba 0.9754 4.69 81.3 0.013 Pt 0.9999 4.85 88.5 0.001 Pb 0.9985 4.56 82.1 0.001 Bi 0.9998 4.69 83.6 0.001 Tl 0.9997 4.65 83.7 0.001 Statistical Analysis The t Figure 5 Figure 5 Figure 6 Figure 7 Figure 5 T-SNE visualization of organ-specific feature vectors based on elemental composition. Figure 6 OPLS-DA score plots of ion composition across organs in control and cisplatin-treated mice. ( A B C D E F G H I Figure 7 OPLS-DA model parameters for ionomics analysis across organs. ( A B C D E F G H I As shown in Figure 8 Figure 8 Contiune. Figure 8 Elemental composition analysis across organs. ( A-I 2 2 A B C D E F G H I 2 J 2 To further explore the relationships and trends among ions, we employed the correlation coefficient (r) to quantitatively assess the relationships between elements ( Figure 9 14 Figure 10 Figure 11 Figure 9 Correlation analysis of detected ions. The numbers in the cells of the lower triangle represent the Spearman correlation coefficients (r) for the corresponding elements. In the upper triangle, red and blue dots represent positive and negative correlations, respectively. The diameter of each dot is proportional to the magnitude of the correlation coefficient. ( A B C D E F G H I Figure 10 The elemental correlation network. Nodes represent individual ions. Differentially altered elements are highlighted in red (indicating an increase) and green (indicating a decrease). Only significant ion pairs with a Spearman correlation coefficient (r > 0.7) are connected by straight lines, with the line thickness proportional to the strength of the correlation. Red lines indicate positive correlations, whereas blue lines indicate negative correlations. ( A B C D E F G H I Figure 11 Correlation analysis between metabolites and ions. The size of each circle represents the Spearman correlation coefficient (r), with red indicating positive correlations and blue indicating negative correlations. No circle is displayed when the P exceeds 0.05, indicating a lack of statistical significance. It represents statistical associations in fig, but deep biological interactions should be confirmed in further research. ( A B C D E F G H I Discussion Cisplatin is a widely used platinum-based chemotherapy drug for treating a variety of solid tumors. It inhibits cell division by forming DNA cross-links, 15 16 5 17 18 19 20 21 Differential Metabolite and Metabolic Pathway Analysis In our study, the levels of L-threonine, glycine, serine, and L-lysine were consistently reduced in multiple organs, suggesting a systemic disruption of amino acid-related metabolic pathways in response to cisplatin exposure. Among them, L-threonine exhibited the most widespread decrease, with significant reductions observed in the heart, liver, lung, kidney, hippocampus, and blood, highlighting its central involvement in cisplatin-induced metabolic alterations. These findings imply that multiple essential physiological functions, such as protein biosynthesis, redox regulation, and neurotransmitter balance, may be affected. As an essential amino acid, L-threonine plays critical roles in the synthesis of structural proteins and mucins, in intestinal barrier integrity, and in one-carbon metabolism. It also serves as a precursor for glycine and serine, both of which participate in the folate-mediated one-carbon pool pathway, essential for DNA methylation, nucleotide synthesis, and glutathione-mediated antioxidant defense. 22 23 24 25 2 − 26 27 28 29 30 31 32 2+ 33 It is interesting that in this study, while the majority of amino acids exhibited a consistent decrease across multiple organs following cisplatin exposure, several key amino acids, including L-threonine, L-lysine, and serine, displayed increased levels in specific tissues such as the hippocampus and brown adipose tissue (BAT). These findings suggest that cisplatin-induced metabolic alterations are not uniform but exhibit strong organ specificity and potentially reflect tissue-specific compensatory or adaptive responses. Importantly, correlation analysis between metabolomics and ionomics data revealed that hippocampal L-threonine levels were positively correlated with Pt and Ag, and negatively correlated with As and Mo. These metal ions exhibited distinctive distribution patterns under cisplatin exposure: Pt and Ag were elevated, while essential elements such as As and Mo were significantly decreased in the hippocampus. Accumulation of heavy metals like Pt and Ag has been associated with mitochondrial dysfunction and reactive oxygen species (ROS) generation, 34 35 36 37 38 38 39 In our pathway enrichment analysis, phenylalanine, tyrosine and tryptophan biosynthesis emerged as a recurrently perturbed pathway in the heart, hippocampus, and brown adipose tissue (BAT), suggesting that aromatic amino acid metabolism is a shared target of cisplatin toxicity across both central and peripheral tissues. These amino acids are not only fundamental building blocks for protein synthesis but also serve as precursors for neurotransmitters such as dopamine, norepinephrine, and serotonin, implicating their dysregulation in both cognitive and systemic side effects of cisplatin. 40 39 41 42 Differential Ion Analysis Our study found that excessive accumulation of cisplatin in the body significantly disrupts the ion balance in various organs of mice. The kidney is the primary target organ of cisplatin, and nephrotoxicity is one of the most common and severe side effects of its clinical application. Consistent with our experimental results, we observed the most prominent ion changes in the kidney. Cisplatin binds to sulfhydryl groups in renal tubular epithelial cells, forming toxic cisplatin-sulfhydryl complexes that cause damage to renal tubular cells, triggering oxidative stress and inflammatory responses. 43 44 45 46 47 We observed a notable accumulation of silver in multiple organs (including the heart, liver, spleen, kidney, cortex, hippocampus, and brown fat) following cisplatin treatment. This may reflect cisplatin’s broad disruption of metal ion metabolism and cellular homeostasis. Mechanistically, cisplatin impairs renal excretion function by inducing oxidative stress, mitochondrial dysfunction, and apoptosis in tubular epithelial cells, facilitating systemic retention of metal ions such as silver. 48 48 In our research, we found significant reductions in As and Zr levels across multiple organs, while Tl levels exhibited both increases and decreases in different organs. As a well-known environmental toxin, arsenic is strongly associated with the onset of various health problems, particularly chronic diseases such as cancer, cardiovascular diseases, diabetes, and skin disorders. Research has demonstrated that arsenic inhibits antioxidant enzyme activity and activates oxidative stress pathways, leading to cellular damage and multi-organ dysfunction. 49 50 51 In our study, we observed a significant decrease in phosphorus content in the kidney, spleen, hippocampus, and heart following cisplatin treatment. Phosphorus metabolic dysregulation in the body may be closely associated with the oxidative stress and organ damage induced by cisplatin. A reduction in phosphorus levels may impact intracellular energy metabolism, particularly the ATP synthesis process. 52 53 52 54 55 Integrated metabolomic and ionomic data revealed significant correlations between metabolites and metal ions in the kidney following cisplatin treatment, reflecting the complex mechanisms underlying its toxicity. In the kidney, L-alanine exhibited a strong positive correlation with Cu and Mg (r > 0.8, P < 0.05), while showing a negative association with Ag and Pt. These findings suggest that cisplatin may reorganize the renal metabolic network by disrupting metal ion homeostasis and modulating metal-dependent enzymatic activities. The correlation of L-alanine with Cu and Mg indicates a potential association between this amino acid and the distribution of these metal ions in the kidney. Copper is commonly involved in redox-related enzymatic systems, such as cytochrome coxidase and Cu/Zn-superoxide dismutase (SOD1), which are implicated in reactive oxygen species (ROS) detoxification and mitochondrial energy metabolism under stress conditions. 56 57 58 Conclusion This study systematically explored the effects of cisplatin treatment on the metabolome and ionome of various organ tissues in mice by combining gas chromatography-mass spectrometry (GC-MS) and inductively coupled plasma mass spectrometry (ICP-MS). The goal was to investigate the mechanisms of cisplatin toxicity across multiple organs and to generate hypotheses regarding candidate therapeutic targets for mitigating its toxic side effects in clinical settings. Through comprehensive analysis of differential metabolites and metal ions, this study found that cisplatin treatment significantly altered the levels of several key metabolites, including Phenylalanine, tyrosine and tryptophan biosynthesis, Alanine, aspartate and glutamate metabolism, Pantothenate and CoA biosynthesis. Furthermore, significant fluctuations in metal ions such as Ag, Cu, Zn, Fe, and Mg highlighted the critical role of metal ions in cisplatin-induced toxicity. Previous studies have indicated that cisplatin may cause organ damage through mechanisms such as oxidative stress, inflammatory responses, disruption of cell signal transduction, and impairment of energy metabolism. The integrated analysis of metabolomics and ionomics identified multi-level alterations in cellular energy metabolism and ion homeostasis following cisplatin exposure. These results provide a basis for further exploration of potential biological processes associated with cisplatin-related toxicity and its modulation. Although this study utilized GC-MS and ICP-MS techniques for metabolic and ionomic profiling, several limitations should be acknowledged. First, GC-MS is suitable for detecting small, volatile, and semi-volatile metabolites, but cannot effectively capture macromolecules or highly polar compounds. Second, the sample size and diversity of organ types analyzed were relatively limited, potentially affecting the generalizability of the findings. Third, although body weight loss and histopathological assessments indicated cisplatin-induced toxicity, standard biochemical markers such as serum blood urea nitrogen and creatinine for evaluating renal function, as well as alanine aminotransferase and aspartate aminotransferase for assessing liver function, were not measured. The lack of these quantitative indicators may reduce the precision of toxicity assessment. Future investigations should integrate these biomarkers to improve the rigor and translational relevance of the results. Overall, this study comprehensively investigated the toxic effects of cisplatin on multiple organs from the dual perspectives of metabolism and ionomics, providing essential data to elucidate its toxic mechanisms across various organs. Future studies could further elucidate the organ toxicity of cisplatin by integrating genomic, transcriptomic, and metabolomic data, combining multi-omics platforms, and utilizing larger sample sizes. The application of advanced data analysis techniques, particularly machine learning and network analysis methods, is expected to provide novel insights into the specific responses of cisplatin in different organs, thereby aiding the development of precise toxicity intervention strategies. Studies have shown that the deficiency or abnormal increase of certain key metabolites or elements significantly influences the toxicity of cisplatin, with these changes exacerbating cisplatin-induced toxicity through mechanisms such as oxidative stress and inflammatory signaling pathways. Therefore, supplementation or reduction of these key metabolites or elements may mitigate cisplatin-induced toxic reactions. Data Sharing Statement The datasets used and/or analyzed during the current study are available from the corresponding author on reasonable request. Ethics Approval and Consent to Participate This study adhered to the guidelines for the care and use of experimental animals issued by the State Science and Technology Commission of the People’s Republic of China, and the research protocol was approved by the institutional ethics committee (approval number: JNRM-2024-DW-158). Author Contributions All authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. RS Disclosure The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1. Rodler E Sharma P Barlow WE Cisplatin with veliparib or placebo in metastatic triple-negative breast cancer and BRCA mutation-associated breast cancer (S1416): a randomised, double-blind, placebo-controlled, phase 2 trial Lancet Oncol 2023 24 2 162 174 10.1016/S1470-2045(22)00739-2 36623515 PMC9924094 2. Siegel RL Miller KD Fuchs HE Jemal A Cancer statistics, 2022 CA Cancer J Clin 2022 72 1 7 33 10.3322/caac.21708 35020204 3. Raudenska M Balvan J Fojtu M Gumulec J Masarik M Unexpected therapeutic effects of cisplatin Metallomics 2019 11 7 1182 1199 10.1039/c9mt00049f 31098602 4. Wu CK Shiu JL Wu CL APLF facilitates interstrand DNA crosslink repair and replication fork protection to confer cisplatin resistance Nucleic Acids Res 2024 52 10 5676 5697 10.1093/nar/gkae211 38520407 PMC11162786 5. Elmorsy EA Saber S Hamad RS Advances in understanding cisplatin-induced toxicity: molecular mechanisms and protective strategies Eur J Pharm Sci 2024 203 106939 10.1016/j.ejps.2024.106939 39423903 6. Liao JC Li CY Teng FM Integrated analysis of comprehensive metabolomics and network pharmacology to reveal the mechanisms of abelmoschus manihot (L.) medik. in the treatment of cisplatin-induced chronic kidney disease Front Pharmacol 2022 13 1064498 10.3389/fphar.2022.1064498 36467079 PMC9715753 7. Michalke B Editorial on the occasion of the 25th anniversary of the journal of trace elements in medicine and biology J Trace Elem Med Biol 2011 25 1 1 2 10.1016/j.jtemb.2010.12.001 21193299 8. Jiang C Zhao QQ Gao Q Diagnostic potential of ionomic profile in the plasma of cervical cancer patients receiving neoadjuvant chemoradiotherapy J Trace Elem Med Biol 2020 57 68 74 10.1016/j.jtemb.2019.09.009 31568922 9. Baima G Iaderosa G Corana M Macro and trace elements signature of periodontitis in saliva: a systematic review with quality assessment of ionomics studies J Periodontal Res 2022 57 1 30 40 10.1111/jre.12956 34837226 PMC9298699 10. Lim SY Dayal H Seah SJ Plasma metallomics reveals potential biomarkers and insights into the ambivalent associations of elements with acute myocardial infarction J Trace Elem Med Biol 2023 77 127148 10.1016/j.jtemb.2023.127148 36905853 11. Zhou R Fu W Vasylyev D Waxman SG Liu CJ Ion channels in osteoarthritis: emerging roles and potential targets Nat Rev Rheumatol 2024 20 9 545 564 10.1038/s41584-024-01146-0 39122910 PMC12374755 12. Chen LL Fan YG Zhao LX Zhang Q Wang ZY The metal ion hypothesis of Alzheimer’s disease and the anti-neuroinflammatory effect of metal chelators Bioorg Chem 2023 131 106301 10.1016/j.bioorg.2022.106301 36455485 13. Naseem I Hassan I Alhazza IM Chibber S Protective effect of riboflavin on cisplatin induced toxicities: a gender-dependent study J Trace Elem Med Biol 2015 29 303 314 10.1016/j.jtemb.2014.08.003 25242266 14. Shen Z Lin J Teng J Association of urinary ionomic profiles and acute kidney injury and mortality in patients after cardiac surgery J Thorac Cardiovasc Surg 2020 159 3 918 26.e5 10.1016/j.jtcvs.2019.02.095 31351778 15. Groehler A Maratova A Dao NM Mahkmut A Schärer OD Development of comprehensive ultraperformance liquid chromatography-high-resolution mass spectrometry assays to quantitate cisplatin-induced DNA-DNA cross-links Chem Res Toxicol 2023 36 6 822 837 10.1021/acs.chemrestox.2c00308 37208809 16. Chandra S Quantitative imaging of chemical composition in single cells by secondary ion mass spectrometry: cisplatin affects calcium stores in renal epithelial cells Methods Mol Biol 2010 656 113 130 20680587 10.1007/978-1-60761-746-4_6 PMC2974903 17. Yu B Jin L Yao X TRPM2 protects against cisplatin-induced acute kidney injury and mitochondrial dysfunction via modulating autophagy Theranostics 2023 13 13 4356 4375 10.7150/thno.84655 37649595 PMC10465213 18. Sung CYW Hayase N Yuen PST Macrophage depletion protects against cisplatin-induced ototoxicity and nephrotoxicity Sci Adv 2024 10 30 eadk9878 10.1126/sciadv.adk9878 39047106 PMC11268410 19. Tan Y Li J Zhao G Metabolic reprogramming from glycolysis to fatty acid uptake and beta-oxidation in platinum-resistant cancer cells Nat Commun 2022 13 1 4554 10.1038/s41467-022-32101-w 35931676 PMC9356138 20. Aladaileh SH Al-Swailmi FK Abukhalil MH Ahmeda AF Mahmoud AM Punicalagin prevents cisplatin-induced nephrotoxicity by attenuating oxidative stress, inflammatory response, and apoptosis in rats Life Sci 2021 286 120071 10.1016/j.lfs.2021.120071 34688692 21. Pervushin NV Yapryntseva MA Panteleev MA Zhivotovsky B Kopeina GS Cisplatin resistance and metabolism: simplification of complexity Cancers 2024 16 17 3082 10.3390/cancers16173082 39272940 PMC11394643 22. Jog RM Hormonal Regulation of Glycine Decarboxylase and Its Metabolic Outcomes Wayne State University 2020 23. Alger B Le Beau F Physiology of the GABA and glycine systems Pharmacology of GABA and Glycine Neurotransmission Springer 2001 3 76 24. Niciu MJ Kelmendi B Sanacora G Overview of glutamatergic neurotransmission in the nervous system Pharmacol Biochem Behav 2012 100 4 656 664 10.1016/j.pbb.2011.08.008 21889952 PMC3253893 25. Pérez-Torres I María Zuniga-Munoz A Guarner-Lans V Beneficial effects of the amino acid glycine Mini Rev Med Chem 2017 17 1 15 32 10.2174/1389557516666160609081602 27292783 26. Ruiz-Ramírez A Ortiz-Balderas E Cardozo-Saldaña G Diaz-Diaz E El-Hafidi M Glycine restores glutathione and protects against oxidative stress in vascular tissue from sucrose-fed rats Clin Sci 2014 126 1 19 29 10.1042/CS20130164 23742196 27. Haddad JJ Harb HL l-γ-Glutamyl-l-cysteinyl-glycine (glutathione; GSH) and GSH-related enzymes in the regulation of pro-and anti-inflammatory cytokines: a signaling transcriptional scenario for redox (y) immunologic sensor (s)? Mol Immunol 2005 42 9 987 1014 10.1016/j.molimm.2004.09.029 15829290 28. Maiese K Chong ZZ Wang S Shang YC Oxidant stress and signal transduction in the nervous system with the PI 3-K, Akt, and mTOR cascade Int J Mol Sci 2012 13 11 13830 13866 10.3390/ijms131113830 23203037 PMC3509553 29. Cheng X Wang K Zhao Y Wang K Research progress on post-translational modification of proteins and cardiovascular diseases Cell Death Discovery 2023 9 1 275 10.1038/s41420-023-01560-5 37507372 PMC10382489 30. Pan S Fan M Liu Z Li X Wang H Serine, glycine and one-carbon metabolism in cancer Int J Oncol 2020 58 2 158 170 10.3892/ijo.2020.5158 33491748 PMC7864012 31. Li P Yin Y-L Li D Kim SW Wu G Amino acids and immune function Br J Nutr 2007 98 2 237 252 10.1017/S000711450769936X 17403271 32. Hu Y Feng L Jiang W Lysine deficiency impaired growth performance and immune response and aggravated inflammatory response of the skin, spleen and head kidney in grown-up grass carp (Ctenopharyngodon idella) Animal Nutrition 2021 7 2 556 568 10.1016/j.aninu.2020.07.009 34258445 PMC8245797 33. Zhang Q Yan L Lu J Zhou X Glycyl-L-histidyl-L-lysine-Cu2+ attenuates cigarette smoke-induced pulmonary emphysema and inflammation by reducing oxidative stress pathway Front Mol Biosci 2022 9 925700 10.3389/fmolb.2022.925700 35936787 PMC9354777 34. Sun Q Li Y Shi L Heavy metals induced mitochondrial dysfunction in animals: molecular mechanism of toxicity Toxicology 2022 469 153136 10.1016/j.tox.2022.153136 35202761 35. Teschke R Aluminum, arsenic, beryllium, cadmium, chromium, cobalt, copper, iron, lead, mercury, molybdenum, nickel, platinum, thallium, titanium, vanadium, and zinc: molecular aspects in experimental liver injury Int J Mol Sci 2022 23 20 12213 10.3390/ijms232012213 36293069 PMC9602583 36. Malinovsky A Why threonine is an essential amino acid in mammals and birds: studies at the enzyme level Biochemistry 2018 83 7 795 799 10.1134/S0006297918070039 30200864 37. Xiang F Zhang Z Xie J Comprehensive review of the expanding roles of the carnitine pool in metabolic physiology: beyond fatty acid oxidation J Transl Med 2025 23 1 324 10.1186/s12967-025-06341-5 40087749 PMC11907856 38. Ali I Conrad RJ Verdin E Ott M Lysine acetylation goes global: from epigenetics to metabolism and therapeutics Chem Rev 2018 118 3 1216 1252 10.1021/acs.chemrev.7b00181 29405707 PMC6609103 39. Alhowail AH Cisplatin induces hippocampal neurotoxicity and cognitive impairment in rats through neuroinflammation, oxidative stress, and overexpression of glutamatergic receptors mRNA Front Pharmacol 2025 16 1592511 10.3389/fphar.2025.1592511 40520187 PMC12163336 40. Ghallab YK Elassal OS Biochemical and neuropharmacology of psychiatric disorders Nutrition and Psychiatric Disorders: An Evidence-Based Approach to Understanding the Diet-Brain Connection Springer 2024 25 47 41. Moiseenok AG Kanunnikova NP Brain CoA and acetyl CoA metabolism in mechanisms of neurodegeneration Biochemistry 2023 88 4 466 480 10.1134/S000629792304003X 37080933 42. Yu W Chen Y Dubrulle J Cisplatin generates oxidative stress which is accompanied by rapid shifts in central carbon metabolism Sci Rep 2018 8 1 4306 29523854 10.1038/s41598-018-22640-y PMC5844883 43. Jiang H Hong Y Fan G Bismuth reduces cisplatin-induced nephrotoxicity via enhancing glutathione conjugation and vesicular transport Front Pharmacol 2022 13 887876 10.3389/fphar.2022.887876 35784696 PMC9243339 44. Manohar S Leung N Cisplatin nephrotoxicity: a review of the literature J Nephrol 2018 31 1 15 25 10.1007/s40620-017-0392-z 28382507 45. Akerfeldt MC Tran CM-N Shen C Hambley TW New EJ Interactions of cisplatin and the copper transporter CTR1 in human colon cancer cells J Biol Inorg Chem 2017 22 5 765 774 10.1007/s00775-017-1467-y 28516214 46. Mezzaroba L Alfieri DF Simão ANC Reiche EMV The role of zinc, copper, manganese and iron in neurodegenerative diseases Neurotoxicology 2019 74 230 241 10.1016/j.neuro.2019.07.007 31377220 47. Gromadzka G Tarnacka B Flaga A Adamczyk A Copper dyshomeostasis in neurodegenerative diseases—therapeutic implications Int J Mol Sci 2020 21 23 9259 33291628 10.3390/ijms21239259 PMC7730516 48. Davoudi M Jadidi Y Moayedi K Farrokhi V Afrisham R Ameliorative impacts of polymeric and metallic nanoparticles on cisplatin-induced nephrotoxicity: a 2011–2022 review J Nanobiotechnol 2022 20 1 504 10.1186/s12951-022-01718-w PMC9714065 36457031 49. Xu G Gu Y Yan N Li Y Sun L Li B Curcumin functions as an anti‐inflammatory and antioxidant agent on arsenic‐induced hepatic and kidney injury by inhibiting MAPKs/NF‐κB and activating Nrf2 pathways Environ Toxicol 2021 36 11 2161 2173 10.1002/tox.23330 34272803 50. Nava-Ruíz C Méndez-Armenta M Cadmium, lead, thallium: occurrence, neurotoxicity and histopathological changes of the nervous system. Pollutant diseases, remediation and recycling 2013 321 349 51. Caito S Aschner M Neurotoxicity of metals Handbook Clin Neurol 2015 131 169 189 10.1016/B978-0-444-62627-1.00011-1 26563789 52. Bonora M Patergnani S Rimessi A ATP synthesis and storage Purinergic Signalling 2012 8 3 343 357 10.1007/s11302-012-9305-8 22528680 PMC3360099 53. Tang C Livingston MJ Safirstein R Dong Z Cisplatin nephrotoxicity: new insights and therapeutic implications Nat Rev Nephrol 2023 19 1 53 72 10.1038/s41581-022-00631-7 36229672 54. Bartl R Calcium and Vitamin D Deficiency and Osteomalacia Osteoporosis in Clinical Practice Springer 2023 77 90 55. Kalantar‐Zadeh K Ganz T Trumbo H Seid MH Goodnough LT Levine MA Parenteral iron therapy and phosphorus homeostasis: a review Am J Hematol 2021 96 5 606 616 10.1002/ajh.26100 33471363 PMC8248123 56. Jomova K Alomar SY Valko R Nepovimova E Kuca K Valko M The role of redox-active iron, copper, manganese, and redox-inactive zinc in toxicity, oxidative stress, and human diseases EXCLI J 2025 24 880 954 40933952 10.17179/excli2025-8449 PMC12419454 57. Fatima G Dzupina A Alhmadi HB Magnesium matters: a comprehensive review of its vital role in health and diseases Cureus 2024 16 10 10.7759/cureus.71392 PMC11557730 39539878 58. Esmailzadeh F Taheri-Ledari R Salehi MM Bonding states of gold/silver plasmonic nanostructures and sulfur-containing active biological ingredients in biomedical applications: a review Phys Chem Chem Phys 2024 26 23 16407 16437 10.1039/D3CP04131J 38807475 ",
  "metadata": {
    "Title of this paper": "Bonding states of gold/silver plasmonic nanostructures and sulfur-containing active biological ingredients in biomedical applications: a review",
    "Journal it was published in:": "Drug Design, Development and Therapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474739/"
  }
}