{
  "title": "Paper_655",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469948 PMC12469948.1 12469948 12469948 41009348 10.3390/ijms26188780 ijms-26-08780 1 Article Integrated In Silico and Experimental Validation of Antrocin as a Plant-Derived Multi-Target Therapeutic for BRAF/MEK/PI3K-Driven Colorectal Cancer https://orcid.org/0000-0002-0606-5927 Chen Jian-Syun Formal analysis Data curation Writing – original draft 1 2 Enwolo-Chibueze Chioma Grace Formal analysis Data curation Writing – original draft 3 Chinyama Harold Arnold Formal analysis Data curation Writing – original draft 4 Lai Cheng-Ta Writing – original draft Writing – review & editing 1 2 Ezeala Ifeyinwa Chioma Writing – original draft Writing – review & editing 5 Huang Po-Yang Validation 6 https://orcid.org/0000-0002-0178-6530 Wu Alexander T. H. 6 7 8 9 Huang Yan-Jiun Writing – review & editing Supervision Funding acquisition 10 11 12 * Aureliano Manuel Academic Editor Llopis Juan Academic Editor Scibior Agnieszka Academic Editor 1 manchette.4320@mmh.org.tw iamctlai.4987@mmh.org.tw 2 3 m654113004@tmu.edu.tw 4 d610113001@tmu.edu.tw 5 ifeyinwa.adaka@unn.edu.ng 6 boyang0321@gmail.com chaw1211@tmu.edu.tw 7 8 9 10 11 12 * d621108006@tmu.edu.tw 09 9 2025 9 2025 26 18 497349 8780 17 7 2025 01 9 2025 02 9 2025 09 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Colorectal cancer (CRC) remains a leading cause of cancer-related death worldwide, with resistance to targeted therapies presenting a significant clinical challenge. This study combines computational and experimental methods to identify and validate Antrocin, a natural sesquiterpene lactone, as a potential multi-target inhibitor of the BRAF/MEK/PI3K oncogenic pathway in CRC. Differential gene expression and mutational analyses were performed using public datasets (TCGA, TNMplot, GEPIA2, GSCA, PANDA, and cBioPortal) to assess the prevalence and clinical significance of BRAF, MEK, and PI3K alterations in CRC. In silico molecular docking, using AutoDock Vina, predicted strong binding affinities of Antrocin to BRAF (ΔG = −8.5 kcal/mol), MEK (ΔG = −7.3 kcal/mol), and PI3K (ΔG = −6.9 kcal/mol), comparable to those of FDA-approved inhibitors for BRAF (Dabrafenib), MEK (Trametinib), and PI3K (Alpelisib). Drug-likeness and ADME properties were evaluated via SwissADME and ADMETlab, supporting Antrocin’s potential as a drug candidate. In vitro assays using HCT116 and RKO CRC cell lines validated that Antrocin treatment suppressed cell viability, spheroid formation, and migration, accompanied by reduced expression levels of the oncogenic BRAF/MEK/PI3K signaling pathway. Antrocin-treated tumor-conditioned medium experiments demonstrated Antrocin’s ability to reduce the differentiation of cancer-associated fibroblasts and the polarization of M2 macrophages. Preclinical mouse xenograft experiments demonstrated a delay in tumor growth following treatment with Antrocin. These results suggest that Antrocin, identified through computational screening and validated experimentally, could be a promising multi-target agent to overcome therapy resistance in CRC. colorectal cancer (CRC) BRAF/MEK/PI3K oncogenic signature Antrocin drug resistance bioinformatics multi-target therapy National Science and Technology Council, Taiwan NSTC-113-2314-B-038-071-MY3 National Science and Technology Council, Taiwan NSTC-113-2320-B-038-034 113-2314-B-038-010 Y.-J.H. is funded by the National Science and Technology Council, Taiwan (NSTC-113-2314-B-038-071-MY3). A.T.H.W. is funded by the National Science and Technology Council, Taiwan (NSTC-113-2320-B-038-034 and 113-2314-B-038-010). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Colorectal cancer (CRC) accounts for 9.6% of all cancers and is ranked as the third most prevalent cancer and the second most common cause of cancer deaths in the world. A gradual increase from 63% to 73% of the incidences and mortality rates, respectively, is expected by the year 2040, presenting colorectal cancer as a global health burden [ 1 2 3 2 4 5 6 7 CRC therapy faces challenges due to multiple dysregulations of oncogenic signaling pathways. Our data mining and bioinformatics analyses identified an oncogenic signature involving the BRAF, MEK, and PI3K pathways. Dysregulation of this signature promotes CRC progression and resistance [ 8 9 10 11 12 13 14 12 13 14 15 16 17 18 Natural sources such as Antrodia cinnamomea 19 20 The present study employed a comprehensive integrated approach. First, an in silico exploration was conducted to identify and characterize the BRAF/MEK/PI3K oncogenic signature in CRC, demonstrating how mutations and differential expression remodel the tumor microenvironment and impact overall patient survival. This computational analysis positioned Antrocin as a promising multi-targeted therapeutic candidate in CRC. Second, experimentally, this study validated Antrocin’s ability to simultaneously inhibit BRAF, MEK, and PI3K genes present in HCT116 and RKO cell lines, hence its broader anti-tumor effects in CRC, and compared its putative efficacy with that of FDA-approved standard inhibitors. This synergistic approach, combining in silico methods for rapid hypothesis generation with experimental validations, was designed to increase confidence in Antrocin’s therapeutic potential and advance its development as a novel agent for the management of colorectal cancer by targeting the BRAF/MEK/PI3K tumor proliferative axis and overcoming drug resistance. 2. Results 2.1. BRAF/MEK/PI3K Is Overexpressed in the Pan-Cancer and Promotes Tumor Proliferation and Metastasis in CRC Validation of BRAF/MEK/PI3K expression in CRC ( Figure 1 Figure 2 Figure 2 Figure 2 Further validation using GEPIA2 showed high expression of BRAF, MEK, and PI3K in CRC at p Figure 2 p Figure 2 p p Figure 2 Figure 2 2.2. BRAF/MEK/PI3K Cancer Hallmark and CRC Correlation Cell Type Activities The aggressiveness of any cancer-related gene is embedded in its hallmark of activities; hence, below we used the CancerHallmark platform ( https://cancerhallmarks.com/ Figure 3 p p Table 1 p 21 22 23 Figure 3 24 https://panda.bio.uniroma2.it Figure 3 25 26 2.3. BRAF/MAP2K1/PIK3CA Gene Ontology (GO) and KEGG Pathway The Gene Ontology (GO) explains the roles of genes and their products in a biological context across multiple species. The GO functions of BRAF/MEK/PI3K encompass a lot of activities shown in the literature highlighted in CRC development [ 27 Figure 4 Figure 4 10 https://string-db.org/ https://www.bioinformatics.com.cn/en 2.4. Mutations in BRAF/MEK/PI3K and Their Expression Changes Promote CRC Tumor Growth The top five genes whose expression is affected by the mutation status of BRAF, MEK, and PI3K were analyzed at the genotypic level on the muTarget platform with p Figure 5 Figure 5 28 29 30 31 Figure 5 Figure 5 32 33 Figure 5 34 35 Figure 5 36 37 38 Figure 5 Figure 5 2.5. BRAF/MEK/PI3K Oncogenic Signature Promotes Tumor Aggressiveness, Therapy Resistance, and Poor Overall Survival This analysis revealed 481 driver mutations and 74 VUS on BRAF (12%), 54 driver mutations on MEK (2%), and 921 driver mutations on PI3K (21%). Missense mutations were most common, followed by truncating, in-frame, and splice mutations. We found multiple hotspots and driver mutations in the BRAF/MEK/PI3K pathway ( Figure 6 39 40 Figure 6 39 40 41 42 Figure 6 41 42 43 Figure 6 2.6. BRAF/MEK/PI3K Correlation and Functional Enrichment in Colorectal Cancer The analysis on the starBase software 3, showed a highly correlated BRAF/MEK/PI3K oncogenic signature in CRC among 471 samples analyzed, with the BRAF/PI3K interaction exhibiting a strong correlation with a correlation coefficient (r) of 0.813 ( Figure 7 Figure 7 Figure 7 p 44 45 46 47 48 Figure 7 Figure 7 Figure 7 Figure 7 Figure 7 p −6 2.7. BRAF/MEK/PI3K Overexpression Promotes the Recruitment of Pro-Tumor Immune Cells in the CRC Tumor Microenvironment Gene Set Cancer Analysis revealed that the overexpression of the BRAF/MEK/PI3K oncogenic signature in CRC directly correlates with the recruitment of pro-tumor immune cells into the TME ( https://guolab.wchscu.cn/GSCA/#/ Figure 8 49 50 51 52 53 54 55 49 50 51 52 53 54 55 Figure 2 2.8. Analysis of the Presence of BRAF/MEK/PI3K in a Cancerous Colon and Its Expression in CRC Cell Lines This study used the human protein atlas website ( https://www.proteinatlas.org/ Figure 9 Figure 9 12 21 Figure 9 56 57 58 2.9. High BRAF/MEK/PI3K Expression Is Associated with Multi-Drug Resistance in CRC Analysis of BRAF, MEK, and PI3K expression and drug sensitivity in CRC was achieved using GSCA, which used CTRP and GDSC databases. Results are shown in bubble plots for the top thirty FDA-approved drugs, with correlations in orange and blue ( Figure 10 59 60 Figure 10 Figure 10 61 62 63 64 2.10. Antrocin Meets All Drug-Likeness, Absorption, Distribution, Metabolism, and Excretion (ADME) Properties of Small-Molecule Drugs The SwissADME assessment of Antrocin (structure in Figure 1 2 2 65 66 Figure 11 Table 2 Figure 11 Table 2 2.11. Antrocin Is a Potential Drug for Targeting the BRAF/MEK/PI3K Oncogenic Signature Ligand-based affinities were utilized in AutoDock Vina to investigate the anti-cancer effects of Antrocin, specifically against the BRAF/MEK/PI3K oncogenic pathway. Antrocin exhibited equally favorable Gibbs free energies in its interactions with BRAF (ΔG = −8.5 kcal/mol), MEK (ΔG = −7.3 kcal/mol), and PI3K (ΔG = −6.9 kcal/mol) ( Figure 12 15 61 67 68 69 70 71 Figure 13 72 73 74 Figure 12 Figure 12 Figure 13 Table 3 2.12. In Vitro Validation of Antrocin’s CRC Inhibitory Potential Through Inhibition of Multiple Oncogenic Targets Based on the bioinformatics analysis, Antrocin was predicted to interfere with the BRAF/MEK/PI3K signaling pathway. Therefore, we performed in vitro studies to validate our hypothesis. Antrocin treatment resulted in a significant, dose-dependent reduction in cell viability in both HCT116 and RKO colorectal cancer cell lines, with IC 50 Figure 14 Figure 14 Figure 14 Figure 14 Figure 14 Figure 14 2.13. Antrocin Treatment Significantly Delays Tumor Growth of HCT116 Tumoroids Next, evaluation of Antrocin’s anti-CRC and TME-normalizing functions was performed using the tumoroid-engrafted mouse model. RKO tumoroids (containing CAFs and TAMs) were used for in vivo evaluation of Antrocin. Monitoring tumor growth over 8 weeks demonstrated that Antrocin treatment (40 mg/kg) significantly attenuated tumor progression compared to control groups ( Figure 15 p Figure 15 p Figure 15 p Figure 15 3. Discussion Our initial bioinformatics analysis revealed the overexpression of BRAF, MEK (MAP2K1/2), and PI3K (PIK3CA) in CRC tissues compared to normal tissues. This observation aligns with the growing body of literature highlighting the critical role of these pathways in CRC tumorigenesis. Data mined from The Cancer Genome Atlas (TCGA) indicates that genomic alterations in the RAS/MAPK signaling pathway, including mutations in KRAS NRAS BRAF PIK3CA 48 75 76 77 78 In addition, the mutational landscape of CRC is highly heterogeneous, which is also another major contributor to therapeutic resistance and failure. Our study demonstrates that the interplay between BRAF/MEK/PI3K mutations and the expression of other cancer-related genes provides valuable insight into the complex molecular circuitry of CRC. For instance, the downregulation or mutation in tumor suppressors AXIN2 and APC in BRAF-mutant CRC, as observed in our study, agrees with previous reports linking BRAF mutations to the dysregulation of the Wnt/β-catenin signaling pathway [ 48 79 80 81 82 Equally important, this study demonstrates a significant link between the BRAF/MEK/PI3K oncogenic signature and the establishment of a pro-tumorigenic colorectal cancer microenvironment (TME). The observed correlation between these gene signatures and the infiltration of cancer-associated fibroblasts (CAFs) and M2 tumor-associated macrophages (TAMs) aligns with the established roles of these cell types in promoting tumor growth, angiogenesis, and immunosuppression in CRC [ 83 84 85 Based on our bioinformatics analysis of the BRAF/MEK/PI3K oncogenic signature and numerous lines of evidence that mono-targeted therapies often fail to improve the outcome of cancer patients, including CRC, due to the development of drug resistance [ 59 86 19 The translational significance of this study is evident through in vitro and in vivo validation of Antrocin’s effects against CRC. We showed that Antrocin treatment can suppress the tumorigenic properties of HT116 and RKO cell lines, including cell viability, migration, and spheroid formation. Importantly, Antrocin-treated HCT116 and RKO cells exhibited a significantly reduced ability to produce CAFs and M2 TAMs by releasing lower levels of cytokines such as IL-6, TGFb1 (for CAF transformation), and VEGF and IL-10 (for M2 polarization). Finally, we utilized an RKO tumoroid-engrafted mouse model of CRC (containing CAF and M2 TAM components) to validate Antrocin’s therapeutic potential. The significant delay in tumor growth observed in the Antrocin-treated group, along with no apparent cytotoxicity, provides promising preclinical evidence of its efficacy. Additionally, ex vivo experiments on the tumor cells harvested from the mice demonstrated a significantly reduced spheroid-forming ability in the Antrocin-treated group, accompanied by a decreased expression of the BRAF/MEK/PI3K oncogenic signature, FAP (CAF marker), CD206 (M2 TAM marker), and the stemness marker CD44. Together, the in vitro and in vivo experimental data supported our hypothesis, which was generated by our computational and bioinformatics analysis (as illustrated in Figure 1 4. Materials and Methods 4.1. BRAF/MEK/PI3K Differential Expression in Colorectal Cancer and Pan-Cancers Gene differential expressions of the BRAF, MEK, and PI3K signatures in CRC on the Tumor, Normal, and Metastatic plot tool version 1.0 (TNMplot.com) were accessed at https://tnmplot.com/analysis/ 87 p http://gepia2.cancer-pku.cn/#index p 88 https://panda.bio.uniroma2.it/ 89 4.2. Evaluating BRAF/MEK/PI3K Mutations and Associated Gene Expression Changes in CRC The relationship between the mutation status of BRAF/MEK/PI3K mutation status and the changes in gene expression in colorectal cancer was analyzed on the muTarget platform ( https://www.mutarget.com/ p 90 https://www.cbioportal.org/ 91 92 93 27 94 95 96 4.3. Network Construction and Pathways Enrichment Analysis in CRC The Cancer Hallmark and Gene Ontology (GO) pathways of the proposed signaling web were obtained, and further to validate these findings, the human protein atlas was used to ascertain the difference between BRAF/MEK/PI3K in cancerous compared to normal colorectal tissue and ascertain the cell lines inherent. The gene–gene correlation map of the BRAF/MEK/PI3K oncogenic signature was accessed from the Encyclopedia of RNA Interactomes (ENCORI/starBase) Pan-Cancer analysis platform accessed on 4 April 2024 ( https://rnasysu.com/encori/index.php 97 https://string-db.org/ https://www.cbioportal.org/ 91 92 p 4.4. Correlation Between BRAF/MEK/PI3K Expression and Immune Cell Infiltration Levels This study explored the association of BRAF/MEK/PI3K immune infiltration activities by comparing mutant and wild type using the gene set cancer analysis free version (GSCA) web tool. GSCA comprises a wide range of bioinformatics tools used to comprehensively predict the immune cell infiltration levels in the tumor microenvironment based on the TCGA data ( https://guolab.wchscu.cn/GSCA/#/ 98 p 4.5. Correlation Between Drug Sensitivity and BRAF/MEK/PI3K Expression in Colorectal Cancer The Gene Set Cancer Analysis (GSCA) ( https://guolab.wchscu.cn/GSCA/#/ 98 50 4.6. Chemical Origin and Assessment of the Drug-Likeness, Absorption, Distribution, Metabolism, and Excretion (ADME) Properties of Antrocin A series of tandem chemical reactions involving 1,7-diynes and internal and external nucleophiles leads to the discovery of drimane-type sesquiterpenoids, an oxygenated stereoselective compound with C-15, one of whose analogues became Antrocin [ 99 http://www.swissadme.ch/index.php#top/ https://admetlab3.scbdd.com/server/screening 65 100 101 65 4.7. Molecular Docking Analysis In silico molecular docking analyses were illustrated using AutoDock Vina commands in the command prompt to predict the binding affinities of Antrocin (CID:53474706) to BRAF mutant (PDB:6V34), MEK (PDB:3SLS), and PI3K (PDB:1E8Y) [ 72 102 103 https://www.rcsb.org/ https://pubchem.ncbi.nlm.nih.gov/ 72 72 73 74 4.8. Cell Culture Human colorectal cancer cell lines HCT116 and RKO, obtained from the American Type Culture Collection (ATCC) (located at 11F.-3, No.350, Minghua 1st Rd., Zuoying Dist., Kaohsiung City 813018, Taiwan), were used for in vitro studies. Cell lines were authenticated using STR analysis (please refer to the Supplementary Materials and Methods Sections Tables S1 and S2 4.9. Antrocin Preparation and Treatment Chemically synthesized Antrocin is a generous gift from Prof. Yew-Min Tzeng (Continuing Education Program of Food Biotechnology Applications, College of Science and Engineering, National Taitung University, Taitung, Taiwan). Antrocin was prepared by dissolving the compound in dimethyl sulfoxide (DMSO) to a concentration of 100 mM as a stock solution. Antrocin was then freshly prepared for each experiment from the stock solution, ensuring that the final DMSO concentration did not exceed 0.1% ( v v 50 4.10. Tumor Spheroid Formation Assay A three-dimensional tumor spheroid formation assay was conducted to evaluate whether Antrocin treatment inhibited the generation of cancer stem-like cells, following our established protocol [ 104 t p 4.11. Migration Assay The migration of CRC cells was determined using a Transwell apparatus (Thermo Fisher, Taipei, Taiwan). HCT116 and RKO cells (2 × 10 4 4.12. Quantitative Real-Time PCR (qPCR) Analysis Total RNA was extracted and purified using a TRIzol™ Plus RNA Purification Kit (Life Technologies, Taipei, Taiwan). Total RNA (500 ng initially from 5 × 10 5 Supplementary Table S3 4.13. Conditioned Medium Preparation and Flow Cytometry To investigate the effects of Antrocin on the tumor microenvironment (TME), conditioned medium (CM) was prepared from RKO cells that were treated with either Antrocin or vehicle control. The HCT116 cells underwent treatment for 48 h, after which they were washed three times with PBS and cultured in serum-free medium for an additional 24 h. The supernatant was then collected, centrifuged to remove cellular debris, and filtered through a 0.22 µm sterile filter to obtain CM. WS1 cells were incubated with the CM for 72 h to induce differentiation into cancer-associated fibroblasts (CAFs). THP-1 cells were first differentiated into macrophages by treatment with 100 ng/mL phorbol 12-myristate 13-acetate (PMA) for 24 h, followed by incubation with CM for 48 h to induce M2 tumor-associated macrophage (TAM) differentiation. Cells were harvested using 0.25% trypsin-EDTA, washed twice with PBS, and re-suspended at 1 × 10 6 5 4.14. ELISA Cytokine Profiling Cytokines secreted by CAFs and M2 TAMs were quantified using enzyme-linked immunosorbent assay (ELISA). Following flow cytometry analysis, differentiated CAFs and M2 TAMs were cultured for an additional 24 h in serum-free medium to allow for cytokine accumulation without interference from serum. Culture supernatants were collected, centrifuged at 2000× g 4.15. In Vivo Evaluation of Antrocin’s Therapeutic Potential The mouse experiments performed in this study were approved by the Institutional Animal Care and Use Committee or Panel (IACUC/IACUP) at Taipei Medical University (Approval No. LAC2022-0532). NOD/SCID mice (8-week-old female, BioLASCO, Taipei, Taiwan) were injected with RKO tumoroids (generated from the 3D co-culture of RKO, WS1, and THP-1 cells in a ratio of 10:3:1) [ 105 106 6 3 n 2 4.16. Statistical Analyses All statistical analyses were performed using GraphPad Prism software (version 8.42). Data are presented as the mean ± standard error of the mean (SEM) unless otherwise specified. For comparisons between two groups, an unpaired Student’s t 50 5. Conclusions Using a combined bioinformatics and experimental approach, we quickly identified the BRAF/MEK/PI3K oncogenic signature as a key therapeutic target for CRC. Antrocin’s ability to modulate this signature and the TME was validated using preclinical models, and our results laid the foundation for Antrocin’s future clinical translation. Although HCT116 and RKO cell lines were utilized in this study, further research can showcase the effect of Antrocin on several other CRC cell lines, as well as other CRC signaling axes aside from BRAF/MEK/PI3K. That notwithstanding, this study is a significant step towards harnessing other anticancer inhibitory potentials of Antrocin in colorectal cancer. Acknowledgments We thank Zheng Yang (School of Chemical Biology and Biotechnology, Peking University, China) and Yew-Min Tzeng (Department of Life Science, National Taitung University, Taiwan) for the generous gift of synthetic Antrocin. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26188780/s1 Author Contributions Data curation, J.-S.C., C.G.E.-C. and H.A.C.; formal analysis, J.-S.C., C.G.E.-C. and H.A.C.; funding acquisition, A.T.H.W. and Y.-J.H.; supervision, A.T.H.W. and Y.-J.H.; validation, P.-Y.H.; writing—original draft, J.-S.C., C.G.E.-C., H.A.C., C.-T.L. and I.C.E.; writing—review and editing, C.-T.L., I.C.E., A.T.H.W. and Y.-J.H. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The Institute of Animal Care and Use Committee or Panel (IACUC/IACUP) from Taipei Medical University issued the animal study data on 10 May 2023, with approval No. LAC2022-0532 (for the period of 1 August 2023 to 31 July 2026), which were female NOD/SCID mice (8-week-old female, BioLASCO, Taipei, Taiwan). Data Availability Statement All the generated and analyzed datasets of this study are available upon reasonable request. Conflicts of Interest The authors state that they have no conflicts of interest. Abbreviations CRC Colorectal cancer TME Tumor microenvironment BRAF B-Raf proto-oncogene, serine/threonine kinase MEK Mitogen-activated protein kinase kinase (MAPK/ERK kinase) PI3K Phosphoinositide 3-kinase MAP2K1 Mitogen-activated protein kinase kinase 1 (MEK1) PIK3CA Phosphatidylinositol-4,5-bisphosphate 3-kinase catalytic subunit alpha GSCA Gene Set Cancer Analysis (integrated cancer genomics platform) References 1. Bray F. Laversanne M. Sung H. Ferlay J. Siegel R.L. Soerjomataram I. Jemal A. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 2. Dekker E. Tanis P.J. Vleugels J.L.A. Kasi P.M. Wallace M.B. Colorectal cancer Lancet 2019 394 1467 1480 10.1016/S0140-6736(19)32319-0 31631858 3. Stefani C. Miricescu D. Stanescu-Spinu I.-I. Nica R.I. Greabu M. Totan A.R. Jinga M. Growth Factors, PI3K/AKT/mTOR and MAPK Signaling Pathways in Colorectal Cancer Pathogenesis: Where Are We Now? Int. J. Mol. Sci. 2021 22 10260 10.3390/ijms221910260 34638601 PMC8508474 4. Voutsadakis I.A. KRAS mutated colorectal cancers with or without PIK3CA mutations: Clinical and molecular profiles inform current and future therapeutics Crit. Rev. Oncol. Hematol. 2023 186 103987 10.1016/j.critrevonc.2023.103987 37059275 5. Nors J. Iversen L.H. Erichsen R. Gotschalck K.A. Andersen C.L. Incidence of recurrence and time to recurrence in stage I to III colorectal cancer: A nationwide Danish cohort study JAMA Oncol. 2024 10 54 62 10.1001/jamaoncol.2023.5098 37971197 PMC10654928 6. Siegel R.L. Giaquinto A.N. Jemal A. Cancer statistics, 2024 CA Cancer J. Clin. 2024 74 12 49 10.3322/caac.21820 38230766 7. Jafari A. Hosseini F.A. Jalali F.S. A systematic review of the economic burden of colorectal cancer Health Sci. Rep. 2024 7 e70002 10.1002/hsr2.70002 39170890 PMC11336656 8. Barbosa R. Acevedo L.A. Marmorstein R. The MEK/ERK Network as a Therapeutic Target in Human Cancer Mol. Cancer Res. 2021 19 361 374 10.1158/1541-7786.MCR-20-0687 33139506 PMC7925338 9. Bye B. Jack J. Pierce A. Walsh R.M. Eades A. Olou A. Chalise P. VanSaun M. Combined PI3K and MAPK inhibition synergizes to suppress PDAC bioRxiv 2023 10.1101/2023.08.15.553438 PMC11987824 40227649 10. Corrales E. Levit-Zerdoun E. Metzger P. Mertes R. Lehmann A. Münch J. Lemke S. Kowar S. Boerries M. PI3K/AKT signaling allows for MAPK/ERK pathway independency mediating dedifferentiation-driven treatment resistance in melanoma Cell Commun. Signal. 2022 20 187 10.1186/s12964-022-00989-y 36434616 PMC9700886 11. Ciombor K.K. Strickler J.H. Bekaii-Saab T.S. Yaeger R. BRAF-Mutated Advanced Colorectal Cancer: A Rapidly Changing Therapeutic Landscape J. Clin. Oncol. 2022 40 2706 2715 10.1200/JCO.21.02541 35649231 PMC9390817 12. Temraz S. Mukherji D. Shamseddine A. Dual inhibition of MEK and PI3K pathway in KRAS and BRAF mutated colorectal cancers Int. J. Mol. Sci. 2015 16 22976 22988 10.3390/ijms160922976 26404261 PMC4613347 13. Kopetz S. Murphy D.A. Pu J. Ciardiello F. Desai J. Van Cutsem E. Wasan H.S. Yoshino T. Saffari H. Zhang X. Molecular profiling of BRAF-V600E-mutant metastatic colorectal cancer in the phase 3 BEACON CRC trial Nat. Med. 2024 30 3261 3271 10.1038/s41591-024-03235-9 39313594 PMC11564101 14. Muradi Muhar A. Velaro A.J. Prananda A.T. Nugraha S.E. Halim P. Syahputra R.A. Precision medicine in colorectal cancer: Genomics profiling and targeted treatment Front. Pharmacol. 2025 16 1532971 10.3389/fphar.2025.1532971 40083375 PMC11903709 15. Grob J.J. Amonkar M.M. Karaszewska B. Schachter J. Dummer R. Mackiewicz A. Stroyakovskiy D. Drucis K. Grange F. Chiarion-Sileni V. Comparison of dabrafenib and trametinib combination therapy with vemurafenib monotherapy on health-related quality of life in patients with unresectable or metastatic cutaneous BRAF Val600-mutation-positive melanoma (COMBI-v): Results of a phase 3, open-label, randomised trial Lancet Oncol 2015 16 1389 1398 26433819 10.1016/S1470-2045(15)00087-X 16. Xu T. Wang X. Changsong Q. Wang Z. Li J. Shen L. Wang J. Lin X. Zhang L. Lin J. Genomic profiles of BRAF inhibitor resistance mechanisms in metastatic colorectal cancer J. Clin. Oncol. 2021 39 e15527 10.1200/JCO.2021.39.15_suppl.e15527 17. Wang H. Tang R. Jiang L. Jia Y. The role of PIK3CA gene mutations in colorectal cancer and the selection of treatment strategies Front. Pharmacol. 2024 15 1494802 10.3389/fphar.2024.1494802 39555098 PMC11565213 18. Dankner M. Rousselle E. Petrecca S. Fabi F. Nowakowski A. Lazaratos A.-M. Rajadurai C.V. Stein A.J. Bian D. Tai P. Clinical Activity of Mitogen-Activated Protein Kinase Inhibitors in Patients With MAP2K1 (MEK1)-Mutated Metastatic Cancers JCO Precis. Oncol. 2025 9 e2400199 10.1200/PO.24.00199 39869838 PMC11784909 19. Chen Y. Tzeng D.T. Huang Y.P. Lin C.J. Lo U.G. Wu C.L. Lin H. Hsieh J.T. Tang C.H. Lai C.H. Antrocin Sensitizes Prostate Cancer Cells to Radiotherapy Through Inhibiting PI3K/AKT and MAPK Signaling Pathways Cancers 2018 11 34 10.3390/cancers11010034 30602706 PMC6356781 20. Rao Y.K. Wu A.T. Geethangili M. Huang M.T. Chao W.-J. Wu C.H. Deng W.P. Yeh C.T. Tzeng Y.M. Identification of Antrocin From Antrodia Camphorata as a Selective and Novel Class of Small Molecule Inhibitor of Akt/mTOR Signaling in Metastatic Breast Cancer MDA-MB-231 Cells Chem. Res. Toxicol. 2010 24 238 245 21158420 10.1021/tx100318m 21. Greger J.G. Eastman S.D. Zhang V. Bleam M.R. Hughes A.M. Smitheman K.N. Dickerson S.H. Laquerre S.G. Liu L. Gilmer T.M. Combinations of BRAF, MEK, and PI3K/mTOR inhibitors overcome acquired resistance to the BRAF inhibitor GSK2118436 dabrafenib, mediated by NRAS or MEK mutations Mol. Cancer Ther. 2012 11 909 920 10.1158/1535-7163.MCT-11-0989 22389471 22. Irvine M. Stewart A. Pedersen B. Boyd S. Kefford R. Rizos H. Oncogenic PI3K/AKT promotes the step-wise evolution of combination BRAF/MEK inhibitor resistance in melanoma Oncogenesis 2018 7 72 10.1038/s41389-018-0081-3 30237495 PMC6148266 23. Wee S. Jagani Z. Xiang K.X. Loo A. Dorsch M. Yao Y.-M. Sellers W.R. Lengauer C. Stegmeier F. PI3K pathway activation mediates resistance to MEK inhibitors in KRAS mutant cancers Cancer Res. 2009 69 4286 4293 10.1158/0008-5472.CAN-08-4765 19401449 24. Sedgwick P. Spearman’s rank correlation coefficient Bmj 2014 349 g7327 10.1136/bmj.g7327 25432873 25. Nunes L. Li F. Wu M. Luo T. Hammarström K. Torell E. Ljuslinder I. Mezheyeuski A. Edqvist P.-H. Löfgren-Burström A. Prognostic genome and transcriptome signatures in colorectal cancers Nature 2024 633 137 146 10.1038/s41586-024-07769-3 39112715 PMC11374687 26. Gao S. Tibiche C. Zou J. Zaman N. Trifiro M. O’Connor-McCourt M. Wang E. Identification and construction of combinatory cancer hallmark–based gene signature sets to predict recurrence and chemotherapy benefit in stage II colorectal cancer JAMA Oncol. 2016 2 37 45 10.1001/jamaoncol.2015.3413 26502222 27. Cercek A. Chatila W.K. Yaeger R. Walch H. Fernandes G.D.S. Krishnan A. Palmaira L. Maio A. Kemel Y. Srinivasan P. A Comprehensive Comparison of Early-Onset and Average-Onset Colorectal Cancers J. Natl. Cancer Inst. 2021 113 1683 1692 10.1093/jnci/djab124 34405229 PMC8634406 28. Yu J. Liu D. Sun X. Yang K. Yao J. Cheng C. Wang C. Zheng J. CDX2 inhibits the proliferation and tumor formation of colon cancer cells by suppressing Wnt/β-catenin signaling via transactivation of GSK-3β and Axin2 expression Cell Death Dis. 2019 10 26 10.1038/s41419-018-1263-9 30631044 PMC6328578 29. Zhai J. Chen H. Wong C.C. Peng Y. Gou H. Zhang J. Pan Y. Chen D. Lin Y. Wang S. ALKBH5 Drives Immune Suppression Via Targeting AXIN2 to Promote Colorectal Cancer and Is a Target for Boosting Immunotherapy Gastroenterology 2023 165 445 462 10.1053/j.gastro.2023.04.032 37169182 30. Cheng L.Z. Huang D.L. Tang Z.R. Zhang J.H. Xiong T. Zhou C. Zhang N.X. Fu R. Cheng Y.X. Wu Z.Q. Pharmacological targeting of Axin2 suppresses cell growth and metastasis in colorectal cancer Br. J. Pharmacol. 2023 180 3071 3091 10.1111/bph.16193 37461816 31. Liu H. Liu L. Liu Q. He F. Zhu H. LncRNA HOXD-AS1 affects proliferation and apoptosis of cervical cancer cells by promoting FRRS1 expression via transcription factor ELF1 Cell Cycle 2022 21 416 426 10.1080/15384101.2021.2020962 34985386 PMC8855874 32. Saiyin H. Na N. Han X. Fang Y. Wu Y. Lou W. Yang X. BRSK2 induced by nutrient deprivation promotes Akt activity in pancreatic cancer via downregulation of mTOR activity Oncotarget 2017 8 44669 44681 10.18632/oncotarget.17965 28591720 PMC5546509 33. Tamir T.Y. Drewry D.H. Wells C. Major M.B. Axtman A.D. PKIS deep dive yields a chemical starting point for dark kinases and a cell active BRSK2 inhibitor Sci. Rep. 2020 10 15826 10.1038/s41598-020-72869-9 32985588 PMC7522982 34. Neyazi M. Bharadwaj S.S. Bullers S. Varenyiova Z. Travis S. Arancibia-Cárcamo C.V. Powrie F. Geremia A. Overexpression of Cancer-Associated Stem Cell Gene OLFM4 in the Colonic Epithelium of Patients With Primary Sclerosing Cholangitis Inflamm. Bowel Dis. 2021 27 1316 1327 10.1093/ibd/izab025 33570127 PMC8314119 35. Liu W. Li H. Aerbajinai W. Botos I. Rodgers G.P. OLFM4-RET fusion is an oncogenic driver in small intestine adenocarcinoma Oncogene 2022 41 72 82 10.1038/s41388-021-02072-1 34675408 36. Zhi L. Zhao L. Zhang X. Liu W. Gao B. Wang F. Wang X. Wang G. SLCO1B3 promotes colorectal cancer tumorigenesis and metastasis through STAT3 Aging 2021 13 22164 22175 10.18632/aging.203502 34526411 PMC8507254 37. Sun R. Ying Y. Tang Z. Liu T. Shi F. Li H. Guo T. Huang S. Lai R. The Emerging Role of the SLCO1B3 Protein in Cancer Resistance Protein Pept. Lett. 2020 27 17 29 10.2174/0929866526666190926154248 31556849 PMC6978646 38. Hlaváč V. Václavíková R. Brynychová V. Ostašov P. Koževnikovová R. Kopečková K. Vrána D. Gatěk J. Souček P. Role of Genetic Variation in Cytochromes P450 in Breast Cancer Prognosis and Therapy Response Int. J. Mol. Sci. 2021 22 2826 10.3390/ijms22062826 33802237 PMC8001203 39. Chang M.T. Asthana S. Gao S.P. Lee B.H. Chapman J.S. Kandoth C. Gao J. Socci N.D. Solit D.B. Olshen A.B. Identifying recurrent mutations in cancer reveals widespread lineage diversity and mutational specificity Nat. Biotechnol. 2016 34 155 163 10.1038/nbt.3391 26619011 PMC4744099 40. Gao J. Chang M.T. Johnsen H.C. Gao S.P. Sylvester B.E. Sumer S.O. Zhang H. Solit D.B. Taylor B.S. Schultz N. 3D clusters of somatic mutations in cancer reveal numerous rare mutations as functional targets Genome Med. 2017 9 4 10.1186/s13073-016-0393-x 28115009 PMC5260099 41. Müller M.F. Ibrahim A.E.K. Arends M.J. Molecular pathological classification of colorectal cancer Virchows Arch. 2016 469 125 134 10.1007/s00428-016-1956-3 27325016 PMC4978761 42. Cohen R. Rousseau B. Vidal J. Colle R. Diaz L.A. André T. Immune Checkpoint Inhibition in Colorectal Cancer: Microsatellite Instability and Beyond Target. Oncol. 2020 15 11 24 10.1007/s11523-019-00690-0 31786718 43. De’ Angelis G.L. Bottarelli L. Azzoni C. De’ Angelis N. Leandro G. Di Mario F. Gaiani F. Negri F. Microsatellite instability in colorectal cancer Acta Biomed. 2018 89 97 101 30561401 10.23750/abm.v89i9-S.7960 PMC6502181 44. Rao C. Frodyma D.E. Southekal S. Svoboda R.A. Black A.R. Guda C. Mizutani T. Clevers H. Johnson K.R. Fisher K.W. KSR1-and ERK-dependent translational regulation of the epithelial-to-mesenchymal transition eLife 2021 10 e66608 10.7554/eLife.66608 33970103 PMC8195604 45. Neilsen B.K. Frodyma D.E. Lewis R.E. Fisher K.W. KSR as a therapeutic target for Ras-dependent cancers Expert. Opin. Ther. Targets 2017 21 499 509 10.1080/14728222.2017.1311325 28333549 PMC5490495 46. Zaidh S.M. Vengateswaran H.T. Habeeb M. Aher K.B. Bhavar G.B. Irfan N. Lakshmi K. Network pharmacology and AI in cancer research uncovering biomarkers and therapeutic targets for RALGDS mutations Sci. Rep. 2025 15 1 13 10.1038/s41598-025-91568-x 40157967 PMC11954960 47. Cui X. Shen K. Xie Z. Liu T. Zhang H. Identification of key genes in colorectal cancer using random walk with restart Mol. Med. Rep. 2017 15 867 872 10.3892/mmr.2016.6058 28000901 48. Li Q. Geng S. Luo H. Wang W. Mo Y.Q. Luo Q. Wang L. Song G.B. Sheng J.P. Xu B. Signaling pathways involved in colorectal cancer: Pathogenesis and targeted therapy Signal Transduct. Target. Ther. 2024 9 266 10.1038/s41392-024-01953-7 39370455 PMC11456611 49. Yang D. Liu J. Qian H. Zhuang Q. Cancer-associated fibroblasts: From basic science to anticancer therapy Exp. Mol. Med. 2023 55 1322 1332 10.1038/s12276-023-01013-0 37394578 PMC10394065 50. Glabman R.A. Choyke P.L. Sato N. Cancer-Associated Fibroblasts: Tumorigenicity and Targeting for Cancer Therapy Cancers 2022 14 3906 10.3390/cancers14163906 36010899 PMC9405783 51. Christofides A. Strauss L. Yeo A. Cao C. Charest A. Boussiotis V.A. The complex role of tumor-infiltrating macrophages Nat. Immunol. 2022 23 1148 1156 10.1038/s41590-022-01267-2 35879449 PMC10754321 52. Cassetta L. Pollard J.W. A timeline of tumour-associated macrophage biology Nat. Rev. Cancer 2023 23 238 257 10.1038/s41568-022-00547-1 36792751 53. Togashi Y. Shitara K. Nishikawa H. Regulatory T cells in cancer immunosuppression—Implications for anticancer therapy Nat. Rev. Clin. Oncol. 2019 16 356 371 10.1038/s41571-019-0175-7 30705439 54. Li C. Jiang P. Wei S. Xu X. Wang J. Regulatory T cells in tumor microenvironment: New mechanisms, potential therapeutic strategies and future prospects Mol. Cancer 2020 19 116 10.1186/s12943-020-01234-1 32680511 PMC7367382 55. Plitas G. Rudensky A.Y. Regulatory T cells in cancer Annu. Rev. Cancer Biol. 2020 4 459 477 10.1146/annurev-cancerbio-030419-033428 56. Long N.P. Lee W.J. Huy N.T. Lee S.J. Park J.H. Kwon S.W. Novel biomarker candidates for colorectal cancer metastasis: A meta-analysis of in vitro studies Cancer Inform. 2016 15 CIN.S40301 10.4137/CIN.S40301 27688707 PMC5034882 57. Olejniczak A. Szaryńska M. Kmieć Z. In vitro characterization of spheres derived from colorectal cancer cell lines Int. J. Oncol. 2018 52 599 612 10.3892/ijo.2017.4206 29207035 58. Ronen J. Hayat S. Akalin A. Evaluation of colorectal cancer subtypes and cell lines using deep learning Life Sci. Alliance 2019 2 e201900517 10.26508/lsa.201900517 31792061 PMC6892438 59. Deshmukh R. Prajapati M. Harwansh R.K. A review on emerging targeted therapies for the management of metastatic colorectal cancers Med. Oncol. 2023 40 159 10.1007/s12032-023-02020-x 37097307 60. Lee C.L. Cremona M. Farrelly A. Workman J.A. Kennedy S. Aslam R. Carr A. Madden S. O’Neill B. Hennessy B.T. Preclinical evaluation of the CDK4/6 inhibitor palbociclib in combination with a PI3K or MEK inhibitor in colorectal cancer Cancer Biol. Ther. 2023 24 2223388 10.1080/15384047.2023.2223388 37326340 PMC10281467 61. Carlos G. Anforth R. Clements A. Menzies A.M. Carlino M.S. Chou S. Fernandez-Peñas P. Cutaneous Toxic Effects of BRAF Inhibitors Alone and in Combination with MEK Inhibitors for Metastatic Melanoma JAMA Dermatol. 2015 151 1103 1109 10.1001/jamadermatol.2015.1745 26200476 62. Hsieh T.H. Hsu C.Y. Wu C.W. Wang S.H. Yeh C.H. Cheng K.H. Tsai E.M. Vorinostat decrease M2 macrophage polarization through ARID1A(6488delG)/HDAC6/IL-10 signaling pathway in endometriosis-associated ovarian carcinoma Biomed. Pharmacother. 2023 161 114500 10.1016/j.biopha.2023.114500 36958195 63. Berdeja J.G. Laubach J.P. Richter J. Stricker S. Spencer A. Richardson P.G. Chari A. Panobinostat From Bench to Bedside: Rethinking the Treatment Paradigm for Multiple Myeloma Clin. Lymphoma Myeloma Leuk. 2021 21 752 765 10.1016/j.clml.2021.06.020 34340951 64. Jenner M.W. Pawlyn C. Davies F.E. Menzies T. Hockaday A. Olivier C. Jones J.R. Karunanithi K. Lindsay J. Kishore B. The addition of vorinostat to lenalidomide maintenance for patients with newly diagnosed multiple myeloma of all ages: Results from ‘Myeloma XI’, a multicentre, open-label, randomised, phase III trial Br. J. Haematol. 2023 201 267 279 10.1111/bjh.18600 36541152 PMC10952726 65. Daina A. Michielin O. Zoete V. SwissADME: A free web tool to evaluate pharmacokinetics, drug-likeness and medicinal chemistry friendliness of small molecules Sci. Rep. 2017 7 42717 10.1038/srep42717 28256516 PMC5335600 66. Ertl P. Rohde B. Selzer P. Fast calculation of molecular polar surface area as a sum of fragment-based contributions and its application to the prediction of drug transport properties J. Med. Chem. 2000 43 3714 3717 10.1021/jm000942e 11020286 67. Yamamoto M. Fujiwara N. Protein phosphatase 6 regulates trametinib sensitivity, a mitogen-activated protein kinase kinase (MEK) inhibitor, by regulating MEK1/2-ERK1/2 signaling in canine melanoma cells J. Vet. Med. Sci. 2023 85 977 984 10.1292/jvms.23-0274 37495516 PMC10539826 68. Aaroe A. Kurzrock R. Goyal G. Goodman A.M. Patel H. Ruan G. Ulaner G. Young J. Li Z. Dustin D. Successful treatment of non-Langerhans cell histiocytosis with the MEK inhibitor trametinib: A multicenter analysis Blood Adv. 2023 7 3984 3992 10.1182/bloodadvances.2022009013 36857436 PMC10410131 69. Ballantyne A.D. Garnock-Jones K.P. Dabrafenib: First Global Approval Drugs 2013 73 1367 1376 10.1007/s40265-013-0095-2 23881668 70. Vasuki A. Christy H.J. Renugadevi K. Dammalli M. Structure-based pharmacophore modeling and DFT studies of Indian Ocean-derived red algal compounds as PI3Kα inhibitors Mol. Divers. 2023 28 2563 2581 10.1007/s11030-023-10695-7 37466805 71. Yang J. Friedman R. Combination strategies to overcome drug resistance in FLT(+) acute myeloid leukaemia Cancer Cell Int. 2023 23 161 37568211 10.1186/s12935-023-03000-x PMC10416533 72. Seeliger D. de Groot B.L. Ligand docking and binding site analysis with PyMOL and Autodock/Vina J. Comput.-Aided Mol. Des. 2010 24 417 422 10.1007/s10822-010-9352-6 20401516 PMC2881210 73. Egbuna C. Patrick-Iwuanyanwu K.C. Onyeike E.N. Khan J. Alshehri B. FMS-like tyrosine kinase-3 (FLT3) inhibitors with better binding affinity and ADMET properties than sorafenib and gilteritinib against acute myeloid leukemia: In silico studies J. Biomol. Struct. Dyn. 2022 40 12248 12259 10.1080/07391102.2021.1969286 34486940 74. Khan S.M. Faisal A.M. Nila T.A. Binti N.N. Hosen M.I. Shekhar H.U. A computational in silico approach to predict high-risk coding and non-coding SNPs of human PLCG1 gene PLoS ONE 2021 16 e0260054 10.1371/journal.pone.0260054 34793541 PMC8601573 75. Muzny D.M. Bainbridge M.N. Chang K. Dinh H.H. Drummond J.A. Fowler G. Kovar C.L. Lewis L.R. Morgan M.B. Newsham I.F. Comprehensive molecular characterization of human colon and rectal cancer Nature 2012 487 330 337 10.1038/nature11252 22810696 PMC3401966 76. Benmokhtar S. Laraqui A. Hilali F. Bajjou T. El Zaitouni S. Jafari M. Baba W. Elannaz H. Lahlou I.A. Hafsa C. RAS/RAF/MAPK pathway mutations as predictive biomarkers in middle eastern colorectal cancer: A systematic review Clin. Med. Insights Oncol. 2024 18 11795549241255651 10.1177/11795549241255651 38798959 PMC11128178 77. Voutsadakis I.A. PIK3CA mutated colorectal cancers without KRAS, NRAS and BRAF mutations possess common and potentially targetable mutations in epigenetic modifiers and DNA damage response genes Cancer Genom. Proteom. 2024 21 533 548 10.21873/cgp.20470 PMC11363921 39191495 78. Chuang J. Wang C. Guo Y. Valenzuela V. Wu J. Fakih M. MAP2K1 Mutations in Advanced Colorectal Cancer Predict Poor Response to Anti-EGFR Therapy and to Vertical Targeting of MAPK Pathway Clin. Colorectal. Cancer 2021 20 72 78 10.1016/j.clcc.2020.12.003 33436306 79. Fennell L.J. Kane A. Liu C. McKeone D. Fernando W. Su C. Bond C. Jamieson S. Dumenil T. Patch A.-M. APC mutation marks an aggressive subtype of BRAF mutant colorectal cancers Cancers 2020 12 1171 10.3390/cancers12051171 32384699 PMC7281581 80. Crielaard B.J. Lammers T. Rivella S. Targeting iron metabolism in drug discovery and delivery Nat. Rev. Drug Discov. 2017 16 400 423 10.1038/nrd.2016.248 28154410 PMC5455971 81. Bu X. Wang L. Iron metabolism and the tumor microenvironment: A new perspective on cancer intervention and therapy Int. J. Mol. Med. 2024 55 39 10.3892/ijmm.2024.5480 39749705 PMC11722052 82. Dong D. Zhang G. Yang J. Zhao B. Wang S. Wang L. Zhang G. Shang P. The role of iron metabolism in cancer therapy focusing on tumor-associated macrophages J. Cell. Physiol. 2019 234 8028 8039 10.1002/jcp.27569 30362549 83. Feng Y. Qiao S. Chen J. Wen X. Chen Y. Song X. Xu J. Qiao X. Yang J. Zhang S. M2-type macrophages and cancer-associated fibroblasts combine to promote colorectal cancer liver metastases OncoTargets Ther. 2024 17 243 260 10.2147/OTT.S447502 PMC10981424 38558848 84. Zhang R. Qi F. Zhao F. Li G. Shao S. Zhang X. Yuan L. Feng Y. Cancer-associated fibroblasts enhance tumor-associated macrophages enrichment and suppress NK cells function in colorectal cancer Cell Death Dis. 2019 10 273 10.1038/s41419-019-1435-2 30894509 PMC6426970 85. Martinelli E. Cremolini C. Mazard T. Vidal J. Virchow I. Tougeron D. Cuyle P.J. Chibaudel B. Kim S. Ghanem I. Real-world first-line treatment of patients with BRAF(V600E)-mutant metastatic colorectal cancer: The CAPSTAN CRC study ESMO Open 2022 7 100603 10.1016/j.esmoop.2022.100603 36368253 PMC9832736 86. Su Y.-H. Wu J.-S. Dai Y.-Z. Chen Y.-T. Lin Y.-X. Tzeng Y.-M. Liao J.-W. Anti-Oxidant, Anti-Mutagenic Activity and Safety Evaluation of Antrocin Toxics 2023 11 547 10.3390/toxics11060547 37368647 PMC10301922 87. Bartha Á. Győrffy B. TNMplot.com: A Web Tool for the Comparison of Gene Expression in Normal, Tumor and Metastatic Tissues Int. J. Mol. Sci. 2021 22 2622 10.3390/ijms22052622 33807717 PMC7961455 88. Tang Z. Kang B. Li C. Chen T. Zhang Z. GEPIA2: An enhanced web server for large-scale expression profiling and interactive analysis Nucleic Acids Res. 2019 47 W556 W560 10.1093/nar/gkz430 31114875 PMC6602440 89. Pepe G. Granieri C.N. Appierdo R. Ausiello G. Helmer-Citterich M. Gherardini P. PANDA: PAN cancer Data Analysis web tool J. Mol. Biol. 2025 437 169158 10.1016/j.jmb.2025.169158 40250704 90. Nagy Á. Győrffy B. muTarget: A platform linking gene expression changes and mutation status in solid tumors Int. J. Cancer 2021 148 502 511 10.1002/ijc.33283 32875562 91. de Bruijn I. Kundra R. Mastrogiacomo B. Tran T.N. Sikina L. Mazor T. Li X. Ochoa A. Zhao G. Lai B. Analysis and Visualization of Longitudinal Genomic and Clinical Data from the AACR Project GENIE Biopharma Collaborative in cBioPortal Cancer Res. 2023 83 3861 3867 10.1158/0008-5472.CAN-23-0816 37668528 PMC10690089 92. Gao J. Aksoy B.A. Dogrusoz U. Dresdner G. Gross B. Sumer S.O. Sun Y. Jacobsen A. Sinha R. Larsson E. Integrative analysis of complex cancer genomics and clinical profiles using the cBioPortal Sci. Signal 2013 6 pl1 10.1126/scisignal.2004088 23550210 PMC4160307 93. Cerami E. Correction: The cBio Cancer Genomics Portal: An Open Platform for Exploring Multidimensional Cancer Genomics Data Cancer Discov. 2012 2 960 10.1158/2159-8290.CD-12-0095 22588877 PMC3956037 94. Yaeger R. Chatila W.K. Lipsyc M.D. Hechtman J.F. Cercek A. Sanchez-Vega F. Jayakumaran G. Middha S. Zehir A. Donoghue M.T.A. Clinical Sequencing Defines the Genomic Landscape of Metastatic Colorectal Cancer Cancer Cell 2018 33 125 136.e3 10.1016/j.ccell.2017.12.004 29316426 PMC5765991 95. Giannakis M. Mu X.J. Shukla S.A. Qian Z.R. Cohen O. Nishihara R. Bahl S. Cao Y. Amin-Mansour A. Yamauchi M. Genomic Correlates of Immune-Cell Infiltrates in Colorectal Carcinoma Cell Rep. 2016 15 857 865 10.1016/j.celrep.2016.03.075 27149842 PMC4850357 96. Mondaca S. Walch H. Nandakumar S. Chatila W.K. Schultz N. Yaeger R. Specific Mutations in APC, but Not Alterations in DNA Damage Response, Associate With Outcomes of Patients With Metastatic Colorectal Cancer Gastroenterology 2020 159 1975 1978.e4 10.1053/j.gastro.2020.07.041 32730818 PMC7680360 97. Li J.-H. Liu S. Zhou H. Qu L.-H. Yang J.-H. starBase v2.0: Decoding miRNA-ceRNA, miRNA-ncRNA and protein–RNA interaction networks from large-scale CLIP-Seq data Nucleic Acids Res. 2013 42 D92 D97 10.1093/nar/gkt1248 24297251 PMC3964941 98. Liu C.J. Hu F.F. Xie G.Y. Miao Y.R. Li X.W. Zeng Y. Guo A.Y. GSCA: An integrated platform for gene set cancer analysis at genomic, pharmacogenomic and immunogenomic levels Brief. Bioinform. 2023 24 bbac558 10.1093/bib/bbac558 36549921 99. Shi H. Fang L. Tan C. Shi L. Zhang W. Li C.-C. Luo T. Yang Z. Total syntheses of drimane-type sesquiterpenoids enabled by a gold-catalyzed tandem reaction J. Am. Chem. Soc. 2011 133 14944 14947 10.1021/ja206837j 21861520 100. Lipinski C.A. Lombardo F. Dominy B.W. Feeney P.J. Experimental and computational approaches to estimate solubility and permeability in drug discovery and development settings Adv. Drug Deliv. Rev. 2001 46 3 26 10.1016/S0169-409X(00)00129-0 11259830 101. Roskoski R. Rule of five violations among the FDA-approved small molecule protein kinase inhibitors Pharmacol. Res. 2023 191 106774 10.1016/j.phrs.2023.106774 37075870 102. Trott O. Olson A.J. AutoDock Vina: Improving the speed and accuracy of docking with a new scoring function, efficient optimization, and multithreading J. Comput. Chem. 2010 31 455 461 10.1002/jcc.21334 19499576 PMC3041641 103. Ferreira L.G. Dos Santos R.N. Oliva G. Andricopulo A.D. Molecular Docking and Structure-Based Drug Design Strategies Molecules 2015 20 13384 13421 10.3390/molecules200713384 26205061 PMC6332083 104. Chen J.-H. Wu A.T.H. Tzeng D.T.W. Huang C.-C. Tzeng Y.-M. Chao T.-Y. Antrocin, a bioactive component from Antrodia cinnamomea, suppresses breast carcinogenesis and stemness via downregulation of β-catenin/Notch1/Akt signaling Phytomedicine 2019 52 70 78 10.1016/j.phymed.2018.09.213 30599914 105. Yu J. Xu Z. Guo J. Yang K. Zheng J. Sun X. Tumor-associated macrophages (TAMs) depend on MMP1 for their cancer-promoting role Cell Death Discov. 2021 7 343 10.1038/s41420-021-00730-7 34753916 PMC8578434 106. Yin J. Zhu W. Feng S. Yan P. Qin S. The role of cancer-associated fibroblasts in the invasion and metastasis of colorectal cancer Front. Cell Dev. Biol. 2024 12 1375543 10.3389/fcell.2024.1375543 39139454 PMC11319178 Figure 1 Workflow illustrating sequence from bioinformatics analysis of BRAF/MEK/PI3K to biological investigations of Antrocin inhibitory effects on CRC signaling pathway.Where asterisk (*) indicate level significance in Antrocin treated group compared to control group (* p p Figure 2 Overexpression of the BRAF/MEK/PI3K oncogenic signature in pan-cancer, tumor, and metastatic CRC. ( A C D F p G I Figure 3 Interplay correlation activities between colorectal cancer hallmarks and immune components that are key players in the tumor microenvironment (TME). In the heatmap, red color indicates intense correlation, while blue shows less correlation ( A p p B Figure 4 Gene Ontology of the BRAF/MEK/PI3K axis encompassing its protein–protein network and signaling pathways showcasing the biological function (BF) and molecular functions (MFs) at a false discovery rate (FDR) of less than or equal to 0.001 and cellular component (CC) at <0.05, which explains the rationale behind the proliferative potentials of BRAF/MEK/PI3K in CRC ( A B Figure 5 Association between BRAF/MEK/PI3K mutations and colon adenocarcinoma growth, survival, and metastasis. ( A C p D F p Figure 6 BRAF/MEK/PI3K mutations promote tumor aggressiveness, therapy resistance, and poor overall survival in CRC. ( A B D E F Figure 7 The BRAF/MEK/PI3K oncogenic signature is highly correlated and integral in proliferation, growth, and survival signaling pathways. ( A C p D E G Figure 8 BRAF/MEK/PI3K overexpression promotes the recruitment of pro-tumor immune cells in colorectal cancer. A hypothesis that this proliferative protein axis is shown to significantly increase macrophages, NK cells, CD8_T, and dendritic cells (DCs) (which are immune components responsible for CRC tumor microenvironment activities) more in mutant than wild types. Figure 9 Highlighting the tissue expression effects of BRAF/MEK/PI3K in CRC compared to normal cells, this illustration explains the potentials of this axis to develop cancerous lesions in the colon as obtained from patient immunohistochemistry data published in the human protein atlas data page. ( A B Figure 10 BRAF/MEK/PI3K overexpression is associated with multidrug resistance in colorectal cancer. ( A B C Figure 11 Antrocin met the drug-likeness, pharmacokinetics (PKs), ADME, and toxicity evaluation standards for small compounds. ( A B Figure 12 3D and 2D structures of Antrocin’s binding affinity on BRAF, MEK, and PI3K where green indicate hydrogen bonding and purple alkyl bonds. ( A D B E C F Figure 13 Binding interactions of the standard inhibitors with BRAF/MEK/PI3K, hydrogen bond is indicated green, alkyl bond in purple color, blue for halogen bond while orange shows electrostatic bonding. ( A D B E C F Figure 14 In vitro validation of Antrocin’s anti-CRC functions with higher number of asterisk (*) indicating the higher degree of significance. ( A B C D p p p p E Figure 15 Antrocin shows significant anti-tumor activity in colorectal cancer xenograft models. ( A n p B p C p p ijms-26-08780-t001_Table 1 Table 1 Tabulated cancer hallmarks of BRAF/MEK/PI3K showing significant p Term p Adj. p Genes Sustaining proliferative signaling 0.013518 0.015019988 BRAF/MAP2K1/PIK3CA Genome instability 0.1420924 0.14209238 MAP2K1 Evading growth suppressors 0.0105248 0.013155949 BRAF/MAP2K1/PIK3CA Evading immune destruction 0.000124 0.000372266 BRAF/MAP2K1/PIK3CA Sustained angiogenesis 0.0001489 0.000372266 BRAF/MAP2K1/PIK3CA Tissue invasion and metastasis 0.0036863 0.005551356 BRAF/MAP2K1/PIK3CA Tumor-promoting inflammation 0.0001342 0.000372266 BRAF/MAP2K1/PIK3CA Resisting cell death 0.0021638 0.00432761 BRAF/MAP2K1/PIK3CA Reprogramming energy metabolism 0.0001196 0.000372266 BRAF/MAP2K1/PIK3CA Replicative immortality 0.0038859 0.005551356 MAP2K1/PIK3CA ijms-26-08780-t002_Table 2 Table 2 A summary of physicochemical properties, pharmacokinetics, drug-likeness, and medical chemistry of Antrocin. Formula and SMILE of Antrocin Physicochemical Properties Aqueous Solubility Pharmacokinetics and Absorption Drug-Likeness Toxicity Formula: C 15 22 2 Molecular weight: 234.33g/mol Log S (Ali): BBB permanent: Yes 2 Lipinski: Yes hERG blocking: (0–0.1): poor ijms-26-08780-t003_Table 3 Table 3 Detailed molecular docking results of Antrocin on BRAF/MEK/PI3K. The tabulated docking results consist of the Gibbs free energies of this interaction, the interacting amino acid on the receptor, binding distances, and bond types involved. Proteins and Gibbs Free Energy Protein Interaction Site and Bonding Proximity Bond Type BRAF [ΔG = −8.5 kcal/mol] CYS532 (3.53 Å), ALA481, VAL471, LEU514 Alkyl  TRP531, PHE595, PHE583 Pi–Alkyl MEK [ΔG = −7.3 kcal/mol] SER212 (3.00 Å), VAL211 (3.12 Å) Conventional hydrogen  LEU115, LEU215, ILE99, ILE111, ILE139 Alkyl PI3K [ΔG = −6.9 kcal/mol] LYS298 (3.77 Å), LEU211, ARG294 Alkyl  HIS295, TRP201, TYR210 Pi–Alkyl ",
  "metadata": {
    "Title of this paper": "The role of cancer-associated fibroblasts in the invasion and metastasis of colorectal cancer",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469948/"
  }
}