{
  "title": "Paper_440",
  "abstract": "pmc J Extracell Biol J Extracell Biol 4594 jebiol JEX2 Journal of Extracellular Biology 2768-2811 Wiley PMC12479721 PMC12479721.1 12479721 12479721 41035483 10.1002/jex2.70090 JEX270090 1 Research Article Research Article Generalizability of Enzyme‐Based Isolation Approach for Extracellular Vesicles From Traditional Medicinal Plants Wang Qian  1 Jing Renwei  1 Cao Nan  1 He Xingjie  1 Yang Zhongqiu  1 Zhang Leijie  1 Liu Yi  2 Chen Ruibing  2 Xiang Beibei  3 Xie Xiaodong  4 xiex@tjau.edu.cn Yin HaiFang https://orcid.org/0000-0001-8774-2864  1 haifangyin@tmu.edu.cn   1 State Key Laboratory of Experimental Hematology & The Province and Ministry Co‐sponsored Collaborative Innovation Center for Medical Epigenetics & Schools of Medical Technology & Basic Medical Sciences Tianjin Medical University Tianjin China   2 School of Pharmaceutical Science and Technology Tianjin University Tianjin China   3 School of Chinese Material Medica Tianjin University of Traditional Chinese Medicine Tianjin China   4 Tianjin Key Laboratory of Intelligent Breeding of Major Crops College of Agronomy and Resources and Environment Tianjin Agricultural University Tianjin China 29 9 2025 10 2025 4 10 497859 10.1002/jex2.v4.10 e70090 06 7 2025 07 4 2025 09 9 2025 29 09 2025 01 10 2025 02 10 2025 © 2025 The Author(s). Journal of Extracellular Biology https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Extracellular vesicles (EVs) from plants, particularly traditional medicinal plants, have garnered therapeutic interest. However, therapeutic utility requires establishing effective extraction and purification protocols for manufacturing. Here, we systemically optimized an enzyme‐based EV extraction method and demonstrated the generalizability with different parts from seventeen medicinal plants, fresh, frozen or dried. The enzymatic pulping process (henceforth denoted as Phyto‐EVpure) of fresh ginger, Morus alba Isatis indigotica Fort enzyme EVs phloem Phyto‐EVpure traditional medicinal plant xylem National Natural Science Foundation of China 10.13039/501100001809 82030054 82320108013 Beijing‐Tianjin‐Hebei Basic Research Cooperation Project (no. 22JCZXJC00020) Natural Science Foundation of Tianjin (No. 22JCYBJC00010) Tianjin the Belt and Road Project (Grant No. 18JCQNJ C79400) Tianjin Municipal 14th Five‐Year Plan ( Tianjin Medical University Talent Project). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:30.09.2025  Wang Q. R. Jing N. Cao 2025 Generalizability of Enzyme‐Based Isolation Approach for Extracellular Vesicles From Traditional Medicinal Plants Journal of Extracellular Biology 4 10 e70090 10.1002/jex2.70090 Qian Wang, Renwei Jing and Nan Cao contributed equally to this study.  Funding 1 Introduction Plant extracellular vesicles (EVs) play vital roles in physiological processes and defence against invaders in plants (Cai et al. 2018 2022 2021 2021 2016b 2023 2023 The commercial development of plant EVs is still in its infancy, and affordable, scalable protocols for high‐quality EV isolation are lacking. Unlike mammalian EVs (Janouskova et al. 2022 2022 2020 2021 2022 2022 2017 2023 2023 Here, we systematically optimized and developed a robust enzyme‐based pulping method for a wide spectrum of traditional medicinal plants spanning seventeen species and different plant parts and denoted this approach as Phyto‐EVpure. This approach includes EV depletion from enzymes, usage of optimal antibacterial reagents, and optimized reaction conditions for different medicinal plants under different conditions and verified its generalizability in 17 different medicinal plants. Importantly, EVs obtained from fresh ginger via Phyto‐EVpure under optimized conditions preserved membrane protein activity, showing greater yield and purity than those obtained by grinding. Ginger EVs containing unsaturated fatty acids mitigated fatty acid deposition in a non‐alcoholic fatty liver disease (NAFLD) model in vitro and in vivo. Phyto‐EVpure enabled the robust and efficient isolation of EVs from 17 traditional medicinal plants and their fresh, frozen, and dried parts. Isolation of EVs from dried vine samples, such as Marsdenia tenacissima (Roxb.) Wight et Arn Tripterygium wilfordii Hook. F 2 Materials and Methods 2.1 Animals Adult C57BL/6 2.2 High‐Fat Diet‐Induced Non‐Alcoholic Fatty Liver Disease (NAFLD) Mouse Models Mice with NAFLD were established as described previously (Zhuang et al. 2015 C57BL/6 11 2017 2020 2016a 2.3 Cell Culture The human bronchial epithelial cell BEAS‐2B cell line was kindly provided by Prof. Jun Chen (Tianjin Medical University General Hospital, Tianjin, China) and was cultured as previously described (Lee and Ryu 2023 2015 2016 2020 2 2.4 Preparation of Enzyme Solutions All enzymes were purchased from the same company to avoid variability, and the activity was tested prior to use. Cellulase ( M29335 S10007 JS334544 2 2024 g g g 2.5 Isolation of EVs From Ginger by Grinding EVs were isolated from ginger by the grinding method, which was conducted as described previously (Zhang et al. 2016a g g g g g 2016 2015 g 2.6 Isolation of EVs From Different Medicinal Plants Pulped With Phyto‐EVpure The plants were sterilized as described previously (Tewelde et al. 2020 3 M34056 2 2 2 To optimize the enzyme concentration, PS‐sterilized plant pieces were submerged in EV‐depleted enzyme solutions containing 1% PS and different concentrations of cellulase (C) and pectinase (P) with EV depleted including 1.0% C+0.5% P, 1.0% C+ 0.25% P, 0.75% C+0.25% P, 0.5% C+0.5% P, 0.5% C+0.25% P, 0.25% C+0.25% P, 0.25% C+0.125% P and 0.16% C+0.08% P, and incubated at 37°C for 6 h in the dark. Subsequently, the digested mixture was filtered through gauze to remove large plant tissue debris, and the supernatant was centrifuged at 3000 × g g g Morus alba Isatis indigotica Fort 2 3 EVs isolated from dried Marsdenia tenacissima (Roxb.) Wight et Arn 2 2022 2019 2018 2.7 Characterization of Plant EVs Plant EVs were characterized according to guidelines for mammalian EVs (Pinedo et al. 2021 2024 2018 2 2 2.8 Purity Measurement of Different EVs EV purity was measured as described previously (Gao et al. 2018 2020 2.9 Labelling of Plant EVs Plant EVs were labelled with DiR (APC‐Cy7) ( D12731 2.10 Cellular Uptake Cellular uptake of plant EVs was measured as described previously (Zhao et al. 2023 5 9 Marsdenia tenacissima (Roxb.) Wight et Arn Tripterygium wilfordii Hook. F 9 2.11 Water Permeability Assay To measure the water permeability of fresh ginger EVs, their osmotic responses were monitored, as described previously (Eto et al. 2010 2009 3 2002 Y ae −kt k Y 2.12 Tissue Distribution Tissue distribution of ginger‐EVs was measured as described previously (Gupta et al. 2020 2023 C57BL/6 n 12 2.13 Pharmacokinetic Assay Pharmacokinetic assays were performed as described previously (Hwang et al. 2019 C57BL/6 12 g 2.14 In Vitro Assay for Hepatic Steatosis An in vitro assay for liver cell steatosis in vitro was performed as described previously (Xia et al. 2019 10 2.15 Histological Analysis For hematoxylin and eosin (H&E) staining, liver tissues fixed in 4% PFA were embedded in paraffin, cut into 4 µm serial sections, and subjected to H&E staining according to the manufacturer's instructions (Beyotime, China). To examine lipid droplets, liver tissues were dehydrated in 15% sucrose solution, cryosectioned to 8–10 µm, and stained with oil red. The tissue sections were observed under a bright‐field microscope (Olympus BX51, Japan). 2.16 Measurement of Hepatic TG Levels Liver triglyceride (TG) content was determined using chloroform‐methanol extraction as described previously (Tsai et al. 2022 g g 2 2.17 Biochemical Analysis Serum was obtained from the treated or control mice, and aspartate aminotransferase (AST), alanine aminotransferase (ALT), and total cholesterol (TC) levels were measured in the clinical pathology laboratory (Tianjin Medical University, Tianjin, China). 2.18 Simulated Gastrointestinal Digestion Artificial digestive fluids were formulated as previously (Minekus et al. 2014 + + − 2 4 − 3 − 2+ 4 + 2+ + + − 2 4 − 3 − 2+ 2+ 11 2025 2024 2.19 Annexin V and Propidium Iodide (PI) Staining Apoptosis was assessed using an Annexin V/Propidium Iodide (PI) dual‐staining kit (Sungene Biotech, Tianjin, China) in accordance with the manufacturer's standardized protocol. Briefly, human A549 cells (1 × 10 5 10 2.20 3‐(4,5‐Dimethylthiazol‐2‐yl)‐2,5‐Diphenyltetrazolium Bromide (MTT) Assay MTT assay was used to determine the cytotoxicity of plant EVs derived from the phloem and xylem in vitro (Fu et al. 2019 10 2.21 Transwell Assay Cell migration capacity was quantitatively evaluated using polycarbonate membrane inserts (8 µm porosity, Merck Millipore, Burlington, MA, USA) in 12‐well culture systems (Corning, MA, USA). Human A549 cells (2 × 10 5 10 2 2.22 Liquid Chromatography Tandem Mass Spectrometry (LC‐MS/MS) Analysis Ginger‐derived extracellular vesicles (30 µg) were subjected to tryptic digestion using an optimized filter‐aided sample preparation (FASP) method (Wang et al. 2022 2 6 2.23 Proteomic Data Analysis Label‐free quantification was performed using DIA‐NN (v1.8) with the following parameters: precursor FDR≤1% (target decoy approach), tryptic digestion allowance (one missed cleavage), mass tolerance of 10 ppm (MS/MS), fixed carbamidomethylation (Cys), and variable oxidation (Met). Swiss‐Prot and TrEMBL FASTA databases for Zingiber officinale (Ginger) (Amomum zingiber) (library contains 71856 proteins) were downloaded from UniPort ( https://www.uniprot.org/ 2022 2019 2.24 Lipid Extraction and LC‐MS/MS Analysis Lipidomics analysis was conducted by Beijing Allwegene Technology Company Ltd. (Beijing, China). Lipids were extracted from ginger EVs (5×10 10 2008 g g 2.25 Statistical Analysis Data are expressed as mean ± SEM. Intergroup comparisons were analyzed using SigmaStat 3.5 (Systat Software Inc., USA), with statistical significance defined at p α 3 Results 3.1 Optimization of Phyto‐EVpure Workflow for Plant EV Isolation To develop Phyto‐EVpure, we selected ginger, a commonly used Chinese medicinal plant (Zhu and He 2023 1a 1b 2015 1c S1a 2023 2023 2023 2023 1d FIGURE 1 Stepwise optimization for Phyto‐EVpure. (a) Representative transmission electron microscopic (TEM) images for EVs derived from cellulase and pectinase solution via ultracentrifugation (scale bar = 200 nm). (b) Flow cytometry to assess lipid vesicles and non‐lipid vesicles (forward scatter versus side scatter (FSC/SSC)) of enzyme‐derived EVs before or after treatment with 1% Triton X‐100 ( n p t 2 2, Minimizing any possible contamination without disrupting the EVs is a prerequisite for the isolation of high‐quality EVs. To this end, we tested different detergents and antibacterial reagents for ginger sample processing using Phyto‐EVpure. As expected, no contamination was found in the enzyme buffer; however, bacterial colonies grew in the buffer after addition of ginger and incubation for 4 h (Figure 1e 2023 2 2, 2 2 1e 2018 1f S1b 2015 3.2 Phyto‐EVpure Enables Efficient Ginger EV Isolation Without Altering Intrinsic Properties Next, we optimized the reaction conditions for ginger by starting with different concentrations of cellulase and pectinase and digestion for 6 h. More complete digestion was observed with 1.0% cellulase and 0.5% pectinase than with other concentrations, as reflected by the lower amounts of filamentous materials (Figure S2a 2a 2b 2c 2d 2016 2015 2e–g 2h S2b FIGURE 2 Effect of enzyme reaction time on and characterization of ginger EVs. (a) Representative TEM images for EVs purified by ultracentrifugation after ginger was digested in 1% cellulase and 0.5% pectinase for different timepoints (scale bar = 200 nm). Representative TEM images (b) and size distribution with NTA (c) of ginger EVs purified by ultracentrifugation with ginger pulped either with grinding or Phyto‐EVpure (scale bar = 200 nm). (d) Flow cytometry to assess the morphological parameters (forward scatter versus side scatter [FSC/SSC]) of ginger EVs before or after treatment with 1% Triton X‐100 ( n p t n p t To investigate whether the degradation enzymes in Phyto‐EVpure affected the surface properties and, consequently, the tropism of plant EVs, we labeled equal particles of ginger EVs processed via Phyto‐EVpure or grinding and purified by sucrose gradient ultracentrifugation. As hepatocytes and bronchial epithelial cells have been extensively employed for testing systemic (hepatic) and local (pulmonary) EV delivery (Cao et al. 2019 2009 2024 2025 2021 2025 2020 3a,b 3c C57BL/6 12 Ginseng 2019 2013 3d,e 3f S3a 2016 2015 3g S3b FIGURE 3 In vitro and in vivo evaluation of EVs isolated from ginger processed with Phyto‐EVpure. (a) Flow cytometry to examine the labelling efficiency of EVs obtained from ginger processed with Phyto‐EVpure or grinding. (b) Cellular uptake of DiR (APC‐Cy7)‐labelled ginger EVs in human hepatocytes and bronchial epithelial cells ( n n max 3.3 Ginger EVs Processed via Phyto‐EVpure Preserve Biological Activities To determine the effect of Phyto‐EVpure on the proteomic and lipidomic profiles of ginger EVs, we performed Liquid Chromatography with tandem mass spectrometry (LC‐MS/MS) and lipidomic analysis. Consistent with previous observations (Kalarikkal et al. 2020 2016a 2018 S4 2016 4a 2015 2009 2010 3 4b 2024 FIGURE 4 Proteomic and lipidomic profiling and functional validation of EVs from ginger processed with Phyto‐EVpure or grinding. (a) Quantitative analysis of proteins identified in ginger EVs via proteomic analysis, in which ginger was processed with Phyto‐EVpure or grinding ( n p p t n n n p Unsurprisingly, a similar lipidomic profile was observed for ginger EVs processed via both methods, with phosphatidic acid (PA) ranking the highest, followed by monogalactosyl mono‐acylglycerol (MGDG), digalactosyldiacylglycerol (DGDG), phosphatidylinositol (PI), and phosphatidylcholine (PC) (Figure 4c 2016 2015 2022 2015 2017 2022 4d,e 4f 2014 4g 3.4 Phyto‐EVpure Is Applicable to Traditional Medicinal Plants Under Different Conditions To further explore the generalizability of Phyto‐EVpure, we tested fresh Morus alba Isatis indigotica Fort Morus alba Isatis indigotica Fort 5a Lonicera macranthoides Hand.‐Mazz Houttuynia cordata Thunb Koelreuteria paniculata Laxm Polygonum multiflorum Thunb Sophora flavescens Salvia miltiorrhiza Bge 5b S5a Salvia miltiorrhiza Bunge 5c 2022 Morus alba 5d,e S5b Isatis indigotica Fort 5f,g Marsdenia tenacissima (Roxb.) Wight et Arn Tripterygium wilfordii Hook. F 2015 2006 2017 2023 2018 2018 2012 2023 2022 2021 2020 S5c S5d Marsdenia tenacissima (Roxb.) Wight et Arn 5h Spatholobus suberectus Dunn Tinospora sinensis (Lour.) Merr Polygonum multiflorum Thunb Tripterygium wilfordii Hook. F 5i Spatholobus suberectus Dunn Marsdenia tenacissima Tripterygium wilfordii Spatholobi caulis 5j FIGURE 5 Optimization of reaction conditions for EVs from leaves, roots and dried vine samples via Phyto‐EVpure. Representative TEM images EVs from Morus alba Isatis indigotica fort Lonicera macranthoides Hand.‐Mazz Houttuynia cordata Thunb Koelreuteria paniculata Laxm Polygonum multiflorum Thunb Sophora flavescens Salvia miltiorrhiza Bge n Morus alba Isatis indigotica Fort. roots n p t Marsdenia tenacissima (Roxb.) Wight et Arn Spatholobus suberectus Dunn Marsdenia tenacissima (Roxb.) Wight et Arn Tinospora sinensis(Lour.)Merr.; Polygonum multiflorum Thunb Tripterygium wilfordii Hook. F 3.5 EVs From Phloem of Dried Vine Samples Show Potent Antitumour Activities In Vitro Considering that xylem and phloem are two major vascular subsystems of vines with different functions (Jyske and Hölttä 2015 2022 2019 S6 Marsdenia tenacissima (Roxb.) Wight et Arn Tripterygium wilfordii Hook. F 6a–c Tripterygium wilfordii Hook. F Marsdenia tenacissima (Roxb.) Wight et Arn 6a,b 6d 6e,f Marsdenia tenacissima (Roxb.) Wight et Arn Tripterygium wilfordii Hook. F 2024 2018 6g 6h,i 6j,k Marsdenia tenacissima (Roxb.) Wight et Arn Tripterygium wilfordii Hook. F Marsdenia tenacissima (Roxb.) Wight et Arn FIGURE 6 Characterization and in vitro evaluation of EVs from phloem and xylem of dried vine samples processed via Phyto‐EVpure. Representative TEM images (a) and size distribution with NTA (b) and yield comparison (c) of EVs from phloem and xylem of dried Marsdenia tenacissima (Roxb.) Wight et Arn Tripterygium wilfordii Hook. F n p p t 4 Discussion Although medicinal plant EVs have emerged as a new therapeutic modality, a unified sample processing protocol that enables scalable production in the same manufacturing facility is lacking, particularly for the pulping step unique to plant EV isolation (Nemati et al. 2022 2025 2004 2006 1967 2024 2024 Although pectinase and cellulase were previously used for sample processing of fresh Morinda officinalis Catharanthus roseus 2023 2023 2019 The EVs isolated from Marsdenia tenacissima (Roxb.) Wight et Arn Marsdenia tenacissima (Roxb.) Wight et Arn 2018 Marsdenia tenacissima (Roxb.) Wight et Arn Marsdenia tenacissima (Roxb.) Wight et Arn 2016 Marsdenia tenacissima (Roxb.) Wight et Arn Overall, we established an optimized and standardized pulping protocol (Phyto‐EVpure) for the isolation of high‐quality plant EVs in a stepwise manner and demonstrated its generalizability to 17 species and different parts under different conditions, thus accelerating the commercial manufacturing and therapeutic use of plant EVs. Author Contributions  Qian Wang Renwei Jing Nan Cao Zhongqiu Yang Leijie Zhang Yi Liu Ruibing Chen Beibei Xiang Xiaodong Xie HaiFang Yin Ethics Statement All animal experiments were carried out in the Animal Unit of Tianjin Medical University (Tianjin, China), according to procedures authorized by the Institutional Ethical Committee (Permit Number: SYXK2023‐0004). Consent Mice were sacrificed by cervical dislocation at the desired time points. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Supplementary Materials  Supplementary Figure 1  Supplementary Figure 2  Supplementary Figure 3  Supplementary Figure 4  Supplementary Figure 5  Supplementary Figure 6 Acknowledgements The authors thank Dr. Yiqi Seow (Genome Institute of Singapore (GIS), Agency for Science, Technology and Research [A*STAR], Singapore) for the critical review of the manuscript, and the Core facility of Research Center of Basic Medical Sciences (Tianjin Medical University, Tianjin) for technical support, specifically TEM and flow cytometry core facilities. Data Availability Statement The Proteomic datasets generated and analyzed in the current study are available in the ProteomeXchange Consortium repository [ https://proteomecentral.Proteomexchange.org References An Q. K. Ehlers K.‐H. Kogel A. J. van Bel R. Hückelhoven 2006 Multivesicular Compartments Proliferate in Susceptible and Resistant MLA12 New Phytologist 172 3 563 576 17083686 10.1111/j.1469-8137.2006.01844.x Anderson C. T. J. Pelloux 2025 The Dynamics, Degradation, and Afterlives of Pectins: Influences on Cell Wall Assembly and Structure, Plant Development and Physiology, Agronomy, and Biotechnology Annual Review of Plant Biology 76 1 85 113 10.1146/annurev-arplant-083023-034055 39841930 Astry B. S. H. Venkatesha A. Laurence 2015 Celastrol, a Chinese Herbal Compound, Controls Autoimmune Inflammation by Altering the Balance of Pathogenic and Regulatory T Cells in the Target Organ Clinical Immunology 157 2 228 238 25660987 10.1016/j.clim.2015.01.011 PMC4410084 Bounda G.‐A. W. Zhou D.‐D. Wang F. Yu 2015 Rhein Elicits In Vitro Cytotoxicity in Primary Human Liver HL‐7702 Cells by Inducing Apoptosis Through Mitochondria‐Mediated Pathway Evidence‐Based Complementary and Alternative Medicine: eCAM 2015 329831 26221172 10.1155/2015/329831 PMC4484835 Cai Q. L. Qiao M. Wang 2018 Plants Send Small RNAs in Extracellular Vesicles to Fungal Pathogen to Silence Virulence Genes Science 360 6393 1126 1129 29773668 10.1126/science.aar4142 PMC6442475 Cao M. N. Diao X. Cai 2023 Plant Exosome Nanovesicles (PENs): Green Delivery Platforms Materials Horizons 10 10 3879 3894 37671650 10.1039/d3mh01030a Cao M. H. Yan X. Han 2019 Ginseng‐Derived Nanoparticles Alter Macrophage Polarization to Inhibit Melanoma Growth Journal for ImmunoTherapy of Cancer 7 1 326 31775862 10.1186/s40425-019-0817-4 PMC6882204 Chen A. B. He H. Jin 2022 Isolation of Extracellular Vesicles From Arabidopsis Current Protocols 2 1 e352 35030291 10.1002/cpz1.352 PMC8931852 Chen T. J. Ma Y. Liu 2022 iProX in 2021: Connecting Proteomics Data Sharing With Big Data Nucleic Acids Research 50 D1 D1522 D1527 34871441 10.1093/nar/gkab1081 PMC8728291 Chen X. L. Yang O. M. Zack Howard J. J. Oppenheim 2006 Dendritic Cells as a Pharmacological Target of Traditional Chinese Medicine Cellular & Molecular Immunology 3 6 401 410 17257493 Cong M. S. Tan S. Li 2022 Technology Insight: Plant‐Derived Vesicles‐How Far From the Clinical Biotherapeutics and Therapeutic Drug Carriers? Advanced Drug Delivery Reviews 182 March 114108 34990792 10.1016/j.addr.2021.114108 Dad H. A. T.‐W. Gu A.‐Q. Zhu L. Q. Huang L. H. Peng 2021 Plant Exosome‐Like Nanovesicles: Emerging Therapeutics and Drug Delivery Nanoplatforms Molecular Therapy: The Journal of the American Society of Gene Therapy 29 1 13 31 33278566 10.1016/j.ymthe.2020.11.030 PMC7791080 Dadaci Z. F. Kılınç T. T. Ozer G. O. Sahin N. O. Acir M. Borazan 2015 Periodic Acid‐Schiff Staining Demonstrates Fungi in Chronic Anterior Blepharitis Eye 29 12 1522 1527 26293142 10.1038/eye.2015.144 PMC5129786 Dai X. Y. Ji P. Jiang X. Sun 2017  Marsdenia tenacissima Oncology Letters 13 5 2897 2902 28521395 10.3892/ol.2017.5831 PMC5431395 Deng Z. Y. Rong Y. Teng 2017 Broccoli‐Derived Nanoparticle Inhibits Mouse Colitis by Activating Dendritic Cell AMP‐Activated Protein Kinase Molecular Therapy 25 7 1641 1654 28274798 10.1016/j.ymthe.2017.01.025 PMC5498816 Doi R. H. A. Kosugi 2004 Cellulosomes: Plant‐Cell‐Wall‐Degrading Enzyme Complexes Nature Reviews Microbiology 2 7 541 551 15197390 10.1038/nrmicro925 Eto K. Y. Noda S. Horikawa S. Uchida S. Sasaki 2010 Phosphorylation of Aquaporin‐2 Regulates Its Water Permeability The Journal of Biological Chemistry 285 52 40777 40784 20971851 10.1074/jbc.M110.151928 PMC3003378 Feng J. Q. Xiu Y. Huang Z. Troyer B. Li L. Zheng 2023 Plant‐Derived Vesicle‐Like Nanoparticles as Promising Biotherapeutic Tools: Present and Future Advanced Materials 35 24 e2207826 36592157 10.1002/adma.202207826 Fu X.‐T. K. Song J. Zhou 2019 Tumor‐Associated Macrophages Modulate Resistance to Oxaliplatin via Inducing Autophagy in Hepatocellular Carcinoma Cancer Cell International 19 71 30962765 10.1186/s12935-019-0771-8 PMC6434873 Gao X. N. Ran X. Dong 2018 Anchor Peptide Captures, Targets, and Loads Exosomes of Diverse Origins for Diagnostics and Therapy Science Translational Medicine 10 444 eaat0195 29875202 10.1126/scitranslmed.aat0195 Grasselli E. L. Canesi P. Portincasa A. Voci L. Vergani I. Demori 2017 Models of Non‐Alcoholic Fatty Liver Disease and Potential Translational Value: The Effects of 3,5‐L‐Diiodothyronine Annals of Hepatology 16 5 707 719 28809727 10.5604/01.3001.0010.2713 Gupta D. X. Liang S. Pavlova 2020 Quantification of Extracellular Vesicles In Vitro and In Vivo Using Sensitive Bioluminescence Imaging Journal of Extracellular Vesicles 9 1 1800222 32944187 10.1080/20013078.2020.1800222 PMC7481830 Halperin W. W. A. Jensen 1967 Ultrastructural Changes During Growth and Embryogenesis in Carrot Cell Cultures Journal of Ultrastructure Research 18 3–4 428 443 6025110 10.1016/s0022-5320(67)80128-x Han M.‐L. Y.‐F. Zhao C.‐H. Tan 2016 Cathepsin L Upregulation‐Induced EMT Phenotype Is Associated With the Acquisition of Cisplatin or Paclitaxel Resistance in A549 Cells Acta Pharmacologica Sinica 37 12 1606 1622 27840408 10.1038/aps.2016.93 PMC5309731 Han X. T. Na T. Wu B. Z. Yuan 2020 Human Lung Epithelial BEAS‐2B Cells Exhibit Characteristics of Mesenchymal Stem Cells PLoS ONE 15 1 e0227174 31900469 10.1371/journal.pone.0227174 PMC6941928 Hwang D. W. M. J. Jo J. H. Lee 2019 Chemical Modulation of Bioengineered Exosomes for Tissue‐Specific Biodistribution Advanced Therapeutics 2 11 1900111 32318623 10.1002/adtp.201900111 PMC7172497 Janouskova O. R. Herma A. Semeradtova 2022 Conventional and Nonconventional Sources of Exosomes‐Isolation Methods and Influence on Their Downstream Biomedical Application Frontiers in Molecular Biosciences 9 May 846650 35586196 10.3389/fmolb.2022.846650 PMC9110031 Jiang S. L. Qiu Y. Li 2016 Effects of Marsdenia tenacissima Carbohydrate Polymers 137 February 52 58 26686104 10.1016/j.carbpol.2015.10.056 Jurgielewicz B. J. Y. Yao S. L. Stice 2020 Kinetics and Specificity of HEK293T Extracellular Vesicle Uptake Using Imaging Flow Cytometry Nanoscale Research Letters 15 1 170 32833066 10.1186/s11671-020-03399-6 PMC7445225 Jyske T. T. Hölttä 2015 Comparison of Phloem and Xylem Hydraulic Architecture in Picea Abies Stems New Phytologist 205 1 102 115 25124270 10.1111/nph.12973 Kalarikkal S. P. D. Prasad R. Kasiappan S. R. Chaudhari G. M. Sundaram 2020 A Cost‐Effective Polyethylene Glycol‐Based Method for the Isolation of Functional Edible Nanoparticles From Ginger Rhizomes Scientific Reports 10 1 4456 32157137 10.1038/s41598-020-61358-8 PMC7064537 Kapil S. P. K. Singh O. Silakari 2018 An Update on Small Molecule Strategies Targeting Leishmaniasis European Journal of Medicinal Chemistry 157 September 339 367 30099256 10.1016/j.ejmech.2018.08.012 Kumar A. K. Sundaram Y. Teng 2022 Ginger Nanoparticles Mediated Induction of Foxa2 Prevents High‐Fat Diet‐Induced Insulin Resistance Theranostics 12 3 1388 1403 35154496 10.7150/thno.62514 PMC8771553 Kumar P. A. Bhushan P. Gupta S. Gairola 2022 Comparative Morpho‐Anatomical Standardization and Chemical Profiling of Root Drugs for Distinction of Fourteen Species of Family Apocynaceae Botanical Studies 63 1 12 35467168 10.1186/s40529-022-00342-z PMC9038984 Lee R. H. J. Ko K. Kim 2020 Anti‐Melanogenic Effects of Extracellular Vesicles Derived From Plant Leaves and Stems in Mouse Melanoma Cells and Human Healthy Skin Journal of Extracellular Vesicles 9 1 1703480 32002169 10.1080/20013078.2019.1703480 PMC6968621 Lee Y. Y.‐J. Ryu 2023 Morphologically and Karyotypically Atypical Cells of ‘Normal’ Human Bronchial Epithelial Cell Line (Beas‐2B) Ultrastructural Pathology 47 6 470 477 37776320 10.1080/01913123.2023.2262561 Li J. Y. Zhang K. Liu 2018 Xiaoaiping Induces Developmental Toxicity in Zebrafish Embryos Through Activation of ER Stress, Apoptosis and the Wnt Pathway Frontiers in Pharmacology 9 1250 30459614 10.3389/fphar.2018.01250 PMC6233021 Li Y. S. Shao Y. Zhou 2025 Oral Administration of Folium Artemisiae Argyi‐Derived Exosome‐Like Nanovesicles Can Improve Ulcerative Colitis by Regulating Intestinal Microorganisms Phytomedicine 137 February 156376 39813847 10.1016/j.phymed.2025.156376 Lian M. Q. W. H. Chng J. Liang 2022 Plant‐Derived Extracellular Vesicles: Recent Advancements and Current Challenges on Their Use for Biomedical Applications Journal of Extracellular Vesicles 11 12 12283 36519808 10.1002/jev2.12283 PMC9753580 Liu B. Y. Lu X. Chen 2020 Protective Role of Shiitake Mushroom‐Derived Exosome‐Like Nanoparticles in D‐Galactosamine and Lipopolysaccharide‐Induced Acute Liver Injury in Mice Nutrients 12 2 477 32069862 10.3390/nu12020477 PMC7071144 Liu J. J. Xiang C. Jin 2023 Medicinal Plant‐Derived mtDNA via Nanovesicles Induces the cGAS‐STING Pathway to Remold Tumor‐Associated Macrophages for Tumor Regression Journal of Nanobiotechnology 21 1 78 36879291 10.1186/s12951-023-01835-0 PMC9990354 Liu Y. Z. Zhang L. Hu 2022 High Efficient Freeze‐Drying Technology in Food Industry Critical Reviews in Food Science and Nutrition 62 12 3370 3388 33393368 10.1080/10408398.2020.1865261 Logan C. J. C. C. Staton J. T. Oliver 2024 Thermotolerance in S. cerevisiae Journal of Extracellular Vesicles 13 5 e12431 38711329 10.1002/jev2.12431 PMC11074623 Lv L. F. Zhou Y. Quan 2024 Demethylzeylasteral Exerts Potent Efficacy Against Non‐Small‐Cell Lung Cancer via the P53 Signaling Pathway Translational Oncology 46 August 101989 38781861 10.1016/j.tranon.2024.101989 PMC11141460 Ma J. T. Chen S. Wu 2019 iProX: An Integrated Proteome Resource Nucleic Acids Research 47 D1 D1211 D1217 30252093 10.1093/nar/gky869 PMC6323926 Mao X. T. Li W. Qi 2024 Advances in the Study of Plant‐Derived Extracellular Vesicles in the Skeletal Muscle System Pharmacological Research 204 June 107202 38704110 10.1016/j.phrs.2024.107202 Matyash V. G. Liebisch T. V. Kurzchalia A. Shevchenko D. Schwudke 2008 Lipid Extraction by Methyl‐Tert‐Butyl Ether for High‐Throughput Lipidomics Journal of Lipid Research 49 5 1137 1146 18281723 10.1194/jlr.D700041-JLR200 PMC2311442 Maurel C. Y. Boursiac D.‐T. Luu V. Santoni Z. Shahzad L. Verdoucq 2015 Aquaporins in Plants Physiological Reviews 95 4 1321 1358 26336033 10.1152/physrev.00008.2015 Mei Y. L. Wei C. Chai 2019 A Method to Study the Distribution Patterns for Metabolites in Xylem and Phloem of Spatholobi caulis Molecules 25 1 167 31906156 10.3390/molecules25010167 PMC6983255 Minekus M. M. Alminger P. Alvito 2014 A Standardised Static In Vitro Digestion Method Suitable for Food—An International Consensus Food & Function 5 6 1113 1124 24803111 10.1039/c3fo60702j Nemati M. B. Singh R. Ahmad Mir 2022 Plant‐Derived Extracellular Vesicles: A Novel Nanomedicine Approach With Advantages and Challenges Cell Communication and Signaling: CCS 20 1 69 35606749 10.1186/s12964-022-00889-1 PMC9128143 Neuman M. G. L. B. Cohen R. M. Nanau 2014 Biomarkers in Nonalcoholic Fatty Liver Disease Canadian Journal of Gastroenterology & Hepatology 28 11 607 618 25575111 10.1155/2014/757929 PMC4277175 Niemietz C. M. S. D. Tyerman 2002 New Potent Inhibitors of Aquaporins: Silver and Gold Compounds Inhibit Aquaporins of Plant and Human Origin FEBS Letters 531 3 443 447 12435590 10.1016/s0014-5793(02)03581-0 Osteikoetxea X. B. Sódar A. Németh 2015 Differential Detergent Sensitivity of Extracellular Vesicle Subpopulations Organic & Biomolecular Chemistry 13 38 9775 9782 26264754 10.1039/c5ob01451d Ou X. H. Wang H. Tie 2023 Novel Plant‐Derived Exosome‐Like Nanovesicles From Catharanthus Roseus: Preparation, Characterization, and Immunostimulatory Effect via TNF‐α/NF‐κB/PU.1 Axis Journal of Nanobiotechnology 21 1 160 37210530 10.1186/s12951-023-01919-x PMC10199296 Pan Y. X. Luo P. Gong 2023  Spatholobi caulis Journal of Ethnopharmacology 317 December 116854 37393029 10.1016/j.jep.2023.116854 Patel G. K. M. A. Khan H. Zubair 2019 Comparative Analysis of Exosome Isolation Methods Using Culture Supernatant for Optimum Yield, Purity and Downstream Applications Scientific Reports 9 1 5335 30926864 10.1038/s41598-019-41800-2 PMC6441044 Pinedo M. L. de la Canal C. de Marcos Lousa 2021 A Call for Rigor and Standardization in Plant Extracellular Vesicle Research Journal of Extracellular Vesicles 10 6 e12048 33936567 10.1002/jev2.12048 PMC8077130 Rutter B. D. R. W. Innes 2017 Extracellular Vesicles Isolated From the Leaf Apoplast Carry Stress‐Response Proteins Plant Physiology 173 1 728 741 27837092 10.1104/pp.16.01253 PMC5210723 Swindle E. J. J. E. Collins D. E. Davies 2009 Breakdown in Epithelial Barrier Function in Patients With Asthma: Identification of Novel Therapeutic Approaches Journal of Allergy and Clinical Immunology 124 1 23 34 19560576 10.1016/j.jaci.2009.05.037 Teng Y. F. Xu X. Zhang 2021 Plant‐Derived Exosomal microRNAs Inhibit Lung Inflammation Induced by Exosomes SARS‐CoV‐2 Nsp12 Molecular Therapy 29 8 2424 2440 33984520 10.1016/j.ymthe.2021.05.005 PMC8110335 Tewelde S. S. Patharajan Z. Teka D. B. Sbhatu 2020 Assessing the Efficacy of Broad‐Spectrum Antibiotics in Controlling Bacterial Contamination in the In Vitro Micropropagation of Ginger ( Zingiber officinale Rosc Scientific World Journal 2020 6431301 32581658 10.1155/2020/6431301 PMC7306848 Théry C. K. W. Witwer E. Aikawa 2018 Minimal Information for Studies of Extracellular Vesicles 2018 (MISEV2018): A Position Statement of the International Society for Extracellular Vesicles and Update of the MISEV2014 Guidelines Journal of Extracellular Vesicles 7 1 1535750 30637094 10.1080/20013078.2018.1535750 PMC6322352 Tian Y. M. Gong Y. Hu 2020 Quality and Efficiency Assessment of Six Extracellular Vesicle Isolation Methods by Nano‐Flow Cytometry Journal of Extracellular Vesicles 9 1 1697028 31839906 10.1080/20013078.2019.1697028 PMC6896440 Tsai S.‐F. H.‐C. Hung M. M.‐C. Shih 2022 High‐Fat Diet‐Induced Increases in Glucocorticoids Contribute to the Development of Non‐Alcoholic Fatty Liver Disease in Mice FASEB Journal: Official Publication of the Federation of American Societies for Experimental Biology 36 1 e22130 34959259 10.1096/fj.202101570R Wang H. X. Shi Y. Gao 2022 Polystyrene Nanoplastics Induce Profound Metabolic Shift in Human Cells as Revealed by Integrated Proteomic and Metabolomic Analysis Environment International 166 August 107349 35751955 10.1016/j.envint.2022.107349 Wang P. J. Yang Z. Zhu X. Zhang 2018  Marsdenia tenacissima American Journal of Chinese Medicine 46 7 1449 1480 10.1142/S0192415X18500751 30284470 Wang Q. S. Huang Q. Huang Y. Yu H. Li Y. Wan 2024 Absorption and Biotransformation of Selenomethionine and Selenomethionine‐Oxide by Wheat Seedlings ( Triticum aestivum Plants 13 3 380 38337913 10.3390/plants13030380 PMC10857051 Wang Q. X. Zhuang J. Mu 2013 Delivery of Therapeutic Agents by Nanoparticles Made of Grapefruit‐Derived Lipids Nature Communications 4 1867 10.1038/ncomms2886 PMC4396627 23695661 Wang T. J. Zhao Q.‐Y. Li 2025 Poria Cocos‐Derived Exosome‐Like Nanovesicles Alleviate Metabolic Dysfunction‐Associated Fatty Liver Disease by Promoting Mitophagy and Inhibiting NLRP3 Inflammasome Activation International Journal of Molecular Sciences 26 5 2253 40076875 10.3390/ijms26052253 PMC11899877 Wang X. Y. Yan X. Chen 2018 The Antitumor Activities of Marsdenia tenacissima Frontiers in Oncology 8 473 30406035 10.3389/fonc.2018.00473 PMC6206208 Wang Y. Y. Huang J. Wang 2009 Structure of the Formate Transporter FocA Reveals a Pentameric Aquaporin‐Like Channel Nature 462 7272 467 472 19940917 10.1038/nature08610 Welsh J. A. D. C. I. Goberdhan L. O'Driscoll 2024 Minimal Information for Studies of Extracellular Vesicles (MISEV2023): From Basic to Advanced Approaches Journal of Extracellular Vesicles 13 2 e12404 38326288 10.1002/jev2.12404 PMC10850029 Wong K.‐F. Y. Yuan J. M. Luk 2012  Tripterygium wilfordii Clinical and Experimental Pharmacology & Physiology 39 3 311 320 21834865 10.1111/j.1440-1681.2011.05586.x Xia H. X. Zhu X. Zhang 2019 Alpha‐Naphthoflavone Attenuates Non‐Alcoholic Fatty Liver Disease in Oleic Acid‐Treated HepG2 Hepatocytes and in High Fat Diet‐Fed Mice Biomedicine & Pharmacotherapy = Biomedecine & Pharmacotherapie 118 October 109287 31401392 10.1016/j.biopha.2019.109287 Yi B. S. Zhang S. Yan 2023  Marsdenia tenacissima Frontiers in Immunology 14 1238694 37649480 10.3389/fimmu.2023.1238694 PMC10465246 You J. Y. S. J. Kang W. J. Rhee 2021 Isolation of Cabbage Exosome‐Like Nanovesicles and Investigation of Their Biological Activities in Human Cells Bioactive Materials 6 12 4321 4332 33997509 10.1016/j.bioactmat.2021.04.023 PMC8105599 Zhang F. K. Ganesan Q. Liu J. Chen 2022 A Review of the Pharmacological Potential of Spatholobus suberectus Cells 11 18 2885 36139460 10.3390/cells11182885 PMC9497142 Zhang M. E. Viennois M. Prasad 2016 Edible Ginger‐Derived Nanoparticles: A Novel Therapeutic Approach for the Prevention and Treatment of Inflammatory Bowel Disease and Colitis‐Associated Cancer Biomaterials 101 September 321 340 27318094 10.1016/j.biomaterials.2016.06.018 PMC4921206 Zhang M. E. Viennois C. Xu D. Merlin 2016 Plant Derived Edible Nanoparticles as a New Therapeutic Approach Against Diseases Tissue Barriers 4 2 e1134415 27358751 10.1080/21688370.2015.1134415 PMC4910829 Zhang M. B. Xiao H. Wang 2016 Edible Ginger‐Derived Nano‐Lipids Loaded With Doxorubicin as a Novel Drug‐Delivery Approach for Colon Cancer Therapy Molecular Therapy: The Journal of the American Society of Gene Therapy 24 10 1783 1796 27491931 10.1038/mt.2016.159 PMC5112046 Zhang S. Q. Wang D. E. Liang Tan 2024 Gut‐Liver Axis: Potential Mechanisms of Action of Food‐Derived Extracellular Vesicles Journal of Extracellular Vesicles 13 6 e12466 38887165 10.1002/jev2.12466 PMC11183959 Zhang W. S. Li Y. Zhang 2025 MOTS‐c Attenuates Airway Barrier Dysfunction in Allergic Asthma by Inhibiting Epithelial Apoptosis via Nrf2 Pathway International Immunopharmacology 161 August 115014 40472776 10.1016/j.intimp.2025.115014 Zhang Y. X. Mao W. Li 2021  Tripterygium wilfordii Medicinal Research Reviews 41 3 1337 1374 33296090 10.1002/med.21762 Zhao B. H. Lin X. Jiang 2024 Exosome‐Like Nanoparticles Derived From Fruits, Vegetables, and Herbs: Innovative Strategies of Therapeutic and Drug Delivery Theranostics 14 12 4598 4621 39239509 10.7150/thno.97096 PMC11373634 Zhao Q. G. Liu F. Liu 2023 An Enzyme‐Based System for Extraction of Small Extracellular Vesicles From Plants Scientific Reports 13 1 13931 37626167 10.1038/s41598-023-41224-z PMC10457285 Zhao X. Z. Liu Z. Ren 2020 Triptolide Inhibits Pancreatic Cancer Cell Proliferation and Migration via Down‐Regulating PLAU Based on Network Pharmacology of Tripterygium wilfordii European Journal of Pharmacology 880 August 173225 32464191 10.1016/j.ejphar.2020.173225 Zhu H. W. He 2023 Ginger: A Representative Material of Herb‐Derived Exosome‐Like Nanoparticles Frontiers in Nutrition 10 1223349 37521414 10.3389/fnut.2023.1223349 PMC10374224 Zhuang X. Z.‐B. Deng J. Mu 2015 Ginger‐Derived Nanoparticles Protect Against Alcohol‐Induced Liver Damage Journal of Extracellular Vesicles 4 28713 26610593 10.3402/jev.v4.28713 PMC4662062 ",
  "metadata": {
    "Title of this paper": "Ginger‐Derived Nanoparticles Protect Against Alcohol‐Induced Liver Damage",
    "Journal it was published in:": "Journal of Extracellular Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479721/"
  }
}