{
  "title": "Paper_1204",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472848 PMC12472848.1 12472848 12472848 41012430 10.3390/pharmaceutics17091091 pharmaceutics-17-01091 1 Review Polymeric Nanoparticles for Targeted Lung Cancer Treatment: Review and Perspectives https://orcid.org/0000-0003-4085-8936 Kapoor Devesh U. 1 Gandhi Sonam M. 2 Swarn Sambhavi 2 Lal Basant 3 Prajapati Bhupendra G. 4 5 6 Khondee Supang 7 https://orcid.org/0000-0003-3223-1551 Mangmool Supachoke 8 https://orcid.org/0000-0002-7929-3322 Singh Sudarshan 8 9 * https://orcid.org/0000-0002-0696-9969 Chittasupho Chuda 8 * Domb Avi Academic Editor 1 dev7200@gmail.com 2 shena.saloni@gmail.com sambhaviamresh24@gmail.com 3 basant.tyagi63601@gmail.com 4 bhupendra.prajapati40731@paruluniversity.ac.in 5 6 7 supang.kh@up.ac.th 8 supachoke.man@cmu.ac.th 9 * sudarshan.s@cmu.ac.th chuda.c@cmu.ac.th 22 8 2025 9 2025 17 9 497664 1091 25 7 2025 17 8 2025 19 8 2025 22 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Lung cancer remains a foremost cause of cancer-related impermanence globally, demanding innovative and effective therapeutic strategies. Polymeric nanoparticles (NPs) have turned up as a promising transport system for drugs due to their biodegradability, biocompatibility, and capability to provide controlled and targeted release of therapeutic agents. This review offers a thorough examination of different polymeric NP platforms, such as chitosan, gelatin, alginate, poly (lactic acid), and polycaprolactone, highlighting their mechanisms, formulations, and applications in the treatment of lung cancer. These NPs facilitate the delivery of chemotherapeutic agents, gene therapies, and immune modulators, with enhanced bioavailability and reduced systemic toxicity. Additionally, advanced formulations such as ligand-conjugated, stimuli-responsive, and multifunctional NPs demonstrate improved tumor-specific accumulation and cellular uptake. The review also discusses quantum dots, magnetic and lipid-based NPs, and green-synthesized metallic polymeric hybrids, emphasizing their potential in theranostics and combination therapies. Preclinical studies show promising results, yet clinical translation faces challenges; for example, large-scale production, long-term toxicity, and regulatory hurdles. Overall, polymeric NPs represent a powerful platform for advancing personalized lung cancer therapy, with future prospects rooted in multifunctional, targeted, and patient-specific nanomedicine. polymeric nanoparticles lung cancer anticancer molecular pathways targeted therapy This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Lung cancer continues to be the most fatal cancer globally, accounting for approximately 1.8 million deaths in 2020, alongside 2.2 million newly diagnosed cases [ 1 2 3 4 5 6 7 8 9 Age-standardized incidence rates are higher in men, though increasing trends among women, particularly in high-income countries, are concerning [ 10 1 11 12 Figure 1 Lung cancer arises from a complicated interaction of behavioral, environmental, and genetic factors. Tobacco smoking remains the primary cause, contributing to 80–90% of cases, with carcinogens like polycyclic aromatic hydrocarbons and nitrosamines inducing DNA mutations [ 1 2 5 13 Figure 2 Genetic susceptibility plays a crucial role, with mutations in EGFR, KRAS (Kirsten rat sarcoma virus), ALK, and Tumor suppressor (TP) 53 driving oncogenesis, particularly in non-smokers [ 14 15 15 15 Lung cancer pathogenesis involves the dysregulation of key molecular pathways that drive tumor initiation, progression, and metastasis. The EGFR/RAS/RAF/MEK/ERK and PI3K/AKT/mTOR pathways are frequently activated, promoting cell proliferation and survival [ 16 15 17 18 18 19 20 20 Polymeric nanoparticle systems can be strategically designed not only to deliver therapeutic agents but also to actively remodel the tumor microenvironment [ 19 21 22 23 2. Targeted Therapies in Lung Cancer Current progress in nanotechnology has led to the development of advanced drug delivery methods, enhancing the effectiveness of cancer therapy while reducing harmful adverse effects [ 24 25 26 27 28 Polymeric NPs, particularly those using biodegradable poly(lactic-co-glycolic acid) (PLGA), demonstrate excellent controlled-release properties through tunable polymer degradation rates [ 29 30 31 32 33 Inorganic NPs, such as gold nanostructures, provide dual diagnostic and therapeutic capabilities through photothermal ablation and imaging contrast enhancement [ 34 35 However, translating polymeric NPs from bench to bedside in lung cancer therapy faces multifaceted challenges. Scalability remains a primary hurdle, as achieving reproducible size, drug loading, and surface characteristics during large-scale manufacturing is technically demanding and cost-intensive [ 36 37 38 Comparison Between Conventional and Novel Therapies Involved in the Management of Lung Cancer Traditional approaches to managing lung carcinoma, such as surgical resection, systemic chemotherapy, and radiotherapy, have historically served as the primary treatment options. Nevertheless, these methods frequently exhibit poor precision, resulting in severe adverse effects and reduced effectiveness, particularly in late-stage disease [ 39 40 41 42 Table 1 3. Advanced Nanoparticle Platforms for Lung Cancer Theranostics and Targeted Therapy 3.1. Magnetic Nanoparticles Magnetic NPs have emerged as efficient tools in lung cancer diagnosis and treatment because of their unique physicochemical properties. Superparamagnetic iron oxide NPs are extensively studied, enabling magnetic resonance imaging (MRI) enhancement for early tumor detection with high sensitivity [ 56 57 In hyperthermia therapy, alternating magnetic fields heat Magnetic NPs to 42–46 °C, inducing selective cancer cell apoptosis while sparing healthy tissue [ 58 57 59 60 61 62 3.2. Solid Lipid Nanoparticles Solid lipid nanoparticles (SLNs) have gained attention as efficient drug transport systems for lung cancer due to their stability, biocompatibility, and ability to encapsulate both water-loving and hydrophobic drugs [ 63 64 64 65 66 67 64 68 3.3. Polymeric Reduced Green Metallic Nanoparticles Polymeric reduced green metallic (PRGM) NPs represent a convergence of green chemistry and nanotechnology, offering an eco-friendly alternative, sustainable to conventional nanoparticle synthesis methods. These NPs are synthesized using biocompatible polymers and reducing agents derived from natural plant extracts, microbes, or other biotic resources, eliminating the need for hazardous chemicals [ 69 69 In lung cancer, where drug resistance and systemic toxicity pose significant challenges, polymeric reduced green metallic NPs provide enhanced cellular uptake, reduced off-target effects, and the potential to bypass multidrug resistance pathways [ 70 71 Table 2 3.4. Quantum Dots Quantum dots (QDs) are semiconductor nanocrystals, typically 2–10 nm in diameter, that exhibit unique size-dependent optical and electronic properties due to quantum confinement effects [ 76 77 Many QDs especially those with cadmium selenide (CdSe), cadmium telluride (CdTe), or lead-based cores pose significant heavy metal toxicity risks. Cadmium ions, released through core degradation under physiological conditions, can induce oxidative stress, mitochondrial damage, and DNA strand breaks, leading to mutagenesis and carcinogenesis. These effects are exacerbated by the small size and large surface area of QDs, which facilitate cellular uptake and interaction with biomolecules [ 77 78 78 QDs exhibit substantial promise in revolutionizing lung cancer theranostics through multifunctional capabilities. Research demonstrates that QDs functionalized with targeting ligands, such as EGFR antibodies or RGD peptides, significantly enhance the selective delivery of chemotherapeutic agents (e.g., DOX, cisplatin) to lung tumor cells in vitro and animal models, improving efficacy while minimizing off-target effects compared to free drugs [ 79 80 81 82 83 84 4. Application of Polymeric Nanoparticles in Lung Cancer Management Polymeric nanoparticles are colloidal systems composed of synthetic or natural polymers, typically measuring between 10 and 1000 nm in size. These NPs are engineered to encapsulate, protect, and transport therapeutic agents to specific target areas, enabling controlled drug release and improved bioavailability. Due to their biocompatibility and tunable surface characteristics, they are extensively utilized in targeted drug delivery applications [ 85 86 87 88 89 90 Table 3 Polymeric NPs can be engineered for multimodal theranostic applications in lung cancer by integrating various imaging agents. Magnetic resonance imaging labels, such as superparamagnetic iron oxide or gadolinium chelates, provide high soft-tissue contrast without ionizing radiation, though sensitivity is lower than nuclear techniques. Computed tomography (CT) contrast can be achieved by incorporating high-Z elements (gold, bismuth, iodine), enabling excellent spatial resolution for lung anatomy but at the cost of radiation exposure [ 100 101 Table 4 4.1. Chitosan-Based Nanoparticles Traditional chemotherapy methods face numerous challenges, such as rapid drug clearance, poor drug targeting, multidrug resistance, and limited therapeutic efficiency. Chitosan, a polymer naturally derived from chitin via deacetylation, comprises β-(1-4)-linked d-glucosamine and N-acetyl- d 92 107 Pawar and Jaganathan illustrated the high loading capacity of glycol-modified CNPs for hepatitis B vaccines, supporting their ability in mucosal vaccine delivery [ 108 109 A study by Shali et al. [ 110 Mahmood et al. [ 111 Mahmoud and colleagues [ 112 Zhu et al. [ 113 Patel et al. [ 114 50 4.2. Sodium Alginate-Based Nanoparticles Polymeric biomaterials like alginate (ALG) are widely used in medical applications due to their compatibility with physiological conditions and lesser adverse effects. ALG is highly valued for its biocompatible and hemostatic properties, as well as its capacity for chemical modification. Its hydroxyl and carboxyl groups allow hydrogen bonding, making it suitable for gel formation, muco-adhesion, and improving transdermal drug delivery [ 115 115 115 Huang et al. [ 116 3 4 3 4 3 4 3 4 3 3 4 117 Recently, Işıklan et al. [ 118 2 4.3. Gelatin-Based Nanoparticles Gelatin-based NPs (GNPs) offer significant benefits in the management of lung cancer due to their biodegradability, biocompatibility, and ease of surface modification. Derived from collagen, gelatin is a naturally occurring polymer that is well tolerated and non-toxic in biological systems, making it an ideal material for drug delivery applications. GNPs can encapsulate a vast range of therapeutic agents, including targeted therapies, chemotherapeutics, and immunomodulators, allowing for controlled and sustained release at tumor sites [ 119 120 121 Ali et al. [ 122 50 Gu et al. [ 94 Vaghasiya et al. [ 123 Kononenko et al. [ 124 Figure 3 Figure 3 Figure 3 Figure 3 In 2020, Chen et al. [ 125 4.4. Poly Lactic Acid-Based Nanoparticles Poly lactic acid (PLA)-based NPs are biocompatible and biodegradable carriers derived from renewable sources, mainly used in drug delivery applications, including cancer therapy. In the management of lung cancer, PLA NPs offer a major platform for the targeted delivery of gene therapies, chemotherapeutic drugs, and immune-modulating agents. Their biodegradability ensures safe breakdown into lactic acid, a naturally occurring metabolite, minimizing long-term toxicity [ 126 126 Wang et al. [ 127 50 Figure 4 Figure 4 p Figure 4 Figure 4 p Yao et al. [ 128 Chittasupho and colleagues demonstrated that conjugating the CXCR4-targeting peptide LFC131 onto PLGA NPs significantly enhanced the delivery of doxorubicin to CXCR4-expressing A549 lung cancer cells. These LFC131-DOX NPs exhibited faster and greater cellular uptake, CXCR4-specific internalization confirmed via competitive inhibition, and sustained drug release, highlighting their promise as a targeted and controlled delivery system [ 83 84 4.5. Poly Caprolactone-Based Nanoparticles Polycaprolactone (PCL)-based NPs are a class of biodegradable and biocompatible polymeric carriers known for their slow degradation rate and excellent drug encapsulation capabilities. In the context of lung cancer management, PCL NPs have emerged as a valuable platform for the sustained and targeted delivery of anticancer agents. Their hydrophobic nature allows effective loading of poorly water-soluble chemotherapeutic drugs, enhancing their solubility and therapeutic impact [ 129 130 Cabeza et al. [ 131 50 Figure 5 p Figure 5 Figure 5 Figure 5 p Figure 5 Akbari et al. [ 132 co 4.6. Poly(amidoamine)-Based Nanoparticles Poly(amidoamine) (PAA or PAMAM) could be stepwise synthesized to yield dendrimers that have a hyper-branched, tree-like structure with active functional groups and well-defined size. Dendrimers are biocompatible, water soluble, and redox sensitive. Regrettably, uncoated dendrimers were reported to have certain cellular toxicity; therefore, surface modification, such as PEGylation, is essential to improve their safety [ 133 Guo et al. [ 134 Bai et al. [ 135 4.7. Polymethacrylate-Based Nanoparticles NPs from poly (methyl methacrylate) (PMMA) are easy to synthesize and functionalize, biocompatible. Core–shell PMMA NPs were developed to resolve the agglomeration issue of PMMA. Yin et al. [ 136 Table 5 5. Clinical Trials Associated with Polymeric NPs-Based Drug Delivery for Lung Cancer Clinical trials investigating polymeric NPs for lung cancer treatment are gaining momentum due to their potential to enhance targeted drug delivery and reduce systemic toxicity. Several ongoing and completed trials have evaluated polymeric NP-based formulations such as albumin-bound paclitaxel (Abraxane) and PEGylated drug carriers for improved therapeutic outcomes [ 138 Table 6 6. Challenges, Limitations, and Future Perspective Despite the promising advancements in polymeric NPs for targeted lung cancer therapy, several critical challenges and limitations hinder their full clinical translation. These challenges are associated with physicochemical properties, biological barriers, safety concerns, manufacturing scalability, and regulatory approval. The major obstacle for polymeric NPs mediated lung cancer therapy is the complex biological environment that impedes efficient drug delivery [ 143 144 The EPR effect, while foundational to passive tumor targeting, is highly heterogeneous and influenced by multiple factors. Tumor type significantly affects vascular permeability, with highly angiogenic and leaky vasculature in some solid tumors (e.g., hepatocellular carcinoma) favoring stronger EPR, whereas desmoplastic or poorly vascularized tumors (e.g., pancreatic cancer) exhibit limited NP accumulation. Tumor size also plays a role—smaller, rapidly growing tumors often have immature vasculature that enhances permeability, while larger tumors may develop necrotic or hypoxic cores with reduced perfusion, limiting drug delivery [ 145 146 Table 7 While pulmonary (inhalation) delivery is ideal for localized lung cancer treatment, achieving uniform drug deposition in deep lung tissues remains difficult. Factors such as mucociliary clearance, enzymatic degradation, and variable breathing patterns impact drug retention and efficacy. Moreover, the formulation must maintain aerodynamic properties compatible with inhalation devices without compromising NP stability or drug activity [ 144 Maintaining the physical and chemical stability of polymeric NPs during formulation, storage, and administration is another challenge. Premature drug leakage, aggregation, and degradation can reduce therapeutic efficiency. Ensuring controlled, stimulus-responsive drug release triggered by pH, enzymes, or redox conditions in the TME requires precise engineering, which is often difficult to reproduce consistently across batches [ 150 Although polymeric materials like PLGA, chitosan, and PEG are generally biocompatible, the degradation products of some polymers may cause inflammation or toxicity. Furthermore, limited data exist on the long-term fate and clearance of NPs, especially when repeatedly administered. Accumulation in non-target organs and the risk of immunogenicity remain unresolved concerns. Surface modifications intended to prolong circulation or enhance targeting can inadvertently increase toxicity or alter pharmacokinetics unpredictably [ 151 Translating lab-scale synthesis to large-scale production poses major technical and economic challenges. Reproducibility in NPs size, drug-loading efficiency, surface charge, and batch consistency is essential for clinical success. Sophisticated techniques such as microfluidics or nanoprecipitation, though precise, are often expensive or not easily scalable, limiting their commercial viability [ 152 153 154 155 The regulatory pathway for NPs-based drug delivery systems is still evolving. These systems often blur the lines between drugs and devices, complicating approval processes. Agencies such as the FDA and EMA require comprehensive characterization of physicochemical properties, stability, pharmacokinetics, biodistribution, and long-term safety. Demonstrating consistent manufacturing under Good Manufacturing Practice conditions is essential [ 156 97 99 The patient variability and tumor heterogeneity in lung cancer stem from diverse genetic mutations (e.g., EGFR, KRAS, ALK) and phenotypic traits, as well as differences in tumor microenvironments. These variations can significantly impact therapeutic response, making one-size-fits-all NP designs less effective. To address this, PNPs with active targeting ligands can be engineered for patient-specific profiles [ 151 157 158 The integration of polymeric NPs into lung cancer therapy holds immense promise for transforming current treatment paradigms. Future research must prioritize the formulation of multifunctional, stimuli-responsive NPs effective in co-delivering chemotherapeutics, gene therapies, and immunomodulators in a single platform [ 145 159 Emerging trends in bioinspired and green-synthesized NPs, including hybrid polymer-metallic systems, also warrant extensive exploration, given their potential for synergistic imaging and therapeutic applications [ 160 161 7. Conclusions Lung cancer remains a leading therapeutic challenge due to its aggressive nature, late diagnosis, and limitations of conventional treatments. Polymeric NPs have turned up as promising tools for targeted drug delivery, offering ameliorated efficacy, tumor specificity, and reduced systemic toxicity. This review explores polymeric NPs, including chitosan, gelatin, alginate, poly lactic acid, and polycaprolactone, which enhance the delivery of chemotherapeutics, gene therapies, and immunomodulators. These nanocarriers protect drugs from degradation and improve bioavailability. Advanced designs, including ligand-conjugated, stimuli-responsive, and multifunctional NPs, have further improved therapeutic outcomes. Incorporating green-synthesized metallic NPs and quantum dots into polymeric platforms has introduced novel theranostics opportunities, combining imaging and treatment. However, barriers including NPs stability, biological interactions, long-term toxicity, and production scalability remain key challenges. Future directions include optimizing material properties, enhancing biocompatibility, and exploring inhalable formulations. Artificial intelligence-based therapy design may also accelerate personalized treatment development. In conclusion, polymeric NPs represent a transformative approach in lung cancer therapy. With continued interdisciplinary research and clinical validation, these systems could significantly improve treatment outcomes, survival rates, and quality of life for lung cancer patients globally. Acknowledgments This work was partially supported by CMU Proactive Researcher Scheme (2023), Chiang Mai University, for Sudarshan Singh. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, S.S. (Sudarshan Singh) and C.C.; methodology, S.K., D.U.K., S.M.G., S.S. (Sambhavi Swarn) and B.L.; software, B.G.P.; validation, S.K., S.S. (Sudarshan Singh) and C.C.; formal analysis, B.G.P.; investigation, S.M.G., S.S. (Sambhavi Swarn) and B.L.; resources, B.G.P.; data curation, D.U.K.; writing—original draft preparation, S.K., S.M., C.C., S.M.G., S.S. (Sambhavi Swarn) and B.L.; writing—review and editing, S.S. (Sudarshan Singh), S.K., S.M. and C.C.; visualization, C.C.; supervision, B.G.P. and S.S. (Sudarshan Singh); project administration, C.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created. Conflicts of Interest The author Basant Lal was employed by PQE Australia Pvt. Ltd. The remaining authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. References 1. Allemani C. Matsuda T. Di Carlo V. Harewood R. Matz M. Nikšić M. Bonaventure A. Valkov M. Johnson C.J. Estève J. Global Surveillance of Trends in Cancer Survival 2000–14 (Concord-3): Analysis of Individual Records for 37,513,025 Patients Diagnosed with One of 18 Cancers from 322 Population-Based Registries in 71 Countries Lancet 2018 391 1023 1075 10.1016/S0140-6736(17)33326-3 29395269 PMC5879496 2. Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Bray F. Global Cancer Statistics 2020: Globocan Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J. Clin. 2021 71 209 249 10.3322/caac.21660 33538338 3. Malhotra J. Malvezzi M. Negri E. La Vecchia C. Boffetta P. Risk Factors for Lung Cancer Worldwide Eur. Respir. J. 2016 48 889 902 10.1183/13993003.00359-2016 27174888 4. Brinklov S. Kalko E.K.V. Surlykke A. Intense Echolocation Calls from Two ‘Whispering’ Bats, Artibeus jamaicensis Macrophyllum macrophyllum Phyllostomidae J. Exp. Biol. 2009 212 11 20 10.1242/jeb.023226 19088206 5. Bade B.C. Cruz C.S.D. Lung Cancer 2020: Epidemiology, Etiology, and Prevention Clin. Chest Med. 2020 41 1 24 10.1016/j.ccm.2019.10.001 32008623 6. Li Y. Wang N. Huang Y. He S. Bao M. Wen C. Wu L. Circmybl1 Suppressed Acquired Resistance to Osimertinib in Non-Small-Cell Lung Cancer Cancer Genet. 2024 284–285 34 42 10.1016/j.cancergen.2024.04.001 38626533 7. Wang S. Liu G. Yu L. Zhang C. Marcucci F. Jiang Y. Fluorofenidone Enhances Cisplatin Efficacy in Non-Small Cell Lung Cancer: A Novel Approach to Inhibiting Cancer Progression Transl. Lung Cancer Res. 2024 13 3175 3188 10.21037/tlcr-24-811 39670015 PMC11632444 8. Gao F. Yan G. Sun L. Xia H. Guo Z. Lin H. Du G. The Real Mechanisms of Emodin Treating Lung Cancer Based on System Pharmacology Eurasian J. Med. Oncol. 2023 7 10 23 10.14744/ejmo.2023.35261 9. Wang J. Dong X. Liu Y. Lin K. Chen J. Copy Number Gain of Met Gene with Low Level in a Metastatic Lung Adenocarcinoma Patient Represents Response to Salvage Treatment with Savolitinib and Osimertinib: A Case Report Front. Oncol. 2025 15 1507677 10.3389/fonc.2025.1507677 40365349 PMC12069039 10. Ferlay J. Colombet M. Soerjomataram I. Parkin D.M. Piñeros M. Znaor A. Bray F. Cancer Statistics for the Year 2020: An Overview Int. J. Cancer 2021 149 778 789 10.1002/ijc.33588 33818764 11. Zhang Y. Liu C. Chen X. Zhang Y. Li Y. Hu X. Effects of Web-Based Acceptance and Commitment Therapy on Health-Related Outcomes among Patients with Lung Cancer: A Feasibility Randomized Controlled Trial Psychooncology 2024 33 e70045 10.1002/pon.70045 39681977 12. El-Megharbel S.M. Albogami B. Hassoubah S.A. Beyari E.A. Albaqami N.M. Alsolami K. Hamza R.Z. Spectral Analysis of Novel Minocycline/Zn Complex with Promising Anticancer Activities against Large Lung Cancer Cells (H460), Antibacterial and Antioxidant Activities against Acrylamide-Induced Pulmonary Toxicity in Male Rats Int. J. Pharmacol. 2024 20 1247 1270 10.3923/ijp.2024.1247.1270 13. Samet J.M. Avila-Tang E. Boffetta P. Hannan L.M. Olivo-Marston S. Thun M.J. Rudin C.M. Lung Cancer in Never Smokers: Clinical Epidemiology and Environmental Risk Factors Clin. Cancer Res. 2009 15 5626 5645 10.1158/1078-0432.CCR-09-0376 19755391 PMC3170525 14. Herbst R.S. Morgensztern D. Boshoff C. The Biology and Management of Non-Small Cell Lung Cancer Nature 2018 553 446 454 10.1038/nature25183 29364287 15. McGarry H.A. Mechanistic Links between Copd and Lung Cancer Nat. Rev. Cancer 2013 13 233 245 10.1038/nrc3477 23467302 16. Skoulidis F. Heymach J.V. Co-Occurring Genomic Alterations In non-Small-Cell Lung Cancer Biology and Therapy Nat. Rev. Cancer 2019 19 495 509 10.1038/s41568-019-0179-8 31406302 PMC7043073 17. George J. Lim J.S. Jang S.J. Cun Y. Ozretić L. Kong G. Leenders F. Lu X. Fernández-Cuesta L. Bosco G. Comprehensive Genomic Profiles of Small Cell Lung Cancer Nature 2015 524 47 53 10.1038/nature14664 26168399 PMC4861069 18. Baylin S.B. Jones P.A. Epigenetic Determinants of Cancer Cold Spring Harb. Perspect. Biol. 2016 8 a019505 10.1101/cshperspect.a019505 27194046 PMC5008069 19. New York State Department of Environmental Conservation Guidelines for Conducting Bird and Bat Studies at Commercial Wind Energy Projects Division of Fish Wildlife and Marine Resources New York State Department of Environmental Conservation Albany, NY, USA 2009 20. Hinshaw D.C. Shevde L.A. The Tumor Microenvironment Innately Modulates Cancer Progression Cancer Res. 2019 79 4557 4566 10.1158/0008-5472.CAN-18-3962 31350295 PMC6744958 21. Arandhara A. Bhuyan P. Das B.K. Exploring Lung Cancer Microenvironment: Pathways and Nanoparticle-Based Therapies Discov. Oncol. 2025 16 159 10.1007/s12672-025-01902-y 39934547 PMC11814423 22. Zhang X. Zhang X. Yong T. Gan L. Yang X. Boosting Antitumor Efficacy of Nanoparticles by Modulating Tumor Mechanical Microenvironment eBioMedicine 2024 105 105200 10.1016/j.ebiom.2024.105200 38876044 PMC11225208 23. Sabit H. Pawlik T.M. Radwan F. Abdel-Hakeem M. Abdel-Ghany S. Wadan A.-H.S. Elzawahri M. El-Hashash A. Arneth B. Precision Nanomedicine: Navigating the Tumor Microenvironment for Enhanced Cancer Immunotherapy and Targeted Drug Delivery Mol. Cancer 2025 24 160 10.1186/s12943-025-02357-z 40457437 PMC12131435 24. Mitchell M.J. Billingsley M.M. Haley R.M. Wechsler M.E. Peppas N.A. Langer R. Engineering Precision Nanoparticles for Drug Delivery Nat. Rev. Drug Discov. 2021 20 101 124 10.1038/s41573-020-0090-8 33277608 PMC7717100 25. Li L. Li J. Zhong M. Wu Z. Wan S. Li X. Zhang Y. Lv K. Nanozyme-Enhanced Tyramine Signal Amplification Probe for Preamplification-Free Myocarditis-Related Mirnas Detection Chem. Eng. J. 2025 503 158093 10.1016/j.cej.2024.158093 26. Feng C. Wang Y. Xu J. Zheng Y. Zhou W. Wang Y. Luo C. Precisely Tailoring Molecular Structure of Doxorubicin Prodrugs to Enable Stable Nanoassembly, Rapid Activation, Potent Antitumor Effect Pharmaceutics 2024 16 1582 10.3390/pharmaceutics16121582 39771561 PMC11679313 27. Gao Y. Wang Y. Jiang J. Wei P. Sun H. Triggered “on/Off” Luminescent Polypeptide Bowl-Shaped Nanoparticles for Selective Lighting of Tumor Cells Small 2025 21 e2411432 10.1002/smll.202411432 39888201 28. Rani V. Venkatesan J. Prabhu A. Liposomes—A Promising Strategy for Drug Delivery in Anticancer Applications J. Drug Deliv. Sci. Technol. 2022 76 103739 10.1016/j.jddst.2022.103739 29. Kumari P. Ghosh B. Biswas S. Nanocarriers for Cancer-Targeted Drug Delivery J. Drug Target. 2016 24 179 191 10.3109/1061186X.2015.1051049 26061298 30. Dong Q. Jiang Z. Platinum–Iron Nanoparticles for Oxygen-Enhanced Sonodynamic Tumor Cell Suppression Inorganics 2024 12 331 10.3390/inorganics12120331 31. Mi P. Stimuli-Responsive Nanocarriers for Drug Delivery, Tumor Imaging, Therapy and Theranostics Theranostics 2020 10 4557 4588 10.7150/thno.38069 32292515 PMC7150471 32. Wang Y. Xu Y. Song J. Liu X. Liu S. Yang N. Wang L. Liu Y. Zhao Y. Zhou W. Tumor Cell-Targeting and Tumor Microenvironment-Responsive Nanoplatforms for the Multimodal Imaging-Guided Photodynamic/Photothermal/Chemodynamic Treatment of Cervical Cancer Int. J. Nanomed. 2024 19 5837 5858 10.2147/IJN.S466042 PMC11182360 38887692 33. Madaan K. Kumar S. Poonia N. Lather V. Pandita D. Dendrimers in Drug Delivery and Targeting: Drug-Dendrimer Interactions and Toxicity Issues J. Pharm. Bioallied Sci. 2014 6 139 150 10.4103/0975-7406.130965 25035633 PMC4097927 34. Jafari S. Derakhshankhah H. Alaei L. Fattahi A. Varnamkhasti B.S. Saboury A.A. Mesoporous Silica Nanoparticles for Therapeutic/Diagnostic Applications Biomed. Pharmacother. 2019 109 1100 1111 10.1016/j.biopha.2018.10.167 30551360 35. Aqil F. Gupta R.C. Exosomes in Cancer Therapy Cancers 2022 14 500 10.3390/cancers14030500 35158768 PMC8833672 36. Anselmo A.C. Prabhakarpandian B. Pant K. Mitragotri S. Clinical and Commercial Translation of Advanced Polymeric Nanoparticle Systems: Opportunities and Material Challenges Transl. Mater. Res. 2017 4 014001 10.1088/2053-1613/aa5468 37. Gaspar R. Duncan R. Polymeric Carriers: Preclinical Safety and the Regulatory Implications for Design and Development of Polymer Therapeutics Adv. Drug Deliv. Rev. 2009 61 1220 1231 10.1016/j.addr.2009.06.003 19682513 38. Feng J. Zhang P. Wang D. Li Y. Tan J. New Strategies for Lung Cancer Diagnosis and Treatment: Applications and Advances in Nanotechnology Biomark. Res. 2024 12 136 10.1186/s40364-024-00686-7 39533445 PMC11558848 39. García-Fernández C. Fornaguera C. Borrós S. Nanomedicine in Non-Small Cell Lung Cancer: From Conventional Treatments to Immunotherapy Cancers 2020 12 1609 10.3390/cancers12061609 32570729 PMC7352459 40. Owen D.H. Wei L. Bertino E.M. Edd T. Villalona-Calero M.A. He K. Shields P.G. Carbone D.P. Otterson G.A. Incidence, Risk Factors and Effect on Survival of Immune-Related Adverse Events in Patients with Non-Small-Cell Lung Cancer Clin. Lung Cancer 2018 19 e893 e900 10.1016/j.cllc.2018.08.008 30197259 PMC7193681 41. Chen D. Liu J. Wu J. Suk J.S. Enhancing Nanoparticle Penetration through Airway Mucus to Improve Drug Delivery Efficacy in the Lung Expert Opin. Drug Deliv. 2021 18 595 606 10.1080/17425247.2021.1854222 33218265 PMC9479118 42. Sarma K. Akther M.H. Ahmad I. Afzal O. Altamimi A.S.A. Alossaimi M.A. Jaremko M. Emwas A.-H. Gautam P. Adjuvant Novel Nanocarrier-Based Targeted Therapy for Lung Cancer Molecules 2024 29 1076 10.3390/molecules29051076 38474590 PMC10934468 43. Antonia S.J. Villegas A. Daniel D. Vicente D. Murakami S. Hui R. Yokoi T. Chiappori A. Lee K.H. de Wit M. Durvalumab after Chemoradiotherapy in Stage Iii Non-Small-Cell Lung Cancer N. Engl. J. Med. 2017 377 1919 1929 10.1056/NEJMoa1709937 28885881 44. Hellmann M.D. Ciuleanu T.E. Pluzanski A. Lee J.S. Otterson G.A. Audigier-Valette C. Minenza E. Linardou H. Burgers S. Salman P. Nivolumab Plus Ipilimumab in Lung Cancer with a High Tumor Mutational Burden N. Engl. J. Med. 2018 378 2093 2104 10.1056/NEJMoa1801946 29658845 PMC7193684 45. Soria J.C. Ohe Y. Vansteenkiste J. Reungwetwattana T. Chewaskulyong B. Lee K.H. Dechaphunkul A. Imamura F. Nogami N. Kurata T. Osimertinib in Untreated Egfr-Mutated Advanced Non-Small-Cell Lung Cancer N. Engl. J. Med. 2018 378 113 125 10.1056/NEJMoa1713137 29151359 46. Rittmeyer A. Barlesi F. Waterkamp D. Park K. Ciardiello F. von Pawel J. Gadgeel S.M. Hida T. Kowalski D.M. Dols M.C. Atezolizumab Versus Docetaxel in Patients with Previously Treated Non-Small-Cell Lung Cancer (Oak): A Phase 3, Open-Label, Multicentre Randomised Controlled Trial Lancet 2017 389 255 265 10.1016/S0140-6736(16)32517-X 27979383 PMC6886121 47. Gourd, Alectinib Shows Cns Efficacy in Alk-Positive Nsclc Lancet Oncol. 2018 19 e520 10.1016/S1470-2045(18)30707-1 30245054 48. Ando K. Manabe R. Kishino Y. Kusumoto S. Yamaoka T. Tanaka A. Ohmori T. Sagara H. Comparative Efficacy of Alk Inhibitors for Treatment-Naïve Alk-Positive Advanced Non-Small Cell Lung Cancer with Central Nervous System Metastasis: A Network Meta-Analysis Int. J. Mol. Sci. 2023 24 2242 10.3390/ijms24032242 36768562 PMC9917367 49. Lindeman N.I. Cagle P.T. Aisner D.L. Arcila M.E. Beasley M.B. Bernicker E.H. Colasacco C. Dacic S. Hirsch F.R. Kerr K. Updated Molecular Testing Guideline for the Selection of Lung Cancer Patients for Treatment with Targeted Tyrosine Kinase Inhibitors: Guideline from the College of American Pathologists, the International Association for the Study of Lung Cancer, and the Association for Molecular Pathology Arch. Pathol. Lab. Med. 2018 142 321 346 10.5858/arpa.2017-0388-cp 29355391 50. Rolfo C. Mack P. Scagliotti G.V. Aggarwal C. Arcila M.E. Barlesi F. Bivona T. Diehn M. Dive C. Dziadziuszko R. Liquid Biopsy for Advanced Nsclc: A Consensus Statement from the International Association for the Study of Lung Cancer J. Thorac. Oncol. 2021 16 1647 1662 10.1016/j.jtho.2021.06.017 34246791 51. Schilsky R.L. Personalized Medicine in Oncology: The Future Is Now Nat. Rev. Drug Discov. 2010 9 363 366 10.1038/nrd3181 20431568 52. Pascual J. Attard G. Bidard F.C. Curigliano G. De Mattos-Arruda L. Diehn M. Italiano A. Lindberg J. Merker J.D. Montagut C. Esmo Recommendations on the Use of Circulating Tumour DNA Assays for Patients with Cancer: A Report from the Esmo Precision Medicine Working Group Ann. Oncol. 2022 33 750 768 10.1016/j.annonc.2022.05.520 35809752 53. Tsuboi M. Herbst R.S. John T. Kato T. Majem M. Grohé C. Wang J. Goldman J.W. Lu S. Su W.C. Overall Survival with Osimertinib in Resected Egfr-Mutated Nsclc N. Engl. J. Med. 2023 389 137 147 10.1056/NEJMoa2304594 37272535 54. Reck M. Remon J. Hellmann M.D. First-Line Immunotherapy for Non-Small-Cell Lung Cancer J. Clin. Oncol. 2022 40 586 597 10.1200/JCO.21.01497 34985920 55. Ramalingam S.S. Vansteenkiste J. Planchard D. Cho B.C. Gray J.E. Ohe Y. Zhou C. Reungwetwattana T. Cheng Y. Chewaskulyong B. Overall Survival with Osimertinib in Untreated, Egfr-Mutated Advanced Nsclc N. Engl. J. Med. 2020 382 41 50 10.1056/NEJMoa1913662 31751012 56. Kievit F.M. Zhang M. Cancer Nanotheranostics: Improving Imaging and Therapy by Targeted Delivery across Biological Barriers Adv. Mater. 2011 23 H217 H247 10.1002/adma.201102313 21842473 PMC3397249 57. Wahajuddin Arora S. Superparamagnetic Iron Oxide Nanoparticles: Magnetic Nanoplatforms as Drug Carriers Int. J. Nanomed. 2012 7 3445 3471 10.2147/IJN.S30320 PMC3405876 22848170 58. Manescu V. Antoniac I. Paltanea G. Nemoianu I.V. Mohan A.G. Antoniac A. Rau J.V. Laptoiu S.A. Mihai P. Gavrila H. Magnetic Hyperthermia in Glioblastoma Multiforme Treatment Int. J. Mol. Sci. 2024 25 10065 10.3390/ijms251810065 39337552 PMC11432100 59. Mykhaylyk O. Sanchez-Antequera Y. Vlaskou D. Cerda M.B. Bokharaei M. Hammerschmid E. Anton M. Plank C. Magnetic Nanoparticle and Magnetic Field Assisted Sirna Delivery in Vitro Methods Mol. Biol. 2015 1218 53 106 25319646 10.1007/978-1-4939-1538-5_5 60. Wei X. Song M. Li W. Huang J. Yang G. Wang Y. Multifunctional Nanoplatforms Co-Delivering Combinatorial Dual-Drug for Eliminating Cancer Multidrug Resistance Theranostics 2021 11 6334 6354 10.7150/thno.59342 33995661 PMC8120214 61. Li X. Younis M.H. Wei W. Cai W. Pd-L1 - Targeted Magnetic Fluorescent Hybrid Nanoparticles: Illuminating the Path of Image-Guided Cancer Immunotherapy Eur. J. Nucl. Med. Mol. Imaging 2023 50 2240 2243 10.1007/s00259-023-06202-7 36943430 PMC10272096 62. Arami H. Khandhar A. Liggitt D. Krishnan K.M. Delivery I.V. Pharmacokinetics, Biodistribution and Toxicity of Iron Oxide Nanoparticles Chem. Soc. Rev. 2015 44 8576 8607 10.1039/C5CS00541H 26390044 PMC4648695 63. Müller R.H. Mäder K. Gohla S. Solid Lipid Nanoparticles (Sln) for Controlled Drug Delivery—A Review of the State of the Art Eur. J. Pharm. Biopharm. 2000 50 161 177 10.1016/S0939-6411(00)00087-4 10840199 64. Sivadasan D. Ramakrishnan K. Mahendran J. Ranganathan H. Karuppaiah A. Rahman H. Solid Lipid Nanoparticles: Applications and Prospects in Cancer Treatment Int. J. Mol. Sci. 2023 24 6199 10.3390/ijms24076199 37047172 PMC10094605 65. Song Y. Cai H. Yin T. Huo M. Ma P. Zhou J. Lai W. Paclitaxel-Loaded Redox-Sensitive Nanoparticles Based on Hyaluronic Acid-Vitamin E Succinate Conjugates for Improved Lung Cancer Treatment Int. J. Nanomed. 2018 13 1585 1600 10.2147/IJN.S155383 PMC5858821 29588586 66. Chai Z. Ran D. Lu L. Zhan C. Ruan H. Hu X. Xie C. Jiang K. Li J. Zhou J. Ligand-Modified Cell Membrane Enables the Targeted Delivery of Drug Nanocrystals to Glioma ACS Nano 2019 13 5591 5601 10.1021/acsnano.9b00661 31070352 67. Subhan M.A. Filipczak N. Torchilin V.P. Advances with Lipid-Based Nanosystems for Sirna Delivery to Breast Cancers Pharmaceuticals 2023 16 970 10.3390/ph16070970 37513882 PMC10386415 68. Al Khatib A.O. El-Tanani M. Al-Obaidi H. Inhaled Medicines for Targeting Non-Small Cell Lung Cancer Pharmaceutics 2023 15 2777 10.3390/pharmaceutics15122777 38140117 PMC10748026 69. Pechyen C. Tangnorawich B. Toommee S. Marks R. Parcharoen Y. Green Synthesis of Metal Nanoparticles, Characterization, and Biosensing Applications Sens. Int. 2024 5 100287 10.1016/j.sintl.2024.100287 70. Tinajero-Díaz E. Salado-Leza D. Gonzalez C. Velázquez M.M. López Z. Bravo-Madrigal J. Knauth P. Flores-Hernández F.Y. Herrera-Rodríguez S.E. Navarro R.E. Green Metallic Nanoparticles for Cancer Therapy: Evaluation Models and Cancer Applications Pharmaceutics 2021 13 1719 10.3390/pharmaceutics13101719 34684012 PMC8537602 71. Abdel-Aziz M.M. Elella M.H.A. Mohamed R.R. Green Synthesis of Quaternized Chitosan/Silver Nanocomposites for Targeting Mycobacterium Tuberculosis and Lung Carcinoma Cells (a-549) Int. J. Biol. Macromol. 2020 142 244 253 10.1016/j.ijbiomac.2019.09.096 31690471 72. Yang S.J. Lin F.H. Tsai K.C. Wei M.F. Tsai H.M. Wong J.M. Shieh M.J. Folic Acid-Conjugated Chitosan Nanoparticles Enhanced Protoporphyrin Ix Accumulation in Colorectal Cancer Cells Bioconjug. Chem. 2010 21 679 689 10.1021/bc9004798 20222677 73. Huang M. Myers C.R. Wang Y. You M. Mitochondria as a Novel Target for Cancer Chemoprevention: Emergence of Mitochondrial-Targeting Agents Cancer Prev. Res. 2021 14 285 306 10.1158/1940-6207.CAPR-20-0425 PMC8137522 33303695 74. Baghani L. Heris N.N. Khonsari F. Dinarvand S. Dinarvand M. Atyabi F. Trimethyl-Chitosan Coated Gold Nanoparticles Enhance Delivery, Cellular Uptake and Gene Silencing Effect of Egfr-Sirna in Breast Cancer Cells Front. Mol. Biosci. 2022 9 871541 10.3389/fmolb.2022.871541 35517864 PMC9065351 75. Kulkarni-Dwivedi N. Patel P.R. Shravage B.V. Umrani R.D. Paknikar K.M. Jadhav S.H. Hyperthermia and Doxorubicin Release by Fol-Lsmo Nanoparticles Induce Apoptosis and Autophagy in Breast Cancer Cells Nanomedicine 2022 17 1929 1949 10.2217/nnm-2022-0171 36645007 76. Quesada-González D. Merkoçi A. Quantum Dots for Biosensing: Classification and Applications Biosens. Bioelectron. 2025 273 117180 10.1016/j.bios.2025.117180 39864309 77. Pareek A. Kumar D. Pareek A. Gupta M.M. Advancing Cancer Therapy with Quantum Dots and Other Nanostructures: A Review of Drug Delivery Innovations, Applications, and Challenges Cancers 2025 17 878 10.3390/cancers17050878 40075725 PMC11898779 78. Ren L. Wang L. Rehberg M. Stoeger T. Zhang J. Chen S. Applications and Immunological Effects of Quantum Dots on Respiratory System Front. Immunol. 2021 12 795232 10.3389/fimmu.2021.795232 35069577 PMC8770806 79. Emami F. Duwa R. Banstola A. Woo S.M. Kwon T.K. Yook S. Dual Receptor Specific Nanoparticles Targeting Egfr and Pd-L1 for Enhanced Delivery of Docetaxel in Cancer Therapy Biomed. Pharmacother. 2023 165 115023 10.1016/j.biopha.2023.115023 37329708 80. Yi Y. Zhao H. Revolutionizing Tissue Clearing and 3-Dimensional Imaging: Transparent Embedding Solvent System for Uniform High-Resolution Imaging BME Front. 2025 6 95 10.34133/bmef.0095 39850149 PMC11754538 81. Merlin J.P.J. Crous A. Abrahamse, Combining Photodynamic Therapy and Targeted Drug Delivery Systems: Enhancing Mitochondrial Toxicity for Improved Cancer Outcomes Int. J. Mol. Sci. 2024 25 10796 10.3390/ijms251910796 39409125 PMC11477455 82. Mohkam M. Sadraeian M. Lauto A. Gholami A. Nabavizadeh S.H. Esmaeilzadeh H. Alyasin S. Exploring the Potential and Safety of Quantum Dots in Allergy Diagnostics Microsyst. Nanoeng. 2023 9 145 10.1038/s41378-023-00608-x 38025887 PMC10656439 83. Getz T. Qin J. Medintz I.L. Delehanty J.B. Susumu K. Dawson P.E. Dawson G. Quantum Dot-Mediated Delivery of Sirna to Inhibit Sphingomyelinase Activities in Brain-Derived Cells J. Neurochem. 2016 139 872 885 10.1111/jnc.13841 27622309 PMC5570548 84. Woutersen M. Muller A. Pronk M.E.J. Cnubben N.H.P. Hakkert B.C. Regulating Human Safety: How Dose Selection in Toxicity Studies Impacts Human Health Hazard Assessment and Subsequent Risk Management Options Regul. Toxicol. Pharmacol. 2020 114 104660 10.1016/j.yrtph.2020.104660 32334039 85. Jin M. Hou Y. Quan X. Chen L. Gao Z. Huang W. Smart Polymeric Nanoparticles with Ph-Responsive and Peg-Detachable Properties (Ii): Co-Delivery of Paclitaxel and Vegf Sirna for Synergistic Breast Cancer Therapy in Mice Int. J. Nanomed. 2021 16 5479 5494 10.2147/IJN.S313339 PMC8370882 34413645 86. Tiwari R. Patil A. Verma R. Deva V. Rudrangi S.R.S. Bhise M.R. Vinukonda A. Biofunctionalized Polymeric Nanoparticles for the Enhanced Delivery of Erlotinib in Cancer Therapy J. Biomater. Sci. Polym. Ed. 2025 36 817 842 10.1080/09205063.2024.2429328 39579362 87. Beach M.A. Nayanathara U. Gao Y. Zhang C. Xiong Y. Wang Y. Such G.K. Polymeric Nanoparticles for Drug Delivery Chem. Rev. 2024 124 5505 5616 10.1021/acs.chemrev.3c00705 38626459 PMC11086401 88. Thambiliyagodage C. Jayanetti M. Mendis A. Ekanayake G. Liyanaarachchi H. Vigneswaran S. Recent Advances in Chitosan-Based Applications—A Review Materials 2023 16 2073 10.3390/ma16052073 36903188 PMC10004736 89. Sharfi L. Nowroozi M.R. Smirnova G. Fedotova A. Babarykin D. Mirshafiey A. The Safety Properties of Sodium Alginate and Its Derivatives Br. J. Healthc. Med. Res. 2024 11 263 274 90. Mahar R. Chakraborty A. Nainwal N. Bahuguna R. Sajwan M. Jakhmola V. Application of Plga as a Biodegradable and Biocompatible Polymer for Pulmonary Delivery of Drugs AAPS PharmSciTech 2023 24 39 10.1208/s12249-023-02502-1 36653547 91. Moharir K. Kale V. Ittadwar A. Paul M.K. Polymeric Nanoparticle-Based Drug–Gene Delivery for Lung Cancer Handbook of Lung Targeted Drug Delivery Systems CRC Press Boca Raton, FL, USA 2021 193 207 92. Kuen C.Y. Masarudin M.J. Chitosan Nanoparticle-Based System: A New Insight into the Promising Controlled Release System for Lung Cancer Treatment Molecules 2022 27 473 10.3390/molecules27020473 35056788 PMC8778092 93. Yasamineh S. Gholizadeh O. Kalajahi H.G. Yasamineh P. Firouzi-Amandi A. Dadashpour M. Future Prospects of Natural Polymer-Based Drug Delivery Systems in Combating Lung Diseases Natural Polymeric Materials Based Drug Delivery Systems in Lung Diseases Springer Berlin/Heidelberg, Germany 2023 465 482 94. Gu M. Luan J. Song K. Qiu C. Zhang X. Zhang M. Development of Paclitaxel Loaded Pegylated Gelatin Targeted Nanoparticles for Improved Treatment Efficacy in Non-Small Cell Lung Cancer (Nsclc): An in Vitro and in Vivo Evaluation Study Acta Biochim. Pol. 2021 68 583 591 10.18388/abp.2020_5431 34355554 95. Dhuri A. Sriram A. Aalhate M. Mahajan S. Parida K.K. Singh H. Gupta U. Maji I. Guru S.K. Singh P.K. Chitosan Functionalized Pcl Nanoparticles Bearing Tyrosine Kinase Inhibitor Osimertinib Mesylate for Effective Lung Cancer Therapy Pharm. Dev. Technol. 2023 28 460 478 10.1080/10837450.2023.2206668 37092801 96. Vagena I.-A. Malapani C. Gatou M.-A. Lagopati N. Pavlatou E.A. Enhancement of Epr Effect for Passive Tumor Targeting: Current Status and Future Perspectives Appl. Sci. 2025 15 3189 10.3390/app15063189 97. Sharma A. Shambhwani D. Pandey S. Singh J. Lalhlenmawia H. Kumarasamy M. Singh S.K. Chellappan D.K. Gupta G. Prasher P. Advances in Lung Cancer Treatment Using Nanomedicines ACS Omega 2022 8 10 41 10.1021/acsomega.2c04078 36643475 PMC9835549 98. Hani U. Begum M.Y. Wahab S. Siddiqua A. Riyaz Ali M Osmani, Mohamed Rahamathulla, A Comprehensive Review of Current Perspectives on Novel Drug Delivery Systems and Approaches for Lung Cancer Management J. Pharm. Innov. 2022 17 1530 1553 10.1007/s12247-021-09582-1 99. Cojocaru E. Petriș O.R. Cojocaru C. Nanoparticle-Based Drug Delivery Systems in Inhaled Therapy: Improving Respiratory Medicine Pharmaceuticals 2024 17 1059 10.3390/ph17081059 39204164 PMC11357421 100. Dahlsgaard-Wallenius S.E. Hildebrandt M.G. Johansen A. Vilstrup M.H. Petersen H. Gerke O. Høilund-Carlsen P.F. Morsing A. Andersen T.L. Hybrid Pet/Mri in Non-Small Cell Lung Cancer (Nsclc) and Lung Nodules—A Literature Review Eur. J. Nucl. Med. Mol. Imaging 2021 48 584 591 10.1007/s00259-020-04955-z 32719914 101. Batouty N.M. Saleh G.A. Sharafeldeen A. Kandil H. Mahmoud A. Shalaby A. Yaghi M. Khelifi A. Ghazal M. El-Baz A. State of the Art: Lung Cancer Staging Using Updated Imaging Modalities Bioengineering 2022 9 493 10.3390/bioengineering9100493 36290461 PMC9598500 102. Anani T. Rahmati S. Sultana N. David A.E. Mri-Traceable Theranostic Nanoparticles for Targeted Cancer Treatment Theranostics 2021 11 579 601 10.7150/thno.48811 33391494 PMC7738852 103. Najdian A. Beiki D. Abbasi M. Gholamrezanezhad A. Ahmadzadehfar H. Amani A.M. Ardestani M.S. Assadi M. Exploring Innovative Strides in Radiolabeled Nanoparticle Progress for Multimodality Cancer Imaging and Theranostic Applications Cancer Imaging 2024 24 127 10.1186/s40644-024-00762-z 39304961 PMC11416024 104. Freitas L.F. Ferreira A.H. Thipe V.C. Varca G.H.C. Lima C.S.A. Batista J.G.S. Riello F.N. Nogueira K. Cruz C.P.C. Mendes G.O.A. The State of the Art of Theranostic Nanomaterials for Lung, Breast, and Prostate Cancers Nanomaterials 2021 11 2579 10.3390/nano11102579 34685018 PMC8539690 105. Zhao M. Leggett E. Bourke S. Poursanidou S. Carter-Searjeant S. Po S. Carmo M.P.D. Dailey L.A. Manning P. Ryan S.G. Theranostic near-Infrared-Active Conjugated Polymer Nanoparticles ACS Nano 2021 15 8790 8802 10.1021/acsnano.1c01257 33978405 106. Wen Y. Guo D. Zhang J. Liu X. Liu T. Li L. Jiang S. Wu D. Jiang H. Clinical Photoacoustic/Ultrasound Dual-Modal Imaging: Current Status and Future Trends Front. Physiol. 2022 13 1036621 10.3389/fphys.2022.1036621 36388111 PMC9651137 107. Shaikh K.I.M.A.J. Afzal O. Altamimi A.S.A. Almalki W.H. Alzarea S.I. Al-Abbasi F.A. Pandey M. Dureja H. Singh S.K. Dua K. Chitosan-Based Nano Drug Delivery System for Lung Cancer J. Drug Deliv. Sci. Technol. 2023 81 104196 10.1016/j.jddst.2023.104196 108. Pawar D. Jaganathan K.S. Mucoadhesive Glycol Chitosan Nanoparticles for Intranasal Delivery of Hepatitis B Vaccine: Enhancement of Mucosal and Systemic Immune Response Drug Deliv. 2016 23 185 194 10.3109/10717544.2014.908427 24825494 109. Zare M. Samani S.M. Sobhani Z. Enhanced Intestinal Permeation of Doxorubicin Using Chitosan Nanoparticles Adv. Pharm. Bull. 2018 8 411 417 10.15171/apb.2018.048 30276137 PMC6156480 110. Shali H. Shabani M. Pourgholi F. Hajivalili M. Aghebati-Maleki L. Jadidi-Niaragh F. Baradaran B. Akbari A.A.M.-S. Younesi V. Yousefi M. Co-Delivery of Insulin-Like Growth Factor 1 Receptor Specific Sirna and Doxorubicin Using Chitosan-Based Nanoparticles Enhanced Anticancer Efficacy in A549 Lung Cancer Cell Line Artif. Cells Nanomed. Biotechnol. 2018 46 293 302 10.1080/21691401.2017.1307212 28362176 111. Mahmood R.I. Al-Taie A. Al-Rahim A.M. Mohammed-Salih H.S. Ibrahim H.A. Albukhaty S. Jawad S.F. Jabir M.S. Salem M.M. Bekhit M.M. Biogenic Synthesized Selenium Nanoparticles Combined Chitosan Nanoparticles Controlled Lung Cancer Growth Via Ros Generation and Mitochondrial Damage Pathway Nanotechnol. Rev. 2025 14 20250142 10.1515/ntrev-2025-0142 112. Mahmoud M.A. El-Bana M.A. Morsy S.M. Badawy E.A. Farrag A.-E. Badawy A.M. Abdel-Wahhab M.A. El-Dosoky M.A. Synthesis and Characterization of Berberine-Loaded Chitosan Nanoparticles for the Protection of Urethane-Induced Lung Cancer Int. J. Pharm. 2022 618 121652 10.1016/j.ijpharm.2022.121652 35278602 113. Zhu X. Yu Z. Feng L. Deng L. Fang Z. Liu Z. Li Y. Wu X. Qin L. Guo R. Chitosan-Based Nanoparticle Co-Delivery of Docetaxel and Curcumin Ameliorates Anti-Tumor Chemoimmunotherapy in Lung Cancer Carbohydr. Polym. 2021 268 118237 10.1016/j.carbpol.2021.118237 34127219 114. Patel P. Raval M. Airao V. Ali N. Shazly G.A. Khan R. Prajapati B. Formulation of Folate Receptor-Targeted Silibinin-Loaded Inhalable Chitosan Nanoparticles by the Qbd Approach for Lung Cancer Targeted Delivery ACS Omega 2024 9 10353 10370 10.1021/acsomega.3c07954 38463259 PMC10918659 115. Rostami E. Recent Achievements in Sodium Alginate-Based Nanoparticles for Targeted Drug Delivery Polym. Bull. 2022 79 6885 6904 10.1007/s00289-021-03781-z 116. Huang J. Guo J. Zhu J. Zou X. Supported Silver Nanoparticles over Alginate-Modified Magnetic Nanoparticles: Synthesis, Characterization and Treat the Human Lung Carcinoma J. Saudi Chem. Soc. 2022 26 101393 10.1016/j.jscs.2021.101393 117. Veysi A. Yaghoobi-Ershadi M.R. Rassi Y. Hosseini-Vasoukolaei N. Jeddi-Tehrani M. Rezaee-Node A. Gholampour F. Saeidi Z. Fatemi M. Arandian M.H. Rearing and Biology of Phlebotomus Sergenti, the Main Vector of Anthroponotic Cutaneous Leishmaniasis in Iran J. Arthropod-Borne Dis. 2017 11 504 514 29367927 PMC5775157 118. Işıklan N. Geyik G. Güncüm E. Alginate-Based Bio-Nanocomposite Reinforced with Poly(2-Hydroxypropyl Methacrylamide) and Magnetite Graphene Oxide for Delivery of Etoposide and Photothermal Therapy Mater. Today Chem. 2024 41 102323 10.1016/j.mtchem.2024.102323 119. Parashar A.K. Saraogi G.K. Tiwari B.K. Tyagi L.K. Sethi V.A. Shrivastava V. Polymeric Nanoparticles-Based Strategies for Cancer Immunotherapy Nanotechnology Based Strategies for Cancer Immunotherapy: Concepts, Design, and Clinical Applications Sharma R. Pandey V. Mishra N. Springer Nature Singapore 2024 355 378 120. Milano F. Masi A. Madaghiele M. Sannino A. Salvatore L. Gallo N. Current Trends in Gelatin-Based Drug Delivery Systems Pharmaceutics 2023 15 1499 10.3390/pharmaceutics15051499 37242741 PMC10221778 121. Wu D. Cao X.-H. Jia P.-Z. Zeng Y.-J. Feng Y.-X. Tang L.-M. Zhou W.-X. Chen K.-Q. Excellent Thermoelectric Performance in Weak-Coupling Molecular Junctions with Electrode Doping and Electrochemical Gating Sci. China Phys. Mech. Astron. 2020 63 276811 10.1007/s11433-019-1528-y 122. Ali D.S. Gad H.A. Hathout R.M. Enhancing Effector Jurkat Cell Activity and Increasing Cytotoxicity against A549 Cells Using Nivolumab as an Anti-Pd-1 Agent Loaded on Gelatin Nanoparticles Gels 2024 10 352 10.3390/gels10060352 38920901 PMC11202840 123. Vaghasiya K. Ray E. Singh R. Jadhav K. Sharma A. Khan R. Katare O.P. Verma R.K. Efficient, Enzyme Responsive and Tumor Receptor Targeting Gelatin Nanoparticles Decorated with Concanavalin-a for Site-Specific and Controlled Drug Delivery for Cancer Therapy Mater. Sci. Eng. C 2021 123 112027 10.1016/j.msec.2021.112027 33812642 124. Kononenko V. Joukhan A. Bele T. Križaj I. Kralj S. Turk T. Drobne D. Gelatin Nanoparticles Loaded with 3-Alkylpyridinium Salt Aps7, an Analog of Marine Toxin, Are a Promising Support in Human Lung Cancer Therapy Biomed. Pharmacother. 2024 177 117007 10.1016/j.biopha.2024.117007 38906020 125. Chen Y.-J. Wang Z.-W. Lu T.-L. Gomez C.B. Fang H.-W. Wei Y. Tseng C.-L. The Synergistic Anticancer Effect of Dual Drug-(Cisplatin/Epigallocatechin Gallate) Loaded Gelatin Nanoparticles for Lung Cancer Treatment J. Nanomater. 2020 2020 9181549 10.1155/2020/9181549 126. Mehrotra N. Anees M. Tiwari S. Kharbanda S. Singh H. Polylactic Acid Based Polymeric Nanoparticle Mediated Co-Delivery of Navitoclax and Decitabine for Cancer Therapy Nanomedicine 2023 47 102627 10.1016/j.nano.2022.102627 36410699 127. Wang X. Choudhary S.M. Chauhan G. Muth A. Gupta V. Transferrin-Conjugated Polymeric Nanoparticles for Receptor-Mediated Delivery of Resveratrol-Cyclodextrin Complex in Non-Small Cell Lung Cancer (Nsclc) Cells J. Drug Deliv. Sci. Technol. 2025 105 106588 10.1016/j.jddst.2024.106588 128. Yao F. Lin L. Shi W. Li C. Liang Z. Huang C. Inhibitory Effect of Poly(Lactic-Co-Glycolic Acid) Nanoparticles Loaded with Resveratrol and Phosphatase and Tensin Homolog Deleted on Chromosome Ten (Pten) Sirna on Lung Cancer Cells Sci. Adv. Mater. 2022 14 810 817 10.1166/sam.2022.4265 129. Niza E. Ocaña A. Castro-Osma J.A. Bravo I. Alonso-Moreno C. Polyester Polymeric Nanoparticles as Platforms in the Development of Novel Nanomedicines for Cancer Treatment Cancers 2021 13 3387 10.3390/cancers13143387 34298604 PMC8304499 130. Lombardo R. Ruponen M. Rautio J. Lampinen R. Kanninen K.M. Koivisto A.M. Penttilä E. Löppönen H. Demartis S. Giunchedi P. A Technological Comparison of Freeze-Dried Poly-ɛ-Caprolactone (Pcl) and Poly (Lactic-Co-Glycolic Acid) (Plga) Nanoparticles Loaded with Clozapine for Nose-to-Brain Delivery J. Drug Deliv. Sci. Technol. 2024 93 105419 10.1016/j.jddst.2024.105419 131. Cabeza L. Ortiz R. Prados J. Delgado Á.V. Martín-Villena M.J. Clares B. Perazzoli G. Entrena J.M. Melguizo C. Arias J.L. Improved Antitumor Activity and Reduced Toxicity of Doxorubicin Encapsulated in Poly(ε-Caprolactone) Nanoparticles in Lung and Breast Cancer Treatment: An in Vitro and in Vivo Study Eur. J. Pharm. Sci. 2017 102 24 34 10.1016/j.ejps.2017.02.026 28219748 132. Akbari E. Mousazadeh H. Hanifehpour Y. Mostafavi E. Gorabi A.M. Nejati K. Peyman keyhanvar Pazoki-Toroudi H. Mohammadhosseini M. Akbarzadeh A. Co-Loading of Cisplatin and Methotrexate in Nanoparticle-Based Pcl-Peg System Enhances Lung Cancer Chemotherapy Effects J. Clust. Sci. 2022 33 1751 1762 10.1007/s10876-021-02101-9 133. Aorada S. Chittasupho C. Mangmool S. Angerhofer A. Imaram W. Gallic Acid-Encapsulated Pamam Dendrimers as an Antioxidant Delivery System for Controlled Release and Reduced Cytotoxicity against Arpe-19 Cells Bioconjug. Chem. 2024 35 1959 1969 39641479 10.1021/acs.bioconjchem.4c00475 PMC11660146 134. Guo Z. Li S. Liu Z. Xue W. Tumor-Penetrating Peptide-Functionalized Redox-Responsive Hyperbranched Poly(Amido Amine) Delivering Sirna for Lung Cancer Therapy ACS Biomater. Sci. Eng. 2018 4 988 996 10.1021/acsbiomaterials.7b00971 33418781 135. Bai S.-B. Cheng Y. Liu D.-Z. Ji Q.-F. Liu M. Zhang B.-L. Mei Q.-B. Zhou S.-Y. Bone-Targeted Pamam Nanoparticle to Treat Bone Metastases of Lung Cancer Nanomedicine 2020 15 833 849 10.2217/nnm-2020-0024 32163008 136. Yin Y. Li Y. Wang S. Dong Z. Liang C. Sun J. Wang C. Chai R. Fei W. Zhang J. Mscs-Engineered Biomimetic Pmaa Nanomedicines for Multiple Bioimaging-Guided and Photothermal-Enhanced Radiotherapy of Nsclc J. Nanobiotechnol. 2021 19 80 10.1186/s12951-021-00823-6 PMC7981797 33743720 137. Zare H. Ahmadi S. Ghasemi A. Ghanbari M. Rabiee N. Bagherzadeh M. Karimi M. Webster T.J. Hamblin M.R. Mostafavi E. Carbon Nanotubes: Smart Drug/Gene Delivery Carriers Int. J. Nanomed. 2021 16 1681 1706 10.2147/IJN.S299448 PMC7936533 33688185 138. Hanafy N.A.N. Optimally Designed Pegylatied Arabinoxylan Paclitaxel Nano-Micelles as Alternative Delivery for Abraxane®: A Potential Targeted Therapy against Breast and Lung Cancers Int. J. Biol. Macromol. 2025 293 139355 39743084 10.1016/j.ijbiomac.2024.139355 139. Bertino E.M. Williams T.M. Shilo K. Villalona-Calero M.A. Phillips G.S. Mo X. Otterson G.A. Phase 2 Trial of Nab-Paclitaxel Plus Carboplatin for Advanced Nsclc in Patients at Risk of Bleeding from Vegf Directed Therapies: Metastatic Non-Small Cell Lung Cancer Int. J. Radiat. Oncol. Biol. Phys. 2014 90 S45 10.1016/j.ijrobp.2014.08.232 140. Subbiah V. Grilley-Olson J.E. Combest A.J. Sharma N. Tran R.H. Bobe I. Osada A. Takahashi K. Balkissoon J. Camp A. Phase Ib/Ii Trial of Nc-6004 (Nanoparticle Cisplatin) Plus Gemcitabine in Patients with Advanced Solid Tumors Clin. Cancer Res. 2018 24 43 51 10.1158/1078-0432.CCR-17-1114 29030354 141. Ibrahim N.K. Desai N. Legha S. Soon-Shiong P. Theriault R.L. Rivera E. Esmaeli B. Ring S.E. Bedikian A. Hortobagyi G.N. Phase I and Pharmacokinetic Study of Abi-007, a Cremophor-Free, Protein-Stabilized, Nanoparticle Formulation of Paclitaxel Clin. Cancer Res. 2002 8 1038 1044 12006516 142. Lim E.A. Bendell J.C. Falchook G.S. Bauer T.M. Drake C.G. Choe J.H. George D.J. Karlix J.L. Ulahannan S. Sachsenmeier K.F. Phase Ia/B, Open-LabelOpen-Label, Multicenter Study of Azd4635 (an Adenosine A2a Receptor Antagonist) as Monotherapy or Combined with Durvalumab, in Patients with Solid Tumors Clin. Cancer Res. 2022 28 4871 4884 10.1158/1078-0432.CCR-22-0612 36044531 PMC9660540 143. Ashique S. Garg A. Mishra N. Raina N. Ming L.C. Tulli H.S. Behl T. Rani R. Gupta M. Nano-Mediated Strategy for Targeting and Treatment of Non-Small Cell Lung Cancer (Nsclc) Naunyn-Schmiedeberg’s Arch. Pharmacol. 2023 396 2769 2792 10.1007/s00210-023-02522-5 37219615 144. Su P. Pei W. Wang X. Ma Y. Jiang Q. Liang J. Zhou S. Zhao J. Liu J. Lu G.Q.M. Exceptional Electrochemical Her Performance with Enhanced Electron Transfer between Ru Nanoparticles and Single Atoms Dispersed on a Carbon Substrate Angew. Chem. Int. Ed. Engl. 2021 60 16044 16050 10.1002/anie.202103557 33960092 145. Srinivasarao D.A. Shah S. Famta P. Vambhurkar G. Jain N. Pindiprolu S. Sharma A. Kumar R. Padhy H.P. Kumari M. Unravelling the Role of Tumor Microenvironment Responsive Nanobiomaterials in Spatiotemporal Controlled Drug Delivery for Lung Cancer Therapy Drug Deliv. Transl. Res. 2025 15 407 435 10.1007/s13346-024-01673-z 39037533 146. Xu W. Yang S. Lu L. Xu Q. Wu S. Zhou J. Lu J. Fan X. Meng N. Ding Y. Influence of Lung Cancer Model Characteristics on Tumor Targeting Behavior of Nanodrugs J. Control. Release 2023 354 538 553 10.1016/j.jconrel.2023.01.026 36641120 147. Islam R. Maeda H. Fang J. Factors Affecting the Dynamics and Heterogeneity of the Epr Effect: Pathophysiological and Pathoanatomic Features, Drug Formulations and Physicochemical Factors Expert. Opin. Drug Deliv. 2022 19 199 212 10.1080/17425247.2021.1874916 33430661 148. Subhan M.A. Satya Siva Kishan Yalamarty, Nina Filipczak, Farzana Parveen, Vladimir P Torchilin, Recent Advances in Tumor Targeting Via Epr Effect for Cancer Treatment J. Pers. Med. 2021 11 571 10.3390/jpm11060571 34207137 PMC8234032 149. Kim J. Cho H. Lim D.-K. Joo M.K. Kim K. Perspectives for Improving the Tumor Targeting of Nanomedicine Via the Epr Effect in Clinical Tumors Int. J. Mol. Sci. 2023 24 10082 10.3390/ijms241210082 37373227 PMC10298311 150. Elmowafy M. Shalaby K. Elkomy M.H. Alsaidan O.A. Gomaa H.A.M. Abdelgawad M.A. Mostafa E.M. Polymeric Nanoparticles for Delivery of Natural Bioactive Agents: Recent Advances and Challenges Polymers 2023 15 1123 10.3390/polym15051123 36904364 PMC10007077 151. Sabir F. Qindeel M. Zeeshan M. Ain Q.U. Rahdar A. Barani M. González E. Aboudzadeh M.A. Onco-Receptors Targeting in Lung Cancer Via Application of Surface-Modified and Hybrid Nanoparticles: A Cross-Disciplinary Review Processes 2021 9 621 10.3390/pr9040621 152. Yu M. Mathew A. Liu D. Chen Y. Wu J. Zhang Y. Zhang N. Microfluidics for Formulation and Scale-up Production of Nanoparticles for Biopharma Industry Microfluidics in Pharmaceutical Sciences: Formulation, Drug Delivery, Screening, and Diagnostics Lamprou D.A. Weaver E. Springer Nature Cham, Switzerland 2024 395 420 153. Worku D.A. Hewitt V. The Role and Economics of Immunotherapy in Solid Tumour Management J. Oncol. Pharm. Pract. 2020 26 2020 2024 10.1177/1078155220963190 33036547 PMC7720357 154. Cangut B. Akinlusi R. Mohseny A. Ghesani N. Ghesani M. Evolving Paradigms in Lung Cancer: Latest Trends in Diagnosis, Management, and Radiopharmaceuticals Semin. Nucl. Med. 2025 55 264 276 10.1053/j.semnuclmed.2025.02.005 40055050 155. Salaudeen H.D. Akinniranye R.D. Precision Nanotechnology for Early Cancer Detection and Biomarker Identification Int. J. Res. Publ. Rev. 2024 5 6313 6327 10.55248/gengpi.5.1124.3404 156. Desai N. Rana D. Patel M. Bajwa N. Prasad R. Vora L.K. Nanoparticle Therapeutics in Clinical Perspective: Classification, Marketed Products, and Regulatory Landscape Small 2025 21 2502315 10.1002/smll.202502315 40454890 PMC12288819 157. Junyaprasert V.B. Thummarati P. Innovative Design of Targeted Nanoparticles: Polymer–Drug Conjugates for Enhanced Cancer Therapy Pharmaceutics 2023 15 2216 10.3390/pharmaceutics15092216 37765185 PMC10537251 158. Yang T. Zhai J. Hu D. Yang R. Wang G. Li Y. Liang G. “Targeting Design” of Nanoparticles in Tumor Therapy Pharmaceutics 2022 14 1919 10.3390/pharmaceutics14091919 36145668 PMC9501451 159. Kim Y. Kim J. Eom S. Jun H. Lee H.B. Jeong D. Kang S. Protein Nanoparticles Simultaneously Displaying Trail and Egfr-Binding Ligands Effectively Induce Apoptotic Cancer Cell Death and Overcome Egfr-Tki Resistance in Lung Cancer ACS Appl. Mater. Interfaces 2025 17 25139 25151 10.1021/acsami.5c04021 40237189 160. Nagime P.V. Singh S. Chidrawar V.R. Rajput A. Syukri D.M. Marwan N.T. Shafi S. Moringa Oleifera: A Plethora of Bioactive Reservoirs with Tremendous Opportunity for Green Synthesis of Silver Nanoparticles Enabled with Multifaceted Applications Nano-Struct. Nano-Objects 2024 40 101404 10.1016/j.nanoso.2024.101404 161. Rakaee M. Tafavvoghi M. Ricciuti B. Alessi J.V. Cortellini A. Citarella F. Nibid L. Perrone G. Adib E. Fulgenzi C.A.M. Deep Learning Model for Predicting Immunotherapy Response in Advanced Non-Small Cell Lung Cancer JAMA Oncol. 2025 11 109 118 10.1001/jamaoncol.2024.5356 39724105 PMC11843371 Figure 1 Diagrammatic representation of the global burden of lung cancer. Figure 2 Illustration of the etiology of lung cancer. Figure 3 Effects of APS7-GNPs and cisplatin on colony formation of A549 lung cancer cells in normal and nicotine-containing conditions. ( A B C D p p p 124 Figure 4 Three-dimensional spheroid assay evaluating the impact of treatments on H1299 tumor spheroid growth. ( A B C D p p 127 Figure 5 ( A n B n C D E 131 pharmaceutics-17-01091-t001_Table 1 Table 1 Comparing conventional and novel therapies for lung cancer management. Therapy Aspect Conventional Therapies Novel Therapies References Primary treatment types  - Surgery (lobectomy, pneumonectomy) - Chemotherapy (platinum-based) - Radiation therapy (external beam)  - Targeted therapy (EGFR inhibitor/PI3K inhibitor) - Immunotherapy (PD-1/PD-L1 inhibitors) - Stereotactic body radiotherapy (SBRT) [ 40 43 44 Mechanism of action  - Cytotoxic drugs kill rapidly dividing cells - Radiation induces DNA damage  - Targeted drugs block specific oncogenic pathways - Immunotherapy enhances T-cell antitumor activity [ 13 Response rates  - 20–30% for chemotherapy - 30–50% for radiation in early stages  - 60–80% for targeted therapy in mutation-positive cases - 20–40% durable responses with immunotherapy [ 14 Adverse reactions  - Bone marrow suppression - Nausea/vomiting - Radiation pneumonitis  - Immune-related adverse events (colitis, pneumonitis) - Skin rash with EGFR inhibitors [ 45 46 47 48 Personalization level  - Largely based on cancer stage and histology  - Requires molecular profiling (NGS) - Biomarker-driven (PD-L1, TMB) [ 49 50 51 52 5-Year survival benefit  - 15–20% for stage III chemo-radiation - 40–50% for early-stage surgery  - 25–30% for stage IV with targeted therapy - 15–25% long-term survivors with immunotherapy [ 52 53 54 55 pharmaceutics-17-01091-t002_Table 2 Table 2 Comprehensive tabular summary of polymeric reduced green metallic nanoparticles (PRGM NPs) in lung cancer management. Aspect Key Findings References Targeted imaging Folic acid-conjugated chitosan nanoparticles (fCNA) significantly enhanced protoporphyrin IX (PpIX) accumulation in colorectal cancer cells (HT29, Caco-2) via folate receptor-mediated endocytosis, improving tumor detection. [ 72 Chemotherapy Mitochondria-targeted green AuNPs increased reactive oxygen species (ROS) 4.2-fold in H460 cells and reduced tumor volume by 72% in xenografts (5 mg/kg dose). [ 73 siRNA delivery Chitosan-coated AuNPs delivered EGFR siRNA to A549 xenografts, reducing tumor growth by 65% (0.5 mg/kg, q3d × 4 weeks). [ 74 Combo therapy Fol-LSMO NPs enable targeted hyperthermia with DOX release in breast cancer. Triggers apoptosis and autophagy via caspase/LC3-II pathways. Folate conjugation enhances uptake, reduces off-target effects. [ 75 pharmaceutics-17-01091-t003_Table 3 Table 3 Comparative overview of key polymers, targeting approaches, and delivery routes for polymeric NPs in lung cancer therapy. Category Examples Advantages Limitations References Polymers PLGA Biodegradable and biocompatible; FDA-approved; tunable degradation; suitable for controlled and sustained release; compatible with multiple drugs Acidic degradation products may cause local irritation; relatively slow drug release for hydrophilic drugs [ 90 PEG Improves hydrophilicity; prolongs circulation time by reducing opsonization; reduces immunogenicity; enhances stability Can cause “accelerated blood clearance” on repeated dosing; non-biodegradable (requires clearance); potential hypersensitivity reactions [ 91 Chitosan Natural, biocompatible and biodegradable; mucoadhesive; enhances permeation; pH-sensitive release; modifiable for active targeting Poor solubility at neutral pH; batch-to-batch variability; limited mechanical strength [ 92 Alginate Biocompatible; gel-forming; modifiable; good for protein/peptide encapsulation; supports multiple routes Low mechanical stability without crosslinking; limited cell uptake without modifications [ 93 Gelatin Biodegradable; non-toxic; versatile for surface modification; good for protein drugs Enzymatic degradation may be too rapid; requires crosslinking for stability [ 94 PCL Slow degradation—good for long-term release; high drug loading for hydrophobic drugs Not ideal for rapid drug release; long-term persistence may cause accumulation [ 95 Targeting approach Passive targeting (EPR effect) Simple design; no need for complex ligand chemistry; good for solid tumors with leaky vasculature Tumor heterogeneity limits EPR efficiency; significant off-target uptake (liver/spleen) [ 96 Active targeting (ligands, antibodies, peptides) Higher tumor specificity; receptor-mediated uptake; can bypass some resistance mechanisms Requires detailed knowledge of tumor receptor profile; ligand conjugation adds complexity and cost; receptor heterogeneity may reduce efficacy [ 97 Delivery Routes Intravenous (IV) Enables systemic delivery; suitable for metastatic disease; can exploit both passive and active targeting Risk of systemic toxicity; opsonization and clearance by MPS [ 98 Pulmonary (inhalation) Localized delivery to lung tumors; bypasses first-pass metabolism; reduces systemic toxicity Formulation stability in aerosol form; variability in lung deposition; mucociliary clearance [ 99 Oral Patient compliance; potential for chronic therapy Poor bioavailability for many drugs; degradation in GI tract; first-pass metabolism [ 91 Intratumoral High local concentration; minimal systemic exposure Invasive; limited use for inaccessible tumors [ 97 pharmaceutics-17-01091-t004_Table 4 Table 4 Imaging modalities integrated with polymeric nanoparticles for lung cancer theranostics. Imaging Modality Key Advantages and Limitations in Lung Cancer Theranostics References MRI High soft-tissue contrast, non-ionizing; sensitive tracking of NP biodistribution; lower molecular sensitivity; gadolinium safety concerns. [ 102 CT Excellent spatial resolution, widely available; uses ionizing radiation, low molecular sensitivity, possible metal-agent toxicity. [ 103 PET Highest molecular sensitivity, quantitative biodistribution, detects metastases; short isotope half-lives, radiation exposure, complex radiochemistry. [ 104 SPECT Good sensitivity, longer-lived isotopes, whole-body tracking; lower spatial resolution than PET, regulatory hurdles. [ 94 Optical (NIR, NIR-II) High sensitivity, real-time surgical guidance; limited tissue penetration, autofluorescence, mainly preclinical use. [ 105 Ultrasound/Photoacoustic Real-time, no ionizing radiation, depth improvement with PA; lung air limits access, microbubble stability issues. [ 106 pharmaceutics-17-01091-t005_Table 5 Table 5 Studies for polymeric NPs for lung cancer management. Type of Polymeric NPs Drug Encapsulated/Cell Line Used In Vitro/In Vivo Studies Outcome References Chitosan Carbamazepine In vivo Enhanced brain targeting and therapeutic efficacy at 219 nm and 80% drug entrapment [ 92 Glycol-modified chitosan Hepatitis B vaccines In vivo Enhanced mucosal delivery [ 108 Chitosan DOX In vivo Enhanced intestinal absorption [ 137 Chitosan Paclitaxel—MDA-MB-231 breast cancer cells Both Enhanced anticancer activity compared to free paclitaxel in MDA-MB-231 breast cancer cells [ 137 Chitosan DOX, siRNA, IGF-1R—A549 lung cancer cell line In vitro Improve anticancer efficacy in A549 lung cancer cell line [ 110 Chitosan Berberine—urethane-induced lung cancer in male albino mice In vivo Prevented tumor angiogenesis by reducing levels of serum VEGFR2 and lung HIF-1 gene expression, oral administration and eco-friendly alternative [ 112 Gelatin Nivolumab—A549 lung carcinoma cell In vitro 87.88% inhibition rate, increased potency [ 122 PEGylated gelatin Paclitaxel NSCLC Both Highest antiproliferative effect, 100% survival, maximum tumor inhibition [ 94 Gelatin Concanavalin A—A549 lung cancer cells In vitro Increased apoptosis by boosted drug release [ 123 Gelatin APS7 and cisplatin—A549 cells In vitro Improved cisplatin efficacy by blocking nicotine-induced calcium influx [ 124 Polycaprolactone DOX—E0771 breast cancer cells and lung models Both Reduced DOX cardiotoxicity and improved anticancer activity [ 131 Poly(amidoamine) Docetaxel (DTX)-alendronate (ALN)—A549 cells and mouse model Both Enhanced DTX anticancer activity [ 135 pharmaceutics-17-01091-t006_Table 6 Table 6 Summary of clinical trials on polymeric NPs for lung cancer management. Clinical Trial ID/Registration No. Polymeric NP Type/Formulation Drug/Therapeutic Agent Study Phase Study Design Target Population Primary Outcome Measures Status/Sponsor Reference NCT00729612 Albumin based NP Paclitaxel Phase II Interventional NSCLC, Advanced Stage PFS, OS Completed/Greg Otterson, Ohio State University Comprehensive Cancer Center [ 139 NCT02240238 Cisplatin NP Gemcitabine Phase I and II Interventional NSCLC, solid tumors Safety, MTD Completed/Nano Carrier Co., Ltd. [ 140 NCT00073723 Protein formulation ABI-007, Protein formulation of paclitaxel Phase I and II Interventional NSCLC Safety, MTD Completed/Celgene Corporation [ 141 NCT04314895 NanoPac Paclitaxel Phase II Interventional NSCLC, SCLC, Neoplasm of lung Safety, MTD Completed/NanOlogy, LLC. [ 140 NCT02740985 Capsule nanoparticle suspension Durvalumab Phase Ib Interventional NSCLC PFS, ORR, Safety Completed/AstraZeneca [ 142 pharmaceutics-17-01091-t007_Table 7 Table 7 Factors influencing EPR effect variability and their impact on clinical translation. Factor Influence on EPR Effect Impact on Clinical Translation References Tumor type Highly angiogenic tumors (e.g., liver, some breast cancers) exhibit greater vascular permeability; desmoplastic tumors (e.g., pancreatic, some lung tumors) have restricted NP extravasation. Nanomedicine accumulation varies widely; EPR-based delivery more effective in leaky tumors, less so in fibrotic or poorly vascularized tumors. [ 147 Tumor size Small, rapidly growing tumors have immature, leaky vasculature; large tumors may have hypoxic or necrotic cores with poor perfusion. Drug penetration is reduced in large tumors; dosing strategies may need to be tailored to tumor growth stage. [ 148 Tumor location Location determines local blood flow and vessel permeability; tumors in highly vascularized organs differ from those in low-perfusion or protected areas (e.g., brain). EPR effect is less pronounced in tumors with restricted access (e.g., behind the BBB), limiting passive targeting efficacy. [ 149 Tumor microenvironment Dense extracellular matrix, high interstitial fluid pressure, and stromal barriers reduce NP penetration. May necessitate combination strategies (e.g., stromal modulation, vascular normalization) to enhance delivery. [ 147 Patient-specific physiology Variations in vascular density, permeability, and immune response affect NP clearance and distribution. Personalized nanomedicine design and patient stratification may improve therapeutic predictability. [ 148 ",
  "metadata": {
    "Title of this paper": "Deep Learning Model for Predicting Immunotherapy Response in Advanced Non-Small Cell Lung Cancer",
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472848/"
  }
}