{
  "title": "Paper_1135",
  "abstract": "pmc Oxf Med Case Reports Oxf Med Case Reports 2698 omcr omcr Oxford Medical Case Reports 2053-8855 Oxford University Press PMC12476553 PMC12476553.1 12476553 12476553 41025029 10.1093/omcr/omaf178 omaf178 1 Case Report AcademicSubjects/MED00010 Development of medullary thyroid carcinoma on a toxic nodule: about an exceptional case https://orcid.org/0000-0002-5012-1981 Halouache Ali  Endocrinology, Diabetology and Metabolic Diseases Department military hospital Oued Eddahab Agadir Morocco Abainou Lahoussaine  Endocrinology, Diabetology and Metabolic Diseases Department military hospital Oued Eddahab Agadir Morocco Agouri Hajar  Anathomopathology Department military hospital Oued Eddahab Agadir Morocco Tbouda Mohammed  Anathomopathology Department military hospital Oued Eddahab Agadir Morocco Nakkabi Ismael  Otolaryngology surgery Department military hospital Oued Eddahab Agadir Morocco Corresponding author. Endocrinology, Diabetology and Metabolic Diseases Department military hospital Oued Eddahab, Agadir, Morocco. E-mail: alihalouache@gmail.com 9 2025 28 9 2025 2025 9 497162 omaf178 19 5 2025 24 7 2025 13 8 2025 28 09 2025 29 09 2025 30 09 2025 © The Author(s) 2025. Published by Oxford University Press. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract We report the case of a 60-year-old hypertensive female patient who presented with an anterior neck swelling associated with local compression signs. TSH levels were in favor of hyperthyroidism. Cervical ultrasound showed two nodules classified as EU-TIRADS III, one of which, located at the lower right pole, was hyperfunctioning on I-123 scintigraphy. After total thyroidectomy, the histopathological study confirmed that the toxic nodule corresponded to a medullary thyroid carcinoma. Calcitonin levels were 115.6 ng/L (N < 10 ng/L). The staging workup, as well as the MEN screening, were unremarkable. An extensive lymph node dissection was performed, revealing no lymph node involvement. toxic adenoma thyroid medullary carcinoma calcitonin pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Medullary thyroid carcinoma (MTC) accounts for 5 to 10% of thyroid cancers. It develops from the parafollicular C cells and has a tumor marker: calcitonin. The most common way it is discovered is through the detection of a thyroid adenoma, which is non-secreting in almost all cases. However, the development of MTC from a toxic nodule is an exceptional situation. We report a case of a toxic nodule, surgically treated, whose anatomopathological study was in favor of MTC. Case report Mrs. T.F., a 60-year-old woman with hypertension treated with dual therapy, consulted for an anterior neck swelling discovered on self-palpation, associated with intermittent dysphonia and dysphagia to solids. She had lost 10 kilograms of weight over the past 3 months and experienced palpitations that worsened with stress. Clinical examination did not reveal signs of thyrotoxicosis other than hypertension and tachycardia. Cervical examination showed a WHO grade I goiter of elastic consistency; the site of a lower right nodule, painless, mobile on swallowing, and with regular borders. Examination of the lymph node areas did not reveal any lymphadenopathy. Biological tests showed a suppressed TSH at 0.01 IU/ml (N: [0.35–4.9]) and a normal free thyroxine 4 level at 0.97 ng/dl. There were no signs of autoimmunity. Cervical ultrasound revealed two nodules: the first and largest was in the lower right pole, oval, isoechoic, heterogeneous, well-defined, measuring 26 × 19 mm, classified as EU-TIRADS 3. The second was in the lower left pole, tissue-like, isoechoic containing cystic loculations, measuring 14 × 10 mm, classified as EU-TIRADS 3. Given these findings, a Tc-99 m thyroid scintigraphy was requested, which showed an appearance consistent with a multinodular goiter with a hot nodule in the lower right lobe, almost completely suppressing the rest of the thyroid parenchyma. ( Fig. 1 Figure 1 Ultrasound (a) and Tc-99 m thyroid scintigraphy (b) of our patient. Therefore, a total thyroidectomy was decided upon, and the anatomopathological examination of the surgical specimen revealed morphological features and an immunohistochemical profile consistent with a low-grade medullary thyroid carcinoma corresponding to the right lobe nodule ( fig. 2 Figure 2 Results of the anatomopathological study of the surgical specimen: (a): Calcitonin antibody ×20, (b): TTF1 antibody ×20, (c): Ki 67 antibody ×20. Calcitonin levels were 115.6 ng/l (N < 10 ng/l), chromogranin A was 182 ng/ml (N < 108), and ACE was 84 ng/ml (N < 4.1). In the context of a multiple endocrine neoplasia type 2; urinary metoxylated derivatives measured after diagnosis were negative, and the calcium-phosphate balance was normal. The staging workup (cervico-thoraco-abdomino-pelvic CT scan, bone scan) did not reveal any distant metastases. A bilateral lymph node dissection was performed, the anatomopathological study of which did not reveal any lymph node metastases (Right neck dissection of groups IIa, III and IV: 0 positive nodes/12 nodes examined; Left neck dissection of groups IIb, IIa, III and IV: 0 positive nodes/11 nodes examined). Genetic testing for RET gene mutation (sequencing of exons 8, 10, 11, 13, 14, 15, 16 out of 21 exons) was negative. Discussion Toxic thyroid nodules account for 5 to 10% of thyroid nodules [ 1 2 3 4 However, the risk of malignancy observed in hot nodules is higher than expected [ 5 6 7 Often, lymphadenopathy is associated with the thyroid nodule in patients with MTC [ 8 Basal calcitonin measurement plays an important role in the diagnosis, prognosis, and postoperative follow-up of MTC. Nevertheless, there is a dilemma as to whether or not it should be measured in all patients with a thyroid nodule [ 9 10 11 4 Before proceeding with a total thyroidectomy, the gold standard treatment for MTC, it is important to complete the diagnosis with a staging workup, as well as the search for other components of multiple endocrine neoplasia (MEN), particularly pheochromocytoma, which can be life-threatening if not treated beforehand [ 12 Total thyroidectomy with central lymph node dissection is considered the standard treatment for MTC [ 12 8 In fact, there is a positive correlation between calcitonin levels and the tumor stage of MTC. In our case, this level exceeded 100 ng/ml, which was suggestive of lateral lymph node involvement [ 13 A follow-up consultation is scheduled after 3 months. If the calcitonin level becomes undetectable, the surveillance frequency is biannual for the first year, then annually. Otherwise, the calcitonin level will dictate the management. The presence of metastases is probable when it exceeds 150 pg/ml; a level below 10 pg/ml should be supplemented by a stimulation test, and in intermediate cases, this level should be checked after 3 months [ 14 Conclusion This exceptional clinical case challenges and excludes the prevalent idea that a toxic nodule is invariably benign, thereby emphasizing the importance of systematic calcitonin measurement in the evaluation of any thyroid nodule, including toxic ones, particularly when thyroidectomy is indicated. This would allow us to avoid the need for reoperation and to perform precise preoperative staging. However, this suggestion faces technical barriers related to the cost and availability of this measurement, particularly in our context. Acknowledgements No Acknowledgements to declare. Authors’ contributions Ali Halouache and Lahoussaine Abainou: collected data and wrote the article. Hajar Agouri and Mohamed Tbouda: drafted the anatomopathological data. Ismael Nakabi: wrote the discussion. Funding None declared. Ethical approval No ethical approval is required for de-identified single case reports based on our institutional policies. Competing interests The authors declare no competing interest. Consent Written informed consent was obtained from a legally authorized representative(s) for anonymized patient information to be published in this article. Guarantor ALI HALOUACHE, Tel: +212 690 325 937, ORCID: 0000-0002-5012-1981, Email: alihalouache@gmail.com. References 1. Durante C Costante G Lucisano get, and al: the natural history of benign thyroid nodules JAMA. 2015 926 935 10.1001/jama.2015.0956 25734734 2. Corvilain B The natural history of thyroid autonomy and hot nodules Ann Endocrinol (Paris) 2003 64 17 22 12707627 3. Moreno-Reyes R Kyrilli A Lytrivi M et al. Is there still a role for thyroid scintigraphy in the workup of a thyroid nodule in the era of fine needle aspiration cytology and molecular testing F1000Res 2016 5 1 8 10.12688/f1000research.7893.1 PMC4850874 27158470 4. Durante C Hegedüs L Czarniecka A et al. 2023: European thyroid association clinical practice guidelines for thyroid nodule management Eur Thyroid J 12 e230067 10.1530/ETJ-23-0067 37358008 PMC10448590 5. Lau LW Ghaznavi S Frolkis AD et al. Malignancy risk of hyperfunctioning thyroid nodules compared with non-toxic nodules: systematic review and a meta-analysis Thyroid Res 14 3 10.1186/s13044-021-00094-1 PMC7905613 33632297 6. Sapalidis K Papanastasiou A Michalopoulos N et al. A rare coexistence of medullary thyroid cancer with graves disease: a case report and systematic review of the literature Am J Case Rep 2019 20 1398–1401 10.12659/AJCR.917642 PMC6777386 31542789 7. Pazaitou-Panayiotou K Michalakis R Paschke R Paschke.: thyroid cancer in patients with hyperthyroidism Horm Metab Res 2012 44 255 62 10.1055/s-0031-1299741 22334393 8. Pelizza MR Mazza EE Mian C et al. Medullary thyroid carcinoma Expert Rev Anticancer Ther 2023 943 957 10.1080/14737140.2023.2247566 37646181 9. Trimboli P Camponovo C Ruinelli L The dilemma of routine testing for calcitonin thyroid nodule's patients to detect or exclude medullary carcinoma: one single negative test should be valuable as rule-out strategy to avoid further calcitonin measurements over time Endocrine 2022 77 10.1007/s12020-022-03047-2 PMC9242962 35391593 10. Verbeek HHG de Groot JWB Sluiter WJ et al. Calcitonin testing for detection of medullary thyroid cancer in people with thyroid nodules Cochrane Database Syst Rev 2020 2020 CD010159 10.1002/14651858.CD010159.pub2 PMC7075519 32176812 11. Giannetta E Guarnotta V Altieri B et al. Calcitonin in thyroid and extra-thyroid neuroendocrine neoplasms: the two-faced Janus Eur J Endocrinol 2020 183 R197 215 10.1530/EJE-20-0506 33112280 12. Wells SA Asa SL Dralle H et al. Revised American thyroid association guidelines for the management of medullary thyroid carcinoma Thyroid 2015 25 567 610 10.1089/thy.2014.0335 25810047 PMC4490627 13. Danila R Livadariu R Branisteanu D Calcitonin revisited in 2020 Acta Endo (Buc) 2019 15 544–8 10.4183/aeb.2019.544 PMC7200115 32377257 14. Costante G Meringolo D Calcitonin as a biomarker of C cell disease: recent achievements and current challenges Endocrine. 2020 67 273 80 10.1007/s12020-019-02183-6 31925733 ",
  "metadata": {
    "Title of this paper": "Calcitonin as a biomarker of C cell disease: recent achievements and current challenges",
    "Journal it was published in:": "Oxford Medical Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476553/"
  }
}