{
  "title": "Paper_795",
  "abstract": "pmc Front Nutr Front Nutr 2731 fnut Front. Nutr. Frontiers in Nutrition 2296-861X Frontiers Media SA PMC12464962 PMC12464962.1 12464962 12464962 41019567 10.3389/fnut.2025.1657646 1 Nutrition Original Research Comparative study on the predictive value of TyG, TyG-BMI, and TG/HDL-C for progression-free survival in patients with locally advanced nasopharyngeal carcinoma Xiao Zhehao  1 Liang Zhuowei  1 Chen Weiling  1 Huang Hejing  1 Qu Song  1  2  * 1 Department of Radiation Oncology, Guangxi Medical University Cancer Hospital Nanning, Guangxi China 2 Key Laboratory of Early Prevention and Treatment for Regional High Frequency Tumor (Guangxi Medical University), Ministry of Education Nanning, Guangxi China Edited by: Hui-Xin Liu Reviewed by: Karem Salem Radha Vaddavalli *Correspondence: Song Qu, qusong@sr.gxmu.edu.cn 12 9 2025 2025 12 480739 1657646 01 7 2025 03 9 2025 12 09 2025 27 09 2025 29 09 2025 Copyright © 2025 Xiao, Liang, Chen, Huang and Qu. 2025 Xiao, Liang, Chen, Huang and Qu https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background This study aimed to explore the relationship between the triglyceride glucose (TyG) index, triglyceride glucose-body mass index (TyG-BMI), and triglyceride-to-high-density lipoprotein cholesterol ratio (TG/HDL-C) of locally advanced nasopharyngeal carcinoma (LA-NPC) and progression-free survival (PFS) to investigate their potential as prognostic indicators. Methods This research involved a retrospective analysis of data pertaining to patients with LA-NPC from the Guangxi Medical University Cancer Hospital. The analysis categorized patients into a progression group and a control group according to their disease control status. The correlation of three indicators with PFS was established utilizing the Cox proportional hazards model, Kaplan–Meier (K-M) analysis, and restricted cubic spline (RCS) analysis. Three predictive models were developed based on the three indicators, and their predictive ability was assessed. Results TyG, TyG-BMI, and TG/HDL-C are independent predictors of PFS in LA-NPC patients, and all exhibit a non-linear relationship. Patients in the high TyG, TyG-BMI, and TG/HDL-C groups have significantly lower PFS compared to those in the low groups, and this effect persists after adjusting for confounding factors. A multivariate analysis confirmed that lactate dehydrogenase (LDH) and EBV_DNA are also independent prognostic factors for PFS. The models that utilize these indicators outperform traditional tumor node metastasis (TNM) staging, with the TyG-based model demonstrating the strongest predictive ability for PFS. Conclusion TyG, TyG-BMI, and TG/HDL-C are potential prognostic biomarkers for the evaluation of PFS in individuals diagnosed with LA-NPC. Our research underscores the potential of these three indices to be utilized to enhance prognostic assessment and customize treatment strategies in the management of LA-NPC. nasopharyngeal carcinoma locally advanced TyG TyG-BMI TG/HDL-C The author(s) declare that financial support was received for the research and/or publication of this article. This study was funded by the Guangxi Science and Technology Program (GUIKEAB25069065). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Nutrition and Metabolism Introduction Nasopharyngeal carcinoma (NPC) is a neoplastic malignancy located in the head-and-neck region, with a prevalence that is particularly notable in Southeast Asia, ranking 23rd in global cancer incidence ( 1 2 3 4 Insulin resistance (IR) is acknowledged as a significant risk factor for various metabolic disorders and cardiovascular diseases ( 5 6 7 8 9 10 11 12 Materials and methods Patient screening This investigation is retrospective in nature and involves the collection of data from a cohort of 761 patients diagnosed with LA-NPC at Guangxi Medical University Cancer Hospital between January 2015 and June 2021. The inclusion criteria for patients were as follows: (1) clear diagnosis of NPC through histopathological examination; (2) staging according to the eighth edition of the American Joint Committee on Cancer (AJCC) as T3-4N0-1M0 or T1-4N2-3M0; (3) Eastern Cooperative Oncology Group (ECOG) score of 0–1; and (4) age between 18 and 70 years. The exclusion criteria for patients were as follows: (1) presence of other cancers; (2) incomplete follow-up information; and (3) missing key pre-treatment laboratory indicators such as triglyceride (TG) and fasting blood glucose (FBG). Data collection We collected pre-treatment laboratory test results for all patients, including WBC, hemoglobin (HB), platelet (PLT), neutrophilic granulocyte (NE), total cholesterol (TC), TG, HDL, low-density lipoprotein (LDL), FBG, and EBV-DNA copy number. Population variable characteristics included patients’ height, weight, history of smoking and alcohol, history of cardiovascular diseases, diabetes, and hypertriglyceridemia. Treatment-related data included the methods received by patients and the specific details of each treatment plan administered. Additionally, we obtained each patient’s disease control and survival status from the case follow-up system. Progression-free survival (PFS) was defined as the duration from the point of diagnosis to the initial indication of disease progression or mortality. The cutoff date for follow-up in this study was 30 June 2024. Medical records of all cases were anonymized and de-identified before analysis. This study has been approved by the Ethics Committee of Guangxi Medical University Cancer Hospital (protocol code KY2024883) and strictly complied with the Helsinki Declaration. The Ethics Committee of Guangxi Medical University Cancer Hospital agreed to exempt patients from signing informed consent. Definition and calculation of indicators TYG index = ln [ ( fasting TG ) × FBG / 2 ] ( mmol / L ) ; BMI = weight ( KG ) ÷ height 2 ( M ) ; TYG − BMI index = TYG ∗ BMI . Statistical analysis Continuous variables were analyzed using the Mann–Whitney U-test, and the results were recorded as the median within the interquartile range. Categorical variables were analyzed using the chi-square test or Fisher’s exact test and recorded as percentages (%). The relationship between the TyG index, TyG-BMI, and TG/HDL-C ratio with PFS was determined using the Kaplan–Meier (K-M) curves and the Cox proportional hazards models. Additionally, the variance inflation factor (VIF) was used to test for multicollinearity, with a VIF of <5 indicating no multicollinearity among variables, ensuring the independence of variables in the study. Restricted cubic spline (RCS) was used to further explore the dose–response relationship between the three indices and PFS. Finally, we constructed three risk prediction models based on the aforementioned three indices, validating the accuracy of the models using calibration curves; the receiver operating characteristic (ROC) curve analysis was performed to compare the predictive ability, sensitivity, and specificity of the three models for patient PFS. Decision curve analysis (DCA) was used to evaluate the clinical net benefit of the models. A p Results Patients A total of 761 patients were evaluated using the electronic medical record system, excluding 212 patients without complete follow-up information and 174 patients with missing pre-treatment laboratory test results. Ultimately, we included 375 patients with LA-NPC ( Figure 1 Figure 1 Flowchart of patient inclusion. Flowchart showing patient selection for analysis. Initially, 761 patients with locally advanced nasopharyngeal carcinoma were identified. Of these, 212 had unclear disease control status or were lost to follow-up, and 174 had missing clinical indicators. This left 549 patients with complete follow-up information, resulting in 375 included in the final analysis. Among these, 140 experienced disease progression or death, while 235 achieved disease control. Among the 375 patients, 271 (72.3%) were men, with a median age of 46 years and a median follow-up duration of 59.3 months. As of 30 June 2024, 140 patients experienced disease progression or death, while the remaining 235 patients had stable disease. All patients received chemotherapy and radiotherapy, with only two patients undergoing induction chemotherapy (IC) combined with radiotherapy, while the remaining patients received IC combined with concurrent chemoradiotherapy (CCRT). All radiotherapy methods used intensity-modulated radiation therapy (IMRT), with a radiation dose of gross tumor volume (GTV): 68–74 Gy/30–34 fractions. Statistically significant variations were observed in the expression levels of LDH, TG, HDL, TYG, TYG-BMI, TG/HDL-C, and EBV-DNA, as well as clinical staging between the two groups of patients, while no statistical differences were found in other variables ( Table 1 Table 1 Patient demographics and baseline characteristics. Characteristics Disease status p Overall, N Controlled, N Progressive, N Sex 1 0.780 3 Female 104 (27.7%) 64 (27.2%) 40 (28.6%) Male 271 (72.3%) 171 (72.8%) 100 (71.4%) Age 1 46 (39, 53) 43 (38, 53) 49 (40, 53) 0.052 4 ECOG 1 0.238 3 0 273 (72.8%) 176 (74.9%) 97 (69.3%) 1 102 (27.2%) 59 (25.1%) 43 (30.7%) Smoking 1 0.227 3 No 250 (66.7%) 162 (68.9%) 88 (62.9%) Yes 125 (33.3%) 73 (31.1%) 52 (37.1%) Alcohol 1 0.767 3 No 278 (74.1%) 173 (73.6%) 105 (75.0%) Yes 97 (25.9%) 62 (26.4%) 35 (25.0%) Cardiovascular disease 1 0.530 2 No 347 (92.5%) 219 (93.2%) 128 (91.4%) Yes 28 (7.5%) 16 (6.8%) 12 (8.6%) Diabetes 1 0.376 5 No 363 (96.8%) 229 (97.4%) 134 (95.7%) Yes 12 (3.2%) 6 (2.6%) 6 (4.3%) Hypertriglyceridemia 1 No 344 (91.7%) 217 (92.3%) 127 (90.7%) 0.580 Yes 31 (8.3%) 18 (7.7%) 13 (9.3%) IC regimen 1 0.914 3 GP 146 (38.9%) 91 (38.7%) 55 (39.3%) TPF 229 (61.1%) 144 (61.3%) 85 (60.7%) CCRT 1 0.531 5 No 2 (0.5%) 2 (0.9%) 0 (0.0%) Yes 373 (99.5%) 233 (99.1%) 140 (100.0%) AC 1 >0.999 5 No 363 (96.8%) 227 (96.6%) 136 (97.1%) Yes 12 (3.2%) 8 (3.4%) 4 (2.9%) Immunotherapy 1 0.753 5 No 364 (97.1%) 227 (96.6%) 137 (97.9%) Yes 11 (2.9%) 8 (3.4%) 3 (2.1%) Targeted therapy 1 0.1403 No 270 (72.0%) 163 (69.4%) 107 (76.4%) Yes 105 (28.0%) 72 (30.6%) 33 (23.6%) LDH 2 180 (158, 222) 175 (152, 201) 201 (168, 260) <0.001  4 ALB 2 39.2 (37.1, 41.3) 39.3 (37.1, 41.4) 39.0 (37.1, 41.1) 0.600 4 TC 2 4.82 (4.32, 5.44) 4.82 (4.35, 5.42) 4.81 (4.27, 5.52) 0.760 4 TG 2 1.29 (0.99, 1.71) 1.13 (0.85, 1.56) 1.53 (1.22, 1.90) <0.001  4 HDL 2 1.14 (1.01, 1.32) 1.15 (1.04, 1.33) 1.10 (0.98, 1.31) 0.010  4 LDL 2 3.19 (2.69, 3.72) 3.19 (2.68, 3.65) 3.17 (2.73, 3.78) 0.354 4 FBG 2 4.61 (4.28, 5.05) 4.59 (4.24, 4.94) 4.68 (4.30, 5.27) 0.079 4 WBC 2 6.92 (5.80, 8.08) 6.93 (5.77, 8.07) 6.92 (5.84, 8.09) 0.682 4 HB 2 137 (127, 147) 139 (127, 148) 136 (127, 144) 0.104 4 PLT 2 266 (231, 315) 266 (231, 310) 266 (233, 325) 0.378 4 NE 2 4.17 (3.40, 5.25) 4.16 (3.40, 5.26) 4.19 (3.42, 5.15) 0.705 4 BMI 2 2 22.99 (21.26, 24.68) 22.86 (21.07, 24.61) 23.05 (21.72, 25.10) 0.149 4 TyG 2 6.86 (6.61, 7.20) 6.72 (6.44, 7.09) 7.05 (6.85, 7.32) <0.001  4 TyG_BMI 2 157 (142, 176) 150 (139, 171) 164 (151, 180) <0.001  4 TG/HDL_C 2 1.10 (0.83, 1.54) 0.98 (0.72, 1.38) 1.35 (1.05, 1.74) <0.001  4 EBV_DNA 1 <0.001  3 <1,000 250 (66.7%) 179 (76.2%) 71 (50.7%) ≥1,000 125 (33.3%) 56 (23.8%) 69 (49.3%) T_stage 1 0.580 3 1 19 (5.1%) 13 (5.5%) 6 (4.3%) 2 85 (22.7%) 57 (24.3%) 28 (20.0%) 3 141 (37.6%) 89 (37.9%) 52 (37.1%) 4 130 (34.7%) 76 (32.3%) 54 (38.6%) N_stage 1 0.169 5 0 6 (1.6%) 5 (2.1%) 1 (0.7%) 1 89 (23.7%) 62 (26.4%) 27 (19.3%) 2 142 (37.9%) 90 (38.3%) 52 (37.1%) 3 138 (36.8%) 78 (33.2%) 60 (42.9%) cTNM 1 0.001  3 III 124 (33.1%) 92 (39.1%) 32 (22.9%) IVA 251 (66.9%) 143 (60.9%) 108 (77.1%) 1 2 3 4 5 TyG, TyG-BMI, and TG/HDL-C and their prognosis in LA-NPC The univariate Cox analysis indicated that TyG (HR = 2.70, 95% CI: 2.02–3.61), TyG-BMI (HR = 1.02, 95% CI: 1.01–1.02), and TG/HDL-C (HR = 1.33, 95% CI: 1.20–1.47) were risk factors for patients’ PFS. In addition, pre-treatment LDH (HR = 1.00, 95% CI: 1.00–1.01), EBV-DNA (HR = 2.26, 95% CI: 1.62–3.16), and cTNM staging (HR = 1.85, 95% CI: 1.25–2.74) were also associated with poorer PFS in patients. We performed a collinearity analysis of TyG, TyG-BMI, and TG/HDL-C together with LDH, EBV-DNA, and cTNM staging, and the VIF values were all less than 5, indicating that there was no collinearity between TyG, TyG-BMI, and TG/HDL-C in relation to LDH, EBV-DNA, and cTNM ( Figure 2 Figure 2 The univariate Cox regression analysis of all variables related to progression-free survival. A forest plot showing the hazard ratio (HR) with 95% confidence intervals (CI) and p-values for various characteristics. Significant p-values are indicated in bold. Variables include sex, age, ECOG, smoking, alcohol, cardiovascular disease, diabetes, hypercholesterolemia, IC regimen, AC, immunotherapy, targeted therapy, LDH, and others. HR values vary, with some exceeding 1, implying increased risk, such as TyG (HR 2.70, p<0.001) and EBV_DNA ≥1000 (HR 2.26, p<0.001). The plot covers a range from 0.4 to 20.1 on the log scale. In addition, we established three Cox proportional hazards models for TyG, TyG-BMI, and TG/HDL-C, respectively. The test results of the patients for the aforementioned indicators were arranged in ascending order and divided into three equal parts, categorized as low, medium, and high groups. Model 1 was not adjusted for any variables. Model 2 was a partially adjusted model that accounted for sex, age, ECOG performance status, smoking, alcohol, cardiovascular disease, diabetes, hypertriglyceridemia, chemotherapy regimen, immunotherapy, and targeted therapy. Model 3 was a comprehensively adjusted model that accounted for variables such as sex, age, ECOG performance status, smoking, alcohol, cardiovascular disease, diabetes, hypertriglyceridemia, chemotherapy regimen, immunotherapy, targeted therapy, LDH, ALB, LDL, EBV_DNA, T_stage, and N_stage. The findings indicated that, in the unadjusted model, the partially adjusted model, and the fully adjusted model, TyG, TyG-BMI, and TG/HDL-CI remained prognostic factors for patients’ PFS, whether analyzed as continuous variables or categorical variables ( Table 2 p p p Figure 3 Table 2 Association between TyG, TyG_BMI, and TG/HDL_C and PFS (Cox regression). Characteristics Model 1 Model 2 Model 3 HR 1 95% CI 1 p HR 1 95% CI 1 p HR 1 95% CI 1 p TyG (continuous) 2.70 2.02, 3.61 <0.001 3.69 2.18, 6.26 <0.001 3.42 2.43, 4.81 <0.001 TyG L (<6.69) – – – – – – M (≥6.69, <7.08) 4.40 2.56, 7.57 <0.001 3.94 2.25, 6.89 <0.001 4.17 2.37, 7.34 <0.001 H (≥7.08) 5.05 2.96, 8.62 <0.001 3.85 2.03, 7.31 <0.001 5.65 3.22, 9.91 <0.001 P for trend <0.001 <0.001 <0.001 TyG_BMI (continuous) 1.02 1.01, 1.02 <0.001 1.02 1.01, 1.03 <0.001 1.02 1.02, 1.03 <0.001 TyG_BMI L (<147) – – – – – – M (≥147, <169) 3.34 2.04, 5.46 <0.001 3.40 2.06, 5.61 <0.001 3.70 2.21, 6.20 <0.001 H (≥169) 3.35 2.05, 5.47 <0.001 3.77 2.26, 6.29 <0.001 4.00 2.38, 6.73 <0.001 P for trend <0.001 <0.001 <0.001 TG/HDL_C (continuous) 1.33 1.20, 1.47 <0.001 1.36 1.21, 1.52 <0.001 1.46 1.29, 1.65 <0.001 TG/HDL_C L (<0.93) – – – – – – M (≥0.93, <1.37) 4.00 2.37, 6.75 <0.001 4.01 2.36, 6.82 <0.001 4.26 2.47, 7.32 <0.001 H (≥1.37) 4.82 2.88, 8.06 <0.001 4.89 2.88, 8.30 <0.001 5.42 3.15, 9.32 <0.001 P for trend <0.001 <0.001 <0.001 1 Figure 3 The Kaplan–Meier survival analysis of progression-free survival (A) (B) (C) Three Kaplan-Meier plots showing progression-free survival probabilities over time for different groups. Panel A compares groups based on Tyg index, Panel B on Tyg_BMI, and Panel C on TG/HDL-C. Each plot includes three groups with low, medium, and high values, represented by different colors: red, yellow, and blue, respectively. Time is in months. All plots show a significant difference with p<0.001. A table below each plot provides the number at risk for each group at various time points. A more in-depth examination of the linear correlation between the three aforementioned variables and PFS is warranted. In the complete model, the RCS curve results show that TyG ( p p p Figure 4 Figure 4 The restricted cubic spline regression analysis of progression-free survival in patients (A) (B) (C) Three graphs labeled A, B, and C, display hazard ratios with ninety-five percent confidence intervals. Each graph features a histogram overlaid with a blue curve and shaded area. Graph A shows TyG with an inflection point of 6.95. Graph B shows TyG_BMI with an inflection point of 160. Graph C shows TG/HDL_C with an inflection point of 1.30. All graphs have p-values less than 0.001, indicating significant nonlinear relationships. Model based on TyG, TyG-BMI, and TG/HDL-C We developed three nomograms to predict patient prognosis based on TyG ( Figure 5A Figure 5B Figure 5C Figure 5D Figure 5E Figure 5F Figure 5 Prediction models for patients’ progression-free survival; (A) (B) (C) (D) (E) (F) Panel A, B, and C show nomograms for predicting five-year progression-free survival (PFS) using different models incorporating T stage, N stage, and various biomarkers. Panel D presents a calibration plot comparing predicted probabilities with actual proportions across models. Panel E displays a receiver operating characteristic (ROC) curve assessing the sensitivity and specificity of the models, with area under the curve (AUC) values provided. Panel F illustrates a decision curve analysis, showing net benefit across different threshold probabilities for several predictive models. Discussion To the best of our knowledge, this research represents the inaugural examination of the relationship between the TyG, TyG-BMI, and TG/HDL-C ratio with the prognosis of LA-NPC. We found that higher pre-treatment levels of TyG, TyG-BMI, and TG/HDL-C ratio were linked to a reduced PFS in patients, and this relationship remained statistically significant even after controlling for potential confounding variables. Additionally, the TyG index demonstrated a certain advantage in predicting patients’ PFS in relation to the TyG-BMI and TG/HDL-C ratios. Abnormal lipid metabolism is typically characterized by decreased TC, TG, and HDL-C ( 13 14 15 16 17 18 19 20 21 22 Diabetes and elevated FBG have been associated with various cancers ( 23 24 25 26 27 p 28 29 30 TyG, as a comprehensive indicator that combines lipid metabolism and glucose metabolism levels, has been confirmed to have a predictive value for cancer risk and act as a supplementary measure of insulin resistance. A meta-analysis showed that a higher TyG index may elevate the likelihood of developing cancer (total effect size = 1.14, 95% CI: 1.08, 1.20) ( 31 32 33 34 35 36 37 38 The most important clinical significance of this study lies in its potential translational value. Pre-treatment TyG, TyG-BMI, and TG/HDL-C, as easily accessible metabolic indicators, can provide an effective risk stratification tool for patients with LA-NPC. First, in terms of follow-up strategies, for high-risk patients with elevated levels of these indicators, more intensive follow-up plans could be considered, such as shortening the intervals between imaging examinations or more frequent monitoring of EBV_DNA, to enable early detection and intervention for disease progression or recurrence. Second, in terms of treatment strategies, these findings provide a basis for exploring personalized adjuvant therapies in the future. Given the potential biological link between insulin resistance and tumor progression, it is worth investigating the feasibility of adding insulin sensitizers (such as metformin) or adjusting the intensity of adjuvant chemotherapy for high-risk patients on top of standard treatment. Finally, in patient management, these indicators can serve as warning signals for lifestyle interventions. Clinicians can use them to provide enhanced dietary and exercise guidance to patients with metabolic abnormalities, which may not only improve cancer prognosis but also benefit the patients’ long-term overall health. This study is subject to certain limitations. First, it is a retrospective analysis conducted at a single center. Notably, 212 patients were excluded due to missing follow-up information, which may significantly impact the reliability and generalizability of the study results. This reduction in sample size can decrease statistical power, potentially making it unable to detect true clinical differences. Although it is difficult to completely avoid the issue of missing data in retrospective studies, future research should aim to reduce bias by strengthening follow-up management and employing sensitivity analyses. Second, a potential limitation of this study is that we only analyzed the baseline levels of metabolic biomarkers. Since the concentrations of these molecules may change over time, our approach did not capture their dynamic fluctuations. This may affect the accuracy of our assessment of the associations between these biomarkers and clinical outcomes. Future studies involving longitudinal repeated measurements to monitor changes in these metabolites will help to more comprehensively reveal their clinical significance. Conclusion The research identified a notable correlation between the pre-treatment TyG, TyG-BMI, and TG/HDL-C with the PFS of LA-NPC patients and, based on this correlation, three models were established, with the TyG-based model outperforming the other two. Our investigation underscores the promise of these three indicators in enhancing prognostic evaluations and tailoring treatment strategies for locally advanced LA-NPC. Further research is necessary to validate these findings and to investigate the underlying mechanisms related to the prognosis of NPC. Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Ethics statement The studies involving humans were approved by Ethics Committee of Guangxi Medical University Cancer Hospital. The studies were conducted in accordance with the local legislation and institutional requirements. The ethics committee/institutional review board waived the requirement of written informed consent for participation from the participants or the participants’ legal guardians/next of kin because this manuscript is a retrospective observational study and contains no identifiable patient information. Author contributions ZX: Investigation, Conceptualization, Writing – review & editing, Software, Writing – original draft. ZL: Writing – review & editing, Writing – original draft. WC: Writing – original draft, Investigation, Writing – review & editing. HH: Investigation, Writing – review & editing. SQ: Writing – original draft, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 229 63 10.3322/caac.21834 38572751 2. Juarez-Vignon Whaley JJ Afkhami M Sampath S Amini A Bell D Villaflor VM Early stage and locally advanced nasopharyngeal carcinoma treatment from present to future: where are we and where are we going? Curr Treat Options Oncol 2023 24 845 66 10.1007/s11864-023-01083-2 37145382 PMC10271909 3. Hui EP Leung SF Au JS Zee B Tung S Chua D Lung metastasis alone in nasopharyngeal carcinoma: a relatively favorable prognostic group. A study by the Hong Kong nasopharyngeal carcinoma study group Cancer 2004 101 300 6 10.1002/cncr.20358 15241827 4. Luo W Nasopharyngeal carcinoma ecology theory: cancer as multidimensional spatiotemporal \"unity of ecology and evolution\" pathological ecosystem Theranostics 2023 13 1607 31 10.7150/thno.82690 37056571 PMC10086202 5. Hill MA Yang Y Zhang L Sun Z Jia G Parrish AR Insulin resistance, cardiovascular stiffening and cardiovascular disease Metabolism 2021 119 154766 10.1016/j.metabol.2021.154766 33766485 6. Esposito K Chiodini P Colao A Lenzi A Giugliano D Metabolic syndrome and risk of cancer: a systematic review and meta-analysis Diabetes Care 2012 35 2402 11 10.2337/dc12-0336 23093685 PMC3476894 7. Sun XJ Zhang P Li HH Jiang ZW Jiang CC Liu H Cisplatin combined with metformin inhibits migration and invasion of human nasopharyngeal carcinoma cells by regulating E-cadherin and MMP-9 Asian Pac J Cancer Prev 2014 15 4019 23 10.7314/apjcp.2014.15.9.4019 24935589 8. Min Y Wei X Wei Z Song G Zhao X Lei Y Prognostic effect of triglyceride glucose-related parameters on all-cause and cardiovascular mortality in the United States adults with metabolic dysfunction-associated steatotic liver disease Cardiovasc Diabetol 2024 23 188 10.1186/s12933-024-02287-y 38824550 PMC11144336 9. Giannini C Santoro N Caprio S Kim G Lartaud D Shaw M The triglyceride-to-HDL cholesterol ratio: association with insulin resistance in obese youths of different ethnic backgrounds Diabetes Care 2011 34 1869 74 10.2337/dc10-2234 21730284 PMC3142016 10. Alagiakrishnan K Halverson T Role of peripheral and central insulin resistance in neuropsychiatric disorders J Clin Med 2024 13 13 10.3390/jcm13216607 39518747 PMC11547162 11. Cai C Chen C Lin X Zhang H Shi M Chen X An analysis of the relationship of triglyceride glucose index with gastric cancer prognosis: a retrospective study Cancer Med 2024 13 e6837 10.1002/cam4.6837 38204361 PMC10905246 12. Li J Chen J Liu H Yan S Wang Y Xing M Association of the triglyceride-glucose index with the occurrence and recurrence of colorectal adenomas: a retrospective study from China BMC Public Health 2024 24 579 10.1186/s12889-024-18076-x 38395868 PMC10885480 13. Bian X Liu R Meng Y Xing D Xu D Lu Z Lipid metabolism and cancer J Exp Med 2021 218 218 10.1084/jem.20201606 33601415 PMC7754673 14. Häggström C Jonsson H Bjørge T Nagel G Manjer J Ulmer H Linear age-course effects on the associations between body mass index, triglycerides, and female breast and male liver cancer risk: an internal replication study of 800, 000 individuals Int J Cancer 2020 146 58 67 10.1002/ijc.32240 30815851 15. Lin F Zheng R Yu C Su Y Yan X Qu F Predictive role of serum cholesterol and triglycerides in cervical cancer survival Int J Gynecol Cancer 2021 31 171 6 10.1136/ijgc-2020-001333 33051246 16. Moorman PG Hulka BS Hiatt RA Krieger N Newman B Vogelman JH Association between high-density lipoprotein cholesterol and breast cancer varies by menopausal status Cancer Epidemiol Biomarkers Prev 1998 7 483 8 9641492 17. Huang R Chen K Jiang Y Li L Zhu X Development of prognostic nomogram based on lipid metabolic markers and lactate dehydrogenase in non-metastatic nasopharyngeal carcinoma J Inflamm Res 2023 16 3093 107 10.2147/jir.S416801 37520664 PMC10378618 18. Xie Z Shao Y The predictive value of serum lipids for eye metastases in male nasopharyngeal carcinoma patients Biosci Rep 2020 40 40 10.1042/bsr20201082 32584390 PMC7317591 19. Siemianowicz K Gminski J Stajszczyk M Wojakowski W Goss M Machalski M Serum HDL cholesterol concentration in patients with squamous cell and small cell lung cancer Int J Mol Med 2000 6 307 11 10.3892/ijmm.6.3.307 10934294 20. Jerby L Wolf L Denkert C Stein GY Hilvo M Oresic M Metabolic associations of reduced proliferation and oxidative stress in advanced breast cancer Cancer Res 2012 72 5712 20 10.1158/0008-5472.Can-12-2215 22986741 21. Dai D Chen B Wang B Tang H Li X Zhao Z Pretreatment TG/HDL-C ratio is superior to triacylglycerol level as an independent prognostic factor for the survival of triple negative breast Cancer patients J Cancer 2016 7 1747 54 10.7150/jca.15776 27698913 PMC5039397 22. Kong L Zhao Q Han Z Xue W Hu Z Niu Z Prognostic significance of TG/HDL-C and non-HDL-C/HDL-C ratios in patients with non-small cell lung cancer: a retrospective study J Int Med Res 2022 50 3000605221117211 10.1177/03000605221117211 35949158 PMC9373166 23. Lega IC Lipscombe LL Review: diabetes, obesity, and Cancer-pathophysiology and clinical implications Endocr Rev 2020 41 41 10.1210/endrev/bnz014 31722374 24. Luo J Chen YJ Chang LJ Fasting blood glucose level and prognosis in non-small cell lung cancer (NSCLC) patients Lung Cancer 2012 76 242 7 10.1016/j.lungcan.2011.10.019 22112292 25. Minicozzi P Berrino F Sebastiani F Falcini F Vattiato R Cioccoloni F High fasting blood glucose and obesity significantly and independently increase risk of breast cancer death in hormone receptor-positive disease Eur J Cancer 2013 49 3881 8 10.1016/j.ejca.2013.08.004 24011933 26. Zhang M Hu X Kang Y Xu W Yang X Association between fasting blood glucose levels at admission and overall survival of patients with pancreatic cancer BMC Cancer 2021 21 131 10.1186/s12885-021-07859-9 33549043 PMC7866692 27. OuYang PY Su Z Tang J Lan XW Mao YP Deng W Diabetes, prediabetes and the survival of nasopharyngeal carcinoma: a study of 5,860 patients PLoS One 2014 9 e111073 10.1371/journal.pone.0111073 25350747 PMC4211733 28. Supabphol S Seubwai W Wongkham S Saengboonmee C High glucose: an emerging association between diabetes mellitus and cancer progression J Mol Med 2021 99 1175 93 10.1007/s00109-021-02096-w 34036430 29. Sayed S Faruq O Preya UH Kim JT Cathepsin S knockdown suppresses endothelial inflammation, angiogenesis, and complement protein activity under hyperglycemic conditions in vitro by inhibiting NF-κB signaling Int J Mol Sci 2023 24 24 10.3390/ijms24065428 36982499 PMC10049538 30. Adham SA Al Rawahi H Habib S Al Moundhri MS Viloria-Petit A Coomber BL Modeling of hypo/hyperglycemia and their impact on breast cancer progression related molecules PLoS One 2014 9 e113103 10.1371/journal.pone.0113103 25401697 PMC4234670 31. Wang H Yan F Cui Y Chen F Wang G Cui W Association between triglyceride glucose index and risk of cancer: a meta-analysis Front Endocrinol 2022 13 1098492 10.3389/fendo.2022.1098492 36714554 PMC9877418 32. Song Y Jiang L Han Y Zhang S Li S Triglyceride-glucose index and glycemic dynamics in pancreatic ductal adenocarcinoma: implications for disease progression and prognosis J Transl Med 2024 22 708 10.1186/s12967-024-05524-w 39080703 PMC11290143 33. Huo RR Zhai L Liao Q You XM Changes in the triglyceride glucose-body mass index estimate the risk of stroke in middle-aged and older Chinese adults: a nationwide prospective cohort study Cardiovasc Diabetol 2023 22 254 10.1186/s12933-023-01983-5 37716947 PMC10505325 34. Wang F He T Wang G Han T Yao Z Association of triglyceride glucose-body mass index with non-small cell lung cancer risk: a case-control study on Chinese adults Front Nutr 2022 9 1004179 10.3389/fnut.2022.1004179 36313086 PMC9614218 35. Guo S Zhao Y Jiang Y Ye H Wang Y Increased pretreatment triglyceride glucose-body mass index associated with poor prognosis in patients with advanced non-small cell lung cancer Clin Nutr ESPEN 2024 59 412 21 10.1016/j.clnesp.2023.12.018 38220404 36. Dikaiou P Edqvist J Lagergren J Adiels M Björck L Rosengren A Body mass index and risk of cancer in young women Sci Rep 2024 14 6245 10.1038/s41598-024-56899-1 38485791 PMC10940279 37. Petrelli F Cortellini A Indini A Tomasello G Ghidini M Nigro O Association of Obesity with Survival Outcomes in patients with Cancer: a systematic review and Meta-analysis JAMA Netw Open 2021 4 e213520 10.1001/jamanetworkopen.2021.3520 33779745 PMC8008284 38. Murata D Azuma K Matsuo N Murotani K Matama G Kawahara A Survival and biomarkers for cachexia in non-small cell lung cancer receiving immune checkpoint inhibitors Cancer Med 2023 12 19471 9 10.1002/cam4.6549 37712645 PMC10587946 Glossary EMT Epithelial-mesenchymal transition K-M Kaplan–Meier LA-NPC Locally advanced NPC LDH Lactate dehydrogenase LDL Low-density lipoprotein NE Neutrophilic granulocyte NPC Nasopharyngeal carcinoma NSCLC Non-small cell lung cancer OS Overall survival PFS Progression-free survival PLT Platelet RCS Restricted cubic spline ROC Receiver operating characteristic TC Total cholesterol TG Triglyceride TyG Triglyceride glucose TyG-BMI Triglyceride glucose-body mass index TG/HDL-C Triglyceride-to-high-density lipoprotein cholesterol ratio VEGF Vascular endothelial growth factor VEGFR2 VEGF-VEGF receptor-2 VIF Variance inflation factor WBC Leukocyte ",
  "metadata": {
    "Title of this paper": "Survival and biomarkers for cachexia in non-small cell lung cancer receiving immune checkpoint inhibitors",
    "Journal it was published in:": "Frontiers in Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12464962/"
  }
}