{
  "title": "Paper_1057",
  "abstract": "Indian J Clin Biochem Indian J Clin Biochem 1356 ijclbio Indian Journal of Clinical Biochemistry 0970-1915 0974-0422 Springer PMC11436542 PMC11436542.1 11436542 11436542 39346722 10.1007/s12291-024-01222-y 1222 1 Review Article Anti-tumor Effects of Polyphenols via Targeting Cancer Driving Signaling Pathways: A Review Moar Kareena Yadav Somu Pant Anuja Deepika http://orcid.org/0000-0003-0971-4600 Maurya Pawan Kumar pkmaurya@cuh.ac.in https://ror.org/03mtwkv54 grid.448761.8 0000 0004 1772 8225 Department of Biochemistry, Central University of Haryana, 2 5 2024 10 2024 39 4 471673 470 488 9 2 2024 2 4 2024 01 10 2025 01 10 2025 29 09 2024 01 10 2025 © The Author(s), under exclusive licence to Association of Clinical Biochemists of India 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 The use of drugs in chemotherapy poses numerous side effects. Hence the use of natural substances that can help in the prevention and cure of the disease is a dire necessity. Cancer is a deadly illness and combination of diseases, the menace of which is rising with every passing year. The research community and scientists from all over the world are working towards finding a cure of the disease. The use of polyphenols which are naturally derived from plants have a great potential to be used as anti-cancer drugs and also the use of fruits and vegetables which are rich in these polyphenols can also help in the prevention of diseases. The study aims to compile the available literature and research studies on the anti-cancer effects of polyphenols and the signaling pathways that are affected by them. To review the anti-cancer effects of polyphenols, Google Scholar, PubMed and ScienceDirect were used to study the literature available. The article that have been used for literature review were filtered using keywords including cancer, polyphenols and signaling pathways. Majorly articles from the last 10 years have been considered for the review but relevant articles from earlier than 10 years have also been considered. Almost 400 articles were studied for the review and 200 articles have been cited. The current review shows the potential of polyphenols as anti-cancer compounds and how the consumption of a diet rich in polyphenols can help in the prevention of cancer. Because of their capacity to affect a variety of oncogenic and oncosuppressive signaling pathways, phytochemicals derived from plants have been effectively introduced as an alternative anticarcinogenic medicines. Graphical Abstract  Keywords Anti-cancer Cancer Natural products Polyphenol Signaling pathways pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Association of Clinical Biochemists of India 2024 ",
  "metadata": {
    "Title of this paper": "Anti-tumor Effects of Polyphenols via Targeting Cancer Driving Signaling Pathways: A Review",
    "Journal it was published in:": "Indian Journal of Clinical Biochemistry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11436542/"
  }
}