{
  "title": "Paper_159",
  "abstract": "pmc J Pharm Anal J Pharm Anal 3328 jpa Journal of Pharmaceutical Analysis 2095-1779 2214-0883 Xi'an Jiaotong University PMC12495438 PMC12495438.1 12495438 12495438 10.1016/j.jpha.2025.101228 S2095-1779(25)00045-0 101228 1 Original Article ZFP36 promotes ferroptosis and mitochondrial dysfunction and inhibits malignant progression in osteosarcoma by regulating the E2F1/ATF4 axis Qin Shiyue a Kong Hongyang konghongyang1991@163.com b ⁎⁎ Jiang Lei 19952969962@163.com jianglei20230419@njmu.edu.cn b ⁎ a b ⁎ 19952969962@163.com jianglei20230419@njmu.edu.cn ⁎⁎ konghongyang1991@163.com 9 2025 12 2 2025 15 9 496264 101228 24 9 2024 26 12 2024 9 2 2025 12 02 2025 05 10 2025 05 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Zinc finger protein 36 (ZFP36) was found to be downregulated in osteosarcoma (OS) tumor tissues. We aimed to investigate the roles and mechanisms of ZFP36 in ferroptosis regulation during OS development. Two Gene Expression Omnibus (GEO) datasets showed that ZFP36 was a differentially expressed gene (DEG) in OS. Western blot and immunohistochemistry results showed that ZFP36 was downregulated in OS tumors and cell lines. ZFP36 overexpression plasmids and small interfering RNAs (siRNAs) were respectively transfected into OS cells. ZFP36 overexpression restrained proliferation, migration, and invasion in MG63 and U2OS cells, while ZFP36 knockdown displayed the opposite results. Moreover, ZFP36 overexpression increased the levels of intracellular Fe 2+ in vivo Graphical abstract Image 1 Highlights • ZFP36 overexpression restrained OS cell proliferation, migration, and invasion. • ZFP36 overexpression promoted OS cell ferroptosis and mitochondrial dysfunction. • ZFP36 inhibited OS progression by regulating the E2F1/ATF4 axis. • ZFP36 overexpression suppressed tumor growth in OS xenograft mouse model. Keywords Osteosarcoma ZFP36 E2F1 ATF4 Ferroptosis Mitochondrial dysfunction pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations Osteosarcoma (OS) Zinc finger protein 36 (ZFP36) E2F transcription factor 1 (E2F1) Activating transcription factor 4 (ATF4) Glutathione peroxidase 4 (GPX4) Solute carrier family 7 member 11 (SLC7A11) Mitochondrial membrane potential (MMP) reactive oxygen species (ROS) malondialdehyde (MDA) glutathione (GSH) 1 Introduction Osteosarcoma (OS), an aggressive malignancy originating from mesenchymal cells of the bone, has been a crucial focus in cancer research and orthopedic oncology [ 1 2 3 4 5 6 Ferroptosis is distinguished by iron overload, lipid peroxidation, reactive oxygen species (ROS) accumulation, and mitochondrial specific pathological manifestations [ 7 8 9 10 11 12 13 14 15 16 E2F transcription factor 1 (E2F1), a transcription factor, exhibits dual properties and acts as an oncogene or tumor suppressor. E2F1 is closely related to multiple cancer cell processes, including proliferation, cell cycle regulation, metastasis and metabolic reprogramming [ 17 18 19 20 21 22 23 24 We explored the potential roles and regulatory mechanisms of the downregulated ZFP36 in OS progression. Thereafter, we investigated the effects of ZFP36/E2F1/ATF4 axis on the ferroptosis and mitochondrial dysfunction during OS progression. We aimed to find a promising therapeutic method for OS. 2 Materials and methods 2.1 Bioinformatics analysis The eligible gene data matrix files GSE126209 GSE225588 https://www.ncbi.nlm.nih.gov/geo GSE126209 GPL20301 GSE225588 GPL33140 P http://www.bioinformatics.com.cn 2.2 Tissue collection We included patients ( n Table 1 Table 1 The association between Zinc finger protein 36 (ZFP36) expression and clinical characteristics in 32 osteosarcoma (OS) patients. Table 1 Clinical characteristics Cases ZFP36 expression level P n High Low n n Age (years) <18 20 9 11 0.225 ≥18 12 6 6 Sex Male 18 7 11 0.491 Female 14 8 6 Tumor size (cm) <5 13 9 4 0.527 ≥5 19 6 13 TNM stage Ⅰ 14 9 5 0.763 Ⅱ + Ⅲ 18 6 12 Distant metastasis Yes 18 5 13 0.532 No 14 10 4 TNM stage: Tumor Node Metastasis stage. 2.3 Cell culture and transfection OS cells (MG63, HOS, U2OS, and Saos-2) and human osteoblasts (hFOB) were obtained from the ATCC (Manassas, VA, USA). Cells were cultured in Dulbecco's Modified Eagle Medium (DMEM) containing 10% fetal bovine serum (FBS) and 1% penicillin/streptomycin at 37 °C with 5% CO 2 The plasmids designed for gene overexpression including plasmid complementary DNA (pcDNA) of ZFP36 (pcDNA-ZFP36) and pcDNA of E2F1 (pcDNA-E2F1), small interfering RNAs (siRNAs) that are specific for ZFP36, E2F1, and ATF4, and lentivirus ZFP36 overexpression vector (Lv-ZFP36), were all procured from GenePharma (Shanghai, China). The siRNA sequences were shown as follows: ZFP36 (5′-CGA CGA UAU AAU UAU UAU A-3′), E2F1 (5′-GAG GAG UUC AUC AGC CUU U-3′). OS cell transfection was conducted utilizing lipofectamine 3000 (Invitrogen, Carlsbad, CA, USA). Briefly, 10 μL of lipofectamine 3000 reagent and 10 μL of plasmids/siRNAs were respectively mixed with 250 μL of Opti-MEM for 5 min at room temperature. Next, the two mixtures were mixed for 20 min and subsequently added into the 6-well plate (1 × 10 6 25 26 14 27 6 8 2.4 Quantitative reverse transcription polymerase chain reaction (RT-qPCR) Cells were incubated with TRIzol reagent (Invitrogen, Carlsbad, CA, USA) to facilitate RNA extraction. Following this, complementary DNA (cDNA) synthesis was performed using the PrimeScript™ RT Master Mix (Takara, Dalian, China), according to the protocol provided by manufacturer. RT-qPCR was then carried out using the SYBR Premix Ex Taq (Takara, Dalian, China). The messenger RNA (mRNA) level was determined utilizing the 2 −ΔΔCT 2.5 Western blot analysis Cellular and tissue specimens were lysed in RIPA buffer (Invitrogen, Carlsbad, CA, USA), and protein lysates were harvested and subjected for concentration evaluation. The protein contents were subsequently separated by 10% sodium dodecyl sulfate polyacrylamide gel electrophoresis (SDS-PAGE) and then transferred to a polyvinylidene fluoride (PVDF) membrane (Millipore, Bedford, MA, USA). After blocked with 5% skimmed milk, the membranes were probed with primary antibodies overnight at a temperature of 4 °C, and subsequently incubated with the secondary antibody at 37 °C for 2 h. The detection of protein bands was achieved using an enhanced chemiluminescence regent, and the gray intensity was quantified using ImageJ software. The used primary antibodies are listed as follows: ZFP36 (1:1000, LS-B5606, LifeSpan Bioscience, Seattle, WA, USA), E2F1 (1:1000, ab112580, Abcam, Cambridge, MA, USA), ATF4 (1:1000, ab85049, Abcam), GPX4 (1:1000, ab125066, Abcam), SLC7A11 (1:1000, ab307601, Abcam), and GAPDH (1:2500, ab9485, Abcam). 2.6 Immunohistochemistry assay Tumor tissue specimens were preserved by fixation in 10% formaldehyde, and 4 μm paraffin-embedded sections were subsequently prepared. The sections underwent a deparaffinization process in xylene and rehydration through a descending series of ethanol concentrations. The slices were treated in a microwave with a 10 mM sodium citrate buffer at pH 6.0. The sections were subjected to incubation with ZFP36 antibody (1:1000, sc-376162, Santa Cruz Biotechnology, Santa Cruz, CA, USA) or Ki67 antibody (1:200; ab16667, Abcam) at 4 °C overnight, followed by incubation with secondary antibody for 1 h. The sections were visualized using a DAB kit (Beyotime, Shanghai, China). Microscopic images were captured using a light microscope and were subsequently analyzed using ImageJ software. 2.7 Detection of cell proliferation OS cells were allocated into each well of a 96-well plate at a seeding concentration of 1 × 10 3 For colony formation assay, 500 OS cells were dispersed into per well in 6-well plates and cultured for 2 weeks. After this incubation phase, the clones were fixed with 4% paraformaldehyde and stained with 0.1% crystal violet solution for 20 min. Subsequently, the colony number was counted with ImageJ software. 2.8 Wound healing assay A pattern of uniform parallel marks was made on the backside of a 6-well plate. Subsequently, OS cells were placed into the wells (1 × 10 5 2.9 Transwell invasion assay OS cell suspension was prepared in a serum-free medium, and then were transferred into the upper section of a Transwell chamber (8 μm; Corning, NY, USA) precoated with a layer of Matrigel. Meanwhile, the lower section was filled with medium that contained 10% FBS. Following 24 h culture, the invaded cells were stained with 0.5% crystal violet, and the cell number was counted under a microscope. 2.10 Detection of Fe 2+ Fe 2+ 2.11 5,5′,6,6′-Tetrachloro-1,1′,3,3′-tetraethyl-imidacarbocyanine iodide (JC-1) staining JC-1 is a lipophilic cationic fluorescent probe widely used for detecting mitochondrial membrane potential (MMP) [ 28 2.12 Transmission electron microscopy (TEM) Mitochondrial ultrastructure was assessed using a TEM (HT-7500; Hitachi, Tokyo, Japan). OS cells were initially fixed in 2.5% glutaraldehyde at 4 °C overnight, and then were fixed with 1% osmium tetroxide at room temperature for 2 h. Next, cells underwent dehydration, infiltration, and embedding, and then sectioned into ultrathin sections with 60–80 nm in thickness. Finally, the sections were stained with 1% uranyl acetate and 0.1% lead citrate, and visualized using a TEM. 2.13 Chromatin immunoprecipitation (ChIP) assay OS cells were cross-linked using 1% formaldehyde for 10 min. Cell lysate was retrieved and sonicated on ice in a series of pulses. DNA fragments within the size range of 200–1,000 bp were isolated and then incubated with an anti-E2F1 antibody at 4 °C overnight. This was succeeded by a 4-h incubation with 20 μL of ChIP-grade protein A/G magnetic beads (Thermo Fisher Scientific, Waltham, MA, USA) at 4 °C. The ChIP products were eluted and analyzed using RT-qPCR. 2.14 Dual-luciferase reporter assay 3ʹUTR3ʹUTRThe luciferase reporter vectors used in this study were obtained from the Genechem (Shanghai, China). Three AU-rich elements (AREs) sequences (AUUUA) were identified in the 3′ untranslated region (3′UTR) of E2F1 mRNA (shown in the Supplementary data 29 2.15 Animal experiments The BALB/c nude mice were obtained from the animal experimental center of Nanjing Medical University. The mice were housed and cared for under typical laboratory conditions. MG63 cells (1 × 10 7 n 2.16 Statistical analysis Experimental data from at least three independent replicate experiments were presented as mean ± standard deviation (SD). The number of sample size ( n t P 3 Results 3.1 ZFP36 was downregulated in OS patients and cells A total of 7 DEGs in OS were screened from two GEO datasets ( Figs. 1 Fig. 1 Figs. 1 Fig. 1 Figs. 1 30 31 Fig. 1 Zinc finger protein 36 (ZFP36) was downregulated in osteosarcoma (OS) patients and cells. (A) Volcano map of global differentially expressed genes (DEGs) the GSE126209 GSE225588 GSE53007 GSE153086 n n ∗ P ∗∗ P Fig. 1 3.2 ZFP36 overexpression restrained OS cell proliferation, migration, and invasion The roles of ZFP36 in biological behaviors of MG63 and U2OS cells were evaluated. First, ZFP36 protein expression in MG63 cells after transfection with various concentrations of pcDNA-ZFP36 was detected ( Fig. S1 Figs. 2 Figs. 2 Figs. 2 Figs. 2 Figs. 2 Fig. 2 The effects of Zinc finger protein 36 (ZFP36) overexpression and knockdown on osteosarcoma (OS) cell proliferation, migration and invasion. (A, B) ZFP36 protein levels in MG63 and U2OS cells were assessed using Western blot analysis (A) and quantitative analysis (B). (C, D) Cell counting kit-8 (CCK-8) assay was used to assess the proliferation in MG63 (C) and U2OS (D) cells. (E, F) Clone formation assay was used to assess the proliferation in MG63 and U2OS cells (E) and quantitative analysis (F). (G, H) MG63 and U2OS cell migration were examined with wound healing assay (G) and quantitative analysis (H). (I, J) MG63 and U2OS cell invasion were examined with Transwell assay (I) and quantitative analysis (J). n ∗ P ∗∗ P Fig. 2 3.3 ZFP36 overexpression enhanced ferroptosis and mitochondrial dysfunction in OS cells ZFP36 has been identified as a ferroptosis-related gene [ [32] [33] [34] Fig. 3 Fig. 3 Fig. 3 2+ Fig. 3 Figs. 3 Figs. 3 Fig. 3 Fig. 3 The effects of Zinc finger protein 36 (ZFP36) overexpression and knockdown on ferroptosis and mitochondrial dysfunction in osteosarcoma (OS) cells. (A–C) Reactive oxygen species (ROS) (A), malondialdehyde (MDA) (B), and glutathione (GSH) (C) levels were examined using enzyme linked immunosorbent assay (ELISA) kits. (D) Intracellular Fe 2+ n ∗∗ P Fig. 3 3.4 ZFP36 inhibited E2F1 expression by promoting E2F1 mRNA degradation in OS cells It's known that ZFP36 promotes mRNA degradation via binding to the AREs in the 3ʹUTR of human transcripts [ 35 29 36 Fig. 4 Fig. 4 Fig. 4 Fig. 4 Fig. 4 Figs. 4 Fig. 4 Zinc finger protein 36 (ZFP36) inhibited E2F transcription factor 1 (E2F1) expression by promoting E2F1 messenger RNA (mRNA) degradation in osteosarcoma (OS) cells. (A) The wild and mutant AU-rich elements (AREs) of ZFP36 (AUUUA) in the 3′ untranslated region (3ʹUTR) of E2F1 mRNA. (B, C) Dual-luciferase reporter assay was used to assess the luciferase activities of the luciferase reporter containing E2F1 3′UTR after ZFP36 overexpression (B) and knockdown (C). (D) ZFP36-induced inhibition of luciferase activities in luciferase reporters with the wild-type, single point-mutated and double point-mutated E2F1 3′UTR. (E) The stability of E2F1 mRNA was examined after ZFP36 overexpression and knockdown. (F) E2F1 mRNA were assessed using quantitative reverse transcription polymerase chain reaction (RT-qPCR). (G, H) E2F1 protein levels were assessed using Western blot analysis (G) and quantitative analysis (H). n ∗∗ P t 1/2 Fig. 4 3.5 ZFP36 overexpression suppressed OS cell progression by promoting ferroptosis and mitochondrial dysfunction via inhibiting E2F1 expression ZFP36 overexpression decreased E2F1 protein level, and pcDNA-E2F1 transfection increased E2F1 protein level in MG63 cells ( Figs. 5 Fig. 5 Figs. 5 Figs. 5 Figs. 5 Figs. 5 Fig. 5 Fig. 5 Fig. 5 2+ Fig. 5 Figs. 5 Figs. 5 Fig. 5 Fig. 5 E2F transcription factor 1 (E2F1) overexpression abrogated the promoting effects of Zinc finger protein 36 (ZFP36) overexpression on osteosarcoma (OS) cell growth, ferroptosis, and mitochondrial dysfunction. (A, B) E2F1 protein levels in MG63 cells were assessed using Western blot analysis (A) and quantitative analysis (B). (C) MG63 cell proliferation was examined using Cell counting kit-8 (CCK-8) assay. (D, E) Clone formation assay was used to assess the proliferation in MG63 cells (D) and quantitative analysis (E). (F, G) MG63 cell migration were determined with wound healing assay (F) and quantitative analysis (G). (H, I) MG63 cell invasion were examined with Transwell assay (H) and quantitative analysis (I). (J, K) Reactive oxygen species (ROS) (J), and malondialdehyde (MDA) and glutathione (GSH) (K) levels were examined using enzyme linked immunosorbent assay (ELISA) kits. (L) Intracellular Fe 2+ n ∗∗ P Fig. 5 3.6 E2F1 promoted the transcription activation of ATF4 It's known that ATF4 mediates the inhibition or promotion of ferroptosis in various cancers [ 37 Figs. 6 Fig. 6 Fig. 6 Figs. 6 Figs. 6 Fig. 6 E2F transcription factor 1 (E2F1) promoted the transcription activation of activating transcription factor 4 (ATF4). (A) The E2F1 binding sites in ATF4 promoter were predicted using the Jaspar database ( http://jaspar.genereg.net/ n ∗∗ P Fig. 6 3.7 E2F1 knockdown inhibited OS cell progression by promoting ferroptosis and mitochondrial dysfunction via decreasing ATF4 expression It was suggested that transfection of si-E2F1 reduced ATF4 protein level, and transfection of pcDNA-ATF4 increased ATF4 protein expression in MG63 cells ( Figs. 7 Fig. 7 Figs. 7 Figs. 7 Figs. 7 Figs. 7 2+ Fig. 7 Figs. 7 Figs. 7 Fig. 7 Fig. 7 E2F transcription factor 1 (E2F1) knockdown inhibited osteosarcoma (OS) cell progression by promoting ferroptosis and mitochondrial dysfunction via decreasing activating transcription factor 4 (ATF4) expression. (A, B) ATF4 protein levels in MG63 cells were assessed using Western blot analysis (A) and quantitative analysis (B). (C) MG63 cell proliferation was examined using Cell counting kit-8 (CCK-8) assay. (D, E) Clone formation assay was used to assess the proliferation in MG63 cells (D) and quantitative analysis (E). (F, G) MG63 cell migration were determined with wound healing assay (F) and quantitative analysis (G). (H, I) MG63 cell invasion were examined with Transwell assay (H) and quantitative analysis (I). (J, K) Reactive oxygen species (ROS) (J), malondialdehyde (MDA), and glutathione (GSH) (K) levels were examined using enzyme linked immunosorbent assay (ELISA) kits. (L) Intracellular Fe 2+ n ∗∗ P Fig. 7 3.8 ZFP36 overexpression suppressed OS tumor growth in mice A xenograft tumor mouse model was established. Our results implicated that both tumor volume and weight were remarkably reduced in the ZFP36 overexpression group ( Figs. 8 Figs. 8 Figs. 8 Figs. 8 in vivo Fig. 8 Zinc finger protein 36 (ZFP36) overexpression suppressed osteosarcoma (OS) tumor growth in mice. MG63 cells transfected with lentivirus ZFP36 overexpression vector (Lv-ZFP36) or lentivirus negative control vector (Lv-NC), were injected subcutaneously into the left posterior flank area of the BALB/c nude mice ( n n ∗∗ P Fig. 8 4 Discussion Investigating the fundamental mechanisms of OS development is critical for the discovery of new therapeutic targets and the improvement of treatment outcomes. This involves a comprehensive investigation into the cellular and molecular biology of the tumor, including the study of oncogenes, tumor suppressor genes, epigenetic modifications, and tumor microenvironment. It has been demonstrated that ferroptosis is a crucial pathological mechanism regulating OS progression. It is associated with metastasis and chemotherapy resistance in OS development and has great promise or OS treatment [ 38 39 ZFP36 is a tumor suppressor in various malignant tumors. Recently, it was found that ZFP36 expression in OS tumor tissues was lower than that in adjacent tissues, and low ZFP36 expression indicated poor prognosis [ 16 GSE126209 GSE225588 35 E2F1 has been found to participate in the regulation of cancer cell proliferation and metastasis by regulating gene transcription [ 17 18 19 40 41 42 The roles of ATF4 in OS progression has been explored previously. It was showed that ATF4 was highly expressed in human OS cell lines, and ATF4 knockdown increased OS cell adhesion ability and reduced their ability to bypassing anoikis [ 43 44 22 23 Taken together, the present study showed that ZFP36 was downregulated in OS tumors. ZFP36 overexpression restrained OS cell proliferation, migration, and invasion, and promoted ferroptosis and mitochondrial dysfunction in OS cells. In vivo Ethical statement The research was granted ethical clearance by the Ethical Committee of the Affiliated Taizhou People's Hospital of Nanjing Medical University (Approval No.: KY 2023-170-01), and written informed consent was obtained from each patient. Animal studies were approved by the Animal Ethics Committee of the Affiliated Taizhou People's Hospital of Nanjing Medical University (Approval No.: 2023AWS112). Our experiments are in accordance with the ethical standards formulated in the Helsinki Declaration. CRediT authorship contribution statement Shiyue Qin: Hongyang Kong: Lei Jiang: Declaration of competing interest The authors declare that there are no conflicts of interest. References 1 Jafari F. Javdansirat S. Sanaie S. Osteosarcoma: A comprehensive review of management and treatment strategies Ann. Diagn. Pathol. 49 2020 151654 10.1016/j.anndiagpath.2020.151654 33130384 2 Huang T. Zhang X. Wang H. Punicalagin inhibited proliferation, invasion and angiogenesis of osteosarcoma through suppression of NF-κB signaling Mol. Med. Rep. 22 2020 2386 2394 32705250 10.3892/mmr.2020.11304 PMC7411473 3 Corre I. Verrecchia F. Crenn V. The osteosarcoma microenvironment: A complex but targetable ecosystem Cells 9 2020 976 10.3390/cells9040976 PMC7226971 32326444 4 Yang C. Tian Y. Zhao F. Bone microenvironment and osteosarcoma metastasis Int. J. Mol. Sci. 21 2020 6985 10.3390/ijms21196985 PMC7582690 32977425 5 Shoaib Z. Fan T.M. Irudayaraj J.M.K. Osteosarcoma mechanobiology and therapeutic targets Br. J. Pharmacol. 179 2022 201 217 34679192 10.1111/bph.15713 PMC9305477 6 Zhao X. Wu Q. Gong X. Osteosarcoma: A review of current and future therapeutic approaches Biomed. Eng. Online 20 2021 24 10.1186/s12938-021-00860-0 PMC7923306 33653371 7 Jiang X. Stockwell B.R. Conrad M. Ferroptosis: Mechanisms, biology and role in disease Nat. Rev. Mol. Cell Biol. 22 2021 266 282 33495651 10.1038/s41580-020-00324-8 PMC8142022 8 Hu S. Chu Y. Zhou X. Recent advances of ferroptosis in tumor: From biological function to clinical application Biomed. Pharmacother. 166 2023 115419 10.1016/j.biopha.2023.115419 37666176 9 Su Y. Zhao B. Zhou L. Ferroptosis, a novel pharmacological mechanism of anti-cancer drugs Cancer Lett. 483 2020 127 136 32067993 10.1016/j.canlet.2020.02.015 10 Liu X. Zhang Y. Wu X. Targeting ferroptosis pathway to combat therapy resistance and metastasis of cancer Front. Pharmacol. 13 2022 909821 10.3389/fphar.2022.909821 PMC9280276 35847022 11 Wen R.-J. Dong X. Zhuang H.-W. Baicalin induces ferroptosis in osteosarcomas through a novel Nrf2/xCT/GPX4 regulatory axis Phytomedicine 116 2023 154881 10.1016/j.phymed.2023.154881 37209607 12 Lin H. Chen X. Zhang C. EF24 induces ferroptosis in osteosarcoma cells through HMOX1 Biomed. Pharmacother. 136 2021 111202 10.1016/j.biopha.2020.111202 33453607 13 Pan Z. Yun H. Xiao Y. miR-934 exacerbates malignancy of gastric cancer cells by targeting ZFP36 Iran. J. Public Health 52 2023 1720 1729 37744530 10.18502/ijph.v52i8.13411 PMC10512137 14 Chen W. Chen M. Zhao Z. ZFP36 binds with PRC1 to inhibit tumor growth and increase 5-Fu chemosensitivity of hepatocellular carcinoma Front. Mol. Biosci. 7 2020 126 10.3389/fmolb.2020.00126 PMC7381195 32766276 15 Zhang T. Qiu L. Cao J. ZFP36 loss-mediated BARX1 stabilization promotes malignant phenotypes by transactivating master oncogenes in NSCLC Cell Death Dis. 14 2023 527 10.1038/s41419-023-06044-z PMC10432398 37587140 16 Song P. Xie Z. Chen C. Identification of a novel iron zinc finger protein 36 ( ZFP36 Ann. Transl. Med. 9 2021 1552 10.21037/atm-21-5086 PMC8576698 34790758 17 Fang Z. Lin M. Li C. A comprehensive review of the roles of E2F1 in colon cancer Am. J. Cancer Res. 10 2020 757 768 32266089 PMC7136928 18 Kassab A. Gupta I. Moustafa A.A. Role of E2F transcription factor in oral cancer: Recent insight and advancements Semin. Cancer Biol. 92 2023 28 41 36924812 10.1016/j.semcancer.2023.03.004 19 Fouad S. Hauton D. D'Angiolella V. E2F1: Cause and consequence of DNA replication stress Front. Mol. Biosci. 7 2020 599332 10.3389/fmolb.2020.599332 PMC7921158 33665206 20 Xu T.-P. Wang Y.-F. Xiong W.-L. E2F1 induces TINCR transcriptional activity and accelerates gastric cancer progression via activation of TINCR/STAU1/CDKN2B signaling axis Cell Death Dis. 8 2017 e2837 10.1038/cddis.2017.205 PMC5520882 28569791 21 Tang Y. Jiang L. Zhao X. FOXO1 inhibits prostate cancer cell proliferation via suppressing E2F1 activated NPRL2 expression Cell Biol. Int. 45 2021 2510 2520 34459063 10.1002/cbin.11696 22 He F. Zhang P. Liu J. ATF4 suppresses hepatocarcinogenesis by inducing SLC7A11 (xCT) to block stress-related ferroptosis J. Hepatol. 79 2023 362 377 36996941 10.1016/j.jhep.2023.03.016 PMC11332364 23 Chen Y. Mi Y. Zhang X. Dihydroartemisinin-induced unfolded protein response feedback attenuates ferroptosis via PERK/ATF4/HSPA5 pathway in glioma cells J. Exp. Clin. Cancer Res. 38 2019 402 10.1186/s13046-019-1413-7 PMC6743121 31519193 24 Chen D. Fan Z. Rauh M. ATF4 promotes angiogenesis and neuronal cell death and confers ferroptosis in a xCT-dependent manner Oncogene 36 2017 5593 5608 28553953 10.1038/onc.2017.146 PMC5633655 25 Gao Z.-W. Wang H.-P. Lin F. CD73 promotes proliferation and migration of human cervical cancer cells independent of its enzyme activity BMC Cancer 17 2017 135 10.1186/s12885-017-3128-5 PMC5311855 28202050 26 Al-Matouq J. Al-Haj L. Al-Saif M. Post-transcriptional screen of cancer amplified genes identifies ERBB2/Her2 signaling as AU-rich mRNA stability-promoting pathway Oncogenesis 10 2021 61 10.1038/s41389-021-00351-w PMC8448767 34535639 27 Ding J. Qin D. Zhang Y. SMAC mimetic birinapant inhibits hepatocellular carcinoma growth by activating the cIAP1/TRAF3 signaling pathway Mol. Med. Rep. 21 2020 1251 1257 31922244 10.3892/mmr.2020.10908 PMC7002966 28 Demeekul K. Suthammarak W. Petchdee S. Bioactive compounds from germinated brown rice protect cardiomyocytes against simulated ischemic/reperfusion injury by ameliorating mitochondrial dysfunction Drug Des. Dev. Ther. 15 2021 1055 1066 10.2147/DDDT.S294779 PMC7955705 33727794 29 Lee H.H. Lee S.R. Leem S.H. Tristetraprolin regulates prostate cancer cell growth through suppression of E2F1 J. Microbiol. Biotechnol. 24 2014 287 294 24150491 10.4014/jmb.1309.09070 30 Suswam E. Li Y. Zhang X. Tristetraprolin down-regulates interleukin-8 and vascular endothelial growth factor in malignant glioma cells Cancer Res. 68 2008 674 682 18245466 10.1158/0008-5472.CAN-07-2751 31 Hitti E.G. Muazzen Z. Moghrabi W. Hydroxychloroquine attenuates double-stranded RNA-stimulated hyper-phosphorylation of tristetraprolin/ZFP36 and AU-rich mRNA stabilization Immunology 173 2024 511 519 39046234 10.1111/imm.13835 32 Li X. Hu Y. Wu Y. Exosomal let-7a-5p J. Zhejiang Univ. Sci. B 25 2024 422 437 38725341 10.1631/jzus.B2300077 PMC11087186 33 Zhang Z. Guo M. Li Y. RNA-binding protein ZFP36/TTP protects against ferroptosis by regulating autophagy signaling pathway in hepatic stellate cells Autophagy 16 2020 1482 1505 31679460 10.1080/15548627.2019.1687985 PMC7469536 34 Fan J. Zhu T. Tian X. Exploration of ferroptosis and necroptosis-related genes and potential molecular mechanisms in psoriasis and atherosclerosis Front. Immunol. 15 2024 1372303 10.3389/fimmu.2024.1372303 PMC11272566 39072329 35 Makita S. Takatori H. Nakajima H. Post-transcriptional regulation of immune responses and inflammatory diseases by RNA-binding ZFP36 family proteins Front. Immunol. 12 2021 711633 10.3389/fimmu.2021.711633 PMC8282349 34276705 36 Al-Khalaf H.H. Colak D. Al-Saif M. p16(INK4a) positively regulates cyclin D1 and E2F1 through negative control of AUF1 PLoS One 6 2011 e21111 10.1371/journal.pone.0021111 PMC3140473 21799732 37 Tang H. Kang R. Liu J. ATF4 in cellular stress, ferroptosis, and cancer Arch. Toxicol. 98 2024 1025 1041 38383612 10.1007/s00204-024-03681-x 38 Zhao J. Zhao Y. Ma X. Targeting ferroptosis in osteosarcoma J. Bone Oncol 30 2021 100380 10.1016/j.jbo.2021.100380 PMC8319509 34345580 39 Liu X. Du S. Wang S. Ferroptosis in osteosarcoma: A promising future Front. Oncol. 12 2022 1031779 10.3389/fonc.2022.1031779 PMC9705963 36457488 40 Zhou X. Li J. Teng J. Long noncoding RNA BSN-AS2 induced by E2F1 promotes spinal osteosarcoma progression by targeting miR-654-3p/SYTL2 axis Cancer Cell Int. 20 2020 133 10.1186/s12935-020-01205-y PMC7183609 32351327 41 Wang Z. Sun X. Bao Y. E2F1 silencing inhibits migration and invasion of osteosarcoma cells via regulating DDR1 expression Int. J. Oncol. 51 2017 1639 1650 29039472 10.3892/ijo.2017.4165 PMC5673022 42 Kuganesan N. Dlamini S. Tillekeratne V.L. Regulation of ferroptosis by transcription factor E2F1 and RB Res. Sq. 2023 2493335 rs.3.rs–rs 10.1016/j.biochi.2025.06.013 PMC12333391 40578750 43 Mo H. Guan J. Mo L. ATF4 regulated by MYC has an important function in anoikis resistance in human osteosarcoma cells Mol. Med. Rep. 17 2018 3658 3666 29257326 10.3892/mmr.2017.8296 PMC5802171 44 Zeng H. Zhang J.-M. Du Y. Crosstalk between ATF4 and MTA1/HDAC1 promotes osteosarcoma progression Oncotarget 7 2016 7329 7342 26797758 10.18632/oncotarget.6940 PMC4872789 Appendix A Supplementary data The following is the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Acknowledgments This study received funding support from the hospital-level project of Taizhou People's Hospital (Project No.: ZL201944). Peer review under responsibility of Xi'an Jiaotong University. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.jpha.2025.101228 ",
  "metadata": {
    "Title of this paper": "Crosstalk between ATF4 and MTA1/HDAC1 promotes osteosarcoma progression",
    "Journal it was published in:": "Journal of Pharmaceutical Analysis",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495438/"
  }
}