{
  "title": "Paper_1159",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12475188 PMC12475188.1 12475188 12475188 41006527 10.1038/s41598-025-14514-x 14514 1 Article Automated detection and classification of cervical and anal squamous cancer precursors using deep learning and multidevice colposcopy Mascarenhas Miguel miguelmascarenhassaraiva@gmail.com 1 2 3 10 Martins Miguel 1 2 Barroso Luís 4 Spindler Lucas 5 Fathallah Nadia 5 Manzione Thiago 6 Alencoão Inês 7 Carinhas Maria João 7 Ribeiro Tiago 1 2 3 Mendes Francisco 1 2 Cardoso Pedro 1 2 3 Almeida Maria João 1 2 Mota Joana 1 2 Fernandes Joana 8 Ferreira João 8 Mascarenhas Teresa 3 9 Nadal Sidney 6 Zulmira Rosa 7 Macedo Guilherme 1 2 3 de Parades Vincent 5 1 2 3 https://ror.org/043pwc612 grid.5808.5 0000 0001 1503 7226 Faculty of Medicine of the University of Porto, 4 https://ror.org/04v8djg66 grid.412860.9 0000 0004 0459 1231 Wake Forest University Health Sciences, 5 6 https://ror.org/00em27a94 grid.419072.9 0000 0004 0576 9599 Department of Surgery, Instituto de Infectologia Emílio Ribas, 7 8 https://ror.org/043pwc612 grid.5808.5 0000 0001 1503 7226 Department of Mechanical Engineering, Faculty of Engineering of the University of Porto, 9 10 https://ror.org/04qsnc772 grid.414556.7 0000 0000 9375 4688 Gastroenterology, Centro Hospitalar Universitário de São João, 26 9 2025 2025 15 478255 33068 24 7 2024 31 7 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Human papillomavirus (HPV) infection presents neoplastic risks in both cervix and anus. High-resolution colposcopy/anoscopy is crucial for assessing these regions but has suboptimal accuracy. This study aims to develop a Convolutional Neural Network (CNN) to identify and differentiate low-grade (LSIL) and high grade (HSIL) squamous intraepithelial lesions, in the cervix and anus. A retrospective multicenter study was conducted to develop a CNN using 320 colposcopy and anoscopy examinations, from 3 device types. Dataset included 88,073 frames, categorized as LSIL or HSIL based on pathological analysis. The data was split into training/validation (90%, n = 79,265, including a threefold cross-validation) and test sets (10%, n = 8808). Diagnostic metrics including sensitivity, specificity, accuracy, positive and negative predictive values (PPV and NPV, respectively) and an area under the receiving operating and the precision-recall curves (AUC-ROC and AUC-PR) were calculated. During training/validation phase, the model achieved an average sensitivity for HSIL of 98.1% (IC95% 97.6–98.5%), specificity of 97.4% (IC95% 96.0–98.8%), PPV of 97.2% (IC95% 95.8–98.7%), NPV of 98.2% (IC95% 97.7–98.6%), and accuracy of 97.7% (IC95% 97.2–98.6%). The mean AUC-ROC and AUC-PR were both 0.98 ± 0.01. In the testing phase, performance metrics for HSIL were: sensitivity 99.0%, specificity 97.8%, PPV 97.6%, NPV 99.0%, and accuracy 98.3%. HPV infection impacts both cervical and anal region. This study developed a pioneering CNN to differentiate HSIL and LSIL in HPV-related dysplastic lesions, during cervical and anal examinations. This model achieved promising results, suggesting its potential to improve detection accuracy and cost-effectiveness in clinical practice. Keywords Cervical squamous cell carcinoma Anal squamous cell carcinoma LSIL HSIL Colposcopy Artificial intelligence Subject terms Cancer Gastroenterology Medical research pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Human papillomavirus (HPV) infection is a highly prevalent sexually transmitted disease, affecting over 80% of sexually active individuals at some point in their lives 1 2 2 3 Understanding this carcinogenesis process is essential, since promptly treating HSIL represents a pivotal opportunity to reduce the burden of HPV-associated squamous cancers 3 2 4 5 6 Considering the need to inspect finer anatomical details, there has been a growing interest in utilization of high-resolution colposcopes to assess not only the women genital tract, but also the anal zone. Performing colposcopy for both cervical and anal regions enable high resolution detailed assessment of these areas and precise targeting of biopsies and treatment procedures through direct visualization 7 8 8 9 10 In contexts with suboptimal diagnostic accuracy and high interobserver variability, artificial intelligence (AI) models could enhance procedures cost-effectiveness 11 12 14 13 21 The aim of this study is to develop and validate a CNN for automatic differentiation of cervical and anal squamous cancers precursors during high-resolution colposcopy/ anoscopy. Methods Study design and categorization of the lesions We included high-resolution colposcopies performed at Centro Materno Infantil do Norte [CMIN] (Porto, Portugal) [n = 70] using a Zeiss FC 150 colposcope and high-resolution anoscopies performed at Groupe Hospitalier Paris Saint-Joseph [GHPSJ] (Paris, France) [n = 177], Instituto de Infecciologia Emílio Ribas [IFER] (São Paulo, Brazil) [n = 54] and Wake Forest University [WKU] (North Carolina, USA) [n = 13] using a videoproctoscope THD® Proctostation HRA Module (THD SpA, Correggio, Italy), Kolplast colposcope (Kolplast CIA, São Paulo, Brazil), Zeiss FC 150 colposcope (Carl Zeiss Meditec AG, Jena, Germany), respectively. The included procedures were conducted and recorded between 2020 and 2023. The collected videos were then segmented in still frames using VLC Media Player. The dataset consisted of a total of 88,073 frames of HPV-induced dysplastic lesions, with 45,726 labelled as LSIL and 42,347 labelled as HSIL. This binary classification was determined based on the corresponding histopathology reports from biopsied or treated lesions during colposcopy or anoscopy procedures. Cytological samples were not used to establish the ground truth. The number of biopsies/treated lesions varied for each procedure. In cases involving multiple biopsies, the biopsy sites were documented, and the histological findings were matched with the corresponding video frames. Any cases with uncertainty about the correlation between the biopsy site and the image were excluded from the analysis to ensure rigor and prevent misclassification. We divided total data in two parts: training/validation and testing set, with 79,265 (90%) and 8808 (10%) frames, respectively. We used the testing set to assess the global performance of the model. We resume dataset methodology in Fig. 1  Fig. 1 Study design. AUC-PR AUC-ROC NPV PPV Due to the retrospective nature of the data collection, this study follows a non-interventional approach. Additionally, no modifications to therapeutic practices were made as a result of the study. Approval from the ethics committee was obtained prior to study’s beginning, with permissions granted by the ethics committee of Group Hospitalier Paris Saint-Joseph, Instituto de Infecciologia Emílio Ribas, and Hospital Universitário Santo António (IRB 00012157, SPTC 81/2023, IRB 2023.157(131-DEFI/123-CE), respectively). The study was carried out in accordance with the principles of Helsinki Declaration. Colposcopy and anoscopy protocol In each center, colposcopy and anoscopy procedures were performed by expert medical doctors, according to the current best practices. Each be procedure can be divided in four stages maximum: first examination without applying stain, followed by examination with 3% acetic acid and optionally lugol’s iodine later, ending with therapeutic manipulation (e.g. laser ablation, plasma coagulation or surgical ablation). The dataset included frames from these four categories, with each procedure potentially encompassing any combination of them. Development of DL model and performance analysis A Resnet10 model, which was pre-trained on ImageNet-1 K (a comprehensive collection of data used to recognize objects within images), was used to build this CNN 22 2  Fig. 2 Examples of how the algorithm estimated probability of being LSIL (low-grade intraepithelial squamous lesion) vs HSIL (high-grade intraepithelial squamous lesion). Every frame was categorized into one of the previously mentioned categories based on which had the highest probability. The classification provided by the Convolutional Neural Network (CNN) was then compared to the histopathological classification (upper left corner), which was considered the gold standard. Blue bars represent correct CNN predictions, while red bars represent wrong ones. Statistics and reproducibility The model was assessed during training/validation phase (rationale: assess robustness) and during test phase (rationale: assess overall performance). During training/validation phase, 90% of the data underwent division into three equivalent dimension folds, using a StratifiedKFold division. A total of three distinct iterations were executed in total. In each iteration, the model was trained using two folds, and validate using the other one. Additionally, in each iteration, the folds employed for training and validation were different. During test phase, the remaining 10% were used to independently to assess performance of the CNN. Computational performance was also evaluated by measuring the algorithm processing time for all frames in the test set. We performed statistical analysis using Sci-Kit Learn v0.22.2 ( https://scikit-learn.org/0.22/ 23 3  Fig. 3 Examples of generated heatmaps in an anal (1) and a cervical (2) frame to assess which characteristics most significantly contributed to Convolutional Neural Network (CNN) prediction. These identified areas can assist the physician in assessing why the Artificial Intelligence (AI) model made its prediction and may guide targeted biopsies by highlighting regions with a higher probability of lesions. Results We included a total of 88,073 of high-resolution colposcopy and anoscopy still frames, from 3 different devices. From the total dataset, 79,265 frames were used to train the model (GHPSJ = 31,086, IFER = 22,738, CMIN = 20,393, WFU = 5048), whereas the remaining 8808 frames were used to independently test the model (GHPSJ = 3393, IFER = 2587, CMIN = 2300, WFU = 528 frames). The total dataset incorporated 45,726 of LSIL (41,153 in training/validation, 4573 in testing set) and 42,347 HSIL (38,112 in training/validation, 4235 in testing set) labeled frames. From the procedure number perspective, the training/validation set included frames from 165 exams, while the testing set had frames from 155. 1. Training/Validation set Table 1  Table 1 Number of frames, patients and types of CE device per group, which was divided in training/validation (90% of patients, including a threefold cross validation) vs. test group (10% of remaining). Frames (n) Patients (n) Devices (n) Regions (n) LSIL (n) HSIL (n) Fold 1 24,729 151 3 2 12,968 11,781 Fold 2 24,729 150 3 2 12,968 11,781 Fold 3 24,729 152 3 2 12,968 11,781 Test set 8250 148 3 2 4323 3927 Regarding performance metrics to HSIL differentiation (Table 2 3 4  Table 2 Confusion matrices for each cross-validation run (training-validation phase) and in test phase. Gold standard HSIL LSIL Run 1 CNN HSIL 12,435 274 LSIL 269 13,444 Run 2 CNN HSIL 12,483 430 LSIL 221 13,288 Run 3 CNN HSIL 12,452 358 LSIL 252 13,359 Test set CNN HSIL 4192 101 LSIL 43 4472  Table 3 Data was divided in training/validation and test groups. During training/validation phase, three iterations were conducted, each with unique frame distribution. Sensitivity (%) Specificity (%) PPV (%) PPN (%) Accuracy (%) Fold 1 97.90 98.00 97.80 98.00 97.90 Fold 2 98.30 96.70 96.70 98.40 97.50 Fold 3 98.00 97.40 97.20 98.10 97.70 Average 98.10 97.40 97.20 98.10 97.70 IC95% 97.6–98.5 96.0–98.8 95.8–98.7 97.8–98.6 97.2–98.2 In each iteration, the model was trained using two folds, and validate using the other one. Metrics were calculated in validation fold of each of iteration.  Fig. 4 1—Area under the conventional receiver operating characteristic curve, 2—Area under the precision-recall curve (AUC-PR) of CNN performance in differentiation HSIL from LSIL in cervical and anal colposcopic/anoscopic still frames. In this case, sensitivity (or recall) is the proportion of HSIL cases that were correctly identified by the CNN. Specificity is the proportion of LSIL cases that were correctly identified. Precision is the proportion of correct predictions (both HSIL and LSIL) out of all predictions made by the CNN. 2. Testing set Regarding testing phase, performance metrics to HSIL differentiation were as follow: sensitivity of 99.0%, specificity of 97.8%, with a PPV and NPV of 97.6% and 99.0%, respectively. The overall accuracy was 98.3%. Discussion This study introduces the first worldwide ubiquitous deep learning model that can detect and differentiate HPV-related dysplastic lesions in two distinct areas: the cervix and the anal canal. The model predictions are highly accurate and hold great potential for practical use in clinical live scenarios. This cross-zone interoperable model represents a novel advancement in computer-aided detection (CADe) and diagnosis (CADx) systems by enabling effective analysis across anatomically distinct regions. This approach offers an original solution to improve the accuracy and efficiency of endoscopic and magnified evaluation of these regions, providing a more versatile diagnostic tool for practitioners. One of the primary strengths of this AI model is its development using histologically confirmed frames lesions from two different anatomical zones. This ensures the model is trained in both regions, unlike existing evidence focused only on detecting cervical or anal lesions. Another key strength of the model is its multicentricity and interoperability, having been trained on data provided by four centers and three distinct devices used for endoscopic evaluation of cervical and anal regions. This approach generated a more heterogeneous dataset, incorporating different populations from Europe and America, probably reflecting a more externally validated and more closed to real-life scenario, closing the gap between development and clinical practice. Adhering to FAIR criteria is essential in current development of AI software to enhance clinical practice 24 Comparing published models so far is challenging, as comparing performance metrics only may not provide an accurate assessment (Table 4 17 19 18 15 16 14 20 21 13  Table 4 Summarized published deep learning models developed for differentiation of HPV-related dysplastic lesions in the cervical and anal regions. Publication AI model Centers Devices Frames Included stainings Main characteristics of the study Sen % Spe % AUC-ROC Cervical lesions Miyagi et al. 16 ResNet 1 1 330 Non-stained HSIL vs LSIL only 1 frame per procedure 80 88 0.83 Yuan et al. 18 ResNet 1 1 22,330 Non-stained acetic acid lugol HSIL vs others (normal or LSIL) 85 82 0.93 Xue et al. 17 U-net+YOLO 6 1 19,435 Non-stained HSIL vs others (normal or LSIL or cancer) 66 90 0.78 Chen et al. 14 E-B0 with GRU 1 1 6002 Non-stained acetic acid lugol HSIL vs LSIL 88 94 0.91 Fang et al. 15 ShuffleNet 1 1 1189 Non-stained HSIL vs others (normal or LSIL or cancer) 82 – 0.99 Saraiva et al. 13 ResNet 1 1 22,693 Non-stained acetic acid lugol HSIL vs LSIL 90 98 0.98 Anal lesions Saraiva et al. 19 Xception 1 1 (proctoscope) 5026 Non-stained acetic acid lugol HSIL vs LSIL Pilot study 91 90 0.97 Saraiva et al. 20 ResNet 1 1 (proctoscope) 27,770 Non-stained acetic acid lugol HSIL vs LSIL Sub analysis per category, including “post-manipulation phase” (after lesion biopsy or treatment) 97 94 0.99 Saraiva et al. 12 ResNet 2 2 (proctoscope+colposcope) 57,882 Non-stained acetic acid lugol HSIL vs LSIL@Contributed to interoperability 94 96 0.97 From the data science methodology and analysis perspective, there are some key points of the study that should be mentioned. We strictly included only lesion frames that were later confirmed through histological analysis (ground truth). This included frames from the entire endoscopic examination, encompassing non-stained, stained and post-manipulated ones, which can be particular useful for physicians, as its diagnostic performance may not be compromised despite the presence of stains, blood or burnt tissue. Moreover, we included a diverse dataset with images from various angles, implemented a proper train-test split, and avoided data annotation. This model represents a pioneering approach as it was trained simultaneously of still frames showing HPV dysplastic lesions (LSIL or HSIL) from two different anatomical regions: the cervix and the anus. It demonstrated high performance metrics in test set, achieving 99.0% sensitivity and 97.8% specificity. We also performed a cross-validation during training/validation phase. The average metrics were similarly high (mean sensitivity 98.1% and mean specificity 97.4%), indicating robustness across different frame distribution. The retrospective nature of this study, in addition to the lack of procedural split in the training/validation and testing sets, as well as the potential demographic bias associated with the absence of patient-level data (due to GPDR restrictions). These limitations should be acknowledged and may contribute to risk of overfitting. Consequently, the findings of this study cannot be broadly generalizable or directly applied to clinical setting and more prospective and multicentric studies are still needed to determine if the use of these AI model can significantly improve the diagnostic and treatment of HPV-related dysplastic lesions. Since our dataset preparation did not involve manual data annotation, and due to the inherent black box nature of these models, we excluded more complex cases with simultaneous (observed in the same frame) presence of LSIL and HSIL lesions, which can be also a limitation that can compromised the external validity of study’s results. For similar reasons, we excluded frames where both lesions and instruments (e.g. forceps used for traction to better expose a lesion) were present simultaneously. We acknowledge that ensuring the model can function without interference from such instruments is important for its real-world applicability. Additionally, form a gynecological/ proctological perspective, the ideal CADe/CADx system would be the one that was capable of detecting/differentiating LSIL, HSIL, and non-dysplastic lesions. Due to limitations in our current dataset, implementing a trinary model at this stage was not feasible. In conclusion, the development of efficient AI models, interoperable, developed with minimal selection bias and dataset diversity is essential for implementing this technology in real clinical scenarios. Using a single ubiquitous model in both anatomical regions can be more versatile and efficient for clinical practice than employing two separate models individually. Future research will prioritize the validation of CADe/CADx models within prospective, multicentric and real-time clinical context, including tandem comparative evaluation between AI-enhanced and clinical performance metrics through conventional high resolution anoscopy and/or colposcopy diagnostic performance. Building on this need, this multicentric study represents a necessary intermediate step and introduces innovative model for detection and differentiation of HPV-related dysplastic lesions in two main anatomical areas of assessment of colposcopes and anoscopes. This development may increase clinical outcomes and cost-effectiveness of these procedures, potentially making them accessible to a larger portion of the population. Due to the retrospective nature of the study by the ethics committee of Groupe Hospitalier Paris Saint-Joseph, Institituto de Infecciologia Emílio Ribas and Hospital Universitário Santo António (IRB 00,012,157, SPTC 81/2023, IRB 2023.157(131-DEFI/123-CE), respectively) waived the need of obtaining informed consent. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Miguel Mascarenhas and Miguel Martins contributed equally. Author contributions M.M.S and M.M: equal contribution in study design, image extraction, drafting of the manuscript, and critical revision of the manuscript. L.B, L.S, N.F, T.M, I.A, M.J.C: study design, data acquisition, critical revision of the manuscript T.R, F.M, P.C, M.J.A, J.M: bibliographic review, image extraction, critical revision of the manuscript. J.F and J.F.R: construction and development of the DL model, statistical analysis, critical revision of the manuscript. T.M, S.N, R.Z, G.M, V.P: study design, critical revision of the manuscript. All authors approved the final version of the manuscript. Data availability Raw data were generated at the Faculty of Medicine of the University of Porto, PT. Derived data supporting the findings of this study are available from the corresponding author upon request. Declarations Competing interests The authors declare no competing interests. Ethical approval Given the retrospective nature of collection data, this study adopts a non-interventional paradigm. Moreover, the study did not result in any changes to therapeutic conduct. Ethical committee permission was acquired prior to initiation of the study by the ethics committee of Groupe Hospitalier Paris Saint-Joseph, Institituto de Infecciologia Emílio Ribas and Hospital Universitário Santo António (IRB 00012157, SPTC 81/2023, IRB 2023.157(131-DEFI/123-CE), respectively), and conducted in accordance with principles indicated in the Helsinki declaration. References 1. Scott-Wittenborn N Fakhry C Epidemiology of HPV related malignancies Semin. Radiat. Oncol. 2021 31 4 286 296 10.1016/j.semradonc.2021.04.001 34455984 PMC9057013 Scott-Wittenborn, N. & Fakhry, C. Epidemiology of HPV related malignancies. Semin. Radiat. Oncol. 31 34455984 10.1016/j.semradonc.2021.04.001 PMC9057013 2. Burd EM Human papillomavirus and cervical cancer Clin. Microbiol. Rev. 2003 16 1 1 17 10.1128/CMR.16.1.1-17.2003 12525422 PMC145302 Burd, E. M. Human papillomavirus and cervical cancer. Clin. Microbiol. Rev. 16 12525422 10.1128/CMR.16.1.1-17.2003 PMC145302 3. Palefsky JM Treatment of anal high-grade squamous intraepithelial lesions to prevent anal cancer N. Engl. J. Med. 2022 386 24 2273 2282 10.1056/NEJMoa2201048 35704479 PMC9717677 Palefsky, J. M. et al. Treatment of anal high-grade squamous intraepithelial lesions to prevent anal cancer. N. Engl. J. Med. 386 35704479 10.1056/NEJMoa2201048 PMC9717677 4. Davies-Oliveira JC Eliminating cervical cancer: Progress and challenges for high-income countries Clin. Oncol. (R Coll. Radiol.) 2021 33 9 550 559 10.1016/j.clon.2021.06.013 34315640 Davies-Oliveira, J. C. et al. Eliminating cervical cancer: Progress and challenges for high-income countries. Clin. Oncol. (R Coll. Radiol.) 33 34315640 10.1016/j.clon.2021.06.013 5. Ayala, M. & Fatehi, M. Vulvar intraepithelial neoplasia. In: StatPearls 31082026 6. Copyright © 2024, StatPearls Publishing LLC. 7. Maugin F Early detection of anal high-grade squamous intraepithelial lesion: Do we have an impact on progression to invasive anal carcinoma? J. Low Genit. Tract. Dis. 2020 24 1 82 86 10.1097/LGT.0000000000000505 31860581 Maugin, F. et al. Early detection of anal high-grade squamous intraepithelial lesion: Do we have an impact on progression to invasive anal carcinoma?. J. Low Genit. Tract. Dis. 24 31860581 10.1097/LGT.0000000000000505 8. Khan MJ ASCCP colposcopy standards: Role of colposcopy, benefits, potential harms, and terminology for colposcopic practice J. Low Genit. Tract. Dis. 2017 21 4 223 229 10.1097/LGT.0000000000000338 28953110 Khan, M. J. et al. ASCCP colposcopy standards: Role of colposcopy, benefits, potential harms, and terminology for colposcopic practice. J. Low Genit. Tract. Dis. 21 28953110 10.1097/LGT.0000000000000338 9. Stier EA International Anal Neoplasia Society’s consensus guidelines for anal cancer screening Int. J. Cancer 2024 154 10 1694 1702 10.1002/ijc.34850 38297406 Stier, E. A. et al. International Anal Neoplasia Society’s consensus guidelines for anal cancer screening. Int. J. Cancer 154 38297406 10.1002/ijc.34850 10. Espinosa K ASCCP management guidelines for abnormal cervical cancer screening Am. Fam. Physician 2024 109 3 275 276 38574222 Espinosa, K. ASCCP management guidelines for abnormal cervical cancer screening. Am. Fam. Physician 109 38574222 11. Bai A Assessing colposcopic accuracy for high-grade squamous intraepithelial lesion detection: A retrospective, cohort study BMC Womens Health 2022 22 1 9 10.1186/s12905-022-01592-6 35012523 PMC8751223 Bai, A. et al. Assessing colposcopic accuracy for high-grade squamous intraepithelial lesion detection: A retrospective, cohort study. BMC Womens Health 22 35012523 10.1186/s12905-022-01592-6 PMC8751223 12. Ayturan K SPHERE: Benchmarking YOLO vs. CNN on a novel dataset for high-accuracy solar panel defect detection in renewable energy systems Appl. Sci. 2025 15 9 4880 10.3390/app15094880 Ayturan, K. et al. SPHERE: Benchmarking YOLO vs. CNN on a novel dataset for high-accuracy solar panel defect detection in renewable energy systems. Appl. Sci. 15 13. Brandão M Revolutionizing women’s health: A comprehensive review of artificial intelligence advancements in gynecology J. Clin. Med. 2024 13 4 1061 10.3390/jcm13041061 38398374 PMC10889757 Brandão, M. et al. Revolutionizing women’s health: A comprehensive review of artificial intelligence advancements in gynecology. J. Clin. Med. 13 38398374 10.3390/jcm13041061 PMC10889757 14. Saraiva MM Deep learning and high-resolution anoscopy: Development of an interoperable algorithm for the detection and differentiation of anal squamous cell carcinoma precursors-a multicentric study Cancers (Basel) 2024 16 10 1909 10.3390/cancers16101909 38791987 PMC11119426 Saraiva, M. M. et al. Deep learning and high-resolution anoscopy: Development of an interoperable algorithm for the detection and differentiation of anal squamous cell carcinoma precursors-a multicentric study. Cancers (Basel) 16 38791987 10.3390/cancers16101909 PMC11119426 15. Mascarenhas M Artificial intelligence and colposcopy: Automatic identification of cervical squamous cell carcinoma precursors J. Clin. Med. 2024 13 10 3003 10.3390/jcm13103003 38792544 PMC11122610 Mascarenhas, M. et al. Artificial intelligence and colposcopy: Automatic identification of cervical squamous cell carcinoma precursors. J. Clin. Med. 13 38792544 10.3390/jcm13103003 PMC11122610 16. Chen X Application of EfficientNet-B0 and GRU-based deep learning on classifying the colposcopy diagnosis of precancerous cervical lesions Cancer Med. 2023 12 7 8690 8699 10.1002/cam4.5581 36629131 PMC10134359 Chen, X. et al. Application of EfficientNet-B0 and GRU-based deep learning on classifying the colposcopy diagnosis of precancerous cervical lesions. Cancer Med. 12 36629131 10.1002/cam4.5581 PMC10134359 17. Fang S An improved image classification method for cervical precancerous lesions based on ShuffleNet Comput. Intell. Neurosci. 2022 2022 9675628 10.1155/2022/9675628 36148422 PMC9489397 Fang, S. et al. An improved image classification method for cervical precancerous lesions based on ShuffleNet. Comput. Intell. Neurosci. 2022 36148422 10.1155/2022/9675628 PMC9489397 18. Miyagi Y Takehara K Miyake T Application of deep learning to the classification of uterine cervical squamous epithelial lesion from colposcopy images Mol. Clin. Oncol. 2019 11 6 583 589 31692958 10.3892/mco.2019.1932 PMC6826263 Miyagi, Y., Takehara, K. & Miyake, T. Application of deep learning to the classification of uterine cervical squamous epithelial lesion from colposcopy images. Mol. Clin. Oncol. 11 31692958 10.3892/mco.2019.1932 PMC6826263 19. Xue P Development and validation of an artificial intelligence system for grading colposcopic impressions and guiding biopsies BMC Med. 2020 18 1 406 10.1186/s12916-020-01860-y 33349257 PMC7754595 Xue, P. et al. Development and validation of an artificial intelligence system for grading colposcopic impressions and guiding biopsies. BMC Med. 18 33349257 10.1186/s12916-020-01860-y PMC7754595 20. Yuan C The application of deep learning based diagnostic system to cervical squamous intraepithelial lesions recognition in colposcopy images Sci. Rep. 2020 10 1 11639 10.1038/s41598-020-68252-3 32669565 PMC7363819 Yuan, C. et al. The application of deep learning based diagnostic system to cervical squamous intraepithelial lesions recognition in colposcopy images. Sci. Rep. 10 32669565 10.1038/s41598-020-68252-3 PMC7363819 21. Saraiva MM Artificial intelligence and high-resolution anoscopy: Automatic identification of anal squamous cell carcinoma precursors using a convolutional neural network Tech. Coloproctol. 2022 26 11 893 900 10.1007/s10151-022-02684-z 35986806 Saraiva, M. M. et al. Artificial intelligence and high-resolution anoscopy: Automatic identification of anal squamous cell carcinoma precursors using a convolutional neural network. Tech. Coloproctol. 26 35986806 10.1007/s10151-022-02684-z 22. Saraiva, M.M., et al., Deep Learning in High-Resolution Anoscopy: Assessing the Impact of Staining and Therapeutic Manipulation on Automated Detection of Anal Cancer Precursors. 10.14309/ctg.0000000000000681 PMC11042766 38270249 23. He, K. et al. Deep residual learning for image recognition. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition 24. Pedregosa F Varoquaux G Gramfort A Michel V Thirion B Grisel O Scikit-learn: Machine learning in Python Mach. Learn. Res. 2011 12 2825 2830 Pedregosa, F. et al. Scikit-learn: Machine learning in Python. Mach. Learn. Res. 12 ",
  "metadata": {
    "Title of this paper": "Scikit-learn: Machine learning in Python",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475188/"
  }
}