{
  "title": "Paper_1173",
  "abstract": "pmc J Community Health J Community Health 365 springeropen Journal of Community Health 0094-5145 1573-3610 pmc-is-collection-domain yes pmc-collection-title Springer PMC12474626 PMC12474626.1 12474626 12474626 40186838 10.1007/s10900-025-01465-7 1465 1 Original Paper Perceived Risk and HPV Vaccination Awareness Among Women in Rural and Underserved Communities in the State of Louisiana http://orcid.org/0000-0002-7880-9614 Smith Deborah Gurgel deborah.smith@lsuhs.edu 1 Dantes Emily M. 2 http://orcid.org/0000-0002-8582-744X Beyl Robbie 3 de Koter Yanna X. A. 3 Bourg Margaret 4 Smith Corey D. 2 Jackson Gelinia 5 http://orcid.org/0000-0001-7540-4913 Brown Justin 3 McLarty Jerry W. 6 1 https://ror.org/05ect4e57 grid.64337.35 0000 0001 0662 7451 School of Allied Health Professions, Louisiana State University Health Shreveport, 2 https://ror.org/05ect4e57 grid.64337.35 0000 0001 0662 7451 School of Medicine, Louisiana State University Health Shreveport, 3 https://ror.org/040cnym54 grid.250514.7 0000 0001 2159 6024 Pennington Biomedical Research Center, 4 https://ror.org/0457zbj98 grid.266902.9 0000 0001 2179 3618 Department of Pediatrics, College of Medicine, University of Oklahoma Health Sciences, 5 https://ror.org/01qv8fp92 grid.279863.1 0000 0000 8954 1233 Nursing School, Louisiana State University Health New Orleans, 6 https://ror.org/05ect4e57 grid.64337.35 0000 0001 0662 7451 Feist-Weiller Cancer Center, School of Medicine, Louisiana State University Health Shreveport, 5 4 2025 2025 50 5 497685 826 832 10 3 2025 05 04 2025 28 09 2025 30 09 2025 12474626 10.1007/s10900-025-01465-7 1 05 04 2025 12477786 10.1007/s10900-025-01465-7 NIHMS2111134 2 05 04 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Despite the availability of effective preventive measures, women in rural and underserved communities of Louisiana face health disparities regarding human papillomavirus infections. This study explores how perceived risk and socioeconomic factors, such as income, influence HPV vaccine awareness and attitudes toward HPV risk. A cross-sectional study was conducted among women in rural and underserved areas of Louisiana from November 2022 to December 2023. Participants were eligible to be included in the study if they were adult females aged 25 to 64 with no history of hysterectomy and no history of cervical cancer. We used convenience sampling through a mobile health unit that travels to rural and underserved areas of north and central Louisiana, offering cervical cancer screening. A total of 141 women participated in the study. Findings revealed significant gaps in HPV awareness and vaccination knowledge. Only 10.6% of participants considered themselves at risk for HPV. Higher HPV knowledge scores were positively associated with perceived HPV risk, increasing by approximately 20% per correct response. Approximately 40% of the participants were unaware of the existence of the HPV vaccine, 96.5% had never received the HPV vaccine, and 91.4% had never been offered it. Only 42% indicated that they would consider vaccination if offered. Addressing health disparities in rural Louisiana requires targeted interventions to improve healthcare access, education, and community engagement. Efforts to enhance education and awareness and foster community engagement should be prioritized. Keywords Human papillomavirus Rural health Cervical cancer HPV vaccine http://dx.doi.org/10.13039/100018106 Louisiana Clinical and Translational Science Center U54 GM104940 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media, LLC, part of Springer Nature 2025 Background Human papillomavirus is the most common sexually transmitted infection in the United States and causes several diseases [ 1 2 3 4 An HPV vaccine, Gardasil 9, has been available in the United States since 2016 and is recommended starting at age 11 or 12 as a primary prevention method for nine HPV types identified as 6,11,16,18,31,3,45,52, and 58 [ 2 5 6 7 8 Despite the availability of effective preventative measures, women in rural communities in the United States face health disparities regarding HPV infections. Screening rates in the southern United States have been low, particularly among women who have not undergone screening in the past five years [ 9 10 11 12 13 One barrier to screening for women in rural areas is a lack of access to healthcare. All but five of Louisiana’s parishes are considered Primary Care Health Professional Shortage Areas (HPSA), indicating that there are too few primary care providers in nearly every geographic area [ 14 Methods Study Design and Setting A cross-sectional study was conducted among women in rural and underserved areas of Louisiana from November 2022 to December 2023. Ethical approval was obtained from the Louisiana State University Health Science Shreveport Institutional Review Board (IRB) at (Approval No: 00002027). Participants and Data Collection Participants were eligible to be included in the study if they were adult females aged 25 to 64 with no history of hysterectomy and no history of cervical cancer. We used convenience sampling through a mobile health unit that travels to rural and underserved areas of north and central Louisiana, offering cervical cancer screening. A total of 141 women participated in the study. The self-administered questionnaire consisted of seven sections with multiple-choice or single-choice questions regarding sociodemographic factors, health behaviors, and knowledge and beliefs about the HPV virus and vaccine. Before answering the questionnaire, participants were required to sign an informed consent form. Annual income was self-reported and recorded as a categorical variable. The income variable does not represent household income but rather that of individual participants and does not indicate proximity to the federal poverty line. The HPV knowledge, behavior, and belief variables in this study included HPV Knowledge Score, having ever heard of the HPV vaccine, perceived risk of HPV infection, and adherence to HPV screening recommendations. The HPV Knowledge Score is a continuous variable made by the summation of correct responses to 23 questions concerning HPV and the HPV vaccine. Correct answers were worth one point, while incorrect or “I don’t know” responses were worth zero points, allowing participants to score on a scale of 0 to 23. The “Ever heard of HPV Vaccine” and “Perceived Risk of HPV” variables are used as dichotomous variables, with “No” and “I don’t know” responses combined for the latter. A multiple-choice question asking participants for time since their last Pap was converted into a variable indicating adherence to HPV screening recommendations. Confounders included in the analysis were age, race, education, and adherence to screening recommendations. Statistical Analysis After descriptive statistics on the sample were prepared (see Table 1 2 3  Table 1 Baseline characteristics of study participants Variable Total ( n Age (mean ± SD) 55.1 ± 9.4 Female (%) 141 (100.0%) Race (%) African American 76 (53.9%) Non-African American 65 (46.1%) Employment status (%) Working full time 52 (31.1%) Working part time 20 (14.3%) Other 1 68 (48.6%) Highest education level (%) High school diploma or less 86 (61.9%) More than high school diploma 53 (38.1%) Annual Income $0 to $24,999 88 (67.7%) $25,000 to $49,999 27 (20.8%) $50,000 and greater 15 (11.5%) HPV Knowledge Score (mean ± SD) 7.7 ± 5.6 Ever Heard of HPV Vaccine (%) Yes 86 (39.0%) No 55 (61.0%) Perceived risk of HPV (%) Yes 13 (9.2%) No/Not sure 128 (90.8%) Adherence to screening recommendations 2 Yes 85 (65.9%) No 44 (34.1%) 1 2  Table 2 Unadjusted and adjusted odds for an association between “ever heard of HPV vaccine” and annual income Unadjusted 2 Partially adjusted a Adjusted b OR 95% CI OR 95% CI OR 95% CI  Annual Income $25,000 to $49,999 1 5.25 (1.68, 16.43) 4.63 (1.45, 14.81) 3.95 (1.20, 13.07) $50,000 and greater 5.93 (1.26, 27.84) 5.79 (1.20, 27.93) 4.81 (0.97, 23.92) 1 2 a b  Table 3 Unadjusted and adjusted odds for an association between HPV risk perception and HPV knowledge score Unadjusted Partially adjusted a Adjusted b OR 95% CI OR 95% CI OR 95% CI  Perceived risk Yes 1.23 (1.08, 1.40) 1.20 (1.06, 1.37) 1.21 (1.03, 1.42) 1 a b Results The study’s sample, with an average age of 55.1 years (SD = 9.4), most African American women (53.9%). Almost 70% had up to a high school diploma, 31.1% reported working full-time, and 67.7% had an annual income of $24,999 or less (See Table 1 In the unadjusted model, those with an annual income of $50,000 or greater were over five times as likely to have heard of the HPV vaccine (odds ratio, 5.93; 95% CI, 1.26–27.84). After adjusting for confounders such as age, race, and education in the partially adjusted model, this association weakened slightly but remained significant (see Table 2 The model exploring the relationship between HPV knowledge and HPV risk perception indicated a positive association between the perceived risk of HPV and higher HPV Knowledge Scores, with an approximate 20% increased likelihood of HPV risk perception for each HPV question answered correctly in both the unadjusted and adjusted models. This association remained significant after adjusting for adherence to screening recommendations and sociodemographic factors. Those who perceived themselves at risk for HPV were more likely to have higher knowledge about HPV, highlighting the importance of risk perception in influencing health knowledge. Discussion This study highlights gaps in HPV awareness and vaccination knowledge among women in rural and underserved areas of Louisiana. Although HPV is the most common sexually transmitted infection in the United States, older individuals are traditionally not regarded as being at risk for sexually transmitted infections (STIs) [ 15 16 17 18 Half of the participants in this study were unaware that HPV could be transmitted sexually, and 49% did not know an HPV vaccine was available [ 19 20 16 21 22 Another important finding of this study was the link between higher income levels and increased awareness of the HPV vaccine. Although the Affordable Care Act has opened avenues for most patients’ medical insurance to cover preventative care, such as HPV vaccination, without any out-of-pocket cost to the patient, prior research has shown that socioeconomic factors still significantly affect health awareness and access to preventive services [ 23 23 24 25 26 27 28 The findings of this study have significant implications for public health practice and policy. To address the gaps identified, public health interventions must focus on culturally- and regionally tailored education campaigns that raise awareness about HPV infection and its vaccine. These campaigns should prioritize rural communities and address misconceptions about HPV transmission, risks, and prevention. Community health workers and local healthcare providers can play essential roles in delivering these messages and building trust within underserved populations. When those in rural areas have consistent relationships with healthcare providers, trust can be built between them, giving patients more confidence in their provider’s advice. Building these relationships is crucial to raising HPV and vaccination awareness and increasing vaccination rates. To do this, however, we must first work to increase access to these medically underserved areas. From a policy perspective, increasing healthcare resources in rural areas is imperative. Mobile health units, such as the one utilized in this study, can serve as effective platforms for screening, education, and vaccination services. These units drastically increase healthcare access for those in rural areas who may not have access to transportation or have other barriers to traveling to a healthcare provider in a more urban area. However, their reach must be expanded, and their efforts must be supplemented by policies that reduce financial and logistical barriers to healthcare access. Integrating HPV education and vaccination programs into community health initiatives, such as school health programs and local health fairs, can also enhance their effectiveness. This study addresses a significant public health issue, providing valuable insights into HPV vaccination awareness and perceived risks among women in rural areas who are more likely to be overdue for Pap smear screenings, highlighting a gap in preventive healthcare. Using a mobile health unit for data collection increased accessibility and ensured that the sample included women who might otherwise face barriers to participation. Additionally, the study design allowed for assessing sociodemographic and health behavior factors, contributing to a comprehensive understanding of disparities in HPV-related knowledge and outcomes. Study Limitations The small sample size in this study was due to the nature of participant recruitment and the study design. We conducted a cross-sectional study over one year, recruiting women attending the mobile health unit serving rural and underserved areas. One of the study’s endpoints was to provide HPV screening and assess HPV infection rates. As the study progressed, we encountered participant repetition. Many of the women who initially participated returned for subsequent screenings, limiting our ability to recruit new participants. This, along with the specific focus on HPV infection assessment, further constrained the eligible population, contributing to the smaller sample size. The cross-sectional nature of the study also precludes the determination of causality between sociodemographic factors and HPV awareness or risk perception. Other limitations include convenience sampling, which may introduce selection bias and limit the generalizability of findings. Finally, reliance on self-reported data could result in recall bias, potentially affecting the validity of certain variables. Conclusion To achieve health equity for women in rural Louisiana and similar underserved areas, targeted interventions that address the specific challenges they face are urgently needed. Efforts to improve access to healthcare services, enhance education and awareness, and foster community engagement should be prioritized. Policymakers, researchers, and healthcare providers must collaborate to develop and implement strategies addressing rurality, socioeconomic disadvantage, and health disparities. These strategies require system changes within healthcare practices that can be easily reproducible to improve HPV screening and vaccination rates. Furthermore, these practices require minimal resources, and most, if not all, can be easily implemented into any practice setting. Future research should identify and address barriers to HPV vaccination and screening, including cultural factors, healthcare provider influence, and systemic challenges. Observational, interventional, and implementation research will be essential in designing and evaluating effective solutions. By addressing these disparities, we can work toward a future where all women, regardless of where they live, have equal access to preventive healthcare and are empowered to protect themselves against HPV and its associated health risks. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We want to thank the Partners in Wellness Program and the Mobile Health Unit staff for helping us to promote and conduct this study. This work is partly supported by U54 GM104940 from the National Institute of General Medical Sciences of the National Institutes of Health, which funds the Louisiana Clinical and Translational Science Center. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health. Funding This work was partly supported by U54 GM104940 Data Availability Research data supporting the findings of this study are available upon reasonable request from the corresponding author. Declarations Conflict of interest The authors declare no personal or financial relationships that could influence the outcomes of this research. Ethics Approval Ethical approval for the study was obtained from the Louisiana State University Health Science Shreveport Institutional Review Board (IRB), with approval number 00002027. Before answering the questionnaire, participants were required to sign an informed consent form. Informed Consent Informed consent was obtained from all participants involved in the study before their inclusion. References 1. Lacey CJ Lowndes CM Shah KV Burden and management of non-cancerous HPV-related conditions: HPV-6/11 disease Vaccine 2006 24 S35 S41 10.1016/j.vaccine.2006.06.015 16950016 Lacey, C. J., Lowndes, C. M., & Shah, K. V. (2006). Burden and management of non-cancerous HPV-related conditions: HPV-6/11 disease. Vaccine 24 10.1016/j.vaccine.2006.06.015 16950016 2. NCI. Human papillomavirus (HPV) Vaccines (2021). https://www.cancer.gov/about-cancer/causes-prevention/risk/infectious-agents/hpv-vaccine-fact-sheet 3. Satterwhite CL Torrone E Meites E Sexually transmitted infections among US women and men: Prevalence and incidence estimates, 2008 Sexually Transmitted Diseases 2013 40 3 187 193 10.1097/OLQ.0b013e318286bb53 23403598 Satterwhite, C. L., Torrone, E., Meites, E., et al. (2013). Sexually transmitted infections among US women and men: Prevalence and incidence estimates, 2008. Sexually Transmitted Diseases 40 23403598 10.1097/OLQ.0b013e318286bb53 4. Curtis, C., & Human Papillomavirus (2022). https://womenshealth.gov/a-z-topics/human-papillomavirus 5. Pingali, C. (2021). National, regional, state, and selected local area vaccination coverage among adolescents aged 13–17 years—United States, 2020. MMWR Morbidity and Mortality Weekly Report. 70. 10.15585/mmwr.mm7035a1 PMC8422873 34473682 6. Coverage, H. V. (2017). 15-National HPV Vaccination Program Register. In. 7. Sinka K Kavanagh K Gordon R Achieving high and equitable coverage of adolescent HPV vaccine in Scotland J Epidemiol Community Health 2014 68 1 57 63 10.1136/jech-2013-202620 23986492 Sinka, K., Kavanagh, K., Gordon, R., et al. (2014). Achieving high and equitable coverage of adolescent HPV vaccine in Scotland. J Epidemiol Community Health 68 23986492 10.1136/jech-2013-202620 8. Curry SJ Krist AH Owens DK Screening for cervical cancer: US preventive services task force recommendation statement Jama 2018 320 7 674 686 10.1001/jama.2018.10897 30140884 Curry, S. J., Krist, A. H., Owens, D. K., et al. (2018). Screening for cervical cancer: US preventive services task force recommendation statement. Jama 320 30140884 10.1001/jama.2018.10897 9. Akinlotan M Bolin JN Helduser J Ojinnaka C Lichorad A McClellan D Cervical cancer screening barriers and risk factor knowledge among uninsured women Journal of Community Health 2017 42 770 778 10.1007/s10900-017-0316-9 28155005 PMC5494033 Akinlotan, M., Bolin, J. N., Helduser, J., Ojinnaka, C., Lichorad, A., & McClellan, D. (2017). Cervical cancer screening barriers and risk factor knowledge among uninsured women. Journal of Community Health 42 28155005 10.1007/s10900-017-0316-9 PMC5494033 10. Zahnd WE James AS Jenkins WD Rural–Urban differences in cancer incidence and trends in the united States Cancer Epidemiology Biomarkers & Prevention 2018 27 11 1265 1274 10.1158/1055-9965.EPI-17-0430 PMC5787045 28751476 Zahnd, W. E., James, A. S., Jenkins, W. D., et al. (2018). Rural–Urban differences in cancer incidence and trends in the united States. Cancer Epidemiology Biomarkers & Prevention 27 10.1158/1055-9965.EPI-17-0430 PMC5787045 28751476 11. Meilleur A Subramanian S Plascak JJ Fisher JL Paskett ED Lamont EB Rural residence and cancer outcomes in the united States: Issues and challenges Cancer Epidemiology Biomarkers & Prevention 2013 22 10 1657 1667 10.1158/1055-9965.EPI-13-0404 PMC3814162 24097195 Meilleur, A., Subramanian, S., Plascak, J. J., Fisher, J. L., Paskett, E. D., & Lamont, E. B. (2013). Rural residence and cancer outcomes in the united States: Issues and challenges. Cancer Epidemiology Biomarkers & Prevention 22 10.1158/1055-9965.EPI-13-0404 PMC3814162 24097195 12. Yang DX Soulos PR Davis B Gross CP James BY Impact of widespread cervical cancer screening: Number of cancers prevented and changes in race-specific incidence American Journal of Clinical Oncology 2018 41 3 289 10.1097/COC.0000000000000264 26808257 PMC4958036 Yang, D. X., Soulos, P. R., Davis, B., Gross, C. P., & James, B. Y. (2018). Impact of widespread cervical cancer screening: Number of cancers prevented and changes in race-specific incidence. American Journal of Clinical Oncology 41 26808257 10.1097/COC.0000000000000264 PMC4958036 13. Suk R Hong Y-R Rajan SS Xie Z Zhu Y Spencer JC Assessment of US preventive services task force Guideline–Concordant cervical cancer screening rates and reasons for underscreening by age, race and ethnicity, sexual orientation, rurality, and insurance, 2005 to 2019 JAMA Network Open 2022 5 1 e2143582 e2143582 10.1001/jamanetworkopen.2021.43582 35040970 PMC8767443 Suk, R., Hong, Y-R., Rajan, S. S., Xie, Z., Zhu, Y., & Spencer, J. C. (2022). Assessment of US preventive services task force Guideline–Concordant cervical cancer screening rates and reasons for underscreening by age, race and ethnicity, sexual orientation, rurality, and insurance, 2005 to 2019. JAMA Network Open 5 35040970 10.1001/jamanetworkopen.2021.43582 PMC8767443 14. Well-AHEAD. Health Professional Shortage Areas. (2022).; https://wellaheadla.com/healthcare-access/health-professional-shortage-areas/ 15. Mahar, F., & Sherrard, J. (2024). Sexually transmitted infections. Sexual Health and the Menopause 1 16. Vinodhini K Shanmughapriya S Das BC Natarajaseenivasan K Prevalence and risk factors of HPV infection among women from various provinces of the world Archives of Gynecology and Obstetrics 2012 285 771 777 10.1007/s00404-011-2155-8 22159694 Vinodhini, K., Shanmughapriya, S., Das, B. C., & Natarajaseenivasan, K. (2012). Prevalence and risk factors of HPV infection among women from various provinces of the world. Archives of Gynecology and Obstetrics 285 22159694 10.1007/s00404-011-2155-8 17. Burk RD Ho GYF Beardsley L Lempa M Peters M Bierman R Sexual behavior and partner characteristics are the predominant risk factors for genital human papillomavirus infection in young women The Journal of Infectious Diseases 1996 174 4 679 689 10.1093/infdis/174.4.679 8843203 Burk, R. D., Ho, G. Y. F., Beardsley, L., Lempa, M., Peters, M., & Bierman, R. (1996). Sexual behavior and partner characteristics are the predominant risk factors for genital human papillomavirus infection in young women. The Journal of Infectious Diseases 174 8843203 10.1093/infdis/174.4.679 18. Chelimo C Wouldes TA Cameron LD Elwood JM Risk factors for and prevention of human papillomaviruses (HPV), genital warts and cervical cancer Journal of Infection 2013 66 3 207 217 10.1016/j.jinf.2012.10.024 23103285 Chelimo, C., Wouldes, T. A., Cameron, L. D., & Elwood, J. M. (2013). Risk factors for and prevention of human papillomaviruses (HPV), genital warts and cervical cancer. Journal of Infection 66 23103285 10.1016/j.jinf.2012.10.024 19. CDC. Basic information about HPV and cancer (2022). https://www.cdc.gov/cancer/hpv/basic_info/ 20. Adjei Boakye E Tobo BB Rojek RP Mohammed KA Geneus CJ Osazuwa-Peters N Approaching a decade since HPV vaccine licensure: Racial and gender disparities in knowledge and awareness of HPV and HPV vaccine Human Vaccines & Immunotherapeutics 2017 13 11 2713 2722 10.1080/21645515.2017.1363133 28853980 PMC5703403 Adjei Boakye, E., Tobo, B. B., Rojek, R. P., Mohammed, K. A., Geneus, C. J., & Osazuwa-Peters, N. (2017). Approaching a decade since HPV vaccine licensure: Racial and gender disparities in knowledge and awareness of HPV and HPV vaccine. Human Vaccines & Immunotherapeutics 13 28853980 10.1080/21645515.2017.1363133 PMC5703403 21. Zahnd WE Murphy C Knoll M The intersection of rural residence and minority race/ethnicity in cancer disparities in the united States International Journal of Environmental Research and Public Health 2021 18 4 1384 10.3390/ijerph18041384 33546168 PMC7913122 Zahnd, W. E., Murphy, C., Knoll, M., et al. (2021). The intersection of rural residence and minority race/ethnicity in cancer disparities in the united States. International Journal of Environmental Research and Public Health 18 33546168 10.3390/ijerph18041384 PMC7913122 22. Cates JR Brewer NT Fazekas KI Mitchell CE Smith JS Racial differences in HPV knowledge, HPV vaccine acceptability, and related beliefs among rural, Southern women Journal of Rural Health 2009 25 1 93 97 10.1111/j.1748-0361.2009.00204.x 19166567 Cates, J. R., Brewer, N. T., Fazekas, K. I., Mitchell, C. E., & Smith, J. S. (2009). Racial differences in HPV knowledge, HPV vaccine acceptability, and related beliefs among rural, Southern women. Journal of Rural Health 25 10.1111/j.1748-0361.2009.00204.x 19166567 23. Kurani S MacLaughlin KL Jacobson RM Socioeconomic disadvantage and human papillomavirus (HPV) vaccination uptake Vaccine 2022 40 3 471 476 10.1016/j.vaccine.2021.12.003 34916103 PMC8778948 Kurani, S., MacLaughlin, K. L., Jacobson, R. M., et al. (2022). Socioeconomic disadvantage and human papillomavirus (HPV) vaccination uptake. Vaccine 40 34916103 10.1016/j.vaccine.2021.12.003 PMC8778948 24. Walling, E. B., Benzoni, N., Dornfeld, J. Bhandari, R., Sisk, B. A., Garbutt, J., & Colditz, G. (2016). Interventions to improve HPV vaccine uptake: A systematic review. Pediatrics 138 10.1542/peds.2015-3863 27296865 25. Read DS Joseph MA Polishchuk V Suss AL Attitudes and perceptions of the HPV vaccine in Caribbean and African-American adolescent girls and their parents Journal of Pediatric and Adolescent Gynecology 2010 23 4 242 245 10.1016/j.jpag.2010.02.002 20452260 Read, D. S., Joseph, M. A., Polishchuk, V., & Suss, A. L. (2010). Attitudes and perceptions of the HPV vaccine in Caribbean and African-American adolescent girls and their parents. Journal of Pediatric and Adolescent Gynecology 23 20452260 10.1016/j.jpag.2010.02.002 26. Lai JY Tinker AV Cheung WY Factors influencing the willingness of US women to vaccinate their daughters against the human papillomavirus to prevent cervical cancer Medical Oncology 2013 30 1 10 10.1007/s12032-013-0582-z 23609191 Lai, J. Y., Tinker, A. V., & Cheung, W. Y. (2013). Factors influencing the willingness of US women to vaccinate their daughters against the human papillomavirus to prevent cervical cancer. Medical Oncology 30 10.1007/s12032-013-0582-z 23609191 27. Nickel B Dodd RH Turner RM Factors associated with the human papillomavirus (HPV) vaccination across three countries following vaccination introduction Preventive Medicine Reports 2017 8 169 176 10.1016/j.pmedr.2017.10.005 29062681 PMC5645176 Nickel, B., Dodd, R. H., Turner, R. M., et al. (2017). Factors associated with the human papillomavirus (HPV) vaccination across three countries following vaccination introduction. Preventive Medicine Reports 8 29062681 10.1016/j.pmedr.2017.10.005 PMC5645176 28. Fazekas KI Brewer NT Smith JS HPV vaccine acceptability in a rural Southern area Journal of Women’S Health (2002) 2008 17 4 539 548 10.1089/jwh.2007.0489 18370586 Fazekas, K. I., Brewer, N. T., & Smith, J. S. (2008). HPV vaccine acceptability in a rural Southern area. Journal of Women’S Health (2002) 17 18370586 10.1089/jwh.2007.0489 ",
  "metadata": {
    "Title of this paper": "HPV vaccine acceptability in a rural Southern area",
    "Journal it was published in:": "Journal of Community Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474626/"
  }
}