{
  "title": "Paper_1023",
  "abstract": "pmc Front Med (Lausanne) Front Med (Lausanne) 2657 frontmedicine Front. Med. Frontiers in Medicine 2296-858X Frontiers Media SA PMC12479539 PMC12479539.1 12479539 12479539 41035867 10.3389/fmed.2025.1645567 1 Medicine Original Research The significance of biological samples from pregnant women in cervical intraepithelial neoplasia Mi Xue Rashmi Maharjan Pan Zangyu Wu Di Miao Jinwei  * Beijing Obstetrics and Gynecology Hospital, Capital Medical University, Beijing Maternal and Child Health Care Hospital Beijing China Edited by: Violante Di Donato Reviewed by: Birhanu Hailu Tirkaso Francisco Javier Castro Apodaca M. Shanthini *Correspondence: Jinwei Miao, jinweimiao@ccmu.edu.cn 16 9 2025 2025 12 480650 1645567 12 6 2025 04 9 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Mi, Rashmi, Pan, Wu and Miao. 2025 Mi, Rashmi, Pan, Wu and Miao https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background and aims Cervical cancer remains a significant threat to women’s health, with pregnant women representing a particularly vulnerable population. This study aimed to investigate the impact of cervical intraepithelial neoplasia (CIN) on pregnancy outcomes using longitudinal biological sample analysis. Methods We conducted a retrospective study of 125 pregnant women who underwent vaginal examination following abnormal cervical cytology and/or positive human papillomavirus (HPV) testing. Suspected cases underwent colposcopy-directed cervical biopsy performed by experienced clinicians (10 year of work experience) during pregnancy. Postpartum follow-up included repeat cervical cytology, HPV testing, and colposcopic biopsy when indicated. Results Among the 125 patients, 34 underwent colposcopic biopsy during pregnancy, with histopathological results demonstrating strong concordance with colposcopic findings (kappa = 0.82, * p p Conclusion For pregnant women declining cervical biopsy during pregnancy, colposcopy represents a safe and clinically valuable diagnostic tool. Persistent cervical cytological abnormalities, but not HPV positivity, were identified as a significant risk factor for CIN2 + persistence. cervical intraepithelial neoplasia cervical cytology human papilloma virus pregnancy colposcopy The author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by Beijing Hospitals Authority’s Ascent Plan (code: DFL20221201); Beijing Municipal Health Commission, China Capital’s Funds for Health Improvement and Research (grant number: 2022-1G-2112). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Obstetrics and Gynecology Introduction Cervical carcinoma represents the fourth most prevalent gynecologic malignancy worldwide ( 1 2 3 in situ 4 5 6 Recent advances in molecular oncology have significantly enhanced our understanding of cervical carcinogenesis, with numerous studies investigating tumor biology and morphology ( 7–9 10 11 12 13 14 Pregnancy-associated CIN represents a unique clinical entity with distinct diagnostic and management challenges. Current evidence remains limited and often contradictory regarding the natural history of CIN during pregnancy. Our study specifically examines this high-risk population to evaluate: (1) the predictive value of cervical cytology and HPV testing for disease progression, and (2) the clinical outcomes of pregnancy-complicated CIN, with particular emphasis on developing optimized surveillance strategies. Materials and methods This was a single-center retrospective study. This retrospective cohort study included 125 pregnant patients who underwent concurrent cervical cytology, HPV testing, and colposcopic evaluation at Beijing Obstetrics and Gynecology Hospital, Capital Medical University (Beijing, China) between January 2015 and December 2019. Among these 125 pregnant women, all underwent colposcopy due to abnormal cervical cytology or high-risk HPV. The study protocol received ethical approval from the Institutional Review Board of Beijing Obstetrics and Gynecology Hospital, Capital Medical University (Beijing, China). Inclusion criteria: 1. Pregnant women aged 21–45 years; 2. Cytological abnormalities (ASC-US or greater) and/or positive high-risk HPV test during pregnancy; 3. Completion of colposcopic examination during gestation. Exclusion criteria: 1. Current or history of significant pregnancy complications (including but not limited to placenta previa or active vaginal bleeding); 2. Known HIV infection or immunocompromised status (primary or secondary); 3. Diagnosis or treatment of cervical lesions within 12 months preceding conception; 4. Pregnancy termination prior to completion of diagnostic workup. The collected data include age, cervical cytology, HPV results, colposcopy results and cervical biopsy. Classifications of cytology and histopathology refer to the cervical cancer screening guidelines (2020), which created by the American Cancer Society (ACS). The colposcopy examination results of this study are defined as follows ( 15 For the pathological results of cervical biopsy, in this study, cases with “mild colposcopy impression” and pathological results of CIN1 or cervicitis were defined as “colposcopy-histopathological consistency.” The cases with “severe colposcopy impression” and pathological results of CIN2-3 or invasive cancer examined were defined as “colposcopy-histopathological consistency.” Cases where the colposcopy results are worse than the histopathological diagnosis are defined as “overestimated colposcopy,” and cases where the colposcopy results were better than the histopathological diagnosis were defined as “underestimated colposcopy”. Postpartum follow-ups of all patients were done within one year after delivery. Patients were interviewed through a call to collect adequate information. Final follow-up results were compared with initial results to determine cervical lesions outcomes such as progression, persistence, regression and complete regression in terms of cervical cytology, HPV, colposcopy and cervical biopsy. In addition, outcome of patients was also analyzed interms of parity, mode of delivery and area. Statistical analysis was performed in SPSS (version 27.0). Clinical categorical variables were presented in numbers and percentages. Logistic regression was applied to find the predictive role of disease outcome. The consistency test of diagnostic tests was conducted using Cohen’s Kappa test. Associations were shown as odds ratios (OR) with 95% confidence intervals (CI), and a p Result Clinical characteristics of pregnant women A total of 125 pregnant women were enrolled in this study, all of whom underwent colposcopy due to abnormal results of cervical cytology or HPV tests. The age of the enrolled patients was 31.0 ± 3.8 years (the youngest was 23 years and the oldest was 43 years), and other conditions were as follows (see Table 1 Table 1 General characteristics of patients. Number (%) Cervical cytology ASCUS 24 (19.2) LSIL 49 (39.2) ASC-H 7 (5.6) HSIL 45 (36.0) HPV Negative 17 (13.6) Positive 108 (86.4) Delivery mode Cesarean section 57 (45.6) Vaginal delivery 68 (54.4) Previous childbirth history 0 83 (66.4) 1 40 (32.0) 2 2 (1.6) Colposcopy examination results 26 of 125 patients underwent colposcopy examinations twice: the first examination is in the early stage of pregnancy, and the second examination is in the middle stage of pregnancy. In the 26 cases, 22 cases were HSIL twice; 2 cases were HSIL in the first test and early invasion carcinoma in the second test; 1 case was LSIL in the first test and the second result was HSIL; 1 case was LSIL obtained in both colposcopy tests; Except for two cancer patients who underwent active surgery in the third trimester of pregnancy, the other 24 patients did not receive treatment during pregnancy. Among 24 cases, 7 were persistent (29.2%) and 17 regression (70.8%) including 9 complete regression cases (see Table 2 Table 2 Colposcopic impression and cervical biopsy. Number (%) Colposcopic impression Cervicitis 16 (12.8) LSIL 37 (29.6) HSIL 67 (53.6) Cancer 5 (4.0) Cervical biopsy CIN1 7 (20.6) CIN2+ 22 (64.7) Cancer 5 (14.7) The results of colposcopy during pregnancy showed that there were 72 cases (57.6%) of “severe colposcopy impression,” including 67 cases of HSIL and 5 cases of invasive cervical cancer, and 53 cases (42.4%) of “mild colposcopy impression,” including 16 cases of cervicitis. There were 37 cases of LSIL. Only 34 patients with “severe colposcopy impression” underwent colposcopy cervical tissue biopsy. The pathological results were cervicitis 2(5.9%), CINI 5 (14.7%), CINII 7 (20.6%), CINIII 15 (44.1%), and cancer 5(14.7%). “Colposcope and histopathological concordance” 32 cases (94.1%), “colposcope examination overestimation” in 2 cases (5.9%), “colposcope examination underestimation” 0 cases (0%) (see Table 3 Table 3 Colposcopic impression accuracy. Number (%) K* coefficient 95%CI Standard error p Concordance 32 (94.1%) 0.882 0.699–1.043 0.081 <0.001 Colposcopy underestimation 0 (0%) Colposcopy overestimation 2 (5.9%) During the postpartum follow-up, among the 125 patients, 5 patients were diagnosed with cervical cancer during pregnancy and received timely treatment, surviving until now. The clinical data of their postpartum re-examination were no longer included, and the follow-up of another 4 patients refused. Ultimately, 116 patients underwent cervical cytology and HPV tests within 6 weeks to 10 months after delivery. The results of cervical cytology examination are as follows: HSIL 31 (26.7%), LSIL 35 (30.2%), ASCUS 12 (10.3%), ASC-H 1 (0.9%), NILM 37 (31.9%). There were 76 cases (65.5%) positive for HPV testing after childbirth and 40 cases (34.5%) negative. Among the 116 patients, 98 patients underwent colposcopy and cervical tissue biopsy. As the results of cervical cytology and HPV were negative, colposcopy was not performed in 18 cases, and it was considered to have completely regressed. Colposcopy was used as a comparison of outcomes during pregnancy and postpartum. Among the patients with colposcopy results of LSIL during pregnancy, 13 cases (35.1%) were persistent, 7 cases (18.9%) were progressive, and 17 cases (46.0%) were regression. Among the patients with HSIL in the colposcopy examination results during pregnancy, 29 cases (47.5%) were persistent, 0 cases (0.0%) progressed, 32 cases (52.5%) regressed, and 20 cases (32.8%) completely regressed (see Table 4 Table 4 Comparison of colposcopy impression during pregnancy and postpartum. Colposcopy impression LSIL HSIL X 2  P Number (%) Number (%) Persistence/progression 20 (54.0%) 29 (47.5%) 0.391 0.532 Regression 17 (46.0%) 32 (52.5%) The influencing factors of the outcome of cervical intraepithelial neoplasia were analyzed by multiple logistic regression. The outcome was based on the results of colposcopy. Due to the negative results of cervical cytology and HPV, cases without colposcopy are considered to have complete regression of cervical intraepithelial neoplasia. Persistent abnormal cytological results are significantly associated with the outcome of CIN. High-risk HPV infection, age, parity, mode of delivery and region were not related to the outcome of CIN (see Table 5 Table 5 Analysis of outcome factors of cervical intraepithelial neoplasia. Category Persistence/progression Regression Univariate Multivariate Number (%) Number (%) Odds ratio (95% CI) P Odds ratio (95% CI) P Age (years) <35 46 (48.0) 50 (52.0) ≥35 9 (45.0) 11 (55.0) 1.124 (0.427–2.959) 0.812 1.446 (0.437–4.783) 0.545 Cervical cytology Yes a 45 (81.8) 10 (18.2) No a 19 (31.1) 42 (68.9) 9.947 (4.153–23.829) <0.001 9.838 (3.851–25.135) <0.001 High-risk HPV Yes b 39 (70.9) 16 (29.1) No b 30 (49.2) 31 (50.8) 2.519 (1.168–5.432) 0.018 1.451 (0.580–3.629) 0.426 Parity 0 42 (53.8) 36 (46.2) ≥1 19 (50.0) 19 (50.0) 0.857 (0.394–1.863) 0.697 0.975 (0.384–2.475) 0.957 Delivery mode Vaginal 29 (43.3) 38 (56.7) CS 26 (53.1) 23 (46.9) 1.481 (0.706–3.106) 0.298 1.732 (0.710–4.221) 0.227 Area beijing 29 (51.8) 27 (48.2) Non-local 26 (43.3) 34 (56.7) 1.405 (0.676–2.920) 0.363 2.081 (0.826–5.243) 0.120 a Cervical cytology: No-regression. Yes-persistence/progression. Regression included 2 parts. One part: after re-examination, HISL or ASC-H was changed to LISL, ASCUS. Another part: after re-examination, NILM and LISL or ASCUS was changed to NILM. Persistence/progression included 3 parts. One part: after re-examination, HISL or ASC-H was changed to cervical cancer. Another part: after re-examination, LISL or ASCUS was changed to HISL, ASC-H or cervical cancer. b High-risk HPV: No-regression, Yes-persistence. Regression means that after re-examination, high-risk HPV was changed to low-risk HPV or negative; persistence means that after re-examination, high-risk HPV was stable. The biopsy results of cervical tissues in 98 patients were as follows: 29 cases (29.6%) of cervicitis, 29 cases (29.6%) of CIN1, 20 cases (20.4%) of CIN2, and 20 cases (20.4%) of CIN3. There were no new cases of cervical cancer among the patients during the postpartum follow-up. The biopsy rate of cervical tissue in pregnant women who underwent colposcopy during pregnancy was 27.2%, and that in pregnant women who underwent colposcopy after childbirth was 100.0%. Discussion This study demonstrated a significantly higher rate of spontaneous regression of cervical lesions following delivery. Notably, we observed a remarkably low incidence of disease progression, with no cases progressing to invasive carcinoma during postpartum follow-up. These findings align with the 2019 American Society for Colposcopy and Cervical Pathology (ASCCP) guidelines, which endorse conservative management for pregnant women diagnosed with CIN2 + lesions, provided invasive disease is excluded through thorough colposcopic evaluation and biopsy ( 16 The prognosis of cervical intraepithelial neoplasia (CIN) during pregnancy varies across studies. Vlahos et al. ( 17 18 19 20 21 9 22 The results of this study show that the colposcopy examination results have a high consistency with cervical tissue biopsy. In an observational study, it was found that 47 patients (68.1%) were generally “Colposcopy-histopathological consistent,” among which 12 patients (17.4%) had underestimated colposcopy and 10 patients (14.5%) had overestimated colposcopy ( 15 23 in situ In this study, the rate of cervical biopsy among pregnant women was relatively low. The possible reasons for the analysis are as follows: First, from the patients, because they refused to undergo cervical biopsy during pregnancy and were worried about the complications resulting from it. Secondly, it comes from doctors, as they tend to avoid any procedures that may lead to obstetric complications, fearing possible medical disputes. According to the data of this study, although the proportion of cervical biopsy during pregnancy was relatively low, it did not lead to adverse outcomes for patients and reduced medical costs. Therefore, this study considers that the low rate of cervical biopsy among pregnant women was acceptable. However, if cancer or deterioration of the lesion is suspected, it is recommended to repeat the colposcopy examination and perform a biopsy if necessary. If a cervical biopsy was not performed during pregnancy, it is also recommended to actively follow up after giving birth to confirm the diagnosis. It has been reported that selective treatments for high-grade lesions during pregnancy, such as cold knife conization (CKC) and loop electro-surgical excision procedure (LEEP), can lead to bleeding, miscarriage and premature birth. Robinson et al. reported a high incidence of complications. Among 20 women who received LEEP treatment in the second and third trimester of pregnancy, there were 3 cases of preterm birth, 3 cases of severe blood loss, and 1 case of intrauterine fetal death ( 15 Most of the potential diagnostic and prognostic biomarkers of cervical tumor lesions are based on the molecular mechanisms related to HPV infection ( 24 25 26 Although cervical cytology tests and HPV tests are the first steps in cervical cancer screening. However, this study suggests that for pregnant women with CIN during pregnancy, cervical cytological examination seems to have more clinical value than HPV examination. The data of this study indicate that, compared with the postpartum data, the persistent abnormalities in cervical cytology during pregnancy are closely related to the persistence or progression of cervical lesions. Pregnancy is a vulnerable period for immune suppression in women and they experience various hormonal changes, which may lead to a greater chance of being infected with HPV ( 10 27 28 This study was conducted on pregnant women. The research subjects were pregnant women who were required to undergo colposcopy during pregnancy, so the clinical sample size was small. In particular, the sample size of the pregnancy biopsy group in this study was only 34 cases and 27 patients did not undergo postpartum colposcopy. This may limit statistical power. This is the limitation of this study. Previous studies also have the problem of having less data on the research subjects, and there are no updated data studies ( 29 Conclusion Our study demonstrates that conservative management is appropriate for high-grade CIN during pregnancy when invasive carcinoma has been excluded through thorough prenatal evaluation. In such cases, we recommend regular surveillance with cervical cytology and HPV testing. Importantly, colposcopy alone provides substantial clinical value for pregnancy monitoring, even when patients decline cervical biopsy. Key findings reveal that persistent cytological abnormalities strongly correlate with CIN prognosis in pregnant women, while persistent high-risk HPV infection shows no significant association with disease outcomes. These results underscore the particular importance of cytological monitoring in the management of CIN during pregnancy. Data availability statement The original contributions presented in the study are included in the article/supplementary material, further inquiries can be directed to the corresponding author. Ethics statement The studies involving humans were approved by Medical Ethics Committee of Beijing Maternity Hospital, Capital Medical University. The studies were conducted in accordance with the local legislation and institutional requirements. Written informed consent for participation was not required from the participants or the participants’ legal guardians/next of kin in accordance with the national legislation and institutional requirements. Author contributions XM: Conceptualization, Data curation, Formal analysis, Investigation, Methodology, Writing – original draft. MR: Formal analysis, Methodology, Writing – original draft. ZP: Formal analysis, Writing – review & editing. DW: Formal analysis, Writing – review & editing. JM: Conceptualization, Project administration, Supervision, Validation, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Schubert M Bauerschlag DO Muallem MZ Maass N Alkatout I Challenges in the diagnosis and individualized treatment of cervical cancer Medicina (Kaunas) 2023 59 925 10.3390/medicina59050925 37241157 PMC10224285 2. Arbyn M Weiderpass E Bruni L de Sanjosé S Saraiya M Ferlay J Estimates of incidence and mortality of cervical cancer in 2018: a worldwide analysis Lancet Glob Health 2020 8 e191 203 10.1016/S2214-109X(19)30482-6 31812369 PMC7025157 3. Zhang J Lu CX Spontaneous regression of cervical intraepithelial neoplasia 2: a Meta-analysis Gynecol Obstet Investig 2019 84 562 7 10.1159/000497286 31055567 4. Smith LH Dalrymple JL Leiserowitz GS Danielsen B Gilbert WM Obstetrical deliveries associated with maternal malignancy in California, 1992 through 1997 Am J Obstet Gynecol 2001 184 1504 12 10.1067/mob.2001.114867 11408874 5. Smith LH Danielsen B Allen ME Cress R Cancer associated with obstetric delivery: results of linkage with the California cancer registry Am J Obstet Gynecol 2003 189 1128 35 10.1067/s0002-9378(03)00537-4 14586366 6. Eibye S Krüger Kjær S Nielsen TS Mellemkjær L Mortality among women with cervical cancer during or shortly after a pregnancy in Denmark 1968 to 2006 Int J Gynecol Cancer 2016 26 951 8 10.1097/IGC.0000000000000708 27101585 7. Rachkovskaya VI Gorbunov A Pashov A Volkova L Kant Baltic Federal University the use of mass spectrometry in cervical pathology diagnostics literature review Sib Med Rev 2020 2020 30 7 10.20333/2500136-2020-3-30-37 8. Balasubramaniam SD Balakrishnan V Oon CE Kaur G Key molecular events in cervical Cancer development Medicina 2019 55 384 10.3390/medicina55070384 31319555 PMC6681523 9. Kelly H Benavente Y Pavon MA De Sanjose S Mayaud P Lorincz AT Performance of DNA methylation assays for detection of high-grade cervical intraepithelial neoplasia (CIN2+): a systematic review and meta-analysis Br J Cancer 2019 121 954 65 10.1038/s41416-019-0593-4 31616037 PMC6889421 10. Freeman-Wang T Walker P Colposcopy in special circumstances: pregnancy, immunocompromise, including HIV and transplants, adolescence and menopause Best Pract Res Clin Obstet Gynaecol 2011 25 653 65 10.1016/j.bpobgyn.2011.05.008 21843974 11. Vasques RB Carramenha LL Basílio I Leão MEB Carvalho GPSL Amaral RMC Evaluation of uterine cervical cancer in pregnancy: a cross-sectional study Eur J Obstet Gynecol Reprod Biol 2020 246 35 9 10.1016/j.ejogrb.2019.12.030 31927408 12. Schuster S Joura E Kohlberger P Natural history of squamous intraepithelial lesions in pregnancy and mode of delivery Anticancer Res 2018 38 2439 42 10.21873/anticanres.12496 29599374 13. Stonehocker J Cervical cancer screening in pregnancy Obstet Gynecol Clin N Am 2013 40 269 82 10.1016/j.ogc.2013.03.005 23732031 14. Massad LS Einstein MH Huh WK Katki HA Kinney WK Schiffman M 2012 updated consensus guidelines for the management of abnormal cervical cancer screening tests and cancer precursors Obstet Gynecol 2013 121 829 46 10.1097/AOG.0b013e3182883a34 23635684 15. Ciavattini A Serri M Di Giuseppe J Liverani CA Fallani MG Tsiroglou D Data on post-partum evaluation of women with abnormal cervical cytology in pregnancy Data Brief 2018 21 2405 9 10.1016/j.dib.2018.11.092 30547066 PMC6282187 16. Perkins RB Guido RS Castle PE Chelmow D Einstein MH Garcia F Erratum: 2019 ASCCP risk-based management consensus guidelines for abnormal cervical cancer screening tests and cancer precursors J Low Genit Tract Dis 2021 25 330 1 10.1097/LGT.0000000000000628 34542089 17. Vlahos G Rodolakis A Diakomanolis E Stefanidis K Haidopoulos D Abela K Conservative management of cervical intraepithelial neoplasia (CIN(2-3)) in pregnant women Gynecol Obstet Investig 2002 54 78 81 10.1159/000067715 12566748 18. Mailath-Pokorny M Schwameis R Grimm C Reinthaller A Polterauer S Natural history of cervical intraepithelial neoplasia in pregnancy: postpartum histo-pathologic outcome and review of the literature BMC Pregnancy Childbirth 2016 16 74 10.1186/s12884-016-0861-8 27055819 PMC4825080 19. Yost NP Santoso JT McIntire DD Iliya FA Postpartum regression rates of antepartum cervical intraepithelial neoplasia II and III lesions Obstet Gynecol 1999 93 359 62 10.1016/s0029-7844(98)00483-9 10074979 20. Stuebs FA Mergel F Koch MC Dietl AK Schulmeyer CE Adler W Cervical intraepithelial neoplasia grade 3: development during pregnancy and postpartum Arch Gynecol Obstet 2023 307 1567 72 10.1007/s00404-022-06815-7 36271921 PMC10110634 21. Chen C Xu Y Huang W Du Y Hu C Natural history of histologically confirmed high-grade cervical intraepithelial neoplasia during pregnancy: meta-analysis BMJ Open 2021 11 e048055 10.1136/bmjopen-2020-048055 34417214 PMC8381303 22. Bracic T Reich O Taumberger N Tamussino K Trutnovsky G Does mode of delivery impact the course of cervical dysplasia in pregnancy? A review of 219 cases Eur J Obstet Gynecol Reprod Biol 2022 274 13 8 10.1016/j.ejogrb.2022.05.002 35561565 23. Grimm D Lang I Prieske K Jaeger A Müller V Kuerti S Course of cervical intraepithelial neoplasia diagnosed during pregnancy Arch Gynecol Obstet 2020 301 1503 12 10.1007/s00404-020-05518-1 32322982 24. Nakamura M Obata T Daikoku T Fujiwara H The association and significance of p53 in gynecologic cancers: the potential of targeted therapy Int J Mol Sci 2019 20 5482 10.3390/ijms20215482 31689961 PMC6862296 25. Molina MA Steenbergen RDM Pumpe A Kenyon AN Melchers WJG HPV integration and cervical cancer: a failed evolutionary viral trait Trends Mol Med 2024 30 890 902 10.1016/j.molmed.2024.05.009 38853085 26. Włoszek E Krupa K Skrok E Budzik MP Deptała A Badowska-Kozakiewicz A HPV and cervical Cancer-biology, prevention, and treatment updates Curr Oncol 2025 32 122 10.3390/curroncol32030122 40136326 PMC11941113 27. Faber MT Duun-Henriksen AK Dehlendorff C Tatla MK Munk C Kjaer SK Adverse pregnancy outcomes and infant mortality after quadrivalent HPV vaccination during pregnancy Vaccine 2019 37 265 71 10.1016/j.vaccine.2018.11.030 30503078 28. Kim JY Shim JY Cervical intraepithelial neoplasia and cervical cytology in pregnancy J Pathol Transl Med 2024 58 283 90 10.4132/jptm.2024.10.17 39557409 PMC11573476 29. Mihai M Maya P Roy K Sharon D Intraepithelial lesions of the uterine cervix during pregnancy: reaffirming the safety of conservative management Gynecol Oncol Rep 2025 60 101792 10.1016/j.gore.2025.101792 40678576 PMC12268572 ",
  "metadata": {
    "Title of this paper": "Intraepithelial lesions of the uterine cervix during pregnancy: reaffirming the safety of conservative management",
    "Journal it was published in:": "Frontiers in Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479539/"
  }
}