{
  "title": "Paper_764",
  "abstract": "pmc Antioxidants (Basel) Antioxidants (Basel) 2840 antiox antioxidants Antioxidants 2076-3921 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12466791 PMC12466791.1 12466791 12466791 41008952 10.3390/antiox14091045 antioxidants-14-01045 1 Article Mangosteen Pericarp Extract Mitigates Diquat-Induced Hepatic Oxidative Stress by NRF2/HO-1 Activation, Intestinal Barrier Integrity Restoration, and Gut Microbiota Modulation Huang Weichen Methodology Software Formal analysis Investigation Data curation Writing – original draft 1 2 Lv Yujie Formal analysis Investigation 1 3 Zou Chenhao Investigation 1 Ge Chaoyue Investigation 1 3 Zhan Shenao Investigation 1 Shen Xinyu Investigation 1 3 Wu Lianchi Investigation 1 Wang Xiaoxu Investigation 1 Yuan Hongmeng Investigation 1 2 Lin Gang Investigation 4 Yu Dongyou Supervision Project administration Funding acquisition 1 2 3 * https://orcid.org/0000-0002-0809-3358 Liu Bing Methodology Investigation Writing – review & editing Supervision Funding acquisition 1 2 3 * Rufián-Henares José Ángel Academic Editor 1 22317098@zju.edu.cn 22217093@zju.edu.cn chenhao.zou@zju.edu.cn 22117078@zju.edu.cn 22317012@zju.edu.cn 22317063@zju.edu.cn 22217068@zju.edu.cn 22417088@zju.edu.cn 22417094@zju.edu.cn 2 3 4 bluewhalebell@163.com * dyyu@zju.edu.cn bing.liu@zju.edu.cn 25 8 2025 9 2025 14 9 497608 1045 01 7 2025 11 8 2025 18 8 2025 25 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Poultry production exposes birds to diverse environmental and physiological stressors that disrupt redox balance, impair gut–liver axis function, and undermine health and productivity. This study investigated the hepatoprotective and antioxidative effects of mangosteen pericarp extract (MPE) in an experimental model of diquat-induced oxidative stress in laying hens. A total of 270 Hy-Line White laying hens were randomly assigned to three groups: control group (CON), diquat-challenged group (DQ), and MEP intervention with diquat-challenged group (MQ), with six replicates of 15 birds each. The results showed that MPE supplementation effectively mitigated the hepatic oxidative damage caused by diquat, as evidenced by the increased ALT and AST activity, improved lipid metabolism, and reduced hepatic fibrosis. Mechanistically, MPE activated the NRF2/HO-1 antioxidant pathway, thus enhancing the liver’s ability to counteract ROS-induced damage and reducing lipid droplet accumulation in liver tissue. MPE supplementation restored intestinal barrier integrity by upregulating tight junction protein expression (Occludin-1 and ZO-1), enhancing MUC-2 expression, and thereby decreasing gut microbiota-derived LPS transferring from the intestine. Additionally, MPE also modulated gut microbiota composition by enriching beneficial bacterial genera such as Lactobacillus Ruminococcus Bacteroidales UCG-010 mangosteen pericarp extract oxidative stress nutritional regulation gut microbiota poultry fecal microbiota transplantation antioxidant mechanism National Natural Science Foundation of China 32402779 Zhejiang Provincial Natural Science Foundation ZCLMS25C1701 Public Welfare and Applied Research Project of Huzhou Science and Technology Bureau 2024GZ39 This work was financially supported by the National Natural Science Foundation of China (grant no. 32402779), the Zhejiang Provincial Natural Science Foundation (grant no. ZCLMS25C1701), and the Public Welfare and Applied Research Project of Huzhou Science and Technology Bureau (grant no. 2024GZ39). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction In modern poultry and livestock production, animals are frequently exposed to a wide array of environmental and physiological stressors—such as heat stress, mycotoxins, heavy metals, pathogenic infections, and high-density housing—that disrupt redox homeostasis and trigger oxidative stress [ 1 2 3 4 5 6 7 8 9 Mangosteen ( Garcinia mangostana 10 11 12 13 14 15 16 12 17 18 19 20 We previously established a diquat (DQ)-induced oxidative stress model in laying hens, which effectively simulates tissue injury through the gut–liver axis [ 21 22 23 24 25 26 2. Materials and Methods 2.1. Ethics Statement All experimental procedures followed institutional guidelines and were approved by the Animal Care and Use Committee of Zhejiang University (Hangzhou, China; Approval No. ZJU20241152). 2.2. Experimental Design and Diets A total of 270 Hy-Line White laying hens, aged 40 weeks and exhibiting uniform body weight and egg-laying performance, were randomly allocated to three groups. Each group included six replicates, with 15 birds per replicate. The three groups were the control group (CON), the diquat-challenged group (DQ), and the MEP intervention with the diquat-challenged group (MQ). The fine powdered MPE was thoroughly premixed into the basal diet to ensure uniform distribution before feeding. After a 2-week adaptation period, hens in the CON and DQ groups were fed basal diets, while the hens in the MQ groups were fed diets with 50 mg/kg of MEP. The MEP was sourced from Zhejiang Boxin Pharmaceutical Co., Ltd. (Huzhou, China), of which more than 80% is α-mangostin. The experimental diets ( Table S1 21 2.3. Sample Collection At the end of the experiment, one hen per replicate ( n g 2.4. Fecal Microbiota Transplantation Thirty hens that had been previously subjected to DQ challenge to induce oxidative stress and hepatic injury, following previously established oxidative stress models in poultry, were randomly divided into two groups: FMT-CON and FMT-MG ( n g 27 n 2.5. Organ Index Following euthanasia, abdominal adipose and hepatic tissues were immediately excised and weighed. Organ indices were calculated by normalizing the tissue weight to the corresponding live body weight using the following formula: Organ index (g/kg) = organ weight (g)/body weight (kg). 2.6. Serum Biochemical Profiling Serum biochemical parameters were assessed based on established protocols from our previous work [ 28 2.7. Histological Analysis Hepatic and jejunum tissues fixed in 4% paraformaldehyde were embedded in paraffin, sectioned at a thickness of 5 μm, and stained with hematoxylin and eosin (H&E), as Ge et al. [ 29 2.8. Oil Red O Staining and Sirius Red Staining Hepatic tissues were embedded in optimal cutting temperature (OCT) compound and sectioned into frozen slices. The sections were stained with Oil Red O following standard protocols. Stained sections were observed and imaged using an optical microscope (Nikon Eclipse 80i, Nikon, Japan). For Sirius Red staining, paraffin-embedded liver sections were deparaffinized, rehydrated, and stained with Sirius Red solution. After staining, sections were rinsed, mounted, and examined under the same microscope. 2.9. Transmission Electron Microscopy (TEM) Hepatic and jejunal tissues were cut into ~1 mm 3 30 2.10. Intestinal Permeability Parameters Serum levels of lipopolysaccharide (LPS), diamine oxidase (DAO), and D-(-)-lactic acid (D-LA) were measured using commercial assay kits (Aifang, Changsha, China) following the manufacturer’s instructions. 2.11. Oxidative Stress Parameter Assays Liver tissues and serum were analyzed for total antioxidant capacity (T-AOC), catalase (CAT), glutathione peroxidase (GSH-PX), superoxide dismutase (SOD), and malondialdehyde (MDA) levels using commercial assay kits (Jiancheng Bioengineering Institute, Nanjing, China). Results were standardized based on total protein concentration for cross-sample consistency. 2.12. Immunofluorescence Analysis Paraffin-embedded jejunum and liver tissue sections were deparaffinized, subjected to antigen retrieval, and treated with a fluorescence quenching reagent, followed by blocking with normal serum. Sections were then incubated overnight at 4 °C with primary antibodies against Occludin-1, MUC-2, NRF-2, and HO-1. After thorough washing, fluorophore-conjugated secondary antibodies matched to the host species were applied. Cell nuclei were stained with DAPI, and tissue sections were sealed using an anti-fade mounting reagent. Fluorescence signals were detected and captured using a fluorescence microscope, following previously reported procedures [ 27 2.13. Enzyme-Linked Immunosorbent Assay (ELISA) Serum concentrations of inflammatory cytokines (IL-6, IL-10, TNF-α, and TGF-β) were quantified in liver homogenate supernatants using chicken-specific ELISA kits (ABclonal Technology, Wuhan, China), as described previously [ 4 2.14. RNA Extraction and Quantitative Real-Time PCR Analysis Total RNA was extracted from homogenized liver tissues and jejunum tissues using FreeZol™ Reagent (R711-01, Vazyme Biotech, Nanjing, China) and subsequently reverse-transcribed into complementary DNA (cDNA) using the HiScript ® ® Table S2 −ΔΔCt 31 2.15. Western Blotting Total protein was extracted from liver tissues and separated by 12% SDS-PAGE (GenScript, Nanjing, China), followed by transfer onto nitrocellulose membranes (Millipore, MA, USA). Membranes were blocked with 5% skim milk and incubated overnight at 4 °C with primary antibodies against β-ACTIN (EM21002), NRF2 (R1312-8), and HO-1 (HA721854) (HUABIO, Hangzhou, China) under gentle agitation. After washing, the membranes were incubated at 37 °C for 1 h with an HRP-conjugated universal secondary antibody (goat anti-rabbit/mouse, HUABIO). Protein bands were visualized using the Tanon 5200 detection system (Tanon, Shanghai, China), and band intensities were quantified using ImageJ software (NIH, USA), with β-ACTIN serving as the internal loading control. 2.16. 16S rDNA Sequencing Analysis Following total genomic DNA extraction and quality assessment, the V3-V4 region of the 16S rDNA gene was amplified with the 338F and 806R primer pair and sequenced using the Illumina MiSeq platform. Sequences were clustered into operational taxonomic units (OTUs) via the UPARSE algorithm (v7.0.1001). Beta diversity analysis and linear discriminant analysis (LDA) were conducted using QIIME software (version 1.9.1) and LEfSe method, respectively. Relative abundance and statistical comparisons of microbiota at the phylum, family, and genus levels, along with correlation analysis and heatmap visualization, were performed using R software (version 4.4.2). 2.17. Statistical Analysis All data were tested for normal distribution using the Shapiro–Wilk test before performing one-way ANOVA. Statistical analyses were performed using one-way ANOVA in IBM SPSS Statistics version 26.0, followed by Tukey’s post hoc test for multiple comparisons. A p 3. Results 3.1. MPE Ameliorated DQ-Induced Hepatic Oxidative Injury As shown in Figure 1 p Figure 1 p p Figure 1 3.2. MPE Alleviated DQ-Induced Hepatic Fibrosis and Lipid Deposition Figure 2 p Figure 2 TGF-β2 ACTA-2 PDGFRA HNF4B p Figure 2 3.3. MPE Enhanced Antioxidant Capacity in DQ-Induced Oxidative Stress As shown in Figure 3 p p 3.4. MPE Attenuated DQ-Induced Hepatic Oxidative Stress by Activating the NRF2/HO-1 Pathway To explore the molecular mechanisms behind the hepatoprotective effects of α-mangostin, we assessed the activation of the NRF2/HO-1 signaling pathway in DQ-induced hepatic oxidative stress. As shown in Figure 4 p p p IL-6 TNF-α IL-10 NF-κB IL-10 p Figure 4 Figure 4 NRF2 HO-1 NQO1 KEAP1 NRF2 p CAT SOD1 SOD2 GST Figure 4 p Figure 4 p 3.5. MPE Ameliorated DQ-Induced Intestinal Barrier Dysfunction and Mucosal Oxidative Injury As shown in Figure 5 p Figure 5 Figure 5 p Figure 5 MUC-2 ZO-1 p Figure 5 p Figure 5 3.6. MPE Attenuated DQ-Induced Gut Microbiota Disorder The α-diversity analysis showed that DQ exposure significantly reduced microbial richness and diversity, as indicated by lower ACE, Chao, and Shannon indices compared to the control group. MPE treatment restored these metrics, with the MQ group showing significant increases in ACE ( p p p p Figure 6 Figure 6 p Figure 6 UCG-010 Pseudoflavoniftactor Anaerotruncus norank_f__Prevotellaceae CHKC1001 Oscillospira Lachnoclostridium Figure 7 UCG-010 Lactobacillus Ruminococcus Subdoligranulum p Figure 7 Figure 7 3.7. Correlation Analysis Spearman correlation analysis was performed, and the heatmaps are displayed. As shown in Figure 8 Figure 8 NRF-2 HO-1 NQO-1 CAT, SOD-1 ZO-1 MUC-2 Occludin-1 IL-10 KEAP-1 IL-6 TNF-α NF-κB Lactobacillus norank_f__Prevotellaceae norank_o__RF39 Shuttleworthia norank_f__Eubacterium_coprostanoligenes_group norank_o__Clostridia_UCG-014, UCG-008 norank_f__Muribaculaceae Prevotellaceae_UCG-001 p Lactobacillus norank_f__Prevotellaceae norank_o__Clostridia_UCG-014 UCG-008, Shuttleworthia norank_f__Muribaculaceae Prevotellaceae_UCG-001 p 3.8. FMT Further Verified MPE Attenuated Oxidative Stress Mediated by Gut Microbiota To explore the therapeutic effects of gut microbiota modulation on oxidative stress, an FMT experiment was performed. In this study, microbiota from MPE-treated hens were transplanted into recipient hens that had been subjected to DQ-induced oxidative stress ( Figure 9 Figure 9 p Figure 9 Figure 9 p Figure 9 p Figure 9 4. Discussion Oxidative stress has become a key limiting factor in modern poultry production, with significant implications for the poultry industry. Diquat (DQ), a widely used bipyridyl herbicide, effectively controls weeds but poses considerable environmental and biological risks due to its persistence and toxicity [ 32 33 34 35 21 36 37 Liver injury induced by DQ is primarily mediated through the excessive production of ROS, which induces oxidative stress, impairs antioxidant defenses, and ultimately leads to hepatocellular dysfunction [ 32 38 39 40 Liver fibrosis is a common pathological outcome of prolonged oxidative stress and chronic inflammation [ 41 42 43 44 45 46 47 48 49 TGF-β2 ACTA-2 PDGFRA 50 51 This study demonstrated that DQ exposure induced severe oxidative stress in laying hens, as evidenced by reduced hepatic and systemic antioxidant enzyme activities (T-AOC, SOD, CAT, and GSH-Px) and increased MDA levels, similar to findings by Zhou et al. [ 52 21 53 54 55 56 The NRF2/HO-1 signaling pathway is a critical regulator of the body’s antioxidant response, particularly in the liver, where it helps maintain redox balance and protect against oxidative damage [ 57 58 59 60 61 23 62 63 64 65 The intestinal barrier is essential for protecting the body from harmful substances and maintaining gut homeostasis [ 66 67 68 69 70 Disruption of gut microbial homeostasis is increasingly recognized as a key contributor to oxidative stress and liver injury via the gut–liver axis [ 71 72 Lactobacillus Ruminococcus Subdoligranulum 73 74 Bacteroidales UCG-010 Pseudoflavonifractor Anaerotruncus 75 76 77 Lactobacillus Subdoligranulum Ruminococcus Aeriscardovia Lactobacillus Clostridia_UCG-014 Shuttleworthia ZO-1 Occludin-1 78 To further verify the causal role of gut microbiota in mediating the protective effects of MPE, we performed an FMT experiment. Transplantation of microbiota from MPE-treated donors into DQ-exposed recipients significantly alleviated hepatic injury, as evidenced by improved liver morphology, reduced lipid accumulation and fibrosis, and restoration of antioxidant enzyme activities. Simultaneously, pro-inflammatory markers like LPS, TNF-α, and IL-6 were significantly reduced, and hepatic oxidative stress was alleviated. These results support the idea that gut microbiota modulation is a key mechanism through which MPE exerts its hepatoprotective effects. Several phytochemicals and natural feed additives, such as curcumin, resveratrol, and green tea polyphenols, have been extensively studied for their ability to alleviate oxidative stress in poultry. These compounds typically exert their effects through the activation of the NRF2 pathway, suppression of inflammation, and improvement of gut health [ 63 64 65 5. Conclusions This study demonstrated that MPE can be an outstanding supplement for the prevention and mitigation of hepatic oxidative damage in laying hens. Mechanistically, MPE reactivated the NRF2/HO-1 antioxidant pathway and restored intestinal barrier integrity by upregulating tight junction protein expression (Occludin-1 and ZO-1) and enhancing MUC-2 expression, thereby decreasing LPS transferring from the intestine to serum. MPE also modulated gut microbiota by enriching beneficial bacteria such as Lactobacillus Ruminococcus Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/antiox14091045/s1 Author Contributions Data curation, W.H.; Formal analysis, W.H. and Y.L.; Funding acquisition, D.Y. and B.L.; Investigation, W.H., Y.L., C.Z., C.G., S.Z., X.S., L.W., X.W., H.Y., G.L. and B.L.; Methodology, W.H. and B.L.; Project administration, D.Y.; Software, W.H.; Supervision, D.Y. and B.L.; Writing—original draft, W.H.; Writing—review and editing, B.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement All experimental procedures followed institutional guidelines and were approved by the Animal Care and Use Committee of Zhejiang University (Hangzhou, China; Approval No. ZJU20241152, approved on 26 December 2024). Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Material Conflicts of Interest The authors declare no conflicts of interest. References 1. Estevez M. Oxidative damage to poultry: From farm to fork Poult. Sci. 2015 94 1368 1378 10.3382/ps/pev094 25825786 2. Guo H. Wan H. Lou W. Khan R.U. You J. Huang B. Hao S. Li G. Dai S. Deoxynivalenol and T-2 toxin cause liver damage and egg quality degradation through endoplasmic reticulum stress in summer laying hens Int. J. Biometeorol. 2024 68 1387 1396 10.1007/s00484-024-02674-w 38607562 3. Surai P.F. Kochish I.I. Fisinin V.I. Glutathione peroxidases in poultry biology: Part 2. Modulation of enzymatic activities Worlds Poult. Sci. J. 2019 74 239 250 10.1017/S0043933918000260 4. Hu Z. Wu L. Lv Y. Ge C. Luo X. Zhan S. Huang W. Shen X. Yu D. Liu B. Integrated analysis of microbiome and transcriptome reveals the mechanisms underlying the chlorogenic acid-mediated attenuation of oxidative stress and systemic inflammatory responses via gut-liver axis in post-peaking laying hens J. Anim. Sci. Biotechnol. 2025 16 82 10.1186/s40104-025-01216-7 40474319 PMC12142991 5. Liu J. Zhao L. Zhao Z. Wu Y. Cao J. Cai H. Yang P. Wen Z. Rubber ( Hevea brasiliensis Poult. Sci. 2022 101 102040 10.1016/j.psj.2022.102040 35917674 PMC9352553 6. Abbas A.O. Alaqil A.A. El-Beltagi H.S. Abd El-Atty H.K. Kamel N.N. Modulating Laying Hens Productivity and Immune Performance in Response to Oxidative Stress Induced by E. coli Challenge Using Dietary Propolis Supplementation Antioxidants 2020 9 893 10.3390/antiox9090893 32967097 PMC7555396 7. Chen Z. Tian R. She Z. Cai J. Li H. Role of oxidative stress in the pathogenesis of nonalcoholic fatty liver disease Free Radic. Biol. Med. 2020 152 116 141 10.1016/j.freeradbiomed.2020.02.025 32156524 8. Duan Y. Fu W. Wang S. Ni Y. Zhao R. Cholesterol deregulation induced by chronic corticosterone (CORT) stress in pectoralis major of broiler chickens Comp. Biochem. Physiol. A Mol. Integr. Physiol. 2014 176 59 64 10.1016/j.cbpa.2014.07.010 25038300 9. Wang C. Liu X. Sun X. Li Y. Yang X. Liu Y. Dietary betaine supplementation improved egg quality and gut microbes of laying hens under dexamethasone-induced oxidative stress Poult. Sci. 2024 103 104178 10.1016/j.psj.2024.104178 39154612 PMC11381779 10. Do H.T.T. Cho J. Mangosteen Pericarp and Its Bioactive Xanthones: Potential Therapeutic Value in Alzheimer’s Disease, Parkinson’s Disease, and Depression with Pharmacokinetic and Safety Profiles Int. J. Mol. Sci. 2020 21 6211 10.3390/ijms21176211 32867357 PMC7504283 11. Arbi D. Wahyu W. Sutiman Bambang S. Bambang P. Marisca Evalina G. Microstructural Characterization of the Garcinia mangostana J. Nat. Remedies 2018 18 63 70 10.18311/jnr/2018/20936 12. Pedraza-Chaverri J. Cardenas-Rodriguez N. Orozco-Ibarra M. Perez-Rojas J.M. Medicinal properties of mangosteen ( Garcinia mangostana Food Chem. Toxicol. 2008 46 3227 3239 10.1016/j.fct.2008.07.024 18725264 13. Rohman A. Rafi M. Alam G. Muchtaridi M. Windarsih A. Chemical composition and antioxidant studies of underutilized part of mangosteen ( Garcinia mangostana J. Appl. Pharm. Sci. 2019 9 47 52 10.7324/japs.2019.90807 14. Zadernowski R. Czaplicki S. Naczk M. Phenolic acid profiles of mangosteen fruits ( Garcinia mangostana Food Chem. 2009 112 685 689 10.1016/j.foodchem.2008.06.030 15. Aizat W.M. Ahmad-Hashim F.H. Syed Jaafar S.N. Valorization of mangosteen, “The Queen of Fruits,” and new advances in postharvest and in food and engineering applications: A review J. Adv. Res. 2019 20 61 70 10.1016/j.jare.2019.05.005 31210985 PMC6562293 16. Manasathien J. Khanema P. Antioxidant and cytotoxic activities of mangosteen garcinia mangostana pericarp extracts Asia-Pac. J. Sci. Technol. 2015 20 381 392 17. Ovalle-Magallanes B. Eugenio-Perez D. Pedraza-Chaverri J. Medicinal properties of mangosteen ( Garcinia mangostana Food Chem. Toxicol. 2017 109 102 122 10.1016/j.fct.2017.08.021 28842267 18. Chavan T. Muth A. The diverse bioactivity of alpha-mangostin and its therapeutic implications Future Med. Chem. 2021 13 1679 1694 10.4155/fmc-2021-0146 34410182 19. Wang F. Ma H. Liu Z. Huang W. Xu X. Zhang X. α-Mangostin inhibits DMBA/TPA-induced skin cancer through inhibiting inflammation and promoting autophagy and apoptosis by regulating PI3K/Akt/mTOR signaling pathway in mice Biomed. Pharmacother. 2017 92 672 680 10.1016/j.biopha.2017.05.129 28582759 20. Obolskiy D. Pischel I. Siriwatanametanon N. Heinrich M. Garcinia mangostana Phytother. Res. 2009 23 1047 1065 10.1002/ptr.2730 19172667 21. Zhan S. Wu L. Lv Y. Huang W. Ge C. Hu Z. Shen X. Lin G. Yu D. Liu B. Lactobacillus reuteri alleviates diquat induced hepatic impairment and mitochondrial dysfunction via activation of the Nrf2 antioxidant system and suppression of NF-kappaB inflammatory response Poult. Sci. 2025 104 104997 10.1016/j.psj.2025.104997 40073635 PMC11951011 22. Chen L. Zu M. Cao Y. Wang Y. Jiang A. Bao S. Yang Q. Liu G. Ge L. Xiao B. Oral Plant-Derived Nanomedicines Mitigate Acetaminophen-Induced Liver Injury by Modulating the Gut-Liver Axis and Intestinal Microbiota Metabolism Small 2025 21 e2502001 10.1002/smll.202502001 40511710 23. Luo J. Wu X. Chen D. Yu B. He J. Dietary ferulic acid supplementation enhances antioxidant capacity and alleviates hepatocyte pyroptosis in diquat challenged piglets J. Anim. Sci. Biotechnol. 2024 15 134 10.1186/s40104-024-01086-5 39370514 PMC11457559 24. Zha P. Wei L. Liu W. Chen Y. Zhou Y. Effects of dietary supplementation with chlorogenic acid on growth performance, antioxidant capacity, and hepatic inflammation in broiler chickens subjected to diquat-induced oxidative stress Poult. Sci. 2023 102 102479 10.1016/j.psj.2023.102479 36669355 PMC9871335 25. Li S. Wang Y. Xu A. Zhao B. Xia Y. He Y. Xue H. Li S. Dietary selenomethionine reduced oxidative stress by resisting METTL3-mediated m6A methylation level of Nrf2 to ameliorate LPS-induced liver necroptosis in laying hens J. Nutr. Biochem. 2024 125 109563 10.1016/j.jnutbio.2023.109563 38176622 26. Ma Y. Shi Y. Wu Q. Ma W. Dietary arsenic supplementation induces oxidative stress by suppressing nuclear factor erythroid 2-related factor 2 in the livers and kidneys of laying hens Poult. Sci. 2021 100 982 992 10.1016/j.psj.2020.11.061 33518152 PMC7858178 27. Lv Y. Ge C. Wu L. Hu Z. Luo X. Huang W. Zhan S. Shen X. Yu D. Liu B. Hepatoprotective effects of magnolol in fatty liver hemorrhagic syndrome hens through shaping gut microbiota and tryptophan metabolic profile J. Anim. Sci. Biotechnol. 2024 15 120 10.1186/s40104-024-01074-9 39238062 PMC11378483 28. Wu L. Hu Z. Lv Y. Ge C. Luo X. Zhan S. Huang W. Shen X. Yu D. Liu B. Hericium erinaceus polysaccharides ameliorate nonalcoholic fatty liver disease via gut microbiota and tryptophan metabolism regulation in an aged laying hen model Int. J. Biol. Macromol. 2024 273 132735 10.1016/j.ijbiomac.2024.132735 38825293 29. Ge C. Luo X. Lv Y. Wu L. Hu Z. Huang W. Zhan S. Shen X. Hui C. Yu D. Essential oils ameliorate the intestinal damages induced by nonylphenol exposure by modulating tryptophan metabolism and activating aryl hydrocarbon receptor via gut microbiota regulation Chemosphere 2024 362 142571 10.1016/j.chemosphere.2024.142571 38876325 30. Liu B. Xiong Y.L. Jiang J. Yu D. Lin G. Cellular antioxidant mechanism of selenium-enriched yeast diets in the protection of meat quality of heat-stressed hens Food Biosci. 2021 39 100798 10.1016/j.fbio.2020.100798 31. Liu B. Zhu J. Zhou Q. Yu D. Tolerance and safety evaluation of sodium sulfate: A subchronic study in laying hens Anim. Nutr. 2021 7 576 586 10.1016/j.aninu.2020.08.009 34258447 PMC8245793 32. Acar A. In vivo toxicological assessment of diquat dibromide: Cytotoxic, genotoxic, and biochemical approach Environ. Sci. Pollut. Res. Int. 2021 28 47550 47561 10.1007/s11356-021-13936-0 33893917 33. Cao S. Wu H. Wang C. Zhang Q. Jiao L. Lin F. Hu C.H. Diquat-induced oxidative stress increases intestinal permeability, impairs mitochondrial function, and triggers mitophagy in piglets J. Anim. Sci. 2018 96 1795 1805 10.1093/jas/sky104 29562342 PMC6140957 34. Lu S. Xu S. Chen L. Deng Y. Feng J. Periplaneta americana Extract Pretreatment Alleviates Oxidative Stress and Inflammation and Increases the Abundance of Gut Akkermansia muciniphila Antioxidants 2022 11 1806 10.3390/antiox11091806 36139880 PMC9495987 35. Wu Y. Cui S. Wang W. Jian T. Kan B. Jian X. Kidney and lung injury in rats following acute diquat exposure Exp. Ther. Med. 2022 23 275 10.3892/etm.2022.11201 35251341 PMC8892614 36. Mao X. Lv M. Yu B. He J. Zheng P. Yu J. Wang Q. Chen D. The effect of dietary tryptophan levels on oxidative stress of liver induced by diquat in weaned piglets J. Anim. Sci. Biotechnol. 2014 5 49 10.1186/2049-1891-5-49 25810902 PMC4373006 37. Gou F. Lin Q. Tu X. Zhu J. Li X. Chen S. Hu C. Hesperidin Alleviated Intestinal Barrier Injury, Mitochondrial Dysfunction, and Disorder of Endoplasmic Reticulum Mitochondria Contact Sites under Oxidative Stress J. Agric. Food Chem. 2024 72 16276 16286 10.1021/acs.jafc.4c02265 38981046 38. Khosravi S. Alavian S.M. Daryani N.E. Zare A. Fereshtehnejad S.M. Taba S. Vakili T. Daryani N.E. Abdollahzade S. 1325 Non-Alcoholic Fatty Liver Disease and Correlation of Serum Alanin Aminotransferase (Alt) Level with Histopathologic Findings J. Hepatol. 2012 56 S521 10.1016/S0168-8278(12)61336-1 PMC3212791 22087177 39. Arsenault B.J. Rana J.S. Stroes E.S. Despres J.P. Shah P.K. Kastelein J.J. Wareham N.J. Boekholdt S.M. Khaw K.T. Beyond low-density lipoprotein cholesterol: Respective contributions of non-high-density lipoprotein cholesterol levels, triglycerides, and the total cholesterol/high-density lipoprotein cholesterol ratio to coronary heart disease risk in apparently healthy men and women J. Am. Coll. Cardiol. 2009 55 35 41 10.1016/j.jacc.2009.07.057 20117361 40. Li S. Hou L. Zhu S. Yi Q. Liu W. Zhao Y. Wu F. Li X. Pan A. Song P. Lipid Variability and Risk of Cardiovascular Diseases and All-Cause Mortality: A Systematic Review and Meta-Analysis of Cohort Studies Nutrients 2022 14 2450 10.3390/nu14122450 35745179 PMC9231112 41. Blas-Garcia A. Apostolova N. Novel Therapeutic Approaches to Liver Fibrosis Based on Targeting Oxidative Stress Antioxidants 2023 12 1567 10.3390/antiox12081567 37627562 PMC10451738 42. Rodriguez M.J. Sabaj M. Tolosa G. Herrera Vielma F. Zuniga M.J. Gonzalez D.R. Zuniga-Hernandez J. Maresin-1 Prevents Liver Fibrosis by Targeting Nrf2 and NF-kappaB, Reducing Oxidative Stress and Inflammation Cells 2021 10 3406 10.3390/cells10123406 34943914 PMC8699629 43. Dhar D. Baglieri J. Kisseleva T. Brenner D.A. Mechanisms of liver fibrosis and its role in liver cancer Exp. Biol. Med. 2020 245 96 108 10.1177/1535370219898141 31924111 PMC7016420 44. Chida T. Ito M. Nakashima K. Kanegae Y. Aoshima T. Takabayashi S. Kawata K. Nakagawa Y. Yamamoto M. Shimano H. Critical role of CREBH-mediated induction of transforming growth factor beta2 by hepatitis C virus infection in fibrogenic responses in hepatic stellate cells Hepatology 2017 66 1430 1443 10.1002/hep.29319 28621467 45. Ding X. Zhu X.L. Xu D.H. Li S. Yang Q. Feng X. Wei Y.G. Li H. Yang L. Zhang Y.J. NPM promotes hepatotoxin-induced fibrosis by inhibiting ROS-induced apoptosis of hepatic stellate cells and upregulating lncMIAT-induced TGF-beta2 Cell Death Dis. 2023 14 575 10.1038/s41419-023-06043-0 37648688 PMC10469196 46. Ding Z. Cheng R. Liu J. Zhao Y. Ge W. Yang Y. Xu X. Wang S. Zhang J. The suppression of pancreatic lipase-related protein 2 ameliorates experimental hepatic fibrosis in mice Biochim. Biophys. Acta 2022 1867 159102 10.1016/j.bbalip.2021.159102 34995790 47. Wei Q. Kong N. Liu X. Tian R. Jiao M. Li Y. Guan H. Wang K. Yang P. Pirfenidone attenuates synovial fibrosis and postpones the progression of osteoarthritis by anti-fibrotic and anti-inflammatory properties in vivo and in vitro J. Transl. Med. 2021 19 157 10.1186/s12967-021-02823-4 33874948 PMC8054406 48. Kisseleva T. Brenner D. Molecular and cellular mechanisms of liver fibrosis and its regression Nat. Rev. Gastroenterol. Hepatol. 2021 18 151 166 10.1038/s41575-020-00372-7 33128017 49. Kolios G. Valatas V. Kouroumalis E. Role of Kupffer cells in the pathogenesis of liver disease World J. Gastroenterol. 2006 12 7413 7420 10.3748/wjg.v12.i46.7413 17167827 PMC4087584 50. Lee Y.H. Hsieh P.L. Chao S.C. Liao Y.W. Liu C.M. Yu C.C. alpha-Mangostin Inhibits the Activation of Myofibroblasts via Downregulation of Linc-ROR-Mediated TGFB1/Smad Signaling Nutrients 2023 15 1321 10.3390/nu15061321 36986051 PMC10051815 51. Xu Y. Wu J. Gao L. Lin H. Yang Z. Liu X. Niu Y. alpha-Mangostin reduces hypertension in spontaneously hypertensive rats and inhibits EMT and fibrosis in Ang II-induced HK-2 cells Int. J. Med. Sci. 2024 21 1681 1688 10.7150/ijms.94236 39006850 PMC11241103 52. Zhou Q. Ali S. Shi X. Cao G. Feng J. Yang C. Zhang R. Protective impacts of bamboo leaf flavonoids in stressed broilers induced by diquat: Insight of antioxidant, immune response and intestinal barrier function Anim. Nutr. 2025 20 158 170 10.1016/j.aninu.2024.11.001 39967701 PMC11834062 53. Damiano S. Sozio C. La Rosa G. Guida B. Faraonio R. Santillo M. Mondola P. Metabolism Regulation and Redox State: Insight into the Role of Superoxide Dismutase 1 Int. J. Mol. Sci. 2020 21 6606 10.3390/ijms21186606 32927603 PMC7554782 54. Surai P.F. Kochish I.I. Fisinin V.I. Kidd M.T. Antioxidant Defence Systems and Oxidative Stress in Poultry Biology: An Update Antioxidants 2019 8 235 10.3390/antiox8070235 31336672 PMC6680731 55. Silvestrini A. Mancini A. The Double-Edged Sword of Total Antioxidant Capacity: Clinical Significance and Personal Experience Antioxidants 2024 13 933 10.3390/antiox13080933 39199179 PMC11351343 56. Mooli R.G.R. Mukhi D. Ramakrishnan S.K. Oxidative Stress and Redox Signaling in the Pathophysiology of Liver Diseases Compr. Physiol. 2022 12 3167 3192 10.1002/j.2040-4603.2022.tb00210.x 35578969 PMC10074426 57. Simos Y.V. Zerikiotis S. Lekkas P. Zachariou C. Halabalaki M. Ververidis F. Trantas E.A. Tsamis K. Peschos D. Angelidis C. Hydroxytyrosol produced by engineered Escherichia coli strains activates Nrf2/HO-1 pathway: An in vitro and in vivo study Exp. Biol. Med. 2023 248 1598 1612 10.1177/15353702231187647 PMC10676126 37691393 58. Xu L. Sang R. Yu Y. Li J. Ge B. Zhang X. The polysaccharide from Inonotus obliquus protects mice from Toxoplasma gondii-induced liver injury Int. J. Biol. Macromol. 2019 125 1 8 10.1016/j.ijbiomac.2018.11.114 30445083 59. Kopacz A. Kloska D. Forman H.J. Jozkowicz A. Grochot-Przeczek A. Beyond repression of Nrf2: An update on Keap1 Free Radic. Biol. Med. 2020 157 63 74 10.1016/j.freeradbiomed.2020.03.023 32234331 PMC7732858 60. Silva-Islas C.A. Maldonado P.D. Canonical and non-canonical mechanisms of Nrf2 activation Pharmacol. Res. 2018 134 92 99 10.1016/j.phrs.2018.06.013 29913224 61. Öllinger R. Wang H. Yamashita K. Wegiel B. Thomas M. Margreiter R. Bach F.H. Therapeutic applications of bilirubin and biliverdin in transplantation Antioxid. Redox Signal. 2007 9 2175 2186 10.1089/ars.2007.1807 17919067 62. Wang M. Huang H. Liu S. Zhuang Y. Yang H. Li Y. Chen S. Wang L. Yin L. Yao Y. Tannic acid modulates intestinal barrier functions associated with intestinal morphology, antioxidative activity, and intestinal tight junction in a diquat-induced mouse model RSC Adv. 2019 9 31988 31998 10.1039/C9RA04943F 35530805 PMC9072718 63. Liu H. He Y. Gao X. Li T. Qiao B. Tang L. Lan J. Su Q. Ruan Z. Tang Z. Curcumin alleviates AFB1-induced nephrotoxicity in ducks: Regulating mitochondrial oxidative stress, ferritinophagy, and ferroptosis Mycotoxin Res. 2023 39 437 451 10.1007/s12550-023-00504-3 37782431 64. Ding K.N. Lu M.H. Guo Y.N. Liang S.S. Mou R.W. He Y.M. Tang L.P. Resveratrol relieves chronic heat stress-induced liver oxidative damage in broilers by activating the Nrf2-Keap1 signaling pathway Ecotoxicol. Environ. Saf. 2022 249 114411 10.1016/j.ecoenv.2022.114411 36525949 65. Khan I.M. Gul H. Khan S. Nassar N. Khalid A. Swelum A.A. Wang Z. Green tea polyphenol epigallocatechin-3-gallate mediates an antioxidant response via Nrf2 pathway in heat-stressed poultry: A review Poult. Sci. 2025 104 105071 10.1016/j.psj.2025.105071 40157268 PMC11995091 66. Cao S. Shen Z. Wang C. Zhang Q. Hong Q. He Y. Hu C. Resveratrol improves intestinal barrier function, alleviates mitochondrial dysfunction and induces mitophagy in diquat challenged piglets(1) Food Funct. 2019 10 344 354 10.1039/C8FO02091D 30601541 67. Wang C. Cao S. Zhang Q. Shen Z. Feng J. Hong Q. Lu J. Xie F. Peng Y. Hu C. Dietary Tributyrin Attenuates Intestinal Inflammation, Enhances Mitochondrial Function, and Induces Mitophagy in Piglets Challenged with Diquat J. Agric. Food Chem. 2019 67 1409 1417 10.1021/acs.jafc.8b06208 30599507 68. Pan H. Ding B. Jiang Z. Wang J. Li D. Yu F. Wang L. Hu S. Zhao Y. Xu H. Hydrogel Derived from Decellularized Porcine Small Intestinal Submucosa as a Physical Shielding Repaired the Gut Epithelial Barrier of Murine Ulcerative Colitis Adv. Funct. Mater. 2024 34 2405601 10.1002/adfm.202405601 69. Yang R. Harada T. Li J. Uchiyama T. Han Y. Englert J.A. Fink M.P. Bile modulates intestinal epithelial barrier function via an extracellular signal related kinase 1/2 dependent mechanism Intensive Care Med. 2005 31 709 717 10.1007/s00134-005-2601-9 15782315 70. Nong K. Qin X. Liu Z. Wang Z. Wu Y. Zhang B. Chen W. Fang X. Liu Y. Wang X. Potential effects and mechanism of flavonoids extract of Callicarpa nudiflora Hook on DSS-induced colitis in mice Phytomedicine 2024 128 155523 10.1016/j.phymed.2024.155523 38489893 71. Ran X. Hu G. He F. Li K. Li F. Xu D. Liu J. Fu S. Phytic Acid Improves Hepatic Steatosis, Inflammation, and Oxidative Stress in High-Fat Diet (HFD)-Fed Mice by Modulating the Gut-Liver Axis J. Agric. Food Chem. 2022 70 11401 11411 10.1021/acs.jafc.2c04406 36040330 72. Tang Y. Zhan Y. Gao S. Li T. Xuan H. Hepatotoxicity of imidacloprid in zebrafish and the alleviating role of 10-hydroxy-2-decenoi acid: Insights into oxidative stress, inflammation, and gut microbiota J. Hazard. Mater. 2025 494 138695 10.1016/j.jhazmat.2025.138695 40412317 73. Jiang S. Zou X. Mao M. Zhang M. Tu W. Jin M. Low Ca diet leads to increased Ca retention by changing the gut flora and ileal pH value in laying hens Anim. Nutr. 2023 13 270 281 10.1016/j.aninu.2023.02.006 37168452 PMC10164782 74. Yu L. Han X. Cen S. Duan H. Feng S. Xue Y. Tian F. Zhao J. Zhang H. Zhai Q. Beneficial effect of GABA-rich fermented milk on insomnia involving regulation of gut microbiota Microbiol. Res. 2020 233 126409 10.1016/j.micres.2020.126409 31927503 75. Li X.Q. Chen Y. Dai G.C. Zhou B.B. Yan X.N. Tan R.X. Abietic acid ameliorates psoriasis-like inflammation and modulates gut microbiota in mice J. Ethnopharmacol. 2021 272 113934 10.1016/j.jep.2021.113934 33607198 76. Qin X. Liu Z. Nong K. Fang X. Chen W. Zhang B. Wu Y. Wang Z. Shi H. Wang X. Porcine-derived antimicrobial peptide PR39 alleviates DSS-induced colitis via the NF-kappaB/MAPK pathway Int. Immunopharmacol. 2024 127 111385 10.1016/j.intimp.2023.111385 38113690 77. Wang N. Pei Z. Wang H. Zhao J. Lu W. Bifidobacterium longum Ameliorates Intestinal Inflammation and Metabolic Biomarkers in Mice Fed a High-Fat Diet with Gliadin by Indoleacrylic Acid Probiotics Antimicrob. Proteins 2025 1 16 10.1007/s12602-025-10486-6 39982644 78. Qin Q. Li Z. Zhang M. Dai Y. Li S. Wu H. Zhang Z. Chen P. Effects of melittin on production performance, antioxidant function, immune function, heat shock protein, intestinal morphology, and cecal microbiota in heat-stressed quails Poult. Sci. 2023 102 102713 10.1016/j.psj.2023.102713 37540950 PMC10407909 Figure 1 Mangosteen pericarp extracts ameliorated DQ-induced hepatic injury. ( A B D n p p Figure 2 Mangosteen pericarp extracts alleviated DQ-induced hepatic fibrosis and lipid disorders. ( A B C D n p p Figure 3 Mangosteen pericarp extracts enhanced antioxidant capacity in DQ-induced laying hens. ( A B n p p Figure 4 Mangosteen pericarp extracts attenuated DQ-induced hepatic oxidative stress by activating the NRF2/HO-1 pathway. ( A B C D E F G n p p p p Figure 5 Mangosteen pericarp extracts ameliorated intestinal barrier dysfunction and mucosal injury under DQ-induced oxidative stress. ( A B C D E F H n p p Figure 6 Mangosteen pericarp extracts altered the composition of the cecal microbiota. ( A B C D n p Figure 7 The changes in the cecal microbiota composition. ( A B C D n p p p Figure 8 Correlation analysis between gut microbiota and oxidative stress and inflammatory parameters. ( A B p p p Figure 9 Fecal microbiota transplantation further highlights the role of gut microbiota modulation in mediating MPE’s systemic protective actions. ( A B C D E n p p p ",
  "metadata": {
    "Title of this paper": "Effects of melittin on production performance, antioxidant function, immune function, heat shock protein, intestinal morphology, and cecal microbiota in heat-stressed quails",
    "Journal it was published in:": "Antioxidants",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466791/"
  }
}