{
  "title": "Paper_291",
  "abstract": "pmc Front Microbiol Front Microbiol 1526 frontmicrobio Front. Microbiol. Frontiers in Microbiology 1664-302X Frontiers Media SA PMC12488674 PMC12488674.1 12488674 12488674 10.3389/fmicb.2025.1663835 1 Microbiology Review Faecalcrobiota metabolites: emerging insights into cancer radiotherapy outcomes Gao Yuzhuo  1  2  † Zeng Baozhao  2  † Wang Zhicheng  2  * Liang Shuo  2  * Yang Yanming  1  * 1 Department of Radiotherapy, The Second Hospital of Jilin University Changchun China 2 National Health Commission (NHC) Key laboratory of Radiobiology, School of Public Health, Jilin University Changchun China Edited by: Roshan Kumar Reviewed by: Zhengrui Li Rashmi Kumari *Correspondence: Zhicheng Wang, zhicheng@jlu.edu.cn Shuo Liang, liangshuo@jlu.edu.cn Yanming Yang, yym180@163.com † 18 9 2025 2025 16 480892 1663835 14 7 2025 02 9 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Gao, Zeng, Wang, Liang and Yang. 2025 Gao, Zeng, Wang, Liang and Yang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. The connection between gut microbiota and the onset, progression, and management of cancer is receiving increasing attention. Gut microbiota metabolites serve as crucial mediators that influence the cancer process by modulating immune responses and metabolic pathways. Research has shown that these metabolites significantly affect cancer development, prognosis and therapy. For example, the effectiveness and side effects of radiotherapy are closely linked to the metabolites produced by gut microbiota. Radiotherapy can disrupt the balance of gut microbiota, increase intestinal permeability, and trigger inflammatory responses, all of which may lead to adverse reactions such as damage to the intestinal mucosa and a compromised anti-cancer effect. This review emphasizes the role of gut microbiota metabolites in tumor formation and progression by affecting signaling pathways and the tumor immune microenvironment. It explores how these metabolites can influence the efficacy and side effects of radiotherapy and discusses innovative cancer treatment strategies that leverage gut microbiota metabolites. By integrating recent preclinical and clinical findings, the review proposes that incorporating colony modulation therapies into cancer treatment could enhance therapeutic strategies and provide patients with safer and more effective options. Graphical Abstract  Gut microbial metabolites play a multifunctional role in oncogenesis and cancer therapy by not only modulating key signaling pathways and reshaping the tumor immune microenvironment, which influences tumor initiation and progression, but also by altering radiotherapy efficacy and mitigating treatment-related adverse effects. Moreover, these metabolites provide a foundation for developing novel therapeutic strategies aimed at enhancing radiotherapeutic outcomes while reducing toxicity. Diagram illustrating the interactions between new therapeutic strategies, adverse effects of radiotherapy, radiotherapy efficacy, gut microbiota metabolites, and tumors. Arrows indicate influences and pathways, with a focus on signaling pathways and tumor immune microenvironment. gut microbiota metabolites cancer radiotherapy radiation injury The author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by the Science and Technology Development Plan of Jilin (20240101275JC and YDZJ202401200ZYTS). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Microorganisms in Vertebrate Digestive Systems Highlights Alterations in gut microbiota and its metabolites have been associated with the development of several cancers. Gut microbiota metabolites influence tumor development and radiotherapy by modulating various signaling pathways. Gut microbiota metabolites can be used as predictors of response to radiotherapy, targeted therapy and immunotherapy. Modulation of gut microbiota metabolites through novel strategies can improve the efficacy of radiotherapy and mitigate adverse effects. 1 Introduction Cancer is one of the leading causes of death worldwide. In recent years, numerous studies have shown evidence that gut microbiota is a key determinant of health or pathological conditions ( Zhang et al., 2015 Wroblewski et al., 2016 Peng et al., 2020 Zitvogel et al. (2017) Pleguezuelos-Manzano et al., 2020 Wilson et al., 2019 Chen et al., 2023 Yang et al., 2023 Chen et al., 2023 Radiotherapy is a conventional form of cancer treatment and is curative for 25% of cancers. However, radiation can cause tremendous damage to normal rapidly dividing cells, particularly the gastrointestinal epithelium, leading to acute enteropathy. Lu et al. (2024b) 131 Lu et al., 2024b Zhao et al., 2020 Liu et al., 2023 Guo et al., 2023 This article reviews the molecular mechanisms underlying the carcinogenic effects of gut microbiota metabolites, including regulatory signaling pathways and control of the tumor immune microenvironment. Based on this, it explores the significance of microbial metabolites in radiotherapy, including their impact on treatment efficacy and side effects. Additionally, it highlights emerging microbial intervention strategies and their clinical applications, with a focus on recent studies investigating how microbial metabolites can enhance the efficacy of radiotherapy while reducing its side effects. These findings may provide insights for developing personalized treatment strategies for cancer. 2 Gut microbiota-derived metabolites in cancer progression 2.1 Modulation-related signaling systems Signaling pathways serve as critical conduits for cellular communication, regulating essential processes including cell growth, differentiation, apoptosis, and metabolism through specific signaling molecules. While maintaining physiological homeostasis, their dysregulation frequently contributes to diseases such as tumorigenesis. Notably, gut microbial metabolites modulate these pathways to influence tumor cell invasion, metastasis, and proliferation ( Figure 1 Table 1 FIGURE 1 Gut microbiota metabolites influence tumor development by modulating signaling pathways. (A) (B) (C) (D) Gut microbiota metabolites influence tumor progression by regulating multiple signaling pathways. (A) MAPK pathway: Butyrate and DCA activate ERK, while SCFAs and KYNA inhibit ERK. (B) PI3K-Akt pathway: SCFAs promote Akt phosphorylation, whereas KYNA and Uro A suppress Akt and mTORC1 activity. (C) Wnt pathway: Butyrate and UroB degrade β-catenin via the autophagy-lysosomal and proteasomal pathways, respectively; UroB additionally inhibits its nuclear translocation. (D) TLR4 pathway: LPS activates the downstream JNK signaling pathway, while UroA antagonizes this pathway by jointly inhibiting MAPK, Akt/mTOR, and IKK phosphorylation. TABLE 1 Multifaceted regulation of oncogenic signaling pathways by gut microbiota-derived metabolites. Signaling pathway Gut microbiota-derived metabolite Cell/animal model Key targets/mechanisms Signaling pathway modulation Biological outcome Reference MAPK signaling pathway SCFAs Prostate-specific PTEN KO mice IGF1R→ERK phosphorylation↑ Activation Prostate tumor growth↑  Matsushita et al., 2021 MDA-MB-231 cells (breast cancer) FFAR3→ERK phosphorylation↓ Suppression Aggressiveness of breast cancer↓  Thirunavukkarasan et al., 2017 DCA HM3 colorectal cancer cells MEK1,ERK1/2↑ ERK MAPK activation MUC2 expression↑  Lee et al., 2010 p38↑ p38 MAPK activation MUC2 expression↑  Lee et al., 2010 JNK↑ JNK MAPK activation MUC2 expression↓  Lee et al., 2010 KYNA HT-29 cells ERK1/2 and p38 phosphorylation↓ Suppression Tumor cell proliferation↓  Walczak et al., 2014 PI3K signaling pathway SCFAs Prostate-specific PTEN KO mice IGF1R→Akt phosphorylation→ Activation Prostate tumor growth↑  Matsushita et al., 2021 DCA HM3 colorectal cancer cells EGFR → PI3K → PIP 2 3 Activation MUC2 expression↑  Lee et al., 2010 KYNA HT-29 cells Akt phosphorylation↓ Suppression Tumor cell proliferation↓  Walczak et al., 2014 Urolithin A MiaPaCa2/BxPC3/PANC1/ K8484 PDAC cells Akt/p70S6K phosphorylation↓ Suppression Tumor cell proliferation↓and apoptosis↑  Totiger et al., 2019 Wnt signaling pathway DCA SW480/LoVo cells β-catenin Tyr-phosphorylation↑→ uPAR/cyclin D1↑ Activation Tumor cell proliferation↑ and invasion↑  Pai et al., 2004 Butyrate HCT116/SW620 cells degradation of β-catenin by autophagy lysosome pathway Suppression CRC growth↑  Garavaglia et al., 2022 KYNA HT-29 cells β-catenin expression↑ without nuclear translocation – –  Walczak et al., 2014 Urolithin B HepG2/Bel7402 cells (HCC) GSK-3 β kinase Activation→β-catenin phospho (Ser33/37/Thr41) →β-catenin degradation↑ Suppression HCC proliferation↓  Lv et al., 2019 TLR4 signaling pathway Urolithin A BMDs IKK activity↓ Suppression Anti-tumor and anti-inflammatory↑  Abdelazeem et al., 2021 Butyrate SW480/CT26 cells TLR4/CD14 expression↑→ERK/JNK/NF-κB p65 phosphorylation↑ Activation Anti-tumor↑  Xiao et al., 2018 2.1.1 MAPK signaling pathway Mitogen-activated protein kinase (MAPK) is a serine/threonine protein kinase expressed in all eukaryotic cells. The MAPK signaling pathway regulates gene expression and protein translation, thereby participating in pathological and physiological processes such as cell proliferation, differentiation, apoptosis, and aging. Accumulating evidence demonstrates that diverse gut microbiota metabolites regulate tumor phenotypes by targeting core components of the MAPK pathway (e.g., kinases and transcription factors). Their regulatory modes exhibit marked variations depending on metabolite type, tumor tissue origin, and pathway microenvironment ( Fang and Richardson, 2005 Guo Y.-J. et al., 2020 Stefani et al., 2021 Short-chain fatty acids, gut microbiota metabolites primarily generated by colonic bacterial fermentation of dietary fiber, exhibit tissue-specific regulation of the MAPK pathway. In prostate-specific phosphatase and tensin homolog (PTEN) knockout mice (a prostate cancer model), SCFAs activate MAPK signaling via IGF1R-mediated ERK phosphorylation, thereby modulating prostate cancer growth ( Matsushita et al., 2021 Thirunavukkarasan et al., 2017 Deoxycholic acid, a secondary bile acid, induces dose-dependent increases in p53 mRNA yet ultimately suppresses p53 protein via proteasomal degradation. In HCT116 cells, this DCA-mediated p53 inhibition partially depends on ERK signaling, revealing a novel mechanism for bile acids in colorectal carcinogenesis. Mucoprotein 2 (MUC2) is a secretory mucoprotein normally expressed by goblet cells (GC) in the intestine, which is abnormally expressed in CRC. Lee et al. (2010) Lee et al., 2010 In summary, current evidence indicates that gut microbiota metabolites primarily regulate the MAPK pathway via ERK modulation, with research predominantly focused on SCFAs and DCA. Notably, KYNA also suppresses proliferation across multiple cancer cell lines. For instance, KYNA inhibits HT-29 cell proliferation by reducing phosphorylation levels of ERK1/2 and p38 kinases ( Walczak et al., 2014 in vitro 2.1.2 PI3K signaling pathway Phosphatidylinositol 3-kinase (PI3K) is an important kinase in phosphatidylinositol (PI), exhibiting dual activity as both a PI kinase and a serine/threonine kinase. Akt is a type of protein kinase and an important downstream signaling molecule of PI3K. In tumors, abnormal activation of the PI3K/Akt signaling pathway (such as PIK3CA mutations or PTEN loss) is one of the most common molecular events, closely associated with malignant proliferation, drug resistance, and metastatic potential of tumor cells, making it a core target pathway in cancer research ( Chen et al., 2016 Alzahrani, 2019 He et al., 2021c Some gut microbiota metabolites regulate both the MAPK signaling pathway and the PI3K signaling pathway, such as the SCFAs, DCA, and KYNA mentioned earlier. Similar to the regulation of the MAPK signaling pathway, in Pten knockout prostate cancer models, SCFAs activate PI3K signaling via IGF1R, inducing an IGF-1 autocrine loop that synergistically promotes tumor growth ( Matsushita et al., 2021 2 3 Lee et al., 2010 Walczak et al., 2014 Beyond co-regulating MAPK and PI3K pathways in tumorigenesis, certain gut microbiota metabolites specifically target PI3K signaling. In pancreatic ductal adenocarcinoma (PDAC) models, Uro A downregulates the PI3K/AKT/mTOR pathway by inhibiting phosphorylation of Akt and p70S6K in human (MiaPaCa2, BxPC3, PANC1) and murine (K8484) PDAC cells, reducing proliferation while enhancing apoptosis. Moreover, Uro A suppresses tumor growth in xenografts and PKT mice while improving survival. Unlike KYNA, Uro A exhibits excellent drug tolerance without significant toxicity in preclinical studies. A Phase I trial confirmed its rapid absorption, high bioavailability, and tolerability, supporting its potential for dietary intervention in PDAC patients. Clinically, Uro A outperforms gemcitabine in improving overall survival. Nevertheless, Uro A-gemcitabine combination therapy failed to extend survival, potentially due to CREB-mediated chemoresistance pathway activation, necessitating optimized dosing or co-administration with pathway inhibitors for clinical translation ( Totiger et al., 2019 In summary, gut microbiota metabolites bidirectionally regulate tumorigenesis by targeting the PI3K/Akt pathway, constituting a complex network of pro- and anti-tumorigenic effects. However, the clinical translation of these findings is complicated by the concentration- and source-dependent functionalities of certain metabolites. Thus, future studies must strengthen mechanistic investigations in vivo 2.1.3 Wnt signaling pathway The Wnt signaling pathway is a relatively conserved signaling pathway in evolution that plays a key role in embryonic development, cell proliferation, differentiation, and orientation. The typical Wnt/β-catenin pathway drives tumorigenesis via nuclear-translocated β-catenin binding to β-catenin T-cell factor/lymphoid enhancer-binding factor (TCF/LEF) complexes, activating proto-oncogenes such as cyclin D1 and c-Myc ( Duchartre et al., 2016 Krishnamurthy and Kurzrock, 2018 Parsons et al., 2021 Gut microbiota metabolites primarily target dynamic changes in β-catenin within the Wnt/β-catenin pathway, including phosphorylation, degradation, and nuclear translocation. In CRC models, the key regulatory mechanisms are as follows: (1) Phosphorylation modulation: Low-dose DCA (5 and 50 μM) enhances β-catenin tyrosine phosphorylation in SW480/LoVo cells, inducing uPA, uPAR, and cyclin D1 expression to promote proliferation and invasion ( Pai et al., 2004 Garavaglia et al., 2022 Walczak et al., 2014 Given that the canonical Wnt/β-catenin pathway is activated in 80% of colorectal tumors, current research on gut microbiota metabolite-mediated regulation of this pathway primarily focuses on CRC. In fact, a wider range of metabolites and tumor-related signaling pathways await further investigation. For instance, in HepG2 and Bel7402 cells, Uro B activates GSK-3β kinase to promote β-catenin phosphorylation at Ser33, Ser37, and Thr41, triggering its degradation via the ubiquitin-proteasome pathway. Simultaneously, Uro B inhibits β-catenin nuclear translocation, impairing its association with TCF/LEF transcription factors. These mechanisms collectively suppress Wnt/β-catenin signaling and inhibit hepatocellular carcinoma cell proliferation ( Lv et al., 2019 2.1.4 TLR4 signaling pathway Toll-like receptor 4 (TLR4), a crucial pattern recognition receptor, specifically recognizes LPS from Gram-negative bacteria. TLR4 forms a complex with the coreceptors myeloid differentiation protein-2 (MD2) and CD14. In serum, LPS is transported by LPS-binding protein (LBP) to membrane-bound CD14. The resulting LPS-CD14 complex then binds to TLR4/MD2, inducing TLR4 dimerization and subsequent signal transduction. Through its intracellular TIR domain, TLR4 recruits the adaptor protein myeloid differentiation primary response 88 (MyD88), activating the canonical MyD88-dependent pathway. This leads to activation of the IKK complex and MAPK pathways (including JNK, p38 and ERK), ultimately inducing the release of proinflammatory cytokines (such as TNF-α, IL-1β, and IL-6/8). TLR4-driven inflammatory responses represent a central mechanistic link connecting diverse pathological processes including infection, tissue damage, and tumorigenesis ( Gruffaz et al., 2017 Xu et al., 2017 Zhang et al., 2023 Previous studies demonstrate that LPS upregulates vascular endothelial growth factor C (VEGF-C) expression in SW480 cells through the LPS-TLR4-NF-κB/JNK signaling pathway in time- and concentration-dependent manners, thereby promoting CRC migration, invasion, lymphangiogenesis, and lymph node metastasis ( Zhu et al., 2016 Abdelazeem et al., 2021 In addition to pathogen-associated molecular patterns such as LPS, metabolites derived from the gut microbiota have also been found to regulate the TLR4 signaling pathway, but their mechanisms of action and biological effects may be fundamentally different. In SW480 and CT26 CRC cells, butyrate activates TLR4 signaling to modulate innate immune responses. Mechanistically, butyrate upregulates TLR4 and CD14 expression, induces phosphorylation of ERK, JNK, and NF-κB p65, and stimulates TNF-α, but has no effect on IL-6 secretion ( Xiao et al., 2018 In summary, the TLR4 signaling pathway, when activated by ligands such as LPS and gut microbiota metabolites, can regulate tumor cell proliferation, apoptosis, invasion, and metastasis through downstream signaling pathways such as NF-κB and MAPK. Therefore, the TLR4 signaling pathway plays a crucial role in tumorigenesis and tumor progression. However, compared to other signaling pathways, there is currently a lack of research on how gut microbiota metabolites influence tumorigenesis and tumor progression by regulating the TLR4 signaling pathway, with studies primarily focusing on butyrate and Uro A metabolites in colorectal tumors. Collectively, gut microbiota metabolites target core signaling pathways (MAPK, PI3K/AKT, Wnt/β-catenin, TLR4) to regulate tumorigenesis through two fundamental characteristics. (1) Multipathway regulation: For example, SCFAs concurrently activate both MAPK and PI3K pathways in prostate cancer models; DCA bidirectionally modulates MAPK/PI3K/Wnt signaling in CRC; KYNA suppresses MAPK/PI3K activity while exerting complex regulation on β-catenin expression in HT-29 cells. (2) Tumor-type specificity: For example, SCFAs promote tumorigenesis in prostate cancer via the MAPK pathway but inhibit tumorigenesis in breast cancer. Notably, current evidence elucidates the significance of the gut microbiota metabolite-signaling axis in oncogenesis and reveals its therapeutic potential. Accumulating studies demonstrate that beyond modulating tumor progression, the activity of key signaling pathways critically influences radiotherapy response. For instance, PI3K/Akt pathway activation has been identified as a pivotal mediator of radioresistance in small cell lung cancer (SCLC; Jin et al., 2022 Gasimli et al., 2023 2.2 Control of the tumor immune microenvironment The tumor microenvironment (TME) is comprised of a variety of components, including multiple immune cell types, cancer-associated fibroblasts, tumor cells and cytokines. The significance of these components lies in their capacity to influence immune responses through complex interactions. Whether these interactions produce anti-tumor or pro-tumor effects, they play a key role in tumor immunity ( de Visser and Joyce, 2023 Figure 2 FIGURE 2 Gut microbiota metabolites influence tumor development by controlling immunity. (A) (B) 2A 2A (C) + + + (D) Gut microbial metabolites influence tumor progression by modulating immune responses. (A) LPS promotes immune evasion by inducing macrophage secretion of CCL5, stabilizing PD-L1, and suppressing T cell cytolytic function. (B) Butyrate and valerate enhance granzyme B expression through ID2-dependent IL-12 pathways and direct induction, thereby boosting CTL killing activity. (C) Lactobacillus-derived indole inhibits CD8+ T cell accumulation in tumors by activating AhR, promoting PDAC progression. (D) Inosine promotes pCREB phosphorylation via the A2AR -cAMP -PKA pathway, upregulating IL12Rβ2 and IFNγ to induce Th1 differentiation. (E) Inosine also inhibits UBA6 to enhance tumor sensitivity to T-cell cytotoxicity and improve antigen presentation capacity. 2.2.1 T cell 2.2.1.1 Cytotoxic T cells Cytotoxic T lymphocytes (CTLs) represent the principal effector population responsible for eliminating tumor cells expressing MHC class I molecules. Through T cell receptor (TCR) recognition of tumor antigen-MHC-I complexes and CD8 coreceptor engagement, CTLs release cytotoxic molecules including granzymes and perforin, directly inducing target cell apoptosis ( Oh and Fong, 2021 Park et al., 2023 Emerging evidence indicates that SCFAs modulate antitumor immunity through T-cell regulation. In terms of CTL cytotoxicity, butyrate exerts concentration-dependent effects on CD8 + in vitro + + He et al., 2021b + Luu et al., 2021 + In terms of CTL cell production, desaminotyrosine (DAT) enhances CTL responses by directly promoting activated CD8 + in vitro + in vivo + in vitro in vivo Joachim et al., 2023 + Jia et al., 2024 In fact, the regulatory mechanisms of more metabolites and other immune components remain to be explored. For instance, elevated metabolic demands of tumor cells deplete nutrients and generate immunosuppressive metabolites, compromising CD8 + Renner et al., 2019 + in vitro Wang et al., 2020 2.2.1.2 Helper T cells Helper T (Th) cells, a subset of CD4 + Accolla et al., 2014 Ryba-Stanisławowska, 2024 In the regulation of Th cell differentiation, inosine exerts bidirectional regulation on Th1 differentiation through the adenosine A2A receptor (A 2 A 2 A He et al., 2017 in vitro 2 A Kroemer and Zitvogel, 2020 2 A Mager et al., 2020 A. muciniphila 2 A 2 A In addition, SCFAs can promote the differentiation of T cells into effector T cells and regulatory T cells. The mechanism may be related to the inhibition of histone deacetylases (HDACs) in T cells and the regulation of the mTOR pathway. However, whether their immunomodulatory effects promote antitumor immunity depends on the immune environment ( Park et al., 2015 In summary, these microbial metabolites target signaling pathways such as A 2 A 2.2.2 Macrophages Macrophages are the first line of defense against foreign invaders, performing functions such as phagocytosis of pathogens, antigen presentation, immune regulation, and inhibition of tumor growth and metastasis. They play a central role in both anti-infective and anti-tumor immunity. TAMs are a distinct subpopulation of macrophages that infiltrate TME and exhibit unique phenotypic and transcriptional characteristics. Under the influence of immunosuppressive factors in the TME (such as PGE-2 and IL-10), TAMs lose their ability to present antigens and directly kill tumor cells, fail to effectively activate T/NK cells, and thereby promote tumor progression. Functionally, TAMs typically exhibit a pro-tumor M2-like phenotype characterized by anti-inflammatory and immunosuppressive properties, rather than the anti-tumor M1-like phenotype characterized by pro-inflammatory and immune-promoting properties ( Shapouri-Moghaddam et al., 2018 Mehta et al., 2021 The process by which macrophages differentiate into M1 and M2 types is referred to as polarization. In terms of macrophage polarization, studies have shown that antibiotic-induced depletion of SCFAs promotes the production of M1 macrophages, leading to excessive production of pro-inflammatory cytokines and resulting in persistent intestinal immune dysfunction ( Scott et al., 2018 min Clostridium butyricum C. butyricum Xie et al., 2025 Clostridium butyricum Clostridium butyricum In terms of macrophage production of pro-inflammatory factors, butyrate inhibits macrophage inflammatory responses by suppressing HDAC and reduces the production of pro-inflammatory mediators such as nitric oxide, IL-6, and IL-12 ( Chang et al., 2014 In terms of macrophage activity, in PDAC, the aryl hydrocarbon receptor (AhR) activity of TAMs is dependent on indole. Dietary intervention to reduce indole production significantly decreases the AhR signaling activity of TAMs. This not only enhances the efficacy of ICB but also promotes the accumulation of TNFα + + + Hezaveh et al., 2022 In summary, these findings suggest that various gut microbiota metabolites can influence tumor progression and the antitumor effects of other immune cells by regulating macrophage polarization and function. However, further research is needed to elucidate the regulatory network of the “microbial metabolites-macrophages-antitumor immunity” axis, providing direction for clinical applications such as dietary regulation, microbial intervention, or combined metabolite and immunotherapy to precisely regulate TAMs. 2.2.3 Dendritic cells Dendritic cells (DCs), as the most potent professional antigen-presenting cells, are widely distributed in the blood, lymphoid organs, and peripheral tissues. Within TME, infiltrating DCs are responsible for recognizing, capturing, and presenting tumor-associated antigens (TAAs) in both tumor and lymphoid tissues. This process promotes the differentiation of naive T lymphocytes into tumor antigen-specific T cells, upregulates co-stimulatory molecules, and initiates antitumor immune responses. While immature DCs exhibit heightened migratory capacity, only upon maturation do they acquire the ability to effectively activate naive T cells and orchestrate adaptive immunity ( Fu and Jiang, 2018 Marciscano and Anandasabapathy, 2021 Despite the central role of DCs in antitumor immunity, current understanding of how gut microbiota metabolites regulate DC function remains limited. For instance, DCA has been shown to impair the immunostimulatory function of DCs, promote Treg differentiation, and enhance Foxp3 expression ( Campbell et al., 2020 Furthermore, studies in the Apc Min + Lavoie et al., 2020 In summary, as DCs play a central role in capturing tumor antigens and presenting them to T cells, their functional status directly governs the induction and potency of antitumor immune responses. Future studies should focus on deciphering the molecular pathways through which gut microbiota metabolites regulate key DC functions—including migration, antigen presentation efficiency, and energy metabolism, which will advance the translational development of microbiota-based interventions in cancer immunotherapy. Collectively, gut microbiota metabolites form a complex immunoregulatory network by targeting multiple immune cell types within the tumor immune microenvironment. For instance, butyrate enhances CTL cytotoxicity via IL-12 signaling and epigenetic mechanisms, while also driving M2-like TAM polarization through the PI3K/Akt/NF-κB axis and suppressing pro-inflammatory mediator production via HDAC inhibition. Beyond supporting CTL function through “non-glycolytic” metabolic pathways, inosine facilitates Th1 differentiation via A 2 A He et al., 2021a Bird, 2020 The dynamic remodeling of the tumor immune microenvironment is a central determinant of radiotherapy efficacy, thereby expanding the potential applications of gut microbiota metabolites. Radiotherapy has been shown to modulate the TIME through a dual mechanism: it promotes CTL priming and enhances their antitumor functions, yet concurrently facilitates the acquisition of an effector phenotype in FOXP3 + + Frijlink et al., 2024 Raudenská et al., 2024 3 Relationship between gut microbiota metabolites and tumor radiotherapy As the association between gut microbiota metabolites and tumorigenesis and tumor progression is increasingly elucidated, their potential application in tumor radiotherapy has garnered significant attention. Radiotherapy, as a key modality in tumor treatment, is administered to approximately 70% of tumor patients, with a cure rate of 40% for malignant tumors, making it an effective local treatment approach. However, while radiotherapy effectively kills tumor cells, it also tends to damage normal tissues and is associated with various side effects, which limits its clinical application. Therefore, investigating the association between gut microbiota metabolites and radiation therapy holds significant clinical importance. Current research primarily focuses on two aspects: First, the impact of radiation therapy on gut microbiota metabolites; second, the regulation of radiation therapy efficacy and adverse reactions by gut microbiota metabolites ( Figure 3 FIGURE 3 The linkage between gut microbiota metabolites and radiotherapy. (A) (B) (C) (D) (E) Lycium barbarum Gut microbial metabolites significantly influence radiation therapy. (A) SCFAs (acetate, propionate, butyrate) enhance radiosensitivity in bladder cancer. (B) Butyrate inhibits radiation-induced immune responses via STING suppression. (C) Sterol supplements improve radiotherapy through microbiota modulation and apoptosis. (D) Multiple metabolites affect radiation injuries: inosine/uridine monophosphates, SCFAs, and inulin metabolites reduce intestinal damage; indole-3-acetaldehyde and 3-hydroxybutyrate alleviate enteritis and proctitis; lactate and acetate aid epithelial repair; propionate, I3A and KYNA suppress hematopoietic/GI injury, while I3A and isopropionate promote recovery. (E) Vitamin D, goji extract, lactate, urolithin A, probiotics, and fecal transplant mitigate radiation damage. 3.1 Radiotherapy affects the composition of the gut microbiota and its metabolites Radiotherapy can disrupt the colonization resistance of the gut microbiota, leading to dysbiosis, with specific characteristics varying significantly depending on the radiotherapy setting and disease type. Analysis of fecal samples from cervical cancer patients undergoing radiotherapy (especially those with radiation enteritis) revealed characteristic disruptions in the gut microbiota: reduced α diversity, increased β diversity, elevated abundance of the Proteobacteria phylum, and decreased abundance of the Bacteroides genus. This suggests that the microbial balance has been disrupted, with pro-inflammatory microbiota gaining dominance, and that radiotherapy-induced dysbiosis may contribute to the onset and progression of radiation enteritis ( Wang et al., 2019 Xu et al., 2023 The production of gut microbiota metabolites depends on the composition and function of the microbiota. Therefore, radiation therapy-induced disruption of the microbiota can further alter the metabolite profile. In patients with differentiated thyroid cancer (DTC), fecal microbiota structure significantly changed after 131 Ruminococcus Lu et al., 2024 Sánchez-Alcoholado et al., 2021 A. muciniphila Ge et al., 2024 Sakamoto et al., 2019 In summary, radiotherapy can induce dysbiosis of the gut microbiota and alterations in the metabolite profile. These findings reveal the central role of the radiotherapy-gut microbiota-metabolite axis in radiation damage and radiotherapy efficacy, and provide important evidence for elucidating the mechanisms of radiotherapy-related complications and developing therapeutic targets. 3.2 Positive effects of gut microbiota metabolites on radiotherapy efficacy Recent advances have elucidated the multifaceted mechanisms of radiotherapy: beyond directly inducing DNA damage to exert cytotoxic effects, it remodels the tumor immune microenvironment and triggers antitumor immunity ( Demaria et al., 2004 2016 Apetoh et al., 2007 Kepp et al., 2011 Table 2 TABLE 2 Dual effects of butyrate in radiotherapy efficacy. Research direction Cell/animal model Dose Molecular mechanism Reference Tumor radio-sensitization RT112 human bladder cancer cells 0–8 Gy Histone acetylation ↑  Then et al., 2020 Patient-derived CRC organoids 3 × 5 Gy Activating the FOXO3A pathway →Ki-67 +  Park et al., 2020 Anti-tumor immune suppression B16-OVA tumor-bearing mice (C57BL/6J mice) 21 Gy DCs antigen-presenting ability ↓, IFN-γ↓→tumor-specific CD8 +  Uribe-Herranz et al., 2019 MC38-OVA tumor-bearing mice (C57BL/6J mice) 20 Gy Inhibiting STING-TBK1-IRF3 phosphorylation → Type I IFN ↓→tumor-specific CD8 +  Yang et al., 2021 In local tumor control, one study in RT112 cells irradiated with 0–8 Gy demonstrated that acetate, propionate, and butyrate enhanced radiosensitivity through increased histone acetylation. In a mouse xenograft model of human bladder cancer, a high-fiber diet significantly improved tumor control after irradiation (6 Gy), which correlated with an elevated abundance of Bacteroides acidifaciens Then et al., 2020 B. acidifaciens In CRC research, the radiosensitizing potential of acetate, propionate, and butyrate was investigated using patient-derived 3D organoids subjected to 3 × 5 Gy irradiation. Butyrate alone enhanced radiotherapeutic efficacy, mechanistically attributed to FOXO3A-mediated reduction in Ki-67 + Park et al., 2020 In terms of radiotherapy-induced antitumor immunity, vancomycin has been demonstrated to enhance radiotherapy-induced antitumor immunity and suppress tumor growth, a synergistic effect dependent on cross-presentation of tumor antigens to CD8 + In vitro Uribe-Herranz et al., 2019 + Yang et al., 2021 In summary, butyrate exhibits a “double-edged sword” effect in radiotherapy: on the one hand, it enhances histone acetylation and activates the FOXO3A pathway to block S-phase cells, thereby increasing local tumor radiosensitivity; on the other hand, it impairs the antigen-presenting function of (DCs), weakening CD8 + 3.3 Negative effects of gut microbiota metabolites on radiotherapy adverse effects Radiotherapy plays an indispensable role as an important adjuvant treatment for malignant tumors in the abdominal cavity, retroperitoneum, and pelvis in clinical practice. However, its efficacy is often limited by complications such as radiation-induced intestinal injury, which exhibits dose-limiting toxicity that frequently leads to treatment interruption or dose reduction, thereby compromising tumor control and survival ( Lam et al., 2019 Sassa, 2020 Table 3 TABLE 3 Protective effects and mechanisms of gut microbiota metabolites in radiation therapy-induced damage. Radiotherapy injury type Gut microbiota metabolites Dose Cells/animal models Molecular mechanism Biological outcome Reference Radiation-induced intestinal fibrosis Dietary pectin (precursor of SCFAs)) 10 Gy single abdominal γ-ray irradiation pVillin-Cre-EGFP double-transgenic mice – Ileal submucosal thickness↓; EMT↓  Yang et al., 2017 Chronic radiation-induced intestinal fibrosis Inulin metabolites (containing SCFAs) 15 Gy abdominal irradiation C57BL/6J mice – Colonic fibrosis↓  Ji et al., 2024 10 Gy NIH/3T3 cells Fibrosis-related genes, collagen synthesis genes, extracellular matrix pathway gene expression↓ Colonic fibrosis↓  Ji et al., 2024 Radiation proctitis 3HB 25 Gy pelvic irradiation C57BL/6J mice Block GPR43→IL-6 signaling pathway↓ Intestinal epithelial injury↓  Ge et al., 2024 Radiation proctitis Propionate 8 Gy abdominal irradiation BALB/c mice Activate GPR43→Histone acetylatio↑→Expression of Occludin/ZO-1/mucin↑ Intestinal barrier function↑  He et al., 2023 Radiation-induced intestinal epithelial injury I3A 13 Gy total abdominal irradiation C57BL/6J mice Activate AhR/IL-10/Wnt signaling axis Intestinal epithelial proliferation↑  Xie et al., 2024a Hematopoietic system injury ARA 4 Gy total body irradiation C57BL/6J mice TNF-α/IL-6; Oxidative stress ↓→Protect HSC niche Thymus/spleen weight↑;  Lu et al., 2024a Hematopoietic system injury IPA 4 Gy total body irradiation C57BL/6J mice – Myelosuppression↓;  Xiao et al., 2020 Hematopoietic system injury I3A 5 Gy total body irradiation C57BL/6J mice Quiescent state of HSPC↑→Radiation resistance↑ Hematopoietic stem and progenitor cell regeneration↑;Peripheral blood recovery↑  Guan et al., 2024 Radiation-induced Lung Injury PGF2α 15 Gy total lung irradiation C57BL/6J mice – Pulmonary inflammation↓;  Chen Z.-Y. et al., 2021 PGF2α 6 Gy BEAS-2B/MLE-12 cells Activate FP/MAPK/NF-κB pathway Lung cell proliferation↑;  Chen Z.-Y. et al., 2021 Radiation-induced cardiopulmonary Injury L-histidine; ImP 15 Gy total thoracic irradiation C57BL/6J mice – Lung function↑;  Chen Z. et al., 2021 ImP 6 Gy BEAS-2B cells Inhibit NF-κB→GSDMD transcription↓→Pyroptosis↓ Lung cell proliferation↑  Chen Z. et al., 2021 3.3.1 Gastrointestinal adverse reactions Radiation-induced intestinal damage is a common complication of radiotherapy for abdominal and pelvic tumors, including intestinal fibrosis and radiation enteritis, which severely affect patients’ quality of life. In recent years, the regulatory role of the intestinal microbiota and its metabolites in this type of damage has become a hot topic of research. In radiation-induced intestinal fibrosis, EMT has been implicated as a key mechanism. In pVillin-Cre-EGFP double transgenic mice subjected to a single 10 Gy abdominal γ-irradiation, dietary pectin supplementation not only reversed radiation-induced ileal submucosal thickening but also reduced the number of cells co-expressing α-SMA/EGFP and vimentin/EGFP, indicating suppression of EMT. Although pectin significantly increased SCFA levels, whether SCFAs mediate EMT inhibition through HDAC suppression or GPCR signaling remains to be experimentally established ( Yang et al., 2017 In a murine model of chronic radiation enteropathy (15 Gy abdominal irradiation), transplantation of gut microbiota and metabolites from inulin-fed donors attenuated colonic fibrosis. In vitro Ji et al., 2024 In radiation-induced enteritis, reduced abundance of Akkermansia muciniphila A. muciniphila Ge et al., 2024 A. muciniphila He et al., 2023 In cervical cancer patients who developed enteritis after pelvic radiotherapy, levels of indole-3-acetaldehyde were significantly reduced. FMT from healthy donors mitigated intestinal epithelial damage in 9 Gy-irradiated C57BL/6J mice and restored indole-3-acetaldehyde levels, possibly through attenuation of radiation-triggered immune inflammation ( Tu et al., 2024 In promoting intestinal epithelial repair, oral administration of I3A in a C57BL/6J mouse model of radiation-induced enteropathy (13 Gy whole-abdomen irradiation) stimulated intestinal epithelial proliferation and improved survival through activation of the AhR/IL-10/Wnt signaling axis, suggesting its potential as a therapeutic target for radiation-induced intestinal injury ( Xie et al., 2024a In summary, gut microbiota metabolites confer multi-mechanistic protection against radiation-induced intestinal damage by suppressing EMT-driven fibrosis, inhibiting the GPR43/IL-6 inflammatory pathway, and activating the AhR/Wnt-mediated epithelial repair program. However, the precise molecular mechanisms, safety profiles, and efficacy of these metabolites must be thoroughly investigated to facilitate the clinical translation of precision radioprotective strategies. 3.3.2 Hematopoietic system injury Ionizing radiation is highly sensitive to the hematopoietic system, causing atrophy of hematopoietic organs such as the thymus and spleen, reduction of peripheral blood cells, and disruption of the hematopoietic stem cell (HSC) microenvironment. Its protection and repair have always been a research focus in the field of radiation medicine. In recent years, the role of gut microbiota metabolites in promoting hematopoietic recovery after radiation has gradually attracted attention. In terms of promoting the recovery of hematopoietic organs, administration of ARA to C57BL/6J mice following 4 Gy irradiation restored thymic and splenic mass and countered radiation-induced peripheral cytopenia ( Lu et al., 2024a Xiao et al., 2020 In terms of promoting the regeneration of hematopoietic stem and progenitor cells (HSPCs), I3A treatment in C57BL/6J mice mice (5 Gy irradiation) not only accelerates the recovery of peripheral blood cells but also promotes the regeneration of HSPCs. Mechanistically, I3A enhanced radioresistance by inducing HSPC quiescence and reduced apoptosis through suppression of reactive oxygen species (ROS) generation. These findings identify I3A as a potential therapeutic agent for ionizing radiation-induced bone marrow suppression ( Guan et al., 2024 Furthermore, ursodeoxycholic acid (UDCA) has been shown to inhibit the FXR receptor, thereby enhancing NF-κB-dependent hematopoietic recovery, offering a promising therapeutic strategy for radiation-associated hematopoietic recovery (RAHR; Jiao et al., 2025 In summary, gut microbiota metabolites contribute to the restoration of hematopoietic organs by mitigating inflammation and oxidative stress, modulating key signaling pathways, and facilitating HSPC regeneration, thus helping to maintain the hematopoietic stem cell niche. While these findings provide valuable insights into interventions for radiation-induced hematopoietic injury, further studies are essential to elucidate the detailed mechanisms and address pivotal challenges in clinical translation. 3.3.3 Radiation-induced cardiopulmonary injury Radiation-induced cardiopulmonary injury is the most common refractory complication of thoracic tumor radiotherapy. Despite continuous innovations in precision radiotherapy techniques, 30% of patients undergoing thoracic radiotherapy still develop radiation-induced lung injury (RILI), and there are currently no safe and effective preventive or therapeutic measures available. Recent studies have confirmed the important role of the gut-lung axis, with gut microbiota metabolites able to act on distant cardiopulmonary tissues via the bloodstream, providing an important perspective for the development of new therapies. In terms of radiation-induced lung injury, oral administration of PGF2α significantly alleviates pulmonary inflammatory infiltration and improves respiratory function in C57BL/6J mice subjected to 15 Gy whole-lung irradiation. Its mechanism of action was validated in BEAS-2B and MLE-12 cells (6 Gy irradiation) through activation of the FP/MAPK/NF-κB pathway, thereby promoting lung cell proliferation and inhibiting apoptosis. Additionally, silencing MAPK weakened the protective effect of PGF2α on irradiated lung cells. This suggests that PGF2α could serve as a potential radioprotective agent against radiation-induced lung injury ( Chen Z.-Y. et al., 2021 In terms of radiation-induced cardiovascular injury, oral supplementation with L-histidine improved pulmonary and cardiac function in C57BL/6J mice following 15 Gy whole-thorax irradiation. Its downstream metabolite, imidazole propionate (ImP), similarly attenuated radiation-induced cardiopulmonary toxicity. In BEAS-2B cells exposed to 6 Gy irradiation, ImP was shown to suppress NF-κB activation, inhibit GSDMD transcription, reduce pyroptosis, and promote epithelial proliferation. Notably, antibiotic-mediated microbiota ablation abolished systemic absorption of orally administered ImP, indicating that its radioprotective effects are strictly microbiota-dependent. Future studies should focus on identifying the bacterial taxa responsible for ImP synthesis and delineating the mechanisms by which Gram-positive bacteria facilitate its absorption ( Chen Z. et al., 2021 In summary, gut microbiota metabolites have been demonstrated to alleviate radiation-induced cardiopulmonary injury through mechanisms including modulation of the FP/MAPK/NF-κB pathway and suppression of pyroptosis, via the gut–lung and gut–heart axes, highlighting their potential as radioprotective agents. However, current evidence remains limited, and future studies should expand the scope to include more microbiota-derived metabolites and incorporate clinical validation to strengthen the mechanistic and translational foundations for preventing and treating radiation-induced cardiopulmonary injury. Collectively, a complex bidirectional regulatory relationship exists between gut microbiota metabolites and tumor radiotherapy: irradiation perturbs the microbiota’s structure and function, thereby altering metabolite profiles, while metabolites in turn modulate key processes including tumor radiosensitivity, immune responses, and tissue repair pathways, collectively influencing both the efficacy and toxicity of radiotherapy. For clinical translation, it is essential to not only develop more representative animal models to strengthen the preclinical evidence but also to address the discrepancy between single high-dose irradiation commonly used in animal studies and the fractionated regimens applied clinically, which differ substantially in biological effect. Thus, additional clinical trials are warranted to validate these mechanisms and therapeutic strategies in humans. It is worth noting that host factors (genetic factors, lifestyle, living environment, etc.) can influence the composition of the host’s gut microbiota and metabolites, thereby affecting the efficacy and adverse reactions of radiotherapy. For instance, FMT from sex-matched donors enhanced survival in irradiated animals, increased peripheral leukocyte counts, and improved gastrointestinal function and epithelial integrity ( Cui et al., 2017 Raudenská et al., 2024 4 New applications of microbiota-derived metabolites in radiotherapy Cancer microbiota in clinical trials is based on the molecular mechanisms that influence cancer development, and the number of ongoing or completed clinical trials aimed at enabling microbial therapies continues to grow. In Banna et al. (2017) Lactobacillus rhamnosus Banna et al., 2017 Cui et al. (2017) Cui et al., 2017 Figure 3 Table 4 TABLE 4 Exploring new strategies for cancer radiotherapy based on an understanding of metabolites of microbial origin. New applications Intestinal metabolites Radiotherapy Type of cancer Toxicity type Mechanism Outcome Reference Steroidal alcohol L. pentosan metabolites, SCFAs – CRC  In vivo Decreased PI 3 K/Akt activity Maintains the intestinal microbiological environment and enriches beneficial bacteria  Ma et al., 2019 LBE SCFA and lactic acid producing bacteria Single-dose Gy TBI – in vivo in vitro Activation of the immune response and regulation of gut microbiota and radiation-associated metabolites Regulation of levels of specific metabolites beneficial to host function  Zheng et al., 2021 FMT SCFAs, n-3PUFA, etc. Mice: 9 Gy; cervix  in vivo Restoration of beneficial flora, regulation of tryptophan metabolites, etc. Recovery of Trichoderma reesei  Tu et al., 2024 Urolithin A (Uro A) – 9 Gy –  in vivo Inhibition of p53-p53-mediated apoptosis and remodeling of gut microbes Improved maintenance of homeostasis in the gut and regeneration from radiation exposure  Zhang et al., 2021 Probiotics SCFA, indole derivatives and other gut microbiota metabolites 13 Gy –  in vivo Improvement of inflammatory symptoms and regulation of oxidative stress Mixed probiotics and their metabolites may promote gut recovery  Xie et al., 2024b – Microbiota-derived I3A 13 Gy CRC in vitro in vivo Activates AhR/IL-10/Wnt signaling pathway and upregulates probiotic abundance I3A protects the gut from radiation damage  Xie et al., 2024a Vancomycin – 21 Gy A murine melanoma tumor model in vivo in vitro Increased number and enhanced function of tumor cytolytic CD 8 + Enhancement of RT-induced anti-tumor immune response  Uribe-Herranz et al., 2019 – SCFAs, I3 A and KYNA Whole body: 8 Gy; melanoma  in vivo Reduces levels of pro-inflammatory cytokines Protection of hematopoietic and gastrointestinal systems  Guo H. et al., 2020 – Gut microbial-derived L-histidine and its secondary metabolite ImP Mice: 15 Gy; – in vivo in vitro Inhibition of NF-κB expression after radiation exposure L-histidine or ImP counteract radiation therapy-induced cardiopulmonary injury  Chen Z. et al., 2021 – PGF 2 α Mice: 15 Gy; – in vivo in vitro Inhibition of lung cell apoptosis through activation of the FP/MAPK/NF-κB axis Promotes cell proliferation and inhibits apoptosis  Chen Z.-Y. et al., 2021 4.1 Dietary supplements Enhancement of anticancer therapy can be achieved through immunomodulation and/or secretion of metabolites, including butyrate ( He et al., 2021b Luu et al., 2021 Mager et al., 2020 Wang et al., 2022 Eaton et al., 2022 Murphy et al., 2000 Taper and Roberfroid, 1999 Then et al., 2020 Sterol is a sweet potato extract that is widely recognized as a safe and effective natural nutritional supplement. The anticancer activity of components from natural plant or food sources has been widely reported. Sterol was found to induce tumor apoptosis by promoting the production of SCFAs by gut microbiota. Analysis of 16SrDNA revealed a significant decrease in microbiota diversity, especially in the anaplastic bacilli and thick-walled bacilli phylum, within the intestinal tracts of mice with tumors. However, administering sterol treatment restored these alterations ( Ma et al., 2019 Lu et al., 2016 Bendali et al., 2017 Sun et al., 2017 Additionally, interest is mounting regarding the potential of vitamin D to help prevent side effects linked to radiation therapy. A study by Mukai et al. (2018) Nasser et al., 2017 Ghorbanzadeh-Moghaddam et al., 2015 Bashir et al., 2016 Sun et al. (2017) Kanhere et al., 2018 4.2 Probiotics Prebiotics are organic compounds that the host does not digest or absorb, yet they can specifically enhance the growth and activity of beneficial bacteria in the body, leading to improved health for the host. Goji berry is a popular traditional Chinese herb and tonic recognized for its various biological effects, such as enhancing the immune system, providing antioxidant benefits, reducing inflammation, combating tumors, and protecting the kidneys and liver. Recently, goji berries have attracted attention as a potential prebiotic. It was found that Lycium barbarum Zheng et al., 2021 Kim et al., 2013 Koh et al., 2016 Smith et al., 2013 Kelly et al., 2015 Rooks and Garrett, 2016 Lee et al., 2018 Reichardt et al., 2014 Zheng et al., 2021 Reichardt et al., 2014 Alexeev et al., 2018 Whitfield-Cargile et al., 2016 El-Maraghi et al., 2018 Levy et al., 2015 Urolithin A is a byproduct of ellagitannins, which are compounds present in various fruits and nuts such as pomegranates, strawberries, and walnuts. It exhibits numerous pharmacological properties, including the ability to influence estrogen and androgen receptors, as well as offering antioxidant, anti-inflammatory, and anti-aging benefits. Additionally, Uro A helps repair colon damage caused by a high-fat diet and can alter gut microbiota ( Zhao et al., 2019 + Li et al., 2020 Zhang et al., 2021 4.3 Probiotics and probiotic combination therapy Probiotics are a group of active microorganisms that are beneficial to the host by colonizing the body and altering the composition of the flora at a particular site of the host. Probiotics play a role in immunomodulation, anti-tumor processes, etc. Research by Ciorba et al. (2015) Lactobacillus acidophilus Lactobacillus acidophilus Ki et al., 2014 Badgeley et al., 2021 Lactobacillus acidophilus Bifidobacterium longum Demers et al., 2014 Xie et al., 2024b Yu et al., 2023 Guo H. et al., 2020 4.4 Fecal microbiota transplantation Fecal microbiota transplantation (FMT) is a therapeutic method of isolating the gut microbiota of a healthy donor and transplanting it into the patient’s gut to re-establish their gut microbiota. Radiation causes an imbalance in the microbiota, leading to a reduction in the helpful bacteria Lactobacillus and Trichoderma, but this imbalance can be corrected through FMT ( Tu et al., 2024 Su et al., 2022 Wlodarska et al., 2017 Krishnan et al., 2018 Tu et al., 2024 Wlodarska et al., 2017 Krishnan et al., 2018 Coelho et al., 2022 Schiering et al., 2017 Tu et al., 2024 Guo H. et al., 2020 Cui et al. (2017) Ding et al., 2020 By comparing the mechanisms of the above methods, we can see that dietary supplements mainly work by supplementing dietary fiber, vitamin D, and other nutrients, which are fermented by gut microbiota into SCFA, butyrate, and other metabolites. These metabolites regulate immune responses, enhance intestinal barrier function, and inhibit tumor cell apoptosis pathways such as PI3K and Akt to suppress cancer progression. These supplements have a wide range of sources, are highly safe, and can be obtained through daily diet or nutritional supplements. Prebiotics primarily promote the proliferation of beneficial bacteria through selective mechanisms such as LBE and Uro A, thereby upregulating tryptophan metabolites and secondary bile acids, which have anticancer effects. They are primarily derived from natural ingredients, and their metabolic pathways are well-defined. Probiotics and combination therapy enhance intestinal repair and anti-inflammatory effects by regulating oxidative stress; their clinical application is well-established, but the colonization ability of strains is influenced by individual microbiota backgrounds, and single-strain therapies have limited efficacy, while mixed-strain formulations require optimized ratios. FMT primarily restores intestinal barrier function by reshaping the intestinal microbiota structure. With the emergence of new methods, their limitations must also be acknowledged. For example, inulin and Uro A have provided insights into anticancer therapy, but the differences arising from the translation of animal experiments to clinical settings remain unclear. Current research is limited to mouse models, and the optimal timing and dosage safety range for human administration have yet to be determined. The specific dosage and safety of sitosterol for gastrointestinal tumors also lack large-scale clinical data support. The clinical studies with the greatest potential for translation currently focus on probiotic combination therapy and FMT. The main challenge in probiotic combination therapy lies in the competitive relationships between strains. In animal experiments, the ratio of mixed strains is an optimized result, but the human intestinal environment is complex, and competition between microbial communities may lead to an imbalance in microbial ratios. Additionally, individual differences in intestinal environments may result in unstable strain colonization. Among various strategies, FMT has become the most persuasive method for studying the relationship between bacteria and disease. However, due to the lack of standardized transplantation procedures and long-term safety data, patients receiving gut microbiota transplantation may experience treatment failure due to microbiota rejection. Additionally, most studies use humanized rodents as models, which cannot simulate the complex gastrointestinal environment of the human body. In fact, radiation exposure in animal studies is often more extreme and lethal compared to humans, and there are differences in radiation resistance and microbiota. Therefore, we need to consider other more accurate experimental methods. People have gradually come to recognize that the gut microbiome plays a crucial role in maintaining human health, and new therapeutic strategies based on gut microbial metabolites show great promise. Dietary supplements, prebiotics, and other agents can improve gut microbiota through immune regulation and metabolite secretion, thereby enhancing the efficacy of radiotherapy and reducing adverse reactions. In addition, other novel approaches such as phages and bacteriocins can also be used to engineer the gut microbiome. These new engineered products must undergo extensive research and evaluation to explore their potential for clinical application in cancer radiotherapy. 5 Future perspectives Cancer is a serious human security issue that is difficult to cure due to its complexity. Whilst current anticancer drugs have been shown to have a role in providing palliative or curative treatments, there are still a variety of adverse effects that lead to reduced efficacy and poor prognosis. In recent years, as we have gained a deeper understanding of the gut microbiota, we have found that imbalances in the gut microbiota and its metabolites have been linked to a variety of diseases, including cancer. The microbiome plays a role in cancer development and treatment via various pathways, but our knowledge of this intricate system remains limited. This is largely because the micro-ecosystem is made up of a wide variety of microorganisms that are governed by complex signaling networks. As a result, distinguishing between pro- and anti-tumorigenic strains within the intricate colonies of gut microbiota is challenging. There is a need for more research to clarify the roles of specific microbial elements in inflammation, metabolism, and tumor development, as well as their connections to distant organs. Additionally, understanding the complex interactions between host responses and the microbiota is essential. Simultaneously, microbial metabolites do not exclusively encourage or hinder tumor growth, and numerous microbial metabolites can have contrasting effects depending on the context. We also need to consider synergistic or antagonistic interactions between metabolites and not just focus on the biological function of a particular metabolite. In addition, bacteria inhabiting other organs such as the oral cavity and vagina, as well as fungi and viruses, are also closely related to the development and treatment of cancer and need to be further investigated. Currently, various microbial-based therapies, such as probiotics, FMT, antibiotics, microbial metabolites, and natural compounds, have been used as potential strategies for the treatment of radiation-induced injuries and have accumulated some evidence in clinical trials. However, concerns remain about the safety of gut microbiota group modulation strategies because the poor efficacy, complications and potential tumor protective effects are unknown. Therefore, more preclinical studies and prospective clinical trials are needed to assess the efficacy of different strategies. In terms of experimental design, a multicenter, large-sample randomized controlled trial should be adopted, with strict control of sample size to ensure balanced baseline characteristics between groups, thereby minimizing confounding biases. High-throughput sequencing technology should be employed to dynamically monitor changes in the microbiome before, during, and after radiotherapy. Longitudinal analysis should be conducted to examine the dynamic evolution of the composition and structure of microbiome metabolites, and statistical methods should be used to investigate the relationship between the microbiome and treatment efficacy, in conjunction with clinical efficacy indicators. Additionally, specific designs can be tailored to address key issues, such as collaborative experimental designs for immunotherapy, to explore the enhanced efficacy of immunotherapy following radiotherapy-induced regulation of the microbiome. Finally, for experimental patients, long-term monitoring and follow-up should be conducted, systematically recording acute and long-term adverse reactions, and assessing treatment safety through regular collection of biological samples. Regarding technical challenges in experimental design, specifically, during the sampling process, there may be differences in gut microbiota between different intestinal segments and those caused by radiation therapy-induced intestinal damage. Additionally, the sampling process is prone to contamination, which can interfere with the interpretation of results. It is essential to thoroughly analyze potential biases that may arise during sample collection, such as sampling time. The choice of sample type can also affect detection results. Metabolites are unstable, and if not promptly subjected to low-temperature processing or frozen storage after sampling, they may degrade due to enzymatic hydrolysis or oxidation, leading to metabolite loss. Differences in analytical results may also arise from variations between laboratories and testing platforms. We must consider these technical limitations and take measures to mitigate them to enhance experimental accuracy and clinical applicability. In experiments, the anatomical location of the sampling site should be clearly marked in the sampling protocol to ensure comparability of intestinal segment origins across different samples. To prevent contamination from external impurities, strict adherence to aseptic procedures is required, and a standardized sampling time window should be established. Additionally, by implementing standardized experimental protocols and regularly calibrating instruments, technical deviations can be minimized from the source, enhancing the reliability and stability of experimental data, thereby providing more reliable evidence for clinical translation of research findings. In addition, individual differences observed in response to radiation and the severity of radiation-related toxic effects are a major challenge in the use of radiotherapy, and the components of an individual’s gut microbiota are highly variable. From a host genetic perspective, genetic differences among individuals can influence the colonization and composition of the gut microbiota. Genetic polymorphisms may affect an individual’s susceptibility to specific microbial communities, thereby impacting the balance of the gut microbiome and ultimately influencing the response to radiotherapy. Patients with specific genetic backgrounds may exhibit differing tolerance or sensitivity to radiotherapy, potentially leading to variations in treatment efficacy. Certain genetic characteristics may make a patient’s gut microbiota more susceptible to damage during radiotherapy, potentially triggering side effects such as radiation enteritis; conversely, other genetic factors may stabilize the gut microbiota, maintaining relative homeostasis during radiotherapy, thereby helping to mitigate adverse reactions and enhance treatment efficacy. The role of the microbiome in cancer is environment-dependent, and we must consider factors that regulate the gut microbiota, including diet, antibiotic use, geographic location, and certain treatments. Only by fully understanding these interactions can we improve the efficacy of radiotherapy and suppress adverse reactions. For example, a long-term high-fiber diet can promote the production of beneficial bacteria, such as bifidobacteria and lactobacilli, which produce metabolites such as SCFAs, playing a positive role in intestinal health and immune regulation. Individuals following a high-fiber diet may experience reduced adverse reactions to radiotherapy and a lower risk of radiation enteritis during treatment. Conversely, a diet high in fat, sugar, and low in fiber may lead to reduced gut microbiota diversity, increased proportions of harmful bacteria, and disrupted gut microbiota balance. Similarly, during radiotherapy, the gut microbiota may be unable to effectively respond to treatment-induced stress, potentially exacerbating side effects and impairing treatment efficacy. Environmental factors such as climate, soil, and water sources in different regions can also lead to differences in the types of microorganisms people are exposed to, affecting microbiota colonization. In tropical regions, due to warm and humid climates and abundant microbial diversity, residents’ gut microbiota may also exhibit higher diversity; whereas in cold and dry regions, gut microbiota diversity may be relatively lower. Despite these limitations, various aspects of the gut microbiota can be used as biomarkers for cancer prediction and prognosis. The sensitivity and specificity of candidate biomarkers should be validated through multicenter, large-scale studies to determine whether they can serve as universal prognostic indicators. For patients with a fragile gut microbiota that is susceptible to radiation therapy-induced damage, pre-treatment measures such as probiotic supplementation and dietary adjustments can be implemented to optimize the gut microbiota. During radiotherapy, continuous monitoring of the dynamic changes in the gut microbiota should be conducted, and treatment strategies should be adjusted based on the real-time status of the microbiota. Radiotherapy is increasingly being combined with molecular targeted therapy or immunotherapy for the treatment of solid tumors. If testing reveals that a patient’s gut microbiota characteristics indicate poor radiotherapy efficacy, immunotherapy or targeted therapy can be combined with radiotherapy. It is essential to study how the gut microbiota participates in synergistic therapy to enhance radiation-based cancer combination therapy. With the continuous advancement of medicine, it is believed that the maximum benefits of strategies such as the gut microbiota and probiotics can be realized in the future. By integrating multi-omics approaches, such as genomics and metabolomics, the interaction network between the gut microbiota, host, and tumor can be comprehensively analyzed to identify key regulatory points. By detecting and targeting the regulation of the gut microbiota and its related signaling pathways, customized probiotic formulations and prebiotic formulas have been developed to truly achieve individualized radiotherapy while reducing the complications of radiation damage. Abbreviations 3HB, 3-hydroxybutyric acid; 8-OHdG, 8-hydroxy deoxyguanosine; A 2 A 2 A Lycium barbarum + Author contributions YG: Investigation, Visualization, Writing – original draft, Writing – review & editing. BZ: Investigation, Visualization, Writing – original draft, Writing – review & editing. ZW: Conceptualization, Methodology, Project administration, Supervision, Writing – review & editing. SL: Conceptualization, Methodology, Project administration, Supervision, Writing – review & editing. YY: Conceptualization, Methodology, Project administration, Supervision, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Abdelazeem K. N. M. Kalo M. Z. Beer-Hammer S. Lang F. 2021 The gut microbiota metabolite urolithin A inhibits NF-κB activation in LPS stimulated BMDMs. Sci. Rep. 11 7117 10.1038/s41598-021-86514-6 33782464 PMC8007722 Accolla R. S. Lombardo L. Abdallah R. Raval G. Forlani G. Tosi G. 2014 Boosting the MHC class II-restricted tumor antigen presentation to CD4 + Front. Oncol. 4 32 10.3389/fonc.2014.00032 24600588 PMC3927100 Alexeev E. E. Lanis J. M. Kao D. J. Campbell E. L. Kelly C. J. Battista K. D. 2018 Microbiota-derived indole metabolites promote human and murine intestinal homeostasis through regulation of interleukin-10 receptor. Am. J. Pathol. 188 1183 1194 10.1016/j.ajpath.2018.01.011 29454749 PMC5906738 Alzahrani A. S. 2019 PI3K/Akt/mTOR inhibitors in cancer: At the bench and bedside. Semin. Cancer Biol. 59 125 132 10.1016/j.semcancer.2019.07.009 31323288 Apetoh L. Ghiringhelli F. Tesniere A. Obeid M. Ortiz C. Criollo A. 2007 Toll-like receptor 4–dependent contribution of the immune system to anticancer chemotherapy and radiotherapy. Nat. Med. 13 1050 1059 10.1038/nm1622 17704786 Badgeley A. Anwar H. Modi K. Murphy P. Lakshmikuttyamma A. 2021 Effect of probiotics and gut microbiota on anti-cancer drugs: Mechanistic perspectives. Biochim. Biophys. Acta Rev. Cancer 1875 188494 10.1016/j.bbcan.2020.188494 33346129 Banna G. L. Torino F. Marletta F. Santagati M. Salemi R. Cannarozzo E. 2017 Lactobacillus rhamnosus Front. Pharmacol. 8 603 10.3389/fphar.2017.00603 28919861 PMC5585742 Bashir M. Prietl B. Tauschmann M. Mautner S. I. Kump P. K. Treiber G. 2016 Effects of high doses of vitamin D3 on mucosa-associated gut microbiome vary between regions of the human gastrointestinal tract. Eur. J. Nutr. 55 1479 1489 10.1007/s00394-015-0966-2 26130323 PMC4875045 Bendali F. Kerdouche K. Hamma-Faradji S. Drider D. 2017 In vitro and in vivo cholesterol lowering ability of Lactobacillus pentosus Benef. Microbes 8 271 280 10.3920/BM2016.0121 28299945 Bird L. 2020 Microbial metabolite boosts immunotherapy. Nat. Rev. Immunol. 20 648 649 10.1038/s41577-020-00465-z 33024282 Campbell C. McKenney P. T. Konstantinovsky D. Isaeva O. I. Schizas M. Verter J. 2020 Bacterial metabolism of bile acids promotes generation of peripheral regulatory T cells. Nature 581 475 479 10.1038/s41586-020-2193-0 32461639 PMC7540721 Chang P. V. Hao L. Offermanns S. Medzhitov R. 2014 The microbial metabolite butyrate regulates intestinal macrophage function via histone deacetylase inhibition. Proc. Natl. Acad. Sci. U.S.A. 111 2247 2252 10.1073/pnas.1322269111 24390544 PMC3926023 Chen H. Zhou L. Wu X. Li R. Wen J. Sha J. 2016 The PI3K/AKT pathway in the pathogenesis of prostate cancer. Front. Biosci. 21 1084 1091 10.2741/4443 27100493 Chen Y. Wang X. Ye Y. Ren Q. 2023 Gut microbiota in cancer: Insights on microbial metabolites and therapeutic strategies. Med. Oncol. 41 25 10.1007/s12032-023-02249-6 38129370 Chen Z.-Y. Xiao H.-W. Dong J.-L. Li Y. Wang B. Fan S.-J. 2021 Gut microbiota-derived PGF2α fights against radiation-induced lung toxicity through the MAPK/NF-κB pathway. Antioxidants 11 65 10.3390/antiox11010065 35052569 PMC8773112 Chen Z. Wang B. Dong J. Li Y. Zhang S. Zeng X. 2021 Gut microbiota-derived l-histidine/imidazole propionate axis fights against the radiation-induced cardiopulmonary injury. IJMS 22 11436 10.3390/ijms222111436 34768867 PMC8584084 Ciorba M. A. Hallemeier C. L. Stenson W. F. Parikh P. J. 2015 Probiotics to prevent gastrointestinal toxicity from cancer therapy: An interpretive review and call to action. Curr. Opin. Support Palliat. Care 9 157 162 10.1097/SPC.0000000000000134 25872116 PMC4852157 Coelho N. R. Pimpão A. B. Correia M. J. Rodrigues T. C. Monteiro E. C. Morello J. 2022 Pharmacological blockage of the AHR-CYP1A1 axis: A call for in vivo evidence. J. Mol. Med. 100 215 243 10.1007/s00109-021-02163-2 34800164 PMC8605459 Cui M. Xiao H. Li Y. Zhou L. Zhao S. Luo D. 2017 Faecal microbiota transplantation protects against radiation-induced toxicity. EMBO Mol. Med. 9 448 461 10.15252/emmm.201606932 28242755 PMC5376756 de Visser K. E. Joyce J. A. 2023 The evolving tumor microenvironment: From cancer initiation to metastatic outgrowth. Cancer Cell 41 374 403 10.1016/j.ccell.2023.02.016 36917948 Demaria S. Coleman C. N. Formenti S. C. 2016 Radiotherapy: Changing the game in immunotherapy. Trends Cancer 2 286 294 10.1016/j.trecan.2016.05.002 27774519 PMC5070800 Demaria S. Ng B. Devitt M. L. Babb J. S. Kawashima N. Liebes L. 2004 Ionizing radiation inhibition of distant untreated tumors (abscopal effect) is immune mediated. Int. J. Radiat. Oncol. Biol. Phys. 58 862 870 10.1016/j.ijrobp.2003.09.012 14967443 Demers M. Dagnault A. Desjardins J. 2014 A randomized double-blind controlled trial: Impact of probiotics on diarrhea in patients treated with pelvic radiation. Clin. Nutr. 33 761 767 10.1016/j.clnu.2013.10.015 24200199 Ding X. Li Q. Li P. Chen X. Xiang L. Bi L. 2020 Fecal microbiota transplantation: A promising treatment for radiation enteritis? Radiother. Oncol. 143 12 18 10.1016/j.radonc.2020.01.011 32044171 Duchartre Y. Kim Y.-M. Kahn M. 2016 The Wnt signaling pathway in cancer. Crit. Rev. Oncol. Hematol. 99 141 149 10.1016/j.critrevonc.2015.12.005 26775730 PMC5853106 Eaton S. E. Kaczmarek J. Mahmood D. McDiarmid A. M. Norarfan A. N. Scott E. G. 2022 Exploiting dietary fibre and the gut microbiota in pelvic radiotherapy patients. Br. J. Cancer 127 2087 2098 10.1038/s41416-022-01980-7 36175620 PMC9727022 El-Maraghi E. F. Abdel-Fattah K. I. Soliman S. M. El-Sayed W. M. 2018 Taurine provides a time-dependent amelioration of the brain damage induced by γ-irradiation in rats. J. Hazard. Mater. 359 40 46 10.1016/j.jhazmat.2018.07.005 30014913 Fang J. Y. Richardson B. C. 2005 The MAPK signalling pathways and colorectal cancer. Lancet Oncol. 6 322 327 10.1016/S1470-2045(05)70168-6 15863380 Frijlink E. Bosma D. M. T. Busselaar J. Battaglia T. W. Staal M. D. Verbrugge I. 2024 PD-1 or CTLA-4 blockade promotes CD86-driven Treg responses upon radiotherapy of lymphocyte-depleted cancer in mice. J. Clin. Invest. 134 e171154 10.1172/JCI171154 38349740 PMC10940086 Fu C. Jiang A. 2018 Dendritic cells and CD8 T cell immunity in tumor microenvironment. Front. Immunol. 9 3059 10.3389/fimmu.2018.03059 30619378 PMC6306491 Garavaglia B. Vallino L. Ferraresi A. Esposito A. Salwa A. Vidoni C. 2022 Butyrate inhibits colorectal cancer cell proliferation through autophagy degradation of β-catenin regardless of APC and β-catenin mutational status. Biomedicines 10 1131 10.3390/biomedicines10051131 35625868 PMC9138675 Gasimli R. Kayabasi C. Ozmen Yelken B. Asik A. Sogutlu F. Celebi C. 2023 The effects of PKI-402 on breast tumor models’ radiosensitivity via dual inhibition of PI3K/mTOR. Int. J. Radiat. Biol. 99 1961 1970 10.1080/09553002.2023.2232019 37389464 Ge Z. Chen C. Chen J. Jiang Z. Chen L. Wei Y. 2024 Gut microbiota-derived 3-hydroxybutyrate blocks GPR43-mediated IL6 signaling to ameliorate radiation proctopathy. Adv. Sci. 11 2306217 10.1002/advs.202306217 38742466 PMC11267371 Ghorbanzadeh-Moghaddam A. Gholamrezaei A. Hemati S. 2015 Vitamin D deficiency is associated with the severity of radiation-induced proctitis in cancer patients. Int. J. Radiat. Oncol. Biol. Phys. 92 613 618 10.1016/j.ijrobp.2015.02.011 25890844 Gruffaz M. Vasan K. Tan B. Ramos, da Silva S. Gao S.-J. 2017 TLR4-mediated inflammation promotes KSHV-induced cellular transformation and tumorigenesis by activating the STAT3 pathway. Cancer Res. 77 7094 7108 10.1158/0008-5472.CAN-17-2321 29051178 PMC5732873 Guan D. Yang Y. Pang M. Liu X. Li Y. Huang P. 2024 Indole-3-carboxaldehyde ameliorates ionizing radiation-induced hematopoietic injury by enhancing hematopoietic stem and progenitor cell quiescence. Mol. Cell Biochem. 479 313 323 10.1007/s11010-023-04732-0 37067732 Guo Y.-J. Pan W.-W. Liu S.-B. Shen Z.-F. Xu Y. Hu L.-L. 2020 ERK/MAPK signalling pathway and tumorigenesis. Exp. Ther. Med. 19 1997 2007 10.3892/etm.2020.8454 32104259 PMC7027163 Guo H. Chou W.-C. Lai Y. Liang K. Tam J. W. Brickey W. J. 2020 Multi-omics analyses of radiation survivors identify radioprotective microbes and metabolites. Science 370 eaay9097 10.1126/science.aay9097 33122357 PMC7898465 Guo L. Da F. Gao Q. Miao X. Guo J. Zhang W. 2023 Irradiation-induced intestinal injury is associated with disorders of bile acids metabolism. Int. J. Radiat. Oncol. Biol. Phys. 115 490 500 10.1016/j.ijrobp.2022.08.007 35948117 He B. Hoang T. K. Wang T. Ferris M. Taylor C. M. Tian X. 2017 Resetting microbiota by Lactobacillus reuteri J. Exp. Med. 214 107 123 10.1084/jem.20160961 27994068 PMC5206500 He Y. Sun M. M. Zhang G. G. Yang J. Chen K. S. Xu W. W. 2021c Targeting PI3K/Akt signal transduction for cancer therapy. Signal Transduct. Target. Ther. 6 425 10.1038/s41392-021-00828-5 34916492 PMC8677728 He Y. Fu L. Li Y. Wang W. Gong M. Zhang J. 2021b Gut microbial metabolites facilitate anticancer therapy efficacy by modulating cytotoxic CD8 + Cell Metab. 33 988 1000.e7 10.1016/j.cmet.2021.03.002 33761313 He B. Zhang L. Jiang L. Yu L. Li Q. Tian X. 2021a Inhibiting tumor cell-intrinsic UBA6 by inosine augments tumor immunogenicity. Res. Sq. Preprint 10.21203/rs.3.rs-620390/v1 He K.-Y. Lei X.-Y. Wu D.-H. Zhang L. Li J.-Q. Li Q.-T. 2023 Akkermansia muciniphila Gut Microbes 15 2293312 10.1080/19490976.2023.2293312 38087436 PMC10730217 Hezaveh K. Shinde R. S. Klötgen A. Halaby M. J. Lamorte S. Ciudad M. T. 2022 Tryptophan-derived microbial metabolites activate the aryl hydrocarbon receptor in tumor-associated macrophages to suppress anti-tumor immunity. Immunity 55 324 340.e8 10.1016/j.immuni.2022.01.006 35139353 PMC8888129 Ji K. Zhang M. Du L. Wang J. Liu Y. Xu C. 2024 Exploring the role of inulin in targeting the gut microbiota: An innovative strategy for alleviating colonic fibrosis induced by irradiation. J. Agric. Food Chem. 72 5710 5724 10.1021/acs.jafc.3c03432 38457473 PMC10958509 Jia D. Wang Q. Qi Y. Jiang Y. He J. Lin Y. 2024 Microbial metabolite enhances immunotherapy efficacy by modulating T cell stemness in pan-cancer. Cell 187 1651 1665.e21 10.1016/j.cell.2024.02.022 38490195 Jiao Y. Ren J. Xie S. Yuan N. Shen J. Yin H. 2025 Raffinose-metabolizing bacteria impair radiation-associated hematopoietic recovery via the bile acid/FXR/NF-κB signaling pathway. Gut Microbes 17 2488105 10.1080/19490976.2025.2488105 40192235 PMC11980471 Jin Y. Chen Y. Tang H. Hu X. Hubert S. M. Li Q. 2022 Activation of PI3K/akt pathway is a potential mechanism of treatment resistance in small cell lung cancer. Clin. Cancer Res. 28 526 539 10.1158/1078-0432.CCR-21-1943 34921019 Joachim L. Goettert S. Sax A. Steiger K. Neuhaus K. Heinrich P. 2023 The microbial metabolite desaminotyrosine enhances T-cell priming and cancer immunotherapy with immune checkpoint inhibitors. EBioMedicine 97 104834 10.1016/j.ebiom.2023.104834 37865045 PMC10597767 Kanhere M. Chassaing B. Gewirtz A. T. Tangpricha V. 2018 Role of vitamin D on gut microbiota in cystic fibrosis. J. Steroid Biochem. Mol. Biol. 175 82 87 10.1016/j.jsbmb.2016.11.001 27818276 PMC5415426 Kelly C. J. Zheng L. Campbell E. L. Saeedi B. Scholz C. C. Bayless A. J. 2015 Crosstalk between microbiota-derived short-chain fatty acids and intestinal epithelial HIF augments tissue barrier function. Cell Host Microbe 17 662 671 10.1016/j.chom.2015.03.005 25865369 PMC4433427 Kepp O. Galluzzi L. Martins I. Schlemmer F. Adjemian S. Michaud M. 2011 Molecular determinants of immunogenic cell death elicited by anticancer chemotherapy. Cancer Metastasis Rev. 30 61 69 10.1007/s10555-011-9273-4 21249425 Ki Y. Kim W. Cho H. Ahn K. Choi Y. Kim D. 2014 The effect of probiotics for preventing radiation-induced morphological changes in intestinal mucosa of rats. J. Korean Med Sci. 29 1372 1378 10.3346/jkms.2014.29.10.1372 25368490 PMC4214937 Kim M. H. Kang S. G. Park J. H. Yanagisawa M. Kim C. H. 2013 Short-chain fatty acids activate GPR41 and GPR43 on intestinal epithelial cells to promote inflammatory responses in mice. Gastroenterology 145 396 406.e1-10 10.1053/j.gastro.2013.04.056 23665276 Koh A. De Vadder F. Kovatcheva-Datchary P. Bäckhed F. 2016 From dietary fiber to host physiology: Short-chain fatty acids as key bacterial metabolites. Cell 165 1332 1345 10.1016/j.cell.2016.05.041 27259147 Krishnamurthy N. Kurzrock R. 2018 Targeting the Wnt/beta-catenin pathway in cancer: Update on effectors and inhibitors. Cancer Treat. Rev. 62 50 60 10.1016/j.ctrv.2017.11.002 29169144 PMC5745276 Krishnan S. Ding Y. Saedi N. Choi M. Sridharan G. V. Sherr D. H. 2018 Gut microbiota-derived tryptophan metabolites modulate inflammatory response in hepatocytes and macrophages. Cell Rep. 23 1099 1111 10.1016/j.celrep.2018.03.109 29694888 PMC6392449 Kroemer G. Zitvogel L. 2020 Inosine: Novel microbiota-derived immunostimulatory metabolite. Cell Res. 30 942 943 10.1038/s41422-020-00417-1 32958904 PMC7784899 Lam S. Y. Peppelenbosch M. P. Fuhler G. M. 2019 Prediction and treatment of radiation enteropathy: Can intestinal bugs lead the way? Clin. Cancer Res. 25 6280 6282 10.1158/1078-0432.CCR-19-2422 31492747 Lavoie S. Chun E. Bae S. Brennan C. A. Comeau C. A. G. Lang J. K. 2020 Expression of free fatty acid receptor 2 by dendritic cells prevents their expression of interleukin 27 and is required for maintenance of mucosal barrier and immune response against colorectal tumors in mice. Gastroenterology 158 1359 1372.e9 10.1053/j.gastro.2019.12.027 31917258 PMC7291292 Lee H. Y. Crawley S. Hokari R. Kwon S. Kim Y. S. 2010 Bile acid regulates MUC2 transcription in colon cancer cells via positive EGFR/PKC/Ras/ERK/CREB, PI3K/Akt/IκB/NF-κB and p38/MSK1/CREB pathways and negative JNK/c-Jun/AP-1 pathway. Int. J. Oncol. 36 941 953 10.3892/ijo_00000573 20198339 Lee Y.-S. Kim T.-Y. Kim Y. Lee S.-H. Kim S. Kang S. W. 2018 Microbiota-derived lactate accelerates intestinal stem-cell-mediated epithelial development. Cell Host Microbe 24 833 846.e6 10.1016/j.chom.2018.11.002 30543778 Levy M. Thaiss C. A. Zeevi D. Dohnalová L. Zilberman-Schapira G. Mahdi J. A. 2015 Microbiota-modulated metabolites shape the intestinal microenvironment by regulating NLRP6 inflammasome signaling. Cell 163 1428 1443 10.1016/j.cell.2015.10.048 26638072 PMC5665753 Li C. Zhou Y. Rychahou P. Weiss H. L. Lee E. Y. Perry C. L. 2020 SIRT2 contributes to the regulation of intestinal cell proliferation and differentiation. Cell Mol. Gastroenterol. Hepatol. 10 43 57 10.1016/j.jcmgh.2020.01.004 31954883 PMC7210478 Liu D. Zhuang B. Wei M. Yuan T. Li J. Deng P. 2023 Oral konjac glucomannan for prevention of ionizing radiation-induced injury by regulating gut microbiota and increasing short chain fatty acids. Int. J. Biol. Macromol. 240 124402 10.1016/j.ijbiomac.2023.124402 37044326 Lu G. Gao D. Jiang W. Yu X. Tong J. Liu X. 2024 Disrupted gut microecology after high-dose 131I therapy and radioprotective effects of arachidonic acid supplementation. Eur. J. Nucl. Med. Mol. Imaging 51 2395 2408 10.1007/s00259-024-06688-9 38561516 PMC11178657 Lu G. Gao D. Liu Y. Yu X. Jiang W. Lv Z. 2024b Early and long-term responses of intestinal microbiota and metabolites to 131I treatment in differentiated thyroid cancer patients. BMC Med. 22 300 10.1186/s12916-024-03528-3 39020393 PMC11256643 Lu G. Gao D. Jiang W. Yu X. Tong J. Liu X. 2024a Disrupted gut microecology after high-dose 131I therapy and radioprotective effects of arachidonic acid supplementation. Eur. J. Nucl. Med. Mol. Imaging 51 2395 2408 10.1007/s00259-024-06688-9 38561516 PMC11178657 Lu J.-J. Fu L. Tang Z. Zhang C. Qin L. Wang J. 2016 Melatonin inhibits AP-2β/hTERT, NF-κB/COX-2 and Akt/ERK and activates caspase/Cyto C signaling to enhance the antitumor activity of berberine in lung cancer cells. Oncotarget 7 2985 3001 10.18632/oncotarget.6407 26672764 PMC4823085 Luu M. Riester Z. Baldrich A. Reichardt N. Yuille S. Busetti A. 2021 Microbial short-chain fatty acids modulate CD8 + Nat. Commun. 12 4077 10.1038/s41467-021-24331-1 34210970 PMC8249424 Lv M.-Y. Shi C.-J. Pan F.-F. Shao J. Feng L. Chen G. 2019 Urolithin B suppresses tumor growth in hepatocellular carcinoma through inducing the inactivation of Wnt/β-catenin signaling. J. Cell Biochem. 120 17273 17282 10.1002/jcb.28989 31218741 Ma H. Yu Y. Wang M. Li Z. Xu H. Tian C. 2019 Correlation between microbes and colorectal cancer: Tumor apoptosis is induced by sitosterols through promoting gut microbiota to produce short-chain fatty acids. Apoptosis 24 168 183 10.1007/s10495-018-1500-9 30506375 Mager L. F. Burkhard R. Pett N. Cooke N. C. A. Brown K. Ramay H. 2020 Microbiome-derived inosine modulates response to checkpoint inhibitor immunotherapy. Science 369 1481 1489 10.1126/science.abc3421 32792462 Marciscano A. E. Anandasabapathy N. 2021 The role of dendritic cells in cancer and anti-tumor immunity. Semin. Immunol. 52 101481 10.1016/j.smim.2021.101481 34023170 PMC8545750 Matsushita M. Fujita K. Hayashi T. Kayama H. Motooka D. Hase H. 2021 Gut microbiota-derived short-chain fatty acids promote prostate cancer growth via IGF1 signaling. Cancer Res. 81 4014 4026 10.1158/0008-5472.CAN-20-4090 34039634 Mehta A. K. Kadel S. Townsend M. G. Oliwa M. Guerriero J. L. 2021 Macrophage biology and mechanisms of immune suppression in breast cancer. Front. Immunol. 12 643771 10.3389/fimmu.2021.643771 33968034 PMC8102870 Mukai Y. Yamada D. Eguchi H. Iwagami Y. Asaoka T. Noda T. 2018 Vitamin D supplementation is a promising therapy for pancreatic ductal adenocarcinoma in conjunction with current chemoradiation therapy. Ann. Surg. Oncol. 25 1868 1879 10.1245/s10434-018-6431-8 29675761 Murphy J. Stacey D. Crook J. Thompson B. Panetta D. 2000 Testing control of radiation-induced diarrhea with a psyllium bulking agent: A pilot study. Can. Oncol. Nurs. J. 10 96 100 10.5737/1181912x10396100 11894282 Nasser N. J. Fenig S. Ravid A. Nouriel A. Ozery N. Gardyn S. 2017 Vitamin D ointment for prevention of radiation dermatitis in breast cancer patients. NPJ Breast Cancer 3 10 10.1038/s41523-017-0006-x 28649650 PMC5460188 Oh D. Y. Fong L. 2021 Cytotoxic CD4 + Immunity 54 2701 2711 10.1016/j.immuni.2021.11.015 34910940 PMC8809482 Pai R. Tarnawski A. S. Tran T. 2004 Deoxycholic acid activates β-catenin signaling pathway and increases colon cell cancer growth and invasiveness. MBoC 15 2156 2163 10.1091/mbc.e03-12-0894 15004225 PMC404012 Park J. Hsueh P.-C. Li Z. Ho P.-C. 2023 Microenvironment-driven metabolic adaptations guiding CD8 + Immunity 56 32 42 10.1016/j.immuni.2022.12.008 36630916 Park J. Kim M. Kang S. G. Jannasch A. H. Cooper B. Patterson J. 2015 Short-chain fatty acids induce both effector and regulatory T cells by suppression of histone deacetylases and regulation of the mTOR–S6K pathway. Mucosal Immunol. 8 80 93 10.1038/mi.2014.44 24917457 PMC4263689 Park M. Kwon J. Shin H.-J. Moon S. M. Kim S. B. Shin U. S. 2020 Butyrate enhances the efficacy of radiotherapy via FOXO3A in colorectal cancer patient-derived organoids. Int. J. Oncol. 57 1307 1318 10.3892/ijo.2020.5132 33173975 PMC7646587 Parsons M. J. Tammela T. Dow L. E. 2021 WNT as a driver and dependency in cancer. Cancer Discov. 11 2413 2429 10.1158/2159-8290.CD-21-0190 34518209 PMC8487948 Peng M. Zheng Q. Liu P. Liang X. Zhang M. Wang Y. 2020 Developments in the study of gastrointestinal microbiome disorders affected by FGF19 in the occurrence and development of colorectal neoplasms. J. Cell Physiol. 235 4060 4069 10.1002/jcp.29322 31637718 Pleguezuelos-Manzano C. Puschhof J. Rosendahl Huber A. van Hoeck A. Wood H. M. Nomburg J. 2020 Mutational signature in colorectal cancer caused by genotoxic pks+ E. coli Nature 580 269 273 10.1038/s41586-020-2080-8 32106218 PMC8142898 Raudenská M. Bugajová M. Kalfeřt D. Plzák J. Šubrt A. Tesařová P. 2024 The interplay between microbiome and host factors in pathogenesis and therapy of head and neck cancer. Biochim. Biophys. Acta Rev. Cancer 1879 189216 10.1016/j.bbcan.2024.189216 39542383 Reichardt N. Duncan S. H. Young P. Belenguer A. McWilliam Leitch C. Scott K. P. 2014 Phylogenetic distribution of three pathways for propionate production within the human gut microbiota. ISME J. 8 1323 1335 10.1038/ismej.2014.14 24553467 PMC4030238 Renner K. Bruss C. Schnell A. Koehl G. Becker H. M. Fante M. 2019 Restricting glycolysis preserves T cell effector functions and augments checkpoint therapy. Cell Rep. 29 135 150.e9 10.1016/j.celrep.2019.08.068 31577944 Rooks M. G. Garrett W. S. 2016 Gut microbiota, metabolites and host immunity. Nat. Rev. Immunol. 16 341 352 10.1038/nri.2016.42 27231050 PMC5541232 Ryba-Stanisławowska M. 2024 Unraveling Th subsets: Insights into their role in immune checkpoint inhibitor therapy. Cell Oncol. 48 295 312 10.1007/s13402-024-00992-0 39325360 PMC11996958 Sakamoto Y. Tsujiguchi T. Ito K. Yamanouchi K. 2019 DETERMINATION OF GUT BACTERIAL METABOLITES IN RADIATION EXPOSED MICE. Radiat. Prot. Dosimetry 184 493 495 10.1093/rpd/ncz094 31323674 Sánchez-Alcoholado L. Laborda-Illanes A. Otero A. Ordóñez R. González-González A. Plaza-Andrades I. 2021 Relationships of gut microbiota composition, short-chain fatty acids and polyamines with the pathological response to neoadjuvant radiochemotherapy in colorectal cancer patients. Int. J. Mol. Sci. 22 9549 10.3390/ijms22179549 34502456 PMC8430739 Sassa N. 2020 Retroperitoneal tumors: Review of diagnosis and management. Int. J.Urol. 27 1058 1070 10.1111/iju.14361 32914475 Schiering C. Wincent E. Metidji A. Iseppon A. Li Y. Potocnik A. J. 2017 Feedback control of AHR signalling regulates intestinal immunity. Nature 542 242 245 10.1038/nature21080 28146477 PMC5302159 Scott N. A. Andrusaite A. Andersen P. Lawson M. Alcon-Giner C. Leclaire C. 2018 Antibiotics induce sustained dysregulation of intestinal T cell immunity by perturbing macrophage homeostasis. Sci. Transl. Med. 10 eaao4755 10.1126/scitranslmed.aao4755 30355800 PMC6548564 Shapouri-Moghaddam A. Mohammadian S. Vazini H. Taghadosi M. Esmaeili S.-A. Mardani F. 2018 Macrophage plasticity, polarization, and function in health and disease. J. Cell Physiol. 233 6425 6440 10.1002/jcp.26429 29319160 Smith P. M. Howitt M. R. Panikov N. Michaud M. Gallini C. A. Bohlooly-Y M. 2013 The microbial metabolites, short-chain fatty acids, regulate colonic Treg cell homeostasis. Science 341 569 573 10.1126/science.1241165 23828891 PMC3807819 Stefani C. Miricescu D. Stanescu-Spinu I.-I. Nica R. I. Greabu M. Totan A. R. 2021 Growth Factors, PI3K/AKT/mTOR and MAPK signaling pathways in colorectal cancer pathogenesis: Where are we now? Int. J. Mol. Sci. 22 10260 10.3390/ijms221910260 34638601 PMC8508474 Su X. Gao Y. Yang R. 2022 Gut microbiota-derived tryptophan metabolites maintain gut and systemic homeostasis. Cells 11 2296 10.3390/cells11152296 35892593 PMC9330295 Sun F. Kong B. Chen Q. Han Q. Diao X. 2017 N-nitrosoamine inhibition and quality preservation of Harbin dry sausages by inoculated with Lactobacillus pentosus Lactobacillus curvatus Lactobacillus sake Food Control 73 1514 1521 10.1016/j.foodcont.2016.11.018 Taper H. S. Roberfroid M. 1999 Influence of inulin and oligofructose on breast cancer and tumor growth. J. Nutr. 129 1488S 1491S 10.1093/jn/129.7.1488S 10395627 Then C. K. Paillas S. Wang X. Hampson A. Kiltie A. E. 2020 Association of Bacteroides BMC Biol. 18 102 10.1186/s12915-020-00836-x 32811478 PMC7437060 Thirunavukkarasan M. Wang C. Rao A. Hind T. Teo Y. R. Siddiquee A. A.-M. 2017 Short-chain fatty acid receptors inhibit invasive phenotypes in breast cancer cells. PLoS One 12 e0186334 10.1371/journal.pone.0186334 29049318 PMC5648159 Totiger T. M. Srinivasan S. Jala V. R. Lamichhane P. Dosch A. R. Gaidarski A. A. 2019 Urolithin A, a novel natural compound to target PI3K/AKT/mTOR pathway in pancreatic cancer. Mol. Cancer Ther. 18 301 311 10.1158/1535-7163.MCT-18-0464 30404927 PMC6363854 Tu Y. Luo L. Zhou Q. Ni J. Tang Q. 2024 Fecal microbiota transplantation repairs radiation enteritis through modulating the gut microbiota-mediated tryptophan metabolism. Radiat. Res. 201 572 585 10.1667/RADE-23-00189.1 38555945 Uribe-Herranz M. Rafail S. Beghi S. Gil-de-Gómez L. Verginadis I. Bittinger K. 2019 Gut microbiota modulate dendritic cell antigen presentation and radiotherapy-induced antitumor immune response. J. Clin. Invest. 130 466 479 10.1172/JCI124332 31815742 PMC6934221 Walczak K. Turski W. A. Rajtar G. 2014 Kynurenic acid inhibits colon cancer proliferation in vitro: Effects on signaling pathways. Amino Acids 46 2393 2401 10.1007/s00726-014-1790-3 25012123 PMC4168223 Wang H. Rong X. Zhao G. Zhou Y. Xiao Y. Ma D. 2022 The microbial metabolite trimethylamine N-oxide promotes antitumor immunity in triple-negative breast cancer. Cell Metab. 34 581 594.e8 10.1016/j.cmet.2022.02.010 35278352 Wang T. Gnanaprakasam J. N. R. Chen X. Kang S. Xu X. Sun H. 2020 Inosine is an alternative carbon source for CD8 + Nat. Metab. 2 635 647 10.1038/s42255-020-0219-4 32694789 PMC7371628 Wang Z. Wang Q. Wang X. Zhu L. Chen J. Zhang B. 2019 Gut microbial dysbiosis is associated with development and progression of radiation enteritis during pelvic radiotherapy. J. Cell Mol. Med. 23 3747 3756 10.1111/jcmm.14289 30908851 PMC6484301 Whitfield-Cargile C. M. Cohen N. D. Chapkin R. S. Weeks B. R. Davidson L. A. Goldsby J. S. 2016 The microbiota-derived metabolite indole decreases mucosal inflammation and injury in a murine model of NSAID enteropathy. Gut Microbes 7 246 261 10.1080/19490976.2016.1156827 27007819 PMC4939928 Wilson M. R. Jiang Y. Villalta P. W. Stornetta A. Boudreau P. D. Carrá A. 2019 The human gut bacterial genotoxin colibactin alkylates DNA. Science 363 eaar7785 10.1126/science.aar7785 30765538 PMC6407708 Wlodarska M. Luo C. Kolde R. d’Hennezel E. Annand J. W. Heim C. E. 2017 Indoleacrylic acid produced by commensal Peptostreptococcus Cell Host Microbe 22 25 37.e6 10.1016/j.chom.2017.06.007 28704649 PMC5672633 Wroblewski L. E. Peek R. M. Coburn L. A. 2016 The role of the microbiome in gastrointestinal cancer. Gastroenterol. Clin. North Am. 45 543 556 10.1016/j.gtc.2016.04.010 27546848 PMC4994977 Xiao H. Cui M. Li Y. Dong J. Zhang S. Zhu C. 2020 Gut microbiota-derived indole 3-propionic acid protects against radiation toxicity via retaining acyl-CoA-binding protein. Microbiome 8 69 10.1186/s40168-020-00845-6 32434586 PMC7241002 Xiao T. Wu S. Yan C. Zhao C. Jin H. Yan N. 2018 Butyrate upregulates the TLR4 expression and the phosphorylation of MAPKs and NK-κB in colon cancer cell in vitro. Oncol. Lett. 16 4439 4447 10.3892/ol.2018.9201 30214578 PMC6126326 Xie L.-W. Cai S. Lu H.-Y. Tang F.-L. Zhu R.-Q. Tian Y. 2024a Microbiota-derived I3A protects the intestine against radiation injury by activating AhR/IL-10/Wnt signaling and enhancing the abundance of probiotics. Gut Microbes 16 2347722 10.1080/19490976.2024.2347722 38706205 PMC11086037 Xie L.-W. Lu H.-Y. Tang L.-F. Tang F.-L. Zhu R.-Q. Wang D.-F. 2024b Probiotic consortia protect the intestine against radiation injury by improving intestinal epithelial homeostasis. Int. J. Radiat. Oncol. Biol. Phys. 120 189 204 10.1016/j.ijrobp.2024.03.003 38485099 Xie M. Yuan K. Zhang Y. Zhang Y. Zhang R. Gao J. 2025 Tumor-resident probiotic Clostridium butyricum Cancer Cell S1535-6108(25)00318-6 10.1016/j.ccell.2025.07.012 40780216 Xu C. Li H. Yin M. Yang T. An L. Yang G. 2017 Osteopontin is involved in TLR4 pathway contributing to ovarian cancer cell proliferation and metastasis. Oncotarget 8 98394 98404 10.18632/oncotarget.21844 29228698 PMC5716738 Xu S. Lv Q. Zou N. Zhang Y. Zhang J. Tang Q. 2023 Influence of neo-adjuvant radiotherapy on the intestinal microbiota of rectal cancer patients. J. Cancer Res. Clin. Oncol. 149 6085 6096 10.1007/s00432-022-04553-6 36656381 PMC11797716 Yang J. Ding C. Dai X. Lv T. Xie T. Zhang T. 2017 Soluble dietary fiber ameliorates radiation-induced intestinal epithelial-to-mesenchymal transition and fibrosis. J. Parenteral Enteral Nutr. 41 1399 1410 10.1177/0148607116671101 27660288 Yang K. Hou Y. Zhang Y. Liang H. Sharma A. Zheng W. 2021 Suppression of local type I interferon by gut microbiota-derived butyrate impairs antitumor effects of ionizing radiation. J. Exp. Med. 218 e20201915 10.1084/jem.20201915 33496784 PMC7844434 Yang Q. Wang B. Zheng Q. Li H. Meng X. Zhou F. 2023 A review of gut microbiota-derived metabolites in tumor progression and cancer therapy. Adv. Sci. 10 e2207366 10.1002/advs.202207366 36951547 PMC10214247 Yu Y. Lin X. Feng F. Wei Y. Wei S. Gong Y. 2023 Gut microbiota and ionizing radiation-induced damage: Is there a link? Environ. Res. 229 115947 10.1016/j.envres.2023.115947 37080277 Zhang Y. Dong Y. Lu P. Wang X. Li W. Dong H. 2021 Gut metabolite Urolithin A mitigates ionizing radiation-induced intestinal damage. J. Cell Mol. Med. 25 10306 10312 10.1111/jcmm.16951 34595829 PMC8572803 Zhang Y.-J. Li S. Gan R.-Y. Zhou T. Xu D.-P. Li H.-B. 2015 Impacts of gut bacteria on human health and diseases. Int J. Mol. Sci. 16 7493 7519 10.3390/ijms16047493 25849657 PMC4425030 Zhang Y.-Y. Li J. Li F. Xue S. Xu Q.-Y. Zhang Y.-Q. 2023 Palmitic acid combined with γ-interferon inhibits gastric cancer progression by modulating tumor-associated macrophages’ polarization via the TLR4 pathway. J. Cancer Res. Clin. Oncol. 149 7053 7067 10.1007/s00432-023-04655-9 36862159 PMC11797332 Zhao R. Long X. Yang J. Du L. Zhang X. Li J. 2019 Pomegranate peel polyphenols reduce chronic low-grade inflammatory responses by modulating gut microbiota and decreasing colonic tissue damage in rats fed a high-fat diet. Food Funct. 10 8273 8285 10.1039/c9fo02077b 31720661 Zhao Z. Cheng W. Qu W. Shao G. Liu S. 2020 Antibiotic alleviates radiation-induced intestinal injury by remodeling microbiota, reducing inflammation, and inhibiting fibrosis. ACS Omega 5 2967 2977 10.1021/acsomega.9b03906 32095719 PMC7033964 Zheng Y. Pang X. Zhu X. Meng Z. Chen X. Zhang J. 2021 Lycium barbarum Biomed. Pharmacother. 139 111654 10.1016/j.biopha.2021.111654 33957563 Zhu G. Huang Q. Huang Y. Zheng W. Hua J. Yang S. 2016 Lipopolysaccharide increases the release of VEGF-C that enhances cell motility and promotes lymphangiogenesis and lymphatic metastasis through the TLR4- NF-κB/JNK pathways in colorectal cancer. Oncotarget 7 73711 73724 10.18632/oncotarget.12449 27713159 PMC5342009 Zitvogel L. Daillère R. Roberti M. P. Routy B. Kroemer G. 2017 Anticancer effects of the microbiome and its products. Nat. Rev. Microbiol. 15 465 478 10.1038/nrmicro.2017.44 28529325 ",
  "metadata": {
    "Title of this paper": "Anticancer effects of the microbiome and its products.",
    "Journal it was published in:": "Frontiers in Microbiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488674/"
  }
}