{
  "title": "Paper_610",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471987 PMC12471987.1 12471987 12471987 41010917 10.3390/medicina61091526 medicina-61-01526 1 Review The Role of [18F]FDG PET-Based Radiomics and Machine Learning for the Evaluation of Cardiac Sarcoidosis: A Narrative Literature Review https://orcid.org/0000-0003-4839-9033 Dondi Francesco 1 * https://orcid.org/0000-0002-3599-0492 Bellini Pietro 2 https://orcid.org/0000-0002-4716-9925 Gatta Roberto 3 https://orcid.org/0000-0003-1654-323X Camoni Luca 2 Rinaldi Roberto 2 Viganò Gianluca 4 https://orcid.org/0009-0009-8448-2118 Cossandi Michela 2 Brangi Elisa 5 https://orcid.org/0000-0002-3544-6104 Vizzardi Enrico 5 Bertagna Francesco 1 Wang William Academic Editor 1 2 pietro.bellini@asst-spedalicivili.it roberto.rinaldi@asst-spedalicivili.it michela.cossandi@asst-spedalicivili.it 3 roberto.gatta@unibs.it 4 gianluca.vigano@asst-spedalicivili.it 5 elisa.brangi@unibs.it enrico.vizzardi@unibs.it * francesco.dondi@unibs.it 25 8 2025 9 2025 61 9 497654 1526 21 7 2025 20 8 2025 22 8 2025 25 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Results Conclusions cardiac sarcoidosis PET PET/CT positron emission tomography [18F]FDG [18F]fluorodeoxyglucose radiomics machine learning texture analysis PET/MR This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Sarcoidosis is a rare systemic pathology of unknown origin characterized by the presence of non-necrotizing granulomatous inflammation and fibrosis in tissues that can involve multiple organs and mainly affects lungs and lymph nodes [ 1 2 3 4 5 6 7 8 7 8 9 10 Cardiac sarcoidosis (CS) is an inflammatory cardiomyopathy that appears when the disease involves the heart, and this pathological condition is characterized by serious consequences and an increase in the mortality rate [ 1 11 12 13 14 15 16 17 18 1 5 7 14 15 18 14 15 19 20 14 15 19 21 22 18 23 [18F]fluorodesoxyglucose ([18F]FDG) positron emission tomography/computed tomography (PET/CT) is a diagnostic tool that has proved its ability for the evaluation of different inflammatory conditions [ 24 25 26 27 1 28 29 30 31 1 32 33 34 35 36 37 33 38 39 40 41 42 43 The aim of this comprehensive narrative review, therefore, is to evaluate the role of [18F]FDG PET-based radiomics and ML in the assessment of CS, summarizing the available literature in this field of research that is constantly gaining growing interest and which has recently experienced the publication of different papers ( Figure 1 Figure 2 2. The Role of [18F]FDG PET-Based Radiomics and ML for the Evaluation of CS Different studies assessed the role of texture analysis and ML derived from [18F]FDG PET imaging for the evaluation of CS in different settings and, interestingly, they were all published in recent years [ 44 45 46 47 48 49 Table 1 Table 2 Table 3 Table 4 2.1. Diagnosis Manabe et al. [ 44 p p p p p Togo et al. [ 45 Mushari et al. [ 46 p p Lastly, Kote et al. [ 47 Notably, while conventional SUV metrics (SUVmax, SUVmean) showed limited diagnostic value in some studies [ 44 47 44 44 47 2.2. Prognosis Manabe et al. [ 48 p p More recently, Nakajo et al. [ 49 p p p p p p p Prognostically, HGRE and GLRLM_RLNU were consistently associated with adverse events, independent of functional parameters like LVEF [ 48 49 3. Discussion The aim of this review was to evaluate the possible added value of [18F]FDG PET-based radiomics and ML for the evaluation of CS by summarizing the available literature on this topic. Different papers have explored this subject, suggesting a potential role for these approaches in the diagnosis and the prognostic assessment of patients affected by this pathological condition [ 44 45 46 47 48 49 44 45 50 47 46 50 47 49 Conventional semiquantitative PET parameters have been suggested in the past as useful to assess CS [ 29 30 51 52 53 54 44 46 47 48 One of the main points that is mandatory to underline when performing a general analysis of the papers included in the review, in the attempt to compare their findings, is the fact that different segmentation protocols and methods to extract the radiomics features were used among the studies. For instance, studies used divergent approaches: whole-left ventricle volume of interest [ 45 46 47 44 47 51 53 55 29 46 Another interesting point is that the regions of CS characterized by intense uptake of [18F]FDG were in some papers identified by a visual analysis while in other cases an SUV-based threshold was used. As previously mentioned, conventional SUV parameters have demonstrated their value in the assessment of CS, and the joint Society of Nuclear Medicine and Molecular Imaging (SNMMI)/American Society of Nuclear Cardiology (ASNC) consensus expert document recommends their use to quantify the intensity and the amount of myocardial inflammation related to the presence of CS, even in the monitoring of response to therapy [ 29 30 51 30 51 56 57 58 ML is based on the learning aspects of artificial intelligence by focusing on its ability to learn from and to represent a set of data [ 34 35 59 60 Before clinical implementation, three barriers must be addressed to endorse the use of radiomics and ML: first of all, external validation in multicentric trials using harmonized PET protocols is necessary. Development of open-source, vendor-agnostic radiomics pipelines to overcome computational resource limitations and integration of radiomics with clinical variables (e.g., NYHA class) and serological biomarkers are other point that must be considered. Crucially, radiomics should complement and not replace established semiquantitative PET parameters until prospective validation confirms incremental value. Several intrinsic problems that need to be overcome in the future are present in radiomics and ML technologies. Reproducibility and repeatability are major issues of radiomics feature extraction and subsequent analysis; these are well-known topics in current literature and future efforts in the direction to resolve them need to be performed. Focusing on the specific setting of PET imaging, it has been reported that different scanners, tumor segmentation, partial volume effect, reconstruction protocols, and uptake time can influence the extraction of textural features and subsequent ML analyses [ 35 61 62 63 64 65 66 67 68 58 69 70 71 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 This review is affected by different limitations that are directly derived by the studies included. First of all, all of them are retrospective analyses based on single-center settings, an issue that can therefore influence the generalizability of their findings, which need to be confirmed in prospective multicentric protocols. Furthermore, the use of different methods for the segmentation and the extraction of radiomics features can impact their general value for the assessment of CS. As mentioned, radiomics and ML technologies are characterized by intrinsic issues. Moreover, an external validation was not included in the papers cited in the review, a point that is mandatory to strengthen the value of the results obtained in monocentric retrospective settings [ 35 73 74 75 4. Conclusions Our review underlines how [18F]FDG PET-based radiomics and ML show preliminary promise for CS evaluation but currently remain investigational tools. Current evidence is insufficient for clinical adoption due to methodological heterogeneity, small sample sizes, and lack of standardization. Future research must prioritize different points, such as multicentric settings with protocol harmonization, the development of disease-specific radiomics signatures validated against histopathological endpoints, and cost-effectiveness analyses comparing radiomics-enhanced workflows against standard care. Until these steps are achieved, conventional PET parameters remain the evidence-based quantitative standard. The potential clinical implications of adopting radiomics and ML in the assessment of CS lie in the support that these technologies can offer in improving disease diagnosis, achieving a more precise characterization through non-invasive methods, and potentially enhancing the prediction of patient prognosis. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, F.D.; methodology, F.D. and F.B.; writing—original draft preparation, F.D. and F.B.; writing—review and editing, P.B., R.G., L.C., R.R., G.V., M.C., E.B. and E.V. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Data supporting the reported results can be found using the public scientific databases. Conflicts of Interest The authors declare no conflicts of interest. Use of AI AI tools were used to generate Figure 1 References 1. Wiefels C. Boczar K. Birnie D. Beanlands R. Chareonthaitawee P. Quantification of metabolic activity in the evaluation of cardiac sarcoidosis J. Nucl. Cardiol. 2025 43 102088 10.1016/j.nuclcard.2024.102088 39586490 2. Terasaki F. Yoshinaga K. New guidelines for diagnosis of cardiac sarcoidosis in Japan Ann. Nucl. Cardiol. 2017 3 42 45 10.17996/anc.17-00042 3. Terasaki F. Azuma A. Anzai T. Ishizaka N. Ishida Y. Isobe M. Inomata T. Ishibashi-Ueda H. Eishi Y. Kitakaze M. Japanese Circulation Society Joint Working Group. JCS 2016 Guideline on Diagnosis and Treatment of Cardiac Sarcoidosis—Digest Version Circ. J. 2019 83 2329 2388 10.1253/circj.CJ-19-0508 31597819 4. Judson M.A. Costabel U. Drent M. Wells A. Maier L. Koth L. Shigemitsu H. Culver D.A. Gelfand J. Valeyre D. Organ Assessment Instrument Investigators TW. The WASOG Sarcoidosis Organ Assessment Instrument: An update of a previous clinical tool Sarcoidosis Vasc. Diffuse Lung Dis. 2014 31 19 27 24751450 5. Trivieri M.G. Spagnolo P. Birnie D. Liu P. Drake W. Kovacic J.C. Baughman R. Fayad Z.A. Judson M.A. Challenges in Cardiac and Pulmonary Sarcoidosis: JACC State-of-the-Art Review J. Am. Coll. Cardiol. 2020 76 1878 1901 10.1016/j.jacc.2020.08.042 33059834 PMC7808240 6. Birnie D.H. Nery P.B. Ha A.C. Beanlands R.S. Cardiac sarcoidosis J. Am. Coll. Cardiol. 2016 68 411 421 10.1016/j.jacc.2016.03.605 27443438 7. Tan J.L. Fong H.K. Birati E.Y. Han Y. Cardiac Sarcoidosis Am. J. Cardiol. 2019 123 513 522 10.1016/j.amjcard.2018.10.021 30503798 8. Iannuzzi M.C. Rybicki B.A. Teirstein A.S. Sarcoidosis N. Engl. J. Med. 2007 357 2153 2165 10.1056/NEJMra071714 18032765 9. Ginelliová A. Farkaš D. Iannaccone S.F. Vyhnálková V. Sudden unexpected death due to severe pulmonary and cardiac sarcoidosis Forensic Sci. Med. Pathol. 2016 12 319 323 10.1007/s12024-016-9792-y 27379608 10. Mushari N.A. Soultanidis G. Duff L. Trivieri M.G. Fayad Z.A. Robson P.M. Tsoumpas C. Exploring the Utility of Cardiovascular Magnetic Resonance Radiomic Feature Extraction for Evaluation of Cardiac Sarcoidosis Diagnostics 2023 13 1865 10.3390/diagnostics13111865 37296722 PMC10252949 11. Valeyre D. Prasse A. Nunes H. Uzunhan Y. Brillet P.Y. Muller-Quernheim J. Sarcoidosis Lancet 2014 383 1155e67 10.1016/S0140-6736(13)60680-7 24090799 12. Milman N. Selroos O. Pulmonary sarcoidosis in the Nordic countries 1950–1982. Epidemiology and clinical picture Sarcoidosis 1990 7 50 57 2345819 13. Rybicki B.A. Major M. Popovich J. Jr. Maliarik M.J. Iannuzzi M.C. Racial differences in sarcoidosis incidence: A 5-year study in a health maintenance organization Am. J. Epidemiol. 1997 145 234 241 10.1093/oxfordjournals.aje.a009096 9012596 14. Miller R.J. Shanbhag A. Marcinkiewicz A.M. Struble H. Gransar H. Hijazi W. Fujito H. Kransdorf E. Kavanagh P. Liang J.X. AI-enabled CT-guided end-to-end quantification of total cardiac activity in 18FDG cardiac PET/CT for detection of cardiac sarcoidosis J. Nucl. Cardiol. 2025 22 102195 10.1016/j.nuclcard.2025.102195 PMC12147654 40127777 15. Lehtonen J. Uusitalo V. Pöyhönen P. Mäyränpää M.I. Kupari M. Cardiac sarcoidosis: Phenotypes, diagnosis, treatment, and prognosis Eur. Heart J. 2023 44 1495 1510 10.1093/eurheartj/ehad067 36924191 PMC10149532 16. Salotti A. Mondini L. Confalonieri P. Salton F. Nalli C. Reccardini N. Torregiani C. Antonaglia C. Hughes M. Confalonieri M. Cardiac sarcoidosis recurrence post-heart transplant: A critical literature and case report Sarcoidosis Vasc. Diffuse Lung Dis. 2025 42 16865 17. Kouranos V. Sharma R. Cardiac sarcoidosis: State-of-the-art review Heart 2021 107 1591 1599 10.1136/heartjnl-2019-316442 33674355 18. Nappi C. Ponsiglione A. Imbriaco M. Cuocolo A. 18F-FDG PET/CMR in Cardiac Sarcoidosis: A Wild Card in the Deck? J. Nucl. Cardiol. 2022 29 765 767 10.1007/s12350-020-02427-3 33145740 19. Fazelpour S. Sadek M.M. Nery P.B. Beanlands R.S. Tzemos N. Toma M. Birnie D.H. Corticosteroid and Immunosuppressant Therapy for Cardiac Sarcoidosis: A Systematic Review J. Am. Heart Assoc. 2021 10 e021183 10.1161/JAHA.121.021183 34472360 PMC8649244 20. Roshankar G. Zhang J.Y. Parekh D. Lyons K. Isaac D. Miller R.J.H. Steroid sparing immunosuppression in man agement of cardiac sarcoidosis Health Sci. Rev. 2022 4 100034 21. Soejima K. Yada H. The work-up and management of patients with apparent or subclinical cardiac sarcoidosis J. Cardiovasc. Electrophysiol. 2009 20 578e83 10.1111/j.1540-8167.2008.01417.x 19175448 22. Birnie D.H. Sauer W.H. Bogun F. Cooper J.M. Culver D.A. Duvernoy C.S. Judson M.A. Kron J. Mehta D. Cosedis Nielsen J. HRS expert consensus statement on the diagnosis and management of arrhythmias associated with cardiac sarcoidosis Heart Rhythm. 2014 11 1305 1323 10.1016/j.hrthm.2014.03.043 24819193 23. Bennett M.K. Gilotra N.A. Harrington C. Rao S. Dunn J.M. Freitag T.B. Halushka M.K. Russell S.D. Evaluation of the role of endomyocardial biopsy in 851 patients with unexplained heart failure from 2000–2009 Circ. Heart Fail. 2013 6 676 684 10.1161/CIRCHEARTFAILURE.112.000087 23733916 24. Sammartino A.M. Falco R. Drera A. Dondi F. Bellini P. Bertagna F. Vizzardi E. Vascular inflammation and cardiovascular disease: Review about the role of PET imaging Int. J. Cardiovasc. Imaging 2023 39 433 440 10.1007/s10554-022-02730-9 36255543 PMC9870832 25. Dondi F. Albano D. Bellini P. Volpi G. Giubbini R. Bertagna F. 18F-fluorodeoxyglucose PET and PET/computed tomography for the evaluation of immunoglobulin G4-related disease: A systematic review Nucl. Med. Commun. 2022 43 638 645 10.1097/MNM.0000000000001566 35438679 26. Sammartino A.M. Bonfioli G.B. Dondi F. Riccardi M. Bertagna F. Metra M. Vizzardi E. Contemporary Role of Positron Emission Tomography (PET) in Endocarditis: A Narrative Review J. Clin. Med. 2024 13 4124 10.3390/jcm13144124 39064164 PMC11277723 27. Dondi F. Albano D. Ferrarini G. Camoni L. Bellini P. Treglia G. Bertagna F. Role of splenic and bone marrow uptake at 18 F-FDG PET/CT for the assessment of large vessels vasculitis and the influence of glucocorticoids therapy on their values J. Med. Imaging Radiat. Oncol. 2023 67 717 725 10.1111/1754-9485.13560 37469123 28. Crouser E.D. Maier L.A. Wilson K.C. Bonham C.A. Morgenthau A.S. Patterson K.C. Abston E. Bernstein R.C. Blankstein R. Chen E.S. Diagnosis and Detection of Sarcoidosis. An Official American Thoracic Society Clinical Practice Guideline Am. J. Respir. Crit. Care Med. 2020 201 e26 e51 10.1164/rccm.202002-0251ST 32293205 PMC7159433 29. Chareonthaitawee P. Beanlands R.S. Chen W. Dorbala S. Miller E.J. Murthy V.L. Birnie D.H. Chen E.S. Cooper L.T. Tung R.H. EXPERT CONTENT REVIEWERS. Joint SNMMI-ASNC Expert Consensus Document on the Role of 18F-FDG PET/CT in Cardiac Sarcoid Detection and Therapy Monitoring J. Nucl. Med. 2017 58 1341 1353 10.2967/jnumed.117.196287 28765228 PMC6944184 30. Slart R.H.J.A. Glaudemans A.W.J.M. Lancellotti P. Hyafil F. Blankstein R. Schwartz R.G. Jaber W.A. Russell R. Gimelli A. Rouzet F. Document Reading Group. A joint procedural position statement on imaging in cardiac sarcoidosis: From the Cardiovascular and Inflammation & Infection Committees of the European Association of Nuclear Medicine, the European Association of Cardiovascular Imaging, and the American Society of Nuclear Cardiology J. Nucl. Cardiol. 2018 25 298 319 10.1007/s12350-017-1043-4 29043557 31. Kumita S. Yoshinaga K. Miyagawa M. Momose M. Kiso K. Kasai T. Naya M. Committee for diagnosis of cardiac sarcoidosis using 18F-FDG PET, Japanese Society of Nuclear Cardiology. Recommendations for 18F-fluorodeoxyglucose positron emission tomography imaging for diagnosis of cardiac sarcoidosis—2018 update: Japanese Society of Nuclear Cardiology recommendations J. Nucl. Cardiol. 2019 26 1414 1433 10.1007/s12350-019-01755-3 31197741 32. Orlhac F. Soussan M. Maisonobe J.A. Garcia C.A. Vanderlinden B. Buvat I. Tumor texture analysis in 18F-FDG PET: Relationships between texture parameters, histogram indices, standardized uptake values, metabolic volumes, and total lesion glycolysis J. Nucl. Med. 2014 55 414 422 10.2967/jnumed.113.129858 24549286 33. Dondi F. Gatta R. Gazzilli M. Bellini P. Viganò G.L. Ferrari C. Pisani A.R. Rubini G. Bertagna F. [18F]FDG PET-Based Radiomics and Machine Learning for the Assessment of Gliomas and Glioblastomas: A Systematic Review Information 2025 16 58 10.3390/info16010058 34. Choi R.Y. Coyner A.S. Kalpathy-Cramer J. Chiang M.F. Campbell J.P. Introduction to Machine Learning, Neural Networks, and Deep Learning Transl. Vis. Sci. Technol. 2020 9 14 10.1167/tvst.9.2.14 PMC7347027 32704420 35. Deo R.C. Machine Learning in Medicine Circulation 2015 132 1920 1930 10.1161/CIRCULATIONAHA.115.001593 26572668 PMC5831252 36. Bernardi S. Vallati M. Gatta R. Artificial Intelligence-Based Management of Adult Chronic Myeloid Leukemia: Where Are We and Where Are We Going? Cancers 2024 16 848 10.3390/cancers16050848 38473210 PMC10930728 37. De Bari B. Vallati M. Gatta R. Lestrade L. Manfrida S. Carrie C. Valentini V. Development and validation of a machine learning-based predictive model to improve the prediction of inguinal status of anal cancer patients: A preliminary report Oncotarget 2016 8 108509 108521 10.18632/oncotarget.10749 29312547 PMC5752460 38. Dondi F. Gatta R. Treglia G. Piccardo A. Albano D. Camoni L. Gatta E. Cavadini M. Cappelli C. Bertagna F. Application of radiomics and machine learning to thyroid diseases in nuclear medicine: A systematic review Rev. Endocr. Metab. Disord. 2024 25 175 186 10.1007/s11154-023-09822-4 37434097 PMC10808150 39. Dondi F. Gatta R. Albano D. Bellini P. Camoni L. Treglia G. Bertagna F. Role of Radiomics Features and Machine Learning for the Histological Classification of Stage I and Stage II NSCLC at [18F] FDG PET/CT: A Comparison between Two PET/CT Scanners J. Clin. Med. 2022 12 255 10.3390/jcm12010255 36615053 PMC9820870 40. Dondi F. Pasinetti N. Gatta R. Albano D. Giubbini R. Bertagna F. Comparison between Two Different Scanners for the Evaluation of the Role of 18F-FDG PET/CT Semiquantitative Parameters and Radiomics Features in the Prediction of Final Diagnosis of Thyroid Incidentalomas J. Clin. Med. 2022 11 615 10.3390/jcm11030615 35160067 PMC8836668 41. Hosny A. Aerts H.J. Mak R.H. Handcrafted versus deep learning radiomics for prediction of cancer therapy response Lancet Digit. Health 2019 1 e106 e107 10.1016/S2589-7500(19)30062-7 33323257 42. Beuque M.P.L. Lobbes M.B.I. van Wijk Y. Widaatalla Y. Primakov S. Majer M. Balleyguier C. Woodruff H.C. Lambin P. Combining Deep Learning and Handcrafted Radiomics for Classification of Suspicious Lesions on Contrast-enhanced Mammograms Radiology 2023 307 e221843 10.1148/radiol.221843 37338353 43. Jeong S. Yu H. Park S.H. Woo D. Lee S.J. Chong G.O. Han H.S. Kim J.C. Comparing deep learning and handcrafted radiomics to predict chemoradiotherapy response for locally advanced cervical cancer using pretreatment MRI Sci. Rep. 2024 14 1180 10.1038/s41598-024-51742-z 38216687 PMC10786874 44. Manabe O. Ohira H. Hirata K. Hayashi S. Naya M. Tsujino I. Aikawa T. Koyanagawa K. Oyama-Manabe N. Tomiyama Y. Use of 18F-FDG PET/CT texture analysis to diagnose cardiac sarcoidosis Eur. J. Nucl. Med. Mol. Imaging 2019 46 1240 1247 10.1007/s00259-018-4195-9 30327855 45. Togo R. Hirata K. Manabe O. Ohira H. Tsujino I. Magota K. Ogawa T. Haseyama M. Shiga T. Cardiac sarcoidosis classification with deep convolutional neural network-based features using polar maps Comput. Biol. Med. 2019 104 81 86 10.1016/j.compbiomed.2018.11.008 30447397 46. Mushari N.A. Soultanidis G. Duff L. Trivieri M.G. Fayad Z.A. Robson P. Tsoumpas C. Exploring the Utility of Radiomic Feature Extraction to Improve the Diagnostic Accuracy of Cardiac Sarcoidosis Using FDG PET Front. Med. 2022 9 840261 10.3389/fmed.2022.840261 PMC8920041 35295595 47. Kote R. Ravina M. Thippanahalli Ganga R. Singh S. Reddy M. Prasanth P. Kote R. Role of Textural Analysis Parameters Derived from FDG PET/CT in Diagnosing Cardiac Sarcoidosis World J. Nucl. Med. 2024 23 256 263 10.1055/s-0044-1788336 39677337 PMC11637645 48. Manabe O. Koyanagawa K. Hirata K. Oyama-Manabe N. Ohira H. Aikawa T. Furuya S. Naya M. Tsujino I. Tomiyama Y. Prognostic Value of 18F-FDG PET Using Texture Analysis in Cardiac Sarcoidosis JACC Cardiovasc. Imaging 2020 13 1096 1097 10.1016/j.jcmg.2019.11.021 31954654 49. Nakajo M. Hirahara D. Jinguji M. Ojima S. Hirahara M. Tani A. Takumi K. Kamimura K. Ohishi M. Yoshiura T. Machine learning approach using 18F-FDG-PET-radiomic features and the visibility of right ventricle 18F-FDG uptake for predicting clinical events in patients with cardiac sarcoidosis Jpn. J. Radiol. 2024 42 744 752 10.1007/s11604-024-01546-y 38491333 PMC11217075 50. Abbasian Ardakani A. Bureau N.J. Ciaccio E.J. Acharya U.R. Interpretation of radiomics features-A pictorial review Comput. Methods Programs Biomed. 2022 215 106609 10.1016/j.cmpb.2021.106609 34990929 51. Campisi R. Merani M.F. Rodríguez M.I. Assessment of Cardiac Sarcoidosis: FDG PET and BMIPP SPECT Curr. Cardiol. Rep. 2022 24 1873 1882 10.1007/s11886-022-01803-4 36282434 52. Boczar K.E. Park Y. Wiefels C. Can FDG-PET Imaging Identify Cardiac Sarcoidosis Disease Phenotypes? Curr. Cardiol. Rep. 2024 26 851 857 10.1007/s11886-024-02086-7 38990493 53. Kim S.J. Pak K. Kim K. Diagnostic performance of F-18 FDG PET for detection of cardiac sarcoidosis; A systematic review and meta-analysis J. Nucl. Cardiol. 2020 27 2103 2115 10.1007/s12350-018-01582-y 30603894 54. Aitken M. Chan M.V. Urzua Fresno C. Farrell A. Islam N. McInnes M.D.F. Iwanochko M. Balter M. Moayedi Y. Thavendiranathan P. Diagnostic Accuracy of Cardiac MRI versus FDG PET for Cardiac Sarcoidosis: A Systematic Review and Meta-Analysis Radiology 2022 304 566 579 10.1148/radiol.213170 35579526 55. Miyagawa M. Tashiro R. Watanabe E. Kawaguchi N. Ishimura H. Kido T. Kido T. Kurata A. Mochizuki T. Optimal Patient Preparation for Detection and Assessment of Cardiac Sarcoidosis by FDG-PET Ann. Nucl. Cardiol. 2017 3 113 116 10.17996/anc.17-00037 56. Ahmadian A. Brogan A. Berman J. Sverdlov A.L. Mercier G. Mazzini M. Quantitative interpretation of FDG PET/CT with myocardial perfusion imaging increases diagnostic information in the evaluation of cardiac sarcoidosis J. Nucl. Cardiol. 2014 21 925 939 10.1007/s12350-014-9901-9 24879453 57. Osborne M.T. Hulten E.A. Singh A. Waller A.H. Bittencourt M.S. Stewart G.C. Reduction in (18)F-fluorodeoxyglucose uptake on serial cardiac positron emission tomography is associated with improved left ventricular ejection fraction in patients with cardiac sarcoidosis J. Nucl. Cardiol. 2013 21 166 174 10.1007/s12350-013-9828-6 24307261 58. Waller A.H. Blankstein R. Quantifying myocardial inflammation using 18F-fluorodeoxyglucose positron emission tomography in cardiac sarcoidosis J. Nucl. Cardiol. 2014 21 940 943 10.1007/s12350-014-9921-5 24942609 59. Lip G.Y.H. Nieuwlaat R. Pisters R. Lane D.A. Crijns H.J.G.M. Refining clinical risk stratification for predicting stroke and thromboembolism in atrial fibrillation using a novel risk factor-based approach: The euro heart survey on atrial fibrillation Chest 2010 137 263 272 10.1378/chest.09-1584 19762550 60. O’Mahony C. Jichi F. Pavlou M. Monserrat L. Anastasakis A. Rapezzi C. Biagini E. Gimeno J.R. Limongelli G. McKenna W.J. A novel clinical risk prediction model for sudden cardiac death in hypertrophic cardiomyopathy (HCM risk-SCD) Eur. Heart J. 2014 35 2010 2020 10.1093/eurheartj/eht439 24126876 61. Lambin P. Leijenaar R.T.H. Deist T.M. Peerlings J. de Jong E.E.C. van Timmeren J. Sanduleanu S. Larue R.T.H.M. Even A.J.G. Jochems A. Radiomics: The bridge between medical imaging and personalized medicine Nat. Rev. Clin. Oncol. 2017 14 749 762 10.1038/nrclinonc.2017.141 28975929 62. Zwanenburg A. Vallières M. Abdalah M.A. Aerts H.J.W.L. Andrearczyk V. Apte A. Ashrafinia S. Bakas S. Beukinga R.J. Boellaard R. The Image Biomarker Standardization Initiative: Standardized Quantitative Radiomics for High-Throughput Image-based Phenotyping Radiology 2020 295 328 338 10.1148/radiol.2020191145 32154773 PMC7193906 63. Reynes-Llompart G. Sabatè-Llobera A. Linares-Tello E. Martì-Climent J. Gamez-Cenzano C. Image quality evaluation in a modern PET system: Impact of new reconstructions methods and a radiomics approach Sci. Rep. 2019 9 10640 10.1038/s41598-019-46937-8 31337779 PMC6650602 64. Ha S. Choi H. Paeng J.C. Cheon G.J. Radiomics in Oncological PET/CT: A Methodological Overview Nucl. Med. Mol. Imaging 2019 53 14 29 10.1007/s13139-019-00571-4 30828395 PMC6377580 65. Cook G.J.R. Azad G. Owczarczyk K. Siddique M. Goh V. Challenges and Promises of PET Radiomics Int. J. Radiat. Oncol. Biol. Phys. 2018 102 1083 1089 10.1016/j.ijrobp.2017.12.268 29395627 PMC6278749 66. Zwanenburg A. Radiomics in nuclear medicine: Robustness, reproducibility, standardization, and how to avoid data analysis traps and replication crisis Eur. J. Nucl. Med. Mol. Imaging 2019 46 2638 2655 10.1007/s00259-019-04391-8 31240330 67. Lovinfosse P. Visvikis D. Hustinx R. Hatt M. FDG PET radiomics: A review of the methodological aspects Clin. Transl. Imaging 2018 6 379 391 10.1007/s40336-018-0292-9 68. Pfaehler E. van Sluis J. Merema B.B.J. van Ooijen P. Berendsen R.C.M. van Velden F.H.P. Boellaard R. Experimental Multicenter and Multivendor Evaluation of the Performance of PET Radiomic Features Using 3-Dimensionally Printed Phantom Inserts J. Nucl. Med. 2020 61 469 476 10.2967/jnumed.119.229724 31420497 PMC7067530 69. Tankyevych O. Tixier F. Antonorsi N. Filali Razzouki A. Mondon R. Pinto-Leite T. Visvikis D. Hatt M. Cheze Le Rest C. Can alternative PET reconstruction schemes improve the prognostic value of radiomic features in non-small cell lung cancer? Methods 2021 188 73 83 10.1016/j.ymeth.2020.11.002 33197567 70. Galavis P.E. Hollensen C. Jallow N. Paliwal B. Jeraj R. Variability of textural features in FDG PET images due to different acquisition modes and reconstruction parameters Acta Oncol. 2010 49 1012 1016 10.3109/0284186X.2010.498437 20831489 PMC4091820 71. Yan J. Chu-Shern J.L. Loi H.Y. Khor L.K. Sinha A.K. Quek S.T. Tham I.W. Townsend D. Impact of Image Reconstruction Settings on Texture Features in 18F-FDG PET J. Nucl. Med. 2015 56 1667 1673 10.2967/jnumed.115.156927 26229145 72. Dwivedi P. Barage S. Jha A.K. Choudhury S. Rangarajan V. Robustness of 18F-FDG PET Radiomic Features in Lung Cancer: Impact of Advanced Reconstruction Algorithm J. Nucl. Med. Technol. 2025 53 50 56 10.2967/jnmt.124.268252 39909582 73. Guiot J. Vaidyanathan A. Deprez L. Zerka F. Danthine D. Frix A.N. Lambin P. Bottari F. Tsoutzidis N. Miraglio B. A review in radiomics: Making personalized medicine a reality via routine imaging Med. Res. Rev. 2022 42 426 440 10.1002/med.21846 34309893 74. Cheze Le Rest C. Hustinx R. Are radiomics ready for clinical prime-time in PET/CT imaging? Q. J. Nucl. Med. Mol. Imaging 2019 63 347 354 10.23736/S1824-4785.19.03210-2 31527579 75. Piñeiro-Fiel M. Moscoso A. Pubul V. Ruibal Á. Silva-Rodríguez J. Aguiar P. A Systematic Review of PET Textural Analysis and Radiomics in Cancer Diagnostics 2021 11 380 10.3390/diagnostics11020380 33672285 PMC7926413 Figure 1 Radiomics workflow for CS: from PET acquisition to clinical decision. Starting from the acquisition of PET images and their reconstruction, the subsequent processing with segmentation and radiomics feature extraction is used to validate and train ML models with a possible prognostic or diagnostic value. Figure 2 Flowchart of the research flow used for the review and to obtain eligible studies on the role of [18F]FDG-based radiomics and ML for the assessment of CS. medicina-61-01526-t001_Table 1 Table 1 Characteristics of the studies considered for the review. First Author N. Ref. Year Country Study Design N. Pts. CS Pts. (%) Setting Manabe O [ 44 2018 Japan Retrospective 89 37 (42) Diagnosis Togo R [ 45 2019 Japan Retrospective 85 33 (39) Diagnosis Manabe O [ 48 2020 Japan Retrospective 62 62 (100) Prognosis Mushari NA [ 46 2022 UK, USA, Netherlands Retrospective 69 40 (58) Diagnosis Kote R [ 47 2024 India Retrospective 67 17 (25) Diagnosis Nakajo M [ 49 2024 Japan Retrospective 47 47 (100) Prognosis N.: number; Pts: patients; Ref.: reference; USA: United States of America; UK: United Kingdom; CS: cardiac sarcoidosis. medicina-61-01526-t002_Table 2 Table 2 Characteristics of the papers included in the review. First Author N. Ref. Device Number of Scanners Scanner Type Reconstruction Protocol Reported Activity (MBq) Cardiac Uptake Suppression Manabe O [ 44 PET/CT 1 Siemens Biograph 64 TruePoint TrueV PSF 4.5/kg LCD Togo R [ 45 PET/CT 1 Siemens Biograph 64 TruePoint TrueV PSF 4.5/kg LCD Manabe O [ 48 PET/CT 1 Siemens Biograph 64 TruePoint TrueV PSF 4.5/kg LCD, unfractionated Mushari NA [ 46 PET/CMR 1 Siemens BiographTM mMR OSEM 5/kg LCD Kote R [ 47 PET/CT 1 GE Discovery ns ns LCD Nakajo M [ 49 PET/CT 2 GE Discovery OSEM, PSF 223 ± 30 LCD PET: positron emission tomography; CT: computed tomography; MBq: megabecquerel; Ref: reference; kg: kilogram; CMR: cardiac magnetic resonance; ns: not specified; LCD: low-carbohydrate diet; PSF: point spread function; OSEM: ordered subset expectation maximization. medicina-61-01526-t003_Table 3 Table 3 Results and main findings of the studies considered for the review. First Author Ref. Performance Validation Methods ML Models Class Balancing Main Findings Manabe O [ 44 Train/test Logistic regression 42/58 Some textural features showed Togo R [ 45 Cross-fold Deep convolutional neural network 33/52 Radiomics features may be more effective than conventional semiquantitative features for CS diagnosis. Manabe O [ 48 Train/test Logistic regression ns [18F]FDG textural features may potentially provide prognostic information in CS subjects. Mushari NA [ 46 Cross-fold Random Forest, Logistic Regression, Support Vector Machine, Decision Tree, Gaussian Process Classifier, Stochastic Gradient Descent, Perceptron Classifier, Passive Aggressive Classifier, Neural Network Classifier and K-neighbors Classifier ns Radiomic analysis of PET data may not be a useful approach to detect CS. Conventional semiquantitative parameters show high performances. Kote R [ 47 ROC ns ns Textural analysis parameters could successfully differentiate CS from non-CS. Nakajo M [ 49 Train/test Decision 38/9 ML analyses using [18F]FDG PET-based radiomics features may be useful to predict adverse clinical events in CS subjects. Ref.: reference; [18F]FDG: [18F]fluorodeoxyglucose; ns: not specified; ML: machine learning; CS: cardiac sarcoidosis; PET: positron emission tomography; ROC: receiver operating characteristics. medicina-61-01526-t004_Table 4 Table 4 Summaries of diagnostic workflow used in the different studies. First Author N. Ref. Models Manabe O [ 44  Selection of [18F]FDG avid areas in the left ventricle Extraction of SUVmax, CMV, CMA Generation of short-axis images and reconstruction of polar map with linear interpolation method Extraction of radiomics features from polar map Togo R [ 45  Selection of [18F]FDG avid areas in the left ventricle Extraction of SUVmax Generation of short-axis images and reconstruction of polar map with linear interpolation method Extraction of features from the polar map and selection Evaluation of effectiveness of DCNN-based features with SVM classifier Manabe O [ 48  Selection of [18F]FDG avid areas in the left ventricle Extraction of SUVmax, CMV, CMA Generation of short-axis images and reconstruction of polar map with linear interpolation method Extraction of radiomics features from polar map Mushari NA [ 46  Segmentation A: ROI drawing in hot regions with SUV > 2.5 and evaluation of TBR; segmentation B: ROI drawing on the entire left ventricle Extraction of conventional and radiomics metrics Application of ML models Kote R [ 47  Drawing of ROIs on the myocardium with 40% thresholding Extraction of conventional and textural features Passing of these features through a principle component analysis algorithm Testing of ML classifiers Nakajo M [ 49  Generating VOI by placing ROI on a reference-fused axial image and applying a 40% threshold of SUVmax Extraction of radiomics features after harmonization for different scanners Application of ML models Ref.: reference; [18F]FDG: [18F]fluorodeoxyglucose; SUVmax: maximum standardized uptake value; CMV: cardiac metabolic volume; CMA: cardiac metabolic activity; DCNN: deep convolutional neural network; SVM: support vector machine; ROI: region of interest; TBR: target-to-background ratio; ML: machine learning; VOI: volume of interest. ",
  "metadata": {
    "Title of this paper": "A Systematic Review of PET Textural Analysis and Radiomics in Cancer",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471987/"
  }
}