{
  "title": "Paper_1071",
  "abstract": "pmc PLoS Negl Trop Dis PLoS Negl Trop Dis 532 plosntd plos PLOS Neglected Tropical Diseases 1935-2727 1935-2735 PLOS PMC12478962 PMC12478962.1 12478962 12478962 40982488 10.1371/journal.pntd.0013558 PNTD-D-25-00809 1 Research Article Biology and Life Sciences Anatomy Lymphatic System Lymph Nodes Medicine and Health Sciences Anatomy Lymphatic System Lymph Nodes Medicine and Health Sciences Medical Conditions Infectious Diseases Fungal Diseases Histoplasmosis Medicine and Health Sciences Medical Conditions Infectious Diseases Opportunistic Infections Medicine and Health Sciences Diagnostic Medicine Tuberculosis Diagnosis and Management Biology and Life Sciences Organisms Bacteria Actinobacteria Mycobacterium Tuberculosis Medicine and health sciences Diagnostic medicine HIV diagnosis and management Medicine and Health Sciences Pathology and Laboratory Medicine Etiology Medicine and Health Sciences Medical Conditions Infectious Diseases Bacterial Diseases Tuberculosis Medicine and Health Sciences Medical Conditions Tropical Diseases Tuberculosis Etiological spectrum and diagnostic features of lymphadenopathy in People Living with HIV in French Guiana: A 17-years multicenter retrospective case series Lymphadenopathy etiological spectrum in PLHIV in French Guiana https://orcid.org/0000-0003-2216-9715 Bourne-Watrin Morgane Conceptualization Data curation Formal analysis Investigation Methodology Visualization Writing – original draft Writing – review & editing  1 * Françoise Ugo Formal analysis Methodology Validation Visualization Writing – review & editing  2  3  4 Baron Sophie Alexandra Investigation Writing – review & editing  5 Adenis Antoine A. Investigation Methodology Supervision Validation Writing – review & editing  2  3  4 Pierre Louis Dufens Validation Writing – review & editing  6 Epelboin Loïc Validation Writing – review & editing  2  7 Nacher Mathieu Methodology Validation Writing – review & editing  2  3  4 Djossou Félix Writing – review & editing  7  8 Drak Alsibai Kinan Conceptualization Investigation Methodology Supervision Writing – review & editing  4  9  10 Couppié Pierre Conceptualization Investigation Methodology Supervision Validation  1  8 1 Service de Dermatologie-Vénérologie, Centre Hospitalier de Cayenne, Cayenne, Guyane française 2 Centre d’Investigation Clinique Antilles Guyane, Inserm CIC 1424, Centre Hospitalier de Cayenne, Cayenne, Guyane française 3 Coordination de la lutte contre les infections sexuellement transmissibles et le virus de l’immunodéficience humaine de la Guyane, Centre Hospitalier de Cayenne, Cayenne, Guyane française 4 Institut Santé des Populations en Amazonie, Centre Hospitalier de Cayenne, Cayenne, Guyane française 5 Institut Pasteur de la Guyane, Cayenne, Guyane française 6 Service de Médecine A, Centre Hospitalier de Cayenne, Cayenne, Guyane française 7 Unité des Maladies Infectieuses et Tropicales, Centre Hospitalier de Cayenne, Cayenne, Guyane française 8 TBIP, Université de Guyane, Université de Lille, CNRS, Inserm, Institut Pasteur de Lille, U1019-UMR9017-CIIL Centre d’Infection et d’Immunité de Lille, Cayenne, Guyane française 9 Service d’Anatomie et Cytologie Pathologique et Centre de Ressources Biologiques (CRB Amazonie), Centre Hospitalier de Cayenne, Cayenne, Guyane française 10 Registres des Cancers de Guyane (RCan Guyane), Département de Recherche et d’Innovation en Santé Publique (DRISP), Centre Hospitalier de Cayenne, Cayenne, Guyane française Nosanchuk Joshua Editor  Albert Einstein College of Medicine, UNITED STATES OF AMERICA The authors have declared that no competing interests exist. * E-mail: morgane.bourne@ch-cayenne.fr 22 9 2025 9 2025 19 9 496059 e0013558 23 5 2025 12 9 2025 22 09 2025 30 09 2025 30 09 2025 © 2025 Bourne-Watrin et al 2025 Bourne-Watrin et al https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Introduction Lymph node enlargement can be present at any stage of the HIV infection, reactive to HIV itself, another infection, or a malignant source. The aim of our study was to describe the causes of lymphadenopathy in the people living with HIV (PLHIV) of French Guiana, a French territory in the Amazon region. Methods A retrospective multicenter case series was conducted between January 2005 and December 2021. Inclusion population consisted of PLHIV who underwent a fine needle aspiration or a biopsy of a lymph node that was analyzed at the Department of Pathology of Cayenne hospital. Results We included 152 adults, with a median age of 43 [35–51] years and median CD4 count of 185/mm 3 3 Conclusion For the last 17 years, opportunistic infections represented 53% of the causes of lymphadenopathy among PLHIV. Histoplasmosis, already recognized as the first AIDS-defining condition and first cause of AIDS-related deaths in French Guiana, is also the first cause of lymphadenopathy in PLHIV, ahead of tuberculosis and reactive lymphadenopathy. The CD4 count and the size of the lymph nodes appear to be the most important factors in the diagnostic process and should lead to a quick lymph node analysis in these patients. Author summary Lymph node enlargement is common during the course of the HIV infection, reactive to HIV itself, or due to an opportunistic infectious or neoplastic cause that can put the life of patients at risk. Thus, it is important to distinguish reactive or normal lymph nodes from opportunistic causes needing a biopsy to quickly introduce a specific treatment if necessary. We studied the causes of lymphadenopathy requiring a biopsy or a fine needle aspiration in people living with HIV over 17 years in French Guiana. In this territory in the Amazon region with major socioeconomic inequalities, a universal health system and an Amazonian pathogen ecosystem, we hypothesized that the main etiologies may differ from those of temperate regions, with a higher proportion of opportunistic infections. In our population mainly composed of immunocompromised patients with < 200 CD4/mm3, in a region with high histoplasmosis and tuberculosis endemicity, opportunistic infections and malignancy were more than twice as common as benign causes. The CD4 count, size of the lymph nodes and presence of associated respiratory signs or fever appear to be the most important factors in the diagnostic process and should lead to a quick lymph node analysis in these fragile patients. The author(s) received no specific funding for this work. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Data Availability All data are available in the text or in Supporting information PLOS Publication Stage vor-update-to-uncorrected-proof Publication Update 2025-09-29 Data Availability All data are available in the text or in Supporting information Introduction Lymph nodes are secondary lymphoid organs that play a major role in adaptive immunity. Since the onset of the human immunodeficiency virus (HIV) pandemic, lymphadenopathy has been considered a clinical manifestation of the disease [ 1 2 3 French Guiana is a French overseas territory located in South America, bordering Suriname and Brazil. The population is multiethnic, mainly composed of Amerindians, Creoles, Bushinenges (African-American Maroons), French from mainland France, Hmong (originated from Laos) and Chinese. In addition, people migrating from the neighboring territories, mainly Haiti, Brazil, Suriname and Guyana represent a substantial part of the population [ 4 5 Hence, the main objective of the present study was to describe the etiological spectrum of lymphadenopathy among PLHIV under follow-up in French Guiana. The secondary objective was to identify clinical and paraclinical features associated with AIDS (Acquired Immunodeficiency Syndrome)-defining opportunistic conditions when compared to HIV-reactive or benign etiologies. Methods Ethics statement All participants of the present study were included in the DMI-2/ DOMEVIH database, administered by the local Regional Coordination for the fight against HIV (COREVIH Guyane). This database is part of the French Hospital Database on HIV, a French national cohort of PLHIV since 1992, that has received approval by the French regulatory authority, the Commission Nationale Informatique et Libertés (CNIL), on November 27, 1991. The main objective of this hospital cohort is to study the evolution, morbidity and mortality of PLHIV in French Guiana [ 6 st Study design and study population We carried out a retrospective multicenter study of PLHIV who underwent lymph-node sampling between January 1 st st Inclusion criteria Inclusion criteria were age > 18 years and confirmed HIV infection (2 positive serologies and Western blot). Patients with only non-contributive samples (muscle, fat, necrosis, structure other than a lymph node, or any tissues too damaged to be analyzed) were excluded. Case definition Two samples collected for the same medical complaint/event were considered as a single event. Lymph node areas were gathered according to the FLIPI nodal map [ 7 HIV-reactive lymphadenitis included: hyperplastic adenitis, follicular adenitis with or without histiocytosis, lymphocytic depletion attributed to HIV and angioimmunoblastic lymphadenopathy when attributed to HIV by the pathologist. If a patient presented a reactive adenitis with a disseminated infection such as tuberculosis but without evidence of tuberculosis in the lymph node, the lymphadenopathy was considered as non-specific adenitis (and not as HIV-reactive). For human herpesvirus 8 (HHV8) associated cancers, Castleman’s disease was considered as a lymphoproliferative disorder (LPD); Kaposi sarcoma was not included in the metastases nor LPD group, since it presents a complex and still not totally understood physiopathology with an invasion linked to neo-angiogenesis and not to lymphoid diffusion [ 8 9 For infections, microbiological diagnosis was made in histology based on the presence of Acid-fast bacilli with the Ziehl-Neelsen stain or yeast with the Gomori-Grocott stain or using specific tuberculosis or histoplasmosis PCR. Architectural transformations (granuloma, necrosis…) were not considered as specific of a pathology. Mycological and mycobacteriological direct examination or culture (stored for 6 and 9 weeks respectively) could also be positive. Diagnosis was only confirmed if the pathogen was found in the lymph node. A positive result in another organ was not sufficient to confirm the diagnosis. Positive histoplasmosis or cryptococcal antigen alone was not used as diagnosis criteria. Etiological groups Five etiological groups were initially defined, with as main causes: HIV-reactive, tuberculosis, histoplasmosis, lymphoma and metastasis. In order to answer the secondary objective, which was to identify clinical and paraclinical features associated with AIDS-defining opportunistic conditions, we separated the patients into two groups: opportunistic and benign/reactive causes. AIDS-defining opportunistic conditions included: histoplasmosis, tuberculosis and other mycobacterial infections, cryptococcosis (defined as opportunistic infections), Kaposi sarcoma and LPD. Patients with normal lymph nodes and HIV-reactive lymphadenitis were included in the benign/reactive group. We excluded patients with solid cancer metastases from the comparative analysis since their lymphadenopathy had been sampled as part of an extension work-up for a previously identified cancer but not for diagnostic purposes. Patients with reactive adenitis not attributed to HIV or any associate opportunistic disease diagnosed outside of the lymph node were also excluded from this analysis. Data collection procedure We screened for all lymph node samples in the Diamic (Dedalus, France) pathology department software using the code “SG” over the study period and excluded non-contributive samples. Medical reports were then screened to search for PLHIV within the selected samples. For all eligible patients, data collected from the pathology department included Gram, Periodic-Acid-Shift, Gomori-Grocott and Ziehl-Neelsen staining, and were cross-checked with the ones of the microbiological laboratory. Data were retrospectively and systematically collected on a standardized form using Epidata software, and stored in an anonymized Excel database. We collected the etiologies of lymphadenopathy and their relevant sociodemographic, clinical and paraclinical associated data from the patients’ medical files within the French Guiana PLHIV cohort database (DMI-2-DOMEVIH, French Hospital Database on HIV, FHDH). Data analysis Quantitative variables were presented with median and 25%-75% interquartile ranges [IQR], categorical variables with proportion and confidence interval when relevant. Association between AIDS-defining opportunistic conditions and explanatory variables were tested with Wilcoxon, χ 2 Patients included before 2016 and presenting with > 500 CD4/mm 3 10 11 Results Baseline characteristics Over the 17 years study period, 152 PLHIV were included, representing 142 biopsies and 24 FNA ( Fig 1 10.1371/journal.pntd.0013558.g001 Fig 1 Flow chart 2005-2021. Abbreviations: FNA: Fine Needle Aspiration; LADP: Lymphadenopathy; PLHIV: People Living with the Human Immunodeficiency Virus. The male to female sex ratio was 1.6 and the median age was 43 [35–51] years ( Table 1 10.1371/journal.pntd.0013558.t001 Table 1 Baseline data of 152 cases of lymphadenopathy in PLHIV between 2005 and 2021. No/Total (%)  Sex ratio Male/Female 1.6  Median age (years) 43 [35-51] Place of birth Haiti 51/149 (34) French Guiana 27/149 (18) Brazil 25/149 (17) Suriname 19/149 (13) Guyana 17/149 (11) Other * 10/149 (7) Transmission mode of HIV Heterosexual 126/149 (85) Homosexual 2/149 (1) Bisexual 2/149 (1) Materno-fetal 1/149 (1) Unknown 18/149 (12) Antiretroviral therapy at diagnosis † 54/148 (36) Median CD4 count (cells/mm3) 185 [60-344] Median HIV viral load (log10 copies/ml) 4.5 [2.1-5.3] Time interval between diagnosis of HIV and actual diagnosis [1-6 months] 46/148 (31) [6 months-2 years] 25/148 (17) [2-5 years] 28/148 (19) [5-10 years] 20/148 (14) ≥ 10 years 29/148 (20) Concomitant extra-ganglionic AIDS-defining conditions ‡ 28/149 (19) Esophageal candidiasis 10/149 (7) Cerebral toxoplasmosis 7/149 (5) Extra-ganglionic tuberculosis 5/149 (3) CMV disease 4/149 (3) Extra-ganglionic histoplasmosis 3/149 (2) Extra-ganglionic Mycobacterium avium complex 2/149 (1) HIV associated nephropathy 2/149 (1) Recurrent mucocutaneous infections due to HSV 2/149 (1) Other § 4/149 (3) Abbreviations: AIDS: Acquired Immunodeficiency Syndrome; CMV: Cytomegalovirus; HSV: Herpes Simplex Virus; IQR: interquartile ranges; No: Number. n = number of available data; Medians are presented with 25–75% interquartile ranges in brackets. *Other place of birth: Mainland France (n = 4), Dominican Republic (n = 2), Martinique (n = 1), Guinea-Bissau (n = 1), Venezuela (n = 1), Senegal (n = 1); †Patients with a newly diagnosed HIV infection and patients included before 2016 and presenting more than 500 CD4/mm3 were not included since it was not strictly recommended to treat them that time following national recommendations; ‡Multiple associated conditions possible. As the wasting syndrome could be secondary to the cause of the lymphadenopathy, we did not consider this syndrome as an associated AIDS-defining condition; §Other concomitant extra-ganglionic AIDS-defining conditions: Salmonella Pneumocystis jirovecii Patients were mainly born in Haiti (34%), French Guiana (18%), and Brazil (17%). The main transmission mode of HIV was heterosexual (85%). Median CD4 count and HIV viral load were 185/mm3 [60–344] and 4.5 log10 copies/ml [2.1-5.3], respectively. Almost 20% of patients presented concomitant extra-ganglionic AIDS-defining conditions, mainly composed of esophageal candidiasis and cerebral toxoplasmosis. At the time of analysis of lymphadenopathy, the diagnosis of HIV was known for less than 6 months in 31% of cases. Missing data for Bacillus Calmette-Guérin (BCG) vaccination and environmental exposures were too numerous to include these variables. Main etiologies of lymphadenopathy The main lymphadenopathy etiologies were histoplasmosis (38/152, 25%, CI95%: 18–33), followed by tuberculosis (37/152, 24%, CI95%: 18–32) and HIV-reactive lymphadenitis (32/152, 21%, CI95%: 15–29) ( Table 2 12 10.1371/journal.pntd.0013558.t002 Table 2 Main etiologies of lymphadenopathy in PLHIV, 2005-2021, French Guiana. No/Total (%)  Histoplasmosis  38/152 (25) Associated * 4/38 (11) Associated * 3/38 (8) Associated * 2/38 (5)  Tuberculosis  37/152 (24) Associated * 3/37 (8) Associated * 1/37 (6)  HIV-reactive lymphadenitis  32/152 (21)  Lymphoproliferative disorder  17/152 (11) Hodgkin lymphoma (scleronodular) 7/152 (5) Associated * 1/7 (14) T-cell lymphoma 4/152 (3) Angio-immunoblastic T-cell lymphoma (EBV+) 2/152 (1) Peripheral T-cell lymphoma Not Otherwise Specified 1/152 (1) Associated * 1/1 (100) HTLV-associated T-cell lymphoma 1/152 (1) Associated * 1/1 (100) B-cell lymphoma 4/152 (3) Diffuse large B-cell lymphoma 2/152 (1) Burkitt’s lymphoma 1/152 (1) Plasmablastic lymphoma (EBV+) 1/152 (1) Castleman disease 2/152 (1)  Solid tumor metastasis (primitive site)  9/152 (6) Breast 2/152 (2) Digestive tract † 3/152 (2) Pelvis ‡ 2/152 (4) Larynx 1/152 (1) Melanoma 1/152 (1)  Kaposi sarcoma  2/152 (1) Associated * 1/2 (50)  Non-tuberculous mycobacteria  8/152 (5) MAC 6/152 (4) Associated * 1/6 (17) Non-identified mycobacteria 2/152 (1) Associated * 1/2 (50)  Cryptococcosis  2/152 (1)  Other inflammation  11/152 (7) Non-specific adenitis 9/152 (6) Necrotic adenitis 1/152 (1) Epithelioid and giant cell granuloma without necrosis 1/152 (1)  Normal  7/152 (5)  Multiple associated causes  9/152 (6)  Associated IRIS  §  6/152 (4) Abbreviations: EBV: Epstein–Barr virus; HTLV: Human T-Lymphotropic Virus; IRIS: Immune Reconstitution Inflammatory Syndrome; LPD: Lymphoproliferative Disorder; MAC: Mycobaterium Avium *Associated diagnosis concerning lymph node’s involvement; †1 independent cell gastric carcinoma, 2 Lieberkuhnian carcinoma of the colon; ‡1 epidermoid endometrial carcinoma, 1 epidermoid carcinoma of the penis; §3 tuberculosis, 1 non-tuberculous mycobacteria and histoplasmosis, 1 MAC, 1 histoplasmosis. Microbiological and pathological diagnosis In case of histoplasmosis or tuberculosis, diagnosis was mainly made by culture (75% (21/28) and 65% (15/23)) or CHE (77% (23/30) and 59% (17/29)) ( Table 3 10.1371/journal.pntd.0013558.t003 Table 3 Diagnostic tools in case of infectious disease (including patients presenting several concomitant causes of lymphadenopathy) (No/Total (%)). Lymph node analysis Histoplasmosis Tuberculosis NTM Cryptococcosis (n = 2) Positive direct examination 9/28 (32) 11/23 (48) 4/5 (80) 0/2 (0) Positive culture 21/28 (75) 15/23 (65) 2/4 (50) 0/2 (0) Positive PCR 4/7 (57) 5/7 (71) 0/2 (0) NA Presence of yeasts or acid-fast bacilli on CHE 23/30 (77) 17/29 (59) 5/7 (71) 2/2 (100) Abbreviations: CHE: Cytological and Histological Exam; NA: Not applicable; NTM: Non-tuberculous mycobacteria. Epithelioid cells, granuloma and necrosis were found respectively in case of tuberculosis in 69% (22/32), 59% (19/32) and 78% (25/32), and in histoplasmosis in 45% (13/29), 28% (8/29) and 38% (11/29) ( S1 Table Patients with inconclusive anatomical and/or cytopathological examination were analyzed ( S2 Table Lymph nodes characteristics Among available data, lymphadenopathy was of recent onset (< 3 months) in 68% of cases, even < 1 month in 40% of cases ( Table 4 10.1371/journal.pntd.0013558.t004 Table 4 Clinical and radiological characteristics of the lymph nodes. No/Total (%) Time since onset of lymphadenopathy < 1 month 19/47 (40) [1-3 months] 13/47 (28) [3 months-1 year] 10/47 (21) > 1 year 5/47 (11) Biopsied site Superficial sites 113/132 (86) Cervical 58/132 (44) Axillary 22/132 (17) Inguinal 33/132 (25) Deep sites 19/132 (14) Spinal 2/132 (2) Epitrochlear 1/132 (1) Mediastinal 1/132 (1) Para-Aortic 3/132 (2) Mesenteric 12/132 (9) Size < 2 cm 104/121 (86) 2-5 cm 51/116 (44) > 5 cm 12/112 (11)  Radiological necrosis 23/103 (22)  Consistency of lymph node (n = 55) Soft 24/55 (44) Firm/stonelike 22/55 (40) Fluctuant 5/55 (9) Fistulized 4/55 (7)  Median number of lymph node area affected  * 4 [2-6] Arrangement in relation to the diaphragm One side 40/128 (31) Both side 88/128 (69)  Associated splenomegaly 30/98 (31)  Associated hepatomegaly 42/105 (40) *Clinical and/or radiological, bilateral involvement counting for 2 areas. Clinical and paraclinical associated data Patients presented weight loss, fever and a WHO Performance Status > 2 in 67% (80/119), 45% (62/137) and 35% (46/130) of cases, respectively ( Table 5 10.1371/journal.pntd.0013558.t005 Table 5 General clinical, radiological and biological data. No/Total (%)  General state Impaired WHO general performance status > 2 (PS > 2) * 46/130 (35) Weight loss 80/119 (67) Fever (temperature > 38.2°C) 62/137 (45)  Pulmonary abnormalities Cough 42/134 (31) Abnormal thoracic imaging † 86/106 (81) Thoracic lymphadenopathy 55/106 (52) Nodules 48/106 (45) Condensations 37/106 (35) Pleural effusion 18/106 (17)  Digestive abnormalities Abdominal pain 34/135 (25) Diarrhea 21/135 (16)  Laboratory results Hemoglobin level < 12g/dL (normal values 13–18) 110/146 (75) Neutrophil count < 1 500/mm3 (normal values 1500–7700) 36/146 (25) Platelet count < 150 G/L (normal values 150–400) 29/146 (20) C reactive protein > 50 mg/L (normal values < 5) 54/141 (38) LDH level > 400 U/L (normal values 135–225) 23/117 (20) Creatinine level > 100 µmol/L (normal values 60–100) 23/143 (16) ASAT level > 34 U/L (normal values 10–34) 62/140 (44) ALAT level > 55 U/L (normal values 10–55) 32/141 (23) Alkaline phosphatase level > 150 U/L (normal values 40–130) 31/137 (23) γ-Glutamyl transferase level > 50 U/L (normal values < 50) 75/139 (54) ß-2-microglobulin level > 2.3 mg/L (normal values 1.2-2.2) 37/40 (93) Positive galactomannan 2/16 (13) Positive histoplasmosis serology 5/44 (11) Positive ß-D-glucan 12/31 (39) Positive TB-IGRA 22/49 (45) Abbreviations: ALAT: ALanine AminoTransferase; ASAT: ASpartate AminoTransferase; LDH: Lactate DesHydrogenase; TB-IGRA: Tuberculosis Interferon Gamma Release Assay; WHO: World Health Organization. *PS > 2: confined to bed or a chair more than 50% of waking hours; †Chest X-ray and chest CT-scan. Chest imaging was abnormal in 81% and revealed: thoracic lymphadenopathy (52%), parenchymal nodules (45%) and condensations (35%). Abdominal imaging found no relevant information compared to the clinical data. Anemia (hemoglobin level < 12g/dL), neutropenia (neutrophil counts < 1 500/mm 3 Factors associated with AIDS-related opportunistic conditions Ninety-five patients (62%) presented an AIDS-defining opportunistic condition, 42 (28%) an HIV-reactive or normal lymph node, and 15 (10%) patients were excluded from the analysis (metastasis and reactive or normal lymph node with extra-ganglionic opportunistic disease) ( Table 6 Table 6 Fig 2 Table 6 Fig 3 10.1371/journal.pntd.0013558.t006 Table 6 Main abnormalities between normal or HIV-reactive lymphadenitis and opportunistic diseases. Normal or HIV-reactive lymphadenitis Opportunistic diseases * p  n 42 95 Diagnosis made by lymph node biopsy 39/42 (92.9) 88/95 (92.6) 1.000  Epidemiological data Male gender (%) 19/42 (45.2) 67/95 (70.5)  0.009 Median age [IQR] 47 [37, 54] 41 [34, 49]  0.044 Living in Cayenne and surroundings (pseudo urban) (%) 25/36 (69.4) 51/89 (57.3) 0.291 Regular declared profession (%) 6/31 (19.4) 21/72 (29.2) 0.427 Heterosexual transmission of HIV (%) 30/40 (75.0) 85/94 (90.4)  0.038 History of opportunistic (AIDS ranking) disease (%) 11/41 (26.8) 26/94 (27.7) 1.000 HTLV (%) 0.641 Positive serology (%) 2/38 (5.3) 5/80 (6.2) Positive PCR (%) 1/38 (2.6) 1/80 (1.2)  Lymph node characteristics Clinical superficial lymphadenopathy (%) 32/39 (82.1) 87/92 (94.6) 0.052 > 5 cm (%) 0/37 ( 0.0 10/80 (12.5) 0.058 [2–5] cm (%) 15/37 (40.5) 37/85 (43.5) 0.914 [1–2] cm (%) 30/39 (76.9) 66/85 (77.6) 1.000 Cervical area (%) 20/20 (100.0) 67/67 (100.0) NA Axillary area (%) 20/20 (100.0) 41/41 (100.0) NA Inguinal area (%) 22/22 (100.0) 45/46 (97.8) 1.000 Firm consistency (%) 2/11 (18.2) 15/32 (46.9) 0.186 Deep sites (visceral) (%) 13/25 (52.0) 50/70 (71.4) 0.129 Mediastinal (%) 7/25 (28.0) 36/70 (51.4) 0.074 Abdominal (%) 10/25 (40.0) 40/70 (57.1) 0.215 Necrosis (%) 1/25 (4.0) 20/67 (29.9)  0.019 Distribution on both sides of the diaphragm (%) 22/37 (59.5) 62/92 (67.4) 0.515 Hepatomegaly (%) 7/31 (22.6) 40/81 (49.4)  0.018 Splenomegaly (%) 7/31 (22.6) 35/81 (43.2) 0.072  Clinical and radiographical presentation Performans Status > 2 (%) 3/35 (8.6) 16/83 (19.3) 0.242 Weight loss (%) 14/32 (43.8) 57/76 (75.0)  0.004 Fever (> 38.2°C) (%) 7/35 (18.9) 50/86 (58.1)  < 0.001 Respiratory signs and symptoms (%) 10/36 (27.8) 48/87 (55.2)  0.010 Cough (%) 6/36 (16.7) 33/87 (37.9)  0.036 Thoracic nodules (chest X-ray and/or CT-scan) (%) 8/25 (32.0) 32/76 (42.1) 0.509 Digestive signs and symptoms (%) 12/37 (32.4) 42/87 (48.3) 0.153 Diarrhea (%) 2/37 (5.4) 19/86 (22.1)  0.046 Neurological signs and symptoms (%) 10/37 (27.0) 19/86 (22.1) 0.719 Cutaneous signs † 4/36 (11.1) 25/86 (29.1) 0.058 Oral mucosal lesions ‡ 1/36 (2.8) 23/86 (26.7)  0.005  Laboratory results Median CD4 cell count (/mm3) [IQR] 327 [217, 468] 115 [36, 273]  < 0.001 CD4 cell count < 200/mm3 (%) 9/40 (22.5) 60/92 (65.2)  < 0.001 Median CD8 cell count (/mm3) [IQR] 952 [636, 1284] 588 [210, 956]  0.001 Median viral load (log10 copies/ml) [IQR] 3.6 [1.7, 4.8] 4.9 [2.9, 5.7]  0.002 Median hemoglobin level (g/dl) [IQR] 11.8 [10.3, 13.0] 10.1 [8.6, 11.5]  0.001 Median platelets count (G/L) [IQR] 246 [196, 301] 213 [170, 310] 0.494 Median neutrophils count (/mm3) [IQR] 2310 [1380, 3290] 2760 [1480, 4570] 0.176 Median albumin level (g/l) [IQR] 32.6 [29.3, 36.1] 28.0 [21.9, 33.5]  0.011 Median ASAT level (UI/L) [IQR] 24 [21, 30] 39 [25, 58]  0.001 Median ALAT level (UI/L) [IQR] 18 [12, 28] 23 [16, 37]  0.048 Median γ-Glutamyl transferase level (UI/L) [IQR] 33 [22, 78] 74 [37, 134]  0.002 Median Alkaline phosphatase level (UI/L) [IQR] 85 [65, 125] 110 [75, 162] 0.068 Median C reactive protein level (mg/L) [IQR] 10 [4, 42] 39 [11, 91]  0.005 Median LDH level (UI/L) [IQR] 230 [209, 301] 281 [225, 395] 0.076 Abbreviations: ALAT: ALanine AminoTransferase; ASAT: ASpartate AminoTransferase; FNA: Fine Needle Aspiration; HTLV: Human T-Lymphotropic Virus; IQR: interquartile ranges; LDH: Lactate DesHydrogenase; PCR: Polymerase Chain Reaction. *Histoplasmosis, tuberculosis and other mycobacterial infections, cryptococcosis, Kaposi sarcoma, lymphoproliferative disorder; †Mainly composed of prurigo and herpetic lesions; ‡Mainly composed of oral candidiasis. 10.1371/journal.pntd.0013558.g002 Fig 2 Forest plot synthetizing the multivariate analysis of main abnormalities orienting to an opportunistic cause. 10.1371/journal.pntd.0013558.g003 Fig 3 Boxplot of CD4 count according to whether the patient presented an opportunistic disease or not. There did not appear to be differences in terms of positive indirect tests (tuberculosis Interferon Gamma Release Assay, Histoplasma serology, galactomannan antigen, ß-D-glucan, ß-2-microglobulin) between the HIV-reactive, tuberculosis, histoplasmosis, lymphoma or metastasis groups ( S3 Table Discussion We found that AIDS-defining opportunistic infections were responsible for 53% of lymphadenopathy, when lymphoproliferative disorders were responsible for 11% of cases. In the Amazon area, a similar study conducted among 120 patients in Colombia, found tuberculosis (48%) and reactive lymphadenitis (33%) as the main etiologies of lymph nodes enlargement [ 13 14 15 16 We found a low number of AIDS-associated Kaposi sarcoma, when it is described as a classical cause of lymphadenopathy in an autopsy series [ 17 Almost half of patients presented with lung nodules, without significant difference between patients with benign or opportunistic diseases. Their presence, as much as positive indirect markers such as tuberculosis Interferon Gamma Release Assay, Histoplasma 18 19 20 21 Granuloma with caseous necrosis and multinuclear giant cell, generally described in tuberculosis [ 22 23 24 Main factors associated with an opportunistic cause were fever, weight loss, presence of a lymph node > 5 cm and CD4 cell count < 200/mm3. In the literature, larger lymph node size was already described as a predictive factor for non-reactive causes [ 2 25 26 2 13 2 13 This study contains selection biases since patients were selected based on pathology’s samples rather than clinical presentation. Hence, lymph nodes of lower sizes without general signs were less likely to be addressed and sampled. Patients were not comparable over the inclusion period since before 2016, no systematic antiretroviral treatment was recommended in our territory in asymptomatic patients with CD4 cell counts > 500/mm 3 10 11 While analyzing the etiologies of lymphadenopathy in PLHIV, tuberculosis endemicity in the region studied should be a major factor to consider. In countries where it is highly endemic such as India [ 27 28 29 2 In conclusion, in French Guiana, the main etiologies of lymphadenopathy in PLHIV were opportunistic infections with histoplasmosis and tuberculosis being the main etiologies over HIV-reactive lymphadenitis. Histoplasmosis, already known as the first AIDS-defining condition in our territory was also the first etiology of lymphadenopathy in PLHIV. We do not believe that the presence of lung nodules or positive indirect markers for tuberculosis or histoplasmosis is relevant to guide diagnosis in immunosuppressed patients in the Amazons, where both infections are endemic with high risk of former asymptomatic exposure. In the presence of lymphadenopathy in these patients, low CD4 count and lymph nodes > 5 cm should quickly lead to lymph node biopsy in search for associated opportunistic infections or lymphoproliferative disorders. Supporting information S1 Table Anatomical and cytological characteristics of fine needle aspirations and biopsies (after exclusion of patients presenting several causes of lymphadenopathy and/or extra lymphatic infection). (DOCX) S2 Table Patients with inconclusive anatomical and/or cytopathological examination. (DOCX) S3 Table Comparative data between the 5 main etiological groups (after exclusion of patients with multiple diagnoses). (DOCX) References 1 Dimopoulos Y, Moysi E, Petrovas C. The lymph node in HIV pathogenesis. 2017 Aug;14(4):133–40. 10.1007/s11904-017-0359-7 28685417 2 Bogoch II Andrews JR Nagami EH Rivera AM Gandhi RT Stone D Clinical predictors for the aetiology of peripheral lymphadenopathy in HIV-infected adults HIV Med 2013 14 3 182 6 doi: 10.1111/j.1468-1293.2012.01035.x 22805116 PMC3562378 3 Glushko T He L McNamee W Babu AS Simpson SA HIV Lymphadenopathy: Differential Diagnosis and Important Imaging Features AJR Am J Roentgenol 2021 216 2 526 33 doi: 10.2214/AJR.19.22334 33325733 4 Epelboin L Abboudd P Abdelmoumen K About F Adenis A Blaise T et al Panorama des pathologies infectieuses et non infectieuses de Guyane en 2022 MTSI 2023 3 1 10.48327/mtsi.v3i1.2023.308 37389381 PMC10300792 5 Nacher M Ouedraogo E Succo T Guarmit B Djossou F Stettler L et al L’infection VIH en Guyane, revue historique et tendances actuelles Bull Epidémiologique Hébdomadaire 2020 43 51 6 Grabar S Le Moing V Goujard C Leport C Kazatchkine MD Costagliola D et al Clinical outcome of patients with HIV-1 infection according to immunologic and virologic response after 6 months of highly active antiretroviral therapy Ann Intern Med 2000 133 6 401 10 doi: 10.7326/0003-4819-133-6-200009190-00007 10975957 7 Solal-Céligny P Roy P Colombat P White J Armitage JO Arranz-Saez R et al Follicular lymphoma international prognostic index Blood 2004 104 5 1258 65 doi: 10.1182/blood-2003-12-4434 15126323 8 Dittmer DP Damania B Comprehensive L Hill C Kaposi sarcoma associated herpesvirus (KSHV) associated disease in the AIDS patient: an update Cancer Treat Res 2020 919 10.1007/978-3-030-03502-0_3 PMC7201581 30523621 9 Dalgleish AG Kaposi’s sarcoma British J Cancer 1991 64 3 6 10.1038/bjc.1991.229 1854625 PMC1977307 10 Rapport Morlat 2013 [Internet]. Available from: https://sante.gouv.fr/IMG/pdf/Rapport_Morlat_2013_Mise_en_ligne.pdf 11 Actualisation Rapport Morlat 2016 [Internet]. Available from: https://cns.sante.fr/wp-content/uploads/2016/10/ExpertsVIH_SFLS_07-10-2016.pdf 12 Melzani A de Reynal de Saint Michel R Ntab B Djossou F Epelboin L Nacher M et al Incidence and Trends in Immune Reconstitution Inflammatory Syndrome Associated With Histoplasma capsulatum Among People Living With Human Immunodeficiency Virus: A 20-Year Case Series and Literature Review Clin Infect Dis 2020 70 4 643 52 doi: 10.1093/cid/ciz247 30921453 13 Rodríguez-Vega F Botero M Cortés JA Tobón Á Hallazgos patológicos en adenopatías de pacientes con infección por HIV Biomedica 2017 37 1 79 85 10.7705/biomedica.v37i1.3293 28527251 14 Carina Guedes Ramos LZG Biopsy of peripheral lymph nodes: a useful tool to diagnose opportunistic diseases in HIV-infected patients Trop Doct 2011 2011 26 7 10.1258/td.2010.100145 20940291 15 Adenis AA Valdes A Cropet C McCotter OZ Derado G Couppie P et al Burden of HIV-associated histoplasmosis compared with tuberculosis in Latin America: a modelling study Lancet Infect Dis 2018 18 10 1150 9 doi: 10.1016/S1473-3099(18)30354-2 30146320 PMC6746313 16 Falci DR Monteiro AA Braz Caurio CF Magalhães TCO Xavier MO Basso RP et al Histoplasmosis, An Underdiagnosed Disease Affecting People Living With HIV/AIDS in Brazil: Results of a Multicenter Prospective Cohort Study Using Both Classical Mycology Tests and Histoplasma Urine Antigen Detection Open Forum Infect Dis 2019 6 4 doi: 10.1093/ofid/ofz073 30997365 PMC6461557 17 Niedt GW Schinella RA Acquired immunodeficiency syndrome. Clinicopathologic study of 56 autopsies. Arch Pathol Lab Med 1985 109 8 727 34 2990378 18 Swan F Jr Velasquez WS Tucker S Redman JR Rodriguez MA McLaughlin P et al A new serologic staging system for large-cell lymphomas based on initial beta 2-microglobulin and lactate dehydrogenase levels J Clin Oncol 1989 7 10 1518 27 doi: 10.1200/JCO.1989.7.10.1518 2674337 19 Shang Y Fu X Chang Y Li Y Zhang M B2 microglobulin is a novel prognostic marker of Angioimmunoblastic T-cell lymphoma Sci Rep 2018 8 1 12907 doi: 10.1038/s41598-018-31212-z 30150635 PMC6110724 20 Rezza G Titti F Pezzotti P Sernicola L Lo Caputo S Angarano G et al Anti-nef antibodies and other predictors of disease progression in HIV-1 seropositive injecting drug users J Biol Regul Homeost Agents 1992 6 1 15 20 1359736 21 Ellaurie M Rubinstein A Beta-2-microglobulin concentrations in pediatric human immunodeficiency virus infection Pediatr Infect Dis J 1990 9 11 807 9 doi: 10.1097/00006454-199011000-00005 2263429 22 Yang J-S Du Z-X Comparison of clinical and pathological features of lymph node tuberculosis and histiocytic necrotizing lymphadenitis J Infect Dev Ctries 2019 13 8 706 13 doi: 10.3855/jidc.10860 32069254 23 Hage CA Wheat LJ Azar MM Bahr N Loyd J Histoplasmosis: Up-to-Date Evidence-Based Approach to Diagnosis and Management Semin Respir Crit Care Med 2015 1 212 10.1055/s-0035-1562899 26398539 24 Nacher M Valdes A Adenis A Blaizot R Ugo F Abboud P et al Review of diagnostic methods and results for HIV-associated disseminated histoplasmosis: Pathologists are not sufficiently involved Trop Med Int Health 2021 26 11 1462 9 doi: 10.1111/tmi.13663 34310800 25 Chen D Zhu Y Chen Y Zhu D Liu Z Li T et al Clinical features and 18F-FDG PET/CT for distinguishing of malignant lymphoma from inflammatory lymphadenopathy in HIV-infected patients BMC Infect Dis 2022 22 1 10.1186/s12879-022-07640-8 35896979 PMC9327211 26 Shapiro AL, Pincus RL, York N, York N. Fine-needle aspiration of diffuse cervical lymphadenopathy in patients with acquired immunodeficiency syndrome 1991 419 21 10.1177/019459989110500312 1945429 27 Gill PS Arora DR Arora B Gill M Gautam V Karan J et al Lymphadenopathy--An Important Guiding Tool for Detecting Hidden HIV-Positive Cases: A 6-Year Study J Int Assoc Physicians AIDS Care (Chic) 2007 6 4 269 72 doi: 10.1177/1545109707304298 17873248 28 Sun L, Zhang L, Yang K, Chen X, Chen J, Xiao J, et al Analysis of the causes of cervical lymphadenopathy using fine-needle aspiration cytology combining cell block in Chinese patients with and without HIV infection 2020 1 10 10.1186/s12879-020-4951-x 32171271 PMC7071630 29 Vogt SL Maloma L Xian RR Ambinder RF Philip V Patel M et al Significance of lymph node fine needle aspiration for the diagnosis of HIV-associated lymphoma in a low-resource setting AIDS 2022 36 10 1393 98 10.1097/QAD.0000000000003261 35466960 PMC9329253 ",
  "metadata": {
    "Title of this paper": "Significance of lymph node fine needle aspiration for the diagnosis of HIV-associated lymphoma in a low-resource setting",
    "Journal it was published in:": "PLOS Neglected Tropical Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478962/"
  }
}