{
  "title": "Paper_1080",
  "abstract": "pmc Drug Des Devel Ther Drug Des Devel Ther 958 dddt dddt Drug Design, Development and Therapy 1177-8881 Dove Press PMC12478223 PMC12478223.1 12478223 12478223 41030779 10.2147/DDDT.S536873 536873 1 Review Safety of Remimazolam in Vulnerable Populations Ge et al Ge et al Ge Jia-Yi 1 * http://orcid.org/0009-0002-6361-917X Deng Bo-Ran 1 * Cao Xiao-Hua 1 Liu Xing-Jun 1 1 School of Pharmacy, Nantong University Nantong Jiangsu 226019 People’s Republic of China Correspondence: Xing-Jun Liu, School of Pharmacy, Nantong University No. 9 Se Yuan Road Nantong Jiangsu People’s Republic of China +86-0513-5500-3425 * These authors contributed equally to this work 25 9 2025 2025 19 478870 8691 8709 26 4 2025 14 9 2025 25 09 2025 30 09 2025 01 10 2025 © 2025 Ge et al. 2025 Ge et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Abstract Vulnerable populations require careful consideration in drug selection due to their unique physiological conditions. Remimazolam, an innovative ultra-short-acting benzodiazepine, presents several advantages, including rapid onset, brief duration of action, and high predictability. Despite the extensive literature on remimazolam, few studies have specifically evaluated its safety in vulnerable patient populations. This review offers a comprehensive analysis of the safety profile of remimazolam in vulnerable populations, including cardiovascular diseases, neurological disorders, hepatic and renal dysfunction, respiratory conditions, metabolic disorders, rare diseases, and special groups such as the elderly and pediatric patients. It assesses recovery outcomes, hemodynamic stability, and adverse events such as respiratory depression and delirium. In our view, the prophylactic potential of remimazolam in these aspects may not be inferior to traditional anesthetic drugs (propofol, sevoflurane, etomidate, etc). and shows a trend of surpassing them in some aspects. Keywords hemodynamic stability recovery outcomes respiratory depression delirium pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction In the medical field, “vulnerable population” typically refers to groups that experience significant disadvantages in accessing healthcare services and facing disease risks, or achieving positive medical outcomes due to a confluence of physiological, psychological, social, or systemic healthcare factors. According to World Health Organization (WHO) statistics, patients with conditions such as heart disease, diabetes, and chronic lung disease account for 74% of global deaths. 1 2 3 4 5 Propofol, sevoflurane, and etomidate are widely used anesthetics in clinical practice, with well-established efficacy and safety profiles. The recent introduction of remimazolam has further expanded the horizons of anesthesiology, offering a novel therapeutic option. As a novel ultra-short-acting benzodiazepine, remimazolam has gained considerable acclaim among anesthesiologists since its approval for use in numerous countries worldwide in 2020. It has advantages like rapid onset, brief duration of action, and high predictability. Meta-analyses suggested that remimazolam may serve as an excellent alternative to propofol and demonstrates more stable hemodynamics, reduced incidence of respiratory depression and a lower rate of injection pain. Moreover, the occurrence of nausea and vomiting is comparable between the two agents. However, remimazolam takes relatively longer to induce loss of consciousness. 6 Currently, remimazolam has been applied in a diverse array of vulnerable populations, including individuals with cardiovascular diseases, neurological disorders, psychiatric conditions, hepatic and renal impairments, respiratory ailments, rare diseases, obesity, as well as the elderly and pediatric patients. Nonetheless, existing reviews, both domestically and internationally, predominantly approach these populations through the perspectives of surgical interventions and fail to provide a focused summary of the safety profile of remimazolam for these groups. This review synthesizes evidence on the safety of remimazolam in vulnerable populations, with focused evaluation of recovery profiles, hemodynamic stability, and critical adverse events including respiratory depression and delirium, to guide evidence-based clinical decision-making ( Table 1 Figure 1 Table 1 Clinical Summary of Remimazolam Use in Vulnerable Populations Categories Recommended Dosage Key Advantages Precautions Evidence Strength Cardiovascular Diseases Induction 6 mg/kg/h; More stable hemodynamics; less hypotension; faster emergence Insufficient data for NYHA IV; vigilance for hypotension during induction Moderate to High Neurological Disorders Induction 6–12 mg/kg/h; Reduced intraoperative hypotension; faster emergence; no increased POD risk High concentrations may induce neuronal apoptosis; caution with flumazenil in epileptic patients due to potential seizures Moderate Liver Dysfunction Child-Pugh A: Induction 0.2 mg/kg; maintenance ≤2 mg/kg/h (B/C: reduced) Stable hemodynamics in Child-Pugh A; faster emergence than propofol Limited data for Child-Pugh B/C; possible delayed emergence Low to Moderate Renal Dysfunction No adjustment needed No impact on emergence; no exacerbation of renal injury Insufficient data for non-renal surgeries Moderate Respiratory Diseases Induction 0.2 mg/kg; Less respiratory depression in compensated patients (vs propofol/dexmedetomidine) Avoid in decompensated stages; lack of data for long-term intubation Moderate Obesity 1.0–2.0 mg/kg/h Fewer cardiovascular/respiratory adverse events than dexmedetomidine Need to monitor cardiopulmonary function Low Rare Diseases Start with a low dose and gradually increase No severe adverse reactions reported Based solely on case reports; extremely small sample size Very Low Pediatric Patients Induction 12 mg/kg/h Faster emergence; less POD; reduced risks with combination therapy High doses may affect short-term memory; significant mucosal irritation with intranasal administration Moderate Elderly Patients 60-69 years: 0.12 mg/kg; Stable hemodynamics; less hypotension/respiratory depression; faster early cognitive recovery High incidence of hypotension in patients over 80; inconsistent findings on POD/POCD Moderate to High Critically Ill Patients Sedation: 0.125–0.15 mg/kg/h; anesthesia: 0.2 mg/kg/h Safe for short/long-term sedation; no risk of propofol infusion syndrome High doses may affect liver/kidney function; vigilance for acute tolerance Moderate Notes Abbreviations Figure 1 Visual clinical pathway of the remimazolam in vulnerable populations. Search Strategy A systematic literature search was conducted using the keywords “remimazolam” AND (“anesthesia” OR sedation) across the following databases: Web of Science, PubMed, China National Knowledge Infrastructure and Wanfang Database. The search was limited to articles published in the past five years. Inclusion criteria were defined as follows: Study Type: Clinical trials OR case reports. Study Population: Patients meeting at least one of the following criteria: Diagnosed with any systemic disease (eg, cardiovascular, cerebrovascular, respiratory, hepatic, renal, metabolic); Aged < 18 years (pediatric population); Aged ≥ 60 years (geriatric population); Critically ill. Intervention: Administration of remimazolam as part of the anesthetic regimen. Outcome Measures: Reporting of at least one of the following: blood pressure, heart rate, respiratory parameters (eg, respiratory rate, oxygen saturation, apnea), postoperative delirium (POD), emergence time, and postoperative nausea and vomiting (PONV). Following the initial search and application of inclusion/exclusion criteria, the included studies were categorized into predefined subgroups based on patient characteristics (eg, specific systemic diseases, pediatric, geriatric) and study design. Pharmacological Characteristics Pharmacodynamics Remimazolam is a benzodiazepine that exerts its primary effects through high-affinity binding to gamma-aminobutyric acid (GABA) receptors. Upon activation of GABAA receptors, a pronounced influx of chloride ions occurs, leading to neuronal membrane hyperpolarization and reduced neuronal excitability. The mechanism facilitates various effects like sedation, anterograde amnesia, and anticonvulsant properties. 17 18 19 20 Pharmacokinetics A standout pharmacological characteristic of remimazolam is its rapid clearance. Firstly, its volume of distribution at steady-state (Vdss) is approximately 35 L, which is merely one-tenth that of propofol. It suggests that there is minimal drug accumulation in the body during administration and results in a reduced quantity that requires elimination post-discontinuation. 21 22 20 Safety of Remimazolam in Various Diseases Cardiovascular Diseases Remimazolam provides relatively stable hemodynamics and a reduced incidence of respiratory depression for patients with cardiovascular diseases, particularly in critically ill individuals, while ensuring adequate sedation and anesthesia levels during surgical procedures. Besides, it may assist in mitigating the occurrence of POCD and delirium. 23 24 25 26 Patients with hypertension may experience substantial fluctuations in blood pressure during anesthesia due to factors such as diminished vascular elasticity and organ impairment of the heart and kidneys. One study showed that in patients with well-controlled hypertension for over six months, the use of remimazolam, in comparison to propofol, was associated with a reduced incidence of intraoperative hypotension (37.5% vs 64.6%, P P P 27 28 The anesthetic risks associated with valvular disease are particularly pronounced during the induction phase, which is highly susceptible to various malignant hemodynamic fluctuations. Research showed that remimazolam provides superior hemodynamic stability during the induction phase of valve replacement surgery in patients with severe heart valve disease, particularly when compared to etomidate and propofol. 29 30 31 32 P 33 P 34 In patients with severe coronary artery disease, the anesthetic induction phase poses a significant risk of myocardial ischemia or even acute myocardial infarction due to hypotension. Researchers conducted a comparative study on the safety of an anesthesia regimen utilizing remimazolam alongside propofol and sevoflurane in patients undergoing coronary artery bypass grafting for severe coronary heart disease. 35 P P In summary, in patients with cardiovascular comorbidities, remimazolam demonstrates superior hemodynamic stability compared to propofol and sevoflurane, significantly reducing the incidence of major adverse cardiovascular events.remimazolam demonstrates a commendable safety profile in patients with cardiovascular diseases and indicates promising prospects for clinical application. Nonetheless, the existing studies are marked by significant limitations. Firstly, investigations into emergency surgeries in patients with poorly controlled hypertension have yet to be explored. Secondly, clinical studies focusing on individuals with severe coronary artery disease remain scarce. Thirdly, there is a notable absence of research concerning patients with congenital heart disease who do not present with Eisenmenger syndrome. Fourthly, the lack of clinical controlled studies on Recommendations 1: For patients with hypertension/valvular heart disease: the induction dose is 6 mg/kg/h, and the maintenance dose is 0.3–0.7 mg/kg/h; Be vigilant about the risk of hypotension during the induction phase in patients with severe coronary heart disease, and have vasoactive drugs ready. Rare cardiovascular conditions is likely attributable to challenges in sourcing adequate samples. As patients with diverse cardiovascular ailments continues to rise, future research in these areas may reveal superior clinical treatment strategies and propel advancements in the field of anesthesiology. Neurological Disorders Research concerning the neuroprotective and toxic effects of remimazolam remains notably limited. Some studies indicate that remimazolam may mitigate neuronal damage, neurological dysfunction, and cerebral infarction size after ischemia/reperfusion injury by inhibiting NLRP3 inflammasome-dependent pyroptosis. 36 37 38 Cerebrovascular diseases can induce significant alterations in cerebral blood flow and its regional distribution, rendering precise blood pressure management during anesthesia critically imperative. Monitoring results from a study involving 65 patients with moyamoya disease undergoing cerebral vascular bypass surgery indicated that the administration of remimazolam significantly diminished both the incidence (73.5% vs 38.7%) and duration (7.5 vs 0 minutes) of intraoperative hypotension when compared to propofol. Furthermore, the remimazolam cohort required lower doses of deoxyepinephrine. 39 40 41 Moreover, a study examining patients with intracranial aneurysms and cerebrovascular malformations revealed that remimazolam was associated with a shorter emergence time compared to propofol [16.1 (10.4) min in the remimazolam group vs 19.0 (11.2) min in the propofol group. The group difference was − 2.9 min (95% CI −6.5, 0.7)( P P P 42 P P 43 Patients with epilepsy may face an elevated risk of seizure activity in the postoperative period due to the effects of flumazenil reversal. In a comprehensive retrospective study involving 19,105 patients, researchers analyzed 12,033 patients who received remimazolam-flumazenil total intravenous anesthesia alongside 432,275 patients administered propofol. 44 45 Due to potential abnormalities in neurological function and structure, as well as variations in neurotransmitter levels, receptor activity, and hepatic enzyme function, there can be substantial modifications in the pharmacodynamics and pharmacokinetics of medications administered to patients with intellectual disabilities. Currently, there is only one small-sample study addressing patients with intellectual disabilities. 46 P P P In patients with neurological comorbidities, remimazolam exhibits a favorable safety profile characterized by rapid emergence, hemodynamic stability, and enhanced recovery quality—particularly when combined with flumazenil antagonism—without increasing the risk of neurological adverse events. At present, investigations into remimazolam concerning neurological diseases are predominantly confined to the realm of cerebrovascular disorders, with limited number of studies available. One research team is conducting a comparative analysis of remimazolam versus propofol for anesthesia in patients undergoing thrombectomy for ischemic stroke, with the objective of assessing both its safety and its implications for patient prognosis. Furthermore, some researchers are preparing to explore the effects of remimazolam on POD in individuals with neurovascular conditions. However, there is a significant gap in research regarding the exacerbation of postoperative psychiatric symptoms in patients with schizophrenia, the impact of intracranial pressure in those with intracranial tumors, and the safety profiles for patients experiencing emergency intracranial hemorrhage. Advancements in this area of research could potentially yield substantial benefits for these populations. Recommendations 2: For patients with cerebrovascular diseases: remimazolam is administered at 6–12 mg/kg/h (adjusted according to age) during the induction phase of general anesthesia, with a maintenance dose of 1–2 mg/kg/h; For patients with epilepsy: vigilance is required regarding the potential risk of convulsions when using flumazenil for antagonism (though the incidence is low); For patients with intellectual disabilities: continuous infusion of remimazolam (1.0–2.0 mg/kg/h) may be switched to at the end of operation. Liver Disease Common liver diseases include viral hepatitis, alcoholic liver disease, and autoimmune liver disease. Regardless of the specific type, liver function is invariably compromised to varying extents. Anesthesiologists concentrate on two primary considerations. Liver dysfunction significantly impacts the metabolism of anesthetic agents while these anesthetic drugs may further exacerbate the already impaired liver function. A pharmacokinetic study involving patients with liver impairment discovered that while the maximum blood concentration of remimazolam remains unchanged following intravenous administration, the clearance rate in individuals with severe liver dysfunction decreased by 38.1%. Consequently, the time to recovery was doubled compared to healthy subjects (16.7 minutes vs 8.0 minutes). 47 Currently, research regarding the application of remimazolam in patients with liver disease remains sparse. One clinical study previously compared the safety profiles of remimazolam and propofol in patients with cirrhosis undergoing endoscopic variceal ligation. 48 49 As liver disease progresses, patients exhibit worsening Child-Pugh classification. Current evidence indicates that remimazolam demonstrates an acceptable safety profile in Child-Pugh A patients, with preserved hemodynamic stability, minimal respiratory depression, and predictable emergence time. However, for Child-Pugh B/C patients, the absence of large-scale randomized trials necessitates cautious clinical application, where flumazenil antagonism may provide therapeutic benefit. These findings underscore the limited clinical research on the use of remimazolam in patients with liver disease. Future investigations can examine the emergence times and recovery quality for these individuals and explore the occurrence of postoperative complications. Recommendations 3: Child-Pugh A: Remimazolam can be used at standard doses (0.2 mg/kg for induction; maximum allowable infusion rate during the maintenance phase: 2 mg/kg/h), with a favorable safety profile (stable hemodynamics, minimal respiratory depression, and predictable recovery time); Child-Pugh B/C: Caution is advised! Clearance is significantly reduced, leading to delayed recovery. Dose reduction is recommended, and consideration should be given to antagonism with flumazenil to accelerate recovery. Closely monitor recovery time. Kidney Disease Patients suffering from various forms of kidney disease frequently exhibit differing degrees of renal dysfunction, which can result in a delay in the excretion of drug metabolites. Conversely, anesthetic agents may indirectly compromise residual kidney function by impacting hemodynamics. Because the metabolites of remimazolam are largely inactive, and the plasma clearance rate in individuals with renal impairment is comparable to that of healthy subjects, the emergence time does not seem to be adversely affected. 48 50 A research team conducted a randomized controlled trial on 113 patients with end-stage renal disease undergoing kidney transplantation. 51 P Despite the limited research data on the use of remimazolam in patients with kidney disease, both pharmacological models and extant clinical evidence indicate that remimazolam stabilizes hemodynamic parameters, demonstrates no observed deterioration in renal function, and accelerates emergence time—even without flumazenil reversal. Future investigations could focus on exploring the efficacy and safety of remimazolam in patients with renal impairment undergoing non-renal surgical procedures. Recommendations 4: Its metabolites are inactive, and pharmacokinetics are not significantly affected. Hemodynamics remain stable, with rapid recovery (even without flumazenil), so it can be used safely. Respiratory System Diseases Patients afflicted with respiratory system diseases exhibit markedly heightened sensitivity to the respiratory depressant effects of anesthetic agents due to obstructive or restrictive ventilatory dysfunction. Previous studies have validated the efficacy and safety of remimazolam in patients classified as ASA I to III undergoing bronchoscopy, and demonstrated faster emergence times in comparison to midazolam. 52 53 P 54 P 55 The aforementioned clinical studies were confined to patients whose respiratory function remained within compensatory limits, all undergoing non-intubated general anesthesia. The current evidence suggests that in patients with compensated respiratory diseases, remimazolam demonstrates non-inferiority to propofol and midazolam regarding hemodynamic stability and reduction of respiratory depression rates. However, insufficient data preclude definitive conclusions about its safety superiority over dexmedetomidine in this population. It remains uncertain whether remimazolam can ensure adequate safety in patients whose respiratory function is decompensated despite preoperative respiratory interventions. Moreover, there is currently a notable absence of relevant reports or studies addressing patients with respiratory diseases undergoing prolonged intubated general anesthesia. This is particularly pertinent in scenarios involving acute exacerbations requiring emergency surgery, or in cases such as lung cancer patients undergoing total lung resection, where postoperative repercussions on respiratory function are substantial. Recommendations 5: For patients with compensated respiratory function undergoing non-intubated anesthesia, remimazolam may be considered; co-administration with alfentanil is preferable, and close monitoring of respiratory and circulatory status is required; For patients with decompensated respiratory function despite interventions, it is not recommended temporarily; For patients requiring prolonged intubated anesthesia, blind use should be avoided due to limited research; priority should be given to other regimens with enhanced monitoring. Metabolic Diseases Metabolic diseases commonly refer to diabetes, hyperlipidemia, gout, hyperthyroidism, and obesity. To date, there’s only one study primarily focused on the safety of remimazolam in obese patients. Obese patients commonly present with a range of pathophysiological alterations in the cardiovascular and respiratory systems. The study included 60 obese individuals classified as ASA I and II undergoing gastrointestinal surgery and revealed that the incidence of postoperative adverse reactions, such as nausea, vomiting, sinus bradycardia, hypotension, and respiratory apnea, was 13.33% for remimazolam compared to 36.67% for dexmedetomidine. 56 Furthermore, several clinicians documented two cases in which remimazolam was employed for awake craniotomy in obese patients. Utilizing a pharmacokinetic simulation system, both patients experienced no intraoperative complications. In addition, another physician reported a case involving a patient with a BMI of 44.8 kg/m² undergoing an analgesic gastroscopy. Although the patient’s oxygen saturation temporarily fell to 92% on two occasions during the procedure, straightforward interventions effectively restored it to normal levels. Lastly, a case report concerning a patient with a BMI of 60.6 kg/m² undergoing bariatric surgery highlighted that induction with remimazolam resulted in exceptionally stable hemodynamics. Available evidence suggests that remimazolam may reduce the incidence of cardiovascular and respiratory adverse events in obese patients; However, the current quantity and quality of evidence are insufficient. But researchers are in the process of preparing safety trials to evaluate the use of remimazolam, either in conjunction with or independent of opioid analgesics, for analgesic gastrointestinal endoscopy. Moreover, there is a notable absence of large-scale studies investigating postoperative respiratory and hemodynamic outcomes in patients undergoing intubated general anesthesia. Additionally, research into the alterations in cardiac function following surgery in this demographic is similarly lacking. Therefore, undertaking studies in these domains would substantially enhance the assessment of remimazolam’s safety profile. Recommendations 6: Due to insufficient evidence, caution is advised when using remimazolam in obese patients. Dosage should be individually adjusted based on the patient’s specific conditions; if conditions permit, consideration may be given to using pharmacokinetic simulation methods; Throughout the procedure, close monitoring of respiratory function and hemodynamic indicators is required, especially in patients with extreme obesity (BMI ≥ 40 kg/m²). Rare Diseases Rare diseases are generally defined as conditions with extremely low prevalence, marked by complex clinical presentations and significant challenges in diagnosis and treatment. Notably, many of these conditions may have intricate relationships with anesthetic agents. It is rare to encounter patients requiring anesthesia for such conditions in clinical practice, thus current knowledge being largely derived from case reports. One study demonstrated that clinical doses of remimazolam do not elevate intracellular calcium concentrations in the muscle cells of patients with malignant hyperthermia, indicating that remimazolam may be safely administered to this population. 57 58 Table 2 7–16 Table 2 Main Case Report on the Application of Remimazolam in Patients with Rare Diseases Ref Disease Surgery Anesthesia Method Remimazolam Dose Outcome [ 7 Duchenne Muscular Dystrophy Orthopedic Fixation GA (TIVA) + Regional Maintenance: 1.5 µg/kg/min Stable hemodynamics, no SAEs, extubated to nasal cannula, discharged [ 8 Duchenne Muscular Dystrophy Laparoscopic Hernia Repair GA (TIVA) Induction: 3 mg; Rapid emergence (20 min), negative myoglobin, discharged [ 9 FSHD Total Laryngectomy GA (TIVA) Induction: 12 mg/kg/h; Stable hemodynamics, spontaneous eye opening in 10 min [ 10 Myotonic Dystrophy TMJ Reconstruction GA (TIVA) + Regional Induction: 10 mg/kg/h; Stable hemodynamics, rapid emergence (3 min), spontaneous respiration, discharged. [ 11 ALS Open Colectomy Sedation + Regional 1 mg/min infusion Spontaneous respiration, stable hemodynamics [ 12 ALS Tracheostomy GA (TIVA) Induction: 6 mg/kg/h; Stable hemodynamics, no emesis, ventilator settings unchanged, discharged [ 13 Mitochondrial Encephalomyopathy Cochlear Implant GA (TIVA) Induction: 0.2 mg/kg; Stable lactate, extubated in 8min, awake in 23min, mild vomiting [ 14 Mitochondrial Cardiomyopathy Transcatheter Mitral Valve Repair GA (TIVA) Induction: 4 mg/kg/h; Stable hemodynamics, awake in 16min, discharged [ 15 Immune-Mediated Necrotizing Myopathy Laparoscopic Gastrojejunostomy GA (TIVA) Induction: 10 mg/kg/h; Spontaneous respiration in 5min, rapid wakefulness, no seizures, discharged [ 16 Hereditary Angioedema Cervical Laminoplasty GA (TIVA) Induction: 6 mg/kg/h; Stable vitals, discharged Notes Abbreviations Unlike propofol, sevoflurane, and succinylcholine, no reports of serious adverse events associated with remimazolam use have been observed in multiple rare disease populations. Due to the challenges associated with conducting large-scale studies, the investigation of remimazolam’s application in patients with rare diseases is likely to remain predominantly laboratory-based. The continuous emergence of new case reports and experimental results will provide valuable insights to inform clinical medication strategies. Recommendations 7: When using remimazolam in patients with rare diseases, existing case reports can be used as a reference, especially for populations with limited accumulated cases such as those with malignant hyperthermia and neuromuscular diseases. A comprehensive preoperative evaluation is required, including the triggers of the disease, the patient’s cardiopulmonary function, and metabolic status; Intraoperative close monitoring is also necessary, such as monitoring body temperature, end-tidal CO 2 Meanwhile, targeted emergency medications (eg, dantrolene, antihistamines) should be kept ready. Special Populations Children Children are in a continuous state of development, characterized by numerous physiological differences from adults, which presents a unique array of challenges in pediatric anesthesia. Firstly, children often display irregular breathing patterns, an elevated diaphragm position, and weakened respiratory musculature, rendering them particularly vulnerable to respiratory depression, and their heightened metabolic rates and low functional residual capacity further increase their vulnerability to hypoxia. Secondly, cardiac output in this population is predominantly reliant on heart rate, and the influence of anesthetic agents on heart rate may lead to a reduction in cardiac output. Thirdly, children possess a higher proportion of body fluids, and their immature hepatic and renal functions can significantly alter drug distribution and metabolism. Lastly, the limited range of cerebral vascular autoregulation in children increases the risk of cerebral ischemia. The effective dose (ED 50 59 60 61 Anxiety Management The majority of children experience varying degrees of anxiety in the preoperative period. Prior research demonstrated that the intranasal administration of remimazolam at doses ranging from 1.09 to 1.57 ug/kg can effectively mitigate preoperative anxiety in pediatric patients. 62 63 General Anesthesia In terms of general anesthesia for children, a comprehensive cohort study was undertaken in Japan. 64 65 66 Procedural Sedation Given their immaturity in cognitive development, children often experience significant fear during various diagnostic and therapeutic procedures, leading to diminished cooperation. Pediatric patients frequently undergo procedural sedation to facilitate medical interventions. Prior studies demonstrated that in children undergoing painless gastrointestinal endoscopy, the combination of remimazolam with low doses of esketamine resulted in lower incidences of respiratory depression (9.43% vs 35.85%) and hypotension (18.89% vs 45.28%) compared to propofol. 67 68 To date, there is a considerable amount of research regarding the application of remimazolam in pediatric patients. Based on current findings, remimazolam appears suitable for pediatric general anesthesia and procedural sedation. Furthermore, its safety profile can be significantly enhanced when administered as part of a combination therapy strategy. Nonetheless, certain domains remain underexplored, particularly concerning parental apprehensions about the long-term effects of anesthetic agents on children’s memory and learning capabilities. Such studies typically require prolonged durations for completion and make them vulnerable to various confounding factors. The potential for elevated loss-to-follow-up rates further complicates their practical application. Recommendations 8: For general anesthesia - induction dose is 12 mg/kg/h, and maintenance dose is 1–2 mg/kg/h to maintain anesthesia; For painless endoscopy - 0.34 mg/kg, when used in combination with low-dose ketamine, can reduce the risk of respiratory depression and hypotension; Intranasal administration (1.09–1.57 mg/kg) is effective, but its sedative effect is inferior to that of dexmedetomidine, and it may irritate the nasal mucosa. Elderly Patients As individuals advance in age, they undergo a series of physiological declines, such as diminished cardiac and pulmonary reserves, reduced central nervous system excitability, impaired autonomic nervous system function, and alterations in body composition. These changes render elderly patients increasingly susceptible to pharmacodynamic and pharmacokinetic variations, as well as adverse events such as hemodynamic instability, respiratory depression, delirium, and cognitive impairment. To date, many studies have explored the application of remimazolam in elderly patients. Previous studies established that age serves as an independent factor influencing the dosage of remimazolam required to achieve loss of consciousness. 69 95 70 71 General Anesthesia Elderly patients make up a significant proportion of orthopedic patients for various reasons, leading to a concentrated focus on research related to general anesthesia within this demographic, particularly during orthopedic surgeries. Comparative studies between remimazolam and etomidate concluded that remimazolam induces more stable hemodynamics in elderly hypertensive patients undergoing non-cardiac surgical procedures. 72 73 74 In addition, a study proved that remimazolam may mitigate lipopolysaccharide-induced cognitive impairment via the α7nAChR-mediated Nrf2/HO-1 signaling pathway. 75 76 77 78 79 Procedural Sedation While the dosage of anesthetic agents utilized in procedural sedation is relatively modest, their impact on the vital signs of elderly patients can be considerable. Previous studies demonstrated that, in the context of sufentanil-assisted procedures, remimazolam offers stable hemodynamics (6/39 vs 17/38, P P 80 81 82 83 Based on the comprehensive findings, remimazolam demonstrates a modest reduction in the incidence of hypotension and respiratory depression compared with propofol, and is additionally beneficial for early cognitive recovery in elderly patients. Currently, investigations into the application of remimazolam among elderly patients primarily concentrate on hemodynamic stability, respiratory depression, and POD as key observational indicators. Future studies are expected to prioritize a more in-depth exploration of the long-term effects of this agent on cognitive function in elderly patients. Recommendations 9: For patients aged 60–69 years, the recommended dose is 0.12 mg/kg; for those aged 70–85 years, it is 0.09 mg/kg; Compared with propofol, it reduces hypotension and respiratory depression, but the incidence of hypotension remains relatively high in patients over 80 years old, requiring continuous monitoring; Research findings on its effects on POD and POCD are inconsistent, but it may be beneficial to early cognitive recovery. Critically Ill Patients Critically ill patients’ physiological functions are exceptionally fragile, and even minimal doses of medication can trigger significant adverse reactions and result in deteriorated prognoses and diminished survival rates. A previous meta-analysis demonstrated that remimazolam is notably safer for patients classified as ASA III–IV, compared to propofol, particularly for those with cardiovascular conditions or hemodynamic instability. 84 Invasive Ventilation Sedation Patients in the ICU need a certain level of sedation due to challenges such as difficulty weaning from mechanical ventilation, agitation, and the need for respiratory support. A Phase I drug study revealed that a continuous infusion rate of remimazolam at 0.125 to 0.150 mg/kg/h effectively satisfies the sedation requirements of postoperative non-cardiac surgery patients in the ICU, with no serious adverse events reported. 85 86 87 88 Painless Endoscopy A Phase III clinical trial revealed that in high-risk patients (ASA III–IV) undergoing painless colonoscopy, the incidence of various adverse events associated with remimazolam and midazolam did not exhibit a significant difference, but their effectiveness demonstrated a dramatic disparity (87.1% vs 13.3%). 89 General Anesthesia In an early multicenter, double-blind, randomized controlled trial involving 67 patients classified as ASA III, who were scheduled for elective surgical procedures, participants received remimazolam at infusion rates of 6 mg/kg/h (Group A) and 12 mg/kg/h (Group B) for induction. Following the loss of consciousness, a maintenance infusion at a rate of 1–2 mg/kg/h was initiated. 90 91 Moreover, certain studies pointed out the emergence of acute tolerance to remimazolam following targeted infusion in healthy volunteers. 92 Recommendations 10: A low-dose continuous infusion (0.125–0.150 mg/kg/h) can meet the requirements without serious adverse reactions; For long-term use, it can replace propofol (to avoid infusion syndrome); In high-risk endoscopic examinations, it has adverse reactions comparable to midazolam but with higher efficacy. It is recommended to start with a small dose (0.1 mg/kg/h) to optimize hemodynamics, potentially improve organ function prognosis, and avoid loading doses. Current Limitations This review assesses the safety profile of remimazolam in diverse vulnerable populations, underscoring its favorable safety and promising clinical potential across multiple clinical scenarios. Nevertheless, the current evidentiary foundation is hampered by substantial limitations: First, research in critical domains remains inadequate, with studies often characterized by small sample sizes. For instance, in the context of severe coronary artery disease (only one small-scale trial involving 20 patients), Child-Pugh class B/C liver impairment (a dearth of large-scale randomized controlled trials [RCTs]), and obesity, such inadequacies significantly compromise the quality of evidence. Critically, these small-scale studies are plagued by insufficient statistical power, meaning they lack the statistical rigor to identify clinically meaningful differences in safety outcomes—particularly for adverse events with moderate or low incidence—thereby elevating the risk of Type II errors (eg, failure to detect true effects). Second, data pertaining to rare patient populations are exclusively derived from case reports. While these reports offer valuable preliminary insights, they are inherently susceptible to selection bias (eg, reporting only successful or specific cases), reporting bias, and confounding factors, which severely undermine the reliability of causal inferences and the extrapolation of results. Third, marked heterogeneity exists in outcome metrics. This is particularly evident in the definition of key outcomes—for example, the assessment of POD employs diverse tools such as CAM-ICU or Nu-DESC and varies across time points—rendering meaningful cross-study comparisons and syntheses exceedingly challenging. Fourth, long-term safety data remain scarce. Existing evidence is confined to short-term outcomes during the perioperative period or procedural settings, with a paucity of data on potential long-term effects of remimazolam in these patients, such as neurocognitive impacts (especially following repeated exposure in pediatric populations), the development of tolerance, or dependence. Finally, RCTs have excluded patients with complex comorbidities to mitigate confounding. However, in real-world clinical practice, patients frequently present with multiple concurrent conditions, resulting in complex physiological states and potentially conflicting therapeutic demands. Such stringent exclusion criteria—for example, excluding patients with NYHA class IV heart failure, Child-Pugh class C liver disease, emergency cases, or significant multisystem disorders—substantially constrain the applicability and generalizability of current RCT findings to the high-risk, vulnerable patients with complex pathologies commonly encountered in clinical practice. Additionally, many studies are single-center or non-blinded, introducing risks of performance bias and detection bias. Further, the administration regimens of remimazolam (including loading and maintenance doses) and concomitant medications (eg, opioids, other sedatives) vary widely, leading to significant intervention heterogeneity and further complicating the interpretation of results. Intra-category population heterogeneity—such as the severity of hypertension, valvular disease, or coronary artery disease; Child-Pugh classification; the type and severity of intellectual disability; and the BMI range and associated comorbidities in obese patients—is also often unaddressed or inadequately analyzed in subgroup analyses. Accordingly, we contend that future research should prioritize multicenter, large-scale studies employing standardized outcome metrics, with a specific focus on addressing the aforementioned evidence gaps. Conclusion Although research on remimazolam’s application in neurological disorders, respiratory diseases, obesity, and rare conditions remains limited, emerging evidence demonstrates favorable safety profiles within therapeutic dose ranges for patients with comorbidities. Compared to conventional anesthetics, it offers rapid emergence, superior recovery quality, reduced respiratory and cardiovascular depression, non-elevated incidence of POD, and enhanced early postoperative cognitive recovery—particularly evident with combination regimens (eg, remimazolam plus esketamine or alfentanil). Beyond intranasal administration, remimazolam demonstrates versatility across multiple clinical scenarios including pediatric, geriatric, and critically ill populations through various delivery methods, without triggering severe adverse events. However, cautious clinical use remains warranted, especially in patients with severe hepatic impairment or critical illness. Disclosure The authors report no conflicts of interest in this work. References 1. Noncommunicable diseases World Health Organization Available from https://www.who.int/health-topics/noncommunicable-diseases#tab=tab_1 Accessed April 15 2. Hypertension World Health Organization Available from https://www.who.int/health-topics/hypertension#tab=tab_1 Accessed April 15 3. Boersma P Black LI Ward BW Prevalence of multiple chronic conditions among us adults, 2018 Prev Chronic Dis 2020 17 E106 10.5888/pcd17.200130 32945769 PMC7553211 4. The Lancet N Rare diseases: maintaining momentum Lancet Neurol 2022 21 3 203 10.1016/s1474-4422(22)00046-1 35182497 5. Adamczyk P Siwacki S Ponikowska I Juszczak K Calculation of basal metabolic rate in patients with morbid obesity treated in spa conditions J Hum Nutr Diet 2022 35 5 919 923 10.1111/jhn.12996 35137998 6. Choi JY Lee HS Kim JY Comparison of remimazolam-based and propofol-based total intravenous anesthesia on postoperative quality of recovery: a randomized non-inferiority trial J Clin Anesth 2022 82 110955 10.1016/j.jclinane.2022.110955 36029704 7. Elhamrawy A Villalobos MA Heydinger G Corridore M Tobias JD Combined general and regional anesthesia for a patient with duchenne muscle dystrophy with an implanted left ventricular assisted device undergoing orthopedic surgery J Med Cases 2024 15 6 97 101 10.14740/jmc4224 38855294 PMC11161179 8. Horikoshi Y Kuratani N Tateno K Anesthetic management with remimazolam for a pediatric patient with Duchenne muscular dystrophy Medicine 2021 100 49 e28209 10.1097/md.0000000000028209 34889305 PMC8663901 9. Seo KH Lee JY Anesthetic management with remimazolam for laryngectomy in a severely underweight patient with facioscapulohumeral muscular dystrophy Korean J Anesthesiol 2023 76 5 511 513 10.4097/kja.23322 37264584 PMC10562069 10. Koyama Y Nishikawa H Murase Y Morita K Tsuzaki K General anesthesia using remimazolam and remifentanil in combination with local anesthetics without neuromuscular blocking agents in a patient with myotonic dystrophy Korean J Anesthesiol 2023 76 4 391 393 10.4097/kja.23133 36974439 PMC10391071 11. Nimma S Gans A Wardhan R Allen W Remimazolam sedation and neuraxial anesthesia in a patient with amyotrophic lateral sclerosis undergoing an open colectomy: a case report A a Pract 2023 17 12 e01733 10.1213/xaa.0000000000001733 38109186 12. Nishihara N Tachibana S Ikeshima M Ino A Yamakage M Remimazolam enabled safe anesthetic management during tracheostomy in a patient with amyotrophic lateral sclerosis: a case report JA Clin Rep 2022 8 1 25 10.1186/s40981-022-00514-7 35347529 PMC8960499 13. Suzuki Y Doi M Nakajima Y General anesthesia with remimazolam in a patient with mitochondrial encephalomyopathy: a case report JA Clin Rep 2021 7 1 51 10.1186/s40981-021-00454-8 34164752 PMC8222447 14. Tashima K Hayashi M Oyoshi T Uemura J Korematsu S Hirata N Anesthesia management for percutaneous mitral valve repair in a patient with mitochondrial cardiomyopathy and low cardiac function: a case report JA Clin Rep 2024 10 1 49 10.1186/s40981-024-00734-z 39115707 PMC11310374 15. Ogino H Sugiyama D Ueda K Anaesthetic management of a patient with immune-mediated necrotizing muscle disease with the use of a novel ultrashort-acting benzodiazepine, remimazolam: a case report Cureus 2023 15 4 e37326 10.7759/cureus.37326 37182089 PMC10168013 16. Kido K Kato T Kamiya S Anesthetic management with remimazolam for a patient with hereditary angioedema:a case report J Med Invest 2024 71 1.2 184 186 10.2152/jmi.71.184 38735719 17. Wang M Zhao X Yin P Bao X Tang H Kang X Profile of remimazolam in anesthesiology: a narrative review of clinical research progress Drug Des Devel Ther 2022 16 3431 3444 10.2147/dddt.S375957 18. Hu Q Liu X Wen C Li D Lei X Remimazolam: an updated review of a new sedative and anaesthetic Drug Des Devel Ther 2022 16 3957 3974 10.2147/dddt.S384155 19. Chae D Kim HC Song Y Choi YS Han DW Pharmacodynamic analysis of intravenous bolus remimazolam for loss of consciousness in patients undergoing general anaesthesia: a randomised, prospective, double-blind study Br J Anaesth 2022 129 1 49 57 10.1016/j.bja.2022.02.040 35562226 20. Eisenried A Schüttler J Lerch M Ihmsen H Jeleazcov C Pharmacokinetics and pharmacodynamics of remimazolam (cns 7056) after continuous infusion in healthy male volunteers: part ii. Pharmacodynamics of electroencephalogram effects Anesthesiology 2020 132 4 652 666 10.1097/aln.0000000000003102 31972657 21. Kim SH Fechner J Remimazolam - current knowledge on a new intravenous benzodiazepine anesthetic agent Korean J Anesthesiol 2022 75 4 307 315 10.4097/kja.22297 35585830 PMC9346281 22. Dessai S Ninave S Bele A The rise of remimazolam: a review of pharmacology, clinical efficacy, and safety profiles Cureus 2024 16 3 e57260 10.7759/cureus.57260 38686236 PMC11056802 23. Filipovic MG Guensch DP Pro: remimazolam: new impetus for the anesthesia of critically ill and high-risk cardiovascular patients J Cardiothorac Vasc Anesth 2025 39 4 1079 1081 10.1053/j.jvca.2025.01.010 39880709 24. Yoshikawa Y Oura S Kanda M Comparison of the negative effect of remimazolam and propofol on cardiac contractility: analysis of a randomised parallel-group trial and a preclinical ex vivo study Clin Exp Pharmacol Physiol 2024 51 3 e13840 10.1111/1440-1681.13840 38302076 25. Mao Q Liang B Leng Z Ma W Chen Y Xie Y Remimazolam ameliorates postoperative cognitive dysfunction after deep hypothermic circulatory arrest through HMGB1-TLR4-NF-κB pathway Brain Res Bull 2024 217 111086 10.1016/j.brainresbull.2024.111086 39322086 26. Wen T Wen J Yao C Remimazolam inhibits postoperative cognitive impairment after cardiopulmonary bypass by alleviating neuroinflammation and promoting microglia M2 polarization Brain Res 2024 1838 148975 10.1016/j.brainres.2024.148975 38702024 27. Choi EK Jang Y Park SJ Comparison of remimazolam and propofol induction on hemodynamic response in hypertensive patients Medicine 2023 102 30 e34358 10.1097/md.0000000000034358 37505153 PMC10378971 28. Huang Y Yan T Lu G Luo H Lai Z Zhang L Efficacy and safety of remimazolam compared with propofol in hypertensive patients undergoing breast cancer surgery: a single-center, randomized, controlled study BMC Anesthesiol 2023 23 1 409 10.1186/s12871-023-02364-x 38087245 PMC10714447 29. Hu B Zhang M Wu Z Comparison of remimazolam tosilate and etomidate on hemodynamics in cardiac surgery: a randomised controlled trial Drug Des Devel Ther 2023 17 381 388 10.2147/dddt.S401969 30. Kotani T Ida M Naito Y Kawaguchi M Comparison of remimazolam-based and propofol-based total intravenous anesthesia on hemodynamics during anesthesia induction in patients undergoing transcatheter aortic valve replacement: a randomized controlled trial J Anesth 2024 38 3 330 338 10.1007/s00540-024-03311-x 38347233 31. Nakanishi T Sento Y Kamimura Y Tsuji T Kako E Sobue K Remimazolam for induction of anesthesia in elderly patients with severe aortic stenosis: a prospective, observational pilot study BMC Anesthesiol 2021 21 1 306 10.1186/s12871-021-01530-3 34872518 PMC8647449 32. Miyoshi H Watanabe T Kido K Remimazolam requires less vasopressor support during induction and maintenance of general anesthesia in patients with severe aortic stenosis undergoing transcatheter aortic valve replacement: a retrospective analysis from a single center Biomed Res Int 2022 2022 6386606 10.1155/2022/6386606 36317114 PMC9617702 33. Aoki Y Kurita T Nakajima M Association between remimazolam and postoperative delirium in older adults undergoing elective cardiovascular surgery: a prospective cohort study J Anesth 2023 37 1 13 22 10.1007/s00540-022-03119-7 36220948 34. Harimochi S Godai K Nakahara M Matsunaga A Comparaison du rémimazolam et du sévoflurane pour l’anesthésie générale lors de l’implantation valvulaire aortique via cathéter: une étude randomisée. [Comparison of remimazolam and sevoflurane for general anesthesia during transcatheter aortic valve implantation: a randomized trial] Can J Anaesth 2025 72 3 397 408 10.1007/s12630-024-02900-4 39715979 PMC11961503 35. Ju JW Lee DJ Chung J Effect of remimazolam versus propofol on hypotension after anesthetic induction in patients undergoing coronary artery bypass grafting: a randomized controlled trial J Clin Anesth 2024 98 111580 10.1016/j.jclinane.2024.111580 39126872 36. Shi M Chen J Liu T Protective effects of remimazolam on cerebral ischemia/reperfusion injury in rats by inhibiting of nlrp3 inflammasome-dependent pyroptosis Drug Des Devel Ther 2022 16 413 423 10.2147/dddt.S344240 37. Duan M Yu N Liu J Remimazolam suppresses oxidative stress and apoptosis in cerebral ischemia/reperfusion injury by regulating akt/gsk-3β/nrf2 pathway Drug Des Devel Ther 2025 19 111 128 10.2147/dddt.S478692 38. Zhou XH Zhang CC Wang L Jin SL Remimazolam induced cognitive dysfunction in mice via glutamate excitotoxicity Transl Neurosci 2022 13 1 104 115 10.1515/tnsci-2022-0220 35734308 PMC9164290 39. Koo CH Lee SU Kim HG Effect of remimazolam on intraoperative hemodynamic stability in patients undergoing cerebrovascular bypass surgery: a prospective randomized controlled trial Korean J Anesthesiol 2025 78 2 148 158 10.4097/kja.24538 39844353 PMC12013992 40. Soejima T Ueda K Hasegawa S Change in cerebral circulation during the induction of anesthesia with remimazolam J Anesth 2023 37 1 92 96 10.1007/s00540-022-03135-7 36355203 41. Gao J Yang C Ji Q Li J Effect of remimazolam versus propofol for the induction of general anesthesia on cerebral blood flow and oxygen saturation in elderly patients undergoing carotid endarterectomy BMC Anesthesiol 2023 23 1 153 10.1186/s12871-023-02095-z 37142971 PMC10157955 42. Zhang J Zhang J Wang Y Effect of remimazolam vs propofol on emergence from general anesthesia in patients undergoing cerebral endovascular procedures: a randomized controlled, non-inferiority trial J Clin Anesth 2024 93 111356 10.1016/j.jclinane.2023.111356 38056052 43. Lee JH Lee J Park SH Han SH Kim JH Park JW Comparison between remimazolam and propofol anaesthesia for interventional neuroradiology: a randomised controlled trial Anaesth Crit Care Pain Med 2024 43 2 101337 10.1016/j.accpm.2023.101337 38061682 44. Komatsu S Isogai T Makito K Matsui H Fushimi K Yasunaga H Seizure after flumazenil reversal for total intravenous anaesthesia with remimazolam versus propofol: a matched retrospective cohort analysis of a large Japanese nationwide inpatient database Br J Anaesth 2025 134 4 1050 1057 10.1016/j.bja.2024.11.046 39919984 PMC11947602 45. Yoshida K Obara S Kakinouchi K Inoue S Remimazolam may be suited for diagnosis of nonconvulsive status epilepticus J Anesth 2024 38 3 412 413 10.1007/s00540-024-03324-6 38462556 46. Jeon S Kim J Karm MH Kim JT Effect of converting from propofol to remimazolam with flumazenil reversal on recovery from anesthesia in outpatients with mental disabilities: a randomized controlled trial BMC Anesthesiol 2024 24 1 151 10.1186/s12871-024-02526-5 38649838 PMC11034095 47. Stöhr T Colin PJ Ossig J Pharmacokinetic properties of remimazolam in subjects with hepatic or renal impairment Br J Anaesth 2021 127 3 415 423 10.1016/j.bja.2021.05.027 34246461 48. Shi F Chen Y Li H Zhang Y Zhao T Efficacy and safety of remimazolam tosilate versus propofol for general anesthesia in cirrhotic patients undergoing endoscopic variceal ligation Int J Gen Med 2022 15 583 591 10.2147/ijgm.S345390 35046716 PMC8763269 49. Cao Y Chi P Zhou C Lv W Quan Z Xue FS Remimazolam tosilate sedation with adjuvant sufentanil in Chinese patients with liver cirrhosis undergoing gastroscopy: a randomized controlled study Med Sci Monit 2022 28 e936580 10.12659/msm.936580 35706340 PMC9210946 50. Song J Yu W Chen S Huang J Zhou C Liang H Remimazolam attenuates inflammation and kidney fibrosis following folic acid injury Eur J Pharmacol 2024 966 176342 10.1016/j.ejphar.2024.176342 38290569 51. Chen L Qin W Wu J Effect of remimazolam on induction and maintenance of general anesthesia in kidney transplant patients Int J Gen Med 2024 17 2455 2463 10.2147/ijgm.S464530 38831927 PMC11144654 52. Pastis NJ Yarmus LB Schippers F Safety and efficacy of remimazolam compared with placebo and midazolam for moderate sedation during bronchoscopy Chest 2019 155 1 137 146 10.1016/j.chest.2018.09.015 30292760 53. Zhou YY Yang ST Duan KM Efficacy and safety of remimazolam besylate in bronchoscopy for adults: a multicenter, randomized, double-blind, positive-controlled clinical study Front Pharmacol 2022 13 1005367 10.3389/fphar.2022.1005367 36313321 PMC9606208 54. Zhang L Yu L Xu L Wang JF Li JY Chen ZJ Effectiveness of remimazolam besylate combined with alfentanil for fiberoptic bronchoscopy with preserved spontaneous breathing: a prospective, randomized, controlled clinical trial Eur Rev Med Pharmacol Sci 2023 27 13 6071 6080 10.26355/eurrev_202307_32961 37458656 55. Zhou L Zou J Li X Efficacy and safety of remimazolam versus dexmedetomidine for patients undergoing flexible fiberoptic bronchoscopy: a randomized, clinical trial J Clin Anesth 2024 99 111677 10.1016/j.jclinane.2024.111677 39514979 56. Deng YF Jiang XR Feng ZG Comparative observation of the effectiveness and safety of remimazolam besylate versus dexmedetomidine in gastrointestinal surgery in obese patients World J Gastrointest Surg 2024 16 5 1320 1327 10.4240/wjgs.v16.i5.1320 38817287 PMC11135298 57. Miyoshi H Otsuki S Mukaida K Effects of remimazolam on intracellular calcium dynamics in myotubes derived from patients with malignant hyperthermia and functional analysis of type 1 ryanodine receptor gene variants Genes 2023 14 11 2009 10.3390/genes14112009 38002952 PMC10671487 58. Kondo H Mukaida K Sasai K Remimazolam-based total intravenous anesthesia in a patient with a confirmed diagnosis of malignant hyperthermia: a case report JA Clin Rep 2024 10 1 26 10.1186/s40981-024-00710-7 38647904 PMC11035517 59. Shen Y Sun Y Wang YT Dose equivalence of remimazolam and propofol for loss of consciousness in pediatric patients: a randomized clinical trial Pain Physician 2024 27 8 521 528 10.36076/ppj.2024.7.521 39621977 60. Gao YQ Ihmsen H Hu ZY Pharmacokinetics of remimazolam after intravenous infusion in anaesthetised children Br J Anaesth 2023 131 5 914 920 10.1016/j.bja.2023.08.019 37739904 61. Shi W Wu X Yuan C Effect of remimazolam toluene sulfonate on the cognitive function of juveniles and its mechanism of action Eur J Med Res 2024 29 1 543 10.1186/s40001-024-02142-6 39533344 PMC11559241 62. Long X Wen LX Yang H ED(95) of remimazolam in nasal administration for attenuating preoperative anxiety in children Front Med 2023 10 1253738 10.3389/fmed.2023.1253738 63. Cai YH Wang CY Fang YB Preoperative anxiolytic and sedative effects of intranasal remimazolam and dexmedetomidine: a randomized controlled clinical study in children undergoing general surgeries Drug Des Devel Ther 2024 18 1613 1625 10.2147/dddt.S461122 64. Kimoto Y Hirano T Kuratani N Cavanaugh D Mason KP Remimazolam as an adjunct to general anesthesia in children: adverse events and outcomes in a large cohort of 418 cases J Clin Med 2023 12 12 3930 10.3390/jcm12123930 37373624 PMC10299672 65. Fang YB Zhong JW Szmuk P Safety and efficacy of remimazolam tosilate for general anaesthesia in paediatric patients undergoing elective surgery: a multicentre, randomised, single-blind, controlled trial Anaesthesia 2025 80 3 259 268 10.1111/anae.16475 39577009 66. Cai YH Zhong JW Ma HY Effect of remimazolam on emergence delirium in children undergoing laparoscopic surgery: a double-blinded randomized trial Anesthesiology 2024 141 3 500 510 10.1097/aln.0000000000005077 38758221 PMC11323754 67. Chu T Zhou S Wan Y Comparison of remimazolam and propofol combined with low dose esketamine for pediatric same-day painless bidirectional endoscopy: a randomized, controlled clinical trial Front Pharmacol 2024 15 1298409 10.3389/fphar.2024.1298409 38375038 PMC10875078 68. Chen W Bao W Shi J Shi L Cui J Investigation into the application of remimazolamin conjunction with low-dose propofolfor pediatricfiberoptic bronchoscopy Sci Rep 2024 14 1 11671 10.1038/s41598-024-62181-1 38778051 PMC11111447 69. Song JC Wang XX Fu X Relationship between age and remimazolam dose required for inducing loss of consciousness in older surgical patients Front Med 2024 11 1331103 10.3389/fmed.2024.1331103 70. Liu M Sun Y Zhou L Feng K Wang T Feng X The median effective dose and bispectral index of remimazolam tosilate for anesthesia induction in elderly patients: an up-and-down sequential allocation trial Clin Interv Aging 2022 17 837 843 10.2147/cia.S364222 35620021 PMC9129099 71. Dong L Sun T Yang J Remimazolam has similar anesthetic effect and superior safety compared to propofol in elderly patients: a meta-analysis of randomized controlled trials World J Surg 2024 48 9 2262 2272 10.1002/wjs.12273 38955808 72. Chen J Zou X Hu B Remimazolam vs etomidate: haemodynamic effects in hypertensive elderly patients undergoing non-cardiac surgery Drug Des Devel Ther 2023 17 2943 2953 10.2147/dddt.S425590 73. Takaki R Yokose M Mihara T Hypotension after general anaesthesia induction using remimazolam or propofol in geriatric patients undergoing sevoflurane anaesthesia with remifentanil: a single-centre, double-blind, randomised controlled trial Br J Anaesth 2024 133 1 24 32 10.1016/j.bja.2024.04.013 38777646 74. Lee S Kang HY Ahn YN You AH Comparison of the incidence of postoperative acute kidney injury following the administration of remimazolam or sevoflurane in elderly patients undergoing total knee arthroplasty: a randomized controlled trial J Pers Med 2023 13 5 789 10.3390/jpm13050789 37240959 PMC10223479 75. Zhou Z Yang Y Wei Y Xie Y Remimazolam attenuates lps-derived cognitive dysfunction via subdiaphragmatic vagus nerve target α7nachr-mediated nrf2/ho-1 signal pathway Neurochem Res 2024 49 5 1306 1321 10.1007/s11064-024-04115-x 38472553 PMC10991060 76. Liu T Zhao H Zhao X Qu M Comparison of remimazolam and propofol on postoperative delirium in elderly patients undergoing radical resection of colon cancer: a single-center prospective randomized controlled study Med Sci Monit 2024 30 e943784 10.12659/msm.943784 38594896 PMC11017933 77. Yaqiu L Heng Z Ruimin W Xuri W Effects of remimazolam and propofol on sleep rhythm and delirium after spinal surgery in elderly patients Perioper Med 2025 14 1 18 10.1186/s13741-025-00500-4 78. Wu H Tian S Ma H Effects of remimazolam on intraoperative frontal alpha band power spectrum density and postoperative cognitive function in older adults undergoing lower extremity fractures surgeries: a randomized controlled trial Clin Interv Aging 2024 19 2195 2205 10.2147/cia.S496437 39764357 PMC11700878 79. Duan J Ju X Wang X Liu N Xu S Wang S Effects of remimazolam and propofol on emergence agitation in elderly patients undergoing hip replacement: a clinical, randomized, controlled study Drug Des Devel Ther 2023 17 2669 2678 10.2147/dddt.S419146 80. Guo J Qian Y Zhang X Han S Shi Q Xu J Remimazolam tosilate compared with propofol for gastrointestinal endoscopy in elderly patients: a prospective, randomized and controlled study BMC Anesthesiol 2022 22 1 180 10.1186/s12871-022-01713-6 35689208 PMC9185932 81. Deng BR Zhang Y Xie ZF Comparative analysis of hemodynamic effects of remimazolam and propofol combined with esketamine in colonoscopic procedures in the elderly Drug Des Devel Ther 2024 18 5269 5280 10.2147/dddt.S490179 82. Lin S Wei Y Zhuo Y Comparing cognitive recovery of remimazolam versus propofol in elderly patients undergoing colonoscopy: a randomized controlled trial Clin Interv Aging 2024 19 2133 2143 10.2147/cia.S490330 39712634 PMC11661974 83. Liu B Wang P Liang L Zhu W Zhang H Effect of remimazolam vs midazolam on early postoperative cognitive recovery in elderly patients undergoing dental extraction: a prospective randomized controlled study Drug Des Devel Ther 2024 18 5895 5904 10.2147/dddt.S491223 84. Muñoz-Carrillo JL Rodríguez-Cortes N Lévano ST Moran-Mariños C Barboza JJ Remimazolam versus propofol in general anesthesia of complex surgery in critical and non-critical patients: meta-analysis of randomized trials J Clin Med 2024 13 24 7791 10.3390/jcm13247791 39768714 PMC11728358 85. Tang Y Yang X Shu H Remimazolam besylate for sedation of postoperative patients in intensive care units: a Phase I, open label, dose-finding study Chin Med J 2022 135 17 2134 2136 10.1097/cm9.0000000000002243 36191588 PMC9746757 86. Chen X Zhang J Yuan S Huang H Remimazolam besylate for the sedation of postoperative patients undergoing invasive mechanical ventilation in the ICU: a prospective dose‒response study Sci Rep 2022 12 1 19022 10.1038/s41598-022-20946-6 36347892 PMC9643476 87. Tang Y Gao X Xu J Remimazolam besylate versus propofol for deep sedation in critically ill patients: a randomized pilot study Crit Care 2023 27 1 474 10.1186/s13054-023-04760-8 38049909 PMC10694930 88. Tian Y Li J Jin M Procedural sedative effect of remimazolam in ICU patients on invasive mechanical ventilation: a randomised, prospective study Ann Intensive Care 2025 15 1 8 10.1186/s13613-025-01431-5 39808218 PMC11732822 89. Rex DK Bhandari R Lorch DG Meyers M Schippers F Bernstein D Safety and efficacy of remimazolam in high risk colonoscopy: a randomized trial Dig Liver Dis 2021 53 1 94 101 10.1016/j.dld.2020.10.039 33243567 90. Doi M Hirata N Suzuki T Morisaki H Morimatsu H Sakamoto A Safety and efficacy of remimazolam in induction and maintenance of general anesthesia in high-risk surgical patients (ASA Class III): results of a multicenter, randomized, double-blind, parallel-group comparative trial J Anesth 2020 34 4 491 501 10.1007/s00540-020-02776-w 32303884 91. Dai QC Zhao JL Miao XY Wang R Hui Z Effects of different doses of remimazolam on hemodynamics during general anesthesia in patients with septic shock Eur Rev Med Pharmacol Sci 2024 28 6 2483 2492 10.26355/eurrev_202403_35755 38567608 92. Vellinga R Koomen JV Eleveld DJ Target-controlled infusion of remimazolam in healthy volunteers shows some acute tolerance Anesthesiology 2024 140 2 207 219 10.1097/aln.0000000000004811 37889844 ",
  "metadata": {
    "Title of this paper": "Target-controlled infusion of remimazolam in healthy volunteers shows some acute tolerance",
    "Journal it was published in:": "Drug Design, Development and Therapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478223/"
  }
}