{
  "title": "Paper_281",
  "abstract": "pmc Facts Views Vis Obgyn Facts Views Vis Obgyn 2222 fvvobgyn Facts, Views & Vision in ObGyn 2032-0418 2684-4230 European Society for Gynaecological Endoscopy PMC12489273 PMC12489273.1 12489273 12489273 40981681 10.52054/FVVO.2025.59 1 Video Article Laparoscopic hysterectomy for deep infiltrating endometriosis: anterior colpotomy first technique https://orcid.org/0000-0002-3380-7607 Doğan Nasuh Utku 1 nasuhutkudogan@yahoo.com https://orcid.org/0000-0003-0218-3624 Ceylan Sefa Metehan 1 https://orcid.org/0009-0003-6018-4841 Bağcıoğlu Esra 1 https://orcid.org/0000-0002-4019-5581 Doğan Selen 1 1 9 2025 30 9 2025 17 3 498155 281 284 02 4 2025 03 8 2025 30 09 2025 03 10 2025 03 10 2025 Copyright© 2025 The Author. Published by Galenos Publishing House on behalf of European Society for Gynaecological Endoscopy 2025 Facts, Views and Vision in ObGyn https://creativecommons.org/licenses/by-nc/4.0/ This is an open-access article under the Creative Commons Attribution-NonCommercial 4.0 International (CC BY-NC 4.0) License. Background Deep infiltrating endometriosis, particularly involving the rectovaginal space, represents one of the most challenging surgical benign gynaecologic conditions. While hysterectomy is a definitive option in women without fertility desire, these procedures are technically complex and associated with higher risks of complications. The anterior colpotomy first technique has been developed as an alternative approach to simplify dissection and improve surgical safety in such advanced cases. Objectives Stepwise video demonstration of laparoscopic hysterectomy for deep infiltrating endometriosis involving rectovaginal space by the anterior colpotomy first technique. Participant A 47-year-old woman presented with dysmenorrhea, dyspareunia and dyschezia unresponsive to medical treatment. Transvaginal ultrasound and magnetic resonance imaging (MRI) revealed bilateral 5 cm endometriomas, 2 cm endometriotic nodules on both utero-sacral ligaments, and a 4 cm nodule in the Douglas pouch. A further 3 cm superficial endometriotic nodule on the rectosigmoid colon was also revealed on MRI. According to the Enzian classification, the score was A3, B2/2, C3. Laparoscopic hysterectomy, bilateral salpingo-oophorectomy and endometriotic excision of lesions were planned. Operation time was 210 minutes, and blood loss was 50 mL. On the postoperative fourth day patient was discharged. The patient remained pain-free at 25 months follow-up. Intervention Surgical steps for anterior colpotomy first technique could be divided into following steps:  1) entry into retroperitoneum, 2) ligation of uterine artery at the branching point from hypogastric artery, 3) development of vesicouterine space, 4) dissection of ureter and transection of lateral parametrium, 5) combining lateral and anterior compartments, 6) anterior colpotomy, 7) developing rectovaginal space from lateral to midline, 8) completion of posterior colpotomy, 9) excision of endometriotic nodule and leaving nodule on rectosigmoid colon, 10) completion of hysterectomy, 11) rectal shaving and resection of endometriotic lesions, 12) Bubble test, assessment of ureteral integrity and ladder filling with saline. In this technique, it is more feasible to do anterior colpotomy first and to develop rectovaginal space from lateral sides towards midline instead of dealing with the posterior compartment at the beginning of surgery. Ultimately endometriotic nodule between the rectosigmoid colon and the uterus is cut, leaving the endometriotic nodule on the rectosigmoid colon. Conclusions Laparoscopic hysterectomy with anterior colpotomy first technique makes complicated hysterectomies easier in patients with deep infiltrating endometriosis. What is New? This video article presents a stepwise demonstration of the anterior colpotomy first technique for laparoscopic hysterectomy in deep infiltrating endometriosis. By prioritising anterior colpotomy and developing the rectovaginal space from lateral to midline, this approach simplifies complex dissections, reduces the risk of rectal injury, and offers a safer, more reproducible strategy for advanced endometriosis cases. Deep infiltrating endometriosis laparoscopic hysterectomy anterior colpotomy endometriosis surgery pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Endometriosis is a debilitating chronic disease associated with significant pelvic pain. 1 2 3 4 Methods A 47-year-old woman with 3 prior surgeries for endometriosis had significant dysmenorrhea (9/10), dyspareunia (8/10) and dyschezia (7/10) unresponsive to medical treatment. She underwent a colonoscopy with normal findings. Transvaginal ultrasound and magnetic resonance imaging (MRI) revealed bilateral 5 cm endometriomas, 2 cm endometriotic nodules on both uterosacral ligaments, and a 4 cm nodule in the Douglas pouch. A further 3 cm superficial endometriotic nodule on the rectosigmoid colon was also revealed on MRI. According to the Enzian classification, the score was A3, B2/2, C3. Laparoscopic hysterectomy, bilateral salpingo-oophorectomy and endometriotic excision of lesions were planned. Results The trocar configuration follows a diamond-shaped arrangement. The surgeon stands on the left side of the patient, while the first assistant is on the right. At the beginning of the surgery, the initial laparoscopic view revealed bilateral “kissing ovaries” and a frozen pelvis with an endometriotic nodule ( Figure 1 In this video Discussion Total hysterectomy is an option and has an additional benefit for the control of endometriosis-associated  pain compared to conservative surgery when fertility is not a concern. 5 The rate of intraoperative complications is about 3% and any major postoperative complication is 9% in women undergoing surgery for complex endometriosis. About 10% severe complication rate (Clavien-Dindo grade >2) was reported for women undergoing laparoscopic hysterectomy with stage 3-4 endometriosis. 3 6 7 In a standard fashion, surgery proceeds from the lateral compartment (development of pararectal spaces, ureterolysis) to posterior spaces (rectovaginal pouch), (i.e., lateral to medial approach). On the contrary, in our anterior colpotomy first technique, in our opinion, it would be more feasible to do anterior colpotomy first and then to develop rectovaginal space from lateral sides towards midline instead of dealing with the posterior compartment at the beginning of the surgery. 3 There are a number of studies reporting surgical outcomes of hysterectomy performed for endometriosis, but only in a limited number of these studies, anatomical and surgical details of the type and hysterectomy had been addressed. Rosati et al. 8 Hysterectomy for deep infiltrating endometriosis is a challenging surgical intervention compared to other benign indications. The surgery requires significant expertise, and strict steps should be followed to complete the surgery without any visible endometriotic lesions. Different techniques have been described for hysterectomy associated with endometriosis, but there is no consensus for the optimal surgical approach. Anterior colpotomy technique is an alternative way to perform hysterectomy for complex endometriosis cases, and in our opinion, makes the dissection of the rectovaginal pouch easier and faster. Conclusion Laparoscopic hysterectomy with anterior colpotomy first technique makes complicated hysterectomies easier in patients with deep infiltrating endometriosis involving the pouch of douglas. Supplementary Materials Video 1  https://www.youtube.com/watch?v=ETkU31rrbYA None. Contributors: Funding: Competing interests: Ethical approval: Informed consent: Data sharing: Transparency: References 1 Koninckx PR Ussia A Wattiez A Adamyan L Martin DC Gordts S The severity and frequency distribution of endometriosis subtypes at different ages: a model to understand the natural history of endometriosis based on single centre/single surgeon data. Facts Views Vis Obgyn 2021 13 209 19 34555875 10.52054/FVVO.13.3.028 PMC8823267 2 Zippl AL Reiser E Seeber B Endometriosis and mental health disorders: identification and treatment as part of a multimodal approach. Fertil Steril 2024 121 3 370 8 10.1016/j.fertnstert.2023.12.033 38160985 3 Darlet G Margueritte F Drioueche H Fauconnier A Laparoscopic modified radical hysterectomy for severe endometriosis: a single-center case series. J Minim Invasive Gynecol 2024 31 423 31 38325580 10.1016/j.jmig.2024.01.022 4 Melnyk A Rindos NB El Khoudary SR Lee TTM Comparison of laparoscopic hysterectomy in patients with endometriosis with and without an obliterated cul-de-sac. J Minim Invasive Gynecol 2020 27 4 892 900 10.1016/j.jmig.2019.07.001 31279776 5 Lewin J Vashisht A Hirsch M Al-Wattar BH Saridogan E Comparing the treatment of endometriosis-related pain by excision of endometriosis or hysterectomy: a multicentre prospective cohort study. BJOG 2024 131 13 1793 804 10.1111/1471-0528.17910 39010306 6 Casarin J Ghezzi F Mueller M Ceccaroni M Papadia A Ferreira H Surgical outcomes and complications of laparoscopic hysterectomy for endometriosis: a multicentric cohort study. J Minim Invasive Gynecol 2023 30 587 92 37004810 10.1016/j.jmig.2023.03.018 7 Uccella S Marconi N Casarin J Ceccaroni M Boni L Sturla D Impact of endometriosis on surgical outcomes and complications of total laparoscopic hysterectomy. Arch Gynecol Obstet 2016 294 771 8 27168180 10.1007/s00404-016-4115-9 8 Rosati A Pavone M Campolo F De Cicco Nardone A Raimondo D Serracchioli R Surgical and functional impact of nerve-sparing radical hysterectomy for parametrial deep endometriosis: a single centre experience. Facts Views Vis Obgyn 2022 14 121 7 35781108 10.52054/FVVO.14.2.016 PMC10191710 Figure 1 Laparoscopic view demonstrating bilateral kissing ovaries in a frozen pelvis associated with an endometriotic nodule on Douglas. ",
  "metadata": {
    "Title of this paper": "Surgical and functional impact of nerve-sparing radical hysterectomy for parametrial deep endometriosis: a single centre experience.",
    "Journal it was published in:": "Facts, Views & Vision in ObGyn",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489273/"
  }
}