{
  "title": "Paper_61",
  "abstract": "pmc J Agric Food Chem J Agric Food Chem 822 acssd jf Journal of Agricultural and Food Chemistry 0021-8561 1520-5118 pubs.acs.org/JAFC pmc-is-collection-domain yes pmc-collection-title ACS AuthorChoice PMC12492397 PMC12492397.1 12492397 12492397 40963092 10.1021/acs.jafc.5c05715 1 Article Food Safety and Toxicology Liver Lipidomics,\nHistology, Transcriptomics, and\nClinical Chemistry of Rats Intraperitoneally Treated with Fumonisin\nB1 for 5 days 7629307 https://orcid.org/0000-0002-5315-0024 Szabó András 7631416 Péter Mária 7631418 Balogh Gábor 7632293 Török Zsolt 7632299 Kóta Zoltán 7632302 Vígh László 7632307 Ali Omeralfaroug 7632330 Timár Botond 7632339 Kövér György 7632342 Nagy Tibor 7632346 Olasz Ferenc 7632350 Bóta Brigitta 7632352 Petneházy Örs 7632354 Gömbös Patrik 7632358 https://orcid.org/0000-0001-8562-4004 Agyarko Edward 7632369 Thi Nguyen Anh 7632379 Varga-Visi Éva 7632383 Kovács Melinda  † HUN-REN\nBiological Research Center Institute of\nBiochemistry Szeged 6726 Hungary  ‡ Single\nCell Omics Advanced Core Facility Hungarian\nCentre of Excellence for Molecular Medicine Szeged 6726 Hungary  § Agribiotechnology\nand Precision Breeding for Food Security National Laboratory, Department\nof Physiology and Animal Health, Institute of Physiology and Nutrition Hungarian University of Agriculture and Life Sciences Kaposvár 7400 Hungary  ∥ Department\nof Pathology and Experimental Cancer Research Semmelweis University Budapest 1085 Hungary  ⊥ Department\nof Animal Science, Institute of Animal Breeding Sciences Hungarian University of Agricultural and Life Sciences Kaposvár 7400 Hungary  # Agribiotechnology\nand Precision Breeding for Food Security National Laboratory, Institute\nof Genetics and Biotechnology Hungarian\nUniversity of Agriculture and Life Sciences Gödöllő 2100 Hungary  ¶ HUN-REN-MATE\nMycotoxins in the Food Chain Research Group Kaposvár 7400 Hungary * szabo.andras@uni-mate.hu 17 9 2025 01 10 2025 73 39 498249 24975 24996 06 5 2025 14 8 2025 11 8 2025 17 9 2025 03 10 2025 04 10 2025 04 10 2025 © 2025 The Authors. Published by American Chemical Society 2025 The Authors https://creativecommons.org/licenses/by/4.0/ This article is licensed under CC-BY 4.0 Fumonisin B1 was intraperitoneally administered at 2.1\nμg/animal/day\n(1×) and 5 and 10 times above (5× and 10×) to male\nrats for 5 days ( n n fumonisin B1 rat liver lipidomics arachidonic acid transcriptomics inflammatory\nsignaling Horizon 2020 Framework Programme 10.13039/100010661 739593 Magyar Agrár- és Élettudományi Egyetem 10.13039/100020610 NA Hungarian Research Network 10.13039/100020916 NA National Research, Develoment and Innovation Office, Hungary NA 2020-1.1.2-PIACI-KFI-2020-00079 National Research, Develoment and Innovation Office, Hungary NA KIM NKFIA 2022-2.1.1-NL-2022-00005 National Research, Develoment and Innovation Office, Hungary NA RRF-2.3.1-21- 2022-00007 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes document-id-old-9 jf5c05715 document-id-new-14 jf5c05715 production-flag-MathML-config-version 3 production-flag-journal-citation-display-style acs-titles production-flag-journal-date-display-style dates-used-rcd-rvd-acc production-flag-si-avail yes document-id-alt-64 af3c4c0417bf8536e85cacbaa293a6d945df7485dfe668a411bb0017e34c7616 1 Introduction  Occurrence Fusarium verticillioides Fusarium proliferatum  Absorption and Excretion    Accumulation    On the organ level  At the cellular level  On a biochemical level In addition, CerS1-6 provide organ-specific distribution  n n Our multimodal study had the hypothesis that subclinical\nintraperitoneal\nexposure to FB1 (and its multiplications) affects the hepatocellular\nmembrane integrity partly by disarranging the lipidome. We applied\nclassical (clinical chemistry and histology) and high-content (transcriptomics\nand lipidomics) analytical techniques to test the hypotheses: (i)\nif early signs of hepatotoxicity in rats emerge after only 5 days;\n(ii) whether we can identify FB1-specific, new (lipid) biomarkers\nand metabolic and genetic pathways; (iii) whether the adverse effects\nexhibit a dose-dependent response within the 0–1×–5×–10×\ndose range; and (iv) whether we find associations between the different-level\ncellular features to explain the mechanism of FB1 mode of action. 2 Materials and Methods 2.1 Experimental Animals, Keeping, and Feeding Altogether 32 HAN/Wist SPF adult male rats (total population mean\ninitial body weight: 284.5 ± 17.5 g) were enrolled in the study.\nDuring acclimatization (7 days) and the subsequent mycotoxin treatment\nperiod (5 days), paired rats were allocated into Eurostandard IV-type\npolycarbonate cages. Feed and drinking water were offered ad libitum 1 2.2 FB1 Administration Protocol FB1 administration\nwas performed via intraperitoneal (i.p.) injections, in a total of\n5 times, daily once, each day at 8 a.m., when the bodyweight was also\nmeasured. The injected volume was 0.5 mL/individual/day; C received\nsterile physiological saline. The fumonisin B1 groups’ stock\nsolutions (FB1 toxin (Fumizol Ltd., Szeged, Hungary, purity ≥\n99%, dissolved in physiological saline) were prepared at the concentrations\nof 4.2, 21, and 42 μg/mL, and each time 0.5 mL of these were\ninjected into the animals. A recovery check of FB1 from the stock\nsolution was performed daily with a Shimadzu 2020 LC/MS system (Shimadzu,\nKyoto, Japan). The accuracy of the results was within ±0.2%.\nFB1 level was set to 0.2 mg/kg bodyweight/day, which is the lowest\nNOAEL for rats in subchronic studies. 2.3 Slaughter, Sampling, and Ethical Allowance After 5 days of FB1 treatment, on the next day at 8 a.m., rats\nwere anesthetized with diethyl ether, and after taking blood from\nthe retro-orbital plexus (into K 2 2 2.4 Histological Sample Preparation Liver\nsamples were stored in 10% neutral buffered formalin and were embedded\ninto paraffin. For light microscopic analysis, microtome slides of\n5 μm were prepared and stained with hematoxylin–eosin\nand periodic acid-Schiff (PAS) staining (not digested procedure),\nrespectively. All stained slides involved in this study were subjected\nto whole slide digitalization using a Pannoramic 1000 Scanner (3DHistech\nLtd., Budapest), and their visual analysis and scoring were done within\nthe SlideViewer program (3DHistech). The main pathological alterations\nhave been described and scored according to their extent and severity\nas follows: 0 = no change, 1 = minimal, 2 = mild, 3 = moderate, 4\n= severe. Total score value was defined as the sum of all scores in\nall identified histological changes per sample. 2.5 Shotgun Lipidomics The tissue samples\nwere weighed, cut into max. 200–300 mg pieces, and homogenized\nin a calculated volume of water with a bullet blender homogenizer\n(Bullet Blender Gold, Next Advance, Inc., Averill Park, NY, USA) in\nthe presence of zirconium oxide beads (0.5 and 1 mm), at a speed level\nof 8 for 2 × 3 min at 4 °C to obtain a watery homogenate\nwith close-to-identical concentrations for all samples. A portion\nof the homogenate (10 μL, corresponding to ca. 2–3 mg\nwet weight) was subjected immediately to a one-phase methanolic lipid\nextraction, which ensures good (∼95% or higher) recovery for\nvarious lipid classes, as shown previously. g Electrospray ionization (ESI)-MS\nanalyses were performed on a high-sensitivity,\nhigh-resolution Orbitrap Fusion Lumos instrument (Thermo Fisher Scientific,\nBremen, Germany) equipped with a TriVersa NanoMate robotic nanoflow\nion source (TriVersa NanoMate, Advion BioSciences, Ithaca, NY, USA),\nusing chips with spraying nozzles of 5.5 μm diameter. The instrument\nwas fully calibrated before analysis. The ion source was controlled\nby Chipsoft v8.3.1 software. The ionization voltages were +1.3 and\n−1.9 kV in positive and negative modes, respectively, and the\nback-pressure was set to 1 psi in both modes. The temperature of the\nion transfer capillary was 260 °C. Acquisitions were performed\nat the mass resolution R  m z Based on preliminary injections, 3 μL of\nextract was further\ndiluted with 120 μL of infusion solvent mixture (chloroform/methanol/iso-propanol\n1:2:1, by vol.). The infusion solvent was spiked with an internal\nstandard mix (Avanti Polar Lipids, Alabaster, AL, USA; Appendix Table_S13 For free cholesterol determination,\n100 μL of methanolic\nextract was evaporated to dryness, and 180 μL of chloroform/acetyl\nchloride = 5:1 mixture was added to the residue to form the acetate\nderivative of free sterols. The reaction mixture was left for 1 h\nat room temperature, evaporated to dryness, and reconstituted in 75\nμL chloroform/methanol = 1:1. For MS analysis, 3 μL of\nthe derivative was diluted with 60 μL of infusion solvent (chloroform/methanol/isopropanol\n= 1:2:1, by vol.) in the presence of 100 mM sodium carbonate. Cholesterol\nacetate (CholAc) was detected in the positive ion mode at +1.5 kV\nionization voltage at the mass resolution R  m z Phosphatidylcholine\n(diacyl, PC and alkyl-acyl, PC-O), phosphatidylethanolamine\n(diacyl, PE and alkenyl-acyl, PE-P), phosphatidylinositol (PI), phosphatidylserine\n(PS), phosphatidic acid (PA), phosphatidylglycerol (PG)/bis­(monoacylglycero)­phosphate,\ncardiolipin (CL), and the lyso derivatives LPC, LPE, LPI, LPS, LPG,\nand LCL as well as ceramide (Cer), sphingosine-1-phosphate (So-1-P),\nGM3 ganglioside, and free fatty acids (FFA) were detected and quantified\nusing the negative ion mode, whereas sphingosine (SPH(18:1:2) or So),\nsphinganine (SPH(18:0:2) or Sa), sphingomyelin (SM), diacylglycerol\n(DG), triacylglycerol (TG), cholesteryl ester (CE), and free cholesterol\n(Chol) were detected and quantified using the positive ion mode. Raw MS spectra were converted to platform-independent mzML files,\nand lipid species were identified with the LipidXplorer software. m z Appendix Table_S13 Lipid species were annotated with sum formulas according to the\nshorthand notation for lipid structures. x y x y The fatty acid profile of the rat feed ( Appendix Table_S06 2.6 Transcriptomics Tissue specimens\nwere directly sampled into TriReagent (Merck T9424), mildly sedimented,\nand snap frozen in liquid nitrogen. mRNA expression profiles of 8\nliver samples per group were assessed using the Agilent GENEXP-4×\nSurePrint G3 Rat Gene Expression package (Agilent Technologies, California,\nUSA) following the manufacturer’s instructions. RNA extraction\nwas done with the Trizol reagent (Amresco, USA), and mRNA extraction\nresults are provided in the Appendix Table_S12 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE286344 2.7 Clinical Chemistry A Beckman Coulter\nAU5811 automated equipment (Beckman Coulter, Inc., Brea, CA, USA)\nwas used for the measurements with respective diagnostic kits (see Appendix Table_S13 2.8 Statistical Analysis Somatic results\nwere evaluated with ANOVA and Tukey post hoc test, to detect intergroup\ndifferences. The grouping variable was the mycotoxin dose (d f R P The histopathological evaluation was ranked from 0 to 4, according\nto the severity of the changes. The continuous lipidomics and the\nranked histopathology data were tested for correlation with the Spearman’s\nrho rank correlation method, while clinico-chemical data correlations\nwere analyzed with Pearson’s method. All above analyses were\nperformed using IBM SPSS 29.0 (2023) software. Multivariate analysis of lipidomic data was performed\nwith R project\nversion 4.1.2 (2017) In\ntranscriptomics, to evaluate samples and to identify possible\noutliers, we used unsupervised clustering of the normalized data using\nthe “pheatmap” package. Gene ontology (GO) enrichment\nanalysis was performed using the “clusterProfiler” package\n(version 4.10.1) (Wu et al., 2021). 3 Results 3.1 Somatic Traits (FB1 Dose and Exposure Time\nDependence) Final bodyweight (BW) was significantly lowered\nin the 10× group (vs C Figure C Figure Figure Figure Appendix Table_S02 1 (A) Bodyweight of the\nrats during the 5 study days; (B) bodyweight\ngain during the 5 day period in the 4 groups; (C) feed intake during\nthe FB1 administration period; (D) absolute and relative liver weight\nat the end of the experiment. (dots and columns represent means ±\nSD) (a–c in the plots indicate significant intergroup differences\n( p 3.2 Clinical Chemistry The full clinico-chemical\ndata set can be found in the Appendix Table_S07 Figure 2 Linear, dose-dependent\nalterations of the HDL cholesterol concentration\n(A), AST (B), and ALT (C) activities in the 4 experimental groups\nafter 5 days (dots represent individual values). 3.3 Histopathology To assess FB1-induced\nliver damage, the following histologic changes were quantified: fatty\nchange (steatosis), hydropic degeneration, apoptosis/mitosis/regenerative\nsigns, hepatocellular hypertrophy, necrosis, portal changes, and loss\nof PAS positivity (indicative of glycogen depletion). Group-assorted\ndata are summarized in Table Appendix Table_S08 Figure Figure Figure Figure 1 Mean and Range Descriptive Data of\nthe Distinct Histological Findings Logged in the Liver Samples group C 1× 5× 10×  mean min. max. mean min. max. mean min. max. mean min. max. fatty change 0.25 0 1 0 0 0 0 0 0 0.25 0 1 hydropic degeneration 0.13 0 1 0.13 0 1 0.75 0 1 1.13 1 2 apoptosis/mitosis/regenerative sign 0 0 0 0 0 0 2 1 3 2.75 2 4 hepatocellular hypertrophy 0.38 0 1 0.38 0 1 0.88 0 1 1 1 1 necrosis* 0 0 0 0 0 0 0 0 0 0 0 0 portal changes 0 0 0 0 0 0 0.38 0 1 1 1 1 loss of PAS positivity 0.88 0 1 0.75 0 1 2.25 1 4 2.87 2 4 total score value 1.63 0 3 1.25 0 3 6.25 3 10 9 7 12 a Means are calculated for n 3 Histologic changes observed in the rat liver at 10× FB1 dose\nafter 5 consecutive days. (A) Hydropic change of hepatocytes (filled\narrowhead and insert) with pericentral mitotic figures (arrow and\ninsert) and with parenchymal collapse with atrophic hepatocytes (empty\narrowhead and insert) (63×, HE staining). (B) Presence of apoptosis\n(Councilman bodies, empty arrowhead, insert) and mitotic figures (arrow)\nin a pericentral (CV: central vein) predominance (63×, HE staining).\n(C) Minimal portal changes, predominantly congestion (empty arrow),\nwith occasional lymphocytic infiltrates in the periportal region (empty\narrowhead) (63×, HE staining). (D) Loss of PAS staining intensity\n(positivity) in the pericentral region (63×, PAS staining). 3.4 Liver Lipidomics 3.4.1 Overview of Lipidomic Data In our\nuntargeted, shotgun ESI-MS measurements, we identified and quantified\nca. 250 lipid species, encompassing 25 lipid classes, including membrane,\nsignaling, and storage lipids ( Appendix Table_S03 Figure Figure Figure Appendix Table_S03 4 Overview of the lipidomic\nresponse to i.p. FB1 treatment. (A) PLS-DA\nscore plot and (B) heatmap representation of hierarchical cluster\nanalysis based on the entire hepatic lipidomics data set (the top\n50 most significant species were selected based on ANOVA, Euclidean\ndistance, and the clustering algorithm Ward; only group averages are\nshown; the heat color code represents normalized values ( z To evaluate the dose response on the FB1 treatment,\nthe lipid class\nfold changes and linear or logarithmic fittings were calculated ( Appendix Table_S03 Appendix Table_S04 3.4.2 Sphingolipids and Ceramide Synthases First, we examined the alterations of the hepatic sphingoid bases\nand sphingolipids because, due to its structural similarity to sphinganine\nand FA-CoA, FB1 is known to inhibit ceramide synthases (CerS). In\nour experimental setup, we detected significant reduction in the expression\nof CerS2, CerS3, and CerS4 (which produce longer chain ceramide (Cer)\nspecies) at the 10× level, while CerS1 expression increased in\nthe 5× and 10× groups ( Figure 5 (A) CerS\nisoforms’ relative expression in the rat livers\n(100% refers to the control). (B) Concentration of hepatic sphinganine\n(Sa) and sphingosine (So), and their ratio. (a,b: different indices\nmark significantly different group means at p We observed a slight increase in the concentration\nof sphingosine\n(So), a drop in that of sphinganine at 1× and an increase beyond,\nand the Sa/So ratio followed this pattern ( Figure Figure Appendix Table_S03 Appendix Table_S03 Appendix Table_S04 C Figure Figure R 2 R 2 Appendix Table_S03 6 Dose-dependent alterations of some Cer (A), respective SM (B),\nand the single identified GM3 ganglioside (C) molecular species. (a–c:\ndifferent indices mark significantly different group means at p 3.4.3 FB1 Impacts Glycerophospholipid Metabolism Due to the interconnection of SL degradation and PE synthesis pathways,\ncombined with the modulatory effect of FB1 on fatty acid metabolism,\nFB1 might exert a deeper impact on the whole hepatic lipidome beyond\nthe disturbance of SL metabolism. Grouping glycerophospholipid (GPL)\nconcentration data according to lipid classes showed different responses.\nAt the lipid class level, diacyl phosphatidylcholine (PC), the most\nabundant membrane lipid, did not alter, whereas the other major structural\nlipids, PE, PI, and PS, increased as a result of FB1 treatment ( Figure Appendix Table_S03 Appendix Table_S11 Appendix Table_S03 sn sn Figure Figure 7 FB1-induced logarithmic\nand linear dose–response curves\nof the AA and linoleic acid (CL(72:8) (tetra-linoleoyl CL)) containing\nlipid molecular species of the glycerophospholipidome (dots represent\nindividual values, n 3.4.4 Neutral Lipid Lipidomics Among\nneutral lipids, cholesterol increased significantly ( C Figure Appendix Table_S03 Figure C C Appendix Table_S03 Figure Figure Appendix Table_S03 8 Linear dose–response\nof AA-containing neutral lipid molecular\nspecies in the triglyceride (TG), cholesteryl ester (CE), and free\nfatty acid (FFA) classes. 3.5 Relationship between Lipidomics Data and Histopathological\nFindings For a more detailed understanding of histopathological\nalterations, the link among the identified histological changes and\nthe lipidomic data set was tested. The Spearman rank correlation coefficients\nbetween the most abundant lipid molecular species in a given lipid\nclass and the distinct histopathological changes are shown in Table Appendix Table_S10 2 Spearman Rank Correlation Coefficients\nbetween the Identified Histological Changes and the Most Abundant\nLipid Molecular Species of Each Lipid Class a Values below and over −0.6\nand 0.6, respectively, are marked. The steatotic fatty change did not provide a robust\npositive correlation\nwith any of the lipid classes. Hydropic degeneration was positively\nassociated with PC-O(38:5), GM3(42:1:2), CE(20:4), and free cholesterol,\nwhile it was strongly negatively related to Cer(42:1:2) and SM(42:1:2).\nWe found markedly positive correlations between the severity and prevalence\nof apoptosis/mitosis/regenerative signs with the most abundant species\nof the LPC, LPE, LPG, PC-O, PE-P, GM3, CE, and FFA classes, and free\ncholesterol, while SM and Cer species (e.g. 42:1:2) were in a strong\nnegative relationship with this change. Hepatocellular hypertrophy\ndid not provide a strong correlation with any of the abundant lipids.\nPortal changes exhibited generally similar lipid associations like\napoptosis, while the loss of PAS intensity (i.e., glycogen depletion)\nand the total, cumulative histological score were positively associated\nwith LPC, PC-O, PE-P, GM3, CE, and FFA abundant species, and additionally\nwith cholesterol and sphingosine, while negatively associated with\nSM (42:1:2) and Cer (42:1:2). Furthermore, for the two toxicologically\nmost relevant hepatic\nhistopathological changes, the top 20 rank correlation coefficients\nare plotted in Figure 9 Top 20 strongest positive and negative Spearman correlation\ncoefficients\namong (A) apoptosis/mitosis/regenerative sign and (B) hydropic degeneration\nand the individual lipid molecular species. 3.6 Correlation of Clinical Chemistry Results\nwith Lipidomics Clinical chemical endpoints were tested for\nPearson correlation with the most abundant lipid species of each lipid\nclass ( Table Appendix Table_S09 3 Pearson Correlations among the Plasma\nClinical Chemical Parameters and the Most Abundant Hepatic Lipid Molecular\nSpecies of Each Lipid Class a Values below and over −0.6\nand 0.6, respectively, are marked. Setting the cutoff value to 0.6 and interpreting only\nhepatic and\nFB1 toxicologically relevant results, total and HDL cholesterol provided\nstrong positive relationships with LPE(18:0) and LPG(22:6), respectively,\nand both were positively related to PE-P(38:4) as well; interestingly,\nSM(42:1:2) showed the opposite relation. Total cholesterol was positively\ncorrelated with CE(20:4), being a building block. AST, one of the\nmost widely accepted biomarkers, Figure 3.7 Transcriptomics (and Lipidomics Correlations) To analyze FB1 dose-dependent gene expression alteration patterns,\nfirst, linear regression was performed against the FB1 dose, followed\nby enrichment analysis with the involvement of genes where the determination\ncoefficient of the model exceeded 0.5. The results were ranked based\non the slope of the regression models (beta) ( Table 4 Top 20 Down- and Upregulated Genes\nin the Liver (Beta is the Slope of the Regression Model Set Against\nFB1 Dose, Fitting was Performed on 4 × 8 Individual Data) rank order DOWNREGULATED beta UPREGULATED beta 1 LOC103693974 –0.43  Mmp12 0.65 2 Lgsn –0.35 LOC102549755 0.53 3 Stac3 –0.31 Abcb1b 0.51 4  Pla2g2a –0.31  Trem2 0.50 5 LOC102547849 –0.29 Cyp2c24 0.48 6 LOC102551428 –0.28 Atf3 0.46 7 LOC100910106 –0.28 LOC103693477 0.42 8 Inmt –0.28 Mmp3 0.41 9 LOC102553657 –0.28  Ccl2 0.41 10  Pnpla3 –0.27 Tex36 0.40 11 Clic3 –0.27 Gpnmb 0.39 12 LOC102553540 –0.26 LOC102555660 0.39 13 LOC102551365 –0.26 Bcat1 0.39 14 LOC103690303 –0.25 Maff 0.37 15 Cyp26a1 –0.24 Spp1 0.37 16 LOC102547310 –0.24 Neurl3 0.36 17 Papss1 –0.23  Cxcl10 0.36 18 Prss55 –0.23  Pla2g2d 0.35 19 Per2 –0.22 Ccl1 0.35 20 Olr1305 –0.22 Sfn 0.34 Among the top 20 upregulated items, we identified\nphospholipase\nand triglyceride lipase encoding genes, but more importantly, signs\nof FB1-induced immunomodulation could be recognized, such as the upregulation\nof Mmp12 (macrophage metalloelastase), Trem2 (the triggering receptor\nin immune cells), and Ccl2 and Cxcl10 (chemokine ligands) (bold typing\nin Table  Figure Figure 10 Top 20 positively\nand negatively correlating lipid molecular species’\nPearson coefficient values for (A) plasma total cholesterol concentration\nand (B) AST activity. 11 Top 10 most important biochemical processes downregulated\n(A) or\nupregulated (B) in rat livers by FB1. 12 Hierarchical clustering based on the top 100 immunologically\ncompetent\ngenes. The top 20 correlation values between lipidomics\nand transcriptomics\ndata provided evidence for the outstanding importance of Cer, SM,\nPG, and PC-O species ( Table Appendix Table_S16 5 Top 20 Positive and Negative Correlations\namong Lipid Molecular Species and Individual Genes rank order lipid\nspecies gene corr. coeff. lipid species gene corr. coeff. 1  Cer Mmp12 –0.9523  PG LOC102549755 0.9226 2 Cer(42:2:2) Mmp12 –0.9422  PG LOC103693477 0.9200 3 SM(40:1:2) Pla2g2d –0.9281  PG Pla2g7 0.9043 4  Cer Slc2a6 –0.9252  PC-O LOC102549755 0.9041 5  Cer Irf5 –0.9237 PG(40:8) C3ar1 0.8992 6 Cer(42:2:2) Relb –0.9226  PG Cyp2c24 0.8946 7 SM(42:1:2) Pla2g2d –0.9225  PG Gpnmb 0.8946 8  Cer Cd83 –0.9191  PG Abcb1b 0.8945 9 Cer(41:1:2) Cd5l –0.9189  PG Lgals3 0.8912 10  Cer Relb –0.9175  PG Iglon5 0.8902 11 Cer(41:1:2) Mcm2 –0.9162 PG(40:8) Cyp2c24 0.8893 12 Cer(42:1:2) Cd5l –0.9152  PG Clec4a3 0.8879 13 sum_Cer RT1-Bb –0.9144  PC-O LOC103693477 0.8837 14 Cer(42:2:2) Cd83 –0.9143  PC-O Gpnmb 0.8831 15 Cer(42:1:2) Mmp12 –0.9138 PC-O(36:4) Gpnmb 0.8827 16 SM(42:1:2) Capg –0.9122  PG Clec7a 0.8818 17 sum_Cer Cd5l –0.9120 PC-O(36:4) LOC103693477 0.8806 18  Cer Bcat1 –0.9117  PC-O Neurl3 0.8792 19  Cer Cd5l –0.9105  PG Ebi3 0.8779 20 SM(40:1:2) Capg –0.9102  PG Neurl3 0.8778 Major longer chain (40<) Cer species were negatively\ncorrelated\nto genes involved in immunomodulation (Mmp12, Irf5 (interferon regulatory\nfactor), RT1-Bb, Capg, and Pla2g2d (secreted PLase having immunomodulatory\neffects)), or NF-kB pathway-related genes (RelB, CD83), glucose metabolism\n(Slc2a6), apoptosis regulation (Cd5l), or mitochondrial amino acid\nmetabolism (Bcat1). From the top 20 list, 7 cases were associated\nwith Cer(42:3:2). Phosphatidylglycerol and ether PC-O molecular\nspecies were strongly\npositively correlated to genes regulating immune response-inflammation\n(Clec4a3, Neurl3) and tumor suppression (Arl11) or both processes\n(C3ar1), cellular immune response (Clec7a, Pla2g7 involved in LDL\nhydrolysis, Ebi3), or to genes having cancer association (Gpnmb) or\ninvolvement in xenobiotic metabolism (Cyp2c24). The most important\nlipid species of the highest representation was PG(38:6) (12 cases\nout of 20). For the over-represented lipid metabolite-correlated genes,\nGO analysis was performed for the description of their biochemical\nimpact ( Figure 13 Top\n10 biochemical processes regulated by genes in strong correlation\nwith Cer(42:3:2) (A) and PG(38:6) (B), as assessed with GO analysis. The ontology analysis of genes with a strong negative\ncorrelation\nwith Cer(42:3:2) covered exclusively immunological processes related\nto adaptive immunity. The regulation of the immune response activation\npathway, that of the adaptive immune response, and the leukocyte-related\nprocesses (migration, cell surface receptor signaling) involved at\nleast 50 individual genes ( Appendix Table_S17 The mostly affected processes\nand their regulation have been further\nanalyzed by means of the Pathview application, Figure C 14 Modulation of the steroid biosynthesis (C vs 10×\nlevel FB1\ntreatment, mapped with Pathview on a KEGG pathway). Enrichment analysis identified inflammatory and\napoptotic processes\namong the over-represented GO terms in the 5× and 10× groups.\nIn Figure C 15 FB1-induced modification of the regulation of apoptosis\nin the\nrat liver. (C vs 10× FB1 treatment, mapped with Pathview on a\nKEGG pathway). 4 Discussion 4.1 Somatic Traits (FB1 Dose and Exposure Time\nDependence) As a cumulative outcome of the reduced feed intake\nand organ weight decrease, BW gain provided a dose-dependent decrease\nfor FB1 ( Appendix Table_S02 4.2 Clinical Chemistry Within nitrogenous\ncompounds, the increase of total protein and albumin at the 10×\n(∼16 mg/kg dietary dose eq.) is in accordance with our earlier\nrat results Figure 4.3 Histopathology The histological investigations\nidentified typical hepatotoxicosis at the 5× and 10× levels.\nSigns of apoptosis are consistent with the findings at 35–75\nmg/kg dietary dose. 4.4 Liver Lipidomics 4.4.1 Sphingolipids and Ceramide Synthases From a sphingolipidomic viewpoint, the mechanism of action of FB1\nis well-known and is based on the inhibition of Cer synthases, subsequent\nCer synthesis inhibition and marked precursor (Sa, So) accretion.  C 1+2 Figure In the frame of data evaluation, we were seeking\nproof of possible adaptation against FB1-induced apoptosis induction,\nsince the development of an “anti FB1 lipid profile”\nwas indicated in rat liver; this is characterized by lower C18:0 and\nhigher total monounsaturation in the SMs as an antiapoptotic defense\nreaction. 4.4.2 FB1 Impacts Glycerophospholipid Metabolism In addition to the affection of sphingolipids, the first results\nreporting the FB1-induced rearrangement of the glycerophospholipidome\nwere likely published in Fisher rats at 250 mg/kg dietary dose for\n21 days. In addition to the major\nlipid classes, we detected numerous alterations in the minor lipids.\nPG and BMP (bis­(monoacylglycerol)­phosphate) account for 1–2%\nof phospholipids in most animal tissues and display versatile but\nfairly different functions in cells, being mitochondrial and lysosomal\nsignature lipids, respectively. A recent work has mapped their tissue\ndistribution, proving the presence of both structures in rodent liver. Figure PE-Ps (PE plasmalogen, PE with a vinyl ether bond in the sn sn PC-Os’ (ether type PC-s) systematic\naccretion refers to\nincreased peroxisomal activity, One of the most prevalent and novel findings in the\nliver was the\nGPLipidome-wise accumulation of AA-containing lipid molecular species.\nThe most affected species were the major structural components PE(38:4)\nand PI(38:4), which provided logarithmic-type increases with significant\nchanges already at dose 1×, while the elevations in the ether\nlipids PC-O(38:4) and PE-P(38:4), in the neutral lipid CE(20:4), as\nwell as free AA, followed linear dose dependence. Consistent with\nthis, AA accumulation was detected in the total phospholipid fraction\nin piglets’ livers at a 20 mg/kg FB1 dose after 10 days. Table Appendix Table_S16 4.4.3 Neutral Lipid Lipidomics Regarding\nneutral lipids, both free and esterified cholesterol concentrations\nincreased in the 10× group concomitantly with the markedly increasing\nplasma total cholesterol levels and HDL and LDL cholesterol levels.\nFB1 treatment also increased the cholesterol content in rat hepatocellular\nlipid rafts, 4.5 Correlation of Clinical Chemistry Results\nwith Lipidomics Analyzing the possible relationship between\nclinical chemistry endpoints of high hepatotoxicological relevance\nand lipidomic data was reasoned to highlight possible lipid biomarker\ncandidates. The most important association of circulating lipoproteins\nwas found with the hepatic concentration of their most abundant building\nblock, CE(20:4), but the role of the abundant molecular species of\nthe LPE and PE-P classes has also been highlighted by correlation\nanalysis ( Appendix Table_09 Figure Appendix Table_S14 4.6 Relationship between Lipidomics Data and Histopathological\nFindings The establishment of correlative links among histopathological\nchanges and lipidomic data may reveal the biochemical background for\nthe membrane destructive (total score correlations with lipidomic/membrane\nlipid data), apoptotic (most probably sphingolipid-mediated apoptosis),\nand immunotoxic (macrophage appearance) effects of FB1. Thus, in the\nfurther step, we were seeking lipidomics data associations. The most\nprevalent histologic finding was hydropic degeneration, providing\na positive relationship with plasmanyl-PCs, GM3, CEs, and free cholesterol,\nwhile it was negatively related to Cer and SM species. The molecular\nspecies providing the closest correlation were mostly of n6 FA types\nwith high abundance, e.g., PC-O(38:4) and PC-O(36:4), and CE(20:4),\nreferring to the predominant importance of AA in these changes. Apoptosis\noccurred in parallel with hepatocellular proliferation; the strongest\nnegative association of these changes was found specifically with\nlonger chain SM and Cer molecules (40 and above), which is supported\nin NAFLD. Appendix Table_10  Of specific\nnote may be the PAS staining intensity change, which was typically\nlocalized pericentrally. This finding indicates cellular glycogen\ncontent depletion. In a recent study, human hepatocytes provided an\nanalogous reaction upon xenobiotic treatment, which could be efficiently\nreversed by a glucosyl-ceramide synthase inhibitor, leading to the\nreduction of cellular GM3 levels. 4.7 Transcriptomics (and Lipidomics Correlations) The most affected pathways in FB1-induced hepatotoxicosis have\nbeen highlighted in pigs and mice,  Figure Appendix Table_S15 Figure The GO analysis indicated hepatic immune response activation, primarily\ninvolving TNF and NF-kB pathways. Processes upregulated involved genes\nplaying pivotal roles in leukocyte migration, adaptive and native\nimmune function, cell activation, chemoattraction, and differentiation\n(e.g., Trem2 and Cxcl10). The simultaneous activation of both apoptotic\nand inflammatory pathways is consistent with our histological results\nand, importantly, aligns with the message of a recent review reporting\nthat apoptosis and the apoptotic machinery can be rewired into an\ninflammatory process. In addition, we provide evidence for the\nupregulation of the carbohydrate\nmetabolism (KEGG enrichment analysis), which also has a direct histopathological\nmanifestation (glycogen depletion). This aligns with earlier results, 5 Conclusions Low-dose, short-term intraperitoneal\nexposure to FB1 and the combination\nof classical and omics-type methods represent an innovative approach\nto the investigation of hepatotoxicity in mycotoxin research. FB1\ntreatment evoked marked lipidomic profile alterations in the liver\nof male rats. This study newly revealed the perturbation of several\nGPL fractions (PE, LPE, PG, LPG, CL, PC-O, and PE-P), probably in\nrelation with the apoptotic/mitotic processes and the hydropic degeneration\nof the hepatocytes but plausibly affecting lysosomal and mitochondrial\nlipids as well. Reactive lipid fractions may refer to the outstanding\nimportance of AA in cellular reactions but did not undoubtedly confirm\nits role in inflammation; further research is needed to clarify the\nexact channeling of AA found in the major GPLs. The most important\npathways affected were the PI3K-Akt-PTEN, the NF-kB, and the sphingolipid/ceramide\nsignaling pathway (and proteomics would largely bridge the gap between\ntranscriptome and lipidome). The establishment of the links between\nhistopathological changes and lipidomic data reveals evidence for\nthe membrane-destructive, apoptotic (likely sphingolipid-mediated),\nand immunotoxic effects of FB1. This study newly identifies downregulation\nof carbohydrate and steroid metabolism. From a clinico-chemical and\nhistopathological viewpoint, the 1× dose is safe; however, lipidomics\nsensitively detected early biochemical reactions. Possible analytical\nlimitations may arise from the characteristics of the shotgun approach\n(primarily due to ion suppression effects and coelution of isomers,\nwhich might prevent the detection of very low-abundance species and\nresolution of isomeric structures, respectively). Supplementary Material This work was partially\nfunded by the Hungarian\nResearch Network (HUN-REN-MATE, Mycotoxins in the Food Chain research\ngroup) and by the Hungarian National Laboratory project RRF-2.3.1-21-2022-00007,\nand further by the Flagship Research Groups Programme by the Hungarian\nUniversity of Agriculture and Life Sciences. HCEMM has received funding\nfrom the EU’s Horizon 2020 research and innovation program\nunder grant agreement No. 739593 and KIM NKFIA 2022–2.1.1-NL-2022-00005.\nThis research was also funded by the National Research, Development\nand Innovation Office (2020–1.1.2-PIACI-KFI-2020-00079). The\nexpert help of Krisztina Kiss and Zsolt Egyházi (Moritz Kaposi\nTeaching Hospital, Department of Pathology) in histological section\npreparation is gratefully acknowledged, as is that of Dóra\nPéterfi-Szabó and Tamás Schieszl in the animal\nhandling and Erika Zukic in a lipidomic sample workup. This work is\ndedicated to the memory of Professor Imre Sarudi. The data sets\ngenerated during the current study are available partly in the appendix\nfile, while gene expression data in the GEO repository https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE286344 The Supporting Information\nis\navailable free of charge at https://pubs.acs.org/doi/10.1021/acs.jafc.5c05715 ( PDF Somatic data (bodyweight, feed intake, and organ weight),\ndose dependence regression model parameters, full lipidomics data\nset (nmol/mg wet weight), intergroup comparisons with t XLSX ∇ A.S. and\nM.P. contributed equally to the manuscript. András\nSzabó, Melinda Kovács, Gábor Balogh, Mária\nPéter, László Vígh, Ferenc Olasz:\nConceptualization. Mária Péter, Gábor Balogh,\nZoltán Kóta, Botond Timár, György Kövér,\nTibor Nagy, Nguyen Anh Thi, Patrik Gömbös, Brigitta\nBóta: Methodology. András Szabó, Brigitta Bóta,\nOmeralfaroug Ali, Örs Petneházy: Formal analysis and\ninvestigation. András Szabó, Mária Péter,\nOmeralfaroug Ali, Botond Timár: Writing - original draft. Mária\nPéter, Gábor Balogh, Omeralfaroug Ali, Agyarko Edward,\nÉva Varga-Visi: Writing - review and editing. András\nSzabó, Melinda Kovács, Zsolt Török, László\nVígh: Funding acquisition, supervision. The\nexperimental protocol\nwas authorized by the Food Chain Safety and Animal Health Directorate\nof the Somogy County Agricultural Office, under the permission number\nSO/31/01287-3/2022. All authors read and approved the final manuscript\nfor publication. The authors\ndeclare no competing financial interest. Abbreviations FB1 Fumonisin\nB1 NOAEL no observed\nadverse effect level Sa sphinganine So sphingosine PC phosphatidylcholine (diacyl) PC-O phosphatidylcholine\n(alkyl-acyl) PE phosphatidylethanolamine (diacyl) PE-P phosphatidylethanolamine (alkenyl-acyl) PI phosphatidylinositol PS phosphatidylserine PA phosphatidic acid PG phosphatidylglycerol BMP bis­(monoacylglycero)­phosphate CL cardiolipin L lyso derivatives Cer ceramide CerS ceramide synthase SM sphingomyelin TG triacylglycerol DG diacylglycerol CE cholesteryl ester Chol cholesterol MS mass spectrometry AST aspartate aminotransferase ALT alanine aminotransferase LDH lactate dehydrogenase CK creatine kinase HDL high density lipoprotein LDL low density lipoprotein GGT gamma-glutamyl\ntransferase DSM Firmenich World Mycotoxin Survey 2024 7 https://www.dsm.com/content/dam/dsm/anh/en/documents/REP_MTXsurvey_Q1_2024_EN_0424_61887.pdf Gelderblom W. C. A. Jaskiewicz K. Marasas W. F. O. Thiel P. G. Horak R. M. Vleggaar R. Kriek N. P. J. Fumonisins-Novel Mycotoxins with\nCancer-Promoting Activity Produced by Fusarium Moniliforme Appl. Environ. Microbiol. 1988 54 7 1806 1811 10.1128/aem.54.7.1806-1811.1988 2901247 PMC202749 Gao Z. Luo K. Zhu Q. Peng J. Liu C. Wang X. Li S. Zhang H. The Natural Occurrence, Toxicity Mechanisms and Management\nStrategies of Fumonisin B1: A Review Environ.\nPollut. 2023 320 121065 10.1016/j.envpol.2023.121065 36639041 Gelderblom W. C. A. Marasas W. F. O. Controversies\nin Fumonisin Mycotoxicology\nand Risk Assessment Hum. Exp. Toxicol. 2012 31 3 215 235 10.1177/0960327110395338 21278198 Martinez-Larranaga M.\nR. Anadon A. Diaz M. J. Fernandez-Cruz M. L. Martinez M. A. Frejo M. T. Martinez M. Fernandez R. Anton R. M. Morales M. E. Tafur M. Toxicokinetics and\nOral Bioavailability of Fumonisin B1 Vet. Hum.\nToxicol. 1999 41 6 357 362 10592940 Shephard G. S. Thiel P. G. Sydenham E. W. Vleggaar R. Alberts J. F. Determination\nof the Mycotoxin Fumonisin B1 and Identification of Its Partially\nHydrolysed Metabolites in the Faeces of Non-Human Primates Food Chem. Toxicol. Int. J. Publ. Br. Ind. Biol. Res. Assoc. 1994 32 1 23 29 10.1016/0278-6915(84)90032-2 8132161 Cai Q. Tang L. Wang J. S. Validation\nof Fumonisin Biomarkers\nin F344 Rats Toxicol. Appl. Pharmacol. 2007 225 1 28 39 10.1016/j.taap.2007.06.027 17904604 PMC2129219 Voss K. A. Riley R. T. Norred W. P. Bacon C. W. Meredith F. I. Howard P. C. Plattner R. D. Collins T. F. X. Hansen D. K. Porter J. K. An Overview of Rodent\nToxicities: Liver and Kidney\nEffects of Fumonisins and Fusarium Moniliforme Environ. Health Perspect. 2001 109 suppl 2 259 266 10.1289/ehp.01109s2259 11359694 PMC1240674 Loiseau N. Polizzi A. Dupuy A. Therville N. Rakotonirainy M. Loy J. Viadere J.-L. Cossalter A.-M. Bailly J.-D. Puel O. Kolf-Clauw M. Bertrand-Michel J. Levade T. Guillou H. Oswald I. P. New Insights\ninto the Organ-Specific Adverse Effects of Fumonisin B1: Comparison\nbetween Lung and Liver Arch. Toxicol. 2015 89 9 1619 1629 10.1007/s00204-014-1323-6 25155190 Chen Z. Zhou L. Yuan Q. Chen H. Lei H. Su J. Effect of Fumonisin\nB1 on Oxidative Stress and Gene Expression Alteration\nof Nutrient Transporters in Porcine Intestinal Cells J. Biochem. Mol. Toxicol. 2021 35 4 e22706 10.1002/jbt.22706 33443779 Norred W. P. Plattner R. D. Chamberlain W. J. Distribution and Excretion of [14C]­Fumonisin\nB1 in Male Sprague-Dawley Rats Nat. Toxins 1993 1 6 341 346 10.1002/nt.2620010604 8167955 Riley R. T. Wang E. Merrill A. H. Liquid\nChromatographic Determination\nof Sphmgamne and Sphingosine: Use of the Free Sphinganine-to-Sphingosine\nRatio as a Biomarker for Consumption of Fumonisins J. AOAC Int. 1994 77 2 533 540 10.1093/jaoac/77.2.533 Suzuki C. A. M. Hierlihy L. Barker M. Curran I. Mueller R. Bondy G. S. The Effects of Fumonisin B1 on Several Markers of Nephrotoxicity\nin Rats Toxicol. Appl. Pharmacol. 1995 133 2 207 214 10.1006/taap.1995.1143 7645015 Szabó A. Szabó-Fodor J. Kachlek M. Mézes M. Balogh K. Glávits R. Ali O. Zeebone Y. Y. Kovács M. Dose and Exposure Time-Dependent\nRenal and Hepatic\nEffects of Intraperitoneally Administered Fumonisin B 1 Toxins 2018 10 11 465 10.3390/toxins10110465 30424021 PMC6265755 Szabó A. Fébel H. Ali O. Kovács M. Fumonisin\nB1 Induced Compositional Modifications of the Renal and Hepatic Membrane\nLipids in Rats-Dose and Exposure Time Dependence Food Addit. Contam., Part A: Chem., Anal., Control, Exposure Risk\nAssess. 2019 36 11 1722 1739 10.1080/19440049.2019.1652772 31437116 Laurain J. Tardieu D. Matard-Mann M. Rodriguez M. A. Guerre P. Fumonisin B1 Accumulates in Chicken Tissues over Time\nand This Accumulation Was Reduced by Feeding Algo-Clay Toxins 2021 13 10 701 10.3390/toxins13100701 34678994 PMC8537492 Tardieu D. Matard-Mann M. Collén P. N. Guerre P. Strong Alterations\nin the Sphingolipid Profile of Chickens Fed a Dose of Fumonisins Considered\nSafe Toxins 2021 13 11 770 10.3390/toxins13110770 34822554 PMC8619408 Prelusky D. B. Trenholm H. L. Savard M. E. Pharmacokinetic Fate of 14C-Labelled\nFumonisin B1 in Swine Nat. Toxins 1994 2 2 73 80 10.1002/nt.2620020205 8075896 Norred W. P. Plattner R. D. Chamberlain W. J. Distribution\nand Excretion of [14C]­Fumonisin\nB1 in Male Sprague-Dawley Rats Nat. Toxins 1993 1 6 341 346 10.1002/nt.2620010604 8167955 Shephard G. S. Thiel P. G. Sydenham E. W. Savard M. E. Fate of a Single\nDose of 14C-Labelled Fumonisin B1 in Vervet Monkeys Nat. Toxins 1995 3 3 145 150 10.1002/nt.2620030305 7648023 Guerre P. Travel A. Tardieu D. Targeted Analysis of Sphingolipids\nin Turkeys Fed Fusariotoxins: First Evidence of Key Changes That Could\nHelp Explain Their Relative Resistance to Fumonisin Toxicity Int. J. Mol. Sci. 2022 23 5 2512 10.3390/ijms23052512 35269655 PMC8910753 Peillod C. Laborde M. Travel A. Mika A. Bailly J. D. Cleva D. Boissieu C. Le Guennec J. Albaric O. Labrut S. Froment P. Tardieu D. Guerre P. Toxic Effects of Fumonisins, Deoxynivalenol\nand Zearalenone\nAlone and in Combination in Ducks Fed the Maximum EUTolerated Level Toxins 2021 13 2 152 10.3390/toxins13020152 33669302 PMC7920068 Orsi R. B. Dilkin P. Xavier J. G. Aquino S. Rocha L. O. Corrêa B. Acute Toxicity\nof a Single Gavage Dose of Fumonisin\nB1 in Rabbits Chem. Biol. Interact. 2009 179 2–3 351 355 10.1016/j.cbi.2009.01.005 19330885 Lim C. W. Parker H. M. Vesonder R. F. Haschek W. M. Intravenous Fumonisin\nB1 Induces Cell Proliferation and Apoptosis in the Rat Nat. Toxins 1996 4 1 34 41 10.1002/19960401NT5 8680752 Szabó A. Szabó-Fodor J. Fébel H. Mézes M. Bajzik G. Kovács M. Oral Administration of Fumonisin\nB 1 Physiol. Int. 2016 103 3 321 333 10.1556/2060.103.2016.3.5 28229635 Tolleson W. H. Dooley K. L. Sheldon W. G. Thurman J. D. Bucci T. J. Howard P. C. The Mycotoxin Fumonisin Induces Apoptosis\nin Cultured\nHuman Cells and in Livers and Kidneys of Rats Adv. Exp. Med. Biol. 1996 392 237 250 10.1007/978-1-4899-1379-1_21 8850621 Voss K. Subchronic\nFeeding Study of the Mycotoxin Fumonisin B1 in B6C3F1Mice and Fischer\n344 Rats Fundam. Appl. Toxicol. 1995 24 1 102 110 10.1006/faat.1995.1012 7713333 Wang E. Norred W. P. Bacon C. W. Riley R. T. Merrill A. H. Inhibition\nof Sphingolipid Biosynthesis by Fumonisins. Implications for Diseases\nAssociated with Fusarium Moniliforme J. Biol.\nChem. 1991 266 22 14486 14490 10.1016/S0021-9258(18)98712-0 1860857 Riley R. T. Enongene E. Voss K. A. Norred W. P. Meredith F. I. Sharma R. P. Spitsbergen J. Williams D. E. Carlson D. B. Merrill A. H. Sphingolipid Perturbations as Mechanisms for Fumonisin\nCarcinogenesis Environ. Health Perspect. 2001 109 suppl 2 301 308 10.1289/ehp.01109s2301 11359699 PMC1240679 Riley R. T. Voss K. A. Differential Sensitivity\nof Rat Kidney and Liver to\nFumonisin Toxicity: Organ-Specific Differences in Toxin Accumulation\nand Sphingoid Base Metabolism Toxicol. Sci.\nOff. J. Soc. Toxicol. 2006 92 1 335 345 10.1093/toxsci/kfj198 16613836 Pewzner-Jung Y. Ben-Dor S. Futerman A. H. When Do Lasses (Longevity Assurance\nGenes) Become CerS (Ceramide Synthases)?: Insights into the Regulation\nof Ceramide Synthesis J. Biol. Chem. 2006 281 35 25001 25005 10.1074/jbc.R600010200 16793762 Merrill A. H. Van Echten G. Wang E. Sandhoff K. Fumonisin B1 Inhibits\nSphingosine (Sphinganine) N-Acyltransferase and de Novo Sphingolipid\nBiosynthesis in Cultured Neurons in Situ J.\nBiol. Chem. 1993 268 36 27299 27306 10.1016/S0021-9258(19)74249-5 8262970 Merrill A. H. Sullards M. C. Wang E. Voss K. A. Riley R. T. Sphingolipid\nMetabolism: Roles in Signal Transduction and Disruption by Fumonisins Environ. Health Perspect. 2001 109 suppl 2 283 289 10.1289/ehp.01109s2283 PMC1240677 11359697 Ali O. Mézes M. Balogh K. Kovács M. Turbók J. Szabó A. Fumonisin B Series Mycotoxins’\nDose Dependent Effects on the Porcine Hepatic and Pulmonary Phospholipidome Toxins 2022 14 11 803 10.3390/toxins14110803 36422977 PMC9696778 Guerre P. Lassallette E. Guerre A. Tardieu D. Effects of the Maximum\nRecommended Levels of Fumonisins in the EU on Oxylipin Profiles in\nthe Liver and Brain of Chickens Antioxidants 2024 14 1 19 10.3390/antiox14010019 39857353 PMC11762805 Péter M. Glatz A. Gudmann P. Gombos I. Török Z. Horváth I. Vígh L. Balogh G. Metabolic Crosstalk\nbetween Membrane and Storage Lipids Facilitates Heat Stress Management\nin Schizosaccharomyces Pombe PLoS One 2017 12 3 e0173739 10.1371/journal.pone.0173739 28282432 PMC5345867 Herzog R. Schuhmann K. Schwudke D. Sampaio J. L. Bornstein S. R. Schroeder M. Shevchenko A. LipidXplorer: A Software for Consensual\nCross-Platform Lipidomics PLoS One 2012 7 1 e29851 10.1371/JOURNAL.PONE.0029851 22272252 PMC3260173 Liebisch G. Vizcaíno J. A. Köfeler H. Trötzmüller M. Griffiths W. J. Schmitz G. Spener F. Wakelam M. J. O. Shorthand\nNotation for Lipid Structures Derived from Mass Spectrometry J. Lipid Res. 2013 54 6 1523 1530 10.1194/jlr.M033506 23549332 PMC3646453 Tóth M. E. Dukay B. Péter M. Balogh G. Szűcs G. Zvara A. ´. Szebeni G. J. Hajdu P. Sárközy M. Puskás L. G. Török Z. Csont T. Vígh L. Sántha M. Male and Female Animals Respond Differently to High-Fat\nDiet and Regular Exercise Training in a Mouse Model of Hyperlipidemia Int. J. Mol. Sci. 2021 22 8 4198 10.3390/ijms22084198 33919597 PMC8073713 Szabó A. Nagy S. Ali O. Gerencsér Z. Mézes M. Balogh K. M. Bartók T. Horváth L. Mouhanna A. Kovács M. A 65-Day Fumonisin\nB Exposure at High Dietary Levels Has Negligible Effects on the Testicular\nand Spermatological Parameters of Adult Rabbit Bucks Toxins 2021 13 4 237 10.3390/toxins13040237 33806221 PMC8066801 SPSS for Windows SPSS\nInc. Chicago, IL, U 2012 R Core Team R A Language and Environment for Statistical Computing.\nR Foundation for Statistical Computing, Vienna. - References - Scientific\nResearch Publishing 2018 https://www.scirp.org/(S(lz5mqp453edsnp55rrgjct55))/reference/ReferencesPapers.aspx?ReferenceID=2342186 Rohart F. Gautier B. Singh A. LêCao K.-A. mixOmics:\nAn R Package for ‘omics Feature Selection and Multiple Data\nIntegration PLoS Comput. Biol. 2017 13 11 e1005752 10.1371/journal.pcbi.1005752 29099853 PMC5687754 Luo W. Pant G. Bhavnasi Y. K. Blanchard S. G. Brouwer C. Pathview Web: User Friendly Pathway\nVisualization and\nData Integration Nucleic Acids Res. 2017 45 W1 W501 W508 10.1093/nar/gkx372 28482075 PMC5570256 Dongjun C. Sunduz K. Sparse Partial Least\nSquares Classification for High\nDimensional Data Stat. Appl. Genet. Mol. Biol. 2010 9 1 1 32 10.2202/1544-6115.1492 20361856 PMC2861314 Xia J. Psychogios N. Young N. Wishart D. S. MetaboAnalyst: A\nWeb Server for Metabolomic Data Analysis and Interpretation Nucleic Acids Res. 2009 37 Web Server W652 W660 10.1093/NAR/GKP356 19429898 PMC2703878 Wu T. Hu E. Xu S. Chen M. Guo P. Dai Z. Feng T. Zhou L. Tang W. Zhan L. Fu X. Liu S. Bo X. Yu G. clusterProfiler 4.0:\nA universal enrichment tool for interpreting omics data Innovation (Camb) 2021 2 3 100141 10.1016/j.xinn.2021.100141 34557778 PMC8454663 Voss K. A. Chamberlain W. J. Bacon C. W. Norred W. P. A Preliminary\nInvestigation\non Renal and Hepatic Toxicity in Rats Fed Purified Fumonisin B1 Nat. Toxins 1993 1 4 222 228 10.1002/nt.2620010404 8167938 Bondy G. S. Barker M. G. Lombaert G. A. Armstrong C. L. Fernie S. M. Gurofsky S. Huzel V. Savard M. E. Curran I. H. A. A Comparison of Clinical, Histopathological and Cell-Cycle\nMarkers in Rats Receiving the Fungal Toxins Fumonisin B1 or Fumonisin\nB2 by Intraperitoneal Injection Food Chem.\nToxicol. Int. J. Publ. Br. Ind. Biol. Res. Assoc. 2000 38 10 873 886 10.1016/S0278-6915(00)00084-3 11039321 Sousa M. C. S. Galli G. M. Alba D. F. Griss L. G. Gebert R. R. Souza C. F. Baldissera M. D. Gloria E. M. Mendes R. E. Zanelato G. O. Gris A. Boiago M. M. Stefani L. M. da Silva A. S. Pathogenetic Effects\nof Feed Intake Containing of Fumonisin\n(Fusarium Verticillioides) in Early Broiler Chicks and Consequences\non Weight Gain Microb. Pathog. 2020 147 104247 10.1016/j.micpath.2020.104247 32437833 Qian G. Tang L. Lin S. Xue K. S. Mitchell N. J. Su J. Gelderblom W. C. Riley R. T. Phillips T. D. Wang J. S. Sequential Dietary\nExposure to Aflatoxin B1 and Fumonisin\nB1 in F344 Rats Increases Liver Preneoplastic Changes Indicative of\na Synergistic Interaction Food Chem. Toxicol.\nInt. J. Publ. Br. Ind. Biol. Res. Assoc. 2016 95 188 195 10.1016/j.fct.2016.07.017 PMC5010177 27430420 Merrill A. H. Lingrell S. Wang E. Nikolova-Karakashian M. Vales T. R. Vance D. E. Sphingolipid Biosynthesis de Novo\nby Rat Hepatocytes in Culture. Ceramide and Sphingomyelin Are Associated\nwith, but Not Required for, Very Low Density Lipoprotein Secretion J. Biol. Chem. 1995 270 23 13834 13841 10.1074/jbc.270.23.13834 7775441 Bondy G. Barker M. Mueller R. Fernie S. Miller J. D. Armstrong C. Hierlihy S. L. Rowsell P. Suzuki C. Fumonisin\nB1 Toxicity in Male Sprague-Dawley Rats Adv.\nExp. Med. Biol. 1996 392 251 264 10.1007/978-1-4899-1379-1_22 8850622 Moon W. S. Kim J. H. Kang M. J. Lee D. G. Early Ultrastructural\nChanges of Apoptosis Induced by Fumonisin B1 in Rat Liver Yonsei Med. J. 2000 41 2 195 204 10.3349/ymj.2000.41.2.195 10817019 Miller M. A. Zachary J. F. Mechanisms and Morphology of Cellular\nInjury, Adaptation,\nand Death Pathol. Basis Vet. Dis. 2017 2 10.1016/B978-0-323-35775-3.00001-1 Szabó A. Szabó-Fodor J. Fébel H. Romvári R. Kovács M. Individual\nand Combined Haematotoxic Effects of Fumonisin\nB1 and T-2 Mycotoxins in Rabbits Food Chem.\nToxicol. 2014 72 257 264 10.1016/j.fct.2014.07.025 25092395 Szabó A. Emri M. Tóth Z. Fajtai D. Donkó T. PetneházyKőrösiRepa Ö.D.\nI. Takács A. Kisiván T. Gerencsér Z. Ali O. Turbók J. Bóta B. Gömbös P. Romvári R. Kovács M. Romvári R. Kovács M. Measurement\nof Hepatic Glucose (18F-Fluorodeoxyglucose) Uptake with Positron Emission\nTomography-Magnetic Resonance Imaging in Fumonisin B Intoxicated Rabbit\nBucks Sci. Rep. 2024 14 1 18213 10.1038/s41598-024-68210-3 39107361 PMC11303394 Ali O. Agyarko E. Gerencsér Z. Balogh K. Mézes M. Kovács M. Maki M. Besselma N. Yakubu H. G. Szabó A. Differential Organ Responses to Fumonisins in Rabbits:\nKidney, Liver, and Spleen Membrane Fatty Acid Composition, Oxidation\nMarkers, and Histopathology Front. Vet. Sci. 2025 12 1599805 10.3389/fvets.2025.1599805 40557267 PMC12185305 De\nToni L. Di Nisio A. Rocca M. S. Guidolin D. Della Marina A. Bertazza L. Sut S. Purpura E. Pannella M. Garolla A. Foresta C. Exposure to Perfluoro-Octanoic Acid\nAssociated With Upstream Uncoupling of the Insulin Signaling in Human\nHepatocyte Cell Line Front. Endocrinol. 2021 12 632927 10.3389/fendo.2021.632927 PMC8446511 34539566 Riley R. T. Merrill A. H. Ceramide Synthase Inhibition by Fumonisins:\nA Perfect\nStorm of Perturbed Sphingolipid Metabolism, Signaling, and Disease J. Lipid Res. 2019 60 7 1183 1189 10.1194/jlr.S093815 31048407 PMC6602133 Guerre P. Lassallette E. Beaujardin-Daurian U. Travel A. Fumonisins Alone or\nMixed with Other Fusariotoxins Increase the C22–24:C16 Sphingolipid\nRatios in Chicken Livers, While Deoxynivalenol and Zearalenone Have\nNo Effect Chem. Biol. Interact. 2024 395 111005 10.1016/j.cbi.2024.111005 38615975 Lassallette E. Collén P. N. Guerre P. Targeted Sphingolipidomics\nIndicates\nIncreased C22-C24:16 Ratios of Virtually All Assayed Classes in Liver,\nKidney, and Plasma of Fumonisin-Fed Chickens Ecotoxicol. Environ. Saf. 2023 268 115697 10.1016/j.ecoenv.2023.115697 37979349 Tardieu D. Matard-Mann M. Collén P. N. Guerre P. Strong Alterations\nin the Sphingolipid Profile of Chickens Fed a Dose of Fumonisins Considered\nSafe Toxins 2021 13 770 10.3390/toxins13110770 34822554 PMC8619408 Gelderblom W. C. Smuts C. M. Abel S. Snyman S. D. Van der\nWesthuizen L. Huber W. W. Swanevelder S. Effect of\nFumonisin B1 on the Levels and Fatty Acid Composition of Selected\nLipids in Rat Liver in Vivo Food Chem. Toxicol.\nInt. J. Publ. Br. Ind. Biol. Res. Assoc. 1997 35 7 647 656 10.1016/S0278-6915(97)00036-7 9301647 Burger H. M. Abel S. Gelderblom W. C. A. Modulation\nof Key Lipid Raft Constituents\nin Primary Rat Hepatocytes by Fumonisin B1 - Implications for Cancer\nPromotion in the Liver Food Chem. Toxicol.\nInt. J. Publ. Br. Ind. Biol. Res. Assoc. 2018 115 34 41 10.1016/j.fct.2018.03.004 29510220 Riedel S. Abel S. Burger H.-M. van der\nWesthuizen L. Swanevelder S. Gelderblom W. C. A. Differential\nModulation of the Lipid\nMetabolism as a Model for Cellular Resistance to Fumonisin B1-Induced\nCytotoxic Effects in Vitro Prostaglandins Leukot.\nEssent. Fatty Acids 2016 109 39 51 10.1016/j.plefa.2016.04.006 27269712 Riedel S. Abel S. Burger H. M. Swanevelder S. Gelderblom W. C. A. Fumonisin B1 Protects against Long-Chained\nPolyunsaturated\nFatty Acid-Induced Cell Death in HepG2 Cells - Implications for Cancer\nPromotion Biochim. Biophys. Acta Biomembr. 2024 1866 5 184310 10.1016/j.bbamem.2024.184310 38479610 Ali O. Szabó A. Fumonisin\nDistorts the Cellular Membrane Lipid Profile:\nA Mechanistic Insight Toxicology 2024 506 153860 10.1016/j.tox.2024.153860 38871209 Riedel S. Abel S. Swanevelder S. Gelderblom W. C. A. Induction\nof an Altered Lipid Phenotype by Two Cancer Promoting Treatments in\nRat Liver Food Chem. Toxicol. Int. J. Publ.\nBr. Ind. Biol. Res. Assoc. 2015 78 96 104 10.1016/j.fct.2015.01.023 25656646 Wang X. Schmitt M. V. Xu L. Jiao Y. Guo L. Lienau P. Reichel A. Liu X. Quantitative Molecular\nTissue Atlas of Bis­(Monoacylglycero)­Phosphate and Phosphatidylglycerol\nMembrane Lipids in Rodent Organs Generated by Methylation Assisted\nHigh Resolution Mass Spectrometry Anal. Chim.\nActa 2019 1084 60 70 10.1016/j.aca.2019.07.060 31519235 Nguma E. Tominaga Y. Yamashita S. Otoki Y. Yamamoto A. Nakagawa K. Miyazawa T. Kinoshita M. Dietary PlsEtn\nAmeliorates Colon Mucosa Inflammatory Stress and ACF in DMH-Induced\nColon Carcinogenesis Mice: Protective Role of Vinyl Ether Linkage Lipids 2021 56 2 167 180 10.1002/lipd.12283 32989804 Rao S. Walters K. B. Wilson L. Chen B. Bolisetty S. Graves D. Barnes S. Agarwal A. Kabarowski J. H. Early Lipid\nChanges in Acute Kidney Injury Using SWATH Lipidomics Coupled with\nMALDI Tissue Imaging Am. J. Physiol. Ren. Physiol. 2016 310 1136 1147 10.1152/ajprenal.00100.2016 PMC4889318 26911846 Marqueño A. Blanco M. Maceda-Veiga A. Porte C. Skeletal Muscle Lipidomics\nas a New Tool to Determine Altered Lipid Homeostasis in Fish Exposed\nto Urban and Industrial Wastewaters Environ.\nSci. Technol. 2019 53 14 8416 8425 10.1021/acs.est.9b02064 31241908 Benjamin D. I. Cozzo A. Ji X. Roberts L. S. Louie S. M. Mulvihill M. M. Luo K. Nomura D. K. Ether Lipid Generating\nEnzyme AGPS Alters the Balance of Structural and Signaling Lipids\nto Fuel Cancer Pathogenicity Proc. Natl. Acad.\nSci. U.S.A. 2013 110 37 14912 14917 10.1073/pnas.1310894110 23980144 PMC3773741 Sztolsztener K. Chabowski A. Harasim-Symbor E. Bielawiec P. Konstantynowicz-Nowicka K. Arachidonic Acid as an Early Indicator\nof Inflammation during Non-Alcoholic Fatty Liver Disease Development Biomolecules 2020 10 8 1133 10.3390/BIOM10081133 32751983 PMC7464179 Murphy R. C. Folco G. Lysophospholipid Acyltransferases\nand Leukotriene Biosynthesis: Intersection\nof the Lands Cycle and the Arachidonate PI Cycle J. Lipid Res. 2019 60 2 219 226 10.1194/jlr.S091371 30606731 PMC6358305 Kuwata H. Hara S. Role of Acyl-CoA Synthetase ACSL4 in Arachidonic Acid Metabolism Prostaglandins Other Lipid Mediat. 2019 144 106363 10.1016/j.prostaglandins.2019.106363 31306767 Sung Y. K. Hwang S. Y. Park M. K. Bae H. I. Kim W. H. Kim J. C. Kim M. Fatty Acid-CoA Ligase 4 Is Overexpressed\nin Human Hepatocellular Carcinoma Cancer Sci. 2003 94 5 421 424 10.1111/j.1349-7006.2003.tb01458.x 12824887 PMC11160225 Burger H.-M. Abel S. Snijman P. W. Swanevelder S. Gelderblom W. C. A. Altered Lipid Parameters in Hepatic\nSubcellular Membrane\nFractions Induced by Fumonisin B1 Lipids 2007 42 3 249 261 10.1007/s11745-007-3025-9 17393230 Abdul N. S. Chuturgoon A. A. Fumonisin\nB1 Regulates LDL Receptor and ABCA1 Expression\nin an LXR Dependent Mechanism in Liver (HepG2) Cells Toxicon 2021 190 58 64 10.1016/j.toxicon.2020.12.011 33338448 Régnier M. Gourbeyre P. Pinton P. Napper S. Laffite J. Cossalter A.-M. Bailly J.-D. Lippi Y. Bertrand-Michel J. Bracarense A. P. F. R. L. Guillou H. Loiseau N. Oswald I. P. Identification of Signaling Pathways Targeted by the\nFood Contaminant FB1: Transcriptome and Kinome Analysis of Samples\nfrom Pig Liver and Intestine Mol. Nutr. Food\nRes. 2017 61 12 1700433 10.1002/mnfr.201700433 28875582 Yang L. Y. Kuksis A. Myher J. J. Pang H. Surface Components\nof Chylomicrons from Rats Fed Glyceryl or Alkyl Esters of Fatty Acids:\nMinor Components Lipids 1992 27 8 613 618 10.1007/BF02536119 1406072 Zhu C. Huai Q. Zhang X. Dai H. Li X. Wang H. Insights into the Roles and Pathomechanisms of Ceramide and Sphigosine-1-Phosphate\nin Nonalcoholic Fatty Liver Disease Int. J.\nBiol. Sci. 2023 19 1 311 330 10.7150/ijbs.78525 36594091 PMC9760443 Slieker R. C. Donnelly L. A. Akalestou E. Lopez-Noriega L. Melhem R. Güneş A. Abou Azar F. Efanov A. Georgiadou E. Muniangi-Muhitu H. Sheikh M. Giordano G. N. Åkerlund M. Ahlqvist E. Ali A. Banasik K. Brunak S. Barovic M. Bouland G. A. Burdet F. Canouil M. Dragan I. Elders P. J. M. Fernandez C. Festa A. Fitipaldi H. Froguel P. Gudmundsdottir V. Gudnason V. Gerl M. J. van der Heijden A. A. Jennings L. L. Hansen M. K. Kim M. Leclerc I. Klose C. Kuznetsov D. Mansour Aly D. Mehl F. Marek D. Melander O. Niknejad A. Ottosson F. Pavo I. Duffin K. Syed S. K. Shaw J. L. Cabrera O. Pullen T. J. Simons K. Solimena M. Suvitaival T. Wretlind A. Rossing P. Lyssenko V. Legido Quigley C. Groop L. Thorens B. Franks P. W. Lim G. E. Estall J. Ibberson M. Beulens J. W. J. ’t Hart L. M. Pearson E. R. Rutter G. A. Identification\nof Biomarkers for Glycaemic Deterioration in Type 2 Diabetes Nat. Commun. 2023 14 1 2533 10.1038/s41467-023-38148-7 37137910 PMC10156700 Babenko N. A. Kharchenko V. S. Effects\nof Inhibitors of Key Enzymes of Sphingolipid\nMetabolism on Insulin-Induced Glucose Uptake and Glycogen Synthesis\nin Liver Cells of Old Rats Biochem. Mosc. 2015 80 1 104 112 10.1134/S0006297915010125 25754045 Tičinović-Kurir T. Čikeš-Čulić V. Zemunik T. Grković I. Terzić J. Padovan M. Petri N. M. Markotić A. Immunohistochemical\nAnalysis of Hepatic Ganglioside Distribution Following a Partial Hepatectomy\nand Exposure to Different Hyperbaric Oxygen Treatments Acta Histochem. 2008 110 1 66 75 10.1016/j.acthis.2007.09.001 18035401 Cao C. Xian R. Lin F. Li X. Li X. Qiang F. Li X. Fumonisin B1 Induces Hepatotoxicity\nin Mice through the Activation of Oxidative Stress, Apoptosis and\nFibrosis Chemosphere 2022 296 133910 10.1016/j.chemosphere.2022.133910 35143865 Régnier M. Polizzi A. Lukowicz C. Smati S. Lasserre F. Lippi Y. Naylies C. Laffitte J. Bétoulières C. Montagner A. Ducheix S. Gourbeyre P. Ellero-Simatos S. Menard S. Bertrand-Michel J. Al Saati T. Lobaccaro J. M. Burger H. M. Gelderblom W. C. Guillou H. Oswald I. P. Loiseau N. The Protective Role\nof Liver X Receptor (LXR) during Fumonisin B1-Induced Hepatotoxicity Arch. Toxicol. 2019 93 2 505 517 10.1007/s00204-018-2345-2 30448865 Voss K. A. Smith G. W. Haschek W. M. Fumonisins: Toxicokinetics,\nMechanism\nof Action and Toxicity Anim. Feed Sci. Technol. 2007 137 3–4 299 325 10.1016/j.anifeedsci.2007.06.007 Chen L. Guo D. The Functions of Tumor\nSuppressor PTEN in Innate and Adaptive Immunity Cell. Mol. Immunol. 2017 14 7 581 589 10.1038/cmi.2017.30 28603282 PMC5520418 Bock F. J. Riley J. S. When Cell Death Goes Wrong: Inflammatory Outcomes of\nFailed Apoptosis and Mitotic Cell Death Cell\nDeath Differ. 2023 30 2 293 303 10.1038/s41418-022-01082-0 36376381 PMC9661468 Cuzzocrea S. Di Paola R. Genovese T. Mazzon E. Esposito E. Crisafulli C. Bramanti P. Salvemini D. Anti-Inflammatory\nand Anti-Apoptotic Effects of Fumonisin B1, an Inhibitor of Ceramide\nSynthase, in a Rodent Model of Splanchnic Ischemia and Reperfusion\nInjury J. Pharmacol. Exp. Ther. 2008 327 1 45 57 10.1124/jpet.108.139808 18612046 Mao X. Liu S. Ge L. Du H. Yue D. Hou L. Huang K. Chen X. mTOR-Mediated\nAutophagy Regulates\nFumonisin B1-Induced Intestinal Inflammation via Pyroptosis In Vivo\nand In Vitro J. Agric. Food Chem. 2022 70 29 9187 9200 10.1021/acs.jafc.2c03025 35830273 Singh M. P. Kang S. C. Endoplasmic Reticulum\nStress-Mediated Autophagy Activation\nAttenuates Fumonisin B1 Induced Hepatotoxicity in Vitro and in Vivo Food Chem. Toxicol. 2017 110 371 382 10.1016/j.fct.2017.10.054 29097114 Wu W. Vesonder R. F. Inhibition of Gluconeogenesis\nin Cultured Chicken Embryo\nHepatocytes by Fusarium Metabolites Nat. Toxins 1997 5 2 80 85 10.1002/(SICI)(1997)5:2&#x0003c;80::AID-NT5&#x0003e;3.0.CO;2-G 9131594 ",
  "metadata": {
    "Title of this paper": "Inhibition of Gluconeogenesis\nin Cultured Chicken Embryo\nHepatocytes by Fusarium Metabolites",
    "Journal it was published in:": "Journal of Agricultural and Food Chemistry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12492397/"
  }
}