{
  "title": "Paper_563",
  "abstract": "pmc Vaccines (Basel) Vaccines (Basel) 2764 vaccines vaccines Vaccines 2076-393X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474387 PMC12474387.1 12474387 12474387 41012179 10.3390/vaccines13090976 vaccines-13-00976 1 Review Messenger RNA and Plasmid DNA Vaccines for the Treatment of Cancer https://orcid.org/0000-0001-6849-3225 Moseman Jena E. Shim Daeun Jeon Donghwan https://orcid.org/0000-0003-1957-1164 Rastogi Ichwaku Schneider Kaitlyn M. https://orcid.org/0000-0003-1471-6723 McNeel Douglas G. * de Freitas Antonio Carlos Academic Editor Department of Medicine, Carbone Cancer Center, University of Wisconsin-Madison, 1111 Highland Avenue, Madison, WI 53705, USA; jemoseman@wisc.edu dshim6@wisc.edu donghwan.jeon@wisc.edu irastogi@wisc.edu kmschneider6@wisc.edu * dm3@medicine.wisc.edu 14 9 2025 9 2025 13 9 497676 976 31 7 2025 09 9 2025 11 9 2025 14 09 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Immunotherapy is now an established therapy for nearly a third of patients with cancer. Most therapies, typically using cytokines or checkpoint blockade therapy, rely on global activation of immune effector cells. The ability of vaccines to activate specific populations of cells has led to a renewed interest in their ability to treat cancers, either alone or with other immune therapies or other conventional therapies. The COVID-19 pandemic sparked a new interest in nucleic acid vaccines with the development of new technologies and the short manufacturing time for vaccine implementation. Nucleic acid-based cancer vaccines have been studied for decades, but have shown modest anti-tumor efficacy as monotherapies, as many of these vaccines encode for shared tumor-associated antigens (TAAs) and must overcome immune tolerance. New developments, technologies, routes of delivery, and combination therapies have paved the way for new approaches and clinical trials involving nucleic acid vaccines for the treatment of cancer. Here we review mRNA and pDNA vaccines for the treatment of cancer, including similarities and differences in their mechanisms of action, an overview of these treatment modalities in preclinical and clinical studies, methods to improve these vaccine strategies, and exciting new combination approaches in development. cancer immunotherapy cancer vaccines RNA vaccine DNA vaccine National Institutes of Health P30 CA014520 P50 CA269011 This work was supported, in part, by the National Institutes of Health (P30 CA014520 and P50 CA269011). The content is solely the responsibility of the authors and does not necessarily represent the official views of the NIH. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction to Nucleic Acid Vaccines for the Treatment of Cancer Cancer incidence and mortality remain a major global concern, with 20 million new cases diagnosed and 9.7 million deaths in the year 2022 alone [ 1 2 3 Cancer vaccines are a way to “train” the body’s immune system to recognize and kill the tumor. Cancer vaccines developed as a concept in the late 1800s when Dr. William Coley observed tumor regressions after patients were injected with inactivated bacteria [ 4 5 6 7 8 9 Nucleic acid vaccines are advantageous to various cancer vaccine platforms due to their cost, ease of manufacture, and safety profile. The first DNA vaccine to enter human clinical trials was a vaccine targeting HIV in 1998 [ 10 11 NCT00003432 12 13 14 15 2. Mechanisms of Action of DNA Versus mRNA Vaccines 2.1. Mechanisms of Cellular Uptake and Antigen Presentation DNA and mRNA vaccines both elicit immune responses by enabling host cells to produce antigenic proteins that can activate the immune system [ 16 17 mRNA vaccines are typically directly introduced into the cytoplasm of target cells using either lipid nanoparticle carriers or electroporation. Following cellular uptake, which commonly occurs via endocytosis of mRNA-LNP complexes, the mRNA is released into the cytoplasm, where it is translated into the target antigen by ribosomes [ 18 19 20 21 22 In contrast, DNA vaccines require an additional step of entering the cell nucleus for transcription [ 23 24 25 16 26 27 While both mRNA and DNA vaccines can be taken up by a variety of cell types, including myocytes and fibroblasts at the site of injection, professional APCs, such as dendritic cells, macrophages, and B cells, are the most critical for the initiation of adaptive immune responses [ 28 29 30 31 32 33 34 A key aspect of both mRNA and DNA vaccine delivery systems is the use of ionizable lipids, which assist in endosomal escape [ 35 36 37 38 39 In summary, the key distinctions between DNA and mRNA vaccines lie in the requirement for DNA to reach the nucleus versus the cytoplasmic localization of mRNA, and in the mechanisms of delivery, processing, and antigen presentation. Both platforms have their unique advantages, but the more direct cytoplasmic pathway of mRNA may offer a more rapid and efficient means of inducing immune responses. 2.2. Mechanisms of Innate Immune Recognition Cells have inherent processes to recognize mRNA and DNA in the cell and send out “danger signals” when these molecules are recognized, generating an innate immune signaling cascade. The key sensors that recognize foreign RNA in the endosomes are Toll-like receptors (TLR) 3 and TLR 7/8 [ 40 40 41 42 43 44 44 44 2.3. Types of Immune Responses Generated by Immunization with mRNA or DNA Vaccines While no direct comparisons of the resulting immune responses generated by mRNA and DNA vaccines have been made, there have been reports of the types of immune responses generated by each of these types of vaccines. In the case of mRNA cancer vaccines, there have been reports of strong cell-mediated immunity, characterized by the generation of CD4+ and CD8+ antigen-specific immune responses [ 45 46 47 48 49 49 3. mRNA and DNA Vaccines in Preclinical Animal Models Encoding the Same Antigens Targets for tumor vaccines can be categorized into tumor-associated antigens (TAAs) and tumor-specific antigens (TSAs). TAAs are “shared” self-antigens which may be aberrantly expressed or overexpressed in tumor cells. In general, due to mechanisms of central and peripheral tolerance, TAAs are generally characterized by low immunogenicity, and T cell receptors often have low affinity for these antigens [ 50 51 52 53 While many preclinical studies have utilized mRNA and DNA vaccines for the treatment of cancer, no studies have directly compared mRNA and DNA vaccines in the same study. Therefore, here we will focus on studies that have examined either mRNA or DNA encoding the same antigen as a means of comparing their actions. Table 1 3.1. Mucin 1 (MUC1) MUC1 is a transmembrane glycoprotein on epithelial cells, with aberrant glycosylation linked to malignant cellular transformation. Aberrant expression of MUC1 has been found in several types of cancer, including gastric, breast, ovarian, and bladder cancers. Therefore, MUC1 has been one of the major targets for cancer vaccine development [ 75 54 55 Efforts to improve the efficacy of DNA vaccines have included strategies such as developing plasmid DNA that encodes multiple tumor antigens to address tumor heterogeneity. A DNA vaccine encoding MUC1 and survivin fusion antigens, VR-MS, increased in vitro killing of MUC1+ survivin+ B16 cells and significantly delayed tumor growth using a 100 μg dose [ 57 58 58 76 56 Although still in its early stages, research using mRNA vaccines encoding MUC1 is also underway. Mice inoculated with 4T1 mammary carcinoma cells had enhanced IFN-γ secretion and MUC1-specific CD8+ T cell killing when immunized with 10 μg of a MUC1 mRNA nanovaccine encapsulated in lipid/calcium/phosphate nanoparticles (LCP) compared to mRNA or LCP alone. However, additional combination of MUC1 LCP-mRNA with an anti-CTLA4 antibody was needed to enhance CD8+ T cell recruitment, inhibit the tumor-promoting STAT3 pathway, and further enhance anti-tumor responses in the murine triple negative breast cancer cells, in vivo [ 59 3.2. Melanoma Antigen Family A (MAGE-A) MAGE-A is a cancer-testis antigen (CTA) found in multiple cancer types such as melanoma, brain, breast, lung and ovarian cancers [ 77 78 60 79 61 61 In a study by Choi et al., investigators immunized groups of mice with MAGE-A3 mRNA encapsulated in various lipid nanoparticles, and inoculated mice with CT26 colorectal cancer cells two weeks later. Prophylactic use of 20 μg of MAGE-A3 mRNA encapsulated in various lipid nanoparticles significantly delayed tumor growth, limited lung and liver metastases, and prolonged survival compared to untreated control mice. Researchers repeated this study but administered lipid nanoparticle encapsulated MAGE-A3 mRNA post-tumor inoculation. Therapeutic vaccination post implantation of CT26 cells also delayed tumor growth, comparable to a standard chemotherapeutic agent doxorubicin, but without weight loss that occurred with chemotherapy. The vaccine enhanced humoral responses (IgG2a and IgG2b), although no significant changes in IFN-γ or IL-4 levels were observed in the sera. In vitro co-culture of splenocytes with tumor lysates did increase IL-4, although IFN-γ remained unchanged [ 62 3.3. Human Papillomavirus (HPV) HPV is one of the most prevalent sexually transmitted infections and accounts for approximately 5% of all cancer cases worldwide. The virus has been associated with cervical, vulvar, vaginal, anal, and head and neck cancers [ 80 81 63 64 Mycobacterium tuberculosis 65 66 HPV vaccines have also been developed using mRNA approaches. Immunization with 10 μg of mRNA-LNP encoding HPV E7 expanded HPV-specific CD8+ T cells in the spleen and blood of mice implanted with syngeneic HPV+ oropharyngeal squamous cell carcinoma (mEERL) cells [ 67 67 68 69 69 3.4. Kirsten Rat Sarcoma Viral Oncogene Homolog (KRAS) KRAS is a small GTPase that transduces signals from receptor tyrosine kinases to downstream pathways, regulating cell proliferation, differentiation, and transformation. Therefore, KRAS represents one of the commonly mutated proto-oncogenes, especially at the G12 residue, found in lung, pancreatic, and colon cancers [ 82 83 G12D G12D 70 72 73 3.5. Summary of Preclinical Models Encoding the Same Antigens In summary, while no studies to our knowledge have directly compared mRNA and DNA cancer vaccines, both types of vaccines have been able to successfully elicit cellular and humoral responses in murine preclinical and in vitro models, with increased cytokine secretion, and decreased tumor growth reported in most studies. Of note, higher doses of DNA, administered using alternative delivery methods such as gene gun devices or electroporation, were required to generate sufficient anti-tumor responses. This is not surprising given the requirement for DNA to enter the nucleus to be transcribed prior to translation. In contrast, in general, mRNA could be delivered in lower doses without assisted delivery devices, likely due to the protection of mRNA encapsulated in lipid nanoparticles along with the ability for direct translation in the cytoplasm. 4. Monotherapies of mRNA and DNA Vaccines in Human Clinical Trials Given the breadth and success of preclinical studies utilizing mRNA or DNA vaccines, many of these therapies have been translated to human clinical trials as cancer treatments. While DNA vaccines have largely been explored in clinical trials of breast, cervical, prostate, and melanoma cancers, mRNA vaccines have been predominantly tested in pancreatic and non-small cell lung cancers. Notably, target antigens of DNA vaccines were mostly TAAs, whereas many mRNA vaccines were designed to target patient-specific MANA or neoantigens such as KRAS G12D, G12V, G12C, or G13D mutations. Because of these distinctions, and the fact that very few clinical trials have been conducted using mRNA or DNA encoding the same antigens, we have focused on the clinical trials that have used mRNA or DNA vaccines as monotherapies, with or without adjuvants. Details of these recent clinical trials are summarized in Table 2 Summary of Human Clinical Trials Using Monotherapy mRNA or DNA Vaccines As highlighted in Table 2 In one trial, in which patients with melanoma received an mRNA vaccine encoding four shared antigens, NY-ESO-1, MAGE-A3, tyrosinase, and TPTE, 3 out of 25 patients exhibited partial responses and 7 of 25 patients had stable disease [ 94 94 NCT00698100 91 92 In general, whether the vector was mRNA or DNA based, many of these clinical trials exploring monotherapy vaccination noted antigen-specific CD4+ or CD8+ T cell responses. However, while these were mostly early phase trials without robust clinical endpoints, only a few of these clinical trials demonstrated any evidence clinical benefit, regardless of whether the vaccine vector was mRNA or DNA. These underwhelming clinical trial results underscore the need for better optimization of the route of delivery, stability of the molecule, targeting to antigen presenting cells, or the need of combination therapies to overcome mechanisms of immune resistance. 5. Methods to Improve mRNA and DNA Vaccines as Monotherapies Although nucleic acid vaccines are a promising approach for the treatment of cancer, their efficacy as monotherapies, as demonstrated from Table 2 5.1. Methods to Improve mRNA Vaccine Efficacy Of recent interest in the mRNA field is self-amplifying mRNA. Self-amplifying mRNA encodes viral replication machinery in addition to the gene of interest, resulting in mRNA that will replicate itself in vivo following uptake [ 110 110 110 111 111 112 112 113 Another area that is gaining interest in the mRNA field is the manipulation of lipid nanoparticles to increase targeted delivery to certain tissues. One major problem with standard LNP formulations is that many of these LNPs traffic to the liver, or cells that take up RNA/LNP formulations traffic to the liver. While this may be beneficial for diseases of the liver or cancers with liver metastases, many other malignancies may not benefit from liver trafficking. Therefore, recent efforts have focused on LNP modifications to target specific tissues of interest. The selective organ-targeting lipid nanoparticle (SORT) technique involves adding a fifth molecule to the standard four-component LNP to target specific organs such as lung, spleen, and liver [ 114 115 Finally, several groups have modified LNPs to increase their intrinsic ability to act as adjuvants or by directly incorporating adjuvants into the LNP or mRNA-LNP constructs. These methods have been extensively reviewed elsewhere in the past [ 116 117 118 119 120 5.2. Methods to Improve DNA Vaccine Efficacy Plasmid DNA vaccines, in general, have low immunogenicity when they are delivered passively by needle-syringe through intradermal, intramuscular, or subcutaneous routes. Therefore, several groups have focused their efforts on improving delivery methods to enhance DNA entry into the cells rather than rely on passive uptake. One of these methods is electroporation, which incorporates an electric pulse immediately after the needle-syringe delivery, allowing for the creation of pores in cell membranes to deliver DNA [ 121 122 123 124 125 122 Needleless immunization methods are increasing in popularity due to better tolerability by patients. Gene gun delivery of plasmid DNA was initially implemented in the 1990s to deliver DNA to plant cells, which are notoriously difficult to transfect [ 126 127 128 129 130 131 132 133 134 135 136 137 138 139 6. Combination Therapies Using mRNA or DNA Vaccines Due to the safety and immunogenicity observed in most small early-phase clinical trials, but lack of profound clinical efficacy, several groups have explored strategies combining nucleic acid vaccines with commonly used therapies or immune-modulating therapies in preclinical studies or human clinical trials. A summary of ongoing human clinical trials is presented in Table 3 6.1. Combination Therapies with Radiotherapy In addition to its direct cytotoxic effects, radiation can indirectly induce immunogenic changes in the tumor microenvironment. As radiation-induced DNA damage accumulates in tumor cells, mutations and genomic instability increase, leading to immunogenic cell death. The release of various DAMPs (e.g., HSP, ATP, CRT, and high mobility group box 1) activates macrophages and dendritic cells to enhance antigen presentation. Additionally, the expression of vascular adhesion molecules increases, and inflammatory cytokines and chemokines such as IL-1β, IL-23, and CXCL-10 are locally released. In surviving cancer cells, radiation can activate the cGAS/STING pathway to release type I IFN, further promoting the release of pro-inflammatory molecules, activation of dendritic cells and lymphocytes, and increased susceptibility to CD8+ T cell-mediated cytotoxicity. This cycle ultimately enhances the priming and activation of cytotoxic CD8+ T cells, leading to increased tumor cell killing [ 154 155 156 157 158 159 In one combination study, an E7-encoding RNA lipoplex (RNA-LPX) was administered to mice inoculated with HPV-related cancers, followed by 12Gy of local external beam radiation [ 160 160 Another study using a two-component mRNA cancer vaccine, consisting of free and complexed OVA-encoding mRNA, was tested in combination with external beam radiotherapy in mice bearing E.G7-OVA tumors [ 161 161 Using a similar ovalbumin-based model, we have explored radiopharmaceutical therapy (RPT) targeting the lipid rafts of tumor cells, 90 257-264 90 hi 90 90 162 Other studies have explored the combination of radiation with HPV-targeting nucleic acid vaccines. In one study, a single dose of 14Gy of external beam radiation was delivered to mice bearing E7-expressing TC-1 tumors, followed by three doses of CRT/E7(detox), a DNA construct encoding HPV16 E7 (modified to abrogate function but retain conformation) and fused to calreticulin (CRT) to enhance antigen presentation. The combination significantly delayed tumor growth and prolonged survival compared to either treatment alone. Additional timing studies revealed that when radiation was given at the time of the second dose of vaccination, significantly higher numbers of E7-specific IFN-γ+ CD8+ T cells were present in the splenocytes and the tumor [ 163 Very few clinical trials are currently exploring the use of radiation therapy in combination with nucleic acid vaccines. However, a clinical trial by Papachristofilou et al. examined combination therapy of an mRNA vaccine (300 μg of CV9202, encoding six non-small cell lung cancer antigens) along with 20Gy local radiation over the course of 57 days. Patients that received CV9202 and local radiation had immune responses to the six encoded antigens and increased antigen-specific CD4+ and CD8+ T cells over time [ 153 6.2. Combination Therapies with Immune Checkpoint Inhibitors (ICI) Blocking antibodies against the immune checkpoints PD-1, PD-L1, and/or CTLA-4 have been approved by FDA for the treatment of squamous cell head and neck cancer, melanoma, Merkel cell carcinoma, cutaneous squamous cell carcinoma, hepatocellular carcinoma, renal cell carcinoma, cervical cancer, small cell lung cancer, non-small cell lung cancer, triple negative breast cancer, gastric carcinoma, gastroesophageal junction carcinoma, Hodgkin lymphoma, advanced or metastatic urothelial cancer, primary mediastinal B-cell lymphoma, and cancers bearing microsatellite instability or mismatch repair deficiency [ 164 Multiple groups are studying mRNA vaccines in combination with immune checkpoint inhibitors. Jin et al. created a targeted mRNA vaccine incorporating a cGAS agonist into the LNP formulation to augment immunogenicity. In a LLC-OVA murine model, mice treated with the mRNA vaccine and PD-L1 blockade had reduced tumor growth, likely due to increased infiltration of cell immune cell types into the tumor and increased pro-inflammatory cytokines [ 165 3 166 167 148 140 140 Table 3 Several preclinical studies evaluating DNA vaccines in combination with ICIs have also been conducted. A study by Lopes et al. showed that combination therapy of a DNA vaccine encoding the P815A tumor antigen plus antibodies blocking PD-1 and CTLA-4 prolonged survival and reduced tumor growth in murine P815 mastocytoma [ 168 168 169 170 171 172 173 61 174 175 As depicted in Table 3 144 176 143 144 6.3. Combination Therapies with Toll-like Receptor Agonists mRNA and DNA vaccines have an inherent ability to act as self-adjuvants due to the ability to activate pattern-recognition receptors (PRRs), including toll-like receptors (TLRs) and RIG-I-like receptors. However, many studies suggest that there may be additional benefits to adding these innate immune sensor ligands as vaccine adjuvants [ 177 178 179 −/− 179 180 181 182 Similarly, co-administration of DNA vaccines with a TLR3 or TLR7 agonist showed a greater expansion of HPV E7-specific CD8+ T cells than DNA treatment alone, and the combination also induced significant regression of TC-1 tumors [ 183 184 Human clinical trials are also beginning to investigate the use of TLR agonists in combination with nucleic acid vaccines. Notably, in cervical cancer, one study is combining a TLR7 agonist (Imiquimod) with a DNA vaccine encoding E6 and E7 ( NCT00788164 185 6.4. Combination Therapies with Chemotherapy Chemotherapy is a standard treatment for many cancers, but it is often associated with immunosuppressive effects [ 186 187 188 189 190 191 192 193 194 195 196 Preclinical studies combining mRNA or DNA vaccines with chemotherapy have demonstrated enhanced antitumor effects compared to either treatment alone [ 197 198 161 199 In preclinical studies of DNA vaccines, combining DNA vaccination with cyclophosphamide has shown promise. In one study, mice were inoculated with 4T1 breast tumor cells on day 0, followed by 50 μg immunizations of a plasmid DNA vaccine encoding fibroblast activating protein-α (CpVR-FAP) into both the right and left tibia muscles on days 2, 9 and 16 post tumor implantation [ 200 200 198 198 163 In human clinical trials, studies are underway in breast cancer that combine DNA vaccines with chemotherapy. Although these studies are not yet completed, and preclinical data are limited, these initial studies suggest at least the feasibility of combining mRNA or DNA vaccines with chemotherapy. However, several challenges must be considered for these combination therapies. As demonstrated in the studies above, different timing regimens of the DNA or chemotherapy agents, or the dosing strategy, may affect tumor growth, survival, and antigen-specific T-cell generation. Therefore, future studies will need to refine the timing, dosing, and selection of chemotherapeutic agents to maximize synergy. 7. Concluding Remarks and Future Directions mRNA and DNA vaccines each have advantages and disadvantages. mRNA is rapidly degraded, has transient protein expression, and generally requires cold storage, which may limit its use in certain countries. DNA has the requirement of needing to reach the nucleus of antigen-presenting cells, which may mean higher doses, electroporators, or alternative delivery methods may need to be used to achieve the immunogenicity required to control tumor growth. Unfortunately, there have been no head-to-head studies in preclinical models or human trials using mRNA or DNA vaccines that encode the same antigen, and thus it remains difficult to determine whether one approach is preferred. Due to differences in uptake, cellular processing, recognition by different intracellular nucleic acid sensors, and antigen expression kinetics, it can be speculated that vaccination with mRNA or DNA may produce some differences in the phenotype and magnitude of immune responses generated. This will be an area of future research, to understand the optimal means to improve the anti-tumor efficacy of each approach. Notwithstanding, vast improvements in technology, delivery methods, and combination therapies have enabled nucleic acid vaccines to be more immunogenic than when they were first implemented for cancer treatments. It is expected that these newer approaches with greater immunogenicity will lead to greater anti-tumor efficacy in clinical trials. Newer gene delivery methods (including needless delivery methods and the use of self-amplifying constructs), the encoding of multiple antigens, the use of different adjuvants, and the use of nucleic acid vaccines in combination with other agents, are mostly still underway and in early stages of development, but have already shown promising results in a small number of clinical trials. In particular, clinical trials incorporating combination treatments of nucleic acid vaccines with checkpoint blockade and/or chemotherapy have already proven successful across many cancer types as evidenced by detectable antigen-specific T cell responses, prolonged recurrence-free survival, prolonged distant metastasis-free survival, and increased tumor infiltration of T cells ( Table 3 Disclaimer/Publisher’s Note: Author Contributions Conceptualization, J.E.M. and D.G.M.; writing—original draft preparation, J.E.M., D.S., D.J., I.R. and D.G.M.; writing—review and editing, J.E.M., D.S., D.J., I.R., K.M.S. and D.G.M.; supervision, D.G.M.; funding acquisition, D.G.M. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest D.G.M. is a member of the Scientific Advisory Board for PharmJet. The other authors have no relevant potential conflicts of interest. References 1. Bray F. Laversanne M. Sung H. Ferlay J. Siegel R.L. Soerjomataram I. Jemal A. Global Cancer Statistics 2022: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 2. Wang X. Zhang H. Chen X. Drug Resistance and Combating Drug Resistance in Cancer Cancer Drug Resist. 2019 2 141 160 10.20517/cdr.2019.10 34322663 PMC8315569 3. Ramos A. Sadeghi S. Tabatabaeian H. Battling Chemoresistance in Cancer: Root Causes and Strategies to Uproot Them Int. J. Mol. Sci. 2021 22 9451 10.3390/ijms22179451 34502361 PMC8430957 4. Coley W.B. The Treatment of Inoperable Sarcoma by Bacterial Toxins (the Mixed Toxins of the Streptococcus erysipelas Bacillus prodigiosus Proc. R. Soc. Med. 1910 3 1 48 10.1177/003591571000301601 PMC1961042 19974799 5. McCarthy E.F. The Toxins of William B. Coley and the Treatment of Bone and Soft-Tissue Sarcomas Iowa Orthop. J. 2006 26 154 158 16789469 PMC1888599 6. Larocca C. Schlom J. Viral Vector-Based Therapeutic Cancer Vaccines Cancer J. 2011 17 359 371 10.1097/PPO.0b013e3182325e63 21952287 PMC3207353 7. Zhou M. Tang Y. Xu W. Hao X. Li Y. Huang S. Xiang D. Wu J. Bacteria-Based Immunotherapy for Cancer: A Systematic Review of Preclinical Studies Front. Immunol. 2023 14 1140463 10.3389/fimmu.2023.1140463 37600773 PMC10436994 8. Abd-Aziz N. Poh C.L. Development of Peptide-Based Vaccines for Cancer J. Oncol. 2022 2022 9749363 10.1155/2022/9749363 35342400 PMC8941562 9. Tiwari A. Alcover K. Carpenter E. Thomas K. Krum J. Nissen A. Van Decar S. Smolinsky T. Valdera F. Vreeland T. Utility of Cell-Based Vaccines as Cancer Therapy: Systematic Review and Meta-Analysis Hum. Vaccines Immunother. 2024 20 2323256 10.1080/21645515.2024.2323256 PMC10984131 38544385 10. MacGregor R.R. Boyer J.D. Ugen K.E. Lacy K.E. Gluckman S.J. Bagarazzi M.L. Chattergoon M.A. Baine Y. Higgins T.J. Ciccarelli R.B. First Human Trial of a DNA-Based Vaccine for Treatment of Human Immunodeficiency Virus Type 1 Infection: Safety and Host Response J. Infect. Dis. 1998 178 92 100 10.1086/515613 9652427 11. Cheng F. Wang Y. Bai Y. Liang Z. Mao Q. Liu D. Wu X. Xu M. Research Advances on the Stability of mRNA Vaccines Viruses 2023 15 668 10.3390/v15030668 36992377 PMC10051489 12. Rosa S.S. Prazeres D.M.F. Azevedo A.M. Marques M.P.C. mRNA Vaccines Manufacturing: Challenges and Bottlenecks Vaccine 2021 39 2190 2200 10.1016/j.vaccine.2021.03.038 33771389 PMC7987532 13. Dolgin E. The Tangled History of mRNA Vaccines Nature 2021 597 318 324 10.1038/d41586-021-02483-w 34522017 14. Abbasi J. India’s New COVID-19 DNA Vaccine for Adolescents and Adults Is a First JAMA 2021 326 1365 10.1001/jama.2021.16625 34636874 15. Lamb Y.N. BNT162b2 mRNA COVID-19 Vaccine: First Approval Drugs 2021 81 495 501 10.1007/s40265-021-01480-7 33683637 PMC7938284 16. Leitner W.W. Ying H. Restifo N.P. DNA and RNA-Based Vaccines: Principles, Progress and Prospects Vaccine 1999 18 765 777 10.1016/S0264-410X(99)00271-6 10580187 PMC1986720 17. Bolhassani A. Javanzad S. Saleh T. Hashemi M. Aghasadeghi M.R. Sadat S.M. Polymeric Nanoparticles: Potent Vectors for Vaccine Delivery Targeting Cancer and Infectious Diseases Hum. Vaccines Immunother. 2014 10 321 332 10.4161/hv.26796 24128651 PMC4185908 18. Demongeot J. Fougère C. mRNA COVID-19 Vaccines-Facts and Hypotheses on Fragmentation and Encapsulation Vaccines 2022 11 40 10.3390/vaccines11010040 36679885 PMC9864138 19. Tenchov R. Bird R. Curtze A.E. Zhou Q. Lipid Nanoparticles—From Liposomes to mRNA Vaccine Delivery, a Landscape of Research Diversity and Advancement ACS Nano 2021 15 16982 17015 10.1021/acsnano.1c04996 34181394 20. Rock K.L. Reits E. Neefjes J. Present Yourself! By MHC Class I and MHC Class II Molecules Trends Immunol. 2016 37 724 737 10.1016/j.it.2016.08.010 27614798 PMC5159193 21. Del Prete A. Salvi V. Soriani A. Laffranchi M. Sozio F. Bosisio D. Sozzani S. Dendritic Cell Subsets in Cancer Immunity and Tumor Antigen Sensing Cell. Mol. Immunol. 2023 20 432 447 10.1038/s41423-023-00990-6 36949244 PMC10203372 22. Colbert J.D. Cruz F.M. Rock K.L. Cross-Presentation of Exogenous Antigens on MHC I Molecules Curr. Opin. Immunol. 2020 64 1 8 10.1016/j.coi.2019.12.005 31927332 PMC7343603 23. Kozak M. Hu J. DNA Vaccines: Their Formulations, Engineering and Delivery Vaccines 2024 12 71 10.3390/vaccines12010071 38250884 PMC10820593 24. Zhou R. Geiger R.C. Dean D.A. Intracellular Trafficking of Nucleic Acids Expert Opin. Drug Deliv. 2004 1 127 140 10.1517/17425247.1.1.127 16296725 PMC4346096 25. Al Fayez N. Nassar M.S. Alshehri A.A. Alnefaie M.K. Almughem F.A. Alshehri B.Y. Alawad A.O. Tawfik E.A. Recent Advancement in mRNA Vaccine Development and Applications Pharmaceutics 2023 15 1972 10.3390/pharmaceutics15071972 37514158 PMC10384963 26. Ledwith B.J. Manam S. Troilo P.J. Barnum A.B. Pauley C.J. Griffiths T.G. Harper L.B. Beare C.M. Bagdon W.J. Nichols W.W. Plasmid DNA Vaccines: Investigation of Integration into Host Cellular DNA Following Intramuscular Injection in Mice Intervirology 2000 43 258 272 10.1159/000053993 11251381 27. Hassett K.J. Rajlic I.L. Bahl K. White R. Cowens K. Jacquinet E. Burke K.E. mRNA Vaccine Trafficking and Resulting Protein Expression after Intramuscular Administration Mol. Ther. Nucleic Acids 2024 35 102083 10.1016/j.omtn.2023.102083 38161733 PMC10755037 28. Restifo N.P. Ying H. Hwang L. Leitner W.W. The Promise of Nucleic Acid Vaccines Gene Ther. 2000 7 89 92 10.1038/sj.gt.3301117 10673713 PMC2241736 29. Zeng C. Zhang C. Walker P.G. Dong Y. Formulation and Delivery Technologies for mRNA Vaccines Curr. Top. Microbiol. Immunol. 2022 440 71 110 10.1007/82_2020_217 32483657 PMC8195316 30. Bidram M. Zhao Y. Shebardina N.G. Baldin A.V. Bazhin A.V. Ganjalikhany M.R. Zamyatnin A.A. Ganjalikhani-Hakemi M. mRNA-Based Cancer Vaccines: A Therapeutic Strategy for the Treatment of Melanoma Patients Vaccines 2021 9 1060 10.3390/vaccines9101060 34696168 PMC8540049 31. Eusébio D. Neves A.R. Costa D. Biswas S. Alves G. Cui Z. Sousa Â. Methods to Improve the Immunogenicity of Plasmid DNA Vaccines Drug Discov. Today 2021 26 2575 2592 10.1016/j.drudis.2021.06.008 34214667 32. Colluru V.T. McNeel D.G. B Lymphocytes as Direct Antigen-Presenting Cells for Anti-Tumor DNA Vaccines Oncotarget 2016 7 67901 67918 10.18632/oncotarget.12178 27661128 PMC5356528 33. Rastogi I. McNeel D.G. B Cells Require Licensing by Dendritic Cells to Serve as Primary Antigen-Presenting Cells for Plasmid DNA Oncoimmunology 2023 12 2212550 10.1080/2162402X.2023.2212550 37205983 PMC10190194 34. Lee J. Ahn E. Kissick H.T. Ahmed R. Reinvigorating Exhausted T Cells by Blockade of the PD-1 Pathway Onco Ther. 2015 6 7 17 10.1615/ForumImmunDisTher.2015014188 PMC5341794 28286692 35. Zheng L. Bandara S.R. Tan Z. Leal C. Lipid Nanoparticle Topology Regulates Endosomal Escape and Delivery of RNA to the Cytoplasm Proc. Natl. Acad. Sci. USA 2023 120 e2301067120 10.1073/pnas.2301067120 37364130 PMC10318962 36. Schlich M. Palomba R. Costabile G. Mizrahy S. Pannuzzo M. Peer D. Decuzzi P. Cytosolic Delivery of Nucleic Acids: The Case of Ionizable Lipid Nanoparticles Bioeng. Transl. Med. 2021 6 e10213 10.1002/btm2.10213 33786376 PMC7995196 37. Hou X. Zaks T. Langer R. Dong Y. Lipid Nanoparticles for mRNA Delivery Nat. Rev. Mater. 2021 6 1078 1094 10.1038/s41578-021-00358-0 34394960 PMC8353930 38. Cui L. Renzi S. Quagliarini E. Digiacomo L. Amenitsch H. Masuelli L. Bei R. Ferri G. Cardarelli F. Wang J. Efficient Delivery of DNA Using Lipid Nanoparticles Pharmaceutics 2022 14 1698 10.3390/pharmaceutics14081698 36015328 PMC9416266 39. Algarni A. Pilkington E.H. Suys E.J.A. Al-Wassiti H. Pouton C.W. Truong N.P. In Vivo Delivery of Plasmid DNA by Lipid Nanoparticles: The Influence of Ionizable Cationic Lipids on Organ-Selective Gene Expression Biomater. Sci. 2022 10 2940 2952 10.1039/D2BM00168C 35475455 40. Wei L. Dong C. Zhu W. Wang B.-Z. mRNA Vaccine Nanoplatforms and Innate Immunity Viruses 2024 16 120 10.3390/v16010120 38257820 PMC10820759 41. Anderson B.R. Muramatsu H. Jha B.K. Silverman R.H. Weissman D. Kariko K. Nucleoside Modifications in RNA Limit Activation of 2′-5′-Oligoadenylate Synthetase and Increase Resistance to Cleavage by RNase L Nucleic Acids Res. 2011 39 9329 9338 10.1093/nar/gkr586 21813458 PMC3241635 42. Anderson B.R. Muramatsu H. Nallagatla S.R. Bevilacqua P.C. Sansing L.H. Weissman D. Karikó K. Incorporation of Pseudouridine into mRNA Enhances Translation by Diminishing PKR Activation Nucleic Acids Res. 2010 38 5884 5892 10.1093/nar/gkq347 20457754 PMC2943593 43. Alameh M.-G. Weissman D. Pardi N. Messenger RNA-Based Vaccines Against Infectious Diseases mRNA Vaccines Yu D. Petsch B. Current Topics in Microbiology and Immunology; Springer International Publishing Cham, Switzerland 2020 Volume 440 111 145 978-3-031-18069-9 10.1007/82_2020_202 32300916 44. Zahid A. Ismail H. Li B. Jin T. Molecular and Structural Basis of DNA Sensors in Antiviral Innate Immunity Front. Immunol. 2020 11 613039 10.3389/fimmu.2020.613039 33329609 PMC7734173 45. Kreiter S. Vormehr M. Van De Roemer N. Diken M. Löwer M. Diekmann J. Boegel S. Schrörs B. Vascotto F. Castle J.C. Mutant MHC Class II Epitopes Drive Therapeutic Immune Responses to Cancer Nature 2015 520 692 696 10.1038/nature14426 25901682 PMC4838069 46. Deng Z. Tian Y. Song J. An G. Yang P. mRNA Vaccines: The Dawn of a New Era of Cancer Immunotherapy Front. Immunol. 2022 13 887125 10.3389/fimmu.2022.887125 35720301 PMC9201022 47. Li H. Hu Y. Li J. He J. Yu G. Wang J. Lin X. Intranasal Prime-Boost RNA Vaccination Elicits Potent T Cell Response for Lung Cancer Therapy Signal Transduct. Target. Ther. 2025 10 101 10.1038/s41392-025-02191-1 40122855 PMC11930932 48. Fan T. Xu C. Wu J. Cai Y. Cao W. Shen H. Zhang M. Zhu H. Yang J. Zhu Z. Lipopolyplex-Formulated mRNA Cancer Vaccine Elicits Strong Neoantigen-Specific T Cell Responses and Antitumor Activity Sci. Adv. 2024 10 eadn9961 10.1126/sciadv.adn9961 39392882 PMC11468906 49. Yang B. Jeang J. Yang A. Wu T.C. Hung C.-F. DNA Vaccine for Cancer Immunotherapy Hum. Vaccines Immunother. 2014 10 3153 3164 10.4161/21645515.2014.980686 25625927 PMC4514137 50. Buonaguro L. Tagliamonte M. Selecting Target Antigens for Cancer Vaccine Development Vaccines 2020 8 615 10.3390/vaccines8040615 33080888 PMC7711972 51. Fan T. Zhang M. Yang J. Zhu Z. Cao W. Dong C. Therapeutic Cancer Vaccines: Advancements, Challenges and Prospects Signal Transduct. Target. Ther. 2023 8 450 10.1038/s41392-023-01674-3 38086815 PMC10716479 52. Xie N. Shen G. Gao W. Huang Z. Huang C. Fu L. Neoantigens: Promising Targets for Cancer Therapy Signal Transduct. Target. Ther. 2023 8 9 10.1038/s41392-022-01270-x 36604431 PMC9816309 53. Zhang Z. Lu M. Qin Y. Gao W. Tao L. Su W. Zhong J. Neoantigen: A New Breakthrough in Tumor Immunotherapy Front. Immunol. 2021 12 672356 10.3389/fimmu.2021.672356 33936118 PMC8085349 54. Snyder L.A. Goletz T.J. Gunn G.R. Shi F.F. Harris M.C. Cochlin K. McCauley C. McCarthy S.G. Branigan P.J. Knight D.M. A MUC1/IL-18 DNA Vaccine Induces Anti-Tumor Immunity and Increased Survival in MUC1 Transgenic Mice Vaccine 2006 24 3340 3352 10.1016/j.vaccine.2006.01.014 16472547 55. Wang X. Miao Y. Shen J. Li D. Deng X. Yang C. Ji Y. Dai Z. Ma Y. Unlocking PD-1 Antibody Resistance: The MUC1 DNA Vaccine Augments CD8 + Scand. J. Immunol. 2024 99 e13356 10.1111/sji.13356 38605549 56. Choi D.-H. Woo J.K. Choi Y. Seo H.-S. Kim C.-W. A Novel Chimeric DNA Vaccine: Enhancement of Preventive and Therapeutic Efficacy of DNA Vaccine by Fusion of Mucin 1 to a Heat Shock Protein 70 Gene Mol. Med. Rep. 2011 4 885 890 10.3892/mmr.2011.525 21725596 57. Zhang H. Liu C. Zhang F. Geng F. Xia Q. Lu Z. Xu P. Xie Y. Wu H. Yu B. MUC1 and Survivin Combination Tumor Gene Vaccine Generates Specific Immune Responses and Anti-Tumor Effects in a Murine Melanoma Model Vaccine 2016 34 2648 2655 10.1016/j.vaccine.2016.04.045 27113167 58. Liu C. Xie Y. Sun B. Geng F. Zhang F. Guo Q. Wu H. Yu B. Wu J. Yu X. MUC1- and Survivin-Based DNA Vaccine Combining Immunoadjuvants CpG and Interleukin-2 in a Bicistronic Expression Plasmid Generates Specific Immune Responses and Antitumour Effects in a Murine Colorectal Carcinoma Model Scand. J. Immunol. 2018 87 63 72 10.1111/sji.12633 29193199 59. Lin X. Chen H. Xie Y. Zhou X. Wang Y. Zhou J. Long S. Hu Z. Zhang S. Qiu W. Combination of CTLA-4 Blockade with MUC1 mRNA Nanovaccine Induces Enhanced Anti-Tumor CTL Activity by Modulating Tumor Microenvironment of Triple Negative Breast Cancer Transl. Oncol. 2022 15 101298 10.1016/j.tranon.2021.101298 34875483 PMC8652013 60. Chen J. Chen L. Zhang H. Quan Y. Enhancing the Antitumour-Specific Immunity of a Lung DNA Vaccine in Vivo by Fusion Expression of MAGE-A3 and Soluble PD-1 Biotechnol. Biotechnol. Equip. 2017 31 1064 1069 10.1080/13102818.2017.1343100 61. Duperret E.K. Liu S. Paik M. Trautz A. Stoltz R. Liu X. Ze K. Perales-Puchalt A. Reed C. Yan J. A Designer Cross-Reactive DNA Immunotherapeutic Vaccine That Targets Multiple MAGE-A Family Members Simultaneously for Cancer Therapy Clin. Cancer Res. 2018 24 6015 6027 10.1158/1078-0432.CCR-18-1013 30262507 PMC6319943 62. Choi K. Jeong H. Lee D.H. Lee J.W. Hong J.-E. Baek J.E. Park Y.S. Innovative Cancer Immunotherapy with MAGE-A3 mRNA Cancer Vaccines Cancers 2024 16 3428 10.3390/cancers16193428 39410046 PMC11475142 63. Cheng W.-F. Hung C.-F. Chai C.-Y. Hsu K.-F. He L. Ling M. Wu T.-C. Tumor-Specific Immunity and Antiangiogenesis Generated by a DNA Vaccine Encoding Calreticulin Linked to a Tumor Antigen J. Clin. Investig. 2001 108 669 678 10.1172/JCI200112346 11544272 PMC209378 64. Farzanehpour M. Soleimanjahi H. Hassan Z.M. Amanzadeh A. Ghaemi A. Fazeli M. HSP70 Modified Response against HPV Based Tumor Eur. Rev. Med. Pharmacol. Sci. 2013 17 228 234 23377813 65. Trimble C. Lin C.-T. Hung C.-F. Pai S. Juang J. He L. Gillison M. Pardoll D. Wu L. Wu T.-C. Comparison of the CD8 + Vaccine 2003 21 4036 4042 10.1016/S0264-410X(03)00275-5 12922140 66. Peng S. Ferrall L. Gaillard S. Wang C. Chi W.-Y. Huang C.-H. Roden R.B.S. Wu T.-C. Chang Y.-N. Hung C.-F. Development of DNA Vaccine Targeting E6 and E7 Proteins of Human Papillomavirus 16 (HPV16) and HPV18 for Immunotherapy in Combination with Recombinant Vaccinia Boost and PD-1 Antibody mBio 2021 12 e03224-20 10.1128/mBio.03224-20 33468698 PMC7845631 67. Qiu K. Duan X. Mao M. Song Y. Rao Y. Cheng D. Feng L. Shao X. Jiang C. Huang H. mRNA-LNP Vaccination-Based Immunotherapy Augments CD8 + npj Vaccines 2023 8 144 10.1038/s41541-023-00733-8 37773254 PMC10542330 68. Zhou K. Yuzhakov O. Behloul N. Wang D. Bhagat L. Chu D. Zhang X. Cheng X. Fan L. Huang X. HPV16 E6/E7 -Based mRNA Vaccine Is Therapeutic in Mice Bearing Aggressive HPV-Positive Lesions Front. Immunol. 2023 14 1213285 10.3389/fimmu.2023.1213285 37503351 PMC10368880 69. Wang J. Ma L. Chen Y. Zhou R. Wang Q. Zhang T. Yi D. Liu Q. Zhang Y. Zhang W. Immunogenicity and Effectiveness of an mRNA Therapeutic Vaccine for HPV-Related Malignancies Life Sci. Alliance 2024 7 e202302448 10.26508/lsa.202302448 38514186 PMC10958088 70. Weng T.-Y. Yen M.-C. Huang C.-T. Hung J.-J. Chen Y.-L. Chen W.-C. Wang C.-Y. Chang J.-Y. Lai M.-D. DNA Vaccine Elicits an Efficient Antitumor Response by Targeting the Mutant Kras in a Transgenic Mouse Lung Cancer Model Gene Ther. 2014 21 888 896 10.1038/gt.2014.67 25077772 71. Wang X. Wang W. Zou S. Xu Z. Cao D. Zhang S. Wei M. Zhan Q. Wen C. Li F. Combination Therapy of KRAS G12V mRNA Vaccine and Pembrolizumab: Clinical Benefit in Patients with Advanced Solid Tumors Cell Res. 2024 34 661 664 10.1038/s41422-024-00990-9 38914844 PMC11369195 72. Chen R. Liu W. Brown D.M. Bong Y.-S. He J. Shen D. Wang C.Y. Abstract 5738: A Pan-Ras mRNA Vaccine Elicits Specific Immune Responses and Inhibits Tumor Growth in the Mouse Model of Colon Cancer Cancer Res. 2023 83 5738 10.1158/1538-7445.AM2023-5738 73. Shin S.-H. Han Y. Lim C.G. Heo Y.H. Jeong S. Kim Y.-Y. Choi I.Y. Abstract LB222: An mRNA-Based Cancer Vaccine Multi-Targeting KRAS Mutations Inhibits Tumor Growth by Increasing Immune Response in KRAS Mutant LL/2 Mouse Model Cancer Res. 2023 83 LB222 10.1158/1538-7445.AM2023-LB222 74. Li C. Ke F. Mao S. Montemayor Z. Traore M.D.M. Balsa A.D. Djibo M. Karekar N. Hu H. Wen H. SARS-CoV-2 B Epitope-Guided Neoantigen NanoVaccines Enhance Tumor-Specific CD4/CD8 T Cell Immunity through B Cell Antigen Presentation ACS Nano 2025 19 7038 7054 10.1021/acsnano.4c15113 39943808 75. Gao T. Cen Q. Lei H. A Review on Development of MUC1-Based Cancer Vaccine Biomed. Pharmacother. 2020 132 110888 10.1016/j.biopha.2020.110888 33113416 76. Liu C. Lu Z. Xie Y. Guo Q. Geng F. Sun B. Wu H. Yu B. Wu J. Zhang H. Soluble PD-1-Based Vaccine Targeting MUC1 VNTR and Survivin Improves Anti-Tumor Effect Immunol. Lett. 2018 200 33 42 10.1016/j.imlet.2018.06.004 29894719 77. Esfandiary A. Ghafouri-Fard S. MAGE-A3: An Immunogenic Target Used in Clinical Practice Immunotherapy 2015 7 683 704 10.2217/imt.15.29 26100270 78. Gjerstorff M.F. Andersen M.H. Ditzel H.J. Oncogenic Cancer/Testis Antigens: Prime Candidates for Immunotherapy Oncotarget 2015 6 15772 15787 10.18632/oncotarget.4694 26158218 PMC4599236 79. Alsalloum A. Shevchenko J. Sennikov S. The Melanoma-Associated Antigen Family A (MAGE-A): A Promising Target for Cancer Immunotherapy? Cancers 2023 15 1779 10.3390/cancers15061779 36980665 PMC10046478 80. Monie A. Tsen S.-W.D. Hung C.-F. Wu T.-C. Therapeutic HPV DNA Vaccines Expert Rev. Vaccines 2009 8 1221 1235 10.1586/erv.09.76 19722895 PMC2752853 81. CDC HPV Vaccination Available online: https://www.cdc.gov/hpv/vaccines/index.html (accessed on 4 January 2025) 82. Asimgil H. Ertetik U. Çevik N.C. Ekizce M. Doğruöz A. Gökalp M. Arık-Sever E. Istvanffy R. Friess H. Ceyhan G.O. Targeting the Undruggable Oncogenic KRAS: The Dawn of Hope JCI Insight 2022 7 e153688 10.1172/jci.insight.153688 35014625 PMC8765045 83. Huang L. Guo Z. Wang F. Fu L. KRAS Mutation: From Undruggable to Druggable in Cancer Signal Transduct. Target. Ther. 2021 6 386 10.1038/s41392-021-00780-4 34776511 PMC8591115 84. Tiriveedhi V. Fleming T.P. Goedegebuure P.S. Naughton M. Ma C. Lockhart C. Gao F. Gillanders W.E. Mohanakumar T. Mammaglobin-A cDNA Vaccination of Breast Cancer Patients Induces Antigen-Specific Cytotoxic CD4+ICO Shi Breast Cancer Res. Treat. 2013 138 109 118 10.1007/s10549-012-2110-9 22678162 PMC3656506 85. Tiriveedhi V. Tucker N. Herndon J. Li L. Sturmoski M. Ellis M. Ma C. Naughton M. Lockhart A.C. Gao F. Safety and Preliminary Evidence of Biologic Efficacy of a Mammaglobin-A DNA Vaccine in Patients with Stable Metastatic Breast Cancer Clin. Cancer Res. 2014 20 5964 5975 10.1158/1078-0432.CCR-14-0059 25451106 PMC4322416 86. Stanton S.E. Wisinski K.B. Gwin W.R. Coveler A. Liao J.B. Burkard M. Bailey H. Kim K. Havinghurst T. DeShong K. Abstract P2-02-02: Phase I Trial of the Safety and Immunogenicity of a Tri-Antigen Vaccine Targeting HER2, IGFBP-2, and IGF-IR in Patients with Non-Metastatic Breast Cancer Cancer Res. 2023 83 P2-02-02 10.1158/1538-7445.SABCS22-P2-02-02 87. Disis M.L. Guthrie K.A. Liu Y. Coveler A.L. Higgins D.M. Childs J.S. Dang Y. Salazar L.G. Safety and Outcomes of a Plasmid DNA Vaccine Encoding the ERBB2 Intracellular Domain in Patients With Advanced-Stage ERBB2-Positive Breast Cancer: A Phase 1 Nonrandomized Clinical Trial JAMA Oncol. 2023 9 71 10.1001/jamaoncol.2022.5143 36326756 PMC9634596 88. Zhang X. Goedegebuure S.P. Chen M.Y. Mishra R. Zhang F. Yu Y.Y. Singhal K. Li L. Gao F. Myers N.B. Neoantigen DNA Vaccines Are Safe, Feasible, and Induce Neoantigen-Specific Immune Responses in Triple-Negative Breast Cancer Patients Genome Med. 2024 16 131 10.1186/s13073-024-01388-3 39538331 PMC11562513 89. Markowitz J. Shamblott M. Brohl A.S. Sarnaik A. Eroglu Z. Khushalani N.I. Chen P.-L. De-Aquino D.B. Sondak V.K. Tarhini A.A. IFx-Hu2.0 Phase I First in Human Study for Unresectable Melanoma for an Intralesional “in-Situ Vaccine” Approach J. Clin. Oncol. 2022 40 e21542 10.1200/JCO.2022.40.16_suppl.e21542 90. Wolchok J.D. Yuan J. Houghton A.N. Gallardo H.F. Rasalan T.S. Wang J. Zhang Y. Ranganathan R. Chapman P.B. Krown S.E. Safety and Immunogenicity of Tyrosinase DNA Vaccines in Patients with Melanoma Mol. Ther. 2007 15 2044 2050 10.1038/sj.mt.6300290 17726460 91. Yuan J. Ku G.Y. Adamow M. Mu Z. Tandon S. Hannaman D. Chapman P. Schwartz G. Carvajal R. Panageas K.S. Immunologic Responses to Xenogeneic Tyrosinase DNA Vaccine Administered by Electroporation in Patients with Malignant Melanoma J. Immunother. Cancer 2013 1 20 10.1186/2051-1426-1-20 24829756 PMC4019903 92. Tagawa S.T. Lee P. Snively J. Boswell W. Ounpraseuth S. Lee S. Hickingbottom B. Smith J. Johnson D. Weber J.S. Phase I Study of Intranodal Delivery of a Plasmid DNA Vaccine for Patients with Stage IV Melanoma Cancer 2003 98 144 154 10.1002/cncr.11462 12833467 93. Perales M.-A. Yuan J. Powel S. Gallardo H.F. Rasalan T.S. Gonzalez C. Manukian G. Wang J. Zhang Y. Chapman P.B. Phase I/II Study of GM-CSF DNA as an Adjuvant for a Multipeptide Cancer Vaccine in Patients With Advanced Melanoma Mol. Ther. 2008 16 2022 2029 10.1038/mt.2008.196 18797450 PMC3909666 94. Sahin U. Oehm P. Derhovanessian E. Jabulowsky R.A. Vormehr M. Gold M. Maurus D. Schwarck-Kokarakis D. Kuhn A.N. Omokoko T. An RNA Vaccine Drives Immunity in Checkpoint-Inhibitor-Treated Melanoma Nature 2020 585 107 112 10.1038/s41586-020-2537-9 32728218 95. Miller M. Sahin U. Derhovanessian E. Kloke B.-P. Simon P. Bukur V. Albrecht C. Paruzynski A. Löwer M. Kuhn A. IVAC MUTANOME: A First-in-Human Phase I Clinical Trial Targeting Individual Mutant Neoantigens for the Treatment of Melanoma Ann. Oncol. 2017 28 xi1 xi2 10.1093/annonc/mdx712.003 96. McNeel D.G. Dunphy E.J. Davies J.G. Frye T.P. Johnson L.E. Staab M.J. Horvath D.L. Straus J. Alberti D. Marnocha R. Safety and Immunological Efficacy of a DNA Vaccine Encoding Prostatic Acid Phosphatase in Patients With Stage D0 Prostate Cancer J. Clin. Oncol. 2009 27 4047 4054 10.1200/JCO.2008.19.9968 19636017 PMC2734418 97. McNeel D.G. Becker J.T. Eickhoff J.C. Johnson L.E. Bradley E. Pohlkamp I. Staab M.J. Liu G. Wilding G. Olson B.M. Real-Time Immune Monitoring to Guide Plasmid DNA Vaccination Schedule Targeting Prostatic Acid Phosphatase in Patients with Castration-Resistant Prostate Cancer Clin. Cancer Res. 2014 20 3692 3704 10.1158/1078-0432.CCR-14-0169 24850844 PMC4102643 98. McNeel D.G. Eickhoff J.C. Johnson L.E. Roth A.R. Perk T.G. Fong L. Antonarakis E.S. Wargowski E. Jeraj R. Liu G. Phase II Trial of a DNA Vaccine Encoding Prostatic Acid Phosphatase (pTVG-HP [MVI-816]) in Patients With Progressive, Nonmetastatic, Castration-Sensitive Prostate Cancer J. Clin. Oncol. 2019 37 3507 3517 10.1200/JCO.19.01701 31644357 PMC7194451 99. Kyriakopoulos C.E. Eickhoff J.C. Ferrari A.C. Schweizer M.T. Wargowski E. Olson B.M. McNeel D.G. Multicenter Phase I Trial of a DNA Vaccine Encoding the Androgen Receptor Ligand-Binding Domain (pTVG-AR, MVI-118) in Patients with Metastatic Prostate Cancer Clin. Cancer Res. 2020 26 5162 5171 10.1158/1078-0432.CCR-20-0945 32513836 PMC7541575 100. Kübler H. Scheel B. Gnad-Vogt U. Miller K. Schultze-Seemann W. Vom Dorp F. Parmiani G. Hampel C. Wedel S. Trojan L. Self-Adjuvanted mRNA Vaccination in Advanced Prostate Cancer Patients: A First-in-Man Phase I/IIa Study J. Immunother. Cancer 2015 3 26 10.1186/s40425-015-0068-y 26082837 PMC4468959 101. Eriksson F. Tötterman T. Maltais A.-K. Pisa P. Yachnin J. DNA Vaccine Coding for the Rhesus Prostate Specific Antigen Delivered by Intradermal Electroporation in Patients with Relapsed Prostate Cancer Vaccine 2013 31 3843 3848 10.1016/j.vaccine.2013.06.063 23831327 102. Trimble C.L. Morrow M.P. Kraynyak K.A. Shen X. Dallas M. Yan J. Edwards L. Parker R.L. Denny L. Giffear M. Safety, Efficacy, and Immunogenicity of VGX-3100, a Therapeutic Synthetic DNA Vaccine Targeting Human Papillomavirus 16 and 18 E6 and E7 Proteins for Cervical Intraepithelial Neoplasia 2/3: A Randomised, Double-Blind, Placebo-Controlled Phase 2b Trial Lancet 2015 386 2078 2088 10.1016/S0140-6736(15)00239-1 26386540 PMC4888059 103. Kim T.J. Jin H.-T. Hur S.-Y. Yang H.G. Seo Y.B. Hong S.R. Lee C.-W. Kim S. Woo J.-W. Park K.S. Clearance of Persistent HPV Infection and Cervical Lesion by Therapeutic DNA Vaccine in CIN3 Patients Nat. Commun. 2014 5 5317 10.1038/ncomms6317 25354725 PMC4220493 104. Hasan Y. Spiotto M.T. Furtado L.V. Tergas A.I. Lee N.K. Brooks R.A. McCall A.R. Golden D.W. Jolly S. Fleming G.F. A Phase 1/2A Trial of Synthetic DNA Vaccine Immunotherapy Targeting HPV-16 and -18 after Chemoradiation for Cervical Cancer J. Clin. Oncol. 2018 36 5525 10.1200/JCO.2018.36.15_suppl.5525 105. Hillemanns P. Denecke A. Woelber L. Böhmer G. Jentschke M. Schjetne K.W. Bruins Slot K.M.H. Fredriksen A.B. A Therapeutic Antigen-Presenting Cell-Targeting DNA Vaccine VB10.16 in HPV16-Positive High-Grade Cervical Intraepithelial Neoplasia: Results from a Phase I/IIa Trial Clin. Cancer Res. 2022 28 4885 4892 10.1158/1078-0432.CCR-22-1927 36129459 106. Trimble C.L. Peng S. Kos F. Gravitt P. Viscidi R. Sugar E. Pardoll D. Wu T.C. A Phase I Trial of a Human Papillomavirus DNA Vaccine for HPV16+ Cervical Intraepithelial Neoplasia 2/3 Clin. Cancer Res. 2009 15 361 367 10.1158/1078-0432.CCR-08-1725 19118066 PMC2865676 107. Weber J.S. Vogelzang N.J. Ernstoff M.S. Goodman O.B. Cranmer L.D. Marshall J.L. Miles S. Rosario D. Diamond D.C. Qiu Z. A Phase 1 Study of a Vaccine Targeting Preferentially Expressed Antigen in Melanoma and Prostate-Specific Membrane Antigen in Patients With Advanced Solid Tumors J. Immunother. 2011 34 556 567 10.1097/CJI.0b013e3182280db1 21760528 PMC3709852 108. Sebastian M. Schröder A. Scheel B. Hong H.S. Muth A. von Boehmer L. Zippelius A. Mayer F. Reck M. Atanackovic D. A Phase I/IIa Study of the mRNA-Based Cancer Immunotherapy CV9201 in Patients with Stage IIIB/IV Non-Small Cell Lung Cancer Cancer Immunol. Immunother. 2019 68 799 812 10.1007/s00262-019-02315-x 30770959 PMC11028316 109. Wick W. Wick A. Sahm F. Riehl D. Von Deimling A. Bendszus M. Kickingereder P. Beckhove P. Schmitz-Winnenthal F.H. Jungk C. VXM01 Phase I Study in Patients with Progressive Glioblastoma: Final Results J. Clin. Oncol. 2018 36 2017 10.1200/JCO.2018.36.15_suppl.2017 110. Bloom K. Van Den Berg F. Arbuthnot P. Self-Amplifying RNA Vaccines for Infectious Diseases Gene Ther. 2021 28 117 129 10.1038/s41434-020-00204-y 33093657 PMC7580817 111. Maine C.J. Richard G. Spasova D.S. Miyake-Stoner S.J. Sparks J. Moise L. Sullivan R.P. Garijo O. Choz M. Crouse J.M. Self-Replicating RNAs Drive Protective Anti-Tumor T Cell Responses to Neoantigen Vaccine Targets in a Combinatorial Approach Mol. Ther. 2021 29 1186 1198 10.1016/j.ymthe.2020.11.027 33278563 PMC7934630 112. Ramos Da Silva J. Bitencourt Rodrigues K. Formoso Pelegrin G. Silva Sales N. Muramatsu H. De Oliveira Silva M. Porchia B.F.M.M. Moreno A.C.R. Aps L.R.M.M. Venceslau-Carvalho A.A. Single Immunizations of Self-Amplifying or Non-Replicating mRNA-LNP Vaccines Control HPV-Associated Tumors in Mice Sci. Transl. Med. 2023 15 eabn3464 10.1126/scitranslmed.abn3464 36867683 113. First Self-Amplifying mRNA Vaccine Approved Nat. Biotechnol. 2024 42 4 10.1038/s41587-023-02101-2 38233659 114. Wang X. Liu S. Sun Y. Yu X. Lee S.M. Cheng Q. Wei T. Gong J. Robinson J. Zhang D. Preparation of Selective Organ-Targeting (SORT) Lipid Nanoparticles (LNPs) Using Multiple Technical Methods for Tissue-Specific mRNA Delivery Nat. Protoc. 2023 18 265 291 10.1038/s41596-022-00755-x 36316378 PMC9888002 115. Chen J. Ye Z. Huang C. Qiu M. Song D. Li Y. Xu Q. Lipid Nanoparticle-Mediated Lymph Node–Targeting Delivery of mRNA Cancer Vaccine Elicits Robust CD8 + Proc. Natl. Acad. Sci. USA 2022 119 e2207841119 10.1073/pnas.2207841119 35969778 PMC9407666 116. Chilumula S. Hanchate P. Patri S.V. Marepally S. Influence of Structural Modifications in Synthetic Vectors of Lipid Adjuvants on mRNA Vaccine Delivery Biomater. Sci. 2025 13 4952 4969 10.1039/D5BM00839E 40792498 117. Chatzikleanthous D. O’Hagan D.T. Adamo R. Lipid-Based Nanoparticles for Delivery of Vaccine Adjuvants and Antigens: Toward Multicomponent Vaccines Mol. Pharm. 2021 18 2867 2888 10.1021/acs.molpharmaceut.1c00447 34264684 118. Mochida Y. Uchida S. mRNA Vaccine Designs for Optimal Adjuvanticity and Delivery RNA Biol. 2024 21 422 448 10.1080/15476286.2024.2333123 PMC10968337 38528828 119. Kawaguchi Y. Kimura M. Karaki T. Tanaka H. Ono C. Ishida T. Matsuura Y. Hirai T. Akita H. Shimizu T. Modulating Immunogenicity and Reactogenicity in mRNA-Lipid Nanoparticle Vaccines through Lipid Component Optimization ACS Nano 2025 19 27977 28001 10.1021/acsnano.5c10648 40700637 PMC12333428 120. Vadovics M. Zhao W. Daley E.F. Lam K. Daly O. Rashid K. Lee H.R. Schreiner P. Lundgreen K.A. Gaudette B.T. Tailoring the Adjuvanticity of Lipid Nanoparticles by PEG Lipid Ratio and Phospholipid Modifications Nat. Nanotechnol. 2025 1 11 10.1038/s41565-025-01958-5 40550975 121. Sardesai N.Y. Weiner D.B. Electroporation Delivery of DNA Vaccines: Prospects for Success Curr. Opin. Immunol. 2011 23 421 429 10.1016/j.coi.2011.03.008 21530212 PMC3109217 122. Kisakov D.N. Belyakov I.M. Kisakova L.A. Yakovlev V.A. Tigeeva E.V. Karpenko L.I. The Use of Electroporation to Deliver DNA-Based Vaccines Expert Rev. Vaccines 2024 23 102 123 10.1080/14760584.2023.2292772 38063059 123. Broderick K.E. Kardos T. McCoy J.R. Fons M.P. Kemmerrer S. Sardesai N.Y. Piezoelectric Permeabilization of Mammalian Dermal Tissue for in Vivo DNA Delivery Leads to Enhanced Protein Expression and Increased Immunogenicity Hum. Vaccines 2011 7 22 28 10.4161/hv.7.0.14559 21263230 124. Chudley L. McCann K. Mander A. Tjelle T. Campos-Perez J. Godeseth R. Creak A. Dobbyn J. Johnson B. Bass P. DNA Fusion-Gene Vaccination in Patients with Prostate Cancer Induces High-Frequency CD8 + Cancer Immunol. Immunother. 2012 61 2161 2170 10.1007/s00262-012-1270-0 22729556 PMC3493666 125. Low L. Mander A. McCann K. Dearnaley D. Tjelle T. Mathiesen I. Stevenson F. Ottensmeier C.H. DNA Vaccination with Electroporation Induces Increased Antibody Responses in Patients with Prostate Cancer Hum. Gene Ther. 2009 20 1269 1278 10.1089/hum.2009.067 19619001 126. Klein T.M. Wolf E.D. Wu R. Sanford J.C. High-Velocity Microprojectiles for Delivering Nucleic Acids into Living Cells Nature 1987 327 70 73 10.1038/327070a0 1422046 127. Sanford J.C. Klein T.M. Wolf E.D. Allen N. Delivery of substances into cells and tissues using a particle bombardment process Part. Sci. Technol. 1987 5 27 37 10.1080/02726358708904533 128. Uchida M. Li X.W. Mertens P. Alpar H.O. Transfection by Particle Bombardment: Delivery of Plasmid DNA into Mammalian Cells Using Gene Gun Biochim. Biophys. Acta (BBA)-Gen. Subj. 2009 1790 754 764 10.1016/j.bbagen.2009.05.013 19477233 129. Zelenin A.V. Titomirov A.V. Kolesnikov V.A. Genetic Transformation of Mouse Cultured Cells with the Help of High-velocity Mechanical DNA Injection FEBS Lett. 1989 244 65 67 10.1016/0014-5793(89)81163-9 2924911 130. Yang N.S. Burkholder J. Roberts B. Martinell B. McCabe D. In Vivo and in Vitro Gene Transfer to Mammalian Somatic Cells by Particle Bombardment Proc. Natl. Acad. Sci. USA 1990 87 9568 9572 10.1073/pnas.87.24.9568 2175906 PMC55213 131. Williams R.S. Johnston S.A. Riedy M. DeVit M.J. McElligott S.G. Sanford J.C. Introduction of Foreign Genes into Tissues of Living Mice by DNA-Coated Microprojectiles Proc. Natl. Acad. Sci. USA 1991 88 2726 2730 10.1073/pnas.88.7.2726 2011582 PMC51311 132. Cheng L. Ziegelhoffer P.R. Yang N.S. In Vivo Promoter Activity and Transgene Expression in Mammalian Somatic Tissues Evaluated by Using Particle Bombardment Proc. Natl. Acad. Sci. USA 1993 90 4455 4459 10.1073/pnas.90.10.4455 8506285 PMC46530 133. Sato H. Hattori S. Kawamoto S. Kudoh I. Hayashi A. Yamamoto I. Yoshinari M. Minami M. Kanno H. In Vivo Gene Gun-Mediated DNA Delivery into Rodent Brain Tissue Biochem. Biophys. Res. Commun. 2000 270 163 170 10.1006/bbrc.2000.2369 10733922 134. Wang S. Zhang C. Zhang L. Li J. Huang Z. Lu S. The Relative Immunogenicity of DNA Vaccines Delivered by the Intramuscular Needle Injection, Electroporation and Gene Gun Methods Vaccine 2008 26 2100 2110 10.1016/j.vaccine.2008.02.033 18378365 PMC2790191 135. Roy M.J. Wu M.S. Barr L.J. Fuller J.T. Tussey L.G. Speller S. Culp J. Burkholder J.K. Swain W.F. Dixon R.M. Induction of Antigen-Specific CD8 + Vaccine 2000 19 764 778 10.1016/S0264-410X(00)00302-9 11115698 136. Jones S. Evans K. McElwaine-Johnn H. Sharpe M. Oxford J. Lambkin-Williams R. Mant T. Nolan A. Zambon M. Ellis J. DNA Vaccination Protects against an Influenza Challenge in a Double-Blind Randomised Placebo-Controlled Phase 1b Clinical Trial Vaccine 2009 27 2506 2512 10.1016/j.vaccine.2009.02.061 19368793 137. Hooper J.W. Kwilas S.A. Josleyn M. Norris S. Hutter J.N. Hamer M. Livezey J. Paolino K. Twomey P. Koren M. Phase 1 Clinical Trial of Hantaan and Puumala Virus DNA Vaccines Delivered by Needle-Free Injection npj Vaccines 2024 9 221 10.1038/s41541-024-00998-7 39551791 PMC11570633 138. Khobragade A. Bhate S. Ramaiah V. Deshpande S. Giri K. Phophle H. Supe P. Godara I. Revanna R. Nagarkar R. Efficacy, Safety, and Immunogenicity of the DNA SARS-CoV-2 Vaccine (ZyCoV-D): The Interim Efficacy Results of a Phase 3, Randomised, Double-Blind, Placebo-Controlled Study in India Lancet 2022 399 1313 1321 10.1016/S0140-6736(22)00151-9 35367003 PMC8970574 139. Sheridan C. First COVID-19 DNA Vaccine Approved, Others in Hot Pursuit Nat. Biotechnol. 2021 39 1479 1482 10.1038/d41587-021-00023-5 34785814 140. Weber J.S. Carlino M.S. Khattak A. Meniawy T. Ansstas G. Taylor M.H. Kim K.B. McKean M. Long G.V. Sullivan R.J. Individualised Neoantigen Therapy mRNA-4157 (V940) plus Pembrolizumab versus Pembrolizumab Monotherapy in Resected Melanoma (KEYNOTE-942): A Randomised, Phase 2b Study Lancet 2024 403 632 644 10.1016/S0140-6736(23)02268-7 38246194 141. Pham T. Pereira L. Roth S. Galletta L. Link E. Akhurst T. Solomon B. Michael M. Darcy P. Sampurno S. First-in-Human Phase I Clinical Trial of a Combined Immune Modulatory Approach Using TetMYB Vaccine and Anti-PD-1 Antibody in Patients with Advanced Solid Cancer Including Colorectal or Adenoid Cystic Carcinoma: The MYPHISMO Study Protocol ( NCT03287427 Contemp. Clin. Trials Commun. 2019 16 100409 10.1016/j.conctc.2019.100409 31650066 PMC6804811 142. Wargowski E. Johnson L.E. Eickhoff J.C. Delmastro L. Staab M.J. Liu G. McNeel D.G. Prime-Boost Vaccination Targeting Prostatic Acid Phosphatase (PAP) in Patients with Metastatic Castration-Resistant Prostate Cancer (mCRPC) Using Sipuleucel-T and a DNA Vaccine J. Immunother. Cancer 2018 6 21 10.1186/s40425-018-0333-y 29534736 PMC5850960 143. McNeel D.G. Eickhoff J.C. Wargowski E. Zahm C. Staab M.J. Straus J. Liu G. Concurrent, but Not Sequential, PD-1 Blockade with a DNA Vaccine Elicits Anti-Tumor Responses in Patients with Metastatic, Castration-Resistant Prostate Cancer Oncotarget 2018 9 25586 25596 10.18632/oncotarget.25387 29876010 PMC5986652 144. McNeel D.G. Emamekhoo H. Eickhoff J.C. Kyriakopoulos C.E. Wargowski E. Tonelli T.P. Johnson L.E. Liu G. Phase 2 Trial of a DNA Vaccine (pTVG-HP) and Nivolumab in Patients with Castration-Sensitive Non-Metastatic (M0) Prostate Cancer J. Immunother. Cancer 2023 11 e008067 10.1136/jitc-2023-008067 38101860 PMC10729272 145. Madan R.A. Bilusic M. Stein M.N. Donahue R.N. Arlen P.M. Karzai F. Plimack E. Wong Y.-N. Geynisman D.M. Zibelman M. Flutamide With or Without PROSTVAC in Non-Metastatic Castration Resistant (M0) Prostate Cancer Oncologist 2023 28 642–e561 10.1093/oncolo/oyad058 37134294 PMC10322134 146. Reardon D.A. Brem S. Desai A.S. Bagley S.J. Kurz S.C. De La Fuente M.I. Nagpal S. Welch M.R. Hormigo A. Forsyth P.A.J. Intramuscular (IM) INO-5401 + INO-9012 with Electroporation (EP) in Combination with Cemiplimab (REGN2810) in Newly Diagnosed Glioblastoma J. Clin. Oncol. 2022 40 2004 10.1200/JCO.2022.40.16_suppl.2004 147. Wick W. Wick A. Chinot O. Sahm F. Von Deimling A. Jungk C. Mansour M. Podola L. Lubenau H. Platten M. KS05.6.A Oral DNA Vaccination Targeting VEGFR2 Combined with the Anti-PD-L1 Antibody Avelumab in Patients with Progressive Glioblastoma-Final Results. NCT03750071 Neuro-Oncology 2022 24 ii6 10.1093/neuonc/noac174.016 148. Rojas L.A. Sethna Z. Soares K.C. Olcese C. Pang N. Patterson E. Lihm J. Ceglia N. Guasp P. Chu A. Personalized RNA Neoantigen Vaccines Stimulate T Cells in Pancreatic Cancer Nature 2023 618 144 150 10.1038/s41586-023-06063-y 37165196 PMC10171177 149. Sethna Z. Guasp P. Reiche C. Milighetti M. Ceglia N. Patterson E. Lihm J. Payne G. Lyudovyk O. Rojas L.A. RNA Neoantigen Vaccines Prime Long-Lived CD8 + Nature 2025 639 1042 1051 10.1038/s41586-024-08508-4 39972124 PMC11946889 150. Maldonado L. Teague J.E. Morrow M.P. Jotova I. Wu T.C. Wang C. Desmarais C. Boyer J.D. Tycko B. Robins H.S. Intramuscular Therapeutic Vaccination Targeting HPV16 Induces T Cell Responses That Localize in Mucosal Lesions Sci. Transl. Med. 2014 6 221ra13 10.1126/scitranslmed.3007323 PMC4086631 24477000 151. Alvarez R.D. Huh W.K. Bae S. Lamb L.S. Conner M.G. Boyer J. Wang C. Hung C.-F. Sauter E. Paradis M. A Pilot Study of pNGVL4a-CRT/E7(Detox) for the Treatment of Patients with HPV16 + Cervical Intraepithelial Neoplasia 2/3 (CIN2/3) Gynecol. Oncol. 2016 140 245 252 10.1016/j.ygyno.2015.11.026 26616223 PMC4724445 152. Krasny S. Baranau Y. Polyakov S. Zharkova E. Streltsova O. Filimonava A. Siarheyeva V. Kazlouskaya S. Khorau A. Gabai V. Clinical Efficacy of Plasmid Encoding P62/SQSTM1 (Elenagen) in Combination with Gemcitabine in Patients with Platinum-Resistant Ovarian Cancer: A Randomized Controlled Trial Front. Oncol. 2024 14 1343023 10.3389/fonc.2024.1343023 38410116 PMC10895999 153. Papachristofilou A. Hipp M.M. Klinkhardt U. Früh M. Sebastian M. Weiss C. Pless M. Cathomas R. Hilbe W. Pall G. Phase Ib Evaluation of a Self-Adjuvanted Protamine Formulated mRNA-Based Active Cancer Immunotherapy, BI1361849 (CV9202), Combined with Local Radiation Treatment in Patients with Stage IV Non-Small Cell Lung Cancer J. Immunother. Cancer 2019 7 38 10.1186/s40425-019-0520-5 30736848 PMC6368815 154. Yang C. Liang Y. Liu N. Sun M. Role of the cGAS-STING Pathway in Radiotherapy for Non-Small Cell Lung Cancer Radiat. Oncol. 2023 18 145 10.1186/s13014-023-02335-z 37667279 PMC10478265 155. Anderson R. Vallis K. Radionuclide Therapy and Immunomodulation Nuclear Medicine and Immunology Harsini S. Alavi A. Rezaei N. Springer International Publishing Cham, Switzerland 2022 249 266 978-3-030-81260-7 156. Carlson P.M. Morris Z.S. Translational Development and Testing of Theranostics in Combination with Immunotherapies Nuclear Medicine and Immunology Harsini S. Alavi A. Rezaei N. Springer International Publishing Cham, Switzerland 2022 267 280 978-3-030-81260-7 157. Sun Q. Li J. Ding Z. Liu Z. Radiopharmaceuticals Heat Anti-Tumor Immunity Theranostics 2023 13 767 786 10.7150/thno.79806 36632233 PMC9830438 158. Carvalho H.d.A. Villar R.C. Radiotherapy and Immune Response: The Systemic Effects of a Local Treatment Clinics 2018 73 e557s 10.6061/clinics/2018/e557s 30540123 PMC6257057 159. Muralidhar A. Hernandez R. Morris Z.S. Comas Rojas H. Bio Idrissou M. Weichert J.P. McNeel D.G. Myeloid-Derived Suppressor Cells Attenuate the Antitumor Efficacy of Radiopharmaceutical Therapy Using 90 J. Immunother. Cancer 2024 12 e008760 10.1136/jitc-2023-008760 38663936 PMC11043705 160. Salomon N. Selmi A. Grunwitz C. Kong A. Stanganello E. Neumaier J. Petschenka J. Diken M. Kreiter S. Türeci Ö. Local Radiotherapy and E7 RNA-LPX Vaccination Show Enhanced Therapeutic Efficacy in Preclinical Models of HPV16+ Cancer Cancer Immunol. Immunother. 2022 71 1975 1988 10.1007/s00262-021-03134-9 34971406 PMC9293862 161. Fotin-Mleczek M. Zanzinger K. Heidenreich R. Lorenz C. Thess A. Duchardt K.M. Kallen K.-J. Highly Potent mRNA Based Cancer Vaccines Represent an Attractive Platform for Combination Therapies Supporting an Improved Therapeutic Effect J. Gene Med. 2012 14 428 439 10.1002/jgm.2605 22262664 162. Shim D. Hernandez R. Rojas H.C. Idrissou M.B. McNeel D.G. 785 Combining Tumor-Specific Vaccination with Radiopharmaceutical Therapy (RPT) Enhances Anti-Tumor Response in OVA-Expressing Tumor Model J. Immunother. Cancer 2024 12 A889 10.1136/jitc-2024-SITC2024.0785 163. Tseng C.-W. Hung C.-F. Alvarez R.D. Trimble C. Huh W.K. Kim D. Chuang C.-M. Lin C.-T. Tsai Y.-C. He L. Pretreatment with Cisplatin Enhances E7-Specific CD8 + Clin. Cancer Res. 2008 14 3185 3192 10.1158/1078-0432.CCR-08-0037 18483387 PMC3066100 164. Vaddepally R.K. Kharel P. Pandey R. Garje R. Chandra A.B. Review of Indications of FDA-Approved Immune Checkpoint Inhibitors per NCCN Guidelines with the Level of Evidence Cancers 2020 12 738 10.3390/cancers12030738 32245016 PMC7140028 165. Jin C. Zhang Y. Li B. Gao T. Wang B. Hua P. Robust Anti-Tumor Immunity through the Integration of Targeted Lipid Nanoparticle-Based mRNA Nanovaccines with PD-1/PD-L1 Blockade Mater. Today Bio. 2024 27 101136 10.1016/j.mtbio.2024.101136 PMC11251012 39015802 166. Wang Y. Zhang L. Xu Z. Miao L. Huang L. mRNA Vaccine with Antigen-Specific Checkpoint Blockade Induces an Enhanced Immune Response against Established Melanoma Mol. Ther. 2018 26 420 434 10.1016/j.ymthe.2017.11.009 29249397 PMC5835019 167. Fournier C. Mercey-Ressejac M. Derangère V. Al Kadi A. Rageot D. Charrat C. Leroy A. Vollaire J. Josserand V. Escudé M. Nanostructured Lipid Carriers Based mRNA Vaccine Leads to a T Cell–Inflamed Tumour Microenvironment Favourable for Improving PD-1/PD-L1 Blocking Therapy and Long-Term Immunity in a Cold Tumour Model eBioMedicine 2025 112 105543 10.1016/j.ebiom.2024.105543 39793480 PMC11774803 168. Lopes A. Vanvarenberg K. Kos Š. Lucas S. Colau D. Van Den Eynde B. Préat V. Vandermeulen G. Combination of Immune Checkpoint Blockade with DNA Cancer Vaccine Induces Potent Antitumor Immunity against P815 Mastocytoma Sci. Rep. 2018 8 15732 10.1038/s41598-018-33933-7 30356111 PMC6200811 169. Kos S. Lopes A. Preat V. Cemazar M. Lampreht Tratar U. Ucakar B. Vanvarenberg K. Sersa G. Vandermeulen G. Intradermal DNA Vaccination Combined with Dual CTLA-4 and PD-1 Blockade Provides Robust Tumor Immunity in Murine Melanoma PLoS ONE 2019 14 e0217762 10.1371/journal.pone.0217762 31150505 PMC6544376 170. Gregor P.D. Wolchok J.D. Ferrone C.R. Buchinshky H. Guevara-Patiño J.A. Perales M.-A. Mortazavi F. Bacich D. Heston W. Latouche J.-B. CTLA-4 Blockade in Combination with Xenogeneic DNA Vaccines Enhances T-Cell Responses, Tumor Immunity and Autoimmunity to Self Antigens in Animal and Cellular Model Systems Vaccine 2004 22 1700 1708 10.1016/j.vaccine.2003.10.048 15068853 171. Neeli P. Maza P.A.M.A. Chai D. Zhao D. Hoi X.P. Chan K.S. Young K.H. Li Y. DNA Vaccines against GPRC5D Synergize with PD-1 Blockade to Treat Multiple Myeloma npj Vaccines 2024 9 180 10.1038/s41541-024-00979-w 39353958 PMC11445568 172. Zahm C.D. Moseman J.E. Delmastro L.E. G Mcneel D. PD-1 and LAG-3 Blockade Improve Anti-Tumor Vaccine Efficacy Oncoimmunology 2021 10 1912892 10.1080/2162402X.2021.1912892 33996265 PMC8078506 173. Bausart M. Vanvarenberg K. Ucakar B. Lopes A. Vandermeulen G. Malfanti A. Préat V. Combination of DNA Vaccine and Immune Checkpoint Blockades Improves the Immune Response in an Orthotopic Unresectable Glioblastoma Model Pharmaceutics 2022 14 1025 10.3390/pharmaceutics14051025 35631612 PMC9145362 174. Viborg N. Pavlidis M.A. Barrio-Calvo M. Friis S. Trolle T. Sørensen A.B. Thygesen C.B. Kofoed S.V. Kleine-Kohlbrecher D. Hadrup S.R. DNA Based Neoepitope Vaccination Induces Tumor Control in Syngeneic Mouse Models npj Vaccines 2023 8 77 10.1038/s41541-023-00671-5 37244905 PMC10224666 175. Salvatori E. Lione L. Compagnone M. Pinto E. Conforti A. Ciliberto G. Aurisicchio L. Palombo F. Neoantigen Cancer Vaccine Augments Anti-CTLA-4 Efficacy npj Vaccines 2022 7 15 10.1038/s41541-022-00433-9 35110563 PMC8810847 176. McNeel D.G. Eickhoff J.C. Wargowski E. Johnson L.E. Kyriakopoulos C.E. Emamekhoo H. Lang J.M. Brennan M.J. Liu G. Phase 2 Trial of T-Cell Activation Using MVI-816 and Pembrolizumab in Patients with Metastatic, Castration-Resistant Prostate Cancer (mCRPC) J. Immunother. Cancer 2022 10 e004198 10.1136/jitc-2021-004198 35277461 PMC8919462 177. Jeon D. Hill E. McNeel D.G. Toll-like Receptor Agonists as Cancer Vaccine Adjuvants Hum. Vaccines Immunother. 2024 20 2297453 10.1080/21645515.2023.2297453 PMC10760790 38155525 178. Verbeke R. Lentacker I. Wayteck L. Breckpot K. Van Bockstal M. Descamps B. Vanhove C. De Smedt S.C. Dewitte H. Co-Delivery of Nucleoside-Modified mRNA and TLR Agonists for Cancer Immunotherapy: Restoring the Immunogenicity of Immunosilent mRNA J. Control. Release 2017 266 287 300 10.1016/j.jconrel.2017.09.041 28987878 179. Zhang H. You X. Wang X. Cui L. Wang Z. Xu F. Li M. Yang Z. Liu J. Huang P. Delivery of mRNA Vaccine with a Lipid-like Material Potentiates Antitumor Efficacy through Toll-like Receptor 4 Signaling Proc. Natl. Acad. Sci. USA 2021 118 e2005191118 10.1073/pnas.2005191118 33547233 PMC8017939 180. Lee K. Kim S.Y. Seo Y. Kim M.H. Chang J. Lee H. Adjuvant Incorporated Lipid Nanoparticles for Enhanced mRNA-Mediated Cancer Immunotherapy Biomater. Sci. 2020 8 1101 1105 10.1039/C9BM01564G 31793928 181. Islam M.A. Rice J. Reesor E. Zope H. Tao W. Lim M. Ding J. Chen Y. Aduluso D. Zetter B.R. Adjuvant-Pulsed mRNA Vaccine Nanoparticle for Immunoprophylactic and Therapeutic Tumor Suppression in Mice Biomaterials 2021 266 120431 10.1016/j.biomaterials.2020.120431 33099060 PMC7528902 182. Haabeth O.A.W. Blake T.R. McKinlay C.J. Waymouth R.M. Wender P.A. Levy R. mRNA Vaccination with Charge-Altering Releasable Transporters Elicits Human T Cell Responses and Cures Established Tumors in Mice Proc. Natl. Acad. Sci. USA 2018 115 E9153 E9161 10.1073/pnas.1810002115 30201728 PMC6166849 183. Sajadian A. Tabarraei A. Soleimanjahi H. Fotouhi F. Gorji A. Ghaemi A. Comparing the Effect of Toll-like Receptor Agonist Adjuvants on the Efficiency of a DNA Vaccine Arch. Virol. 2014 159 1951 1960 10.1007/s00705-014-2024-4 24573220 184. Jeon D. McNeel D.G. Toll-like Receptor Agonist Combinations Augment Mouse T-Cell Anti-Tumor Immunity via IL-12- and Interferon ß-Mediated Suppression of Immune Checkpoint Receptor Expression Oncoimmunology 2022 11 2054758 10.1080/2162402X.2022.2054758 35340661 PMC8942433 185. Soong R.-S. Song L. Trieu J. Knoff J. He L. Tsai Y.-C. Huh W. Chang Y.-N. Cheng W.-F. Roden R.B.S. Toll-like Receptor Agonist Imiquimod Facilitates Antigen-Specific CD8 + Clin. Cancer Res. 2014 20 5456 5467 10.1158/1078-0432.CCR-14-0344 24893628 PMC4216740 186. Anand U. Dey A. Chandel A.K.S. Sanyal R. Mishra A. Pandey D.K. De Falco V. Upadhyay A. Kandimalla R. Chaudhary A. Cancer Chemotherapy and beyond: Current Status, Drug Candidates, Associated Risks and Progress in Targeted Therapeutics Genes Dis. 2023 10 1367 1401 10.1016/j.gendis.2022.02.007 37397557 PMC10310991 187. Weir G.M. Liwski R.S. Mansour M. Immune Modulation by Chemotherapy or Immunotherapy to Enhance Cancer Vaccines Cancers 2011 3 3114 3142 10.3390/cancers3033114 24212948 PMC3759189 188. Kerr M.D. McBride D.A. Chumber A.K. Shah N.J. Combining Therapeutic Vaccines with Chemo- and Immunotherapies in the Treatment of Cancer Expert Opin. Drug Discov. 2021 16 89 99 10.1080/17460441.2020.1811673 32867561 PMC7785654 189. Emens L.A. Middleton G. The Interplay of Immunotherapy and Chemotherapy: Harnessing Potential Synergies Cancer Immunol. Res. 2015 3 436 443 10.1158/2326-6066.CIR-15-0064 25941355 PMC5012642 190. Scurr M. Pembroke T. Bloom A. Roberts D. Thomson A. Smart K. Bridgeman H. Adams R. Brewster A. Jones R. Low-Dose Cyclophosphamide Induces Antitumor T-Cell Responses, Which Associate with Survival in Metastatic Colorectal Cancer Clin. Cancer Res. 2017 23 6771 6780 10.1158/1078-0432.CCR-17-0895 28855352 PMC5769815 191. Becker J.C. Schrama D. The Dark Side of Cyclophosphamide: Cyclophosphamide-Mediated Ablation of Regulatory T Cells J. Investig. Dermatol. 2013 133 1462 1465 10.1038/jid.2013.67 23673502 192. Wang Z. Till B. Gao Q. Chemotherapeutic Agent-Mediated Elimination of Myeloid-Derived Suppressor Cells Oncoimmunology 2017 6 e1331807 10.1080/2162402X.2017.1331807 28811975 PMC5543863 193. Ma W. Pham B. Li T. Cancer Neoantigens as Potential Targets for Immunotherapy Clin. Exp. Metastasis 2022 39 51 60 10.1007/s10585-021-10091-1 33950415 PMC8097110 194. Wang Y.J. Fletcher R. Yu J. Zhang L. Immunogenic effects of chemotherapy-induced tumor cell death Genes Dis. 2018 5 194 203 10.1016/j.gendis.2018.05.003 30320184 PMC6176216 195. Wan S. Pestka S. Jubin R.G. Lyu Y.L. Tsai Y.-C. Liu L.F. Chemotherapeutics and Radiation Stimulate MHC Class I Expression through Elevated Interferon-Beta Signaling in Breast Cancer Cells PLoS ONE 2012 7 e32542 10.1371/journal.pone.0032542 22396773 PMC3291570 196. Müller P. Martin K. Theurich S. von Bergwelt-Baildon M. Zippelius A. Cancer Chemotherapy Agents Target Intratumoral Dendritic Cells to Potentiate Antitumor Immunity Oncoimmunology 2014 3 e954460 10.4161/21624011.2014.954460 25610745 PMC4292760 197. Kang T.H. Mao C.-P. Lee S.Y. Chen A. Lee J.-H. Kim T.W. Alvarez R.D. Roden R.B.S. Pardoll D. Hung C.-F. Chemotherapy Acts as an Adjuvant to Convert the Tumor Microenvironment into a Highly Permissive State for Vaccination-Induced Antitumor Immunity Cancer Res. 2013 73 2493 2504 10.1158/0008-5472.CAN-12-4241 23418322 PMC3630272 198. Chen C.-A. Ho C.-M. Chang M.-C. Sun W.-Z. Chen Y.-L. Chiang Y.-C. Syu M.-H. Hsieh C.-Y. Cheng W.-F. Metronomic Chemotherapy Enhances Antitumor Effects of Cancer Vaccine by Depleting Regulatory T Lymphocytes and Inhibiting Tumor Angiogenesis Mol. Ther. 2010 18 1233 1243 10.1038/mt.2010.34 20372107 PMC2889744 199. Bialkowski L. van Weijnen A. Van der Jeught K. Renmans D. Daszkiewicz L. Heirman C. Stangé G. Breckpot K. Aerts J.L. Thielemans K. Intralymphatic mRNA Vaccine Induces CD8 T-Cell Responses That Inhibit the Growth of Mucosally Located Tumours Sci. Rep. 2016 6 22509 10.1038/srep22509 26931556 PMC4773884 200. Xia Q. Geng F. Zhang F.-F. Liu C.-L. Xu P. Lu Z.-Z. Xie Y. Sun B. Wu H. Yu B. Cyclophosphamide Enhances Anti-Tumor Effects of a Fibroblast Activation Protein α-Based DNA Vaccine in Tumor-Bearing Mice with Murine Breast Carcinoma Immunopharmacol. Immunotoxicol. 2017 39 37 44 10.1080/08923973.2016.1269337 28004985 vaccines-13-00976-t001_Table 1 Table 1 mRNA and DNA vaccines in preclinical animal models encoding the same antigens. Antigen Vaccine (Vector) Nucleic Acid Route and Dose Response Tumor Model Reference MUC1 pMUC1 DNA ID: 3 doses, biweekly (10 μg)  • Did not induce tumor protection alone • Co-administration of plasmid encoding murine IL-18 was needed to induce tumor protection, memory response, and epitope spreading Colorectal (MC38/MUC1+) [ 54 pcDNA3.1-MUC1 (pcDNA3.1(-)) DNA IM: 2 doses, biweekly (20 μg)  • Increased IFN-γ and granzyme B production • in vitro and in vivo cytotoxicity Colorectal [ 55 MUC1-HSP70 (pcDNA3) DNA ID: 3 doses, weekly (100 μg)  • Increased CD8+ proliferation • Increased IFN-γ secretion • Increased in vitro and in vivo cytotoxicity Melanoma [ 56 VR-MS DNA IM: 3 doses, biweekly (100 μg)  • Increased in vitro cytotoxicity • Delayed tumor growth Melanoma (B16/MUC1+survivin+) [ 57 CpDV-IL2-sPD1/MS (pBluescriptIISK (+)) DNA IM: 2 doses, biweekly (100 μg)  • Increased In vitro cytotoxicity • Increased antibody production • Increased IFN-γ secretion • Promoted tumor-infiltration of CD8+ T cells while reducing Treg infiltration • Delayed tumor growth and prolonged survival Colorectal (CT26/MUC1+ survivin+) [ 58 MUC1 mRNA (encapsulated in lipid/calcium/phosphate nanoparticle) mRNA SC: 2 doses, weekly (10 μg)  • Increased IFN-γ secretion • Increased in vivo MUC1-specific CD8+ T cell-dependent killing of tumor cells Triple negative breast (4T1) [ 59 MAGE-A pVAX1-MAGE-A3 DNA IM: 3 doses, every week (30 μg) with electroporation  • Delayed tumor growth • Increased IFN-γ response by splenocytes • Enhanced Th1 (IgG2A, IFN-γ) and Th2 (IgG1 and IL-4) responses • Augmented anti-tumor responses when plasmid fused encode to soluble PD-1 Lung carcinoma (LLC) [ 60 MAGE-A (encoding A1, A2, A3, A5, A6, A8) DNA IM: 3 doses, biweekly for in vitro; 4 doses, weekly for in vivo studies (25 μg) followed by electroporation  • Increased IFN-γ-secreting splenocytes • Increased frequency of IFN-γ+, CD107a+ T-bet+ IFN-γ+ and TNFα+ CD8+ T cells • Delayed tumor growth • Decreased tumor invasion depth in the skin • Increased tumor-infiltration of CD44+ PD-1+ CD8+ T cells Inducible model of melanoma (Tyr::CreER;Braf Ca/+ lox/lox [ 61 MAGE-A3 mRNA-containing LNP (DMKD/PS) mRNA IM: 2 doses, biweekly (20 μg)  • Delayed tumor growth and prolonged survival • Enhanced humoral response (IgG2a/b) • Did not change IFN-γ or IL-4 in sera • In vitro co-culture of splenocytes from with tumor increased IL-4 but not IFN-γ Colorectal (CT26) [ 62 HPV HPV16 E7/CRT (pDNA3) DNA Gene gun: 4 doses, weekly (16 μg)  • CD8+ T cell-dependent tumor protection • Reduced pulmonary tumor nodules and tumor growth • Decreased microvessel density in lung tumor nodules HPV-associated lung (TC-1) [ 63 pcDNA/E7, pcDNA/HSP70 DNA IM: 2 doses, biweekly  • pcDNA/E7 delayed tumor growth compared to PBS and empty vector • Co-administration of pcDNA/HSP70 further delayed tumor growth, enhanced lymphocyte proliferation, in vitro cytolytic activity of splenocytes of immunized mice HPV-associated lung (TC-1) [ 64 pNGVL4a/Sig/E7(detox)/HSP70 DNA IM (syringe needle and needle-free jet injection device): 2 doses, weekly (50 μg)  • Increased the number of IFN-γ-secreting E7-specific CD8+ T cells in the spleen (gene gun generated the highest number while requiring the least dose) • Complete in vivo protection HPV-associated lung (TC-1) [ 65 pBI-11 (codon-optimized pNGVL4a/Sig/E7(detox)/HSP70) DNA IM: 3 doses, 3-day interval (25 μg)  • Increased number of HPV-specific IFN-y-secreting CD8+ T cells (splenocytes and PBMC) • Delayed tumor growth HPV-associated lung (TC-1) [ 66 HPV16 E7 mRNA-LNP mRNA SC, IV: 3 doses, 5-day interval (10 μg)  • Expansion of HPV-specific CD8+ T cells in the spleen and tumor • Spleen CD8 +T cells clustered in the IFN-induced group • Tumor-infiltrating CD8+ T cells clustered in effector memory and exhausted groups • Clonal expansion in tumor-infiltrated effectors and exhausted cell subclusters HPV-associated oropharyngeal squamous cell carcinoma (mEERL) [ 67 HPV16 E6/E7 mRNA-LNP mRNA IM or SC: 3 doses, weekly (10 μg or 20 μg);  • Tumor regression after the first week of treatment • Formation of immunological memory (rejection tumor upon re-challenge) • Responses were not dose-dependent and did not differ by injection route HPV-associated cervical (C3.43) [ 68 mHTV-02 mRNA IM, IT, SC, IV, ID: 3 doses, weekly (6.25 μg, 12.5 μg, 25 μg)  • Increased secretion of IFN-γ and IL-2 • Increased HPV-specific IFN-γ+ and TNF-α+ CD8+ T cells • Increased tumor-infiltration of IFN-γ+ Granzyme B+ CD8+ T cells • Increased memory CD8+ and CD4+ • Tumor regression and prolonged survival • IM or IT significantly delayed tumor growth and prolonged survival, while IV did not affect growth or survival • Dose-responses observed for naïve immunized mice, but therapeutic doses as little as 6.25 µg were effective at controlling tumor growth HPV-associated lung (TC-1) [ 69 KRAS G12 KrasG12DN17 DNA Gene gun: 10 doses, 5-day interval (10 μg)  • Decreased number of lung nodule • Increased expression of IFN-γ, IL-12, IL-4 in the splenocytes of vaccinated mice • Combination of GG and IM immunization methods significantly increased CD8+ T cell infiltration into the lungs Bi-transgenic inducible, spontaneous lung adenocarcinoma (CCSP-rtTA/Tet-Op-K-Ras4G12D) [ 70 KRAS G12V mRNA mRNA 3 doses, 5-day interval (10 μg)  • Increased the percentage of KRAS G12V-specific CD8+ T cells in the spleen • Increased IFNγ secretion by splenocytes • Delayed the growth of G12V-bearing tumors Melanoma [ 71 mRNA-1521 mRNA Immunized on day 0, 21, and 49  • Tested for prophylactic use only • Delayed tumor growth • Combination with anti-PD-1 further delayed tumor growth • IgG response • Greater infiltration of CD8+ and Granzyme B+ CD8+ Colon carcinoma (CT26) [ 72 mRNA encoding transcripts for multiple KRAS mutant ag mRNA Not specified  • Increased tumor infiltration of CD8+ T cells (slight 0.5-fold increase in CD44+ CD8+) • Decreased Treg infiltration • Attenuated tumor growth by 37% Lung (LL/2) [ 73 Neoantigens B SARS KPC-mRNA mRNA 20 µg mRNA; immunized every 4 days for three doses, then every 3 days for two doses; total of 5 doses  • Significantly delayed tumor growth • Increased germinal center B cells • Increased T FH • Increased Granzyme B-producing CD4+ and CD8+ T cells Pancreatic (KPC 6422) [ 74 vaccines-13-00976-t002_Table 2 Table 2 Monotherapy mRNA and DNA vaccines in human clinical trials. Cancer Type Target Antigen Nucleic Acid Route and Dose Adjuvant Results or Recruitment Status Reference Breast Mammaglobin-A (Mam-A) DNA IM followed by EP, administered weeks 1, 4, and 8 by jet delivery device; unknown dose None Increased IFNγ-producing CD4+ T cells by vaccination NCT00807781 84 None Significant increase in the number of antigen-specific CD8+ T cells NCT00807781 85 IGFBP-2, HER2, and IGF-1R DNA ID, administered every 28 days; 150 µg, 300 µg, or 600 µg GM-CSF Elevated Th1 responses by vaccination with grade 1/2 adverse events; 300 µg dose elicited persistent immune responses 6mo after vaccine administration NCT02780401 86 HER2 intracellular domain (ICD) DNA ID, administered once a month for three months; 10 µg, 100 µg, or 500 µg GM-CSF Elicited robust HER2-specific type 1 T-cell responses; Stronger immune responses in 100 µg and 500 µg doses in comparison to 10 µg dose NCT00436254 87 Several neoantigens DNA IM with electroporation; 4 mg administered 3 times, every 28 days None Increased IFNγ secreting CD8+ T cells NCT02348320 88 CD105, Yb-1, SOX2, CDH3, and MDM2 DNA IV, administered once a month for 3 months, followed by boosters at 6 and 12 months GM-CSF Recruiting NCT05455658 ID, administered once a month for 3 months, with potential booster doses GM-CSF Active, not recruiting NCT02157051 Melanoma Emm55 DNA Intralesion; administered one time in up to 3 lesions; 0.1 mg/lesion None Several patients exhibited stable disease NCT03655756 89 gp75 (TYRP1) DNA IM; administered every three weeks for 5 vaccinations; 0.1 mg to 8 mg dose-escalation study None Completed (results not provided) NCT00034554 Tyrosinase DNA IM; administered every three weeks; 100 µg, 500 µg, or 1500 µg doses None Demonstrated vaccine safety and feasibility; CD8+ T cell responses detected in 7 patients; no correlation of immune response with respect to dose or treatment arm NCT00698100 90 DNA IM by electroporation; administered every three weeks up to five immunizations; 0.2 mg, 0.5 mg, or 1.5 mg per injection None Immune responses specific to tyrosinase were observed in 6/15 patients; immune responses were only detected in 1.5 mg cohort NCT00471133 91 DNA IN continuously over 96 h every 14 days; 200 µg, 400 µg, or 800 µg None Immune responses detected in 11/26 patients NCT00023647 92 GM-CSF DNA plus Tyrosinase and gp100 peptides DNA SC; administered monthly for a total of three immunizations; 100 µg, 400 µg, or 800 µg of GM-CSF-encoding DNA followed by SC delivery of peptides to the same site on days 5 or 6 post DNA administration GM-CSF CD8+ T cell responses against melanoma peptides detected in 42% of patients, no correlations between dose and T cell responses were observed NCT00580060 93 Tyrosinase and Melan-A (MART-1) DNA IN; continuous infusion on days 1–4 with boosters every 14 d up to four courses; 500 µg, 1000 µg, or 1500 µg None Completed (results not provided) NCT00033228 NY-ESO-1, MAGE-A3, tyrosinase, and TPTE mRNA IV; administered in 6 injections within 43 days or 8 injections within 64 days; dose escalation study with doses varying from 14.4 µg to 400 µg total RNA None Induced strong CD4+ and CD8+ T cell immunity against the vaccine antigens; T cells responses were not dose-dependent NCT02410733 94 gp100 DNA ID or IM; once every 4 weeks up to four doses IL-2 Completed (results not provided) NCT00019448 DNA IM; human gp100 in weeks 1, 4, and 7, followed by mouse gp100 in weeks 10, 13, and 16, or the reverse sequence; dose escalation study None Completed (results not provided) NCT00104845 Mouse tyrosinase-related protein 2 (TYRP2) DNA IM; every 3 weeks for 6 injections; doses of 500 µg, 2000 µg, 4000 µg, or 8000 µg None Completed (results not provided) NCT00680589 Melanoma-associated antigens mRNA ID GM-CSF Completed (results not provided) NCT00204516 Naked TAAs of melanoma mRNA IN; 8 immunizations over 43–51 days; total RNA doses of 100 µg, 200 µg, 600 µg, or 1200 µg containing RBL001 plus RBL002 None Completed (results not provided) NCT01684241 Neoantigens (IVAC MUTANOME1) mRNA IN None Induced antigen-specific immune responses NCT02035956 95 Prostate PAP (pTVG-HP) DNA ID; 6 immunizations administered biweekly; 100 µg, 500 µg, or 1500 µg doses GM-CSF PAP-specific T-cell responses detected; responses were not correlated with treatment doses NCT00582140 96 DNA ID; 100 µg; administered biweekly for 6 immunizations, then every 3 months until progression (Arm 1) or biweekly for 6 doses then administered every 2 weeks, 4 weeks, or 3 months as determined by immune responses GM-CSF NCT00849121 97 DNA ID; 100 µg; administered biweekly for 6 immunizations, then every 3 months for two years total treatment GM-CSF NCT01341652 98 Androgen receptor ligand-binding domain (pTVG-AR) DNA ID; administered in biweekly immunizations for 6 doses, then every 3 months up to 12 months (schedule 1) or weeks 0, 2, 12, 14, 24, 26, 36, 38, 48, and 50 (schedule 2) With or without GM-CSF Th1-type immunity to the AR LBD detected; immunological responses in patients treated biweekly for 6 doses followed by boosters every 3 months (schedule 1) were superior to patients treated on the intermittent biweekly schedule (schedule 2) NCT02411786 99 TAAs including PSA, PSCA, PSMA, STEAP1 mRNA ID; Phase I: 256 µg, 640 µg, 1280 µg; Phase II: 1280 µg; up to 5 immunizations None Induction of antigen-specific CD4+ and CD8+ T cells EudraCT 2008-003967-37, 100 Prostate Specific Antigen (PSA) DNA ID with electroporation; administered every 4 weeks for 5 months; doses of 50 µg to 1600 µg None PSA specific T cell detected NCT00859729 101 Cervical HPV E6 and E7 (VGX-3100) DNA IM with electroporation; 6 mg; administered weeks 0,4, and 12 None Better histological regression observed compared to placebo NCT01304524 102 HPV E6 and E7 (GX-188E) DNA Electroporation; 1 mg, 2 mg, or 4 mg; administered weeks 0, 4, and 12 None HPV-specific CD8 T-cell response detected; responses independent of dose NCT01634503 103 DNA Electroporation; 1 mg, 2 mg, or 4 mg doses None Unknown status NCT02100085 DNA IM with electroporation; weeks 0, 4, and 12; doses of 1 mg or 4 mg None Completed, Results not posted NCT02139267 DNA Electroporation; 1 mg and 4 mg; administered three times None Unknown status NCT02411019 DNA IM with electroporation; 1 mg administered at weeks 0,4, and 12 None Unknown status NCT02596243 HPV E6 and E7 DNA IM with electroporation; administered at weeks 0,4,8,12 None Antibody responses against HPV oncoproteins detected; antigen specific T cells detected NCT02172911 104 DNA IM with electroporation; 1 mg, 4 mg or 8 mg doses None Recruiting NCT06276101 HPV E6/E7 fusion protein DNA IM; 3 immunizations of 3 mg each; administered on weeks 0, 3, and 6 (cohort 1) or weeks 0, 4, and 8 (cohort 2) None HPV-specific T-cell responses detected; Stronger T cell responses observed in cohort 1 NCT02529930 105 HPV E6, E7, and L2 linked with calreticulin DNA IM with electroporation; 0.3 mg, 1 mg, or 3 mg doses None Not yet recruiting NCT04131413 HPV E7 DNA IM; 3 doses at 1 month intervals; 0.5 mg, 1 mg, or 3 mg doses None HPV E7-specific T-cell responses detected; regression instances detected in 3 mg cohort NCT00121173 106 HPV specific antigens (RG002) mRNA IM None Recruiting NCT06273553 Multiple advanced solid tumors NY-ESO-1 DNA ID by particle-mediated epidermal delivery; administered weeks 1, 5, and 9; 4 µg or 8 µg None NY-ESO-1-specific CD4+ and CD8+ T cells detected; no difference in immune responses between 4 µg and 8 µg cohorts NCT00199849 Preferentially expressed antigen in melanoma (PRAME) and prostate-specific membrane antigen (PSMA) DNA ID; administered on days 29 and 32 for up to 9 months; 30 µg or 300 µg None Increased PRAME-specific and PSMA-specific T cell responses; no difference in immune responses between low and high peptide dose cohorts NCT00423254 107  CD105, Yb-1, SOX2, CDH3, and MDM2 DNA ID; administered on day 14 for 3, 21-day cycles GM-CSF Active, not recruiting NCT05242965  NY-ESO-1, MAGE-C1, MAGE-C2, Survivin, and TPBG mRNA ID; administered at weeks 1, 3, 7, 11, or at 1, 2, 3, 5, and 7; 400 µg, 800 µg, or 1600 µg total None Induction of immune response against five antigens; dosage did not cause significant differences in immune response NCT00923312 108 Non-Small Cell Lung Neoantigens mRNA SC None Recruiting NCT03908671  VEGFR-2 DNA Oral; administered on days 1, 3, 5, and 7, then 4-weekly single doses every 4 weeks; 10 6 7 None VEGFR-2 specific T cell response detected NCT02718443 109  IE-1, pp65, gB DNA IM with electroporation; 8 mg None Completed (Results not provided) NCT05698199  whole tumor mRNA, pp65, LAMP mRNA IV; administered every 2 weeks for 3 doses following radiation, then 12 doses monthly None Recruiting NCT04573140  pp65 mRNA IV; 3 doses administered before or after tumor biopsy/resection None Recruiting NCT06389591  Neoantigens DNA IM; administered on days 1, 22, and 43 of cycle 1 and then day 1 of each subsequent cycle Plasmid encoded IL-12 Active, not recruiting NCT04015700 Glioblastoma Tumor-associated antigens mRNA IM; administered on days 1, 8, 15, 29, 43, 57, and 71; 6 µg, 12 µg, 25 µg, 50 µg, 100 µg None Active, not recruiting NCT05938387 vaccines-13-00976-t003_Table 3 Table 3 mRNA and DNA vaccines administered as parts of combination therapies in human clinical trials. Cancer Type Target Antigen Nucleic Acid Route and Dose Combination Therapy Results or Recruitment Status Reference Breast Mammaglobin-A (Mam-A) DNA IM; administered every 28 days for 3 months; 4 mg Neoadjuvant endocrine therapy Active, not recruiting NCT02204098 IGFBP-2, HER2, and IGF-1R DNA ID; administered on day 13 and repeated up to 3 times, every 21 days, in the absence of disease progression Paclitaxel (Chemo), trastuzumab and pertuzumab (anti-HER2) Recruiting NCT04329065 HER2 intracellular domain (ICD) mRNA IV; administered every 2 weeks for 3 injections total; 4 × 10 8 Pembrolizumab (anti-PD-1) Recruiting NCT03632941 Neoantigens DNA IM; administered every 28 days ± 7 days, with at least 21 days between injections by electroporation device; 4 mg Durvalumab (anti-PD-L1) Active, not recruiting NCT03199040  Chemotherapy and Pembrolizumab (anti-PD-1) Recruiting NCT06631092 Shared TAAs and neoantigens mRNA IV Surgery and adjuvant chemotherapy Recruiting NCT02316457 Melanoma gp100 and TRP-2 DNA IM; administered up to 11 times over 85 weeks using needle-free injection device Nivolumab (Opdivo) and Ipilimumab (Yervoy) Recruiting NCT04079166 Neoantigens mRNA IM; administered every 21 days up to 9 doses Pembrolizumab Prolonged recurrence-free survival in patients receiving vaccine plus Pembrolizumab versus Pembrolizumab alone; greater distant metastasis-free survival in combination therapy treated patients NCT03897881 140 Colorectal Oncoprotein MYB DNA ID; administered weekly for 6 weeks; 0.1 mg, 0.5 mg, or 1.0 mg Tetanus toxoid peptides and anti-PD-1 Completed (result not provided) NCT03287427 141 Prostate PAP (pTVG-HP) DNA ID; administered bi-weekly for 4 weeks; 100 µg Sipuleucel-T Higher titer antibody responses to PAP detected NCT01706458 142 DNA ID; administered every 2 weeks or every 3 weeks; 100 µg Pembrolizumab (anti-PD-1) PAP-specific T cells detected NCT02499835 143 DNA ID; administered every 2 weeks for 6 vaccinations and then every 4 weeks for 9 vaccinations; 100 µg Nivolumab (anti-PD-1) PAP specific T cell responses detected with prolonged time to disease progression NCT03600350 144 PAP (pTVG-HP), Androgen receptor ligand-binding domain (pTVG-AR) DNA ID; administered on days 1 and 8 of 21 day cycles; 100 µg Pembrolizumab (anti-PD-1) Completed (results not provided) NCT04090528 Androgen receptor ligand-binding domain (pTVG-AR) DNA ID; administered weekly for 7 weeks; 100 µg Degarelix (Androgen deprivation therapy), Cemiplimab (anti-PD-1), Fianlimab (anti-LAG-3) Recruiting NCT04989946 PSA DNA SC; administered monthly Flutamide (AR blockade) flutamide + vaccine did not further improve patient outcome NCT00450463 145 Three prostate cancer-specific antigens (SL-T10) DNA IM; multiple injections administered; 3 mg or 6 mg GX-I7 (T-cell growth factor), Pembrolizumab (anti-PD-1) Recruiting NCT06344715 Neoantigens DNA IM, followed by EP; administered starting week 21 for a total of 6 treatments every 28 days; 4 mg Nivolumab (anti-PD-1)/ipilimumab (anti-CTLA-4) and PROSTVAC Completed (results not provided) NCT03532217 PSMA DNA IM (without EP): 800 µg, 1600 µg, or 3200 µg; IM (with EP): 400 µg, 800 µg, or 1600 µg; administered at weeks 0, 4, 8, 24, and 48 Fragment C of tetanus toxin Antigen-specific CD4+ and CD8+ T cells detected; Stronger immune response with IM administration with EP [ 124 Glioblastoma Wilms tumor gene-1 (WT1), PSMA, hTERT DNA IM followed by EP; administered starting on day 0 and every 3 weeks for 4 doses, then every 9 weeks until disease progression; 3 mg INO-9012 (human IL12), cemiplimab, temozolomide, radiation Increased antigen specific T cell populations NCT03491683 146 VEGFR-2 DNA Oral; administered on days 1, 3, 5, 7 every 4 weeks; 10 6 7 anti-PD-L1 Increased number of intratumoral CD8+ T-cells detected NCT03750071 147 Neoantigens DNA IM with electroporation; administered once every 28 days for up to 6 doses Retifanlimab (anti-PD-1) Recruiting NCT05743595 Pancreatic mutant KRAS mRNA IM Toripalimab (anti-PD-1) Recruiting NCT06577532 Neoantigens mRNA Unknown route; administered 9 weeks post-tumor resection Camrelizumab (anti-PD-1), Gemcitabine, Abraxane Recruiting NCT06326736 mRNA Unknown route; administered 12 weeks post-tumor resection Ipilimumab (anti-CTLA-4), gemcitabine, capecitabine Not yet recruiting NCT06353646 mRNA Unknown route Anti-PD-1 Recruiting NCT06496373 mRNA Unknown route Adebrelimab (anti-PD-L1) Not yet recruiting NCT06156267  mRNA IV; 25 µg administered weekly beginning 9 weeks post tumor resection plus booster doses at weeks 17 and 46 Atezolizumab (Anti-PD-L1), mFOLFIRINOX (chemotherapy) 50% of patients had detectable T cell responses to at least one neoantigen; vaccine-induced T cell clonal expansion detected in all immunological responders; longer recurrence free survival in immunological responders; persistent, high-avidity T cell clones detected NCT04161755 148 149 Cervical HPV E6 and E7 (GX-188E) DNA IM with electroporation; administered 3 times; 1 mg GX-17 (IL-7 fused to hyFc), Imiquimod Unknown status NCT03206138 HPV E6 and E7 (GX-188E) DNA IM; administered on days 1 and 29; 3 mg Imiquimod, TA-HPV(recombinant vaccinia virus expressing HPV16/18 E6-E7 fusion proteins) Half of the patients cleared their lesions NCT00788164 150 DNA ID: 8 µg or 16 µg Imiquimod Increased CD8+ T cell infiltration in cervical dysplastic epithelium in intralesional cohort NCT00988559 151 Ovarian p62/SQSTM1 DNA IM; 2.5 mg; administered weekly Gemcitabine Higher objective response rate in patients receiving combination treatment of DNA vaccine and chemo versus chemo alone; greater number of partial responders and patients with stable disease in combination group; longer progression-free survival in combination treatment group NCT05979298 152 Non-Small Cell Lung Neoantigens DNA IM with electroporation; administered once every 4 weeks for 6 cycles Durvalumab (anti-PD-L1) Recruiting NCT04397003 NY-ESO-1, MAGE-C1, MAGE-C2, survivin, 5T4, and MUC-1 mRNA ID; administered on days 1, 8, 15, 36, and 57, or days 1, 8, 15, 29, 43, and 57; 320 µg Local radiation Induction of immune response against six antigens [ 153 NY-ESO-1, MAGE-C1, MAGE-C2, survivin, 5T4, and MUC-1 mRNA ID; each component administered twice for a total of 12 vaccinations; 80 µg Durvalumab (anti-PD-L1), Tremelimumab (anti-CTLA-4) Completed (result not provided) NCT03164772 Neoantigens mRNA Unknown route Adebrelimab (anti-PD-L1) Not yet recruiting NCT06685653 Neoantigens mRNA Unknown route Adebrelimab (anti-PD-L1) Not yet recruiting NCT06735508 KRAS mutants (G12D, G12V, G12C, G13D) mRNA IM; administered once every 3 weeks for 9 doses; 1 mg Pembrolizumab (anti-PD-1) Completed (results not provided) NCT03948763 Tumor mRNA mRNA IV; administered 7–14 days after last dose of priming vaccine, then every two weeks for 2 doses, and then monthly for 9 doses pp65 RNA-LP Not yet recruiting NCT05660408 ",
  "metadata": {
    "Title of this paper": "Cyclophosphamide Enhances Anti-Tumor Effects of a Fibroblast Activation Protein α-Based DNA Vaccine in Tumor-Bearing Mice with Murine Breast Carcinoma",
    "Journal it was published in:": "Vaccines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474387/"
  }
}