{
  "title": "Paper_824",
  "abstract": "pmc J Surg Case Rep J Surg Case Rep 2009 jscr jscr Journal of Surgical Case Reports 2042-8812 Oxford University Press PMC12463440 PMC12463440.1 12463440 12463440 41018921 10.1093/jscr/rjaf757 rjaf757 1 Case Report AcademicSubjects/MED00910 jscrep/0160 Right colon interposition in benign esophageal stricture and gastric atrophy: technical nuances and functional outcomes from a complex case https://orcid.org/0000-0001-8040-4379 Muñoz-Palomeque Santiago  Department of Surgery Ecuador  Faculty of Medical Ecuador  Department of Surgery Ecuador Morillo Cox Álvaro  Faculty of Medical Ecuador  Department of Surgery Ecuador Fernández Tatiana  Department of Surgery Ecuador  Faculty of Medicine Ecuador Morillo Mauricio  Department of Surgery Ecuador Corresponding author. Department of Surgery, Division of General Surgery, Hospital Metropolitano, Av. Mariana de Jesús Oe 7/47, Quito 170411, Ecuador. Tel: +593 984966771; E-mail: santy_munoz20@hotmail.com 9 2025 25 9 2025 2025 9 496005 rjaf757 17 8 2025 03 9 2025 25 09 2025 26 09 2025 29 09 2025 © The Author(s) 2025. Published by Oxford University Press and JSCR Publishing Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract We present the case of a 43-year-old woman with complete esophageal and gastric stenosis after caustic ingestion. Following initial emergency surgery for gastric perforation, she remained dependent on a jejunostomy for over a year, developing severe malnutrition, dysphagia, and psychological decline. Definitive reconstruction was achieved with a one-stage subtotal esophagectomy and total gastrectomy. A right colon interposition graft, routed through the posterior mediastinum, was used after confirming adequate perfusion despite the absence of the right colic artery. The procedure included a cervical esophago-colonic anastomosis, Roux-en-Y colojejunal anastomosis, ileotransverse bypass, and incidental cholecystectomy and appendectomy. Postoperative recovery was uneventful, with the patient resuming soft oral intake, gaining weight, and showing marked nutritional and functional improvement. This case underscores the value of right colon interposition when the stomach is unavailable, highlighting the need for tailored conduit choice, precise vascular assessment, and multidisciplinary perioperative care in complex benign esophageal disease. colonic interposition colon surgery specialty esophageal reconstruction esophageal stenosis esophagectomy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Caustic ingestion of strong acids or alkalis can result in severe damage to the upper gastrointestinal tract, particularly the esophagus and stomach. The extent of injury depends on the nature of the substance and duration of exposure. Alkali agents typically induce liquefactive necrosis with deep transmural injury, whereas acids cause coagulative necrosis with eschar formation that may limit deeper penetration [ 1 2 1 3 Colon interposition, first described in the early 20th century and popularized by surgeons such as Richardsons and Belsey, is a well-established technique for esophageal reconstruction [ 4 5 6–9 10 6 10 This report presents a case of severe caustic-induced esophageal and gastric injury managed with right colon interposition, highlighting the pathophysiological basis, surgical indications, and key technical considerations in this complex reconstructive approach. Case report A 44-year-old woman with a history of caustic ingestion during a suicide attempt 18 months prior initially presented with Zargar grade IIIB esophagitis and erosive gastropathy, complicated by proximal gastric perforation and secondary peritonitis. Emergency surgery was performed, including exploratory laparotomy, primary gastric repair, Dor fundoplication, peritoneal lavage, and creation of a Witzel-type feeding jejunostomy. During follow-up, the patient developed complete esophageal stricture ( Fig. 1 2 Figure 1 Esophagogram with esophageal stricture. A midline laparotomy was performed with extensive adhesiolysis. A total gastrectomy and near-total esophagectomy were completed using the Orringer technique, incorporating a left cervical incision along the anterior border of the sternocleidomastoid muscle. The previously placed jejunostomy was removed. The stomach was atrophic and nonviable as a conduit. The right colon was mobilized using a standard Cattell–Braasch maneuver. Intraoperative assessment revealed the absence of the right colic artery; perfusion relied on the ileocolic artery and the right branch of the middle colic artery via a well-formed marginal artery of Drummond ( Fig. 2 Fig. 3 Figure 2 Right colonic interposition after Cattel-Braasch maneuver. Figure 3 Confirmation of collateral vascular flow in the right colon (arrow shows ileocolic artery). The prepared right colonic segment was transposed through the posterior mediastinum using the ‘shoe-shiner’ technique to avoid torsion and preserve orientation ( Fig. 4 Fig. 5 Figure 4 Positioning of the right colon in the posterior mediastinum, prior to the formation of the anastomoses (• abdominal/distal end of the right colon, * Figure 5 Esophagocolonic anastomosis below the hypopharynx after Orringer’s approach technique. Alimentary tract continuity was re-established with a mechanical, side-to-side, isoperistaltic Roux-en-Y colojejunal anastomosis and a side-to-side ileotransverse anastomosis ( Fig. 6 Figure 6 Abdominal anastomoses. (A) Colo-jejunal anastomosis, (B) alimentary loop, (C) Roux-en-Y anastomosis, (D) ileo-transverse anastomosis. The patient was admitted to the intensive care unit for 48 hours, requiring low-dose vasopressors but no mechanical ventilation. Parenteral nutrition began on postoperative day 1 (POD1). On POD2, clear liquids were trialed but limited by dysphagia; flexible endoscopy carried by the otolaryngology team ruled out obstruction. A semisolid diet was started under swallowing therapy and was well tolerated. Drains were removed on POD7, and the patient was discharged on a soft diet with good bowel function and no signs of infection or anastomotic leak. At first follow-up, she showed weight gain, adherence to nutritional goals, and stable psychiatric status under continued outpatient care. Discussion Colonic interposition remains one of the most technically demanding operations in gastrointestinal surgery with a significant learning curve and a high risk of early complications such as graft necrosis or anastomotic leaks and late complications such as stricture, redundancy, and dysmotility [ 4 6 9 11–13 However, colonic interposition remains a technically demanding yet valuable option for esophageal reconstruction in patients with benign pathology where the stomach is unavailable due to caustic damage or prior surgery. In this context, the right colon, based on the middle colic artery, offers specific advantages over the left colon, particularly in terms of length, reach, and isoperistaltic alignment [ 4 5 7 5 9 The vascular anatomy relevant to colon interposition enhances the marginal artery of Drummond, first described in 1914, which provides the critical anastomotic channel linking the ileocolic, right colic, middle colic, and left colic arteries [ 14 10 In our case, the absence of the right colic artery and dominant supply via the ileocolic and middle colic arteries was confirmed intraoperatively, with a robust marginal artery of Drummond ensuring perfusion. This eliminated the need for supercharging, which may be reserved for questionable vascularization or very long conduits [ 7 12 15 9 5 11 15 Surgical precision—including manual two-layer esophago-colonic anastomosis, mechanical colojejunal anastomosis, and the ‘shoe shiner’ maneuver to avoid torsion—was critical. The favorable postoperative course, absence of leak or ischemia, and rapid nutritional recovery underscore the effectiveness of the meticulous technique and individualized conduit planning. Nutritional optimization pre- and postoperatively also played a pivotal role in reducing complications and supporting anastomotic healing. Conclusions This case highlights the successful use of right colon interposition for esophageal reconstruction in a patient with long-segment caustic esophageal and gastric strictures, where conventional options such as gastric pull-up were not feasible. The patient demonstrated excellent postoperative outcomes, including restoration of oral intake, significant nutritional recovery, and stability of preexisting psychiatric comorbidities, all of which contributed to a favorable quality of life after surgery. The complexity of this case underscores the critical importance of multidisciplinary evaluation, involving surgical, nutritional, psychiatric, and anesthetic teams, in managing patients with severe caustic injuries. Equally essential is the role of experienced surgical teams familiar with advanced reconstructive techniques and the nuances of colonic vascular anatomy. Right colon interposition via the posterior mediastinum proved to be a safe and effective solution, provided that vascular integrity is confirmed and meticulous surgical technique is employed. This experience reinforces the notion that with proper case selection and comprehensive perioperative care, even the most challenging benign esophageal pathologies can be managed with excellent functional results. Acknowledgements A special acknowledgement to the staff of this illustrious journal for the opportunity to publish this research in this prestigious journal, and to contribute to the scientific and surgical community through it. Author contributions Santiago Muñoz-Palomeque (Methodology, Formal analysis, Investigation, Data curation, Writing—original draft, Visualization), Álvaro Morillo-Cox (Methodology, Validation, Formal analysis, Writing—review & editing, Visualization), Tatiana Fernández (Validation, Formal analysis, Writing—review & editing, Visualization) and Mauricio Morillo: (Conceptualization, Validation, Formal analysis, Visualization) Conflict of interest statement The authors declare that we have no personal, financial, intellectual, economic or corporate conflict of interest with the members of the journal. Funding No funding was provided for the preparation of this article. Data availability All data presented are available from the corresponding author. REFERENCES 1. Gambardella C Allaria A Siciliano G et al. Recurrent esophageal stricture from previous caustic ingestion treated with 40-year self-dilation: case report and review of literature BMC Gastroenterol 2018 18 68 10.1186/s12876-018-0801-3 29788901 PMC5964928 2. Chirica M Resche-Rigon M Bongrand NM et al. Surgery for caustic injuries of the upper gastrointestinal tract Ann Surg 2012 256 994 1001 10.1097/SLA.0b013e3182583fb2 22824850 3. Strat M Corte H Plaud B et al. Knowledge of initial management of caustic ingestions: a national survey of emergency physicians in France Emerg Med J 2025 42 315 6 10.1136/emermed-2024-214546 39890441 4. Gust L Ouattara M Coosemans W et al. European perspective in thoracic surgery-eso-coloplasty: when and how? J Thorac Dis 2016 8 S387 98 10.21037/jtd.2016.04.43 27195136 PMC4856848 5. Wang CG Zhang GX Zhang Y et al. A case report of colon interposition radical surgery performed via unilateral thoracotomy in a patient with esophageal cancer after billroth II gastrectomy Front Oncol 2024 14 1403192 10.3389/fonc.2024.1403192 39381042 PMC11458370 6. Barbosa B Santos B Mesquita I et al. Adenocarcinoma arising in a colonic interposition after esophagectomy for benign stricture and review of the literature J Surg Case Rep 2018 2018 rjy264 10.1093/jscr/rjy264 30310649 PMC6172699 7. Banerjee JK Saranga BR Minimally invasive substernal colonic transposition for corrosive strictures of the upper aerodigestive tract Dis Esophagus 2017 30 1 11 10.1093/dote/dow030 28375474 8. Saikrishna E Varshney VK Soni S et al. Outcomes of near-infrared fluorescence guided colonic interposition for corrosive esophageal stricture Surgery 2025 185 109504 10.1016/j.surg.2025.109504 40540785 9. Reslinger V Tranchart H D’Annunzio E et al. Esophageal reconstruction by colon interposition after esophagectomy for cancer analysis of current indications, operative outcomes, and long-term survival J Surg Oncol 2016 113 159 64 10.1002/jso.24118 26699417 10. Mann MR Kawzowicz M Komosa AJ et al. The marginal artery of Drummond revisited: a systematic review Transl Res Anat 2021 24 100118 10.1016/j.tria.2021.100118 11. Saeki H Morita M Harada N et al. Esophageal replacement by colon interposition with microvascular surgery for patients with thoracic esophageal cancer: the utility of superdrainage Dis Esophagus Off J Int Soc Dis Esophagus 2013 26 50 6 10.1111/j.1442-2050.2012.01327.x 22394201 12. Sert G Chen SH Chen HC How to ensure immediate and long-term good blood supply by the careful dissection of the marginal artery and supercharge with neck vessels in esophageal reconstruction with the colon segment interposition: 35 years of experience J Plast Reconstr Aesthetic Surg JPRAS 2021 74 101 7 10.1016/j.bjps.2020.08.013 32873529 13. Sanchez MV Alicuben ET Luketich JD et al. Colon interposition for esophageal cancer Thorac Surg Clin 2022 32 511 27 10.1016/j.thorsurg.2022.07.006 36266037 14. Drummond H Some points relating to the surgical anatomy of the arterial supply of the large intestine Proc R Soc Med 1914 7 185 93 10.1177/003591571400702042 PMC2003096 19978404 15. AbouZeid AA Zaki AM Radwan AB et al. Colonic replacement of the esophagus: towards standardization of the technique J Pediatr Surg 2020 55 1145 51 10.1016/j.jpedsurg.2019.10.050 31718868 ",
  "metadata": {
    "Title of this paper": "Colonic replacement of the esophagus: towards standardization of the technique",
    "Journal it was published in:": "Journal of Surgical Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12463440/"
  }
}