{
  "title": "Paper_54",
  "abstract": "pmc BMC Med Educ BMC Med Educ 38 bmcmedu BMC Medical Education 1472-6920 BMC PMC12492832 PMC12492832.1 12492832 12492832 41039379 10.1186/s12909-025-07964-4 7964 1 Research Evaluating the impact of a national virtual continuing professional development program in gynecological oncology: a Kirkpatrick model approach Kerdari Monir 1 Kalantarion Masomeh 2 Ahmady Soleiman 2 Mastour Haniye 1 Arab Maliheh drmarab@yahoo.com 3 Sohrabi Somaye sohrabisomaye1@gmail.com 2 1 https://ror.org/034m2b326 grid.411600.2 School of Medical Education and Learning Technologies, Shahid Beheshti University of Medical Sciences, 2 https://ror.org/034m2b326 grid.411600.2 Department of Medical Education, School of Medical Education and Learning Technologies, Shahid Beheshti University of Medical Sciences, 3 https://ror.org/034m2b326 grid.411600.2 Department of Gynecology Oncology, Shahid Beheshti University of Medical Sciences, 2 10 2025 2025 25 478181 1339 17 2 2025 3 9 2025 02 10 2025 04 10 2025 04 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Introduction Continuing Professional Development (CPD) is essential for healthcare professionals to maintain and enhance their competencies, particularly in specialized fields such as gynecological oncology. In low- and lower-middle-income countries (LLMICs), access to CPD is often limited, and virtual platforms have emerged as a viable solution to overcome these barriers. This study uses the Kirkpatrick Model to evaluate a national virtual CPD program in gynecological oncology, focusing on participant satisfaction and knowledge acquisition. Methods A quasi-experimental study was conducted with 104 gynecological oncology specialists and fellows in Iran. The virtual CPD program was delivered via a Moodle-based Learning Management System (LMS) and included multimedia content, interactive modules, discussion forums, and live webinars. Data were collected through pre- and post-course assessments to measure knowledge gains and a post-course satisfaction survey to evaluate participant reactions. Descriptive statistics and paired t-tests were used to analyze the data, with statistical significance set at p Results The Level 1 evaluation revealed high participant satisfaction, with 64.42% reporting that the course content aligned with its objectives, 75% expressing satisfaction with the program’s delivery, and 82.69% finding the course facilities highly satisfactory. The Level 2 evaluation demonstrated a statistically significant improvement in knowledge scores from pretest (mean = 37.21, SD = 12.71) to posttest (mean = 42.07, SD = 6.09), with a mean score increase of 4.86 ( p Conclusion The virtual CPD program effectively engaged participants and enhanced their knowledge, highlighting the potential of online learning platforms to deliver high-quality CPD in resource-constrained settings. Future research should explore the long-term impact of virtual CPD on clinical practice and patient outcomes. Keywords Continuing professional development (CPD) Kirkpatrick model Gynecological oncology Virtual learning Knowledge acquisition Participant satisfaction pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Continuing Professional Development (CPD) is increasingly expected and required of healthcare professionals to maintain their credentials and right to practice [ 1 2 3 4 5 6 In many low- and lower-middle-income countries (LLMICs), CPD is not mandated, and uptake and participation by healthcare professionals are limited due to access barriers [ 7 8 9 10 11 12 The current evidence surrounding the most effective e-learning modalities is limited because the reported program designs differ with variations in the types of modalities used to deliver virtual CPD. This study’s virtual course under evaluation was delivered through a Learning Management System (LMS) based on Moodle - a platform that facilitates structured, interactive, and scalable education. While virtual CPD has gained significant traction, particularly in the wake of global advancements in digital technology, there remains a need to evaluate its effectiveness rigorously. In their review, Merry et al. (2023) declared that leadership and buy-in from key stakeholders, including government bodies and healthcare professional organizations, and a framework are essential for developing, implementing, and sustaining a CPD system in an LLMIC [ 2 13 14 Evaluating training programs within CPD systems is of great importance, as these evaluations help identify the strengths and weaknesses of educational initiatives. Regular assessments can ensure that the training content aligns with the current needs of healthcare professionals and evolving trends in the healthcare sector. Additionally, evaluations contribute to improving the quality of training and enhancing its impact on professional performance and patient outcomes. In low- and lower-middle-income countries (LLMICs) and low- and middle-income countries (LMICs), these assessments can also help optimize the use of limited resources and ensure the return on investment in educational programs. Calleja et al. [ 15 16 broader impacts 17 Although all models have some deficiencies, according to the evaluation, Kirkpatrick’s model has a suitable and acceptable performance for evaluating educational programs [ 18 19 20 20 21 This study employed a two-level evaluation framework based on the Kirkpatrick Model to assess the effectiveness of a national virtual CPD course in gynecological oncology. It highlights the potential of a virtual CPD program in gynecological oncology while emphasizing the importance of an evaluation to ensure that digital learning translates into tangible improvements in practice. Through this analysis, we seek to contribute to the growing body of evidence on effective virtual CPD strategies and to provide insights that can guide the design and implementation of future online educational initiatives in healthcare. Methods This quasi-experimental study was conducted in the School of Medical Education and Learning Technologies at Shahid Beheshti University of Medical Sciences, Iran. The study received ethical approval from Shahid Beheshti University (IR.SBMU.SME.REC.1403.088) before recruitment. Participants provided written informed consent after reviewing privacy protections, including anonymized data storage and the right to withdraw. This study employed a structured, two-level evaluation framework based on the Kirkpatrick Model to assess the effectiveness of a national virtual CPD course in gynecological oncology. The evaluation focused on Levels 1 and 2 of the Kirkpatrick Model, which measures participant reactions (participant satisfaction with the virtual platform and content) and learning outcomes (knowledge acquisition). The course was delivered through a Learning Management System (LMS) based on Moodle, and the methodology was designed to ensure rigorous, reproducible, and academically sound evaluation. This was a certificate-awarding program, and participants who achieved at least 80% of the total score were granted a completion certificate. Study design, context, and participant recruitment and demographics The study was designed as a program evaluation of a national virtual CPD course tailored for gynecological oncologists and allied healthcare professionals, including 104 specialists in obstetrics and gynecology surgery and a subspecialty fellowship. The program’s educational objectives were: (1) Enhance evidence-based management knowledge for cervical, endometrial, ovarian, vulvar, and breast cancers; (2) Improve diagnostic accuracy for CIN and GTN; (3) Develop proficiency in interpreting colposcopy results and virtual case scenarios. Participants were recruited through professional societies, institutional networks, and direct email invitations. They were required to practice actively in gynecological oncology or a related field and have access to the LMS platform as inclusion Criteria. Information on participants’ professional roles and ages was collected to contextualize the findings and ensure the sample represented a diverse cohort. The course was hosted on an LMS platform based on Moodle of the Shahid Beheshti University of Medical Sciences, facilitating asynchronous learning through multimedia content, interactive modules, and assessments. The evaluation framework was anchored in the Kirkpatrick Model, focusing on participant satisfaction and engagement with the virtual course (Level 1: Reaction) and knowledge acquisition resulting from the course (Level 2: Learning). This model was chosen for its structured approach to evaluating immediate educational outcomes (reaction and learning), which was feasible given the virtual delivery constraints and resource limitations in our setting. While other models (e.g., Moore et al.’s CME framework) offer comprehensive evaluation across higher-level outcomes, our study prioritized actionable insights for rapid program improvement. Procedure The course covered key topics such as Cervical Intraepithelial Neoplasia (CIN), Colposcopy, Cervix, Endometrium, Gestational Trophoblastic Neoplasia (GTN), Ovary, Vulva, and Breast. The procedure for implementing and evaluating the program is outlined below:   Pre-course preparation Before the course began, several steps were taken: (a) (b) (c)  2)  Course implementation Several stages were completed to implement the course: (a) (b) 1 Fig. 1 A B C D  3)  Post-course evaluation After the program, the executive team conducted two key activities: (a) Posttest Administration: A posttest, similar in format and difficulty to the pretest, was administered through the Moodle platform after the course. This test was designed to evaluate the knowledge gained by participants, and (b) Satisfaction Survey. A comprehensive survey was distributed to participants to gather feedback on various aspects of the course, including content quality, platform usability, and overall learning experience. The survey was conducted using an online tool integrated with the Moodle platform. The timeline of the virtual CDP program is illustrated in Table 1 r  Table 1 10-Month timeline of the virtual CPD program Month Phase Activities Topics Covered Month 1 Pre-Course Preparation - Content development (lectures, case studies, multimedia) N/A - Moodle LMS setup (forums, quizzes, resource libraries) N/A - Participant registration and account creation N/A Month 2 Pre-Course Preparation - Pretest administration (baseline knowledge assessment) N/A Month 3 Course Implementation - Orientation session (platform familiarization and course overview) N/A - Release of Topic 1 Cervical Intraepithelial Neoplasia (CIN) - Activation of Topic 1 discussion forum Month 4 Course Implementation - Release of Topic 2 Colposcopy - Activation of Topic 2 discussion forum - Live Webinar 1 Interactive Q&A on CIN and Colposcopy Month 5 Course Implementation - Release of Topic 3 Cervix - Activation of Topic 3 discussion forum Month 6 Course Implementation - Release of Topic 4 Endometrium - Activation of Topic 4 discussion forum - Live Webinar 2 Case Studies on Cervix and Endometrium Month 7 Course Implementation - Release of Topic 5 Gestational Trophoblastic Neoplasia (GTN) - Activation of Topic 5 discussion forum Month 8 Course Implementation - Release of Topic 6 Ovary - Activation of Topic 6 discussion forum - Live Webinar 3 Advanced Topics in GTN and Ovarian Pathology Month 9 Course Implementation - Release of Topic 7 Vulva - Activation of Topic 7 discussion forum - Release of Topic 8 Breast - Activation of Topic 8 discussion forum - Live Webinar 4 Comprehensive Review of Vulva and Breast Topics Month 10 Post-Course Evaluation - Posttest administration (knowledge assessment after course completion) All Topics (CIN, Colposcopy, Cervix, Endometrium, GTN, Ovary, Vulva, Breast) - Satisfaction survey distribution Feedback on course content, platform, and overall experience Data Collection & Analysis - Collection and analysis of pre-and posttest data N/A - Analysis of satisfaction survey responses N/A Reporting & Feedback - Compilation of results into a comprehensive report N/A - Dissemination of results to stakeholders N/A - Planning for future improvements based on feedback N/A Data collection and analysis Data were collected at two stages, corresponding to Levels 1 and 2 of the Kirkpatrick Model. Satisfaction survey: A comprehensive survey was distributed to participants to gather feedback on various aspects of the course, including content quality, platform usability, and overall learning experience. The survey was conducted using an online tool integrated with the Moodle platform. Learning survey: Assessments included 100 MCQs and case-based scenarios across six domains: CIN/colposcopy (30 items), cervical cancer (20 items), endometrial cancer (16 items), GTN (14 items), ovarian cancer (12 items), and vulvar/breast cancers (8 items). Domains were weighted by prevalence and clinical urgency in LLMIC settings. Scores were calculated as the percentage of correct responses (total correct answers ÷ 100 × 100), with a maximum score of 100. The aggregate score represents comprehensive knowledge across all domains, while domain-specific sub-scores (correct items per topic ÷ total items in that domain) pinpoint areas of high/low performance. For example, a participant scoring 75/100 demonstrated 75% mastery of the total curriculum. Level 1: reaction Responses from the satisfaction survey were analyzed to evaluate participant satisfaction and identify areas for improvement in future course iterations. Using the LMS’s integrated tool, a post-course survey was conducted immediately after completion. The survey used in this study was adopted from the study by Yarmohammadian et al. [ 22 r Level 2: learning Pretest and posttest scores were collected and analyzed to assess the learning outcomes. Statistical methods were employed to determine the significance of knowledge improvement. The assessments consisted of multiple-choice questions (MCQs) and case-based scenarios aligned with the course objectives. Changes in knowledge scores were calculated by comparing the course assessment results. The assessments were designed to evaluate the application of foundational knowledge and concepts in clinical scenarios. Paired t-tests were used to compare scores, with statistical significance set at p Results This quasi-experimental study was conducted on 104 female obstetrics and gynecology surgery specialists and a subspecialty fellowship with a mean work experience of 11 ± 3 years. The mean age of the participants was 40.47 ± 7.494 years, while 58 individuals (55.77%) were specialists in obstetrics and gynecology surgery, and 46 participants (44.23%) were subspecialty fellows. Domain analysis revealed the greatest improvements in GTN management (mean + 22.4%, p p p The results of the first-level Kirkpatrick evaluation indicated that 67 individuals (64.42%) who participated in the virtual CPD program declared that the course content was directly aligned with its objectives and responded positively. Seventy-eight participants (75%) were delighted with how the program was conducted. Eighty-six individuals (82.69%) declared the implementation and provision of course facilities were highly satisfactory. Seventy-nine respondents (75.96%) expressed that presenting this course in the future will benefit learners. Over 50% of participants were satisfied with the program in all other questionnaire domains. A paired samples t-test was conducted to examine the effect of the intervention (virtual CPD course) on participants’ scores. The descriptive statistics indicate that the mean score on the pretest was 37.21 out of 50 (SD = 12.71), while the mean score on the posttest increased to 42.07 out of 50 (SD = 6.09). It revealed a statistically significant improvement in scores from the pretest to the posttest, t (103) = − 4.246 ( p 2 Table 2 The paired samples t-test to evaluate the second-level Kirkpatrick model Mean SD df t p Pretest 37.21 12.71 103 −4.246 < 0.001 Posttest 42.07 6.09 SD df t These findings indicate that the national virtual CPD course had a statistically significant impact on improving participants’ knowledge and learning outcomes. However, the effect size suggests that while the change is meaningful, the practical significance may be moderate. Discussion Unlike prior Kirkpatrick applications relying on proprietary platforms, this study proves the viability of cost-free Moodle LMS for specialty training - a critical innovation for LLMICs. Our Farsi-language assessments, validated against Iranian cancer guidelines, further demonstrate contextual adaptation absent in Western models. This study evaluated a national virtual Continuing Professional Development (CPD) program in gynecological oncology using the Kirkpatrick Model, focusing on Levels 1 (Reaction) and 2 (Learning). The findings demonstrate that the program successfully engaged participants and enhanced their knowledge, aligning with the growing body of evidence supporting the effectiveness of virtual CPD programs in specialized medical fields. The results provide valuable insights into the design, implementation, and evaluation of virtual CPD initiatives, particularly in resource-constrained settings. The evaluation of Level 1 revealed high levels of participant satisfaction with the virtual CPD program. Most participants (64.42%) reported that the course content was directly aligned with its objectives, and 75% expressed satisfaction with the program’s delivery. Furthermore, 82.69% of participants found the implementation and provision of course facilities highly satisfactory, and 75.96% believed that offering this course in the future would benefit learners. These findings underscore the program’s success in meeting participants’ expectations and highlight the importance of aligning course content with learners’ needs and professional contexts. The positive reception of the virtual format also reflects the growing acceptance and effectiveness of online learning platforms in medical education, particularly in overcoming barriers to access and participation in low- and lower-middle-income countries (LLMICs). This LLMIC context magnifies the program’s value: virtual delivery saved an estimated $1,200 per participant in travel costs while maintaining clinic coverage. However, infrastructure limitations caused uneven access - rural participants completed 23% fewer live webinars than urban peers ( p The high satisfaction rates can be attributed to several factors, including using a structured Learning Management System (LMS), which facilitated asynchronous learning through multimedia content, interactive modules, and discussion forums. The inclusion of live webinars further enhanced engagement by providing opportunities for real-time interaction with subject matter experts. The program’s success stemmed from three key design elements: (1) modular LMS structure accommodating varied schedules (2), expert-led webinars applying knowledge to clinical cases, and (3) peer discussion forums. However, lower gains in vulvar cancer (+ 5.3%, p 12 21 The evaluation of Level 2 demonstrated a statistically significant improvement in participants’ knowledge scores from pretest to posttest ( p Using case-based scenarios and multiple-choice questions (MCQs) in the assessments ensured the evaluation captured foundational knowledge and its application in clinical practice [ 21 14 The success of this virtual CPD program has several implications for the design and implementation of future initiatives in gynecological oncology and other specialized medical fields. First, the findings highlight the importance of tailoring course content to the target audience’s specific needs [ 22 23 24 25 Limitations While this study provides valuable insights, it is not without limitations. The evaluation was confined to Levels 1 and 2 of the Kirkpatrick Model, which focuses on immediate outcomes (reaction and learning). Long-term impacts on behavior (Level 3) and results (Level 4) were not assessed, limiting the ability to conclude the program’s influence on clinical practice and patient outcomes. Additionally, Future studies should integrate multi-level frameworks like Moore et al.’s CME model to assess broader impacts on clinical practice and patient outcomes in LMIC contexts. Moreover, the reliance on self-reported data for Level 1 may introduce response bias, and the virtual nature of the course limited the ability to observe or verify the practical application of learning in clinical settings. Future studies should incorporate longitudinal follow-up to assess the sustained impact of virtual CPD programs on professional practice and patient care. Conclusion This study provides a scalable model for assessing short-term CPD outcomes (Kirkpatrick Levels 1–2) in LLMICs, featuring: (1) Moodle LMS adaptation (2), culturally responsive assessments, and (3) cost tracking (averaging $15/participant). Future work must address Levels 3–4 through clinical partnerships. This study contributes to the growing body of evidence on the effectiveness of virtual CPD programs in specialized medical fields such as gynecological oncology. The high levels of participant satisfaction and significant improvements in knowledge acquisition demonstrate the potential of virtual learning platforms to overcome barriers to access and participation, particularly in resource-constrained settings. By employing a structured evaluation framework, this study provides a model for assessing the impact of CPD programs. It highlights the importance of continuous improvement to meet the evolving needs of healthcare professionals. Future research should explore the long-term effects of virtual CPD on clinical practice and patient outcomes, as well as the potential for scaling such programs to other medical specialties and contexts. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We sincerely appreciate the Department of Obstetrics and Gynecology at Shahid Beheshti University of Medical Sciences, the School of Medical Education and Learning Technologies, and all faculty members who contributed to delivering this program. Our gratitude also extends to the IT officer and the Learning Management System administrator of the School of Medical Education and Learning Technologies, as well as all individuals involved in organizing and overseeing the course. Artificial intelligence utilization for article writing The authors would like to clarify that while English is not their first language, they took extra care to improve the language and coherence of their manuscript. We utilized tools such as Grammarly to correct grammatical errors and enhance the clarity of our writing. Declaration of consent for image publication I, Dr. Somaye Sohrabi, hereby confirm that I have obtained the necessary consent for the publication of any images containing identifiable human faces in this manuscript. All ethical considerations have been addressed, and the individuals depicted have granted their permission for the use of their images in this publication. Authors’ contributions All authors contributed to the commencement of the study and coordination, participated in data collection, and drafted the manuscript. S. S., H. M., and M. K. participated in data collection and analysis. S.A., M. A. & M. K. participated in the supervision of the research and analysis of data. S.S and M.K. participated in the drafting of the manuscript. All authors read and approved the final version. Funding None. Data availability The datasets used and/or analyzed during the current study are available from the corresponding author upon reasonable request. Declarations Ethics approval and consent to participate The study protocol was reviewed and approved by the Ethics Committee of Shahid Beheshti University of Medical Sciences (IR.SBMU.SME.REC.1403.088). All procedures performed in this study were in accordance with the ethical standards of the institutional research committee and with the 1964 Helsinki Declaration and its later amendments or comparable ethical standards. Informed consent was obtained from all participants. Consent for publication Written informed consent for publication was obtained from the individual depicted in Fig. 1. The consent form included permission for the use of their image in this manuscript and any related publications. Competing interests The authors declare no competing interests. References 1. Cox JL Simpson MD Cultural humility: a proposed model for a continuing professional development program Pharmacy 2020 10.3390/pharmacy8040214 PMC7712005 33202754 Cox JL, Simpson MD. Cultural humility: a proposed model for a continuing professional development program. Pharmacy. 2020. 10.3390/pharmacy8040214. 10.3390/pharmacy8040214 PMC7712005 33202754 2. Merry L Castiglione SA Rouleau G Létourneau D Larue C Deschênes M-F Continuing professional development (CPD) system development, implementation, evaluation and sustainability for healthcare professionals in low- and lower-middle-income countries: a rapid scoping review BMC Med Educ 2023 23 1 498 10.1186/s12909-023-04427-6 37415150 PMC10324177 Merry L, Castiglione SA, Rouleau G, Létourneau D, Larue C, Deschênes M-F, et al. Continuing professional development (CPD) system development, implementation, evaluation and sustainability for healthcare professionals in low- and lower-middle-income countries: a rapid scoping review. BMC Med Educ. 2023;23(1):498. 37415150 10.1186/s12909-023-04427-6 PMC10324177 3. Sherman LT, Chappell KB. Global perspective on continuing professional development. The Asia pacific scholar. 2018;3(2):1. 4. Jeyakumar T Karsan I Williams B Fried J Kane G Ambata-Villanueva S Paving the way forward for evidence-based continuing professional development J Contin Educ Health Prof 2024 44 1 53 7 10.1097/CEH.0000000000000500 37079386 Jeyakumar T, Karsan I, Williams B, Fried J, Kane G, Ambata-Villanueva S, et al. Paving the way forward for evidence-based continuing professional development. J Contin Educ Health Prof. 2024;44(1):53–7. 37079386 10.1097/CEH.0000000000000500 5. Sargeant J Wong BM Campbell CM CPD of the future: a partnership between quality improvement and competency-based education Med Educ 2018 52 1 125 35 10.1111/medu.13407 28984354 Sargeant J, Wong BM, Campbell CM. CPD of the future: a partnership between quality improvement and competency-based education. Med Educ. 2018;52(1):125–35. 28984354 10.1111/medu.13407 6. Owen JA Skelton JB Maine LL Advancing the adoption of continuing professional development (CPD) in the United States Pharmacy (Basel) 2020 10.3390/pharmacy8030157 PMC7557374 32877997 Owen JA, Skelton JB, Maine LL. Advancing the adoption of continuing professional development (CPD) in the United States. Pharmacy (Basel). 2020. 10.3390/pharmacy8030157. 10.3390/pharmacy8030157 PMC7557374 32877997 7. Baloyi OB Jarvis MA Continuing professional development status in the World Health Organisation, Afro-region member states Int J Afr Nurs Sci 2020 13 100258 33101975 10.1016/j.ijans.2020.100258 PMC7567664 Baloyi OB, Jarvis MA. Continuing professional development status in the World Health Organisation, Afro-region member states. Int J Afr Nurs Sci. 2020;13:100258. 33101975 10.1016/j.ijans.2020.100258 PMC7567664 8. Mack HG Golnik KC Murray N Filipe HP Models for implementing continuing professional development programs in low-resource countries MedEdPublish 2017 10.15694/mep.2017.000018 PMC10885220 38406456 Mack HG, Golnik KC, Murray N, Filipe HP. Models for implementing continuing professional development programs in low-resource countries. MedEdPublish. 2017. 10.15694/mep.2017.000018. 10.15694/mep.2017.000018 PMC10885220 38406456 9. Soklaridis S Shier R Zaheer R Scully M Williams B Daniel SJ The genie is out of the bottle: a qualitative study on the impact of COVID-19 on continuing professional development BMC Med Educ 2024 24 1 631 10.1186/s12909-024-05498-9 38844926 PMC11155036 Soklaridis S, Shier R, Zaheer R, Scully M, Williams B, Daniel SJ, et al. The genie is out of the bottle: a qualitative study on the impact of COVID-19 on continuing professional development. BMC Med Educ. 2024;24(1):631. 38844926 10.1186/s12909-024-05498-9 PMC11155036 10. Felker BL Towle CB Wick IK McKee M Designing and implementing telebehavioral health training to support rapid and enduring transition to virtual care in the COVID era J Technol Behav Sci 2023 8 3 225 33 10.1007/s41347-022-00286-y PMC9747532 36530382 Felker BL, Towle CB, Wick IK, McKee M. Designing and implementing telebehavioral health training to support rapid and enduring transition to virtual care in the COVID era. J Technol Behav Sci. 2023;8(3):225–33. 10.1007/s41347-022-00286-y PMC9747532 36530382 11. Hassani K McElroy T Coop M Pellegrin J Wu WL Janke RD Johnson LK Rapid implementation and evaluation of virtual health training in a subspecialty hospital in British Columbia, in response to the COVID-19 pandemic Front Pediatr 2021 9 638070 10.3389/fped.2021.638070 34095023 PMC8171666 Hassani K, McElroy T, Coop M, Pellegrin J, Wu WL, Janke RD, et al. Rapid implementation and evaluation of virtual health training in a subspecialty hospital in British Columbia, in response to the COVID-19 pandemic. Front Pediatr. 2021;9:638070. 34095023 10.3389/fped.2021.638070 PMC8171666 12. Curran V Glynn R Whitton C Hollett A An approach to the design and development of an accredited continuing professional development e-learning module on virtual care JMIR Med Educ 2024 10 e52906 10.2196/52906 39119741 PMC11327639 Curran V, Glynn R, Whitton C, Hollett A. An approach to the design and development of an accredited continuing professional development e-learning module on virtual care. JMIR Med Educ. 2024;10:e52906. 39119741 10.2196/52906 PMC11327639 13. Guillaume D Troncoso E Duroseau B Bluestone J Fullerton J Mobile-social learning for continuing professional development in low-and middle-income countries: integrative review JMIR Med Educ 2022 8 2 e32614 10.2196/32614 35671080 PMC9214614 Guillaume D, Troncoso E, Duroseau B, Bluestone J, Fullerton J. Mobile-social learning for continuing professional development in low-and middle-income countries: integrative review. JMIR Med Educ. 2022;8(2):e32614. 35671080 10.2196/32614 PMC9214614 14. Kojuri J Amini M Karimian Z Dehghani MR Saber M Bazrafcan L Needs assessment and evaluation of a short course to improve faculties teaching skills at a former world health organization regional teacher training center J Adv Med Educ Prof 2015 3 1 1 8 25587548 PMC4291502 Kojuri J, Amini M, Karimian Z, Dehghani MR, Saber M, Bazrafcan L, et al. Needs assessment and evaluation of a short course to improve faculties teaching skills at a former world health organization regional teacher training center. J Adv Med Educ Prof. 2015;3(1):1–8. 25587548 PMC4291502 15. Calleja P Wilkes S Spencer M Woodbridge S Telehealth use in rural and remote health practitioner education: an integrative review Rural Remote Health 2022 22 1 1 13 10.22605/RRH6467 35038387 Calleja P, Wilkes S, Spencer M, Woodbridge S. Telehealth use in rural and remote health practitioner education: an integrative review. Rural Remote Health. 2022;22(1):1–13. 10.22605/RRH6467 35038387 16. Kirkpatrick D Kirkpatrick J Evaluating training programs: The four levels 2006 Berrett-Koehler Kirkpatrick D, Kirkpatrick J. Evaluating training programs: The four levels. Berrett-Koehler; 2006. 17. Moore DE Jr. Green JS Gallis HA Achieving desired results and improved outcomes: integrating planning and assessment throughout learning activities J Contin Educ Health Prof 2009 29 1 1 15 10.1002/chp.20001 19288562 Moore DE Jr., Green JS, Gallis HA. Achieving desired results and improved outcomes: integrating planning and assessment throughout learning activities. J Contin Educ Health Prof. 2009;29(1):1–15. 19288562 10.1002/chp.20001 18. Hasani H Bahrami M Malekpour A Dehghani M Allahyary E Amini M Evaluation of teaching methods in mass CPCR training in different groups of the society, an observational study Medicine (Baltimore) 2015 94 21 e859 10.1097/MD.0000000000000859 26020392 PMC4616420 Hasani H, Bahrami M, Malekpour A, Dehghani M, Allahyary E, Amini M, et al. Evaluation of teaching methods in mass CPCR training in different groups of the society, an observational study. Medicine (Baltimore). 2015;94(21):e859. 26020392 10.1097/MD.0000000000000859 PMC4616420 19. Jones C Fraser J Randall S The evaluation of a home-based paediatric nursing service: concept and design development using the Kirkpatrick model J Res Nurs 2018 23 6 492 501 10.1177/1744987118786019 34394464 PMC7932399 Jones C, Fraser J, Randall S. The evaluation of a home-based paediatric nursing service: concept and design development using the Kirkpatrick model. J Res Nurs. 2018;23(6):492–501. 34394464 10.1177/1744987118786019 PMC7932399 20. Peiris-John R Selak V Robb G Kool B Wells S Sadler L Wise MR The state of quality improvement teaching in medical schools: a systematic review J Surg Educ 2020 77 4 889 904 10.1016/j.jsurg.2020.01.003 32057742 Peiris-John R, Selak V, Robb G, Kool B, Wells S, Sadler L, et al. The state of quality improvement teaching in medical schools: a systematic review. J Surg Educ. 2020;77(4):889–904. 32057742 10.1016/j.jsurg.2020.01.003 21. Al-Kubaisi KA Elnour AA Sadeq A Factors influencing pharmacists’ participation in continuing education activities in the united Arab emirates: insights and implications from a cross-sectional study J Pharm Policy Pract 2023 16 1 112 10.1186/s40545-023-00623-3 37784207 PMC10546650 Al-Kubaisi KA, Elnour AA, Sadeq A. Factors influencing pharmacists’ participation in continuing education activities in the united Arab emirates: insights and implications from a cross-sectional study. J Pharm Policy Pract. 2023;16(1):112. 37784207 10.1186/s40545-023-00623-3 PMC10546650 22. Lorenz S Dessai S Forster PM Paavola J Tailoring the visual communication of climate projections for local adaptation practitioners in Germany and the UK Philos Trans A Math Phys Eng Sci 2015 10.1098/rsta.2014.0457 PMC4608031 26460109 Lorenz S, Dessai S, Forster PM, Paavola J. Tailoring the visual communication of climate projections for local adaptation practitioners in Germany and the UK. Philos Trans A Math Phys Eng Sci. 2015. 10.1098/rsta.2014.0457. 10.1098/rsta.2014.0457 PMC4608031 26460109 23. Nisselle A Janinski M Martyn M McClaren B Kaunein N Barlow-Stewart K Ensuring best practice in genomics education and evaluation: reporting item standards for education and its evaluation in genomics (RISE2 Genomics) Genet Med 2021 23 7 1356 65 10.1038/s41436-021-01140-x 33824503 Nisselle A, Janinski M, Martyn M, McClaren B, Kaunein N, Barlow-Stewart K, et al. Ensuring best practice in genomics education and evaluation: reporting item standards for education and its evaluation in genomics (RISE2 Genomics). Genet Med. 2021;23(7):1356–65. 33824503 10.1038/s41436-021-01140-x 24. Seymour A Borggren M Baker R Escape the monotony: gamification enhances nursing education J Emerg Nurs 2023 49 6 805 10 10.1016/j.jen.2023.06.004 37422743 Seymour A, Borggren M, Baker R. Escape the monotony: gamification enhances nursing education. J Emerg Nurs. 2023;49(6):805–10. 37422743 10.1016/j.jen.2023.06.004 25. Ebn Ahmady A Barker M Fahim M Dragonetti R Selby P Evaluation of web-based continuing professional development courses: aggregate mixed-methods model JMIR Med Educ 2017 3 2 e19 10.2196/mededu.7480 29054834 PMC5670310 Ebn Ahmady A, Barker M, Fahim M, Dragonetti R, Selby P. Evaluation of web-based continuing professional development courses: aggregate mixed-methods model. JMIR Med Educ. 2017;3(2):e19. 29054834 10.2196/mededu.7480 PMC5670310 ",
  "metadata": {
    "Title of this paper": "Evaluation of web-based continuing professional development courses: aggregate mixed-methods model",
    "Journal it was published in:": "BMC Medical Education",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12492832/"
  }
}