{
  "title": "Paper_28",
  "abstract": "pmc Commun Chem Commun Chem 4343 commschem Communications Chemistry 2399-3669 Nature Publishing Group PMC12494992 PMC12494992.1 12494992 12494992 41044357 10.1038/s42004-025-01685-x 1685 1 Article A dual fluorescent-Raman bioorthogonal probe for specific biosynthetic labeling of intracellular gangliosides http://orcid.org/0000-0002-4271-8171 Mukherjee Mana Mohan 1 http://orcid.org/0000-0002-0350-6491 Watson Matthew D. 2 Biesbrock Devin 1 Abramowitz Lara K. 1 http://orcid.org/0000-0002-1172-6793 Drake Steven K. 3 http://orcid.org/0000-0003-0506-8349 Lee Jennifer C. 2 http://orcid.org/0000-0002-3154-9878 Hanover John A. johnh@bdg8.niddk.nih.gov 1 1 https://ror.org/01cwqze88 grid.94365.3d 0000 0001 2297 5165 Laboratory of Cell and Molecular Biology, NIDDK, NIH, 2 https://ror.org/01cwqze88 grid.94365.3d 0000 0001 2297 5165 Laboratory of Protein Conformation and Dynamics, NHLBI, NIH, 3 https://ror.org/01cwqze88 grid.94365.3d 0000 0001 2297 5165 Critical Care Medicine Department, Clinical Center, NIH, 3 10 2025 2025 8 478302 293 13 5 2025 1 9 2025 03 10 2025 05 10 2025 05 10 2025 © This is a U.S. Government work and not under copyright protection in the US; foreign copyright protection may apply 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Gangliosides are sialic acid-containing glycosphingolipids integral to the cell membrane, and they are particularly abundant in the nervous system. Aberrant ganglioside metabolism contributes to pathological conditions, including neurodegenerative diseases, lysosomal storage disorders, and cancer. A critical precursor for sialic acid biosynthesis is N 4  Gangliosides play crucial roles in the nervous system, with aberrant metabolism linked to diseases like cancer and neurodegeneration, but tools to visualize and detect gangliosides remain limited and non-specific. Here, the authors introduce MM-JH-2, a dual fluorescent and Raman-active probe, enabling specific ganglioside labeling and differentiation between cells that differ in ganglioside biosynthetic flux. Subject terms Glycobiology Chemical tools Glycolipids Fluorescent probes Imaging studies NIDDK Intramural Research Program Grant at the NIDDK, NIH (DK060101-18) https://doi.org/10.13039/100000050 U.S. Department of Health & Human Services | NIH | National Heart, Lung, and Blood Institute (NHLBI) ZIA HL006236-06 Lee Jennifer C. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Gangliosides are a class of sialic acid-containing glycosphingolipids that are particularly abundant in the brain and the nervous system. Gangliosides participate in the maintenance and mending of neuronal cells, memory formation, synaptic transmission, regeneration of neurons, axon stabilization, modulation of signal transduction pathways, and both intracellular and intranuclear calcium homeostasis 1 2 2 3 2 3 4 6 4 5 4 5 Since the first isolation of gangliosides from the human brain by Ernst Klenk in 1942 7 8 9 Here we demonstrate a bioorthogonal chemistry 10 12 12 13 14 15 The biosynthetic precursor of sialic acid is ManNAc, which can either be exogenously supplied or biosynthesized endogenously from N 16 O via 4 4 4 16 4 16 O The alkyne functionality in ManNAlk carries a distinctive vibrational spectroscopic signature. The C ≡ C stretching mode produces a Raman band around 2200 cm − 1 −1 17 18 17 19 20 17 17 We sought to leverage the advantages of both Raman and fluorescence imaging by synthesizing a dual fluorescent-Raman ManNAlk derivative for specific labeling of gangliosides in mammalian cells. Here, we report MM-JH-2 as a next-generation MCR where the large hydrophobic substitution on the glycan assembly directs the compound towards glycosphingolipids. The fluorescent property of the conjugated phenanthrene 21 Results Synthesis of MM-JH-2 and fluorescent labeling of cells Taking advantage of the utility of neutral ManNAc derivatives in metabolic oligosaccharide engineering (MOE), for the monitoring of sialic acid metabolism, we designed and synthesized a fluorescent ManNAc derivative, MM-JH-2, for one-step direct labeling of sialo glycoconjugates. MM-JH-2 incorporates a bioorthogonal Raman active alkyne moiety (C≡C), as well as a fluorescent conjugated phenanthrene. Briefly, D-mannosamine hydrochloride ( 1 2 22 3 4 4 1A + 37 41 10 13 1 13 1 2 1B Fig. 1 Synthesis and fluorescent labeling of cells with MM-JH-2. A B C N n P With this pure compound in hand, the labeling efficiency of MM-JH-2 was investigated in a variety of mammalian cell lines, including HeLa, SH-SY5Y, LA-N-2, HEK293T, NIH 3T3, AML 12 and LecCHO. Cells were treated with differing concentrations of MM-JH-2 for 72 hours (Fig. 1C 3 8 23 3 4 2 1C 1 5 8 2 MM-JH-2 specifically labels gangliosides Unnatural ManNAc derivatized sialic acid analogs can incorporate into lipids and proteins 24 29 11 9A 30 31 via 11 9B 9C 9D 9E We then sought to investigate the incorporation of MM-JH-2 in sialic acid-containing glycosphingolipids (gangliosides). Ganglioside biosynthesis begins with the synthesis of glucosylceramide (GlcCer) by glucosylceramide synthase (GCS), which in turn is converted to lactosylceramide (LacCer) (Fig. 2A 32 10 2 Fig. 2 MM-JH-2 enzymatically labels gangliosides. A B ST3GAL5 N n P C ST3GAL5 ST3GAL5 N P D The most abundant gangliosides formed in HeLa cells are descendants of GM3 gangliosides 33 34 ST3GAL5 2A 3 35 ST3GAL5 2C 19A 1 11B 19B 2B 1 11A 2 Formation of MM-JH-2 modified gangliosides was confirmed by MALDI-TOF-MS analysis in NIH 3T3 cells which produce predominantly GM3 gangliosides 36 12A-C 2D 12A–C 12D MM-JH-2 colocalizes with the acidic components of cells at steady state Having demonstrated metabolic incorporation of MM-JH-2 into gangliosides, the steady-state labeling pattern of the probe was examined in greater detail 37 38 3A 3B 1 3B 1 N 39 Fig. 3 MM-JH-2 localizes to lysosomes and late endosomes for catabolism. A N n B C N Given the targeting of MM-JH-2 to acidic compartments during steady-state labeling, the influence of lysosomal function on MM-JH-2 labeling was assessed. Bafilomycin A1 is an inhibitor of vacuolar H + 40 41 13A 2 13B A pulse-chase labeling study was performed to track MM-JH-2 localization and trafficking using the intrinsic fluorescence of the probe. For this, HeLa cells were treated with MM-JH-2 for 15 minutes before replacing the MM-JH-2-supplemented media with fresh MM-JH-2-free media. Cells were imaged by confocal microscopy at different times post-labeling (Fig. 3C 3C via 3 14 42 Endocytosis of MM-JH-2 was further examined using chloroquine as a chemical inhibitor of endocytosis. Chloroquine is a well-known inhibitor of clathrin-dependent endocytosis that exerts its effects by blocking the function of clathrin and clathrin-coated vesicles 43 14A 14B and C 14C 2 14C 14B 44 MM-JH-2 labeling was also compared with the previously reported terminal alkyne-ManNAc analog Pr 4 37 4 4 via N 4 15A 4 Using ganglioside-specific labeling by MM-JH-2 as a positive control, the detergent solubility of lipids was exploited to determine the fraction of Pr 4 15B 2 4 4 via 4 4 Raman spectral imaging correlates MM-JH-2 and lipid distributions In addition to the fluorescent properties of MM-JH-2, the alkyne moiety produces a unique vibrational signature in the quiet region of the cellular Raman spectrum, where there are no endogenous biomacromolecular vibrational modes 18 45 −1 −1 4A 4B 16 −1 46 16 Fig. 4 Raman spectral imaging of MM-JH-2 treated HeLa cells. A B −1 16 C D To map the spatial distribution of MM-JH-2 in treated HeLa cells, we first identified cells of interest for Raman spectral imaging by bright-field and widefield epifluorescence imaging using the intrinsic fluorescence of the probe (Fig. 4C −1 −1 −1 4D MM-JH-2 preferentially labels cells with elevated ganglioside flux To gain further insight into the incorporation of MM-JH-2, the probe was used to treat different cell types which are known to differ in the composition, distribution, and location of gangliosides 47 5A 1 5B 1 48 Fig. 5 MM-JH-2 selectively detects cancer cells over nonmalignant cells. A N n B N n P Considering this observation, several malignant and non-malignant cell lines were assessed for differential effects of MM-JH-2 treatment. SH-SY5Y, LA-N-2, HepG2, MCF7, MCF10A, HeLa, and female MEF cells were treated with increasing concentrations (0 to 500 μM) of MM-JH-2 for 72 hours, and cytotoxicity was then assessed using MTT assays (Supplementary Fig. 17A 2 50 50 50 4 MM-JH-2 differentially labels ex vivo-treated mouse T and B cells To assess the utility of MM-JH-2 as an endogenous labeling reagent, the probe was tested for differential staining of ex vivo immune cell types. T and B cells were selected for this experiment. These cells are derived from a common progenitor, have similar physical features such as size and shape, and both contribute to adaptive immunity 49 50 49 51 52 ST3GAL5 http://biogps.org/#goto=genereport&id=8869 B and T cells were collected from C57/BL6 mouse spleens 53 6A–E 1 + + + 6A–E 1 18 Fig. 6 MM-JH-2 preferentially labels B cells over T cells in a coculture of splenocytes. Histograms of splenocyte cell populations after A B C D N P Discussion This article describes the synthesis and characterization of MM-JH-2 as a dual Raman-fluorescent probe for the selective labeling of gangliosides. This probe has utility in the interrogation of ganglioside biosynthesis, and has potential as a diagnostic and therapeutic agent. The motivation behind design and synthesis of MM-JH-2 was: (i) the phenanthrene ring in conjugation with the alkyne produces a detectable fluorescence signal that was used to determine its subcellular distribution, (ii) the unequivocal Raman fingerprint of the non-terminal alkyne signal enables detection of the chemical environment of the probe along with simultaneous label-free imaging of cellular components, and (iii) hydrophobicity of the bulky phenanthrene ring directed the MOE towards lipids rather than proteins. Multiple cell lines separately treated with MM-JH-2 metabolized the bioorthogonal sugar and accumulated the fluorophore in a concentration-dependent manner. MM-JH-2 fluorescence disappeared upon treatment with the lipid-dissolving detergent Triton X-100, but survived the β-hydroxy sterol-acting reagent saponin, indicating that MM-JH-2 does not label sialic acid-containing glycoproteins, but rather glycolipids, i.e., gangliosides. Blue fluorescence of the whole and TLC-analyzed lipid extracts from HeLa cells treated with MM-JH-2 further confirmed that the probe acts as a lipid labeling probe. In-gel fluorescence scanning analysis of HeLa cell lysates treated with MM-JH-2 showed no detectable protein labeling under UV illumination. Raman spectral imaging was used to demonstrate localization of the probe in the lipid-rich cytoplasm. The value of the alkyne functional group is apparent when comparing of the clearly detectable C ≡ C stretching band of MM-JH-2 in cells to other characteristic vibrational features of the probe, which, though detectable, overlap considerably with vibrational bands of endogenous biomolecules (Supplementary Fig. 16 Within 15 minutes of treatment, time-dependent labeling experiments showed MM-JH-2 fluorescence in structures consistent with the known biosynthetic pathway of gangliosides. The probe showed transport to the PM, with a very short residence time at the PM, before being rapidly endocytosed to late endosome and lysosome-like acidic organelles. MM-JH-2 fluorescence intensity was directly correlated with the acidity and, hence the degradation capacity of those organelles. Blocking acidification of these structures prevented degradation of the probe and led to an accumulation of the probe in late endosomes/lysosomes. Genetic perturbation of ganglioside biosynthesis via ST3GAL5 MM-JH-2, a selective probe for monitoring ganglioside biosynthesis Cancer cells known to have high ganglioside content, including HeLa, MCF7, LA-N-2 and SH-SY 5Y, were strongly labeled at very low concentrations (10 μM) of MM-JH-2, whereas nonmalignant MCF10A cells had nearly inconspicuous levels of MM-JH-2 incorporation under the same conditions. Treatment with MM-JH-2 specifically detected gangliosides and selectively killed cancer cells in a concentration-dependent manner. We hypothesize that this cancer-cell-specific cytotoxicity can be attributed to the abnormally elevated ganglioside expression levels that are a hallmark of cancer cells. MM-JH-2 was also useful as a probe for differentiating biosynthetic flux in components of the circulating immune system. Utilizing the differences in lipid concentration between lymphocytic B and T cells, MM-JH-2 treatment was able to differentiate B220 + + + Within the cell, synthesis of gangliosides begins in the ER, with elongation of the glycan moiety occurring in the Golgi apparatus by sequential addition of different carbohydrate molecules to the existing LacCer acceptor molecule. The probe we have developed would be expected to be incorporated in the Golgi complex, followed by transport to the PM via 42 1 42 via 42 54 To prove that the large hydrophobic phenanthrene substitution preferentially directed the unnatural monosaccharide towards lipids, PFA-fixed and Triton X-100-permeabilized HeLa cells were imaged and compared with PFA-fixed and saponin-permeabilized cells. The non-ionic detergent Triton X-100 interacts with unfixable lipids and amphipathic membranes, dissolving the glycosphingolipids 55 30 Functional group modifications on the N-acetyl group of the ManNAc molecule are well tolerated by the sialic acid biosynthetic pathway, resulting in the formation of their corresponding CMP-sialic acid derivatives 37 56 56 56 56 57 58 Our interpretation of our current results is that the hydrophobic nature of the bulky phenanthrene ring directs the MOE probe preferentially toward lipid targets rather than proteins. The lipid species that could act as acceptors are the ceramide-anchored gangliosides. Moreover, the steric bulk of the CMP-phenanthrene-9-SiaAlk derivative appears to restrict its recognition to the sialylmotifs L and S of ST3GAL5 ST3GAL5 MM-JH-2 as a tool for the pathophysiological role of gangliosides Because tools to specifically examine gangliosides have long been lacking, much remains unknown regarding the biosynthesis of gangliosides and how changes in ganglioside content contribute to diseases like cancer. Gangliosides appear to behave as a double-edged sword in cancer, as they have been determined to be either pro- or anti-cancerous depending on the affected cell or tissue of interest. Gangliosides play an anti-tumoral role by inhibiting cell proliferation in gliomas, epidermoid carcinoma, neuroblastoma (NB), and astrocytoma, but they promote neuronal differentiation in PC12, and breast cancer cell lines 4T1 and 67NR, leading to enhanced tumorigenesis 59 ST3GAL5 2 60 61 Materials and methods Reagents All chemicals, reagents, and general lab supplies were purchased from Thermo Fisher Scientific or Sigma-Aldrich unless otherwise noted. Primary antibodies used include those for the following epitopes (catalog number): Mouse anti GAPDH (Abcam ab8245), Rabbit anti GAPDH (Abcam, ab18078), Rabbit anti ST3GAL5 (Novus Biologicals, NBP2-20492), Rabbit anti LAMP1 (Cell Signaling Technologies, 9091S), Allophycocyanin (APC)-CD4 + + + Inhibitors were purchased from different vendors with the following specifications: Bafilomycin-A1 (Cell Signaling, 54645), GenZ-123346 (Sigma-Aldrich, 5382850001), Chloroquine (Sigma-Aldrich, C6628). Primary antibodies were used at a 1:1000 dilution in Odyssey PBS blocking buffer with 0.1% Tween 20 (PBSBBTw) for immunoblotting and at a 1:100 dilution in 0.1% BSA solution in PBS for immunofluorescence. Secondary antibodies included Odyssey IRDye 680 CW goat anti-mouse (Li-COR, 926-68070), IRDye 800 CW goat anti-mouse (Li-COR, 926-32210), IRDye 680 CW goat anti-rabbit (Li-COR, 926-68071) and IRDye 800 CW goat anti-rabbit (Li-COR, 926-32211), and they were used at a 1:10,000 dilution in Odyssey PBSBBTw for immunoblotting. AlexaFluor 568 goat anti-rabbit (Invitrogen, A11011) was used at a 1:500 dilution in 0.1% BSA solution in PBS for immunofluorescence. General methods for chemical synthesis Unless otherwise specified, all reagents and solvents were purchased from Thermo Fisher Scientific or Sigma-Aldrich Chemical Company and were used as supplied. Reactions were monitored by thin-layer chromatography (TLC) on silica gel 60 glass slides. Spots were visualized by charring with H 2 4 4 Chemical analysis instruments NMR spectra were measured at 25 °C for solutions in CDCl 3 1 13 1 1 1 13 3 Synthesis 2-Deoxy-2- N O 4 4 4-Pentynoic acid (341 mg, 3.48 mmol) was added to a stirring solution of D-mannosamine hydrochloride ( 1 f N 2 + 11 17 6 To a solution of 2 3 3 2 2 f f 3 3 + 25 25 6 3 v v f f 3 2 4 4β) 1 3 H H H J H H J H J H J H J H J H H H H H H 2 H 2 H 2 H 2 H 2 J H 3 H 3 J H 3 13 3 -C C C- C C C C C C 2 C 2 3 C 2 3 C 2 3 C 2 2 C 3 2 C 3 2 C 3 2 C 3 m/z + 37 41 10 Continued elution resulted in a mixture of isomers (245 mg, 30%) followed by the pure major isomer ( 4α 1 3 H H H J H H J H J H J H J H J H J H J H J H H H 2 H 2 H 3 J 3 J 3 13 3 C 2 2 3 2 3 2 3 2 3 2 2 3 2 3 2 3 2 3 m/z 4 + 37 45 2 10 Fluorescence Spectroscopy Fluorescence excitation and emission spectra were acquired on a Horiba Jobin Yvon Fluorolog FL-3 fluorimeter using a 3 × 3 × 10 mm quartz cuvette. Excitation spectra were recorded from 300 to 430 nm (1 nm step, 0.5 mm slit width, 0.5 s integration time) at the emission maximum of 437 nm (0.5 mm slit width). Emission spectra were recorded from 385 to 600 nm (1 nm step, 0.5 mm slit width, 0.5 s integration time) using an excitation wavelength of 380 nm (0.5 mm slit width). Emission intensity was corrected for lamp power and detector sensitivity. Cell culture HeLa and mouse embryonic fibroblast (MEF) cells were cultured in DMEM (Gibco, 10567022) supplemented with 10% (for HeLa) or 15% (for MEFs) fetal bovine serum (FBS), penicillin (100 U/mL), and streptomycin (1 mg/mL). HeLa cells were kept at 37 °C in a humidified incubator under 5% carbon dioxide (CO 2 2 2 2 2 2 2 2 2 For imaging experiments, cells were seeded at a density of 10k cells per well in a 4-well chambered coverglass slide, 100k cells/well in a 6-well cell culture plate, 5k cells/well in a 96-well cell culture plate, and 500k cells in a 10 cm plate. Cells were allowed to settle overnight and then an appropriate amount of sugar was added for the desired final concentration from a 100 mM stock. Alternatively, the equivalent volume of DMSO or an equal concentration of 9-iodophenanthrene was added as a negative control. Cell Lysate collection After the appropriate time, cells were harvested by physical scraping, counted, and centrifuged at 10,000 × g g Mice The animals were maintained according to the animal protocol #K023-LCBB-22 approved by the NIDDK Animal Care and Use Committee, National Institutes of Health, USA and the C57Bl/6J-Mgea5 tm2Jah Confocal microscopy Cells were grown to sub-confluency and the treatment compound or negative control vehicle was added and incubated for the required amount of time. After the appropriate time, SYTO Deep Red Nuclear Dye (Thermo Fisher Scientific, S34900) or LysoTracker Deep Red (Thermo Fisher Scientific, L12492 o W11260 3A In-gel fluorescence scanning Following SDS-PAGE gel separation, the gel was washed with water 10 minutes for 3 times and scanned on a Molecular Imager FX (Bio-Rad) using a 405-nm laser for excitation. For Coomassie staining, the gel was incubated with Coomassie blue solution for 1 hours followed by destaining using the destaining solution (40% methanol, 10% glacial acetic acid) for overnight, followed by water for an additional 10 minutes for 3 times prior to scanning. The gel was scanned on a Molecular Imager FX (Bio-Rad) using a 405-nm laser for excitation. siRNA treatment experiment HeLa cells were seeded in a 4-well chambered coverglass slide (10k cells/well) or a 6-well cell culture plate (100k cells/well), and cultured in antibiotic-free complete growth media. For siRNA experiments: DMEM (Gibco, A14430 without phenol red) for HeLa, and DMEM/F-12 (Gibco, 11320033) for SH-SY5Y, respectively, were supplemented as above without antibiotics. The following siRNA reagents were purchased from Horizon, a PerkinElmer company: transfection reagent (T-2001, Dharmacon), ST3GAL5 2 2 2 2 Immunoblotting Pelleted cells were lysed in RIPA lysis buffer in an ice bath for 10 minutes with periodic shaking and then centrifuged at 4 °C at 10,000 × g MALDI Mass spectrometry Lipids were extracted from aliquots of 2 × 10 5 2 v v v g v v v v g Bafilomycin A1 treatment study HeLa cells were seeded in a 4-well chambered covered glass slide (10k cells/well) and cultured as described earlier. Different concentrations of Bafilomycin A1 (Cell Signaling, 54645) were added 12 hours after initial cell seeding and cells were incubated for another 6 hours under standard growth conditions. Cells were treated with 25 μM MM-JH-2 or an equal volume of DMSO as a negative control and incubated for an additional 72 hours. Cells were treated with either SYTO Deep Red Nucleic Acid stain or LysoTracker Deep Red and incubated for an additional 1 hour, followed by washing and fixation for confocal fluorescence imaging. Chloroquine treatment study HeLa cells were seeded in a 4-well chambered covered glass slide (10k cells/well) and cultured as described earlier. Chloroquine (Sigma-Aldrich, C6628), or DMSO as a negative control, was added 24 hours after initial cell seeding and cells were incubated in a 37 °C CO 2 2 2 eGFP-transfection experiment HeLa cells were plated in a 4-well chambered coverglass slide (10k cells/well) and cultured as described earlier. For eGFP transfection, DMEM (Gibco, 10567022) was supplemented with 10% fetal bovine serum (FBS) without antibiotics. Plasmids for expression of eGFP-caveolin (WT) as well as WT and K44A dynamin were a generous gift from Dr. Justin Taraska 62 2 2 CuAAC (click) reaction CuAAC reactions were performed using a Click-iT Cell Reaction kit (Thermo Fisher Scientific, C10269 4 Raman spectral imaging HeLa cells were seeded at a density of 10k cells/well in Nunc LabTek 4-well chambered #1.5 coverglass slides (ThermoFisher Scientific) and cultured as described earlier. Raman spectral imaging was conducted on a home-built Raman microscope 20 2 y- via Raman spectral analysis All Raman shifts were calibrated daily using a spectrum of neat cyclohexane fit to a linear combination of Gaussian-Lorentzian functions in the LabSpec6 software package (Horiba). The resulting peak positions were fit to literature values to generate a linear correction for the Raman shift values. Raman spectra of pure MM-JH-2 in DMSO were background-subtracted using a spectrum of DMSO collected with identical parameters in an adjacent well of the 18-well chambered coverslip (C18SB-1.5H, Cellvis) at the same z- Raman Map Image analysis Raman maps were generated from spectral data by integrating over spectral regions of interest in LabSpec6 (763–794 cm −1 −1 −1 Widefield Epifluorescence Image Analysis Widefield epifluorescence images of cells selected for Raman spectral imaging were background-subtracted using a Gaussian-blurred image with a radius of 25 pixels. A mask was generated by applying an automatic threshold to the background-subtracted image using the Li method and converting the resulting image to a mask. The final image was generated by applying the mask to the background-subtracted image. 3-(4,5-Dimethylthiazol-2-yl)-2,5-diphenyltetrazolium (MTT) Assay Cells were seeded in one half of each 96-well culture plate (5k cells/well) and cultured as described earlier, while the other half of the wells were left blank, containing only media with no cells. After 24 hours, the media was replaced with 200 μL of fresh media supplemented with MM-JH-2 (0, 5, 10, 25, 50, 100, 250 and 500 μM) and cells were incubated for an additional 72 hours. Thereafter, 20 μL of MTT labeling reagent (Sigma Aldrich, MTT Kit, 11465007001) was added to each of the wells and the plate was incubated in a 37 °C CO 2 2 The results represent the average of 6 replicates from 5 independent experiments performed over multiple days. The percentage of cell viability was calculated using the equation: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${{\\rm{Cell}}}\\; {{\\rm{viability}}}\\,( \\% )=({{\\rm{OD}}}\\; {{\\rm{of}}}\\; {{\\rm{treatment}}}/{{\\rm{OD}}}\\; {{\\rm{of}}}\\; {{\\rm{control}}})\\times 100$$\\end{document} Cell viability ( % ) = ( OD of treatment / OD of control ) × 100 Flow cytometry Spleens were harvested from mice, tissue was disrupted mechanically in complete RPMI media, passed through a 70 μm cell strainer, and washed with complete media. Cells were counted after ACK lysis using a Nexcelon Cellometer. 1.5 × 10 3 + + + Debris-free single live cells (identified by the absence of propidium iodide staining) were classified using cell physical parameters (FSC/SSC). Live single cells were further gated for B cells as B220+, CD4+ T cells as B220-CD8-CD4+ cells, CD8+ T cells as B220-CD4-CD8+ cells, whereas remaining cells containing heterogeneous cell populations as B220-CD4-CD8- live single cells. MM-JH-2 was excited by the UV laser line and detected using a 450/50 nm band pass filter. fluorescence minus one (FMO) control containing cell surface antibodies but not MM-JH-2 was used to define the presence of dye and as correlate for uptake of MM-JH-2. Data is presented as % positive subsets for the probe as well as mean fluorescence intensity. Statistics Prism (version 10.3.1 for MacOS, GraphPad) was used for all statistical analyses. A two-way ANOVA test was used to determine significance as indicated in the figure legends. P-values less than 0.05 were considered statistically significant. For confocal fluorescence images, co-localization analysis was performed in Fiji (ImageJ version 2.14.0/1.54 f) using the co-localization plugin. Pearson’s correlation coefficients between MM-JH-2 and WGA, ConA, LAMP1, Lysotracker, or eGFP were measured using two regions of interest (ROI) per image. Supplementary information  Transparent Peer Review file Supplementary Information Description of Additional Supplementary Files Supplementary Data 1 Supplementary Data 2 Hanover_Mukherjee nr-reporting-summary Publisher’s note Supplementary information The online version contains supplementary material available at 10.1038/s42004-025-01685-x. Acknowledgements MMM, DB, LA and JAH thank members of the Hanover lab for discussion, advice, and valuable suggestions. This work was conducted in the Laboratory of Cell and Molecular Biology (LCMB) section in NIDDK, National Institutes of Health, and supported by the NIDDK, National Institutes of Health. This research was supported by the Intramural Research Program of the National Institute of Diabetes and Digestive and Kidney Diseases (NIDDK) within the National Institutes of Health (NIH). The contributions of the NIH author(s) were made as part of their official duties as NIH federal employees, are in compliance with agency policy requirements, and are considered Works of the United States Government. However, the findings and conclusions presented in this paper are those of the author(s) and do not necessarily reflect the views of the NIH or the U.S. Department of Health and Human Services. MMM, DB, LA and JAH thanks intramural research program grant at the NIDDK, NIH ( DK060101-18 Author contributions J.A.H. conceived of the project, supervised the study, wrote and edited the manuscript, and arranged necessary funding. M.M.M. conceptualized, synthesized and characterized the chemical compounds, performed most of the experiments, analyzed data, wrote the manuscript and coordinated with other co-authors. D.B. performed confocal imaging, assisted in the synthesis of the chemical compound, analyzed data, wrote and edited the manuscript. L.K.A. harvested mouse spleen, oversaw the flowcytometry experiment, provided invaluable feedback on the project, wrote and edited the manuscript. M.D.W. and J.C.L. conducted Raman spectroscopy and wrote a section of the manuscript. S.K.D. performed MALDI mass spectrometric analysis of the ganglioside extracts and provided invaluable feedback on the MALDI mass analysis. Peer review Peer review information Communications Chemistry Funding Open access funding provided by the National Institutes of Health. Data availability The data that support the findings of this study are available within the paper and the Supplementary Information. Competing interests The authors declare no competing interests. The authors are actively looking for partners to commercialize MM-JH-2. References 1. Cutillo G Saariaho AH Meri S Physiology of gangliosides and the role of antiganglioside antibodies in human diseases Cell Mol. Immunol. 2020 17 313 322 10.1038/s41423-020-0388-9 32152553 PMC7109116 Cutillo, G., Saariaho, A. H. & Meri, S. Physiology of gangliosides and the role of antiganglioside antibodies in human diseases. Cell Mol. Immunol. 17 32152553 10.1038/s41423-020-0388-9 PMC7109116 2. Sipione S Monyror J Galleguillos D Steinberg N Kadam V Gangliosides in the brain: physiology, pathophysiology and therapeutic applications Front Neurosci. 2020 14 572965 10.3389/fnins.2020.572965 33117120 PMC7574889 Sipione, S., Monyror, J., Galleguillos, D., Steinberg, N. & Kadam, V. Gangliosides in the brain: physiology, pathophysiology and therapeutic applications. Front Neurosci. 14 33117120 10.3389/fnins.2020.572965 PMC7574889 3. Schnaar, R. L. Chapter Three - The Biology of Gangliosides. In Advances in Carbohydrate Chemistry and Biochemistry 10.1016/bs.accb.2018.09.002 30851743 4. Sasaki, N., Toyoda, M. & Ishiwata, T. Gangliosides as signaling regulators in cancer. Int. J. Mol. Sci 22 10.3390/ijms22105076 PMC8150402 34064863 5. Yu J Hung JT Wang SH Cheng JY Yu AL Targeting glycosphingolipids for cancer immunotherapy FEBS Lett. 2020 594 3602 3618 10.1002/1873-3468.13917 32860713 Yu, J., Hung, J. T., Wang, S. H., Cheng, J. Y. & Yu, A. L. Targeting glycosphingolipids for cancer immunotherapy. FEBS Lett. 594 32860713 10.1002/1873-3468.13917 6. Krengel U Bousquet PA Molecular recognition of gangliosides and their potential for cancer immunotherapies Front. Immunol. 2014 5 325 10.3389/fimmu.2014.00325 25101077 PMC4104838 Krengel, U. & Bousquet, P. A. Molecular recognition of gangliosides and their potential for cancer immunotherapies. Front. Immunol. 5 25101077 10.3389/fimmu.2014.00325 PMC4104838 7. Klenk E Langerbeins H Schumann EÜ ber die Verteilung der Neuraminsäure im Gehirn (Mit einer Mikromethode zur quantitativen Bestimmung der Substanz im Nervengewebe) Physiol. Chem. 1941 270 185 193 10.1515/bchm2.1941.270.3-4.185 Klenk, E., Langerbeins, H. & Schumann, E. Ü ber die Verteilung der Neuraminsäure im Gehirn (Mit einer Mikromethode zur quantitativen Bestimmung der Substanz im Nervengewebe). Physiol. Chem. 270 8. Yu RK Tsai Y-T Ariga T Yanagisawa M Structures, biosynthesis, and functions of Gangliosides-an overview J. Oleo Sci. 2011 60 537 544 10.5650/jos.60.537 21937853 PMC3684167 Yu, R. K., Tsai, Y.-T., Ariga, T. & Yanagisawa, M. Structures, biosynthesis, and functions of Gangliosides-an overview. J. Oleo Sci. 60 21937853 10.5650/jos.60.537 PMC3684167 9. Soliman C The terminal sialic acid of stage-specific embryonic antigen-4 has a crucial role in binding to a cancer-targeting antibody J. Biol. Chem. 2020 295 1009 1020 10.1016/S0021-9258(17)49911-X 31831622 PMC6983854 Soliman, C. et al. The terminal sialic acid of stage-specific embryonic antigen-4 has a crucial role in binding to a cancer-targeting antibody. J. Biol. Chem. 295 31831622 10.1074/jbc.RA119.011518 PMC6983854 10. Mukherjee, M. M. et al. Selective bioorthogonal probe for N-glycan hybrid structures. Nat. Chem. Biol. 21 10.1038/s41589-024-01756-5 PMC12288097 39468349 11. Mukherjee MM Tools and tactics to define specificity of metabolic chemical reporters Front. Mol. Biosci. 2023 10 1286690 10.3389/fmolb.2023.1286690 38143802 PMC10740162 Mukherjee, M. M. et al. Tools and tactics to define specificity of metabolic chemical reporters. Front. Mol. Biosci. 10 38143802 10.3389/fmolb.2023.1286690 PMC10740162 12. Vocadlo DJ Hang HC Kim E-J Hanover JA Bertozzi CR A chemical approach for identifying O-GlcNAc-modified proteins in cells Proc. Natl. Acad. Sci. USA 2003 100 9116 10.1073/pnas.1632821100 12874386 PMC171382 Vocadlo, D. J., Hang, H. C., Kim, E.-J., Hanover, J. A. & Bertozzi, C. R. A chemical approach for identifying O-GlcNAc-modified proteins in cells. Proc. Natl. Acad. Sci. USA 100 12874386 10.1073/pnas.1632821100 PMC171382 13. Patterson DM Nazarova LA Prescher JA Finding the right (Bioorthogonal) chemistry ACS Chem. Biol. 2014 9 592 605 10.1021/cb400828a 24437719 Patterson, D. M., Nazarova, L. A. & Prescher, J. A. Finding the right (Bioorthogonal) chemistry. ACS Chem. Biol. 9 24437719 10.1021/cb400828a 14. Tian Y One-step enzymatic labeling reveals a critical role of O-GlcNAcylation in cell-cycle progression and DNA damage response Ang. Chem. Int. Ed. Engl. 2021 60 26128 26135 10.1002/anie.202110053 34590401 Tian, Y. et al. One-step enzymatic labeling reveals a critical role of O-GlcNAcylation in cell-cycle progression and DNA damage response. Ang. Chem. Int. Ed. Engl. 60 10.1002/anie.202110053 34590401 15. Tan HY Direct one-step fluorescent labeling of O-GlcNAc-modified proteins in live cells using metabolic intermediates J. Am. Chem. Soc. 2018 140 15300 15308 10.1021/jacs.8b08260 30296064 Tan, H. Y. et al. Direct one-step fluorescent labeling of O-GlcNAc-modified proteins in live cells using metabolic intermediates. J. Am. Chem. Soc. 140 30296064 10.1021/jacs.8b08260 16. Du J Metabolic glycoengineering: Sialic acid and beyond Glycobiology 2009 19 1382 1401 10.1093/glycob/cwp115 19675091 PMC2770326 Du, J. et al. Metabolic glycoengineering: Sialic acid and beyond. Glycobiology 19 19675091 10.1093/glycob/cwp115 PMC2770326 17. Bakthavatsalam S Dodo K Sodeoka M A decade of alkyne-tag Raman imaging (ATRI): applications in biological systems RSC Chem. Biol. 2021 2 1415 1429 10.1039/D1CB00116G 34704046 PMC8496067 Bakthavatsalam, S., Dodo, K. & Sodeoka, M. A decade of alkyne-tag Raman imaging (ATRI): applications in biological systems. RSC Chem. Biol. 2 34704046 10.1039/d1cb00116g PMC8496067 18. Lin L A bioorthogonal Raman reporter strategy for SERS detection of glycans on live cells Ang. Chem. Int. Ed. Engl. 2013 52 7266 7271 10.1002/anie.201301387 23703791 Lin, L. et al. A bioorthogonal Raman reporter strategy for SERS detection of glycans on live cells. Ang. Chem. Int. Ed. Engl. 52 10.1002/anie.201301387 23703791 19. Flynn JD Gimmen MY Dean DN Lacy SM Lee JC Terminal Alkynes as Raman Probes of alpha-Synuclein in solution and in cells Chembiochem 2020 21 1582 1586 10.1002/cbic.202000026 31960993 PMC7269816 Flynn, J. D., Gimmen, M. Y., Dean, D. N., Lacy, S. M. & Lee, J. C. Terminal Alkynes as Raman Probes of alpha-Synuclein in solution and in cells. Chembiochem 21 31960993 10.1002/cbic.202000026 PMC7269816 20. Watson MD Lee JC Genetically encoded Aryl Alkyne for Raman Spectral Imaging of Intracellular alpha-Synuclein Fibrils J. Mol. Biol. 2023 435 167716 10.1016/j.jmb.2022.167716 35792158 PMC9805477 Watson, M. D. & Lee, J. C. Genetically encoded Aryl Alkyne for Raman Spectral Imaging of Intracellular alpha-Synuclein Fibrils. J. Mol. Biol. 435 35792158 10.1016/j.jmb.2022.167716 PMC9805477 21. Sambursky S Wolfsohn G On the fluorescence and absorption spectra of anthracene and phenanthrene in solutions Trans. Faraday Soc. 1940 35 427 432 10.1039/tf9403500427 Sambursky, S. & Wolfsohn, G. On the fluorescence and absorption spectra of anthracene and phenanthrene in solutions. Trans. Faraday Soc. 35 22. Hsu TL Alkynyl sugar analogs for the labeling and visualization of glycoconjugates in cells Proc. Natl. Acad. Sci. USA 2007 104 2614 2619 10.1073/pnas.0611307104 17296930 PMC1815231 Hsu, T. L. et al. Alkynyl sugar analogs for the labeling and visualization of glycoconjugates in cells. Proc. Natl. Acad. Sci. USA 104 17296930 10.1073/pnas.0611307104 PMC1815231 23. Kim EJ Jones MB Rhee JK Sampathkumar SG Yarema KJ Establishment of N-acetylmannosamine (ManNAc) analogue-resistant cell lines as improved hosts for sialic acid engineering applications Biotechnol. Prog. 2004 20 1674 1682 10.1021/bp049841q 15575698 Kim, E. J., Jones, M. B., Rhee, J. K., Sampathkumar, S. G. & Yarema, K. J. Establishment of N-acetylmannosamine (ManNAc) analogue-resistant cell lines as improved hosts for sialic acid engineering applications. Biotechnol. Prog. 20 15575698 10.1021/bp049841q 24. Chefalo P Pan Y Nagy N Guo Z Harding CV Efficient metabolic engineering of GM3 on tumor cells by N-Phenylacetyl-d-mannosamine Biochemistry 2006 45 3733 3739 10.1021/bi052161r 16533056 PMC2531244 Chefalo, P., Pan, Y., Nagy, N., Guo, Z. & Harding, C. V. Efficient metabolic engineering of GM3 on tumor cells by N-Phenylacetyl-d-mannosamine. Biochemistry 45 16533056 10.1021/bi052161r PMC2531244 25. Collins BE Fralich TJ Itonori S Ichikawa Y Schnaar RL Conversion of cellular sialic acid expression from N-acetyl- to N-glycolylneuraminic acid using a synthetic precursor, N-glycolylmannosamine pentaacetate: inhibition of myelin-associated glycoprotein binding to neural cells Glycobiology 2000 10 11 20 10.1093/glycob/10.1.11 10570219 Collins, B. E., Fralich, T. J., Itonori, S., Ichikawa, Y. & Schnaar, R. L. Conversion of cellular sialic acid expression from N-acetyl- to N-glycolylneuraminic acid using a synthetic precursor, N-glycolylmannosamine pentaacetate: inhibition of myelin-associated glycoprotein binding to neural cells. Glycobiology 10 10570219 10.1093/glycob/10.1.11 26. Pan Y Chefalo P Nagy N Harding C Guo Z Synthesis and Immunological Properties of N-Modified GM3 Antigens as Therapeutic Cancer Vaccines J. Med. Chem. 2005 48 875 883 10.1021/jm0494422 15689172 PMC3180873 Pan, Y., Chefalo, P., Nagy, N., Harding, C. & Guo, Z. Synthesis and Immunological Properties of N-Modified GM3 Antigens as Therapeutic Cancer Vaccines. J. Med. Chem. 48 15689172 10.1021/jm0494422 PMC3180873 27. Zou W Bioengineering of surface GD3 Ganglioside for immunotargeting human melanoma cells* J. Biol. Chem. 2004 279 25390 25399 10.1074/jbc.M402787200 15047693 Zou, W. et al. Bioengineering of surface GD3 Ganglioside for immunotargeting human melanoma cells*. J. Biol. Chem. 279 15047693 10.1074/jbc.M402787200 28. Bussink AP N-Azidoacetylmannosamine-mediated chemical tagging of gangliosides J. Lipid Res. 2007 48 1417 1421 10.1194/jlr.C700006-JLR200 17392268 Bussink, A. P. et al. N-Azidoacetylmannosamine-mediated chemical tagging of gangliosides. J. Lipid Res. 48 17392268 10.1194/jlr.C700006-JLR200 29. Bond MR Whitman CM Kohler JJ Metabolically incorporated photocrosslinking sialic acid covalently captures a ganglioside–protein complex Mol. Biosyst. 2010 6 1796 1799 10.1039/c0mb00069h 20625600 PMC2953467 Bond, M. R., Whitman, C. M. & Kohler, J. J. Metabolically incorporated photocrosslinking sialic acid covalently captures a ganglioside–protein complex. Mol. Biosyst. 6 20625600 10.1039/c0mb00069h PMC2953467 30. Goldenthal KL Hedman K Chen JW August JT Willingham MC Postfixation detergent treatment for immunofluorescence suppresses localization of some integral membrane proteins J. Histochem. Cytochem. 1985 33 813 820 10.1177/33.8.3894499 3894499 Goldenthal, K. L., Hedman, K., Chen, J. W., August, J. T. & Willingham, M. C. Postfixation detergent treatment for immunofluorescence suppresses localization of some integral membrane proteins. J. Histochem. Cytochem. 33 3894499 10.1177/33.8.3894499 31. Schwarz A Futerman AH Determination of the localization of Gangliosides using anti-ganglioside antibodies: comparison of fixation methods J. Histochem. Cytochem. 1997 45 611 618 10.1177/002215549704500413 9111239 Schwarz, A. & Futerman, A. H. Determination of the localization of Gangliosides using anti-ganglioside antibodies: comparison of fixation methods. J. Histochem. Cytochem. 45 9111239 10.1177/002215549704500413 32. Natoli TA Inhibition of glucosylceramide accumulation results in effective blockade of polycystic kidney disease in mouse models Nat. Med. 2010 16 788 792 10.1038/nm.2171 20562878 PMC3660226 Natoli, T. A. et al. Inhibition of glucosylceramide accumulation results in effective blockade of polycystic kidney disease in mouse models. Nat. Med. 16 20562878 10.1038/nm.2171 PMC3660226 33. Yamaji T Nishikawa K Hanada K Transmembrane BAX Inhibitor Motif Containing (TMBIM) Family Proteins Perturbs a trans-Golgi Network Enzyme, Gb3 Synthase, and Reduces Gb3 Biosynthesis* J. Biol. Chem. 2010 285 35505 35518 10.1074/jbc.M110.154229 20837469 PMC2975175 Yamaji, T., Nishikawa, K. & Hanada, K. Transmembrane BAX Inhibitor Motif Containing (TMBIM) Family Proteins Perturbs a trans-Golgi Network Enzyme, Gb3 Synthase, and Reduces Gb3 Biosynthesis*. J. Biol. Chem. 285 20837469 10.1074/jbc.M110.154229 PMC2975175 34. Albrecht S Comprehensive profiling of Glycosphingolipid Glycans using a novel broad specificity Endoglycoceramidase in a high-throughput workflow Anal. Chem. 2016 88 4795 4802 10.1021/acs.analchem.6b00259 27033327 Albrecht, S. et al. Comprehensive profiling of Glycosphingolipid Glycans using a novel broad specificity Endoglycoceramidase in a high-throughput workflow. Anal. Chem. 88 27033327 10.1021/acs.analchem.6b00259 35. Schnaar, R. L., et al. Cold Spring Harbor Laboratory Press, Cold Spring Harbor (NY), (2022). 36. Matyas GR Aaronson SA Brady RO Fishman PH Alteration of glycolipids in ras-transfected NIH 3T3 cells Proc. Natl. Acad. Sci. USA 1987 84 6065 6068 10.1073/pnas.84.17.6065 3476926 PMC299008 Matyas, G. R., Aaronson, S. A., Brady, R. O. & Fishman, P. H. Alteration of glycolipids in ras-transfected NIH 3T3 cells. Proc. Natl. Acad. Sci. USA 84 3476926 10.1073/pnas.84.17.6065 PMC299008 37. Wratil PR Horstkorte R Reutter W Metabolic Glycoengineering with N-Acyl side chain modified Mannosamines Ang. Chem. Int. Ed. Engl. 2016 55 9482 9512 10.1002/anie.201601123 27435524 Wratil, P. R., Horstkorte, R. & Reutter, W. Metabolic Glycoengineering with N-Acyl side chain modified Mannosamines. Ang. Chem. Int. Ed. Engl. 55 10.1002/anie.201601123 27435524 38. Cheng B Xie R Dong L Chen X Metabolic remodeling of cell-surface sialic acids: principles, applications, and recent advances Chembiochem 2016 17 11 27 10.1002/cbic.201500344 26573222 Cheng, B., Xie, R., Dong, L. & Chen, X. Metabolic remodeling of cell-surface sialic acids: principles, applications, and recent advances. Chembiochem 17 26573222 10.1002/cbic.201500344 39. Schwarzmann G Labeled gangliosides: their synthesis and use in biological studies FEBS Lett. 2018 592 3992 4006 10.1002/1873-3468.13239 30188569 Schwarzmann, G. Labeled gangliosides: their synthesis and use in biological studies. FEBS Lett. 592 30188569 10.1002/1873-3468.13239 40. Xie Z Bafilomycin A1 inhibits autophagy and induces apoptosis in MG63 osteosarcoma cells Mol. Med Rep. 2014 10 1103 1107 10.3892/mmr.2014.2281 24890793 Xie, Z. et al. Bafilomycin A1 inhibits autophagy and induces apoptosis in MG63 osteosarcoma cells. Mol. Med Rep. 10 24890793 10.3892/mmr.2014.2281 41. Yamamoto A Bafilomycin A1 prevents maturation of autophagic vacuoles by inhibiting fusion between Autophagosomes and Lysosomes in Rat Hepatoma cell line, H-4-II-E cells Cell Struct. Funct. 1998 23 33 42 10.1247/csf.23.33 9639028 Yamamoto, A. et al. Bafilomycin A1 prevents maturation of autophagic vacuoles by inhibiting fusion between Autophagosomes and Lysosomes in Rat Hepatoma cell line, H-4-II-E cells. Cell Struct. Funct. 23 9639028 10.1247/csf.23.33 42. Tettamanti G Bassi R Viani P Riboni L Salvage pathways in glycosphingolipid metabolism Biochimie 2003 85 423 437 10.1016/S0300-9084(03)00047-6 12770781 Tettamanti, G., Bassi, R., Viani, P. & Riboni, L. Salvage pathways in glycosphingolipid metabolism. Biochimie 85 12770781 10.1016/s0300-9084(03)00047-6 43. Wang LH Rothberg KG Anderson RG Mis-assembly of clathrin lattices on endosomes reveals a regulatory switch for coated pit formation J. Cell Biol. 1993 123 1107 1117 10.1083/jcb.123.5.1107 8245121 PMC2119875 Wang, L. H., Rothberg, K. G. & Anderson, R. G. Mis-assembly of clathrin lattices on endosomes reveals a regulatory switch for coated pit formation. J. Cell Biol. 123 8245121 10.1083/jcb.123.5.1107 PMC2119875 44. Daniotti JL Iglesias-Bartolomé R Metabolic pathways and intracellular trafficking of gangliosides IUBMB Life 2011 63 513 520 10.1002/iub.477 21698755 Daniotti, J. L. & Iglesias-Bartolomé, R. Metabolic pathways and intracellular trafficking of gangliosides. IUBMB Life 63 21698755 10.1002/iub.477 45. Hong S Live-cell stimulated Raman scattering imaging of alkyne-tagged biomolecules Ang. Chem. Int. Ed. Engl. 2014 53 5827 5831 10.1002/anie.201400328 24753329 Hong, S. et al. Live-cell stimulated Raman scattering imaging of alkyne-tagged biomolecules. Ang. Chem. Int. Ed. Engl. 53 10.1002/anie.201400328 24753329 46. Ramos S Lee JC Water bend-libration as a cellular Raman imaging probe of hydration Proc. Natl. Acad. Sci. USA 2023 120 e2313133120 10.1073/pnas.2313133120 37812697 PMC10589711 Ramos, S. & Lee, J. C. Water bend-libration as a cellular Raman imaging probe of hydration. Proc. Natl. Acad. Sci. USA 120 37812697 10.1073/pnas.2313133120 PMC10589711 47. Sandhoff R Sandhoff K Emerging concepts of ganglioside metabolism FEBS Lett. 2018 592 3835 3864 10.1002/1873-3468.13114 29802621 Sandhoff, R. & Sandhoff, K. Emerging concepts of ganglioside metabolism. FEBS Lett. 592 29802621 10.1002/1873-3468.13114 48. Abramczyk H The role of lipid droplets and adipocytes in cancer. Raman imaging of cell cultures: MCF10A, MCF7, and MDA-MB-231 compared to adipocytes in cancerous human breast tissue Analyst 2015 140 2224 2235 10.1039/C4AN01875C 25730442 Abramczyk, H. et al. The role of lipid droplets and adipocytes in cancer. Raman imaging of cell cultures: MCF10A, MCF7, and MDA-MB-231 compared to adipocytes in cancerous human breast tissue. Analyst 140 25730442 10.1039/c4an01875c 49. Bianconi E An estimation of the number of cells in the human body Ann. Hum. Biol. 2013 40 463 471 10.3109/03014460.2013.807878 23829164 Bianconi, E. et al. An estimation of the number of cells in the human body. Ann. Hum. Biol. 40 23829164 10.3109/03014460.2013.807878 50. Calloni R Cordero EA Henriques JA Bonatto D Reviewing and updating the major molecular markers for stem cells Stem Cells Dev. 2013 22 1455 1476 10.1089/scd.2012.0637 23336433 PMC3629778 Calloni, R., Cordero, E. A., Henriques, J. A. & Bonatto, D. Reviewing and updating the major molecular markers for stem cells. Stem Cells Dev. 22 23336433 10.1089/scd.2012.0637 PMC3629778 51. Kwon HY Lipid-oriented live-cell distinction of B and T Lymphocytes J. Am. Chem. Soc. 2021 143 5836 5844 10.1021/jacs.1c00944 33834782 Kwon, H. Y. et al. Lipid-oriented live-cell distinction of B and T Lymphocytes. J. Am. Chem. Soc. 143 33834782 10.1021/jacs.1c00944 52. Gao M A SLC35C2 transporter-targeting fluorescent probe for the selective detection of B Lymphocytes Identified by SLC-CRISPRi and unbiased fluorescence library screening Ang. Chem. Int. Ed. Engl. 2022 61 e202202095 10.1002/anie.202202095 35789526 Gao, M. et al. A SLC35C2 transporter-targeting fluorescent probe for the selective detection of B Lymphocytes Identified by SLC-CRISPRi and unbiased fluorescence library screening. Ang. Chem. Int. Ed. Engl. 61 10.1002/anie.202202095 35789526 53. Hsueh RC Purification and characterization of mouse Splenic B Lymphocytes AFCS Res. Rep. 2002 1 1 11 Hsueh, R. C. et al. Purification and characterization of mouse Splenic B Lymphocytes. AFCS Res. Rep. 1 54. Tettamanti G Ganglioside/glycosphingolipid turnover: New concepts Glycoconj. J. 2003 20 301 317 10.1023/B:GLYC.0000033627.02765.cc 15229395 Tettamanti, G. Ganglioside/glycosphingolipid turnover: New concepts. Glycoconj. J. 20 55. Lichtenberg D Robson RJ Dennis EA Solubilization of phospholipids by detergents structural and kinetic aspects Biochim. Biophys. Acta (BBA) - Rev. Biomembr. 1983 737 285 304 10.1016/0304-4157(83)90004-7 6342675 Lichtenberg, D., Robson, R. J. & Dennis, E. A. Solubilization of phospholipids by detergents structural and kinetic aspects. Biochim. Biophys. Acta (BBA) - Rev. Biomembr. 737 10.1016/0304-4157(83)90004-7 6342675 56. Mikolajczyk, K., Czerwinski, M. & Kaczmarek, R. Glycoproteins, Glycolipids, or both: why do Glycosyltransferases recognize different acceptors? Chembiochem 26 10.1002/cbic.202500212 40326968 57. Rao FV Structural insight into mammalian sialyltransferases Nat. Struct. Mol. Biol. 2009 16 1186 1188 10.1038/nsmb.1685 19820709 Rao, F. V. et al. Structural insight into mammalian sialyltransferases. Nat. Struct. Mol. Biol. 16 19820709 10.1038/nsmb.1685 58. Kuhn B The structure of human alpha-2,6-sialyltransferase reveals the binding mode of complex glycans Acta Crystallogr D. Biol. Crystallogr 2013 69 1826 1838 10.1107/S0907444913015412 23999306 Kuhn, B. et al. The structure of human alpha-2,6-sialyltransferase reveals the binding mode of complex glycans. Acta Crystallogr D. Biol. Crystallogr 69 23999306 10.1107/S0907444913015412 59. Cavdarli, S., Groux-Degroote, S. & Delannoy, P. Gangliosides: The double-edge sword of neuro-ectodermal derived tumors. Biomolecules 9 10.3390/biom9080311 PMC6723632 31357634 60. Breiden, B. & Sandhoff, K. Mechanism of secondary Ganglioside and lipid accumulation in lysosomal disease. Int. J. Mol. Sci 21 10.3390/ijms21072566 PMC7178057 32272755 61. Ledeen RW Wu G The multi-tasked life of GM1 ganglioside, a true factotum of nature Trends Biochem. Sci. 2015 40 407 418 10.1016/j.tibs.2015.04.005 26024958 Ledeen, R. W. & Wu, G. The multi-tasked life of GM1 ganglioside, a true factotum of nature. Trends Biochem. Sci. 40 26024958 10.1016/j.tibs.2015.04.005 62. Kong L Cryo-EM of the dynamin polymer assembled on lipid membrane Nature 2018 560 258 262 10.1038/s41586-018-0378-6 30069048 PMC6121775 Kong, L. et al. Cryo-EM of the dynamin polymer assembled on lipid membrane. Nature 560 30069048 10.1038/s41586-018-0378-6 PMC6121775 ",
  "metadata": {
    "Title of this paper": "Cryo-EM of the dynamin polymer assembled on lipid membrane",
    "Journal it was published in:": "Communications Chemistry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494992/"
  }
}