{
  "title": "Paper_565",
  "abstract": "pmc Vet Sci Vet Sci 3286 vetsciences vetsci Veterinary Sciences 2306-7381 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474333 PMC12474333.1 12474333 12474333 41012781 10.3390/vetsci12090856 vetsci-12-00856 1 Article A Survey of the Reproductive Lesions in Captive Female Non-Human Primates in Italy https://orcid.org/0000-0002-0458-4512 Galietta Valentina Conceptualization Methodology Validation Investigation Data curation Writing – original draft Writing – review & editing Visualization 1 * https://orcid.org/0000-0002-0524-9054 Cocumelli Cristiano Conceptualization Methodology Validation Data curation Writing – review & editing 1 Parmigiani Raffaella Validation Formal analysis 1 Bovi Emanuela Validation Formal analysis 1 Palmerini Tiziana Validation Formal analysis 1 Acri Chiara Validation Visualization 1 Di Cerbo Pilar Validation Resources Supervision 2 Aloisi Marco Validation Resources Supervision 3 https://orcid.org/0000-0002-2299-5542 Cersini Antonella Methodology Validation Formal analysis 4 https://orcid.org/0000-0001-7427-2760 Eleni Claudia Conceptualization Validation Investigation Resources Data curation Writing – review & editing Supervision 1 Zhang Xiaodong Academic Editor 1 2 3 4 * valentina.galietta@izslt.it 04 9 2025 9 2025 12 9 497675 856 30 7 2025 29 8 2025 01 9 2025 04 09 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Non-human primates (NHPs) are considered important models for studying reproductive diseases due to their similarity to humans. However, data on spontaneous reproductive lesions in zoo-housed NHPs are limited. This study presents a retrospective analysis of female reproductive pathologies in NHPs from Italian zoos, with the aim of improving knowledge of their occurrence and comparative significance. The results highlight the importance of systematic post-mortem surveillance in enhancing reproductive health monitoring in captive populations. Abstract Non-human primates (NHPs) are considered important models for the study of reproductive diseases, due to their anatomical and physiological similarities to humans. However, studies on spontaneous lesions of the reproductive system in NHPs housed in zoos remain limited compared to those in laboratory animals. In this study, we report a retrospective analysis of female reproductive pathologies in 103 necropsied non-human primates from Italian zoos between 2007 and 2024. Only adult, intact, non-pregnant females with macroscopically visible reproductive lesions were included. Histopathological examination revealed reproductive tract lesions in 15 individuals (14.6%), including both non-neoplastic (cystic endometrial hyperplasia, adenomyosis, endometriosis) and neoplastic (leiomyomas, cervical and ovarian adenocarcinomas, and metastatic tumors) conditions. Leiomyoma was the most common tumor, particularly in the genus Macaca adenocarcinoma endometriosis leiomyoma Macaca non-human primates reproduction Italian Ministry of Health RC IZSLT 04/2021 This research was funded by the Italian Ministry of Health, grant number RC IZSLT 04/2021. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Non-human primates (NHPs) are valuable models for studying human reproductive physiology and pathology owing to their anatomical and physiological similarities to humans [ 1 2 2 3 4 5 6 2 7 8 4 9 10 11 4 Macaca mulatta 12 Pan troglodytes Gorilla gorilla 13 14 15 16 6 8 13 15 17 18 3 19 2. Materials and Methods The cases were retrieved from the database of National Reference Center for Non-Human Primate Diseases “ M. Aleandri ” When subjects presented multiple concurrent lesions within the same organ, the pathological processes were described separately to ensure a clear comparative analysis of the different conditions observed. During the necropsy procedure, tissue samples from the reproductive tract lesions were collected, fixed in 10% neutral buffered formalin, routinely processed for paraffin embedding, and stained with hematoxylin and eosin. In selected cases, Masson’s trichrome staining was performed to confirm the muscle origin of the lesion. Immunohistochemistry was performed in the case of histiocytic sarcoma in Pongo pygmaeus All slides were independently evaluated by two experienced veterinary pathologists, with specific expertise in comparative pathology of non-human primates. A formalin-fixed, paraffin-embedded sample of the cervical adenocarcinoma was also used for polymerase chain reaction (PCR) to detect papillomavirus, using two CODHEOP PCR protocols specifically for a highly conserved 478 bp region of the L1 gene [ 20 21 3. Results Reproductive tract macroscopic lesions were identified in 15 out of 103 animals (14.6%) ( Table 1 3.1. Uterine Pathologies The uterine pathologies were classified into non-neoplastic and neoplastic lesions. The non-neoplastic lesions included cystic endometrial hyperplasia, adenomyosis, and endometriosis, while the neoplastic lesions comprised leiomyomas, cervical carcinoma, and metastatic tumors originating from primary neoplasms in other organs. 3.1.1. Non-Neoplastic Uterine Lesions Cystic endometrial hyperplasia was diagnosed in three individuals: Macaca assamensis Ma Hylobates lar HI Sapajus apella Sa Figure 1 Adenomyosis was identified in three individuals: Macaca assamensis Ma Hylobates lar (HI Sapajus apella Sa Figure 1 A severe case of endometriosis was identified in a Macaca nemestrina Mn Figure 1 3.1.2. Neoplastic Uterine Lesions Leiomyoma was the most frequently diagnosed uterine neoplasm, identified in multiple seven individuals, including Macaca fascicularis Mfa1 Macaca mulatta Mm Macaca fuscata Mf1, Mf2, Mf3 Pan troglodytes Pt Pongo pygmaeus Pp1 Figure 1 Figure 1 Among the neoplastic pathologies, one case of cervical adenocarcinoma was identified in a Sapajus apella Sa 2 Additionally, in the uterine wall of a Lemur catta Lc Figure 1 3.2. Ovarian Pathologies 3.2.1. Non-Neoplastic Ovarian Lesions Multiple follicular cysts were identified in two Pongo pygmaeus Pp 1 Pp 2 Figure 2 Figure 2 3.2.2. Neoplastic Ovarian Lesions A case of ovarian adenocarcinoma was identified in a Macaca fascicularis Mfa2 Figure 2 2 Figure 2 Consistent with findings in the uterus, metastatic lesions from a primary tumor located outside the reproductive tract were also identified in the ovary. In a Pongo pygmaeus Pp 1 Figure 2 22 4. Discussion The results confirm that reproductive tract disorders can occur in captive NHPs, even in the absence of clinical signs during life, as also highlighted in previous surveys on zoo-housed and research colony animals [ 2 8 Non-neoplastic uterine lesions were identified in 6 of 15 subjects (40%), with cystic endometrial hyperplasia and adenomyosis representing the predominant findings. The occurrence of non-neoplastic lesions (40% of our cases) is consistent with previous observations in NHPs kept in controlled environments, where cystic endometrial hyperplasia and adenomyosis were among the most frequently detected uterine conditions [ 4 8 2 11 23 This discrepancy may not reflect a true variability in the distribution of the disease among the population under study, but can rather be attributable to limitations in the macroscopic detection of the pathology. Early or moderate-stage endometriosis can be difficult to identify during necropsy [ 24 24 From a clinical perspective, endometriosis in women is associated with severe pain, infertility, and significant morbidity [ 25 26 8 The presence of adenomyosis in multiple individuals, in association with advanced age, is consistent with findings reported in great apes by Chaffee et al. (2016) [ 4 27 24 28 Although uterine neoplasms do not represent one of the main categories of tumors affecting NHPs, they can have a significant clinical impact, particularly in aged individuals [ 3 4 3 4 15 4 3 Macaca 15 29 11 18 30 In human medicine, leiomyomas are among the most common tumors of the female genital tract, with an estimated prevalence exceeding 70% in women at the onset of menopause [ 31 32 Additionally, attention should be drawn to the presence of malignant tumors, particularly metastatic forms, which despite representing a smaller proportion of cases, carry significant clinical and prognostic implications. In the present study, two cases of primary carcinoma (a cervical adenocarcinoma and an ovarian adenocarcinoma) and two cases of metastases to the genital tract from extra genital neoplasms were diagnosed, accounting for 26,7% of the individuals (4/15). The cervical adenocarcinoma, identified in a Sapajus apella (Sa) 24 3 24 Macaca mulatta 32 33 34 Even more noteworthy and rare is the case of ovarian carcinoma with multiple metastases documented in a female Macaca fascicularis (Mfa1 35 36 An aspect of particular interest is the presence of multiple and concurrent lesions within individual animals, suggesting a multifactorial pathogenesis potentially influenced by hormonal, inflammatory, and/or immune-related factors. In this context, the lack of previous clinical data limits a comprehensive etiopathogenetic interpretation but highlights a significant information gap that could be addressed through systematic collection and management of clinical data in zoological facilities. Although the total number of individuals per species is limited, data analysis allows for some preliminary observations regarding interspecific differences in the distribution of reproductive pathologies. Non-neoplastic uterine lesions (such as endometrial hyperplasia and adenomyosis) and benign uterine tumors (particularly leiomyomas) were more frequently observed in Old World NHPs and, in particular, in the genus Macaca, supporting findings in the scientific literature, where these species are considered among the most predisposed to reproductive tract disorders due to their menstrual physiology, which closely resembles that of humans. In great apes (such as Pongo pygmaeus Pan troglodytes Sapajus apella Lemur catta 16 16 Another important aspect is the advanced age of the subjects, with a mean age exceeding 20 years. This finding, consistent with the literature [ 4 16 37 From a conservation medicine and One Health perspective, our results underscore the importance of systematic post-mortem surveillance, even for non-infectious diseases. Understanding the pathological dynamics of the reproductive tract can improve the health management of captive populations, optimize breeding programs, and provide valuable comparative models for human medicine. As highlighted by Moresco et al. (2021) [ 2 5. Conclusions This study documented a variety of spontaneous lesions affecting the female reproductive tract in different species of captive NHPs, highlighting the frequent occurrence of both non-neoplastic and neoplastic conditions that may negatively affect general health and reproductive capacity. The findings are in line with previous international studies and strengthen the importance of systematic surveillance of reproductive health in these animals. These data not only contribute to the understanding of comparative reproductive pathology but also serve as a valuable tool to guide clinical, reproductive, and conservation management strategies in zoological centers. In conclusion, some limitations should be acknowledged, including the retrospective nature of the study, the absence of systematic clinical information, and the relatively small number of cases per species. These aspects may have contributed to an underestimation of certain lesions or to a limited assessment of interspecific differences. Nevertheless, the present work provides novel data on reproductive pathologies in zoo-housed NHPs and highlights the importance of systematic post-mortem surveillance. Future studies integrating clinical, imaging, and pathological data in a multicenter setting will help to further clarify the prevalence and biological significance of these disorders. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, V.G., C.C. and C.E.; methodology V.G., C.C., A.C. and C.E.; validation, all authors; formal analysis, R.P., E.B., T.P. and A.C.; investigation, V.G. and C.E.; resources, P.D.C., M.A. and C.E.; data curation, V.G., C.C. and C.E.; writing—original draft preparation, V.G.; writing—review and editing, V.G., C.C. and C.E.; visualization, V.G. and C.A.; supervision, P.D.C., M.A. and C.E. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The data utilized in this study were collected from captive female non-human primates in Italy. These specimens were obtained during diagnostic procedures performed post-mortem. According to the ethical guidelines of the Istituto Zooprofilattico Sperimentale del Lazio e della Toscana (IZSLT), ethical approval is not required for studies involving collection of biological material from animals that have died from unrelated causes. Therefore, no additional ethical review was necessary for this research. Informed Consent Statement Specimens were obtained animals that had died from unrelated causes. Owner informed consent is not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. Bauer C. The baboon ( Papio Contraception 2015 92 120 123 10.1016/j.contraception.2015.06.007 26072741 PMC4506850 2. Moresco A. Feltrer-Rambaud Y. Wolfman D. Agnew D.W. Reproductive one health in primates Am. J. Primatol. 2022 84 e23325 10.1002/ajp.23325 34516669 3. Cline J.M. Wood C.E. Vidal J.D. Tarara R.P. Buse E. Weinbauer G.F. de Rijk E.P. van Esch E. Selected Background Findings and Interpretation of Common Lesions in the Female Reproductive System in Macaques Toxicol. Pathol. 2008 36 142s 163s 10.1177/0192623308327117 21475639 PMC3070965 4. Chaffee B.K. Beck A.P. Owston M.A. Kumar S. Baze W.B. Magden E.R. Dick E.J. Jr. Lammey M. Abee C.R. Spontaneous Reproductive Tract Lesions in Aged Captive Chimpanzees Vet. Pathol. 2016 53 425 435 10.1177/0300985815620654 26823448 PMC5607477 5. Didier E.S. MacLean A.G. Mohan M. Didier P.J. Lackner A.A. Kuroda M.J. Contributions of Nonhuman Primates to Research on Aging Vet. Pathol. 2016 53 277 290 10.1177/0300985815622974 26869153 PMC5027759 6. Kim Y.Y. KwaK J. Kang B.C. Ku S.Y. Non-human primate: The new frontier model of female reproductive engineering Front. Bioeng. Biotechnol. 2025 13 1536750 10.3389/fbioe.2025.1536750 40242357 PMC12001037 7. Abbott D.H. Rogers J. Dumesic D.A. Levine J.E. Naturally Occurring and Experimentally Induced Rhesus Macaque Models for Polycystic Ovary Syndrome: Translational Gateways to Clinical Application Med. Sci. 2019 7 107 10.3390/medsci7120107 PMC6950671 31783681 8. Kirejczyk S. Pinelli C. Gonzalez O. Kumar S. Dick E. Jr. Gumber S. Urogenital Lesions in Nonhuman Primates at 2 National Primate Research Centers Vet. Pathol. 2021 58 147 160 10.1177/0300985820971752 33208023 PMC7903448 9. Green S.L. Tolwani R.J. Waggie K.S. Otto G.M. Endometriosis and a paraovarian cyst in a rhesus macaque Vet. Radiol. Ultrasound 1999 40 271 274 10.1111/j.1740-8261.1999.tb00361.x 10519307 10. Wilkinson M. Walters S. Smith T. Wilkinson A. Reproductive abnormalities in aged female Macaca fascicularis J. Med. Primatol. 2008 37 (Suppl. S1) 88 93 10.1111/j.1600-0684.2007.00268.x 18269535 11. Gall A.J. Olds J.E. Wunschmann A. Selmic L.E. Rasmussen J. Lewis A.D. Lesions of the female reproductive tract in Japanese macaque ( Macaca fuscata J. Zoo Wildl. Med. 2018 49 79 85 10.1638/2016-0171R1.1 29517447 PMC6039225 12. Kondova I. Braskamp G. Heidt P.J. Collignon W. Haaksma T. de Groot N. Otting N. Doxiadis G. Westmoreland S.V. Vallender E.J. Spontaneous endometriosis in rhesus macaques: Evidence for a genetic association with specific Mamu-A1 alleles Primate Biol. 2017 4 117 125 10.5194/pb-4-117-2017 32110699 PMC7041536 13. Brown S.L. Anderson D.C. Dick E.J. Jr. Guardado-Mendoza R. Garcia A.P. Hubbard G.B. Neoplasia in the chimpanzee ( Pan J. Med. Primatol. 2009 38 137 144 10.1111/j.1600-0684.2008.00321.x 19367738 PMC2893876 14. Stringer E.M. De Voe R.S. Valea F. Toma S. Mulvaney G. Pruitt A. Troan B. Loomis M.R. Medical and surgical management of reproductive neoplasia in two western lowland gorillas ( Gorilla gorilla gorilla J. Med. Primatol. 2010 39 328 335 10.1111/j.1600-0684.2010.00414.x 20412375 15. Videan E.N. Satterfield W.C. Buchl S. Lammey M.L. Diagnosis and prevalence of uterine leiomyomata in female chimpanzees ( Pan troglodytes Am. J. Primatol. 2011 73 665 670 10.1002/ajp.20947 21442632 PMC3100414 16. Pereira A.H.B. Rocha F.C. Carvalho M.P.S. Barbosa B.E.P. Balthazar D.A. Moreira S.B. Pissinatti A. Ubiali D.G. Female Reproductive System Neoplasms in Neotropical Primates J. Med. Primatol. 2025 54 e70027 10.1111/jmp.70027 40563146 PMC12198431 17. Barrier B.F. Allison J. Hubbard G.B. Dick E.J. Jr. Brasky K.M. Schust D.J. Spontaneous adenomyosis in the chimpanzee ( Pan troglodytes Hum. Reprod. 2007 22 1714 1717 10.1093/humrep/dem038 17452396 18. Hanley P.W. Barnhart K.F. Satterfield W.C. McArthur M.J. Buchl S.J. Baze W.B. Obstructive uropathy secondary to uterine leiomyoma in a chimpanzee ( Pan troglodytes Comp. Med. 2012 62 543 545 23561890 PMC3527761 19. DiGiacomo R.F. Gynecologic pathology in the rhesus monkey ( Macaca mulatta Vet. Pathol. 1977 14 539 546 10.1177/030098587701400601 412291 20. Forslund O. Antonsson A. Nordin P. Stenquist B. Göran Hansson B. A broad range of human papillomavirus types detected with a general PCR method suitable for analysis of cutaneous tumours and normal skin J. Gen. Virol. 1999 80 2437 2443 10.1099/0022-1317-80-9-2437 10501499 21. Nespeca G. Grest P. Rosenkrantz W.S. Ackermann M. Favrot C. Detection of novel papillomaviruslike sequences in paraffin-embedded specimens of invasive and in situ squamous cell carcinomas from cats Am. J. Vet. Res. 2006 67 2036 2041 10.2460/ajvr.67.12.2036 17144807 22. Galietta V. Fonti N. Cocumelli C. Raso C. Di Cerbo P. Parisi F. Bovi E. Parmigiani R. Pietrella G. Cersini A. Histiocytic Sarcoma in a Captive Hybrid Orangutan ( Pongo sp Animals 2024 14 852 10.3390/ani14060852 38539950 PMC10967491 23. Nishimoto-Kakiuchi A. Netsu S. Okabayashi S. Taniguchi K. Tanimura H. Kato A. Suzuki M. Sankai T. Konno R. Spontaneous endometriosis in cynomolgus monkeys as a clinically relevant experimental model Hum. Reprod. 2018 33 1228 1236 10.1093/humrep/dey095 29684118 PMC6012197 24. Cooper T.K. Gabrielson K.L. Spontaneous lesions in the reproductive tract and mammary gland of female non-human primates Birth Defects Res. B Dev. Reprod. Toxicol. 2007 80 149 170 10.1002/bdrb.20105 17342758 25. Saunder P.T.K. Horne A.W. Endometriosis: Etiology, pathobiology, and therapeutic prospects Cell 2021 184 2807 2824 10.1016/j.cell.2021.04.041 34048704 26. Crump J. Suker A. White L. Endometriosis: A review of recent evidence and guidelines Aust. J. Gen. Pract. 2024 53 11 18 10.31128/AJGP/04-23-6805 38316472 27. Schrager S. Yogendran L. Marquez C.M. Sadowski E.A. Adenomyosis: Diagnosis and Management Am. Fam. Physician 2022 105 33 38 35029928 28. Ami Y. Suzaki Y. Goto N. Endometriosis in cynomolgus monkeys retired from breeding J. Vet. Med. Sci. 1993 55 7 11 10.1292/jvms.55.7 8461429 29. Dolmans M.M. Petraglia F. Catherino W.H. Donnez J. Pathogenesis of uterine fibroids: Current understanding and future directions Fertil. Steril. 2024 122 6 11 10.1016/j.fertnstert.2024.02.048 38453042 30. Stewart E.A. Cookson C.L. Gandolfo R.A. Schulze-Rath R. Epidemiology of uterine fibroids: A systematic review BJOG Int. J. Obstet. Gynaecol. 2017 124 1501 1512 10.1111/1471-0528.14640 28296146 31. Dagur G. Suh Y. Warren K. Singh N. Fitzgerald J. Khan S.A. Urological complications of uterine leiomyoma: A review of literature Int. Urol. Nephrol. 2016 48 941 948 10.1007/s11255-016-1248-5 26922066 32. Giuliani E. As-Sanie S. Marsh E.E. Epidemiology and management of uterine fibroids Int. J. Gynaecol. Obstet. 2020 149 3 9 10.1002/ijgo.13102 31960950 33. Hertig A.T. MacKey J.J. Feeley G. Kampschmidt K. Dysplasia of the lower genital tract in the female monkey, Macaca fascicularis Am. J. Obstet. Gynecol. 1983 145 968 977 10.1016/0002-9378(83)90850-5 6837682 34. Wood C.E. Borgerink H. Register T.C. Scott L. Cline J.M. Cervical and vaginal epithelial neoplasms in cynomolgus monkeys Vet. Pathol. 2004 41 108 115 10.1354/vp.41-2-108 15017023 35. Deng K. Yang C. Tan Q. Song W. Lu M. Zhao W. Lou G. Li Z. Li K. Hou Y. Sites of distant metastases and overall survival in ovarian cancer: A study of 1481 patients Gynecol. Oncol. 2018 150 460 465 10.1016/j.ygyno.2018.06.022 30001833 36. Moore C.M. Hubbard G.B. Leland M.M. Dunn B.G. Best R.G. Spontaneous ovarian tumors in twelve baboons: A review of ovarian neoplasms in non-human primates J. Med. Primatol. 2003 32 48 56 10.1034/j.1600-0684.2003.00002.x 12733602 37. Lowenstine L.J. McManamon R. Terio K.A. Comparative Pathology of Aging Great Apes: Bonobos, Chimpanzees, Gorillas, and Orangutans Vet. Pathol. 2016 53 250 276 10.1177/0300985815612154 26721908 Figure 1 Uterine pathologies. ( A Ma B HI C Mn D Mf1 E Sa2: F Lc Figure 2 Ovarian pathologies. ( A Pp 1 B Pp C Mfa2: D Mfa2: E Mfa2: F Pp 1 vetsci-12-00856-t001_Table 1 Table 1 Spontaneous female reproductive lesions in NHPs. Category of NHP Family Common Name Scientific Name Code Age Uterus Ovary Old World NHP Cercopithecidae Assam macaque  Macaca assamensis  Ma 33 Cystic endometrial hyperplasia  Adenomyosis Cercopithecidae Cynomolgus macaque  Macaca fascicularis  Mfa 1 17 Leiomyoma  Cercopithecidae Cynomolgus macaque  Macaca fascicularis  Mfa 2 adult  Ovarian Adenocarcinoma with Cercopithecidae Japanese macaque  Macaca fuscata  Mfu 1 24 Leiomyoma  Cercopithecidae Japanese macaque  Macaca fuscata  Mfu 2 24 Leiomyoma  Cercopithecidae Japanese macaque  Macaca fuscata  Mfu 3 29 Leiomyoma  Cercopithecidae Rhesus macaque  Macaca mulatta  Mm 30 Leiomyoma  Cercopithecidae Pig-tailed macaque  Macaca nemestrina  Mn 20 Endometriosis  Adenomyosis  Hylobatidae Lar gibbon  Hylobates Iar  HI 31 Cystic endometrial hyperplasia  Adenomyosis  Hominidae Chimpanzee  Pan troglodytes  Pt 27 Leiomyoma  Hominidae Orangutan  Pongo pygmaeus  Pp 1 45 Leiomyoma Follicular cysts Metastatic histiocytic Hominidae Orangutan  Pongo pygmaeus  Pp 2 37  Follicular cysts New World NHP Cebidae Tufted capuchin  Sapajus apella  Sa1 19 Cystic endometrial hyperplasia  Cebidae Tufted capuchin  Sapajus apella  Sa2 27 Adenocarcinoma of the cervix  Prosimian Lemuridae Ring-tailed lemur  Lemur catta  Lc 18 Metastatic  ",
  "metadata": {
    "Title of this paper": "Comparative Pathology of Aging Great Apes: Bonobos, Chimpanzees, Gorillas, and Orangutans",
    "Journal it was published in:": "Veterinary Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474333/"
  }
}