{
  "title": "Paper_1081",
  "abstract": "pmc Drug Des Devel Ther Drug Des Devel Ther 958 dddt dddt Drug Design, Development and Therapy 1177-8881 Dove Press PMC12478209 PMC12478209.1 12478209 12478209 41030776 10.2147/DDDT.S516745 516745 1 Original Research Investigating the Mechanism of Jiawei Weijin Decoction in Treating Non-Small Cell Lung Cancer Using Network Pharmacology, Bioinformatics Analysis and Experimental Validation Xu et al Xu et al Xu Bo  1  2 * Yu Yihan  3 * Zhang Jixian  3 * http://orcid.org/0009-0001-0550-7009 Jiang Bo  4 Yan Le  4 Chen Saili  5 http://orcid.org/0009-0009-1273-2050 Hu Linling  4 Miao Qing  1 http://orcid.org/0009-0008-6800-9649 Qi Yu  4  6 1 Department of Pulmonary Medicine, Xiyuan Hospital, China Academy of Chinese Medical Sciences Beijing People’s Republic of China 2 Department of Postdoctoral Mobile Workstation, China Academy of Chinese Medical Sciences Beijing People’s Republic of China 3 Department of Pulmonary Medicine, Hubei Provincial Hospital of Integrated Chinese and Western Medicine Wuhan People’s Republic of China 4 College of Traditional Chinese Medicine, Hubei University of Chinese Medicine Wuhan People’s Republic of China 5 College of Clinical Medicine, Hubei University of Science and Technology Xianning People’s Republic of China 6 Hubei Shizhen Laboratory Wuhan People’s Republic of China Correspondence: Qing Miao, Department of Pulmonary Medicine, Xiyuan Hospital, China Academy of Chinese Medical Sciences Beijing People’s Republic of China Yu Qi, College of Traditional Chinese Medicine, Hubei University of Chinese Medicine Wuhan People’s Republic of China * These authors contributed equally to this work 25 9 2025 2025 19 478870 8711 8743 31 1 2025 19 9 2025 25 09 2025 30 09 2025 01 10 2025 © 2025 Xu et al. 2025 Xu et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Purpose Non-small cell lung cancer (NSCLC) is a leading cause of cancer-related mortality worldwide. While Qianjin Weijin Decoction is widely used in China for lung cancer treatment, Jiawei Qianjin Weijin Decoction (JWWJD), a modified version, has shown enhanced anti-metastatic effects. However, its active components and underlying mechanisms remain unclear. Methods The effect of JWWJD against NSCLC was evaluated in vitro and in vivo, and the mechanisms were identified in combination with transcriptomics. Network pharmacology and bioinformatics were used to construct an anti-NSCLC prognostic model with JWWJD. The correlation between the expression of the prognostic gene and clinicopathological features was evaluated. The main active components of JWWJD were identified by LC-MS/MS and its anticancer effect and mechanism were investigated in vitro and in vivo. Results JWWJD-containing serum significantly suppressed cell proliferation and migration, and induced apoptosis in NCI-A549 and NCI-H23 cells. Among different concentrations tested, 20% drug-containing serum showed the most potent inhibitory effect on NSCLC progression (all P P −6 P Conclusion Our study, integrating transcriptomics, bioinformatics, LC-MS/MS, and experimental validation, revealed that JWWJD alleviates NSCLC metastasis by directly targeting SPP1. JWWJD and its active compound curcumol show promise as alternative therapies for NSCLC patients. Keywords Jiawei Weijin decoction non-small cell lung cancer SPP1 curcumol metastasis program Mechanism of Yiqi Yangyin Anticancer Prescription Regulating the Immune Microenvironment of Non-small Cell lung Cancer Based on IL-6/JAK2/STAT3 Signaling Pathway We gratefully acknowledge the program Mechanism of Yiqi Yangyin Anticancer Prescription Regulating the Immune Microenvironment of Non-small Cell lung Cancer Based on IL-6/JAK2/STAT3 Signaling Pathway(ZY2023Z003), the program A multicenter, randomized, double-blind, placebo, parallel controlled study of Qingbu Weijian Decoction in the treatment of bronchiectasis (XYZX0201-13), the program A multicenter, randomized, double-blind, placebo-controlled study of invigorating spleen and clearing lung in treating bronchiectasis (spleen deficiency and lung heat syndrome)(CI2021A01101). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Lung cancer is one of the tumors with the highest incidence and mortality in the world, with an overall survival rate of approximately 17%, and the 5-year survival rate of distant metastatic tumors is only 5%. 1 2 3 4 Qianjin Weijin Decoction (QJWJD) is a classical TCM prescription originated from Prescriptions Worth a Thousand Gold for Emergencies Beiji Qianjin Yaofang Phragmites australis Coix lacryma-jobi L., Benincasa hispida Prunus persica 5 6 7 5 8 Prunella vulgaris Ophiopogon japonicus Prunus persica 9 Prunella vulgaris Ophiopogon japonicus Phragmites australis 9 Prunella vulgaris Ophiopogon japonicus 10 11 In this study, we present the first comprehensive investigation and validation of JWWJD and its active components through an integrated approach combining network pharmacology, transcriptomics-based bioinformatics analysis, and rigorous in vitro and in vivo experiments. Using LC-MS/MS technology, we identified curcumol as the key active ingredient in JWWJD that effectively targets SPP1, thereby inhibiting the proliferation, migration, and angiogenesis of NSCLC. These findings not only provide novel mechanistic insights into the anti-metastatic action of JWWJD but also highlight curcumol as a promising candidate for the development of targeted therapies against NSCLC. The detailed procedure of this study is shown in Figure 1 Figure 1 Flow chart of the study. * P < 0.05 P < P < Materials and Methods Materials Grades and Certification All chemicals and reagents used in this study were selected based on their quality grades and suitability for the intended experimental applications. Curcumol (Cat: IC0620; purity ≥ 98%), used for in vitro and in vivo experiments, was purchased from Solarbio (Beijing, China), and was confirmed to be of high purity suitable for pharmacological studies. Solvents and cell culture reagents were of analytical or cell culture grade, as appropriate for each experiment. Detailed information on other materials, including antibodies and assay kits, is provided in the respective method sections. Human Specimens and Ethical Statements Tumorous and adjacent lung tissues were collected from NSCLC patients underwent surgical resection and pathological confirmation in the Hubei Provincial Hospital of Integrated Chinese and Western Medicine. Tumor differentiation grade and clinical stage were classified according to the American Joint Committee on Cancer TNM Classification Declaration of Helsinki As our laboratory does not have its own animal facility to conduct animal experiments, we carried out the experiments at the animal research center of Shouzheng Pharma (Wuhan) Biotechnology Co., Ltd. This facility has an independent Institutional Animal Care and Use Committee (IACUC), which carried out the ethical review and oversight of all animal procedures. Animal studies were conducted in accordance with the ethical regulations approved by the Animal Welfare Ethics Review Committee of Shouzheng Pharma (Wuhan) Biotechnology Co., Ltd. (Approval No. 2024071601, Date of ethical approval: 14 July 2024, Wuhan, Hubei Province, China). All experimental procedures complied with the Laboratory animal — Guideline for ethical review of animal welfare (GB/T 35892–2018), as well as internationally recognized principles for the care and use of laboratory animals, including adherence to the to the Basel Declaration 12 Preparation and Extraction of Drug-Containing Serum The medicinal names have been checked with the plant list ( http://www.theplantlist.org/ Table 1 Table 1 Herbal Formula of JWWJD Latin Name of the Medicinal Material Material Chinese Name Dose (g) Curcumae Rhizoma Rootstalk E Zhu 20 Prunella vulgaris L. Herb Xia Ku Cao 10 Ophiopogon japonicus (Thunb.) Ker Gawl. Root tuber Mai Dong 10 Phragmites australis (Cav.) Trin. ex Steud. Rootstalk Lu Gen 15 Coix lacryma-jobi L. Seed Yi Yi Ren 10 Benincasa hispida (Thunb.) Cogn Seed Dong Gua Zi 10 Prunus persica (L.) Batsch Seed Tao Ren 10 Sprague Dawley rats (8 weeks old, weighing 300±20 g, n = 20) were purchased from Shulaibao (Wuhan) Biotechnology (Wuhan, Hubei Province, China). Animals were raised in a standard Specific Pathogen Free (SPF) animal feeding center (25°C, 12-h light/dark cycle, 55% humidity, n=3 rats of the same sex in each cage). Following one week of acclimatization, the rats were randomly divided into two groups (n = 10 per group): the JWWJD-treated group and the Control group. The JWWJD group were gavaged with 11.0 g raw drug/kg twice a day for 3 days, while the control group were gavaged with an equal volume of distilled water. On the 4th day, 1 h after the last gavage, all rats were anesthetized by intraperitoneal injection of 2% pentobarbital sodium (30 mg/kg). The rats were sacrificed by cervical dislocation after abdominal aorta blood was collected. The blood was incubated at room temperature for 1 h and then centrifuged at 1500 x g at 4°C for 15 min. The supernatant was extracted, inactivated at 56°C, filtered by 0.22-µM filters and stored at −80°C. Data Source and Processing The selection of gene expression profiles and data processing were based on publicly available datasets from the Gene Expression Omnibus (GEO) database ( http://www.ncbi.nlm.nih.gov/geo GSE101929 GSE31210 13 Missing values in the datasets were imputed using the K-Nearest Neighbors (KNN) algorithm implemented in the “impute” package (version 1.74.0), with k=10 neighbors selected through cross-validation to minimize imputation error. 14 15 For independent validation, two additional GEO datasets, GSE29013 GSE42127 Differential Expression Screening and Weighted Gene Co-Expression Network Analysis (WGCNA) The WGCNA package in R software was utilized for weighted gene co-expression network analysis between NSCLC and normal tissues. After filtering low-variance genes and performing log2 transformation and quantile normalization, outlier samples were removed based on hierarchical clustering. A scale-free network was constructed by selecting an appropriate soft-thresholding power β. The power β = 7 was chosen as the minimum value that achieved a scale-free topology fit index (R 2 A topological overlap matrix (TOM) was derived from the adjacency matrix, and modules were identified using average linkage hierarchical clustering with a dynamic tree cut method. Modules with eigengene correlation > 0.75 were merged to reduce redundancy. Module significance (MS), defined as the -log10( P Prediction of JWWJD Active Ingredients and Targets for Treatment of NSCLC Plus Construction of a Protein-Protein Interaction (PPI) Network The active ingredients and corresponding targets of JWWJD were retrieved from the TCMSP ( https://tcmspw.com/tcmsp.php http://bionet.ncpsb.org/batman-tcm/ https://www.uniprot.org/ P < 0.05 Only genes shared across all three datasets were defined as candidate core targets. These candidates were prioritized based on their biological relevance, node degree values from the protein–protein interaction (PPI) network, and existing literature linking them to cancer progression or drug response. The top-ranking targets were selected for subsequent functional enrichment and experimental validation. To explore interactions among these core targets, the overlapping genes were imported into the STRING database ( https://string-db.org/ Construction of a Prognostic Model of JWWJD for NSCLC Using Univariate Cox and LASSO Regression Analysis To develop a prognostic model reflecting the therapeutic effects of JWWJD in NSCLC, survival data including overall survival (OS) time and status were obtained from clinical information of NSCLC patients downloaded from the GEO database. These survival data were combined with the 25 intersected targets derived from JWWJD drug targets, DEGs, and WGCNA key module genes. Univariate Cox proportional hazards regression analysis was performed using the survival package in R to identify candidate genes associated with patient survival outcomes. Genes with P 16 A risk score formula was constructed based on the coefficients (β values) of the selected genes derived from the LASSO-Cox regression model. Each patient’s risk score was calculated according to the expression levels of these genes and their corresponding weights. Patients were stratified into high-risk and low-risk groups using the median risk score as the cutoff value. The predictive performance of the model was evaluated using Kaplan–Meier survival analysis and receiver operating characteristic (ROC) curve analysis. The area under the ROC curve (AUC) was calculated to assess the model’s discriminatory power for predicting patient survival. Principal component analysis (PCA) was also conducted to visualize the separation between high- and low-risk groups. Finally, a nomogram incorporating the risk score and clinicopathological features (eg, age, gender, TNM stage) was constructed using the rms package in R to predict individual survival probabilities. 17 Supplementary S1 Use of Multiple Databases to Evaluate the Expression and Role of Key Gene in NSCLC The differential expression of the prognostic gene SPP1 across various tumor types and adjacent normal tissues was analyzed using the TIMER2.0 database ( http://timer.comp-genomics.org/ Genes showing consistent upregulation or downregulation across multiple cancer types were selected for further analysis. For lung cancer-specific investigation, TCGA-LUAD (lung adenocarcinoma) and TCGA-LUSC (lung squamous cell carcinoma) datasets were downloaded from The Cancer Genome Atlas program ( https://portal.gdc.cancer.gov/ SPP1 expression and its correlation with metastasis-related genes (MMP2, MMP9) were analyzed using the GEPIA platform ( http://gepia.cancer-pku.cn/ P < 0.05 The CancerSEA database ( http://biocc.hrbmu.edu.cn/CancerSEA/ http://www.emtome.org Identification of Active and Blood-Entering Components of JWWJD JWWJD drug and JWWJD drug-containing serum were thawed at 4°C, followed by vortexing of the sample for 1 min, and evenly mixing. Next, 100µL sample was accurately transferred to a 2-mL centrifuge tube, and 400 µL methanol was then added, followed by vortexing for 1 min. Next, samples were centrifuged for 10 min at 13,780 x g and 4°C, and the supernatant was transferred to a new 2-mL centrifuge tube, concentrated and dried. Next, 150 µL 2-chloro-l-phenylalanine (4 ppm) solution prepared with 80% methanol water was added to redissolve the sample, and the supernatant was the filtered by a 0.22-µm membrane and transferred into the detection bottle for LC-MS detection. LC analysis was performed on a Vanquish UHPLC System (Thermo Fisher Scientific, Inc). Chromatography was carried out with an ACQUITY UPLC ® Raw data were firstly converted to mzXML by MSConvert in ProteoWizard software package (v3.0.8789) and processed using R XCMS (v3.12.0) for feature detection, retention time correction and alignment. Key parameters settings were set as follows: Ppm=15, peakwidth=c(5,30), mzdiff=0.01 and method=centWave. Next, data were corrected by the area normalization method to eliminate systematic errors. Metabolites were identified by accuracy mass and MS/MS data, which were matched with HMDB ( http://www.hmdb.ca http://www.massbank.jp/ http://www.lipidmaps.org https://www.mzcloud.org Representative positive and negative ion chromatograms and identification spectra of curcumol are provided in Supplementary S2 S6 Molecular Docking and Molecular Dynamics (MD) Simulation To further clarify the binding affinity of the active components of JWWJD and core proteins, the two-dimensional structure of the compound curcumol in JWWJD was downloaded from the PubChem database ( https://pubchem.ncbi.nlm.nih.gov/ https://pubchem.ncbi.nlm.nih.gov/ 18 The GROMACS 2022 program was utilized for MD. Generalized Amber Force Field (GAFF) was used to process the small molecular ligand, while AMBER14SB force field 19 20 Surface Plasmon Resonance (SPR) Analysis The binding affinity between curcumol and SPP1 (Sinobiological, Beijing, China) was performed using the Biacore 1K Cytiva system (GE Healthcare, Sweden), following standard SPR protocols. 21 Cells and Plasmid Transfection Human NSCLC cell lines NCI-A549, NCI-H23, NCI-H1299, NCI-H520, 95-D and SK-MES-1, human bronchial epithelial BEAS-2B cells, and Human Umbilical Vein Endothelial Cells (HUVECs) were purchased from Pricella (Wuhan, Hubei Province, China). SC-79 was purchased from Beyotime (Shanghai, China). Cis-platinum (CDDP) (the positive control) was purchased from Solarbio (Beijing, China). Cells were maintained in DMEM or DMEM/F12 from Servicebio (Wuhan, Hubei Province, China) containing 10% FBS (MeiSenCTCC, Shanghai, China), and were incubated at 37°C in a humidified incubator containing 5% carbon dioxide. OptiMEM (Gibco, New York, USA) and Lipofectamine 3000 transfection reagent (Invitrogen, California, USA) were used according to the manufacturer’s instructions. NCI-A549 and NCI-H23 cells were transfected with pcDNA3.1(+)-SPP1 expression vector and pcDNA3.1(+)-control vector from Sangon Biotech (Shanghai, China). After 6 h of transfection, the fresh medium was replaced, and the cells were incubated overnight. Cells were treated with corresponding drugs the following day. Transfection efficiency was verified by reverse transcription-quantitative PCR (RT-qPCR) and WB. Cell Viability Assay NCI-A549, NCI-H23 and BEAS-2B cells were harvested with trypsin and seeded into 96-well plates at a density of 3.5×10 3 Following treatment, 10 µL of Cell Counting Kit-8 (CCK-8) solution (Beyotime, Shanghai, China) was added to each well, and the plate was incubated for an additional 1–2 hours at 37 °C. The absorbance at 450 nm was measured using a microplate reader (PerkinElmer, Massachusetts, USA). Cell viability was calculated as a percentage relative to the control group. Colony Formation Assay After digestion with trypsin, NCI-A549 and NCI-H23 cells were counted, inoculated into 12-well plates at a density of 6×10 3 EdU Proliferation Assay NCI-A549 and NCI-H23 cells were inoculated in 48-well plates overnight and treated with different concentrations of curcumol (0, 100, 200 or 400 µM) and 15 µg/mL of CDDP for 48 h. According to the manufacturer’s instructions of BeyoClick™ EdU Cell Proliferation Kit with Alexa Fluor 594 (Beyotime, Shanghai, China), 10 µL of Edu was added to each well to continue incubation for 2 h, followed by immobilization with 4% paraformaldehyde fixative and permeabilization with 0.3% Triton X-100. Next, Click-iT ® Wound Healing and Transwell Assay NCI-A549 and NCI-H23 were inoculated into a 12-well plate. When the cells reached 70% confluency, a straight scratch was made in the cell monolayer with a 200-µL pipette tip. After removing the floating cells by washing with PBS, transfection and drug treatment were performed. Cell migration rate was calculated by measuring the scratch width under a inverted microscope (Olympus Corporation, Tokyo, Japan) at 0, 24 and 48 h. In the Transwell migration assay, 600 µL DMEM containing 10% FBS was added to the lower chamber. NCI-A549 and NCI-H23 cells, resuspended in 200 µL serum-free culture medium after 48 h of plasmid transfection or drug treatment, were uniformly inoculated into the upper chamber at a density of 3.5×10 4 Cell Apoptosis Assay NCI-A549 and NCI-H23 cells on 6-well plates were treated with different concentrations of curcumol (0, 100, 200 or 400 µM) and 15 µg/mL of CDDP for 48 h. Upon digestion with EDTA-free pancreatic enzymes (Servicebio, Wuhan, Hubei Province, China), cells were washed with PBS and resuspended in 500 µL 1X binding buffer. Then 5 µL annexin V-FITC and 5 µL propidium iodide (PI) (Apexbio, Texas, USA) were added to the cells and mixed. After incubation at room temperature for 15 min in the dark, the apoptosis of NSCLC cells was detected by CytoFLEX flow cytometer (FACSAria™ II, New Jersey, USA). Hoechst/PI Staining Assay NCI-A549 and NCI-H23 cells were inoculated on 48-well plates overnight, treated with different concentrations of curcumol (0, 100, 200 or 400 µM) and 15 µg/mL of CDDP for 48 h, and washed twice with PBS. After staining with PI and Hoechst 33342 (Beyotime, Shanghai, China) in the dark at room temperature for 15 min and then washing with PBS twice, images of stained cells were captured using fluorescence microscope. HUVECs Tube Formation Assay NCI-A549 cells were cultured in 6-well plates overnight, then supplemented with curcumol (0, 400 µM) or transfected with SPP1 plasmid. After 24 h, the conditioned medium was harvested by taking supernatant after centrifugation. HUVECs were suspended in 100 µL with different conditioned medium and seeded into Matrigel-coated 96-well plates at a density of 3×10 4 Immunofluorescence (IF) Staining Assay NCI-A549 and NCI-H23 cells were inoculated on a microscope slide overnight and then treated with curcumol (0, 400 µM) for 48 h. Next, cells were fixed with 4% paraformaldehyde, permeabilized with 0.3% Triton X-100, and incubated with 5% Bovine Serum Albumin (BSA) at room temperature for 60 min. Subsequently, cells were incubated with a primary antibody against SPP1 overnight at 4°C. Upon washing with PBS-Tween 20 (PBST) three times, CoraLite488-conjugated Goat Anti-Rabbit IgG (H+L) antibody was added and incubated for 1 h at room temperature in the dark. After washing with PBST three times, 100 µL Hoechst 33258 was added for nuclear staining. The stained cells were captured by fluorescence microscopy. RNA Extraction and RT-qPCR Analysis NCI-A549 and NCI-H23 cells were digested and inoculated on a 6-well plate, and treated with drugs and plasmids for 24 h. Total RNA was extracted by TRIzol reagent (Servicebio, Wuhan, Hubei Province, China), and its concentration was measured by NanoDrop ONE© (Thermo, Massachusetts, USA). cDNA was synthesized with PrimeScript RT Master Mix (Takara, Kyoto, JPN). A StepOnePlus System (Thermo Fisher Scientific, Waltham, Massachusetts, USA) was used for fluorescence qPCR amplification, and the relative expression level of the target gene SPP1 was calculated by relative quantification using the 2 −ΔΔCq WB Analysis Total protein was extracted with Radio Immunoprecipitation Assay (RIPA) lysis buffer containing Phenylmethanesulfonyl fluoride (PMSF) (Servicebio, Wuhan, Hubei Province, China). Protein concentration was measured by using the Bicinchoninic Acid Assay (BCA) Kit (Beyotime, Shanghai, China). Equal quantities of proteins were separated with 10 or 15% Sodium Dodecyl Sulfate-Polyacrylamide Gel Electrophoresis (SDS-PAGE) (Epizyme, Shanghai, China) and transferred to nitrocellulose membranes (MilliporeSigma, Louis, USA). Upon blocking with 5% nonfat powder milk at room temperature for 1 h, the membranes were incubated overnight at 4°C with primary antibodies against SPP1, PI3 Kinase p85 alpha, phosphorylated (p)-PI3-kinase p85α (Tyr607), AKT1, p-AKT1 (T450), MMP2, MMP9, VEGF and β-Actin. After washing with Tris-Buffered Saline with Tween (TBST) three times, the secondary antibody Goat Anti-Rabbit IgG (H+L) Horseradish Peroxidase (HRP) was added and incubated at room temperature for 1h. After three washes with TBST, the gray value of each protein band was determined using a gel imaging system (ChemiScope 6200, Shanghai, China). β-Actin was used as the reference protein, and ImageJ software win64.exe (National Institutes of Health, USA) was used to compare the relative expression changes of target proteins. Information of the antibodies involved is listed in Table 2 Table 2 Information on Antibodies Involved Antibody Application Dilution Company Catalog Number SPP1 IF 1:50 Abcam AB214050 CoraLite488-conjugated Goat Anti-Rabbit IgG (H+L) IF 1:500 Proteintech SA00013-2 SPP1 WB 1:1000 Abways CY5333 PI3 Kinase p85 alpha WB 1:1000 Abways CY5355 Phospho-PI3-kinase p85-alpha (Tyr607) WB 1:1500 Abways CY6427 AKT1 WB 1:1000 Abways CY5551 Phospho-AKT1 (T450) WB 1:1000 Abways CY5885 MMP2 WB 1:1000 Abclonal A6247 MMP9 WB 1:1000 Abclonal A0289 VEGF WB 1:1000 Abclonal A12303 β-Actin WB 1:1000 Abclonal AC026 Rabbit IgG (H + L) HRP WB 1:10000 Abways AB0101 SPP1 IHC 1:2000 Abcam AB214050 MMP2 IHC 1:200 Abclonal A6247 MMP9 IHC 1:150 Abclonal A0289 VEGF IHC 1:200 Abclonal A12303 Biotin-labeled Goat Anti-Rabbit IgG(H+L) IHC 1:500 Beyotime A0277 Cellular Thermal Shift Assay (CETSA) NCI-A549 and NCI-H23 cells were lysed with RIPA lysis buffer and aliquoted into PCR tubes. Upon treatment with curcumol (400 µM) or an equal volume of Dimethyl Sulfoxide (DMSO) and placed on a horizontal shaker for 1 h at room temperature, the solution was heated at a specified temperature (37–73°C) for 3 min using a StepOnePlus System and then cooled at 4°C for 3 min. After centrifugation for 15 min at 12,000 x g and 4°C, the supernatant was extracted, and WB was performed. Animal Experiments A total of 48 BALB/c-nu mice (4 weeks old, 18–22g) were provided by Shulaibao (Wuhan) BioteChinaology Co., Ltd (Wuhan, Hubei Province, China). After 7 days of adaptive feeding, 5×10 5 H&E Staining and IHC Analysis Nude mouse lungs, livers and kidneys were fixed with 4% paraformaldehyde and paraffin embedded, and 5-µm sections were stained with H&E. The structural changes of the tissues in the sections were examined under an upright white light microscope (Eclipse Ci-L, Tokyo, Japan). All clinical NSCLC specimens used in this study were consistent with the corresponding histopathological diagnosis. NSCLC and normal adjacent lung tissues were fixed in 10% neutral buffered formalin and mounted on paraffin sections. A primary antibody against SPP1 was added. The intensity of staining was evaluated blinded by two independent pathologists using the following criteria: 0, negative; 1, low; 2, medium; and 3, high. The staining degree was scored as 0, 0% stained; 1, 1–25% stained; 2, 26–50% stained; and 3, 51–100% stained. In total, 5 random fields were evaluated under a light microscope. Sections were deparaffinized and incubated with 3% H 2 2 RNA Sequencing (RNA-Seq) Total RNA was extracted from tumor tissues of the Control and High-dose JWWJD groups, and its quality and purity were detected. The complementary DNA (cDNA) libraries were sequenced on the Illumina sequencing platform by Metware Biotechnology (Wuhan, Hubei Province, China). DESeq2 was used for differential gene expression analysis between two groups, and the Benjamini-Hochberg correction was applied to P Statistical Analysis Experimental data were presented as the mean ± standard deviation (SD) and analyzed using GraphPad Prism version 10.1.2 (GraphPad Software, La Jolla, CA, USA). For comparisons between two independent groups, an unpaired Student’s t t P P P P Supplementary S7 Results JWWJD Inhibits the Tumor Growth in vivo, and Inhibits the Proliferation, Migration and Invasion of NSCLC in vitro To confirm whether JWWJD inhibits the tumor growth in vivo, tumor-bearing nude mice were gavaged with 0.2 mL JWWJD daily, while control mice were administered the same volume of saline. After 14 days, the tumor volume and weight of mice in the JWWJD group were significantly lower than those in the control group, particularly in the high-dose JWWJD group. There was no significant change in body weight among the groups ( Figure 2A–D Figure 2 Continued. Figure 2 Continued. Figure 2 Effect of JWWJD against NSCLC in vitro and in vivo. ( A B C D E F G H J K L M N O P Q R P < 0.05 P < P < According to OB > 30% and DL > 0.18, active compounds and potential targets of JWWJD were identified using the TCMSP and BATMAN databases. The Drug-Target network was constructed through Cytoscape3.7.2 ( Figure 2E Figure 2F Figure 2G–J Compared with drug-free serum of control group, the proliferation of NCI-A549 and NCI-H23 cells was significantly inhibited after treatment with JWWJD drug-containing serum for 24, 48 and 72 h. The inhibitory effect of JWWJD on NSCLC cell proliferation increased with increasing in drug-containing serum concentration, with 20% drug-containing serum exhibiting the best inhibitory effect on tumor cell proliferation. However, there was no significant effect on the proliferation of BEAS-2B cells ( Figure 2K Figure 2L M Figure 2N Figure 2O The transfection efficiency and expression of SPP1 were determined by RT-qPCR and Western blotting analysis ( Figure 2P Figure 2Q R Use of Network Pharmacology and Bioinformatics Analysis to Identify the Key Genes of JWWJD in the Treatment of NSCLC, and Construction of the Related Prognostic Model A total of 538 NSCLC genes in the training set were screened by differential expression analysis. In the heat map, the normal and tumor groups were distinctly separated, with red indicating high gene expression and green indicating low gene expression ( Figure 3A Figure 3 Continued. Figure 3 Construction and validation of a prognostic model of JWWJD for NSCLC. ( A B C D E F G H I H I J K J K L M L M N O N O P Q P Q R U R S T U V W V W X Y P P P In the WGCNA of the training set, six gene modules were identified through average linkage hierarchical clustering and further merged based on high topological similarity. To determine the relevance of each module to NSCLC, module-trait relationships were constructed using Pearson correlation coefficients. The module significance (MS), defined as the -log10-transformed p-value of the correlation between gene expression profiles and the NSCLC phenotype across all samples, was calculated for each module to quantify its overall association with NSCLC. Among the six modules, the turquoise module exhibited the highest correlation with NSCLC (cor = 0.53, P Figure 3B C The Venn package in R language was utilized to screen DEGs of NSCLC, and the genes related to the development of NSCLC identified by WGCNA were intersected with the target of JWWJD. A total of 25 key targets for the treatment of NSCLC by JWWJD were obtained ( Figure 3D Univariate Cox analysis was performed on 25 key targets of JWWJD in the treatment of NSCLC. The results showed that 15 genes were significantly associated with survival ( Figure 3E Figure 3F G Figure 3H–U Figure 3V–Y Associations Between SPP1 Expression and Clinical Prognosis, Clinicopathological Characteristics and Roles of SPP1 in NSCLC Compared with normal tissues, the expression of SPP1 was elevated in pancarcinoma tissues, particularly in NSCLC tissues ( Figure 4A Figure 4B C Figure 4D P Figure 4E Figure 4 Continued. Figure 4 Expression and role of SPP1 in NSCLC. ( A B C D E F G H I J K L M N O P < 0.05 P < P < In clinical fresh tumor samples, Western blot analysis confirmed that SPP1 expression was significantly higher in tumor tissues than in paired adjacent normal tissues ( Figure 4F Figure 4G Figure 4H Table 3 P Figure 4I Table 3 Correlation Between SPP1 and Clinicopathological Factors in NSCLC Characteristics Cases SPP1 χ2 P Low High Gender Male 31 9 22 1.61 0.205 Female 29 13 16 Age >65 26 8 18 0.687 0.407 ≤65 34 14 20 Size ≤5cm 42 13 23 0.012 0.913 >5cm 18 9 15 T Stage T1 10 6 4 6.423 0.093 T2 29 11 18 T3 14 5 9 T4 7 0 7 N Stage N0 23 16 7 23.528 0.001 N1 15 6 9 N2 9 0 9 N3 13 0 13 Pathologic Stage Stage I 14 10 4 17.876 0.001 Stage II 17 9 8 Stage III 29 3 26 Status Dead 30 8 26 5.831 0.016 Alive 30 14 12 To explore the biological functions of SPP1, single-cell analysis was performed using the CancerSEA database. The T-SNE plot illustrated the distribution of SPP1 expression across individual cells ( Figure 4J Figure 4K L Figure 4M Figure 4N O Identification of Blood-Entering Components from JWWJD A total of 225 metabolites were identified in the JWWJD drug group ( Figure 5A B Figure 5C D Figure 5E Figure 5 Continued. Figure 5 Total ion chromatograms of JWWJD drug and JWWJD drug-containing serum by LC-MS/MS. ( A B C D E Curcumol Inhibited the Proliferation, Migration, Invasion and Induced the Apoptosis of NSCLC Cells To evaluate the effect of curcumol on NSCLC cells, NCI-A549 and NCI-H23 cells with high SPP1 expression, were selected among various NSCLC cell lines. When treated with curcumol (400 µM) ( Figure 6A Figure 6B Figure 6C Figure 6D Figure 6 Continued. Figure 6 Curcumol inhibited the proliferation, migration, invasion and induces apoptosis of NSCLC cells in vitro. ( A B C D E F G H P < 0.05 P < P < To further explore the effects of curcumol on the migration and invasion of NSCLC cells, NCI-A549 and NCI-H23 were treated with curcumol (0, 100, 200 and 400 µmol/l), and subjected to wound healing, Transwell assays. Wound healing assay demonstrated that curcumol inhibited the migration ability of NCI-A549 and NCI-H23 cells in a concentration-dependent manner ( Figure 6E Figure 6F In the Hoechst/PI staining assay, the blue fluorescence (Hoechst) of curcumol was bright and fragmented compared with that in the untreated group. Meanwhile, the number of cells with red (PI) fluorescence gradually increased, and accumulation of the two dyes also could be observed ( Figure 6G Figure 6H Molecular Docking, MD Simulation, and SPR Analysis of Curcumol with SPP1 To confirm the interaction between curcumol and SPP1, three parallel docking analyses were performed using AutoDock Vina software. The visualization results of PyMOL software show that curcumol can closely bind to SPP1 with an average binding energy of −5.4 kcal/mol. THR-42 in SPP1 formed hydrogen bond interactions with curcumol, while ALA-39 and LEU-54 formed alkyl hydrophobic interactions with curcumol, and residues such as VAL-61, ASP-38 and ASN-53 formed Van der Waals force interactions with curcumol ( Figure 7A Figure 7 Continued. Figure 7 Continued. Figure 7 Curcumol inhibited the migration and invasion of NSCLC cells by decreasing the expression of SPP1. ( A B C D E F G H I J K L P < 0.05 P < P < MD simulations were conducted to assess the stability of the complex over time. The RMSD of the protein-ligand complex showed minimal fluctuations during the simulation period, suggesting structural convergence and overall system stability. Additionally, RMSF analysis indicated low residue-level flexibility at the binding interface. The SASA of the complex gradually decreased over the simulation time, reflecting a more compact and stable conformation upon ligand binding ( Figure 7B C Moreover, according to the result of SPR, experiments further confirmed the direct interaction between curcumol and SPP1, revealing a high binding affinity with an equilibrium dissociation constant (KD=4.55e-06M), consistent with the computational predictions. This supports the reliability of the docking results and provides a solid theoretical basis for subsequent functional studies, including CETSA, WB, and rescue experiments ( Figure 7D E Taken together, these findings indicate that curcumol stably interacts with SPP1 and may exert its anti-metastatic effects through this direct molecular engagement. Curcumol Reduced the Expression of SPP1 to Inhibit Invasion and Migration To assess the expression levels of SPP1, a pivotal prognostic marker, in NCI-A549 and NCI-H23 cells following curcumol treatment, a suite of assays including RT-qPCR, WB, IF, and CETSA were employed. The results of qPCR revealed that, compared with the control group, the mRNA expression of SPP1 in NCI-A549 and NCI-H23 cells treated with curcumol (100, 200 and 400 µmol/l) exhibited a concentration-dependent decrease ( Figure 7F Figure 7G Figure 7H To elucidate the role of SPP1 in NSCLC cells, plasmids designed to overexpress SPP1 were transiently transfected into NCI-A549 and NCI-H23 cells. Subsequent analyses using tube formation assay revealed that that overexpression of SPP1 could significantly enhanced tube formation capabilities ( Figure 7I Figure 7J Figure 7K Functionally, SPP1 overexpression was able to restore the migratory and invasive capacities of NCI-A549 and NCI-H23 cells that had been inhibited by curcumol treatment ( Figure 7L Curcumol Inhibited the Growth of NSCLC in vivo For the subcutaneous tumor xenograft model, following a 14-day treatment period, mice were sacrificed and tumor tissues were collected. In comparison to the control group, there was a significant reduction in both the volume and weight of xenograft tumors in the groups treated with CDDP and curcumol ( Figure 8A–C Figure 8D Figure 8E Figure 8F G Figure 8 Curcumol inhibited NSCLC growth in vivo. ( A B C D E F G P < 0.05 P < P < Discussion Primarily for clearing away the lung heat and resolving phlegm, as well as draining blood stasis and discharging pus, QJWJD, as a classical prescription, is frequently used for treating the lung diseases in TCM, but insufficient studies have shown its satisfactory effects on lung cancer metastasis. According to TCM, blood stasis is not only one of the significant contributors and pathological products of the lung cancer, but also the key inducer of its development and metastasis. 22 23 Huangdi Neijing 24 25 This study confirmed that JWWJD could significantly inhibit the tumor growth in vivo through animal experiments. By extracting drug-containing serum, it has been proved that JWWJD could play a vital role in inhibiting the proliferation, migration and invasion as well as inducing apoptosis of NSCLC cells. To master the multi-target characteristics of compound prescriptions of TCM in a holistic manner, we selected 7 key genes (ALDH1A2, BIRC5, CAV1, IGFBP3, SPP1, TCN1, THBD) in the treatment of NSCLC via JWWJD with a combined use of network pharmacology and constructing a clinical prognostic model, which had ultimately shown preferable predication performance. Through the heat map characteristic of risk score, we found that SPP1 was the gene with the highest prognostic risk score. With the rise of SPP1 expression levels, risk score of the prognostic model increased significantly, indicating the deteriorating prognosis of the NSCLC patients. To further elucidate the mechanism of this compound prescription in TCM, we particularly combined transcriptomic validation, discovering that the anti-NSCLC effect of JWWJD in animals may be closely associated with the lowered expression of SPP1, the key prognostic gene, and the inhibition of PI3K/AKT pathway, and it mainly acts on tumor metastasis-related phenotypes, such as wound healing. SPP1, also known as osteopontin (OPN), is a protein encoded by the human gene SPP1. OPN, as a detectable secreted molecule in both blood and body fluids, is considered a potential biomarker for the diagnosis of cancer today, and is believed to be implicated in the development, progression and metastasis of a variety of malignant tumors. 26 Figure 4H Table 3 27 28 29 30 31–33 34 Through further designing a rescue experiment, we found that the inhibitory effect of JWWJD drug-containing serum on NSCLC cell migration and invasion were reversed when SPP1 was overexpressed. After adding AKT agonist SC79, the inhibitory effect of JWWJD drug-containing serum on NSCLC cell migration and invasion was also rescued. These findings further confirmed our previous prediction that JWWJD could suppress the metastasis of NSCLC by inhibiting the expression of SPP1, a key cancer-promoting molecule and the PI3K/AKT1 pathway. Considering the complexity of compound prescriptions in TCM, we conducted, to the best of our knowledge, the first systematic analysis of the active components of JWWJD using LC-MS/MS. By identifying both the original constituents of the decoction and those present in the drug-containing serum, we aimed to comprehensively characterize the bioactive substances that enter the bloodstream and potentially mediate its anticancer effects. After further screening based on the “Monarch-Minister-Assistant-Guide” compatibility theory of compound prescriptions in TCM, we concluded that curcumol, the most important active component of Curcumae Rhizoma in JWWJD, may be the key ingredient in the treatment of NSCLC. 35 36 Curcumol is a bioactive sesquiterpenoid discovered in quite a number of drugs in the family of Zingiberaceae, including Curcumae Rhizoma, which has potent anticancer activity against a variety of tumors in vitro and in vivo. 37 38–40 In light of the specific mechanism of curcumol in the treatment of NSCLC, we found through molecular docking simulation and SPR assay that this substance and SPP1 could bind together in a stable way, and the binding energy and affinity of the two are strong, in which Van der Waals force plays a pivotal role. On the other hand, qPCR, WB and IF experiments showed that curcumol could reduce the mRNA and protein expression levels of SPP1. Further rescue experiments proved that the inhibitory effect of curcumol on the migration and invasion of NSCLC cells could be reversed with overexpression of SPP1. Through the subcutaneous tumor formation model, curcumol could inhibit the tumor growth in nude mice and the inhibitory effect of high-dose curcumol was similar to that of CDDP. Moreover, the liver and kidney HE results in nude mice had not shown obvious hepatorenal toxicity caused by curcumol. Both IHC and WB results suggested that curcumol may inhibit subcutaneous tumor in nude mice by reducing the SPP1 expression in the tumor tissues. To the best of our knowledge, this is the first study to identify SPP1 as a direct molecular target of curcumol in NSCLC. These findings not only reveal a novel mechanism by which curcumol exerts its anti-metastatic activity but also highlight the therapeutic potential of targeting the curcumol–SPP1 axis in lung cancer. The proposed mechanism is illustrated in Figure 9 Figure 9 Schematic diagram of the molecular mechanism elucidating JWWJD against the angiogenesis and metastasis in NSCLC. Illustration was created using MedPeer (medpeer.cn). There are unavoidably certain limitations in this study. On the one hand, it was found that JWWJD could inhibit the PI3K/AKT1 pathway in vitro, but its main component, curcumol, could only inhibit the PI3K/AKT1 pathway in NCI-A549 cell, and the inhibitory effect of this pathway on NCI-H23 cell had not been obviously detected. So, it necessitates further investigations to explore whether curcumol inhibits AKT or other AKT subtypes in NCI-H23. On the other hand, as is well recognized, the components and targets of compound prescriptions in TCM are diverse and complex, the effect and mechanism of curcumol alone cannot fully represent the effect of JWWJD as a whole. Hence, further studies are warranted in the future to provide more robust evidences for JWWJD in the treatment of NSCLC. Conclusion This study represents the first integration of a prognostic model with network pharmacology to elucidate the multi-component, multi-target mechanism of JWWJD in the treatment of NSCLC, demonstrating through bioinformatics analysis, transcriptomic data, and experimental validation that JWWJD exerts significant anticancer effects both in vitro and in vivo; furthermore, by employing molecular dynamics simulations, SPR assays, and related experimental validations, we identified curcumol - a natural compound derived from JWWJD - as a novel inhibitor of SPP1, a key oncogenic driver in NSCLC, thereby providing a comprehensive interpretation of the active ingredients and critical anticancer targets of JWWJD and offering new insights into the modernization of TCM while highlighting potential therapeutic strategies for NSCLC. Abbreviations AKT1, Serine/threonine-protein kinase AKT1; AUC, Area Under the Curve; BCA, Bicinchoninic Acid Assay; BSA, Bovine Serum Albumin; CETSA, Cellular Thermal Shift Assay; Cox, Cox Proportional Hazards Model; CDDP, cis-platinum; cDNA, complementary DNA; DAB, 3,3’-Diaminobenzidine; DEG, Differential expressed genes; DMSO, Dimethyl Sulfoxide; GAFF, Generalized Amber Force Field; GEO, Gene expression omnibus; GEPIA, Gene Expression Profiling Interactive Analysis; GO, Genome ontology; HRP, Horseradish Peroxidase; H&E staining, Hematoxylin and Eosin staining; HUVEC, Human Umbilical Vein Endothelial Cells; IHC, Immunohistochemistry; IF, Immunofluorescence; JWWJD, Jiawei Weijing Decoction; KEGG, Kyoto Encyclopedia of Genes and Genomes; KNN, K-Nearest Neighbors; LASSO, Least absolute shrinkage and selection operator; LC-MS/MS, Liquid chromatography-mass spectrometry/mass spectrometry; Limma, Linear Models for Microarray and RNA-Seq Data; MD, Molecular Dynamics; MMP2, Matrix metalloproteinase-2; MMP9, Matrix metalloproteinase-9; MM-PBSA, Molecular mechanics Poisson-Boltzmann surface area; NCI, National Cancer Institute; NPT, constant-pressure, constant-temperature ensemble; NSCLC, Non-small cell lung cancer; NVT, Normal Volume Temperature; PCA, Principal Component Analysis; PBS, phosphate buffer solution; PBST, PBS-Tween 20; PCA, principal component analysis; PDB, Protein Data Bank; PI, Propidium Iodide; PI3K, Phosphoinositide 3-kinase; p-PI3K, phosphated-Phosphoinositide 3-kinase; p-AKT1, phosphated-Serine/threonine-protein kinase AKT1; PCNA, Proliferating Cell Nuclear Antigen; PMSF, Phenylmethanesulfonyl fluoride; PPI, protein-protein interaction; PyMOL, PyMOL Molecular Graphics System; QJWJD, Qianjin Weijin Decoction; RIPA, Radio Immunoprecipitation Assay; RNA-Seq, RNA Sequencing; ROC, Receiver Operating Characteristic Curve; SDS-PAGE, sodium dodecyl sulfate-polyacrylamide gel electrophoresis; SPF, Specific Pathogen Free; SPP1, Secreted phosphoprotein 1; SPR, Surface Plasmon Resonance; Sva, Surrogate Variable Analysis; TBST, Tris-Buffered Saline with Tween; TCGA, The Cancer Genome Atlas; TCM, traditional Chinese medicine; VEGF, Vascular endothelial growth factor; VMD, Variational Mode Decomposition; β-actin, Beta-actin. Disclosure These authors declared that there are no known conflicts of interest for this work. References 1. Cronin KA Scott S Firth AU Annual report to the nation on the status of cancer, part 1: national cancer statistics Cancer 2022 128 24 4251 4284 10.1002/cncr.34479 36301149 PMC10092838 2. Xie S Wu Z Qi Y Wu B Zhu X The metastasizing mechanisms of lung cancer: recent advances and therapeutic challenges Biomed Pharmacother 2021 138 111450 10.1016/j.biopha.2021.111450 33690088 3. Wei Z Chen J Zuo F Traditional Chinese Medicine has great potential as candidate drugs for lung cancer: a review J Ethnopharmacol 2023 300 115748 10.1016/j.jep.2022.115748 36162545 4. Li Z Feiyue Z Gaofeng L Traditional Chinese medicine and lung cancer--From theory to practice Biomed Pharmacother 2021 137 111381 10.1016/j.biopha.2021.111381 33601147 5. Liu P Zhao Q Xu Y A Chinese classical prescription Qianjinweijing decoction in treatment of lung cancer: an overview Biomed Pharmacother 2022 156 113913 10.1016/j.biopha.2022.113913 36308919 6. Xi Z Dai R Ze Y Jiang X Liu M Xu H Traditional Chinese medicine in lung cancer treatment Mol Cancer 2025 24 1 10.1186/s12943-025-02245-6 PMC11863959 40001110 7. Huo B Song Y Tan B TMT-based proteomics analysis of the effects of Qianjinweijing Tang on lung cancer Biomed Chromatography 2021 35 8 e5116 10.1002/bmc.5116 33724505 8. Zhou DH Oncology of Traditional Chinese Medicine 3rd Guangzhou Higher Education Press of Guangdong 2020 9. Chen Y Zhu Z Chen J Terpenoids from curcumae rhizoma: their anticancer effects and clinical uses on combination and versus drug therapies Biomed Pharmacother 2021 138 111350 10.1016/j.biopha.2021.111350 33721752 10. Bai Y Xia B Xie W Phytochemistry and pharmacological activities of the genus Prunella Food Chem 2016 204 483 496 10.1016/j.foodchem.2016.02.047 26988527 11. Liu Q Lu JJ Hong HJ Yang Q Wang Y Chen XJ Ophiopogon japonicus and its active compounds: a review of potential anticancer effects and underlying mechanisms Phytomedicine 2023 113 154718 10.1016/j.phymed.2023.154718 36854203 12. Abbott A Basel Declaration defends animal research Nature 2010 468 7325 742 10.1038/468742a 21150964 13. Ritchie ME Phipson B Wu D limma powers differential expression analyses for RNA-sequencing and microarray studies Nucleic Acids Res 2015 43 7 e47 e47 10.1093/nar/gkv007 25605792 PMC4402510 14. Troyanskaya O Cantor M Sherlock G Missing value estimation methods for DNA microarrays Bioinformatics 2001 17 6 520 525 10.1093/bioinformatics/17.6.520 11395428 15. Leek JT Johnson WE Parker HS Jaffe AE Storey JD The sva package for removing batch effects and other unwanted variation in high-throughput experiments Bioinformatics 2012 28 6 882 883 10.1093/bioinformatics/bts034 22257669 PMC3307112 16. Friedman J Hastie T Tibshirani R Regularization paths for generalized linear models via coordinate descent J Statistical Software 2010 33 1 1 22 10.18637/jss.v033.i01 PMC2929880 20808728 17. Harrell FE Lee KL Mark DB Multivariable prognostic models: issues in developing models, evaluating assumptions and adequacy, and measuring and reducing errors Stat Med 1996 15 4 361 387 10.1002/(SICI)1097-0258(19960229)15:4&#x0003c;361::AID-SIM168&#x0003e;3.0.CO;2-4 8668867 18. Trott O Olson AJ AutoDock Vina: improving the speed and accuracy of docking with a new scoring function, efficient optimization, and multithreading J Comput Chem 2009 31 2 455 461 10.1002/jcc.21334 PMC3041641 19499576 19. Maier JA Martinez C Kasavajhala K Wickstrom L Hauser KE Simmerling C ff14SB: improving the accuracy of protein side chain and backbone parameters from ff99SB J Chem Theory Computation 2015 11 8 3696 3713 10.1021/acs.jctc.5b00255 PMC4821407 26574453 20. Valdés-Tresanco MS Valdés-Tresanco ME Valiente PA Moreno E gmx_MMPBSA: a new tool to perform end-state free energy calculations with GROMACS J Chem Theory Computation 2021 17 10 6281 6291 10.1021/acs.jctc.1c00645 34586825 21. Lausted C Hu Z Hood L Campbell CT SPR imaging for high throughput, label-free interaction analysis Comb Chem High Throughput Screening 2009 12 8 741 751 10.2174/138620709789104933 19531009 22. Qian YF Wang XJ Effects of blood-activating and stasis-resolving drugs on tumor formation and metastasis J Trad Chinese Med 2009 29 4 301 310 10.1016/s0254-6272(09)60089-3 20112495 23. Wu S Sun Z Guo Z The effectiveness of blood-activating and stasis-transforming traditional Chinese medicines (BAST) in lung cancer progression-a comprehensive review J Ethnopharmacol 2023 314 116565 10.1016/j.jep.2023.116565 37172918 24. Cui T Li BY Liu F Xiong L Research progress on sesquiterpenoids of curcumae rhizoma and their pharmacological effects Biomolecules 2024 14 4 387 10.3390/biom14040387 38672405 PMC11048675 25. Lin L Zhou X Gao T Herb pairs containing curcumae rhizoma (Ezhu): a review of bio-active constituents, compatibility effects and t-copula function analysis J Ethnopharmacol 2024 319 Pt 3 117199 10.1016/j.jep.2023.117199 37844744 26. Yan Z Hu X Tang B Deng F Role of osteopontin in cancer development and treatment Heliyon 2023 9 10 e21055 10.1016/j.heliyon.2023.e21055 37867833 PMC10587537 27. Blasberg JD Goparaju CM Pass HI Donington JS Lung cancer osteopontin isoforms exhibit angiogenic functional heterogeneity J Thoracic Cardiovasc Surg 2010 139 6 1587 1593 10.1016/j.jtcvs.2009.08.016 PMC2875279 19818970 28. Donati V Boldrini L Dell’Omodarme M Osteopontin expression and prognostic significance in non-small cell lung cancer Clin Cancer Res 2005 11 18 6459 6465 10.1158/1078-0432.CCR-05-0541 16166420 29. Kerenidi T Kazakou AP Lada M Tsilioni I Daniil Z Gourgoulianis KI Clinical significance of circulating osteopontin levels in patients with lung cancer and correlation with VEGF and MMP-9 Cancer Invest 2016 34 8 385 392 10.1080/07357907.2016.1223301 27624849 30. El-Tanani MK Campbell FC Kurisetty V Jin D McCann M Rudland PS The regulation and role of osteopontin in malignant transformation and cancer Cytokine Growth Factor Rev 2006 17 6 463 474 10.1016/j.cytogfr.2006.09.010 17113338 31. Pang X Zhang J He X SPP1 promotes enzalutamide resistance and epithelial-mesenchymal-transition activation in castration-resistant prostate cancer via PI3K/AKT and ERK1/2 pathways Oxid Med Cell Longev 2021 2021 1 5806602 10.1155/2021/5806602 34721759 PMC8556132 32. Zhang Y Li S Cui X Wang Y microRNA-944 inhibits breast cancer cell proliferation and promotes cell apoptosis by reducing SPP1 through inactivating the PI3K/Akt pathway Apoptosis 2023 28 11–12 1546 1563 10.1007/s10495-023-01870-0 37486406 33. Yue B Xiong D Chen J SPP1 induces idiopathic pulmonary fibrosis and NSCLC progression via the PI3K/Akt/mTOR pathway Respir Res 2024 25 1 362 10.1186/s12931-024-02989-7 39369217 PMC11456247 34. Sanaei MJ Razi S Pourbagheri-Sigaroodi A Bashash D The PI3K/Akt/mTOR pathway in lung cancer; oncogenic alterations, therapeutic opportunities, challenges, and a glance at the application of nanoparticles Transl Oncol 2022 18 101364 10.1016/j.tranon.2022.101364 35168143 PMC8850794 35. Luan X Zhang L-J Li X-Q Compound-based Chinese medicine formula: from discovery to compatibility mechanism J Ethnopharmacol 2020 254 112687 10.1016/j.jep.2020.112687 32105748 36. Huang Y-X Wang Y-X Wang X-H Xie F Duan X-L Li C-J Compatibility mechanism of Chinese medicine formula: state of the art and perspectives Drug Combination Ther 2023 5 2 6 37. Wei W Rasul A Sadiqa A Curcumol: from plant roots to cancer roots Int J Bio Sci 2019 15 8 1600 1609 10.7150/ijbs.34716 31360103 PMC6643219 38. Wei ZL Juan W Tong D Curcumol inhibits breast cancer growth via NCL/ERα36 and the PI3K/AKT pathway Food Funct 2023 14 2 874 885 10.1039/D2FO02387C 36537297 39. Hu Y Xu R Ma J Yan Z Ma J Curcumol enhances cisplatin sensitivity of gastric cancer: involvement of microRNA-7 and the nuclear factor-kappa B/snail family transcriptional repressor 1 axis Bioengineered 2022 13 5 11668 11683 10.1080/21655979.2022.2070975 35510522 PMC9275945 40. Zuo HX Jin Y Wang Z Curcumol inhibits the expression of programmed cell death-ligand 1 through crosstalk between hypoxia-inducible factor-1α and STAT3 (T705) signaling pathways in hepatic cancer J Ethnopharmacol 2020 257 112835 10.1016/j.jep.2020.112835 32278762 ",
  "metadata": {
    "Title of this paper": "Curcumol inhibits the expression of programmed cell death-ligand 1 through crosstalk between hypoxia-inducible factor-1α and STAT3 (T705) signaling pathways in hepatic cancer",
    "Journal it was published in:": "Drug Design, Development and Therapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478209/"
  }
}