{
  "title": "Paper_590",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472863 PMC12472863.1 12472863 12472863 41011539 10.3390/microorganisms13092208 microorganisms-13-02208 1 Case Report Periorbital and Central Nervous System Infection Due to Arcanobacterium haemolyticum Chinello Pierangelo 1 * Capone Alessandro 1 Al Moghazi Samir 1 https://orcid.org/0000-0003-3539-2537 Cirillo Paolo 1 https://orcid.org/0000-0003-2198-1947 Fontana Carla 2 † https://orcid.org/0000-0002-0754-6917 Cicalini Stefania 1 † Joshi Suresh G. Academic Editor 1 alessandro.capone@inmi.it samir.almoghazi@inmi.it paolo.cirillo@inmi.it stefania.cicalini@inmi.it 2 carla.fontana@inmi.it * pierangelo.chinello@inmi.it † These authors contributed equally to this work. 20 9 2025 9 2025 13 9 496716 2208 11 7 2025 10 9 2025 18 9 2025 20 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Arcanobacterium haemolyticum A. haemolyticum A. haemolyticum A. haemolyticum A. haemolyticum Arcanobacterium haemolyticum sinusitis periorbital cellulitis subdural empyema cerebritis Italian Ministry of Health through “Ricerca Corrente, Linea 3” This research was supported by grants from the Italian Ministry of Health through “Ricerca Corrente, Linea 3”. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Arcanobacterium haemolyticum Corynebacterium Actinomycetes 1 Streptococcus pyogenes 2 3 Invasive A. haemolyticum 4 5 We present a rare case of A. haemolyticum 2. Case Report At the beginning of December 2023, a 21-year-old student nurse underwent a head CT scan due to a ten-day history of headache. He was diagnosed as having right fronto-maxillary sinusitis and started therapy with amoxicillin-clavulanate. Three days later, he developed right periorbital edema and the general practitioner suggested changing the antibiotic therapy to clarithromycin 500 mg every 12 h (bid), suspecting an allergic reaction. In a subsequent infectious diseases visit, the therapy was further changed to intramuscular ceftriaxone 2 g every 24 h (qd). On 18 December 2023, due to worsening of the local clinical picture, the patient went to the emergency room of a tertiary referral hospital in Rome (Italy) where he underwent blood cultures (which returned negative) and a head CT scan that revealed right orbital cellulitis with a large exophytic formation in the orbital and periorbital area inferiorly displacing the eyeball, together with right maxillary, frontal and ethmoidal sinusitis ( Figure 1 He started therapy with daptomycin 700 mg qd and piperacillin/tazobactam 4.5 gr every 6 h and was admitted to the maxillofacial surgery unit. A culture of drained material from periorbital and sinus collections grew A. haemolyticum On 8 January 2024, a cerebral magnetic resonance (MR) revealed the presence of a right frontal subdural purulent collection with a maximum thickness of 7 mm to be referred to as empyema; the frontal right cerebral tissue was also involved in the infection with a large edematous reaction shifting the midline structures 9 mm to the left ( Figure 2 On 18 January 2024, the patient was transferred to our infectious diseases unit at “Spallanzani” hospital in Rome (Italy). On admission, he was in good general condition, alert, oriented and eupneic in room air. Antibiotic therapy was continued with meropenem 2 g tid until 3 February 2024, and linezolid 600 mg bid until 2 March 2024. Meropenem was withdrawn due to an increase in transaminase levels (AST 118 U/L, ALT 313 U/L), which subsequently decreased. Linezolid was well tolerated: on hospital discharge (2 March 2024), leucocytes were 3930/mmc, Hb 13.9 g/dL, platelets 211,000/mmc, AST 36 and ALT 83 U/L. The patient also received mannitol during the first 4 days, dexamethasone 8 mg bid with subsequent decalage and levetiracetam 500 mg bid (reduced to 500 mg qd on discharge). On 27 February 2024, a cerebral MR revealed a good reduction in the subdural collection at the craniotomy access and of the frontotemporal edema, with midline structures substantially in axis ( Figure 3 After a one-year follow-up, the patient is in stable general condition, without any recurrence of the disease, and is continuing his studies. 3. Discussion Arcanobacterium A. haemolyticum. 5 6 Corynebacterium haemolyticum Arcanobacterium A. haemolyticum 7 Arcanobacterium pyogenes Trueperella pyogenes 8 9 A. haemolyticum 5 5 6 The identification of A. haemolyticum Corynebacterium 2 9 10 11 12 https://microbenet.cdc.gov 13 A. haemolyticum A. haemolyticum 2 Humans are the principal reservoir, although animal infections have been described [ 14 2 15 A. haemolyticum 16 A. haemolyticum Table 1 Arcanobacterium haemolyticum Corynebacterium haemolyticum 1 2 5 15 17 18 19 20 21 22 23 24 25 26 27 28 29 Although cases of isolated meningitis have been reported, the clinical history of most cases of CNS infection appear to evolve, as in this case, from sinusitis to subdural empyema, cerebritis and subsequent abscess formation necessitating surgical procedures. Anatomical pathways for bacterial entry into the CNS often involve hematogenous dissemination or direct extension from adjacent infected sites, such as the middle ear or paranasal sinuses. Data in the literature mention that adolescents carry a greater risk of rhinogenic intracranial complications because of the highly vascularized diploic venous system and development of the frontal sinuses in this age group [ 30 A. haemolyticum Local extension of infection to CNS has also been described in relation to dental pathology, head trauma and upper respiratory tract infection [ 1 17 18 20 29 15 22 As reported in Table 1 A. haemolyticum Fusobacterium necrophorum Bacteroides Propionibacterium haemolyticum F. necrophorum A. haemolyticum 31 5 haemolyticum F. necrophorum 32 33 34 CNS A. haemolyticum 19 Clear indications for the optimal antibiotic treatment of A. haemolyticum 1 35 A. haemolyticum 36 A. haemolyticum 1 A. haemolyticum A. haemolyticum A. haemolyticum 37 38 39 A. haemolyticum 1 A. haemolyticum A. haemolyticum 40 41 Staphylococcus aureus A. haemolyticum 35 40 MICs of erythromycin and azithromycin against our strain were 2 mg/L for both drugs, much higher than the MIC 90 36 Arcanobacterium 42 43 44 44 According to the antibiogram, potential alternatives to linezolid were meropenem (MIC 0.012 mg/L), amoxicillin/clavulanate (MIC < 0.016 mg/L), and piperacillin/tazobactam (MIC < 0.016 mg/L); however, meropenem had been withdrawn due to hepatic toxicity, and the last two drugs would have raised concerns regarding the passage of the blood–brain barrier. To summarize, on imaging examinations, large paranasal/periorbital purulent collections or signs of CNS involvement should prompt surgical evaluation for timely evacuation and source control. Clear indications for A. haemolyticum A. haemolyticum 4. Conclusions Although uncommon, A. haemolyticum A. haemolyticum A. haemolyticum Acknowledgments We sincerely thank Fabrizio Albarello for his skillful assistance in radiologic imaging. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, P.C. (Pierangelo Chinello) and A.C.; Methodology, P.C. (Paolo Cirillo) and S.A.M.; Validation, S.C. and C.F.; Data Curation, P.C. (Pierangelo Chinello); Writing—Original Draft Preparation, P.C. (Pierangelo Chinello) and A.C.; Writing—Review and Editing, P.C. (Paolo Cirillo) and S.A.M.; Visualization, P.C. (Paolo Cirillo); Supervision, S.C. and C.F. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethical review and approval were waived for this study due to the Italian law for publication of case reports regarding patients cured in research institutes. Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. Cortés-Penfield N. Kohli A. Weatherhead J. El Sahly H. Arcanobacterium haemolyticum Infect. Dis. Clin. Pract. 2017 25 e9 e11 10.1097/IPC.0000000000000477 PMC6430583 30906173 2. Sahhar H.S. Rubin E. Rishmawi S.E. Logan M. Invasive Sinusitis with Arcanobacterium haemolyticum Fusobacterium necrophorum Cureus 2023 15 e44517 10.7759/cureus.44517 37790026 PMC10544604 3. Barker K.F. Renton N.E. Lee P.Y. James D.H. Arcanobacterium haemolyticum J. Infect. 1992 24 214 215 10.1016/0163-4453(92)93110-C 1569313 4. Stacey A. Bradlow A. Arcanobacterium haemolyticum J. Infect. 1999 38 41 42 10.1016/S0163-4453(99)90028-2 10090506 5. Chang N. Lennard K. Rao A. Elliott M. Dharan N. Wong J. Polymicrobial Arcanobacterium haemolyticum IDCases 2024 36 e01960 10.1016/j.idcr.2024.e01960 38690576 PMC11059456 6. Maclean P.D. Liebow A.A. Rosenberg A.A. A hemolytic corynebacterium resembling Corynebacterium ovis and Corynebacterium pyogenes in man J. Infect. Dis. 1946 79 69 90 10.1093/infdis/79.1.69 20996930 7. Collins M.D. Jones D. Schofield G.M. Reclassification of ‘Corynebacterium haemolyticum’ Arcanobacterium haemolyticum J. Gen. Microbiol. 1982 128 1279 1281 10.1099/00221287-128-6-1279 7119737 8. Rzewuska M. Kwiecień E. Chrobak-Chmiel D. Kizerwetter-Świda M. Stefańska I. Gieryńska M. Pathogenicity and Virulence of Trueperella pyogenes Int. J. Mol. Sci. 2019 20 2737 10.3390/ijms20112737 31167367 PMC6600626 9. Vu M.L.D. Rajnik M. Arcanobacterium haemolyticum Infections StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 Available online: https://www.ncbi.nlm.nih.gov/books/NBK560927/ (accessed on 10 July 2025) 32809762 10. Vila J. Juiz P. Salas C. Almela M. de la Fuente C.G. Zboromyrska Y. Navas J. Bosch J. Agüero J. de la Bellacasa J.P. Identification of clinically relevant Corynebacterium Arcanobacterium haemolyticum Rhodococcus J. Clin. Microbiol. 2012 50 1745 1747 10.1128/JCM.05821-11 22337985 PMC3347156 11. Hijazin M. Hassan A.A. Alber J. Lämmler C. Timke M. Kostrzewa M. Prenger-Berninghoff E. Zschöck M. Evaluation of matrix-assisted laser desorption ionization-time of flight mass spectrometry (MALDI-TOF MS) for species identification of bacteria of genera Arcanobacterium Trueperella Vet. Microbiol. 2012 157 243 245 10.1016/j.vetmic.2011.12.022 22270885 12. Sammra O. Friis-Møller A. Balbutskaya A. Hijazin M. Nagib S. Alber J. Lämmler C. Abdulmawjood A. Timke M. Kostrzewa M. Phenotypic and genotypic characteristics of Arcanobacterium haemolyticum Folia Microbiol. (Praha) 2014 59 369 374 10.1007/s12223-014-0308-4 24531868 13. Centers for Disease Control and Prevention (CDC) MicrobeNet: A CDC Virtual Reference Laboratory Available online: https://microbenet.cdc.gov/ (accessed on 5 June 2025) 14. Wragg P.N. Strugnell B.W. Whatmore A.M. Foster G. Arcanobacterium haemolyticum Meles meles J. Vet. Diagn. Invest. 2011 23 1234 1235 10.1177/1040638711425585 22362809 15. Wong V. Turmezei T. Cartmill M. Soo S. Infective endocarditis caused by Arcanobacterium haemolyticum Ann. Clin. Microbiol. Antimicrob. 2011 10 17 10.1186/1476-0711-10-17 21569379 PMC3103420 16. Sayad E. Zeid C.A. Hajjar R.E. Cabrera N.L. Radi Abou Jaoudeh R.A. Malek A.E. The burden of Arcanobacterium haemolyticum Int. J. Pediatr. Otorhinolaryngol. 2021 146 110759 10.1016/j.ijporl.2021.110759 34038812 17. Adams N. Snitchler C. Kong M. Ikeda D. Skinner A. Rodriguezbarrantes J. Leverette R. Bell R. When upper respiratory tract infections go rogue: A case report of Arcanobacterium haemolyticum IDCases 2020 23 e01014 10.1016/j.idcr.2020.e01014 33304814 PMC7711139 18. Vargas J. Hernandez M. Silvestri C. Jiménez O. Guevara N. Carballo M. Rojas N. Riera J. Alayo E. Fernández M. Brain abscess due to Arcanobacterium haemolyticum Clin. Infect. Dis. 2006 42 1810 1811 10.1086/504436 16705595 19. Poplin V. McKinsey D.S. Arcanobacterium Brain Abscesses, Subdural Empyema, and Bacteremia Complicating Epstein-Barr Virus Mononucleosis Kans. J. Med. 2018 11 1 12 PMC5834238 29844849 20. Skov R.L. Sanden A.K. Danchell V.H. Robertsen K. Ejlertsen T. Systemic and deep-seated infections caused by Arcanobacterium haemolyticum Eur. J. Clin. Microbiol. Infect. Dis. 1998 17 578 582 10.1007/s100960050135 9796659 21. Minárik T. Sufliarsky J. Trupl J. Krcméry V. Jr. Arcanobacterium haemolyticum J. Infect. 1997 34 91 10.1016/S0163-4453(97)80023-0 9120339 22. Chandrasekar P.H. Molinari J.A. Corynebacterium hemolyticum Am. J. Med. 1987 82 638 640 10.1016/0002-9343(87)90114-8 3826127 23. Cook I.F. Cabral D.A. Reed W.D. Bond R.J. Henderson A. Intracranial complications of sphenoidal sinus inflammation Med. J. Aust. 1981 1 366 10.5694/j.1326-5377.1981.tb135637.x 7242422 24. Chhang W.H. Ayyagari A. Sharma B.S. Kak V.K. Arcanobacterium haemolyticum Indian J. Pathol. Microbiol. 1991 34 145 148 1752643 25. Washington J.A. Martin W.J. Spiekerman R.E. Brain abscess with Corynebacterium hemolyticum Am. J. Clin. Pathol. 1971 56 212 215 10.1093/ajcp/56.2.212 5567728 26. Altmann G. Bogokovsky B. Brain abscess due to Corynebacterium haemolyticum Lancet 1973 1 378 379 10.1016/S0140-6736(73)90177-3 4121979 27. Ben-Yaacob D. Waron M. Boldur I. Gil I. Sompolinsky D. Septicemia due to Corynebacterium haemolyticum Isr. J. Med. Sci. 1984 20 431 433 6381391 28. Chin S.J. Horton D. Double whammy: Delayed cerebral ischemia of a 19-year-old secondary to sinogenic complications from an uncommon bacterial sinusitis, Arcanobacterium haemolyticum Radiol. Case Rep. 2024 19 2689 2697 10.1016/j.radcr.2024.03.029 38645946 PMC11033105 29. Ouriemchi W. Jeddi D. Ziane Y. El Quessar A. Benouda A. Abcès cérébral à Arcanobacterium haemolyticum Arcanobacterium haemolyticum Med. Mal. Infect. 2011 41 397 399 (In French) 10.1016/j.medmal.2010.12.016 21440388 30. Morita M. Tarasawa K. Hidaka H. Yun Y. Fujimori K. Fushimi K. Hamada S. Asako M. Kawachi R. Yagi M. Risk factors in patients treated with surgical drainage for rhinogenic intracranial complications: A nationwide study Rhinology 2025 63 397 404 10.4193/Rhin25.057 40445119 31. Alrwashdeh A.M. Saluja P. Hasan L. Kocurek E. Dare R.K. Arcanobacterium haemolyticum IDCases 2022 31 e01645 10.1016/j.idcr.2022.e01645 36579145 PMC9791352 32. Lampejo T. Alsheikh F. Crilly D. Brown M. Lemierre’s syndrome: Varying pathogens, clinical presentations and complications Diagn. Microbiol. Infect. Dis. 2024 108 116123 10.1016/j.diagmicrobio.2023.116123 37907045 33. Younus F. Chua A. Tortora G. Jimenez V.E. Lemierre’s disease caused by co-infection of Arcanobacterium haemolyticum Fusobacterium necrophorum J. Infect. 2002 45 114 117 10.1053/jinf.2002.1024 12217717 34. Lundblom K. Jung K. Kalin M. Lemierre syndrome caused by co-infection by Arcanobacterium haemolyticum Fusobacterium necrophorum Infect. 2010 38 427 429 10.1007/s15010-010-0046-8 20661621 35. Carlson P. Korpela J. Walder M. Nyman M. Antimicrobial susceptibilities and biotypes of Arcanobacterium haemolyticum Eur. J. Clin. Microbiol. Infect. Dis. 1999 18 915 917 10.1007/s100960050432 10691208 36. Carlson P. Kontiainen S. Renkonen O.V. Antimicrobial susceptibility of Arcanobacterium haemolyticum Antimicrob. Agents Chemother. 1994 38 142 143 10.1128/AAC.38.1.142 8141569 PMC284411 37. Nyman M. Banck G. Thore M. Penicillin tolerance in Arcanobacterium haemolyticum J. Infect. Dis. 1990 161 261 265 10.1093/infdis/161.2.261 2105360 38. Banck G. Nyman M. Tonsillitis and rash associated with Corynebacterium haemolyticum J. Infect. Dis. 1986 154 1037 1040 10.1093/infdis/154.6.1037 3782868 39. Osterlund A. Are penicillin treatment failures in Arcanobacterium haemolyticum Scand. J. Infect. Dis. 1995 27 131 134 10.3109/00365549509018992 7660075 40. Clinical and Laboratory Standards Institute Performance Standards for Antimicrobial Susceptibility Testing CLSI Supplement M100 35th ed. Clinical and Laboratory Standards Institute Wayne, PA, USA 2025 41. European Committee on Antimicrobial Susceptibility Testing Clinical Breakpoints v.15.0 2025 Available online: https://www.eucast.org (accessed on 1 September 2025) 42. Veerman K. Goosen J. Spijkers K. Jager N. Heesterbeek P. Telgt D. Prolonged use of linezolid in bone and joint infections: A retrospective analysis of adverse effects J. Antimicrob. Chemother. 2023 78 2660 2666 10.1093/jac/dkad276 37681570 PMC10631826 43. Cojutti P.G. Merelli M. Bassetti M. Pea F. Proactive therapeutic drug monitoring (TDM) may be helpful in managing long-term treatment with linezolid safely: Findings from a monocentric, prospective, open-label, interventional study J. Antimicrob. Chemother. 2019 74 3588 3595 10.1093/jac/dkz374 31504570 44. Kobayashi S. Numata R. Machino-Ohtsuka T. Suzuki H. Ishizu T. Successful Management of Infective Endocarditis utilizing Rapid High-performance Liquid Chromatography-based Therapeutic Drug Monitoring: Balancing Linezolid Efficacy and Thrombocytopenia Risk Intern. Med. 2025 Epub ahead of print 10.2169/internalmedicine.5890-25 40866257 Figure 1 Right orbital cellulitis with periorbital abscess, proptosis, and associated sinusitis. ( A B C Figure 2 Magnetic resonance of the right frontal lobe showing cerebritis and abscess with ring enhancement and midline shift. ( A,B C D Figure 3 Magnetic resonance follow-up 40 days after surgical drainage and targeted antibiotic therapy. ( A B C microorganisms-13-02208-t001_Table 1 Table 1 Cases of A. haemolyticum Gender Organisms Focus of Infection Intracranial Antibiotic Treatment Duration of Treatment Ref. F 16  A.haemolyticum, Bacteroides sp. sp. Sinusitis, Subdural empyema, cerebral abscess Vancomycin, ceftriaxone, metronidazole, amoxicillin/clavulanate 6 weeks [ 1 M 17  A.haemolyticum, Fusobacterium necrophorum Sinusitis Meningitis, subdural empyema, cerebral edema Vancomycin, cefepime, metronidazole 3 days (terminated due to fatal cerebral edema) [ 2 M 21  A.haemolyticum, F. necrophorum, Streptococcus anginosus Pharyngitis and sinusitis Subdural empyema, meningitis, cerebritis, cerebral abscess Vancomycin, ceftriaxone, metronidazole, azithromycin, oral amoxicillin 6 weeks IV followed by 3 months oral [ 5 F 21  A.haemolyticum Endocarditis Cerebral abscess, intracerebral hemorrhage Vancomycin, ceftriaxone, metronidazole, gentamicin 6 weeks [ 15 M 24  A.haemolyticum, Propionibacterium avidum Pharyngitis, Cerebral abscess Ceftriaxone, metronidazole 7 weeks [ 17 M 18  A.haemolyticum Dental extraction Cerebral abscess Ceftriaxone, penicillin G 4 weeks [ 18 M 20 A.haemolyticum, Sinusitis Cerebral abscesses, subdural empyema, meningitis Ceftriaxone, metronidazole 9 weeks [ 19 M 15  A.haemolyticum, F. necrophorum Tonsillitis, sinusitis Meningitis, abducent palsy Cefotaxime, metronidazole Not reported [ 20 M 58  A.haemolyticum Not reported, immunocompromised Meningitis Teicoplanin, penicillin G, ceftazidime 16 days (discharge a.m.a.) [ 21 M 50  A.haemolyticum Infective endocarditis Cerebritis, cerebral abscess, intracerebral haemmorrhage Penicillin G 7 days (fatal intracerebral hemorrhage) [ 22 M 24  A.haemolyticum Sinusitis Meningitis, abducent palsy Gentamicin, ampicillin, metronidazole, probenecid Not reported [ 23 M 11  A.haemolyticum, bacteroides melanogenicus Not reported Cerebral abscess Penicillin G, metronidazole Not reported [ 24 M 17  A.haemolyticum, F. necrophorum Not reported Meningitis, cerebral abscess, abducent palsy Cephalothin, gentamicin, chloramphenicol 2 days (fatal cerebral abscess) [ 25 M 16  A.haemolyticum Not reported Cerebral abscess Penicillin G Not reported [ 26 M 65  A.haemolyticum, B. fragilis Not reported Meningitis, encephalitis Penicillin, cloxacillin Not reported [ 27 M 19  A.haemolyticum Sinusitis, orbital cellulitis Meningitis, cerebritis, intracranial collection, delayed cerebral ischemia Not reported 40 days IV [ 28 M 54  A.haemolyticum Poor dental conditions Cerebral abscess Amoxicillin, metronidazole 10 days IV + 3 weeks oral [ 29 EBV: Epstein–Barr virus; a.m.a.: against medical advice; IV: intravenously. ",
  "metadata": {
    "Title of this paper": "Successful Management of Infective Endocarditis utilizing Rapid High-performance Liquid Chromatography-based Therapeutic Drug Monitoring: Balancing Linezolid Efficacy and Thrombocytopenia Risk",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472863/"
  }
}