{
  "title": "Paper_933",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12485055 PMC12485055.1 12485055 12485055 41028752 10.1038/s41467-025-63806-3 63806 1 Article Cell-type-specific functionality encoded within the intrinsically disordered regions of OCT4 http://orcid.org/0000-0001-8850-2248 Ozkan Burak 1 2 de Anda Mitzy Rios 1 2 Hall-Ponsele Elisa 1 2 Migueles Maria Rosa Portero 1 Alshaikh Amani 1 2 3 Hanzevacki Marta 1 2 Naama Moriyah 4 Furlong Katharine 1 2 http://orcid.org/0000-0002-3726-390X Roberts Gareth A. 1 2 Beniazza Meryam 1 Huynh My Linh 1 O’Dwyer Michael R. 1 2 Yiakoumi Sonia 1 http://orcid.org/0000-0002-4376-8242 Spanos Christos 5 Yassen Hazar 4 http://orcid.org/0000-0001-5946-8415 Kaji Keisuke 1 Niwa Hitoshi 6 7 http://orcid.org/0000-0002-7970-5163 Buganim Yosef 4 http://orcid.org/0000-0002-4018-9480 Lowell Sally 1 2 http://orcid.org/0000-0002-3666-3266 Soufi Abdenour Abdenour.Soufi@ed.ac.uk 1 2 1 https://ror.org/01nrxwf90 grid.4305.2 0000 0004 1936 7988 Institute of Regeneration and Repair, Centre for Regenerative Medicine, University of Edinburgh, 2 https://ror.org/01nrxwf90 grid.4305.2 0000 0004 1936 7988 Institute of Stem Cell Research, School of Biological Sciences, University of Edinburgh, 3 https://ror.org/05tdz6m39 grid.452562.2 0000 0000 8808 6435 King Abdulaziz City for Science and Technology Health Sector, 4 https://ror.org/03qxff017 grid.9619.7 0000 0004 1937 0538 Department of Developmental Biology and Cancer Research, Institute for Medical Research Israel-Canada, The Hebrew University-Hadassah Medical School, 5 6 https://ror.org/02cgss904 grid.274841.c 0000 0001 0660 6749 Institute of Molecular Embryology and Genetics, Kumamoto University, 7 https://ror.org/023rffy11 grid.508743.d 0000 0004 7434 0753 RIKEN Center for Developmental Biology, 30 9 2025 2025 16 478256 8647 11 4 2025 29 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ The cell-type-specific function of transcription factors (TFs) is crucial for determining cellular identity. However, it is unclear how a single TF can function specifically in different cell types. Here, we define the molecular features that enable OCT4 to reprogram somatic cells into pluripotent or trophoblast stem cells, maintain the self-renewal of embryonic stem cells (ESCs), and drive lineage commitment during early embryonic development. Embedded within the intrinsically disordered regions (IDRs) of OCT4, we uncover s li p e r Here they perform a systematic dissection of OCT4 and reveal how intrinsically disordered regions can be used to serve specific functions during reprogramming and embryonic development. This can be exploited to engineer more efficient and specific reprogramming factors. Subject terms Reprogramming Pluripotency Nucleosomes https://doi.org/10.13039/501100000265 RCUK | Medical Research Council (MRC) https://doi.org/10.13039/501100000289 Cancer Research UK (CRUK) https://doi.org/10.13039/501100009187 RCUK | MRC | Medical Research Foundation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Cell identity is defined by the functions of transcription factors (TFs) that are specific to each cell type and can operate differently depending on the cellular context 1 2 3 10 11 14 15 16 17 18 5 16 19 29 TFs are modular proteins that contain functionally independent domains 30 30 33 S HD 34 35 35 44 45 50 51 52 55 37 51 52 56 In this work, we hypothesised that the various functions of OCT4 during reprogramming into iPSCs and iTSCs, pluripotency maintenance, and lineage commitment could be dissected apart from each other at subdomain resolution. We have therefore systematically dissected OCT4 to show that defined modules within OCT4-IDRs contribute to the selective and diverse functions of OCT4. Results Short linear peptides within OCT4 are required for reprogramming To define the functional segments of OCT4 that are required for reprogramming to iPSCs, at the sub-domain resolution, we used a library of OCT4 mutants ( n 1a 44 1b, c 1c, d 3 S HD 1d 44 1 1d 1a, b 1d 35 1e, f 1g, h Fig. 1 OCT4 employs distinct domains to induce and maintain pluripotency. a S HD d b c n d e Pou5f1 f . g h d g i j i k i n d g k n j Interestingly, sequential deletions (3 or more) appearing as defined patches within OCT4-NTD and -CTD substantially impaired the reprogramming capacity of OCT4 (shaded in Fig. 1d S Li P E R 1d OCT4 SLiPERs are dispensable for ESC self-renewal To assess whether OCT4 uses the same domains for reprogramming as ES self-renewal, we measured the ability of the OCT4 mutants to rescue self-renewal in a conditionally null Pou5F1 6 37 Pou5F1 Pou5F1 2a Pou5F1 1e, f S HD 1g 1g 2 37 1g 2 1h To define what constitutes functional SLiPERs, we examined the cumulative effects of merging the sequential 5 a.a. deletions on reprogramming and ESC self-renewal (Fig. 1i 1i 3 1j, k 1j, k 1j, k 1j, k Pluripotent and trophoblast stem cells are induced by different OCT4 domains To investigate whether OCT4-SLiPERs display similar functions in human and mouse reprogramming, we tested one SLiPER mutant (lin29-42) and one nonSLiPER mutant (lin95-117) individually, and three nonSLiPERs mutations together (lin-mini) in reprogramming human adult fibroblasts (hFibs) to hiPSCs. Indeed, OCT4 nonSLiPER mutants displayed enhanced reprogramming compared to OCT4 WT, unlike the SLiPER mutant, which was reprogramming-deficient (Fig. 2a, b 4a, b 2c, d 4c 4d, e Fig. 2 Inducing pluripotent and trophoblast stem cells requires functionally distinct OCT4 domains. a b c d e f g h n a c f h n b n g OCT4 along with GATA3, KLF4 and c-MYC (OGKM) were shown to induce trophoblast stem cells (hiTSCs) from human fibroblasts independently of pluripotency (Fig. 2e 15 2f 2g 4f 2f, g 4f 2h OCT4-SLiPERs exert specific functions independent of LLPS Both SLiPERs and nonSLiPERs are located within OCT4-IDRs, displaying similar disorder propensity (blue line in Fig. 3a 57 3b 5a Fig. 3 Removing SLiPERs drives aberrant OCT4 binding to accessible chromatin during reprogramming. a b c d e LIN28B LIN28B LIN28B LIN28B f g n h g . i n c n i t P c i n b n e Next, we examined whether OCT4-SLiPER mutants impede reprogramming by impairing the transactivation function of OCT4, which was shown to be important for inducing and maintaining pluripotency 37 51 58 FGF4 UTF1 3c 6 40 3c 3c 6 5b, c 51 5b, c It is noteworthy that IDRs can contain molecular recognition features (MoRFs), which are short regions that permit interaction with structured proteins and undergo disorder-to-order transitions (induced folding), indicative of their functionality 59 3a 60 3d 61 5d 62 Removing SLiPERs drive aberrant OCT4 binding during reprogramming We have previously shown that OCT4 interaction with nucleosomes is essential for reprogramming 43 44 63 5e 43 3e 3e Next, we examined whether SLiPERs mediate OCT4 binding with other protein partners on chromatin using chromatin immunoprecipitation combined with selective isolation of chromatin associated proteins (ChIP-SICAP), which simultaneously maps genome occupancy and chromatin-bound protein interactors (Fig. 3f 46 5f, g 5h 63 65 n 3g n n 3g 3g, h 3g 5i, j 3i OCT4 SLiPERs recruit a unique set of proteins to chromatin in reprogramming Next, we used mass-spectroscopy (MS) to identify proteins associated with OCT4 WT, lin29-42, lin95-117 and lin-mini mutants in early reprogramming and colocalise with OCT4 in hESCs. After filtering non-specific proteins that interact with OCT4 antibody in hFibs (in the absence of OCT4) or interact with IgG in hESCs, the identified proteins from two biological replicates showed significant overlap (Supplementary Fig. 6a 6b 4a Fig. 4 OCT4 engages a unique set of proteins on chromatin during reprogramming. a n b t P P c n n d n Principal component analysis (PCA) showed that proteins associated with OCT4 WT and mutants in early reprogramming form a distinct cluster from those that colocalise with OCT4 in hESCs, which are also different from non-specific interactors (Supplementary Fig. 6c 4b 4b 64 66 68 6d 63 4b 6d 46 69 4a 6d 6 4c 4c Next, we compared the interactomes of OCT4 WT, lin95-117, and lin29-42 mutants in early reprogramming and hESCs. We only considered proteins that are consistent in both replicates across all samples ( n 4d n 4d n 4d 48 70 73 To identify protein partners mediated by OCT4-SLiPERs that are required for inducing but not maintaining pluripotency, we identified a set of 7 proteins (cluster 8) that interact with OCT4 WT, lin95-117, and lin-mini mutants (reprogramming-efficient) but not with OCT4-lin29-42 mutants (reprogramming-deficient) and not in hESCs (yellow box in Fig. 4d 74 TNIP2 rescues the reprogramming activity of OCT4-SLiPER mutant To examine the functional contribution of OCT4-interactors in cluster 8 during reprogramming, we used reprogrammable-MEFs (cas9-TNG-MKOS-MEFS) containing a constitutive Cas9 expression construct into the Rosa26 locus, a Nanog-GFP-IRES-Puro knock-in reporter, and Dox-inducible MKOS-IRES-mOrange polycistrionic reprogramming cassette in the Sp3 5a, b 73 Kdm4b Stat3 5c, d 7a 75 Ufd1l Mcmbp 7b, c 7d Ufd1l Mcmbp 7e, f Ufd1l Mcmbp 76 77 Ufd1l Mcmbp Fig. 5 TNIP2 rescues the reprogramming activity of OCT4-SLiPER mutant. a Nanog Elf-a b c d c e f g h g i TNIP2 STAT3 j i k 3g i n n c f j n g n d n h d t h P Next, we investigated the chromatin localisation of cluster 8 proteins by isolating the cytoplasmic, nuclear (soluble), and the chromatin fractions from hESCs, OSKM-48h expressing OCT4-WT and mutants, and hFibs (Supplementary Fig. 7g 5e 5e Due to the unique role of TNIP2 in reprogramming, we set out to illustrate the mechanism by which OCT4-SLiPERs-TNIP2 interaction mediates reprogramming. TNIP2, also known as A20-binding inhibitor of NF-κB (ABIN-2), is classified as a cytoplasmic zinc-finger protein that functions as a negative regulator of NF-κB activation in response to multiple inflammatory stimuli 78 79 5f lin29-42 lin29-42 5f 5g, h The binding of TNIP2 to linear polyubiquitin plays a crucial role in mediating NF-κB signalling in the cytoplasm 80 81 ub lin-29-42 80 ub lin-29-42 5g, h 79 5i 5j 5k 5k OCT4 SLiPERs are required for embryos to develop through late gestation Since OCT4 is also important for lineage commitment, we aimed to examine whether OCT4 SLiPERs are required during the transition of pluripotency from the naïve to a primed state in the pre and post-implantation epiblast, respectively, and the transition out of pluripotency at the onset of germ layer differentiation during late gastrulation 82 83 Pou5F1 6a 84 Pou5F1 lin/Δ 8a Pou5F1 lin/Δ 6b 8b 1 Pou5F1 lin/Δ Pou5F1 lin/Δ 8c 8d Pou5F1 lin/Δ Fig. 6 OCT4 SLiPERs are required for embryos to develop beyond late gastrulation. a Pou5f1 b Pou5f1 lin/ Pou5f1 wt/wt c Pou5f1 lin/ Pou5f1 wt/wt d c e Pou5f1 wt/wt Pou5f1 lin/ f c g Pou5f1 lin/ Pou5f1 wt/wt h Pou5f1 wt/wt i Pou5f1 lin/ j Pou5f1 lin/ h n P n b h i n c d f To further evaluate the pluripotency of Pou5F1 lin/Δ Pou5F1 lin/Δ Pou5F1 lin/Δ 6 Pou5f1 Pou5f1 -/- 5 Pou5F1 lin/Δ 6 8e, f Pou5F1 21 Pou5F1 lin/Δ Pou5F1 lin/Δ Pou5F1 wt/wt 6i, j Pou5F1 lin/Δ Removing SLiPERs induces aberrant OCT4 binding in ES cells Next, we sought to examine whether mutations in OCT4-SLiPERs can cause transcriptional and chromatin changes at the pluripotency stages that may be responsible for mis-regulating ESC differentiation. We have therefore measured gene expression of Pou5F1 lin/ Pou5F1 lin/ 7a 9a 7b 7b, c 9b Pou5F1 lin/ 85 Fig. 7 Removing SLiPERs drives aberrant OCT4 binding in ESCs. a Pou5f1 lin/ Pou5f1 wt/wt b Pou5f1 lin/ Pou5f1 wt/wt P t c Nanog Pou5f1 lin/ Pou5f1 wt/wt Nanog d Pou5f1 lin/ Pou5f1 wt/wt P t n e n f e n g f h e Next, we measured chromatin accessibility in Pou5F1 lin/ Pou5F1 lin/ 7c, d n n 7e n Nanog Nanog 7c 65 7f 7f, g 7h Pou5F1 lin/ Nanog Discussion The combinatorial function of TFs underlies the basic principle of cellular identity, and this simple rule has been consistently used to reprogram differentiated cells across all lineages 1 2 33 36 86 87 88 89 90 In this study, we systematically dissected OCT4 to define the molecular basis that elicits its multifaceted function. We discover SLiPERs within OCT4-IDRs to play distinct roles in reprogramming and pluripotency maintenance, distinguishing between the two processes. OCT4 SLiPERs are crucial for reprogramming but can be dispensable for supporting ESC self-renewal. Interestingly, OCT4 SLiPERs are required for ESCs to contribute normally to embryonic development beyond gastrulation. Our data support the notion that OCT4 adapts its IDRs not only to induce pluripotency but also to promote lineage commitment, suggesting a similar mechanism at play 16 19 21 26 91 92 Our results demonstrate that OCT4-SLiPERs influence genomic interactions by serving as recruitment interfaces. Notably, OCT4 colocalises with different proteins on chromatin during early reprogramming and ESC self-renewal, highlighting the distinct roles of OCT4 in these two processes. It is intriguing to find that UFD1L and TNIP2 are translocated from the cytoplasm to chromatin through their interaction with OCT4-SLiPERs during reprogramming. Such interactions enable OCT4 to exploit the unusual transactivation role of TNIP2 during reprogramming 79 93 Recent studies have demonstrated the prevalence of IDRs, particularly among chromatin-associated proteins such as TFs 94 96 96 97 60 98 100 96 99 101 Methods Ethical compliance hESCs MasterShef-7 line was established in Prof. Harry Moore’s laboratory at the University of Sheffield. The use of hESCs was approved by the Steering Committee for the UK Stem Cell Bank and for the Use of Stem Cell Lines (ref: SCSC15-09). Human primary fibroblast cell lines were derived in RBiomedical, Edinburgh, UK, from skin samples from anonymous donors undergoing routine surgery at the Edinburgh Royal Infirmary, Little France, UK, under ethical approval 09/MRE00/91. All reprogramming experiments have been approved by the University of Edinburgh SBS ethics committee (asoufi-0001). All animal experiments for the iPSC generation from MEFs and chimera assays were approved by the University of Edinburgh Animal Welfare and Ethical Review Body, performed at the University of Edinburgh, and carried out according to regulations specified by the Home Office and Project License. Teratoma assays were performed in compliance with the joint ethics committee (IACUC) of the Hebrew University and Hadassah Medical Center and the National Ethics Committee (Israel Health Ministry) and NIH, which approved the study protocol for animal welfare. The Hebrew University is an AAALAC International-accredited institute. All animals were housed and treated in accordance with the veterinary guidelines and regulations of the University of Edinburgh and the Hebrew University. DNA constructs The 119 OCT4 deletion mutants were synthesized as linear DNA fragments by Twist Bioscience (San Francisco, CA), each containing five amino acid deletion tiled with a two amino acid overlap (see Supplementary Data 1 2 The lentivirus vectors used in iPSC reprograming studies were constructed by sub-cloning OCT4 variants into the FUW-tet-O plasmids. Each OCT4 deletion mutant was amplified from the corresponding pET28-OCT4 plasmid by PCR using set of primers containing EcoRI and XbaI (see Supplementary Data 2 102 37 2 The selected nine alanine stretch mutants of OCT4, in which a contiguous sequence of five alanine residues substituted for five naturally occurring residues, were generated by site-directed mutagenesis of pET28b-OCT4 plasmid using QuikChange II kit (Stratagene). The alanine stretch derivatives of OCT4 were subsequently sub-cloned into FUW-tet-O-XbaI and pCAG-IRES-Puro plasmids as describe above. The truncated and linker substitution OCT4 mutants were all synthesized as DNA fragments and cloned into a Twist vector by Twist Bioscience (San Francisco, CA). The resulting OCT4 mutants were subsequently sub-cloned into pET28B, FUW-tet-O-XbaI and pCAG-IRES-Puro plasmids as describe above. For knocking out gene candidates in mouse reprogramming, sgRNA sequences were obtained from a previously published sgRNA mouse library 103 ′ ′ ′ 3 ° The human FUW-TetO-OCT4 (Addgene plasmid #20726), FUW-TetO-SOX2 (Addgene plasmid #20724), FUW-TetO-KLF4 (Addgene plasmid #20725) and FUW-TetO-CMYC (Addgene plasmid #20723) lentivirus vectors were generated by the Rudolf Jaenisch lab (Hockemeyer et al., 2008) and obtained from Addgene. The pWPT-rtTA2M2 vector was generated by ligating the rtTA2M2 gene, isolated from the pUHrT 62-1 vector (Urlinger et al., 2000), into the pWPT-GFP backbone vector after removing GFP (Kim et al., 2013). pSIN4-EF2-O2S and pSIN4-CMV-K2M plasmids were a gift from James Thomson and deposited in Addgene (Addgene plasmid #21162 and #21164, respectively). The FUW-TetO-GATA3 expression vector was generated by cloning the GATA3 open reading frame into the pMINI vector (NEB) and then restricted with EcoRI or MfeI and inserted into the linearized FUW-TetO empty plasmid. Cell culture MEF cells were cultured in MEF medium containing GMEM medium supplemented with 10% FCS, 1 mM sodium pyruvate (#11360-039, Gibco), 1 mM glutamine (#25030-024, Gibco), and 5.7 ml MEM 100X Non-Essential Amino Acids Solution (#11140050, Gibco), 50 µM 2-mercaptoethanol (#11528926; Gibco) at 37 °C and 5% CO 2 2 2 2 2 2 Lentivirus production To produce lentiviral supernatant, 7.5 × 10 5 2 2 g To produce concentrated lentivirus for ChIP-seq and ChIP-SICAP experiments, lentivirus supernatant was prepared from 3 × 10 6 g 8 Mouse iPSC reprogramming Early passage MEFs (5 × 10 5 2 4 For iPSC colony counting, cells were fixed and immuno-stained for Nanog and DAPI on day 14. Whole wells were imaged at a resolution of 4 µm/pixel using a CELIGO image cytometer (Nexcelom). DAPI-positive colonies were counted if covering an area larger than 8 adjacent pixels. Nanog-positive colonies were counted if at least 10% of the DAPI signal overlapped with the Nanog signal. For generating clonal iPSC lines, individual iPSC colonies were picked on day 14 (see above) and transferred to a U-bottom 96-well plate containing 0.25% Trypsin-EDTA (#25200056; Gibco). After 5 min incubation at 37 °C, trypsinized cells were seeded to a gelatinized 24-well culture plate (#CLS3527; Corning). Undifferentiated iPSCs were subsequently transferred to larger culture dishes as they became confluent. At least 4 independent cell lines were generated from each condition and cryo-preserved using Mr. Frosty containers (#C1562; Sigma-Aldrich). Human iPSC reprogramming Early passage (P5) human adult fibroblasts (5 × 10 5 2 5 4 5 2 2 To measure the reprogramming efficiency, colonies were fixed and immunostained for NANOG and DAPI on day 18. Human iPSC colonies were detected by imaging whole wells at a resolution of 4 µm/pixel using a CELIGO image cytometer. Nanog-positive colonies were counted if at least 10% of the DAPI signal overlapped with the Nanog signal. To generate a human iPS lines, adult HFibs were reprogrammed as explained above but emerging hiPSC colonies were cultured for 21–23 days in hES medium. The colonies were collected by incubating with Accutase for 10 min at 37 °C and then physically separated from iMEFs using a sterile hypodermic needle. Collected colonies were seeded on laminin-coated plates and maintained in Essential 8 medium (Gibco, 15190617) for at least 8 passages before being used in subsequent experiments or cryo-preserved. Reprogramming human fibroblasts to hiTSCs For infection, replication incompetent lentiviruses containing the OGKM reprogramming factors were packaged with a lentiviral packaging mix (7.5 µg psPAX2 and 2.5 µg pDGM.2) in 293T cells and collected 48, 60, and 72 h after transfection. The supernatants were filtered through a 0.45 µm filter, supplemented with 8 µg/ml of polybrene, and then used to infect human fibroblasts. Twelve hours following the fourth infection, medium was replaced with basic reprogramming medium (BRM) consisting of fresh DMEM containing 10%FBS, 1% L-glutamine and 1% penicillin-streptomycin. Six hours after medium replacement 2 µg/ml doxycycline (dox) was added to the medium. The reprogramming medium was changed every other day. After 14 days in BRM with dox, the medium was replaced with 50% BRM and 50% hTSC medium as described in ref. 104 For analysis of mRNA expression using qPCR, total RNA was isolated using the Macherey-Nagel kit (Ornat). 500–2000ng of total RNA was reverse transcribed using iScript cDNA Synthesis kit (Bio-Rad). Quantitative PCR analysis was performed in duplicates using 1/100 of the reverse transcription reaction in a StepOnePlus (Applied Biosystems) with SYBR green Fast qPCR Mix (Applied Biosystems). Specific primers were designed for the different genes. All quantitative real-time PCR experiments were normalized to the expression of GAPDH and presented as a mean ± standard deviation of two duplicate runs. Rescuing mouse ES cell self-renewal ZHBTc4.1 ES cells were maintained in GMEM supplemented with 10% FCS, 1 mM glutamine/pyruvate, Non-essential Amino Acids, Penicillin/Streptomycin and 0.05 mM 2-mercaptoethanol on porcine gelatine-coated 6-well plates. One million cells were seeded and transfected 3–4 h later with 2.5 µg plasmid DNA using Lipofectamine 3000 (#L3000008; ThermoScientific) in OptiMEM reduced serum medium (#31985062; ThermoScientific) following the protocol recommended by the manufacturer. After 24 h, cells were prepared for induction by harvesting and re-plating in two series of triplicate wells (10 5 Establishment of Pou5f1 E14tg2α mES cells (early passage 4) were cultured in ES media on 0.1% gelatin coated 10-cm plates. The mES cells were cultured until forming rounded colonies and the media was changed 4–12 h prior to transfection. CRISPR-cas9 RNP complexes were prepared for four different reactions: (1) Pou5f1 Pou5f1 Pou5f1 Pou5f1 Mm.Cas9.Pou5f1.1.AX: 5′-ACGAGTGGAAAGCAACTCAG-3′ The Cas9 electroporation mix was prepared by combining the 2.4 µl of crRNA/tracrRNA mix with 1.1 µl of recombinant Cas9 protein (9 µg/µl), and 6.5 µl of single-stranded DNA (ssDNA, 120 µM, IDT) for the knock-in reaction. The mixtures were incubated at room temperature for 10 min and then placed on ice. The ssDNA sequence used as a template for HDR is shown below: Pou5f1-lin29-42_homology_50bp: TCTCACCCCCACCAGGTGGGGGTGATGGGTCAGCAGGGCTGGAGCCGGGCggCggaggCagcggaggCggaagcGGTGGGCCTGGAATCGGACCAGGCTCAGAGGTATTGGGGATCTCCCCATG For each reaction, 7 × 10 5 ® The transfected cells were harvested using TrypLE (ThermoScientific) when reaching ~90% confluency, ~48 h post electroporation. Half of the cells were harvested for genomic DNA (gDNA) extraction, while the other half was plated as single cells for establishing clonal mES lines. DNA extraction was performed using the DNeasy® Blood & Tissue Kit (Qiagen), following the manufacturer’s protocol. DNA was eluted in 70 µl of elution buffer, and the concentrations were measured using a Nanodrop spectrophotometer (ThermoScientific). For assessing knock-in and knout efficiencies, a 519 bp DNA fragment containing the targeted Pou5f1 Pou5f1-start-FWD: 5′-ATGGCTGGACACCTGGCTTC-3′, Pou5f1-exon1-RVS : To evaluate the CRISPR knock-out and knock-in, the resulting PCR DNA product was sequenced and analysed by TIDE and TIDER assays 105 To establish clonal ES-lines, the remaining transfected mES cells were resuspended in PBS containing 2% FCS (FACS buffer) to a final density of 1 × 10 6 2 To screen for colonies containing the Pou5f1-lin29-42 knock-in mutation, two PCRs were performed for each colony using the Pou5f1-mutant-specific-FWD and Pou5f1-WT-specific-FWD primers, each paired with the Pou5f1-exon1-RVS primer. The gDNA extracted form wildtype mES cells and the pool transfected cells were used as controls. Colonies that generated a PCR product only when using the Pou5f1-mutant-specific-FWD primer, were considered to contain mutations within Pou5f1 in both alleles. The primer sequences are listed below: Pou5f1-mutant-specific-FWD: 5′-GGAGGCAGCGGAGGCGGAAG-3′ Pou5f1-WT-specific-FWD primers: 5′-GAACCTGGCTAAGCTTCCAA-3′ Pou5f1-exon1-RVS: 5′-TAGGCCCAGTCCAACCTGAGGTC-3′ ES colonies with potential Pou5f1-lin29-42 knock-in mutation as assed by PCR were further expanded and the levels of OCT4 protein was measured by Western blot analysis. Only colonies that showed similar OCT4 protein levels to wildtype were taken forward for genotype analysis. Next, gDNA was extracted from the harvested cell pellets using the Qiagen DNeasy Blood & Tissue Kit (Qiagen), which was used to amply a 519 bp DNA fragment as explained above. The resulting DNA fragment from each mES colony was inserted into the pCR®-Blunt II-TOPO® vector using the Zero Blunt™ TOPO™ Cloning Kit following the manufacturer’s protocol (ThermoScientific). Briefly, the PCR product (4 µl), Salt Solution (1 µl) and the TOPO vector (1 µl) were mixed and incubated for 10 min at room temperature, after which 2 µl from each reaction was added per vial of One Shot® chemically competent Escherichia coli Mouse chimaera F1 female mice were superovulated (100 IU/ml PMSG, ProSpec, and 100 IU/ml HCG, Intervet, intraperitoneal injections 48 h apart) and crossed with wild-type stud male mice. Pregnant mice were culled at 2.5 dpc. by cervical dislocation, ovaries with oviducts were dissected and collected in pre-warmed M2 medium (Sigma-Aldrich). Oviducts were flushed using PBS and a 20-gauge needle attached to a 1 ml syringe and filled with PB1 medium. The blastomere-stage embryos (2.5 dpc) were collected and washed in PB1 medium, the proteinaceous zona pellucida was removed using acidic Tyrode’s solution (Sigma-Aldrich). The zona pellucida–free embryos were washed with KSOM and transferred to a plate with depression wells (aggregation dish). A small clump (8–15 cells) of mES cells (donor GFP-positive) were added to each embryo using a 50 µm transfer pipette. Embryos were cultured in KSOM (Sigma-Aldrich) overnight at 37 °C in 5% CO 2 For some experiments, embryos were matured into blastocysts following 24 h of culture in KSOM (Sigma-Aldrich) in vitro, then fixed, processed for immunohistochemistry, and examined by confocal microscopy. Immunofluorescence and confocal microscopy of embryos Blastocysts and pre-implantation embryos were fixed with 4% PFA in PBS for 15 min at room temperature, rinsed in PBS containing 3 mg/mL polyvinylpyrrolidone (PBS/PVP) and permeabilized with PBS/PVP containing 0.25% Triton X-100 for 30 min. Blocking was performed in embryo blocking buffer comprising PBS supplemented with 0.1% BSA, 0.01% Tween20 and 3% donkey serum for 2–3 h at 4 °C. They were inmunostained and rinsed three times for 15 min in blocking buffer. Blastocysts and pre-implantation embryos were transferred in small drops of blocking buffer onto poly-D-lysine-coated glass-bottom dishes under mineral oil and imaged using a Leica SP8 confocal microscope. Images were processed using Fiji. Embryos were fixed with 4% formaldehyde/PBS/0.1% Triton X-100 (Sigma-Aldrich) for 20 (peri-implantation) or 30 (post-implantation) min and quenched with 50 mM ammonium chloride. Permeabilization was carried out for 10 min in PBS/0.1% Triton X-100. The embryos were incubated in primary antibody in 3% donkey serum/PBS/0.1% Triton X-100 (Nanog eBioscience, #14-5761-80; GFP Abcam, #ab13970; LamnB Sigma, #L9393) overnight and subjected to 3 washes in PBS/0.1% Triton X-100. Secondary antibodies were applied subsequently for 2 h to overnight, followed by 3 washes in PBS/0.1% Triton X-100. Embryos were then stained with DAPI (Biotium), mounted in PBS droplets covered with mineral oil in microscope rings, and imaged on a Leica SP8 confocal microscope. Following staining, chimaeric embryos were dehydrated in methanol series in PBS/0.1% Triton X-100, clarified in 50% methanol/50% BABB (benzyl alcohol:benzyl benzoate 1:2 ratio, Alfa Aesar and Sigma), transferred into 100% BABB into ibidi plates and imaged on a Leica SP8 confocal microscope. Immunostaining Cells were fixed in phosphate-buffered saline (PBS) containing 4% paraformaldehyde for 10 min at room temperature. Fixed cells were permeabilized with 0.1% Triton X-100 for 10 min at room temperature and blocked with 4% Donkey (#G9663; Sigma-Aldrich) or Goat (#G9023; Sigma-Aldrich) serum in PBS for at least 60 min at room temperature. Blocked cells were incubated overnight in blocking buffer containing an appropriate concentration of primary antibody: anti-OCT4 1 µg/ml (#ab19857; Abcam), anti-SOX2 0.5 µg/ml (#AF2018; R&D systems), anti-KLF4 0.5 µg/ml (#AF3640, R&D systems), anti-MYC 1 µg/ml (#AF3696; R&D systems), anti-Nanog 0.5 µg/ml (#14-5761-80; eBioscience), or anti-NANOG (ab109250, Abcam). Antibody stained cells were washed 3 times with PBS containing 0.05% Tween-20. After washing, cells were incubated with an appropriate secondary antibody in PBS: donkey Anti-Rat IgG H&L 1 µg/ml (#A21208; Invitrogen), donkey anti-Rat IgG H&L 1 µg/ml (#A21209; Invitrogen), donkey Anti-Goat IgG H&L 1 µg/ml (#ab150129 Abcam), donkey Anti-Goat IgG H&L 1 µg/ml (#ab150130, Abcam), Goat Anti-Rabbit IgG H&L 1 µg/ml (#ab150077; Abcam), or Goat Anti-Rabbit IgG H&L 1 µg/ml (#ab150080; Abcam) for 2 h at room temperature. Nuclei were stained with 3 mg/ml 4,6-diamidino-2-phenylindole (DAPI) (#D3571; Invitrogen) for 10 min at room temperature. Fluorescence images were taken using the IRIS Digital Cell Imaging System ( I10999 RNA isolation and quantitative PCR analysis RNA was harvested from cells using a RNeasy Mini Kit (#74106; Qiagen). The concentration of the harvested RNA was measured using a NanoDrop device. cDNA was synthesized from 500 ng RNA using High-Capacity cDNA Reverse Transcription kit (#4368814; Applied Biosystems). A 15-times diluted cDNA sample was amplified using a Roche LightCycler® 480 Instrument II and the Power SYBR Green PCR mix (#4367659; Applied Biosystems) under the following conditions: 50 °C for 4 min, 95 °C for 10 min, followed by 40 cycles of 95 °C for 15 s, 60 °C for 15 s, 72 °C for 45 s. Sequences of the oligonucleotide primers used for qPCR are given in Supplementary Data 4 Early reprogramming human fibroblasts (OSKM48hr) HFibs were plated at a density of 5 × 10 5 6 2 Chromatin preparation for ChIP-SICAP and ChIP-seq Chromatin fragments were prepared from 15 cm dishes of hES, HFibs dox-induced for 48 h with OSKM and uninfected HFibs cells. Cells were washed 3X with PBS at RT and left in PBS/MgCl 2 2 g Before nuclear extraction, the cell pellet was thawed on ice for 2–3 h and resuspended in 10 ml filtered, ice-cold lysis buffer (50 mM HEPES-KOH pH 7.5, 140 mM NaCl, 1 mM EDTA, 10% glycerol, 0.5% NP-40, 0.25% Triton X-100 and 1 tablet of Complete protease inhibitor cocktail (Roche)). The suspension was gently mixed on a rocker at 4 °C for 10 min. The cells were disrupted using a 7 ml glass-Dounce homogeniser (80 strokes) on ice. The nuclei were pelleted by centrifugation (1350 × g g ChIP-seq For each ChIP, 35 µl Dyna Protein G magnetic beads (#10004D, ThermoScientific) were washed three times with 1 ml blocking solution (0.5% w/v BSA in PBS Tween-20). The beads were mixed with 10 µg anti-human OCT4 antibody (#ab19857; Abcam) and incubated on a rotating platform at 4 °C for at least 6 h. A 40 µg aliquot of double cross-linked and sonicated chromatin was mixed with the antibody saturated beads and incubated on a rotating platform at 4 °C overnight. The ChIP beads were transferred to a fresh tube, washed with 4X with 1 mL RIPA buffer (50 mM HEPES-KOH pH 7.6, 500 mM LiCl, 1 mM EDTA, 1% NP-40, 0.7% Na-deoxycholate). The ChIP beads were washed once with TE buffer (10 mM Tris-HCl pH 8, 1 mM EDTA) containing 50 mM NaCl. The bound-chromatin was eluted by incubating the ChIP beads in 210 µl elution buffer (50 mMTris-HCl pH 8, 10 mM EDTA, 1% SDS) at 65 °C for 30 min. The beads were pelleted by centrifugation at 16,000 × g Q32854 ChIP-seq library generation ChIP-DNA from three ChIP replicates were pooled together. The amount of DNA used in the library preparation ranged between 20 and 50 ng. Input DNA (20 ng) was generated by pooling equal amounts of input DNA from each condition. The DNA libraries were prepared using NEBNext Ultra II DNA Library Prep Kit (#E7645S; New England Biolabs) according to manufacturer’s instructions. Each library was uniquely barcoded by using NEBNext Multiplex Oligos for Illumina (Dual Index Primers Set 1) (#E7600S; New England Biolabs) as indicated. Size selection (~200 bp) of the DNA library was carried out using SpeedBeads, which comprise magnetic carboxylate modified particles (GE65152105050250; ThermoScientific). The ChIP-seq DNA library pool was generated by mixing an equal volume of each library. The quality of the DNA library was assessed using Agilent HS DNA Screen Tape and Reagents (#5067-5585; Agilent). The concentration of the ChIP-seq DNA library pool was determined to be 23.19 nM by Qubit Fluorometric Quantitation (# Q33230 ChIP-SICAP Method was adapted from ref. 46 g 106 g g g g g g SILAC HFibs and hESCs for SILAC were cultured using the SILAC Protein Quantitation Kit (LysC) – DMEM:F12 (# A33970, Thermo Fisher). HFibs were cultured in SILAC “heavy medium” consisting in DMEM:F12 for SILAC supplemented with 10% dialyzed Fetal Bovine Serum (FBS) for SILAC, 1 mM Sodium Pyruvate, 1 mM glutamine, 1X Non-Essential Amino Acids, 0.1 mM, 2-mercaptoethanol, 0.46 mM 13 6 g g In gel digestion For in-gel digestion, proteins were separated and concentrated on gel (NuPAGE Novex 4–12% Bis-Tris gel, Life Technologies), in NuPAGE buffer (MES) and visualised using InstantBlueTM stain (Sigma-Aldrich). The stained gel bands were excised into cubes ca. 1 mm and de-stained with 50 mM ammonium bicarbonate (Sigma Aldrich, UK) and 100% (v/v) acetonitrile (Sigma-Aldrich). Proteins were digested with trypsin, as described in Shevchenko et al. 107 -1 StageTip cleaning All samples digested either by FASP (ChIP-SICAP) or in gel-digestion (SILAC) were cleaned using StageTips as described by Rappsilber et al. 108 LC-MS and protein identification Peptides were eluted in 40 μL of 80% acetonitrile in 0.1% TFA and concentrated down to 1 μL by vacuum centrifugation (Concentrator 5301, Eppendorf). LC-MS/MS was performed by diluting samples into 5 μL with 0.1% TFA. LC-MS-analyses were performed on an Orbitrap Fusion Lumos Tribrid and on a Q Exactive mass spectrometers (both from ThermoScientific) both coupled on-line, to Ultimate 3000 RSLCnano Systems (Dionex, ThermoScientific). For both approaches, peptides were separated on a 50 cm EASY-Spray column (ThermoScientific) assembled on an EASY-Spray source (ThermoScientific) and operated at a constant temperature of 50 ° -1 -1 m z e 109 110 111 112 113 Western blot analysis Whole cell extracts were prepared by lysing cells using RIPA buffer (25 mM Tris HCl pH 7.5, 150 mM NaCl, 1% Na-deoxycholate, 1% NP-40, 0.1% SDS) supplemented with Complete protease inhibitor cocktail (#04693124001; Roche) and Halt phosphatase inhibitor cocktail (#78420; ThermoScientific). The protein concentrations of the lysates were quantified by BCA assay using a standard protocol. Proteins resolved by SDS-polyacrylamide gel electrophoresis were electroblotted onto a PVDF membrane. The primary antibody incubations with anti-human Oct4 antibody (0.45 mg/ml #ab19857; Abcam) and anti-human GAPDH (1:5000 dilution of GTX627408; GeneTex Inc, Irvine, CA) were performed at 4 °C for 16 h. The secondary antibody incubations with goat anti-rabbit IgG-HRP (1:5000 dilution of #sc-2004; Santa Cruz Biotechnology) and goat anti-mouse IgG-HRP (1:5000 of #sc-2005, Santa Cruz Biotechnology) were performed for 1 h at room temperature. Blots were visualized by using SuperSignal™ West Pico Chemiluminescent Substrate (#34080; Thermo Scientific) using a Mi5 Processor (MI-5 ADC, PGPR 14) imaging system. Sub-cellular fractionation Subcellular fractions was performed as reported previously 114 g g g g g CRISPR-cas9 knock-out in mESC and clonogenicity assay Cas9-expressing TNG ESCs were seeded at a density of 5 × 10 4 CRISPR-cas9 knock-out in MEF and proliferation assay CRISPR-Cas9-expressing MEFs were seeded at a density of 10 5 4 Knock-down using siRNA Human Fibroblasts (hFibs) 5 × 10 5 2 2 5 2 TNIP2 STAT3 Luciferase assay The pGL3 constructs containing the Fgf4 and Utf1 enhancers were obtained from the Niwa lab and were sequence-verified by Sanger sequencing. ZHBT4.C mES cells rescued with OCT4 wildtype or mutant (see the Rescuing mouse ES cell self-renewal section above) were co-transfected with a pGL3 construct and a Renilla expressing plasmid at a 10:1 w/w ratio using the Lipofectamine-3000 transfection reagent (ThermoScientific). For each transfection, 30,000 cells were seeded per well of a 24-well plate coated with 0.1% gelatin and cultured overnight. 48 h after transfection, luminescence was measured using the Dual-Luciferase Reporter Assay System (#E1910, Promega) according to the manufacturer’s instructions, on a Promega Glomax Multi Detection System. Recombinant protein expression and purification Recombinant proteins were expressed in E. Coli g The purified denatured proteins were refolded by buffer exchange to remove EB and replace with refolding (RF) buffer (50 mM MES (pH 5.5), 240 mM NaCl, 10 mM KCl, 2 mM MgCl2, 2 mM CaCl2, 0.8 M urea, 30% (v/v) glycerol, 0.1% NP40 substitute, 0.05% (v/v) Triton X100, 2 mM EDTA, 5 mM DTT). Buffer exchange was performed using a PD-SpinTrap G25 column (GE Healthcare) equilibrated in RF buffer according to the manufacturer’s instructions. A 180 µl aliquot of purified protein from the HisTrap column was applied to the PD-SpinTrap G25 column. The purified protein was aliquoted and snap frozen using liquid nitrogen before storage at −80 °C. Protein purity was assessed by sodium dodecyl sulfate polyacrylamide gel electrophoresis (SDS-PAGE) using the Bolt system with 4–12% gradient Bis-Tris gels (ThermoScientific), followed by protein staining using GelCode™ to visualise protein bands (ThermoScientific). Protein quantification was estimated by densitometry measurements of protein bands in digital images of SDS-PAGE gels stained with GelCode using Multi Gauge image software ver2.0 (FujiFilm), which were then plotted in a standard curve. Proteins with similar sizes and known concentrations were used to generate the standard curve. OCT4 wildtype was run with all OCT4 mutants in the same SDS-PAGE to reduce errors in protein quantifications. Nucleosome reconstitution Nucleosome assembly was performed using the Cy5-labelled LIN28B 43 LIN28B g LIN28B Electrophoretic mobility shift assays The binding to Cy5 end-labelled LIN28B 2 2 FGF4 RNA-Seq library preparation RNA was isolated from human iPSC lines, hESCs, HFibs and mESCs using RNeasy Mini Kit (Qiagen), and quality assessed in a 2200 TapeStation System (Agilent) using a high Sensitivity RNA ScreenTape. The concentration of RNA was assessed using a NanoDrop ND-1000 (Marshall Scientific). RNA (RIN > 9.5) libraries were prepared from 500 ng starting material and amplified for 8 cycles using NEBNext Poly(A) mRNA Magnetic Isolation Module (NEB E7490), NEBNext Ultra II RNA Library Prep Kit for Illumina (NEB E7770) and NEBNext Multiplex Oligos for Illumina (NEB E7600) according to the manufacturer’s instructions. Equimolar amounts of all libraries were pooled together and sequenced in a NovaSeq 6000 (Edinburgh Genomics facilities) with an SP flow cell, generating 50 bp pair-end reads. Bioinformatics RNA-seq data analysis Uniquely mapped reads were aligned to the Homo sapiens (human) genome assembly GRCh37 (hg19) or the Mus musculus genome assembly MGSCv37 (mm9) using STAR v2.5.3a (--outFilterMultimapNmax 1) 115 116 For human RNA-seq, reads were normalised to read depth using the median-of-ratios method and rlog transformed (DESeq2) 117 Gene annotation for mES RNA-seq data was performed using featureCounts (subread v2.0.6) to generate a counts table, utilizing the corresponding version of the GTF file for accurate gene annotation. The resulting BAM files from STAR were sorted and indexed using Samtools (v1.9) and converted into bigwig files using DeepTools (v3.5.4 bamCoverage), scaled and normalized to the same library size. Lowly expressed genes were filtered out before normalization and analysis using edgeR (v4.0.16). For PCA, reads were log-transformed and the prcomp function in R was used to identify the variation between samples and groups. The results were then visualized using the biplot function in R to display the relationships between samples and groups. For differential gene expression analysis, a threshold of log fold change (FC) > 1.5 and false discovery rate (FDR) < 0.05 was applied to identify significant differential expressed genes (DEGs). ATAC-seq data analysis To assess the chromatin accessibility of mES cells, ATAC-sequencing was performed according to the Buenrostro et al protocol 118 5 g 2 g 119 Mapping ChIP-seq reads The quality of the next generation sequencing (NGS) raw data (FASTQ files) was measured by FASTQC tool, which all scored QC values of more than 30 across the sequenced 50 bp passing the quality control standard for NGS data. The pair-end sequences were mapped to the Homo sapiens (human) genome assembly GRCh37 (hg19) or the Mus musculus genome assembly MGSCv37 (mm9) using Bowtie (version 2.3.4.1) and very sensitive parameters 120 http://broadinstitute.github.io/picard/ 121 122 Read density heatmaps The aligned reads (bam files) were normalised for sequencing coverage to 1x genome depth (reads per genome coverage, RPGC) using the bamCoverage tool from DeepTools and a bin size of 10 bp and ExtendReads parameters 123 124 125 125 123 123 Genomic intervals intersection Overlapping peaks were isolated if their peak summits were within 100 bp or less from each other using the bedtools window tool (version 2.18) 126 Motif discovery De Novo motif analysis was carried out using the MEME suite installed in a local LINUX server 127 126 128 129 Gene ontology analysis ChIP-seq peaks were associated with genes using GREAT (Genomic Regions Enrichment of Annotations Tool) 130 131 132 133 Proteomic data analysis Identified proteins filter vs control All datasets were filtered against their respective controls to filter non-specific interactors using the Perseus Software 134 t Differential enrichment analysis hESCs vs OSKM 48 h Differential enrichment between hES and OSKM 48 h was determined using the Perseus software 134 t t p y 5 Protein network The hESCs and OSKM 48 h network was generated with Cytoscape 135 66 Homo sapiens 136 PCA and heatmap for ChIP-SICAP hES and OKSM (WT and mutants) Hierarchical clustering heatmap and PCA plot for ChIP-SICAP analysis between hES and OSKM 48h (WT and mutants) were performed using the R 137 138 p 6 SILAC analysis SILAC dataset was analysed with Perseus Software 134 t p t p y 137 gplots heatmap.2 139 Protein functional enrichment Gene Ontologies, pathways and complexes enrichment were calculated using the Panther classification system 140 141 Protein structure Human OCT4 3D structure was predicted by AlphaFold2 61 35 Protein sequence analysis Amino acid sequence alignment and conservation was carried out by Clustal Omega 142 143 144 61 60 62 145 Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Peer Review file Description of Additional Supplementary Files Supplementary Data 1-6 Reporting Summary Source data  Source Data Publisher’s note These authors contributed equally: Burak Ozkan, Mitzy Rios de Anda. Supplementary information The online version contains supplementary material available at 10.1038/s41467-025-63806-3. Acknowledgements We thank Profs Katrin Ottersbach, Ian Chambers and Donal O’Carroll for their insightful comments on the manuscript. We thank Prof S. Rosser, the Edinburgh Genome Foundry and the UK Centre for Mammalian Synthetic Biology for support with generating synthetic DNA constructs. We thank Edinburgh Genomics for the sequencing service. Edinburgh Genomics is partly supported through core grants from NERC (R8/H10/56), MRC (MR/K001744/1) and BBSRC (BB/J004243/1). We thank Sukanija Thillainadarasan for assistance with making the OCT4 alanine-stretch mutant constructs. The work was supported by an MRC career development award (MR/N024028/1), CRUK-OHSU Project Award (C65925/A26986), and by the UK Research Councils’ Synthetic Biology for Growth programme and of the BBSRC, EPSRC and MRC (BB/M0180404/1) to A.S., B.O., E.H-P., and G.A.R. M.R.A. was funded by a CONACYT Mexico PhD scholarship. M.R.O. is supported by a Ph.D scholarship from the Darwin Trust of Edinburgh. K.F. was supported by the UK Centre for Mammalian Synthetic Biology Edinburgh and CRUK Program Grant (DRCNPG-Nov21\\100002). A.A. is funded by a PhD scholarship (1078107040) from King Abdulaziz City for Science and Technology. M.H. is supported by EPSRC DTP PhD. Author contributions A.S. conceived the study and designed the experiments with support from B.O. and M.R.A. B.O. constructed the OCT4 deletion library and performed the mouse iPSCs reprogramming screen, supported by M.L.H. with human iPSC reprogramming experiments. E.H-P. carried out molecular cloning, MEF generation, and pluripotency rescue screen with help from B.O. M.R.A. conducted ChIP-SICAP and proteomic analysis with help from C.S. Luciferase assays were conducted by B.O. with support from E.H-P. and H.N. Immunostaining and imaging were carried out by B.O., M.R.A., E.H-P., A.A., M.N., M.B., and S.Y. Recombinant protein purification, EMSA and nucleosome reconstitution were carried out by G.A.R. RNA-seq of human ESCs and iPSCs were carried out by B.O. ATAC-seq and knock-down experiments during human reprogramming were performed by B.O. Knock-in mouse ES lines were generated by B.O. with support from M.H., S.Y., M.R.O. and K.F. ChIP-seq and RNA-seq in mESCs were conducted by A.A. with support from S.Y. ATAC-seq in mESCs was carried out by M.H. and K.F. ChIP-seq, RNA-seq, ATAC-seq and MNase-seq bioinformatic analysis were carried out by M.R.A., B.O., A.A., M.R.O. and A.S. CRISP-cas9 knock out during reprogramming, in MEFs and in ESCs were performed by M.R.A and M.B. and supported by K.K. Reprogramming to human iTSCs was carried out by M.N. and teratomas were generated by H.Y., who were supervised by Y.B. Blastocysts and chimeras were generated by M.R.P.M and supervised by S.L. A.S. prepared the manuscript with contributions from B.O. and M.R.A., and edited by K.K., H.N., Y.B., and S.L. Peer review Peer review information Nature Communications Data availability All next-generation sequencing data generated as part of this study have been deposited in the Gene Expression Omnibus (GEO) under following accession numbers: GSE287493 GSE286895 GSE287206 GSE286894 GSE286923 GSE287492 GSE287494 GSE167632 GSE168142 GSE168141 44 GSE201852 65 GSE120131 146 147 PRJNA20689 PRJNA438682 Source data Competing interests The authors declare no competing interests. References 1. Xu J Du Y Deng H Direct lineage reprogramming: strategies, mechanisms, and applications Cell Stem Cell 2015 16 119 134 10.1016/j.stem.2015.01.013 25658369 Xu, J., Du, Y. & Deng, H. Direct lineage reprogramming: strategies, mechanisms, and applications. Cell Stem Cell 16 25658369 10.1016/j.stem.2015.01.013 2. Graf T Enver T Forcing cells to change lineages Nature 2009 462 587 594 10.1038/nature08533 19956253 Graf, T. & Enver, T. Forcing cells to change lineages. Nature 462 19956253 10.1038/nature08533 3. Takahashi K Yamanaka S Induction of pluripotent stem cells from mouse embryonic and adult fibroblast cultures by defined factors Cell 2006 126 663 676 10.1016/j.cell.2006.07.024 16904174 Takahashi, K. & Yamanaka, S. Induction of pluripotent stem cells from mouse embryonic and adult fibroblast cultures by defined factors. Cell 126 16904174 10.1016/j.cell.2006.07.024 4. Takahashi K Induction of pluripotent stem cells from adult human fibroblasts by defined factors Cell 2007 131 861 872 10.1016/j.cell.2007.11.019 18035408 Takahashi, K. et al. Induction of pluripotent stem cells from adult human fibroblasts by defined factors. Cell 131 18035408 10.1016/j.cell.2007.11.019 5. Nichols J Formation of pluripotent stem cells in the mammalian embryo depends on the POU transcription factor Oct4 Cell 1998 95 379 391 10.1016/S0092-8674(00)81769-9 9814708 Nichols, J. et al. Formation of pluripotent stem cells in the mammalian embryo depends on the POU transcription factor Oct4. Cell 95 9814708 10.1016/s0092-8674(00)81769-9 6. Niwa H Miyazaki J Smith AG Quantitative expression of Oct-3/4 defines differentiation, dedifferentiation or self-renewal of ES cells Nat. Genet. 2000 24 372 376 10.1038/74199 10742100 Niwa, H., Miyazaki, J. & Smith, A. G. Quantitative expression of Oct-3/4 defines differentiation, dedifferentiation or self-renewal of ES cells. Nat. Genet. 24 10742100 10.1038/74199 7. Avilion AA Multipotent cell lineages in early mouse development depend on SOX2 function Genes Dev. 2003 17 126 140 10.1101/gad.224503 12514105 PMC195970 Avilion, A. A. et al. Multipotent cell lineages in early mouse development depend on SOX2 function. Genes Dev. 17 12514105 10.1101/gad.224503 PMC195970 8. Li Y Murine embryonic stem cell differentiation is promoted by SOCS-3 and inhibited by the zinc finger transcription factor Klf4 Blood 2005 105 635 637 10.1182/blood-2004-07-2681 15358627 Li, Y. et al. Murine embryonic stem cell differentiation is promoted by SOCS-3 and inhibited by the zinc finger transcription factor Klf4. Blood 105 15358627 10.1182/blood-2004-07-2681 9. Yamane, M., Ohtsuka, S., Matsuura, K., Nakamura, A. & Niwa, H. Overlapping functions of Kruppel-like factor family members: targeting multiple transcription factors to maintain the naive pluripotency of mouse embryonic stem cells. Development 145 10.1242/dev.162404 29739838 10. Cartwright P LIF/STAT3 controls ES cell self-renewal and pluripotency by a Myc-dependent mechanism Development 2005 132 885 896 10.1242/dev.01670 15673569 Cartwright, P. et al. LIF/STAT3 controls ES cell self-renewal and pluripotency by a Myc-dependent mechanism. Development 132 15673569 10.1242/dev.01670 11. Schiebinger G Optimal-transport analysis of single-cell gene expression identifies developmental trajectories in reprogramming Cell 2019 176 928 943 e922 10.1016/j.cell.2019.01.006 30712874 PMC6402800 Schiebinger, G. et al. Optimal-transport analysis of single-cell gene expression identifies developmental trajectories in reprogramming. Cell 176 30712874 10.1016/j.cell.2019.01.006 PMC6402800 12. Wang Y Unique molecular events during reprogramming of human somatic cells to induced pluripotent stem cells (iPSCs) at naive state eLife 2018 7 e29518 10.7554/eLife.29518 29381138 PMC5807049 Wang, Y. et al. Unique molecular events during reprogramming of human somatic cells to induced pluripotent stem cells (iPSCs) at naive state. eLife 7 29381138 10.7554/eLife.29518 PMC5807049 13. Guo L Resolving cell fate decisions during somatic cell reprogramming by single-cell RNA-Seq Mol. Cell 2019 73 815 829 e817 10.1016/j.molcel.2019.01.042 30772174 Guo, L. et al. Resolving cell fate decisions during somatic cell reprogramming by single-cell RNA-Seq. Mol. Cell 73 30772174 10.1016/j.molcel.2019.01.042 14. Liu X Reprogramming roadmap reveals route to human induced trophoblast stem cells Nature 2020 586 101 107 10.1038/s41586-020-2734-6 32939092 Liu, X. et al. Reprogramming roadmap reveals route to human induced trophoblast stem cells. Nature 586 32939092 10.1038/s41586-020-2734-6 15. Naama M Pluripotency-independent induction of human trophoblast stem cells from fibroblasts Nat. Commun. 2023 14 3359 10.1038/s41467-023-39104-1 37291192 PMC10250329 Naama, M. et al. Pluripotency-independent induction of human trophoblast stem cells from fibroblasts. Nat. Commun. 14 37291192 10.1038/s41467-023-39104-1 PMC10250329 16. Fogarty NME Genome editing reveals a role for OCT4 in human embryogenesis Nature 2017 550 67 73 10.1038/nature24033 28953884 PMC5815497 Fogarty, N. M. E. et al. Genome editing reveals a role for OCT4 in human embryogenesis. Nature 550 28953884 10.1038/nature24033 PMC5815497 17. Niakan KK Eggan K Analysis of human embryos from zygote to blastocyst reveals distinct gene expression patterns relative to the mouse Dev. Biol. 2013 375 54 64 10.1016/j.ydbio.2012.12.008 23261930 Niakan, K. K. & Eggan, K. Analysis of human embryos from zygote to blastocyst reveals distinct gene expression patterns relative to the mouse. Dev. Biol. 375 23261930 10.1016/j.ydbio.2012.12.008 18. Tsunemoto R Diverse reprogramming codes for neuronal identity Nature 2018 557 375 380 10.1038/s41586-018-0103-5 29743677 PMC6483730 Tsunemoto, R. et al. Diverse reprogramming codes for neuronal identity. Nature 557 29743677 10.1038/s41586-018-0103-5 PMC6483730 19. Kim HS Pluripotency factors functionally premark cell-type-restricted enhancers in ES cells Nature 2018 556 510 514 10.1038/s41586-018-0048-8 29670286 PMC6021123 Kim, H. S. et al. Pluripotency factors functionally premark cell-type-restricted enhancers in ES cells. Nature 556 29670286 10.1038/s41586-018-0048-8 PMC6021123 20. Simandi Z OCT4 acts as an integrator of pluripotency and signal-induced differentiation Mol. Cell 2016 63 647 661 10.1016/j.molcel.2016.06.039 27499297 Simandi, Z. et al. OCT4 acts as an integrator of pluripotency and signal-induced differentiation. Mol. Cell 63 27499297 10.1016/j.molcel.2016.06.039 21. Mulas C Oct4 regulates the embryonic axis and coordinates exit from pluripotency and germ layer specification in the mouse embryo Development 2018 145 dev159103 10.1242/dev.159103 29915126 PMC6031404 Mulas, C. et al. Oct4 regulates the embryonic axis and coordinates exit from pluripotency and germ layer specification in the mouse embryo. Development 145 29915126 10.1242/dev.159103 PMC6031404 22. Kehler J Oct4 is required for primordial germ cell survival EMBO Rep. 2004 5 1078 1083 10.1038/sj.embor.7400279 15486564 PMC1299174 Kehler, J. et al. Oct4 is required for primordial germ cell survival. EMBO Rep. 5 15486564 10.1038/sj.embor.7400279 PMC1299174 23. Karwacki-Neisius V Reduced Oct4 expression directs a robust pluripotent state with distinct signaling activity and increased enhancer occupancy by Oct4 and Nanog Cell Stem Cell 2013 12 531 545 10.1016/j.stem.2013.04.023 23642364 PMC3650585 Karwacki-Neisius, V. et al. Reduced Oct4 expression directs a robust pluripotent state with distinct signaling activity and increased enhancer occupancy by Oct4 and Nanog. Cell Stem Cell 12 23642364 10.1016/j.stem.2013.04.023 PMC3650585 24. Radzisheuskaya A A defined Oct4 level governs cell state transitions of pluripotency entry and differentiation into all embryonic lineages Nat. Cell Biol. 2013 15 579 590 10.1038/ncb2742 23629142 PMC3671976 Radzisheuskaya, A. et al. A defined Oct4 level governs cell state transitions of pluripotency entry and differentiation into all embryonic lineages. Nat. Cell Biol. 15 23629142 10.1038/ncb2742 PMC3671976 25. DeVeale B Oct4 is required ~E7.5 for proliferation in the primitive streak PLoS Genet. 2013 9 e1003957 10.1371/journal.pgen.1003957 24244203 PMC3828132 DeVeale, B. et al. Oct4 is required ~E7.5 for proliferation in the primitive streak. PLoS Genet. 9 24244203 10.1371/journal.pgen.1003957 PMC3828132 26. Linneberg-Agerholm M The primitive endoderm supports lineage plasticity to enable regulative development Cell 2024 187 4010 4029.e4016 10.1016/j.cell.2024.05.051 38917790 PMC11290322 Linneberg-Agerholm, M. et al. The primitive endoderm supports lineage plasticity to enable regulative development. Cell 187 38917790 10.1016/j.cell.2024.05.051 PMC11290322 27. Le Bin GC Oct4 is required for lineage priming in the developing inner cell mass of the mouse blastocyst Development 2014 141 1001 1010 10.1242/dev.096875 24504341 PMC3929414 Le Bin, G. C. et al. Oct4 is required for lineage priming in the developing inner cell mass of the mouse blastocyst. Development 141 24504341 10.1242/dev.096875 PMC3929414 28. Schöler HR Ruppert S Suzuki N Chowdhury K Gruss P New type of POU domain in germ line-specific protein Oct-4 Nature 1990 344 435 10.1038/344435a0 1690859 Schöler, H. R., Ruppert, S., Suzuki, N., Chowdhury, K. & Gruss, P. New type of POU domain in germ line-specific protein Oct-4. Nature 344 1690859 10.1038/344435a0 29. Tiana M Pluripotency factors regulate the onset of Hox cluster activation in the early embryo Sci. Adv. 2022 8 eabo3583 10.1126/sciadv.abo3583 35857513 PMC9286507 Tiana, M. et al. Pluripotency factors regulate the onset of Hox cluster activation in the early embryo. Sci. Adv. 8 35857513 10.1126/sciadv.abo3583 PMC9286507 30. Brent R Ptashne M A eukaryotic transcriptional activator bearing the DNA specificity of a prokaryotic repressor Cell 1985 43 729 736 10.1016/0092-8674(85)90246-6 3907859 Brent, R. & Ptashne, M. A eukaryotic transcriptional activator bearing the DNA specificity of a prokaryotic repressor. Cell 43 3907859 10.1016/0092-8674(85)90246-6 31. Keegan L Gill G Ptashne M Separation of DNA binding from the transcription-activating function of a eukaryotic regulatory protein Science 1986 231 699 704 10.1126/science.3080805 3080805 Keegan, L., Gill, G. & Ptashne, M. Separation of DNA binding from the transcription-activating function of a eukaryotic regulatory protein. Science 231 3080805 10.1126/science.3080805 32. Soto LF Compendium of human transcription factor effector domains Mol. Cell 2022 82 514 526 10.1016/j.molcel.2021.11.007 34863368 PMC8818021 Soto, L. F. et al. Compendium of human transcription factor effector domains. Mol. Cell 82 34863368 10.1016/j.molcel.2021.11.007 PMC8818021 33. Lambert SA The human transcription factors Cell 2018 172 650 665 10.1016/j.cell.2018.01.029 29425488 Lambert, S. A. et al. The human transcription factors. Cell 172 29425488 10.1016/j.cell.2018.01.029 34. Remenyi A Crystal structure of a POU/HMG/DNA ternary complex suggests differential assembly of Oct4 and Sox2 on two enhancers Genes Dev. 2003 17 2048 2059 10.1101/gad.269303 12923055 PMC196258 Remenyi, A. et al. Crystal structure of a POU/HMG/DNA ternary complex suggests differential assembly of Oct4 and Sox2 on two enhancers. Genes Dev. 17 12923055 10.1101/gad.269303 PMC196258 35. Esch D A unique Oct4 interface is crucial for reprogramming to pluripotency Nat. Cell Biol. 2013 15 295 301 10.1038/ncb2680 23376973 Esch, D. et al. A unique Oct4 interface is crucial for reprogramming to pluripotency. Nat. Cell Biol. 15 23376973 10.1038/ncb2680 36. Chen X Integration of external signaling pathways with the core transcriptional network in embryonic stem cells Cell 2008 133 1106 1117 10.1016/j.cell.2008.04.043 18555785 Chen, X. et al. Integration of external signaling pathways with the core transcriptional network in embryonic stem cells. Cell 133 18555785 10.1016/j.cell.2008.04.043 37. Niwa H Masui S Chambers I Smith AG Miyazaki J Phenotypic complementation establishes requirements for specific POU domain and generic transactivation function of Oct-3/4 in embryonic stem cells Mol. Cell Biol. 2002 22 1526 1536 10.1128/MCB.22.5.1526-1536.2002 11839818 PMC134688 Niwa, H., Masui, S., Chambers, I., Smith, A. G. & Miyazaki, J. Phenotypic complementation establishes requirements for specific POU domain and generic transactivation function of Oct-3/4 in embryonic stem cells. Mol. Cell Biol. 22 11839818 10.1128/mcb.22.5.1526-1536.2002 PMC134688 38. Nishimoto M Oct-3/4 maintains the proliferative embryonic stem cell state via specific binding to a variant octamer sequence in the regulatory region of the UTF1 locus Mol. Cell Biol. 2005 25 5084 5094 10.1128/MCB.25.12.5084-5094.2005 15923625 PMC1140574 Nishimoto, M. et al. Oct-3/4 maintains the proliferative embryonic stem cell state via specific binding to a variant octamer sequence in the regulatory region of the UTF1 locus. Mol. Cell Biol. 25 15923625 10.1128/MCB.25.12.5084-5094.2005 PMC1140574 39. Nakatake Y Klf4 cooperates with Oct3/4 and Sox2 to activate the Lefty1 core promoter in embryonic stem cells Mol. Cell Biol. 2006 26 7772 7782 10.1128/MCB.00468-06 16954384 PMC1636862 Nakatake, Y. et al. Klf4 cooperates with Oct3/4 and Sox2 to activate the Lefty1 core promoter in embryonic stem cells. Mol. Cell Biol. 26 16954384 10.1128/MCB.00468-06 PMC1636862 40. Masui S Pluripotency governed by Sox2 via regulation of Oct3/4 expression in mouse embryonic stem cells Nat. Cell Biol. 2007 9 625 635 10.1038/ncb1589 17515932 Masui, S. et al. Pluripotency governed by Sox2 via regulation of Oct3/4 expression in mouse embryonic stem cells. Nat. Cell Biol. 9 17515932 10.1038/ncb1589 41. Guan R Lian T Zhou BR Wheeler D Bai Y Structural mechanism of LIN28B nucleosome targeting by OCT4 Mol. Cell 2023 83 1970 1982 e1976 10.1016/j.molcel.2023.05.030 37327775 PMC10276192 Guan, R., Lian, T., Zhou, B. R., Wheeler, D. & Bai, Y. Structural mechanism of LIN28B nucleosome targeting by OCT4. Mol. Cell 83 37327775 10.1016/j.molcel.2023.05.030 PMC10276192 42. Michael AK Mechanisms of OCT4-SOX2 motif readout on nucleosomes Science 2020 368 1460 1465 10.1126/science.abb0074 32327602 Michael, A. K. et al. Mechanisms of OCT4-SOX2 motif readout on nucleosomes. Science 368 32327602 10.1126/science.abb0074 43. Soufi A Pioneer transcription factors target partial DNA motifs on nucleosomes to initiate reprogramming Cell 2015 161 555 568 10.1016/j.cell.2015.03.017 25892221 PMC4409934 Soufi, A. et al. Pioneer transcription factors target partial DNA motifs on nucleosomes to initiate reprogramming. Cell 161 25892221 10.1016/j.cell.2015.03.017 PMC4409934 44. Roberts GA Dissecting OCT4 defines the role of nucleosome binding in pluripotency Nat. Cell Biol. 2021 23 834 845 10.1038/s41556-021-00727-5 34354236 PMC7611526 Roberts, G. A. et al. Dissecting OCT4 defines the role of nucleosome binding in pluripotency. Nat. Cell Biol. 23 34354236 10.1038/s41556-021-00727-5 PMC7611526 45. Boyer LA Polycomb complexes repress developmental regulators in murine embryonic stem cells Nature 2006 441 349 10.1038/nature04733 16625203 Boyer, L. A. et al. Polycomb complexes repress developmental regulators in murine embryonic stem cells. Nature 441 https://www.nature.com/articles/nature04733#supplementary-information 16625203 10.1038/nature04733 46. Rafiee MR Girardot C Sigismondo G Krijgsveld J Expanding the circuitry of pluripotency by selective isolation of chromatin-associated proteins Mol. Cell 2016 64 624 635 10.1016/j.molcel.2016.09.019 27773674 PMC5101186 Rafiee, M. R., Girardot, C., Sigismondo, G. & Krijgsveld, J. Expanding the circuitry of pluripotency by selective isolation of chromatin-associated proteins. Mol. Cell 64 27773674 10.1016/j.molcel.2016.09.019 PMC5101186 47. Oliviero G The variant Polycomb Repressor Complex 1 component PCGF1 interacts with a pluripotency sub-network that includes DPPA4, a regulator of embryogenesis Sci. Rep. 2015 5 18388 10.1038/srep18388 26687479 PMC4685312 Oliviero, G. et al. The variant Polycomb Repressor Complex 1 component PCGF1 interacts with a pluripotency sub-network that includes DPPA4, a regulator of embryogenesis. Sci. Rep. 5 26687479 10.1038/srep18388 PMC4685312 48. Fong YW A DNA repair complex functions as an Oct4/Sox2 coactivator in embryonic stem cells Cell 2011 147 120 131 10.1016/j.cell.2011.08.038 21962512 PMC3216680 Fong, Y. W. et al. A DNA repair complex functions as an Oct4/Sox2 coactivator in embryonic stem cells. Cell 147 21962512 10.1016/j.cell.2011.08.038 PMC3216680 49. van den Berg DLC An Oct4-centered protein interaction network in embryonic stem cells Cell Stem Cell 2010 6 369 381 10.1016/j.stem.2010.02.014 20362541 PMC2860243 van den Berg, D. L. C. et al. An Oct4-centered protein interaction network in embryonic stem cells. Cell Stem Cell 6 20362541 10.1016/j.stem.2010.02.014 PMC2860243 50. Zviran A Deterministic somatic cell reprogramming involves continuous transcriptional changes governed by Myc and epigenetic-driven modules Cell Stem Cell 2019 24 328 341 e329 10.1016/j.stem.2018.11.014 30554962 PMC7116520 Zviran, A. et al. Deterministic somatic cell reprogramming involves continuous transcriptional changes governed by Myc and epigenetic-driven modules. Cell Stem Cell 24 30554962 10.1016/j.stem.2018.11.014 PMC7116520 51. Hammachi F Transcriptional activation by Oct4 is sufficient for the maintenance and induction of pluripotency Cell Rep. 2012 1 99 109 10.1016/j.celrep.2011.12.002 22832160 PMC3778438 Hammachi, F. et al. Transcriptional activation by Oct4 is sufficient for the maintenance and induction of pluripotency. Cell Rep. 1 22832160 10.1016/j.celrep.2011.12.002 PMC3778438 52. Boija A Transcription factors activate genes through the phase-separation capacity of their activation domains Cell 2018 175 1842 1855 e1816 10.1016/j.cell.2018.10.042 30449618 PMC6295254 Boija, A. et al. Transcription factors activate genes through the phase-separation capacity of their activation domains. Cell 175 30449618 10.1016/j.cell.2018.10.042 PMC6295254 53. Sabari, B. R. et al. Coactivator condensation at super-enhancers links phase separation and gene control. Science 361 10.1126/science.aar3958 PMC6092193 29930091 54. Hnisz D Shrinivas K Young RA Chakraborty AK Sharp PA A phase separation model for transcriptional control Cell 2017 169 13 23 10.1016/j.cell.2017.02.007 28340338 PMC5432200 Hnisz, D., Shrinivas, K., Young, R. A., Chakraborty, A. K. & Sharp, P. A. A phase separation model for transcriptional control. Cell 169 28340338 10.1016/j.cell.2017.02.007 PMC5432200 55. Shrinivas K Enhancer features that drive formation of transcriptional condensates Mol. Cell 2019 75 549 561 e547 10.1016/j.molcel.2019.07.009 31398323 PMC6690378 Shrinivas, K. et al. Enhancer features that drive formation of transcriptional condensates. Mol. Cell 75 31398323 10.1016/j.molcel.2019.07.009 PMC6690378 56. Ponting CP Russell RR The natural history of protein domains Annu Rev. Biophys. Biomol. Struct. 2002 31 45 71 10.1146/annurev.biophys.31.082901.134314 11988462 Ponting, C. P. & Russell, R. R. The natural history of protein domains. Annu Rev. Biophys. Biomol. Struct. 31 11988462 10.1146/annurev.biophys.31.082901.134314 57. Peng K Radivojac P Vucetic S Dunker AK Obradovic Z Length-dependent prediction of protein intrinsic disorder BMC Bioinform. 2006 7 208 10.1186/1471-2105-7-208 PMC1479845 16618368 Peng, K., Radivojac, P., Vucetic, S., Dunker, A. K. & Obradovic, Z. Length-dependent prediction of protein intrinsic disorder. BMC Bioinform. 7 10.1186/1471-2105-7-208 PMC1479845 16618368 58. Brehm A Ohbo K Scholer H The carboxy-terminal transactivation domain of Oct-4 acquires cell specificity through the POU domain Mol. Cell Biol. 1997 17 154 162 10.1128/MCB.17.1.154 8972195 PMC231739 Brehm, A., Ohbo, K. & Scholer, H. The carboxy-terminal transactivation domain of Oct-4 acquires cell specificity through the POU domain. Mol. Cell Biol. 17 8972195 10.1128/mcb.17.1.154 PMC231739 59. Mohan A Analysis of molecular recognition features (MoRFs) J. Mol. Biol. 2006 362 1043 1059 10.1016/j.jmb.2006.07.087 16935303 Mohan, A. et al. Analysis of molecular recognition features (MoRFs). J. Mol. Biol. 362 16935303 10.1016/j.jmb.2006.07.087 60. Disfani FM MoRFpred, a computational tool for sequence-based prediction and characterization of short disorder-to-order transitioning binding regions in proteins Bioinformatics 2012 28 i75 83 10.1093/bioinformatics/bts209 22689782 PMC3371841 Disfani, F. M. et al. MoRFpred, a computational tool for sequence-based prediction and characterization of short disorder-to-order transitioning binding regions in proteins. Bioinformatics 28 22689782 10.1093/bioinformatics/bts209 PMC3371841 61. Jumper J Highly accurate protein structure prediction with AlphaFold Nature 2021 596 583 589 10.1038/s41586-021-03819-2 34265844 PMC8371605 Jumper, J. et al. Highly accurate protein structure prediction with AlphaFold. Nature 596 34265844 10.1038/s41586-021-03819-2 PMC8371605 62. Meszaros B Simon I Dosztanyi Z Prediction of protein binding regions in disordered proteins PLoS Comput Biol. 2009 5 e1000376 10.1371/journal.pcbi.1000376 19412530 PMC2671142 Meszaros, B., Simon, I. & Dosztanyi, Z. Prediction of protein binding regions in disordered proteins. PLoS Comput Biol. 5 19412530 10.1371/journal.pcbi.1000376 PMC2671142 63. Soufi A Donahue G Zaret KS Facilitators and impediments of the pluripotency reprogramming factors’ initial engagement with the genome Cell 2012 151 994 1004 10.1016/j.cell.2012.09.045 23159369 PMC3508134 Soufi, A., Donahue, G. & Zaret, K. S. Facilitators and impediments of the pluripotency reprogramming factors’ initial engagement with the genome. Cell 151 23159369 10.1016/j.cell.2012.09.045 PMC3508134 64. Chronis C Cooperative binding of transcription factors orchestrates reprogramming Cell 2017 168 442 459 e420 10.1016/j.cell.2016.12.016 28111071 PMC5302508 Chronis, C. et al. Cooperative binding of transcription factors orchestrates reprogramming. Cell 168 28111071 10.1016/j.cell.2016.12.016 PMC5302508 65. O’Dwyer MR Nucleosome fibre topology guides transcription factor binding to enhancers Nature 2025 638 251 260 10.1038/s41586-024-08333-9 39695228 PMC11798873 O’Dwyer, M. R. et al. Nucleosome fibre topology guides transcription factor binding to enhancers. Nature 638 39695228 10.1038/s41586-024-08333-9 PMC11798873 66. Szklarczyk D STRING v11: protein-protein association networks with increased coverage, supporting functional discovery in genome-wide experimental datasets Nucleic Acids Res. 2019 47 D607 D613 10.1093/nar/gky1131 30476243 PMC6323986 Szklarczyk, D. et al. STRING v11: protein-protein association networks with increased coverage, supporting functional discovery in genome-wide experimental datasets. Nucleic Acids Res. 47 30476243 10.1093/nar/gky1131 PMC6323986 67. Knaupp AS Transient and permanent reconfiguration of chromatin and transcription factor occupancy drive reprogramming Cell Stem Cell 2017 21 834 845 e836 10.1016/j.stem.2017.11.007 29220667 Knaupp, A. S. et al. Transient and permanent reconfiguration of chromatin and transcription factor occupancy drive reprogramming. Cell Stem Cell 21 29220667 10.1016/j.stem.2017.11.007 68. Li D Chromatin accessibility dynamics during iPSC reprogramming Cell Stem Cell 2017 21 819 833 e816 10.1016/j.stem.2017.10.012 29220666 Li, D. et al. Chromatin accessibility dynamics during iPSC reprogramming. Cell Stem Cell 21 29220666 10.1016/j.stem.2017.10.012 69. Emani MR The L1TD1 protein interactome reveals the importance of post-transcriptional regulation in human pluripotency Stem Cell Rep. 2015 4 519 528 10.1016/j.stemcr.2015.01.014 PMC4376047 25702638 Emani, M. R. et al. The L1TD1 protein interactome reveals the importance of post-transcriptional regulation in human pluripotency. Stem Cell Rep. 4 10.1016/j.stemcr.2015.01.014 PMC4376047 25702638 70. Lee JY Kim DK Ko JJ Kim KP Park KS Rad51 regulates reprogramming efficiency through DNA repair pathway Dev. Reprod. 2016 20 163 169 10.12717/DR.2016.20.2.163 27660832 PMC5027222 Lee, J. Y., Kim, D. K., Ko, J. J., Kim, K. P. & Park, K. S. Rad51 regulates reprogramming efficiency through DNA repair pathway. Dev. Reprod. 20 27660832 10.12717/DR.2016.20.2.163 PMC5027222 71. Liang G He J Zhang Y Kdm2b promotes induced pluripotent stem cell generation by facilitating gene activation early in reprogramming Nat. Cell Biol. 2012 14 457 466 10.1038/ncb2483 22522173 PMC3544197 Liang, G., He, J. & Zhang, Y. Kdm2b promotes induced pluripotent stem cell generation by facilitating gene activation early in reprogramming. Nat. Cell Biol. 14 22522173 10.1038/ncb2483 PMC3544197 72. Montserrat N Reprogramming of human fibroblasts to pluripotency with lineage specifiers Cell Stem Cell 2013 13 341 350 10.1016/j.stem.2013.06.019 23871606 Montserrat, N. et al. Reprogramming of human fibroblasts to pluripotency with lineage specifiers. Cell Stem Cell 13 23871606 10.1016/j.stem.2013.06.019 73. Ruetz T Constitutively active SMAD2/3 are broad-scope potentiators of transcription-factor-mediated cellular reprogramming Cell Stem Cell 2017 21 791 805 e799 10.1016/j.stem.2017.10.013 29174331 PMC5732323 Ruetz, T. et al. Constitutively active SMAD2/3 are broad-scope potentiators of transcription-factor-mediated cellular reprogramming. Cell Stem Cell 21 29174331 10.1016/j.stem.2017.10.013 PMC5732323 74. Zhang J The oncogene Etv5 promotes MET in somatic reprogramming and orchestrates epiblast/primitive endoderm specification during mESCs differentiation Cell Death Dis. 2018 9 224 10.1038/s41419-018-0335-1 29445086 PMC5833841 Zhang, J. et al. The oncogene Etv5 promotes MET in somatic reprogramming and orchestrates epiblast/primitive endoderm specification during mESCs differentiation. Cell Death Dis. 9 29445086 10.1038/s41419-018-0335-1 PMC5833841 75. Kaemena DF B1 SINE-binding ZFP266 impedes mouse iPSC generation through suppression of chromatin opening mediated by reprogramming factors Nat. Commun. 2023 14 488 10.1038/s41467-023-36097-9 36717582 PMC9887000 Kaemena, D. F. et al. B1 SINE-binding ZFP266 impedes mouse iPSC generation through suppression of chromatin opening mediated by reprogramming factors. Nat. Commun. 14 36717582 10.1038/s41467-023-36097-9 PMC9887000 76. Sakwe AM Nguyen T Athanasopoulos V Shire K Frappier L Identification and characterization of a novel component of the human minichromosome maintenance complex Mol. Cell Biol. 2007 27 3044 3055 10.1128/MCB.02384-06 17296731 PMC1899943 Sakwe, A. M., Nguyen, T., Athanasopoulos, V., Shire, K. & Frappier, L. Identification and characterization of a novel component of the human minichromosome maintenance complex. Mol. Cell Biol. 27 17296731 10.1128/MCB.02384-06 PMC1899943 77. Meyer HH Shorter JG Seemann J Pappin D Warren G A complex of mammalian ufd1 and npl4 links the AAA-ATPase, p97, to ubiquitin and nuclear transport pathways EMBO J. 2000 19 2181 2192 10.1093/emboj/19.10.2181 10811609 PMC384367 Meyer, H. H., Shorter, J. G., Seemann, J., Pappin, D. & Warren, G. A complex of mammalian ufd1 and npl4 links the AAA-ATPase, p97, to ubiquitin and nuclear transport pathways. EMBO J. 19 10811609 10.1093/emboj/19.10.2181 PMC384367 78. Verstrepen L Carpentier I Verhelst K Beyaert R ABINs: A20 binding inhibitors of NF-kappa B and apoptosis signaling Biochem. Pharm. 2009 78 105 114 10.1016/j.bcp.2009.02.009 19464428 Verstrepen, L., Carpentier, I., Verhelst, K. & Beyaert, R. ABINs: A20 binding inhibitors of NF-kappa B and apoptosis signaling. Biochem. Pharm. 78 19464428 10.1016/j.bcp.2009.02.009 79. Chien CY Liu WK Chou CK Su JY The A20-binding protein ABIN-2 exerts unexpected function in mediating transcriptional coactivation FEBS Lett. 2003 543 55 60 10.1016/S0014-5793(03)00401-0 12753905 Chien, C. Y., Liu, W. K., Chou, C. K. & Su, J. Y. The A20-binding protein ABIN-2 exerts unexpected function in mediating transcriptional coactivation. FEBS Lett. 543 12753905 10.1016/s0014-5793(03)00401-0 80. Lin SM Structural insights into linear tri-ubiquitin recognition by A20-binding inhibitor of NF-kappaB, ABIN-2 Structure 2017 25 66 78 10.1016/j.str.2016.11.005 27916521 Lin, S. M. et al. Structural insights into linear tri-ubiquitin recognition by A20-binding inhibitor of NF-kappaB, ABIN-2. Structure 25 27916521 10.1016/j.str.2016.11.005 81. Evans, R. et al. Protein complex prediction with AlphaFold-multimer. Preprint at bioRxiv https://www.biorxiv.org/content/10.1101/2021.10.04.463034v2 82. Boroviak T Loos R Bertone P Smith A Nichols J The ability of inner-cell-mass cells to self-renew as embryonic stem cells is acquired following epiblast specification Nat. Cell Biol. 2014 16 513 525 10.1038/ncb2965 PMC4878656 24859004 Boroviak, T., Loos, R., Bertone, P., Smith, A. & Nichols, J. The ability of inner-cell-mass cells to self-renew as embryonic stem cells is acquired following epiblast specification. Nat. Cell Biol. 16 10.1038/ncb2965 PMC4878656 24859004 83. Endoh M Niwa H Stepwise pluripotency transitions in mouse stem cells EMBO Rep. 2022 23 e55010 10.15252/embr.202255010 35903955 PMC9442314 Endoh, M. & Niwa, H. Stepwise pluripotency transitions in mouse stem cells. EMBO Rep. 23 35903955 10.15252/embr.202255010 PMC9442314 84. Dewari PS An efficient and scalable pipeline for epitope tagging in mammalian stem cells using Cas9 ribonucleoprotein eLife 2018 7 e35069 10.7554/eLife.35069 29638216 PMC5947990 Dewari, P. S. et al. An efficient and scalable pipeline for epitope tagging in mammalian stem cells using Cas9 ribonucleoprotein. eLife 7 29638216 10.7554/eLife.35069 PMC5947990 85. Chambers I Functional expression cloning of Nanog, a pluripotency sustaining factor in embryonic stem cells Cell 2003 113 643 655 10.1016/S0092-8674(03)00392-1 12787505 Chambers, I. et al. Functional expression cloning of Nanog, a pluripotency sustaining factor in embryonic stem cells. Cell 113 12787505 10.1016/s0092-8674(03)00392-1 86. von Hippel PH Berg OG On the specificity of DNA-protein interactions Proc. Natl Acad. Sci. 1986 83 1608 1612 10.1073/pnas.83.6.1608 3456604 PMC323132 von Hippel, P. H. & Berg, O. G. On the specificity of DNA-protein interactions. Proc. Natl Acad. Sci. 83 3456604 10.1073/pnas.83.6.1608 PMC323132 87. Li X Proteomic analyses reveal distinct chromatin-associated and soluble transcription factor complexes Mol. Syst. Biol. 2015 11 775 10.15252/msb.20145504 25609649 PMC4332150 Li, X. et al. Proteomic analyses reveal distinct chromatin-associated and soluble transcription factor complexes. Mol. Syst. Biol. 11 25609649 10.15252/msb.20145504 PMC4332150 88. Carnesecchi J Multi-level and lineage-specific interactomes of the Hox transcription factor Ubx contribute to its functional specificity Nat. Commun. 2020 11 1388 10.1038/s41467-020-15223-x 32170121 PMC7069958 Carnesecchi, J. et al. Multi-level and lineage-specific interactomes of the Hox transcription factor Ubx contribute to its functional specificity. Nat. Commun. 11 32170121 10.1038/s41467-020-15223-x PMC7069958 89. Brivanlou AH Darnell JE Signal transduction and the control of gene expression Science 2002 295 813 818 10.1126/science.1066355 11823631 Brivanlou, A. H. & Darnell, J. E. Signal transduction and the control of gene expression. Science 295 11823631 10.1126/science.1066355 90. Mullen AC Master transcription factors determine cell-type-specific responses to TGF-beta signaling Cell 2011 147 565 576 10.1016/j.cell.2011.08.050 22036565 PMC3212730 Mullen, A. C. et al. Master transcription factors determine cell-type-specific responses to TGF-beta signaling. Cell 147 22036565 10.1016/j.cell.2011.08.050 PMC3212730 91. Zalc A Reactivation of the pluripotency program precedes formation of the cranial neural crest Science 2021 371 eabb4776 10.1126/science.abb4776 33542111 PMC8557957 Zalc, A. et al. Reactivation of the pluripotency program precedes formation of the cranial neural crest. Science 371 33542111 10.1126/science.abb4776 PMC8557957 92. Tai M-H Chang C-C Olson LK Trosko JE Oct4 expression in adult human stem cells: evidence in support of the stem cell theory of carcinogenesis Carcinogenesis 2005 26 495 502 10.1093/carcin/bgh321 15513931 Tai, M.-H., Chang, C.-C., Olson, L. K. & Trosko, J. E. Oct4 expression in adult human stem cells: evidence in support of the stem cell theory of carcinogenesis. Carcinogenesis 26 15513931 10.1093/carcin/bgh321 93. Vaz B Halder S Ramadan K Role of p97/VCP (Cdc48) in genome stability Front. Genet. 2013 4 60 10.3389/fgene.2013.00060 23641252 PMC3639377 Vaz, B., Halder, S. & Ramadan, K. Role of p97/VCP (Cdc48) in genome stability. Front. Genet. 4 23641252 10.3389/fgene.2013.00060 PMC3639377 94. Minezaki Y Homma K Kinjo AR Nishikawa K Human transcription factors contain a high fraction of intrinsically disordered regions essential for transcriptional regulation J. Mol. Biol. 2006 359 1137 1149 10.1016/j.jmb.2006.04.016 16697407 Minezaki, Y., Homma, K., Kinjo, A. R. & Nishikawa, K. Human transcription factors contain a high fraction of intrinsically disordered regions essential for transcriptional regulation. J. Mol. Biol. 359 16697407 10.1016/j.jmb.2006.04.016 95. Musselman CA Kutateladze TG Characterization of functional disordered regions within chromatin-associated proteins iScience 2021 24 102070 10.1016/j.isci.2021.102070 33604523 PMC7873657 Musselman, C. A. & Kutateladze, T. G. Characterization of functional disordered regions within chromatin-associated proteins. iScience 24 33604523 10.1016/j.isci.2021.102070 PMC7873657 96. Cermakova K Hodges HC Interaction modules that impart specificity to disordered protein Trends Biochem. Sci. 2023 48 477 490 10.1016/j.tibs.2023.01.004 36754681 PMC10106370 Cermakova, K. & Hodges, H. C. Interaction modules that impart specificity to disordered protein. Trends Biochem. Sci. 48 36754681 10.1016/j.tibs.2023.01.004 PMC10106370 97. Brodsky S Intrinsically disordered regions direct transcription factor in vivo binding specificity Mol. Cell 2020 79 459 471.e454 10.1016/j.molcel.2020.05.032 32553192 Brodsky, S. et al. Intrinsically disordered regions direct transcription factor in vivo binding specificity. Mol. Cell 79 32553192 10.1016/j.molcel.2020.05.032 98. Alderson TR Pritišanac I Kolarić Đ Moses AM Forman-Kay JD Systematic identification of conditionally folded intrinsically disordered regions by AlphaFold2 Proc. Natl Acad. Sci. 2023 120 e2304302120 10.1073/pnas.2304302120 37878721 PMC10622901 Alderson, T. R., Pritišanac, I., Kolarić, Đ, Moses, A. M. & Forman-Kay, J. D. Systematic identification of conditionally folded intrinsically disordered regions by AlphaFold2. Proc. Natl Acad. Sci. 120 37878721 10.1073/pnas.2304302120 PMC10622901 99. van der Lee R Classification of intrinsically disordered regions and proteins Chem. Rev. 2014 114 6589 6631 10.1021/cr400525m 24773235 PMC4095912 van der Lee, R. et al. Classification of intrinsically disordered regions and proteins. Chem. Rev. 114 24773235 10.1021/cr400525m PMC4095912 100. Clouser AF Interplay of disordered and ordered regions of a human small heat shock protein yields an ensemble of ‘quasi-ordered’ states eLife 2019 8 e50259 10.7554/eLife.50259 31573509 PMC6791718 Clouser, A. F. et al. Interplay of disordered and ordered regions of a human small heat shock protein yields an ensemble of ‘quasi-ordered’ states. eLife 8 31573509 10.7554/eLife.50259 PMC6791718 101. Davey NE Attributes of short linear motifs Mol. Biosyst. 2012 8 268 281 10.1039/C1MB05231D 21909575 Davey, N. E. et al. Attributes of short linear motifs. Mol. Biosyst. 8 21909575 10.1039/c1mb05231d 102. Hockemeyer D A drug-inducible system for direct reprogramming of human somatic cells to pluripotency Cell Stem Cell 2008 3 346 353 10.1016/j.stem.2008.08.014 18786421 PMC4097107 Hockemeyer, D. et al. A drug-inducible system for direct reprogramming of human somatic cells to pluripotency. Cell Stem Cell 3 18786421 10.1016/j.stem.2008.08.014 PMC4097107 103. Koike-Yusa H Li Y Tan EP Velasco-Herrera Mdel C Yusa K Genome-wide recessive genetic screening in mammalian cells with a lentiviral CRISPR-guide RNA library Nat. Biotechnol. 2014 32 267 273 10.1038/nbt.2800 24535568 Koike-Yusa, H., Li, Y., Tan, E. P., Velasco-Herrera Mdel, C. & Yusa, K. Genome-wide recessive genetic screening in mammalian cells with a lentiviral CRISPR-guide RNA library. Nat. Biotechnol. 32 24535568 10.1038/nbt.2800 104. Okae H Derivation of human trophoblast stem cells Cell Stem Cell 2018 22 50 63 e56 10.1016/j.stem.2017.11.004 29249463 Okae, H. et al. Derivation of human trophoblast stem cells. Cell Stem Cell 22 29249463 10.1016/j.stem.2017.11.004 105. Brinkman, E. K. & van Steensel, B. in CRISPR Gene Editing: Methods and Protocols 106. Manza LL Stamer SL Ham AJL Codreanu SG Liebler DC Sample preparation and digestion for proteomic analyses using spin filters Proteomics 2005 5 1742 1745 10.1002/pmic.200401063 15761957 Manza, L. L., Stamer, S. L., Ham, A. J. L., Codreanu, S. G. & Liebler, D. C. Sample preparation and digestion for proteomic analyses using spin filters. Proteomics 5 15761957 10.1002/pmic.200401063 107. Shevchenko A Wilm M Vorm O Mann M Mass spectrometric sequencing of proteins from silver-stained polyacrylamide gels Anal. Chem. 1996 68 850 858 10.1021/ac950914h 8779443 Shevchenko, A., Wilm, M., Vorm, O. & Mann, M. Mass spectrometric sequencing of proteins from silver-stained polyacrylamide gels. Anal. Chem. 68 8779443 10.1021/ac950914h 108. Rappsilber J Ishihama Y Mann M Stop and go extraction tips for matrix-assisted laser desorption/ionization, nanoelectrospray, and LC/MS sample pretreatment in proteomics Anal. Chem. 2003 75 663 670 10.1021/ac026117i 12585499 Rappsilber, J., Ishihama, Y. & Mann, M. Stop and go extraction tips for matrix-assisted laser desorption/ionization, nanoelectrospray, and LC/MS sample pretreatment in proteomics. Anal. Chem. 75 12585499 10.1021/ac026117i 109. Olsen JV Higher-energy C-trap dissociation for peptide modification analysis Nat. Methods 2007 4 709 10.1038/nmeth1060 17721543 Olsen, J. V. et al. Higher-energy C-trap dissociation for peptide modification analysis. Nat. Methods 4 https://www.nature.com/articles/nmeth1060#supplementary-information 17721543 10.1038/nmeth1060 110. Cox J Mann M MaxQuant enables high peptide identification rates, individualized p.p.b.-range mass accuracies and proteome-wide protein quantification Nat. Biotechnol. 2008 26 1367 10.1038/nbt.1511 19029910 Cox, J. & Mann, M. MaxQuant enables high peptide identification rates, individualized p.p.b.-range mass accuracies and proteome-wide protein quantification. Nat. Biotechnol. 26 https://www.nature.com/articles/nbt.1511#supplementary-information 19029910 10.1038/nbt.1511 111. Cox J Andromeda: a peptide search engine integrated into the MaxQuant environment J. Proteome Res. 2011 10 1794 1805 10.1021/pr101065j 21254760 Cox, J. et al. Andromeda: a peptide search engine integrated into the MaxQuant environment. J. Proteome Res. 10 21254760 10.1021/pr101065j 112. Cox J Accurate proteome-wide label-free quantification by delayed normalization and maximal peptide ratio extraction, termed MaxLFQ Mol. Cell. Proteom. 2014 13 2513 2526 10.1074/mcp.M113.031591 PMC4159666 24942700 Cox, J. et al. Accurate proteome-wide label-free quantification by delayed normalization and maximal peptide ratio extraction, termed MaxLFQ. Mol. Cell. Proteom. 13 10.1074/mcp.M113.031591 PMC4159666 24942700 113. Cox J A practical guide to the MaxQuant computational platform for SILAC-based quantitative proteomics Nat. Protoc. 2009 4 698 10.1038/nprot.2009.36 19373234 Cox, J. et al. A practical guide to the MaxQuant computational platform for SILAC-based quantitative proteomics. Nat. Protoc. 4 19373234 10.1038/nprot.2009.36 114. Gillotin S Isolation of chromatin-bound proteins from subcellular fractions for biochemical analysis Bio-Protoc. 2018 8 e3035 10.21769/BioProtoc.3035 34532513 PMC8342065 Gillotin, S. Isolation of chromatin-bound proteins from subcellular fractions for biochemical analysis. Bio-Protoc. 8 34532513 10.21769/BioProtoc.3035 PMC8342065 115. Dobin A STAR: ultrafast universal RNA-seq aligner Bioinformatics 2013 29 15 21 10.1093/bioinformatics/bts635 23104886 PMC3530905 Dobin, A. et al. STAR: ultrafast universal RNA-seq aligner. Bioinformatics 29 23104886 10.1093/bioinformatics/bts635 PMC3530905 116. Liao Y Smyth GK Shi W featureCounts: an efficient general purpose program for assigning sequence reads to genomic features Bioinformatics 2014 30 923 930 10.1093/bioinformatics/btt656 24227677 Liao, Y., Smyth, G. K. & Shi, W. featureCounts: an efficient general purpose program for assigning sequence reads to genomic features. Bioinformatics 30 24227677 10.1093/bioinformatics/btt656 117. Love MI Huber W Anders S Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol. 2014 15 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 Love, M. I., Huber, W. & Anders, S. Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2. Genome Biol. 15 25516281 10.1186/s13059-014-0550-8 PMC4302049 118. Buenrostro JD Wu B Chang HY Greenleaf WJ ATAC-seq: a method for assaying chromatin accessibility genome-wide Curr. Protoc. Mol. Biol. 2015 109 21 29 21 29 10.1002/0471142727.mb2129s109 PMC4374986 25559105 Buenrostro, J. D., Wu, B., Chang, H. Y. & Greenleaf, W. J. ATAC-seq: a method for assaying chromatin accessibility genome-wide. Curr. Protoc. Mol. Biol. 109 10.1002/0471142727.mb2129s109 PMC4374986 25559105 119. Buenrostro JD Giresi PG Zaba LC Chang HY Greenleaf WJ Transposition of native chromatin for fast and sensitive epigenomic profiling of open chromatin, DNA-binding proteins and nucleosome position Nat. Methods 2013 10 1213 1218 10.1038/nmeth.2688 24097267 PMC3959825 Buenrostro, J. D., Giresi, P. G., Zaba, L. C., Chang, H. Y. & Greenleaf, W. J. Transposition of native chromatin for fast and sensitive epigenomic profiling of open chromatin, DNA-binding proteins and nucleosome position. Nat. Methods 10 24097267 10.1038/nmeth.2688 PMC3959825 120. Langmead B Salzberg SL Fast gapped-read alignment with Bowtie 2 Nat. Methods 2012 9 357 10.1038/nmeth.1923 22388286 PMC3322381 Langmead, B. & Salzberg, S. L. Fast gapped-read alignment with Bowtie 2. Nat. Methods 9 https://www.nature.com/articles/nmeth.1923#supplementary-information 22388286 10.1038/nmeth.1923 PMC3322381 121. Okonechnikov K Conesa A García-Alcalde F Qualimap 2: advanced multi-sample quality control for high-throughput sequencing data Bioinformatics 2016 32 292 294 10.1093/bioinformatics/btv566 26428292 PMC4708105 Okonechnikov, K., Conesa, A. & García-Alcalde, F. Qualimap 2: advanced multi-sample quality control for high-throughput sequencing data. Bioinformatics 32 26428292 10.1093/bioinformatics/btv566 PMC4708105 122. Zhang Y Model-based analysis of ChIP-Seq (MACS) Genome Biol. 2008 9 R137 10.1186/gb-2008-9-9-r137 18798982 PMC2592715 Zhang, Y. et al. Model-based analysis of ChIP-Seq (MACS). Genome Biol. 9 18798982 10.1186/gb-2008-9-9-r137 PMC2592715 123. Ramirez F deepTools2: a next generation web server for deep-sequencing data analysis Nucleic Acids Res. 2016 44 W160 165 10.1093/nar/gkw257 27079975 PMC4987876 Ramirez, F. et al. deepTools2: a next generation web server for deep-sequencing data analysis. Nucleic Acids Res. 44 27079975 10.1093/nar/gkw257 PMC4987876 124. Kent WJ Zweig AS Barber G Hinrichs AS Karolchik D BigWig and BigBed: enabling browsing of large distributed datasets Bioinformatics 2010 26 2204 2207 10.1093/bioinformatics/btq351 20639541 PMC2922891 Kent, W. J., Zweig, A. S., Barber, G., Hinrichs, A. S. & Karolchik, D. BigWig and BigBed: enabling browsing of large distributed datasets. Bioinformatics 26 20639541 10.1093/bioinformatics/btq351 PMC2922891 125. Neph S BEDOPS: high-performance genomic feature operations Bioinformatics 2012 28 1919 1920 10.1093/bioinformatics/bts277 22576172 PMC3389768 Neph, S. et al. BEDOPS: high-performance genomic feature operations. Bioinformatics 28 22576172 10.1093/bioinformatics/bts277 PMC3389768 126. Quinlan AR Hall IM BEDTools: a flexible suite of utilities for comparing genomic features Bioinformatics 2010 26 841 842 10.1093/bioinformatics/btq033 20110278 PMC2832824 Quinlan, A. R. & Hall, I. M. BEDTools: a flexible suite of utilities for comparing genomic features. Bioinformatics 26 20110278 10.1093/bioinformatics/btq033 PMC2832824 127. Bailey TL Johnson J Grant CE Noble WS The MEME suite Nucleic Acids Res. 2015 43 W39 49 10.1093/nar/gkv416 25953851 PMC4489269 Bailey, T. L., Johnson, J., Grant, C. E. & Noble, W. S. The MEME suite. Nucleic Acids Res. 43 25953851 10.1093/nar/gkv416 PMC4489269 128. Khan A JASPAR 2018: update of the open-access database of transcription factor binding profiles and its web framework Nucleic Acids Res. 2018 46 D260 D266 10.1093/nar/gkx1126 29140473 PMC5753243 Khan, A. et al. JASPAR 2018: update of the open-access database of transcription factor binding profiles and its web framework. Nucleic Acids Res. 46 29140473 10.1093/nar/gkx1126 PMC5753243 129. Bailey TL Machanick P Inferring direct DNA binding from ChIP-seq Nucleic acids Res. 2012 40 e128 10.1093/nar/gks433 22610855 PMC3458523 Bailey, T. L. & Machanick, P. Inferring direct DNA binding from ChIP-seq. Nucleic acids Res. 40 22610855 10.1093/nar/gks433 PMC3458523 130. McLean CY GREAT improves functional interpretation of cis-regulatory regions Nat. Biotechnol. 2010 28 495 501 10.1038/nbt.1630 20436461 PMC4840234 McLean, C. Y. et al. GREAT improves functional interpretation of cis-regulatory regions. Nat. Biotechnol. 28 20436461 10.1038/nbt.1630 PMC4840234 131. Mi H Muruganujan A Casagrande JT Thomas PD Large-scale gene function analysis with the PANTHER classification system Nat. Protoc. 2013 8 1551 1566 10.1038/nprot.2013.092 23868073 PMC6519453 Mi, H., Muruganujan, A., Casagrande, J. T. & Thomas, P. D. Large-scale gene function analysis with the PANTHER classification system. Nat. Protoc. 8 23868073 10.1038/nprot.2013.092 PMC6519453 132. Sherman BT DAVID: a web server for functional enrichment analysis and functional annotation of gene lists (2021 update) Nucleic Acids Res. 2022 50 W216 W221 10.1093/nar/gkac194 35325185 PMC9252805 Sherman, B. T. et al. DAVID: a web server for functional enrichment analysis and functional annotation of gene lists (2021 update). Nucleic Acids Res. 50 35325185 10.1093/nar/gkac194 PMC9252805 133. Huang da W Sherman BT Lempicki RA Systematic and integrative analysis of large gene lists using DAVID bioinformatics resources Nat. Protoc. 2009 4 44 57 10.1038/nprot.2008.211 19131956 Huang da, W., Sherman, B. T. & Lempicki, R. A. Systematic and integrative analysis of large gene lists using DAVID bioinformatics resources. Nat. Protoc. 4 19131956 10.1038/nprot.2008.211 134. Tyanova S The Perseus computational platform for comprehensive analysis of (prote)omics data Nat. Methods 2016 13 731 10.1038/nmeth.3901 27348712 Tyanova, S. et al. The Perseus computational platform for comprehensive analysis of (prote)omics data. Nat. Methods 13 https://www.nature.com/articles/nmeth.3901#supplementary-information 27348712 10.1038/nmeth.3901 135. Shannon P Cytoscape: a software environment for integrated models of biomolecular interaction networks Genome Res. 2003 13 2498 2504 10.1101/gr.1239303 14597658 PMC403769 Shannon, P. et al. Cytoscape: a software environment for integrated models of biomolecular interaction networks. Genome Res. 13 14597658 10.1101/gr.1239303 PMC403769 136. Goenawan IH Bryan K Lynn DJ DyNet: visualization and analysis of dynamic molecular interaction networks Bioinformatics 2016 32 2713 2715 10.1093/bioinformatics/btw187 27153624 PMC5013899 Goenawan, I. H., Bryan, K. & Lynn, D. J. DyNet: visualization and analysis of dynamic molecular interaction networks. Bioinformatics 32 27153624 10.1093/bioinformatics/btw187 PMC5013899 137. R Core Team. R: A language and environment for statistical computing. R Foundation for Statistical Computing, Vienna, Austria. https://www.R-project.org/ 138. Zhang X Proteome-wide identification of ubiquitin interactions using UbIA-MS Nat. Protoc. 2018 13 530 10.1038/nprot.2017.147 29446774 Zhang, X. et al. Proteome-wide identification of ubiquitin interactions using UbIA-MS. Nat. Protoc. 13 https://www.nature.com/articles/nprot.2017.147#supplementary-information 29446774 10.1038/nprot.2017.147 139. gplots: Various R Programming Tools for Plotting Data. R package version 3.0.1.1. (2019). 140. Mi H Muruganujan A Ebert D Huang X Thomas PD PANTHER version 14: more genomes, a new PANTHER GO-slim and improvements in enrichment analysis tools Nucleic Acids Res. 2018 47 D419 D426 10.1093/nar/gky1038 PMC6323939 30407594 Mi, H., Muruganujan, A., Ebert, D., Huang, X. & Thomas, P. D. PANTHER version 14: more genomes, a new PANTHER GO-slim and improvements in enrichment analysis tools. Nucleic Acids Res. 47 10.1093/nar/gky1038 PMC6323939 30407594 141. Herwig R Hardt C Lienhard M Kamburov A Analyzing and interpreting genome data at the network level with ConsensusPathDB Nat. Protoc. 2016 11 1889 10.1038/nprot.2016.117 27606777 Herwig, R., Hardt, C., Lienhard, M. & Kamburov, A. Analyzing and interpreting genome data at the network level with ConsensusPathDB. Nat. Protoc. 11 https://www.nature.com/articles/nprot.2016.117#supplementary-information 27606777 10.1038/nprot.2016.117 142. Sievers F Fast, scalable generation of high-quality protein multiple sequence alignments using Clustal Omega Mol. Syst. Biol. 2011 7 539 10.1038/msb.2011.75 21988835 PMC3261699 Sievers, F. et al. Fast, scalable generation of high-quality protein multiple sequence alignments using Clustal Omega. Mol. Syst. Biol. 7 21988835 10.1038/msb.2011.75 PMC3261699 143. Li X Romero P Rani M Dunker AK Obradovic Z Predicting protein disorder for N-, C-, and internal regions Genome Inf. Ser. Workshop Genome Inf. 1999 10 30 40 11072340 Li, X., Romero, P., Rani, M., Dunker, A. K. & Obradovic, Z. Predicting protein disorder for N-, C-, and internal regions. Genome Inf. Ser. Workshop Genome Inf. 10 11072340 144. Obradovic Z Predicting intrinsic disorder from amino acid sequence Proteins 2003 53 566 572 10.1002/prot.10532 14579347 Obradovic, Z. et al. Predicting intrinsic disorder from amino acid sequence. Proteins 53 14579347 10.1002/prot.10532 145. Dosztányi Z Mészáros B Simon I ANCHOR: web server for predicting protein binding regions in disordered proteins Bioinformatics 2009 25 2745 2746 10.1093/bioinformatics/btp518 19717576 PMC2759549 Dosztányi, Z., Mészáros, B. & Simon, I. ANCHOR: web server for predicting protein binding regions in disordered proteins. Bioinformatics 25 19717576 10.1093/bioinformatics/btp518 PMC2759549 146. van der Raadt J van Gestel SHC Nadif Kasri N Albers CA ONECUT transcription factors induce neuronal characteristics and remodel chromatin accessibility Nucleic Acids Res. 2019 47 5587 5602 10.1093/nar/gkz273 31049588 PMC6582315 van der Raadt, J., van Gestel, S. H. C., Nadif Kasri, N. & Albers, C. A. ONECUT transcription factors induce neuronal characteristics and remodel chromatin accessibility. Nucleic Acids Res. 47 31049588 10.1093/nar/gkz273 PMC6582315 147. Perez-Riverol Y The PRIDE database at 20 years: 2025 update Nucleic Acids Res. 2024 53 D543 D553 10.1093/nar/gkae1011 PMC11701690 39494541 Perez-Riverol, Y. et al. The PRIDE database at 20 years: 2025 update. Nucleic Acids Res. 53 10.1093/nar/gkae1011 PMC11701690 39494541 ",
  "metadata": {
    "Title of this paper": "The PRIDE database at 20 years: 2025 update",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485055/"
  }
}