{
  "title": "Paper_58",
  "abstract": "pmc Mol Cancer Mol Cancer 117 molcanc Molecular Cancer 1476-4598 BMC PMC12492556 PMC12492556.1 12492556 12492556 41039553 10.1186/s12943-025-02433-4 2433 1 Review Decoding the ubiquitin network: molecular mechanisms and therapeutic vulnerabilities for precision radio-sensitization in cancer Zhao Fu-Ying 1 Shi Li-Ye 2 Yu Lu-Jiao 2 Wang Si-Qi 1 Sun Chu-Yao 1 Zhang Na 18900917253@163.com 3 Wang Hua-Qin hqwang@cmu.edu.cn 1 1 https://ror.org/00v408z34 grid.254145.3 0000 0001 0083 6092 Department of Biochemistry & Molecular Biology, China Medical University, 2 https://ror.org/04wjghj95 grid.412636.4 Department of Geriatrics, The First Hospital Of China Medical University, 3 https://ror.org/05d659s21 grid.459742.9 0000 0004 1798 5889 Department of Radiation Oncology, Cancer Hospital of China Medical University, Liaoning Cancer Hospital & Institute, 2 10 2025 2025 24 478187 233 17 6 2025 5 8 2025 02 10 2025 04 10 2025 04 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Radiotherapy resistance remains a major clinical challenge, largely driven by tumors’ ability to dynamically adapt through complex molecular networks. Critically, the ubiquitin system has emerged as a critical regulator of this resistance. This review examines how the ubiquitin system orchestrates radiotherapy resistance through spatiotemporal control of DNA repair fidelity, metabolic reprogramming, and immune evasion. We explore how the ubiquitin code, defined by its chain topology diversity (such as K48-linked proteolysis versus K63-mediated signaling) and crosstalk with phosphorylation, SUMOylation, and acetylation, generates diverse resistance mechanisms. These mechanisms, however, also present vulnerabilities exploitable for radio-sensitization. Notably, monoubiquitylation of both histone and non-histone protein collaboratively modulates chromatin dynamics and DNA damage responses to maintain genome integrity during radiation. Furthermore, ubiquitination critically regulates caner metabolism, reprogramming processes such as ferroptosis susceptibility, hypoxia adaptation, and nutrient flux, thereby creating targetable vulnerabilities for radio-sensitization. While targeting key E3 ligases and deubiquitinases (DUBs) shows preclinical promise, clinical translation faces obstacles including functional redundancy, unintended on-target toxicity, and adaptive tumor responses. Distinct from other post-translational modifications (PTMs), the ubiquitin system offers unique clinical advantages: its dynamic reversibility, chain topology diversity, and recent breakthroughs in targeted degradation (e.g., PROTACs) enable precise disruption of radioresistance networks. By integrating these mechanistic insights with biomarker-guided therapeutic strategies, ubiquitin-targeting agents are emerging as fundamental components of next-generation radiotherapy protocols. Keywords Ubiquitination modification Radiotherapy resistance DNA damage repair Deubiquitinases (DUBs) Ferroptosis Metabolic reprogramming Targeted therapy the Liaoning Province Central Guidance Local Science and Technology Development Fund Plan 2024JH6/100800018 Wang Hua-Qin pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Radiotherapy continues to serve as a foundational treatment for solid tumors, exerting its effects through direct DNA damage and indirect immune activation [ 1 2 3 4 Mounting clinical evidence firmly establishes the ubiquitin system as a master regulator orchestrating radioresistance. This regulation occurs through its manipulation of DNA repair fidelity [ 5 6 7 11 12 13 12 Critically, this deepening mechanistic understanding is now driving the development of targeted therapeutic strategies. Capitalizing on the druggable nature of the ubiquitin system, significant progress has been made, particularly with proteolysis-targeting chimeras (PROTACs), which demonstrate compelling radiosensitizing effects [ 14 15 16 17 18 While the involvement of the ubiquitin system in DNA repair is well-documented [ 5 19 20 1  Table 1 Tissue-Specific roles of key ubiquitin enzymes in radioresistance and therapeutic vulnerabilities Enzyme Tumor Type Function in Radioresistance Therapeutic Vulnerability Ref. Ubiquitin Enzyme FBXW7 Breast cancer Radioresistance MDM2/FBXW7 co-inhibition prevents compensatory resistance 9, 21 NSCLC Radiosensitization Targeting SOX9 24 TRIM26 Glioma K63-linked ubiquitination stabilizes GPX4 to suppress ferroptosis GPX4-K63 ubiquitination as biomarker; ferroptosis inducers + TRIM26 inhibition. 10 β-TrCP Lung cancer Radioresistance EGFR-directed PROTACs deqrade β-TrCP substrates selectively in tumors 16 TRIM21 Nasopharynx K48-linked ubiquitin-mediated degradation of VDAC2 inhibits the cGAS-STING pathway, promoting immune evasion Combined immunotherapy to overcome immune suppression 12 Glioma Radioresistance Inhibiting MLPH Ser510 O-GlcNAcylation 129 RNF126 TNBC Radioresistance RNF126 + ATM inhibition, synthetic lethality 40 Deubiquitinase enzymes USP14 Glioma Radioresistance USP14 inhibitors 26 NSCLC Radiosensitization Inhibiting USP14 to disrupt DNA damage response 92 HNSCC Radioresistance Catalytic inhibition 27 USP7 Breast cancer Stabilizes CHK1 to maintain genomic stability CHK1 inhibition 88 HPV + Counteracts ubiquitination of DNA-PKcs to maintain repair competence Targeting p16 function or its ubiquitin cascade to impair DNA repair 43 USP28 Esophageal Radioresistance Inhibiting USP28 to disrupt c-Myc/HIF−1α signaling 56 Breast/Liver Tumor suppression Targeting USP28 for radiosensitization 107 OTUB1 Lung cancer Radioresistance Inhibiting OTUB1 to destabilize CHK1 42 Gastric cancer Radioresistance Targeting the OTUB1-GPX4 interaction 79 nasopharyn-geal carcinoma FTO promotes the expression of OTUB1 and inhibits ferroptosis. Inhibiting FTO-OTUB1 axis 95 UCHL1 Breast cancer Radioresistance UCHL1 inhibition in hypoxic tumors 83 HNSCC Predictive biomarker for radiotherapy sensitivity Targetable vulnerabilities in UCHL1-classified tumors 109 Ubiquitin chain hierarchies in radiation resistance Ubiquitin chain architectures, including K48-linked polyubiquitylation, K63-linked signaling scaffolds, and monoubiquitylation, constitute a sophisticated regulatory system governing tumor radioresistance through distinct spatial and functional mechanisms [ 5 21 23 19 1 Fig. 1 Ubiquitination cascade and functional outcomes of ubiquitin chain architectures. The enzymatic cascade involves ubiquitin (Ub) activation by E1 (ATP-dependent), E2-bound Ub carriage, and E3-mediated substrate conjugation. Substrates undergo mono-ubiquitination or polyubiquitination with distinct chain topologies (e.g., K48-linked or K63-linked), directing divergent cellular fates: K48 chains target substrates for proteasomal degradation, K63 chains enable signal transduction, and mono-ubiquitination facilitates epigenetic adaptation K48 ubiquitination: proteostatic gatekeeper with contextual duality The impact of K48-linked ubiquitination on radiation response are highly context-dependency. FBXW7 exemplifies this duality: in p53-wild type colorectal tumors, it promotes radioresistance by degrading p53 and inhibiting apoptosis [ 21 24 21 24 24 This contextual duality extends to metabolic adaptation. SMURF2-mediated HIF1α degradation compromises hypoxic survival [ 25 11 12 Tissue-specific enzyme activity presents another therapeutic challenge. USP14 stabilizes ALKBH5 to maintain glioblastoma stemness [ 26 27 2 Fig. 2 K48 Ubiquitination: Proteostatic Gatekeeper with Contextual Duality. K48-mediated polyubiquitination acts as a proteostatic gatekeeper with opposing roles in irradiated cells. While promoting tumor suppression through degradation of substrates like SOX9 and HIF1α, it also drives radioresistance in nasopharyngeal carcinoma by degrading pro-apoptotic factors (e.g., p53) and stabilizing NF-κB. Key regulators including E3 ligases (FBXW7, TRIM21, SMURF2), deubiquitinases (USP14, USP44), and tissue-specific enzymes, collectively influence radiotherapeutic outcomes K63 ubiquitination: the architect of adaptive survival Beyond structural roles, K63-linked ubiquitin chains directly orchestrate cell survival pathways. For instance, FBXW7 employs K63 chains to modify XRCC4, enhancing the accuracy of non-homologous end joining (NHEJ) repair [ 5 28 29 22 10 30 3 Fig. 3 K63-linked ubiquitination orchestrates adaptive survival networks in irradiated cells. Radiation and genotoxic stimuli trigger K63-polyubiquitin-dependent signaling cascades that coordinate survival and death decisions. TRAF4-mediated K63 chains drive radioresistance by activating AKT/JNKs to stabilize anti-apoptotic proteins (MCL-1, Bcl-xL), while the p53-TRAF6-p300 axis regulates cell death by modulating apoptosis (via p21/Gadd45) and ferroptosis (via GPX4/TRIM26). Concurrently, K63-linked ubiquitination activates STING-IRF3 signaling to prime adaptive antitumor immunity (CD8⁺ T-cell responses) Monoubiquitylation: guardian of chromatin and genome stability Monoubiquitylation of both histones and non-histone proteins critically regulates radiation adaptation. For histones, UBE2T/RNF8-mediated H2AX monoubiquitylation accelerates damage detection in hepatocellular carcinoma [ 23 31 32 33 34 35 4 Fig. 4 Monoubiquitination coordinates chromatin remodeling, DNA repair, and genomic stability in radiation response. High-LET radiation initiates UBE2T/RNF8-mediated monoubiquitination of H2AX and FANCD2 to activate CHK1-dependent DNA repair and radioresistance at double-strand breaks. Subsequent recruitment of H2Bub1 facilitates chromatin relaxation for DSB repair while simultaneously engages USP44 to sustain genomic integrity. The USP44-linc-RA1-H2Bub1 axis further enforces genomic surveillance by preventing centrosome overduplication and balancing radioresistance with autophagy, with NBS1/BRCA1 and γ-tubulin reinforcing replication fidelity throughout the cascade Ubiquitination orchestrates epigenetic remodeling, autophagy, and immune evasion Ubiquitination critically reprograms epigenetic landscapes and immune responses post-irradiation. Histone ubiquitination directly regulates chromatin accessibility at DNA damage sites. For example, RNF40-mediated H2Bub1 recruits the FACT complex to relax nucleosome packing, facilitating homologous recombination repair (HRR) while simultaneously suppressing immunogenic cell death [ 32 36 37 Ubiquitination also bridges autophagy and radiation adaptation. SUMOylated SH3GLB1 activates PINK1/Parkin-mediated mitophagy, clearing radiation-damaged mitochondria to sustain tumor cell survival [ 38 39 Crucially, ubiquitin signaling modulates tumor-immune crosstalk. TRIM21 suppresses antitumor immunity by promoting K48-linked degradation of VDAC2, inhibiting mitochondrial DNA release and cGAS/STING activation in nasopharyngeal carcinoma [ 12 30 Ubiquitin code plasticity: an adaptive mechanism Radiation dynamically reprograms ubiquitin signaling by altering chain formation, creating vulnerabilities exploited by tumors. Cancer cells strategically manipulate K63-linked chains to stabilize DNA repair factors (e.g., BRCA1) while concurrently inhibiting K48-mediated degradation of survival proteins like GPX4 [ 5 10 Within the DNA repair pathway, RNF126-mediated K27/K29 Polyubiquitin of MRE11 activates the ATM-CHK1 axis in TNBC, thereby promoting error-prone repair [ 40 41 In addition, ubiquitin rewiring also underpins metabolic adaptation to radition stress. For instance, TRIM26 stabilizes GPX4 via K63 chains to suppress ferroptosis in gliomas [ 10 16 These opposing mechanisms reveal that chain-editing enzymes spatially regulate therapeutic vulnerability. Critically, DUBs fine-tune this balance: OTUB1 stabilizes CHK1 by removing K48 chains in lung cancer, prolonging cell cycle arrest [ 42 + 43 Recent technological advances map these adaptations: Single-cell transcriptomics identifies radiation-induced K63 ubiquitination signatures in USP9X-high lung cancer stem cells, correlating with REV1-mediated translesion synthesis [ 44 45 46 Therapeutic implications arise from this plasticity. While H2Bub1 modifications enhance homologous recombination, their mechanism underlying suppressing immunogenic cell death remains incompletely defined [ 31 Crosstalk between ubiquitination and other post-translational modifications Ubiquitination collaborates with phosphorylation, SUMOylation, acetylation, and neddylation to form an integrated stress-response network during radiotherapy. This system directly dictates cellular fate under radiation by regulating protein stability and functional states [ 47 48 22 49 30 Ubiquitination-phosphorylation circuitry in radioresistance Bidirectional ubiquitination-phosphorylation crosstalk drives radioresistance by coordinating DNA repair fidelity, survival signaling, and metabolic adaptation. These modifications form a self-reinforcing regulatory cycle: phosphorylation activates E3 ligases, while ubiquitination reciprocally regulates kinase signaling, ultimately shaping context-dependent therapeutic responses (Fig. 5 Fig. 5 Ubiquitination orchestrates crosstalk with ( a b c d) This synergy exhibits notable tissue specificity. In glioma, PLK1 phosphorylates TRIM26, enhancing its E3 ligase activity to promote K63-linked GPX4 ubiquitination and ferroptosis suppression [ 10 9 50 51 52 53 Temporal dynamics critically influence functional outcomes. In nasopharyngeal carcinoma, CDC6 phosphorylation concurrently induces G0/G1 arrest and activates epithelial-mesenchymal transition (EMT) pathways, with net biological effects determined by temporal context [ 49 54 Kinase-ubiquitin feedback loops further refine cellular regulation. TRAF4-mediated K63 ubiquitination of JNK activates Bcl-xL to inhibit apoptosis in colorectal cancer [ 28 40 55 56 57 58 59 Therapeutic targeting of this crosstalk shows compelling radiosensitizing effects, particularly in aggressive subtypes. Combined RNF126 and ATM inhibition in TNBC blocks K63-linked MRE11 ubiquitination, disrupting the ATM-CHK1 axis and increasing radiation-induced apoptosis [ 40 60 61 62 Clinical translation requires temporally optimized interventions: initial DNA repair inhibition (e.g., RNF126 and ATM blockade) followed by p53 reactivation maximizes tumor radiosensitization while minimizing normal tissue toxicity [ 26 40 Ubiquitination-SUMOylation crosstalk in radioresistance Ubiquitination-SUMOylation coordination underpins radioresistance through amplified DNA damage signaling, adaptive survival mechanisms, and targetable vulnerabilities. This interaction allows tumors to withstand radiation by synchronizing DNA repair fidelity, mitochondrial homeostasis, and transcriptional reprogramming (Fig. 5b). At DNA damage sites, SUMOylation scaffolds enhance ubiquitin-dependent repair. ZNF451 attaches SUMO2 to RNF168, strengthening RNF8 interactions to amplify H2A/H2AX ubiquitination and recruit BRCA1-A repair complexes [ 37 63 64 65 Beyond DNA repair, this crosstalk orchestrates mitochondrial and transcriptional radioresitance pathways, creating actionable therapeutic vulnerabilities. SUMO2-mediated SH3GLB1 SUMOylation hyperactivates PINK1/Parkin mitophagy, enabling tumor cells to eliminate radiation-damaged mitochondria and evade apoptosis. Targeting this axis with SUMO2 inhibitors (e.g., TAK-981) blocks mitochondrial clearance and synergizes with radiotherapy in sarcoma models [ 38 66 67 8 The SENP protease family calibrates this system by regulating DNA repair kinetics while preserving mitochondrial integrity and transcriptional fitness [ 68 69 70 Ubiquitination-acetylation networks in radioresistance Ubiquitination and acetylation cooperatively drive radioresistance through epigenetic reprogramming and transcriptional control. These modifications jointly remodel chromatin to influence DNA repair pathways: RNF40-mediated H2Bub1 recruits the FACT complex to enhance H3K56 acetylation (H3K56ac), promoting precise homologous recombination repair [ 31 71 5 Ubiquitination further regulates acetylation enzymes. USP38 stabilizes HDAC1 via deubiquitylation, reducing H3K56ac and impairing NHEJ efficiency [ 6 72 22 These mechanistic discoveries reveal promising therapeutic opportunities for overcoming radioresistance. Disrupting HDAC4-Ubc9 interactions restores homologous recombination proficiency in hepatocellular carcinoma [ 72 6 31 71 2 Ubiquitination-neddylation crosstalk in radioresistance Ubiquitination-neddylation interplay primarily modulates radioresistance through Cullin-RING E3 ligases (CRLs) and tumor microenvironment adaptation. Neddylation activates CRL complexes, enabling targeted ubiquitination and degradation of DNA damage regulators (e.g., CDC6, WEE1 and p21), thereby accelertating cell cycle progression and enhancing DNA repair [ 20 20 73 75 CRL-independent roles also exist: reduced NAE1/APP-BP1 activity in HPV + 76 77 78 Clinical challenges arise from functional duality: MLN4924 stabilizes pro-apoptotic NOXA but simultaneously accumulates HIF-1α, causing toxicities [ 73 77 77 Ubiquitination-metabolism interplay in radioresistance Ubiquitination dynamically orchestrates metabolic reprogramming to sustain tumor radioresistance, extending beyond ferroptosis and hypoxia to regulate glycolysis, nucleotide synthesis, and redox homeostasis [ 19 6 Fig. 6 Ubiquitination-metabolism interplay controls radiation response. Ferroptosis regulation involves TRIM26-mediated K63-linked GPX4 stabilization (glioma radioresistance), OTUB1-driven GPX4 degradation via K48 chains (gastric cancer radiosensitivity), and HSP90-WWP1/2-SLC7A11/SOCS2-SLC7A11 axes (cervical/liver cancer ferroptosis modulation). Hypoxic adaptation hinges on HIF-1a ubiquitination: UCHL1 targeting in liver cancer, USP28-c-Myc-HIF-1 a in esophageal cancer, and CRL2/FBXW7-mediated HIF-1a control in glioma, with adenosines modulating sensitivity. Amino acid reprogramming includes FBXW7/GSK3b-IGF2BP2-driven methionine cycle disruption (lung cancer radiosensitivity) and USP9X-REV1-mediated glycine/serine flux alterations (lung cancer radioresistance), collectively defining ubiquitin ligases/DUBs as metabolic switches Redox homeostasis and ferroptosis regulation GPX4 and SLC7A11 Ubiquitination integrates with broader redox metabolism by regulating glutathione synthesis and NADPDH regeneration [ 11 10 79 11 80 81 82 9 Hypoxic adaptation via HIF-1α switching Context-dependent HIF-1α stability enables ubiquitin-mediated hypoxic adaptation. Breast cancers utilize UCHL1 to stabilize HIF-1α, activating the pentose phosphate pathway and enhancing antioxidant defenses against radiation [ 83 56 78 84 Amino acid metabolic reprogramming Ubiquitination actively redirects metabolic flux in radioresistant tumors. In lung cancer, FBXW7 partners with GSK3β to degrade IGF2BP2, disrupting methionine cycle-driven methylation and homologous recombination repair [ 85 44 Clinical translation challenges Harnessing these insights faces practical hurdles: Phase-dependent SLC7A11 regulation (e.g., ESR1-NEDD4L interactions) requires temporally precise interventions [ 81 44 Functional complexity and therapeutic precision of dubs in radioresistance DUBs coordinate multiple facets of tumor radioresistance, including DNA repair, metabolic plasticity, immune evasion, and stem cell maintenance. Their context-dependent functions necessitate highly precise therapeutic approaches (Table 2  Table 2 Functional complexity and precision therapeutic challenges of dubs in tumor radioresistance DUBs Famliy Mechanisms of action Radiotherapy Refs. USP family BRD7 interferes with the interaction between USP5 Radiosensitizes 86 USP5 Radioresistance 87 USP7 Radioresistance 88 p16 HUWE1- USP7- Radiosensitizes 43 USP9X Radioresistance 44 USP9X Radioresistance 89 USP11 Radioresistance 90 USP11 Radiation-Induced Pneumonitis 91 USP14 Radioresistance 92 GSTM3 promotes ferroptosis through the USP14 Radiosensitizes 7 USP14 Radioresistance 26 USP28 Radioresistance 56 USP28 Radioresistance 93,94 OTU family OTUB1 Radioresistance 42 FTO promotes OTUB1 Radioresistance 95 OTUD4 Radiosensitizes 96 OTUD4 Radioresistance 97 OTUD5 Radiosensitizes 95 UCH family UCHL1 Radioresistance 83 UCHL1 Radioresistance 98 UCHL3 Radioresistance 99 UCHL3 Radioresistance 100 BAP1 Radioresistance 101 BAP1 Radioresistance 102 Tissue-Specific functional landscapes of DUB families The USP family exemplifies functional duality across tumor types: USP5 stabilizes EphA2 to promote resistance in nasopharyngeal carcinoma [ 86 87 88 + 43 44 89 90 91 92 26 7 56 93 94 OTU family members utilize distinct resistance mechanisms: OTUB1 stabilizes CHK1 to maintain repair fidelity [ 42 95 96 97 57 UCHL1 and BAP1 remodel stemness and microenvironment: UCHL1 stabilizes HIF-1α/PPP pathways in breast cancer [ 83 98 99 100 101 102 Overcoming therapeutic barriers Temporal specificity (e.g. phase-dependent roles of USP14 [ 26 92 + 43 103 100 73 79 97 26 104 105 106 79 Navigating functional plasticity DUBs exhibit marked functional plasticity: USP28 acts as a tumor suppressor in breast/liver cancers [ 107 56 108 83 109 106 32 Combinatorial therapeutic synergy Strategic combinations overcome radioresistance through complementary molecular mechanisms. USP1 inhibitors/STING agonists combinations stabilize oligo-ubiquitinated SAR1A, promoting STING trafficking to enhance radiation-induced IFN production and CD8 + BRCA 106 79 Clinical validation emerges from phase I trials: Pevonedistat (MLN4924)/belinostat combinations in AML upregulate ferroptosis genes ( SLC7A11 GSR NQO1 110 111 Targeting E3 ubiquitin ligases to overcome radioresistance E3 ubiquitin ligases critically drive tumor radioresistance through DNA repair fidelity, metabolic rewiring, and immune evasion. Targeting these enzymes requires context-specific strategies to exploit their unique vulnerabilities (Table 3  Table 3 Targeting E3 ubiquitin ligases to overcome radioresistance UBs Famliy Mechanisms of action Intervention Refs. RING family Restoration of apoptosis and DNA damage responses MDM2 inhibitors like Nutlin-3 and MI-219 112–116 β-TrCP promotes the radioresistance of NSCLC by degrading repair proteins Mxi1 and LZTS3 Knockdown of β-TrCP 47,16,118 SKP2 blocks PDCD4 degradation and amplifies radiation-induced apoptosis (Bortezomib) or direct inhibitors (SKP2-C25) 119–121 FBXW7 sensitizes tumors by degrading MCL1/IGF2BP2 Knockdown strategies 85,122 Cullin-RING ligases Inhibition of Neddylation modification destabilizes CDC6/WEE1 MLN4924 20,73 HIF-1α/VEGF degradation CUL2 overexpression strategy 78 XIAP members maintain radiation resistance by stabilizing RAD51 SMAC mimetics (Xevinapant) 127–129 RNF8/RNF168 complexes amplify DNA damage signaling Knockdown strategies 130–132 TRIM21suppresses antitumor immunity; TRIM21 stabilizes MLPH in gliomas Knockdown of TRIM21 12,133 HECT family Hsp90-mediated inhibition of NEDD4L stabilizes dCK/SLC7A11 Knockdown of Hsp90 81,82 HECTD3 positively regulates ZEB1 expression by regulating ubiquitination of LKB1 protein. Knockdown of HECTD3 or direct inhibitors 134 HECTD3 drives glioma drug resistance by activating PRDX1 Knockdown of HECTD3 or PRDX1 135 SMURF1/2 upregulation promotes survival through TGF-β and glycolytic reprogramming Knockdown of SMURF1/2 136,137 U-box ligase CHIP CHIP mediates p21 degradation Knockdown of CHIP 138 CHIP inhibits the PBK/ERK axis CHIP overexpression strategy 139 RBR family E3 ligase LACTB2/NEAT1 induces PINK1/Parkin mediated mitophagy Knockdown strategies 140,141 PHB2 regulated the expression of PGAM5 and PINK1 by directly binding to PARL Knockdown of PHB2 142 TRAF family E3 ligases TRAF4 regulates ubiquitination-modulated survivin turnover and confers radioresistance Knockdown of TRAF4 or direct inhibitors 29,143 TRAF6 restricts p53 interaction with MCL−1/BAK by promoting K63-linked p53 ubiquitination, limiting p53 mitochondrial translocation and apoptosis. Knockdown of TRAF6 or direct inhibitors 22,144,145 DNA repair and cell fate regulation by RING family ligases RING family ligases balance DNA repair and cell death to confer radioresistance. MDM2 inhibitors (e.g., Nutlin-3) reactivate p53-dependent apoptosis, radiosensitizing esophageal and prostate cancers [ 112 116 117 β-TrCP exacerbates radiation-induced lung inflammation [ 47 16 118 119 121 85 122 5 CRLs: gatekeepers of microenvironment adaptation Cullin-RING complexes (CRLs) regulate radioresistance through DNA repair and microenvironment adaptation. The Neddylation inhibitor MLN4924 destabilizes CDC6/WEE1 to radiosensitize multiple cancers [ 20 73 123 124 125 124 126 CUL2 degrades HIF-1α/VEGF to suppress hypoxia-driven radioresistance in glioblastoma [ 78 127 129 130 132 12 133 Metabolic and antioxidant control by HECT/U-box/RBR ligases HECT family ligase NEDD4L promotes ferroptosis by degrading SLC7A11 in breast cancer [ 81 82 134 135 136 137 U-box/RBR ligase CHIP exhibits context-dependent functions in lung cancer, promoting senescence via p21 degradation [ 138 139 140 141 39 142 Immune modulation via TRAF ligases TRAF ligases critically modulate immune-cell death crosstalk. TRAF4 stabilzies MCL-1/surviving via Akt activation to drive oral cancer resistance [ 29 143 22 144 145 Translational challenges and future research directions in ubiquitination-targeted radiotherapy The clinical translation of ubiquitin-targeted radiotherapy faces significant hurdles that demand integrated solutions spanning mechanistic research, technological innovation, and biomarker-driven clinical validation. Below we outline key challenges and strategic priorities. Decoding ubiquitin networks: technological imperatives Current mass spectrometry lacks temporal resolution to capture rapid ubiquitin chain dynamics (e.g., post-irradiation K48/K63 flux) [ 19 146 26 19 Precision targeting: overcoming redundancy Functional redundancy remains a fundamental barrier. USP28 exemplifies this challenge, driving duality esophageal cancer progression via c-Myc stabilization while suppressing EMT in breast tumors [ 56 107 123 124 124 10 111 To overcome on-target toxicity and compensatory resistance mechanism, several innovative strategies are emerging. Tissue-targeted agents (e.g., EGFR-directed PROTACs) achieve tumor-specific degradation of β-TrCP substrates in lung tumors while sparing normal tissues [ 16 79 BRCA 106 9 21 Advancing these strategies requires accelerated development of three enabling technologies: PROTACs for spatial control of protein degradation, CRISPR-based synthetic lethality screens for identifying context-dependent vulnerabilities, and nanoparticle delivery systems (exemplified by bismuth sulfide nanoflowers) for temporal precision in targeting cancer stem cells [ 104 Exploiting ubiquitin-PTM crosstalk Ubiquitination’s interplay with other modifications offers untapped potential. USP14 inhition stabilize IRF3, converting immunologically “cold” tumors into radiation-responsive environments when combined with checkpoint inhibitors [ 30 65 These approaches share a core principle, simultaneously targeting PTM hubs and immune checkpoints overwhelms adaptive survival pathways. Sequential strategies, ubiquitin inhibition followed by DNA repair/immune activation, may optimize efficacy. Next-generation radiotherapy models Current models inadequately recapitulate human radiotherapy responses. Animal xenografts lack mitophagy and immune microenvironment dynamics [ 38 91 147 148 To bridge the critical gap between conventional models and human radiotherapy responses, we propose a dual approach utilizing advanced molecular profiling and physiologically relevant systems. Spatial transcriptomic analysis of radiotherapy-resistant PDOs enables identification of biomarkers, such as hypoxia-driven USP44 methylation patterns predictive of DNA repair competency [ 114 101 AI-driven precision radiotherapy integration Artificial intelligence enables real-time radiotherapy personalization through multi-scale data integration. We envision a closed-loop clinical system initiated by pre-treatment ubiquitin mapping via rapid mass spectrometry of liquid biopsies to connect metabolic vulnerabilities (e.g., SLC7A11-dependent ferroptosis) with epigenetic states (H3K56ac levels), predicting therapeutic outcomes [ 149 149 59 150 The convergence of spatial transcriptomics in USP44 111 10 145 Conclusion The ubiquitin system critically regulates tumor radioresistance by dynamically controlling DNA repair, metabolic reprogramming, immune evasion, and stress responses through precise regulation of protein stability and signaling cascade. Key ubiquitin-dependent mechanisms, including K48-linked degradation, K63-mediated signaling, and monoubiquitylation, collectively balance proteasomal targeting, DNA repair complex assembly, and chromatin remodeling in response to therapeutic radiation [ 5 19 31 37 60 151 Preclinical studies show promise in targeting E3 ligases (MDM2, TRIM26) or DUBs (USP14, OTUB1) to destabilize critical radioresistance mediators like GPX4, HIF-1α, and PARP1 [ 10 56 152 153 73 19 71 Overcoming these limitations requires precision strategies targeting tumor-specific weaknesses. Tissue-selective approaches, exemplified by EGFR-directed β-TrCP degraders (PROTACs) could maximize antitumor efficacy while minimize off-target effects [ 16 47 111 149 30 79 114 In conclusion, converting radioresistance into a therapeutic vulnerability demands shifting from empiricism to mechanism-based approaches. Deciphering the plasticity of ubiquitin signaling through cryo-EM structural insights and adaptive AI technologies will be pivotal in developing truly personalized radiotherapy regimens, ultimately advancing a new paradigm in precision oncology. Abbreviations DUBs Deubiquitinases GPX4 Glutathione peroxidase SLC7A11 Solute Carrier Family 7 Member 11 PROTACs Proteolysis TArgeting Chimeras Ub Ubiquitin FBXW7 F-box and WD repeat-domain containing 7 SOX9 SRY-box transcription factor 9 SOCS2 Suppressor of Cytokine Signaling 2 TRIM21 Tripartite Motif Containing 21 VDAC2 Voltage-dependent anion channel 2 SMURF2 Smad ubiquitination regulatory factor 2 cGAS Cyclic GMP-AMP Synthase STING Stimulator of Interferon Genes USP14 Ubiquitin specific peptidase 14 ALKBH5 AlkB homolog 5 NHEJ Non-homologous end joining TRAF4 TNF receptor-associated factor 4 MCL-1 Myeloid cell leukemia-1 UBE2T Ubiquitin-conjugating enzyme E2T FANCD2 FA group D2 protein H2Bub1 Monoubiquitylation of histone H2B SUPT16H Suppressor of Ty homolog-16 EMT Epithelial-mesenchymal transition OTUD5 OTU deubiquitinase 5 EZH2 Enhancer of zeste homolog 2 TNBC Triple negative breast cancer KAP1 KRAB domain-associated protein 1 MDM2 Murine double minute 2 KLF5 Krüppel-like factor 5 SENP Sentrin-specific protease RUVBL1 RuvB-like protein 1 DTL Dentideless IGF2BP2 Insulin-like growth factor 2 mRNA-binding protein 2 PTM Post-translational modification NSCLC Non-small cell lung cancer ESR1 Estrogen receptor CTH Cystathionase CRLs Cullin-RING complexes PDOs Patient-derived organoids HRR Homologous recombination repair NCTD Norcantharidin HNSCC Head and neck squamous cell carcinoma Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Fu-Ying Zhao, Li-Ye Shi and Lu-Jiao Yu contributed equally to this work. Acknowledgements Thanks to Biorender (www.biorender.com) for the drawing figures. Authors' contributions H.W. designed the framework of this article and drafted the manuscript; F.Z. created the figures and tables; L.S. and L.Y. illustrated the figures; S.W., C.S., H.W. and N.Z. critically revised the manuscript for intellectual content and ensured scientific rigor. All authors contributed to the article and approved the submitted version. Funding This work was supported by the Liaoning Province Central Guidance Local Science and Technology Development Fund Plan (2024JH6/100800018). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent of publication Not applicable. Competing interests The authors declare no competing interests. References 1. Huang RX Zhou PK DNA damage response signaling pathways and targets for radiotherapy sensitization in cancer Signal Transduct Target Ther 2020 5 1 60 10.1038/s41392-020-0150-x 32355263 PMC7192953 Huang RX, Zhou PK. DNA damage response signaling pathways and targets for radiotherapy sensitization in cancer. Signal Transduct Target Ther. 2020;5(1): 60. 32355263 10.1038/s41392-020-0150-x PMC7192953 2. Le J Perez E Nemzow L Gong F Role of deubiquitinases in DNA damage response DNA Repair (Amst) 2019 76 89 98 10.1016/j.dnarep.2019.02.011 30831436 PMC6561784 Le J, Perez E, Nemzow L, Gong F. Role of deubiquitinases in DNA damage response. DNA Repair (Amst). 2019;76:89–98. 30831436 10.1016/j.dnarep.2019.02.011 PMC6561784 3. Dybas JM Herrmann C Weitzman MD Ubiquitination at the interface of tumor viruses and DNA damage responses Curr Opin Virol 2018 32 40 7 10.1016/j.coviro.2018.08.017 30261451 PMC6263849 Dybas JM, Herrmann C, Weitzman MD. Ubiquitination at the interface of tumor viruses and DNA damage responses. Curr Opin Virol. 2018;32:40–7. 30261451 10.1016/j.coviro.2018.08.017 PMC6263849 4. Xie D Huang Q Zhou P Drug discovery targeting post-translational modifications in response to DNA damages induced by space radiation Int J Mol Sci 2023 10.3390/ijms24087656 37108815 PMC10142602 Xie D, Huang Q, Zhou P. Drug discovery targeting post-translational modifications in response to DNA damages induced by space radiation. Int J Mol Sci. 2023. 10.3390/ijms24087656. 37108815 10.3390/ijms24087656 PMC10142602 5. Zhang Q Karnak D Tan M Lawrence TS Morgan MA Sun Y FBXW7 facilitates nonhomologous end-joining via K63-linked polyubiquitylation of XRCC4 Mol Cell 2016 61 3 419 33 10.1016/j.molcel.2015.12.010 26774286 PMC4744117 Zhang Q, Karnak D, Tan M, Lawrence TS, Morgan MA, Sun Y. FBXW7 facilitates nonhomologous end-joining via K63-linked polyubiquitylation of XRCC4. Mol Cell. 2016;61(3):419–33. 26774286 10.1016/j.molcel.2015.12.010 PMC4744117 6. Yang Y Yang C Li T Yu S Gan T Hu J Cui J Zheng X The deubiquitinase USP38 promotes NHEJ repair through regulation of HDAC1 activity and regulates cancer cell response to genotoxic insults Cancer Res 2020 80 4 719 31 10.1158/0008-5472.CAN-19-2149 31874856 Yang Y, Yang C, Li T, Yu S, Gan T, Hu J, Cui J, Zheng X. The deubiquitinase USP38 promotes NHEJ repair through regulation of HDAC1 activity and regulates cancer cell response to genotoxic insults. Cancer Res. 2020;80(4):719–31. 31874856 10.1158/0008-5472.CAN-19-2149 7. Chen Y Feng Y Lin Y Zhou X Wang L Zhou Y Lin K Cai L GSTM3 enhances radiosensitivity of nasopharyngeal carcinoma by promoting radiation-induced ferroptosis through USP14/FASN axis and GPX4 Br J Cancer 2024 130 5 755 68 10.1038/s41416-024-02574-1 38228715 PMC10912431 Chen Y, Feng Y, Lin Y, Zhou X, Wang L, Zhou Y, Lin K, Cai L. GSTM3 enhances radiosensitivity of nasopharyngeal carcinoma by promoting radiation-induced ferroptosis through USP14/FASN axis and GPX4. Br J Cancer. 2024;130(5):755–68. 38228715 10.1038/s41416-024-02574-1 PMC10912431 8. Chen J Ying K Sun J Wang Y Ji M Sun Y NEDD4L affects KLF5 stability through ubiquitination to control ferroptosis and radiotherapy resistance in oesophageal squamous cell carcinoma J Cell Mol Med 2024 28 18 e70062 10.1111/jcmm.70062 39317954 PMC11422174 Chen J, Ying K, Sun J, Wang Y, Ji M, Sun Y. NEDD4L affects KLF5 stability through ubiquitination to control ferroptosis and radiotherapy resistance in oesophageal squamous cell carcinoma. J Cell Mol Med. 2024;28(18): e70062. 39317954 10.1111/jcmm.70062 PMC11422174 9. Yu J Zhang Y Li L Xiang Y Yao X Zhao Y Cai K Li M Li Z Luo Z Coordination-driven FBXW7 DNAzyme-Fe nanoassembly enables a binary switch of breast cancer cell cycle checkpoint responses for enhanced ferroptosis-radiotherapy Acta Biomater 2023 169 434 50 10.1016/j.actbio.2023.07.042 37516418 Yu J, Zhang Y, Li L, Xiang Y, Yao X, Zhao Y, Cai K, Li M, Li Z, Luo Z. Coordination-driven FBXW7 DNAzyme-Fe nanoassembly enables a binary switch of breast cancer cell cycle checkpoint responses for enhanced ferroptosis-radiotherapy. Acta Biomater. 2023;169:434–50. 37516418 10.1016/j.actbio.2023.07.042 10. Wang Z Xia Y Wang Y Zhu R Li H Liu Y Shen N The E3 ligase TRIM26 suppresses ferroptosis through catalyzing K63-linked ubiquitination of GPX4 in glioma Cell Death Dis 2023 14 10 695 10.1038/s41419-023-06222-z 37872147 PMC10593845 Wang Z, Xia Y, Wang Y, Zhu R, Li H, Liu Y, Shen N. The E3 ligase TRIM26 suppresses ferroptosis through catalyzing K63-linked ubiquitination of GPX4 in glioma. Cell Death Dis. 2023;14(10): 695. 37872147 10.1038/s41419-023-06222-z PMC10593845 11. Chen Q Zheng W Guan J Liu H Dan Y Zhu L Song Y Zhou Y Zhao X Zhang Y SOCS2-enhanced ubiquitination of SLC7A11 promotes ferroptosis and radiosensitization in hepatocellular carcinoma Cell Death Differ 2023 30 1 137 51 10.1038/s41418-022-01051-7 35995846 PMC9883449 Chen Q, Zheng W, Guan J, Liu H, Dan Y, Zhu L, Song Y, Zhou Y, Zhao X, Zhang Y, et al. SOCS2-enhanced ubiquitination of SLC7A11 promotes ferroptosis and radiosensitization in hepatocellular carcinoma. Cell Death Differ. 2023;30(1):137–51. 35995846 10.1038/s41418-022-01051-7 PMC9883449 12. Li JY Zhao Y Gong S Wang MM Liu X He QM Li YQ Huang SY Qiao H Tan XR TRIM21 inhibits irradiation-induced mitochondrial DNA release and impairs antitumour immunity in nasopharyngeal carcinoma tumour models Nat Commun 2023 14 1 865 10.1038/s41467-023-36523-y 36797289 PMC9935546 Li JY, Zhao Y, Gong S, Wang MM, Liu X, He QM, Li YQ, Huang SY, Qiao H, Tan XR, et al. TRIM21 inhibits irradiation-induced mitochondrial DNA release and impairs antitumour immunity in nasopharyngeal carcinoma tumour models. Nat Commun. 2023;14(1): 865. 36797289 10.1038/s41467-023-36523-y PMC9935546 13. Deng Z Xu Y Zhang P Peng Y Tan J Chen Z Ma Y Integrated machine learning and single-cell analysis reveal the prognostic and therapeutic potential of SUMOylation-related genes in ovarian cancer Front Immunol 2025 16 1577781 10.3389/fimmu.2025.1577781 40534859 PMC12174102 Deng Z, Xu Y, Zhang P, Peng Y, Tan J, Chen Z, Ma Y. Integrated machine learning and single-cell analysis reveal the prognostic and therapeutic potential of SUMOylation-related genes in ovarian cancer. Front Immunol. 2025;16: 1577781. 40534859 10.3389/fimmu.2025.1577781 PMC12174102 14. Izzo D Ascione L Guidi L Marsicano RM Koukoutzeli C Trapani D Curigliano G Innovative payloads for ADCs in cancer treatment: moving beyond the selective delivery of chemotherapy Ther Adv Med Oncol 2025 17 17588359241309461 10.1177/17588359241309461 39759830 PMC11694294 Izzo D, Ascione L, Guidi L, Marsicano RM, Koukoutzeli C, Trapani D, Curigliano G. Innovative payloads for ADCs in cancer treatment: moving beyond the selective delivery of chemotherapy. Ther Adv Med Oncol. 2025;17:17588359241309461. 39759830 10.1177/17588359241309461 PMC11694294 15. Zhang S Lai Y Pan J Saeed M Li S Zhou H Jiang X Gao J Zhu Y Yu H PROTAC Prodrug-Integrated nanosensitizer for potentiating radiation therapy of cancer Adv Mater 2024 36 23 e2314132 10.1002/adma.202314132 38353332 Zhang S, Lai Y, Pan J, Saeed M, Li S, Zhou H, Jiang X, Gao J, Zhu Y, Yu H, et al. PROTAC Prodrug-Integrated nanosensitizer for potentiating radiation therapy of cancer. Adv Mater. 2024;36(23):e2314132. 38353332 10.1002/adma.202314132 16. Zeng Y Wang X Hu J Tian C Liu R Chen X Huang L Liang X Wang X Fan H LZTS3 represses tumorigenesis and radioresistance via CK1delta and beta-TrCP-mediated ubiquitination pathway in lung cancer Cell Signal 2025 129 111655 10.1016/j.cellsig.2025.111655 39956246 Zeng Y, Wang X, Hu J, Tian C, Liu R, Chen X, Huang L, Liang X, Wang X, Fan H, et al. LZTS3 represses tumorigenesis and radioresistance via CK1delta and beta-TrCP-mediated ubiquitination pathway in lung cancer. Cell Signal. 2025;129:111655. 39956246 10.1016/j.cellsig.2025.111655 17. Yang C Yang Y Li Y Ni Q Li J Radiotherapy-triggered proteolysis targeting chimera prodrug activation in tumors J Am Chem Soc 2023 145 1 385 91 10.1021/jacs.2c10177 36542856 Yang C, Yang Y, Li Y, Ni Q, Li J. Radiotherapy-triggered proteolysis targeting chimera prodrug activation in tumors. J Am Chem Soc. 2023;145(1):385–91. 36542856 10.1021/jacs.2c10177 18. Xu M Yun Y Li C Ruan Y Muraoka O Xie W Sun X Radiation responsive PROTAC nanoparticles for tumor-specific proteolysis enhanced radiotherapy J Mater Chem B 2024 12 13 3240 8 10.1039/D3TB03046F 38437473 Xu M, Yun Y, Li C, Ruan Y, Muraoka O, Xie W, Sun X. Radiation responsive PROTAC nanoparticles for tumor-specific proteolysis enhanced radiotherapy. J Mater Chem B. 2024;12(13):3240–8. 38437473 10.1039/d3tb03046f 19. Liu F Chen J Li K Li H Zhu Y Zhai Y Lu B Fan Y Liu Z Chen X Ubiquitination and deubiquitylation in cancer: from mechanisms to novel therapeutic approaches Mol Cancer 2024 23 1 148 10.1186/s12943-024-02046-3 39048965 PMC11270804 Liu F, Chen J, Li K, Li H, Zhu Y, Zhai Y, Lu B, Fan Y, Liu Z, Chen X, et al. Ubiquitination and deubiquitylation in cancer: from mechanisms to novel therapeutic approaches. Mol Cancer. 2024;23(1):148. 39048965 10.1186/s12943-024-02046-3 PMC11270804 20. Deng T Zhu Q Xie L Liu Y Peng Y Yin L Gao Y Cao T Fu Y Qi X Norcantharidin promotes cancer radiosensitization through Cullin1 neddylation-mediated CDC6 protein degradation Mol Carcinog 2022 61 8 812 24 10.1002/mc.23435 35652616 Deng T, Zhu Q, Xie L, Liu Y, Peng Y, Yin L, Gao Y, Cao T, Fu Y, Qi X, et al. Norcantharidin promotes cancer radiosensitization through Cullin1 neddylation-mediated CDC6 protein degradation. Mol Carcinog. 2022;61(8):812–24. 35652616 10.1002/mc.23435 21. Cui D Xiong X Shu J Dai X Sun Y Zhao Y FBXW7 confers radiation survival by targeting p53 for degradation Cell Rep 2020 30 2 497 509 10.1016/j.celrep.2019.12.032 31940492 Cui D, Xiong X, Shu J, Dai X, Sun Y, Zhao Y. FBXW7 confers radiation survival by targeting p53 for degradation. Cell Rep. 2020;30(2):497–509. e494. 31940492 10.1016/j.celrep.2019.12.032 22. Zhang X Li CF Zhang L Wu CY Han L Jin G Rezaeian AH Han F Liu C Xu C TRAF6 restricts p53 mitochondrial translocation, apoptosis, and tumor suppression Mol Cell 2016 64 4 803 14 10.1016/j.molcel.2016.10.002 27818144 PMC5541903 Zhang X, Li CF, Zhang L, Wu CY, Han L, Jin G, Rezaeian AH, Han F, Liu C, Xu C, et al. TRAF6 restricts p53 mitochondrial translocation, apoptosis, and tumor suppression. Mol Cell. 2016;64(4):803–14. 27818144 10.1016/j.molcel.2016.10.002 PMC5541903 23. Sun J Zhu Z Li W Shen M Cao C Sun Q Guo Z Liu L Wu D UBE2T-regulated H2AX monoubiquitylation induces hepatocellular carcinoma radioresistance by facilitating CHK1 activation J Exp Clin Cancer Res 2020 39 1 222 10.1186/s13046-020-01734-4 33087136 PMC7576867 Sun J, Zhu Z, Li W, Shen M, Cao C, Sun Q, Guo Z, Liu L, Wu D. UBE2T-regulated H2AX monoubiquitylation induces hepatocellular carcinoma radioresistance by facilitating CHK1 activation. J Exp Clin Cancer Res. 2020;39(1):222. 33087136 10.1186/s13046-020-01734-4 PMC7576867 24. Zhu H Wang X Zhou X Lu S Gu G Liu C E3 ubiquitin ligase FBXW7 enhances radiosensitivity of non-small cell lung cancer cells by inhibiting SOX9 regulation of CDKN1A through ubiquitination Lab Invest 2022 102 11 1203 13 10.1038/s41374-022-00812-9 35840806 Zhu H, Wang X, Zhou X, Lu S, Gu G, Liu C. E3 ubiquitin ligase FBXW7 enhances radiosensitivity of non-small cell lung cancer cells by inhibiting SOX9 regulation of CDKN1A through ubiquitination. Lab Invest. 2022;102(11):1203–13. 35840806 10.1038/s41374-022-00812-9 25. Youssef E Zhao S Purcell C Olson GL El-Deiry WS Targeting the SMURF2-HIF1alpha axis: a new frontier in cancer therapy Front Oncol 2024 14 1484515 10.3389/fonc.2024.1484515 39697237 PMC11652374 Youssef E, Zhao S, Purcell C, Olson GL, El-Deiry WS. Targeting the SMURF2-HIF1alpha axis: a new frontier in cancer therapy. Front Oncol. 2024;14: 1484515. 39697237 10.3389/fonc.2024.1484515 PMC11652374 26. Zhou X Xia Q Wang B Li J Liu B Wang S Huang M Zhong R Cheng SY Wang X USP14 modulates stem-like properties, tumorigenicity, and radiotherapy resistance in glioblastoma stem cells through stabilization of MST4-phosphorylated ALKBH5 Theranostics 2025 15 6 2293 2314 10.7150/thno.103629 39990235 PMC11840735 Zhou X, Xia Q, Wang B, Li J, Liu B, Wang S, Huang M, Zhong R, Cheng SY, Wang X, et al. USP14 modulates stem-like properties, tumorigenicity, and radiotherapy resistance in glioblastoma stem cells through stabilization of MST4-phosphorylated ALKBH5. Theranostics. 2025;15(6):2293–314. 39990235 10.7150/thno.103629 PMC11840735 27. Morgan EL Toni T Viswanathan R Robbins Y Yang X Cheng H Gunti S Huynh A Sowers AL Mitchell JB Inhibition of USP14 promotes TNFalpha-induced cell death in head and neck squamous cell carcinoma (HNSCC) Cell Death Differ 2023 30 5 1382 96 10.1038/s41418-023-01144-x 37055579 PMC10154301 Morgan EL, Toni T, Viswanathan R, Robbins Y, Yang X, Cheng H, Gunti S, Huynh A, Sowers AL, Mitchell JB, et al. Inhibition of USP14 promotes TNFalpha-induced cell death in head and neck squamous cell carcinoma (HNSCC). Cell Death Differ. 2023;30(5):1382–96. 37055579 10.1038/s41418-023-01144-x PMC10154301 28. Dong X Li X Gan Y Ding J Wei B Zhou L Cui W Li W Traf4-mediated ubiquitination-dependent activation of JNK/Bcl-xL drives radioresistance Cell Death Dis 2023 14 2 102 10.1038/s41419-023-05637-y 36765039 PMC9918491 Dong X, Li X, Gan Y, Ding J, Wei B, Zhou L, Cui W, Li W. Traf4-mediated ubiquitination-dependent activation of JNK/Bcl-xL drives radioresistance. Cell Death Dis. 2023;14(2): 102. 36765039 10.1038/s41419-023-05637-y PMC9918491 29. Mirzalieva O Juncker M Schwartzenburg J Desai S ISG15 and isgylation in human diseases Cells 2022 10.3390/cells11030538 35159348 PMC8834048 Mirzalieva O, Juncker M, Schwartzenburg J, Desai S. ISG15 and isgylation in human diseases. Cells. 2022. 10.3390/cells11030538. 35159348 10.3390/cells11030538 PMC8834048 30. Wu W Xu H Liao C Wang Y Wu R Wu J Zheng W Li Y Jin C Zhao Y Blockade of USP14 potentiates type I interferon signaling and radiation-induced antitumor immunity via preventing IRF3 deubiquitylation Cell Oncol (Dordr) 2022 45 6 1347 61 10.1007/s13402-022-00724-2 36205846 Wu W, Xu H, Liao C, Wang Y, Wu R, Wu J, Zheng W, Li Y, Jin C, Zhao Y, et al. Blockade of USP14 potentiates type I interferon signaling and radiation-induced antitumor immunity via preventing IRF3 deubiquitylation. Cell Oncol (Dordr). 2022;45(6):1347–61. 36205846 10.1007/s13402-022-00724-2 31. Kari V Shchebet A Neumann H Johnsen SA The H2B ubiquitin ligase RNF40 cooperates with SUPT16H to induce dynamic changes in chromatin structure during DNA double-strand break repair Cell Cycle 2011 10 20 3495 504 10.4161/cc.10.20.17769 22031019 Kari V, Shchebet A, Neumann H, Johnsen SA. The H2B ubiquitin ligase RNF40 cooperates with SUPT16H to induce dynamic changes in chromatin structure during DNA double-strand break repair. Cell Cycle. 2011;10(20):3495–504. 22031019 10.4161/cc.10.20.17769 32. Zheng J Wang B Zheng R Zhang J Huang C Zheng R Huang Z Qiu W Liu M Yang K Linc-RA1 inhibits autophagy and promotes radioresistance by preventing H2Bub1/USP44 combination in glioma cells Cell Death Dis 2020 11 9 758 10.1038/s41419-020-02977-x 32934196 PMC7492255 Zheng J, Wang B, Zheng R, Zhang J, Huang C, Zheng R, Huang Z, Qiu W, Liu M, Yang K, et al. Linc-RA1 inhibits autophagy and promotes radioresistance by preventing H2Bub1/USP44 combination in glioma cells. Cell Death Dis. 2020;11(9): 758. 32934196 10.1038/s41419-020-02977-x PMC7492255 33. Zhu J Su F Mukherjee S Mori E Hu B Asaithamby A FANCD2 influences replication fork processes and genome stability in response to clustered DSBs Cell Cycle 2015 14 12 1809 22 10.1080/15384101.2015.1036210 26083937 PMC4613663 Zhu J, Su F, Mukherjee S, Mori E, Hu B, Asaithamby A. FANCD2 influences replication fork processes and genome stability in response to clustered DSBs. Cell Cycle. 2015;14(12):1809–22. 26083937 10.1080/15384101.2015.1036210 PMC4613663 34. Bosch PC Bogliolo M Surralles J Activation of the Fanconi anemia/BRCA pathway at low doses of ionization radiation Mutat Res Genet Toxicol Environ Mutagen 2015 793 9 13 10.1016/j.mrgentox.2015.06.010 26520367 Bosch PC, Bogliolo M, Surralles J. Activation of the Fanconi anemia/BRCA pathway at low doses of ionization radiation. Mutat Res Genet Toxicol Environ Mutagen. 2015;793:9–13. 26520367 10.1016/j.mrgentox.2015.06.010 35. Shimada M Hirayama R Komatsu K High LET radiation amplifies centrosome overduplication through a pathway of gamma-tubulin monoubiquitylation Int J Radiat Oncol Biol Phys 2013 86 2 358 65 10.1016/j.ijrobp.2013.01.010 23433796 Shimada M, Hirayama R, Komatsu K. High LET radiation amplifies centrosome overduplication through a pathway of gamma-tubulin monoubiquitylation. Int J Radiat Oncol Biol Phys. 2013;86(2):358–65. 23433796 10.1016/j.ijrobp.2013.01.010 36. Tang Q Chen Z Xie J Mo C Lu J Zhang Q Wang Z Wu W Wang H Transcriptome analysis and Single-Cell sequencing analysis constructed the Ubiquitination-Related signature in glioma and identified USP4 as a novel biomarker Front Immunol 2022 13 915709 10.3389/fimmu.2022.915709 35774799 PMC9238360 Tang Q, Chen Z, Xie J, Mo C, Lu J, Zhang Q, Wang Z, Wu W, Wang H. Transcriptome analysis and Single-Cell sequencing analysis constructed the Ubiquitination-Related signature in glioma and identified USP4 as a novel biomarker. Front Immunol. 2022;13:915709. 35774799 10.3389/fimmu.2022.915709 PMC9238360 37. Xu F Xia Q Chen B Wang R Zhang J Zhao X Zhang Z Yao Z Zhang J Zhou S ZNF451 collaborates with RNF8 to regulate RNF168 localization and amplify ubiquitination signaling to promote DNA damage repair and regulate radiosensitivity Cell Death Differ 2025 10.1038/s41418-025-01472-0 40055579 PMC12284065 Xu F, Xia Q, Chen B, Wang R, Zhang J, Zhao X, Zhang Z, Yao Z, Zhang J, Zhou S, et al. ZNF451 collaborates with RNF8 to regulate RNF168 localization and amplify ubiquitination signaling to promote DNA damage repair and regulate radiosensitivity. Cell Death Differ. 2025. 10.1038/s41418-025-01472-0. 40055579 10.1038/s41418-025-01472-0 PMC12284065 38. Gao A Zou J Mao Z Zhou H Zeng G SUMO2-mediated sumoylation of SH3GLB1 promotes ionizing radiation-induced hypertrophic cardiomyopathy through mitophagy activation Eur J Pharmacol 2022 924 174980 10.1016/j.ejphar.2022.174980 35487252 Gao A, Zou J, Mao Z, Zhou H, Zeng G. SUMO2-mediated sumoylation of SH3GLB1 promotes ionizing radiation-induced hypertrophic cardiomyopathy through mitophagy activation. Eur J Pharmacol. 2022;924: 174980. 35487252 10.1016/j.ejphar.2022.174980 39. Wu S Li Z Li H Liao K Dihydroartemisinin reduces irradiation-induced mitophagy and radioresistance in lung cancer A549 cells via CIRBP inhibition Life (Basel) 2022 10.3390/life12081129 36013308 PMC9410454 Wu S, Li Z, Li H, Liao K. Dihydroartemisinin reduces irradiation-induced mitophagy and radioresistance in lung cancer A549 cells via CIRBP inhibition. Life (Basel). 2022. 10.3390/life12081129. 36013308 10.3390/life12081129 PMC9410454 40. Liu W Zheng M Zhang R Jiang Q Du G Wu Y Yang C Li F Li W Wang L RNF126-Mediated MRE11 ubiquitination activates the DNA damage response and confers resistance of Triple-Negative breast cancer to radiotherapy Adv Sci (Weinh) 2023 10 5 e2203884 10.1002/advs.202203884 36563124 PMC9929257 Liu W, Zheng M, Zhang R, Jiang Q, Du G, Wu Y, Yang C, Li F, Li W, Wang L, et al. RNF126-Mediated MRE11 ubiquitination activates the DNA damage response and confers resistance of Triple-Negative breast cancer to radiotherapy. Adv Sci (Weinh). 2023;10(5):e2203884. 36563124 10.1002/advs.202203884 PMC9929257 41. Hang Q Zeng L Wang L Nie L Yao F Teng H Deng Y Yap S Sun Y Frank SJ Non-canonical function of DGCR8 in DNA double-strand break repair signaling and tumor radioresistance Nat Commun 2021 12 1 4033 10.1038/s41467-021-24298-z 34188037 PMC8242032 Hang Q, Zeng L, Wang L, Nie L, Yao F, Teng H, Deng Y, Yap S, Sun Y, Frank SJ, et al. Non-canonical function of DGCR8 in DNA double-strand break repair signaling and tumor radioresistance. Nat Commun. 2021;12(1): 4033. 34188037 10.1038/s41467-021-24298-z PMC8242032 42. Wang J Liu Y Wu D Tian C Gao J Yang Q Hong X Gu F Zhang K Hu Y OTUB1 targets CHK1 for deubiquitylation and stabilization to facilitate lung cancer progression and radioresistance Int J Radiat Oncol Biol Phys 2024 119 4 1222 33 10.1016/j.ijrobp.2024.01.202 38266782 Wang J, Liu Y, Wu D, Tian C, Gao J, Yang Q, Hong X, Gu F, Zhang K, Hu Y, et al. OTUB1 targets CHK1 for deubiquitylation and stabilization to facilitate lung cancer progression and radioresistance. Int J Radiat Oncol Biol Phys. 2024;119(4):1222–33. 38266782 10.1016/j.ijrobp.2024.01.202 43. Molkentine DP Molkentine JM Bridges KA Valdecanas DR Dhawan A Bahri R Hefner AJ Kumar M Yang L Abdelhakiem M P16 represses DNA damage repair via a novel ubiquitin-dependent signaling cascade Cancer Res 2022 82 5 916 28 10.1158/0008-5472.CAN-21-2101 34965932 PMC9136619 Molkentine DP, Molkentine JM, Bridges KA, Valdecanas DR, Dhawan A, Bahri R, Hefner AJ, Kumar M, Yang L, Abdelhakiem M, et al. P16 represses DNA damage repair via a novel ubiquitin-dependent signaling cascade. Cancer Res. 2022;82(5):916–28. 34965932 10.1158/0008-5472.CAN-21-2101 PMC9136619 44. Chen Y Feng X Wu Z Yang Y Rao X Meng R Zhang S Dong X Xu S Wu G Jie X Usp9x-mediated REV1 deubiquitylation promotes lung cancer radioresistance via the action of REV1 as a Rad18 molecular scaffold for cystathionine gamma-lyase J Biomed Sci 2024 31 1 55 10.1186/s12929-024-01044-3 38802791 PMC11131313 Chen Y, Feng X, Wu Z, Yang Y, Rao X, Meng R, Zhang S, Dong X, Xu S, Wu G, Jie X. Usp9x-mediated REV1 deubiquitylation promotes lung cancer radioresistance via the action of REV1 as a Rad18 molecular scaffold for cystathionine gamma-lyase. J Biomed Sci. 2024;31(1):55. 38802791 10.1186/s12929-024-01044-3 PMC11131313 45. Rizvi Z Lander GC Illuminating ubiquitination mechanisms: how cryo-EM has shed light on cullin RING E3 ligase function Curr Opin Struct Biol 2025 92 103055 10.1016/j.sbi.2025.103055 40311545 Rizvi Z, Lander GC. Illuminating ubiquitination mechanisms: how cryo-EM has shed light on cullin RING E3 ligase function. Curr Opin Struct Biol. 2025;92: 103055. 40311545 10.1016/j.sbi.2025.103055 46. Scott DC Chittori S Purser N King MT Maiwald SA Churion K Nourse A Lee C Paulo JA Miller DJ Structural basis for C-degron selectivity across KLHDCX family E3 ubiquitin ligases Nat Commun 2024 15 1 9899 10.1038/s41467-024-54126-z 39548056 PMC11568203 Scott DC, Chittori S, Purser N, King MT, Maiwald SA, Churion K, Nourse A, Lee C, Paulo JA, Miller DJ, et al. Structural basis for C-degron selectivity across KLHDCX family E3 ubiquitin ligases. Nat Commun. 2024;15(1): 9899. 39548056 10.1038/s41467-024-54126-z PMC11568203 47. Krishnamurthy PM Shukla S Ray P Mehra R Nyati MK Lawrence TS Ray D Involvement of p38-betaTrCP-Tristetraprolin-TNFalpha axis in radiation pneumonitis Oncotarget 2017 8 29 47767 79 10.18632/oncotarget.17770 28548957 PMC5564603 Krishnamurthy PM, Shukla S, Ray P, Mehra R, Nyati MK, Lawrence TS, Ray D. Involvement of p38-betaTrCP-Tristetraprolin-TNFalpha axis in radiation pneumonitis. Oncotarget. 2017;8(29):47767–79. 28548957 10.18632/oncotarget.17770 PMC5564603 48. Li J Zong Y Tuo Z Liu J Liu J The role of RASA2 in predicting radioresistance in lung cancer through regulation of p53 Transl Lung Cancer Res 2024 13 3 587 602 10.21037/tlcr-24-160 38601440 PMC11002505 Li J, Zong Y, Tuo Z, Liu J, Liu J. The role of RASA2 in predicting radioresistance in lung cancer through regulation of p53. Transl Lung Cancer Res. 2024;13(3):587–602. 38601440 10.21037/tlcr-24-160 PMC11002505 49. Yu X Liu Y Yin L Peng Y Peng Y Gao Y Yuan B Zhu Q Cao T Xie B Radiation-promoted CDC6 protein stability contributes to radioresistance by regulating senescence and epithelial to mesenchymal transition Oncogene 2019 38 4 549 63 10.1038/s41388-018-0460-4 30158672 PMC6345673 Yu X, Liu Y, Yin L, Peng Y, Peng Y, Gao Y, Yuan B, Zhu Q, Cao T, Xie B, et al. Radiation-promoted CDC6 protein stability contributes to radioresistance by regulating senescence and epithelial to mesenchymal transition. Oncogene. 2019;38(4):549–63. 30158672 10.1038/s41388-018-0460-4 PMC6345673 50. Ma Y Zhang H Chen C Liu L Ding T Wang Y Ma D Ling X Chen X Li J TRIM32 promotes radioresistance by disrupting TC45-STAT3 interaction in triple-negative breast cancer Oncogene 2022 41 11 1589 99 10.1038/s41388-022-02204-1 35091679 Ma Y, Zhang H, Chen C, Liu L, Ding T, Wang Y, Ma D, Ling X, Chen X, Li J, et al. TRIM32 promotes radioresistance by disrupting TC45-STAT3 interaction in triple-negative breast cancer. Oncogene. 2022;41(11):1589–99. 35091679 10.1038/s41388-022-02204-1 51. Li X Zou S Zhou L Gao A Xu J He C Zhou J Wu S Chen Y RAD18 confers radioresistance of esophagus squamous cell carcinoma through regulating p-DNA-PKcs Cancer Med 2022 11 20 3809 19 10.1002/cam4.4754 35426246 PMC9582675 Li X, Zou S, Zhou L, Gao A, Xu J, He C, Zhou J, Wu S, Chen Y. RAD18 confers radioresistance of esophagus squamous cell carcinoma through regulating p-DNA-PKcs. Cancer Med. 2022;11(20):3809–19. 35426246 10.1002/cam4.4754 PMC9582675 52. Fu T Ji K Jin L Zhang J Wu X Ji X Fan B Jia Z Wang A Liu J ASB16-AS1 up-regulated and phosphorylated TRIM37 to activate NF-kappaB pathway and promote proliferation, stemness, and cisplatin resistance of gastric cancer Gastric Cancer 2021 24 1 45 59 10.1007/s10120-020-01096-y 32572790 Fu T, Ji K, Jin L, Zhang J, Wu X, Ji X, Fan B, Jia Z, Wang A, Liu J, et al. ASB16-AS1 up-regulated and phosphorylated TRIM37 to activate NF-kappaB pathway and promote proliferation, stemness, and cisplatin resistance of gastric cancer. Gastric Cancer. 2021;24(1):45–59. 32572790 10.1007/s10120-020-01096-y 53. Wang K Tang J Liu X Wang Y Chen W Zheng R UBR5 regulates proliferation and radiosensitivity in human laryngeal carcinoma via the p38/MAPK signaling pathway Oncol Rep 2020 44 2 685 97 10.3892/or.2020.7620 32468011 PMC7336417 Wang K, Tang J, Liu X, Wang Y, Chen W, Zheng R. UBR5 regulates proliferation and radiosensitivity in human laryngeal carcinoma via the p38/MAPK signaling pathway. Oncol Rep. 2020;44(2):685–97. 32468011 10.3892/or.2020.7620 PMC7336417 54. Jiaranuchart S Kaida A Onozato Y Harada H Miura M DNA damage response following X-irradiation in oral cancer cell lines HSC3 and HSC4 Arch Oral Biol 2018 90 1 8 10.1016/j.archoralbio.2018.02.016 29522917 Jiaranuchart S, Kaida A, Onozato Y, Harada H, Miura M. DNA damage response following X-irradiation in oral cancer cell lines HSC3 and HSC4. Arch Oral Biol. 2018;90:1–8. 29522917 10.1016/j.archoralbio.2018.02.016 55. Deng M Lin J Nowsheen S Liu T Zhao Y Villalta PW Sicard D Tschumperlin DJ Lee S Kim J Lou Z Extracellular matrix stiffness determines DNA repair efficiency and cellular sensitivity to genotoxic agents Sci Adv 2020 10.1126/sciadv.abb2630 32917705 PMC7486107 Deng M, Lin J, Nowsheen S, Liu T, Zhao Y, Villalta PW, Sicard D, Tschumperlin DJ, Lee S, Kim J, Lou Z. Extracellular matrix stiffness determines DNA repair efficiency and cellular sensitivity to genotoxic agents. Sci Adv. 2020. 10.1126/sciadv.abb2630. 32917705 10.1126/sciadv.abb2630 PMC7486107 56. Weili Z Zhikun L Jianmin W Qingbao T Knockdown of USP28 enhances the radiosensitivity of esophageal cancer cells via the c-Myc/hypoxia-inducible factor-1 alpha pathway J Cell Biochem 2019 120 1 201 12 10.1002/jcb.27305 30206969 Weili Z, Zhikun L, Jianmin W, Qingbao T. Knockdown of USP28 enhances the radiosensitivity of esophageal cancer cells via the c-Myc/hypoxia-inducible factor-1 alpha pathway. J Cell Biochem. 2019;120(1):201–12. 30206969 10.1002/jcb.27305 57. Yin F He H Zhang B Zheng J Wang M Zhang M Cui H Effect of deubiquitinase ovarian tumor Domain-Containing protein 5 (OTUD5) on radiosensitivity of cervical cancer by regulating the ubiquitination of Akt and its mechanism Med Sci Monit 2019 25 3469 75 10.12659/MSM.912904 31075090 PMC6525574 Yin F, He H, Zhang B, Zheng J, Wang M, Zhang M, Cui H. Effect of deubiquitinase ovarian tumor Domain-Containing protein 5 (OTUD5) on radiosensitivity of cervical cancer by regulating the ubiquitination of Akt and its mechanism. Med Sci Monit. 2019;25:3469–75. 31075090 10.12659/MSM.912904 PMC6525574 58. Wang J Cheng P Pavlyukov MS Yu H Zhang Z Kim SH Minata M Mohyeldin A Xie W Chen D Targeting NEK2 attenuates glioblastoma growth and radioresistance by destabilizing histone methyltransferase EZH2 J Clin Invest 2017 127 8 3075 89 10.1172/JCI89092 28737508 PMC5531394 Wang J, Cheng P, Pavlyukov MS, Yu H, Zhang Z, Kim SH, Minata M, Mohyeldin A, Xie W, Chen D, et al. Targeting NEK2 attenuates glioblastoma growth and radioresistance by destabilizing histone methyltransferase EZH2. J Clin Invest. 2017;127(8):3075–89. 28737508 10.1172/JCI89092 PMC5531394 59. Zong Y Li Q Zhang F Xian X Wang S Xia J Li J Tuo Z Xiao G Liu L SDH5 depletion enhances radiosensitivity by regulating p53: a new method for noninvasive prediction of radiotherapy response Theranostics 2019 9 22 6380 95 10.7150/thno.34443 31588224 PMC6771232 Zong Y, Li Q, Zhang F, Xian X, Wang S, Xia J, Li J, Tuo Z, Xiao G, Liu L, et al. SDH5 depletion enhances radiosensitivity by regulating p53: a new method for noninvasive prediction of radiotherapy response. Theranostics. 2019;9(22):6380–95. 31588224 10.7150/thno.34443 PMC6771232 60. Han Y Xiao M Zhao S Wang H Li R Xu B Gp78-regulated KAP1 phosphorylation induces radioresistance in breast cancer by facilitating PPP1CC/PPP2CA ubiquitination iScience 2024 27 9 110847 10.1016/j.isci.2024.110847 39297166 PMC11409047 Han Y, Xiao M, Zhao S, Wang H, Li R, Xu B. Gp78-regulated KAP1 phosphorylation induces radioresistance in breast cancer by facilitating PPP1CC/PPP2CA ubiquitination. iScience. 2024;27(9): 110847. 39297166 10.1016/j.isci.2024.110847 PMC11409047 61. Zhang S Zhou L El-Deiry WS Small-molecule NSC59984 induces mutant p53 degradation through a ROS-ERK2-MDM2 axis in cancer cells Mol Cancer Res 2022 20 4 622 36 10.1158/1541-7786.MCR-21-0149 34992144 PMC8983457 Zhang S, Zhou L, El-Deiry WS. Small-molecule NSC59984 induces mutant p53 degradation through a ROS-ERK2-MDM2 axis in cancer cells. Mol Cancer Res. 2022;20(4):622–36. 34992144 10.1158/1541-7786.MCR-21-0149 PMC8983457 62. Xie J Li Y Jiang K Hu K Zhang S Dong X Dai X Liu L Zhang T Yang K CDK16 phosphorylates and degrades p53 to promote radioresistance and predicts prognosis in lung cancer Theranostics 2018 8 3 650 62 10.7150/thno.21963 29344296 PMC5771083 Xie J, Li Y, Jiang K, Hu K, Zhang S, Dong X, Dai X, Liu L, Zhang T, Yang K, et al. CDK16 phosphorylates and degrades p53 to promote radioresistance and predicts prognosis in lung cancer. Theranostics. 2018;8(3):650–62. 29344296 10.7150/thno.21963 PMC5771083 63. Zhou L Zheng L Hu K Wang X Zhang R Zou Y Zhong L Wang S Wu Y Kang T SUMOylation stabilizes hSSB1 and enhances the recruitment of NBS1 to DNA damage sites Signal Transduct Target Ther 2020 5 1 80 10.1038/s41392-020-0172-4 32576812 PMC7311467 Zhou L, Zheng L, Hu K, Wang X, Zhang R, Zou Y, Zhong L, Wang S, Wu Y, Kang T. SUMOylation stabilizes hSSB1 and enhances the recruitment of NBS1 to DNA damage sites. Signal Transduct Target Ther. 2020;5(1): 80. 32576812 10.1038/s41392-020-0172-4 PMC7311467 64. Zhao H Gao S Han Y Xie D Xuan L Huang X Luo J Ran Q Li G Guo H Conversion of Ku80 K568 crotonylation to sumoylation facilitates DNA non-homologous end joining and cancer radioresistance Signal Transduct Target Ther 2025 10 1 127 10.1038/s41392-025-02210-1 40254688 PMC12009988 Zhao H, Gao S, Han Y, Xie D, Xuan L, Huang X, Luo J, Ran Q, Li G, Guo H, et al. Conversion of Ku80 K568 crotonylation to sumoylation facilitates DNA non-homologous end joining and cancer radioresistance. Signal Transduct Target Ther. 2025;10(1): 127. 40254688 10.1038/s41392-025-02210-1 PMC12009988 65. Traver G Sekhar KR Crooks PA Keeney DS Freeman ML Targeting NPM1 in irradiated cells inhibits NPM1 binding to RAD51, RAD51 foci formation and radiosensitizes NSCLC Cancer Lett 2021 500 220 7 10.1016/j.canlet.2020.12.023 33358698 PMC7822076 Traver G, Sekhar KR, Crooks PA, Keeney DS, Freeman ML. Targeting NPM1 in irradiated cells inhibits NPM1 binding to RAD51, RAD51 foci formation and radiosensitizes NSCLC. Cancer Lett. 2021;500:220–7. 33358698 10.1016/j.canlet.2020.12.023 PMC7822076 66. Iyer R, Deshpande A, Pedgaonkar A, Bala PA, Kim T, Brien GL, Finlay D, Vuori K, Soragni A, Murad R, Deshpande AJ. Sumo2 inhibition reverses aberrant epigenetic rewiring driven by synovial sarcoma fusion oncoproteins and impairs sarcomagenesis. bioRxiv. 2024. 10.1101/2024.09.23.614593. 67. Zhang T Su F Wang B Liu L Lu Y Su H Ling R Yue P Dai H Yang T Ubiquitin specific peptidase 38 epigenetically regulates KLF transcription factor 5 to augment malignant progression of lung adenocarcinoma Oncogene 2024 43 16 1190 202 10.1038/s41388-024-02985-7 38409551 Zhang T, Su F, Wang B, Liu L, Lu Y, Su H, Ling R, Yue P, Dai H, Yang T, et al. Ubiquitin specific peptidase 38 epigenetically regulates KLF transcription factor 5 to augment malignant progression of lung adenocarcinoma. Oncogene. 2024;43(16):1190–202. 38409551 10.1038/s41388-024-02985-7 68. Hu C Jiang X The SUMO-specific protease family regulates cancer cell radiosensitivity Biomed Pharmacother 2019 109 66 70 10.1016/j.biopha.2018.10.071 30396093 Hu C, Jiang X. The SUMO-specific protease family regulates cancer cell radiosensitivity. Biomed Pharmacother. 2019;109:66–70. 30396093 10.1016/j.biopha.2018.10.071 69. Zhou Z Xu J Bao X Shi J Liu B Chen Y Li J Nuclear Nrf2 activity in laryngeal carcinoma is regulated by SENP3 after cisplatin-induced reactive oxygen species stress J Cancer 2019 10 15 3427 34 10.7150/jca.30318 31293646 PMC6603410 Zhou Z, Xu J, Bao X, Shi J, Liu B, Chen Y, Li J. Nuclear Nrf2 activity in laryngeal carcinoma is regulated by SENP3 after cisplatin-induced reactive oxygen species stress. J Cancer. 2019;10(15):3427–34. 31293646 10.7150/jca.30318 PMC6603410 70. Garvin AJ Walker AK Densham RM Chauhan AS Stone HR Mackay HL Jamshad M Starowicz K Daza-Martin M Ronson GE The desumoylase SENP2 coordinates homologous recombination and nonhomologous end joining by independent mechanisms Genes Dev 2019 33 5–6 333 47 10.1101/gad.321125.118 30796017 PMC6411010 Garvin AJ, Walker AK, Densham RM, Chauhan AS, Stone HR, Mackay HL, Jamshad M, Starowicz K, Daza-Martin M, Ronson GE, et al. The desumoylase SENP2 coordinates homologous recombination and nonhomologous end joining by independent mechanisms. Genes Dev. 2019;33(5–6):333–47. 30796017 10.1101/gad.321125.118 PMC6411010 71. Tian J Wen M Gao P Feng M Wei G RUVBL1 ubiquitination by DTL promotes RUVBL1/2-beta-catenin-mediated transcriptional regulation of NHEJ pathway and enhances radiation resistance in breast cancer Cell Death Dis 2024 15 4 259 10.1038/s41419-024-06651-4 38609375 PMC11015013 Tian J, Wen M, Gao P, Feng M, Wei G. RUVBL1 ubiquitination by DTL promotes RUVBL1/2-beta-catenin-mediated transcriptional regulation of NHEJ pathway and enhances radiation resistance in breast cancer. Cell Death Dis. 2024;15(4):259. 38609375 10.1038/s41419-024-06651-4 PMC11015013 72. Tsai CL Liu WL Hsu FM Yang PS Yen RF Tzen KY Cheng AL Chen PJ Cheng JC Targeting histone deacetylase 4/ubiquitin-conjugating enzyme 9 impairs DNA repair for radiosensitization of hepatocellular carcinoma cells in mice Hepatology 2018 67 2 586 99 10.1002/hep.29328 28646552 Tsai CL, Liu WL, Hsu FM, Yang PS, Yen RF, Tzen KY, Cheng AL, Chen PJ, Cheng JC. Targeting histone deacetylase 4/ubiquitin-conjugating enzyme 9 impairs DNA repair for radiosensitization of hepatocellular carcinoma cells in mice. Hepatology. 2018;67(2):586–99. 28646552 10.1002/hep.29328 73. Wang X Zhang W Yan Z Liang Y Li L Yu X Feng Y Fu S Zhang Y Zhao H Radiosensitization by the investigational NEDD8-activating enzyme inhibitor MLN4924 (pevonedistat) in hormone-resistant prostate cancer cells Oncotarget 2016 7 25 38380 91 10.18632/oncotarget.9526 27224919 PMC5122397 Wang X, Zhang W, Yan Z, Liang Y, Li L, Yu X, Feng Y, Fu S, Zhang Y, Zhao H, et al. Radiosensitization by the investigational NEDD8-activating enzyme inhibitor MLN4924 (pevonedistat) in hormone-resistant prostate cancer cells. Oncotarget. 2016;7(25):38380–91. 27224919 10.18632/oncotarget.9526 PMC5122397 74. Wei D Li H Yu J Sebolt JT Zhao L Lawrence TS Smith PG Morgan MA Sun Y Radiosensitization of human pancreatic cancer cells by MLN4924, an investigational NEDD8-activating enzyme inhibitor Cancer Res 2012 72 1 282 93 10.1158/0008-5472.CAN-11-2866 22072567 PMC3251739 Wei D, Li H, Yu J, Sebolt JT, Zhao L, Lawrence TS, Smith PG, Morgan MA, Sun Y. Radiosensitization of human pancreatic cancer cells by MLN4924, an investigational NEDD8-activating enzyme inhibitor. Cancer Res. 2012;72(1):282–93. 22072567 10.1158/0008-5472.CAN-11-2866 PMC3251739 75. Yang D Tan M Wang G Sun Y The p21-dependent radiosensitization of human breast cancer cells by MLN4924, an investigational inhibitor of NEDD8 activating enzyme PLoS One 2012 7 3 e34079 10.1371/journal.pone.0034079 22457814 PMC3310880 Yang D, Tan M, Wang G, Sun Y. The p21-dependent radiosensitization of human breast cancer cells by MLN4924, an investigational inhibitor of NEDD8 activating enzyme. PLoS One. 2012;7(3): e34079. 22457814 10.1371/journal.pone.0034079 PMC3310880 76. Guihard S Ramolu L Macabre C Wasylyk B Noel G Abecassis J Jung AC The NEDD8 conjugation pathway regulates p53 transcriptional activity and head and neck cancer cell sensitivity to ionizing radiation Int J Oncol 2012 41 4 1531 40 10.3892/ijo.2012.1584 22895816 Guihard S, Ramolu L, Macabre C, Wasylyk B, Noel G, Abecassis J, Jung AC. The NEDD8 conjugation pathway regulates p53 transcriptional activity and head and neck cancer cell sensitivity to ionizing radiation. Int J Oncol. 2012;41(4):1531–40. 22895816 10.3892/ijo.2012.1584 77. Xu T Ma Q Li Y Yu Q Pan P Zheng Y Li Z Xiong X Hou T Yu B A small molecule inhibitor of the UBE2F-CRL5 axis induces apoptosis and radiosensitization in lung cancer Signal Transduct Target Ther 2022 7 1 354 10.1038/s41392-022-01182-w 36253371 PMC9576757 Xu T, Ma Q, Li Y, Yu Q, Pan P, Zheng Y, Li Z, Xiong X, Hou T, Yu B, et al. A small molecule inhibitor of the UBE2F-CRL5 axis induces apoptosis and radiosensitization in lung cancer. Signal Transduct Target Ther. 2022;7(1): 354. 36253371 10.1038/s41392-022-01182-w PMC9576757 78. Zheng S Wu Y Li Z Integrating cullin2-RING E3 ligase as a potential biomarker for glioblastoma multiforme prognosis and radiosensitivity profiling Radiother Oncol 2021 154 36 44 10.1016/j.radonc.2020.09.005 32918970 Zheng S, Wu Y, Li Z. Integrating cullin2-RING E3 ligase as a potential biomarker for glioblastoma multiforme prognosis and radiosensitivity profiling. Radiother Oncol. 2021;154:36–44. 32918970 10.1016/j.radonc.2020.09.005 79. He J Li M Bao J Peng Y Xue W Chen J Zhao J Beta-elemene promotes ferroptosis and reverses radioresistance in gastric cancer by inhibiting the OTUB1-GPX4 interaction Front Pharmacol 2024 15 1469180 10.3389/fphar.2024.1469180 39484165 PMC11524901 He J, Li M, Bao J, Peng Y, Xue W, Chen J, Zhao J. Beta-elemene promotes ferroptosis and reverses radioresistance in gastric cancer by inhibiting the OTUB1-GPX4 interaction. Front Pharmacol. 2024;15: 1469180. 39484165 10.3389/fphar.2024.1469180 PMC11524901 80. Jin M Liu H Zheng Z Fang S Xi Y Liu K CHI3L1 mediates radiation resistance in colorectal cancer by inhibiting ferroptosis via the p53/SLC7A11 pathway J Transl Med 2025 23 1 357 10.1186/s12967-025-06378-6 40119400 PMC11929242 Jin M, Liu H, Zheng Z, Fang S, Xi Y, Liu K. CHI3L1 mediates radiation resistance in colorectal cancer by inhibiting ferroptosis via the p53/SLC7A11 pathway. J Transl Med. 2025;23(1):357. 40119400 10.1186/s12967-025-06378-6 PMC11929242 81. Liu R Liu L Bian Y Zhang S Wang Y Chen H Jiang X Li G Chen Q Xue C The dual regulation effects of ESR1/NEDD4L on SLC7A11 in breast cancer under ionizing radiation Front Cell Dev Biol 2021 9 772380 10.3389/fcell.2021.772380 35252218 PMC8888677 Liu R, Liu L, Bian Y, Zhang S, Wang Y, Chen H, Jiang X, Li G, Chen Q, Xue C, et al. The dual regulation effects of ESR1/NEDD4L on SLC7A11 in breast cancer under ionizing radiation. Front Cell Dev Biol. 2021;9: 772380. 35252218 10.3389/fcell.2021.772380 PMC8888677 82. Wang Y Ji H Yang T Liu Y He X Jiang X Lu Z Han L Liu X Ma S HSP90 regulates dCK stability and inhibits ionizing radiation-induced ferroptosis in cervical cancer cells Cell Death Discov 2025 11 1 191 10.1038/s41420-025-02388-x 40263268 PMC12015294 Wang Y, Ji H, Yang T, Liu Y, He X, Jiang X, Lu Z, Han L, Liu X, Ma S. HSP90 regulates dCK stability and inhibits ionizing radiation-induced ferroptosis in cervical cancer cells. Cell Death Discov. 2025;11(1): 191. 40263268 10.1038/s41420-025-02388-x PMC12015294 83. Nakashima R Goto Y Koyasu S Kobayashi M Morinibu A Yoshimura M Hiraoka M Hammond EM Harada H UCHL1-HIF-1 axis-mediated antioxidant property of cancer cells as a therapeutic target for radiosensitization Sci Rep 2017 7 1 6879 10.1038/s41598-017-06605-1 28761052 PMC5537219 Nakashima R, Goto Y, Koyasu S, Kobayashi M, Morinibu A, Yoshimura M, Hiraoka M, Hammond EM, Harada H. UCHL1-HIF-1 axis-mediated antioxidant property of cancer cells as a therapeutic target for radiosensitization. Sci Rep. 2017;7(1): 6879. 28761052 10.1038/s41598-017-06605-1 PMC5537219 84. Proto MC Fiore D Piscopo C Laezza C Bifulco M Gazzerro P Modified adenosines sensitize glioblastoma cells to temozolomide by affecting DNA methyltransferases Front Pharmacol 2022 13 815646 10.3389/fphar.2022.815646 35559231 PMC9086827 Proto MC, Fiore D, Piscopo C, Laezza C, Bifulco M, Gazzerro P. Modified adenosines sensitize glioblastoma cells to temozolomide by affecting DNA methyltransferases. Front Pharmacol. 2022;13: 815646. 35559231 10.3389/fphar.2022.815646 PMC9086827 85. Zhou Z Zhang B Deng Y Deng S Li J Wei W Wang Y Wang J Feng Z Che M FBW7/GSK3beta mediated degradation of IGF2BP2 inhibits IGF2BP2-SLC7A5 positive feedback loop and radioresistance in lung cancer J Exp Clin Cancer Res 2024 43 1 34 10.1186/s13046-024-02959-3 38281999 PMC10823633 Zhou Z, Zhang B, Deng Y, Deng S, Li J, Wei W, Wang Y, Wang J, Feng Z, Che M, et al. FBW7/GSK3beta mediated degradation of IGF2BP2 inhibits IGF2BP2-SLC7A5 positive feedback loop and radioresistance in lung cancer. J Exp Clin Cancer Res. 2024;43(1):34. 38281999 10.1186/s13046-024-02959-3 PMC10823633 86. Li M Wei J Xue C Chen S Zhou X Zheng L Duan Y Deng H Fan S Xiong W BRD7 enhances the radiosensitivity of nasopharyngeal carcinoma cells by negatively regulating USP5/METTL3 axis-mediated homologous recombination repair Int J Biol Sci 2024 20 15 6130 45 10.7150/ijbs.100833 39664566 PMC11628346 Li M, Wei J, Xue C, Chen S, Zhou X, Zheng L, Duan Y, Deng H, Fan S, Xiong W, et al. BRD7 enhances the radiosensitivity of nasopharyngeal carcinoma cells by negatively regulating USP5/METTL3 axis-mediated homologous recombination repair. Int J Biol Sci. 2024;20(15):6130–45. 39664566 10.7150/ijbs.100833 PMC11628346 87. Tang JY Peng YX Zhu W Qiu JY Huang W Yi H Lu SS Feng J Yu ZZ Wu D Usp5 binds and stabilizes EphA2 to increase nasopharyngeal carcinoma radioresistance Int J Biol Sci 2025 21 3 893 909 10.7150/ijbs.102461 39897046 PMC11781186 Tang JY, Peng YX, Zhu W, Qiu JY, Huang W, Yi H, Lu SS, Feng J, Yu ZZ, Wu D, et al. Usp5 binds and stabilizes EphA2 to increase nasopharyngeal carcinoma radioresistance. Int J Biol Sci. 2025;21(3):893–909. 39897046 10.7150/ijbs.102461 PMC11781186 88. Wang B Zheng J Li R Tian Y Lin J Liang Y Sun Q Xu A Zheng R Liu M Long noncoding RNA LINC02582 acts downstream of miR-200c to promote radioresistance through CHK1 in breast cancer cells Cell Death Dis 2019 10 10 764 10.1038/s41419-019-1996-0 31601781 PMC6787210 Wang B, Zheng J, Li R, Tian Y, Lin J, Liang Y, Sun Q, Xu A, Zheng R, Liu M, et al. Long noncoding RNA LINC02582 acts downstream of miR-200c to promote radioresistance through CHK1 in breast cancer cells. Cell Death Dis. 2019;10(10):764. 31601781 10.1038/s41419-019-1996-0 PMC6787210 89. Jie X Fong WP Zhou R Zhao Y Zhao Y Meng R Zhang S Dong X Zhang T Yang K USP9X-mediated KDM4C deubiquitylation promotes lung cancer radioresistance by epigenetically inducing TGF-beta2 transcription Cell Death Differ 2021 28 7 2095 111 10.1038/s41418-021-00740-z 33558705 PMC8257660 Jie X, Fong WP, Zhou R, Zhao Y, Zhao Y, Meng R, Zhang S, Dong X, Zhang T, Yang K, et al. USP9X-mediated KDM4C deubiquitylation promotes lung cancer radioresistance by epigenetically inducing TGF-beta2 transcription. Cell Death Differ. 2021;28(7):2095–111. 33558705 10.1038/s41418-021-00740-z PMC8257660 90. Yang S Wang R Liu L Xu F Zhao X Yao Z Zhang J Cheng X Xu A Wu L Zhao G RRM1 promotes homologous recombination and radio/chemo-sensitivity via enhancing USP11 and E2F1-mediated RAD51AP1 transcription Cell Death Discov 2024 10 1 496 10.1038/s41420-024-02267-x 39695160 PMC11655868 Yang S, Wang R, Liu L, Xu F, Zhao X, Yao Z, Zhang J, Cheng X, Xu A, Wu L, Zhao G. RRM1 promotes homologous recombination and radio/chemo-sensitivity via enhancing USP11 and E2F1-mediated RAD51AP1 transcription. Cell Death Discov. 2024;10(1): 496. 39695160 10.1038/s41420-024-02267-x PMC11655868 91. Tang Y Wang T Gu L Xu Y Yang Z Zhu W Zhang Q Luo J Cao J Jiao Y USP11 exacerbates radiation-induced pneumonitis by activating endothelial cell inflammatory response via OTUD5-STING signaling Int J Radiat Oncol Biol Phys 2024 119 4 1261 74 10.1016/j.ijrobp.2024.01.220 38364946 Tang Y, Wang T, Gu L, Xu Y, Yang Z, Zhu W, Zhang Q, Luo J, Cao J, Jiao Y. USP11 exacerbates radiation-induced pneumonitis by activating endothelial cell inflammatory response via OTUD5-STING signaling. Int J Radiat Oncol Biol Phys. 2024;119(4):1261–74. 38364946 10.1016/j.ijrobp.2024.01.220 92. Sharma A Almasan A USP14 regulates DNA damage response and is a target for radiosensitization in non-small cell lung cancer Int J Mol Sci 2020 10.3390/ijms21176383 32887472 PMC7503721 Sharma A, Almasan A. USP14 regulates DNA damage response and is a target for radiosensitization in non-small cell lung cancer. Int J Mol Sci. 2020. 10.3390/ijms21176383. 32887472 10.3390/ijms21176383 PMC7503721 93. Prieto-Garcia C Hartmann O Reissland M Fischer T Maier CR Rosenfeldt M Schulein-Volk C Klann K Kalb R Dikic I Inhibition of USP28 overcomes Cisplatin-resistance of squamous tumors by suppression of the Fanconi anemia pathway Cell Death Differ 2022 29 3 568 84 10.1038/s41418-021-00875-z 34611298 PMC8901929 Prieto-Garcia C, Hartmann O, Reissland M, Fischer T, Maier CR, Rosenfeldt M, Schulein-Volk C, Klann K, Kalb R, Dikic I, et al. Inhibition of USP28 overcomes Cisplatin-resistance of squamous tumors by suppression of the Fanconi anemia pathway. Cell Death Differ. 2022;29(3):568–84. 34611298 10.1038/s41418-021-00875-z PMC8901929 94. Prieto-Garcia C Hartmann O Reissland M Braun F Fischer T Walz S Schulein-Volk C Eilers U Ade CP Calzado MA Maintaining protein stability of ∆Np63 via USP28 is required by squamous cancer cells EMBO Mol Med 2020 12 4 e11101 10.15252/emmm.201911101 32128997 PMC7136964 Prieto-Garcia C, Hartmann O, Reissland M, Braun F, Fischer T, Walz S, Schulein-Volk C, Eilers U, Ade CP, Calzado MA, et al. Maintaining protein stability of ∆Np63 via USP28 is required by squamous cancer cells. EMBO Mol Med. 2020;12(4): e11101. 32128997 10.15252/emmm.201911101 PMC7136964 95. Huang WM Li ZX Wu YH Shi ZL Mi JL Hu K Wang RS M6A demethylase FTO renders radioresistance of nasopharyngeal carcinoma via promoting OTUB1-mediated anti-ferroptosis Transl Oncol 2023 27 101576 10.1016/j.tranon.2022.101576 36343416 PMC9646990 Huang WM, Li ZX, Wu YH, Shi ZL, Mi JL, Hu K, Wang RS. M6A demethylase FTO renders radioresistance of nasopharyngeal carcinoma via promoting OTUB1-mediated anti-ferroptosis. Transl Oncol. 2023;27: 101576. 36343416 10.1016/j.tranon.2022.101576 PMC9646990 96. Di M Miao J Pan Q Wu Z Chen B Wang M Zhao J Huang H Bai J Wang Q OTUD4-mediated GSDME deubiquitylation enhances radiosensitivity in nasopharyngeal carcinoma by inducing pyroptosis J Exp Clin Cancer Res 2022 41 1 328 10.1186/s13046-022-02533-9 36411454 PMC9677691 Di M, Miao J, Pan Q, Wu Z, Chen B, Wang M, Zhao J, Huang H, Bai J, Wang Q, et al. OTUD4-mediated GSDME deubiquitylation enhances radiosensitivity in nasopharyngeal carcinoma by inducing pyroptosis. J Exp Clin Cancer Res. 2022;41(1):328. 36411454 10.1186/s13046-022-02533-9 PMC9677691 97. Wu Z Qiu M Guo Y Zhao J Liu Z Wang H Meng M Yuan Z Mi Z OTU deubiquitinase 4 is silenced and radiosensitizes non-small cell lung cancer cells via inhibiting DNA repair Cancer Cell Int 2019 19 99 10.1186/s12935-019-0816-z 31011293 PMC6466656 Wu Z, Qiu M, Guo Y, Zhao J, Liu Z, Wang H, Meng M, Yuan Z, Mi Z. OTU deubiquitinase 4 is silenced and radiosensitizes non-small cell lung cancer cells via inhibiting DNA repair. Cancer Cell Int. 2019;19:99. 31011293 10.1186/s12935-019-0816-z PMC6466656 98. Zhang T Lei J Zheng M Wen Z Zhou J Nitric oxide facilitates the S-nitrosylation and deubiquitylation of Notch1 protein to maintain cancer stem cells in human NSCLC J Cell Mol Med 2024 28 21 e70203 10.1111/jcmm.70203 39523215 PMC11550923 Zhang T, Lei J, Zheng M, Wen Z, Zhou J. Nitric oxide facilitates the S-nitrosylation and deubiquitylation of Notch1 protein to maintain cancer stem cells in human NSCLC. J Cell Mol Med. 2024;28(21):e70203. 39523215 10.1111/jcmm.70203 PMC11550923 99. Fan L You H Jiang X Niu Y Chen Z Wang H Xu Y Zhou P Wei L Jiang T UCHL3 induces radiation resistance and acquisition of mesenchymal phenotypes by deubiquitinating POLD4 in glioma stem cells Cell Mol Life Sci 2024 81 1 247 10.1007/s00018-024-05265-5 38829550 PMC11149539 Fan L, You H, Jiang X, Niu Y, Chen Z, Wang H, Xu Y, Zhou P, Wei L, Jiang T, et al. UCHL3 induces radiation resistance and acquisition of mesenchymal phenotypes by deubiquitinating POLD4 in glioma stem cells. Cell Mol Life Sci. 2024;81(1): 247. 38829550 10.1007/s00018-024-05265-5 PMC11149539 100. Xu LM Yuan YJ Yu H Wang S Wang P LINC00665 knockdown confers sensitivity in irradiated non-small cell lung cancer cells through the miR-582-5p/UCHL3/AhR axis J Transl Med 2022 20 1 350 10.1186/s12967-022-03516-2 35918714 PMC9344728 Xu LM, Yuan YJ, Yu H, Wang S, Wang P. LINC00665 knockdown confers sensitivity in irradiated non-small cell lung cancer cells through the miR-582-5p/UCHL3/AhR axis. J Transl Med. 2022;20(1): 350. 35918714 10.1186/s12967-022-03516-2 PMC9344728 101. Yue X Liu T Wang X Wu W Wen G Yi Y Wu J Wang Z Zhan W Wu R Pharmacological Inhibition of BAP1 recruits HERC2 to competitively dissociate BRCA1-BARD1, suppresses DNA repair and sensitizes CRC to radiotherapy Acta Pharm Sin B 2023 13 8 3382 99 10.1016/j.apsb.2023.05.017 37655321 PMC10466008 Yue X, Liu T, Wang X, Wu W, Wen G, Yi Y, Wu J, Wang Z, Zhan W, Wu R, et al. Pharmacological Inhibition of BAP1 recruits HERC2 to competitively dissociate BRCA1-BARD1, suppresses DNA repair and sensitizes CRC to radiotherapy. Acta Pharm Sin B. 2023;13(8):3382–99. 37655321 10.1016/j.apsb.2023.05.017 PMC10466008 102. Kim JH Shin SJ Heo SJ Choe EA Kim CG Jung M Keum KC Yoon JS Lee SC Shin SJ Prognoses and clinical outcomes of primary and recurrent uveal melanoma Cancer Res Treat 2018 50 4 1238 51 10.4143/crt.2017.534 29281872 PMC6192910 Kim JH, Shin SJ, Heo SJ, Choe EA, Kim CG, Jung M, Keum KC, Yoon JS, Lee SC, Shin SJ. Prognoses and clinical outcomes of primary and recurrent uveal melanoma. Cancer Res Treat. 2018;50(4):1238–51. 29281872 10.4143/crt.2017.534 PMC6192910 103. Niu H Zhu Y Wang J Wang T Wang X Yan L Effects of USP7 on radiation sensitivity through p53 pathway in laryngeal squamous cell carcinoma Transl Oncol 2022 22 101466 10.1016/j.tranon.2022.101466 35696794 PMC9194850 Niu H, Zhu Y, Wang J, Wang T, Wang X, Yan L. Effects of USP7 on radiation sensitivity through p53 pathway in laryngeal squamous cell carcinoma. Transl Oncol. 2022;22: 101466. 35696794 10.1016/j.tranon.2022.101466 PMC9194850 104. Zhou X Gao F Gao W Wang Q Li X Li X Li W Liu J Zhou H Luo A Bismuth sulfide nanoflowers facilitated miR339 delivery to overcome stemness and radioresistance through Ubiquitin-Specific peptidase 8 in esophageal cancer ACS Nano 2024 18 29 19232 46 10.1021/acsnano.4c05100 38996055 Zhou X, Gao F, Gao W, Wang Q, Li X, Li X, Li W, Liu J, Zhou H, Luo A, et al. Bismuth sulfide nanoflowers facilitated miR339 delivery to overcome stemness and radioresistance through Ubiquitin-Specific peptidase 8 in esophageal cancer. ACS Nano. 2024;18(29):19232–46. 38996055 10.1021/acsnano.4c05100 105. Song Z Tu X Zhou Q Huang J Chen Y Liu J Lee S Kim W Nowsheen S Luo K A novel UCHL(3) inhibitor, perifosine, enhances PARP inhibitor cytotoxicity through inhibition of homologous recombination-mediated DNA double strand break repair Cell Death Dis 2019 10 6 398 10.1038/s41419-019-1628-8 31113933 PMC6529448 Song Z, Tu X, Zhou Q, Huang J, Chen Y, Liu J, Lee S, Kim W, Nowsheen S, Luo K, et al. A novel UCHL(3) inhibitor, perifosine, enhances PARP inhibitor cytotoxicity through inhibition of homologous recombination-mediated DNA double strand break repair. Cell Death Dis. 2019;10(6): 398. 31113933 10.1038/s41419-019-1628-8 PMC6529448 106. Zhou W Zhao Y Qin W Wu W Liao C Zhang Y Yang X Chen X Wang Y Kang Y Targeting USP1 potentiates radiation-induced type I IFN-dependent antitumor immunity by enhancing oligo-ubiquitinated SAR1A-mediated STING trafficking and activation Adv Sci 2025 12 15 e2412687 10.1002/advs.202412687 PMC12005740 39976106 Zhou W, Zhao Y, Qin W, Wu W, Liao C, Zhang Y, Yang X, Chen X, Wang Y, Kang Y, et al. Targeting USP1 potentiates radiation-induced type I IFN-dependent antitumor immunity by enhancing oligo-ubiquitinated SAR1A-mediated STING trafficking and activation. Adv Sci. 2025;12(15): e2412687. 10.1002/advs.202412687 PMC12005740 39976106 107. Richter K Paakkola T Mennerich D Kubaichuk K Konzack A Ali-Kippari H Kozlova N Koivunen P Haapasaari KM Jukkola-Vuorinen A Usp28 deficiency promotes breast and liver carcinogenesis as well as tumor angiogenesis in a HIF-independent manner Mol Cancer Res 2018 16 6 1000 12 10.1158/1541-7786.MCR-17-0452 29545478 Richter K, Paakkola T, Mennerich D, Kubaichuk K, Konzack A, Ali-Kippari H, Kozlova N, Koivunen P, Haapasaari KM, Jukkola-Vuorinen A, et al. Usp28 deficiency promotes breast and liver carcinogenesis as well as tumor angiogenesis in a HIF-independent manner. Mol Cancer Res. 2018;16(6):1000–12. 29545478 10.1158/1541-7786.MCR-17-0452 108. Meng Y Xu Y Qiu A Lin M Yang L Huang Y USP28-mediated deubiquitylation of FOXK1 activates the Hippo signaling pathway to regulate cell proliferation and radiosensitivity in lung cancer Life Sci. 2025 366–7 123483 10.1016/j.lfs.2025.123483 39983825 Meng Y, Xu Y, Qiu A, Lin M, Yang L, Huang Y. USP28-mediated deubiquitylation of FOXK1 activates the Hippo signaling pathway to regulate cell proliferation and radiosensitivity in lung cancer. Life Sci. 2025;366–7:123483. 10.1016/j.lfs.2025.123483 39983825 109. Burkart S Weusthof C Khorani K Steen S Stogbauer F Unger K Hess J Zitzelsberger H Belka C Kurth I Hess J A novel subgroup of UCHL1-related cancers is associated with genomic instability and sensitivity to DNA-damaging treatment Cancers (Basel) 2023 10.3390/cancers15061655 36980544 PMC10099714 Burkart S, Weusthof C, Khorani K, Steen S, Stogbauer F, Unger K, Hess J, Zitzelsberger H, Belka C, Kurth I, Hess J. A novel subgroup of UCHL1-related cancers is associated with genomic instability and sensitivity to DNA-damaging treatment. Cancers (Basel). 2023. 10.3390/cancers15061655. 36980544 10.3390/cancers15061655 PMC10099714 110. Maher KR Shafer D Schaar D Bandyopadhyay D Deng X Wright J Piekarz R Rudek MA Harvey RD Grant S A phase I study of MLN4924 and belinostat in relapsed/refractory acute myeloid leukemia or myelodysplastic syndrome Cancer Chemother Pharmacol 2025 95 1 24 10.1007/s00280-024-04742-9 39821392 PMC11742280 Maher KR, Shafer D, Schaar D, Bandyopadhyay D, Deng X, Wright J, Piekarz R, Rudek MA, Harvey RD, Grant S. A phase I study of MLN4924 and belinostat in relapsed/refractory acute myeloid leukemia or myelodysplastic syndrome. Cancer Chemother Pharmacol. 2025;95(1):24. 39821392 10.1007/s00280-024-04742-9 PMC11742280 111. Chen Y Zhao Y Yang X Ren X Huang S Gong S Tan X Li J He S Li Y USP44 regulates irradiation-induced DNA double-strand break repair and suppresses tumorigenesis in nasopharyngeal carcinoma Nat Commun 2022 13 1 501 10.1038/s41467-022-28158-2 35079021 PMC8789930 Chen Y, Zhao Y, Yang X, Ren X, Huang S, Gong S, Tan X, Li J, He S, Li Y, et al. USP44 regulates irradiation-induced DNA double-strand break repair and suppresses tumorigenesis in nasopharyngeal carcinoma. Nat Commun. 2022;13(1): 501. 35079021 10.1038/s41467-022-28158-2 PMC8789930 112. Chang WL Hsieh CH Kuo IY Lin CH Huang YL Wang YC Nutlin-3 acts as a DNA methyltransferase inhibitor to sensitize esophageal cancer to chemoradiation Mol Carcinog 2023 62 2 277 87 10.1002/mc.23485 36342355 Chang WL, Hsieh CH, Kuo IY, Lin CH, Huang YL, Wang YC. Nutlin-3 acts as a DNA methyltransferase inhibitor to sensitize esophageal cancer to chemoradiation. Mol Carcinog. 2023;62(2):277–87. 36342355 10.1002/mc.23485 113. He T Guo J Song H Zhu H Di X Min H Wang Y Chen G Dai W Ma J Nutlin-3, an antagonist of MDM2, enhances the radiosensitivity of esophageal squamous cancer with wild-type p53 Pathol Oncol Res 2018 24 1 75 81 10.1007/s12253-017-0215-5 28341911 He T, Guo J, Song H, Zhu H, Di X, Min H, Wang Y, Chen G, Dai W, Ma J, et al. Nutlin-3, an antagonist of MDM2, enhances the radiosensitivity of esophageal squamous cancer with wild-type p53. Pathol Oncol Res. 2018;24(1):75–81. 28341911 10.1007/s12253-017-0215-5 114. Issing C Menche C Richter MR Mosa MH von der Grun J Fleischmann M Thoenissen P Winkelmann R Darvishi T Loth AG Head and neck tumor organoid biobank for modelling individual responses to radiation therapy according to the TP53/HPV status J Exp Clin Cancer Res 2025 44 1 85 10.1186/s13046-025-03345-3 40045309 PMC11881459 Issing C, Menche C, Richter MR, Mosa MH, von der Grun J, Fleischmann M, Thoenissen P, Winkelmann R, Darvishi T, Loth AG, et al. Head and neck tumor organoid biobank for modelling individual responses to radiation therapy according to the TP53/HPV status. J Exp Clin Cancer Res. 2025;44(1): 85. 40045309 10.1186/s13046-025-03345-3 PMC11881459 115. Tesson M Rae C Nixon C Babich JW Mairs RJ Preliminary evaluation of prostate-targeted radiotherapy using (131)I-MIP-1095 in combination with radiosensitising chemotherapeutic drugs J Pharm Pharmacol 2016 68 7 912 21 10.1111/jphp.12558 27139157 PMC5298040 Tesson M, Rae C, Nixon C, Babich JW, Mairs RJ. Preliminary evaluation of prostate-targeted radiotherapy using (131)I-MIP-1095 in combination with radiosensitising chemotherapeutic drugs. J Pharm Pharmacol. 2016;68(7):912–21. 27139157 10.1111/jphp.12558 PMC5298040 116. Feng FY Zhang Y Kothari V Evans JR Jackson WC Chen W Johnson SB Luczak C Wang S Hamstra DA MDM2 inhibition sensitizes prostate cancer cells to androgen ablation and radiotherapy in a p53-dependent manner Neoplasia 2016 18 4 213 22 10.1016/j.neo.2016.01.006 27108384 PMC4840291 Feng FY, Zhang Y, Kothari V, Evans JR, Jackson WC, Chen W, Johnson SB, Luczak C, Wang S, Hamstra DA. MDM2 inhibition sensitizes prostate cancer cells to androgen ablation and radiotherapy in a p53-dependent manner. Neoplasia. 2016;18(4):213–22. 27108384 10.1016/j.neo.2016.01.006 PMC4840291 117. Zauli G Celeghini C Melloni E Voltan R Ongari M Tiribelli M di Iasio MG Lanza F Secchiero P The sorafenib plus nutlin-3 combination promotes synergistic cytotoxicity in acute myeloid leukemic cells irrespectively of FLT3 and p53 status Haematologica 2012 97 11 1722 30 10.3324/haematol.2012.062083 22689683 PMC3487447 Zauli G, Celeghini C, Melloni E, Voltan R, Ongari M, Tiribelli M, di Iasio MG, Lanza F, Secchiero P. The sorafenib plus nutlin-3 combination promotes synergistic cytotoxicity in acute myeloid leukemic cells irrespectively of FLT3 and p53 status. Haematologica. 2012;97(11):1722–30. 22689683 10.3324/haematol.2012.062083 PMC3487447 118. Yang X Zeng Z Jie X Wang Y Han J Zheng Z Li J Liu H Dong X Wu G Xu S Arginine methyltransferase PRMT5 methylates and destabilizes Mxi1 to confer radioresistance in non-small cell lung cancer Cancer Lett 2022 532 215594 10.1016/j.canlet.2022.215594 35149174 Yang X, Zeng Z, Jie X, Wang Y, Han J, Zheng Z, Li J, Liu H, Dong X, Wu G, Xu S. Arginine methyltransferase PRMT5 methylates and destabilizes Mxi1 to confer radioresistance in non-small cell lung cancer. Cancer Lett. 2022;532: 215594. 35149174 10.1016/j.canlet.2022.215594 119. Tian YF Chen TJ Lin CY Chen LT Lin LC Hsing CH Lee SW Sheu MJ Lee HH Shiue YL SKP2 overexpression is associated with a poor prognosis of rectal cancer treated with chemoradiotherapy and represents a therapeutic target with high potential Tumour Biol 2013 34 2 1107 17 10.1007/s13277-013-0652-z 23328995 Tian YF, Chen TJ, Lin CY, Chen LT, Lin LC, Hsing CH, Lee SW, Sheu MJ, Lee HH, Shiue YL, et al. SKP2 overexpression is associated with a poor prognosis of rectal cancer treated with chemoradiotherapy and represents a therapeutic target with high potential. Tumour Biol. 2013;34(2):1107–17. 23328995 10.1007/s13277-013-0652-z 120. Fu HC Yang YC Chen YJ Lin H Ou YC Chien CC Huang EY Huang HY Lan J Chi HP Increased expression of SKP2 is an independent predictor of locoregional recurrence in cervical cancer via promoting DNA-damage response after irradiation Oncotarget 2016 7 28 44047 61 10.18632/oncotarget.10057 27317767 PMC5190078 Fu HC, Yang YC, Chen YJ, Lin H, Ou YC, Chien CC, Huang EY, Huang HY, Lan J, Chi HP, et al. Increased expression of SKP2 is an independent predictor of locoregional recurrence in cervical cancer via promoting DNA-damage response after irradiation. Oncotarget. 2016;7(28):44047–61. 27317767 10.18632/oncotarget.10057 PMC5190078 121. Li C Du L Ren Y Liu X Jiao Q Cui D Wen M Wang C Wei G Wang Y SKP2 promotes breast cancer tumorigenesis and radiation tolerance through PDCD4 ubiquitination J Exp Clin Cancer Res 2019 38 1 76 10.1186/s13046-019-1069-3 30760284 PMC6375223 Li C, Du L, Ren Y, Liu X, Jiao Q, Cui D, Wen M, Wang C, Wei G, Wang Y, et al. SKP2 promotes breast cancer tumorigenesis and radiation tolerance through PDCD4 ubiquitination. J Exp Clin Cancer Res. 2019;38(1): 76. 30760284 10.1186/s13046-019-1069-3 PMC6375223 122. Gombodorj N Yokobori T Tanaka N Suzuki S Kuriyama K Kumakura Y Yoshida T Sakai M Sohda M Baatar S Correlation between high FBXW7 expression in pretreatment biopsy specimens and good response to chemoradiation therapy in patients with locally advanced esophageal cancer: a retrospective study J Surg Oncol 2018 118 1 101 8 10.1002/jso.25127 30098297 Gombodorj N, Yokobori T, Tanaka N, Suzuki S, Kuriyama K, Kumakura Y, Yoshida T, Sakai M, Sohda M, Baatar S, et al. Correlation between high FBXW7 expression in pretreatment biopsy specimens and good response to chemoradiation therapy in patients with locally advanced esophageal cancer: a retrospective study. J Surg Oncol. 2018;118(1):101–8. 30098297 10.1002/jso.25127 123. Bhatia S Pavlick AC Boasberg P Thompson JA Mulligan G Pickard MD Faessel H Dezube BJ Hamid O A phase I study of the investigational NEDD8-activating enzyme inhibitor pevonedistat (TAK-924/MLN4924) in patients with metastatic melanoma Invest New Drugs 2016 34 4 439 49 10.1007/s10637-016-0348-5 27056178 PMC4919369 Bhatia S, Pavlick AC, Boasberg P, Thompson JA, Mulligan G, Pickard MD, Faessel H, Dezube BJ, Hamid O. A phase I study of the investigational NEDD8-activating enzyme inhibitor pevonedistat (TAK-924/MLN4924) in patients with metastatic melanoma. Invest New Drugs. 2016;34(4):439–49. 27056178 10.1007/s10637-016-0348-5 PMC4919369 124. Sarantopoulos J Shapiro GI Cohen RB Clark JW Kauh JS Weiss GJ Cleary JM Mahalingam D Pickard MD Faessel HM Phase I study of the investigational NEDD8-activating enzyme inhibitor pevonedistat (TAK-924/MLN4924) in patients with advanced solid tumors Clin Cancer Res 2016 22 4 847 57 10.1158/1078-0432.CCR-15-1338 26423795 Sarantopoulos J, Shapiro GI, Cohen RB, Clark JW, Kauh JS, Weiss GJ, Cleary JM, Mahalingam D, Pickard MD, Faessel HM, et al. Phase I study of the investigational NEDD8-activating enzyme inhibitor pevonedistat (TAK-924/MLN4924) in patients with advanced solid tumors. Clin Cancer Res. 2016;22(4):847–57. 26423795 10.1158/1078-0432.CCR-15-1338 125. Swords RT Coutre S Maris MB Zeidner JF Foran JM Cruz J Erba HP Berdeja JG Tam W Vardhanabhuti S Pevonedistat, a first-in-class NEDD8-activating enzyme inhibitor, combined with azacitidine in patients with AML Blood 2018 131 13 1415 24 10.1182/blood-2017-09-805895 29348128 PMC5909884 Swords RT, Coutre S, Maris MB, Zeidner JF, Foran JM, Cruz J, Erba HP, Berdeja JG, Tam W, Vardhanabhuti S, et al. Pevonedistat, a first-in-class NEDD8-activating enzyme inhibitor, combined with azacitidine in patients with AML. Blood. 2018;131(13):1415–24. 29348128 10.1182/blood-2017-09-805895 PMC5909884 126. Shah JJ Jakubowiak AJ O’Connor OA Orlowski RZ Harvey RD Smith MR Lebovic D Diefenbach C Kelly K Hua Z Phase I study of the novel investigational NEDD8-Activating enzyme inhibitor Pevonedistat (MLN4924) in patients with relapsed/refractory multiple myeloma or lymphoma Clin Cancer Res 2016 22 1 34 43 10.1158/1078-0432.CCR-15-1237 26561559 PMC5694347 Shah JJ, Jakubowiak AJ, O’Connor OA, Orlowski RZ, Harvey RD, Smith MR, Lebovic D, Diefenbach C, Kelly K, Hua Z, et al. Phase I study of the novel investigational NEDD8-Activating enzyme inhibitor Pevonedistat (MLN4924) in patients with relapsed/refractory multiple myeloma or lymphoma. Clin Cancer Res. 2016;22(1):34–43. 26561559 10.1158/1078-0432.CCR-15-1237 PMC5694347 127. Wang M Chen X Chen H Zhang X Li J Gong H Shiyan C Yang F RNF8 plays an important role in the radioresistance of human nasopharyngeal cancer cells in vitro Oncol Rep 2015 34 1 341 9 10.3892/or.2015.3958 25955491 Wang M, Chen X, Chen H, Zhang X, Li J, Gong H, Shiyan C, Yang F. RNF8 plays an important role in the radioresistance of human nasopharyngeal cancer cells in vitro 25955491 10.3892/or.2015.3958 128. Zhou H Mu X Chen J Liu H Shi W Xing E Yang K Wu G RNAi silencing targeting RNF8 enhances radiosensitivity of a non-small cell lung cancer cell line A549 Int J Radiat Biol 2013 89 9 708 15 10.3109/09553002.2013.792964 23578064 Zhou H, Mu X, Chen J, Liu H, Shi W, Xing E, Yang K, Wu G. RNAi silencing targeting RNF8 enhances radiosensitivity of a non-small cell lung cancer cell line A549. Int J Radiat Biol. 2013;89(9):708–15. 23578064 10.3109/09553002.2013.792964 129. Xu L Ye Y Tao Z Wang T Wei Y Cai W Wan X Zhao P Gu W Gu B O-GlcNAcylation of melanophilin enhances radiation resistance in glioblastoma via suppressing TRIM21 mediated ubiquitination Oncogene 2024 43 1 61 75 10.1038/s41388-023-02881-6 37950039 Xu L, Ye Y, Tao Z, Wang T, Wei Y, Cai W, Wan X, Zhao P, Gu W, Gu B, et al. O-GlcNAcylation of melanophilin enhances radiation resistance in glioblastoma via suppressing TRIM21 mediated ubiquitination. Oncogene. 2024;43(1):61–75. 37950039 10.1038/s41388-023-02881-6 130. Zhao MJ Song YF Niu HT Tian YX Yang XG Xie K Jing YH Wang DG Adenovirus-mediated downregulation of the ubiquitin ligase RNF8 sensitizes bladder cancer to radiotherapy Oncotarget 2016 7 8 8956 67 10.18632/oncotarget.6909 26788910 PMC4891017 Zhao MJ, Song YF, Niu HT, Tian YX, Yang XG, Xie K, Jing YH, Wang DG. Adenovirus-mediated downregulation of the ubiquitin ligase RNF8 sensitizes bladder cancer to radiotherapy. Oncotarget. 2016;7(8):8956–67. 26788910 10.18632/oncotarget.6909 PMC4891017 131. Fleischmann J Hildebrand LS Kuhlmann L Fietkau R Distel LV The effect of Xevinapant combined with ionizing radiation on HNSCC and normal tissue cells and the impact of Xevinapant on its targeted proteins cIAP1 and XIAP Cells 2023 10.3390/cells12121653 37371123 PMC10297233 Fleischmann J, Hildebrand LS, Kuhlmann L, Fietkau R, Distel LV. The effect of Xevinapant combined with ionizing radiation on HNSCC and normal tissue cells and the impact of Xevinapant on its targeted proteins cIAP1 and XIAP. Cells. 2023. 10.3390/cells12121653. 37371123 10.3390/cells12121653 PMC10297233 132. Barroso T Melo-Alvim C Ribeiro LA Casimiro S Costa L Targeting inhibitor of apoptosis proteins to overcome chemotherapy resistance-a marriage between targeted therapy and cytotoxic chemotherapy Int J Mol Sci 2023 10.3390/ijms241713385 37686191 PMC10487656 Barroso T, Melo-Alvim C, Ribeiro LA, Casimiro S, Costa L. Targeting inhibitor of apoptosis proteins to overcome chemotherapy resistance-a marriage between targeted therapy and cytotoxic chemotherapy. Int J Mol Sci. 2023. 10.3390/ijms241713385. 37686191 10.3390/ijms241713385 PMC10487656 133. Li X Gao D Shen F Chen H Zhang Z He C Gao A Lang Y Zhu X Zhou J Polymerase iota (POLI) confers radioresistance of esophageal squamous cell carcinoma by regulating RAD51 stability and facilitating homologous recombination Cell Death Discov 2023 9 1 291 10.1038/s41420-023-01541-8 37558683 PMC10412619 Li X, Gao D, Shen F, Chen H, Zhang Z, He C, Gao A, Lang Y, Zhu X, Zhou J, et al. Polymerase iota (POLI) confers radioresistance of esophageal squamous cell carcinoma by regulating RAD51 stability and facilitating homologous recombination. Cell Death Discov. 2023;9(1): 291. 37558683 10.1038/s41420-023-01541-8 PMC10412619 134. Yuan J Liu J Fan R Liu Z HECTD3 enhances cell radiation resistance and migration by regulating LKB1 mediated ZEB1 in glioma Eur J Neurosci 2022 56 4 4275 86 10.1111/ejn.15748 35768187 Yuan J, Liu J, Fan R, Liu Z. HECTD3 enhances cell radiation resistance and migration by regulating LKB1 mediated ZEB1 in glioma. Eur J Neurosci. 2022;56(4):4275–86. 35768187 10.1111/ejn.15748 135. Li J Sun Y Zhao X Ma Y Xie Y Liu S Hui B Shi X Sun X Zhang X Radiation induces IRAK1 expression to promote radioresistance by suppressing autophagic cell death via decreasing the ubiquitination of PRDX1 in glioma cells Cell Death Dis 2023 14 4 259 10.1038/s41419-023-05732-0 37031183 PMC10082800 Li J, Sun Y, Zhao X, Ma Y, Xie Y, Liu S, Hui B, Shi X, Sun X, Zhang X. Radiation induces IRAK1 expression to promote radioresistance by suppressing autophagic cell death via decreasing the ubiquitination of PRDX1 in glioma cells. Cell Death Dis. 2023;14(4): 259. 37031183 10.1038/s41419-023-05732-0 PMC10082800 136. Chaudhary KR Kinslow CJ Cheng H Silva JM Yu J Wang TJ Hei TK Halmos B Cheng SK Smurf2 inhibition enhances chemotherapy and radiation sensitivity in non-small-cell lung cancer Sci Rep 2022 12 1 10140 10.1038/s41598-022-14448-8 35710591 PMC9203496 Chaudhary KR, Kinslow CJ, Cheng H, Silva JM, Yu J, Wang TJ, Hei TK, Halmos B, Cheng SK. Smurf2 inhibition enhances chemotherapy and radiation sensitivity in non-small-cell lung cancer. Sci Rep. 2022;12(1): 10140. 35710591 10.1038/s41598-022-14448-8 PMC9203496 137. Du Z Liu H Bai L Yan D Li H Peng S Cao J Liu SB Tang Z A radiosensitivity prediction model developed based on weighted correlation network analysis of hypoxia genes for lower-grade glioma Front Oncol 2022 12 757686 10.3389/fonc.2022.757686 35280808 PMC8916576 Du Z, Liu H, Bai L, Yan D, Li H, Peng S, Cao J, Liu SB, Tang Z. A radiosensitivity prediction model developed based on weighted correlation network analysis of hypoxia genes for lower-grade glioma. Front Oncol. 2022;12: 757686. 35280808 10.3389/fonc.2022.757686 PMC8916576 138. Biswas K Sarkar S Du K Brautigan DL Abbas T Larner JM The E3 ligase CHIP mediates p21 degradation to maintain radioresistance Mol Cancer Res 2017 15 6 651 9 10.1158/1541-7786.MCR-16-0466 28232384 PMC5687089 Biswas K, Sarkar S, Du K, Brautigan DL, Abbas T, Larner JM. The E3 ligase CHIP mediates p21 degradation to maintain radioresistance. Mol Cancer Res. 2017;15(6):651–9. 28232384 10.1158/1541-7786.MCR-16-0466 PMC5687089 139. Tan B Zhang J Wang W Ma H Yang Y Tumor-suppressive E3 ubiquitin ligase CHIP inhibits the PBK/ERK axis to repress stem cell properties and radioresistance in non-small cell lung cancer Apoptosis 2023 28 3–4 397 413 10.1007/s10495-022-01789-y 36436119 Tan B, Zhang J, Wang W, Ma H, Yang Y. Tumor-suppressive E3 ubiquitin ligase CHIP inhibits the PBK/ERK axis to repress stem cell properties and radioresistance in non-small cell lung cancer. Apoptosis. 2023;28(3–4):397–413. 36436119 10.1007/s10495-022-01789-y 140. Tsuchiya H Shinonaga R Sakaguchi H Kitagawa Y Yoshida K Shiota G NEAT1 confers radioresistance to hepatocellular carcinoma cells by inducing PINK1/Parkin-mediated mitophagy Int J Mol Sci 2022 10.3390/ijms232214397 36430876 PMC9692527 Tsuchiya H, Shinonaga R, Sakaguchi H, Kitagawa Y, Yoshida K, Shiota G. NEAT1 confers radioresistance to hepatocellular carcinoma cells by inducing PINK1/Parkin-mediated mitophagy. Int J Mol Sci. 2022. 10.3390/ijms232214397. 36430876 10.3390/ijms232214397 PMC9692527 141. Chen Q Zheng W Zhu L Liu H Song Y Hu S Bai Y Pan Y Zhang J Guan J Shao C LACTB2 renders radioresistance by activating PINK1/Parkin-dependent mitophagy in nasopharyngeal carcinoma Cancer Lett 2021 518 127 39 10.1016/j.canlet.2021.07.019 34271102 Chen Q, Zheng W, Zhu L, Liu H, Song Y, Hu S, Bai Y, Pan Y, Zhang J, Guan J, Shao C. LACTB2 renders radioresistance by activating PINK1/Parkin-dependent mitophagy in nasopharyngeal carcinoma. Cancer Lett. 2021;518:127–39. 34271102 10.1016/j.canlet.2021.07.019 142. Xue X Tan H Jiang X Lu J Sun T Yang W Prohibitin2 knockdown decreases glioma malignant phenotypes and radio-resistance by inhibiting mitophagy Int J Radiat Biol 2025 101 5 487 98 10.1080/09553002.2025.2470203 40029335 Xue X, Tan H, Jiang X, Lu J, Sun T, Yang W. Prohibitin2 knockdown decreases glioma malignant phenotypes and radio-resistance by inhibiting mitophagy. Int J Radiat Biol. 2025;101(5):487–98. 40029335 10.1080/09553002.2025.2470203 143. Liao J Qing X Li X Gan Y Wang R Han S Li W Song W TRAF4 regulates ubiquitination-modulated survivin turnover and confers radioresistance Int J Biol Sci 2024 20 1 182 199 10.7150/ijbs.87180 38164179 PMC10750280 Liao J, Qing X, Li X, Gan Y, Wang R, Han S, Li W, Song W. TRAF4 regulates ubiquitination-modulated survivin turnover and confers radioresistance. Int J Biol Sci. 2024;20(1):182–99. 38164179 10.7150/ijbs.87180 PMC10750280 144. Wang H Xu Q Dong X Guan Z Wang Z Hao Y Lu R Chen L Gold nanoparticles enhances radiosensitivity in glioma cells by inhibiting TRAF6/NF-kappaB induced CCL2 expression Heliyon 2023 9 3 e14362 10.1016/j.heliyon.2023.e14362 36967939 PMC10036657 Wang H, Xu Q, Dong X, Guan Z, Wang Z, Hao Y, Lu R, Chen L. Gold nanoparticles enhances radiosensitivity in glioma cells by inhibiting TRAF6/NF-kappaB induced CCL2 expression. Heliyon. 2023;9(3): e14362. 36967939 10.1016/j.heliyon.2023.e14362 PMC10036657 145. Liu C Wang X Qin W Tu J Li C Zhao W Ma L Liu B Qiu H Yuan X Combining radiation and the ATR inhibitor Berzosertib activates STING signaling and enhances immunotherapy via inhibiting SHP1 function in colorectal cancer Cancer Commun (Lond) 2023 43 4 435 54 10.1002/cac2.12412 36855844 PMC10091106 Liu C, Wang X, Qin W, Tu J, Li C, Zhao W, Ma L, Liu B, Qiu H, Yuan X. Combining radiation and the ATR inhibitor Berzosertib activates STING signaling and enhances immunotherapy via inhibiting SHP1 function in colorectal cancer. Cancer Commun (Lond). 2023;43(4):435–54. 36855844 10.1002/cac2.12412 PMC10091106 146. Ai H He Z Deng Z Chu GC Shi Q Tong Z Li JB Pan M Liu L Structural and mechanistic basis for nucleosomal H2AK119 deubiquitylation by single-subunit deubiquitinase USP16 Nat Struct Mol Biol 2024 31 11 1745 55 10.1038/s41594-024-01342-2 38918638 Ai H, He Z, Deng Z, Chu GC, Shi Q, Tong Z, Li JB, Pan M, Liu L. Structural and mechanistic basis for nucleosomal H2AK119 deubiquitylation by single-subunit deubiquitinase USP16. Nat Struct Mol Biol. 2024;31(11):1745–55. 38918638 10.1038/s41594-024-01342-2 147. Fisch AS Pestana A Sachse V Doll C Hofmann E Heiland M Obermueller T Heidemann J Dommerich S Schoppe D Feasibility analysis of using patient-derived tumour organoids for treatment decision guidance in locally advanced head and neck squamous cell carcinoma Eur J Cancer 2024 213 115100 10.1016/j.ejca.2024.115100 39476443 Fisch AS, Pestana A, Sachse V, Doll C, Hofmann E, Heiland M, Obermueller T, Heidemann J, Dommerich S, Schoppe D, et al. Feasibility analysis of using patient-derived tumour organoids for treatment decision guidance in locally advanced head and neck squamous cell carcinoma. Eur J Cancer. 2024;213: 115100. 39476443 10.1016/j.ejca.2024.115100 148. Vlachogiannis G Hedayat S Vatsiou A Jamin Y Fernandez-Mateos J Khan K Lampis A Eason K Huntingford I Burke R Patient-derived organoids model treatment response of metastatic gastrointestinal cancers Science 2018 359 6378 920 6 10.1126/science.aao2774 29472484 PMC6112415 Vlachogiannis G, Hedayat S, Vatsiou A, Jamin Y, Fernandez-Mateos J, Khan K, Lampis A, Eason K, Huntingford I, Burke R, et al. Patient-derived organoids model treatment response of metastatic gastrointestinal cancers. Science. 2018;359(6378):920–6. 29472484 10.1126/science.aao2774 PMC6112415 149. Wang Z Wang Y Shen N Liu Y Xu X Zhu R Jiang H Wu X Wei Y Tang J AMPKalpha1-mediated ZDHHC8 phosphorylation promotes the palmitoylation of SLC7A11 to facilitate ferroptosis resistance in glioblastoma Cancer Lett 2024 584 216619 10.1016/j.canlet.2024.216619 38211651 Wang Z, Wang Y, Shen N, Liu Y, Xu X, Zhu R, Jiang H, Wu X, Wei Y, Tang J. AMPKalpha1-mediated ZDHHC8 phosphorylation promotes the palmitoylation of SLC7A11 to facilitate ferroptosis resistance in glioblastoma. Cancer Lett. 2024;584: 216619. 38211651 10.1016/j.canlet.2024.216619 150. Hehl LA Horn-Ghetko D Prabu JR Vollrath R Vu DT Perez Berrocal DA Mulder MPC van der Heden GJ Schulman BA Structural snapshots along K48-linked ubiquitin chain formation by the HECT E3 UBR5 Nat Chem Biol 2024 20 2 190 200 10.1038/s41589-023-01414-2 37620400 PMC10830417 Hehl LA, Horn-Ghetko D, Prabu JR, Vollrath R, Vu DT, Perez Berrocal DA, Mulder MPC, van der Heden GJ, Schulman BA. Structural snapshots along K48-linked ubiquitin chain formation by the HECT E3 UBR5. Nat Chem Biol. 2024;20(2):190–200. 37620400 10.1038/s41589-023-01414-2 PMC10830417 151. Tu Y, Xu L, Fu G, Wang J, Xia P, Tao Z, Ye Y, Hu J, Cai W, Zhu H et al. Lactylation-driven USP4-mediated ANXA2 stabilization and activation promotes maintenance and radioresistance of glioblastoma stem cells. Cell Death Differ 2025. 10.1038/s41418-025-01494-8. 10.1038/s41418-025-01494-8 PMC12432172 40185997 152. Zhang DY Zhu Y Wu Q Ma S Ma Y Shen ZC Wang Z Sun W Zhou YC Wang D USP1 promotes cholangiocarcinoma progression by deubiquitinating PARP1 to prevent its proteasomal degradation Cell Death Dis 2023 14 10 669 10.1038/s41419-023-06172-6 37821462 PMC10567853 Zhang DY, Zhu Y, Wu Q, Ma S, Ma Y, Shen ZC, Wang Z, Sun W, Zhou YC, Wang D, et al. USP1 promotes cholangiocarcinoma progression by deubiquitinating PARP1 to prevent its proteasomal degradation. Cell Death Dis. 2023;14(10): 669. 37821462 10.1038/s41419-023-06172-6 PMC10567853 153. Van derdys V Allak A Guessous F Benamar M Read PW Jameson MJ Abbas T The neddylation inhibitor pevonedistat (MLN4924) suppresses and radiosensitizes head and neck squamous carcinoma cells and tumors Mol Cancer Ther 2018 17 2 368 80 10.1158/1535-7163.MCT-17-0083 28838998 PMC5805645 Van derdys V, Allak A, Guessous F, Benamar M, Read PW, Jameson MJ, Abbas T. The neddylation inhibitor pevonedistat (MLN4924) suppresses and radiosensitizes head and neck squamous carcinoma cells and tumors. Mol Cancer Ther. 2018;17(2):368–80. 28838998 10.1158/1535-7163.MCT-17-0083 PMC5805645 ",
  "metadata": {
    "Title of this paper": "The neddylation inhibitor pevonedistat (MLN4924) suppresses and radiosensitizes head and neck squamous carcinoma cells and tumors",
    "Journal it was published in:": "Molecular Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12492556/"
  }
}