{
  "title": "Paper_64",
  "abstract": "pmc Lancet Reg Health West Pac Lancet Reg Health West Pac 4068 lrhwp The Lancet Regional Health: Western Pacific 2666-6065 Elsevier PMC12492010 PMC12492010.1 12492010 12492010 10.1016/j.lanwpc.2025.101690 S2666-6065(25)00229-9 101690 1 Viewpoint Bangkok declarations on cancer control in Asia Huang Junjie junjie_huang@link.cuhk.edu.hk a b o Zhong Claire Chenwen chenwenzhong@link.cuhk.edu.hk a b o Ishak Abubakar Sunusi abubakarsunusi2020@gmail.com c Lawal Bukola Titilope bukstil@gmail.com d Orji Chidinma Nelson orji.chidinmanelson@gmail.com d Elcarte Edmar S. edmarelcarte2122@gmail.com e f Obukishie Onyeka Emmanuel obukishieonyeka@gmail.com g Vicerra Paolo Miguel Manalang pmvicerra@gmail.com h Phisalaphong Romruedee rphisalaphong@gmail.com i Maung Soe Thiha dr.sthm92@gmail.com j k Suo Yue ysuo0603@gmail.com l Huang Zhengwei williamhuang@link.cuhk.edu.hk a Yang Zehuan tobytoby@link.cuhk.edu.hk a b Sahakitrungruang Taninee taninee.p@chula.ac.th c p Rampal Sanjay srampal@um.edu.my m ∗∗∗ p Withers Mellissa mwithers@usc.edu n p ∗∗ Wong Martin C.S. wong_martin@cuhk.edu.hk a b p ∗ NCD Global Health Working Group of Association of Pacific Rim Universities (APRU) a b c d e f g h i j k l m n ∗ wong_martin@cuhk.edu.hk ∗∗ mwithers@usc.edu ∗∗∗ srampal@um.edu.my o Contribute equally. p Full professor. 10 2025 22 9 2025 63 497995 101690 7 2 2025 29 8 2025 4 9 2025 22 09 2025 04 10 2025 04 10 2025 © 2025 Published by Elsevier Ltd. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary The “Bangkok Declarations” highlight key strategies to reduce the cancer burden in Asia. Recognizing the role of lifestyle factors like tobacco use, unhealthy diets, and inactivity, they advocate for public health initiatives promoting healthier communities. Environmental risks must also be addressed to enhance prevention strategies. Vaccination programs targeting cancer-causing viruses are emphasized for reducing incidence rates. However, limited access to cancer screening and early detection services remains a challenge, requiring improvements to boost early intervention and patient outcomes. The financial burden of cancer treatment is critical, necessitating cost-effective therapies and financial support systems. Mental health support for patients and caregivers is essential for holistic care. Digital health technologies and AI offer promise for improving diagnosis and treatment in resource-limited settings. Collaboration among stakeholders is vital, with culturally sensitive approaches ensuring equitable care. Research should focus on lifestyle, environmental factors, innovative prevention, and access to care for effective cancer control. Keywords Burden of cancer Lifestyle Prevention pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction In 2020, the reported cancer incidence in Asia was 169.1 per 100,000, accounting for 50% of the global cancer incidence. The most common cancers were lung, breast, and colorectal. Approximately 58% of global cancer deaths occurred in Asia, primarily due to lung, liver, and gastrointestinal cancers. 1 2 3 4 Theme 1: epidemiology and risk factors Statement 1 Lifestyle factors such as tobacco use, unhealthy diet, and lack of physical activity contribute significantly to the burden of cancer in the region. Problem Lifestyle risk factors, such as tobacco use, unhealthy diet, and lack of physical activity, contribute significantly to the high and increasing burden of common cancers in the region. 1 , 5 6 , 7 8 9 , 10 7 , 11 7 , 12 13 14 , 15 14 , 15 7 , 16 17 18 19 20 21 22 Solution In response to these challenges, the Asian National Cancer Centers Alliance (ANCCA) has developed comprehensive, evidence-based guidelines to mitigate the cancer burden in member states. 23 24 24 25 , 26 25 25 Statement 2 The impact of environmental factors on cancer incidence and mortality needs to be further explored and addressed. Problem On the other hand, environmental factors, such as infections caused by Helicobacter pylori 1 , 5 27 28 29 7 , 11 30 31 , 32 Solution To mediate the burden of cancer attributable to environmental factors, the ANCCA also advocates for reducing environmental pollutants such as air pollution, pesticides, and radiation; participating in vaccination programs for Hepatitis B and HPV; and undergoing cancer screenings for bowel, breast, cervical, and other cancers, managing stress, protecting against UV radiation, avoiding unsafe sex, and cautiously using hormone replacement therapy (HRT). 7 Statement 3 Innovative approaches in cancer prevention, including vaccination against cancer-causing viruses, can help reduce the disease burden. Problem Cancer prevention through emerging technologies and innovative approaches presents transformative opportunities for Southeast Asia's evolving healthcare landscape. While traditional prevention methods remain important, technological innovations are revolutionizing preventive strategies across ASEAN nations. 33 34 Solution Asian countries may consider using innovative approaches that have been tested in other countries. For example, in China, a multicenter randomized controlled trials has reported the benefit of using AI-assisted colonoscopy in detecting adenoma among asymptomatic individuals. 35 36 37 38 39 , 40 Theme 2: healthcare delivery and access Statement 4 Access to cancer screening and early detection services remains a significant challenge in many countries across the region. Problem Barriers to cancer screening include lack of awareness or education, inconvenience, fear of pain, lack of time, and cultural perceptions. 41 42 , 43 44 45 5 46 47 Solution To mediate the abovementioned difficulties in local healthcare services, the Thailand government has decided to focus on district and subdistrict levels of health infrastructure since the fourth National Economic and Social Development Plan in 1977. 48 49 50 51 , 52 53 54 55 Problem Another challenge related to cancer screening that many Asian countries face is the increasing incidence of cancer among younger generations. For instance, female breast cancer incidence rates have significantly increased from 1990 to 2021 among patients aged between 15 and 39 across all countries in Southeast Asia, with highest increase observed in Thailand, Singapore, and Malaysia. 56 57 58 59 60 Solution Therefore, in Asia, a one-size-fits-all approach of lowering the screening age to address the rapidly increasing burden of early-onset cancers may not be an effective or efficient strategy. In contrast, Hong Kong's Centre for Health Protection categorizes women into high risk, moderate risk, and average risk based on personalized risk factors to determine the appropriate starting age for mammography screening. 61 Statement 5 The cost of cancer treatment and care poses a significant financial burden on individuals and healthcare systems in the region. Problem Asia, encompassing both high-income countries like Australia, Japan, and Singapore, as well as low- and middle-income countries (LMICs), faces significant financial challenges regarding cancer treatment. A nationwide multisite study found that approximately 50% of cancer patients reported experiencing financial toxicity, which negatively impacted their quality of life and treatment adherence. 62 , 63 64 65 66 66 , 67 68 69 70 Solution To address these challenges, a multifaceted approach is essential, including implementing value-based pricing models, expanding insurance coverage, increasing access to subsidized medications, improving data collection for evidence-based policy making, and emphasizing prevention and early detection strategies. Adopting the Comprehensive Score for Financial Toxicity (COST) could serve as an effective approach to reporting financial toxicity in Asia. This is a validated tool that assesses patients' perceived financial burden, evaluates their coping mechanisms, and measures the impact of costs on their quality of life. 71 72 73 73 Statement 6 Digital health technologies have the potential to revolutionize care delivery and potential monitoring in resource-limited settings. Problem Emerging digital health technologies have significant potential for enhancing cancer care delivery. Successful examples have shown that digital health technologies can be widely used at multiple stages of cancer care, including prevention, screening, and treatment. For instance, digital health technologies can provide information on healthy lifestyles to educate patients and support behavioral change. 74 75 , 76 Solution The development of digital health apps may refer to some successfully examples from Asian regions. The Hong Kong government launched the eHealth App to support patient healthcare, and a study found that type 2 diabetes patients who used its Health Management Module achieved more optimal HbA1c levels across all subgroups. 77 78 , 79 80 81 Theme 3: patient support and community engagement Statement 7 Cultural beliefs and practices influence attitudes towards cancer screening, treatment choices, and end-of-life care in Asia. Problem Cultural beliefs and practices significantly influence attitudes towards cancer screening, treatment choices, and end-of-life care across Asia. Addressing these cultural aspects is crucial for developing effective global health strategies tailored to diverse populations. For example, women in the region often face barriers such as modesty and embarrassment when considering breast and cervical cancer screenings, leading to low uptake in some areas. 82 83 84 83 85 85 , 86 87 88 89 Solution Among the fundamental aspects of cancer care is the need to acknowledge patients' cultural backgrounds. This is crucial across the spectrum of cancer care, from screening to end-of-life care. Women in Asia often face dilemmas in breast and cervical cancer screening uptake due to modesty concerns. 90 , 91 92 , 93 94 , 95 96 , 97 Statement 8 Providing access to mental health support for cancer patients and their caregivers is crucial for improving overall quality of life during and after treatment. Problem Patients facing cancer experience multifaceted stressors that impact their physical and mental health, often leading to a decline in overall quality of life. Perceived stigma related to cancer is considered to be more prevalent and severe in Asia, as Asian cultures are generally more conservative and stringent compared to the West. 98 99 98 , 99 Solution Mental health support, particularly through social interactions and solidarity, has been shown to alleviate these effects and enhance quality of life. Studies highlight that perceived social support significantly improves outcomes among cancer patients, often yielding greater benefits compared to the general population. 100 101 Problem Caregivers, who are increasingly involved in outpatient and ambulatory cancer care settings, also face a decline in quality of life due to the stress of caregiving. In Asia, the role of caregiver is usually played by family members, mostly women, and is motivated by the sociocultural values of filial piety. 102 103 102 103 104 Solution Social support, including family involvement, can help mitigate these challenges. 105 102 106 Statement 9 Collaboration between researchers, policymakers, healthcare providers, and community stakeholders is essential for developing effective cancer control programs. Problem Modern cancer care encompasses three critical facets: clinical medicine, approaches to care, and systems-level solutions. 107 90 , 108 92 , 94 Solution The factors influencing the local burden of cancer are often interconnected and shaped by multiple sectors, including healthcare, education, environment, and socioeconomics. Consequently, effective cancer control necessitates a collaborative approach, integrating health education, prevention, clinical trials, disease registries, patient screening, and care. 109 110 91 91 91 111 112 113 109 , 114 Theme 4: innovation and research Statement 10 The integration of artificial intelligence and machine learning in cancer diagnosis and treatment planning has the potential to improve clinical outcomes. Problem Regarding cancer diagnosis and treatment, the decision-making process should be tailored to a patient's phenotype and ability to respond to specific treatments. Treatment response may vary by detection, management, aggressiveness, and recurrence complexities. AI has the immediate potential to improve disease diagnosis and assessment through accurate interpretation of radiographic imaging. 115 Solution Deep learning models have accurately identified and diagnosed patterns in radiographic imaging. 116 115 117 118 119 120 Problem However, it is crucial to ensure the generalizability of such approaches and avoid overreliance on one-size-fits-all solutions. 121 Solution The localization of AI includes ensuring marginalized populations to be fully represented in data collection, model training, and implementation processes, as well as verifying the applicability and effectiveness of these technologies for vulnerable groups. 122 Statement 11 Addressing healthcare workforce shortages and enhancing training programs for oncology professionals are crucial for meeting the growing demand for cancer care. Problem Cancer incidence rises as the population ages. According to the American Cancer Society, an aging population greatly contributes to the rising incidence of cancer. 123 124 125 126 127 128 129 Solution The healthcare workforce shortages may be addressed with a more comprehensive training curriculum that incorporates new approaches to improve diagnosis, treatment, and monitoring, especially in LMICs. 130 , 131 132 133 134 126 128 Statement 12 Multisectoral approaches that address social determinants of health are essential for reducing the burden of cancer and improving health equity in the region. Problem Social determinants of health (SDH) are “the non-medical factors that influence health outcomes”. They are the conditions in which people are born, grow, work, live, and age, and the wider set of forces and systems shaping the conditions of daily life. These forces and systems include economic policies and systems, development agendas, social norms, social policies, and political systems. 135 136 137 138 Solution In order to address health equity, an understanding of the classification of SDH is important. Inequities occur due to three major factors: structural inequities and social injustice, institutional environment, living environment which can be classified as social needs. 139 139 140 141 142 139 143 144 144 144 Contributors Junjie Huang, Claire Chenwen Zhong, Abubakar Sunusi Ishak, Bukola Titilope Lawal, Chidinma Nelson Orji, Edmar S. Elcarte, Onyeka Emmanuel Obukishie, Paolo Miguel Manalang Vicerra, Romruedee Phisalaphong, Soe Thiha Maung, Yue Suo, Zhengwei Huang, and Zehuan Yang drafted the manuscript. Taninee Sahakitrungruang, Sanjay Rampal, Mellissa Withers, and Martin C.S. Wong reviewed and edited the manuscript. Declaration of interests Martin C.S. Wong is the honorary medical advisor of GenieBiome Ltd. and BGI Health. He is an advisory committee member of Pfizer; an external expert of GlaxoSmithKline Limited; and a member of the advisory board of AstraZeneca. He did not receive any remuneration or actual/perceived benefits from publishing this article, which was initiated by the Chairs of the NCD Stream of the Association of Pacific Rim Universities (APRU). None of the authors received any funding for the paper. References 1 Binns C. Low W.Y. Cancer: An Increasing Public Health Challenge in the Asia Pacific 2024 SAGE Publications Sage CA Los Angeles, CA 309 311 10.1177/10105395241253049 38666588 2 Morgan E. Arnold M. Gini A. Global burden of colorectal cancer in 2020 and 2040: incidence and mortality estimates from GLOBOCAN Gut 72 2 2023 338 344 36604116 10.1136/gutjnl-2022-327736 3 Xue Y. Jiang Y. Jin S. Li Y. Association between cooking oil fume exposure and lung cancer among Chinese nonsmoking women: a meta-analysis Onco Targets Ther 9 2016 2987 2992 27284248 10.2147/OTT.S100949 PMC4881732 4 Kim H.J. Chang W.K. Kim M.K. Lee S.S. Choi B.Y. Dietary factors and gastric cancer in Korea: a case-control study Int J Cancer 97 4 2002 531 535 11802218 10.1002/ijc.10111 5 Feliciano E.J.G. Ho F.D.V. Yee K. Cancer disparities in Southeast Asia: intersectionality and a call to action Lancet Reg Health West Pac 41 2023 100971 10.1016/j.lanwpc.2023.100971 PMC10694578 38053740 6 World Health Organization Policy Response to Alcohol Consumption and Tobacco Use During the COVID-19 Pandemic in the WHO South-East Asia Region: Preparedness for Future Pandemic Events 2022 World Health Organization Geneva Snapshot series on alcohol control policies and practice. Brief 7, July 2022 7 Ong S.K. Abe S.K. Gek Phua G.L. Mapping recommendations towards an Asian Code Against Cancer (ACAC) as part of the World Code Against Cancer Framework: an Asian National Cancer Centers Alliance (ANCCA) initiative Lancet Reg Health Southeast Asia 24 2024 100316 10.1016/j.lansea.2023.100316 PMC11096658 38756166 8 Chen K.C. Tsai S.W. Shie R.H. Zeng C. Yang H.Y. Indoor air pollution increases the risk of lung cancer Int J Environ Res Public Health 19 3 2022 1164 10.3390/ijerph19031164 PMC8834322 35162188 9 Zhong L. Goldberg M.S. Gao Y.T. Jin F. Lung cancer and indoor air pollution arising from Chinese-style cooking among nonsmoking women living in Shanghai, China Epidemiology 10 5 1999 488 494 10468420 10 Chen T.Y. Fang Y.H. Chen H.L. Impact of cooking oil fume exposure and fume extractor use on lung cancer risk in non-smoking Han Chinese women Sci Rep 10 1 2020 6774 32317677 10.1038/s41598-020-63656-7 PMC7174336 11 Bahrami H. Tafrihi M. Global trends of cancer: the role of diet, lifestyle, and environmental factors Cancer Innov 2 4 2023 290 301 38089751 10.1002/cai2.76 PMC10686168 12 Jeng K.S. Chang C.F. Sheen I.S. Jeng C.J. Wang C.H. Upper gastrointestinal cancer and liver cirrhosis Cancers (Basel) 14 9 2022 2269 10.3390/cancers14092269 PMC9105927 35565397 13 Belay G.M. Lam K.K.W. Liu Q. Wu C.S.T. Mak Y.W. Ho K.Y. Magnitude and determinants of alcohol use disorder among adult population in East Asian countries: a systematic review and meta-analysis Front Public Health 11 2023 1144012 10.3389/fpubh.2023.1144012 PMC10011711 36926176 14 Kwak J.H. Eun C.S. Han D.S. Gastric cancer and the daily intake of the major dish groups contributing to sodium intake: a case-control study in Korea Nutrients 13 4 2021 1365 10.3390/nu13041365 PMC8072798 33921757 15 Kim J.H. Lee J. Choi I.J. Kim Y.-I. Kim J. Dietary patterns and gastric cancer risk in a Korean population: a case–control study Eur J Nutr 60 1 2021 389 397 32350654 10.1007/s00394-020-02253-w 16 Ogunlakin A. Ihiasota P. Ojo O. Effects of dietary modifications and physical activity on cancer prevention and treatment Diet Suppl Nutraceuticals 3 6 2024 13 35 17 Petti S. Masood M. Scully C. The magnitude of tobacco smoking-betel quid chewing-alcohol drinking interaction effect on oral cancer in South-East Asia. A meta-analysis of observational studies PLoS One 8 11 2013 e78999 10.1371/journal.pone.0078999 PMC3832519 24260143 18 Eswar N. Oral health status among the tobacco and betel nut chewers in the Kishore Ganj District of Bangladesh. A statistical study Indian J Dent Res 13 3–4 2002 167 171 12765097 19 Gunjal S. Pateel D.G.S. Yang Y.H. An overview on betel quid and areca nut practice and control in selected Asian and South East Asian countries Subst Use Misuse 55 9 2020 1533 1544 32569533 10.1080/10826084.2019.1657149 20 IARC Working Group on the Evaluation of Carcinogenic Risks to Humans Betel-quid and areca-nut chewing and some areca-nut derived nitrosamines IARC Monogr Eval Carcinog Risks Hum 85 2004 1 334 15635762 PMC4781453 21 De Silva V. Hanwella D. Gunawardena N. Prevalence of betel chewing among males in Colombo and Polonnaruwa districts J Coll Community Phys Sri Lanka 14 1 2011 20 22 Hatsukami D. Zeller M. Gupta P. Parascandola M. Asma S. Smokeless Tobacco and Public Health: A Global Perspective 2014 US National Cancer Institute Maryland 23 Ong S.K. Abe S.K. Thilagaratnam S. Towards elimination of cervical cancer–human papillomavirus (HPV) vaccination and cervical cancer screening in Asian National Cancer Centers Alliance (ANCCA) member countries Lancet Reg Health West Pac 39 2023 100860 10.1016/j.lanwpc.2023.100860 PMC10415801 37576906 24 Sangthong R. Wichaidit W. Ketchoo C. Current situation and future challenges of tobacco control policy in Thailand Tob Control 21 1 2012 49 54 21791510 10.1136/tc.2011.043331 25 Ahsan A. Afin R. Amalia N. Hindriyani M. Jacinda A.R. Kramer E. FCTC ratification, smoking prevalence, and GDP per capita: lessons for Indonesia and the rest of the world Global Health 18 1 2022 11 35123526 10.1186/s12992-022-00810-y PMC8818242 26 Tobacco Control Implementation Hub Tobacco control implementation in Indonesia Available from: https://www.tcimplementationhub.org/country/tobacco-control-implementation-in-indonesia 2023 27 Sarin S.K. Kumar M. Eslam M. Liver diseases in the Asia-Pacific region: a Lancet Gastroenterology & Hepatology Commission Lancet Gastroenterol Hepatol 5 2 2020 167 228 31852635 10.1016/S2468-1253(19)30342-5 PMC7164809 28 Danpanichkul P. Suparan K. Sukphutanan B. Changes in the epidemiological trends of primary liver cancer in the Asia–Pacific region Sci Rep 14 1 2024 19544 10.1038/s41598-024-70526-z PMC11341810 39174722 29 Liu Y. Liu L. Changes in the epidemiology of hepatocellular carcinoma in Asia Cancers (Basel) 14 18 2022 4473 10.3390/cancers14184473 PMC9496757 36139633 30 Golui D. Raza M.B. Roy A. Arsenic in the soil-plant-human continuum in regions of Asia: exposure and risk assessment Curr Pollut Rep 9 4 2023 760 783 31 Wei S. Zhang H. Tao S. A review of arsenic exposure and lung cancer Toxicol Res 8 3 2019 319 327 10.1039/c8tx00298c PMC6505385 31160966 32 Ferreccio C. González C. Milosavjlevic V. Marshall G. Sancha A.M. Smith A.H. Lung cancer and arsenic concentrations in drinking water in Chile Epidemiology 11 6 2000 673 679 11055628 10.1097/00001648-200011000-00010 33 Sankaranarayanan R. Ramadas K. Qiao Y.L. Managing the changing burden of cancer in Asia BMC Med 12 2014 3 17 24400922 10.1186/1741-7015-12-3 PMC4029284 34 Kosowicz L. Tran K. Khanh T.T. Lessons for Vietnam on the use of digital technologies to support patient-centered care in low-and middle-income countries in the Asia-Pacific region: scoping review J Med Internet Res 25 2023 e43224 10.2196/43224 PMC10132046 37018013 35 Xu H. Tang R.S.Y. Lam T.Y.T. Artificial intelligence–assisted colonoscopy for colorectal cancer screening: a multicenter randomized controlled trial Clin Gastroenterol Hepatol 21 2 2023 337 346.e3 35863686 10.1016/j.cgh.2022.07.006 36 Wu J. Li R. Gan J. Application of artificial intelligence in lung cancer screening: a real-world study in a Chinese physical examination population Thorac Cancer 15 28 2024 2061 2072 39206529 10.1111/1759-7714.15428 PMC11444925 37 Liang F. Yang X. Peng W. Applications of digital health approaches for cardiometabolic diseases prevention and management in the Western Pacific region Lancet Reg Health West Pac 43 2024 100817 10.1016/j.lanwpc.2023.100817 PMC10920052 38456090 38 Sobti R.C. Krishan A. Sobti A. Biomarkers in Cancer Detection and Monitoring of Therapeutics: Volume 1: Discovery and Technologies 2023 Academic Press London 39 Parvaresh H. Roozitalab G. Golandam F. Behzadi P. Jabbarzadeh Kaboli P. Unraveling the potential of ALK-targeted therapies in non-small cell lung cancer: comprehensive insights and future directions Biomedicines 12 2 2024 297 38397899 10.3390/biomedicines12020297 PMC10887432 40 Toh S.H.Y. Lee S.C. Sündermann O. Mobile behavioral health coaching as a preventive intervention for occupational public health: retrospective longitudinal study JMIR Form Res 7 1 2023 e45678 10.2196/45678 PMC10625093 37862086 41 Chua B. Ma V. Asjes C. Lim A. Mohseni M. Wee H.L. Barriers to and facilitators of cervical cancer screening among women in Southeast Asia: a systematic review Int J Environ Res Public Health 18 9 2021 4586 10.3390/ijerph18094586 PMC8123618 33926019 42 Jiraniramai S. Pinyopornpanish K. Wongpakaran N. Association between sociodemographic factors and health beliefs related to breast cancer screening behavior among Northern Thai women: a hospital-based study Sci Rep 14 1 2024 7596 38556539 10.1038/s41598-024-58155-y PMC10982300 43 Suwankhong D. Liamputtong P. Boonrod T. Simla W. Khunpol S. Thanapop S. Breast cancer and screening prevention programmes: perceptions of women in a multicultural community in Southern Thailand Int J Environ Res Public Health 20 6 2023 4990 10.3390/ijerph20064990 PMC10049010 36981899 44 Wang H. Hua X. Yao N. The urban-rural disparities and associated factors of health care utilization among cancer patients in China Front Public Health 10 2022 842837 10.3389/fpubh.2022.842837 PMC8931518 35309211 45 Sripan P. Chitapanarux I. Tharavichitkul E. Disparities in the change of cervical cancer mortality rate between urban and rural Chiang Mai in the era of universal health care and the Thai national screening program Int J Equity Health 20 1 2021 175 34325727 10.1186/s12939-021-01515-1 PMC8323343 46 Alberto N.R.I. Alberto I.R.I. Puyat C.V.M. Disparities in access to cancer diagnostics in ASEAN member countries Lancet Reg Health West Pac 32 2023 100667 10.1016/j.lanwpc.2022.100667 PMC9918780 36785859 47 Vichapat V. Chantasartrassamee P. Reungwetwattana T. Impact of waiting times on mortality in advanced stage non-small cell lung cancer: a 10-year retrospective cohort study in Thailand Asian Pac J Cancer Prev 24 10 2023 3419 3428 37898846 10.31557/APJCP.2023.24.10.3419 PMC10770679 48 Nitayarumphong S. Evolution of primary health care in Thailand: what policies worked? Health Pol Plann 5 3 1990 246 254 49 Tangcharoensathien V. Witthayapipopsakul W. Panichkriangkrai W. Patcharanarumol W. Mills A. Health systems development in Thailand: a solid platform for successful implementation of universal health coverage Lancet 391 10126 2018 1205 1223 29397200 10.1016/S0140-6736(18)30198-3 50 Ploysawang P. Rojanamatin J. Prapakorn S. National cervical cancer screening in Thailand Asian Pac J Cancer Prev 22 1 2021 25 30 10.31557/APJCP.2021.22.1.25 PMC8184188 33507675 51 Swaddiwudhipong W. Chaovakiratipong C. Nguntra P. Mahasakpan P. Tatip Y. Boonmak C. A mobile unit: an effective service for cervical cancer screening among rural Thai women Int J Epidemiol 28 1 1999 35 39 10195661 10.1093/ije/28.1.35 52 Swaddiwudhipong W. Chaovakiratipong C. Nguntra P. Mahasakpan P. Lerdlukanavonge P. Koonchote S. Effect of a mobile unit on changes in knowledge and use of cervical cancer screening among rural Thai women Int J Epidemiol 24 3 1995 493 498 7672887 10.1093/ije/24.3.493 53 De Mil R. Guillaume E. Launay L. Cost-effectiveness analysis of a mobile mammography unit for breast cancer screening to reduce geographic and social health inequalities Value Health 22 10 2019 1111 1118 31563253 10.1016/j.jval.2019.06.001 54 Spak D.A. Foxhall L. Rieber A. Hess K. Helvie M. Whitman G.J. Retrospective review of a mobile mammography screening program in an underserved population within a large metropolitan area Acad Radiol 29 2022 S173 S179 10.1016/j.acra.2020.07.012 PMC7855048 32763059 55 Greenwald Z.R. El-Zein M. Bouten S. Ensha H. Vazquez F.L. Franco E.L. Mobile screening units for the early detection of cancer: a systematic review Cancer Epidemiol Biomarkers Prev 26 12 2017 1679 1694 28978564 10.1158/1055-9965.EPI-17-0454 56 Chen J. Ho F.D.V. Feliciano E.J.G. Wu J.F. Magsanoc-Alikpala K. Dee E.C. Trends in female breast cancer among adolescent and young adults in Southeast Asia Lancet Reg Health Southeast Asia 34 2025 100545 10.1016/j.lansea.2025.100545 PMC11875193 40034832 57 Lim Y.X. Lim Z.L. Ho P.J. Li J. Breast cancer in Asia: incidence, mortality, early detection, mammography programs, and risk-based screening initiatives Cancers (Basel) 14 17 2022 4218 10.3390/cancers14174218 PMC9454998 36077752 58 Goto R. Hamashima C. Mun S. Lee W.C. Why screening rates vary between Korea and Japan-differences between two national healthcare systems Asian Pac J Cancer Prev 16 2 2015 395 400 25684461 10.7314/apjcp.2015.16.2.395 59 Ng D.Y. Tudor Car L. Ng M.J.M. Identifying barriers to early presentation in patients with locally advanced breast cancer (LABC) in Northern Singapore: Qualitative study PLoS One 16 5 2021 e0252008 10.1371/journal.pone.0252008 PMC8148318 34032802 60 Abdel-Aziz S.B. Amin T.T. Al-Gadeeb M.B. Perceived barriers to breast cancer screening among Saudi women at primary care setting Asian Pac J Cancer Prev 18 9 2017 2409 2417 28950697 10.22034/APJCP.2017.18.9.2409 PMC5720644 61 Health CfHPDo Recommendations on prevention and screening for breast cancer for health professionals Available from: https://www.chp.gov.hk/files/pdf/breast_cancer_professional_hp.pdf 2020 62 Xu B. So W.K.W. Choi K.C. Financial toxicity and its risk factors among patients with cancer in China: a nationwide multisite study Asia Pac J Oncol Nurs 11 5 2024 100443 10.1016/j.apjon.2024.100443 PMC11039943 38665637 63 Xu B. Hu L. Cheng Q. K W So W. A systematic review of financial toxicity among cancer patients in China Asia Pac J Oncol Nurs 9 8 2022 100071 10.1016/j.apjon.2022.04.010 PMC9184292 35692729 64 Saeki S. Iwatani T. Kitano A. Factors associated with financial toxicity in patients with breast cancer in Japan: a comparison of patient and physician perspectives Breast Cancer 30 5 2023 820 830 37310584 10.1007/s12282-023-01476-z PMC10404186 65 Columbres R.C. Feliciano E.J.G. Taleon-Tampo K.J. Pediatric cancers and family financial toxicity in the Philippines: insights for Southeast Asia and similarly resourced settings Lancet Reg Health West Pac 47 2024 101114 10.1016/j.lanwpc.2024.101114 PMC11253041 39022747 66 Donkor A. Atuwo-Ampoh V.D. Yakanu F. Financial toxicity of cancer care in low- and middle-income countries: a systematic review and meta-analysis Support Care Cancer 30 9 2022 7159 7190 35467118 10.1007/s00520-022-07044-z PMC9385791 67 Fernandes Antunes A. Jithitikulchai T. Hohmann J. Flessa S. Revisiting a decade of inequality in healthcare financial burden in Cambodia, 2009–19: trends, determinants and decomposition Int J Equity Health 23 1 2024 196 39350182 10.1186/s12939-024-02257-6 PMC11441229 68 Söyük S. The impact of public health expenditure and gross domestic product per capita on the risk of catastrophic health expenditures for OECD countries Front Public Health 11 2023 1122424 10.3389/fpubh.2023.1122424 PMC10118030 37089504 69 Martina D. Segelov E. Improving equity across cancer care continuum in Asia Pacific JCO Glob Oncol 9 2023 e2300056 10.1200/GO.23.00056 PMC10497248 37364219 70 Rimmer B. Crowe L. Todd A. Sharp L. Assessing unmet needs in advanced cancer patients: a systematic review of the development, content, and quality of available instruments J Cancer Surviv 16 5 2022 960 975 34363187 10.1007/s11764-021-01088-6 PMC9489568 71 de Souza J.A. Yap B.J. Wroblewski K. Measuring financial toxicity as a clinically relevant patient-reported outcome: the validation of the COmprehensive Score for financial Toxicity (COST) Cancer 123 3 2017 476 484 27716900 10.1002/cncr.30369 PMC5298039 72 Pan American Health Organization PAHO strategic fund Available from: https://www.paho.org/en/paho-strategic-fund 73 Lee K.S. Ming L.C. Lean Q.Y. Cross-border collaboration to improve access to medicine: association of Southeast Asian nations perspective J Epidemiol Glob Health 9 2 2019 93 97 31241865 10.2991/jegh.k.190506.001 PMC7310754 74 Labrique A.B. Wadhwani C. Williams K.A. Best practices in scaling digital health in low and middle income countries Global Health 14 1 2018 103 30390686 10.1186/s12992-018-0424-z PMC6215624 75 Weik L. Fehring L. Mortsiefer A. Meister S. Understanding inherent influencing factors to digital health adoption in general practices through a mixed-methods analysis NPJ Digit Med 7 1 2024 47 38413767 10.1038/s41746-024-01049-0 PMC10899241 76 Nittas V. Zecca C. Kamm C.P. Kuhle J. Chan A. von Wyl V. Digital health for chronic disease management: an exploratory method to investigating technology adoption potential PLoS One 18 4 2023 e0284477 10.1371/journal.pone.0284477 PMC10101441 37053272 77 Huang J. Chan S.C. Ko S. Associations between adoption of eHealth management module and optimal control of HbA1c in diabetes patients NPJ Digit Med 6 1 2023 67 37055503 10.1038/s41746-023-00807-w PMC10101956 78 Hu L. Bell D. Antani S. An observational study of deep learning and automated evaluation of cervical images for cancer screening J Natl Cancer Inst 111 9 2019 923 932 30629194 10.1093/jnci/djy225 PMC6748814 79 Hesse B.W. Kwasnicka D. Ahern D.K. Emerging digital technologies in cancer treatment, prevention, and control Transl Behav Med 11 11 2021 2009 2017 34850933 10.1093/tbm/ibab033 PMC8824462 80 Alfano C.M. Mayer D.K. Beckjord E. Mending disconnects in cancer care: setting an agenda for research, practice, and policy JCO Clin Cancer Inform 4 2020 539 546 32543897 10.1200/CCI.20.00046 PMC7328120 81 Ganapathy K. Das S. Reddy S. Digital health care in public private partnership mode Telemed J E Health 27 12 2021 1363 1371 33819433 10.1089/tmj.2020.0499 82 Wu T.Y. West B. Chen Y.W. Hergert C. Health beliefs and practices related to breast cancer screening in Filipino, Chinese and Asian-Indian women Cancer Detect Prev 30 1 2006 58 66 16458452 10.1016/j.cdp.2005.06.013 83 Banning M. Hafeez H. Faisal S. Hassan M. Zafar A. The impact of culture and sociological and psychological issues on Muslim patients with breast cancer in Pakistan Cancer Nurs 32 4 2009 317 324 19444089 10.1097/NCC.0b013e31819b240f 84 Ho Z.J.M. Krishna L.K.R. Yee C.P.A. Chinese familial tradition and Western influence: a case study in Singapore on decision making at the end of life J Pain Symptom Manage 40 6 2010 932 937 21145471 10.1016/j.jpainsymman.2010.06.010 85 Norsa'adah B. Rahmah M.A. Rampal K.G. Knight A. Understanding barriers to Malaysian women with breast cancer seeking help Asian Pac J Cancer Prev 13 8 2012 3723 3730 23098462 10.7314/apjcp.2012.13.8.3723 86 Taib N.A. Yip C.H. Low W.Y. Recognising symptoms of breast cancer as a reason for delayed presentation in Asian women--the psycho-socio-cultural model for breast symptom appraisal: opportunities for intervention Asian Pac J Cancer Prev 12 6 2011 1601 1608 22126506 87 Koo J.H. Leong R.W. Ching J. Knowledge of, attitudes toward, and barriers to participation of colorectal cancer screening tests in the Asia-Pacific region: a multicenter study Gastrointest Endosc 76 1 2012 126 135 22726471 10.1016/j.gie.2012.03.168 88 Tay K.J. Zam N.A.M. Cheng C. Prevailing attitudes towards cancer: a multicultural survey in a tertiary outpatient setting Ann Acad Med Singap 42 10 2013 492 498 24254235 89 Schuster-Wallace C.J. Nouvet E. Rigby I. Culturally sensitive palliative care in humanitarian action: lessons from a critical interpretive synthesis of culture in palliative care literature Palliat Support Care 20 4 2022 582 592 34183091 10.1017/S1478951521000894 90 Islam R.M. Billah B. Hossain M.N. Oldroyd J. Barriers to cervical cancer and breast cancer screening uptake in low-income and middle-income countries: a systematic review Asian Pac J Cancer Prev 18 7 2017 1751 1763 28749101 10.22034/APJCP.2017.18.7.1751 PMC5648375 91 Morgan C. Cira M. Karagu A. The Kenya cancer research and control stakeholder program: evaluating a bilateral partnership to strengthen national cancer efforts J Cancer Policy 17 2018 38 44 37020928 10.1016/j.jcpo.2017.03.012 PMC10072854 92 Brant J.M. Silbermann M. Global perspectives on palliative care for cancer patients: not all countries are the same Curr Oncol Rep 23 2021 60 33829323 10.1007/s11912-021-01044-8 PMC8026388 93 Liamputtong P. Suwankhong D. Therapeutic landscapes and living with breast cancer: the lived experiences of Thai women Soc Sci Med 128 2015 263 271 25635373 10.1016/j.socscimed.2015.01.031 94 Yamaguchi T. Maeda I. Hatano Y. Communication and behavior of palliative care physicians of patients with cancer near end of life in three East Asian countries J Pain Symptom Manage 61 2 2021 315 322.e1 32777459 10.1016/j.jpainsymman.2020.07.031 95 Zheng R.S. Guo Q.H. Dong F.Q. Owens R.G. Chinese oncology nurses' experience on caring for dying patients who are on their final days: a qualitative study Int J Nurs Stud 52 1 2015 288 296 25445033 10.1016/j.ijnurstu.2014.09.009 96 Krikorian A. Maldonado C. Pastrana T. Patient's perspectives on the notion of a good death: a systematic review of the literature J Pain Symptom Manage 59 1 2020 152 164 31404643 10.1016/j.jpainsymman.2019.07.033 97 Chindaprasirt J. Wongtirawit N. Limpawattana P. Perception of a “good death” in Thai patients with cancer and their relatives Heliyon 5 7 2019 e02067 10.1016/j.heliyon.2019.e02067 PMC6627555 31338472 98 Teo I. Bhaskar A. Ozdemir S. Perceived stigma and its correlates among Asian patients with advanced cancer: a multi-country APPROACH study Psychooncology 31 6 2022 938 949 35048471 10.1002/pon.5882 99 Teo I. Ozdemir S. Malhotra C. High anxiety and depression scores and mental health service use among South Asian advanced cancer patients: a multi-country study J Pain Symptom Manage 62 5 2021 997 1007 33872721 10.1016/j.jpainsymman.2021.04.005 100 Weis J. Support groups for cancer patients Support Care Cancer 11 12 2003 763 768 14564493 10.1007/s00520-003-0536-7 101 Mahendran R. Lim H.A. Tan J.Y. Evaluation of a brief pilot psychoeducational support group intervention for family caregivers of cancer patients: a quasi-experimental mixed-methods study Health Qual Life Outcomes 15 1 2017 17 28114962 10.1186/s12955-017-0595-y PMC5259827 102 Ng H.Y. Griva K. Lim H.A. Tan J.Y.S. Mahendran R. The burden of filial piety: a qualitative study on caregiving motivations amongst family caregivers of patients with cancer in Singapore Psychol Health 31 11 2016 1293 1310 27356241 10.1080/08870446.2016.1204450 103 Lim H.A. Tan J.Y. Chua J. Quality of life of family caregivers of cancer patients in Singapore and globally Singapore Med J 58 5 2017 258 261 27090600 10.11622/smedj.2016083 PMC5435844 104 Ginsburg O. Vanderpuye V. Beddoe A.M. Women, power, and cancer: a Lancet Commission Lancet 402 10417 2023 2113 2166 37774725 10.1016/S0140-6736(23)01701-4 105 Luszczynska A. Pawlowska I. Cieslak R. Knoll N. Scholz U. Social support and quality of life among lung cancer patients: a systematic review Psychooncology 22 10 2013 2160 2168 23097417 10.1002/pon.3218 106 Yoo H. Shin D.W. Jeong A. Perceived social support and its impact on depression and health-related quality of life: a comparison between cancer patients and general population Jpn J Clin Oncol 47 8 2017 728 734 28531292 10.1093/jjco/hyx064 107 Clauser S.B. Wagner E.H. Aiello Bowles E.J. Tuzzio L. Greene S.M. Improving modern cancer care through information technology Am J Prev Med 40 5 Suppl 2 2011 S198 S207 21521595 10.1016/j.amepre.2011.01.014 PMC3119205 108 Tran B. Mizokami A. Wang S.-S. Understanding experiences and needs of patients with prostate cancer across Asia-Pacific: a cross-sectional mixed-methods study JU Open Plus 2 9 2024 e00092 109 Lao Z. Tse E.W.C. Chuncharunee S. Asia-Pacific Leukemia Consortium: an innovative and collaborative initiative to improve care of leukemia and related diseases in the Asia-Pacific region Asia Pac J Clin Oncol 19 6 2023 655 663 37259880 10.1111/ajco.13970 110 Ekwenugo L. Benard V.B. Vinson C. News from the CDC: collaborations to build capacity at the community level in cancer prevention and control Transl Behav Med 3 1 2013 3 5 24073156 10.1007/s13142-012-0185-9 PMC3717994 111 Pramesh C.S. Badwe R.A. Sinha R.K. The national cancer grid of India Indian J Med Paediatr Oncol 35 3 2014 226 227 25336795 10.4103/0971-5851.142040 PMC4202620 112 Chopra S.J. Mathew A. Maheshwari A. National cancer grid of India consensus guidelines on the management of cervical cancer J Glob Oncol 4 2018 1 15 10.1200/JGO.17.00152 PMC6223405 30085891 113 Department Of Atomic Energy Global participation in National Cancer Grid meeting fulfils Hon'ble PM's promise in 21st ASEAN-India Summit last month Government of India Available from: https://dae.gov.in/global-participation-in-national-cancer-grid-meeting-fulfils-honble-pms-promise-in-21st-asean-india-summit-last-month/ 2024 114 Kale S. Hirani S. Vardhan S. Addressing cancer disparities through community engagement: lessons and best practices Cureus 15 8 2023 e43445 10.7759/cureus.43445 PMC10498131 37711952 115 Bi W.L. Hosny A. Schabath M.B. Artificial intelligence in cancer imaging: clinical challenges and applications CA Cancer J Clin 69 2 2019 127 157 30720861 10.3322/caac.21552 PMC6403009 116 Hosny A. Parmar C. Quackenbush J. Schwartz L.H. Aerts H. Artificial intelligence in radiology Nat Rev Cancer 18 8 2018 500 510 29777175 10.1038/s41568-018-0016-5 PMC6268174 117 Ambrosini R.D. Wang P. O'Dell W.G. Computer-aided detection of metastatic brain tumors using automated three-dimensional template matching J Magn Reson Imaging 31 1 2010 85 93 20027576 10.1002/jmri.22009 PMC2799295 118 Cheng H.D. Cai X. Chen X. Hu L. Lou X. Computer-aided detection and classification of microcalcifications in mammograms: a survey Pattern Recogn 36 12 2003 2967 2991 119 Nishikawa R.M. Computer-aided detection and diagnosis Bick U. Diekmann F. Digital Mammography 2010 Springer Berlin Heidelberg Berlin, Heidelberg 85 106 120 Phallen J. Sausen M. Adleff V. Direct detection of early-stage cancers using circulating tumor DNA Sci Transl Med 9 403 2017 eaan2415 10.1126/scitranslmed.aan2415 PMC6714979 28814544 121 Futoma J. Simons M. Panch T. Doshi-Velez F. Celi L.A. The myth of generalisability in clinical research and machine learning in health care Lancet Digit Health 2 9 2020 e489 e492 32864600 10.1016/S2589-7500(20)30186-2 PMC7444947 122 Celi L.A. Cellini J. Charpignon M.L. Sources of bias in artificial intelligence that perpetuate healthcare disparities-A global review PLOS Digit Health 1 3 2022 e0000022 10.1371/journal.pdig.0000022 PMC9931338 36812532 123 American Cancer Society Cancer Facts & Figures 2024 2024 American Cancer Society Atlanta 124 Bizuayehu H.M. Ahmed K.Y. Kibret G.D. Global disparities of cancer and its projected burden in 2050 JAMA Netw Open 7 11 2024 e2443198 10.1001/jamanetworkopen.2024.43198 PMC11539015 39499513 125 Association of American Medical Colleges The complexities of physician supply and demand: projections from 2021 to 2036 Available from: https://www.aamc.org/media/75236/download 2024 126 Kamarulzaman A. Ramnarayan K. Mocumbi A.O. Plugging the medical brain drain Lancet 400 10362 2022 1492 1494 36522198 10.1016/S0140-6736(22)02087-6 PMC9612885 127 Adovor E. Czaika M. Docquier F. Moullan Y. Medical brain drain: how many, where and why? J Health Econ 76 2021 102409 10.1016/j.jhealeco.2020.102409 33465558 128 Chimenya A. Qi B. Investigating determinants of brain drain of health care professionals in developing countries: a review J Bus Manag 3 2015 27 35 129 American Society of Clinical Oncology Oncology workforce shortages Available from: https://society.asco.org/sites/new-www.asco.org/files/content-files/news-initiatives/documents/2023-workforce-brief.pdf 2023 130 Ha F.J. Parakh S. Novel approaches to undergraduate oncology education J Cancer Educ 33 3 2018 500 504 27581433 10.1007/s13187-016-1109-z 131 Karim S. Sunderji Z. Jalink M. Oncology training and education initiatives in low and middle income countries: a scoping review Ecancermedicalscience 15 2021 1296 10.3332/ecancer.2021.1296 PMC8580602 34824619 132 Chua I.S. Gaziel-Yablowitz M. Korach Z.T. Artificial intelligence in oncology: path to implementation Cancer Med 10 12 2021 4138 4149 33960708 10.1002/cam4.3935 PMC8209596 133 Shanafelt T.D. Boone S. Tan L. Burnout and satisfaction with work-life balance among US physicians relative to the general US population Arch Intern Med 172 18 2012 1377 1385 22911330 10.1001/archinternmed.2012.3199 134 Institute of Medicine National Cancer Policy F Ensuring Quality Cancer Care Through the Oncology Workforce: Sustaining Care in the 21st Century: Workshop Summary 2009 National Academies Press (US) Washington (DC) Copyright 2009 by the National Academy of Sciences. All rights reserved 25009939 135 World Health Organization Social determinants of health Available from: https://www.who.int/health-topics/social-determinants-of-health#tab=tab_1 136 Link B.G. Phelan J. Social conditions as fundamental causes of disease J Health Soc Behav Spec No 1995 80 94 7560851 137 Syrnioti G. Eden C.M. Johnson J.A. Alston C. Syrnioti A. Newman L.A. Social determinants of cancer disparities Ann Surg Oncol 30 13 2023 8094 8104 37723358 10.1245/s10434-023-14200-0 138 Marmot M. Friel S. Bell R. Houweling T.A. Taylor S. Commission on Social Determinants of Health Closing the gap in a generation: health equity through action on the social determinants of health Lancet 372 9650 2008 1661 1669 18994664 10.1016/S0140-6736(08)61690-6 139 Alcaraz K.I. Wiedt T.L. Daniels E.C. Yabroff K.R. Guerra C.E. Wender R.C. Understanding and addressing social determinants to advance cancer health equity in the United States: a blueprint for practice, research, and policy CA Cancer J Clin 70 1 2020 31 46 31661164 10.3322/caac.21586 140 Institute for Policy Studies Income inequality in the United States: facts and figures inequality.org Available from: https://inequality.org/facts/income-inequality/ 141 Henderson S. Horne M. Hills R. Kendall E. Cultural competence in healthcare in the community: a concept analysis Health Soc Care Community 26 4 2018 590 603 29516554 10.1111/hsc.12556 142 Willmott M. Womack J. Hollingworth W. Campbell R. Making the case for investment in public health: experiences of Directors of Public Health in English local government J Public Health (Oxf) 38 2 2016 237 242 25775932 10.1093/pubmed/fdv035 PMC4894482 143 Gase L.N. Pennotti R. Smith K.D. “Health in All Policies”: taking stock of emerging practices to incorporate health in decision making in the United States J Public Health Manag Pract 19 6 2013 529 540 24080816 10.1097/PHH.0b013e3182980c6e 144 Dee E.C. Eala M.A.B. Robredo J.P.G. Leveraging national and global political determinants of health to promote equity in cancer care J Natl Cancer Inst 115 10 2023 1157 1163 37402623 10.1093/jnci/djad123 PMC10560599 Appendix A Supplementary data  Appendix_NCD Declaration Appendix A Supplementary data related to this article can be found at https://doi.org/10.1016/j.lanwpc.2025.101690 ",
  "metadata": {
    "Title of this paper": "Leveraging national and global political determinants of health to promote equity in cancer care",
    "Journal it was published in:": "The Lancet Regional Health: Western Pacific",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12492010/"
  }
}