{
  "title": "Paper_1095",
  "abstract": "Toxicol Sci Toxicol Sci 319 nihpa Toxicological sciences : an official journal of the Society of Toxicology 1096-6080 1096-0929 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12477559 PMC12477559.1 12477559 12477559 NIHMS2112583 40708233 10.1093/toxsci/kfaf090 NIHMS2112583 NIHPA2112583 1 Article Chemosensory Tobacco Product Toxicology Part 1: Sensory Mechanisms http://orcid.org/0000-0002-5828-8487 Lin Weihong ^ 1 http://orcid.org/0000-0002-7507-7331 Hill Thomas III ^ 2 http://orcid.org/0000-0003-2895-460X Stroup Andrea M. 3 http://orcid.org/0000-0003-4890-1820 Sarles S. Emma 4 http://orcid.org/0000-0002-6254-2337 Ogura Tatsuya 1 http://orcid.org/0000-0002-8348-6039 Augustine Farhan 5 http://orcid.org/0009-0004-1388-2783 O’Sullivan Sean 1 http://orcid.org/0000-0003-2274-2454 Rahman Irfan 6 http://orcid.org/0000-0001-8488-5448 Robinson Risa 7 http://orcid.org/0000-0003-0646-3519 Jabba Sairam V. 8 9 10 http://orcid.org/0009-0001-6456-5751 Nuss Caleb 11 http://orcid.org/0000-0002-2682-0766 Hensel Edward 7 1 2 3 4 5 6 7 8 9 10 11 ^ WL & TH are Joint First Authors Collaborators Contributors Corresponding Author: weihong@umbc.edu Conflict of Interest Declaration 01 10 2025 207 2 497744 261 271 22 09 2025 01 10 2025 01 10 2025 30 09 2025 01 10 2025 Chemosensory systems detect and discriminate a wide variety of molecules to monitor internal and external chemical environments. They initiate olfactory, gustatory, and chemesthetic sensations, influence human brain cognition and emotion, and guide a wide variety of behaviors essential for survival, including protective reactions, such as avoidance of contaminated foods and potential toxicants. Electronic nicotine delivery systems (ENDS) aerosolize e-liquids for inhaled consumption that typically contain flavorants, propylene glycol (PG), vegetable glycerin (VG), and nicotine. E-liquid aerosols also contain toxicants, such as formaldehyde, acetaldehyde, acrolein, and heavy metals. Chemosensory evaluation of ENDS aerosol plays an essential role in the assessment of whether a product will attract new users of all ages, as well as determining their likely use patterns, perceptions of product harm, satisfaction, and product selection. Nicotine and individual flavorant constituents stimulate multiple sensory receptor systems in complex patterns, initiating distinctive sensory perceptions depending on the chemical properties and quantity in the aerosol. There are limited data on chemosensory evaluation of ENDS aerosols and their influence on ENDS use and protective biologic mechanisms. This two-part manuscript provides an overview of i) the physiology of the olfactory, gustatory, and chemesthetic chemosensory systems and their detection mechanisms, and their role in protective defenses; and ii) the in vitro, in vivo in silico chemosensory toxicology ENDS aerosol constituents taste smell chemesthesis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Chemosensory Tobacco Product Toxicology Part 1: Sensory Mechanisms",
    "Journal it was published in:": "Toxicological sciences : an official journal of the Society of Toxicology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477559/"
  }
}