{
  "title": "Paper_953",
  "abstract": "pmc Front Oncol Front Oncol 1755 frontonco Front. Oncol. Frontiers in Oncology 2234-943X Frontiers Media SA PMC12484008 PMC12484008.1 12484008 12484008 41040517 10.3389/fonc.2025.1636570 1 Oncology Perspective Role and prognostic value of oncostatin M and its receptor OSMR in acute myeloid leukemia, myeloproliferative neoplasms and non-hematological malignancies Lévesque Jean-Pierre  * Bisht Kavita Alexander Kylie A. Winkler Ingrid G.  Mater Research – The University of Queensland Woolloongabba, QLD Australia Edited by: Fabrizio Carta Reviewed by: Zongsi Zhu  Kalyan Sethi Tina Bhardwaj, Lifecell International Pvt Ltd, India *Correspondence: Jean-Pierre Lévesque, jp.levesque@mater.uq.edu.au 17 9 2025 2025 15 480898 1636570 28 5 2025 02 9 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Lévesque, Bisht, Alexander and Winkler. 2025 Lévesque, Bisht, Alexander and Winkler https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. The oncostatin M receptor (OSMR) has recently emerged as an adverse prognostic factor in acute myeloid leukemia (AML) and several non-hematological malignancies. In this perspective, we discuss how oncostatin M (OSM) and its receptor OSMR regulate tumor cells as well as mesenchymal and endothelial cells, which are key components of hematopoietic stem cell and tumor stem cell niches, and how these mechanisms could explain the poor prognosis associated with high expression of OSM and OSMR in hematological and non-hematological malignancies. oncostatin M prognosis factor tumor microenvironment acute myeloid leukemia myeloproliferative neoplasm glioblastoma glioma pancreatic adenocarcinoma The author(s) declare financial support was received for the research and/or publication of this article. JL, KB, KA and IW are supported by the Mater Foundation. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Cancer Molecular Targets and Therapeutics 1 Introduction High expression of oncostatin M (OSM) receptor OSMR has recently emerged as a poor prognosis factor in several malignancies such as acute myeloblastic leukemia (AML), gliomas, pancreatic, gastric and kidney carcinomas. In this perspective, we perform a larger in silico survey of the prognostic value of high OSMR OSM OSM is an inflammatory cytokine of the interleukin-6 (IL-6) family. OSM binds to two different receptors made up of glycoprotein-130 (GP130, gene IL6ST Il6st OSMR Osmr 1 2 3 4 3 5 6 7 6 6 8 9 10 11 12 13 14 15 16 17 18 19 2 OSM and OSMR in hematological malignancies In a recent paper, high throughput proteomic analysis on more than 550 newly diagnosed AML patients demonstrated that high plasma concentration of soluble OSMR protein was a strong independent predictor of poor survival and early mortality ( 20 OSMR Osmr -/- 21 23 5 OSM 24 OSMR 5 20 20 5 6 25 30 As the OSMR ligand OSM is expressed by myeloid cells (particularly neutrophils and macrophages) and osteoblasts in the bone marrow ( 3 5 OSM 31 32  Figure 1A OSM  Figure 1A OSM  Figure 1B OSM OSM 20 OSM IL31 OSM  Figure 1C IL31  Figure 1D OSM 5 22 23 33 30  Figure 1E Figure 1 Expression of transcripts for OSMR ligands OSM and IL-31 with overall survival plots of AML patients with highest and lowest expression OSM IL31 (A) OSM OSM OSM OSM (B) OSM (C) IL31 (A) (D) IL31 (E) (A–D) 32 Graphs and diagrams depict gene expression and survival data. Panels A and C show transcripts per million (TPM) for OSM and IL31 across different cancer types. Panels B and D display survival curves for high and low TPM levels of these genes. Panel E compares normal bone marrow and AML bone marrow environments, highlighting differences in cell interactions and signaling pathways, such as OSM's role in proliferation and chemosensitivity. In respect to other hematological malignancies, OSM - JAK2 V617F 34 - 34 34 - JAK2 V617F 34 in vivo 5 21 5 6 35 36 - V617F 37 5 6 36 V617F V617F In respect to lymphoid neoplasms, high sOSMR ( 19 38 38 3 OSM and OSMR in non-hematological malignancies Endothelial cells ( 39 40 41 5 22 23 42 OSMR 43 44 45 46 OSMR  Figure 2A OSMR OSMR OSMR OSMR OSMR OSMR  Figures 2B–E OSMR  Figure 2F OSMR  Figure 2G OSMR  Figure 2A OSMR  Figure 2H OSMR Figure 2  OSMR OSMR (A) OSMR  Figure 1A OSMR OSMR OSMR (B–H) OSMR OSMR (B) (C) (D) (E) (F) (G) (H) (I) OSM 32 Chart A displays transcripts per million (TPM) data across various cancer types, highlighting different expression levels. Charts B to I show survival plots for different cancers, including GBM, LGG, PAAD, STAD, KIRC, KIRP, ACC, and KIRC (OSM). Each plot compares overall and disease-free survival between low and high OSMR TPM levels, with statistical details included, such as hazard ratios and p-values. The survival curves are color-coded, with blue and red representing high and low TPM levels, respectively. Reciprocally, OSM  Figure 1A OSM  Figure 2I OSM OSMR OSM  Supplementary Figure 1 The poorer prognosis of tumors with high OSMR OSM OSMR 43 44 in vivo 45 47 in vitro in vivo 46 in vitro 48 VHL VHL VHL 49 VHL 49 4 Discussion Kaplan-Meier plots in  Figures 1  2 OSMR OSM As OSM protein is highly expressed by activated neutrophils, monocytes and macrophages, blood concentration of OSM protein may not be a reliable prognosis marker of cancer treatment outcome because OSM concentration is also elevated during infections, sepsis ( 50 51 14 16 52 5 OSMR 19 OSMR 5 Conclusion and perspectives Blood sOSMR concentration may represent an easily measurable prognosis marker not only in AML as recently reported ( 20 OSMR OSM 4 6 53 OSM 54 OSMR Data availability statement The original contributions presented in the study are included in the article/  Supplementary Material Author contributions JL: Formal analysis, Methodology, Writing – review & editing, Conceptualization, Writing – original draft. KB: Writing – review & editing, Writing – original draft. KA: Writing – review & editing, Writing – original draft. IW: Writing – review & editing, Writing – original draft. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fonc.2025.1636570/full#supplementary-material References 1 Mosley B De Imus C Friend D Boiani N Thoma B Park LS Dual oncostatin M (OSM) receptors. Cloning and characterization of an alternative signaling subunit conferring OSM-specific receptor activation J Biol Chem 1996 271 32635–43 10.1074/jbc.271.51.32635 8999038 2 Ichihara M Hara T Kim H Murate T Miyajima A Oncostatin M and leukemia inhibitory factor do not use the same functional receptor in mice Blood 1997 90 165–73 10.1182/blood.V90.1.165 9207450 3 Walker EC McGregor NE Poulton IJ Solano M Pompolo S Fernandes TJ Oncostatin M promotes bone formation independently of resorption when signaling through leukemia inhibitory factor receptor in mice J Clin Invest 2010 120 582–92 10.1172/JCI40568 20051625 PMC2810087 4 Hermanns HM Oncostatin M and interleukin-31: Cytokines, receptors, signal transduction and physiology Cytokine Growth Factor Rev 2015 26 545–58 10.1016/j.cytogfr.2015.07.006 26198770 5 Bisht K McGirr C Lee S-Y Tseng H-W Fleming W Alexander KA Oncostatin M regulates hematopoietic stem cell (HSC) niches in the bone marrow to restrict HSC mobilization Leukemia 2022 36 333–47 10.1038/s41375-021-01413-z 34518644 6 Sims NA Lévesque J-P Oncostatin M: Dual regulator of the skeletal and hematopoietic systems Curr Osteoporos Rep 2024 22 80 95 10.1007/s11914-023-00837-z 38198032 PMC10912291 7 Houben E Hellings N Broux B Oncostatin M an underestimated player in the central nervous system Front Immunol 2019 10 1165 10.3389/fimmu.2019.01165 31191538 PMC6549448 8 Sampath SC Sampath SC Ho ATV Corbel SY Millstone JD Lamb J Induction of muscle stem cell quiescence by the secreted niche factor oncostatin M Nat Commun 2018 9 1531 10.1038/s41467-018-03876-8 29670077 PMC5906564 9 Jengelley DHA Wang M Narasimhan A Rupert JE Young AR Zhong X Exogenous oncostatin M induces cardiac dysfunction, musculoskeletal atrophy, and fibrosis Cytokine 2022 159 155972 10.1016/j.cyto.2022.155972 36054964 PMC10468097 10 Kubin T Pöling J Kostin S Gajawada P Hein S Rees W Oncostatin M is a major mediator of cardiomyocyte dedifferentiation and remodeling Cell Stem Cell 2011 9 420–32 10.1016/j.stem.2011.08.013 22056139 11 Headland SE Dengler HS Xu D Teng G Everett C Ratsimandresy RA Oncostatin M expression induced by bacterial triggers drives airway inflammatory and mucus secretion in severe asthma Sci Transl Med 2022 14 eabf8188 10.1126/scitranslmed.abf8188 35020406 12 Luo P Wang P-X Li Z-Z Zhang X-J Jiang X Gong J Hepatic oncostatin M receptor β regulates obesity-induced steatosis and insulin resistance Am J Pathol 2016 186 1278–92 10.1016/j.ajpath.2015.12.028 26976243 13 Foglia B Sutti S Pedicini D Cannito S Bocca C Maggiora M Oncostatin M, a profibrogenic mediator overexpressed in non-alcoholic fatty liver disease, stimulates migration of hepatic myofibroblasts Cells 2020 9 28 10.3390/cells9010028 31861914 PMC7017087 14 West NR Hegazy AN Owens BMJ Bullers SJ Linggi B Buonocore S Oncostatin M drives intestinal inflammation and predicts response to tumor necrosis factor-neutralizing therapy in patients with inflammatory bowel disease Nat Med 2017 23 579–89 10.1038/nm.4307 28368383 PMC5420447 15 Elks CM Zhao P Grant RW Hang H Bailey JL Burk DH Loss of oncostatin M signaling in adipocytes induces insulin resistance and adipose tissue inflammation in vivo J Biol Chem 2016 291 17066–76 10.1074/jbc.M116.739110 27325693 PMC5016111 16 Boniface K Diveu C Morel F Pedretti N Froger J Ravon E Oncostatin M secreted by skin infiltrating T lymphocytes is a potent keratinocyte activator involved in skin inflammation J Immunol 2007 178 4615–22 10.4049/jimmunol.178.7.4615 17372020 17 Wang ECE Dai Z Ferrante AW Drake CG Christiano AM A subset of TREM2 + Cell Stem Cell 2019 24 654 69.e6 10.1016/j.stem.2019.01.011 30930146 18 Garcia JP Utomo L Rudnik-Jansen I Du J Zuithoff NPA Krouwels A Association between oncostatin M expression and inflammatory phenotype in experimental arthritis models and osteoarthritis patients Cells 2021 10 508 10.3390/cells10030508 33673583 PMC7997294 19 Diveu C Venereau E Froger J Ravon E Grimaud L Rousseau F Molecular and functional characterization of a soluble form of oncostatin M/interleukin-31 shared receptor J Biol Chem 2006 281 36673–82 10.1074/jbc.M607005200 17028186 20 Reville PK Wang B Marvin-Peek J Yuan B Kuo Y-A Garza AI Blood-based proteomic profiling identifies OSMR as a novel biomarker of AML outcomes Blood 2025 145 3015–28 10.1182/blood.2024027244 40179376 PMC12226760 21 Tanaka M Hirabayashi Y Sekiguchi T Inoue T Katsuki M Miyajima A Targeted disruption of oncostatin M receptor results in altered hematopoiesis Blood 2003 102 3154–62 10.1182/blood-2003-02-0367 12855584 22 Minehata K Takeuchi M Hirabayashi Y Inoue T Donovan PJ Tanaka M Oncostatin M maintains the hematopoietic microenvironment and retains hematopoietic progenitors in the bone marrow Int J Hematol 2006 84 319–27 10.1532/ijh97.06090 17118758 23 Sato F Miyaoka Y Miyajima A Tanaka M Oncostatin M maintains the hematopoietic microenvironment in the bone marrow by modulating adipogenesis and osteogenesis PLoS One 2014 9 e116209 10.1371/journal.pone.0116209 25551451 PMC4281151 24 Garrigue A Kermasson L Susini S Fert I Mahony CB Sadek H Human oncostatin M deficiency underlies an inherited severe bone marrow failure syndrome J Clin Invest 2025 135 e180981 10.1172/jci180981 39847438 PMC11910226 25 Ding L Saunders TL Enikolopov G Morrison SJ Endothelial and perivascular cells maintain hematopoietic stem cells Nature 2012 481 457–62 10.1038/nature10783 22281595 PMC3270376 26 Winkler IG Barbier V Nowlan B Jacobsen RN Forristal CE Patton JT Vascular niche E-selectin regulates hematopoietic stem cell dormancy, self-renewal and chemoresistance Nat Med 2012 18 1651–7 10.1038/nm.2969 23086476 27 Himburg HA Termini CM Schlussel L Kan J Li M Zhao L Distinct bone marrow sources of pleiotrophin control hematopoietic stem cell maintenance and regeneration Cell Stem Cell 2018 23 370 81.e5 10.1016/j.stem.2018.07.003 30100167 PMC6482945 28 Itkin T Gur-Cohen S Spencer JA Schajnovitz A Ramasamy SK Kusumbe AP Distinct bone marrow blood vessels differentially regulate hematopoiesis Nature 2016 532 323–8 10.1038/nature17624 27074509 PMC6450701 29 Furuhashi K Kakiuchi M Ueda R Oda H Ummarino S Ebralidze AK Bone marrow niches orchestrate stem-cell hierarchy and immune tolerance Nature 2025 638 206–15 10.1038/s41586-024-08352-6 39743593 PMC11956426 30 Barbier V Erbani J Fiveash C Davies JM Tay J Tallack MR Endothelial E-selectin inhibition improves acute myeloid leukemia therapy by disrupting vascular niche-mediated chemoresistance Nat Commun 2020 11 2042 10.1038/s41467-020-15817-5 32341362 PMC7184728 31 Tang Z Li C Kang B Gao G Li C Zhang Z GEPIA: a web server for cancer and normal gene expression profiling and interactive analyses Nucleic Acids Res 2017 45 W98 W102 10.1093/nar/gkx247 28407145 PMC5570223 32 Tang Z Li C Kang B GEPIA Gene Expression Profiling and Interactive Analysis China Peking University 2025 http://gepia.cancer-pku.cn/detail.php?gene=osm 33 Yao L Setiadi H Xia L Laszik Z Taylor FB McEver RP Divergent inducible expression of P-selectin and E-selectin in mice and primates Blood 1999 94 3820–8 10.1182/blood.V94.11.3820 10572097 34 Hoermann G Cerny-Reiterer S Herrmann H Blatt K Bilban M Gisslinger H Identification of oncostatin M as a JAK2 V617F-dependent amplifier of cytokine production and bone marrow remodeling in myeloproliferative neoplasms FASEB J 2012 26 894 906 10.1096/fj.11-193078 22051730 35 Müller TA Grundler R Istvanffy R Rudelius M Hennighausen L Illert AL Lineage-specific STAT5 target gene activation in hematopoietic progenitor cells predicts the FLT3+-mediated leukemic phenotype Leukemia 2016 30 1725–33 10.1038/leu.2016.72 27046463 36 Schwaller J Parganas E Wang D Cain D Aster JC Williams IR Stat5 is essential for the myelo- and lymphoproliferative disease induced by TEL/JAK2 Mol Cell 2000 6 693 704 10.1016/S1097-2765(00)00067-8 11030348 37 Khatib-Massalha E Di Buduo CA Chédeville AL Ho Y-H Zhu Y Grockowiak E Defective neutrophil clearance in JAK2V617F myeloproliferative neoplasms drives myelofibrosis via immune checkpoint CD24 Blood 2025 146 717–31 10.1182/blood.2024027455 40373279 38 Koskela K Pelliniemi TT Rajamäki A Pulkki K Remes K Serum oncostatin M in multiple myeloma: impact on disease severity and prognosis Eur J Hematol 2000 65 52–6 10.1034/j.1600-0609.2000.90167.x 10914939 39 Krishnamurthy S Dong Z Vodopyanov D Imai A Helman JI Prince ME Endothelial cell-initiated signaling promotes the survival and self-renewal of cancer stem cells Cancer Res 2010 70 9969–78 10.1158/0008-5472.Can-10-1712 21098716 PMC3058885 40 Ayob AZ Ramasamy TS Cancer stem cells as key drivers of tumor progression J BioMed Sci 2018 25 20 10.1186/s12929-018-0426-4 29506506 PMC5838954 41 Melzer C von der Ohe J Lehnert H Ungefroren H Hass R Cancer stem cell niche models and contribution by mesenchymal stroma/stem cells Mol Cancer 2017 16 28 10.1186/s12943-017-0595-x 28148265 PMC5286787 42 Uhlén M Fagerberg L Hallström BM Lindskog C Oksvold P Mardinoglu A The Human Protein Atlas Sweden OSMR 2025 https://www.proteinatlas.org/ENSG00000145623-OSMR/single+cell 43 Natesh K Bhosale D Desai A Chandrika G Pujari R Jagtap J Oncostatin-M differentially regulates mesenchymal and proneural signature genes in gliomas via STAT3 signaling Neoplasia 2015 17 225–37 10.1016/j.neo.2015.01.001 25748242 PMC4351301 44 Sharanek A Burban A Laaper M Heckel E Joyal J-S Soleimani VD OSMR controls glioma stem cell respiration and confers resistance of glioblastoma to ionizing radiation Nat Commun 2020 11 4116 10.1038/s41467-020-17885-z 32807793 PMC7431428 45 Polak KL Tamagno I Parameswaran N Smigiel J Chan ER Yuan X Oncostatin-M and OSM-receptor feed-forward activation of MAPK induces separable stem-like and mesenchymal programs Mol Cancer Res 2023 21 975–90 10.1158/1541-7786.MCR-22-0715 37310811 PMC10527478 46 Yu Z Li Z Wang C Pan T Chang X Wang X Oncostatin M receptor, positively regulated by SP1, promotes gastric cancer growth and metastasis upon treatment with Oncostatin M Gastric Cancer 2019 22 955–66 10.1007/s10120-019-00934-y 30778797 47 Lee BY Hogg EKJ Below CR Kononov A Blanco-Gomez A Heider F Heterocellular OSM-OSMR signaling reprograms fibroblasts to promote pancreatic cancer growth and metastasis Nat Commun 2021 12 7336 10.1038/s41467-021-27607-8 34921158 PMC8683436 48 Wei S Chen Y Shi X Zuo L Zhang L OSM may serve as a biomarker of poor prognosis in clear cell renal cell carcinoma and promote tumor cell invasion and migration Int J Genomics 2023 2023 6665452 10.1155/2023/6665452 38034950 PMC10684322 49 Nguyen-Tran HH Nguyen TN Chen CY Hsu T Endothelial reprogramming stimulated by oncostatin M promotes inflammation and tumorigenesis in VHL-deficient kidney tissue Cancer Res 2021 81 5060–73 10.1158/0008-5472.Can-21-0345 34301760 PMC8974431 50 Gong Y Yan X Sun X Chen T Liu Y Cao J Oncostatin M is a prognostic biomarker and inflammatory mediator for sepsis J Infect Dis 2020 221 1989–98 10.1093/infdis/jiaa009 31930328 51 Salim SY AlMalki N Macala KF Wiedemeyer A Mueller TF Churchill TA Oncostatin M receptor type II knockout mitigates inflammation and improves survival from sepsis in mice Biomedicines 2023 11 483 10.3390/biomedicines11020483 36831019 PMC9953488 52 Setiadi H El-Banayosy AM Long JW Maybauer MO Mihu MR El Banayosy A Oncostatin M for characterizing the inflammatory burden and outcome of V-V ECMO in ARDS patients Artif Organs 2023 47 1885–92 10.1111/aor.14619 37476931 53 Shawky AM Almalki FA Abdalla AN Abdelazeem AH Gouda AM A comprehensive overview of globally approved JAK inhibitors Pharmaceutics 2022 14 1001 10.3390/pharmaceutics14051001 35631587 PMC9146299 54 Denton CP Del Galdo F Khanna D Vonk MC Chung L Johnson SR Biological and clinical insights from a randomized phase 2 study of an anti-oncostatin M monoclonal antibody in systemic sclerosis Rheumatol (Oxford) 2022 62 234–42 10.1093/rheumatology/keac300 35583273 PMC9788816 Glossary ACC adrenocortical carcinoma AML acute myeloblastic leukemia BLCA bladder urothelial carcinoma CESC cervical squamous cell carcinoma and endocervical adenocarcinoma CHOL cholangial carcinoma COAD colon adenocarcinoma DFS disease-free survival DLBC diffuse large B-cell lymphoma ESCA esophageal carcinoma FLT-3 Fms-like tyrosine-protein kinase-3 GBM glioblastoma multiform GEPIA Gene expression Profiling and Interactive Analysis GP130 glycoprotein-130 HNSC head and neck squamous cell carcinoma HSC hematopoietic stem cell HSPC hematopoietic stem and progenitor cell IL interleukin JAK Janus tyrosine-kinase KICH kidney chromophobe carcinoma KIRC kidney renal clear cell carcinoma KIRP kidney renal papillary cell carcinoma LAML acute myeloid leukemia LGG lower grade glioma LIHC hepatocellular carcinoma LUAD lung adenocarcinoma LUSC lung squamous cell carcinoma MESO mesothelioma MPN myeloproliferative neoplasm MSC mesenchymal stromal cell OS overall survival OSM oncostatin M OSMR oncostatin M receptor sOSMR soluble oncostatin M receptor protein OV ovarian serous cystadenocarcinoma PAAD pancreatic adenocarcinoma PCGP pheochromocytoma and paraganglioma PARD prostate adenocarcinoma READ rectum adenocarcinoma SARC sarcoma SKCM skin cutaneous melanoma STAD stomach adenocarcinoma STAT signal transducer and activator of transduction TCGA The Cancer Genome Atlas TGCT testicular germ cell tumor THCA thyroid carcinoma THYM thymoma UCEC uterine corpus endometrial carcinoma UCS uterine carcinosarcoma UVM uveal melanoma VHL von Hippel Lindau protein ",
  "metadata": {
    "Title of this paper": "Biological and clinical insights from a randomized phase 2 study of an anti-oncostatin M monoclonal antibody in systemic sclerosis",
    "Journal it was published in:": "Frontiers in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484008/"
  }
}