{
  "title": "Paper_1178",
  "abstract": "pmc Vaccines (Basel) Vaccines (Basel) 2764 vaccines vaccines Vaccines 2076-393X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474429 PMC12474429.1 12474429 12474429 41012181 10.3390/vaccines13090978 vaccines-13-00978 1 Review Recent Advancements in Non-Invasive Vaccination Strategies Gulani Mahek 1 Arte Tanisha 1 Ferguson Amarae 1 https://orcid.org/0009-0007-4780-9658 Pasupuleti Dedeepya 2 Adediran Emmanuel 1 Harsoda Yash 1 Nicolas McCommon Andrew 3 Gala Rikhav 4 D’Souza Martin J. 1 * Chentoufi Aziz Academic Editor 1 mahekanil.gulani@live.mercer.edu tanisha.manoj.arte@live.mercer.edu amarae.ferguson@live.mercer.edu emmanuel.adediran@live.mercer.edu yashkumar.pankajbhai.harsoda@live.mercer.edu 2 dpasupuleti@larkin.edu 3 andrew.nicolas.mccommon@live.mercer.edu 4 rikhav.gala@pfizer.com * dsouza_mj@mercer.edu 16 9 2025 9 2025 13 9 497676 978 07 8 2025 04 9 2025 11 9 2025 16 09 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Vaccines remain one of the most powerful tools in modern medicine, having revolutionized public health by preventing millions of deaths and controlling the spread of infectious diseases worldwide. However, conventional needle-based vaccines face several limitations, including pain and discomfort, the need for cold-chain infrastructure, reliance on trained healthcare personnel, risk of cross-contamination, and limited accessibility in low-resource settings. These challenges have spurred the development of non-invasive vaccination approaches that promise safer, more accessible, and patient-friendly immunization. Non-invasive immunizations not only eliminate the need for needles but may also enhance compliance and enable mucosal immune responses. To harness the full potential of these innovative delivery routes, a comprehensive understanding of their formulation strategies and mechanism of action is essential. This review aims to comprehensively discuss recent advancements in oral, intranasal, microneedle, buccal, sublingual, and vaginal vaccinations and highlight their underlying immunological mechanisms, formulation strategies in preclinical studies, examples of marketed products, and ongoing clinical trials. noninvasive vaccine vaccination microneedle vaccine intranasal vaccine sublingual vaccine vaginal vaccine immunization This review received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Many infectious diseases such as malaria, meningitis, diphtheria, hepatitis B, tetanus, polio, measles, mumps, and rubella, are now well managed in developed countries through vaccination programs and robust healthcare systems, there remains a critical need to enhance global healthcare systems as multiple infectious disease outbreaks worldwide such as respiratory tract infections, HIV/AIDS, malaria, tuberculosis, dengue, and Influenza, take place yearly. They account for more than fifty percent of overall mortality. Techniques are urgently required to develop specific protective vaccines, which are currently not available for some diseases. World Health Organization vaccination efforts have decreased death rates, but advances in vaccine administration and storage are still needed. Temperature fluctuations can damage vaccine vials, requiring them to be disposed [ 1 Vaccine delivery approaches can be categorized into invasive, minimally invasive, and non-invasive techniques. Traditional immunization predominantly employs invasive administration to ensure high bioavailability. Vaccination is now referred to as ‘getting one’s shot’ among people and is associated with pain and discomfort [ 2 3 1 Vaccine delivery in the current era is predominantly based on an invasive route of administration and has showed promising results when administered accurately. As a result of the above-mentioned limitations, the need for new vaccine options is increasing, leading to active research into minimally invasive and non-invasive vaccines as promising alternatives. This review focuses on latest advancements in the rapidly evolving field of non-invasive vaccines—oral, intranasal, microneedle, buccal, sublingual, and vaginal vaccinations—that have the potential to elevate immunization practices, aiming to shed light on the advantages, mechanism of action, and the currently approved vaccinations or in clinical trial stages. 2. Oral Vaccines 2.1. Early Development of Oral Vaccines Introduced in the 1960s, oral polio vaccine enabled large-scale immunization campaigns that significantly reduced global polio incidence. Traditional oral vaccines face several limitations such as antigen degradation in the harsh environment of the gastrointestinal tract including acidic pH and digestive enzymes which can degrade vaccine antigens before they reach immune-inductive sites, necessitating higher antigen doses for efficacy [ 4 5 6 7 8 2.2. The New Wave of Oral Vaccine Research 2.2.1. Nanoparticle and Microparticle Delivery Systems Nanoparticulate platforms work by encapsulating vaccine antigens within protective carriers, which shield them from the harsh acidic environment and digestive enzymes of the gastrointestinal tract. This protection ensures that antigens remain intact until they reach immune-inductive sites, thereby preserving their immunogenicity [ 9 Figure 1 A major advantage of these systems is their ability to facilitate targeted delivery. By engineering nanoparticles and microparticles to interact specifically with cells in the gut, such as M cells and dendritic cells, researchers can optimize the uptake of antigens and enhance both mucosal and systemic immune responses [ 10 11 12 13 14 12 2.2.2. Recombinant Microbial Vectors in Oral Vaccines Recombinant microbial vectors, including genetically engineered bacteria and yeast, are increasingly utilized as vehicles for oral vaccine delivery due to their inherent resistance to the gastrointestinal environment and capacity to induce robust immune responses. Among these, Bacillus subtilis 15 Lactic acid bacteria (LAB), such as Lactobacillus plantarum Lactococcus lactis 16 Yeast vectors, notably Saccharomyces cerevisiae Pichia pastoris 17 Bacillus subtilis L. plantarum L. lactis E. coli S. cerevisiae P. pastoris Bacillus subtilis 18 B. subtilis E. coli 19 20 B. subtilis E. coli 21 Lactococcus lactis Lactobacillus casei E. coli L. lactis Lactiplantibacillus plantarum 22 23 L. plantarum Borrelia burgdorferi Saccharomyces cerevisiae 24 25 2.2.3. Mucoadhesive and Mucus-Penetrating Formulations in Oral Vaccine Delivery Mucoadhesive and mucus-penetrating formulations are designed to address the key challenge of ensuring that vaccine antigens remain at mucosal surfaces long enough to be effectively absorbed and presented to the immune system. Mucoadhesive delivery systems leverage materials such as chitosan, alginate, carbopol, gelatin, and other natural or synthetic polymers that can adhere to the mucus layer lining the oral, buccal, or intestinal mucosa. This adhesion prolongs the retention of antigens at their site of administration, increases the chances of uptake by mucosal immune cells like M cells and dendritic cells, and protects the antigens from both rapid mucosal turnover and enzymatic degradation. The result is sustained antigen release and a greater opportunity for immune activation [ 26 27 Figure 2 In addition to mucoadhesion, newer mucus-penetrating technologies are being developed to allow vaccine carriers to traverse the thick mucus barrier and reach immune-inductive tissues beneath, such as the epithelial layer of the gut or oral mucosa. These formulations often utilize nanoparticles, surface modifications like PEGylation, or specialized coatings that reduce binding to mucin fibers, enabling deeper diffusion through the mucus network. This approach enhances delivery directly to key immune cells for more robust immune responses [ 28 Innovations in this area include thermoresponsive gels, microneedle systems for oral mucosa, composite films and particles, and materials that respond to local environmental cues for optimal release and targeting [ 29 30 31 32 33 34 34 2.2.4. Bacterium-like Particles (BLPs) and Lipid-Coated Systems in Oral Vaccines Bacterium-like particles (BLPs) are non-living, hollow peptidoglycan skeletons derived from lactic acid bacteria, created by removing proteins and nucleic acids through heat and acid treatment [ 35 35 36 Despite these advantages, the harsh gastrointestinal environment, characterized by acidic pH and digestive enzymes, can degrade surface-displayed antigens, thereby reducing vaccine efficacy [ 37 35 The impact of these innovations is evident in preclinical studies, where a single oral immunization with lipid-coated BLP vaccines has induced rapid, strong, and cross-protective immunity, with up to 100% protection in animal challenge models [ 35 38 2.2.5. Plant-Based Oral Vaccines Plant-based oral vaccines utilize genetically engineered plants to produce vaccine antigens, which are then delivered by consuming the edible parts of the plant, such as leaves, fruits, or seeds [ 39 40 39 41 E. coli 42 43 44 45 35 3. Inhalation Vaccines 3.1. Intranasal Vaccines The first intranasal vaccine formulated against influenza and licensed in 2003 and approved in the USA market is the Flumist. It is a live attenuated influenza vaccine (LAIV) which has quadrivalent influenza virus subtypes A and B strains, approved for ages 2 to 49. Fluenz is the marketed name of the similar composition of the vaccine that is approved in the European market [ 46 47 Intranasal delivery is a patient-friendly route causing minimal discomfort to children, elderly, and people with needle phobia. In addition, self-administration is possible with this route and that leads to easy vaccination and faster immunization for a large population, especially in the case of a pandemic. By targeting the highly vascularized and immunologically active nasal mucosa, this non-invasive approach enables rapid systemic absorption and efficient stimulation of mucosal immunity [ 48 49 3.1.1. Mechanism of Action of Intranasal Administration Mucosal sites are major attractions for respiratory viruses, causing the spread of the infection [ 50 50 51 Figure 3 52 53 54 + 55 3.1.2. Limitations and Advancements in the Field Singh et al. recently developed a combination intranasal vaccine for COVID-19 and influenza using AddaVax as the adjuvant, which elicited significantly higher mucosal IgA responses compared to the conventional intramuscular route [ 56 57 58 59 57 60 3.2. Oral Inhalation Pulmonary delivery directly targets the infection portal, offering faster and more effective first-line defense. Moreover, it elicits both innate and adaptive immune responses at the site of infection. Delivering vaccines directly to the lungs mirrors the natural infection route for many respiratory pathogens. This stimulates strong local mucosal immune responses (particularly secretory IgA and tissue-resident memory T cells) in the respiratory tract, where the pathogen first invades, enhancing protection and reducing viral transmission. Over the past decade, pulmonary vaccine delivery devices have advanced markedly to overcome the complex anatomical and physiological barriers of the respiratory tract, aiming to efficiently deposit antigens in the desired mucosal regions to induce robust local and systemic immunity. Device platforms used are nebulizers, dry powder inhalers, Metered Dose Inhalers (MDIs), and nanocarrier-enhanced delivery systems [ 50 61 Nebulizers generate aerosols from liquid vaccine formulations, tailored to reach deep lung tissues, facilitating antigen uptake by dendritic cells and induction of mucosal immune responses. Advances focus on optimized particle size (1–5 µm) for maximal deposition in the lower respiratory tract and improved stability of fragile vaccines including mRNA and protein subunits during nebulization. Modern vibrating mesh nebulizers cause less shear stress, preserving antigen integrity better than traditional jet nebulizers. Several SARS-CoV-2 inhaled vaccines under clinical investigation utilize nebulizer-based delivery to promote mucosal sIgA and tissue-resident memory T cells in both upper and lower airways [ 62 63 3.2.1. Mechanism Pulmonary delivery of vaccines occurs in the deep lungs especially in the lower airways of the respiratory region. Epithelial lining of the lymphatic tissue present in the lung’s bronchiole airway comprises immune cells in luminal and basal sides known as Bronchus-associated lymphoid tissue (BALT) [ 63 64 65 66 3.2.2. Limitations of Inhalation Route Vaccine antigens can be significantly degraded or denatured by environmental stresses during manufacturing, aerosolization, storage, and delivery, leading to reduced efficacy. Moreover, mucociliary clearance and enzymatic degradation destroys the antigen before it is captured by antigen-presenting cells (APCs), limiting the immune response. Particle size, shape, and formulation influence whether the vaccine reliably reaches the desired lung regions deep lung or upper airways. There is a need for precise engineering to ensure the vaccine reaches its target site without aggregating or being lost in the device or upper airways [ 67 68 69 61 4. Microneedles Vaccine Delivery Microneedle (MNS) are regarded as a transdermal medication delivery method that is minimally intrusive and painless to administer as it penetrates the stratum corneum. This is due to MNs’ ability to penetrate the skin without reaching the pain-producing nerve ends. MNs comprises a set of tiny needle-like projections, usually between 25 and 2000 μm in length, fabricated from materials like polymers, or alternative substances, and fixed onto a supporting base. These microneedles are engineered to reach skin regions rich in immune cells. Additionally, they can be independently administered, thereby fewer skilled healthcare workers are required, and there is no longer a chance of unintentional needle injuries or the requirement for proper needle disposal [ 70 71 Ideal MN design requires reduced force while inserting and increased fracture force. Various factors influencing the efficacy of microneedles include the geometry of MN which impacts patient compliance, penetration effectiveness, and mechanical force. The sharpness influences the entry force of the MN while the tip diameter influences the depth of MN insertion. On the contrary, the sharpness decreases the mechanical robustness of the MN, causing it to crack. Studies show that sharp MN (less than 15 µm) are crucial for effective vaccines delivery. Since the blood vessels are in the dermis layer, the MN length needs to be long enough to reach the dermis to deliver the vaccine agent. In the case of shorter MN, there will be loss of therapeutic agent on the surface of the skin. However, very long MNs will induce the nerves which stimulate pain. To penetrate the stratum corneum and create microchannels, optimal force is required to accomplish targeted vaccine delivery. Studies showed that a force of around 20 mN was enough for optimal MN administration. Since manual applications may vary across individuals, an MN applicator is needed. Adding more needles in a closely spaced array enables increased drug loading, raising the quantity of microchannels that the vaccination can diffuse through. In this case, the total application force is distributed and shared across all the needles, which signifies that the insertion requires more pressure. This can be surpassed by the use of various lengths in the same array [ 71 4.1. Mechanism of Action of Microneedles One of the body’s important immune defense barriers is the integumentary system which offers both innate and acquired immunity. This structure consists of the most external stratum corneum, succeeded by the epidermis, dermis, and hypodermis. These layers comprise macrophages, keratinocytes, Langerhans cells (LCs), dendritic cells (DCs), and T cells. Keratinocytes recognize antigens through pattern-recognition receptors which lead to secretion of cytokines and chemokines. The LCs and DCs perform as antigen-presenting cells which collect the antigen and then present it to the T cells. Patrizia et al. showed that LCs were able to cross present antigen to CD8 + 72 + + 4.2. Evolution of MN Technology in Vaccines In 2002, the first study of solid MN vaccination was conducted by Mikszta et al. who used a micro-enhanced array to puncture the skin and achieve localized in vivo delivery of the vaccine marking the initial demonstration. This technology was found to decrease the number of vaccinations and generate more robust and consistent immune responses than needle-based injections. By using this technique, the vaccinations can efficiently enter the dermis, minimizing skin irritation and removing pain and discomfort [ 73 74 75 76 77 78 4.3. Solid Microneedles Innovative research discovered solid microneedles as the first model of transcutaneous delivery systems, including metallic, silicon-based, and non-biodegradable polymeric MNs. They function through ‘poke and patch’ approach, according to which microchannels are first formed, subsequently immunogenic agents are topically applied to the area of microchannel formation through which they pass through into the dermis ( Figure 4 78 4.4. Hollow Microneedles The principle is based on pressure gradient flow or passive diffusion. This hollow configuration allows the delivery of considerably increased quantities of vaccine agents as they can hold few hundred microliters with improved flow in relation to other microneedle types. They can be made of metal, silicon, glass, or ceramics material. However, they are complicated to develop because of their framework and delicacy. In a study using ovalbumin as model antigen, in vitro skin permeation studies using Franz cell showed that hollow MNs had a stronger effect on skin permeation in contrast with solid MN and electroporation techniques. When the hollow MNs were utilized for the delivery of ovalbumin in vivo using mice model, they produced enhanced IgG immune response compared to subcutaneous injections. Hollow MNs immunization did not trigger symptoms of dermal infection or localized bleeding [ 79 80 In a study by Zuo et al., rats were immunized with poliovirus vaccine combined with diphtheria–tetanus–acellular pertussis vaccine intradermally with hollow MN devices, namely MicronJet600, and the therapeutic effectiveness was analyzed and compared with intramuscular immunization. The humoral response of the combination vaccine delivered with MicronJet600 demonstrated that hollow MN approach had a dose-sparing effect which led to a more robust protection when the rats were infected with B pertussis. The hollow MN delivery proved to be a superior option compared to intramuscular immunization [ 81 82 4.5. Coated Microneedles Coated MNs are solid MNs which are coated with a vaccine solution or dispersion by spray coating or dip coating, in which the MNs are immersed into the coating solution. Its usage limitation is due to restricted surface area for vaccine uptake. To overcome this, optimization of array dimensions by elevating needle density, or the application of gradual step-wise layer coating can be applied. In a study, Kim et al. optimized a formulation for MNs coated with influenza vaccine which were further administered transdermally to immunize mice. Coated MN immunization elicited strong systemic and functional antibody response and conferred full protection against fatal challenge infection equivalent to standard intramuscular injection. They concluded that antigen activity degradation during coating process can be avoided through optimized and strategic formulation [ 83 84 85 4.6. Dissolving Microneedles Dissolving microneedles highlight improvements over other MNs by easier development and one-step administration. Dissolving MNs are fabricated using hydrophilic biodegradable polymers and function through pierce and release mechanism and gradually dissolve in the dermal layers post-penetration, leading to sustained release of vaccine followed by systemic absorption. In formulation of these systems, the liquid solutions of vaccines solidify in a controlled manner inside the molds. Reconstitution of therapeutic agents in a hyaluronic acid–trehalose gel, followed by spin-casting to fabricate dissolving microneedles, has been extensively investigated by Dsouza and colleagues for vaccines targeting Zika virus, SARS-CoV-2, gonorrhea, and influenza. The dissolving microneedle-based vaccination induced antibody responses that were equivalent to or exceeded those elicited by the conventional intramuscular route [ 85 86 87 88 88 4.7. Hydrogel/Swelling Microneedles Hydrogel microneedles are made up using cross-linked hydrogels or high-swelling polymeric structure. They serve two roles: enabling vaccine delivery through regulated swelling process and facilitating diagnostic functions through selectively absorbing interstitial fluid from the skin. Vaccine agents can be loaded into hydrogel microneedles via two distinct approaches: First, vaccine incorporation at the base of MN and administration promotes hydrogel swelling by interstitial fluid uptake, creating pathways to the vaccine reservoir. Unlike dissolving MNs, these MNs allow removal with no residual polymer deposition in skin. The second approach incorporates vaccine and polymer mixing across the entire MN structure, achieving release of vaccine via swelling triggered by fluids. In a study by Courtenay et al., the hydrogel-forming MNs were compared with dissolving MNs using protein antigen ovalbumin. The mice vaccinated with dissolving MNs had significantly higher antibody titers than hydrogel MNs [ 89 5. Buccal Route of Administration Among non-invasive immunizations, buccal administration, which targets the inner cheek mucosa, has emerged as a promising approach [ 90 91 29 92 93 Notably, vaccines administered via the buccal route can stimulate the common mucosal immune system, leading to the production of both secretory IgA at mucosal surfaces and systemic IgG antibodies. This dual activation enhances immune protection not only at the site of administration but also at distal mucosal sites, such as the respiratory and gastrointestinal tracts. The trafficking of activated dendritic cells and IgA-secreting plasma blasts from the buccal mucosa to secondary lymphoid organs facilitates broad and durable immune responses [ 90 93 5.1. Mechanistic Insights into Buccal Vaccine Delivery The immunological mechanism underlying buccal vaccine delivery involves the efficient uptake and presentation of antigens by specialized mucosal immune cells [ 94 94 95 Figure 5 The formulation of buccal vaccines also significantly influences their mechanism of action and immunogenicity. In conventional suspension forms, antigen absorption occurs via direct diffusion across the mucosal epithelium. Lipophilic molecules favor transcellular uptake, whereas hydrophilic, low-molecular-weight compounds traverse the paracellular route. Once internalized, antigens are processed by resident dendritic cells and transported to regional lymph nodes, initiating IgA- and IgG-mediated responses [ 93 96 92 94 5.2. Current Research and Development Early studies that contributed majorly to the advancements include Cui and Mumper (2002) [ 97 A recent study [ 98 Esih et al. (2024) [ 99 The study published in Vaccines (2024) [ 100 ® + + 101 Gala et al. reported another advancement in vaccine delivery through the buccal route [ 93 6. Sublingual Vaccination In sublingual delivery, the vaccines are administered beneath the tongue utilizing highly vascularized sublingual mucosa for antigen delivery [ 102 103 104 The sublingual region, with its non-keratinized stratified epithelium, exhibits greater permeability characteristics compared to other intraoral routes. This layer, providing more elastic and permeable tissue than the keratinized surfaces of the hard palate, facilitates rapid drug absorption [ 105 104 106 107 108 6.1. Mechanism of Sublingual Immunization Sublingual vaccination utilizes the distinctive immune features of the oral mucosa to stimulate both systemic and mucosal immune responses ( Figure 6 + + 109 110 111 112 6.2. Sublingual Tablets Sublingual tablets are advanced pharmaceutical forms designed for placing under the tongue. They quickly dissolve to enable direct absorption of the drug through the highly vascularized sublingual mucosa. A clinical example of sublingual vaccine technology is MV140 (Uromune ® 113 6.3. Patch-Based Systems Mucoadhesive patch systems employ layer-by-layer (LbL) assembly of polysaccharides like chitosan and hyaluronic acid. This approach improves the retention time at the sublingual area and shields vaccine components from salivary dilution and enzymatic breakdown. The LbL mucoadhesive patches demonstrate sophisticated engineering approaches towards advancing sublingual vaccination [ 114 Advanced patch designs feature Viscosan (VIS), a modified form of chitosan that breaks down more rapidly in saliva. However, research suggests that this quick degradation might reduce the effectiveness of nanoparticle delivery compared to traditional chitosan formulations. The findings emphasize the importance of adjusting the degradation rate of the patch to improve its contact time with mucosal tissues [ 114 115 7. Vaginal Vaccines Sexually transmitted diseases (STIs) such as herpes simplex virus (HSV), bacterial vaginosis (BV), and trichomoniasis continue to be a global contributor to illnesses, such as neurological and cardiovascular disease [ 116 117 7.1. Mechanism of Action The vaginal mucosa provides a constant, multi-layered defense that includes physical, microbial, innate, and adaptive barriers. The vaginal epithelium comprises a stratified squamous epithelium that rests on a bed of stromal cells ( Figure 7 − + − + 118 + + 118 7.2. History and Current Field of Vaginal Vaccines It was long believed that the vagina was an ineffective route to deliver vaccines because of its weak immunogenic environment for adaptive immunity. However, in recent times, vaginal vaccination has been tested against numerous STIs and has shown its success in establishing populations of effector lymphocytes in the cervicovaginal mucosa [ 117 119 7.3. Limitations and Advancements The fluctuating pH, high enzymatic activity, and consistent mucus turnover make antigens prone to rapid degradation. This limits immune activation and requires consistent or high doses to be effective [ 120 121 122 7.4. Mucoadhesive and Thermoresponsive Gels Mucoadhesive and thermoresponsive gels were designed to address issues regarding the limited immune response of phosphate-buffered saline (PBS)-based vaccine vehicles. By using gels, challenges regarding clearance, degradation of antigen, and limited contact with mucosal surfaces were alleviated. Han et al. used poloxamers (Pol) as the primary polymer due to their high solubility, exceptional compatibility, and thermogelling properties. Poloxamers are inserted as a liquid and form a gel at the administration site. This protects the antigen from enzymatic degradation and allows it to be retained longer, thereby increasing immune activation. Mucoadhesive agents, such as polyethylene oxide (PEO) or polycarbophil (PC), can then be combined with the poloxamer-based polymer, allowing for improved vaginal residence and antigen–mucosal tissue interactions. The Pol/PEO or Pol/PC systems positively displayed enhanced mucosal and systemic immune responses to antigens such as HPV 16 L1 VLP and HbsAG [ 123 10 124 125 7.5. Mucus-Penetrating Vaccines Mucus-penetrating nonviral gene vaccines might also alleviate the hindrances of standard vectors by passing through the layer of protective mucus hydrogel and the closely junctioned epithelial cells. Bi et al. created two < 200 nm lipopeptide-based carriers. The first system, DRRS, contained a charge reversal property to mimic viruses that are able to infect many different cell hosts. The second system, HA/RLS, had an HA coating which would allow it to directly target DCs. When DRLS meets the vagina’s acidic environment (pH 4), the DMMA cap is hydrolyzed, causing DRLS to lose its protective coat and exposing its positive charges. These positive charges enable it to stick to the epithelial cells, in turn allowing for the expression of HPV16 L1 antigens to DCs. Unlike unmodified RLS, both DRLS and HA/RLS gene complexes showed a rapid diffusion through mucus, about 40–50× faster than that of RLS. In vivo, acid-activated pseudo-DRLS, carrying EGFP or HPV16 L1 DNA, generated greater than double fluorescent intensity in excised reproductive tracts compared to PEI, and far more than HA/RLS, demonstrating widespread expression in the epithelium [ 126 + + + + 126 7.6. Intravaginal Rings IVRs have long been used as an effective method for delivering drugs to the female reproductive tract, particularly for HIV prevention and contraception. These rings allow controlled drug diffusion, reducing the need for frequent dosing. IVRs are also coitally independent, further enhancing user convenience and integration into daily life [ 126 One of the biggest challenges when it comes to IVRs is the application of this technology to the release of macromolecules (such as protein antigens). This issue is due to the thermal instability of proteins when subjected to the processing conditions needed in order to manufacture the rings. However, recent innovations have allowed rings to carry macromolecules. By embedding freeze-dried rods of hydroxypropyl methylcellulose (HPMC) containing recombinant protein antigens (and, as appropriate, TLR7/8 agonist adjuvant) in a silicone body cured at room temperature, protein integrity is maintained. These inserts consistently release >99% of antigen within 24 h in physiological buffer and simulated vaginal fluid, achieving a sustained burst of antigen at the mucosal surface [ 127 On-Going Clinical Trials Table 1 ® Oral plant-based platforms have also reached late-stage development; for instance, the Nicotiana-derived VLP vaccine Covifenz successfully completed Phase 3 trials against COVID-19, and MucoRice-CTB showed strong mucosal IgA induction in early clinical testing for cholera. Microneedle array patches are progressing rapidly, with Phase 1–3 trials for hepatitis B, measles–rubella, influenza, rotavirus, and polio reporting immunogenicity comparable or superior to traditional intramuscular vaccination, with added benefits of needle-free delivery, dose sparing, and improved acceptability. Other platforms remain in earlier stages: sublingual vaccines for COVID-19, influenza, and ETEC, as well as intravaginal vaccines for recurrent UTIs, vulvovaginal candidiasis, and HIV-1 have demonstrated promising induction of localized mucosal antibodies together with systemic responses in Phase 1–2 trials. Collectively, these data emphasize that non-invasive vaccines are not confined to conceptual or exploratory phases but are advancing toward clinical translation, with several already demonstrating measurable protection in humans. 8. Conclusions The era of needle-free vaccination is rapidly approaching, driven by the convergence of immunology and patient-centric design. Non-invasive delivery routes spanning oral, intranasal, transdermal microneedles, buccal, and sublingual pathways are no longer conceptual novelties but viable platforms with growing preclinical and clinical evidence. Some challenges include mucosal surfaces being naturally inclined to foster tolerance, due to their constant exposure to non-harmful substances. This can result in weaker immune responses. Achieving sufficiently strong, long-lasting immunity often requires multiple doses and optimized antigen/adjuvant delivery strategies [ 157 158 159 160 161 162 Disclaimer/Publisher’s Note: Author Contributions M.G.: conceptualization, supervision, writing—original draft preparation, writing—review and editing, literature search. T.A.: conceptualization, writing—original draft preparation, writing—review and editing, literature search. A.F.: writing—original draft preparation, writing—review and editing, literature search. D.P.: writing—original draft preparation, writing—review and editing, literature search. E.A.: writing—original draft preparation, writing—review and editing, literature search. Y.H.: writing—original draft preparation, writing—review and editing, literature search. A.N.M.: writing—original draft preparation, literature search. R.G.: writing—review and editing, literature search. M.J.D.: writing—review and editing, conceptualization, supervision. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest Author Rikhav Gala was employed by the company Pfizer Inc. The remaining authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. References 1. Zheng Z. Diaz-Arévalo D. Guan H. Zeng M. Noninvasive Vaccination against Infectious Diseases Hum. Vaccines Immunother. 2018 14 1717 1733 10.1080/21645515.2018.1461296 29624470 PMC6067898 2. Giudice E. Campbell J. Needle-Free Vaccine Delivery☆ Adv. Drug Deliv. Rev. 2006 58 68 89 10.1016/j.addr.2005.12.003 16564111 3. Li M. Wang Y. Sun Y. Cui H. Zhu S.J. Qiu H.-J. Mucosal Vaccines: Strategies and Challenges Immunol. Lett. 2020 217 116 125 10.1016/j.imlet.2019.10.013 31669546 4. Van Der Weken H. Jahantigh H.R. Cox E. Devriendt B. Targeted Delivery of Oral Vaccine Antigens to Aminopeptidase N Protects Pigs against Pathogenic E. coli Front. Immunol. 2023 14 1192715 10.3389/fimmu.2023.1192715 37457692 PMC10338862 5. Vela Ramirez J.E. Sharpe L.A. Peppas N.A. Current State and Challenges in Developing Oral Vaccines Adv. Drug Deliv. Rev. 2017 114 116 131 10.1016/j.addr.2017.04.008 28438674 PMC6132247 6. Kim L. Martinez C.J. Hodgson K.A. Trager G.R. Brandl J.R. Sandefer E.P. Doll W.J. Liebowitz D. Tucker S.N. Systemic and Mucosal Immune Responses Following Oral Adenoviral Delivery of Influenza Vaccine to the Human Intestine by Radio Controlled Capsule Sci. Rep. 2016 6 37295 10.1038/srep37295 27881837 PMC5121599 7. Chowdhury F. Bhuiyan T.R. Akter A. Bhuiyan M.S. Khan A.I. Tauheed I. Ahmed T. Ferdous J. Dash P. Basher S.R. Augmented Immune Responses to a Booster Dose of Oral Cholera Vaccine in Bangladeshi Children Less than 5 Years of Age: Revaccination after an Interval of over Three Years of Primary Vaccination with a Single Dose of Vaccine Vaccine 2020 38 1753 1761 10.1016/j.vaccine.2019.12.034 31879124 PMC7014297 8. Malembaka E.B. Bugeme P.M. Hutchins C. Xu H. Hulse J.D. Demby M.N. Gallandat K. Saidi J.M. Rumedeka B.B. Itongwa M. Effectiveness of One Dose of Killed Oral Cholera Vaccine in an Endemic Community in the Democratic Republic of the Congo: A Matched Case-Control Study Lancet Infect. Dis. 2024 24 514 522 10.1016/S1473-3099(23)00742-9 38246191 PMC11043051 9. Marasini N. Skwarczynski M. Toth I. Oral Delivery of Nanoparticle-Based Vaccines Expert Rev. Vaccines 2014 13 1361 1376 10.1586/14760584.2014.936852 25155636 10. Diaz-Arévalo D. Zeng M. Nanoparticle-Based Vaccines: Opportunities and limitations Nanopharmaceuticals Elsevier Amsterdam, The Netherlands 2020 135 150 978-0-12-817778-5 11. Borges O. Lebre F. Bento D. Borchard G. Junginger H.E. Mucosal Vaccines: Recent Progress in Understanding the Natural Barriers Pharm. Res. 2010 27 211 223 10.1007/s11095-009-0011-3 19953309 12. Li M. Kaminskas L.M. Marasini N. Recent Advances in Nano/Microparticle-Based Oral Vaccines J. Pharm. Investig. 2021 51 425 438 10.1007/s40005-021-00537-9 PMC8196935 34150345 13. Prabhakar P.K. Khurana N. Vyas M. Sharma V. Batiha G.E.-S. Kaur H. Singh J. Kumar D. Sharma N. Kaushik A. Aspects of Nanotechnology for COVID-19 Vaccine Development and Its Delivery Applications Pharmaceutics 2023 15 451 10.3390/pharmaceutics15020451 36839773 PMC9960567 14. Bhowmik T. D’Souza B. Uddin M.N. D’Souza M.J. Oral Delivery of Microparticles Containing Plasmid DNA Encoding Hepatitis-B Surface Antigen J. Drug Target. 2012 20 364 371 10.3109/1061186X.2012.662686 22339323 15. Lv P. Song Y. Liu C. Yu L. Shang Y. Tang H. Sun S. Wang F. Application of Bacillus subtilis J. Vet. Med. Sci. 2020 82 1693 1699 10.1292/jvms.20-0363 33071249 PMC7719876 16. Bermúdez-Humarán L.G. Langella P. Use of lactic acid bacteria as mucosal vaccines Rev. Francoph. Lab. 2009 2009 79 89 10.1016/S1773-035X(09)70312-0 32518601 PMC7270964 17. Kumar R. Kumar P. Yeast-Based Vaccines: New Perspective in Vaccine Development and Application FEMS Yeast Res. 2019 19 foz007 10.1093/femsyr/foz007 30668686 18. Amuguni H. Lee S. Kerstein K. Brown D. Belitsky B. Herrmann J. Keusch G. Sonenshein A. Tzipori S. Sublingual Immunization with an Engineered Bacillus subtilis Microbes Infect. 2012 14 447 456 10.1016/j.micinf.2011.12.001 22198093 19. Zhang Y. Mo R. Sun S. Cui Z. Liang B. Li E. Wang T. Feng Y. Yang S. Yan F. Bacillus subtilis Front. Microbiol. 2023 14 1126533 10.3389/fmicb.2023.1126533 36846792 PMC9948087 20. Lee S. Belitsky B.R. Brinker J.P. Kerstein K.O. Brown D.W. Clements J.D. Keusch G.T. Tzipori S. Sonenshein A.L. Herrmann J.E. Development of a Bacillus subtilis Clin. Vaccine Immunol. 2010 17 1647 1655 10.1128/CVI.00135-10 20810679 PMC2976104 21. Yu J. Fu J. Liu H. Kang C. Wang Z. Jin Y. Wu S. Li T. Yang R. Jin M. Application of Recombinant Lactic Acid Bacteria (LAB) Live Vector Oral Vaccine in the Prevention of F4+ Enterotoxigenic Escherichia coli Vaccines 2024 12 304 10.3390/vaccines12030304 38543938 PMC10974401 22. Li L. Hao J. Jiang Y. Hao P. Gao Y. Chen J. Zhang G. Jin N. Wang M. Li C. A Micro-Sized Vaccine Based on Recombinant Lactiplantibacillus plantarum Acta Pharm. Sin. B 2023 13 3168 3176 10.1016/j.apsb.2023.01.005 36852097 PMC9946889 23. Del Rio B. Dattwyler R.J. Aroso M. Neves V. Meirelles L. Seegers J.F.M.L. Gomes-Solecki M. Oral Immunization with Recombinant Lactobacillus plantarum Clin. Vaccine Immunol. 2008 15 1429 1435 10.1128/CVI.00169-08 18632920 PMC2546682 24. King T.H. Kemmler C.B. Guo Z. Mann D. Lu Y. Coeshott C. Gehring A.J. Bertoletti A. Ho Z.Z. Delaney W. A Whole Recombinant Yeast-Based Therapeutic Vaccine Elicits HBV X, S and Core Specific T Cells in Mice and Activates Human T Cells Recognizing Epitopes Linked to Viral Clearance PLoS ONE 2014 9 e101904 10.1371/journal.pone.0101904 25051027 PMC4106793 25. Lei H. Xie B. Gao T. Cen Q. Ren Y. Yeast Display Platform Technology to Prepare Oral Vaccine against Lethal H7N9 Virus Challenge in Mice Microb. Cell Fact. 2020 19 53 10.1186/s12934-020-01316-1 32122351 PMC7053147 26. Rhee J.H. Current and New Approaches for Mucosal Vaccine Delivery Mucosal Vaccines Elsevier Amsterdam, The Netherlands 2020 325 356 978-0-12-811924-2 27. Garg N.K. Mangal S. Khambete H. Sharma P.K. Tyagi R.K. Mucosal Delivery of Vaccines: Role of Mucoadhesive/Biodegradable Polymers Recent Pat. Drug Deliv. Formul. 2010 4 114 128 10.2174/187221110791185015 20380624 28. Lai S.K. Wang Y.-Y. Hanes J. Mucus-Penetrating Nanoparticles for Drug and Gene Delivery to Mucosal Tissues Adv. Drug Deliv. Rev. 2009 61 158 171 10.1016/j.addr.2008.11.002 19133304 PMC2667119 29. Mokabari K. Iriti M. Varoni E.M. Mucoadhesive Vaccine Delivery Systems for the Oral Mucosa J. Dent. Res. 2023 102 709 718 10.1177/00220345231164111 37148290 30. Amin M.K. Boateng J.S. Enhancing Stability and Mucoadhesive Properties of Chitosan Nanoparticles by Surface Modification with Sodium Alginate and Polyethylene Glycol for Potential Oral Mucosa Vaccine Delivery Mar. Drugs 2022 20 156 10.3390/md20030156 35323455 PMC8953124 31. Anggraeni R. Ana I.D. Wihadmadyatami H. Development of Mucosal Vaccine Delivery: An Overview on the Mucosal Vaccines and Their Adjuvants Clin. Exp. Vaccine Res. 2022 11 235 10.7774/cevr.2022.11.3.235 36451668 PMC9691869 32. Paul S. Bhuyan S. Balasoupramanien D.D. Palaniappan A. Muco-Adhesive and Muco-Penetrative Formulations for the Oral Delivery of Insulin ACS Omega 2024 9 24121 24141 10.1021/acsomega.3c10305 38882129 PMC11170654 33. Zhao K. Xie Y. Lin X. Xu W. The Mucoadhesive Nanoparticle-Based Delivery System in the Development of Mucosal Vaccines Int. J. Nanomed. 2022 17 4579 4598 10.2147/IJN.S359118 36199476 PMC9527817 34. Russell-Jones G.J. Oral Vaccine Delivery J. Control. Release 2000 65 49 54 10.1016/S0168-3659(99)00231-X 10699269 35. De X. Gao M. Jia Z. Ren H. Liu R. Zhou X. Guo J. Wang J. Yu Q. Qu N. A Novel Oral Vaccine Delivery System for Enhancing Stability and Immune Protection: Bacterium-like Particle with Functional Coating Front. Microbiol. 2024 15 1481514 10.3389/fmicb.2024.1481514 39539708 PMC11557395 36. Akalkotkar A. Chablani L. Tawde S.A. D’Souza C. D’Souza M.J. Development of a Microparticulate Prostate Cancer Vaccine and Evaluating the Effect of Route of Administration on Its Efficacy via the Skin J. Microencapsul. 2015 32 281 289 10.3109/02652048.2015.1017615 25985824 37. Kang S.H. Hong S.J. Lee Y.-K. Cho S. Oral Vaccine Delivery for Intestinal Immunity—Biological Basis, Barriers, Delivery System, and M Cell Targeting Polymers 2018 10 948 10.3390/polym10090948 30960873 PMC6403562 38. Van Braeckel-Budimir N. Haijema B.J. Leenhouts K. Bacterium-like Particles for Efficient Immune Stimulation of Existing Vaccines and New Subunit Vaccines in Mucosal Applications Front. Immunol. 2013 4 282 10.3389/fimmu.2013.00282 24062748 PMC3775300 39. Chan H. Daniell H. Plant-made Oral Vaccines against Human Infectious Diseases—Are We There Yet? Plant Biotechnol. J. 2015 13 1056 1070 10.1111/pbi.12471 26387509 PMC4769796 40. Kwon K.-C. Verma D. Singh N.D. Herzog R. Daniell H. Oral Delivery of Human Biopharmaceuticals, Autoantigens and Vaccine Antigens Bioencapsulated in Plant Cells Adv. Drug Deliv. Rev. 2013 65 782 799 10.1016/j.addr.2012.10.005 23099275 PMC3582797 41. Vo D.-K. Trinh K.T.L. Molecular Farming for Immunization: Current Advances and Future Prospects in Plant-Produced Vaccines Vaccines 2025 13 191 10.3390/vaccines13020191 40006737 PMC11860421 42. Feng H. Li X. Song W. Duan M. Chen H. Wang T. Dong J. Oral Administration of a Seed-Based Bivalent Rotavirus Vaccine Containing VP6 and NSP4 Induces Specific Immune Responses in Mice Front. Plant Sci. 2017 8 910 10.3389/fpls.2017.00910 28620404 PMC5449476 43. Tokuhara D. Álvarez B. Mejima M. Hiroiwa T. Takahashi Y. Kurokawa S. Kuroda M. Oyama M. Kozuka-Hata H. Nochi T. Rice-Based Oral Antibody Fragment Prophylaxis and Therapy against Rotavirus Infection J. Clin. Investig. 2013 123 3829 3838 10.1172/JCI70266 23925294 PMC3754275 44. Pudhuvai B. Koul B. Mishra A.K. Insights into the World of Edible Vaccines: From Lab to Reality Curr. Res. Biotechnol. 2025 9 100290 10.1016/j.crbiot.2025.100290 45. Kong Q. Richter L. Yang Y.F. Arntzen C.J. Mason H.S. Thanavala Y. Oral Immunization with Hepatitis B Surface Antigen Expressed in Transgenic Plants Proc. Natl. Acad. Sci. USA 2001 98 11539 11544 10.1073/pnas.191617598 11553782 PMC58765 46. Scott L.J. Carter N.J. Curran M.P. Live Attenuated Influenza Vaccine (Fluenz TM Pediatr. Drugs 2012 14 271 279 10.2165/11207080-000000000-00000 22702743 47. FDA Approves Nasal Spray Influenza Vaccine for Self- or Caregiver-Administration Available online: https://Www.Fda.Gov/News-Events/Press-Announcements/Fda-Approves-Nasal-Spray-Influenza-Vaccine-Self-or-Caregiver-Administration (accessed on 10 September 2025) 48. Kehagia E. Papakyriakopoulou P. Valsami G. Advances in Intranasal Vaccine Delivery: A Promising Non-Invasive Route of Immunization Vaccine 2023 41 3589 3603 10.1016/j.vaccine.2023.05.011 37179163 PMC10173027 49. Jabbal-Gill I. Nasal Vaccine Innovation J. Drug Target. 2010 18 771 786 10.3109/1061186X.2010.523790 21047271 50. Heida R. Hinrichs W.L. Frijlink H.W. Inhaled Vaccine Delivery in the Combat against Respiratory Viruses: A 2021 Overview of Recent Developments and Implications for COVID-19 Expert Rev. Vaccines 2022 21 957 974 10.1080/14760584.2021.1903878 33749491 51. Fokkens W.J. Antigen-presenting Cells in Nasal Allergy Allergy 1999 54 1130 1141 10.1034/j.1398-9995.1999.00104.x 10604548 52. Shim S. Soh S.H. Im Y.B. Ahn C. Park H.-T. Park H.-E. Park W.B. Kim S. Yoo H.S. Induction of Systemic Immunity through Nasal-Associated Lymphoid Tissue (NALT) of Mice Intranasally Immunized with Brucella Abortus Malate Dehydrogenase-Loaded Chitosan Nanoparticles PLoS ONE 2020 15 e0228463 10.1371/journal.pone.0228463 32027689 PMC7004331 53. Ramvikas M. Arumugam M. Chakrabarti S.R. Jaganathan K.S. Nasal Vaccine Delivery Micro and Nanotechnology in Vaccine Development Elsevier Amsterdam, The Netherlands 2017 279 301 978-0-323-39981-4 54. Lee H. Ruane D. Law K. Ho Y. Garg A. Rahman A. Esterházy D. Cheong C. Goljo E. Sikora A.G. Phenotype and Function of Nasal Dendritic Cells Mucosal Immunol. 2015 8 1083 1098 10.1038/mi.2014.135 25669151 PMC4532662 55. Seefeld M.L. Templeton E.L. Lehtinen J.M. Sinclair N. Yadav D. Hartwell B.L. Harnessing the Potential of the NALT and BALT as Targets for Immunomodulation Using Engineering Strategies to Enhance Mucosal Uptake Front. Immunol. 2024 15 1419527 10.3389/fimmu.2024.1419527 39286244 PMC11403286 56. Singh R. Gulani M. Vijayanand S. Arte T. Adediran E. Pasupuleti D. Patel P. Ferguson A. Uddin M. Zughaier S.M. An Intranasal Quadruple Variant Vaccine Approach Using SARS-CoV-2 and Influenza A: Delta, Omicron, H1N1 and H3N2 Int. J. Pharm. 2025 683 126043 10.1016/j.ijpharm.2025.126043 40759221 57. Zhang Z. Yang Y. Huang L. Yuan L. Huang S. Zeng Z. Cao Y. Wei X. Wang X. Shi M. Nanotechnology-Driven Advances in Intranasal Vaccine Delivery Systems against Infectious Diseases Front. Immunol. 2025 16 1573037 10.3389/fimmu.2025.1573037 40416956 PMC12098542 58. Nian X. Zhang J. Huang S. Duan K. Li X. Yang X. Development of Nasal Vaccines and the Associated Challenges Pharmaceutics 2022 14 1983 10.3390/pharmaceutics14101983 36297419 PMC9609876 59. Kar S. Devnath P. Emran T.B. Tallei T.E. Mitra S. Dhama K. Oral and Intranasal Vaccines against SARS-CoV-2: Current Progress, Prospects, Advantages, and Challenges Immun. Inflam Dis. 2022 10 e604 10.1002/iid3.604 PMC8959423 35349752 60. Mashkoor Y. Nadeem A. Fatima T. Aamir M. Vohra L.I. Habib A. Khan A. Raufi N. Habte A. Neurological Complications of Influenza Vaccination: Navigating the Spectrum with a Focus on Acute Disseminated Encephalomyelitis (ADEM) Ann. Med. Surg. 2024 86 1029 1041 10.1097/MS9.0000000000001656 PMC10849354 38333316 61. Wu L. Xu W. Jiang H. Yang M. Cun D. Respiratory Delivered Vaccines: Current Status and Perspectives in Rational Formulation Design Acta Pharm. Sin. B 2024 14 5132 5160 10.1016/j.apsb.2024.08.026 39807330 PMC11725141 62. He X. Chen X. Wang H. Du G. Sun X. Recent Advances in Respiratory Immunization: A Focus on COVID-19 Vaccines J. Control Release 2023 355 655 674 10.1016/j.jconrel.2023.02.011 36787821 PMC9937028 63. Masjedi M. Montahaei T. Sharafi Z. Jalali A. Pulmonary Vaccine Delivery: An Emerging Strategy for Vaccination and Immunotherapy J. Drug Deliv. Sci. Technol. 2022 69 103184 10.1016/j.jddst.2022.103184 64. Randall T.D. Bronchus-Associated Lymphoid Tissue (BALT) Advances in Immunology Elsevier Amsterdam, The Netherlands 2010 187 241 978-0-12-381300-8 10.1016/B978-0-12-381300-8.00007-1 PMC7150010 21034975 65. Next-Gen Inhaled COVID Vaccine Boosts Lung Immunity Bioengineer 21 July 2025 66. Tang J. Sun J. Lung Tissue-Resident Memory T Cells: The Gatekeeper to Respiratory Viral (Re)-Infection Curr. Opin. Immunol. 2023 80 102278 10.1016/j.coi.2022.102278 36565508 PMC9911367 67. Blank F. Stumbles P. Von Garnier C. Opportunities and Challenges of the Pulmonary Route for Vaccination Expert Opin. Drug Deliv. 2011 8 547 563 10.1517/17425247.2011.565326 21438741 68. Tonnis W.F. Kersten G.F. Frijlink H.W. Hinrichs W.L.J. De Boer A.H. Amorij J.-P. Pulmonary Vaccine Delivery: A Realistic Approach? J. Aerosol Med. Pulm. Drug Deliv. 2012 25 249 260 10.1089/jamp.2011.0931 22856876 69. Price D.N. Kunda N.K. Muttil P. Challenges Associated with the Pulmonary Delivery of Therapeutic Dry Powders for Preclinical Testing KONA Powder Part. J. 2019 36 129 144 10.14356/kona.2019008 70. Hossain M.K. Ahmed T. Bhusal P. Subedi R.K. Salahshoori I. Soltani M. Hassanzadeganroudsari M. Microneedle Systems for Vaccine Delivery: The Story so Far Expert Rev. Vaccines 2020 19 1153 1166 10.1080/14760584.2020.1874928 33427523 71. Mansoor I. Eassa H.A. Mohammed K.H.A. Abd El-Fattah M.A. Abdo M.H. Rashad E. Eassa H.A. Saleh A. Amin O.M. Nounou M.I. Microneedle-Based Vaccine Delivery: Review of an Emerging Technology AAPS PharmSciTech 2022 23 103 10.1208/s12249-022-02250-8 35381906 PMC8982652 72. Stoitzner P. Tripp C.H. Eberhart A. Price K.M. Jung J.Y. Bursch L. Ronchese F. Romani N. Langerhans Cells Cross-Present Antigen Derived from Skin Proc. Natl. Acad. Sci. USA 2006 103 7783 7788 10.1073/pnas.0509307103 16672373 PMC1472522 73. Mikszta J.A. Alarcon J.B. Brittingham J.M. Sutter D.E. Pettis R.J. Harvey N.G. Improved Genetic Immunization via Micromechanical Disruption of Skin-Barrier Function and Targeted Epidermal Delivery Nat. Med. 2002 8 415 419 10.1038/nm0402-415 11927950 74. Quan F.-S. Kim Y.-C. Vunnava A. Yoo D.-G. Song J.-M. Prausnitz M.R. Compans R.W. Kang S.-M. Intradermal Vaccination with Influenza Virus-Like Particles by Using Microneedles Induces Protection Superior to That with Intramuscular Immunization J. Virol. 2010 84 7760 7769 10.1128/JVI.01849-09 20484519 PMC2897640 75. Edens C. Collins M.L. Goodson J.L. Rota P.A. Prausnitz M.R. A Microneedle Patch Containing Measles Vaccine Is Immunogenic in Non-Human Primates Vaccine 2015 33 4712 4718 10.1016/j.vaccine.2015.02.074 25770786 PMC4554796 76. Feng Y.-X. Hu H. Wong Y.-Y. Yao X. He M.-L. Microneedles: An Emerging Vaccine Delivery Tool and a Prospective Solution to the Challenges of SARS-CoV-2 Mass Vaccination Pharmaceutics 2023 15 1349 10.3390/pharmaceutics15051349 37242591 PMC10222661 77. Intradermal Injections Made Easy Available online: https://www.worldpharmaceuticals.net/companies/becton-dickinson/ (accessed on 1 June 2025) 78. Nguyen H.X. Beyond the Needle: Innovative Microneedle-Based Transdermal Vaccination Medicines 2025 12 4 10.3390/medicines12010004 39982324 PMC11843882 79. Pamornpathomkul B. Wongkajornsilp A. Laiwattanapaisal W. Rojanarata T. Opanasopit P. Ngawhirunpat T. A Combined Approach of Hollow Microneedles and Nanocarriers for Skin Immunization with Plasmid DNA Encoding Ovalbumin Int. J. Nanomed. 2017 12 885 898 10.2147/IJN.S125945 28184159 PMC5291464 80. Ogai N. Nonaka I. Toda Y. Ono T. Minegishi S. Inou A. Hachiya M. Fukamizu H. Enhanced Immunity in Intradermal Vaccination by Novel Hollow Microneedles Ski. Res. Technol. 2018 24 630 635 10.1111/srt.12576 29707828 81. Zuo W. Li J. Jiang W. Zhang M. Ma Y. Gu Q. Wang X. Cai L. Shi L. Sun M. Dose-Sparing Intradermal DTaP-sIPV Immunization with a Hollow Microneedle Leads to Superior Immune Responses Front. Microbiol. 2021 12 757375 10.3389/fmicb.2021.757375 34759909 PMC8573275 82. Niu L. Chu L.Y. Burton S.A. Hansen K.J. Panyam J. Intradermal Delivery of Vaccine Nanoparticles Using Hollow Microneedle Array Generates Enhanced and Balanced Immune Response J. Control. Release 2019 294 268 278 10.1016/j.jconrel.2018.12.026 30572036 83. Kim Y.-C. Quan F.-S. Compans R.W. Kang S.-M. Prausnitz M.R. Formulation and Coating of Microneedles with Inactivated Influenza Virus to Improve Vaccine Stability and Immunogenicity J. Control. Release 2010 142 187 195 10.1016/j.jconrel.2009.10.013 19840825 PMC2823933 84. Choi I.-J. Cha H.-R. Hwang S.J. Baek S.-K. Lee J.M. Choi S.-O. Live Vaccinia Virus-Coated Microneedle Array Patches for Smallpox Vaccination and Stockpiling Pharmaceutics 2021 13 209 10.3390/pharmaceutics13020209 33546332 PMC7913550 85. Park S.H. Shah I.R. Jhumur N.C. Mo Y. Tendolkar S. Lallow E.O. Shan J.W. Zahn J.D. Maslow J.N. Pelegri A.A. Microneedle Arrays Coated with Middle East Respiratory Syndrome Coronavirus DNA Vaccine via Electrospray Deposition Soft Matter 2025 21 3207 3214 10.1039/D4SM01322K 40151993 86. Kale A. Joshi D. Menon I. Bagwe P. Patil S. Vijayanand S. Braz Gomes K. Uddin M. D’Souza M. Zika Vaccine Microparticles (MPs)-Loaded Dissolving Microneedles (MNs) Elicit a Significant Immune Response in a Pre-Clinical Murine Model Vaccines 2023 11 583 10.3390/vaccines11030583 36992167 PMC10056879 87. Adediran E. Arte T. Pasupuleti D. Vijayanand S. Singh R. Patel P. Gulani M. Ferguson A. Uddin M. Zughaier S.M. Delivery of PLGA-Loaded Influenza Vaccine Microparticles Using Dissolving Microneedles Induces a Robust Immune Response Pharmaceutics 2025 17 510 10.3390/pharmaceutics17040510 40284505 PMC12030082 88. Kim J.S. Choi J. Kim J.C. Park H. Yang E. Park J.S. Song M. Park J.-H. Microneedles with Dual Release Pattern for Improved Immunological Efficacy of Hepatitis B Vaccine Int. J. Pharm. 2020 591 119928 10.1016/j.ijpharm.2020.119928 33069897 89. Courtenay A.J. Rodgers A.M. McCrudden M.T.C. McCarthy H.O. Donnelly R.F. Novel Hydrogel-Forming Microneedle Array for Intradermal Vaccination in Mice Using Ovalbumin as a Model Protein Antigen Mol. Pharm. 2019 16 118 127 10.1021/acs.molpharmaceut.8b00895 30452868 90. Trincado V. Gala R.P. Morales J.O. Buccal and Sublingual Vaccines: A Review on Oral Mucosal Immunization and Delivery Systems Vaccines 2021 9 1177 10.3390/vaccines9101177 34696284 PMC8539688 91. Kiyono H. Azegami T. The Mucosal Immune System: From Dentistry to Vaccine Development Proc. Jpn. Acad. Ser. B Phys. Biol. Sci. 2015 91 423 439 10.2183/pjab.91.423 PMC4729857 26460320 92. Jacob S. Nair A.B. Boddu S.H.S. Gorain B. Sreeharsha N. Shah J. An Updated Overview of the Emerging Role of Patch and Film-Based Buccal Delivery Systems Pharmaceutics 2021 13 1206 10.3390/pharmaceutics13081206 34452167 PMC8399227 93. Gala R.P. Popescu C. Knipp G.T. McCain R.R. Ubale R.V. Addo R. Bhowmik T. Kulczar C.D. D’Souza M.J. Physicochemical and Preclinical Evaluation of a Novel Buccal Measles Vaccine AAPS PharmSciTech 2017 18 283 292 10.1208/s12249-016-0566-3 27357420 94. Kraan H. Vrieling H. Czerkinsky C. Jiskoot W. Kersten G. Amorij J.-P. Buccal and Sublingual Vaccine Delivery J. Control. Release 2014 190 580 592 10.1016/j.jconrel.2014.05.060 24911355 PMC7114675 95. Hensley C. Zhou P. Schnur S. Mahsoub H.M. Liang Y. Wang M.-X. Page C. Yuan L. Bronshtein V. Thermostable, Dissolvable Buccal Film Rotavirus Vaccine Is Highly Effective in Neonatal Gnotobiotic Pig Challenge Model Vaccines 2021 9 437 10.3390/vaccines9050437 33946555 PMC8147248 96. Yoon K.-W. Mao J. Eom G.-D. Heo S.I. Chu K.B. Lee M.S. Quan F.-S. Orally Dissolving Film-Based Influenza Vaccines Confer Superior Protection Compared to the Oral Administration of Inactivated Influenza Virus Vaccines 2025 13 600 10.3390/vaccines13060600 40573931 PMC12197548 97. Cui Z. Mumper R.J. Bilayer Films for Mucosal (Genetic) Immunization via the Buccal Route in Rabbits Pharm. Res. 2002 19 947 953 10.1023/A:1016454003450 12180546 98. Mašek J. Lubasová D. Lukáč R. Turánek-Knotigová P. Kulich P. Plocková J. Mašková E. Procházka L. Koudelka Š. Sasithorn N. Multi-Layered Nanofibrous Mucoadhesive Films for Buccal and Sublingual Administration of Drug-Delivery and Vaccination Nanoparticles—Important Step towards Effective Mucosal Vaccines J. Control Release 2017 249 183 195 10.1016/j.jconrel.2016.07.036 27469472 99. Esih H. Mezgec K. Billmeier M. Malenšek Š. Benčina M. Grilc B. Vidmar S. Gašperlin M. Bele M. Zidarn M. Mucoadhesive Film for Oral Delivery of Vaccines for Protection of the Respiratory Tract J. Control Release 2024 371 179 192 10.1016/j.jconrel.2024.05.041 38795814 100. Shah S. Patel P. Ferguson A. Bagwe P. Kale A. Adediran E. Singh R. Arte T. Pasupuleti D. Uddin M. Buccal Administration of a Zika Virus Vaccine Utilizing 3D-Printed Oral Dissolving Films in a Mouse Model Vaccines 2024 12 720 10.3390/vaccines12070720 39066358 PMC11281521 101. Anggraeni R. Ana I.D. Agustina D. Martien R. Induction of Protein Specific Antibody by Carbonated Hydroxy Apatite as a Candidate for Mucosal Vaccine Adjuvant Dent. Mater. J. 2022 41 710 723 10.4012/dmj.2021-254 35858789 102. Singh S. Yang G. Schluns K.S. Anthony S.M. Sastry K.J. Sublingual Vaccination Induces Mucosal and Systemic Adaptive Immunity for Protection against Lung Tumor Challenge PLoS ONE 2014 9 e90001 10.1371/journal.pone.0090001 24599269 PMC3943861 103. Goswami T. Jasti B. Li X. Sublingual Drug Delivery Crit. Rev. Ther. Drug Carr. Syst. 2008 25 449 484 10.1615/CritRevTherDrugCarrierSyst.v25.i5.20 19062634 104. Saha P. Verma S. Das P.S. Sublingual drug delivery: An indication of potential alternative route Int. J. Curr. Pharm. Res. 2017 9 5 7 10.22159/ijcpr.2017v9i6.23436 105. Mazzinelli E. Favuzzi I. Arcovito A. Castagnola R. Fratocchi G. Mordente A. Nocca G. Oral Mucosa Models to Evaluate Drug Permeability Pharmaceutics 2023 15 1559 10.3390/pharmaceutics15051559 37242801 PMC10220859 106. Hua S. Advances in Nanoparticulate Drug Delivery Approaches for Sublingual and Buccal Administration Front. Pharmacol. 2019 10 1328 10.3389/fphar.2019.01328 31827435 PMC6848967 107. Mangla B. Javed S. Sultan M.H. Ahsan W. Aggarwal G. Kohli K. Nanocarriers-Assisted Needle-Free Vaccine Delivery Through Oral and Intranasal Transmucosal Routes: A Novel Therapeutic Conduit Front. Pharmacol. 2022 12 757761 10.3389/fphar.2021.757761 35087403 PMC8787087 108. Stie M.B. Gätke J.R. Wan F. Chronakis I.S. Jacobsen J. Nielsen H.M. Swelling of Mucoadhesive Electrospun Chitosan/Polyethylene Oxide Nanofibers Facilitates Adhesion to the Sublingual Mucosa Carbohydr. Polym. 2020 242 116428 10.1016/j.carbpol.2020.116428 32564847 109. Kusumoto Y. Ueda M. Hashimoto M. Takeuchi H. Okada N. Yamamoto J. Nishii A. Fujino A. Kurahashi A. Satoh M. Sublingual Immune Cell Clusters and Dendritic Cell Distribution in the Oral Cavity JCI Insight 2024 9 e167373 10.1172/jci.insight.167373 39352752 PMC11601585 110. Nagai Y. Shiraishi D. Tanaka Y. Nagasawa Y. Ohwada S. Shimauchi H. Aso H. Endo Y. Sugawara S. Transportation of Sublingual Antigens across Sublingual Ductal Epithelial Cells to the Ductal Antigen-presenting Cells in Mice Clin. Exp. Allergy 2015 45 677 686 10.1111/cea.12329 24773115 111. Hervouet C. Luci C. Bekri S. Juhel T. Bihl F. Braud V.M. Czerkinsky C. Anjuère F. Antigen-Bearing Dendritic Cells from the Sublingual Mucosa Recirculate to Distant Systemic Lymphoid Organs to Prime Mucosal CD8 T Cells Mucosal Immunol. 2014 7 280 291 10.1038/mi.2013.45 23801305 112. Shim B.-S. Choi Y. Cheon I.S. Song M.K. Sublingual Delivery of Vaccines for the Induction of Mucosal Immunity Immune Netw. 2013 13 81 85 10.4110/in.2013.13.3.81 23885221 PMC3718922 113. Benito-Villalvilla C. Cirauqui C. Diez-Rivero C.M. Casanovas M. Subiza J.L. Palomares O. MV140, a Sublingual Polyvalent Bacterial Preparation to Treat Recurrent Urinary Tract Infections, Licenses Human Dendritic Cells for Generating Th1, Th17, and IL-10 Responses via Syk and MyD88 Mucosal Immunol. 2017 10 924 935 10.1038/mi.2016.112 27966556 114. Monge C. Ayad C. Paris A.-L. Rovera R. Colomb E. Verrier B. Mucosal Adjuvants Delivered by a Mucoadhesive Patch for Sublingual Administration of Subunit Vaccines Int. J. Mol. Sci. 2022 23 13440 10.3390/ijms232113440 36362224 PMC9655718 115. Kim Y. Park I.H. Shin J. Choi J. Jeon C. Jeon S. Shin J.-S. Jung H. Sublingual Dissolving Microneedle (SLDMN)-Based Vaccine for Inducing Mucosal Immunity against SARS-CoV-2 Adv. Healthc. Mater. 2023 12 e2300889 10.1002/adhm.202300889 37337388 116. Sexually Transmitted Infections (STIs) Available online: https://www.who.int/health-topics/sexually-transmitted-infections#tab=tab_1 (accessed on 9 June 2025) 117. VanBenschoten H.M. Woodrow K.A. Vaginal Delivery of Vaccines Adv. Drug Deliv. Rev. 2021 178 113956 10.1016/j.addr.2021.113956 34481031 PMC8722700 118. Zhou J.Z. Way S.S. Chen K. Immunology of the Uterine and Vaginal Mucosae Trends Immunol. 2018 39 302 314 10.1016/j.it.2018.01.007 29530651 PMC5880711 119. Johansson E.-L. Wassén L. Holmgren J. Jertborn M. Rudin A. Nasal and Vaginal Vaccinations Have Differential Effects on Antibody Responses in Vaginal and Cervical Secretions in Humans Infect. Immun. 2001 69 7481 7486 10.1128/IAI.69.12.7481-7486.2001 11705923 PMC98837 120. Baker J.R. Farazuddin M. Wong P.T. O’Konek J.J. The Unfulfilled Potential of Mucosal Immunization J. Allergy Clin. Immunol. 2022 150 1 11 10.1016/j.jaci.2022.05.002 35569567 PMC9098804 121. Seavey M.M. Mosmann T.R. Estradiol-Induced Vaginal Mucus Inhibits Antigen Penetration and CD8+ T Cell Priming in Response to Intravaginal Immunization Vaccine 2009 27 2342 2349 10.1016/j.vaccine.2009.02.025 19428849 PMC2952928 122. Vaginal Administration Available online: https://www.cd-bioparticles.net/vaginal-administration?srsltid=afmbooouyjio3ah_8bcj1tnbgstaip2fykfmnax9r8bxzetwk1f2gyru (accessed on 5 June 2025) 123. Han I.-K. Kim Y.B. Kang H.-S. Sul D. Jung W.-W. Cho H.J. Oh Y.-K. Thermosensitive and Mucoadhesive Delivery Systems of Mucosal Vaccines Methods 2006 38 106 111 10.1016/j.ymeth.2005.10.003 16414271 124. Meurens F. Summerfield A. Nauwynck H. Saif L. Gerdts V. The Pig: A Model for Human Infectious Diseases Trends Microbiol. 2012 20 50 57 10.1016/j.tim.2011.11.002 22153753 PMC7173122 125. Park J. Oh Y. Kang M. Kim C. Enhanced Mucosal and Systemic Immune Responses Following Intravaginal Immunization with Human Papillomavirus 16 L1 Virus-like Particle Vaccine in Thermosensitive Mucoadhesive Delivery Systems J. Med. Virol. 2003 70 633 641 10.1002/jmv.10442 12794729 126. Bi Q. Song X. Zhao Y. Hu X. Yang H. Jin R. Nie Y. Mucus-Penetrating Nonviral Gene Vaccine Processed in the Epithelium for Inducing Advanced Vaginal Mucosal Immune Responses Acta Pharm. Sin. B 2023 13 1287 1302 10.1016/j.apsb.2022.11.004 36970203 PMC10031263 127. McKay P.F. Mann J.F.S. Pattani A. Kett V. Aldon Y. King D. Malcolm R.K. Shattock R.J. Intravaginal Immunisation Using a Novel Antigen-Releasing Ring Device Elicits Robust Vaccine Antigen-Specific Systemic and Mucosal Humoral Immune Responses J. Control Release 2017 249 74 83 10.1016/j.jconrel.2017.01.018 28115243 PMC5333785 128. FluGen’s Intranasal Vaccine Shows Promise in Boosting Flu Protection for Older Adults Available online: https://www.contagionlive.com/view/flugen-s-intranasal-vaccine-shows-promise-in-boosting-flu-protection-for-older-adults (accessed on 1 June 2025) 129. Nasal COVID Vax Shows Promise in Phase 1 Clinical Trial Available online: https://scienceblog.cincinnatichildrens.org/nasal-covid-vax-shows-promise-in-phase-1-clinical-trial/ (accessed on 3 June 2025) 130. Chu K. Quan J. Liu X. Chen Q. Zang X. Jiang H. Liu D. Chu X. Zhuang C. Han J. A Randomized Phase I Trial of Intranasal SARS-CoV-2 Vaccine dNS1-RBD in Children Aged 3–17 Years npj Vaccines 2025 10 50 10.1038/s41541-025-01096-y 40097460 PMC11914604 131. Singh C. Verma S. Reddy P. Diamond M.S. Curiel D.T. Patel C. Jain M.K. Redkar S.V. Bhate A.S. Gundappa V. Phase III Pivotal Comparative Clinical Trial of Intranasal (iNCOVACC) and Intramuscular COVID 19 Vaccine (Covaxin ® npj Vaccines 2023 8 125 10.1038/s41541-023-00717-8 37596281 PMC10439197 132. Intravacc to Begin Clinical Trials for Nasal COVID Vaccine Available online: https://manufacturingchemist.com/intravacc-to-begin-clinical-trials-for-nasal-covid-vaccine-197961 (accessed on 14 June 2025) 133. Human Challenge Study to Evaluate the Efficacy of MV-012-968 Vaccine Available online: https://clinicaltrials.gov/study/nct04690335 (accessed on 14 June 2025) 134. Keech C. Miller V.E. Rizzardi B. Hoyle C. Pryor M.J. Ferrand J. Solovay K. Thalen M. Noviello S. Goldstein P. Immunogenicity and Safety of BPZE1, an Intranasal Live Attenuated Pertussis Vaccine, versus Tetanus–Diphtheria–Acellular Pertussis Vaccine: A Randomised, Double-Blind, Phase 2b Trial Lancet 2023 401 843 855 10.1016/S0140-6736(22)02644-7 36906345 135. Jeyanathan M. Afkhami S. D’Agostino M.R. Satia I. Fritz D.K. Miyasaki K. Ang J.C. Zganiacz A. Howie K.J. Swinton M. Induction of Lung Mucosal Immunity by a Next-Generation Inhaled Aerosol COVID-19 Vaccine: An Open-Label, Multi-Arm Phase 1 Clinical Trial Nat. Commun. 2025 16 6000 10.1038/s41467-025-60726-0 40603330 PMC12223143 136. McMaster’s Inhaled COVID-19 Vaccine Boasts Safety and Robust Mucosal Immunity After phase-1 Human Trials Available online: https://healthsci.mcmaster.ca/mcmasters-inhaled-covid-19-vaccine-boasts-safety-and-robust-mucosal-immunity-after-phase-1-human-trials/ (accessed on 2 June 2025) 137. Inhaled COVID Vaccine Begins Recruitment for Phase 2 Available online: https://respiratory-therapy.com/products-treatment/pharmaceuticals/intl-pharmaceuticals/inhaled-covid-vaccine-begins-recruitment-for-phase- (accessed on 5 July 2025) 138. A Phase 2 Clinical Trial to Evaluate the Recombinant Vaccine for COVID-19 (Adenovirus Vector) Available online: https://clinicaltrials.gov/study/NCT04341389 (accessed on 10 June 2025) 139. Hepatitis B Vaccine Delivered Transdermally by MAP Available online: https://clinicaltrials.gov/study/nct06800131?cond=hepatitis%20b&viewtype=table&rank=5 (accessed on 7 June 2025) 140. Establishing Immunogenicity and Safety of Needle-free Intradermal Delivery of mRNA COVID-19 Vaccine (MILESTONE) Available online: https://www.clinicaltrials.gov/study/nct05315362 (accessed on 20 June 2025) 141. Measles and Rubella Vaccine Microneedle Patch Phase 1–2 Age De-Escalation Trial Available online: https://clinicaltrials.gov/study/nct04394689 (accessed on 27 June 2025) 142. CDC-9 Inactivated Rotavirus Vaccine (IRV) Microneedle Patch (MNP) in Healthy Adults Available online: https://clinicaltrials.gov/study/nct06962904 (accessed on 10 June 2025) 143. Inactivated Influenza Vaccine Delivered by Microneedle Patch or by Hypodermic Needle Available online: https://clinicaltrials.gov/study/nct02438423?tab=results (accessed on 15 June 2025) 144. Garg N. Tellier G. Vale N. Kluge J. Portman J.L. Markowska A. Tussey L. Phase 1, Randomized, Rater and Participant Blinded Placebo-Controlled Study of the Safety, Reactogenicity, Tolerability and Immunogenicity of H1N1 Influenza Vaccine Delivered by VX-103 (a MIMIX Microneedle Patch [MAP] System) in Healthy Adults PLoS ONE 2024 19 e0303450 10.1371/journal.pone.0303450 38843267 PMC11156369 145. A Pilot Study to Evaluate the Safety and Immunogenicity of Low Dose Flu Vaccines (NANOVAX) Available online: https://www.clinicaltrials.gov/study/nct00558649 (accessed on 1 July 2025) 146. Immunogenicity of Inactivated and Live Polio Vaccines Available online: https://clinicaltrials.gov/study/nct01813604 (accessed on 1 July 2025) 147. ImmunityBio’s hAd5 T-Cell COVID-19 Vaccine Candidate Shows Complete Protection of Airways in Non-Human Primates Available online: https://immunitybio.com/immunitybios-had5-t-cell-covid-19-vaccine-candidate-shows-complete-protection-of-airways-in-non-human-primates/ (accessed on 10 July 2025) 148. Initiation of Phase I Clinical Trial for Seasonal Influenza HA Vaccine Sublingual Tablet Available online: https://www.nitto.com/us/en/press/2016/1102.jsp (accessed on 5 July 2025) 149. Safety of Sublingual dmLT for ETEC Available online: https://clinicaltrials.gov/study/nct02052934 (accessed on 5 July 2025) 150. Yuki Y. Kurokawa S. Sugiura K. Kashima K. Maruyama S. Yamanoue T. Honma A. Mejima M. Takeyama N. Kuroda M. MucoRice-CTB Line 19A, a New Marker-Free Transgenic Rice-Based Cholera Vaccine Produced in an LED-Based Hydroponic System Front. Plant Sci. 2024 15 1342662 10.3389/fpls.2024.1342662 38559768 PMC10978600 151. Herbst-Kralovetz M. Mason H.S. Chen Q. Norwalk Virus-like Particles as Vaccines Expert Rev. Vaccines 2010 9 299 307 10.1586/erv.09.163 20218858 PMC2862602 152. El Jaddaoui I. Al Idrissi N. Hamdi S. Wakrim L. Nejjari C. Amzazi S. Elouahabi A. Bakri Y. Ghazal H. Plant-Based Vaccines Against COVID-19 for Massive Vaccination in Africa Front. Drug Deliv. 2022 2 909958 10.3389/fddev.2022.909958 153. Mason H.S. Haq T.A. Clements J.D. Arntzen C.J. Edible Vaccine Protects Mice against Escherichia coli Vaccine 1998 16 1336 1343 10.1016/S0264-410X(98)80020-0 9682399 154. Safety and Immunogenicity Study of a Virosomal Vaccine Against Recurrent Vulvovaginal Candida Infection Available online: https://clinicaltrials.gov/study/nct01067131?cond=%22candidiasis%22&intr=%22vaccines%22&viewtype=table&rank=3 (accessed on 7 July 2025) 155. Hopkins W.J. Elkahwaji J. Beierle L.M. Leverson G.E. Uehling D.T. Vaginal Mucosal Vaccine for Recurrent Urinary Tract Infections in Women: Results of a Phase 2 Clinical Trial J. Urol. 2007 177 1349 1353 10.1016/j.juro.2006.11.093 17382730 156. Lewis D.J. Fraser C.A. Mahmoud A.N. Wiggins R.C. Woodrow M. Cope A. Cai C. Giemza R. Jeffs S.A. Manoussaka M. Phase I Randomised Clinical Trial of an HIV-1CN54, Clade C, Trimeric Envelope Vaccine Candidate Delivered Vaginally PLoS ONE 2011 6 e25165 10.1371/journal.pone.0025165 21984924 PMC3184147 157. Rathore A.P.S. St. John A.L. Promises and Challenges of Mucosal COVID-19 Vaccines Vaccine 2023 41 4042 4049 10.1016/j.vaccine.2023.04.013 37045682 PMC10083204 158. Tripathy S.K. Das S. Malik A. Vaccine and Malnutrition: A Narrative Review J. Fam. Med. Prim. Care 2023 12 1808 1813 10.4103/jfmpc.jfmpc_596_23 PMC10657100 38024923 159. Hong S.-H. Influence of Microbiota on Vaccine Effectiveness: “Is the Microbiota the Key to Vaccine-Induced Responses?” J. Microbiol. 2023 61 483 494 10.1007/s12275-023-00044-6 37052795 PMC10098251 160. Jiang G. Zou Y. Zhao D. Yu J. Optimising Vaccine Immunogenicity in Ageing Populations: Key Strategies Lancet Infect. Dis. 2025 25 e23 e33 10.1016/S1473-3099(24)00497-3 39326424 161. Kanojia G. Have R.T. Soema P.C. Frijlink H. Amorij J.-P. Kersten G. Developments in the Formulation and Delivery of Spray Dried Vaccines Hum. Vaccines Immunother. 2017 13 2364 2378 10.1080/21645515.2017.1356952 PMC5647985 28925794 162. Ghaemmaghamian Z. Zarghami R. Walker G. O’Reilly E. Ziaee A. Stabilizing Vaccines via Drying: Quality by Design Considerations Adv. Drug Deliv. Rev. 2022 187 114313 10.1016/j.addr.2022.114313 35597307 Figure 1 Vaccine antigen encapsulated in nanoparticle, shielding them from acidic pH, proteolytic enzymes, and bile salts in the GI tract, thereby preserving their biological activity. 2. Due to their small size, NPs can traverse mucosal barriers and diffuse through the mucus layer, reaching the underlying intestinal epithelium to be taken up by microfold (M) cells. 3. The antigen is released to be taken up by antigen-presenting cells. 4. Antigen presentation takes place leading to the activation of naïve T cells. 5. Activated T-cells go to lymph node, interact with B cells, and start to release plasma cells into the blood. 6. Plasma cells release IgG and secretory IgA, enhancing systemic and mucosal immunity. 7. IgG plasma cell. 8. IgA plasma cell. 9. IgG antibodies. 10. Secretory IgA antibodies. Figure 2 Mucoadhesive formulation vs. mucus-penetrating formulation. Figure 3 Illustration of inhalation route through intranasal and oral inhalation delivery of different platform of vaccine particles. Different vaccine like mRNA vaccines, nanoparticulate vaccines, vector-based vaccines, live attenuated vaccines, or subunit vaccines can be formulated separately and can be delivered using different devices into the nasal and the pulmonary tract targeting the mucosal associated lymphatic tissue. ( a b c Figure 4 Representation of solid microneedle route. After application, the topical formulation is applied which is taken up by the dermal dendritic cells and Langerhans cells. Figure 5 Representation of buccal administration route. Figure 6 Representation of sublingual route. Figure 7 Depiction of the immune response in the lower female reproductive tract. vaccines-13-00978-t001_Table 1 Table 1 Clinical trials in non-invasive vaccine delivery. Disease Phase of Development Name Platform of Vaccine Antigen and Adjuvant Intranasal Vaccines Influenza Phase 1 completed [ 128 FluGen + Fluzone High-Dose inactivated influenza vaccine M2SR Coadministration of the H3N2 M2SR vaccine with Fluzone HD COVID-19 Phase 2 129 CVXGA Intranasal COVID-19 Vaccine in Adults Parainfluenza virus 5 (PIV5) vector expressing SARS-CoV-2 spike Omicron XBB.1.5 variant—Spike protein, chimeric virus formulated by inserting spike gene into the PIV5 genome COVID-19 + Influenza vaccine Phase 3 130 Pneucolin ® SARS-CoV-2 vaccine dNS1-RBD based on a live attenuated influenza virus vector Cold-adapted influenza strain (CA4) without the non-structural protein 1 (NS1) as the genetic backbone, into which receptor-binding domain (RBD) gene from ancestral SARS-CoV-2 is inserted by gene reassortment COVID-19 Phase 3—completed [ 131 BBV154 (iNCOVACC ® Chimpanzee adenovirus-vectored, single-dose intranasal COVID-19 booster vaccine Prefusion-stabilized SARS-CoV-2 spike COVID-19 Phase 2 trial [ 132 NANOVAC (Intravacc) Nanoparticulate peptide vaccine HBcAg (hepatitis B core antigen) as an adjuvant and mucosal targeting carrier. soluble nanospheres containing synthetic mini-proteins from spike and other conserved coronavirus epitopes COVID-19 Phase 1 [ 63 COVI-VACTM Live-attenuated SARS-COV-2 synthetic viral vaccine Attenuated through deletion of the furin cleavage site and introduction of 283 silent deoptimizing mutations that maintain viral amino acid sequence RSV Phase 2 completed [ 133 MV-012-968 recombinant, live attenuated RSV vaccine.  RSV Phase 1 in RSV-Seronegative Children RSV/ΔNS2/Δ1313/I1314L live attenuated, recombinant version of RSV strain A2 (1) A 523 nucleotide deletion of the NS2 gene and (2) a codon deletion in the L gene (Δ1313; deletion of S1313) plus the adjacent missense mutation I1314L that prevents the compensatory deattenuating mutation I1314T. Pertussis (whooping cough) Phase 2b completed [ 134 BPZE1 vaccine Genetically modified, live attenuated strain of Bordetella pertussis Modification by deletion of Dermonecrotic Toxin that eliminates local tissue damage, genetic inactivation of Pertussis Toxin (PT) to remove toxic effect of virus and gene expression reduced of Tracheal Cytotoxin that will prevent ciliary damage in airway epithelium  Oral Inhalation Vaccines  Disease  Phase/Status  Product Name  Platform  Antigen and Adjuvant Preparation COVID-19 Phase 2 (Canada) [ 135 136 ChAd-triCoV/Mac (McMaster) Viral vector (adenovirus, inhaled aerosol) Triple-antigen: S1 spike, nucleocapsid, truncated RNA polymerase/non-adjuvanted COVID-19 Phase 2 (Canada) [ 137 AeroVax (McMaster) Viral vector (inhaled aerosol) Adenovirus vector with 3 SARS-CoV-2 gene segments COVID-19 Phase 1–2 (China) [ 138 Convidecia Air/Ad5-nCoV Adenoviral vector (inhaled aerosol) Adenovirus-vectored spike protein/non-adjuvanted  Microneedle vaccines  Title of study  Type of Microneedle  Sponsor Phase 1: Hepatitis B Vaccine Delivered Trans-dermally by MAP [ 139 Microneedle array patch (MAP) International Vaccine Institute Phase 2a, Establishing Immunogenicity and Safety of Needle-free Intradermal Delivery by Solid Micro Needle Skin Patch of mRNA SARS-CoV-2 Vaccine as a Revaccination Strategy in Healthy Volunteers [ 140 Solid microneedle skin patch Leiden University Medical Center A Phase I/II, Double-blind, Randomized, Active-controlled, Age De-escalation Trial to Assess Safety and Immunogenicity of a Measles Rubella Vaccine (MRV) Microneedle Patch (MRV-MNP) in Adults, MRV-primed Toddlers, and MRV-naïve Infants [ 141 Dissolving microneedle patch Micron Biomedical, Inc. A Phase 1 Study to Evaluate the Safety and Immunogenicity of CDC-9 Inactivated Rotavirus Vaccine for Intradermal Administration by Microneedle Patch in Healthy Adults [ 142 Dissolving microneedle patch Centers for Disease Control and Prevention A Phase I Study of The Safety, Reactogenicity, Acceptability and Immunogenicity of Inactivated Influenza Vaccine Delivered either by Microneedle Patch or by Hypodermic Needle [ 143 - Mark Prausnitz Phase 1 Evaluation of H1 Influenza Vaccine Delivered by MIMIX MAP [ 144 MIMIX Microneedle Array Patch (MAP) System Vaxess Technologies A Pilot, Controlled, Comparative and Single Blinded Study to Evaluate the Safety and Immunogenicity of Low Dose Flu Vaccines Administered Intradermally Using Microneedle Injectors as Compared With Standard Dose Intramuscular Flu Vaccines as Reference [ 145 - NanoPass Technologies Ltd. Phase III Clinical Trial to Assess the Immunogenicity of a Sequential Dose of Fractional Inactivated Polio Vaccine (f-IPV) and Oral Polio Vaccine (OPV) [ 146 MicroJet 600 microneedle Centers for Disease Control and Prevention  Sublingual Vaccination  Disease  Phase  Name  Platform Type  Antigen/Adjuvant COVID-19 Phase 1 [ 147 hAd5 T cell vaccine Adenoviral Vector Spike + Nucleocapsid proteins Influenza (QIV) Phase 1 [ 148 Tablet (NIBRG-14) Inactivated virus tablet H5N1, inulin glass ETEC (traveler’s diarrhea) Phase 1 [ 149 CfaEB-dmLT vaccine Subnit + vaccine CfaEB/CfaE-LTB, dmLT (mutant LT)  Oral vaccination  Disease  Phase of Development  Name/Developer  Vaccine Platform  Plant Used  Antigen and Adjuvant Cholera Phase I/II 150 MucoRice-CTB, Seed-based vaccines Subunit (CTB, VLP) Rice, tobacco CTB (cholera toxin B); none/various Norwalk virus Early Clinical 151 Various VLP Potato, tobacco Norwalk virus capsid protein; none Rotavirus Phase I 42 Maize-based bivalent vaccine, Ro-VLP Subunit (VP6, NSP4, VLP) Maize, potato, alfalfa VP6, NSP4, Ro-VLP; LTB ( E. coli COVID-19 Phase III, Registered 152 Covifenz (Medicago/GSK), Baiya Phytopharm Virus-like Particle (VLP) Nicotiana benthamiana Spike (S) protein; AS03/CpG1018 adjuvant Enterotoxigenic E. coli Phase I (human), Preclinical (animal) 153 - Subunit Potato, maize LT-B (heat-labile toxin B subunit); none  Intravaginal Vaccines  Disease  Phase  Name of product  Platform  Antigen and Adjuvant Recurrent Vulvovaginal Candidiasis Phase I 154 PEV7 Virosome-formulated subunit vaccine delivered either via intravaginal capsule (PEV7C) or IM injection (PEV7B) Sap2 protein (Candida albicans)/non-adjuvanted Recurrent UTIs Phase II [ 155 Urovac™ Vaginal suppository 10 strains of uropathogenic bacteria that were heat-killed/non-adjuvant HIV-1 Phase I [ 156 CN54 gp140 Recombinant HIV-1 enveloped protein formulated in a Carbopol gel, delivered via applicator HIV-1 (CN54 gp140)/non-adjuvanted ",
  "metadata": {
    "Title of this paper": "Stabilizing Vaccines via Drying: Quality by Design Considerations",
    "Journal it was published in:": "Vaccines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474429/"
  }
}