{
  "title": "Paper_377",
  "abstract": "pmc N Am Spine Soc J N Am Spine Soc J 4160 nassj North American Spine Society Journal 2666-5484 Elsevier PMC12483646 PMC12483646.1 12483646 12483646 41036416 10.1016/j.xnsj.2025.100786 S2666-5484(25)00206-9 100786 1 Clinical Studies Identifying patients at risk for a facility discharge following elective one or two level lumbar fusion Solomito Matthew J. PhD a Makanji Heeren MD a b Eisler Jesse MD jesse.eisler@hhchealth.org a c ⁎ a b c ⁎ jesse.eisler@hhchealth.org 12 2025 24 8 2025 24 497287 100786 24 3 2025 22 8 2025 22 8 2025 24 08 2025 01 10 2025 02 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Background Spine procedures are becoming increasingly common and costly in the United States, thus managing fiscal responsibility with surgical outcomes is increasingly important. Reducing facility discharges following a lumbar fusion would not only reduce complications but could provide significant cost savings. Therefore, the purpose of this study is to identify both clinical factors (i.e. demographics, medical history factors) and patient reported outcome scores that were associated with an increased risk of a facility-based discharge following an elective 1 or 2 level lumbar fusion. Methods A total of 513 patients that underwent a 1- or 2-level lumbar fusion between June 2021 and June 2023 were included in this retrospective study. All patients completed their preoperative PROs and completed their medical history and physical prior to surgery. Using logistic regressions, independent variables associated with postoperative discharge to a skilled nursing facility were identified. Subsequent receiver operator curve analysis helped determine cut point values associated with a facility discharge. Results A total of 41 patients (7.9%) were discharged to a facility. Regression analysis identified 6 factors associated with a facility discharge. Three factors were related to clinical outcomes while the other 3 factors were obtained from patient reported outcomes measures. More specifically, PROMIS-10 Global physical (OR:0.17,95% CI 0.04–0.62, AUC:0.701) and mental health (OR:0.89,95% CI 0.83–0.95, AUC:0.813) T-scores below 40, and RAPT scores below 9 (OR:0.60,95% CI 0.48–0.74, AUC:0.814) were associated with facility-based discharges. Conclusions Patient reported outcomes measures provide significant discriminatory ability in combination with standard clinical metrics to identify patients at risk for a facility discharge following elective lumbar fusions. The results suggested that patient reported information concerning preoperative mobility, mental wellbeing, and support at home were more discriminatory than clinical metrics. Keywords Skilled nursing facility Outcomes Lumbar spine Patient reported outcomes Cost-reduction Quality improvement pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Background Lumbar spine fusions are one of the most common orthopedic spinal procedures performed each year in the United States. The prevalence of lumbar fusions has dramatically increased in recent years, with some studies suggesting a 62% increase in spinal fusions between 2004 and 2015 [ 1 2 [3] [4] [5] 1 2 6 7 In an effort to reduce costs, medical centers have attempted to decrease postoperative lengths of stays and transition some procedures to same day outpatient surgical facilities [ 8 9 [10] [11] [12] 9 3 13 [14] [15] [16] [17] 3 13 A number of studies have investigated ways to preoperatively identify patients that are at risk for a SNF discharge following elective total joint arthroplasty [ 9 10 12 13 17 3 13 18 19 [20] [21] [22] Materials and methods This study was approved by the Institutional Review Board at our center. Patient records were included in this study if the patient was, between the ages of 35 and 89 years old, underwent an elective single or 2 level lumbar fusion between June 2021 and June 2023, required an inpatient stay, were seen for a preoperative optimization visit within the 30 days preceding their index surgery, and completed all of their preoperative PROs including: the Oswestry Disability Index (ODI), the PROMIS-10 Global Health Survey (PROMIS-10) [ 23 24 [25] [26] [27] It is important to note, that per standard of care at our institution all patients treated at our center must complete their preoperative optimization visit within 30 days of their lumbar fusion, and our preoperative spine PRO completion rate is 100%. The preoperative optimization visit includes: a complete history and physical, the completion of preoperative PROs, a discussion of modifiable risk factors within the patient’s history that should be addressed prior to surgery (recommendations could be made to delay surgery if necessary), and post discharge care planning. Patient records were excluded from this study if they patient had, undergone a revision procedure, underwent a staged fusion, underwent their fusion as a result of trauma or pathological condition (ie, cancer), required a fusion of 3 or more levels, had a diagnosed cognitive deficit, or had a skilled nursing facility listed as their primary residence prior to surgery. The primary outcome variable for this study was discharge to a facility. For the purposes of this study a discharge to a facility was defined as a post length of stay discharge to either a skilled nursing facility (SNF) or an inpatient rehabilitation facility (IRF). Demographic data, patient medical and social history, surgical planning data, in hospital stay, and preoperative PRO scores were all extracted from the patient’s electronic medical record. Continuous, normally distributed variables were presented as mean and standard deviation, while continuous non-normally distributed variables were presented as median and interquartile range (IQR). Data that consisted of count or binary data were presented as a percentage of the study cohort. To determine if there were statistically significant differences between study groups in regard to differences in demographics, PRO scores, and medical history, T-tests assuming unequal variance and chi-square contingency test were performed. To evaluate which variables were independently associated with a facility discharge, a stepwise regression approach was used as previously described in the literature [ 28 25 Results A total of 513 patients were included in this study ( Table 1 Table 1 Demographic comparison between those that were discharged to a facility compared to those that were discharged home or home with a healthcare aid. Table 1 Home/Home aid Facility discharge p-value N 472 41 Age 62.5±12.1 66.1±11.4 .070 BMI 30.9±6.2 32.3±7.2 .183 CCI 2 [ 2 3[ 3 .002 Current smoker 31 (6.6%) 1 (2.4%) .294 Diabetes 60 (12.7%) 5 (12.1%) .691 Sex Male 239 (50.6%) 11 (26.8%) .003 Female 233 (49.4%) 30 (73.2%) Race African American 19 (4.0%) 5 (12.2%) .027 Caucasian 399 (84.6%) 29 (70.7%) Other 54 (11.4%) 7 (17.1%) Insurance Commercial 13 (2.8%) 0 .836 Medicare 395 (83.8%) 36 (87.8%) Medicaid 15 (3.2%) 1 (2.4%) Other government 2 (0.4%) 0 Workers comp 47 (19.0%) 4 (9.8%) Levels fused 1 336 (71.2%) 25 (61.0%) .169 2 136 (28.8%) 16 (39.0%) Surgical approach Anterior 98 (20.8%) 2 (4.8%) .106 Combine 155 (31.6%) 15 (36.7%) Oblique 12 (2.5%) 3 (7.3%) Posterior/Transforaminal 213 (45.1%) 21 (51.2%) Length of stay (days) 2.2±1.2 4.9±3.0 <.001 The results of the univariates analysis identified a total of 16 variables for inclusion in the multivariate regression analysis ( Table 2 Fig. 1 Table 3 Fig. 2 Table 4 Table 3 2 2 2 Table 2 Results of the univariate logistic regression. Table 2 Factor p-value Odds ratio 95% CI Preoperative factors Age .019 † 1.03 1.01–1.05 Sex .048 † 2.79 1.36–5.71 Race .080 † 1.43 0.96–2.15 Ethnicity .373 1.22 0.45–3.27 BMI .184 † 1.03 0.98–1.08 Insurance type .644 1.11 0.72–1.69 Work status .086 † 1.24 0.96–1.61 Mental illness diagnosis .829 0.91 0.39–2.12 CCI .006 † 1.23 1.03–1.43 Smoking status .538 0.90 0.64–1.25 Alcohol use .260 0.68 0.49–9.59 Diabetes .258 1.60 0.71–3.62 Planned number of levels .002 † 2.04 1.31–3.20 Planned approach .098 † 1.26 0.95–1.67 Preoperative PROs PROMIS- 10 mental health T-score .003 † 0.94 0.90–0.97 PROMIS- 10 physical function T-score .057 † 0.91 0.87–0.97 ODI score .029 † 1.02 1.01–1.04 RAPT score <.001 † 0.58 0.49–0.69  Community services .049 † 0.18 0.03–0.99  Walking aid .010 † 0.38 0.25–0.59  Walking distance <.001 † 0.43 0.26–0.71  Living arrangement <.001 † 0.42 0.30–0.59 Length of stay <.001 1.86 1.57–2.26 † Inclusion in multivariate model CCI, charlson comorbidity index; ODI, oswestry disability index; RAPT, risk assessment and prediction tool; 95% CI, 95% confidence interval. Fig. 1 Graphical representation of univariate odds ratios (black circles) and 95% confidence intervals (black horizontal lines) for all parameters of interest in the univariate logistic regressions in association to a facility discharge. The vertical line at odds ratio value of 1 was included to help determine significance. All variables with an *prior to their name indicate statistically significant findings in the univariate analysis. Fig 1 Table 3 Results of the multivariate regression to identify preoperative factors that were considered independent predictors of a facility discharge. Table 3 p-value Odds ratio 95% confidence interval Preoperative factors Sex (male is reference) .042 2.92 1.04–8.27 BMI .045 1.06 1.01–1.14 CCI .037 1.23 1.06–1.43 RAPT <.001 0.60 0.48–0.74  Living alone .039 1.61 1.35 –2.08 PROMIS MHT .002 0.89 0.83–0.95 PROMIS PFT .020 0.17 0.04–0.62 CCI, Charlson comorbidity index; RAPT, risk assessment and prediction tool; MHT, mental health T-score; PFT, physical function T-score; BMI, body mass index. Fig. 2 Graphical representation of multivariate odds ratios (black circles) and 95% confidence intervals (black horizontal lines) for all parameters of interest included in the logistic regressions in association to a facility discharge. The vertical line at odds ratio value of 1 was included to help determine significance. All variables except for female sex were significant in the receiver operator curve analysis. Fig 2 Table 4 Results of the nonparametric receiver operator curve (ROC) analysis and the associated cut points identified using the Youden method. Table 4 AUC Cut point Preoperative factors BMI 0.708 >41 CCI 0.743 >4 RAPT 0.814 <9  Living arrangements 0.721 Alone PROMIS MHT 0.813 <40 PROMIS PFT 0.701 <40 AUC, area under the curve; CCI, Charlson comorbidity index; RAPT, risk assessment and prediction tool; MHT, mental health T-score; PFT, physical function T-score. For all parameters the outcome variable was considered a facility discharge. Discussion Lumbar spine fusion provides a means of addressing complex spinal pathologies, and the number of surgeries conducted each year is only expected to rise [ 1 2 The results of this study indicated that 7.9% of patients that underwent elective 1 or 2 level lumbar fusions were discharged to a facility during the open period of this study. This rate is lower than has been previously described in literature [ 3 13 Furthermore, the results of the regression analyses indicated that a number of parameters were significantly associated with facility discharges for both the univariate and multivariate analyses. However, an important factor to discuss are the associated 95% confidence intervals. Parameters with extremely small ranges, tend to be an accurate representation of the general population, and thus the results would hold true beyond the study cohort, while wide confidence intervals demonstrate increased variability and may only hold true within the study cohort. For instance, the findings associated with the patient reported outcomes demonstrated limited variability, and thus indicate that these findings, would hold true for the general population further emphasizing the utility of PROs as a preoperative tool to identify patients for a poor outcome. Whereas other factors such as diabetes or female sex, show a much larger confidence interval, indicating that the generalizability may be limited. Additionally, the variability within the parameter could also be skewed. For example, diabetes is based on a diagnosis rather than an objective blood test in this study, so no distinction is made between patients with controlled or uncontrolled diabetes thus contributing to the larger confidence interval. It is also important to note that standard clinical factors such as BMI and CCI had larger confidence intervals than, the PRO measures indicating that the PRO measures had better discriminatory value. While the majority of current literature focuses on preoperative and inpatient variables to understand which variables are associated with a SNF discharge; this work focused solely on identifying preoperative risk factors associated with facility discharges [ 3 13 19 3 10 13 29 3 13 Unlike other studies that have looked at SNF discharges based on preoperative factors this study also included the results of patients reported outcomes. Inclusion of PRO scores in the multivariate regression model increased the r 2 20 21 14 The overall RAPT score was also noted to be significantly associated with a facility discharge, and patients that scored below a 9 were more likely to be discharged to a facility, which is consistent with previous total joint arthroplasty studies [ 14 25 27 The overall results of this study indicate that patient reported mental health, mobility, and social support were the primary factors associated with a facility discharge. The results of this study also demonstrated that in most cases the use of preoperative patient reported outcomes either alone or in combination with standard clinical metrics provided a better understanding of risk for patient discharge disposition. Therefore, this study also emphasizes both the need for and utility of a robust collection of preoperative patients reported outcomes. Patients that self-identified as having poor mental health via the PROMIS, could potentially benefit from additional points of contact during the preoperative and recovery phases, with medical staff (e.g. nurse navigators) to reassure them and answer questions in an effort to reduce anxiety and thus possibly reduce facility discharges. Patients self-reporting poor preoperative mobility could potentially benefit from preoperative physical therapy interventions, to improve mobility prior to their surgical intervention. For patients with limited social support, knowing this at the preoperative visit could provide ample time to plan for a nonroutine discharge for the patient, and thus reduce the potential for extended in hospital stays. The findings of this study should be used to improve preoperative planning for postsurgical care, and aid in shared decision-making conversations between the surgeon and patient. This study is not without limitations. The study demographics were relatively homogenous and thus may not represent a generalizable sample. Furthermore, the study inclusion criteria required that patients complete their preoperative patient reported outcomes, and thus this may have led to unintended selection bias. It is also important to note that the number of patients discharged to a facility, 41, was a relatively small cohort. This could significantly influence the generalizability of this study’s findings; therefore, future work is necessary to not only to confirm these findings, but also to expand on these findings to develop a predictive model. Additionally, our institution has a robust preoperative screening and optimization program; thus, the outcomes of this study may be influenced by this program, and could be a reason that some medical comorbidities noted in other studies as a risk were not found in this study as well. Furthermore, the multivariate regression analysis presented in this work only explains around 31% of the variability related to a facility discharge. Therefore, additional work is necessary to identify additional variables to improve the predictive nature of a future model. Conclusion In short, as lumbar spine procedures become increasingly more common ensuring quality of care while heralding fiscal responsibility is a primary goal of medical institutions, providers, and payers. Although facility discharges are uncommon following elective, 1 or 2 level lumbar fusions, they do represent a significant financial burden and substantially increased risk of poor postoperative outcomes. Therefore, investigating ways to identify and prevent patients from being discharged to a facility is of paramount importance. Special attention to patient self-reported mental wellness, mobility, and social support during the preoperative assessments using standard patient reported outcome tools can inform the likelihood of being discharged to a skilled nursing facility, with greater accuracy than clinically observed metrics alone. Funding This study did not receive any external funding. Declarations of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Reisener M.J. Pumberger M. Shue J. Trends in lumbar spinal fusion: a literature review J Spine Surg 6 4 2020 752 33447679 10.21037/jss-20-492 PMC7797794 2 Martin B.I. Mirza S.K. Spina N. Trends in lumbar fusion procedure rates and associated hospital costs for degenerative spinal diseases in the United States, 2004 to 2015 Spine 44 5 2019 369 376 30074971 10.1097/BRS.0000000000002822 3 Murphy M.E. Maloney P.R. McCutcheon B.A. Predictors of discharge to a nonhome facility in patients undergoing lumbar decompression without fusion for degenerative spine disease Neurosurgery 81 4 2017 638 649 28486638 10.1093/neuros/nyx057 4 Hooten W.M. Cohen S.P. Evaluation and treatment of low back pain: a clinically focused review for primary care specialists Mayo Clin Proc 90 12 2015 1699 1718 26653300 10.1016/j.mayocp.2015.10.009 5 Murray C.J.L. Atkinson C. Bhalla K. The state of US health, 1990-2010:burden of diseases, injuries, and risk factors JAMA 310 6 2013 591 608 23842577 10.1001/jama.2013.13805 PMC5436627 6 Beckerman D. Esparza M. Lee S.I. Cost analysis of single-level lumbar fusions Global Spine J 10 1 2020 39 46 32002348 10.1177/2192568219853251 PMC6963351 7 Martin B.I. Deyo R.A. Mirza S.K. Expenditures and health status among adults with back and neck problems JAMA 299 2008 656 664 18270354 10.1001/jama.299.6.656 8 Cram P. Lu X. Kaboli P.J. Clinical characteristics and outcomes of Medicare patients undergoing total hip arthroplasty, 1991-2008 JAMA 305 2011 1560e7 21505134 10.1001/jama.2011.478 PMC3108186 9 Gholson J.J. Pugely A.J. Bedard N.A. Duchman K.R. Anthony C.A. Callaghan J.J. Can we predict discharge status after total joint arthroplasty? A calculator to predict home discharge JOA 31 2016 2705 2709 10.1016/j.arth.2016.08.010 27663191 10 Zeng C. Koonce R.C. Tavel H.M. Preoperative predictors for discharge to post-acute care facilities after total knee arthroplasty JOA 37 2022 31 38 10.1016/j.arth.2021.09.019 34619305 11 Iorio R. Strategies and tactics for successful implementation of bundled payments: bundled payment for care improvement at a large, urban, academic medical center J Arthroplasty 30 3 2015 349 25680447 10.1016/j.arth.2014.12.031 12 Bozic K.J. Ward L. Vail T.P. Bundled payments in total joint arthroplasty: targeting opportunities for quality improvement and cost reduction Clin Orthop Relat Res 472 1 2014 188 23649225 10.1007/s11999-013-3034-3 PMC3889448 13 Ogink P.T. Karhade A.V. Thio Q.C. Predicting discharge placement after elective surgery for lumbar spinal stenosis using machine learning methods Eur Spine J 28 2019 1433 1440 30941521 10.1007/s00586-019-05928-z 14 Peace A.J. Srivastaava A.K. Willson S.E. Telehowski P.M. Wodark J.A. Atkinson T.S. Why do patients choose skilled nursing faciliites after total hip and knee arthroplasty? JOA 38 2023 2556 2560 10.1016/j.arth.2023.05.080 37286060 15 Rosman M., Rachminov O., Segal O., Segal G. (2015) Prolonged patients’ In-hospital waiting period after discharge eligibility is associated with increased risk of infection, morbidity and mortality: a retrospective cohort analysis. BMC Health Serv Res 15:1–5. 10.1186/s12913-015-0929-6 PMC4480441 26108373 16 Rojas-García A. Turner S. Pizzo E. Impact and experiences of delayed discharge: a mixed-studies systematic review Health Expect 21 2018 41 56 10.1111/hex.12619 28898930 PMC5750749 17 Goltz D.E. Ryan S.P. Attarina D.E. Jiranke W.A. Bolognesi M.P. Seyler T.M A preoperative risk prediction tool for discharge to a skilled nursing or rehabilitation facility after total joint arthroplasty JOA 36 2021 1212 1219 10.1016/j.arth.2020.10.038 33328134 18 Hagan M.J. Sastry R.A. Feler J. Neighborhood-level socioeconomic status, extended length of stay and discharge disposition following elective lumbar spine surgery NASSJ 12 2022 100187 10.1016/j.xnsj.2022.100187 PMC9763740 36561892 19 Malik A.T. Jain N. Yu E. Kim J. Khan S.N. Discharge to skilled-care or rehabilitation following elective anterior cervical discectomy and fusion increases the risk of 30-day readmission and post-discharge complications J Spine Surg; 4 2 2018 264 273 30069517 10.21037/jss.2018.05.25 PMC6046335 20 Solomito M.J. Kostyun R.O. Dzurec L. Makanji H.M. Mental health rather than Mental disorders as a predictor of immediate postoperative recovery following elective lumbar fusion: using the PROMIS-10 global Mental health T-score Spine 50 3 2024 E46 E52 38949247 10.1097/BRS.0000000000005083 21 Kostyun R.O. Hackett A. Lucchio P. Witmer D.K. Solomito M.J. Positive deviance and exploring the role of mental health on early postoperative recovery after total hip arthroplasty: a retrospective analysis using the PROMIS-10 global health J Am Acad Orthop Surg 2024 10.5435/JAAOS-D-23-0123 38739867 22 Solomito M.J. Kostyun R.O. Makanji H. The PROMIS-10 mental health T-score an independent predictor of recovery for up to 1 year following elective lumbar spine fusion Spine 2024 10.1097/BRS.0000000000005103 39034689 23 PROMIS ® score cut points [Internet]. HealthMeasures; 2023 [cited 2024 Jun 06]. Available from: https://www.healthmeasures.net/score-and-interpret/interpret-scores/promis/promis-score-cut-points 24 Hays R.D. Bjorner J.B. Revicki D.A. Spritzer K.L. Cella D. Development of physical and mental health summary scores from the patient-reported outcomes measurement information system (PROMIS) global items Quality of Life Research 18 2009 873 880 19543809 10.1007/s11136-009-9496-9 PMC2724630 25 Dauty M. Schmitt X. Menu P. Rousseau B. Dubois C. Using the risk Assessment and predictor Tool (RAPT) for patients after total knee replacement surgery Ann Phys Rehab Med 55 1 2012 4 15 10.1016/j.rehab.2011.10.006 22177789 26 Glauser G. Piazza M. Berger I. The risk Assessment and Prediction tool (RAPT) for discharge planning in a posterior lumbar fusion population Neurosurgery 86 2 2020 E140 E146 31599332 10.1093/neuros/nyz419 27 Sconza C. Respizzi S. Grappiolo G. Monticone M. The Risk Assessment and Prediction Tool (RAPT) after hip and knee replacement: a systematic review Joints 7 02 2019 041 045 10.1055/s-0039-1693459 PMC6930846 31879730 28 Siracuse B.L. Chamberlain R.S. A preoperative scale for determining surgical readmission risk after total hip replacement JAMA Surg 151 8 2016 701 709 26963290 10.1001/jamasurg.2016.0020 29 Ponzio D.Y. Park G.A. Bhat S.B. Purtill J.J. Can we reduce the utilization of home-visiting nurse services after primary total joint arthroplasty? JOA 31 2016 S50 S53 10.1016/j.arth.2016.02.078 27113944 FDA device/drug status: Not applicable. Author disclosures: MJS: HM: JE: ",
  "metadata": {
    "Title of this paper": "Can we reduce the utilization of home-visiting nurse services after primary total joint arthroplasty?",
    "Journal it was published in:": "North American Spine Society Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483646/"
  }
}