{
  "title": "Paper_1068",
  "abstract": "pmc Cell Rep Cell Rep 319 nihpa Cell reports 2211-1247 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12478994 PMC12478994.1 12478994 12478994 NIHMS2107265 40742812 10.1016/j.celrep.2025.116070 NIHMS2107265 NIHPA2107265 1 Article Cathartocytosis: Jettisoning of cellular material during reprogramming of differentiated cells Brown Jeffrey W. 1 6 * Lin Xiaobo 1 Nicolazzi Gabriel Anthony 1 Liu Xuemei 1 Nguyen Thanh 2 3 Radyk Megan D. 1 4 Burclaff Joseph 1 5 Mills Jason C. 2 * 1 2 3 4 5 6 AUTHOR CONTRIBUTIONS Study concept and design, J.W.B., X. Lin, and J.C.M.; data acquisition and analysis, J.W.B., X. Lin, X. Liu, G.A.N., T.N., M.D.R., and J.B.; drafting the manuscript, J.W.B. and J.C.M.; revisions to the manuscript, J.W.B., X.L., G.A.N., T.N., M.D.R., J.B., and J.C.M. * brownjw@wustl.edu jason.mills@bcm.edu 26 8 2025 30 7 2025 44 8 497744 116070 116070 14 09 2025 29 09 2025 30 09 2025 01 10 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license ( http://creativecommons.org/licenses/by/4.0/ Cathartocytosis: Jettisoning of Unwanted Material during Cellular Reprogramming 5 2 2025 2024.06.11.598489 bioRxiv PMC11195262 38915707 SUMMARY Injury causes differentiated cells to undergo massive reprogramming to become proliferative and repair tissue via paligenosis. Gastric chief cells use paligenosis to reprogram into progenitor-like spasmolytic-polypeptide-expressing metaplasia (SPEM) cells. Stage 1 of paligenosis is the downscaling of mature cell architecture via a process involving lysosomes. Here, we notice that sulfated glycoproteins are not only digested during paligenosis but also excreted into the gland. Various genetic and pharmacological approaches show that endoplasmic reticulum membranes and secretory granule cargo are also excreted and that the process proceeds in parallel with but is mechanistically independent of autophagy. Three-dimensional light and electron microscopy demonstrated that excretion occurs via unique, complex, multi-chambered invaginations of the apical plasma membrane. As this lysosome-independent cell cleansing process does not seem to have been priorly described, we termed it “cathartocytosis.” Cathartocytosis allows a cell to rapidly eject excess material without waiting for autophagic and lysosomal digestion, providing for efficient cellular downscaling. Graphical Abstract  In brief Cellular plasticity, which involves massive changes to a cell’s architecture and organellar organization, can be harnessed following injury to repair damaged tissue. Brown et al. describe cathartocytosis, a process that large, differentiated cells can use to rapidly downscale their cellular machinery. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION When an injury causes the loss of mature cells in tissues with constitutively active, multipotent stem cells, the tissue can be repaired by increasing stem cell proliferation and differentiation, thereby replacing both the lost cell mass and maintaining the stem cell pool. 1 2 3 4 Briefly, during the response to injury, a cell undergoing paligenosis tunes down mTORC1 activity and massively upregulates autodegradative machinery, characterized by expanded lysosome activity and induction of autophagy (stage 1). 5 6 7 8 9 13 14 15 16 20 20 23 Here, we track the subcellular distribution and movement of both the zymogenic granules and the endoplasmic reticulum (ER) as the gastric chief cells downscale their cellular machinery en route to metaplasia. We show that these two organellar compartments, which constitute the vast majority of the gastric chief cell cytoplasm, are—as might have been predicted based on previous work—routed to autophagic degradation in RAB7 + + RESULTS Distribution of sulfated glycosylation epitopes during paligenosis We first wanted to better characterize our tools for assessing glycans in metaplasia, focusing on the antibody Das-1, which has been used to stage oncogenic transformation in the foregut (i.e., stomach, esophagus, and pancreas) and which we have previously shown recognizes 3ʹ-sulfo-Le A/C Figure S1 20 24 Figure S2 We next sought to determine how sulfated glycoprotein expression changes during injury-induced metaplasia. The injection of high doses of tamoxifen causes a characteristic, reversible injury pattern in the gastric epithelium marked by the loss of acid-pumping parietal cells and the reprogramming of chief cells into a metaplastic lineage. The effects of tamoxifen are independent of estrogen modulation and occur in both sexes. 25 27 2 4 5 Figure S3 human 24 Figures 1A S2I Figures S2H S2J The first stage of paligenosis lasts up to 24 h and involves massive upregulation of autophagic and lysosomal structures as cells remodel their secretory apparatus. We noted some relocalization basally (i.e., closer to the nucleus) of Das-1-labeled vesicles by 8 h ( Figure 1B Figure S3 Figure 1C Figure 1D Extrusion of cellular material and organelles during downscaling in paligenosis To better understand how sulfated glycoproteins were relocalizing during paligenosis, we established some tools to follow organellar changes. A differentiated gastric chief cell is characterized by a basal, globoid nucleus surrounded by an abundant, tightly packed lamellar rough ER (rER) with an apical collection of large secretory granules ( Figures 1A 1E 2A S4 S5 Figures 1E 1H S4 Figure S5 Azure A is most commonly used in thin liquid chromatography to identify sulfatides (sulfated glycolipids) 28 29 30 Figures 1E 1H S4 All techniques yielded consistent patterns at homeostasis: dense staining in the base of the cell that became more muted apically where zymogenic granules filled most of the cytoplasm, appearing as punched-out holes in a more lattice-like ER pattern ( Figures 1 2A S4 S5 Figures 1F S4B S4F Figures 1G 1H S4 S5 Figure 1I Ultrastructural changes in the apical membrane revealed by FIB-SEM We chose to analyze the 24 h time point in our FIB-SEM studies of the chief cell three-dimensional architecture because (1) at this point, the cells are completing their massive downscaling 4 5 Figures 1C 1G S4C S4G Figures 2A 2B Figure 2B Figures 3C 3E 5 Figure 2C Segmentation (i.e., three-dimensional reconstruction) of the cell beginning at the slice depicted in Figure 2C Figures 2D 2E Video S1 Figure 2F Video S2 Light and confocal microscopy corroborate FIB-SEM ultrastructure We next studied the apical invaginations at light-microscopic resolution using the lectin peanut agglutinin (PNA), which specifically highlights the chief cell apical plasma membrane ( Figure 3A 31 33 Figures 3B 3E Figures 3C 3D Figures 1C 1D 1G 1H S4 Figure 2B Figure S5H 2 34 36 The excretory process is distinct from autophagy We next investigated whether lysosomes were involved in the excretory process at the apical membrane. We tracked late LE/Ly structures by immunostaining for the small GTPase RAB7 and the intrinsic membrane glycoprotein LAMP2. At homeostasis, RAB7 marked infrequent, small punctae distributed throughout the cytoplasm ( Figures S6A 4A Figures S6C S6D 5A Figure 4B In other cell types, large autophagic vesicles have been described as secreting their contents via direct fusion with the apical membrane (secretory autophagy 37 Figure 5A Epg5 38 39 Epg5 −/− Figures 4B 4D 4E 4F 5A 5B 5C Figure S7 Epg5 −/− Figures 4A 4D 5D 6A 6D In many Epg5 −/− Figures 4F 5D Figure 4G Figure 5B To summarize the lysosome and plasma membrane trafficking results, we could detect abundant LAMP2 and RAB7 localization to the apical membrane in Epg5 −/− Figures 4A 4F 5 S8 Figure 4G Epg5 −/− Figures 5E 5H Epg5 −/− Hydroxychloroquine does not block excretion of sulfomucins We investigated how inhibition of lysosomal function would impact the expression and extrusion of proteins with sulfated mucins. We blocked lysosomal function pharmacologically with hydroxychloroquine, which inhibits vesicular acidification, rendering the lysosomal degradation proteins non-functional, and genetically using mice null for Gnptab Treatment with hydroxychloroquine alone significantly reduced the size and apparent number of Das-1-labeled glands at homeostasis ( Figures S9 6E Figures 6B 6E Figure 6B Figures 6F 6G Figure S10 FIB-SEM demonstrates that the apical invaginations have phagophore-like activity In further characterizing the apical membrane deformations occurring during stage 1 of paligenosis, we observed phagophore (cup)-shaped structures emanating from the apical invaginations ( Figure 7A Video S3 Figure 7B Figure 7B Figure 7B Video S4 DISCUSSION Using a synchronous in vivo Figure 7 2 4 5 Cellular plasticity is paramount for the resurrection of the cell census and maintenance of barrier function following substantial tissue injury. 40 41 Our group has previously described a stereotyped series of cellular-molecular events that occur in differentiated cells following injury to license these cells to proliferate. This process, called paligenosis, 4 An essential early step in paligenosis is the upregulation of the transcription factor Atf3 Rab7 5 Figure 7C 36 The cytoplasmic compartment of the gastric chief cells is mostly occupied by an expansive rER and zymogenic granules localized apically to the nucleus ( Figures 2A S5 42 Figures 7B Video S4 Figure 7 Figure 7B Video S4 In the cases where we observed transitional structures, the secreted material appeared to be released following docking, with phagophore-shaped structures arising from the apical membrane invaginations independent of a multivesicular body ( Figures 7A 7B Video S4 graphical abstract 42 37 43 Epg5 During times of profound exocytosis, which occurs in processes like merocrine secretion, limiting the excessive incorporation of the membrane to the apices of the cell is of paramount importance to maintaining homeostatic cell shape and size. For example, in Drosophila 44 Drosophila The excretory mechanism of cathartocytosis is distinct from merocrine secretion for a number of other reasons. The elaborate, stable apical invagination network that develops to jettison the material is not a feature of merocrine secretion. Further, the magnitude of material released from the cell (in conjunction with autophagy) results in a significant reduction in cell size ( Figure S3 At a cellular level, the function of EPG-5 was originally identified in a C. elegans 45 EPG5 39 Figures 5 6 S6 S7 Epg5 37 Epg5 EPG5 EPG5 −/− The reason why hydroxychloroquine results in smaller zymogenic secretory granules is not clear at this time ( Figure S9 46 47 48 Figure 6 Figure S10 Figure 6E The fact that sulfated glycoproteins (likely mucins; Figure S2 20 24 24 49 19 20 We show here that murine zymogenic granules contain 3ʹ-sulfo-Le A/C Figure 1 H. pylori 50 52 51 53 54 H. pylori 55 H. pylori H. pylori 56 59 In addition to binding H. pylori A/C 20 A 60 65 A/C 66 67 Overall, here we describe the membrane-shuttling trajectories used by injured cells to downscale their cellular machinery en route to the metaplastic phenotype. Our data reinforce that canonical autophagy serves an important role but also uncover a previously undescribed cellular process that we call cathartocytosis and that bestows excretory capacity to the apical membrane, which may help cells not only downscale to a smaller, progenitor-like state during paligenosis and regeneration but may also serve as an anti-microbial mechanism or immunomodulatory function. In the future, we hope to explore if cathartocytosis is common to, and restricted to, paligenosis (which is broadly conserved across organs and species) and/or if it also occurs in injured cells that are not undergoing massive activation of cell plasticity. Limitations of the study This study is limited in that we do not yet know the cellular and molecular mechanisms underpinning cathartocytosis. For example, as discussed above, cellular downscaling is decreased by the blockade of lysosomal function, but cathartocytosis, (sulfomucin extrusion) from cells is decreased but not abrogated. This suggests that lysosomes are not needed for cathartocytosis; however, there are other interpretations. The current study is also limited to cathartocytosis during paligenosis in gastric chief cells. We do not yet know if cathartocytosis is universal to paligenosis. It seems highly unlikely that this cellular process, however, would have evolved for only a single cell type. But we are limited in our models to study paligenosis, with gastric chief cell injury being among the best for its synchronicity and rapidity. A boon for the field would be the development of in vitro in vitro 68 76 RESOURCE AVAILABILITY Lead contact Further information and request for resources and reagents should be directed to and will be fulfilled by lead contact, Jeffrey W. Brown ( brownjw@wustl.edu Materials availability All mouse lines and materials used in this study were provided or purchased from the mentioned companies or researchers. This study did not generate any new or unique reagents. If the mouse lines are still in the investigator’s colony, we are happy to share them. Data and code availability Data are available upon request. The paper does not report original code. Any additional information or data are available from the lead contact upon request. STAR★METHODS EXPERIMENTAL MODEL AND STUDY PARTICIPANT DETAILS Animals All experiments using animals followed protocols approved by the Washington University in St. Louis, School of Medicine Institutional Animal Care and Use Committee. WT C57BL/6 mice were purchased from Jackson Laboratories (Bar Harbor, ME). Epg5 −/− Epg5 +/ 77 79 Gnptab −/− Gnptab +/− Tamoxifen powder (Toronto Research Chemicals) was initially solubilized in 100% ethanol via sonification after which it was emulsified in sunflower oil (Sigma-Aldrich) at a 9 Oil:1 EtOH ratio. 80 25 27 METHOD DETAILS Imaging and tissue analysis Following anesthetizing with isoflurane and cervical dislocation, murine stomachs were excised, flushed with phosphate buffered saline and fixed overnight with 10% formalin. They were washed and equilibrated in 70% ethanol for several hours prior to embedding in 3% agar and routine paraffin processing. Sections (5–7 μM) were prepared for immunohistochemistry and/or immunofluorescence by deparaffinization using Histoclear and an alcohol series for rehydration. After which antigen retrieval was performed in 10 mM citrate buffer, pH 6.0 in a pressure cooker. Tissue was blocked with 2% BSA and 0.05% Triton X-100. Primary and secondary antibodies were diluted in 2% BSA and 0.05% Triton X-100. Vector ABC Elite kit was used for immunohistochemistry. Immunohistochemistry slides were mounted with Permount and immunofluorescence with Prolong Gold. Brightfield images were taken on either a Nanozoomer (Hamamatsu 2.0-HT System) for quantitation or Olympus BX43 light microscope. Confocal images were obtained on a Zeiss LSM880 confocal microscope. Azure A staining Slides of paraffin embedded tissue were dewaxed and rehydrated with an ethanol series to 30%. Antigen retrieval must not be performed as this results in loss of staining. Slides were then stained with 0.1% Azure A Chloride in 30% ethanol for 1 min. Slides were then washed in water. Placing slides in citric acid/sodium phosphate buffer, pH 4 results in royal blue nuclear staining and dark blue cytoplasmic staining. The slides were then transferred to 95% ethanol and stained with Eosin Y. The slides were subsequently mounted with permount. Focused-ion beam scanning electron microscopy The tissue fixation and acquisition parameters have been previously described. 5 81 82 83 84 Western blot Western blot samples were prepared using ∼30 μg of protein in standard SDS-PAGE lammeli buffer with 5% β-mercaptoethanol. Samples were heated to 70°C for 10 min prior to running through NuPAGE precast gels. Protein was transferred in NuPAGE transfer buffer containing 20% methanol to nitrocellulose which was blocked using 5% BSA in PBS. Nitrocellulose membrane was incubated with primary antibodies in blocking buffer overnight at 4°C. Membranes were washed with PBS and then incubated in appropriate secondary antibodies at 1:10,000 dilution in blocking buffer. After extensively washing, membrane was imaged using LiCOR Odyssey. Dot blot Sample was applied to nitrocellulose using a BIORAD vacuum apparatus, after which the nitrocellulose was stained and imaged in an identical fashion to western blots. Chloroform extraction Flowchart is displayed in Figure S2D Deglycosylation Mucins in solution were treated with O-Glycosidase, Neuraminidase, or PNGaseF according to manufacturer’s/New England Biolab’s instructions. Slides of paraffin embedded tissue were dewaxed and rehydrated, followed by antigen retrieval as described above. To remove O-linked glycans the sections were incubated in 0.1N NaOH for 2 h at 20C (Longer incubations or higher temperatures result in tissue being dislodged). The slides were then transferred to phosphate buffered saline and assayed as described above. N-linked glycans were removed by treating with PNGaseF for 2 h at 37C. Slides were also treated with O-glycosidase and neuraminidase for 2 h at 37C. Fundic chief cell size 2-Dimensional area measurements of chief cells were made by analyzing 40x micrographs of hematoxylin and eosin stained sections. Cells were outlined manually and area calculated with ImageJ/FIJI. 83 QUANTIFICATION AND STATISTICAL ANALYSIS All statistical details can be found in the figure legends. Supplementary Material 1 2 3 4 5 Supplemental information can be found online at https://doi.org/10.1016/j.celrep.2025.116070 ACKNOWLEDGMENTS J.W.B. is supported by NIH K08 DK132496; the Department of Defense through the PRCRP program under award no. W81XWH-20-1-0630; American Gastroenterological Association AGA2021-5101; NIH R21 AI156236; and the Advanced Imaging and Tissue Processing Core (AITAC) of the Washington University Digestive Disease Research Core Center NIH P30 DK052574. We thank Stuart Kornfeld for providing the Gnptab −/− Epg5 −/− DECLARATION OF INTERESTS The authors declare no competing interests. REFERENCES 1. Meyer AR Brown ME McGrath PS Dempsey PJ 2022 Injury-Induced Cellular Plasticity Drives Intestinal Regeneration. Cell. Mol. Gastroenterol Hepatol 13 843 856 10.1016/j.jcmgh.2021.12.005 PMC8803615 34915204 2. Brown JW Cho CJ Mills JC 2022 Paligenosis: Cellular Remodeling During Tissue Repair Annu. Rev. Physiol 84 461 483 10.1146/annurev-physiol-061121-035954 34705482 PMC8831470 3. Cho CJ Brown JW Mills JC 2024 Origins of cancer: ain’t it just mature cells misbehaving? EMBO J 43 2530 2551 10.1038/s44318-024-00099-0 38773319 PMC11217308 4. Willet SG Lewis MA Miao ZF Liu D Radyk MD Cunningham RL Burclaff J Sibbel G Lo HYG Blanc V 2018 Regenerative proliferation of differentiated cells by mTORC1-dependent paligenosis EMBO J 37 e98311 10.15252/embj.201798311 29467218 PMC5881627 5. Radyk MD Spatz LB Peña BL Brown JW Burclaff J Cho CJ Kefalov Y Shih CC Fitzpatrick JA Mills JC 2021 ATF3 induces RAB7 to govern autodegradation in paligenosis, a conserved cell plasticity program EMBO Rep 22 e51806 10.15252/embr.202051806 34309175 PMC8419698 6. Willet SG Thanintorn N McNeill H Huh SH Ornitz DM Huh WJ Hoft SG DiPaolo RJ Mills JC 2023 SOX9 governs gastric mucous neck cell identity and is required for injury-induced metaplasia Cell. Mol. Gastroenterol. Hepatol 16 325 339 10.1016/j.jcmgh.2023.05.009 37270061 PMC10444955 7. Miao ZF Sun JX Adkins-Threats M Pang MJ Zhao JH Wang X Tang KW Wang ZN Mills JC 2021 DDIT4 Licenses Only Healthy Cells to Proliferate During Injury-induced Metaplasia Gastroenterology 160 260 271 10.1053/j.gastro.2020.09.016 32956680 PMC7857017 8. Miao ZF Sun JX Huang XZ Bai S Pang MJ Li JY Chen HY Tong QY Ye SY Wang XY 2024 Metaplastic regeneration in the mouse stomach requires a reactive oxygen species pathway Dev. Cell 59 1175 1191 10.1016/j.devcel.2024.03.002 38521055 9. Schmidt PH Lee JR Joshi V Playford RJ Poulsom R Wright NA Goldenring JR 1999 Identification of a metaplastic cell lineage associated with human gastric adenocarcinoma Lab. Invest 79 639 646 10378506 PMC12398956 10. Wang TC Goldenring JR Dangler C Ito S Mueller A Jeon WK Koh TJ Fox JG 1998 Mice lacking secretory phospholipase A2 show altered apoptosis and differentiation with Helicobacter felis infection Gastroenterology 114 675 689 10.1016/s0016-5085(98)70581-5 9516388 11. Yamaguchi H Goldenring JR Kaminishi M Lee JR 2002 Association of spasmolytic polypeptide-expressing metaplasia with carcinogen administration and oxyntic atrophy in rats Lab. Invest 82 1045 1052 10.1097/01.lab.0000022225.45996.21 12177243 12. Yamaguchi H Goldenring JR Kaminishi M Lee JR 2002 Identification of spasmolytic polypeptide expressing metaplasia (SPEM) in remnant gastric cancer and surveillance postgastrectomy biopsies Dig. Dis. Sci 47 573 578 10.1023/a:1017920220149 11911345 13. Nomura S Baxter T Yamaguchi H Leys C Vartapetian AB Fox JG Lee JR Wang TC Goldenring JR 2004 Spasmolytic polypeptide expressing metaplasia to preneoplasia in H. felis-infected mice Gastroenterology 127 582 594 10.1053/j.gastro.2004.05.029 15300590 14. Goldenring JR Mills JC 2022 Cellular Plasticity, Reprogramming, and Regeneration: Metaplasia in the Stomach and Beyond Gastroenterology 162 415 430 10.1053/j.gastro.2021.10.036 34728185 PMC8792220 15. Goldenring JR 2018 Pyloric metaplasia, pseudopyloric metaplasia, ulcer-associated cell lineage and spasmolytic polypeptide-expressing metaplasia: reparative lineages in the gastrointestinal mucosa J. Pathol 245 132 137 10.1002/path.5066 29508389 PMC6026529 16. Hakkinen I Jarvi O Gronroos J 1968 Sulphoglycoprotein antigens in the human alimentary canal and gastric cancer. An immunohistological study Int. J. Cancer 3 572 581 10.1002/ijc.2910030506 5724523 17. Hakkinen I Viikari S 1969 Occurrence of fetal sulphoglycoprotein antigen in the gastric juice of patients with gastric diseases Ann. Surg 169 277 281 10.1097/00000658-196902000-00016 4974368 PMC1387321 18. Piazuelo MB Haque S Delgado A Du JX Rodriguez F Correa P 2004 Phenotypic differences between esophageal and gastric intestinal metaplasia Mod. Pathol 17 62 74 10.1038/sj.modpathol.3800016 14631367 19. Das KK Brown JW Fernandez Del-Castillo C Huynh T Mills JC Matsuda Y Das KM Mino-Kenudson M 2021 mAb Das-1 Identifies Pancreatic Ductal Adenocarcinoma and High-grade Pancreatic Intraepithelial Neoplasia with High Accuracy Hum. Pathol 10.1016/j.humpath.2021.01.003 PMC8817765 33524436 20. Das KK Brown JW 2023 3ʹ-sulfated Lewis(A/C): An oncofetal epitope associated with metaplastic and oncogenic plasticity of the gastrointestinal foregut Front. Cell Dev. Biol 11 1089028 10.3389/fcell.2023.1089028 36866273 PMC9971977 21. Das KK Xiao H Geng X Fernandez-Del-Castillo C Morales-Oyarvide V Daglilar E Forcione DG Bounds BC Brugge WR Pitman MB 2014 mAb Das-1 is specific for high-risk and malignant intraductal papillary mucinous neoplasm (IPMN) Gut 63 1626 1634 10.1136/gutjnl-2013-306219 PMC5614500 24277729 22. Das KK Geng X Brown JW Morales-Oyarvide V Huynh T Pergolini I Pitman MB Ferrone C Al Efishat M Haviland D 2019 Cross Validation of the Monoclonal Antibody Das-1 in Identification of High-Risk Mucinous Pancreatic Cystic Lesions Gastroenterology 157 720 730 10.1053/j.gastro.2019.05.014 31175863 PMC6707850 23. Shah SC Gawron AJ Mustafa RA Piazuelo MB 2020 Histologic Subtyping of Gastric Intestinal Metaplasia: Overview and Considerations for Clinical Practice Gastroenterology 158 745 750 10.1053/j.gastro.2019.12.004 31887261 PMC7302270 24. Brown JW Das KK Kalas V Das KM Mills JC 2021 mAb Das-1 recognizes 3ʹ-Sulfated Lewis A/C, which is aberrantly expressed during metaplastic and oncogenic transformation of several gastrointestinal Epithelia PLoS One 16 e0261082 10.1371/journal.pone.0261082 34910746 PMC8673611 25. Huh WJ Khurana SS Geahlen JH Kohli K Waller RA Mills JC 2012 Tamoxifen induces rapid, reversible atrophy, and metaplasia in mouse stomach Gastroenterology 142 21 24 10.1053/j.gastro.2011.09.050 22001866 PMC3708546 26. Saenz JB Mills JC 2018 Acid and the basis for cellular plasticity and reprogramming in gastric repair and cancer Nat. Rev. Gastroenterol. Hepatol 15 257 273 10.1038/nrgastro.2018.5 29463907 PMC6016373 27. Keeley TM Horita N Samuelson LC 2019 Tamoxifen-Induced Gastric Injury: Effects of Dose and Method of Administration Cell. Mol. Gastroenterol. Hepatol 8 365 367 10.1016/j.jcmgh.2019.06.007 31233898 PMC6713893 28. Kean EL 1968 Rapid, sensitive spectrophotometric method for quantitative determination of sulfatides J. Lipid Res 9 319 327 5646183 29. Berman ER Vered J Bach G 1971 A reliable spot test for mucopolysaccharidoses Clin. Chem 17 886 890 4255193 30. Kiernan JA 2000 Formaldehyde, Formalin, Paraformaldehyde and Glutaraldehyde: What they Are and What They Do Microscopy Today 8 8 13 31. Falk P Roth KA Gordon JI 1994 Lectins are sensitive tools for defining the differentiation programs of mouse gut epithelial cell lineages Am. J. Physiol 266 G987 G1003 10.1152/ajpgi.1994.266.6.G987 8023947 32. Okamoto CT Forte JG 1988 Distribution of lectin-binding sites in oxyntic and chief cells of isolated rabbit gastric glands Gastroenterology 95 334 342 10.1016/0016-5085(88)90488-x 3134267 33. Gomez-Santos L Alonso E Crende O Ibarretxe G Madrid JF Saez FJ 2021 Identification of sugar moieties in chief cells of the rat fundic gastric glands Anat. Sci. Int 96 221 230 10.1007/s12565-020-00578-4 33030698 34. Nozaki K Ogawa M Williams JA Lafleur BJ Ng V Drapkin RI Mills JC Konieczny SF Nomura S Goldenring JR 2008 A molecular signature of gastric metaplasia arising in response to acute parietal cell loss Gastroenterology 134 511 522 10.1053/j.gastro.2007.11.058 18242217 PMC2857727 35. Ma Z Lytle NK Chen B Jyotsana N Novak SW Cho CJ Caplan L Ben-Levy O Neininger AC Burnette DT 2022 Single-Cell Transcriptomics Reveals a Conserved Metaplasia Program in Pancreatic Injury Gastroenterology 162 604 620 10.1053/j.gastro.2021.10.027 34695382 PMC8792222 36. Goldenring JR Ray GS Coffey RJ Meunier PC Haley PJ Barnes TB Car BD 2000 Reversible drug-induced oxyntic atrophy in rats Gastroenterology 118 1080 1093 10.1016/s0016-5085(00)70361-1 10833483 37. van Meel E Boonen M Zhao H Oorschot V Ross FP Kornfeld S Klumperman J 2011 Disruption of the Man-6-P targeting pathway in mice impairs osteoclast secretory lysosome biogenesis Traffic 12 912 924 10.1111/j.1600-0854.2011.01203.x 21466643 PMC3115509 38. Zhao H Zhao YG Wang X Xu L Miao L Feng D Chen Q Kovács AL Fan D Zhang H 2013 Mice deficient in Epg5 exhibit selective neuronal vulnerability to degeneration J Cell Biol 200 731 741 10.1083/jcb.201211014 23479740 PMC3601354 39. Wang Z Miao G Xue X Guo X Yuan C Wang Z Zhang G Chen Y Feng D Hu J Zhang H 2016 The Vici Syndrome Protein EPG5 Is a Rab7 Effector that Determines the Fusion Specificity of Autophagosomes with Late Endosomes/Lysosomes Mol. Cell 63 781 795 10.1016/j.molcel.2016.08.021 27588602 40. Zuo L Kuo WT Turner JR 2020 Tight Junctions as Targets and Effectors of Mucosal Immune Homeostasis Cell. Mol. Gastroenterol. Hepatol 10 327 340 10.1016/j.jcmgh.2020.04.001 32304780 PMC7326733 41. Horowitz A Chanez-Paredes SD Haest X Turner JR 2023 Paracellular permeability and tight junction regulation in gut health and disease Nat. Rev. Gastroenterol. Hepatol 20 417 432 10.1038/s41575-023-00766-3 37186118 PMC10127193 42. Jeppesen DK Zhang Q Franklin JL Coffey RJ 2023 Extracellular vesicles and nanoparticles: emerging complexities Trends Cell Biol 33 667 681 10.1016/j.tcb.2023.01.002 36737375 PMC10363204 43. Maricchiolo E Panfili E Pompa A De Marchis F Bellucci M Pallotta MT 2022 Unconventional Pathways of Protein Secretion: Mammals vs. Plants. Front Cell Dev. Biol 10 895853 10.3389/fcell.2022.895853 PMC9096121 35573696 44. Kamalesh K Scher N Biton T Schejter ED Shilo BZ Avinoam O 2021 Exocytosis by vesicle crumpling maintains apical membrane homeostasis during exocrine secretion Dev. Cell 56 1603 1616 10.1016/j.devcel.2021.05.004 34102104 PMC8191493 45. Tian Y Li Z Hu W Ren H Tian E Zhao Y Lu Q Huang X Yang P Li X 2010 C. elegans screen identifies autophagy genes specific to multicellular organisms Cell 141 1042 1055 10.1016/j.cell.2010.04.034 20550938 46. Nirk EL Reggiori F Mauthe M 2020 Hydroxychloroquine in rheumatic autoimmune disorders and beyond EMBO Mol. Med 12 e12476 10.15252/emmm.202012476 32715647 PMC7411564 47. Mauthe M Orhon I Rocchi C Zhou X Luhr M Hijlkema KJ Coppes RP Engedal N Mari M Reggiori F 2018 Chloroquine inhibits autophagic flux by decreasing autophagosome-lysosome fusion Autophagy 14 1435 1455 10.1080/15548627.2018.1474314 29940786 PMC6103682 48. Cho CJ Park D Mills JC 2022 ELAPOR1 is a secretory granule maturation-promoting factor that is lost during paligenosis Am. J. Physiol. Gastrointest. Liver Physiol 322 G49 G65 10.1152/ajpgi.00246.2021 34816763 PMC8698547 49. Bodger K Campbell F Rhodes JM 2003 Detection of sulfated glycoproteins in intestinal metaplasia: a comparison of traditional mucin staining with immunohistochemistry for the sulfo-Lewis(a) carbohydrate epitope J. Clin. Pathol 56 703 708 10.1136/jcp.56.9.703 12944557 PMC1770063 50. Hase K Murakami M Iimura M Cole SP Horibe Y Ohtake T Obonyo M Gallo RL Eckmann L Kagnoff MF 2003 Expression of LL-37 by human gastric epithelial cells as a potential host defense mechanism against Helicobacter pylori Gastroenterology 125 1613 1625 10.1053/j.gastro.2003.08.028 14724813 51. Veerman EC Bank CM Namavar F Appelmelk BJ Bolscher JG Nieuw Amerongen AV 1997 Sulfated glycans on oral mucin as receptors for Helicobacter pylori Glycobiology 7 737 743 10.1093/glycob/7.6.737 9376676 52. Nuding S Gersemann M Hosaka Y Konietzny S Schaefer C Beisner J Schroeder BO Ostaff MJ Saigenji K Ott G 2013 Gastric antimicrobial peptides fail to eradicate Helicobacter pylori infection due to selective induction and resistance PLoS One 8 e73867 10.1371/journal.pone.0073867 24040100 PMC3770654 53. Teneberg S Miller-Podraza H Lampert HC Evans DJ Jr. Evans DG Danielsson D Karlsson KA 1997 Carbohydrate binding specificity of the neutrophil-activating protein of Helicobacter pylori J. Biol. Chem 272 19067 19071 10.1074/jbc.272.30.19067 9228091 54. Namavar F Sparrius M Veerman EC Appelmelk BJ Vandenbroucke-Grauls CM 1998 Neutrophil-activating protein mediates adhesion of Helicobacter pylori to sulfated carbohydrates on high-molecular-weight salivary mucin Infect. Immun 66 444 447 10.1128/IAI.66.2.444-447.1998 9453593 PMC107925 55. Satin B Del Giudice G Della Bianca V Dusi S Laudanna C Tonello F Kelleher D Rappuoli R Montecucco C Rossi F 2000 The neutrophil-activating protein (HP-NAP) of Helicobacter pylori is a protective antigen and a major virulence factor J. Exp. Med 191 1467 1476 10.1084/jem.191.9.1467 10790422 PMC2213429 56. Boughan PK Argent RH Body-Malapel M Park JH Ewings KE Bowie AG Ong SJ Cook SJ Sorensen OE Manzo BA 2006 Nucleotide-binding oligomerization domain-1 and epidermal growth factor receptor: critical regulators of beta-defensins during Helicobacter pylori infection J. Biol. Chem 281 11637 11648 10.1074/jbc.M510275200 16513653 57. Otte JM Neumann HM Brand S Schrader H Schmidt WE Schmitz F 2009 Expression of beta-defensin 4 is increased in human gastritis Eur. J. Clin. Invest 39 126 138 10.1111/j.1365-2362.2008.02071.x 19200166 58. Patel SR Smith K Letley DP Cook KW Memon AA Ingram RJM Staples E Backert S Zaitoun AM Atherton JC Robinson K 2013 Helicobacter pylori downregulates expression of human beta-defensin 1 in the gastric mucosa in a type IV secretion-dependent fashion Cell. Microbiol 15 2080 2092 10.1111/cmi.12174 23870035 PMC4028989 59. Sigal M Reinés MDM Müllerke S Fischer C Kapalczynska M Berger H Bakker ERM Mollenkopf HJ Rothenberg ME Wiedenmann B 2019 R-spondin-3 induces secretory, antimicrobial Lgr5 (+) cells in the stomach Nat. Cell Biol 21 812 823 10.1038/s41556-019-0339-9 31235935 60. Galustian C Childs RA Yuen CT Hasegawa A Kiso M Lubineau A Shaw G Feizi T 1997 Valency dependent patterns of binding of human L-selectin toward sialyl and sulfated oligosaccharides of Le(a) and Le(x) types: relevance to anti-adhesion therapeutics Biochemistry 36 5260 5266 10.1021/bi962887a 9136888 61. Yuen CT Bezouska K O’Brien J Stoll M Lemoine R Lubineau A Kiso M Hasegawa A Bockovich NJ Nicolaou KC 1994 Sulfated blood group Lewis(a). A superior oligosaccharide ligand for human E-selectin J. Biol. Chem 269 1595 1598 7507478 62. Yuen CT Lawson AM Chai W Larkin M Stoll MS Stuart AC Sullivan FX Ahern TJ Feizi T 1992 Novel sulfated ligands for the cell adhesion molecule E-selectin revealed by the neoglycolipid technology among O-linked oligosaccharides on an ovarian cystadenoma glycoprotein Biochemistry 31 9126 9131 10.1021/bi00153a003 1382586 63. Green PJ Tamatani T Watanabe T Miyasaka M Hasegawa A Kiso M Yuen CT Stoll MS Feizi T 1992 High affinity binding of the leucocyte adhesion molecule L-selectin to 3ʹ-sulphated-Le(a) and -Le(x) oligosaccharides and the predominance of sulphate in this interaction demonstrated by binding studies with a series of lipid-linked oligosaccharides Biochem. Biophys. Res. Commun 188 244 251 10.1016/0006-291x(92)92376-9 1384480 64. Wang X Hanes MS Cummings RD Woods RJ 2022 Computationally guided conversion of the specificity of E-selectin to mimic that of Siglec-8 Proc. Natl. Acad. Sci. USA 119 e2117743119 10.1073/pnas.2117743119 36191232 PMC9564326 65. Galustian C Lubineau A le Narvor C Kiso M Brown G Feizi T 1999 L-selectin interactions with novel mono- and multisulfated Lewisx sequences in comparison with the potent ligand 3ʹ-sulfated Lewisa J. Biol. Chem 274 18213 18217 10.1074/jbc.274.26.18213 10373422 66. Bloem K Vuist IM van den Berk M Klaver EJ van Die I Knippels LMJ Garssen J García-Vallejo JJ van Vliet SJ van Kooyk Y 2014 DCIR interacts with ligands from both endogenous and pathogenic origin Immunol. Lett 158 33 41 10.1016/j.imlet.2013.11.007 24239607 67. Leteux C Chai W Loveless RW Yuen CT Uhlin-Hansen L Combarnous Y Jankovic M Maric SC Misulovin Z Nussenzweig MC Feizi T 2000 The cysteine-rich domain of the macrophage mannose receptor is a multispecific lectin that recognizes chondroitin sulfates A and B and sulfated oligosaccharides of blood group Lewis(a) and Lewis(x) types in addition to the sulfated N-glycans of lutropin J. Exp. Med 191 1117 1126 10.1084/jem.191.7.1117 10748230 PMC2193175 68. Lee SH Contreras Panta EW Gibbs D Won Y Min J Zhang C Roland JT Hong SH Sohn Y Krystofiak E 2023 Apposition of Fibroblasts With Metaplastic Gastric Cells Promotes Dysplastic Transition Gastroenterology 165 374 390 10.1053/j.gastro.2023.04.038 37196797 PMC10375042 69. Khurana SS Riehl TE Moore BD Fassan M Rugge M Romero-Gallo J Noto J Peek RM Jr. Stenson WF Mills JC 2013 The hyaluronic acid receptor CD44 coordinates normal and metaplastic gastric epithelial progenitor cell proliferation J. Biol. Chem 288 16085 16097 10.1074/jbc.M112.445551 23589310 PMC3668764 70. Bertaux-Skeirik N Wunderlich M Teal E Chakrabarti J Biesiada J Mahe M Sundaram N Gabre J Hawkins J Jian G 2017 CD44 variant isoform 9 emerges in response to injury and contributes to the regeneration of the gastric epithelium J. Pathol 242 463 475 10.1002/path.4918 28497484 PMC5591948 71. Jeong H Lee B Kim KH Cho SY Cho Y Park J Lee Y Oh Y Hwang BR Jang AR 2021 WFDC2 Promotes Spasmolytic Polypeptide-Expressing Metaplasia Through the Up-Regulation of IL33 in Response to Injury Gastroenterology 161 953 967 10.1053/j.gastro.2021.05.058 34116028 PMC8380710 72. De Salvo C Pastorelli L Petersen CP Buttò LF Buela KA Omenetti S Locovei SA Ray S Friedman HR Duijser J 2021 Interleukin 33 Triggers Early Eosinophil-Dependent Events Leading to Metaplasia in a Chronic Model of Gastritis-Prone Mice Gastroenterology 160 302 316 10.1053/j.gastro.2020.09.040 33010253 PMC7755675 73. Meyer AR Engevik AC Madorsky T Belmont E Stier MT Norlander AE Pilkinton MA McDonnell WJ Weis JA Jang B 2020 Group 2 Innate Lymphoid Cells Coordinate Damage Response in the Stomach Gastroenterology 159 2077 2091 10.1053/j.gastro.2020.08.051 32891625 PMC7726005 74. Bockerstett KA Petersen CP Noto CN Kuehm LM Wong CF Ford EL Teague RM Mills JC Goldenring JR DiPaolo RJ 2020 Interleukin 27 Protects From Gastric Atrophy and Metaplasia During Chronic Autoimmune Gastritis Cell. Mol. Gastroenterol. Hepatol 10 561 579 10.1016/j.jcmgh.2020.04.014 32376420 PMC7399182 75. Petersen CP Meyer AR De Salvo C Choi E Schlegel C Petersen A Engevik AC Prasad N Levy SE Peebles RS 2018 A signalling cascade of IL-33 to IL-13 regulates metaplasia in the mouse stomach Gut 67 805 817 10.1136/gutjnl-2016-312779 28196875 PMC5681443 76. Petersen CP Weis VG Nam KT Sousa JF Fingleton B Goldenring JR 2014 Macrophages promote progression of spasmolytic polypeptide-expressing metaplasia after acute loss of parietal cells Gastroenterology 146 1727 1738 10.1053/j.gastro.2014.02.007 24534633 PMC4035414 77. Zhao H Zhao YG Wang X Xu L Miao L Feng D Chen Q Kovács AL Fan D Zhang H 2013 Mice deficient in Epg5 exhibit selective neuronal vulnerability to degeneration J. Cell Biol 200 731 741 10.1083/jcb.201211014 23479740 PMC3601354 78. Zhao YG Zhao H Sun H Zhang H 2013 Role of Epg5 in selective neurodegeneration and Vici syndrome Autophagy 9 1258 1262 10.4161/auto.24856 23674064 PMC3748201 79. Lee S Kalugotla G Ingle H Rodgers R Wu C Wang Y Li Y Yang X Zhang J Borella NR 2022 Intestinal antiviral signaling is controlled by autophagy gene Epg5 independent of the microbiota Autophagy 18 1062 1077 10.1080/15548627.2021.1968607 34520306 PMC9196718 80. Saenz JB Burclaff J Mills JC 2016 Modeling Murine Gastric Metaplasia Through Tamoxifen-Induced Acute Parietal Cell Loss Methods Mol. Biol 1422 329 339 10.1007/978-1-4939-3603-8_28 27246044 PMC5221414 81. Lo HYG Jin RU Sibbel G Liu D Karki A Joens MS Madison BB Zhang B Blanc V Fitzpatrick JAJ 2017 A single transcription factor is sufficient to induce and maintain secretory cell architecture Genes Dev 31 154 171 10.1101/gad.285684.116 28174210 PMC5322730 82. Berg S Kutra D Kroeger T Straehle CN Kausler BX Haubold C Schiegg M Ales J Beier T Rudy M 2019 ilastik: interactive machine learning for (bio)image analysis Nat. Methods 16 1226 1232 10.1038/s41592-019-0582-9 31570887 83. Schindelin J Arganda-Carreras I Frise E Kaynig V Longair M Pietzsch T Preibisch S Rueden C Saalfeld S Schmid B 2012 Fiji: an open-source platform for biological-image analysis Nat. Methods 9 676 682 10.1038/nmeth.2019 22743772 PMC3855844 84. Pettersen EF Goddard TD Huang CC Couch GS Greenblatt DM Meng EC Ferrin TE 2004 UCSF Chimera–a visualization system for exploratory research and analysis J. Comput. Chem 25 1605 1612 10.1002/jcc.20084 15264254 Figure 1. Cellular material is excreted during paligenosis (A–H) Micrographs of the mouse stomach after treatment with vehicle (A and E) and after injury (B and F: 8 h, C and G: 24 h, and D and H; 72 h following the first injection of high-dose tamoxifen). (A)–(D) are immunostained with Das-1, which recognizes the glycosylation epitope 3ʹ-sulfo-Le A/C 24 (I) Quantification of secreted luminal antigens 48 h after injury. Mean of all mice ( n = (J) Schematic depicting potential trajectories for secreted of generic cytoplasmic organelles (green: intracellular material-like granule, ER, mitochondria, etc.). Gray: classical autophagy; black: lysosome. Yellow arrowheads demonstrate the loss of apical compartmentalization of the zymogenic granules 8 h after injury, relative to vehicle. The secretory granules are apical to the nucleus in (A) but also basal to the nucleus in (B). Green arrows identify secreted sulfated glycoproteins. Scale bars: 50 μm. Figure 2. Focused ion beam scanning electron microscopy demonstrates apical membrane deformation and secreted vesicular material 24 h after injury (A) Vehicle-treated mouse stomach displaying two mature gastric chief cells in two-dimensional electron microscopic section. The boundaries and organellar compartments of one of these cells are annotated in green (Nc, nucleus; rER, rough endoplasmic reticulum; ZG, zymogenic granules). (B) Four sequential focused ion beam scanning electron microscopy (FIB-SEM) micrographs depicting excretion of large, electron-lucent extracellular vesicles and membranous material (red arrow: lysosomes and various stages of autophagosomes; yellow arrows highlights apical plasma membrane shown in inset at right). (C) Another section from FIB-SEM showing membrane material being extruded apically (top arrow) as well as the gland lumen. Note the distorted projections of apical plasma membrane into lumen (magenta arrowheads) and pit-like invaginations of apical plasma membrane (magenta arrowheads). (D–F) Three-dimensional reconstructions produced by stacking FIB-SEM sections. (D and E) Two slices through a three-dimensional reconstruction of how the gland lumen invaginates into an interconnected network of saccules and channels made by the plasma membrane of a paligenotic chief cell. The entire clipping series is available in Video S1 Video S2 Figure 3. Immunohistochemical and confocal immunofluorescence highlight apical membrane distortion in stage 1 of paligenosis (A) PNA lectin (magenta) is specifically reactive to the apical membrane of chief cells, which can be identified by anti-GIF antibody (brown). (B) 8 h after injury, the gland lumens begin to dilate. (C) At 24 h, the apical membrane of the gastric chief cell becomes convoluted. (D) Using optical sectioning, these convolutions are due to invaginations (magenta arrows) and flaps of membrane (magenta arrowheads), as seen ultrastructurally in Figure 2C (E) Quantification of gland dilation as a function of time after injury. Black dots: mean fraction per individual mouse from >200 fundic glands per mouse; red line: mean of all mice ( n = Scale bars in (A) and (B): 100 μm. Scale bar in (C): 50 μm. Figure 4. In Epg5 −/− (A and B) Immunohistochemistry (hematoxylin counterstain) with anti-RAB7 of wild-type C57/Bl6 mouse gastric corpus following (A) vehicle treatment or (B) 24 h after injury. (C and D) Immunohistochemistry of age-matched Epg5 −/− (E and F) Wide-field view 24 h after injury, with brown = anti-RAB7 and magenta = PNA (E: WT, F: Epg5 −/− Epg5 −/− (G) Quantification of cystic structures per high power field 24 h after injury. Black dots: mean fraction per individual mouse from >200 fundic glands per mouse; red line: mean of all mice ( n = Figure 5. RAB7 does not decorate the apical membrane in wild-type mice but does in Epg5 −/− (A) At 24 h after injury, RAB7 (yellow) is restricted to vesicular structures but does not decorate the apical membrane (magenta, PNA lectin). (B and C) In contrast, in the Epg5 −/− (D) Further, the intrinsic membrane protein LAMP2 colocalizes with Rab7 in the apices of the cystic Epg5 −/− Figure S8 (E and G) Schematic comparing the intracellular trajectory of late endosome/lysosomes in (E) wild-type and (G) Epg5 −/− (F and H) Excessive fusion of lysosomal/autophagic membranes with the plasma membrane without subsequent retrieval causes such an expansion of apical membrane that cells expand their luminal surface and flatten into cystic structures. N, nucleus. Black: membrane; red: late endosome, lysosome membrane; red asterisks: cyst-like structures. Scale bars: 20 μm. Figure 6. Sulfated mucin excretion requires functioning lysosomes (A) 48 h after high-dose tamoxifen, the chief cells are normally largely devoid of Das-1-positive sulfated mucins (brown; hematoxylin counterstain, blue), with these mucins being found in the extracellular gland lumen. (B) Concurrent administration of hydroxychloroquine with tamoxifen results in intracellular retention of a portion of the sulfated mucins at 48 h post-injury, a time when sulfated mucins are normally absent from the intracellular space. (C) Azure A (blue; eosin counterstain, pink) reactive material is still secreted after concurrent administration of tamoxifen and hydroxychloroquine. (D) Secretion of azure A (blue; eosin counterstain, pink) reactive material in the gland lumen of Gnptab −/− Wild-type controls for (C) and (D) are available in Figure 1H (E) Quantification of the percentage of glands with chief cells harboring intracellular sulfated mucins for homeostatic mice treated with hydroxychloroquine alone, paligenotic glands treated with tamoxifen, or paligenotic glands treated with tamoxifen and hydroxychloroquine. (F and G) Quantification of gland lumens containing secreted sulfomucins or azure A avid material for hydroxychloroquine alone, tamoxifen, or hydroxychloroquine and tamoxifen. (H) Quantification of the percentage of glands with chief cells harboring intracellular sulfated mucins for wild-type or Gnptab −/− (I and J) Quantification of gland lumens containing secreted sulfomucins or azure A avid material for wild-type or Gnptab −/− n = (K) Schematic representation depicting secretion is mechanistically independent of canonical autophagy that occurs following injury. Gray: classical autophagy; black: lysosome; green: generic cytoplasmic organelle (granule, ER, mitochondria, etc.). Figure 7. Cathartocytosis model (A) Single two-dimensional sections from FIB-SEM of chief cell apical plasma membrane at 24 h post-injury demonstrate phagophore-shaped structures (i.e., similar to emerging, double-membrane autophagosomes) contiguous with the apical invaginations (yellow arrows). Video S3 (B) Fusion of a zymogenic granule into an apical invagination with release of cargo as well as membrane into the lumen (pink arrowhead). Video S4 (C) Schematic representation of canonical autophagy versus our proposed cathartocytosis process. The two processes occur concurrently after injury, and both likely combine to play a role in cellular downscaling. Magenta: cathartocytosis; gray: classical autophagy; black: lysosome; green: generic cytoplasmic organelle (granule, ER, mitochondria, etc.). KEY RESOURCES TABLE REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies  Rat Anti-BrdU @ 1:200 Abcam AB6325 Mouse Anti-Trap-Alpha @ 1:100 Santa Cruz Sc-373916 Rabbit Anti-Sox9 @ 1:5000 Sigma AB5535 Biotinylated PNA Lectin @ 1:1000 Vector B-1075-5 Rabbit Anti-PDI @ 1:500 Cell Signaling 3501 Rabbit Anti-Rab7 @ 1:200 Abcam Ab137029 Rabbit Anti-LC3B @ 1:100 Novus NB600-1384 Biotinylated GSII Lectin @ 1:1000 Vector B-1215-2 Anti-Sulfo-Le A/C Leinco Inhouse Rabbit Anti-GIF (see Figure S10 Thermofisher PA5-59293 Rat Anti-Human CD44 @ 1:200 Cosmo Bio CAC-LKG-M003 Rat Anti-Mouse CD44 @ 1:200 Cosmo Bio CAC-LKG-M002 Goat Anti-GIF N/A Inhouse  Chemicals, peptides, and recombinant proteins  PNGaseF New England Biolabs P0704 O-Glycosidase New England Biolabs P0733 Neuraminidase New England Biolabs P0722 Permount Fisher SP15 Prolong Gold with DAPI Fisher P36971 Histoclear National Diagnostics HS-200 Azure A Sigma A6270 Sunflower Oil Sigma 8001-21-6 Hydroxychloroquine Acros Organics CAS#747-36-4 Tamoxifen Toronto Research Chemicals TRC-T006000  Critical commercial assays  Vectastain Elite ABC-HRP Kit Vector Laboratories PK-6100  Experimental models: Organisms/strains  Global Epg5 Knockout Allele Megan Baldridge Bred Het x Het Global Gnptab Knockout Allele Stuart Kornfeld Bred Het x Het C57BL/6 Jackson Laboratory  Software and algorithms  ChimeraX  https://www.cgl.ucsf.edu/chimerax/ Chimera  https://www.cgl.ucsf.edu/chimerax/older_releases.html FIGI (ImageJ)  https://imagej.net/software/fiji/downloads iMovie  apple.com Ilastik v1.4  https://www.ilastik.org/download  Other  Nanozoomer Hamamatsu 2.0-HT System FIB-SEM Zeiss Crossbeam 540 Light Microscope Olympus BX43 Confocal Microscope Zeiss LSM880 Highlights Defining cathartocytosis, an injury-induced process cells use to downscale cellular machinery Three-dimensional reconstruction detailing how cells reorganize organelles during paligenosis Cathartocytosis and autophagy occur together in paligenosis but are mechanistically distinct EPG5 prevents fusion of autophagic compartments with the apical membrane after injury ",
  "metadata": {
    "Title of this paper": "UCSF Chimera–a visualization system for exploratory research and analysis",
    "Journal it was published in:": "Cell reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478994/"
  }
}