{
  "title": "Paper_537",
  "abstract": "pmc Laryngoscope Laryngoscope 379 blackwellopen LARY The Laryngoscope 0023-852X 1531-4995 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12475537 PMC12475537.1 12475537 12475537 40342158 10.1002/lary.32266 LARY32266 1 Original Report Bronchoesophagology Original Report Pill Shape Determines Esophageal Transit Times—A Pill‐to‐Pill Study Allen Jacqui https://orcid.org/0000-0002-3302-7045  1  2 j.allen@auckland.ac.nz jeallen@voiceandswallow.co.nz MacKay Georgia  1 Miles Anna https://orcid.org/0000-0003-3260-5824  3   1 Department of Surgery University of Auckland Auckland New Zealand   2 North Shore Hospital Auckland New Zealand   3 Speech Science University of Auckland Auckland New Zealand * Correspondence: j.allen@auckland.ac.nz jeallen@voiceandswallow.co.nz 08 5 2025 10 2025 135 10 497679 10.1002/lary.v135.10 3588 3593 13 4 2025 08 3 2025 02 5 2025 27 09 2025 28 09 2025 28 09 2025 © 2025 The Author(s). The Laryngoscope https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Objective When manufacturing medications, several parameters are considered in pill design, particularly shape and size. We hypothesized that oval‐shaped pills would transit more quickly through the esophagus than round pills. Methods Esophageal transit time (pill) (ETTp) of round and oval barium dummy‐pills, derived from VFSS in 112 healthy individuals with no swallowing complaints and 50 individuals referred with swallowing complaints, was compared. ETTp was measured using quantitative software. Results ETTp differed significantly by shape. In healthy adults, median round (13 mm, 1 g) ETTp was 26.4 s (SD 23.6) compared to oval ETTp (13 mm long axis, 1 g) of 5.4 s (SD 4) [ p p p p Conclusions Medication shape affects ETTp, with oval‐shaped pills traveling significantly faster through the esophagus than round pills. However, oval‐shaped pills do not highlight abnormality in the esophagus to the same degree as a round pill. Therefore, consideration of the purpose of pill administration during VFSS should guide pill shape choice, with round pills most suited for diagnostic testing. In a clinical setting, oval‐shaped medication should be favored, if possible, for those with compromised swallow ability. Level of Evidence 3. Shape of pills differ, affecting how easy it is to swallow them. We compared esophageal transit times of a round pill with an oval pill demonstrating in both healthy and symptomatic adults, that the oval pill demonstrated a significantly shorter transit time. capsules dysphagia esophageal transit times pills stasis swallowing pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:27.09.2025  J. Allen G. MacKay A. Miles Pill Shape Determines Esophageal Transit Times—A Pill‐to‐Pill Study The Laryngoscope 135 10 2025 3588 3593 10.1002/lary.32266 PMC12475537 40342158  Funding: American Bronchoesophagological Association Spring Meeting, COSM, New Orleans, May 2025, accepted for podium presentation. 1 Introduction Swallowing difficulty (dysphagia) is a common complaint presenting to both otorhinolaryngology (ORL) and speech‐language therapy (SLT) clinics. Patients may characterize their dysfunction in terms of what textures they are able to manage—solids versus liquids. Frequently, medications are problematic for those with swallowing impairment and in some cases, even for those with normal swallows! Medications are vital for many individuals but may be ineffective, partially active, or injurious to tissue if they become lodged in unintended locations. Liquid formulations often taste unpleasant and are not favored by consumers. Therefore, the swallowability of solid medications is a crucial aspect of pill manufacture and encompasses many different factors. Despite a wealth of information regarding these parameters in pharmaceutical manufacture, there is a lack of direct comparisons of different shaped pills and their esophageal transit times in humans. Previous studies have suggested that medication formulation can affect esophageal transit and pill stasis [ 1 2 3 2 Prior investigation of pill transit times has been undertaken through fluoroscopic means, usually testing round pills [ 1 3 4 5 6 4 The gold standard assessment of swallowing remains the VFSS. Fluoroscopy allows for quantitative measures to be derived, bringing reliability and accuracy to evaluation and treatment planning [ 6 7 4 Normative data in esophageal screening has reported a mean ETT of 10.7 s for a 20 mL bolus, 25.3 s for a 13‐mm round pressed barium pill, and 28.6 s for paste in healthy adults across the lifespan [ 6 6 This study evaluated ETT of round and oval‐shaped pills (Figure 1 FIGURE 1 Photograph showing 13‐mm round barium pressed tablet, oval barium‐filled gelatine capsule alongside a ruler to indicate relative sizes. [Color figure can be viewed in the online issue, which is available at www.laryngoscope.com 2 Methods This study received ethics approval (New Zealand Health and Disability Ethics Committee 13/STH/202 and University of Auckland Human Patients Ethics Committee 9263). 2.1 Participants One hundred and twelve healthy adults were recruited from the community through local advertisement. Exclusion criteria included previous swallowing difficulties or any health condition known to disrupt swallowing function. All participants scored 0 on the Eating Assessment Tool (EAT‐10) [ 8 Fifty patients consecutively referred for a VFSS at one regional hospital with symptoms including cough, globus, and solid food dysphagia between 2023 and 2025 were also recruited. Patient underlying aetiologies included those post‐treatment for head and neck cancer, treated Zenker's diverticuli, esophageal dysmotility, cervical osteophytosis, or plating. Patients were excluded if swallow study data was incomplete, that is, missing standardized coins/rings to allow for measurement calibration and those who did not swallow a pill. All patients were given both a round and oval‐shaped pill during the same study (in random order). 2.2 Videofluoroscopic Swallowing Study Protocol VFSS in normal volunteers were performed in the Radiology suite, using a Videofluoroscope (Toshiba, Tokyo, Japan) and recorded at 30 frames per second onto a USB drive. Timing information was superimposed on the fluoroscopic recording in 100ths of a second using a Horita VS‐50 Video Stopwatch (Horita, Capistrano Beach, California). A 19‐mm diameter ring was taped to the participants neck, shoulder or chin within view of videofluoroscopic images for calibration. Symptomatic individual's studies were performed using a Videofluoroscope (Siemens Artis Zee Multi‐Purpose SN 15880) recorded at 30 frames per second using TIMS MVP. A 20 mm coin was taped to the participant's neck, shoulder, or chin within view of videofluoroscopic images. A standard VFSS protocol was used for all participants. After their lateral plane protocol (1, 3, 20, 100 mL Level 0 barium liquid [E‐Z Paque 96% w/v diluted to 19%], 5 mL paste [E‐Z‐paste 60% w/w]), participants were screened in an antero–posterior (AP) plane. Healthy participants swallowed 20 mL IDDSI 0 barium liquid, 5 mL barium paste and either a 1 mL barium‐filled gelatine oval capsule (24 mm length) or 13 mm round powder‐compressed barium tablet (EZ‐Disk, E‐Z‐Em Inc., NJ, USA) with a 100 mL water. Patients with swallow complaints were given both pill types in random order, each with a 100 mL swallow of water and taken one at a time. The individual was told to “swallow in one go” to avoid deglutitive inhibition. The pill was followed from the oral cavity to the stomach. Screening continued for 20 s following swallow initiation, if the capsule had not yet passed into the stomach at this stage screening was paused for 20 s and then resumed for a further 20 s. If the pill was still present, the participant was asked to take a dry swallow to see if clearance occurred. The screening was stopped at 60 s regardless of the position of the barium pill to limit radiation exposure in keeping with the local policy requirements. 2.3 Measures Each videofluoroscopy was analyzed using real‐time and frame‐by‐frame viewing using Swallowtail analysis software (Bell Medical, St. Louis, Missouri, USA). ETTp was recorded in the AP view from the moment the capsule entered the upper esophageal sphincter to its entry into the stomach. Raters documented the location and time of capsule stasis. 2.4 Data Analysis Statistical analysis was performed using IBM SPSS Statistics Version 23.0 (2013, Armonk, New York, USA). VFSS videos were analyzed by an ORL trainee, trained in using Swallowtail. To establish interrater reliability, 50% of the videos picked at random were assessed by two additional raters. The two raters comprised a speech‐language pathologist and fellowship‐trained laryngologist, both with research backgrounds and extensive experience in VFSS analysis. Inter‐rater reliability was substantial (ICC = 0.92, p T p 3 Results One hundred and sixty‐two participants completed VFSS that included a barium dummy‐medication swallow. Ninety‐five healthy adults (48% female) swallowed a 13‐mm round pill, 17 healthy adults (70% female) swallowed a 24 mm‐long oval gel capsule (Figure 1 1 p p p 2 TABLE 1 Presenting diagnoses for patients undertaking dual pill swallowing. Presenting diagnosis Gastrointestinal Head and neck cancer Neurological (MND, CVA) Respiratory Other (spinal plate, osteophyte) Percentage 51 34 6 3 6 Abbreviations: CVA—cerebrovascular accident; MND—motor neuron disease. TABLE 2 Pill esophageal transit times in healthy adults and adults with swallow complaints. Healthy capsule ( n Healthy round pill ( n Patient dual capsule ( n Patient dual round ( n ETT in s [SD] 5.4 [4] 26.4 [24] 9 [14] 45 [44] Age  a 39 [16] 58 [21] 69 [12] 69 [12] Gender  a 70% 48% 31% 31%  t Healthy cap versus patient cap Healthy round versus patient round Healthy cap versus healthy round Patient cap versus patient round  p 0.3  0.002  0.0004  0.00001  Note: t t  a Age and gender differed significantly across all three groups. ETTp for each pill type in each group were calculated. In healthy adults, the mean ETTp of round pills (26.4 s [SD 23.6 s]) was statistically longer than the ETTp of oval gel‐capsules (5.4 s [SD: 4 s], p p 2 Comparing each pill type between healthy and patient swallowers also demonstrated significant differences based on shape characteristics: round pills in healthy adults mean ETTp 26.4 s versus 45 s (patients) ( p p Gender and age differed significantly across groups; however, in the subjects swallowing both round and oval pills at the same sitting, wherein gender and age are the same, there remained a significant difference in ETTp based on pill shape alone (round ETTp 45 s vs. oval ETTp 9 s; p 4 Discussion Our study compared ETT for barium‐filled oval gelatine capsules (24‐mm long axis) to round compressed powder pills (13‐mm diameter) (Figure 1 2 3 4 FIGURE 2 Still image obtained from videofluoroscopic swallowing study showing the 13‐mm round barium pill in the proximal esophagus. A calibrating marker is seen at the mandible. FIGURE 3 Still image obtained from videofluoroscopic swallowing study showing the 13‐mm round barium pill in the distal esophagus. FIGURE 4 Still image obtained from videofluoroscopic swallowing study showing the oval pill in the esophagus. A calibrating marker is seen at the mandible. The etiology of swallow dysfunction is diverse but often broadly grouped into structural pathology or motility issues, and further segregated according to site (oral, pharyngeal, and/or esophageal) [ 6 9 5 10 11 12 13 14 4 Interestingly, the round pill ETTp duration in healthy swallowers was significantly shorter than in patients (26 vs. 45 s) presenting to clinics with swallow complaints, indicating that patients may appreciate early physiological changes to their swallow, and that the round pill was discriminatory between normal and affected swallows. This supports using the 13 mm round pill in diagnostic studies to challenge the individual as far as possible and to improve detection of swallowing changes. The presenting diagnoses of the patients swallowing both pill types are well recognized to be associated with swallow impairment [ 3 In this exploratory study of pill transit times, we have compared two pill formulations; however, there are many more permutations and additional factors that may affect pill performance. These include pill coating, the vehicle that the pill is swallowed with, pre‐lubrication of the pharynx, and the weight of the pill. In this study, all dummy medications were given with water, and further work is needed to examine differences in pill transit and stasis using other vehicles for assisting pill swallowing. VFSS assessment of different vehicles during pill swallowing would be helpful to delineate any changes. Gallo et al. demonstrated that inclined positioning (at least 45°) and moderate volume of water (> 60 mL) produced the greatest success in the passage of a 12.5 mm barium tablet through the esophagus in 20 healthy volunteers (70%–81% successful passage with 60 or 100 mL of water in inclined position) [ 15 16 16 Similarly, manufacturers can apply pill coatings to streamline pill transit, alter taste or absorption/release properties, stabilize contents, or protect against gastric enzymes [ 17 17 17 Age differed significantly across groups. Age has previously been shown to affect ETT for a 20‐mL bolus, but the age effect has not been noted in pill swallowing [ 6 More than 50% of dual pill swallowers presented with gastrointestinal symptoms (esophageal dysmotility, cricopharyngeal dysfunction) and 34% had undergone treatment for head and neck cancer, typically with surgery followed by adjuvant radiotherapy. These treatments can lead to significant swallow morbidity and xerostomia, impacting pill and solid food transit (Table 1 n 3 5 Limitations Mean age of the patient group was significantly greater than healthy volunteers, and this coincides with the patient round pill ETTp also being significantly longer than volunteers. This may reflect age impacting esophageal function. However, our comparison of round versus oval tablets swallowed by the same patient demonstrated significant differences in ETTp related to pill shape, despite this group having the greatest mean age (69 years). Healthy volunteers only took one of the two pill types (round or oval) to meet ethical requirements. A greater sample size of healthy adults undertaking swallowing incorporating swallows of both pill types and other different formulations would provide more insight into pill swallowability. As discussed above, other pill parameters that may have affected transit time besides shape were not assessed in this study. Only one group of patients was studied—those presenting to an outpatient SLT clinic with complaints of solid food and pill swallowing issues. These were ambulant patients, and pill transit may be different in other pathologies or across a larger sample size. 6 Conclusions The shape of a pill influences the esophageal transit time, with oval pill shapes demonstrating significantly shorter overall ETTp than round pills. This should be considered (a) when performing a diagnostic VFSS that is designed to challenge the individual, when a round pill is likely most appropriate, and (b) when counseling patients with swallow disorders about pill swallowing, when an oval shape may be easier for a patient to manage. Further work is needed to test additional pill parameters and their effects on transit times. Conflicts of Interest The authors declare no conflicts of interest. Acknowledgments Thank you to Rebecca Hammond for assistance in collecting patient swallow studies. Open access publishing facilitated by The University of Auckland, as part of the Wiley ‐ The University of Auckland agreement via the Council of Australian University Librarians. References 1 H. Hey J. Jørgensen K. Sørensen H. Hasselbalch T. Wamberg Oesophageal Transit of Six Commonly Used Tablets and Capsules British Medical Journal 285 1982 1717 1719 6816343 10.1136/bmj.285.6356.1717 PMC1500648 2 K. S. Channer J. P. Virjee The Effect of Formulation on Oesophageal Transit Journal of Pharmacy and Pharmacology 37 2 1985 126 129 10.1111/j.2042-7158.1985.tb05021.x 2858546 3 A. Miles K. Bennett J. Allen Esophageal Transit Times Vary With Underlying Comorbid Disease Otolaryngology and Head and Neck Surgery 161 5 2019 829 834 10.1177/0194599819874342 31476971 4 J. E. Allen C. White R. Leonard P. C. Belafsky Comparison of Esophageal Screen Findings on Videofluoroscopy With Full Esophagram Results Head & Neck 34 2 2012 264 269 10.1002/hed.21727 21472881 5 A. Miles J. McMillan K. Ward J. Allen Esophageal Visualization as an Adjunct to the Videofluoroscopic Study of Swallowing Otolaryngology—Head & Neck Surgery 152 3 2014 488 493 10.1177/0194599814565599 25605697 6 A. Miles S. Clark M. Jardine J. Allen Esophageal Swallowing Timing Measures in Healthy Adults During Videofluoroscopy Annals of Otology, Rhinology & Laryngology 125 2016 764 769 27287678 10.1177/0003489416653410 7 R. Leonard K. Kendall Dysphagia: Assessment and Treatment Planning 5th ed. Plural Publishing 2025 8 P. C. Belafsky D. A. Mouadeb C. J. Rees Validity and Reliability of the Eating Assessment Tool (EAT‐10) Annals of Otology, Rhinology and Laryngology 117 12 2008 919 924 19140539 10.1177/000348940811701210 9 J. M. Wilkinson M. Halland Esophageal Motility Disorders American Family Physician 102 2020 291 296 32866357 10 H. H. Ashraf J. Palmer H. R. Dalton Can Patients Determine the Level of Their Dysphagia? World Journal of Gastroenterology 23 6 2017 1038 1043 10.3748/wjg.v23.i6.1038 28246477 PMC5311092 11 D. F. Smith D. J. Ott D. W. Gelfand M. Y. M. Chen Lower Esophageal Mucosal Ring: Correlation of Referred Symptoms With Radiologic Findings Using a Marshmallow Bolus American Journal of Roentgenology 171 1998 1361 1365 9798879 10.2214/ajr.171.5.9798879 12 J. A. Castell B. T. Johnston A. Colcher Q. Li R. M. Gideon D. O. Castell Manometric Abnormalities of the Oesophagus in Patients With Parkinson's Disease Neurogastroenterology & Motility 13 2001 361 364 11576395 10.1046/j.1365-2982.2001.00275.x 13 B. Jones Pharyngoesophageal Interrelationships and Reflexes Involved in Airway Protection Normal and Abnormal Swallowing: Imaging in Diagnosis and Therapy 2nd ed. B. Jones Springer 2003 91 1010 14 P. C. Belafsky C. J. Rees J. Allen R. J. Leonard Pharyngeal Dilation in Cricopharyngeus Muscle Dysfunction and Zenker Diverticulum Laryngoscope 120 2010 889 894 20422681 10.1002/lary.20874 15 S. H. Gallo S. A. McClave L. J. Makk S. W. Looney Standardization of Clinical Criteria Required for Use of the 12.5 Millimeter Barium Tablet in Evaluating Esophageal Luminal Patency Gastrointestinal Endoscopy 44 1996 181 184 10.1016/s0016-5017(96)70137-2 8858325 16 H. Hummler C. Stillhart L. Meilicke Impact of Tablet Size and Shape on the Swallowability in Older Adults Pharmaceutics 15 4 2023 1042 10.3390/pharmaceutics15041042 37111528 PMC10145850 17 R. Shaikh D. P. O'Brien D. M. Croker G. M. Walker The Development of Pharmaceutical Oral Solid Dosage Forms Computer Aided Chemical Engineering 41 Elsevier 2018 27 65 10.1016/B978-0-444-63963-9 ",
  "metadata": {
    "Title of this paper": "Impact of Tablet Size and Shape on the Swallowability in Older Adults",
    "Journal it was published in:": "The Laryngoscope",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475537/"
  }
}