{
  "title": "Paper_73",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12491539 PMC12491539.1 12491539 12491539 41038832 10.1038/s41467-025-63842-z 63842 1 Article Cross-ancestral GWAS identifies 29 variants across head and neck cancer subsites http://orcid.org/0000-0003-0910-3447 Ebrahimi Elmira 1 2 Sangphukieo Apiwat 1 3 http://orcid.org/0000-0001-8055-3729 Park Hanla A. 1 Gaborieau Valerie 1 Ferreiro-Iglesias Aida 1 Diergaarde Brenda 4 5 http://orcid.org/0000-0003-3777-570X Ahrens Wolfgang 6 Alemany Laia 7 8 9 Arantes Lidia MRB 10 Betka Jaroslav 11 Bratman Scott V. 12 Canova Cristina 13 Conlon Michael SC 14 Conway David I. 15 Cuello Mauricio 16 http://orcid.org/0000-0001-8172-2483 Curado Maria Paula 17 de Carvalho Ana Carolina 1 de Oliviera Jose Carlos 18 http://orcid.org/0000-0001-5733-6304 Gormley Mark 19 Hadji Maryam 2 20 http://orcid.org/0000-0002-8272-5915 Hargreaves Sarah 21 http://orcid.org/0000-0003-0583-6360 Healy Claire M. 22 http://orcid.org/0000-0002-1366-0337 Holcatova Ivana 23 http://orcid.org/0000-0002-4486-7496 Hung Rayjean J. 24 25 http://orcid.org/0000-0002-0481-156X Kowalski Luis P. 26 27 Lagiou Pagona 28 Lagiou Areti 29 Liu Geoffrey 30 Macfarlane Gary J. 31 Olshan Andrew F. 32 http://orcid.org/0000-0001-7740-8141 Perdomo Sandra 1 Pinto Luis Felipe Ribiero 33 http://orcid.org/0000-0001-6995-955X Podesta Jose Roberto V. 34 http://orcid.org/0000-0001-9381-1520 Polesel Jerry 35 Pring Miranda 19 Rashidian Hamideh 2 http://orcid.org/0000-0003-4406-8958 Gama Ricardo R. 36 http://orcid.org/0000-0003-0316-9402 Richiardi Lorenzo 37 http://orcid.org/0000-0003-4491-6865 Robinson Max 38 http://orcid.org/0000-0003-3693-7690 Rodriguez-Urrego Paula A. 39 Santi Stacey A. 40 Saunders Deborah P. 41 http://orcid.org/0000-0002-6742-3708 Soares-Lima Sheila C. 42 http://orcid.org/0000-0002-7141-9189 Timpson Nicholas 43 Vilensky Marta 44 http://orcid.org/0000-0002-8897-5747 von Zeidler Sandra V. 45 http://orcid.org/0000-0002-0616-6963 Waterboer Tim 46 Zendehdel Kazem 2 http://orcid.org/0000-0002-5849-4782 Znaor Ariana 47 Brennan Paul 1 HEADSpAcE Consortium http://orcid.org/0000-0003-0910-3447 Ebrahimi Elmira 1 2 Sangphukieo Apiwat 1 3 http://orcid.org/0000-0001-8055-3729 Park Hanla A. 1 Gaborieau Valerie 1 Ferreiro-Iglesias Aida 1 Diergaarde Brenda 4 5 http://orcid.org/0000-0003-3777-570X Ahrens Wolfgang 6 Alemany Laia 7 8 9 Arantes Lidia MRB 10 Betka Jaroslav 11 Bratman Scott V. 12 Canova Cristina 13 Conlon Michael SC 14 Conway David I. 15 Cuello Mauricio 16 http://orcid.org/0000-0001-8172-2483 Curado Maria Paula 17 http://orcid.org/0000-0001-5733-6304 Gormley Mark 19 Hadji Maryam 2 20 http://orcid.org/0000-0002-8272-5915 Hargreaves Sarah 21 http://orcid.org/0000-0003-0583-6360 Healy Claire M. 22 http://orcid.org/0000-0002-1366-0337 Holcatova Ivana 23 http://orcid.org/0000-0002-4486-7496 Hung Rayjean J. 24 25 http://orcid.org/0000-0002-0481-156X Kowalski Luis P. 26 27 Lagiou Pagona 28 Lagiou Areti 29 Liu Geoffrey 30 Macfarlane Gary J. 31 Olshan Andrew F. 32 http://orcid.org/0000-0001-7740-8141 Perdomo Sandra 1 http://orcid.org/0000-0001-6995-955X Podesta Jose Roberto V. 34 http://orcid.org/0000-0001-9381-1520 Polesel Jerry 35 Pring Miranda 19 Rashidian Hamideh 2 http://orcid.org/0000-0003-4406-8958 Gama Ricardo R. 36 http://orcid.org/0000-0003-0316-9402 Richiardi Lorenzo 37 http://orcid.org/0000-0003-4491-6865 Robinson Max 38 http://orcid.org/0000-0003-3693-7690 Rodriguez-Urrego Paula A. 39 Santi Stacey A. 40 Saunders Deborah P. 41 http://orcid.org/0000-0002-6742-3708 Soares-Lima Sheila C. 42 Vilensky Marta 44 http://orcid.org/0000-0002-0616-6963 Waterboer Tim 46 Zendehdel Kazem 2 http://orcid.org/0000-0002-5849-4782 Znaor Ariana 47 Brennan Paul 1 de Carvalho Ana Carolina 1 de Oliviera Jose Carlos 18 Pinto Luis F. 33 Timpson Nic 43 von Zeidler Sandra V. 45 Adam Roque 48 Agudo Antonio 49 Alibhai Salima 50 AlWaheidi Shaymaa F. 1 Pavon Miquel Angel 49 Anwar Namrah 51 Arantes Paola Engelmann 52 Arguello Lisa 53 Avello Yubelly 54 Avondet Lucas 48 Baldión-Elorza Ana M. 54 Daniel Camila Batista 55 Beraldi Bianca 56 Berenstein Barbara 57 Bernal Patricia 58 Rodrigues Natália Bernardino 59 Zimmermann Josipa Bilic 49 Botta Marianna G. 52 Bouvard Lourine 1 Brenes Jesús 49 Brenner Nicole 60 Brentisci Carol 61 Burtica Catalina 54 Cabañas María L. 62 Cantor Erick 63 Carvalho Raiany S. 64 Carvalho Andre L. 65 Chiusa Luigi 66 Chopard Priscilia 1 Chundriger Qurratulain 67 Clavero Omar 49 Costa Isabela 68 Creaney Grant 15 Cuffini Cecilia 69 Dias Tauana C. 64 de Souza Evandro Duccini 56 Durant Lais C. 70 Escallón Alberto 71 Fernandes Gisele Aparecida 52 Fervers Béatrice 72 Fiano Valentina 73 Figueira Frederico Firme 59 Villefort Regina Furbino 59 Gangemi Manuela 61 Garzino-Demo Paolo 74 Gholipour Mahin 75 Giglio Raul 57 Goulart Mariel A. 15 Sant’Anna Jéssica Graça 55 Grega Marek 76 Có Anna Clara Gregório 55 Guasch Arnau 49 Hakim Jose A. 71 Hayes David N. 77 de Sá Santos Marco Homero 56 Hurley Katrina 78 Insfran Magalí 79 Iorio Giuseppe C. 80 Siddiqui Moghira Iqbaluddin 81 Johannsen Jannik 82 Kaňa Martin 83 Klussmann Jens Peter 82 Legal Evelio 84 Lenzi Jeferson 56 Dias Fernando Luiz 68 González Iván Lyra 85 Zorzaneli Willene Machado 55 Rocha Ricardo Mai 56 Mañós Manel 49 de Abreu Priscila Marinho 55 Marzban Maryam 86 87 McCaul James 88 McMahon Alex D. 15 Mena Carlos 84 Mendonça Elismauro F. 89 Mendoza Laura 79 Meza Lorena 79 Michels Birgitta 60 Mineiro Matinair S. 89 Moccia Chiara 73 Mongelos Pamela 79 Montealegre-Páez Ana L. 90 Cortes Francisca Morey 49 Muñoz Alvaro 91 Ness Andy 78 Neves Aline B. 52 Oliva Marco 49 de Oliveira José Carlos 92 Ortiz Hernán 53 Ortiz José 84 Osorio Marta 84 Ospina Vanessa 63 Ostellino Oliviero 93 Palau Mauricio 54 Paterson Claire 94 Casabona Sonia Paytubi 49 Pecorari Giancarlo 74 Pereira David M. 95 Pérol Olivia 72 Pervez Shahid 67 Pomata Alicia 62 Popovic Maja 73 Poveda Alisson 90 Prado Carol P. 52 Prager Kristina M. 60 Ramieri Guglielmo 74 Rasul Saida 50 Rego Juliana NI 96 Reis Rui M. 64 Renard Helene 1 Ricardi Umberto 80 Riva Giuseppe 74 Rodilla Frederic 49 Rodriguez Ingrid 97 Rodríguez María I. 79 Ross Alastair 15 Roux Pierre-Eric 98 Ali Tazeen Saeed 99 Saintigny Pierre 100 Santivañez Juan J. 71 Scapultampo-Neto Cristóvam 101 Segovia Javier 63 Sena Agenor 56 Serrano Ricardo 84 Sharma Shachi J. 82 Siefer Oliver 82 Smart Stephanie 102 Sorroche Bruna P. 64 Sosa Cinthia 62 de Oliveira Juliana Souza 17 Stura Antonella 61 Thomas Steven 78 Torres Oscar 103 Tous Sara 49 Ucross Gonzálo 58 Valenzuela Adriana 79 de Podestá José Roberto Vasconcelos 56 Whitmarsh Alex 78 Wright Sylvia 104 McKay James 1 http://orcid.org/0000-0002-1163-432X Virani Shama viranis@iarc.who.int 1 http://orcid.org/0000-0003-3756-040X Dudding Tom tom.dudding@bristol.ac.uk 19 McKay James 1 http://orcid.org/0000-0002-1163-432X Virani Shama viranis@iarc.who.int 1 http://orcid.org/0000-0003-3756-040X Dudding Tom tom.dudding@bristol.ac.uk 19 1 https://ror.org/00v452281 grid.17703.32 0000 0004 0598 0095 Genomic Epidemiology Branch, International Agency for Research on Cancer (IARC/WHO), 2 https://ror.org/01c4pz451 grid.411705.6 0000 0001 0166 0922 Cancer Research Center, Cancer Institute, Tehran University of Medical Sciences, 3 https://ror.org/05m2fqn25 grid.7132.7 0000 0000 9039 7662 Center of Multidisciplinary Technology for Advanced Medicine (CMUTEAM), Faculty of Medicine, Chiang Mai University, 4 https://ror.org/01an3r305 grid.21925.3d 0000 0004 1936 9000 Department of Human Genetics, School of Public Health, University of Pittsburgh, 5 https://ror.org/03bw34a45 grid.478063.e 0000 0004 0456 9819 UPMC Hillman Cancer Center, 6 https://ror.org/02c22vc57 grid.418465.a 0000 0000 9750 3253 Leibniz Institute for Prevention Research and Epidemiology-BIPS, 7 https://ror.org/01j1eb875 grid.418701.b 0000 0001 2097 8389 Catalan Institute of Oncology. ICO, L’Hospitalet, 8 https://ror.org/0008xqs48 grid.418284.3 0000 0004 0427 2257 Bellvitge Biomedical Research Institute (IDIBELL), L’Hospitalet, 9 https://ror.org/050q0kv47 grid.466571.7 0000 0004 1756 6246 CIBER en Epidemiología y Salud Pública (CIBERESP), 10 https://ror.org/00f2kew86 grid.427783.d 0000 0004 0615 7498 Barretos Cancer Hospital, 11 https://ror.org/024d6js02 grid.4491.8 0000 0004 1937 116X Department of Otorhinolarygology and Head And Neck Surgery, 1.st Medical Faculty, Charles University, Faculty Hospital Motol, 12 https://ror.org/03dbr7087 grid.17063.33 0000 0001 2157 2938 Depts of Radiation Oncology, Princess Margaret Cancer Centre, University of Toronto, 13 https://ror.org/00240q980 grid.5608.b 0000 0004 1757 3470 Unit of Biostatistics, Epidemiology and Public Health, Department of Cardio-Thoraco-Vascular Sciences and Public Health, University of Padova, 14 https://ror.org/04br0rs05 grid.420638.b 0000 0000 9741 4533 Epidemiology, Outcomes & Evaluation Research, Health Sciences North Research Institute, 15 https://ror.org/00vtgdb53 grid.8756.c 0000 0001 2193 314X School of Medicine, Dentistry and Nursing, University of Glasgow, 16 https://ror.org/04jdthe46 grid.414446.7 Oncology, Hospital de Clinicas Dr. Manuel Quintela, 17 https://ror.org/03025ga79 grid.413320.7 0000 0004 0437 1183 Epidemiology and Statistics Group, Research Center, A.C Camargo Cancer Center, 18 19 https://ror.org/0524sp257 grid.5337.2 0000 0004 1936 7603 Bristol Dental School, Bristol University, 20 https://ror.org/00cyydd11 grid.9668.1 0000 0001 0726 2490 A.I. Virtanen Institute for Molecular Sciences, University of Eastern Finland, 21 https://ror.org/03jzzxg14 University Hospitals Bristol and Weston NHS Foundation Trust, 22 https://ror.org/02tyrky19 grid.8217.c 0000 0004 1936 9705 School of Dental Science, Dublin Dental University Hospital, Trinity College Dublin, 23 https://ror.org/024d6js02 grid.4491.8 0000 0004 1937 116X Institute of Hygiene & Epidemiology, 1st Faculty of Medicine, Charles University, 24 https://ror.org/044790d95 grid.492573.e 0000 0004 6477 6457 Prosserman Centre for Population Health Research, Lunenfeld-Tanenbaum Research Institute, Sinai Health System, 25 https://ror.org/03dbr7087 grid.17063.33 0000 0001 2157 2938 Division of Epidemiology, Dalla Lana School of Public Health, University of Toronto, 26 https://ror.org/036rp1748 grid.11899.38 0000 0004 1937 0722 Department of Head and Neck Surgery, University of São Paulo Medical School, 27 https://ror.org/03025ga79 grid.413320.7 0000 0004 0437 1183 Department of Head and Neck Surgery and Otorhinolaryngology, A C Camargo Cancer Center, 28 https://ror.org/04gnjpq42 grid.5216.0 0000 0001 2155 0800 Department of Hygiene, Epidemiology & Medical Statistics, School of Medicine, National and Kapodistrian University of Athens, 29 https://ror.org/00r2r5k05 grid.499377.7 0000 0004 7222 9074 Department of Public and Community Health, School of Public Health, University of West Attica, 30 https://ror.org/03dbr7087 grid.17063.33 0000 0001 2157 2938 Medicine, Epidemiology, Medical Oncology, Princess Margaret Cancer Centre, University of Toronto, 31 https://ror.org/016476m91 grid.7107.1 0000 0004 1936 7291 Epidemiology Group, School of Medicine, Medical Sciences and Nutrition, University of Aberdeen, 32 https://ror.org/0130frc33 grid.10698.36 0000 0001 2248 3208 Department of Epidemiology, Gillings School of Global Public Health, University of North Carolina, 33 https://ror.org/055n68305 grid.419166.d Programa de Carcinogênese Molecular, Instituto Nacional de Câncer - INCA, 34 35 https://ror.org/03ks1vk59 grid.418321.d 0000 0004 1757 9741 Unit of Cancer Epidemiology, Centro di Riferimento Oncologico di Aviano (CRO) IRCCS, 36 https://ror.org/050z9fj14 grid.413463.7 0000 0004 7407 1661 Department of Head and Neck Surgery, Barretos Cancer Hospital, 37 https://ror.org/048tbm396 grid.7605.4 0000 0001 2336 6580 Cancer Epidemiology Unit, University of Turin, 38 https://ror.org/05p40t847 grid.420004.2 0000 0004 0444 2244 Cellular Pathology, The Newcastle upon Tyne Hospitals NHS Foundation Trust, 39 https://ror.org/03ezapm74 grid.418089.c 0000 0004 0620 2607 Pathology and Laboratories, Pathology, University Hospital Fundacion Santa Fe de Bogota, 40 https://ror.org/04br0rs05 grid.420638.b 0000 0000 9741 4533 Clinical Oncology Research, Health Sciences North Research Institute, 41 https://ror.org/05yb43k62 grid.436533.4 0000 0000 8658 0974 Department of Dental Oncology, Health Sciences North, Northern Ontario School of Medicine University, 42 https://ror.org/055n68305 grid.419166.d Brazilian National Cancer Institute, 43 https://ror.org/0524sp257 grid.5337.2 0000 0004 1936 7603 MRC Integrative Epidemiology Unit, Bristol University, 44 https://ror.org/0081fs513 grid.7345.5 0000 0001 0056 1981 Instituto de Oncologia Angel H Roffo, Universidad de Buenos Aires, 45 https://ror.org/05sxf4h28 grid.412371.2 0000 0001 2167 4168 Pathology Department, Federal University of Espírito Santo, 46 https://ror.org/04cdgtt98 grid.7497.d 0000 0004 0492 0584 Infections and Cancer Epidemiology, German Cancer Research Center (Deutsches Krebsforschungszentrum, DKFZ), 47 https://ror.org/00v452281 grid.17703.32 0000 0004 0598 0095 Cancer Surveillance Branch, International Agency for Research on Cancer (IARC/WHO), 48 https://ror.org/0081fs513 grid.7345.5 0000 0001 0056 1981 H&N cancer Department, Universidad de Buenos Aires, 49 https://ror.org/01j1eb875 grid.418701.b 0000 0001 2097 8389 Catalan Institute of Oncology (ICO), 50 https://ror.org/05xcx0k58 grid.411190.c 0000 0004 0606 972X Department of Surgery, Dental Hygiene Program, Aga Khan University Hospital, 51 https://ror.org/04g0mqe67 grid.444936.8 0000 0004 0608 9608 Faculty of Science and Technology, University of Central Punjab, 52 https://ror.org/03025ga79 grid.413320.7 0000 0004 0437 1183 Group of Epidemiology and Statistics on Cancer, A.C. Camargo Cancer Center, 53 https://ror.org/03gatys88 grid.508033.d 0000 0004 0453 6902 Servicio de Cabeza y Cuello, Instituto Nacional del Cáncer, Ministerio de Salud Pública y Bienestar Social, 54 https://ror.org/03ezapm74 grid.418089.c 0000 0004 0620 2607 Pathology and Laboratory Department, Fundación SantaFe de Bogotá, 55 https://ror.org/05sxf4h28 grid.412371.2 0000 0001 2167 4168 Postgraduate Program in Biotechnology, Universidade Federal do Espirito Santo, 56 57 https://ror.org/0081fs513 grid.7345.5 0000 0001 0056 1981 H&N cancer Department, Institute of Oncology Angel H. Roffo, University of Buenos Aires, 58 https://ror.org/03ezapm74 grid.418089.c 0000 0004 0620 2607 Department of Radiology, Division of Nuclear Medicine, Fundación SantaFe de Bogotá, 59 https://ror.org/05sxf4h28 grid.412371.2 0000 0001 2167 4168 Department of Pathology, Universidade Federal do Espirito Santo, 60 https://ror.org/04cdgtt98 grid.7497.d 0000 0004 0492 0584 Division of Infections and Cancer Epidemiology, German Cancer Research Center (DKFZ), 61 https://ror.org/001f7a930 grid.432329.d 0000 0004 1789 4477 Department of Medical Sciences, Cancer Epidemiology Unit, AOU Città della Salute e della Scienza di Torino, 62 https://ror.org/03gatys88 grid.508033.d 0000 0004 0453 6902 Departamento de Anatomía Patológica, Instituto Nacional del Cáncer, Ministerio de Salud Pública y Bienestar Social, 63 https://ror.org/03ezapm74 grid.418089.c 0000 0004 0620 2607 Oncology Department, Fundación SantaFe de Bogotá, 64 https://ror.org/00f2kew86 grid.427783.d 0000 0004 0615 7498 Molecular Oncology Research Center, Barretos Cancer Hospital, 65 https://ror.org/00f2kew86 grid.427783.d 0000 0004 0615 7498 Department of Head and Neck Surgery, Barretos Cancer Hospital, 66 https://ror.org/001f7a930 grid.432329.d 0000 0004 1789 4477 Pathology Unit, AOU Città della Salute e della Scienza di Torino, 67 https://ror.org/05xcx0k58 grid.411190.c 0000 0004 0606 972X Department of Pathology and Laboratory Medicine, Section of Histopathology, Aga Khan University Hospital, 68 https://ror.org/055n68305 grid.419166.d INCA, 69 https://ror.org/056tb7j80 grid.10692.3c 0000 0001 0115 2557 Universidad Nacional de Cordoba, 70 https://ror.org/03025ga79 grid.413320.7 0000 0004 0437 1183 A.C Camargo Cancer Center, 71 https://ror.org/03ezapm74 grid.418089.c 0000 0004 0620 2607 Department of Surgery, Head and Neck Division, Fundación SantaFe de Bogotá, 72 https://ror.org/01cmnjq37 grid.418116.b 0000 0001 0200 3174 Department Cancer Environnement, Centre Léon Bérard, 73 https://ror.org/048tbm396 grid.7605.4 0000 0001 2336 6580 Department of Medical Sciences, Cancer Epidemiology Unit, University of Turin, 74 https://ror.org/048tbm396 grid.7605.4 0000 0001 2336 6580 Department of Surgical Sciences, University of Turin, 75 https://ror.org/03mcx2558 grid.411747.0 0000 0004 0418 0096 Metabolic Disorders Research Center, Golestan University of Medical Sciences, 76 https://ror.org/0125yxn03 grid.412826.b 0000 0004 0611 0905 Department of Pathology and Molecular Medicine, 2nd Faculty of Medicine, Charles University and Motol University Hospital, University Hospital in Motol, 77 https://ror.org/0011qv509 grid.267301.1 0000 0004 0386 9246 Department of Genetics, Genomics and Informatics, University of Tennessee Health Science Center, 78 https://ror.org/0524sp257 grid.5337.2 0000 0004 1936 7603 Bristol Dental School, University of Bristol, 79 https://ror.org/03f27y887 grid.412213.7 0000 0001 2289 5077 Salud Pública, Instituto de Investigaiones en Ciencias de la Salud (IICS), Universidad Nacional de Asunción (UNA), 80 https://ror.org/048tbm396 grid.7605.4 0000 0001 2336 6580 Department of Oncology, University of Turin, 81 https://ror.org/05xcx0k58 grid.411190.c 0000 0004 0606 972X Department of Surgery, Section of E.N.T, Aga Khan University Hospital, 82 https://ror.org/00rcxh774 grid.6190.e 0000 0000 8580 3777 Department of Otorhinolaryngology, Head and Neck Surgery, University of Cologne, 83 https://ror.org/0125yxn03 grid.412826.b 0000 0004 0611 0905 Departrment of Otorhinolaryngology and Head and Neck Surgery, University Hospital in Motol, 84 https://ror.org/03f27y887 grid.412213.7 0000 0001 2289 5077 Cátedra Otorrinonaringología, Hospital de Clínicas, Facultad de Ciencias Médicas, Universidad Nacional de Asunción, 85 https://ror.org/030bbe882 grid.11630.35 0000 0001 2165 7640 Servicio de Oncología Clínica Hospital de Clínicas, Universidad de la República, 86 https://ror.org/02y18ts25 grid.411832.d 0000 0004 0417 4788 The Persian Gulf Tropical Medicine Research Center, The Persian Gulf Biomedical Sciences Research Institute, Bushehr University of Medical Sciences, 87 https://ror.org/004y8wk30 grid.1049.c 0000 0001 2294 1395 Statistics Genetic Lab, QIMR, Berghofer Medical Research Institute, 88 https://ror.org/05kdz4d87 grid.413301.4 0000 0001 0523 9342 Department of Oral and Maxillofacial/Head and Neck Surgery, NHS Greater Glasgow and Clyde, 89 90 https://ror.org/04m9gzq43 grid.412195.a 0000 0004 1761 4447 Faculty of Medicine, El Bosque University, 91 https://ror.org/03ezapm74 grid.418089.c 0000 0004 0620 2607 Oncology Department, Division of Radiotherapy, Fundación SantaFe de Bogotá, 92 93 https://ror.org/001f7a930 grid.432329.d 0000 0004 1789 4477 Department of Oncology, Division of Medical Oncology, AOU Città della Salute e della Scienza di Torino, 94 https://ror.org/05kdz4d87 grid.413301.4 0000 0001 0523 9342 Beatson West of Scotland Cancer Centre, NHS Greater Glasgow and Clyde, 95 https://ror.org/0081fs513 grid.7345.5 0000 0001 0056 1981 Radiation Oncology Department, Institute of Oncology Angel H. Roffo, University of Buenos Aires, 96 97 https://ror.org/03f27y887 grid.412213.7 0000 0001 2289 5077 Laboratorio de Anatomía Patológica, Hospital de Clínicas, Facultad de Ciencias Médicas, Universidad Nacional de Asunción, 98 https://ror.org/01cmnjq37 grid.418116.b 0000 0001 0200 3174 Department of Surgery, Centre Léon Bérard, 99 https://ror.org/05xcx0k58 grid.411190.c 0000 0004 0606 972X School of Nursing and Midwifery, Aga Khan University Hospital, 100 https://ror.org/01cmnjq37 grid.418116.b 0000 0001 0200 3174 Centre Léon Bérard, 101 https://ror.org/00f2kew86 grid.427783.d 0000 0004 0615 7498 Pathology and Molecular Diagnostics Service, Barretos Cancer Hospital, 102 https://ror.org/05kdz4d87 grid.413301.4 0000 0001 0523 9342 NHS Greater Glasgow & Clyde, 103 https://ror.org/03ezapm74 grid.418089.c 0000 0004 0620 2607 Radiology Department, Fundación SantaFe de Bogotá, 104 https://ror.org/00vtgdb53 grid.8756.c 0000 0001 2193 314X Institute of Cancer Sciences, University of Glasgow, 2 10 2025 2025 16 478256 8787 14 11 2024 12 8 2025 02 10 2025 04 10 2025 04 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Head and neck squamous cell carcinoma (HNSCC) includes diverse cancers arising in the oral cavity, oropharynx, and larynx, with the main risk factors being environmental exposures such as tobacco, alcohol, and human papillomavirus (HPV) infection. The genetic factors contributing to susceptibility across different populations and tumour subsites remain incompletely understood. Here we show, through a genome-wide association and fine mapping study of over 19,000 HNSCC cases and 38,000 controls from multiple ancestries, 18 genetic risk variants and 11 signals from fine mapping of the human leukocyte antigen (HLA) region, all previously unreported. rs78378222, a regulatory variant for TP53 BRCA2 ADH1B Head and neck squamous cell carcinoma (HNSCC) frequency and risk factors vary considerably across regions and ancestries. Here, the authors conduct a multi-ancestry genome-wide association study and fine mapping study of HNSCC subsites in cohorts from multiple continents, finding susceptibility and protective loci, gene-environment interactions, and gene variants related to immune response. Subject terms Head and neck cancer Cancer genetics This study was funded in part by the European Union's Horizon 2020 research and innovation program under grant agreement No 825771 (HEADSpAcE project) and by the US National Institute of Dental and Craniofacial Research (NIDCR) grants R03DE030257 and R01DE025712. Genotyping using the Oncoarray and the All of Us array was performed at Center for Inherited Disease (CIDR) and funded by NIDCR 1X01HG007780-0 and jointly by NIDCR/NCI X01HG010743. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Head and neck squamous cell carcinomas (HNSCC) are a heterogeneous group of cancers originating primarily in the oral cavity (OC), oropharynx (OPC), larynx (LA) and hypopharynx (HPC). Currently, HNSCC is ranked the 6th most common cancer globally, although incidence is predicted to increase 30% by 2030 1 2 2 3 4 5 7 8 9 Although a limited number of genome-wide association studies (GWAS) have been conducted on HNSCC, a germline contribution to HNSCC risk has been established, with multiple susceptibility loci associated with risk. These include the 4q23 locus ( ADH1B, ADH7 TERT-CLPTM1L 10 14 10 12 13 15 10 14 Despite knowledge of the major risk factors and several risk loci for HNSCC, identifying those who will develop cancer is still difficult. Not all smokers develop cancer, and risk loci only offer a fractional change in risk at the population level. The interaction between environmental factors and risk loci may help explain additional risk and has been reported for lung cancer (smoking) 16 17 18 Here, we perform a cross-ancestry GWAS of HNSCC using individual-level data, bringing together studies from Europe, North America, South America, South Asia and the Middle East. We identify multiple genetic risk susceptibility loci, determine shared and unique risk loci across subsites, explore interactions between genetic and environmental factors in HNSCC risk and conduct fine mapping of the HLA region. This work lays the foundation for identifying HNSCC susceptibility loci with increased representation from non-European populations. Results Cross-ancestral meta-analysis identifies 18 novel genetic loci across HNSCC subsites In this cross-ancestral meta-analysis of two pooled individual-level datasets (Supplementary Data 1 2 We identified and annotated 18 genome-wide associated variants, including two specific to non-European ancestry (Table 1 1 S1 3–5 6 Fig. 1 Novel risk loci identified for HNSCC. a −8 b 1 Table 1 Summary of novel genetic variants identified in European and Mixed Groups through GWAS and Meta-Analysis Population Subsite rsID Mapped/Nearest Gene CHR BP (GRCh38) Cytogenetic Position Major Allele Effect Allele EAF (European) EAF (Mixed) OR (95%CI) p-value Meta-Analysis All sites combined rs61817953 PIK3C2B 1 204493484 1q32.1 G A 0.188 0.153 0.90 (0.87, 0.93) 1.17 × 10 −8 rs6679311 MDM4 1 204590548 1q32.1 C T 0.285 0.294 1.11 (1.07, 1.14) 1.25 × 10 −10 rs1131769 STING1 5 139478334 5q31.2 C T 0.137 0.148 1.13 (1.09, 1.18) 2.38 × 09 −09 rs7334543 BRCA2 13 32399139 13q13.1 A G 0.272 0.228 0.91 (0.88, 0.94) 2.39 × 08 −08 rs78378222 a TP53 17 7668434 17p13.1 T G 0.012 - 0.62 (0.52, 0.73) 2.16 × 08 −08 rs10419397 ANKLE1 19 17280519 19p13.11 G A 0.299 0.242 1.13 (1.10, 1.17) 1.21 × 14 −14 OC rs28419191 ECSCR 5 139465014 5q31.2 C T 0.132 0.149 1.23 (1.15, 1.31) 3.16 × 10 −10 rs67351073 ZGPAT 20 63704213 20q13.33 GA G 0.088 0.069 0.78 (0.72, 0.85) 4.45 × 08 −08 rs577454702 a MAPK1 22 21778123 22q11.22 A C 0.007 - 2.60 (1.86, 3.65) 2.53 × 08 −08 LA rs55831773 ATP1B2 17 7655719 17p13.1 C T 0.195 0.219 1.21 (1.13, 1.29) 5.1 × 09 −09 rs10419397 ANKLE1 19 17280519 19p13.11 G A 0.295 0.238 1.18 (1.10, 1.26) 4.33 × 08 −08 HPC rs138707495 GDF7 2 20677150 2p24.1 T TA 0.009 0.005 3.06 (2.07, 4.53) 2.33 × 08 −08 rs77750788 IGSF9B 11 133936692 11q25 G A 0.030 0.015 2.07 (1.61, 2.68) 2.03 × 08 −08 rs181194133 a OPCML 11 132728232 11q25 G A 0.009 - 3.44 (2.24, 5.31) 2.09 × 08 −08 European Ancestry GWAS HPC rs181777026 TENM4 11 81037815 11q14.1 C T 0.012 0.009 2.81 (1.94, 4.05) 3.78 × 08 −08 HPV(−) OPC rs112726671 VDR 12 47926100 12q13.11 A G 0.016 - 2.28 (1.70, 3.07) 4.03 × 08 −08 HPV( + ) OPC rs1520483 LTF 3 46468719 3p21.31 C T 0.400 - 1.23 (1.14, 1.32) 2.19 × 08 −08 Mixed Ancestry Group GWAS LA rs200410709 STXBP6 14 25417834 14q12 CT C 0.017 0.013 3.38 (2.26, 5.07) 3.57 × 09 −09 HPC rs150899739 SASH1 6 148061934 6q24.3 G A 0.022 0.008 5.84 (3.17, 10.76) 1.47 × 08 −08 Novel variants identified in meta-analysis and by group across subsites. Full list of significant variants can be found in Supplementary Data 3 CHR BP EAF OR OC LA HPC OPC a For overall HNSCC, two cross-ancestral variants in the 1q32 region were identified. rs61817953, near PIK3C2B meta −8 MDM4 meta −10 S2 2 MDM4 19 20 BRCA2 meta −8 14 TP53 −8 2a 2b S1 TP53 TP53 2c 7 TP53 TP53 21 https://dianalab.e-ce.uth.gr/tarbasev9 2d Fig. 2 Overview of genomic and functional characterisation of the 3′ UTR variant rs78378222. a TP53 P − b c TP53 d https://BioRender.com/8c2hqe9 For OC, three loci were identified (Table 1 meta −10 2 STING1 meta −10 1 3a b CTNNA1) STING1 3c ZGPAT meta −8 2 ZGPAT LIME1 and SLC2A4RG LIME1 S3 7 MAPK1) −8 Fig. 3 Genomic and functional characterisation of 5q31 variants rs28419191 and rs1131769. a P − b m P c CTNNA1 For laryngeal cancer, rs55831773, a cross ancestral splice variant, mapping to ATP1B2 meta −9 ATP1B2 TP53, TP53 S4b TP53 S4 7 meta −14 22 23 2 ABHD8 24 STXBP6 −9 S5 Five HPC specific variants were identified. rs138707495, a rare (MAF: European=0.009, Mixed=0.005) variant located in the 3’ UTR of GDF7 meta −8 IGSF9B meta −8 OPCML meta −08 TENM4 SASH1 −8 S6 At 3p21, rs1520483, an intronic variant in the lactotransferrin ( LTF –8 LTF 25 26 rs112726671, a variant near the vitamin D receptor (VDR) gene, was associated with risk of HPV(-) OPC (OR (95%CI) = 1.23 (1.14, 1.32), p meta −8 2 10 Refining previously identified HNSCC risk variants Loci identified in previous GWAS of HNSCCs at 4q23 (ADH1B ADH1C ADH7 14 (CLPTM1L 11 11 (ZNRD1-AS1) 13 CDKN2B-AS1 11 (ALDH2 14 FGF7 10 ADH7 ADH1B S7a b CLPTM1L 7 Notably, rs11571833 (13q13), the rare (MAF: European = 0.009, Mixed = 0.007) stop gained variant, resulting in a stop codon 93 amino acids early in the BRCA2 protein, was strongly associated with an increased risk of LA (OR (95% CI) = 2.09 (1.65, 2.66), p meta −9 meta −8 S7c d 27 Effect of top hits across HNSCC subsites Subsite-specific variants described above were further evaluated to determine if these variants may be important in other subsites, but were not able to be detected due to power. Posterior probabilities of risk effects across subsites were seen for multiple variants. For variants identified as risk loci for overall HNSCC, there was evidence that specific sites likely drove the effects. For variants that were detected in a single subsite, there was evidence that these may confer also risk in other subsites (Fig. S8 We investigated the contribution of HLA-related top hits from the GWAS to overall variance explained in risk. We found that HPV( + ) OPC had the highest proportion of variability explained by this region compared to other subsites (HPV( + ) OPC: 91%; HPV(−) OPC: 0%; OC: 34%; LA: 0%, HPC: 0%). Distinct interactions of smoking and alcohol use with risk variants We evaluated variants for their specific interactions with smoking and alcohol use (Fig. 4 S9 BRCA2 7 BRCA2 4a Fig. 4 Gene-environment interactions with alcohol and smoking. Effect estimates for ( a BRCA2 b ADH1B c CHRNA5 n n n n p We confirm that rs1229984, the well-described missense variant in the ADH1B S7b S9 7 4b ADH1C ADH7 rs58365910 near CHRNA5 36 S10 4c Novel Loci in the HLA Region Specific to oral cavity and oropharynx cancer Our genome-wide results highlight heterogeneity in the Human Leucocyte Antigen (HLA) region, which encodes genes involved in immune response, across HNSCC subsites. For HPV(+) OPC, signals were identified at both 6p21 and 6p22, but for OC, only the 6p21 signal was seen. The HLA region is particularly susceptible to genetic diversity across populations and is highly polymorphic with a dense LD structure. To account for this, genotyped variants in this region were re-imputed to an HLA-specific reference to define variants, amino acid changes and 4-digit alleles, which were then analysed separately using fine mapping strategies to identify independent signals. Independence of signals was carefully evaluated using linkage and conditional analysis (Supplementary Data 8 9 Overall, 19 independent signals reached significance (Supplementary Data 10 11 2 S11 8 Table 2 Summary of Novel Genetic Variants Identified Across Ancestry-Specific and Meta-Analysis of HLA-fine mapping in all sites combined and subsite-specific Population Subsite Variant Gene Position (hg19) Locus; Cytoband Impact Ref a Effect Allele a OR (95% CI) p-value b Meta-Analysis All sites combined Chr6:33046667 HLA-DPB1 Chr6:33046667 class II intron C T 1.11 (1.07,1.14) 1.32 × 10 −8 rs28360051 PSORS1C3 Chr6:31142261 intron G A 1.23 (1.14,1.34) 1.91 × 10 −7 HPV(−) OPC rs1131212 HLA-B Chr6:31324526 class I Gln94His C G 1.33 (1.19,1.49) 5.33 × 10 −7 HPV( + ) OPC DRB1 37Asn/Ser HLA-DRB1 Chr6:32552051 class II Amino acid change Ab Pr 0.68 (0.63,0.73) 3.22 × 10 −23 rs4143334 ZDHHC20P2 Chr6:31348200 class I Non-coding transcript exon A G 1.89 (1.51,2.35) 1.91 × 10 −8 DRB1 233Thr HLA-DRB1 Chr6:32548048 class II Amino acid change Ab Pr 1.27 (1.17,1.38) 7.15 × 10 −9 B 67Cys/Ser/Tyr HLA-B Chr6:31324536 class I Amino acid change Ab Pr 0.81 (0.74,0.88) 1.33 × 10 −06 Admixed All sites combined rs1536036 ITPR3 Chr6:33632014 Intron A G 0.85 (0.80,0.91) 8.42 × 10 −7 European OC DRB1 74Ala/Leu/Del HLA-DRB1 Chr6:32552625 class II Amino acid change Ab Pr 0.82 (0.77,0.87) 4.94 × 10 −10 rs9267280 MICB-DT Chr6:31457633 class I Intron G A 1.32 (1.19,1.47) 3.48 × 10 −7 HPV( + ) OPC HLA-B*51:01 HLA-B Chr6:31321767 class I Amino acid change Ab Pr 1.9 (1.55,2.31) 3.6 × 10 −10 Novel variants identified in the meta-analysis and ancestry-specific groups are shown here. No novel variants were identified within Middle Eastern, African and South Asian populations. Full list of variants in this region can be found in Supplementary Data 10 8 9 a https://imputationserver.readthedocs.io/en/latest/pipeline b P HLA significance level = 2.4  ×  10-6 considering all variants in chr6. Three intronic variants were associated with the risk of HNSCC overall. The Chr6:33046667 variant, near HLA-DPB1 meta −8 PSORS1C3 meta −7 S11a ITPR3 −7 For HPV( + ) OPC, five variants were identified. rs4143334, in the noncoding transcript exon of ZDHHC20P2 meta −8 meta −23 meta −6 5a DRB1 meta −9 12 △ 5b 12 meta −10 Fig. 5 Cross-ancestry HLA risk loci of HPV( + ) OPC. a −6 b −9 −8 -8 c −9 −23 −7 −8 –12 −6 −10 −10 d e https://BioRender.com/98q9ivz For HPV(-) OPC, rs1131212 was found to be associated with an increased risk cross ancestrally (OR (95%CI) = 1.33 (1.19, 1.49), p meta −7 6a HLA-B HLA-B 10 2 meta −7 6b 12 Fig. 6 Novel HLA risk loci for HPV(-) oropharynx and oral cavity cancer. Manhattan plots display all independent lead variants of risk for HPV(−)(cases = 1470; controls = 38,973) and OC (cases = 5578; controls =38,973) subsite. Variants highlighted under the significance threshold reached significance in later rounds; only the plot from the first round of stepwise logistic-regression analysis is shown here. Novel variants are highlighted in red; known variants are in grey. The horizontal red line reflects the HLA significance threshold (p < 2.4 × 10 −6 a b −7 2 −7 c −7 2 −6 −7 −8 https://BioRender.com/98q9ivz The HLA-A*24 allele tagged the known intronic variant rs1264813 in MICD meta −6 6c 12 A haplotype was identified that tagged the known intronic variant, rs9268925 in DRB9 meta −8 6d 12 −10 −7 Cross ancestry equivalent of established risk variants, including the well-known haplotype DRB1*13:01-DQA1*01:03-DQB1*06:03 The DRB1*13:01-DQA1*01:03-DQB1*06:03 haplotype is well known to reduce the risk of cervical cancer and HPV( + ) OPC 10 11 28 DRB1 5a 5c meta −10 11 5d The rs2523679 variant, which decreases risk of HPV( + ) OPC (OR (95% CI) = 0.63 (0.53, 0.75), p meta −7 2 2 5e 11 12 Discussion Across the GWAS and HLA-focused analyses, we identify 18 genome-wide and 11 HLA-specific novel variants associated with the risk of HNSCC. Due to increased power compared to previous GWA studies, we identified genetic variants including in TP53 and STING1 BRCA2 GDF7 A key finding was the identification of the low-frequency rs78378222 variant located in the 3′ UTR of TP53 TP53 TP53 29 30 21 21 21 31 21 32 TP53 Two closely linked genetic variants were identified in 5q31, including the missense variant rs1131769 found in the cyclic dinucleotide (CDN) binding domain of the TMEM173 CTNNA1 33 We were able to validate several known HNSCC risk variants and further investigate their interaction with major risk factors. rs11571833 has been linked with lung and upper aerodigestive tract cancers 27 BRCA2 BRCA 34 27 34 ADH1B CHRNA5 35 Through HLA fine mapping efforts, we identified 11 loci specific to the HLA region, of which eight were separately associated with risk of OC, HPV( + ) OPC or HPV(-) OPC. Most of the class I loci were found in HLA-B DRB1 A previously unreported class II haplotype was identified for risk of OC, DRB1*15:01-DQA1*01:02-DQB1*06:02. This haplotype has been found to reduce autoantibody development and abnormalities of metabolic traits, such as dysglycemia. As such, this haplotype was found to be protective against progression of type I diabetes (DM) 36 37 38 39 41 42 43 44 The well-known haplotype, DRB1*13:01-DQA1*01:03-DQB1*06:03, has been found to be protective against cervical cancer and HPV( + ) OPC, highlighting its role in detecting HPV infection 10 11 28 The intronic rs2523679 variant is a cross-ancestral equivalent of HLA-B*15:01 and HLA-B 156Trp, two previously identified European-specific variants. This now identified variant can be used to evaluate risk of HPV( + ) OPC across multiple ancestries, and highlights the importance of including non-European populations, even with limited sample size. In this work, we were limited by the power of non-European populations, forcing us to combine multiple populations. Although this did provide additional power for discovery, it will have reduced the ability to identify variants specific to certain populations. Where variants were specific to non-European ancestries, we were able to assess these in the different populations, but increased sample sizes from more diverse populations should still be seen as a priority in this field. Although analysing all-site HNSCC can be beneficial, it must be remembered that these cancers are heterogeneous, and the subsite analyses provide a clearer picture of the genetic architecture of the conditions. Where we identify genetic variants in one site, we assess the effect of this variant across all subsites to assess the heterogeneity, but despite the increased sample size in this study, there may still be limited power for discovery, especially in the less common subsites such as HPC. In addition, future studies using the variants identified here for downstream analysis should consider performing further validations, particularly for those with borderline genome-wide significance. In summary, in this HNSCC GWAS, which includes diverse populations, we identify 18 novel genome-wide associated variants and 11 HLA-specific novel variants associated with HNSCC and its subsites, including rs78378222 in the TP53 BRCA2 ADH1B Methods This research complies with all relevant ethical regulations. All contributing studies obtained ethics approval from their respective local Institutional Review Boards (IRBs) or ethics committees, with written informed consent from participants. For the meta-analysis and secondary analysis of individual-level data, ethics approval was granted by the International Agency for Research on Cancer (IARC) Ethics Committee (IEC 19–38). Study design and populations Individual-level data came from 18 studies across 23 countries in Europe, the Middle East, North America, South America, and South Asia, and 9 genotyping arrays (Supplementary Data 1 45 Nineteen studies were included here with either multi-centre case-control, cohort, or clinical trial study designs. Previously generated data were either downloaded from dbGap, requested through controlled access from relevant consortia, or contributed by the study PIE, who contributed 10,404 cases and 34,596 controls. Controls from the UKBiobank study were selected by first excluding UKBiobank participants with a previous cancer diagnosis or missing data on key variables such as smoking or alcohol use, and then randomly selecting 10 controls for each HNSCC case. New genotyping data were generated for 8,669 cases and 4,261 controls and were not included in any previous GWAS. All study details, including data sources, dbGap accession numbers and case control distributions across subsites, can be found in Supplementary Data 1 13 Genotype quality control and imputation A flow diagram detailing the preparation of the genetic data can be found in the supplementary material (Fig. S12 1 https://genome.ucsc.edu/cgi-bin/hgLiftOver 46 47 −5 2 14 48 49 To increase the number of controls comparable to the participants in the HN5000 study, 17,815 additional participants (including known related individuals) were included from the Avon Longitudinal Study of Parents and Children (ALSPAC), which had been previously genotyped (Supplementary Data 1 50 51 1 2 2 Genetic ancestry stratification Following the imputation process, markers from each imputation batch were filtered based on an imputation score of R 2 52 47 53 S13 54 S14a b S15 S16 Association, meta- and conditional analysis Using individual-level data, we conducted a mega-analysis within the ancestral groups and where possible subsequently meta-analysed across the two ancestry groups (Fig. S12 Across the 9 arrays and 19 studies, there were several considerations in how to adjust for batch effects. Some studies, such as ARCAGE, were split across different arrays, such as the Oncoarray and AllofUs array. For other studies, such as UKBiobank, several arrays were used (UKBiLEVE and AffymetricUKB) (Supplementary Data 1 55 p −8 15 Association analysis was conducted separately for all sites combined and for each HNSCC subsite using PLINK. Analyses were logistic regressions for each variant, adjusted for sex, batch and informative PCs, which were selected based 55 S12 S17 −8 −8 16 https://my.locuszoom.org/ We utilised METASOFT 56 HLA fine mapping Variants that were directly genotyped in chromosome 6 were extracted from genotyping data of all arrays and standardised to hg19 using LiftOver. Due to restrictions in data access from ALSPAC, additional data from the UK Biobank were used to replace ALSPAC for double imputation with HN5000 as described above. Per variant QC was conducted by deduplication of SNP data, strand alignment, removal of palindromic variants (i.e., SNPs with A/T or G/C alleles), removal of poor-quality variants with a missingness threshold of 10% and a Hardy-Weinberg equilibrium threshold of 1 × 10 −10 S18 The HLA region (Chromosome 6:28Mb–34Mb) was imputed for SNPs and classical HLA class I and II alleles using the Michigan imputation server with the most recent HLA Multi-ethnic reference panel (Four-digit Multi-ethnic HLA v2) 57 2 2 47 −6 58 To identify haplotypes associated with risk within each subsite that were linked to the top novel variants identified from fine mapping, the haplo.stats package v.1.9.5.1 in R was applied to identify combinations of HLA 4-digit alleles within each population. The haplo.em and haplo.glm algorithms identified haplotype candidates in each population with a minimum haplotype frequency threshold set at 0.01 in comparison to the most common haplotype within the ancestry. Haplotype candidates that were in high LD (r 2 Testing for Independence and functional equivalents of lead variants Variants identified in each HNSCC subsite analysis from the GWAS and fine mapping were compared across subsites to evaluate whether they were linked or independent. This was also performed to define variants that were novel compared to previously reported signals and to determine overlapping signals between cross-ancestral and population-specific variants. LD was measured by r 2 47 −6 To determine functional equivalents of the variants identified through fine mapping, amino acid changes, alleles and haplotypes that were in moderate to high LD (r 2 Stratified analyses For each independent top hit identified in GWAS and HLA fine mapping, the analysis was repeated, stratified by sex, smoking status, drinking status, geographic region, and within all cancer subsites separately. The effects across strata were assessed for heterogeneity using the χ 2 S7 S9 Heritability and genetic correlation SNP-based heritability was estimated in the European and Mixed ancestry samples using linkage disequilibrium score regression (LDSR) 59 60 6 Colocalization of GWAS-identified variants with molecular QTLs and lifestyle risk factors Colocalization of genetic associations between all identified top hit variants from GWAS analyses outside of HLA regions and their gene expression and related traits was calculated using default LDs and a window size of ±75 kb using the COLOC package 61 62 63 64 64 65 p p − Technical validation For the technical validation of the imputed TP53 Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Peer Review File Description of Additional Supplementary Files Supplementary Data 1 Supplementary Data 2 Supplementary Data 3 Supplementary Data 4 Supplementary Data 5 Supplementary Data 6 Supplementary Data 7 Supplementary Data 8 Supplementary Data 9 Supplementary Data 10 Supplementary Data 11 Supplementary Data 12 Supplementary Data 13 Supplementary Data 14 Supplementary Data 15 Supplementary Data 16 Reporting Summary Source data  Source Data Publisher’s note These authors contributed equally: Shama Virani, Tom Dudding. A list of authors and their affiliations appears online.T#888822079573oj Supplementary information The online version contains supplementary material available at 10.1038/s41467-025-63842-z. Acknowledgements This study was funded in part by the European Union’s Horizon 2020 research and innovation programme under grant agreement No 825771 (PB, SV) (HEADSpAcE project) and by the US National Institute of Dental and Craniofacial Research (NIDCR) grants R03DE030257 (SV) and R01DE025712 (PB, BD). Genotyping using the Oncoarray and the All of Us array was performed at Centre for Inherited Disease (CIDR) and funded by NIDCR 1X01HG007780-0 (PB) and jointly by NIDCR/NCI X01HG010743 (SV). This publication presents data from the Head and Neck 5000 study. The study was a component of independent research funded by the National Institute for Health and Care Research (NIHR) under its Programme Grants for Applied Research scheme (RP-PG-0707-10034). The views expressed in this publication are those of the author(s) and not necessarily those of the NHS, the NIHR or the Department of Health. Core funding was also provided through awards from Above and Beyond, University Hospitals Bristol and Weston Research Capability Funding and the NIHR Senior Investigator award to Professor Andy Ness. Round 1 genotyping was funded by a US National Institute of Dental and Craniofacial Research (NIDCR) grant 1X01HG007780-0. Round 2 genotyping was funded by World Cancer Research Fund Pilot Grant (grant number: 2018/1792), Above and Beyond Charity (GA2500), Wellcome Trust Research Training Fellowship (201237/Z/16/Z) and Cancer Research UK Programme Grant, the Integrative Cancer Epidemiology Programme (grant number: C18281/A19169). This latter grant also supported Human papillomavirus (HPV) serology. This research has been conducted using the UK Biobank Resource under Application Number 40644. The work of Tom Dudding was supported by an NIHR Clinical Lectureship (CL-2022-25-007). The work of Dr. Polesel is partially supported by the Italian Ministry of Health ‘Ricerca Corrente’. The University of Pittsburgh head and neck cancer case-control study is supported by US National Institutes of Health grants P50CA097190, P30CA047904 and R01DE025712 (PB, BD). Geoffrey Liu is the M. Qasim Choksi Research Chair in Translational Research at University Health Network and University of Toronto and is supported by the Princess Margaret Head and Neck Translational Programme, which is supported by philanthropic funds from the Wharton Family, Joe’s Team, Gordon Tozer, Reed Fund, and the Riley Family. The University of North Carolina studies were supported in part by grants CA61188 (AO) and CA90731 (AO) from the National Institutes of Health. Northern Cancer Foundation (Principal Investigator Grants to MSC Conlon, DP Saunders). Rayjean J. Hung is the CIHR Canada Research Chair, and the study is supported by the Canadian Cancer Society and the Canadian Institute of Health Research. Tim Waterboer serves on advisory boards for MSD (Merck) Sharp & Dohme. Scott V Bratman is an inventor on patents related to cell-free DNA mutation and methylation analysis technologies that are unrelated to this work and have been licensed to Roche and Adela, respectively. Scott V Bratman is a co-founder of and has ownership in Adela. The authors would like to thank all the patients and their families involved in these studies. Where members are identified as personnel of the International Agency for Research on Cancer/ World Health Organisation, the authors alone are responsible for the views expressed in this article, and they do not necessarily represent the decisions, policy or views of the International Agency for Research on Cancer / World Health Organisation. Author contributions S.V. and T.D. conceived and led the project, providing overall direction, coordination, and supervision throughout all stages. E.E. and A.S. led the data analysis and manuscript writing, with E.E. leading the work as first author. H.A.P. and J.M. contributed substantially to data analysis and interpretation and were closely involved in manuscript preparation. V.G. supported data analysis. N.T., P.B., A.F.I., M.G., B.D., and S.H. advised on study design, data interpretation, and contextualisation. W.A., L.Ale., L.M.R.B.A., J.B., S.V.B., C.C., M.S.C.C., D.I.C., M.C., M.Cur., A.d.C., Jd.O., M.H., C.M.H., I.H., R.J.H., L.P.K., P.Lag., A.Lag., G.L., G.J.M., A.F.O., S.P., L.F.P., J.V.P., J.P., M.P., H.R., R.R.G., L.R., M.R., P.A.R.U., S.A.S., D.P.S., S.C.S.L., M.V., S.V.Z., T.W., K.Z., and A.Z. contributed primary data and biospecimens. All authors reviewed and approved the final manuscript. Peer review Peer review information Nature Communications Data availability The full GWAS summary statistics have been deposited in the MRC IEU OpenGWAS database and will be publicly available at https://gwas.mrcieu.ac.uk/ https://opengwas.io/datasets/ieu-b-5129 https://opengwas.io/datasets/ieu-b-5130 https://opengwas.io/datasets/ieu-b-5131 https://opengwas.io/datasets/ieu-b-5132 https://opengwas.io/datasets/ieu-b-5133 https://opengwas.io/datasets/ieu-b-5134 https://www.ncbi.nlm.nih.gov/projects/gap/cgi-bin/study.cgi?study_id=phs001273.v4.p2 https://www.ncbi.nlm.nih.gov/projects/gap/cgi-bin/study.cgi?study_id=phs001202.v2.p1 https://www.ncbi.nlm.nih.gov/projects/gap/cgi-bin/study.cgi?study_id=phs001173.v1.p1 https://www.ncbi.nlm.nih.gov/projects/gap/cgi-bin/study.cgi?study_id=phs002503.v1.p1 https://dbgap.ncbi.nlm.nih.gov/aa/wga.cgi?page=login 5000, https://www.ukbiobank.ac.uk/enable-your-research/apply-for-access ALSPAC Source data Code availability This study did not employ any custom code. Instead, it utilised publicly available software tools for genetic analyses, which are cited throughout the manuscript and reporting summary. Competing interests All Authors declare no competing interests. References 1. Sung H Global Cancer Statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2021 71 209 249 33538338 10.3322/caac.21660 Sung, H. et al. Global Cancer Statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J. Clin. 71 33538338 10.3322/caac.21660 2. Johnson DE Head and neck squamous cell carcinoma Nat. Rev. Dis. Prim. 2020 6 1 22 33243986 10.1038/s41572-020-00224-3 PMC7944998 Johnson, D. E. et al. Head and neck squamous cell carcinoma. Nat. Rev. Dis. Prim. 6 33243986 10.1038/s41572-020-00224-3 PMC7944998 3. Lubin JH An examination of male and female odds ratios by BMI, cigarette smoking, and alcohol consumption for cancers of the oral cavity, pharynx, and larynx in pooled data from 15 case-control studies Cancer Causes Control 2011 22 1217 1231 21744095 10.1007/s10552-011-9792-x PMC3304584 Lubin, J. H. et al. An examination of male and female odds ratios by BMI, cigarette smoking, and alcohol consumption for cancers of the oral cavity, pharynx, and larynx in pooled data from 15 case-control studies. Cancer Causes Control 22 21744095 10.1007/s10552-011-9792-x PMC3304584 4. Thomas SJ Penfold CM Waylen A Ness AR The changing aetiology of head and neck squamous cell cancer: a tale of three cancers? Clin. Otolaryngol. 2018 43 999 1003 10.1111/coa.13144 29770611 Thomas, S. J., Penfold, C. M., Waylen, A. & Ness, A. R. The changing aetiology of head and neck squamous cell cancer: a tale of three cancers?. Clin. Otolaryngol. 43 29770611 10.1111/coa.13144 5. Hobbs CGL Human papillomavirus and head and neck cancer: a systematic review and meta-analysis Clin. Otolaryngol. 2006 31 259 266 10.1111/j.1749-4486.2006.01246.x 16911640 Hobbs, C. G. L. et al. Human papillomavirus and head and neck cancer: a systematic review and meta-analysis. Clin. Otolaryngol. 31 16911640 10.1111/j.1749-4486.2006.01246.x 6. Gillison ML Chaturvedi AK Anderson WF Fakhry C Epidemiology of human papillomavirus-positive head and neck squamous cell carcinoma J. Clin. Oncol. 2015 33 3235 3242 10.1200/JCO.2015.61.6995 26351338 PMC4979086 Gillison, M. L., Chaturvedi, A. K., Anderson, W. F. & Fakhry, C. Epidemiology of human papillomavirus-positive head and neck squamous cell carcinoma. J. Clin. Oncol. 33 26351338 10.1200/JCO.2015.61.6995 PMC4979086 7. Chaturvedi AK Human papillomavirus and rising oropharyngeal cancer incidence in the United States J. Clin. Oncol. 2011 29 4294 4301 10.1200/JCO.2011.36.4596 21969503 PMC3221528 Chaturvedi, A. K. et al. Human papillomavirus and rising oropharyngeal cancer incidence in the United States. J. Clin. Oncol. 29 21969503 10.1200/JCO.2011.36.4596 PMC3221528 8. Jamieson LM Cohort profile: indigenous human papillomavirus and oropharyngeal squamous cell carcinoma study - a prospective longitudinal cohort BMJ Open 2021 11 e046928 10.1136/bmjopen-2020-046928 34083343 PMC8183277 Jamieson, L. M. et al. Cohort profile: indigenous human papillomavirus and oropharyngeal squamous cell carcinoma study - a prospective longitudinal cohort. BMJ Open 11 34083343 10.1136/bmjopen-2020-046928 PMC8183277 9. WHO Classification of Tumours Editorial Board. Head and Neck Tumours: WHO Classification of Tumours 9 10. Ferreiro-Iglesias, A. et al. Germline determinants of humoral immune response to HPV-16 protect against oropharyngeal cancer. Nat. Commun. 12 10.1038/s41467-021-26151-9 PMC8511029 34642315 11. Lesseur C Genome-wide association analyses identify new susceptibility loci for oral cavity and pharyngeal cancer Nat. Genet 2016 48 1544 1550 10.1038/ng.3685 27749845 PMC5131845 Lesseur, C. et al. Genome-wide association analyses identify new susceptibility loci for oral cavity and pharyngeal cancer. Nat. Genet 48 27749845 10.1038/ng.3685 PMC5131845 12. Lesseur C Genome-wide association meta-analysis identifies pleiotropic risk loci for aerodigestive squamous cell cancers PLoS Genet 2021 17 e1009254 10.1371/journal.pgen.1009254 33667223 PMC7968735 Lesseur, C. et al. Genome-wide association meta-analysis identifies pleiotropic risk loci for aerodigestive squamous cell cancers. PLoS Genet 17 33667223 10.1371/journal.pgen.1009254 PMC7968735 13. Shete, S. et al. A genome-wide association study identifies two novel susceptible regions for squamous cell carcinoma of the head and neck. Cancer Res. 10.1158/0008-5472.CAN-19-2360 PMC7299763 32276964 14. McKay JD A genome-wide association study of upper aerodigestive tract cancers conducted within the INHANCE consortium PLoS Genet 2011 7 e1001333 10.1371/journal.pgen.1001333 21437268 PMC3060072 McKay, J. D. et al. A genome-wide association study of upper aerodigestive tract cancers conducted within the INHANCE consortium. PLoS Genet 7 21437268 10.1371/journal.pgen.1001333 PMC3060072 15. Elmusrati A Wang J Wang CY Tumor microenvironment and immune evasion in head and neck squamous cell carcinoma Int J. Oral. Sci. 2021 13 24 10.1038/s41368-021-00131-7 34341329 PMC8329257 Elmusrati, A., Wang, J. & Wang, C. Y. Tumor microenvironment and immune evasion in head and neck squamous cell carcinoma. Int J. Oral. Sci. 13 34341329 10.1038/s41368-021-00131-7 PMC8329257 16. Zhang Z Polymorphisms in the PVT1 gene and susceptibility to the lung cancer in a chinese northeast population: a case-control study J. Cancer 2020 11 468 478 10.7150/jca.34320 31897242 PMC6930418 Zhang, Z. et al. Polymorphisms in the PVT1 gene and susceptibility to the lung cancer in a chinese northeast population: a case-control study. J. Cancer 11 31897242 10.7150/jca.34320 PMC6930418 17. Song N Evaluation of gene-environment interactions for colorectal cancer susceptibility loci using case-only and case-control designs BMC Cancer 2019 19 1 10 10.1186/s12885-019-6456-9 31849324 PMC6918639 Song, N. et al. Evaluation of gene-environment interactions for colorectal cancer susceptibility loci using case-only and case-control designs. BMC Cancer 19 31849324 10.1186/s12885-019-6456-9 PMC6918639 18. Lesseur C A case-control study of polymorphisms in xenobiotic and arsenic metabolism genes and arsenic-related bladder cancer in New Hampshire Toxicol. Lett. 2012 210 100 106 10.1016/j.toxlet.2012.01.015 22306368 PMC3374400 Lesseur, C. et al. A case-control study of polymorphisms in xenobiotic and arsenic metabolism genes and arsenic-related bladder cancer in New Hampshire. Toxicol. Lett. 210 22306368 10.1016/j.toxlet.2012.01.015 PMC3374400 19. Garcia-Closas M Genome-wide association studies identify four ER-negative-specific breast cancer risk loci Nat. Genet 2013 45 392 398 10.1038/ng.2561 23535733 PMC3771695 Garcia-Closas, M. et al. Genome-wide association studies identify four ER-negative-specific breast cancer risk loci. Nat. Genet 45 23535733 10.1038/ng.2561 PMC3771695 20. Eeles RA Identification of 23 new prostate cancer susceptibility loci using the iCOGS custom genotyping array Nat. Genet 2013 45 385 391 10.1038/ng.2560 23535732 PMC3832790 Eeles, R. A. et al. Identification of 23 new prostate cancer susceptibility loci using the iCOGS custom genotyping array. Nat. Genet 45 23535732 10.1038/ng.2560 PMC3832790 21. Stacey SN A germline variant in the TP53 polyadenylation signal confers cancer susceptibility Nat. Genet 2011 43 1098 1103 10.1038/ng.926 21946351 PMC3263694 Stacey, S. N. et al. A germline variant in the TP53 polyadenylation signal confers cancer susceptibility. Nat. Genet 43 21946351 10.1038/ng.926 PMC3263694 22. Zaidi AA Verma A Morse C Ritchie MD Mathieson I The genetic and phenotypic correlates of mtDNA copy number in a multi-ancestry cohort HGG Adv. 2023 4 100202 37255673 10.1016/j.xhgg.2023.100202 PMC10225932 Zaidi, A. A., Verma, A., Morse, C., Ritchie, M. D. & Mathieson, I. The genetic and phenotypic correlates of mtDNA copy number in a multi-ancestry cohort. HGG Adv. 4 37255673 10.1016/j.xhgg.2023.100202 PMC10225932 23. Hägg S Jylhävä J Wang Y Czene K Grassmann F Deciphering the genetic and epidemiological landscape of mitochondrial DNA abundance Hum. Genet 2021 140 849 861 10.1007/s00439-020-02249-w 33385171 PMC8099832 Hägg, S., Jylhävä, J., Wang, Y., Czene, K. & Grassmann, F. Deciphering the genetic and epidemiological landscape of mitochondrial DNA abundance. Hum. Genet 140 33385171 10.1007/s00439-020-02249-w PMC8099832 24. Guo H Cao W Zhu Y Li T Hu B A genome-wide cross-cancer meta-analysis highlights the shared genetic links of five solid cancers Front Microbiol 2023 14 1116592 10.3389/fmicb.2023.1116592 36819030 PMC9935838 Guo, H., Cao, W., Zhu, Y., Li, T. & Hu, B. A genome-wide cross-cancer meta-analysis highlights the shared genetic links of five solid cancers. Front Microbiol 14 36819030 10.3389/fmicb.2023.1116592 PMC9935838 25. Drobni P Näslund J Evander M Lactoferrin inhibits human papillomavirus binding and uptake in vitro Antivir. Res 2004 64 63 68 10.1016/j.antiviral.2004.05.005 15451180 Drobni, P., Näslund, J. & Evander, M. Lactoferrin inhibits human papillomavirus binding and uptake in vitro. Antivir. Res 64 15451180 10.1016/j.antiviral.2004.05.005 26. Bukowska-Ośko I Lactoferrin as a human genome “Guardian”—an overall point of view Int J. Mol. Sci. 2022 23 5248 10.3390/ijms23095248 35563638 PMC9105968 Bukowska-Ośko, I. et al. Lactoferrin as a human genome “Guardian”—an overall point of view. Int J. Mol. Sci. 23 35563638 10.3390/ijms23095248 PMC9105968 27. Delahaye-Sourdeix M A rare truncating BRCA2 variant and genetic susceptibility to upper aerodigestive tract cancer J. Natl Cancer Inst. 2015 107 djv037 10.1093/jnci/djv037 25838448 PMC4822523 Delahaye-Sourdeix, M. et al. A rare truncating BRCA2 variant and genetic susceptibility to upper aerodigestive tract cancer. J. Natl Cancer Inst. 107 25838448 10.1093/jnci/djv037 PMC4822523 28. Chen D Genome-wide association study of susceptibility loci for cervical cancer J. Natl Cancer Inst. 2013 105 624 633 10.1093/jnci/djt051 23482656 Chen, D. et al. Genome-wide association study of susceptibility loci for cervical cancer. J. Natl Cancer Inst. 105 23482656 10.1093/jnci/djt051 29. Guan X Wang LE Liu Z Sturgis EM Wei Q Association between a rare novel TP53 variant (rs78378222) and melanoma, squamous cell carcinoma of head and neck and lung cancer susceptibility in non-Hispanic Whites J. Cell Mol. Med 2013 17 873 878 10.1111/jcmm.12076 23742673 PMC3729608 Guan, X., Wang, L. E., Liu, Z., Sturgis, E. M. & Wei, Q. Association between a rare novel TP53 variant (rs78378222) and melanoma, squamous cell carcinoma of head and neck and lung cancer susceptibility in non-Hispanic Whites. J. Cell Mol. Med 17 23742673 10.1111/jcmm.12076 PMC3729608 30. Zhang H Genome-wide association study identifies 32 novel breast cancer susceptibility loci from overall and subtype-specific analyses Nat. Genet. 2020 52 572 581 10.1038/s41588-020-0609-2 32424353 PMC7808397 Zhang, H. et al. Genome-wide association study identifies 32 novel breast cancer susceptibility loci from overall and subtype-specific analyses. Nat. Genet. 52 32424353 10.1038/s41588-020-0609-2 PMC7808397 31. Zhou L Yuan Q Yang M A functional germline variant in the P53 polyadenylation signal and risk of esophageal squamous cell carcinoma Gene 2012 506 295 297 10.1016/j.gene.2012.07.007 22800615 Zhou, L., Yuan, Q. & Yang, M. A functional germline variant in the P53 polyadenylation signal and risk of esophageal squamous cell carcinoma. Gene 506 22800615 10.1016/j.gene.2012.07.007 32. Diskin SJ Rare variants in TP53 and susceptibility to neuroblastoma J. Natl. Cancer Inst. 2014 106 dju047 10.1093/jnci/dju047 24634504 PMC3982892 Diskin, S. J. et al. Rare variants in TP53 and susceptibility to neuroblastoma. J. Natl. Cancer Inst. 106 24634504 10.1093/jnci/dju047 PMC3982892 33. Lobo S Cancer predisposition and germline CTNNA1 variants Eur. J. Med. Genet 2021 64 104316 10.1016/j.ejmg.2021.104316 34425242 Lobo, S. et al. Cancer predisposition and germline CTNNA1 variants. Eur. J. Med. Genet 64 34425242 10.1016/j.ejmg.2021.104316 34. Rafnar T Association of brca2 k3326∗ with small cell lung cancer and squamous cell cancer of the skin J. Natl. Cancer Inst. 2018 110 967 974 10.1093/jnci/djy002 29767749 PMC6136924 Rafnar, T. et al. Association of brca2 k3326∗ with small cell lung cancer and squamous cell cancer of the skin. J. Natl. Cancer Inst. 110 29767749 10.1093/jnci/djy002 PMC6136924 35. Ware JJ Van den bree MBM Munafò MR Association of the CHRNA5-A3-B4 gene cluster with heaviness of smoking: a meta-analysis Nicotine Tob. Res. 2011 13 1167 10.1093/ntr/ntr118 22071378 PMC3223575 Ware, J. J., Van den bree, M. B. M. & Munafò, M. R. Association of the CHRNA5-A3-B4 gene cluster with heaviness of smoking: a meta-analysis. Nicotine Tob. Res. 13 22071378 10.1093/ntr/ntr118 PMC3223575 36. Pugliese A HLA-DRB1*15:01-DQA1*01:02-DQB1*06:02 haplotype protects autoantibody-positive relatives from type 1 diabetes throughout the stages of disease progression Diabetes 2016 65 1109 1119 10.2337/db15-1105 26822082 PMC4806662 Pugliese, A. et al. HLA-DRB1*15:01-DQA1*01:02-DQB1*06:02 haplotype protects autoantibody-positive relatives from type 1 diabetes throughout the stages of disease progression. Diabetes 65 26822082 10.2337/db15-1105 PMC4806662 37. Ramos-Garcia P Roca-Rodriguez M del M Aguilar-Diosdado M Gonzalez-Moles MA Diabetes mellitus and oral cancer/oral potentially malignant disorders: a systematic review and meta-analysis Oral. Dis. 2021 27 404 421 10.1111/odi.13289 31994293 Ramos-Garcia, P., Roca-Rodriguez, M., del, M., Aguilar-Diosdado, M. & Gonzalez-Moles, M. A. Diabetes mellitus and oral cancer/oral potentially malignant disorders: a systematic review and meta-analysis. Oral. Dis. 27 31994293 10.1111/odi.13289 38. Tseng KS Lin C Lin YS Weng SF Risk of head and neck cancer in patients with diabetes mellitus: a retrospective cohort study in Taiwan JAMA Otolaryngol. Head. Neck Surg. 2014 140 746 753 10.1001/jamaoto.2014.1258 25058016 Tseng, K. S., Lin, C., Lin, Y. S. & Weng, S. F. Risk of head and neck cancer in patients with diabetes mellitus: a retrospective cohort study in Taiwan. JAMA Otolaryngol. Head. Neck Surg. 140 25058016 10.1001/jamaoto.2014.1258 39. Zhou XH Diabetes, prediabetes and cancer mortality Diabetologia 2010 53 1867 1876 10.1007/s00125-010-1796-7 20490448 Zhou, X. H. et al. Diabetes, prediabetes and cancer mortality. Diabetologia 53 20490448 10.1007/s00125-010-1796-7 40. Lo SF Modest increase in risk of specific types of cancer types in type 2 diabetes mellitus patients Int J. Cancer 2013 132 182 188 10.1002/ijc.27597 22510866 Lo, S. F. et al. Modest increase in risk of specific types of cancer types in type 2 diabetes mellitus patients. Int J. Cancer 132 22510866 10.1002/ijc.27597 41. Stott-Miller M History of diabetes and risk of head and neck cancer: a pooled analysis from the international head and neck cancer epidemiology consortium Cancer Epidemiol. Biomark. Prev. 2012 21 294 304 10.1158/1055-9965.EPI-11-0590 PMC3275674 22144496 Stott-Miller, M. et al. History of diabetes and risk of head and neck cancer: a pooled analysis from the international head and neck cancer epidemiology consortium. Cancer Epidemiol. Biomark. Prev. 21 10.1158/1055-9965.EPI-11-0590 PMC3275674 22144496 42. Kachuri L The landscape of host genetic factors involved in immune response to common viral infections Genome Med. 2020 12 1 18 10.1186/s13073-020-00790-x PMC7590248 33109261 Kachuri, L. et al. The landscape of host genetic factors involved in immune response to common viral infections. Genome Med. 12 10.1186/s13073-020-00790-x PMC7590248 33109261 43. Orlandi E Potential role of microbiome in oncogenesis, outcome prediction and therapeutic targeting for head and neck cancer Oral. Oncol. 2019 99 104453 10.1016/j.oraloncology.2019.104453 31683170 Orlandi, E. et al. Potential role of microbiome in oncogenesis, outcome prediction and therapeutic targeting for head and neck cancer. Oral. Oncol. 99 31683170 10.1016/j.oraloncology.2019.104453 44. Kwak S Oral microbiome and subsequent risk of head and neck squamous cell cancer JAMA Oncol. 2024 10 1537 1547 10.1001/jamaoncol.2024.4006 39325441 PMC11428028 Kwak, S. et al. Oral microbiome and subsequent risk of head and neck squamous cell cancer. JAMA Oncol. 10 39325441 10.1001/jamaoncol.2024.4006 PMC11428028 45. Hibbert J Halec G Baaken D Waterboer T Brenner N Sensitivity and specificity of human papillomavirus (Hpv) 16 early antigen serology for HPV-driven oropharyngeal cancer: a systematic literature review and meta-analysis Cancers (Basel) 2021 13 3010 10.3390/cancers13123010 34208476 PMC8234521 Hibbert, J., Halec, G., Baaken, D., Waterboer, T. & Brenner, N. Sensitivity and specificity of human papillomavirus (Hpv) 16 early antigen serology for HPV-driven oropharyngeal cancer: a systematic literature review and meta-analysis. Cancers (Basel) 13 34208476 10.3390/cancers13123010 PMC8234521 46. Meyer H. V. plinkQC: Genotype quality control in genetic association studies. Zenodo 47. Chang CC Second-generation PLINK: rising to the challenge of larger and richer datasets Gigascience 2015 4 7 10.1186/s13742-015-0047-8 25722852 PMC4342193 Chang, C. C. et al. Second-generation PLINK: rising to the challenge of larger and richer datasets. Gigascience 4 25722852 10.1186/s13742-015-0047-8 PMC4342193 48. Taliun D Sequencing of 53,831 diverse genomes from the NHLBI TOPMed Program Nature 2021 590 290 299 10.1038/s41586-021-03205-y 33568819 PMC7875770 Taliun, D. et al. Sequencing of 53,831 diverse genomes from the NHLBI TOPMed Program. Nature 590 33568819 10.1038/s41586-021-03205-y PMC7875770 49. Das S Next-generation genotype imputation service and methods Nat. Genet 2016 48 1284 1287 10.1038/ng.3656 27571263 PMC5157836 Das, S. et al. Next-generation genotype imputation service and methods. Nat. Genet 48 27571263 10.1038/ng.3656 PMC5157836 50. Fraser A Cohort profile: The Avon longitudinal study of parents and children: ALSPAC mothers cohort Int J. Epidemiol. 2013 42 97 110 10.1093/ije/dys066 22507742 PMC3600619 Fraser, A. et al. Cohort profile: The Avon longitudinal study of parents and children: ALSPAC mothers cohort. Int J. Epidemiol. 42 22507742 10.1093/ije/dys066 PMC3600619 51. Jones RW A new human genetic resource: a DNA bank established as part of the Avon longitudinal study of pregnancy and childhood (ALSPAC) Eur. J. Hum. Genet 2000 8 653 660 10.1038/sj.ejhg.5200502 10980570 Jones, R. W. et al. A new human genetic resource: a DNA bank established as part of the Avon longitudinal study of pregnancy and childhood (ALSPAC). Eur. J. Hum. Genet 8 10980570 10.1038/sj.ejhg.5200502 52. Manichaikul A Robust relationship inference in genome-wide association studies Bioinformatics 2010 26 2867 2873 10.1093/bioinformatics/btq559 20926424 PMC3025716 Manichaikul, A. et al. Robust relationship inference in genome-wide association studies. Bioinformatics 26 20926424 10.1093/bioinformatics/btq559 PMC3025716 53. Alexander DH Novembre J Lange K Fast model-based estimation of ancestry in unrelated individuals Genome Res. 2009 19 1655 1664 10.1101/gr.094052.109 19648217 PMC2752134 Alexander, D. H., Novembre, J. & Lange, K. Fast model-based estimation of ancestry in unrelated individuals. Genome Res. 19 19648217 10.1101/gr.094052.109 PMC2752134 54. 1000 Genomes Project Consortium A global reference for human genetic variation Nature 2015 526 68 74 10.1038/nature15393 26432245 PMC4750478 1000 Genomes Project Consortium et al. A global reference for human genetic variation. Nature 526 26432245 10.1038/nature15393 PMC4750478 55. Willer CJ Li Y Abecasis GR METAL: fast and efficient meta-analysis of genomewide association scans Bioinformatics Applications Note 2010 26 2190 2191 10.1093/bioinformatics/btq340 PMC2922887 20616382 Willer, C. J., Li, Y. & Abecasis, G. R. METAL: fast and efficient meta-analysis of genomewide association scans. Bioinformatics Applications Note 26 10.1093/bioinformatics/btq340 PMC2922887 20616382 56. Han, B. & Eskin, E. Interpreting meta-analyses of genome-wide association studies. PLoS Genet 8 10.1371/journal.pgen.1002555 PMC3291559 22396665 57. Luo Y A high-resolution HLA reference panel capturing global population diversity enables multi-ancestry fine-mapping in HIV host response Nat. Genet. 2021 53 1504 1516 10.1038/s41588-021-00935-7 34611364 PMC8959399 Luo, Y. et al. A high-resolution HLA reference panel capturing global population diversity enables multi-ancestry fine-mapping in HIV host response. Nat. Genet. 53 34611364 10.1038/s41588-021-00935-7 PMC8959399 58. Okada Y Fine mapping major histocompatibility complex associations in psoriasis and its clinical subtypes Am. J. Hum. Genet 2014 95 162 172 10.1016/j.ajhg.2014.07.002 25087609 PMC4129407 Okada, Y. et al. Fine mapping major histocompatibility complex associations in psoriasis and its clinical subtypes. Am. J. Hum. Genet 95 25087609 10.1016/j.ajhg.2014.07.002 PMC4129407 59. Bulik-Sullivan BK LD Score regression distinguishes confounding from polygenicity in genome-wide association studies Nat. Genet 2015 47 291 295 10.1038/ng.3211 25642630 PMC4495769 Bulik-Sullivan, B. K. et al. LD Score regression distinguishes confounding from polygenicity in genome-wide association studies. Nat. Genet 47 25642630 10.1038/ng.3211 PMC4495769 60. Cuéllar-Partida, G. et al. Complex-traits genetics virtual lab: a community-driven web platform for post-GWAS analyses. Preprint at bioRxiv 61. Giambartolomei C Bayesian test for colocalisation between pairs of genetic association studies using summary statistics PLoS Genet. 2014 10 e1004383 10.1371/journal.pgen.1004383 24830394 PMC4022491 Giambartolomei, C. et al. Bayesian test for colocalisation between pairs of genetic association studies using summary statistics. PLoS Genet. 10 24830394 10.1371/journal.pgen.1004383 PMC4022491 62. Võsa U Large-scale cis- and trans-eQTL analyses identify thousands of genetic loci and polygenic scores that regulate blood gene expression Nat. Genet 2021 53 1300 1310 10.1038/s41588-021-00913-z 34475573 PMC8432599 Võsa, U. et al. Large-scale cis- and trans-eQTL analyses identify thousands of genetic loci and polygenic scores that regulate blood gene expression. Nat. Genet 53 34475573 10.1038/s41588-021-00913-z PMC8432599 63. Aguet F The GTEx Consortium atlas of genetic regulatory effects across human tissues Science 2020 369 1318 1330 10.1126/science.aaz1776 32913098 PMC7737656 Aguet, F. et al. The GTEx Consortium atlas of genetic regulatory effects across human tissues. Science 369 32913098 10.1126/science.aaz1776 PMC7737656 64. Liu, M. et al. Association studies of up to 1.2 million individuals yield new insights into the genetic etiology of tobacco and alcohol use. Nat. Genet. 51 10.1038/s41588-018-0307-5 PMC6358542 30643251 65. Oliva M DNA methylation QTL mapping across diverse human tissues provides molecular links between genetic variation and complex traits Nat. Genet. 2023 55 112 122 10.1038/s41588-022-01248-z 36510025 PMC10249665 Oliva, M. et al. DNA methylation QTL mapping across diverse human tissues provides molecular links between genetic variation and complex traits. Nat. Genet. 55 36510025 10.1038/s41588-022-01248-z PMC10249665 ",
  "metadata": {
    "Title of this paper": "DNA methylation QTL mapping across diverse human tissues provides molecular links between genetic variation and complex traits",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491539/"
  }
}