{
  "title": "Paper_300",
  "abstract": "pmc J Cerebrovasc Endovasc Neurosurg J Cerebrovasc Endovasc Neurosurg 1921 jcen JCEN Journal of Cerebrovascular and Endovascular Neurosurgery 2234-8565 2287-3139 Korean Society of Cerebrovascular Surgeons PMC12488335 PMC12488335.1 12488335 12488335 40534231 10.7461/jcen.2025.E2024.12.005 jcen-2025-e2024-12-005 1 Review Article Preoperative embolization of brain, head, and neck tumors: Single center experience and literature review Achi-Arteaga Jimmy  1 Flores-Vazquez José Guillermo  2 Fuentes-Calvo Irving  2 Gonzalez-Salido Jimena  2 http://orcid.org/0000-0001-5186-6339 Wong-Achi Xavier  2  1 Ecuador  2 Mexico Correspondence to Xavier Wong-Achi Neurosurgery, National Institute of Neurology and Neurosurgery Manuel Velasco Suárez, Insurgentes Sur No. 3877 Col. La Fama, Del. Tlalpan CP 14269 México DF México Tel +52 56 4000 4216 Fax +52 56 4000 4216 E-mail andres.wong@innn.edu.mx 9 2025 20 6 2025 27 3 498131 195 211 10 12 2024 16 4 2025 28 4 2025 01 09 2025 02 10 2025 02 10 2025 Copyright © 2025 by KSCVS and KoNES 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( http://creativecommons.org/licenses/by-nc/4.0/ Objective The management of highly vascularized tumors in the brain, head, and neck regions poses significant challenges. This review aims to provide practical insights into using preoperative embolization to improve surgical outcomes and guide healthcare centers with limited expertise in this technique. Methods A literature review was conducted using PubMed, Scopus, and Web of Science databases with keywords related to preoperative embolization and highly vascularized tumors, detailing its definition, indications, diagnostic considerations, procedural aspects, clinical and surgical implications, and associated complications. The findings are supported by data from 309 patients with brain, head, and neck tumors treated with preoperative embolization at Hospital Clínica Kennedy in Guayaquil, Ecuador, from 2015 to 2023. Cases without embolization or those below the clavicular border were excluded. Illustrations and photographs, based on the authors’ surgical experience, are included with informed consent. Results Preoperative embolization has proven effective in reducing morbidity, enhancing surgical outcomes, and palliating symptoms in inoperable cases by decreasing tumor size. While complications are rare, they can be minimized with careful planning. Despite its efficacy, the lack of randomized controlled trials due to the rarity of hypervascular tumors limits the ability to establish standardized practices. Conclusions Preoperative embolization is a valuable tool in managing highly vascularized tumors. However, further research and uniform reporting are essential to optimize outcomes and develop clear guidelines for this critical procedure. Therapeutic embolization Preoperative embolization Brain neoplasms Head and neck neoplasms Surgery pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION The management of highly vascularized tumors in the brain, head, and neck region often presents a challenge and requires a multimodal treatment approach. Embolization is a technique that can be performed before planned surgical resection in an attempt to minimize morbidity and improve the chances of controlled and successful tumor resection. Although tumor embolization has been described since the 1970s, advancements in embolization techniques, materials, and specialist training have significantly expanded the progress of this technique today [ 12 Preoperative embolization of intra- and extracranial tumors has become an adjunct to surgical excision with the following primary objectives: 1) Facilitate tumor resection by limiting blood loss and inducing lesion necrosis through the selective occlusion of arterial feeding vessels. Limited blood loss makes surgical resection safer, more controlled, and effective, improving visualization as tumor margins become easier to identify. 2) Necrosis leads to tumor softening, facilitating resection and reducing the forces exerted on adjacent neurovascular structures [ 28 The ultimate purpose is not merely to control blood flow but to minimize overall morbidity and maximize the effectiveness of the surgical treatment. An overly conservative embolization may prove inefficient, while a more aggressive embolization may be riskier and more effective. Therefore, the patient and physicians should consider embolization and resection as a combined approach in treatment. MATERIALS AND METHODS A literature review was conducted using databases such as PubMed, Scopus, and Web of Science, employing keywords such as “Preoperative Embolization,” “Highly Vascularized Tumors,” “Brain Tumor Embolization,” “Head and Neck Tumor,” “Embolization,” and “Tumor Resection.” This review details the definition, indications, diagnostic considerations, procedural details, clinical and surgical implications, as well as the complications associated with preoperative embolization ( Supplementary Table 1 We illustrate our findings using data from our center, Hospital Clínica Kennedy in Guayaquil, Ecuador, where a total of 309 patients with brain, head, and neck tumors, aged over 18 years who underwent preoperative embolization from 2015 to 2023 were included. Patients who did not meet the criteria, tumors that were not treated with embolization before resection, and those below the superior clavicular border were excluded. The photographs and illustrations provided are based on the author’s surgical experience and have been accompanied by informed consent. RESULTS 1. Multidisciplinary approach Advances in surgical techniques have reduced the mortality associated with the resection of specific brain, head, and neck tumors. Complete tumor resection requires a multidisciplinary approach involving techniques from multiple specialties, including vascular and endovascular, otolaryngology, and neurosurgery. Ideally, patients with vascular tumors in the head and neck should be evaluated through a multidisciplinary team approach for optimal staging and therapeutic planning. 2. Definition Tumor embolization refers to any percutaneous procedure, either through direct puncture of the tumor or via an endovascular approach in which particles, liquid embolic agents, coils, gel foam, or other materials are injected to reduce tumor vascularization. The direct puncture technique for preoperative embolization of hypervascular head and neck tumors has traditionally been performed with gel foam, fibrin glue polyvinyl alcohol, or permanent materials such as ethanol or N-butyl-cyanoacrylate [ 26 13 The key recommendation for successful embolization is that the procedure be performed by a physician experienced in neuroendovascular techniques, angiographic image interpretation and with in-depth knowledge of relevant vascular and surgical anatomy (venous flow patterns, involvement of dural sinuses, anatomical variations, and regional anastomoses) [ 28 3. Indications The primary objective of tumor embolization is to facilitate the successful surgical resection of the lesion. Controlling bleeding during surgery can be challenging, particularly in highly vascularized tumors. In certain cases, embolization may be employed as a palliative treatment to reduce tumor size and alleviate pain in patients with tumors deemed inoperable [ 1 30 Table 1 In the brain, meningiomas fulfill most of the objectives of preoperative embolization as they are hypervascular and primarily supplied by dural feeding vessels. While most convexity meningiomas do not require embolization, even if highly vascular, those located at the skull base or in the posterior fossa can present significant differences. ( Fig. 1 2 5 4. Angiographic study Digital subtraction angiography provides additional information to complement clinical evaluation and findings from computed tomography or magnetic resonance imaging studies. Angiography enables the identification of feeding vessels supplying the tumor, facilitating their localization and ligation during surgery. Other critical information includes the extent of tumor growth around vessels (e.g., the internal carotid artery) and collateral flow distal to the affected vessel. Combined with a balloon occlusion test, angiography can assist in determining the feasibility of carotid artery sacrifice during surgery, if necessary [ 5 The blood supply to a tumor can be predicted based on its location, extent, and type. For instance, paragangliomas are almost universally supplied by branches of the ascending pharyngeal artery. In the case of nasoangiofibromas, the vascular supply primarily arises from the distal branches of the internal maxillary artery, particularly the sphenopalatine, descending palatine, and posterior superior alveolar branches [ 22 35 An evaluation of the contralateral carotid artery branches should be performed to rule out their contribution to the tumor, particularly in cases where the tumor has crossed the midline. Intracranial tumors, particularly those located in the posterior fossa, may require additional imaging of the posterior circulation ( Fig. 2 12 A comprehensive understanding of extracranial-to-intracranial arterial anastomoses is vital for minimizing complications during neuroendovascular procedures. Among the most clinically relevant pathways is the connection between the facial artery or the internal maxillary artery (IMAX) and the ophthalmic artery (OA), which arises from the internal carotid artery (ICA). The facial artery, via its terminal angular branch, forms anastomoses with the supratrochlear and supraorbital arteries-distal branches of the OA. This vascular linkage creates a potential conduit for unintentional embolic material to reach the intracranial anterior circulation, including the retinal territory, particularly during embolization of nasal or facial vascular lesions [ 15 15 Another important anatomical connection involves the middle meningeal artery (MMA), a branch of the IMAX, which communicates with branches of the meningohypophyseal trunk (MHT) of the ICA. Notably, the marginal tentorial artery may anastomose with the petrosquamosal branch of the MMA [ 17 29 15 A third noteworthy route is established via the vidian artery, which links the IMAX to the petrous segment of the ICA. This artery may originate from the IMAX as part of the pterygoid canal vasculature and anastomose with a corresponding branch from the ICA. This pathway is particularly relevant in the context of nasopharyngeal tumors such as juvenile angiofibromas, where these arteries are often hypertrophied [ 24 Finally, the occipital artery (OccA) forms frequent and robust connections with the vertebral artery (VA) through radicular and muscular branches at the C1 and C2 levels. These segmental anastomoses are capable of providing collateral flow to the vertebrobasilar system in cases of proximal vertebral artery occlusion (15). Additionally, the stylomastoid branch of the OccA may communicate with the posterior meningeal artery, itself a branch of the VA. These connections pose a potential risk for embolization into the posterior fossa or brainstem, necessitating careful consideration during interventions in the upper cervical spine or posterior skull base. Though often not visible on conventional angiography, these anastomoses can become functionally significant in altered hemodynamic states, such as elevated intraluminal pressure or downstream vascular occlusion. Consequently, meticulous knowledge of these arterial pathways is essential to safely navigate neurointerventional procedures and avoid inadvertent intracranial complications [ 15 21 5. Procedure details 1) Embolization material and particle size The specific attributes of each material provide various options for tumor devascularization. Embolic agents are classified into three main categories, each with advantages and disadvantages. The choice of material may be determined by several factors, including anatomical considerations or the operator’s preference and experience. Among the commonly used agents are polyvinyl alcohol (PVA), microspheres, and Gelfoam. Liquid agents include n-Butyl Cyanoacrylate (nBCA) and the ethylene-vinyl alcohol copolymer (Onyx), while the most recent embolizing agent is coiling [ 2 8 34 Highly effective embolization can result in significant tumor reduction, sometimes surpassing the effects of radiation, which can be highly beneficial. Except for lesions with a single feeding pedicle, the efficacy of embolization is directly related to the deposition of embolic material as deeply as possible within the intrinsic tumor vasculature. For this reason, optimal tumor embolizations require small particles capable of penetrating vessels with diameters of 100 micrometers or smaller [ 12 30 PVA particles provide controlled occlusion of larger vessels, making them safer for proximal embolization with a lower ischemic risk. However, their limited penetration may lead to partial recanalization and a slightly higher recurrence rate than n-BCA. In contrast, n-BCA creates a permanent occlusion, reaching deeper MMA branches for better long-term hematoma reduction, but with a higher risk of nontarget embolization and cranial nerve ischemia if injected distally. While both are effective, the choice depends on vascular anatomy, treatment goals, and operator expertise, balancing PVA’s safety with n-BCA’s stronger but riskier occlusion [ 37 6. Embolization route There are three main embolization techniques: the transarterial approach, direct puncture, and a combination of both. Any of these methods is feasible, and there are no established guidelines regarding the preferred route [ 2 1 Traditionally, embolization is performed through the transarterial route using super-selective catheterization and embolization of the feeding vessels via microcatheter-guided injection of one or more agents. Additionally, occlusion of the main tumor-feeding vessel with coils is also a viable option [ 10 30 Figs. 3 4 Direct puncture embolization has been proposed as an alternative to address these challenges and can also be used as a complement to the transarterial method. Using an 18-25 Fr gauge needle, a liquid embolic agent is directly injected into the tumor bed under fluoroscopic guidance. While this approach achieves a higher concentration of the embolic agent within the tumor and eliminates the need for endovascular catheterization, it carries a higher likelihood of inadvertent trans-tumoral embolization of venous structures due to the shorter distance to the venous system. Additionally, direct tumor injection poses the risk of unintended migration to surrounding normal structures [ 14 In rare cases where vascular anatomy or pathology complicates endovascular access, direct puncture embolization may be the only option for preoperative embolization. While there are no systematic comparisons of the two techniques, some authors have suggested that direct puncture allows for better tumor penetration, thereby reducing intraoperative blood loss when liquid embolic agents are used. Additionally, it may facilitate resection by delineating the tumor from surrounding tissue [ 12 28 7. Anesthesia and pharmacological provocation testing Tumor embolization can be performed under either general or local anesthesia. Local anesthesia with conscious sedation allows for neurological examination during provocation maneuvers and avoids potential complications associated with intubation and exposure to general anesthetic agents. General anesthesia, on the other hand, eliminates risks related to patient agitation and movement during the procedure, which could be hazardous during critical phases of the embolization [ 5 12 16 8. Clinical and radiological efficacy of embolization As previously mentioned, the goal of tumor embolization is to reduce its vascularization to facilitate surgical resection or provide palliation. However, some authors have questioned the utility of preoperative embolization [ 5 6 20 23 33 When reporting efficacy, the amount of tumor “blush” is used as a radiographic measure of vascularization. The goal of embolization should be to reduce tumor blush by 80% or more [ 28 33 2 12 9. Timing of surgery following embolization Tumor embolization is optimally performed 1 to 7 days before surgery. This timing facilitates 1) maximum thrombosis of the embolized vessels, 2) ideal tumor necrosis, and 3) tumor softening [ 7 18 The radiographic and clinical effects of embolization can be transient or permanent, depending on the embolic material used. Therefore, the timing of the embolization of surgery is crucial. Very early tumor resection (<24 hours) after embolization may negate the benefits of embolization by not allowing sufficient time for devascularization and tumor necrosis to occur, leading to increased surgical blood loss [ 3 9 25 It has been demonstrated that the change in tumor consistency and ease of resection are maximized 7–9 days following embolization of meningiomas [ 9 34 18 10. Complications Complications can be classified as either procedure-related or non-procedure-related. The most common complications associated with tumor embolization are outlined in Table 2 2 28 1) Major complications Major complications are rare in extracranial tumor embolizations [ 12 16 18 Table 3 2) Minor complications Minor complications are those that do not require specific treatment beyond observation and have no clinical consequences. These may include puncture site complications that do not affect neural structures, as well as localized pain and swelling. However, when tumor embolization is performed prior to surgical resection, complications may be attributed to either the embolization procedure or the resection. 3) Strategies for preventing complications in tumor embolization Tumor embolization is a valuable technique for minimizing blood loss during surgery and enhancing the feasibility of tumor resection. However, it is not without risks. One of the primary concerns for neurointerventionists is the inadvertent migration of embolic agents into cerebral circulation, which can result in serious complications such as cerebral infarction and cranial nerve damage. These potential outcomes highlight the need for thorough anatomical understanding, meticulous technique selection, and the implementation of protective measures to ensure patient safety and optimize clinical results. The migration of embolic material has been identified as a key contributor to adverse neurological outcomes following embolization procedures. A multicenter retrospective analysis revealed that this complication was the strongest predictor of decline in modified Rankin Scale (mRS) scores three months after treatment. Notably, embolization involving high-risk vessels, such as the accessory meningeal artery and the distal segment of the internal maxillary artery, was significantly correlated with increased risk of embolic migration [ 31 To reduce the likelihood of embolic reflux and unintentional migration, the use of balloon protection techniques has gained prominence. By temporarily occluding the external carotid artery with balloon guide catheters, neurosurgeons can effectively prevent retrograde flow into the internal carotid artery as well as forward embolization into non-target branches. This method improves procedural accuracy and control, enabling safer and more targeted delivery of embolic materials and thereby lowering the incidence of stroke and cranial nerve injuries [ 27 Understanding vascular anatomy is crucial, especially in areas with complex anastomotic networks between the external and internal carotid arteries. In such anatomically challenging regions, embolization of vessels like the MHT and inferolateral trunk (ILT) can be particularly difficult. To address this, a novel technique involving distal balloon protection has been developed, allowing safe embolization even in cases where microcatheter navigation is not possible. This method includes temporary balloon occlusion of the internal carotid artery at the ophthalmic segment, combined with careful injection of embolic agents and aspiration of any reflux before deflation. Although postprocedural imaging revealed subclinical infarcts in approximately 69% of cases, no patients exhibited clinical symptoms, suggesting that this approach may be a viable and safe option for high-risk embolizations [ 38 Dual balloon protection has also proven effective in the embolization of posterior fossa meningiomas supplied by the MHT. In a cohort of eight patients, this technique enabled complete or near-complete devascularization of the tumor without any cases of cerebral infarction resulting from distal embolic spread. Despite these favorable outcomes, one patient experienced a worsening of a pre-existing abducens nerve palsy, underscoring that while balloon protection can significantly enhance safety, the risk of cranial nerve ischemia cannot be eliminated [ 32 When embolic migration occurs despite the use of preventive strategies, salvage interventions such as thromboaspiration may serve as effective rescue options. Commonly utilized in managing complications during arteriovenous malformation embolization, thromboaspiration allows for the retrieval of migrated embolic material and the re-establishment of cerebral perfusion. This technique can be instrumental in mitigating the risk of infarction and reducing procedure-related morbidity [ 4 In addition, meticulous technique remains essential in transvenous embolization (TVE), where excessive coil packing has been associated with complications such as trigeminal nerve palsy and ischemic cranial neuropathy. These adverse events are often the result of mechanical compression or ischemia caused by obstruction of the vasa nervorum. Therefore, precise control of coil volume and a thorough understanding of venous sinus anatomy are fundamental to reducing the incidence of such complications [ 19 DISCUSSION A hypervascular brain tumor presents a significant challenge for neurosurgeons, as excessive bleeding during its removal can pose a life-threatening risk [ 11 36 2 The effectiveness of embolization is closely linked to the deposition of embolic material; therefore, optimal tumor embolization requires small particles capable of penetrating vessels with diameters of 100 micrometers or less. When performed with appropriate guidance, sufficient expertise, and a multidisciplinary approach, embolization is considered a safe procedure. Beyond its role in reducing tumor vascularization to facilitate surgical resection, embolization is also widely employed for palliative purposes, aiming to alleviate symptoms related to tumor mass effect [ 8 34 Regarding the route of embolization delivery, although the transarterial approach with super-selective catheterization remains the preferred method, it is associated with certain risks. These include the potential migration of embolic material through local collateral vessels and the necessity for additional selective catheterization in tumors supplied by multiple feeding vessels. Conversely, direct puncture embolization offers the advantage of achieving a higher concentration of embolic agent within the tumor but is associated with an increased risk of trans-tumoral embolization into venous structures [ 6 14 16 Currently, no systematic reviews directly compare the transarterial approach with direct puncture embolization. Further studies are required to clarify the specific indications and relative advantages of each technique. In the same context, the timing of surgery following tumor embolization is critical. Surgery is ideally performed within 1-7 days post-embolization to maximize vessel thrombosis, tumor necrosis, and softening. Delaying the procedure beyond 7 days may result in severe inflammation and neovascularization while performing tumor resection less than 24 hours after embolization may not allow sufficient time for adequate devascularization and necrosis to occur [ 9 18 The most common major complications associated with tumor embolization include cranial nerve paralysis, skin or mucosal necrosis, and distal vascular thrombosis, which can lead to ischemic or hemorrhagic stroke. However, these complications are rare in cases of extracranial tumor embolization, such as in nasofibromas and carotid glomus tumors [ 12 16 28 34 Most studies emphasize the heterogeneity of indications and specific contexts for performing preoperative embolization. This review, combined with our surgical experience, offers a more targeted perspective, which is particularly valuable for healthcare centers with limited expertise in this procedure. Furthermore, it lays the groundwork for future qualitative and quantitative studies aimed at better defining the clinical and surgical scenarios in which preoperative embolization provides the greatest benefit. One limitation of this study is the absence of recent systematic reviews or meta-analyses to consolidate existing knowledge and establish a more objective framework. The lack of significant advancements in recent years, both for adult and pediatric populations, highlights this gap. Addressing this limitation through comprehensive studies will undoubtedly contribute to improved safety, efficacy, and patient outcomes. CONCLUSIONS In conclusion, preoperative embolization is a procedure that demands a multidisciplinary approach, meticulous planning, and the individualization of patient care within a comprehensive framework. Its precise indications are essential to achieving optimal outcomes. Endovascular techniques play a significant role in the management of intracranial and head and neck vascular tumors, effectively reducing tumor blood flow and serving as a reliable method to minimize intraoperative hemorrhagic complications. However, randomized controlled trials assessing the safety and efficacy of these techniques remain scarce, primarily due to the rarity of hypervascular tumors. Establishing standardized definitions and uniform reporting practices will be crucial in developing best practice measures and advancing the field.  Disclosure The authors report no conflict of interest concerning the materials or methods used in this study or the findings specified in this paper. Supplementary figure and table Supplementary Table 1. Summary of authors included REFERENCES 1 Achi Arteaga J Garcés Cabrera D Quintana L Embolización endovascular prequirúrgica de tumores cerebrales Rev Chil Neurocir 2019 Oct 45 1 34 7 2 Ahmad S Endovascular embolization of highly vascular head and neck tumors Interdiscip Neurosurg 2020 Mar 19 100386 3 Ahn J Lee BH Choi EW Preoperative embolization of hypervascular brain tumor fed by branches of the internal carotid artery Journal of Korean Neurosurgical Society 2002 May 31 477 80 4 Altman IV Nikishyn OL Al-Qashkish II Konotopchyk SV Possibility of thromboaspiration method in treatment of embolic migration complication during arteriovenous malformation embolization of the head and neck localization Wiad Lek 2024 77 5 881 6 39008572 10.36740/WLek202405101 5 Bendszus M Rao G Burger R Schaller C Scheinemann K Warmuth-Metz M Is there a benefit of preoperative meningioma embolization? Neurosurgery 2000 Dec 47 6 1306 11 discussion 1311-2 11126901 6 Borghei P Baradaranfar MH Borghei SH Sokhandon F Transnasal endoscopic resection of juvenile nasopharyngeal angiofibroma without preoperative embolization Ear Nose Throat J 2006 Nov 85 11 740 746 740-3, 746 17168151 7 Cho AA Annen M Endovascular embolization of complex hypervascular skull base tumors Oper Tech Otolayngol Head Neck Surg 2014 Mar 25 1 133 42 8 Choo DM Shankar JJS Onyx versus nBCA and coils in the treatment of intracranial dural arteriovenous fistulas Interv Neuroradiol 2016 Apr 22 2 212 6 26748082 10.1177/1591019915622170 PMC4984352 9 Chun JY McDermott MW Lamborn KR Wilson CB Higashida R Berger MS Delayed surgical resection reduces intraoperative blood loss for embolized meningiomas Neurosurgery 2002 Jun 50 6 1231 5 discussion 1235-7 12015840 10.1097/00006123-200206000-00010 10 Dayawansa S Konda S Lesley WS Noonan PT Jr Huang JH Improving forward infusion pressure during brain tumor embolization with the double catheter and coil technique Neurointervention 2017 Sep 12 2 116 21 28955514 10.5469/neuroint.2017.12.2.116 PMC5613043 11 Deshmukh VR Fiorella DJ McDougall CG Spetzler RF Albuquerque FC Preoperative embolization of central nervous system tumors Neurosurg Clin N Am 2005 Apr 16 2 411 32 xi 15694171 10.1016/j.nec.2004.08.010 12 Duffis EJ Gandhi CD Prestigiacomo CJ Abruzzo T Albuquerque F Bulsara KR Head, neck, and brain tumor embolization guidelines J Neurointerv Surg 2012 Jul 4 4 251 5 22539531 10.1136/neurintsurg-2012-010350 PMC3370378 13 Elhammady MS Peterson EC Johnson JN Aziz-Sultan MA Preoperative onyx embolization of vascular head and neck tumors by direct puncture World Neurosurg 2012 May-Jun 77 5-6 725 30 22079824 10.1016/j.wneu.2011.02.033 14 Elmokadem AH Abdel Khalek AM Amer T Preoperative transarterial particulate embolization of juvenile angiofibroma with intracranial extension: Technical and clinical outcomes Egypt J Radiol Nucl Med 2017 Dec 48 4 921 6 15 Geibprasert S Pongpech S Armstrong D Krings T Dangerous extracranial-intracranial anastomoses and supply to the cranial nerves: Vessels the neurointerventionalist needs to know AJNR Am J Neuroradiol 2009 Sep 30 8 1459 68 19279274 10.3174/ajnr.A1500 PMC7051597 16 Gemmete JJ Chaudhary N Pandey A Gandhi D Sullivan SE Marentette LJ Usefulness of percutaneously injected ethylene-vinyl alcohol copolymer in conjunction with standard endovascular embolization techniques for preoperative devascularization of hypervascular head and neck tumors: Technique, initial experience, and correlation with surgical observations AJNR Am J Neuroradiol 2010 May 31 5 961 6 20037136 10.3174/ajnr.A1936 PMC7964177 17 Harris FS Rhoton AL Anatomy of the cavernous sinus. A microsurgical study J Neurosurg 1976 Aug 45 2 169 80 939976 10.3171/jns.1976.45.2.0169 18 Kai Y Hamada JI Morioka M Yano S Todaka T Ushio Y Appropriate interval between embolization and surgery in patients with meningioma AJNR Am J Neuroradiol 2002 Jan 23 1 139 42 11827886 PMC7975496 19 Kuwayama N Kubo M Hori E Tsumura K Eiraku N Endo S Dural Arteriovenous Fistulas: Complications of Endovascular Treatment Surg Cereb Stroke 2006 34 2 91 5 20 LaMuraglia GM Fabian RL Brewster DC Pile-Spellman J Darling RC Cambria RP The current surgical management of carotid body paragangliomas J Vasc Surg 1992 Jun 15 6 1038 45 1597886 10.1067/mva.1992.35505 21 Lasjaunias P Berenstein A Ter Brugge K Clinical vascular anatomy and variations New York, NY Springer 2014 800 22 Makhasana JAS Kulkarni MA Vaze S Shroff AS Juvenile nasopharyngeal angiofibroma J Oral Maxillofac Pathol 2016 May-Aug 20 2 330 10.4103/0973-029X.185908 PMC4989574 27601836 23 Murphy TP Brackmann DE Effects of preoperative embolization on glomus jugulare tumors Laryngoscope 1989 Dec 99 12 1244 7 2557501 10.1288/00005537-198912000-00007 24 Osborn AG The vidian artery: normal and pathologic anatomy Radiology 1980 Aug 136 2 373 8 7403513 10.1148/radiology.136.2.7403513 25 Pauw BK Makek MS Fisch U Valavanis A Preoperative embolization of paragangliomas (glomus tumors) of the head and neck: Histopathologic and clinical features Skull Base Surg 1993 3 1 37 44 17170888 10.1055/s-2008-1060563 PMC1656401 26 Pedicelli A Lozupone E Valente I Snider F Rigante M D’Argento F Pre-operative direct puncture embolization of head and neck hypervascular tumors using SQUID 12 Interv Neuroradiol 2020 Jun 26 3 346 53 31856645 10.1177/1591019919895882 PMC7254613 27 Rana R Sehgal N Baskaran A Metman OV Kothari S Desai H Abstract 348: Optimizing carotid body tumor embolization: The role of flow arrest using EMBOGUARD TM Balloon Guide Catheter Stroke Vasc Interv Neurol 2024 Nov 4 S1 28 Rosen CL Ammerman JM Sekhar LN Bank WO Outcome analysis of preoperative embolization in cranial base surgery Acta Neurochir (Wien) 2002 Nov 144 11 1157 64 12434172 10.1007/s00701-002-0965-y 29 Salaud C Decante C Ploteau S Hamel A Implication of the inferolateral trunk of the cavernous internal CAROTID artery in cranial nerve blood supply: Anatomical study and review of the literature Ann Anat 2019 Nov 226 23 8 31330308 10.1016/j.aanat.2019.07.004 30 Shin GW Jeong HW Seo JH Kim ST Choo HJ Lee SJ Preoperative embolization of cerebellar hemangioblastoma with onyx: report of three cases Neurointervention 2014 Feb 9 1 45 9 24644530 10.5469/neuroint.2014.9.1.45 PMC3955822 31 Suzuki R Akimoto T Miyake S Iida Y Shimohigoshi W Nakai Y Embolic material migration as the predominant contributing factor to prognostic deterioration following combined tumor resection and preoperative embolization Cureus 2024 Mar 16 3 e57315 38690474 10.7759/cureus.57315 PMC11060013 32 Tega J Takemoto K Koga T Kawano D Yoshinaga S Tanaka H Embolization of posterior Fossa meningiomas supplied with meningohypophyseal trunk by using n-BCA and dual balloon protection AJNR Am J Neuroradiol 2025 Apr 46 4 720 4 39419532 10.3174/ajnr.A8536 PMC11979835 33 Tikkakoski T Luotonen J Leinonen S Siniluoto T Heikkilä O Päivänsälo M Preoperative embolization in the management of neck paragangliomas Laryngoscope 1997 Jun 107 6 821 6 9185740 10.1097/00005537-199706000-00018 34 Vaidya S Tozer KR Chen J An overview of embolic agents Semin Intervent Radiol 2008 Sep 25 3 204 15 21326511 10.1055/s-0028-1085930 PMC3036437 35 Van den Berg R Rodesch G Lasjaunias P Management of paragangliomas. Clinical and angiographic aspects: Clinical and angiographic aspects Interv Neuroradiol 2002 Jun 8 2 127 34 20594521 10.1177/159101990200800204 PMC3576606 36 Wang HH Luo CB Guo WY Wu HM Lirng JF Wong TT Preoperative embolization of hypervascular pediatric brain tumors: evaluation of technical safety and outcome Childs Nerv Syst 2013 Nov 29 11 2043 9 23644575 10.1007/s00381-013-2128-2 37 Waqas M Vakhari K Weimer PV Hashmi E Davies JM Siddiqui AH Safety and effectiveness of embolization for chronic subdural hematoma: Systematic review and case series World Neurosurg 2019 Jun 126 228 36 30878752 10.1016/j.wneu.2019.02.208 38 Yamashiro K Hayakawa M Adachi K Hasegawa M Hirose Y Tumor embolization via the meningohypophyseal and inferolateral trunk in patients with skull base tumors using the distal balloon protection technique AJNR Am J Neuroradiol 2024 May 45 5 618 25 38290740 10.3174/ajnr.A8169 PMC11288533 Fig. 1. (A) and (B) Pre- and post-embolization angiographic study of a right sphenoid wing meningioma. Onyx was used as the embolic agent to occlude blood flow from the middle meningeal artery. (C) Brain CT showing the size and extent of the highly vascularized tumor. (D) Postoperative CT after a pterional transzygomatic approach was performed for complete resection of the meningioma. No hemorrhagic complications occurred. STA, Superficial temporal artery; MaxA, Maxillary artery; MMA, Middle meningeal artery; CT, computed tomography Fig. 2. Angiographic study before the embolization of a left posterior fossa hemangioblastoma (A) (1, hemangioblastoma mural nodule; 2, hemangioblastoma vascularity), and seven days post-embolization prior to tumor excision (B) (3, Mural nodule after embolization; 4, PICA aferences post embolization; 5, AICA aferences post embolization). During the surgical procedure, complete excision of the hemangioblastoma was achieved. The patient experienced reduced intraoperative blood loss. BA, basilar artery; LVA, left vertebral artery; PICA, posteroinferior cerebellar artery; AICA, anteroinferior cerebellar artery; SUCA, superior cerebellar artery; PCA, posterior cerebral artery Fig. 3. (A) Pre-embolization angiographic study of a carotid body tumor as part of preoperative management. (B) Post-embolization angiographic study of the tumor using SQUID 12 as the embolic agent before tumor resection (** representing carotid body tumor after embolization). (C) CT scan with 3D reconstruction of the head and neck showing the tumor in the carotid body of the left carotid artery (* representing carotid body tumor vascularity before embolization). (D) Tumor resection through a left cervical-lateral approach. CCA, common carotid artery; ICA, internal carotid artery; ECA, external carotid artery; STh, superior thyroid artery; FA, facial artery; MAx, Maxillary artery; CT, computed tomography Fig. 4. (A) and (B) Pre- and post-embolization angiographic study of a left juvenile nasoangiofibroma, Fisch stage IIIb. Onyx was used as the embolic agent. (C) Preoperative MRI showing intra- and extracranial tumor extension. (D) Complete resection of the previously embolized tumor was performed using a craniofacial approach, successfully reducing surgical time and blood loss (* representing intracranial portion of tumor: after removal, anterior fossa with frontal lobe covered by dura mater; ** representing extracranial portion of the tumor after removal). ICA C4, internal carotid artery cavernous segment; ICA C2, internal carotid artery petrous segment; MRI, magnetic resonance imaging Table 1. Vascular tumors that may benefit from pre-surgical embolization Vascular tumors that may benefit from presurgical embolization: Meningioma Hemangioblastoma Hemangiopericytoma Juvenile nasoangiofibroma Glomus tumors Metastases Examples of vascularized tumors that may benefit from pre-surgical embolization are presented. Table 2. Complications of tumor embolization Complications of tumor embolization Minor complications Major complications Hematoma at the puncture site Neuropathies Fever Skin or mucosal necrosis Pain Stroke Contrast-induced nephropathy Death Examples of minor complications observed in tumor embolization; hematoma at the puncture site, fever, and pain were described among the minor complications. On other hand, neuropathies, skin or mucosal necrosis, stroke, or contrast-induced nephropathy were among the major complications. Table 3. Complications of embolized tumors Number of cases Hemorrhagic complications Meningioma 224 0 Nasofibroma 63 0 Hemangioblastoma 14 2 Glomus 8 0 Among the reported complications in our series, no hemorrhagic complications were observed in resecting 224 meningiomas or 63 cases of juvenile nasopharyngeal angiofibromas embolized preoperatively. In 14 cases of hemangioblastomas embolized preoperatively, 2 hemorrhagic complications were reported. In 8 cases of glomus tumors embolized preoperatively, no hemorrhagic complications were observed. ",
  "metadata": {
    "Title of this paper": "Tumor embolization via the meningohypophyseal and inferolateral trunk in patients with skull base tumors using the distal balloon protection technique",
    "Journal it was published in:": "Journal of Cerebrovascular and Endovascular Neurosurgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488335/"
  }
}