{
  "title": "Paper_445",
  "abstract": "pmc Front Pain Res (Lausanne) Front Pain Res (Lausanne) 4172 fpain Front. Pain Res. Frontiers in Pain Research 2673-561X 2673-561X Frontiers Media SA PMC12479410 PMC12479410.1 12479410 12479410 41036494 10.3389/fpain.2025.1661722 1 Pain Research Systematic Review Health service utilization for low back pain in Germany between 2000 and 2020—a scoping review of claims data Truthmann Julia  †  ‡ Kiel Simone *  †  ‡ Vrana Georg Chenot Jean-François  ‡ Department of General Practice, Institute for Community Medicine, University Medicine Greifswald Greifswald Germany Edited by: Ovidiu Constantin Baltatu Reviewed by: Falko Tesch Preeti Maharjan * Correspondence: simone.kiel@uni-greifswald.de  † These authors have contributed equally to this work  ‡ ORCID Julia Truthmann orcid.org/0000-0002-2849-7608 orcid.org/0000-0001-8824-1244 orcid.org/0000-0001-8877-2950 16 9 2025 2025 6 482048 1661722 08 7 2025 25 8 2025 16 09 2025 01 10 2025 02 10 2025 © 2025 Truthmann, Kiel, Vrana and Chenot. 2025 Truthmann, Kiel, Vrana and Chenot https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) Background Low back pain (LBP) uses a large proportion of health care resources. Data are needed for health care planning, measuring adherence to guidelines for quality assurance, and assessing overuse and underuse of health care services. The aim of this review is to summarize claims data and describe trends in health care utilization for LBP for the years 2000 to 2020. Methods This scoping review summarizes studies and health reports using claims data of people aged ≥15 years covered by a statutory health insurance in Germany for the period 2000 to 2020. We searched publications in PubMed, EMBASE and Google. Data on health care services were extracted and trends over the years were summarized. Results We included data from 76 publications, health reports and online databases. Every year, 25 to 32% of adults in Germany seek care for LBP. Most of the claims data cannot be pooled because of differences in standardization and reporting. However, trends are observable. Magnetic resonance imaging increased to 7.5%, plain radiography decreased to 15%. The number of sick leave days decreased slightly over time. Hospital admissions for LBP, spinal surgery, and opioid use increased. Outpatient rehabilitation increased, but the overall use of rehabilitation services remained relatively stable. Conclusions Inconsistent reporting standards and fragmentation of German claims data reporting, hinders a comprehensive understanding of health service utilization for low back pain. Despite limitations, current data suggest potential overuse of resources for LBP in Germany, consistently with international data. Given the high proportion of patients consulting for LBP better monitoring of health service utilization is needed to improve quality of care and resource allocation. scoping review claims data health service utilization low back pain Germany The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Musculoskeletal Pain Background Low back pain (LBP) is a major health care problem worldwide, responsible for substantial medical and economic use of resources ( 1 2 3 3 4 4 3 5 7 In Germany, universal health insurance is provided for approximately 90% of the population by various statutory health insurances (SHI) ( 8 9 A health report based on data of the SHI “Barmer” ( 10 11 The aim of this review is to identify sources of claims data on health care utilization for LBP in Germany, to summarize the data and to describe trends in health care utilization for the period 2000 to 2020. Methods Literature and data search This scoping review is reported following the standards of reporting using the PRISMA-checklist for Scoping Reviews (PRISMA-ScR). We did not register the review in advance. A PubMed and EMBASE literature review of published German claims data on health care utilization for LBP was conducted. Since most health care data is published in health reports from SHI's in Germany, which are not listed in medical databases, additional non-systematic web-based searches in Google Scholar und Google were performed. Since not all health reports we were aware of, were available online, the following SHI were contacted for additional health reports: AOK, BKK, Barmer GEK and TK. The study outcomes are defined in Table 1 Table 1 Definition of outcomes. Health services Specification Ambulatory consultation Coded diagnoses (ICD-10 codes) Imaging Billing codes for x-ray, computed tomography (CT), magnetic resonance imaging (MRI) Non-pharmaceutical prescription treatments Billing codes for exercise therapy, manual therapy, heat or cold application, massage, and traction Non-invasive therapies billing codes for Manual therapy and acupuncture, when provided by a physician Opioid prescription Opioid therapy, mainly based on ATC codes Sick leave days Days of sick leave among the working population Hospitalization and days spent in hospital DRG codes Spinal surgery OPS codes Rehabilitation for chronic LBP Inpatient and outpatient rehabilitation OPS, operations, procedures and general medical measures [German Procedure Classification]. Eligibility criteria We included publications on German claims data of people aged ≥15 years, reporting health care utilization for the years 2000 to 2020 in English or German. Claims data are defined as data collected for administrative or claims purposes. We considered the ICD-10 codes M42 (spinal osteochondrosis), M47 (spondylosis), M48 (Other spondylopathies), M51 (other intervertebral disc disorders), M53 (Other dorsopathies, not elsewhere classified), M54 (dorsalgia) and M99 (biomechanical lesions, not elsewhere classified). M50 (cervical disc disorders) was included if only aggregated data were available. Search methods and data extraction The literature search was conducted in September 2019 and updated in April 2025. We present the search strategy for each database in Additional File 1 Results Included health reports, online databases and studies Figure 1 Additional File 1 12 14 Figure 1 Study flow chart. Flowchart diagram for a systematic review process. Identification phase includes 1,519 articles from PubMed, EMBASE, Google, and 211 grey literature sources, totaling 1,730. After removing 741 duplicates, 989 items are screened, excluding 826. Full texts of 163 are assessed, excluding 52 for unclear data definitions. Data extraction yields 111 articles, with 35 articles excluded for aggregation issues, resulting in 76 articles included. Table 2 Table 3 Additional File 2 Table 2 ICD-Codes used to define low back pain in health reports and single publications. Articles included M54 M53 M51 M50 b M47 M48 M42 M99 M00–M99 Health reports of statutory health insurances BKK n x x a x DAK n x x a x TK n x x a x Barmer/GEK n x x x x AOK n x x x x a x Online data bases Federal Health Monitoring ( 12 13 x b x b x b x b x b x b x b x Federal Statistical Office ( 14 x b x b x b x b x b Single publications DEWI project ( 15 17 x x x x x x x Zich & Tisch ( 18 x x x x Höer et al. ( 19 x x x x Hickstein et al. ( 20 x x x Chenot et al. ( 21 x x x Andersohn et al. ( 22 x x x x Walker et al. ( 23 x x Kasbohm et al. ( 24 x x x x x x  a Not found in every health report.  b For inpatient rehabilitation only. M54 (dorsalgia), M53 (other dorsopathies, not elsewhere classified), M51 (other intervertebral disc disorders), M50 (cervical disc disorders), M47 (spondylosis), M48 (other spondylopathies), M42 (spinal osteochondrosis), M99 (biomechanical lesions, not elsewhere classified), M00-M99 (diseases of the musculoskeletal system and connective tissue). Table 3 Sources of extracted data. Health services Health reports of statutory health insurances Online data bases Single publications BKK DAK TK BARMER/GEK AOK Ambulatory consultation x x x Imaging x x Invasive non-operative therapies x x Non-pharmaceutical prescription treatments x x x Non-invasive therapies x x x Prescription medication x x Sick leave days x x x x x Hospitalization x x x x Spinal surgery x x Rehabilitation x x x Figure 2 Figure 2 Overview of observation periods. Health insurance reports (light grey), online data bases (grey) and other (peer reviewed) publications (blue). Bar chart displaying time ranges for various studies and reports from 2000 to 2020. It includes health insurances like AOK, BKK, and peer reviewed publications such as Anderson and Chenot. Single publications report shorter periods compared to statutory health insurance reports. Ambulatory consultations for LBP Due to different standardization methods and ICD-10 codes reported, data on ambulatory consultations cannot be summarized visually. In 2010, 32% of employed persons aged 15–65 years were diagnosed with M54 (dorsalgia) and 10.0% with M53 (Other dorsopathies, not elsewhere classified) ( 25 26 27 27 21 21 21 The Bertelsmann Foundation analyzed data from 7 million statutory health insured people and considers M54 and M99 (biomechanical lesions) ( 22 22 In Mecklenburg-Western Pomerania ( 24 Imaging for LBP The frequency of imaging (x-ray, computed tomography (CT), magnetic resonance imaging (MRI)) for LBP was reported for the period 2006–2015 ( 15 21 22 Figures 3a–c 24 28 15 29 22 Figure 3 (a–c) Three line graphs show trends from 2006 to 2016 for x-ray, computer tomography, and magnetic resonance imaging. In the x-ray graph, all datasets show a decline. The computer tomography graph also shows a decrease across datasets. The magnetic resonance imaging graph indicates an increase for all datasets. AOK is labeled in blue, Bertelsmann in orange, and AOK-DEWI in gray. Non-pharmaceutical prescription treatments for LBP Non-pharmacological treatments that are billable include physiotherapy, delivered as exercise therapy, manual therapy, heat or cold application, massage, and traction. Exercise therapy is most often prescribed followed by heat or cold application and massage ( 21 30 Figure 4 21 30 30 16 16 31 32 33 34 32 34 Figure 4 Time trends of the utilization of remedies (prescription physiotherapy and physical therapy) by all insured people of the barmer GEK. Line graph showing the number of insured people receiving various therapies from 2013 to 2015. Physiotherapy remains the highest, peaking in 2014. Manual therapy and heat, cold application show slight increases, while massage decrease over time. Traction remained constant throughout the two-year period. Non-invasive therapies Manual therapy and acupuncture, when provided by a physician, were considered as non-invasive therapies. In Germany, claims privileges for manual therapy require a qualification. While the majority of orthopedists is qualified, only a small percentage of GPs are able to bill manual therapy. The Barmer GEK hospital report ( 35 21 16 20 23 A study, analyzing claims data from 84 SHIs, covering approximately 7 million people in Germany, reports that 18% of patients with acute LBP (M54, dorsalgia) received manual therapy from physicians ( 23 21 The Barmer GEK hospital report 2015 ( 35 35 35 The health care report 2013/2014 shows the proportion of LBP patients treated with acupuncture remain stable at 6% from 2007 to 2010 ( 21 20 20 20 16 Opioid prescription Four health reports ( 16 19 21 35 21 16 19 35 Sick leave days for LBP Since 2012 the data from the SHI TK ( 36 40 27 41 45 46 50 Figure 5 Figure 5 Time trend of sick leave days per 100 insured persons due to back pain (M51 and M54). Line graph showing days of sick leave per 100 insured persons from 2012 to 2018. M51 and M54 categories are represented for TK, DAK, and Barmer GEK. M54 lines, in yellow, generally have higher sick leave days compared to M51 lines in blue, with M54 Barmer GEK having the highest values. All lines show minor fluctuations over the years. Hospitalization and days spent in hospital Health reports of the SHI BKK (2001–2010), DAK (2018), and GEK ( 28 35 51 69 18 21 28 35 51 69 Figure 6 18 35 Figure 6 Time trend of hospitalizations due to back pain (M48, M51 and M54). Line graph showing trends in the number of hospitalizations from 2006 to 2015. It includes data for M54, M51, and M48 diagnoses from two sources: Barmer GEK and Zich & Tisch, differentiated by color and line style. Hospitalizations generally increase over time, with variations across categories. M54 was the most frequent diagnosis. The incidence rate of M54 (dorsalgia) hospitalizations rose from 10.3 cases/10,000 insurance years in 2006 to 20.2 cases/10,000 insurance years in 2014, representing a substantial increase of 95% ( 35 18 27 18 18 On average, patients with the diagnosis M54 (dorsalgia) spent 8 days in hospital, whereas patients with the diagnosis M51 (other intervertebral disc disorders) spent 9 days and M48 (Other spondylopathies) 10 days in hospital during 2005–2012 ( 61 67 28 35 60 68 69 Spinal surgery Four publications included data on spinal surgery ( 15 17 18 35 35 35 18 18 Figure 7 15 17 15 18 15 Figure 7 Time trend of spinal surgery (M40–54). Line graph showing surgery rates per 100,000 for AOK-DEWI from 2006 to 2016. The rate increases from about 200 in 2006 to a peak of around 320 in 2012, then slightly declines to 300 by 2016. Rehabilitation for chronic LBP Rehabilitation for LBP aims to prevent disability and restore physical functioning to enable return to work. In Germany rehabilitation is mostly covered by the German pension insurance and not the SHI. Data on inpatient and outpatient rehabilitation for LBP are available in the online databases of the Federal Health Monitoring and the Federal Statistical Office ( 12 14 51 55 Figure 8 8 9 70 Figure 8 Time trend in inpatient rehabilitations with main diagnosis M50 to M54. Line graph depicting the number of inpatient rehabilitations from 2000 to 2019. Two sets of data are shown for men and women, represented by different line styles. The Federal Health Monitoring data generally trends higher than the Federal Statistical Office data, with variations over the years. Men consistently have higher numbers than women across both data sources. Figure 9 9 14 35 Figure 9 Time trend in inpatient and outpatient rehabilitations with main diagnosis ICD10-M00-99. A line graph displays the number of rehabilitations from 2000 to 2015 for inpatient, outpatient, and total categories. The blue line shows the total, peaking around 2004 and slightly declining before rising again. The green line for inpatient follows a similar pattern with lower values. The orange line for outpatient shows a steady increase. Discussion Ambulatory consultations for LBP While ICD-10 codes are used for billing purposes, they may not accurately reflect the true prevalence of LBP due to the incomplete coverage of related conditions, and potential biases in physician coding practices, which are influenced by individual, regional, and economic factors ( 24 71 72 2 73 74 Sick leave days Data show a slight decrease in the number of sick leave days between 2012 and 2018, which is due to a decrease in billed diagnoses of M54 (dorsalgia) ( Figure 5 75 76 77 78 Imaging for LBP National and international guidelines recommend imaging only in the presence of red flags within 4 to 6 weeks, depending on the urgency ( 79 80 21 22 81 82 83 29 84 83 Non-pharmaceutical prescription treatments and non-invasive therapies for LBP Data on physiotherapy services are sparse, so we cannot rule out changes in prescription practices. Exercise therapy is the most common non-pharmacological treatments for LBP. Approximately 20%–40% of patients are prescribed exercise therapy or manual therapy (spinal manipulation) by physiotherapists ( 31 34 85 80 16 21 30 86 The effectiveness of manual therapy remains controversial ( 80 21 23 23 Acupuncture is a popular but controversial treatment option for chronic LBP covered by SHI. It is estimated that ∼10%–20% of patients with chronic LBP receive acupuncture provided from physicians ( 20 21 87 80 20 Opioid prescriptions There are many reports on the use of prescription pain medications in Germany, but most are not limited to prescriptions related to LBP ( 88 89 19 21 35 21 37 89 90 84 Hospitalization and days spent in hospital The number of hospitalizations for LBP increased steadily and doubled during the observation period ( Figure 6 91 92 27 92 Spinal surgery Clinical guidelines do not recommend surgery for non-specific LBP. Surgical interventions are generally only considered in specific cases, such as severe or progressive back or leg pain that is unresponsive to other therapies, or when there are red flags. Nevertheless, an increase in spinal surgery has been observed in Germany and internationally ( 93 95 17 18 Rehabilitation for chronic LBP The number of rehabilitations with the main diagnosis “musculoskeletal system and connective tissue” (outpatient and inpatient rehabilitation combined) was stable, with fluctuations over the period. The fluctuations are due to a decrease in inpatient rehabilitation compensated by increased outpatient rehabilitation as a result of changes in social legislation (introduction of book IX of the social code) in 2020. We did not find any studies on the temporal trend of inpatient and outpatient rehabilitation in other countries, but as there is a general trend in health care towards shorter hospital stays, more outpatient procedures and a focus on patient progress is assumed ( 96 97 Apart from rehabilitation clinics, multimodal pain therapy for chronic LBP is provided in pain clinics covered by SHI. There is an overlap with rehabilitation services for people of working age, which limits reliable assessment of patients receiving multimodal therapy. About 5% of patients hospitalized for LBP receive multimodal pain therapy ( 35 98 Strength and limitations This is the first comprehensive review of health service utilization for LBP in Germany based on claims data that allows the description of temporal trends. We identified 76 publications based on claims data and included claims data from 2 online databases. A major strength of claims data is their availability and that they cover large populations. Our aim was to describe the available evidence thus, in line with the PRISMA-ScR checklist, we did not analyze the risk of bias of each publication and claims data report. In general, claims data are of high external validity as they are a close representation of the national population. Nevertheless, the results presented must be interpreted with caution due to limited internal validity and data comparability. This is because: • there is no existing consensus on which ICD-10 codes should be used to define LBP ( Table 2 • the ICD-10 classification does not adequately reflect the clinical problems ( 71 • different standardization of data. • no standard of the reference population and time periods. • temporal trends and influences, such as remuneration, have to be considered. • temporal and regional trends in utilization can only be partially captured. 24 71 We are aware that there are many people who seek care outside SHI, which does not cover regularly popular services like osteopathy and that many people pay out of pocket for massage, acupuncture and other services including medication or devices. Since this data is not collected, we underestimate the use of some health services for LBP. We did not include data on invasive non-operative therapies (injection therapies). They are underestimated by claims data as not all injection therapies can be billed. Nevertheless, as indicated by one publication, there was an increase from 0.2% to 0.6% in the utilization of injection therapy in outpatients from 2006 to 2010 ( 21 We did not find any data on privately insured patients, which are approximately 10% of the German population. On average, this is a group of healthier and younger patients with a higher socio-economic status. There is no established methodology for searching the grey literature. Nevertheless, it seems unlikely that substantial publications may have been missed, as the number of institutions publishing claims data is limited. Although the data extraction was conducted by one author, we believe that any resulting bias would be minimal, since all authors wrote specific chapters of this manuscript and re-read the original references. Conclusions Most of the available German claims data cannot be pooled or compared directly because of different standardization methods or lack of standardization, different inclusion criteria, and different reference systems used for reporting. Consequently, the data provide only an incomplete picture of the health care for LBP. Given the epidemiologic and economic importance of LBP and the dynamic nature of health care delivery, a consensus on data reporting is needed to allow pooling and comparison of claims data and to support data-based decision-making. The available data on imaging, hospital admissions, and spinal surgery, despite inherent limitations, suggest an overuse of health care resources for LBP in Germany. Similar trends have been observed in other industrialized countries, warranting further investigation and quality improvement measures to optimize care delivery and resource allocation. Abbreviations CT, computer tomography; GP, general practitioner; ICD-10 code, international classification of disease 10th revision; LBP, low back pain; MRI, magnetic resonance imaging; NSAID, non-steroidal anti-inflammatory drug; OPS Code, operation and procedure classification system; SHI, statutory health insurance. Data availability statement The original contributions presented in the study are included in the article/ Supplementary Material Author contributions JT: Investigation, Methodology, Project administration, Writing – original draft, Writing – review & editing. SK: Conceptualization, Methodology, Writing – original draft, Writing – review & editing. GV: Conceptualization, Writing – review & editing. J-FC: Conceptualization, Methodology, Writing – original draft, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that Generative AI was used in the creation of this manuscript. To correct the english grammar and in general to improve english language. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fpain.2025.1661722/full#supplementary-material References 1. Vos T Abajobir AA Abate KH Abbafati C Abbas KM Abd-Allah F Global, regional, and national incidence, prevalence, and years lived with disability for 328 diseases and injuries for 195 countries, 1990–2016: a systematic analysis for the global burden of disease study 2016 Lancet 2017 390 10100 1211 59 10.1016/S0140-6736(17)32154-2 28919117 PMC5605509 2. GBD 2021 Low Back Pain Collaborators Global, regional, and national burden of low back pain, 1990–2020, its attributable risk factors, and projections to 2050: a systematic analysis of the global burden of disease study 2021 Lancet Rheumatol 2023 5 6 e316 29 10.1016/S2665-9913(23)00098-X 37273833 PMC10234592 3. Beyera GK O’Brien J Campbell S Health-care utilisation for low back pain: a systematic review and meta-analysis of population-based observational studies Rheumatol Int 2019 39 10 1663 79 10.1007/s00296-019-04430-5 31463608 4. Deyo RA Mirza SK Turner JA Martin BI Overtreating chronic back pain: time to back off? J Am Board Fam Med JABFM 2009 22 1 62 8 10.3122/jabfm.2009.01.080102 19124635 PMC2729142 5. Barros Guinle MI Johnstone T Ruiz Colón GD Weng Y Nettnin EA Ratliff JK Health care utilization among medicare beneficiaries with newly diagnosed back pain North Am Spine Soc J 2024 20 100565 10.1016/j.xnsj.2024.100565 PMC11636345 39670143 6. Kim LH Vail D Azad TD Bentley JP Zhang Y Ho AL Expenditures and health care utilization among adults with newly diagnosed low back and lower extremity pain JAMA Netw Open 2019 2 5 e193676 10.1001/jamanetworkopen.2019.3676 31074820 PMC6512284 7. Ivanova JI Birnbaum HG Schiller M Kantor E Johnstone BM Swindle RW Real-world practice patterns, health-care utilization, and costs in patients with low back pain: the long road to guideline-concordant care Spine J 2011 11 7 622 32 10.1016/j.spinee.2011.03.017 21601533 8. Blümel M Spranger A Achstetter K Maresso A Busse R Germany—Health system review European Observatory on Health Systems and Policies 2020 Available online at: https://iris.who.int/bitstream/handle/10665/341674/HiT-22-6-2020-eng.pdf?sequence=1 (Accessed August 19, 2025) 9. Raspe HH Rückenschmerzen Berlin Robert-Koch-Inst 2012 37 (Gesundheitsberichterstattung des Bundes; Bd. 53) Available online at: https://www.gbe-bund.de/pdf/Rueckenschmerzen.pdf 10. Deitermann B Kemper C Hoffmann F Glaeske G GEK-Heil- und Hilfsmittel-Report 2006: Auswertungsergebnisse der GEK-Heil- und Hilfmitteldaten aus den Jahren 2004 und 2005. GEK GE, Herausgeber. GEK-Heil- und Hilfsmittel-Report : Auswertungsergebnisse der GEK-Heil- und Hilfsmitteldaten aus den Jahren..Sankt Augustin: Asgard 2006 (GEK-Edition; Bd. 49) 11. van Tulder M Becker A Bekkering T Breen A del Real MTG Hutchinson A Chapter 3. European guidelines for the management of acute nonspecific low back pain in primary care Eur Spine J 2006 15 Suppl 2 2 169 91 10.1007/s00586-006-1071-2 PMC3454540 16550447 12. Federal Health Monitoring Completed outpatient medical rehabilitation services and other services. Completed outpatient benefits for medical rehabilitation and other benefits for participation for adults in statutory pension insurance (number) Breakdown characteristics: years, Germany, age, sex, 1st diagnosis (ICD-10), pension insurance branch 2016 Available online at: https://www.gbe-bund.de/gbe/pkg_isgbe5.prc_menu_olap?p_uid=gast&p_aid=50693033&p_sprache=D&p_help=3&p_indnr=681&p_indsp=&p_ityp=H&p_fid= (Accessed June 08, 2021) 13. Federal Health Monitoring Completed inpatient rehabilitation services and other participation services for adults in the statutory pension insurance scheme (number) Breakdown characteristics: years, Germany, age, sex, 1st diagnosis (ICD-10), pension insurance branch 2016 Available online at: https://www.gbe-bund.de/gbe/pkg_isgbe5.prc_menu_olap?p_uid=gast&p_aid=56136350&p_sprache=D&p_help=3&p_indnr=225&p_indsp=&p_ityp=H&p_fid= (Accessed May 25, 2021) 14. German Federal Statistical Office Patients in preventive care or rehabilitation centres: Germany, years, sex, age groups, main diagnosis ICD-10 (1-3 digit hierarchy) 2021 Available online at: https://www-genesis.destatis.de/genesis/online?operation=abruftabelleBearbeiten&levelindex=2&levelid=1621945294851&auswahloperation=abruftabelleAuspraegungAuswaehlen&auswahlverzeichnis=ordnungsstruktur&auswahlziel=werteabruf&code=23132-0002&auswahltext=&werteabruf=starten&nummer=3&variable=3&name=GES025#astructure (Accessed May 25, 2021) 15. Schmitt J Tesch F Lange T Determinanten bei der Versorgung von Patienten mit Wirbelsäulenoperation (DEWI) 2020 Available online at: https://innovationsfonds.g-ba.de/downloads/beschluss-dokumente/4/2020-12-18_DEWI_Ergebnisbericht.pdf (Accessed May 26, 2021) 16. Tesch F Lange T Wirtz DC Schmitt J Kreuzschmerz: Konvergenz und Divergenz der Versorgung mit der Einführung der NVL Kreuzschmerz Günster C Klauber J Klemperer D Nothacker M Robra BP Schmuker C Versorgungs-Report Leitlinien-Evidenz für die Praxis Berlin Medizinisch Wissenschaftliche Verlagsgesellschaft 2023 S109 18 10.32745/9783954668007-9 17. Tesch F Lange T Dröge P Günster C Flechtenmacher J Lembeck B Indication for spinal surgery: associated factors and regional differences in Germany BMC Health Serv Res 2022 22 1 1109 10.1186/s12913-022-08492-3 36050682 PMC9438246 18. Zich K Tisch T Faktencheck Rücken Rückenschmerzbedingte Krankenhausaufenthalte und operative Eingriffe—Mengenentwicklung und regionale Unterschiede 2017 19. Höer A Freytag A Schiffhorst G Schellhammer S Thiede M Glaeske G Opioidtherapie bei Versicherten mit Rückenschmerzen. Sekundärdatenanalyse zur Charakterisierung von Patientengruppen, Einfluss auf Opioidtherapie und Arbeitsunfähigkeit Schmerz 2011 25 174 83 10.1007/s00482-011-1026-3 21424333 20. Hickstein L Kiel S Raus C Heß S Walker J Chenot JF. Akupunktur als Leistung der gesetzlichen Krankenversicherung in Deutschland : Eine retrospektive Beobachtungstudie basierend auf Abrechnungsdaten 2018 30 8 10.1007/s00482-017-0258-2 29230550 21. Chenot J Haupt C Gerste B. Zeitliche Trends bei der Versorgung von Rückenschmerzpatienten In: Klauber/Günster/Robra/Schmacke, Herausgeber. Versorgungs-Report 2013/2014 2014 S. 155–83 22. Andersohn FWJ Bertelsmann Stiftung. Faktencheck Rücken: Ausmaß und regionale Variationen von Behandlungsfällen und bildgebener Diagnostik 2016 23. Walker J Mertens UK Schmidt CO Chenot JF Effect on healthcare utilization and costs of spinal manual therapy for acute low back pain in routine care: A propensity score matched cohort study 2017 0177255 10.1371/journal.pone.0177255 PMC5432069 28505161 24. Kasbohm E Chenot JF Schmidt CO Truthmann J Frequency, combinations and clinical relevance of outpatient low back pain diagnoses: analysis of claims data in a population-based cohort study BMC Musculoskelet Disord 2025 26 1 330 10.1186/s12891-025-08514-1 40181328 PMC11966858 25. IGES Institut GmbH, DAK Forschung DAK Gesundheitsreport 2011 2011 26. IGES Institut GmbH, DAK Forschung Gesundheitsreport 2014: Die Rushhour des Lebens. Gesundheit im Spannungsfeld von Job, Karriere und Familie 27. Marschall J Hildebrandt S Zich K Tisch T Sörensen J Nolting H-D Gesundheitsreport 2018 Analyse der Arbeitsunfähigkeitsdaten: Update: Rückenerkrankungen. Andreas Storm DGesundheitAK, Herausgeber Heidelberg Medhochwzwei Verlag GmbH 2018 287 (Beiträge zur Gesundheitsökonomie und Versorgungsforschung; Bd. Band 21) 28. Bitzer EM Grobe TG Neusser S Lorenz C BARMER GEK Report Krankenhaus 2013: Schwerpunktthema: Die Stationäre Versorgung von Darmkrebs. Barmer GEK, Herausgeber Siegburg Asgard-Verl.-Service 2013 (Schriftenreihe zur Gesundheitsanalyse; Bd. 21) 29. Linder R Horenkamp-Sonntag D Engel S Schneider U Verheyen F Überdiagnostik mit Bildgebung bei Rückenschmerzen Dtsch Med Wochenschr 2016 141 10 e104 10.1055/s-0042-109188 27239708 30. Brechtel T Kossack N Grandt D Herausgeber Analysen zur Heil und Hilfsmittelversorgung in Deutschland Siegburg Asgard 2016 58 (Schriftenreihe zur Gesundheitsanalyse; Bd. 41) 31. Waltersbacher A Heilmittelbericht 2016: Ergotherapie Sprachtherapie Physiotherapie Podologie Berlin Wissenschaftliches Institut der AOK, Herausgeber 2016 Available online at https://www.wido.de/fileadmin/Dateien/Dokumente/Publikationen_Produkte/Buchreihen/Heilmittelbericht/wido_hei_hmb_2016.pdf 32. Waltersbacher A Heilmittelbericht 2017: Ergotherapie Sprachtherapie Physiotherapie Podologie Berlin Wissenschaftliches Institut der AOK, Herausgeber 2017 Available online at https://www.wido.de/fileadmin/Dateien/Dokumente/Publikationen_Produkte/Buchreihen/Heilmittelbericht/wido_hei_hmb_2017.pdf 33. Waltersbacher A Heilmittelbericht 2018: Ergotherapie Sprachtherapie Physiotherapie Podologie Berlin Wissenschaftliches Institut der AOK, Herausgeber 2018 Available online at https://www.wido.de/fileadmin/Dateien/Dokumente/Publikationen_Produkte/Buchreihen/Heilmittelbericht/wido_hei_hmb_2018.pdf 34. Waltersbacher A Heilmittelbericht 2019 Ergotherapie, Sprachtherapie, Physiotherapie, Podologie Berlin Wissenschaftliches Institut der AOK, Herausgeber 2019 Available online at https://www.wido.de/fileadmin/Dateien/Dokumente/Publikationen_Produkte/Buchreihen/Heilmittelbericht/wido_hei_hmb_2019.pdf 35. Bitzer EM Lehmann B Bohm S Priess H-W BARMER GEK Report Krankenhaus 2015: Auswertung zu Daten bis 2014 Schwerpunkt: Lumbale Rückenschmerzen Siegburg Asgard-Verl.-Service 2015 (Schriftenreihe zur Gesundheitsanalyse; Bd. 33) 36. Grobe T ISEG (Institut für Sozialmedizin, Epidemiologie und Gesundheitssystemforschung). Gesundheitsreport 2012: Mobilität, Flexibilität, Gesundheit Ahlers G Gesundheitsreport 2012 - Veröffentlichungen zum Betrieblichen Gesundheitsmanagement der TK, Band 27 Hamburg Techniker Krankenkasse 2012 178 Available online at: https://www.tk.de/resource/blob/2026670/4d90e901bdde1667ffcb823a4a73edf2/gesundheitsreport-2012-data.pdf 37. Grobe T ISEG (Institut für Sozialmedizin, Epidemiologie und Gesundheitssystemforschung). Gesundheitsreport 2013: Berufstätigkeit, Ausbildung und Gesundheit Ahlers G Gesundheitsreport 2013 - Veröffentlichungen zum Betrieblichen gesundheitsmanagement der TK, Band 28 Hamburg Techniker Krankenkasse 2013 188 Available online at: https://www.tk.de/resource/blob/2034308/bd293b4339460486bb721b5d54524ca6/gesundheitsreport-2013-data.pdf 38. Grobe T Steinmann S AQUA - Institut für angewandte Qualitätsförderung und Forschung im Gesundheitswesen GmbH. Gesundheitsreport 2015: Gesundheit von Studierenden Ahlers G Gesundheitsreport 2015 - Veröffentlichungen zum Betrieblichen Gesundheitsmanagement der TK Hamburg Techniker Krankenkasse 2015 231 Available online at: https://www.tk.de/resource/blob/2034304/47b32c03c8f94de08485134741a5b340/gesundheitsreport-2015-data.pdf 39. Grobe T Steinmann S AQUA - Institut für angewandte Qualitätsförderung und Forschung im Gesundheitswesen GmbH. Gesundheitsreport 2016: Gesundheit zwischen Beruf und Familie. Ahlers G Gesundheitsreport 2016 - Veröffentlichung zum Betrieblichen Gesundheitsmanagement der TK Hamburg Techniker Krankenkasse 2016 192 Available online at: https://www.tk.de/resource/blob/2034302/0eac411909c8215ba82b4f2cf86a8d8f/gesundheitsreport-2016-data.pdf 40. Grobe T Steinmann S Gerr J AQUA - Institut für angewandte Qualitätsförderung und Forschung im Gesundheitswesen GmbH. Gesundheitsreport 2018: Arbeitsunfähigkeiten Hamburg Techniker Krankenkasse 2018 Available online at: https://www.tk.de/resource/blob/2034000/60cd049c105d066650f9867da5b4d7c1/gesundheitsreport-au-2018-data.pdf 41. IGES Institut GmbH, DAK Forschung DAK-Gesundheitsreport 2012 Hamburg IGES Institut GmbH 2012 42. IGES Institut GmbH, DAK Forschung DAK-Gesundheitsreport 2013 Hamburg IGES Institut GmbH 2013 43. IGES Institut GmbH, DAK Forschung DAK-Gesundheitsreport 2015 Heidelberg IGES Institut GmbH 2015 44. Marschall J Hildebrandt S Sydow H Nolting H-D Gesundheitsreport 2016: Analyse der Arbeitsunfähigkeitsdaten. Schwerpunkt: Gender und Gesundheit Rebscher H Marschall J Hildebrandt-Heene S Sydow H Herausgeber NH Beiträge zur Gesundheitsökonomie und Versorgungsforschung (Band 13) Heidelberg Medhochzwei Verlag GmbH 2016 175 45. Marschall J Hildebrandt S Sydow H Nolting H-D Gesundheitsreport 2017: Analyse der Arbeitsunfähigkeitsdaten. Update: Schlafstörungen Andreas S Herausgeber DAK-G Beiträge zur Gesundheitsökonomie und Versorgungsforschung (Band 16) Heidelberg Medhochwzwei Verlag GmbH 2017 178 46. Grobe TG Dörning H Schwartz FW Barmer GEK Arztreport 2012: Schwerpunkt: Kindergesundheit St. Augustin Asgard-Verl 2012 (Schriftenreihe zur Gesundheitsanalyse; Bd. 12) 47. Grobe TG Heller G Szecsenyi J Barmer GEK Arztreport 2014: Schwerpunkt: Hautkrebs. Barmer GEK, Herausgeber Siegburg Asgard-Verl.-Service 2014 (Schriftenreihe zur Gesundheitsanalyse; Bd. 24) 48. Grobe TG Klingenberg A Szecsenyi J Steinmann S Barmer GEK Arztreport 2015: Schwerpunkt: Gebärmutterhalskrebs. Barmer GEK, Herausgeber Siegburg Asgard-Verl.-Service 2015 (Schriftenreihe zur Gesundheitsanalyse; Bd. 30) 49. Grobe TG Steinmann S Szecsenyi J BARMER Arztreport 2017: Schriftenreihe zur Gesundheitsanalyse. BARMER, Herausgeber Arztreport..Siegburg Asgard-Verlagsservice GmbH 2017 (Schriftenreihe zur Gesundheitsanalyse; Bd. Band 1) 50. Grobe TG Steinmann S Szecsenyi J BARMER Arztreport 2019: Schriftenreihe zur Gesundheitsanalyse. 1. Auflage. BARMER, Herausgeber. Bd. 14 Siegburg Asgard Verlagsservice 2019 51. BKK Bundesverband BKK Gesundheitsreport 2003—Gesundheit und Arbeitswelt Essen BKK Bundesverband 2002 52. BKK Bundesverband BKK Gesundheitsreport 2004—Gesundheit und Sozialer Wandel Essen BKK Bundesverband 2004 53. BKK Bundesverband BKK Gesundheitsreport 2005—Krankheitsentwicklung—Blickpunkt: Psychische Gesundheit Essen BKK Bundesverband 2005 54. BKK Bundesverband BKK Gesundheitsreport—Deografischer und Wirtschaftlicher Wandel—gesundheitliche Folgen Essen BKK Bundesverband 2006 55. BKK Bundesverband BKK Gesundheitsreport 2007—Gesundheit in Zeiten der Globalisierung Essen BKK Bundesverband 2007 56. BKK Bundesverband BKK Gesundheitsreport 2008—Seelische Krankheiten Prägen das Krankheitsgeschehen Essen BKK Bundesverband 2008 57. Drews D Ließmann J Mohr C Stark G Bödeker W Bury C BKK Gesundheitsreport 2009—Gesundheit in Zeiten der Krise Berlin BKK 2009 58. Drews D Ließmann J Mohr C Bär T Wessels T Harfst T BKK Gesundheitsreport 2010—Gesundheit in Einer älter Werdenden Gesellschaft. Berlin BKK 2010 59. Marschall J Hildebrandt S Zich K Tisch T Sörensen J Nolting H-D DAK-Gesundheitsreport 2018 2018 60. Augurzky B Fels K Pilny A Wübker A Bohms Priess H-W BARMER GEK Report Krankenhaus 2016: Auswertung zu Daten bis 2015 Schwerpunkt: Adipositas. Barmer GEK, Herausgeber Siegburg Asgard Verlagsservice GmbH 2016 (Schriftenreihe zur Gesundheitsanalyse; Bd. 40) 61. Bitzer EM Grobe TG Dörning H Schwartz FW GEK-Report Akut-stationäre Versorgung 2006 St. Augustin Asgard-Verl. 2006 Schriftenreihe zur Gesundheitsanalyse; Bd. Bd. 45 62. Bitzer EM Grobe TG Dörning H Schwartz FW GEK Report Akut-stationäre Versorgung 2007: Thema: Koronare Herzkrankheit—Interventionelle Kardiologie und Herzchirurgie. GEK GE, Herausgeber St. Augustin Asgard-Verl 2007 Schriftenreihe zur Gesundheitsanalyse; Bd. 58 63. Bitzer EM Grobe TG Neusser S Dörning H Schwartz FW GEK-Report Akut-stationäre Versorgung 2008: Schwerpunktthema: Kinder im Krankenhaus. GEK GE, Herausgeber Sankt Augustin Asgard-Verl 2008 Schriftenreihe zur Gesundheitsanalyse; Bd. 63 64. Bitzer EM Grobe TG Schilling E Dörning H Schwartz FW GEK-Report Krankenhaus 2009: Schwerpunktthema: Alkoholmissbrauch bei Jugendlichen. GEK GE, Herausgeber St. Augustin Asgard-Verl 2009 (Schriftenreihe zur Gesundheitsanalyse; Bd. 69) 65. Bitzer EM Grobe TG Neusser S Schneider A Dörning H Schwartz FW Barmer GEK Report Krankenhaus 2010: Schwerpunktthema: Trends in der Endoprothetik des Hüft- und Kniegelenks. Barmer GEK, Herausgeber St. Augustin Asgard-Verl 2010 Schriftenreihe zur Gesundheitsanalyse; Bd. 3 66. Bitzer EM Grobe TG Neusser S Miethe I Schwartz FW BARMER GEK Report Krankenhause 2011: Schwerpunktthema: Der Übergang von der Stationären zur Ambulanten Versorgung bei Psychischen Störungen. Barmer GEK, Herausgeber St. Augustin Asgard-Verl. 2011 Schriftenreihe zur Gesundheitsanalyse; Bd. 9 67. Bitzer EM Grobe TG Neusser S Lorenz C Schwartz FW BARMER GEK Report Krankenhaus 2012: Schwerpunktthema: Die Akut-stationäre Versorgung des Prostatakarzinoms. Barmer GEK, Herausgeber Siegburg Asgard-Verl.-Service 2012 Schriftenreihe zur Gesundheitsanalyse; Bd. 15 68. Bitzer EM Bohm S Hartmann A Priess H-W BARMER GEK Report Krankenhaus 2014: Schwerpunktthema: Die Trends in der Koronaren Revaskularisation. Barmer GEK, Herausgeber Siegburg Asgard-Verl.-Service 2014 Schriftenreihe zur Gesundheitsanalyse; Bd. 27 69. Augurzky B Hentschker C Pilny A Wübker A BARMER Krankenhausreport 2017. BARMER, Herausgeber Krankenhausreport..Siegburg Asgard-Verlagsservice GmbH 2017 Schriftenreihe zur Gesundheitsanalyse; Bd. Band 4 70. Buschmann-Steinhage R Trends in der medizinischen rehabilitation Bundesgesundheitsblatt Gesundheitsforschung Gesundheitsschutz 2017 60 4 368 77 10.1007/s00103-017-2513-1 28197662 71. Tamrakar M O’Keeffe M Traeger AC Harris I Maher C Diagnostic codes for low back pain, nomenclature or noise? A descriptive study of disease classification system coding of low back pain Int J Rheum Dis 2022 25 3 272 80 10.1111/1756-185X.14264 34910365 72. Ashrafian S Schüssel K Schlotmann A Weirauch H Brückner G Schröder H Gesundheitsatlas Deutschland—Rückenschmerzen 73. Herrmann WJ Haarmann A Bærheim A Arbeitsunfähigkeitsregelungen als faktor für inanspruchnahme ärztlicher versorgung in deutschland Z Evidenz Fortbild Qual Im Gesundheitswesen 2015 109 8 552 9 10.1016/j.zefq.2015.10.004 26704816 74. Fatoye F Gebrye T Ryan CG Useh U Mbada C Global and regional estimates of clinical and economic burden of low back pain in high-income countries: a systematic review and meta-analysis Front Public Health 2023 11 1098100 10.3389/fpubh.2023.1098100 37383269 PMC10298167 75. Lambeek LC van Tulder MW Swinkels ICS Koppes LLJ Anema JR van Mechelen W The trend in total cost of back pain in The Netherlands in the period 2002 to 2007 Spine 2011 36 13 1050 8 10.1097/BRS.0b013e3181e70488 21150697 76. Wynne-Jones G Dunn KM Has there been a change in the rates of UK sickness certification for back pain over time? An examination of historical data from 2000 to 2010 BMJ Open 2016 6 4 009634 10.1136/bmjopen-2015-009634 PMC4853988 27113234 77. Virtanen M Local economy and sickness absence: prospective cohort study J Epidemiol Community Health 2005 59 11 973 8 10.1136/jech.2005.036236 16234426 PMC1732933 78. Melzner L Kröger C Arbeitsunfähigkeit bei psychischen störungen—ökonomische, individuelle und behandlungsspezifische aspekte Bundesgesundheitsblatt Gesundheitsforschung Gesundheitsschutz 2024 67 7 751 9 10.1007/s00103-024-03894-6 38789543 PMC11230963 79. Oliveira CB Maher CG Pinto RZ Traeger AC Lin CWC Chenot JF Clinical practice guidelines for the management of non-specific low back pain in primary care: an updated overview Eur Spine J 2018 27 11 2791 803 10.1007/s00586-018-5673-2 29971708 80. AWMF Nationale VersorgungsLeitlinie nicht-spezifischer kreuzschmerz (national guideline non-specific low back pain) 2017 Available online at: https://www.leitlinien.de/themen/kreuzschmerz/2-auflage (Accessed June 11, 2024) 81. Downie A Hancock M Jenkins H Buchbinder R Harris I Underwood M How common is imaging for low back pain in primary and emergency care? Systematic review and meta-analysis of over 4 million imaging requests across 21 years Br J Sports Med 2020 54 11 642 51 10.1136/bjsports-2018-100087 30760458 82. Dagenais S Galloway EK Roffey DM A systematic review of diagnostic imaging use for low back pain in the United States Spine J 2014 14 6 1036 48 10.1016/j.spinee.2013.10.031 24216398 83. Jenkins HJ Downie AS Maher CG Moloney NA Magnussen JS Hancock MJ Imaging for low back pain: is clinical use consistent with guidelines? A systematic review and meta-analysis Spine J 2018 18 12 2266 77 10.1016/j.spinee.2018.05.004 29730460 84. Dos Santos VL Sato KS Maher CG Vidal RVC Grande GHD Costa LOP Clinical indicators to monitor health care in low back pain: a scoping review Int J Qual Health Care 2024 36 2 mzae044 10.1093/intqhc/mzae044 38814664 85. Grandt D Kossack N Brechtel T BARMER Heil- und Hilfsmittelreport 2017: Schriftenreihe zur Gesundheitsanalyse. BARMER, Herausgeber Heil- und Hilfsmittelreport…Siegburg Ansgard Verlagsservice GmbH 2017 Schriftenreihe zur Gesundheitsanalyse; Bd. Band 6 86. Kiel S Raus C Sierocinski E Knauthe P Chenot JF Concordance of patient beliefs and expectations regarding the management of low back pain with guideline recommendations—a cross-sectional study in Germany BMC Fam Pract 2020 21 1 275 10.1186/s12875-020-01352-1 33342429 PMC7751122 87. Haake M Müller HH Schade-Brittinger C Basler HD Schäfer H Maier C German Acupuncture trials (GERAC) for chronic low back pain: randomized, multicenter, blinded, parallel-group trial with 3 groups Arch Intern Med 2007 167 17 1892 8 10.1001/Archinte.167.17.1892 17893311 88. AOK WIDO, Wissenschaftliches Institut der AOK Arzneiverbrauch nach Altersgruppen 2018 2019 Available online at: https://www.wido.de/fileadmin/Dateien/Dokumente/Forschung_Projekte/Arzneimittel/wido_arz_verbrauch_altersgruppen_2018.pdf (Accessed June 11, 2021) 89. Petzke F Bock F Hüppe M Nothacker M Norda H Radbruch L Long-term opioid therapy for chronic noncancer pain: second update of the German guidelines Pain Rep 2020 5 5 840 10.1097/PR9.0000000000000840 PMC7447355 32904018 90. Marschall U L’hoest H Radbruch L Häuser W Long-term opioid therapy for chronic non-cancer pain in Germany Eur J Pain Lond Engl 2016 20 5 767 76 10.1002/ejp.802 26492066 91. Sundmacher L Fischbach D Schuettig W Naumann C Augustin U Faisst C Which hospitalisations are ambulatory care-sensitive, to what degree, and how could the rates be reduced? Results of a group consensus study in Germany Health Policy Amst Neth 2015 119 11 1415 23 10.1016/j.healthpol.2015.08.007 26428441 92. Brunn M Kratz T Padget M Clément MC Smyrl M Why are there so many hospital beds in Germany? Health Serv Manage Res 2023 36 1 75 81 10.1177/09514848221080691 35331042 93. Grotle M Småstuen MC Fjeld O Grøvle L Helgeland J Storheim K Lumbar spine surgery across 15 years: trends, complications and reoperations in a longitudinal observational study from Norway BMJ Open 2019 9 8 028743 10.1136/bmjopen-2018-028743 PMC6688683 31375617 94. Martin BI Mirza SK Spina N Spiker WR Lawrence B Brodke DS Trends in lumbar fusion procedure rates and associated hospital costs for degenerative spinal diseases in the United States, 2004 to 2015 Spine 2019 44 5 369 76 10.1097/BRS.0000000000002822 30074971 95. Sivasubramaniam V Patel HC Ozdemir BA Papadopoulos MC Trends in hospital admissions and surgical procedures for degenerative lumbar spine disease in England: a 15-year time-series study BMJ Open 2015 5 12 009011 10.1136/bmjopen-2015-009011 PMC4679892 26671956 96. Burke LG Burke RC Orav EJ Bryan AF Friend TH Richardson DA Trends in performance of hospital outpatient procedures and associated 30-day costs among Medicare beneficiaries from 2011 to 2018 Healthc Amst Neth 2023 11 4 100718 10.1016/j.hjdsi.2023.100718 37913606 97. Snowdon E Biswas S Almansoor ZR Aizan LNB Chai XT Reghunathan SM Temporal trends in neurosurgical volume and length of stay in a public healthcare system: a decade in review with a focus on the COVID-19 pandemic Surg Neurol Int 2023 14 407 10.25259/SNI_787_2023 38053709 PMC10695347 98. Daniel T Koetsenruijter J Wensing M Wronski P Chronische kreuzschmerzen—nutzertypen ambulanter versorgung : eine clusteranalyse der inanspruchnahme ambulanter regelversorgung anhand von routinedaten der AOK baden-württemberg Schmerz Berl Ger 2022 36 5 326 32 10.1007/s00482-021-00565-2 PMC9512853 34213648 ",
  "metadata": {
    "Title of this paper": "Chronische kreuzschmerzen—nutzertypen ambulanter versorgung : eine clusteranalyse der inanspruchnahme ambulanter regelversorgung anhand von routinedaten der AOK baden-württemberg",
    "Journal it was published in:": "Frontiers in Pain Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479410/"
  }
}