{
  "title": "Paper_1002",
  "abstract": "pmc Cancer Med Cancer Med 1974 canmed CAM4 Cancer Medicine 2045-7634 Wiley PMC12481447 PMC12481447.1 12481447 12481447 41025546 10.1002/cam4.71278 CAM471278 CAM4-2025-05-2502.R3 1 Research Article Research Article  LAG3 Yao Shijie  1 Chen Siming  2 Wan Shimeng  1 Wang Anjin  1 Liang Ziyan  1 Liu Xuelian  1 Gao Yang  1 Cai Hongbing https://orcid.org/0009-0002-3186-5704  1 zn000738@whu.edu.cn   1 Department of Gynecological Oncology Zhongnan Hospital of Wuhan University Wuhan China   2 Department of Urology Zhongnan Hospital of Wuhan University Wuhan China * Correspondence: zn000738@whu.edu.cn 30 9 2025 10 2025 14 19 497574 10.1002/cam4.v14.19 e71278 05 9 2025 08 5 2025 16 9 2025 30 09 2025 01 10 2025 01 10 2025 © 2025 The Author(s). Cancer Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Background Cervical cancer remains a significant health burden for women worldwide, with persistent high‐risk HPV infection being a major etiological factor. Despite treatment advances, prognosis for recurrent or metastatic disease remains poor. Pyroptosis, a form of programmed cell death, plays a dual role in tumor immunity, but its implications in cervical cancer are not fully elucidated. This study aims to systematically characterize pyroptosis‐related genes (PRGs) in cervical cancer and explore their prognostic and therapeutic relevance. Methods Multi‐omics data from TCGA and GEO databases were integrated to analyze genetic variations, expression patterns, and prognostic significance of 52 PRGs in cervical cancer. Consensus clustering was used to identify PRG subtypes. A prognostic risk score model was constructed using LASSO‐Cox regression based on differentially expressed genes (DEGs). Functional validation was performed via in vitro and in vivo experiments, including Western blot, CCK‐8, colony formation, transwell assays, and a subcutaneous tumor model. Single‐cell RNA sequencing data ( GSE171894 GSE168652 Results Two distinct PRG subtypes were identified, with subtype A showing immune activation features. A five‐gene prognostic signature (GNAZ, LAG3, IL‐1β, CA2, SPRR3) effectively stratified patients into high‐ and low‐risk groups. Low LAG3 expression was associated with poor prognosis. Functional experiments demonstrated that LAG3 overexpression suppressed cervical cancer cell proliferation, migration, and tumor growth, while its knockdown promoted malignant phenotypes. Single‐cell analysis revealed high LAG3 expression in Treg and CD8⁺ T cells, suggesting its role in immune regulation. Conclusion This study establishes a novel PRG‐based prognostic model and highlights LAG3 as a key tumor suppressor and immune regulator in cervical cancer. These findings provide insights into the interplay between pyroptosis and antitumor immunity, supporting LAG3 as a potential therapeutic target for cervical cancer immunotherapy. Studies have found that the molecular typing of pyroptostic‐related genes (PRGs) in cervical cancer can predict prognosis, and the GNAZ/LAG3/IL1B/CA2/SPRR3 risk scoring model has been constructed. Experiments have confirmed that LAG3 inhibits tumor progression by regulating Treg and CD8 + chemotherapy response GEO pyroptosis TCGA tumor immune microenvironment Hubei Province Health and Family Planning Scientific Research Project WJ2023M067 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:30.09.2025  S. Yao S. Chen S. Wan  LAG3 Cancer Medicine 14 19 2025 e71278 10.1002/cam4.71278  Funding: Shijie Yao, Siming Chen, and Shimeng Wan contributed equally to this work and share first authorship. 1 Introduction Cervical cancer is one of the most common malignant tumors in the world [ 1 2 3 4 5 6 7 8 9 10 11 12 Pyroptosis is a type of programmed cell death (PCD) activated by inflammatory vesicles [ 13 14 15 16 17 18 19 20 21 22 18 23 24 25 26 This study comprehensively analyzed mutation profiles, copy number variations (CNVs), and expression patterns of 52 pyroptosis‐related genes (PRGs) using multi‐center datasets (TCGA and GEO). Molecular subtyping via consensus clustering revealed distinct immune infiltration characteristics. A prognostic prediction model was constructed by combining key genes (GNAZ, LAG3, IL‐1β, CA2, and SPRR3) and clinicopathologic parameters. Functional experiments demonstrated that LAG3 inhibits tumor proliferation and migration, while single‐cell sequencing identified its predominant expression in Treg and CD8 + 2 Result 2.1 Investigation of the Expression and Genetic Variability of Pyroptosis‐Related Genes in Cervical Cancer Using the TCGA dataset, we analyzed 52 PRGs to assess the occurrence of CNVs and somatic mutations in cervical cancer (Table S1 1A 1B 1C 1D GSE30759 S1A S1B–L S2A–K FIGURE 1 Investigation of the expression and genetic variability of pyroptosis‐related genes in cervical cancer. (A) Mutation frequencies of 52 PRGs in the TCGA cervical cancer dataset. Each column represents an individual patient, while each row corresponds to a specific PRG. (B) The chromosomal localization of PRGs is shown, with red dots indicating amplifications and blue dots representing deletions. (C) The frequencies of CNVs for various PRGs in the TCGA cohort are represented by the height of the columns, reflecting the percentage of variation observed. (D) The expression levels of PRGs differ between normal tissues and cervical cancer tissues. Blue boxes represent normal cervical samples, while red boxes represent cervical cancer samples. Asterisks indicate statistical significance (* p p 2.2 Molecular Patterning and Genotyping Identification of Pyroptosis‐Related Genes To better understand the association between PRG expression and cervical cancer, we used the “ConsensusClusterPlus” program to categorize the TCGA cervical cancer cohort based on 34 PRG expression levels that significantly affected prognosis. When K 2A S3A–I S3K 2B S3J 2C 2D FIGURE 2 Molecular patterning and genotyping identification of pyroptosis‐related genes. (A) The TCGA and GEO datasets were used to create a consensus clustering matrix for cervical cancer patients ( K p p p 2.3 Prognostic Landscape of Pyroptosis‐Related Genes Based on DEGs To explore the gene cluster differences between the two PRG clusters, we extracted 324 differentially expressed genes (DEGs) from the two PRG clusters (Table S2 S4A S4B S3 K S5A–J S5K 3A p 3B 3C FIGURE 3 Prognostic landscape of pyroptosis‐related genes based on DEGs. (A) A heatmap showing gene expression and the distribution of clinical traits across the four DEG clusters. Clinical traits included: Patient age and histologic grading. (B) Kaplan–Meier survival analysis for OS among the four DEG clusters ( p p p p 2.4 Construction and Validation of Prognostic Model We randomly divided the cervical cancer dataset into training and testing groups using Stratified Random Sampling (SRS) and applied a LASSO‐Cox regression model with a minimum λ (Figure 4A,B 4C S6A–I 4D,E S6J 4F 4G S6K 4H 4I 4J 4K S7A S7B FIGURE 4 Construction and validation of prognostic model. (A) LASSO regression was performed on a set of 5 DEGs associated with OS. (B) Cross‐validation was used to adjust parameter selection in LASSO regression. (C) 5 key DEGs with corresponding parameters involved in prognostic model construction. (D) In the training cohort, comparing the survival rates of high‐risk and low‐risk groups using a Kaplan–Meier survival analysis. (E) Performing a Kaplan–Meier survival analysis to compare the survival rates of the high‐risk and low‐risk groups in the testing cohort. (F) The ROC curves of the prediction models in the training cohort. (G) The ROC curve of the prediction model in the testing cohort. (H) Differential expression of risk scores between 2 subgroups based on consensus clustering of PRGs. (I) Differential expression of risk scores between 4 subgroups based on DEG consensus cluster typing. (J) Sankey diagram showing the distribution of PRGs clusters, DEG clusters, risk scores, and survival status (fustat). (K) There was a disparity in the PRGs between the high‐risk score groups and the low‐risk score groups (* p p p 2.5 Risk Score and Immune Microenvironment Assessment and Immunotherapy Prediction Studies have shown a correlation between pyroptosis and immune cell infiltration [ 27 5A + 5B + 5C–G + 5H–M S8 FIGURE 5 Risk score and immune microenvironment assessment and immunotherapy prediction. (A) TME scores vary between high‐risk and low‐risk groups, including the stromal, immune, and estimate scores. (B) Heatmap showing the correlation between the expression of 5 key DEGs involved in risk score construction and immune cell infiltration. (C–M) Correlation between risk score and immune cell infiltration (* p p p 2.6 Identification of Key Genes and Determination of Gene Function To assess the significance of five key genes in cervical cancer, we used the UALCAN website to analyze data on their association with OS. The results revealed that low expression of LAG3 was linked to a poor prognosis in cervical cancer ( p p S9A–E 28 6A S4 FIGURE 6 LAG3 affects the proliferative capacity of cervical cancer cells. (A) The protein level of LAG3 was confirmed in 8 cervical cancer tissues and corresponding paraneoplastic tissues using Western blot analysis, N stands for cervical tissue, T stands for cervical cancer tissue. (B) Immunofluorescence was used to assess the proliferative ability of Siha cells and Hela cells after LAG3 knockdown and overexpression. (C) The proliferative ability of Siha cells and Hela cells were evaluated by CCK8 assay after LAG3 knockdown or overexpression. Data are presented as mean values ± SD, with n n t p p To investigate the effect of LAG3 on cervical cancer cell biology, we first optimized the dose–response of siLAG3 siLAG3 S10A,B LAG3 6B 6C,D LAG3 7A,B LAG3 7C LAG3 7D–F FIGURE 7 LAG3 modulates migration, invasion, and tumor growth in cervical cancer. (A) Transwell assay were used to assess the migratory ability of Siha cells and Hela cells after LAG3 knockdown or overexpression (upper panel), followed by statistical analysis (lower panel). Data are presented as mean values ± SD, with n n n LAG3 n t p p 2.7 Immune Cell Potential Value of LAG3 To further explore the role of LAG3 in the immune microenvironment of cervical cancer, we obtained the single‐cell datasets GSE171894 GSE168652 8A + 8B + 8C + 8D 8E 8F–H S11A,B FIGURE 8 Localization, manifestation, and intercellular signaling of LAG3. (A) Overall distribution of immune and non‐immune cells. (B) Cells are categorized into seven kinds using cell‐specific marker genes, which include tumor cells, Treg cells, CD8 + + 3 Discussion 3.1 Role of Pyroptosis and Immune Modulation in Cervical Cancer Cervical cancer is a malignancy that specifically targets the female reproductive system. The primary cause of almost 90% of cervical malignancies is a chronic infection of the human papillomavirus (HPV) [ 29 30 31 32 33 34 Pyroptosis is an inflammatory form of PCD triggered by disrupted cellular homeostasis [ 13 14 35 36 37 38 39 40 41 Our study provides insight into the immunological status of cervical cancer cells with pyroptosis based on PRG molecular typing. Although cellular pyroptosis has been characterized in colorectal [ 41 42 43 44 45 3.2 Mechanistic Insights Into LAG3 Our study demonstrated that LAG3 + 46 LAG3 37 3.3 Clinical Translation and Therapeutic Implications We constructed a risk score model based on 5 key genes. The sensitivity and specificity of this prognostic model in short‐term (1 year) prognosis were high (AUC > 0.85), while the AUC at 3 and 5 years was stable between 0.65 and 0.70, which indicated its predictive value for medium‐term and long‐term survival. The clinical application of the model is mainly in risk stratification and treatment selection. Low‐risk patients showed sensitivity to PD‐1 inhibitors, and combining LAG3 modulation with PD‐1 inhibition may help overcome resistance [ 45 3.4 Limitations of the Study Although this study provides new insights into the prognosis and treatment of PRGs in cervical cancer, there are some limitations. First, the small sample sizes of the TCGA and GEO datasets may limit the statistical power of the molecular typing and risk score models and their generalizability. Second, although our subcutaneous tumor model showed that LAG3 In conclusion, we comprehensively analyzed and demonstrated the crucial role played by pyroptosis and immunomodulation in cervical cancer using a multicenter dataset. In addition, we constructed a prognostic prediction model by combining key genes and clinicopathological parameters and found an important role for LAG3 in immunomodulation and tumor suppression in cervical cancer. 4 Methods 4.1 Cervical Cancer Data Collecting and Processing The Cancer Genome Atlas (TCGA) database ( https://portal.gdc.cancer.gov https://xena.ucsc.edu/ GSE30759 GSE171894 GSE168652 https://www.ncbi.nlm.nih.gov/geo/ 4.2 Consensus Clustering Identifies Patterns of PRGs Based on earlier evaluations [ 42 47 48 49 50 51 52 53 54 55 56 S1 p K 4.3 Functional Recognition and Immune Characterization of Gene Clusters MSigDB's “c2.cp.kegg.v7.4.symbols.gmt” file was used to investigate PRG functions in biological pathways. Subsequently, Gene Set Variation Analysis (GSVA) was conducted using the “GSEABase” and “GSVA” packages, where |log2FC| > 0.1 and adjusted p 57 4.4 Construction and Evaluation of Risk Scoring Prediction Model As a measure of randomness, the TCGA and GEO datasets were pooled and randomly split into the training group (177 cases) and the testing group (177 cases) using SRS. Univariate Cox regression analysis was used to evaluate the expression value of each DEG. Multivariate Cox regression analysis was then used to determine the top 5 DEGs with the best prediction performance. These DEGs include GNAZ, LAG3, IL‐1β, CA2, and SPRR3. To create risk rating models, LASSO regression analysis was performed. The testing group was used to verify the training group's results. The risk score for each patient was calculated as follows: (Exp gene1 × coefficient gene1) + (Exp gene2 × coefficient gene2) + … + (Exp gene5 × coefficient gene5). Patients were divided into two groups with high and low risk scores based on the median of risk assessments in the training group. The Kaplan–Meier curve was used to illustrate the patient's OS, and the model's accuracy was assessed using the AUC of the ROC curve to determine the model's predictive capacity. 4.5 Construction and Performance Evaluation of Nomogram Based on the clinicopathological data of cervical cancer patients, the R package “rms” was used to build a nomogram; the performance of the nomogram was evaluated by comparing the 1‐, 3‐, and 5‐year OS calibration curves. 4.6 Drug Susceptibility Prediction Using data from the Genomics of Drug Sensitivity in Cancer (GDSC) database ( https://www.cancerrxgene.org/ 4.7 Cell Culture and Transfection American Type Culture Collection (ATCC, USA) provided and identified the Hela and Siha cells utilized in this study. Hela and Siha cells were cultured in DMEM media supplemented with 10% fetal bovine serum. All cell lines were negative for mycoplasma infection. For transfection, Lipofectamine 3000 (L3000015, Invitrogen) was utilized. 4.8 Cell Phenotype Assay To detect cell viability in the CCK8 assay, 3000 transfected cells were inoculated into each well of a 96‐well plate. Subsequently, each well was injected with 10 μL of CCK‐8 solution (HY‐K0301, MCE) at different time intervals, and the absorbance at 450 nm was recorded. The transfected cells were cultured in 6‐well plates at a density of 1000 cells per well for the colony formation assay and incubated at 37°C for about 2 weeks. After discarding the medium, the cells were fixed with 4% formaldehyde for 30 min, stained with 0.1% crystal violet for 30 min, rinsed with water, and dried. The cells were counted using ImageJ software. In the transwell assay, 200 μL of serum‐free medium was combined with 40,000 cells, which were then injected into the top chambers with or without matrix gel (Corning, USA). Subsequently, 600 μL of serum‐containing medium was filled into the bottom chambers. Cells were incubated for 24 h, fixed for 30 min, and then stained with crystal violet for 1 h. After washing and drying, the cells were counted using ImageJ software. 4.9 Western Blot Analysis Cells were added to RIPA buffer including phosphatase inhibitors and protease inhibitors, lysed on ice for 30 min, and then the proteins were denatured at 100°C. After separation on SDS‐PAGE gels, denatured proteins were transferred to PVDF membranes. The PVDF membrane was soaked with 5% skimmed milk and incubated with a specific primary antibody and a matched secondary antibody. Finally, protein levels were detected by chemiluminescence. 4.10 Immunofluorescence The cells are positioned on a 6‐well plate with sterile 22 × 22 mm coverslips. The cellular concentration was modified to around 30% during 24 h. The cells were immobilized using a 4% paraformaldehyde solution for 20 min. Subsequently, they were rinsed thrice with PBS and subjected to a 0.4% Triton X‐100 treatment for 10 min. The cells were rinsed thrice with PBS. The sections were obstructed using a 2% BSA solution for 30 min, followed by two washes with PBS. Introduce the pre‐set primary antibody and allow it to incubate at a temperature of 4°C for the night. The secondary antibody was introduced and allowed to undergo incubation for 1 h at ambient temperature. Subsequently, a concentration of 0.5 μg/mL DAPI, produced in PBS, was added and left for 10 min. The acquisition of images was performed using a laser confocal microscope (C2, Nikon, Japan). 4.11 Human Tissues Eight cervical cancer tissues and 8 corresponding paraneoplastic tissues were obtained from Zhongnan Hospital, Wuhan University, Department of Gynecologic Oncology. The research received permission from the Institutional Ethics Review Board (approval number: 2020029). 4.12 Animal Study Animal experiments were approved by the Zhongnan Hospital of Wuhan University's Experimental Animal Welfare Ethics Committee (Approval No. ZN2024081). We bought female BALB/c mice that were 4 weeks old from GemPharmatech Co. Ltd. (Jiangsu, China). Lentiviral transfection of U14 cells was used in animal experiments. Genpharma (Shanghai, China) supplied the lentivirus, and puromycin (1 μg/mL, Sigma) was used to screen the transfection. In the subcutaneous tumor‐bearing model, mice were randomly divided into control ( shNC shLAG3 7 3 2 4.13 Single Cell Data Analysis We used the “harmony” R package for data integration of cervical cancer samples from GSE168652 GSE171894 4.14 Statistical Analysis The “limma” package was used to conduct univariate and multivariate Cox regression analyses to provide independent predicted values. LASSO‐Cox regression analysis with 10‐fold cross‐validation was conducted using the “glmnet” package. Using the “survival” package, we generated Kaplan–Meier survival curves and calculated log‐rank tests. The “rms” and “timeROC” packages were used to create calibration and ROC curves, respectively. The “GSVA” software was used to compare genomes. OS was calculated using Kaplan–Meier curves. R software (version 4.1.2) and the Perl programming language were used to conduct all statistical analyses (version 5.30.1). Author Contributions  Shijie Yao: Siming Chen: Shimeng Wan: Anjin Wang: Ziyan Liang: Xuelian Liu: Yang Gao: Hongbing Cai: Ethics Statement All research involving human participants strictly adhered to the principles outlined in the Declaration of Helsinki and has been approved by the Ethics Committee of Zhongnan Hospital of Wuhan University (Approval number: 2020029), and written informed consent was obtained from all patients. Animal experiments were approved by the Zhongnan Hospital of Wuhan University's Experimental Animal Welfare Ethics Committee (Approval No. ZN2024081). Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Data S1. Acknowledgements This study was supported by Hubei Province Health and Family Planning Scientific Research Project (WJ2023M067). The funders played no role in the study design, data collection and analysis, decision to publish, or preparation of the manuscript. Data Availability Statement The data are available from the TCGA database ( https://portal.gdc.cancer.gov/ http://www.ncbi.nlm.nih.gov/geo/ References 1 F. Bray J. Ferlay I. Soerjomataram R. L. Siegel L. A. Torre A. Jemal Global Cancer Statistics 2018: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA: A Cancer Journal for Clinicians 68 6 2018 394 424 30207593 10.3322/caac.21492 2 D. H. Moore Cervical Cancer Obstetrics and Gynecology 107 5 2006 1152 1161 16648423 10.1097/01.AOG.0000215986.48590.79 3 M. Arbyn E. Weiderpass L. Bruni Estimates of Incidence and Mortality of Cervical Cancer in 2018: A Worldwide Analysis Lancet Global Health 8 2 2020 e191 e203 31812369 10.1016/S2214-109X(19)30482-6 PMC7025157 4 M. Arbyn X. Castellsagué S. de Sanjosé Worldwide Burden of Cervical Cancer in 2008 Annals of Oncology: Official Journal of the European Society for Medical Oncology 22 12 2011 2675 2686 21471563 10.1093/annonc/mdr015 5 A. B. Moscicki M. Schiffman A. Burchell Updating the Natural History of Human Papillomavirus and Anogenital Cancers Vaccine 30 Suppl 5 5 2012 F24 F33 23199964 10.1016/j.vaccine.2012.05.089 PMC3700362 6 E. J. Crosbie M. H. Einstein S. Franceschi H. C. Kitchener Human Papillomavirus and Cervical Cancer Lancet (London, England) 382 9895 2013 889 899 23618600 10.1016/S0140-6736(13)60022-7 7 A. Giannini V. Di Donato T. Golia D'Augè Strategic Approaches in Management of Early‐Stage Cervical Cancer: A Comprehensive Editorial Clinical and Experimental Obstetrics & Gynecology 51 10 2024 235 8 P. Annede S. Gouy C. Haie‐Meder P. Morice C. Chargari Place of Radiotherapy and Surgery in the Treatment of Cervical Cancer Patients Cancer Radiotherapie: Journal de la Societe Francaise de Radiotherapie Oncologique 23 6–7 2019 737 744 31455591 10.1016/j.canrad.2019.07.151 9 J. Ferlay E. Steliarova‐Foucher J. Lortet‐Tieulent Cancer Incidence and Mortality Patterns in Europe: Estimates for 40 Countries in 2012 European Journal of Cancer (Oxford, England: 1990) 49 6 2013 1374 1403 23485231 10.1016/j.ejca.2012.12.027 10 D. Mauricio B. Zeybek J. Tymon‐Rosario J. Harold A. D. Santin Immunotherapy in Cervical Cancer Current Oncology Reports 23 6 2021 61 33852056 10.1007/s11912-021-01052-8 11 H. Zhu H. Luo W. Zhang Z. Shen X. Hu X. Zhu Molecular Mechanisms of Cisplatin Resistance in Cervical Cancer Drug Design, Development and Therapy 10 2016 1885 1895 27354763 10.2147/DDDT.S106412 PMC4907638 12 J. Chen C. Solomides H. Parekh F. Simpkins H. Simpkins Cisplatin Resistance in Human Cervical, Ovarian and Lung Cancer Cells Cancer Chemotherapy and Pharmacology 75 6 2015 1217 1227 25894720 10.1007/s00280-015-2739-2 13 J. Ruan S. Wang J. Wang Mechanism and Regulation of Pyroptosis‐Mediated in Cancer Cell Death Chemico‐Biological Interactions 323 2020 109052 32169591 10.1016/j.cbi.2020.109052 14 S. Kesavardhana R. K. S. Malireddi T. D. Kanneganti Caspases in Cell Death, Inflammation, and Pyroptosis Annual Review of Immunology 38 2020 567 595 10.1146/annurev-immunol-073119-095439 PMC7190443 32017655 15 A. Zychlinsky M. C. Prevost P. J. Sansonetti   Shigella flexneri Nature 358 6382 1992 167 169 1614548 10.1038/358167a0 16 I. Jorgensen E. A. Miao Pyroptotic Cell Death Defends Against Intracellular Pathogens Immunological Reviews 265 1 2015 130 142 25879289 10.1111/imr.12287 PMC4400865 17 Z. Zhang Y. Zhang S. Xia Gasdermin E Suppresses Tumour Growth by Activating Anti‐Tumour Immunity Nature 579 7799 2020 415 420 32188940 10.1038/s41586-020-2071-9 PMC7123794 18 J. Gao X. Qiu G. Xi Downregulation of GSDMD Attenuates Tumor Proliferation via the Intrinsic Mitochondrial Apoptotic Pathway and Inhibition of EGFR/Akt Signaling and Predicts a Good Prognosis in Non‐Small Cell Lung Cancer Oncology Reports 40 4 2018 1971 1984 30106450 10.3892/or.2018.6634 PMC6111570 19 S. B. Cheng A. Nakashima W. J. Huber Pyroptosis Is a Critical Inflammatory Pathway in the Placenta From Early Onset Preeclampsia and in Human Trophoblasts Exposed to Hypoxia and Endoplasmic Reticulum Stressors Cell Death & Disease 10 12 2019 927 31804457 10.1038/s41419-019-2162-4 PMC6895177 20 C. Gu D. Draga C. Zhou miR‐590‐3p Inhibits Pyroptosis in Diabetic Retinopathy by Targeting NLRP1 and Inactivating the NOX4 Signaling Pathway Investigative Ophthalmology & Visual Science 60 13 2019 4215 4223 31618425 10.1167/iovs.19-27825 21 C. C. Zhang C. G. Li Y. F. Wang Chemotherapeutic Paclitaxel and Cisplatin Differentially Induce Pyroptosis in A549 Lung Cancer Cells via Caspase‐3/GSDME Activation Apoptosis: An International Journal on Programmed Cell Death 24 3–4 2019 312 325 30710195 10.1007/s10495-019-01515-1 22 C. Rogers D. A. Erkes A. Nardone A. E. Aplin T. Fernandes‐Alnemri E. S. Alnemri Gasdermin Pores Permeabilize Mitochondria to Augment Caspase‐3 Activation During Apoptosis and Inflammasome Activation Nature Communications 10 1 2019 1689 10.1038/s41467-019-09397-2 PMC6459836 30976076 23 A. Al Mamun A. A. Mimi M. A. Aziz Role of Pyroptosis in Cancer and Its Therapeutic Regulation European Journal of Pharmacology 910 2021 174444 34453928 10.1016/j.ejphar.2021.174444 24 N. Saeki Y. Kuwahara H. Sasaki H. Satoh T. Shiroishi Gasdermin (Gsdm) Localizing to Mouse Chromosome 11 Is Predominantly Expressed in Upper Gastrointestinal Tract but Significantly Suppressed in Human Gastric Cancer Cells Mammalian Genome: Official Journal of the International Mammalian Genome Society 11 9 2000 718 724 10967128 10.1007/s003350010138 25 Y. Wang W. Gao X. Shi Chemotherapy Drugs Induce Pyroptosis Through Caspase‐3 Cleavage of a Gasdermin Nature 547 7661 2017 99 103 28459430 10.1038/nature22393 26 D. A. Erkes W. Cai I. M. Sanchez Mutant BRAF and MEK Inhibitors Regulate the Tumor Immune Microenvironment via Pyroptosis Cancer Discovery 10 2 2020 254 269 31796433 10.1158/2159-8290.CD-19-0672 PMC7007378 27 W. Gao X. Wang Y. Zhou X. Wang Y. Yu Autophagy, Ferroptosis, Pyroptosis, and Necroptosis in Tumor Immunotherapy Signal Transduction and Targeted Therapy 7 1 2022 196 35725836 10.1038/s41392-022-01046-3 PMC9208265 28 S. Yao L. Zhao S. Chen Cervical Cancer Immune Infiltration Microenvironment Identification, Construction of Immune Scores, Assisting Patient Prognosis and Immunotherapy Frontiers in Immunology 14 2023 1135657 36969161 10.3389/fimmu.2023.1135657 PMC10037308 29 J. M. Walboomers M. V. Jacobs M. M. Manos Human Papillomavirus Is a Necessary Cause of Invasive Cervical Cancer Worldwide Journal of Pathology 189 1 1999 12 19 10451482 10.1002/(SICI)1096-9896(199909)189:1<12::AID-PATH431>3.0.CO;2-F 30 J. Doorbar N. Egawa H. Griffin C. Kranjec I. Murakami Human Papillomavirus Molecular Biology and Disease Association Reviews in Medical Virology 25 Suppl 1 2015 2 23 25752814 10.1002/rmv.1822 PMC5024016 31 J. T. Schiller P. M. Day R. C. Kines Current Understanding of the Mechanism of HPV Infection Gynecologic Oncology 118 2010 S12 S17 20494219 10.1016/j.ygyno.2010.04.004 PMC3493113 32 L. M. Elit H. Hirte Management of Advanced or Recurrent Cervical Cancer: Chemotherapy and Beyond Expert Review of Anticancer Therapy 14 3 2014 319 332 24428511 10.1586/14737140.2014.866041 33 M. S. Ning V. Ahobila A. Jhingran Outcomes and Patterns of Relapse After Definitive Radiation Therapy for Oligometastatic Cervical Cancer Gynecologic Oncology 148 1 2018 132 138 29089122 10.1016/j.ygyno.2017.10.017 34 O. D'Oria G. Bogani I. Cuccu Pharmacotherapy for the Treatment of Recurrent Cervical Cancer: An Update of the Literature Expert Opinion on Pharmacotherapy 25 1 2024 55 65 38159033 10.1080/14656566.2023.2298329 35 M. H. Zaki P. Vogel M. Body‐Malapel M. Lamkanfi T. D. Kanneganti IL‐18 Production Downstream of the Nlrp3 Inflammasome Confers Protection Against Colorectal Tumor Formation Journal of Immunology 185 8 2010 4912 4920 10.4049/jimmunol.1002046 PMC3104023 20855874 36 L. Z. Ellis W. Liu Y. Luo Green Tea Polyphenol Epigallocatechin‐3‐Gallate Suppresses Melanoma Growth by Inhibiting Inflammasome and IL‐1β Secretion Biochemical and Biophysical Research Communications 414 3 2011 551 556 21982776 10.1016/j.bbrc.2011.09.115 PMC3430966 37 L. C. Chen L. J. Wang N. M. Tsang Tumour Inflammasome‐Derived IL‐1β Recruits Neutrophils and Improves Local Recurrence‐Free Survival in EBV‐Induced Nasopharyngeal Carcinoma EMBO Molecular Medicine 4 12 2012 1276 1293 23065753 10.1002/emmm.201201569 PMC3531603 38 C. Rogers T. Fernandes‐Alnemri L. Mayes D. Alnemri G. Cingolani E. S. Alnemri Cleavage of DFNA5 by Caspase‐3 During Apoptosis Mediates Progression to Secondary Necrotic/Pyroptotic Cell Death Nature Communications 8 2017 14128 10.1038/ncomms14128 PMC5216131 28045099 39 J. Shi Y. Zhao K. Wang Cleavage of GSDMD by Inflammatory Caspases Determines Pyroptotic Cell Death Nature 526 7575 2015 660 665 26375003 10.1038/nature15514 40 Z. Peng P. Wang W. Song GSDME Enhances Cisplatin Sensitivity to Regress Non‐Small Cell Lung Carcinoma by Mediating Pyroptosis to Trigger Antitumor Immunocyte Infiltration Signal Transduction and Targeted Therapy 5 1 2020 159 32839451 10.1038/s41392-020-00274-9 PMC7445264 41 W. Song J. Ren R. Xiang C. Kong T. Fu Identification of Pyroptosis‐Related Subtypes, the Development of a Prognosis Model, and Characterization of Tumor Microenvironment Infiltration in Colorectal Cancer Oncoimmunology 10 1 2021 1987636 34676149 10.1080/2162402X.2021.1987636 PMC8526024 42 Y. Ye Q. Dai H. Qi A Novel Defined Pyroptosis‐Related Gene Signature for Predicting the Prognosis of Ovarian Cancer Cell Death Discovery 7 1 2021 71 33828074 10.1038/s41420-021-00451-x PMC8026591 43 S. Xiao Y. Shen M. Zhang X. Liu T. Cai F. Wang VacA Promotes Pyroptosis via TNFAIP3/TRAF1 Signaling to Induce Onset of Atrophic Gastritis Microbiological Research 296 2025 128142 40138873 10.1016/j.micres.2025.128142 44 L. P. Andrews A. E. Marciscano C. G. Drake D. A. Vignali LAG3 (CD223) as a Cancer Immunotherapy Target Immunological Reviews 276 1 2017 80 96 28258692 10.1111/imr.12519 PMC5338468 45 A. P. Shi X. Y. Tang Y. L. Xiong Immune Checkpoint LAG3 and Its Ligand FGL1 in Cancer Frontiers in Immunology 12 2021 785091 35111155 10.3389/fimmu.2021.785091 PMC8801495 46 C. Hivroz LAG3 Disrupts the TCR Signal by Local Acidification Nature Immunology 23 5 2022 649 651 35477982 10.1038/s41590-022-01196-0 47 R. Karki T.‐D. Kanneganti Diverging Inflammasome Signals in Tumorigenesis and Potential Targeting Nature Reviews. Cancer 19 4 2019 197 214 30842595 10.1038/s41568-019-0123-y PMC6953422 48 X. Xia X. Wang Z. Cheng The Role of Pyroptosis in Cancer: Pro‐Cancer or Pro‐“Host”? Cell Death & Disease 10 9 2019 650 31501419 10.1038/s41419-019-1883-8 PMC6733901 49 B. Wang Q. Yin AIM2 Inflammasome Activation and Regulation: A Structural Perspective Journal of Structural Biology 200 3 2017 279 282 28813641 10.1016/j.jsb.2017.08.001 PMC5733693 50 S. M. Man T.‐D. Kanneganti Regulation of Inflammasome Activation Immunological Reviews 265 1 2015 6 21 25879280 10.1111/imr.12296 PMC4400844 51 Y. Zhou H. Zhou L. Hua Verification of Ferroptosis and Pyroptosis and Identification of PTGS2 as the Hub Gene in Human Coronary Artery Atherosclerosis Free Radical Biology and Medicine 171 2021 55 68 33974977 10.1016/j.freeradbiomed.2021.05.009 52 J. Shi W. Gao F. Shao Pyroptosis: Gasdermin‐Mediated Programmed Necrotic Cell Death Trends in Biochemical Sciences 42 4 2017 245 254 27932073 10.1016/j.tibs.2016.10.004 53 K. Wang Q. Sun X. Zhong Structural Mechanism for GSDMD Targeting by Autoprocessed Caspases in Pyroptosis Cell 180 5 2020 941 955 32109412 10.1016/j.cell.2020.02.002 54 Q. Wang Y. Wang J. Ding A Bioorthogonal System Reveals Antitumour Immune Function of Pyroptosis Nature 579 7799 2020 421 426 32188939 10.1038/s41586-020-2079-1 55 P. Broz P. Pelegrín F. Shao The Gasdermins, a Protein Family Executing Cell Death and Inflammation Nature Reviews Immunology 20 3 2020 143 157 10.1038/s41577-019-0228-2 31690840 56 L.‐L. Tan X.‐L. Jiang L.‐X. Xu TP53‐Induced Glycolysis and Apoptosis Regulator Alleviates Hypoxia/Ischemia‐Induced Microglial Pyroptosis and Ischemic Brain Damage Neural Regeneration Research 16 6 2021 1037 1043 33269748 10.4103/1673-5374.300453 PMC8224121 57 P. Charoentong F. Finotello M. Angelova Pan‐Cancer Immunogenomic Analyses Reveal Genotype‐Immunophenotype Relationships and Predictors of Response to Checkpoint Blockade Cell Reports 18 1 2017 248 262 28052254 10.1016/j.celrep.2016.12.019 ",
  "metadata": {
    "Title of this paper": "Pan‐Cancer Immunogenomic Analyses Reveal Genotype‐Immunophenotype Relationships and Predictors of Response to Checkpoint Blockade",
    "Journal it was published in:": "Cancer Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481447/"
  }
}