{
  "title": "Paper_797",
  "abstract": "pmc Cancer Med Cancer Med 1974 canmed CAM4 Cancer Medicine 2045-7634 Wiley PMC12464875 PMC12464875.1 12464875 12464875 41001946 10.1002/cam4.71266 CAM471266 CAM4-2025-03-1659.R2 1 Review Review Roles of miR OSCC Aghiorghiesei Alexandra Iulia  1 Nutu Andreea  2 Mehterov Nikolay  3  4 Kontos Christos K. https://orcid.org/0000-0002-9935-8461  5 Vladimirov Boyan  6  7 Buduru Rares  8 Braicu Cornelia https://orcid.org/0000-0002-3055-4747  2 cornelia.braicu@umfcluj.ro Berindan‐Neagoe Ioana https://orcid.org/0000-0001-5828-1325  9  10   1 Department of Prosthodontics and Dental Materials Faculty of Dental Medicine, Iuliu Hațieganu University of Medicine and Pharmacy Cluj‐Napoca Romania   2 Research Center for Functional Genomics, Biomedicine and Translational Medicine Iuliu Hațieganu University of Medicine and Pharmacy Cluj‐Napoca Romania   3 Department of Medical Biology Medical University‐Plovdiv Plovdiv Bulgaria   4 Research Institute Medical University‐Plovdiv Plovdiv Bulgaria   5 Department of Biochemistry and Molecular Biology, Faculty of Biology National and Kapodistrian University of Athens Athens Greece   6 Department of Maxillofacial Surgery Medical University‐Plovdiv Plovdiv Bulgaria   7 Clinical Unit of Maxillofacial Surgery University Hospital Pulmed Plovdiv Bulgaria   8 Stomestet Clinic Cluj‐Napoca Romania   9 Doctoral School The Iuliu Hatieganu University of Medicine and Pharmacy ‐Cluj‐Napoca Cluj‐Napoca Romania   10 Medical Sciences Academy Bucharest Romania * Correspondence: cornelia.braicu@umfcluj.ro 26 9 2025 10 2025 14 19 497574 10.1002/cam4.v14.19 e71266 22 8 2025 22 3 2025 09 9 2025 26 09 2025 27 09 2025 27 09 2025 © 2025 The Author(s). Cancer Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Oral squamous cell carcinoma (OSCC) is a common and aggressive form of head and neck cancer, frequently associated with smoking, alcohol consumption, and HPV infection. MicroRNAs (miRNAs) are small, non‐coding RNA transcripts that play significant roles in cancer initiation and progression. In this study, we focused on the miR‐181 family members' influence on OSCC tumorigenesis and progression, focusing on their distinct biological functions and regulatory mechanisms in OSCC‐specific contexts. Attention was given to the potential of these transcripts as biomarkers, considering their differential expression in OSCC tissues and biofluids such as plasma, serum, and saliva. Alterations in salivary miR‐181 levels have been correlated with different stages of oral lesion progression, underscoring their utility as non‐invasive biomarkers for early detection and risk stratification. Moreover, we discuss the implications of miR‐181 family modulation on biological processes in preclinical OSCC studies, highlighting their involvement in cancer hallmarks, including invasion, migration, metastasis, radio‐ and chemotherapy resistance. These findings underscore the therapeutic and diagnostic potential of the miR‐181 family in OSCC management. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:26.09.2025  A. I. Aghiorghiesei A. Nutu N. Mehterov Roles of miR OSCC Cancer Medicine 14 19 2025 e71266 10.1002/cam4.71266  Funding: 1 Introduction Oral squamous cell carcinoma (OSCC) represents around 90% of all types of oral cancer and, when combined with pharyngeal cancer, ranks as the sixth most common cancer globally [ 1 2 3 4 1 miRNAs are endogenous, small (20–22 nucleotides in length) noncoding RNA molecules. These short‐length transcripts proved to have an essential role in regulating gene expression. They directly impact essential signaling and network modulation, leading to wide‐ranging pathophysiological and pathological mechanisms that affect cell fate [ 5 6 2 3 4 7 8 9 10 The article focuses on the biological roles and clinical relevance of miR‐181 family members in OSCC. It provides a comprehensive overview of current knowledge regarding their involvement in key tumor processes, including proliferation, invasion, metastasis, and therapy resistance, and evaluates their potential as diagnostic, prognostic, and predictive biomarkers. In addition, it examines the capacity of miR‐181 members to serve as therapeutic targets, highlighting how these transcripts interact with critical molecular pathways implicated in OSCC pathogenesis. By integrating data from experimental and clinical studies, the article also explores their potential utility in precision medicine strategies aimed at improving patient outcomes. The literature search was performed using the keywords “miR‐181a,” “miR‐181b,” “miR‐181c,” “miR‐181d,” and “OSCC.” 2  miR The miR‐181 family members are highly conserved across species, suggesting potential functional redundancy and evolutionary importance. They are believed to have originated in urochordates, underscoring their deep evolutionary roots [ 11 5 11 12 13 13 14 15 11 13 Functional annotation of their target genes indicates that the miR‐181 family is involved in key biological processes and signal transduction pathways. The diverse regulatory network and context‐dependent roles of miR‐181 underscore the importance of investigating its expression patterns and upstream regulators, particularly transcription factors, to better understand its function in various malignancies. In this paper, we provide a comprehensive overview of the roles of the miR‐181 family in OSCC (Figure 1 FIGURE 1 Summary of the role of the miR‐181 family members (miR‐181a, miR‐181b, miR‐181c, and miR‐181d) in OSCC. The blue color represents target genes influenced by these miRNAs, which are involved in critical processes such as apoptosis regulation, cell proliferation, metastasis, and chemoresistance. The interactions between miR‐181 family members and their target genes underscore their potential as diagnostic markers and therapeutic targets in OSCC. 3  miR Recent investigations have revealed that miR‐181 family members have altered expression levels in various tumor tissues and play a pivotal role in carcinogenesis and tumor progression (Table 1 26 27 28 29 27 28 29 30 31 TABLE 1 miR‐181 family members' expression levels in oral pathology. Pathology miRNA expression Role References OL and OSCC Increase of miR‐181a in OSCC ( n n n Prognostic value, malignant transformation [ 16 OL and OSCC Increase of miR‐181a in OSCC ( n n n Prognostic value along with miR‐21, miR‐345 [ 17 LSCC: Increase of miR‐181a in LSCC tissue; actinic cheilitis without epithelial dysplasia ( n n n Early diagnostic marker involved in malignant transformation of squamous carcinoma [ 18 OSCC Increase of miR‐181a/b in OSCC ( n n Part of a 4‐miRNA panel (miR‐21‐5p, miR‐107, miR‐1247‐3p, and miR‐181b‐3p)‐for lymph node metastasis; [ 19 OVC and OSCC Increase of miR‐181b (30 well‐differentiated OSCC tumors and normal adjacent tissue; 15 normal oral mucosa samples) Prognostic marker [ 20 OSCC Decrease of miR‐181a in OSCC ( n n Therapeutic target: suppressive effect by downregulating K‐ras. [ 21 OSCC Decrease of miR‐181a in OSCC ( n n Therapeutic target and diagnostic biomarker [ 1 OSCC Decrease of miR‐181a in OSCC ( n n Therapeutic target: promote tumor growth [ 2 OSCC Decrease of miR‐181d in OSCC ( n n Therapeutic target [ 22 OVC and OSCC Increase of miR‐181b (30 well‐differentiated OSCC tumors and normal adjacent tissue; 15 normal oral mucosa samples) Prognostic marker [ 20 OSCC  Increase of miR‐181a OSCC ( n n Correlated with lymph node metastasis, vascular invasion, and poor survival [ 23 OSCC Increase of miR‐181b in controls ( n n n Increased with increasing degree of dysplasia; discriminating between low‐grade and high‐grade dysplasia [ 24 OSCC Decrease of miR‐181b, miR‐181c in saliva samples were collected from 6 cases with no dysplasia, 7 cases with low‐grade dysplasia, 10 cases with high‐grade dysplasia, and 10 cases with OSCC Biomarker of dysplasia; miR‐181b/c was upregulated in high‐grade dysplasia, increasing with the degree of dysplasia and decreasing in OSCCs [ 25 Abbreviations: LSCC: lip squamous cell carcinoma; OSCC: oral squamous cell carcinoma; OSF: oral submucous fibrosis; OVC: oral verrucous carcinoma; SACC: salivary adenoid cystic carcinoma. Some previous studies report that miR‐181 family members are downregulated in OSCC samples and cell lines [ 1 21 16 17 21 22 32 33 34 34 17 35 miR‐181a and miR‐181d have been shown to have lower expression in OSCC tissues and cell lines than their normal counterparts [ 1 19 21 35 A miRNA signature composed of miR‐21, miR‐18a, miR‐134a, miR‐210, miR‐181a, miR‐19a, and miR‐155 was associated with poor survival in HNSCC [ 36 18 16 17 17 Oral submucous fibrosis is a chronic fibrotic remodeling disease that can lead to oral cancer. A recent study emphasized the important role of the MEG3/miR‐181a axis in this process. This finding underscores the crucial role of the MEG3/miR‐181a axis in disease progression and its potential as a therapeutic target in preventing the transformation of fibrotic lesions into malignant tumors [ 37 Oral verrucous carcinoma is characterized by a low proliferation rate and a high degree of differentiation, with a high prevalence in male smokers [ 20 20 20 38 Senescence is a key mechanism for tumor suppression. Increased levels of miR‐181a were observed during replicative senescence of normal human oral keratinocytes. Furthermore, the effect of miR‐181a overexpression on senescence was evaluated in OSCC. The ectopic expression of miR‐181a was related to the inhibition of cell proliferation and anchorage‐independent growth ability of OSCC cells [ 21 A recent study found that the knockdown of MEG3 was related to reducing myofibroblast activities, which were reestablished by inhibiting miR‐181a and overexpressing the EGR1 37 39 Metastasis to lymph nodes in the neck is a crucial sign of tumor spread in OSCC patients and an important prognostic factor. For patients with occult metastasis, there is an urgent need to develop novel biomarkers to improve disease management [ 19 19 23 23 4 Expression of miR In the context of OSCC, non‐invasive and easily accessible biofluids such as plasma and saliva represent valuable sources for miRNA‐based biomarker discovery. Unlike tissue biopsies, which are invasive and provide only a snapshot of tumor heterogeneity, liquid biopsies offer a dynamic and systemic view of disease progression and response to treatment. Yang et al. demonstrated that miR‐181 is significantly up‐regulated in both tumor tissues and plasma of OSCC patients, with elevated levels correlating with lymph‐node metastasis, vascular invasion, and poor survival. Functional assays revealed that ectopic overexpression of miR‐181 enhances OSCC cell migration and invasion, though not anchorage‐independent growth. These findings suggest miR‐181 as a potential biomarker and contributor to OSCC metastasis [ 23 40 Saliva is of high interest in oral cancer research due to its direct contact with oral epithelial lesions and its content of extracellular vesicles and cell‐free nucleic acids derived from both local and systemic sources. Similarly, circulating miRNAs in plasma are reflective of tumor‐secreted molecules and systemic alterations induced by malignancy, making them promising candidates for early detection and monitoring. The expression of miR‐181b has been examined in the context of oral dysplasia and carcinoma progression, often revealing dynamic and stage‐dependent changes. It was demonstrated that salivary levels of miR‐27b and miR‐181b progressively increased with the severity of epithelial dysplasia, reaching the highest levels in high‐grade dysplasia cases. Interestingly, a marked reduction in miR‐181b levels was observed in samples from OSCC patients, suggesting that while miR‐181b may act as an oncogenic signal during early dysplastic transformation, it could be suppressed or downregulated as malignancy fully develops, possibly reflecting shifts in tumor microenvironment or cellular differentiation states [ 24 25 5  miR OSCC The miR‐181 family has been extensively studied in various preclinical models of OSCC, revealing its complex involvement in the disease's pathology. Each miR‐181 member was demonstrated to target different genes, leading to varied functionality and context‐sensitive activities. Table 2 1 24 1 37 41 TABLE 2 Preclinical studies evaluating the role of miR‐181 family members in oral pathology. Pathology Decreased expression levels Experimental model Delivery system Observation References OSF N/A Primary normal and fibrotic buccal submucous fibroblasts Lipofectamine 2000 Fucoidan‐mediated inhibition of fibrotic properties in OSF via the MEG3/miR‐181a/Egr1 Axis [ 37 Adenoid cystic carcinoma  miR‐181a (SACC‐LM vs. SACC‐83) SACC‐83 and SACC‐LM Lipofectamine 2000 Correlation with circRNA_001982 upregulation, involved in metastasis [ 41 OSCC miR‐181a SCC‐9, KB, Cal‐27, SCC‐25, HN6 and SCC‐090 Lipofectamine 3000 miR‐181a‐mediated Wnt/β‐catenin signaling, mediating invasion and metastasis [ 2 OSCC miR‐181a SCC7, SCC25, Cal27 and C2C12 Lipofectamine3000 miR‐181a‐3p‐regulated TERS signaling from OSCC cell lines to induce C2C12 myotube atrophy and apoptosis [ 42 OSCC — CAL27 and SCC15 Lipofectamine 2000 miR‐181a directly targeted Twist1 and then reversed chemoresistance and EMT [ 34 OSCC — CAL‐27, SCC‐9, CHO, SH‐SY5Y and HT22 miR‐181a‐5p/AgNPs complexes Decrease cell growth and progression in vitro and in vivo [ 43 OSCC miR‐181d SCC‐4, SCC‐9, CAL‐27 and Ca9‐22 Lipofectamin RNAiMAX Affect cell viability and apoptosis in OSCC cells [ 22 OSCC miR‐181a Organotypic raft culture miR‐181a precursor, Letiviral delivery, LV‐GFP  miR‐181a was upregulated during replicative senescence of normal human oral keratinocytes miR‐181a shows tumor suppressive effect against oral squamous cell carcinoma cells by downregulating KRAS [ 21 OSCC miR‐181a CAL‐27 and SCC‐25, nude mice Lipofectamine, RNAiMAX Inhibits cell invasion and migration [ 1 OSCC/oropharyngeal SCC miR‐181a/d in HPV‐infected cells. SCC66, SCC105, UM6, UM10b, in vivo xenograft tumor assay Pre‐miR‐181a and 181d (Ambion), Lipofectamine 2000, Scramble oligonucleotides  HPV16 inhibited the expression of miR‐181a and miR‐181d (miR‐181a/d) miR‐181a/d may represent a novel therapeutic agent for the treatment of HPV‐positive OSCC. Possible involvement of p53 in the regulation of miR‐181a/d because HPV16 suppresses the expression of miR‐181a/d in oral keratinocytes containing wild‐type p53 (data not shown) and the OSCC cell lines containing the defective p53 gene [ 38 SACC miR‐181a SACC83/SACC‐LM and xenograft nude mice Lentiviral delivery Regulate MAPK/SNAI2 pathway related to invasion and proliferation migration and metastatic processes [ 44 OSCC — HSC3 and CAL27, HUVEC, HLEC, and xenograft nude mice Lipofectamine 2000 circFNDC3B sequestered miR‐181c‐5p to upregulate SERPINE1 and PROX1, regulating EMT, invasion and metastasis [ 39 In studies focusing on HPV‐infected oral/oropharyngeal squamous cell carcinoma, miR‐181a expression was significantly reduced in the cell lines SCC66, SCC105, UM6, and UM10b [ 38 21 21 22 1 42 2 44 39 Various preclinical studies have evidenced that miR‐181 family members, particularly miR‐181a and miR‐181d, play important regulatory roles in OSCC pathogenesis and influence the cellular processes. The overexpression of miR‐181d, an oncogenic driver, has been shown to reverse the inhibitory effects of miR‐181d mimics on OSCC cell proliferation and growth [ 21 22 6 Chemoresistance and Radioresistance Chemoresistance in OSCC represents significant therapeutic obstacles, contributing to poor clinical outcomes and high recurrence rates. These phenomena are primarily driven by a range of genetic, epigenetic, and molecular alterations that enable tumor cells to survive cytotoxic insults and evade therapeutic interventions. Despite ongoing research efforts, the underlying mechanisms responsible for chemoresistance in OSCC remain incompletely understood, highlighting the complexity of this multifaceted process. Additionally, radioresistance often shares overlapping mechanisms with chemoresistance, including DNA repair enhancement, apoptosis inhibition, and activation of pro‐survival signaling pathways. In general, platinum‐based drugs are still the most widely used agents in chemotherapy for OSCC. However, research on miR‐181a‐5p's role in platinum drug resistance in OSCC is limited; growing evidence from other epithelial tumors suggests its involvement in chemoresistance. In cisplatin‐resistant lung squamous cell carcinoma (SCC) cells, reduced levels of miR‐181a‐5p have been linked to the increased expression of the oncogene CUGBP Elav‐like family member (CELF1) [ 45 45 46 47 48 high 49 PRKCD 50 34 Cetyltrimethylammonium bromide has been shown to affect the mesenchymal characteristics of SCC4 cells by regulating the TGF‐β/SMAD/miR‐181b/TIMP3 axis, leading to extracellular matrix remodeling [ 51 51 However, further studies are needed to better understand their mechanisms and potential therapeutic applications in overcoming drug resistance—invasion, migration, and metastasis. Invasion, migration, and metastasis are critical processes in cancer progression. Invasion refers to the ability of cancer cells to penetrate surrounding tissues, migration involves the movement of these cells to distant sites, and metastasis is the formation of secondary tumors at new locations. These processes are often driven by changes in the tumor microenvironment, including alterations in cell adhesion, matrix remodeling, and activation of signaling pathways like EMT. Targeting these pathways is crucial for preventing the spread of cancer and improving patient outcomes. miR‐181 family members have been implicated in regulating these processes by targeting key pathways such as the EMT and extracellular matrix remodeling [ 12 52 CCAT1 2 44 Inhibition of circRNA‐001982 inhibited migration and invasion. In contrast, miR‐181a‐5p up‐regulation had the opposite effect, as shown by wound healing and transwell assays. circRNA‐001982/miR‐181a‐5p is related to invasion and metastasis mechanisms [ 41 KRAS ALDH1 38 Most studies focused on miR‐181a, highlighting its involvement in key oncogenic processes such as apoptosis, cell survival, proliferation, and metastasis. This member has been linked to various molecular targets, including BCL2, PRKCD, and PI3K/AKT, making it a central player in chemoresistance, tumor growth, and metastasis. Due to its prominence in these critical cancer pathways, miR‐181a has emerged as a potential biomarker for diagnosis and a therapeutic target. However, it is essential not to underestimate the importance of other miR‐181 family members. Despite sharing a common seed sequence, these transcripts can have different biological effects due to their interaction with diverse genes. For instance, miR‐181b regulates extracellular matrix degradation and metastasis through MMP and inhibits metastasis via SMAD and TGFβ signaling. These distinct functions suggest that miR‐181b may offer therapeutic potential in blocking metastasis. Similarly, miR‐181c is involved in cell differentiation through targets like HOXA, providing opportunities to explore its role in therapeutic strategies to regulate cancer cell differentiation and self‐renewal. The limited number of studies on miR‐181b, miR‐181c, and miR‐181d compared to miR‐181a should not lead to their marginalization. Emerging evidence suggests that these members could play crucial yet distinct roles in regulating tumor behavior, offering new avenues for therapeutic intervention. As research advances, a more comprehensive understanding of each miR‐181 family member's unique contribution to cancer biology is critical (Table 3 TABLE 3 The main implications of miR‐181 family members in diagnosis and therapy. miR‐181 family member Target genes in OSCC Role in OSCC Implication in diagnosis/therapy References miR‐181a BCL2 Regulator of apoptosis, promotes cell survival Diagnostic marker for survival‐related gene therapies [ 1 20 43 miR‐181a PRKCD Enhances chemoresistance through apoptosis reversion Candidate for therapies targeting apoptosis and drug resistance [ 50 miR‐181a DERL1 Promote cancer cell survival and immune evasion Potential therapeutic target for inhibiting cancer cell survival [ 49  miR‐181a miR‐181c KRAS Oncogenic pathway drives cell survival and proliferation Therapeutic target for blocking oncogenic signaling [ 21 22 33 miR‐181a PI3K/AKT Oncogenic pathway drives cell survival and proliferation Therapeutic target for blocking oncogenic signaling [ 53 miR‐181a TWIST EMT regulator, invasion and metastasis; drug resistance Diagnostic and prognostic markers for regulating EMT in therapies [ 34 54 miR‐181b TGFβ, TIMP3 Inhibitor of metalloproteinases regulates extracellular matrix Candidate for antimetastasis therapy [ 51 miR‐181a EGR1 Cell proliferation, invasion, and metastasis; drug resistance Prognostic value; potential therapeutic target for inhibiting cancer cell survival [ 55 miR‐181a MAPK1/SNAIL Oncogenic pathway promotes cell survival and proliferation Diagnostic marker for promoting survival and therapy resistance [ 44  miR‐181a miR‐181c HOXA Involved in cell differentiation Potential target for cell differentiation modulation in therapies [ 56 57 7 Conclusions miR‐181a plays a pivotal role in regulating key genes involved in cell survival and oncogenic signaling, acting as a crucial modulator in the progression of OSCC. The data presented underscore that the miR‐181 family members, particularly miR‐181a, target and alter the expression levels of critical genes and pathways essential for promoting and maintaining the neoplastic state, including those linked to apoptosis, proliferation, metastasis, and resistance to therapy. Given the differential expression of miR‐181a in preneoplastic and neoplastic diseases, additional studies focusing on the regulatory role of miR‐181a‐5p are crucial (Figure 2 FIGURE 2 The Role of miR‐181 Family Members in Regulating Key Oncogenic Pathways in OSCC. This figure illustrates the involvement of miR‐181 family members (miR‐181a, miR‐181b, miR‐181c, and miR‐181d) in the pathogenesis of OSCC by regulating multiple target genes (depicted in blue). These genes are implicated in key cancer‐related processes such as apoptosis regulation, cell proliferation, metastasis, and chemoresistance, each contributing to activating specific hallmarks of cancer. The interactions between miR‐181 family members and their target genes suggest the miRNAs' dual role as diagnostic markers and therapeutic targets. Genes involved in survival‐based therapies, drug resistance, metastasis inhibition, and oncogenic signaling are highlighted, with their respective therapeutic implications indicated in gray italic text. The figure underscores the potential of miR‐181 as a central player in modulating cancer hallmarks, including resistance to cell death, sustained proliferation, invasion, and metastasis. In conclusion, while significant progress has been made in understanding the role of miR‐181a in OSCC, comprehensive research into the entire miR‐181 family is warranted. Unraveling the complex regulatory networks involving these miRNAs could lead to novel therapeutic strategies targeting the molecular underpinnings of OSCC, ultimately improving patients' outcomes. Author Contributions  Alexandra Iulia Aghiorghiesei: Andreea Nutu: Nikolay Mehterov: Christos K. Kontos: Boyan Vladimirov: Rares Buduru: Cornelia Braicu: Ioana Berindan‐Neagoe: Conflicts of Interest The authors declare no conflicts of interest. Acknowledgments Alexandra Iulia Aghiorghiesei has received a Grant Intern No. 32159/5/16.12.2024 from the host institution. She was also partially funded by the Competitiveness Operational Program, 2014–2020, entitled Clinical and economic impact of personalized targeted anti‐microRNA therapies in reconverting lung cancer chemoresistance—CANTEMIR, No. 35/1, September 2016, and the European Union‐Next GenerationEU, through the National Recovery and Resilience Plan of the Republic of Bulgaria, project no. BG‐RRP‐2.004‐0007‐C01. Open access publishing facilitated by Anelis Plus (the official name of \"Asociatia Universitatilor, a Institutelor de Cercetare – Dezvoltare si a Bibliotecilor Centrale Universitare din Romania”), as part of the Wiley ‐ Anelis Plus agreement. Data Availability Statement Data sharing not applicable to this article as no datasets were generated or analysed during the current study. References 1 G. Xu Y. Yang J. Yang Screening and Identification of miR‐181a‐5p in Oral Squamous Cell Carcinoma and Functional Verification in Vivo and in Vitro BMC Cancer 23 1 2023 162 36800936 10.1186/s12885-023-10600-3 PMC9936757 2 G. H. Li Z. H. Ma X. Wang Long Non‐Coding RNA CCAT1 Is a Prognostic Biomarker for the Progression of Oral Squamous Cell Carcinoma via miR‐181a‐Mediated Wnt/β‐Catenin Signaling Pathway Cell Cycle 18 21 2019 2902 2913 31599709 10.1080/15384101.2019.1662257 PMC6791703 3 L.‐M. Cao N. N. Zhong Z. Z. Li Lymph Node Metastasis in Oral Squamous Cell Carcinoma: Where We Are and Where We Are Going Clinical and Translational Discovery 3 4 2023 e227 4 M. M. Justesen H. Stampe K. K. Jakobsen Impact of Tumor Subsite on Survival Outcomes in Oral Squamous Cell Carcinoma: A Retrospective Cohort Study From 2000 to 2019 Oral Oncology 149 2024 106684 38211527 10.1016/j.oraloncology.2024.106684 5 A. Bell‐Hensley S. Das A. McAlinden The miR‐181 Family: Wide‐Ranging Pathophysiological Effects on Cell Fate and Function Journal of Cellular Physiology 238 2023 698 713 36780342 10.1002/jcp.30969 PMC10121854 6 J. O'Brien H. Hayder Y. Zayed C. Peng Overview of MicroRNA Biogenesis, Mechanisms of Actions, and Circulation Frontiers in Endocrinology 9 2018 402 30123182 10.3389/fendo.2018.00402 PMC6085463 7 A. Indrieri S. Carrella P. Carotenuto S. Banfi B. Franco The Pervasive Role of the miR‐181 Family in Development, Neurodegeneration, and Cancer International Journal of Molecular Sciences 21 6 2020 2092 32197476 10.3390/ijms21062092 PMC7139714 8 A. A. Svoronos D. M. Engelman F. J. Slack OncomiR or Tumor Suppressor? The Duplicity of MicroRNAs in Cancer Cancer Research 76 13 2016 3666 3670 27325641 10.1158/0008-5472.CAN-16-0359 PMC4930690 9 A. I. Irimie C. Braicu L. Sonea A Looking‐Glass of Non‐Coding RNAs in Oral Cancer International Journal of Molecular Sciences 18 12 2017 2620 29206174 10.3390/ijms18122620 PMC5751223 10 A. I. Irimie A. A. Zimta C. Ciocan The Unforeseen Non‐Coding RNAs in Head and Neck Cancer Genes (Basel) 9 3 2018 134 29494516 10.3390/genes9030134 PMC5867855 11 Z. Yang X. Wan Z. Gu Evolution of the Mir‐181 microRNA Family Computers in Biology and Medicine 52 2014 82 87 25016292 10.1016/j.compbiomed.2014.06.004 12 C. Braicu D. Gulei L. Raduly A. Harangus A. Rusu I. Berindan‐Neagoe Altered Expression of miR‐181 Affects Cell Fate and Targets Drug Resistance‐Related Mechanisms Molecular Aspects of Medicine 70 2019 90 105 31703947 10.1016/j.mam.2019.10.007 13 C. Braicu D. Gulei R. Cojocneanu miR‐181a/b Therapy in Lung Cancer: Reality or Myth? Molecular Oncology 13 1 2019 9 25 30548184 10.1002/1878-0261.12420 PMC6322195 14 R. Su H. S. Lin X. H. Zhang MiR‐181 Family: Regulators of Myeloid Differentiation and Acute Myeloid Leukemia as Well as Potential Therapeutic Targets Oncogene 34 25 2015 3226 3239 25174404 10.1038/onc.2014.274 15 L.‐J. Xu Y. B. Ouyang X. Xiong C. M. Stary R. G. Giffard Post‐Stroke Treatment With miR‐181 Antagomir Reduces Injury and Improves Long‐Term Behavioral Recovery in Mice After Focal Cerebral Ischemia Experimental Neurology 264 2015 1 7 25433215 10.1016/j.expneurol.2014.11.007 PMC4324354 16 J. A. Brito C. C. Gomes A. L. Guimarães K. Campos R. S. Gomez Relationship Between microRNA Expression Levels and Histopathological Features of Dysplasia in Oral Leukoplakia Journal of Oral Pathology & Medicine 43 3 2014 211 216 24020903 10.1111/jop.12112 17 N. K. Cervigne P. P. Reis J. Machado Identification of a microRNA Signature Associated With Progression of Leukoplakia to Oral Carcinoma Human Molecular Genetics 18 24 2009 4818 4829 19776030 10.1093/hmg/ddp446 18 A. Assao M. A. C. Domingues E. M. Minicucci F. A. Marchi C. M. Coutinho‐Camillo D. T. Oliveira The Relevance of miRNAs as Promising Biomarkers in Lip Cancer Clinical Oral Investigations 25 7 2021 4591 4598 33439343 10.1007/s00784-020-03773-9 19 K. Y. P. Liu S. Y. Zhu D. Brooks Tumor microRNA Profile and Prognostic Value for Lymph Node Metastasis in Oral Squamous Cell Carcinoma Patients Oncotarget 11 23 2020 2204 2215 32577165 10.18632/oncotarget.27616 PMC7289532 20 Z. Y. Deng Y. H. Wang H. Z. Quan Investigation of the Association Between miR‐181b, Bcl‐2 and LRIG1 in Oral Verrucous Carcinoma Molecular Medicine Reports 14 4 2016 2991 2996 27509922 10.3892/mmr.2016.5608 PMC5042782 21 K. H. Shin S. D. Bae H. S. Hong R. H. Kim M. K. Kang N. H. Park miR‐181a Shows Tumor Suppressive Effect Against Oral Squamous Cell Carcinoma Cells by Downregulating K‐Ras Biochemical and Biophysical Research Communications 404 4 2011 896 902 21167132 10.1016/j.bbrc.2010.12.055 22 Y. Shi Y. Li W. Wu MiR‐181d Functions as a Potential Tumor Suppressor in Oral Squamous Cell Carcinoma by Targeting K‐Ras International Journal of Clinical and Experimental Pathology 10 7 2017 7847 7855 31966632 PMC6965231 23 C. C. Yang P. S. Hung P. W. Wang miR‐181 as a Putative Biomarker for Lymph‐Node Metastasis of Oral Squamous Cell Carcinoma Journal of Oral Pathology & Medicine 40 5 2011 397 404 21244495 10.1111/j.1600-0714.2010.01003.x 24 D. Di Stasio A. Romano C. E. Boschetti Salivary miRNAs Expression in Potentially Malignant Disorders of the Oral Mucosa and Oral Squamous Cell Carcinoma: A Pilot Study on miR‐21, miR‐27b, and miR‐181b Cancers (Basel) 15 1 2022 291 36612284 10.3390/cancers15010291 PMC9818333 25 Y. Yang Y. X. Li X. Yang L. Jiang Z. J. Zhou Y. Q. Zhu Progress Risk Assessment of Oral Premalignant Lesions With Saliva miRNA Analysis BMC Cancer 13 1 2013 129 23510112 10.1186/1471-2407-13-129 PMC3637283 26 C. Yang V. Passos Gibson P. Hardy The Role of MiR‐181 Family Members in Endothelial Cell Dysfunction and Tumor Angiogenesis Cells 11 10 2022 1670 35626707 10.3390/cells11101670 PMC9140109 27 T. Rezaei M. Amini Z. S. Hashemi microRNA‐181 Serves as a Dual‐Role Regulator in the Development of Human Cancers Free Radical Biology and Medicine 152 2020 432 454 31899343 10.1016/j.freeradbiomed.2019.12.043 28 A. M. Seoudi Y. A. Lashine A. I. Abdelaziz MicroRNA‐181a ‐ a Tale of Discrepancies Expert Reviews in Molecular Medicine 14 2012 e5 22348355 10.1017/S1462399411002122 29 C. Pop‐Bica S. Pintea R. Cojocneanu‐Petric MiR‐181 Family‐Specific Behavior in Different Cancers: A Meta‐Analysis View Cancer Metastasis Reviews 37 1 2018 17 32 29327093 10.1007/s10555-017-9714-9 30 H. Shen X. D. Weng X. H. Liu miR‐181a‐5p Is Downregulated and Inhibits Proliferation and the Cell Cycle in Prostate Cancer International Journal of Clinical and Experimental Pathology 11 8 2018 3969 3976 31949785 PMC6962816 31 M. Yang X. Zhai T. Ge C. Yang G. Lou miR‐181a‐5p Promotes Proliferation and Invasion and Inhibits Apoptosis of Cervical Cancer Cells via Regulating Inositol Polyphosphate‐5‐Phosphatase A (INPP5A) Oncology Research 26 5 2018 703 712 28653606 10.3727/096504017X14982569377511 PMC7844749 32 Z. Ma X. Qiu D. Wang MiR‐181a‐5p Inhibits Cell Proliferation and Migration by Targeting Kras in Non‐Small Cell Lung Cancer A549 Cells Acta Biochimica et Biophysica Sinica Shanghai 47 8 2015 630 638 10.1093/abbs/gmv054 26124189 33 H. M. El Hanbuli M. A. Abou Sarie KRAS Protein Expression in Oral Squamous Cell Carcinoma: A Potential Marker for Progression and Prognosis Iranian Journal of Pathology 17 4 2022 469 479 36532636 10.30699/IJP.2022.550727.2856 PMC9745753 34 M. Liu J. Wang H. Huang J. Hou B. Zhang A. Wang miR‐181a‐Twist1 Pathway in the Chemoresistance of Tongue Squamous Cell Carcinoma Biochemical and Biophysical Research Communications 441 2 2013 364 370 24148247 10.1016/j.bbrc.2013.10.051 35 D. B. Gissi L. Morandi A. Gabusi A Noninvasive Test for MicroRNA Expression in Oral Squamous Cell Carcinoma International Journal of Molecular Sciences 19 6 2018 1789 29914173 10.3390/ijms19061789 PMC6032413 36 Z. Jamali N. Asl Aminabadi R. Attaran F. Pournagiazar S. Ghertasi Oskouei F. Ahmadpour MicroRNAs as Prognostic Molecular Signatures in Human Head and Neck Squamous Cell Carcinoma: A Systematic Review and Meta‐Analysis Oral Oncology 51 4 2015 321 331 25677760 10.1016/j.oraloncology.2015.01.008 37 C. Y. Fang S. H. Chen C. C. Huang Y. W. Liao S. C. Chao C. C. Yu Fucoidan‐Mediated Inhibition of Fibrotic Properties in Oral Submucous Fibrosis via the MEG3/miR‐181a/Egr1 Axis Pharmaceuticals (Basel) 15 7 2022 833 35890132 10.3390/ph15070833 PMC9317791 38 S. H. Lee S. Hee Lee C.‐R. Lee Human Papillomavirus 16 (HPV16) Enhances Tumor Growth and Cancer Stemness of HPV‐Negative Oral/Oropharyngeal Squamous Cell Carcinoma Cells via miR‐181 Regulation Papillomavirus Research 1 2015 116 125 26693182 10.1016/j.pvr.2015.08.001 PMC4673669 39 X. Li C. Wang H. Zhang circFNDC3B Accelerates Vasculature Formation and Metastasis in Oral Squamous Cell Carcinoma Cancer Research 83 2023 1459 1475 36811957 10.1158/0008-5472.CAN-22-2585 PMC10152237 40 P. Severino L. S. Oliveira F. M. Andreghetto Small RNAs in Metastatic and Non‐Metastatic Oral Squamous Cell Carcinoma BMC Medical Genomics 8 1 2015 31 26104160 10.1186/s12920-015-0102-4 PMC4479233 41 R. Ju Y. Huang Z. Guo The Circular RNAs Differential Expression Profiles in the Metastasis of Salivary Adenoid Cystic Carcinoma Cells Molecular and Cellular Biochemistry 476 2 2021 1269 1282 33237453 10.1007/s11010-020-03989-z 42 L. Qiu W. Chen C. Wu Y. Yuan Y. Li Exosomes of Oral Squamous Cell Carcinoma Cells Containing miR‐181a‐3p Induce Muscle Cell Atrophy and Apoptosis by Transmissible Endoplasmic Reticulum Stress Signaling Biochemical and Biophysical Research Communications 533 4 2020 831 837 32998818 10.1016/j.bbrc.2020.09.066 43 G. Xu X. Song X. Wang Combined miR‐181a‐5p and ag Nanoparticles Are Effective Against Oral Cancer in a Mouse Model International Journal of Nanomedicine 19 2024 9227 9253 39267724 10.2147/IJN.S458484 PMC11390847 44 Q. He X. Zhou S. Li MicroRNA‐181a Suppresses Salivary Adenoid Cystic Carcinoma Metastasis by Targeting MAPK‐Snai2 Pathway Biochimica et Biophysica Acta 1830 11 2013 5258 5266 23911747 10.1016/j.bbagen.2013.07.028 45 X. Zhao J. Wang R. Zhu J. Zhang Y. Zhang DLX6‐AS1 Activated by H3K4me1 Enhanced Secondary Cisplatin Resistance of Lung Squamous Cell Carcinoma Through Modulating miR‐181a‐5p/miR‐382‐5p/CELF1 Axis Scientific Reports 11 1 2021 21014 34697393 10.1038/s41598-021-99555-8 PMC8546124 46 J. Lin X. Chen M. Sun Upregulation of microRNA‐181a‐5p Increases the Sensitivity of HS578T Breast Cancer Cells to Cisplatin by Inducing Vitamin D Receptor‐Mediated Cell Autophagy Oncology Letters 21 4 2021 247 33664811 10.3892/ol.2021.12508 PMC7882884 47 S. Yang P. Wang S. Wang miRNA‐181a‐5p Enhances the Sensitivity of Cells to Cisplatin in Esophageal Adenocarcinoma by Targeting CBLB Cancer Management and Research 12 2020 4981 4990 32612385 10.2147/CMAR.S251264 PMC7323973 48 C. Luo J. Qiu miR‐181a Inhibits Cervical Cancer Development via Downregulating GRP78 Oncology Research 25 8 2017 1341 1348 28245171 10.3727/096504017X14867268787969 PMC7841036 49 H. Shigeishi S. Yokoyama H. Murodumi Melatonin Enhances Cisplatin‐Induced Cell Death Through Inhibition of DERL1 in Mesenchymal‐Like CD44(High) OSCC Cells Journal of Oral Pathology & Medicine 51 3 2022 281 289 34551150 10.1111/jop.13242 50 G. Ke L. Liang J. M. Yang MiR‐181a Confers Resistance of Cervical Cancer to Radiation Therapy Through Targeting the Pro‐Apoptotic PRKCD Gene Oncogene 32 25 2013 3019 3027 22847611 10.1038/onc.2012.323 51 C. H. Yue C. H. Chen Y. R. Pan Cetyltrimethylammonium Bromide Disrupts Mesenchymal Characteristics of Human Tongue Squamous Cell Carcinoma SCC4 Cells Through Modulating Canonical TGF‐β/Smad/miR‐181b/TIMP3 Signaling Pathway Anticancer Research 41 12 2021 6095 6104 34848464 10.21873/anticanres.15429 52 J. Li J. Shen Y. Zhao Role of miR‐181a‐5p in Cancer (Review) International Journal of Oncology 63 4 2023 108 37539738 10.3892/ijo.2023.5556 PMC10552769 53 Y. Wu Y. Wang H. Liu Mechanism of Apoptosis in Oral Squamous Cell Carcinoma Promoted by Cardamonin Through PI3K/AKT Signaling Pathway Scientific Reports 14 1 2024 20802 39242879 10.1038/s41598-024-71817-1 PMC11379709 54 S. D. da Silva M. A. Alaoui‐Jamali F. A. Soares TWIST1 Is a Molecular Marker for a Poor Prognosis in Oral Cancer and Represents a Potential Therapeutic Target Cancer 120 3 2014 352 362 24150986 10.1002/cncr.28404 55 B. Wang H. Guo H. Yu Y. Chen H. Xu G. Zhao The Role of the Transcription Factor EGR1 in Cancer Frontiers in Oncology 11 2021 642547 33842351 10.3389/fonc.2021.642547 PMC8024650 56 Z. Zhao Y. Xing F. Yang LncRNA HOXA‐AS2 Promotes Oral Squamous Cell Proliferation, Migration, and Invasion via Upregulating EZH2 AS an Oncogene Technology in Cancer Research & Treatment 20 2021 15330338211039109 34519570 10.1177/15330338211039109 PMC8445530 57 C. C. Bitu M. F. S. S. Destro M. Carrera HOXA1 Is Overexpressed in Oral Squamous Cell Carcinomas and Its Expression Is Correlated With Poor Prognosis BMC Cancer 12 2012 146 22498108 10.1186/1471-2407-12-146 PMC3351375 ",
  "metadata": {
    "Title of this paper": "HOXA1 Is Overexpressed in Oral Squamous Cell Carcinomas and Its Expression Is Correlated With Poor Prognosis",
    "Journal it was published in:": "Cancer Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12464875/"
  }
}