{
  "title": "Paper_841",
  "abstract": "pmc Orphanet J Rare Dis Orphanet J Rare Dis 401 orphjrdis Orphanet Journal of Rare Diseases 1750-1172 BMC PMC12462058 PMC12462058.1 12462058 12462058 40993704 10.1186/s13023-025-04014-6 4014 1 Research Gestational trophoblastic neoplasia with pancreatic metastasis: clinical characteristics, treatment strategies, and outcomes Cheng Xinghan 1 Wang Dan 1 Wang Xiaoyu 1 Gui Yang 2 Chang Xiaoyan 3 Feng Fengzhi 1 Zhao Jun 1 Yang Junjun 1 Xiang Yang xiangy@pumch.cn 1 1 https://ror.org/02drdmm93 grid.506261.6 0000 0001 0706 7839 Department of Obstetrics and Gynecology, National Clinical Research Center for Obstetric & Gynecologic Diseases, Peking Union Medical College Hospital, Chinese Academy of Medical Sciences & Peking Union Medical College, 2 https://ror.org/04jztag35 grid.413106.1 0000 0000 9889 6335 Department of Ultrasound, Peking Union Medical College Hospital, Chinese Academy of Medical Sciences & Peking Union Medical College, 3 https://ror.org/02drdmm93 grid.506261.6 0000 0001 0706 7839 Department of Pathology, Peking Union Medical College Hospital, Chinese Academy of Medical Sciences & Peking Union Medical College, 24 9 2025 2025 20 478503 482 3 6 2025 22 8 2025 24 09 2025 26 09 2025 26 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ Objective Pancreatic metastasis of gestational trophoblastic neoplasia (GTN) is extremely rare, with only a few reported cases. Methods A retrospective analysis was conducted on GTN patients with pancreatic metastasis at Peking Union Medical College Hospital (2000–2024) and a literature review was performed. A descriptive analysis was carried out on the clinical characteristics, treatment strategies, and outcomes of patients who met the inclusion criteria. Fisher's exact test was used to analyze differences in metastatic patterns and clinical outcomes among patients with different clinical characteristics. Results A total of 24 cases were identified (7 from our institute, 17 from literature): 18 choriocarcinomas, 5 placental-site trophoblastic tumors, and 1 epithelioid trophoblastic tumor. Pancreatic metastasis led to organ-specific symptoms. Treatments included chemotherapy (single/multi-agent), immunotherapy, and targeted therapy. Six patients underwent surgical or localized interventions. Outcomes varied: 9 (37.5%) achieved disease-free survival, 5 (20.8%) had partial remission, and 10 (41.7%) died. Surgical or invasive interventions were associated with significantly improved outcomes ( P Conclusion Pancreatic invasion in GTN is a high-risk condition often associated with poor outcomes. Advanced imaging techniques enhance diagnostic accuracy, while endoscopic ultrasound-guided fine-needle biopsy provides essential histopathological confirmation. Multi-agent chemotherapy remains the cornerstone of treatment, with surgical interventions carefully tailored to the individual patient’s condition. For better management and prognosis, an initial treatment strategy integrating multi-agent chemotherapy, immunotherapy, and targeted therapies may offer benefits; however, further investigation is warranted. Keywords Gestational trophoblastic neoplasia Choriocarcinoma Placental site trophoblastic tumor Epithelioid trophoblastic tumor Pancreas Metastasis National Key R&D National Key Research and Development Program of China 2023YFC2705803 Yang Junjun National High Level Hospital Clinical Research Funding 2022-PUMCH-B084 Yang Junjun http://dx.doi.org/10.13039/501100001809 National Natural Science Foundation of China 82471767 Yang Junjun Beijing Natural Science Foundation 7244388 Wang Xiaoyu pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Institut National de la Santé et de la Recherche Médicale (INSERM) 2025 Introduction Gestational trophoblastic disease comprises a heterogeneous group of premalignant to malignant conditions that arise from the villous trophoblasts of the placenta. The malignant forms of gestational trophoblastic disease are collectively termed gestational trophoblastic neoplasia (GTN), which include invasive moles, choriocarcinoma, placental site trophoblastic tumor (PSTT), and epithelioid trophoblastic tumor (ETT). Among the rare variants of GTN, intraplacental choriocarcinoma comprises approximately 2% of reported cases [ 1 3 4 Due to the affinity of the trophoblast cells for blood vessels, distant metastasis can occur through hematogenous dissemination even in the early stages. Statistics show that about 50–60% of choriocarcinoma patients present with distant metastases at their initial diagnosis. The most common metastatic sites are the lungs (80%), vagina (30%), pelvis (20%), liver (10%), and brain (10%) [ 5 Materials and methods Study design A retrospective study of GTN patients diagnosed with pancreatic metastasis in Peking Union Medical College Hospital was performed. Eligible patients were diagnosed with pancreatic metastases via imaging or histopathology, regardless of the stage of disease, during the study period (between January 2000 and October 2024) and were aged ≥ 18 years at the time of diagnosis. Clinical information was retrieved and systematically organized from the hospital's electronic medical record system. Additional information was obtained through telephone contact when necessary. Patients were staged according to the revised International Federation of Gynecology and Obstetrics (FIGO) criteria for GTN, and FIGO prognostic scores were assigned where applicable. Complete remission was defined as three consecutive weekly measurements of normal beta-serum human chorionic gonadotropin (β-hCG) levels. Partial remission was diagnosed when β-hCG levels declined logarithmically or the tumor focus decreased in size by more than 50%. Disease progression was defined as a sustained plateau or increase in β-hCG levels or the emergence of new metastatic lesions. A comprehensive search of the PubMed, Web of Science, and Embase databases was conducted using MeSH terms in MEDLINE and Emtree terms in Embase. The following keywords were used: gestational trophoblastic neoplasia, choriocarcinoma, placental-site trophoblastic tumor, epithelioid trophoblastic tumor, pancreas, metastasis. Studies reporting pancreatic metastasis from GTN with supporting histological and/or imaging evidence were included. Reports with incomplete clinical data, as well as conference abstracts and posters, were excluded. Two authors independently screened all titles and abstracts, followed by a review of relevant articles. Discrepancies were resolved through consensus or consultation with a third reviewer. The quality of the included studies was assessed using the Joanna Briggs Institute (JBI) Critical Appraisal Checklist for Case Reports [ 6 Statistical analyses Fisher’s exact test was used to analyze differences in metastatic patterns and clinical outcomes across patient subgroups, due to small sample sizes and expected cell counts of less than 5. Statistical analyses were conducted using SPSS software (version 22.0; IBM Corp., Armonk, NY). All tests were two-sided, and a P-value < 0.05 was considered statistically significant. Ethics statement This study was approved by the Institutional Review Board of Peking Union Medical College Hospital (I-23PJ461). Written informed consent was obtained from all participants. Results Case series Seven patients from our institute were included in the study. Clinical characteristics, treatment strategies, and outcomes of the patients are summarized in Table 1 2 3 . 1 Table 1 Summary of the characteristics of cases in our institute Patient Age Tumor type Metastatic site Pretreatment β-hCG (IU/L) Antecedent pregnancy Interval (Months) FIGO stage Prognostic score Initial symptoms Treatment Outcome A 34 CC Pancreas, lungs, liver, brain 12,185 Abortion 10 IV 14 Hemoptysis Thoracoscopic left lower lobectomy, AE*2 cycles, EMA/CO + Camrelizumab*6 cycles, oral Apatinib, Camrelizumab*4 cycles, FAEV*4 cycles, EMA/CO + Toripalimab*2 cycles, TP/TE + Toripalimab*1 cycle, hepatic artery infusion of Fluorouracil + AEV + Bevacizumab*3 cycles Died of gastrointestinal bleeding B 53 PSTT Pancreas, lungs 619 Term 276 IV - Vaginal bleeding Hysterectomy + bilateral salpingo-oophorectomy, FAEV*3 cycles, TP/TE*5 cycles Complete remission C 44 CC Pancreas, brain, liver, kidney, breast 63,506 Term 156 IV 16 Vaginal bleeding Right breast lumpectomy, multiple regimens of chemotherapy*49 cycles Died of cerebral hemorrhage D 32 PSTT Pancreas, liver 2280 Term 8 IV - Vaginal bleeding Hysterectomy, multiple regimens of chemotherapy*31 cycles, including hepatic artery infusion* 1 cycle Died of gastrointestinal bleeding E 40 CC Pancreas, cervix, lungs, brain 268,541 Term 2 IV 14 Abdominal pain, syncope Cervical mass excision during a cesarean section, AE*2 cycles, FAV*1 cycle Died of respiratory and circulatory failure F 24 CC Pancreas, liver, kidney, lungs 14,000 Term 14 IV 20 Vaginal bleeding AE*1 cycle, EMA-CO*4 cycles, EMA-EP*1 cycle, PEA*1 cycle, Fluorouracil intraperitoneal arterial infusion*1 cycle, FAEV*2 cycles Disease progression G 28 CC Pancreas, liver, lungs, adrenal gland 10,178 Term 12 IV 16 Vaginal bleeding FMEV*2 cycles, EMA-CO*4 cycles, TP/TE*2 cycles Disease progression β-hCG: beta-serum human chorionic gonadotropin; FIGO: International Federation of Gynecology and Obstetrics; CC: choriocarcinoma; PSTT: placental-site trophoblastic tumor; AE: actinomycin D and etoposide; FAEV: fluorouracil, actinomycin D, etoposide, and vincristine; FMEV: fluorouracil, methotrexate, etoposide, and vincristine; EMA-CO: etoposide, methotrexate, actinomycin D, and vincristine; TP/TE: paclitaxel + cisplatin / paclitaxel + etoposide; AEV: actinomycin D, etoposide, and vincristine; PEA: cisplatin, etoposide, and actinomycin D Table 2 A compilation of reported cases of pancreatic invasion from GTN References Country Age Tumor Type Tumor Site Pretreatment β-hCG (IU/L) Symptom Treatment Outcome Coşkun [ 7 Turkey 30 CC Pancreas, liver 8800 Abdominal tenderness, mild distention, fever, intraperitoneal hemorrhage Surgical hemostasis Referred to another hospital for chemotherapy Alvarez [ 8 USA 24 CC Pancreas, liver, lungs 9073 Vaginal bleeding, lower abdominal pain, nausea, and vomiting MTX*4 cycles, ACTD*5 cycles, EMA-CO, en bloc distal pancreatectomy/splenectomy, and adrenalectomy Plan to begin further chemotherapy Cheng [ 9 China 44 ETT Pancreas, lungs 21,782 Missed periods, irregular vaginal bleeding Hysterectomy, EMA-CO*5 cycles Plan to begin further chemotherapy Ayas [ 10 Turkey 24 PSTT Pancreas, liver, lungs, kidneys, breast, adrenal and thyroid gland 23,624 Intermittent vaginal bleeding Hysterectomy and pelvic lymph node dissection, EMA-CO*6 cycles, BEP*4 cycles Complete remission Ramachandran [ 11 India 27 CC Pancreas, jaw 98,000 Abdominal pain, fullness, swelling jaw MTX Regular follow-up Rao [ 12 China 28 CC Pancreas 1004 Irregular vaginal bleeding Partial pancreatectomy, 2 cycles of chemotherapy hCG return to normal five weeks after surgery, doing well 34 months after surgery Fatema [ 13 Oman 30 CC Pancreas, liver 49,200 Fever, abdominal pain, intraperitoneal hemorrhage, hypovolemic shock Surgical hemostasis, hepatic artery embolization Died from hemorrhagic shock Youn [ 14 Korea 47 CC Pancreas, liver, lungs, brain 225,000 Abdominal pain, nausea, loss of appetite, headache, weakness, left visual field loss Conservative treatment Died from cerebral edema and hypernatremia 15 days later Huang [ 15 USA 26 CC Pancreas, liver, lungs, brain 63,000 Shortness of breath, right-sided abdominal pain EP*1 cycle, EMA-CO*4 cycles, EMA-EP*3 cycles, Pembrolizumab*3 cycles Chemo-refractory, hCG dramatically decrease after 2 cycles of Pembrolizumab Seresht [ 16 Iran 35 PSTT Pancreas, liver 220 Continuous vaginal bleeding MTX, ATCD, EMA-CO, EMA-EP, distal pancreatectomy and splenectomy Complete remission Stockton [ 17 UK 39 CC Pancreas, liver, lungs, breast 48,990 Shortness of breath and pleuritic chest pain EP Died of respiratory failure Muktesh [ 18 India 27 CC Pancreas 1649 Severe epigastric pain, abdominal distension, fever, breathlessness Conservative treatment Died from severe acute pancreatitis, pulmonary thromboembolism, and bronchopneumonia Yin [ 19 China 43 PSTT Pancreas, liver 148 Recurrent syncope, continuous abdominal pain FAV*5 cycles, FAEV*1 cycle, hepatic artery embolization, EMP*4 cycles, EMA-CO*2 cycles, partial pancreatectomy, TP*5 cycles Follow up to 18 months without any signs of recurrence Sunagozaka [ 20 Japan 43 CC Pancreas, liver, lungs, adrenal gland, lumber vertebra 220 Irregular vaginal bleeding EMA-CO*11 cycles, preventive pancreatic aneurysms embolization Complete remission Zhang [ 21 China 46 CC Pancreas, liver 59,283 Epigastric discomfort 125 β-hCG decrease to 348.3 three months after diagnosis Kumar Upadhyay [ 23 India 24 CC Pancreas, brain, kidneys, lungs, liver, small bowel 1165 Headaches, seizures, and weakness Whole-brain radiotherapy, EMA-CO*7 cycles, EMA-EP*1 cycle, TP/TE*4 cycles, GEMCAP*5 cycles β-hCG decrease to 73.2 Dai [ 22 China 30 CC Pancreas, liver, lungs, kidney 480 Abdominal pain, hemoptysis Chemotherapy Responded well to chemotherapy, under regular follow-up β-hCG: beta-serum human chorionic gonadotropin; CC: choriocarcinoma; PSTT: placental-site trophoblastic tumor; ETT: epithelioid trophoblastic tumor; MTX: methotrexate; ACTD: actinomycin D; FAEV: fluorouracil, actinomycin D, etoposide, and vincristine; EMA-CO: etoposide, methotrexate, actinomycin D, and vincristine; EP: etoposide and cisplatin; EMA-EP: etoposide, methotrexate, actinomycin D, and cisplatin; FAV: floxuridine, actinomycin D, vincristine; EMP: etoposide, methotrexate, platinum; TP: paclitaxel and cisplatin; BEP: bleomycin, etoposide, cisplatin; GEMCAP: gemcitabine, capecitabine Table 3 JBI Critical Appraisal Checklist for Reviews References Study type D1 D2 D3 D4 D5 D6 D7 D8 Coşkun [ 7 Case report ★ ★ ★ ★ ★ Alvarez [ 8 Case report ★ ★ ★ ★ ★ ★ ★ Cheng [ 9 Case series ★ ★ ★ ★ ★ ★ ★ ★ Ayas [ 10 Case report ★ ★ ★ ★ ★ ★ ★ ★ Ramachandran [ 11 Case report ★ ★ ★ ★ ★ ★ Rao [ 12 Case report ★ ★ ★ ★ ★ ★ ★ Fatema [ 13 Case report ★ ★ ★ ★ ★ ★ ★ ★ Youn [ 14 Case report ★ ★ ★ ★ ★ ★ ★ ★ Huang [ 15 Case report ★ ★ ★ ★ ★ ★ ★ ★ Seresht [ 16 Case report ★ ★ ★ ★ ★ ★ ★ Stockton [ 17 Case report ★ ★ ★ ★ ★ ★ ★ ★ Muktesh [ 18 Case report ★ ★ ★ ★ ★ ★ ★ ★ Yin [ 19 Case report ★ ★ ★ ★ ★ ★ ★ ★ Sunagozaka [ 20 Case report ★ ★ ★ ★ ★ ★ ★ ★ Zhang [ 21 Case report ★ ★ ★ ★ ★ ★ Kumar Upadhyay [ 23 Case report ★ ★ ★ ★ ★ ★ ★ ★ Dai [ 22 Case report ★ ★ ★ ★ ★ ★ JBI Critical Appraisal Checklist for Case Reports. D1. Were patients’ demographic characteristics clearly described? D2. Was the patient’s history clearly described and presented as a timeline? D3. Was the current clinical condition of the patient on presentation clearly described? D4. Were diagnostic tests or assessment methods and the results clearly described? D5. Was the intervention(s) or treatment procedure(s) clearly described? D6. Was the post-intervention clinical condition clearly described? D7. Were adverse events (harms) or unanticipated events identified and described? D8. Does the case report provide takeaway lessons? Fig. 1 Flow diagram for the selection of included patients The median age of the enrolled patients from our institute was 36.4 years (range: 24–53 years). Among them, five were diagnosed with choriocarcinoma, with an average prognostic score of 16, classifying them as ultra-high-risk cases. The remaining two patients were diagnosed with PSTT. In addition to pancreatic involvement, common co-existing metastatic sites included the liver (5/7), lungs (5/7), brain (3/7), and kidneys (2/7). Pretreatment serum β-hCG levels ranged from 619 to 268,541 IU/L, with five patients presenting levels exceeding 10,000 IU/L. Regarding previous obstetric history, six patients had a prior term delivery, while one had a history of abortion. Three patients presented with pancreas-related symptoms, such as abdominal pain, jaundice, nausea, and melena, and two patients experienced severe hematemesis. Diagnosis of pancreatic lesions in these seven cases was achieved through ultrasound, abdominal computed tomography (CT), and/or positron emission tomography/computed tomography (PET/CT). One patient had histopathological confirmation of pancreatic metastases via endoscopic ultrasound-guided fine-needle biopsy (EUS-FNB). All patients underwent multi-agent chemotherapy. For patients diagnosed with choriocarcinoma, induction chemotherapy with the AE regimen (actinomycin D and etoposide) was administered, followed by multi-agent chemotherapy regimens including EMA/CO (etoposide, methotrexate, actinomycin D, cyclophosphamide, and vincristine), FAEV (fluorouracil, actinomycin D, etoposide, and vincristine), or FAV (floxuridine, actinomycin D, and vincristine). For patients diagnosed with PSTT, treatment included regimens such as FAEV and BEP (bleomycin, etoposide, and cisplatin). For those with resistant or recurrent disease, salvage therapies included EMA-EP (etoposide, methotrexate, actinomycin D, and cisplatin), TP/TE (paclitaxel plus cisplatin or paclitaxel plus etoposide), and VIP (etoposide, ifosfamide, and cisplatin). Due to a high prognostic score, one patient (Patient A) was enrolled in a clinical trial and received a combination therapy comprising multi-agent chemotherapy, immunotherapy, and targeted therapy. Two patients underwent arterial infusion chemotherapy. None of the patients underwent surgical interventions for the pancreas following evaluation by the surgical team. Among the seven cases, two patients died from upper gastrointestinal bleeding, one from cerebral hemorrhage, and one from respiratory and circulatory failure. Another two patients discontinued treatment due to disease progression. Only one patient achieved complete remission. Notably, Patient A, presented with metastasis in lungs and brains and a high prognostic score of 14, initially received two cycles of AE introduction chemotherapy, followed by a combination regimen of EMA-CO, Camrelizumab, and oral Apatinib. Her β-hCG levels normalized after six cycles of treatment. However, two months after completing chemotherapy, the disease recurred, primarily manifesting as the newly developed liver and pancreatic mass accompanied by symptoms including abdominal pain, nausea, and vomiting. Magnetic resonance imaging (MRI) findings indicated a mass in the pancreatic head measuring approximately 30 mm, raising the suspicion of a solid pseudopapillary neoplasm. Contrast-enhanced ultrasound was utilized for the differential diagnosis (Fig. 2 2 2 Fig. 2 The imaging and histopathological presentations of Patient A. A B C D E F Literature review Seventeen case reports were identified and included from the literature, spanning from 1998 to 2024, involving 17 GTN patients presented with pancreatic invasions [ 7 23 125 A total of 24 patients were included in the metastatic pattern and clinical outcome analysis, comprising seven patients from our study and 17 from previously published literature. Table 4 5 P Table 4 Metastasis pattern in GTN patients with pancreatic metastasis Metastatic site CC PSTT/ETT P Liver 77.8% (14/18) 66.7% (4/6) 0.618 Lungs 61.1% (11/18) 50% (3/6) 0.665 Brain 33.3% (6/18) 0 0.277 Kidney 22.2% (4/18) 16.7% (1/6) > 0.999 Breast 11.1% (2/18) 16.7% (1/6) > 0.999 Adrenal gland 11.1% (2/18) 16.7% (1/6) > 0.999 Cervix 5.6% (1/18) 0 > 0.999 Jaw 5.6% (1/18) 0 > 0.999 Lumber vertebra 5.6% (1/18) 0 > 0.999 Small bowel 5.6% (1/18) 0 > 0.999 Thyroid gland 0 16.7% (1/6) > 0.999 CC: choriocarcinoma; PSTT: placental-site trophoblastic tumor; ETT: epithelioid trophoblastic tumor Table 5 Outcome in GTN patients with pancreatic metastasis Variable Clinical outcome P CR or PR PD Age at diagnosis (years) < 40 9 7 > 0.999 ≥ 40 5 3 Tumor type CC 9 9 0.341 PSTT or ETT 5 1 Pre-treatment β-hCG (IU/L) < 100,000 14 8 0.163 ≥ 100,000 0 2 Number of metastatic sites < 3 8 3 0.24 ≥ 3 6 7 Invasive interventions towards pancreas Yes 6 0 0.024* No 8 10 Treatment strategy Chemotherapy 12 6 > 0.999 Chemotherapy + immunotherapy 1 1 * β-hCG: beta-serum human chorionic gonadotropin; CC: choriocarcinoma; PSTT: placental-site trophoblastic tumor; ETT: epithelioid trophoblastic tumor; CR: complete remission; PR: partial remission; PD: progressive disease Discussion Pancreatic invasion from GTN is an infrequent occurrence, with no available data currently reporting its incidence. Based on statistics from patients treated at our hospital between 2000 and 2024, we estimate that the incidence of pancreatic metastasis in these patients is approximately 0.1–0.2%. However, as our hospital is a tertiary center receiving referrals from across the nation, selection bias must be taken into account. This figure may overestimate the true incidence of pancreatic metastasis in GTN and may not fully reflect real-world conditions. The limitations of imaging examinations may impact the diagnosis of pancreatic metastases, and the application of novel imaging technologies, such as PET/CT, could potentially improve the diagnostic rate. GTN patients with pancreatic involvement are often diagnosed with high-risk, stage IV disease, complicated with multi-organ metastases. Notably, more than half of the enrolled patients had three or more metastatic sites, and the average FIGO prognostic score for patients treated at our institution reached as high as 16. Etoposide-based multi-drug regimens, such as FAEV, EMA-CO, and EMA-EP, remain the cornerstone of treatment for high-risk GTN patients, and induction chemotherapy could provide benefits for patients with poor general conditions [ 24 25 Secondary metastasis to the pancreas is relatively uncommon and often asymptomatic, though it can occasionally present with symptoms such as pain, weight loss, jaundice, acute pancreatitis, or upper gastrointestinal bleeding, which may mimic primary pancreatic cancer. Due to the atypical presentation on imaging, pancreatic metastases can be difficult to distinguish from other benign lesions or primary pancreatic cancer. Ultrasound-guided fine needle aspiration or biopsy is invaluable for obtaining a reliable diagnosis, with accuracy rates reaching up to 97.9% [ 26 27 8 12 16 19 125 20 28 Immunotherapy, particularly immune checkpoint inhibitors (ICIs) such as anti-programmed cell death protein 1 (PD-1) and its ligand (PD-L1) drugs, has emerged as a novel and effective treatment strategy for GTN. Characterized by a high concentration of paternally derived placental antigens and immune surveillance at the fetal-maternal interface, GTN has demonstrated remarkable responsiveness to immunotherapy. In 2017, Ghorani et al. [ 29 30 31 NCT03135769 32 33 34 NCT03135769 35 15 36 37 The main strength of our study lies in being the first and most comprehensive retrospective study to date on pancreatic metastases of GTN, as well as the first to review previously reported cases. However, our study has certain limitations that necessitate cautious interpretation of the findings. This study is based on a retrospective design with a limited sample size, varying treatment modalities, and inconsistent follow-up durations, resulting in significant differences in patient outcomes. Since the aforementioned confounding factors cannot be excluded, making it difficult to draw definitive conclusions from the results. Although randomized controlled trials may represent the ideal study design for evaluating the prognosis of pancreatic metastases in GTN patients, such trials are likely infeasible due to the rarity of this condition. The clinical significance of this study lies in the detailed presentation of pancreatic metastasis from GTN—an exceptionally rare metastatic pattern—highlighting its clinical manifestations, treatment process, and a preliminary exploration of potential prognostic factors. Surgical resection or localized invasive treatments, when carefully tailored to the appropriate patient population and optimal timing, may be associated with improved clinical outcomes; Emerging combination strategies—including multi-agent chemotherapy, immunotherapy, and targeted therapies—may hold promise for improving outcomes in high-risk patients. However, current evidence is insufficient to draw definitive conclusions. Given the rarity, complexity, and heterogeneity of such cases, referral to specialized trophoblastic disease centers and the involvement of a multidisciplinary team are strongly recommended. Future research should focus on collecting multicenter data and conducting prospective studies to better define optimal management strategies and improve patient prognosis. In conclusion, pancreatic invasion in GTN is a high-risk condition often associated with poor outcomes. Advanced imaging techniques enhance diagnostic accuracy, while EUS-FNB provides essential histopathological confirmation. Multi-agent chemotherapy remains the cornerstone of treatment, with surgical interventions carefully tailored to the individual patient’s condition. For better management and prognosis, an initial treatment strategy integrating multi-agent chemotherapy, immunotherapy, and targeted therapies may offer benefits; however, further investigation is warranted. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Author contributions Xinghan Cheng: Data curation, formal analysis, investigation, writing-original graft. Dan Wang & Xiaoyu Wang: Investigation, project administration. Yang Gui & Xiaoyan Chang: Visualization. Fengfeng Zhi & Jun Zhao: Conceptualization, resources. Junjun Yang & Yang Xiang: Conceptualization, supervision, writing- review & editing. Funding This study was supported by grants from the National Key R&D National Key Research and Development Program of China (2023YFC2705803), National High Level Hospital Clinical Research Funding (2022-PUMCH-B084), National Natural Science Foundation of China (82471767), and Beijing Natural Science Foundation (7244388). Availability of data and materials All data generated or analysed during this study are included in this published article. Declarations Ethics approval and consent to participate This study was approved by the Institutional Review Board of Peking Union Medical College Hospital (I-23PJ461). Written informed consent was obtained from all participants. Consent for publication Written informed consent for publication of case details and images was obtained from all participants. Competing interests The authors declare that they have no competing interests. References 1. Dahl J Intraplacental gestational neoplasms: a review of clinically relevant diagnostically challenging lesions Arch Pathol Lab Med 2024 148 398 408 10.5858/arpa.2023-0109-RA 37977155 Dahl J. Intraplacental gestational neoplasms: a review of clinically relevant diagnostically challenging lesions. Arch Pathol Lab Med. 2024;148:398–408. 37977155 10.5858/arpa.2023-0109-RA 2. Stabile G Gentile RM Carlucci S Stampalija T Biffi S Oletto G Maternal and fetal outcomes of intraplacental choriocarcinoma complicated by fetomaternal hemorrhage: a systematic review J Matern Fetal Neonatal Med 2023 36 2285238 10.1080/14767058.2023.2285238 38010764 Stabile G, Gentile RM, Carlucci S, Stampalija T, Biffi S, Oletto G, et al. Maternal and fetal outcomes of intraplacental choriocarcinoma complicated by fetomaternal hemorrhage: a systematic review. J Matern Fetal Neonatal Med. 2023;36:2285238. 38010764 10.1080/14767058.2023.2285238 3. Stabile G Scalia MS Stampalija T Bruno M Laganà AS Sartore A Placental chorangiocarcinoma a specific histological pattern of uncertain incidence and clinical impact: systematic review of the literature J Clin Med 2023 10.3390/jcm12093065 37176506 PMC10179247 Stabile G, Scalia MS, Stampalija T, Bruno M, Laganà AS, Sartore A, et al. Placental chorangiocarcinoma a specific histological pattern of uncertain incidence and clinical impact: systematic review of the literature. J Clin Med. 2023. 10.3390/jcm12093065. 37176506 10.3390/jcm12093065 PMC10179247 4. Clark JJ Slater S Seckl MJ Treatment of gestational trophoblastic disease in the 2020s Curr Opin Obstet Gynecol 2021 33 7 12 10.1097/GCO.0000000000000674 33337613 PMC7116872 Clark JJ, Slater S, Seckl MJ. Treatment of gestational trophoblastic disease in the 2020s. Curr Opin Obstet Gynecol. 2021;33:7–12. 33337613 10.1097/GCO.0000000000000674 PMC7116872 5. Mangla M Singla D Kaur H Sharma S Unusual clinical presentations of choriocarcinoma: a systematic review of case reports Taiwan J Obstet Gynecol 2017 56 1 8 10.1016/j.tjog.2015.05.011 28254207 Mangla M, Singla D, Kaur H, Sharma S. Unusual clinical presentations of choriocarcinoma: a systematic review of case reports. Taiwan J Obstet Gynecol. 2017;56:1–8. 28254207 10.1016/j.tjog.2015.05.011 6. Tufanaru C, Munn Z, Aromataris E, Campbell J, Hopp L. Chapter 3: Systematic reviews of effectiveness. Joanna Briggs Institute reviewer's manual. Adelaide, South Australia: The Joanna Briggs Institute; 2017. 7. Coşkun M Ağıldere AM Boyvat F Tarhan Ç Niron EA Primary choriocarcinoma of the stomach and pancreas: CT findings Eur Radiol 1998 8 1425 1428 10.1007/s003300050567 9853229 Coşkun M, Ağıldere AM, Boyvat F, Tarhan Ç, Niron EA. Primary choriocarcinoma of the stomach and pancreas: CT findings. Eur Radiol. 1998;8:1425–8. 9853229 10.1007/s003300050567 8. Alvarez NR Lambrou N Solorzano CC Metastatic choriocarcinoma to the pancreas Am Surg 2005 71 330 332 10.1177/000313480507100411 15943408 Alvarez NR, Lambrou N, Solorzano CC. Metastatic choriocarcinoma to the pancreas. Am Surg. 2005;71:330–2. 15943408 9. Cheng XD Lü WG Wan XY Chen XD Xie X [Case report and literature review of epithelioid trophoblastic tumor] Zhonghua Fu Chan Ke Za Zhi 2008 43 281 285 18843970 Cheng XD, Lü WG, Wan XY, Chen XD. Xie X [Case report and literature review of epithelioid trophoblastic tumor]. Zhonghua Fu Chan Ke Za Zhi. 2008;43:281–5. 18843970 10. Ayas S Gurbuz A Karateke A Cetiner H Placental site trophoblastic tumor with multiple metastases and complete response to salvage BEP regimen: a case report and review of the literature Med Oncol 2009 26 96 100 10.1007/s12032-008-9076-9 18506643 Ayas S, Gurbuz A, Karateke A, Cetiner H. Placental site trophoblastic tumor with multiple metastases and complete response to salvage BEP regimen: a case report and review of the literature. Med Oncol. 2009;26:96–100. 18506643 10.1007/s12032-008-9076-9 11. Ramachandran BS Murugesan M Ali M Padmanabhan P Primary pancreatic choriocarcinoma presenting as pancreatitis Jop 2012 13 217 218 22406605 Ramachandran BS, Murugesan M, Ali M, Padmanabhan P. Primary pancreatic choriocarcinoma presenting as pancreatitis. Jop. 2012;13:217–8. 22406605 12. Rao M Chen Y Zhu Y Huang Z Zhang L Primary pancreatic choriocarcinoma revealed on FDG PET/CT Clin Nucl Med 2015 40 76 78 10.1097/RLU.0000000000000584 25243947 Rao M, Chen Y, Zhu Y, Huang Z, Zhang L. Primary pancreatic choriocarcinoma revealed on FDG PET/CT. Clin Nucl Med. 2015;40:76–8. 25243947 10.1097/RLU.0000000000000584 13. Fatema N Arora NV Al Abri FM Khan YM Pancreatic and hepatic metastasis of an undiagnosed choriocarcinoma: an exceptional cause of haemoperitoneum in young women - report of a rare case Case Rep Oncol 2016 9 633 638 10.1159/000449462 27920694 PMC5118864 Fatema N, Arora NV, Al Abri FM, Khan YM. Pancreatic and hepatic metastasis of an undiagnosed choriocarcinoma: an exceptional cause of haemoperitoneum in young women - report of a rare case. Case Rep Oncol. 2016;9:633–8. 27920694 10.1159/000449462 PMC5118864 14. Youn HJ Park S Cha S-W Cho YD Jin S-Y Pancreatic choriocarcinoma with multiple metastases: a case report and literature review Korean J Pancreas Biliary Tract 2017 22 82 86 10.15279/kpba.2017.22.2.82 Youn HJ, Park S, Cha S-W, Cho YD, Jin S-Y. Pancreatic choriocarcinoma with multiple metastases: a case report and literature review. Korean J Pancreas Biliary Tract. 2017;22:82–6. 15. Huang M Pinto A Castillo RP Slomovitz BM Complete serologic response to pembrolizumab in a woman with chemoresistant metastatic choriocarcinoma J Clin Oncol 2017 35 3172 3174 10.1200/JCO.2017.74.4052 28742453 Huang M, Pinto A, Castillo RP, Slomovitz BM. Complete serologic response to pembrolizumab in a woman with chemoresistant metastatic choriocarcinoma. J Clin Oncol. 2017;35:3172–4. 28742453 10.1200/JCO.2017.74.4052 16. Seresht LM Golmohamadzadeh H Yousefi Z Jafarian AH Moghimi A Soltani M Unusual site of metastasis of placental site trophoblastic tumor: case report and literature review Middle East J Cancer 2018 9 328 333 Seresht LM, Golmohamadzadeh H, Yousefi Z, Jafarian AH, Moghimi A, Soltani M. Unusual site of metastasis of placental site trophoblastic tumor: case report and literature review. Middle East J Cancer. 2018;9:328–33. 17. Stockton L Green E Kaur B De Winton E Non-gestational choriocarcinoma with widespread metastases presenting with type 1 respiratory failure in a 39-year-old female: case report and review of the literature Case Rep Oncol 2018 11 151 158 10.1159/000486639 29681814 PMC5903105 Stockton L, Green E, Kaur B, De Winton E. Non-gestational choriocarcinoma with widespread metastases presenting with type 1 respiratory failure in a 39-year-old female: case report and review of the literature. Case Rep Oncol. 2018;11:151–8. 29681814 10.1159/000486639 PMC5903105 18. Muktesh G Mitra S Sinha SK Dhaka N Saikia UN Sarma P Acute pancreatitis caused by isolated pancreatic metastasis from uterine choriocarcinoma Int J Gynecol Pathol 2019 38 430 434 10.1097/PGP.0000000000000532 30028356 Muktesh G, Mitra S, Sinha SK, Dhaka N, Saikia UN, Sarma P, et al. Acute pancreatitis caused by isolated pancreatic metastasis from uterine choriocarcinoma. Int J Gynecol Pathol. 2019;38:430–4. 30028356 10.1097/PGP.0000000000000532 19. Yin S Qin J Zhou Q Zhu C Li Y Wu D Sequential metastasis to the liver and pancreas 4 years after gestational trophoblastic neoplasia: a case report J Int Med Res 2020 48 300060520966807 10.1177/0300060520966807 33131363 PMC7653300 Yin S, Qin J, Zhou Q, Zhu C, Li Y, Wu D, et al. Sequential metastasis to the liver and pancreas 4 years after gestational trophoblastic neoplasia: a case report. J Int Med Res. 2020;48:300060520966807. 33131363 10.1177/0300060520966807 PMC7653300 20. Sunagozaka H Utsunomiya M Kawase S Tanabe K Shimizu Y Kawasaki A Neoplastic aneurysms in areas with metastatic pancreatic choriocarcinoma during chemotherapy Suizo 2020 35 592 600 10.2958/suizo.35.592 Sunagozaka H, Utsunomiya M, Kawase S, Tanabe K, Shimizu Y, Kawasaki A, et al. Neoplastic aneurysms in areas with metastatic pancreatic choriocarcinoma during chemotherapy. Suizo. 2020;35:592–600. 21. Zhang R Wang M Huang W Zhou Z Primary choriocarcinoma of pancreas with liver metastasis: a case report Chin J Pancreatol 2022 22 299 300 Zhang R, Wang M, Huang W, Zhou Z. Primary choriocarcinoma of pancreas with liver metastasis: a case report. Chin J Pancreatol. 2022;22:299–300. 22. Dai S Dong Y Multifocal hemorrhagic choriocarcinoma with diffuse pancreatic FDG uptake on 18F-FDG PET/CT Clin Nucl Med 2024 10.1097/RLU.0000000000005433 39466649 Dai S, Dong Y. Multifocal hemorrhagic choriocarcinoma with diffuse pancreatic FDG uptake on 18F-FDG PET/CT. Clin Nucl Med. 2024. 10.1097/RLU.0000000000005433. 39466649 10.1097/RLU.0000000000005433 23. Kumar Upadhyay A Shekhar S Singh R Kumar A Pandey V Prakash A Extragonadal nongestational choriocarcinoma with a widespread metastasis in a young female: a case report and literature analysis with a focus on unmet needs Cureus 2023 15 e48441 38074016 10.7759/cureus.48441 PMC10701193 Kumar Upadhyay A, Shekhar S, Singh R, Kumar A, Pandey V, Prakash A. Extragonadal nongestational choriocarcinoma with a widespread metastasis in a young female: a case report and literature analysis with a focus on unmet needs. Cureus. 2023;15:e48441. 38074016 10.7759/cureus.48441 PMC10701193 24. Braga A Paiva G Alevato R Saldanha P Elias KM Horowitz NS Treatment of high-risk gestational trophoblastic neoplasia Hematol Oncol Clin North Am 2024 38 1245 1258 10.1016/j.hoc.2024.08.014 39322460 Braga A, Paiva G, Alevato R, Saldanha P, Elias KM, Horowitz NS, et al. Treatment of high-risk gestational trophoblastic neoplasia. Hematol Oncol Clin North Am. 2024;38:1245–58. 39322460 10.1016/j.hoc.2024.08.014 25. Alifrangis C Agarwal R Short D Fisher RA Sebire NJ Harvey R EMA/co for high-risk gestational trophoblastic neoplasia: good outcomes with induction low-dose etoposide-cisplatin and genetic analysis J Clin Oncol 2013 31 280 286 10.1200/JCO.2012.43.1817 23233709 Alifrangis C, Agarwal R, Short D, Fisher RA, Sebire NJ, Harvey R, et al. EMA/co for high-risk gestational trophoblastic neoplasia: good outcomes with induction low-dose etoposide-cisplatin and genetic analysis. J Clin Oncol. 2013;31:280–6. 23233709 10.1200/JCO.2012.43.1817 26. Spadaccini M Conti Bellocchi MC Mangiavillano B Fantin A Rahal D Manfrin E Secondary tumors of the pancreas: a multicenter analysis of clinicopathological and endosonographic features J Clin Med 2023 10.3390/jcm12082829 37109171 PMC10145689 Spadaccini M, Conti Bellocchi MC, Mangiavillano B, Fantin A, Rahal D, Manfrin E, et al. Secondary tumors of the pancreas: a multicenter analysis of clinicopathological and endosonographic features. J Clin Med. 2023. 10.3390/jcm12082829. 37109171 10.3390/jcm12082829 PMC10145689 27. Sperti C Moletta L Patanè G Metastatic tumors to the pancreas: the role of surgery World J Gastrointest Oncol 2014 6 381 392 10.4251/wjgo.v6.i10.381 25320654 PMC4197429 Sperti C, Moletta L, Patanè G. Metastatic tumors to the pancreas: the role of surgery. World J Gastrointest Oncol. 2014;6:381–92. 25320654 10.4251/wjgo.v6.i10.381 PMC4197429 28. Huang W Qiu Y Zhou Y Yang Q Kang L Primary pancreatic choriocarcinoma with hepatic metastases on 18 f-FDG PET/CT Clin Nucl Med 2023 48 553 556 10.1097/RLU.0000000000004666 37083568 Huang W, Qiu Y, Zhou Y, Yang Q, Kang L. Primary pancreatic choriocarcinoma with hepatic metastases on 18 f-FDG PET/CT. Clin Nucl Med. 2023;48:553–6. 37083568 10.1097/RLU.0000000000004666 29. Ghorani E Kaur B Fisher RA Short D Joneborg U Carlson JW Pembrolizumab is effective for drug-resistant gestational trophoblastic neoplasia Lancet 2017 390 2343 2345 10.1016/S0140-6736(17)32894-5 29185430 Ghorani E, Kaur B, Fisher RA, Short D, Joneborg U, Carlson JW, et al. Pembrolizumab is effective for drug-resistant gestational trophoblastic neoplasia. Lancet. 2017;390:2343–5. 29185430 10.1016/S0140-6736(17)32894-5 30. Baas IO Westermann AM You B Bolze PA Seckl M Ghorani E Immunotherapy for gestational trophoblastic neoplasia: a new paradigm Gynecol Obstet Invest 2024 89 230 238 10.1159/000533972 37703867 PMC11152029 Baas IO, Westermann AM, You B, Bolze PA, Seckl M, Ghorani E. Immunotherapy for gestational trophoblastic neoplasia: a new paradigm. Gynecol Obstet Invest. 2024;89:230–8. 37703867 10.1159/000533972 PMC11152029 31. Braga A Balthar E Souza LCS Samora M Rech M Madi JM Immunotherapy in the treatment of chemoresistant gestational trophoblastic neoplasia - systematic review with a presentation of the first 4 Brazilian cases Clinics (Sao Paulo) 2023 78 100260 10.1016/j.clinsp.2023.100260 37523979 PMC10404605 Braga A, Balthar E, Souza LCS, Samora M, Rech M, Madi JM, et al. Immunotherapy in the treatment of chemoresistant gestational trophoblastic neoplasia - systematic review with a presentation of the first 4 Brazilian cases. Clinics (Sao Paulo). 2023;78:100260. 37523979 10.1016/j.clinsp.2023.100260 PMC10404605 32. You B Bolze PA Lotz JP Massardier J Gladieff L Floquet A Avelumab in patients with gestational trophoblastic tumors with resistance to polychemotherapy: cohort B of the TROPHIMMUN phase 2 trial Gynecol Oncol 2023 168 62 67 10.1016/j.ygyno.2022.11.005 36401942 You B, Bolze PA, Lotz JP, Massardier J, Gladieff L, Floquet A, et al. Avelumab in patients with gestational trophoblastic tumors with resistance to polychemotherapy: cohort B of the TROPHIMMUN phase 2 trial. Gynecol Oncol. 2023;168:62–7. 36401942 10.1016/j.ygyno.2022.11.005 33. Wang X Cang W Liu X Cheng Y Wan X Feng F Anti-PD-1 therapy plus chemotherapy versus anti-PD-1 therapy alone in patients with high-risk chemorefractory or relapsed gestational trophoblastic neoplasia: a multicenter, retrospective study EClinicalMedicine 2023 59 101974 10.1016/j.eclinm.2023.101974 37152364 PMC10154962 Wang X, Cang W, Liu X, Cheng Y, Wan X, Feng F, et al. Anti-PD-1 therapy plus chemotherapy versus anti-PD-1 therapy alone in patients with high-risk chemorefractory or relapsed gestational trophoblastic neoplasia: a multicenter, retrospective study. EClinicalMedicine. 2023;59:101974. 37152364 10.1016/j.eclinm.2023.101974 PMC10154962 34. Wong AJ Finch L Pearson JM Pinto A Huang M Retreatment of chemotherapy-resistant metastatic choriocarcinoma with immunotherapy Gynecol Oncol Rep 2022 40 100955 10.1016/j.gore.2022.100955 35300054 PMC8920859 Wong AJ, Finch L, Pearson JM, Pinto A, Huang M. Retreatment of chemotherapy-resistant metastatic choriocarcinoma with immunotherapy. Gynecol Oncol Rep. 2022;40:100955. 35300054 10.1016/j.gore.2022.100955 PMC8920859 35. Patel SP Othus M Chae YK Dennis MJ Gordon S Mutch D A phase II basket trial of dual anti-CTLA-4 and anti-PD-1 blockade in rare tumors (DART SWOG 1609 cohort 47) in patients with gestational trophoblastic neoplasia Clin Cancer Res 2024 30 33 38 10.1158/1078-0432.CCR-23-2293 37882676 PMC10842092 Patel SP, Othus M, Chae YK, Dennis MJ, Gordon S, Mutch D, et al. A phase II basket trial of dual anti-CTLA-4 and anti-PD-1 blockade in rare tumors (DART SWOG 1609 cohort 47) in patients with gestational trophoblastic neoplasia. Clin Cancer Res. 2024;30:33–8. 37882676 10.1158/1078-0432.CCR-23-2293 PMC10842092 36. Zhang C Zhang C Wang H Immune-checkpoint inhibitor resistance in cancer treatment: current progress and future directions Cancer Lett 2023 562 216182 10.1016/j.canlet.2023.216182 37076040 Zhang C, Zhang C, Wang H. Immune-checkpoint inhibitor resistance in cancer treatment: current progress and future directions. Cancer Lett. 2023;562:216182. 37076040 10.1016/j.canlet.2023.216182 37. Hu-Lieskovan S Malouf GG Jacobs I Chou J Liu L Johnson ML Addressing resistance to immune checkpoint inhibitor therapy: an urgent unmet need Future Oncol 2021 17 1401 1439 10.2217/fon-2020-0967 33475012 Hu-Lieskovan S, Malouf GG, Jacobs I, Chou J, Liu L, Johnson ML. Addressing resistance to immune checkpoint inhibitor therapy: an urgent unmet need. Future Oncol. 2021;17:1401–39. 33475012 10.2217/fon-2020-0967 ",
  "metadata": {
    "Title of this paper": "Addressing resistance to immune checkpoint inhibitor therapy: an urgent unmet need",
    "Journal it was published in:": "Orphanet Journal of Rare Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12462058/"
  }
}