{
  "title": "Paper_1230",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472080 PMC12472080.1 12472080 12472080 41010958 10.3390/medicina61091567 medicina-61-01567 1 Article Cubebin Attenuates Methamphetamine-Induced Neurotoxicity Through CREB/BDNF/Caspase-3 Signaling: In Vivo and In Silico Study https://orcid.org/0000-0002-4988-9838 Alenezi Sattam Khulaif 1 Alharbi Khalid Saad 1 https://orcid.org/0000-0002-3001-867X Alsahli Tariq G. 2 https://orcid.org/0000-0003-2570-3223 Afzal Muhammad 3 4 * ALQahtani Reem 5 https://orcid.org/0000-0002-8452-4789 Alshehri Samiyah 6 https://orcid.org/0000-0003-1881-5219 Kazmi Imran 7 https://orcid.org/0000-0003-0517-4934 Sayyed Nadeem 8 1 sk.alenezi@qu.edu.sa khalid.alharbi9@qu.edu.sa 2 tgalsahli@ju.edu.sa 3 4 5 rgalqahtani@pnu.edu.sa 6 saalshehri@ksu.edu.sa 7 ikazmi@kau.edu.sa 8 snadeem.pharma@gmail.com * mohmmad.afzal@bmc.edu.sa 31 8 2025 9 2025 61 9 497654 1567 23 6 2025 21 8 2025 25 8 2025 31 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives: Material and Methods: Results: Conclusions: apoptosis in silico methamphetamine neurotransmitters neurotoxicity oxidative stress Deanship of Graduate Studies and Scientific Research at Qassim University 2025-QU-APC The researchers would like to thank the Deanship of Graduate Studies and Scientific Research at Qassim University for financial support (2025-QU-APC). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Neurotoxicity arises from the direct or indirect effects of toxic materials that interrupt the functional activity of the nervous system in humans and animals. A wide array of chemicals can induce neurotoxic ailments in humans. In contrast, others serve as experimental models for assessing physiological and pathological function in vivo, in vitro, and in human cell lines. Several chemicals exert their effects directly on neural cells, while others act on metabolic processes that are crucial for the function of the nervous system [ 1 2 Methamphetamine (METH) is known to be one of the most common psychostimulant substances, and its abuse poses a significant challenge to the public health sector. Chronic use of METH is associated with different severe neuropsychiatric conditions such as agitation, anxiety, hallucinations, paranoia, and psychosis. Further, several neuropsychiatric deficits belonging to attention, memory, and executive function are characteristic of METH [ 3 The neurotoxic effects of METH play a part in these negative outcomes. They also suggest that the drug causes excessive levels of neurotransmitter release through the depletion of synaptic vesicles, blocking the reuptake of neurotransmitters, and suppression of the transporter proteins. The consequent oxidative stress implication with augmented reactive oxygen species (ROS) has been described as central to METH-induced neurotoxicity. Based on these effects, microglial activation and consequent neuroinflammation aggravate these impacts [ 3 4 To address the neurotoxic effects of METH, researchers have investigated various pharmacological strategies in both preclinical and clinical settings. Current clinical interventions prioritize early treatment to reduce the severity of neurological complications. However, plant-derived phytochemicals have the potential to be preventative agents for neurotoxicity. Each herb contains a diverse array of phytochemicals, with only a select few exhibiting demonstrably neuroprotective effects [ 5 6 Aristolochiaceae Myristicaceae Piperaceae Rutaceae 7 8 9 10 11 This study aimed to evaluate the neuroprotective effects of cubebin in rats with METH-evoked neurotoxicity, followed by cognitive impairments and hippocampal damage, focusing on its ability to inhibit lipid peroxidation and reduce pro-inflammatory markers. 2. Methodology 2.1. Animals During the experiment, Wistar rats (weighing 180 ± 20 g and aged 10–12 weeks) were acquired and given appropriate care, including feeding, housing, and enrichment. The rats were housed under a controlled environment with a 12 h light–dark cycle, a temperature of 24 ± 3 °C, and humidity controlled at 50% to 60%. They were fed well and had free access to water. After their acquisition, the rats were acclimated for 7 days. This experiment was carried out with approval from the Institutional Animal Ethics Committee, adhering to ARRIVE guidelines. The research protocol was approved by the institutional research board of Batterjee Medical College, Jeddah, Saudi Arabia, with approval number (RES-2024-0084). 2.2. Drugs and Chemicals METH and cubebin (>98.0% purity) ( Figure 1 2.3. Acute Toxicity Studies and Prediction of ADMET by Computational Analysis In accordance with OECD guideline 423, the acute oral toxicity of cubebin was assessed in Wistar rats. Administration of cubebin at doses of 10 and 20 mg/kg by oral gavage did not elicit any signs of toxicity or mortality, thereby indicating a favorable safety margin at these dose levels [ 12 2.4. Experimental Design The design of the experimental study is demonstrated in Figure 1 n The animals were subjected to behavioral evaluation utilizing the Morris water maze (MWM) and Y-maze tests on the 14th day. Group I (Control) received DMSO via the intraperitoneal (i.p.) route. Group II (Disease Control) was given METH (100 mg/kg/BW) via the i.p. route. Group III (Disease Treatment) received cubebin (10 mg/kg) orally, while group IV (Disease Treatment) received cubebin (20 mg/kg) orally, and group V (Per Os) received cubebin (20 mg/kg) orally only [ 13 2.5. Behavioral Studies MWM Test Long-term memory and spatial learning were evaluated using the Morris water maze (MWM) test, as described by Aksoz et al. [ 14 On the fifth day, a probe trial was conducted to assess memory consolidation. The platform was removed, and each animal was allowed to swim freely for 60 s. The time spent in the target quadrant, where the platform had been previously located, was recorded as an index of spatial memory retention. 2.6. Biochemical Estimations 2.6.1. Brain Tissue Preparation Separated from the extracted brain tissue, the brain was cleaned with 0.9% ( w v For the biochemical estimation, the hippocampus was separated from the extracted brain tissue, cleaned with 0.9% ( w v 2.6.2. Neurotransmitter Levels The concentrations of neurotransmitters, including NE, DA, and GABA, within brain tissue homogenates were quantified through high-performance liquid chromatography (HPLC) equipped with an Agilent 1100 (Agilent Technologies, Waldbronn, Germany) variable wavelength detector (VWD). ChemStation software (Rev. B.04.03) was utilized for control and subsequently for data analysis. 2.7. Antioxidant Enzymes 2.7.1. Superoxide Dismutase (SOD) A photochemical method utilizing nitroblue tetrazolium (NBT) was employed to assess SOD activity. Each reaction mixture, with a total volume of 1.5 mL, consisted of 100 mM Tris/HCl buffer (pH 7.8), 75 mM NBT, 2 µM riboflavin, and 6 mM EDTA. Following the incorporation of 1.5 mL of the sample supernatant into this mixture, the reaction proceeded through the photochemical generation of superoxide radicals, leading to the reduction of NBT to formazan and subsequent alteration in absorbance. The variation in absorbance change was quantified at 560 nm and represented in units per milligram (U/mg) of protein. 2.7.2. Reduced Glutathione (GSH) Brain tissue was taken and homogenized in 0.1 M phosphate buffer (pH 7.4) for the determination of GSH levels. The homogenates were then subjected to protein precipitation in a mixture of 20% trichloroacetic acid (TCA) containing 1 mM EDTA solution. Following centrifugation, 200 µL of liquid supernatant was added to newly labeled test tubes. DTNB solution (0.1 mM) known as Ellman’s reagent, was made up of 0.3 M phosphate buffer containing 1% sodium citrate and added at a volume of 1.8 mL. The final volume of each test tube was adjusted to 2 mL with additional buffer. All the samples were then quantified at 412 nm against the blank as previously used in the absorbance experiment. GSH concentration was calculated per milligram of protein (U/mg). 2.7.3. Catalase (CAT) To estimate CAT activity, the reaction mixture was prepared by combining 100 µL of the supernatant with 150 µL of 0.01 M phosphate buffer at pH 7.0. To start the reaction, 250 µL of 0.16M H 2 2 2.8. Oxidative Stress Markers 2.8.1. Malondialdehyde (MDA) In order to determine the primary indicator of oxidative stress, MDA, we filled each test tube with 500 mL of the diluted homogenate and also prepared a control tube containing 500 mL of Tris-HCl buffer (50 mM, pH 7.4). We added 250 mL of 20% trichloroacetic acid (TCA) and 500 µL of 0.67% thiobarbituric acid (TBA) to each tube. We sealed the tubes using glass beads and placed them in a water bath at 90 °C for 10 min. Once the tubes had cooled to room temperature, they were spun in a centrifuge at a speed of 3000 rpm for 15 min. The sample’s absorbance was determined at 535 nm using the spectrophotometer, and the result was represented in µmol/L. 2.8.2. Nitric Oxide (NO) The NO production was assessed based on the nitrite concentration, which was quantified utilizing a colorimetric Griess reagent. Griess reagent was made up by incorporating an equal amount of 1% sulfanilamide in 5% phosphoric acid and 0.1% N-(1-naphthyl) ethylenediamine dihydrochloride (NEDD) in water. A 96-well plate was filled with 100 µL of the plasma sample, and subsequently, 100 µL of Griess reagent was incorporated. Subsequently, the plate was incubated at 37 °C for 10 min. Following incubation, the optical density of the microplate was quantified at a wavelength of 540 nm using a spectrophotometer. 2.9. Neuroinflammatory Cytokines The levels of various neuroinflammatory cytokines such as IL-1β, IL-6, TNF-α, NF-kB, cAMP response element-binding protein (CREB), and brain-derived neurotrophic factor (BDNF) were quantified by using commercially available standard ELISA kits. The concentration of these inflammatory cytokines was assessed and expressed in picograms per milliliter (pg/mL) units. 2.10. Apoptotic Markers Caspase-3 and caspase-9, critical mediators of the apoptotic pathway, were quantified using commercially available enzyme-linked immunosorbent assay (ELISA) kits (Merilyzer Eiaquant, Meril Life Sciences Pvt. Ltd., Gujarat, India). These microwell-based assays utilize pre-coated antibodies specific to the target proteins, and the concentrations were expressed in ng/mL. 2.11. Molecular Docking (MD) 2.11.1. Target Protein Retrieval and Preparation X-ray crystallographic structures of the proteins CREB (PDB ID: 4NYX) [ 15 16 17 18 Table 1 Protein structures were optimized and minimized using UCSF Chimera v1.16. [ 19 2.11.2. Grid Generation AutoDock Tools 1.5.6, Chimera 1.11, and Maestro Version 12.7.161 were utilized to generate and validate the grid [ 20 21 Table 2 Table 3 2.11.3. Ligand Preparation The ligand molecule was sourced from the ChemSpider3 database and imported into the MarvinSketch4 software for structural optimization. The molecule was subjected to 2D and 3D structural cleaning to remove any inconsistencies or errors. Subsequently, the cleaned structure was minimized using the MMFF94 force field to obtain a minimum energy conformation. This optimized structure, in MOL2 format, was selected for subsequent computational analysis. 2.11.4. MD of the Target Protein with Ligands Ligands and proteins were optimized and subsequently converted to PDBQT format through in-house Bash scripts leveraging AutoDock Tools 1.5.6 and ADFRsuite, respectively. The ligands were fully flexible, while the receptors were held rigid. Docking simulations were conducted using AutoDock Vina 1.2.5, employing a grid spacing of 0.375 Å. The grid box was centered on the target’s active site, allowing for the exploration of potential binding sites. Default configurations were maintained for other parameters. The XYZ coordinates, as detailed in Table 3 2.11.5. Visualization All results retrieved from the AutoDock Vina Processing run were analyzed in Biovia Discovery Studio Visualizer (Discovery Studio Visualizer v21.1.0.20298) and Maestro 12.3 (academic edition) for 2D and 3D interactions. 2.12. Molecular Dynamics Simulation (MDS) MDS was carried out on protein–ligand complexes (1B8M, 1NME, and 4NYX) with cubebin derivatives (Cubebin_1B8M, Cubebin_1NME, and Cubebin_4NYX) using the Desmond 2020.1 simulation package. The OPLS-2005 force field was employed in a 10 Å × 10 Å × 10 Å period boundary solvation box [ 22 23 24 + 25 The system was initially equilibrated under NVT conditions for 10 ns, followed by NPT equilibration and minimization for 12 ns. Production runs were carried out for 100 ns under NPT conditions [ 26 27 28 To evaluate the simulation’s stability, several structural parameters such as the root mean square deviation (RMSD), root mean square fluctuation (RMSF), the radius of gyration (Rg), the number of hydrogen bonds, salt bridges, and the solvent-accessible surface area (SASA) were calculated [ 29 30 2.13. Binding Free Energy ( ∆ G b i n d The ∆ G b i n d ∆ G b i n d The following formula was used to determine ΔG bind ∆ G b i n d = Δ G M M + Δ G S o l v − Δ G S A - ΔG MM - ΔG Solv - ΔG SA 2.14. Statistical Analysis Statistical analyses were performed utilizing GraphPad Prism 9 (GraphPad Software Inc., La Jolla, CA, USA) and demonstrated as mean ± S.E.M. The Shapiro–Wilk test was carried out to determine the normality of the data. For the MWM test, a two-way analysis of variance (ANOVA) test showed significance at p p 3. Results 3.1. Acute Toxicity Assessment Cubebin demonstrated a favorable safety profile in acute oral toxicity assessments conducted in rats. Throughout the 14-day observation period, no signs of illness or observable clinical symptoms were detected. The selection of 10 and 20 mg/kg doses of cubebin for the current study was guided by the findings of this acute toxicity evaluation. The ADMET properties of cubebin are summarized in Table 4 3.2. MWM Test Figure 2 p p Supplementary Table S1 3.3. Biochemical Estimations Neurotransmitter Levels Figure 3 p p p Supplementary Table S2 3.4. Antioxidant Enzymes To assess the possible antioxidant effect of cubebin on METH-induced neurotoxicity in rats, the contents of SOD, CAT, and GSH were measured. As shown in Figure 4 p p p Supplementary Table S3 3.5. Oxidative Stress Markers The effect of cubebin on MDA and NO as indices of oxidative stress is presented in Figure 5 p p Supplementary Table S4 3.6. Neuroinflammatory Cytokines The effect of cubebin on the indices of different neuroinflammatory cytokines is shown in Figure 6 p p p p p p Supplementary Table S5 3.7. Apoptotic Markers The effect of cubebin on the caspase indices, used as apoptotic markers, is shown in Figure 7 p p Supplementary Table S6 3.8. MD Cubebin exhibited strong binding affinities with the selected targets, particularly CREB, BDNF, and caspase-3, with the highest affinity observed for BDNF (−9.173), followed by CREB (−8.881) and caspase-3 (−7.322). Ramachandran plots for 4NYX, 1B8M, and 1NME, generated using the PROCHECK server, are presented in Figure 8 Figure 9 Table 5 Table 6 3.9. MDS MDS was utilized to investigate the stability and convergence of 1B8M, 1NME, and 4NYX in complex with cubebin (denoted as Cubebin_1B8M, Cubebin_1NME, and Cubebin_4NYX, respectively). RMSD analysis, depicted in Figure 10 Figure 11 The Cubebin_4NYX complex exhibited an average RMSF of 0.98 Å, indicating a relatively rigid structure. Nevertheless, distinct peaks in the RMSF profile, particularly around residues 36–37, with a maximum of 3.47 Å, suggest localized flexibility. Overall, the Cubebin_4NYX complex exhibited the highest degree of structural stability compared to the other two complexes. The radius of gyration (Rg) analysis for the Cubebin_1B8M, Cubebin_1NME, and Cubebin_4NYX complexes is depicted in Figure 12 Figure 13 Figure 14 Protein–ligand interactions within the complexes were investigated through 100 ns molecular dynamics simulations. Interaction types, including hydrogen bonds, hydrophobic interactions, ionic interactions, and water bridges, were categorized and normalized over the simulation trajectories. For each interaction type, the series of contacts between the protein and ligand was quantified, with values ≥ 1 indicating multiple contacts. Figure 15 Figure 16 Figure 16 Figure 16 3.10. Calculations of MM-GBSA Leveraging MDS, we determined the ΔGbind and constituent energy components for the cubebin–protein complexes (Cubebin_1B8M, Cubebin_1NME, Cubebin_4NYX) using the MM-GBSA approach. Table 7 4. Discussion This study aimed to assess the neuroprotective effect of cubebin against METH-evoked neurotoxicity in rats. METH, which belongs to the psychostimulant group, is widely recognized as having neurotoxic effects. Even though the detailed pathways by which METH causes neurotoxic effects have not been debated, it is widely postulated that oxidative stress, inflammation, and apoptosis have significant roles to play [ 31 32 33 34 p p 35 Neurotoxicity also arises from alterations in neurotransmitter systems, including abnormal release, modified concentration or residence time, or interference with postsynaptic receptor function as an agonist or antagonist. Neurotransmitters are endogenous signaling molecules that modulate and propagate cellular communication, critically impacting brain function, behavior, and cognition [ 2 36 37 GABA acts as the primary inhibitory neurotransmitter within the central nervous system. Its synthesis from glutamate is catalyzed by a specialized enzyme exclusively expressed in GABAergic neurons. GABAergic signaling serves a crucial role in the regulation and synchronization of neuronal activity within the hippocampus, a brain region crucial for memory formation and function. This region is particularly vulnerable to early structural and functional impairments associated with neurological disorders [ 38 39 p p p 40 The failure to maintain a balanced antioxidant/oxidant ratio implies that the concentration of ROS is higher than the capacity of the antioxidant systems to scavenge them in the brain. ROS, a class of molecules including free radicals and non-radical oxygen derivatives, are naturally generated by metabolic processes. Excessive ROS production or lowered antioxidant defenses disrupt the redox balance within cells, leading to oxidative stress. The brain’s unique characteristics, such as more consumption of oxygen, plenty of polyunsaturated fatty acids, and limited antioxidant reserves, make it particularly susceptible to oxidative stress. Increased ROS production is directly linked to cellular damage observed in aging and various neurological diseases [ 32 41 42 31 43 p p p p 13 44 The restoration of antioxidant capacity is essential for preserving neuronal health and function. Oxidative stress, indicated by elevated levels of MDA, is a key contributor to neuronal damage and dysfunction [ 45 p 46 36 p 47 Neuroinflammation is triggered by METH exposure through the upregulation of pro-inflammatory cytokine production. Astrocytes are the primary brain cells that serve an essential role in regulating both pro- and anti-inflammatory cytokines. Elevated levels of inflammatory markers from astrocytes are associated with various CNS disorders. Reactive astrogliosis, characterized by morphological and functional changes, is a hallmark of neurological conditions like stroke, trauma, and neurodegenerative diseases. Reactive astrocytes contribute significantly to inflammation by producing pro-inflammatory cytokines and chemokines [ 31 48 48 p p p p 13 49 Several hippocampal proteins, including BDNF and CREB, play important roles in both neurogenesis and neurodegeneration. This study investigates the interplay of these proteins in these processes. BDNF is a neurotrophic factor responsible for promoting neuronal growth, differentiation, and maturation. It is closely linked to learning and memory processes in rodents, particularly through its regulation of synaptogenesis and synaptic plasticity in the adult CNS [ 50 51 51 52 p p Apoptosis, known as programmed cell death, occurs due to the activation of many signal transduction pathways that post-translationally modify the cellular macromolecules such as lipids, proteins, and nucleic acids. A characteristic feature of apoptosis is the alteration of the cell membrane and, consequently, the permeability of the cell membrane. Studies demonstrated that cell death by apoptosis may play a role in drug-mediated neurotoxicity, including neurotoxicity mediated by METH and other psychotropic agents [ 53 p p Cubebin was shown to exhibit potent binding affinities toward several proteins related to neurodegenerative diseases. However, the highest degree of preference was established with BDNF (−9.173), followed by CREB (−8.881) and caspase-3 (−7.322). Based on these results, it can be proposed that cubebin may affect the action of these proteins and could, therefore, be useful in the treatment of neurodegenerative diseases. Ramachandran plots were generated by using the PROCHECK server to analyze the structural compatibility of the protein–ligand complexes. By analyzing these plots, it was found that 4NYX, 1B8M, and 1NME showed favorable conformational thermodynamics, which reflects the structural stability of the structures. In addition, various 2D and 3D visuals of the protein–ligand interactions revealed insightful contributions of molecular interactions in the case of cubebin’s binding affinities. The orientation of 4NYX and cubebin specified the important amino acid residues for the formation of hydrogen bonds, hydrophobic interactions, and other non-covalent associations. Binding free energies and energy components involving cubebin complexes with 1B8M, 1NME, and 4NYX were determined by MM-GBSA from MD simulations. The result proved that Cubebin_1B8M possesses the highest binding energy (−75.50 ± 5.29 kcal/mol) due to the favorable electrostatic, lipophilic, and VDW interaction energies. Cubebin_1NME bound with moderate energy (−43.76  ±  5.10 kcal/mol), whereby electrostatic and lipophilic interactions were considered to be weaker. Cubebin_4NYX had the lowest binding energy (−38.81 ± 4.71 kcal/mol) because all the energy components had less favorable, lower-energy interactions. Thus, the major forces that contributed to binding included electrostatic and van der Waals forces for all complexes, although lipophilic and covalent interactions differed. While there may have been slightly favorable packing interactions, the effects were minimal on binding energies, and there was a positive solvation energy, indicating that desolvation might be playing an important part in the binding process. These findings are consistent with previous docking studies involving natural compounds targeting neurodegenerative and apoptotic pathways, where similar forces were shown to drive molecular interactions. For instance, coumarin derivatives and polyphenols have demonstrated high affinity for caspase-3 via similar electrostatic and hydrophobic interactions [ 54 55 56 The study faced several constraints, including limited testing animals, a limited timeframe, and complex molecular techniques. The techniques included immunohistochemistry, Western blotting, RT-PCR, and tissue immunohistochemistry. The study was also constrained by the scope of gene protein expression analyses and other genetic modeling approaches. Additionally, in vitro rescue assays, which could have provided further insights into the mechanistic actions and potential cytotoxicity of cubebin at the tested concentrations, were not performed. However, these results support the beneficial effects of cubebin on neurodegenerative diseases for possible therapeutic use. More experimental evidence should be obtained to fully understand the molecular basis of cubebin’s neuroprotective effects and to evaluate its prospects as an effective therapeutic agent. 5. Conclusions This study highlights the promising neuroprotective potential of cubebin against METH-induced cognitive impairments. By alleviating oxidative stress and inflammation and promoting dopamine levels, cubebin effectively mitigated METH-driven learning deficits. These findings suggest that cubebin could serve as a novel therapeutic candidate for managing METH-related neurotoxicity. Additionally, computational docking studies revealed strong binding affinities of cubebin with key proteins involved in neurodegeneration, including BDNF, CREB, and caspase-3. The observed molecular interactions, as illustrated in both 2D and 3D models, point toward cubebin’s potential role in modulating these targets. Further research is warranted to explore the precise mechanisms underlying cubebin’s neuroprotective effects and to evaluate its efficacy in clinical settings. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/medicina61091567/s1 Author Contributions Conceptualization, M.A. and N.S.; methodology, M.A.; formal analysis, N.S.; writing—original draft preparation, M.A.; writing—review and editing, S.K.A., K.S.A., T.G.A., M.A., R.A., S.A., I.K., and N.S.; funding acquisition, S.K.A., K.S.A. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was approved by the Institutional Review Board of Batterjee Medical College, Jeddah, Saudi Arabia, RES-2024-0084 (date of approval 24 February 2025). Informed Consent Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. References 1. Bressler J.P. Goldstein G.W. Mechanisms of lead neurotoxicity Biochem. Pharmacol. 1991 41 479 484 10.1016/0006-2952(91)90617-E 1671748 2. Spencer P.S. Lein P.J. Neurotoxicity Academic Press Cambridge, MA, USA 2024 3. Jayanthi S. Daiwile A.P. Cadet J.L. Neurotoxicity of methamphetamine: Main effects and mechanisms Exp. Neurol. 2021 344 113795 10.1016/j.expneurol.2021.113795 34186102 PMC8338805 4. Edinoff A.N. Kaufman S.E. Green K.M. Provenzano D.A. Lawson J. Cornett E.M. Murnane K.S. Kaye A.M. Kaye A.D. Methamphetamine use: A narrative review of adverse effects and related toxicities Health Psychol. Res. 2022 10 38161 10.52965/001c.38161 36118981 PMC9476235 5. Behl T. Gupta A. Albratty M. Najmi A. Meraya A.M. Alhazmi H.A. Anwer M.K. Bhatia S. Bungau S.G. Alkaloidal phytoconstituents for diabetes management: Exploring the unrevealed potential Molecules 2022 27 5851 10.3390/molecules27185851 36144587 PMC9501853 6. Kumari S. Kamboj A. Wanjari M. Sharma A.K. Nephroprotective effect of Vanillic acid in STZ-induced diabetic rats J. Diabetes Metab. Disord. 2021 20 571 582 10.1007/s40200-021-00782-7 34222078 PMC8212202 7. Borges A. de Oliveira I.P. Lescano C.H. Parreira R.L.T. Orenha R.P. da Silva de Laurentiz R. Molecular interaction analysis of the lignans from Piper cubeba in complex with Haemonchus contortus phosphomethyltransferase Vet. Parasitol. 2023 321 110001 10.1016/j.vetpar.2023.110001 37549491 8. de Souza V.A. da Silva R. Pereira A.C. Royo V.d.A. Saraiva J. Montanheiro M. de Souza G.H. da Silva Filho A.A. Grando M.D. Donate P.M. Trypanocidal activity of (−)-cubebin derivatives against free amastigote forms of Trypanosoma cruzi Bioorg. Med. Chem. Lett. 2005 15 303 307 10.1016/j.bmcl.2004.10.079 15603944 9. Silva M.L.A. Martins C.H. Lucarini R. Sato D.N. Pavan F.R. Freitas N.H. Andrade L.N. Pereira A.C. Bianco T.N. Vinholis A.H. Antimycobacterial activity of natural and semi-synthetic lignans Z. Naturforschung C 2009 64 779 784 10.1515/znc-2009-11-1204 20158145 10. Souza G.H.B.d. da Silva Filho A. De Souza V. Pereira A.C. Royo V.d.A. e Silva M. Da Silva R. Donate P.M. Carvalho J.C. Bastos J.K. Analgesic and anti-inflammatory activities evaluation of (-)-O-acetyl,(-)-O-methyl,(-)-O-dimethylethylamine cubebin and their preparation from (-)-cubebin Il Farm. 2004 59 55 61 10.1016/j.farmac.2003.07.012 14751317 11. Carvalho M.T.M. Rezende K.C.S. Evora P.R.B. Bastos J.K. Cunha W.R. Andrade e Silva M.L. Celotto A.C. The Lignan (-)-Cubebin Inhibits Vascular Contraction and Induces Relaxation Via Nitric Oxide Activation in Isolated Rat Aorta Phytother. Res. 2013 27 1784 1789 10.1002/ptr.4932 23401173 12. Pires D.E. Blundell T.L. Ascher D.B. pkCSM: Predicting small-molecule pharmacokinetic and toxicity properties using graph-based signatures J. Med. Chem. 2015 58 4066 4072 10.1021/acs.jmedchem.5b00104 25860834 PMC4434528 13. Syed R.U. Moni S.S. Hussein W. Alhaidan T.M.S. Abumilha S.M.Y. Alnahdi L.K. Wong L.S. Subramaniyan V. Kumarasamy V. Effect of cubebin against streptozotocin-induced diabetic nephropathy rats via inhibition TNF-α/NF-κB/TGF-β: In vivo and in silico study Sci. Rep. 2025 15 4369 10.1038/s41598-025-87319-7 39910087 PMC11799316 14. Aksoz E. Gocmez S.S. Sahin T.D. Aksit D. Aksit H. Utkan T. The protective effect of metformin in scopolamine-induced learning and memory impairment in rats Pharmacol. Rep. 2019 71 818 825 10.1016/j.pharep.2019.04.015 31382167 15. Rattanaburee T. Tipmanee V. Tedasen A. Thongpanchang T. Graidist P. Inhibition of CSF1R and AKT by (±)-kusunokinin hinders breast cancer cell proliferation Biomed. Pharmacother. 2020 129 110361 10.1016/j.biopha.2020.110361 32535390 16. Robinson R.C. Radziejewski C. Spraggon G. Greenwald J. Kostura M.R. Burtnick L.D. Stuart D.I. Choe S. Jones E.Y. The structures of the neurotrophin 4 homodimer and the brain-derived neurotrophic factor/neurotrophin 4 heterodimer reveal a common Trk-binding site Protein Sci. 1999 8 2589 2597 10.1110/ps.8.12.2589 10631974 PMC2144242 17. Erlanson D.A. Lam J.W. Wiesmann C. Luong T.N. Simmons R.L. DeLano W.L. Choong I.C. Burdett M.T. Flanagan W.M. Lee D. In situ assembly of enzyme inhibitors using extended tethering Nat. Biotechnol. 2003 21 308 314 10.1038/nbt786 12563278 18. Berman H.M. Westbrook J. Feng Z. Gilliland G. Bhat T.N. Weissig H. Shindyalov I.N. Bourne P.E. The protein data bank Nucleic Acids Res. 2000 28 235 242 10.1093/nar/28.1.235 10592235 PMC102472 19. Pettersen E.F. Goddard T.D. Huang C.C. Couch G.S. Greenblatt D.M. Meng E.C. Ferrin T.E. UCSF Chimera—A visualization system for exploratory research and analysis J. Comput. Chem. 2004 25 1605 1612 10.1002/jcc.20084 15264254 20. Morris G.M. Huey R. Lindstrom W. Sanner M.F. Belew R.K. Goodsell D.S. Olson A.J. AutoDock4 and AutoDockTools4: Automated docking with selective receptor flexibility J. Comput. Chem. 2009 30 2785 2791 10.1002/jcc.21256 19399780 PMC2760638 21. Schrödinger L. Schrödinger Release 2022-3: LigPrep Schrödinger, Inc. New York, NY, USA 2021 22. Bowers K.J. Chow E. Xu H. Dror R.O. Eastwood M.P. Gregersen B.A. Klepeis J.L. Kolossvary I. Moraes M.A. Sacerdoti F.D. Scalable algorithms for molecular dynamics simulations on commodity clusters Proceedings of the 2006 ACM/IEEE Conference on Supercomputing Tampa, FL, USA 11–17 November 2006 84-es 23. Chow E. Rendleman C.A. Bowers K.J. Dror R.O. Hughes D.H. Gullingsrud J. Sacerdoti F.D. Shaw D.E. Desmond performance on a cluster of multicore processors Simulation 2008 1 1 14 24. Shivakumar D. Williams J. Wu Y. Damm W. Shelley J. Sherman W. Prediction of absolute solvation free energies using molecular dynamics free energy perturbation and the OPLS force field J. Chem. Theory Comput. 2010 6 1509 1519 10.1021/ct900587b 26615687 25. Jorgensen W.L. Chandrasekhar J. Madura J.D. Impey R.W. Klein M.L. Comparison of simple potential functions for simulating liquid water J. Chem. Phys. 1983 79 926 935 10.1063/1.445869 26. Martyna G.J. Tobias D.J. Klein M.L. Constant pressure molecular dynamics algorithms J. Chem. Phys. 1994 101 4177 4189 10.1063/1.467468 27. Martyna G.J. Klein M.L. Tuckerman M. Nosé–Hoover chains: The canonical ensemble via continuous dynamics J. Chem. Phys. 1992 97 2635 2643 10.1063/1.463940 28. Toukmaji A.Y. Board Jr J.A. Ewald summation techniques in perspective: A survey Comput. Phys. Commun. 1996 95 73 92 10.1016/0010-4655(96)00016-1 29. Kagami L.P. das Neves G.M. Timmers L.F.S.M. Caceres R.A. Eifler-Lima V.L. Geo-Measures: A PyMOL plugin for protein structure ensembles analysis Comput. Biol. Chem. 2020 87 107322 10.1016/j.compbiolchem.2020.107322 32604028 30. Bosshard H.R. Marti D.N. Jelesarov I. Protein stabilization by salt bridges: Concepts, experimental approaches and clarification of some misunderstandings J. Mol. Recognit. 2004 17 1 16 10.1002/jmr.657 14872533 31. Shafahi M. Vaezi G. Shajiee H. Sharafi S. Khaksari M. Crocin inhibits apoptosis and astrogliosis of hippocampus neurons against methamphetamine neurotoxicity via antioxidant and anti-inflammatory mechanisms Neurochem. Res. 2018 43 2252 2259 10.1007/s11064-018-2644-2 30259275 32. Yang X. Wang Y. Li Q. Zhong Y. Chen L. Du Y. He J. Liao L. Xiong K. Yi C.-x. The main molecular mechanisms underlying methamphetamine-induced neurotoxicity and implications for pharmacological treatment Front. Mol. Neurosci. 2018 11 186 10.3389/fnmol.2018.00186 29915529 PMC5994595 33. Chernyuk D. Bol’shakova A. Vlasova O. Bezprozvanny I. Possibilities and prospects of the behavioral test “morris water maze” J. Evol. Biochem. Physiol. 2021 57 289 303 10.1134/S0022093021020113 34. Mizoguchi H. Yamada K. Methamphetamine use causes cognitive impairment and altered decision-making Neurochem. Int. 2019 124 106 113 10.1016/j.neuint.2018.12.019 30611760 35. Somani G.S. Nahire M.S. Parikh A.D. Mulik M.B. Ghumatkar P.J. Laddha K.S. Sathaye S. Neuroprotective effect of Cubebin: A dibenzylbutyrolactone lignan on scopolamine-induced amnesia in mice Indian J. Med. Res. 2017 146 255 259 10.4103/ijmr.IJMR_156_14 29265027 PMC5761036 36. Shrestha P. Katila N. Lee S. Seo J.H. Jeong J.-H. Yook S. Methamphetamine induced neurotoxic diseases, molecular mechanism, and current treatment strategies Biomed. Pharmacother. 2022 154 113591 10.1016/j.biopha.2022.113591 36007276 37. Omidvari S. Azimzadeh Z. Rashnoo F. Tahmasebinia F. Keramatinia A. Roozbahany N.A. Abbaszadeh H.A. Darabi S. Molecular mechanisms and treatment strategies for methamphetamine-induced neurodegeneration, inflammation and neurotoxicity Acta Neurobiol. Exp. 2023 83 414 431 10.55782/ane-2023-2488 38224280 38. Jiménez-Balado J. Eich T.S. GABAergic dysfunction, neural network hyperactivity and memory impairments in human aging and Alzheimer’s disease Seminars in Cell & Developmental Biology Academic Press Cambridge, MA, USA 2021 146 159 10.1016/j.semcdb.2021.01.005 PMC8292162 33573856 39. Čechová B. Šlamberová R. Methamphetamine, neurotransmitters and neurodevelopment Physiol. Res. 2021 70 S301 10.33549/physiolres.934821 35099249 PMC8884400 40. Wan M. Wang W. He M. Yang S. Feng Y. Luo Y. Cubebin alleviates chronic stress-induced depression-like behavior in mice by regulating the gut microbiome Eur. J. Pharmacol. 2025 994 177384 10.1016/j.ejphar.2025.177384 39956262 41. Graves S.M. Schwarzschild S.E. Tai R.A. Chen Y. Surmeier D.J. Mitochondrial oxidant stress mediates methamphetamine neurotoxicity in substantia nigra dopaminergic neurons Neurobiol. Dis. 2021 156 105409 10.1016/j.nbd.2021.105409 34082123 PMC8686177 42. Garza-Lombó C. Posadas Y. Quintanar L. Gonsebatt M.E. Franco R. Neurotoxicity linked to dysfunctional metal ion homeostasis and xenobiotic metal exposure: Redox signaling and oxidative stress Antioxid. Redox Signal. 2018 28 1669 1703 10.1089/ars.2017.7272 29402131 PMC5962337 43. Nandi A. Yan L.-J. Jana C.K. Das N. Role of catalase in oxidative stress-and age-associated degenerative diseases Oxidative Med. Cell. Longev. 2019 2019 9613090 10.1155/2019/9613090 PMC6885225 31827713 44. Tarbiat S. Unver D. Tuncay S. Isik S. Yeman K.B. Mohseni A.R. Neuroprotective effects of Cubebin and Hinokinin lignan fractions of Piper cubeba fruit in Alzheimer’s disease in vitro model Turk. J. Biochem. 2023 48 303 310 10.1515/tjb-2023-0032 45. Olufunmilayo E.O. Gerke-Duncan M.B. Holsinger R.D. Oxidative stress and antioxidants in neurodegenerative disorders Antioxidants 2023 12 517 10.3390/antiox12020517 36830075 PMC9952099 46. Li Z. Li J. Li Z. Zhang H. Yang S. Ouyang H. He M. Feng Y. Protective activity of cubebin from Syringa oblata against CCl4-induced hepatic damage in mice Rev. Bras. Farm. 2021 31 322 329 10.1007/s43450-021-00171-4 47. Lee C. Jang J.-H. Park G.H. α-Pinene Attenuates Methamphetamine-Induced Conditioned Place Preference in C57BL/6 Mice Biomol. Ther. 2023 31 411 416 10.4062/biomolther.2022.132 PMC10315344 36733209 48. Shi S. Chen T. Zhao M. The crosstalk between neurons and glia in methamphetamine-induced neuroinflammation Neurochem. Res. 2022 47 872 884 10.1007/s11064-021-03513-9 34982394 49. Bastos J.K. Carvalho J.C. de Souza G.H. Pedrazzi A.H. Sarti S.J. Anti-inflammatory activity of cubebin, a lignan from the leaves of Zanthoxyllum naranjillo Griseb J. Ethnopharmacol. 2001 75 279 282 10.1016/S0378-8741(01)00171-4 11297863 50. Namgyal D. Ali S. Mehta R. Sarwat M. The neuroprotective effect of curcumin against Cd-induced neurotoxicity and hippocampal neurogenesis promotion through CREB-BDNF signaling pathway Toxicology 2020 442 152542 10.1016/j.tox.2020.152542 32735850 51. El-Sheref E.M. Aly A.A. Alshammari M.B. Brown A.B. Abdel-Hafez S.M.N. Abdelzaher W.Y. Bräse S. Abdelhafez E.M.N. Design, Synthesis, Molecular Docking, Antiapoptotic and Caspase-3 Inhibition of New 1,2,3-Triazole/Bis-2(1H)-Quinolinone Hybrids Molecules 2020 25 5057 10.3390/molecules25215057 33143331 PMC7672604 52. Li Y.-Z. Wu Z.-Y. Zhu B.-Q. Wang Y.-X. Kan Y.-Q. Zeng H.-C. The BDNF–TrkB–CREB signalling pathway Is involved in bisphenol S-induced neurotoxicity in male mice by regulating methylation Toxics 2022 10 413 10.3390/toxics10080413 35893846 PMC9331819 53. Foroughi K. Jahanbani S. Khaksari M. Shayannia A. Obestatin attenuated methamphetamine-induced PC12 cells neurotoxicity via inhibiting autophagy and apoptosis Hum. Exp. Toxicol. 2020 39 301 310 10.1177/0960327119886036 31726888 54. Ashwini S. Varkey S. Shantaram M. In Silico docking of polyphenolic compounds against Caspase 3-HeLa cell line protein Int. J. Drug. Dev. Res. 2017 9 28 32 55. Kirubhanand C. Selvaraj J. Rekha U.V. Vishnupriya V. Nalini D. Mohan S.K. Vijayalakshmi P. Rajalakshmi M. Ponnulakshmi R. Molecular docking data of piperine with Bax, Caspase 3, Cox 2 and Caspase 9 Bioinformation 2020 16 458 461 10.6026/97320630016458 32884209 PMC7452745 56. Lin T.H. Chang K.H. Chiu Y.J. Weng Z.K. Sun Y.C. Lin W. Lee-Chen G.J. Chen C.M. Neuroprotective Action of Coumarin Derivatives through Activation of TRKB-CREB-BDNF Pathway and Reduction of Caspase Activity in Neuronal Cells Expressing Pro-Aggregated Tau Protein Int. J. Mol. Sci. 2022 23 12734 10.3390/ijms232112734 36361524 PMC9654711 Figure 1 ( A B A B C Figure 2 ( A B A B n p p p p Figure 3 ( A C A B C n p p p Figure 4 ( A C A B C n p p p p Figure 5 ( A,B A B n p p p Figure 6 ( A F A B C D E F n p p p p Figure 7 ( A,B A B n p p p Figure 8 Ramachandran plots for 4NYX, 1B8M, and 1NME obtained from PROCHECK server. Figure 9 ( A B C D E Figure 10 ( A C A B C Figure 11 ( A C A B C Figure 12 ( A C A B C Figure 13 ( A C A B C Figure 14 ( A C A B C Figure 15 ( A C A B C Figure 16 ( A C A B C medicina-61-01567-t001_Table 1 Table 1 Comparison between the retrieved protein and standard values in order to validate the protein for the docking study. Parameters Details Standards Method of Experiment X-Ray Diffraction Protein ID 4NYX 1B8M 1NME  Mutation No No No No Resolution 1.10 Å 2.75 Å 1.60 Å Near about 3.00 Å wwPDB Validation Better Better Better Better Co-Crystal Ligand 2O4 - 159 - Ramachandran Plot 96.1% 89.5% 90.2% >88% medicina-61-01567-t002_Table 2 Table 2 The active sites’ amino acids. Protein ID Active Sites’ Amino Acids 4NYX ASN1168A, PRO1110A, VAL1115A, LEU1120A, TYR1125A, ARG1173A, VAL1174A, PHE1177A 1B8M ALA46, ARG53, ARG88, ALA89, ARG98, ALA99, GLN54, GLY99, 1NME TRP206, ARG207, ASN208, SER209, LYS210, TRP214, SER249, PHE250, SER251, PHE252 medicina-61-01567-t003_Table 3 Table 3 Grid parameters. Sr. No. Protein ID Center Coordinates Size Coordinates x y z x y z 1 4NYX 9.51 39.76 12.85 25 25 25 2 1B8M −0.833 33.139 7.083 25 25 25 3 1NME 42.09 96.34 24.13 25 25 25 medicina-61-01567-t004_Table 4 Table 4 Predicted ADMET properties of cubebin. Property Model Name Predicted Value Unit  Absorption Water solubility −4.516 Numeric (log mol/L) Caco2 permeability 1.236 Numeric (log Papp in 10 −6 Intestinal absorption (human) 97.749 Numeric (% Absorbed) Skin permeability −2.865 Numeric (log Kp) P-glycoprotein substrate Yes Categorical (Yes/No) P-glycoprotein I inhibitor Yes Categorical (Yes/No) P-glycoprotein II inhibitor No Categorical (Yes/No)  Distribution VDss (human) −0.371 Numeric (log L/kg) Fraction unbound (human) 0 Numeric (Fu) BBB permeability −1.111 Numeric (log BB) CNS permeability −3.08 Numeric (log PS)  Metabolism CYP2D6 substrate No Categorical (Yes/No) CYP3A4 substrate Yes Categorical (Yes/No) CYP1A2 inhibitor No Categorical (Yes/No) CYP2C19 inhibitor Yes Categorical (Yes/No) CYP2C9 inhibitor No Categorical (Yes/No) CYP2D6 inhibitor No Categorical (Yes/No) CYP3A4 inhibitor Yes Categorical (Yes/No)  Excretion Total clearance −0.117 Numeric (log ml/min/kg) Renal OCT2 substrate No Categorical (Yes/No)  Toxicity AMES toxicity Yes Categorical (Yes/No) Max. tolerated dose (human) −0.273 Numeric (log mg/kg/day) hERG I inhibitor No Categorical (Yes/No) hERG II inhibitor Yes Categorical (Yes/No) Oral rat acute toxicity (LD 50 2.5 Numeric (mol/kg) Oral rat chronic toxicity (LOAEL) 1.584 Numeric (log mg/kg_bw/day) Hepatotoxicity No Categorical (Yes/No) Skin sensitization No Categorical (Yes/No) T. pyriformis 0.346 Numeric (log ug/L) Minnow toxicity 0.159 Numeric (log mM) ADMET, absorption, distribution, metabolism, excretion, and toxicity; BBB, blood–brain barrier; CNS, central nervous system; CYP, cytochrome; hERG, human ether-à-go-go gene; LD 50 medicina-61-01567-t005_Table 5 Table 5 Docking score ligands with targets CREB, BDNF, and caspase-3 with protein ID 4NYX, 1B8M, and 1NME. Targets CREB BDNF Caspase-3  PDB 4NYX 1B8M 1NME  Co-crystal ligand  2O4  -  159  Cubebin −8.881 −9.173 −7.322  Co-crystal ligand −8.645 - −6.250 medicina-61-01567-t006_Table 6 Table 6 Docking score and intermolecular interactions of ligands with targets CREB, BDNF, and caspase-3 with protein IDs 4NYX, 1B8M, and 1NME, respectively, from PLIP. PDB Name of Molecule Binding Energy Type of Interaction Residue ID Distance  4NYX  Cubebin −8.881 Hydrophobic Interactions LEU1120A 3.58 LEU1120A 3.76 ILE1122A 3.92 TYR1125A 3.34 VAL1174A 3.81 VAL1174A 3.49  1B8M −9.173 Hydrophobic Interactions PHE56B 3.5 VAL87A 3.91 ARG88A 3.73 ARG88A 3.79 VAL97B 3.28 ARG98B 3.13 TRP100A 3.1 TRP100A 3.48 PHE102A 3.82 TRP110B 3.76 Hydrogen Bonds PHE57B 2.35 ARG88A 2.7 ARG98B 2.65 Salt Bridges ARG88A 5.1  1NME −7.322 Hydrophobic Interactions PHE256B 3.62 Hydrogen Bonds TYR204B 3.57 ARG207B 2.11 p-Stacking PHE256B 3.67 medicina-61-01567-t007_Table 7 Table 7 ΔG bind Energies (kcal/mol) Cubebin_1B8M Cubebin_1NME Cubebin_4NYX  ΔG bind −75.50 ± 5.29 −43.76 ± 5.10 −38.81 ± 4.71  ΔG bind −18.79 ± 1.84 −8.80 ± 2.84 −10.52 ± 2.62  ΔG bind −0.61 ± 0.86 1.68 ± 1.19 1.11 ± 1.73  ΔG bind bond −2.11 ± 0.52 −0.68 ± 0.32 −0.52 ± 0.05  ΔG bind −28.76 ± 1.99 −21.22 ± 2.16 −15.26 ± 1.27  ΔG bind −1.08 ± 0.39 −2.23 ± 0.39 −1.55 ± 0.84  ΔG bind 22.45 ± 1.59 14.44 ± 1.75 14.58 ± 1.92  ΔG bind −46.61 ± 1.83 −26.95 ± 3.01 −26.66 ± 2.62 ",
  "metadata": {
    "Title of this paper": "Neuroprotective Action of Coumarin Derivatives through Activation of TRKB-CREB-BDNF Pathway and Reduction of Caspase Activity in Neuronal Cells Expressing Pro-Aggregated Tau Protein",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472080/"
  }
}