{
  "title": "Paper_948",
  "abstract": "pmc Int J Womens Health Int J Womens Health 1312 intjwh ijwh International Journal of Women's Health 1179-1411 Dove Press PMC12484104 PMC12484104.1 12484104 12484104 41040842 10.2147/IJWH.S522821 522821 1 Review Research Trends and Hotspots in Minimally Invasive Gynecologic Surgery: A Bibliometric and Visualization Analysis Wu et al Wu et al http://orcid.org/0000-0002-0842-5623 Wu Tong  1  2  3 Nie Kebing  1  2  3 Gao Yueyue  1  2  3 Chen Ying  1  2  3 Yan Jinfeng  1  2  3  4 http://orcid.org/0000-0002-8610-952X Wang Shixuan  1  2  3 http://orcid.org/0000-0002-5557-3637 Zhang Jinjin  1  2  3 1 National Clinical Research Center for Obstetrical and Gynecological Diseases, Tongji Hospital, Tongji Medical College, Huazhong University of Science and Technology Wuhan People’s Republic of China 2 Key Laboratory of Cancer Invasion and Metastasis, Ministry of Education, Tongji Hospital, Tongji Medical College, Huazhong University of Science and Technology Wuhan People’s Republic of China 3 Department of Obstetrics and Gynecology, Tongji Hospital, Tongji Medical College, Huazhong University of Science and Technology Wuhan People’s Republic of China 4 School of Materials Science and Engineering, Huazhong University of Science and Technology Wuhan People’s Republic of China Correspondence: Shixuan Wang; Jinjin Zhang, Department of Obstetrics and Gynecology, Tongji Hospital No. 1095, Jiefang Avenue Wuhan 430030 People’s Republic of China 26 9 2025 2025 17 479209 3331 3345 14 2 2025 20 9 2025 26 09 2025 02 10 2025 03 10 2025 © 2025 Wu et al. 2025 Wu et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Abstract Minimally invasive gynecologic surgery (MIGS) has changed gynecologic care over the past thirty years by introducing techniques like multiport laparoscopy, robotic-assisted laparoscopy, and single-site surgery. MIGS offers advantages like reduced blood loss, shorter recovery times, and comparable oncological outcomes to open surgery. However, existing literature lacks a systematic synthesis of global research trends and academic performance of researchers. This cross-sectional bibliometric analysis examined 5,379 MIGS-related publications indexed in the Web of Science Core Collection database spanning 2014 to 2023, utilizing tools like VOSviewer and CiteSpace to map academic trends. The study revealed global contributions from 1,888 institutions across 97 countries, with the United States (1,156 publications) and China (1,090 publications) emerging as leading contributors. High-income countries dominated research output, though metrics varied regionally. Key institutions driving innovation included Mayo Clinic (n = 97), Harvard Medical School (n = 87), and Brigham & Women’s Hospital (n = 83). Journal performance showed disparities influenced by impact factors, accessibility, and editorial focus, while research hotspots centered on endometriosis, laparoscopy, and hysteroscopy. The findings highlight a dynamic, collaborative global landscape in MIGS research, with disease prevalence and journal specialization shaping academic priorities. This analysis underscores the field’s evolution and anticipates future directions, emphasizing the role of multidisciplinary collaboration and technological advancements in advancing clinical practice. Keywords minimally invasive gynecologic surgery MIGS laparoscopy robotic-assisted laparoscopy bibliometric National Key Research and Development Program of China National Natural Science Foundation of China 10.13039/501100001809 This work is financially supported by the grants from the National Key Research and Development Program of China (No. 2022YFC2704100), and National Natural Science Foundation of China (NO. 82301849, 82371648). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Minimally invasive approaches have been the preferred choice for treating benign and malignant gynecologic conditions over the last three decades. Minimally invasive gynecologic surgery (MIGS) typically encompasses multiport laparoscopy, robotic-assisted laparoscopy and laparoendoscopic single-site surgery. 1 2 2 3 4 MIGS has transformed clinical managements in gynecologic surgeries and is still developing. Laparoscopies, hysteroscopies, and colposcopies represent conventional procedures that rely on endoscopy techniques. 5 6 7 8 9 The development of MIGS was well established before 2014 ( Figure 1 10 11 12 13 Figure 1 Timeline of minimally invasive gynecologic surgery research and major accomplishments. Abbreviation Methods Data Collection To characterize the academic performance of countries, institutions, researchers in the MIGS field, the Web of Science Core collection database, one of the leading citation search platforms, was searched to identify all relevant publications. A specific search was carried out with the query: ((TS = (minimally invasive surgery OR laparoscop* OR single port surgery OR robotic surgery OR microinvasive surgery OR hysteroscopy OR Da Vinci surgical system)) AND TS = (gynecology)). We selected documents that were written only in English. The data were obtained on 15th November 2023. Articles were further independently manually reviewed by two researchers (T.W. and K.B.N). Deduplication and Screening A “plain text” file recording fundamental data (authors, institutions, countries/regions, journals, keywords, and references) was finally downloaded. To deduplicate, all bibliometric data were imported into Endnote 20. We independently screened the titles, abstracts, and full texts of the papers to identify studies that fit the exclusion criteria. Exclusion criteria were as follows: (1) Literature irrelevant to the MIGS procedure. For instance, studies focusing solely on minimally invasive techniques in other medical fields-such as laparoscopic procedures for gallbladder removal in general surgery—were excluded. 14 Figure 2 Figure 2 Search and analysis strategies of the minimally invasive gynecologic surgery papers. Data Analysis and Visualization VOSviewer 1.6.18 was utilized to cluster countries, journals, and institutions, while CiteSpace 6.2.4 was employed to analyze burst keywords, correlation relationship, and centrality. Highly cited papers (HCPs) are those that rank in the top 1% of citations in the Web of Science database, categorized by subject over the past decade. 15 In CiteSpace, total Link Strength is computed to quantify the collaborative connections between institutions. The modularity Q (Q value) reflects the significance of cluster structure, with a value greater than 0.3 indicating a significant community structure in the clustering result. The mean silhouette S (S value) assesses the effectiveness of clustering; a value of 0.7 or higher indicates highly efficient and convincing clustering, while a value greater than 0.5 suggests a reasonable and valid clustering result. Keywords with similar meanings were combined into one during extraction. For instance, “fibroids”, “myoma”, “uterine myoma” and “leiomyoma” were combined into “fibroid”. Using the OmicShare online tool ( https://www.omicshare.com Classification of Income Levels The 2023 World Bank data was used to define the country’s income level. Nations are classified into four groups according to their gross national income per person per annum: low income (up to $1,135); lower-middle income ($1,136 to $4,465); upper-middle income ($4,466 to $13,845); and high income ($13,846 and above). Results Baseline Characteristics Initially, 5,379 publications were retrieved from the search ( Figure 2 Figure 3A Figure 3B Figure 3C Figure 3D 16 Figure 3 Baseline characteristics of all eligible documents. ( A B C D Distributions of Countries/Regions There are 97 countries participating in MIGS research, of which 46% were high-income countries, 26% upper-middle income countries, 20% lower-middle income countries, and 8% low-income countries ( Figure 4A Table 1 Figure 4B Table 1 Top 10 Countries Publishing Most Publications Related to Minimally Invasive Gynecologic Surgery Country Income Count Percent H-Index Citation Total Link Strength Citation Impact Cooperative Ratio USA High 1,386 21.18% 73 30,408 6,325 21.94 27.50% China Upper middle 1,083 16.55% 37 9,763 3,896 9.01 7.60% Italy High 554 8.31% 54 12,963 4,274 23.83 62.25% Germany High 317 4.84% 30 5,509 2,092 17.38 62.56% Japan High 257 3.93% 29 3,248 1,081 12.64 17.57% UK High 241 3.68% 39 7,341 1,882 30.46 121.21% France High 236 3.61% 36 5,499 1,913 23.30 74.14% South Korea High 219 3.35% 24 2,291 1,216 10.46 12.18% Türkiye Upper middle 177 2.70% 18 1,287 585 7.27 60.97% Canada High 174 2.66% 34 4,083 1,447 23.47 53.67% Figure 4 Clusters and connections of countries. ( A B C D Additionally, clustering analysis revealed the formation of four groups, each exhibiting distinctive regional distribution patterns ( Figure 4B C Figure 4D Contributions of Institutions These 5,206 papers were produced with contributions from 1,888 institutions, as identified by the author addresses. The eight institutions with the most publications are shown in Figure 5A Table 2 Table 2 Institutions That Published the Most Publications or Received the Most Citations for Articles or Reviews Pregnancy Pregnancy Pregnancy Pregnancy Pregnancy Total Link Strength Citation Impact Highly Cited Paper Count Citation Total Link Strength Citation Impact Highly Cited Paper Mayo Clin. 75 1562 98 20.83 1 22 766 25 34.82 1 Brigham & Women’s Hosp. 74 2243 183 30.31 1 9 130 12 14.44 0 Harvard Med. Sch. 74 1494 185 20.19 1 13 159 25 12.23 0 Fudan Univ. 69 576 41 8.35 0 7 79 2 11.29 0 Univ. Cattolica Sacro Cuore 63 1610 62 25.56 1 6 141 5 23.50 0 Univ. Naples Federico II 24 413 27 17.21 0 16 317 35 19.81 0 Sichuan Univ. 41 239 13 5.83 0 14 52 0 3.71 0 Columbia Univ. 49 1051 82 21.45 1 13 299 24 23.00 0 Figure 5 Bibliometric analysis of top institutions. ( A B The findings revealed a notable trend as the majority of institutions from the USA were predominantly associated with the category of “Endometriosis”, indicating a greater prevalence of MIGS being performed for endometriosis ( Figure 5B Author Analysis The bibliometric analysis included 23,306 writers and 56,658 co-cited authors. Table 3 Figure 6 Table 3 Top 10 Researchers Publishing Most Publications About Minimally Invasive Gynecologic Surgery Author Count H-Index Citation Total Link Strength Citation Impact Scambia G. 61 26 1461 80 23.95 Wright D. 48 17 1165 26 24.27 Ghezzi F. 37 20 981 50 26.51 Missmer S. 33 18 747 0 22.64 Fagotti A. 28 17 816 47 29.14 Ramirez P. 28 17 1905 4 68.04 Fanfani F. 26 19 875 53 33.65 Uccella S. 26 18 730 53 28.08 Bogani G. 25 13 735 18 29.40 Hershman D. 25 12 368 25 14.72 Figure 6 Visualization of the author’s network. Each circle represents an author, and the different colors represent a different group of authors. The top two authors with the most posts in each cluster are identified. Publishing Journals The pertinent journals are divided into three categories according to their co-citation connection: reproduction and endocrinology, oncology, and general gynecology, represented by Arch. Gynecol. Obstet., Gynecol. Oncol., and J. Minim. Invasive Gynecol, respectively ( Figure 7A Figure 7B Table 4 Table 4 Table 4 Baseline Features of the Selected 15 Journals Journal Article Review Journal Quartile Open Access Gold H-Index Count Citation Count Citation Hum. Reprod. Update - - 21 2,568 Q1 25.17% 20 Am. J. Obstet. Gynecol. 176 4707 25 1,284 Q1 15.20% 43 J. Minim. Invasive Gynecol. 242 1,988 44 807 Q1 5.84% 25 Arch. Gynecol. Obstet. 270 2,561 49 701 Q3 28.64% 28 Gynecol. Oncol. 282 6,245 27 1,010 Q1 19.59% 45 Obstet. Gynecol. 173 3,933 22 528 Q1 12.66% 38 Fertil. Steril. 182 5,627 40 1,610 Q1 74.87% 49 Biomed Res. Int. 55 663 13 467 Q2 96.67% 19 Reprod. Biol. Endocrinol. 18 348 6 478 Q1 13.54% 15 Eur. J. Gynaecol. Oncol. 132 205 10 98 Q4 98.76% 8 Medicine (Baltimore) 146 855 47 166 Q3 97.81% 17 Hum. Reprod. 98 4,801 5 566 Q1 23.04% 37 PloS One 54 925 8 210 Q3 99.18% 20 Int. J. Gynecol. Cancer 855 1,221 4 98 Q1 8.93% 21 Taiwan. J. Obstet. Gynecol. 133 1,035 21 351 Q3 93.02% 19 Figure 7 Participants of journals in minimally invasive gynecologic surgery. ( A B Abbreviations Overall Keywords and Future Trends Keywords are essential for conveying the main ideas of a subject, and their frequency can offer insights into current topics and possibly predict future research trends. The top 5 most frequent keywords were management, surgery, laparoscopy, hysterectomy and women ( Figure 8A Figure 8B Figure 8 ( A B C Citation burst analysis is an effective method for examining specific research fields, offering insights into areas of high interest and emerging trends for a specific year. By analyzing the top 50 keywords with the most significant bursts, it is evident that in vitro fertilization and infertility garnered increased attention around 2013 ( Figure 8C Topics Preferences for Journals and Countries We next explored whether journals or countries had preferences for specific diseases or surgical methods. As shown in Table 5 Table 5 Hot Tops for the Top Five Journals That Published Most Papers Journal Top Three Diseases Top Three Surgical Methods Arch. Gynecol. Obstet. Endometriosis Hysterectomy Endometrial cancer Laparoscopic hysterectomy Pregnancy Radical hysterectomy J. Minim. Invasive Gynecol. Endometriosis Hysterectomy Endometrial cancer Myomectomy Myoma Laparoscopic hysterectomy Gynecol. Oncol. Endometrial cancer Lymphadenectomy Cervical cancer Hysterectomy Ovarian cancer Radical hysterectomy Fertil. Steril. Endometriosis Myomectomy Infertility Transplantation* Pregnancy Am. J. Obstet. Gynecol. Endometrial cancer Hysterectomy Endometriosis Laparoscopic hysterectomy Pelvic organ prolapse Vaginal hysterectomy Notes The occurrence of topics could indicate the disease spectrum of a country. Our examination revealed a widespread prevalence of gynecological cancers, endometriosis and infertility as common areas of concern faced by most countries ( Table 6 Table 6 Table 6 Preferences for the Top Five Countries That Published Most Papers Country Top Five Diseases Top Three Surgical Methods The USA Endometrial cancer Hysterectomy Endometriosis Laparoscopic hysterectomy Infertility Lymphadenectomy Pelvic organ prolapse Cervical cancer China Endometriosis Hysterectomy Cervical cancer Radical hysterectomy Pregnancy Lymphadenectomy Infertility Endometrial cancer Italy Endometriosis Hysterectomy Endometrial cancer Lymphadenectomy Infertility Neoadjuvant chemotherapy Cervical cancer Pregnancy Germany Endometriosis Hysterectomy Cervical cancer Radical hysterectomy Endometrial cancer Laparoscopic hysterectomy Pelvic pain Pregnancy Japan Endometrial cancer Lymphadenectomy Endometriosis Radical hysterectomy Cervical cancer Hysterectomy Infertility Pregnancy Discussion Principal Findings The current bibliometrics underline that MIGS has received much steady and continuous attention from scholars in the past ten years. We identified 5,206 papers concerning MIGS in the database from 2014 to 2023. We identified the publications, citations, countries of origins, institutions for original research and review articles separately. We noted a gradual decline in the number of citations for articles starting from 2016, and it was expected since earlier papers have had longer to accumulate citations than recent publications. Representative journals that published MIGS papers and their keywords in diseases, therapy and surgical method are also listed. As far as we know, this bibliometric analysis is the first to thoroughly outline the recent advancements in MIGS over the past decade. Results of the Study in Context Nearly half of the papers are produced by high-income countries, and it is similar with previous studies that 87% publications concerning gynecologic oncology were from high-income countries. 17 18 19 20 21 The USA, East Asia and European countries perform well in invigorating MIGS. The USA and China are at the forefront regarding the volume of MIGS-related publications. It is reported that more than half of gynecology-associated publications originate in the USA and European countries, 17 22 23 24 25–27 Human Reproduction and Human Reproduction Update are official publications of the European Society of Human Reproduction and Embryology (ESHRE). ESHRE is active in developing clinical guidelines to improve the quality of healthcare, abiding by strict criteria. So, it is reasonable to observe that the representative keyword for European institutions is “Guidelines”. The highest IF of Human Reproduction Update suggests that high-quality reviews are highly valued, as they can aid researchers in comprehending, evaluating, and navigating new areas more effectively. 28 16 29 30 31 It is noticed that MIGS is preferred for treating endometrial, cervical and ovarian cancers, and most methods abide by clinical guidelines. Laparoscopic treatment for cervical cancer has been controversially discussed since 2018. Ramirez et al conducted an international, multicenter, randomized study on cervical cancer, and revealed that endoscopic radical surgery was associated with significantly lower rates of disease-free survival (91.2% vs 97.1%) and 3-year overall survival (93.8% vs 99.0%) compared to the open procedure. 3 32 33 Enhanced recovery after surgery (ERAS), known as a joint, comprehensive approach to perioperative care, has become the standard practice in most surgical fields. 34 34 35 36 Conclusion This study suggests that MIGS research has entered a steady development period, and scholars are still engaging in it. Most countries contribute to the clinical practice of MIGS, regardless of the publication types. Academic journals have field-specific preferences for submitting papers and differences in disease prevalence also exist among countries/regions. Future research may come to outpatient surgery, ultra-minimally invasive surgery and modern telemedicine are emerging, and will certainly bring new blood to MIGS. Disclosure The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1. Ramos A Fader AN Minimally Invasive Surgery in Gynecology: underutilized? Curr Obstet Gynecol Rep 2015 4 3 152 158 10.1007/s13669-015-0126-y 2. Stewart KI Fader AN New Developments in Minimally Invasive Gynecologic Oncology Surgery Clin Obstet Gynecol 2017 60 2 330 348 10.1097/GRF.0000000000000286 28406810 PMC5576030 3. Ramirez PT Frumovitz M Pareja R Minimally Invasive versus Abdominal Radical Hysterectomy for Cervical Cancer New Engl J Med 2018 379 20 1895 1904 10.1056/NEJMoa1806395 30380365 4. Scalici J Laughlin BB Finan MA Wang B Rocconi RP The trend towards minimally invasive surgery (MIS) for endometrial cancer: an ACS-NSQIP evaluation of surgical outcomes Gynecologic Oncol 2015 136 3 512 515 10.1016/j.ygyno.2014.11.014 25462206 5. Rabinovich A Minimally invasive surgery for endometrial cancer: a comprehensive review Arch Gynecol Obstetrics 2015 291 4 721 727 10.1007/s00404-014-3517-9 25344420 6. Conrad LB Ramirez PT Burke W Role of Minimally Invasive Surgery in Gynecologic Oncology: an Updated Survey of Members of the Society of Gynecologic Oncology INt J Gynecol Cancer 2015 25 6 1121 1127 10.1097/IGC.0000000000000450 25860841 PMC4478101 7. La Verde M Riemma G Tropea A Biondi A Cianci S Ultra-minimally invasive surgery in gynecological patients: a review of the literature Updates Surg 2022 74 3 843 855 10.1007/s13304-022-01248-y 35366181 PMC9213331 8. Lyons YA Stephan JM Gonzalez Bosquet J Goodheart MJ Gynecologic Oncology: challenges of Minimally Invasive Surgery In a Field of Maximal Complexities Clin Obstet Gynecol 2020 63 1 30 39 10.1097/GRF.0000000000000505 31833847 9. Delameilleure M Timmerman S Vandoren C Approaches for hysterectomy and implementation of robot-assisted surgery in benign gynaecological disease: a cost analysis study in a large university hospital Eur J Obstet Gynecol Reprod Biol 2024 301 105 113 10.1016/j.ejogrb.2024.07.060 39116478 10. Alkatout I Mechler U Mettler L The Development of Laparoscopy-A Historical Overview Front Surg 2021 8 799442 10.3389/fsurg.2021.799442 34977146 PMC8714650 11. Matanes E Lauterbach R Boulus S Amit A Lowenstein L Robotic laparoendoscopic single-site surgery in gynecology: a systematic review Eur J Obstet Gynecol Reprod Biol 2018 231 1 7 10.1016/j.ejogrb.2018.10.006 30317138 12. Nezhat C Zurawin RK Development and history of morcellators Curr Opin Obstet Gynecol 2018 30 1 65 68 10.1097/GCO.0000000000000425 29232258 13. Huang CC Lo TS Huang YT Long CY Law KS Wu MP Surgical Trends and Time Frame Comparison of Surgical Types of Hysterectomy: a Nationwide, Population-based 15-year Study J Minimally Iinvas Gynecol 2020 27 1 65 73.e61 10.1016/j.jmig.2019.02.020 30928611 14. Tan YY Zhao G Wang D Jm W Tang JR Ji ZL A new strategy of minimally invasive surgery for cholecystolithiasis: calculi removal and gallbladder preservation Digest Surg 2013 30 4–6 466 471 10.1159/000357823 24481280 15. Waltman L A review of the literature on citation impact indicators J Informetrics 2016 10 2 365 391 16. Miranda R Garcia-Carpintero E Overcitation and overrepresentation of review papers in the most cited papers J Informetrics 2018 12 4 1015 1030 10.1016/j.joi.2018.08.006 17. Levin G Pareja R Harrison R Ramirez PT Meyer R Association of literature metrics in gynecologic oncology with country classification by income level INt J Gynecol Cancer 2023 33 6 957 963 10.1136/ijgc-2023-004380 37001895 18. Cooper MA Hutfless S Segev DL Ibrahim A Lyu H Makary MA Hospital level under-utilization of minimally invasive surgery in the United States: retrospective review BMJ 2014 349 g4198 10.1136/bmj.g4198 25005264 PMC4087169 19. von Bechtolsheim F Schneider A Schmidt S Satisfaction of surgeons with the current state of training in minimally invasive surgery: a survey among German surgeons Surg Endosc 2023 2023 1 10.1007/s00464-023-10584-y PMC10830590 38087109 20. Wood KL Haider SF Bui A Leitman IM Access to common laparoscopic general surgical procedures: do racial disparities exist? Surg Endosc 2020 34 3 1376 1386 10.1007/s00464-019-06912-w 31209603 21. Rose JS Waibel BH Schenarts PJ Disparity between resident and faculty surgeons’ perceptions of preoperative preparation, intraoperative teaching, and postoperative feedback J Surg Educ 2011 68 6 459 464 10.1016/j.jsurg.2011.04.003 22000531 22. Dolmans MM Donnez J Fertility preservation in women for medical and social reasons: oocytes vs ovarian tissue Best Pract Res Clin Obstet Gynaecol 2021 70 63 80 10.1016/j.bpobgyn.2020.06.011 32800711 23. Brännström M Racowsky C Carbonnel M Uterus transplantation: from research, through human trials and into the future Human Reproduction Update 2023 29 5 521 544 10.1093/humupd/dmad012 37328434 PMC10477946 24. Dursun P Gultekin M Ayhan A World gynecologic oncology publications and the Turkish contribution to the literature between 2000 and 2007 APJCP 2011 12 4 861 864 21790216 25. Ma Q Li Y Zhang Y Informetric Analysis of Highly Cited Papers in Environmental Sciences Based on Essential Science Indicators Int J Environ Res Public Health 2020 17 11 3781 10.3390/ijerph17113781 32466583 PMC7312947 26. Woolston C What China’s leading position in natural sciences means for global research Nature 2023 620 7973 S2 s5 10.1038/d41586-023-02159-7 27. Zhou Y Kwon J-W Overview of Hofstede-Inspired Research Over the Past 40 Years: the Network Diversity Perspective SAGE Open 2020 10 3 2158244020947425 10.1177/2158244020947425 28. Teixeira MC Thomaz SM Michelan TS Incorrect citations give unfair credit to review authors in ecology journals PLoS One 2013 8 12 e81871 10.1371/journal.pone.0081871 24349143 PMC3859513 29. Foley JA Peer Review, Citation Ratings and Other Fetishes Springer Sci Rev 2013 1 1 5 7 10.1007/s40362-013-0003-x 30. Brandt JS Hadaya O Schuster M Rosen T Sauer MV Ananth CV A Bibliometric Analysis of Top-Cited Journal Articles in Obstetrics and Gynecology JAMA Netw Open 2019 2 12 e1918007 10.1001/jamanetworkopen.2019.18007 31860106 PMC6991228 31. Blackledge KT Ananth CV Brandt JS The influence of journal self-citations on impact factors in obstetrics and gynecology Am J Clin Exp Obstet Gynecol 2022 226 5 736 737.e731 10.1016/j.ajog.2021.12.036 34968457 32. Giampaolino P Della Corte L Mercorio A Laparoscopic gynecological surgery under minimally invasive anesthesia: a prospective cohort study Updates Surg 2022 74 5 1755 1762 10.1007/s13304-022-01310-9 35759109 PMC9244282 33. Melamed A Margul DJ Chen L Survival after Minimally Invasive Radical Hysterectomy for Early-Stage Cervical Cancer New Engl J Med 2018 379 20 1905 1914 10.1056/NEJMoa1804923 30379613 PMC6464372 34. Nelson G Fotopoulou C Taylor J Enhanced recovery after surgery (ERAS®) society guidelines for gynecologic oncology: addressing implementation challenges - 2023 update Gynecologic Oncol 2023 173 58 67 10.1016/j.ygyno.2023.04.009 37086524 35. Chapman JS Roddy E Ueda S Brooks R Chen LL Chen LM Enhanced Recovery Pathways for Improving Outcomes After Minimally Invasive Gynecologic Oncology Surgery Obstetrics Gynecol 2016 128 1 138 144 10.1097/AOG.0000000000001466 27275797 36. Ferraioli D Pouliquen C Jauffret C EVAN-G score in patients undergoing minimally invasive gynecology oncologic surgery in an Enhanced Recovery After Surgery (ERAS) program INt J Gynecol Cancer 2020 30 12 1966 1974 10.1136/ijgc-2019-001173 32546640 ",
  "metadata": {
    "Title of this paper": "EVAN-G score in patients undergoing minimally invasive gynecology oncologic surgery in an Enhanced Recovery After Surgery (ERAS) program",
    "Journal it was published in:": "International Journal of Women's Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484104/"
  }
}