{
  "title": "Paper_918",
  "abstract": "pmc Theranostics Theranostics 1512 theranostics thno Theranostics 1838-7640 Ivyspring International Publisher PMC12486394 PMC12486394.1 12486394 12486394 41041064 10.7150/thno.111508 thnov15p9911 1 Research Paper Chemo-RaST with bortezomib inhibits multiple myeloma relapse Ghai Anchal 1 2 # Zheleznyak Alexander 1 Egbulefu Christopher 1 2 # Blasi Nicole 2 Black Kvar 1 Tang Rui 1 Cooper Matthew L 3 Vij Kiran 3 4 Vij Ravi 3 DiPersio John 3 Shokeen Monica 1 3 5 Achilefu Samuel 1 2 # 3 5 6 ✉ 1 2 3 4 5 6 ✉ Corresponding author: Prof. Samuel Achilefu, Samuel.Achilefu@UTSouthwestern.edu #Current affiliation. Competing Interests: The authors have declared that no competing interest exists. 2025 8 9 2025 15 18 498071 9911 9921 4 2 2025 21 8 2025 08 09 2025 02 10 2025 03 10 2025 © The author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ https://ivyspring.com/terms Rationale: Methods: Results: In vitro In vivo Conclusions: myeloma Radionuclide-stimulated dynamic therapy (RaST) chemo-RaST bortezomib relapse therapy resistance pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Multiple myeloma (MM), the second most common hematological malignancy, originates in bone marrow and primarily affects plasma cells 1 2 3 4 4 6 Radionuclide-stimulated dynamic therapy (RaST), also known as Cerenkov Radiation-Induced Therapy, is one of such strategies 7 8 7 9 11 12 13 14 15 max 16 in vivo 4 17 89 We hypothesized that combining photophysical stimulation of cytotoxic ROS with drug-induced mitochondrial ROS generation (chemo-RaST) would inhibit clonal adaptation and prevent MM relapse. We selected the regenerative photocatalyst titanium dioxide (TiO₂) nanoparticles 18 89 19 20 21 Materials and Methods Materials Daratumumab, an FDA-approved humanized monoclonal antibody against CD38, was provided by the Siteman Cancer Center pharmacy at Washington University in St. Louis for research purposes. Deferoxamine-p-benzyl-isothiocyanate (DFO-Bz-NCS) was purchased from Macrocyclics, Inc. TiO 2 Synthesis and characterization of TiO 2 Titanium dioxide-transferrin-titanocene (TiO 2 7 2 2 2 89 Radioactive materials were used under Washington University's Nuclear Regulatory Commission license. ⁸⁹Zr was produced on a CS-15 cyclotron at the School of Medicine's Cyclotron Facility. Activity was measured with a Capintec CRC-15R dose calibrator (Ramsey, NJ, USA). Radiolabeling efficiency was monitored by instant thin-layer chromatography (iTLC) using iTLC-SG paper (Agilent Technologies, CA, USA) and a Scan RAM radio-TLC scanner (LabLogic, Brandon, FL, USA). pH was measured with pH paper strips (EMD Chemicals, Inc., Gibbstown, NJ, USA). Synthesis and radiolabeling of daratumumab with 89 Daratumumab was conjugated to DFO-Bz-NCS (10-15-fold molar excess), and the conjugate was radiolabeled with neutralized ⁸⁹Zr as described 4 Cell lines The human MM.1S cell line expressing luciferase (MM.1S-luc) was provided by Dr. John F. DiPersio (Washington University School of Medicine). Cells were cultured in RPMI-1640 (Thermo Fisher) with 10% fetal bovine serum (Gibco) and 1% streptomycin (Corning, Manassas, USA) at 37 °C, 5% CO₂. Flow cytometry MM.1S cells (1 × 10⁶) were resuspended in staining buffer (PBS with 0.5% BSA and 2 mM EDTA) and incubated for 30 min at 4 °C with fluorochrome-labeled monoclonal antibody anti-human CD71-PE-Cy7 (clone CY1G4, BioLegend) or isotype control (MOPC-173, BioLegend). Data were acquired on a Gallios cytometer and analyzed with FlowJo v10 software. In vitro MM.1S-GFP cells were incubated for 4-24 h at 37 °C with Tf-Alexa 680 (final 180 µg/mL) or TiO₂-Tf-Alexa 680 (100 µL per 1 mL). Cells were washed twice with PBS and plated on MatTek glass-bottom dishes. Olympus FV1000 confocal microscope (60× objective; 633 nm excitation; 655-755 nm emission) was used for fluorescence and bright-field imaging. Images were processed with Fluoview FV10-ASW software. TiO 2 MM.1S cells were plated in 24-well TPP tissue culture plates (Midwest Scientific, St. Louis, MO) at 2 × 10⁶ cells/well in 1 mL RPMI with 10% FBS, 10,000 U/mL penicillin, and 10,000 µg/mL streptomycin. Immediately after seeding, 100 µL of TiO₂-Tf-TC suspension containing 50 µg TiO₂ was added per well and mixed. Plates were incubated at 37 °C and 5% CO 2 2 For titanium (Ti) quantification, samples were digested in 2 mL HNO₃ (70%, trace metal, Sigma-Aldrich), 1 mL HCl (37%), and 1 mL H₂O₂ (30%) in sealed vessels (Mars 6 Microwave Digestion System; CEM Corporation); ramp to 200 °C over a period of 20 min, and maintained for 20 min. Samples were cooled and diluted to 5 mL with 18 MΩ water. Ti concentration was measured using a PerkinElmer Optima 7300DV ICP-OES with continuous internal standard (200 µg/L ⁴⁵Sc). Calibration standards were 1, 10, 100, and 1000 µg/L. Ti concentration in the cells was calculated by multiplying the measured Ti concentration by the dilution factor and the known sample volume, then dividing by the tissue weight. In vitro Cytotoxic effects of RaST with ⁸⁹Zr-daratumumab and TiO 2 2 2 MM.1S-luc subcutaneous and disseminated MM mouse models All animal studies followed the guidelines of the Washington University and UT Southwestern Animal Studies Committees. Female Fox Chase SCID Beige (FCSB) mice, 4-6 weeks old (Charles River Laboratories, USA), were acclimatized for 1 week with ad libitum food and water. Euthanasia was caused by cervical dislocation under 5% isoflurane anesthesia. Reporter expression was verified by in vitro In vivo Study design and RaST regimen are shown in Figure 3 In vivo Disseminated myeloma models were used to simulate systemic MM. Disease burden was monitored weekly by BLI, and treatment was initiated when total flux reached 1 × 10⁶. Mice were divided into six groups: untreated; TiO-Tf-TC only (100 µg/100 µL); ⁸⁹Zr-daratumumab only (1-1.2 MBq/100 µL); bortezomib only (1 mg/kg); RaST (⁸⁹Zr-daratumumab followed 3 days later by TiO-Tf-TC); and chemo-RaST. Doses for each RaST or chemo-RaST component were kept consistent in the combination therapy. Bortezomib was administered at 1 mg/kg twice weekly via intraperitoneal. Response and disease progression were assessed by BLI. Bioluminescent imaging Tumor progression in vivo was monitored weekly by BLI using IVIS Lumina system (Living Image 3.2; 1-300 s exposures; binning 2-8; field of view 12.5 cm; PerkinElmer, Waltham, MA, USA). Mice received an intraperitoneal injection of 150 mg/kg D-luciferin in PBS and were imaged 10 minutes later under isoflurane anesthesia (2% in O₂). For subcutaneous or disseminated models, regions of interest (ROIs) were drawn around tumors or over the dorsal/ventral sides. Total flux (photons/sec) was measured using Living Image 2.6 and normalized to average radiance (photons/sec/cm²/sr). The first treatment dose was administered when total flux reached 1 × 10⁶. In vivo Mice in the ⁸⁹Zr-daratumumab and RaST groups received ⁸⁹Zr-daratumumab (1-1.2 MBq) on days 21 and 35. PET/CT imaging was performed 3 days post-injection. The day 24 time point served as baseline (pre-therapy) and preceded TiO-Tf-TC injection in the RaST cohort. Post-therapy imaging was performed on day 38. Mice were anesthetized with isoflurane (1-2%) and imaged on a small-animal PET/CT scanner. Thirty-minute static scans were co-registered and reconstructed using Inveon Research Workstation (IRW) software. ROIs were drawn around the tumors from PET images using CT anatomical guidelines, and the SUV mean Histology Hematoxylin and eosin (H&E) staining and CD138 immunohistochemistry (IHC) were performed on 5 µm sections from decalcified, formalin-fixed, paraffin-embedded leg bone tissue from the MM.1S-luc mice. A prediluted CD138/syndecan-1 (B-A38) monoclonal antibody on the VENTANA BenchMark platform was utilized for CD138 IHC. A single pathologist, blinded to treatment, reviewed H&E and CD138 slides from untreated and treated cohorts. Representative images were captured at original magnification ×100 (10× objective) using an OLYMPUS BX51 microscope. Statistical analysis Statistical analyses were performed using GraphPad Prism 8.0 (GraphPad Software, Inc., La Jolla, CA, USA). Data are expressed as mean ± standard deviation unless otherwise noted. p < 0.05 was considered statistically significant. Results Synthesis and characterization of RaST components Our experimental design employs two strategies to selectively deliver both the Cerenkov-emitting radiopharmaceutical and photosensitizer to MM cells at non-cytotoxic doses. Previous studies have demonstrated that DFO forms stable chelates with 89 24 4 89 Figure S1 Incorporating TC, a biocompatible photoinitiator, into TiO₂ nanoparticles has been shown to enhance the RaST effect 7 7 1 1 1 Internalization of TiO 2 The MM.1S cell line is commonly used for preclinical MM studies 25 26 2 in vitro in vivo Confocal imaging after 24 h incubation with transferrin protein-Alexa 680 (Tf-Alexa 680) revealed punctate vesicular uptake at the plasma membrane (Figure 2 2 2 We next established non-cytotoxic doses of ⁸⁹Zr-daratumumab (0.0037 MBq) and TiO₂-Tf-TC nanoparticles (50 µg) to assess RaST-mediated cell death by MTS assay. Under these conditions, untreated (98.7 ± 1.5%), nanoparticle-treated (96.6 ± 0.8%), and ⁸⁹Zr-daratumumab-treated cells (91.3 ± 3.4%) showed no significant loss of viability (Figure 2 RaST and chemo-RaST in the MM.1S-luc subcutaneous myeloma model Subcutaneous and disseminated MM models were used to evaluate whether RaST can prevent relapse. Although MM is primarily hematologic with multifocal marrow lesions, soft-tissue extramedullary myelomas are common 27 Since positrons from 89 28 29 Weekly BLI was used to monitor tumor progression and responses to TiO₂-Tf-TC nanoparticles only (100 µg/100 µL), bortezomib only (1 mg/kg), 89 89 3 BLI showed tumor progression in untreated mice and in those receiving TiO₂-Tf-TC nanoparticles alone, ⁸⁹Zr-daratumumab alone, or bortezomib (Figure 4 Figure S2 4 mean mean As anticipated, the initial benefits of bortezomib or RaST diminished, with progressive disease re-emerging after day 40 (Figure 4 Figure S3 30 Figure S3 29 31 32 4 In vivo MM is a multifocal and disseminated disease, necessitating a model that accurately mirrors its clinical presentation. To achieve this, we established disseminated MM.1S-luc tumors in FCSB mice. As in patients, these mice developed tumors at varying rates and locations. Mice were divided into treatment groups, and response was monitored by BLI (Figure 5 Figure S4 BLI showed significant tumor progression after day 50 in untreated, TiO₂-Tf-TC, bortezomib, and ⁸⁹Zr-daratumumab groups, except one untreated mouse with a low baseline signal (Figure 5 Figure S4 5 5 5 Supplementary Table 1 Histology on day 50 leg-bone tissues showed extensive marrow replacement by CD138-positive plasma cells in untreated mice (Figure 6 Discussion Most MM patients respond initially but experience remission-relapse cycles that culminate in progression and mortality. Advances in immunotherapies, biologics, and combinations have extended survival but remain inadequate for sustained remission 33 The choice of radionuclide is critical for success. Prior work with short-lived positron emitters (e.g., ⁶⁸Ga, ¹⁸F) often required multiple high-activity re-injections to sustain inhibition because >95% of positrons/Cerenkov radiation are emitted within ~10 h (for ¹⁸F) and are essentially depleted by 24 h 7 11 15 34 24 High-dose radioimmunoconjugates (e.g., ¹⁷⁷Lu-daratumumab) have yielded strong responses in mice 35 36 BLI showed significant inhibition with RaST in the subcutaneous model, but relapse emerged by day 40, revealing limitations of ROS-based monotherapy. Rescue efforts with bortezomib 37 33 Chemo-RaST disrupts cancer cells via multiple death pathways. RaST induces apoptosis, ferroptosis, and necroptosis through ROS generation 7 11 12 38 39 20 21 Conclusion Chemo-RaST shows therapeutic promise for MM. By engaging both photophysical and mitochondrial ROS-generating agents, the treatment achieved significant tumor regression, reduced relapse, and prolonged progression-free survival in preclinical models. The use of tracer doses of long-lived ⁸⁹Zr for continuous photosensitizer activation highlights the advantages of extended-half-life radionuclides in RaST. This approach is highly translational, supported by prior use of ⁸⁹Zr-daratumumab and bortezomib in patients. Although we used tracer ⁸⁹Zr-daratumumab and a standard bortezomib dose, future work should evaluate dose ranges and refine radionuclide-photosensitizer timing to maximize benefit while minimizing off-target toxicity. Investigating additional agents, including small-molecule inhibitors or immunomodulators, may further enhance chemo-RaST and enable durable, multi-faceted regimens to achieve disease-free remission while maintaining quality of life for MM patients. Supplementary Material Supplementary methods, figures and table. We thank the Washington University Molecular Imaging Center, the Siteman Cancer Center Small Animal microPET Facility, and the UT Southwestern Cyclotron Facility for their assistance with imaging and therapy studies. The Department of Biomedical Engineering, University of Texas Southwestern, Dallas, Texas, provided additional imaging systems and resources. We thank the Washington University Isotope production team for producing Zirconium 89, and the small animal imaging facility for help with the small animal PET/CT data generation. We also thank Dr. Xiankai Sun and his laboratory at the University of Texas Southwestern Medical Center, Dallas, TX, for supporting RAM-related studies. Funding Funding for this study was supported primarily by the U.S. National Institutes of Health (NIH)'s National Cancer Institute (NCI R01CA260855), the Department of Defense Breast Cancer Research Program (W81XWH-16-1-0286), and the Cancer Prevention and Research Institute of Texas (CPRIT Grant RR220013). SA is a CPRIT Scholar in Cancer Research. Additional support for cancer imaging was provided by the NIH (NIBIB R01 EB030987, R01 EB008111, NCI R01 CA194552, and NCI R01CA152329, S10 OD027042, S10 OD025264, and NCI P30 CA091842). Abbreviations MM multiple myeloma NP nanoparticle TiO 2 titanium dioxide Tf transferrin TC Titanocene ROS reactive oxygen species RaST radionuclide-stimulated dynamic therapy chemo-RaST chemotherapy combined radionuclide stimulated dynamic therapy TEM transmission electron microscopy DLS dynamic light scattering BLI bioluminescence imaging PET/CT positron emission tomography/computed tomography 89 Zirconium-89 PBS phosphate buffered saline iTLC instant thin layer chromatography RCP radiochemical purity luc luciferase FCSB fox chase SCID beige ROI region of interest SUV standardized uptake value IHC immunohistochemistry H&E Hematoxylin and eosin ICP-OES Inductively Coupled Plasma-Optical Emission Spectrometer ICP-MS inductively coupled plasma mass spectrometry 1 Cid Ruzafa J Merinopoulou E Baggaley RF Leighton P Werther W Felici D Cox A Patient population with multiple myeloma and transitions across different lines of therapy in the USA: an epidemiologic model Pharmacoepidemiol Drug Saf 2016 25 8 871 9 27476979 10.1002/pds.3927 2 Blade J Fernandez-Llama P Bosch F Montoliu J Lens XM Montoto S Renal failure in multiple myeloma: presenting features and predictors of outcome in 94 patients from a single institution Arch Intern Med 1998 158 17 1889 93 9759684 10.1001/archinte.158.17.1889 3 Kumar SK Rajkumar SV Dispenzieri A Lacy MQ Hayman SR Buadi FK Improved survival in multiple myeloma and the impact of novel therapies Blood 2008 111 5 2516 20 17975015 10.1182/blood-2007-10-116129 PMC2254544 4 Ghai A Maji D Cho N Chanswangphuwana C Rettig M Shen D Preclinical Development of CD38-Targeted [( 89 J Nucl Med 2018 59 2 216 222 29025987 10.2967/jnumed.117.196063 PMC5807532 5 Usmani SZ Rodriguez-Otero P Bhutani M Mateos MV Miguel JS Defining and treating high-risk multiple myeloma Leukemia 2015 29 11 2119 25 26265183 10.1038/leu.2015.209 6 Gay F Engelhardt M Terpos E Wäsch R Giaccone L Auner HW From transplant to novel cellular therapies in multiple myeloma: European Myeloma Network guidelines and future perspectives Haematologica 2018 103 2 197 211 29217780 10.3324/haematol.2017.174573 PMC5792264 7 Kotagiri N Sudlow GP Akers WJ Achilefu S Breaking the depth dependency of phototherapy with Cerenkov radiation and low-radiance-responsive nanophotosensitizers Nat Nanotechnol 2015 10 4 370 9 25751304 10.1038/nnano.2015.17 PMC4393353 8 Lane DD Black KCL Raliya R Reed N Kotagiri N Gilson R Effects of core titanium crystal dimension and crystal phase on ROS generation and tumour accumulation of transferrin coated titanium dioxide nanoaggregates RSC Adv 2020 10 40 23759 23766 32774845 10.1039/d0ra01878c PMC7409989 9 Shaffer TM Pratt EC Grimm J Utilizing the power of Cerenkov light with nanotechnology Nat Nanotechnol 2017 12 2 106 117 28167827 10.1038/nnano.2016.301 PMC5540309 10 Liu H Wang Q Guo J Feng K Ruan Y Zhang Z Prodrug-based strategy with a two-in-one liposome for Cerenkov-induced photodynamic therapy and chemotherapy J Control Release 2023 364 206 215 37884209 10.1016/j.jconrel.2023.10.036 11 Kotagiri N Cooper ML Rettig M Egbulefu C Prior J Cui G Radionuclides transform chemotherapeutics into phototherapeutics for precise treatment of disseminated cancer Nat Commun 2018 9 1 275 29348537 10.1038/s41467-017-02758-9 PMC5773683 12 Zheleznyak A Mixdorf M Marsala L Prior J Yang X Cui G Orthogonal targeting of osteoclasts and myeloma cells for radionuclide stimulated dynamic therapy induces multidimensional cell death pathways Theranostics 2021 11 16 7735 7754 34335961 10.7150/thno.60757 PMC8315072 13 Ruggiero A Holland JP Lewis JP Grimm J Cerenkov luminescence imaging of medical isotopes J Nucl Med 2010 51 7 1123 30 20554722 10.2967/jnumed.110.076521 PMC3068779 14 Zhang Y Hao Y Chen S Xu M Photodynamic Therapy of Cancers With Internal Light Sources: Chemiluminescence, Bioluminescence, and Cerenkov Radiation Front Chem 2020 8 770 33088801 10.3389/fchem.2020.00770 PMC7500165 15 Duan D Liu H Xu Y Han Y Xu M Zhang Z Activating TiO2 Nanoparticles: Gallium-68 Serves as a High-Yield Photon Emitter for Cerenkov-Induced Photodynamic Therapy ACS Appl Mater Interfaces 2018 10 6 5278 5286 29368518 10.1021/acsami.7b17902 16 Zhang Y Hong H Cai W PET tracers based on Zirconium-89 Curr Radiopharm 2011 4 2 131 9 22191652 10.2174/1874471011104020131 PMC3246366 17 Caserta E Chea J Minnix M Poku EK Viola D Vonderfecht S Copper 64-labeled daratumumab as a PET/CT imaging tracer for multiple myeloma Blood 2018 131 7 741 745 29301755 10.1182/blood-2017-09-807263 PMC5814935 18 Linsebigler AL Lu G Yates Jr JT Photocatalysis on TiO2 surfaces: principles, mechanisms, and selected results Chem Rev 1995 95 3 735 758 19 Gatter KC Brown G Trowbridge IS Woolston RE Mason DY Transferrin receptors in human tissues: their distribution and possible clinical relevance J Clin Pathol 1983 36 5 539 45 6302135 10.1136/jcp.36.5.539 PMC498283 20 Mateos MV Oriol A Martinez-Lopez J Gutierrez N Teruel AI de Paz R Bortezomib, melphalan, and prednisone versus bortezomib, thalidomide, and prednisone as induction therapy followed by maintenance treatment with bortezomib and thalidomide versus bortezomib and prednisone in elderly patients with untreated multiple myeloma: a randomised trial Lancet Oncol 2010 11 10 934 41 20739218 10.1016/S1470-2045(10)70187-X 21 Kouroukis TC Baldassarre FG Haynes AE Imrie K Reece DE Cheung MC Bortezomib in multiple myeloma systematic review and clinical considerations Curr Oncol 2014 21 4 573 603 10.3747/co.21.1798 PMC4117625 25089109 22 Ishii T Seike T Nakashima T Juliger S Maharaj L Soga S Anti-tumor activity against multiple myeloma by combination of KW-2478, an Hsp90 inhibitor, with bortezomib Blood Cancer J 2012 2 4 68 10.1038/bcj.2012.13 PMC3346683 22829970 23 Boccadoro M Morgan G Cavenagh J Preclinical evaluation of the proteasome inhibitor bortezomib in cancer therapy Cancer Cell Int 2005 5 1 18 15929791 10.1186/1475-2867-5-18 PMC1164423 24 Zeglis BM Lewis JS The bioconjugation and radiosynthesis of 89Zr-DFO-labeled antibodies J Vis Exp 2015 96 52521 25741890 10.3791/52521 PMC4354640 25 Greenstein S Krett NL Kurosawa Y Ma C Chauhan D Hideshima T Characterization of the MM.1 human multiple myeloma (MM) cell lines: a model system to elucidate the characteristics, behavior, and signaling of steroid-sensitive and -resistant MM cells Exp Hematol 2003 31 4 271 82 12691914 10.1016/s0301-472x(03)00023-7 26 Lokhorst HM Plesner T Laubach JP Nahi H Gimsing P Hansson M Targeting CD38 with Daratumumab Monotherapy in Multiple Myeloma N Engl J Med 2015 373 13 1207 19 26308596 10.1056/NEJMoa1506348 27 Blade J Beksac M Caers J Jurczyszyn A von Lilienfeld-Toal M Moreau P Extramedullary disease in multiple myeloma: a systematic literature review Blood Cancer J 2022 12 3 45 35314675 10.1038/s41408-022-00643-3 PMC8938478 28 Lü S Wang J The resistance mechanisms of proteasome inhibitor bortezomib Biomark Res 2013 1 1 13 24252210 10.1186/2050-7771-1-13 PMC4177604 29 Pérez-Galán P Roué GI Villamor N Montserrat E Campo E Colomer D The proteasome inhibitor bortezomib induces apoptosis in mantle-cell lymphoma through generation of ROS and Noxa activation independent of p53 status Blood 2006 107 1 257 264 16166592 10.1182/blood-2005-05-2091 30 Sonneveld P Management of multiple myeloma in the relapsed/refractory patient Hematology Am Soc Hematol Educ Program 2017 1 508 517 29222299 10.1182/asheducation-2017.1.508 PMC6142583 31 Song IS Kim HK Lee SR Jeong SH Kim N Ko KS Mitochondrial modulation decreases the bortezomib-resistance in multiple myeloma cells Int J Cancer 2013 133 6 1357 1367 23463417 10.1002/ijc.28149 32 Song IS Jeong YJ Jeong SH Heo HJ Kim HK Lee SR Combination treatment with 2-methoxyestradiol overcomes bortezomib resistance of multiple myeloma cells Exp Mol Med 2013 45 10 e50 e50 24158003 10.1038/emm.2013.104 PMC3809360 33 Dima D Jiang D Singh DJ Hasipek M Shah HS Ullah F Multiple Myeloma Therapy: Emerging Trends and Challenges Cancers (Basel) 2022 14 17 4082 36077618 10.3390/cancers14174082 PMC9454959 34 Nakamura Y Nagaya T Sato K Okuyama S Ogata F Wong K Cerenkov Radiation-Induced Photoimmunotherapy with 18 J Nucl Med 2017 58 9 1395 1400 28408528 10.2967/jnumed.116.188789 PMC5577626 35 Kang L Li C Rosenkrans ZT Huo N Chen Z Ehlerding EB CD38-Targeted Theranostics of Lymphoma with (89)Zr/(177)Lu-Labeled Daratumumab Adv Sci (Weinh) 2021 8 10 2001879 34026426 10.1002/advs.202001879 PMC8132161 36 Saltarella I Desantis V Melaccio A Solimando AG Lamanuzzi A Ria R Mechanisms of Resistance to Anti-CD38 Daratumumab in Multiple Myeloma Cells 2020 9 1 167 31936617 10.3390/cells9010167 PMC7017193 37 Painuly U Kumar S Efficacy of bortezomib as first-line treatment for patients with multiple myeloma Clin Med Insights Oncol 2013 7 53 73 23492937 10.4137/CMO.S7764 PMC3588852 38 Tang R Zheleznyak A Mixdorf M Ghai A Prior J Black KCL Osteotropic Radiolabeled Nanophotosensitizer for Imaging and Treating Multiple Myeloma ACS Nano 2020 14 4 4255 4264 32223222 10.1021/acsnano.9b09618 PMC7295119 39 Egbulefu C Black K Su X Karmakar P Habimana-Griffin L Sudlow G Induction of complementary immunogenic necroptosis and apoptosis cell death pathways inhibits cancer metastasis and relapse Res Sq 2024 [Preprint, rs.3.rs-3992212. doi: 10.21203/rs.3.rs-3992212/v1] Figure 1 Synthesis and characterization of TiO 2 -Tf-TC nanoparticles 2 2 2 Figure 2 Expression of targeted biomarkers and cellular activity of NPs. 2 2 2 Figure 3 Schematic representation of RaST regimen. 2 89 89 2 89 Figure 4 In vivo 89 89 2 89 Figure 5 In vivo Fig S4 89 2 Figure 6 Histologic comparison 10X (original magnification X 100) of bone marrow involvement by MM cells (green arrows) in untreated and treated cohorts by H&E (A-F), corresponding CD138 (G-L). 89 ",
  "metadata": {
    "Title of this paper": "Induction of complementary immunogenic necroptosis and apoptosis cell death pathways inhibits cancer metastasis and relapse",
    "Journal it was published in:": "Theranostics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486394/"
  }
}