{
  "title": "Paper_558",
  "abstract": "pmc Toxins (Basel) Toxins (Basel) 1577 toxins toxins Toxins 2072-6651 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474486 PMC12474486.1 12474486 12474486 41003523 10.3390/toxins17090460 toxins-17-00460 1 Article Short-Term Effects of Dietary Selenomethionine Supplementation on Hepatic and Renal Transcriptomic Alterations Induced by Ochratoxin a in Broiler Chickens https://orcid.org/0000-0002-7891-9477 Kövesi Benjamin Conceptualization Methodology Investigation Writing – original draft Writing – review & editing 1 2 * Kulcsár Szabina Conceptualization Methodology Investigation 1 2 Ancsin Zsolt Investigation 1 https://orcid.org/0000-0003-2928-3545 Erdélyi Márta Investigation 1 Zándoki Erika Investigation 1 Tóth Márk Investigation 1 Gömbös Patrik Investigation 3 Freiler-Nagy Ágnes Investigation 4 https://orcid.org/0000-0002-9435-4568 Balogh Krisztián Conceptualization Methodology Investigation Writing – original draft 1 2 https://orcid.org/0000-0003-2323-833X Mézes Miklós Conceptualization Writing – original draft Writing – review & editing Supervision 1 2 * 1 2 3 4 * kovesi.benjamin@uni-mate.hu mezes.miklos@uni-mate.hu 12 9 2025 9 2025 17 9 497674 460 11 8 2025 31 8 2025 10 9 2025 12 09 2025 28 09 2025 28 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Ochratoxin A (OTA), a mycotoxin commonly found in poultry feed, induces oxidative stress and disrupts redox homeostasis in vital organs such as the liver and kidneys. Selenium (Se), an essential trace element, may mitigate OTA-induced toxicity by supporting the antioxidant defense systems. This study investigated the short-term effects of dietary selenomethionine (SeMet) supplementation on OTA-induced oxidative and transcriptional responses in broiler chickens. Fifty-four 3-week-old birds were fed diets containing 2 mg/kg OTA, a target supplementation of 0.5 mg/kg Se (measured as 0.59 mg/kg as SeMet), or a combination of the two for five days. Liver and kidney samples were collected on Days 1 and 5 for biochemical and gene expression analyses. Exposure to OTA significantly modulated the expression of redox-sensitive transcription factors ( NRF2 KEAP1 GPX3 GPX4 SELK AHR AHRR CYP1A2 NRF2 CYP1A2 ochratoxin A selenomethionine oxidative stress glutathione redox system aryl hydrocarbon receptor Ministry for Culture and Innovation from the source of the National Research, Development and Innovation EKÖP-MATE/2024/25/K Supported by the EKÖP-MATE/2024/25/K university research scholarship Program of the Ministry for Culture and Innovation from the source of the National Research, Development and Innovation Fund. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Key Contribution This study demonstrates that dietary selenomethionine supplementation can partially attenuate ochratoxin A-induced oxidative stress in broiler chickens by modulating redox-sensitive transcription factors (NRF2/KEAP1) in kidneys and detoxification pathways (AHR/AHRR) in liver. It highlights tissue-specific responses and provides insight into the early molecular mechanisms of OTA toxicity and selenium’s protective role. 1. Introduction Mycotoxins remain a significant challenge in poultry production, with ochratoxin A (OTA) being recognized as one of the most persistent and toxic contaminants. Produced by Aspergillus Penicillium 1 2 OTA has been shown to alter the redox balance of the liver and kidneys by modulating key transcription factors and detoxification enzymes. In primary human hepatocytes, OTA was found to increase AhR 3 4 AHR NRF2 In vivo findings support these results. Lee et al. [ 5 NRF2 AHR 6 Despite regulatory limits in the EU (0.1 mg/kg feed for poultry; Commission Recommendation 2006/576/EC, amended 2016/1319/EC), OTA contamination remains a recurring problem. The most recent global survey by DSM-Firmenich (Satigny, Switzerland) [ 7 8 Selenium (Se) is an essential trace element that becomes biologically active when incorporated into selenoproteins, which are particularly involved in redox regulation and antioxidant defense. Among them, selenium-dependent glutathione peroxidases (GPxs), catalyze the reduction of hydrogen and lipid peroxides using reduced glutathione (GSH). supported by glutathione reductase (GSR), which maintains intracellular redox balance [ 9 10 11 12 HO-1 GPx MnSOD NRF2 CASPASE-3 BAX Despite the growing body of evidence regarding the redox- and xenobiotic-disrupting effects of OTA, the early transcriptional responses in poultry following short-term exposure remain poorly characterized. Furthermore, while the protective role of selenium has been investigated in chronic settings, its influence on the initial activation of redox-sensitive transcription factors, particularly the NRF2/KEAP1 and AHR/AHRR pathways, has not been comprehensively studied in poultry. Therefore, the aim of the study was to assess whether dietary supplementation with selenomethionine could mitigate the early oxidative and inflammatory effects of OTA in the liver and kidneys of broiler chickens after 5 days of exposure. Our focus was on the expression of glutathione-related antioxidant enzymes and transcription factors involved in redox and xenobiotic signaling in order to gain better understanding of the potential protective properties of selenium against OTA-induced toxicity. 2. Results 2.1. Clinical Findings Throughout the study, no clinical signs of toxicity or mortality were observed in any of the experimental groups. Furthermore, body weight and the relative weights of the liver and kidneys remained unaffected, with no statistically significant differences detected between groups. 2.2. Effects of Se and OTA on Hepatic and Renal GSH Content and GPx Activity On Day 1, the glutathione (GSH) content of the 10,000 g supernatant fraction of liver homogenates was significantly lower in the OTA+SeMet group than in the SeMet and OTA groups ( p Figure 1 p Figure 1 p Figure 1 Figure 1 2.3. Gene Expression Changes in Liver Tissue Significant changes in were also observed in response to OTA, selenomethionine, and the two substances combined, as analyzed in liver tissue samples collected on Day 1 and 5. 2.3.1. Oxidative Stress and Antioxidant Genes On Day 1, NRF2 p NRF2 p Figure 2 KEAP1 p Figure 2 GPX3 p Figure 3 GPX4 p p Figure 3 On Day 1, GSS p GSS Figure 4 GSR GSS p GSR Figure 4 SELK p SELK Figure 5 2.3.2. Detoxification Markers AHR p AHR Figure 6 AHRR p AHRR Figure 6 CYP1A2 p CYP1A2 Figure 7 A summary of the gene expression changes observed in liver tissue is provided in Table 1 2.4. Gene Expression Changes in Kidney Tissue The expression of genes involved in oxidative stress and detoxification was analyzed in kidney tissue samples taken on Day 1 and Day 5 following dietary exposure to ochratoxin A (OTA; 2 mg/kg feed), selenomethionine (SeMet; 0.5 mg/kg feed), or a combination of the two. 2.4.1. Oxidative Stress and Antioxidant Genes NRF2 p NRF2 Figure 8 KEAP1 p Figure 8 GPX3 p Figure 9 GPX4 p GPX4 Figure 9 GSS p GSS GSS Figure 10 GSR p Figure 10 SELK p SELK SELK p Figure 11 2.4.2. Detoxification Markers AHR p Figure 12 AHRR p Figure 12 CYP1A2 p Figure 13 A summary of the gene expression changes observed in kidney tissue is provided in Table 2 3. Discussion Contamination of poultry feed with mycotoxins, particularly ochratoxin A (OTA), remains a significant challenge in both intensive and small-scale poultry production. This is due to the widespread presence of OTA in cereal-based feeds and its remarkable stability during processing and storage [ 8 13 14 15 16 11 12 17 10 3.1. Oxidative Stress Response Pathway The results showed that exposure to OTA and SeMet supplementation activated the NRF2/KEAP1 redox sensitive pathway [ 18 NRF2 NRF2 16 KEAP1 NRF2 KEAP1 19 20 The expression of the GPX3 GPX4 21 22 GPX3 GPX4 GPX3 GPX3 GPX4 Reduced glutathione (GSH) is a cofactor of glutathione peroxidases [ 22 GSS 23 GSS GPX3 GPX4 24 GSR Selenoprotein K is a membrane- bound, selenium-containing protein that plays an important role in protecting against endoplasmic reticulum stress induced by oxidative stress [ 25 SELK SELK SELK SELK 3.2. Detoxification Pathway The first step in the detoxification pathway is the binding of a xenobiotic, such as OTA, to the aryl hydrocarbon receptor (AHR). The activity and nuclear translocation of the AHR are tightly regulated by the aryl hydrocarbon receptor repressor (AHRR), which acts as a negative regulator of AHR signaling via a feedback mechanism [ 26 AHR AHR AHRR AHRR AHRR AHRR AHRR AHRR 27 Cytochromes, such as CYP1A2 are required for xenobiotic transformation, and their gene expression and activity are activated by the AHR pathway [ 28 CYP1A2 AHR AHRR. CYP1A2 AHR 4. Conclusions In conclusion, OTA induces oxidative stress in both the liver and kidneys, but the signaling pathways differ. In the liver, both the NRF2/KEAP1 and AHR/AHRR/cytochrome pathways are activated. In contrast, the AHR/AHRR/cytochrome pathway showed only moderate activation in the kidneys. Although selenomethionine supplementation activates the glutathione redox and xenobiotic transformation systems, changes in gene expression show that it does not fully counteract the effects of OTA. Future studies should extend the exposure period and integrate histopathological assessments. Furthermore, they should also explore whether dietary selenium supplementation could be translated into practical feed strategies to reduce the epidemiological risk of ochratoxin A in poultry production. 5. Materials and Methods 5.1. Animals and Treatments A total of 54 three-week-old Cobb cockerels were used in the experiment. Of these, 6 birds served as an absolute control for the gene expression study and did not receive any experimental diet. The remaining 48 birds were randomly allocated into four exposure groups ( n The short-term OTA exposure trial lasted for 5 days. This period was chosen based on our previous protocol in order to investigate the early molecular responses to OTA and selenium supplementation, before any aging-related physiological changes could interfere with the results. At 20 days of age, prior to allocation, all birds were weighed individually to ensure uniformity. The average initial body weight was 783.31 ± 82.08 g, with no more than a 5% difference in mean body weight across groups. The experimental groups were as follows: Control: basal diet with no OTA contamination or selenium supplementation; Selenomethionine (SeMet): basal diet supplemented with 0.5 mg/kg selenium as selenomethionine (Selisseo ® At each time point (Day 1 and Day 5), six animals per group were euthanized via cervical dislocation. Liver and kidney samples were immediately collected, frozen in liquid nitrogen, and stored at −80 °C until further analysis for biochemical parameters and gene expression. The basal diet contained 88.76% dry matter, 21.25% crude protein, 4.25% crude fiber, 1.10% calcium, 1.12% lysine, 0.38% methionine, 0.89% methionine + cysteine, 0.48% available phosphorus, 0.25% sodium, and 12.66 MJ/kg metabolizable energy. The diet excluded mycotoxin binders and coccidiostats. The guidelines set by the European Communities Council Directive (86/609 EEC) were followed during the experiment. The protocol was approved by the Animal Welfare Committee of the Hungarian University of Agriculture and Life Sciences (MKK-TAKT-003/2019, 27 February 2019). 5.2. Mycotoxin Production Ochratoxin A was produced by artificial inoculation of sterile ground corn substrate with Aspergillus albertensis OTA levels in the feed were confirmed using QuEChERS extraction (performed in triplicate), followed by liquid chromatography–mass spectrometry (LC-MS) analysis using a Shimadzu LCMS-2020 system (Shimadzu, Kyoto, Japan). The predicted and analytically confirmed OTA concentrations in the feed are presented in Table 3 5.3. Determination of Selenium Concentration in Feed Reagents of trace analytical grade were employed throughout the sample preparation procedure. Hydrogen peroxide (30 m/m%, AnalaR NORMAPUR), nitric acid (69 m/m%, Aristar), hydrochloric acid (37 m/m%, Aristar), and ethanol (AnalaR NORMAPUR) were sourced from VWR International Ltd. (Lutterworth, Leicestershire, UK). Ultrapure water with a resistivity of 18.2 MΩ/cm was generated using a Purite Select Fusion 160 BP purification unit (SUEZ Water Technologies and Solutions, Trevose, PA, USA). To calibrate the inductively coupled plasma mass spectrometer (ICP-MS) (Perkin Elmer, Waltham, MA, USA), a multi-element calibration standard (Instrument Calibration Standard 2, TruQms; PerkinElmer, Shelton, CT, USA) was utilized. Internal standards were introduced through the Internal Standard Mix (TruQms); both standards were supplied by Perkin Elmer Inc. (Waltham, MA, USA). A hay powder reference material (BCR-129) obtained from Merck KGaA (Darmstadt, Germany) was used to prepare the quality control samples. The argon gas employed had a purity grade of 4.8 and was provided by Messer Hungarogaz Ltd. (Budapest, Hungary). Each sample, weighing 0.5 g, was placed into a CEM MARS XPreSS Teflon digestion vessel (CEM Corporation, Matthews, NC, USA) and combined with 5 mL of hydrogen peroxide and 5 mL of nitric acid. The mixture was subjected to microwave-assisted digestion using a CEM MARS6 system (CEM Corporation, Matthews, NC, USA) with the following settings: ramp duration of 35 min, final temperature of 200 °C, hold time of 50 min, microwave power of 1700 W, across 40 vessels. Upon completion of the digestion process, the contents were transferred and rinsed into 50 mL polypropylene (PP) tubes (Deltalab, Rubí, Barcelona, Spain). The final volume was adjusted to 25 mL with deionized water, then diluted fivefold in 12 mL PP tubes (Deltalab, Rubí, Barcelona, Spain) using the same water quality. Prior to ICP-MS analysis, each sample was spiked with 0.4 mL of ethanol and 100 µL of an internal standard solution, containing bismuth (Bi), germanium (Ge), and indium (In) at 1 µg/mL concentration. Quality control and blank samples were prepared identically. Between digestion runs, the Teflon vessels were cleaned with 0.15 M hydrochloric acid solution. Elemental quantification was performed using a Perkin Elmer NEXION 2000 ICP-MS instrument (Perkin Elmer, Waltham, MA, USA) operated in helium KED mode. The following instrumental settings were applied: solid-state RF generator at 34.5 MHz (LumiCoil, free running), RF power of 1600 W, Meinhard Plus quartz nebulizer (type C, low internal volume), plasma gas flow rate of 15 L/min, auxiliary gas flow rate of 1.2 L/min, and nebulizer gas flow rate of 1.06 L/min. The helium cell gas flow was set to 5.6 mL/min (low) and 6.7 mL/min (high). Table 4 Table 3 5.4. Measurement of Reduced Glutathione Content and Glutathione Peroxidase Activity The liver and kidney samples (0.4 g) were homogenized in physiological saline (0.65% ( w v 29 30 31 5.5. Total RNA Extraction and Reverse Transcription Total RNA was extracted from liver and kidney tissues (10 mg) using NucleoZOL reagent (Macherey-Nagel, Düren, Germany), following the manufacturer’s instructions. Residual genomic DNA was removed by treatment with DNase I (Thermo Fisher Scientific, San Jose, CA, USA). RNA concentration and purity were assessed using a NanoPhotometer (Implen, Munich, Germany), and samples with A260/A280 ratios > 2.0 were considered acceptable for downstream analysis. RNA integrity was verified via electrophoresis on a 1.5% agarose gel. Subsequently, 1 µg of high-quality RNA was reverse transcribed into complementary DNA (cDNA) using the High-Capacity cDNA Reverse Transcription Kit (Thermo Fisher Scientific), according to the manufacturer’s protocol. 5.6. Quantitative Real-Time Polymerase Chain Reaction Quantitative real-time PCR (qPCR) was performed on a StepOnePlus™ Real-Time PCR System (Applied Biosystems™, Foster City, CA, USA) using PowerUp™ SYBR™ Green Master Mix (Thermo Fisher Scientific). Each 10 µL reaction contained 5.0 µL SYBR Green Master Mix, 0.2 µL each of forward and reverse primers (10 µM), 1.6 µL cDNA template, and 3.0 µL nuclease-free water. A touchdown qPCR (TqPCR) protocol, adapted from Zhang et al. [ 32 Initial activation: 50 °C for 2 min, 95 °C for 10 min. Touchdown cycling: 4 cycles of 95 °C for 15 s, 64 °C for 30 s (decreasing 2 °C per cycle), and 72 °C for 30 s. Amplification: 36 cycles of 95 °C for 15 s, 58 °C for 30 s, 72 °C for 30 s. Melt curve: 95 °C for 15 s, 60 °C for 1 min, 95 °C for 15 s. Each reaction was performed in triplicate and no-template controls (NTC) as well as reverse transcription minus (−RT) controls were included in each run to exclude contamination and genomic DNA amplification. Specificity was confirmed via melt-curve analysis. Primer efficiency (E) was calculated from the slope of standard curves generated using fivefold serial dilutions of pooled cDNA, using the formula: E = [10^(−1/slope) − 1] × 100% [ 33 GAPDH β-actin RPL13 2 34 Table 5 5.7. Statistical Analysis All data are expressed as means ± standard deviation (SD). Normality was assessed using the Shapiro–Wilk test, while Bartlett’s and Brown–Forsythe tests were used to assess homogeneity of variance. One-way analysis of variance (ANOVA) was performed using GraphPad Prism v9.0 (GraphPad Software, San Diego, CA, USA), followed by Tukey’s post hoc test for multiple comparisons. Differences were considered statistically significant at p Acknowledgments This work was supported by the Research Excellence Program of the Hungarian University of Agriculture and Life Sciences. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, B.K., S.K., M.M. and K.B.; methodology, B.K., S.K., and K.B.; investigation, B.K., S.K., K.B., E.Z., Z.A., M.E., P.G., M.T. and Á.F.-N.; original draft preparation, B.K., M.M. and K.B.; review and editing, B.K. and M.M.; supervision, M.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The guidelines set by the European Communities Council Directive (86/609 EEC) were followed during the experiment. The experimental protocol was approved by the Animal Welfare Committee of the Hungarian University of Agriculture and Life Science (MKK-TAKT-003/2019, 27 February 2019). Data Availability Statement The data presented in this study are available on request from the corresponding author. The data are not publicly available due to ongoing related research and institutional data management policies. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: OTA Ochratoxin A Se Selenium SeMet Selenomethionine ROS Reactive Oxygen Species RNS Reactive Nitrogen Species GSH Reduced Glutathione GPx Glutathione Peroxidase GPX3/GPX4 Glutathione Peroxidase 3/4 GSS Glutathione Synthetase GSR Glutathione Reductase NRF2 Nuclear Factor Erythroid 2–Related Factor 2 KEAP1 Kelch-like ECH-Associated Protein 1 AHR Aryl Hydrocarbon Receptor AHRR Aryl Hydrocarbon Receptor Repressor CYP1A2 Cytochrome P450 1A2 qPCR Quantitative Polymerase Chain Reaction ER Endoplasmic Reticulum SELK Selenoprotein K MDA Malondialdehyde ICR Institute of Cancer Research (refers to mouse strain) References 1. Ding L. Han M. Wang X. Guo Y. Ochratoxin A: Overview of Prevention, Removal, and Detoxification Methods Toxins 2023 15 565 10.3390/toxins15090565 37755991 PMC10534725 2. Han Z. Zhang Y. Wang C. Liu X. Jiang A. Liu Z. Wang J. Yang Z. Wei Z. Ochratoxin A-Triggered Chicken Heterophil Extracellular Traps Release through Reactive Oxygen Species Production Dependent on Activation of NADPH Oxidase, ERK, and p38 MAPK Signaling Pathways J. Agric. Food Chem. 2019 67 11230 11235 10.1021/acs.jafc.9b03155 31523955 3. Ayed-Boussema I. Pascussi J.M. Zaied C. Maurel P. Bacha H. Hassen W. Ochratoxin A Induces CYP3A4, 2B6, 3A5, 2C9, 1A1, and CYP1A2 Gene Expression in Primary Cultured Human Hepatocytes: A Possible Activation of Nuclear Receptors Drug Chem. Toxicol. 2012 35 71 80 10.3109/01480545.2011.589438 21834667 4. Shin H.S. Lee H.J. Pyo M.C. Ryu D. Lee K.W. Ochratoxin A-Induced Hepatotoxicity through Phase I and Phase II Reactions Regulated by AhR in Liver Cells Toxins 2019 11 377 10.3390/toxins11070377 31261931 PMC6669489 5. Lee H.J. Pyo M.C. Shin H.S. Ryu D. Lee K.W. Renal Toxicity through AhR, PXR, and Nrf2 Signaling Pathway Activation of Ochratoxin A-Induced Oxidative Stress in Kidney Cells Food Chem. Toxicol. 2018 122 59 68 10.1016/j.fct.2018.10.004 30291945 6. Kövesi B. Worlanyo A.P. Kulcsár S. Ancsin Z. Erdélyi M. Zándoki E. Mézes M. Balogh K. Curcumin Mitigates Ochratoxin A-Induced Oxidative Stress and Alters Gene Expression in Broiler Chicken Liver and Kidney Acta Vet. Hung. 2024 72 41 50 10.1556/004.2024.01016 38536404 7. DSM-Firmenich World Mycotoxin Survey 2024 Available online: https://www.dsm-firmenich.com/content/dam/dsm/anh/en/documents/REP_MTXsurvey_Q4_0525_63898.pdf (accessed on 30 August 2025) 8. Bonerba E. Manfredi A. Dimuccio M.M. Lorusso P. Pandiscia A. Terio V. Di Pinto A. Panseri S. Ceci E. Bozzo G. Ochratoxin A in Poultry Supply Chain: Overview of Feed Occurrence, Carry-Over, and Pathognomonic Lesions in Target Organs to Promote Food Safety Toxins 2024 16 487 10.3390/toxins16110487 39591242 PMC11598023 9. Flohé L. Toppo S. Orian L. The Glutathione Peroxidase Family: Discoveries and Mechanism Free Radic. Biol. Med. 2022 187 113 122 10.1016/j.freeradbiomed.2022.05.003 35580774 10. Ren Z. He H. Fan Y. Chen C. Zuo Z. Deng J. Research Progress on the Toxic Antagonism of Selenium Against Mycotoxins Biol. Trace Elem. Res. 2019 190 273 280 10.1007/s12011-018-1532-6 30267312 11. Li P. Li K. Zou C. Tong C. Sun L. Cao Z. Yang S. Lyu Q. Selenium Yeast Alleviates Ochratoxin A-Induced Hepatotoxicity via Modulation of the PI3K/AKT and Nrf2/Keap1 Signaling Pathways in Chickens Toxins 2020 12 143 10.3390/toxins12030143 32106596 PMC7150738 12. Li K. Cao Z. Guo Y. Tong C. Yang S. Long M. Li P. He J. Selenium Yeast Alleviates Ochratoxin A-Induced Apoptosis and Oxidative Stress via Modulation of the PI3K/AKT and Nrf2/Keap1 Signaling Pathways in the Kidneys of Chickens Oxid. Med. Cell Longev. 2020 2020 4048706 10.1155/2020/4048706 32148649 PMC7053478 13. Longobardi C. Ferrara G. Andretta E. Montagnaro S. Damiano S. Ciarcia R. Ochratoxin A and Kidney Oxidative Stress: The Role of Nutraceuticals in Veterinary Medicine—A Review Toxins 2022 14 398 10.3390/toxins14060398 35737059 PMC9231272 14. Brigelius-Flohé R. Flohé L. Selenium and Redox Signaling Arch. Biochem. Biophys. 2017 617 48 59 10.1016/j.abb.2016.08.003 27495740 15. Schrauzer G.N. Selenomethionine: A Review of Its Nutritional Significance, Metabolism and Toxicity J. Nutr. 2000 130 1653 1656 10.1093/jn/130.7.1653 10867031 16. Tahir M.A. Abbas A. Muneeb M. Bilal R.M. Hussain K. Abdel-Moneim E.E. Farag M.R. Dhama K. Elnesr S.S. Alagawany M. Ochratoxicosis in Poultry: Occurrence, Environmental Factors, Pathological Alterations and Amelioration Strategies World’s Poult. Sci. J. 2022 78 727 749 10.1080/00439339.2022.2090887 17. Tian W. Fan R. Zhou S. Liu T. Wang Y. Sun Y. Long M. Yang S. Li P. Selenomethionine Alleviates OTA-Induced Kidney Injury in Broilers by Modulating Ferroptosis Front. Vet. Sci. 2025 12 1651205 10.3389/fvets.2025.1651205 40901063 PMC12400679 18. Baird L. Yamamoto M. The Molecular Mechanisms Regulating the KEAP1-NRF2 Pathway Mol. Cell Biol. 2020 40 e00099-20 10.1128/MCB.00099-20 32284348 PMC7296212 19. Iso T. Suzuki T. Baird L. Yamamoto M. Absolute Amounts and Status of the Nrf2-Keap1-Cul3 Complex within Cells Mol. Cell Biol. 2016 36 3100 3112 10.1128/MCB.00389-16 27697860 PMC5126296 20. Kobayashi A. Kang M.I. Watai Y. Tong K.I. Shibata T. Uchida K. Yamamoto M. Oxidative and Electrophilic Stresses Activate Nrf2 through Inhibition of Ubiquitination Activity of Keap1 Mol. Cell Biol. 2006 26 221 229 10.1128/MCB.26.1.221-229.2006 16354693 PMC1317630 21. Schwarz M. Löser A. Cheng Q. Wichmann-Costaganna M. Schädel P. Werz O. Arnér E.S. Kipp A.P. Side-by-Side Comparison of Recombinant Human Glutathione Peroxidases Identifies Overlapping Substrate Specificities for Soluble Hydroperoxides Redox Biol. 2023 59 102593 10.1016/j.redox.2022.102593 36608588 PMC9827380 22. Arthur J.R. The Glutathione Peroxidases Cell Mol. Life Sci. 2000 57 1825 1835 10.1007/PL00000664 11215509 PMC11147127 23. Njålsson R. Norgren S. Physiological and Pathological Aspects of GSH Metabolism Acta Paediatr. 2005 94 132 137 10.1111/j.1651-2227.2005.tb01878.x 15981742 24. Mannervik B. The Enzymes of Glutathione Metabolism: An Overview Biochem. Soc. Trans. 1987 15 717 718 10.1042/bst0150717 3315772 25. Fredericks G.J. Hoffmann P.R. Selenoprotein K and Protein Palmitoylation Antioxid. Redox Signal. 2015 23 854 862 10.1089/ars.2015.6375 26058750 PMC4589303 26. Larigot L. Juricek L. Dairou J. Coumoul X. AhR Signaling Pathways and Regulatory Functions Biochim. Open 2018 7 1 9 10.1016/j.biopen.2018.05.001 30003042 PMC6039966 27. Panda S.K. Peng V. Sudan R. Antonova A.U. Di Luccia B. Ohara T.E. Fachi J.L. Grajales-Reyes G.E. Jaeger N. Trsan T. Repression of the Aryl-Hydrocarbon Receptor Prevents Oxidative Stress and Ferroptosis of Intestinal Intraepithelial Lymphocytes Immunity 2023 56 797 812 10.1016/j.immuni.2023.01.023 36801011 PMC10101911 28. Nebert D.W. Dalton T.P. Okey A.B. Gonzalez F.J. Role of Aryl Hydrocarbon Receptor-Mediated Induction of the CYP1 Enzymes in Environmental Toxicity and Cancer J. Biol. Chem. 2004 279 23847 23850 10.1074/jbc.R400004200 15028720 29. Sedlak J. Lindsay R.H. Estimation of Total, Protein-Bound and Non-Protein Sulfhydryl Groups with Ellman’s Reagent Anal. Biochem. 1968 25 192 205 10.1016/0003-2697(68)90092-4 4973948 30. Lawrence R.A. Burk R.F. Glutathione Peroxidase Activity in Selenium-Deficient Rat Liver Biochem. Biophys. Res. Commun. 1976 71 952 956 10.1016/0006-291X(76)90747-6 971321 31. Lowry O.H. Rosebrough N.J. Farr A.L. Randall R.J. Protein Measurement with the Folin Phenol Reagent J. Biol. Chem. 1951 193 265 275 10.1016/S0021-9258(19)52451-6 14907713 32. Zhang Q. Wang J. Deng F. Yan Z. Xia Y. Wang Z. Ye J. Deng Y. Zhang Z. Qiao M. TqPCR: A Touchdown qPCR Assay with Significantly Improved Detection Sensitivity and Amplification Efficiency of SYBR Green qPCR PLoS ONE 2015 10 e0132666 10.1371/journal.pone.0132666 26172450 PMC4501803 33. Bustin S.A. Benes V. Garson J.A. Hellemans J. Huggett J. Kubista M. Mueller R. Nolan T. Pfaffl M.W. Shipley G.L. The MIQE Guidelines: Minimum Information for Publication of Quantitative Real-Time PCR Experiments Clin. Chem. 2009 55 611 622 10.1373/clinchem.2008.112797 19246619 34. Pfaffl M.W. A New Mathematical Model for Relative Quantification in Real-Time RT-PCR Nucleic Acids Res. 2001 29 e45 10.1093/nar/29.9.e45 11328886 PMC55695 Figure 1 Effect of 5 days of OTA and SeMet on GSH content and GPx activity in the 10,000 g supernatant fraction of liver ( A B n −1 −1 −1 −1 p Figure 2 Effect of 5 days of OTA and SeMet on the relative expression of NRF2 KEAP1 n −1 −1 −1 −1 p Figure 3 Effect of 5 days of OTA and SeMet on the relative expression of GPX3 GPX4 n −1 −1 −1 −1 p Figure 4 Effect of 5 days of OTA and SeMet on the relative expression of GSS GSR n −1 −1 −1 −1 p Figure 5 Effect of 5 days of OTA and SeMet on the relative expression of the SELK n −1 −1 −1 −1 p Figure 6 Effect of 5 days of OTA and SeMet on the relative expression of AHR AHRR n −1 −1 −1 −1 p Figure 7 Effect of 5 days of OTA and SeMet on the relative expression of the CYP1A2 n −1 −1 −1 −1 p Figure 8 Effect of 5 days of OTA and SeMet on the relative expression of NRF2 KEAP1 n −1 −1 −1 −1 p Figure 9 Effect of 5 days of OTA and SeMet on the relative expression of GPX3 GPX4 n −1 −1 −1 −1 p Figure 10 Effect of 5 days of OTA and SeMet on the relative expression of GSS GSR n −1 −1 −1 −1 p Figure 11 Effect of 5 days of OTA and SeMet on the relative expression of the SELK n −1 −1 −1 −1 p Figure 12 Effect of 5 days of OTA and SeMet on the relative expression of AHR AHRR n −1 −1 −1 −1 p Figure 13 Effect of 5 days of OTA and SeMet on the relative expression of the CYP1A2 n −1 −1 −1 −1 p toxins-17-00460-t001_Table 1 Table 1 Summary of gene expression changes in liver tissue of broiler chickens exposed to OTA and/or supplemented with SeMet.  Day 1 Day 5 Gene/Marker OTA Effect SeMet Effect OTA+SeMet Effect OTA Effect SeMet Effect OTA+SeMet Effect  NRF2 ↑ vs. Ctrl — ↑ vs. Ctrl ↑ (highest) ↑ ↑ (lower than OTA, higher than Ctrl)  KEAP1 — — — ↑ vs. Ctrl ↑ vs. Ctrl ↑ vs. Ctrl  GPX3 — ↑ ↑ ↑ (moderate) ↑ ↑ (similar to Se)  GPX4 — ↑ ↑ ↑ ↑ (highest) ↑  GSS ↓ ↓ ↓ ↓ ↑ — (restored to Ctrl)  GSR ↓ ↓ ↓ ↑ (but lower than Se and OTA+SeMet) ↑ ↑ (similar to Se)  SELK ↑ (moderate) ↑ ↑ ↑ ↑ — (no difference from Ctrl)  AHR ↑ — ↑ ↑ ↑ ↑  AHRR ↑ ↑ — (lower than both) ↓ ↑ ↑  CYP1A2 ↑ (highest) ↑ (lower than OTA) ↑ (lower than OTA) ↑ ↑ ↓ (lower than OTA and Ctrl) Symbols: ↑ upregulation, ↓ downregulation, — no significant change. toxins-17-00460-t002_Table 2 Table 2 Summary of gene expression changes in kidney tissue of broiler chickens exposed to OTA and/or supplemented with SeMet.  Day 1 Day 5 Gene/Marker OTA Effect SeMet Effect OTA+SeMet Effect OTA Effect SeMet Effect OTA+SeMet Effect  NRF2 — ↑ ↑ ↑ — — (restored to Ctrl)  KEAP1 ↓ ↓ ↓ ↓ — ↓  GPX3 — ↑ ↑ ↑ (moderate) ↑ ↑ (similar to Se)  GPX4 — — — ↓ — ↓  GSS ↓ ↑ ↓ ↓ ↑ — (restored to Ctrl)  GSR ↓ ↓ ↓ — ↑ —  SELK ↑ — — (restored to Ctrl) ↓ ↓ ↓  AHR ↑ (strong) — ↑↑ (stronger than OTA) ↑ — ↑  AHRR ↓ ↓ — ↑ ↑ — (no increase)  CYP1A2 ↓ — ↓ ↓ — ↓ Symbols: ↑ upregulation, ↓ downregulation, — no significant change, ↑↑ strong induction. toxins-17-00460-t003_Table 3 Table 3 Measured OTA and Se concentration in the complete feed. Group Measured Se (mg/kg) Measured OTA (mg/kg) Control 0.07 not detected SeMet 0.59 not detected OTA 0.07 2.04 ± 0.13 OTA+SeMet 0.59 2.09 ± 0.23 toxins-17-00460-t004_Table 4 Table 4 Measured isotope, internal standard and limit of detection. Element Isotope ( m z Internal Standard Isotope LOD (mg/kg) Selenium (Se) 78 Ge74 0.010 toxins-17-00460-t005_Table 5 Table 5 Primer sequences and parameters.  Genes GenBank Accession No. Primer Sequences, 5′-3′ Length, bp. Efficiency, % Endogenous control genes  GAPDH NM_204305.1 F-TGACCTGCCGTCTGGAGAAA 98 92.64  BAC NM_205518.2 F-GACGAGATTGGCATGGCTTTATTT 92 96.29  RPL13 NM_204999.2 F-GCTTAAACTGGCGGGCATTAAC 97 94.97 Nrf2-antioxidant pathway genes  KEAP1 KU321503.1 F-CATCGGCATCGCCAACTT 113 99.74  NRF2 NM_205117.1 F-TTTTCGCAGAGCACAGATAC 110 91.74  GPX3 NM_001163232.2 F-ATCCCCTTCCGAAAGTACGC 129 102.51  GPX4 NM_001346448.1 F-AGTGCCATCAAGTGGAACTTCAC 203 91.03  GSS XM_425692.6 F-GTACTCACTGGATGTGGGTGAAGA 196 104.84  GSR XM_015276627.2 F-CCACCAGAAAGGGGATCTACG 208 91.76  SELK NM_001025441.2 F-GAAGAGGGCCTCCAGGAAAT 84 103.89 AhR signaling pathway genes  AHR NM_204118.3 F-GAAGACGGGTGAGAGTGGAA 171 99.20  AHRR NM_001201387.2 F-AGAACGGCACCATGAGGAAG 73 99.86  CYP1A2 NM_205146.3 F-CATTACGGATGGGCAGAGTT 94 93.76 ",
  "metadata": {
    "Title of this paper": "A New Mathematical Model for Relative Quantification in Real-Time RT-PCR",
    "Journal it was published in:": "Toxins",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474486/"
  }
}