{
  "title": "Paper_286",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12489001 PMC12489001.1 12489001 12489001 41034425 10.1038/s41598-025-16436-0 16436 1 Article Functional characterization of dysregulated LncRNAs in BRCA and CESC highlights their role in cancer prognosis Sharma Madhur 1 Chourasia Nidhi 2 Priyanka Priyanka 3 Sarkar Debi Prasad 1 4 Nag Alo 1 Saxena Sandeep sandeepsaxena@mail.jnu.ac.in 2 1 https://ror.org/04gzb2213 grid.8195.5 0000 0001 2109 4999 Department of Biochemistry, University of Delhi South Campus, 2 https://ror.org/0567v8t28 grid.10706.30 0000 0004 0498 924X Jawaharlal Nehru University, 3 https://ror.org/0168r3w48 grid.266100.3 0000 0001 2107 4242 Cellular and Molecular Medicine, Department of Medicine, University of California San Diego, 4 https://ror.org/0036p5w23 grid.462384.f 0000 0004 1772 7433 Department of Biological Sciences and Engineering, Indian Institute of Technology, 1 10 2025 2025 15 478255 34265 1 2 2025 14 8 2025 01 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ This study examines the contribution of dysregulated long non-coding RNAs (lncRNAs) to disease progression and prognosis in breast invasive carcinoma (BRCA) and cervical squamous cell carcinoma with endocervical adenocarcinoma (CESC) using data from The Cancer Genome Atlas (TCGA). Comparative analyses identified both shared and cancer-specific lncRNAs linked to tumorigenesis. Survival analysis using the Kaplan–Meier method highlighted several candidates with prognostic relevance. Notably, FAM83H-AS1 showed increased expression in advanced stages of BRCA and was linked with lymph node involvement and metastatic status. Its elevated expression was associated with poor survival outcomes in both BRCA and CESC cohorts. In contrast, lncRNAs such as FGF14-AS2, which were downregulated, demonstrated links to tumor-suppressive mechanisms and improved survival in BRCA patients. Subcellular localization analysis indicated predominant cytoplasmic presence of FAM83H-AS1, implying possible roles in post-transcriptional regulation. To support our in-silico observations, we carried out qRT-PCR experiments in breast cancer cell lines with varying degrees of aggressiveness, which confirmed the differential expression patterns of these lncRNAs. Overall, our findings highlight the clinical importance of lncRNA dysregulation in gynaecological cancers and point to their potential utility as biomarkers for prognosis and targeted therapy. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-16436-0. Keywords Long non-coding RNA (long cRNA, ncRNA) Prognostic biomarkers BRCA and CESC Cancer transcriptomics and functional enrichment analysis Subject terms Cancer Cell biology https://doi.org/10.13039/501100001411 Indian Council of Medical Research 91/04/2020-TFGTR/BMS 91/04/2020-TFGTR/BMS 91/04/2020-TFGTR/BMS Sarkar Debi Prasad Nag Alo Saxena Sandeep pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction The availability of large-scale transcriptomic databases such as The Cancer Genome Atlas (TCGA) and The Atlas of Noncoding RNAs in Cancer (TANRIC) has significantly improved our understanding of cancer biology 1 2 3 Previous studies have applied bioinformatics-based approaches to explore the prognostic importance of lncRNAs. For example, HOTAIR was identified through TCGA and lncRNA-specific analysis platforms, showing its role in promoting metastasis and being linked to poor survival in breast cancer 4 5 6 7 8 9 10 11 Thus, lncRNAs are being explored for their potential clinical applications as biomarkers. For instance, HOTAIR and MALAT1 are being investigated as therapeutic targets and prognostic indicators in breast and cervical cancers 12 14 15 16 8 17 18 This study builds upon these findings by performing a systematic analysis of dysregulated lncRNAs in BRCA and CESC using TCGA and TANRIC datasets. We applied functional enrichment tools such as Enrichr and assessed subcellular localization using lncATLAS to identify key lncRNAs associated with patient prognosis 19 20 21 Results Dysregulated lncRNAs in TCGA-BRCA, TCGA-CESC To explore lncRNAs with shared prognostic potential across female-specific cancers, we focused our primary analysis on BRCA and CESC. Although these cancers originate from different epithelial tissues, they exhibit several common biological and clinical features, including hormone responsiveness, derivation from reproductive organs, and high incidence among women worldwide. Previous studies have shown that lncRNAs such as HOTAIR, MALAT1, and MEG3 exert conserved regulatory roles in both breast and cervical cancers, affecting metastasis, proliferation, and resistance to chemotherapy via pathways like epithelial-mesenchymal transition and p53 signalling. The presence of shared molecular alterations in BRCA and CESC supports the idea that a combined transcriptomic analysis may help identify lncRNAs with broader significance in gynaecologic oncology. Furthermore, both TCGA datasets include adequate numbers of tumour and normal samples, allowing for meaningful statistical comparisons. This approach enabled us to identify lncRNAs that are commonly dysregulated in both cancers, some of which also showed prognostic relevance, thereby justifying our strategy of analysing BRCA and CESC together. To elucidate the role of lncRNAs in gynaecological cancers, we carried out a comprehensive transcriptome analysis using TCGA datasets for TCGA-BRCA and TCGA-CESC. The workflow to identify dysregulated lncRNAs by comparing tumor and normal samples (Fig. 1 1 1 1 1 1  Fig. 1 Transcriptome analysis identifies dysregulated lncRNAs in gynaecological cancers: TCGA-BRCA and TCGA-CESC datasets. A B C p p p D C E C F C Downregulated LncRNAs in BRCA and CESC links to tumor-suppressive pathways and poor survival outcomes The Venn diagram illustrates the overlap between the BRCA and CESC datasets, identifying 68 shared downregulated lncRNAs (Fig. 2 2 2  Fig. 2 Functional analysis of downregulated lncRNAs in BRCA and CESC tumors. A B C High expression of downregulated LncRNAs in TCGA-BRCA tumors correlates with improved survival We carried out the Kaplan-Meier survival analysis of 49 downregulated lncRNAs in the BRCA and CESC datasets and based on the data, we concluded that two ENSG00000267047.1 and FGF14-AS2 lncRNAs were significantly correlated to survival in BRCA cancer. LncRNA ENSG00000267047.1 expression had a significant prognostic value in BRCA: Patients with high expression of ENSG00000267047.1 exhibit markedly better overall survival compared to those with low expression levels ( p 3  Fig. 3 Kaplan-Meier survival analysis displaying the estimated survival probability of BRCA patients. A p B p Patients with high expression of FGF14-AS2 in the BRCA dataset have significantly improved overall survival compared to the low-expression group ( p 3 p p 1 2 Functional analysis identifies the association of dysregulated lncRNAs with BRCA and CESC tumors The overlap between upregulated lncRNAs of the BRCA and CESC datasets is illustrated by Venn diagram, which identifies 50 shared upregulated lncRNAs (Fig. 4 4 4 4 4  Fig. 4 Functional analysis identifies the association of dysregulated lncRNAs with BRCA and CESC tumors. A B C D E FAM83H-AS1 expression correlates with breast cancer stages, nodal involvement, and metastasis Clinical data used in this analysis were downloaded from the National Cancer Institute’s Genomic Data Commons (GDC) data portal for TCGA BRCA, providing a robust and standardized dataset for evaluating the association between FAM83H-AS1 expression and breast cancer clinical parameters. The relative expression of FAM83H-AS1 was compared across pathological stages of breast cancer (Stage I, II, III, IV) (Fig. 5 p p 5 p 3  Fig. 5 Correlation of dysregulated lncRNA FAM83H-AS1 with disease progression, tumor burden, and metastatic potential in breast cancer . A B C D E p p p p Further, when comparing metastatic (M1) and non-metastatic (M0) cases across pathological stages, FAM83H-AS1 expression generally exhibited an upward trend with disease progression, particularly evident in Stage III. Although expression levels appeared lower in the metastatic Stage IV group compared to Stage III, this may be attributed to underlying biological variability. Notably, the mean expression values (depicted by dashed lines) closely reflected the pattern seen in Fig. 5 5 5 p p 5 FAM83H-AS1 is significantly upregulated in nodal metastasis but not in tumor progression in CESC The expression analysis of FAM83H-AS1 in breast cancer revealed a significant correlation with tumor progression, nodal metastasis, and tumor size, with notable upregulation in intermediate pathological stages, early nodal involvement, and larger tumors. However, its expression appeared to plateau in advanced stages, suggesting a potential saturation effect or increased variability in highly aggressive cases. Building upon these findings, the analysis in CESC aimed to determine whether a similar pattern of FAM83H-AS1 regulation exists across different cancer types. We evaluated the relative expression of FAM83H-AS1 across different nodal stages in CESC samples. A significant upregulation was observed when comparing N0 to N1, suggesting that FAM83H-AS1 may be more closely linked to lymphatic spread in CESC rather than primary tumor growth (Fig. 6 6  Fig. 6 Expression of FAM83H-AS1 in CESC across tumor stages and nodal involvement. A p p B 2 Prognostic relevance of FAM83H-AS1 in gynaecological cancer The Kaplan-Meier survival analysis demonstrates that high expression levels of FAM83H-AS1 are associated with significantly reduced overall survival in BRCA patients (Fig. 7 p  Fig. 7 Survival analysis of FAM83H-AS1 in BRCA and CESC patient groups. A p B p Similarly, in CESC patients, Kaplan-Meier survival analysis reveals a significant association between FAM83H-AS1 expression levels and overall survival (Fig. 7 p Experimental validation of FAM83H-AS1 and FGF14-AS2 expression across breast cancer cell lines of varying aggressiveness To experimentally validate the expression patterns of key prognostic lncRNAs identified in the TCGA-BRCA dataset, we assessed the expression of FAM83H-AS1 and FGF14-AS2 across a panel of breast cell lines representing varying levels of aggressiveness. MCF10A, MCF7, and MDA-MB-453 share an epithelial origin but differ in tumorigenic potential, with MCF10A being non-tumorigenic, MCF7 representing less aggressive luminal-type cancer, and MDA-MB-453 modelling a more aggressive HER2-positive phenotype. This panel offers a comparable cellular background while capturing a spectrum of breast cancer aggressiveness. FAM83H-AS1 expression was elevated in MDA-MB-453 cells relative to both MCF10A and MCF7 (Fig. 8 8  Fig. 8 Experimental validation of FAM83H-AS1 and FGF14-AS2 expression in breast cancer cell lines of differing aggressiveness. A B C D p p p Comparative analysis of dysregulated lncRNAs across BRCA, CESC, and OV identifies a prognostic marker in ovarian cancer To evaluate the relevance of lncRNAs identified in BRCA and CESC within ovarian cancer (OV), we extended our analysis to the TCGA-OV dataset. Due to the absence of normal controls and Stage I samples in this cohort, we compared Stage III/IV ( n n 4 4 4 p 4 Discussion In this study, we conducted a comprehensive transcriptome analysis using TCGA-BRCA and TCGA-CESC datasets to identify dysregulated lncRNAs. Differential expression analysis revealed that a large number of lncRNAs were dysregulated in both cancers. Comparative analyses identified several shared dysregulated lncRNAs, indicating the presence of common oncogenic and tumor-suppressive mechanisms in BRCA and CESC. Our methodology to screen the lncRNAs repressed in both BRCA and CESC datasets identified lncRNAs well-documented in the literature for their tumor-suppressive roles such as MAGI2-AS3, PCAT19, TRIM52-AS1, and MEG3 8 22 25 Several upregulated lncRNAs identified in our screen, such as CRNDE and TMPO-AS1, are known in the literature for their oncogenic roles. For instance, CRNDE has been implicated in promoting tumor growth, metabolic reprogramming, and poor prognosis in cancers, while TMPO-AS1 is associated with enhanced cell proliferation and invasion 26 27 5 6 Our findings also align with previous studies, where lncRNAs such as HOTAIR and MALAT1 were found to be strong predictors of survival and potential therapeutic targets in breast and cervical cancers 12 28 29 8 9 20 Functional enrichment analysis using Enrichr and STRING provided further insights into the biological pathways associated with the dysregulated lncRNAs. Pathways such as chromatin organization and apoptosis were significantly enriched, emphasizing the diverse roles of these lncRNAs in tumor progression 19 30 18 31 32 Moreover, identifying dysregulated lncRNAs offers an opportunity for personalized therapeutic approaches. For instance, the strong correlation between FAM83H-AS1 and poor survival outcomes suggests its potential as a therapeutic target, similar to how HOTAIR is being explored in preclinical models for targeted therapy 12 Methodology Data acquisition and processing Transcriptomic datasets for TCGA-BRCA and TCGA-CESC were obtained from The Cancer Genome Atlas (TCGA) and analyzed using the TANRIC (The Atlas of Noncoding RNAs in Cancer) platform. TANRIC provides pre-processed lncRNA expression data for over 12,000 annotated lncRNAs, quantified as log₂ (RPKM + 0.001) 1 Differential expression analysis was performed by computing the mean log₂-transformed expression of each lncRNA separately for the tumor and normal groups. Log₂ fold change (log₂FC) was calculated as the difference between these means, and the corresponding linear fold change (FC) was derived as FC = 2^log₂FC. A two-tailed unpaired Student’s t-test was applied to the log-transformed expression values to determine statistical significance. LncRNAs with FC ≥ 2 or ≤ 0.5 and p Identification of dysregulated LncRNAs Differentially expressed lncRNAs in BRCA and CESC were classified into upregulated and downregulated groups. A comparative analysis was carried out to identify shared and unique lncRNAs between the two cancers. The lncRNAs that showed high statistical significance and had known associations with cancer-related pathways were prioritized for further study. Among them, FAM83H-AS1, ENSG00000267047.1, and FGF14-AS2 were selected for their prognostic relevance and analyzed in greater detail. Functional enrichment analysis Functional enrichment analysis of the dysregulated lncRNAs was conducted using the Enrichr tool. Gene Ontology (GO) terms, disease networks, and tissue-specific regulatory elements associated with these lncRNAs were examined. Pathways related to tumor progression, including chromatin remodelling and apoptosis regulation, were emphasized. The analysis provided deeper insights into the molecular mechanisms by which these lncRNAs contribute to tumor development. Cytoplasmic-Nuclear localization analysis The cellular localization of selected lncRNAs was assessed using Cytoplasmic-Nuclear Relative Concentration Index (CN-RCI) data from lncATLAS. The localization patterns of FAM83H-AS1 were analyzed to understand their functional roles in tumor progression. The finding suggested that cytoplasmic localization was linked to post-transcriptional regulation. These insights helped in evaluating the potential therapeutic relevance of these lncRNAs. Visualization and Statistical Tools. Survival analysis Kaplan-Meier survival analysis was carried out to investigate the relationship between lncRNA expression levels and overall survival in BRCA and CESC patients. Patients were divided into high- and low-expression groups based on the median expression level of each lncRNA. The TANRIC platform was used to generate survival curves and integrate lncRNA expression data with clinical outcomes. Statistical significance was determined using the log-rank test ( p Visualization and statistical tools Heatmaps and box plots depicting lncRNA expression profiles were generated using RStudio 2023.12.0 Build 369. Venn diagrams were used to visualize shared lncRNAs between BRCA and CESC datasets. Statistical analysis and data visualization were performed using R, Microsoft Excel 2019, and PowerPoint 2019. Data were presented as mean ± standard deviation (SD) unless otherwise specified. Cell culture MCF10A (non-tumorigenic breast epithelial), MCF7 (less aggressive breast cancer), and MDA-MB-453 (aggressive triple-negative breast cancer) were maintained in Dulbecco’s modified eagle’s medium (DMEM) supplemented with 10% fetal bovine serum (FBS) along with 1% of 100 units/mL antibiotic and antimycotic solution at 37 °C in a humidified atmosphere with 5% CO2. RNA extraction and quantitative Real-time PCR Total RNA was extracted from cells using TRIzol reagent (Takara Biosciences) and reverse transcribed into cDNA using Moloney murine leukemia virus reverse transcriptase (Invitrogen). The qRT-PCR reactions were carried out in duplicates in 10 µL volume for the expression analysis. The reaction mixture contained SYBR Select master mix (2X, Takara Biosciences), cDNA template, and forward and reverse gene or lncRNA specific primers (0.1 µM each). Target sequence amplification temperature profile followed was as follows: Initial denaturation for 10 min at 95 °C, followed by 40 cycles of 10 s at 95 °C and amplification for 30 s at annealing temperature of 60 °C. Finally, a melt curve analysis was carried out at a temperature range of 60 °C to 95 °C for 20 min. The GAPDH was used as an internal control for lncRNA and mRNA quantification. Results were calculated using the ΔΔCt method to determine the fold change in expression between the experimental and control groups. The RT-PCR primers are as follows: FAM83H-AS1: ACTCACTGGGTCAGCAACAC; AAGCCCGGGTTGATATTGGG. FGF14-AS2: GTGGCGGATAAAGAGCCACT; CCTTTCTCAAAGCGCCAACC. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2  Supplementary Material 3  Supplementary Material 4 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We acknowledge the facilities of the JNU, University of Delhi South Campus and project numbers 91/04/2020-TFGTR/BMS, 52/01/2020-BIO/BMS, and 52_29_2022-BIO_BMS from the Government of India. Author contributions Madhur Sharma is the principal investigator of this study, who conceptualized the project, performed data analyses, and wrote the manuscript. M.S. designed the primary lncRNA screen that led to the identification of dysregulated lncRNAs in TCGA-BRCA and TCGA-CESC datasets, including FAM83H-AS1, ENSG00000267047.1, and FGF14-AS2. M.S. conducted comparative cancer data analysis, functional enrichment studies, survival analyses, and cytoplasmic-nuclear localization experiments. N.C. and P.P. assisted with statistical analyses and visualization, while D.P.S., A.N., and S.S. provided supervision. All authors reviewed the manuscript. Data availability Transcriptomic analysis was conducted utilizing The Cancer Genome Atlas (TCGA) datasets for TCGA-BRCA and TCGA-CESC, obtained from the TANRIC database ( https://ibl.mdanderson.org/tanric/_design/basic/download.html https://portal.gdc.cancer.gov/projects/TCGA-BRCA https://portal.gdc.cancer.gov/projects/TCGA-CESC Declarations Competing interests The authors declare no competing interests. References 1. Li J An interactive open platform to explore the function of LncRNAs in cancer Cancer Res. 2015 75 3728 3737 10.1158/0008-5472.CAN-15-0273 26208906 PMC4573884 Li, J. et al. An interactive open platform to explore the function of LncRNAs in cancer. Cancer Res. 75 26208906 10.1158/0008-5472.CAN-15-0273 PMC4573884 2. Wasson MD LncRNAs exhibit subtype-specific expression, survival associations, and cancer-promoting effects in breast cancer Gene 2024 901 148165 10.1016/j.gene.2024.148165 38219875 Wasson, M. D. et al. LncRNAs exhibit subtype-specific expression, survival associations, and cancer-promoting effects in breast cancer. Gene 901 38219875 10.1016/j.gene.2024.148165 3. Jeong, S. et al. Long Non-Coding RNA-Based functional prediction reveals novel targets in Notch-Upregulated ovarian cancer. Cancers (Basel) 10.3390/cancers14061557 PMC8946805 35326706 4. He W Li D Zhang X LncRNA HOTAIR promotes the proliferation and invasion/metastasis of breast cancer cells by targeting the miR-130a-3p/Suv39H1 axis Biochem. Biophys. Rep. 2022 30 101279 10.1016/j.bbrep.2022.101279 35619625 PMC9126846 He, W., Li, D. & Zhang, X. LncRNA HOTAIR promotes the proliferation and invasion/metastasis of breast cancer cells by targeting the miR-130a-3p/Suv39H1 axis. Biochem. Biophys. Rep. 30 35619625 10.1016/j.bbrep.2022.101279 PMC9126846 5. Qian L LncRNA HOTAIR as a CeRNA is related to breast cancer risk and prognosis Breast Cancer Res. Treat. 2023 200 375 390 10.1007/s10549-023-06982-4 37294527 Qian, L. et al. LncRNA HOTAIR as a CeRNA is related to breast cancer risk and prognosis. Breast Cancer Res. Treat. 200 37294527 10.1007/s10549-023-06982-4 6. Liu K Gao Y Zhang Q Prognostic significance of MALAT1 in clear cell renal cell carcinoma based on TCGA and GEO Med. (Baltim). 2023 102 e35249 10.1097/MD.0000000000035249 PMC10508397 37713833 Liu, K., Gao, Y. & Zhang, Q. Prognostic significance of MALAT1 in clear cell renal cell carcinoma based on TCGA and GEO. Med. (Baltim). 102 10.1097/MD.0000000000035249 PMC10508397 37713833 7. Zhang C Wang J Guo L Peng M Long non-coding RNA MALAT1 regulates cell proliferation, invasion and apoptosis by modulating the Wnt signaling pathway in squamous cell carcinoma Am. J. Transl Res. 2021 13 9233 9240 34540039 PMC8430056 Zhang, C., Wang, J., Guo, L. & Peng, M. Long non-coding RNA MALAT1 regulates cell proliferation, invasion and apoptosis by modulating the Wnt signaling pathway in squamous cell carcinoma. Am. J. Transl Res. 13 34540039 PMC8430056 8. Zhou Y Zhang X Klibanski A MEG3 noncoding RNA: a tumor suppressor J. Mol. Endocrinol. 2012 48 R45 53 10.1530/JME-12-0008 22393162 PMC3738193 Zhou, Y., Zhang, X. & Klibanski, A. MEG3 noncoding RNA: a tumor suppressor. J. Mol. Endocrinol. 48 22393162 10.1530/JME-12-0008 PMC3738193 9. Wei GH Wang X LncRNA MEG3 inhibit proliferation and metastasis of gastric cancer via p53 signaling pathway Eur. Rev. Med. Pharmacol. Sci. 2017 21 3850 3856 28975980 Wei, G. H. & Wang, X. LncRNA MEG3 inhibit proliferation and metastasis of gastric cancer via p53 signaling pathway. Eur. Rev. Med. Pharmacol. Sci. 21 28975980 10. Zhang Y The value of LncRNA NEAT1 as a prognostic factor for survival of cancer outcome: A Meta-Analysis Sci. Rep. 2017 7 13080 10.1038/s41598-017-10001-0 29026116 PMC5638961 Zhang, Y. et al. The value of LncRNA NEAT1 as a prognostic factor for survival of cancer outcome: A Meta-Analysis. Sci. Rep. 7 29026116 10.1038/s41598-017-10001-0 PMC5638961 11. Park, M. K. et al. NEAT1 is essential for metabolic changes that promote breast cancer growth and metastasis. Cell Metab 10.1016/j.cmet.2021.11.011 PMC8813003 34879239 12. Zhou YH Cui YH Wang T Luo Y Long non-coding RNA HOTAIR in cervical cancer: molecular marker, mechanistic insight, and therapeutic target Adv. Clin. Chem. 2020 97 117 140 10.1016/bs.acc.2019.12.004 32448431 Zhou, Y. H., Cui, Y. H., Wang, T. & Luo, Y. Long non-coding RNA HOTAIR in cervical cancer: molecular marker, mechanistic insight, and therapeutic target. Adv. Clin. Chem. 97 32448431 10.1016/bs.acc.2019.12.004 13. Gokmen-Polar Y Vladislav IT Neelamraju Y Janga SC Badve S Prognostic impact of HOTAIR expression is restricted to ER-negative breast cancers Sci. Rep. 2015 5 8765 10.1038/srep08765 25739705 PMC4350112 Gokmen-Polar, Y., Vladislav, I. T., Neelamraju, Y., Janga, S. C. & Badve, S. Prognostic impact of HOTAIR expression is restricted to ER-negative breast cancers. Sci. Rep. 5 25739705 10.1038/srep08765 PMC4350112 14. Goyal B Diagnostic, prognostic, and therapeutic significance of long non-coding RNA MALAT1 in cancer Biochim. Biophys. Acta Rev. Cancer 2021 1875 188502 10.1016/j.bbcan.2021.188502 33428963 Goyal, B. et al. Diagnostic, prognostic, and therapeutic significance of long non-coding RNA MALAT1 in cancer. Biochim. Biophys. Acta Rev. Cancer 1875 33428963 10.1016/j.bbcan.2021.188502 15. Hou J Zhang G Wang X Wang Y Wang K Functions and mechanisms of LncRNA MALAT1 in cancer chemotherapy resistance Biomark. Res. 2023 11 23 10.1186/s40364-023-00467-8 36829256 PMC9960193 Hou, J., Zhang, G., Wang, X., Wang, Y. & Wang, K. Functions and mechanisms of LncRNA MALAT1 in cancer chemotherapy resistance. Biomark. Res. 11 36829256 10.1186/s40364-023-00467-8 PMC9960193 16. Zhu C Wang X Wang Y Wang K Functions and underlying mechanisms of LncRNA HOTAIR in cancer chemotherapy resistance Cell. Death Discov 2022 8 383 10.1038/s41420-022-01174-3 36100611 PMC9470550 Zhu, C., Wang, X., Wang, Y. & Wang, K. Functions and underlying mechanisms of LncRNA HOTAIR in cancer chemotherapy resistance. Cell. Death Discov 8 36100611 10.1038/s41420-022-01174-3 PMC9470550 17. Zhang J Gao Y Long non-coding RNA MEG3 inhibits cervical cancer cell growth by promoting degradation of P-STAT3 protein via ubiquitination Cancer Cell. Int. 2019 19 175 10.1186/s12935-019-0893-z 31320837 PMC6615085 Zhang, J. & Gao, Y. Long non-coding RNA MEG3 inhibits cervical cancer cell growth by promoting degradation of P-STAT3 protein via ubiquitination. Cancer Cell. Int. 19 31320837 10.1186/s12935-019-0893-z PMC6615085 18. Luo X CSTF3 contributes to platinum resistance in ovarian cancer through alternative polyadenylation of LncRNA NEAT1 and generating the short isoform NEAT1_1 Cell. Death Dis. 2024 15 432 10.1038/s41419-024-06816-1 38898019 PMC11187223 Luo, X. et al. CSTF3 contributes to platinum resistance in ovarian cancer through alternative polyadenylation of LncRNA NEAT1 and generating the short isoform NEAT1_1. Cell. Death Dis. 15 38898019 10.1038/s41419-024-06816-1 PMC11187223 19. Kuleshov MV Enrichr: a comprehensive gene set enrichment analysis web server 2016 update Nucleic Acids Res. 2016 44 W90 97 10.1093/nar/gkw377 27141961 PMC4987924 Kuleshov, M. V. et al. Enrichr: a comprehensive gene set enrichment analysis web server 2016 update. Nucleic Acids Res. 44 27141961 10.1093/nar/gkw377 PMC4987924 20. Mas-Ponte D LncATLAS database for subcellular localization of long noncoding RNAs RNA 2017 23 1080 1087 10.1261/rna.060814.117 28386015 PMC5473142 Mas-Ponte, D. et al. LncATLAS database for subcellular localization of long noncoding RNAs. RNA 23 28386015 10.1261/rna.060814.117 PMC5473142 21. Yang F A novel long non-coding RNA FGF14-AS2 is correlated with progression and prognosis in breast cancer Biochem. Biophys. Res. Commun. 2016 470 479 483 10.1016/j.bbrc.2016.01.147 26820525 Yang, F. et al. A novel long non-coding RNA FGF14-AS2 is correlated with progression and prognosis in breast cancer. Biochem. Biophys. Res. Commun. 470 26820525 10.1016/j.bbrc.2016.01.147 22. Li D LncRNA MAGI2-AS3 is regulated by BRD4 and promotes gastric cancer progression via maintaining ZEB1 overexpression by sponging miR-141/200a Mol. Ther. Nucleic Acids 2020 19 109 123 10.1016/j.omtn.2019.11.003 31837602 PMC6920306 Li, D. et al. LncRNA MAGI2-AS3 is regulated by BRD4 and promotes gastric cancer progression via maintaining ZEB1 overexpression by sponging miR-141/200a. Mol. Ther. Nucleic Acids 19 31837602 10.1016/j.omtn.2019.11.003 PMC6920306 23. Wang, B. et al. PCAT19 regulates the proliferation and apoptosis of lung cancer cells by inhibiting miR-25-3p via targeting the MAP2K4 signal axis. Dis. Markers 2022 10.1155/2022/2442094 PMC9126706 35615401 24. Liu Z Yan HY Xia SY Zhang C Xiu YC Downregulation of long non-coding RNA TRIM52-AS1 functions as a tumor suppressor in renal cell carcinoma Mol. Med. Rep. 2016 13 3206 3212 10.3892/mmr.2016.4908 26934858 Liu, Z., Yan, H. Y., Xia, S. Y., Zhang, C. & Xiu, Y. C. Downregulation of long non-coding RNA TRIM52-AS1 functions as a tumor suppressor in renal cell carcinoma. Mol. Med. Rep. 13 26934858 10.3892/mmr.2016.4908 25. Shi X Long noncoding RNA PCAT6 functions as an oncogene by binding to EZH2 and suppressing LATS2 in non-small-cell lung cancer EBioMedicine 2018 37 177 187 10.1016/j.ebiom.2018.10.004 30314898 PMC6286630 Shi, X. et al. Long noncoding RNA PCAT6 functions as an oncogene by binding to EZH2 and suppressing LATS2 in non-small-cell lung cancer. EBioMedicine 37 30314898 10.1016/j.ebiom.2018.10.004 PMC6286630 26. Han P The LncRNA CRNDE promotes colorectal cancer cell proliferation and chemoresistance via miR-181a-5p-mediated regulation of Wnt/beta-catenin signaling Mol. Cancer 2017 16 9 10.1186/s12943-017-0583-1 28086904 PMC5237133 Han, P. et al. The LncRNA CRNDE promotes colorectal cancer cell proliferation and chemoresistance via miR-181a-5p-mediated regulation of Wnt/beta-catenin signaling. Mol. Cancer 16 28086904 10.1186/s12943-017-0583-1 PMC5237133 27. Mitobe Y Proliferation-associated long noncoding RNA, TMPO-AS1, is a potential therapeutic target for triple-negative breast cancer Cancer Sci. 2020 111 2440 2450 10.1111/cas.14498 32437068 PMC7385350 Mitobe, Y. et al. Proliferation-associated long noncoding RNA, TMPO-AS1, is a potential therapeutic target for triple-negative breast cancer. Cancer Sci. 111 32437068 10.1111/cas.14498 PMC7385350 28. Cantile, M. et al. Long Non-Coding RNA HOTAIR in breast cancer therapy. Cancers (Basel) 12 10.3390/cancers12051197 PMC7281113 32397382 29. Qiao FH Tu M Liu HY Role of MALAT1 in gynecological cancers: pathologic and therapeutic aspects Oncol. Lett. 2021 21 333 10.3892/ol.2021.12594 33692865 PMC7933745 Qiao, F. H., Tu, M. & Liu, H. Y. Role of MALAT1 in gynecological cancers: pathologic and therapeutic aspects. Oncol. Lett. 21 33692865 10.3892/ol.2021.12594 PMC7933745 30. Szklarczyk D STRING v11: protein-protein association networks with increased coverage, supporting functional discovery in genome-wide experimental datasets Nucleic Acids Res. 2019 47 D607 D613 10.1093/nar/gky1131 30476243 PMC6323986 Szklarczyk, D. et al. STRING v11: protein-protein association networks with increased coverage, supporting functional discovery in genome-wide experimental datasets. Nucleic Acids Res. 47 30476243 10.1093/nar/gky1131 PMC6323986 31. Zhao W Geng D Li S Chen Z Sun M LncRNA HOTAIR influences cell growth, migration, invasion, and apoptosis via the miR-20a-5p/HMGA2 axis in breast cancer Cancer Med. 2018 7 842 855 10.1002/cam4.1353 29473328 PMC5852357 Zhao, W., Geng, D., Li, S., Chen, Z. & Sun, M. LncRNA HOTAIR influences cell growth, migration, invasion, and apoptosis via the miR-20a-5p/HMGA2 axis in breast cancer. Cancer Med. 7 29473328 10.1002/cam4.1353 PMC5852357 32. Kawaguchi T Hirose T Chromatin remodeling complexes in the assembly of long noncoding RNA-dependent nuclear bodies Nucleus 2015 6 462 467 10.1080/19491034.2015.1119353 26709446 PMC4915484 Kawaguchi, T. & Hirose, T. Chromatin remodeling complexes in the assembly of long noncoding RNA-dependent nuclear bodies. Nucleus 6 26709446 10.1080/19491034.2015.1119353 PMC4915484 ",
  "metadata": {
    "Title of this paper": "Chromatin remodeling complexes in the assembly of long noncoding RNA-dependent nuclear bodies",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489001/"
  }
}