{
  "title": "Paper_1246",
  "abstract": "pmc Life (Basel) Life (Basel) 2582 life life Life 2075-1729 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471411 PMC12471411.1 12471411 12471411 41010399 10.3390/life15091457 life-15-01457 1 Review Refractory Neuropathic Pain in the Head and Neck: Neuroanatomical and Clinical Significance of the Cervicotrigeminal Complex Raguž Marina 1 2 * † https://orcid.org/0000-0002-4173-1278 Tarle Marko 3 4 † https://orcid.org/0000-0002-7058-4123 Hat Koraljka 3 4 Salarić Ivan 3 4 Marčinković Petar 1 Bičanić Ivana 2 Lazić Mosler Elvira 2 https://orcid.org/0000-0002-9138-2037 Lukšić Ivica 3 5 Marinović Tonko 1 6 ‡ Chudy Darko 1 5 ‡ Lin Yiwen Academic Editor Hsiao I-Han Academic Editor 1 2 3 mtarle@sfzg.hr salaric@sfzg.unizg.hr luksic@kbd.hr 4 5 6 * marinaraguz@gmail.com † These authors contributed equally to this work. ‡ These authors also contributed equally to this work. 17 9 2025 9 2025 15 9 497651 1457 31 8 2025 15 9 2025 16 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Refractory neuropathic pain of the head and neck remains a major clinical challenge, particularly when mediated through the cervicotrigeminal complex (CTC), a unique anatomical hub integrating trigeminal and upper cervical nociceptive inputs. This narrative review synthesizes neuroanatomical, pathophysiological, and clinical evidence to provide a unifying framework for diagnosis and management. A structured search of PubMed, Scopus, and Web of Science identified English-language clinical and mechanistic studies addressing CTC-mediated pain, with case reports excluded unless mechanistically informative. We propose multidimensional refractoriness criteria that integrate pharmacological non-response, failed interventional strategies, and objective functional impairment. Current treatments span pharmacotherapy, peripheral interventions (nerve blocks, radiofrequency ablation), and neuromodulation at multiple network levels (occipital nerve stimulation, spinal cord stimulation, motor cortex stimulation, deep brain stimulation). Non-invasive approaches such as rTMS, tDCS, and vagus nerve stimulation are emerging but remain investigational. Advances in imaging and neurophysiological biomarkers now permit greater precision in detecting CTC dysfunction and tailoring therapy. By combining anatomical precision, mechanistic insight, and multidisciplinary strategies, this review proposes a clinically actionable definition of refractoriness and supports a stepwise, mechanism-based approach to therapy. CTC emerges as a targetable hub for diagnostic and therapeutic strategies in refractory head and neck pain. cervicotrigeminal complex trigeminocervical convergence refractory neuropathic pain central sensitization neuromodulation head and neck disorders This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Neuropathic pain is defined by the International Association for the Study of Pain as pain arising as a direct consequence of a lesion or disease affecting the somatosensory nervous system [ 1 2 3 4 5 2 6 7 8 8 9 10 Central to these conditions is the cervicotrigeminal complex (CTC), a functional and anatomical hub comprising the spinal trigeminal nucleus, particularly its caudal portion, and the dorsal horns of the upper cervical spinal cord. The term CTC, sometimes also referred to as the trigeminal cervical complex, reflects this convergence and is used variably across disciplines [ 11 11 12 13 14 15 16 17 18 19 20 21 22 16 23 24 25 26 27 Against this background, the present review synthesizes anatomical, pathophysiological, diagnostic, and therapeutic evidence on the CTC in the context of refractory neuropathic pain of the head and neck. By integrating classical neuroanatomical insights with contemporary clinical and imaging data, we aim to provide a clinically actionable framework that links structure–function relationships with diagnostic strategies and stepwise treatment approaches. Rather than addressing pain syndromes in isolation, this review positions the CTC as a unifying hub and conceptual anchor for mechanism-based intervention in refractory craniofacial neuropathic pain. 2. Methods This work was conducted as a structured but non-systematic narrative review. We performed a structured literature search in PubMed, Scopus, and Web of Science using combinations of the following keywords: cervicotrigeminal complex, trigeminocervical convergence, neuropathic pain, occipital neuralgia, cervicogenic headache, neuromodulation, and refractory pain. Eligible studies were restricted to English-language publications. Both clinical (human) and mechanistic (preclinical) studies were considered if they addressed diagnostic, pathophysiological, or therapeutic aspects relevant to CTC-mediated pain. Reference lists of reviews and included studies were manually screened to identify additional sources. Given the narrative design of this review, no formal inclusion/exclusion criteria were applied, and case reports were not systematically excluded. Given the heterogeneous nature of the literature, no formal quality assessment or meta-analysis was performed. Instead, findings were synthesized to highlight converging anatomical, pathophysiological, and clinical themes relevant to refractory head and neck neuropathic pain. This synthesis was qualitative and exploratory in nature. Two authors independently screened titles/abstracts; disagreements were resolved by discussion. No formal risk-of-bias assessment was performed due to the diversity of study designs (e.g., basic science, observational, interventional) and the narrative nature of the review. However, potential methodological limitations were considered when interpreting the strength and generalizability of conclusions. 3. Neuroanatomy of the Cervicotrigeminal Complex The CTC is not a passive relay station but a dynamic integrative hub whose connectivity underpins both the clinical manifestations and therapeutic targeting of neuropathic pain in the head and neck. Anatomically, the CTC is centered on the spinal trigeminal nucleus, particularly its caudal portion, the nucleus caudalis, which is continuous caudally with the dorsal horn of the upper cervical spinal cord [ 11 28 13 29 19 30 15 16 Figure 1 The caudal trigeminal nucleus exhibits a clear somatotopic organization: the perioral region is represented rostrally, while more peripheral facial territories are mapped caudally [ 31 32 26 16 17 33 16 34 35 36 37 38 4. Pathophysiology of CTC-Mediated Pain The pathophysiology of CTC-mediated pain reflects an interplay of molecular, cellular, and systems-level mechanisms that sustain chronic pain states in the head and neck. Anatomical overlap of trigeminal and upper cervical afferents onto common second-order neurons in the spinal trigeminal nucleus caudalis provides the substrate for referred pain and overlapping symptoms across cranial and cervical territories [ 13 16 17 A central hallmark of chronic CTC-mediated pain is central sensitization, characterized by heightened excitability of neurons in the nucleus caudalis and upper cervical dorsal horn following persistent peripheral input. Key mechanisms include excessive glutamatergic transmission and NMDA receptor activation [ 39 40 19 37 Sustained afferent drive further activates glial networks, with microglia and astrocytes releasing IL-1β, TNF-α, chemokines, and brain-derived neurotrophic factor (BDNF) [ 41 42 43 44 45 Figure 2 Since no single mechanism explains refractoriness, therapeutic strategies should target multiple nodes simultaneously: reducing peripheral input (nerve blocks, decompression, ion channel modulators), suppressing central hyperexcitability (gabapentinoids, NMDA antagonists, GABAergic enhancers), attenuating glial activation (cytokine or microglial inhibitors), and restoring descending inhibition (SNRIs, neuromodulation of PAG–RVM circuits). 5. Clinical Presentation Neuropathic and mixed pain syndromes of the head and neck display marked heterogeneity, reflecting the complex convergence within the CTC and resulting in overlapping phenotypes that often elude strict diagnostic categorization. Shared receptive fields of trigeminal and upper cervical afferents enable referred pain patterns that obscure the primary site of pathology, leading to diagnostic delays and complicating management [ 13 17 15 16 11 21 Other neuralgic syndromes, including glossopharyngeal neuralgia, Eagle syndrome, and post-herpetic neuralgia, may overlap with CTC-mediated presentations. Post-traumatic trigeminal neuropathy and persistent idiopathic facial pain illustrate how central sensitization can broaden the pain field into cervical regions [ 23 46 47 48 49 50 51 19 34 25 30 Given this wide spectrum, recognition of overlapping phenotypes and their integration into structured diagnostic pathways is essential. Table 1 6. Diagnostic and Therapeutic Framework for Refractory Neuropathic Pain in the Head and Neck Neuropathic pain of the head and neck mediated by the CTC presents a distinct diagnostic challenge due to the anatomical convergence of trigeminal and upper cervical afferents onto shared second-order neurons within the spinal trigeminal nucleus caudalis. This arrangement enables bidirectional nociceptive referral between cranial and cervical territories, generating overlapping and sometimes misleading symptom patterns that obscure the primary pain generator. Such convergence carries a high risk of misclassification and highlights the importance of an anatomically informed, multidisciplinary approach, with the designation “refractory” reserved for cases that have undergone comprehensive evaluation and optimal treatment [ 13 17 The diagnostic process begins with a detailed history and focused neurological examination, addressing pain onset, temporal pattern, quality, distribution, and associated autonomic or neurological features [ 21 2 19 72 26 73 74 At present, there is no universally accepted definition of refractoriness in neuropathic pain of the head and neck, particularly in disorders mediated by CTC. Studies apply heterogeneous criteria, with some focusing solely on pharmacological failure and others neglecting functional or anatomical considerations. To address this, we propose a pragmatic, multidisciplinary framework adapted to the specific neuroanatomical and clinical features of CTC-related pain ( Table 2 3 5 75 76 17 Table 2 Management of refractory neuropathic pain in the head and neck requires a tiered and multimodal strategy, tailored to both underlying mechanisms and symptom severity. Treatment typically progresses from conservative pharmacological regimens to invasive neuromodulation, with escalation considered only after less invasive approaches fail. A stepwise management algorithm is summarized in Figure 3 Pharmacological therapies, including gabapentinoids, tricyclic antidepressants, serotonin–norepinephrine reuptake inhibitors, and topical agents, remain first-line options. Their efficacy is supported by randomized controlled trials (RCTs) and meta-analyses in general neuropathic pain populations; however, effectiveness in refractory head and neck pain is often modest, and systemic adverse effects may limit long-term use [ 3 5 When pharmacological measures are insufficient, interventional procedures such as occipital and trigeminal nerve blocks may provide both diagnostic and short-term therapeutic benefit. Although generally safe and repeatable, their effect is usually transient [ 75 77 53 78 79 80 81 82 83 84 85 86 87 Table 3 Among neuromodulatory strategies, non-invasive approaches warrant particular attention because of their favorable safety profile and ease of application ( Table 4 Table 4 88 89 At every stage, rehabilitation plays a critical supportive role. Cervical mobility training, postural correction, and physiotherapy help reduce musculoskeletal contributors to nociceptive load. Psychological interventions, particularly cognitive–behavioral therapy, address mood and anxiety comorbidities that exacerbate pain via shared neural circuits. Sleep optimization is equally important, given the detrimental effects of sleep disruption on descending inhibitory pathways [ 95 23 90 7. Discussion CTC occupies a distinctive position in pain neurobiology. Rather than a passive relay, it functions as a dynamic hub where trigeminal and upper cervical afferents converge onto shared second-order neurons [ 11 13 30 15 16 18 Despite decades of research, the pathophysiology of CTC-mediated refractory pain remains incompletely characterized. Many studies describe these syndromes under broad labels such as “atypical” or “mixed” pain, which risks obscuring their specific neurobiological underpinnings. Experimental evidence indicates that sustained afferent input can induce central sensitization within the caudalis, sustained by NMDA receptor phosphorylation, disinhibition of inhibitory networks, and glial-driven neuroinflammation [ 19 39 41 96 97 95 Therapeutic approaches should therefore reflect this complexity. As outlined in Table 2 3 5 74 75 Table 3 Figure 3 78 79 80 81 82 83 84 85 86 87 Recent studies have explored DBS targeting regions such as the PAG, anterior cingulate cortex, and ventral posteromedial thalamus, with varying degrees of success [ 84 85 98 99 100 101 77 87 Table 4 88 91 92 93 94 Figure 3 Future directions may involve bridging molecular insights with clinical translation. Potential avenues include microglial and astrocytic modulators (e.g., P2 × 4, CCL4/CCR5 axis), novel NMDA antagonists, anti-inflammatory biologics, and regenerative cell-based approaches [ 42 102 103 Importantly, the current evidence base remains limited. Most studies are small, heterogeneous, and often extrapolated from headache or generalized neuropathic pain cohorts. Definitions of refractoriness lack standardization, and outcome measures are inconsistent, limiting comparability across trials. Moreover, the variability in study design and quality among included sources may limit the generalizability of conclusions and underscores the need for prospective, high-quality research in this area. Collaborative, multicenter efforts will be essential to strengthen the field. By integrating anatomy, mechanism, and therapy, this review highlights CTC-mediated refractory pain as a definable clinical entity and a potential target for mechanism-informed interventions. A shift toward multidisciplinary, network-level approaches may help move the field beyond descriptive syndromes and toward evidence-based, patient-centered care. Where direct studies on cervicotrigeminal pain are lacking, extrapolations from migraine or generalized neuropathic pain literature are noted as such and should be interpreted with caution. 8. Conclusions Refractory neuropathic pain of the head and neck is increasingly recognized not as a collection of atypical syndromes, but as a disorder with a definable neurobiological basis in CTC dysfunction. This review positions the CTC as a useful framework for understanding trigeminocervical convergence, central sensitization, and treatment resistance, and for moving beyond purely symptom-based classifications toward mechanism-informed diagnosis. By integrating neuroanatomical insights with structured definitions of refractoriness and tiered therapeutic strategies, we suggest that clinical care should adopt multidimensional criteria that encompass duration, pharmacological and interventional response, functional impact, and exclusion of surgically remediable causes. Based on current evidence, we recommend a layered therapeutic approach tailored to the pathophysiological mechanisms involved, starting with pharmacotherapy, progressing through targeted interventions (e.g., nerve blocks, PRF), and advancing to neuromodulation when appropriate. Progress in management will likely depend on earlier, layered interventions that address peripheral drivers, central sensitization, and maladaptive network activity in parallel. Such approaches, combining pharmacology, interventional techniques, and neuromodulation within a coordinated multidisciplinary framework, may improve outcomes, particularly when supported by advanced imaging and biomarker-guided patient selection. Clinicians should also consider CTC dysfunction in cases of post-surgical craniofacial pain and other refractory neuropathic syndromes with overlapping mechanisms. Looking ahead, consensus definitions, high-quality multicenter trials, and translational innovation directed at neuroimmune and glial signaling will be essential. By linking anatomical understanding with mechanistic insights and technological advances, there is an opportunity to reframe CTC-mediated pain as a better characterized and more manageable condition, while acknowledging that further evidence is needed before it can be fully predicted, controlled, or prevented. Acknowledgments The authors would like to thank the members of the Multidisciplinary team for painful head and neck conditions at Dubrava University Hospital, Zagreb, Croatia, for their valuable insights and ongoing collaboration. We are also grateful to the patients who inspired this work through their experiences and clinical challenges. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.R. and M.T.; methodology, M.R.; software, M.T.; validation, M.R., M.T. and D.C.; formal analysis, M.R.; investigation, M.R.; resources, M.T.; data curation, M.T.; writing—original draft preparation, M.R.; writing—review and editing, M.T., K.H., I.S., P.M., I.B. and E.L.M.; visualization, M.R.; supervision, T.M., I.L. and D.C.; project administration, T.M. and D.C.; funding acquisition, D.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing does not apply to this article. Conflicts of Interest The authors declare no conflicts of interest. References 1. IASP IASP Terminology: Neuropathic Pain Definition. International Association for the Study of Pain 2017 Available online: https://www.iasp-pain.org/resources/terminology/ (accessed on 30 August 2025) 2. Treede R.D. Rief W. Barke A. Aziz Q. Bennett M.I. Benoliel R. Cohen M. Evers S. Finnerup N.B. First M.B. Chronic pain as a symptom or a disease: The IASP Classification of Chronic Pain for the ICD-11 Pain 2019 160 19 27 10.1097/j.pain.0000000000001384 30586067 3. Dworkin R.H. Backonja M. Rowbotham M.C. Allen R.R. Argoff C.R. Bennett G.J. Bushnell M.C. Farrar J.T. Galer B.S. Haythornthwaite J.A. Advances in neuropathic pain: Diagnosis, mechanisms, and treatment recommendations Arch. Neurol. 2003 60 1524 1534 10.1001/archneur.60.11.1524 14623723 4. Jensen T.S. Baron R. Haanpää M. Kalso E. Loeser J.D. Rice A.S.C. Treede R.D. A new definition of neuropathic pain Pain 2011 152 2204 2205 10.1016/j.pain.2011.06.017 21764514 5. Finnerup N.B. Attal N. Haroutounian S. McNicol E. Baron R. Dworkin R.H. Gilron I. Haanpää M. Hansson P. Jensen T.S. Pharmacotherapy for neuropathic pain in adults: A systematic review and meta-analysis Lancet Neurol. 2015 14 162 173 10.1016/S1474-4422(14)70251-0 25575710 PMC4493167 6. Bouhassira D. Lantéri-Minet M. Attal N. Laurent B. Touboul C. Prevalence of chronic pain with neuropathic characteristics in the general population Pain 2008 136 380 387 10.1016/j.pain.2007.08.013 17888574 7. van Hecke O. Austin S.K. Khan R.A. Smith B.H. Torrance N. Neuropathic pain in the general population: A systematic review of epidemiological studies Pain 2014 155 654 662 10.1016/j.pain.2013.11.013 24291734 8. Colloca L. Ludman T. Bouhassira D. Baron R. Dickenson A.H. Yarnitsky D. Freeman R. Truini A. Attal N. Finnerup N.B. Neuropathic pain Nat. Rev. Dis. Primers 2017 3 17002 10.1038/nrdp.2017.2 28205574 PMC5371025 9. Smith B.H. Torrance N. Epidemiology of neuropathic pain and its impact on quality of life Curr. Pain Headache Rep. 2012 16 191 198 10.1007/s11916-012-0256-0 22395856 10. Torrance N. Smith B.H. Bennett M.I. Lee A.J. The epidemiology of chronic pain of predominantly neuropathic origin: Results from a general population survey J. Pain 2006 7 281 288 10.1016/j.jpain.2005.11.008 16618472 11. Bou Malhab F. Hosri J. Zaytoun G. Hadi U. Trigeminal cervical complex: A neural network affecting the head and neck Eur. Ann. Otorhinolaryngol. Head Neck Dis. 2025 142 191 200 10.1016/j.anorl.2024.09.008 39395902 12. Bogduk N. The anatomical basis for cervicogenic headache J. Manip. Physiol. Ther. 1992 15 67 70 1740655 13. Merskey H. Bogduk N. Classification of Chronic Pain 2nd ed. IASP Press Seattle, WA, USA 1994 14. Piovesan E.J. Kowacs P.A. Oshinsky M.L. Convergence of cervical and trigeminal sensory afferents Curr. Pain Headache Rep. 2003 7 377 383 10.1007/s11916-003-0037-x 12946291 15. Grgić V. Utjecaj manualne terapije vratne kraljeznice na tipicnu trigeminalnu neuralgiju: Prikaz bolesnice [Influence of manual therapy of cervical spine on typical trigeminal neuralgia: A case report] Lijec Vjesn. 2010 132 21 24 (In Croatian) 20359155 16. Bartsch T. Goadsby P.J. The trigeminocervical complex and migraine: Current concepts and synthesis Curr. Pain Headache Rep. 2003 7 371 376 10.1007/s11916-003-0036-y 12946290 17. Bogduk N. Govind J. Cervicogenic headache: An assessment of the evidence on clinical diagnosis, invasive tests, and treatment Lancet Neurol. 2009 8 959 968 10.1016/S1474-4422(09)70209-1 19747657 18. Bartsch T. Migraine and the trigeminocervical complex Curr. Pain Headache Rep. 2005 9 164 170 10.1007/s11916-005-0052-1 12946290 19. Sessle B.J. Hu J.W. Amano N. Zhong G. Convergence of cutaneous, tooth pulp, visceral, neck and muscle afferents onto nociceptive and non-nociceptive neurones in trigeminal subnucleus caudalis (medullary dorsal horn) and its implications for referred pain Pain 1986 27 219 235 10.1016/0304-3959(86)90213-7 3797017 20. Goadsby P.J. Holland P.R. Martins-Oliveira M. Hoffmann J. Schankin C. Akerman S. Pathophysiology of Migraine: A Disorder of Sensory Processing Physiol. Rev. 2017 97 553 622 10.1152/physrev.00034.2015 28179394 PMC5539409 21. Headache Classification Committee of the International Headache Society (IHS) The International Classification of Headache Disorders, 3rd edition (ICHD-3) Cephalalgia 2018 38 1 211 10.1177/0333102417738202 29368949 22. Wei D.Y. Goadsby P.J. Recent Advances and Updates in Trigeminal Autonomic Cephalalgias Semin. Neurol. 2022 42 474 478 10.1055/s-0042-1758043 36323300 23. Bendtsen L. Zakrzewska J.M. Abbott J. Braschinsky M. Di Stefano G. Donnet A. Eide P.K. Leal P.R.L. Maarbjerg S. May A. European Academy of Neurology guideline on trigeminal neuralgia Eur. J. Neurol. 2019 26 831 849 10.1111/ene.13950 30860637 24. Martelletti P. Katsarava Z. Lampl C. Magis D. Bendtsen L. Negro A. Russell M.B. Mitsikostas D.D. Jensen R.H. Refractory chronic migraine: A consensus statement on clinical definition from the European Headache Federation J. Headache Pain. 2014 15 47 10.1186/1129-2377-15-47 25169882 PMC4237793 25. Ashina M. Katsarava Z. Do T.P. Buse D.C. Pozo-Rosich P. Özge A. Krymchantowski A.V. Lebedeva E.R. Ravishankar K. Yu S. Migraine: Integrated approaches to clinical management and emerging treatments Lancet 2021 397 1505 1518 10.1016/S0140-6736(20)32342-4 33773612 26. Marciszewski K.K. Meylakh N. Di Pietro F. Macefield V.G. Macey P.M. Henderson L.A. Altered brainstem anatomy in migraine Cephalalgia 2017 38 476 486 10.1177/0333102417694884 28952339 27. Basedau H. Nielsen T. Asmussen K. Gloss K. Mehnert J. Jensen R.H. May A. Experimental evidence of a functional relationship within the brainstem trigeminocervical complex in humans Pain 2022 163 729 734 10.1097/j.pain.0000000000002417 34326294 28. Kerr F.W. Structural relation of the spinal trigeminal nucleus to the upper cervical roots and the subnucleus caudalis of the nucleus of the tractus solitarius in the cat Exp. Neurol. 1961 4 134 152 10.1016/0014-4886(61)90036-X 13752664 29. Dostrovsky J.O. Sessle B.J. Hu J.W. Presynaptic excitability changes produced by conditioning stimulation of primary afferent fibers in trigeminal brain-stem nuclei J. Neurophysiol. 1981 45 761 775 10.1016/s0014-4886(71)80004-3 30. Goadsby P.J. Hoskin K.L. The distribution of trigeminovascular afferents in the nonhuman primate brain stem Brain 1997 120 2347 2359 10.1016/s0014-4886(71)80004-3 PMC1467617 9147223 31. Shigenaga Y. Okamoto T. Nishimori T. Suemune S. Nasution I.D. Chen I.C. Tsuru K. Yoshida A. Tabuchi K. Hosoi M. Oral and facial representation in the trigeminal principal and rostral spinal nuclei of the cat J. Comp. Neurol. 1986 244 1 18 10.1002/cne.902440102 3950088 32. Rhoton A.L. The supratentorial cranial space: Microsurgical anatomy and surgical approaches Neurosurgery 2002 51 (Suppl. 4) S273 S302 10.1097/00006123-200210001-00001 33. DaSilva A.F. Becerra L. Makris N. Strassman A.M. Gonzalez R.G. Geatrakis N. Borsook D. Somatotopic activation in the human trigeminal pain pathway J. Neurosci. 2002 22 8183 8192 10.1523/JNEUROSCI.22-18-08183.2002 12223572 PMC6758094 34. Fernandes E.C. Carlos-Ferreira J. Luz L.L. Kokai E. Meszar Z. Szucs P. Safronov B.V. Processing of trigeminocervical nociceptive afferent input by neuronal circuity in the upper cervical lamina I Pain 2022 163 362 375 10.1097/j.pain.0000000000002342 33990106 35. Russo A.F. Calcitonin gene-related peptide (CGRP): A new target for migraine Annu. Rev. Pharmacol. Toxicol. 2015 55 533 552 10.1146/annurev-pharmtox-010814-124701 25340934 PMC4392770 36. Edvinsson L. CGRP antibodies as prophylaxis in migraine Lancet Neurol. 2019 18 323 325 10.1016/j.cell.2018.11.049 37. Oshinsky M.L. Gomonchareonsiri S. Episodic dural stimulation in awake rats: A model for recurrent headache Headache 2007 47 1026 1036 10.1111/j.1526-4610.2007.00871.x 17635594 PMC4029495 38. May A. Goadsby P.J. The trigeminovascular system in humans: Pathophysiologic implications for primary headache syndromes of the neural influences on the cerebral circulation J. Cereb. Blood Flow. Metab. 2002 22 1093 1112 10.1097/00004647-199902000-00001 10027765 39. Woolf C.J. Central sensitization: Implications for the diagnosis and treatment of pain Pain 2011 152 (Suppl. 3) S2 S15 10.1016/j.pain.2010.09.030 20961685 PMC3268359 40. Bliss T.V. Collingridge G.L. Kaang B.K. Zhuo M. Synaptic plasticity in the anterior cingulate cortex in acute and chronic pain Nat. Rev. Neurosci. 2016 17 485 496 10.1038/nrn.2016.68 27307118 41. Gao Y.J. Ji R.R. Chemokines, neuronal–glial interactions, and central processing of neuropathic pain Pharmacol. Ther. 2010 126 56 68 10.1016/j.pharmthera.2010.01.002 20117131 PMC2839017 42. Milligan E.D. Watkins L.R. Pathological and protective roles of glia in chronic pain Nat. Rev. Neurosci. 2009 10 23 36 10.1038/nrn2533 19096368 PMC2752436 43. Devor M. Sodium channels and mechanisms of neuropathic pain J. Pain 2006 7 (Suppl. 1) S3 S12 10.1016/j.jpain.2005.09.006 16426998 44. Ossipov M.H. Dussor G.O. Porreca F. Central modulation of pain J. Clin. Investig. 2010 120 3779 3787 10.1172/JCI43766 21041960 PMC2964993 45. Borsook D. Maleki N. Becerra L. McEwen B. Understanding migraine through the lens of maladaptive stress responses: A model disease of allostatic load Neuron 2013 77 990 1004 10.1016/j.neuron.2012.01.001 22284178 46. Xiong N.X. Zhao H.Y. Zhang F.C. Liu R.E. Vagoglossopharyngeal neuralgia treated by microvascular decompression and glossopharyngeal rhizotomy: Clinical results of 21 cases Stereotact. Funct. Neurosurg. 2012 90 45 50 10.1159/000333828 22249175 47. Woda A. Pionchon P. A unified concept of idiopathic orofacial pain: Clinical features J. Orofac. Pain 1999 13 172 184 10823031 48. Okeson J.P. Bell’s Orofacial Pains: The Clinical Management of Orofacial Pain Quintessence Chicago, IL, USA 2005 49. Travell J.G. Simons D.G. Myofascial Pain and Dysfunction: The Trigger Point Manual Williams & Wilkins Baltimore, MD, USA 1992 50. Jääskeläinen S.K. Clinical neurophysiology and quantitative sensory testing in the investigation of orofacial pain and sensory function J. Oral Rehabil. 2021 48 153 162 10.1111/joor.13090 15250429 51. Taziki M.H. Behnampour N. A study of the etiology of referred otalgia Iran. J. Otorhinolaryngol. 2012 24 171 176 24303405 PMC3846197 52. Biondi D.M. Cervicogenic headache: A review of diagnostic and treatment strategies J. Am. Osteopath. Assoc. 2005 105 (Suppl. 2) 16S 22S 15928349 53. Choi H.J. Oh I.H. Choi S.K. Lim Y.J. Clinical outcomes of pulsed radiofrequency neuromodulation for the treatment of occipital neuralgia J. Korean Neurosurg. Soc. 2012 51 281 285 10.3340/jkns.2012.51.5.281 22792425 PMC3393863 54. Slavin K.V. Isagulyan E.D. Gomez C. Yin D. Occipital Nerve Stimulation Neurosurg. Clin. N. Am. 2019 30 211 217 10.1016/j.nec.2018.12.004 30898272 55. Maixner W. Fillingim R.B. Williams D.A. Smith S.B. Slade G.D. Overlapping Chronic Pain Conditions: Implications for Diagnosis and Classification J. Pain 2016 17 (Suppl. 9) T93 T107 10.1016/j.jpain.2016.06.002 27586833 PMC6193199 56. Renton T. Dental (Odontogenic) Pain Rev. Pain 2011 5 2 7 10.1177/204946371100500102 26527224 PMC4590084 57. Daly B.J. Sharif M.O. Jones K. Worthington H.V. Beattie A. Local interventions for the management of alveolar osteitis (dry socket) Cochrane Database Syst. Rev. 2022 9 CD006968 10.1002/14651858.CD006968.pub2 36156769 PMC9511819 58. Melis M. Lobo S.L. Ceneviz C. Zawawi K. Al-Badawi E. Maloney G. Mehta N. Atypical odontalgia: A review of the literature Headache 2003 43 1060 1074 10.1046/j.1526-4610.2003.03207.x 14629241 59. Schreiber C.P. Hutchinson S. Webster C.J. Ames M. Richardson M.S. Powers C. Prevalence of migraine in patients with a history of self-reported or physician-diagnosed “sinus” headache Arch. Intern. Med. 2004 164 1769 1772 10.1001/archinte.164.16.1769 15364670 60. Fokkens W.J. Lund V.J. Hopkins C. Hellings P.W. Kern R. Reitsma S. Toppila-Salmi S. Bernal-Sprekelsen M. Mullol J. Alobid I. European Position Paper on Rhinosinusitis and Nasal Polyps 2020 Rhinology 2020 58 (Suppl. S29) 1 464 10.4193/Rhin20.401 32077450 61. Rushton J.G. Stevens J.C. Miller R.H. Glossopharyngeal (vagoglossopharyngeal) neuralgia: A study of 217 cases Arch. Neurol. 1981 38 201 205 10.1001/archneur.1981.00510040027002 7213143 62. Wang X. Meng D. Wang L. Chen G. The Clinical Characteristics and Surgical Treatment of Glossopharyngeal Neuralgia With Pain Radiating to the Innervated Area of the Trigeminal Nerve J. Oral. Maxillofac. Surg. 2021 79 786.e1 786.e8 10.1016/j.joms.2020.11.034 33387474 63. Eagle W.W. Elongated styloid process: Report of two cases Arch. Otolaryngol. 1937 25 584 587 10.1001/archotol.1937.00650010656008 18131173 64. Badhey A. Jategaonkar A. Anglin Kovacs A.J. Kadakia S. De Deyn P.P. Ducic Y. Schantz S. Shin E. Eagle syndrome: A comprehensive review Clin. Neurol. Neurosurg. 2017 159 34 38 10.1016/j.clineuro.2017.04.021 28527976 65. Watson C.P. Postherpetic neuralgia: The importance of preventing this intractable end-stage disorder J. Infect. Dis. 1998 178 (Suppl. 1) S91 S94 10.1086/514269 9852983 66. Saguil A. Kane S. Mercado M. Lauters R. Herpes Zoster and Postherpetic Neuralgia: Prevention and Management Am. Fam. Physician 2017 96 656 663 29431387 67. Ashina M. Katsarava Z. Do T.P. Buse D.C. Pozo-Rosich P. Özge A. Krymchantowski A.V. Lebedeva E.R. Ravishankar K. Yu S. Migraine: Epidemiology and systems of care Lancet 2021 397 1485 1495 10.1016/S0140-6736(20)32160-7 33773613 68. Yanagisawa K. Kveton J.F. Referred otalgia Am. J. Otolaryngol. 1992 13 323 327 10.1016/0196-0709(92)90072-2 1443387 69. Ramazani F. Szalay-Anderson C. Batista A.V. Park P. Hwang E. Chau J. Lui J. Referred otalgia: Common causes and evidence-based strategies for assessment and management Can. Fam. Physician 2023 69 757 761 10.46747/cfp.6911757 37963787 PMC10645450 70. Travell J.G. Simons D.G. Myofascial Pain and Dysfunction: The Trigger Point Manual 2nd ed. Williams & Wilkins Philadelphia, PA, USA 1999 9780683307719 71. Giamberardino M.A. Affaitati G. Fabrizio A. Costantini R. Myofascial pain syndromes and their evaluation Best. Pract. Res. Clin. Rheumatol. 2011 25 185 198 10.1016/j.berh.2011.01.002 22094195 72. Amer T.A. El-Shmam O.M. Chiari malformation type I: A new MRI classification Magn. Reson. Imaging 1997 15 397 403 10.1016/S0730-725X(96)00383-9 9223040 73. Hwang L. Dessouky R. Xi Y. Amirlak B. Chhabra A. MR Neurography of Greater Occipital Nerve Neuropathy: Initial Experience in Patients with Migraine AJNR Am. J. Neuroradiol. 2017 38 2203 2209 10.3174/ajnr.A5354 28882864 PMC7963599 74. Naja Z.M. El-Rajab M. Al-Tannir M.A. Ziade F.M. Tawfik O.M. Occipital nerve blockade for cervicogenic headache: A double-blind randomized controlled clinical trial Pain Pract. 2006 6 89 95 10.1111/j.1533-2500.2006.00068.x 17309715 75. Vanelderen P. Rouwette T. De Vooght P. Puylaert M. Heylen R. Vissers K. Van Zundert J. Pulsed radiofrequency for the treatment of occipital neuralgia: A prospective study with 6 months of follow-up Reg. Anesth. Pain Med. 2010 35 148 151 10.1097/AAP.0b013e3181d24713 20301822 76. Kosinski M. Bayliss M.S. Bjorner J.B. Ware J.E. Jr. Garber W.H. Batenhorst A. Cady R. Dahlöf C.G. Dowson A. Tepper S. A six-item short-form survey for measuring headache impact: The HIT-6 Qual. Life Res. 2003 12 963 974 10.1023/A:1026119331193 14651415 77. Mustafa M.S. Bin Amin S. Kumar A. Shafique M.A. Fatima Zaidi S.M. Arsal S.A. Rangwala B.S. Iqbal M.F. Raja A. Haseeb A. Assessing the effectiveness of greater occipital nerve block in chronic migraine: A systematic review and meta-analysis BMC Neurol. 2024 24 330 10.1186/s12883-024-03834-6 39244547 PMC11380438 78. Schwedt T.J. Dodick D.W. Hentz J. Trentman T.L. Zimmerman R.S. Occipital nerve stimulation for chronic headache—Long-term safety and efficacy Cephalalgia 2007 27 153 157 10.1111/j.1468-2982.2007.01272.x 17257236 79. Fontaine D. Sol J.C. Raoul S. Fabre N. Geraud G. Magne C. Sakarovitch C. Lanteri-Minet M. Treatment of refractory chronic cluster headache by chronic occipital nerve stimulation Cephalalgia 2011 31 1101 1105 10.1177/0333102411412086 21727143 80. Deer T.R. Mekhail N. Provenzano D. Pope J. Krames E. Leong M. Levy R.M. Abejon D. Buchser E. Burton A. The appropriate use of neurostimulation of the spinal cord and peripheral nervous system for the treatment of chronic pain and ischemic diseases: The Neuromodulation Appropriateness Consensus Committee Neuromodulation 2014 17 515 550 10.1111/ner.12208 25112889 81. Mekhail N. Levy R.M. Deer T.R. Kapural L. Li S. Amirdelfan K. Hunter C.W. Rosen S.M. Costandi S.J. Falowski S.M. Long-term safety and efficacy of closed-loop spinal cord stimulation to treat chronic back and leg pain (Evoke): A double-blind, randomised, controlled trial Lancet Neurol. 2020 19 123 134 10.1016/S1474-4422(19)30414-4 31870766 82. Cruccu G. Sommer C. Anand P. Attal N. Baron R. Garcia-Larrea L. Haanpaa M. Jensen T.S. Serra J. Treede R.D. EFNS guidelines on neuropathic pain assessment: Revised 2009 Eur. J. Neurol. 2010 17 1010 1018 10.1111/j.1468-1331.2010.02969.x 20298428 83. Lefaucheur J.P. Drouot X. Cunin P. Bruckert R. Lepetit H. Créange A. Wolkenstein P. Maison P. Keravel Y. Nguyen J.P. Motor cortex stimulation for the treatment of refractory peripheral neuropathic pain Brain 2009 132 Pt 6 1463 1471 10.1093/brain/awp035 19336459 84. Rasche D. Tronnier V.M. Clinical Significance of Invasive Motor Cortex Stimulation for Trigeminal Facial Neuropathic Pain Syndromes Neurosurgery 2016 79 655 666 10.1227/NEU.0000000000001353 27465843 85. Rasche D. Ruppolt M. Stippich C. Unterberg A. Tronnier V.M. Motor cortex stimulation for long-term relief of chronic neuropathic pain: A 10 year experience Pain 2006 121 43 52 10.1016/j.pain.2005.12.006 16480828 86. Parmar V.K. Gee L. Smith H. Pilitsis J.G. Supraspinal stimulation for treatment of refractory pain Clin. Neurol. Neurosurg. 2014 123 155 163 10.1016/j.clineuro.2014.05.026 24956545 87. Boccard S.G. Fitzgerald J.J. Pereira E.A. Moir L. Van Hartevelt T.J. Kringelbach M.L. Green A.L. Aziz T.Z. Targeting the affective component of chronic pain: A case series of deep brain stimulation of the anterior cingulate cortex Neurosurgery 2014 74 628 635 10.1227/NEU.0000000000000321 24739362 88. Lefaucheur J.P. Aleman A. Baeken C. Benninger D.H. Brunelin J. Di Lazzaro V. Filipović S.R. Grefkes C. Hasan A. Hummel F.C. Evidence-based guidelines on the therapeutic use of repetitive transcranial magnetic stimulation (rTMS): An update (2014–2018) Clin. Neurophysiol. 2020 131 474 528 10.1016/j.clinph.2019.11.002 31901449 89. Halker Singh R.B. Ailani J. Robbins M.S. Neuromodulation for the Acute and Preventive Therapy of Migraine and Cluster Headache Headache 2019 59 (Suppl. 2) 33 49 10.1111/head.13586 31291017 90. Gatchel R.J. Peng Y.B. Peters M.L. Fuchs P.N. Turk D.C. The biopsychosocial approach to chronic pain: Scientific advances and future directions Psychol. Bull. 2007 133 581 624 10.1037/0033-2909.133.4.581 17592957 91. Fregni F. Pascual-Leone A. Technology insight: Noninvasive brain stimulation in neurology—Perspectives on the therapeutic potential of rTMS and tDCS Nat. Clin. Pract. Neurol. 2007 3 383 393 10.1038/ncpneuro0530 17611487 92. Garcia-Larrea L. Peyron R. Motor cortex stimulation for neuropathic pain: From phenomenology to mechanisms Neuroimage 2007 37 (Suppl. 1) S71 S79 10.1016/j.neuroimage.2007.05.062 17644413 93. Silberstein S.D. Mechtler L.L. Kudrow D.B. Calhoun A.H. McClure C. Saper J.R. Liebler E.J. Rubenstein Engel E. Tepper S.J. ACT1 Study Group Non-Invasive Vagus Nerve Stimulation for the Acute Treatment of Cluster Headache: Findings From the Randomized, Double-Blind, Sham-Controlled ACT1 Study Headache 2016 56 1317 1332 10.1111/head.12896 27593728 PMC5113831 94. Najib U. Smith T. Hindiyeh N. Saper J. Nye B. Ashina S. McClure C.K. Marmura M.J. Chase S. Liebler E. Non-invasive vagus nerve stimulation for prevention of migraine: The multicenter, randomized, double-blind, sham-controlled PREMIUM II trial Cephalalgia 2022 42 560 569 10.1177/03331024211068813 35001643 95. Borsook D. Erpelding N. Becerra L. Losses and gains: Chronic pain and altered brain morphology Expert. Rev. Neurother. 2013 13 1221 1234 10.1586/14737175.2013.846218 24164053 96. Tansley S. Uttam S. Ureña Guzmán A. Yaqubi M. Pacis A. Parisien M. Deamond H. Wong C. Rabau O. Brown N. Single-cell RNA sequencing reveals time- and sex-specific responses of mouse spinal cord microglia to peripheral nerve injury and links ApoE to chronic pain Nat. Commun. 2022 13 843 10.1038/s41467-022-28473-8 35149686 PMC8837774 97. Fiore N.T. Yin Z. Guneykaya D. Gauthier C.D. Hayes J.P. D’Hary A. Butovsky O. Moalem-Taylor G. Sex-specific transcriptome of spinal microglia in neuropathic pain due to peripheral nerve injury Glia 2022 70 675 696 10.1002/glia.24133 35050555 PMC8852349 98. Saitoh Y. Hirayama A. Kato A. Kishima H. Shimokawa T. Oshino S. Hirata M. Tani N. Kato A. Yoshimine T. Motor cortex stimulation for central and peripheral deafferentation pain Pain 2007 128 290 298 10.1016/j.pain.2007.05.014 99. Velasco F. Velasco M. Jiménez F. Carrillo-Ruiz J.D. Castro G. Velasco A.L. Efficacy of motor cortex stimulation in the treatment of neuropathic pain: A randomized double-blind trial J. Neurosurg. 2008 108 698 706 10.3171/JNS/2008/108/4/0698 18377249 100. Johnson M.D. Burchiel K.J. Peripheral nerve stimulation for treatment of occipital neuralgia and other chronic headaches Neuromodulation 2014 17 678 684 10.1093/pm/pnaa083 101. Slotty P.J. Bara G. Walter J. Vesper J. Stimulation of the auriculotemporal nerve in patients with refractory cluster headache Cephalalgia 2015 35 891 895 10.1177/0333102414564893 102. Popiolek-Barczyk K. Mika J. Targeting the Microglial Signaling Pathways: New Insights in the Modulation of Neuropathic Pain Curr. Med. Chem. 2016 23 2908 2928 10.2174/0929867323666160607120124 27281131 PMC5427777 103. Kumbhare D.A. Elzibak A.H. Noseworthy M.D. Evaluation of Chronic Pain Using Magnetic Resonance (MR) Neuroimaging Approaches: What the Clinician Needs to Know Clin. J. Pain 2017 33 281 290 10.1097/AJP.0000000000000415 27518493 Figure 1 Schematic representation of the CTC. The caudal spinal trigeminal nucleus forms a continuum with the dorsal horn of the upper cervical spinal cord (C1–C3), allowing for the convergence of trigeminal (V1–V3) and cervical (C1–C3) nociceptive afferents. This integration provides the anatomical substrate for referred pain between cranial and cervical regions. Excitatory neurotransmitters (e.g., glutamate, substance P) and inhibitory mediators (e.g., GABA) modulate signal transmission within the CTC. These outputs influence both ascending nociceptive pathways and collateral projections involved in autonomic features. Abbreviations: CTC, cervicotrigeminal complex; V1–V3, trigeminal divisions; C1–C3, upper cervical nerves; PAG, periaqueductal gray; CGRP, calcitonin gene-related peptide; GABA, γ-aminobutyric acid. Figure 2 Peripheral drivers enhance nociceptive input to the CTC. Persistent input leads to central sensitization, characterized by the release of excitatory neurotransmitters (e.g., glutamate, substance P), disinhibition of pain pathways, and neuroimmune activation. Descending modulation from brainstem centers (PAG and RVM) normally balances excitatory and inhibitory influences. In refractory pain states, inhibitory control is reduced, and facilitation predominates, sustaining maladaptive pain signaling. Abbreviations: CTC, cervicotrigeminal complex; PAG, periaqueductal gray; RVM, rostral ventromedial medulla. Figure 3 Clinical decision algorithm and multimodal management pathway for refractory neuropathic pain of the head and neck. The framework illustrates a stepwise escalation from first-line pharmacological therapies to targeted interventional procedures, invasive and non-invasive neuromodulation, and comprehensive rehabilitative and psychological strategies. The model emphasizes integration rather than sequential isolation, with multidisciplinary input at each stage to address peripheral drivers, central sensitization, and network-level dysfunction. The algorithm incorporates refractoriness criteria ( Table 2 life-15-01457-t001_Table 1 Table 1 Overview of neuropathic, musculoskeletal, maxillofacial, dental, and otorhinolaryngological conditions converging on the CTC, with overlapping features and diagnostic clues. Disorder Pain Duration Pain Distribution Triggers Diagnostic Clues Primary Innervation Pain Type Typical Diagnostic Tests Key References Cervicogenic headache Chronic, recurrent Unilateral occipital → fronto-orbital Neck movement, sustained posture Reduced cervical ROM, improvement after diagnostic block C2–C3 dorsal roots, trigeminocervical convergence Deep, dull, non-pulsatile Cervical imaging, diagnostic block [ 11 52 Occipital neuralgia Paroxysmal, seconds–minutes Greater/lesser occipital nerves → orbit, temple Palpation, head movement Tenderness over nerve exit, pain relief with block Greater/lesser occipital nerves (C2) Sharp, stabbing Diagnostic nerve block [ 53 54 Temporomandibular disorders (TMD) Subacute–chronic Jaw, face, ear Mouth opening, clenching Joint clicks, tenderness of masseter/TMJ V3 (mandibular branch) Myofascial, mixed MRI TMJ, dental exam [ 48 55 Pulpitis (acute, irreversible) Acute Diffuse facial pain, jaws, temporal region, ear Thermal or mechanical stimuli Pulp vitality tests, Percussion tests V2–V3 Sharp, intense, spontaneous, lingering dental examination [ 56 Periapical periodontitis Dull, poorly localized Face, neck and ear of the affected side Mechanical stimuli The tooth feels high or extruded in occlusion, and pain increases in occlusal contact V2–V3 Deep, dull, continuous aching dental examination, Panoramic X-ray, CBCT [ 56 Post-extraction alveolitis (dry socket) Persistent Ear, temporal region, the affected side of the neck Mechanical stimuli, chewing Empty tooth alveolus, exposed bone, foul odor or taste V2–V3 Severe, throbbing, deep Dental examination [ 57 Iatrogenic dental injury (following endodontic treatment, implant placement or tooth extraction) Persistent Adjacent teeth, ipsilateral jaw, temporal region, ear, neck Mechanical or chemical stimuli Pain after dental treatment; examination is usually unremarkable V2–V3 Dysesthesia dental examination, Panoramic X-ray, CBCT [ 56 Atypical odontalgia Persistent Maxillary/mandibular teeth, diffuse face Chewing, dental procedures Pain without an odontogenic cause V2–V3 Burning, aching, dysesthesia Panoramic X-ray, dental examination, CBCT [ 50 58 Sinusitis-related facial pain Acute or chronic Maxillary, frontal, periorbital Positional, nasal congestion Nasal discharge, sinus tenderness V1–V2 Pressure-like CT sinuses [ 59 60 Glossopharyngeal neuralgia Paroxysmal, seconds Throat, base of tongue, ear Swallowing, talking Trigger points in the tonsillar fossa CN IX Electric shock-like MRI, neuro exam [ 61 62 Eagle syndrome Chronic, intermittent Throat, jaw, ear Swallowing, head rotation Palpable styloid process, CT elongation CN V, VII, IX, X Mixed neuropathic CT 3D reconstruction [ 63 64 Post-herpetic neuralgia (PHN) Chronic > 3 months Ophthalmic division (V1), sometimes C2–C3 Spontaneous, tactile Allodynia, history of shingles V1 ± cervical DRG Burning, neuropathic Clinical, dermatomal mapping [ 65 66 Migraine with occipital radiation Hours–days, recurrent Hemicranial → occipital/neck Stress, sleep, triggers Photophobia, aura, relief with triptans Trigeminovascular system, C2 afferents Pulsatile, throbbing Clinical (ICHD-3 criteria) [ 20 67 Chronic otalgia (non-otologic) Persistent Ear, periauricular, pharyngeal Swallowing, chewing Normal otoscopy CN V, VII, IX, X Referred pain ENT exam, exclude malignancy [ 68 69 Myofascial pain (SCM, trapezius) Chronic Neck, jaw, face Palpation, posture Trigger points Cervical muscle nociceptors → CTC Dull, aching, referred Palpation, EMG if needed [ 70 71 Persistent idiopathic facial pain (PIFP) Continuous, daily V2–V3, diffuse face Nonclear No identifiable pathology CN V (central) Burning, aching Diagnosis of exclusion [ 23 47 Abbreviations: ON, occipital neuralgia; CH, cervicogenic headache; GN, glossopharyngeal neuralgia; PHN, post-herpetic neuralgia; PIFP, persistent idiopathic facial pain; PTN, post-traumatic trigeminal neuropathy; TMD, temporomandibular disorder; AO, atypical odontalgia; ENT, ear, nose, and throat. life-15-01457-t002_Table 2 Table 2 Proposed refractoriness criteria for CTC-mediated head and neck neuropathic pain. Domain Criterion Duration and intensity Persistent pain ≥ 3 months with NRS ≥ 4/10 Pharmacological failure Non-response or intolerance to ≥2 first-line drug classes (gabapentinoids, tricyclic antidepressants, SNRIs) at maximally tolerated doses for ≥6 weeks each Interventional failure Lack of sustained benefit from ≥1 anatomically targeted procedure (e.g., occipital or trigeminal branch block ± pulsed radiofrequency) aligned with the pain generator Functional impact & Objective impairment on validated scales (e.g., BPI, HIT-6, DN4) and exclusion of surgically remediable or secondary causes (tumor, Chiari malformation, demyelination) life-15-01457-t003_Table 3 Table 3 Integrated therapeutic approaches for refractory neuropathic pain of the head and neck mediated by the CTC. Therapeutic Strategy Mechanism of Action Level of Evidence (OCEBM) Limitations Ref. Pharmacological therapies Gabapentinoids: α2δ calcium channel inhibition; TCAs/SNRIs: descending inhibitory facilitation; Topical agents: sodium channel blockade Level 1 (systematic reviews, RCTs in general neuropathic pain; limited head–neck data) Systemic side effects, limited efficacy in refractory CTC syndromes [ 3 5 Diagnostic/therapeutic nerve blocks Peripheral afferent interruption; diagnostic confirmation of pain generator Level 2–3 (small RCTs, observational studies) Transient benefit; requires repetition [ 74 75 Pulsed radiofrequency (PRF) Neuromodulation of peripheral nerves/cervical DRG without neurodestruction Level 3–4 (case series, small trials) Heterogeneous protocols, variable durability [ 74 Occipital nerve stimulation (ONS) Modulation of trigeminocervical complex activity; normalization of pain networks Level 1–2 (RCTs in migraine, observational studies in ON) Invasive, lead migration, infection [ 78 79 Spinal cord stimulation (SCS) Inhibition of dorsal horn hyperexcitability and CTC input integration Level 2–3 (case series, pilot RCTs) Invasive; costly; limited head/neck data [ 80 81 Motor cortex stimulation (MCS) Modulation of thalamo-cortical and brainstem nociceptive circuits Level 2–3 (systematic reviews, observational studies) Variable long-term efficacy; seizure risk [ 82 83 84 85 Deep brain stimulation (DBS) Target-specific modulation (PAG, posterior hypothalamus, VPM thalamus, ACC) Level 4 (case series; experimental) Surgical risk; heterogeneous targets; ethical concerns [ 86 87 Non-invasive neuromodulation (rTMS, tDCS, nVNS, TENS) Modulation of cortical and brainstem excitability; rebalancing descending pathways Level 2–3 (RCTs in migraine/TTH; emerging in neuropathic pain) Short-term benefit; protocol standardization needed [ 88 89 Multidisciplinary rehabilitation Reduction in musculoskeletal nociceptive load; coping; sleep regulation Level 2–3 (guideline-based, pragmatic trials) Supportive rather than curative [ 23 90 Abbreviations: TCA, tricyclic antidepressant; SNRI, serotonin–norepinephrine reuptake inhibitor; DRG, dorsal root ganglion; ONS, occipital nerve stimulation; SCS, spinal cord stimulation; MCS, motor cortex stimulation; DBS, deep brain stimulation; PAG, periaqueductal gray; VPM, ventral posteromedial nucleus; ACC, anterior cingulate cortex; rTMS, repetitive transcranial magnetic stimulation; tDCS, transcranial direct current stimulation; nVNS, non-invasive vagus nerve stimulation; TENS, transcutaneous electrical nerve stimulation. Level of evidence: Classified according to the Oxford Centre for Evidence-Based Medicine, where Level 1 = systematic review/RCT, Level 2 = RCT or strong observational, Level 3 = cohort/case–control, Level 4 = case series/poor-quality studies, Level 5 = expert opinion. life-15-01457-t004_Table 4 Table 4 Non-invasive neuromodulatory approaches for refractory neuropathic pain of the head and neck (CTC-related syndromes). Modality Mechanism of Action Targeted Structures Level of Evidence (OCEBM) Limitations Refs. rTMS Modulates cortical excitability; enhances descending inhibition via motor cortex & DLPFC M1, DLPFC, anterior cingulate, PAG–RVM pathways Level 2 (RCTs in chronic neuropathic pain, migraine) Short-lived effects; high inter-individual variability; repeated sessions required [ 88 91 tDCS Alters resting membrane potential and synaptic plasticity; strengthens inhibitory circuits M1, DLPFC, thalamocortical networks Level 3 (pilot studies in neuropathic pain) Small effect size; protocol heterogeneity [ 91 92 nVNS Stimulates cervical vagal afferents → NTS → LC & PAG → central pain/autonomic network modulation NTS, LC, PAG, limbic circuits Level 2 (RCTs in migraine, cluster headache) Requires daily use; device-dependent; long-term benefit uncertain [ 93 94 TENS Peripheral neuromodulation of large-diameter afferents; gate control & endogenous opioid activation Cervical and trigeminal dermatomes; dorsal horn interneurons Level 3–4 (small trials, chronic pain guidelines) Limited efficacy in severe refractory pain; requires compliance [ 23 Abbreviations: rTMS, repetitive transcranial magnetic stimulation; tDCS, transcranial direct current stimulation; nVNS, non-invasive vagus nerve stimulation; TENS, transcutaneous electrical nerve stimulation; NTS, nucleus tractus solitarius; LC, locus coeruleus; PAG, periaqueductal gray; RVM, rostral ventromedial medulla. Level of evidence: Classified according to the Oxford Centre for Evidence-Based Medicine, where Level 1 = systematic review/RCT, Level 2 = RCT or strong observational, Level 3 = cohort/case–control, Level 4 = case series/poor-quality studies, Level 5 = expert opinion. ",
  "metadata": {
    "Title of this paper": "Evaluation of Chronic Pain Using Magnetic Resonance (MR) Neuroimaging Approaches: What the Clinician Needs to Know",
    "Journal it was published in:": "Life",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471411/"
  }
}