{
  "title": "Paper_400",
  "abstract": "pmc BMC Surg BMC Surg 66 bmcsurg BMC Surgery 1471-2482 BMC PMC12482222 PMC12482222.1 12482222 12482222 41024065 10.1186/s12893-025-03211-1 3211 1 Research Tailoring treatment for esophageal cancer: a retrospective comparison of chemoradiation with and without esophagectomy http://orcid.org/0000-0002-0988-8988 Toapichattrakul Piyapasara 1 Santasup Kittinon 2 Kittirungsi Kittisak 2 Seemakajohn Thanapat 2 Kittiwan Phubodee 2 Chumachote Ausareeya 3 http://orcid.org/0000-0001-6299-6606 Chakrabandhu Bandhuphat 4 http://orcid.org/0000-0002-9860-2098 Chakrabandhu Somvilai somjee@hotmail.com 1 1 https://ror.org/05m2fqn25 grid.7132.7 0000 0000 9039 7662 Division of Radiation Oncology, Department of Radiology, Faculty of Medicine, Chiang Mai University, 2 https://ror.org/05m2fqn25 grid.7132.7 0000 0000 9039 7662 Faculty of Medicine, Chaing Mai University, 3 https://ror.org/05m2fqn25 grid.7132.7 0000 0000 9039 7662 Nursing Service Division, Faculty of Medicine, Maharaj Nakorn Chiang Mai Hospital, Chiang Mai University, 4 https://ror.org/05m2fqn25 grid.7132.7 0000 0000 9039 7662 Department of Surgery, Faculty of Medicine, Chiang Mai University, 29 9 2025 2025 25 478387 417 25 4 2025 4 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Locally advanced esophageal cancer remains a significant therapeutic challenge, with the optimal treatment strategy still debate. While previous studies suggest that concurrent chemoradiation therapy (CCRT) can improve survival, the role of esophagectomy following CCRT in patients with partial or no response has not been well-characterized, particularly in resource-limited settings. This study aimed to evaluate the survival benefit of esophagectomy following CCRT, with particular focus on non-complete responders (non-CR). Methods We conducted a retrospective cohort study of 132 patients with locally advanced esophageal cancer treated at Maharaj Nakorn Chiang Mai Hospital between 2013 and 2022. Patients were categorized based on initial treatment into preoperative CCRT or definitive CCRT groups. Overall survival (OS) and progression-free survival (PFS) were compared using multivariable Cox regression. A secondary analysis stratified patients into three groups by clinical response and surgical status: CR without surgery, non-CR with surgery, and non-CR without surgery. To reduce baseline imbalances and selection bias, inverse probability of treatment weighting (IPTW) was applied in the non-CR subgroup initially intended for preoperative CCRT. Results Baseline characteristics were balanced except for tumor location. Median follow-up was 1.23 years (IQR: 0.64–2.50). Overall, 1-/2-year PFS was 27.97%/17.80%, while OS was 60.47%/37.33%. Median survival did not differ between preoperative versus definitive CCRT (1.20 vs. 1.52 years, p p p p p p Conclusion Esophagectomy after CCRT provides survival benefits equivalent to achieving CR with CCRT alone, particularly for non-CR patients. These results advocate for surgical integration as a salvage strategy for incomplete responders in locally advanced esophageal cancer. Supplementary Information The online version contains supplementary material available at 10.1186/s12893-025-03211-1. Keywords Esophageal cancer Concurrent chemoradiation Esophagectomy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Esophageal cancer remains a global health challenge, with significant regional variations in incidence and histological subtypes. In Asia, squamous cell carcinoma predominates, whereas adenocarcinoma is more common in Western countries [ 1 2 4 Preoperative CCRT or neoadjuvant CCRT followed by surgery has been shown in randomised trials to improve local control and long-term outcomes for patients with resectable esophageal cancer [ 5 6 7 The necessity of surgery for patients who respond to CCRT is also debated. Previous studies randomized patients with complete response (CR) or partial response (PR) following CCRT to either surgical intervention or nonsurgical management but demonstrated no significant survival benefit from surgery [ 5 6 8 This study aims to provide real-world evidence on the progression-free survival (PFS) and overall survival (OS) of patients with locally advanced esophageal cancer undergoing either preoperative CCRT followed by surgery or definitive CCRT alone. By analysing the impact of surgical status and response to CCRT on survival outcomes, our findings can inform clinical decision-making and refine treatment strategies for this challenging disease. Methods Trial design and patients An observational study was a nonrandomized investigation with a retrospective cohort design. The study was conducted on patients who were diagnosed with esophageal carcinoma and underwent CCRT at Maharaj Nakorn Chiang Mai Hospital between January 1, 2013, and December 31, 2022. The exclusion criteria included patients who were diagnosed with cervical esophagus, who had received palliative treatment, who had undergone radiotherapy without concurrent chemotherapy, who had undergone upfront esophagectomy, who had experienced recurrent disease, or who had metastatic disease. Treatment protocol and outcome variables All patients were restaged for esophageal cancer according to the AJCC 8th edition criteria. Patients were categorized into two groups on the basis of resectability as determined by specialized upper gastrointestinal surgeons: those receiving preoperative CCRT for resectable or potentially resectable cases and those receiving definitive CCRT for cases considered unresectable. The radiation treatment protocol began with computed tomography (CT) simulation with contrast media. Target delineation included gross tumor volume (GTV), which encompasses all enhancing lesions detected on CT, and was expanded to the clinical target volume (CTV) by adding a circumferential margin of 1–1.5 cm and a superior–inferior margin of 3–5 cm. All elective lymph nodes were included on the basis of the location of the tumor. The planning target volume (PTV) was expanded by an additional 5 millimeters (mm). The prescribed dose ranged from 41.4 to 60 Gy and was delivered in 1.8–2 Gy fractions five times per week. Treatment planning was performed via either 3-dimensional conformal radiotherapy (3D-CRT) or intensity-modulated radiotherapy (IMRT). The concurrent chemotherapy regimen was selected by the medical oncologist, with options at our institution including carboplatin plus paclitaxel, cisplatin or carboplatin plus 5-fluorouracil (5-FU), capecitabine, or single-agent platinum (cisplatin or carboplatin). No adjuvant chemotherapy after CCRT. Response assessment after CCRT After completing CCRT, patients underwent initial response evaluation with contrast-enhanced CT and esophagogastroduodenoscopy (EGD) at 4–12 weeks post-treatment. Treatment response was classified according to RECIST criteria into complete response (CR), partial response (PR), stable disease (SD), or progressive disease (PD) [ 9 1 Fig. 1 STROBE flow chart. A total of 252 patients with esophageal cancer were retrospectively screened, and 132 were included for analysis. A n B Following response assessment, the decision regarding esophagectomy was made by a specialized upper gastrointestinal surgeon. This decision was based on a combination of disease-related factors (tumor extent and resectability on post-treatment CT) and patient-related factors, including performance status, comorbidities, and overall fitness for surgery. Shared decision-making was conducted with the patient prior to finalizing the treatment plan. The criteria for surgical indications are based on the follow-up CT scan results  Cervical esophageal cancer is not a candidate for surgery; the upper border of the tumor arises higher than the sternal notch. If the tumor is a complete response to CCRT, which is evaluated by a combination of EGD (complete disappearance of the tumor, including ulceration, and also no cancer cells were found in biopsy specimens) and CT scan (no tumor was observed according to RECIST criteria). If the patient’s performance status is satisfactory, we discuss surgery with them as an optional procedure [ 9 10 The tumor displays a partial or minimal response. Surgery is considered only if there is no invasion of vital organs (T4b), which includes the aorta (defined as less than 90 degrees of aortic attachment in 20 mm cephalocaudal length of the esophagus, less than 110 degrees of aortic attachment in 10 mm cephalocaudal length of the esophagus, and no loss of triangulation fat between the esophagus, aorta, and spine). Tracheal and bronchial invasion is assessed when the stratified structure of the border of contact with the airway, caused by either the primary tumor or lymph node metastases, is unclear. Additionally, we evaluate bronchoscopic findings if the airway exhibits compression, displacement, or narrowing. Invasion of resectable adjacent organs (T4a, which includes the pleura, pericardium, or diaphragm) is still considered a criterion for surgical candidacy [ 11 We also check the patient’s fitness, aiming for an FEV1 of more than 40% and METs of more than 4. We forfeit the surgery if the patient is not sufficiently fit [ 12 13 If the tumor progresses as the distant metastasis is identified or the tumor invades into adjacent vital organs (T4b), the decision of surgery is forfeited, and the oncologist is responsible for the further systemic treatment. Surgical technique The surgery in this study was performed with a minimally invasive 3-field esophagectomy technique. After the anesthesia was induced, the double-lumen tracheal tube intubation was used to give space in the right thorax. The patient was placed in a semi-prone position, and the surgery on the thoracic part was done with a video-assisted technique. The trocars were placed at the 5th, 7th, and 9th intercostal spaces along the midaxillary line, with the optional trocar on the 8th intercostal space along the anterior axillary line if the lung was not fully collapsed and needed additional traction. The esophagus was dissected along with its lymph node with a combination of monopolar cautery and advanced bipolar. The azygos vein was transected with a vascular staple. After the completion of the dissection, the esophagus was transected with a stapling device while both ends of the transection were sutured together to facilitate the conduit passage. The intercostal drainage was placed via the 9th space trocar, and then the thoracic wounds were closed. In case the dissection was difficult, which might be due to tumor infiltration, radiation-induced inflammation, or previous pulmonary infection, the surgery was converted to thoracotomy. The patient was repositioned to a supine position with a slight raising of the left shoulder to expose the left lateral side of the neck. The abdominal part of the surgery was done in a laparoscopic-assisted fashion, starting by putting in an umbilical trocar with a standard gastrectomy working trocars with four 5 mm trocars on both sides of the upper abdomen. The Nathanson liver retractor was used to create exposure at the diaphragmatic crus. The dissection was started at the left diaphragmatic crus until the distal esophagus could be brought down into the abdominal cavity. The left gastric and the left gastroepiploic vessels were controlled and ligated, while the right gastric and the right gastroepiploic vessels were preserved. After the greater curvature of the stomach to the anterior part of the pancreas was completely dissected free from the transverse colon, a 5 cm incision was made at the upper midline to facilitate the conduit preparation with a stapling device. The pyloroplasty was also performed in this step. The 10 cm cervical incision was made along the anterior border of the left sternocleidomastoid muscle, and the dissection was continued until the proximal part of the esophagus could be brought up to the cervical space. Then the conduit was passed through the native route of the esophagus, and the anastomosis was done with a hand-sewn technique . Table 1 Baseline characteristics of the whole cohort, preoperative CCRT group, and definitive CCRT group Characteristics Whole cohort Preoperative CCRT ( n Definitive CCRT ( n p Age 61.04 (8.96) 60.92(9.97) 61.12(8.19) 0.900 Sex 0.800 Male 115 (87.12) 49(85.96) 66(88.00) Female 17(12.88) 8(14.04) 9(12.00) Histopathology 0.576 SCCA 123(93.18) 52(91.23) 71(94.67) AC 8(6.06) 4(7.02) 4(5.33) AC-SQ 1(0.76) 1(1.75) 0(0.00) ECOG 0.281 0 52(40.00) 19(33.33) 33(44.00) 1 78(60.00) 38(66.67) 42(56.00) Location 0.001* Upper 35(26.52) 6(10.53) 29(38.67) Mid 66(50.00) 33(57.89) 33(44.00) lower 31(23.48) 18(31.58) 13(17.33) Tumor volume(cm 3 44.01 (27.73-64.02) 44.58(29.95-56.78) 42.55(25.89-73.05) 0.858 T stage 0.045* 1 5(3.85) 1(1.75) 4(5.48) 2 27(20.77) 16(28.07) 11(15.07) 3 76(58.46) 35(61.40) 41(56.16) 4 22(16.92) 5(8.77) 17(23.29) N stage 0.603 0 47(35.88) 24(42.11) 23(31.08) 1 73(55.73) 29(50.88) 44(59.46) 2 7(5.34) 3(5.26) 4(5.41) 3 4(3.05) 1(1.75) 3(4.05) Radiation technique 0.455 3D-CRT 19(14.39) 10(17.54) 9(12) IMRT 113(85.61) 47(82.46) 66(88.00) Radiation dose <0.001 41.4-46 22(16.67) 18(31.58) 4(5.33) 50-50.4 81(61.36) 36(63.16) 45(60.00) >50.4-60 29(21.97) 3(5.26) 26(34.67) Concurrent chemotherapy regimen 0.476 Carboplatin plus paclitaxel 59(49.58) 24(45.28) 35(53.03) Platinum-based plus 5-FU 55(46.22) 28(52.83) 27(40.91) Capecitabine 2(1.68) 0(0.00) 2(3.03) Single platinum 3(2.52) 1(1.89) 2(3.03) Not available 13 Abbreviations SCCA AC AC-SQ SD IQR 3D-CRT IMRT 5-FU All data were collected, and PFS was calculated from the end of CCRT to the time of disease progression. OS was defined as the duration from the date of pathologic diagnosis to the date of death from any cause. Statistical analysis The initial analysis described baseline characteristics, presenting frequencies and percentages for categorical variables and means ± standard deviations (SDs) or medians and interquartile ranges (IQRs) for continuous variables. Fisher’s exact test was used for categorical variables, and t tests and Wilcoxon rank-sum tests (Mann‒Whitney U test) were applied for continuous variables. Additionally, 1- and 2-year PFS and OS rates were calculated, with median survival estimated via Laplace regression. Cox regression analysis was performed to assess effect sizes, hazard ratios (HRs), and p The secondary analysis focused on outcomes on the basis of actual surgical status. Patients were categorized according to whether they underwent surgery, and PFS and OS outcomes were further evaluated via Cox regression analysis to assess the impact of actual surgical status on survival. Finally, we compared patients who achieved CR after CCRT, non-CR patients who underwent surgery, and non-CR patients who did not undergo surgery. This analysis used Cox regression to compare PFS and OS across these response and surgical status groups, providing further insights into the survival benefits associated with achieving CR or adding surgery in non-CR patients. Additionally, propensity score–based inverse probability weighting (IPTW) was performed to further validate the survival benefit of surgery in non-complete responders, as detailed in the Supplementary Text. The study was retrospectively registered in the Thai Clinical Trials Registry (TCTR) (TCTR20250514002; registered on May 14, 2025). Results A total of 132 patients with locally advanced esophageal cancer were included, comprising 57 in the preoperative CCRT group and 75 in the definitive CCRT group. The mean age was 61.04 years, and the majority were male (87.12%) with squamous cell carcinoma (93.18%) as the predominant histology. Baseline characteristics were largely balanced between groups, including age, sex, histopathology, ECOG performance status, tumor volume, N stage, radiation technique, and chemotherapy regimens (Table 1 p p p For the entire cohort, the median follow-up period was 1.23 years (IQR: 0.64–2.50 years). The 1-year PFS rate was 27.97%, decreasing to 17.80% at 2 years. The OS rate was 60.47% at 1 year and 37.33% at 2 years. Preoperative CCRT vs definitive CCRT The median survival time was 1.20 years for patients in the preoperative CCRT group and 1.52 years for those in the definitive CCRT group, with no statistically significant difference ( p 2 2 2 Fig. 2 Survival Outcomes in Preoperative vs. Definitive CCRT Group. A B C D p p Table 2 Comparison of progression-free survival (PFS) and overall survival (OS) between the preoperative CCRT and definitive CCRT groups Preoperative CCRT Definitive CCRT p Univariable analysis PFS 1 1.03(0.71–1.49) 0.886 OS 1 1.05(0.71–1.55) 0.829 Multivariable analysis PFS 1 1.16(0.77–1.76) 0.476 OS 1 1.13(0.73–1.75) 0.604 Multivariable analysis adjusted for age, sex, histopathology, ECOG, tumor location, T-stage, N-stage, Tumor volume Response After CCRT Following CCRT, treatment responses were evaluated in 116 of the 132 patients. Clinical complete response (CR) was achieved in 19 patients (16.38%), all of whom did not undergo surgery. Partial response (PR) or stable disease (SD) was observed in 77 patients (66.38%), whereas progressive disease (PD) was documented in 20 patients (17.24%), none of whom underwent surgery. (Table 3 Table 3 Response after CCRT Response Preop CCRT followed by Surgery ( n Preop CCRT without Surgery ( n Definitive CCRT n CR 0(0) 5(11.90%) 14(18.67%) PR or SD 13(86.67%) 25(59.52%) 39(52.00%) PD 0(0) 8(19.05%) 12(16.00%) Missing 2(13.33%) 4(9.52%) 10(13.33%) Abbreviations CR PR SD PD In terms of PFS and OS (Figure 3 p p p p Fig. 3 Survival outcomes according to tumor response after concurrent chemoradiotherapy (CCRT). Panels ( A B C D Secondary analysis (Preoperative CCRT followed by surgery versus preoperative CCRT without surgery versus definitive CCRT) For the secondary analysis, we assessed the surgical status of each patient. Patients who received preoperative CCRT followed by radical surgery and who were initially considered resectable or potentially resectable were categorized as “preoperative CCRT followed by surgery” (n = 15). Those who received preoperative CCRT but did not undergo surgery were classified as “Preoperative CCRT without surgery” (n = 42). Patients deemed unresectable were grouped as “Definitive CCRT” (n = 75). Univariable analysis (Table 4 p In the multivariable analysis (Table 4 4 4 Fig. 4 Survival outcomes by treatment strategy in patients with locally advanced esophageal cancer. Panels ( A B C D Table 4 Univariable and multivariable analyses of progression-free survival (PFS) and overall survival (OS) in patients treated with preoperative concurrent chemoradiation therapy (CCRT) followed by surgery, preoperative CCRT without surgery, and definitive CCRT Preoperative CCRT with Surgery Preoperative CCRT without Surgery p Definitive CCRT p Univariable PFS 1 2.85(1.45–5.65) 0.003* 2.01(1.08–3.75) 0.029* OS 1 2.43(1.16–5.10) 0.020* 1.98(0.97–4.02) 0.061 Multivariable PFS 1 3.60(1.65–7.86) 0.001* 2.55(1.29–5.07) 0.008* OS 1 3.00(1.34–6.72) 0.008* 2.43(1.13–5.24) 0.023* Multivariable analysis adjusted for age, sex, histopathology, ECOG, tumor location, T-stage, N-stage, tumor volume For further analysis, we compared survival outcomes between patients who achieved CR after CCRT and those who did not. Patients in the CR group (without surgery) demonstrated similar PFS (Figure 5 5 p p p p Fig. 5 Survival outcomes by treatment response and surgical intervention following concurrent chemoradiotherapy (CCRT). Panels ( A B C D To address potential selection bias between non-complete responders (non-CR) who underwent surgery and those who received CCRT alone, we applied inverse probability of treatment weighting (IPTW) to construct a balanced pseudocohort. This analysis included only patients initially assigned to the preoperative CCRT group who were subsequently classified as non-CR, as indicated by the dashed-line box in the STROBE flowchart (n=44). The IPTW-adjusted Cox proportional hazards models demonstrated a significant survival benefit associated with esophagectomy, detailed in Supplementary Text. As shown in Figure 6 p 6 p 6  Fig. 6 Adjusted survival curves using inverse probability of treatment weighting (IPTW) in non-complete responders (non-CR) after preoperative CCRT. Panels (A) and (B) show Cox proportional hazards regression survival curves for progression-free survival (PFS) and overall survival (OS), respectively, comparing patients who underwent esophagectomy versus those who did not. The analysis was restricted to patients with non-complete response (non-CR) following preoperative concurrent chemoradiotherapy (CCRT). Propensity score–based IPTW was applied to adjust for baseline imbalances between surgical and non-surgical groups, creating a pseudocohort to simulate a balanced comparison. The curves demonstrate improved survival in the surgical group after adjustment Discussion This study analysed data from a retrospective cohort at a single institute. Our study provides important insights into PFS and OS among patients with locally advanced esophageal cancer treated with either preoperative CCRT followed by surgery or definitive CCRT alone. Earlier randomized trials showed mixed outcomes, with some reporting better local control but no clear survival benefit, often due to increased surgical morbidity. [ 5 6 2 3 14 Our primary comparison between preoperative CCRT and definitive CCRT revealed no significant differences in PFS or OS after multivariable adjustment. However, this analysis was limited by the non-randomized nature of treatment allocation, which was based on initial assessments of tumor resectability, patient performance status, and physician discretion—factors that inherently introduced selection bias. For instance, the definitive CCRT group had a higher incidence of upper-thoracic and T4 tumors, consistent with a more advanced disease profile. To mitigate this bias, we conducted a secondary analysis based on actual surgical status following completion of CCRT. This strategy reflects real-world clinical practice, in which patients are re-evaluated for resectability after treatment before a final surgical decision is made. Response assessments were performed 4–12 weeks post-CCRT using contrast-enhanced CT and esophagogastroduodenoscopy (EGD). Although PET/CT is increasingly used in contemporary protocols, its routine implementation was not feasible in our setting due to reimbursement limitations, which reflects common constraints in resource-limited healthcare environments. Following post-CCRT response assessment using RECIST criteria and EGD findings, As expected, patients achieving CR had the most favorable prognosis. Non-CR patients achieved poorer survival outcome. Patients were then classified into three clinically relevant subgroups: (1) clinical complete response (CR) without surgery, (2) non-CR with surgery, and (3) non-CR without surgery. This finding aligns with prior systematic reviews and meta-analyses, which suggest that esophagectomy may be safely omitted in CR patients without compromising survival outcomes. [ 8 15 16 To further validate this benefit and mitigate confounding, we performed an inverse probability of treatment weighting (IPTW) analysis in the non-CR subgroup initially planned for surgery. After adjustment for baseline characteristics, the surgical group continued to demonstrate superior survival outcomes. These findings suggest that surgery can partially compensate for an incomplete response and should be considered a critical salvage option in non-CR patients. Importantly, two key variables—tumor location and radiation dose—differed significantly between treatment groups at baseline and could have influenced survival outcomes. However, both were included in the IPTW model to mitigate their potential confounding effects. After adjustment, the observed survival benefit of surgery in non-CR patients remained robust, suggesting that the improved outcomes were not merely attributable to these baseline imbalances. This reinforces the therapeutic role of esophagectomy as a salvage strategy in appropriately selected patients who fail to achieve a complete response. Our results align with prior evidence, including a retrospective Korean study that similarly reported survival gains with surgery in non-CR patients. [ 17 18 19 20 Identifying clinical CR remains challenging, with no universally accepted recommendations. In our study, esophagoscopy and CT were utilized for post-CCRT response assessment, as PET/CT was not routinely incorporated. While the pre-SANO trial explored PET/CT for response evaluation, it did not demonstrate a clear survival advantage over standard CT and endoscopy. [ 21 15 15 16 22 Our study has several limitations due to its retrospective, single-center design, which may limit the generalizability of findings and introduce residual confounding despite statistical adjustment. Although we used multivariable Cox regression and IPTW to minimize confounding, we acknowledge that residual confounding remains possible due to the non-randomized design. Clinical decisions regarding surgery were influenced by factors not captured in our dataset, such as frailty, nutritional status, social support, and subtle comorbidities beyond ECOG performance status. These unmeasured variables may have influenced both treatment decisions and survival outcomes. Therefore, the observed benefit of surgery in non-CR patients should be interpreted with caution, and prospective validation is needed. The decision to proceed with surgery was based on physician judgment and multidisciplinary assessment, which may have involved unmeasured factors such as frailty or nutritional status not captured in our dataset. Clinical response was assessed using contrast-enhanced CT and endoscopy without routine biopsy or PET/CT, potentially leading to misclassification of complete response and impacting survival comparisons. The lack of routine PET/CT also limited the precision of post-treatment response evaluation, reflecting resource constraints common in real-world practice. Additionally, access to adjuvant nivolumab—a checkpoint inhibitor now considered standard in trimodal therapy—was limited during the study period due to reimbursement barriers, which may have negatively affected outcomes, particularly among non-CR patients. [ 23 Despite these limitations, our decade of real-world data offers valuable insights into treatment outcomes for patients with locally advanced esophageal cancer. Our findings highlight the importance of accurate post-CCRT response assessment in informing individualized treatment decisions, particularly for identifying non-CR patients who may benefit from salvage esophagectomy. As minimally invasive surgical techniques become more widely adopted, the potential benefits of surgery may outweigh associated risks in appropriately selected patients. Integrating response-guided decision-making with evolving surgical approaches may help improve oncologic outcomes while minimizing treatment-related morbidity. These results support a shift toward adaptive, response-based strategies that align with prospective trial evidence and contribute to the advancement of personalized care. Conclusions This real-world study highlights the critical role of post-CCRT response assessment in guiding treatment decisions for locally advanced esophageal cancer. Patients who achieved a clinical CR after CCRT had favorable outcomes without the need for surgery. However, for patients with an incomplete response (non-CR), esophagectomy significantly improved survival outcomes and served as an effective salvage strategy. These findings underscore the importance of individualized, response-adapted management, particularly in non-CR patients. Integrating clinical reassessment with evolving surgical techniques may enhance outcomes and inform future treatment paradigms. Supplementary Information  Supplementary Material 1. Abbreviations AC Adenocarcinoma AC SQ–Adenosquamous carcinoma AJCC American Joint Committee on Cancer CCRT Concurrent chemoradiation therapy CR Complete response CRT Chemoradiotherapy CT Computed tomography CTV Clinical target volume ECOG Eastern Cooperative Oncology Group (performance status) EGD Esophagogastroduodenoscopy GTV Gross tumor volume HR Hazard ratio IMRT Intensity–modulated radiotherapy IQR Interquartile range NCDB National Cancer Database OS Overall survival PD Progressive disease PFS Progression–free survival PR Partial response PTV Planning target volume SCCA Squamous cell carcinoma SD Standard deviation SD Stable disease 3D CRT–3–dimensional conformal radiotherapy 5 FU–5–fluorouracil Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors would like to thank all staff members of the Department of Radiation Oncology, Department of Radiology, Faculty of Medicine, Chiang Mai University, for their valuable support and contributions throughout this study. Authors’ contributions P.T.: Conceptualization, Methodology, Formal analysis, Data curation, Writing – Original Draft.K.S., K.K., T.S., P.K., A.C.: Data acquisition, Resources.B.C.: Validation, Writing – Review & Editing.S.C.: Conceptualization, Supervision, Writing – Review & Editing.All authors read and approved the final manuscript and agree to be accountable for all aspects of the work. Funding This publication was prepared without any external source of funding. Data availability The datasets used and/or analysed during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate This retrospective study was approved by the Research Ethics Committee and Institutional Review Board (IRB), Faculty of Medicine, Chiang Mai University, Chiang Mai, Thailand (Study Code: FAC-MED-2566-0546), and conducted in accordance with the Declaration of Helsinki. The committee was chaired by Emeritus Professor Panja Kulapongs. The requirement for informed consent was waived by the ethics committee due to the retrospective nature of the study and use of anonymized data. All patient data were de-identified and analyzed anonymously to protect confidentiality. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Zhu H Wang Z Deng B Mo M Wang H Chen K Epidemiological landscape of esophageal cancer in Asia: results from GLOBOCAN 2020 Thorac Cancer 2023 14 11 992 1003 10.1111/1759-7714.14835 36918204 PMC10101841 Zhu H, Wang Z, Deng B, Mo M, Wang H, Chen K, et al. Epidemiological landscape of esophageal cancer in Asia: results from GLOBOCAN 2020. Thorac Cancer. 2023;14(11):992–1003. 10.1111/1759-7714.14835. 36918204 10.1111/1759-7714.14835 PMC10101841 2. Obermannova R Alsina M Cervantes A Leong T Lordick F Nilsson M Oesophageal cancer: ESMO clinical practice guideline for diagnosis, treatment and follow-up Ann Oncol 2022 33 10 992 1004 10.1016/j.annonc.2022.07.003 35914638 Obermannova R, Alsina M, Cervantes A, Leong T, Lordick F, Nilsson M, et al. Oesophageal cancer: ESMO clinical practice guideline for diagnosis, treatment and follow-up. Ann Oncol. 2022;33(10):992–1004. 10.1016/j.annonc.2022.07.003. 35914638 10.1016/j.annonc.2022.07.003 3. National Comprehensive Cancer Network. NCCN clinical practice guidelines in oncology: esophageal and esophagogastric junction cancers. 2024. [cited 2024 Sep 1]. Available from: https://www.nccn.org/professionals/physician_gls/pdf/esophageal.pdfN 4. Kitagawa Y Ishihara R Ishikawa H Ito Y Oyama T Oyama T Esophageal cancer practice guidelines 2022 edited by the Japan Esophageal Society: part 1 Esophagus 2023 20 3 343 72 10.1007/s10388-023-00993-2 36933136 PMC10024303 Kitagawa Y, Ishihara R, Ishikawa H, Ito Y, Oyama T, Oyama T, et al. Esophageal cancer practice guidelines 2022 edited by the Japan Esophageal Society: part 1. Esophagus. 2023;20(3):343–72. 10.1007/s10388-023-00993-2. 36933136 10.1007/s10388-023-00993-2 PMC10024303 5. Stahl M Stuschke M Lehmann N Meyer HJ Walz MK Seeber S Chemoradiation with and without surgery in patients with locally advanced squamous cell carcinoma of the esophagus J Clin Oncol 2005 23 10 2310 7 10.1200/JCO.2005.00.034 15800321 Stahl M, Stuschke M, Lehmann N, Meyer HJ, Walz MK, Seeber S, et al. Chemoradiation with and without surgery in patients with locally advanced squamous cell carcinoma of the esophagus. J Clin Oncol. 2005;23(10):2310–7. 10.1200/JCO.2005.00.034. 15800321 10.1200/JCO.2005.00.034 6. Bedenne L Michel P Bouche O Milan C Mariette C Conroy T Chemoradiation followed by surgery compared with chemoradiation alone in squamous cancer of the esophagus: FFCD 9102 J Clin Oncol 2007 25 10 1160 8 10.1200/JCO.2005.04.7118 17401004 Bedenne L, Michel P, Bouche O, Milan C, Mariette C, Conroy T, et al. Chemoradiation followed by surgery compared with chemoradiation alone in squamous cancer of the esophagus: FFCD 9102. J Clin Oncol. 2007;25(10):1160–8. 10.1200/JCO.2005.04.7118. 17401004 10.1200/JCO.2005.04.7118 7. Yao J Zhao X Chen J Liu T Song Y Dang J Treatment strategies for elderly patients with locally advanced esophageal cancer: a systematic review and meta-analysis BMC Cancer 2024 24 1 1101 10.1186/s12885-024-12853-y 39232734 PMC11373433 Yao J, Zhao X, Chen J, Liu T, Song Y, Dang J. Treatment strategies for elderly patients with locally advanced esophageal cancer: a systematic review and meta-analysis. BMC Cancer. 2024;24(1):1101. 10.1186/s12885-024-12853-y. 39232734 10.1186/s12885-024-12853-y PMC11373433 8. Park J Yea JW Oh SA Park JW Omitting surgery in esophageal cancer patients with complete response after neoadjuvant chemoradiotherapy: a systematic review and meta-analysis Radiat Oncol 2021 16 1 219 10.1186/s13014-021-01947-7 34775988 PMC8591817 Park J, Yea JW, Oh SA, Park JW. Omitting surgery in esophageal cancer patients with complete response after neoadjuvant chemoradiotherapy: a systematic review and meta-analysis. Radiat Oncol. 2021;16(1):219. 10.1186/s13014-021-01947-7. 34775988 10.1186/s13014-021-01947-7 PMC8591817 9. Eisenhauer EA Therasse P Bogaerts J Schwartz LH Sargent D Ford R New response evaluation criteria in solid tumours: revised RECIST guideline (version 1.1) Eur J Cancer 2009 45 2 228 47 10.1016/j.ejca.2008.10.026 19097774 Eisenhauer EA, Therasse P, Bogaerts J, Schwartz LH, Sargent D, Ford R, et al. New response evaluation criteria in solid tumours: revised RECIST guideline (version 1.1). Eur J Cancer. 2009;45(2):228–47. 10.1016/j.ejca.2008.10.026. 19097774 10.1016/j.ejca.2008.10.026 10. Tahara M Ohtsu A Hironaka S Boku N Ishikura S Miyata Y Clinical impact of criteria for complete response (CR) of primary site to treatment of esophageal cancer Jpn J Clin Oncol 2005 35 6 316 23 10.1093/jjco/hyi095 15961436 Tahara M, Ohtsu A, Hironaka S, Boku N, Ishikura S, Miyata Y, et al. Clinical impact of criteria for complete response (CR) of primary site to treatment of esophageal cancer. Jpn J Clin Oncol. 2005;35(6):316–23. 10.1093/jjco/hyi095. 15961436 10.1093/jjco/hyi095 11. Mine S, Tanaka K, Kawachi H, Shirakawa Y, Kitagawa Y, Toh Y et al. Japanese Classification of Esophageal Cancer, 12th Edition: Part I. Esophagus. 2024;21(3):179–215. 10.1007/s10388-024-01054-y. 10.1007/s10388-024-01054-y PMC11199297 38568243 12. Jiang G, Zhang L, Zhu Y, Chen C, Zhou X, Liu J, Zhang P, Wang H, Xie B, Wang H, Jiang L, Fan J, Zhao D, Chen Q, Duan L, He W, Zhou Y, Liu H, Zhao X, Qin X, Yang Y, Ning Y, Xie D, Dai J. Clinical consensus on preoperative pulmonary function assessment in patients undergoing pulmonary resection (first edition). Curr Chall Thorac Surg. 2019;1:7. 10.21037/ccts.2019.06.01.c 13. Raslau D, Bierle DM, Stephenson CR, Mikhail MA, Kebede EB, Mauck KF. Preoperative Cardiac Risk Assessment. Mayo Clin Proc. 2020;95(5):1064-79. 10.1016/j.mayocp.2019.08.013. 10.1016/j.mayocp.2019.08.013 32107033 14. Chapman BC Weyant M Hilton S Hosokawa PW McCarter MD Gleisner A Analysis of the National Cancer Database esophageal squamous cell carcinoma in the United States Ann Thorac Surg 2019 108 5 1535 42 10.1016/j.athoracsur.2019.05.053 31302081 Chapman BC, Weyant M, Hilton S, Hosokawa PW, McCarter MD, Gleisner A, et al. Analysis of the National Cancer Database esophageal squamous cell carcinoma in the United States. Ann Thorac Surg. 2019;108(5):1535–42. 10.1016/j.athoracsur.2019.05.053. 31302081 10.1016/j.athoracsur.2019.05.053 15. Park SR Yoon DH Kim JH Kim YH Kim HR Lee HJ A randomized phase III trial on the role of esophagectomy in complete responders to preoperative chemoradiotherapy for esophageal squamous cell carcinoma (ESOPRESSO) Anticancer Res 2019 39 9 5123 33 10.21873/anticanres.13707 31519624 Park SR, Yoon DH, Kim JH, Kim YH, Kim HR, Lee HJ, et al. A randomized phase III trial on the role of esophagectomy in complete responders to preoperative chemoradiotherapy for esophageal squamous cell carcinoma (ESOPRESSO). Anticancer Res. 2019;39(9):5123–33. 10.21873/anticanres.13707. 31519624 10.21873/anticanres.13707 16. Castoro C Scarpa M Cagol M Alfieri R Ruol A Cavallin F Complete clinical response after neoadjuvant chemoradiotherapy for squamous cell cancer of the thoracic oesophagus: is surgery always necessary? J Gastrointest Surg 2013 17 8 1375 81 10.1007/s11605-013-2269-3 23797888 Castoro C, Scarpa M, Cagol M, Alfieri R, Ruol A, Cavallin F, et al. Complete clinical response after neoadjuvant chemoradiotherapy for squamous cell cancer of the thoracic oesophagus: is surgery always necessary? J Gastrointest Surg. 2013;17(8):1375–81. 10.1007/s11605-013-2269-3. 23797888 10.1007/s11605-013-2269-3 17. Yu J Kim JH Kim SB Park SR Kim YH Kim HR Role of esophagectomy after chemoradiation therapy in patients with locally advanced squamous cell carcinoma: a comparative analysis stratified by clinical response to chemoradiation therapy Cancer Res Treat 2022 54 4 1148 56 10.4143/crt.2021.885 34942686 PMC9582466 Yu J, Kim JH, Kim SB, Park SR, Kim YH, Kim HR, et al. Role of esophagectomy after chemoradiation therapy in patients with locally advanced squamous cell carcinoma: a comparative analysis stratified by clinical response to chemoradiation therapy. Cancer Res Treat. 2022;54(4):1148–56. 10.4143/crt.2021.885. 34942686 10.4143/crt.2021.885 PMC9582466 18. Piessen G Messager M Mirabel X Briez N Robb WB Adenis A Is there a role for surgery for patients with a complete clinical response after chemoradiation for esophageal cancer? An intention-to-treat case-control study Ann Surg 2013 258 5 793 9 10.1097/SLA.0000000000000228 24096755 Piessen G, Messager M, Mirabel X, Briez N, Robb WB, Adenis A, et al. Is there a role for surgery for patients with a complete clinical response after chemoradiation for esophageal cancer? An intention-to-treat case-control study. Ann Surg. 2013;258(5):793–9. 10.1097/SLA.0000000000000228. discussion 9-800. 24096755 10.1097/SLA.0000000000000228 19. Tachimori Y Kanamori N Uemura N Hokamura N Igaki H Kato H Salvage esophagectomy after high-dose chemoradiotherapy for esophageal squamous cell carcinoma J Thorac Cardiovasc Surg 2009 137 1 49 54 10.1016/j.jtcvs.2008.05.016 19154902 Tachimori Y, Kanamori N, Uemura N, Hokamura N, Igaki H, Kato H. Salvage esophagectomy after high-dose chemoradiotherapy for esophageal squamous cell carcinoma. J Thorac Cardiovasc Surg. 2009;137(1):49–54. 10.1016/j.jtcvs.2008.05.016. 19154902 10.1016/j.jtcvs.2008.05.016 20. Biere SS van Berge Henegouwen MI Maas KW Bonavina L Rosman C Garcia JR Minimally invasive versus open oesophagectomy for patients with oesophageal cancer: a multicentre, open-label, randomised controlled trial Lancet 2012 379 9829 1887 92 10.1016/S0140-6736(12)60516-9 22552194 Biere SS, van Berge Henegouwen MI, Maas KW, Bonavina L, Rosman C, Garcia JR, et al. Minimally invasive versus open oesophagectomy for patients with oesophageal cancer: a multicentre, open-label, randomised controlled trial. Lancet. 2012;379(9829):1887–92. 10.1016/S0140-6736(12)60516-9. 22552194 10.1016/S0140-6736(12)60516-9 21. Noordman BJ Spaander MCW Valkema R Wijnhoven BPL van Berge Henegouwen MI Shapiro J Detection of residual disease after neoadjuvant chemoradiotherapy for oesophageal cancer (preSANO): a prospective multicentre, diagnostic cohort study Lancet Oncol 2018 19 7 965 74 10.1016/S1470-2045(18)30201-8 29861116 Noordman BJ, Spaander MCW, Valkema R, Wijnhoven BPL, van Berge Henegouwen MI, Shapiro J, et al. Detection of residual disease after neoadjuvant chemoradiotherapy for oesophageal cancer (preSANO): a prospective multicentre, diagnostic cohort study. Lancet Oncol. 2018;19(7):965–74. 10.1016/S1470-2045(18)30201-8. 29861116 10.1016/S1470-2045(18)30201-8 22. Eyck BM van der Wilk BJ Noordman BJ Wijnhoven BPL Lagarde SM Hartgrink HH Updated protocol of the SANO trial: a stepped-wedge cluster randomised trial comparing surgery with active surveillance after neoadjuvant chemoradiotherapy for oesophageal cancer Trials 2021 22 1 345 10.1186/s13063-021-05274-w 34001287 PMC8127221 Eyck BM, van der Wilk BJ, Noordman BJ, Wijnhoven BPL, Lagarde SM, Hartgrink HH, et al. Updated protocol of the SANO trial: a stepped-wedge cluster randomised trial comparing surgery with active surveillance after neoadjuvant chemoradiotherapy for oesophageal cancer. Trials. 2021;22(1):345. 10.1186/s13063-021-05274-w. 34001287 10.1186/s13063-021-05274-w PMC8127221 23. Kelly RJ Ajani JA Kuzdzal J Zander T Van Cutsem E Piessen G Adjuvant nivolumab in resected esophageal or gastroesophageal junction cancer N Engl J Med 2021 384 13 1191 203 10.1056/NEJMoa2032125 33789008 Kelly RJ, Ajani JA, Kuzdzal J, Zander T, Van Cutsem E, Piessen G, et al. Adjuvant nivolumab in resected esophageal or gastroesophageal junction cancer. N Engl J Med. 2021;384(13):1191–203. 10.1056/NEJMoa2032125. 33789008 10.1056/NEJMoa2032125 ",
  "metadata": {
    "Title of this paper": "Adjuvant nivolumab in resected esophageal or gastroesophageal junction cancer",
    "Journal it was published in:": "BMC Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482222/"
  }
}