{
  "title": "Paper_224",
  "abstract": "pmc Neurotherapeutics Neurotherapeutics 1472 neurother Neurotherapeutics 1933-7213 1878-7479 Elsevier PMC12491791 PMC12491791.1 12491791 12491791 40450458 10.1016/j.neurot.2025.e00616 S1878-7479(25)00094-7 e00616 1 Original Article Neuroprotective effects of G9a inhibition and cannabinoid receptor activation in Alzheimer's disease through a pharmacological approach Bellver-Sanchis Aina a Ribalta-Vilella Marta b Lillo Jaume c d e Ortuño-Sahagún Daniel f Franco Rafael c g h Pallàs Mercè a i Navarro Gemma c d g Griñán-Ferré Christian Christian.grinan@ub.edu a i ⁎ a b c d e f g h i ⁎ Christian.grinan@ub.edu 9 2025 31 5 2025 22 5 498231 e00616 26 11 2024 16 5 2025 20 5 2025 31 05 2025 04 10 2025 04 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Epigenetic alterations are key contributors to Alzheimer's disease (AD), driving age-related cognitive decline. This study explores the combined neuroprotective effects of G9a histone methyltransferase inhibition (via UNC0642) and cannabinoid receptor activation (CB1R: ACEA; CB2R: JWH133) in AD models. We used HEK-293T cells and hippocampal neurons to demonstrate that G9a inhibition selectively enhances CB1R-mediated ERK/cAMP signaling. In SAMP8 mice (sporadic AD model), we evaluated the effects of pharmacological inhibition of G9a (UNC0642), combined with CB 1 2 1 Trem2, Cd33, iNOS Graphical abstract Image 1 Keywords Neurodegenerative diseases Cannabinoids Histone methyltransferase Behavior Neuroinflammation Synaptic plasticity pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Alzheimer's disease (AD) is a debilitating neurodegenerative disorder that poses one of the most significant challenges to modern medicine [ 1 2 [3] [4] [5] The ECS, consisting of endogenous cannabinoids, such as anandamide (AEA) and 2-arachidonoylglycerol (2-AG), their receptors (CB 1 2 6 1 2 7 2 1 8 9 In parallel with research into the ECS, epigenetic changes have been recognized as key factors in the pathogenesis of AD [ 10 11 10 12 13 14 15 5 [16] [17] [18] [19] [20] [21] [22] [23] The interplay between G9a, histone modifications, and cannabinoid receptor expression reveals a compelling epigenetic dimension to the dysregulation of the endocannabinoid system (ECS) observed in AD. Rather than resulting from genetic mutations, these changes arise from alterations in gene expression-specifically, G9a-mediated histone methylation that represses CB1 receptor (CB1R) transcription. G9a catalyzes the dimethylation of histone H3 at lysine 9 (H3K9me2), a repressive mark that silences the CNR1 [24] [25] [26] 25 27 CNR2 24 28 24 25 29 Moreover, the potential role of G9a in modulating neuroinflammatory responses by regulating CB 2 2 2 30 In this study, we investigated the neuroprotective potential of the G9a inhibitor UNC0642 through in vitro and in vivo experiments, assessing its effects on molecular and pathological markers of AD. We also evaluated the therapeutic potential of synthetic agonists of cannabinoid receptors, JWH133 and ACEA, individually and in combination with UNC0642, in the SAMP8 mouse model of accelerated senescence. By integrating G9a inhibition with cannabinoid receptor activation, this work aims to elucidate the interplay between epigenetic regulation and endocannabinoid signaling, providing insights into novel therapeutic strategies for AD. Materials and methods Cell culture and transient transfection HEK-293T cells were grown in Dulbecco's modified Eagle's medium (DMEM) (15-013-CV, Corning, NY, USA) supplemented with 2 ​mM L-glutamine, 100 U/ml penicillin/streptomycin, MEM Non-Essential Amino Acids Solution (1/100) and 5 ​% (v/v) heat-inactivated Fetal Bovine Serum (FBS) (Invitrogen, Paisley, Scotland, UK). Cells were maintained in a humidified atmosphere with 5 ​% CO 2 HEK-293T cells grown in 6-well dishes were transiently transfected using the PEI method (PolyEthylenImine, Sigma-Aldrich, St. Louis, MO, USA). The cells were incubated for 4 ​h with the corresponding cDNAs, PEI (5.47 ​mM in residual nitrogen), and 150 ​mM NaCl in the serum-deprived medium. The medium was then replaced with a fresh, complete culture medium, and the cells were incubated for 48 ​h before the experimental procedures. To prepare primary neuronal cultures, the brain was removed from C57/BL6 mice embryos (E19). The hippocampal was dissected, and the meninges were carefully removed and digested with 0.25 ​% trypsin at 37 ​°C for 20 ​min. Trypsinization was stopped by washing the tissue. Cells were transferred to a cell suspension by passage through 0.8 ​mm and 0.5 ​mm needles, followed by passage through mesh with 100 ​μm pores. Neurons were resuspended in medium and plated at a density of 1 ​× ​106 ​cells/ml in 6-well dishes in neurobasal medium (21103-049, Gibco, Paisley, Scotland, UK), supplemented with 2 ​mM L-glutamine, 100 U/mL penicillin/streptomycin, a MEM preparation of non-essential amino acids (1/100), and 2 ​% (v/v) B27 supplement (17504-044, Gibco, Paisley, Scotland, UK). Cultures were maintained for 12 days at 37 ​°C in a humidified atmosphere with 5 ​% CO 2 cAMP levels determination Two hours before initiating the experiment, transfected HEK-293T cells or neuronal primary cultures medium was replaced with, respectively, serum-free DMEM or neurobasal mediums. Cells were then detached, resuspended in DMEM serum-free medium containing 50 ​μM zardaverine, and plated in 384-well microplates (2500 ​cells/well). Cells were pretreated with G9a inhibitor or vehicle (15 ​min) and stimulated with selective agonists (15 ​min) before adding 0.5 ​μM Forskolin to increase cAMP levels. 15 min later, 500 ​nM fluorophore-containing ULight™ antibody (5 ​μl) and cAMP-Europium (cAMP-Eu) (5 ​μl) were added. Incubation was prolonged for 1 ​h at 25 ​°C, and the PHERAstar Flagship reader equipped with an HTRF optical module (BMG Lab Technologies, Offenburg, Germany) was used for measuring the 665/620 ​nm ratio. Extracellular signal-regulated kinase phosphorylation assays To determine the phosphorylation of extracellular signal-regulated kinase 1/2 (ERK1/2), transfected HEK-293T cells were grown in 96-well plates. On the day of the experiment, the medium was replaced with serum-free medium 2 ​h before initiating the experiment. Cells were pretreated at 25 ​°C for 10 ​min with the G9a inhibitor or vehicle and stimulated for 7 ​min with selective agonists. Then, cells were washed twice with cold PBS before adding the lysis buffer (15 ​min treatment in agitation). Thereafter, 10 ​μL of the supernatant was added to each well in a white ProxiPlate 384-well plate, and ERK 1/2 phosphorylation was determined using an AlphaScreen®SureFire® kit (PerkinElmer) according to the manufacturer's instructions. Readings were recorded using an EnSpire® Multimode Plate Reader (PerkinElmer, Waltham, MA, USA). The reference value (100 ​%) was determined in the absence of any treatment (basal). The effect of the ligands was expressed as a percentage of the baseline value. Animals 6-month-old SAMR1 and SAMP8 male mice (n ​= ​62) were used for behavioral and molecular studies. Animals had free access to food and water and were maintained under standard temperature conditions (22 ​± ​2 ​°C), controlled humidity, and a 12-h light/dark cycle (300 lx/0 lx). SAMP8 animals were randomly assigned to the following groups: SP8 Ct (treated with vehicle, n ​= ​10), SP8 UNC0642 (treated with 1 ​mg/kg G9a inhibitor, n ​= ​7), SP8 ACEA (treated with 1 ​mg/kg CB 1 2 1 2 Fig. 1 Fig. 1 Scheme of experimental design. Fig. 1 Behavioral and cognitive tests Object location test (OLT) The OLT was performed to investigate the spatial memory of mice when exposed to a new location of an already-known object. This test is based on the spontaneous tendency of mice to spend more time exploring a new object than exploring a known object and location to recognize when an object has been misplaced. The test was conducted in a wooden box (50 ​× ​50 ​× ​25 ​cm), in which three of the walls were white, and the last one was black. The animals were habituated to the empty open field arena for 10 ​min on the first day. On the second day, two identical objects were placed in front of the black wall, equidistant from each other and the wall. The objects were 10 ​cm high. The animals were brought into the open field arena and allowed to explore the objects and the surroundings for 10 ​min. Afterward, the animals were returned to their home cages, and the OLT device was cleaned with 70 ​% ethanol. On the third day, an object was placed in front of the opposite white wall to assess the spatial performance of the mice. The trials were recorded with a camera mounted above the open field area. The total exploration time was determined by counting the amount of time (in seconds) spent sniffing the object in the new location (TN) and the object in the old location (TO). The discrimination index (DI) defined as (TN ​− ​TO)/(TN ​+ ​TO), was calculated to assess cognitive performance. Novel object recognition test (NORT) Short- and long-term memory was analyzed with NORT. The test was performed in a 90°, two-armed, 25-cm-long, and 20-cm-high black maze. The light intensity in the center of the field was 30 lux. The objects to be discriminated were plastic figures (object A, 5.25-cm-high; and object B, 4.75-cm-high). The mice were acclimatized to the device for 10 ​min on each of 3 consecutive days. On day 4, they underwent a 10-min acquisition trial (habituation phase), in which they were placed in the maze and allowed to explore two identical novel objects (A ​+ ​A or B ​+ ​B) at the end of each arm. To avoid a bias in object preference, objects A and B were counterbalanced so that half of the animals in each experimental group were initially confronted with object A and the other half with object B. Object C was used as the new object for both groups for the analysis of long-term memory. The 10-min retention trials (test phase) took place 2 ​h (short-term; A ​+ ​B or B ​+ ​A) and 24 ​h (long-term; A ​+ ​C or B ​+ ​C) after the habituation phase. During the test phase, one of the two identical objects was replaced by a new one, and the time spent exploring the new object (TN) and the old object (TO) was measured manually. The discrimination index (DI) was calculated as (TN ​− ​TO/TN ​+ ​TO). Sniffing or touching objects with the nose and forepaws was considered exploration. The maze, surface, and objects were cleaned with 70 ​% ethanol between trials to eliminate olfactory cues. Biochemical experiments Protein levels determination by western blotting (WB) For WB, tissue samples were homogenized in a lysis buffer containing phosphatase and protease inhibitors (Cocktail II, Sigma-Aldrich, St. Louis, MO, USA), and protein concentration was determined by Bradford's method. Aliquots of 15 ​μg of protein samples from different groups were separated by Sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE) (8–14 ​%) and transferred onto polyvinylidene difluoride membranes (PVDF, Millipore). Afterward, membranes were blocked in 5 ​% Bovine Serum Albumin (BSA) in 0.1 ​% Tris-buffered saline with Tween 20 (TBS-T) for 1 ​h at room temperature, followed by overnight incubation at 4 ​°C with the primary antibodies presented in Supplementary Table 1 The next day, membranes were washed 3 times for 5 ​min with Tris-buffered saline with Tween® 20 Detergent (TBS-T) and incubated with secondary antibodies (mouse or rabbit) for 1 ​h at room temperature. Chemiluminescence-based detection was used to view the immunoreactive proteins, following the manufacturer's protocol (ECL Kit, Millipore). Then, digital images were acquired using an Amersham Imager 680, and semiquantitative analyses were performed using ImageLab Software (BioRad, Hercules, CA, USA). Finally, results were expressed in Arbitrary Units (AU), considering the WT control mice group as 100 ​%. Protein loading was routinely monitored by immunodetection of GAPDH. In the same way, for the phosphorylated protein ratio, normalization against GADPH was done before the ratio value calculation. Quantitative real-time PCR Total RNA isolation was carried out using TRIsure™ reagent following the manufacturer's instructions (Bioline Reagent, London, UK). RNA content in the samples was measured at 260 ​nm, and the purity of the samples was determined by the A260/280 and A260/230 ratio in a NanoDrop™ ND-1000 (Thermo Scientific). Reverse transcription-Polymerase chain reaction (RT-PCR) was performed as previously described, to quantify the mRNA expression. Real-time PCR (qPCR) was performed with the StepOnePlus™ Real-Time PCR System (Applied Biosystems™, Vilnius, Lithuania, #4376600), using the SYBR Green PCR Master Mix (Applied Biosystems™, Vilnius, Lithuania, #K0253). Briefly, each reaction mixture consisted of 6.75 ​μL of cDNA (at a concentration of 2 ​μg), 0.75 ​μL of each primer (at a concentration of 100 ​nM), and 6.75 ​μL of SYBR Green PCR Master Mix (2×). The comparative cycle threshold (Ct) method (ΔΔCt) was used to analyze the data, using the housekeeping gene (β-actin) level to normalize for differences in sample loading and preparation. The primers are listed in Supplementary Table 2 n Golgi staining, dendritic length, and spine density The SAMP8 mice were euthanized by cervical dislocation, and the whole brain was removed from the skull (n ​= ​3). Then, the Golgi staining protocol was performed using the FD Rapid GolgiStain™ Kit (D Neurotechnologies, Inc., #PK401) according to the manufacturer's instructions. Images of neurons for dendritic branching analysis were captured using a Leica Thunder microscope (Leica Thunder Imager; Leica Microsystems) at a 40× magnification objective. Neurite length and neuron complexity were measured using NeuronJ macros and Advanced Sholl Analysis. The number of intersections (branch points) within concentric circles with a radius of 10 ​μm was calculated and compared between groups. Images of neurons for spine density analysis were taken at 63× magnification of the oil objective. Spine density was expressed as the number of spines per 50 ​μm dendrite at a maximum distance of 150 ​μm from the soma. Statistical analysis Data analysis was performed using GraphPad Prism Version 9 software (GraphPad Software, San Diego, CA, USA). The group size differed varied depending on the power analysis and the expertise of the authors. Statistical analysis was performed for studies where the size of each group was n ​= ​5–6 samples per group for in vivo studies and n ​= ​3–4 replicates for in vitro studies. Results were expressed as the mean ​± ​standard error of the mean (SEM). A normality test was performed to ensure that parametric tests could be used. Means were compared using one-way ANOVA followed by Tukey's post hoc T Results G9a histone methyltransferase selectively modulates CB 1 2 The HEK-293T-cell-based heterologous system was used to express the human versions of the cannabinoid receptors (CB 1 2 p 1 1 1 Fig. 2 2 p 2 Fig. 2 1 Fig. 2 1 2 Fig. 2 ERK1/2 phosphorylation and cAMP level determination assays in HEK-293T cells expressing CB 1 2 1 2 1 2 A-C D-G D-G Fig. 2 A similar approach was undertaken to check the effect of G9a inhibition on the levels of a second messenger, cAMP, that is regulated by CBR activation. Both cannabinoid receptors are coupled to G i 1 2 Fig. 2 1 2 Fig. 2 Fig. 2 1 2 Fig. 2 1 2 Differences in the expression of CB receptor, of microglial activation markers and of proinflammatory cytokines after G9a inhibition and cannabinoid receptor activation in SAMP8 animals While under our experimental conditions, the relative expression of CB 1 2 Fig. 3 2 Fig. 3 Fig. 3 Relative expression of transcripts coding for CBRs (A), for microglial activation markers (B) and for proinflammatory molecules (C). Fig. 3 Considering that CB 2 [31] [32] [33] [34] Fig. 3 Trem2 and Cd33 iNOS Arg1 Fig. 3 Trem2, Cd33, iNOS Arg1 Fig. 3 Regarding astroglia and pro-inflammatory markers, we analyzed Gfap, Il-6, Tnf-α, 33 35 36 Gfap TNF-α Il-6 Fig. 3 Gfap Tnf-α Fig. 3 Modulation of immediate-early genes and enhanced neuronal repair following a single or dual therapeutic approach based on G9a inhibition or CBR activation in SAMP8 Expression of immediate-early genes (IEGs) changes rapidly in response to various pathophysiological changes, as in AD [ 37 38 Catechol-O-Methyltransferase Comt , Early Growth Response 1 Egr1 Zif268 , and DNA Methyltransferase 3 Alpha Dnmt3a Dnmt3a Fig. 4 Fig. 4 Relative expression of transcripts coding for IEGs (A) and protein expression of IEGs (B G). B. C to G. Fig. 4 The soluble amyloid precursor protein beta (sAPPβ), a cleavage product of the amyloid precursor protein (APP), has been implicated in AD due to its role in the amyloidogenic pathway, which contributes to the formation of amyloid-beta plaques [ 19 Fig. 4 39 40 Fig. 4 Fig. 4 Fig. 4 Fig. 4 Improved synaptic plasticity and cognitive performance after G9a inhibition, cannabinoid receptor agonism, or dual therapy approach in SAMP8 Synaptic dysfunction and synapse loss are key features of AD [ 41 Fig. 5 Fig. 5 Fig. 5 Fig. 5 Dendrite parameters and behavioral studies upon pharmacological treatment with CB receptor agonists and G9a inhibitor. C D to F Fig. 5 Cognitive performance was assessed using the NORT and OLT tasks to evaluate working and spatial memory in SAMP8 mice. Untreated SAMP8 animals significantly reduced the discrimination index (DI) for both short- and long-term memory compared to untreated SAMR1 controls ( Fig. 5 Fig. 5 Fig. 5 1 Discussion This study provides compelling evidence for the neuroprotective effects of G9a inhibition combined with cannabinoid receptor activation in AD, offering a multifaceted therapeutic approach to address cognitive decline and neurodegeneration. By integrating in vitro and in vivo approaches, we shed light on the complex interplay between epigenetic regulation and the ECS, emphasizing this dual intervention's mechanistic and therapeutic implications. We also demonstrated a potential synergistic effect for critical endpoints in the study of new therapeutic approaches in AD treatment, suggesting, in part, the dual approach presented in this study. Specifically, this synergistic interaction between G9a inhibition (via UNC0642) and CB 1 Moreover, the selection of dosing regimens for UNC0642, ACEA, and JWH133 in this study was informed by prior preclinical investigations, with adjustments to suboptimal levels to unmask potential synergistic interactions. For UNC0642, acute doses of 5 ​mg/kg (i.p.) have demonstrated robust target engagement in vivo, achieving a plasma Cmax of 947 ​ng/mL and suppressing H3K9me2 levels in xenograft models [ 22 42 1 Regarding the CB 1 43 1 44 The CB 2 45 46 46 This dosing strategy-employing submaximal concentrations of UNC0642 (1 ​mg/kg), ACEA (1 ​mg/kg), and JWH133 (1 ​mg/kg)-enabled the identification of synergistic neuroprotective and anti-inflammatory effects that would otherwise be obscured at higher, fully efficacious doses. The approach is consistent with methodologies in polypharmacology, where subthreshold dosing reveals emergent interactions between pathways [ 47 First, we examined the modulation of CBR signaling by G9a in HEK-293T cells and primary hippocampal neuron cultures. Interestingly, our findings offer insights into the complex interplay between epigenetic regulation by G9a and the endocannabinoid system. Our results demonstrate that G9a inhibition selectively modulates CB 1 2 1 1 2 [48] [49] [50] 1 15 1 51 52 Regarding the cognitive results, we showed a cognitive recovery observed in SAMP8 mice treated with UNC0642 and ACEA, particularly in spatial memory (OLT task), underscoring this dual approach's therapeutic efficacy. These results are significant, as they demonstrate not only behavioral recovery but also molecular changes derived from these pharmacological interventions. The chronic inflammatory process in neurodegeneration and AD has been identified as a primary contributor to disease progression [ 53 [54] [55] [56] 1 2 2 2 57 On the other hand, synaptic plasticity plays a crucial role in age-related cognitive decline and AD [ 58 59 [52] [53] [54] 23 On the other hand, the differential effects observed between single and dual treatments emphasize the complexity of the mechanisms underlying their neuroprotective actions. While CB 1 2 51 57 60 61 15 Fig. 5 Moreover, future studies should explore the long-term effects of these treatments and investigate potential side effects or tolerance development. Additionally, examining the impact of these treatments on different AD hallmarks would provide a more comprehensive understanding of their potential to modify disease progression. Recent work by Rothammer et al. (2022) [ 62 1 Conclusion This study underscores the therapeutic promise of combining G9a inhibition with targeted cannabinoid receptor modulation as a multifaceted approach to AD. G9a inhibition epigenetically primes the neural environment by reversing repressive histone methylation, thereby restoring CB 1 1 1 2 Authors contribution Conceptualization, C.G.-F.; methodology, A.B.-S., G.N., M.R.-V., D.O.-S., R.F., M.P., J.L. and C.G.-F.; Analyzed the data and drafted the manuscript, J.L., G.N., A.B.-S., M.R.-V., R.F., M.P. and C.G.-F.; writing—original draft preparation, A.B.-S., G.N., R.F., D.O.-S., M.P., and C.G.-F.; writing—review and editing, A.B.-S., G.N., R.F., D.O.-S., M.P., and C.G.-F.; supervision, C.G.-F. All authors have read and agreed to the published version of the manuscript. Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Kazemeini S. Nadeem-Tariq A. Shih R. Rafanan J. Ghani N. Vida T.A. From plaques to pathways in Alzheimer’s disease: the mitochondrial-neurovascular-metabolic hypothesis Int J Mol Sci 25 2024 11720 39519272 10.3390/ijms252111720 PMC11546801 2 Dubois B. von Arnim C.A.F. Burnie N. Bozeat S. Cummings J. Biomarkers in Alzheimer’s disease: role in early and differential diagnosis and recognition of atypical variants Alzheimers Res Ther 15 2023 175 37833762 10.1186/s13195-023-01314-6 PMC10571241 3 Li S. Huang Y. Yu L. Ji X. Wu J. Impact of the cannabinoid system in Alzheimer’s disease Curr Neuropharmacol 21 2023 715 35105293 10.2174/1570159X20666220201091006 PMC10207907 4 Abate G. Uberti D. Tambaro S. Potential and limits of cannabinoids in Alzheimer's disease therapy Biology (Basel) 10 2021 542 34204237 10.3390/biology10060542 PMC8234911 5 Aso E. Ferrer I. Cannabinoids for treatment of Alzheimer's disease: moving toward the clinic Front Pharmacol 5 2014 37 24634659 10.3389/fphar.2014.00037 PMC3942876 6 Capolupo I. Miranda M.R. Musella S. Di Sarno V. Manfra M. Ostacolo C. Exploring endocannabinoid system: unveiling new roles in modulating ER stress Antioxidants 13 2024 1284 39594426 10.3390/antiox13111284 PMC11591047 7 Bala K. Porel P. Aran K.R. Emerging roles of cannabinoid receptor CB2 receptor in the central nervous system: therapeutic target for CNS disorders Psychopharmacology (Berl) 2024 1 16 10.1007/s00213-024-06683-w 39264450 8 Joers V. Murray B.C. McLaughlin C. Oliver D. Staley H. Coronado J. Modulation of cannabinoid receptor 2 alters neuroinflammation and reduces formation of alpha-synuclein aggregates in a rat model of nigral synucleinopathy J Neuroinflammation 21 2024 240 39334169 10.1186/s12974-024-03221-5 PMC11438102 9 Xiong Y. Lim C.-S. Understanding the modulatory effects of cannabidiol on Alzheimer's disease Brain Sci 11 2021 1211 34573232 10.3390/brainsci11091211 PMC8472755 10 Paniri A. Hosseini M.M. Akhavan-Niaki H. Alzheimer's disease-related epigenetic changes: novel therapeutic targets Mol Neurobiol 61 2024 1282 1317 37700216 10.1007/s12035-023-03626-y 11 De Plano L.M. Saitta A. Oddo S. Caccamo A. Epigenetic changes in Alzheimer's disease: DNA methylation and histone modification Cells 13 2024 719 38667333 10.3390/cells13080719 PMC11049073 12 Xiao X. Liu X. Jiao B. Epigenetics: recent advances and its role in the treatment of Alzheimer's disease Front Neurol 11 2020 538301 10.3389/fneur.2020.538301 PMC7594522 33178099 13 Scheer S. Zaph C. The lysine methyltransferase G9a in immune cell differentiation and function Front Immunol 8 2017 429 28443098 10.3389/fimmu.2017.00429 PMC5387087 14 Ni Y. Shi M. Liu L. Lin D. Zeng H. Ong C. G9a in cancer: mechanisms, therapeutic Advancements, and clinical implications Cancers (Basel) 16 2024 2175 38927881 10.3390/cancers16122175 PMC11201431 15 Bellver-Sanchis A. Geng Q. Navarro G. Ávila-López P.A. Companys-Alemany J. Marsal-García L. G9a inhibition promotes neuroprotection through GMFB regulation in Alzheimer’s disease Aging Dis 15 2024 311 37307824 10.14336/AD.2023.0424-2 PMC10796087 16 Selkoe D.J. Alzheimer’s disease: genes, proteins, and therapy Physiol Rev 81 2001 741 766 11274343 10.1152/physrev.2001.81.2.741 17 Lu Y. Anderson H.D. Cannabinoid signaling in health and disease Can J Physiol Pharmacol 95 2017 311 327 28263083 10.1139/cjpp-2016-0346 18 Cao C. Li Y. Liu H. Bai G. Mayl J. Lin X. The potential therapeutic effects of THC on Alzheimer’s disease J Alzheim Dis 42 2014 973 984 10.3233/JAD-140093 25024327 19 Ramírez B.G. Blázquez C. Del Pulgar T.G. Guzmán M. Ceballos M.L. Prevention of Alzheimer’s disease pathology by cannabinoids: neuroprotection mediated by blockade of microglial activation J Neurosci 25 2005 1904 1913 15728830 10.1523/JNEUROSCI.4540-04.2005 PMC6726060 20 Tachibana M. Sugimoto K. Nozaki M. Ueda J. Ohta T. Ohki M. G9a histone methyltransferase plays a dominant role in euchromatic histone H3 lysine 9 methylation and is essential for early embryogenesis Genes Dev 16 2002 1779 1791 12130538 10.1101/gad.989402 PMC186403 21 Schaefer A. Sampath S.C. Intrator A. Min A. Gertler T.S. Surmeier D.J. Control of cognition and adaptive behavior by the GLP/G9a epigenetic suppressor complex Neuron 64 2009 678 691 20005824 10.1016/j.neuron.2009.11.019 PMC2814156 22 Liu F. Barsyte-Lovejoy D. Li F. Xiong Y. Korboukh V. Huang X.P. Discovery of an in vivo chemical probe of the lysine methyltransferases G9a and GLP J Med Chem 56 2013 8931 8942 24102134 10.1021/jm401480r PMC3880643 23 Griñán-Ferré C. Marsal-García L. Bellver-Sanchis A. Kondengaden S.M. Turga R.V. Vázquez S. Pharmacological inhibition of G9a/GLP restores cognition and reduces oxidative stress, neuroinflammation and β-Amyloid plaques in an early-onset Alzheimer’s disease mouse model Aging (Albany NY) 11 2019 11591 31804189 10.18632/aging.102558 PMC6932909 24 Luo Y. Zhang J. Chen L. Chen S-R. Chen H. Zhang G. Histone methyltransferase G9a diminishes expression of cannabinoid CB1 receptors in primary sensory neurons in neuropathic pain J Biol Chem 295 2020 3553 3562 32024693 10.1074/jbc.RA119.011053 PMC7076223 25 Xie L. Sheehy R.N. Muneer A. Xiong Y. Wrobel J.A. Zhang F. Development of a brain-penetrant G9a methylase inhibitor to target Alzheimer’s disease-associated proteopathology Nat Commun 16 2025 1 18 40328756 10.1038/s41467-025-59128-z PMC12056044 26 Basavarajappa B.S. Subbanna S. Histone methylation regulation in neurodegenerative disorders Int J Mol Sci 22 2021 4654 33925016 10.3390/ijms22094654 PMC8125694 27 Manuel I. de San Román E.G. Giralt M.T. Ferrer I. Rodríguez-Puertas R. Type-1 cannabinoid receptor activity during Alzheimer’s disease progression J Alzheim Dis 42 2014 761 766 10.3233/JAD-140492 24946872 28 Ghosh K. Zhang G.-F. Chen H. Chen S.R. Pan H.L. Cannabinoid CB2 receptors are upregulated via bivalent histone modifications and control primary afferent input to the spinal cord in neuropathic pain J Biol Chem 2022 298 10.1016/j.jbc.2022.101999 PMC9168157 35500651 29 Coelho A.A. Lima-Bastos S. Gobira P.H. Lisboa S.F. Endocannabinoid signaling and epigenetics modifications in the neurobiology of stress-related disorders Neuronal Signal 7 2023 NS20220034 37520658 10.1042/NS20220034 PMC10372471 30 Grabon W. Ruiz A. Gasmi N. Degletagne C. Georges B. Bemeguenai A. CB2 expression in mouse brain: from mapping to regulation in microglia under inflammatory conditions J Neuroinflammation 21 2024 206 39160534 10.1186/s12974-024-03202-8 PMC11334370 31 López A. Aparicio N. Pazos M.R. Grande M.T. Barreda-Manso M.A. Benito-Cuesta I. Cannabinoid CB 2 receptors in the mouse brain: relevance for Alzheimer’s disease J Neuroinflammation 15 2018 1 11 29793509 10.1186/s12974-018-1174-9 PMC5968596 32 Cassano T. Calcagnini S. Pace L. De Marco F. Romano A. Gaetani S. Cannabinoid receptor 2 signaling in neurodegenerative disorders: from pathogenesis to a promising therapeutic target Front Neurosci 11 2017 30 28210207 10.3389/fnins.2017.00030 PMC5288380 33 Ruiz de Martín Esteban S. Benito-Cuesta I. Terradillos I. Martínez-Relimpio A.M. Arnanz A. Ruiz-Pérez G. Cannabinoid CB2 receptors modulate microglia function and amyloid dynamics in a mouse model of Alzheimer’s disease Front Pharmacol 13 2022 841766 35645832 10.3389/fphar.2022.841766 PMC9136843 34 Solas M. Francis P.T. Franco R. Ramirez M.J. CB2 receptor and amyloid pathology in frontal cortex of Alzheimer's disease patients Neurobiol Aging 34 2013 805 808 22763024 10.1016/j.neurobiolaging.2012.06.005 35 Verkhratsky A. Parpura V. Rodriguez-Arellano J.J. Zorec R. Astroglia in Alzheimer's disease Neuroglia Neurodegener Dis 2019 273 324 10.1007/978-981-13-9913-8_11 PMC7266005 31583592 36 Kasten M. Klein C. The many faces of alpha-synuclein mutations Mov Disord 28 2013 697 701 23674458 10.1002/mds.25499 37 Hendrickx A. Pierrot N. Tasiaux B. Schakman O. Kienlen-Campard P. De Smet C. Epigenetic regulations of immediate early genes expression involved in memory formation by the amyloid precursor protein of Alzheimer disease PLoS One 9 2014 e99467 10.1371/journal.pone.0099467 PMC4053420 24919190 38 Zachariou M. Loizidou E.M. Spyrou G.M. Immediate-early genes as influencers in genetic networks and their role in Alzheimer’s disease bioRxiv 2024 2024.03.29.586739 10.1016/j.compbiomed.2025.110043 40158459 39 Kashyap G. Bapat D. Das D. Gowaikar R. Amritkar R.E. Rangarajan G. Synapse loss and progress of Alzheimer’s disease-A network model Sci Rep 9 2019 6555 10.1038/s41598-019-43076-y 31024073 PMC6484103 40 DeKosky S.T. Scheff S.W. Synapse loss in frontal cortex biopsies in Alzheimer's disease: correlation with cognitive severity Ann Neurol: Off J Am Neurol Assoc Child Neurol Soc 27 1990 457 464 10.1002/ana.410270502 2360787 41 Tzioras M. McGeachan R.I. Durrant C.S. Spires-Jones T.L. Synaptic degeneration in Alzheimer disease Nat Rev Neurol 19 2023 19 38 36513730 10.1038/s41582-022-00749-z 42 Kim Y. Lee H.-M. Xiong Y. Sciaky N. Hulbert S.W. Cao X. Targeting the histone methyltransferase G9a activates imprinted genes and improves survival of a mouse model of Prader–Willi syndrome Nat Med 23 2017 213 222 28024084 10.1038/nm.4257 PMC5589073 43 Vicente-Acosta A. Ceprian M. Sobrino P. Pazos M.R. Loría F. Cannabinoids as glial cell modulators in ischemic stroke: implications for neuroprotection Front Pharmacol 13 2022 888222 35721207 10.3389/fphar.2022.888222 PMC9199389 44 Rodriguez-Arias M. Navarrete F. Daza-Losada M. Navarro D. Aguilar M.A. Berbel P. CB1 cannabinoid receptor-mediated aggressive behavior Neuropharmacology 75 2013 172 180 23916480 10.1016/j.neuropharm.2013.07.013 45 Li L. Yun D. Zhang Y. Tao Y. Tan Q. Qiao F. A cannabinoid receptor 2 agonist reduces blood–brain barrier damage via induction of MKP-1 after intracerebral hemorrhage in rats Brain Res 1697 2018 113 123 29886251 10.1016/j.brainres.2018.06.006 46 Xi Z.-X. Peng X.-Q. Li X. Song R. Zhang H.-Y. Liu Q.-R. Brain cannabinoid CB2 receptors modulate cocaine’s actions in mice Nat Neurosci 14 2011 1160 1166 21785434 10.1038/nn.2874 PMC3164946 47 Boran A.D.W. Iyengar R. Systems approaches to polypharmacology and drug discovery Curr Opin Drug Discov Devel 13 2010 297 PMC3068535 20443163 48 Griñán-Ferré C. Corpas R. Puigoriol-Illamola D. Palomera-Ávalos V. Sanfeliu C. Pallàs M. Understanding epigenetics in the neurodegeneration of Alzheimer’s disease: SAMP8 mouse model J Alzheim Dis 62 2018 943 963 10.3233/JAD-170664 PMC5870033 29562529 49 Morley J.E. Farr S.A. Kumar V.B. Vijaya Harvey J.A. The SAMP8 mouse: a model to develop therapeutic interventions for Alzheimer’s disease Curr Pharm Des 18 2012 1123 1130 10.2174/138161212799315795 22288401 50 Liu B. Liu J. Shi J.-S. SAMP8 mice as a model of age-related cognition decline with underlying mechanisms in Alzheimer's disease J Alzheim Dis 75 2020 385 395 10.3233/JAD-200063 32310176 51 Tyrakis P. Agridi C. Kourti M. A comprehensive exploration of the multifaceted neuroprotective role of cannabinoids in Alzheimer's disease across a decade of research Int J Mol Sci 25 2024 8630 39201317 10.3390/ijms25168630 PMC11354546 52 Shade R.D. Ross J.A. Van Bockstaele E.J. Targeting the cannabinoid system to counteract the deleterious effects of stress in Alzheimer's disease Front Aging Neurosci 14 2022 949361 10.3389/fnagi.2022.949361 PMC9577232 36268196 53 Zhang W. Xiao D. Mao Q. Xia H. Role of neuroinflammation in neurodegeneration development Signal Transduct Target Ther 8 2023 267 37433768 10.1038/s41392-023-01486-5 PMC10336149 54 Hansen D.V. Hanson J.E. Sheng M. Microglia in Alzheimer ’s disease J Cell Biol 217 2018 459 472 29196460 10.1083/jcb.201709069 PMC5800817 55 Bhusal A. Afridi R. Lee W.-H. Suk K. Bidirectional communication between microglia and astrocytes in neuroinflammation Curr Neuropharmacol 21 2023 2020 36453496 10.2174/1570159X21666221129121715 PMC10556371 56 Leng F. Edison P. Neuroinflammation and microglial activation in Alzheimer disease: where do we go from here? Nat Rev Neurol 17 2021 157 172 10.1038/s41582-020-00435-y 33318676 57 Navarro G. Borroto-Escuela D. Angelats E. Receptor-heteromer mediated regulation of endocannabinoid signaling in activated microglia. Role of CB1 and CB2 receptors and relevance for Alzheimer's disease and levodopa-induced dyskinesia Brain Behav Immun 67 2018 139 151 28843453 10.1016/j.bbi.2017.08.015 58 Tönnies E. Trushina E. Oxidative stress, synaptic dysfunction, and Alzheimer's disease J Alzheimers Dis 57 2017 1105 1121 10.3233/JAD-161088 28059794 PMC5409043 59 Masliah E. Crews L. Hansen L. Synaptic remodeling during aging and in Alzheimer's disease J Alzheim Dis 9 2006 91 99 10.3233/jad-2006-9s311 16914848 60 Zhang R. He X. Cheng J. (m) RVD-hemopressin (α) Ameliorated oxidative stress, apoptosis and damage to the BDNF/TrkB/Akt pathway induced by scopolamine in HT22 cells Neurotox Res 41 2023 627 637 37971633 10.1007/s12640-023-00677-w 61 Jayant S. Sharma B.M. Bansal R. Sharma B. Pharmacological benefits of selective modulation of cannabinoid receptor type 2 (CB2) in experimental Alzheimer's disease Pharmacol Biochem Behav 140 2016 39 50 26577751 10.1016/j.pbb.2015.11.006 62 Rothammer N. Woo M.S. Bauer S. Binkle-Ladisch L. Di Liberto G. Egervari K. G9a dictates neuronal vulnerability to inflammatory stress via transcriptional control of ferroptosis Sci Adv 8 2022 eabm5500 35930635 10.1126/sciadv.abm5500 PMC9355351 Appendix A Supplementary data The following are the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Multimedia component 2 Multimedia component 2 Acknowledgments This study was supported by the Ministerio de Economía, Industria Economía, Industria y Competitividad (Agencia Estatal de Investigación, AEI) and European Union NextGenerationEU/PRTR (PID2022-139016OA-I00, PDC2022-133441-I00; to CGF and MP), Generalitat de Catalunya (2021 SGR 00357; to CGF and MP). This study was co-financed by Secretaria d’Universitats i Recerca del Departament d’Empresa i Coneixement de la Generalitat de Catalunya 2023 (Product 0092; Llavor 005 and Llavor 007 to CGF). ABS acknowledges the Agència de Gestió d'Ajuts Universitaris i de Recerca (AGAUR) for her FI-SDUR fellowship (2021FISDU 00182). Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.neurot.2025.e00616 ",
  "metadata": {
    "Title of this paper": "G9a dictates neuronal vulnerability to inflammatory stress via transcriptional control of ferroptosis",
    "Journal it was published in:": "Neurotherapeutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491791/"
  }
}