{
  "title": "Paper_1247",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471389 PMC12471389.1 12471389 12471389 41011062 10.3390/medicina61091671 medicina-61-01671 1 Article Urinary Urocortin as a Potential Non-Invasive Biomarker in Endometriosis: Exploratory Study with Histone H4 Toma Bogdan Conceptualization Methodology Formal analysis Investigation Data curation Writing – original draft 1 2 Caruntu Irina-Draga Conceptualization Writing – review & editing 1 3 * https://orcid.org/0000-0001-5581-4624 Simionescu Natalia Investigation 4 Onofriescu Mircea Supervision 2 5 https://orcid.org/0000-0002-0979-0200 Socolov Demetra Methodology Validation 2 5 Ilea Ciprian Investigation 2 5 Chifu Bianca Software 1 https://orcid.org/0000-0002-6321-7253 Giusca Simona-Eliza Formal analysis Visualization 1 Timofte Andrei Daniel Software Formal analysis Visualization 1 Tirnovanu Mihaela Investigation 2 5 https://orcid.org/0000-0002-8969-8016 Socolov Razvan Conceptualization Writing – review & editing 5 6 Ferrero Simone Academic Editor 1 toma.bogdanf@gmail.com bianca.manole@ymail.com simonaelizagiusca@gmail.com andrei-daniel.timofte@umfiasi.ro 2 mirceaonofriescu@yahoo.com demetrasocolov@gmail.com cilea1979@yahoo.com mihtir@yahoo.com 3 4 natalia.simionescu@icmpp.ro 5 socolov.razvan@gmail.com 6 * irina.caruntu@umfiasi.ro 15 9 2025 9 2025 61 9 497654 1671 31 7 2025 05 9 2025 09 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives Materials and Methods Results p p 2 p Conclusions endometriosis Urocortin Histone H4 non-invasive biomarkers This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Endometriosis is a chronic, estrogen-dependent inflammatory condition that significantly affects women’s quality of life and fertility [ 1 2 1 2 The current reliance on invasive laparoscopy for definitive diagnosis often leads to significant delays. This is a critical issue, as highlighted by global health initiatives, such as the World Endometriosis Society and the World Endometriosis Research Foundation, because delayed diagnosis contributes to disease progression and a substantial socioeconomic burden—estimated at nearly $9579 per patient annually, a cost comparable to other chronic conditions like Crohn’s disease and diabetes [ 1 2 This limitation underscores the urgent need for reliable non-invasive biomarkers that could facilitate early detection and patient stratification while reducing dependence on surgery [ 3 4 5 6 Reflecting these challenges, the 2022 guidelines from the European Society of Human Reproduction and Embryology (ESHRE) explicitly discourage the clinical use of serum, endometrial, or uterine/menstrual fluid biomarkers for diagnosis in both adults and adolescents, citing insufficient robustness and reproducibility [ 7 8 9 10 11 Among the emerging biomarker candidates, Urocortin—a 40-amino acid endogenous peptide of the corticotropin-releasing hormone (CRH) family—has attracted particular interest. Its three isoforms (Urocortin 1, Urocortin 2, and Urocortin 3) act as agonists of CRH-R1 and CRH-R2 receptors and share structural similarities with CRH itself [ 12 13 14 15 16 17 18 19 20 21 22 23 24 25 Another promising candidate is Histone H4, recently identified as a potential urinary biomarker. Elevated urinary levels of Histone H4 have been reported in women with endometriosis, likely reflecting local inflammation and tissue remodeling—both hallmarks of the disease. While early studies have reported encouraging diagnostic accuracy, further validation is necessary before it can be incorporated into clinical practice [ 26 For any new biomarker to prove its clinical utility, its performance must be correlated with established measures of disease severity and prognosis. The most widely adopted tools for this purpose are the revised American Society for Reproductive Medicine (rASRM) classification for staging the disease and the Endometriosis Fertility Index (EFI) for predicting postoperative fertility outcomes [ 27 28 Within this scientific framework, the present study was designed as exploratory research to investigate the diagnostic potential of serum and urinary Urocortin and Histone H4 as non-invasive biomarkers in ovarian endometriosis. Furthermore, we aimed to determine their correlation with the established rASRM and EFI clinical scoring systems to assess their potential real-world value. 2. Materials and Methods 2.1. Participants An exploratory study was conducted on a cohort consisting of 35 women surgically treated and histologically confirmed for endometriosis, divided into two groups: Ovarian localization had 30 cases (group 1), and abdominal wall involvement had 5 cases (group 2). A group of 5 healthy women undergoing routine gynecological examinations, with no evidence of endometriosis or other gynecological conditions, was used as control (group 3). Participants were recruited between December 2020 and September 2024 from two tertiary care units: “Cuza Vodă’’ and “Elena Doamna’’ Obstetrics and Gynecology Clinical Hospitals in Iasi, Romania. All participants provided written informed consent for inclusion in this research. Ethical clearance for this study was obtained from the institutional review boards of the hospitals, as well as from the Ethics Committee of “Grigore T. Popa’’ University of Medicine and Pharmacy, Iași (approval no. 130002/24.11.2020, 390/13.01.2023, and 401/15.02.2024, respectively). All procedures conformed to international research ethics standards, including those outlined in the Declaration of Helsinki. 2.2. Inclusion/Exclusion Criteria The study population was selected based on strict inclusion and exclusion criteria to ensure clinical and biological consistency. Women aged 18 to 45 years, assessed during the proliferative phase of the menstrual cycle, were eligible if they presented histologically confirmed endometriosis, typical pelvic pain symptoms (including dysmenorrhea, dyspareunia, or chronic pelvic discomfort), normal endocrine function, and preserved cognitive status. Patients were required to have no recent use (within three months) of hormonal therapies, including GnRH analogues, antagonists, or oral contraceptives. Transvaginal ultrasonography suggestive of endometriotic lesions and a prior diagnosis of infertility were also considered eligibility indicators. Participants were excluded in cases of pregnancy, lactation, premature ovarian failure, or early menopause. Additional exclusion criteria included chronic systemic or psychiatric comorbidities, neurological disorders affecting cognition, active genitourinary infections, use of illicit substances, or any coexisting benign gynecologic disorders (e.g., adenomyosis, fibroid, benign ovarian cysts other than endometriomas). Control subjects met the same age and cycle-phase requirements, exhibited no pelvic symptoms or imaging abnormalities, and had no surgical history or clinical suspicion of endometriosis. 2.3. Surgery, Sample Collection, and Staging To minimize the influence of hormonal fluctuations, all surgical procedures were scheduled during the proliferative phase of the menstrual cycle. Biological samples were collected the day before surgery in fasting conditions at 6:00 a.m., consisting of 2 mL of peripheral venous blood and 5 mL of urine. No adverse effects were reported during the collection of blood samples, which were drawn into plain vacutainers (without anticoagulant), allowed to clot at room temperature for 30 min, and subsequently centrifuged at 2500× g Symptom severity was assessed using the Visual Analog Scale (VAS) for dysmenorrhea, dyspareunia, and chronic pelvic pain in three different conditions: without analgesic medication, during pharmacologic treatment, and one year after surgery. The VAS scores for dysmenorrhea, dyspareunia, and chronic pelvic pain were categorized as follows: 1–3 for mild pain, 4–6 for moderate pain, and 7–10 for severe pain [ 29 The staging of endometriosis was performed after surgery using internationally recognized classification systems, including rASRM and EFI, to ensure accurate stratification and individualized assessment of disease severity. 2.4. Biomarker Measurement 2.4.1. Urocortin Quantification Serum and urine concentrations of Urocortin were determined using a commercial enzyme—linked immunosorbent assay (ELISA) kit, RayBio ® ® 2.4.2. Histone H4 Quantification Histone H4 levels were measured using a sandwich ELISA kit (MBS2701607, MyBioSource Inc., San Diego, CA, USA), designed for quantitative in vitro analysis of Histone H4 in biological fluids. A standard curve ranging from 0.156 to 10 ng/mL was prepared using recombinant Histone H4. Each sample and standard were tested in duplicate. Following standard ELISA procedures, 100 μL of sample was added per well and incubated at 37° C for 1 h. The wells were then incubated sequentially with detection reagents A and B, each followed by appropriate washing steps. After incubation with the substrate solution in the dark at 37° C, the reaction was terminated using the stop solution, and absorbance was read at 450 nm using the same microplate reader. Results were expressed in ng/mL, based on the standard curve. 2.4.3. CA-125 Serum CA-125 concentrations were determined using the Abbott Architect i2000SR system (Abbott Laboratories, Waukegan, IL, USA), employing chemiluminescent microparticle immunoassay technology, in accordance with the manufacturer’s protocol. 2.5. Statistical Analysis Statistical analysis was conducted using SPSS version 18.0 (SPSS Inc., Chicago, IL, USA). Descriptive statistics (mean, median, SD, min/max) and dispersion indicators were calculated. The normality of quantitative variables was assessed using the Kolmogorov-Smirnov test (at p t p 3. Results 3.1. Baseline Parameters The age distribution across all study groups was comparable, with closely aligned mean and median values suggesting a demographically homogeneous population. Group 1 had a mean age of 33.60 ± 5.14 years, followed by group 2 at 31.20 ± 3.90 years, and group 3 at 30.40 ± 4.78 years, with no statistically significant differences ( Table 1 In group 1, 63.3% of patients reported infertility persisting for over two years ( Table 1 p p Table 1 The assessment of symptom severity for dysmenorrhea, dyspareunia, and chronic pelvic pain using VAS showed distinct scores according to three different conditions: without analgesic medication, during pharmacologic treatment, and one year after surgery ( Table 1 Intraoperative findings ( Table 1 3.2. Surgical Staging and Disease Extension The revised American Society for Reproductive Medicine (rASRM) classification was used to assess disease severity in patients with ovarian endometriosis—group 1. Scores ranged widely, from 22 to 108, reflecting substantial interindividual variability. The average rASRM score was 50.87, notably higher than the median value of 38, indicating a skewed distribution. Based on staging criteria, 53.3% of patients were classified in stage III, while 46.7% were in stage IV. Deep infiltrating endometriosis (DIE) was more frequently encountered in advanced stages. Specifically, 92.9% of stage IV patients and 56.3% of stage III patients presented with deep lesions, showing a statistically significant difference ( p p p p p These findings illustrated the anatomical extension of the disease and its correlation with rASRM stage, highlighting the importance of clinical staging in evaluating the presence and distribution of deep pelvic involvement. 3.3. Endometriosis Fertility Index (EFI) and Postoperative Reproductive Outcomes Postoperative reproductive outcomes were analysed in relation to EFI, which was calculated for 27 patients with preserved fertility potential following surgical treatment for ovarian endometriosis. All patients had expressed a desire to conceive in the period following surgery. EFI scores ranged from 2 to 8 and were stratified into three prognostic categories: low (EFI < 5) in 37% of patients, intermediate (EFI 5–7) in 51.9%, and higher (EFI ≥ 8) in 11.1%. Correlating EFI scores with rASRM staging revealed a mixed contribution. Among patients with EFI < 5, half were classified in stage III and the other half in stage IV. In the intermediate EFI group (EFI 5–7), 42.9% corresponded to stage IV and 57.1% to stage III. For those with EFI ≥ 8, 33.3% were staged as rASRM IV and 66.7% as stage III. These differences were not statistically significant ( p Following surgery, 15 out of 30 patients (50%) achieved pregnancy. Among those with EFI ≥ 8, all pregnancies occurred spontaneously. In contrast, 71.4% of patients with EFI < 5 required in vitro fertilization, compared to 40% in the intermediate EFI group, showing a statistically significant association between EFI score and the method of conception ( p 3.4. Serum Urocortin and Histone H4 Levels Serum Urocortin was normally distributed, as reflected by a close alignment between median (3.64 μg/mL) and mean values (3.68 μg/mL) and p p p Figure 1 Serum Histone H4 concentrations demonstrated a homogenous distribution pattern, as indicated by the minimal difference between median (0.50 ng/mL) and mean (0.45 ng/mL) values and p p p Figure 1 Further stratification by rASRM stage showed slightly higher serum Urocortin levels in stage IV cases compared to stage III (3.67 μg/mL versus p Figure 2 Further evaluation by rASRM stage showed slightly elevated serum Histone H4 levels in stage IV cases compared to stage III (0.55 ng/mL versus p Figure 2 3.5. Urinary Urocortin and Histone H4 Levels The distribution of urinary Urocortin concentrations demonstrated statistical homogeneity, with a median value (1.93 μg/mL) closely aligned with the mean (2.04 μg/mL), and a skewness coefficient greater than −2, justifying the use of parametric tests for continuous variables. In patients with ovarian endometriosis—group 1, urinary Urocortin levels ranged from 0.41 to 4.23 μg/mL. Compared to the parietal endometriosis—group 2 and control—group 3, mean levels were markedly elevated (2.51 μg/mL versus p Figure 3 Based on individual measurements, urinary Histone H4 levels demonstrated a homogeneous distribution, as indicated by the close alignment of median and mean values (0.34 versus p p Figure 3 Further evaluation by rASRM stage showed slightly elevated urinary Urocortin levels in stage III cases compared to stage IV (2.79 μg/mL versus p Figure 4 Further evaluation by rASRM stage showed slightly elevated urinary Histone H4 levels in stage IV cases compared to stage III (0.35 ng/mL versus p Figure 4 3.6. Diagnostic Accuracy of Serum and Urinary Urocortin and Histone H4 ROC curve analysis demonstrated that urinary Urocortin is a reliable non-invasive biomarker for ovarian endometriosis, with an area under the curve (AUC) of 0.973 (95% CI: 0.929–0.971; p Figure 5 In contrast, serum Urocortin showed limited diagnostic performance, yielding an AUC of 0.674 (95% CI: 0.458–0.890; p Figure 5 Urinary Histone H4 demonstrated moderate accuracy, with an AUC of 0.674 (95% CI: 0.422–0.927; p Figure 5 Serum Histone H4 had the lowest predictive capacity among the tested biomarkers. ROC analysis showed an AUC of 0.538 (95% CI: 0.181–0.895; p Figure 5 3.7. Serum CA-125 Levels The distribution of serum CA-125 levels demonstrated statistical homogeneity, with a median value (55 U/mL) closely approximating the mean (56.64 U/mL) and a skewness coefficient below 2, supporting the use of parametric tests for continuous variables. In the ovarian endometriosis group, CA-125 values ranged from 38.8 to 114.9 U/mL. Mean concentrations were remarkably higher in this group compared to both the parietal endometriosis group (67.87 U/mL versus 23.32 U/mL) and the control group (67.87 U/mL versus 22.58 U/mL), with statistically significant differences observed in both comparisons ( p Figure 6 Further stratification by rASRM stage showed a significant elevation in serum CA-125 levels among patients with stage IV disease compared to those classified as stage III (89.44 U/mL versus 48.99 U/mL, p Figure 6 3.8. Multivariate Regression Analysis 3.8.1. Serum Urocortin A multivariate linear regression model was applied to evaluate the potential influence of clinical parameters on serum Urocortin levels in patients with ovarian endometriosis. Among all tested variables, patient age emerged as the only independent predictor with a statistically significant contribution, explaining approximately 14.5% of the total variance in serum Urocortin concentration (adjusted R 2 p U r o c o r t i n = 4.51 − 0.26 × A g e When additional variables—including age at menarche, disease duration, pain intensity scores (VAS), infertility duration, and rASRM score—were included, no significant improvements in model fit were observed ( p 2 p 3.8.2. Urinary Urocortin In contrast, multivariate analysis for urinary Urocortin revealed a more substantial association. A model including patient age, age at menarche, and disease duration explained 28.3% of the observed variance in urinary Urocortin levels (adjusted R 2 p Simpler models, such as those evaluating age alone ( p p 2 3.8.3. Serum Histone H4 Multivariate regression models assessing serum Histone H4 concentrations did not identify any significant predictive relationships with the examined clinical variables. Across all tested models—including combinations of age, age at menarche, disease duration, VAS pain scores, infertility duration, and rASRM score- no statistically significant associations were detected (all p The most inclusive model achieved only a modest adjusted R 2 2 p 3.8.4. Urinary Histone H4 Urinary Histone H4 levels showed a weak but borderline significant association with clinical variables. The final regression model—comprising age, age at menarche, disease duration, VAS pain scores, infertility duration, and rASRM score—explained 4.5% of the variation in the urinary Histone H4 levels (adjusted R 2 p While this result reached statistical significance, the explanatory power was limited, and individual regression coefficients were of low magnitude, indicating only a minimal clinical impact. All simpler models with fewer predictors showed non-significant results and adjusted R 2 3.9. Correlation Patterns of Serum and Urinary Biomarkers in Ovarian Endometriosis The diagnostic potential of serum and urinary Urocortin, Histone H4, and CA-125 was further evaluated through correlation analysis and clinical fertility indicators, particularly EFI. Spearman correlation analysis in the ovarian endometriosis group revealed a moderate, statistically significant inverse association between urinary Histone H4 levels and EFI scores (r = −0.562, p Figure 7 Serum Histone H4 demonstrated a positive, but weak and statistically non-significant, correlation with EFI (r = +0.335, p p Figure 7 Lastly, CA-125 values exhibited a weak, non-significant inverse correlation with EFI (r = −0,114, p Figure 7 In the ovarian endometriosis group, multivariate linear regression analysis revealed a statistically significant association between the rASRM score and Urocortin concentrations. Specifically, serum and urinary Urocortin levels together explained 19.7% of the rASRM score variance (adjusted R 2 p A more comprehensive model including serum and urinary concentrations of Urocortin, Histone H4, and CA-125 accounted for 69% of the variance in the rASRM score (adjusted R 2 p Additionally, multivariate linear regression analysis demonstrated that serum and urinary Urocortin concentrations collectively explained 16.3% of the variance in the EFI index (adjusted R 2 p Comparison of mean biomarker values according to EFI stratification revealed significantly elevated serum Histone H4 concentrations in patients with EFI scores ≥ 8 compared to those with EFI < 5 (1.05 versus p versus p Table 2 p Table 2 3.10. Predictive Biomarkers for Postoperative Conception in Ovarian Endometriosis ROC curve analysis was performed to assess the predictive potential of serum and urinary biomarkers, as well as clinical variables, for postoperative conception in patients with ovarian endometriosis. Serum biomarkers demonstrated the following predictive value ( Figure 8 - Serum Urocortin was a significant predictor (AUC = 0.864; 95% CI: 0.728–0.999; p - Serum Histone H4 showed even stronger performance (AUC = 0.951; 95% CI: 0.869–0.999; p Conversely, several clinical and biological parameters failed to demonstrate adequate predictive capacity (AUC < 0.600), including ( Figure 8 - age at menarche (AUC = 0.395; 95% CI: 0.115–0.635; p - infertility duration (AUC = 0.438; 95% CI: 0.136–0.740; p - symptom duration (AUC = 0.370; 95%: 0.126–0.867; p - rASRM score (AUC = 0.512; 95% CI: 0.088–0.936; p - serum CA125 (AUC = 0.556; 95% CI: 0.328–0.783; p - urinary Urocortin (AUC = 0.506; 95% CI: 0.113–0.900; p - urinary Histone H4 (AUC = 0.370; 95% CI: 0.188–0.553; p 4. Discussion The study investigated serum and urinary levels of Urocortin and Histone H4 in patients with ovarian and parietal endometriosis compared to healthy controls, using a multidimensional approach encompassing several clinico-pathological parameters. Considering the limited number of cases analyzed in our cohort, together with the limited data currently available in the literature regarding the two biomarkers under investigation at both serum and urinary levels, the present study should be regarded as an exploratory one. Within this framework, our objective was to characterize the profiles of Urocortin and Histone H4 in serum and urine, as preliminary evidence of their potential association with endometriotic lesions, without advancing statements of establishing or confirming causal relationships. Although the small sample size of the cohort (35 cases, 5 controls) limits generalizability, our findings align with current evidence regarding the diagnostic complexity of endometriosis. Demographic characteristics confirmed a higher frequency of endometriosis among urban, educated, professionally active women in their early 30s, consistent with recent reports highlighting socioeconomic disparities in access to diagnosis and care [ 30 31 32 The clinical assessment pointed out that, despite receiving hormonal therapy prior to surgery, patients still reported severe pain symptoms, particularly dysmenorrhea and dyspareunia, reflecting the persistence of symptom burden in advanced stages [ 33 34 Clinical staging using rASRM classification showed a high frequency for stages III and IV of ovarian endometriosis, with deep infiltrating lesions, particularly in the uterosacral ligaments and rectovaginal space. Left ovarian localization was predominant, in line with anatomical and physiological hypotheses previously reported [ 35 36 37 Postoperative follow-up showed that 50% of patients achieved pregnancy, with EFI score being an encouraging predictor of reproductive outcome. All patients with EFI ≥ 8 conceived spontaneously, while most with EFI < 5 required assisted reproduction [ 38 39 40 41 We reiterate the importance of identifying new non-invasive biomarkers, as standard diagnosis for endometriosis heavily relies on invasive procedures. Thus, we focused on Urocortin and Histone H4. As we mentioned above, the current body of literature provides only a limited number of reports addressing the evaluation of these two biomarkers—whether in serum, urine, or tissue. Furthermore, the scarce evidence available in mainstream sources is predominantly derived from small cohorts, particularly when compared with studies investigating the broader clinical spectrum of endometriosis. Both these aspects sustain the exploratory nature of our research. It is worth mentioning that a PubMed database search revealed only ten original articles focusing on urocortin, with sample sizes ranging from 16 cases [ 42 43 44 45 25 46 47 48 49 50 51 26 52 53 Urocortin is widely expressed in the central nervous system and peripheral organs, including reproductive tissues. Urocortin plays various roles in ovarian steroidogenesis, placental maintenance, and labor initiation, and is detectable in serum, urine, and tissue biopsies, with menstrual cycle-dependent fluctuations [ 54 55 47 55 54 55 Serum Urocortin is elevated in endometriosis and correlates with disease progression [ 48 50 55 49 46 51 25 55 46 25 55 Urinary Urocortin levels showed heterogeneity, with significantly higher values in the ovarian endometriosis group compared to the parietal endometriosis and control group ( p p 55 Histone H4, part of the nucleosome core, organizes chromatin by wrapping DNA around H2A, H2B, H3, and H4 proteins [ 56 57 50 58 Post-translational modifications (acetylation, methylation) of H4 regulate gene expression, with key implications on cell cycle growth, cellular death, and angiogenesis—events involved in the pathogenic mechanism of endometriosis [ 59 60 51 59 26 Our results regarding serum Histone H4 levels indicated no significant differences between ovarian endometriosis, parietal endometriosis, and control groups ( p 58 Urinary Histone H4 was recently identified using proteomics, with increased levels being reported in ovarian endometriosis [ 26 p 26 The biological profile of the patients included in the cohort was supplemented with the serum CA-125 analysis as a routine biomarker, useful especially in advanced stages of endometriosis. Our results on serum CA-125 levels across the cohort demonstrated significantly elevated concentrations in patients with ovarian endometriosis compared to those with parietal lesions and healthy controls ( p p 61 62 61 62 63 p p Translationally, integrating non-invasive biomarkers with clinical scores is essential for their validation, not only in diagnosis but also in assessing the post-surgical reproductive outcome. In our study, urinary Histone H4 showed a moderate inverse correlation with EFI (r = −0.562; p 64 65 For rASRM classification, multivariate linear regression indicated that serum and urinary Urocortin levels explained 19.7% of the variance (Radjusted = 0.197; p p Nonetheless, in contemporary clinical practice, the identification of predictive biomarkers or clinical parameters for postoperative fertility and recurrence in ovarian endometriosis remains a critical unmet necessity. This holds relevance for personalized therapeutic planning and long-term follow-up. The present study explored the prognostic utility of emerging serum and urinary biomarkers, along with clinical indicators, in anticipating reproductive capacity and disease recurrence. Regarding the likelihood of achieving spontaneous pregnancy following surgical treatment, our data support significant predictive value for both serum Urocortin ( p p 23 52 Overall, our research reinforces the restrictive ability of classical assessment tools, such as established scoring systems (rASRM, EFI), based on clinical and anamnesis parameters, on one hand. On the other hand, it also underscores the limitations of standalone traditional biological biomarkers. Their diagnostic and predictive utility is often insufficient, and new biomarkers are necessary for assessing the underlying biological heterogeneity of ovarian endometriosis. Therefore, our study focusing on Urocortin and Histone H4 expression in endometriosis aligns with this current trend. We acknowledge the weaknesses of our study, such as the relatively small sample size, monocentric design, and the absence of other parameters (BMI, comorbidities), which may limit external validity. 5. Conclusions Developing and validating integrative predictive models for ovarian endometriosis is crucial. These models, combining molecular biomarkers, inflammatory indices, surgical staging, and clinical history, can overcome conventional diagnostic limits for personalized management. In our exploratory study, urinary Urocortin showed a preliminary diagnostic signal in this small exploratory cohort, whereas Histone H4 did not perform significantly. Our findings require replication in larger, multicenter, and rigorously controlled studies with validated urine normalization methods. However, our study opens further perspectives for complementing the biomarker panel with potential non-invasive diagnostic value with new candidates. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, B.T., I.-D.C., M.O. and R.S.; methodology, B.T. and D.S.; software, B.C. and A.D.T.; validation, D.S.; formal analysis, B.T., S.-E.G. and A.D.T.; investigation, B.T., N.S., C.I. and M.T.; data curation, B.T.; writing—original draft preparation, B.T.; writing—review and editing, I.-D.C. and R.S.; visualization, S.-E.G. and A.D.T.; supervision, M.O. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study, part of Bogdan Toma’s doctoral research at the “Grigore T. Popa” University of Medicine and Pharmacy in Iași, was conducted in accordance with the Declaration of Helsinki. The study received ethical clearance from two hospital ethics committees. Initial approval was granted in November 2020 by the ethics committee of the “Cuza Vodă” Clinical Hospital of Obstetrics and Gynecology (approval No. 130002/24 November 2020), allowing patient enrollment to begin the following month. Due to difficulties in patient recruitment, the study was expanded to a second institution, the “Elena-Doamna” Clinical Hospital of Obstetrics and Gynecology, which provided a second ethics approval in January 2023 (Approval No. 390/13 January 2023). This process aligns with the standard national and university regulations, where institutional hospital approval is a prerequisite for patient-related research activities, with a final ethics review from the university to follow later (Approval no. 401/15 February 2024). All participants provided written informed consent for inclusion in this research. Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The data used to support the findings of this research are available upon request to the authors. Conflicts of Interest The authors declare no conflicts of interest. References 1. Simoens S. Dunselman G. Dirksen C. Hummelshoj L. Bokor A. Brandes I. Brodszky V. Canis M. Colombo G.L. DeLeire T. The burden of endometriosis: Costs and quality of life of women with endometriosis and treated in referral centres Hum. Reprod. 2012 27 1292 1299 10.1093/humrep/des073 22422778 2. Rogers P.A. D’Hooghe T.M. Fazleabas A. Giudice L.C. Montgomery G.W. Petraglia F. Taylor R.N. Defining future directions for endometriosis research: Workshop report from the 2011 World Congress of Endometriosis in Montpellier, France Reprod. Sci. 2013 20 483 499 10.1177/1933719113477495 23427182 PMC3635070 3. Fassbender A. Vodolazkaia A. Saunders P. Lebovic D. Waelkens E. De Moor B. D’Hooghe T. Biomarkers of endometriosis Fertil. Steril. 2013 99 1135 1145 10.1016/j.fertnstert.2013.01.097 23414923 4. D’Hooghe T. Biomarkers for Endometriosis Springer International Publishing AG Cham, Switzerland 2017 10.1007/978-3-319-59856-7 978-3-319-59856-7 5. Krygere L. Jukna P. Jariene K. Drejeriene E. Diagnostic Potential of Cytokine Biomarkers in Endometriosis: Challenges and Insights Biomedicines 2024 12 2867 10.3390/biomedicines12122867 39767772 PMC11673701 6. Saunders P.T.K. Horne A.W. Endometriosis: Etiology, pathobiology, and therapeutic prospects Cell 2021 184 2807 2824 10.1016/j.cell.2021.04.041 34048704 7. Becker C.M. Bokor A. Heikinheimo O. Horne A. Jansen F. Kiesel L. King K. Kvaskoff M. Nap A. Petersen K. ESHRE Endometriosis Guideline Group. ESHRE guideline: Endometriosis Hum. Reprod. 2022 2022 hoac009 10.1093/hropen/hoac009 35350465 PMC8951218 8. Višnić A. Barišić D. Jurešić G.Č. Klarić M. Šepić T.S. Concentration of total proteins in urine as a non-invasive biomarker of endometriosis JBRA Assist. Reprod. 2023 27 624 628 10.5935/1518-0557.20230028 37503911 PMC10718539 9. Konrad L. Fruhmann Berger L.M. Maier V. Horné F. Neuheisel L.M. Laucks E.V. Riaz M.A. Oehmke F. Meinhold-Heerlein I. Zeppernick F. Predictive Model for the Non-Invasive Diagnosis of Endometriosis Based on Clinical Parameters J. Clin. Med. 2023 12 4231 10.3390/jcm12134231 37445265 PMC10342998 10. Condous G. Gerges B. Thomassin-Naggara I. Becker C. Tomassetti C. Krentel H. van Herendael B.J. Malzoni M. Abrao M.S. Saridogan E. Non-invasive imaging techniques for diagnosis of pelvic deep endometriosis and endometriosis classification systems: An International Consensus Statement Facts Views Vis. ObGyn 2024 16 127 144 10.52054/FVVO.16.2.012 38807551 PMC11366111 11. Ravaggi A. Bergamaschi C. Galbiati C. Zanotti L. Fabricio A.S.C. Gion M. Cappelletto E. Leon A.E. Gennarelli M. Romagnolo C. Circulating Serum Micro-RNA as Non-Invasive Diagnostic Biomarkers of Endometriosis Biomedicines 2024 12 2393 10.3390/biomedicines12102393 39457705 PMC11505445 12. Liew H.K. Huang L.C. Yang H.I. Peng H.F. Li K.W. Tsai A.P. Chen S.Y. Kuo J.S. Pang C.Y. Therapeutic effects of human urocortin-1, -2 and -3 in intracerebral hemorrhage of rats Neuropeptides 2015 52 89 96 10.1016/j.npep.2015.05.004 26055808 13. Hillhouse E.W. Grammatopoulos D.K. The molecular mechanisms underlying the regulation of the biological activity of corticotropin-releasing hormone receptors: Implications for physiology and pathophysiology Endocr. Rev. 2006 27 260 286 10.1210/er.2005-0034 16484629 14. Florio P. Arcuri F. Ciarmela P. Runci Y. Romagnoli R. Cintorino M. Di Blasio A.M. Petraglia F. Identification of urocortin mRNA and peptide in the human endometrium J. Endocrinol. 2002 173 R9 R14 10.1677/joe.0.173r009 12010647 15. Florio P. Vale W. Petraglia F. Urocortins in human reproduction Peptides 2004 25 1751 1757 10.1016/j.peptides.2004.05.026 15476942 16. Di Blasio A.M. Pecori Giraldi F. Viganò P. Petraglia F. Vignali M. Cavagnini F. Expression of corticotropin-releasing hormone and its R1 receptor in human endometrial stromal cells J. Clin. Endocrinol. Metab. 1997 82 1594 1597 10.1210/jcem.82.5.3923 9141555 17. Makrigiannakis A. Zoumakis E. Margioris A.N. Theodoropoulos P. Stournaras C. Gravanis A. The corticotropin-releasing hormone (CRH) in normal and tumoral epithelial cells of human endometrium J. Clin. Endocrinol. Metab. 1995 80 185 189 10.1210/jcem.80.1.7829610 7829610 18. Makrigiannakis A. Zoumakis E. Margioris A.N. Stournaras C. Chrousos G.P. Gravanis A. Regulation of the promoter of the human corticotropin-releasing hormone gene in transfected human endometrial cells Neuroendocrinology 1996 64 85 92 10.1159/000127103 8857602 19. Makrigiannakis A. Margioris A.N. Chatzaki E. Zoumakis E. Chrousos G.P. Gravanis A. The decidualizing effect of progesterone may involve direct transcriptional activation of corticotrophin-releasing hormone from human endometrial stromal cells Mol. Hum. Reprod. 1999 5 789 796 10.1093/molehr/5.9.789 10460215 20. Makrigiannakis A. Zoumakis E. Kalantaridou S. Coutifaris C. Margioris A.N. Coukos G. Rice K.C. Gravanis A. Chrousos G.P. Corticotropin-releasing hormone promotes blastocyst implantation and early maternal tolerance Nat. Immunol. 2001 2 1018 1024 10.1038/ni719 11590404 21. Minas V. Loutradis D. Makrigiannakis A. Factors controlling blastocyst implantation Reprod. Biomed. Online 2005 10 205 216 10.1016/S1472-6483(10)60942-X 15823225 22. Iavazzo C. Baka S. Malamitsi-Puchner A. The role of urocortin in gynecological and obstetrical conditions Arch. Gynecol. Obstet. 2009 279 613 619 10.1007/s00404-008-0782-5 18777033 23. Pergialiotis V. Tagkou N.M. Tsimpiktsioglou A. Klavdianou O. Neonaki A. Trompoukis P. Urocortin Expression in Endometriosis: A Systematic Review Int. J. Fertil. Steril. 2019 13 1 10.22074/ijfs.2019.5488 30644237 PMC6334014 24. Muramatsu Y. Sugino N. Suzuki T. Totsune K. Takahashi K. Tashiro A. Hongo M. Oki Y. Sasano H. Urocortin and corticotropin-releasing factor receptor expression in normal cycling human ovaries J. Clin. Endocrinol. Metab. 2001 86 1362 1369 10.1210/jc.86.3.1362 11238533 25. Florio P. Reis F.M. Torres P.B. Calonaci F. Toti P. Bocchi C. Linton E.A. Petraglia F. Plasma urocortin levels in the diagnosis of ovarian endometriosis Obstet. Gynecol. 2007 110 594 600 10.1097/01.AOG.0000278572.86019.ae 17766605 26. Chen X. Liu H. Sun W. Guo Z. Lang J. Elevated urine histone 4 levels in women with ovarian endometriosis revealed by discovery and parallel reaction monitoring proteomics J. Proteom. 2019 204 103398 10.1016/j.jprot.2019.103398 31146047 27. Wang W. Li R. Fang T. Huang L. Ouyang N. Wang L. Zhang Q. Yang D. Endometriosis fertility index score maybe more accurate for predicting the outcomes of in vitro fertilisation than r-AFS classification in women with endometriosis Reprod. Biol. Endocrinol. 2013 11 112 10.1186/1477-7827-11-112 24330552 PMC3866946 28. Adamson G.D. Pasta D.J. Endometriosis fertility index: The new, validated endometriosis staging system Fertil. Steril. 2010 94 1609 1615 10.1016/j.fertnstert.2009.09.035 19931076 29. Gift A.G. Visual analogue scales: Measurement of subjective phenomena Nurs. Res. 1989 38 286 288 10.1097/00006199-198909000-00006 2678015 30. Andres M. Casagranda de Camargo P. Orlandi C. Silva M. Ferreira A. Azevedo R. Abrão M. 12,366 Surgical Outcomes of the National Training Program (PROADI) for Minimally Invasive Surgery for Endometriosis in Brazil J. Minim. Invasive Gynecol. 2024 31 S152 S153 10.1016/j.jmig.2024.09.969 31. Kiesel L. Sourouni M. Diagnosis of endometriosis in the 21st century Climacteric 2019 22 296 302 10.1080/13697137.2019.1578743 30905186 32. GiglioAyers P. Ezike O. Foley C.E. Brown B.P. Demographic Correlates of Endometriosis Diagnosis Among United States Women Aged 15–50 J. Minim. Invasive Gynecol. 2024 31 607 612 10.1016/j.jmig.2024.04.020 38697259 33. Lessans N. Friedman S. Dior U. 12,469 The Relationship Between Clinical Presentation and Endometriosis Types J. Minim. Invasive Gynecol. 2024 31 S165 S166 10.1016/j.jmig.2024.09.1008 34. Marín Sánchez M. Carratalá Pérez O. Martínez Gómez A. Oliva Sánchez R. Nieto Díaz A. Evaluation of hopelessness in patients with endometriosis Clín. Investig. Ginecol. Obstet. 2024 51 100936 10.1016/j.gine.2023.100936 35. Vercellini P. Aimi G. De Giorgi O. Maddalena S. Carinelli S. Crosignani P.G. Is cystic ovarian endometriosis an asymmetric disease? Br. J. Obs. Gynaecol. 1998 105 1018 1021 10.1111/j.1471-0528.1998.tb10267.x 9763055 36. Vercellini P. Busacca M. Aimi G. Bianchi S. Frontino G. Crosignani P.G. Lateral distribution of recurrent ovarian endometriotic cysts Fertil. Steril. 2002 77 848 849 10.1016/S0015-0282(01)03239-3 11937148 37. Jenkins S. Olive D.L. Haney A.F. Endometriosis: Pathogenetic implications of the anatomic distribution Obstet. Gynecol. 1986 67 335 338 3945444 38. Demir E. Soyman Z. Kelekci S. Outcomes between non-IVF and IVF treatment after laparoscopic conservative surgery of advanced endometriosis with Endometriosis Fertility Index score >3 Medicine 2022 101 e30602 10.1097/MD.0000000000030602 36123931 PMC10662901 39. Hobo R. Nakagawa K. Usui C. Sugiyama R. Ino N. Motoyama H. Kuribayashi Y. Inoue M. Sugiyama R. The Endometriosis Fertility Index Is Useful for Predicting the Ability to Conceive Without Assisted Reproductive Technology Treatment after Laparoscopic Surgery, Regardless of Endometriosis Gynecol. Obstet. Investig. 2018 83 493 498 10.1159/000480454 28873380 40. Maheux-Lacroix S. Nesbitt-Hawes E. Deans R. Won H. Budden A. Adamson D. Abbott J.A. Endometriosis fertility index predicts live births following surgical resection of moderate and severe endometriosis Hum. Reprod. 2017 32 2243 2249 10.1093/humrep/dex291 29040471 41. Leone Roberti Maggiore U. Chiappa V. Ceccaroni M. Roviglione G. Savelli L. Ferrero S. Raspagliesi F. Spanò Bascio L. Epidemiology of infertility in women with endometriosis Best Pract. Res. Clin. Obstet. Gynaecol. 2024 92 102454 10.1016/j.bpobgyn.2023.102454 38183767 42. Vergetaki A. Jeschke U. Vrekoussis T. Taliouri E. Sabatini L. Papakonstanti E.A. Makrigiannakis A. Differential expression of CRH, UCN, CRHR1 and CRHR2 in eutopic and ectopic endometrium of women with endometriosis PLoS ONE 2013 8 e62313 10.1371/journal.pone.0062313 23638035 PMC3634725 43. Vergetaki A. Jeschke U. Vrekoussis T. Taliouri E. Sabatini L. Papakonstanti E.A. Makrigiannakis A. Galectin-1 overexpression in endometriosis and its regulation by neuropeptides (CRH, UCN) indicating its important role in reproduction and inflammation PLoS ONE 2014 9 e114229 10.1371/journal.pone.0114229 25473847 PMC4256414 44. Carrarelli P. Luddi A. Funghi L. Arcuri F. Batteux F. Dela Cruz C. Tosti C. Reis F.M. Chapron C. Petraglia F. Urocortin and corticotrophin-releasing hormone receptor type 2 mRNA are highly expressed in deep infiltrating endometriotic lesions Reprod. Biomed. Online 2016 33 476 483 10.1016/j.rbmo.2016.07.009 27567427 45. Novembri R. Carrarelli P. Toti P. Rocha A.L. Borges L.E. Reis F.M. Piomboni P. Florio P. Petraglia F. Urocortin 2 and urocortin 3 in endometriosis: Evidence for a possible role in inflammatory response Mol. Hum. Reprod. 2011 17 587 593 10.1093/molehr/gar020 21454316 46. Tokmak A. Ugur M. Tonguc E. Var T. Moraloğlu O. Ozaksit G. The value of urocortin and Ca-125 in the diagnosis of endometrioma Arch. Gynecol. Obstet. 2011 283 1075 1079 10.1007/s00404-010-1505-2 20480172 47. Yalcin S.E. Ocal I. Yalcin Y. Selim H.S. Caltekin M.D. Aydogmus H. Kelekci S. Evaluation of the Ki-67 Proliferation Index and Urocortin Expression in Women with Ovarian Endometriomas Eurasian J. Med. 2017 49 107 112 10.5152/eurasianjmed.2017.17070 28638252 PMC5469835 48. Abramiuk M. Frankowska K. Kułak K. Tarkowski R. Mertowska P. Mertowski S. Grywalska E. Possible Correlation between Urocortin 1 (Ucn1) and Immune Parameters in Patients with Endometriosis Int. J. Mol. Sci. 2023 24 7787 10.3390/ijms24097787 37175494 PMC10178394 49. Chmaj-Wierzchowska K. Kampioni M. Wilczak M. Sajdak S. Opala T. Novel markers in the diagnostics of endometriomas: Urocortin, ghrelin, and leptin or leukocytes, fibrinogen, and CA-125? Taiwan. J. Obstet. Gynecol. 2015 54 126 130 10.1016/j.tjog.2014.08.004 25951715 50. Maia L.M. Rocha A.L. Del Puerto H.L. Petraglia F. Reis F.M. Plasma urocortin-1 as a preoperative marker of endometriosis in symptomatic women Gynecol. Endocrinol. 2018 34 202 205 10.1080/09513590.2017.1380188 28925754 51. Xiaomeng X. Ming Z. Jiezhi M. Xiaoling F. Aberrant histone acetylation and methylation levels in woman with endometriosis Arch. Gynecol. Obstet. 2013 287 487 494 10.1007/s00404-012-2591-0 23080547 52. Monteiro J.B. Colón-Díaz M. García M. Gutierrez S. Colón M. Seto E. Laboy J. Flores I. Endometriosis is characterized by a distinct pattern of histone 3 and histone 4 lysine modifications Reprod. Sci. 2014 21 305 318 10.1177/1933719113497267 23899551 PMC3936415 53. Gong Y. Liu M. Zhang Q. Li J. Cai H. Ran J. Ma L. Ma Y. Quan S. Lysine acetyltransferase 14 mediates TGF-β-induced fibrosis in ovarian endometrioma via co-operation with serum response factor J. Transl. Med. 2024 22 561 10.1186/s12967-024-05243-2 38867256 PMC11167823 54. Oki Y. Sasano H. Localization and physiological roles of Urocortin Peptides 2024 25 1745 1749 10.1016/j.peptides.2004.06.023 15476941 55. Pant A. Moar K.K. Arora T. Maurya P.K. Biomarkers of endometriosis Clin. Chim. Acta. 2023 549 117563 10.1016/j.cca.2023.117563 37739024 56. Kouzarides T. Chromatin modifications and their function Cell 2007 128 693 705 10.1016/j.cell.2007.02.005 17320507 57. Luger K. Mäder A.W. Richmond R.K. Sargent D.F. Richmond T.J. Crystal structure of the nucleosome core particle at 2.8 A resolution Nature 1997 389 251 260 10.1038/38444 9305837 58. Xu J. Zhang X. Pelayo R. Monestier M. Ammollo C.T. Semeraro F. Taylor F.B. Esmon N.L. Lupu F. Esmon C.T. Extracellular histones are major mediators of death in sepsis Nat. Med. 2009 15 1318 1321 10.1038/nm.2053 19855397 PMC2783754 59. Bedrick B.S. Courtright L. Zhang J. Snow M. Amendola I.L.S. Nylander E. Cayton-Vaught K. Segars J. Singh B. A Systematic Review of Epigenetics of Endometriosis FS Rev. 2024 5 100070 10.1016/j.xfnr.2024.01.003 38524912 PMC10956470 60. Huang E. Wang X. Chen L. Regulated Cell Death in Endometriosis Biomolecules 2024 14 142 10.3390/biom14020142 38397379 PMC10886833 61. Nisenblat V. Bossuyt P.M. Shaikh R. Farquhar C. Jordan V. Scheffers C.S. Mol B.W. Johnson N. Hull M.L. Blood biomarkers for the non-invasive diagnosis of endometriosis Cochrane Database Syst. Rev. 2016 2016 CD012179 10.1002/14651858.CD012179 27132058 PMC7076288 62. Dochez V. Caillon H. Vaucel E. Dimet J. Winer N. Ducarme G. Biomarkers and algorithms for diagnosis of ovarian cancer: CA125, HE4, RMI and ROMA, a review J. Ovarian Res. 2019 12 28 10.1186/s13048-019-0503-7 30917847 PMC6436208 63. Tian Z. Chang X.H. Zhao Y. Zhu H.L. Current biomarkers for the detection of endometriosis Chin. Med. J. 2020 133 2346 2352 10.1097/CM9.0000000000001063 32858595 PMC7546884 64. Kobayashi H. Imanaka S. Yoshimoto C. Matsubara S. Shigetomi H. Rethinking the pathogenesis of endometriosis: Complex interactions of genomic, epigenetic, and environmental factors J. Obstet. Gynaecol. Res. 2024 50 1771 1784 10.1111/jog.16089 39293995 65. Vissers G. Giacomozzi M. Verdurmen W. Peek R. Nap A. The role of fibrosis in endometriosis: A systematic review Hum. Reprod. Update 2024 30 706 750 10.1093/humupd/dmae023 39067455 PMC11532625 Figure 1 ( a b Figure 2 ( a b Figure 3 ( a p p b x p xx p Figure 4 ( a b Figure 5 ( a b Figure 6 ( a b Figure 7 Spearman correlation between EFI Score and Urocortin ( a b c d e Figure 8 ROC Curve. Clinical predictors of postoperative pregnancy achievement. medicina-61-01671-t001_Table 1 Table 1 Baseline parameters. Parameter Group 1 Group 2 Group 3 Mean age 33.60 ± 5.14 31.20 ± 3.90 30.40 ± 4.78 Age of menarche ≈12 (11–15) ≈12 (11–15) ≈12 (11–15) Infertility 19 (63.3%) NA NA Symptom onset 93.3% NA NA Mean symptom duration 5 ± 2 0.5 ± 0.4 NA  Severity symptoms—Visual Analog Scale (#, %)   No Treatment  Dysmenorrhea—VAS ≥ 7 25 (83%) 5 (100%) NA Dyspareunia—VAS 4–6 18 (60%) 5 (100%) NA Chronic pelvic pain—VAS 4–6 28 (93.3%) 4 (80%) NA  Pharmacological Treatment  Dysmenorrhea—VAS 4–6 29 (96.7%) 5 (100%) NA Dyspareunia—VAS 4–6 28 (93.3%) 2 (40%) NA Chronic pelvic pain—VAS 4–6 16 (53.3%) 0 (0%) NA  1-year follow—up  Dysmenorrhea—VAS 4–6 23 (76.7%) 2 (40%) NA Dyspareunia—VAS < 4 21 (70%) 5 (100%) NA Chronic pelvic pain—VAS < 4 29 (96.7%) 5 (100%) NA  Intra-operative aspects (#, %)  Endometrioma laterality: left 16 (53.3%) NA NA Endometrioma laterality: right 6 (20%) NA NA Endometrioma laterality: bilateral 8 (26.7%) NA NA Laparoscopic approach 27 (90%) NA NA Conversion to open surgery 3 (10%) NA NA Adhesiolysis performed 29 (96.7%) NA NA  Recurrent lesion of endometriosis (#, %) 5 (16.7%) NA NA #—number; % percentage; VAS < 4—mild pain, VAS 4–6—moderate pain, VAS ≥ 7—severe pain; NA—Not Applicable. medicina-61-01671-t002_Table 2 Table 2 Correlation between EFI Index and investigated biomarkers. Biomarker Index EFI < 55 Index EFI 5–7 Index EFI ≥ 8 CA–125 (U/mL) 72.30 ± 28.12 67.11 ± 22.18 ( p 61.13 ± 29.67 ( p p Serum Urocortin (μg/mL) 3.62 ± 0.47 3.65 ± 0.38 ( p 4.00 ± 0.20 ( p p Urinary Urocortin (μg/mL) 2.30 ± 1.44 2.58 ± 1.37 ( p 2.91 ± 1.18 ( p p Serum Histone H4 (ng/mL) 0.46 ± 0.13 0.50 ± 0.25 ( p 1.05 ± 0.95 ( p p Urinary Histone H4 (ng/mL) 0.36 ± 0.05 0.33 ± 0.04 ( p 0.30 ± 0.01 ( p p ",
  "metadata": {
    "Title of this paper": "The role of fibrosis in endometriosis: A systematic review",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471389/"
  }
}