{
  "title": "Paper_938",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12484527 PMC12484527.1 12484527 12484527 41026307 10.1007/s12672-025-03492-1 3492 1 Research Identification of KIF14 as a ferroptosis biomarker for predicting the prognosis and immunotherapy efficacy of bladder cancer Ma Xiaocheng 1 2 Quan Changyi quanchangyi@tmu.edu.cn 1 1 https://ror.org/03rc99w60 grid.412648.d 0000 0004 1798 6160 Department of Urology, The Second Hospital of Tianjin Medical University, 2 https://ror.org/026e9yy16 grid.412521.1 0000 0004 1769 1119 Department of Urology, The Affiliated Hospital of Qingdao University, 30 9 2025 12 2025 16 478248 1786 23 5 2025 23 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Ferroptosis, a recently recognized form of regulated cell death, plays a prominent role in anti-tumor immunity. However, the potential functions of ferroptosis-related regulators in the prognosis, immune checkpoint genes expression, and immunotherapy efficacy of bladder cancer (BC) have not been systematically studied. Materials and methods We systematically evaluated the correlations between ferroptosis levels and prognosis, clinical characteristics, tumor mutation burden (TMB), immune checkpoint gene expression, and immune cell infiltration characteristics. The ferroptosis level of each patient was calculated using principal component analysis based on the expression of prognostic differentially expressed genes. Hub ferroptosis-related genes involved in immunoregulation and immunotherapy efficacy in BC were subsequently identified. Results Eighteen ferroptosis regulators were associated with the prognosis of BC. We identified three ferroptosis subgroups, which have different immune cell infiltration characteristics and distinct carcinogenesis-related immune pathways, such as immune cell differentiation, and the PD-L1/PD-1 pathway. High ferroptosis levels and ferroptosis-related gene kinesin family member 14 (KIF14) are closely associated with poor prognosis, tumor mutation burden, immune checkpoint genes expression, and immune cell infiltration. An immunotherapy cohort confirmed that patients with high KIF14 expression demonstrated significant therapeutic and clinical benefits. Conclusions The study revealed that ferroptosis level and KIF14 were significantly related to prognosis, immune checkpoint genes expression, immune cell infiltration, and immunotherapy response in BC. Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03492-1. Keywords KIF14 Bladder cancer Ferroptosis Immunotherapy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Bladder cancer (BC) is a common tumor of the urinary system, and is considered one of the most aggressive malignant tumors. In 2022, its incidence rate ranked 7th and the mortality rate ranked 8th in malignancy worldwide [ 1 Recently, a few studies have indicated that crosstalk between ferroptosis and immune reprogramming plays an important role in the anti-tumor immune response. Ferroptosis is a recognized novel iron-dependent reactive oxygen species that regulates cell death and has emerged to play a vital role in carcinogenesis [ 2 4 + 5 6 In the study, we explored the role of ferroptosis score in the BC prognosis and tumor immune microenvironment. Additionally, KIF14 was identified as a ferroptosis-related biomarker, which can predict the prognosis and immunotherapeutic effect of BC patients. Methods Data collection We obtained publicly available mRNA sequencing data and corresponding clinical annotations from two primary sources: the Gene-Expression Omnibus (GEO, https://www.ncbi.nlm.nih.gov/geo/ GSE13507 n https://tcga-data.nci.nih.gov/tcga/ n 7 8 n 9 10 Unsupervised clustering for ferroptosis regulators We employed an unsupervised consensus clustering approach to stratify bladder cancer patients into distinct molecular subgroups based on ferroptosis regulator expression patterns. The analysis was conducted using the ConsensusClusterPlus package with 1,000 bootstrap iterations to ensure robust cluster identification [ 11 12 Estimation of immune cell infiltration in the tumor microenvironment We quantified the tumor microenvironment immune cell composition using CIBERSORT ( https://cibersort.stanford.edu/ 13 p 14 Gene set variation analysis We performed Gene Set Variation Analysis (GSVA) using the GSVA R package (v1.46.0) to quantify differences in pathway activity between ferroptosis-related subgroups [ 15 16 KEGG enrichment analysis SangerBox ( http://vip.sangerbox.com/login.html 17 Establishment of a protein-protein interaction (PPI) network The STRING website (Search Tool for the Retrieval of Interacting Gene, https://string-db.org/ 18 Construction of a ferroptosis related scoring system To assess the ferroptosis level in the tumor microenvironment, a ferroptosis-related scoring system was constructed, which was termed the ferroptosis score. Univariate analysis was performed to assess the prognostic value of the differentially expressed genes. Subsequently, principal component analysis was used to establish a ferroptosis-related scoring system based on the expression levels of the prognostic genes [ 13 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:ferroptosis\\:score=\\sum\\:(PC1i+PC2i)$$\\end{document} 19 Immunohistochemical analysis Tissue specimens were fixed in 0.4% formaldehyde solution, rehydrated using a graded ethanol series, and subsequently embedded in paraffin blocks. Sections of 3 μm thickness were cut, deparaffinized using xylene, and rehydrated through a descending alcohol gradient. Antigen retrieval was performed by heat-induced epitope retrieval in sodium citrate buffer (pH 6.0) at 100 °C for 5 min. Endogenous peroxidase activity was quenched by incubation with 0.3% hydrogen peroxide solution for 20 min at room temperature. The sections were then incubated overnight at 4 °C with primary rabbit polyclonal anti-KIF14 antibody. Following PBS washes, the sections were incubated with biotin-conjugated secondary antibodies. Immunoreactivity was visualized using diaminobenzidine tetrahydrochloride (DAB) as the chromogen [ 20 21 Statistical analysis Statistical tests were performed using R version 3.6.0 and GraphPad Prism 8.0. Comparisons between two groups were performed using an unpaired, two-tailed Student’s t-test. Mann-Whitney test was used to compare the difference in immune cell inflation levels and immune checkpoint genes expression between different groups. Depending on the relationship between ferroptosis-related genes or ferroptosis score and BC patients’ survival, the “survminer” R package was used to determine the cut-off point for each subgroup of the dataset. We use the Kaplan-Meier method to generate survival curves and compared the difference between groups with the log-rank test. Spearman analysis was used to evaluate the correlation between KIF14 and ferroptosis regulators. A P Results The landscape of genetic variation of ferroptosis regulators in BC To preliminarily explore the potential functions of ferroptosis regulators in BC, we evaluated the incidence of somatic mutations in ferroptosis regulators in BC. Among 408 samples, 77 had mutations in ferroptosis regulators, with a frequency of 18.87%. NFE2L2 exhibited the highest mutation frequency in BC (Fig. 1 1 1  Fig. 1 Landscape of genetic variation of ferroptosis regulators in BC. A B–E F n n P P P Clinical values of ferroptosis regulators in BC To further evaluate the significance of ferroptosis regulators in BC, survival analyses for ferroptosis regulators were performed by using the “survminer” R package. These results showed that ATP5MC3, CARS, CDKN1A, CISD1, DPP4, EMC2, FACD2, HSPA5, HSPB1, LPCAT3, MT1G, NCOA4, RPL8, SLC1A5, SLC7A1, and TFRC were related to the poor prognosis of BC, whereas ACSL4 and GPX4 were associated with the favorable prognosis of BC (Supplementary 2). Furthermore, the relationship between ferroptosis regulators and clinical features has also been studied. We found that patients with high grade had higher expression of ACSL4, ALOX15, CDKN1A, CS, DPP4, EMC2, FANCD2, MT1G, and TFRC (Supplementary. 3 A). DPP4, FANCD2, LPCAT3, MT1G, SLC7A1, and TFRC were highly expressed in patients with stage III-IV, while GPX4 and RPL8 were highly expressed in patients with stage I-II (Supplementary Fig. 3B). DPP4, FANCD2, LPCAT3, MT1G, SLC7A1, and TFRC were highly expressed, while GPX4 and RPL8 have low expression in advanced T patients (Supplementary. 3 C). Compared to BC patients without lymph node metastasis, ATP5MC3, CDKN1A, GPX4, and RPL8 were down-regulated, while DPP4, LPCAT3, SLC7A1, and TFRC were up-regulated (Supplementary. 3D). Moreover, the expression levels of ATP5MC3 and NFE2L2 were low in BC patients with metastasis (Supplementary. 3E). Therefore, ferroptosis regulators were not only associated with the prognosis of BC, but also correlated with the clinical characteristics of BC, which indicates the potential function of ferroptosis regulators in the carcinogenesis and development of BC. The characterization of immune cell infiltration in different ferroptosis subgroups To explore the relationship between ferroptosis regulators and immune cell infiltration in the tumor microenvironment, we first classify BC patients into different subgroups based on the expression levels of ferroptosis regulators, and three different subgroups were identified, namely Cluster A ( n n n 2 2 + 2  Fig. 2 Patterns of ferroptosis subgroups and biological characteristics of each pattern A n n n B C D E F n n n n n G H P P P To further investigate the potential biological behavior of each ferroptosis group, we determined 2431differentially expressed ferroptosis-related genes (Fig. 2 2 n n n 2 2 2 The ferroptosis level was closely related to prognosis and immune molecules expression in BC To evaluate the ferroptosis level of each BC patient, a ferroptosis-related scoring system (ferroptosis score) was constructed based on the expression of prognostic ferroptosis-related genes using the PCA algorithm. Subsequently, BC patients were divided into high- and low-score groups. BC patients in Cluster C and geneCluster B had high ferroptosis scores (Fig. 3 3 3 3  Fig. 3 Construction of a ferroptosis score. A, B C n D–H n I–L n M–P n Identification of KIF14 was a hub ferroptosis-related biomarker in BC To identify potential ferroptosis related genes that influence the immunotherapeutic efficacy of BC, a protein-protein interaction (PPI) network of DEGs was performed, and nine hub genes were (KIF14, FSTL1, POLD2, TPM3, GREM1, S100A7, RILP, TAF4B, and IFI6) identified by using Cytoscape software (Supplementary Fig. 6). Among these genes, KIF14, POLD2, TPM3, S100A7, and IFI6 were upregulated, whereas REM1 was downregulated in BC (Fig. 4 4 4 4 4  Fig. 4 Identification of KIF14 as a hub ferroptosis-related biomarker in BC. A n B C n D E n F–K n P P P To further explore whether KIF14 influences immunotherapy of BC through ferroptosis-related pathways, the relationship between KIF14 and ferroptosis level was analyzed. The results showed that KIF14 was significantly associated with the ferroptosis score in BC (Fig. 4 1  Table 1 The correlation between KIF14 and ferroptosis regulators KIF14 vs. Pearson r 95% CI P HSPB1 -0.2557 -0.3307 to -0.1775 < 0.0001 GPX4 -0.1987 -0.2761 to -0.1187 < 0.0001 CDKN1A -0.1667 -0.2452 to -0.08593 < 0.0001 ATP5MC3 0.174 0.09342 to 0.2523 < 0.0001 ACSL4 0.2013 0.1214 to 0.2786 < 0.0001 CISD1 0.2063 0.1265 to 0.2834 < 0.0001 DPP4 0.2082 0.1285 to 0.2852 < 0.0001 NCOA4 0.2322 0.1532 to 0.3082 < 0.0001 LPCAT3 0.2428 0.1642 to 0.3184 < 0.0001 MT1G 0.2738 0.1963 to 0.3479 < 0.0001 HSPA5 0.3094 0.2334 to 0.3817 < 0.0001 SLC7A1 0.395 0.3235 to 0.4619 < 0.0001 TFRC 0.4047 0.3338 to 0.4710 < 0.0001 EMC2 0.4265 0.3571 to 0.4912 < 0.0001 FANCD2 0.5984 0.5431 to 0.6485 < 0.0001 SAT1 -0.0191 -0.1009 to 0.06291 0.6482 GLS2 0.03245 -0.04960 to 0.1141 0.4382 ALOX15 0.05257 -0.02946 to 0.1339 0.2089 SLC1A5 0.06481 -0.01719 to 0.1459 0.1212 RPL8 -0.08901 -0.1697 to -0.007151 0.0332 CARS 0.1506 0.06951 to 0.2296 0.0003 NFE2L2 0.1566 0.07562 to 0.2354 0.0002 CI, confidence interval KIF14 was associated the poor prognosis of BC patients and immunotherapy response in-house BC cohort To validate the above results, we detected KIF14 expression in our BC cohort. IHC staining demonstrated that KIF14 was highly expressed in BC samples (Fig. 5 5 5  Fig. 5 KIF14 was associated the poor prognosis of BC patients and immunotherapy response in-house BC cohort. A n n B C n D E n P Discussion Emerging evidence suggestes that ferroptosis was an adaptive process that plays an indispensable role in anti-tumor immune response. Previous studies on the overall tumor immune response characterizations regulated by the integrated roles of multiple ferroptosis regulators are not comprehensively recognized. Identifying the significance of ferroptosis regulators in the tumor microenvironment is important for improving the biological role and network regulatory factors of the PD-L1/PD-1 pathway in the mechanism of BC progression. In our study, the expression profiles and clinical value of ferroptosis regulators were analyzed. We found that ferroptosis regulators were differentially expressed and associated with the prognosis and clinical features of BC. These results indicate that an imbalance in the expression of ferroptosis regulators is important for the occurrence and progression of BC. Previous studies have also demonstrated the function and mechanism of ferroptosis in the development of cancer [ 22 23 25 26 To validate the above speculation, we constructed a scoring system to assess the ferroptosis level of individual patients. The ferroptosis score was a prognostic factor and was a significantly different among the three subgroups. In addition, the ferroptosis score was positively related to the expression of immune-checkpoint genes (PD-1, PD-L1, CTLA4) and negatively associated with TMB. Immune checkpoint genes and TMB have been demonstrated to be biomarkers for immunotherapy responses in tumors. A previous study revealed that ferroptosis plays an important role in T-cell-induced cancer cell death, and HnRNP L enhanced the immune escape of cancer by targeting the YY1/PD-L1 axis and suppressing ferroptosis in castration-resistant prostate cancer cells [ 27 + 28 To further investigate novel and reliable ferroptosis-related biomarkers that could predict the prognosis and immunotherapy efficacy of BC, we constructed a PPI network of differentially expressed ferroptosis-related genes, and identified KIF14 as a hub gene. In addition, KIF14 was associated with the ferroptosis score and expression of ferroptosis regulators in BC. KIF14, a mitotic kinesin, plays a vital role in cytokinesis and the segregation, congression, and alignment of chromosomes. Increasing evidence has demonstrated that overexpression KIF14 overexpression is closely related to the development and poor prognosis of various tumors, such as gastric cancer, lung cancer, colorectal cancer, hepatocellular carcinoma [ 29 33 34 35 36 37 Limitation Our study has several limitations that should be acknowledged. First, the retrospective nature of the analysis may have introduced selection bias due to incomplete clinical data availability. Larger prospective cohorts are needed to validate our findings before clinical translation. Second, although we identified key ferroptosis-related genes with prognostic and immunological relevance, their precise mechanistic roles in BC pathogenesis and treatment resistance remain unclear. Future functional studies, including in vitro and in vivo models, are necessary to elucidate the underlying molecular mechanisms. In conclusion In conclusion, this study revealed that KIF14 was significantly related to prognosis, immune checkpoint gene expression, tumor microenvironment immune cell infiltration, and immunotherapy response in BC. Therefore, a comprehensive understanding of the complex network mechanism between ferroptosis and tumor immune reprogramming will contribute to improving the efficacy of immunotherapy. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1. The expression levels of ferroptosis regulators in NFE2L2 mutant types and NFE2L2 wild types ( n  Supplementary Material 2. Prognostic values of ferroptosis regulators in BC. ATP5MC3, CARS, CDKN1A, CISD1, DPP4, EMC2, FACD2, HSPA5, HSPB1, LPCAT3, MT1G, NCOA4, RPL8, SLC1A5, SLC7A1, and TFRC were related to the poor prognosis of BC, while ACSL4 and GPX4 were related to the favorable prognosis of BC ( n  Supplementary Material 3. The relationship between ferroptosis regulators and clinical characteristics in BC ( n A B C D E  Supplementary Material 4. A–D E–G H–K  Supplementary Material 5. A–E n F–I n  Supplementary Material 6. A https://string-db.org/ B–J  Supplementary Material 7. Survival analysis for nine hub genes in the TCGA BC cohort and GEO BC cohort ( n  Supplementary Material 8. A–G n H I  Supplementary Material 9. The relationship between KIF14 and TMB, CTLA4, PD-1, PD-L1, immune cell infiltrating levels, and ferroptosis score in BC ( n  Supplementary Material 10. The clinical characteristics of TCGA and GEO patients. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements None. Author contributions Xiaocheng Ma: Conceptualization, Methodology, Data curation, and Writing-original draft. Changyi Quan: Writing-review&editing. All authors contributed to manuscript revision, read and approved the submitted version. Funding None. Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate This study was approved by the Second Hospital of Tianjin Medical University. This study was conducted in accordance with the principles of the Declaration of Helsinki. Informed consent was obtained from all subjects or, if subjects are under 18, from a parent and/or legal guardian. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Siegel RL Miller KD Fuchs HE Jemal A Cancer statistics, 2022 CA Cancer J Clin 2022 72 1 7 33 10.3322/caac.21708 35020204 Siegel RL, Miller KD, Fuchs HE, Jemal A. Cancer statistics, 2022. CA Cancer J Clin. 2022;72(1):7–33. 10.3322/caac.21708. 35020204 10.3322/caac.21708 2. Mou Y Wang J Wu J He D Zhang C Duan C Li B Ferroptosis, a new form of cell death: opportunities and challenges in cancer J Hematol Oncol 2019 12 1 34 10.1186/s13045-019-0720-y 30925886 PMC6441206 Mou Y, Wang J, Wu J, He D, Zhang C, Duan C, Li B. Ferroptosis, a new form of cell death: opportunities and challenges in cancer. J Hematol Oncol. 2019;12(1):34. 10.1186/s13045-019-0720-y. 30925886 10.1186/s13045-019-0720-y PMC6441206 3. Hassannia B Vandenabeele P Vanden Berghe T Targeting ferroptosis to iron out cancer Cancer Cell 2019 35 6 830 49 10.1016/j.ccell.2019.04.002 31105042 Hassannia B, Vandenabeele P, Vanden Berghe T. Targeting ferroptosis to iron out cancer. Cancer Cell. 2019;35(6):830–49. 10.1016/j.ccell.2019.04.002. 31105042 10.1016/j.ccell.2019.04.002 4. Xu T Ding W Ji X Ao X Liu Y Yu W Wang J Molecular mechanisms of ferroptosis and its role in cancer therapy J Cell Mol Med 2019 23 8 4900 12 10.1111/jcmm.14511 31232522 PMC6653007 Xu T, Ding W, Ji X, Ao X, Liu Y, Yu W, Wang J. Molecular mechanisms of ferroptosis and its role in cancer therapy. J Cell Mol Med. 2019;23(8):4900–12. 10.1111/jcmm.14511. 31232522 10.1111/jcmm.14511 PMC6653007 5. Tang R Xu J Zhang B Liu J Liang C Hua J Meng Q Yu X Shi S Ferroptosis, necroptosis, and pyroptosis in anticancer immunity J Hematol Oncol 2020 13 1 110 10.1186/s13045-020-00946-7 32778143 PMC7418434 Tang R, Xu J, Zhang B, Liu J, Liang C, Hua J, Meng Q, Yu X, Shi S. Ferroptosis, necroptosis, and pyroptosis in anticancer immunity. J Hematol Oncol. 2020;13(1):110. 10.1186/s13045-020-00946-7. 32778143 10.1186/s13045-020-00946-7 PMC7418434 6. Jiang Z Lim SO Yan M Hsu JL Yao J Wei Y Chang SS Yamaguchi H Lee HH Ke B Hsu JM Chan LC Hortobagyi GN Yang L Lin C Yu D Hung MC TYRO3 induces anti-PD-1/PD-L1 therapy resistance by limiting innate immunity and tumoral ferroptosis J Clin Invest 2021 131 8 e139434 10.1172/JCI139434 33855973 PMC8262501 Jiang Z, Lim SO, Yan M, Hsu JL, Yao J, Wei Y, Chang SS, Yamaguchi H, Lee HH, Ke B, Hsu JM, Chan LC, Hortobagyi GN, Yang L, Lin C, Yu D, Hung MC. TYRO3 induces anti-PD-1/PD-L1 therapy resistance by limiting innate immunity and tumoral ferroptosis. J Clin Invest. 2021;131(8):e139434. 10.1172/JCI139434. 33855973 10.1172/JCI139434 PMC8262501 7. Song DM Feng K Luo WF Lv DS Zhou LP He YB Jin Y Predicting survival in bladder cancer with a novel apoptotic gene-related prognostic model Discov Oncol 2024 15 1 702 10.1007/s12672-024-01575-z 39580765 PMC11586327 Song DM, Feng K, Luo WF, Lv DS, Zhou LP, He YB, Jin Y. Predicting survival in bladder cancer with a novel apoptotic gene-related prognostic model. Discov Oncol. 2024;15(1):702. 39580765 10.1007/s12672-024-01575-z PMC11586327 8. Mariathasan S Turley SJ Nickles D Castiglioni A Yuen K Wang Y Kadel EE III Koeppen H Astarita JL Cubas R Jhunjhunwala S Banchereau R Yang Y Guan Y Chalouni C Ziai J Şenbabaoğlu Y Santoro S Sheinson D Hung J Giltnane JM Pierce AA Mesh K Lianoglou S Riegler J Carano RAD Eriksson P Höglund M Somarriba L Halligan DL van der Heijden MS Loriot Y Rosenberg JE Fong L Mellman I Chen DS Green M Derleth C Fine GD Hegde PS Bourgon R Powles T TGFβ attenuates tumour response to PD-L1 Blockade by contributing to exclusion of T cells Nature 2018 554 7693 544 8 10.1038/nature25501 29443960 PMC6028240 Mariathasan S, Turley SJ, Nickles D, Castiglioni A, Yuen K, Wang Y, Kadel EE III, Koeppen H, Astarita JL, Cubas R, Jhunjhunwala S, Banchereau R, Yang Y, Guan Y, Chalouni C, Ziai J, Şenbabaoğlu Y, Santoro S, Sheinson D, Hung J, Giltnane JM, Pierce AA, Mesh K, Lianoglou S, Riegler J, Carano RAD, Eriksson P, Höglund M, Somarriba L, Halligan DL, van der Heijden MS, Loriot Y, Rosenberg JE, Fong L, Mellman I, Chen DS, Green M, Derleth C, Fine GD, Hegde PS, Bourgon R, Powles T. TGFβ attenuates tumour response to PD-L1 Blockade by contributing to exclusion of T cells. Nature. 2018;554(7693):544–8. 10.1038/nature25501. 29443960 10.1038/nature25501 PMC6028240 9. Wang Z Dai Z Gao Y Zhao Z Li Z Wang L Gao X Qiu Q Qiu X Liu Z Development of a machine learning-based predictive risk model combining fatty acid metabolism and ferroptosis for immunotherapy response and prognosis in prostate cancer Discov Oncol 2025 16 1 744 10.1007/s12672-025-02484-5 40355680 PMC12069205 Wang Z, Dai Z, Gao Y, Zhao Z, Li Z, Wang L, Gao X, Qiu Q, Qiu X, Liu Z. Development of a machine learning-based predictive risk model combining fatty acid metabolism and ferroptosis for immunotherapy response and prognosis in prostate cancer. Discov Oncol. 2025;16(1):744. 40355680 10.1007/s12672-025-02484-5 PMC12069205 10. Liu K Yu J Huang X Gao H Wang J WGCNA and ferroptosis genes in OSCC: unraveling prognostic biomarkers and therapeutic targets Discov Oncol 2025 16 1 379 10.1007/s12672-025-02151-9 40126728 PMC11933588 Liu K, Yu J, Huang X, Gao H, Wang J. WGCNA and ferroptosis genes in OSCC: unraveling prognostic biomarkers and therapeutic targets. Discov Oncol. 2025;16(1):379. 40126728 10.1007/s12672-025-02151-9 PMC11933588 11. Lu B Liu Y Ji G Yao Y Yang Z Zhu B Wang L Dong K Li Y Shi J He J Huang R Zhou W Cui X Pan X Cui X Construction of a prostate adenocarcinoma molecular classification: integrating Spatial transcriptomics with retrospective cohort validation J Transl Med 2025 23 1 717 10.1186/s12967-025-06661-6 40598508 PMC12220030 Lu B, Liu Y, Ji G, Yao Y, Yang Z, Zhu B, Wang L, Dong K, Li Y, Shi J, He J, Huang R, Zhou W, Cui X, Pan X, Cui X. Construction of a prostate adenocarcinoma molecular classification: integrating Spatial transcriptomics with retrospective cohort validation. J Transl Med. 2025;23(1):717. 10.1186/s12967-025-06661-6. 40598508 10.1186/s12967-025-06661-6 PMC12220030 12. Shen C Liu J Yang X Jiao W Wang Y Development and validation of an m6A RNA methylation Regulators-Based signature for predicting the prognosis of adrenocortical carcinoma Front Endocrinol (Lausanne) 2021 12 568397 10.3389/fendo.2021.568397 33692753 PMC7937949 Shen C, Liu J, Yang X, Jiao W, Wang Y. Development and validation of an m6A RNA methylation Regulators-Based signature for predicting the prognosis of adrenocortical carcinoma. Front Endocrinol (Lausanne). 2021;12:568397. 10.3389/fendo.2021.568397. 33692753 10.3389/fendo.2021.568397 PMC7937949 13. Wang B Wei Z Xu M Shu H Fan Z Identification of key ferroptosis genes and subtypes in kidney renal clear cell carcinoma Discov Oncol 2024 15 1 492 10.1007/s12672-024-01363-9 39331243 PMC11436560 Wang B, Wei Z, Xu M, Shu H, Fan Z. Identification of key ferroptosis genes and subtypes in kidney renal clear cell carcinoma. Discov Oncol. 2024;15(1):492. 39331243 10.1007/s12672-024-01363-9 PMC11436560 14. Chen B Khodadoust MS Liu CL Newman AM Alizadeh AA Profiling tumor infiltrating immune cells with CIBERSORT Methods Mol Biol 2018 1711 243 59 10.1007/978-1-4939-7493-1_12 29344893 PMC5895181 Chen B, Khodadoust MS, Liu CL, Newman AM, Alizadeh AA. Profiling tumor infiltrating immune cells with CIBERSORT. Methods Mol Biol. 2018;1711:243–59. 10.1007/978-1-4939-7493-1_12. 29344893 10.1007/978-1-4939-7493-1_12 PMC5895181 15. Xiao C Zhang X Hou B Wan P Cao Z Rao X CYFIP2: potential pancreatic cancer biomarker and immunotherapeutic target Discov Oncol 2024 15 1 847 10.1007/s12672-024-01650-5 39739214 PMC11685368 Xiao C, Zhang X, Hou B, Wan P, Cao Z, Rao X. CYFIP2: potential pancreatic cancer biomarker and immunotherapeutic target. Discov Oncol. 2024;15(1):847. 39739214 10.1007/s12672-024-01650-5 PMC11685368 16. Hänzelmann S Castelo R Guinney J GSVA: gene set variation analysis for microarray and RNA-seq data BMC Bioinformatics 2013 14 7 10.1186/1471-2105-14-7 23323831 PMC3618321 Hänzelmann S, Castelo R, Guinney J. GSVA: gene set variation analysis for microarray and RNA-seq data. BMC Bioinformatics. 2013;14:7. 10.1186/1471-2105-14-7. 23323831 10.1186/1471-2105-14-7 PMC3618321 17. Yu QX Wu RC Wang J Tuo ZT Yang J Zhang YP Jin J Yuan Q Wang CN Feng DC Li DX Exploring the role of ADAMTSL2 across multiple cancer types: A pan-cancer analysis and validated in colorectal cancer Discov Oncol 2024 15 1 538 10.1007/s12672-024-01401-6 39384622 PMC11465020 Yu QX, Wu RC, Wang J, Tuo ZT, Yang J, Zhang YP, Jin J, Yuan Q, Wang CN, Feng DC, Li DX. Exploring the role of ADAMTSL2 across multiple cancer types: A pan-cancer analysis and validated in colorectal cancer. Discov Oncol. 2024;15(1):538. 39384622 10.1007/s12672-024-01401-6 PMC11465020 18. Shen C Liu J Wang L Liang Z Niu H Wang Y Identification of metabolism-associated genes and construction of a prognostic signature in bladder cancer Cancer Cell Int 2020 20 1 538 10.1186/s12935-020-01627-8 33292266 PMC7643334 Shen C, Liu J, Wang L, Liang Z, Niu H, Wang Y. Identification of metabolism-associated genes and construction of a prognostic signature in bladder cancer. Cancer Cell Int. 2020;20(1):538. 10.1186/s12935-020-01627-8. 33292266 10.1186/s12935-020-01627-8 PMC7643334 19. Zhang B Wu Q Li B Wang D Wang L Zhou YL m6A regulator-mediated methylation modification patterns and tumor microenvironment infiltration characterization in gastric cancer Mol Cancer 2020 19 1 53 10.1186/s12943-020-01170-0 32164750 PMC7066851 Zhang B, Wu Q, Li B, Wang D, Wang L, Zhou YL. m6A regulator-mediated methylation modification patterns and tumor microenvironment infiltration characterization in gastric cancer. Mol Cancer. 2020;19(1):53. 10.1186/s12943-020-01170-0. 32164750 10.1186/s12943-020-01170-0 PMC7066851 20. Huang J Wang Q Li Z Huang X Wang W Liu J Identification and validation of LDHA and SLC16A1 for predicting prognosis and diagnosis in lower-grade glioma Discov Oncol 2025 16 1 1511 10.1007/s12672-025-03297-2 40782248 PMC12335421 Huang J, Wang Q, Li Z, Huang X, Wang W, Liu J. Identification and validation of LDHA and SLC16A1 for predicting prognosis and diagnosis in lower-grade glioma. Discov Oncol. 2025;16(1):1511. 10.1007/s12672-025-03297-2. 40782248 10.1007/s12672-025-03297-2 PMC12335421 21. Uhlen M Zhang C Lee S Sjöstedt E Fagerberg L Bidkhori G Benfeitas R Arif M Liu Z Edfors F Sanli K von Feilitzen K Oksvold P Lundberg E Hober S Nilsson P Mattsson J Schwenk JM Brunnström H Glimelius B Sjöblom T Edqvist PH Djureinovic D Micke P Lindskog C Mardinoglu A Ponten F A pathology atlas of the human cancer transcriptome Science 2017 357 6352 eaan2507 10.1126/science.aan2507 28818916 Uhlen M, Zhang C, Lee S, Sjöstedt E, Fagerberg L, Bidkhori G, Benfeitas R, Arif M, Liu Z, Edfors F, Sanli K, von Feilitzen K, Oksvold P, Lundberg E, Hober S, Nilsson P, Mattsson J, Schwenk JM, Brunnström H, Glimelius B, Sjöblom T, Edqvist PH, Djureinovic D, Micke P, Lindskog C, Mardinoglu A, Ponten F. A pathology atlas of the human cancer transcriptome. Science. 2017;357(6352):eaan2507. 28818916 10.1126/science.aan2507 22. Wang Y Wei Z Pan K Li J Chen Q The function and mechanism of ferroptosis in cancer Apoptosis 2020 25 11–12 786 98 10.1007/s10495-020-01638-w 32944829 Wang Y, Wei Z, Pan K, Li J, Chen Q. The function and mechanism of ferroptosis in cancer. Apoptosis. 2020;25(11–12):786–98. 10.1007/s10495-020-01638-w. 32944829 10.1007/s10495-020-01638-w 23. Zhu Y Yang J Xu D Gao XM Zhang Z Hsu JL Li CW Lim SO Sheng YY Zhang Y Li JH Luo Q Zheng Y Zhao Y Lu L Jia HL Hung MC Dong QZ Qin LX Disruption of tumour-associated macrophage trafficking by the osteopontin-induced colony-stimulating factor-1 signalling sensitises hepatocellular carcinoma to anti-PD-L1 Blockade Gut 2019 68 9 1653 66 10.1136/gutjnl-2019-318419 30902885 Zhu Y, Yang J, Xu D, Gao XM, Zhang Z, Hsu JL, Li CW, Lim SO, Sheng YY, Zhang Y, Li JH, Luo Q, Zheng Y, Zhao Y, Lu L, Jia HL, Hung MC, Dong QZ, Qin LX. Disruption of tumour-associated macrophage trafficking by the osteopontin-induced colony-stimulating factor-1 signalling sensitises hepatocellular carcinoma to anti-PD-L1 Blockade. Gut. 2019;68(9):1653–66. 10.1136/gutjnl-2019-318419. 30902885 10.1136/gutjnl-2019-318419 24. Fang W Zhou T Shi H Yao M Zhang D Qian H Zeng Q Wang Y Jin F Chai C Chen T Progranulin induces immune escape in breast cancer via up-regulating PD-L1 expression on tumor-associated macrophages (TAMs) and promoting CD8 + T cell exclusion J Exp Clin Cancer Res 2021 40 1 4 10.1186/s13046-020-01786-6 33390170 PMC7780622 Fang W, Zhou T, Shi H, Yao M, Zhang D, Qian H, Zeng Q, Wang Y, Jin F, Chai C, Chen T. Progranulin induces immune escape in breast cancer via up-regulating PD-L1 expression on tumor-associated macrophages (TAMs) and promoting CD8 + T cell exclusion. J Exp Clin Cancer Res. 2021;40(1):4. 10.1186/s13046-020-01786-6. 33390170 10.1186/s13046-020-01786-6 PMC7780622 25. Rosenzweig N Dvir-Szternfeld R Tsitsou-Kampeli A Keren-Shaul H Ben-Yehuda H Weill-Raynal P Cahalon L Kertser A Baruch K Amit I Weiner A Schwartz M PD-1/PD-L1 checkpoint Blockade harnesses monocyte-derived macrophages to combat cognitive impairment in a tauopathy mouse model Nat Commun 2019 10 1 465 10.1038/s41467-019-08352-5 30692527 PMC6349941 Rosenzweig N, Dvir-Szternfeld R, Tsitsou-Kampeli A, Keren-Shaul H, Ben-Yehuda H, Weill-Raynal P, Cahalon L, Kertser A, Baruch K, Amit I, Weiner A, Schwartz M. PD-1/PD-L1 checkpoint Blockade harnesses monocyte-derived macrophages to combat cognitive impairment in a tauopathy mouse model. Nat Commun. 2019;10(1):465. 10.1038/s41467-019-08352-5. 30692527 10.1038/s41467-019-08352-5 PMC6349941 26. Kim JM Chen DS Immune escape to PD-L1/PD-1 blockade: seven steps to success (or failure) Ann Oncol 2016 27 8 1492 504 10.1093/annonc/mdw217 27207108 Kim JM, Chen DS. Immune escape to PD-L1/PD-1 blockade: seven steps to success (or failure). Ann Oncol. 2016;27(8):1492–504. 10.1093/annonc/mdw217. 27207108 10.1093/annonc/mdw217 27. Zhou X Zou L Liao H Luo J Yang T Wu J Chen W Wu K Cen S Lv D Shu F Yang Y Li C Li B Mao X Abrogation of HnRNP L enhances anti-PD-1 therapy efficacy via diminishing PD-L1 and promoting CD8 + T cell-mediated ferroptosis in castration-resistant prostate cancer Acta Pharm Sin B 2022 12 2 692 707 10.1016/j.apsb.2021.07.016 35256940 PMC8897216 Zhou X, Zou L, Liao H, Luo J, Yang T, Wu J, Chen W, Wu K, Cen S, Lv D, Shu F, Yang Y, Li C, Li B, Mao X. Abrogation of HnRNP L enhances anti-PD-1 therapy efficacy via diminishing PD-L1 and promoting CD8 + T cell-mediated ferroptosis in castration-resistant prostate cancer. Acta Pharm Sin B. 2022;12(2):692–707. 10.1016/j.apsb.2021.07.016. 35256940 10.1016/j.apsb.2021.07.016 PMC8897216 28. Liao P, Wang W, Wang W, Kryczek I, Li X, Bian Y, Sell A, Wei S, Grove S, Johnson JK, Kennedy PD, Gijón M, Shah YM, Zou W. CD8 + T cells and fatty acids orchestrate tumor ferroptosis and immunity via ACSL4. Cancer Cell. 2022.15:S1535-6108(22)00036-8. 10.1016/j.ccell.2022.02.003 10.1016/j.ccell.2022.02.003 PMC9007863 35216678 29. Yang Z Li C Yan C Li J Yan M Liu B Zhu Z Wu Y Gu Q KIF14 promotes tumor progression and metastasis and is an independent predictor of poor prognosis in human gastric cancer Biochim Biophys Acta Mol Basis Dis 2019 1865 1 181 92 10.1016/j.bbadis.2018.10.039 30404039 Yang Z, Li C, Yan C, Li J, Yan M, Liu B, Zhu Z, Wu Y, Gu Q. KIF14 promotes tumor progression and metastasis and is an independent predictor of poor prognosis in human gastric cancer. Biochim Biophys Acta Mol Basis Dis. 2019;1865(1):181–92. 10.1016/j.bbadis.2018.10.039. 30404039 10.1016/j.bbadis.2018.10.039 30. Ling B Liao X Huang Y Liang L Jiang Y Pang Y Qi G Identification of prognostic markers of lung cancer through bioinformatics analysis and in vitro experiments Int J Oncol 2020 56 1 193 205 10.3892/ijo.2019.4926 31789390 PMC6910184 Ling B, Liao X, Huang Y, Liang L, Jiang Y, Pang Y, Qi G. Identification of prognostic markers of lung cancer through bioinformatics analysis and in vitro experiments. Int J Oncol. 2020;56(1):193–205. 10.3892/ijo.2019.4926. 31789390 10.3892/ijo.2019.4926 PMC6910184 31. Corson TW Zhu CQ Lau SK Shepherd FA Tsao MS Gallie BL KIF14 messenger RNA expression is independently prognostic for outcome in lung cancer Clin Cancer Res 2007 13 11 3229 34 10.1158/1078-0432.CCR-07-0393 17545527 Corson TW, Zhu CQ, Lau SK, Shepherd FA, Tsao MS, Gallie BL. KIF14 messenger RNA expression is independently prognostic for outcome in lung cancer. Clin Cancer Res. 2007;13(11):3229–34. 10.1158/1078-0432.CCR-07-0393. 17545527 10.1158/1078-0432.CCR-07-0393 32. Wang ZZ Yang J Jiang BH Di JB Gao P Peng L Su XQ KIF14 promotes cell proliferation via activation of Akt and is directly targeted by miR-200c in colorectal cancer Int J Oncol 2018 53 5 1939 52 10.3892/ijo.2018.4546 30226594 PMC6192758 Wang ZZ, Yang J, Jiang BH, Di JB, Gao P, Peng L, Su XQ. KIF14 promotes cell proliferation via activation of Akt and is directly targeted by miR-200c in colorectal cancer. Int J Oncol. 2018;53(5):1939–52. 10.3892/ijo.2018.4546. 30226594 10.3892/ijo.2018.4546 PMC6192758 33. Cheng C Wu X Shen Y Li Q KIF14 and KIF23 promote cell proliferation and chemoresistance in HCC cells, and predict worse prognosis of patients with HCC Cancer Manag Res 2020 12 13241 57 10.2147/CMAR.S285367 33380832 PMC7767722 Cheng C, Wu X, Shen Y, Li Q. KIF14 and KIF23 promote cell proliferation and chemoresistance in HCC cells, and predict worse prognosis of patients with HCC. Cancer Manag Res. 2020;12:13241–57. 10.2147/CMAR.S285367. 33380832 10.2147/CMAR.S285367 PMC7767722 34. Ye H Ding X Lv X Du Y Guo R Qiu J Li R Cao L KLF14 directly downregulates the expression of GPX4 to exert antitumor effects by promoting ferroptosis in cervical cancer J Transl Med 2024 22 1 923 10.1186/s12967-024-05714-6 39390559 PMC11465826 Ye H, Ding X, Lv X, Du Y, Guo R, Qiu J, Li R, Cao L. KLF14 directly downregulates the expression of GPX4 to exert antitumor effects by promoting ferroptosis in cervical cancer. J Transl Med. 2024;22(1):923. 10.1186/s12967-024-05714-6. 39390559 10.1186/s12967-024-05714-6 PMC11465826 35. Xu H Choe C Shin SH Park SW Kim HS Jung SH Yim SH Kim TM Chung YJ Silencing of KIF14 interferes with cell cycle progression and cytokinesis by blocking the p27(Kip1) ubiquitination pathway in hepatocellular carcinoma Exp Mol Med 2014 46 5 e97 10.1038/emm.2014.23 24854087 PMC4044675 Xu H, Choe C, Shin SH, Park SW, Kim HS, Jung SH, Yim SH, Kim TM, Chung YJ. Silencing of KIF14 interferes with cell cycle progression and cytokinesis by blocking the p27(Kip1) ubiquitination pathway in hepatocellular carcinoma. Exp Mol Med. 2014;46(5):e97. 10.1038/emm.2014.23. 24854087 10.1038/emm.2014.23 PMC4044675 36. Jiang W Wang J Yang X Shan J Zhang Y Shi X Wang Y Chenyan A Chang J Wang Y Yu Y Li C Li X KIF14 promotes proliferation, lymphatic metastasis and chemoresistance through G3BP1/YBX1 mediated NF-κB pathway in cholangiocarcinoma Oncogene 2023 42 17 1392 404 10.1038/s41388-023-02661-2 36922675 Jiang W, Wang J, Yang X, Shan J, Zhang Y, Shi X, Wang Y, Chenyan A, Chang J, Wang Y, Yu Y, Li C, Li X. KIF14 promotes proliferation, lymphatic metastasis and chemoresistance through G3BP1/YBX1 mediated NF-κB pathway in cholangiocarcinoma. Oncogene. 2023;42(17):1392–404. 10.1038/s41388-023-02661-2. 36922675 10.1038/s41388-023-02661-2 37. Singel SM Cornelius C Zaganjor E Batten K Sarode VR Buckley DL Peng Y John GB Li HC Sadeghi N Wright WE Lum L Corson TW Shay JW KIF14 promotes AKT phosphorylation and contributes to chemoresistance in triple-negative breast cancer Neoplasia 2014 16 3 247 56 10.1016/j.neo.2014.03.008 24784001 PMC4094827 Singel SM, Cornelius C, Zaganjor E, Batten K, Sarode VR, Buckley DL, Peng Y, John GB, Li HC, Sadeghi N, Wright WE, Lum L, Corson TW, Shay JW. KIF14 promotes AKT phosphorylation and contributes to chemoresistance in triple-negative breast cancer. Neoplasia. 2014;16(3):247–56. 10.1016/j.neo.2014.03.008. 256.e2. 24784001 10.1016/j.neo.2014.03.008 PMC4094827 ",
  "metadata": {
    "Title of this paper": "KIF14 promotes AKT phosphorylation and contributes to chemoresistance in triple-negative breast cancer",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484527/"
  }
}