{
  "title": "Paper_1231",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472077 PMC12472077.1 12472077 12472077 41011327 10.3390/microorganisms13091995 microorganisms-13-01995 1 Review Exploring the Microbiome in Breast Cancer: The Role of Fusobacterium nucleatum D’Angelo Alessandra 1 Zenoniani Anna 1 Masci Martina 1 https://orcid.org/0000-0002-6845-1321 Aceto Gitana Maria 2 Piattelli Adriano 3 4 https://orcid.org/0000-0003-4979-887X Curia Maria Cristina 1 * Suzuki Haruo Academic Editor 1 alessandra.dangelo@unich.it anna.zenoniani@studenti.unich.it martina.masci002@studenti.unich.it 2 gitana.aceto@unich.it 3 apiattelli51@gmail.com 4 * mariacristina.curia@unich.it 27 8 2025 9 2025 13 9 496716 1995 10 6 2025 26 7 2025 21 8 2025 27 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The breast microbiome remains stable throughout a woman’s life. The breast is not a sterile organ, and its microbiota exhibits a distinct composition compared to other body sites. The breast microbiome is a community characterized by an abundance of Proteobacteria Firmicutes Fusobacterium nucleatum F. nucleatum F. nucleatum F. nucleatum F. nucleatum F. nucleatum microbiome breast cancer breast milk Fusobacterium nucleatum Wnt/β-catenin immune response Fap2 FadA TIGIT estrobolome MDSC This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Breast cancer (BC) is the second cause of death related to cancer in the women worldwide [ 1 2 3 4 5 6 The intracellular tumor microbiota is a component of tumor tissue that has been documented in several types of cancer. However, its biological functions remain unclear. A potential link between the breast microbiota and maternal health, infant development, and the pathogenesis of breast cancer has been hypothesized, although this remains an emerging and underexplored area of research [ 7 8 9 10 The breast is not a sterile organ, and its microbiota exhibits a distinct composition compared to other body sites [ 11 12 13 11 14 Determined bacteria found in breast tissue were also detected in other sites of the body like Lactobacillus iners Prevotella Enterobacteriaceae Fusobacterium Streptococcus Propionibacterium Micrococcus Pseudomonas Lactobacillus Bifidobacterium Enterobacteriaceae Pseudomonas Streptococcus agalactiae 11 12 11 12 12 Proteobacteria Firmicutes 13 Figure 1 Bacterial species such as Bacillus Enterobacteriaceae Staphylococcus 12 16 17 Propionibacterium Finegoldia Granulicatella Streptococcus Anaerococcus Ruminococcaceae Corynebacterium 1 Alicyclobacillus Odoribacter Lactococcus Esherichica/Shigella 18 9 19 11 Fusobacterium nucleatum F. nucleatum Fusobacterium 20 The presence of F. nucleatum F. nucleatum 21 22 23 F. nucleatum F. nucleatum 19 24 25 26 F. nucleatum F. nucleatum 27 2 21 28 F. nucleatum 29 F. nucleatum 30 31 32 33 26 34 35 36 F. nucleatum F. nucleatum 2. Microbiota in Breast Feeding in Healthy and Inflammatory Conditions The breast microbiome plays a specific biological role rather than being a random accumulation of external microbes [ 37 38 8 Bifidobacterium Lactobacillus Streptococcus Staphylococcus 39 Figure 2 39 Proteobacteria 40 In a recent cohort study, the presence of Bifidobacterium breve 42 43 44 42 45 Notably, microbial species found in maternal feces, breast milk, and the infant gut frequently overlap, suggesting the existence of multiple transmission pathways. These include the entero-mammary route, whereby maternal gut bacteria translocate across the intestinal barrier to the mammary gland via systemic circulation and lymphatic transport [ 46 47 Faecalibacterium Roseburia Coprococcus 46 The composition of the HMM is significantly influenced by the mode of milk delivery, whether it is expressed and fed via a pump or delivered directly from the breast through breastfeeding. Direct breastfeeding facilitates dynamic microbial exchange between mother and infant, particularly through retrograde milk flow during suckling. This process appears to favor colonization by beneficial bacteria such as Bifidobacterium 48 49 Environmental factors also play a role: rural breast milk has been shown to contain greater microbial diversity than urban samples, likely due to broader environmental exposures including diet, hygiene, and contact with nature [ 50 Beyond these influences, human milk is enriched with complex carbohydrates known as human milk oligosaccharides (HMOs), which play a central role in supporting a healthy infant microbiome [ 51 Bifidobacterium 52 53 54 55 Breast dysbiosis is strongly associated with mastitis. Research by Jiménez et al. [ 56 Staphylococcus aureus Streptococcus Figure 1 57 Bifidobacterium Lactobacillus 58 Women living with autoimmune and chronic inflammatory diseases, such as inflammatory bowel disease (IBD), represent another population where the immunological and microbial composition of breast milk may be altered. Immunosuppressive therapies and systemic inflammation have the potential to modify breast milk’s bioactive profile, though data remain limited. Preliminary studies indicate that despite these alterations, breastfeeding may continue to offer immunological benefits to the infant, including the transmission of protective antibodies and immune-modulating cytokines that may partially counteract the infant’s risk of inflammatory disorders [ 59 The psychosocial state of the lactating parent is increasingly recognized as a modulator of the HMM [ 41 60 These insights collectively underscore the dynamic interplay between maternal health and the microbial constitution of human milk. Understanding the influence of inflammatory states on HMM not only aids in optimizing breastfeeding support strategies but also contributes to more targeted interventions that safeguard maternal and infant health. Looking ahead, emerging research is uncovering the complex interplay between the human milk virome and mycobiome, that is, the communities of viruses (including bacteriophages) and fungi (e.g., Malassezia Candida 61 62 48 63 3. Molecular Alterations in Breast Cancer BC has emerged as the most commonly diagnosed female neoplasm in all age groups and the leading cause of cancer death among women worldwide [ 64 65 66 67 BC is a complex molecular disease involving alterations to several cellular pathways that control cell growth and proliferation. Affected pathways include MAPK, RB/E2F, PI3K/AKT/mTOR, and TP53 [ 68 69 70 The presence of hereditary factors significantly increases the likelihood of developing BC. The risk of developing BC due to pathogenic mutations in high-penetrance genes, such as BRCA1 [OMIM 113705] and BRCA2 [OMIM 600185], has been recognized for several decades [ 71 72 73 74 75 76 77 78 79 80 81 82 83 84 In clinical settings, methods based on immunohistochemistry using four surrogate markers, estrogen receptor [ER], progesterone receptor [PR], HER2, and Ki67 are commonly used to identify BC subtypes [ 85 86 87 88 89 BC is a heterogeneous group of diseases that respond differently to various personalized treatment modalities [ 90 91 92 92 The progression of BC is determined by a number of factors, including the characteristics of tumor cells, elements of the TME (both cellular and non-cellular), and the characteristics of the surrounding tissue. Significant advances have been made in the treatment and diagnosis of primary BC in recent years [ 93 70 94 95 96 97 98 99 100 101 Recent studies suggest that exposure to environmental chemicals with endocrine-disrupting properties may increase a woman’s risk of developing BC at certain stages in her life. Significant structural and functional changes occur in the mammary gland during critical periods, including prenatal development, puberty, pregnancy, and menopause. Furthermore, alterations in the mammary microenvironment and hormone signaling can enhance BC susceptibility [ 102 103 104 105 106 4. The Microbiota in Breast Cancer Among all immunity cells, M2-like macrophages are the most present in the BC microenvironment and are related to lower survival in HR + BC patients [ 82 77 7 19 21 19 In recent years, there has been a great interest in the characterization of the microbiota of various areas of the body and under different health conditions; this is because different studies have shown that bacterial communities are different between areas of the body and that complex interactions between host and bacteria are established [ 107 108 Xuan et al. [ 11 Methylbacterium Sphingomonas Sphingomonas yanoikuyae Methylobacterium radiotolerans 109 Methylbacterium radiotolerans tissue, Sphingomonas yanoikuyae 11 11 In women with cancer, there is a higher amount of Escherichia coli 110 111 Ralstonia Propionicimonas Micrococcaceae Caulobacteraceae Rhodobacteraceae Nocardioidaceae Methylobacteriaceae 109 Bacteroidaceae Agrococcus Fusobacterium Atopobium Gluconacetobacter Hydrogenophaga Lactobacillus 112 Clostridiales 113 The evidence of a metabolically active tissue-resident microbiota is supported by the presence of bacteria correlated with the production of the metabolite trimethylamine N-oxide (TMAO), capable to stimulate antitumor immunity mediated by CD8+ T cells and M1 macrophages [ 114 The gut microbiome involved in several processes: it modulates inflammation and influences cell genomic stability through the dysregulation of different pathways, but it is also linked to the progression of cancer by acting on estrogens metabolism through enterohepatic circulation [ 115 11 116 The associations between BC and estrogen levels could reflect differences within people’s intestinal microbial communities [ 117 118 119 The so-called “estrobolome”, comprised of enteric bacterial genes that produce estrogen and its metabolites, was extensively discussed by Plottel and Blaser [ 120 119 121 115 Clostridia Ruminococcaceae 115 122 The Firmicutes Clostridium leptum Clostridium coccoides Escherichia/Shigella Proteobacteria 123 120 124 125 125 Clostridiaceae Faecalibacterium Ruminococcaceae Dorea Lachnospiraceae 126 It is interesting to note that bacteria like Listeria fleischmannii Haemophilus influenza Escherichia coli Staphylococcus Bacterioides fragilis 7 In their research, Urbaniak et al. examined breast tissue collected from different parts of the breast in women aged 18 to 90, with or without cancer, and some subjects did not have a history of lactation. The population of bacteria was found to be diverse, but Proteobacteria 12 From the analogy of normal adjacent tissue of BC woman and tissue of non-cancer women was found a significant increase of Prevotella Lactococcus Streptococcus Corynebacterium Micrococcus Bacillus Staphylococcus Enterobacteriaceae Comamondaceae Bacteroidetes 127 These bacteria can cause damage to DNA in vitro. Intestinal bacteria such as Staphylococcus Enterobacteriaceae Staphylococci 128 Staphylococcus Enterobacteriaceae 129 130 In addition, a reduction in some lactic acid bacteria was detected, which are well known for their beneficial health results, like anti-carcinogenic qualities [ 127 14 The Cancer Genome Atlas provided Thompson and co-workers [ 131 Proteobacteria Proteobacteria 107 132 133 134 Actinobacteria Firmicutes 19 7 Mycobacterium fortuitum Mycobacterium phlei Proteobacteri Actinobacteria 131 A significant number of viruses have been found in breast tumor tissue and/or TME, along with bacteria, parasites, and fungi. Certain authors have suggested that some of these viral signatures could be linked to specific breast cancer subtypes [ 135 According to Banerjee and co-workers, an analysis of 100 TNBC samples revealed predominant viral, bacterial, fungal, and parasitic genomic sequence signatures. Actinomycetaceae Caulobacteriaceae Sphingobacteriaceae Enterobacteriaceae Prevotellaceae Brucellaceae Bacillaceae Peptostreptococcaceae, Flavobacteriaceae 136 Parhi et al., in an in vitro and in vivo study, definitely demonstrated that among all bacteria, F. nucleatum 23 5. Fusobacterium nucleatum F. nucleatum 137 138 139 140 141 142 143 144 145 30 31 32 33 146 23 147 148 149 150 151 152 In the colon model, it has been hypothesized that the F. nucleatum 153 Fusobacteria F. nucleatum F. nucleatum 154 155 F. nucleatum 153 F. nucleatum F. nucleatum F. nucleatum 19 156 157 F. nucleatum 23 There are three possible routes through which F. nucleatum 158 F. nucleatum, F. nucleatum 159 F. nucleatum 19 F. nucleatum F. nucleatum 19 F. nucleatum 26 121 158 160 F. nucleatum Figure 3 30 31 F. nucleatum F. nucleatum 161 F. nucleatum 158 F. nucleatum 22 In addition to contributing to carcinogenesis by activating the oncogenetic pathways described above, F. nucleatum F. nucleatum F. nucleatum 36 Figure 3 Another way by which F. nucleatum inhibits T-cell function is through the recruitment of MDSCs [ 22 In addition, MYC upregulation by F. nucleatum 162 F. nucleatum 22 Furthermore, F. nucleatum 36 Figure 3 Fusobacterium 36 F. nucleatum In BC tissues, TIGIT and CEACAM1 expressions are upregulated and downregulated, respectively [ 163 164 138 163 In BC, F. nucleatum 165 165 166 F. nucleatum 26 F. nucleatum Recently, an in vitro and in vivo study removed intratumoral F. nucleatum 29 F. nucleatum F. nucleatum 6. Conclusions and Future Perspectives F. nucleatum In conclusion, F. nucleatum Considering these results, which demonstrate the presence of F. nucleatum F. nucleatum The experimental therapeutic use of antibodies against TIGIT and CTLA-4 receptors has not given good results, while the use of PD-L1 and CD-47 antagonists might also be more effective in combination with the eradication of F. nucleatum. Therefore, further investigation of the biology of F. nucleatum Disclaimer/Publisher’s Note: Author Contributions Conceptualization and supervision, M.C.C.; methodology, A.Z. and M.M.; investigation, A.P.; writing—review and editing, A.D., G.M.A., and M.C.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest. References 1. Menon G. Alkabban F.M. Ferguson T. Breast Cancer StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 29493913 2. Fu A. Yao B. Dong T. Chen Y. Yao J. Liu Y. Li H. Bai H. Liu X. Zhang Y. Tumor-resident intracellular microbiota promotes metastatic colonization in breast cancer Cell 2022 185 1356 1372.E26 10.1016/j.cell.2022.02.027 35395179 3. Dethlefsen L. McFall-Ngai M. Relman D.A. An ecological and evolutionary perspective on human-microbe mutualism and disease Nature 2007 449 811 818 10.1038/nature06245 17943117 PMC9464033 4. Willing B.P. Russell S.L. Finlay B.B. Shifting the balance: Antibiotic effects on host-microbiota mutualism Nat. Rev. Microbiol. 2011 9 233 243 10.1038/nrmicro2536 21358670 5. Arendt L.M. McCready J. Keller P.J. Baker D.D. Naber S.P. Seewaldt V. Kuperwasser C. Obesity promotes breast cancer by CCL2-mediated macrophage recruitment and angiogenesis Cancer Res. 2013 73 6080 6093 10.1158/0008-5472.CAN-13-0926 23959857 PMC3824388 6. Buchta Rosean C. Bostic R.R. Ferey J.C.M. Feng T.Y. Azar F.N. Tung K.S. Dozmorov M.G. Smirnova E. Bos P.D. Rutkowski M.R. Preexisting Commensal Dysbiosis Is a Host-Intrinsic Regulator of Tissue Inflammation and Tumor Cell Dissemination in Hormone Receptor-Positive Breast Cancer Cancer Res. 2019 79 3662 3675 10.1158/0008-5472.CAN-18-3464 31064848 PMC6983951 7. Urbaniak C. Gloor G.B. Brackstone M. Scott L. Tangney M. Reid G. The Microbiota of Breast Tissue and Its Association with Breast Cancer Appl. Environ. Microbiol. 2016 82 5039 5048 10.1128/AEM.01235-16 27342554 PMC4968547 8. Fernandez L. Langa S. Martin V. Maldonado A. Jimenez E. Martin R. Rodriguez J.M. The human milk microbiota: Origin and potential roles in health and disease Pharmacol. Res. 2013 69 1 10 10.1016/j.phrs.2012.09.001 22974824 9. Chiba A. Bawaneh A. Velazquez C. Clear K.Y.J. Wilson A.S. Howard-McNatt M. Levine E.A. Levi-Polyachenko N. Yates-Alston S.A. Diggle S.P. Neoadjuvant Chemotherapy Shifts Breast Tumor Microbiota Populations to Regulate Drug Responsiveness and the Development of Metastasis Mol. Cancer Res. 2020 18 130 139 10.1158/1541-7786.MCR-19-0451 31628201 PMC9153322 10. Nandi D. Parida S. Sharma D. The gut microbiota in breast cancer development and treatment: The good, the bad, and the useful! Gut Microbes 2023 15 2221452 10.1080/19490976.2023.2221452 37305949 PMC10262790 11. Xuan C. Shamonki J.M. Chung A. Dinome M.L. Chung M. Sieling P.A. Lee D.J. Microbial dysbiosis is associated with human breast cancer PLoS ONE 2014 9 e83744 10.1371/journal.pone.0083744 24421902 PMC3885448 12. Urbaniak C. Cummins J. Brackstone M. Macklaim J.M. Gloor G.B. Baban C.K. Scott L. O’Hanlon D.M. Burton J.P. Francis K.P. Microbiota of human breast tissue Appl. Environ. Microbiol. 2014 80 3007 3014 10.1128/AEM.00242-14 24610844 PMC4018903 13. O’Connor H. MacSharry J. Bueso Y.F. Lindsay S. Kavanagh E.L. Tangney M. Clyne M. Saldova R. McCann A. Resident bacteria in breast cancer tissue: Pathogenic agents or harmless commensals? Discov. Med. 2018 26 93 102 30399327 14. Zhang J. Xia Y. Sun J. Breast and gut microbiome in health and cancer Genes. Dis. 2021 8 581 589 10.1016/j.gendis.2020.08.002 34291130 PMC8278537 15. Zhao C. Hu X. Bao L. Wu K. Zhao Y. Xiang K. Li S. Wang Y. Qiu M. Feng L. Gut dysbiosis induces the development of mastitis through a reduction in host anti-inflammatory enzyme activity by endotoxemia Microbiome 2022 10 205 10.1186/s40168-022-01402-z 36451232 PMC9714159 16. Smith A. Pierre J.F. Makowski L. Tolley E. Lyn-Cook B. Lu L. Vidal G. Starlard-Davenport A. Distinct microbial communities that differ by race, stage, or breast-tumor subtype in breast tissues of non-Hispanic Black and non-Hispanic White women Sci. Rep. 2019 9 11940 10.1038/s41598-019-48348-1 31420578 PMC6697683 17. Yatsunenko T. Rey F.E. Manary M.J. Trehan I. Dominguez-Bello M.G. Contreras M. Magris M. Hidalgo G. Baldassano R.N. Anokhin A.P. Human gut microbiome viewed across age and geography Nature 2012 486 222 227 10.1038/nature11053 22699611 PMC3376388 18. Tzeng A. Sangwan N. Jia M. Liu C.C. Keslar K.S. Downs-Kelly E. Fairchild R.L. Al-Hilli Z. Grobmyer S.R. Eng C. Human breast microbiome correlates with prognostic features and immunological signatures in breast cancer Genome Med. 2021 13 60 10.1186/s13073-021-00874-2 33863341 PMC8052771 19. Hieken T.J. Chen J. Hoskin T.L. Walther-Antonio M. Johnson S. Ramaker S. Xiao J. Radisky D.C. Knutson K.L. Kalari K.R. The Microbiome of Aseptically Collected Human Breast Tissue in Benign and Malignant Disease Sci. Rep. 2016 6 30751 10.1038/srep30751 27485780 PMC4971513 20. Chen Y. Huang Z. Tang Z. Huang Y. Huang M. Liu H. Ziebolz D. Schmalz G. Jia B. Zhao J. More Than Just a Periodontal Pathogen -the Research Progress on Fusobacterium nucleatum Front. Cell Infect. Microbiol. 2022 12 815318 10.3389/fcimb.2022.815318 35186795 PMC8851061 21. Nejman D. Livyatan I. Fuks G. Gavert N. Zwang Y. Geller L.T. Rotter-Maskowitz A. Weiser R. Mallel G. Gigi E. The human tumor microbiome is composed of tumor type-specific intracellular bacteria Science 2020 368 973 980 10.1126/science.aay9189 32467386 PMC7757858 22. Van der Merwe M. Van Niekerk G. Botha A. Engelbrecht A.M. The onco-immunological implications of Fusobacterium nucleatum in breast cancer Immunol. Lett. 2021 232 60 66 10.1016/j.imlet.2021.02.007 33647328 23. Parhi L. Alon-Maimon T. Sol A. Nejman D. Shhadeh A. Fainsod-Levi T. Yajuk O. Isaacson B. Abed J. Maalouf N. Breast cancer colonization by Fusobacterium nucleatum accelerates tumor growth and metastatic progression Nat. Commun. 2020 11 3259 10.1038/s41467-020-16967-2 32591509 PMC7320135 24. Gaba F.I. Gonzalez R.C. Martinez R.G. The Role of Oral Fusobacterium nucleatum in Female Breast Cancer: A Systematic Review and Meta-Analysis Int. J. Dent. 2022 2022 1876275 10.1155/2022/1876275 36466367 PMC9711985 25. Eslami S.Z. Majidzadeh A.K. Halvaei S. Babapirali F. Esmaeili R. Microbiome and Breast Cancer: New Role for an Ancient Population Front. Oncol. 2020 10 120 10.3389/fonc.2020.00120 32117767 PMC7028701 26. Guo J. Zhu P. Li J. Xu L. Tang Y. Liu X. Guo S. Xia J. Fusobacterium nucleatum promotes PD-L1 expression in cancer cells to evade CD8(+) T cell killing in breast cancer Hum. Immunol. 2024 85 111168 10.1016/j.humimm.2024.111168 39504687 27. Wei M.Q. Ellem K.A. Dunn P. West M.J. Bai C.X. Vogelstein B. Facultative or obligate anaerobic bacteria have the potential for multimodality therapy of solid tumours Eur. J. Cancer 2007 43 490 496 10.1016/j.ejca.2006.10.005 17113280 28. Riquelme E. Zhang Y. Zhang L. Montiel M. Zoltan M. Dong W. Quesada P. Sahin I. Chandra V. San Lucas A. Tumor Microbiome Diversity and Composition Influence Pancreatic Cancer Outcomes Cell 2019 178 795 806.E12 10.1016/j.cell.2019.07.008 31398337 PMC7288240 29. Geng S. Guo P. Li X. Shi Y. Wang J. Cao M. Zhang Y. Zhang K. Li A. Song H. Biomimetic Nanovehicle-Enabled Targeted Depletion of Intratumoral Fusobacterium nucleatum Synergizes with PD-L1 Blockade against Breast Cancer ACS Nano 2024 18 8971 8987 10.1021/acsnano.3c12687 38497600 30. Rubinstein M.R. Wang X. Liu W. Hao Y. Cai G. Han Y.W. Fusobacterium nucleatum promotes colorectal carcinogenesis by modulating E-cadherin/beta-catenin signaling via its FadA adhesin Cell Host Microbe 2013 14 195 206 10.1016/j.chom.2013.07.012 23954158 PMC3770529 31. Rubinstein M.R. Baik J.E. Lagana S.M. Han R.P. Raab W.J. Sahoo D. Dalerba P. Wang T.C. Han Y.W. Fusobacterium nucleatum promotes colorectal cancer by inducing Wnt/beta-catenin modulator Annexin A1 EMBO Rep. 2019 20 e47638 10.15252/embr.201847638 30833345 PMC6446206 32. Castellarin M. Warren R.L. Freeman J.D. Dreolini L. Krzywinski M. Strauss J. Barnes R. Watson P. Allen-Vercoe E. Moore R.A. Fusobacterium nucleatum infection is prevalent in human colorectal carcinoma Genome Res. 2012 22 299 306 10.1101/gr.126516.111 22009989 PMC3266037 33. Kostic A.D. Gevers D. Pedamallu C.S. Michaud M. Duke F. Earl A.M. Ojesina A.I. Jung J. Bass A.J. Tabernero J. Genomic analysis identifies association of Fusobacterium with colorectal carcinoma Genome Res. 2012 22 292 298 10.1101/gr.126573.111 22009990 PMC3266036 34. Gur C. Ibrahim Y. Isaacson B. Yamin R. Abed J. Gamliel M. Enk J. Bar-On Y. Stanietsky-Kaynan N. Coppenhagen-Glazer S. Binding of the Fap2 protein of Fusobacterium nucleatum to human inhibitory receptor TIGIT protects tumors from immune cell attack Immunity 2015 42 344 355 10.1016/j.immuni.2015.01.010 25680274 PMC4361732 35. Little A. Tangney M. Tunney M.M. Buckley N.E. Fusobacterium nucleatum: A novel immune modulator in breast cancer? Expert. Rev. Mol. Med. 2023 25 e15 10.1017/erm.2023.9 37009688 PMC10407221 36. Gur C. Maalouf N. Shhadeh A. Berhani O. Singer B.B. Bachrach G. Mandelboim O. Fusobacterium nucleatum supresses anti-tumor immunity by activating CEACAM1 Oncoimmunology 2019 8 e1581531 10.1080/2162402X.2019.1581531 31069151 PMC6492956 37. Fitzstevens J.L. Smith K.C. Hagadorn J.I. Caimano M.J. Matson A.P. Brownell E.A. Systematic Review of the Human Milk Microbiota Nutr. Clin. Pract. 2017 32 354 364 10.1177/0884533616670150 27679525 38. Pannaraj P.S. Li F. Cerini C. Bender J.M. Yang S. Rollie A. Adisetiyo H. Zabih S. Lincez P.J. Bittinger K. Association Between Breast Milk Bacterial Communities and Establishment and Development of the Infant Gut Microbiome JAMA Pediatr. 2017 171 647 654 10.1001/jamapediatrics.2017.0378 28492938 PMC5710346 39. Gomez-Gallego C. Garcia-Mantrana I. Salminen S. Collado M.C. The human milk microbiome and factors influencing its composition and activity Semin. Fetal Neonatal Med. 2016 21 400 405 10.1016/j.siny.2016.05.003 27286644 40. Ward T.L. Hosid S. Ioshikhes I. Altosaar I. Human milk metagenome: A functional capacity analysis BMC Microbiol. 2013 13 116 10.1186/1471-2180-13-116 23705844 PMC3679945 41. Moossavi S. Sepehri S. Robertson B. Bode L. Goruk S. Field C.J. Lix L.M. de Souza R.J. Becker A.B. Mandhane P.J. Composition and Variation of the Human Milk Microbiota Are Influenced by Maternal and Early-Life Factors Cell Host Microbe 2019 25 324 335.E4 10.1016/j.chom.2019.01.011 30763539 42. Makino H. Kushiro A. Ishikawa E. Muylaert D. Kubota H. Sakai T. Oishi K. Martin R. Ben Amor K. Oozeer R. Transmission of intestinal Bifidobacterium longum subsp. longum strains from mother to infant, determined by multilocus sequencing typing and amplified fragment length polymorphism Appl. Environ. Microbiol. 2011 77 6788 6793 10.1128/AEM.05346-11 21821739 PMC3187114 43. Boix-Amoros A. Collado M.C. Mira A. Relationship between Milk Microbiota, Bacterial Load, Macronutrients, and Human Cells during Lactation Front. Microbiol. 2016 7 492 10.3389/fmicb.2016.00492 27148183 PMC4837678 44. Milani C. Duranti S. Bottacini F. Casey E. Turroni F. Mahony J. Belzer C. Delgado Palacio S. Arboleya Montes S. Mancabelli L. The First Microbial Colonizers of the Human Gut: Composition, Activities, and Health Implications of the Infant Gut Microbiota Microbiol. Mol. Biol. Rev. 2017 81 10.1128/MMBR.00036-17 PMC5706746 29118049 45. Kalbermatter C. Fernandez Trigo N. Christensen S. Ganal-Vonarburg S.C. Maternal Microbiota, Early Life Colonization and Breast Milk Drive Immune Development in the Newborn Front. Immunol. 2021 12 683022 10.3389/fimmu.2021.683022 34054875 PMC8158941 46. Arrieta M.C. Stiemsma L.T. Amenyogbe N. Brown E.M. Finlay B. The intestinal microbiome in early life: Health and disease Front. Immunol. 2014 5 427 10.3389/fimmu.2014.00427 25250028 PMC4155789 47. Ferretti P. Pasolli E. Tett A. Asnicar F. Gorfer V. Fedi S. Armanini F. Truong D.T. Manara S. Zolfo M. Mother-to-Infant Microbial Transmission from Different Body Sites Shapes the Developing Infant Gut Microbiome Cell Host Microbe 2018 24 133 145.E5 10.1016/j.chom.2018.06.005 30001516 PMC6716579 48. Notarbartolo V. Giuffre M. Montante C. Corsello G. Carta M. Composition of Human Breast Milk Microbiota and Its Role in Children’s Health Pediatr. Gastroenterol. Hepatol. Nutr. 2022 25 194 210 10.5223/pghn.2022.25.3.194 35611376 PMC9110848 49. Tsuji H. Oozeer R. Matsuda K. Matsuki T. Ohta T. Nomoto K. Tanaka R. Kawashima M. Kawashima K. Nagata S. Molecular monitoring of the development of intestinal microbiota in Japanese infants Benef. Microbes 2012 3 113 125 10.3920/BM2011.0038 22683836 50. Kumar H. du Toit E. Kulkarni A. Aakko J. Linderborg K.M. Zhang Y. Nicol M.P. Isolauri E. Yang B. Collado M.C. Distinct Patterns in Human Milk Microbiota and Fatty Acid Profiles Across Specific Geographic Locations Front. Microbiol. 2016 7 1619 10.3389/fmicb.2016.01619 27790209 PMC5061857 51. Walsh C. Lane J.A. van Sinderen D. Hickey R.M. Human milk oligosaccharides: Shaping the infant gut microbiota and supporting health J. Funct. Foods 2020 72 104074 10.1016/j.jff.2020.104074 32834834 PMC7332462 52. Masi A.C. Stewart C.J. Untangling human milk oligosaccharides and infant gut microbiome iScience 2022 25 103542 10.1016/j.isci.2021.103542 34950861 PMC8671521 53. Plaza-Diaz J. Fontana L. Gil A. Human Milk Oligosaccharides and Immune System Development Nutrients 2018 10 1038 10.3390/nu10081038 30096792 PMC6116142 54. Kirmiz N. Robinson R.C. Shah I.M. Barile D. Mills D.A. Milk Glycans and Their Interaction with the Infant-Gut Microbiota Annu. Rev. Food Sci. Technol. 2018 9 429 450 10.1146/annurev-food-030216-030207 29580136 PMC5999319 55. Azad M.B. Konya T. Guttman D.S. Field C.J. Sears M.R. HayGlass K.T. Mandhane P.J. Turvey S.E. Subbarao P. Becker A.B. Infant gut microbiota and food sensitization: Associations in the first year of life Clin. Exp. Allergy 2015 45 632 643 10.1111/cea.12487 25599982 56. Jimenez E. Fernandez L. Marin M.L. Martin R. Odriozola J.M. Nueno-Palop C. Narbad A. Olivares M. Xaus J. Rodriguez J.M. Isolation of commensal bacteria from umbilical cord blood of healthy neonates born by cesarean section Curr. Microbiol. 2005 51 270 274 10.1007/s00284-005-0020-3 16187156 57. Collado M.C. Rautava S. Aakko J. Isolauri E. Salminen S. Human gut colonisation may be initiated in utero by distinct microbial communities in the placenta and amniotic fluid Sci. Rep. 2016 6 23129 10.1038/srep23129 27001291 PMC4802384 58. Davis E.C. Monaco C.L. Insel R. Jarvinen K.M. Gut microbiome in the first 1000 days and risk for childhood food allergy Ann. Allergy Asthma Immunol. 2024 133 252 261 10.1016/j.anai.2024.03.010 38494114 PMC11344696 59. Forbes J.D. Chen C.Y. Knox N.C. Marrie R.A. El-Gabalawy H. de Kievit T. Alfa M. Bernstein C.N. Van Domselaar G. A comparative study of the gut microbiota in immune-mediated inflammatory diseases-does a common dysbiosis exist? Microbiome 2018 6 221 10.1186/s40168-018-0603-4 30545401 PMC6292067 60. Rodriguez J.M. Fernandez L. Verhasselt V. The Gut–Breast Axis: Programming Health for Life Nutrients 2021 13 606 10.3390/nu13020606 33673254 PMC7917897 61. Sun H. Finlay B. Azad M.B. Cuomo C.A. Cowen L.E. Berdy B. Livny J. Shea T. Aquino E.E. Godoy-Vitorino F. The human milk bacteriome and mycobiome and their inter-kingdom interactions viewed across geography Front. Nutr. 2025 12 1610346 10.3389/fnut.2025.1610346 40693205 PMC12277152 62. Consales A. Cerasani J. Sorrentino G. Morniroli D. Colombo L. Mosca F. Gianni M.L. The hidden universe of human milk microbiome: Origin, composition, determinants, role, and future perspectives Eur. J. Pediatr. 2022 181 1811 1820 10.1007/s00431-022-04383-1 35124754 PMC9056486 63. Mahmud M.R. Tamanna S.K. Akter S. Mazumder L. Akter S. Hasan M.R. Acharjee M. Esti I.Z. Islam M.S. Shihab M.M.R. Role of bacteriophages in shaping gut microbial community Gut Microbes 2024 16 2390720 10.1080/19490976.2024.2390720 39167701 PMC11340752 64. Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Bray F. Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J. Clin. 2021 71 209 249 10.3322/caac.21660 33538338 65. Friebel T.M. Domchek S.M. Rebbeck T.R. Modifiers of cancer risk in BRCA1 and BRCA2 mutation carriers: Systematic review and meta-analysis J. Natl. Cancer Inst. 2014 106 dju091 10.1093/jnci/dju091 24824314 PMC4081625 66. Mavaddat N. Frost D. Zhao E. Barnes D.R. Ahmed M. Barwell J. Brady A.F. Brennan P. Conti H. Cook J. Distribution of age at natural menopause, age at menarche, menstrual cycle length, height and BMI in BRCA1 and BRCA2 pathogenic variant carriers and non-carriers: Results from EMBRACE Breast Cancer Res. 2025 27 87 10.1186/s13058-025-02030-9 40399999 PMC12093752 67. Aceto G.M. Awadelkarim K.D. Di Nicola M. Moscatello C. Pantalone M.R. Verginelli F. Elwali N.E. Mariani-Costantini R. Germline TP53 mutation spectrum in Sudanese premenopausal breast cancer patients: Correlations with reproductive factors Breast Cancer Res. Treat. 2019 175 479 485 10.1007/s10549-019-05168-1 30796655 PMC6533225 68. Loibl S. Poortmans P. Morrow M. Denkert C. Curigliano G. Breast cancer Lancet 2021 397 1750 1769 10.1016/S0140-6736(20)32381-3 33812473 69. Toss A. Cristofanilli M. Molecular characterization and targeted therapeutic approaches in breast cancer Breast Cancer Res. 2015 17 60 10.1186/s13058-015-0560-9 25902832 PMC4407294 70. Xiong X. Zheng L.W. Ding Y. Chen Y.F. Cai Y.W. Wang L.P. Huang L. Liu C.C. Shao Z.M. Yu K.D. Breast cancer: Pathogenesis and treatments Signal Transduct. Target. Ther. 2025 10 49 10.1038/s41392-024-02108-4 39966355 PMC11836418 71. Rebbeck T.R. Friebel T.M. Friedman E. Hamann U. Huo D. Kwong A. Olah E. Olopade O.I. Solano A.R. Teo S.H. Mutational spectrum in a worldwide study of 29,700 families with BRCA1 or BRCA2 mutations Hum. Mutat. 2018 39 593 620 10.1002/humu.23406 29446198 PMC5903938 72. Veschi S. Aceto G. Scioletti A.P. Gatta V. Palka G. Cama A. Mariani-Costantini R. Battista P. Calo V. Barbera F. High prevalence of BRCA1 deletions in BRCAPRO-positive patients with high carrier probability Ann. Oncol. 2007 18 (Suppl. 6) vi86 vi92 10.1093/annonc/mdm233 17591842 73. Newman L. US Preventive Services Task Force Breast Cancer Recommendation Statement on Risk Assessment, Genetic Counseling, and Genetic Testing for BRCA-Related Cancer JAMA Surg. 2019 154 895 896 10.1001/jamasurg.2019.3184 31429868 74. Anaclerio F. Pilenzi L. Dell’Elice A. Ferrante R. Grossi S. Ferlito L.M. Marinelli C. Gildetti S. Calabrese G. Stuppia L. Clinical usefulness of NGS multi-gene panel testing in hereditary cancer analysis Front. Genet. 2023 14 1060504 10.3389/fgene.2023.1060504 37065479 PMC10104445 75. Rizzolo P. Silvestri V. Bucalo A. Zelli V. Valentini V. Catucci I. Zanna I. Masala G. Bianchi S. Spinelli A.M. Contribution of MUTYH Variants to Male Breast Cancer Risk: Results From a Multicenter Study in Italy Front. Oncol. 2018 8 583 10.3389/fonc.2018.00583 30564557 PMC6288482 76. Wang Y. Sun Y. Tan M. Lin X. Tai P. Huang X. Jin Q. Yuan D. Xu T. He B. Association Between Polymorphisms in DNA Damage Repair Pathway Genes and Female Breast Cancer Risk DNA Cell Biol. 2024 43 219 231 10.1089/dna.2023.0331 38634815 77. Bouras E. Karhunen V. Gill D. Huang J. Haycock P.C. Gunter M.J. Johansson M. Brennan P. Key T. Lewis S.J. Circulating inflammatory cytokines and risk of five cancers: A Mendelian randomization analysis BMC Med. 2022 20 3 10.1186/s12916-021-02193-0 35012533 PMC8750876 78. Moscatello C. Di Nicola M. Veschi S. Di Gregorio P. Cianchetti E. Stuppia L. Battista P. Cama A. Curia M.C. Aceto G.M. Relationship between MUTYH, OGG1 and BRCA1 mutations and mRNA expression in breast and ovarian cancer predisposition Mol. Clin. Oncol. 2021 14 15 10.3892/mco.2020.2177 33343895 PMC7725208 79. Donovan M.G. Wren S.N. Cenker M. Selmin O.I. Romagnolo D.F. Dietary fat and obesity as modulators of breast cancer risk: Focus on DNA methylation Br. J. Pharmacol. 2020 177 1331 1350 10.1111/bph.14891 31691272 PMC7056465 80. Ming R. Wu H. Liu H. Zhan F. Qiu X. Ji M. Causal effects and metabolites mediators between immune cell and risk of breast cancer: A Mendelian randomization study Front. Genet. 2024 15 1380249 10.3389/fgene.2024.1380249 38826800 PMC11140059 81. Davies H. Glodzik D. Morganella S. Yates L.R. Staaf J. Zou X. Ramakrishna M. Martin S. Boyault S. Sieuwerts A.M. HRDetect is a predictor of BRCA1 and BRCA2 deficiency based on mutational signatures Nat. Med. 2017 23 517 525 10.1038/nm.4292 28288110 PMC5833945 82. Chopra N. Tovey H. Pearson A. Cutts R. Toms C. Proszek P. Hubank M. Dowsett M. Dodson A. Daley F. Homologous recombination DNA repair deficiency and PARP inhibition activity in primary triple negative breast cancer Nat. Commun. 2020 11 2662 10.1038/s41467-020-16142-7 32471999 PMC7260192 83. Kuchenbaecker K.B. Hopper J.L. Barnes D.R. Phillips K.A. Mooij T.M. Roos-Blom M.J. Jervis S. van Leeuwen F.E. Milne R.L. Andrieu N. Risks of Breast, Ovarian, and Contralateral Breast Cancer for BRCA1 and BRCA2 Mutation Carriers JAMA 2017 317 2402 2416 10.1001/jama.2017.7112 28632866 84. Kim J. Munster P.N. Estrogens and breast cancer Ann. Oncol. 2025 36 134 148 10.1016/j.annonc.2024.10.824 39522613 PMC12168202 85. Sorlie T. Perou C.M. Tibshirani R. Aas T. Geisler S. Johnsen H. Hastie T. Eisen M.B. van de Rijn M. Jeffrey S.S. Gene expression patterns of breast carcinomas distinguish tumor subclasses with clinical implications Proc. Natl. Acad. Sci. USA 2001 98 10869 10874 10.1073/pnas.191367098 11553815 PMC58566 86. Goldhirsch A. Winer E.P. Coates A.S. Gelber R.D. Piccart-Gebhart M. Thurlimann B. Senn H.J. Panel M. Personalizing the treatment of women with early breast cancer: Highlights of the St Gallen International Expert Consensus on the Primary Therapy of Early Breast Cancer 2013 Ann. Oncol. 2013 24 2206 2223 10.1093/annonc/mdt303 23917950 PMC3755334 87. Tan P.H. Ellis I. Allison K. Brogi E. Fox S.B. Lakhani S. Lazar A.J. Morris E.A. Sahin A. Salgado R. The 2019 World Health Organization classification of tumours of the breast Histopathology 2020 77 181 185 10.1111/his.14091 32056259 88. De Schepper M. Vincent-Salomon A. Christgen M. Van Baelen K. Richard F. Tsuda H. Kurozumi S. Brito M.J. Cserni G. Schnitt S. Results of a worldwide survey on the currently used histopathological diagnostic criteria for invasive lobular breast cancer Mod. Pathol. 2022 35 1812 1820 10.1038/s41379-022-01135-2 35922548 PMC9708574 89. Risom T. Glass D.R. Averbukh I. Liu C.C. Baranski A. Kagel A. McCaffrey E.F. Greenwald N.F. Rivero-Gutierrez B. Strand S.H. Transition to invasive breast cancer is associated with progressive changes in the structure and composition of tumor stroma Cell 2022 185 299 310.E18 10.1016/j.cell.2021.12.023 35063072 PMC8792442 90. Yersal O. Barutca S. Biological subtypes of breast cancer: Prognostic and therapeutic implications World J. Clin. Oncol. 2014 5 412 424 10.5306/wjco.v5.i3.412 25114856 PMC4127612 91. Lim S.K. Lee M.H. Park I.H. You J.Y. Nam B.H. Kim B.N. Ro J. Lee K.S. Jung S.Y. Kwon Y.M. Impact of Molecular Subtype Conversion of Breast Cancers after Neoadjuvant Chemotherapy on Clinical Outcome Cancer Res. Treat. 2016 48 133 141 10.4143/crt.2014.262 25865655 PMC4720061 92. Perou C.M. Sorlie T. Eisen M.B. van de Rijn M. Jeffrey S.S. Rees C.A. Pollack J.R. Ross D.T. Johnsen H. Akslen L.A. Molecular portraits of human breast tumours Nature 2000 406 747 752 10.1038/35021093 10963602 93. Fico F. Santamaria-Martinez A. The Tumor Microenvironment as a Driving Force of Breast Cancer Stem Cell Plasticity Cancers 2020 12 3863 10.3390/cancers12123863 33371274 PMC7766255 94. Gupta T. Vinayak S. Telli M. Emerging strategies: PARP inhibitors in combination with immune checkpoint blockade in BRCA1 and BRCA2 mutation-associated and triple-negative breast cancer Breast Cancer Res. Treat. 2023 197 51 56 10.1007/s10549-022-06780-4 36318381 95. Bottosso M. Mosele F. Michiels S. Cournede P.H. Dogan S. Labaki C. Andre F. Moving toward precision medicine to predict drug sensitivity in patients with metastatic breast cancer ESMO Open 2024 9 102247 10.1016/j.esmoop.2024.102247 38401248 PMC10982863 96. Lukasiewicz S. Czeczelewski M. Forma A. Baj J. Sitarz R. Stanislawek A. Breast Cancer-Epidemiology, Risk Factors, Classification, Prognostic Markers, and Current Treatment Strategies-An Updated Review Cancers 2021 13 4287 10.3390/cancers13174287 34503097 PMC8428369 97. Rossing M. Pedersen C.B. Tvedskov T. Vejborg I. Talman M.L. Olsen L.R. Kroman N. Nielsen F.C. Jensen M.B. Ejlertsen B. Clinical implications of intrinsic molecular subtypes of breast cancer for sentinel node status Sci. Rep. 2021 11 2259 10.1038/s41598-021-81538-4 33500440 PMC7838175 98. Liu J. Li Y. Zhang W. Yang C. Yang C. Chen L. Ding M. Zhang L. Liu X. Cui G. The prognostic role of lymph node ratio in breast cancer patients received neoadjuvant chemotherapy: A dose-response meta-analysis Front. Surg. 2022 9 971030 10.3389/fsurg.2022.971030 36386510 PMC9644128 99. Lei P.J. Pereira E.R. Andersson P. Amoozgar Z. Van Wijnbergen J.W. O’Melia M.J. Zhou H. Chatterjee S. Ho W.W. Posada J.M. Cancer cell plasticity and MHC-II-mediated immune tolerance promote breast cancer metastasis to lymph nodes J. Exp. Med. 2023 220 e20221847 10.1084/jem.20221847 37341991 PMC10286805 100. Reticker-Flynn N.E. Zhang W. Belk J.A. Basto P.A. Escalante N.K. Pilarowski G.O.W. Bejnood A. Martins M.M. Kenkel J.A. Linde I.L. Lymph node colonization induces tumor-immune tolerance to promote distant metastasis Cell 2022 185 1924 1942.E23 10.1016/j.cell.2022.04.019 35525247 PMC9149144 101. Si H. Esquivel M. Mendoza Mendoza E. Roarty K. The covert symphony: Cellular and molecular accomplices in breast cancer metastasis Front. Cell Dev. Biol. 2023 11 1221784 10.3389/fcell.2023.1221784 37440925 PMC10333702 102. Terry M.B. Michels K.B. Brody J.G. Byrne C. Chen S. Jerry D.J. Malecki K.M.C. Martin M.B. Miller R.L. Neuhausen S.L. Environmental exposures during windows of susceptibility for breast cancer: A framework for prevention research Breast Cancer Res. 2019 21 96 10.1186/s13058-019-1168-2 31429809 PMC6701090 103. Arnone A.A. Wilson A.S. Soto-Pantoja D.R. Cook K.L. Diet Modulates the Gut Microbiome, Metabolism, and Mammary Gland Inflammation to Influence Breast Cancer Risk Cancer Prev. Res. 2024 17 415 428 10.1158/1940-6207.CAPR-24-0055 PMC11372361 38701438 104. Alpuim Costa D. Nobre J.G. Batista M.V. Ribeiro C. Calle C. Cortes A. Marhold M. Negreiros I. Borralho P. Brito M. Human Microbiota and Breast Cancer-Is There Any Relevant Link?-A Literature Review and New Horizons Toward Personalised Medicine Front. Microbiol. 2021 12 584332 10.3389/fmicb.2021.584332 33716996 PMC7947609 105. Hu S. Ding Q. Zhang W. Kang M. Ma J. Zhao L. Gut microbial beta-glucuronidase: A vital regulator in female estrogen metabolism Gut Microbes 2023 15 2236749 10.1080/19490976.2023.2236749 37559394 PMC10416750 106. Arnone A.A. Cook K.L. Gut and Breast Microbiota as Endocrine Regulators of Hormone Receptor-positive Breast Cancer Risk and Therapy Response Endocrinology 2022 164 bqac177 10.1210/endocr/bqac177 36282876 PMC9923803 107. Human Microbiome Project C. Structure, function and diversity of the healthy human microbiome Nature 2012 486 207 214 10.1038/nature11234 22699609 PMC3564958 108. Costello E.K. Lauber C.L. Hamady M. Fierer N. Gordon J.I. Knight R. Bacterial community variation in human body habitats across space and time Science 2009 326 1694 1697 10.1126/science.1177486 19892944 PMC3602444 109. Meng Z. Ye Z. Zhu P. Zhu J. Fang S. Qiu T. Li Y. Meng L. New Developments and Opportunities of Microbiota in Treating Breast Cancers Front. Microbiol. 2022 13 818793 10.3389/fmicb.2022.818793 35633703 PMC9134200 110. Davis C.P. Cohen M.S. Hackett R.L. Anderson M.D. Warren M.M. Urothelial hyperplasia and neoplasia. III. Detection of nitrosamine production with different bacterial genera in chronic urinary tract infections of rats J. Urol. 1991 145 875 880 10.1016/S0022-5347(17)38481-1 2005721 111. Costantini L. Magno S. Albanese D. Donati C. Molinari R. Filippone A. Masetti R. Merendino N. Characterization of human breast tissue microbiota from core needle biopsies through the analysis of multi hypervariable 16S-rRNA gene regions Sci. Rep. 2018 8 16893 10.1038/s41598-018-35329-z 30442969 PMC6237987 112. Thu M.S. Chotirosniramit K. Nopsopon T. Hirankarn N. Pongpirul K. Human gut, breast, and oral microbiome in breast cancer: A systematic review and meta-analysis Front. Oncol. 2023 13 1144021 10.3389/fonc.2023.1144021 37007104 PMC10063924 113. Wang H. Rong X. Zhao G. Zhou Y. Xiao Y. Ma D. Jin X. Wu Y. Yan Y. Yang H. The microbial metabolite trimethylamine N-oxide promotes antitumor immunity in triple-negative breast cancer Cell Metab. 2022 34 581 594.E8 10.1016/j.cmet.2022.02.010 35278352 114. Hix L.M. Shi Y.H. Brutkiewicz R.R. Stein P.L. Wang C.R. Zhang M. CD1d-expressing breast cancer cells modulate NKT cell-mediated antitumor immunity in a murine model of breast cancer metastasis PLoS ONE 2011 6 e20702 10.1371/journal.pone.0020702 21695190 PMC3113806 115. Rea D. Coppola G. Palma G. Barbieri A. Luciano A. Del Prete P. Rossetti S. Berretta M. Facchini G. Perdona S. Microbiota effects on cancer: From risks to therapies Oncotarget 2018 9 17915 17927 10.18632/oncotarget.24681 29707157 PMC5915165 116. Wang H. Altemus J. Niazi F. Green H. Calhoun B.C. Sturgis C. Grobmyer S.R. Eng C. Breast tissue, oral and urinary microbiomes in breast cancer Oncotarget 2017 8 88122 88138 10.18632/oncotarget.21490 29152146 PMC5675698 117. Kwa M. Plottel C.S. Blaser M.J. Adams S. The Intestinal Microbiome and Estrogen Receptor-Positive Female Breast Cancer J. Natl. Cancer Inst. 2016 108 djw029 10.1093/jnci/djw029 27107051 PMC5017946 118. Adlercreutz H. Martin F. Biliary excretion and intestinal metabolism of progesterone and estrogens in man J. Steroid Biochem. 1980 13 231 244 10.1016/0022-4731(80)90196-X 6991820 119. Fuhrman B.J. Feigelson H.S. Flores R. Gail M.H. Xu X. Ravel J. Goedert J.J. Associations of the fecal microbiome with urinary estrogens and estrogen metabolites in postmenopausal women J. Clin. Endocrinol. Metab. 2014 99 4632 4640 10.1210/jc.2014-2222 25211668 PMC4255131 120. Plottel C.S. Blaser M.J. Microbiome and malignancy Cell Host Microbe 2011 10 324 335 10.1016/j.chom.2011.10.003 22018233 PMC3264051 121. D’Antonio D.L. Marchetti S. Pignatelli P. Piattelli A. Curia M.C. The Oncobiome in Gastroenteric and Genitourinary Cancers Int. J. Mol. Sci. 2022 23 9664 10.3390/ijms23179664 36077063 PMC9456244 122. Yang J. Tan Q. Fu Q. Zhou Y. Hu Y. Tang S. Zhou Y. Zhang J. Qiu J. Lv Q. Gastrointestinal microbiome and breast cancer: Correlations, mechanisms and potential clinical implications Breast Cancer 2017 24 220 228 10.1007/s12282-016-0734-z 27709424 123. Dabek M. McCrae S.I. Stevens V.J. Duncan S.H. Louis P. Distribution of beta-glucosidase and beta-glucuronidase activity and of beta-glucuronidase gene gus in human colonic bacteria FEMS Microbiol. Ecol. 2008 66 487 495 10.1111/j.1574-6941.2008.00520.x 18537837 124. Goedert J.J. Hua X. Bielecka A. Okayasu I. Milne G.L. Jones G.S. Fujiwara M. Sinha R. Wan Y. Xu X. Postmenopausal breast cancer and oestrogen associations with the IgA-coated and IgA-noncoated faecal microbiota Br. J. Cancer 2018 118 471 479 10.1038/bjc.2017.435 29360814 PMC5830593 125. Goedert J.J. Jones G. Hua X. Xu X. Yu G. Flores R. Falk R.T. Gail M.H. Shi J. Ravel J. Investigation of the association between the fecal microbiota and breast cancer in postmenopausal women: A population-based case-control pilot study J. Natl. Cancer Inst. 2015 107 djv147 10.1093/jnci/djv147 26032724 PMC4554191 126. Backhed F. Ding H. Wang T. Hooper L.V. Koh G.Y. Nagy A. Semenkovich C.F. Gordon J.I. The gut microbiota as an environmental factor that regulates fat storage Proc. Natl. Acad. Sci. USA 2004 101 15718 15723 10.1073/pnas.0407076101 15505215 PMC524219 127. Koller V.J. Marian B. Stidl R. Nersesyan A. Winter H. Simic T. Sontag G. Knasmuller S. Impact of lactic acid bacteria on oxidative DNA damage in human derived colon cells Food Chem. Toxicol. 2008 46 1221 1229 10.1016/j.fct.2007.09.005 17942208 128. Deplanche M. Mouhali N. Nguyen M.T. Cauty C. Ezan F. Diot A. Raulin L. Dutertre S. Langouet S. Legembre P. Staphylococcus aureus induces DNA damage in host cell Sci. Rep. 2019 9 7694 10.1038/s41598-019-44213-3 31118484 PMC6531466 129. Oliero M. Calve A. Fragoso G. Cuisiniere T. Hajjar R. Dobrindt U. Santos M.M. Oligosaccharides increase the genotoxic effect of colibactin produced by pks+ Escherichia coli strains BMC Cancer 2021 21 172 10.1186/s12885-021-07876-8 33596864 PMC7890614 130. Aschtgen M.S. Fragkoulis K. Sanz G. Normark S. Selivanova G. Henriques-Normark B. Peuget S. Enterobacteria impair host p53 tumor suppressor activity through mRNA destabilization Oncogene 2022 41 2173 2186 10.1038/s41388-022-02238-5 35197571 PMC8993692 131. Thompson K.J. Ingle J.N. Tang X. Chia N. Jeraldo P.R. Walther-Antonio M.R. Kandimalla K.K. Johnson S. Yao J.Z. Harrington S.C. A comprehensive analysis of breast cancer microbiota and host gene expression PLoS ONE 2017 12 e0188873 10.1371/journal.pone.0188873 29190829 PMC5708741 132. Wolfe A.J. Toh E. Shibata N. Rong R. Kenton K. Fitzgerald M. Mueller E.R. Schreckenberger P. Dong Q. Nelson D.E. Evidence of uncultivated bacteria in the adult female bladder J. Clin. Microbiol. 2012 50 1376 1383 10.1128/JCM.05852-11 22278835 PMC3318548 133. Hummelen R. Fernandes A.D. Macklaim J.M. Dickson R.J. Changalucha J. Gloor G.B. Reid G. Deep sequencing of the vaginal microbiota of women with HIV PLoS ONE 2010 5 e12078 10.1371/journal.pone.0012078 20711427 PMC2920804 134. Grice E.A. Kong H.H. Conlan S. Deming C.B. Davis J. Young A.C. Program N.C.S. Bouffard G.G. Blakesley R.W. Murray P.R. Topographical and temporal diversity of the human skin microbiome Science 2009 324 1190 1192 10.1126/science.1171700 19478181 PMC2805064 135. Banerjee S. Tian T. Wei Z. Shih N. Feldman M.D. Peck K.N. DeMichele A.M. Alwine J.C. Robertson E.S. Distinct Microbial Signatures Associated With Different Breast Cancer Types Front. Microbiol. 2018 9 951 10.3389/fmicb.2018.00951 29867857 PMC5962706 136. Banerjee S. Wei Z. Tan F. Peck K.N. Shih N. Feldman M. Rebbeck T.R. Alwine J.C. Robertson E.S. Distinct microbiological signatures associated with triple negative breast cancer Sci. Rep. 2015 5 15162 10.1038/srep15162 26469225 PMC4606812 137. Saygun I. Nizam N. Keskiner I. Bal V. Kubar A. Acikel C. Serdar M. Slots J. Salivary infectious agents and periodontal disease status J. Periodontal Res. 2011 46 235 239 10.1111/j.1600-0765.2010.01335.x 21261620 138. Liu P. Liu Y. Wang J. Guo Y. Zhang Y. Xiao S. Detection of fusobacterium nucleatum and fadA adhesin gene in patients with orthodontic gingivitis and non-orthodontic periodontal inflammation PLoS ONE 2014 9 e85280 10.1371/journal.pone.0085280 24416378 PMC3887018 139. Yang N.Y. Zhang Q. Li J.L. Yang S.H. Shi Q. Progression of periodontal inflammation in adolescents is associated with increased number of Porphyromonas gingivalis, Prevotella intermedia, Tannerella forsythensis, and Fusobacterium nucleatum Int. J. Paediatr. Dent. 2014 24 226 233 10.1111/ipd.12065 24025042 140. Han Y.W. Fardini Y. Chen C. Iacampo K.G. Peraino V.A. Shamonki J.M. Redline R.W. Term stillbirth caused by oral Fusobacterium nucleatum Obstet. Gynecol. 2010 115 442 445 10.1097/AOG.0b013e3181cb9955 20093874 PMC3004155 141. Gauthier S. Tetu A. Himaya E. Morand M. Chandad F. Rallu F. Bujold E. The origin of Fusobacterium nucleatum involved in intra-amniotic infection and preterm birth J. Matern. Fetal Neonatal Med. 2011 24 1329 1332 10.3109/14767058.2010.550977 21314291 142. Barak S. Oettinger-Barak O. Machtei E.E. Sprecher H. Ohel G. Evidence of periopathogenic microorganisms in placentas of women with preeclampsia J. Periodontol. 2007 78 670 676 10.1902/jop.2007.060362 17397314 143. Temoin S. Chakaki A. Askari A. El-Halaby A. Fitzgerald S. Marcus R.E. Han Y.W. Bissada N.F. Identification of oral bacterial DNA in synovial fluid of patients with arthritis with native and failed prosthetic joints J. Clin. Rheumatol. 2012 18 117 121 10.1097/RHU.0b013e3182500c95 22426587 PMC3888235 144. Tahara T. Shibata T. Kawamura T. Okubo M. Ichikawa Y. Sumi K. Miyata M. Ishizuka T. Nakamura M. Nagasaka M. Fusobacterium detected in colonic biopsy and clinicopathological features of ulcerative colitis in Japan Dig. Dis. Sci. 2015 60 205 210 10.1007/s10620-014-3316-y 25102986 145. Strauss J. Kaplan G.G. Beck P.L. Rioux K. Panaccione R. Devinney R. Lynch T. Allen-Vercoe E. Invasive potential of gut mucosa-derived Fusobacterium nucleatum positively correlates with IBD status of the host Inflamm. Bowel Dis. 2011 17 1971 1978 10.1002/ibd.21606 21830275 146. Pignatelli P. Iezzi L. Pennese M. Raimondi P. Cichella A. Bondi D. Grande R. Cotellese R. Di Bartolomeo N. Innocenti P. The Potential of Colonic Tumor Tissue Fusobacterium nucleatum to Predict Staging and Its Interplay with Oral Abundance in Colon Cancer Patients Cancers 2021 13 1032 10.3390/cancers13051032 33804585 PMC7957509 147. Pignatelli P. Nuccio F. Piattelli A. Curia M.C. The Role of Fusobacterium nucleatum in Oral and Colorectal Carcinogenesis Microorganisms 2023 11 2358 10.3390/microorganisms11092358 37764202 PMC10537357 148. D’Antonio D.L. Zenoniani A. Umme S. Piattelli A. Curia M.C. Intratumoral Fusobacterium nucleatum in Pancreatic Cancer: Current and Future Perspectives Pathogens 2024 14 2 10.3390/pathogens14010002 39860963 PMC11768203 149. Hayashi M. Ikenaga N. Nakata K. Luo H. Zhong P. Date S. Oyama K. Higashijima N. Kubo A. Iwamoto C. Intratumor Fusobacterium nucleatum promotes the progression of pancreatic cancer via the CXCL1-CXCR2 axis Cancer Sci. 2023 114 3666 3678 10.1111/cas.15901 37438965 PMC10475786 150. Yamamura K. Baba Y. Nakagawa S. Mima K. Miyake K. Nakamura K. Sawayama H. Kinoshita K. Ishimoto T. Iwatsuki M. Human Microbiome Fusobacterium Nucleatum in Esophageal Cancer Tissue Is Associated with Prognosis Clin. Cancer Res. 2016 22 5574 5581 10.1158/1078-0432.CCR-16-1786 27769987 151. Chen W.D. Zhang X. Zhang M.J. Zhang Y.P. Shang Z.Q. Xin Y.W. Zhang Y. Salivary Fusobacterium nucleatum serves as a potential diagnostic biomarker for gastric cancer World J. Gastroenterol. 2022 28 4120 4132 10.3748/wjg.v28.i30.4120 36157109 PMC9403436 152. Audirac-Chalifour A. Torres-Poveda K. Bahena-Roman M. Tellez-Sosa J. Martinez-Barnetche J. Cortina-Ceballos B. Lopez-Estrada G. Delgado-Romero K. Burguete-Garcia A.I. Cantu D. Cervical Microbiome and Cytokine Profile at Various Stages of Cervical Cancer: A Pilot Study PLoS ONE 2016 11 e0153274 10.1371/journal.pone.0153274 27115350 PMC4846060 153. Abed J. Emgard J.E. Zamir G. Faroja M. Almogy G. Grenov A. Sol A. Naor R. Pikarsky E. Atlan K.A. Fap2 Mediates Fusobacterium nucleatum Colorectal Adenocarcinoma Enrichment by Binding to Tumor-Expressed Gal-GalNAc Cell Host Microbe 2016 20 215 225 10.1016/j.chom.2016.07.006 27512904 PMC5465824 154. Fardini Y. Wang X. Temoin S. Nithianantham S. Lee D. Shoham M. Han Y.W. Fusobacterium nucleatum adhesin FadA binds vascular endothelial cadherin and alters endothelial integrity Mol. Microbiol. 2011 82 1468 1480 10.1111/j.1365-2958.2011.07905.x 22040113 PMC3237733 155. Fan Z. Tang P. Li C. Yang Q. Xu Y. Su C. Li L. Fusobacterium nucleatum and its associated systemic diseases: Epidemiologic studies and possible mechanisms J. Oral. Microbiol. 2023 15 2145729 10.1080/20002297.2022.2145729 36407281 PMC9673791 156. Kolbl A.C. Jeschke U. Friese K. Andergassen U. The role of TF- and Tn-antigens in breast cancer metastasis Histol. Histopathol. 2016 31 613 621 10.14670/HH-11-722 26758176 157. Abed J. Maalouf N. Parhi L. Chaushu S. Mandelboim O. Bachrach G. Tumor Targeting by Fusobacterium nucleatum: A Pilot Study and Future Perspectives Front. Cell Infect. Microbiol. 2017 7 295 10.3389/fcimb.2017.00295 28713780 PMC5492862 158. Guo X. Yu K. Huang R. The ways Fusobacterium nucleatum translocate to breast tissue and contribute to breast cancer development Mol. Oral. Microbiol. 2024 39 1 11 10.1111/omi.12446 38171827 159. Mehner C. Hockla A. Miller E. Ran S. Radisky D.C. Radisky E.S. Tumor cell-produced matrix metalloproteinase 9 (MMP-9) drives malignant progression and metastasis of basal-like triple negative breast cancer Oncotarget 2014 5 2736 2749 10.18632/oncotarget.1932 24811362 PMC4058041 160. Wang N. Wu S. Huang L. Hu Y. He X. He J. Hu B. Xu Y. Rong Y. Yuan C. Intratumoral microbiome: Implications for immune modulation and innovative therapeutic strategies in cancer J. Biomed. Sci. 2025 32 23 10.1186/s12929-025-01117-x 39966840 PMC11837407 161. Chen Y. Peng Y. Yu J. Chen T. Wu Y. Shi L. Li Q. Wu J. Fu X. Invasive Fusobacterium nucleatum activates beta-catenin signaling in colorectal cancer via a TLR4/P-PAK1 cascade Oncotarget 2017 8 31802 31814 10.18632/oncotarget.15992 28423670 PMC5458249 162. Casey S.C. Tong L. Li Y. Do R. Walz S. Fitzgerald K.N. Gouw A.M. Baylot V. Gutgemann I. Eilers M. MYC regulates the antitumor immune response through CD47 and PD-L1 Science 2016 352 227 231 10.1126/science.aac9935 26966191 PMC4940030 163. Fang J. Chen F. Liu D. Gu F. Chen Z. Wang Y. Prognostic value of immune checkpoint molecules in breast cancer Biosci. Rep. 2020 40 BSR20201054 10.1042/BSR20201054 32602545 PMC7340863 164. Mollavelioglu B. Cetin Aktas E. Cabioglu N. Abbasov A. Onder S. Emiroglu S. Tukenmez M. Muslumanoglu M. Igci A. Deniz G. High co-expression of immune checkpoint receptors PD-1, CTLA-4, LAG-3, TIM-3, and TIGIT on tumor-infiltrating lymphocytes in early-stage breast cancer World J. Surg. Oncol. 2022 20 349 10.1186/s12957-022-02810-z 36271406 PMC9587596 165. Matlung H.L. Szilagyi K. Barclay N.A. van den Berg T.K. The CD47-SIRPalpha signaling axis as an innate immune checkpoint in cancer Immunol. Rev. 2017 276 145 164 10.1111/imr.12527 28258703 166. Han Y. Liu D. Li L. PD-1/PD-L1 pathway: Current researches in cancer Am. J. Cancer Res. 2020 10 727 742 32266087 PMC7136921 Figure 1 Healthy breast versus inflammatory condition. Lactobacillus Bifidobacterium Sphingomonas Staphylococcus aureus E. coli 15 https://biorender.com Figure 2 Retrograde inoculation of F. nucleatum Streptococcus Veillonella Fusobacterium nucleatum Actinomyces 38 41 https://biorender.com Figure 3 F. nucleatum F. nucleatum. F. nucleatum https://biorender.com ",
  "metadata": {
    "Title of this paper": "PD-1/PD-L1 pathway: Current researches in cancer",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472077/"
  }
}