{
  "title": "Paper_457",
  "abstract": "Indian J Otolaryngol Head Neck Surg Indian J Otolaryngol Head Neck Surg 1415 ijoto Indian Journal of Otolaryngology and Head & Neck Surgery 2231-3796 0973-7707 Springer PMC11456120 PMC11456120.1 11456120 11456120 39376444 10.1007/s12070-024-04922-2 4922 1 Original Article Depth of Invasion in Early Oral Cancer: Is 4MM a Threshold for Elective Neck Dissection? Hoda Nadimul http://orcid.org/0000-0003-3912-920X Saraf Ankita dr.ankitasaraf@gmail.com Sabitha K. S. Bhogaraju Sravani Moza Aastha Ahmed Irfan https://ror.org/027h1w574 grid.419773.f 0000 0000 9414 4275 Kidwai Memorial Institute of Oncology, 24 7 2024 10 2024 76 5 472259 4569 4574 26 4 2024 17 7 2024 01 10 2025 01 10 2025 07 10 2024 01 10 2025 © Association of Otolaryngologists of India 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 Lymph node metastasis is one of the most important prognostic factors in oral squamous cell carcinoma. In early stage oral cancers, Depth of invasion (DOI) is a predictor for lymph node metastasis. The aim of this study was to evaluate if DOI 4 mm can be considered as a threshold for clinical decision making on elective neck dissection (END) in early oral cancer, by assessing the association of DOI and the risk of occult lymph node metastasis in early Oral squamous cell carcinoma (OSCC). A retrospective study was conducted on 319 patients with early pT1-2 OSCC who were clinically N negative. All patients underwent primary resection and END. The patients were divided into two groups based on DOI: < 4 mm and ≥ 4 mm. Nodal metastases were then noted for each group. The rate of nodal metastasis in respect to tumor size was also observed. Out of 111 patients having DOI < 4 mm only 15 (4.7%) had lymph node metastasis, whereas out of 208 patients having DOI ≥ 4 mm, 81 patients (25.4%) had neck node metastasis, with p Keywords Oral cancer Depth of invasion DOI END Occult metastasis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Association of Otolaryngologists of India 2024 ",
  "metadata": {
    "Title of this paper": "Depth of Invasion in Early Oral Cancer: Is 4MM a Threshold for Elective Neck Dissection?",
    "Journal it was published in:": "Indian Journal of Otolaryngology and Head & Neck Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11456120/"
  }
}