{
  "title": "Paper_670",
  "abstract": "pmc Gels Gels 3575 gels gels Gels 2310-2861 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469436 PMC12469436.1 12469436 12469436 41002466 10.3390/gels11090691 gels-11-00691 1 Review Inflammation-Responsive Hydrogels in Perioperative Pain and Wound Management: Design Strategies and Emerging Potential https://orcid.org/0000-0001-5141-2652 Moon Young Eun 1 Jeong Jin-Oh 2 https://orcid.org/0000-0002-1806-9458 Choi Hoon 1 * Liu Yannan Academic Editor Li Yingchun Academic Editor 1 momo0910@catholic.ac.kr 2 jijeong@wakehealth.edu * hoonie83@catholic.ac.kr 01 9 2025 9 2025 11 9 497641 691 31 7 2025 25 8 2025 26 8 2025 01 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Surgical procedures trigger dynamic inflammatory responses that influence postoperative pain, wound healing, and long-term outcomes. Conventional therapies rely on the systemic delivery of anti-inflammatory and analgesic agents, which often lack spatiotemporal precision and carry significant side effects. Inflammation-responsive hydrogels offer a promising alternative by enabling localized, stimulus-adaptive drug release aligned with the evolving biochemical milieu of surgical wounds. These smart biomaterials respond to endogenous triggers, such as reactive oxygen species, acidic pH, and proteolytic enzymes, allowing precise modulation of inflammation and tissue repair. This narrative review outlines the pathophysiological features of perioperative inflammation and the design principles of responsive hydrogel systems, including pH-, reactive oxygen species-, enzyme-sensitive, and multi-stimuli platforms. We evaluated the integration of key payloads, NSAIDs, corticosteroids, α 2 inflammation-responsive hydrogels perioperative drug delivery postoperative pain wound healing reactive oxygen species pH-sensitive biomaterials enzyme-responsive systems surgical inflammation This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Surgical procedures trigger a multifaceted cascade of physiological events collectively known as the perioperative inflammatory response. This process encompasses acute tissue damage, neurogenic inflammation, immune cell infiltration, and subsequent tissue remodeling, all of which contribute to postoperative pain and impaired wound healing [ 1 2 3 4 Conventional approaches to managing perioperative inflammation and pain primarily rely on systemic pharmacological agents, including opioids, non-steroidal anti-inflammatory drugs (NSAIDs), and corticosteroids [ 5 6 7 8 9 10 11 Hydrogels have emerged as a promising class of biomaterials for localized drug delivery owing to their high water content, biocompatibility, mechanical tunability, and ability to conform to irregular tissue surfaces [ 12 13 14 15 16 17 18 Despite these theoretical advantages, few inflammation-responsive hydrogel platforms have been specifically evaluated in perioperative pain or wound care models, particularly in clinically relevant surgical contexts. Most preclinical research to date has focused on chronic inflammation, traumatic injuries, or general regenerative applications [ 19 20 This review explores the rationale, design strategies, and emerging therapeutic applications of inflammation-responsive hydrogels, with a focus on their role in perioperative pain management and wound healing. While previous reviews have examined hydrogel-based drug delivery in chronic wounds [ 21 22 23 24 25 26 In this review, the term “perioperative” is defined as the continuum encompassing the intraoperative period, the immediate postoperative phase (first 48–72 h), and the early recovery stage extending until wound closure and resolution of acute inflammation. This operational scope is selected to capture the dynamic inflammatory and nociceptive processes most relevant to the evaluation and optimization of hydrogel-based therapeutic interventions in surgical settings. 2. Pathophysiology and Design Implications of Perioperative Inflammation Surgical trauma triggers a highly coordinated multifactorial inflammatory response involving molecular, cellular, and tissue-level events [ 1 27 2 A comprehensive understanding of the perioperative inflammatory landscape is essential to anticipate complications and guide the rational design of biomaterial-based interventions. Stimulus-responsive drug delivery systems must align their release kinetics with the dynamic, site-specific, and time-sensitive features of postoperative inflammation. The following subsections examine the key molecular mediators, spatial and temporal dynamics, and endogenous biochemical triggers that define the perioperative wound microenvironment. These factors collectively inform the engineering of responsive hydrogels capable of synchronizing therapeutic actions with the evolving biology of surgical wounds. 2.1. Inflammatory Cascade Triggered by Surgical Trauma Surgical injury initiates a complex and tightly regulated inflammatory cascade driven by damage-associated molecular patterns, pro-inflammatory cytokines, and innate immune cells. Upon tissue disruption, endogenous danger signals such as high-mobility group box 1, ATP, uric acid, and heat shock proteins are rapidly released from necrotic or stressed cells [ 28 29 30 31 Neutrophils are among the first immune cells to infiltrate a wound and typically arrive within minutes to hours. They amplify the inflammatory response by releasing proteolytic enzymes, such as neutrophil elastase (NE) and matrix metalloproteinases (MMPs), as well as ROS, which contribute to tissue damage and inflammatory signaling [ 32 33 34 A detailed understanding of the temporal dynamics and functional roles of these inflammatory mediators is essential for designing responsive hydrogels. While early phase signals, such as ROS and neutrophil-derived enzymes, may enable rapid or burst-phase release, sustained MMP activity and cytokine gradients can guide prolonged or staged drug delivery. These mechanistic insights form the basis for engineering hydrogel platforms that can adapt to the evolving inflammatory landscape of surgical wounds. 2.2. Spatiotemporal Dynamics of the Inflammatory Response Perioperative inflammatory response occurs through temporally and spatially dynamic processes. Broadly, it can be divided into an acute inflammatory phase (0–72 h) and a resolving or remodeling phase (>3 days), each defined by distinct cellular populations and molecular mediators. The acute phase is characterized by rapid neutrophil infiltration, elevated pro-inflammatory cytokine levels, oxidative stress, and tissue edema, all of which contribute to nociceptive sensitization and collateral tissue injury [ 35 36 Spatial heterogeneity further complicates the inflammatory landscapes. The severity and pattern of local inflammation can vary substantially across tissue compartments (e.g., muscle versus fascia) and even within a single wound. This variation is influenced by factors such as vascular density, oxygen gradients, and mechanical stress. Notably, surgical wounds often exhibit regions of localized hypoxia, which can aggravate inflammation via hypoxia-inducible factor-1α activation and lactic acid accumulation, ultimately lowering the extracellular pH to levels as low as 6.5 [ 37 From a therapeutic perspective, synchronizing drug release with the evolving inflammatory milieu is essential. Early phase interventions may benefit from rapid delivery of anti-inflammatory agents that target neutrophil-driven damage, whereas later stages may require controlled release of growth factors, cytokine inhibitors, or extracellular matrix (ECM) modulators to promote resolution and tissue regeneration [ 27 2.3. Interplay Between Inflammation, Nociception, and Tissue Regeneration The relationship between inflammation and nociception is a defining feature of the perioperative period. Pro-inflammatory cytokines such as TNF-α and IL-1β sensitize peripheral nociceptors by upregulating ion channels, including transient receptor potential vanilloid 1 and voltage-gated sodium channel Nav1.8. This molecular cascade promotes both peripheral and central sensitization, ultimately leading to hyperalgesia and prolonged postoperative pain [ 38 39 Immune cells involved in wound healing exert dual and sometimes opposing effects by concurrently modulating inflammation, nociception, and tissue repair. Macrophages are particularly important for maintaining this balance. Classically activated M1 macrophages secrete ROS and pro-inflammatory cytokines that exacerbate pain signaling, whereas alternatively activated M2 macrophages promote angiogenesis, ECM remodeling, and regenerative healing [ 40 Beyond serving as passive drug depots, inflammation-responsive hydrogels can actively modulate these wound-healing cascades through intrinsic biophysical and biochemical cues. Matrix stiffness, degradability, and ligand presentation (e.g., RGD, GFOGER) can bias macrophage polarization toward pro-regenerative phenotypes, modulate fibroblast activity, and support angiogenesis and organized collagen deposition [ 41 42 43 44 Addressing this complex interplay requires delivery systems that can adapt to the inflammatory phase, modulating therapeutic responses in a temporally and spatially precise manner. Inflammation-responsive hydrogels offer such capability, aligning analgesic effects with regenerative processes and thereby improving surgical wound care outcomes. 2.4. Biomarkers as Triggers for Responsive Drug Release The inflammatory microenvironment of surgical wounds contains a diverse array of biochemical signals that serve as precise and biologically relevant triggers for on-demand drug delivery. These cues are characterized by their spatial and temporal specificity, and have been successfully utilized in the design of inflammation-responsive hydrogel systems. Key categories include the following: pH shifts: Local acidosis, typically driven by hypoxia and lactic acid accumulation, can lower the extracellular pH to approximately 6.5 during the acute inflammatory phase [ 45 46 ROS: Neutrophil-derived ROS, including hydrogen peroxide and superoxide, are elevated in inflamed and ischemic tissues following surgical injury [ 47 19 Proteolytic enzymes: Proteases such as MMP-2, MMP-9, and NE are commonly upregulated in inflamed surgical wounds [ 32 48 Cytokine gradients: Although more challenging to directly exploit, inflammatory cytokines such as IL-1β and TNF-α can inform the development of feedback-controlled delivery systems. Aptamers are short, single-stranded nucleic acids that bind specific molecular targets with high affinity and selectivity. When incorporated into a hydrogel matrix, these aptamer-functionalized systems can undergo conformational or charge-based changes upon binding their target cytokine, triggering structural transitions or payload release. Alternatively, nanoparticle-integrated hydrogel matrices can be engineered to sense cytokine concentrations through particle surface chemistry or embedded biosensing elements, enabling dynamic modulation of drug release in response to inflammatory status [ 49 50 Table 1 These molecular cues are not only pathophysiologically relevant but also structured in a temporally and spatially defined manner, which is essential for achieving precise inflammation-adaptive drug delivery [ 51 Although most stimulus-responsive hydrogel platforms have been developed for chronic or nonsurgical inflammatory conditions, the perioperative wound environment offers a uniquely well-defined and temporally constrained biochemical profile. Transient pH fluctuations, oxidative bursts, protease activity, and cytokine surges provide a robust and clinically actionable framework for responsive material design. In summary, the biological complexity of perioperative inflammation represents not only a therapeutic challenge but also a valuable engineering opportunity. Smart hydrogel systems that harness endogenous inflammatory signals offer a compelling path toward adaptive, targeted, and clinically translatable solutions for perioperative pain management and wound healing. 3. Design Principles of Inflammation-Responsive Hydrogels The broader concept of stimuli-responsive materials can be traced back to the field of 4D printing. The term “4D printing” was first introduced in 2013, describing three-dimensional constructs that are programmed to change shape, properties, or function over time in response to predefined environmental cues [ 52 53 Figure 1 Successful translation of perioperative pathophysiology into therapeutic outcomes requires the development of material systems capable of detecting and responding to dynamic biological signals. As described in the previous section, surgical wounds generate a temporally ordered sequence of biochemical cues, including local acidosis, oxidative stress, and elevated protease activity, which vary spatially and temporally. These pathophysiological features create a favorable context for inflammation-responsive hydrogels to deliver therapeutics in a localized, adaptive, and phase-specific manner [ 18 To harness these cues, hydrogel systems are engineered with chemical motifs that undergo structural or physicochemical changes, such as swelling, degradation, or bond cleavage, in response to defined stimuli. Most existing platforms utilize acid-labile linkages, ROS-sensitive groups, or enzyme-cleavable crosslinkers to enable site- and condition-specific drug release. More advanced designs incorporate multi-stimuli responsiveness or logic-gated mechanisms to enhance spatial precision, reduce off-target activation, and accommodate the complexity of inflamed surgical environments [ 12 Although inflammation-responsive hydrogels have been widely studied in models of chronic inflammation, trauma, and regenerative medicine, their application in perioperative care remains relatively underexplored. Nevertheless, the predictable and transient nature of postoperative inflammation presents a unique opportunity for temporally coordinated and spatially selective drug delivery. The following subsections classify inflammation-responsive hydrogels into four main categories: pH-responsive, ROS-responsive, enzyme-responsive, and multi-stimuli or feedback-controlled systems. For each type, we describe the underlying chemical design strategies, stimulus-response mechanisms, and potential applications in perioperative pain management and wound healing. 3.1. pH-Responsive Hydrogels One of the most well-characterized features of inflamed surgical tissues is localized extracellular acidosis. Following trauma, hypoxia and elevated glycolytic metabolism lead to lactic acid accumulation, reducing extracellular pH to as low as 6.0–6.8 during the acute postoperative phase [ 54 These hydrogels are designed to undergo structural transformations, such as swelling, degradation, or sol–gel transitions, when exposed to mildly acidic environments. The triggering mechanism generally involves protonation of ionizable groups or acid-catalyzed hydrolysis of labile covalent bonds, which destabilizes the polymer network and alters mesh size or hydrophilicity, thereby accelerating drug diffusion. In acid-labile linkages, the drop in pH facilitates cleavage of susceptible bonds (e.g., orthoesters, ketals), while in polyelectrolyte systems, protonation reduces electrostatic repulsion and drives network contraction or dissolution. These responses are typically mediated by acid-labile chemical linkages or ionizable functional groups embedded in a polymer matrix [ 14 Orthoesters, acetals, and ketals: These linkages undergo hydrolytic cleavage under acidic conditions, leading to network disassembly and accelerated drug release [ 55 56 Schiff base (imine) bonds: Formed through aldehyde–amine condensation, these bonds are relatively stable at physiological pH, but hydrolyze rapidly under acidic conditions [ 57 Poly(acrylic acid) (PAA) derivatives: These polymers undergo pH-dependent ionization of the carboxyl groups, enabling reversible swelling through protonation and deprotonation [ 58 The pH responsiveness of these systems can be finely tuned by adjusting the polymer composition, crosslinking density, and pKa of the functional groups to ensure activation at pH levels below 6.8. This helps avoid premature or off-target drug release in non-inflamed tissues [ 59 Several design examples illustrate the versatility and translational potential of this strategy: A mesoporous glass–hydroxyapatite scaffold incorporating orthoester linkers achieved pH-triggered levofloxacin release under acidic conditions (pH 5.5–6.7), enhancing bacterial clearance while preserving osteoblast viability [ 60 A self-healing polyethylene glycol (PEG)-based hydrogel, crosslinked via imine bonds between aldehyde- and amine-functionalized poly(ether urethane)s, remained stable at pH 7.4, but was hydrolyzed in acidic environments. It supported sustained drug release for up to 17 days and was injectable through a 21 G needle, suggesting promise for minimally invasive perioperative applications in spatially and temporally confined inflammation [ 61 A semi-interpenetrating κ-carrageenan–PAA hydrogel, originally developed for gastrointestinal diclofenac delivery, exhibited pH-dependent diffusion (~80% at pH 7.4 vs. ~40% at pH 1.2) [ 62 pH-responsive hydrogels leverage a wide range of acid-sensitive chemistries, including covalent bond cleavage and ionic swelling, to achieve controlled drug release in acidic wound environments. These systems function autonomously, require no external input, and have shown therapeutic efficacy in multiple models of inflammation and infection. Although their application in surgical settings is still emerging, the predictable presence of acidosis in postoperative wounds highlights the potential of pH-sensitive platforms for precise and adaptive drug delivery during perioperative care. 3.2. ROS-Responsive Hydrogels Oxidative stress is a hallmark of acute postoperative inflammation. Following surgical trauma, activated neutrophils and macrophages produce elevated levels of ROS, including hydrogen peroxide, superoxide, and hydroxyl radicals [ 63 64 ROS-responsive hydrogels are engineered to leverage this oxidative microenvironment by incorporating chemical moieties that undergo bond cleavage, oxidation-induced polarity changes, or crosslink density modulation in the presence of ROS. The triggering mechanism typically involves oxidation of sulfur-, boron-, or selenium-containing groups, which disrupts covalent linkages or alters hydrophilicity, thereby increasing mesh size and facilitating drug diffusion. In some cases, these chemical transformations simultaneously generate antioxidant byproducts, offering intrinsic ROS-scavenging activity alongside drug release [ 15 Thioketal linkages (–S–C–S–): These linkages are selectively cleaved in the presence of ROS, resulting in hydrogel disassembly and controlled drug release [ 65 Boronic esters or acids: These groups react specifically with hydrogen peroxide to form phenols and boric acid, triggering gel degradation or drug release [ 66 Selenium-containing moieties (e.g., diselenide bonds): Upon oxidation, these are converted to selenoxide derivatives, modulating the crosslink density and often imparting intrinsic antioxidant activity [ 67 These mechanisms allow for tunable drug release kinetics, and some platforms offer the added benefit of ROS scavenging. The degradation threshold and response rate can be adjusted to match the oxidative burden in inflamed surgical tissues [ 15 Representative systems illustrate the versatility and perioperative relevance of this approach: A PEG hydrogel crosslinked with thioketal linkages was developed for the ROS-responsive delivery of epidermal growth factor. Upon ROS exposure, thioketal cleavage accelerated growth factor release, leading to enhanced angiogenesis, reduced oxidative stress, and improved re-epithelialization in a full-thickness wound model [ 68 A dual-responsive gelatin–poly(vinyl alcohol) (PVA) hydrogel incorporating boronic ester crosslinks and pH-sensitive micelles enabled the sequential release of vancomycin–silver nanoclusters and nimesulide. ROS triggered rapid antimicrobial delivery, while acidic pH sustained anti-inflammatory release. In a diabetic infected wound model, this system outperformed commercial dressings and single-drug controls in bacterial clearance, cytokine suppression, and hemostasis [ 69 A selenium-based polyurethane hydrogel incorporating diselenide crosslinkers responded to oxidative stress by forming selenoxide, softening the matrix, and delivering antioxidant effects. In a rat myocardial infarction model, this system reduced fibrosis, suppressed inflammatory cytokines, and improved cardiac function relative to non-selenium controls [ 70 ROS-responsive hydrogels offer a compelling strategy for inflammation-adaptive drug delivery, particularly during the early postoperative period when oxidative stress peaks. By integrating therapeutic release with intrinsic ROS-scavenging capabilities, these systems provide the dual benefits of mitigating tissue damage and modulating immune responses. Moving forward, emphasis should be placed on validating these platforms in surgical models, with a focus on achieving precise temporal alignment between oxidative cues and drug release profiles. 3.3. Enzyme-Responsive Hydrogels Proteolytic enzymes are key mediators of inflammation, ECM remodeling, and immune activation following surgical trauma. MMPs, particularly MMP-2 and MMP-9, play essential roles in ECM degradation, angiogenesis, and wound resolution [ 71 32 Enzyme-responsive hydrogels are engineered by incorporating protease-cleavable peptide sequences into the polymer backbone, crosslinks, or pendant chains. Upon recognition and hydrolysis by the target protease, these sequences undergo specific peptide bond cleavage, disrupting the network architecture and increasing mesh size. This structural change facilitates drug diffusion or complete matrix degradation, depending on crosslink density and polymer hydrophilicity. Common biochemical motifs include GPLGIAGQ or CVPLSLYSG for MMP-2/9 and AAPV for NE, which are selectively cleaved at physiological temperature and pH. These cleavable linkers can be integrated into bulk hydrogels, microneedles, or nanoparticle–hydrogel hybrids, enabling precise spatiotemporal drug release in protease-rich postoperative environments [ 48 MMP-cleavable linkers (e.g., GPLGIAGQ, CVPLSLYSG) integrated into PEG-based matrices to enable enzyme-responsive degradation and drug release [ 72 NE-sensitive motifs (e.g., AAPV) for targeted activation in neutrophil-rich tissues, especially during early postoperative inflammation [ 73 Microneedle and nanoparticle–hydrogel hybrids that combine physical precision with enzyme-triggered delivery, supporting minimally invasive surgical applications [ 74 These strategies enable spatiotemporally regulated drug delivery aligned with dynamic protease activity in surgical wounds. Several examples have highlighted the translational potential of this approach: A tetra-PEG hydrogel crosslinked with GPLGIAGQ peptides was used for the MMP-2-responsive delivery of phosphatidylserine. This system promoted M2 macrophage polarization, suppressed IL-1β and TNF-α expression, and enhanced bone regeneration in a rat calvarial defect model. Compared with drug-free and non-responsive controls, the hydrogel showed superior immunomodulatory effects, supporting its relevance for surgical tissue repair [ 75 A PEG hydrogel incorporating CVPLSLYSG linkers was engineered for MMP-2/9-responsive delivery of docetaxel-loaded poly(lactic-co-glycolic acid) (PLGA) nanoparticles. Upon enzyme exposure, the matrix degraded, releasing nanoparticles that achieved over five-fold higher cytotoxicity against glioma cells compared to free docetaxel, and over 20-fold compared to non-degradable controls [ 76 An NE-responsive RADA16-I hydrogel functionalized with AAPV-cleavable sequences and regenerative peptides (GHK, KGHK, and RDKVYR) released bioactive cues upon NE exposure. In a murine full-thickness wound model, the system accelerated re-epithelialization, enhanced fibroblast activity, and promoted collagen deposition, demonstrating its efficacy in protease-rich wound environments [ 77 A microneedle patch composed of gelatin methacryloyl (GelMA) and ε-poly-L-lysine loaded with curcumin nanoparticles was developed for MMP-triggered degradation. In infected wound models, the patch enhanced closure, suppressed TNF-α, and upregulated IL-10 and vascular endothelial growth factor (VEGF) expression [ 78 Enzyme-responsive hydrogels represent a flexible and targeted approach to perioperative drug delivery, capitalizing on the temporally and spatially restricted activities of pathological proteases. Their selective responsiveness enables context-specific release of immunomodulators, antimicrobial agents, or regenerative factors. Future developments should prioritize multi-enzyme integration and validation in surgical models that reflect real-world inflammatory complexity. 3.4. Multi-Stimuli and Feedback-Controlled Systems The postoperative wound environment presents a complex and evolving landscape, characterized by overlapping inflammatory signals, such as oxidative stress, local acidosis, and protease activity. Although hydrogels responsive to a single stimulus can offer targeted drug delivery, their therapeutic precision may be suboptimal under such multifactorial conditions. To improve responsiveness and adaptability, next-generation hydrogel platforms have been developed to integrate multiple endogenous triggers and incorporate autonomous control systems. These strategies aim to enable context-sensitive, phase-appropriate drug release tailored to the dynamic physiology of surgical wounds [ 79 Multi-stimuli-responsive hydrogels have been engineered to respond to two or more pathological cues simultaneously, thereby enhancing delivery specificity in heterogeneous and temporally variable inflammatory environments. Mechanistically, these systems integrate distinct chemical motifs, such as acid-labile linkers and ROS-sensitive groups, so that protonation and oxidation act in parallel or synergistically to weaken crosslinks, expand mesh size, and accelerate drug diffusion [ 80 81 Building on the multi-stimuli concept, Boolean logic–based hydrogels apply combinatorial rules to further refine responsiveness, with AND gates requiring multiple stimuli simultaneously and OR gates triggered by any one of several stimuli [ 82 83 Feedback-controlled hydrogel systems, in the strict sense, actively regulate drug release through real-time monitoring of endogenous biochemical signals, thereby forming a closed loop between sensing and therapeutic output. This approach differs fundamentally from predefined stimulus-responsive designs, which passively release payloads upon encountering a pathological cue without continuous feedback. True feedback platforms typically integrate molecular, optical, or electrochemical biosensors within the hydrogel matrix to detect fluctuations in clinically relevant biomarkers and trigger therapeutic release accordingly [ 84 85 Redox-switchable hydrogels offer yet another strategy, particularly for pulsatile or repeated drug delivery in oxidative surgical environments [ 86 87 Together, these systems mark a significant step toward autonomous inflammation-responsive therapy in perioperative care. By integrating multiple stimuli or embedding biosensing modules, real-time spatially localized control of drug release in complex wound environments can be achieved. Future research should focus on expanding their responsiveness to clinically relevant inflammatory targets, coupling them with wearable biosensors, and validating their efficacy in surgical models to support their incorporation into personalized recovery protocols [ 88 Although these platforms exploit physiologically relevant cues, the magnitude and temporal profile of pH, ROS, and protease activity are highly context dependent across patients and surgical procedures. Surgical and wound milieus can exhibit pronounced spatial pH gradients and temporal acidity shifts driven by hypoxia and lactate metabolism, varying with tissue type and perfusion status [ 45 54 63 65 27 71 73 This heterogeneity can lead to failure modes including false positives (premature release in mildly perturbed tissue), false negatives (under-release in hypo-inflammatory niches), and payload depletion before the critical therapeutic window. To mitigate these risks and discriminate between physiological and pathological levels of these stimuli, hydrogel systems can be engineered with (i) calibrated activation thresholds and buffer capacity tuning to confine responsiveness within pathological ranges [ 89 90 91 12 By incorporating molecular motifs that respond selectively to pH fluctuations, oxidative stress, or proteolytic activity, and by integrating multi-stimuli or feedback-controlled strategies, inflammation-responsive hydrogels can dynamically adapt to evolving wound environments. Their modular design offers a promising framework for tailoring drug release profiles to distinct phases of perioperative healing and inflammation. A concise comparison of these hydrogel classes is presented in Table 2 Figure 2 4. Anti-Inflammatory and Analgesic Payloads for Hydrogel Delivery Effective management of perioperative inflammation and pain is essential for optimal surgical recovery. Beyond alleviating discomfort, timely modulation of these responses facilitates tissue regeneration, prevents complications, and reduces the risk of chronic postsurgical pain. However, the conventional systemic administration of anti-inflammatory and analgesic drugs often suffers from poor tissue selectivity, narrow therapeutic windows, and significant systemic side effects, ultimately limiting their clinical efficacy [ 92 Inflammation-responsive hydrogels offer a compelling alternative by enabling the localized, sustained, and stimulus-adaptive delivery of therapeutic agents. These systems can encapsulate diverse payloads, including NSAIDs, corticosteroids, α 2 93 94 The following subsections examine the key classes of therapeutic payloads integrated into inflammation-responsive hydrogel systems with relevance to perioperative care. We first review NSAIDs and corticosteroids for inflammatory cascade suppression, followed by α 2 4.1. Non-Steroidal Anti-Inflammatory Drugs (NSAIDs) NSAIDs are widely used in perioperative care owing to their analgesic and anti-inflammatory properties. They reduce both pain and tissue inflammation by inhibiting COX enzymes and suppressing prostaglandin synthesis. However, systemic administration, whether oral, intravenous, or intramuscular, frequently results in adverse effects, such as gastrointestinal irritation, renal dysfunction, and cardiovascular risk, especially in elderly patients or those with comorbidities [ 6 95 Hydrogel-based NSAID delivery offers a localized and sustained alternative that may mitigate these systemic toxicities [ 96 18 A notable example is a dual pH- and ROS-responsive hydrogel composed of PAA-co-N-acryloxysuccinimide), carboxymethyl chitosan (CMCS), poly(hexamethylene guanidine), and manganese dioxide nanoparticles, which facilitated diclofenac release under inflammatory conditions. In an infected wound model, the system achieved 87.6% wound closure by day 6, promoted angiogenesis, and suppressed TNF-α and IL-1β compared to component-only and drug-free controls, supporting its potential for contaminated surgical sites [ 97 Another study utilized a Carbopol EZ-3 hydrogel containing ketoprofen, menthol, and surfactants, which enhanced dermal drug penetration and reduced carrageenan-induced paw edema in rats. Although this system lacked inflammation-responsiveness, it outperformed commercial diclofenac cream in terms of local anti-inflammatory efficacy [ 98 In a separate approach, a thermosensitive hydrogel composed of hyaluronic acid (HA) and poloxamer 407 was used to deliver ketoprofen-loaded transethosomes for intra-articular administration. In a rat osteoarthritis model, the system attenuated pro-inflammatory cytokines (TNF-α, IL-1β, IL-6, and IL-22) and preserved the cartilage structure, indicating its relevance to postoperative inflammation in orthopedic or arthroscopic settings [ 99 An MMP-13–responsive microsphere system utilizing HA methacrylate and cationic liposomes enabled enzyme-triggered celecoxib release. In vivo, it significantly reduced TNF-α and MMP-13 expression and improved joint histology relative to non-responsive and drug-free controls [ 100 Collectively, these examples demonstrate that inflammation-responsive hydrogels can improve NSAID pharmacokinetics, enhance the local anti-inflammatory efficacy, and reduce systemic toxicity. Although clinical translation is still in its early stages, these systems represent a promising addition to multimodal perioperative analgesic strategies. 4.2. Corticosteroids Corticosteroids are potent anti-inflammatory agents that are frequently employed in surgical settings to mitigate acute inflammation, reduce edema, and prevent fibrotic remodeling. Through the activation of glucocorticoid receptors and inhibition of transcription factors such as NF-κB and AP-1, they suppress pro-inflammatory cytokine production, attenuate leukocyte infiltration, and stabilize vascular permeability [ 101 102 Nevertheless, systemic or repeated local administration of corticosteroids is associated with adverse effects, including immunosuppression, delayed wound healing, and soft tissue atrophy [ 103 104 105 106 One example is a thermosensitive PEG–poly(ε-caprolactone)–PEG hydrogel loaded with dexamethasone-encapsulated micelles. This injectable formulation gelled in situ and showed sustained release for over 14 days. In a rat peritoneal adhesion model, it significantly reduced adhesion scores, suppressed inflammatory cell infiltration, and promoted mesothelial regeneration, outperforming free micelles and blank gels [ 107 In the spinal surgery context, a PEG-based DexaPatch was developed using 4-arm PEG–maleimide, poloxamer-derived dithiol crosslinkers, and PLGA microparticles for local dexamethasone delivery. The rehydrated patch demonstrated mechanical robustness and minimal swelling, making it suitable for use in confined surgical spaces. In a rabbit cervical discectomy model, it reduced prevertebral edema and fibrotic changes [ 108 Triamcinolone acetonide has also been incorporated into advanced composite hydrogels. A Janus Tough Adhesive system composed of alginate–polyacrylamide and a chitosan surface layer was loaded with triamcinolone microcrystals. In a rat Achilles tendon repair model, the hydrogel reduced scarring, inhibited neovascularization, and promoted M2 macrophage polarization [ 109 A more explicitly responsive system incorporated triamcinolone into a collagenase-degradable gelatin sheet crosslinked by dehydrothermal treatment. In a murine dorsal wound model, this hydrogel released the drug in response to elevated collagenase activity, suppressed myofibroblast infiltration, and reduced fibrosis compared to intradermal steroid injection or blank controls. While epithelialization was modestly delayed, the system promoted more uniform remodeling, indicating its potential utility in soft tissue surgery [ 110 Altogether, these examples underscore the potential of corticosteroid-loaded hydrogels to provide localized, sustained, and stimulus-adaptive anti-inflammatory therapy in perioperative settings. Platforms that incorporate enzyme-responsive or environmentally adaptive features may enhance therapeutic precision while minimizing systemic side effects. Corticosteroids may also be integrated into dual-function hydrogel systems with NSAIDs, anesthetics, or regenerative agents to support the coordinated control of inflammation, pain, and tissue remodeling [ 111 4.3. α 2 α 2 2 112 113 Dexmedetomidine, in particular, has shown broad therapeutic potential. Preclinical studies have demonstrated its capacity to suppress cytokine expression, reduce leukocyte infiltration, and preserve tissue architecture after surgical trauma [ 114 115 116 117 118 119 To address these limitations, hydrogel-based delivery systems have been developed to localize and sustain the release of α 2 120 Another platform integrated a clonidine-loaded thermoresponsive Pluronic F127 hydrogel with electrospun polycaprolactone nanofibers encapsulating ropivacaine. Upon perisciatic injection in rats, the composite system achieved prolonged sensory blockade (~32 h) with preserved motor function, outperforming free drug and single-component controls [ 121 These examples highlight the potential of hydrogel-mediated α 2 4.4. Biologics and Regenerative Factors Biological agents, including cytokine inhibitors and regenerative growth factors, offer dual therapeutic benefits in perioperative care by suppressing inflammation and promoting tissue repair. However, their systemic administration is often limited by their rapid degradation, poor bioavailability, and unintended immune responses [ 122 For cytokine inhibition, an MMP-responsive PEG hydrogel was developed by crosslinking an IL-1 receptor antagonist via cleavable peptide sequences. Upon MMP-1/2 activation, an IL-1 receptor antagonist was released to reduce neuroinflammation and protect the blood–brain barrier in a rat model of lipopolysaccharide-induced injury. Compared with uncoated or drug-free hydrogels, this platform improved neural interface outcomes [ 123 To target TNF-α, infliximab was embedded in a modular scaffold composed of polydimethylsiloxane and porous PVA hydrogel. This platform provided stable antibody release for over 30 days in mice, significantly reducing local inflammation without compromising bioactivity [ 124 Another approach utilized nanovesicles displaying TNF receptor 1 incorporated into a thermosensitive Pluronic F127 hydrogel. In murine burn models, this system decreased TNF-α and IL-6 expression while accelerating epithelial regeneration relative to controls [ 125 For regenerative applications, a bone morphogenetic protein (BMP)-2 delivery platform was created by combining mineral-coated microparticles with a chitosan–PEG hydrogel. In a rat calvarial defect model, this system provided sustained BMP-2 release for over 75 days and enhanced bone regeneration compared to free drug or blank gels [ 126 In a vascular regeneration strategy, a VEGF-loaded PEG–maleimide hydrogel was crosslinked with MMP-cleavable VPM peptides and functionalized with the GFOGER integrin-binding motif. In a radial bone defect model, this design enhanced angiogenesis and bone healing compared to soluble VEGF or non-degradable controls [ 127 Collectively, these examples demonstrate the versatility of hydrogel-based systems for delivering biologics with spatial and temporal precision. Although most platforms remain preclinical and are not fully inflammation-responsive, their modular architectures and enzyme-cleavable elements provide a foundation for next-generation therapies that dynamically respond to the surgical wound environment. Future efforts should focus on integrating multiple endogenous triggers to optimize immune modulation, fibrosis control, and regenerative support during postoperative recovery. 4.5. Dual and Synergistic Payload Systems Hydrogels that co-deliver analgesic and anti-inflammatory agents represent a powerful strategy for multimodal perioperative management. By combining local anesthetics with compounds such as α 2 128 A notable example involves a dual-responsive hydrogel composed of GelMA and oxidized CS crosslinked through both pH- and ROS-sensitive linkers. This platform enabled inflammation-triggered release of curcumin from embedded micelles, resulting in enhanced epithelialization, increased collagen deposition, IL-10 upregulation, and suppression of IL-6 expression and bacterial burden in infected wound models [ 83 In another study, ropivacaine-loaded mesoporous silica microspheres and dexmedetomidine were co-encapsulated within a self-healing HA hydrogel. Although not responsive to inflammatory stimuli, the system provided prolonged sensory and motor blockade in a rat sciatic nerve model without neurotoxicity [ 129 A thermogelling poloxamer-based hydrogel co-loaded with bupivacaine and ketorolac demonstrated less than 2% burst release, and dual-drug delivery was sustained over 14 days in vitro [ 130 Finally, a compartmentalized core–shell hydrogel was engineered to sequentially release antimicrobial and regenerative factors. The outer shell provided antibiotic delivery for 5 days, followed by sustained BMP-2 and transforming growth factor-β1 release from the inner core over 2 weeks. In a dental wound model, this architecture enhanced bacterial clearance and odontogenic regeneration compared with single-agent or blank controls [ 131 Collectively, these examples underscore the potential of dual and synergistic payload strategies to address the multifaceted needs of surgical wounds. Through co-delivery, sequential release, or structural compartmentalization, these systems enable more comprehensive perioperative modulation of pain, inflammation, and tissue healing. Further incorporation of inflammation-responsive elements will be critical for advancing these platforms toward clinical translation and precision-matched therapeutic delivery in dynamic postoperative environments. Inflammation-responsive hydrogels provide versatile platforms for the localized and adaptive delivery of anti-inflammatory and analgesic agents, including NSAIDs, corticosteroids, α 2 Table 3 5. Preclinical Applications in Perioperative Models Inflammation-responsive hydrogels have emerged as promising tools for managing postoperative pain and wound healing through localized spatiotemporally controlled drug delivery. These systems are typically designed to respond to the key features of surgical inflammation, including elevated ROS, acidic pH, and upregulated protease activity, enabling therapeutic release to be synchronized with pathological cues at the wound site [ 18 Although a few hydrogel platforms have demonstrated fully adaptive, inflammation-triggered release in surgical settings, an increasing number of preclinical studies have evaluated materials with partial or indirect responsiveness. These systems often outperform conventional delivery methods by improving drug retention, reducing systemic toxicity, and enhancing wound healing outcomes [ 132 This section highlights the representative applications of inflammation-responsive hydrogels in preclinical models of soft tissue, orthopedic, thoracic, and abdominal surgery. We also compare these systems to alternative delivery strategies, such as bolus injection and microparticle depots, to illustrate the relative advantages of wound-adaptive hydrogels for analgesia, immune regulation, and tissue regeneration. 5.1. Soft Tissue Surgery Soft tissue injuries, including incisional wounds, dental extractions, and abdominal wall repairs, represent frequent perioperative challenges characterized by acute inflammation, tissue disruption, and nociceptive pain [ 133 One representative system is a dual-responsive hydrogel composed of GelMA–CPBA and oxidized CS crosslinked through ROS-cleavable boronate esters and pH-sensitive Schiff bases. This matrix encapsulated curcumin-loaded micelles, enabling drug release under oxidative or acidic conditions. In a rat full-thickness infected wound model, the hydrogel promoted >95% closure by day 14, enhanced re-epithelialization, and induced M2 macrophage polarization relative to the free drug, micelle-only, and non-responsive hydrogel controls [ 83 In another study, a conformal ROS-scavenging hydrogel was developed using a self-assembling oligopeptide functionalized with caffeic acid. When applied to deep scald wounds in rats, the system reduced TNF-α and IL-6 levels while enhancing angiogenesis, collagen organization, and re-epithelialization [ 134 Protease-responsive systems have also shown promise. An ultraviolet-crosslinked hydrogel composed of atelocollagen, retaining triple-helix integrity, was engineered to degrade in response to MMP-9. In a diabetic full-thickness wound model, it accelerated closure and epidermal regeneration compared to commercial dressings [ 44 Altogether, these examples demonstrate that inflammation-responsive hydrogels, although often developed for non-surgical wound contexts, offer mechanistic advantages highly relevant to soft tissue surgery. Their capacity to modulate local inflammation, promote healing, and deliver drugs adaptively makes them promising candidates for future perioperative applications, pending rigorous validation in surgical models. 5.2. Orthopedic Surgery Orthopedic procedures, such as fracture repair, tendon reconstruction, and joint preservation, are frequently associated with prolonged inflammation characterized by oxidative stress, MMP activation, and immune dysregulation. These factors not only impair structural healing but also contribute to persistent postoperative pain and functional limitations [ 135 A representative platform involves a hydrogel composed of dopamine-modified HA and CMCS crosslinked via ROS-labile boronate esters and imine bonds. This matrix encapsulated dimethyl fumarate and enabled ROS-triggered release in a rat calvarial defect model, resulting in enhanced bone regeneration and suppression of TNF-α, IL-6, and IL-1β expression [ 136 Enzyme-responsive delivery was demonstrated using a PEG hydrogel cross-linked with MMP-cleavable GPLGIAGQ peptides and functionalized with phosphatidylserine. In a calvarial bone defect model, this system facilitated phosphatidylserine release, increased bone volume, and promoted M2 macrophage polarization while downregulating inflammatory cytokines [ 75 For cartilage protection, an ROS-sensitive hydrogel incorporating magnetite nanoparticles was designed to deliver MMP-13–targeting siRNA. In a rat osteoarthritis model, this system reduced synovitis, inhibited cartilage degradation, and preserved type II collagen, outperforming controls [ 137 A particularly innovative design integrated both biochemical and biomechanical responsiveness. A piezoelectric hydrogel composed of PVA, cellulose nanofibers, and polydopamine-coated barium titanate nanoparticles generated electrical stimulation in response to joint motion. In vitro, it promoted M2 macrophage polarization and tenogenic differentiation, and in a rat rotator cuff repair model, it enhanced tendon–bone integration [ 138 Finally, a dual pH- and ROS-responsive hydrogel composed of curcumin and cerium oxide nanoparticles encapsulated within a zeolitic imidazolate framework-8 was developed to prevent trauma-induced heterotopic ossification. In both murine and rat models, it suppressed aberrant osteogenesis by inhibiting the NF-κB and IL-17 pathways while preserving myogenic regeneration [ 139 Collectively, these examples highlight the translational potential of inflammation-responsive hydrogels in orthopedic surgery. By aligning therapeutic release with the evolving local microenvironment, these systems offer precise immunomodulation and regenerative support for bone, cartilage, and tendon repair. Further validation in clinically relevant surgical models will be essential to refine their use in perioperative settings. 5.3. Thoracic and Abdominal Surgery Thoracic and abdominal surgeries commonly provoke peri-neural and serosal inflammation, which contributes to postoperative adhesions, neuropathic pain, and organ dysfunction [ 140 141 In a representative thoracic application, a sprayable polypeptide hydrogel composed of poly-L-lysine and poly-L-glutamate was used as an anti-adhesive barrier in a rat thoracotomy model. The system reduced collagen deposition and pleural adhesion severity, and demonstrated intraoperative ease of use [ 142 A cardiothoracic strategy employed an ROS-responsive hydrogel composed of quaternized CMCS and tannic acid. This matrix delivered two agents, a mitochondrial antioxidant (S1QEL1.1) and an anti-fibrotic compound (FT011), in a staged, inflammation-triggered manner. In a rat model of myocardial ischemia–reperfusion, the system preserved the mitochondrial ultrastructure, improved cardiac function, and reduced inflammation relative to blank or single-agent controls [ 143 In a complementary approach, a multifunctional hydrogel integrated a photoadhesive PEG matrix with a conductive PEDOT:PSS–MXene mesh for secure vagus nerve electrode placement without sutures. In a myocardial infarction model, this system reduced perineural inflammation and prevented electrode displacement compared to commercial cuffs [ 144 In abdominal models, an ROS-degradable hydrogel formed by crosslinking succinylated HA–adipic dihydrazide and oxidized HA–epigallocatechin gallate released epigallocatechin gallate under oxidative conditions, reducing fibrosis and adhesion formation in a rat cecal abrasion model. The system promoted M2 macrophage polarization and suppressed TNF-α and inducible nitric oxide synthase expression, indicating dual immune and structural repair effects [ 145 Another ROS-responsive hydrogel, composed of phenylboronic acid–functionalized HA and zwitterionic sulfobetaine polymers, enabled sustained delivery of chlorogenic acid. This platform decreased ROS levels, fibroblast adhesion, and postoperative adhesions in vivo [ 146 Together, these studies illustrate the emerging role of inflammation-responsive hydrogels in thoracic and abdominal surgeries. By aligning drug delivery with peri-neural or serosal inflammation and, in some cases, integrating electronic or topographical modulation, these systems offer innovative strategies for reducing postoperative adhesions, controlling pain, and enhancing tissue regeneration. 5.4. Comparative Delivery Strategies in Preclinical Perioperative Models Traditional drug delivery methods in the perioperative setting, such as systemic injections or bolus administration, often lead to fluctuating drug concentrations, poor tissue specificity, and inadequate control of localized inflammation. These shortcomings can delay wound healing and increase the risk of chronic pain or fibrosis [ 147 148 One illustrative example comes from a rat sciatic nerve block model comparing bolus- and depot-based delivery. Lidocaine injected in saline produced approximately 2 h of analgesia, whereas a composite system combining lidocaine-loaded PLGA microspheres and a thermoresponsive poloxamer 407 hydrogel extended the block duration to 9 h [ 149 A more functionally adaptive system utilized staged release to optimize perioperative analgesia. Dexmedetomidine was encapsulated in biodegradable microspheres, while bupivacaine was dispersed within a hydrogel matrix. Dexmedetomidine was released first to induce local vasoconstriction, thereby reducing perfusion and prolonging the residence time of bupivacaine. In vivo, the system maintained analgesia for over 37 h [ 150 In contrast, inflammation-responsive systems provide more precise control by aligning drug release with pathophysiological cues. A hydrogel composed of dopamine-modified HA and CMCS crosslinked via ROS-cleavable boronate esters enabled the targeted release of dimethyl fumarate under oxidative stress. In a rat cranial defect model, the platform suppressed TNF-α, IL-6, and IL-1β expression while promoting bone regeneration compared to the blank and non-responsive controls [ 136 Similarly, a pH-sensitive hydrogel synthesized by grafting locust bean gum with poly(acrylamide-co-acrylic acid) was designed to release C-phycocyanin under alkaline wound conditions. In a full-thickness skin excision model, it accelerated wound closure, enhanced neovascularization, and reduced inflammatory cytokine levels relative to free drug and blank hydrogel controls [ 151 Compared with current perioperative gold-standard approaches, such as systemic opioids, NSAIDs, single-shot regional blocks, and conventional anti-inflammatory or wound management regimens, these preclinical hydrogel systems have demonstrated meaningful quantitative gains in therapeutic window and, in some cases, improvements in side-effect profile. For example, lidocaine delivered as a saline bolus typically provides ~2 h of analgesia in rodent sciatic block models, whereas depot-based hydrogels extend this to ~9 h [ 149 150 Table 4 152 Together, these comparative studies highlight the functional advantages of inflammation-responsive hydrogels over conventional delivery strategies. By synchronizing drug release with local pathological cues, these systems offer enhanced tissue specificity, sustained pharmacodynamics, and reduced systemic toxicity. Compared to bolus injections or inert depots, stimulus-adaptive hydrogels provide superior control, therapeutic precision, and potential for tailored perioperative interventions. Across a range of surgical models, including soft tissue, orthopedic, thoracic, and abdominal procedures, inflammation-responsive hydrogel systems have demonstrated significant potential for enhancing postoperative analgesia, immunomodulation, and tissue regeneration. By combining depot-like stability with pathophysiologically triggered release, these platforms offer advantages over traditional delivery methods in terms of duration of action, tissue specificity, and biocompatibility. Advancing stimulus-responsive chemistries, formulation strategies, and combinatory payload designs will be essential to accelerate clinical translation and optimize perioperative outcomes. A summary of the representative inflammation-responsive hydrogel platforms evaluated in preclinical perioperative models is provided in Table 5 6. Translational Outlook and Future Directions: From Proof-of-Concept to Surgical Integration Despite the growing interest in inflammation-responsive hydrogels for perioperative applications, their clinical translation remains in an early phase. As outlined in Section 1 Section 2 Section 3 Section 4 Section 5 18 153 However, several translational barriers remain to be overcome. Most preclinical evaluations have relied on static or chronic disease models, with limited validation in the physiologically dynamic and temporally complex environments of actual surgical procedures [ 16 18 22 154 24 26 155 To address these limitations, this section critically examines the current maturity of preclinical models, design compatibility of inflammation-responsive hydrogels with standard surgical workflows, and challenges related to biocompatibility, immune reactivity, and trigger fidelity. It also explores emerging strategies, such as biosensor-coupled feedback systems, artificial intelligence (AI)-guided formulation platforms, and multi-input logic gating, which may facilitate the clinical adoption and surgical integration of these next-generation therapeutic materials. 6.1. Translational Gaps and Preclinical Readiness Inflammation-responsive hydrogels have demonstrated promising therapeutic potential across various preclinical models by enabling drug release that dynamically aligns with the evolving wound microenvironment. However, their application in perioperative care remains largely exploratory. As discussed in Section 5.1 Section 5.2 Section 5.3 A central limitation lies in the focus on general wound healing outcomes, such as re-epithelialization, collagen deposition, and angiogenesis, rather than endpoints directly relevant to perioperative inflammation and pain control [ 16 18 Nonetheless, select preclinical investigations have illustrated the functional advantages of inflammation-adaptive hydrogel design. For example, an ROS-scavenging hydrogel delivering apelin-13 promoted M2 macrophage polarization and improved locomotor recovery in a rat spinal cord injury model [ 156 157 Despite these encouraging findings, most studies are constrained by limited follow-up durations (typically ≤7 days), restricting the evaluation of long-term therapeutic durability, late-phase inflammatory remodeling, and functional recovery. Surgical fidelity is often limited, with models failing to capture the full spectrum of perioperative injury factors and tissue responses observed in clinical settings. Methodological weaknesses are also common: many investigations rely on blank or untreated comparators rather than established perioperative standards, use small sample sizes that limit statistical power, and omit randomization or blinded outcome assessment. Furthermore, short observation windows and the absence of standardized, clinically relevant endpoints, such as validated nociceptive assays, longitudinal cytokine profiling, or pharmacokinetic comparisons, reduce the strength of the evidence base. Collectively, these limitations undermine statistical robustness, increase susceptibility to bias, and weaken both the translational validity and regulatory acceptability of current findings [ 23 158 Bridging these gaps will require a strategic shift from exploratory efficacy studies to perioperative evaluation pipelines grounded in clinically meaningful endpoints. Future research should incorporate validated pain metrics, dynamic immune profiling, retention and degradation kinetics, and comparative performance with approved perioperative therapies. Establishing a consensus set of benchmark parameters would further enable reproducible, cross-platform evaluation of inflammation-responsive hydrogels. Key recommended metrics include: Trigger fidelity—specificity and sensitivity to pathological pH, ROS, or protease thresholds. Release kinetics—under both simulated and in vivo perioperative inflammatory conditions. Mechanical stability and degradation—including timeline and identification of degradation byproducts. Inflammatory biomarker modulation—e.g., TNF-α, IL-6 at defined postoperative timepoints. Therapeutic window—duration of analgesic or anti-inflammatory effects compared with current clinical standards. Functional endpoints—standardized nociceptive assays, mobility scores, or tissue regeneration quality. Safety—assessment of local tissue compatibility and systemic toxicity. In parallel, the development of standardized surgical inflammation models incorporating clinically relevant injury mechanisms, such as electrocautery, ischemia–reperfusion, and multi-tissue handling, will be essential for robustly assessing hydrogel efficacy and safety. Such models, coupled with harmonized endpoint criteria, would improve reproducibility, facilitate head-to-head comparisons, and better align preclinical testing with the complex inflammatory milieu of real surgical settings. 6.2. Regulatory Compatibility and Surgical Integration To transition from preclinical innovation to clinical adoption, inflammation-responsive hydrogels must align with existing regulatory frameworks and integrate seamlessly into surgical workflows. Regulatory authorities, such as the U.S. FDA and the European Medicines Agency typically categorize these platforms, particularly those combining structural matrices with bioactive agents, as combination products. As such, they are subject to dual regulatory oversight for both device and pharmaceutical components [ 25 26 Encouragingly, many inflammation-responsive hydrogel platforms are based on clinically established polymers such as PEG, HA, and chitosan, materials already approved for drug depots, surgical sealants, and ophthalmic products [ 21 159 160 161 Equally critical is ensuring compatibility with the surgical workflow. Clinically deployable hydrogel systems must adopt formats amenable to intraoperative use, including injectable sols, thermogelling liquids, sprayable coatings, or brush-on precursors that polymerize or solidify in situ without requiring sutures or complex instrumentation [ 162 96 161 Despite substantial laboratory progress, relatively few inflammation-responsive hydrogels have successfully navigated critical translational milestones, including Good Manufacturing Practice (GMP)-compliant scale-up, ISO 10993 biocompatibility testing, and human factor evaluation in simulated surgical environments [ 23 24 Ultimately, successful clinical translation will require a balance between therapeutic efficacy, material sophistication, and practical usability. Hydrogel platforms that are modular, compositionally stable, and compatible with existing excipients, devices, and surgical workflows will be best positioned to advance from the bench to the bedside. Considering current regulatory requirements, manufacturing constraints, and the need for validation in clinically relevant surgical models, the earliest realistic timeline for initiating first-in-human trials of inflammation-responsive hydrogels in perioperative settings is likely within the next decade. This projection reflects the substantial time required to complete reproducible safety and efficacy studies under Good Laboratory Practice conditions, address trigger specificity, and engage regulatory agencies early to facilitate translational readiness and approval pathways. 6.3. Key Barriers: Biocompatibility and Responsiveness Although inflammation-responsive hydrogels offer a compelling strategy for targeted and adaptive drug delivery, their clinical translation is hindered by persistent technical and biological challenges [ 12 163 A central obstacle lies in tuning the degradation kinetics and drug release profiles to align with the temporal dynamics of postoperative inflammation. Responsive linkers must degrade within clinically relevant windows, typically spanning several hours to a few days, while avoiding premature or delayed activation. Overly sensitive materials risk responding to baseline physiological ROS or enzyme levels, whereas under-responsive systems may fail to deliver therapy during critical inflammatory phases. Calibrating these thresholds in vivo remains a significant challenge, particularly given the inter-tissue and inter-patient variability in inflammatory profiles. Mechanistically informed designs that leverage real-time profiling of wound biomarkers may enhance trigger specificity and improve therapeutic precision [ 164 A second major challenge concerns the complex immunological interactions of responsive hydrogel systems. While certain platforms support M2 macrophage polarization and contribute to inflammation resolution, others may provoke unintended immune activation owing to their degradation byproducts, nanoscale architecture, or crosslinking chemistries [ 165 166 167 Moreover, many responsive systems lack sufficient selectivity for pathological inflammation. For instance, ROS levels can be elevated due to ischemia, hypoxia, or basal metabolic activity, independent of overt inflammation, and MMPs play roles in both physiological and pathological tissue remodeling. This lack of specificity can result in off-target activation, uncoordinated drug release, and premature depletion of therapeutic payloads [ 168 90 91 Inter-individual variability adds an additional layer of complexity. Patient-specific factors such as age, comorbidities (e.g., diabetes, cardiovascular disease), immune status, and concurrent medications influence the perioperative inflammatory milieu and, consequently, the performance of responsive hydrogels. Addressing this heterogeneity may require modular or customizable formulations tailored to individual wound profiles. For example, older patients or those with metabolic disorders may exhibit prolonged low-grade inflammation, impaired angiogenesis, or altered cytokine trajectories, which could necessitate hydrogels with extended or staged release kinetics to sustain therapeutic coverage over an extended healing period [ 169 170 171 172 173 174 From a manufacturing and quality control standpoint, ensuring reproducible stimulus–response behavior across production batches remains a critical translational hurdle. Variability in raw material purity, crosslinking efficiency, and incorporation of responsive linkers can shift activation thresholds and alter release kinetics, undermining trigger fidelity. These risks are amplified for chemistries such as ROS-cleavable boronate esters, pH-sensitive imines, or MMP-degradable peptides, which may be sensitive to moisture, light, or sterilization [ 66 175 176 177 A further safety consideration unique to inflammation-responsive hydrogels is the potential for distinct degradation products and immune responses that are not typically encountered with conventional non-responsive depots. These systems often rely on stimulus-cleavable linkers such as thioketals, boronate esters, or protease-sensitive peptides. The degradation of these chemistries can yield byproducts with distinct chemical reactivity, solubility, or bioactivity, which may influence local tissue compatibility and systemic exposure [ 178 179 180 181 182 Overall, advancing inflammation-responsive hydrogels toward clinical reliability will necessitate rigorous optimization of trigger fidelity, immune compatibility, and temporal control. Mechanistically guided, clinically validated designs will be essential to bridge the gap between laboratory innovation and consistent performance in surgical settings. 6.4. Next-Generation Strategies for Precision Translation To address the challenges outlined in the previous sections, next-generation hydrogel platforms are embracing multifunctional and intelligent design principles aimed at enhancing translational precision. These emerging strategies integrate advances in materials science, bioengineering, and computational modeling to improve stimulus specificity, surgical usability, and therapeutic personalization [ 183 One promising direction is the development of modular hydrogel architectures that allow interchangeable components, such as stimulus-responsive linkers, drug reservoirs, and mechanical scaffolds, to be tailored to specific surgical applications. This design flexibility facilitates the rapid optimization of release kinetics, degradation rates, and immune interactions [ 184 12 Three-dimensional printing and biofabrication techniques further enable precise spatial control over hydrogel geometry, porosity, and drug distribution. Printed hydrogel dressings or implants can be engineered to conform to complex anatomical sites, incorporate stratified drug layers, or localize bioactive cues that guide differential tissue regeneration. These strategies are particularly relevant for reconstructive and vascular surgeries, where anatomical precision and biomechanical compatibility are critical [ 185 Transformative frontiers involve integration of biosensors into hydrogel matrices. These “smart” systems embed chemical or electronic sensors capable of detecting ROS, pH, or MMP levels in real time, enabling closed-loop feedback-controlled drug release. Prototype platforms have demonstrated their ability to detect cytokine surges and electronically trigger drug diffusion. Although not yet validated in surgical settings, such technologies offer significant potential for dynamic perioperative modulation [ 186 In parallel, AI approaches, including computational modeling and machine learning are increasingly employed to accelerate hydrogel design. Algorithms trained on polymer structures, stimulus–response kinetics, and biological outcomes have been used to predict key parameters such as mechanical strength, degradation rates, and drug release profiles, thereby reducing the number of experimental iterations required for formulation development [ 187 188 Another promising avenue involves logic-gated and multi-stimuli-responsive hydrogels. These systems require the concurrent presence of two or more pathological signals, such as low pH and elevated MMPs, to trigger drug release. Inspired by synthetic biology, these AND-gated constructs enhance delivery precision by reducing premature activation and improving spatial selectivity. Although initial demonstrations have focused on tumor and chronic wound models, adaptation to surgical contexts is actively underway [ 189 While not yet represented in standardized translational frameworks, extending the design of inflammation-responsive hydrogels to encompass microbiological control represents a strategically significant translational direction. Surgical site infections remain a major source of postoperative morbidity, with bacterial adhesion and biofilm formation posing persistent challenges to implanted biomaterials [ 190 191 192 Together, these next-generation strategies represent a paradigm shift in hydrogel development from passive carriers to intelligent, adaptive therapeutic systems. Rather than incremental advances, the field is converging toward integrated platforms that combine biosensing, logic-based responsiveness, and personalized programmability. These technologies constitute a critical step toward realizing the clinical potential of inflammation-responsive hydrogels in perioperative care. While certain inflammation-responsive hydrogel systems, particularly those with broad-spectrum anti-inflammatory or analgesic payloads, could function as standalone interventions in select surgical scenarios, their greatest translational potential is likely within multimodal perioperative care pathways [ 193 A critical next step for the field will be a preclinical study designed to address the most important translational question: can inflammation-responsive hydrogels selectively activate in the presence of pathological inflammatory cues while remaining inert under physiological conditions, across diverse surgical models and patient-relevant comorbidity profiles? This question is central to demonstrating both the safety and efficacy required for clinical adoption. Such a study should include side-by-side comparisons with non-responsive depots and bolus delivery of the same payload, enabling quantitative assessment of spatial targeting, dosing precision, and safety. Evaluation should extend beyond conventional efficacy endpoints to incorporate longitudinal biomarker tracking, degradation product characterization, and immune profiling, ensuring that activation thresholds and therapeutic windows are validated against clinically relevant perioperative ranges. Addressing this question would generate decisive translational evidence and provide a rational foundation for the design of first-in-human trials. In conclusion, while inflammation-responsive hydrogels are conceptually aligned with the physiological demands of surgical recovery, their successful deployment hinges on overcoming several translational bottlenecks. As outlined in Section 6 Table 6 7. Conclusions Inflammation-responsive hydrogels represent a transformative paradigm in perioperative therapy, offering localized and spatiotemporally controlled delivery of analgesic and anti-inflammatory agents in direct response to dynamic wound cues. As outlined in this review, these systems, engineered to respond to stimuli such as ROS, acidic pH, and matrix-degrading enzymes, address the key limitations of conventional approaches, including systemic toxicity, inconsistent drug exposure, and poor tissue targeting. A growing body of preclinical evidence supports their feasibility across diverse surgical models, from soft tissue repair to orthopedic and thoracoabdominal procedures. Despite these advances, its clinical translation remains in its infancy. Most platforms have not yet been evaluated in realistic surgical environments, and current preclinical studies often prioritize structural endpoints, such as wound closure and histology, over functional outcomes related to pain control, immune modulation, and pharmacokinetics. The incorporation of responsive mechanisms into clinically viable and GMP-compatible hydrogel systems poses significant technical and regulatory challenges. Additional barriers include interpatient variability in inflammatory signatures, difficulty in fine-tuning release kinetics, potential immune responses to degradation products, and a lack of validated real-time biomarkers for trigger fidelity. Looking ahead, the successful implementation of inflammation-responsive hydrogels will depend on bridging innovative material science with a clinically grounded design. Future platforms must integrate modular architectures, biosensor-mediated feedback, logic-based activation schemes, and AI-guided formulations to accommodate the heterogeneity of surgical wounds and patient-specific immune responses. Realizing this vision will require sustained interdisciplinary collaboration among biomaterial scientists, surgeons, immunologists, and regulatory experts. If these challenges can be overcome, inflammation-responsive hydrogels hold immense potential to transform perioperative care, enabling therapeutics that are not only responsive and intelligent, but also safe, scalable, and seamlessly integrated into surgical workflows. By aligning drug delivery with the biology of wound healing, these systems may not only redefine the standard of care in surgical recovery but also usher in a new era of precision biomaterials powered by dynamic, biomarker-responsive designs. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, Y.E.M., J.-O.J. and H.C.; methodology, Y.E.M., J.-O.J. and H.C.; software, H.C.; validation, Y.E.M., J.-O.J. and H.C.; formal analysis, Y.E.M., J.-O.J. and H.C.; investigation, Y.E.M., J.-O.J. and H.C.; resources, H.C.; data curation, H.C.; writing—original draft preparation, Y.E.M.; writing—review and editing, Y.E.M., J.-O.J. and H.C.; visualization, Y.E.M., J.-O.J. and H.C.; supervision, H.C.; project administration, H.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: NSAID Non-steroidal anti-inflammatory drug ROS Reactive oxygen species IL Interleukin TNF-α Tumor necrosis factor-α NE Neutrophil elastase MMP Matrix metalloproteinase ECM Extracellular matrix COX Cyclooxygenase PAA Poly(acrylic acid) PEG Polyethylene glycol PVA Poly(vinyl alcohol) PLGA Poly(lactic-co-glycolic acid) GelMA Gelatin methacryloyl VEGF Vascular endothelial growth factor OCP Octacalcium phosphate CPBA Carboxyphenylboronic acid CS Chondroitin sulfate CMCS Carboxymethyl chitosan HA Hyaluronic Acid BMP Bone morphogenetic protein AI Artificial intelligence FDA Food and Drug Administration ISO International Organization for Standardization GMP Good Manufacturing Practice References 1. Margraf A. Ludwig N. Zarbock A. Rossaint J. Systemic Inflammatory Response Syndrome After Surgery: Mechanisms and Protection Anesth. Analg. 2020 131 1693 1707 10.1213/ANE.0000000000005175 33186158 2. Bain C.R. Myles P.S. Martin C. Wallace S. Shulman M.A. Corcoran T. Bellomo R. Peyton P. Story D.A. Leslie K. Postoperative systemic inflammation after major abdominal surgery: Patient-centred outcomes Anaesthesia 2023 78 1365 1375 10.1111/anae.16104 37531295 PMC10952313 3. Maisat W. Yuki K. Narrative review of systemic inflammatory response mechanisms in cardiac surgery and immunomodulatory role of anesthetic agents Ann. Card. Anaesth. 2023 26 133 142 10.4103/aca.aca_147_22 37706376 PMC10284469 4. Salamanna F. Tedesco G. Sartori M. Contartese D. Asunis E. Cini C. Veronesi F. Martikos K. Fini M. Giavaresi G. Clinical Outcomes and Inflammatory Response to the Enhanced Recovery After Surgery (ERAS) Protocol in Adolescent Idiopathic Scoliosis Surgery: An Observational Study Int. J. Mol. Sci. 2025 26 3723 10.3390/ijms26083723 40332332 PMC12027706 5. Chou R. Gordon D.B. de Leon-Casasola O.A. Rosenberg J.M. Bickler S. Brennan T. Carter T. Cassidy C.L. Chittenden E.H. Degenhardt E. Management of Postoperative Pain: A Clinical Practice Guideline From the American Pain Society, the American Society of Regional Anesthesia and Pain Medicine, and the American Society of Anesthesiologists’ Committee on Regional Anesthesia, Executive Committee, and Administrative Council J. Pain 2016 17 131 157 10.1016/j.jpain.2015.12.008 26827847 6. Komatsu R. Singleton M.D. Dinges E.M. Wu J. Bollag L.A. Association between perioperative non-steroidal anti-inflammatory drug use and cardiovascular complications after non-cardiac surgery in older adult patients JA Clin. Rep. 2024 10 29 10.1186/s40981-024-00712-5 38687413 PMC11061052 7. Ericson-Neilsen W. Kaye A.D. Steroids: Pharmacology, complications, and practice delivery issues Ochsner J. 2014 14 203 207 24940130 PMC4052587 8. Al-Saeed A. Gastrointestinal and Cardiovascular Risk of Nonsteroidal Anti-inflammatory Drugs Oman Med. J. 2011 26 385 391 10.5001/omj.2011.101 22253945 PMC3251190 9. Shanthanna H. Ladha K.S. Kehlet H. Joshi G.P. Perioperative Opioid Administration Anesthesiology 2021 134 645 659 10.1097/ALN.0000000000003572 32991672 10. Rose L.F. Chan R.K. The Burn Wound Microenvironment Adv. Wound Care 2016 5 106 118 10.1089/wound.2014.0536 PMC4779284 26989577 11. Capobianco A. Cottone L. Monno A. Manfredi A.A. Rovere-Querini P. The peritoneum: Healing, immunity, and diseases J. Pathol. 2017 243 137 147 10.1002/path.4942 28722107 12. Lu P. Ruan D. Huang M. Tian M. Zhu K. Gan Z. Xiao Z. Harnessing the potential of hydrogels for advanced therapeutic applications: Current achievements and future directions Sig. Transduct. Target. Ther. 2024 9 166 10.1038/s41392-024-01852-x PMC11214942 38945949 13. Thang N.H. Chien T.B. Cuong D.X. Polymer-Based Hydrogels Applied in Drug Delivery: An Overview Gels 2023 9 523 10.3390/gels9070523 37504402 PMC10379988 14. Patroklou G. Triantafyllopoulou E. Goula P.-E. Karali V. Chountoulesi M. Valsami G. Pispas S. Pippa N. pH-Responsive Hydrogels: Recent Advances in Pharmaceutical Applications Polymers 2025 17 1451 10.3390/polym17111451 40508694 PMC12156964 15. Liu J. Jia B. Li Z. Li W. Reactive oxygen species-responsive polymer drug delivery systems Front. Bioeng. Biotechnol. 2023 11 1115603 10.3389/fbioe.2023.1115603 36815896 PMC9932603 16. Noddeland H.K. Lind M. Jensen L.B. Petersson K. Skak-Nielsen T. Larsen F.H. Malmsten M. Heinz A. Design and characterization of matrix metalloproteinase-responsive hydrogels for the treatment of inflammatory skin diseases Acta Biomater. 2023 157 149 161 10.1016/j.actbio.2022.12.015 36526241 17. Pourjavadi A. Heydarpour R. Tehrani Z.M. Multi-stimuli-responsive hydrogels and their medical applications New J. Chem. 2021 45 15705 15717 10.1039/D1NJ02260A 18. Yu H. Gao R. Liu Y. Fu L. Zhou J. Li L. Stimulus-Responsive Hydrogels as Drug Delivery Systems for Inflammation Targeted Therapy Adv. Sci. 2024 11 e2306152 10.1002/advs.202306152 PMC10767459 37985923 19. Pandey V. Pandey T. A Mechanistic Understanding of Reactive Oxygen Species (ROS)-Responsive Bio-Polymeric Nanoparticles: Current State, Challenges and Future Toward Precision Therapeutics Biopolymers 2025 116 e70027 10.1002/bip.70027 40370134 20. Xue H. Zhu C. Wang Y. Gu Q. Shao Y. Jin A. Zhang X. Lei L. Li Y. Stimulus-responsive cellulose hydrogels in biomedical applications and challenges Mater. Today Bio 2025 32 101814 10.1016/j.mtbio.2025.101814 PMC12098173 40416785 21. Zhao J. Qiu P. Wang Y. Wang Y. Zhou J. Zhang B. Zhang L. Gou D. Chitosan-based hydrogel wound dressing: From mechanism to applications, a review Int. J. Biol. Macromol. 2023 244 125250 10.1016/j.ijbiomac.2023.125250 37307982 22. Wang Z. Ye Q. Yu S. Akhavan B. Poly Ethylene Glycol (PEG)-Based Hydrogels for Drug Delivery in Cancer Therapy: A Comprehensive Review Adv. Healthc. Mater. 2023 12 2300105 10.1002/adhm.202300105 37052256 PMC11468892 23. Correa S. Grosskopf A.K. Lopez Hernandez H. Chan D. Yu A.C. Stapleton L.M. Appel E.A. Translational Applications of Hydrogels Chem. Rev. 2021 121 11385 11457 10.1021/acs.chemrev.0c01177 33938724 PMC8461619 24. Jurczak K.M. Van Der Boon T.A.B. Devia-Rodriguez R. Schuurmann R.C.L. Sjollema J. Van Huizen L. De Vries J.P.P.M. Van Rijn P. Recent regulatory developments in EU Medical Device Regulation and their impact on biomaterials translation Bioeng. Transl. Med. 2025 10 e10721 10.1002/btm2.10721 40060767 PMC11883120 25. Reis M.E. Bettencourt A. Ribeiro H.M. The regulatory challenges of innovative customized combination products Front. Med. 2022 9 821094 10.3389/fmed.2022.821094 PMC9354569 35935795 26. Tettey F. Parupelli S.K. Desai S. A Review of Biomedical Devices: Classification, Regulatory Guidelines, Human Factors, Software as a Medical Device, and Cybersecurity Biomed. Mater. Devices 2024 2 316 341 10.1007/s44174-023-00113-9 27. Muire P.J. Mangum L.H. Wenke J.C. Time Course of Immune Response and Immunomodulation During Normal and Delayed Healing of Musculoskeletal Wounds Front. Immunol. 2020 11 1056 10.3389/fimmu.2020.01056 32582170 PMC7287024 28. Caballero-Herrero M.J. Jumilla E. Buitrago-Ruiz M. Valero-Navarro G. Cuevas S. Role of Damage-Associated Molecular Patterns (DAMPS) in the Postoperative Period after Colorectal Surgery Int. J. Mol. Sci. 2023 24 3862 10.3390/ijms24043862 36835273 PMC9958549 29. Ma M. Jiang W. Zhou R. DAMPs and DAMP-sensing receptors in inflammation and diseases Immunity 2024 57 752 771 10.1016/j.immuni.2024.03.002 38599169 30. Raziyeva K. Kim Y. Zharkinbekov Z. Kassymbek K. Jimi S. Saparov A. Immunology of Acute and Chronic Wound Healing Biomolecules 2021 11 700 10.3390/biom11050700 34066746 PMC8150999 31. Megha K.B. Joseph X. Akhil V. Mohanan P.V. Cascade of immune mechanism and consequences of inflammatory disorders Phytomedicine 2021 91 153712 10.1016/j.phymed.2021.153712 34511264 PMC8373857 32. Wilgus T.A. Roy S. McDaniel J.C. Neutrophils and Wound Repair: Positive Actions and Negative Reactions Adv. Wound Care 2013 2 379 388 10.1089/wound.2012.0383 24527354 PMC3763227 33. Krzyszczyk P. Schloss R. Palmer A. Berthiaume F. The Role of Macrophages in Acute and Chronic Wound Healing and Interventions to Promote Pro-wound Healing Phenotypes Front. Physiol. 2018 9 419 10.3389/fphys.2018.00419 29765329 PMC5938667 34. Yan L. Wang J. Cai X. Liou Y.-C. Shen H.-M. Hao J. Huang C. Luo G. He W. Macrophage plasticity: Signaling pathways, tissue repair, and regeneration MedComm 2024 5 e658 10.1002/mco2.658 39092292 PMC11292402 35. Paruk F. Chausse J.M. Monitoring the post surgery inflammatory host response J. Emerg. Crit. Care Med. 2019 3 47 10.21037/jeccm.2019.08.06 36. Ortega-Gómez A. Perretti M. Soehnlein O. Resolution of inflammation: An integrated view EMBO Mol. Med. 2013 5 661 674 10.1002/emmm.201202382 23592557 PMC3662311 37. Nauta T.D. Van Hinsbergh V.W.M. Koolwijk P. Hypoxic Signaling During Tissue Repair and Regenerative Medicine Int. J. Mol. Sci. 2014 15 19791 19815 10.3390/ijms151119791 25365172 PMC4264139 38. Matsuda M. Huh Y. Ji R.R. Roles of inflammation, neurogenic inflammation, and neuroinflammation in pain J. Anesth. 2019 33 131 139 10.1007/s00540-018-2579-4 30448975 PMC6813778 39. Pinho-Ribeiro F.A. Verri W.A. Jr. Chiu I.M. Nociceptor Sensory Neuron-Immune Interactions in Pain and Inflammation Trends Immunol. 2017 38 5 19 10.1016/j.it.2016.10.001 27793571 PMC5205568 40. Hwang S.-M. Chung G. Kim Y.H. Park C.-K. The Role of Maresins in Inflammatory Pain: Function of Macrophages in Wound Regeneration Int. J. Mol. Sci. 2019 20 5849 10.3390/ijms20235849 31766461 PMC6928948 41. Butenko S. Nagalla R.R. Guerrero-Juarez C.F. Palomba F. David L.-M. Nguyen R.Q. Gay D. Almet A.A. Digman M.A. Nie Q. Hydrogel crosslinking modulates macrophages, fibroblasts, and their communication, during wound healing Nat. Commun. 2024 15 6820 10.1038/s41467-024-50072-y 39122702 PMC11315930 42. Dong Y. Wang Z. ROS-scavenging materials for skin wound healing: Advancements and applications Front. Bioeng. Biotechnol. 2023 11 1304835 10.3389/fbioe.2023.1304835 38149175 PMC10749972 43. Liang R. Pan R. He L. Dai Y. Jiang Y. He S. Li B. Li Y. Decellularized Extracellular Matrices for Skin Wound Treatment Materials 2025 18 2752 10.3390/ma18122752 40572885 PMC12194566 44. Tronci G. Yin J. Holmes R.A. Liang H. Russell S.J. Wood D.J. Protease-sensitive atelocollagen hydrogels promote healing in a diabetic wound model J. Mater. Chem. B 2016 4 7249 7258 10.1039/C6TB02268E 32263727 45. Schreml S. Meier R.J. Kirschbaum M. Kong S.C. Gehmert S. Felthaus O. Küchler S. Sharpe J.R. Wöltje K. Weiß K.T. Luminescent dual sensors reveal extracellular pH-gradients and hypoxia on chronic wounds that disrupt epidermal repair Theranostics 2014 4 721 735 10.7150/thno.9052 24883122 PMC4038754 46. Zhu Y.-J. Chen F. pH-Responsive Drug-Delivery Systems Chem. Asian J. 2015 10 284 305 10.1002/asia.201402715 25303435 47. Nguyen G.T. Green E.R. Mecsas J. Neutrophils to the ROScue: Mechanisms of NADPH Oxidase Activation and Bacterial Resistance Front. Cell. Infect. Microbiol. 2017 7 373 10.3389/fcimb.2017.00373 28890882 PMC5574878 48. Minehan R.L. Del Borgo M.P. Controlled Release of Therapeutics From Enzyme-Responsive Biomaterials Front. Biomater. Sci. 2022 1 916985 10.3389/fbiom.2022.916985 49. Abune L. Davis B. Wang Y. Aptamer-functionalized hydrogels: An emerging class of biomaterials for protein delivery, cell capture, regenerative medicine, and molecular biosensing Wiley Interdiscip. Rev. Nanomed. Nanobiotechnol. 2021 13 e1731 10.1002/wnan.1731 34132055 PMC8526380 50. Ryan A.K. Rahman S. Williams R.M. Optical Aptamer-Based Cytokine Nanosensor Detects Macrophage Activation by Bacterial Toxins ACS Sens. 2024 9 3697 3706 10.1021/acssensors.4c00887 38934367 PMC11287749 51. Liu Y. Liu F. Zeng Y. Lin L. Yu H. Zhang S. Yang W. Hydrogel systems for spatiotemporal controlled delivery of immunomodulators: Engineering the tumor immune microenvironment for enhanced cancer immunotherapy Front. Cell Dev. Biol. 2024 12 1514595 10.3389/fcell.2024.1514595 39735340 PMC11681625 52. Manshor M.R. Alli Y.A. Anuar H. Ejeromedoghene O. Omotola E.O. Suhr J. 4D printing: Historical evolution, computational insights and emerging applications Mater. Sci. Eng. B 2023 295 116567 10.1016/j.mseb.2023.116567 53. Lui Y.S. Sow W.T. Tan L.P. Wu Y. Lai Y. Li H. 4D printing and stimuli-responsive materials in biomedical aspects Acta Biomater. 2019 92 19 36 10.1016/j.actbio.2019.05.005 31071476 54. Haller H.L. Sander F. Popp D. Rapp M. Hartmann B. Demircan M. Nischwitz S.P. Kamolz L.P. Oxygen, pH, Lactate, and Metabolism-How Old Knowledge and New Insights Might Be Combined for New Wound Treatment Medicina 2021 57 1190 10.3390/medicina57111190 34833408 PMC8617754 55. Gannimani R. Walvekar P. Naidu V.R. Aminabhavi T.M. Govender T. Acetal containing polymers as pH-responsive nano-drug delivery systems J. Control. Release 2020 328 736 761 10.1016/j.jconrel.2020.09.044 32980419 56. Wang J. Wang X. Yan G. Fu S. Tang R. pH-sensitive nanogels with ortho ester linkages prepared via thiol-ene click chemistry for efficient intracellular drug release J. Colloid. Interface Sci. 2017 508 282 290 10.1016/j.jcis.2017.08.051 28843107 57. Xu J. Liu Y. Hsu S.-h. Hydrogels Based on Schiff Base Linkages for Biomedical Applications Molecules 2019 24 3005 10.3390/molecules24163005 31430954 PMC6720009 58. Liu Q. Xi G. Wu T. Li P. Zhan P. Liu N. Wu Z. Preparation of pH-Sensitive Poly (N-(2-Hydroxyethyl) Acrylamide-co-acrylic Acid) Hydrogels and Their Performance Gels 2025 11 241 10.3390/gels11040241 40277677 PMC12027044 59. Zarur M. Seijo-Rabina A. Goyanes A. Concheiro A. Alvarez-Lorenzo C. pH-responsive scaffolds for tissue regeneration: In vivo performance Acta Biomater. 2023 168 22 41 10.1016/j.actbio.2023.07.025 37482146 60. Cicuéndez M. Doadrio J.C. Hernández A. Portolés M.T. Izquierdo-Barba I. Vallet-Regí M. Multifunctional pH sensitive 3D scaffolds for treatment and prevention of bone infection Acta Biomater. 2018 65 450 461 10.1016/j.actbio.2017.11.009 29127064 61. Pappalardo R. Boffito M. Cassino C. Caccamo V. Chiono V. Ciardelli G. Schiff-Base Cross-Linked Hydrogels Based on Properly Synthesized Poly(ether urethane)s as Potential Drug Delivery Vehicles in the Biomedical Field: Design and Characterization ACS Omega 2024 9 45774 45788 10.1021/acsomega.4c03157 39583672 PMC11579714 62. Hosseinzadeh H. Controlled release of diclofenac sodium from pH-responsive carrageenan-g-poly (acrylic acid) superabsorbent hydrogel J. Chem. Sci. 2010 122 651 659 10.1007/s12039-010-0100-1 63. Ukaegbu K. Allen E. Svoboda K.K.H. Reactive Oxygen Species and Antioxidants in Wound Healing: Mechanisms and Therapeutic Potential Int. Wound. J. 2025 22 e70330 10.1111/iwj.70330 40288766 PMC12034374 64. Hunt M. Torres M. Bachar-Wikstrom E. Wikstrom J.D. Cellular and molecular roles of reactive oxygen species in wound healing Commun. Biol. 2024 7 1534 10.1038/s42003-024-07219-w 39562800 PMC11577046 65. Rinaldi A. Caraffi R. Grazioli M.V. Oddone N. Giardino L. Tosi G. Vandelli M.A. Calzà L. Ruozi B. Duskey J.T. Applications of the ROS-Responsive Thioketal Linker for the Production of Smart Nanomedicines Polymers 2022 14 687 10.3390/polym14040687 35215600 PMC8874672 66. Terriac L. Helesbeux J.-J. Maugars Y. Guicheux J. Tibbitt M.W. Delplace V. Boronate Ester Hydrogels for Biomedical Applications: Challenges and Opportunities Chem. Mater. 2024 36 6674 6695 10.1021/acs.chemmater.4c00507 39070669 PMC11270748 67. Saravanakumar G. Kim J. Kim W.J. Reactive-Oxygen-Species-Responsive Drug Delivery Systems: Promises and Challenges Adv. Sci. 2017 4 1600124 10.1002/advs.201600124 PMC5238745 28105390 68. An Z. Zhang L. Liu Y. Zhao H. Zhang Y. Cao Y. Zhang Y. Pei R. Injectable thioketal-containing hydrogel dressing accelerates skin wound healing with the incorporation of reactive oxygen species scavenging and growth factor release Biomater. Sci. 2021 10 100 113 10.1039/D1BM01179K 34792044 69. Wang Y. Wu Y. Long L. Yang L. Fu D. Hu C. Kong Q. Wang Y. Inflammation-Responsive Drug-Loaded Hydrogels with Sequential Hemostasis, Antibacterial, and Anti-Inflammatory Behavior for Chronically Infected Diabetic Wound Treatment ACS Appl. Mater. Interfaces 2021 13 33584 33599 10.1021/acsami.1c09889 34240605 70. Yang C. Zhu C. Li Y. Li Z. Zhang Z. Xu J. Chen M. Li R. Liu S. Wu Y. Injectable selenium-containing polymeric hydrogel formulation for effective treatment of myocardial infarction Front. Bioeng. Biotechnol. 2022 10 912562 10.3389/fbioe.2022.912562 36032710 PMC9403312 71. Wang Y. Zheng L. Zhang L. Tai Y. Lin X. Cai Z. Roles of MMP-2 and MMP-9 and their associated molecules in the pathogenesis of keloids: A comprehensive review Front. Pharmacol. 2024 15 1444653 10.3389/fphar.2024.1444653 39654616 PMC11625567 72. Chen W. Zhou Z. Chen D. Li Y. Zhang Q. Su J. Bone Regeneration Using MMP-Cleavable Peptides-Based Hydrogels Gels 2021 7 199 10.3390/gels7040199 34842679 PMC8628702 73. Zeng W. Song Y. Wang R. He R. Wang T. Neutrophil elastase: From mechanisms to therapeutic potential J. Pharm. Anal. 2023 13 355 366 10.1016/j.jpha.2022.12.003 37181292 PMC10173178 74. Qi Z. Yan Z. Tan G. Kundu S.C. Lu S. Smart Responsive Microneedles for Controlled Drug Delivery Molecules 2023 28 7411 10.3390/molecules28217411 37959830 PMC10649748 75. Zhang M. Yu T. Li J. Yan H. Lyu L. Yu Y. Yang G. Zhang T. Zhou Y. Wang X. Matrix Metalloproteinase-Responsive Hydrogel with On-Demand Release of Phosphatidylserine Promotes Bone Regeneration Through Immunomodulation Adv. Sci. 2024 11 2306924 10.1002/advs.202306924 38460178 PMC11132073 76. Cook A.B. Palange A. Schlich M. Bellotti E. Brahmachari S. Di Francesco M. Decuzzi P. Matrix metalloproteinase responsive hydrogel microplates for programmed killing of invasive tumour cells RSC Appl. Polym. 2023 1 19 29 10.1039/D3LP00057E 38013908 PMC10540463 77. Dzierżyńska M. Sawicka J. Deptuła M. Sosnowski P. Sass P. Peplińska B. Pietralik-Molińska Z. Fularczyk M. Kasprzykowski F. Zieliński J. Release systems based on self-assembling RADA16-I hydrogels with a signal sequence which improves wound healing processes Sci. Rep. 2023 13 6273 10.1038/s41598-023-33464-w 37072464 PMC10113214 78. Wang Y. Deng C. Ding Y. Huang S. Chen S. Huang H. Yang S. Xiao F. Metalloproteinase-responsive gelatin/polylysine hydrogel microneedles for on-demand curcumin delivery in bacteria-infected wound healing Colloids Surf. B Biointerfaces 2025 254 114797 10.1016/j.colsurfb.2025.114797 40398273 79. Xin H. Maruf D.S.A.A. Akin-Ige F. Amin S. Stimuli-responsive hydrogels for skin wound healing and regeneration Emerg. Mater. 2024 8 1339 1356 10.1007/s42247-024-00930-8 80. Ruskowitz E.R. Comerford M.P. Badeau B.A. DeForest C.A. Logical stimuli-triggered delivery of small molecules from hydrogel biomaterials Biomater. Sci. 2019 7 542 546 10.1039/C8BM01304G 30556545 81. Bordbar-Khiabani A. Kovrlija I. Locs J. Loca D. Gasik M. Octacalcium Phosphate-Laden Hydrogels on 3D-Printed Titanium Biomaterials Improve Corrosion Resistance in Simulated Biological Media Int. J. Mol. Sci. 2023 24 13135 10.3390/ijms241713135 37685942 PMC10487990 82. Bressler E.M. Adams S. Liu R. Colson Y.L. Wong W.W. Grinstaff M.W. Boolean logic in synthetic biology and biomaterials: Towards living materials in mammalian cell therapeutics Clin. Transl. Med. 2023 13 e1244 10.1002/ctm2.1244 37386762 PMC10310979 83. Wang J. Lin Y. Fan H. Cui J. Wang Y. Wang Z. ROS/pH Dual-Responsive Hydrogel Dressings Loaded with Amphiphilic Structured Nano Micelles for the Repair of Infected Wounds Int. J. Nanomed. 2025 20 8119 8142 10.2147/IJN.S522589 PMC12205371 40584783 84. Cicha I. Priefer R. Severino P. Souto E.B. Jain S. Biosensor-Integrated Drug Delivery Systems as New Materials for Biomedical Applications Biomolecules 2022 12 1198 10.3390/biom12091198 36139035 PMC9496590 85. Roost K. Stuber A. Wei K. De Lapeyrière M. Yang K. Gantenbein V. Pané S. Corbeski I. Maniura-Weber K. Nakatsuka N. Spatially Controlled 3-D Multiplexed Aptamer Patterning in Hydrogels Adv. Mater. Interfaces 2025 2400986 10.1002/admi.202400986 86. Guo X. Cheng Y. Zhao X. Luo Y. Chen J. Yuan W.-E. Advances in redox-responsive drug delivery systems of tumor microenvironment J. Nanobiotechnol. 2018 16 74 10.1186/s12951-018-0398-2 PMC6151045 30243297 87. Jiao C. Obst F. Geisler M. Che Y. Richter A. Appelhans D. Gaitzsch J. Voit B. Reversible Protein Capture and Release by Redox-Responsive Hydrogel in Microfluidics Polymers 2022 14 267 10.3390/polym14020267 35054674 PMC8780672 88. Khadka B. Lee B. Kim K.-T. Drug Delivery Systems for Personal Healthcare by Smart Wearable Patch System Biomolecules 2023 13 929 10.3390/biom13060929 37371509 PMC10295889 89. Cook A.B. Decuzzi P. Harnessing Endogenous Stimuli for Responsive Materials in Theranostics ACS Nano 2021 15 2068 2098 10.1021/acsnano.0c09115 33555171 PMC7905878 90. Luo C. He L. Chen F. Fu T. Zhang P. Xiao Z. Liu Y. Tan W. Stimulus-responsive nanomaterials containing logic gates for biomedical applications Cell Rep. Phys. Sci. 2021 2 100350 10.1016/j.xcrp.2021.100350 91. Cedillo-Servin G. Al-Jehani E.A.A. Rossy T. Teixeira S.P.B. Sage F. Domingues R.M.A. Raman R. Castilho M. Meta-adaptive biomaterials: Multiscale, spatiotemporal organization and actuation in engineered tissues Trends Biotechnol. 2025 10.1016/j.tibtech.2025.05.004 40473558 92. Kianian S. Bansal J. Lee C. Zhang K. Bergese S.D. Perioperative multimodal analgesia: A review of efficacy and safety of the treatment options Anesthesiol. Perioper. Sci. 2024 2 9 10.1007/s44254-023-00043-1 93. Gade L. Boyd B.J. Malmsten M. Heinz A. Stimuli-responsive drug delivery systems for inflammatory skin conditions Acta Biomater. 2024 187 1 19 10.1016/j.actbio.2024.08.037 39209132 94. Vigata M. Meinert C. Hutmacher D.W. Bock N. Hydrogels as Drug Delivery Systems: A Review of Current Characterization and Evaluation Techniques Pharmaceutics 2020 12 1188 10.3390/pharmaceutics12121188 33297493 PMC7762425 95. Chen Q. Chen E. Qian X. A Narrative Review on Perioperative Pain Management Strategies in Enhanced Recovery Pathways-The Past, Present and Future J. Clin. Med. 2021 10 2568 10.3390/jcm10122568 34200695 PMC8229260 96. Askari E. Seyfoori A. Amereh M. Gharaie S.S. Ghazali H.S. Ghazali Z.S. Khunjush B. Akbari M. Stimuli-Responsive Hydrogels for Local Post-Surgical Drug Delivery Gels 2020 6 14 10.3390/gels6020014 32397180 PMC7345431 97. Wang W. Yuan Z. Yang S. Li T. Wang Y. Shi L. Yuan F.-l. Dong W. pH-responsive diclofenac sodium releasing adhesive hydrogel with wound hypoxia-relieving capacity for promoting wound repairing Colloids Surf. A 2025 716 136679 10.1016/j.colsurfa.2025.136679 98. Otto F. Froelich A. Microemulsion-Based Polymer Gels with Ketoprofen and Menthol: Physicochemical Properties and Drug Release Studies Gels 2024 10 435 10.3390/gels10070435 39057458 PMC11275338 99. Mammella A. Bhavana V. Chary P.S. Anuradha U. Mehra N.K. Modulation of chondroprotective hyaluronic acid and poloxamer gel with Ketoprofen loaded transethosomes: Quality by design-based optimization, characterization, and preclinical investigations in osteoarthritis Int. J. Biol. Macromol. 2024 280 135919 10.1016/j.ijbiomac.2024.135919 39341323 100. Xiang H. Zhang C. Xiong Y. Wang Y. Pu C. He J. Chen L. Jiang K. Zhao W. Yang H. MMP13-responsive hydrogel microspheres for osteoarthritis treatment by precise delivery of celecoxib Mater. Des. 2024 241 112966 10.1016/j.matdes.2024.112966 101. Busillo J.M. Cidlowski J.A. The five Rs of glucocorticoid action during inflammation: Ready, reinforce, repress, resolve, and restore Trends Endocrinol. Metab. 2013 24 109 119 10.1016/j.tem.2012.11.005 23312823 PMC3667973 102. Oshima A. Hatayama K. Terauchi M. Kakiage H. Hashimoto S. Chikuda H. The comparison of dexamethasone and triamcinolone periarticular administration in total knee arthroplasty: Retrospective cohort study BMC Musculoskelet. Disord. 2022 23 120 10.1186/s12891-022-05048-8 35123474 PMC8818232 103. Liu D. Ahmet A. Ward L. Krishnamoorthy P. Mandelcorn E.D. Leigh R. Brown J.P. Cohen A. Kim H. A practical guide to the monitoring and management of the complications of systemic corticosteroid therapy Allergy Asthma Clin. Immunol. 2013 9 30 10.1186/1710-1492-9-30 23947590 PMC3765115 104. Zhou T. Xiong H. Wang S.Q. Zhang H.L. Zheng W.W. Gou Z.R. Fan C.Y. Gao C.Y. An injectable hydrogel dotted with dexamethasone acetate-encapsulated reactive oxygen species-scavenging micelles for combinatorial therapy of osteoarthritis Mater. Today Nano 2022 17 100164 10.1016/j.mtnano.2021.100164 105. Li J. Zhang A. Zhao A. Chen Z. Liang G. Liu H. Wu C. Weak acid-initiated slow release of Dexamethasone from hydrogel to treat orbital inflammation Theranostics 2023 13 4030 4041 10.7150/thno.85627 37554273 PMC10405854 106. Nguyen D.T. Soeranaya B.H.T. Truong T.H.A. Dang T.T. Modular design of a hybrid hydrogel for protease-triggered enhancement of drug delivery to regulate TNF-α production by pro-inflammatory macrophages Acta Biomater. 2020 117 167 179 10.1016/j.actbio.2020.09.026 32977069 107. Wu Q. Wang N. He T. Shang J. Li L. Song L. Yang X. Li X. Luo N. Zhang W. Thermosensitive hydrogel containing dexamethasone micelles for preventing postsurgical adhesion in a repeated-injury model Sci. Rep. 2015 5 13553 10.1038/srep13553 26324090 PMC4555101 108. Linderman S.W. Barber G.F. DeVeaux S.A. Botchwey E.A. Refai D. Klein A.M. García A.J. Dexamethasone Delivery via Amphiphilic, Low-swelling Hydrogels Treats Postoperative Inflammation in Cervical Spine Applications Adv. Healthc. Mater. 2025 14 e2404292 10.1002/adhm.202404292 39828668 PMC11912108 109. Freedman B.R. Kuttler A. Beckmann N. Nam S. Kent D. Schuleit M. Ramazani F. Accart N. Rock A. Li J. Enhanced tendon healing by a tough hydrogel with an adhesive side and high drug-loading capacity Nat. Biomed. Eng. 2022 6 1167 1179 10.1038/s41551-021-00810-0 34980903 PMC9250555 110. Nakajima N. Hashimoto S. Sato H. Takahashi K. Nagoya T. Kamimura K. Tsuchiya A. Yokoyama J. Sato Y. Wakatsuki H. Efficacy of gelatin hydrogels incorporating triamcinolone acetonide for prevention of fibrosis in a mouse model Regen. Ther. 2019 11 41 46 10.1016/j.reth.2019.04.001 31193122 PMC6518320 111. Cronstein B.N. Sunkureddi P. Mechanistic aspects of inflammation and clinical management of inflammation in acute gouty arthritis J. Clin. Rheumatol. 2013 19 19 29 10.1097/RHU.0b013e31827d8790 23319019 PMC3551244 112. Lee S. Dexmedetomidine: Present and future directions Korean J. Anesthesiol. 2019 72 323 330 10.4097/kja.19259 31220910 PMC6676029 113. Chen R. Sun Y. Lv J. Dou X. Dai M. Sun S. Lin Y. Effects of Dexmedetomidine on Immune Cells: A Narrative Review Front. Pharmacol. 2022 13 829951 10.3389/fphar.2022.829951 35586059 PMC9108424 114. Cho J.S. Seon K. Kim M.-Y. Kim S.W. Yoo Y.C. Effects of Perioperative Dexmedetomidine on Immunomodulation in Uterine Cancer Surgery: A Randomized, Controlled Trial Front. Oncol. 2021 11 749003 10.3389/fonc.2021.749003 34868950 PMC8635094 115. Flanders C.A. Rocke A.S. Edwardson S.A. Baillie J.K. Walsh T.S. The effect of dexmedetomidine and clonidine on the inflammatory response in critical illness: A systematic review of animal and human studies Crit. Care. 2019 23 402 10.1186/s13054-019-2690-4 31829277 PMC6907244 116. Chen R. Sun S. Li Y. Dou X. Dai M. Wu Y. Lin Y. Efficacy and safety evaluation of dexmedetomidine for postoperative patient controlled intravenous analgesia: A systematic review and meta-analysis Front. Pharmacol. 2022 13 1028704 10.3389/fphar.2022.1028704 36578546 PMC9791264 117. Wang K. Wu M. Xu J. Wu C. Zhang B. Wang G. Ma D. Effects of dexmedetomidine on perioperative stress, inflammation, and immune function: Systematic review and meta-analysis Br. J. Anaesth. 2019 123 777 794 10.1016/j.bja.2019.07.027 31668347 118. Wang M. Che J.-X. Chen L. Song T.-T. Qu J.-T. Effect of Dexmedetomidine on Intraoperative Hemodynamics and Blood Loss in Patients Undergoing Spine Surgery: A Systematic Review and Meta-Analysis Chin. Med. Sci. J. 2024 39 54 68 10.24920/004294 38426411 119. Grest A. Kurmann J. Müller M. Jeger V. Krüger B. Spahn D.R. Bettex D. Rudiger A. Cardiovascular Safety of Clonidine and Dexmedetomidine in Critically Ill Patients after Cardiac Surgery Crit. Care Res. Pract. 2020 2020 4750615 10.1155/2020/4750615 32455009 PMC7229561 120. Allam A.A. Eleraky N.E. Diab N.H. Elsabahy M. Mohamed S.A. Abdel-Ghaffar H.S. Hassan N.A. Shouman S.A. Omran M.M. Hassan S.B. Development of Sedative Dexmedetomidine Sublingual In Situ Gels: In Vitro and In Vivo Evaluations Pharmaceutics 2022 14 220 10.3390/pharmaceutics14020220 35213953 PMC8878141 121. Chen S. Yao W. Wang H. Wang T. Xiao X. Sun G. Yang J. Guan Y. Zhang Z. Xia Z. Injectable electrospun fiber-hydrogel composite sequentially releasing clonidine and ropivacaine for prolonged and walking regional analgesia Theranostics 2022 12 4904 4921 10.7150/thno.74845 35836801 PMC9274753 122. Zhang X. Wang T. Fan X. Zhang T. Qiu R. Wu Y. Wang M. Zhang Y. Li M. Cai N. Advances in rationally engineered cytokines for precision therapy in diabetic wound healing Explor. Immunol. 2024 4 533 553 10.37349/ei.2024.00157 123. Gutowski S.M. Shoemaker J.T. Templeman K.L. Wei Y. Latour R.A. Jr. Bellamkonda R.V. LaPlaca M.C. García A.J. Protease-degradable PEG-maleimide coating with on-demand release of IL-1Ra to improve tissue response to neural electrodes Biomaterials 2015 44 55 70 10.1016/j.biomaterials.2014.12.009 25617126 PMC4307944 124. Robert M.-C. Frenette M. Zhou C. Yan Y. Chodosh J. Jakobiec F.A. Stagner A.M. Vavvas D. Dohlman C.H. Paschalis E.I. A Drug Delivery System for Administration of Anti–TNF-α Antibody Transl. Vis. Sci. Technol. 2016 5 11 10.1167/tvst.5.2.11 PMC4790433 26981333 125. Xi L. Wang L. Zhang M. He C. Yang X. Pang Y. Chen H. Cheng F. TNF-R1 Cellular Nanovesicles Loaded on the Thermosensitive F-127 Hydrogel Enhance the Repair of Scalded Skin ACS Biomater. Sci. Eng. 2023 9 5843 5854 10.1021/acsbiomaterials.2c01257 37043416 PMC10566511 126. Xu H. Luo H. Chen J. Chen G. Yu X. Ye Z. BMP-2 releasing mineral-coated microparticle-integrated hydrogel system for enhanced bone regeneration Front. Bioeng. Biotechnol. 2023 11 1217335 10.3389/fbioe.2023.1217335 37635994 PMC10447977 127. García J.R. Clark A.Y. García A.J. Integrin-specific hydrogels functionalized with VEGF for vascularization and bone regeneration of critical-size bone defects J. Biomed. Mater. Res. A 2016 104 889 900 10.1002/jbm.a.35626 26662727 PMC5106804 128. Yoon M.S. Lee J.M. Jo M.J. Kang S.J. Yoo M.K. Park S.Y. Bong S. Park C.-S. Park C.-W. Kim J.-S. Dual-Drug Delivery Systems Using Hydrogel–Nanoparticle Composites: Recent Advances and Key Applications Gels 2025 11 520 10.3390/gels11070520 40710682 PMC12294678 129. Li Y. Chen Y. Xue Y. Jin J. Xu Y. Zeng W. Liu J. Xie J. Injectable Hydrogel Delivery System with High Drug Loading for Prolonging Local Anesthesia Adv. Sci. 2024 11 2309482 10.1002/advs.202309482 PMC11200007 38477406 130. Abdeltawab H. Svirskis D. Boyd B.J. Hill A. Sharma M. Injectable thermoresponsive gels offer sustained dual release of bupivacaine hydrochloride and ketorolac tromethamine for up to two weeks Int. J. Pharm. 2021 604 120748 10.1016/j.ijpharm.2021.120748 34051318 131. Shamszadeh S. Asgary S. Akrami M. Mashhadiabbas F. Akbarzadeh Baghban A. Shams F. Development of a Thermoresponsive Core–Shell Hydrogel for Sequential Delivery of Antibiotics and Growth Factors in Regenerative Endodontics Front. Biosci. 2024 16 32 10.31083/j.fbe1604032 39736002 132. Bordbar-Khiabani A. Gasik M. Smart Hydrogels for Advanced Drug Delivery Systems Int. J. Mol. Sci. 2022 23 3665 10.3390/ijms23073665 35409025 PMC8998863 133. Pogatzki-Zahn E.M. Segelcke D. Schug S.A. Postoperative pain-from mechanisms to treatment Pain. Rep. 2017 2 e588 10.1097/PR9.0000000000000588 29392204 PMC5770176 134. Ji Q. Chen K. Yi H. He B. Jiang T. A Paintable Small-Molecule Hydrogel with Antimicrobial and ROS Scavenging Activities for Burn Wound Healing Gels 2024 10 621 10.3390/gels10100621 39451274 PMC11507430 135. Garcia P. Histing T. Holstein J.H. Klein M. Laschke M.W. Matthys R. Ignatius A. Wildemann B. Lienau J. Peters A. Rodent animal models of delayed bone healing and non-union formation: A comprehensive review Eur. Cell. Mater. 2013 26 1 12 discussion 12–14 10.22203/eCM.v026a01 23857280 136. Huang Q. Qu Y. Tang M. Lan K. Zhang Y. Chen S. Li W. Gu L. ROS-responsive hydrogel for bone regeneration: Controlled dimethyl fumarate release to reduce inflammation and enhance osteogenesis Acta Biomater. 2025 195 183 200 10.1016/j.actbio.2025.02.026 39956305 137. Wang Q. Feng K. Wan G. Liao W. Jin J. Wang P. Sun X. Wang W. Jiang Q. A ROS-responsive hydrogel encapsulated with matrix metalloproteinase-13 siRNA nanocarriers to attenuate osteoarthritis progression J. Nanobiotechnol. 2025 23 18 10.1186/s12951-024-03046-7 PMC11737235 39815302 138. Li X. Liu Y. Yang Q. Zhang W. Wang H. Zhang W. Li Z. Ji M. You Y. Lu J. Injectable Piezoelectric Hydrogel Promotes Tendon–Bone Healing via Reshaping the Electrophysiological Microenvironment and M2 Macrophage Polarization ACS Appl. Mater. Interfaces 2025 17 22210 22231 10.1021/acsami.4c21011 40178926 PMC12012719 139. Yang J. Zhang X. Lu B. Mei J. Xu L. Zhang X. Su Z. Xu W. Fang S. Zhu C. Inflammation-Responsive Hydrogel Spray for Synergistic Prevention of Traumatic Heterotopic Ossification via Dual-Homeostatic Modulation Strategy Adv. Sci. 2023 10 2302905 10.1002/advs.202302905 PMC10602522 37635177 140. Wang J.C. Strichartz G.R. Prevention of Chronic Post-Thoracotomy Pain in Rats By Intrathecal Resolvin D1 and D2: Effectiveness of Perioperative and Delayed Drug Delivery J. Pain 2017 18 535 545 10.1016/j.jpain.2016.12.012 28063958 PMC5429219 141. Vediappan R.S. Bennett C. Bassiouni A. Smith M. Finnie J. Trochsler M. Psaltis A.J. Vreugde S. Wormald P.J. A Novel Rat Model to Test Intra-Abdominal Anti-adhesive Therapy Front. Surg. 2020 7 12 10.3389/fsurg.2020.00012 32322586 PMC7158702 142. Åkerberg D. Posaric-Bauden M. Isaksson K. Andersson R. Tingstedt B. Prevention of Pleural Adhesions by Bioactive Polypeptides—A Pilot Study Int. J. Med. Sci. 2013 10 1720 1726 10.7150/ijms.6651 24151443 PMC3804797 143. Luo Q. Cheng N. Yang Y. Shao N. Nie T. Chen J. Huang C. Zhang S. Huang Y. Ieong C.M. Multi-stage cooperative ROS-responsive hydrogel platform for drug delivery in myocardial ischemia-reperfusion injury repair Mater. Today Bio 2025 32 101854 10.1016/j.mtbio.2025.101854 PMC12141556 40487180 144. Yang M. Wang L. Liu W. Li W. Huang Y. Jin Q. Zhang L. Jiang Y. Luo Z. Highly-stable, injectable, conductive hydrogel for chronic neuromodulation Nat. Commun. 2024 15 7993 10.1038/s41467-024-52418-y 39266583 PMC11393409 145. Huang Y. Dai X. Gong Y. Ren L. Luo Y. Sun Y. Chen M. Jiang J. Guan Z. Zhao C. ROS-responsive sprayable hydrogel as ROS scavenger and GATA6 + J. Control. Release. 2024 369 573 590 10.1016/j.jconrel.2024.03.051 38554773 146. Zhang T. Huang Y. Gong Y. Shi X. Xiao D. Ren L. Dai X. Zeng Z. Zhao C. A ROS-responsive and scavenging hydrogel for postoperative abdominal adhesion prevention Acta Biomater. 2024 184 98 113 10.1016/j.actbio.2024.06.027 38914412 147. Huang L. Zhang T. Wang K. Chang B. Fu D. Chen X. Postoperative Multimodal Analgesia Strategy for Enhanced Recovery After Surgery in Elderly Colorectal Cancer Patients Pain Ther. 2024 13 745 766 10.1007/s40122-024-00619-0 38836984 PMC11254899 148. Brigham N.C. Ji R.-R. Becker M.L. Degradable polymeric vehicles for postoperative pain management Nat. Commun. 2021 12 1367 10.1038/s41467-021-21438-3 33649338 PMC7921139 149. Chen P.C. Kohane D.S. Park Y.J. Bartlett R.H. Langer R. Yang V.C. Injectable microparticle-gel system for prolonged and localized lidocaine release. II. In vivo anesthetic effects J. Biomed. Mater. Res. A 2004 70A 459 466 10.1002/jbm.a.30101 15293320 150. Zhang W. Xu W. Ning C. Li M. Zhao G. Jiang W. Ding J. Chen X. Long-acting hydrogel/microsphere composite sequentially releases dexmedetomidine and bupivacaine for prolonged synergistic analgesia Biomaterials 2018 181 378 391 10.1016/j.biomaterials.2018.07.051 30099261 151. Alka Singh P. Pal R.R. Mishra N. Singh N. Verma A. Saraf S.A. Development of pH-Sensitive hydrogel for advanced wound Healing: Graft copolymerization of locust bean gum with acrylamide and acrylic acid Int. J. Pharm. 2024 661 124450 10.1016/j.ijpharm.2024.124450 38986968 152. Joshi N. Yan J. Levy S. Bhagchandani S. Slaughter K.V. Sherman N.E. Amirault J. Wang Y. Riegel L. He X. Towards an arthritis flare-responsive drug delivery system Nat. Commun. 2018 9 1275 10.1038/s41467-018-03691-1 29615615 PMC5882944 153. El-Husseiny H.M. Mady E.A. Hamabe L. Abugomaa A. Shimada K. Yoshida T. Tanaka T. Yokoi A. Elbadawy M. Tanaka R. Smart/stimuli-responsive hydrogels: Cutting-edge platforms for tissue engineering and other biomedical applications Mater. Today Bio 2022 13 100186 10.1016/j.mtbio.2021.100186 PMC8669385 34917924 154. Chen Y. Wang Q. Ning F. Du C. Chen M. Feng C. Dong C.-M. Dynamic Hyaluronic Acid Hydrogels for Comprehensively Regulating Inflammation, Angiogenesis, and Metabolism to Effectively Proheal Diabetic Wounds ACS Appl. Mater. Interfaces 2024 16 70256 70273 10.1021/acsami.4c15674 39668760 155. Shafranek R.T. Millik S.C. Smith P.T. Lee C.-U. Boydston A.J. Nelson A. Stimuli-responsive materials in additive manufacturing Prog. Polym. Sci. 2019 93 36 67 10.1016/j.progpolymsci.2019.03.002 156. Li Z. Zhao Q. Zhou J. Li Y. Zheng Y. Chen L. A reactive oxygen species-responsive hydrogel loaded with Apelin-13 promotes the repair of spinal cord injury by regulating macrophage M1/M2 polarization and neuroinflammation J. Nanobiotechnol. 2025 23 12 10.1186/s12951-024-02978-4 39794784 PMC11724542 157. Zhang Y. Jiang M. Wang T. Reactive oxygen species (ROS)-responsive biomaterials for treating myocardial ischemia-reperfusion injury Front. Bioeng. Biotechnol. 2024 12 1469393 10.3389/fbioe.2024.1469393 39286345 PMC11402825 158. Zöller K. To D. Bernkop-Schnürch A. Biomedical applications of functional hydrogels: Innovative developments, relevant clinical trials and advanced products Biomaterials 2025 312 122718 10.1016/j.biomaterials.2024.122718 39084097 159. Gao Y. Chen X. He C. Zhang Z. Yu J. Stimulus-responsive hydrogels for diabetic wound management via microenvironment modulation Biomater. Sci. 2025 13 3192 3212 10.1039/D4BM01657B 40354108 160. Sun S. Cui Y. Yuan B. Dou M. Wang G. Xu H. Wang J. Yin W. Wu D. Peng C. Drug delivery systems based on polyethylene glycol hydrogels for enhanced bone regeneration Front. Bioeng. Biotechnol. 2023 11 1117647 10.3389/fbioe.2023.1117647 36793443 PMC9923112 161. Øvrebø Ø. Perale G. Wojciechowski J.P. Echalier C. Jeffers J.R.T. Stevens M.M. Haugen H.J. Rossi F. Design and clinical application of injectable hydrogels for musculoskeletal therapy Bioeng. Transl. Med. 2022 7 e10295 10.1002/btm2.10295 35600661 PMC9115710 162. Raeisi A. Farjadian F. Commercial hydrogel product for drug delivery based on route of administration Front. Chem. 2024 12 1336717 10.3389/fchem.2024.1336717 38476651 PMC10927762 163. Xie B. Xie H. Application of stimuli-responsive hydrogel in brain disease treatment Front. Bioeng. Biotechnol. 2024 12 1450267 10.3389/fbioe.2024.1450267 39091971 PMC11291207 164. Sheth S. Barnard E. Hyatt B. Rathinam M. Zustiak S.P. Predicting Drug Release From Degradable Hydrogels Using Fluorescence Correlation Spectroscopy and Mathematical Modeling Front. Bioeng. Biotechnol. 2019 7 410 10.3389/fbioe.2019.00410 31956651 PMC6951421 165. Ouyang L. Dan Y. Shao Z. Yang S. Yang C. Liu G. Duan D. MMP-sensitive PEG hydrogel modified with RGD promotes bFGF, VEGF and EPC-mediated angiogenesis Exp. Ther. Med. 2019 18 2933 2941 10.3892/etm.2019.7885 31572536 PMC6755480 166. Liang H. Russell S.J. Wood D.J. Tronci G. A hydroxamic acid–methacrylated collagen conjugate for the modulation of inflammation-related MMP upregulation J. Mater. Chem. B 2018 6 3703 3715 10.1039/C7TB03035E 32254833 167. Liu X. Hu Y. Ju Y. Yang P. Shen N. Yang A. Wu R. Fang B. Liu L. Immunomodulatory hydrogels for tissue repair and regeneration APL Mater. 2024 12 080603 10.1063/5.0228692 168. Tu Z. Zhong Y. Hu H. Shao D. Haag R. Schirner M. Lee J. Sullenger B. Leong K.W. Design of therapeutic biomaterials to control inflammation Nat. Rev. Mater. 2022 7 557 574 10.1038/s41578-022-00426-z 35251702 PMC8884103 169. Pellegrini V. La Grotta R. Carreras F. Giuliani A. Sabbatinelli J. Olivieri F. Berra C.C. Ceriello A. Prattichizzo F. Inflammatory Trajectory of Type 2 Diabetes: Novel Opportunities for Early and Late Treatment Cells 2024 13 1662 10.3390/cells13191662 39404426 PMC11476093 170. Ungvari Z. Tarantini S. Kiss T. Wren J.D. Giles C.B. Griffin C.T. Murfee W.L. Pacher P. Csiszar A. Endothelial dysfunction and angiogenesis impairment in the ageing vasculature Nat. Rev. Cardiol. 2018 15 555 565 10.1038/s41569-018-0030-z 29795441 PMC6612360 171. Xiong D. Geng H. Lv X. Wang S. Jia L. Inflammatory Response and Anti-Inflammatory Treatment in Persistent Inflammation-Immunosuppression-Catabolism Syndrome (PICS) J. Inflamm. Res. 2025 18 2267 2281 10.2147/JIR.S504694 39968098 PMC11834740 172. Elesber A.A. Best P.J. Lennon R.J. Mathew V. Rihal C.S. Lerman L.O. Lerman A. Plasma 8-iso-prostaglandin F2alpha, a marker of oxidative stress, is increased in patients with acute myocardial infarction Free Radic. Res. 2006 40 385 391 10.1080/10715760500539154 16517503 173. van der Plas A. Pouly S. de La Bourdonnaye G. Baker G. Lüdicke F. Influence of smoking on levels of urinary 8-iso Prostaglandin F2α Toxicol. Rep. 2019 6 18 25 10.1016/j.toxrep.2018.11.011 30519530 PMC6260378 174. Tayler I.M. Stowers R.S. Engineering hydrogels for personalized disease modeling and regenerative medicine Acta Biomater. 2021 132 4 22 10.1016/j.actbio.2021.04.020 33882354 175. Protsak I.S. Morozov Y.M. Fundamentals and Advances in Stimuli-Responsive Hydrogels and Their Applications: A Review Gels 2025 11 30 10.3390/gels11010030 39852001 PMC11765116 176. Mohseni-Motlagh S.F. Dolatabadi R. Baniassadi M. Baghani M. Application of the Quality by Design Concept (QbD) in the Development of Hydrogel-Based Drug Delivery Systems Polymers 2023 15 4407 10.3390/polym15224407 38006131 PMC10674248 177. Pielenhofer J. Meiser S.L. Gogoll K. Ciciliani A.-M. Denny M. Klak M. Lang B.M. Staubach P. Grabbe S. Schild H. Quality by Design (QbD) Approach for a Nanoparticulate Imiquimod Formulation as an Investigational Medicinal Product Pharmaceutics 2023 15 514 10.3390/pharmaceutics15020514 36839835 PMC9965879 178. Parshad B. Arora S. Singh B. Pan Y. Tang J. Hu Z. Patra H.K. Towards precision medicine using biochemically triggered cleavable conjugation Commun. Chem. 2025 8 100 10.1038/s42004-025-01491-5 40175511 PMC11965331 179. Wang J. Liu M. Zhang X. Wang X. Xiong M. Luo D. Stimuli-responsive linkers and their application in molecular imaging Exploration 2024 4 20230027 10.1002/EXP.20230027 39175888 PMC11335469 180. Wang J. Wang B.M. Schwendeman S.P. Characterization of the initial burst release of a model peptide from poly (d,l-lactide-co-glycolide) microspheres J. Control. Release 2002 82 289 307 10.1016/S0168-3659(02)00137-2 12175744 181. Wang G. Griffin J.I. Inturi S. Brenneman B. Banda N.K. Holers V.M. Moghimi S.M. Simberg D. In Vitro and In Vivo Differences in Murine Third Complement Component (C3) Opsonization and Macrophage/Leukocyte Responses to Antibody-Functionalized Iron Oxide Nanoworms Front. Immunol. 2017 8 151 10.3389/fimmu.2017.00151 28239384 PMC5309246 182. Kanďárová H. Pôbiš P. The “Big Three” in biocompatibility testing of medical devices: Implementation of alternatives to animal experimentation-are we there yet? Front. Toxicol. 2023 5 1337468 10.3389/ftox.2023.1337468 38259728 PMC10800850 183. Niu Y. Zhao Z. Yang L. Lv D. Sun R. Zhang T. Li Y. Bao Q. Zhang M. Wang L. Towards Intelligent Wound Care: Hydrogel-Based Wearable Monitoring and Therapeutic Platforms Polymers 2025 17 1881 10.3390/polym17131881 40647892 PMC12252240 184. Rothe R. Xu Y. Thomas A.K. Meister S. Zhang Y. Pietzsch J. Hauser S. A modular, injectable, non-covalently assembled hydrogel system features widescale tunable degradability for controlled release and tissue integration Biomaterials 2021 269 120637 10.1016/j.biomaterials.2020.120637 33450583 185. Zhang Z. Zhou X. Fang Y. Xiong Z. Zhang T. AI-driven 3D bioprinting for regenerative medicine: From bench to bedside Bioact. Mater. 2025 45 201 230 10.1016/j.bioactmat.2024.11.021 39651398 PMC11625302 186. Zheng Z. Zhu R. Peng I. Xu Z. Jiang Y. Wearable and implantable biosensors: Mechanisms and applications in closed-loop therapeutic systems J. Mater. Chem. B 2024 12 8577 8604 10.1039/D4TB00782D 39138981 187. Li Z. Song P. Li G. Han Y. Ren X. Bai L. Su J. AI energized hydrogel design, optimization and application in biomedicine Mater. Today Bio 2024 25 101014 10.1016/j.mtbio.2024.101014 PMC10924066 38464497 188. Liao H. Hu S. Yang H. Wang L. Tanaka S. Takigawa I. Li W. Fan H. Gong J.P. Data-driven de novo design of super-adhesive hydrogels Nature 2025 644 89 95 10.1038/s41586-025-09269-4 40770436 PMC12328221 189. Arsuffi B. Siqueira G. Nyström G. Titotto S. Magrini T. Daraio C. Programmable Multi-Responsive Nanocellulose-Based Hydrogels With Embodied Logic Adv. Funct. Mater. 2024 34 2409864 10.1002/adfm.202409864 190. Li P. Yin R. Cheng J. Lin J. Bacterial Biofilm Formation on Biomaterials and Approaches to Its Treatment and Prevention Int. J. Mol. Sci. 2023 24 11680 10.3390/ijms241411680 37511440 PMC10380251 191. Zhang W. Lu H. Zhang W. Hu J. Zeng Y. Hu H. Shi L. Xia J. Xu F. Inflammatory Microenvironment-Responsive Hydrogels Enclosed with Quorum Sensing Inhibitor for Treating Post-Traumatic Osteomyelitis Adv. Sci. 2024 11 e2307969 10.1002/advs.202307969 38482752 PMC11132068 192. Cristea A.-G. Lisă E.-L. Iacob S. Dragostin I. Ștefan C.S. Fulga I. Anghel A.M. Dragan M. Morariu I.D. Dragostin O.-M. Antimicrobial Smart Dressings for Combating Antibiotic Resistance in Wound Care Pharmaceuticals 2025 18 825 10.3390/ph18060825 40573221 PMC12196261 193. Jain S.N. Lamture Y. Krishna M. Enhanced Recovery After Surgery: Exploring the Advances and Strategies Cureus 2023 15 e47237 10.7759/cureus.47237 38022245 PMC10654132 Figure 1 Conceptual schematic linking 4D printing to inflammation-responsive hydrogels. Surgical wounds generate biological stimuli such as local acidosis (pH 6.0–6.8), reactive oxygen species (H 2 2 2 − − Figure 2 Schematic overview of the main classes of inflammation-responsive hydrogels. Distinct categories include pH-responsive systems activated by local acidosis (pH 6.0–6.8), ROS-responsive systems triggered by oxidative radicals (H 2 2 2 − − gels-11-00691-t001_Table 1 Table 1 Key phases of perioperative inflammation. Inflammatory Phase Key Triggers Design Implications Acute (0–72 h) ROS, low pH, NE, MMPs, IL-1β Burst or early-phase release via ROS-, pH-, or enzyme-responsive linkers Resolution (>72 h) MMP-2/9, IL-10 Sustained release of regenerative agents; ECM-mimetic or degradable scaffolds Spatial variation Local hypoxia, edema, cytokine gradients Injectable, conformal, or multi-stimuli systems for site-specific delivery ECM, extracellular matrix; IL, interleukin; MMP, matrix metalloproteinase; NE, neutrophil elastase; pH, potential of hydrogen; ROS, reactive oxygen species. gels-11-00691-t002_Table 2 Table 2 Classes of Inflammation-Responsive Hydrogels. Hydrogel Class Primary Trigger Mechanism of Response Representative Design Strategy pH-responsive Local acidosis Hydrolytic cleavage or ionic swelling Orthoester, acetal, imine linkers; ionizable PAA ROS-responsive H 2 2 2 − − Oxidative cleavage or crosslink disruption Thioketal, boronic ester, diselenide bonds Enzyme-responsive MMP-2/9, NE Protease-mediated peptide cleavage GPLGIAGQ or AAPV peptide crosslinkers Multi-stimuli/feedback ROS + pH, MMP + pH, cytokines Boolean logic (AND/OR), biosensor-mediated release Dual-labile networks, aptamer-functionalized matrices, redox-switchable gels H 2 2 2 − − gels-11-00691-t003_Table 3 Table 3 Representative therapeutic payloads delivered via inflammation-responsive hydrogels in perioperative settings. Payload Class Key Examples Delivery Features NSAIDs Diclofenac, Ketoprofen, Celecoxib pH-/ROS-responsive; improved local efficacy Corticosteroids Dexamethasone, Triamcinolone Sustained release; enzyme-triggered systems α 2 Dexmedetomidine, Clonidine Mucoadhesive or thermosensitive hydrogels Biologics/Regenerative Factors IL-1Ra, TNF-α blockers, BMP-2, VEGF Cytokine/ECM-targeted; protease-responsive Dual-Payload Systems Ropivacaine + Dexmedetomidine or Ketorolac Synergistic release; compartmental structures BMP, bone morphogenetic protein; ECM, extracellular matrix; IL-1Ra, interleukin-1 receptor antagonist; NSAIDs, non-steroidal anti-inflammatory drugs; ROS, reactive oxygen species; TNF-α, tumor necrosis factor-alpha; VEGF, vascular endothelial growth factor. gels-11-00691-t004_Table 4 Table 4 Quantitative comparison of inflammation-responsive hydrogel systems and conventional comparators in preclinical perioperative models. Hydrogel Trigger Type Payload Model Comparator Key Quantitative Ref. Dual-responsive gelatin–PVA ROS + pH Vancomycin–Ag NCs + nimesulide Rat diabetic infected wound Commercial dressing Wound closure ↑ (92% vs. 74%, p p p [ 69 MMP-cleavable tetra-PEG Enzyme (MMP-2/9) Phosphatidylserine Rat calvarial defect Non-responsive hydrogel Bone regeneration ↑ (78% vs. 54%, p p p [ 75 MMP-13-responsive HAMA microsphere Enzyme (MMP-13) Celecoxib Rat OA model (ACLT + MMx) Non-responsive hydrogel OARSI score ↓ (~75%, p [ 100 MMP-cleavable PEG Enzyme (MMP-1/2) IL-1Ra Rat cortical LPS-induced neuroinflammation model Uncoated implant IgG leakage ↓ to sham level ( p p [ 123 ROS-degradable HA–EGCG ROS EGCG Rat cecum–sidewall abrasion adhesion model Commercial HA hydrogel Adhesion score ↓ (1.2 vs. 3.8, p [ 145 ROS-responsive HA–PBA/ADH + PVA–SB–CHO ROS Chlorogenic acid Rat cecum–sidewall abrasion adhesion model Commercial HA hydrogel Adhesion score ↓ (1.0–1.125 vs. 3.5+, p [ 146 ACLT, anterior cruciate ligament transection; ADH, adipic dihydrazide; Ag NCs, silver nanoclusters; CHO, aldehyde; EGCG, epigallocatechin gallate; HA, hyaluronic acid; HAMA, methacrylated hyaluronic acid; IL-1β, interleukin-1 beta; IL-1Ra, interleukin-1 receptor antagonist; LPS, lipopolysaccharide; MMx, medial meniscectomy; MMP, matrix metalloproteinase; OA, osteoarthritis; OARSI, Osteoarthritis Research Society International; PBA, phenylboronic acid; PEG, polyethylene glycol; PVA, polyvinyl alcohol; ROS, reactive oxygen species; SB, salicylidene benzoyl hydrazone; TNF-α, tumor necrosis factor-alpha. gels-11-00691-t005_Table 5 Table 5 Summary of inflammation-responsive hydrogel applications in preclinical perioperative models. Surgical Model Responsive Cue Main Outcome Incisional wound ROS, pH Reduced inflammation, faster healing Burn injury ROS Lower cytokines, improved repair Bone fracture MMP, pH Enhanced bone regeneration Joint surgery Enzyme Cartilage protection VATS/laparotomy pH, ROS Nerve protection, reduced pain MMP, matrix metalloproteinase; ROS, reactive oxygen species; VATS, video-assisted thoracoscopic surgery. gels-11-00691-t006_Table 6 Table 6 Key challenges and strategies for clinical translation of inflammation-responsive hydrogels. Challenge Area Current Limitation Emerging Strategy Preclinical Models Non-surgical, short-term, poor benchmarking Standardized surgical inflammation models incorporating clinically relevant injury mechanisms (e.g., electrocautery, ischemia–reperfusion, multi-tissue handling) and harmonized benchmark endpoints (trigger fidelity, release kinetics, mechanical stability, biomarker modulation, therapeutic window, functional recovery, safety) Responsiveness Fidelity Off-target release, low specificity Logic-gated or biosensor-integrated systems Biocompatibility Immunogenicity, unstable degradation byproducts Modular, clinically validated chemistries Workflow Integration Complex delivery, poor fit with surgical pace Injectable, sprayable, or thermogelling formats Regulatory Translation Combination product hurdles, GMP gaps Use of ISO-approved polymers, early alignment GMP, Good Manufacturing Practice; ISO, International Organization for Standardization. ",
  "metadata": {
    "Title of this paper": "Enhanced Recovery After Surgery: Exploring the Advances and Strategies",
    "Journal it was published in:": "Gels",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469436/"
  }
}