{
  "title": "Paper_191",
  "abstract": "pmc Oncol Res Oncol Res 3914 oncres OR Oncology Research 0965-0407 1555-3906 Tech Science Press PMC12494098 PMC12494098.1 12494098 12494098 10.32604/or.2025.066058 66058 1 Article Inhibition of Breast Cancer Cell Proliferation by 9-Hydroxycamptothecin-Loaded Zeolitic Imidazolate Nanoparticles Inhibition of Breast Cancer Cell Proliferation by 9-Hydroxycamptothecin-Loaded Zeolitic Imidazolate Nanoparticles Inhibition of Breast Cancer Cell Proliferation by 9-Hydroxycamptothecin-Loaded Zeolitic Imidazolate Nanoparticles Yang Chuansheng 1 Zhou Xiaoling 2 3 Luo Ling 3 Luo Zirun 4 Fan Kaiming 5 kaiming78613@163.com Xia Chenglai 2 3 xiachenglai@smu.edu.cn 1 Department of Breast, Thyroid and Head-Neck Surgery, Yuebei People’s Hospital of Shantou University Shaoguan, 512099 China 2 School of Pharmaceutica Sciences, Southern Medical University Guangzhou, 510515 China 3 Scientific Research Center, Foshan Women and Children Hospital Affiliated with Guangdong Medical University Foshan, 528000 China 4 Department of Breast, Thyroid and Head-Neck Surgery, The Third Xiangya Hospital of Central Sounth University Changsha, 410000 China 5 Department of Anesthesiology, FangChengGang Hospital of Guangxi University of Chinese Medicine FangChengGang, 538021 China * kaiming78613@163.com xiachenglai@smu.edu.cn 2025 26 9 2025 33 10 498269 3065 3076 28 3 2025 05 6 2025 26 09 2025 04 10 2025 04 10 2025 © 2025 The Authors. 2025 Published by Tech Science Press. https://creativecommons.org/licenses/by/4.0/ This work is licensed under a Creative Commons Attribution 4.0 International License Objectives Novel drug delivery systems have been designed to enhance local drug concentrations while reducing side effects conducive to improved breast cancer treatment outcomes. This study aimed to identify the anti-cancer function of zeolite imidazole ester-based material loaded with camptothecin nanoparticles. Methods We utilized a zeolitic imidazolate backbone material to fabricate 9-hydroxycamptothecin nanoparticles and investigated their impact on breast cancer cell proliferation. Scanning electron microscopy and Fourier-transform infrared spectroscopy revealed changes in the carrier skeleton of the loaded 9-hydroxyl camptothecin, characterized by a reduction in surface smoothness, accompanied by slight collapses and folds on the particle surface. Notably, we detected vibration of the benzene ring in the 9-hydroxycamptothecin structure within the nanoparticles. Cell proliferation was tested by CCK-8. Protein expression was measured by Western blot. The efficacy of nanoparticles was evaluated by animal experiments. Results In this study, we utilized a zeolitic imidazolate backbone material to fabricate 9-hydroxycamptothecin (9-HCPT) nanoparticles and investigated their impact on breast cancer cell proliferation. Scanning electron microscopy and Fourier-transform infrared spectroscopy revealed changes in the carrier skeleton of the loaded 9-hydroxyl camptothecin, characterized by a reduction in surface smoothness, accompanied by slight collapses and folds on the particle surface. Notably, we detected vibration of the benzene ring in the 9-HCPT structure within the nanoparticles. Using the CCK-8 method, we evaluated the inhibitory effect of these nanoparticles on breast cancer cells and observed a significant reduction in the cytotoxicity of camptothecin (CPT) when incorporated into the zeolite imidazole ester skeleton material. Immunoblot analysis showed upregulation of cyclic GMP-AMP synthase (cGAS), stimulator of interferon genes (STING), and NF-κB-p65 in response to the nanoparticles. These results showed that our nanoparticles might be a useful drug delivery strategy to overcome breast cancer drug resistance. Conclusion The findings of this study suggest that nanoparticles loaded with CPT and formed from zeolite imidazole ester backbone material possess immune-enhancing properties that could suppress breast cancer progression. Accordingly, these nanoparticles hold promise as potential lead compounds for combined immunotherapy in breast cancer treatment. 9-hydroxycamptothecin nanometer zeolimidazole breast cancer cell proliferation Guangdong Basic and Applied Basic Research Foundation 2023B1515130009 Science and Technology Bureau of Foshan FS0AA-KJ819-4901-0082 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Breast cancer is a prevalent malignant tumor affecting women, with its incidence steadily increasing in recent years, posing a significant threat to women’s lives and health [ 1 2 3 4 Camptothecin (CPT) is a class of pyrroquinoline alkaloids that reportedly targets topoisomerase I (TOP1) [ 5 6 in vivo in vivo Nano drugs, leveraging nanotechnology in drug delivery systems, offer significant advantages in the medical field [ 7 in vivo 8 9 10 2 Materials and Methods 2.1 Reagents, Antibodies, and Cells Human breast cancer cell lines MDA-MB231 cells, BT20 cells, and mouse breast cancer cell line 4T1 cells were bought from Shanghai ZBIO company (Shanghai, China) and cultured in a 37°C, 5% CO 2 3 2 2 3 3 2 ′ 2.2 Preparation of the Zeolite Imidazole Ester Backbone Material (ZIF-8) First, 657 mg of 2-MiM and 297.5 mg of zinc nitrate hexahydrate were accurately weighed and dissolved in 10 mL of methanol, creating a homogeneously dispersed solution. The solution containing 2-Mimidazole was added to the zinc nitrate solution at room temperature, and the mixture was stirred by a magnetic stirrer (Biofuge Stratos, Thermo Fisher Scientific, Waltham, MA, USA) at a rate of 1200 rpm for 30 min. Following this, a white precipitate formed and was collected through centrifugation. The precipitate was washed thrice with deionized water to eliminate excess reactants. Finally, the white precipitate was collected and subjected to freeze-drying, resulting in the obtainment of ZIF-8 nanoparticles. 2.3 Preparation of the HCPT@ZIF-8 To produce ZIF-8 nanoparticles loaded with HCPT (HCPT@ZIF-8), 10 mg of ZIF-8 nanoparticles were dispersed in 10 mL of HCPT methanol solution with a 1 mg/mL concentration. The mixture was stirred for 24 h and then collected by centrifugation (1000 g/rcf) to obtain HCPT@ZIF-8. The concentration of unloaded HCPT in the centrifugal supernatant was determined by measuring the absorbance of HCPT at 390 nm using a UV spectrophotometer (UV-2700, Shimazu, Japan). The encapsulation efficiency (EE) and drug loading content (DLC) were calculated using the following equations. EE ( % ) = Drug loading content Drug feeding content × 100 DLC ( % ) = Mass of HCPT in complexes Total mass of complexes × 100 2.4 Preparation of the HCPT@ZIF-8-PDA To create HCPT@ZIF-8-PDA, 10 mg of HCPT@ZIF-8 was dispersed in a mixture of ethanol and water and stirred for 10 min. Next, Tris-HCl solution (25 mM, 10 mL) was added dropwise to the above solution, followed by 10 mg of DA. The mixture was stirred by a magnetic stirrer for 12 h and then centrifuged (1000 g/rcf) to remove excess DA. The remaining product was washed three times with water to obtain HCPT@ZIF-8-PDA. 2.5 Preparation of HCPT@ZIF-8-PDA-FA/FITC 10 mg HCPT@ZIF-8-PDA was evenly dispersed in Tris-HCl solution (25 mM, 10 mL) with 20 mg of FA, and the mixture was stirred overnight for 24 h. After this, 10 mg of FITC was added, and the stirring continued for 48 h. The resulting product was centrifuged and washed three times with deionized water to eliminate any unloaded FITC. The final dispersion was suspended in deionized water to obtain HCPT@ZIF-8-PDA-FA/FITC for further characterization and experiments. 2.6 Scanning Electron Microscopy (SEM) Characterization of CPT Nanoparticles For SEM characterization, the prepared ZIF-8, HCPT@ZIF-8, HCPT@ZIF-8-PDA, and HCPT@ZIF-8-PDA-FA/FITC dispersions were sonicated to ensure even dispersion for 20 min (100 W). The dispersed solutions were then deposited onto clean silicon wafers and allowed to dry adequately. The surface morphology of ZIF-8, HCPT@ZIF-8, HCPT@ZIF-8-PDA, and HCPT@ZIF-8-PDA-FA/FITC was examined using SEM (Merlin Compact, Carl Zeiss, Oberkochen, Germany). In brief, put the sample onto the specimen stage, insert the stage into the SEM sample chamber, and activate the vacuum system to evacuate the chamber to a pressure of from 10 −3 −6 2.7 Fourier Transform Infrared Spectrum (FTIR) Characterization of CPT Nanoparticles For FTIR characterization, 5 mg of ZIF-8, HCPT, HCPT@ZIF-8, HCPT@ZIF-8-PDA, and HCPT@ZIF-8-PDA-FA/FITC were mixed with freeze-dried 495 mg potassium bromide powder (KBr) (W:W = 1:99) and ground evenly. The basic chemical structures of ZIF-8, HCPT, HCPT@ZIF-8, HCPT@ZIF-8-PDA, and HCPT@ZIF-8-PDA-FA/FITC were examined using Fourier transform infrared spectroscopy (Nicolet 5700, Thermo Electron Corporation, Waltham, MA, USA). The wavenumber range was from 4000–400 cm −1 2.8 In Vitro Drug Release from HCPT@ZIF-8-PDA-FA/FITC The in vitro Release  % = M  c u m u l a t i v e M  t o t a l × 100 2.9 Cytotoxicity Experiment According to the previously reported method [ 11 2 2 50 2.10 Western Blot In order to measure the protein expression, according to the previously reported method [ 12 2.11 Animal Experiment 30 female mice (BALB/c, 5–6 weeks old, 18–20 g) were provided by Guangdong Zhiyuan Technology Company (SYXK(Yue)2021-0251, Guangzhou, China). All animals were fed sterile food and water in sterile animal feeding facilities with a temperature of 20°C–25°C and a relative humidity of 50%–65%. All animal experiment procedures were approved by the Animal Ethics Committee of Guangdong Medical University (GDY2502311). 4T1 cells were first suspended in serum-free medium, and 0.1 mL of the cell suspension (approximately 1 × 10 7 2 2.12 Statistical Analysis Statistical analysis was conducted using SPSS 29.0 software (IBM Corp., Armonk, NY, USA). One-way analysis of variance (ANOVA) was used to analyze statistical differences between multiple groups. Each experiment was repeated at least three times, and the results were expressed as mean ± standard error of the mean (SD). Statistical significance was considered at p 3 Results 3.1 Nanoparticle Construction ZIF-8 was successfully synthesized by stirring at room temperature. The absorbance of HCPT at 390 nm was measured using a UV spectrophotometer to determine the concentration of unloaded HCPT in the centrifugal supernatant. The calculated encapsulation rate was 89.9%, and the DLC was 54.15%. HCPT@ZIF-8 was then dispersed in a mixture of ethanol and water with Tris-HCl solution and dopamine to form HCPT@ZIF-8-PDA. Next, HCPT@ZIF-8-PDA was mixed with folic acid and stirred overnight, then FITC was added, followed by additional stirring and centrifugation. After washing with deionized water three times to remove the unloaded FITC, HCPT@ZIF-8-PDA-FA/FITC nanoparticles were obtained ( Fig. 1 Figure 1 Construction of HCPT@ZIF-8-PDA-FA/FITC nanoparticles. Zeolite imidazole ester backbone material (ZIF-8) was synthesized by stirring at room temperature, yielding ZIF-8 nanoparticles. The ZIF-8 nanoparticles were loaded with HCPT and dispersed in the HCPT methanol solution (HCPT@ZIF-8). Dopamine (DA) and folic acid (FA) were utilized to form the polymer nanoparticles 3.2 Scanning Electron Microscopy Characterization of Nanoparticles As shown in Fig. 2 Fig. 2A Fig. 2B Fig. 2C Fig. 2D Figure 2 Scanning electron microscopy (SEM) characterization of the nanoparticles. ( A B C D 3.3 Infrared Detection Results of Nanoparticles FTIR analysis was conducted to validate the successful synthesis of the nanoparticles and investigate their structural and chemical bonds. The spectra of ZIF-8, HCPT@ZIF-8, HCPT@ZIF-8-PDA, and HCPT@ZIF-8-PDA-FA/FITC were analyzed. The ZIF-8 spectrum showed characteristic peaks at 421 cm −1 −1 −1 −1 Fig. 3 Figure 3 Infrared detection results of the nanoparticles 3.4 In Vitro Drug Release Results of Nanoparticles The drug release capacity of HCPT@ZIF-8-PDA-FA/FITC was assessed at different pH values. The drug release curves within 24 h were tested, and the results are shown in Fig. 4 p Figure 4 In vitro 3.5 HCPT@ZIF-8-PDA-FA/FITC Reduced Cytotoxicity and Inhibited Tumor Proliferation To address the issue of CPT’s high toxicity and its limitations in application, we compared the cytotoxicity of CPT nanoparticles and free CPT on breast cancer cells. In vitro 2 50 Fig. 5A Fig. 5B 50 Fig. 5C 50 in vivo Fig. 5D p Fig. 5E p Figure 5 HCPT-ZIF-8-PDA-FA/FITC showed cytotoxicity in vitro in vivo A 50 B 50 C 50 D in vitro p E + p 3.6 Nanoparticles Activate the cGAS/STING Signaling Pathway The cGAS/STING signaling pathway plays a crucial role in tumor immunotherapy [ 13 14 15 16 Fig. 6 Figure 6 Activation of the cGAS/STING signaling by HCPT-ZIF-8-FDA-FA. ( A B C p p p p 4 Discussion CPT, an alkaloid isolated from Camptotheca acuminata 17 18 19 20 The drug delivery system plays a crucial role in enhancing the efficacy of anti-tumor drugs by increasing drug solubility, enabling controlled release, improving stability, and enhancing tumor targeting [ 21 22 23 24 25 26 In vitro in vivo in vivo 27 28 Despite various attempts to overcome the limitations of CPT drugs by developing different delivery systems like liposomes, polymer micelles, nanoparticles, microspheres, and high molecule precursor drugs, several challenges remain to be addressed, encompassing low drug loading, poor stability, limited control over drug release, and specific toxicities associated with nanocarriers (e.g., gastrointestinal tract irritation, neutropenia), as well as tumor multi-drug resistance [ 29 30 31 32 In this study, HCPT@ZIF-8-PDA-FA/FITC nanoparticles have shown some efficacy in inhibiting breast cancer growth. However, there are still some limitations. Such as high interstitial fluid pressure, dense extracellular matrix (ECM), and acidic pH hinder nanoparticle penetration into deep tumor regions. Poorly understood biodistribution and slow clearance of non-degradable HCPT@ZIF-8-PDA-FA/FITC nanoparticles raise concerns about organ accumulation and chronic toxicity. Further investigations are essential to understand the pharmacokinetic behavior of these nanoparticles in living organisms. Determining the optimal dose ratio and timing of chemotherapeutic drugs and immune checkpoint inhibitors remains crucial for maximizing their therapeutic potential. We use Biorender ( https://biorender.com/ Funding Statement This work was supported by grants from the Guangdong Basic and Applied Basic Research Foundation (No. 2023B1515130009) and the Science and Technology Bureau of Foshan (No. FS0AA-KJ819-4901-0082). Author Contributions Chenglai Xia: Conceptualization, Writing—original draft, Writing—review & editing. Chuansheng Yang, Xiaoling Zhou, Ling Luo, Zirun Luo and Kaiming Fan: Writing—original draft, Writing—review & editing. Chenglai Xia: Conceptualization, Writing—review & editing, Supervision, Project administration, Funding acquisition. All authors reviewed the results and approved the final version of the manuscript. Availability of Data and Materials All data generated or analyzed during this study are included in this published article. Ethics Approval All animal experiment procedures were approved by the Animal Ethics Committee of Guangdong Medical University (GDY2502311). Conflicts of Interest The authors declare no conflicts of interest to report regarding the present study. References 1. Houghton SC Hankinson SE Cancer progress and priorities: breast cancer Cancer Epidemiol Biomarkers Prev 2021 2021 5 822 44 10.1158/1055-9965.EPI-20-1193 33947744 PMC8104131 2. Xiong X Zheng LW Ding Y Chen YF Cai YW Wang LP et al Breast cancer: pathogenesis and treatments Signal Transduct Target Ther 2025 10 1 49 10.1038/s41392-024-02108-4 39966355 PMC11836418 3. Afzal S Hassan M Ullah S Abbas H Tawakkal F Khan MA Breast cancer; discovery of novel diagnostic biomarkers, drug resistance, and therapeutic implications Front Mol Biosci 2022 9 783450 10.3389/fmolb.2022.783450 35265667 PMC8899313 4. Pawarode A Shukla S Minderman H Fricke SM Pinder EM O’Loughlin KL et al Differential effects of the immunosuppressive agents cyclosporin A, tacrolimus and sirolimus on drug transport by multidrug resistance proteins Cancer Chemother Pharmacol 2007 60 2 179 88 10.1007/s00280-006-0357-8 17031644 5. Thomas CJ Rahier NJ Hecht SM Camptothecin: current perspectives Bioorg Med Chem 2004 12 7 1585 604 10.1016/j.bmc.2003.11.036 15028252 6. Beretta GL Gatti L Perego P Zaffaroni N Camptothecin resistance in cancer: insights into the molecular mechanisms of a DNA-damaging drug Curr Med Chem 2013 20 12 1541 65 10.2174/0929867311320120006 23432590 7. Kopeckova K Eckschlager T Sirc J Hobzova R Plch J Hrabeta J et al Nanodrugs used in cancer therapy Biomed Pap Med Fac Univ Palacky Olomouc Czech Repub 2019 163 2 122 31 10.5507/bp.2019.010 30967685 8. Onoue S Yamada S Chan HK Nanodrugs: pharmacokinetics and safety Int J Nanomed 2014 9 1025 37 10.2147/ijn.s38378 24591825 PMC3934594 9. Bottini M Sacchetti C Pietroiusti A Bellucci S Magrini A Rosato N et al Targeted nanodrugs for cancer therapy: prospects and challenges J Nanosci Nanotechnol 2014 14 98 114 10.2147/ijn.s38378 24730253 10. Long X Zhang X Chen Q Liu M Xiang Y Yang Y et al Nucleus-targeting phototherapy nanodrugs for highly effective anti-cancer treatment Front Pharmacol 2022 13 905375 10.3389/fphar.2022.905375 35645841 PMC9130747 11. Yin S Mai Z Liu C Xu L Xia C Label-free-based quantitative proteomic analysis of the inhibition of cisplatin-resistant ovarian cancer cell proliferation by cucurbitacin B Phytomedicine 2023 111 1 154669 10.1016/j.phymed.2023.154669 36681055 12. Pan B Yin S Peng F Liu C Liang H Su J et al Vorinostat targets UBE2C to reverse epithelial-mesenchymal transition and control cervical cancer growth through the ubiquitination pathway Eur J Pharmacol 2021 908 174399 10.1016/j.ejphar.2021.174399 34331954 13. Hopfner KP Hornung V Molecular mechanisms and cellular functions of cGAS-STING signalling Nat Rev Mol Cell Biol 2020 21 9 501 21 10.1038/s41580-020-0244-x 32424334 14. Samson N Ablasser A The cGAS-STING pathway and cancer Nat Cancer 2022 3 12 1452 63 10.1038/s43018-022-00468-w 36510011 15. Zhang X Bai XC Chen ZJ Structures and mechanisms in the cGAS-STING innate immunity pathway Immunity 2020 53 1 43 53 10.1016/j.immuni.2020.05.013 32668227 16. Jain KK An overview of drug delivery systems Methods Mol Biol 2020 2059 4 1 54 10.1007/978-1-4939-9798-5_1 31435914 17. Amin SA Adhikari N Jha T Gayen S A review on camptothecin analogs with promising cytotoxic profile Anticancer Agents Med Chem 2018 18 13 1796 814 10.2174/1871520618666180327140956 29589546 18. Sun Y Zhang N Wang C Wei Y Liu J Distribution of camptothecin biosynthetic intermediates and identification the rate-limiting step of camptothecin biosynthesis Nat Prod Res 2021 35 13 2170 7 10.1080/14786419.2019.1665252 31537116 19. Liu Y Chen X Ding J Yu L Ma D Ding J Improved solubility and bioactivity of camptothecin family antitumor drugs with supramolecular encapsulation by water-soluble pillar[6]arene ACS Omega 2017 2 8 5283 8 10.1021/acsomega.7b01032 30023745 PMC6044948 20. Kang J Kumar V Yang D Chowdhury PR Hohl RJ Cyclodextrin complexation: influence on the solubility, stability, and cytotoxicity of camptothecin, an antineoplastic agent Eur J Pharm Sci 2002 15 2 163 70 10.1016/s0928-0987(01)00214-7 11849913 21. Huang P Wang X Liang X Yang J Zhang C Kong D et al Nano-, micro-, and macroscale drug delivery systems for cancer immunotherapy Acta Biomater 2019 85 1 26 10.1016/j.actbio.2018.12.028 30579043 22. Yang C Deng X Tang Y Tang H Xia C Natural products reverse cisplatin resistance in the hypoxic tumor microenvironment Cancer Lett 2024 598 217116 10.1016/j.canlet.2024.217116 39002694 23. Duan H Liu Y Gao Z Huang W Recent advances in drug delivery systems for targeting cancer stem cells Acta Pharm Sin B 2021 11 1 55 70 10.1016/j.apsb.2020.09.016 33532180 PMC7838023 24. Driver RW Yang LX Synthesis and pharmacology of new camptothecin drugs Mini Rev Med Chem 2005 5 5 425 39 10.2174/1389557053765547 15892685 25. Liew ST Yang LX Design, synthesis and development of novel camptothecin drugs Curr Pharm Des 2008 14 11 1078 97 10.2174/138161208784246180 18473856 26. He W Du Y Zhou W Yao C Li X Redox-sensitive dimeric camptothecin phosphatidylcholines-based liposomes for improved anticancer efficacy Nanomed 2019 2019 23 3057 74 10.2217/nnm-2019-0261 31696756 27. Saetern AM Flaten GE Brandl M A method to determine the incorporation capacity of camptothecin in liposomes AAPS PharmSciTech 2004 5 3 e40 10.1208/pt050340 15760073 PMC2750263 28. Lin CH Al-Suwayeh SA Hung CF Chen CC Fang JY Camptothecin-loaded liposomes with α-melanocyte-stimulating hormone enhance cytotoxicity toward and cellular uptake by melanomas: an application of nanomedicine on natural product J Tradit Complement Med 2013 3 2 102 9 10.4103/2225-4110.110423 24716164 PMC3924967 29. Chen F Ehlerding EB Cai W Theranostic nanoparticles J Nucl Med 2014 55 12 1919 22 10.2967/jnumed.114.146019 25413134 PMC4255955 30. Dimchevska S Geskovski N Petruševski G Chacorovska M Popeski-Dimovski R Ugarkovic S et al SN-38 loading capacity of hydrophobic polymer blend nanoparticles: formulation, optimization and efficacy evaluation Drug Dev Ind Pharm 2017 43 3 502 10 10.1080/03639045.2016.1268151 27910713 31. Zhou C Yang Q Zhou X Jia N PDA-coated CPT@MIL-53(Fe)-based theranostic nanoplatform for pH-responsive and MRI-guided chemotherapy J Mater Chem B 2022 10 11 1821 32 10.1039/d1tb02339j 35201249 32. Zhang Y Yin R Wu G Yu M Liu J Wang X et al Self-assembling nanoparticles of dually hydrophobic prodrugs constructed from camptothecin analogue for cancer therapy Eur J Med Chem 2020 200 112365 10.1016/j.ejmech.2020.112365 32460113 ",
  "metadata": {
    "Title of this paper": "Self-assembling nanoparticles of dually hydrophobic prodrugs constructed from camptothecin analogue for cancer therapy",
    "Journal it was published in:": "Oncology Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494098/"
  }
}