{
  "title": "Paper_684",
  "abstract": "pmc PLoS One PLoS One 440 plosone plos PLOS One 1932-6203 PLOS PMC12469114 PMC12469114.1 12469114 12469114 41004487 10.1371/journal.pone.0332988 PONE-D-25-27887 1 Research Article Medicine and Health Sciences Oncology Cancers and Neoplasms Gastrointestinal Tumors Gastric Cancer Medicine and Health Sciences Diagnostic Medicine Prognosis Medicine and Health Sciences Oncology Cancer Treatment Biology and Life Sciences Immunology Immune Response Medicine and Health Sciences Immunology Immune Response Medicine and Health Sciences Oncology Cancers and Neoplasms Carcinoma Nasopharyngeal Carcinoma Physical Sciences Mathematics Applied Mathematics Algorithms Machine Learning Algorithms Research and Analysis Methods Simulation and Modeling Algorithms Machine Learning Algorithms Computer and Information Sciences Artificial Intelligence Machine Learning Machine Learning Algorithms Biology and Life Sciences Computational Biology Genome Analysis Transcriptome Analysis Biology and Life Sciences Genetics Genomics Genome Analysis Transcriptome Analysis Medicine and Health Sciences Oncology Cancers and Neoplasms Malignant Tumors Multi-omics analysis of parthanatos related molecular subgroup and prognostic model development in stomach adenocarcinoma Identification of PRG-related molecular subtypes and prognostic model for STAD Wu Xiangxin Data curation Writing – original draft  1  ‡ Cai Lianming Software Validation  1  ‡ Liu Yanping Methodology Software  1  ‡ Wang Bowen Methodology Software Visualization  1 https://orcid.org/0009-0007-9797-9639 Xia Tianyi Validation Writing – review & editing  2 * Liu Zhenhua Data curation Writing – review & editing  1 * 1 Department of Abdominal Surgery, Ganzhou Cancer Hospital, Ganzhou, China 2 Department of Colorectal Surgery, Harbin Medical University Cancer Hospital, Harbin Medical University, Harbin, China Kim Jin Su Editor  Korea Institute of Radiological and Medical Sciences, KOREA, REPUBLIC OF * E-mail: xiatianyi@hrbmu.edu.cn lzh225898@163.com Competing Interests: ‡ These authors have contributed equally to this work and share first authorship 26 9 2025 2025 20 9 496058 e0332988 23 5 2025 3 9 2025 26 09 2025 27 09 2025 27 09 2025 © 2025 Wu et al 2025 Wu et al https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Multi-omics analysis of parthanatos related molecular subgroup and prognostic model development in stomach adenocarcinoma. 20 9 26 9 2025 e0332988 e0332988 PLoS One 10.1371/journal.pone.0332988 41004487 Multi-omics analysis of parthanatos related molecular subgroup and prognostic model development in stomach adenocarcinoma. 20 9 26 9 2025 e0332988 e0332988 PLoS One 10.1371/journal.pone.0332988 41004487 Stomach adenocarcinoma (STAD), the most prevalent histological subtype of gastric cancer, exhibits high heterogeneity and poor prognosis, posing significant therapeutic challenges. Parthanatos, a distinct form of regulated cell death mediated by poly (ADP-ribose) polymerase-1 (PARP-1), has been implicated in tumor biology and therapeutic resistance; however, the role of parthanatos-associated genes (PRGs) in STAD remains largely unexplored. In this study, we performed a comprehensive multi-omics analysis integrating transcriptomic, genomic, and clinical data from public databases to delineate the molecular landscape of PRGs in STAD. Unsupervised clustering revealed distinct PRG-related molecular subtypes with significant differences in clinical outcomes, immune infiltration profiles, and biological pathway activation. Based on machine learning algorithms, we established and validated a novel PRG-based prognostic signature, which demonstrated robust predictive performance. Moreover, single-cell RNA sequencing and in vitro in vitro http://dx.doi.org/10.13039/100017961 Health Commission of Heilongjiang Province 20230404080327 https://orcid.org/0009-0007-9797-9639 Xia Tianyi This project is supported by Project of Heilongjiang Provincial Health Commission (No. 20230404080327). The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Data Availability All relevant data are within the paper and its Supporting Information Data Availability All relevant data are within the paper and its Supporting Information Introduction Stomach adenocarcinoma (STAD), the predominant histological subtype of gastric cancer, arises from the glandular epithelial cells of the stomach [ 1 2 3 4 5 7 4 8 10 Different from necroptosis, pyroptosis or ferroptosis, parthanatos is a recently recognized form of regulated cell death [ 11 12 13 14 15 18 19 Although the precise mechanisms remain unclear, emerging evidence suggests that parthanatos plays a critical role in tumorigenesis [ 20 21 22 23 24 25 24 Despite increasing interest in parthanatos in cancer biology, the expression landscape and clinical relevance of parthanatos-associated genes (PRGs) in STAD remain poorly characterized. Advances in multi-omics technologies have made further research possible [ 26 29 in vitro Materials and methods Data collection Transcriptomic expression matrices and corresponding clinical baseline information from both normal control (NC) and STAD tissue samples were obtained from two publicly available databases: The Cancer Genome Atlas (TCGA) and the Gene Expression Omnibus (GEO). Transcriptomic profiles (count format) and clinical data for STAD samples from TCGA were downloaded in the R programming environment and “limma” R script was employed to convert the count-format transcriptomic data obtained from the TCGA database into transcripts per million (TPM) formats. Gene annotation and parsing of transcriptomic matrices were conducted using Perl, based on the human genome annotation files. Samples lacking survival information or with an overall survival (OS) rate of less than 30 days were excluded from further analysis. Following this filtering, a total of 32 NC samples and 337 STAD samples from the TCGA cohort were included in subsequent analyses. From the GEO database, two STAD-related expression datasets were selected and downloaded: GSE84437 GSE15459 GSE84437 GPL6947 GSE15459 GPL570 GSE84437 GSE15459 GSE84437 30 7 GSE15459 Identification of differentially expressed parthanatos-related genes and molecular subtype characterization A total of 37 PRG were retrieved from the GeneCards database using “Parthanatos” as the search keyword ( S1 Table p Immune microenvironment infiltration landscape and immunotherapy response prediction Based on the transcriptomic matrix of STAD samples, the ESTIMATE algorithm (Estimation of STromal and Immune cells in MAlignant Tumor tissues using Expression data) was applied using the “estimate” R package to infer the infiltration levels of stromal and immune components within the tumor microenvironment. This analysis yielded four quantitative indices: Immune Score, Stromal Score, ESTIMATE Score, and tumor purity, providing a comprehensive assessment of immune infiltration across molecular subgroups. To further quantify the relative abundance of 23 immune cell types, single-sample Gene Set Enrichment Analysis (ssGSEA) was conducted using the “GSVA” package in R, based on curated marker genes specific to each immune cell population. To evaluate the potential responsiveness of different subgroups to immunotherapy, the Tumor Immune Dysfunction and Exclusion (TIDE) algorithm was employed via the TIDE web platform ( http://tide.dfci.harvard.edu/ https://tcia.at/ Identification of gene subtype characterization associated with prg molecular subtypes Differentially expressed genes (DEGs) among the PRG molecular subtypes were identified using the “limma” package in R, with threshold criteria set at |fold change| ≥ 2 and adjusted p Construction of prognostic risk model based on the prg score using integrated machine learning algorithms Univariate Cox regression analysis was performed using the “survival” R package to assess the prognostic significance of DEGs within the training datasets (TCGA and GSE84437 GSE15459 31 Independent prognostic analysis and nomogram construction Univariate and multivariate Cox regression analyses were performed using the “survival” R package to estimate the hazard ratios (HR) and P-values for each clinical variable and the PRG score in both the training and validation cohorts. To predict 1-, 3-, and 5-year OS rate in patients with STAD, a prognostic nomogram integrating clinical variables and the PRG score was constructed using the “rms” R package. Calibration curves were generated with the “regplot” and “rms” R packages to assess the consistency between the predicted and observed survival probabilities. Time-dependent receiver operating characteristic (ROC) curves were plotted using the “timeROC” R package, and the area under the curve (AUC) was calculated to evaluate the predictive accuracy of the model. Tumor mutation burden landscape and drug sensitivity prediction TMB data for STAD samples were extracted using Perl scripts, and TMB scores were calculated for each individual sample. The somatic mutation profiles of different PRG score subgroups were visualized using waterfall plots generated by the “maftools” R package. Furthermore, to assess the potential sensitivity to chemotherapeutic agents, the half-maximal inhibitory concentration (IC50) values were predicted across subgroups using the “pRRophetic” R package, based on data from the Genomics of Drug Sensitivity in Cancer (GDSC) database. Single-Cell RNA sequencing analysis The single-cell RNA sequencing dataset GSE163558 p Cell-cell communication analysis To explore intercellular communication patterns between different cell types, we applied the “CellChat” R package to model ligand-receptor interactions using the processed Seurat object. The dataset was first split into GC and NC groups using the “SplitObject” function. CellChat objects were constructed for each group using createCellChat, and cell populations were annotated using the “cellType” metadata. We then specified the human ligand-receptor interaction database CellChatDB.human and performed a series of preprocessing steps, including subsetData, identifyOverExpressedGenes, and identifyOverExpressedInteractions, to extract relevant signaling molecules. Merged CellChat objects were used to compare communication patterns across groups with compareInteractions, netVisual_circle, and netVisual_diffInteraction. Interaction heatmaps (netVisual_heatmap) were plotted to visualize frequency distributions. To investigate functional differences in signaling, we applied computeNetSimilarityPairwise, followed by netEmbedding and rankSimilarity. All visualizations were generated using ggplot2-based plotting functions and circle or heatmap layouts provided by CellChat. Cell culture The human gastric epithelial cell line GES-1 and the human gastric cancer cell line HGC-27 were purchased from the American Type Culture Collection (ATCC). GES-1 cells were cultured in RPMI-1640 medium supplemented with 10% fetal bovine serum (FBS), while HGC-27 cells were maintained in DMEM containing 10% FBS. Both cell lines were incubated at 37°C in a humidified atmosphere with 5% CO₂. Cells were passaged when they reached 70–80% confluency using 0.25% trypsin. The culture medium was replaced every 2–3 days. Cell morphology and growth were regularly monitored under an inverted microscope to ensure optimal conditions and to check for any signs of contamination. Western blot analysis Total protein was extracted from GES-1 and HGC-27 cells using RIPA lysis buffer supplemented with 1% PMSF. Cells were cultured to 80–90% confluence, washed with PBS, and lysed on ice for 15 minutes. The lysates were sonicated and then centrifuged at 12,000 × g for 10 minutes at 4°C. Protein concentrations were determined using a BCA assay (Beyotime, P0012). Equal amounts of protein (20 μg) were separated on 12% SDS-PAGE gels and transferred onto PVDF membranes (Millipore, IPVH00010). The membranes were blocked with 5% non-fat milk for 1 hour and incubated overnight at 4°C with primary antibodies against COL8A1 (1:1000, Abcam, ab192350) and GAPDH (1:5000, Sigma, A1978). After washing with TBST, the membranes were incubated with HRP-conjugated secondary antibody (1:5000, CST, 7074) for 1 hour. Chemiluminescent detection was performed using ECL reagent (Thermo Fisher, 34095), and images were captured with the ChemiDoc XRS+ system (Bio-Rad). Band intensities were quantified using ImageJ software, with GAPDH as the loading control. siRNA-mediated knockdown of COL8A1 To investigate the role of COL8A1 in HGC-27 cells, small interfering RNA (siRNA) was used for gene silencing. COL8A1-specific siRNA sequences were designed and synthesized by GenePharma. A non-targeting siRNA (siNC) was used as the negative control. HGC-27 cells were seeded in 6-well plates to achieve 70–80% confluence. Transfection was carried out using Lipofectamine™ 3000 (Thermo Fisher, L3000-015) according to the manufacturer’s protocol. siRNA and Lipofectamine were pre-incubated at room temperature for 10–15 minutes to form complexes, which were then added to the cells. After 24 hours, the medium was replaced, and the cells were cultured for an additional 48 hours. The efficiency of COL8A1 knockdown was confirmed by Western blot analysis of COL8A1 protein expression. Cell viability assay To evaluate the proliferation of HGC-27 cells transfected with either siNC or siCOL8A1, a CCK-8 assay was performed using the CCK-8 kit (Dojindo, CK04). Transfected cells were seeded into 96-well plates at a density of 1,000 cells per well. After 24 hours, 10 μL of CCK-8 solution was added to each well and incubated for 2 hours. The optical density was measured at 450 nm using a microplate reader (BioTek, ELx800). Measurements were taken at 24-, 48-, 72-, and 96-hours post-transfection. Each group was tested in triplicate. Colony formation assay To assess the impact of COL8A1 knockdown on clonogenic capacity, transfected HGC-27 cells were seeded at a density of 200 cells per well in 6-well plates and cultured for 1 week. The medium was refreshed every 3 days. Colonies were fixed in 4% paraformaldehyde and stained with 0.1% crystal violet for 1 hour. After washing, colonies containing ≥ 50 cells were counted under a microscope. All assays were performed in triplicate. Transwell migration and invasion assays To evaluate the effects of siNC and siCOL8A1 transfection on the migration and invasion capabilities of HGC-27 cells, Transwell chambers (Corning, 3422) were used. For the migration assay, transfected HGC-27 cells (2 × 10⁴ cells/well) were suspended in serum-free RPMI-1640 medium and seeded into the upper chambers. The lower chambers were filled with medium containing 20% fetal bovine serum as a chemoattractant. After 24 hours of incubation, non-migrated cells on the upper surface of the membrane were gently removed with a cotton swab. Migrated cells on the underside of the membrane were fixed with 4% paraformaldehyde, stained with 0.1% crystal violet, and then counted under a microscope. For the invasion assay, Transwell chambers were pre-coated with Matrigel (BD Biosciences). The rest of the procedure was the same as for the migration assay. The number of invading cells was quantified by counting stained cells in five randomly selected fields under a microscope. Each experiment was performed in triplicate. Statistical analysis In this study, all statistical analyses were conducted using R software (version 4.4.1), Perl, and GraphPad Prism. Kaplan-Meier survival curves were generated to assess overall survival, and differences between groups were compared using the log-rank test. The Wilcoxon rank-sum test and Student’s t-test were used to evaluate statistical significance between two groups, while one-way analysis of variance (ANOVA) was employed for comparisons among multiple groups. For multiple comparisons, the Bonferroni correction was applied to adjust p p p p p Results Differential expression analysis and mutation landscape of PRG signatures in STAD A total of 37 PRGs were analyzed to investigate their potential regulatory roles in the initiation and progression of STAD. The differential expression analysis revealed that 14 PRG signatures were significantly upregulated in the STAD group compared to the NC group, such as COL8A1, FEN1, NAT10, CYBB, and PARP1 ( Fig 1A Fig 1B Fig 1C Fig 1D 10.1371/journal.pone.0332988.g001 Fig 1 Differential expression analysis and mutational landscape of PRG. (A) Differential expression analysis of PRG between NC and STAD samples. Thresholds for significance were set at |fold change| ≥ 2 and adjusted p-value < 0.05. (B) CNV frequency analysis of DE-PRG signatures in STAD. (C) Waterfall plot illustrating the mutation burden landscape of DE-PRG signatures in STAD. (D) Prognostic significance and correlation analysis of DE-PRG signatures in STAD. Molecular subtype characterization of PRG in STAD To further clarify the potential role of PRG in STAD, we integrated the TCGA and GSE84437 Fig 2A 2C Fig 2D Fig 2E Fig 2F Fig 2G 2H Fig 2I 10.1371/journal.pone.0332988.g002 Fig 2 Identification of PRG molecular subtypes and prognostic outcome analysis. (A-C) Identification of distinct PRG molecular subtypes in STAD using unsupervised consensus clustering analysis. (D) PCA plot illustrating the distinct distribution patterns of the identified PRG subtypes. (E) Kaplan–Meier survival analysis based on the log-rank test to evaluate the prognostic outcomes of different PRG subtypes. (F) Differential expression analysis of DE-PRG signatures among the PRG molecular subtypes. (G-I) KEGG pathway enrichment analysis showing signaling differences among PRG molecular subtypes. Immune microenvironment infiltration landscape and immunotherapy response prediction of PRG molecular subtypes GSVA results revealed aberrant regulation of immune-related pathways across the three PRG molecular subtypes, suggesting that immune dysregulation may contribute to the observed differences in clinical outcomes. Subsequently, using various immune infiltration algorithms, we assessed the immune microenvironment infiltration landscape of the PRG molecular subtypes. ESTIMATE results indicated that in PRG subtype B, the immune score, stromal score, and ESTIMATE score of STAD samples were significantly reduced, while tumor purity was markedly increased, suggesting that PRG subtype B might exhibit a prominent immunosuppressive state ( Fig 3A 3D Fig 3E Fig 3F Fig 3G 3I 10.1371/journal.pone.0332988.g003 Fig 3 Immune microenvironment landscape and immunotherapy response evaluation of PRG molecular subtypes. (A–D) Immune infiltration status of PRG molecular subtypes assessed using the ESTIMATE algorithm. (E) Quantitative analysis of the infiltration levels of 23 immune cell types based on the ssGSEA algorithm. (F) TIDE score-based prediction of immune evasion potential. (G–I) IPS score analysis revealing the differential response of PRG molecular subtypes to CTLA-4 and PD-1 targeted therapies. Identification of gene subtype related to PRG molecular subtypes To elucidate the potential mechanisms behind the clinical survival outcome differences of PRG molecular subtypes, we identified DEGs between the PRG subgroups under the threshold conditions of |fold change| ≥ 2 and p.adjust < 0.05 ( Fig 4A Fig 4B 4C Fig 4D Fig 4E Fig 4F 10.1371/journal.pone.0332988.g004 Fig 4 Gene subtyping analysis based on DEGs among PRG molecular subtypes. (A) Identification of DEGs among the PRG molecular subtypes. (B, C) GO and KEGG enrichment analyses of the identified DEGs. (D) PCA plot illustrating the distribution patterns of the three gene subtypes. (E) Kaplan–Meier survival curves of the gene subtypes based on log-rank analysis. (F) Expression profiles of DEGs across different clinicopathological features and molecular subgroups. Comprehensive analysis of PRG score index for predicting clinical prognosis of STAD based on machine learning algorithms In the training cohort, we used univariate Cox analysis to assess the prognostic value of DEGs in STAD and identify prognostic variables. Based on an independent external validation cohort ( GSE15459 Fig 5B 5C Fig 5D 5E Fig 5F 5G Fig 5H 10.1371/journal.pone.0332988.g005 Fig 5 Construction of the PRG score index using integrated machine learning algorithms. (A) C-index calculated for both training and validation cohorts using combinations of 10 different machine learning algorithms. (B, C) Stratification of PRG score subgroups in the training and validation cohorts. (D, E) Kaplan–Meier survival analysis of PRG score subgroups in two independent cohorts. (F, G) Differential analysis of PRG scores across PRG score subgroups and gene subtypes. (H) Sankey diagram illustrating the potential relationships among PRG molecular subtypes, gene subtypes, PRG score subgroups, and clinical outcomes. Independent prognostic value assessment and nomogram model construction In subsequent studies, we further evaluated the independent prognostic value of the PRG score index in predicting STAD clinical survival outcomes. In the training cohort, univariate and multivariate results indicated that stage and PRG score were associated with poor prognosis in STAD ( Fig 6A 6B GSE15459 Fig 6C 6D Fig 6E 6H Fig 6F 6I Fig 6G 6J 10.1371/journal.pone.0332988.g006 Fig 6 Evaluation of the independent prognostic value of the PRG score index and construction of a nomogram model. (A-D) Univariate and multivariate Cox regression analyses of clinicopathological variables and the PRG score in the training cohort and validation cohort. (E, F) Nomogram model construction and calibration curve analysis based on clinicopathological variables and the PRG score index in the training cohort. (G) Time-dependent ROC curve analysis in the training cohort. (H, I) Nomogram model construction and calibration curve analysis based on clinicopathological variables and the PRG score index in the validation cohort. (J) Time-dependent ROC curve analysis in the validation cohort. Mutation burden landscape and immune therapy response prediction of PRG score subgroups TMB has been reported to be closely associated with the efficacy of immune checkpoint inhibitors and can serve as a biomarker to predict the response to immunotherapy. In subsequent studies, we further assessed the mutation burden landscape and immune therapy response outcomes in different PRG score subgroups. The mutation burden landscape results showed that in the low PRG score subgroup, TMB scores were significantly higher ( Fig 7A Fig 7B 7D Fig 7E 7F 10.1371/journal.pone.0332988.g007 Fig 7 Immunotherapy response prediction and mutational burden landscape analysis of PRG score subgroups. (A) Differential analysis of TMB scores between PRG scores subgroups. (B–D) IPS analysis of PRG score subgroups. (E, F) Waterfall plots illustrating the somatic mutation landscape of PRG score subgroups. Immune microenvironment infiltration landscape and drug sensitivity analysis of PRG score subgroups ESTIMATE results indicated that in the high PRG score subgroup, the ESTIMATE score and stromal score were significantly higher, while tumor purity was significantly lower. Notably, there were no significant differences in immune scores between PRG subgroups ( Fig 8A 8D Fig 8E Fig 8F 10.1371/journal.pone.0332988.g008 Fig 8 Immune microenvironment landscape and drug sensitivity analysis. (A–D) Evaluation of immune infiltration characteristics using the ESTIMATE algorithm. (E) Assessment of the infiltration proportions of 23 immune cell types based on the ssGSEA algorithm. (F) Drug sensitivity analysis of PRG score subgroups. Single-cell sequencing analysis reveals expression features of prognostic signatures in cell subpopulations We further assessed the classification of cell subpopulations and the expression characteristics of prognostic signatures in STAD at the single-cell sequencing level. Based on the single-cell dataset GSE163558 Fig 9A 9B Fig 9C Fig 9D 9E Fig 9F Fig 9G 9H Fig 9I Fig 9J 10.1371/journal.pone.0332988.g009 Fig 9 Single-cell RNA sequencing analysis reveals the expression patterns of the prognostic signature across cellular subpopulations. (A) Quality control of the single-cell RNA-seq dataset GSE163558 Cell-cell communication landscape To explore intercellular communication patterns, we constructed comprehensive cell–cell interaction networks based on single-cell transcriptomic profiles. The analysis revealed a marked increase in both the number and overall strength of cell–cell interactions in the GC group compared to the NC group, suggesting enhanced signaling activity within the tumor microenvironment ( Fig 10A Fig 10B Fig 10C Fig 10D 10.1371/journal.pone.0332988.g010 Fig 10 Comparative analysis of cell-cell communication networks between NC and GC samples. (A) Bar plots showing the total number (left) and overall strength (right) of inferred intercellular interactions in NC and GC samples. (B) Differential intercellular communication network between GC and NC. (C) Circle plots depicting the number and strength of intercellular communications in NC (top row) and GC (bottom row). (D) Heatmaps displaying the number of interactions among different cell types in NC (left) and GC (right). COL8A1 knockdown significantly suppresses the proliferation and migration of STAD cells Based on the risk coefficients constructed using the PRG scoring system, we found that COL8A1 had the highest risk coefficient, suggesting that it may be a key factor influencing STAD prognosis. Therefore, we further explored the potential role of COL8A1 in the development of STAD. Western blot analysis revealed that COL8A1 protein expression was significantly higher in the HGC-27 cell line compared to the normal GSE-1 cell line ( Fig 11A 11C Fig 11B 11D Fig 11E 11F Fig 11G 11H Fig 11I 10.1371/journal.pone.0332988.g011 Fig 11 Suppression of COL8A1 expression significantly reduces the proliferation and migration of STAD cells. (A, C) WB analysis of COL8A1 expression in GES-1 and HGC-27 cell lines. (B, D) WB analysis of COL8A1 knockdown efficiency in siNC and siCOL8A1 groups. (E, F) Colony formation assays evaluating proliferative capacity. (G, H) Cell invasion assays assessing migratory ability. (I) CCK-8 assay measuring cell viability. * p p p Discussion Given the clinical heterogeneity of STAD, effective risk stratification is essential for guiding treatment decisions and improving patient outcomes. Classical pathways, such as those involving caspase and p53, are frequently implicated in the development of drug resistance in gastric cancer cells, complicating effective treatment [ 32 34 35 in vitro 36 37 in vitro Parthanatos, along with other regulated forms of cell death such as necroptosis, pyroptosis, and ferroptosis, represents a key hallmark of tumorigenesis and may lead to the development of distinct potential therapeutic strategies [ 38 39 40 41 42 43 44 45 46 Based on unsupervised consensus clustering of PRG expression profiles, we identified three distinct molecular subtypes, each exhibiting unique immune features and clinical relevance. Subtype A showed moderate immune activity and favorable prognosis, while subtype B was characterized by an immunosuppressive microenvironment, including downregulation of key immune pathways and reduced immune cell infiltration [ 47 48 49 50 51 53 54 Our pathway enrichment results show that extracellular matrix-related pathways are enriched across different subgroups, suggesting that the extracellular matrix (ECM) may be a contributing factor to the prognostic differences among the three subtypes. The remodeling of the extracellular matrix (ECM) in tumor tissues can regulate cell interactions by triggering biochemical signals, thereby participating in processes such as proliferation, metastasis, angiogenesis and immune evasion, ultimately influencing cancer progression, metastasis, and dormancy [ 55 56 57 58 59 60 In the tumor immune microenvironment of STAD patients with a high PRG score and poorer prognosis, we observed significantly lower levels of CD4 + 61 62 65 66 Our in vitro 67 68 69 70 71 72 73 74 75 76 77 78 79 80 In conclusion, our study comprehensively elucidates the potential role of PRG in the tumor progression and immune microenvironment of STAD through integrative bioinformatics analyses and experimental validation. These findings not only expand our understanding of the molecular mechanisms underlying STAD but also provide novel insights into potential prognostic biomarkers and therapeutic targets. However, several limitations should be acknowledged. First, although our analyses were based on large-scale public databases and multi-omics data, inherent heterogeneity and potential batch effects across datasets may influence the robustness of the results. Second, the functional roles of key genes were only partially validated in vitro in vivo Supporting information S1 Table The parthanatos-related gene signatures. (XLSX) S2 Raw images. (PDF) References 1 Tanaka K Hirasawa T Gastric Adenocarcinoma and Proximal Polyposis of the Stomach N Engl J Med 2025 392 11 doi: 10.1056/NEJMicm2413107 40073312 2 Hirata Y Noorani A Song S Wang L Ajani JA Early stage gastric adenocarcinoma: clinical and molecular landscapes Nat Rev Clin Oncol 2023 20 7 453 69 doi: 10.1038/s41571-023-00767-w 37264184 PMC11869628 3 Svrcek M Voron T André T Smyth EC de la Fouchardière C Improving individualised therapies in localised gastro-oesophageal adenocarcinoma Lancet Oncol 2024 25 9 63 doi: 10.1016/S1470-2045(24)00180-3 39214116 4 Taieb J Bennouna J Penault-Llorca F Basile D Samalin E Zaanan A Treatment of gastric adenocarcinoma: A rapidly evolving landscape Eur J Cancer 2023 195 113370 doi: 10.1016/j.ejca.2023.113370 37948843 5 Veas Rodriguez J Piñol M Sorolla MA Parisi E Sorolla A Santacana M et al Comprehensive immunophenotyping of gastric adenocarcinoma identifies an inflamed class of tumors amenable to immunotherapies J Immunother Cancer 2025 13 3 doi: 10.1136/jitc-2024-010024 40102027 PMC11927434 6 Joshi SS Badgwell BD Current treatment and recent progress in gastric cancer CA Cancer J Clin 2021 71 3 264 79 doi: 10.3322/caac.21657 33592120 PMC9927927 7 Feng X Luo Z Zhang W Wan R Chen Y Li F et al Zn‐DHM Nanozymes Enhance Muscle Regeneration Through ROS Scavenging and Macrophage Polarization in Volumetric Muscle Loss Revealed by Single‐Cell Profiling Adv Funct Materials 2025 35 35 doi: 10.1002/adfm.202506476 8 Zavros Y Merchant JL The immune microenvironment in gastric adenocarcinoma Nat Rev Gastroenterol Hepatol 2022 19 7 451 67 doi: 10.1038/s41575-022-00591-0 35288702 PMC9809534 9 Blangé D Stroes CI Derks S Bijlsma MF van Laarhoven HWM Resistance mechanisms to HER2-targeted therapy in gastroesophageal adenocarcinoma: A systematic review Cancer Treat Rev 2022 108 102418 doi: 10.1016/j.ctrv.2022.102418 35689885 10 Xing P Wang S Cao Y Liu B Zheng F Guo W et al Treatment strategies and drug resistance mechanisms in adenocarcinoma of different organs Drug Resist Updat 2023 71 101002 doi: 10.1016/j.drup.2023.101002 37678078 11 Andrabi SA Dawson TM Dawson VL Mitochondrial and nuclear cross talk in cell death: parthanatos Ann N Y Acad Sci 2008 1147 233 41 doi: 10.1196/annals.1427.014 19076445 PMC4454457 12 Robinson N Ganesan R Hegedűs C Kovács K Kufer TA Virág L Programmed necrotic cell death of macrophages: Focus on pyroptosis, necroptosis, and parthanatos Redox Biol 2019 26 101239 doi: 10.1016/j.redox.2019.101239 31212216 PMC6582207 13 Yu S-W Wang H Poitras MF Coombs C Bowers WJ Federoff HJ et al Mediation of poly(ADP-ribose) polymerase-1-dependent cell death by apoptosis-inducing factor Science 2002 297 5579 259 63 doi: 10.1126/science.1072221 12114629 14 Wang Y An R Umanah GK Park H Nambiar K Eacker SM et al A nuclease that mediates cell death induced by DNA damage and poly(ADP-ribose) polymerase-1 Science 2016 354 6308 doi: 10.1126/science.aad6872 27846469 PMC5134926 15 Virág L Scott GS Cuzzocrea S Marmer D Salzman AL Szabó C Peroxynitrite-induced thymocyte apoptosis: the role of caspases and poly (ADP-ribose) synthetase (PARS) activation Immunology 1998 94 3 345 55 doi: 10.1046/j.1365-2567.1998.00534.x 9767416 PMC1364252 16 Virág L Salzman AL Szabó C Poly(ADP-ribose) synthetase activation mediates mitochondrial injury during oxidant-induced cell death J Immunol 1998 161 7 3753 9 9759901 17 Viráģ L Scott GS Antal-Szalmás P O’Connor M Ohshima H Szabó C Requirement of intracellular calcium mobilization for peroxynitrite-induced poly(ADP-ribose) synthetase activation and cytotoxicity Mol Pharmacol 1999 56 4 824 33 10496967 18 Virág L Szabó C BCL-2 protects peroxynitrite-treated thymocytes from poly(ADP-ribose) synthase (PARS)-independent apoptotic but not from PARS-mediated necrotic cell death Free Radic Biol Med 2000 29 8 704 13 doi: 10.1016/s0891-5849(00)00359-2 11053771 19 Crawford K Bonfiglio JJ Mikoč A Matic I Ahel I Specificity of reversible ADP-ribosylation and regulation of cellular processes Crit Rev Biochem Mol Biol 2018 53 1 64 82 doi: 10.1080/10409238.2017.1394265 29098880 20 Zhou Y Liu L Tao S Yao Y Wang Y Wei Q et al Parthanatos and its associated components: Promising therapeutic targets for cancer Pharmacol Res 2021 163 105299 doi: 10.1016/j.phrs.2020.105299 33171306 21 Yang M Wang C Zhou M Bao L Wang Y Kumar A et al KDM6B promotes PARthanatos via suppression of O6-methylguanine DNA methyltransferase repair and sustained checkpoint response Nucleic Acids Res 2022 50 11 6313 31 doi: 10.1093/nar/gkac471 35648484 PMC9226499 22 Jiang X Deng W Tao S Tang Z Chen Y Tian M et al A RIPK3-independent role of MLKL in suppressing parthanatos promotes immune evasion in hepatocellular carcinoma Cell Discov 2023 9 1 7 doi: 10.1038/s41421-022-00504-0 36650126 PMC9845215 23 Zhang Y Zhang C Li J Jiang M Guo S Yang G et al Inhibition of AKT induces p53/SIRT6/PARP1-dependent parthanatos to suppress tumor growth Cell Commun Signal 2022 20 1 93 doi: 10.1186/s12964-022-00897-1 35715817 PMC9205131 24 Gupta G Afzal M Moglad E Goyal A Almalki WH Goyal K et al Parthanatos and apoptosis: unraveling their roles in cancer cell death and therapy resistance EXCLI J 2025 24 351 80 doi: 10.17179/excli2025-8251 40166425 PMC11956527 25 Maru B Messikommer A Huang L Seipel K Kovecses O Valk PJM et al PARP-1 improves leukemia outcomes by inducing parthanatos during chemotherapy Cell Rep Med 2023 4 9 101191 doi: 10.1016/j.xcrm.2023.101191 37683650 PMC10518631 26 Baysoy A Bai Z Satija R Fan R The technological landscape and applications of single-cell multi-omics Nat Rev Mol Cell Biol 2023 24 10 695 713 doi: 10.1038/s41580-023-00615-w 37280296 PMC10242609 27 Li Y Wu X Fang D Luo Y Informing immunotherapy with multi-omics driven machine learning NPJ Digit Med 2024 7 1 67 doi: 10.1038/s41746-024-01043-6 38486092 PMC10940614 28 Huang J Chen Y Guo Z Yu Y Zhang Y Li P et al Prospective study and validation of early warning marker discovery based on integrating multi-omics analysis in severe burn patients with sepsis Burns Trauma 2023 11 doi: 10.1093/burnst/tkac050 36659877 PMC9840905 29 Li Y Teng M Li S Yang H Zhang Y Cui M et al Macrophage differentiation in enhancing hematopoietic function of ribonucleic acid for injection II via multi-omics analysis Acta Materia Medica 2024 3 3 doi: 10.15212/amm-2024-0001 30 Lin Z Wang F Yin R Li S Bai Y Zhang B et al Single-cell RNA sequencing and immune microenvironment analysis reveal PLOD2-driven malignant transformation in cervical cancer Front Immunol 2025 15 1522655 doi: 10.3389/fimmu.2024.1522655 39840054 PMC11747275 31 Zhu W Zeng H Huang J Wu J Wang Y Wang Z et al Integrated machine learning identifies epithelial cell marker genes for improving outcomes and immunotherapy in prostate cancer J Transl Med 2023 21 1 782 doi: 10.1186/s12967-023-04633-2 37925432 PMC10625713 32 Costa L Corre S Michel V Le Luel K Fernandes J Ziveri J et al USF1 defect drives p53 degradation during Helicobacter pylori infection and accelerates gastric carcinogenesis Gut 2020 69 9 1582 91 doi: 10.1136/gutjnl-2019-318640 31822580 PMC7456735 33 Zhou M Dong J Huang J Ye W Zheng Z Huang K et al Chitosan-Gelatin-EGCG Nanoparticle-Meditated LncRNA TMEM44-AS1 Silencing to Activate the P53 Signaling Pathway for the Synergistic Reversal of 5-FU Resistance in Gastric Cancer Adv Sci (Weinh) 2022 9 22 doi: 10.1002/advs.202105077 35717675 PMC9353463 34 Ma J Zhao J Zhang C Tan J Cheng A Niu Z et al Cleavage of CAD by caspase-3 determines the cancer cell fate during chemotherapy Nat Commun 2025 16 1 5006 doi: 10.1038/s41467-025-60144-2 40442064 PMC12123037 35 Mázló A Tang Y Jenei V Brauman J Yousef H Bácsi A et al Resolution Potential of Necrotic Cell Death Pathways Int J Mol Sci 2022 24 1 16 doi: 10.3390/ijms24010016 36613458 PMC9819908 36 Qiao X Sun J Ren P Guo H Xu H Bao C et al Integrated single-cell sequencing, spatial transcriptome sequencing and bulk RNA sequencing highlights the molecular characteristics of parthanatos in gastric cancer Aging (Albany NY) 2024 16 6 5471 500 doi: 10.18632/aging.205658 38499384 PMC11006479 37 Su W Shi X Wen X Li X Zhou J Zhou Y et al Integrative analysis of multiple cell death model for precise prognosis and drug response prediction in gastric cancer Discov Oncol 2024 15 1 532 doi: 10.1007/s12672-024-01411-4 39377861 PMC11461726 38 Liu Y Stockwell BR Jiang X Gu W p53-regulated non-apoptotic cell death pathways and their relevance in cancer and other diseases Nat Rev Mol Cell Biol 2025 26 8 600 14 doi: 10.1038/s41580-025-00842-3 40204927 39 Peng F Liao M Qin R Zhu S Peng C Fu L et al Regulated cell death (RCD) in cancer: key pathways and targeted therapies Signal Transduct Target Ther 2022 7 1 286 doi: 10.1038/s41392-022-01110-y 35963853 PMC9376115 40 Nossa CW Blanke SR Helicobacter pylori activation of PARP-1: usurping a versatile regulator of host cellular health Gut Microbes 2010 1 6 373 8 doi: 10.4161/gmic.1.6.13572 21468218 PMC3056101 41 He W Liu T Shan Y Zhu K Li Y PARP1 polymorphisms increase the risk of gastric cancer in a Chinese population Mol Diagn Ther 2012 16 1 35 42 doi: 10.1007/BF03256428 22221038 42 Afzal H Yousaf S Rahman F Ahmed MW Akram Z Akhtar Kayani M et al PARP1: A potential biomarker for gastric cancer Pathol Res Pract 2019 215 8 152472 doi: 10.1016/j.prp.2019.152472 31174925 43 Wang Q Xiong J Qiu D Zhao X Yan D Xu W et al Inhibition of PARP1 activity enhances chemotherapeutic efficiency in cisplatin-resistant gastric cancer cells Int J Biochem Cell Biol 2017 92 164 72 doi: 10.1016/j.biocel.2017.08.001 28827033 44 Fang Z Gong C Ye Z Wang W Zhu M Hu Y et al TOPBP1 regulates resistance of gastric cancer to oxaliplatin by promoting transcription of PARP1 DNA Repair (Amst) 2022 111 103278 doi: 10.1016/j.dnarep.2022.103278 35124372 45 Li H Wang C Lan L Yan L Li W Evans I et al METTL3 promotes oxaliplatin resistance of gastric cancer CD133+ stem cells by promoting PARP1 mRNA stability Cell Mol Life Sci 2022 79 3 135 doi: 10.1007/s00018-022-04129-0 35179655 PMC11072755 46 Wang C Yi T Li X Cui J Li B Qin Y et al Ailanthone synergizes with PARP1 inhibitor in tumour growth inhibition through crosstalk of DNA repair pathways in gastric cancer J Cell Mol Med 2024 28 2 doi: 10.1111/jcmm.18033 38009603 PMC10826444 47 Zhou H Jing S Liu Y Wang X Duan X Xiong W et al Identifying the key genes of Epstein-Barr virus-regulated tumour immune microenvironment of gastric carcinomas Cell Prolif 2023 56 3 doi: 10.1111/cpr.13373 36519208 PMC9977676 48 de Zawadzki A Leeming DJ Sanyal AJ Anstee QM Schattenberg JM Friedman SL et al Hot and cold fibrosis: The role of serum biomarkers to assess immune mechanisms and ECM-cell interactions in human fibrosis J Hepatol 2025 83 1 239 57 doi: 10.1016/j.jhep.2025.02.039 40056933 49 Li D Wang Y Shi C Fu S Sun Y-F Li C Targeting GPC3high cancer-associated fibroblasts sensitizing the PD-1 blockage therapy in gastric cancer Ann Med 2023 55 1 2189295 doi: 10.1080/07853890.2023.2189295 37036308 PMC10088929 50 Chen H Zheng Z Yang C Tan T Jiang Y Xue W Machine learning based intratumor heterogeneity signature for predicting prognosis and immunotherapy benefit in stomach adenocarcinoma Sci Rep 2024 14 1 23328 doi: 10.1038/s41598-024-74907-2 39375438 PMC11458769 51 Zhao Z Dong Y Zhao Z Xiahou Z Sun C Single-cell atlas of endothelial cells in atherosclerosis: identifying C1 CXCL12+ ECs as key proliferative drivers for immunological precision therapeutics in atherosclerosis Front Immunol 2025 16 1569988 doi: 10.3389/fimmu.2025.1569988 40421026 PMC12104226 52 Zhao Z Zhao Z Lin Z Fan L Xiahou Z Dong Y et al Decoding multiple myeloma: single-cell insights into tumor heterogeneity, immune dynamics, and disease progression Front Immunol 2025 16 1584350 doi: 10.3389/fimmu.2025.1584350 40406148 PMC12095158 53 Ma R Zhou X Zhai X Wang C Hu R Chen Y et al Single-cell RNA sequencing reveals immune cell dysfunction in the peripheral blood of patients with highly aggressive gastric cancer Cell Prolif 2024 57 5 doi: 10.1111/cpr.13591 38319150 PMC11056698 54 Li S Yao J Zhang S Zhou X Zhao X Di N et al Prognostic Value of Tumor-microenvironment-associated Genes in Ovarian Cancer BIOI 2022 4 3 doi: 10.15212/bioi-2022-0008 55 Eble JA Niland S The extracellular matrix in tumor progression and metastasis Clin Exp Metastasis 2019 36 3 171 98 doi: 10.1007/s10585-019-09966-1 30972526 56 Di Martino JS Nobre AR Mondal C Taha I Farias EF Fertig EJ et al A tumor-derived type III collagen-rich ECM niche regulates tumor cell dormancy Nat Cancer 2022 3 1 90 107 doi: 10.1038/s43018-021-00291-9 35121989 PMC8818089 57 Prakash J Shaked Y The Interplay between Extracellular Matrix Remodeling and Cancer Therapeutics Cancer Discov 2024 14 8 1375 88 doi: 10.1158/2159-8290.CD-24-0002 39091205 PMC11294818 58 Yuan Z Li Y Zhang S Wang X Dou H Yu X et al Extracellular matrix remodeling in tumor progression and immune escape: from mechanisms to treatments Mol Cancer 2023 22 1 48 doi: 10.1186/s12943-023-01744-8 36906534 PMC10007858 59 Yuzhalin AE Urbonas T Silva MA Muschel RJ Gordon-Weeks AN A core matrisome gene signature predicts cancer outcome Br J Cancer 2018 118 3 435 40 doi: 10.1038/bjc.2017.458 29360819 PMC5808042 60 Jang M Koh I Lee JE Lim JY Cheong J-H Kim P Increased extracellular matrix density disrupts E-cadherin/β-catenin complex in gastric cancer cells Biomater Sci 2018 6 10 2704 13 doi: 10.1039/c8bm00843d 30151505 61 Segura-Villalobos D Ramírez-Moreno IG Martínez-Aguilar M Ibarra-Sánchez A Muñoz-Bello JO Anaya-Rubio I et al Mast Cell-Tumor Interactions: Molecular Mechanisms of Recruitment, Intratumoral Communication and Potential Therapeutic Targets for Tumor Growth Cells 2022 11 3 349 doi: 10.3390/cells11030349 35159157 PMC8834237 62 Ammendola M Sacco R Zuccalà V Luposella M Patruno R Gadaleta P et al Mast Cells Density Positive to Tryptase Correlate with Microvascular Density in both Primary Gastric Cancer Tissue and Loco-Regional Lymph Node Metastases from Patients That Have Undergone Radical Surgery Int J Mol Sci 2016 17 11 1905 doi: 10.3390/ijms17111905 27854307 PMC5133903 63 Liu X Jin H Zhang G Lin X Chen C Sun J et al Intratumor IL-17-positive mast cells are the major source of the IL-17 that is predictive of survival in gastric cancer patients PLoS One 2014 9 9 doi: 10.1371/journal.pone.0106834 25197971 PMC4157802 64 Lv Y Zhao Y Wang X Chen N Mao F Teng Y et al Increased intratumoral mast cells foster immune suppression and gastric cancer progression through TNF-α-PD-L1 pathway J Immunother Cancer 2019 7 1 54 doi: 10.1186/s40425-019-0530-3 30808413 PMC6390584 65 Yano H Kinuta M Tateishi H Nakano Y Matsui S Monden T et al Mast cell infiltration around gastric cancer cells correlates with tumor angiogenesis and metastasis Gastric Cancer 1999 2 1 26 32 doi: 10.1007/s101200050017 11957067 66 Eissmann MF Dijkstra C Jarnicki A Phesse T Brunnberg J Poh AR et al IL-33-mediated mast cell activation promotes gastric cancer through macrophage mobilization Nat Commun 2019 10 1 2735 doi: 10.1038/s41467-019-10676-1 31227713 PMC6588585 67 Yi L Xie H Zhang X Gu M Zhang K Xia T et al LPAR3 and COL8A1, as matrix stiffness-related biomarkers, promote nasopharyngeal carcinoma metastasis by triggering EMT and angiogenesis Cell Signal 2025 131 111712 doi: 10.1016/j.cellsig.2025.111712 40049264 68 Zhou X Han J Zuo A Ba Y Liu S Xu H et al THBS2 + cancer-associated fibroblasts promote EMT leading to oxaliplatin resistance via COL8A1-mediated PI3K/AKT activation in colorectal cancer Mol Cancer 2024 23 1 282 doi: 10.1186/s12943-024-02180-y 39732719 PMC11681647 69 Hu J Li P Dan Y Chen Z Lu Y Chen X et al COL8A1 Regulates Esophageal Squamous Carcinoma Proliferation and Invasion Through PI3K/AKT Pathway Ann Surg Oncol 2024 31 5 3502 12 doi: 10.1245/s10434-023-14370-x 38429534 70 Zhou J Song Y Gan W Liu L Chen G Chen Z et al Upregulation of COL8A1 indicates poor prognosis across human cancer types and promotes the proliferation of gastric cancer cells Oncol Lett 2020 20 4 34 doi: 10.3892/ol.2020.11895 32774507 PMC7405348 71 She Y Zhao X Wu P Xue L Wan S Zhang L et al COL8A1 Predicts the Clinical Prognosis of Gastric Cancer and Is Related to Epithelial-Mesenchymal Transition Biomed Res Int 2022 2022 7567447 doi: 10.1155/2022/7567447 35774273 PMC9239809 72 Morgos D-T Stefani C Miricescu D Greabu M Stanciu S Nica S et al Targeting PI3K/AKT/mTOR and MAPK Signaling Pathways in Gastric Cancer Int J Mol Sci 2024 25 3 1848 doi: 10.3390/ijms25031848 38339127 PMC10856016 73 Jamal Eddin TM Nasr SMO Gupta I Zayed H Al Moustafa A-E Helicobacter pylori and epithelial mesenchymal transition in human gastric cancers: An update of the literature Heliyon 2023 9 8 doi: 10.1016/j.heliyon.2023.e18945 37609398 PMC10440535 74 Rojas MG Pereira-Simon S Zigmond ZM Varona Santos J Perla M Santos Falcon N et al Single-Cell Analyses Offer Insights into the Different Remodeling Programs of Arteries and Veins Cells 2024 13 10 793 doi: 10.3390/cells13100793 38786017 PMC11119253 75 Li Q Tintut Y Demer LL Vazquez-Padron RI Bendeck MP Hsu JJ Collagen VIII in vascular diseases Matrix Biol 2024 133 64 76 doi: 10.1016/j.matbio.2024.08.006 39154854 PMC11473120 76 Bao H Li Z-T Xu L-H Su T-Y Han Y Bao M et al Platelet-Derived Extracellular Vesicles Increase Col8a1 Secretion and Vascular Stiffness in Intimal Injury Front Cell Dev Biol 2021 9 641763 doi: 10.3389/fcell.2021.641763 33738288 PMC7960786 77 Zhang T Li X He Y Wang Y Shen J Wang S et al Cancer-associated fibroblasts-derived HAPLN1 promotes tumour invasion through extracellular matrix remodeling in gastric cancer Gastric Cancer 2022 25 2 346 59 doi: 10.1007/s10120-021-01259-5 34724589 PMC8882084 78 He X Zhong L Wang N Zhao B Wang Y Wu X et al Gastric Cancer Actively Remodels Mechanical Microenvironment to Promote Chemotherapy Resistance via MSCs-Mediated Mitochondrial Transfer Adv Sci (Weinh) 2024 11 47 doi: 10.1002/advs.202404994 39392399 PMC11653701 79 Kim JS Bae GE Kim K-H Lee S-I Chung C Lee D et al Prognostic Significance of LC3B and p62/SQSTM1 Expression in Gastric Adenocarcinoma Anticancer Res 2019 39 12 6711 22 doi: 10.21873/anticanres.13886 31810936 80 Rao SV Solum G Niederdorfer B Nørsett KG Bjørkøy G Thommesen L Gastrin activates autophagy and increases migration and survival of gastric adenocarcinoma cells BMC Cancer 2017 17 1 68 doi: 10.1186/s12885-017-3055-5 28109268 PMC5251222 10.1371/journal.pone.0332988.r001 Decision Letter 0 Zhao Zhijie Academic Editor © 2025 Zhijie Zhao 2025 Zhijie Zhao https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Submission Version 0  16 Jun 2025 PONE-D-25-27887Multi-omics Analysis of Parthanatos Related Molecular Subgroup and Prognostic Model Development in Stomach AdenocarcinomaPLOS ONE Dear Dr. Xia, Thank you for submitting your manuscript to PLOS ONE. After careful consideration, we feel that it has merit but does not fully meet PLOS ONE’s publication criteria as it currently stands. Therefore, we invite you to submit a revised version of the manuscript that addresses the points raised during the review process. Please submit your revised manuscript by Jul 31 2025 11:59PM. If you will need more time than this to complete your revisions, please reply to this message or contact the journal office at plosone@plos.org https://www.editorialmanager.com/pone/ Please include the following items when submitting your revised manuscript: A rebuttal letter that responds to each point raised by the academic editor and reviewer(s). You should upload this letter as a separate file labeled 'Response to Reviewers'. A marked-up copy of your manuscript that highlights changes made to the original version. You should upload this as a separate file labeled 'Revised Manuscript with Track Changes'. An unmarked version of your revised paper without tracked changes. You should upload this as a separate file labeled 'Manuscript'. If you would like to make changes to your financial disclosure, please include your updated statement in your cover letter. Guidelines for resubmitting your figure files are available below the reviewer comments at the end of this letter. If applicable, we recommend that you deposit your laboratory protocols in protocols.io to enhance the reproducibility of your results. Protocols.io assigns your protocol its own identifier (DOI) so that it can be cited independently in the future. For instructions see: https://journals.plos.org/plosone/s/submission-guidelines#loc-laboratory-protocols https://plos.org/protocols?utm_medium=editorial-email&utm_source=authorletters&utm_campaign=protocols We look forward to receiving your revised manuscript. Kind regards, Zhijie Zhao, Ph.D., M.D., Academic Editor PLOS ONE Journal Requirements: When submitting your revision, we need you to address these additional requirements. 1. Please ensure that your manuscript meets PLOS ONE's style requirements, including those for file naming. The PLOS ONE style templates can be found at https://journals.plos.org/plosone/s/file?id=wjVg/PLOSOne_formatting_sample_main_body.pdf  https://journals.plos.org/plosone/s/file?id=ba62/PLOSOne_formatting_sample_title_authors_affiliations.pdf 2.  Thank you for stating the following financial disclosure: “This project is supported by Project of Heilongjiang Provincial Health Commission (No. 20230404080327)” Please state what role the funders took in the study. If the funders had no role, please state: \"The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript.\" If this statement is not correct you must amend it as needed. Please include this amended Role of Funder statement in your cover letter; we will change the online submission form on your behalf. 3. PLOS ONE now requires that authors provide the original uncropped and unadjusted images underlying all blot or gel results reported in a submission’s figures or Supporting Information files. This policy and the journal’s other requirements for blot/gel reporting and figure preparation are described in detail at https://journals.plos.org/plosone/s/figures#loc-blot-and-gel-reporting-requirements https://journals.plos.org/plosone/s/figures#loc-preparing-figures-from-image-files https://journals.plos.org/plosone/s/figures#loc-original-images-for-blots-and-gels In your cover letter, please note whether your blot/gel image data are in Supporting Information or posted at a public data repository, provide the repository URL if relevant, and provide specific details as to which raw blot/gel images, if any, are not available. Email us at plosone@plos.org if you have any questions. 4. Please include captions for your Supporting Information files at the end of your manuscript, and update any in-text citations to match accordingly. Please see our Supporting Information guidelines for more information: http://journals.plos.org/plosone/s/supporting-information  Additional Editor Comments: Revisions are required based on the comments of all reviewers. [Note: HTML markup is below. Please do not edit.] Reviewers' comments: Reviewer's Responses to Questions  Comments to the Author 1. Is the manuscript technically sound, and do the data support the conclusions? The manuscript must describe a technically sound piece of scientific research with data that supports the conclusions. Experiments must have been conducted rigorously, with appropriate controls, replication, and sample sizes. The conclusions must be drawn appropriately based on the data presented. Reviewer #1: Yes Reviewer #2: Yes ********** 2. Has the statistical analysis been performed appropriately and rigorously? Reviewer #1: Yes Reviewer #2: Yes ********** 3. Have the authors made all data underlying the findings in their manuscript fully available? The PLOS Data policy Reviewer #1: Yes Reviewer #2: Yes ********** 4. Is the manuscript presented in an intelligible fashion and written in standard English? PLOS ONE does not copyedit accepted manuscripts, so the language in submitted articles must be clear, correct, and unambiguous. Any typographical or grammatical errors should be corrected at revision, so please note any specific errors here. Reviewer #1: Yes Reviewer #2: No ********** 5. Review Comments to the Author Please use the space provided to explain your answers to the questions above. You may also include additional comments for the author, including concerns about dual publication, research ethics, or publication ethics. (Please upload your review as an attachment if it exceeds 20,000 characters) Reviewer #1: The paper titled \"Multi-omics Analysis of Parthanatos Related Molecular Subgroup and Prognostic Model Development in Stomach Adenocarcinoma\" conducts a systematic investigation into the influence of parthanatos-associated genes in STAD. By integrating transcriptomic, genomic, and clinical data from the TCGA and GEO databases, the study defines multiple molecular subgroups that exhibit distinct parthanatos-related gene expression profiles. These clusters exhibit differences in immune infiltration status, mutational profiles, and clinical outcomes. Noteworthy is one subgroup that shows significantly elevated AIFM1 and PARP1 expression, immune evasion markers, and poor survival rates, implying a potential association between disrupted parthanatos signaling and enhanced tumor malignancy. The authors stratify patients into high- and low-risk groups with notable survival differences using integrative analysis to create a reliable prognostic model based on parthanatos gene signatures. This model demonstrates strong predictive performance across multiple cohorts and remains independent of conventional clinical variables in multivariate analyses.The study also assesses therapeutic vulnerabilities by associating gene expression with drug response patterns, which enables the identification of promising agents for precision therapy, particularly in patients with high-risk profiles. However, several limitations exist. Since the analysis depends on retrospective datasets, its clinical applicability remains limited without further prospective confirmation. Additionally, more in-depth functional studies—both in vitro and in vivo—are necessary to clarify the mechanistic involvement of the candidate genes in parthanatos and tumor development. Future research that integrates spatial or single-cell transcriptomic technologies may enhance the understanding of the tumor microenvironment in relation to parthanatos. Collectively, the study offers meaningful insights into how parthanatos influences prognosis and treatment strategies in gastric cancer. 1. What is the current state of research on pyroptosis-associated genes in relation to STAD? 2. What publicly available platforms provide the transcriptomic and clinical information for STAD in this study, and how is this information processed? Including references such as Zn‐DHM Nanozymes Enhance Muscle Regeneration Through ROS Scavenging and Macrophage Polarization in Volumetric Muscle Loss Revealed by Single-Cell Profiling, Single-cell RNA sequencing and immune microenvironment analysis reveal PLOD2-driven malignant transformation in cervical cancer. 3.By what methods are DE-PARGs identified, and how is molecular subtype classification based on these genes implemented? 4. Which machine learning models are applied to create the PARG-based prognostic scoring system? Supporting references can be helpful. 5. What molecular classifications are produced from the PARG-based analysis of STAD, and what correlations exist with clinical outcomes? 6. Immune infiltration varies significantly among different PARG molecular subtypes, which may correlate with varied responses to immunotherapy. This hypothesis is supported by studies such as PMID: 40421026 and 40406148. 7. Each gene subtype linked to PARG classification reveals unique biological characteristics and impacts patient prognosis differently. Supporting literature, such as DOI: 10.15212/bioi-2022-0008 and PMID: 27672669, explores these relationships in more detail. 8. At the same time, substantial variation in tumor mutation burden and immune response is observed across PARG scoring subgroups, suggesting that PARG-based stratification could optimize immunotherapy approaches. 9. Although mast cells are known to be part of the STAD immune landscape, their exact role remains unclear. Consequently, future investigations with strong literature support are required to clarify their biological significance. Reviewer #2: This study conducts a multi-omics analysis of parthanatos-related genes (PARGs) in stomach adenocarcinoma (STAD), identifying molecular subtypes and constructing a PARG-based prognostic model. The integration of transcriptomic, genomic, single-cell, and functional data is well designed. The topic is relatively novel and shows clinical application potential. However, the manuscript still has several issues regarding scientific rigor, clarity of logic, and language accuracy. Major revision is recommended before it can be considered for publication. Specific comments are as follows: 1. The manuscript contains a number of expressions influenced by Chinese syntax. A thorough language polish is needed to improve clarity, professionalism, and readability. 2. The current datasets are relatively old. The authors are encouraged to supplement with more recent publicly available datasets or their own cohort to enhance robustness and timeliness. 3. Figure legends should be integrated into the result descriptions as per journal guidelines, rather than being placed as isolated paragraphs. 4. In Figure 2, the functional differences between cluster A and cluster C are not clearly discussed. A more detailed KEGG enrichment comparison between these clusters is needed. 5. The color assignments for clusters A, B and C are not consistent across figures. Please unify the color scheme to maintain visual consistency. 6. This is a highlight of the study but is underdeveloped. The authors are advised to incorporate deeper cell–cell communication analyses (e.g., using CellChat) to better characterize TAM heterogeneity and immune-stromal interactions. 7. Although COL8A1 knockdown was experimentally validated, the underlying mechanism is not sufficiently discussed. Please explore its potential involvement in EMT, PI3K/AKT pathway, or ECM remodeling, and consider validating these axes. 8. The use of “PARG” to represent “parthanatos-related genes” is potentially misleading, as PARG typically refers to poly(ADP-ribose) glycohydrolase. Please revise and unify the terminology throughout the manuscript. 9. Although parthanatos is a relatively novel concept in cancer biology, the authors should further clarify its unique value in gastric cancer and elaborate on how their findings differ from previous studies. 10. Ensure that figure numbering and font sizes are consistent across all figures to improve overall visual presentation. Also,the references cited in this article are not sufficient, and there is a lack of in-depth comparative discussion. Background and methodology also require further literature support. Some related research should be cited: 1. Role of natural products in tumor therapy from basic research and clinical perspectives, 10.15212/AMM-2023-0050 2. Identifying the key genes of Epstein-Barr virus-regulated tumour immune microenvironment of gastric carcinomas�10.1111/cpr.13373 3. Single-cell RNA sequencing reveals immune cell dysfunction in the peripheral blood of patients with highly aggressive gastric cancer�10.1111/cpr.13591 4. Macrophage differentiation in enhancing hematopoietic function of ribonucleic acid for injection II via multi-omics analysis, 10.15212/AMM-2024-0001 5. Prospective study and validation of early warning marker discovery based on integrating multi-omics analysis in severe burn patients with sepsis, 10.1093/burnst/tkac050 ********** 6. PLOS authors have the option to publish the peer review history of their article ( what does this mean? If you choose “no”, your identity will remain anonymous but your review may still be made public. Do you want your identity to be public for this peer review? Privacy Policy Reviewer #1: No Reviewer #2: No ********** [NOTE: If reviewer comments were submitted as an attachment file, they will be attached to this email and accessible via the submission site. Please log into your account, locate the manuscript record, and check for the action link \"View Attachments\". If this link does not appear, there are no attachment files.] While revising your submission, please upload your figure files to the Preflight Analysis and Conversion Engine (PACE) digital diagnostic tool, https://pacev2.apexcovantage.com/ figures@plos.org 10.1371/journal.pone.0332988.r002 Author response to Decision Letter 1 Submission Version 1  25 Jun 2025 We sincerely appreciate the editor and all reviewers for their valuable comments and suggestions, which have significantly improved the quality and clarity of our manuscript. We have carefully considered each comment and revised the manuscript accordingly. Below, we provide a detailed point-by-point response to each comment, with our responses highlighted in bold and all modifications clearly marked in the revised manuscript. Review Comments to the Author Reviewer #1: The paper titled \"Multi-omics Analysis of Parthanatos Related Molecular Subgroup and Prognostic Model Development in Stomach Adenocarcinoma\" conducts a systematic investigation into the influence of parthanatos-associated genes in STAD. By integrating transcriptomic, genomic, and clinical data from the TCGA and GEO databases, the study defines multiple molecular subgroups that exhibit distinct parthanatos-related gene expression profiles. These clusters exhibit differences in immune infiltration status, mutational profiles, and clinical outcomes. Noteworthy is one subgroup that shows significantly elevated AIFM1 and PARP1 expression, immune evasion markers, and poor survival rates, implying a potential association between disrupted parthanatos signaling and enhanced tumor malignancy. The authors stratify patients into high- and low-risk groups with notable survival differences using integrative analysis to create a reliable prognostic model based on parthanatos gene signatures. This model demonstrates strong predictive performance across multiple cohorts and remains independent of conventional clinical variables in multivariate analyses.The study also assesses therapeutic vulnerabilities by associating gene expression with drug response patterns, which enables the identification of promising agents for precision therapy, particularly in patients with high-risk profiles. However, several limitations exist. Since the analysis depends on retrospective datasets, its clinical applicability remains limited without further prospective confirmation. Additionally, more in-depth functional studies—both in vitro and in vivo—are necessary to clarify the mechanistic involvement of the candidate genes in parthanatos and tumor development. Future research that integrates spatial or single-cell transcriptomic technologies may enhance the understanding of the tumor microenvironment in relation to parthanatos. Collectively, the study offers meaningful insights into how parthanatos influences prognosis and treatment strategies in gastric cancer. 1. What is the current state of research on pyroptosis-associated genes in relation to STAD? Reply: We sincerely thank the reviewer for their insightful comments and fully understand your interest in the recent advances regarding programmed cell death mechanisms in STAD. It is important to clarify that the focus of our study is not on pyroptosis, but rather on a systematic investigation of parthanatos-related genes (PRG) in STAD, including their expression patterns, biological functions, and prognostic value. PRG is a distinct form of programmed cell death triggered by hyperactivation of PARP1, independent of apoptosis and pyroptosis. It plays a unique role in tumor metabolic dysregulation, DNA damage response, and immune microenvironment modulation. We are aware that recent studies have suggested potential crosstalk and regulatory interactions among various forms of cell death, such as parthanatos, pyroptosis, and ferroptosis. These findings offer promising directions for future research into tumor heterogeneity. In the revised manuscript, we have further clarified that our study focuses specifically on parthanatos and have incorporated a brief discussion in both the Introduction and Discussion sections regarding the potential interplay between parthanatos and other forms of programmed cell death, such as pyroptosis. This aims to help readers better understand the context and significance of our work. We sincerely appreciate your attention to this important area of research, which has provided us with valuable insights and potential avenues for future exploration. Line 78-line 81; Line 664-667 2. What publicly available platforms provide the transcriptomic and clinical information for STAD in this study, and how is this information processed? Including references such as Zn‐DHM Nanozymes Enhance Muscle Regeneration Through ROS Scavenging and Macrophage Polarization in Volumetric Muscle Loss Revealed by Single-Cell Profiling, Single-cell RNA sequencing and immune microenvironment analysis reveal PLOD2-driven malignant transformation in cervical cancer. Reply: Thank you for your valuable comments. In this study, the transcriptomic expression matrices and corresponding clinical baseline information of NC tissues and STAD tissues were obtained from two publicly accessible databases: The Cancer Genome Atlas (TCGA) and the Gene Expression Omnibus (GEO). The specific data sources and processing steps are as follows: 1: TCGA database ( https://portal.gdc.cancer.gov/ Transcriptomic expression data (in count format) and clinical information of STAD samples were downloaded using the R programming environment. Gene annotation and matrix processing were performed using human genome annotation files and handled via Perl scripts. Samples lacking survival information or with an overall survival (OS) of less than 30 days were excluded. After filtering, 337 STAD samples and 32 normal gastric tissue samples were included for subsequent analyses. 2: GEO database ( https://www.ncbi.nlm.nih.gov/geo/ Two STAD-related gene expression datasets were included: GSE84437 GSE15459 (1) GSE84437 GPL6947 (2) GSE15459 GPL570 The original data were annotated and normalized using the corresponding platform annotation files via Perl scripts. Consistent with the TCGA cohort, samples lacking survival data or with OS < 30 days were excluded. Data integration and normalization: For the TCGA-STAD dataset, count data were converted into TPM (Transcripts Per Kilobase Million) format to enhance cross-sample comparability, followed by log2(TPM+1) normalization. Subsequently, TCGA and GSE84437 GSE15459 We have further optimized the manuscript content and cited the recommended references to improve its readability and scientific rigor. Line 92-line 106; line 111-line 114 3.By what methods are DE-PRGs identified, and how is molecular subtype classification based on these genes implemented? Reply: We sincerely thank the reviewer for raising this insightful and professional question. The identification of differentially expressed parthanatos-related genes (DE-PRGs) and the classification process of molecular subtypes in our study were conducted as follows: First, differential expression analysis was performed using transcriptomic data from tumor and normal tissues in the TCGA-STAD cohort, processed with the “limma” R package. The filtering criteria were set as |log2 fold change (FC)| ≥ 2 and adjusted P-value < 0.05. Genes meeting these thresholds and present in our predefined list of parthanatos-related genes (PRGs) were defined as DE-PRGs. Next, unsupervised consensus clustering based on the expression profiles of these DE-PRGs was carried out to identify potential molecular subtypes of STAD. This was implemented using the “ConsensusClusterPlus” R package with the partitioning around medoids (PAM) algorithm. The clustering was repeated 1,000 times to ensure robustness, and we evaluated the CDF plots for cluster numbers (k) ranging from 2 to 9. The optimal number of clusters was determined based on the delta area plot and clustering stability. To further validate the separation of identified subtypes, PCA was performed for dimensionality reduction and visualization. In addition, we compared the immune infiltration profiles and prognostic differences among the subtypes to explore their biological significance. We sincerely appreciate your attention to the methodological details, which greatly enhances the transparency and reproducibility of our study. Line 119-line 122; line 125-line 132 4. Which machine learning models are applied to create the PRG-based prognostic scoring system? Supporting references can be helpful. Reply: We sincerely thank the reviewer for the valuable comments. To enhance the robustness and accuracy of the prognostic scoring system based on PRGs, we systematically evaluated and compared 10 commonly used machine learning algorithms, including: CoxBoost, Enet, GBM, Lasso, plsRcox, Ridge, RSF, Stepwise Cox regression, SuperPC, and survival-SVM. Model construction and evaluation were conducted using the corresponding R packages: “survival,” “survivalsvm,” “glmnet,” “randomForestSRC,” “CoxBoost,” “gbm,” and “Superpc.” The predictive performance of each model was assessed using the concordance index (C-index), and model stability was evaluated via 10-fold cross-validation. Based on these comparisons, the model with the highest C-index and strong generalization performance was selected to construct the final PRG-based prognostic scoring system. This model demonstrated favorable survival prediction performance in both the training cohort and external validation cohort, further supporting its clinical applicability. In response to the reviewer’s suggestion, we have now provided a detailed description of all machine learning algorithms, analysis workflows, and performance evaluation metrics in the “Materials and Methods” section. Additionally, relevant supporting references have been added. We truly appreciate your attention to the modeling methodology, which has greatly helped us improve the clarity and completeness of this section. Line 180-line 185 5. What molecular classifications are produced from the PRG-based analysis of STAD, and what correlations exist with clinical outcomes? Reply: We sincerely thank the reviewer for raising this important question. In our study, we performed unsupervised consensus clustering analysis based on the expression profiles of DE-PRG to classify STAD samples into three distinct molecular subtypes: Cluster A, Cluster B, and Cluster C. The clustering process was conducted using the “ConsensusClusterPlus” R package. The CDF curves and delta area plots were used to evaluate clustering stability across different values of k, and k = 3 was determined to be the optimal number of clusters. To explore the clinical relevance of these subtypes, we conducted the following analyses: 1: Survival analysis: Kaplan-Meier survival curves showed that patients in Cluster B had significantly better OS compared to those in Cluster A and Cluster C (P < 0.001), suggesting that the subtype classification provides clear prognostic stratification. 2: Tumor immune microenvironment analysis: Using ssGSEA and the ESTIMATE algorithm, we assessed the infiltration levels of immune-related cells within the tumor microenvironment. We observed that Cluster B exhibited lower levels of immune cell infiltration, which may be associated with its favorable clinical outcomes. We greatly appreciate your insightful suggestion. We believe that the further clarification of the molecular subtypes and their clinical correlations substantially enhances the scientific significance and translational potential of our study. 6. Immune infiltration varies significantly among different PRG molecular subtypes, which may correlate with varied responses to immunotherapy. This hypothesis is supported by studies such as PMID: 40421026 and 40406148. Reply� We sincerely thank the reviewer for this important comment. We fully agree that the distinct immune infiltration profiles observed among different PRG molecular subtypes may influence their responsiveness to immunotherapy. The results of our immune characterization analyses support this hypothesis: we applied multiple algorithms, including ssGSEA and ESTIMATE, to assess immune infiltration across the subtypes. Our findings revealed the following patterns: 1: Cluster A exhibited a moderate level of immune activation. 2: Cluster B showed significantly lower immune cell infiltration, indicating an “immune-cold” tumor phenotype. 3: Cluster C, despite demonstrating a high level of immune infiltration, also displayed elevated TIDE scores and reduced IPS scores, suggesting a state of immune dysfunction and immune escape. These results further support the notion that PRG-based molecular subtypes may be closely associated with differential immunotherapy responses. In accordance with your suggestion, we have incorporated this discussion into the revised “Discussion” section and have cited the two relevant references to strengthen the supporting evidence. We believe that these additions further enhance the scientific value of our study, particularly in the context of guiding immunotherapy strategies. Line 695-line 702 7. Each gene subtype linked to PRG classification reveals unique biological characteristics and impacts patient prognosis differently. Supporting literature, such as DOI: 10.15212/bioi-2022-0008 and PMID: 27672669, explores these relationships in more detail. Reply: We sincerely appreciate your valuable suggestion. As requested, we have now provided a more explicit explanation regarding the correlation between PRG molecular subtyping and patient prognosis, supported by relevant literature citations. Thank you for your insightful comment, which has helped improve the clarity of our study. Line 685-line 695 8. At the same time, substantial variation in tumor mutation burden and immune response is observed across PRG scoring subgroups, suggesting that PRG-based stratification could optimize immunotherapy approaches. Reply: We sincerely thank the reviewer for the insightful comments. Indeed, in this study, we conducted TMB analysis and immune response evaluation between the high and low PRG score groups. The results are as follows: 1: TMB analysis revealed that the low PRG score group exhibited a significantly higher TMB level, which is consistent with greater immunogenic potential. 2: Immune response prediction, as assessed by Immunophenoscore (IPS), showed that the low PRG score group had a higher predicted immunotherapy response potential, suggesting that these patients may be more likely to benefit from immune checkpoint inhibitor (ICI) treatment. These findings support your perspective that the PRG score not only serves as a prognostic indicator but also holds promise as a predictor of immunotherapy responsiveness. The PRG-based stratification strategy may thus serve as a valuable tool for optimizing patient selection and tailoring personalized immunotherapeutic regimens in STAD. Following your suggestion, we have incorporated the relevant comparative analyses into the “Discussion” section and further emphasized the potential clinical utility of the PRG scoring system in guiding immunotherapy decisions. Once again, we deeply appreciate your insightful and constructive suggestions, which have greatly helped us to better articulate the link between PRG scoring and tumor immunity, and to strengthen the translational relevance of our study. 9. Although mast cells are known to be part of the STAD immune landscape, their exact role remains unclear. Consequently, future investigations with strong literature support are required to clarify their biological significance. Reply: We sincerely appreciate the reviewer’s forward-looking and constructive suggestion. Indeed, mast cells, as important components of the tumor immune microenvironment, have been observed to infiltrate STAD tissues to a certain extent. However, their precise role in tumor initiation and progression remains inconclusive, and no consensus has been reached in the current literature. In our study, we evaluated immune cell infiltration using the ssGSEA algorithm, which included an analysis of mast cell activation status across different PRG-defined subtypes. The resul Attachment Submitted filename: Response to Reviewers.docx 10.1371/journal.pone.0332988.r003 Decision Letter 1 Kim Jin Su Academic Editor © 2025 Jin Su Kim 2025 Jin Su Kim https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Submission Version 1  5 Aug 2025 <div>PONE-D-25-27887R1 Multi-omics Analysis of Parthanatos Related Molecular Subgroup and Prognostic Model Development in Stomach Adenocarcinoma PLOS ONE Dear Dr. Xia, Thank you for submitting your manuscript to PLOS ONE. After careful consideration, we feel that it has merit but does not fully meet PLOS ONE’s publication criteria as it currently stands. Therefore, we invite you to submit a revised version of the manuscript that addresses the points raised during the review process. Note from the Editorial Office: I believe you have added a box outline around the wrong set of bands in the original blot image for COL8A1 in Fig. 11B. Please correct this, then please combine the original blot images into a single file, which should be uploaded as a PDF file named \"S1_raw_images\" and uploaded as a Supporting Information File, per our submission guidelines: https://journals.plos.org/plosbiology/s/figures#loc-blot-and-gel-reporting-requirements Please submit your revised manuscript by Sep 11 2025 11:59PM. If you will need more time than this to complete your revisions, please reply to this message or contact the journal office at plosone@plos.org https://www.editorialmanager.com/pone/ Please include the following items when submitting your revised manuscript: A rebuttal letter that responds to each point raised by the academic editor and reviewer(s). You should upload this letter as a separate file labeled 'Response to Reviewers'. A marked-up copy of your manuscript that highlights changes made to the original version. You should upload this as a separate file labeled 'Revised Manuscript with Track Changes'. An unmarked version of your revised paper without tracked changes. You should upload this as a separate file labeled 'Manuscript'. If you would like to make changes to your financial disclosure, please include your updated statement in your cover letter. Guidelines for resubmitting your figure files are available below the reviewer comments at the end of this letter. If applicable, we recommend that you deposit your laboratory protocols in protocols.io to enhance the reproducibility of your results. Protocols.io assigns your protocol its own identifier (DOI) so that it can be cited independently in the future. For instructions see: https://journals.plos.org/plosone/s/submission-guidelines#loc-laboratory-protocols https://plos.org/protocols?utm_medium=editorial-email&utm_source=authorletters&utm_campaign=protocols We look forward to receiving your revised manuscript. Kind regards, Jin Su Kim, PhD Academic Editor PLOS ONE Journal Requirements: If the reviewer comments include a recommendation to cite specific previously published works, please review and evaluate these publications to determine whether they are relevant and should be cited. There is no requirement to cite these works unless the editor has indicated otherwise. Please review your reference list to ensure that it is complete and correct. If you have cited papers that have been retracted, please include the rationale for doing so in the manuscript text, or remove these references and replace them with relevant current references. Any changes to the reference list should be mentioned in the rebuttal letter that accompanies your revised manuscript. If you need to cite a retracted article, indicate the article’s retracted status in the References list and also include a citation and full reference for the retraction notice. [Note: HTML markup is below. Please do not edit.] Reviewers' comments: Reviewer's Responses to Questions  Comments to the Author 1. If the authors have adequately addressed your comments raised in a previous round of review and you feel that this manuscript is now acceptable for publication, you may indicate that here to bypass the “Comments to the Author” section, enter your conflict of interest statement in the “Confidential to Editor” section, and submit your \"Accept\" recommendation. Reviewer #1: All comments have been addressed Reviewer #3: All comments have been addressed Reviewer #4: (No Response) ********** 2. Is the manuscript technically sound, and do the data support the conclusions? The manuscript must describe a technically sound piece of scientific research with data that supports the conclusions. Experiments must have been conducted rigorously, with appropriate controls, replication, and sample sizes. The conclusions must be drawn appropriately based on the data presented. Reviewer #1: Yes Reviewer #3: Yes Reviewer #4: Yes ********** 3. Has the statistical analysis been performed appropriately and rigorously? Reviewer #1: Yes Reviewer #3: Yes Reviewer #4: Yes ********** 4. Have the authors made all data underlying the findings in their manuscript fully available? The PLOS Data policy Reviewer #1: Yes Reviewer #3: Yes Reviewer #4: Yes ********** 5. Is the manuscript presented in an intelligible fashion and written in standard English? PLOS ONE does not copyedit accepted manuscripts, so the language in submitted articles must be clear, correct, and unambiguous. Any typographical or grammatical errors should be corrected at revision, so please note any specific errors here. Reviewer #1: Yes Reviewer #3: Yes Reviewer #4: Yes ********** 6. Review Comments to the Author Please use the space provided to explain your answers to the questions above. You may also include additional comments for the author, including concerns about dual publication, research ethics, or publication ethics. (Please upload your review as an attachment if it exceeds 20,000 characters) Reviewer #1: (No Response) Reviewer #3: The author has made detailed revisions to the comments of the previous reviewer, thus resolving many issues of imprecise expression. However, after reading the manuscript, the only thing I feel inappropriate is that the author's conclusion is too lengthy. The conclusion should be a highly condensed and summarized version of the research findings, rather than a secondary repetition of the entire research process. It is recommended that the author streamline the conclusion. Reviewer #4: This study, for the first time through integrated multi-omics analysis, systematically elaborates on the molecular subtypes, prognostic value, and immune microenvironment regulatory mechanisms of parthanatos-related genes (PRGs) in stomach adenocarcinoma (STAD), and experimentally verifies the cancer-promoting function of the key gene COL8A1. The research design is rigorous with advanced methods (covering transcriptome, single-cell sequencing, machine learning, etc.) and has clear potential for clinical translation. The manuscript has been substantially revised according to the reviewers' comments, but there are still some issues that need further improvement. Main Advantages Innovation and Clinical Significance (1) For the first time, a molecular typing system (Cluster A/B/C) of PRGs in STAD is established, revealing its associations with prognosis, immune infiltration, and treatment response, which provides a new perspective for precision therapy. (2) The PRG prognostic model (StepCox + Enet) constructed based on 10 machine learning algorithms shows robustness in both the training set and the validation set ( GSE15459 (3) Experimental verification of the function of COL8A1 in promoting the proliferation/migration of STAD cells supports its potential as a therapeutic target. Methodological Rigor (1) The integration of multi-omics data is comprehensive (TCGA, GEO cohorts) with strict quality control (excluding samples with OS < 30 days). (2) Single-cell analysis ( GSE163558 (3) The immune microenvironment assessment is diversified (ESTIMATE, ssGSEA, TIDE, IPS), corroborating the association between PRG subtypes and immune therapy response. Key Issues and Improvement Suggestions Insufficient Depth of Molecular Mechanisms (Key Defect) Issue: The cancer-promoting mechanism of COL8A1 only stays at the phenotypic level (proliferation/migration), lacking verification at the pathway level (such as EMT, PI3K/AKT). The discussion mentions that \"PI3K/AKT induces COL8A1-mediated ECM remodeling\" (Line 748), but there is no experimental support. Suggestion: Supplement WB verification of EMT markers (E-cadherin/Vimentin) or PI3K/AKT pathway proteins after COL8A1 knockout; or clearly list mechanism research as a future direction and emphasize this limitation in the discussion. Contradictions in Immune Microenvironment Analysis Issue: Cluster C shows high immune infiltration but the worst prognosis, and the authors attribute it to \"immune dysfunction\" (Line 696-698), but there is a lack of key evidence (such as T cell exhaustion markers, proportion of immunosuppressive cells). Suggestion: Supplement the expression heatmap of exhaustion markers such as PD-1/CTLA-4 and LAG-3 in Cluster C. Analyze the differences in infiltration of Treg/MDSC between high and low PRG score groups (the existing ssGSEA only provides an overview of 23 cell types). ********** 7. PLOS authors have the option to publish the peer review history of their article ( what does this mean? If you choose “no”, your identity will remain anonymous but your review may still be made public. Do you want your identity to be public for this peer review? Privacy Policy Reviewer #1: No Reviewer #3: No Reviewer #4: No ********** [NOTE: If reviewer comments were submitted as an attachment file, they will be attached to this email and accessible via the submission site. Please log into your account, locate the manuscript record, and check for the action link \"View Attachments\". If this link does not appear, there are no attachment files.] While revising your submission, please upload your figure files to the Preflight Analysis and Conversion Engine (PACE) digital diagnostic tool, https://pacev2.apexcovantage.com/ figures@plos.org 10.1371/journal.pone.0332988.r004 Author response to Decision Letter 2 Submission Version 2  7 Aug 2025 We sincerely appreciate the editor and all reviewers for their valuable comments and suggestions, which have significantly improved the quality and clarity of our manuscript. We have carefully considered each comment and revised the manuscript accordingly. Below, we provide a detailed point-by-point response to each comment, with our responses highlighted in bold and all modifications clearly marked in the revised manuscript. Review Comments to the Author Please use the space provided to explain your answers to the questions above. You may also include additional comments for the author, including concerns about dual publication, research ethics, or publication ethics. (Please upload your review as an attachment if it exceeds 20,000 characters) Reviewer #1: (No Response) Reviewer #3: The author has made detailed revisions to the comments of the previous reviewer, thus resolving many issues of imprecise expression. However, after reading the manuscript, the only thing I feel inappropriate is that the author's conclusion is too lengthy. The conclusion should be a highly condensed and summarized version of the research findings, rather than a secondary repetition of the entire research process. It is recommended that the author streamline the conclusion. Reply� We sincerely thank you for taking the time to review our manuscript and for providing your valuable feedback. We highly appreciate your comment regarding the \"overly lengthy conclusion section.\" Upon careful review, we agree that the original conclusion was not sufficiently concise and partially repeated content from earlier sections of the manuscript. In accordance with your suggestion, we have revised and streamlined the conclusion to focus more clearly on the core findings and key innovations of our study. Redundant descriptions of the research process have been removed to enhance clarity, coherence, and summarization. Once again, we are truly grateful for your insightful comments and recognition of our work. Your suggestions have significantly contributed to improving the quality of the manuscript, and we sincerely hope that the revised version meets your expectations. Line 78-Line 85; line 773-line 778 Reviewer #4: This study, for the first time through integrated multi-omics analysis, systematically elaborates on the molecular subtypes, prognostic value, and immune microenvironment regulatory mechanisms of parthanatos-related genes (PRGs) in stomach adenocarcinoma (STAD), and experimentally verifies the cancer-promoting function of the key gene COL8A1. The research design is rigorous with advanced methods (covering transcriptome, single-cell sequencing, machine learning, etc.) and has clear potential for clinical translation. The manuscript has been substantially revised according to the reviewers' comments, but there are still some issues that need further improvement. Main Advantages Innovation and Clinical Significance (1) For the first time, a molecular typing system (Cluster A/B/C) of PRGs in STAD is established, revealing its associations with prognosis, immune infiltration, and treatment response, which provides a new perspective for precision therapy. (2) The PRG prognostic model (StepCox + Enet) constructed based on 10 machine learning algorithms shows robustness in both the training set and the validation set ( GSE15459 (3) Experimental verification of the function of COL8A1 in promoting the proliferation/migration of STAD cells supports its potential as a therapeutic target. Methodological Rigor (1) The integration of multi-omics data is comprehensive (TCGA, GEO cohorts) with strict quality control (excluding samples with OS < 30 days). (2) Single-cell analysis ( GSE163558 (3) The immune microenvironment assessment is diversified (ESTIMATE, ssGSEA, TIDE, IPS), corroborating the association between PRG subtypes and immune therapy response. Key Issues and Improvement Suggestions Insufficient Depth of Molecular Mechanisms (Key Defect) Issue: The cancer-promoting mechanism of COL8A1 only stays at the phenotypic level (proliferation/migration), lacking verification at the pathway level (such as EMT, PI3K/AKT). The discussion mentions that \"PI3K/AKT induces COL8A1-mediated ECM remodeling\" (Line 748), but there is no experimental support. Suggestion: Supplement WB verification of EMT markers (E-cadherin/Vimentin) or PI3K/AKT pathway proteins after COL8A1 knockout; or clearly list mechanism research as a future direction and emphasize this limitation in the discussion. Reply� Thank you for your thoughtful review and valuable suggestions regarding our study. You rightly pointed out that the current manuscript lacks in-depth mechanistic validation of how COL8A1 promotes tumor progression, particularly in terms of experimental evidence involving EMT markers (such as E-cadherin and Vimentin) and the PI3K/AKT signaling pathway. We fully agree with your insightful comments. Due to experimental limitations and manuscript length constraints, we were unable to include additional Western blot analyses in the current version. However, we have clearly acknowledged this limitation in the Discussion section and have elaborated on our plan to conduct further mechanistic investigations—specifically, to validate the involvement of EMT processes and the PI3K/AKT pathway—in future studies. We believe that these additions will enhance the scientific rigor and logical coherence of the manuscript. Once again, we sincerely appreciate your constructive feedback and recognition of our work. Line 760-Line 772 Contradictions in Immune Microenvironment Analysis Issue: Cluster C shows high immune infiltration but the worst prognosis, and the authors attribute it to \"immune dysfunction\" (Line 696-698), but there is a lack of key evidence (such as T cell exhaustion markers, proportion of immunosuppressive cells). Suggestion: Supplement the expression heatmap of exhaustion markers such as PD-1/CTLA-4 and LAG-3 in Cluster C. Analyze the differences in infiltration of Treg/MDSC between high and low PRG score groups (the existing ssGSEA only provides an overview of 23 cell types). Reply� We sincerely thank the reviewer for the professional and constructive comments. In response to the concern regarding the lack of sufficient evidence in the immune microenvironment analysis, we have further supplemented the expression profiles of T cell exhaustion markers, including PD-1, CTLA-4, and LAG-3, across different subtypes (including Cluster C). These results have been incorporated into the revised manuscript. Additionally, we have analyzed and presented the infiltration levels of immunosuppressive cells such as regulatory T cells (Tregs) and MDSCs in the high and low PRG score groups, as shown in Figure 8E. The relevant differences are also highlighted in the figure. We believe that these additions provide stronger support for the potential association between \"immune dysfunction\" and poor prognosis. Once again, we truly appreciate your insightful guidance on our work. Line 405-Line 410; line 421-line 422, Line 540-line 544, Figure 3J-M, Figure 8E Attachment Submitted filename: Response_to_Reviewers_auresp_2.docx 10.1371/journal.pone.0332988.r005 Decision Letter 2 Kim Jin Su Academic Editor © 2025 Jin Su Kim 2025 Jin Su Kim https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Submission Version 2  9 Sep 2025 <p>Multi-omics Analysis of Parthanatos Related Molecular Subgroup and Prognostic Model Development in Stomach Adenocarcinoma PONE-D-25-27887R2 Dear Dr. Tianyi Xia We’re pleased to inform you that your manuscript has been judged scientifically suitable for publication and will be formally accepted for publication once it meets all outstanding technical requirements. Within one week, you’ll receive an e-mail detailing the required amendments. When these have been addressed, you’ll receive a formal acceptance letter and your manuscript will be scheduled for publication. An invoice will be generated when your article is formally accepted. Please note, if your institution has a publishing partnership with PLOS and your article meets the relevant criteria, all or part of your publication costs will be covered. Please make sure your user information is up-to-date by logging into Editorial Manager at Editorial Manager® billing support If your institution or institutions have a press office, please notify them about your upcoming paper to help maximize its impact. If they’ll be preparing press materials, please inform our press team as soon as possible -- no later than 48 hours after receiving the formal acceptance. Your manuscript will remain under strict press embargo until 2 pm Eastern Time on the date of publication. For more information, please contact onepress@plos.org. Kind regards, Jin Su Kim, PhD Academic Editor PLOS ONE Additional Editor Comments (optional): Reviewers' comments: 10.1371/journal.pone.0332988.r006 Acceptance letter Kim Jin Su Academic Editor © 2025 Jin Su Kim 2025 Jin Su Kim https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License PONE-D-25-27887R2 PLOS ONE Dear Dr. Xia, I'm pleased to inform you that your manuscript has been deemed suitable for publication in PLOS ONE. Congratulations! Your manuscript is now being handed over to our production team. At this stage, our production department will prepare your paper for publication. This includes ensuring the following: * All references, tables, and figures are properly cited * All relevant supporting information is included in the manuscript submission, * There are no issues that prevent the paper from being properly typeset You will receive further instructions from the production team, including instructions on how to review your proof when it is ready. Please keep in mind that we are working through a large volume of accepted articles, so please give us a few days to review your paper and let you know the next and final steps. Lastly, if your institution or institutions have a press office, please let them know about your upcoming paper now to help maximize its impact. If they'll be preparing press materials, please inform our press team within the next 48 hours. Your manuscript will remain under strict press embargo until 2 pm Eastern Time on the date of publication. For more information, please contact onepress@plos.org. You will receive an invoice from PLOS for your publication fee after your manuscript has reached the completed accept phase. If you receive an email requesting payment before acceptance or for any other service, this may be a phishing scheme. Learn how to identify phishing emails and protect your accounts at https://explore.plos.org/phishing If we can help with anything else, please email us at customercare@plos.org. Thank you for submitting your work to PLOS ONE and supporting open access. Kind regards, PLOS ONE Editorial Office Staff on behalf of Dr. Jin Su Kim Academic Editor PLOS ONE ",
  "metadata": {
    "Title of this paper": "Acceptance letter",
    "Journal it was published in:": "PLOS One",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469114/"
  }
}