{
  "title": "Paper_5",
  "abstract": "pmc PeerJ PeerJ 2057 peerj peerj PeerJ 2167-8359 PeerJ, Inc PMC12495950 PMC12495950.1 12495950 12495950 10.7717/peerj.20123 20123 1 Biotechnology Molecular Biology Establishment and evaluation of a circAdpgk-0001 knockdown method using CRISPR–Cas13d RNA-targeting technology Huang Sijia 1 Qin Hailan 1 Dai Bingxin 1 2 Liu Miao iammiaoliu@126.com 1 Shen Jijia shenjijia@hotmail.com 1 1 Department of Microbiology and Parasitology, Anhui Province key Laboratory of Zoonoses, School of Basic Medical Sciences, Anhui Medical University Hefei China 2 Department of Clinical Laboratory, South China Hospital, Medical School, Shenzhen University Shenzhen China Brygadyrenko Viktor 1 10 2025 2025 13 478561 e20123 14 3 2025 1 9 2025 01 10 2025 05 10 2025 05 10 2025 ©2025 Huang et al. 2025 Huang et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Background The small interfering RNA (siRNA) method has been used to knock down circular RNAs (circRNAs). However, issues such as low efficiency and off-target effects have become increasingly recognized. Recent studies have demonstrated that CRISPR-Cas13 can specifically target and cleave RNA. In this study, we established a CRISPR-Cas13d-based RNA-targeting method to specifically knock down circRNAs, such as circAdpgk-0001, and compared its performance with the siRNA method. Methods Four clustered regularly interspaced short palindromic repeats (CRISPR) RNAs (crRNAs) of different nucleotide lengths spanning the back-splicing junction (BSJ) of circAdpgk-0001 were designed. A CRISPR-RfxCas13d plasmid capable of specifically cleaving circAdpgk-0001 was constructed and transfected into the JS-1 cell line. Knockdown efficiency was assessed using quantitative real-time PCR (qRT-PCR) and compared with that of the siRNA method. The expression of activation-related factors alpha-smooth muscle actin (α-SMA) and collagen I in JS-1 cells was further evaluated using qRT-PCR and Western blot. Results CRISPR-Cas13d with a 24-nucleotide crRNA showed the highest knockdown efficiency (∼50%). After further optimization, the knockdown efficiency of CRISPR-Cas13d reached 70%, significantly higher than that of the siRNA method (40%). Knockdown of circAdpgk-0001 using Cas13d reduced the expression of collagen I and α-SMA by approximately 40%, which was greater than the reduction achieved by siRNA-mediated knockdown. Conclusion CRISPR-Cas13d demonstrated higher efficiency than the siRNA method in knocking down circRNAs, providing a promising tool for investigating circRNA functions. CRISPR/Cas13 CircRNAs RNA targeting RNA interference The National Natural Science Foundation of China No. 82072305 This work was supported by a grant from the National Natural Science Foundation of China (No. 82072305). The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Circular RNAs (circRNAs) are a class of noncoding RNAs, characterized by a single-stranded, closed circular structure, lacking a 5′ cap and a 3′ poly-A tail ( Qu et al., 2015 Huang et al., 2020 Kristensen et al., 2022 Liu & Chen, 2022 Chen et al., 2023b Yuan et al., 2023 Panda, 2018 Huang et al., 2020 Zhou et al., 2020 Chen et al., 2023a Liang et al., 2017 The CRISPR-Cas systems have grown to be a powerful and widespread biotechnological tool in the fields of molecular biology and genetics, which are divided into two classes and six types. Class 2 systems include types II, V, and VI, in which Cas9, Cas12, and Cas13, respectively, function as single, multidomain effectors. Unlike Cas9 and Cas12, which target DNA, Cas13 targets RNA, including Cas13a, Cas13b, Cas13c, and Cas13d ( Wang et al., 2019 Zhang et al., 2019 Chen et al., 2020 Liang et al., 2024 Nguyen, Zhang & Pandolfi, 2020 McCallister et al., 2025 Morelli et al., 2023 Powell et al., 2022 Zeballos et al., 2023 Recently, the widespread application of high-throughput sequencing has led to the discovery of many novel circRNAs in mammalian cells ( Salzman et al., 2013 Schistosoma japonicum in vitro Li et al., 2021 Li, Wu & Chen, 2022 Materials and Methods Cell culture The JS-1 cell line, a mouse-derived hepatic stellate cell (HSC), was purchased from the Otwo Biotech, China. The cell line was routinely cultured in Dulbecco’s Modified Eagle’s Medium (DMEM) (Gibco, Beijing, China) supplemented with 10% FBS (ExCell, Shanghai, China) at 37 °C with 5% CO 2 CRISPR RNAs (crRNAs) design The mature sequence was obtained according to circAdpgk-0001 (circAtlas, chr9:59297526—59303551). And the BSJ sites of circAdpgk-0001 were analyzed by Circprimer2.0. Then, 11, 12, 14, and 16 nucleotides were taken respectively on both sides centered on BSJ (BSJ was not included), resulting in crRNAs with lengths of 24, 26, 30, and 34 nucleotides. Finally, based on the principle of base complementary pairing, SnapGene was used to design forward complementary single oligonucleotide chain and reverse one for crRNAs with different lengths for subsequent use. Plasmid construction and siRNA synthesis Two µg CRISPR-RfxCas13d plasmid (Addgene, Watertown, MA, USA), two µL BsmBI-v2 enzyme (NEB, USA), five µL 10 × NEBuffer3.1 and water were mixed in a tube to form a 50 µL enzyme digestion system and digested at 55 °C for 1 h. The enzyme digestion products were purified using PCR product purification kit (UEBio, Shanghai, China), and the linearized CRISPR-RfxCas13d vector was obtained. Nine µL of 100 µM forward single oligonucleotide chain, nine µL of 100 µM reverse single oligonucleotide chain and two µL of NEBuffer 2.1 were mixed in a tube. Annealing products were obtained by placing them in a PCR instrument and gradually decreasing from 95 °C to 22 °C at a rate of 1 °C per minute. Three µL annealing product, 50 ng linearized CRISPR-RfxCas13d plasmid, one µL T4 DNA Ligase (Takara, Japan), and one µL 10 × Ligation buffer were mixed in a tube, which was supplemented to 10 µL with water and incubated at 16 °C for overnight. After transformation, individual E. coli ® Table S1 Cell transfection JS-1 cells were transfected using Lipofectamine ® ® ® ® Quantitative real time PCR (qRT-PCR) Total RNA extraction from cells was performed with TRIzol reagent (TransGen, Beijing, China). The RNA concentration was measured using a NanoDrop 2000 (Thermo Fisher Scientific, USA). The entire process was carried out under conditions free from RNase contamination. Complementary DNA was synthesized using Evo M-MLV Reverse Transcriptase kit AG11706 (AGbio, Beijing, China). SYBR Green Premix Pro Taq HS qPCR kit AG11701 (AGbio) and CFX96 RT-PCR system (Bio-Rad, USA) were used for qRT-PCR detection. The two-step method was adopted, which included pre-denaturation at 95 °C for 30 s, followed by 40 cycles of denaturation at 95 °C for 5 s and annealing/extension at 60 °C for 60 s. Three replicate wells were set for each sample. GAPDH was used to normalize the expression of mRNAs. The relative abundance of expression was calculated using the 2 − △△ Ct Table S2 Western blot Cells were lysed on ice using RIPA buffer (Beyotime, Haimen, China) supplemented with proteinase inhibitor (Beyotime). Total proteins were extracted and measured using a BCA protein assay kit (Beyotime). Equal amount of protein was subjected to SDS-PAGE electrophoresis separation, and transferred onto PVDF membranes, which were blocked in non-fat milk. Then the membranes were cultured with the primary antibody at 4 °C overnight. Afterwards, the secondary antibody was incubated for 1 h at room temperature. The ECL Substrate Kit (Thermo Fisher Scientific, USA) was applied to visualize the target protein bands. Antibodies dilution was as follows: rabbit monoclonal antibody GAPDH (1:3000; Boster), rabbit monoclonal antibody α-SMA (1:5000, Abcam, USA), rabbit polyclonal antibody Collagen I (1:1000, Boster), and HRP-conjugated goat anti-rabbit antibody (1:10000; ZSGB, Beijing, China). Followed with quantifying by Image J software (NIH, Bethesda, MD, USA) and normalized to GAPDH, the internal control. Statistical analysis All data analysis was performed using GraphPad Prism v7.01 software (GraphPad, La Jolla, CA, USA). The results were exhibited as the mean ± standard deviation. Independent sample t p Results The knockdown efficiency of circAdpgk-0001 by siRNAs under different transfection conditions To knock down circAdpgk-0001, we designed and synthesized six siRNAs targeting circAdpgk_0001 by two biotechnology companies. After transfecting siRNA-1 through siRNA-6 into the JS-1 cell line, only siRNA-5 showed higher knockdown efficiency, reducing circAdpgk-0001 levels by approximately 30% under transfection condition 1 ( Fig. 1A Fig. 1B Fig. 1C Fig. 1D Figs. S1A S1B 10.7717/peerj.20123/fig-1 Figure 1 The knockdown efficiency of different siRNAs under various transfection conditions. (A) The knockdown efficiency of different siRNAs ( n n p p p Construction of CRISPR-Cas13d plasmid targeting circAdpgk-0001 and its knockdown efficiency Four crRNAs targeting the BSJ of circAdpgk-0001, with nucleotide lengths of 24, 26, 30, and 34, were designed ( Fig. 2A Fig. 2B Fig. 2C Fig. 2D Fig. 2E Fig. 2F 10.7717/peerj.20123/fig-2 Figure 2 Construction of CRISPR-Cas13d recombinant plasmids and its knockdown efficiency. (A) Lengths and sequences of crRNA spacers flanking the BSJ site of circAdpgk-0001; bases flanking the BSJ site are shown in brown. (B) The knockdown efficiencies of each CRISPR-RfxCas13d-crRNA recombinant plasmid ( n n n p p p Higher knockdown efficiency of CRISPR-Cas13d, compared with siRNAs Cell experiments were conducted using the optimal transfection conditions for siRNA-5 and the Cas13d/24 plasmid to compare the knockdown efficiency simultaneously. The knockdown efficiency of the Cas13d/24 recombinant plasmid was significantly higher than that of siRNA-5 ( Figs. 3A 3B Fig. 3C Fig. 3D Fig. 3E Figs. 4A 4B Fig. 4C 10.7717/peerj.20123/fig-3 Figure 3 The comparison of knockdown efficiency and effects on mRNA expression levels of collagen I and α-SMA between CRISPR-Cas13d and siRNAs. (A) The knockdown efficiency of the Cas13d/24 recombinant plasmid and siRNA-5, respectively ( n n n n p p p 10.7717/peerj.20123/fig-4 Figure 4 The effect on protein expression levels of collagen I and α-SMA with of CRISPR-Cas13d and siRNAs. (A and B) Expression of collagen I and α-SMA protein levels after circAdpgk - 0001 knockdown by siRNA-5 and Cas13d/24 ( n n p p p Discussion The small interfering RNA (siRNA) is a process through which target mRNA is degraded, resulting in genetic expression silencing. The transient introduction of exogenous siRNA produces fast and revisable gene silencing as a low-cost, efficient and accurate tool to knock down target RNAs ( Alshaer et al., 2021 Cheng et al., 2023 Abudayyeh et al., 2017 East-Seletsky et al., 2016 Among the reported Cas13 family proteins with RNA cleavage activities, Cas13d is the most effective effector, exhibiting the highest knockdown efficiency and no detectable effect on their cognate mRNAs ( Konermann et al., 2018 Li, Wu & Chen, 2022 Liu & Chen, 2022 Zhang et al., 2016 Li, Wu & Chen, 2022 Liu et al., 2019 Li, Wu & Chen, 2022 The key part of CRISPR-Cas13 applications is to design crRNAs with high targeting efficiency and specificity. On the one hand, it maximized the efficiency of the knockdown; on the other hand, it helped to avoid the potential off-target effects, such as incidental cleavage of nearby linear RNA ( Li, Wu & Chen, 2022 Li et al., 2021 Zhang et al., 2018 Konermann et al., 2018 Li et al., 2021 Konermann et al., 2013 CRISPR-Cas13 systems have recently been used for targeted RNA degradation in various organisms. However, collateral degradation of bystander RNAs has limited their applications. To avoid this issue, there have been reports in the literatures, RfxCas13d in vitro in vivo Konermann et al., 2018 Morelli et al., 2023 Wessels et al., 2020 Tong et al., 2023 Supplemental Information 10.7717/peerj.20123/supp-1 Supplemental Information 1 Different sequences of siRNAs 10.7717/peerj.20123/supp-2 Supplemental Information 2 Primer pairs used in the current study 10.7717/peerj.20123/supp-3 Supplemental Information 3 The knockdown efficiency of circ-Cyp4f18_0001 and circ-Cdkn3_0002 using the siRNA method (A) The knockdown efficiency of circ-Cyp4f18_0001 by different siRNAs ( n n p p p 10.7717/peerj.20123/supp-4 Supplemental Information 4 The raw data for Figure 1 The qRT-PCR raw data shows differential knockdown efficiencies among six siRNAs and across three distinct transfection conditions ( n 10.7717/peerj.20123/supp-5 Supplemental Information 5 The raw data for Figure 2 The qRT-PCR raw data shows differential knockdown efficiencies among four CRISPR/Cas13d recombinant plasmids and across three distinct transfection conditions.The effect of CRISPR/Cas13d recombinant plasmid on linear maternal gene expression was also examined ( n 10.7717/peerj.20123/supp-6 Supplemental Information 6 The raw data for Figure 3 The qRT-PCR raw data shows a comparison of the knockdown efficiency of siRNA and Cas13d/24 under optimal transfection conditions.And compare the expression of Collagen I and α-SMA ( n 10.7717/peerj.20123/supp-7 Supplemental Information 7 The raw data for Figure 4 The expression of Collagen I and α-SMA at the protein level compared by WB, and the gray value was scanned for statistics ( n 10.7717/peerj.20123/supp-8 Supplemental Information 8 The raw data for Figure S1 The qRT-PCR raw data shows the knockdown efficiency of circ-Cyp4f18_0001 and circ-Cdkn3_0002 with different siRNAs ( n 10.7717/peerj.20123/supp-9 Supplemental Information 9 MIQE checklist Additional Information and Declarations Competing Interests The authors declare there are no competing interests. Author Contributions Sijia Huang Hailan Qin Bingxin Dai Miao Liu Jijia Shen Data Availability The following information was supplied regarding data availability: The raw measurements are available in the Supplementary File References Abudayyeh et al. (2017) Abudayyeh OO Gootenberg JS Essletzbichler P Han S Joung J Belanto JJ Verdine V Cox DBT Kellner MJ Regev A Lander ES Voytas DF Ting AY Zhang F 2017 RNA targeting with CRISPR-Cas13 Nature 550 280 284 10.1038/nature24049 28976959 PMC5706658 Alshaer et al. (2021) Alshaer W Zureigat H Al Karaki A Al-Kadash A Gharaibeh L Hatmal MM Aljabali AAA Awidi A 2021 siRNA: mechanism of action, challenges, and therapeutic approaches European Journal of Pharmacology 905 174178 10.1016/j.ejphar.2021.174178 34044011 Chen et al. (2020) Chen Y Jiang H Wang T He D Tian R Cui Z Tian X Gao Q Ma X Yang J Wu J Tan S Xu H Tang X Wang Y Yu Z Han H Das BC Severinov K Hitzeroth II Debata PR Xu W Fan W Jin Z Cao C Yu M Xie W Huang Z Hu Z You Z 2020 In vitro in vivo via Antiviral Research 178 104794 10.1016/j.antiviral.2020.104794 32298665 Chen et al. (2023a) Chen R Wang SK Belk JA Amaya L Li Z Cardenas A Abe BT Chen CK Wender PA Chang HY 2023a Engineering circular RNA for enhanced protein production Nature Biotechnology 41 262 272 10.1038/s41587-022-01393-0 PMC9931579 35851375 Chen et al. (2023b) Chen X Zhu S Li HD Wang JN Sun LJ Xu JJ Hui YR Li XF Li LY Zhao YX Suo XG Xu CH Ji ML Sun YY Huang C Meng XM Zhang L Lv XW Ye DQ Li J 2023b N(6)-methyladenosine-modified circIRF2, identified by YTHDF2, suppresses liver fibrosis via International Journal of Biological Macromolecules 248 125811 10.1016/j.ijbiomac.2023.125811 37467831 Cheng et al. (2023) Cheng X Li Z Shan R Li Z Wang S Zhao W Zhang H Chao L Peng J Fei T Li W 2023 Modeling CRISPR-Cas13d on-target and off-target effects using machine learning approaches Nature Communications 14 752 10.1038/s41467-023-36316-3 PMC9912244 36765063 East-Seletsky et al. (2016) East-Seletsky A O’Connell MR Knight SC Burstein D Cate JH Tjian R Doudna JA 2016 Two distinct RNase activities of CRISPR-C2c2 enable guide-RNA processing and RNA detection Nature 538 270 273 10.1038/nature19802 27669025 PMC5576363 Huang et al. (2020) Huang A Zheng H Wu Z Chen M Huang Y 2020 Circular RNA-protein interactions: functions, mechanisms, and identification Theranostics 10 3503 3517 10.7150/thno.42174 32206104 PMC7069073 Konermann et al. (2013) Konermann S Brigham MD Trevino A Hsu PD Heidenreich M Cong L Platt RJ Scott DA Church GM Zhang F 2013 Optical control of mammalian endogenous transcription and epigenetic states Nature 500 472 476 10.1038/nature12466 23877069 PMC3856241 Konermann et al. (2018) Konermann S Lotfy P Brideau NJ Oki J Shokhirev MN Hsu PD 2018 Transcriptome engineering with RNA-targeting type VI-D CRISPR effectors Cell 173 665 676 10.1016/j.cell.2018.02.033 29551272 PMC5910255 Kristensen et al. (2022) Kristensen LS Jakobsen T Hager H Kjems J 2022 The emerging roles of circRNAs in cancer and oncology Nature Reviews Clinical Oncology 19 188 206 10.1038/s41571-021-00585-y 34912049 Li et al. (2021) Li S Li X Xue W Zhang L Yang LZ Cao SM Lei YN Liu CX Guo SK Shan L Wu M Tao X Zhang JL Gao X Zhang J Wei J Li J Yang L Chen LL 2021 Screening for functional circular RNAs using the CRISPR-Cas13 system Nature Methods 18 51 59 10.1038/s41592-020-01011-4 33288960 Li, Wu & Chen (2022) Li S Wu H Chen LL 2022 Screening circular RNAs with functional potential using the RfxCas13d/BSJ-gRNA system Nature Protocols 17 2085 2107 10.1038/s41596-022-00715-5 35831613 Liang et al. (2017) Liang D Tatomer DC Luo Z Wu H Yang L Chen LL Cherry S Wilusz JE 2017 The output of protein-coding genes shifts to circular RNAs when the pre-mRNA processing machinery is limiting Molecular Cell 68 940 954 10.1016/j.molcel.2017.10.034 29174924 PMC5728686 Liang et al. (2024) Liang M Wang Y Liu L Deng D Yan Z Feng L Kong C Li C Li Y Li G 2024 Synergistic intravesical instillation for bladder cancer: CRISPR-Cas13a and fenbendazole combination therapy Journal of Experimental & Clinical Cancer Research 43 223 10.1186/s13046-024-03146-0 39128990 PMC11318243 Liu & Chen (2022) Liu CX Chen LL 2022 Circular RNAs: characterization, cellular roles, and applications Cell 185 2016 2034 10.1016/j.cell.2022.04.021 35584701 Liu et al. (2019) Liu CX Li X Nan F Jiang S Gao X Guo SK Xue W Cui Y Dong K Ding H Qu B Zhou Z Shen N Yang L Chen LL 2019 Structure and degradation of circular RNAs regulate PKR activation in innate immunity Cell 177 865 880 10.1016/j.cell.2019.03.046 31031002 McCallister et al. (2025) McCallister TX Lim CKW Singh M Zhang S Ahsan NS Terpstra WM Xiong AY Zeballos CM Powell JE Drnevich J Kang Y Gaj T 2025 A high-fidelity CRISPR-Cas13 system improves abnormalities associated with C9ORF72-linked ALS/FTD Nature Communications 16 460 10.1038/s41467-024-55548-5 PMC11711314 39779681 Morelli et al. (2023) Morelli KH Wu Q Gosztyla ML Liu H Yao M Zhang C Chen J Marina RJ Lee K Jones KL Huang MY Li A Smith-Geater C Thompson LM Duan W Yeo GW 2023 An RNA-targeting CRISPR-Cas13d system alleviates disease-related phenotypes in Huntington’s disease models Nature Neuroscience 26 27 38 10.1038/s41593-022-01207-1 36510111 PMC9829537 Nguyen, Zhang & Pandolfi (2020) Nguyen TM Zhang Y Pandolfi PP 2020 Virus against virus: a potential treatment for 2019-nCov (SARS-CoV-2) and other RNA viruses Cell Research 30 189 190 10.1038/s41422-020-0290-0 32071427 PMC7054296 Panda (2018) Panda AC 2018 Circular RNAs Act as miRNA sponges Advances in Experimental Medicine and Biology 1087 67 79 10.1007/978-981-13-1426-1_6 30259358 Powell et al. (2022) Powell JE Lim CKW Krishnan R McCallister TX Saporito-Magriña C Zeballos MA McPheron GD Gaj T 2022 Targeted gene silencing in the nervous system with CRISPR-Cas13 Science Advances 8 eabk2485 10.1126/sciadv.abk2485 35044815 PMC8769545 Qu et al. (2015) Qu S Yang X Li X Wang J Gao Y Shang R Sun W Dou K Li H 2015 Circular RNA: a new star of noncoding RNAs Cancer Letters 365 141 148 10.1016/j.canlet.2015.06.003 26052092 Salzman et al. (2013) Salzman J Chen RE Olsen MN Wang PL Brown PO 2013 Cell-type specific features of circular RNA expression PLOS Genetics 9 e1003777 10.1371/journal.pgen.1003777 24039610 PMC3764148 Tong et al. (2023) Tong H Huang J Xiao Q He B Dong X Liu Y Yang X Han D Wang Z Wang X Ying W Zhang R Wei Y Xu C Zhou Y Li Y Cai M Wang Q Xue M Li G Fang K Zhang H Yang H 2023 High-fidelity Cas13 variants for targeted RNA degradation with minimal collateral effects Nature Biotechnology 41 108 119 10.1038/s41587-022-01419-7 35953673 Wang et al. (2019) Wang F Wang L Zou X Duan S Li Z Deng Z Luo J Lee SY Chen S 2019 Advances in CRISPR-Cas systems for RNA targeting, tracking and editing Biotechnology Advances 37 708 729 10.1016/j.biotechadv.2019.03.016 30926472 Wessels et al. (2020) Wessels HH Méndez-Mancilla A Guo X Legut M Daniloski Z Sanjana NE 2020 Massively parallel Cas13 screens reveal principles for guide RNA design Nature Biotechnology 38 722 727 10.1038/s41587-020-0456-9 PMC7294996 32518401 Yuan et al. (2023) Yuan Q Sun Y Yang F Yan D Shen M Jin Z Zhan L Liu G Yang L Zhou Q Yu Z Zhou X Yu Y Xu Y Wu Q Luo J Hu X Zhang C 2023 CircRNA DICAR as a novel endogenous regulator for diabetic cardiomyopathy and diabetic pyroptosis of cardiomyocytes Signal Transduction and Targeted Therapy 8 99 10.1038/s41392-022-01306-2 36882410 PMC9992392 Zeballos et al. (2023) Zeballos CM Moore HJ Smith TJ Powell JE Ahsan NS Zhang S Gaj T 2023 Mitigating a TDP-43 proteinopathy by targeting ataxin-2 using RNA-targeting CRISPR effector proteins Nature Communications 14 6492 10.1038/s41467-023-42147-z PMC10576788 37838698 Zhang et al. (2018) Zhang C Konermann S Brideau NJ Lotfy P Wu X Novick SJ Strutzenberg T Griffin PR Hsu PD Lyumkis D 2018 Structural basis for the RNA-guided ribonuclease activity of CRISPR-Cas13d Cell 175 212 223 10.1016/j.cell.2018.09.001 30241607 PMC6179368 Zhang et al. (2016) Zhang Y Xue W Li X Zhang J Chen S Zhang JL Yang L Chen LL 2016 The biogenesis of nascent circular RNAs Cell Reports 15 611 624 10.1016/j.celrep.2016.03.058 27068474 Zhang et al. (2019) Zhang B Ye Y Ye W Perčulija V Jiang H Chen Y Li Y Chen J Lin J Wang S Chen Q Han YS Ouyang S 2019 Two HEPN domains dictate CRISPR RNA maturation and target cleavage in Cas13d Nature Communications 10 2544 10.1038/s41467-019-10507-3 PMC6559982 31186424 Zhou et al. (2020) Zhou WY Cai ZR Liu J Wang DS Ju HQ Xu RH 2020 Circular RNA: metabolism, functions and interactions with proteins Molecular Cancer 19 172 10.1186/s12943-020-01286-3 33317550 PMC7734744 ",
  "metadata": {
    "Title of this paper": "Circular RNA: metabolism, functions and interactions with proteins",
    "Journal it was published in:": "PeerJ",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495950/"
  }
}