{
  "title": "Paper_570",
  "abstract": "pmc Int J Endocrinol Int J Endocrinol 995 ijendocrin ije International Journal of Endocrinology 1687-8337 1687-8345 Wiley PMC12474009 PMC12474009.1 12474009 12474009 41019283 10.1155/ije/4063672 1 Research Article Risk Stratification of Thyroid Nodules 10 mm in Diameter or Less: Strength and Pitfalls of the Ultrasonographic Assessment From a Cross-Sectional Study https://orcid.org/0000-0001-6521-8578 Lisco Giuseppe  1 https://orcid.org/0000-0001-6341-6140 De Tullio Anna  1 https://orcid.org/0000-0002-7073-1795 Giagulli Vito Angelo  1 Renzulli Giuseppina  2 https://orcid.org/0000-0001-6308-0528 Triggiani Vincenzo vincenzo.triggiani@uniba.it  1  1  2 Academic Editor: Suraiya Saleem 2025 19 9 2025 2025 480726 4063672 10 10 2024 4 9 2025 8 9 2025 19 09 2025 27 09 2025 29 09 2025 Copyright © 2025 Giuseppe Lisco et al. International Journal of Endocrinology published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited.  Background:  Aim:  Methods:  Results: p p p p  Discussion: The authors declare they did not receive funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Background The prevalence of thyroid nodules has increased over the last 4 decades, leading clinicians to resort to cytological characterization more frequently, with a remarkable increase in the number of patients undergoing thyroid fine needle aspiration (FNA) and surgery because of indeterminate, suspicious, or malignant thyroid cytology [ 1 2 3 4 On this basis, most guidelines recommend that nodules ≤ 10 mm should be excluded from FNA and cytological assessment to reduce the rate of overdiagnosis of small (and possibly indolent) thyroid carcinomas [ 5 5 6 7 Several scores and algorithms have been validated to guide clinicians in selecting thyroid nodules requiring cytological characterization based on clinical and ultrasonographic characteristics [ 8 13 14 15 16 17 19 20 This is a cross-sectional study aiming to address the overall performance of validated algorithms and the weight of ultrasonographic characteristics of thyroid nodules in properly conducting the clinical decision to carry out or not thyroid FNA and cytology in unselected nodules ≤ 10 mm. 2. Methods 2.1. Study Design A cross-sectional study was conducted on 112 unselected consecutive outpatients who attended the Azienda Ospedaliera Policlinico—University of Bari from January 01 to December 31, 2016, and underwent echo-assisted FNA for cytological characterization of one or more thyroid nodules. All of them underwent thyroid surgery too. Detailed information about the study's characteristics, population, and methods is described elsewhere [ 21 2.2. Data Extraction We extracted data of patients with thyroid nodules ≤ 10 mm from 118 thyroid nodules of 112 outpatients examined in 2016. Overall, 65 thyroid nodules from 38 outpatients were included (nodules/outpatient ratio = 1.7). 2.3. Neck Ultrasound All patients underwent neck ultrasound before FNA to collect proper information on the thyroid gland, number, site, and ultrasonographic characteristics of thyroid nodules and lymph nodes. Neck ultrasound was carried out by a single operator (VT) with ESAOTE MyLab25, 13-4 MHz linear array transducer. 2.4. Reporting System of Thyroid Ultrasound Ultrasound images collected from each patient included (a) full thyroid images (right lobe, left lobe, and isthmus), (b) measurements of the three major thyroid axes in both planes (transverse and longitudinal), and (c) nodule images describing the three major nodular axes in both planes (transverse and longitudinal). A detailed description of thyroid nodule characteristics was reported according to a standardized reporting system, including (a) nodule diameter, (b) composition, (c) echogenicity, (d) shape, (e) margins, (f) echoic foci, (g) peri-nodular calcification, and (h) vascular signals. The position of thyroid nodules was also described (lobes or isthmus; upper, inner, or lower side; anterior or posterior location; location with respect to thyroid capsule). 2.5. Risk Classification of Thyroid Nodules Neck images were retrospectively re-examined by two operators (Giuseppe Lisco and Vincenzo Triggiani) for a second look. Each operator reviewed neck ultrasound images to collect information properly and run algorithms. Thyroid nodule descriptions were according to the revised ultrasound Lexicon for thyroid nodule [ 22 Four algorithms were selected to estimate the risk of each nodule, namely the American Association of Clinical Endocrinology/American College of Endocrinology/Associazione Medici Endocrinologi (AACE/ACE/AME), the American College of Radiology Thyroid Imaging Reporting and Data System (ACR-TIRADS), the European TIRADS (EU-TIRADS), and the Korean TIRADS (K-TIRADS). 2.6. Thyroid Cytology Upon FNA was performed, specimens were used to prepare 96% ethyl alcohol thin-layer slides for cytological assessment; then, cytological assessment was carried out by a single operator GR at the Pathology Department of the University of Bari. Most importantly, the pathologist received a detailed description of each nodule. Cytological diagnoses were formulated according to the joint classification of the Società Italiana di Anatomia Patologica e Citologia (SIAPeC)—International Academy of Pathology (IAP) 2014 for the classification and reporting of thyroid cytology [ 23 2.7. Thyroid Surgery Patients with indeterminate, suspicious, or malignant lesions at cytology were referred to a surgeon. Seventeen nodules (26%) from 11 outpatients had no cytological indication of thyroid surgery. However, these nodules were part of multinodular thyroid disease or goiter, in which at least one nodule had an indeterminate, suspicious, or malignant cytology, or there was clinical indication for thyroidectomy (e.g., compressive complaints). 2.8. Thyroid Pathology Thyroid specimens were sent to the Pathology Department, where the same operator (GR) handled them for pathological analyses. Most importantly, each nodule was identified and analyzed for an accurate pathological diagnosis. 2.9. Statistical Analysis Descriptive statistics of quantitative variables were presented as mean ± standard deviation or median [min; max] according to their distribution. Descriptive statistics of qualitative categorical variables were presented as counts and percentages. Comparisons between categorical variables, differences in frequencies, and odds ratios between categorical variables were assessed by the chi-square test or Fisher's exact test. Generalized linear models were used to provide regression analysis and analysis of variance for multiple independent variables by one dependent variable (histological diagnosis) with the aim of testing for predicting ultrasonographic features identifying high-risk thyroid nodules. All analyses were carried out with R. The statistical significance level was set to a p 2.10. Sample Size The sample size was calculated for the primary outcome which was the estimation of predicting factors (and related odds ratios) of risk of thyroid malignancy based on the leading neck ultrasonographic features (seven variables). The sample size should be intended as the sufficient number of thyroid nodules, and not patients, to include for the analyses. It was estimated with G∗power 3.1, resulting in 61 nodules ( z β 3. Results 3.1. Characteristics of the Study Population The median age of the study population was 49.5 years [16; 69], 33 women (86.8%) and 5 men (13.2%). Eighteen patients (47.3%) had a family history of nonmalignant thyroid diseases, such as chronic autoimmune thyroiditis, diffuse or multinodular goiter, and thyroid nodule(s). A family history of differentiated thyroid cancer was registered in 8 of 38 outpatients (21%). Four patients had multinodular thyroid disease with or without thyroid enlargement (10.5%); the remaining 34 (89.5%) had a single thyroid nodule. Ten of 38 patients (26.3%) had at least one palpable nodule, and half (5 outpatients) had hard palpable nodules. None had lateral cervical lymph node enlargement at physical examination, and the ultrasonographic assessment did not reveal images of suspicious lymph nodes. A basic thyroid panel test was available in 34 out of 38 patients. Fifteen (39.5%) were on levothyroxine. The median TSH value was 1.65 mIU/L [0.6; 18]. Among them, two patients had a TSH value suggestive of hypothyroidism and were not well controlled while on levothyroxine replacement. None had hyperthyroidism at the time of FNA, while 10 individuals (26.3%) had concomitant chronic autoimmune thyroiditis. Nine patients (23.7%) had a recent measurement of unstimulated serum calcitonin, and all values were within the normal reference range. 3.2. Ultrasonographic Features of Examined Nodules 3.2.1. Diameter Thyroid nodule diameters ranged from 4 to 10 mm (median value of 8 mm). Among them, 6 (9.2%) had a diameter ≤ 5 mm (4 of 5 mm and 2 of 4 mm), while the remaining 59 (90.7%) had a diameter > 5 mm. 3.2.2. Composition Sixty-three of 65 (96.7%) nodules had a solid composition, while the remaining 2 (3.3%) had a mixed solid-cystic composition with a mural eccentric solid component. 3.2.3. Echogenicity Echogenicity was described as follows: 4 nodules (6.1%) were hyperechoic, 7 (10.8%) isoechoic, 24 (36.9%) hypoechoic or slightly hypoechoic, and 30 (46.2%) markedly hypoechoic. 3.2.4. Shape Fifty-two of 65 nodules had an oval or round shape (80%), while the remaining 20% (13 out of 65) had a “taller than wide” shape. 3.2.5. Margins Around half of the nodules (33, 50.7%) had regular margins. Six (9.2%) had irregular round-shaped margins, and 18 (27.7%) had irregular spiculated margins. Last, 8 nodules (12.1%) had ill-defined margins. 3.2.6. Echoic Foci Thirty-seven (59.6%) nodules did not have echoic foci. Nineteen (29.2%) had echoic foci attributable to microcalcifications. Seven (10.8%) were classified as having difficult-to-characterize echoic foci, while the remaining 2 (3%) had rough inner macrocalcifications. 3.2.7. Peri-Nodular Calcifications Only one nodule of 8 mm in diameter has an interrupted peri-nodular calcification. 3.2.8. Echo-Color-Doppler Vascular signals were evaluated with Echo-Color/Power Doppler. Most nodules had no vascularization or exhibited slight continuous or discontinuous peri-nodular signals (54, 83.1%). The remaining 11 (26.9%) had peri- and intranodular vascular signals. 3.3. Risk Classification of Thyroid Nodules Thyroid nodules were classified according to 4 systems: two from the US, one European, and one Korean. According to the AACE/ACE/AME, thyroid nodules were classified into three classes of risk (low, indeterminate, or high risk). More precisely, 7 had low risk of malignancy (US1), 16 had indeterminate risk (US2), and the remaining 43 were at high risk of malignancy (US3). According to the ACR-TIRADS, thyroid nodules were classified as follows: one was TR2 (not suspicious), 8 were TR3 (mildly suspicious), 28 were TR4 (moderately suspicious), and 28 were TR5 (highly suspicious). According to the EU-TIRADS, thyroid nodules were classified as follows: one was EU-TR2 (risk of malignancy = 0, benign), 8 were EU-TR3 (risk of malignancy 2%–4%, low risk), 13 were EU-TR4 (risk of malignancy 6%–17%, intermediate risk), and 43 were EU-TR5 (risk of malignancy 26%–87%, high risk). Last, according to the K-TIRADS, nodules was classified as follows: none was K-TR2 (benign), 8 were K-TR3 (low suspicious), 28 were K-TR4 (moderate suspicious), and 29 were K-TR5 (high suspicious). 3.4. Cytological Findings Thyroid cytology was classified and reported as follows: one nodule was classified as TIR1 (nondiagnostic cytologic), 15 were TIR2 (benign cytology), 17 had indeterminate cytology (7, low-risk indeterminate lesions, or TIR3A; 10, high-risk indeterminate lesions, or TIR3B), 8 were classified as suspicious of malignancy (TIR4), and 24 were cytologically defined as malignant lesions (TIR5). 3.5. Pathological Findings Thirty-nine (60%) thyroid nodules were definitively diagnosed as differentiated thyroid microcarcinoma (33 papillary and 3 follicular thyroid cancer), while the remaining 26 (40%) were definitively diagnosed as nonmalignant nodules (goiter, adenoma, goiter and thyroiditis, and thyroiditis). Most importantly, none of nodules diagnosed as differentiated carcinoma had a suspicious histological subtype; so these were defined as well-differentiated thyroid microcarcinoma [ 7 3.6. Performance of Thyroid Cytology The performance of thyroid cytology was estimated since around 80% of patients underwent thyroid surgery because of cytological judgment. Thyroid cytology showed high sensitivity (95%) and moderate specificity (80%), with an overall clinical accuracy of 88% ( Table 1 3.7. Retrospective Analyses of the Performance of Algorithmic-Based Decisions to Carry Out or Not Thyroid FNA 3.7.1. Selection of Thyroid Nodules According to the AACE/ACE/AME Algorithm We retrospectively calculated which nodules would have been recommended for cytological characterization in a hypothetical scenario in which the algorithms would have made any decision. According to the AACE/ACE/AME algorithm, 41 of 65 nodules (63.1%) would have been suitable for cytological characterization (class US3), while 24 (36.9%) would not have been suitable for FNA (classes US1 and US2). 3.7.2. Selection of Thyroid Nodules According to the ACR-TIRADS Algorithm According to the ACR-TIRADS algorithm, 38 of 65 nodules (58.5%) would not have been suitable for cytological characterization (classes TR2, TR3, TR4, and one TR5 < 5 mm), while 27 (41.5%) would have been suitable for FNA (all the other TR5). 3.7.3. Selection of Thyroid Nodules According to the EU-TIRADS Algorithm According to the EU-TIRADS algorithm, 23 of 65 nodules (35.4%) would not have been suitable for cytological characterization (classes TR2, TR3, TR4, and one TR5 < 5 mm), while 42 (64.6%) would have been suitable for FNA (all the other TR5). It should be considered that the algorithm advises that nodules with high suspicious risk (TR5) ranging from 5 to 10 mm can be either followed up or undergo FNA. 3.7.4. Selection of Thyroid Nodules According to the K-TIRADS Algorithm According to the K-TIRADS algorithm, 28 of 65 nodules (43.1%) would not have been suitable for cytological characterization (classes TR3, TR4, and one TR5 < 5 mm), while 37 (56.9%) would have been suitable for FNA (all the other TR5). 3.8. Level of Concordance Amongst the 4 Algorithms The 4 algorithms would have recommended not to perform thyroid FNA concordantly only in 3 nodules (A, B, C), which were histologically diagnosed as thyroid papillary carcinoma (Supporting Information, Table S1 The 4 algorithms would have recommended to perform thyroid FNA concordantly in 9 nodules; six (D, E, F, G, H, I) were histologically diagnosed as thyroid papillary carcinoma ( Table S2 3.9. Performance of the 4 Algorithms (AACE/ACE/AME, ACR-TIRADS, EU-TIRADS, K-TIRADS) The performance of the 4 algorithms was calculated by considering thyroid pathology as the gold standard. The AACE/ACE/AME algorithm showed very low sensitivity and specificity, with an overall clinical accuracy of 38% ( Table 2 The ACR-TIRADS algorithm showed very low sensitivity and specificity, with an overall clinical accuracy of 45% ( Table 3 The EU-TIRADS algorithm showed low sensitivity and specificity, with an overall clinical accuracy of 66% ( Table 4 The K-TIRADS algorithm showed low sensitivity and specificity, with an overall clinical accuracy of 60% ( Table 5 3.10. Ultrasonographic Features of Thyroid Nodule Associated to High Risk of Malignancy Upon the performance of the 4 algorithms has been analyzed, a specific estimation of the risk of thyroid malignancy for each ultrasonographic nodule feature was calculated. Solid compared to the mixed composition was found to be related to high-risk thyroid nodules, even if the result was not statistically significant ( Table S3 p Hypoechoic (both slightly and markedly hypoechoic) nodules were found to be associated with a high risk of thyroid malignancy compared to hyperechoic or isoechoic nodules ( Table 6 p Nodules with a “taller than wide” shape, compared to those with round or ovoidal shape, had a similar risk of thyroid malignancy ( Table S4 p Nodules with irregular than regular or ill-defined margins had a significantly higher risk of thyroid malignancy ( Table 7 p Nodules with microcalcification compared to those without or with any of less specific echoic foci had a markedly higher risk of thyroid malignancy ( Table 8 p Nodules with peri- and intranodular vascular flow compared to those with absent or peripheral vascularization had a slightly higher risk of thyroid malignancy, but the result was not statistically significant ( Table S5 p 3.11. Ultrasonographic Features Predictive of Thyroid Nodule Malignancy A logistic regression model was utilized to identify the predicting factors associated with thyroid nodule malignancy. Two specific models were utilized to analyze the phenomenon. In model 1, all ultrasonographic features were included. As shown in Table 9 In model 2, only ultrasonographic features associated with a higher risk of thyroid malignancy were included (3 covariates). As shown in Table 10 e β e 1.7021 p 4. Discussion An adequate selection of thyroid nodules ≤ 10 mm requiring FNA and cytological characterization is essential to avoid unnecessary and wasteful procedures, decrease the risk of overdiagnosis, and preserve patients' quality of life. The results of our cross-sectional study suggest that algorithm-based selection of thyroid micronodules requiring cytological characterization as highly suspicious for malignancy appears insufficient compared to a less selective strategy. Our data confirmed the uncertain performance of the 4 algorithms (overall clinical accuracy: AACE/ACE/AME, 38%; ACR-TIRADS, 45%; K-TIRADS, 60%; EU-TIRADS, 66%) used in worldwide clinical practice when these are requested to run data from micronodules compared to nodules > 10 mm [ 24 26 As another practical issue, the systematic use of all algorithms to calculate simultaneously the risk of each nodule appears unrealistic and time-consuming. Moreover, the 4 algorithms expressed the same judgment (100% agreement) in 9 of 65 nodules (performing FNA in 6; not FNA in 3; all were papillary carcinomas). Ultrasonographic features indicating high-risk nodules were hypo-echogenicity (OR 9.4, p p p 27 14 28 p The results of our study provided with useful information to improve the selection of thyroid nodules ≤ 10 mm requiring cytological characterization [ 29 30 5. Study Strengths and Limitations The strength is in the study design, conducted in the same center by experts while evaluating a group of unselected outpatients who consecutively underwent thyroid cytology and thyroid surgery. Most importantly, all nodules were aspirated by an expert endocrinologist and characterized by an expert pathologist, who consequently provided us with precise and accurate histological diagnoses. Two experts also reviewed ultrasound images to characterize the ultrasonographic features of all nodules. The choice of including patients attended at the Center in 2016, before the validation and dissemination of updated guidelines and algorithmic tools, led us to compare a more selective approach of thyroid nodule requiring cytological characterization, typically observed after 2016, with a less selective approach based on clinical expertise, typically observed before 2016. Most of these nodules, despite being ≤ 10 mm, were categorized as at moderate-to-high suspicion according to ultrasonographic characteristics. In addition, patients had a family and personal history of risk factors for thyroid carcinoma (i.e., Hashimoto's thyroiditis and cases of differentiated thyroid cancer in relatives) with a frequency exceeding that observed in the general population but substantially in line with other reports on patients who underwent thyroid FNA [ 31 32 The limitation is in the study nature (cross-sectional, real-life study) and related selection biases (small high-risk nodules) and in the relatively low number of nodules ≤ 10 mm as compared to the entire cohort of thyroid nodules selected with the same method in 2016 (65 out of 188), indicating that thyroid nodules ≤ 10 mm, despite being diagnosed more frequently than those > 10 mm, were less prone to be referred for FNA, also regardless to background ultrasonographic risk. Moreover, ultrasound characteristics of nodules were retrospectively collected from frozen images, as we did not have ultrasound time frames or short video clips to review all thyroid nodules' characteristics at a glance. Last, the lack of follow-up did not allow us to register clinical outcomes and the ongoing risk stratification to compare the risk-to-benefit ratio of the two procedures (algorithm-based versus clinical-based decision). 6. Conclusion Although most valuable and validated algorithmic tools fail to perform accurately in the selection of thyroid nodules ≤ 10 mm requiring cytological characterization as high-risk lesions, here, we defined the ultrasonographic hallmark of high-risk thyroid micronodules actually requiring to be referred to specialized centers for FNA and cytological characterization. The ultrasonographic feature is represented by hypoechoic/markedly hypoechoic micronodules also irrespective to other ultrasonographic features. Besides patients with clinical characteristics suggesting thyroid FNA, those with hypoechoic and markedly hypoechoic nodules should undergo cytological characterization, even in the case of thyroid nodules ≤ 10 mm. Acknowledgments The authors have nothing to report. Nomenclature AACE/ACE/AME American Association of Clinical Endocrinology/American College of Endocrinology/Associazione Medici Endocrinologi ACR-TIRADS American College of Radiology Thyroid Imaging Reporting and Data System EU-TIRADS European Thyroid Imaging Reporting and Data System FNA Fine needle aspiration K-TIRADS Korean Thyroid Imaging Reporting and Data System SIAPeC-IAP Società Italiana di Anatomia Patologica e Citologia—International Academy of Pathology TIRADS Thyroid imaging reporting and data system Data Availability Statement The data supporting the findings of this study are available from the corresponding author on reasonable request. Disclosure All the authors read the manuscript and approved the manuscript submission. Conflicts of Interest The authors declare no conflicts of interest. Author Contributions Vincenzo Triggiani and Giuseppe Lisco conceived the study; Vincenzo Triggiani provided expertise in neck ultrasound and thyroid fine needle aspiration; Giuseppina Renzulli provided expertise in thyroid pathology; Giuseppe Lisco and Vincenzo Triggiani reviewed neck ultrasound images and collected proper data to run algorithms for thyroid nodule risk stratification; Vincenzo Triggiani and Giuseppe Lisco prepared the database; Giuseppe Lisco and Vincenzo Triggiani revised the database; Giuseppe Lisco provided statistical expertise; Giuseppe Lisco and Anna De Tullio drafted the manuscript; all the authors provided feedbacks at every stages of draft preparation and review and approved the submission and publication to the journal. Supporting Information Supporting Information Additional supporting information can be found online in the Supporting Information section. Tables S1–S5 and the STROBE checklist for cross-sectional studies. 1 Grussendorf M. Ruschenburg I. Brabant G. Malignancy Rates in Thyroid Nodules: A Long-Term Cohort Study of 17,592 Patients European Thyroid Journal 2022 11 4 p. e220027 10.1530/ETJ-22-0027 PMC9254276 35635802 2 Bessey L. J. Lai N. B. Coorough N. E. Chen H. Sippel R. S. The Incidence of Thyroid Cancer by Fine Needle Aspiration Varies by Age and Gender Journal of Surgical Research 2013 184 2 761 765 10.1016/j.jss.2013.03.086 2-s2.0-84883869026 23623584 PMC3773258 3 Park S. Oh C. M. Cho H. Association Between Screening and the Thyroid Cancer “Epidemic” in South Korea: Evidence From a Nationwide Study BMJ 2016 355 p. i5745 10.1136/bmj.i5745 2-s2.0-85002244028 PMC5130923 27903497 4 Guth S. Theune U. Aberle J. Galach A. Bamberger C. M. Very High Prevalence of Thyroid Nodules Detected by High Frequency (13 MHz) Ultrasound Examination European Journal of Clinical Investigation 2009 39 8 699 706 10.1111/j.1365-2362.2009.02162.x 2-s2.0-68149141436 19601965 5 Sutherland R. Tsang V. Clifton-Bligh R. J. Gild M. L. Papillary Thyroid Microcarcinoma: Is Active Surveillance Always Enough? Clinical Endocrinology 2021 95 6 811 817 10.1111/cen.14529 34021503 6 Cho S. J. Suh C. H. Baek J. H. Active Surveillance for Small Papillary Thyroid Cancer: A Systematic Review and Meta-Analysis Thyroid 2019 29 10 1399 1408 10.1089/thy.2019.0159 2-s2.0-85073486236 31368412 7 Juhlin C. C. Mete O. Baloch Z. W. The 2022 WHO Classification of Thyroid Tumors: Novel Concepts in Nomenclature and Grading Endocrine-Related Cancer 2023 December 30 2 p. e220293 10.1530/ERC-22-0293 36445235 8 Weller A. Sharif B. Qarib M. H. St Leger D. De Silva H. S. Lingam R. K. British Thyroid Association 2014 Classification Ultrasound Scoring of Thyroid Nodules in Predicting Malignancy: Diagnostic Performance and Inter-Observer Agreement Ultrasound 2020 28 1 4 13 10.1177/1742271X19865001 2-s2.0-85070409001 32063989 PMC6987506 9 Haugen B. R. Alexander E. K. Bible K. C. 2015 American Thyroid Association Management Guidelines for Adult Patients With Thyroid Nodules and Differentiated Thyroid Cancer: The American Thyroid Association Guidelines Task Force on Thyroid Nodules and Differentiated Thyroid Cancer Thyroid 2016 26 1 1 133 10.1089/thy.2015.0020 2-s2.0-84954538661 26462967 PMC4739132 10 Gharib H. Papini E. Garber J. R. American Association of Clinical Endocrinologists, American College of Endocrinology, and Associazione Medici Endocrinologi Medical Guidelines for Clinical Practice for the Diagnosis and Management of Thyroid Nodules--2016 Update Endocrine Practice 2016 22 5 622 639 10.4158/EP161208.GL 2-s2.0-84982283721 27167915 11 Tessler F. N. Middleton W. D. Grant E. G. ACR Thyroid Imaging, Reporting and Data System (TI-RADS): White Paper of the ACR TI-RADS Committee Journal of the American College of Radiology 2017 14 5 587 595 10.1016/j.jacr.2017.01.046 2-s2.0-85016418905 28372962 12 Yi K. H. The Revised 2016 Korean Thyroid Association Guidelines for Thyroid Nodules and Cancers: Differences From the 2015 American Thyroid Association Guidelines Endocrinology and Metabolism (Seoul) 2016 31 3 373 378 10.3803/EnM.2016.31.3.373 2-s2.0-85001103536 PMC5053047 27704738 13 Russ G. Bonnema S. J. Erdogan M. F. Durante C. Ngu R. Leenhardt L. European Thyroid Association Guidelines for Ultrasound Malignancy Risk Stratification of Thyroid Nodules in Adults: The EU-TIRADS European Thyroid Journal 2017 6 5 225 237 10.1159/000478927 29167761 PMC5652895 14 Campanella P. Ianni F. Rota C. A. Corsello S. M. Pontecorvi A. Diagnosis in Endocrinology: Quantification of Cancer Risk of Each Clinical and Ultrasonographic Suspicious Feature of Thyroid Nodules: A Systematic Review and Meta-Analysis European Journal of Endocrinology 2014 170 5 R203 R211 10.1530/EJE-13-0995 2-s2.0-84899738557 24536085 15 Remonti L. R. Kramer C. K. Leitão C. B. Pinto L. C. Gross J. L. Thyroid Ultrasound Features and Risk of Carcinoma: A Systematic Review and Meta-Analysis of Observational Studies Thyroid 2015 25 5 538 550 10.1089/thy.2014.0353 2-s2.0-84928884180 25747526 PMC4447137 16 Edwards M. Brito J. P. Salloum R. G. Hoang J. Singh Ospina N. Implementation Strategies to Support Ultrasound Thyroid Nodule Risk Stratification: A Systematic Review Clinical Endocrinology 2023 99 4 417 427 10.1111/cen.14942 37393196 PMC10529907 17 Trimboli P. Castellana M. Piccardo A. The Ultrasound Risk Stratification Systems for Thyroid Nodule Have Been Evaluated Against Papillary Carcinoma. A Meta-Analysis Reviews in Endocrine & Metabolic Disorders 2021 22 2 453 460 10.1007/s11154-020-09592-3 32959174 PMC8087557 18 Joo L. Lee M. K. Lee J. Y. Ha E. J. Na D. G. Diagnostic Performance of Ultrasound-Based Risk Stratification Systems for Thyroid Nodules: A Systematic Review and Meta-Analysis Endocrinology and Metabolism (Seoul) 2023 38 1 117 128 10.3803/EnM.2023.1670 PMC10008666 36891658 19 Kim D. H. Kim S. W. Basurrah M. A. Lee J. Hwang S. H. Diagnostic Performance of Six Ultrasound Risk Stratification Systems for Thyroid Nodules: A Systematic Review and Network Meta-Analysis American Journal of Roentgenology 2023 220 6 791 803 10.2214/AJR.22.28556 36752367 20 David E. Grazhdani H. Tattaresu G. Thyroid Nodule Characterization: Overview and State of the Art of Diagnosis With Recent Developments, From Imaging to Molecular Diagnosis and Artificial Intelligence Biomedicines 2024 12 8 p. 1676 10.3390/biomedicines12081676 PMC11351886 39200141 21 Triggiani V. Lisco G. Renzulli G. The TNAPP Web-Based Algorithm Improves Thyroid Nodule Management in Clinical Practice: A Retrospective Validation Study Frontiers in Endocrinology 2023 13 p. 1080159 10.3389/fendo.2022.1080159 PMC9911894 36778596 22 Durante C. Hegedüs L. Na D. G. International Expert Consensus on US Lexicon for Thyroid Nodules Radiology 2023 309 1 p. e231481 10.1148/radiol.231481 37906014 23 Nardi F. Basolo F. Crescenzi A. Italian Consensus for the Classification and Reporting of Thyroid Cytology Journal of Endocrinological Investigation 2014 37 6 593 599 10.1007/s40618-014-0062-0 2-s2.0-84903782829 24789536 24 Kovatcheva R. D. Shinkov A. D. Dimitrova I. D. Ivanova R. B. Vidinov K. N. Ivanova R. S. Evaluation of the Diagnostic Performance of EU-TIRADS in Discriminating Benign From Malignant Thyroid Nodules: A Prospective Study in One Referral Center European Thyroid Journal 2020 9 6 304 312 10.1159/000507575 33718254 PMC7923902 25 Lauria Pantano A. Maddaloni E. Briganti S. I. Differences Between ATA, AACE/ACE/AME and ACR TI-RADS Ultrasound Classifications Performance in Identifying Cytological High-Risk Thyroid Nodules European Journal of Endocrinology 2018 178 6 595 603 10.1530/EJE-18-0083 2-s2.0-85046990982 29626008 26 Mistry R. Hillyar C. Nibber A. Sooriyamoorthy T. Kumar N. Ultrasound Classification of Thyroid Nodules: A Systematic Review Cureus 2020 12 3 p. e7239 10.7759/cureus.7239 PMC7067371 32190531 27 Smith-Bindman R. Lebda P. Feldstein V. A. Risk of Thyroid Cancer Based on Thyroid Ultrasound Imaging Characteristics: Results of a Population-Based Study JAMA Internal Medicine 2013 173 19 1788 1796 10.1001/jamainternmed.2013.9245 2-s2.0-84887082978 23978950 PMC3936789 28 Rago T. Vitti P. Risk Stratification of Thyroid Nodules: From Ultrasound Features to TIRADS Cancers (Basel) 2022 14 3 p. 717 10.3390/cancers14030717 PMC8833686 35158985 29 Sugitani I. Ito Y. Takeuchi D. Indications and Strategy for Active Surveillance of Adult Low-Risk Papillary Thyroid Microcarcinoma: Consensus Statements From the Japan Association of Endocrine Surgery Task Force on Management for Papillary Thyroid Microcarcinoma Thyroid 2021 31 2 183 192 10.1089/thy.2020.0330 33023426 PMC7891203 30 Alhashemi A. Goldstein D. P. Sawka A. M. A Systematic Review of Primary Active Surveillance Management of Low-Risk Papillary Carcinoma Current Opinion in Oncology 2016 28 1 11 17 10.1097/CCO.0000000000000244 2-s2.0-84950247767 26632767 31 Staii A. Mirocha S. Todorova-Koteva K. Glinberg S. Jaume J. C. Hashimoto Thyroiditis is More Frequent Than Expected When Diagnosed by Cytology Which Uncovers a Pre-Clinical State Thyroid Research 2010 December 3 1 p. 11 10.1186/1756-6614-3-11 2-s2.0-78651090542 PMC3016247 21172028 32 Capezzone M. Robenshtok E. Cantara S. Castagna M. G. Familial Non-Medullary Thyroid Cancer: A Critical Review Journal of Endocrinological Investigation 2021 May 44 5 943 950 10.1007/s40618-020-01435-x 33025555 PMC8049908 Table 1 Performance of thyroid cytology as compared to thyroid pathology (gold standard) in driving clinical judgment to recommend or not thyroid surgery. SIAPeC-IAP classification Pathology Malignant Nonmalignant Recommendation for surgery (TIR 3B, 4, or 5) 37 5 No recommendation for surgery (TIR 2 or 3A) 2 20  Note: Table 2 Performance of the AACE/ACE/AME algorithm (thyroid pathology as the gold standard). Algorithm-based judgment Malignant nodules Nonmalignant nodules Perform FNA 20 21 Avoid FNA 19 5  Note: Table 3 Performance of the ACR-TIRADS algorithm (thyroid pathology as the gold standard). Algorithm-based judgment Malignant nodules Nonmalignant nodules Perform FNA 15 12 Avoid FNA 24 14  Note: Table 4 Performance of the EU-TIRADS algorithm (thyroid pathology as the gold standard). Algorithm-based judgment Malignant nodules Nonmalignant nodules Perform FNA 29 12 Avoid FNA 10 14  Note: Table 5 Performance of the K-TIRADS algorithm (thyroid pathology as the gold standard). Algorithm-based judgment Malignant nodules Nonmalignant nodules Perform FNA 26 11 Avoid FNA 15 13  Note: Table 6 Estimation of the risk of thyroid malignancy according to nodule echogenicity (slightly or markedly hypoechoic versus hyper- or isoechoic). Pathology Hyper- or isoechoic Slightly or markedly hypoechoic OR  p Nonmalignant 9 17 9.4; 95% CI [1.69; 98.97] 0.0047 Malignant 2 37 Table 7 Estimation of the risk of thyroid malignancy according to nodule margins (irregular versus regular or ill-defined). Pathology Regular or ill-defined margins Irregular margins OR  p Nonmalignant 22 4 5.6; 95% IC [1.52; 26.7] 0.004 Malignant 19 20 Table 8 Estimation of the risk of thyroid malignancy according to echoic foci (microcalcification versus any of less specific echoic foci). Pathology Any of the less specific echoic foci Microcalcifications OR  p Nonmalignant 24 2 8.9; 95% IC [1.80; 89.19] 0.0019 Malignant 22 17 Table 9 Multivariable logistic regression to predict the risk of thyroid malignancy starting from ultrasonographic features (composition, echogenicity, shape, margins, peripheral calcification, echoic foci, and vascular signals). Ultrasonographic features Estimate Std. error  z Pr (> | z Composition 16.86 2562.21 0.007 0.9947 Echogenicity 1.6456 0.9148 1.799 0.0720 Shape −0.8889 0.9364 −0.949 0.3424 Margins 1.5439 0.9378 1.646 0.0997 Peripheral calcifications 17.5795 3956.1804 0.004 0.9965 Echoic foci 1.0895 0.9381 1.161 0.2455 Flow 0.9327 0.8341 1.118 0.2635  Note: ∗∗∗ ∗∗ ∗ Table 10 Multivariable logistic regression to predict the risk of thyroid malignancy by considering high-risk ultrasonographic features (echogenicity, margins, and echoic foci). Ultrasonographic features Estimate Std. error  z Pr (> | z Intercept 1.6138 0.7950 −2.030 0.0424 ∗ Echogenicity 1.7021 0.8622 1.974 0.0484 ∗ Margins 0.9475 0.7353 1.289 0.1975 Echoic foci 1.3676 0.8983 1.522 0.1279  Note: ∗∗∗ ∗∗ ∗ ",
  "metadata": {
    "Title of this paper": "Familial Non-Medullary Thyroid Cancer: A Critical Review",
    "Journal it was published in:": "International Journal of Endocrinology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474009/"
  }
}