{
  "title": "Paper_1092",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12477746 PMC12477746.1 12477746 12477746 41030752 10.7759/cureus.91280 1 Pathology Reliability of Frozen Section Biopsy in Detecting Endometrial Pathologies: A Systematic Review of Sensitivity and Specificity Muacevic Alexander Adler John R Ali Mohammed Mudather Abdelgabar 1 TalbAllah Sumaia Mohammed 2 Edris Mohamed Miada Adel 3 Abdalla Hamrawi Nahla Widatalla 4 Elamin Osman Alaa Mohamed 5 Salih Elfaki Tasabeeh Ibrahim 6  1  2  3  4  5  6 Tasabeeh Ibrahim Salih Elfaki tasabeehelfaki@gmail.com 30 8 2025 8 2025 17 8 494304 e91280 29 8 2025 30 08 2025 30 09 2025 01 10 2025 Copyright © 2025, Ali Mohammed et al. 2025 Ali Mohammed et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/404664-reliability-of-frozen-section-biopsy-in-detecting-endometrial-pathologies-a-systematic-review-of-sensitivity-and-specificity Endometrial pathologies, ranging from benign hyperplasia to carcinoma, present significant diagnostic challenges in gynecologic practice. Frozen section (FS) biopsy, a rapid intraoperative histopathological evaluation method, is widely used for surgical decision-making, but its diagnostic reliability remains debated. This systematic review evaluates the sensitivity, specificity, and overall accuracy of FS biopsy in detecting endometrial pathologies compared with final histopathology. Following the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) 2020 guidelines, we conducted a comprehensive search of PubMed, Scopus, Web of Science, and Embase up to July 2025. Fifteen studies meeting predefined eligibility criteria (e.g., comparative design, sufficient diagnostic data) were included. Risk of bias was assessed using the Quality Assessment of Diagnostic Accuracy Studies-2 (QUADAS-2) tool. Data on sensitivity, specificity, positive predictive value (PPV), negative predictive value (NPV), and concordance rates were extracted and synthesized narratively due to methodological heterogeneity. Among the 15 studies, FS biopsy exhibited high specificity and variable sensitivity. Concordance with final histopathology was strong for invasive carcinomas but poor for complex atypical hyperplasia (CAH). Reported accuracy ranged from 43.47% to 97%, with higher reliability for high-grade tumors and myometrial invasion. Limitations included sampling errors and pathologist-dependent variability. FS biopsy is highly specific for detecting endometrial malignancies and valuable for intraoperative guidance, particularly when gross lesions are present. However, its limited sensitivity for CAH and early-stage cancers necessitates caution. Integration with preoperative imaging and standardized protocols may optimize its use. Final paraffin-embedded histopathology remains the gold standard for definitive diagnosis. diagnostic accuracy endometrial cancer endometrial hyperplasia frozen section biopsy intraoperative diagnosis sensitivity specificity pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction and background Endometrial pathologies, ranging from benign hyperplasia to endometrial carcinoma, represent a significant burden in gynecologic practice, particularly among perimenopausal and postmenopausal women [ 1 2 Frozen section biopsy is a diagnostic technique in which surgically removed tissue is quickly frozen, thinly sliced, stained, and examined under a microscope to provide immediate pathological information during surgery [ 3 4 5 Despite its widespread use, the diagnostic reliability of FS biopsy in detecting endometrial pathologies remains debated. Studies have reported variable sensitivity (the ability to correctly identify disease) and specificity (the ability to correctly exclude disease), depending on patient population and clinical setting [ 6 7 8 Given the clinical and surgical implications, it is essential to systematically evaluate the diagnostic performance of FS biopsy in endometrial pathologies. While some meta-analyses and narrative reviews have explored its accuracy, findings remain inconsistent and often limited by variations in methodology. A comprehensive synthesis of recent evidence is therefore warranted to provide greater clarity. This systematic review aims to assess the reliability of frozen section biopsy in diagnosing endometrial abnormalities, focusing on its sensitivity and specificity compared with the final paraffin-embedded histopathological examination, the gold standard. By consolidating current data, this review seeks to refine understanding of FS accuracy, highlight sources of variability, and inform its optimal application in clinical practice. Review Methodology Study Design and Protocol Registration This systematic review was conducted in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) 2020 guidelines [ 9 Eligibility Criteria Studies were included in this review based on predefined eligibility criteria framed using the PIRD framework (Population, Index test, Reference standard, Diagnosis). The target population comprised individuals undergoing evaluation for endometrial pathologies. The index test was intraoperative FS biopsy, and the reference standard was final histopathological diagnosis using formalin-fixed paraffin-embedded (FFPE) sections. Only original studies that provided sufficient data to calculate or directly report sensitivity and specificity were considered. Table 1 Table 1 Eligibility Criteria for Inclusion of Studies FS: frozen section. Inclusion Criteria Exclusion Criteria Studies evaluating the diagnostic accuracy of frozen section biopsy for endometrial pathologies Case reports, reviews, editorials, letters, and conference abstracts Studies comparing FS biopsy results with final paraffin histopathology Studies not reporting sensitivity, specificity, or sufficient diagnostic performance data Human studies published in peer-reviewed journals Animal studies or in vitro experiments Articles published in English Non-English language publications without available English translation Studies with a clearly defined methodology and sample size Duplicate studies or overlapping populations (latest or most complete version included) Information Sources and Literature Search A comprehensive literature search was conducted across four major electronic databases: PubMed, Scopus, Web of Science, and Embase. The search covered studies published up to July 18, 2025, without any restriction on the starting year of publication. In addition, reference lists of all included studies and relevant review articles were manually screened to identify any additional eligible studies. The search strategy was developed using a combination of MeSH terms and free-text keywords related to frozen section biopsy and endometrial pathologies. Boolean operators “AND” and “OR” were used to enhance search sensitivity. The detailed search strategy for each database is provided in Table 2 Table 2 Search Strategy Database Search Strategy PubMed (\"Frozen Sections\"[Mesh] OR \"Frozen Section Biopsy\" OR \"FS biopsy\") AND (\"Endometrial Neoplasms\"[Mesh] OR \"Endometrial Carcinoma\" OR \"Endometrial Hyperplasia\" OR \"Endometrial Pathology\") Scopus TITLE-ABS-KEY(\"frozen section biopsy\" OR \"intraoperative frozen section\") AND TITLE-ABS-KEY(\"endometrial cancer\" OR \"endometrial hyperplasia\" OR \"endometrial pathology\") Web of Science TS=(\"frozen section\" AND \"endometrial\") AND TS=(\"diagnosis\" OR \"accuracy\" OR \"sensitivity\" OR \"specificity\") Embase ('frozen section'/exp OR 'frozen section biopsy') AND ('endometrial cancer'/exp OR 'endometrial hyperplasia' OR 'endometrial disease') All search results were exported to EndNote X9 reference manager software (Clarivate Analytics, Philadelphia, Pennsylvania). Duplicate entries were identified and removed using the duplicate detection feature. The remaining articles were imported into Microsoft Excel (Microsoft Corporation, Redmond, Washington) for screening and data management. Selection Process Two independent reviewers screened the titles and abstracts of all retrieved studies. Full texts of potentially eligible studies were then obtained and assessed against the inclusion criteria. Any disagreements during the screening or full-text review phases were resolved through discussion or consultation with a third reviewer. The study selection process is illustrated using a PRISMA 2020 flow diagram. Data Collection Process Data extraction was carried out independently by two reviewers using a standardized and piloted data extraction form. The following information was collected from each included study: author name, year of publication, country, study design, sample size, patient demographics, type of endometrial pathology assessed, FS technique used, reference standard, and diagnostic performance outcomes (true positives, true negatives, false positives, false negatives, sensitivity, specificity). Discrepancies in data extraction were resolved through discussion, and if necessary, through re-examination of the original full-text articles. Risk of Bias Assessment The Quality Assessment of Diagnostic Accuracy Studies 2 (QUADAS-2) tool [ 10 Synthesis of Results Given the heterogeneity observed across studies in terms of study design, patient selection, histological classification, frozen section protocols, and reporting standards, a meta-analysis was not conducted. Pooling the sensitivity and specificity data in a quantitative synthesis would have introduced a substantial risk of misleading conclusions due to this clinical and methodological diversity. Moreover, several studies used different criteria for defining positive diagnoses and employed varying levels of pathologist expertise, further limiting the comparability of data. Instead, a narrative synthesis of the findings was performed, focusing on patterns of diagnostic performance, clinical contexts, and sources of variability across studies. Results Study Selection Process We followed the PRISMA guidelines for study identification and selection. Initially, a comprehensive search across four databases, PubMed (n = 83), Scopus (n = 73), Web of Science (n = 45), and Embase (n = 39), yielded 240 records. After removing 152 duplicate records, 88 studies were screened based on titles and abstracts. Of these, 41 records were excluded for not meeting preliminary criteria. The remaining 47 full-text articles were sought for retrieval, of which 13 could not be accessed. Thus, 34 studies underwent full-text eligibility assessment. After exclusion of 11 studies with unrelated content and 8 review articles, conference abstracts, or case reports, 15 studies [ 11 25 1 Figure 1 PRISMA Flow Diagram of Studies Selection Process PRISMA: Preferred Reporting Items for Systematic Reviews and Meta-Analyses. Characteristics of Included Studies The systematic review included 15 studies [ 11 25 11 13 15 18 23 25 16 19 20 24 14 17 21 22 21 3 Table 3 Characteristics of Included Studies FS: frozen section, EIN: endometrioid intraepithelial neoplasia, EC: endometrial cancer, IFS: intraoperative frozen section, ACH: atypical complex hyperplasia, CAH: complex atypical hyperplasia, CCC: clear cell carcinoma, CS: carcinosarcoma, UPSC: uterine papillary serous carcinoma, FSA: frozen section analysis, PS: permanent section, FIGO: International Federation of Gynecology and Obstetrics, AEH: atypical endometrial hyperplasia, CAEH: complex atypical endometrial hyperplasia, SEH: simple endometrial hyperplasia, NR: not reported. Study (Author, Year) Country Study Design Sample Size (n) Reference Standard Type of Endometrial Pathologies Assessed Frozen Section (FS) Technique Used Main Findings Ege et al., [ 11 Turkey Retrospective cohort study 354 Final histopathology of hysterectomy specimens Endometrioid Intraepithelial Neoplasia (EIN), Endometrial Cancer (EC) Intraoperative frozen-section assessment FS accurately identified endometrial carcinoma in EIN cases, particularly in older and postmenopausal women, and effectively guided the need for staging surgery. Doğan Durdağ et al., [ 12 Turkey Retrospective observational study 223 Paraffin section Endometrial cancer – histologic type, grade, tumor diameter, depth of myometrial invasion, cervical and adnexal involvement Intraoperative FS evaluating histological type, grade, myometrial invasion, tumor diameter, cervical/adnexal spread FS showed good accuracy but led to some undertreatment. High-risk patients often had lymph node metastasis. Gokulu et al., [ 13 Turkey Retrospective cohort study 187 Final pathology report Endometrioid-type endometrial carcinoma Intraoperative FS compared with final pathology Frozen section showed good overall accuracy, with some cases upgraded or downgraded on final pathology. Limbachiya et al., [ 14 India Retrospective analysis 100 Final Histopathology Endometrial carcinoma IFS IFS showed high concordance with final histopathology for malignancy, strong agreement for myometrial invasion, accurate grading in high-grade tumors, and reliable lymph node evaluation. Boyraz et al., [ 15 Turkey Retrospective cross-sectional study 189 Final pathological examination (post-hysterectomy) Endometrial hyperplasia ± concurrent endometrial cancer Intraoperative frozen section during hysterectomy Frozen section showed high specificity but low sensitivity. Most cancers arose from atypical hyperplasia. Routine use of FS may not be necessary. Desouki et al., [ 16 USA Retrospective observational study 250 Final histopathological diagnosis Endometrial carcinoma (tumor grade, depth of myometrial invasion) Gross examination, random sections in the absence of gross lesions, and frozen section FS showed moderate concordance with the final diagnosis for tumor grade. The depth of invasion was often misjudged. Random sections had limited value, while FS was more reliable when a gross lesion was present. Gallego et al., [ 17 Spain Prospective 51 Final postoperative pathological evaluation Endometrial cancer (depth of myometrial invasion) Intraoperative frozen-section assessment during hysterectomy FS had 90.2% accuracy, 73.7% sensitivity, 100% specificity; comparable to DWI-MRI with no statistical difference (p = 1) Gungorduk et al., [ 18 Turkey Retrospective cohort study 128 Permanent histopathology (paraffin section) Atypical Complex Hyperplasia (ACH) and Endometrial Carcinoma Frozen section analysis during total hysterectomy for ACH Moderate agreement between FS and final diagnosis (κ = 0.61, p < 0.0001); novel preoperative scoring model developed; FS recommended for intraoperative assessment. Indermaur et al., [ 19 USA Retrospective Review 23 Final Pathological Diagnosis Complex Atypical Hyperplasia (CAH), Adenocarcinoma Intraoperative frozen section FS correlated with final pathology in 39.1% of cases; 60.8% disagreement; FS is not a reliable indicator for final diagnosis in CAH patients. Kanis et al., [ 20 USA Retrospective Analysis 868 Final histology confirmed by a gynecologic pathologist Grade 3 endometrioid, Clear Cell Carcinoma (CCC), Carcinosarcoma (CS), Uterine Papillary Serous Carcinoma (UPSC) Frozen Section Analysis (FSA) FSA improved the detection of high-risk cases missed preoperatively, but was less accurate for certain tumor types. Kucera et al., [ 21 Prague Retrospective 63 Permanent Section (PS) Diagnosis Early-stage Endometrial Cancer (FIGO Stage I) Intraoperative FS with grading and myometrial invasion assessment Frozen section biopsy showed high diagnostic reliability with minimal impact on surgical management. Morotti et al., [ 22 Italy and Switzerland Retrospective Review 66 Permanent Section Histology Atypical Endometrial Hyperplasia (AEH) and Endometrial Cancer (EC) NR Concordance between FS and permanent section was good (κ=0.75); FS sensitivity 73%, specificity 93.1%, accuracy high; high-risk EC detected more often. Oz et al., [ 23 Turkey Retrospective analysis 143 PS CAEH, SEH, EC Intraoperative FS during abdominal hysterectomy FS is reliable for detecting endometrial cancer, but its accuracy depends on the pathologist’s experience. Stephan et al., [ 24 USA Retrospective cohort study 116 PS Endometrioid adenocarcinoma and CAH Intraoperative frozen section during surgery High concordance between frozen section and permanent section for histology, grade, and myometrial invasion. Frozen section is reliable for guiding lymphadenectomy decisions. Turan et al., [ 25 Turkey Retrospective 125 Paraffin Block Histology CAEH and Endometrial Cancer Intraoperative FS examination of hysterectomy samples FS was Frozen section biopsy showed good agreement with final histology. However, it may not reliably exclude cancer in cases of CAEH. Diagnostic Performance of Frozen Section Biopsy The diagnostic performance of FS biopsy was assessed using metrics such as sensitivity, specificity, positive predictive value (PPV), negative predictive value (NPV), and accuracy. Sensitivity ranged widely across studies, from 41.1% [ 11 14 14 15 23 14 17 19 19 14 4 Table 4 Diagnostic Performance of Frozen Section Biopsy in Detecting Endometrial Pathologies Study (Author, Year) True Positives (TP) False Positives (FP) True Negatives (TN) False Negatives (FN) Sensitivity (%) Specificity (%) PPV (%) NPV (%) Accuracy (%) Ege et al., [ 11 NR NR NR NR 41.1 100 NR NR NR Doğan Durdağ et al., [ 12 NR NR NR 4 (undertreated cases) NR NR NR NR 76.23–95.45 (range across parameters) Gokulu et al., [ 13 NR NR NR NR NR NR NR NR 85.6–95.9 Limbachiya et al., [ 14 95 0 5 2 96.9 100 100 40 97 Boyraz et al., [ 15 6 1 35 5 54.5 97.2 85.7 87.5 89.1 Desouki et al., [ 16 NR NR NR NR NR 100% (gross-only cases) NR 85% (gross-only cases) NR Gallego et al., [ 17 14 0 32 5 73.7 100 100 86.5 90.2 Gungorduk et al., [ 18 NR NR NR NR 80.9 70.3 75.3 76.4 NR Indermaur et al., [ 19 9 6 1 7 56.25 14.29 60.00 12.50 43.47 Kanis et al., [ 20 NR NR NR NR 77 95 NR NR NR Kucera et al., [ 21 NR NR NR NR 77 95 NR NR NR Morotti et al., [ 22 27 2 27 10 73 93.1 93.1 73 81.8 Oz et al., [ 23 43 0 83 17 71.6% (≈76%) 100% 100% 83 88 Stephan et al., [ 24 NR NR NR 7 NR NR NR NR NR Turan et al., [ 25 60 1 47 14 81.1 97.9 98.4 76.7 85.6 Concordance Between Frozen Section and Final Histopathology The concordance between FS and final histopathology was evaluated in several studies. For instance, Limbachiya et al. [ 14 22 19 18 23 Limitations and Variability in Findings The reliability of FS biopsy varied depending on the endometrial pathology assessed. For EC, FS demonstrated high accuracy in detecting high-grade tumors and myometrial invasion [ 14 24 12 19 16 Results of Risk of Bias Assessment Most studies demonstrated a low risk of bias across all domains [ 11 13 14 17 20 23 12 16 15 18 19 5 Table 5 Risk of Bias Assessment (QUADAS-2) Study (Author, Year) Patient Selection Index Test (FS Biopsy) Reference Standard Flow & Timing Overall Risk of Bias Ege et al., [ 11 Low Low Low Low Low Doğan Durdağ et al., [ 12 Unclear Low Low Low Moderate Gokulu et al., [ 13 Low Low Low Low Low Limbachiya et al., [ 14 Low Low Low Low Low Boyraz et al., [ 15 High Low Low Low Moderate Desouki et al., [ 16 Unclear Low Low Low Moderate Gallego et al., [ 17 Low Low Low Low Low Gungorduk et al., [ 18 Moderate Low Low Low Moderate Indermaur et al., [ 19 High High Low High High Kanis et al., [ 20 Low Low Low Low Low Kucera et al., [ 21 Low Low Low Low Low Morotti et al., [ 22 Low Low Low Low Low Oz et al., [ 23 Low Low Low Low Low Stephan et al., [ 24 Low Low Low Low Low Turan et al., [ 25 Low Low Low Low Low Discussion This review comprehensively evaluated the reliability of FS biopsy in detecting endometrial pathologies, incorporating 15 studies that collectively examined its diagnostic performance across various clinical contexts. The findings reveal both the strengths and limitations of FS biopsy, offering critical insights into its role in intraoperative decision-making for EC, EIN, and atypical hyperplasia. The results demonstrate that FS biopsy exhibits high specificity and variable sensitivity, with its accuracy heavily influenced by the type of endometrial pathology, the presence of gross lesions, and the experience of the pathologist. These observations align with prior literature but also highlight significant discrepancies that warrant careful consideration in clinical practice. One of the most consistent findings across the included studies was the high specificity of FS biopsy, particularly for detecting endometrial malignancies. Studies such as Limbachiya et al. [ 14 15 23 17 26 However, the sensitivity of FS biopsy exhibited considerable variability, ranging from 41.1% [ 11 14 19 27 19 The concordance between FS and final histopathology was another critical theme in this review. Studies like Limbachiya et al. [ 14 22 28 16 29 The role of pathologist expertise and the presence of gross lesions emerged as key factors influencing FS accuracy. Oz et al. [ 23 18 30 18 16 31 The risk of bias assessment revealed that most studies (9/15) were methodologically robust, with low risk of bias across all QUADAS-2 domains. These studies, including Ege et al. [ 11 24 12 15 19 When compared with existing literature, the results of this review both corroborate and challenge prior conclusions. For instance, the high specificity and PPV of FS biopsy align with earlier systematic reviews by Proctor et al. [ 32 33 20 24 The clinical implications of these findings are multifaceted. On one hand, FS biopsy offers real-time diagnostic information that can guide surgical decisions, such as the extent of lymphadenectomy or the need for staging procedures. This is especially useful in resource-limited settings where rapid turnaround times are critical. On the other hand, its limitations in diagnosing CAH and early EC suggest that clinicians should exercise caution when relying solely on FS results for these conditions. Integrating FS biopsy with preoperative imaging, such as MRI or ultrasound, could mitigate some of these limitations, as proposed by Gallego et al. [ 17 18 Limitations Despite its comprehensive scope, this review has several limitations. First, the predominance of retrospective studies introduces potential biases, such as selection bias and incomplete data reporting. Second, the heterogeneity in study designs, sample sizes, and FS techniques limits the ability to perform a meta-analysis or draw uniform conclusions. Third, the focus on diagnostic accuracy metrics without detailed clinical outcome data (e.g., long-term survival or recurrence rates) restricts the assessment of the FS biopsy's broader impact on patient care. Finally, the exclusion of non-English studies may have omitted relevant data from other regions, potentially affecting the generalizability of the findings. Conclusions This study highlights the dual nature of frozen section biopsy as both a valuable intraoperative tool and a technique with notable limitations. Its high specificity and PPV make it reliable for confirming malignancy, particularly in the presence of gross lesions, but its variable sensitivity and NPV caution against overreliance in diagnosing premalignant or early-stage conditions. The concordance with final histopathology is generally strong for aggressive tumors but weaker for subtle or heterogeneous lesions. Moving forward, efforts to standardize FS protocols, improve pathologist training, and integrate multimodal diagnostic approaches could enhance its accuracy and clinical utility. Until then, FS biopsy should be viewed as a complementary-rather than definitive-diagnostic method, with final histopathology remaining the gold standard for endometrial pathology assessment. All authors have contributed to this systematic review in accordance with the International Committee of Medical Journal Editors (ICMJE) authorship criteria. Despite being affiliated with different institutions, the authors have a history of active collaboration on various research projects. Each author made substantial and equal contributions to the conception, design, data collection, analysis, interpretation, and drafting of the manuscript. Disclosures Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Acquisition, analysis, or interpretation of data: Critical review of the manuscript for important intellectual content: Supervision: Concept and design: Drafting of the manuscript: References 1 A review of the risk factors associated with endometrial hyperplasia during perimenopause Int J Womens Health Wang L Wei W Cai M 1475 1482 16 2024 39281324 10.2147/IJWH.S481509 PMC11397258 2 Endometrial hyperplasia Obstet Gynecol Ring KL Mills AM Modesitt SC 1061 1075 140 2022 36357974 10.1097/AOG.0000000000004989 3 Intraoperative frozen section biopsy of uterine smooth muscle tumors: a clinicopathologic analysis of 112 cases with emphasis on potential diagnostic pitfalls Am J Surg Pathol Lok J Tse KY Lee EY 1179 1189 45 2021 34074809 10.1097/PAS.0000000000001746 4 Frozen section analysis in head and neck surgical pathology: a narrative review of the past, present, and future of intraoperative pathologic consultation Oral Oncol Urken ML Yun J Saturno MP Greenberg LA Chai RL Sharif K Brandwein-Weber M 106445 143 2023 37285683 10.1016/j.oraloncology.2023.106445 5 Preoperative detection of occult endometrial malignancies in endometrial hyperplasia to improve primary surgical therapy: a scoping review of the literature Int J Gynaecol Obstet Laban M El-Swaify ST Ali SH Refaat MA Sabbour M Farrag N 21 42 159 2022 35152421 10.1002/ijgo.14139 6 Strengths and limitations of diagnostic tools for endometriosis and relevance in diagnostic test accuracy research Ultrasound Obstet Gynecol Pascoal E Wessels JM Aas-Eng MK 309 327 60 2022 35229963 10.1002/uog.24892 7 Evaluation of frozen section biopsy for fast track diagnosis of endometrial pathology in high-risk women with abnormal uterine bleeding Eur J Obstet Gynecol Reprod Biol Kashyap A Rajaram S Gupta B Arora VK Upreti L Jain S 97 102 264 2021 34298451 10.1016/j.ejogrb.2021.07.010 8 Atypical endometrial hyperplasia and concurrent cancer: a comprehensive overview on a challenging clinical condition Cancers (Basel) Giannella L Grelloni C Bernardi M 914 16 2024 38473276 10.3390/cancers16050914 PMC10930610 9 The PRISMA 2020 statement: an updated guideline for reporting systematic reviews BMJ Page MJ McKenzie JE Bossuyt PM 0 372 2021 10.1186/s13643-021-01626-4 PMC8008539 33781348 10 QUADAS-2: a revised tool for the quality assessment of diagnostic accuracy studies Ann Intern Med Whiting PF Rutjes AW Westwood ME 529 536 155 2011 22007046 10.7326/0003-4819-155-8-201110180-00009 11 Comparison of intraoperative frozen section consultation and hysterectomy characteristics in patients diagnosed with EIN in endometrial biopsies Pathol Oncol Res Ege HV Temiz BE Usubutun A 1612039 31 2025 40538775 10.3389/pore.2025.1612039 PMC12176673 12 Accuracy of intra-operative frozen section in guiding surgical staging of endometrial cancer Arch Gynecol Obstet Doğan Durdağ G Alemdaroğlu S Aka Bolat F Yılmaz Baran Ş Yüksel Şimşek S Çelik H 725 732 304 2021 33608802 10.1007/s00404-021-05979-y 13 Accuracy of intraoperative frozen section in surgical staging of endometrial cancer Heliyon Gokulu SG Ilhan TT Ulger G Yildizbakan A Cevikoglu-Killi M Turkmen A 0 10 2024 10.1016/j.heliyon.2024.e39027 PMC11492584 39435072 14 Diagnostic accuracy of intraoperative frozen section in endometrial cancer: Correlation with final histopathology Curr Probl Cancer Limbachiya D Heda A Gowda M 101207 57 2025 40315597 10.1016/j.currproblcancer.2025.101207 15 Does preoperative diagnosis of endometrial hyperplasia necessitate intraoperative frozen section consultation? Balkan Med J Boyraz G Başaran D Salman MC Özgül N Yüce K 657 661 33 2016 https://dergipark.org.tr/en/pub/bmj/issue/41564/502163 27994920 10.5152/balkanmedj.2016.151232 PMC5156449 16 Intraoperative pathologic consultation on hysterectomy specimens for endometrial cancer: an assessment of the accuracy of frozen sections,“gross-only” evaluations, and obtaining random sections of a grossly “normal” endometrium Am J Clin Pathol Desouki MM Li Z Hameed O Fadare O 345 353 148 2017 28967955 10.1093/ajcp/aqx076 17 Evaluation of myometrial invasion in endometrial cancer: comparison of diffusion-weighted magnetic resonance and intraoperative frozen sections Abdom Imaging Gallego JC Porta A Pardo MC Fernández C 1021 1026 39 2014 24699937 10.1007/s00261-014-0134-9 18 A novel preoperative scoring system for predicting endometrial cancer in patients with complex atypical endometrial hyperplasia and accuracy of frozen section pathological examination in this context: a multicenter study Gynecol Obstet Invest Gungorduk K Ozdemir A Ertas IE 50 56 79 2015 25247588 10.1159/000365086 19 The accuracy of frozen pathology at time of hysterectomy in patients with complex atypical hyperplasia on preoperative biopsy Am J Obstet Gynecol Indermaur MD Shoup B Tebes S Lancaster JM 0 2 196 2007 10.1016/j.ajog.2006.10.886 17466676 20 Detection and correlation of pre-operative, frozen section, and final pathology in high-risk endometrial cancer Eur J Gynaecol Oncol Kanis MJ Rahaman J Moshier EL Zakashansky K Chuang L Kolev V 338 341 37 2016 https://pubmed.ncbi.nlm.nih.gov/27352560/ 27352560 21 Accuracy of intraoperative frozen section during laparoscopic management of early endometrial cancer Eur J Gynaecol Oncol Kucera E Václav H Radovan T Otcenasek M Drahonovský J Feyereisl J 408 411 30 2009 https://article.imrpress.com/journal/EJGO/30/4/pii/2009099/408-411.pdf 19761132 22 Frozen section pathology at time of hysterectomy accurately predicts endometrial cancer in patients with preoperative diagnosis of atypical endometrial hyperplasia Gynecol Oncol Morotti M Menada MV Moioli M 536 540 125 2012 22361087 10.1016/j.ygyno.2012.02.011 23 Utility of frozen section pathology with endometrial pre-malignant lesions Asian Pac J Cancer Prev Oz M Ozgu E Korkmaz E Bayramoglu H Erkaya S Gungor T 6053 6057 15 2014 25124573 10.7314/apjcp.2014.15.15.6053 24 Intra-operative frozen section results reliably predict final pathology in endometrial cancer Gynecol Oncol Stephan JM Hansen J Samuelson M 499 505 133 2014 24699308 10.1016/j.ygyno.2014.03.569 25 Accuracy of frozen sections for intraoperative diagnosis of complex atypical endometrial hyperplasia Asian Pac J Cancer Prev Turan T Karadag B Karabuk E 1953 1956 13 2012 22901153 10.7314/apjcp.2012.13.5.1953 26 Accuracy of frozen section biopsy in the diagnosis of endometrial cancer: a systematic review and meta-analysis Cancers (Basel) Kopatsaris S Apostolopoulou A Tsakiridis I 16 2024 10.3390/cancers16061200 PMC10969579 38539534 27 Immunohistochemical staining in the distinction between primary endometrial and endocervical adenocarcinomas: another viewpoint Int J Gynecol Pathol Kamoi S AlJuboury MI Akin MR Silverberg SG 217 223 21 2002 12068166 10.1097/00004347-200207000-00003 28 Revised FIGO staging for carcinoma of the cervix Int J Gynaecol Obstet Pecorelli S Zigliani L Odicino F 107 108 105 2009 19342051 10.1016/j.ijgo.2009.02.009 29 Preoperative MRI and intraoperative frozen section diagnosis of myometrial invasion in patients with endometrial cancer Int J Gynecol Cancer Tanaka T Terai Y Ono YJ 879 883 25 2015 25950131 10.1097/IGC.0000000000000470 30 Diagnostic concordance among pathologists interpreting breast biopsy specimens JAMA Elmore JG Longton GM Carney PA 1122 1132 313 2015 25781441 10.1001/jama.2015.1405 PMC4516388 31 Management of endometrial precancers Obstet Gynecol Trimble CL Method M Leitao M 1160 1175 120 2012 23090535 10.1097/aog.0b013e31826bb121 PMC3800154 32 Assessment of DNA ploidy in the ProMisE molecular subgroups of endometrial cancer Gynecol Oncol Proctor L Pradhan M Leung S 596 602 146 2017 28647100 10.1016/j.ygyno.2017.06.020 33 Cyclin D1 silencing impairs DNA double strand break repair, sensitizes BRCA1 wildtype ovarian cancer cells to olaparib Gynecol Oncol Zhong Q Hu Z Li Q Yi T Li J Yang H 157 165 152 2019 30414739 10.1016/j.ygyno.2018.10.027 ",
  "metadata": {
    "Title of this paper": "Cyclin D1 silencing impairs DNA double strand break repair, sensitizes BRCA1 wildtype ovarian cancer cells to olaparib",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477746/"
  }
}