{
  "title": "Paper_194",
  "abstract": "pmc Int J Womens Health Int J Womens Health 1312 intjwh ijwh International Journal of Women's Health 1179-1411 Dove Press PMC12493931 PMC12493931.1 12493931 12493931 10.2147/IJWH.S543995 543995 1 Original Research Clinical Prognostic Factors for Overall Survival in Patients Undergoing Radical Radiotherapy for Cervical Cancer Hao et al Hao et al http://orcid.org/0009-0004-8085-2875 Hao Fangfang  1 * Xiao Nanfeng  1 * Wang Meng  2 * Sang Houyi  3 Luo Judong  2  3 Song Jing  4 1 Department of Obstetrics and Gynecology, Jiangnan University Wuxi Jiangsu People’s Republic of China 2 Department of Radiotherapy, Tongji Hospital, School of Medicine, Tongji University Shanghai People’s Republic of China 3 Department of Radiotherapy, The Affiliated Changzhou Second People’s Hospital of Nanjing Medical University, Nanjing Medical University Changzhou People’s Republic of China 4 Department of Obstetrics and Gynecology, Affiliated Hospital of Jiangnan University Wuxi Jiangsu People’s Republic of China Correspondence: Jing Song, Email 499599716@qq.com Judong Luo, Email judongluo@tongji.edu.cn * These authors contributed equally to this work 29 9 2025 2025 17 479209 3347 3359 31 5 2025 10 9 2025 29 09 2025 04 10 2025 04 10 2025 © 2025 Hao et al. 2025 Hao et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Objective Cervical carcinoma (CC) represents the predominant malignancy affecting the female population, with patient outcomes being a critical focus of clinical investigation. This research conducts a comprehensive evaluation of the clinical determinants influencing short-term survival rates in CC patients receiving definitive radiotherapy treatment. Methods A total of 99 cervical cancer patients who received radical radiotherapy between April 2017 and March 2022 at two medical institutions were retrospectively examined. Clinical outcomes were evaluated using the Kaplan-Meier method and the Cox proportional hazards model. Results A total of ninety - nine patients with cervical cancer who received radical radiotherapy were included in the study. The overall survival (OS) rate at 2 - year follow - up was 77.8%.COX unifactorial and multifactorial showed that the analysis of prognostic-related factors suggested that the higher the history of miscarriage and FIGO stage, the lower 2-year OS, and that the history of miscarriage and FIGO stage were independent factors affecting the short-term overall survival, and the difference of all of them was statistically significant (P < 0.05). Conclusion A history of miscarriage and the FIGO classification stage serve as independent predictors of overall survival (OS) during the initial 24-month period for cervical carcinoma patients undergoing definitive radiotherapy. This study conducted a comprehensive analysis of short-term prognostic indicators for cervical squamous cell carcinoma patients undergoing radical chemoradiotherapy. Keywords cervical cancer radical radiotherapy overall survival prognostic funding for this research There is no funding for this research. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Globally, cervical carcinoma represents a predominant malignancy in female populations, exhibiting the second most elevated fatality rate following mammary gland cancer. In terms of prevalence, it consistently maintains a position within the leading trio of cancer occurrences. Specifically, in nations undergoing developmental transitions and those in transitional phases, this neoplasm occupies the second and third positions in incidence rankings, respectively, succeeding pulmonary and breast carcinomas in frequency. 1 2 3 4 5 6 Materials and Methods Data Collection We retrospectively reviewed the medical records of 99 cases of histologically confirmed SCC of the cervix from two participating treatment centers, Jiangnan University Hospital and Changzhou Second People’s Hospital.All patients received curative radiotherapy during the five-year period from April 2017 to March 2022. The research population consisted of patients who had received a confirmed histological diagnosis of SCC. Inclusion criteria required participants to meet the FIGO 2018 classification criteria for disease staging, undergo radical radiotherapy as primary treatment without surgical intervention, and complete pelvic CT imaging examinations both pre- and post-treatment. The participant selection process is illustrated in Figure 1 Figure 1 Patients flow chart. Treatments The therapeutic protocol employed a bimodal strategy combining teletherapy (EBRT) and intracavitary radiation (BT). The pelvic region was subjected to external beam radiotherapy employing a three-dimensional conformal technique. Patients received radiation therapy at total doses varying between 45.0 and 50.4 Gy, with individual fraction sizes of 1.8 to 2.0 Gy administered in daily treatment sessions. The treatment protocol consisted of five consecutive sessions per week, with a two-day interval between treatment cycles. After external irradiation, CT image-guided intracavitary back-loaded radiotherapy was performed, 5. 0 Gy / times, 4 ~ 6 times in total, 1 ~ 2 times per week. Synchronous chemotherapy was platinum-based. Follow-Up The study cohort underwent systematic post-radiotherapy surveillance, extending from treatment completion until patient mortality or the study’s endpoint in March 2024. The observation protocol implemented a median observation period of 33 months, with monitoring intervals structured as follows: quarterly assessments during the initial two years, semi-annual evaluations between years three and five, and annual check-ups beyond the five-year mark. The primary outcome indicator for follow-up was overall survival. The duration of overall survival (OS) was calculated as the interval commencing from treatment initiation and extending to either mortality due to any factor or the last documented follow-up assessment. Statistical Analysis All statistical computations were executed through the application of SPSS (Statistical Package for the Social Sciences), version 27.0. Kaplan-Meier methodology was utilized to construct survival curves, while COX proportional hazards regression models were applied for univariate and multivariate analyses. The criterion for statistical significance was set at P < 0.05. Result This research investigation incorporated a final cohort comprising 99 participants who had received a confirmed diagnosis of SCC. In this retrospective analysis, the patient cohort demonstrated a median age of six decades, with the age distribution extending from 35 to 86 years. The inflammatory markers were computed using standard formulas: NLR (neutrophil-to-lymphocyte ratio) was derived from pre-radiotherapy hematological parameters by dividing neutrophil counts by lymphocyte counts; PLR (platelet-to-lymphocyte ratio) was calculated as platelet counts divided by lymphocyte counts; while LMR (lymphocyte-to-monocyte ratio) was established through lymphocyte counts divided by monocyte counts. For statistical analysis, stratification was performed using median values as cut-off points for age, LMR, NLR, and PLR. Table 1 Table 1 Distribution of Patient Parameters Norm Survival Group (77 cases) Death Group (22 cases) P-value Ape (years) 0.998 <60 37 11 ≥60 40 11 FIGO installments 0016 I 4 0 II 35 5 III 32 10 IV 6 7 Menstrual state 0.144 There are 10 6 Not have 67 16 Maximum tumor diameter 0.577 < 40 26 6 ≥40 51 16 Birth history 0451 There are 76 21 Not have 1 1 History of abortion 0.026 There are 30 14 Not have 47 8 SCC-Ag (ng/mL) 0.133 < 11.5 60 14 ≥11.5 17 8 HPV infection 0836 There are 31 9 Not have 46 13 Pelvic lymph node metastasis 0.073 There are 18 10 Not have 58 12 Intestinal tube reaction 0.285 (RTOG classification) 0 39 8 1 25 11 2 7 3 3 4 0 4 2 0 Urinary tract reaction 0.825 (RTOG classification) 0 37 10 1 35 11 2 2 0 3 2 1 4 1 0 Leukocyte reaction 0.767 0 58 17 1 6 3 2 9 2 3 2 0 4 2 0 Platelet reaction 0.386 0 70 20 1 6 1 2 1 0 3 0 1 4 0 0 Hemoglobin reaction 0.508 0 51 11 1 14 5 2 9 4 3 2 2 4 1 0 LMR 0.310 <3.5 38 8 NLR 0.828 <3.15 38 11 ≥3.15 39 11 PLR 0.915 <167.85 39 11 ≥167.85 38 11 Radiotherapy 0.949 There are 66 19 Not have 11 3 The two-year overall survival (OS) rate across the study cohort was 77.8%, comprising both surviving patients (n=77) and deceased cases (n=22). When stratified by disease stage, patients diagnosed with stage II and III SCC, which represent the most prevalent stages, demonstrated distinct survival outcomes, with 87.5% and 76.2% 2-year OS rates, respectively. The later the stage, the progressively lower their 2-year survival rate ( Figure 2 Table 2 Table 2 Unifactorial and Multifactorial Analyses of COX Variant Univariate Analysis Multifactorial Analysis HR (95% CI) P-value H (95% CI) P-value (a person’s) age 0.999(0.433–2.305) 0.998 FIGO installments 2.326(1.319–4.103) 0.004 2.426(1.106–5.318) 0.027 Menstrual state 1.978(0.774–5.057) 0.154 Maximum diameter of tumor 1.303(0.510–3.330) 0.580 Birth history 0.472(0.064–3.514) 0.464 History of abortion 2.577(1080–5.149) 0.033 4.073(1.316–12.607) 0.015 SCC—Ag 1.918(0.804–4.573) 0.142 HPV infection 1.093(0.467–2.558) 0.837 Pelvic lymph node metastasis 2.107(0.910–4.879) 0.082 Intestinal tube reaction 1.038(0.679–1.586) 0.864 (PTOG classification) Urinary tract reaction 1.065(0.624–1.817) 0.817 (RTOG classification) Leukocyte reaction 0.827(0.481–1.422) 0.492 (RTOG classification) Platelet reaction 1.230(0.572–2.647) 0.596 (RTOG classification) Hemoglobin reaction 1.303(0.891–1.905) 0.173 (RTOG classification) LMR 1.559(0.654–3.717) 0.316 NLR 0.912(0.395–2.104) 0.829 PLR 0.956(0.414–2.206) 0.916 Radiotherapy 0.961(0.284–3.250) 0.950 Figure 2 Kaplan-Meier analysis of stage-specific overall survival for all eligible cervical cancer patients. Later staging was associated with poorer 2-year overall survival (P<0.05). Discussion In the past 20 years, the morbidity and mortality of gynaecological malignant tumours in China have continued to rise, and have become one of the major problems threatening women’s health. Especially cervical cancer, its standardised mortality rate not only rises year by year, but also the incidence of the disease shows a younger trend. 7 2 8 Drawing upon prior research, Zang et al developed a prognostic model involving 396 individuals diagnosed with SCC who received radical radiotherapy. Their findings demonstrated that pretreatment serum SCC-Ag levels served as a significant prognostic indicator, with patients exhibiting elevated SCC-Ag concentrations prior to treatment showing substantially poorer clinical outcomes compared to those with lower SCC-Ag levels. 9 10 11 12 8 10 11 In a retrospective cohort analysis performed by Atahan’s research team, survival data were evaluated for patients with cervical malignancies treated exclusively with radiation therapy. The study findings indicated that younger individuals diagnosed with cervical carcinoma demonstrated significantly reduced survival rates compared to their older counterparts, 13 14 15 16 Extensive research has identified several predictive indicators for cervical carcinoma outcomes, encompassing pretherapeutic neoplasm dimensions, staging according to the International Federation of Gynecology and Obstetrics (FIGO) system, and metastatic spread to pelvic lymph nodes. Clinical evidence demonstrates that increased neoplasm dimensions prior to therapeutic intervention, advanced FIGO classification stages, and the presence of metastatic spread to pelvic lymph nodes are all associated with decreased overall survival rates in affected patients. 17 18 Concerning the influence of chemotherapy on cervical cancer prognosis, a prior investigation involving 183 cervical cancer patients treated with radical radiotherapy revealed that concurrent chemotherapy significantly affected survival outcomes. Specifically, patients who did not receive concurrent radiotherapy exhibited poorer overall survival (OS) rates. 13 19 20 9 21 The dimensions of neoplastic growth, status of lymphatic involvement, and FIGO staging parameters, despite being recognized as independent predictors of cervical cancer outcomes, are not consistently implemented in clinical practice owing to their inadequate diagnostic precision and patient-specific reliability. Lymphocytes serve as crucial components in the immunological defense mechanisms of the host organism. These immune cells exert suppressive effects on neoplastic cell growth and their metastatic potential through the initiation of cytotoxic cellular apoptosis and the secretion of immunoregulatory cytokines. Within the tumor microenvironment, lymphocyte populations that infiltrate malignant tissues participate in various phases of oncological development and progression. Clinical studies have demonstrated that tumor-infiltrating lymphocytes, particularly those expressing CD8 and CD4 surface markers, serve as negative prognostic biomarkers in various neoplastic diseases. Conversely, lower lymphocyte counts may result in inadequate immune response leading to poor survival in many cancers. The neutrophil-to-lymphocyte ratio (NLR) serves as an indicator of the equilibrium between inflammatory responses and immunological regulation, while simultaneously representing the dynamic interplay between tumor-promoting and tumor-suppressing conditions. A comprehensive investigation was performed by Choi et.al regarding solid tumor characteristics following radiation treatment. Analysis of clinical data indicated that higher pre-treatment neutrophil-to-lymphocyte index values showed a substantial inverse relationship with long-term survival probabilities in individuals undergoing radiation therapy for cervical malignancies. 22 23 24 25 26 27 The PLR metric serves as an indicator reflecting the equilibrium between pro-tumorigenic mechanisms and the host’s immunological defense against malignancies. Extensive research examining PLR parameters in cervical malignancy has revealed two significant findings: firstly, patients exhibiting elevated PLR levels before treatment initiation show markedly poorer OS rates compared to those with reduced PLR values; secondly, there exists a direct relationship between heightened PLR measurements and augmented cervical cancer risk. 28 29 30 23 31 32 29 Research has demonstrated a significant correlation between history of miscarriage and both cervical precancerous conditions and the progression to cervical carcinoma. Notably, individuals with a history of recurrent pregnancy loss exhibit a substantially elevated probability of developing malignant cervical neoplasms, 33 34 37 38 39 40 16 41 42 41 43 This investigation demonstrates multiple methodological advantages. Primarily, the research incorporates a comprehensive array of determinant variables in examining prognostic indicators for SCC patients undergoing radical radiotherapy, establishing a robust analytical framework. Furthermore, the study extensively builds upon existing literature through thorough citation practices while incorporating an expanded spectrum of clinical staging parameters. Several methodological limitations should be acknowledged in this research. Primarily, the analytical framework lacked both sensitivity assessment and examination of potential publication bias. Secondly because it was a retrospective design, bias could not be completely eliminated even after controlling for covariates in the model. The exclusion of a higher number of patients included in the previous period due to inadequate or invalid medical records reduces the statistical validity of the study and limits the generalization of our results to a wider population. The small sample size and relatively small number of individual cases were relatively limited for the study factors, preventing a more in-depth study of the factors involved and a relatively large error. Third, all included studies were published in English, ignoring papers published in other languages, especially Chinese and German, which resulted in selection bias. Fourthly, the cut-off values of hematologic immunological indices of the included investigations, with alternative research employing receiver operating characteristic curve-derived cut-off points. The utilization of median values for NLR, PLR, and LMR thresholds could potentially influence diagnostic accuracy parameters, particularly in terms of sensitivity and specificity. In contrast, ROC curve-based threshold determination might yield enhanced diagnostic performance, potentially impacting the overall findings of this investigation. Fifth, the research did not incorporate datasets from emerging economies across different global regions. Future prospective studies are needed, and blood immunological markers need to be further explored as more accurate biomarkers of tumor subgroups so as to select appropriate treatment populations to maximize patient benefit, as well as to more effectively confirm the association between factors and OS. Conclusion To summarize the findings of our investigation, the analysis reveals that both FIGO classification and history of miscarriage could potentially function as predictive indicators for SCC outcomes, as demonstrated through both univariate and multivariate COX regression analyses. Data Sharing Statement Research data are not shared. Ethics Approval and Consent to Participate All procedures were carried out following the ethical standards declared by the World Medical Association. We confirmed that all methods were carried out in accordance with the Declaration of Helsinki and were approved by the Affiliated Hospital of Jiangnan University Ethical Review Committee. Given the retrospective nature of the study, the requirement for informed consent was waived, and patient data were kept confidential. This study was approved by the Affiliated Hospital of Jiangnan University Ethical Review Committee (Approval Number: LS2024539). Author Contributions All authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. Disclosure The authors declare no competing interests in this work. References 1. Bray F Laversanne M Sung H Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 3 229 263 10.3322/caac.21834 38572751 2. Singh D Vignat J Lorenzoni V Global estimates of incidence and mortality of cervical cancer in 2020: a baseline analysis of the WHO global cervical cancer elimination initiative Lancet Glob Health 2023 2023 11 2 e197 e206 10.1016/S2214-109X(22)00501-0 PMC9848409 36528031 3. Bhatla N Aoki D Sharma DN Cancer of the cervix uteri Int J Gynecol Obstet 2018 143 suppl 2 22 36 10.1002/ijgo.12611 30306584 4. Xiu YT Meng FX Wang Z Prognostic factors for IB2-IIIB cervical cancer patients treated by radiation therapy with high-dose-rate brachytherapy in a single-institution study J Contemp Brachyther 2022 2022 14 4 332 340 10.5114/jcb.2022.118933 PMC9528829 36199952 5. Hong JH Tsai CS Lai CH Risk stratification of patients with advanced squamous cell carcinoma of cervix treated by radiotherapy alone Int J Radiat Oncol Biol Phys 2005 63 2 492 499 10.1016/j.ijrobp.2005.02.050 15925454 6. Hong JH Tsai CS Chang JT The prognostic significance of pre- and posttreatment SCC levels in patients with squamous cell carcinoma of the cervix treated by radiotherapy Int J Radiat Oncol Biol Phys 1998 41 4 823 830 10.1016/S0360-3016(98)00125-7 9652844 7. Jiang X Tang H Chen T Epidemiology of gynecologic cancers in China J Gynecol Oncol 2018 29 1 e7 10.3802/jgo.2018.29.e7 29185265 PMC5709533 8. Liu Z Shi H Li J Hou Q Tang B Prognostic role of squamous cell carcinoma antigen in cervical cancer: a meta-analysis Med Sci Monit 2022 28 e934588 10.12659/MSM.934588 35260545 PMC8919681 9. Zang L Chen Q Lin A A prognostic model using FIGO 2018 staging and MRI-derived tumor volume to predict long-term outcomes in patients with uterine cervical squamous cell carcinoma who received definitive radiotherapy. World J Surg Oncol 2023 21 210 10.1186/s12957-023-03093-8 PMC10360277 37475053 10. Chen W Xiu S Xie X Prognostic value of tumor measurement parameters and SCC-Ag changes in patients with locally-advanced cervical cancer Radiat Oncol 2022 17 6 10.1186/s13014-021-01972-6 35012582 PMC8751300 11. Cheng YK Kuo S-H Yen HH The prognostic significance of pretreatment squamous cell carcinoma antigen levels in cervical cancer patients treated by concurrent chemoradiation therapy and a comparison of dosimetric outcomes and clinical toxicities between tomotherapy and volumetric modulated arc therapy Radiat Oncol 2022 17 91 10.1186/s13014-022-02063-w 35549962 PMC9097430 12. Charakorn C Thadanipon K Chaijindaratana S The association between serum squamous cell carcinoma antigen and recurrence and survival of patients with cervical squamous cell carcinoma: a systematic review and meta-analysis Gynecologic Oncol 2018 150 1 190 200 10.1016/j.ygyno.2018.03.056 29606483 13. Atahan IL Onal C Ozyar E Long-term outcome and prognostic factors in patients with cervical carcinoma: a retrospective study Int J Gynecological Cancer 2007 17 5 833 842 10.1136/ijgc-00009577-200707000-00013 17367320 14. Wang J Wang T Yang -Y-Y Patient age, tumor appearance and tumor size are risk factors for early recurrence of cervical cancer Mol Clin Oncol 2015 3 2 363 366 10.3892/mco.2014.465 25798268 PMC4360871 15. Ferioli M Benini A Malizia C Classical prognostic factors predict prognosis better than inflammatory indices in locally advanced cervical cancer: results of a comprehensive observational study including tumor-, patient-, and treatment-related data (ESTHER Study) J. Pers. Med 2023 13 9 1229 10.3390/jpm13081229 37623479 PMC10456032 16. Li J Liu G Luo J Cervical cancer prognosis and related risk factors for patients with cervical cancer: a long-term retrospective cohort study Sci Rep 2022 12 13994 10.1038/s41598-022-17733-8 35978078 PMC9385852 17. G RP Java J W WC Nomograms predicting progression-free survival, overall survival, and pelvic recurrence in locally advanced cervical cancer developed from an analysis of identifiable prognostic factors in patients from NRG oncology/gynecologic oncology group randomized trials of chemoradiotherapy J Clin Oncol 2015 33 19 2136 2142 10.1200/JCO.2014.57.7122 25732170 PMC4477785 18. Wang X Xu J Zhang H The effect of albumin and hemoglobin levels on the prognosis of early-stage cervical cancer: a prospective, single-center-based cohort study BMC Women’s Health 2023 23 553 10.1186/s12905-023-02713-5 37875880 PMC10598933 19. Luvero D Plotti F Aloisi A Patients treated with neoadjuvant chemotherapy + radical surgery + adjuvant chemotherapy in locally advanced cervical cancer: long-term outcomes, survival and prognostic factors in a single-center 10-year follow-Up Med Oncol 2016 33 1 110 10.1007/s12032-016-0830-0 27577931 20. Wang W Hou X Yan J Outcome and toxicity of radical radiotherapy or concurrent Chemoradiotherapy for elderly cervical cancer women BMC Cancer 2017 17 510 10.1186/s12885-017-3503-2 28764676 PMC5540340 21. Yu J Huang L Dong T Prediction of outcomes after chemoradiotherapy for cervical cancer by neutrophil-to-lymphocyte ratio and platelet-to-lymphocyte ratio J Obstetrics Gynaecol 2024 44 1 236185 10.1080/01443615.2024.2361858 38864403 22. Choi N Kim JH Chie EK A meta-analysis of the impact of neutrophil-to-lymphocyte ratio on treatment outcomes after radiotherapy for solid tumors Medicine 2019 98 18 e15599 10.1097/MD.0000000000015599 31045780 PMC6504242 23. Onal C Guler OC Yildirim BA Prognostic use of pretreatment hematologic parameters in patients receiving definitive chemoradiotherapy for cervical cancer Int J Gynecological Cancer 2016 00 00 1 7 10.1097/IGC.0000000000000741 27206286 24. Jin L Cao F Zhang Y Nomograms for predicting prognostic value of combined neutrophil-to-lymphocyte ratio and SCC-Ag in locally advanced cervical cancer Transl Cancer Res 2024 13 3 1323 1335 10.21037/tcr-23-1501 38617514 PMC11009798 25. Wu J Chen M Liang C Prognostic value of the pretreatment neutrophil-to-lymphocyte ratio in cervical cancer: a meta-analysis and systematic review Oncotarget 2017 8 8 13400 13412 10.18632/oncotarget.14541 28077792 PMC5355107 26. Huang QT Man QQ Hu J Prognostic significance of neutrophil-to-lymphocyte ratio in cervical cancer: a systematic review and meta-analysis of observational studies Oncotarget 2017 8 10 16755 16764 10.18632/oncotarget.15157 28187430 PMC5369999 27. Zou PJ Yang E Li ZY Neutrophil-to-lymphocyte ratio is an independent predictor for survival outcomes in cervical cancer: a systematic review and meta-analysis Sci Rep 2020 10 21917 10.1038/s41598-020-79071-x 33318608 PMC7736351 28. Ma JY Ke LC Liu Q The pretreatment platelet-to-lymphocyte ratio predicts clinical outcomes in patients with cervical cancer Medicine 2018 97 43 e12665 10.1097/MD.0000000000012897 30412089 PMC6221620 29. Han XP Liu SY Yang G Prognostic value of systemic hemato-immunological indices in uterine cervical cancer: a systemic review, meta-analysis, and meta-regression of observational studies Gynecologic Oncol 2021 160 1 351 360 10.1016/j.ygyno.2020.10.011 33092868 30. Gao ZR Zhao ML Yang XJ Assessment of peripheral platelet to lymphocyte ratio and prognostic nutritional index in the efficacy and prognosis of radiotherapy for cervical cancer Current Oncol 2023 30 2834 2844 10.3390/curroncol30030216 PMC10047427 36975429 31. Lee JW Seol KH Pretreatment neutrophil-to-lymphocyte ratio combined with platelet-to-lymphocyte ratio as a predictor of survival outcomes after definitive concurrent chemoradiotherapy for cervical cancer J Clin Med 2021 10 7 2199 10.3390/jcm10102199 34069592 PMC8160639 32. Mao Y Chen D Duan SZ Prognostic impact of pretreatment lymphocyte-to-monocyte ratio in advanced epithelial cancers: a meta-analysis Can Cell Inter 2018 18 201 10.1186/s12935-018-0698-5 PMC6282251 30534002 33. Duan W Li H Hu H Study on the relationship between the number of artificial abortion and the high risk human papillomavirus infection and cervical cancer Practical J Cancer 2018 33 8 1364 1367 34. Salari S Raesi R Daneshi S Prevalence of cervical cancer and premalignant cases based on pap smear screening in Iran in 2022 Curr Cancer Ther Rev 2024 20 1 11 35. Mikkelsen AP Egerup PE Ebert JFM Pregnancy loss and cancer risk: a nationwide observational study EClinicalMedicine 2019 10 80 88 10.1016/j.eclinm.2019.08.017 PMC6833468 31709417 36. Weldegebreal F Worku T Precancerous cervical lesion among HIV-positive women in sub-saharan africa: a systematic review and meta-analysis Cancer Control 2019 26 1 1 11 10.1177/1073274819845872 PMC6572896 31043067 37. Sharmaa P Pattanshetty SM A study on risk factors of cervical cancer among patients attending a tertiary care hospital: a case-control study Clin Epidemiol Global Health 2018 6 2 83 87 38. Karolewski K Korzeniowski S Sokołowski A Prognostic significance of pretherapeutic and therapeutic factors in patients with advanced cancer of the uterine cervix treated with radical radiotherapy alone Acta Oncologica 1999 38 4 461 468 10418713 10.1080/028418699431997 39. Charach R Sheiner E Beharier O Recurrent pregnancy loss and future risk of female malignancies Arch Gynecol Obstetrics 2018 298 4 781 787 10.1007/s00404-018-4868-4 30116931 40. Aguade AE Gashu C Jegnaw T The trend of change in cervical tumor size and time to death of hospitalized patients in Northwestern Ethiopia during 2018–2022: retrospective Study Design Health Sci Rep 2023 6 e1121 36814966 10.1002/hsr2.1121 PMC9939582 41. Li J Luo JY Liu GM Influencing factors and risk prediction model for cervical cancer recurrence. Zhong nan da xue xue bao yi xue ban J Central South Univ Med Sci 2022 47 12 1711 1720 10.11817/j.issn.1672-7347.2022.210722 PMC10930263 36748382 42. Gari SF Biru TF Gurmu SE Application of the joint frailty copula model for analyzing time to relapse and time to death of women with cervical cancer Int J Women’s Health 2023 15 1295 1304 37576182 10.2147/IJWH.S414946 PMC10423001 43. Kusakabe M Taguchi A Sone K Mori M Osuga Y Carcinogenesis and management of human papillomavirus-associated cervical cancer Int. J. Clin. Oncol 2023 28 8 965 974 37294390 10.1007/s10147-023-02337-7 PMC10390372 ",
  "metadata": {
    "Title of this paper": "Carcinogenesis and management of human papillomavirus-associated cervical cancer",
    "Journal it was published in:": "International Journal of Women's Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12493931/"
  }
}