{
  "title": "Paper_331",
  "abstract": "pmc JAMA Netw Open JAMA Netw Open 3211 jamasd JAMA Network Open 2574-3805 pmc-is-collection-domain yes pmc-collection-title JAMA Network PMC12485642 PMC12485642.1 12485642 12485642 41026491 10.1001/jamanetworkopen.2025.34612 zoi250967 1 Research Original Investigation Online Only Environmental Health AI-Enhanced Analysis of Built Environment Imagery and Neighborhood Obesity in US Cities AI-Enhanced Analysis of Built Environment Imagery and Neighborhood Obesity AI-Enhanced Analysis of Built Environment Imagery and Neighborhood Obesity Chen Zhuo PhD  1 Zhang Tong MS  1 Dazard Jean-Eudes PhD  1 Ponnana Sai Raul MS  1 Dong Weichuan PhD  1  3 Moorthy Skanda MPH  1 Sirasapalli Santosh Kumar MS  2 Khraishah Haitham MD  2 Deo Salil MD  1 Rajagopalan Sanjay MD  1  2 Al-Kindi Sadeer MD  3 1 2 3 Article Information Accepted for Publication: Published: 10.1001/jamanetworkopen.2025.34612 Open Access: CC-BY License JAMA Network Open Corresponding Authors: sanjay.rajagopalan@uhhospitals.org sal-kindi@houstonmethodist.org Author Contributions: Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Statistical analysis: Obtained funding: Administrative, technical, or material support: Supervision: Conflict of Interest Disclosures: Funding/Support: Role of the Funder/Sponsor: Data Sharing Statement: Supplement 2 30 9 2025 9 2025 8 9 498065 e2534612 8 5 2025 24 7 2025 30 09 2025 02 10 2025 03 10 2025 Copyright 2025 Chen Z et al. JAMA Network Open https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the CC-BY License. jamanetwopen-e2534612.pdf This cross-sectional study investigates the association of artificial intelligence (AI)–enhanced analysis of geospatial built environment images with estimates of neighborhood obesity prevalence. Key Points Question Is artificial intelligence–enhanced geospatial image analysis of built environment features associated with improved estimates of neighborhood obesity prevalence in US cities beyond traditional factors? Findings This cross-sectional study of 14 413 census tracts within 100 US cities found that integrating geospatial image features from more than 94 000 satellite and more than 670 000 street view images with traditional factors in a linear mixed-effects model was associated with improved obesity prevalence variance explanation. Meaning In this study, artificial intelligence–driven geospatial image analysis was associated with enhanced obesity prevalence estimation, which may inform targeted public health and urban planning interventions. Importance Obesity prevalence is a significant public health issue, particularly in urban areas. While social factors are known risks, using artificial intelligence (AI) to scalably assess the association of the built environment with obesity prevalence is an emerging area critical for targeted interventions. Objective To investigate whether AI analysis of satellite and street view imagery is associated with improved estimates of neighborhood obesity prevalence beyond conventional demographic and socioeconomic (DSE) and social determinants of health (SDOH) factors. Design, Setting, and Participants This cross-sectional study used an AI-enhanced modeling framework. Data from the 2023 Centers for Disease Control and Prevention (CDC) PLACES dataset and 2019 American Community Survey were linked to geospatial imagery retrieved between May and July 2024 for US Census tracts within 94 of the 100 most populous US cities (6 were excluded due to missing obesity data). The unit of analysis was the census tract. Data included more than 94 000 Google satellite images and 670 000 Street View images, which, along with obesity prevalence, DSE, and SDOH factors, were all linked at the census tract level. The analysis was conducted from September 2024 to May 2025. Exposures Built environment features were extracted from satellite and street view imagery using convolutional neural networks. Main Outcomes and Measures Crude obesity prevalence at the census tract level (adults aged ≥18 years with body mass index ≥30.0) was obtained from the 2023 CDC PLACES dataset. Results The study included 14 413 census tracts (median [IQR] resident age, 35 [32-40] years; median [IQR], 51.1% [48.7%-53.8%] female) with a median (IQR) obesity prevalence of 32.4% (26.6%-38.8%). At the census tract level, the median (IQR) population was 3861 (2701-5210) residents, with a median (IQR) annual household income of $56 042 ($38 494-$80 859). The study processed 94 498 satellite and 670 860 street view images. A linear mixed-effects model including DSE, SDOH, satellite images, and street view imagery features explained 92.6% of the variance in obesity prevalence (conditional R 2 R 2 2 P Conclusions and Relevance In this study, integrating AI-derived built environment features from geospatial imagery was associated with enhanced ability to explain and estimate neighborhood-level obesity prevalence beyond conventional DSE and SDOH factors. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction The escalating prevalence of obesity constitutes a significant and growing public health challenge globally and within the US. 1 2 3 4 5 5 6 While conventional risk factors, such as healthy nutrition, energy metabolism, and lack of physical activity, are undoubtedly significant, a substantial body of evidence now recognizes the critical role of the built environment in shaping obesity prevalence. 7 8 9 10 11 12 10 11 13 14 7 15 16 17 Traditional assessments of the built environment often rely on surveys or secondary data, which can lack detail and consistency. 11 18 15 19 20 21 22 23 24 25 Inspired by the success of deep learning in analyzing satellite and street view images for tasks like economic prediction 26 27 28 19 20 29 30 31 21 32 33 Methods This cross-sectional study focused on census tracts within the 100 most populous US cities, excluding 6 cities in Florida due to missing obesity prevalence data in the 2023 Centers for Disease Control and Prevention (CDC) PLACES dataset (eFigure 1 in Supplement 1 34 Figure 1 STROBE Figure 1. Study Framework Census tract–level satellite and street view images were processed using pretrained deep learning models (ResNet-50) to extract feature vectors, which were aggregated for each census tract. Feature importance and explainability were assessed using Shapley additive explanations (SHAP) values and gradient-weighted class activation mapping (grad-CAM) visualizations. A sparse partial least squares (sPLS) model was applied for dimension reduction, integrating social determinants of health (SDOH) before modeling obesity prevalence using linear mixed-effects regression. The final model evaluated the combined association of built environment features and SDOH with obesity prevalence across US cities. AI indicates artificial intelligence. Data Sources Data for this study were obtained from the 2023 CDC PLACES dataset at the census tract level. This dataset provides model-based estimates derived from the Behavioral Risk Factor Surveillance System (BRFSS), US Census Bureau, and American Community Survey (ACS). Specifically, the 2023 PLACES release uses BRFSS data from 2021 for 29 measures and 2020 for 7 measures collected biennially (all teeth lost, dental visits, mammograms, cervical cancer screening, colorectal cancer screening, core preventive services among older adults, and sleeping <7 hours), alongside Census Bureau 2010 population data and ACS 2015 to 2019 estimates. 34 Outcome Variable The primary outcome was crude obesity prevalence at the census tract level, defined as the proportion of adults aged 18 years or older with a body mass index (calculated as weight in kilograms divided by height in meters squared) of 30.0 or greater. These estimates are generated by the CDC PLACES project using a multilevel regression and poststratification approach applied to BRFSS and ACS data 35 36 Built Environment Feature Extraction and Preprocessing Our primary exposures were built environment features extracted from Google satellite images (hereafter, satellite images street view Supplement 1 Covariates We included a set of DSE and other SDOH covariates at the census tract level. DSE variables included 2019 ACS DSE factors, such as proportion male, proportion Black, median age, proportion Hispanic, proportion with education less than high school, and median household income. Race and ethnicity data were obtained from the ACS. Analyses were limited to Black and White populations for race and Hispanic populations for ethnicity because these groups represented the largest racial and ethnic populations across US census tracts and provided sufficient sample sizes for stable estimation. Other groups (American Indian or Alaska Native, Asian, Native Hawaiian or Other Pacific Islander, some other race, and 2 or more races) were not analyzed separately owing to small population sizes within census tracts, which limited statistical power and precluded reliable group-specific associations. We also incorporated established SDOH indices, including the social vulnerability index (SVI), 37 38 39 Statistical Analysis The dataset, stratified by city, was randomly divided into training (70%) and testing (30%) sets. A multistep modeling approach was implemented to evaluate associations of SI and SV features with obesity prevalence and the incremental contribution of SI and SV features to obesity prevalence beyond conventional risk factors, specifically DSE factors and SDOH indices. We first applied sparse partial least squares (SPLS) regression 40 K Supplement 1 41 Next, we fitted a series of nested models and compared their performance and complexity. These models included variations using SI features only (model 1), SV features only (model 2), combined SI and SV features (model 3), DSE covariates only (model 4), DSE with SI and SV (model 5), SDOH covariates only (model 6), SDOH with SI and SV (model 7), DSE with SDOH (model 8), and DSE with SDOH and SI and SV (model 9). Model comparison was based on goodness of fit metrics, including Akaike information criterion (AIC), bayesian information criterion (BIC), and likelihood ratio tests (LRTs). Model performance was also assessed using marginal and conditional R 2 42 R 2 R 2 R 2 To enhance model interpretability, we first trained an XGBoost software version 2.0.3 (XGBoost Contributors) model to assess the contribution of SI and SV features to obesity prevalence (eMethods in Supplement 1 43 44 Supplement 1 We processed images and implemented grad-CAM using Python software version 3.10.13 (Python Software Foundation) with PyTorch and fastai libraries. The machine learning modeling used the XGBoost library. LMEM and SPLS regression were performed in R statistical software version 4.4.2 (R Project for Statistical Computing) using lme4 and spls packages, respectively. Statistical significance of fixed effects in LMEM was assessed using Wald t P Results Descriptive Statistics of Demographic and Socioeconomic Characteristics We analyzed 14 413 census tracts (median [IQR (range)] resident age, 35 [32-40 (6-76)] years; median [IQR] 51.1% [48.7%-53.8%] female and 48.9% [46.2%-51.3%] male; median [IQR], 9.5% [3.2%-33.7%] Black and 60.2% [31.6%-38.1%] White; median [IQR], 15.8% [6.2%-40.6%] Hispanic) across 94 US cities, from which we processed 94 498 SI and 670 860 SV images. Obesity prevalence varied widely across census tracts (eFigure 3 in Supplement 1 Supplement 1 SPLS Regression Analysis of SI and SV Components To evaluate the incremental benefits associated with SI and SV features beyond conventional risk factors in estimating obesity prevalence, we applied SPLS regression for dimension reduction and variable selection. Using cross-validation to optimize hyperparameters, we determined the optimal sparsity parameter (η) and number of components ( K K Supplement 1 K Supplement 1 Linear Mixed-Effects Model Results Results of the LMEM analysis are summarized in the Table Table. Comparison of LMEMs With City as Random Effect for Obesity Prevalence LMEM model AIC BIC  R 2 Log likelihood Deviance Test χ 2 P Marginal Conditional SI 23 961 24 432 0.304 0.595 −11 906 23 813 NA NA NA SV 23 099 23 735 0.413 0.663 −11 449 22 899 SI vs SV 914.05 <.001 SI + SV 22 650 23 737 0.525 0.717 −11 154 22 308 SV vs SI + SV 591.12 <.001 DSE 18 338 18 395 0.572 0.901 −9160 18 320 DSE + SI + SV 17472 18 604 0.711 0.917 −8558 17 116 DSE vs DSE + SI + SV 1204 <.001 SDOH 21 173 21 212 0.552 0.775 −10 580.7 21 161 SDOH + SI + SV 20 122 21 229 0.725 0.844 −9887.1 19 774 SDOH vs SDOH + SI + SV 1387.3 <.001 DSE + SDOH 17 949 18 025 0.632 0.905 −8962.5 17 925 NA NA NA DSE + SDOH + SI + SV 16 984 18 135 0.745 0.926 −8310.8 16 622 DSE + SDOH vs DSE + SDOH + SI + SV 1303.4 <.001 Abbreviations: AIC, Akaike information criterion; BIC, bayesian information; DSE, demographic and socioeconomic factors (male sex, Black race, median age, Hispanic ethnicity, education level <high school, and median income); LMEM, linear mixed-effects model; NA, not applicable; SDOH, social determinants of health (social vulnerability index, socioeconomic disadvantage index, and area deprivation index); SI, satellite imagery–derived environmental features; SV, street view–derived environmental features. The SI-only model had a marginal R 2 R 2 R 2 R 2 2 P Models that included traditional risk factors outperformed those relying solely on geospatial imaging features. The DSE-only model achieved a marginal R 2 R 2 2 P R 2 R 2 R 2 R 2 R 2 2 P The DSE plus SDOH model alone achieved a high marginal R 2 R 2 R 2 Supplement 1 2 P Supplement 1 Figure 2 Figure 2. Estimation Error Maps for Top 6 US Cities Blue areas indicate underestimation, and red areas indicate overestimation by the model. Spatially clustered errors greater than approximately 10% may signal the presence of unique local health determinants (eg, targeted interventions or specific cultural dietary patterns) not captured by the model, flagging these communities for more focused, qualitative public health investigation. We performed 2 sensitivity analyses to confirm the robustness of our findings. First, when rerunning the models using older 2021 CDC PLACES data, the addition of geospatial features was still associated with improvement in estimating power (eTable 2 in Supplement 1 Supplement 1 Supplement 1 Visualization of Important Features With Grad-CAM As expected, several key features were consistently identified by feature importance (total gain) and SHAP values. Notably, SV 2680, SV 1027, SV 3552, and SV 3339 emerged as important SV-derived features ( Figure 3 Figure 4 Supplement 1 Supplement 1 Figure 3. Importance and Interpretability of Street View (SV) Images in Association With Obesity Prevalence The figure deconstructs the artificial intelligence model to reveal which specific, built environment features from SV images were most important for estimating obesity. A, Feature importance of SV-derived features is based on the total gain in an XGBoost model. B, Shapley additive explanations (SHAP) values of SV features are ranked by importance. Positive SHAP values with low feature values (blue) indicate a negative association with obesity prevalence, while positive SHAP values with high feature values (red) indicate a positive association. Features highlighted in red boxes were consistently ranked among the most important by both methods. Figure 4. Visualizations of Key Street View (SV) Features This figure displays gradient-weighted class activation mapping heat maps for the top-ranked street view features, identified by feature importance and Shapley additive explanations values. Each pair shows the original image (left) and a heat map (right) highlighting regions most influential in feature extraction by the convolutional neural network. These regions predominantly capture built environment elements like trees (SV 2680), grass (SV 3339), fences (SV 1027), and utility poles (SV 3552). Discussion This cross-sectional study found that AI-analyzed geospatial imagery (SI and SV) provided significant explanatory power for census tract–level heterogeneity in US obesity prevalence, associated with substantial improvement in the performance of models that used traditional risk factors. Machine learning and mixed-effects models showed improved performance when SI and SV features were integrated, and further notable enhancement occurred when these were combined with conventional DES and SDOH risk factors. This highlights the incremental benefit associated with geospatial data, demonstrating the potential for integrated approaches in creating robust population health strategies that consider spatial environments associated with obesity risk. A novel contribution of our study is the integration of advanced deep learning techniques analyzing multimodal geospatial imagery (SI and SV imagery) with traditional DSE and SDOH variables within a hierarchical mixed-effects modeling framework. This approach advances the field by capturing macro- and micro-level environmental details. Unlike many previous studies that used single imaging modalities, manual feature extraction, or regression models that do not account for geographic clustering, 32 33 The superior performance of SV features likely stems from their ability to capture high-resolution, street-level details that are more closely aligned with daily human experiences of the built microenvironment. These images reveal nuanced factors, such as street trees, pedestrian infrastructure, storefronts, and other microscale elements that may be associated with physical activity and, consequently, obesity risk. 15 K K A key strength of the integrated model was the substantial improvement in LMEM fit when geospatial imaging features were incorporated with traditional DSE and SDOH factors. The marginal R 2 R 2 The geographic variation in model performance is also informative. For instance, areas with consistent underestimation of obesity could suggest the presence of unmeasured risk factors, like food environment, 45 46 Earlier studies have shown that predefined features, such as walkability, green space, and access to recreational facilities, are associated with lower obesity prevalence and improved physical activity levels. 16 47 48 49 50 51 52 53 Our findings have significant implications for public health and urban planning. The enhanced performance associated with integrating geospatial imaging with traditional data underscores the crucial role of built environment factors, particularly street-level details. This suggests that policies promoting urban designs favoring walkability, green spaces, and active transportation are vital for potential reductions in obesity prevalence. For example, improved pedestrian infrastructure and mixed land-use planning are associated with better health outcomes. 54 55 Limitations These findings should be interpreted within the context of study limitations. Although a sensitivity analysis confirmed our findings’ robustness, the temporal mismatch between the primary imaging and outcome data constitute a limitation that may have introduced misclassification bias. Additionally, the reliance on self-reported data for certain variables, along with varying frequencies in image updates, could introduce biases that may influence overall findings. The generalizability of our results is also somewhat constrained by the specific selection of cities and census tracts included in the study, which may not fully represent other geographic regions or urban contexts. Furthermore, model-based estimates derived from sources, such as the BRFSS and ACS, that inherently carry limitations that could affect the precision of our obesity prevalence measures. Our analysis does not account for the recent, increasing use of glucagon-like peptide-1 receptor agonist medications for weight management, but this use may have started to influence neighborhood obesity rates. Moreover, the interpretation of the deep learning features relied on a qualitative visual assessment, which awaits a more systematic, multirater validation. Additionally, our approach may need to be tested in rural environments, which have substantially different geospatial features. Conclusions In this cross-sectional study, we demonstrated that integrating deep learning–derived geospatial features from SI and SV imagery was associated with improved estimation of neighborhood obesity prevalence, especially when combined with traditional DSE and SDOH factors. This multimodal approach offered a more comprehensive understanding of built environment associations, highlighting the potential of geospatial imagery to inform targeted public health interventions and urban planning strategies. References 1 Ng M Gakidou E Lo J GBD 2021 Adult BMI Collaborators Global, regional, and national prevalence of adult overweight and obesity, 1990-2021, with forecasts to 2050: a forecasting study for the Global Burden of Disease Study 2021 Lancet 2025 405 10481 813 838 10.1016/S0140-6736(25)00355-1 40049186 PMC11920007 2 Kerr JA Patton GC Cini KI GBD 2021 Adolescent BMI Collaborators Global, regional, and national prevalence of child and adolescent overweight and obesity, 1990-2021, with forecasts to 2050: a forecasting study for the Global Burden of Disease Study 2021 Lancet 2025 405 10481 785 812 10.1016/S0140-6736(25)00397-6 40049185 PMC11920006 3 Mokdad AH Bisignano C Hsu JM GBD 2021 US Burden of Disease and Forecasting Collaborators Burden of disease scenarios by state in the USA, 2022-50: a forecasting analysis for the Global Burden of Disease Study 2021 Lancet 2024 404 10469 2341 2370 10.1016/S0140-6736(24)02246-3 39645377 PMC11715278 4 Hales CM Carroll MD Fryar CD Ogden CL Prevalence of obesity and severe obesity among adults: United States, 2017-2018 2020 https://www.cdc.gov/nchs/data/databriefs/db360-h.pdf 5 Ng M Dai X Cogen RM GBD 2021 US Obesity Forecasting Collaborators National-level and state-level prevalence of overweight and obesity among children, adolescents, and adults in the USA, 1990-2021, and forecasts up to 2050 Lancet 2024 404 10469 2278 2298 10.1016/S0140-6736(24)01548-4 39551059 PMC11694015 6 Centers for Disease Control and Prevention 2024 https://www.cdc.gov/obesity/php/about/index.html 7 Gordon-Larsen P Nelson MC Page P Popkin BM Inequality in the built environment underlies key health disparities in physical activity and obesity Pediatrics 2006 117 2 417 424 10.1542/peds.2005-0058 16452361 8 Papas MA Alberg AJ Ewing R Helzlsouer KJ Gary TL Klassen AC The built environment and obesity Epidemiol Rev 2007 29 1 129 143 10.1093/epirev/mxm009 17533172 9 Sallis JF Floyd MF Rodríguez DA Saelens BE Role of built environments in physical activity, obesity, and cardiovascular disease Circulation 2012 125 5 729 737 10.1161/CIRCULATIONAHA.110.969022 22311885 PMC3315587 10 Rajagopalan S Ramaswami A Bhatnagar A American Heart Association Council on Hypertension; Council on Lifestyle and Cardiometabolic Health; Council on Peripheral Vascular Disease; Council on Lifelong Congenital Heart Disease and Heart Health in the Young; Council on Cardiovascular Surgery and Anesthesia; and the American Heart Association Advocacy Coordinating Committee Toward heart-healthy and sustainable cities: a policy statement from the American Heart Association Circulation 2024 149 15 e1067 e1089 10.1161/CIR.0000000000001217 38436070 PMC12160618 11 Rajagopalan S Vergara-Martel A Zhong J The urban environment and cardiometabolic health Circulation 2024 149 16 1298 1314 10.1161/CIRCULATIONAHA.123.067461 38620080 PMC11093754 12 Zhang K Brook RD Li Y Rajagopalan S Kim JB Air pollution, built environment, and early cardiovascular disease Circ Res 2023 132 12 1707 1724 10.1161/CIRCRESAHA.123.322002 37289906 PMC10254077 13 Huang X Lu G Yin J Tan W Non-linear associations between the built environment and the physical activity of children Transp Res Part D Transp Environ 2021 98 102968 10.1016/j.trd.2021.102968 14 Lachowycz K Jones AP Greenspace and obesity: a systematic review of the evidence Obes Rev 2011 12 5 e183 e189 10.1111/j.1467-789X.2010.00827.x 21348919 15 Chen Z Salerno PRVO Dazard JE Deep learning analysis of Google Street View to assess residential built environment and cardiovascular risk in a U.S. Midwestern retrospective cohort Eur J Prev Cardiol 2025 zwaf038 10.1093/eurjpc/zwaf038 39903569 PMC12319116 16 Luo YN Huang WZ Liu XX Greenspace with overweight and obesity: a systematic review and meta-analysis of epidemiological studies up to 2020 Obes Rev 2020 21 11 e13078 10.1111/obr.13078 32677149 17 Bejarano CM Carlson JA Cushing CC Neighborhood built environment associations with adolescents’ location-specific sedentary and screen time Health Place 2019 56 147 154 10.1016/j.healthplace.2019.01.015 30743089 PMC6477917 18 Stewart OT Carlos HA Lee C Secondary GIS built environment data for health research: guidance for data development J Transp Health 2016 3 4 529 539 10.1016/j.jth.2015.12.003 28459001 PMC5404746 19 Chen Z Dazard JE Khalifa Y Deep learning-based assessment of built environment from satellite images and cardiometabolic disease prevalence JAMA Cardiol 2024 9 6 556 564 10.1001/jamacardio.2024.0749 38691380 PMC11063925 20 Chen Z Vieira de Oliveira Salerno PR Dazard JE AI-facilitated assessment of built environment using neighborhood satellite imagery and cardiovascular risk J Am Coll Cardiol 2024 84 18 1733 1744 10.1016/j.jacc.2024.08.053 39443017 PMC12093321 21 Phan L Yu W Keralis JM Google Street View derived built environment indicators and associations with state-level obesity, physical activity, and chronic disease mortality in the United States Int J Environ Res Public Health 2020 17 10 3659 10.3390/ijerph17103659 32456114 PMC7277659 22 Albert A Kaur J Gonzalez MC Using convolutional networks and satellite imagery to identify patterns in urban environments at a large scale Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining—KDD ’17 ACM Press 2017 1357 1366 23 Yuan Q Shen H Li T Deep learning in environmental remote sensing: achievements and challenges Remote Sens Environ 2020 241 111716 10.1016/j.rse.2020.111716 24 LeCun Y Bengio Y Hinton G Deep learning Nature 2015 521 7553 436 444 10.1038/nature14539 26017442 25 Voulodimos A Doulamis N Doulamis A Protopapadakis E Deep learning for computer vision: a brief review Comput Intell Neurosci 2018 2018 7068349 10.1155/2018/7068349 29487619 PMC5816885 26 Jean N Burke M Xie M Alampay Davis WM Lobell DB Ermon S Combining satellite imagery and machine learning to predict poverty Science 2016 353 6301 790 794 10.1126/science.aaf7894 27540167 27 Abitbol JL Karsai M Socioeconomic correlations of urban patterns inferred from aerial images: interpreting activation maps of convolutional neural networks. arXiv 2020 10.48550/arXiv.2004.04907 28 Suel E Bhatt S Brauer M Flaxman S Ezzati M Multimodal deep learning from satellite and street-level imagery for measuring income, overcrowding, and environmental deprivation in urban areas Remote Sens Environ 2021 257 112339 10.1016/j.rse.2021.112339 33941991 PMC7985619 29 Yi L Rifas-Shiman S Pescador Jimenez M Assessing greenspace and cardiovascular health through deep-learning analysis of street-view imagery in a cohort of US children Environ Res 2025 265 120459 10.1016/j.envres.2024.120459 39603586 PMC11742899 30 Chen Z Dazard JE Khalifa Y Motairek I Al-Kindi S Rajagopalan S Artificial intelligence-based assessment of built environment from Google Street View and coronary artery disease prevalence Eur Heart J 2024 45 17 1540 1549 10.1093/eurheartj/ehae158 38544295 PMC11075932 31 Klompmaker JO Mork D Zanobetti A Associations of street-view greenspace with Parkinson’s disease hospitalizations in an open cohort of elderly US Medicare beneficiaries Environ Int 2024 188 108739 10.1016/j.envint.2024.108739 38754245 PMC11199351 32 Maharana A Nsoesie EO Use of deep learning to examine the association of the built environment with prevalence of neighborhood adult obesity JAMA Netw Open 2018 1 4 e181535 10.1001/jamanetworkopen.2018.1535 30646134 PMC6324519 33 Yi L Harnois-Leblanc S Rifas-Shiman SL Satellite-based and street-view green space and adiposity in US children JAMA Netw Open 2024 7 12 e2449113 10.1001/jamanetworkopen.2024.49113 39636637 PMC11621986 34 Centers for Disease Control and Prevention PLACES: local data for better health, census tract data 2023 release 2024 https://data.cdc.gov/500-Cities-Places/PLACES-Local-Data-for-Better-Health-Census-Tract-D/em5e-5hvn/about_data 35 Zhang X Holt JB Lu H Multilevel regression and poststratification for small-area estimation of population health outcomes: a case study of chronic obstructive pulmonary disease prevalence using the behavioral risk factor surveillance system Am J Epidemiol 2014 179 8 1025 1033 10.1093/aje/kwu018 24598867 36 Centers for Disease Control and Prevention PLACES: local data for better health: methodology 2024 https://www.cdc.gov/places/methodology/index.html 37 Flanagan BE Gregory EW Hallisey EJ Heitgerd JL Lewis B A social vulnerability index for disaster management J Homel Secur Emerg Manag 2011 8 1 10.2202/1547-7355.1792 38 Robert Graham Center 2018 https://www.graham-center.org/maps-data-tools/social-deprivation-index.html 39 Singh GK Area deprivation and widening inequalities in US mortality, 1969-1998 Am J Public Health 2003 93 7 1137 1143 10.2105/AJPH.93.7.1137 12835199 PMC1447923 40 Chun H Keleş S Sparse partial least squares regression for simultaneous dimension reduction and variable selection J R Stat Soc Series B Stat Methodol 2010 72 1 3 25 10.1111/j.1467-9868.2009.00723.x 20107611 PMC2810828 41 Bates D Mächler M Bolker B Walker S Fitting linear mixed-effects models using lme4. arXiv 2014 10.48550/arXiv.1406.5823 42 Nakagawa S Johnson PCD Schielzeth H The coefficient of determination R 2 J R Soc Interface 2017 14 134 20170213 10.1098/rsif.2017.0213 28904005 PMC5636267 43 Lundberg SM Lee SI A unified approach to interpreting model predictions Guyon I Von Luxburg U Bengio S Wallach H Fergus R Vishwanathan S Garnett R Advances in Neural Information Processing Systems 30 (NIPS 2017) Curran Associates, Inc 2017 https://papers.nips.cc/paper_files/paper/2017/hash/8a20a8621978632d76c43dfd28b67767-Abstract.html 44 Selvaraju RR Cogswell M Das A Vedantam R Parikh D Batra D Grad-CAM: visual explanations from deep networks via gradient-based Localization Int J Comput Vis 2020 128 2 336 359 10.1007/s11263-019-01228-7 45 Odoms-Young A Brown AGM Agurs-Collins T Glanz K Food insecurity, neighborhood food environment, and health disparities: state of the science, research gaps and opportunities Am J Clin Nutr 2024 119 3 850 861 10.1016/j.ajcnut.2023.12.019 38160801 PMC10972712 46 Suglia SF Shelton RC Hsiao A Wang YC Rundle A Link BG Why the neighborhood social environment is critical in obesity prevention J Urban Health 2016 93 1 206 212 10.1007/s11524-015-0017-6 26780582 PMC4794461 47 Wang ML Narcisse MR McElfish PA Higher walkability associated with increased physical activity and reduced obesity among United States adults Obesity (Silver Spring) 2023 31 2 553 564 10.1002/oby.23634 36504362 PMC9877111 48 Browning MHEM Rigolon A McAnirlin O Yoon HV Where greenspace matters most: a systematic review of urbanicity, greenspace, and physical health Landsc Urban Plan 2022 217 104233 10.1016/j.landurbplan.2021.104233 49 Nieuwenhuijsen MJ Green infrastructure and health Annu Rev Public Health 2021 42 317 328 10.1146/annurev-publhealth-090419-102511 33317317 50 Sturm R Cohen DA Suburban sprawl and physical and mental health Public Health 2004 118 7 488 496 10.1016/j.puhe.2004.02.007 15351221 51 Xue H Cheng X Jia P Wang Y Road network intersection density and childhood obesity risk in the US: a national longitudinal study Public Health 2020 178 31 37 10.1016/j.puhe.2019.08.002 31605806 PMC6994342 52 Wang Z Zhao L Huang Q Traffic-related environmental factors and childhood obesity: a systematic review and meta-analysis Obes Rev 2021 22 Suppl 1 suppl 1 e12995 10.1111/obr.12995 32003149 PMC7988540 53 Wolch J Jerrett M Reynolds K Childhood obesity and proximity to urban parks and recreational resources: a longitudinal cohort study Health Place 2011 17 1 207 214 10.1016/j.healthplace.2010.10.001 21075670 PMC4380517 54 Wakefield J Fighting obesity through the built environment Environ Health Perspect 2004 112 11 A616 A618 10.1289/ehp.112-a616 15289181 PMC1247493 55 Mayne SL Auchincloss AH Michael YL Impact of policy and built environment changes on obesity-related outcomes: a systematic review of naturally occurring experiments Obes Rev 2015 16 5 362 375 10.1111/obr.12269 25753170 PMC4789114 Supplement 1. eMethods. eFigure 1. eFigure 2. eFigure 3. eFigure 4. eFigure 5. eFigure 6. eFigure 7. eFigure 8. eFigure 9. eFigure 10. eFigure 11. eTable 1. eTable 2. eTable 3. eTable 4. Supplement 2. Data Sharing Statement ",
  "metadata": {
    "Title of this paper": "Impact of policy and built environment changes on obesity-related outcomes: a systematic review of naturally occurring experiments",
    "Journal it was published in:": "JAMA Network Open",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485642/"
  }
}