{
  "title": "Paper_1063",
  "abstract": "Neurohospitalist Neurohospitalist 2158 nho NHO The Neurohospitalist 1941-8744 1941-8752 SAGE Publications PMC11412466 PMC11412466.1 11412466 11412466 39308461 10.1177/19418744241265393 10.1177_19418744241265393 1 Case Reports Extra-Limbic Seronegative Encephalitis Preceding Recurrent Hodgkin’s Lymphoma and Gastric Diffuse Large B-Cell Lymphoma: A Case Report https://orcid.org/0009-0009-9362-3138 Li Carrie MD 1 Fisher David MD 2 https://orcid.org/0000-0001-8047-3622 Bhattacharyya Shamik MD 1 1 1861 Brigham and Women’s Hospital 2 1855 Dana-Farber Cancer Institute Carrie Li, MD, Neurology, Brigham and Women’s Hospital, 45 Francis Street, Boston, MA 02115-6195, USA. Email: cali@mgb.org The author(s) declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. 21 7 2024 10 2024 14 4 471089 446 449 01 10 2025 01 10 2025 20 09 2024 01 10 2025 © The Author(s) 2024 2024 SAGE Publications We describe a patient with extra-limbic seronegative encephalitis with relapsing progressive course as the harbinger of sequential Hodgkin’s lymphoma and Diffuse Large B-Cell lymphoma. Diagnosis of probable paraneoplastic neurologic syndrome (PNS) was arrived at by exhaustive elimination of alternative causes and supportive tissue diagnosis. This case highlights the phenotypic variety of paraneoplastic neurologic syndromes associated with hematologic malignancies and the challenges in their recognition, diagnosis, and treatment. We discuss and apply the updated consensus diagnostic criteria for paraneoplastic syndromes to our case as a means of bolstering probability in cases of diagnostic uncertainty. paraneoplastic neurologic syndrome seronegative autoimmune encephalitis Hodgkin’s lymphoma non-Hodgkin’s lymphoma diffuse large B-cell lymphoma consensus criteria paraneoplastic neurologic syndrome-care score pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts10 ",
  "metadata": {
    "Title of this paper": "Extra-Limbic Seronegative Encephalitis Preceding Recurrent Hodgkin’s Lymphoma and Gastric Diffuse Large B-Cell Lymphoma: A Case Report",
    "Journal it was published in:": "The Neurohospitalist",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11412466/"
  }
}