{
  "title": "Paper_1240",
  "abstract": "pmc Materials (Basel) Materials (Basel) 3169 materials materials Materials 1996-1944 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471662 PMC12471662.1 12471662 12471662 41010089 10.3390/ma18184244 materials-18-04244 1 Article Matrices of Different Natures for Bone Tissue Engineering—A Comparative Analysis https://orcid.org/0000-0003-1482-4281 Aleinik D. Ya. Conceptualization Methodology Data curation Writing – original draft Writing – review & editing Supervision 1 https://orcid.org/0000-0002-5203-0717 Bokov A. E. Conceptualization Resources Data curation Writing – original draft Funding acquisition 1 https://orcid.org/0000-0003-3879-8460 Linkova D. D. Software Validation Visualization 1 https://orcid.org/0009-0006-3807-1412 Levicheva E. A. Formal analysis Investigation Visualization 1 https://orcid.org/0000-0001-7940-0880 Farafontova E. A. Software Validation Formal analysis 1 Kovylin R. S. Software Validation Investigation Visualization 2 https://orcid.org/0000-0002-8249-8572 Yudin V. V. Formal analysis Investigation Data curation 1 2 https://orcid.org/0000-0003-3458-2814 Khramova D. V. 2 Cherdantseva L. A. Validation Investigation Writing – original draft 3 Chesnokov S. A. Conceptualization Methodology Resources Data curation Writing – review & editing Supervision Project administration Funding acquisition 1 2 Kirilova I. A. Conceptualization Resources Writing – review & editing Project administration 3 https://orcid.org/0000-0002-8815-9651 Egorikhina M. N. Methodology Resources Writing – review & editing Supervision Project administration Funding acquisition 1 * Weber Franz E. Academic Editor 1 daleynik@yandex.ru andrei_bokov@mail.ru linckovadaria@yandex.ru kate.lekat@yandex.ru ekaterina_farafontova@mail.ru yudin@iomc.ras.ru sch@iomc.ras.ru 2 roman@iomc.ras.ru khramovadaria@iomc.ras.ru 3 lcherdanceva@niito.ru irinakirilova71@mail.ru * egorihina.marfa@yandex.ru 10 9 2025 9 2025 18 18 496812 4244 10 8 2025 03 9 2025 04 9 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Recent decades have been characterized by increasing numbers of bone tissue injuries and diseases resulting in the formation of bone defects. The number of such bone defects has also grown due to active surgical approaches implemented after surgical interventions for oncological, infectious, and dystrophic bone lesions. To repair such bone defects requires the use of bone tissue substitutes. Nowadays, constructs based on matrices of various compositions and structures, supplemented with the addition of biologically active components (including growth factors and cells), are the most promising approaches used in bone tissue engineering. The properties of the matrices are of the utmost importance in construct formation. This work presents the results of a comprehensive study of matrices of various natures intended for the formation of complex constructs for bone tissue engineering. Using a set of methods for studying the physical, mechanical, and biological characteristics, the total and associated porosity of the studied matrices, the structure, the mechanical parameters, and the level of cytotoxicity and cytocompatibility were determined. It was shown that all the studied materials were not cytotoxic (cytotoxicity rank of all matrices = 0–1). All matrices were porous, but samples of materials of biological origin had large pores ranging in size from 100 to 1000 μm, and pores of the hybrid polymer were sized from 0.1 to 100 μm. Total and open porosity ranged from 89% and 79% for the allogeneic matrix up to 67% and 48% for the hybrid polymer, respectively, while the σ values (compressive stress at break) of samples of all studied materials were close to each other. When human test culture MSCs interact with samples of these materials, it was shown that the cells adhere to the surface and structure of all materials and retain typical morphology, while also demonstrating the ability to proliferate and migrate along the surface and into the matrix structure, i.e., all materials are cytocompatible. Based on the data obtained, it can be assumed that all the studied matrices can be used for model biomedical studies and as a basis for constructs for bone tissue engineering. An adequate choice of research method at the earliest stages of the development of each material will ensure the most effective approaches for further work and subsequent use of this product. bone defects tissue regeneration bone tissue substitutes framework cytotoxicity cytocompatibility structure porosity polymers Minister of Science and Higher Education of the Russian Federation The work was carried out within the framework of the program “Priority-2030” by the Minister of Science and Higher Education of the Russian Federation. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The growing demands of modern medicine require innovative materials to replace bone defects in various parts of the musculoskeletal system. Such defects can be formed both as a result of injuries and wounds, and after surgical treatment of pathological processes in bone tissue of various etiopathogeneses [ 1 2 3 4 5 6 There is currently a shortage of suitable bone-substitute materials, due not only to the annual increase in the number of bone injuries and diseases and their severity, but also to the introduction of new techniques and technologies of reconstructive plastic surgery into surgical practice of restorative medicine. Taking into account the particular features of the human skeletal system, consisting of 206 bones with various structures and functions, and the multiple clinical situations that affect the properties of bone tissue, many different types of bone-substitute materials are needed to cover the range of bone tissue restoration requirements. There are plenty of types of such materials, but, to date, none of them can completely copy the structural and functional properties of bone tissue and meet all the requirements of modern clinical practice. Thus, research and the development of new materials and compounds to restore bone structural and functional integrity is ongoing. The demand for bone substitutes is continuously increasing: for instance, in 2023, the global market for bone substitutes was estimated at USD 3.81 billion, and according to forecasts, by 2032, it will have grown to USD 6.67 billion, demonstrating an average annual growth rate of 6.5% during the forecast period from 2024 to 2032 [ 7 The materials that are traditionally used to replace bone tissue defects include bone substitutes based either on natural tissues (autologous, allogeneic and xenogenic) or on artificial materials [ 8 9 10 11 12 13 14 15 Allogeneic and xenogenic materials are in high demand for clinical purposes, with the composition and structure of the former being closest to the patient’s own tissues. Moreover, the use of allografts avoids the donor site problems associated with autologous grafts. However, with allografts, there is a greater risk of disease transfer, the rate of engraftment is slower, and the risk of rejection is increased, especially in areas where the blood supply is relatively poor [ 16 The most popular xenomaterials are decellularized bone xenografts; their structure being similar to allogeneic grafts, they can create an optimal microenvironment for the infiltration, adhesion, and proliferation of cells both in vitro and for de novo bone tissue formation in vivo. This osteoinductive effect is associated with the preservation of the micro- and macrostructure of the decellularized bone, as well as with the partial retention of the extracellular matrix components [ 17 18 19 20 21 22 23 Recently, there has been an increase in the number of research attempts related to the study and application of various polymers as artificial bone tissue substitutes [ 24 25 26 27 28 29 30 According to statistics, the synthetic materials segment saw the largest share of the global bone tissue substitutes market in 2023 and is expected to grow at the highest average annual rate during the forecast period (2024 to 2032). The reason for this major share of the segment is attributed to the increasing prevalence of bone-related diseases as well as to the high demand for synthetic products, especially in developed countries. Moreover, the growing number of new products entering the market is expected to contribute to such segment growth during the forecast period [ 7 Unfortunately, the use of some of these substitutes does not always ensure complete restoration of the structural and functional properties of bone tissue; thus, complex constructs are being actively developed based both on well-known, well-proven bone substitutes and on new materials with the inclusion of growth factors or various types of cells. Here, the development of tissue-engineered constructs with the use of bone-substituting materials of various origins as a matrix for the cells and with the addition of growth factors is the most promising direction. This trend in regenerative medicine—bone tissue engineering—is developing rapidly and effectively. The choice of a matrix providing “niches” for stromal cells while also offering appropriate conditions for the migration, proliferation, and differentiation of cells from surrounding tissues is of the utmost importance for successful generation of constructs for use in bone tissue replacement. Taking into account the huge variety of materials of different composition and structure proposed as matrices for bone tissue substitutes, the study of such materials requires the use of various techniques, in particular, materials science techniques [ 31 First of all, one should emphasize the importance of such fundamental matrix characteristics as structure and porosity. Porous materials are the most suitable “niches” for development of the necessary microenvironment for stromal cells, providing conditions for the implementation of cellular processes for bone regeneration [ 32 Porosity, especially the availability of an interconnected pore system, enhances the adhesive properties of the material and is a required characteristic of the matrix for tissue engineering. It is generally believed that materials for bone implants should have an open porosity of 50–70% with a pore size of at least 100 μm for cell migration into the material and for vascular invasion. An interconnected pore system therefore ensures optimal conditions for colonization of the implanted matrix by osteogenic cells, neovascularization from the surrounding tissues, and the maintenance of cell proliferation and differentiation, forming direct links to the recipient’s bone tissues and gradual replacement with newly formed tissues [ 33 34 It is essential that any new material intended for clinical use must undergo a series of preclinical tests of its biological characteristics before permission for its clinical application is granted. Preclinical studies of biomedical materials are conducted on the basis of international ISO standards and usually begin with in vitro testing. However, it should be noted that while techniques regulated by the DIN, EN, and ISO 10993-5:2009 standards mainly focus on determining the level of cytotoxicity in vitro, the study of bone tissue replacement materials to be used in long-term contact with blood and tissues requires a wider range of studies, including cytotoxicity assessments to ensure there is little interference with cellular processes in vivo. Analysis of cell behavior on the surface or within the structure of matrix material samples of an in vitro model enables more adequate assessment of the their properties and prediction of the behavior of the construct in clinical conditions. For instance, it becomes feasible to characterize any changes in cell viability occurring directly on the matrix, the capacity of the matrix to provide for adhesion, localization, and appropriate morphology of cells in the material, and changes in their functional activity, by using modern research techniques [ 35 36 37 38 Assessment of the above parameters is usually conducted with characterized mammalian cell cultures, in particular human cells. Since specific sensitivity is required when studying bone substitutes intended for long-term contact with blood and tissues, it is preferable to use cell cultures and cell lines obtained for these purposes directly from living tissues [ 39 The aim of the research was to conduct a comparative study of the major structural and functional properties of three matrices for use in bone tissue engineering (two natural matrices and a polymer matrix) and their biological characteristics. 2. Materials and Methods 2.1. Obtaining Allogeneic Material The donors of the allogeneic biomaterials provided their informed voluntary consent for its use for research purposes. All donors of the allogeneic biomaterials had no history of tuberculosis, cancer, transmissible infections, or skin diseases. Cells used as a source of test cultures for research were isolated from biopsies of human skin or adipose tissue obtained in the operating room during planned cosmetic surgery procedures. Adipose tissue biomaterial for cell isolation was only used if the results of screening for blood-borne infections (RW, hepatitis B and C, HIV infection) were negative. The test cultures of human dermal fibroblasts and human adipose tissue mesenchymal stromal cells were obtained and characterized in the biotechnology laboratory of the University Clinic of the aforementioned institute, using methods previously described [ 40 41 The bone tissue samples for the allogeneic matrix were obtained from femoral heads resected in patients during surgical procedures scheduled for medical reasons. The tissue material for prepared bone tissue fragments was only used if the results of screening for blood-borne infections (RW, hepatitis B and C, HIV infection) were negative. The prepared bone tissue fragments were subjected to multi-stage sequential decellularization and purification, removing organic components and traces of albumin [ 1 42 43 2.2. Determination of Physical and Mechanical Properties Mercury porosimetry (PASCAL EVO 140/440 ULTRA MACRO porosimeter, Thermo Fisher Scientific, Waltham, MA, USA) was used to determine the pore characteristics of the samples. The structure of sections of the materials was determined by scanning electron microscopy (SEM) using a Regulus SU8100 microscope (Hitachi, Tokyo, Japan) at an accelerating voltage. The mechanical properties of 10 × 10 × 4 mm blocks of the matrices—cut with a blade—were determined using an Autograph AGX-V 50 universal testing machine with a 5 kN force-measuring cell (Shimadzu, Kyoto, Japan). The strength characteristics (Young’s modulus in compression, E, and the ultimate stress in compression, σ) were determined according to ISO 604:2002 [ 44 2.3. Determination of Biological Characteristics of the Samples The levels of cytotoxicity and cytocompatibility of the matrix samples were tested using their interaction with surface-dependent human cells. We studied test cultures of the cells on the matrix samples, looking for changes in their viability, adhesion to the surfaces, proliferation, and migration into the structure of the materials. 2.4. MTT Assay The level (rank) of cytotoxicity was assessed using the MTT assay method [ 45 46 2 At 24 h before use with the extracts to be assayed, the cells of a test culture of 4–6 passages were removed from the prepared flasks and seeded at 5000 cells per well onto a 96-well plate (TPP Techno Plastic Products AG, Trasadingen, Switzerland). Complete growth medium (DMEM/F12 medium with penicillin/streptomycin and 10% inactivated fetal calf serum) was used as the growth medium. The cells were cultured in a CO 2 2 After 24 h of cultivation, the condition of the cultures in the wells was assessed using light microscopy (an inverted microscope, the Leica DMIL LED, Leica, Wetzlar, Germany), with a video camera and Leica LAS V4.13 image visualization software (Leica, Wetzlar, Germany). If the culture was in good condition (typical morphology, in a representative monolayer pattern having a fairly uniform distribution of cells over the surface of the wells), it was used for analysis. After confirmation of the good condition of the cultures, the growth medium was removed from the wells with cells and replaced either with 200 μL of fresh growth medium for the control wells or with 200 μL of the appropriate extract or one of its dilutions in growth medium for the experimental wells. The plate was placed in a CO 2 2 The relative growth rate was determined as a percentage using the following formula: RGR  =  m e a n  O D  o f  t e s t  c o m p o u n d m e a n  O D  o f  c o n t r o l × 100 The cytotoxicity level (rank) was determined according to DIN/EN/ISO 10993-5:2009 [ 39 2.5. Assessment of Cell Interaction with Material Samples Test cultures of human ASCs were used to assess the degree of adhesion, viability, proliferation, and migration of cells within the samples of the studied materials [ 40 3 2 The cells were cultured on the samples for up to 7 days, with the medium being replaced twice during the cultivation process. At the test intervals (24 h, 3 days, and 7 days), three samples of each material were selected for fluorescence microscope examination. For each test, the cells on the samples and those in the three control wells were stained and observed using fluorescence microscopy performed on a Cytation 5 imager (BioTek, Winooski, VT, USA) with the Gen 5 Imedge+ software. Cell nuclei were fluorescent, having been treated with Hoechst 33342 fluorochrome intravital stain (BD Biosciences™, Franclin Lakes, NJ, USA) (excitation wavelength 377 nm and emission wavelength 447 nm), while Calcein AM (BD Pharmingen™, Franclin Lakes, NJ, USA) intravital staining was used to label the cytoplasm of viable cells that had adhered to the sample materials, and to assess their morphology. The action of this dye is associated with esterase activity, which is typical only of viable cells. The staining with these fluorochromes was conducted in accordance with the manufacturers’ protocols. Quantitative assessment of changes in the cell density on the samples during culture growth was conducted using an original technique [ 47 3 The extent of cell migration within the structure of the matrices was assessed using an original technique [ 48 2.6. Statistical Analysis Statistical analysis was conducted using the STATISTICA 6.0 software system (TIBCO Software Inc., Palo Alto, CA, USA). Nonparametric statistics methods and the Wilcoxon paired comparison criterion were used in the study. 3. Results The study was conducted using samples of the following three matrices of different origin and composition: an allogeneic matrix, a commercial osteoplastic BioOst matrix based on xenogenic bone, and a synthetic hybrid polymer material. 3.1. Morphology of the Bone-Substitute Materials 3.1.1. Allogeneic Matrix Material The allogeneic matrix included decellularized and deproteinized bone tissue. The samples used were square blocks with dimensions of 8 × 8 × 4 mm. The blocks were opaque and yellowish, and had visible pores ( Figure 1 Figure 1 Figure 2 3.1.2. BioOst Osteoplast Matrix Material Commercial BioOst osteoplast matrix material is obtained using a proprietary process based on purified bone tissue from young cattle, subjected to strict veterinary control. The samples of the study material were opaque white blocks with visible pores. Figure 3 Figure 4 The porosimetry demonstrated that all the blocks were characterized by a small content of pores up to 100 μm in size, while the majority of pores ranged in size from 200 to 1000 μm. In this range, the porograms of the different blocks varied significantly. For instance, the pore size of block No. 1 ( Figure 4 Figure 4 Figure 4 3.1.3. Hybrid Polymer Material For our research, the experimental hybrid polymer material was obtained from a porous polyoligomer matrix by applying a layer of polylactide to the surface of the pores [ 49 Figure 5 The SEM image of the polymer hybrid material section ( Figure 6 Figure 6 When comparing the pore characteristics of all three studied samples, while it is evident that all the materials were porous, the range of pore sizes of the materials obtained from biological tissues (allogeneic matrix and BioOst matrix) and the experimental hybrid polymer material differed significantly. While the hybrid polymer material had pores only up to 100 μm, the pore size of the biological materials ranged considerably upwards from 50 μm. Thus, the average pore size of the hybrid polymer samples was in the range of 10–20 μm, whereas those of the biological material were principally in the hundreds of microns. The samples of the allogeneic matrix material had the highest porosity. This was evidenced by the maximum values of the specific pore volume and the total and open porosity ( Table 1 Table 1 Physical and mechanical compression tests of the allogeneic matrix samples were performed in two load application variants: from the top and from the side ( Table 1 Table 1 50 3.2. Biological Characteristics of the Samples The cytotoxicity study conducted on all samples using the MTT assay showed no cytotoxicity at either extraction time (1 and 7 days) nor at any dilution of the extracts. For all samples, the viability was ≥70%. When culturing human ASCs on samples of the materials under study, distinct cell adhesion was recorded, both on the surface and within the structure of the samples ( Figure 7 Figure 8 Figure 9 Figure 7 Figure 8 Figure 9 Figure 7 Figure 8 Figure 9 Figure 10 Analysis of the changes in cell density on the samples during cultivation over time revealed that the number of cell nuclei increased both on the surfaces and within the structures of samples of all the studied materials (up to 7 days of observation) ( Figure 11 Figure 12 Figure 13 For instance, the number of cells within the structure of the allogeneic matrix increased at a steady rate throughout the entire observation period (7 days), the rate of increase being statistically significant between the observation times ( Figure 11 Figure 11 After 24 h of cultivation, the number of cells within the structure of the xenogenic BioOst osteoplast matrix samples was not as high as in the allogeneic material, and even though numbers later increased, they did not reach such high values as in the allogeneic matrix ( Figure 12 Figure 13 On determining the depth of cell penetration into the sample structures, it was found that this indicator also differed, apparently being determined by the material structure and pore sizes. With the allogeneic matrix, the ASCs had become affixed at significant depths (about 900 μm) after 24 h, and by Day 3, they had penetrated statistically significantly deeper, going on to reach a depth of >2000 μm by Day 7 ( Figure 14 The depth of ASC penetration into the structure of the xenogenic material samples (BioOst osteoplastic matrix) after 24 h was significantly lower than for the allogeneic matrix, although they continued to move inwards through Day 3, statistically significantly increasing their penetration to 900 μm by Day 7 of cultivation ( Figure 15 In the hybrid polymer samples, after 24 h of cultivation, the ASCs had penetrated the structure to 319 μm, then continued to move slightly deeper by Day 7 ( Figure 16 Overall, then, the study demonstrated that, while the matrix materials of various origin were not cytotoxic, there were specific differences in their pore characteristics and in aspects of their physical and mechanical properties. It was shown that the cells of the test cultures adhered well and spread out over the surfaces of samples of all the studied materials while preserving their typical morphology. They actively proliferated during the observation period and migrated into the structure of the samples. Both the initial and subsequent migration depths were apparently determined by the pore sizes and the structure of the materials. The in vitro data obtained indicate that the properties of the different matrices created favorable conditions for the initial stage of interaction with surface-dependent cells and for continuation of their cellular processes, both on the surface and within the structure of the materials—that is, they were all cytocompatible. It should be remembered that the hybrid polymer essentially differed from the biological materials in its predominance of small pores with diameters of ~1–100 μm. It is widely recognized that pore characteristics are amongst the most important features contributing to successful biointegration of a bone-substitute implant in the body. The overall porosity, size, and shape of the pores of such materials and of biotissues are therefore critical for tissue engineering purposes. The pores are important in ensuring cell colonization and tissue vascularization. In this respect, the overall porosity and pore sizes in the matrices may need to be different, depending on purpose and location (as with natural bone structures in the body). For example, it is known that cortical bone has a porosity of about 5–10%, while cancellous bone’s porosity is 75–90% [ 51 52 53 Some researchers believe that to ensure cell invasion, the pore size should be in the range of at least 200–350 μm [ 54 55 56 Since existing materials of biological origin have disadvantages in the variability of their porous characteristics and physical and mechanical properties, in addition to the impossibility of precisely programming specified shapes or making implants from such materials using 3D printing, it can be assumed that the use of matrices based on polymeric materials should provide greater stability of properties, predictability of results, and range of applicability of their use in various clinical situations. Such reliability should be possible to ensure through careful choice of the chemical composition of these polymeric materials, offering the ability to adjust the porosity and in vivo decomposition rate. Moreover, the advantage of polymer matrices is their potential production in large quantities under controlled conditions, their long shelf life, ease of processing, and often lower cost compared to biological scaffolds [ 57 4. Conclusions Thus, the cytocompatibility, lack of cytotoxicity, and porous structures of all the studied materials allow us to suggest that all three, the allogeneic matrix, the xenogenic BioOst matrix, and the hybrid polymer material, are appropriate for use as matrices for biomedical research and in the formation of model constructs for bone tissue replacement. Undoubtedly, preclinical studies of each new compound intended for biomedical research must be thorough, comprehensive, and consistent, taking into account the particular purpose to which each specific material will be put when assessing the material characteristics. Adequate selection of research methods at the earliest stages of development of each material will ensure the most effective approaches for further work and subsequent use of this product. We hope that our experience working with materials of various origins will be useful to specialists developing new products for biomedicine. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, D.Y.A., S.A.C., I.A.K. and A.E.B.; methodology, S.A.C., D.Y.A. and M.N.E.; software, D.D.L., R.S.K., D.V.K. and E.A.F.; validation, D.D.L., D.V.K., L.A.C., R.S.K. and E.A.F.; formal analysis, R.S.K., E.A.L., V.V.Y. and E.A.F.; investigation, R.S.K., V.V.Y., E.A.L. and L.A.C.; resources, S.A.C., I.A.K., M.N.E. and A.E.B.; data curation, D.Y.A., A.E.B. and S.A.C.; writing—original draft preparation, D.Y.A., V.V.Y., A.E.B. and L.A.C.; writing—review and editing, D.Y.A., S.A.C., I.A.K. and M.N.E.; visualization, R.S.K., D.D.L., D.V.K. and E.A.L.; supervision, D.Y.A., S.A.C. and M.N.E.; project administration, M.N.E., S.A.C. and I.A.K.; funding acquisition, M.N.E., S.A.C. and A.E.B. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The collection of biomaterial and preparation of cell samples and cultures with subsequent use for in vitro studies were conducted in accordance with the guidelines of the Declaration of Helsinki and approved by the local ethics committee of the Federal State Budgetary Educational Institution of Higher Education, the “Privolzhsky Research Medical University” of the Ministry of Health of the Russian Federation (Nizhny Novgorod, Russia; 30 June 2023, protocol No. 9). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. Kirilova I.A. Anatomical and Functional Properties of Bone as a Basis for the Creation of Bone-Plastic Materials for Traumatology and Orthopedics 1st ed. Fizmatlit Moscow, Russia 2019 256 2. Wu A.M. Bisignano C. James S.L. Abady G.G. Abedi A. Abu-Gharbieh E. Alhassan R.K. Alipour V. Arabloo J. Asaad M. Global, Regional, and National Burden of Bone Fractures in 204 Countries and Territories, 1990–2019: A Systematic Analysis from the Global Burden of Disease Study 2019 Lancet Heal. Longev. 2021 2 e580 e592 10.1016/S2666-7568(21)00172-0 PMC8547262 34723233 3. Pacelli S. Basu S. Whitlow J. Chakravarti A. Acosta F. Varshney A. Modaresi S. Berkland C. Paul A. Strategies to Develop Endogenous Stem Cell-Recruiting Bioactive Materials for Tissue Repair and Regeneration Adv. Drug Deliv. Rev. 2017 120 50 70 10.1016/j.addr.2017.07.011 28734899 PMC5705585 4. Roseti L. Parisi V. Petretta M. Cavallo C. Desando G. Bartolotti I. Grigolo B. Scaffolds for Bone Tissue Engineering: State of the Art and New Perspectives Mater. Sci. Eng. C 2017 78 1246 1262 10.1016/j.msec.2017.05.017 28575964 5. Phukan R. Herzog T. Boland P.J. Healey J. Rose P. Sim F.H. Yazsemski M. Hess K. Osler P. DeLaney T.F. How Does the Level of Sacral Resection for Primary Malignant Bone Tumors Affect Physical and Mental Health, Pain, Mobility, Incontinence, and Sexual Function? Clin. Orthop. Relat. Res. 2016 474 687 696 10.1007/s11999-015-4361-3 26013155 PMC4746195 6. Majidinia M. Sadeghpour A. Yousefi B. The Roles of Signaling Pathways in Bone Repair and Regeneration J. Cell. Physiol. 2018 233 2937 2948 10.1002/jcp.26042 28590066 7. Fortune Business Insights Available online: https://www.fortunebusinessinsights.com/bone-graft-substitutes-market-103106 (accessed on 4 August 2025) 8. Giannoudis P.V. Dinopoulos H. Tsiridis E. Bone Substitutes: An Update Injury 2005 36 (Suppl. 3) 20 27 10.1016/j.injury.2005.07.029 16188545 9. Rupp M. Klute L. Baertl S. Walter N. Mannala G.K. Frank L. Pfeifer C. Alt V. Kerschbaum M. The Clinical Use of Bone Graft Substitutes in Orthopedic Surgery in Germany—A 10-Years Survey from 2008 to 2018 of 1,090,167 Surgical Interventions J. Biomed. Mater. Res. -Part B Appl. Biomater. 2022 110 350 357 10.1002/jbm.b.34911 34291874 10. Eugen G. Claus M. Anna-Maria S. Niklas D. Philipp S. Andrea E. Andrea M.L. Elke V. Degradation of 3D-Printed Magnesium Phosphate Ceramics in Vitro and a Prognosis on Their Bone Regeneration Potential Bioact. Mater. 2023 19 376 391 10.1016/j.bioactmat.2022.04.015 35574054 PMC9062425 11. Kanter B. Vikman A. Brückner T. Schamel M. Gbureck U. Ignatius A. Bone Regeneration Capacity of Magnesium Phosphate Cements in a Large Animal Model Acta Biomater. 2018 69 352 361 10.1016/j.actbio.2018.01.035 29409867 12. Ayukawa Y. Suzuki Y. Tsuru K. Koyano K. Ishikawa K. Histological Comparison in Rats between Carbonate Apatite Fabricated from Gypsum and Sintered Hydroxyapatite on Bone Remodeling Biomed Res. Int. 2015 2015 1 7 10.1155/2015/579541 PMC4609359 26504813 13. Kolk A. Handschel J. Drescher W. Rothamel D. Kloss F. Blessmann M. Heiland M. Wolff K.D. Smeets R. Current Trends and Future Perspectives of Bone Substitute Materials—From Space Holders to Innovative Biomaterials J. Cranio-Maxillofacial Surg. 2012 40 706 718 10.1016/j.jcms.2012.01.002 22297272 14. Laurie S. Kaban L. Mulliken J. Murray J. Donor-Site Morbidity after Harvesting Rib and Iliac Bone Plast. Reconstr. Surg. 1984 73 933 938 10.1097/00006534-198406000-00014 6374708 15. Chou L.B. Mann R.A. Coughlin M.J. McPeake W.T. Mizel M.S. Stress Fracture as a Complication of Autogenous Bone Graft Harvest from the Distal Tibia Foot Ankle Int. 2007 28 199 201 10.3113/FAI.2007.0199 17296139 16. Danko A.M. Allen B. Pugh L. Stasikelis P. Early Graft Failure in Lateral Column Lengthening J. Pediatr. Orthop. 2004 24 716 720 10.1097/01241398-200411000-00022 15502576 17. Rücker C. Kirch H. Pullig O. Walles H. Strategies and First Advances in the Development of Prevascularized Bone Implants Curr. Mol. Biol. Reports 2016 2 149 157 10.1007/s40610-016-0046-2 PMC4996880 27617188 18. Prakash S.K. Mukerji N. Nath F.P. Is Tutobone an Efficient Alternative to Other Implants Used in Anterior Cervical Discectomy and Fusion Surgeries? Br. J. Neurosurg. 2017 31 340 344 10.1080/02688697.2017.1297362 28637120 19. Abuelnaga M. Elbokle N. Khashaba M. Evaluation of Custom Made Xenogenic Bone Grafts in Mandibular Alveolar Ridge Augmentation versus Particulate Bone Graft with Titanium Mesh Egypt. J. Oral Maxillofac. Surg. 2018 9 62 73 10.21608/omx.2018.19566 20. Ferracini R. Bistolfi A. Garibaldi R. Furfaro V. Battista A. Perale G. Composite Xenohybrid Bovine Bone-Derived Scaffold as Bone Substitute for the Treatment of Tibial Plateau Fractures Appl. Sci. 2019 9 1 11 10.3390/app9132675 21. Shanmugasundaram N. Ravikumar T. Babu M. Comparative Physico-Chemical and in Vitro Properties of Fibrillated Collagen Scaffolds from Different Sources J. Biomater. Appl. 2004 18 247 264 10.1177/0885328204040945 15070513 22. Willett T.L. Labow R.S. Aldous I.G. Avery N.C. Lee J.M. Changes in Collagen with Aging Maintain Molecular Stability after Overload: Evidence from an in Vitro Tendon Model J. Biomech. Eng. 2010 132 031002 10.1115/1.4000933 20459190 23. Browne S. Zeugolis D.I. Pandit A. Collagen: Finding a Solution for the Source Tissue Eng. -Part A 2013 19 1491 1494 10.1089/ten.tea.2012.0721 23240852 PMC3665299 24. Guo Z. Poot A.A. Grijpma D.W. Advanced Polymer-Based Composites and Structures for Biomedical Applications Eur. Polym. J. 2021 149 10.1016/j.eurpolymj.2021.110388 25. Wang Y. Liu Y. Chen S. Francis Siu M.F. Liu C. Bai J. Wang M. Enhancing Bone Regeneration through 3D Printed Biphasic Calcium Phosphate Scaffolds Featuring Graded Pore Sizes Bioact. Mater. 2025 46 21 36 10.1016/j.bioactmat.2024.11.024 39734570 PMC11681834 26. Tarchala M. Engel V. Barralet J. Harvey E.J. A Pilot Study: Alternative Biomaterials in Critical Sized Bone Defect Treatment Injury 2018 49 523 531 10.1016/j.injury.2017.11.007 29153382 27. Abdelaziz A.G. Nageh H. Abdo S.M. Abdalla M.S. Amer A.A. Abdal-hay A. Barhoum A. A Review of 3D Polymeric Scaffolds for Bone Tissue Engineering: Principles, Fabrication Techniques, Immunomodulatory Roles, and Challenges Bioengineering 2023 10 204 10.3390/bioengineering10020204 36829698 PMC9952306 28. Yudin V.V. Shurygina M.P. Egorikhina M.N. Aleynik D.Y. Linkova D.D. Charykova I.N. Kovylin R.S. Chesnokov S.A. Pore Structure Tuning of Poly-EGDMA Biomedical Material by Varying the O-Quinone Photoinitiator Polymers 2023 15 1 18 10.3390/polym15112558 PMC10255199 37299356 29. Kovylin R.S. Aleynik D.Y. Fedushkin I.L. Modern Porous Polymer Implants: Synthesis, Properties, and Application Polym. Sci. -Ser. C 2021 63 29 46 10.1134/S1811238221010033 30. Yan Y. Chen H. Zhang H. Guo C. Yang K. Chen K. Cheng R. Qian N. Sandler N. Zhang Y.S. Vascularized 3D Printed Scaffolds for Promoting Bone Regeneration Biomaterials 2019 190–191 97 110 10.1016/j.biomaterials.2018.10.033 30415019 31. Di Pietro L. Palmieri V. Papi M. Lattanzi W. Translating Material Science into Bone Regenerative Medicine Applications: State-of-The Art Methods and Protocols Int. J. Mol. Sci. 2022 23 9493 10.3390/ijms23169493 36012749 PMC9409266 32. Nimiritsky P.P. Sagaradze G.D. Efimenko A.Y. Makarevich P.I. Tkachuk V.A. The Stem Cell Niche Tsitologiya 2018 60 575 586 10.31116/tsitol.2018.08.01 33. Kirillova A. Yeazel T.R. Asheghali D. Petersen S.R. Dort S. Gall K. Becker M.L. Fabrication of Biomedical Scaffolds Using Biodegradable Polymers Chem. Rev. 2021 121 11238 11304 10.1021/acs.chemrev.0c01200 33856196 34. Lee S.S. Du X. Kim I. Ferguson S.J. Scaffolds for Bone-Tissue Engineering Matter 2022 5 2722 2759 10.1016/j.matt.2022.06.003 35. Seweryn A. Pielok A. Lawniczak-Jablonska K. Pietruszka R. Marcinkowska K. Sikora M. Witkowski B.S. Godlewski M. Marycz K. Smieszek A. Zirconium Oxide Thin Films Obtained by Atomic Layer Deposition Technology Abolish the Anti-Osteogenic Effect Resulting from MiR-21 Inhibition in the Pre-Osteoblastic MC3T3 Cell Line Int. J. Nanomedicine 2020 15 1595 1610 10.2147/IJN.S237898 32210554 PMC7069564 36. Mielan B. Sousa D.M. Krok-Borkowicz M. Eloy P. Dupont C. Lamghari M. Pamuła E. Polymeric Microspheres/Cells/Extracellular Matrix Constructs Produced by Auto-Assembly for Bone Modular Tissue Engineering Int. J. Mol. Sci. 2021 22 7897 10.3390/ijms22157897 34360672 PMC8348249 37. Li M. Bai J. Tao H. Hao L. Yin W. Ren X. Gao A. Li N. Wang M. Fang S. Rational Integration of Defense and Repair Synergy on PEEK Osteoimplants via Biomimetic Peptide Clicking Strategy Bioact. Mater. 2022 8 309 324 10.1016/j.bioactmat.2021.07.002 34541403 PMC8427090 38. Elashry M.I. Baulig N. Wagner A.S. Klymiuk M.C. Kruppke B. Hanke T. Wenisch S. Arnhold S. Combined Macromolecule Biomaterials Together with Fluid Shear Stress Promote the Osteogenic Differentiation Capacity of Equine Adipose-Derived Mesenchymal Stem Cells Stem Cell Res. Ther. 2021 12 1 17 10.1186/s13287-021-02146-7 33579348 PMC7879632 39. ISO 10993-5:2009 Biological Evaluation of Medical Devices—Part 5: Tests for In Vitro Cytotoxicity International Organization of Standardization Geneva, Switzerland 2009 40. Egorikhina M.N. Kobyakova I.I. Charykova I.N. Linkova D.D. Rubtsova Y.P. Farafontova E.A. Aleynik D.Y. Application of Hydrogel Wound Dressings in Cell Therapy-Approaches to Assessment in Vitro Int. J. Burns Trauma 2023 13 13 32 37215513 PMC10195216 41. Aleynik D.Y. Charykova I.N. Rubtsova Y.P. Linkova D.D. Farafontova E.A. Egorikhina M.N. Specific Features of the Functional Activity of Human Adipose Stromal Cells in the Structure of a Partial Skin-Equivalent Int. J. Mol. Sci. 2024 25 6290 10.3390/ijms25126290 38927998 PMC11203524 42. Ramikh E.A. Podorozhnaya V.T. Etitejn Y.V. Chajkina M.V. Method for Preparing a Bone Graft SU1724206A1 7 April 1992 43. Kirilova I.A. Podorozhnaya V.T. Pavlov V.V. Bedoreva I.Y. Unated donation femoral heads in the Novosibirsk RITO Adv. Curr. Nat. Sci. 2015 9 49 52 Available online: https://natural-sciences.ru/ru/article/view?id=35524 (accessed on 3 September 2025) 44. ISO 604:2002 Plastics—Determination of Compressive Properties International Organization of Standardization Geneva, Switzerland 2002 45. Mosmann T. Rapid colorimetric assay for cellular growth and survival: Application to proliferation and cytotoxicity assays J. Immunol. Methods 1983 65 55 63 10.1016/0022-1759(83)90303-4 6606682 46. Shanmugam S. Gopal B. Antimicrobial and Cytotoxicity Evaluation of Aliovalent Substituted Hydroxyapatite Appl. Surf. Sci. 2014 303 277 281 10.1016/j.apsusc.2014.02.166 47. Egorikhina M.N. Aleynik D.Y. Rubtsova Y.P. Charykova I.N. Quantitative Analysis of Cells Encapsulated in a Scaffold MethodsX 2020 7 101146 10.1016/j.mex.2020.101146 33665147 PMC7897707 48. Egorikhina M.N. Rubtsova Y.P. Alejnik D.Y. Charykova I.N. Kovylin R.S. Yudin V.V. Chesnokov S.A. Method of Estimating Cell Migration into Structure of Material or Scaffold RU2740566C1 15 January 2021 49. Chesnokov S.A. Aleynik D.Y. Kovylin R.S. Yudin V.V. Egiazaryan T.A. Egorikhina M.N. Zaslavskaya M.I. Rubtsova Y.P. Gusev S.A. Mlyavykh S.G. Porous Polymer Scaffolds Based on Cross-Linked Poly-EGDMA and PLA: Manufacture, Antibiotics Encapsulation, and In Vitro Study Macromol. Biosci. 2021 21 1 11 10.1002/mabi.202000402 33759338 50. Lodoso-Torrecilla I. van den Beucken J.J.J.P. Jansen J.A. Calcium Phosphate Cements: Optimization toward Biodegradability Acta Biomater. 2021 119 1 12 10.1016/j.actbio.2020.10.013 33065287 51. Polo-Corrales L. Latorre-Esteves M. Ramirez-Vick J.E. Scaffold Design for Bone Regeneration J. Nanosci. Nanotechnol. 2014 14 15 56 10.1166/jnn.2014.9127 24730250 PMC3997175 52. Li X. Wang L. Fan Y. Feng Q. Cui F.Z. Watari F. Nanostructured Scaffolds for Bone Tissue Engineering J. Biomed. Mater. Res. -Part A 2013 101 A 2424 2435 10.1002/jbm.a.34539 23377988 53. Choi W.J. Hwang K.S. Kwon H.J. Lee C. Kim C.H. Kim T.H. Heo S.W. Kim J.H. Lee J.Y. Rapid Development of Dual Porous Poly(Lactic Acid) Foam Using Fused Deposition Modeling (FDM) 3D Printing for Medical Scaffold Application Mater. Sci. Eng. C 2020 110 110693 10.1016/j.msec.2020.110693 32204007 54. Dhandayuthapani B. Yoshida Y. Maekawa T. Kumar D.S. Polymeric Scaffolds in Tissue Engineering Application: A Review Int. J. Polym. Sci. 2011 2011 290602 10.1155/2011/290602 55. Li Y. Xiao Y. Liu C. The Horizon of Materiobiology: A Perspective on Material-Guided Cell Behaviors and Tissue Engineering Chem. Rev. 2017 117 4376 4421 10.1021/acs.chemrev.6b00654 28221776 56. Bohner M. Santoni B.L.G. Döbelin N. β-Tricalcium Phosphate for Bone Substitution: Synthesis and Properties Acta Biomater. 2020 113 23 41 10.1016/j.actbio.2020.06.022 32565369 57. Iqbal N. Khan A.S. Asif A. Yar M. Haycock J.W. Rehman I.U. Recent Concepts in Biodegradable Polymers for Tissue Engineering Paradigms: A Critical Review Int. Mater. Rev. 2019 64 91 126 10.1080/09506608.2018.1460943 Figure 1 Morphology of the allogeneic matrix bone substitute: ( a b Figure 2 Curve of pore distribution by size within the allogeneic matrix bone substitute. Figure 3 Morphology of the osteoplastic matrix BioOst bone substitute: ( a b Figure 4 Curve of pore distribution by size within the osteoplastic matrix BioOst bone substitute: ( a b c Figure 5 Micrograph of the surface of a sample of hybrid polymer material. Figure 6 ( a b Figure 7 ASCs on the surface of the allogeneic matrix material (cross-linked image) after 24 h of cultivation using fluorescence microscopy: ( a b Figure 8 ASCs on the surface of the osteoplastic matrix BioOst material (cross-linked image) after 24 h of cultivation using fluorescence microscopy: ( a b Figure 9 ASCs on the surface of the hybrid polymer material (cross-linked image) after 24 h of cultivation using fluorescence microscopy: ( a b Figure 10 Viable ASCs on the samples of material (cross-linked image) after 48 h of cultivation using fluorescence microscopy with a Calcein AM fluorochrome (100× magnification): ( a b c Figure 11 Change in the number of ASCs within the structure of the allogeneic matrix material during cultivation. Figure 12 Change in the number of ASCs within the structure of the osteoplastic matrix BioOst material during cultivation. Figure 13 Change in the number of ASCs within the structure of the hybrid polymer material during cultivation. Figure 14 Change in the depth of penetration of ASCs into the structure of the allogeneic matrix samples. Figure 15 Depth of ASC penetration into the structure of xenogenic BioOst osteoplast matrix samples. Figure 16 Depth of ASC penetration into the structure of hybrid polymer samples. materials-18-04244-t001_Table 1 Table 1 Pore, physical, and mechanical characteristics of the studied materials. Parameters Allogeneic Matrix Osteoplastic Matrix BioOst Hybrid Polymer Pore size (average pore size), μm 50–1000 50–1000 1–100 Specific pore volume, cm 3 2.52 1.86 1.18 Total porosity, % 89% 78% 67% Open porosity, % 79% 75% 48% E, MPa 208/127 47.7 80 σ, MPa 4.8/5.1 5.2 5.8 E—modulus of elasticity; σ—breaking stress under compression. ",
  "metadata": {
    "Title of this paper": "Recent Concepts in Biodegradable Polymers for Tissue Engineering Paradigms: A Critical Review",
    "Journal it was published in:": "Materials",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471662/"
  }
}