{
  "title": "Paper_213",
  "abstract": "pmc Int J Med Sci Int J Med Sci 257 ijmedsci ijms International Journal of Medical Sciences 1449-1907 Ivyspring International Publisher PMC12492370 PMC12492370.1 12492370 12492370 10.7150/ijms.115487 ijmsv22p3895 1 Research Paper ABCC6 Transporter Contributed to Cisplatin Resistance on Bladder Cancer Chou Kuang‑Yu 1 * Chang An-Chen 2 3 Hwang Thomas I‑Sheng 1 4 5 Tsai Te‑Fu 1 Ho Chao‑Yen 1 6 Liu Hsiu-Wen 1 Achudhan David 7 Tang Chih-Hsin 8 9 10 11 Lin Yen-You 3 ✉ 1 2 3 4 5 6 7 8 9 10 11 ✉ Corresponding author: Yen-You Lin, PhD, Translational Medicine Center, Research Department, Shin Kong Wu Ho‑Su Memorial Hospital; E-mail: T017654@ms.skh.org.tw * First author. Competing Interests: The authors have declared that no competing interest exists. 2025 22 8 2025 22 15 498247 3895 3905 10 4 2025 4 8 2025 22 08 2025 04 10 2025 04 10 2025 © The author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ https://ivyspring.com/terms Bladder cancer (BLCA) is one of the most common urological malignancies worldwide, including in Taiwan, where its incidence has been increasing. It accounts for approximately 3% of all newly diagnosed cancer cases. Drug resistance remains a major challenge in BLCA treatment, particularly at the metastatic stage, where only 35% of metastatic BLCA patients respond to cisplatin chemotherapy, and most eventually develop resistance. In the present study, we established cisplatin-resistant BLCA cell models (T24 and UMUC3) and analyzed ATP-binding cassette (ABC) transporters. We identified ABC transporter C member 6 (ABCC6) as a crucial transporter upregulated in cisplatin-resistant BLCA cells. Further analysis showed that ABCC6 knockdown affected autophagy-related markers, and inhibition of autophagy using bafilomycin A1 (BafA1) and chloroquine (CQ) reversed cisplatin resistance. These findings suggest that ABCC6 contributes to cisplatin resistance in BLCA through autophagy regulation. Our study highlights ABCC6 as a crucial factor in BLCA cisplatin resistance, with autophagy playing a significant role in this mechanism. Targeting autophagy may offer a potential strategy to overcome chemoresistance in BLCA. Future research should focus on validating these findings in clinical samples and exploring ABCC6 inhibitors or autophagy modulators as therapeutic options. bladder cancer cisplatin resistance ABC transporter C member 6 transporter autophagy chemotherapy resistance pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Bladder cancer (BLCA) is a common malignant tumor of the urinary system that originates in the tissues of the bladder, the organ responsible for urine storage. Globally, BLCA ranks 13 th th 1 1 2 3 4 5 Among platinum-based anti-neoplastic agents, cisplatin is the first and most effective 6 7 8 9 10 8 11 12 The well-known drug efflux transporters, such as P-glycoprotein (P-gp), play a crucial role in chemotherapy failure by actively expelling anticancer drugs from cells. Among them, ATP-binding cassette (ABC) transporters constitute a large family of membrane proteins that utilize energy from ATP hydrolysis to transport a wide variety of substrates across cellular membranes 13 15 16 17 18 Materials and Methods Materials ATG5 (sc-133158), ATG12 (sc-271688), ABCC6 (sc-59618), p62 (sc-48402) and b-actin (sc-58673) antibody were bought from Santa Cruz Biotechnology, Inc. (Santa Cruz, CA, USA). Cell culture materials were bought from Thermo Fisher Scientific, Inc. (Waltham, MA, USA). The qPCR primers and ABCC6 short hairpin (sh) RNA were purchased from MDBio, Inc (New Taipei, Taiwan). The Taqman ® Cell culture The human BLCA cell lines T24 (grade III) and UMUC3 (stage III) were obtained from the Bioresource Collection and Research Center (BCRC) in Taiwan. T24 cells were cultured in McCoy's 5A medium (Gibco; Thermo Fisher Scientific, Inc.), whereas UMUC3 cells were cultured in Minimum Essential Medium (Gibco). Both media contained 10% fetal bovine serum (FBS; Gibco), 2 mM GlutaMAX‑1, and Penicillin/Streptomycin/Amphotericin B Solution (Sigma‑Aldrich; Merck KGaA). The cells were incubated at 37°C with 5% CO₂. Cisplatin-resistant cell establishment Cisplatin-resistant BLCA cell lines were established from T24 and UMUC3 cells following a previously described protocol 19 50 Cell viability T24 and UMUC3 cells were seeded in 96‑well plates at a density of 2×10⁴ cells per well. The cells were then treated with varying concentrations of cisplatin (0, 3.125, 6.25, 12.5, 25, 50, 100, 150, and 200 μM) for 24 h. Cell viability was evaluated using a resazurin reagent (Biotium, Inc.). And resazurin solution, constituting 10% of the initial well volume, was added, and the plate was incubated for 6 h at 37°C under 5% CO₂. Fluorescence intensity was subsequently measured using a multimode microplate reader (Varioskan LUX Plate Reader; Thermo Fisher Scientific, Inc.). shRNA Transfection Transfection of 1 μg ABCC6 shRNA plasmid into BLCA cells was carried out using the ViaFect™ transfection reagent (Promega, WI, USA), following the manufacturer's protocol. Colony formation T24 and UMUC3 cells were seeded into 6‑well plates at a density of 3×10³ cells per well and treated with varying concentrations of cisplatin (0, 0.5, 1, 2, or 6 μM). After a 7-day incubation period, colonies containing ≤50 cells were identified. The cell colonies were fixed with 3.7% formaldehyde for 20 min at room temperature (RT), followed by staining with 0.05% crystal violet (w/v) for another 20 mins at RT. The stain was then extracted using 10% acetic acid, and the absorbance of the resulting solution was measured to quantify the cell colonies 20 Western blotting Protein samples were resolved on sodium dodecyl sulfate polyacrylamide gel electrophoresis and transferred to immobilon polyvinylidene difluoride membranes. Membranes were then blocked with protein‑free blocking buffer (Thermo Fisher Scientific, MA, USA) for 1 h at RT, followed by incubation with primary antibodies against p62, LC3-II, ATG5, ATG12, and β‑actin (1:3000; GeneTex, Irvine, CA, USA) overnight at 4°C. After three washes with PBST, membranes were subsequently incubated with peroxidase‑conjugated secondary antibodies (1:3000; GeneTex, Irvine, CA, USA) for 1 h at RT. Protein bands were visualized with enhanced chemiluminescence using Kodak X‑OMAT LS film (Eastman Kodak, Rochester, NY, USA). Real-time polymerase chain reaction (qPCR) Total RNA was isolated using the easy‑BLUE™ Total RNA Extraction Kit (iNtRON biotechnology Inc. WA, USA). mRNA was subsequently reverse-transcribed into cDNA utilizing the MMLV Reverse Transcriptase kit (Invitrogen; Thermo Fisher Scientific, Inc. MA, USA) and the Mir-X™ miRNA First-Strand Synthesis kit (Takara Bio, Kyoto, Japan) in accordance with the manufacturer's instructions. qPCR analysis was carried out using the SYBR Green Master Mix (Applied Biosystems; Thermo Fisher Scientific, Inc. MA, USA) on a StepOnePlus sequence detection system (Thermo Fisher Scientific, Inc. MA, USA). The thermal cycling conditions were consistent with those described in previous studies 20 21 1 ‑ΔΔ Calcein AM assay T24 and UMUC3 cells were seeded into 48‑well plates at a density of 1×10⁴ cells per well and treated according to the experimental conditions. The cells were pre‑stained with calcein AM, (a green, fluorescent dye; 1 μg/μl), for 1 hour at 37°C in an incubator, followed by three washes with phosphate‑buffered saline (PBS). Subsequently, the cells were incubated with calcein AM staining reagent at a ratio of 1:5 for 4 h at 37°C. Viable BLCA cells were identified based on their green fluorescence signal, which was measured using a Varioskan LUX Plate Reader (Thermo Fisher Scientific, Inc. MA, USA) at the corresponding fluorescence wavelength. Fluorescent staining T24 and UMUC3 cells were placed onto chamber slides (Sigma‑Aldrich; Merck KGaA, MA, USA) and treated according to the experimental conditions. The cells were incubated with primary antibodies targeting LC3-II (1:50 dilution; Cell Signaling Technology, Inc. MA, USA) and p62 (1:50 dilution; Cell Signaling Technology, Inc. MA, USA) for 1 h at RT, followed by counterstaining with 4',6‑diamidino‑2‑phenylindole (DAPI) for 5 min at RT. LC3-II and p62-positive BLCA cells were visualized using a Nikon Ti2 fluorescence microscope (Nikon Corporation, Tokyo, Japan). Statistical analysis All experiments were conducted three times independently. Comparisons between two groups were analyzed using the student's t-test p Results Effects of cisplatin resistance on BLCA To investigate molecular changes associated with cisplatin resistance in BLCA, a resistance model was established by subjecting wild-type cells to incremental doses of cisplatin. A cell viability assay was performed to determine the IC 50 50 50 1 1 Effects of cisplatin resistance on ABCs transporter expression To investigate the effect of cisplatin resistance, qPCR was used to analyze the different types of ABCs transporter at mRNA levels. In Fig. 2 2 2 2 Effects of ABCC6 blocking reducing cisplatin resistance To confirm the role of ABCC6 on cisplatin resistance BLCA cell, two short-hairpin (sh) RNAs of ABCC6 were used for inhibiting ABCC6 expression. The results show that the two ABCC6 shRNA effectively reduced ABCC6 protein expression either on cisplatin resistance T24 cell or cisplatin resistance UMUC3 cell (Fig. 3 3 Effects of cisplatin resistance on Autophagy of BLCA In this study, the effect of cisplatin resistance on autophagy in BLCA. Thus, our experimental data presented higher expression patterns of LC3-II and lower expression patterns of p62 on cisplatin-resistant BLCA cells with comparing to wild-type cells, and the quantitative results also show the significant upregulation of LC3-II and p62 expression on T24R cell with comparing to wild type group. (Fig. 4 4 4 4 Effects of Autophagy inhibition on ABCC6 expression To further confirm the connection between ABCC6 and autophagy, we also use the autophagy inhibitor on cisplatin-resistant BLCA cell. The experimental data presented in this image reveal significantly lower variations in ABCC6 mRNA expression after the BafA1 and CQ treatments on cisplatin-resistant T24 and UMUC3 cells (Fig. 5 5 5 Discussion It is well known that drugs resistance is a significant challenge in the treatment of various cancers. In BLCA, drug resistance also is a significant barrier to effective treatment, especially cisplatin chemotherapy. Although, cisplatin is still important in the treatment of BLCA. Once BLCA progresses to the metastatic stage, only 35% of metastatic BLCA patients initially respond to cisplatin chemotherapy. Furthermore, the majority of BLCA patients who initially exhibit sensitivity to cisplatin eventually develop resistance 22 23 Drug efflux transporters, such as P-glycoprotein (P-gp) and similar proteins, play a pivotal role in chemotherapy failure by actively removing anticancer drugs from cells. Among these, ATP-binding cassette (ABC) transporters constitute a large family of membrane proteins that harness energy from ATP hydrolysis to transport a diverse range of substrates across cellular membranes 13 24 15 Moreover, much research indicated that drug resistance can induce autophagy as a cellular response to stress 25 27 28 29 30 30 31 32 Our previous study indicated that target to autophagy with influencing the related marker, such as LC3-II, ATG5, ATG12 and p62 protein expression can improve the progression of BLCA via regulating micro-RNA expression of BLAC, such as hsa-miR-30a-3p or hsa-miR-34 33 34 27 35 in vivo Conclusion In conclusion, we determined that cisplatin could promote ABCC6 transporter expression to contribute the cisplatin resistance on BLCA (Fig. 6 Funding This study was supported by Shin Kong Wu Ho-Su Memorial Hospital (Grant No. 2022SKHBDR002, 2022SKHBDR001, and 2024SKHBND001). Data availability statement The data presented in this study are available on request from the corresponding authors. Author contributions Kuang‑Yu Chou, An-Chen Chang, Thomas I‑Sheng Hwang conceived and designed the experiments. Kuang‑Yu Chou, An-Chen Chang, Hsiu-Wen Liu, and performed the experiments. Te‑Fu Tsai, Chao‑Yen Ho, Hsiu-Wen Liu collected and analyzed the results. Thomas I‑Sheng Hwang, Te‑Fu Tsai, Chao‑Yen Ho provided the materials. Kuang‑Yu Chou, An-Chen Chang, Thomas I‑Sheng Hwang, Te‑Fu Tsai, Chih-Hsin Tang and Yen-You Lin supervised the project. Kuang‑Yu Chou, An-Chen Chang, David Achudhan, and Yen-You Lin wrote the manuscript. All authors agreed to the published version of the manuscript. 1 Halaseh SA Halaseh S Alali Y Ashour ME Alharayzah MJ A Review of the Etiology and Epidemiology of Bladder Cancer: All You Need To Know Cureus 2022 14 e27330 36042998 10.7759/cureus.27330 PMC9411696 2 Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 229 63 38572751 10.3322/caac.21834 3 Cumberbatch MGK Jubber I Black PC Esperto F Figueroa JD Kamat AM Epidemiology of Bladder Cancer: A Systematic Review and Contemporary Update of Risk Factors in 2018 European Urology 2018 74 784 95 30268659 10.1016/j.eururo.2018.09.001 4 Leslie SW Soon-Sutton TL Aeddula NR Bladder Cancer StatPearls. Treasure Island (FL) ineligible companies. Disclosure: Taylor Soon-Sutton declares no relevant financial relationships with ineligible companies. Disclosure: Narothama Aeddula declares no relevant financial relationships with ineligible companies 2024 5 Cho SW Lim SH Kwon GY Kim CK Park W Pyo H Neoadjuvant Cisplatin-Based Chemotherapy Followed by Selective Bladder Preservation Chemoradiotherapy in Muscle-Invasive Urothelial Carcinoma of the Bladder: Post Hoc Analysis of Two Prospective Studies Cancer Res Treat 2024 56 893 7 38374699 10.4143/crt.2024.015 PMC11261190 6 Florea A-M Büsselberg D Cisplatin as an Anti-Tumor Drug: Cellular Mechanisms of Activity, Drug Resistance and Induced Side Effects Cancers 2011 3 1351 71 24212665 10.3390/cancers3011351 PMC3756417 7 Dasari S Bernard Tchounwou P Cisplatin in cancer therapy: Molecular mechanisms of action European Journal of Pharmacology 2014 740 364 78 25058905 10.1016/j.ejphar.2014.07.025 PMC4146684 8 Galanski MS Recent Developments in the Field of Anticancer Platinum Complexes Recent Pat Anticancer Drug Discov 2006 1 285 95 18221042 10.2174/157489206777442287 9 Fotopoulou E Titilas I Ronconi L Metallodrugs as Anticancer Chemotherapeutics and Diagnostic Agents: A Critical Patent Review (2010-2020) Recent Pat Anticancer Drug Discov 2022 17 42 54 34493191 10.2174/1574892816666210907101146 10 Li F Zheng Z Chen W Li D Zhang H Zhu Y Regulation of cisplatin resistance in bladder cancer by epigenetic mechanisms Drug Resist Updat 2023 68 100938 36774746 10.1016/j.drup.2023.100938 11 Buttigliero C Tucci M Vignani F Scagliotti GV Di Maio M Molecular biomarkers to predict response to neoadjuvant chemotherapy for bladder cancer Cancer Treat Rev 2017 54 1 9 28135623 10.1016/j.ctrv.2017.01.002 12 Shi ZD Hao L Han XX Wu ZX Pang K Dong Y Targeting HNRNPU to overcome cisplatin resistance in bladder cancer Mol Cancer 2022 21 37 35130920 10.1186/s12943-022-01517-9 PMC8819945 13 Kang J Park J Choi H Burla B Kretzschmar T Lee Y Plant ABC Transporters Arabidopsis Book 2011 9 e0153 22303277 10.1199/tab.0153 PMC3268509 14 Wu C Chakrabarty S Jin M Liu K Xiao Y Insect ATP-Binding Cassette (ABC) Transporters: Roles in Xenobiotic Detoxification and Bt Insecticidal Activity Int J Mol Sci 2019 20 10.3390/ijms20112829 PMC6600440 31185645 15 Sun YL Patel A Kumar P Chen ZS Role of ABC transporters in cancer chemotherapy Chin J Cancer 2012 31 51 7 22257384 10.5732/cjc.011.10466 PMC3777472 16 Couture L Nash JA Turgeon J The ATP-binding cassette transporters and their implication in drug disposition: a special look at the heart Pharmacol Rev 2006 58 244 58 16714487 10.1124/pr.58.2.7 17 Kelland L The resurgence of platinum-based cancer chemotherapy Nat Rev Cancer 2007 7 573 84 17625587 10.1038/nrc2167 18 Myint K Li Y Paxton J McKeage M Multidrug Resistance-Associated Protein 2 (MRP2) Mediated Transport of Oxaliplatin-Derived Platinum in Membrane Vesicles PLoS One 2015 10 e0130727 26131551 10.1371/journal.pone.0130727 PMC4488857 19 Barr MP Gray SG Hoffmann AC Hilger RA Thomale J O'Flaherty JD Generation and characterisation of cisplatin-resistant non-small cell lung cancer cell lines displaying a stem-like signature PLoS One 2013 8 e54193 23349823 10.1371/journal.pone.0054193 PMC3547914 20 Tsai TF Hwang TI Chen PC Chen YC Chou KY Ho CY Hyperthermia reduces cancer cell invasion and combats chemoresistance and immune evasion in human bladder cancer Int J Oncol 2024 65 10.3892/ijo.2024.5704 PMC11575926 39513598 21 Lin YY Huang CC Ko CY Tsai CH Chang JW Achudhan D Omentin-1 modulates interleukin expression and macrophage polarization: Implications for rheumatoid arthritis therapy Int Immunopharmacol 2025 149 114205 39908806 10.1016/j.intimp.2025.114205 22 Li F Zheng Z Chen W Li D Zhang H Zhu Y Regulation of cisplatin resistance in bladder cancer by epigenetic mechanisms Drug Resistance Updates 2023 68 100938 36774746 10.1016/j.drup.2023.100938 23 Takeyama Y Kato M Tamada S Azuma Y Shimizu Y Iguchi T Myeloid-derived suppressor cells are essential partners for immune checkpoint inhibitors in the treatment of cisplatin-resistant bladder cancer Cancer Letters 2020 479 89 99 32200039 10.1016/j.canlet.2020.03.013 24 Wu C Chakrabarty S Jin M Liu K Xiao Y Insect ATP-Binding Cassette (ABC) Transporters: Roles in Xenobiotic Detoxification and Bt Insecticidal Activity International Journal of Molecular Sciences 2019 20 2829 31185645 10.3390/ijms20112829 PMC6600440 25 Yang Y Liu L Tian Y Gu M Wang Y Ashrafizadeh M Autophagy-driven regulation of cisplatin response in human cancers: Exploring molecular and cell death dynamics Cancer Letters 2024 587 216659 38367897 10.1016/j.canlet.2024.216659 26 Sui X Chen R Wang Z Huang Z Kong N Zhang M Autophagy and chemotherapy resistance: a promising therapeutic target for cancer treatment Cell Death Dis 2013 4 e838 24113172 10.1038/cddis.2013.350 PMC3824660 27 Chang H Zou Z Targeting autophagy to overcome drug resistance: further developments Journal of Hematology & Oncology 2020 13 159 33239065 10.1186/s13045-020-01000-2 PMC7687716 28 Chang H Zou Z Targeting autophagy to overcome drug resistance: further developments J Hematol Oncol 2020 13 159 33239065 10.1186/s13045-020-01000-2 PMC7687716 29 Kovale L Singh MK Kim J Ha J Role of Autophagy and AMPK in Cancer Stem Cells: Therapeutic Opportunities and Obstacles in Cancer Int J Mol Sci 2024 25 10.3390/ijms25168647 PMC11354724 39201332 30 Rahman MA Apu EH Rakib-Uz-Zaman SM Chakraborti S Bhajan SK Taleb SA Exploring Importance and Regulation of Autophagy in Cancer Stem Cells and Stem Cell-Based Therapies Cells 2024 13 10.3390/cells13110958 PMC11171866 38891090 31 Sun Y Liu X Tong H Yin H Li T Zhu J SIRT1 Promotes Cisplatin Resistance in Bladder Cancer via Beclin1 Deacetylation-Mediated Autophagy Cancers (Basel) 2023 16 10.3390/cancers16010125 PMC10778480 38201552 32 Mao X Nanzhang Xiao J Wu H Ding K Hypoxia-Induced Autophagy Enhances Cisplatin Resistance in Human Bladder Cancer Cells by Targeting Hypoxia-Inducible Factor-1α J Immunol Res 2021 2021 8887437 33681390 10.1155/2021/8887437 PMC7904373 33 Hwang TI Chen PC Tsai TF Lin JF Chou KY Ho CY Hsa-miR-30a-3p overcomes the acquired protective autophagy of bladder cancer in chemotherapy and suppresses tumor growth and muscle invasion Cell Death Dis 2022 13 390 35449123 10.1038/s41419-022-04791-z PMC9023440 34 Hwang TI Cuiu YC Chen YC Chen PC Tsai TF Chou KY Tumor suppressive functions of hsa-miR-34a on cell cycle, migration and protective autophagy in bladder cancer Int J Oncol 2023 62 10.3892/ijo.2023.5514 PMC10147313 37083075 35 Hassan AMIA Zhao Y Chen X He C Blockage of Autophagy for Cancer Therapy: A Comprehensive Review International Journal of Molecular Sciences 2024 25 7459 39000565 10.3390/ijms25137459 PMC11242824 Figure 1 Comparative Analysis of Cisplatin Resistance in T24 and UMUC3 BLCA Cells. (A&B) (C&D) p Figure 2 The Role of ABC Transporters in Cisplatin Resistance of T24 and UMUC3 BLCA Cells. (A) (B) (C) (D) (E) (F) p p p p Figure 3 The Role of ABCC6 in Cisplatin Resistance of T24 and UMUC3 BLCA Cells. (A) (B) (C) (D) p p p p Figure 4 Comparative Analysis of Autophagy and Protein Expression in Cisplatin-Resistant T24 and UMUC3 BLCA Cells. (A) (B) (C) (D) (E) (F) p p p p Figure 5 The Role of ABCC6 in Drug Resistance of BLCA Cells. (A) (B) (C) (D) (E) (F) p p p p Figure 6 Mechanism of Cisplatin Resistance Mediated by ABCC6 Transporters. Table 1 Primer sequences for qPCR Forward primers (5' to 3') Reverse primers (5' to 3') AGGACACGTCGGAACAAGTC GGAAGTAGGGCCCAAAGGTC CACAGTTTGTGCTGTCCTGC CCAAGCGACCAGAGGTCTTT CCTAGTGCTGACCGTGTTGT TAGGTTGGCTGCAGTCTGTG CGTGGTTGGAAGCTAACCCT TGCTGCCAAGACCTCTTCAG TGATAAATGGAGCACCGCGA GCCAGTTGTAGGCTCATCCA CTGGGCTACACTGAGCACC AAGTGGTCGTTGAGGGCAATG ",
  "metadata": {
    "Title of this paper": "Blockage of Autophagy for Cancer Therapy: A Comprehensive Review",
    "Journal it was published in:": "International Journal of Medical Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12492370/"
  }
}