{
  "title": "Paper_1210",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472779 PMC12472779.1 12472779 12472779 41011424 10.3390/microorganisms13092092 microorganisms-13-02092 1 Article Fatal Pneumonia Caused by Beauveria bassiana Lepidochelys kempii Beauveria https://orcid.org/0000-0003-1179-251X Marques Gonçalo N. 1 https://orcid.org/0000-0002-9339-9932 Lopes Ricardo 2 3 4 Peleteiro Maria Conceição 5 https://orcid.org/0009-0003-1324-8902 Bento Jaqueline T. 6 https://orcid.org/0000-0001-8769-8103 Mesquita João R. 6 7 8 https://orcid.org/0000-0002-0696-7322 dos Santos Fábio Abade 9 https://orcid.org/0000-0002-4405-0240 Delgado Leonor 4 10 11 https://orcid.org/0000-0002-7196-4179 Coelho Ana Cláudia 8 12 Lourenço Miguel 1 https://orcid.org/0009-0008-7856-5606 Leal Miriam 1 13 14 Lopes Virgínia 6 15 Castro Ana Paula 6 15 Barny Rita 1 Guerra Joana 1 https://orcid.org/0000-0001-5363-0629 Urbani Nuno 1 Nunes Antonieta 1 Santos Yohann 1 Gaspar Isabel 1 https://orcid.org/0000-0001-7940-3141 Garcês Andreia 8 16 * https://orcid.org/0000-0002-9404-0745 Neves João 1 Derome Nicolas Academic Editor Bressan Waller Stefanie Academic Editor 1 goncalo.marques@zoomarine.pt miguel.lourenco@zoomarine.pt ritab@zoomarine.pt joana.silva@zoomarine.pt nuno.urbani@zoomarine.pt antonieta.nunes@zoomarine.pt yohann.santos@zoomarine.pt isabel.gaspar@zoomarine.pt joao.neves@zoomarine.pt 2 lopes.rmv@gmail.com 3 4 leonordelgado@inno.pt 5 6 jtbento@icbas.up.pt gilopes61@gmail.com 7 8 accoelho@utad.pt 9 fabio.abade@iniav.pt 10 11 12 13 14 15 16 * andreiamvg@gmail.com 08 9 2025 9 2025 13 9 496716 2092 29 7 2025 28 8 2025 06 9 2025 08 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The Kemp’s ridley sea turtle ( Lepidochelys kempii L. kempii Beauveria bassiana L. kempii Beauveria bassiana fungi Kemp’s ridley sea turtle Lepidochelys kempii pneumonia Portugal This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The Kemp’s ridley sea turtle ( Lepidochelys kempii 1 2 L. kempii 3 4 1 5 6 L. kempii 7 8 9 10 1 Infectious diseases are key contributors to morbidity and mortality in sea turtles, particularly in individuals undergoing environmental stress, injury, or rehabilitation [ 11 12 12 Purpureocillium, Fusarium Trichoderma Beauveria Candida Penicillium Mucor Colletotrichum 12 13 14 15 Entomopathogenic fungi from the genera Beauveria Metarhizium 15 Caretta caretta Chelonia mydas L. kempii 15 16 15 17 12 This case describes a rare occurrence of a juvenile L. kempii L. kempii Beauveria bassiana B. bassiana B. bassiana 2. Materials and Methods 2.1. Review on Beauveria bassiana Infections in Reptiles A comprehensive literature review was conducted to identify documented cases of Beauveria bassiana Beauveria bassiana Beauveria 2.2. Clinical Case: Kemp’s Ridley Sea Turtle In May 2024, a juvenile Kemp’s ridley sea turtle was recovered off the coast of Sines, Portugal. The specimen was subsequently transported to Porto d’Abrigo, the wildlife rehabilitation centre of Zoomarine, Portugal, for clinical evaluation and treatment. Upon admission, standard intake protocols were followed, including biometric measurements, physical examination, blood analyses, and diagnostic imaging. Blood samples were obtained from the dorsal cervical vessels and immediately transferred into lithium heparin tubes. Both total erythrocyte and leukocyte counts were performed manually, in which a 5 µL blood-filled pipette was inserted into a Natt-Herricks-TIC ® ® 2.2.1. Postmortem Examination and Sample Preparation A complete necropsy was conducted shortly after the animal’s death. Representative tissue samples were collected and fixed in 10% neutral buffered formalin for histopathological evaluation [ 18 2.2.2. Microbiological Analysis and Antifungal Susceptibility Testing Lung tissue samples were directly inoculated onto Sabouraud Dextrose Chloramphenicol Agar (Frilabo, Maia, Portugal), incubated at both 25 °C and 37 °C, and observed daily for the development of fungal colonies. Phenotypic identification of fungal isolates was based on both macroscopic and microscopic characteristics. Macroscopic evaluation included assessment of colony growth rate, topography, texture, surface and reverse pigmentation, and the presence and colour of any diffusible pigment. Microscopic identification was performed by examining hyphal features—colour, size, septation, and structure—and conidial characteristics, including septation, shape, size, colour, wall texture, arrangement, and the morphology and development of conidiogenous cells, using Lactophenol Cotton Blue stain (Labkem, Barcelona, Spain) [ 19 20 Antifungal susceptibility testing of the fungal isolate was performed using the E-test (MIC Test Strip, Liofilchem ® 21 2.2.3. Molecular Analysis of Fungi For molecular fungal identification, DNA extraction was performed by scraping off the mycelium from the cultured colonies and diluting it (10%) in ATL buffer. The mixtures were incubated at 100 °C for 10 min, followed by centrifugation at 8000× g 22 23 PCR reactions were performed on a thermocycler (Bio-Rad, Hercules, CA, USA). Reaction mixtures were prepared using SpeedySupreme NZYTaq 2x Green Master Mix (NZYTech, Lisbon, Portugal) following the manufacturer’s instructions. PCR conditions included an initial denaturation at 95 °C for 5 min, followed by 35 cycles at 94 °C for 30 s, 55 °C for 30 s, and 72 °C for 1 min, ending with a final extension at 72 °C for 10 min. Following PCR amplification, DNA fragments were separated by electrophoresis on 1.5% agarose gels stained with Xpert Green Safe DNA gel dye (GRiSP ® ® https://blast.ncbi.nlm.nih.gov/Blast.cgi?PROGRAM=blastn&PAGE_TYPE=BlastSearch&LINK_LOC=blasthome Beauveria bassiana 2.2.4. Virological Analysis For virological analysis, lung and liver samples were homogenised separately at 20% ( w v g 24 25 26 3. Beauveria bassiana Beauveria bassiana Beauveria 27 Bombyx mori 28 Cordyceps bassiana 29 B. bassiana 30 31 32 Figure 1 33 Though B. bassiana 15 29 31 Table 1 B. bassiana Table 1 15 Although the exact pathogenesis in ectothermic vertebrates remains unclear, several predisposing factors have been suggested. Environmental exposure to contaminated substrates, compromised immunity, and the reptile’s thermoregulatory biology are considered major contributors [ 15 12 B. bassiana 39 40 Alligator mississippiensis 34 Testudo elephantopus 36 Trachemys scripta 39 B. bassiana 33 Histologically, these infections often display extensive granulomatous inflammation, with abundant hyphae and conidia observed in tissue sections [ 34 16 37 34 4. Clinical Case: Kemp’s Ridley Sea Turtle A juvenile Kemp’s ridley sea turtle ( Lepidochelys kempii 3 4 41 Figure 2 The turtle was initially housed in a low-level freshwater tank for 24 h to facilitate monitoring, and was then transferred to a 2 m-diameter, 1.9 m-deep seawater tank (6 m 3 42 Comprehensive medical care involved physical examinations, serial blood analyses (haematology and biochemistry), radiographic imaging, and microbiological cultures of the carapace lesions. Haematological data revealed a progressive decline in haematocrit levels (day 0: 28%; day 10: 7%) and hypoalbuminemia (day 0: 0.6 g/dL; day 10: 0.2 g/dL). Elevated levels of creatine kinase (CK) and aspartate aminotransferase (AST) were observed (CK—day 0: 5852 U/L; day 10: 2346 U/L and AST—day 0: 268 U/L; day 10: 417 U/L), along with persistent hyperphosphatemia (day 0: 11.2 mg/dL; day 10: 9.0 mg/dL). Notably, sustained hyperglycaemia was documented: 151 mg/dL (day 0); 144 mg/dL (day 2); 256 mg/dL (day 3); 225 mg/dL (day 4); 251 mg/dL (day 7); and 332 mg/dL (day 10). Radiographic evaluation showed diffuse increased pulmonary opacity, most pronounced in the right lung, along with ill-defined focal opacities in the left lung field ( Figure 3 Shewanella algae Citrobacter gillenii Mucor The therapeutic protocol included normobaric oxygen therapy, fluid support, and administration of marbofloxacin (2 mg/kg IM, SID), ketoprofen (2 mg/kg SC, SID), tramadol (5 mg/kg IM, every other day), iron dextran (5 mg/kg SC, twice weekly), and inhalation therapy with nebulised F10 SC ® Postmortem findings included diffuse areas of pulmonary congestion and oedema, along with multiple firm and whitish coalescing granules in the lungs, from 0.1 to 2.0 cm in diameter ( Figure 4 Figure 5 Fungal culture of lung samples incubated at 25 °C produced rapid growth of cottony, white colonies with slightly irregular margins by day 4 ( Figure 6 Figure 6 Beauveria Antifungal susceptibility testing was performed using the E-test method (MIC Test Strip, Liofilchem ® Bacterial cultures from lung tissue were also performed, showing the presence of Vagococcus fluvialis Pseudomonas putida Citrobacter gillenii. V. fluvialis Aeromonas media V. fluvialis. Concerning molecular fungal identification, BLAST analysis of the 18S rRNA region (sequence PV39115) confirmed the isolate as belonging to the genus Beauveria PV368950 B. bassiana MZ956767 Virological screening of liver and lung samples for herpesvirus, adenovirus, and paramyxovirus by PCR was performed in duplicate and yielded negative results. 5. Discussion The presence of Kemp’s ridley sea turtles ( L. kempii) 43 5 3 5 3 5 44 1 44 1 45 46 6 Avens and Dell’Amico (2018) [ 44 1 One such infection was attributed to Beauveria bassiana 47 B. bassiana 13 34 39 B. bassiana 12 37 In this rescued individual, the entry route for B. bassiana 48 48 L. kempii 48 Histopathology revealed bronchial and interstitial pneumonia with septate hyphae. The presence of septate fungal elements, demonstrated by PAS staining, confirmed the infection by B. bassiana 32 B. bassiana Mucor B. bassiana 49 Mucor Importantly, antifungal susceptibility testing, such as the E-test method, remains underutilised in sea turtle medicine, despite its critical role in guiding targeted therapy for fungal infections. The E-tests enable determination of minimum inhibitory concentrations (MICs) for antifungal agents, including voriconazole, itraconazole, amphotericin B, and posaconazole, drugs with potential clinical relevance in reptile and wildlife medicine. In the present study, the isolate demonstrated high resistance to fluconazole and amphotericin B (MICs > 256 µg/mL) but was susceptible to itraconazole (0.047 µg/mL) and voriconazole (0.004 µg/mL). These findings are consistent with previous reports, in which B. bassiana 12 15 12 The concurrent bacterial isolates from pulmonary tissue— Vagococcus fluvialis Pseudomonas putida Citrobacter gillenii 50 V. fluvialis P. putida Citrobacter 51 V. fluvialis 52 53 V. fluvialis 54 55 56 57 58 59 Recent literature further supports a rising prevalence of fungal infections in sea turtles, particularly among Kemp’s ridley sea turtles. Mastrostefano et al. (2024) [ 12 This case underscores the complex interplay between climate, oceanography, and emerging pathogens, reinforcing the need for a One Health approach in sea turtle conservation. It also highlights the importance of including fungal aetiology—often underdiagnosed or mistaken for bacterial or viral causes—in the diagnostic workup of debilitated sea turtles, particularly when clinical deterioration persists despite antibiotic therapy. Integration of molecular diagnostics, culture-based methods, and antifungal susceptibility testing can guide targeted therapy, potentially improving rehabilitation outcomes and advancing wildlife health management. 6. Conclusions Although rare, the occurrence of Kemp’s ridley sea turtles ( L. kempii) Beauveria bassiana B. bassiana Disclaimer/Publisher’s Note: Author Contributions Conceptualisation, G.N.M., A.C.C.; methodology, G.N.M., R.L., M.C.P., J.T.B., J.R.M., F.A.d.S., L.D., M.Le. (Miriam Leal), V.L., A.P.C., R.B., J.G., N.U., A.N., Y.S., and A.G.; software, G.N.M.; validation, G.N.M.; formal analysis, G.N.M.; investigation, G.N.M., R.L., M.C.P., J.T.B., J.R.M., F.A.d.S., L.D., M.Le. (Miriam Leal), V.L., A.P.C., R.B., A.N., Y.S., I.G., and A.G.; data curation, G.N.M.; writing—original draft preparation, G.N.M., R.L., J.T.B., J.R.M., F.A.d.S., M.Lo. (Miguel Lourenço), Y.S., A.G., and J.N.; writing—review and editing, G.N.M., R.L., M.C.P., J.T.B., J.R.M., F.A.d.S., L.D., A.C.C., M.Lo. (Miguel Lourenço), M.Le. (Miriam Leal), V.L., A.P.C., R.B., J.G., N.U., A.N., Y.S., I.G., A.G., and J.N.; visualisation, G.N.M., R.L., M.C.P., J.T.B., R.B., and A.G.; project administration, G.N.M.; funding acquisition, G.N.M., R.L., A.G., and J.N. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethical review and approval were waived for this study due to the nature of the research, which mainly involved postmortem studies of a deceased wild animal that died during the rehabilitation process. No experimental procedures were conducted on the animal while alive for research. All procedures in vivo were performed as part of the routine clinical management in a rehabilitation context. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. Covelo P. Nicolau L. López A. Four New Records of Stranded Kemp’s Ridley Turtle Lepidochelys kempii Mar. Biodivers. Rec. 2016 9 80 10.1186/s41200-016-0079-5 2. The IUCN Red List of Threatened Species Available online: https://www.iucnredlist.org/en (accessed on 1 June 2025) 3. Putman N.F. Mansfield K.L. He R. Shaver D.J. Verley P. Predicting the Distribution of Oceanic-Stage Kemp’s Ridley Sea Turtles Biol. Lett. 2013 9 20130345 10.1098/rsbl.2013.0345 23945206 PMC3971672 4. Wallace B.P. DiMatteo A.D. Bolten A.B. Chaloupka M.Y. Hutchinson B.J. Abreu-Grobois F.A. Mortimer J.A. Seminoff J.A. Amorocho D. Bjorndal K.A. Global Conservation Priorities for Marine Turtles PLoS ONE 2011 6 e24510 10.1371/journal.pone.0024510 21969858 PMC3182175 5. Caillouet C. Jr. Gallaway B. Kemp’s Ridley Sea Turtle Emigration and Immigration Between the Gulf of Mexico and North Atlantic Ocean Should Not Be Ignored In Age-Structured Population Modeling Mar. Turt. Newsl. 2020 161 9 14 6. Manral D. Bos I. de Boer M. van Sebille E. Modelling Drift of Cold-Stunned Kemp’s Ridley Turtles Stranding on the Dutch Coast Open Res. Eur. 2024 4 41 10.12688/openreseurope.16913.2 39309191 PMC11415756 7. Fernández de la Cigoña Núñez E. Cíes y Ons: La Ruta de Las Islas: (Guía de Campo Para Una Visita Provechosa) Naturaleza gallega; 4 Asociación Gallega para la Cultura y la Ecología (AGCE) Vigo, Spain 1991 978-84-404-8631-8 8. Faraldo R. Galán P. Lepidochelys kempii Tortuga golfina Bol. Asoc. Herpetológica Esp. 1999 10 17 9. Orós J. Delgado C. Fernández L. Jensen H. Pulmonary Hyalohyphomycosis Caused by Fusarium Lepidochelys kempi N. Z. Vet. J. 2004 52 150 152 10.1080/00480169.2004.36420 15768112 10. Dellinger T. Tartarugas Marinhas Atlas dos Anfíbios e Répteis de Portugal Esfera do Caos Setúbal, Portugal 2010 188 205 978-989-680-005-5 11. Innis C. Nyaoke A.C. Williams C.R. Dunnigan B. Merigo C. Woodward D.L. Weber E.S. Frasca S. Pathologic and Parasitologic Findings of Cold-Stunned Kemp’s Ridley Sea Turtles ( Lepidochelys kempii J. Wildl. Dis. 2009 45 594 610 10.7589/0090-3558-45.3.594 19617470 12. Mastrostefano A.A. Frasca S. Jr. Stacy B.A. Wickes B.L. Wiederhold N.P. Cañete-Gibas C.F. Stacy N.I. Beck S. Tuxbury K.A. Joblon M.J. Clinical Observations, Identification, and Antimicrobial Susceptibility of Fungi Isolated from Sea Turtles with Histologically Confirmed Mycotic Infections: 20 Cases, 2005–2020 J. Herpetol. Med. Surg. 2024 34 53 69 10.5818/JHMS-D-23-00007 13. Manire C.A. Rhinehart H.L. Sutton D.A. Thompson E.H. Rinaldi M.G. Buck J.D. Jacobson E. Disseminated Mycotic Infection Caused by Colletotrichum Acutatum in a Kemp’s Ridley Sea Turtle ( Lepidochelys kempi J. Clin. Microbiol. 2002 40 4273 4280 10.1128/JCM.40.11.4273-4280.2002 12409409 PMC139682 14. Orós J. Torrent A. Calabuig P. Déniz S. Diseases and Causes of Mortality among Sea Turtles Stranded in the Canary Islands, Spain (1998–2001) Dis. Aquat. Organ. 2005 63 13 24 10.3354/dao063013 15759796 15. Horgan M.D. Alexander A.B. Innis C. Stacy B.A. Gai J.J. Pesavento P.A. Highland M.A. Liguori B.L. Norton T.M. Wellehan J.F.X. PULMONARY AND COELOMIC MYCOSES DUE TO METARHIZIUM AND BEAUVERIA SPECIES IN REPTILES J. Zoo Wildl. Med. 2022 53 605 612 10.1638/2021-0081 36214247 16. Schmidt V. Klasen L. Schneider J. Hübel J. Cramer K. Pulmonary Fungal Granulomas and Fibrinous Pneumonia Caused by Different Hypocrealean Fungi in Reptiles Vet. Microbiol. 2018 225 58 63 10.1016/j.vetmic.2018.09.008 30322534 17. Lo C. Kang C.-L. Sun P.-L. Yu P.-H. Li W.-T. Disseminated Fungal Infection and Fungemia Caused by Trichosporon asahii Basiliscus plumifrons J. Fungi Basel Switz. 2021 7 1003 10.3390/jof7121003 PMC8707992 34946986 18. Garcês A. Pires I. Manual de Técnicas de Necrópsia Em Animais Selvagens 1st ed. Artelogy Munich, Germany 2017 978-989-770-858-9 19. Azar M.M. Larone’s Medically Important Fungi: A Guide to Identification, 7th Edition Emerg. Infect. Dis. 2024 30 625 626 10.3201/eid3003.231623 20. Quinn P.J. Markey J.F. Leonard F.C. Fanning S. Fitzpatrick E.S. Veterinary Microbiology and Microbial Disease 2nd ed. Wiley-Blackwell Hoboken, NJ, USA 2011 978-1-4051-5823-7 21. Clinical & Laboratory Standards Institute|CLSI Available online: https://clsi.org/ (accessed on 19 July 2025) 22. Real-Time Application of ITS and D1-D3 Nanopore Amplicon Metagenomic Sequencing in Fungal Infections: Enhancing Fungal Infection Diagnostics—PubMed Available online: https://pubmed.ncbi.nlm.nih.gov/39029415/ (accessed on 21 July 2025) 10.1016/j.ijmm.2024.151630 39029415 23. Xiao L. Escalante L. Yang C. Sulaiman I. Escalante A.A. Montali R.J. Fayer R. Lal A.A. Phylogenetic Analysis of Cryptosporidium Parasites Based on the Small-Subunit rRNA Gene Locus Appl. Environ. Microbiol. 1999 65 1578 1583 10.1128/AEM.65.4.1578-1583.1999 10103253 PMC91223 24. VanDevanter D.R. Warrener P. Bennett L. Schultz E.R. Coulter S. Garber R.L. Rose T.M. Detection and Analysis of Diverse Herpesviral Species by Consensus Primer PCR J. Clin. Microbiol. 1996 34 1666 1671 10.1128/jcm.34.7.1666-1671.1996 8784566 PMC229091 25. Kessler H.H. Mühlbauer G. Rinner B. Stelzl E. Berger A. Dörr H.W. Santner B. Marth E. Rabenau H. Detection of Herpes Simplex Virus DNA by Real-Time PCR J. Clin. Microbiol. 2000 38 2638 2642 10.1128/JCM.38.7.2638-2642.2000 10878056 PMC86985 26. Kajon A.E. Adenovirus Infections: New Insights for the Clinical Laboratory J. Clin. Microbiol. 2024 62 e00836-22 10.1128/jcm.00836-22 PMC11389149 39189703 27. Holder D.J. Kirkland B.H. Lewis M.W. Keyhani N.O. Surface Characteristics of the Entomopathogenic Fungus Beauveria (Cordyceps) Bassiana Microbiology 2007 153 3448 3457 10.1099/mic.0.2007/008524-0 17906143 28. Wang C. Shah F.A. Patel N. Li Z. Butt T.M. Molecular Investigation on Strain Genetic Relatedness and Population Structure of Beauveria bassiana Environ. Microbiol. 2003 5 908 915 10.1046/j.1462-2920.2003.00485.x 14510844 29. Lee J.-O. Shrestha B. Sung G.-H. Han S.-K. Sung J.-M. Successful Development of Cordyceps Bassiana Stromata from Beauveria bassiana Mycobiology 2010 38 13 16 10.4489/MYCO.2010.38.1.013 23956619 PMC3741589 30. Walstad J.D. Anderson R.F. Stambaugh W.J. Effects of Environmental Conditions on Two Species of Muscardine Fungi ( Beauveria bassiana Metarrhizium anisopliae J. Invertebr. Pathol. 1970 16 221 226 10.1016/0022-2011(70)90063-7 31. Park S.K. Jeong C.Y. Kwon H.G. Lee J.H. Kang S.K. Kim S.-W. Kim S.-R. Park J.W. Isolation and Identification of Insect Pathogenic Fungus from Silkworms with Suspected White Muscardine Disease. EBSCOhost Available online: https://openurl.ebsco.com/contentitem/doi:10.7852%2Fijie.2024.48.1.42?sid=ebsco:plink:crawler&id=ebsco:doi:10.7852%2Fijie.2024.48.1.42 (accessed on 19 July 2025) 32. Kumar V. Singh G.P. Babu A.M. Ahsan M.M. Datta R.K. Germination, Penetration, and Invasion of Beauveria bassiana Ital. J. Zool. 1999 66 39 43 10.1080/11250009909356235 33. Mascarin G.M. Jaronski S.T. The Production and Uses of Beauveria bassiana World J. Microbiol. Biotechnol. 2016 32 177 10.1007/s11274-016-2131-3 27628337 34. Fromtling R.A. Kosanke S.D. Jensen J.Μ. Bulmer G.S. Fatal Beauveria bassiana J. Am. Vet. Med. Assoc. 1979 175 934 936 10.2460/javma.1979.175.09.934 521377 35. Yang E. Tibpromma S. Dai D. Promputtha I. Mortimer P. Karunarathna S. Three Interesting Fungal Species Associated with the Asian House Gecko in Kunming, China Phytotaxa 2022 545 37 56 10.11646/phytotaxa.545.1.3 36. Georg L.K. Williamson W.M. Tilden E.B. Getty R.E. Mycotic Pulmonary Disease of Captive Giant Tortoises Due to Beauveria bassiana Paecilomyces fumoso-roseus Sabouraudia 1963 2 80 86 10.1080/00362176385190161 37. Ferreira-Machado E. Navas-Suárez P.E. Ervedosa T.B. Figueiredo K.B. de Carvalho A.C.S.R. Takahashi J.P.F. Kimura L.M. de Araújo L.J.T. de Azevedo Fernandes N.C.C. Sanches T.C. Infections by Entomopathogenic Fungi in Common Green Iguanas ( Iguana iguana J. Comp. Pathol. 2023 201 16 22 10.1016/j.jcpa.2022.12.006 36646035 38. Innis C.J. Ceresia M.L. Merigo C. Scott Weber Iii E. Papich M.G. Single-Dose Pharmacokinetics of Ceftazidime and Fluconazole during Concurrent Clinical Use in Cold-Stunned Kemp’s Ridley Turtles ( Lepidochelys kempii J. Vet. Pharmacol. Ther. 2012 35 82 89 10.1111/j.1365-2885.2011.01290.x 21470246 39. Cabo J.F.G. Serrano J.E. Asensio M.C.B. Mycotic Pulmonary Disease by Beauveria bassiana Mycoses 1995 38 167 169 10.1111/j.1439-0507.1995.tb00043.x 7477096 40. Klynova O. Zinenko O. Isolation of the Entomopathogenic Fungus Beauveria bassiana Vipera berus nikolskii J. Comp. Pathol. 2024 210 5 7 10.1016/j.jcpa.2024.02.004 38458014 41. Bjorndal K. Bolten A. Martins H. Somatic Growth Model of Juvenile Loggerhead Sea Turtles Caretta Caretta: Duration of Pelagic Stage Mar. Ecol.-Prog. Ser. 2000 202 265 272 10.3354/meps202265 42. Marine Turtle Trauma Response Procedures: A Husbandry Manual Available online: https://dukespace.lib.duke.edu/items/0d87e68e-e422-4abf-b96f-a5fb2e764339 (accessed on 19 July 2025) 43. Pamela T. Plotkin P.D. Biology and Conservation of Ridley Sea Turtles Johns Hopkins University Press Baltimore, MD, USA 2007 978-0-8018-8611-9 44. Avens L. Dell’Amico F. Evaluating Viability of Sea Turtle Foraging Populations at High Latitudes: Age and Growth of Juveniles along the French Atlantic Coast Endanger. Species Res. 2018 37 25 36 10.3354/esr00913 45. Tomás J. Gozalbes P. Raga J. Godley B. Bycatch of Loggerhead Sea Turtles: Insights from 14 Years of Stranding Data Endanger. Species Res. 2008 5 161 169 10.3354/esr00116 46. Chevallier D. Maucourt L. Charrier I. Lelong P. Le Gall Y. Menut E. Wallace B. Delvenne C. Vincze O. Jeantet L. The Response of Sea Turtles to Vocalizations Opens New Perspectives to Reduce Their Bycatch Sci. Rep. 2024 14 16519 10.1038/s41598-024-67501-z 39019952 PMC11255315 47. Yamazaki H. Rotinsulu H. Kaneko T. Murakami K. Fujiwara H. Ukai K. Namikoshi M. A New Dibenz[b,e]Oxepine Derivative, 1-Hydroxy-10-Methoxy-Dibenz[b,e]Oxepin-6,11-Dione, from a Marine-Derived Fungus, Beauveria bassiana Mar. Drugs 2012 10 2691 2697 10.3390/md10122691 23342391 PMC3528119 48. Stockman J. Innis C.J. Solano M. O’Sullivan Brisson J. Kass P.H. Tlusty M.F. Weber E.S. Prevalence, Distribution, and Progression of Radiographic Abnormalities in the Lungs of Cold-Stunned Kemp’s Ridley Sea Turtles ( Lepidochelys kempii J. Am. Vet. Med. Assoc. 2013 242 675 681 10.2460/javma.242.5.675 23402416 49. Walsh T.J. Hayden R.T. Larone D.H. Larone’s Medically Important Fungi: A Guide to Identification 6th ed. ASM Press Washington, DC, USA 2023 978-1-55581-987-3 50. Ebani V.V. Bacterial Infections in Sea Turtles Vet. Sci. 2023 10 333 10.3390/vetsci10050333 37235416 PMC10223378 51. Inurria A. Suárez-Pérez A. Calabuig P. Orós J. Citrobacter Freundii-Associated Lesions in Stranded Loggerhead Sea Turtles ( Caretta caretta Vet. Pathol. 2024 61 140 144 10.1177/03009858231183983 37377060 52. Foti M. Giacopello C. Bottari T. Fisichella V. Rinaldo D. Mammina C. Antibiotic Resistance of Gram Negatives Isolates from Loggerhead Sea Turtles ( Caretta caretta Mar. Pollut. Bull. 2009 58 1363 1366 10.1016/j.marpolbul.2009.04.020 19473669 53. Sellera F.P. Fuentes-Castillo D. Fuga B. Goldberg D.W. Kolesnikovas C.K.M. Lincopan N. New Delhi Metallo-β-Lactamase-1-Producing Citrobacter portucalensis One Health 2023 17 100590 10.1016/j.onehlt.2023.100590 37388191 PMC10302118 54. Brunswick J. Spiro J. Wisniewski P. Vagococcus IDCases 2024 36 e01995 10.1016/j.idcr.2024.e01995 38883211 PMC11176958 55. Racero L. Barberis C. Traglia G. Loza M.S. Vay C. Almuzara M. Infections Due to Vagococcus Enfermedades Infecc. Microbiol. Clin. Engl. Ed. 2021 39 335 339 10.1016/j.eimc.2020.06.010 34353510 56. Chen Q. Tan S. Long S. Wang K. Liu Q. Vagococcus Fluvialis Isolation from the Urine of a Bladder Cancer Patient: A Case Report BMC Infect. Dis. 2024 24 261 10.1186/s12879-024-09082-w 38409020 PMC10898091 57. Kitano H. Kitagawa H. Tadera K. Saito K. Kohada Y. Takemoto K. Kobatake K. Sekino Y. Hieda K. Ohge H. First Reported Human Case of Isolation of Vagococcus fluvialis BMC Infect. Dis. 2024 24 341 10.1186/s12879-024-09193-4 38515029 PMC10956364 58. Matajira C.E.C. Poor A.P. Moreno L.Z. Monteiro M.S. Dalmutt A.C. Gomes V.T.M. Dutra M.C. Barbosa M.R.F. Sato M.I.Z. Moreno A.M. Vagococcus J. Infect. Dev. Ctries. 2020 14 1314 1319 10.3855/jidc.12081 33296345 59. Matsuo T. Mori N. Kawai F. Sakurai A. Toyoda M. Mikami Y. Uehara Y. Furukawa K. Vagococcus Fluvialis as a Causative Pathogen of Bloodstream and Decubitus Ulcer Infection: Case Report and Systematic Review of the Literature J. Infect. Chemother. 2021 27 359 363 10.1016/j.jiac.2020.09.019 33036895 Figure 1 Life cycle of entomopathogenic fungi on insects. Figure 2 Kemp’s ridley sea turtle ( Lepidochelys kempii) Figure 3 Radiographic evaluation of the Kemp’s ridley sea turtle ( Lepidochelys kempii) A B Figure 4 Postmortem examination of the right lung of the Kemp’s ridley sea turtle ( Lepidochelys kempii Figure 5 Lung histopathological findings from the Kemp’s ridley sea turtle ( Lepidochelys kempii A B C D Figure 6 ( A Beauveria bassiana B microorganisms-13-02092-t001_Table 1 Table 1 Reported cases of Beauveria bassiana Species Observed Lesion Outcome Reference American alligator Alligator mississippiensis The thoracic cavity contained large masses of white, fluffy material. More than half of the pulmonary parenchyma was replaced by dark, consolidated tissue. Deceased [ 34 Common house gecko Hemidactylus frenatus Lesion on the forehead Deceased [ 35 Galápagos giant tortoise Testudo elephantopus The lung contained many small areas of tough, woody material. Deceased [ 36 Green iguana Iguana iguana Disseminated fungal infection Deceased [ 37 Green sea turtle Chelonia mydas Severe multifocal to coalescent granulocytic pulmonary abscesses with fibrinogranulocytic exudative pneumonia, focal ulcerative dermatitis of the flipper with bacterial and fungal hyphae Deceased [ 15 Kemp’s ridley sea turtle Lepidochelys kempii Severe granulocytic and granulomatous pneumonia with intralesional fungal hyphae, vascular invasion, and necrosis; coelomitis with granulocytic granuloma formation and intralesional fungal hyphae in multiple organs; severe multifocally extensive granulocytic nephritis with intralesional fungal hyphae Deceased [ 15 Pneumonia, with pleuritis Deceased [ 12 Pneumonia Deceased [ 12 Pneumonia, hepatitis Deceased [ 12 Pneumonia, with pleuritis; necroulcerative enteritis Deceased [ 38 Leatherback sea turtle Dermochelys coriacea Pneumonia Deceased [ 12 Loggerhead sea turtle Caretta caretta Chronic pyogranulomatous pneumonia with a lymphocytic–plasmacytic component Deceased [ 15 Red-eared slider Trachemys scripta Pulmonary congestion with pleuritis and presence of yellowish nodules Deceased [ 39 Nikolsky’s viper Vipera berus nikolskii Skin lesion Survived [ 40 ",
  "metadata": {
    "Title of this paper": "Vagococcus Fluvialis as a Causative Pathogen of Bloodstream and Decubitus Ulcer Infection: Case Report and Systematic Review of the Literature",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472779/"
  }
}