{
  "title": "Paper_770",
  "abstract": "pmc Genes Dis Genes Dis 3547 genesdiss Genes & Diseases 2352-4820 2352-3042 Chongqing Medical University PMC12466128 PMC12466128.1 12466128 12466128 41019512 10.1016/j.gendis.2025.101594 S2352-3042(25)00083-2 101594 1 Rapid Communication ScMicrobesAtlas: A comprehensive microbial atlas at single-cell resolution in human disease contexts Liu Jinyang a Hou Rui a Ji Lei a Gong Yue a Li Pan a Liu Peiwen a Dong Jinxin a Guo Hongzhe a Zhang Yun a Xu Junlin b Hui Tingting a Tian Haotian c Liu Yankun d e Zhang Meijun a Tian Geng a Yang Jialiang yangjl@geneis.cn a ⁎ a b c d e ⁎ yangjl@geneis.cn 1 2026 08 3 2025 13 1 497147 101594 29 7 2024 6 1 2025 23 2 2025 08 03 2025 27 09 2025 29 09 2025 © 2025 The Authors. Publishing services by Elsevier B.V. on behalf of KeAi Communications Co., Ltdé. 2025 Chongqing Medical University https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes The microbiome plays a significant role in human health and disease. 1 2 3 4 http://scmbdb.geneis.org.cn:8089 Fig. 1 Figure 1 ScMicrobesAtlas provides a valuable resource for researchers to investigate disease-microbiome associations at the single-cell resolution. (A) (B) (C–I) Figure 1 ScMicrobesAtlas is a comprehensive database that seeks to serve as a one-stop resource for researchers investigating the associations between disease and the microbiome at single-cell resolution. Its interactive web interface offers a range of advanced visualization tools. The search page allows users to efficiently retrieve data using flexible “search” and “filter” functions ( Fig. 1 The ScMicrobesAtlas provides users with seven interactive modules to facilitate the comprehensive and in-depth exploration of disease-microbiome associations. To demonstrate the utility and potential applications of these modules, we used the ScM-19A-017 project as an example for studying disease-microbiome associations at single-cell resolution. In the “Genus Abundance Heatmap” module , Fig. 1 In the “Genus Abundance Barplot” module, stacked bar plots depict the raw infection counts for each cell type. These visualizations highlight the distribution of microbes across the different host cell types within the disease states. By comparing the microbial composition across cell types, users can identify the specific cell populations that are preferentially infected by particular microbes. For instance, epithelial/cancer cells and smooth muscle cells exhibited greater microbial abundance and stronger enrichment of certain taxa compared with other cell types. Notably, alpha-papillomavirus, a primary causative agent of cervical cancer, was found to dominate the microbial composition in epithelial/cancer cells and smooth muscle cells ( Fig. 1 In the “Microbe Distribution UMAP” module , Fig. 1 In the “Differential Gene Expression” module , Fig. 1 5 In the “Gene Ontology Enrichment” module, the bar plot displays the significantly enriched gene ontology pathways based on the cell-type- and microbe-specific differential expression genes ( Fig. 1 Fig. 1 In the “KEGG Pathway Enrichment” module, the bar plot displays the significantly enriched Kyoto Encyclopedia of Genes and Genomes (KEGG) pathways using the cell-type- and microbe-specific significantly differential expression genes. This complementary analysis enables the identification of dysregulated biological pathways and signaling cascades in particular cell types upon microbial infection. For example, the KEGG enrichment analysis demonstrated that in epithelial/cancer cells from tumors infected with alpha-papillomavirus, these differential expression genes were significantly enriched in immune-related pathways associated with the development and progression of cervical cancer, such as cytokine–cytokine receptor interaction and IL-17 signaling ( Fig. 1 In the “Gene Set Enrichment Analysis” module, the GSEA plot highlights the activation of particular biological pathways in a select cell type upon specific microbial infection. This analysis allows users to identify cell-type-specific disease-related biological processes that are perturbed in response to microbial infection. For example, in epithelial/cancer cells from tumors infected with alpha-papillomavirus, there was increased activity of multiple hallmarks of tumor pathways related to cell cycle progression and DNA damage and repair. Specifically, the activated pathways included E2f targets, G2m checkpoint, and diseases of DNA repair ( Fig. 1 CRediT authorship contribution statement Jinyang Liu: Rui Hou: Lei Ji: Yue Gong: Pan Li: Peiwen Liu: Jinxin Dong: Hongzhe Guo: Yun Zhang: Junlin Xu: Tingting Hui: Haotian Tian: Yankun Liu: Meijun Zhang: Geng Tian: Jialiang Yang: Funding This work was supported by the 10.13039/501100001809 National Natural Science Foundation of China 62302156) Hebei Province Talent Introduction Project (No. 25120201B) “Identification of Key Genes in CAFs of Colorectal Cancer Liver Metastasis Using Single-Cell Sequencing Technology” (China) Conflict of interests The authors declared no conflict of interests. References 1 Young V.B. The role of the microbiome in human health and disease: an introduction for clinicians Br Med J 356 2017 j831 10.1136/bmj.j831 28298355 2 Narunsky-Haziza L. Sepich-Poore G.D. Livyatan I. Pan-cancer analyses reveal cancer-type-specific fungal ecologies and bacteriome interactions Cell 185 20 2022 3789 3806.e17 36179670 10.1016/j.cell.2022.09.005 PMC9567272 3 Ghaddar B. Biswas A. Harris C. Tumor microbiome links cellular programs and immunity in pancreatic cancer Cancer Cell 40 10 2022 1240 1253.e5 36220074 10.1016/j.ccell.2022.09.009 PMC9556978 4 Niño J.L.G. Wu H. LaCourse K.D. Effect of the intratumoral microbiota on spatial and cellular heterogeneity in cancer Nature 611 7937 2022 810 817 36385528 10.1038/s41586-022-05435-0 PMC9684076 5 Sheng B. Pan S. Ye M. Single-cell RNA sequencing of cervical exfoliated cells reveals potential biomarkers and cellular pathogenesis in cervical carcinogenesis Cell Death Dis 15 2 2024 130 38346944 10.1038/s41419-024-06522-y PMC10861450 Appendix A Supplementary data The following is the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Peer review under the responsibility of the Genes & Diseases Editorial Office, in alliance with the Association of Chinese Americans in Cancer Research (ACACR, Baltimore, MD, USA) Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.gendis.2025.101594 ",
  "metadata": {
    "Title of this paper": "Single-cell RNA sequencing of cervical exfoliated cells reveals potential biomarkers and cellular pathogenesis in cervical carcinogenesis",
    "Journal it was published in:": "Genes & Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466128/"
  }
}