{
  "title": "Paper_671",
  "abstract": "pmc Foods Foods 3129 foods foods Foods 2304-8158 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469417 PMC12469417.1 12469417 12469417 41008206 10.3390/foods14183234 foods-14-03234 1 Review Current Status and Future Prospects on Nanodelivery Systems Targeting the Small Intestine for Absorption of Bioactive Substances Zhang Hong Su Mengjie Zhang Yu Feng Qiuxia https://orcid.org/0000-0002-8320-8725 Liu Yuntao Zeng Zhen https://orcid.org/0000-0002-4041-9485 Zhang Qing https://orcid.org/0000-0003-1844-194X Fang Zhengfeng Li Shanshan * https://orcid.org/0000-0003-3605-6551 Chen Hong * Akanbi Taiwo O. Academic Editor College of Food Science, Sichuan Agricultural University, No. 46, Xinkang Road, Yucheng District, Ya’an 625014, China * ssli1205@163.com chenhong945@sicau.edu.cn 17 9 2025 9 2025 14 18 497635 3234 04 8 2025 12 9 2025 16 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The undesirable properties of bioactive substances (such as poor solubility and low stability) and various barriers in the gastrointestinal tract (gastric acid, digestive enzymes, mucus and intestinal epithelial cells) hinder their absorption and utilisation by the human body. Nanodelivery systems have been proven to effectively address the above problems, particularly targeted nanodelivery systems, which have more advantages in improving the bioavailability of bioactive substances. However, many studies have not included all barriers. Furthermore, given that the small intestine is the main site for the absorption of bioactive substances in the human body, this review primarily discusses targeted nanodelivery systems designed for the gastrointestinal barrier and summarises how to construct a nanodelivery system that can resist the adverse effects of the gastrointestinal tract and target the small intestine for the absorption of bioactive substances. This paper proposes that the ideal system is the active targeted nanodelivery system that targets enterocytes and its future development trend is discussed. This review aims to provide new insights for the rational design of nanodelivery platforms that efficiently target the small intestine and promote the absorption of bioactive substances, as well as promote the development of fields such as personalised nutrition and nutritional intervention. targeted nanodelivery systems small intestine bioactive substances Key Laboratory of Agricultural Product Processing and Nutrition Health (Co-construction by Ministry and Province), Ministry of Agriculture and Rural Affairs General Program of Sichuan Provincial Natural Science Foundation 2024NSFSC2078 This research was funded by the General Program of Sichuan Provincial Natural Science Foundation (Grant No. 2024NSFSC2078) and the Key Laboratory of Agricultural Product Processing and Nutrition Health (Co-construction by Ministry and Province), Ministry of Agriculture and Rural Affairs. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The harsh environment of the gastrointestinal tract makes it difficult for most bioactive substances to be absorbed and utilised by the human body through direct ingestion [ 1 2 3 4 5 6 7 8 9 10 11 12 13 6 14 15 We conducted a literature search spanning the last decade using the Web of Science and ScienceDirect databases, primarily employing combinations of keywords such as Nano, Delivery, Oral, Target, and Intestine. Given the diversity of nanodelivery systems covered in this review, additional keywords were incorporated as needed, with priority given to the references with an impact factor greater than 5. For example, “pH-sensitive” was included for pH-sensitive nanodelivery systems. In addition, it should be mentioned that we particularly prioritised studies focused on delivering food-derived bioactive substances. Although the studies listed in this paper include nanodelivery systems for drug models such as insulin, their design concepts can provide valuable references for delivering food-derived macromolecular bioactive peptides or proteins and other small molecules. 2. Adsorption Barriers Before being absorbed in the small intestine, a bioactive substance must pass through the oesophagus, stomach and duodenum of the upper gastrointestinal tract, as well as the jejunum and ileum of the lower gastrointestinal tract. As illustrated in Figure 1 16 17 2.1. pH and Enzymes in the Stomach and Small Intestine The stomach has a low pH level (1.5–3.5) and an abundance of digestive enzymes; although it protects the human body from microorganisms/xenobiotics, its specific pH environment alone could expose bioactive molecules to degradation/decomposition [ 18 19 20 21 22 2.2. Mucus Mucus is a viscous, semi-permeable matrix secreted by epithelial cells that permits the exchange of nutrients, water, gases and hormones while restricting entry of most bacteria and pathogens because of its steric hindrance and adhesive properties [ 23 24 25 26 27 28 29 2.3. Intestinal Epithelial Cells Bioactive substances also need to overcome the intestinal epithelial cell layer before entering systemic circulation. This layer consists mainly of tight junctions between cells and a monolayer of columnar epithelial cells with different characteristics and receptors, including enterocytes (the main absorptive cells, accounting for 80–90% of epithelial cells), goblet cells (which produce mucins to form the mucus layer covering the epithelial surface), microfold cells (also known as M cells, which are specialised epithelial cells situated in Peyer’s patches and are part of the intestine-associated lymphoid tissues) and Paneth cells (which secrete specific antimicrobial proteins that selectively bind to and kill bacteria) [ 16 30 31 32 Nanodelivery systems and substances with different properties have various modes of transport in intestinal epithelial cells. In the transcellular pathway, the absorption of bioactive substances mainly involves enterocytes and M cells ( Figure 2 33 34 15 15 35 36 37 38 The absorption of bioactive substances can occur not only by the transcellular pathway but also via the paracellular pathway of opening tight junctions between cells [ 39 40 6 41 42 43 44 In the current study of targeting the small intestine, passive targeted nanodelivery systems are mainly designed using the characteristics related to the chemical barrier, biological barrier and mucus layer barrier in the physical barrier of the gastrointestinal tract, whereas active targeted nanodelivery systems are primarily constructed using the barrier properties of the intestinal epithelial layer in the physical barriers. 3. Passive Targeted Nanodelivery Systems Ideal delivery systems should transport bioactive substances along the gastrointestinal tract and protect them from damage by its harsh environment, thereby facilitating the absorption of bioactive substances in the small intestine [ 45 Figure 3 3.1. pH-Sensitive Nanodelivery Systems Unlike the strongly acidic environment of the stomach, the pH of the small intestine is nearly neutral. Therefore, the pH difference between the small intestine and stomach can be utilised as a triggering factor for the release of bioactive substances to construct delivery systems [ 46 47 48 The most common pH-sensitive delivery systems are constructed by forming polyelectrolyte composite nanoparticles. They are formed by electrostatic interactions between two oppositely charged polyelectrolytes in aqueous solution [ 49 50 The pKa of the amino group in chitosan is about 6.5, which is protonated at low pH and deprotonated at pH > 7.0 [ 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 In addition to natural polymers, some synthetic polymers have been used to prepare pH-sensitive gastrointestinal nanodelivery systems. For example, hypromellose acetate succinate has been widely used as enteric coating material because it can remain intact at acidic environments and undergo deprotonation and dissolution at pH ≥ 6.5 [ 68 69 2 70 3.2. Enzyme-Responsive Nanodelivery Systems The environment of multiple enzymes present in the small intestine can be used to construct enzyme-responsive delivery systems. In terms of a single enzyme response, researchers used chitosan and adenosine triphosphate to self-assemble to form nanoscale spherical aggregates, which can be destroyed by the intestinal alkaline phosphatase (hydrolyzing adenosine triphosphate to single-negative-charge phosphates and a neutral adenosine) present in the brush border membrane of enterocytes [ 71 72 73 To date, numerous studies have used the response of multiple digestive enzymes to construct nanodelivery systems. Among them, natural proteins or proteins and polysaccharides are the main materials for constructing nanocarriers. For example, the anthocyanin-loaded nanoemulsion formed by modified starch showed good stability in simulated gastric fluid, but was decomposed by amylase in simulated intestinal fluid [ 74 75 76 77 78 Table 1 79 However, compared with protein-based carriers that are susceptible to pepsin destruction, polysaccharide-based carriers are more stable and have greater resistance to harsh conditions such as extreme pH, ionic strength and temperature [ 83 84 85 In the nanodelivery systems formed by non-covalent interactions between proteins and polysaccharides, the interaction between charged polysaccharides and proteins is mainly electrostatic attraction, whereas that between neutral polysaccharides and proteins is mainly hydrogen bonding. A recent study showed that curcumin encapsulated in positively charged quaternary ammonium chitosan-coated zein–sodium caseinate nanoparticles had the highest bioavailability [ 80 82 81 Table 1 86 Besides non-covalent interactions, the combination of proteins and polysaccharides can also be carried out by covalent interactions. At present, the covalent binding of proteins and polysaccharides is generally carried out through the Maillard reaction, and the conjugates are used for the construction of nano-delivery systems. It is one of the effective methods to promote the conjugation of proteins and polysaccharides, which can improve the stability of protein without using toxic chemical reagents [ 87 88 89 90 Pleurotus ostreatus 91 92 93 94 95 96 Similarly to pH-sensitive nanodelivery systems, existing research on enzyme-responsive systems has predominantly substituted bioavailability assessments with bioaccessibility measurements in most published studies. To date, the gold-standard protocol for obtaining bioaccessibility data through in vitro simulated digestion remains the INFOGEST method [ 97 3.3. Mucoadhesive Nanodelivery Systems After overcoming the unfavourable effects of gastric acid or/and digestive enzymes, the next challenge for the nanodelivery system is the mucus layer that covers the absorptive epithelial cell layer of the intestine, which is one of the physical barriers. Mucoadhesive nanodelivery systems typically prolong the intestinal residence time by adhering to the intestinal mucus [ 98 Hydrophobicity, surface charge and chemical properties are the three major factors affecting the mucoadhesive properties of polymers. Hydrophobicity and surface charge are mainly reflected by non-covalent interactions, whereas chemical properties are manifested in terms of covalent interactions. With regard to non-covalent interactions, mucins can not only produce mucoadhesive properties by chain entanglement with substances [ 99 100 100 101 The mucoadhesive characteristics of cationic polymers are conducive to the delivery and absorption of encapsulated substances in the nanodelivery systems at specific sites [ 102 103 Anionic polymers, especially polysaccharides such as alginate [ 104 105 106 107 On the one hand, the mucoadhesive properties are based on the above non-covalent bonds, including chain entanglements, hydrophobic interactions, electrostatic interactions, hydrogen bonds and van der Waals forces; on the other hand, this performance is based on the covalent bonds between the active functional groups of polymers and the substructure of cysteine in mucus glycoprotein [ 26 108 109 Furthermore, the formation of mucoadhesive thiolated polymers through covalent disulphide bonds can be cationic, anionic or even neutral. For cationic polymers, thiolated chitosan can adhere tightly and anchor in the mucus layer to prolong the residence time, which is formed by the electrostatic interactions between chitosan and mucin, as well as the covalent disulphide bonds formed by the free thiol groups and the mucus cysteine domain [ 110 111 112 Nevertheless, mucoadhesive nanodelivery systems also have some limitations. They may adhere non-specifically to surfaces to which they are not intended to adhere (e.g., gastric mucosa and intestinal contents) [ 113 114 3.4. Mucus-Penetrating Nanodelivery Systems Another factor limiting delivery efficiency is how to quickly penetrate the mucus layer to reach the following intestinal cells. Compared with mucoadhesive nanodelivery systems, mucus-penetrating nanodelivery systems may be a more promising strategy to increase the absorption of bioactive substances. They can improve the distribution and permeability of the delivery platform in the mucus layer so that they can reach the epithelial cells and subsequently be absorbed. To effectively penetrate the mucus layer, the delivery carrier needs to reduce contact with it. Reducing interactions such as hydrophobic or electrostatic interactions between the delivery system and mucus can effectively reduce their adhesion. Mucus-penetrating nanodelivery systems can typically be achieved by endowing them with hydrophilic and uncharged surface properties similar to those of viruses that can move quickly in human mucus [ 115 Polyethylene glycol (PEG) is a non-ionic and net-neutrally hydrophilic polymer [ 116 115 117 118 119 120 121 122 123 124 125 126 A research demonstrated that viruses with high concentrations of positively and negatively charged surface properties can diffuse as fast in mucus as in saline solution [ 127 128 129 130 131 132 133 In addition to directly preparing zwitterions and bioactive substances into nanoparticles/micelles for delivery, zwitterions can also be used as a functional coating of nanodelivery particles, thereby conferring the composite nanoparticles mucus-penetrating function, improving the bioavailability of bioactive substances. Chen’s team achieved efficient loading of exenatide through zwitterionic hydrogel-coated metal–organic framework (MOF) nanoparticles [ 134 Even though zwitterionic modification can enhance the endocytosis of nanocarriers, it usually cannot increase the desired transcytosis. Therefore, nanocarriers normally have the problem of ‘easy entry hard transcytosis’. The polyzwitterion poly(2-( N N N 135 136 However, to date, all zwitterionic polymers based on radical polymerisation of vinyl betaines have the main chains composed of noncleavable carbon-carbon bonds, so the accumulation of these non-degradable polymers in the body may have adverse effects on the body [ 137 138 Therefore, in zwitterionic-modified biodegradable materials, compared with synthetic materials, the development of natural materials must be increased. Proteins with appeared as natural amphoteric electrolytes may be potential materials for constructing nanocarriers to overcome the mucus layer. Zhao’s group has advanced the study of using soy protein isolate-based mucus-penetrating nanoparticles for curcumin delivery [ 139 140 3.5. Composite Nanodelivery Systems In passive targeted nanodelivery systems, compared with a single type of delivery system, composite nanodelivery systems that consider multiple barriers have been shown to be more advantageous in the delivery of bioactive substances. This part will mainly introduce the nanodelivery systems based on pH-sensitive and mucoadhesive, mucoadhesive and mucus-penetrating and enzyme-responsive and mucus-penetrating properties. In pH-responsive and mucoadhesive composite nanodelivery systems, the nanodelivery systems for insulin delivery prepared from hyaluronic acid with different molecular weights and poly[2-(dimethylamino)ethyl methacrylate] exhibited effective hypoglycaemic effects and relative bioavailability of up to 14.62% in pharmacodynamic and pharmacokinetic studies in rats, respectively, while free insulin had no significant hypoglycemic effect and relative bioavailability was only 0.66% [ 141 142 In mucoadhesive and mucus-penetrating composite nanodelivery systems, researchers synthesised hydrophobic palmitic acid and cysteine-modified N-2-hydroxypropyl trimethyl ammonium chloride chitosan to form an amphiphilic polymer, and then used it to prepare curcumin-loaded nanomicelles [ 143 144 145 146 In enzyme-responsive and mucus-penetrating composite nanodelivery systems, researchers anchored the cationic octa-arginine (R8) peptide, a cell-penetrating peptide and anionic phosphoserine (Pho), which is a substrate of intestinal alkaline phosphatase on the surface of PLGA to obtain virus-like densely charged but neutral surface, nanoparticles (P–R8–Pho) [ 147 In terms of passive targeted nanodelivery systems, compared with single types, composite delivery systems have better application prospects in promoting the absorption of bioactive substances, as they take into account more gastrointestinal absorption barriers. Nevertheless, they still ignore the last barrier to overcome the absorption to a certain extent, namely, the intestinal epithelial cell layer. The advantages and disadvantages of each passive targeted delivery system can be viewed in Table 2 4. Active Targeted Nanodelivery Systems Compared with the passive targeted nanodelivery system, the active targeted nanodelivery system is designed for a smaller cellular level and is mainly based on ligand–receptor/transporter-mediated transport. The active targeting of cells can be achieved by the interaction between the ligands on the delivery system and the receptors on the cell surface, thereby enhancing the enrichment of bioactive substances at the target site and mitigating their off-target effects. Transporters are also important membrane transport proteins involved in the transport of nutrients and other substances [ 148 However, the uptake of intact nanocarriers is a prerequisite for active targeted delivery mediated by ligand–receptor/transporter transport [ 149 150 151 Figure 4 In addition, nanocarriers may not be able to achieve ‘lysosomal escape’ during transport into the systemic circulation by enterocytes, which are the main intestinal barrier cells. In other words, the nanocarriers may be digested and decomposed by the lysosome in enterocytes and inactivate the loaded bioactive substances, decreasing their bioavailability. By contrast, M cells, which make up only a small proportion of the intestinal epithelial cells, can effectively transport a variety of macromolecules or particles from the intestinal lumen to the Peyer’s patch without digestion [ 152 149 However, current research on active targeting at the cellular level predominantly concentrates on applications in drug delivery. In contrast, this approach is still in its early stages within the fields of food and nutrition. Consequently, we aim to leverage insights from advancements in drug delivery systems to guide our research strategies for the targeted delivery of food-derived bioactive substances. 4.1. Single Ligand–Receptor-Mediated Nanodelivery Systems Neonatal Fc receptor (FcRn) is a Fc receptor that binds immunoglobulin G via electrostatic interactions at acidic pH and mediates the transcytosis pathway through the intestinal mucosal barrier [ 153 154 155 153 The binding mode of vitamin B12 (VB12) to intestinal epithelial cells is different from that of general ligands, because it does not work through direct binding between itself and the receptor. VB12 first binds to an intrinsic factor (IF) produced by the stomach to form a VB12–IF complex, which further binds to the IF receptor on the surface of intestinal epithelial cells and is then transported to circulation [ 156 30 157 158 In addition to considering the targeting of the nanodelivery systems to the intestine, the nanodelivery systems with ‘secondary targeting’ ability to re-target the target organ/tissue after targeting the intestinal epithelial cells into the systemic circulation will be promising in improving the bioavailability of bioactive substances. The results of using dextran–bovine serum albumin conjugate mixed with protamine as an emulsifier to form 1,8-cineole-loaded nanoemulsions and further modified with VB12 showed that the VB12-modified nanoemulsions could effectively overcome various barriers of the gastrointestinal tract [ 159 Similarly, researchers have used the ability of β-glucan to target the dectin-1 receptor of M cells and macrophages and then participate in blood circulation through hitchhiking macrophages to construct nanoparticles for lutein delivery by using phycocyanin, chitosan and 3-boronobenzoic acid-modified yeast β-glucan yeast [ 160 Some studies based on single ligand–receptor-mediated targeted nanodelivery systems are listed in Table 3 Table 3 4.2. Single Ligand–Transporter-Mediated Nanodelivery Systems Ligand–transporter-based nano-delivery systems are generally designed for enterocytes. In-depth understanding of the various transporters and modification of their corresponding ligands onto the surface of the nanocarriers can achieve intestinal targeting and enhance the absorption of the bioactive substances, thereby improving the bioavailability of bioactive substances. Some studies based on single ligand–transporter-mediated targeted nanodelivery systems are listed in Table 4 Constructing a nanodelivery system capable of targeting lipid transporters for delivering carotenoids has promising prospects [ 173 174 Generally, the bioavailability of macromolecular proteins through the gastrointestinal tract is very poor (<1%) [ 175 sn 176 169 In addition, ASBT, which is associated with bile acid transport, is highly expressed in the small intestine and has been used to develop active targeted nanocarriers. ASBT is mainly expressed on the apical region of ileal enterocytes, and it is highly expressed in the distal ileum, which contributes to the hepatoenteral circulation of bile acids. In a study, researchers developed deoxycholic acid-modified nanoparticles with endosomal escape function, which significantly prevented insulin degradation in intestinal epithelial cells [ 177 In another study, researchers used 9-fluorenylmethoxycarbonyl-polyethylene–glycocholic acid to form high-density PEGylation-based glycocholic acid-decorated nanomicelles [ 178 Other studies have discussed ‘secondary targeting’ in single ligand–transporter-mediated nanodelivery systems. Recently, researchers modified the PLGA–PEG skeleton with mannose to target glucose transporter 1, which is highly expressed in intestinal epithelial cells and brain endothelial cells, and constructed a fingolimod-loaded nanodelivery system that can overcome both the intestinal epithelial barrier and the blood–brain barrier [ 179 In addition to the environment of healthy humans, the high expression of specific transporters in certain pathological conditions can be used to design nanodelivery systems. For example, the upregulated expression of proton-coupled folate transporter in intestinal epithelial cells of diabetes can mediate the endocytosis and intracellular transport pathways (lysosome escape and Golgi transport) of folate-grafted nanoparticles, improving the bioavailability of insulin [ 148 Similarly to ligand–receptor-mediated active targeted nanodelivery systems, the current research on ligand–transporter-mediated nanodelivery systems still needs to further break through the dilemma of intestinal epithelial digestion, to effectively improve the bioavailability of bioactive substances. Furthermore, in many published studies, enteric capsules have been used to encapsulate nanocarriers to help them overcome the chemical and biological barriers of the gastrointestinal tract, so nanocarriers still have some limitations. 4.3. Multiple Ligand–Receptor/Transporter-Mediated Nanodelivery Systems Compared with the single ligand–receptor/transporter-mediated active targeted nanodelivery system, the delivery system modified with multiple ligands may have better effects in improving the bioavailability of bioactive substances [ 180 Xi et al. [ 181 More recently, composite nanoparticles co-modified with zwitterion that mediate the PAT1 transport pathway and ursodeoxycholic acid that mediate the ASBT transport pathway have been used for co-delivery of insulin and berberine [ 182 5. Forms and Efficiencies of Passive/Active Targeted Nanodelivery Systems Entering Systemic Circulation The existing studies on nanodelivery systems targeting for the absorption of bioactive substances have mainly focused on passive targeted nanodelivery systems, including pH-sensitive, enzyme-responsive, mucoadhesive, mucus-penetrating and composite nanodelivery systems. However, in addition to the nanodelivery systems with mucus-penetrating properties, other passive targeted delivery systems loaded with bioactive substances are not eventually absorbed by the intestinal epithelial cells in the form of intact carriers ( Figure 5 The most ideal nanodelivery system should be able to protect the bioactive substances from the harsh gastrointestinal conditions, so as to target the specific receptor/transporter in an intact form to increase the uptake of intestinal epithelial cells, and mediate the intracellular transport and exocytosis of the nanodelivery system through the non-lysosomal pathway or lysosomal escape pathway. This phenomenon belongs to the active targeted nanodelivery system mentioned in this review ( Figure 5 6. Clinical Trials Currently, nanodelivery systems targeting the small intestine face significant challenges in transitioning from laboratory settings to clinical applications, with only a small number of products advancing to the clinical trial stage [ 14 NCT01973920 14 183 149 7. Conclusions and Perspectives The complex physiological barriers in the digestive tract prevent the body from absorbing and utilising bioactive substances. In this review, we describe the gastrointestinal barriers that bioactive substances need to pass through before they are absorbed by the human body and their characteristics. We further elaborate on how to construct targeted nanodelivery systems that can overcome different physiological barriers. We believe that constructing a nanodelivery system capable of actively targeting enterocytes will represent the optimal strategy for enhancing the bioavailability of bioactive substances. Considering the factors of receptors/transporters, carrier materials, bioactive substances and biosecurity, the active targeted nanodelivery system constructed in the future should have the following characteristics: (i) using natural materials such as polysaccharides and proteins; (ii) does not rely on enteric capsules to overcome the gastrointestinal barriers; and (iii) can be transported and exocytosed by enterocytes in an intact form. Furthermore, researchers must develop co-delivery of bioactive substances with synergistic effects, especially in the co-delivery of hydrophilic and hydrophobic substances, as well as large and small molecular substances. On the basis of these foundations, active targeted nanodelivery systems with ‘secondary targeting’ capabilities have strong development potential, because they can be further enriched in targeted organs/tissues (such as kidney, eye and adipose tissue) after entering the blood to intensify the effect of bioactive substances. Although there are currently efforts to construct targeted nanodelivery systems by leveraging differences in intestinal epithelium between healthy and certain disease states (such as diabetes), most research is still based on the gastrointestinal environment under healthy conditions. As a consequence, further attention needs to be paid to the differences in the complex gastrointestinal environment between healthy and sub-healthy states, as well as some diseases that have not yet been studied, to design differentiated delivery strategies and promote the development of fields such as personalised nutrition and nutritional intervention. Disclaimer/Publisher’s Note: Author Contributions H.Z.: Investigation, Data curation, Formal analysis, Writing—original draft. M.S.: Investigation, Writing—Original Draft. Y.Z.: Investigation. Q.F.: Investigation. Y.L.: Conceptualization. Z.Z.: Formal analysis. Q.Z.: Conceptualization. Z.F.: Project administration, Conceptualization. S.L.: Conceptualization, Project administration, Writing—review and editing. H.C.: Methodology, Conceptualization, Writing—review and editing, Supervision. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analysed in this study. Data sharing is not applicable to this article. Conflicts of Interest No potential conflict of interest was reported by the authors. References 1. Zhang X. Chen G. Zhang H. Shang L. Zhao Y. Bioinspired oral delivery devices Nat. Rev. Bioeng. 2023 1 208 225 10.1038/s44222-022-00006-4 2. Yang X. Zhang L. Zheng Z. Langer R. Jaklenec A. Advanced oral delivery systems for nutraceuticals Adv. Healthc. Mater. 2025 2500271 10.1002/adhm.202500271 40500936 3. Venkidasamy B. Shelar A. Dhanapal A.R. Nile A.S. Patil R. Zhang Y. Kuksal K. Nile S.H. Emerging biopolymer nanocarriers for controlled and protective delivery of food bioactive compounds–current status and future perspective Food Hydrocoll. 2025 160 110769 10.1016/j.foodhyd.2024.110769 4. Faridi Esfanjani A. Assadpour E. Jafari S.M. Improving the bioavailability of phenolic compounds by loading them within lipid-based nanocarriers Trends Food Sci. Technol. 2018 76 56 66 10.1016/j.tifs.2018.04.002 5. Anal A.K. Boonlao N. Ruktanonchai U.R. Emulsion systems stabilized with biopolymers to enhance oral bioaccessibility and bioavailability of lipophilic bioactive compounds Curr. Opin. Food Sci. 2023 50 101001 10.1016/j.cofs.2023.101001 6. Wang D. Jiang Q. Dong Z. Meng T. Hu F. Wang J. Yuan H. Nanocarriers transport across the gastrointestinal barriers: The contribution to oral bioavailability via blood circulation and lymphatic pathway Adv. Drug Deliv. Rev. 2023 203 115130 10.1016/j.addr.2023.115130 37913890 7. Zhang T. Xu X. Pan Y. Yang H. Han J. Liu J. Liu W. Specific surface modification of liposomes for gut targeting of food bioactive agents Compr. Rev. Food Sci. Food Saf. 2023 22 3685 3706 10.1111/1541-4337.13224 37548603 8. Peng X. Li D. Liu Y. Construction of efficient carotenoid delivery vehicles based on the intestinal epithelial transport pathway: Current applications and future trends Trends Food Sci. Technol. 2024 147 104473 10.1016/j.tifs.2024.104473 9. Jia L. Wang W. Zhao H. Ding X. Zheng M. Cai D. Wang Y. Wang Z. Liu H. Innovative nano delivery systems for astaxanthin: Enhancing stability, bioavailability, and targeted therapeutic applications J. Agric. Food Chem. 2025 73 3286 3304 10.1021/acs.jafc.4c09415 39886831 10. Vieira I.R.S. Conte-Junior C.A. Nano-delivery systems for food bioactive compounds in cancer: Prevention, therapy, and clinical applications Crit. Rev. Food Sci. Nutr. 2024 64 381 406 10.1080/10408398.2022.2106471 35938315 11. Yuan D. Guo Y. Pu F. Yang C. Xiao X. Du H. He J. Lu S. Opportunities and challenges in enhancing the bioavailability and bioactivity of dietary flavonoids: A novel delivery system perspective Food Chem. 2024 430 137115 10.1016/j.foodchem.2023.137115 37566979 12. Premathilaka R. Rashidinejad A. Golding M. Singh J. Oral delivery of hydrophobic flavonoids and their incorporation into functional foods: Opportunities and challenges Food Hydrocoll. 2022 128 107567 10.1016/j.foodhyd.2022.107567 13. Huang L. Huang X.-H. Yang X. Hu J.-Q. Zhu Y.-Z. Yan P.-Y. Xie Y. Novel nano-drug delivery system for natural products and their application Pharmacol. Res. 2024 201 107100 10.1016/j.phrs.2024.107100 38341055 14. Liang S. Zhao D. Liu X. Liu B. Li Y. The stomach, small intestine, and colon-specific gastrointestinal tract delivery systems for bioactive nutrients Adv. Colloid Interface Sci. 2025 341 103503 10.1016/j.cis.2025.103503 40209595 15. Ouyang J. Zhang Z. Deng B. Liu J. Wang L. Liu H. Koo S. Chen S. Li Y. Yaremenko A.V. Oral drug delivery platforms for biomedical applications Mater. Today 2023 62 296 326 10.1016/j.mattod.2023.01.002 16. Suzuki K. Kim K.S. Bae Y.H. Long-term oral administration of Exendin-4 to control type 2 diabetes in a rat model J. Control. Release 2019 294 259 267 10.1016/j.jconrel.2018.12.028 30572033 PMC6369909 17. Zhang Y. Wang Y. Li X. Nie D. Liu C. Gan Y. Ligand-modified nanocarriers for oral drug delivery: Challenges, rational design, and applications J. Control. Release 2022 352 813 832 10.1016/j.jconrel.2022.11.010 36368493 18. Falsafi S.R. Wang Y. Ashaolu T.J. Sharma M. Rawal S. Patel K. Askari G. Javanmard S.H. Rostamabadi H. Biopolymer nanovehicles for oral delivery of natural anticancer agents Adv. Funct. Mater. 2023 33 2209419 10.1002/adfm.202209419 19. Durán-Lobato M. Niu Z. Alonso M.J. Oral delivery of biologics for precision medicine Adv. Mater. 2020 32 1901935 10.1002/adma.201901935 31222910 20. Ren A. Hu J. Qin C. Xia N. Yu M. Xu X. Yang H. Han M. Zhang L. Ma L. Oral administration microrobots for drug delivery Bioact. Mater. 2024 39 163 190 10.1016/j.bioactmat.2024.05.005 38808156 PMC11130999 21. Chen C. Beloqui A. Xu Y. Oral nanomedicine biointeractions in the gastrointestinal tract in health and disease Adv. Drug Deliv. Rev. 2023 203 115117 10.1016/j.addr.2023.115117 37898337 22. Homayun B. Lin X. Choi H.-J. Challenges and recent progress in oral drug delivery systems for biopharmaceuticals Pharmaceutics 2019 11 129 10.3390/pharmaceutics11030129 30893852 PMC6471246 23. Bandi S.P. Bhatnagar S. Venuganti V.V.K. Advanced materials for drug delivery across mucosal barriers Acta Biomater. 2021 119 13 29 10.1016/j.actbio.2020.10.031 33141051 24. Zhang E. Zhu H. Song B. Shi Y. Cao Z. Recent advances in oral insulin delivery technologies J. Control. Release 2024 366 221 230 10.1016/j.jconrel.2023.12.045 38161033 PMC10932876 25. Bajka B.H. Rigby N.M. Cross K.L. Macierzanka A. Mackie A.R. The influence of small intestinal mucus structure on particle transport ex vivo Colloids Surf. B Biointerfaces 2015 135 73 80 10.1016/j.colsurfb.2015.07.038 26241918 26. Peppas N.A. Huang Y. Nanoscale technology of mucoadhesive interactions Adv. Drug Deliv. Rev. 2004 56 1675 1687 10.1016/j.addr.2004.03.001 15350296 27. Paone P. Cani P.D. Mucus barrier, mucins and gut microbiota: The expected slimy partners? Gut 2020 69 2232 2243 10.1136/gutjnl-2020-322260 32917747 PMC7677487 28. Duffy C.V. David L. Crouzier T. Covalently-crosslinked mucin biopolymer hydrogels for sustained drug delivery Acta Biomater. 2015 20 51 59 10.1016/j.actbio.2015.03.024 25818947 29. Wang Z. Fu S. Guo Y. Han Y. Ma C. Li R. Yang X. Classification and design strategies of polysaccharide-based nano-nutrient delivery systems for enhanced bioactivity and targeted delivery: A review Int. J. Biol. Macromol. 2024 256 128440 10.1016/j.ijbiomac.2023.128440 38016614 30. Date A.A. Hanes J. Ensign L.M. Nanoparticles for oral delivery: Design, evaluation and state-of-the-art J. Control. Release 2016 240 504 526 10.1016/j.jconrel.2016.06.016 27292178 PMC5064878 31. Liu W. Dong Z. Liu K. Lu Y. Wu W. Qi J. Chen Z. Targeting strategies of oral nano-delivery systems for treating inflammatory bowel disease Int. J. Pharm. 2021 600 120461 10.1016/j.ijpharm.2021.120461 33711470 32. Ejazi S.A. Louisthelmy R. Maisel K. Mechanisms of nanoparticle transport across intestinal tissue: An oral delivery perspective ACS Nano 2023 17 13044 13061 10.1021/acsnano.3c02403 37410891 33. Chen M.-C. Mi F.-L. Liao Z.-X. Hsiao C.-W. Sonaje K. Chung M.-F. Hsu L.-W. Sung H.-W. Recent advances in chitosan-based nanoparticles for oral delivery of macromolecules Adv. Drug Deliv. Rev. 2013 65 865 879 10.1016/j.addr.2012.10.010 23159541 34. Tran H. ElSayed M.E.H. Progress and limitations of oral peptide delivery as a potentially transformative therapy Expert Opin. Drug Deliv. 2022 19 163 178 10.1080/17425247.2022.2051476 35255753 35. Song J.G. Lee S.H. Han H.-K. Development of an M cell targeted nanocomposite system for effective oral protein delivery: Preparation, in vitro and in vivo characterization J. Nanobiotechnol. 2021 19 15 10.1186/s12951-020-00750-y 33422063 PMC7796596 36. Schreiner J. Brettner F.E.B. Gier S. Vogel-Kindgen S. Windbergs M. Unlocking the potential of microfold cells for enhanced permeation of nanocarriers in oral drug delivery Eur. J. Pharm. Biopharm. 2024 202 114408 10.1016/j.ejpb.2024.114408 39004319 37. Kiyono H. Fukuyama S. NALT- versus PEYER’S-patch-mediated mucosal immunity Nat. Rev. Immunol. 2004 4 699 710 10.1038/nri1439 15343369 PMC7097243 38. Miao Y.-B. Lin Y.-J. Chen K.-H. Luo P.-K. Chuang S.-H. Yu Y.-T. Tai H.-M. Chen C.-T. Lin K.-J. Sung H.-W. Engineering nano- and microparticles as oral delivery vehicles to promote intestinal lymphatic drug transport Adv. Mater. 2021 33 2104139 10.1002/adma.202104139 34596293 39. Yu Z. Liu D. Wu C. Zhao W. Intestinal absorption of bioactive oligopeptides: Paracellular transport and tight junction modulation Food Funct. 2024 15 6274 6288 10.1039/D4FO00529E 38787733 40. Jiang B. Zhao Y. Cao Y. Sun C. Lu W. Fang Y. Advances in the interaction between food-derived nanoparticles and the intestinal barrier J. Agric. Food Chem. 2024 72 3291 3301 10.1021/acs.jafc.3c08145 38346354 41. Ray S. Moonshi S.S. Ta H.T. “Therapies through gut:” Targeted drug delivery for non-gastrointestinal diseases by oral administration Adv. Healthc. Mater. 2025 14 2403162 10.1002/adhm.202403162 40028999 PMC12232171 42. Zaiki Y. Lim L.Y. Wong T.W. Critical material designs for mucus- and mucosa-penetrating oral insulin nanoparticle development Int. Mater. Rev. 2023 68 121 139 10.1080/09506608.2022.2040293 43. He Y. Cheng M. Yang R. Li H. Lu Z. Jin Y. Feng J. Tu L. Research progress on the mechanism of nanoparticles crossing the intestinal epithelial cell membrane Pharmaceutics 2023 15 1816 10.3390/pharmaceutics15071816 37514003 PMC10384977 44. Lerner A. Matthias T. Changes in intestinal tight junction permeability associated with industrial food additives explain the rising incidence of autoimmune disease Autoimmun. Rev. 2015 14 479 489 10.1016/j.autrev.2015.01.009 25676324 45. Schouten P.J.C. Soto-Aguilar D. Aldalbahi A. Ahamad T. Alzahly S. Fogliano V. Design of sporopollenin-based functional ingredients for gastrointestinal tract targeted delivery Curr. Opin. Food Sci. 2022 44 100809 10.1016/j.cofs.2022.100809 46. Wang X. Sun H. Mu T. Materials and structure of polysaccharide-based delivery carriers for oral insulin: A review Carbohydr. Polym. 2024 323 121364 10.1016/j.carbpol.2023.121364 37940264 47. Prata A.S. Nascimento R.F. Grosso C.R.F. Designing polymeric interactions toward smart particles Curr. Opin. Food Sci. 2022 46 100867 10.1016/j.cofs.2022.100867 48. Lou J. Duan H. Qin Q. Teng Z. Gan F. Zhou X. Zhou X. Advances in oral drug delivery systems: Challenges and opportunities Pharmaceutics 2023 15 484 10.3390/pharmaceutics15020484 36839807 PMC9960885 49. Meka V.S. Sing M.K.G. Pichika M.R. Nali S.R. Kolapalli V.R.M. Kesharwani P. A comprehensive review on polyelectrolyte complexes Drug Discov. Today 2017 22 1697 1706 10.1016/j.drudis.2017.06.008 28683256 50. Deng L. Dong H. Dong A. Zhang J. A strategy for oral chemotherapy via dual pH-sensitive polyelectrolyte complex nanoparticles to achieve gastric survivability, intestinal permeability, hemodynamic stability and intracellular activity Eur. J. Pharm. Biopharm. 2015 97 107 117 10.1016/j.ejpb.2015.10.010 26515259 51. Kazemi Shariat Panahi H. Dehhaghi M. Amiri H. Guillemin G.J. Gupta V.K. Rajaei A. Yang Y. Peng W. Pan J. Aghbashlo M. Current and emerging applications of saccharide-modified chitosan: A critical review Biotechnol. Adv. 2023 66 108172 10.1016/j.biotechadv.2023.108172 37169103 52. Lang X. Wang T. Sun M. Chen X. Liu Y. Advances and applications of chitosan-based nanomaterials as oral delivery carriers: A review Int. J. Biol. Macromol. 2020 154 433 445 10.1016/j.ijbiomac.2020.03.148 32194103 53. Yuan H. Guo C. Liu L. Zhao L. Zhang Y. Yin T. He H. Gou J. Pan B. Tang X. Progress and prospects of polysaccharide-based nanocarriers for oral delivery of proteins/peptides Carbohydr. Polym. 2023 312 120838 10.1016/j.carbpol.2023.120838 37059563 54. Diep E. Schiffman J.D. Ethanol-free cross-linking of alginate nanofibers enables controlled release into a simulated gastrointestinal tract model Biomacromolecules 2023 24 2908 2917 10.1021/acs.biomac.3c00274 37183416 55. Guo Y. Kitts D.D. Dolati D. Pratap-Singh A. Singh A. Enhancing resveratrol bioavailability and intestinal uptake using an oil-based blueberry extract formulated with Chitosan/PEG containing nanoparticles Food Hydrocoll. 2024 156 110373 10.1016/j.foodhyd.2024.110373 56. Xie C. Huang M. Ying R. Wu X. Hayat K. Shaughnessy L.K. Tan C. Olive pectin-chitosan nanocomplexes for improving stability and bioavailability of blueberry anthocyanins Food Chem. 2023 417 135798 10.1016/j.foodchem.2023.135798 36924718 57. Zhao X. Zhang X. Tie S. Hou S. Wang H. Song Y. Rai R. Tan M. Facile synthesis of nano-nanocarriers from chitosan and pectin with improved stability and biocompatibility for anthocyanins delivery: An in vitro and in vivo study Food Hydrocoll. 2020 109 106114 10.1016/j.foodhyd.2020.106114 58. Shen R. Yang X. Lin D. PH sensitive double-layered emulsions stabilized by bacterial cellulose nanofibers/soy protein isolate/chitosan complex enhanced the bioaccessibility of curcumin: In vitro study Food Chem. 2023 402 134262 10.1016/j.foodchem.2022.134262 36126584 59. Wang L. Zhao Y. Wang Y. Zhang F. Wei Y. Li N. Xu Y. Preparation, stability, and antibacterial activity of carboxymethylated Anemarrhena asphodeloides polysaccharide-chitosan nanoparticles loaded curcumin Int. J. Biol. Macromol. 2024 264 130787 10.1016/j.ijbiomac.2024.130787 38548499 60. Xu H. Ma Q. Qiu C. Wang J. Jin Z. Hu Y. Encapsulation and controlled delivery of curcumin by self-assembled cyclodextrin succinate/chitosan nanoparticles Food Hydrocoll. 2024 157 110465 10.1016/j.foodhyd.2024.110465 61. Sorasitthiyanukarn F.N. Muangnoi C. Rojsitthisak P. Rojsitthisak P. Chitosan oligosaccharide/alginate nanoparticles as an effective carrier for astaxanthin with improving stability, in vitro oral bioaccessibility, and bioavailability Food Hydrocoll. 2022 124 107246 10.1016/j.foodhyd.2021.107246 62. Sun X. Liu C. Wang D. Xu Y. Wang C.-Y. Effects of coating layers chitosan/pectin on lipid stability and in vitro digestion of astaxanthin-loaded multilayer emulsions LWT 2023 173 114282 10.1016/j.lwt.2022.114282 63. Zhang P. Chen Z. Zhou L. Gao J. Zheng H. Lin H. Zhu G. Qin X. Cao W. Carboxymethyl cellulose and carboxymethyl chitosan-based composite nanogel as a stable delivery vehicle for oyster peptides: Characterization, absorption and transport mechanism Food Chem. 2024 442 138464 10.1016/j.foodchem.2024.138464 38245988 64. Dong Y. He Y. Fan D. Wu Z. Preparation of pH-sensitive chitosan-deoxycholic acid-sodium alginate nanoparticles loaded with ginsenoside Rb(1) and its controlled release mechanism Int. J. Biol. Macromol. 2023 234 123736 10.1016/j.ijbiomac.2023.123736 36801309 65. An Z. Dong Y. Wang W. Wang J. Wu Z. Wang W. He Y. Bao G. Preparation of pH-sensitive carboxymethyl chitosan nanoparticles loaded with ginsenoside Rb1 and evaluation of drug release in vitro Int. J. Biol. Macromol. 2024 267 131487 10.1016/j.ijbiomac.2024.131487 38599430 66. Yang E. Jung H.-S. Chang P.-S. Stimuli-responsive polymer-complexed liposome nanocarrier provides controlled release of biomolecules Food Hydrocoll. 2022 125 107397 10.1016/j.foodhyd.2021.107397 67. Liu K. Huang R.L. Zha X.Q. Li Q.M. Pan L.H. Luo J.P. Encapsulation and sustained release of curcumin by a composite hydrogel of lotus root amylopectin and chitosan Carbohydr. Polym. 2020 232 115810 10.1016/j.carbpol.2019.115810 31952604 68. Martins J.P. D’Auria R. Liu D. Fontana F. Ferreira M.P.A. Correia A. Kemell M. Moslova K. Mäkilä E. Salonen J. Engineered multifunctional albumin-decorated porous silicon nanoparticles for FcRn translocation of insulin Small 2018 14 1800462 10.1002/smll.201800462 29855134 69. Dai J. Nagai T. Wang X. Zhang T. Meng M. Zhang Q. pH-sensitive nanoparticles for improving the oral bioavailability of cyclosporine A Int. J. Pharm. 2004 280 229 240 10.1016/j.ijpharm.2004.05.006 15265562 70. Elbaz N.M. Tatham L.M. Owen A. Rannard S. McDonald T.O. Layer by layer self-assembly for coating a nanosuspension to modify drug release and stability for oral delivery Food Hydrocoll. 2023 144 108908 10.1016/j.foodhyd.2023.108908 71. Kang Y. Wang C. Liu K. Wang Z. Zhang X. Enzyme-responsive polymeric supra-amphiphiles formed by the complexation of chitosan and ATP Langmuir 2012 28 14562 14566 10.1021/la303271f 23025557 72. Leichner C. Jelkmann M. Prüfert F. Laffleur F. Bernkop-Schnürch A. Intestinal enzyme delivery: Chitosan/tripolyphosphate nanoparticles providing a targeted release behind the mucus gel barrier Eur. J. Pharm. Biopharm. 2019 144 125 131 10.1016/j.ejpb.2019.09.012 31526841 73. Huang J. Shu Q. Wang L. Wu H. Wang A.Y. Mao H. Layer-by-layer assembled milk protein coated magnetic nanoparticle enabled oral drug delivery with high stability in stomach and enzyme-responsive release in small intestine Biomaterials 2015 39 105 113 10.1016/j.biomaterials.2014.10.059 25477177 PMC4258002 74. Yuan Y. Hu Y. Huang J. Liu B. Li X. Tian J. de Vries R. Li B. Li Y. Optimizing anthocyanin oral delivery: Effects of food biomacromolecule types on nanocarrier performance for enhanced bioavailability Food Chem. 2024 454 139682 10.1016/j.foodchem.2024.139682 38797106 75. Li C. Chen L. McClements D.J. Peng X. Xu Z. Meng M. Ji H. Qiu C. Long J. Jin Z. Encapsulation of polyphenols in protein-based nanoparticles: Preparation, properties, and applications Crit. Rev. Food Sci. Nutr. 2023 64 11341 11355 10.1080/10408398.2023.2237126 37486163 76. Cheng H. Chen W. Jiang J. Khan M.A. Wusigale Liang L. A comprehensive review of protein-based carriers with simple structures for the co-encapsulation of bioactive agents Compr. Rev. Food Sci. Food Saf. 2023 22 2017 2042 10.1111/1541-4337.13139 36938993 77. Zeng Z. Deng S. Liu Y. Li C. Fang Z. Hu B. Chen H. Wang C. Chen S. Wu W. Targeting transportation of curcumin by soybean lipophilic protein nano emulsion: Improving its bioaccessibility and regulating intestinal microorganisms in mice Food Hydrocoll. 2023 142 108781 10.1016/j.foodhyd.2023.108781 78. Wang L. Jia W. Yang Q. Cai H. Zhao X. Casein nanoparticles as oral delivery carriers for improved bioavailability and hypoglycemic activity of apigenin Food Hydrocoll. 2024 146 109194 10.1016/j.foodhyd.2023.109194 79. Chang R. Liu B. Wang Q. Zhang J. Yuan F. Zhang H. Chen S. Liang S. Li Y. The encapsulation of lycopene with α-lactalbumin nanotubes to enhance their anti-oxidant activity, viscosity and colloidal stability in dairy drink Food Hydrocoll. 2022 131 107792 10.1016/j.foodhyd.2022.107792 80. Liu Q. Zhang Q. Jia F. Jiang N. Wang C. Sun R. Ma Y. Construction of quaternary ammonium chitosan-coated protein nanoparticles as novel delivery system for curcumin: Characterization, stability, antioxidant activity and bio-accessibility Food Chem. 2024 455 139923 10.1016/j.foodchem.2024.139923 38833855 81. Zhang H. Jia C. Xiao Y. Zhang J. Yu J. Li X. Hamid N. Sun A. Enhanced stability and bioavailability of mulberry anthocyanins through the development of sodium caseinate-konjac glucomannan nanoparticles Food Chem. 2024 439 138150 10.1016/j.foodchem.2023.138150 38100879 82. He J.-R. Zhu J.-J. Yin S.-W. Yang X.-Q. Bioaccessibility and intracellular antioxidant activity of phloretin embodied by gliadin/sodium carboxymethyl cellulose nanoparticles Food Hydrocoll. 2022 122 107076 10.1016/j.foodhyd.2021.107076 83. Wang X. Shi G. Fan S. Ma J. Yan Y. Wang M. Tang X. Lv P. Zhang Y. Targeted delivery of food functional ingredients in precise nutrition: Design strategy and application of nutritional intervention Crit. Rev. Food Sci. Nutr. 2023 64 7854 7877 10.1080/10408398.2023.2193275 36999956 84. Xiang C. Gao J. Ye H. Ren G. Ma X. Xie H. Fang S. Lei Q. Fang W. Development of ovalbumin-pectin nanocomplexes for vitamin D3 encapsulation: Enhanced storage stability and sustained release in simulated gastrointestinal digestion Food Hydrocoll. 2020 106 105926 10.1016/j.foodhyd.2020.105926 85. Wen J. Sui Y. Shi J. Xiong T. Cai F. Mei X. Nanoemulsions base on the Rice bran albumin-sweet potato leaf polyphenol-dextran complexes: Interaction mechanisms, stability and Astaxanthin release behaviour Food Chem. 2025 475 143276 10.1016/j.foodchem.2025.143276 39938263 86. Zhu Y. Sun X. Luo X. Ding J. Fan F. Li P. Shen X. Fang Y. Encapsulation of selenium-containing peptides in xanthan gum-lysozyme nanoparticles as a powerful gastrointestinal delivery system Food Res. Int. 2022 156 111351 10.1016/j.foodres.2022.111351 35650980 87. Oliver C.M. Melton L.D. Stanley R.A. Creating proteins with novel functionality via the maillard reaction: A review Crit. Rev. Food Sci. Nutr. 2006 46 337 350 10.1080/10408690590957250 16621753 88. Urango A.C.M. Meireles M.A.A. Silva E.K. Maillard conjugates produced from proteins and prebiotic dietary fibers: Technological properties, health benefits and challenges Trends Food Sci. Technol. 2024 147 104438 10.1016/j.tifs.2024.104438 89. Liu K. Zhang X. Liu R. Su W. Song Y. Tan M. Preparation of lutein nanoparticles by glycosylation of saccharides and casein for protecting retinal pigment epithelial cells J. Agric. Food Chem. 2024 72 6347 6359 10.1021/acs.jafc.3c09054 38408187 90. Hussain A. Hussain M. Ashraf W. Karim A. Muhammad Aqeel S. Khan A. Hussain A. Khan S. Lianfu Z. Preparation, characterization and functional evaluation of soy protein isolate-peach gum conjugates prepared by wet heating Maillard reaction Food Res. Int. 2024 192 114681 10.1016/j.foodres.2024.114681 39147541 91. Zhong L. Tian J. Hu Q. Zhao L. Zhan Q. Zhao M. Mitochondria-targeted nanoparticles based on glycated oat protein for enhanced curcumin bioavailability and antioxidant activity Food Biosci. 2024 60 104386 10.1016/j.fbio.2024.104386 92. Zhong L. Xu J. Hu Q. Zhan Q. Ma N. Zhao M. Zhao L. Improved bioavailability and antioxidation of β-carotene-loaded biopolymeric nanoparticles stabilized by glycosylated oat protein isolate Int. J. Biol. Macromol. 2024 263 130298 10.1016/j.ijbiomac.2024.130298 38382783 93. Yan X. Bai X. Liu X. Liu F. Enhanced functional properties of pea protein isolate microgel particles modified with sodium alginate: Mixtures and conjugates Food Chem. 2024 441 138358 10.1016/j.foodchem.2024.138358 38266315 94. Sun Y. Wang Y. Xie Y. Li T. Wang Y. Zhang X. Xia B. Huang J. Wang S. Dong W. Ultra-stable pickering emulsion stabilized by anisotropic pea protein isolate-fucoidan conjugate particles through Maillard reaction Int. J. Biol. Macromol. 2024 264 130589 10.1016/j.ijbiomac.2024.130589 38437935 95. Liu F. Ma C. McClements D.J. Gao Y. A comparative study of covalent and non-covalent interactions between zein and polyphenols in ethanol-water solution Food Hydrocoll. 2017 63 625 634 10.1016/j.foodhyd.2016.09.041 96. Zhang Y. Xie Y. Shao J. Yue X. Li M. Maillard reaction-based conjugates as carrier strategies for delivery of bioactive compounds: A review Curr. Opin. Food Sci. 2025 61 101260 10.1016/j.cofs.2024.101260 97. Tan Y. Zhou H. McClements D.J. Application of static in vitro digestion models for assessing the bioaccessibility of hydrophobic bioactives: A review Trends Food Sci. Technol. 2022 122 314 327 10.1016/j.tifs.2022.02.028 98. Butnarasu C. Petrini P. Bracotti F. Visai L. Guagliano G. Fiorio Pla A. Sansone E. Petrillo S. Visentin S. Mucosomes: Intrinsically mucoadhesive glycosylated mucin nanoparticles as multi-drug delivery platform Adv. Healthc. Mater. 2022 11 2200340 10.1002/adhm.202200340 35608152 PMC11468529 99. Spleis H. Sandmeier M. Claus V. Bernkop-Schnürch A. Surface design of nanocarriers: Key to more efficient oral drug delivery systems Adv. Colloid Interface Sci. 2023 313 102848 10.1016/j.cis.2023.102848 36780780 100. del Castillo-Santaella T. Aguilera-Garrido A. Galisteo-González F. Gálvez-Ruiz M.J. Molina-Bolívar J.A. Maldonado-Valderrama J. Hyaluronic acid and human/bovine serum albumin shelled nanocapsules: Interaction with mucins and in vitro digestibility of interfacial films Food Chem. 2022 383 132330 10.1016/j.foodchem.2022.132330 35219153 101. Ho D.-K. Frisch S. Biehl A. Terriac E. De Rossi C. Schwarzkopf K. Lautenschläger F. Loretz B. Murgia X. Lehr C.-M. Farnesylated glycol chitosan as a platform for drug delivery: Synthesis, characterization, and investigation of mucus–particle interactions Biomacromolecules 2018 19 3489 3501 10.1021/acs.biomac.8b00795 29989799 102. Hua Y. Wei Z. Xue C. Chitosan and its composites-based delivery systems: Advances and applications in food science and nutrition sector Crit. Rev. Food Sci. Nutr. 2021 63 4579 4598 10.1080/10408398.2021.2004992 34793271 103. Khongkow M. Rimsueb N. Jantimaporn A. Janyaphisan T. Woraprayote W. Visessanguan W. Ruktanonchai U.R. Cationic liposome of hen egg white lysozyme for enhanced its stability, activity and accessibility in gastro-intestinal tract Food Biosci. 2023 53 102470 10.1016/j.fbio.2023.102470 104. Andretto V. Taurino G. Guerriero G. Guérin H. Lainé E. Bianchi M.G. Agusti G. Briançon S. Bussolati O. Clayer-Montembault A. Nanoemulsions Embedded in Alginate Beads as Bioadhesive Nanocomposites for Intestinal Delivery of the Anti-Inflammatory Drug Tofacitinib Biomacromolecules 2023 24 2892 2907 10.1021/acs.biomac.3c00260 37228181 105. Aguilera-Garrido A. Molina-Bolívar J.A. Gálvez-Ruiz M.J. Galisteo-González F. Mucoadhesive properties of liquid lipid nanocapsules enhanced by hyaluronic acid J. Mol. Liq. 2019 296 111965 10.1016/j.molliq.2019.111965 106. Javanbakht S. Shaabani A. Carboxymethyl cellulose-based oral delivery systems Int. J. Biol. Macromol. 2019 133 21 29 10.1016/j.ijbiomac.2019.04.079 30986470 107. Cook S.L. Bull S.P. Methven L. Parker J.K. Khutoryanskiy V.V. Mucoadhesion: A food perspective Food Hydrocoll. 2017 72 281 296 10.1016/j.foodhyd.2017.05.043 108. Kanika Ahmad A. Kumar A. Rahul Mishra R.K. Ali N. Navik U. Parvez S. Khan R. Leveraging thiol-functionalized biomucoadhesive hybrid nanoliposome for local therapy of ulcerative colitis Biomaterials 2025 312 122747 10.1016/j.biomaterials.2024.122747 39142219 109. Brannigan R.P. Khutoryanskiy V.V. Progress and current trends in the synthesis of novel polymers with enhanced mucoadhesive properties Macromol. Biosci. 2019 19 1900194 10.1002/mabi.201900194 31361091 110. Fang L. Wang L. Yao Y. Zhang J. Wu X. Li X. Wang H. Zhang X. Gong X. Chang J. Micro- and nano-carrier systems: The non-invasive and painless local administration strategies for disease therapy in mucosal tissues Nanomed. Nanotechnol. Biol. Med. 2017 13 153 171 10.1016/j.nano.2016.08.025 27591961 111. Laffleur F. Netsomboon K. Bernkop-Schnürch A. Westmeier D. Stauber R.H. Docter D. Comprehensive mucoadhesive study of anionic polymers and their derivate Eur. Polym. J. 2017 93 314 322 10.1016/j.eurpolymj.2017.06.012 112. Kali G. Haddadzadegan S. Laffleur F. Bernkop-Schnürch A. Per-thiolated cyclodextrins: Nanosized drug carriers providing a prolonged gastrointestinal residence time Carbohydr. Polym. 2023 300 120275 10.1016/j.carbpol.2022.120275 36372469 113. Des Rieux A. Fievez V. Garinot M. Schneider Y.-J. Préat V. Nanoparticles as potential oral delivery systems of proteins and vaccines: A mechanistic approach J. Control. Release 2006 116 1 27 10.1016/j.jconrel.2006.08.013 17050027 114. Liu L. McClements D.J. Liu X. Liu F. Overcoming biopotency barriers: Advanced oral delivery strategies for enhancing the efficacy of bioactive food ingredients Adv. Sci. 2024 11 2401172 10.1002/advs.202401172 PMC11600209 39361948 115. Wang Y.-Y. Lai S.K. Suk J.S. Pace A. Cone R. Hanes J. Addressing the PEG mucoadhesivity paradox to engineer nanoparticles that “slip” through the human mucus barrier Angew. Chem. Int. Ed. 2008 47 9726 9729 10.1002/anie.200803526 PMC2666733 18979480 116. Chen Y. Lin S. Wang L. Zhang Y. Chen H. Fu Z. Zhang M. Luo H. Liu J. Reinforcement of the intestinal mucosal barrier via mucus-penetrating PEGylated bacteria Nat. Biomed. Eng. 2024 8 823 841 10.1038/s41551-024-01224-4 38839928 117. Ibrahim M. Shimizu T. Ando H. Ishima Y. Elgarhy O.H. Sarhan H.A. Hussein A.K. Ishida T. Investigation of anti-PEG antibody response to PEG-containing cosmetic products in mice J. Control. Release 2023 354 260 267 10.1016/j.jconrel.2023.01.012 36632951 118. Yang Q. Jacobs T.M. McCallen J.D. Moore D.T. Huckaby J.T. Edelstein J.N. Lai S.K. Analysis of pre-existing IgG and IgM antibodies against polyethylene glycol (PEG) in the general population Anal. Chem. 2016 88 11804 11812 10.1021/acs.analchem.6b03437 27804292 PMC6512330 119. Chen B.-M. Su Y.-C. Chang C.-J. Burnouf P.-A. Chuang K.-H. Chen C.-H. Cheng T.-L. Chen Y.-T. Wu J.-Y. Roffler S.R. Measurement of pre-existing IgG and IgM antibodies against polyethylene glycol in healthy individuals Anal. Chem. 2016 88 10661 10666 10.1021/acs.analchem.6b03109 27726379 120. Henry C.E. Wang Y.-Y. Yang Q. Hoang T. Chattopadhyay S. Hoen T. Ensign L.M. Nunn K.L. Schroeder H. McCallen J. Anti-PEG antibodies alter the mobility and biodistribution of densely PEGylated nanoparticles in mucus Acta Biomater. 2016 43 61 70 10.1016/j.actbio.2016.07.019 27424083 PMC5645030 121. Chen B.-M. Chen E. Lin Y.-C. Tran T.T.M. Turjeman K. Yang S.-H. Cheng T.-L. Barenholz Y. Roffler S.R. Liposomes with low levels of grafted poly(ethylene glycol) remain susceptible to destabilization by anti-poly(ethylene glycol) antibodies ACS Nano 2024 18 22122 22138 10.1021/acsnano.4c05409 39119697 PMC11342370 122. Stengel D. Demirel B.H. Knoll P. Truszkowska M. Laffleur F. Bernkop-Schnürch A. PEG vs. zwitterions: How these surface decorations determine cellular uptake of lipid-based nanocarriers J. Colloid Interface Sci. 2023 647 52 64 10.1016/j.jcis.2023.05.079 37244176 123. Singla P. Garg S. McClements J. Jamieson O. Peeters M. Mahajan R.K. Advances in the therapeutic delivery and applications of functionalized Pluronics: A critical review Adv. Colloid Interface Sci. 2022 299 102563 10.1016/j.cis.2021.102563 34826745 124. Tang Y. Zhang L. Sun R. Luo B. Zhou Y. Zhang Y. Liang Y. Xiao B. Wang C. Pulmonary delivery of mucus-traversing PF127-modified silk fibroin nanoparticles loading with quercetin for lung cancer therapy Asian J. Pharm. Sci. 2023 18 100833 10.1016/j.ajps.2023.100833 37635802 PMC10450418 125. Zierden H.C. Josyula A. Shapiro R.L. Hsueh H.T. Hanes J. Ensign L.M. Avoiding a sticky situation: Bypassing the mucus barrier for improved local drug delivery Trends Mol. Med. 2021 27 436 450 10.1016/j.molmed.2020.12.001 33414070 PMC8087626 126. Popov A. Enlow E. Bourassa J. Chen H. Mucus-penetrating nanoparticles made with “mucoadhesive” poly(vinyl alcohol) Nanomed. Nanotechnol. Biol. Med. 2016 12 1863 1871 10.1016/j.nano.2016.04.006 27112308 127. Olmsted S.S. Padgett J.L. Yudin A.I. Whaley K.J. Moench T.R. Cone R.A. Diffusion of macromolecules and virus-like particles in human cervical mucus Biophys. J. 2001 81 1930 1937 10.1016/S0006-3495(01)75844-4 11566767 PMC1301668 128. Rao R. Liu X. Li Y. Tan X. Zhou H. Bai X. Yang X. Liu W. Bioinspired zwitterionic polyphosphoester modified porous silicon nanoparticles for efficient oral insulin delivery Biomater. Sci. 2021 9 685 699 10.1039/D0BM01772H 33330897 129. Chen S. Zheng J. Li L. Jiang S. Strong resistance of phosphorylcholine self-assembled monolayers to protein adsorption:  insights into nonfouling properties of zwitterionic materials J. Am. Chem. Soc. 2005 127 14473 14478 10.1021/ja054169u 16218643 130. Shao Q. Jiang S. Molecular understanding and design of zwitterionic materials Adv. Mater. 2015 27 15 26 10.1002/adma.201404059 25367090 131. Li L. Chen S. Zheng J. Ratner B.D. Jiang S. Protein adsorption on oligo(ethylene glycol)-terminated alkanethiolate self-assembled monolayers:  The molecular basis for nonfouling behavior J. Phys. Chem. B 2005 109 2934 2941 10.1021/jp0473321 16851306 132. Shan W. Zhu X. Tao W. Cui Y. Liu M. Wu L. Li L. Zheng Y. Huang Y. Enhanced oral delivery of protein drugs using zwitterion-functionalized nanoparticles to overcome both the diffusion and absorption barriers ACS Appl. Mater. Interfaces 2016 8 25444 25453 10.1021/acsami.6b08183 27588330 133. Thwaites D.T. Anderson C.M.H. The SLC36 family of proton-coupled amino acid transporters and their potential role in drug transport Br. J. Pharmacol. 2011 164 1802 1816 10.1111/j.1476-5381.2011.01438.x 21501141 PMC3246705 134. Zhou Y. Chen Z. Zhao D. Li D. He C. Chen X. A pH-triggered self-unpacking capsule containing zwitterionic hydrogel-coated MOF nanoparticles for efficient oral exendin-4 delivery Adv. Mater. 2021 33 e2102044 10.1002/adma.202102044 34216408 135. Chen S. Zhong Y. Fan W. Xiang J. Wang G. Zhou Q. Wang J. Geng Y. Sun R. Zhang Z. Enhanced tumour penetration and prolonged circulation in blood of polyzwitterion–drug conjugates with cell-membrane affinity Nat. Biomed. Eng. 2021 5 1019 1037 10.1038/s41551-021-00701-4 33859387 136. Fan W. Wei Q. Xiang J. Tang Y. Zhou Q. Geng Y. Liu Y. Sun R. Xu L. Wang G. Mucus penetrating and cell-binding polyzwitterionic micelles as potent oral nanomedicine for cancer drug delivery Adv. Mater. 2022 34 2109189 10.1002/adma.202109189 35196415 137. Wang Z. Chen D. Wang H. Bao S. Lang L. Cui C. Song H. Yang J. Liu W. The unprecedented biodegradable polyzwitterion: A removal-free patch for accelerating infected diabetic wound healing Adv. Mater. 2024 36 2404297 10.1002/adma.202404297 38734972 138. Wang H. Liu B. Chen D. Wang Z. Wang H. Bao S. Zhang P. Yang J. Liu W. Low hysteresis zwitterionic supramolecular polymer ion-conductive elastomers with anti-freezing properties, high stretchability, and self-adhesion for flexible electronic devices Mater. Horiz. 2024 11 2628 2642 10.1039/D4MH00174E 38501271 139. Yuan D. Li Q. Zhang Q. Zhou F. Zhao Q. Zhao M. Enhanced curcumin transportation across epithelial barrier by mucus-permeable soy protein nanoparticles-mediated dual transcytosis pathways Food Chem. 2024 437 137771 10.1016/j.foodchem.2023.137771 37897825 140. Yuan D. Niu Z. Zheng W. Zhao Q. Zhou F. Zhao M. Mind the particle rigidity: Blooms the bioavailability via rapidly crossing the mucus layer and alters the intracellular fate of curcumin ACS Nano 2024 18 27026 27041 10.1021/acsnano.4c09838 39297569 141. Wang S. Meng S. Zhou X. Gao Z. Piao M.G. pH-Responsive and mucoadhesive nanoparticles for enhanced oral Insulin delivery: The effect of hyaluronic acid with different molecular weights Pharmaceutics 2023 15 820 10.3390/pharmaceutics15030820 36986680 PMC10056758 142. Fan B. Liu L. Zheng Y. Xing Y. Shen W. Li Q. Wang R. Liang G. Novel pH-responsive and mucoadhesive chitosan-based nanoparticles for oral delivery of low molecular weight heparin with enhanced bioavailability and anticoagulant effect J. Drug Deliv. Sci. Technol. 2022 78 103955 10.1016/j.jddst.2022.103955 143. Xie Y. Jin Z. Ma D. Yin T.H. Zhao K. Palmitic acid- and cysteine-functionalized nanoparticles overcome mucus and epithelial barrier for oral delivery of drug Bioeng. Transl. Med. 2023 8 e10510 10.1002/btm2.10510 37206211 PMC10189451 144. Zhou S. Deng H. Zhang Y. Wu P. He B. Dai W. Zhang H. Zhang Q. Zhao R. Wang X. Thiolated nanoparticles overcome the mucus barrier and epithelial barrier for oral delivery of insulin Mol. Pharm. 2020 17 239 250 10.1021/acs.molpharmaceut.9b00971 31800258 145. Liu Y. Shen J. Shi J. Gu X. Chen H. Wang X. Wang L. Wang P. Hou X. He Y. Functional polymeric core–shell hybrid nanoparticles overcome intestinal barriers and inhibit breast cancer metastasis Chem. Eng. J. 2022 427 131742 10.1016/j.cej.2021.131742 146. Pang H. Huang X. Xu Z.P. Chen C. Han F.Y. Progress in oral insulin delivery by PLGA nanoparticles for the management of diabetes Drug Discov. Today 2023 28 103393 10.1016/j.drudis.2022.103393 36208724 147. Wu J. Zheng Y. Liu M. Shan W. Zhang Z. Huang Y. Biomimetic viruslike and charge reversible nanoparticles to sequentially overcome mucus and epithelial barriers for oral insulin delivery ACS Appl. Mater. Interfaces 2018 10 9916 9928 10.1021/acsami.7b16524 29504398 148. Li J. Zhang Y. Yu M. Wang A. Qiu Y. Fan W. Hovgaard L. Yang M. Li Y. Wang R. The upregulated intestinal folate transporters direct the uptake of ligand-modified nanoparticles for enhanced oral insulin delivery Acta Pharm. Sin. B 2022 12 1460 1472 10.1016/j.apsb.2021.07.024 35530154 PMC9072239 149. Han R. He H. Lu Y. Lu H. Shen S. Wu W. Oral targeted drug delivery to post-gastrointestinal sites J. Control. Release 2024 370 256 276 10.1016/j.jconrel.2024.04.047 38679163 150. Kumar R. Islam T. Nurunnabi M. Mucoadhesive carriers for oral drug delivery J. Control. Release 2022 351 504 559 10.1016/j.jconrel.2022.09.024 36116580 PMC9960552 151. Kim K.S. Na K. Bae Y.H. Nanoparticle oral absorption and its clinical translational potential J. Control. Release 2023 360 149 162 10.1016/j.jconrel.2023.06.024 37348679 152. He Y. Huang Y. Xu H. Yang X. Liu N. Xu Y. Ma R. Zhai J. Ma Y. Guan S. Aptamer-modified M cell targeting liposomes for oral delivery of macromolecules Colloids Surf. B Biointerfaces 2023 222 113109 10.1016/j.colsurfb.2022.113109 36599185 153. Pinto S. Hosseini M. Buckley S.T. Yin W. Garousi J. Gräslund T. van Ijzendoorn S. Santos H.A. Sarmento B. Nanoparticles targeting the intestinal Fc receptor enhance intestinal cellular trafficking of semaglutide J. Control. Release 2024 366 621 636 10.1016/j.jconrel.2024.01.015 38215986 154. Xiao Y. Tang Z. Huang X. Joseph J. Chen W. Liu C. Zhou J. Kong N. Joshi N. Du J. Glucose-responsive oral insulin delivery platform for one treatment a day in diabetes Matter 2021 4 3269 3285 10.1016/j.matt.2021.08.011 155. Liu A. He M. Liu C. Ye Z. Tan C.-P. Liu Y. Gong J. Lei J. He Y. Zhu S. Prevention of hypercholesterolemia with “liposomes in microspheres” composite carriers: A promising approach for intestinal-targeted oral delivery of astaxanthin J. Agric. Food Chem. 2024 72 6118 6132 10.1021/acs.jafc.3c08697 38477232 156. Hu X. Yang G. Chen S. Luo S. Zhang J. Biomimetic and bioinspired strategies for oral drug delivery Biomater. Sci. 2020 8 1020 1044 10.1039/C9BM01378D 31621709 157. Fowler R. Vllasaliu D. Trillo F.F. Garnett M. Alexander C. Horsley H. Smith B. Whitcombe I. Eaton M. Stolnik S. Nanoparticle transport in epithelial cells: Pathway switching through bioconjugation Small 2013 9 3282 3294 10.1002/smll.201202623 23637086 158. Wang J. Tan J. Luo J. Huang P. Zhou W. Chen L. Long L. Zhang L.-m. Zhu B. Yang L. Enhancement of scutellarin oral delivery efficacy by vitamin B12-modified amphiphilic chitosan derivatives to treat type II diabetes induced-retinopathy J. Nanobiotechnol. 2017 15 18 10.1186/s12951-017-0251-z PMC5333415 28249594 159. Chen Y. Wang J. Xu J. Zhang J. Xu S. Zhang Q. Huang J. Peng J. Xu H. Du Q. Fabrication of a polysaccharide-protein/protein complex stabilized oral nanoemulsion to facilitate the therapeutic effects of 1,8-cineole on atherosclerosis ACS Nano 2023 17 9090 9109 10.1021/acsnano.2c12230 37172004 160. Liu R. Fei S. Zhang X. Hua Z. Tan M. Layer-by-layer oral-deliverable nanoparticles targeted microfold cells to promote lutein absorption in alleviating dry eye disease Chem. Eng. J. 2024 479 147590 10.1016/j.cej.2023.147590 161. He J. Ding R. Tao Y. Zhao Z. Yuan R. Zhang H. Wang A. Sun K. Li Y. Shi Y. Folic acid-modified reverse micelle-lipid nanocapsules overcome intestinal barriers and improve the oral delivery of peptides Drug Deliv. 2023 30 2181744 10.1080/10717544.2023.2181744 36855953 PMC9980025 162. Liu R. Zhang X. Fei S. Tan M. Orally deliverable lutein nanoparticles as robust ROS scavenger for dry eye disease by targeting Peyer’s patches and mitochondria of ocular cell Chem. Eng. J. 2024 494 153024 10.1016/j.cej.2024.153024 163. Liu Y. Liu J. Liang J. Zhang M. Li Z. Wang Z. Dang B. Feng N. Mucosal transfer of wheat germ agglutinin modified lipid–polymer hybrid nanoparticles for oral delivery of oridonin Nanomed. Nanotechnol. Biol. Med. 2017 13 2219 2229 10.1016/j.nano.2017.05.003 28539275 164. Luo H. Zhang Y. Chi C. Wang T. Chen L. Li X. Starch nanocarriers for enhanced M-cell transport and oral delivery of bioactive proteins ACS Appl. Nano Mater. 2023 6 4793 4802 10.1021/acsanm.3c00309 165. Verma A. Sharma S. Gupta P.K. Singh A. Teja B.V. Dwivedi P. Gupta G.K. Trivedi R. Mishra P.R. Vitamin B12 functionalized layer by layer calcium phosphate nanoparticles: A mucoadhesive and pH responsive carrier for improved oral delivery of insulin Acta Biomater. 2016 31 288 300 10.1016/j.actbio.2015.12.017 26685755 166. Tian C. Asghar S. Wu Y. Chen Z. Jin X. Yin L. Huang L. Ping Q. Xiao Y. Improving intestinal absorption and oral bioavailability of curcumin via taurocholic acid-modified nanostructured lipid carriers Int. J. Nanomed. 2017 12 7897 7911 10.2147/IJN.S145988 PMC5667785 29138557 167. Xu J. Jiang Z. Peng J. Sun R. Zhang L. Chen Y. Pan D. Huang J. Gong Z. Chen Y. Fabrication of a protein-dextran conjugates formed oral nanoemulsion and its application to deliver the essential oil from Alpinia zerumbet Fructus Int. J. Biol. Macromol. 2023 249 125918 10.1016/j.ijbiomac.2023.125918 37495002 168. Du Y. Tian C. Wang M. Huang D. Wei W. Liu Y. Li L. Sun B. Kou L. Kan Q. Dipeptide-modified nanoparticles to facilitate oral docetaxel delivery: New insights into PepT1-mediated targeting strategy Drug Deliv. 2018 25 1403 1413 10.1080/10717544.2018.1480675 29890854 PMC6058494 169. Fang H. Chen L. Deng Z. Gao Y. Yang Y. Chen Q. Liu Z. In situ polymerization of zwitterions on therapeutic proteins to enable their effective oral delivery ACS Nano 2023 17 1128 1143 10.1021/acsnano.2c08434 36595442 170. Yang Y. Chen Y. Li D. Lin S. Chen H. Wu W. Zhang W. Linolenic acid conjugated chitosan micelles for improving the oral absorption of doxorubicin via fatty acid transporter Carbohydr. Polym. 2023 300 120233 10.1016/j.carbpol.2022.120233 36372473 171. Cui Z. Qin L. Guo S. Cheng H. Zhang X. Guan J. Mao S. Design of biotin decorated enterocyte targeting muco-inert nanocomplexes for enhanced oral insulin delivery Carbohydr. Polym. 2021 261 117873 10.1016/j.carbpol.2021.117873 33766360 172. Wu L. Bai Y. Wang L. Liu X. Zhou R. Li L. Wu R. Zhang Z. Zhu X. Huang Y. Promoting apical-to-basolateral unidirectional transport of nanoformulations by manipulating the nutrient-absorption pathway J. Control. Release 2020 323 151 160 10.1016/j.jconrel.2020.04.013 32277961 173. Guo Z. Liu Y. Luo Y. Mechanisms of carotenoid intestinal absorption and the regulation of dietary lipids: Lipid transporter-mediated transintestinal epithelial pathways Crit. Rev. Food Sci. Nutr. 2024 64 1791 1816 10.1080/10408398.2022.2119204 36069234 174. Kuang H. Peng X. Liu Y. Li D. The pro-absorptive effect of glycosylated zein-fatty acid complexes on fucoxanthin via the lipid transporter protein delivery pathway Food Chem. 2024 446 138892 10.1016/j.foodchem.2024.138892 38432136 175. Zhou X.H. Po A.L.W. Peptide and protein drugs: II. Non-parenteral routes of delivery Int. J. Pharm. 1991 75 117 130 10.1016/0378-5173(91)90185-Q 176. Han X. Lu Y. Xie J. Zhang E. Zhu H. Du H. Wang K. Song B. Yang C. Shi Y. Zwitterionic micelles efficiently deliver oral insulin without opening tight junctions Nat. Nanotechnol. 2020 15 605 614 10.1038/s41565-020-0693-6 32483319 PMC7534179 177. Fan W. Xia D. Zhu Q. Li X. He S. Zhu C. Guo S. Hovgaard L. Yang M. Gan Y. Functional nanoparticles exploit the bile acid pathway to overcome multiple barriers of the intestinal epithelium for oral insulin delivery Biomaterials 2018 151 13 23 10.1016/j.biomaterials.2017.10.022 29055774 178. Liu C. Liu W. Liu Y. Duan H. Chen L. Zhang X. Jin M. Cui M. Quan X. Pan L. Versatile flexible micelles integrating mucosal penetration and intestinal targeting for effectively oral delivery of paclitaxel Acta Pharm. Sin. B 2023 13 3425 3443 10.1016/j.apsb.2023.05.029 37655335 PMC10466001 179. Lei T. Yang Z. Jiang C. Wang X. Yang W. Yang X. Xie R. Tong F. Xia X. Huang Q. Mannose-integrated nanoparticle hitchhike glucose transporter 1 recycling to overcome various barriers of oral delivery for Alzheimer’s disease therapy ACS Nano 2024 18 3234 3250 10.1021/acsnano.3c09715 38214975 180. Wang G. Zhao L. Jiang Q. Sun Y. Zhao D. Sun M. He Z. Sun J. Wang Y. Intestinal OCTN2- and MCT1-targeted drug delivery to improve oral bioavailability Asian J. Pharm. Sci. 2020 15 158 172 10.1016/j.ajps.2020.02.002 32256846 PMC7118283 181. Xi Z. Ahmad E. Zhang W. Li J. Wang A. Faridoon Wang N. Zhu C. Huang W. Xu L. Dual-modified nanoparticles overcome sequential absorption barriers for oral insulin delivery J. Control. Release 2022 342 1 13 10.1016/j.jconrel.2021.11.045 34864116 182. Ma Y. Li C. Han F. Liu Y. Hani U.E. Zhong Y. Huang D. Chen W. Qian H. Oral delivery of berberine by liver-targeted zwitterionic nanoparticles to overcome multi-intestinal barriers and extend insulin treatment duration Chem. Eng. J. 2024 485 150129 10.1016/j.cej.2024.150129 183. Zhang Y. Wang Y. Lu Y. Quan H. Wang Y. Song S. Guo H. Advanced oral drug delivery systems for gastrointestinal targeted delivery: The design principles and foundations J. Nanobiotechnol. 2025 23 400 10.1186/s12951-025-03479-8 PMC12124048 40448152 Figure 1 Gastrointestinal barriers that bioactive substances need to pass through before being absorbed by the small intestine. Figure 2 The way in which nanodelivery systems and substances with different properties pass through the intestinal epithelial barrier. Figure 3 Passive targeted nanodelivery systems for different barriers. Figure 4 Some receptors and transporters exist in M cells and enterocytes for the design of nanodelivery systems. Figure 5 Different forms and efficiencies of passive and active targeted nanodelivery systems loaded with bioactive substances entering systemic circulation after overcoming the gastrointestinal barrier. foods-14-03234-t001_Table 1 Table 1 Some enzyme-responsive nanodelivery systems. Bioactive Substances Main Material Model Main Results References Anthocyanin Modified starch In vitro and vivo The bioavailability of anthocyanin in nanoemulsions in mice was about 2 times that of free anthocyanin. [ 74 Curcumin Soybean lipophilic protein In vitro and vivo The nanoemulsion increased the bioaccessibility of curcumin from 46.33% of free curcumin to 76.14%. [ 77 Zein, sodium caseinate and quaternary ammonium chitosan In vitro and vivo The bioaccessibility of curcumin in free curcumin, uncoated zein–sodium caseinate nanoparticles and positively charged quaternary ammonium chitosan-coated protein nanoparticles is 10.8%, 23.7% and 45.2%, respectively. [ 80 Apigenin Casein In vitro and vivo The bioavailability of apigenin in nanoparticles in rats was 3.0 times higher than that in free group. [ 78 Mulberry anthocyanins Caseinate and konjac glucomannan In vitro After continuous digestion in simulated intestinal juice for 3 h, the cumulative release of nanoparticles was 85.07%, which was higher than 74.30% of free anthocyanins. [ 81 Phloretin Gliadin and sodium carboxymethyl cellulose In vitro The bioaccessibility of phloretin in nanoparticles (55%) was more than twice that of free phloretin (23%) after digestion with simulated gastrointestinal juice. [ 82 foods-14-03234-t002_Table 2 Table 2 Classification and characteristics of passive targeted nanodelivery systems. Types Advantages Disadvantages pH-sensitive This type can solve the premature release of bioactive substances in the gastrointestinal tract and their insufficient accumulation in the target tissue (the small intestine) through the pH difference between the small intestine and stomach. This type focuses primarily on the impact of chemical barriers corresponding to pH on the delivery system, largely ignoring the effect of other gastrointestinal barriers. Enzyme-responsive This type releases bioactive substances in the small intestine after enzyme-related high specific response. Similarly to pH-sensitive nanodelivery systems, this type also fails to account for the obstruction posed by additional gastrointestinal barriers, particularly physical barriers governing the penetration and absorption mechanisms of bioactive substances. Mucoadhesive This type could typically prolong the intestinal residence time by adhering to the intestinal mucus, thereby improving the delivery efficiency. This type may adhere non-specifically to surfaces to which they are not intended to adhere (e.g., gastric mucosa and intestinal contents). In addition, if they trapped in loose mucus layer may be removed with the renewal of mucus, reducing the absorption of bioactive substances by the human body. Mucus-penetrating Compared with mucoadhesive nanodelivery systems, this type may be a more promising strategy to increase the absorption of bioactive substances. Because they are more likely to reach the epithelial cells and subsequently be absorbed. The gastrointestinal stability of this type needs to be ensured, particularly their structural integrity maintenance during digestion, a critical prerequisite for ensuring mucus-penetrating capability. Composite Compared with a single type of delivery system, composite nanodelivery systems that consider multiple barriers have been shown to be more advantageous in the delivery of bioactive substances. This type still ignores the last barrier to overcome the absorption to a certain extent, namely, the intestinal epithelial cell layer. foods-14-03234-t003_Table 3 Table 3 Some single ligand–receptor-mediated targeted nanodelivery systems. Bioactive Substances Main Material Receptors Model Main Results References Exenatide DSPE–PEG–FA, LabrafacWL1349, Span80 FA receptor In vitro and vivo The bioavailability of the targeted nanocomplex (7.53%) was 1.28 and 2.04 times that of the non-targeted and free exenatide groups, respectively. [ 161 Lutein Phycocyanin, triphenylphosphonium-modified chitosan, phycocyanin, 3-boronobenzoic acid-modified yeast β-glucan yeast Dectin-1 receptor In vitro and vivo The concentration of lutein in the targeted nanoparticles in the blood and eyeball of rats was 2.54 and 1.82 times higher than that of free lutein, respectively. [ 162 Oridonin DSPE–PEG2000, LIPOID S100, PLGA, WGA–DOPE Lectin receptor In vitro and vivo The bioavailability of the targeted nanosystem was 9.09 and 1.96 times higher than that of the suspension and non-targeted nanosystem, respectively. [ 163 Ovalbumin Cationic quaternary ammonium corn starch, carboxymethyl corn starch, GRGDS peptide Integrin α5β1 In vitro Compared with the unmodified nanocapsules, the targeted peptide-modified nanocapsules exhibited significantly better ability to target M cells and transport efficiency. [ 164 Insulin P(GA–co–GAPBAPE), DSPE–PEG–Mal, Fc fragment of Immunoglobulin G FcRn In vitro and vivo The continuous hypoglycaemic ability of targeted nanoparticles was up to 16 h, which was 4 times longer than that of free insulin [ 154 VB12–chitosan conjugate, calcium chloride, ammonium phosphate IF receptor In vitro and vivo The bioavailability of VB12-modified nanoparticles (26.91%) was 4.3 times that of unmodified nanoparticles. [ 165 Abbreviations: DSPE–PEG–FA, 1,2-distearoyl-sn-glycero-3-phosphoethanolamine-N-(folate (polyethylene glycol) 2000); WGA–DOPE, wheat germ agglutinin-1,2-dioleoyl- sn-glycero sn N foods-14-03234-t004_Table 4 Table 4 Some single ligand-transporter-mediated targeted nanodelivery systems. Bioactive Substances Main Material Receptors Model Main Results References Curcumin Taurocholic acid–polyethylene glycol 100–monostearate ASBT In vitro and vivo The highest bioavailability of the targeted nanolipids was 15.21 and 65.00 times that of the non-targeted and free curcumin groups, respectively. [ 166 EOFAZ Bovine serum albumin–dextran sulphate conjugate, sodium deoxycholate ASBT In vitro and vivo The bioavailability of deoxycholic acid-targeted modified nanoemulsion and untargeted modified nanoemulsion was 3.83 and 2.65 times that of the free group, respectively. [ 167 Docetaxel Dipeptide modified polyoxyethylene stearate, PLGA PepT1 In vitro and vivo The bioavailability of targeted nanoparticles was 4.39 and 1.95 times higher than that of docetaxel solution and unmodified solution and unmodified, respectively. [ 168 Insulin, immunoglobin G Polymer polymerised from three monomers (cationic, anionic, and zwitterionic ones) PAT1 In vitro and vivo The bioavailability of free insulin, polymer/insulin and polymer/immunoglobin G nanocomplexes encapsulated in enteric capsules was 1.3%, 16.9% and 12.5%, respectively. [ 169 Doxorubicin Linolenic acid conjugated chitosan Fatty acid transporter 4 In vitro and vivo The bioavailability of targeted nanomicelles in rats was 1.66 times higher than that of free doxorubicin. [ 170 Insulin Biotin grafted chitosan, hyaluronic acid Sodium-dependent multivitamins transporter In vitro and vivo Free insulin did not reduce blood glucose, and the highest hypoglycaemic ability of targeted nanocomposites was 1.92 times that of non-targeted nanocomposites. [ 171 DSPE–PEG–Fru, PLGA, DSPE–PEG Glucose transporter 2 In vitro and vivo The bioavailability of fructose- [ 172 Abbreviations: EOFAZ, essential oil from Alpinia zerumbet ",
  "metadata": {
    "Title of this paper": "Advanced oral drug delivery systems for gastrointestinal targeted delivery: The design principles and foundations",
    "Journal it was published in:": "Foods",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469417/"
  }
}