{
  "title": "Paper_1090",
  "abstract": "pmc Oncoimmunology Oncoimmunology 1816 oncoimmun Oncoimmunology 2162-4011 2162-402X Taylor & Francis PMC12477881 PMC12477881.1 12477881 12477881 40999879 10.1080/2162402X.2025.2562220 2562220 1 Version of Record Research Article Research Article Characterization of the immune landscape in healthy mouse prostate and during prostate cancer progression D. PERVIZOU ET AL. ONCOIMMUNOLOGY https://orcid.org/0009-0007-4178-8374 Pervizou Despoina  a Conceptualization Investigation Writing – original draft https://orcid.org/0009-0005-3087-9997 De Chiara Joanna  a Investigation https://orcid.org/0000-0001-9228-8141 Spinelli Lionel  a Data curation Formal analysis https://orcid.org/0009-0001-6422-2724 Nestor-Martin Maïa  a Investigation Chasson Lionel  a Investigation https://orcid.org/0000-0002-5397-391X Len-Tayon Kateryna  b  c  d  e Investigation Writing – review & editing https://orcid.org/0000-0001-6223-9015 Yanushko Darya  b  c  d  e Investigation Writing – review & editing https://orcid.org/0000-0001-7955-6594 Fiore Frédéric  f Methodology https://orcid.org/0000-0002-0702-8319 Bajénoff Marc  a Formal analysis Methodology Resources https://orcid.org/0000-0003-1340-9342 Malissen Bernard  a  f Methodology Writing – review & editing https://orcid.org/0000-0002-5555-046X Metzger Daniel  b  c  d  e Conceptualization Funding acquisition Writing – review & editing https://orcid.org/0000-0002-2666-6877 Laverny Gilles  b  c  d  e Conceptualization Funding acquisition Writing – review & editing https://orcid.org/0000-0002-8980-9193 Henri Sandrine  a  * Conceptualization Data curation Formal analysis Funding acquisition Investigation Methodology Project administration Supervision Validation Visualization Writing – original draft Writing – review & editing a Centre d’Immunologie de Marseille-Luminy Marseille France b Institut de Génétique et de Biologie Moléculaire et Cellulaire, Department of Functional Genomics and Cancer Illkirch France c Centre National de la Recherche Scientifique (CNRS) Illkirch France d Institut National de la Santé et de la Recherche Médicale (INSERM) Illkirch France e Université de Strasbourg Strasbourg France f INSERM, CNRS Marseille France CONTACT Sandrine Henri sandrine.henri@inserm.fr Case 906, 13288 Marseille Cedex 9 Marseille France * Present address is INSERM, Centre d’Etude des Pathologies Respiratoires (CEPR), UMR 1100, Université de Tours, Tours, France. 26 9 2025 2025 14 1 476837 2562220 26 09 2025 30 09 2025 01 10 2025 Integra 23 9 2025 Integra 23 9 2025 12 3 2025 11 8 2025 10 9 2025 © 2025 The Author(s). Published with license by Taylor & Francis Group, LLC. 2025 The Author(s) https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial License ( http://creativecommons.org/licenses/by-nc/4.0/ ABSTRACT The immune landscape of healthy prostate and its alterations during prostate cancer (PCa) progression remain poorly characterized. Using scRNA-sequencing and multiparametric flow-cytometry analysis, we comprehensively characterized immune cells in wild-type and PTEN (i)pe−/− (i)pe−/− + + + SUMMARY Using scRNA-sequencing and flow cytometry, this study uncovers the immune cell landscape in healthy prostate and its dynamic changes during prostate cancer progression, identifying three resident macrophage populations and early immune alterations linked to tumor development (TAMs, TANs, Exhausted T cells). KEYWORDS Prostate PTEN (i)pe−/− resident macrophage subsets Trem2 + tumor-associated-neutrophils (TAN) exhausted CD8 + scRNA-seq multiparametric flow cytometry Fondation ARC pour la recherche sur le cancer 10.13039/501100004097 INCA Région Sud, the Institute for Cancer Immunology (ICI) and Canceropôle PHENOMIN ANR-10-INBS-07 European Research Council 10.13039/100010663 787300 Ministère de l’Enseignement supérieur et de la Recherche Fondation pour la Recherche Médicale Fondation ARC pour la recherche sur le cancer 10.13039/501100004097 Institut National Du Cancer 10.13039/501100006364 INCA2019-191 Institut for Cancer Immunology This work was supported by the French National Cancer Institute (INCA) to G.L. and S.H. ([INCA2019-191]; PLBIO23-177) and to D.M (INCA2019-191); the Fondation ARC pour la recherche sur le cancer [PJA20191209674], the INCA Région Sud, the Institute for Cancer Immunology (ICI) and Canceropôle to S.H [2023-01Kpole]; PHENOMIN (French National Infrastructure for mouse Phenogenomics; [ANR-10-INBS-07]) and the European Research Council (ERC) under the European Union’s Horizon 2020 research and innovation program (grant agreement n° [787300](BASILIC) to B.M.; The Ministère de l’Enseignement supérieur et de la Recherche to D.P., K.L.T. and D.Y., the Fondation pour la Recherche Médicale (FRM) to D.P. and D.Y. and the Fondation ARC pour la recherche sur le cancer to K.L.T.; ANR-10-INBS-04-01 France Bio Imaging to CIML Imagim platform; and the Centre d’Immunologie de Marseille Luminy, which receives its core funding from Aix Marseille University, CNRS, and INSERM. Institut National Du Cancer INCA2019-191, Institut for Cancer Immunology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction The prostate is an exocrine gland of the male reproductive system, composed of epithelial and few neuroendocrine cells supported by a fibroelastic stroma. 1–3 4 Epithelial and stromal cells have been studied in both human and mouse prostates, at steady-state and during PCa progression. 5–8 + 9–11 12 Among genetic alterations implicated in PCa, the loss of PTEN 13 14 15 16–20 (i)pe−/− 21–24 PTEN T2 21 + 21–24 Tumor-associated macrophages (TAMs) are increasingly recognized for their critical role in tumor progression and dissemination, contributing to poor prognosis in various solid tumors. 25 26 27 28 hi 29 30 (i)pe−/− In this study, we conducted an in-depth analysis of immune infiltrates in healthy and cancerous mouse prostates. In PTEN (i)pe−/− + + hi + + + − − + Materials and methods Mice CD64 dtr −/− GFP/WT GFP ΔFIRE 31–36 Slco2b1-IRES-iCre-P2A-hCD2t tm2Ciphe (i)pe−/− 21 T2 T2 T2(tg/0) L2/L2 T2(0/0) L2/L2 L2/L2 (i)pe−/− L2/L2 Mice were housed under specific pathogen-free conditions in temperature- and humidity-controlled animal facility with a 12 h light/dark cycle. Animals were euthanized with carbon dioxide or cervical dislocation, and tissues were immediately collected, weighed and processed for single-cell or histological analysis. Generation of Slco2b1-IRES-iCre-P2A-hCd2t (Slco2b1 hCD2 A targeting construct was designed to introduce an IRES-iCre-P2A-hCD2t cassette in the 3’ untranslated region of the Slco2b1 P06729 37 r Slco2b1 Slco2b1 Intravascular in vivo labeling To distinguish circulating cells from non-circulating cells, mice were injected intravenously with 3 μg of anti CD45.2-FITC for 3 minutes before euthanasia. This procedure ensured the study of immune cells specifically located within the prostate parenchyma (CD45.2 negative), by exclusion of cells present in the vasculature (CD45.2 positive). Cell extraction from prostates and lymphoid organs To isolate cells from spleen and lymph nodes, these organs were processed as previously described. 38 Spleens were collected and dissociated by mechanical disruption in RPMI medium containing 2% FCS. Red blood cells were lysed using RBC lysis buffer (eBioscience) for 5 min at RT. Single cell suspensions were filtered through a 70 μm cell strainer, centrifuged and resuspended in FACS buffer prior to antibody staining. Analysis of blood cells Blood was collected in EDTA-containing tubes and stained with the appropriate antibody mix in PBS-5 mM EDTA solution for 30 min at RT at dark. Red blood cells were lysed with BD FACS Lysing Solution (Becton Dickinson) and the absolute numbers were estimated using CountBright TM In vivo depletion of CD64 + dtr CD64 dtr 31 In vivo uptake of dextran 200 μM of Dextran-FITC with average mol wt 40,000 (fluorescent Isothiocyanate-dextran, 250 MG FD40-250 MG Merck/Sigma-Aldrich) were administered i.v. (100 μl). The recipient mice were sacrificed after 1 h and the blood and prostates were collected for flow cytometry (blood and prostate) or confocal microscopy (prostate). In vivo treatments Three months post tamoxifen, PTEN (i)pe−/− Competitive BM chimeras Anesthetized 8-week-old male C57BL/6J (CD45.2) recipient mice were placed into a 6 mm thick lead cylinder to selectively expose their upper body to irradiation and protect their lower body including the prostate. Mice were then irradiated (8 Gy) and transplanted i.v. with 3 × 10 7 Eight weeks after reconstitution, the level of reconstitution was determined by FACS analysis in blood and prostate. Chimeras were kept on antibiotic-containing water (0.2% Bactrim, Roche). Ex vivo suppressive assay CD8 + L2/L2 + 4 + + + + + + + + (i)pe−/− 4 + + + + Flow cytometry For surface staining, single cell suspensions were preincubated with anti-Fc receptor antibody (clone 2.4G2) at 4°C for 15 min. Cells were centrifuged and stained with appropriate fluorescent labeled monoclonal antibodies (Supplementary Table S2) in Brilliant FACS Buffer (BD) at 4°C for 30 min. Cell viability was determined using DAPI (4,’6-Diamidino-2-Phenylindole, Dihydrochloride) (Life Technologies) or Zombie UV TM 6 Stained cell samples were analyzed on a LSR Fortessa or a FACSymphony Flow Cytometer equipped with FACSDiva software (BD Biosciences), and both instruments were validated prior to data acquisition using Flow Cytometry Calibration Particles (Spherotech, RQC-30-5A). Photomultiplier tube voltages were also adjusted to minimize fluorescence spillover. Single-stain controls were prepared with UltraComp eBeads (Thermo Fisher Scientific) following the manufacturer’s instructions and were used to calculate a compensation matrix. To determine the positive staining for a given marker, Fluorescent Minus One (FMO) controls were performed, consisting of the full staining antibody mix except one antibody. Debris were removed based on forward and side scatter, dead cells were excluded using live/dead staining and doublets were excluded by plotting FSC-A versus FSC-H. Leukocytes were subsequently selected by plotting CD45 versus FSC-A. Immune cell populations were identified using a multiplexed antibody panel targeting 25 cell surface markers specific to either myeloid or lymphoid lineages. The resulting data set was submitted to supervised analysis using either BD FACSDiva™ V9 Software or FlowJo™ V10.7 Software (BD Biosciences) or unsupervised analysis using OMIQ Software. Absolute cell counts were determined using CountBright TM For cell sorting, prostate single-cell suspension was pre-enriched using CD45 MicroBeads following manufacturer’s protocol (Miltenyi, Cat 130–052–301) in the AutoMacs separator (Miltenyi). Subsequently, the enriched sample of CD45 + Cell morphology Sorted cells were spun onto Shandon Cytoslides with a Thermo Shandon Cytospin 4 cytofuge (4 min at 400 g), fixed with methanol and stained with hematoxylin and eosin. Confocal microscopy The whole urogenital system was fixed in Antigen Fix (Microm Microtech) for 4 h, washed in 0.1 M phosphate buffer, then the prostate was isolated under binocular microscope and dehydrated overnight in 30% sucrose in 0.1 M phosphate buffer. Prostates were frozen in Tissue-Tek OCT compound (Electron Microscopy Sciences, Hartfield, PA) and 25-μm sections were permeabilized with 2% BSA Tris buffer. Unspecific binding was blocked with homemade buffer (Tris +2% BSA + triton 1% + 1% FCS + 1% serum) for 30 min and sections were stained with the indicated antibodies for cell identification (Supplementary Table 2) and hoechst for nuclei staining. Immunofluorescence confocal microscopy was performed using a Zeiss LSM 880 confocal microscope. Separate images were collected for each fluorochrome and merged to obtain a multicolor image. Final image processing was performed with Image J. Data analysis FACS data were analyzed using OMIQ (app.OMIQ.ai). First, the data were cleaned by manual gating to remove doublets, debris, and dead cells. Second, UMAP (Uniform Manifold Approximation and Projection) was calculated for all samples together, with subsampling to 100,000 CD45 + Data visualization and statistical analysis were performed using the GraphPad Software Prism 10. scRNA-seq DLV lobes of mouse prostates were isolated and dissociated in single-cell suspension as described above. Prostate samples from three PTEN (i)pe−/− L2/L2 (i)pe−/− − + (i)pe−/− − + + + − + + − Trypan blue exclusion assay was used to determine cell number viability of each FACS-sorted sample using a Neubauer Chamber. Samples with a cell viability of > 95% were processed with a Chromium Controller (10X Genomics, Leiden, The Netherlands). Sixteen thousand cells were loaded per well in nanoliter-scale Gel Beads-in Emulsion (GEMs). Single-cell 3’ mRNA-seq libraries were generated according to “User guide Chromium Next GEM Single Cell 3 prime Reagent Kits v3.3 (Dual index) (10x Genomics, PN CG000315 Analysis of scRNA-seq datasets The complete scRNA-seq dataset is composed of 16 datasets: 2 conditions ×2 time points (3 months/9 months) ×2 replicates (R1/R2) ×2 resequencing (Illumina RUN ID 144 and 188). To ensure a rigorous and traceable analysis, these datasets were analyzed through an iterative process. i. Analysis of individual datasets : Each individual dataset was first independently analyzed to check for the cell quality and the cell heterogeneity using the following workflow. mRNA FASTQ raw files were processed using Cell Ranger v6.0.1 (10X genomics Inc.) software with default parameters to perform alignment, filtering, barcode counting, and unique molecular identifier (UMI) counting. Reads were aligned to the mouse GRCm38/mm10 genome. Datasets were analyzed using the R package Seurat 4.9.9. Quality control was performed to remove poor quality cells. Observing distribution of co-variables we fixed different thresholds for the number of UMIs (max 40,000), number of features (max 6000), percentage of mitochondrial genes (max 10%). We did not fix any threshold for the percentage of ribosomal genes since we observed that good quality neutrophils cells have a low content in ribosomal genes. Cells outside the QC threshold ranges were removed. Identification of putative multiplets was performed using scDblFinder (v 1.12). 39 Expression data were normalized using the NormalizeData function of the Seurat R package (logNormalize method and scale factor of 10,000). We centered the expression data from these factors using the Seurat R package ScaleData function (centering true and scaling false). Feature selection was performed using the FindVariableFeatures Seurat R package function with the vst algorithm and 2000 genes selected. Principal component analysis (PCA) was run using Seurat RunPCA function on those 2000 most variable genes. UMAP dimensionality reduction was run using Seurat RunUMAP function on the first 30 principal components from PCA. Clustering was done with Seurat FindClusters based on the first 30 principal components from PCA dimensionality reduction. Best resolution for clustering was determined using the treeMap package (v2.4–4) and the analysis of the cluster’s marker genes. Marker genes for each cluster were identified using Wilcoxon rank-sum test from Seurat FindAllMarkers with the log fold change threshold set to 0.1 and an adjusted FDR threshold at 0.001. Cell-cycle scores and cell phases were calculated using CellCycleScoring function with s.genes and g2m.genes from the Seurat package. ii. Analysis of merged datasets by time points : The pairs of re-sequenced samples were then combined together using 10x Genomics Cell Ranger in a single analysis to obtain a complete dataset for each combination of condition, time points and replicate. We then used the obtained count matrices to create merged datasets. We first combined separately the two conditions and two replicates datasets for each time point to obtain one dataset per time point. A complete analysis similar to the one performed for individual dataset was applied (for QC, the main filter was on the percentage of mitochondrial genes set to 10% for both datasets, cluster resolution was set to 0.1 and 0.4 for both datasets). After QC, we obtained 27,535 and 8,674 cells, respectively, for the 3-months and 9-month datasets. We observed that, in both datasets, the cells from the two conditions overlapped very well, and we decided not to apply any integration algorithm. Heatmap of expression of genes across clusters was performed using the Heatmap function of the ComplexHeatmap (v2.10.0) R package. 40 Using this annotation, we defined four main cell types: B cells, T/NK cells, myeloids and neutrophils. Each of these groups was then extracted to create a separate dataset that was analyzed using a similar workflow as for the previous dataset. The new clusters obtained from the separate datasets were assigned to cell types using the newly identified marker genes. The differentially expressed genes (DEG) inside each cluster between cells of the two conditions were identified using the FindMarkers function of the Seurat package. Functional enrichment analysis of the DEG was performed using ClusterProfiler (v 4.6.2). iii. Analysis of global merged dataset : The analysis of the time points datasets allowed us to have a good understanding of the data at each time point. We decided to merge the dataset of all conditions, time points and replicates to generate a single complete dataset. A complete analysis similar to the one performed for individual dataset was applied (for QC, thresholds were number of UMIs max 70,000, number of features max 8000, percentage of mitochondrial genes max 10%, cluster resolution was set to 0.1 and 0.4). After QC, we obtained 36,175 cells. We observed that, in both datasets, the cells from the two conditions and two time points overlapped very well, and we decided not to apply any integration algorithm. As before, Azimuth was used to roughly identify cell types and cell type annotation was refined through manual curation of identified marker genes of clusters. Here again, using this annotation, we defined four main cell types: B cells, T/NK cells, myeloids, and neutrophils. Each of these groups was then extracted to create a separate dataset that was analyzed using a similar workflow as for the previous dataset. Moreover, thanks to the increase in cell number, we were able to identify a few cell clusters that were identified as contaminants (Stroma, epithelial, blood vessel, adipocytes and basal cells). Finally, automatic multiplets identification allowed to flag cells that we identified as true multiplets considering gene expression and spatial position in UMAP. Contaminant and multiplets were removed from analysis. The new clusters obtained from the separate datasets were assigned to cell type using the newly identified marker genes. The differentially expressed genes (DEG) inside each cluster between cells of the two conditions were identified using the FindMarkers function of the Seurat package. Functional enrichment analysis of the DEG was performed using ClusterProfiler (v 4.6.2). Statistical analysis of comparison of gene expression among time points or conditions through clusters was performed by a Kruskal-Wallis test followed by Dunn post-hoc tests. In each dataset, differential composition and variability analysis of clusters, respect to change in condition, and time points was performed using sccomp (v 1.5.6). 41 Cell trajectories analysis was first performed using Monocle 3. 42 To confirm trajectories identified by Monocle, we also applied cell dynamic inference using RNA velocity method with velocyto.R (v 0.6). Maps of cell velocity vectors were compared to the trajectories from Monocle and divergent conclusions were not considered for analysis. Human datasets analyses The Trem2 TAM and exhausted-like CD8 + + + 10 The correlation of the signatures with the Gleason score and the Disease-Free Survival were analyzed in the TCGA (The Cancer Genome Atlas) PRAD (Prostate Adenocarcinoma) cohort ( n 43 Results CD11b − − + To characterize the immune landscape of the mouse prostate, we first examined the complexity of the mononuclear phagocytes (MNPs), encompassing monocytes, conventional dendritic cells (cDCs) and macrophages, using flow cytometry with a comprehensive panel of cell surface markers. Non-circulating myeloid cells residing in healthy prostate were separated from blood contaminant using intravascular in vivo + − + Figure 1(a) − + + Figure 1(a) − − + + − − Figure 1(a) + 44 45 + + − + Figure 1(a) − − + − + + − + Figure 1(a) 45 Figure 1. Unraveling the myeloid cell heterogeneity in steady-state mouse prostate. (a) + + − + − + + − + + + + − + + + + + − − − High − int to low + − + (b) Figure 1(a) (c) p p p (d-f) CX3CR1 GFP/WT (d) −/low + high + (e) (f) − + + −/low + − (g) + + + ΔFIRE/+ ΔFIRE/ΔFIRE (h) ΔFIRE/+ ΔFIRE/ΔFIRE p p (i) In vivo (j) + + + + (k) + (l) + + − − n (m) − − − /− n (n) − + − dtr n p p p p The cDC1 identity of XCR1 + + 34 − + − + + + − − + Slco2b1 Figure 1(c) 27 45–48 + 27 − 33 − − − + Figure 1(b) + − − + Prostate-resident CD11b – + – Imaging of DLP sections from CX3CR1 GFP/+ high + + Figure 1(d) high + − Figure 1(e) −/low + Figure 1(d) − + + −/low + − Figure 1(f) + + + Figure 1(g) fms 36 + + ΔFIRE/ΔFIRE Figure 1(g–h) + in vivo + Figure 1(i,j) – – + Prostate-resident macrophages subsets exhibit a low turn-over and CD11b – To assess the turnover the three distinct populations of prostate-resident macrophages and investigate the contribution of circulating monocytes to their renewal, we generated protected bone marrow (BM) chimeric mice ( Figure 1(k) – + – Figure 1(l) Ccr2 –/– 49 – + – Figure 1(m) – + – Additionally, we used CD64 dtr 31 – Figure 1(n) 31 – + – Figure 1(n) – + in situ – This first part focusing on the MNPs in the healthy prostate of adult mice revealed a great heterogeneity of cDCs (cDC1, cDC2), monocytes (P1, P2, P3) and RTM subsets (Tim4 – + – Macrophages and neutrophils are recruited in PIN-containing prostates Following the detailed characterization of the myeloid immune cell composition in the healthy prostate, we next aimed to investigate the alterations in the immune cell compartment in tumors of PTEN (i)pe−/− + + + 22 + Figure 2(a–c) Figure 2(d) 21 + + (i)pe−/− Figure 2(e) Figure 2(f) 11 Figure 2(f) 11 (i)pe−/− Figure 2(g) (i)pe−/− Figure 2. Deciphering the CD45 + (i)pe–/– (a) L2/L2 (i)pe–/– (b) + – (i)pe–/– (c) + – (i)pe−/− n p p (d) + + + (i)pe-–/– (e) (f) (i)pe–/– (g) f (i)pe−/− Trem2 + (i)pe−/− To dissect further the changes within the MNP compartment between healthy prostate and prostate tumors, the four MNPs clusters (Clusters 0, 3, 8, 11) were pooled and subjected independently to unsupervised computation that revealed 18 distinct clusters ( Figure 3(a) 27 29 50–52 Xcr1 Clec9a Wdfy4 Cd209a Plac8 Ly-6C2 Ccr2 + Lyz1 Ccr2 Ear2 Fn1 + Ccl8 Lyve1 FolR2 Timd4 Mrc1 – Cx3cr1 Mmp12 Ccl4 Figure 3(a) – Itgam Itgax Cma1 Tpsb2 Fcer1a 53 Grm8 Ly6d Siglech Plac8 Ly-6C2 + Ccr7 Fscn1 Mreg 54 55 Figure 3. Trem2 + (a) Figure 2(f) (i)pe−/− (b) (i)pe−/− (c) (i)pe−/− (d) (i)pe−/− Figure 1(a) n p (e) − (i)pe−/− (f) − − + + + + − − − (i)pe−/− n p p (g) (i)pe−/− (h) (i)pe−/− (i) − + + (i)pe−/− Interestingly, in PTEN (i)pe−/− SPP1) + – + Figure 3(a,b) + Spp1 Gpnmb Cxcl10 Rsad2 Bglap 56–58 + Figure 3c 56 59 60 + 10 + + + – (i)pe−/− Figure 3(d) + – – (i)pe−/− − + − − + Figure 3(e,f) – + + + Figure 3(g) (i)pe−/− – + Trem2 + (i)pe−/− Differential gene expression analysis (DEG) revealed an enrichment for extracellular matrix (ECM) remodeling with high expression levels of various cathepsins, including Ctsd Ctss Mmp9 Hif1a Eno1 Gapdh Ldha (i)pe−/− Figure 3(h) + Mif 61 62 Apoe Eno1 Gapdh Ldha Figure 3(h) + − + (i)pe−/− Figure 3(i) (i)pe−/− + Mature PD-L1 + Next, we extended our analysis to tumor-associated neutrophils (TANs), which were frequently identified as Gr1 + 22 63 64 (i)pe−/− Figure 2(c) Figure 4(a) 65 (i)pe−/− Figure 4(b) (i)pe−/− 18 66 (i)pe−/− Figure 2(f) S100a9 Ptgs2 Cd274 Arg2 Il1b Il1rn Figure 4(c) (i)pe−/− ex vivo + + + Figure 4(d,e) (i)pe−/− Figure 4. Distinct neutrophil states infiltrated the PIN and adenocarcinoma stages of PTEN (i)pe−/− (a) + + (i)pe−/− (b) + + (i)pe−/− (c) S100a9 Ptgs2 Cd274 Arg2 Il1b Il1rn + Figure 2(f) (i)pe−/− (d) ex vivo + + + (i)pe−/− + + + (e) + (f) Figure 2(f) (i)pe−/− (g) (h) (i)pe−/− (i) (i)pe−/− (j) (i)pe−/− (k) (l) Tumor-associated neutrophils harbor distinct activation states Although neutrophils have been formerly considered as a homogeneous and transient population, recent studies have highlighted a high TAN heterogeneity. 63 67–72 (i)pe−/− Figure 2 Figure 4(f–g) Figure 4(f–g) 63 68 69 Figure 4(f–g) 63 69 Figure 4(h,i) (i)pe−/− Figure 4(j) Figure 4(j) (i)pe−/− Tumor-associated neutrophil subsets display transcriptomic profiles indicative of protumoral activities Transcriptomic profile analysis of the neutrophil clusters revealed that N0 exhibited an interferon-stimulated gene (ISG) signature, expressing high levels of Cxcl10 Gbp5 Gbp2 Ifit1 Ifit2 Ifit3 Figure 4(g) 68 71 72 Ctss Figure 4(k–l) Il1b S100a8 S100a9 Figure 4(g,k–l) Ccl6 Hif1a Eno1 Gapdh Ldha Tnfrsf23 Figure 4(g) 69 Figure 4(k–l) mt-Atp6 mt-Co1 mt-Co2 mt-Co3 Figure 4(g,k–l) Prostate tumors at PIN stage are infiltrated by exhausted-like CD8 + We last focused our analysis on NK and T cells identified in the scRNA-seq dataset. Clusters 1, 4, and 7 described in Figure 2 Figure 5(a) 73–75 + + Foxp3 Ctla4 Tnfrsf4 Figure 5(b) (i)pe−/− + Figure 5(c) (i)pe−/− Figure 5(d) Pdcd1 Lag3 (i)pe−/− Figure 5(e) + + (i)pe−/− high − high + + (i)pe−/− high − + Figure 5(f) + + + + (i)pe−/− + 76 Figure 5(g) + Figure 5(h) + − + + + (i)pe−/− + Figure 5(i) (i)pe−/− + Figure 5. Exhausted CD8 + (a) Figure 2(f) (i)pe−/− (b) (c) (i)pe−/− (d) + (i)pe−/− (e) Pdcd1 Lag3 (i)pe−/− p p (f) high − high + + (i)pe−/− + n p p (g) (i)pe−/− (h) + (i) + − + + + (i)pe−/− Discussion Our study provided a comprehensive characterization of the immune cells in the healthy mouse prostate, as well as of PIN- and adenocarcinoma-containing prostates of PTEN (i)pe−/− 21 (i)pe−/− + + + 10 (i)pe−/− Building on studies of tissue-resident macrophage heterogeneity in various tissues as well as endocrine and exocrine glands, 26 30 31 45 77 + – – + + 27 28 36 + – + 29 – 9 – Tissue-resident macrophages were shown to be long lived cells, originating from embryonic stages, and capable of local self-renewal without input from circulating monocytes as seen in macrophages of the lung, liver, brain, and skin. 26 78 79 26 78 80 + – – 79 Although the number of Tim4 + – (i)pe−/− – + in vitro + in vitro + (i)pe−/− + 56 81–83 + 10 84 + 85 56 59 85 (i)pe−/− + 18 + (i)pe−/− 62 86 (i)pe−/− 24 61 62 87 (i)pe−/− + 56 81–83 87 Research on tumor-associated neutrophils has been hindered by the use of the Gr1 marker to describe MDSCs, which include neutrophil and monocyte lineages with potent immunosuppressive activity. 64 + + (i)pe−/− 22 24 (i)pe−/− + 88 Recent studies have demonstrated that neutrophils represent a heterogeneous population, with reprogramming potential. 63 68–72 68 89 69 (i)pe−/− (i)pe−/− 24 + (i)pe−/− + 24 90 ex vivo A recent neutrophil atlas across various human cancers described the ISG-expressing IFIT1 + + 72 71 + + 91 92 (i)pe−/− 71 72 (i)pe−/− Last but not least, one of the main features of the PTEN (i)pe−/− + 9–11 Overall, in the PTEN (i)pe−/− + + + + (i)pe−/− 93–95 Limitations of our study Using scRNA-seq signature scores, our study provided compelling evidence and a strong concordance between cell phenotypes and their putative biological functions, as validated in studies with sufficient cell numbers. However, the small size of the mouse prostate constrained the yield of specific immune cell subset of interest. Consequently, performing ex vivo + T2(tg/0) L2/L2 T2(0/0) L2/L2 in vivo in vivo T2(tg/0) L2/L2 96 −/− 49 −/− 56 59 85 Supplementary Material Sup Table 1_Pervizou.xlsx Sup Table 2_Pervizou.xlsx Acknowledgments We thank the members of the CIML Cytometry Core Facility. We thank the Genomics Core Facility. We thank the members of the C2BM (Computational Biology, Biostatistics & Modeling platform Cytometry Core Facility) group at CIML for their expert help with data analysis. We thank imaging core facility (ImagImm) of the Centre d’Immunologie de Marseille-Luminy (CIML). We thank the Gemtis genetic engineering platform team at CIPHE for the generation of our mouse model, and their SOPF breeding facilities at CIPHE for maintaining the mouse line founder colonies. We thank the biological resource units for the breeding of animals (CIML, CIPHE). We thank Valentin Le Guen, Rudy Aussel, Hugues Lelouard and David Hume for discussions and providing reagents or mouse model; Pierre Milpied for discussions and help for the scRNA-seq experiments; Pierre Golstein for discussions and the critical reading of the manuscript. We thank Marie Cerciat, Céline Keime and Christelle Thibault-Carpentier from GenomEast, a member of the ‘France Génomique’ consortium (ANR-10-INBS-0009), for their assistance with scRNA-seq (Strasbourg, France; http://www.igbmc.fr/technologies/5/team/54/ D.P., G.L., D.M. and S.H. conceived the project. D.P., J.D.C., and S.H. designed and performed the experiments and analyzed the data. M.N.M. performed confocal microscopy experiments. G.L. supervised the scRNA-seq experiments. L.S. realized the bioinformatic analysis on the scRNA-seq dataset. D.Y. and G.L. performed the bioinformatic analysis of the publicly available human PCa datasets. L.C. performed the prostate tissue sections and histology experiments; K.L.T. and D.Y. contributed to the cell sortings and experimental help prior scRNA-seq. F.F. and B.M. designed the Slco2b1-IRES-cre-hCD2 mice; M.B. performed fluorescent microscopy analysis and provided mouse models; D.P. and S.H wrote the manuscript. S.H., L.S., B.M., D.Y., K.L.T., G.L. and D.M. edited the manuscript. All authors have read and approved the final version of the manuscript. Disclosure statement No potential conflict of interest was reported by the author(s). Data availability statement All data and material are available within the article and its supplementary information file. The scRNA-sequencing data have been deposited in the Gene Expression (GEO) database ( https://www.ncbi.nlm.nih.gov/geo/ GSE271451 https://doi.org/10.57745/CRGTDZ https://doi.org/10.57745/NVZQ25 https://doi.org/10.57745/R1VNP3 https://doi.org/10.57745/4EFY2Z https://github.com/CIML-bioinformatic/BMMlab_Prostate-CD45Pos-PTENKO https://doi.org/10.5281/zenodo.14670913 Ethics statement In vivo The use of publicly available human datasets for research purposes is exempt from formal review by a research ethics committee according to the French law. Supplementary Information Supplemental data for this article can be accessed online at https://doi.org/10.1080/2162402X.2025.2562220 References 1. Joseph DB Turco AE Vezina CM Strand DW. Progenitors in prostate development and disease Dev Biol 2021 473 50 28 10.1016/j.ydbio.2020.11.012 33529704 PMC7987809 2. Cunha GR Vezina CM Isaacson D Ricke WA Timms BG Cao M Franco O Baskin LS Development of the human prostate Differentiation 2018 103 24 45 10.1016/j.diff.2018.08.005 30224091 PMC6234090 3. Timms BG Prostate development: a historical perspective Differentiation 2008 76 6 565 577 10.1111/j.1432-0436.2008.00278.x 18462432 4. Siegel RL Giaquinto AN Jemal A Cancer statistics CA Cancer J Clin 2024 74 1 12 49 10.3322/caac.21820 38230766 5. Chen S Zhu G Yang Y Wang F Xiao YT Zhang N Bian X Zhu Y Yu Y Liu F Single-cell analysis reveals transcriptomic remodellings in distinct cell types that contribute to human prostate cancer progression Nat Cell Biol 2021 23 1 87 98 10.1038/s41556-020-00613-6 33420488 6. Crowley L Cambuli F Aparicio L Shibata M Robinson BD Xuan S Li W Hibshoosh H Loda M Rabadan R A single-cell atlas of the mouse and human prostate reveals heterogeneity and conservation of epithelial progenitors Elife 2020 9 10.7554/eLife.59465 PMC7529463 32915138 7. Henry GH Malewska A Joseph DB Malladi VS Lee J Torrealba J Mauck RJ Gahan JC Raj GV Roehrborn CG A cellular anatomy of the normal adult human prostate and prostatic urethra Cell Rep 2018 25 3530 3542 e3535 10.1016/j.celrep.2018.11.086 30566875 PMC6411034 8. Karthaus WR Hofree M Choi D Linton EL Turkekul M Bejnood A Carver B Gopalan A Abida W Laudone V Regenerative potential of prostate luminal cells revealed by single-cell analysis Science 2020 368 6490 497 505 10.1126/science.aay0267 32355025 PMC7313621 9. Tuong ZK Loudon KW Berry B Richoz N Jones J Tan X Nguyen Q George A Hori S Field S Resolving the immune landscape of human prostate at a single-cell level in health and cancer Cell Rep 2021 37 12 110132 10.1016/j.celrep.2021.110132 34936871 PMC8721283 10. Wong HY Sheng Q Hesterberg AB Croessmann S Rios BL Giri K Jackson J Miranda AX Watkins E Schaffer KR Single cell analysis of cribriform prostate cancer reveals cell intrinsic and tumor microenvironmental pathways of aggressive disease Nat Commun 2022 13 1 6036 10.1038/s41467-022-33780-1 36229464 PMC9562361 11. Hirz T Mei S Sarkar H Kfoury Y Wu S Verhoeven BM Subtelny AO Zlatev DV Wszolek MW Salari K Dissecting the immune suppressive human prostate tumor microenvironment via integrated single-cell and spatial transcriptomic analyses Nat Commun 2023 14 1 663 10.1038/s41467-023-36325-2 36750562 PMC9905093 12. Guo C Sharp A Gurel B Crespo M Figueiredo I Jain S Vogl U Rekowski J Rouhifard M Gallagher L Targeting myeloid chemotaxis to reverse prostate cancer therapy resistance Nature 2023 623 7989 1053 1061 10.1038/s41586-023-06696-z 37844613 PMC10686834 13. Robinson D Van Allen EM Wu YM Schultz N Lonigro RJ Mosquera JM Montgomery B Taplin ME Pritchard CC Attard G Integrative clinical genomics of advanced prostate cancer Cell 2015 162 2 454 10.1016/j.cell.2015.06.053 28843286 14. Abeshouse A Ahn J Akbani R Ally A Amin S Andry C Annala M Aprikian A Armenia J Arora A The molecular taxonomy of primary prostate cancer Cell 2015 163 4 1011 1025 10.1016/j.cell.2015.10.025 26544944 PMC4695400 15. Parisotto M Metzger D Genetically engineered mouse models of prostate cancer Mol Oncol 2013 7 2 190 205 10.1016/j.molonc.2013.02.005 23481269 PMC5528413 16. Di Mitri D Toso A Chen JJ Sarti M Pinton S Jost TR D’Antuono R Montani E Garcia-Escudero R Guccini I Tumour-infiltrating Gr-1+ myeloid cells antagonize senescence in cancer Nature 2014 515 7525 134 137 10.1038/nature13638 25156255 17. Di Mitri D Mirenda M Vasilevska J Calcinotto A Delaleu N Revandkar A Gil V Boysen G Losa M Mosole S Re-education of tumor-associated macrophages by CXCR2 blockade drives senescence and tumor inhibition in advanced prostate cancer Cell Rep 2019 28 8 2156 2168.e5 10.1016/j.celrep.2019.07.068 31433989 PMC6715643 18. Bancaro N Cali B Troiani M Elia AR Arzola RA Attanasio G Lai P Crespo M Gurel B Pereira R Apolipoprotein E induces pathogenic senescent-like myeloid cells in prostate cancer Cancer Cell 2023 41 3 602 619.e11 10.1016/j.ccell.2023.02.004 36868226 19. Calcinotto A Spataro C Zagato E Di Mitri D Gil V Crespo M De Bernardis G Losa M Mirenda M Pasquini E Il-23 secreted by myeloid cells drives castration-resistant prostate cancer Nature 2018 559 7714 363 369 10.1038/s41586-018-0266-0 29950727 PMC6461206 20. Germanos AA Arora S Zheng Y Goddard ET Coleman IM Ku AT Wilkinson S Song H Brady NJ Amezquita RA Defining cellular population dynamics at single-cell resolution during prostate cancer progression Elife 2022 11 10.7554/eLife.79076 PMC9747158 36511483 21. Ratnacaram CK Teletin M Jiang M Meng X Chambon P Metzger D Temporally controlled ablation of PTEN in adult mouse prostate epithelium generates a model of invasive prostatic adenocarcinoma Proc Natl Acad Sci USA 2008 105 7 2521 2526 10.1073/pnas.0712021105 18268330 PMC2268169 22. Parisotto M Grelet E El Bizri R Dai Y Terzic J Eckert D Gargowitsch L Bornert JM Metzger D Pten deletion in luminal cells of mature prostate induces replication stress and senescence in vivo J Exp Med 2018 215 6 1749 1763 10.1084/jem.20171207 29743291 PMC5987915 23. Abu El Maaty MA Grelet E Keime C Rerra AI Gantzer J Emprou C Terzic J Lutzing R Bornert JM Laverny G Single-cell analyses unravel cell type-specific responses to a vitamin D analog in prostatic precancerous lesions Sci Adv 2021 7 31 10.1126/sciadv.abg5982 PMC8324049 34330705 24. Abu El Maaty MA Terzic J Keime C Rovito D Lutzing R Yanushko D Parisotto M Grelet E Namer IJ Lindner V Hypoxia-mediated stabilization of HIF1A in prostatic intraepithelial neoplasia promotes cell plasticity and malignant progression Sci Adv 2022 8 29 eabo2295 10.1126/sciadv.abo2295 35867798 PMC9307253 25. DeNardo DG Ruffell B Macrophages as regulators of tumour immunity and immunotherapy Nat Rev Immunol 2019 19 6 369 382 10.1038/s41577-019-0127-6 30718830 PMC7339861 26. Park MD Silvin A Ginhoux F Merad M Macrophages in health and disease Cell 2022 185 23 4259 4279 10.1016/j.cell.2022.10.007 36368305 PMC9908006 27. Chakarov S Lim HY Tan L Lim SY See P Lum J Zhang XM Foo S Nakamizo S Duan K Two distinct interstitial macrophage populations coexist across tissues in specific subtissular niches Science 2019 363 6432 10.1126/science.aau0964 30872492 28. Zhao J Andreev I Silva HM Resident tissue macrophages: key coordinators of tissue homeostasis beyond immunity Sci Immunol 2024 9 94 eadd1967 10.1126/sciimmunol.add1967 38608039 29. Dawson CA Pal B Vaillant F Gandolfo LC Liu Z Bleriot C Ginhoux F Smyth GK Lindeman GJ Mueller SN Tissue-resident ductal macrophages survey the mammary epithelium and facilitate tissue remodelling Nat Cell Biol 2020 22 5 546 558 10.1038/s41556-020-0505-0 32341550 30. Bijnen M Bajenoff M Gland macrophages: reciprocal control and function within their niche Trends Immunol 2021 42 2 120 136 10.1016/j.it.2020.12.006 33423933 31. Baranska A Shawket A Jouve M Baratin M Malosse C Voluzan O Vu Manh TP Fiore F Bajenoff M Benaroch P Unveiling skin macrophage dynamics explains both tattoo persistence and strenuous removal J Exp Med 2018 215 4 1115 1133 10.1084/jem.20171608 29511065 PMC5881467 32. Boring L Gosling J Chensue SW Kunkel SL Farese RV Broxmeyer HE Charo IF Impaired monocyte migration and reduced type 1 (Th1) cytokine responses in C-C chemokine receptor 2 knockout mice J Clin Invest 1997 100 10 2552 2561 10.1172/JCI119798 9366570 PMC508456 33. Jung S Aliberti J Graemmel P Sunshine MJ Kreutzberg GW Sher A Littman DR Analysis of fractalkine receptor CX(3)CR1 function by targeted deletion and green fluorescent protein reporter gene insertion Mol Cell Biol 2000 20 11 4106 4114 10.1128/MCB.20.11.4106-4114.2000 10805752 PMC85780 34. Satpathy AT Kc W Albring JC Edelson BT Kretzer NM Bhattacharya D Murphy TL Murphy KM Zbtb46 expression distinguishes classical dendritic cells and their committed progenitors from other immune lineages J Exp Med 2012 209 6 1135 1152 10.1084/jem.20120030 22615127 PMC3371733 35. Faust N Varas F Kelly LM Heck S Graf T Insertion of enhanced green fluorescent protein into the lysozyme gene creates mice with green fluorescent granulocytes and macrophages Blood 2000 96 2 719 726 10.1182/blood.V96.2.719.014k29_719_726 10887140 36. Rojo R Raper A Ozdemir DD Lefevre L Grabert K Wollscheid-Lengeling E Bradford B Caruso M Gazova I Sanchez A Deletion of a CSF1R enhancer selectively impacts CSF1R expression and development of tissue macrophage populations Nat Commun 2019 10 1 3215 10.1038/s41467-019-11053-8 31324781 PMC6642117 37. Pettitt SJ Liang Q Rairdan XY Moran JL Prosser HM Beier DR Lloyd KC Bradley A Skarnes WC Agouti C57BL/6N embryonic stem cells for mouse genetic resources Nat Methods 2009 6 7 493 495 10.1038/nmeth.1342 19525957 PMC3555078 38. Wohn C Le Guen V Voluzan O Fiore F Henri S Malissen B Absence of MHC class II on cDC1 dendritic cells triggers fatal autoimmunity to a cross-presented self-antigen Sci Immunol 2020 5 45 10.1126/sciimmunol.aba1896 32169954 39. Germain PL Lun A Garcia Meixide C Macnair W Doublet identification in single-cell sequencing data using scDblfinder F1000Res 2021 10 979 10.12688/f1000research.73600.1 35814628 PMC9204188 40. Gu Z Eils R Schlesner M Complex heatmaps reveal patterns and correlations in multidimensional genomic data Bioinformatics 2016 32 18 2847 2849 10.1093/bioinformatics/btw313 27207943 41. Mangiola S Roth-Schulze AJ Trussart M Zozaya-Valdes E Ma M Gao Z Rubin AF Speed TP Shim H Papenfuss AT Sccomp: robust differential composition and variability analysis for single-cell data Proc Natl Acad Sci USA 2023 120 33 e2203828120 10.1073/pnas.2203828120 37549298 PMC10438834 42. Cao J Spielmann M Qiu X Huang X Ibrahim DM Hill AJ Zhang F Mundlos S Christiansen L Steemers FJ The single-cell transcriptional landscape of mammalian organogenesis Nature 2019 566 496 502 10.1038/s41586-019-0969-x 30787437 PMC6434952 43. Tang Z Kang B Li C Chen T Zhang Z Gepia2: an enhanced web server for large-scale expression profiling and interactive analysis Nucleic Acids Res 2019 47 W1 W556 W560 10.1093/nar/gkz430 31114875 PMC6602440 44. Bosteels C Neyt K Vanheerswynghels M van Helden MJ Sichien D Debeuf N De Prijck S Bosteels V Vandamme N Martens L Inflammatory type 2 cDCs acquire features of cDC1s and macrophages to orchestrate immunity to respiratory virus infection Immunity 2020 52 6 1039 1056.e9 10.1016/j.immuni.2020.04.005 32392463 PMC7207120 45. Tamoutounour S Guilliams M Montanana Sanchis F Liu H Terhorst D Malosse C Pollet E Ardouin L Luche H Sanchez C Origins and functional specialization of macrophages and of conventional and monocyte-derived dendritic cells in mouse skin Immunity 2013 39 5 925 938 10.1016/j.immuni.2013.10.004 24184057 46. Dai XM Ryan GR Hapel AJ Dominguez MG Russell RG Kapp S Sylvestre V Stanley ER Targeted disruption of the mouse colony-stimulating factor 1 receptor gene results in osteopetrosis, mononuclear phagocyte deficiency, increased primitive progenitor cell frequencies, and reproductive defects Blood 2002 99 1 111 120 10.1182/blood.v99.1.111 11756160 47. Sherr CJ Rettenmier CW Sacca R Roussel MF Look AT Stanley ER The c-FMS proto-oncogene product is related to the receptor for the mononuclear phagocyte growth factor, CSF 1 Cell 1985 41 3 665 676 10.1016/s0092-8674(85)80047-7 2408759 48. MacDonald KP Palmer JS Cronau S Seppanen E Olver S Raffelt NC Kuns R Pettit AR Clouston A Wainwright B An antibody against the colony-stimulating factor 1 receptor depletes the resident subset of monocytes and tissue- and tumor-associated macrophages but does not inhibit inflammation Blood 2010 116 19 3955 3963 10.1182/blood-2010-02-266296 20682855 49. Serbina NV Pamer EG Monocyte emigration from bone marrow during bacterial infection requires signals mediated by chemokine receptor CCR2 Nat Immunol 2006 7 311 317 10.1038/ni1309 16462739 50. Dick SA Wong A Hamidzada H Nejat S Nechanitzky R Vohra S Mueller B Zaman R Kantores C Aronoff L Three tissue resident macrophage subsets coexist across organs with conserved origins and life cycles Sci Immunol 2022 7 eabf7777 10.1126/sciimmunol.abf7777 34995099 51. Dwyer DF Barrett NA Austen KF Expression profiling of constitutive mast cells reveals a unique identity within the immune system Nat Immunol 2016 17 7 878 887 10.1038/ni.3445 27135604 PMC5045264 52. Liu Z Wang H Li Z Dress RJ Zhu Y Zhang S De Feo D Kong WT Cai P Shin A Dendritic cell type 3 arises from Ly6C+ monocyte-dendritic cell progenitors Immunity 2023 56 8 1761 1777.e6 10.1016/j.immuni.2023.07.001 37506694 53. Tauber M Basso L Martin J Bostan L Pinto MM Thierry GR Houmadi R Serhan N Loste A Bleriot C Landscape of mast cell populations across organs in mice and humans J Exp Med 2023 220 10.1084/jem.20230570 PMC10354537 37462672 54. Ardouin L Luche H Chelbi R Carpentier S Shawket A Montanana Sanchis F Santa Maria C Grenot P Alexandre Y Gregoire C Broad and largely concordant molecular changes characterize tolerogenic and immunogenic dendritic cell maturation in thymus and periphery Immunity 2016 45 2 305 318 10.1016/j.immuni.2016.07.019 27533013 55. Maier B Leader AM Chen ST Tung N Chang C LeBerichel J Chudnovskiy A Maskey S Walker L Finnigan JP A conserved dendritic-cell regulatory program limits antitumour immunity Nature 2020 580 7802 257 262 10.1038/s41586-020-2134-y 32269339 PMC7787191 56. Katzenelenbogen Y Sheban F Yalin A Yofe I Svetlichnyy D Jaitin DA Bornstein C Moshe A Keren-Shaul H Cohen M Coupled scRNA-seq and intracellular protein activity reveal an immunosuppressive role of TREM2 in cancer Cell 2020 182 872 885 e819 10.1016/j.cell.2020.06.032 32783915 57. Nalio Ramos R Missolo-Koussou Y Gerber-Ferder Y Bromley CP Bugatti M Nunez NG Tosello Boari J Richer W Menger L Denizeau J Tissue-resident FOLR2+ macrophages associate with CD8+ T cell infiltration in human breast cancer Cell 2022 185 7 1189 1207.e25 10.1016/j.cell.2022.02.021 35325594 58. Giraud J Chalopin D Ramel E Boyer T Zouine A Derieppe MA Larmonier N Adotevi O Le Bail B Blanc JF Thbs1+ myeloid cells expand in SLD hepatocellular carcinoma and contribute to immunosuppression and unfavorable prognosis through TREM1 Cell Rep 2024 43 2 113773 10.1016/j.celrep.2024.113773 38350444 59. Molgora M Esaulova E Vermi W Hou J Chen Y Luo J Brioschi S Bugatti M Omodei AS Ricci B TREM2 modulation remodels the tumor myeloid landscape enhancing anti-PD-1 immunotherapy Cell 2020 182 4 886 900.e17 10.1016/j.cell.2020.07.013 32783918 PMC7485282 60. Park MD Reyes-Torres I LeBerichel J Hamon P LaMarche NM Hegde S Belabed M Troncoso L Grout JA Magen A TREM2 macrophages drive NK cell paucity and dysfunction in lung cancer Nat Immunol 2023 24 792 801 10.1038/s41590-023-01475-4 37081148 PMC11088947 61. Mora Barthelmess R Stijlemans B Van Ginderachter JA Hallmarks of cancer affected by the MIF cytokine family Cancers (Basel) 2023 15 2 395 10.3390/cancers15020395 36672343 PMC9856758 62. Noe JT Mitchell RA MIF-dependent control of tumor immunity Front Immunol 2020 11 609948 10.3389/fimmu.2020.609948 33324425 PMC7724107 63. Veglia F Hashimoto A Dweep H Sanseviero E De Leo A Tcyganov E Kossenkov A Mulligan C Nam B Masters G Analysis of classical neutrophils and polymorphonuclear myeloid-derived suppressor cells in cancer patients and tumor-bearing mice J Exp Med 2021 218 4 10.1084/jem.20201803 PMC7879582 33566112 64. Akkari L Amit I Bronte V Fridlender ZG Gabrilovich DI Ginhoux F Hedrick CC Ostrand-Rosenberg S Defining myeloid-derived suppressor cells Nat Rev Immunol 2024 24 12 850 857 10.1038/s41577-024-01062-0 38969773 65. Hidalgo A Chilvers ER Summers C Koenderman L The neutrophil life cycle Trends Immunol 2019 40 7 584 597 10.1016/j.it.2019.04.013 31153737 66. Alshetaiwi H Pervolarakis N McIntyre LL Ma D Nguyen Q Rath JA Nee K Hernandez G Evans K Torosian L Defining the emergence of myeloid-derived suppressor cells in breast cancer using single-cell transcriptomics Sci Immunol 2020 5 44 10.1126/sciimmunol.aay6017 PMC7219211 32086381 67. Blaisdell A Crequer A Columbus D Daikoku T Mittal K Dey SK Erlebacher A Neutrophils oppose uterine epithelial carcinogenesis via debridement of hypoxic tumor cells Cancer Cell 2015 28 6 785 799 10.1016/j.ccell.2015.11.005 26678340 PMC4698345 68. Xie X Shi Q Wu P Zhang X Kambara H Su J Yu H Park SY Guo R Ren Q Single-cell transcriptome profiling reveals neutrophil heterogeneity in homeostasis and infection Nat Immunol 2020 21 9 1119 1133 10.1038/s41590-020-0736-z 32719519 PMC7442692 69. Ng MSF Kwok I Tan L Shi C Cerezo-Wallis D Tan Y Leong K Calvo GF Yang K Zhang Y Deterministic reprogramming of neutrophils within tumors Science 2024 383 6679 eadf6493 10.1126/science.adf6493 38207030 PMC11087151 70. Zilionis R Engblom C Pfirschke C Savova V Zemmour D Saatcioglu HD Krishnan I Maroni G Meyerovitz CV Kerwin CM Single-cell transcriptomics of human and mouse lung cancers reveals conserved myeloid populations across individuals and species Immunity 2019 50 5 1317 1334.e10 10.1016/j.immuni.2019.03.009 30979687 PMC6620049 71. Gungabeesoon J Gort-Freitas NA Kiss M Bolli E Messemaker M Siwicki M Hicham M Bill R Koch P Cianciaruso C A neutrophil response linked to tumor control in immunotherapy Cell 2023 186 7 1448 1464.e20 10.1016/j.cell.2023.02.032 37001504 PMC10132778 72. Wu Y Ma J Yang X Nan F Zhang T Ji S Rao D Feng H Gao K Gu X Neutrophil profiling illuminates anti-tumor antigen-presenting potency Cell 2024 187 6 1422 1439.e24 10.1016/j.cell.2024.02.005 38447573 73. Magen A Nie J Ciucci T Tamoutounour S Zhao Y Mehta M Tran B McGavern DB Hannenhalli S Bosselut R Single-cell profiling defines transcriptomic signatures specific to tumor-reactive versus virus-responsive CD4+ T cells Cell Rep 2019 29 10 3019 3032.e6 10.1016/j.celrep.2019.10.131 31801070 PMC6934378 74. Daniel B Yost KE Hsiung S Sandor K Xia Y Qi Y Hiam-Galvez KJ Black M Jr C Shi Q Divergent clonal differentiation trajectories of T cell exhaustion Nat Immunol 2022 23 11 1614 1627 10.1038/s41590-022-01337-5 36289450 PMC11225711 75. Giraud JS Jouinot A Pasmant E Tlemsani C NF1 mutations as biomarker of response to immune checkpoint blockades for lung adenocarcinoma patients NPJ Precision 2024 8 1 32 10.1038/s41698-024-00524-x PMC10858913 38341500 76. Olofsen PA Stip MC Jansen JHM Chan C Nederend M Tieland RG Tsioumpekou M Leusen JHW Effective, long-term, neutrophil depletion using a murinized anti-Ly-6G 1A8 antibody Cells 2022 11 21 3406 10.3390/cells11213406 36359801 PMC9656769 77. Malissen B Tamoutounour S Henri S The origins and functions of dendritic cells and macrophages in the skin Nat Rev Immunol 2014 14 6 417 428 10.1038/nri3683 24854591 78. Ginhoux F Guilliams M Tissue-resident macrophage ontogeny and homeostasis Immunity 2016 44 3 439 449 10.1016/j.immuni.2016.02.024 26982352 79. Guilliams M Thierry GR Bonnardel J Bajenoff M Establishment and maintenance of the macrophage niche Immunity 2020 52 3 434 451 10.1016/j.immuni.2020.02.015 32187515 80. Hoeffel G Ginhoux F Ontogeny of tissue-resident macrophages Front Immunol 2015 6 486 10.3389/fimmu.2015.00486 26441990 PMC4585135 81. Molgora M Liu YA Colonna M Cella M Trem2: a new player in the tumor microenvironment Semin Immunol 2023 67 101739 10.1016/j.smim.2023.101739 36989543 82. Binnewies M Pollack JL Rudolph J Dash S Abushawish M Lee T Jahchan NS Canaday P Lu E Norng M Targeting TREM2 on tumor-associated macrophages enhances immunotherapy Cell Rep 2021 37 3 109844 10.1016/j.celrep.2021.109844 34686340 83. Yalcin F Haneke H Efe IE Kuhrt LD Motta E Nickl B Fluh C Synowitz M Dzaye O Bader M Tumor associated microglia/macrophages utilize GPNMB to promote tumor growth and alter immune cell infiltration in glioma Acta Neuropathol Commun 2024 12 1 50 10.1186/s40478-024-01754-7 38566120 PMC10985997 84. Gao HT Yang Z Sun H Zhang Y Wang Z Liu WY Wen HZ Qu CB Wang XL Trem2 as an independent predictor of poor prognosis promotes the migration via the PI3K/AKT axis in prostate cancer Am J Transl Res 2023 15 2 779 798 36915769 PMC10006782 85. Liu J Shi Z Li Y Ma J Yao J Yuan Z Wang Y Yang C Li X Xing N High-resolution transcriptome atlas of bladder cancer highlights the functional myeloid subsets in modulating immune microenvironment EBioMedicine 2025 117 105801 10.1016/j.ebiom.2025.105801 40561775 PMC12240107 86. Zhu G Tang Y Geng N Zheng M Jiang J Li L Li K Lei Z Chen W Fan Y HIF-alpha/MIF and NF-kappaB/IL-6 axes contribute to the recruitment of CD11b+Gr-1+ myeloid cells in hypoxic microenvironment of HNSCC Neoplasia 2014 16 2 168 W21 10.1593/neo.132034 24709424 PMC3978397 87. Yan L Wu M Wang T Yuan H Zhang X Zhang H Li T Pandey V Han X Lobie PE Breast cancer stem cells secrete MIF to mediate tumor metabolic reprogramming that drives immune evasion Cancer Res 2024 84 8 1270 1285 10.1158/0008-5472.CAN-23-2390 38335272 88. Wen J Huang G Liu S Wan J Wang X Zhu Y Kaliney W Zhang C Cheng L Wen X Polymorphonuclear MDSCs are enriched in the stroma and expanded in metastases of prostate cancer J Pathol Clin Res 2020 6 3 171 177 10.1002/cjp2.160 32149481 PMC7339199 89. Jaillon S Ponzetta A Di Mitri D Santoni A Bonecchi R Mantovani A Neutrophil diversity and plasticity in tumour progression and therapy Nat Rev Cancer 2020 20 9 485 503 10.1038/s41568-020-0281-y 32694624 90. McGinnis CS Miao Z Superville D Yao W Goga A Reticker-Flynn NE Winkler J Satpathy AT The temporal progression of lung immune remodeling during breast cancer metastasis Cancer Cell 2024 42 6 1018 1031.e6 10.1016/j.ccell.2024.05.004 38821060 PMC11255555 91. Antonicelli F Lorin J Kurdykowski S Gangloff SC Le Naour R Sallenave JM Hornebeck W Grange F Bernard P Cxcl10 reduces melanoma proliferation and invasiveness in vitro and in vivo Br J Dermatol 2011 164 4 720 728 10.1111/j.1365-2133.2010.10176.x 21155750 92. Reschke R Yu J Flood B Higgs EF Hatogai K Gajewski TF Immune cell and tumor cell-derived CXCL10 is indicative of immunotherapy response in metastatic melanoma J Immunother Cancer 2021 9 9 e003521 10.1136/jitc-2021-003521 34593622 PMC8487215 93. Chamoto K Yaguchi T Tajima M Honjo T Insights from a 30-year journey: function, regulation and therapeutic modulation of PD1 Nat Rev Immunol 2023 23 10 682 695 10.1038/s41577-023-00867-9 37185300 94. Sharma P Goswami S Raychaudhuri D Siddiqui BA Singh P Nagarajan A Liu J Subudhi SK Poon C Gant KL Immune checkpoint therapy—current perspectives and future directions Cell 2023 186 8 1652 1669 10.1016/j.cell.2023.03.006 37059068 95. Sumaiya K Langford D Natarajaseenivasan K Shanmughapriya S Macrophage migration inhibitory factor (MIF): A multifaceted cytokine regulated by genetic and physiological strategies Pharmacol Ther 2022 233 108024 10.1016/j.pharmthera.2021.108024 34673115 96. Ordonez-Rueda D Jonsson F Mancardi DA Zhao W Malzac A Liang Y Bertosio E Grenot P Blanquet V Sabrautzki S A hypomorphic mutation in the Gfi1 transcriptional repressor results in a novel form of neutropenia Eur J Immunol 2012 42 9 2395 2408 10.1002/eji.201242589 22684987 ",
  "metadata": {
    "Title of this paper": "A hypomorphic mutation in the Gfi1 transcriptional repressor results in a novel form of neutropenia",
    "Journal it was published in:": "Oncoimmunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477881/"
  }
}