{
  "title": "Paper_942",
  "abstract": "pmc Vis Comput Ind Biomed Art Vis Comput Ind Biomed Art 3824 vciba Visual Computing for Industry, Biomedicine, and Art 2096-496X 2524-4442 Springer PMC12484435 PMC12484435.1 12484435 12484435 41028609 10.1186/s42492-025-00201-1 201 1 Review Application of artificial intelligence in assisting treatment of gynecologic tumors: a systematic review Guo Loufei 1 2 Zhang Shuaitong 3 Chen Hongbo 4 Li Yifu 1 Liu Yang 1 2 Liu Wancheng 1 2 Wang Qiang 5 Tang Zhenchao tangzhenchao@buaa.edu.cn 1 2 6 Jiang Ping drjiangping_pku@sina.com 4 Wang Junjie junjiewang@pku.edu.cn 4 1 https://ror.org/00wk2mp56 grid.64939.31 0000 0000 9999 1211 Beijing Advanced Innovation Center for Big Data-Based Precision Medicine, School of Engineering Medicine, Beihang University, 2 https://ror.org/00wk2mp56 grid.64939.31 0000 0000 9999 1211 Key Laboratory of Big Data-Based Precision Medicine (Beihang University), Ministry of Industry and Information Technology of the People’s Republic of China, 3 https://ror.org/01skt4w74 grid.43555.32 0000 0000 8841 6246 School of Medical Technology, Beijing Institute of Technology, 4 https://ror.org/02v51f717 grid.11135.37 0000 0001 2256 9319 Peking University 3rd Hospital Radiation Oncology Department, 5 https://ror.org/02drdmm93 grid.506261.6 0000 0001 0706 7839 Department of Anesthesiology, National Cancer Center/National Clinical Research Center for Cancer/Cancer Hospital, Chinese Academy of Medical Sciences and Peking Union Medical College, 6 1 10 2025 12 2025 8 479044 23 11 1 2025 15 7 2025 01 10 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ In recent years, the application of artificial intelligence (AI) in medical image analysis has drawn increasing attention in clinical studies of gynecologic tumors. This study presents the development and prospects of AI applications to assist in the treatment of gynecological oncology. The Web of Science database was screened for articles published until August 2023. “artificial intelligence,” “deep learning,” “machine learning,” “radiomics,” “radiotherapy,” “chemoradiotherapy,” “neoadjuvant therapy,” “immunotherapy,” “gynecological malignancy,” “cervical carcinoma,” “cervical cancer,” “ovarian cancer,” “endometrial cancer,” “vulvar cancer,” “Vaginal cancer” were used as keywords. Research articles related to AI-assisted treatment of gynecological cancers were included. A total of 317 articles were retrieved based on the search strategy, and 133 were selected by applying the inclusion and exclusion criteria, including 114 on cervical cancer, 10 on endometrial cancer, and 9 on ovarian cancer. Among the included studies, 44 (33%) focused on prognosis prediction, 24 (18%) on treatment response prediction, 13 (10%) on adverse event prediction, five (4%) on dose distribution prediction, and 47 (35%) on target volume delineation. Target volume delineation and dose prediction were performed using deep Learning methods. For the prediction of treatment response, prognosis, and adverse events, 57 studies (70%) used conventional radiomics methods, 13 (16%) used deep Learning methods, 8 (10%) used spatial-related unconventional radiomics methods, and 3 (4%) used temporal-related unconventional radiomics methods. In cervical and endometrial cancers, target prediction mostly included treatment response, overall survival, recurrence, toxicity undergoing radiotherapy, lymph node metastasis, and dose distribution. For ovarian cancer, the target prediction included platinum sensitivity and postoperative complications. The majority of the studies were single-center, retrospective, and small-scale; 101 studies (76%) had single-center data, 125 studies (94%) were retrospective, and 127 studies (95%) included Less than 500 cases. The application of AI in assisting treatment in gynecological oncology remains limited. Although the results of AI in predicting the response, prognosis, adverse events, and dose distribution in gynecological oncology are superior, it is evident that there is no validation of substantial data from multiple centers for these tasks. Keywords Gynecologic tumors Radiomics Deep learning Treatment response the Young Elite Scientists Sponsorship Program by CAST No.2023QNRC001 Tang Zhenchao National Key R&D Program of China No.2021YFA1301603 Tang Zhenchao the Fundamental Research Funds for the Central Universities No.YWF-23-Q-1074 Tang Zhenchao Key-Area Research and Development Program of Guangdong Province No.2021B0101420005 Tang Zhenchao Capital’s Funds for Health Improvement and Research No.2022-1-2061 Tang Zhenchao the National Natural Science Foundation of China No.82272068 Tang Zhenchao Beijing Natural Science Foundation No.7232133 No.L244060 No.L232132 No.7244337 Zhang Shuaitong Tang Zhenchao CAMS Innovation Fund for Medical Sciences CIFMS No.2022-I2M-C&T-B-086 Tang Zhenchao Beijing Hope Run Special Fund of Cancer Foundation of China No.LC2022A05 Tang Zhenchao Key Specialty program of Natural Science Foundation of Beijing Municipality No.Z20008 Jiang Ping Clinical scientist training program of Peking University No.BMU2023PYJH009 Jiang Ping Hospital key project No.BYSYZD202011 Jiang Ping the Special Fund of National Clinical Key Specialty Construction Program of China (2021) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © China Graphics Society 2025 Introduction In recent years, gynecologic tumors have become a significant health concern worldwide, with a particularly high burden in many low- and middle-income cou ntries [ 1 2 3 4 5 To address this challenge, the identification of effective and reliable prognostic indicators to identify patients likely to benefit from treatment is crucial in gynecologic oncology [ 6 Currently, most prognostic indicators utilized in gynecologic tumors rely on complex multigene signatures obtained through molecular assays [ 7 7 6 8 In clinical practice, medical imaging examinations, such as magnetic resonance imaging (MRI), computed tomography (CT), and positron emission tomography (PET), are widely applied in the diagnosis and treatment of gynecologic tumors. These imaging examinations provide a noninvasive approach to obtain a more comprehensive characterization of gynecologic tumor [ 8 9 11 9 10 In comparison, artificial intelligence (AI) can automatically extract high-dimensional and quantitative features from medical images to depict tumor phenotypes and correlate them with clinical outcomes [ 8 12 6 13 14 This study provides a summary of the AI algorithms used in gynecologic tumor medical image analysis, and then presents a review of the representative applications of AI in assisting the treatment of gynecologic tumors, including predicting dose distribution, treatment response, prognosis, adverse events, and clinical target delineation of patients. Here, three prevalent gynecologic tumors are discussed: cervical, ovarian, and endometrial cancers. Finally, current challenges faced by AI in clinical translatability are summarized and the potential future directions of AI in gynecologic tumors are discussed, focusing on the future application of large models in gynecologic tumors. Methods This systematic review was conducted in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analysis (PRISMA) guidelines [ 15 Search strategy The Literature search was conducted in the Web of Science database. The database was last screened in August 2023. The search syntax was: (TS = (artificial intelligence) OR TS = (deep learning) OR TS = (machine learning) OR TS = (radiomics)) AND (TS = (radiotherapy) OR TS = (chemoradiotherapy) OR TS = (neoadjuvant therapy) OR TS = (immunotherapy)) AND (TS = (gynecological malignancy) OR TS = (cervical carcinoma) OR TS = (cervical cancer) OR TS = (ovarian cancer) OR TS = (endometrial cancer) OR TS = (vulvar cancer) OR TS = (Vaginal cancer)). Study selection A total of 317 articles were retrieved using the search strategy, and the titles and abstracts of these articles were independently screened by two reviewers (L.G. and Y.L.). Discrepancies were resolved by a third reviewer (S.Z.). No automated tools were used for article screening. During full-text review, some articles were found to be outside the scope of this study. Articles that used AI approaches in gynecological oncology to assist treatment were included in this systematic review. Review articles, letters, and editorials were also excluded. Articles unrelated to radiotherapy/chemotherapy, AI, and gynecological oncology were excluded. In total, 133 articles were included in the analysis. The database search and selection processes are described in the inclusion flow diagram in Fig. 1 Fig. 1 Inclusion flow diagram based on PRISMA 2020 [ 15 AI methodology in the field of gynecologic tumors AI refers to the use of artificial methods to achieve intelligence on computers. Over the past two decades, AI has made significant strides and is now widely used in various domains, including natural language processing (NLP) and computer vision [ 16 17 AI methods are also widely used in the field of gynecologic tumors to explore imaging-based prognostic biomarkers. Two primary AI methods are employed to predict the treatment response and prognosis of patients with gynecologic tumors: a radiomics-based approach and a deep learning-based approach. Radiomics-based approach utilizes radiomics features defined by mathematical expressions to construct prediction models using traditional machine learning classifiers. In contrast, the deep learning-based approach automatically learns the tumor phenotype from imaging data without the need to define the expression of the features beforehand. This data-driven approach simplifies the model analysis steps. Radiomics-based approach In 2012, the concept of radiomics was initially proposed [ 18 19 21 22 23 20 24 2 25 Fig. 2 Workflow for radiomics-based approach and deep learning-based approach. Radiomics and deep learning methods can be used to predict treatment response, prognosis, and adverse events in gynecologic oncology patients. VGG and DenseNet are common CNN networks. CNN, convolutional neural network; VGG, Visual geometry group; OS, Overall survival; PFS, Progression-free survival; DFS, Disease-free survival; LC, Local control Numerous studies have focused on analyzing radiomics features extracted from the gross tumor volume (GTV) region before treatment [ 19 14 26 Previous studies have shown that the characteristics of the tumor-host interface can also affect treatment response and prognosis [ 27 28 29 18 Deep learning-based approach Deep learning is an important branch of machine learning that relies on interconnected neural-network layers to generate increasingly high-level representations of a given input. In the field of gynecologic tumors, deep learning methods are widely utilized in clinical applications, such as automatic target delineation [ 30 31 32 33 CNNs are commonly used to analyze medical images of gynecologic tumors. CNN can automatically extract features from the medical imaging data [ 34 34 34 35 36 37 Comparison between radiomics-based approach and deep learning-based approach Both radiomics and deep learning play important roles in analyzing the medical images of gynecologic tumors. To develop a predictive or prognostic model, radiomics usually requires well-annotated imaging data with defined clinical outcomes and a corresponding mask of the tumor as the ROI. By contrast, deep learning requires a larger amount of data, and a precise mask of the tumor is not necessary. Regarding feature extraction, radiomics directly calculates handcrafted features using explicit mathematical expressions, whereas deep learning can automatically learn task-specific features from medical imaging data. The difference in the feature extraction results is that radiomics models have better explainability [ 38 Application of AI in assisting treatment of gynecologic tumors An increasing number of studies have reported that AI tools can extract valuable information from medical images to assist in clinical decision-making for gynecologic tumors [ 39 41 1 Table 1 Characteristics of radiomics studies in gynecologic cancers Reference Disease Study design No. of patients Statistical analysis Data Treatment Prediction target Gui et al. [ 19 Cervical cancer Retrospective, multi-center study 183 Wilcoxon Mann–Whitney test, PCC, 15 different classifiers MRI NCRT Response Liu et al. [ 22 Cervical cancer Retrospective, single center study 82 RF MRI NCRT Response Tian et al. [ 42 Cervical cancer Retrospective, multi-center study 221 + 56 ICC, LASSO, SVM-RFE, ET, RF, ridge regression CT NACT Response Schernberg et al. [ 43 Cervical cancer Retrospective, single center study 69 + 39 χ 2 t PET Definitive chemoradiation plus IGBAT LC, OS Liu et al. [ 44 Cervical cancer Retrospective, multi-center study 178 + 85 Univariate Cox analysis, PCC, LASSO, Kaplan-Meier survival analysis MRI CCRT DFS Arezzo et al. [ 45 Cervical cancer Retrospective, single center study 92 t MRI NACT and radical hysterectomy LNM Lucia et al. [ 46 Cervical cancer Retrospective, multi-center study 52 + 50 NTCP model Dose maps CRT and brachytherapy Toxicity Wei et al. [ 47 Cervical cancer Postoperative, single center study 124 + 54 Levene’s test, t CT Surgery and postoperative radiotherapy Radiation proctitis Yu et al. [ 48 Cervical cancer Retrospective, single center study 84 + 36 LASSO, ICC, LR CT Radiotherapy ± chemotherapy Postoperative malnutrition Ren et al. [ 49 Cervical cancer Retrospective, single center study 192 + 65 Wilcoxon rank-sum test, SBE-SVM CT IMRT Response Sun et al. [ 13 Cervical cancer Retrospective, multi-center study 183 + 92 χ 2 MRI NACT Response Mu et al. [ 29 Cervical cancer Retrospective, multi-center study 78 + 76 LASSO Cox regression, Wilcoxon signed rank test, Fisher exact test, χ 2 18F-FDG PET/CT CRT PFS, OS Yusufaly et al. [ 50 Cervical cancer Retrospective, single center study 95 + 32 Cox regression PET/CT CRT and brachytherapy Response Wu et al. [ 51 Cervical cancer Retrospective, multi-center study 126 + 63 LASSO, LR, SVM MRI Radical hysterectomy and pelvic lymphadenectomy LNM Park et al. [ 52 Cervical cancer Retrospective, single center study 62 + 31 Random survival forest MRI Definitive CRT LC, RC, DMFS, OS Zhang et al. [ 14 Cervical cancer Retrospective, single center study 155 LASSO, LR, Cox regression MRI CCRT Recurrence and DFS Cusumano et al. [ 26 Cervical cancer Retrospective, single center study 88 Wilcoxon-Mann Whitney test, t MRI CRT Response Bowen et al. [ 53 Cervical cancer Postoperative, single center study 21 Skillings-Mack test MRI, PET/CT Definitive external beam radiotherapy and brachytherapy Response Zhang et al. [ 31 Cervical cancer Retrospective, multi-center study 148 + 72 DenseNet-3, SVM MRI NACT Response Kawahara et al. [ 32 Cervical cancer Retrospective, single center study 63 + 26 LASSO, neural network classifiers MRI EBRT followed by intracavitary brachytherapy Recurrence Shen et al. [ 54 Cervical cancer Retrospective, single center study 142 Deep learning model 18F-FDG PET/CT Definitive CRT Local relapse and distant metastasis Zhen et al. [ 33 Cervical cancer Retrospective, single center study 42 VGG-16 CNN Rectum surface dose maps EBRT, brachytherapy Rectum toxicity Cheon et al. [ 55 Cervical cancer Retrospective, single center study 199 + 82 LR, MLP, Lightweight deep learning model Dose parameters Definitive radiotherapy Late bladder toxicity Xiao et al. [ 56 Cervical cancer Retrospective, multi-center study 650 Resnet18, t 2 MRI Radical hysterectomy Identification of DSI Yi et al. [ 57 Ovarian cancer Retrospective, single center study 71 + 31 RF, SVM, LASSO, ICC Genomic data, CT Platinum-based chemotherapy after maximal cytoreductive surgery Platinum resistance Lefebvre et al. [ 58 Endometrial cancer Retrospective, multi-center study 94 + 63 RF, Mann-Whitney U test, Mann-Whitney U test MRI Hysterectomy DMI, LVSI, high-grade status Laios et al. [ 59 Ovarian cancer Postoperative, single center study 209 Kaplan-Meier, Cox proportional hazard regression analysis, five different classifiers Clinical data Cytoreductive surgery PFS, OS Hwangbo et al. [ 60 Ovarian cancer Retrospective, multi-center study 1002 LR, RF, SVM, DNN, Kaplan-Meier, log-rank test Clinicopathologic characteristics, surgical findings, details of chemotherapy, treatment response, survival outcomes Platinum-based NACT Platinum sensitivity Barber et al. [ 61 Ovarian cancer Retrospective, multi-center study 291 NLP, LR, RF, SVM, XGBoost, gradient boosting machines Discrete data predictors, natural language processing of full text reports Debulking surgery Postoperative complication, hospital readmission PCC Pearson correlation coefficient, NCRT Neoadjuvant chemoradiotherapy, ICC Inter-class correlation coefficients, LASSO Least absolute shrinkage and selection operator, ET Extremely randomized trees, RFE Recursive feature elimination, NTCP Logistic normal tissue complication probability, SBE-SVM Sequential backward elimination support vector machine, DMFS Distant metastasis-free survival Application of AI in cervical cancer Cervical cancer is one of the most prevalent tumors in female patients [ 62 19 50 63 Conventional radiomics in cervical cancer Conventional radiomics has demonstrated great potential in predicting the response of cervical cancer to chemoradiotherapy (CRT) [ 26 19 31 64 65 66 67 19 42 Twenty-two articles explored the application of conventional radiomics-based prognostic features in cervical cancer to predict the OS, recurrence, DFS, and LC. Nevertheless, external validation was absent in half of the studies included, with most relying solely on single-center retrospective datasets. Zhang et al. [ 54 44 68 69 18 Six studies revealed the potential predictive value of conventional radiomics for adverse events. Nevertheless, the predictive performance of these proposed models was suboptimal; two studies developed models with AUC values below 0.7, whereas the maximum AUC achieved across all studies was 0.85, indicating limited performance. Le et al. [ 20 47 48 Spatial-related unconventional radiomics in cervical cancer In contrast to conventional radiomics, eight studies employed radiomics features from both intratumoral and peritumoral regions to predict the treatment response and prognosis of cervical cancer [ 29 50 3 13 51 Fig. 3 Radiomics features calculated from multi-time point or intratumoral and peritumoral regions can be used to predict prognosis and response Temporal-related unconventional radiomics in cervical cancer Similar to the radiomics features extracted from pre-treatment medical images to predict pCR, OS, and DFS, features extracted from medical images at multiple time points (pre-treatment, in-treatment, and post-treatment) have also been utilized to predict the prognosis [ 14 26 53 For example, Zhang et al. [ 14 53 26 Deep learning in cervical cancer In cervical cancer, deep learning-based approaches have also demonstrated great potential for predicting treatment response [ 31 32 54 33 55 56 70 71 One major application of deep learning in cervical cancer is the prediction of the treatment response. Three articles included in the systematic review developed deep learning models to predict treatment responses in cervical cancer. For instance, Zhang et al. [ 31 72 55 Another important application is in the prediction of recurrence and metastasis. Five studies used deep learning models to predict the cervical cancer prognosis. Shen et al. [ 54 73 Forty-seven studies explored the application of deep learning methods for automatic clinical target volume (CTV) and organs at risk (OARs) delineation during radiotherapy or brachytherapy in cervical cancer patients. Nie et al. [ 74 vs 75 Five studies used deep learning models for dose distribution prediction in radiotherapy, brachytherapy, and volumetric modulated arc therapy (VMAT) for patients with cervical cancer. Li et al. [ 70 76 n n Collectively, these studies demonstrated the growing role of deep learning in cervical cancer prognosis and risk stratification. The superior performance of deep learning models over traditional approaches demonstrates their ability to capture intricate imaging features that are crucial for clinical decision making. Moreover, models that incorporate multi-modal data tend to achieve higher predictive accuracy, emphasizing the importance of integrating multi-modal information to enhance model robustness. Application of AI in ovarian cancer Ovarian cancer is one of the most prevalent and aggressive gynecological malignancies worldwide. Ten articles used AI methods to predict platinum sensitivity [ 57 60 59 70 Seven studies developed a traditional machine learning model to predict the prognosis and platinum sensitivity in patients with ovarian cancer. Yi et al. [ 57 59 Two studies developed deep learning models to predict the response and prognosis of ovarian cancer. Hwangbo et al. [ 60 61 Application of AI in endometrial cancer Endometrial cancer is a tumor originating in the endometrium, and its prevalence continues to increase worldwide [ 77 58 78 20 Lefebvre et al. [ 58 78 20 Impact of different AI approaches on AI-assisted treatment in gynecologic oncology The application of AI in gynecological oncology has shown remarkable progress driven by various approaches that address the complex demands of assisting doctors with treatment, including treatment response prediction, prognosis prediction, adverse event prediction, dose prediction, and CTV delineation (Fig. 4 Fig. 4 From radiomics to large model: The evolutionary landscape of AI-assisted treatment in gynecologic oncology Conventional radiomics extracts handcrafted features from medical images, enabling a quantitative approach for treatment assessment. This method provides a solid foundation for AI-assisted treatment in gynecological oncology, demonstrating the feasibility of identifying predictive indicators. However, their performance is often constrained by their limited ability to capture complex and high-dimensional imaging features. To address these limitations, spatial-related unconventional radiomics analyzes multiple ROI regions, offering more comprehensive characteristics of heterogeneity in gynecologic tumors, whereas temporal-related unconventional radiomics utilized longitudinal imaging data to monitor dynamic changes during gynecologic cancer treatment. Although these advanced radiomics techniques have enhanced predictive performance, they rely on manual feature analysis and are sensitive to imaging variability. In contrast, deep learning methods, particularly CNN and transformer models, have improved AI-assisted treatment in gynecologic oncology by automatically learning features from images. Deep-learning models generally outperform radiomics methods because of their ability to capture high-throughput and multiscale information. Moreover, deep-learning models that integrate clinical data and multi-modal imaging offer more accurate and personalized predictions, leading to significant improvements in response prediction, prognosis assessment, dose prediction, and target delineation in gynecologic oncology. Although large language models (LLMs), such as ChatGPT and DeepSeek, have not yet been explored for AI-assisted treatment of gynecologic cancer, their rapid development and proven success in NLP and multimodal tasks demonstrate their great potential in the medical field. LLMs trained on vast datasets can understand complex medical concepts and generate insightful analyses, making them well-suited for integrating multi-source data, providing personalized treatment recommendations, and supporting clinical decision-making in gynecologic oncology. Compared to traditional deep-learning models, LLMs can efficiently handle vast, heterogeneous datasets, offering a more scalable and generalizable solution. In the future, applying large models in gynecologic oncology could overcome the current limitations by enabling comprehensive analysis of multi-center, large-scale datasets, facilitating accurate, robust, and clinically applicable AI-assisted treatment. The progression from traditional radiomics to deep learning and LLMs has significantly enhanced the precision and robustness of AI-assisted treatments in gynecologic oncology. Deep learning methods, with their automatic feature extraction, have outperformed traditional approaches in many clinical tasks, whereas large models offer promising advantages in handling large datasets for personalized medicine. AI-assisted treatments are expected to play an increasingly significant role in the management of gynecological cancers. Evaluation of AI studies With the development of radiomics and deep learning, several guidelines and evaluation frameworks have been developed to assess AI research in medical imaging. Radiomics Quality Score (RQS) is a widely accepted evaluation standard in radiomics [ 59 79 80 81 83 RQS The RQS is a commonly recognized evaluation criterion in the field of radiomics research proposed by Lambin et al. [ 84 19 20 31 46 51 57 85 86 20 31 85 86 METRICS METRICS is a quality scoring tool that assesses the quality of radiomics studies, proposed by Kocak et al. [ 79 19 20 31 46 51 57 85 86 20 31 20 86 CLAIM A CLAIM was proposed by Mongan et al. [ 80 87 Clinical translatability of AI models in gynecologic tumors The clinical translatability of AI models in oncology has been widely studied. Determining how to apply AI models in clinical practice in oncology remains challenging. The clinical translatability of AI research in gynecological oncology is currently in its primary stage. Nevertheless, the significance of clinical translatability has been emphasized in many articles [ 88 89 In addition, several studies have focused on the clinical translatability of AI models to other cancers. Several studies have enabled physicians to use AI models for decision-making, thereby validating the clinical translatability of these models. Six resident trainees reviewed images of the same patient to diagnose cervical LNM for thyroid cancer using a deep learning model [ 90 91 vs vs vs Various AI devices for medical imaging have been approved by the Food and Drug Administration (FDA) ( https://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfpmn/pmn.cfm 92 The clinical translatability of AI models for predicting response and prognosis in gynecologic tumors has significant limitations, and it is unclear whether any studies directly apply AI models in the clinical practice of gynecological oncology. There are also limitations to the clinical translatability of AI models to other fields of oncology. Bakrania et al. [ 93 94 95 Discussion Recently published studies have shown the potential of AI in discovering prognostic indicators associated with assisting the treatment of gynecologic tumors. However, the RQS of these studies was relatively low, and there are still some issues and concerns regarding the clinical translatability of these AI-enabled prognostic indicators. Recent studies demonstrated that integrating quantitative features from intra- and peritumoral regions and multiple time-point medical images into a unified AI model can enhance the performance of AI-enabled prognostic indicators. Chen et al. [ 96 52 53 Moreover, current published studies have typically validated AI-enabled prognostic characteristics using single-center and retrospective cohorts. It is important to note that medical images exhibit variations due to differences in acquisition parameters and scanners, leading to potential variability in the performance of AI-enabled prognostic characteristics on medical images from different hospitals. Therefore, it is crucial to validate these prognostic characteristics in multi-center prospective cohorts. CNN models are widely used in studies predicting the treatment response and prognosis for gynecologic tumors; however, research utilizing transformer models in this field is limited. The transformer relies entirely on self-attention mechanisms to calculate the representation between inputs and outputs. The transformer model has an encoding-decoding structure that consists of multi-headed self-attention [ 97 98 100 101 Most AI-enabled prognostic characteristics of gynecologic tumors have been developed using hundreds of well-annotated cases [ 13 42 49 102 103 104 The clinical translatability of AI analyses in gynecological oncology remains significantly constrained. Both the RQS and METRICS scores indicate that only a limited number of studies have assessed the clinical applicability of their models. Furthermore, there is a paucity of research addressing the biological correlates of AI-generated results and only a few studies have conducted cost-effectiveness analyses. These limitations adversely affect the clinical translatability of AI models in gynecological oncology. The potential of AI models will only be realized when their clinical translatability is validated. Future research should focus on enhancing the clinical applicability of AI models. Conclusions In conclusion, AI methods have been widely applied in gynecological oncology and have demonstrated significant potential for discovering prognostic characteristics. However, several issues and concerns must be addressed before they can benefit clinical decision-making for patients with gynecologic tumors, particularly the limited clinical translatability of the AI model. These AI models can provide substantial benefits to patients in clinical practice, but only when the challenges associated with clinical translation are resolved. Abbreviations AI Artificial intelligence MRI Magnetic resonance imaging CT Computed tomography PET Positron emission tomography ADC Apparent diffusion coefficient LACC Locally advanced cervical cancer NLP Natural language processing ROI Region of interest GTV Gross tumor volume FDG Fluorodeoxyglucose OS Overall survival PFS Progression-free survival CNN Convolutional neural network CRT Chemoradiotherapy NCRT Neoadjuvant chemoradiotherapy NACT Neoadjuvant chemotherapy CCRT Concurrent chemoradiotherapy IMRT Intensity modulated radiation therapy pCR Pathological complete response DFS Disease-free survival LNM Lymph node metastasis MLP Multilayer perceptron AUC Area under the curve SVM Support vector machine DNN Deep neural network RQS Radiomics quality score FDA The Food and Drug Administration LC Local control VGG Visual geometry group LRC Locoregional control CTV Clinical target volume OAR Organ at risk VMAT Volumetric modulated arc therapy MtAA-NET Multitask attention adversarial network MI Myometrial invasion LVSI Lymphovascular space invasion LLM Large language model CLAIM CheckList for Artificial Intelligence in Medical Imaging METRICS METhodological RadiomICs Score PCC Pearson correlation coefficient RF Random forest ICC Inter-class correlation coefficients DSI Deep stromal invasion LASSO Least absolute shrinkage and selection operator ET Extremely randomized Trees RFE Recursive feature elimination NTCP Logistic normal tissue complication probability SBE-SVM Sequential backward elimination support vector machine DMFS Distant metastasis-free survival Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Loufei Guo, Shuaitong Zhang and Hongbo Chen contributed equally to this work. Acknowledgements We sincerely appreciate the valuable and constructive suggestions from the editors and reviewers, which have significantly improved the quality of this manuscript. Authors’ contributions JJW, PJ, and ZCT designed and conceived the study; LFG, YFL performed the data curation and formal analysis; JJW, PJ, ZCT, and STZ performed the project administration and supervised the research; LFG, STZ, and HBC wrote the initial manuscript; ZCT, LFG, and STZ revised and improved the manuscript. YL and WCL performed the investigation. QW performed the formal analysis. All the authors have read and approved the final manuscript. JJW from the Peking University 3rd Hospital, radiation oncology department, was responsible for all parts of the study. Funding This paper is supported by the Young Elite Scientists Sponsorship Program by CAST, No. 2023QNRC001; National Key R&D Program of China, No. 2021YFA1301603; the Fundamental Research Funds for the Central Universities, No. YWF-23-Q-1074; the National Natural Science Foundation of China, No. 82272068; Beijing Natural Science Foundation, Nos. L256013, 7232133, 7244337, L244060, L232132; CAMS Innovation Fund for Medical Sciences, No. 2022-I2M-C&T-B-086; Beijing Hope Run Special Fund of Cancer Foundation of China, No. LC2022A05; Key Specialty program of Natural Science Foundation of Beijing Municipality, No. Z20008 Data availability Not applicable. Declarations Competing interests The authors state that there are no known competing interests. References 1. Filho AM Laversanne M Ferlay J Colombet M Piñeros M Znaor A The GLOBOCAN 2022 cancer estimates: data sources, methods, and a snapshot of the cancer burden worldwide Int J Cancer 2025 156 7 1336 1346 10.1002/ijc.35278 39688499 Filho AM, Laversanne M, Ferlay J, Colombet M, Piñeros M, Znaor A et al (2025) The GLOBOCAN 2022 cancer estimates: data sources, methods, and a snapshot of the cancer burden worldwide. Int J Cancer 156(7):1336–1346. 10.1002/ijc.35278 39688499 10.1002/ijc.35278 2. Georgakopoulos P Mehmood S Akalin A Shroyer KR Immunohistochemical localization of HE4 in benign, borderline, and malignant lesions of the ovary Int J Gynecol Pathol 2012 31 6 517 523 10.1097/PGP.0b013e31824fe269 23018214 Georgakopoulos P, Mehmood S, Akalin A, Shroyer KR (2012) Immunohistochemical localization of HE4 in benign, borderline, and malignant lesions of the ovary. Int J Gynecol Pathol 31(6):517–523. 10.1097/PGP.0b013e31824fe269 23018214 10.1097/PGP.0b013e31824fe269 3. Singh D Vignat J Lorenzoni V Eslahi M Ginsburg O Lauby-Secretan B Global estimates of incidence and mortality of cervical cancer in 2020: a baseline analysis of the WHO global cervical cancer elimination initiative Lancet Glob Health 2023 11 2 E197 E206 10.1016/S2214-109X(22)00501-0 36528031 PMC9848409 Singh D, Vignat J, Lorenzoni V, Eslahi M, Ginsburg O, Lauby-Secretan B et al (2023) Global estimates of incidence and mortality of cervical cancer in 2020: a baseline analysis of the WHO global cervical cancer elimination initiative. Lancet Glob Health 11(2):E197–E206. 10.1016/S2214-109X(22)00501-0 36528031 10.1016/S2214-109X(22)00501-0 PMC9848409 4. Bjurberg M Holmberg E Borgfeldt C Flöter-Rådestad A Dahm-Kähler P Hjerpe E Primary treatment patterns and survival of cervical cancer in Sweden: a population-based Swedish gynecologic cancer group study Gynecol Oncol 2019 155 2 229 236 10.1016/j.ygyno.2019.08.022 31477283 Bjurberg M, Holmberg E, Borgfeldt C, Flöter-Rådestad A, Dahm-Kähler P, Hjerpe E et al (2019) Primary treatment patterns and survival of cervical cancer in Sweden: a population-based Swedish gynecologic cancer group study. Gynecol Oncol 155(2):229–236. 10.1016/j.ygyno.2019.08.022 31477283 10.1016/j.ygyno.2019.08.022 5. Gupta S Maheshwari A Parab P Mahantshetty U Hawaldar R Sastri S Neoadjuvant chemotherapy followed by radical surgery versus concomitant chemotherapy and radiotherapy in patients with stage IB2, IIA, or IIB squamous cervical cancer: a randomized controlled trial J Clin Oncol 2018 36 16 1548 1555 10.1200/JCO.2017.75.9985 29432076 Gupta S, Maheshwari A, Parab P, Mahantshetty U, Hawaldar R, Sastri S et al (2018) Neoadjuvant chemotherapy followed by radical surgery versus concomitant chemotherapy and radiotherapy in patients with stage IB2, IIA, or IIB squamous cervical cancer: a randomized controlled trial. J Clin Oncol 36(16):1548–1555. 10.1200/JCO.2017.75.9985 29432076 10.1200/JCO.2017.75.9985 6. Bera K Braman N Gupta A Velcheti V Madabhushi A Predicting cancer outcomes with radiomics and artificial intelligence in radiology Nat Rev Clin Oncol 2022 19 2 132 146 10.1038/s41571-021-00560-7 34663898 PMC9034765 Bera K, Braman N, Gupta A, Velcheti V, Madabhushi A (2022) Predicting cancer outcomes with radiomics and artificial intelligence in radiology. Nat Rev Clin Oncol 19(2):132–146. 10.1038/s41571-021-00560-7 34663898 10.1038/s41571-021-00560-7 PMC9034765 7. Xu YF Zuo FL Wang HL Jing J He XJ The current landscape of predictive and prognostic biomarkers for immune checkpoint blockade in ovarian cancer Front Immunol 2022 13 1045957 10.3389/fimmu.2022.1045957 36389711 PMC9647049 Xu YF, Zuo FL, Wang HL, Jing J, He XJ (2022) The current landscape of predictive and prognostic biomarkers for immune checkpoint blockade in ovarian cancer. Front Immunol 13:1045957. 10.3389/fimmu.2022.1045957 36389711 10.3389/fimmu.2022.1045957 PMC9647049 8. Aerts HJWL Velazquez ER Leijenaar RTH Parmar C Grossmann P Carvalho S Decoding tumour phenotype by noninvasive imaging using a quantitative radiomics approach Nat Commun 2014 5 1 4006 10.1038/ncomms5006 24892406 PMC4059926 Aerts HJWL, Velazquez ER, Leijenaar RTH, Parmar C, Grossmann P, Carvalho S et al (2014) Decoding tumour phenotype by noninvasive imaging using a quantitative radiomics approach. Nat Commun 5(1):4006. 10.1038/ncomms5006 24892406 10.1038/ncomms5006 PMC4059926 9. Mirpour S Mhlanga JC Logeswaran P Russo G Mercier G Subramaniam RM The role of PET/CT in the management of cervical cancer AJR Am J Roentgenol 2013 201 2 W192 W205 10.2214/AJR.12.9830 23883234 Mirpour S, Mhlanga JC, Logeswaran P, Russo G, Mercier G, Subramaniam RM (2013) The role of PET/CT in the management of cervical cancer. AJR Am J Roentgenol 201(2):W192–W205. 10.2214/AJR.12.9830 23883234 10.2214/AJR.12.9830 10. Thomassin-Naggara I Soualhi N Balvay D Darai E Cuenod CA Quantifying tumor vascular heterogeneity with DCE-MRI in complex adnexal masses: a preliminary study J Magn Reson Imaging 2017 46 6 1776 1785 10.1002/jmri.25707 28370815 Thomassin-Naggara I, Soualhi N, Balvay D, Darai E, Cuenod CA (2017) Quantifying tumor vascular heterogeneity with DCE-MRI in complex adnexal masses: a preliminary study. J Magn Reson Imaging 46(6):1776–1785. 10.1002/jmri.25707 28370815 10.1002/jmri.25707 11. Gladwish A Milosevic M Fyles A Xie J Halankar J Metser U Association of apparent diffusion coefficient with disease recurrence in patients with locally advanced cervical cancer treated with radical chemotherapy and radiation therapy Radiology 2016 279 1 158 166 10.1148/radiol.2015150400 26505922 Gladwish A, Milosevic M, Fyles A, Xie J, Halankar J, Metser U et al (2016) Association of apparent diffusion coefficient with disease recurrence in patients with locally advanced cervical cancer treated with radical chemotherapy and radiation therapy. Radiology 279(1):158–166. 10.1148/radiol.2015150400 26505922 10.1148/radiol.2015150400 12. Bi WL Hosny A Schabath MB Giger ML Birkbak NJ Mehrtash A Artificial intelligence in cancer imaging: clinical challenges and applications CA Cancer J Clin 2019 69 2 127 157 10.3322/caac.21552 30720861 PMC6403009 Bi WL, Hosny A, Schabath MB, Giger ML, Birkbak NJ, Mehrtash A et al (2019) Artificial intelligence in cancer imaging: clinical challenges and applications. CA Cancer J Clin 69(2):127–157. 10.3322/caac.21552 30720861 10.3322/caac.21552 PMC6403009 13. Sun CX, Tian X, Liu ZY, Li WL, Li PF, Chen JM et al (2019) Radiomic analysis for pretreatment prediction of response to neoadjuvant chemotherapy in locally advanced cervical cancer: a multicentre study. eBioMedicine 46:160–169. 10.1016/j.ebiom.2019.07.049 10.1016/j.ebiom.2019.07.049 PMC6712288 31395503 14. Zhang Y Liu L Zhang KY Su RX Jia HD Qian LT Nomograms combining clinical and imaging parameters to predict recurrence and disease-free survival after concurrent chemoradiotherapy in patients with locally advanced cervical cancer Acad Radiol 2023 30 3 499 508 10.1016/j.acra.2022.08.002 36050264 Zhang Y, Liu L, Zhang KY, Su RX, Jia HD, Qian LT et al (2023) Nomograms combining clinical and imaging parameters to predict recurrence and disease-free survival after concurrent chemoradiotherapy in patients with locally advanced cervical cancer. Acad Radiol 30(3):499–508 36050264 10.1016/j.acra.2022.08.002 15. Page MJ Moher D Bossuyt PM Boutron I Hoffmann TC Mulrow CD PRISMA 2020 explanation and elaboration: updated guidance and exemplars for reporting systematic reviews BMJ 2021 372 n160 10.1136/bmj.n160 33781993 PMC8005925 Page MJ, Moher D, Bossuyt PM, Boutron I, Hoffmann TC, Mulrow CD et al (2021) PRISMA 2020 explanation and elaboration: updated guidance and exemplars for reporting systematic reviews. BMJ 372:n160. 10.1136/bmj.n160 33781993 10.1136/bmj.n160 PMC8005925 16. Jordan MI Mitchell TM Machine learning: trends, perspectives, and prospects Science 2015 349 6245 255 260 10.1126/science.aaa8415 26185243 Jordan MI, Mitchell TM (2015) Machine learning: trends, perspectives, and prospects. Science 349(6245):255–260. 10.1126/science.aaa8415 26185243 10.1126/science.aaa8415 17. Zhang XY Zhang ST Zhang XH Xiong J Han XF Wu ZH Fast virtual stenting for thoracic endovascular aortic repair of aortic dissection using graph deep learning IEEE J Biomed Health Inform 2025 29 6 4374 4387 10.1109/JBHI.2025.3540712 40036417 Zhang XY, Zhang ST, Zhang XH, Xiong J, Han XF, Wu ZH et al (2025) Fast virtual stenting for thoracic endovascular aortic repair of aortic dissection using graph deep learning. IEEE J Biomed Health Inform 29(6):4374–4387. 10.1109/JBHI.2025.3540712 40036417 10.1109/JBHI.2025.3540712 18. Lambin P Rios-Velazquez E Leijenaar R Carvalho S Van Stiphout RGPM Granton P Radiomics: extracting more information from medical images using advanced feature analysis Eur J Cancer 2012 48 4 441 446 10.1016/j.ejca.2011.11.036 22257792 PMC4533986 Lambin P, Rios-Velazquez E, Leijenaar R, Carvalho S, Van Stiphout RGPM, Granton P et al (2012) Radiomics: extracting more information from medical images using advanced feature analysis. Eur J Cancer 48(4):441–446. 10.1016/j.ejca.2011.11.036 22257792 10.1016/j.ejca.2011.11.036 PMC4533986 19. Gui B Autorino R Miccò M Nardangeli A Pesce A Lenkowicz J Pretreatment MRI radiomics based response prediction model in locally advanced cervical cancer Diagnostics 2021 11 4 631 10.3390/diagnostics11040631 33807494 PMC8066099 Gui B, Autorino R, Miccò M, Nardangeli A, Pesce A, Lenkowicz J et al (2021) Pretreatment MRI radiomics based response prediction model in locally advanced cervical cancer. Diagnostics 11(4):631. 10.3390/diagnostics11040631 33807494 10.3390/diagnostics11040631 PMC8066099 20. Le ZY Wu DM Chen XM Wang L Xu Y Zhao GQ A radiomics approach for predicting acute hematologic toxicity in patients with cervical or endometrial cancer undergoing external-beam radiotherapy Radiother Oncol 2023 182 109489 10.1016/j.radonc.2023.109489 36706957 Le ZY, Wu DM, Chen XM, Wang L, Xu Y, Zhao GQ et al (2023) A radiomics approach for predicting acute hematologic toxicity in patients with cervical or endometrial cancer undergoing external-beam radiotherapy. Radiother Oncol 182:109489. 10.1016/j.radonc.2023.109489 36706957 10.1016/j.radonc.2023.109489 21. Lucia F Visvikis D Desseroit MC Miranda O Malhaire JP Robin P Prediction of outcome using pretreatment 18 Eur J Nucl Med Mol Imaging 2018 45 5 768 786 10.1007/s00259-017-3898-7 29222685 Lucia F, Visvikis D, Desseroit MC, Miranda O, Malhaire JP, Robin P et al (2018) Prediction of outcome using pretreatment 18 29222685 10.1007/s00259-017-3898-7 22. Liu DF Zhang XH Zheng T Shi QL Cui YJ Wang YJ Optimisation and evaluation of the random forest model in the efficacy prediction of chemoradiotherapy for advanced cervical cancer based on radiomics signature from high-resolution T2 weighted images Arch Gynecol Obstet 2021 303 3 811 820 10.1007/s00404-020-05908-5 33394142 PMC7960581 Liu DF, Zhang XH, Zheng T, Shi QL, Cui YJ, Wang YJ et al (2021) Optimisation and evaluation of the random forest model in the efficacy prediction of chemoradiotherapy for advanced cervical cancer based on radiomics signature from high-resolution T2 weighted images. Arch Gynecol Obstet 303(3):811–820. 10.1007/s00404-020-05908-5 33394142 10.1007/s00404-020-05908-5 PMC7960581 23. Laliscia C Gadducci A Mattioni R Orlandi F Giusti S Barcellini A MRI-based radiomics: promise for locally advanced cervical cancer treated with a tailored integrated therapeutic approach Tumori 2022 108 4 376 385 10.1177/03008916211014274 34235995 Laliscia C, Gadducci A, Mattioni R, Orlandi F, Giusti S, Barcellini A et al (2022) MRI-based radiomics: promise for locally advanced cervical cancer treated with a tailored integrated therapeutic approach. Tumori 108(4):376–385. 10.1177/03008916211014274 34235995 10.1177/03008916211014274 24. Guo L Wang W Xie XD Wang SH Zhang YD Machine learning-based models for genomic predicting neoadjuvant chemotherapeutic sensitivity in cervical cancer Biomed Pharmacother 2023 159 114256 10.1016/j.biopha.2023.114256 36652730 Guo L, Wang W, Xie XD, Wang SH, Zhang YD (2023) Machine learning-based models for genomic predicting neoadjuvant chemotherapeutic sensitivity in cervical cancer. Biomed Pharmacother 159:114256. 10.1016/j.biopha.2023.114256 36652730 10.1016/j.biopha.2023.114256 25. Gillies RJ Kinahan PE Hricak H Radiomics: images are more than pictures, they are data Radiology 2016 278 2 563 577 10.1148/radiol.2015151169 26579733 PMC4734157 Gillies RJ, Kinahan PE, Hricak H (2016) Radiomics: images are more than pictures, they are data. Radiology 278(2):563–577. 10.1148/radiol.2015151169 26579733 10.1148/radiol.2015151169 PMC4734157 26. Cusumano D Russo L Gui B Autorino R Boldrini L D’Erme L Evaluation of early regression index as response predictor in cervical cancer: a retrospective study on T2 and DWI MR images Radiother Oncol 2022 174 30 36 10.1016/j.radonc.2022.07.001 35811004 Cusumano D, Russo L, Gui B, Autorino R, Boldrini L, D’Erme L et al (2022) Evaluation of early regression index as response predictor in cervical cancer: a retrospective study on T2 and DWI MR images. Radiother Oncol 174:30–36. 10.1016/j.radonc.2022.07.001 35811004 10.1016/j.radonc.2022.07.001 27. Mezheyeuski A Hrynchyk I Karlberg M Portyanko A Egevad L Ragnhammar P Image analysis-derived metrics of histomorphological complexity predicts prognosis and treatment response in stage II-III colon cancer Sci Rep 2016 6 1 36149 10.1038/srep36149 27805003 PMC5095346 Mezheyeuski A, Hrynchyk I, Karlberg M, Portyanko A, Egevad L, Ragnhammar P et al (2016) Image analysis-derived metrics of histomorphological complexity predicts prognosis and treatment response in stage II-III colon cancer. Sci Rep 6(1):36149. 10.1038/srep36149 27805003 10.1038/srep36149 PMC5095346 28. Sala E Mema E Himoto Y Veeraraghavan H Brenton JD Snyder A Unravelling tumour heterogeneity using next-generation imaging: radiomics, radiogenomics, and habitat imaging Clin Radiol 2017 72 1 3 10 10.1016/j.crad.2016.09.013 27742105 PMC5503113 Sala E, Mema E, Himoto Y, Veeraraghavan H, Brenton JD, Snyder A et al (2017) Unravelling tumour heterogeneity using next-generation imaging: radiomics, radiogenomics, and habitat imaging. Clin Radiol 72(1):3–10. 10.1016/j.crad.2016.09.013 27742105 10.1016/j.crad.2016.09.013 PMC5503113 29. Mu W Liang Y Hall LO Tan Y Balagurunathan Y Wenham R 18 Radiol Artif Intell 2020 2 6 e190218 10.1148/ryai.2020190218 33937845 PMC8082355 Mu W, Liang Y, Hall LO, Tan Y, Balagurunathan Y, Wenham R et al (2020) 18 33937845 10.1148/ryai.2020190218 PMC8082355 30. Liu ZK Liu X Guan H Zhen H Sun YL Chen Q Development and validation of a deep learning algorithm for auto-delineation of clinical target volume and organs at risk in cervical cancer radiotherapy Radiother Oncol 2020 153 172 179 10.1016/j.radonc.2020.09.060 33039424 Liu ZK, Liu X, Guan H, Zhen H, Sun YL, Chen Q et al (2020) Development and validation of a deep learning algorithm for auto-delineation of clinical target volume and organs at risk in cervical cancer radiotherapy. Radiother Oncol 153:172–179. 10.1016/j.radonc.2020.09.060 33039424 10.1016/j.radonc.2020.09.060 31. Zhang YJ Wu C Xiao ZB Lv FR Liu YB A deep learning radiomics nomogram to predict response to neoadjuvant chemotherapy for locally advanced cervical cancer: a two-center study Diagnostics 2023 13 6 1073 10.3390/diagnostics13061073 36980381 PMC10047639 Zhang YJ, Wu C, Xiao ZB, Lv FR, Liu YB (2023) A deep learning radiomics nomogram to predict response to neoadjuvant chemotherapy for locally advanced cervical cancer: a two-center study. Diagnostics 13(6):1073. 10.3390/diagnostics13061073 36980381 10.3390/diagnostics13061073 PMC10047639 32. Kawahara D Nishibuchi I Kawamura M Yoshida T Koh I Tomono K Radiomic analysis for pretreatment prediction of recurrence post-radiotherapy in cervical squamous cell carcinoma cancer Diagnostics 2022 12 10 2346 10.3390/diagnostics12102346 36292034 PMC9600567 Kawahara D, Nishibuchi I, Kawamura M, Yoshida T, Koh I, Tomono K et al (2022) Radiomic analysis for pretreatment prediction of recurrence post-radiotherapy in cervical squamous cell carcinoma cancer. Diagnostics 12(10):2346. 10.3390/diagnostics12102346 36292034 10.3390/diagnostics12102346 PMC9600567 33. Zhen X Chen JW Zhong ZC Hrycushko B Zhou LH Jiang S Deep convolutional neural network with transfer learning for rectum toxicity prediction in cervical cancer radiotherapy: a feasibility study Phys Med Biol 2017 62 21 8246 8263 10.1088/1361-6560/aa8d09 28914611 Zhen X, Chen JW, Zhong ZC, Hrycushko B, Zhou LH, Jiang S et al (2017) Deep convolutional neural network with transfer learning for rectum toxicity prediction in cervical cancer radiotherapy: a feasibility study. Phys Med Biol 62(21):8246–8263. 10.1088/1361-6560/aa8d09 28914611 10.1088/1361-6560/aa8d09 34. Li ZW Liu F Yang WJ Peng SH Zhou J A survey of convolutional neural networks: analysis, applications, and prospects IEEE Trans Neural Netw Learn Syst 2022 33 12 6999 7019 10.1109/TNNLS.2021.3084827 34111009 Li ZW, Liu F, Yang WJ, Peng SH, Zhou J (2022) A survey of convolutional neural networks: analysis, applications, and prospects. IEEE Trans Neural Netw Learn Syst 33(12):6999–7019. 10.1109/TNNLS.2021.3084827 34111009 10.1109/TNNLS.2021.3084827 35. Szegedy C, Ioffe S, Vanhoucke V, Alemi A (2017) Inception-V4, inception-ResNet and the impact of residual connections on learning. In: Proceedings of the 31st AAAI conference on artificial intelligence, AAAI, San Francisco, 4–9 February 2017. 10.1609/aaai.v31i1.11231 36. Sengupta A Ye YT Wang R Liu CA Roy K Going deeper in spiking neural networks: VGG and residual architectures Front Neurosci 2019 13 95 10.3389/fnins.2019.00095 30899212 PMC6416793 Sengupta A, Ye YT, Wang R, Liu CA, Roy K (2019) Going deeper in spiking neural networks: VGG and residual architectures. Front Neurosci 13:95. 10.3389/fnins.2019.00095 30899212 10.3389/fnins.2019.00095 PMC6416793 37. Huang G, Liu Z, Van Der Maaten L, Weinberger KQ (2017) Densely connected convolutional networks. In: Proceedings of the 2017 IEEE conference on computer vision and pattern recognition, IEEE, Honolulu, 21–26 July 2017. 10.1109/CVPR.2017.243 38. Ibrahim A Primakov S Beuque M Woodruff HC Halilaj I Wu G Radiomics for precision medicine: current challenges, future prospects, and the proposal of a new framework Methods 2021 188 20 29 10.1016/j.ymeth.2020.05.022 32504782 Ibrahim A, Primakov S, Beuque M, Woodruff HC, Halilaj I, Wu G et al (2021) Radiomics for precision medicine: current challenges, future prospects, and the proposal of a new framework. Methods 188:20–29. 10.1016/j.ymeth.2020.05.022 32504782 10.1016/j.ymeth.2020.05.022 39. Yang ZJ Zhang YB Zhuo LL Sun KD Meng FL Zhou M Prediction of prognosis and treatment response in ovarian cancer patients from histopathology images using graph deep learning: a multicenter retrospective study Eur J Cancer 2024 199 113532 10.1016/j.ejca.2024.113532 38241820 Yang ZJ, Zhang YB, Zhuo LL, Sun KD, Meng FL, Zhou M et al (2024) Prediction of prognosis and treatment response in ovarian cancer patients from histopathology images using graph deep learning: a multicenter retrospective study. Eur J Cancer 199:113532. 10.1016/j.ejca.2024.113532 38241820 10.1016/j.ejca.2024.113532 40. Cepero A Yang YD Young L Huang JF Ji XM Yang F Longitudinal FDG-PET radiomics for early prediction of treatment response to chemoradiation in locally advanced cervical cancer: a pilot study Cancers 2024 16 22 3813 10.3390/cancers16223813 39594768 PMC11592998 Cepero A, Yang YD, Young L, Huang JF, Ji XM, Yang F (2024) Longitudinal FDG-PET radiomics for early prediction of treatment response to chemoradiation in locally advanced cervical cancer: a pilot study. Cancers 16(22):3813. 10.3390/cancers16223813 39594768 10.3390/cancers16223813 PMC11592998 41. Wang SX Liu XW Wu Y Jiang CS Luo Y Tang X Habitat-based radiomics enhances the ability to predict lymphovascular space invasion in cervical cancer: a multi-center study Front Oncol 2023 13 1252074 10.3389/fonc.2023.1252074 37954078 PMC10637586 Wang SX, Liu XW, Wu Y, Jiang CS, Luo Y, Tang X et al (2023) Habitat-based radiomics enhances the ability to predict lymphovascular space invasion in cervical cancer: a multi-center study. Front Oncol 13:1252074. 10.3389/fonc.2023.1252074 37954078 10.3389/fonc.2023.1252074 PMC10637586 42. Tian X Sun CX Liu ZY Li WL Duan H Wang L Prediction of response to preoperative neoadjuvant chemotherapy in locally advanced cervical cancer using multicenter CT-based radiomic analysis Front Oncol 2020 10 77 10.3389/fonc.2020.00077 32117732 PMC7010718 Tian X, Sun CX, Liu ZY, Li WL, Duan H, Wang L et al (2020) Prediction of response to preoperative neoadjuvant chemotherapy in locally advanced cervical cancer using multicenter CT-based radiomic analysis. Front Oncol 10:77. 10.3389/fonc.2020.00077 32117732 10.3389/fonc.2020.00077 PMC7010718 43. Schernberg A, Reuze S, Orlhac F, Buvat I, Dercle L, Sun R, Limkin E, Escande A, Haie-Meder C, Deutsch E, Chargari C, Robert C (2018) A score combining baseline neutrophilia and primary tumor SUVpeak measured from FDG PET is associated with outcome in locally advanced cervical cancer, Eur. J. Nucl. Med. Mol. Imaging 45:187–195. 10.1007/s00259-017-3824-z. 10.1007/s00259-017-3824-z 28916879 44. Liu B Sun Z Xu ZL Zhao HL Wen DD Li YA Predicting disease-free survival with multiparametric MRI-derived radiomic signature in cervical cancer patients underwent CCRT Front Oncol 2022 11 812993 10.3389/fonc.2021.812993 35145910 PMC8821662 Liu B, Sun Z, Xu ZL, Zhao HL, Wen DD, Li YA et al (2022) Predicting disease-free survival with multiparametric MRI-derived radiomic signature in cervical cancer patients underwent CCRT. Front Oncol 11:812993. 10.3389/fonc.2021.812993 35145910 10.3389/fonc.2021.812993 PMC8821662 45. Arezzo F, Cormio G, Mongelli M, Cazzato G, Silvestris E, Kardhashi A, Cazzolla A, Lombardi C, Venerito V, Loizzi V (2023) Machine learning applied to MRI evaluation for the detection of lymph node metastasis in patients with locally advanced cervical cancer treated with neoadjuvant chemotherapy, Arch. Gynecol. Obstet. 307:1911–1919. 10.1007/s00404-022-06824-6. 10.1007/s00404-022-06824-6 36370209 46. Lucia F Bourbonne V Visvikis D Miranda O Gujral DM Gouders D Radiomics analysis of 3D dose distributions to predict toxicity of radiotherapy for cervical cancer J Pers Med 2021 11 5 398 10.3390/jpm11050398 34064918 PMC8151048 Lucia F, Bourbonne V, Visvikis D, Miranda O, Gujral DM, Gouders D et al (2021) Radiomics analysis of 3D dose distributions to predict toxicity of radiotherapy for cervical cancer. J Pers Med 11(5):398. 10.3390/jpm11050398 34064918 10.3390/jpm11050398 PMC8151048 47. Wei CY Xiang XL Zhou XB Ren SY Zhou QY Dong WJ Development and validation of an interpretable radiomic nomogram for severe radiation proctitis prediction in postoperative cervical cancer patients Front Microbiol 2023 13 1090770 10.3389/fmicb.2022.1090770 36713206 PMC9877536 Wei CY, Xiang XL, Zhou XB, Ren SY, Zhou QY, Dong WJ et al (2023) Development and validation of an interpretable radiomic nomogram for severe radiation proctitis prediction in postoperative cervical cancer patients. Front Microbiol 13:1090770. 10.3389/fmicb.2022.1090770 36713206 10.3389/fmicb.2022.1090770 PMC9877536 48. Yu WK Xu H Chen FJ Shou HF Chen Y Jia YS Development and validation of a radiomics-based nomogram for the prediction of postoperative malnutrition in stage IB1-IIA2 cervical carcinoma Front Nutr 2023 10 1113588 10.3389/fnut.2023.1113588 36819703 PMC9936189 Yu WK, Xu H, Chen FJ, Shou HF, Chen Y, Jia YS et al (2023) Development and validation of a radiomics-based nomogram for the prediction of postoperative malnutrition in stage IB1-IIA2 cervical carcinoma. Front Nutr 10:1113588. 10.3389/fnut.2023.1113588 36819703 10.3389/fnut.2023.1113588 PMC9936189 49. Ren K Shen L Qiu JF Sun K Chen TY Xuan L Treatment planning computed tomography radiomics for predicting treatment outcomes and haematological toxicities in locally advanced cervical cancer treated with radiotherapy: a retrospective cohort study BJOG 2023 130 2 222 230 10.1111/1471-0528.17285 36056595 Ren K, Shen L, Qiu JF, Sun K, Chen TY, Xuan L et al (2023) Treatment planning computed tomography radiomics for predicting treatment outcomes and haematological toxicities in locally advanced cervical cancer treated with radiotherapy: a retrospective cohort study. BJOG 130(2):222–230. 10.1111/1471-0528.17285 36056595 10.1111/1471-0528.17285 50. Yusufaly TI Zou JJ Nelson TJ Williamson CW Simon A Singhal M Improved prognosis of treatment failure in cervical cancer with nontumor PET/CT radiomics J Nucl Med 2022 63 7 1087 1093 10.2967/jnumed.121.262618 34711618 PMC9258568 Yusufaly TI, Zou JJ, Nelson TJ, Williamson CW, Simon A, Singhal M et al (2022) Improved prognosis of treatment failure in cervical cancer with nontumor PET/CT radiomics. J Nucl Med 63(7):1087–1093. 10.2967/jnumed.121.262618 34711618 10.2967/jnumed.121.262618 PMC9258568 51. Wu QX Wang S Chen X Wang Y Dong L Liu ZY Radiomics analysis of magnetic resonance imaging improves diagnostic performance of lymph node metastasis in patients with cervical cancer Radiother Oncol 2019 138 141 148 10.1016/j.radonc.2019.04.035 31252296 Wu QX, Wang S, Chen X, Wang Y, Dong L, Liu ZY et al (2019) Radiomics analysis of magnetic resonance imaging improves diagnostic performance of lymph node metastasis in patients with cervical cancer. Radiother Oncol 138:141–148. 10.1016/j.radonc.2019.04.035 31252296 10.1016/j.radonc.2019.04.035 52. Park SH Hahm MH Bae BK Chong GO Jeong SY Na S Magnetic resonance imaging features of tumor and lymph node to predict clinical outcome in node-positive cervical cancer: a retrospective analysis Radiat Oncol 2020 15 1 86 10.1186/s13014-020-01502-w 32312283 PMC7171757 Park SH, Hahm MH, Bae BK, Chong GO, Jeong SY, Na S et al (2020) Magnetic resonance imaging features of tumor and lymph node to predict clinical outcome in node-positive cervical cancer: a retrospective analysis. Radiat Oncol 15(1):86. 10.1186/s13014-020-01502-w 32312283 10.1186/s13014-020-01502-w PMC7171757 53. Bowen SR Yuh WTC Hippe DS Wu W Partridge SC Elias S Tumor radiomic heterogeneity: multiparametric functional imaging to characterize variability and predict response following cervical cancer radiation therapy Magn Reson Imaging 2018 47 5 1388 1396 10.1002/jmri.25874 PMC5899626 29044908 Bowen SR, Yuh WTC, Hippe DS, Wu W, Partridge SC, Elias S et al (2018) Tumor radiomic heterogeneity: multiparametric functional imaging to characterize variability and predict response following cervical cancer radiation therapy. Magn Reson Imaging 47(5):1388–1396. 10.1002/jmri.25874 10.1002/jmri.25874 PMC5899626 29044908 54. Shen WC Chen SW Wu KC Hsieh TC Liang JA Hung YC Prediction of local relapse and distant metastasis in patients with definitive chemoradiotherapy-treated cervical cancer by deep learning from [ 18 Eur Radiol 2019 29 12 6741 6749 10.1007/s00330-019-06265-x 31134366 Shen WC, Chen SW, Wu KC, Hsieh TC, Liang JA, Hung YC et al (2019) Prediction of local relapse and distant metastasis in patients with definitive chemoradiotherapy-treated cervical cancer by deep learning from [ 18 31134366 10.1007/s00330-019-06265-x 55. Cheon W Han M Jeong S Oh ES Lee SU Lee SB Feature importance analysis of a deep learning model for predicting late bladder toxicity occurrence in uterine cervical cancer patients Cancers 2023 15 13 3463 10.3390/cancers15133463 37444573 PMC10340146 Cheon W, Han M, Jeong S, Oh ES, Lee SU, Lee SB et al (2023) Feature importance analysis of a deep learning model for predicting late bladder toxicity occurrence in uterine cervical cancer patients. Cancers 15(13):3463. 10.3390/cancers15133463 37444573 10.3390/cancers15133463 PMC10340146 56. Xiao ML Qian T Fu L Wei Y Ma FH Gu WY Deep learning nomogram for the identification of deep stromal invasion in patients with early-stage cervical adenocarcinoma and adenosquamous carcinoma: a multicenter study Magn Reson Imaging 2024 59 4 1394 1406 10.1002/jmri.28882 37392060 Xiao ML, Qian T, Fu L, Wei Y, Ma FH, Gu WY et al (2024) Deep learning nomogram for the identification of deep stromal invasion in patients with early‐stage cervical adenocarcinoma and adenosquamous carcinoma: a multicenter study. Magn Reson Imaging 59(4):1394–1406. 10.1002/jmri.28882 10.1002/jmri.28882 37392060 57. Yi XP Liu YZ Zhou BL Xiang W Deng AJ Fu Y Incorporating SULF1 polymorphisms in a pretreatment CT-based radiomic model for predicting platinum resistance in ovarian cancer treatment Biomed Pharmacother 2021 133 111013 10.1016/j.biopha.2020.111013 33227705 Yi XP, Liu YZ, Zhou BL, Xiang W, Deng AJ, Fu Y et al (2021) Incorporating SULF1 polymorphisms in a pretreatment CT-based radiomic model for predicting platinum resistance in ovarian cancer treatment. Biomed Pharmacother 133:111013. 10.1016/j.biopha.2020.111013 33227705 10.1016/j.biopha.2020.111013 58. Lefebvre TL Ueno Y Dohan A Chatterjee A Vallières M Winter-Reinhold E Development and validation of multiparametric MRI-based radiomics models for preoperative risk stratification of endometrial cancer Radiology 2022 305 2 375 386 10.1148/radiol.212873 35819326 Lefebvre TL, Ueno Y, Dohan A, Chatterjee A, Vallières M, Winter-Reinhold E et al (2022) Development and validation of multiparametric MRI-based radiomics models for preoperative risk stratification of endometrial cancer. Radiology 305(2):375–386. 10.1148/radiol.212873 35819326 10.1148/radiol.212873 59. Laios A Katsenou A Tan YS Johnson R Otify M Kaufmann A Feature selection is critical for 2-year prognosis in advanced stage high grade serous ovarian cancer by using machine learning Cancer Control 2021 28 10732748211044678 10.1177/10732748211044678 34693730 PMC8549478 Laios A, Katsenou A, Tan YS, Johnson R, Otify M, Kaufmann A et al (2021) Feature selection is critical for 2-year prognosis in advanced stage high grade serous ovarian cancer by using machine learning. Cancer Control 28:10732748211044678. 10.1177/10732748211044678 34693730 10.1177/10732748211044678 PMC8549478 60. Hwangbo S Kim SI Kim JH Eoh KJ Lee C Kim YT Development of machine learning models to predict platinum sensitivity of high-grade serous ovarian carcinoma Cancers 2021 13 8 1875 10.3390/cancers13081875 33919797 PMC8070756 Hwangbo S, Kim SI, Kim JH, Eoh KJ, Lee C, Kim YT et al (2021) Development of machine learning models to predict platinum sensitivity of high-grade serous ovarian carcinoma. Cancers 13(8):1875. 10.3390/cancers13081875 33919797 10.3390/cancers13081875 PMC8070756 61. Barber EL Garg R Persenaire C Simon M Natural language processing with machine learning to predict outcomes after ovarian cancer surgery Gynecol Oncol 2021 160 1 182 186 10.1016/j.ygyno.2020.10.004 33069375 PMC7779704 Barber EL, Garg R, Persenaire C, Simon M (2021) Natural language processing with machine learning to predict outcomes after ovarian cancer surgery. Gynecol Oncol 160(1):182–186. 10.1016/j.ygyno.2020.10.004 33069375 10.1016/j.ygyno.2020.10.004 PMC7779704 62. Arbyn M Weiderpass E Bruni L De Sanjosé S Saraiya M Ferlay J Estimates of incidence and mortality of cervical cancer in 2018: a worldwide analysis Lancet Glob Health 2020 8 2 E191 E203 10.1016/S2214-109X(19)30482-6 31812369 PMC7025157 Arbyn M, Weiderpass E, Bruni L, De Sanjosé S, Saraiya M, Ferlay J et al (2020) Estimates of incidence and mortality of cervical cancer in 2018: a worldwide analysis. Lancet Glob Health 8(2):E191–E203. 10.1016/S2214-109X(19)30482-6 31812369 10.1016/S2214-109X(19)30482-6 PMC7025157 63. Li HD Zhu MC Jian L Bi F Zhang XY Fang C Radiomic score as a potential imaging biomarker for predicting survival in patients with cervical cancer Front Oncol 2021 11 706043 10.3389/fonc.2021.706043 34485139 PMC8415417 Li HD, Zhu MC, Jian L, Bi F, Zhang XY, Fang C et al (2021) Radiomic score as a potential imaging biomarker for predicting survival in patients with cervical cancer. Front Oncol 11:706043. 10.3389/fonc.2021.706043 34485139 10.3389/fonc.2021.706043 PMC8415417 64. Zhang XM Zhang Q Chen Y Wang SC Zhang JY An JS MRI-based radiomics for pretreatment prediction of response to concurrent chemoradiotherapy in locally advanced cervical squamous cell cancer Abdom Radiol 2023 48 1 367 376 10.1007/s00261-022-03665-4 36222869 Zhang XM, Zhang Q, Chen Y, Wang SC, Zhang JY, An JS et al (2023) MRI-based radiomics for pretreatment prediction of response to concurrent chemoradiotherapy in locally advanced cervical squamous cell cancer. Abdom Radiol 48(1):367–376. 10.1007/s00261-022-03665-4 10.1007/s00261-022-03665-4 36222869 65. Abdalvand N Sadeghi M Mahdavi SR Abdollahi H Qasempour Y Mohammadian F Brachytherapy outcome modeling in cervical cancer patients: a predictive machine learning study on patient-specific clinical, physical and dosimetric parameters Brachytherapy 2022 21 6 769 782 10.1016/j.brachy.2022.06.007 35933272 Abdalvand N, Sadeghi M, Mahdavi SR, Abdollahi H, Qasempour Y, Mohammadian F et al (2022) Brachytherapy outcome modeling in cervical cancer patients: a predictive machine learning study on patient-specific clinical, physical and dosimetric parameters. Brachytherapy 21(6):769–782. 10.1016/j.brachy.2022.06.007 35933272 10.1016/j.brachy.2022.06.007 66. Torheim T Malinen E Kvaal K Lyng H Indahl UG Andersen EKF Classification of dynamic contrast enhanced MR images of cervical cancers using texture analysis and support vector machines IEEE Trans Med Imaging 2014 33 8 1648 1656 10.1109/TMI.2014.2321024 24802069 Torheim T, Malinen E, Kvaal K, Lyng H, Indahl UG, Andersen EKF et al (2014) Classification of dynamic contrast enhanced MR images of cervical cancers using texture analysis and support vector machines. IEEE Trans Med Imaging 33(8):1648–1656. 10.1109/TMI.2014.2321024 24802069 10.1109/TMI.2014.2321024 67. Ren K Shi L Di J Shen L Hu K Hou X Planning CT-based radiomics for the prediction of tumor response to IMRT in locally advanced cervical cancer Int J Radiat Oncol Biol Phys 2020 108 3 e481 10.1016/j.ijrobp.2020.07.1532 Ren K, Shi L, Di J, Shen L, Hu K, Hou X et al (2020) Planning CT-based radiomics for the prediction of tumor response to IMRT in locally advanced cervical cancer. Int J Radiat Oncol Biol Phys 108(3):e481. 10.1016/j.ijrobp.2020.07.1532 68. Kawahara D Nishibuchi I Kawamura M Yoshida T Nagata Y Radiomic analysis for pretreatment prediction of recurrence after radiotherapy in locally advanced cervical cancer Int J Radiat Oncol Biol Phys 2021 111 S3 E93 10.1016/j.ijrobp.2021.07.477 Kawahara D, Nishibuchi I, Kawamura M, Yoshida T, Nagata Y (2021) Radiomic analysis for pretreatment prediction of recurrence after radiotherapy in locally advanced cervical cancer. Int J Radiat Oncol Biol Phys 111(S3):E93 69. Lucia F Visvikis D Vallières M Desseroit MC Miranda O Robin P External validation of a combined PET and MRI radiomics model for prediction of recurrence in cervical cancer patients treated with chemoradiotherapy Eur J Nucl Med Mol Imaging 2019 46 4 864 877 10.1007/s00259-018-4231-9 30535746 Lucia F, Visvikis D, Vallières M, Desseroit MC, Miranda O, Robin P et al (2019) External validation of a combined PET and MRI radiomics model for prediction of recurrence in cervical cancer patients treated with chemoradiotherapy. Eur J Nucl Med Mol Imaging 46(4):864–877. 10.1007/s00259-018-4231-9 30535746 10.1007/s00259-018-4231-9 70. Li HD Peng XC Zeng J Xiao JH Nie D Zu C Explainable attention guided adversarial deep network for 3D radiotherapy dose distribution prediction Knowl-Based Syst 2022 241 108324 10.1016/j.knosys.2022.108324 Li HD, Peng XC, Zeng J, Xiao JH, Nie D, Zu C et al (2022) Explainable attention guided adversarial deep network for 3D radiotherapy dose distribution prediction. Knowl-Based Syst 241:108324. 10.1016/j.knosys.2022.108324 71. Yoganathan SA Paul SN Paloor S Torfeh T Chandramouli SH Hammoud R Automatic segmentation of magnetic resonance images for high-dose-rate cervical cancer brachytherapy using deep learning Med Phys 2022 49 3 1571 1584 10.1002/mp.15506 35094405 Yoganathan SA, Paul SN, Paloor S, Torfeh T, Chandramouli SH, Hammoud R et al (2022) Automatic segmentation of magnetic resonance images for high-dose-rate cervical cancer brachytherapy using deep learning. Med Phys 49(3):1571–1584. 10.1002/mp.15506 35094405 10.1002/mp.15506 72. Huang J Gao JY Li JZ Gao SY Cheng FX Wang YZ Transformer-based deep learning model for predicting osteoporosis in patients with cervical cancer undergoing external-beam radiotherapy Expert Syst Appl 2025 273 126716 10.1016/j.eswa.2025.126716 Huang J, Gao JY, Li JZ, Gao SY, Cheng FX, Wang YZ (2025) Transformer-based deep learning model for predicting osteoporosis in patients with cervical cancer undergoing external-beam radiotherapy. Expert Syst Appl 273:126716. 10.1016/j.eswa.2025.126716 73. Liu QQ Jiang N Hao YP Hao CY Wang W Bian TT Identification of lymph node metastasis in pre-operation cervical cancer patients by weakly supervised deep learning from histopathological whole-slide biopsy images Cancer Med 2023 12 17 17952 17966 10.1002/cam4.6437 37559500 PMC10523985 Liu QQ, Jiang N, Hao YP, Hao CY, Wang W, Bian TT et al (2023) Identification of lymph node metastasis in pre-operation cervical cancer patients by weakly supervised deep learning from histopathological whole-slide biopsy images. Cancer Med 12(17):17952–17966. 10.1002/cam4.6437 37559500 10.1002/cam4.6437 PMC10523985 74. Nie SH Wei YF Zhao F Dong Y Chen Y Li QQ A dual deep neural network for auto-delineation in cervical cancer radiotherapy with clinical validation Radiat Oncol 2022 17 1 182 10.1186/s13014-022-02157-5 36380378 PMC9667653 Nie SH, Wei YF, Zhao F, Dong Y, Chen Y, Li QQ et al (2022) A dual deep neural network for auto-delineation in cervical cancer radiotherapy with clinical validation. Radiat Oncol 17(1):182. 10.1186/s13014-022-02157-5 36380378 10.1186/s13014-022-02157-5 PMC9667653 75. Li Z Zhu QY Zhang LH Yang XJ Li ZB Fu J A deep learning-based self-adapting ensemble method for segmentation in gynecological brachytherapy Radiat Oncol 2022 17 1 152 10.1186/s13014-022-02121-3 36064571 PMC9446699 Li Z, Zhu QY, Zhang LH, Yang XJ, Li ZB, Fu J (2022) A deep learning-based self-adapting ensemble method for segmentation in gynecological brachytherapy. Radiat Oncol 17(1):152. 10.1186/s13014-022-02121-3 36064571 10.1186/s13014-022-02121-3 PMC9446699 76. Zhang QL Bao P Qu A Jiang WJ Jiang P Zhuang HQ The feasibility study on the generalization of deep learning dose prediction model for volumetric modulated arc therapy of cervical cancer J Appl Clin Med Phys 2022 23 6 e13583 10.1002/acm2.13583 35262273 PMC9195039 Zhang QL, Bao P, Qu A, Jiang WJ, Jiang P, Zhuang HQ et al (2022) The feasibility study on the generalization of deep learning dose prediction model for volumetric modulated arc therapy of cervical cancer. J Appl Clin Med Phys 23(6):e13583. 10.1002/acm2.13583 35262273 10.1002/acm2.13583 PMC9195039 77. Morice P Leary A Creutzberg C Abu-Rustum N Darai E Endometrial cancer Lancet 2016 387 10023 1094 1108 10.1016/S0140-6736(15)00130-0 26354523 Morice P, Leary A, Creutzberg C, Abu-Rustum N, Darai E (2016) Endometrial cancer. Lancet 387(10023):1094–1108. 10.1016/S0140-6736(15)00130-0 26354523 10.1016/S0140-6736(15)00130-0 78. Li XF Marcus D Russell J Aboagye EO Ellis LB Sheeka A An integrated clinical-MR radiomics model to estimate survival time in patients with endometrial cancer J Magn Reson Imaging 2023 57 6 1922 1933 10.1002/jmri.28544 36484309 PMC10947322 Li XF, Marcus D, Russell J, Aboagye EO, Ellis LB, Sheeka A et al (2023) An integrated clinical-MR radiomics model to estimate survival time in patients with endometrial cancer. J Magn Reson Imaging 57(6):1922–1933. 10.1002/jmri.28544 36484309 10.1002/jmri.28544 PMC10947322 79. Kocak B Akinci D’Antonoli T Mercaldo N Alberich-Bayarri A Baessler B Ambrosini I METhodological RadiomICs score (METRICS): a quality scoring tool for radiomics research endorsed by EuSoMII Insights Imaging 2024 15 1 8 10.1186/s13244-023-01572-w 38228979 PMC10792137 Kocak B, Akinci D’Antonoli T, Mercaldo N, Alberich-Bayarri A, Baessler B, Ambrosini I et al (2024) METhodological RadiomICs score (METRICS): a quality scoring tool for radiomics research endorsed by EuSoMII. Insights Imaging 15(1):8. 10.1186/s13244-023-01572-w 38228979 10.1186/s13244-023-01572-w PMC10792137 80. Mongan J Moy L Kahn CE Checklist for artificial intelligence in medical imaging (CLAIM): a guide for authors and reviewers Radiol Artif Intell 2020 2 2 e200029 10.1148/ryai.2020200029 33937821 PMC8017414 Mongan J, Moy L, Kahn CE (2020) Checklist for artificial intelligence in medical imaging (CLAIM): a guide for authors and reviewers. Radiol Artif Intell 2(2):e200029. 10.1148/ryai.2020200029 33937821 10.1148/ryai.2020200029 PMC8017414 81. Kocak B Baessler B Bakas S Cuocolo R Fedorov A Maier-Hein L CheckList for EvaluAtion of Radiomics research (CLEAR): a step-by-step reporting guideline for authors and reviewers endorsed by ESR and EuSoMII Insights Imaging 2023 14 1 75 10.1186/s13244-023-01415-8 37142815 PMC10160267 Kocak B, Baessler B, Bakas S, Cuocolo R, Fedorov A, Maier-Hein L et al (2023) CheckList for EvaluAtion of Radiomics research (CLEAR): a step-by-step reporting guideline for authors and reviewers endorsed by ESR and EuSoMII. Insights Imaging 14(1):75. 10.1186/s13244-023-01415-8 37142815 10.1186/s13244-023-01415-8 PMC10160267 82. Schwendicke F Singh T Lee JH Gaudin R Chaurasia A Wiegand T Artificial intelligence in dental research: checklist for authors, reviewers, readers J Dent 2021 107 103610 10.1016/j.jdent.2021.103610 Schwendicke F, Singh T, Lee JH, Gaudin R, Chaurasia A, Wiegand T et al (2021) Artificial intelligence in dental research: checklist for authors, reviewers, readers. J Dent 107:103610. 10.1016/j.jdent.2021.103610 83. Cerda-Alberich L Solana J Mallol P Ribas G García-Junco M Alberich-Bayarri A MAIC-10 brief quality checklist for publications using artificial intelligence and medical images Insights Imaging 2023 14 1 11 10.1186/s13244-022-01355-9 36645542 PMC9842808 Cerda-Alberich L, Solana J, Mallol P, Ribas G, García-Junco M, Alberich-Bayarri A et al (2023) MAIC-10 brief quality checklist for publications using artificial intelligence and medical images. Insights Imaging 14(1):11. 10.1186/s13244-022-01355-9 36645542 10.1186/s13244-022-01355-9 PMC9842808 84. Lambin P Leijenaar RTH Deist TM Peerlings J De Jong EEC Van Timmeren J Radiomics: the bridge between medical imaging and personalized medicine Nat Rev Clin Oncol 2017 14 12 749 762 10.1038/nrclinonc.2017.141 28975929 Lambin P, Leijenaar RTH, Deist TM, Peerlings J, De Jong EEC, Van Timmeren J et al (2017) Radiomics: the bridge between medical imaging and personalized medicine. Nat Rev Clin Oncol 14(12):749–762. 10.1038/nrclinonc.2017.141 28975929 10.1038/nrclinonc.2017.141 85. Autorino R Gui B Panza G Boldrini L Cusumano D Russo L Radiomics-based prediction of two-year clinical outcome in locally advanced cervical cancer patients undergoing neoadjuvant chemoradiotherapy Radiol Med 2022 127 5 498 506 10.1007/s11547-022-01482-9 35325372 PMC9098600 Autorino R, Gui B, Panza G, Boldrini L, Cusumano D, Russo L et al (2022) Radiomics-based prediction of two-year clinical outcome in locally advanced cervical cancer patients undergoing neoadjuvant chemoradiotherapy. Radiol Med 127(5):498–506. 10.1007/s11547-022-01482-9 35325372 10.1007/s11547-022-01482-9 PMC9098600 86. de Alencar NRG Machado MAD Mourato FA Oliveira MLD Moraes TF Mattos Junior LAR Exploratory analysis of radiomic as prognostic biomarkers in 18 Front Med 2022 9 1046551 10.3389/fmed.2022.1046551 PMC9769204 36569127 de Alencar NRG, Machado MAD, Mourato FA, Oliveira MLD, Moraes TF, Mattos Junior LAR et al (2022) Exploratory analysis of radiomic as prognostic biomarkers in 18 10.3389/fmed.2022.1046551 PMC9769204 36569127 87. Wang TW Hong JS Huang JW Liao CY Lu CF Wu YT Systematic review and meta-analysis of deep learning applications in computed tomography lung cancer segmentation Radiother Oncol 2024 197 110344 10.1016/j.radonc.2024.110344 38806113 Wang TW, Hong JS, Huang JW, Liao CY, Lu CF, Wu YT (2024) Systematic review and meta-analysis of deep learning applications in computed tomography lung cancer segmentation. Radiother Oncol 197:110344. 10.1016/j.radonc.2024.110344 38806113 10.1016/j.radonc.2024.110344 88. Wang X Su R Li L Qin Z Liu L Zhang Y Machine learning-based radiomics for predicting outcomes in cervical cancer patients undergoing concurrent chemoradiotherapy Comput Biol Med 2024 177 108593 10.1016/j.compbiomed.2024.108593 38801795 Wang X, Su R, Li L, Qin Z, Liu L, Zhang Y (2024) Machine learning-based radiomics for predicting outcomes in cervical cancer patients undergoing concurrent chemoradiotherapy. Comput Biol Med 177:108593. 10.1016/j.compbiomed.2024.108593 38801795 10.1016/j.compbiomed.2024.108593 89. Shrestha P Poudyal B Yadollahi S Wright DE Gregory AV Warner JD A systematic review on the use of artificial intelligence in gynecologic imaging – Background, state of the art, and future directions Gynecol Oncol 2022 166 3 596 605 10.1016/j.ygyno.2022.07.024 35914978 Shrestha P, Poudyal B, Yadollahi S, Wright DE, Gregory AV, Warner JD et al (2022) A systematic review on the use of artificial intelligence in gynecologic imaging – Background, state of the art, and future directions. Gynecol Oncol 166(3):596–605. 10.1016/j.ygyno.2022.07.024 35914978 10.1016/j.ygyno.2022.07.024 90. Lee JH Ha EJ Kim D Jung YJ Heo S Jang YH Application of deep learning to the diagnosis of cervical lymph node metastasis from thyroid cancer with CT: external validation and clinical utility for resident training Eur Radiol 2020 30 6 3066 3072 10.1007/s00330-019-06652-4 32065285 Lee JH, Ha EJ, Kim D, Jung YJ, Heo S, Jang YH et al (2020) Application of deep learning to the diagnosis of cervical lymph node metastasis from thyroid cancer with CT: external validation and clinical utility for resident training. Eur Radiol 30(6):3066–3072. 10.1007/s00330-019-06652-4 32065285 10.1007/s00330-019-06652-4 91. Yi M, Lin Y, Lin ZH, Xu ZT, Li L, Huang RB et al (2024) Biopsy or follow-up: AI improves the clinical strategy of US BI-RADS 4A breast nodules using a convolutional neural network. Clinical Breast Cancer 24(5):e319–e332.e2. 10.1016/j.clbc.2024.02.003 10.1016/j.clbc.2024.02.003 38494415 92. Komatsu M Sakai A Dozen A Shozu K Yasutomi S Machino H Towards clinical application of artificial intelligence in ultrasound imaging Biomedicines 2021 9 7 720 10.3390/biomedicines9070720 34201827 PMC8301304 Komatsu M, Sakai A, Dozen A, Shozu K, Yasutomi S, Machino H et al (2021) Towards clinical application of artificial intelligence in ultrasound imaging. Biomedicines 9(7):720. 10.3390/biomedicines9070720 34201827 10.3390/biomedicines9070720 PMC8301304 93. Bakrania A Joshi N Zhao X Zheng G Bhat M Artificial intelligence in liver cancers: decoding the impact of machine learning models in clinical diagnosis of primary liver cancers and liver cancer metastases Pharmacol Res 2023 189 106706 10.1016/j.phrs.2023.106706 36813095 Bakrania A, Joshi N, Zhao X, Zheng G, Bhat M (2023) Artificial intelligence in liver cancers: decoding the impact of machine learning models in clinical diagnosis of primary liver cancers and liver cancer metastases. Pharmacol Res 189:106706. 10.1016/j.phrs.2023.106706 36813095 10.1016/j.phrs.2023.106706 94. Patel RV Yao S Huang RY Bi WL Application of radiomics to meningiomas: a systematic review Neuro-Oncol 2023 25 6 1166 1176 10.1093/neuonc/noad028 36723606 PMC10237421 Patel RV, Yao S, Huang RY, Bi WL (2023) Application of radiomics to meningiomas: a systematic review. Neuro-Oncol 25(6):1166–1176. 10.1093/neuonc/noad028 36723606 10.1093/neuonc/noad028 PMC10237421 95. Russo L Bottazzi S Sala E Artificial intelligence in female pelvic oncology: tailoring applications to clinical needs Eur Radiol 2024 34 6 4038 4040 10.1007/s00330-023-10455-z 37989917 Russo L, Bottazzi S, Sala E (2024) Artificial intelligence in female pelvic oncology: tailoring applications to clinical needs. Eur Radiol 34(6):4038–4040. 10.1007/s00330-023-10455-z 37989917 10.1007/s00330-023-10455-z 96. Chen PG, Yang YB, Zhang Y, Jiang SW, Li XM, Wan J (2020) Identification of prognostic immune-related genes in the tumor microenvironment of endometrial cancer. Aging 12(4):3371–3387. 10.18632/aging.102817 10.18632/aging.102817 PMC7066904 32074080 97. Vaswani A, Shazeer N, Parmar N, Uszkoreit J, Jones L, Gomez AN et al (2017) Attention is all you need. In: Proceedings of the 31st international conference on neural information processing systems, ACM, Long Beach, 4–9 December 2017 98. Sallam M ChatGPT utility in healthcare education, research, and practice: systematic review on the promising perspectives and valid concerns Healthcare 2023 11 6 887 10.3390/healthcare11060887 36981544 PMC10048148 Sallam M (2023) ChatGPT utility in healthcare education, research, and practice: systematic review on the promising perspectives and valid concerns. Healthcare 11(6):887. 10.3390/healthcare11060887 36981544 10.3390/healthcare11060887 PMC10048148 99. Lee J Yoon W Kim S Kim D Kim S So CH BioBERT: a pre-trained biomedical language representation model for biomedical text mining Bioinformatics 2020 36 4 1234 1240 10.1093/bioinformatics/btz682 31501885 PMC7703786 Lee J, Yoon W, Kim S, Kim D, Kim S, So CH et al (2020) BioBERT: a pre-trained biomedical language representation model for biomedical text mining. Bioinformatics 36(4):1234–1240. 10.1093/bioinformatics/btz682 31501885 10.1093/bioinformatics/btz682 PMC7703786 100. Zeng AH, Liu X, Du ZX, Wang ZH, Lai HY, Ding M et al (2023) GLM-130B: an open bilingual pre-trained model. In: Proceedings of the eleventh international conference on learning representations, OpenReview.net, Kigali, 1–5 May 2023 101. Lin JW Lin JT Lu C Chen H Lin H Zhao BC CKD-TransBTS: clinical knowledge-driven hybrid transformer with modality-correlated cross-attention for brain tumor segmentation IEEE Trans Med Imaging 2023 42 8 2451 2461 10.1109/TMI.2023.3250474 37027751 Lin JW, Lin JT, Lu C, Chen H, Lin H, Zhao BC et al (2023) CKD-TransBTS: clinical knowledge-driven hybrid transformer with modality-correlated cross-attention for brain tumor segmentation. IEEE Trans Med Imaging 42(8):2451–2461. 10.1109/TMI.2023.3250474 37027751 10.1109/TMI.2023.3250474 102. Chaitanya K Karani N Baumgartner CF Erdil E Becker A Donati O Semi-supervised task-driven data augmentation for medical image segmentation Med Image Anal 2021 68 101934 10.1016/j.media.2020.101934 33385699 Chaitanya K, Karani N, Baumgartner CF, Erdil E, Becker A, Donati O et al (2021) Semi-supervised task-driven data augmentation for medical image segmentation. Med Image Anal 68:101934. 10.1016/j.media.2020.101934 33385699 10.1016/j.media.2020.101934 103. Zhou YK Chia MA Wagner SK Ayhan MS Williamson DJ Struyven RR A foundation model for generalizable disease detection from retinal images Nature 2023 622 7981 156 163 10.1038/s41586-023-06555-x 37704728 PMC10550819 Zhou YK, Chia MA, Wagner SK, Ayhan MS, Williamson DJ, Struyven RR et al (2023) A foundation model for generalizable disease detection from retinal images. Nature 622(7981):156–163. 10.1038/s41586-023-06555-x 37704728 10.1038/s41586-023-06555-x PMC10550819 104. Moor M Banerjee O Abad ZSH Krumholz HM Leskovec J Topol EJ Foundation models for generalist medical artificial intelligence Nature 2023 616 7956 259 265 10.1038/s41586-023-05881-4 37045921 Moor M, Banerjee O, Abad ZSH, Krumholz HM, Leskovec J, Topol EJ et al (2023) Foundation models for generalist medical artificial intelligence. Nature 616(7956):259–265. 10.1038/s41586-023-05881-4 37045921 10.1038/s41586-023-05881-4 ",
  "metadata": {
    "Title of this paper": "Foundation models for generalist medical artificial intelligence",
    "Journal it was published in:": "Visual Computing for Industry, Biomedicine, and Art",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484435/"
  }
}