{
  "title": "Paper_113",
  "abstract": "pmc Am J Pathol Am J Pathol 338 amjpathol The American Journal of Pathology 0002-9440 1525-2191 American Society for Investigative Pathology PMC12489351 PMC12489351.1 12489351 12489351 40541712 10.1016/j.ajpath.2025.05.017 S0002-9440(25)00203-2 1 Regular Article Neuropathology Distinct Role of Dural and Leptomeningeal Macrophages in Maintaining Cerebrospinal Fluid Drainage to Meningeal Lymphatic Vessels Lohat Vikrim ∗ Ilyas Raffay ∗ Wei Qing ∗ Oo Darellynn ∗ Xue Jingna ∗ Horsman Isabelle ∗ Keane Keith † Stephens Matthew † Weid Pierre-Yves von der † Liao Shan liaos@ucalgary.ca ∗ ∗ ∗ † ∗ liaos@ucalgary.ca 9 2025 18 6 2025 195 9 498163 1660 1675 23 5 2025 18 06 2025 03 10 2025 03 10 2025 © 2025 American Society for Investigative Pathology. Published by Elsevier Inc. 2025 American Society for Investigative Pathology https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Cerebrospinal fluid (CSF) drains along the perivascular space, known as the glymphatic system, to the meninges, where meningeal lymphatic vessels (MLVs) remove toxic products with excess CSF from the brain. Macrophages are widely present in the leptomeninges and dura mater of meninges. However, whether leptomeningeal and dural macrophages play the same or distinct roles in maintaining optimal CSF drainage remains unclear. Intracisterna magna injection of clodronate liposomes indicated a comprehensive depletion of leptomeningeal macrophages, a selective reduction in dural sinus-associated macrophages, a decreased density of MLVs, and disrupted CSF drainage. Macrophage depletion was associated with the infiltration of monocytes and the recovery of monocyte-derived macrophages. By day 14 after clodronate liposome, although both dural macrophages and MLVs had recovered, leptomeningeal macrophages and CSF drainage had not been restored. Furthermore, i.p. injection of anti–colony-stimulating factor 1 receptor antibody selectively depleted macrophages in the dura mater but not in the leptomeninges, without affecting MLVs or CSF drainage. The study suggests that leptomeningeal macrophages, distinct from the dural macrophages, are essential for CSF drainage to the MLVs. Graphical abstract pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes In the brain, the glymphatic system facilitates the clearance of extra cerebrospinal fluid (CSF) and brain interstitial fluid to the meninges. The meningeal lymphatic vessels (MLVs), located in the dura mater of the meninges, act as a route to drain excess CSF and interstitial fluid and associated toxic compounds from the central nervous system (CNS) to the cervical lymph nodes. 1 2 3 4 4 5 6 4 6 7 1 2 3 4 , 8 In contrast to peripheral lymphatic vessels, dorsal MLVs are sensitive to disruptions in VEGF-C and VEGF receptor 3 signaling, suggesting that they require continuous VEGF-C signaling to maintain their structure. 9 , 10 10 11 , 12 Tissue-resident macrophages, tasked with prototypical roles, such as immune surveillance, antigen presentation, and removal of toxic debris, are key players in tissue homeostasis. 13 14 15 16 13 14 15 15 17 18 Beyond the phenotypic heterogeneity in the roles that tissue-resident macrophages play during homeostasis, it is also important to consider the changing landscape of dural macrophage populations from birth to adulthood. CNS is initially seeded by a common embryonic yolk sac progenitor, which gives rise to self-replenishing microglia and meningeal macrophage populations. 16 19 20 19 21 + − 22 23 − + + − Intracisterna magna (i.c.m.) injections of clodronate liposomes (CLLs) depleted both leptomeningeal and dura sinus–associated macrophages and disrupted MLVs and the drainage of CSF. In contrast, i.p. injections of anti–colony-stimulating factor 1 receptor (aCSF1R) antibody selectively depleted dural macrophages without affecting MLVs or CSF drainage. Thus, the study showed the distinct role of leptomeningeal and dural macrophages in maintaining optimal CSF drainage. Materials and Methods Animals C57BL/6 mice were purchased from the Jackson Laboratory (Bar Harbor, ME). All experiments conducted for this study used 8- to 12-week–old male mice. All animal protocols were reviewed and approved by the University of Calgary (Calgary, AB, Canada) Animal Care and Ethics Committee and conformed to the guidelines established by the Canadian Council on Animal Care. Clodronate Liposome Treatment Male C57BL/6 mice were anesthetized with a ketamine/xylazine mix before the procedure. Via i.c.m. administration, either CLL or control phosphate-buffered saline (PBS) liposome (PBSL), purchased from Liposoma Research (CP-005-005; Amsterdam, the Netherlands), was given to a mouse with a total volume of 25 μL at a rate of 5 μL per minute with a syringe pump (KDS Model 200 Series; Harvard Apparatus, Holliston, MA). aCSF1R Antibody Treatment C57BL/6 mice (8 to 10 weeks old) were intraperitoneally injected with IgG control or aCSF1R antibody (50 mg/kg body weight; Biolegend, San Diego, CA) on day 0 and day 2, and the samples were collected 7 days later (day 9 after first injection). Immunofluorescence OCT-Embedded Immunofluorescence After collection, the brain samples were fixed in 4% paraformaldehyde in PBS overnight. Samples were then replaced with 30% sucrose and left for 24 hours. Next, samples were flash frozen in O.C.T with 100% ethanol and dry ice. Sections (20 to 30 μm thick) were obtained with a cryostat set at –30°C. Last, brain sections were fixed in acetone (–20°C) for 20 minutes and then left to air dry. Brain sections were stored at –80°C until use. Whole-Mount Immunofluorescence For whole-mount meningeal staining, the brain and skull cap were first carefully separated, leaving the dural membrane attached to the skull cap. With the dural membrane still attached to the skull cap, the samples were then fixed in 4% paraformaldehyde in PBS overnight and then stored in PBS. First, the samples were washed with PBS (3×) and then permeabilized and blocked with 3% bovine serum albumin with 0.1% Triton X-100 for 1 hour. Next, after three washes with 0.1% Triton X-100 in PBS, samples were incubated for overnight with primary antibodies plus 3% bovine serum albumin with 0.1% Triton X-100 in the mix. The next day, samples were washed three times with 0.1% Triton X-100 in PBS before incubation with secondary antibodies in 3% bovine serum albumin with 0.1% Triton X-100 for 2 to 4 hours. Next, the samples were washed three times with 0.1% Triton X-100 in PBS, then stained with DAPI, and then finally washed three more times with 0.1% Triton X-100 in PBS. The dural layer was then mechanically scrapped out of the skull cap and mounted for imaging with confocal microscopy. Intravital Time-Lapse Imaging of CSF Drainage to MLVs Mice were anesthetized with a ketamine/xylazine mixture before the procedure. The scalp was surgically removed to expose the skull. Using a syringe pump (KDS Model 200 Series; the LabWorld Group, Hudson, MA), 5 μL of a fluorescein isothiocyanate (FITC)–dextran (10 μg/μL) and Alexa 647–ovalbumin (OVA) mixture (2 μg/μL) was i.c.m. injected at 1 μL/minute. Intravital time-lapse imaging of FITC-dextran was performed for 60 minutes using stereomicroscopy for the entire skull for all the detectable transcranial signal. At the end of the time-lapse imaging, the transcranial signals of FITC-dextran and Alexa 647–OVA were acquired as the end point signal. Mice were then euthanized to collect the skull, brain, and deep cervical lymph nodes (LNs), and the samples were fixed overnight with 4% paraformaldehyde in PBS. Whole-mount deep cervical LNs were imaged under a stereomicroscope. The skull samples were stained, as described above, and the dura mater samples were then isolated and mounted for imaging. Some brain samples were transferred to 30% sucrose before embedding in OCT and freezing on dry ice for later cryosectioning and staining. Other brain samples were stained whole mount with antibodies to image leptomeningeal macrophages. Quantitative RT-PCR Before the collection of samples, mice were transcardially perfused with PBS. Dural samples were then harvested from skull caps with TRI Reagent (Sigma-Aldrich, St. Louis, MO) and snap frozen in liquid nitrogen for later use. Later, the samples in TRI Reagent were homogenized with tissue homogenizer. Next, mRNA was extracted following the addition of chloroform to the samples in TRI Reagent, and then mRNA was isolated with Qiagen RNeasy Mini Kit (number 74104) and DNase (number 5720637; Qiagen, Toronto, ON, Canada). Using the BIO-RAD iScript RT Supermix (number 1708841; Bio-Rad, Hercules, CA), 100 ng of RNA was converted to cDNA. Quantitative PCRs were performed with 5 ng of cDNA per reaction and SYBR Green Master Mix (from Applied Biosystems, Foster City, CA; number 100029284). Real-time PCRs were conducted with a QuantStudio 3 Real-Time PCR System (Thermo Fisher Scientific, Waltham, MA). Specifically, an annealing temperature of 55°C was used, and 45 cycles of amplification were performed. Refer to Table 1 Table 1 Quantitative RT-PCR Primer Sequences Gene Forward primer sequence Reverse primer sequence C ol 1 5′-CACTGCCCTCCTGACGCATGG-3′ 5′-CACGTCATCGCACACAGCCG-3′ C ol 4 5′-CCATCTGTGGACCATGGCTT-3′ 5′-GCGAAGTTGCAGACGTTGTT-3′ M mp 2 5′-AACGGTCGGGAATACAGCAG-3′ 5′-GTAAACAAGGCTTCATGGGGG3-′ M mp 9 5′-CTCAGAGATTCTCCGTGTCCTGTA-3′ 5′-GACTGCCAGGAAGACACTTGGTTA-3′ P dgf b 5′-GGAGTCGGCATGAATCGCT-3′ 5′-CAGCCCCATCTTCATCTACGG-3′ V egf a 5′-CACAGCAGATGTGAATGCAG-3′ 5′-TTTACACGTCTGCGGATCTT-3′ V egf c 5′-TTTGCCAATCACACTTCCTGC-3′ 5′-ACACTGTGGTAATGTTGCTGG-3′ V egf d 5′-CCTGGGACAGAAGACCACTC-3′ 5′-TGAGATCTCCCGGACATGGT-3′ Flow Cytometry Before the collection of meningeal tissue, mice were transcardiacally perfused with PBS. The dura mater was then dissected from the skull cap and digested for 30 minutes at 37°C in 1 mL of complete Dulbecco’s modified Eagle’s medium (Sigma Life Science, St. Louis, MO; number D6046) with 10% fetal bovine serum containing 1:250 collagenase P (number 11213857001), 1:125 dispase II (Sigma; number D4693), and 1:100 DNase I (number 52779120). During digestion, the samples in the buffer were agitated every 10 minutes by pipetting up and down. After digestion, the cells were washed with fluorescence-activated cell sorting buffer. Next, an FcγRIII block (purified CD16/CD32 antibody) was added to the cells and incubated at room temperature for 5 minutes. The cells were then stained for the conjugated markers of interest for 30 minutes in the dark and on ice. Last, the cells were washed and then fixed with 2% paraformaldehyde in fluorescence-activated cell sorting buffer. After acquiring data with a BD FACSCanto (BD, Franklin Lakes, NJ), FlowJo 10.10.0 (BD) was used to analyze the data. Antibodies The antibodies used for immunofluorescence and flow cytometry are listed in Table 2 Table 3 Table 2 Antibodies Used in IF Staining Marker Host Company Catalog no. CCL21 Goat R&D Systems (Minneapolis, MN) AF457 CD206 Rat Bio-Rad MCA2235T CD31 (PECAM-1) Armenian Hamster Sigma-Aldrich MAB1398Z F4/80 Rat Biolegend 123102 LYVE-1 Rabbit Cell Science PA0846 CCL, chemokine (C-C motif) ligand; IF, immunofluorescence; LYVE-1, lymphatic vessel endothelial hyaluronan receptor 1; PECAM, platelet endothelial cell adhesion molecule 1. Table 3 Antibodies Used in Flow Cytometry Marker Fluorophore Company Catalog no. CD11b (clone M1/70) APC-Cy7 BD 557657 CD11c (clone N418) PE-Cy7 Biolegend 117318 CD19 (clone 1D3) PE-Cy7 BD 552854 CD206 BV605 Biolegend 141721 CD3e (clone 145-2C11) BV421 Biolegend 100341 CD4 (clone GK1.5) PerCP Biolegend 100432 CD45 (clone 30-F11) PerCP Biolegend 103130 CD45 (clone 30-F11) APC-Cy7 BD 557659 CD8a (clone 53-6.7) APC Biolegend 100731 F4/80 (clone BM8) APC Biolegend 123116 L/D stain (fixed viability stain 510) BV510 BD 564406 Ly-6C (clone HK1.4) BV510 Biolegend 128033 Ly-6G (clone 1A8) PE Biolegend 127607 APC, allophycocyanin; PE, phycoerythrin; PerCP, peridinin chlorophyll protein. Statistical Analysis Statistical tests in the GraphPad Prism software 8.1.1 (224) (GraphPad Software, Boston, MA) were used to test quantitative data. Results for respective tests were considered statistically significant at P Results LYVE-1 + Macrophages in the dura mater are composed of multiple populations. 24 Figure 1 + – + – + – + Figure 1 + + – + + + – + Figure 1 + + Figure 1 Figure 1 Figure 1 Clodronate liposome (CLL) preferentially depletes MLV-associated LYVE-1 + A: + + + + B: C: D F: cx3cr1-gfp + G: + + C G: U E F: C E G P P P A G B D left D right panels CLL Treatment Preferentially Depletes Dural Macrophages Along Dural Sinuses The intimate interactions between macrophages and MLVs was the impetus to assess whether macrophages play a role in maintaining MLVs in adult mice. Therefore, dural macrophages were depleted locally through the administration of CLLs via i.c.m. injection. Mice treated with PBSLs, delivered through the same route, served as a control. The CLL treatment targets macrophages and other phagocytic cells, which identify the liposome as a foreign intruder and engulfing it as a result. Once in the cell, the clodronate is released, causing the disruption of mitochondrial functioning, thereby inducing cell apoptosis. 25 + + + + + + + – + + – + Figure 1 Figure 1 + + + + – Supplemental Figure S1 Because the CLL treatment only partially depleted dural macrophages, it was critical to determine whether the CLL preferentially depleted macrophages at specific locations or distinct macrophage populations within the dura mater. Because CLL drains with the CSF to the dural sinuses, macrophages were examined in the dural sinuses 3 days after the CLL treatment by IF staining in wild-type mice. CLL treatment almost completely depleted LYVE-1 + + − + + + – + Supplemental Figure S2 cx3cr1-gfp + Figure 1 Figure 1 + Figure 1 + + + Figure 1 Figure 1 + + CLL Treatment Further Interrupts MLVs by 7 Days After CLL Injection To further understand whether CLL treatment sustained the abrogation of macrophages and the damage to MLVs, PBSL or CLL was i.c.m. injected into wild-type mice and immune cells and MLVs were examined 7 days after the injection. The immune cell composition in the dura mater was analyzed by flow cytometry, and the results highlighted a sustained reduction of CD206 + + Figure 2 + – Figure 2 + + Supplemental Figure S1 Figure 2 Clodronate liposome (CLL) treatment ablates MLVs and interrupts CSF drainage at 7 days after CLL injection. A: B: lysm-gfp C D: C D E G: E: Dashed lines F: G: Dashed lines H: boxed area A F H: U C D: A C H n A P P P B H right E F G H, left Next, using IF staining of the dura mater with anti–LYVE-1, image quantification of different regions of interest at the hotspot areas along the TS indicated that LYVE-1 density was significantly reduced in the hotspots and COS area of CLL-treated mice compared with PBSL controls ( Figure 2 Figure 2 + + + + – + Supplemental Figure S3 + Supplemental Figure S3 + Figure 2 CLL Treatment Impairs CSF Drainage to MLVs and Deep Cervical Lymph Nodes Given that i.c.m. CLL administration significantly reduced MLVs 7 days after treatment, it was next used to characterize whether the transport of CSF was correspondingly diminished. Specifically, FITC-dextran (2 MDa) and Alexa647 conjugated ovalbumin (AL647-OVA; approximately 45 KDa) were used to visualize macromolecule and small-molecule drainage, respectively. Briefly, the scalp was surgically removed and the skull was exposed, followed by the i.c.m. injections of the FITC-dextran and Alexa 647–OVA mixture (1 μL/minute; 5 μL in total injection), and intravital time-lapse imaging was performed on FITC-dextran for 60 minutes with stereomicroscopy through the exposed skull ( Figure 2 Supplemental Figure S4 Supplemental Video S1 Time-lapse imaging showed CSF tracer (FITC-dextran) efflux from the brain toward the dura mater via arachnoid cuff exit points over time ( Figure 2 Supplemental Video S1 Supplemental Figure S4 Supplemental Figure S5 Supplemental Figure S5 To understand whether CLL treatment interrupts CSF drainage, the transport of FITC-dextran was compared by quantification of time-lapse imaging. At day 7, PBSL-treated mice distributed approximately eight times more FITC-dextran than the CLL-treated mice an hour after tracer administration ( Figure 2 Supplemental Videos S1 S2 Figure 2 Figure 2 Figure 2 Next, IF staining was performed with anti–LYVE-1 on the fixed dura mater to highlight the correlation between the tracers and the MLVs. Confocal microscopy revealed reduced accumulation of FITC-dextran and Alexa647-OVA along the diminished MLVs in the dura mater of day 7 post-CLL treated compared with the PBSL-treated mice ( Figure 2 Figure 2 Recovery of MLVs Is Associated with Monocyte-Derived Macrophages by 14 Days After CLL Treatment As the depletion of macrophages with CLL is transient, 26 20 + Figure 3 Supplemental Figure S1 lysm-gfp + + Figure 3 + + + − + − Figure 3 + Figure 3 + + Figure 1 Figure 3 Figure 3 Dural macrophage and MLV recovery is not sufficient to restore CSF drainage. A: B: white boxed area right Yellow arrows + + + white arrows + − + C: D E: D E F H: F: G: H Dashed lines A G H: U D E: F: A D E G H P P P P B left and right panels B center panels C left panels C right panels F G H Having shown that monocytes can differentiate into dural macrophages after CLL treatment, dura maters were collected at 14 days after CLL treatment. Anti–LYVE-1 IF staining and imaging demonstrated the revival of MLVs in the dura mater at day 14 following CLL treatment ( Figure 3 Figure 3 Recovery of Dural Macrophages and MLVs Is Not Sufficient to Restore CSF Drainage to MLVs To understand whether the restored MLVs at day 14 allowed the reestablishment of CSF drainage, intravital time-lapse imaging was performed to trace FITC-dextran and AL647-OVA after i.c.m. injection ( Figure 2 Figure 3 Figure 3 Figure 3 Leptomeningeal Macrophage and CSF Drainage Takes Longer Time to Recover after the CLL Treatment CLL i.c.m. injection depletes brain border macrophages, including the perivascular and leptomeningeal macrophages, and impairs glymphatic drainage. 17 Figure 4 Figure 4 + + − + Figure 4 Figure 4 Figure 4 Leptomeningeal macrophages and CSF drainage take a longer time to recover after the clodronate liposome (CLL) treatment. A B: B: Black arrows C: cx3cr1-gfp D: cx3cr1-gfp E: boxed area boxed area right F: G: A D G: U D: F: B G P P A C top panels D B C bottom panels E left panels E center panels E right panels F G To allow for the full recovery of CSF drainage, the examination was extended to day 21 after CLL treatment. At this later time point, the rescue of MLVs was quantitively confirmed, as the LYVE-1 density and MLV length of the day 21 group showed no significant differences between CLL and PBSL-treated mice ( Figure 4 + Figure 1 Figure 4 Figure 4 Figure 4 Low-Dose CLL Treatment Shows Limited Damage to MLV or Dural Macrophages Five μL CLL i.c.m. injection depletes brain border macrophages and impairs CSF drainage without damaging MLVs. 17 , 17 Supplemental Figure S6 Figure 4 Supplemental Figure S6 aCSF1R Antibody Treatment Selectively Depletes Dural Macrophages without Impacting MLV or CSF Drainage Twenty-five μL of CLL caused more damage to dural macrophages and MLVs than 5 μL of CLL, which raised the question as to whether a high dose of CLL treatment might directly damage MLVs. Here, a noninvasive method was developed to selectively deplete dural macrophages to distinguish the roles of leptomeningeal and dural macrophages in regulating CSF drainage and MLVs. Given that the dura mater lacks a blood-brain barrier and that the blood-brain barrier may prevent antibody entry into the brain and leptomeninges, an i.p. injection of aCSF1R antibody was employed to deplete dural macrophages. IgG control and aCSF1R antibody (50 mg/kg) were injected on days 0 and 2, and brain and dura mater were collected 7 days later. In CX3CR1-GFP macrophage reporter mice, aCSF1R treatment comprehensively depleted dural macrophages ( Figure 5 Figure 5 + – + – + Figure 5 Figure 5 Figure 5 Figure 5 Anti–colony-stimulating factor 1 receptor (aCSF1R) i.p. injection selectively depletes dural macrophages without impacting MLVs, leptomeningeal macrophages, or CSF drainage. A E: Boxed areas B: + C: D E: F G: H: + + B C: D E F bottom G: U F top : B G P P A first column A second column A third column A fourth column F G Discussion Macrophages are generally considered specialized cells involved in the elimination of toxic proteins, antigen processing, and immune surveillance. This study further emphasized the alternative role of macrophages in supporting CSF drainage through the glymphatic system to MLVs. Notably, 25 μL of CLL i.c.m. treatment depleted macrophages in both the leptomeninges and dura mater, which was associated with reduced MLVs and impaired CSF drainage ( Figure 5 Figure 5 Figure 5 Although CLL treatment was intended to deplete macrophages, it may have also affected other phagocytic cells, including monocytes, microglial cells, and tissue-resident DCs. 27 11 + – 17 + Figure 1 Because the high-dose CLL treatment (25 μL) caused more severe damage to MLVs than the low-dose treatment (5 μL), lymphatic endothelial cells, which express LYVE-1, may have phagocytosed CLL, leading to apoptosis. Therefore, CLL i.c.m. treatment alone is not sufficient to determine whether the reduction in MLVs was due to a lack of macrophages or whether CLL treatment caused off-target damage to lymphatic endothelial cells, leading to reduced MLVs. To distinguish between these possibilities, aCSF1R was injected intraperitonially, resulting in comprehensive depletion of dural macrophages. Despite this, MLV lengths remained intact, suggesting that dural macrophages are not required for the maintenance of MLV length. However, the possibility cannot be excluded that long-term depletion of dural macrophages with aCSF1R treatment may eventually disrupt MLV integrity. These results raised more questions regarding the function of dural macrophages. As macrophages are critical producers of lymphatic growth factors, such as VEGF-C in inflammation and cancer, 28 , 29 V egf c V egf d Supplemental Figure S7 9 V egf c/d Recent studies supported a role for LYVE-1 + 14 , 15 , 30 M mp 9 Supplemental Figure S7 M mp 9 + 15 M mp 2 C ol 1 C ol 4 Supplemental Figure S7 17 17 M mp 9 + During the recovery phase after CLL treatment, the drainage of AL647-OVA restored faster than that of 2-MDa FITC-dextran. It is suspected that macrophages may have more significant impact on draining large molecular weight materials than on draining small molecular weight materials. However, whether macrophages impact the drainage pattern for materials of different sizes or types (proteins versus dextran) remains unclear. Furthermore, in control mice, after fixation and staining, FITC-dextran was retained in the tissue and macrophages, whereas AL647-OVA was mostly retained in the leptomeningeal macrophages in the leptomeninges ( Supplemental Figure S8 Supplemental Figure S8 Supplemental Figure S8 The mechanism whereby compromised ECM remodeling disrupts CSF drainage remains unknown. It is possible that a buildup of dural ECM components in the CLL-treated group along MLVs could act as a physical molecular sieve that restricts fluid dynamics. Additionally, changes to ECM remodeling can also modify cellular pathways. For instance, ECM remodelers are involved in releasing growth factors, as MMP-2 and MMP-9 can proteolytically cleave ECM-bound transforming growth factor-β into its active form 31 V egf c 32 33 Figure 5 Monocytes can contribute to the dural macrophage population. 20 Figure 3 + Figure 2 + – + + – + Supplemental Figure S3 + – + – Ossified vascular channels within the skull allow a direct route for bone marrow–derived myeloid cells to egress from bone marrow to the dura membrane. 34 35 36 37 , 38 Notwithstanding the steady replacement of dural macrophages through local bone marrow–derived myeloid cells, 19 39 40 , 41 + + + − Figure 3 To summarize, this study demonstrated that i.c.m. administration of CLL preferentially depleted sinus-associated dural macrophages and leptomeningeal macrophages, resulting in reductions in MLV vasculature and CSF drainage. In contrast, i.p. injection of aCSF1R selectively depleted dural macrophages without impacting leptomeningeal macrophages, MLV structure, or CSF drainage. These results underscore the distinct roles of leptomeningeal and dural macrophages in regulating CSF drainage. Limitations of the Study This study raises further questions about the regulation of MLVs and CSF drainage in adult mice. The original hypothesis proposed that dural macrophages in proximity to MLVs may provide lymphangiogenic or other regulatory factors necessary for the maintenance of MLVs in adult mice. However, i.p. injection of aCSF1R antibody, which effectively depleted dural macrophages, did not affect MLV structure or CSF drainage. Thus, the results did not support this hypothesis. Alternatively, it is well established that impaired CSF efflux to the dura mater can affect both the development of MLVs and maintenance of MLVs in aged mice. 12 Figure 2 17 17 Supplemental Figure S6 At present, the mechanism by which 25 μL but not 5 μL i.c.m. CLL treatment impairs MLV structure remains unclear. Because treatment with 25 μL of PBSL did not alter the structure of MLVs in adult mice ( Figure 2 Supplemental Figure S9 Supplemental Figure S9 Disclosure Statement None declared. References 1 Louveau A. Plog B.A. Antila S. Alitalo K. Nedergaard M. Kipnis J. Understanding the functions and relationships of the glymphatic system and meningeal lymphatics J Clin Invest 127 2017 3210 3219 28862640 10.1172/JCI90603 PMC5669566 2 Li X. Qi L. Yang D. Hao S. Zhang F. Zhu X. Sun Y. Chen C. Ye J. Yang J. Zhao L. Altmann D.M. Cao S. Wang H. Wei B. Meningeal lymphatic vessels mediate neurotropic viral drainage from the central nervous system Nat Neurosci 25 2022 577 587 35524140 10.1038/s41593-022-01063-z 3 Hu X. Deng Q. Ma L. Li Q. Chen Y. Liao Y. Zhou F. Zhang C. Shao L. Feng J. He T. Ning W. Kong Y. Huo Y. He A. Liu B. Zhang J. Adams R. He Y. Tang F. Bian X. Luo J. Meningeal lymphatic vessels regulate brain tumor drainage and immunity Cell Res 30 2020 229 243 32094452 10.1038/s41422-020-0287-8 PMC7054407 4 Da Mesquita S. Louveau A. Vaccari A. Smirnov I. Cornelison R.C. Kingsmore K.M. Contarino C. Onengut-Gumuscu S. Farber E. Raper D. Viar K.E. Powell R.D. Baker W. Dabhi N. Bai R. Cao R. Hu S. Rich S.S. Munson J.M. Lopes M.B. Overall C.C. Acton S.T. Kipnis J. Functional aspects of meningeal lymphatics in ageing and Alzheimer's disease Nature 560 2018 185 191 30046111 10.1038/s41586-018-0368-8 PMC6085146 5 Ding X.-B. Wang X.-X. Xia D.-H. Liu H. Tian H.-Y. Fu Y. Chen Y.-K. Qin C. Wang J.-Q. Xiang Z. Zhang Z.-X. Cao Q.-C. Wang W. Li J.-Y. Wu E. Tang B.-S. Ma M.-M. Teng J.-F. Wang X.-J. Impaired meningeal lymphatic drainage in patients with idiopathic Parkinson's disease Nat Med 27 2021 411 418 33462448 10.1038/s41591-020-01198-1 6 Zou W. Pu T. Feng W. Lu M. Zheng Y. Du R. Xiao M. Hu G. Blocking meningeal lymphatic drainage aggravates Parkinson's disease-like pathology in mice overexpressing mutated [alpha]-synuclein Transl Neurodegener 8 2019 7 30867902 10.1186/s40035-019-0147-y PMC6396507 7 Antila S. Chilov D. Nurmi H. Li Z. Näsi A. Gotkiewicz M. Sitnikova V. Jäntti H. Acosta N. Koivisto H. Ray J. Keuters M.H. Sultan I. Scoyni F. Trevisan D. Wojciechowski S. Kaakinen M. Dvořáková L. Singh A. Jukkola J. Korvenlaita N. Eklund L. Koistinaho J. Karaman S. Malm T. Tanila H. Alitalo K. Sustained meningeal lymphatic vessel atrophy or expansion does not alter Alzheimer's disease-related amyloid pathology Nat Cardiovasc Res 3 2024 474 491 39087029 10.1038/s44161-024-00445-9 PMC7616318 8 Ma Q. Ineichen B.V. Detmar M. Proulx S.T. Outflow of cerebrospinal fluid is predominantly through lymphatic vessels and is reduced in aged mice Nat Commun 8 2017 1434 29127332 10.1038/s41467-017-01484-6 PMC5681558 9 Antila S. Karaman S. Nurmi H. Airavaara M. Voutilainen M.H. Mathivet T. Chilov D. Li Z. Koppinen T. Park J.-H. Fang S. Aspelund A. Saarma M. Eichmann A. Thomas J.-L. Alitalo K. Development and plasticity of meningeal lymphatic vessels J Exp Med 214 2017 3645 3667 29141865 10.1084/jem.20170391 PMC5716035 10 Ahn J.H. Cho H. Kim J.-H. Kim S.H. Ham J.-S. Park I. Suh S.H. Hong S.P. Song J.-H. Hong Y.-K. Jeong Y. Park S.-H. Koh G.Y. Meningeal lymphatic vessels at the skull base drain cerebrospinal fluid Nature 572 2019 62 66 31341278 10.1038/s41586-019-1419-5 11 Bolte A.C. Dutta A.B. Hurt M.E. Smirnov I. Kovacs M.A. McKee C.A. Ennerfelt H.E. Shapiro D. Nguyen B.H. Frost E.L. Lammert C.R. Kipnis J. Lukens J.R. Meningeal lymphatic dysfunction exacerbates traumatic brain injury pathogenesis Nat Commun 11 2020 4524 32913280 10.1038/s41467-020-18113-4 PMC7483525 12 Matrongolo M.J. Ang P.S. Wu J. Jain A. Thackray J.K. Reddy A. Sung C.C. Barbet G. Hong Y.-K. Tischfield M.A. Piezo1 agonist restores meningeal lymphatic vessels, drainage, and brain-CSF perfusion in craniosynostosis and aged mice J Clin Invest 134 2023 e171468 10.1172/JCI171468 PMC10866656 37917195 13 Wang Y. Chaffee T.S. Larue R.S. Huggins D.N. Witschen P.M. Ibrahim A.M. Nelson A.C. Machado H.L. Schwertfeger K.L. Tissue-resident macrophages promote extracellular matrix homeostasis in the mammary gland stroma of nulliparous mice Elife 9 2020 Jun 1 1 27 10.7554/eLife.57438 PMC7297528 32479261 14 Chakarov S. Lim H.Y. Tan L. Lim S.Y. See P. Lum J. Two distinct interstitial macrophage populations coexist across tissues in specific subtissular niches Science 2019 1979 363 10.1126/science.aau0964 30872492 15 Lim H.Y. Lim S.Y. Tan C.K. Thiam C.H. Goh C.C. Carbajo D. Hyaluronan receptor LYVE-1-expressing macrophages maintain arterial tone through hyaluronan-mediated regulation of smooth muscle cell collagen Immunity 49 2018 326 341.e7 30054204 10.1016/j.immuni.2018.06.008 16 Masuda T. Amann L. Monaco G. Sankowski R. Staszewski O. Krueger M. Specification of CNS macrophage subsets occurs postnatally in defined niches Nature 604 2022 740 748 35444273 10.1038/s41586-022-04596-2 17 Drieu A. Du S. Storck S.E. Rustenhoven J. Papadopoulos Z. Dykstra T. Parenchymal border macrophages regulate the flow dynamics of the cerebrospinal fluid Nature 611 2022 585 593 36352225 10.1038/s41586-022-05397-3 PMC9899827 18 Brezovakova V. Jadhav S. Identification of Lyve-1 positive macrophages as resident cells in meninges of rats J Comp Neurol 528 2020 2021 2032 32003471 10.1002/cne.24870 19 Van Hove H. Martens L. Scheyltjens I. De Vlaminck K. Pombo Antunes A.R. De Prijck S. Vandamme N. De Schepper S. Van Isterdael G. Scott C.L. Aerts J. Berx G. Boeckxtaens G.E. Vandenbroucke R.E. Vereecke L. Moechars D. Guilliams M. Ginderachter J.A. Saeys Y. Movahedi K. A single-cell atlas of mouse brain macrophages reveals unique transcriptional identities shaped by ontogeny and tissue environment Nat Neurosci 22 2019 1021 1035 31061494 10.1038/s41593-019-0393-4 20 Cugurra A. Mamuladze T. Rustenhoven J. Dykstra T. Beroshvili G. Greenberg Z.J. Baker W. Papadopoulos Z. Drieu A. Blackburn S. Kanamori M. Brioschi S. Herz J. Schuettpelz L.G. Colonna M. Smirnov I. Kipnis J. Skull and vertebral bone marrow are myeloid cell reservoirs for the meninges and CNS parenchyma Science 2021 1979 373 10.1126/science.abf7844 PMC8863069 34083447 21 Sato T. Konishi H. Tamada H. Nishiwaki K. Kiyama H. Morphology, localization, and postnatal development of dural macrophages Cell Tissue Res 384 2021 49 58 33433687 10.1007/s00441-020-03346-y 22 Rebejac J. Eme-Scolan E. Arnaud Paroutaud L. Kharbouche S. Teleman M. Spinelli L. Gallo E. Roussel-Queval A. Zarubica A. Sansoni A. Bardin Q. Hoest P. Michallet M.-C. Brousse C. Crozat K. Manglani M. Liu Z. Ginhoux F. McGavern D.B. Dalod M. Malissen B. Lawrence T. Rua R. Meningeal macrophages protect against viral neuroinfection Immunity 55 2022 2103 2117.e10 36323311 10.1016/j.immuni.2022.10.005 23 Mrdjen D. Pavlovic A. Hartmann F.J. Schreiner B. Utz S.G. Leung B.P. Lelios I. Heppner F.L. Kipnis J. Merkler D. Greter M. Becher B. High-dimensional single-cell mapping of central nervous system immune cells reveals distinct myeloid subsets in health, aging, and disease Immunity 48 2018 380 395.e6 29426702 10.1016/j.immuni.2018.01.011 24 Posner D.A. Lee C.Y. Portet A. Clatworthy M.R. Humoral immunity at the brain borders in homeostasis Curr Opin Immunol 76 2022 102188 10.1016/j.coi.2022.102188 35569417 25 Moreno S.G. Depleting macrophages in vivo with clodronate-liposomes Rousselet G Macrophages: Methods and Protocols 2018 Humana Press New York, NY 259 262 10.1007/978-1-4939-7837-3_23 29761405 26 Louie D.A.P. Oo D. Leung G. Lin Y. Stephens M. Alrashed O. Tso M. Liao S. Tumor-draining lymph node reconstruction promotes B cell activation during E0771 mouse breast cancer growth Front Pharmacol 13 2022 825287 10.3389/fphar.2022.825287 PMC8995528 35418862 27 Han X. Li Q. Lan X. EL-Mufti L. Ren H. Wang J. Microglial depletion with clodronate liposomes increases proinflammatory cytokine levels, induces astrocyte activation, and damages blood vessel integrity Mol Neurobiol 56 2019 6184 6196 30734229 10.1007/s12035-019-1502-9 PMC6684378 28 Liao S. von der Weid PY: Lymphatic system: an active pathway for immune protection Semin Cell Dev Biol 38 2015 83 89 25534659 10.1016/j.semcdb.2014.11.012 PMC4397130 29 Schoppmann S.F. Birner P. Stöckl J. Kalt R. Ullrich R. Caucig C. Nagy K. Alitalo K. Kerjaschki D. Tumor-associated macrophages express lymphatic endothelial growth factors and are related to peritumoral lymphangiogenesis Am J Pathol 161 2002 947 956 12213723 10.1016/S0002-9440(10)64255-1 PMC1867252 30 Cho C.-H. Jun Koh Y. Han J. Sung H.-K. Jong Lee H. Morisada T. Schwendener R.A. Brekken R.A. Kang G. Oike Y. Choi T.-S. Suda T. Yoo O.-J. Koh G.Y. Angiogenic role of LYVE-1–positive macrophages in adipose tissue Circ Res 100 2007 e47 e57 17272806 10.1161/01.RES.0000259564.92792.93 31 Dallas S.L. Rosser J.L. Mundy G.R. Bonewald L.F. Proteolysis of latent transforming growth factor-[beta] (TGF-[beta])-binding protein-1 by osteoclasts J Biol Chem 277 2002 21352 21360 11929865 10.1074/jbc.M111663200 32 Suzuki Y. Ito Y. Mizuno M. Kinashi H. Sawai A. Noda Y. Mizuno T. Shimizu H. Fujita Y. Matsui K. Maruyama S. Imai E. Matsuo S. Takei Y. Transforming growth factor-[beta] induces vascular endothelial growth factor-C expression leading to lymphangiogenesis in rat unilateral ureteral obstruction Kidney Int 81 2012 865 879 22258325 10.1038/ki.2011.464 33 Du H.T. Du L.L. Tang X.L. Ge H.Y. Liu P. Blockade of MMP-2 and MMP-9 inhibits corneal lymphangiogenesis Graefes Arch Clin Exp Ophthalmol 255 2017 1573 1579 28669039 10.1007/s00417-017-3651-8 34 Herisson F. Frodermann V. Courties G. Rohde D. Sun Y. Vandoorne K. Wojtkiewicz G.R. Masson G.S. Vinegoni C. Kim J. Kim D.-E. Weissleder R. Swirski F.K. Moskowitz M.A. Nahrendorf M. Direct vascular channels connect skull bone marrow and the brain surface enabling myeloid cell migration Nat Neurosci 21 2018 1209 1217 30150661 10.1038/s41593-018-0213-2 PMC6148759 35 Yao H. Price T.T. Cantelli G. Ngo B. Warner M.J. Olivere L. Ridge S.M. Jablonski E.M. Therrien J. Tannheimer S. McCall C.M. Chenn A. Sipkins D.A. Leukaemia hijacks a neural mechanism to invade the central nervous system Nature 560 2018 55 60 30022166 10.1038/s41586-018-0342-5 PMC10257142 36 Cai R. Pan C. Ghasemigharagoz A. Todorov M.I. Förstera B. Zhao S. Bhatia H.S. Parra-Damas A. Mrowka L. Theodorou D. Rempfler M. Xavier A.L.R. Kress B.T. Benakis C. Steinke H. Liebscher S. Bechmann I. Liesz A. Menze B. Kerschensteiner M. Nedergaard M. Ertürk A. Panoptic imaging of transparent mice reveals whole-body neuronal projections and skull–meninges connections Nat Neurosci 22 2019 317 327 30598527 10.1038/s41593-018-0301-3 PMC6494982 37 Mazzitelli J.A. Smyth L.C.D. Cross K.A. Dykstra T. Sun J. Du S. Mamuladze T. Smirnov I. Rustenhoven J. Kipnis J. Cerebrospinal fluid regulates skull bone marrow niches via direct access through dural channels Nat Neurosci 25 2022 555 560 35301477 10.1038/s41593-022-01029-1 PMC9081158 38 Pulous F.E. Cruz-Hernández J.C. Yang C. Kaya Ζ. Paccalet A. Wojtkiewicz G. Capen D. Brown D. Wu J.W. Schloss M.J. Vinegoni C. Richter D. Yamazoe M. Hulsmans M. Momin N. Grune J. Rohde D. McAlpine C.S. Panizzi P. Weissleder R. Kim D.-E. Swirski F.K. Lin C.P. Moskowitz M.A. Nahrendorf M. Cerebrospinal fluid can exit into the skull bone marrow and instruct cranial hematopoiesis in mice with bacterial meningitis Nat Neurosci 25 2022 567 576 35501382 10.1038/s41593-022-01060-2 PMC9081225 39 Goldmann T. Wieghofer P. Jordão M.J.C. Prutek F. Hagemeyer N. Frenzel K. Amann L. Staszewski O. Kierdorf K. Krueger M. Locatelli G. Hochgerner H. Zeiser R. Epelman S. Geissmann F. Priller J. Rossi F.M.V. Bechmann I. Kerschensteiner M. Linnarsson S. Jung S. Prinz M. Origin, fate and dynamics of macrophages at central nervous system interfaces Nat Immunol 17 2016 797 805 27135602 10.1038/ni.3423 PMC4968048 40 Dick S.A. Wong A. Hamidzada H. Nejat S. Nechanitzky R. Vohra S. Mueller B. Zaman R. Kantores C. Aronoff L. Momen A. Nechanitzky D. Li W.Y. Ramachandran P. Crome S.Q. Becher B. Cybulsky M.I. Billia F. Keshavjee S. Mital S. Robbins C.S. Mak T.W. Epelman S. Three tissue resident macrophage subsets coexist across organs with conserved origins and life cycles Sci Immunol 7 2022 eabf7777 10.1126/sciimmunol.abf7777 34995099 41 Zhang N. Kim S.H. Gainullina A. Erlich E.C. Onufer E.J. Kim J. Czepielewski R.S. Helmink B.A. Dominguez J.R. Saunders B.T. Ding J. Williams J.W. Jiang J.X. Segal B.H. Zinselmeyer B.H. Randolph G.J. Kim K.-W. LYVE1+ macrophages of murine peritoneal mesothelium promote omentum-independent ovarian tumor growth J Exp Med 218 2021 e20210924 10.1084/jem.20210924 PMC8575007 34714329 Supplemental Data  Supplemental Figure S1 Immune cell components in the dura mater of day 3 ( A B C A C P P U Supplemental Figure S2 Whole-mount staining of the transverse sinus shows a reduction in LYVE-1 + Supplemental Figure S3 Whole-mount staining of the transverse sinus shows the distribution of LYVE-1 + + + Supplemental Figure S4 Transcranial signal of fluorescein isothiocyanate–dextran distribution at the end point of intravital time-lapse imaging in wild-type mice. Scale bar = 2 mm. Supplemental Figure S5 luorescein isothiocyanate (FITC)–dextran [2 MDa distribution in the α-smooth muscle actin (αSMA)–DsRed smooth muscle reporter mice at 2 hours after i.c.m. injection]. A: B: C: D: E: White arrows A E B C D Supplemental Figure S6 Leptomeningeal macrophage and MLVs after 5 μL of clodronate liposome (CLL) i.c.m. injection. A: U B: A B P P A B Supplemental Figure S7 Fold change of vascular endothelial growth factor C (VEGF-C) and matrix metalloproteinase-9 (MMP-9) transcripts for day 7 clodronate liposome (CLL)–treated mice compared with phosphate-buffered saline liposome (PBSL) controls. Data are represented as means ± SEM. ∗ P U Supplemental Figure S8 Fluorescein isothiocyanate (FITC)–dextran and AL647-OVA retention in the leptomeninges ( A B U A B A B bottom panels B top panels Supplemental Figure S9 Phosphate-buffered saline liposome (PBSL; 25 μL) treatment did not impact MLVs or body weight of mice. A: B: A Supplemental Video S2 Timelapse imaging showing FITC-dextran distribution in mice at day 7 post-CLL treatment. Supplemental Video S1 Timelapse imaging showing FITC-dextran distribution in mice at day 7 post-PBSL treatment. Acknowledgments In memory of Dr. Dianne Kipnes, whose philanthropic support for lymphedema and lymphatic research through the Dianne and Irving Kipnes Foundation Supported by 10.13039/501100000024 Canadian Institutes of Health Research Irving Kipnes Foundation Supplemental material for this article can be found at https://doi.org/10.1016/j.ajpath.2025.05.017 ",
  "metadata": {
    "Title of this paper": "LYVE1+ macrophages of murine peritoneal mesothelium promote omentum-independent ovarian tumor growth",
    "Journal it was published in:": "The American Journal of Pathology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489351/"
  }
}