{
  "title": "Paper_1086",
  "abstract": "pmc Front Nutr Front Nutr 2731 fnut Front. Nutr. Frontiers in Nutrition 2296-861X Frontiers Media SA PMC12477915 PMC12477915.1 12477915 12477915 41031356 10.3389/fnut.2025.1617565 1 Nutrition Original Research Serum 25 (OH) D levels and risk of female-specific cancer in premenopausal women: a prospective study Hu Yue  1  † Zhu Chen  2  † Qin Yingyi  3  † Zhu Ying  4  5 Zhang Jianzheng  6 Tong Qiang  7  8  * Cai Shengyun  1  *  ‡ 1 Department of Obstetrics and Gynecology, The First Affiliated Hospital of Naval Medical University Shanghai China 2 College of Economics and Management, China Agricultural University Beijing China 3 Department of Military Health Statistics, Naval Medical University Shanghai China 4 Department of Pulmonary and Critical Care Medicine, 7th Medical Center of Chinese PLA General Hospital Beijing China 5 College of Pulmonary and Critical Care Medicine, 8th Medical Center of Chinese PLA General Hospital Beijing China 6 Department of Orthopedics, The Forth Medical Center, PLA General Hospital Beijing China 7 Department of Rheumatology and Immunology, Shanghai Sixth People's Hospital Affiliated to Shanghai Jiao Tong University School of Medicine Shanghai China 8 Division of Rheumatology and Clinical Immunology, Department of Medicine, Queen Mary Hospital, University of Hong Kong Hong Kong Hong Kong SAR, China Edited by: Małgorzata Mizgier Reviewed by: Dina Keumala Sari Yufei Liu Gulsym Serikbaivna Manasova *Correspondence: Shengyun Cai, caicai24@126.com jasontong1985@outlook.com ‡ orcid.org/0000-0003-3537-3539 † 15 9 2025 2025 12 480739 1617565 24 4 2025 29 8 2025 15 09 2025 30 09 2025 01 10 2025 Copyright © 2025 Hu, Zhu, Qin, Zhu, Zhang, Tong and Cai. 2025 Hu, Zhu, Qin, Zhu, Zhang, Tong and Cai https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Serum 25 (OH) D levels are associated with various diseases, including cancers, but inconsistencies exist for female-specific malignancies. This study is aimed to explore the real relationship between serum 25 (OH) D levels and incidence rates of female specific cancers in premenopausal women by a large-scale prospective cohort study. Study design We analyzed data from 51,286 UK Biobank participants using Cox regression models to explore associations. Subgroup analyses were based on vitamin D supplementation, alcohol, smoking, BMI, diabetes, sleep, and outdoor exposure. Categorical variables were described by frequencies and compared with chi-squared tests. Results During a median follow-up of 13.8 years, all cancer incidence was 5.1% ( n n n Conclusion Maintaining adequate serum 25 (OH) D levels is essential for overall health, reducing the risk of ovarian cancer, and potentially lowering susceptibility to uterine corpus cancer. female-specific malignant tumor premenopausal women prospective cohort study serum 25 (OH) D UK Biobank vitamin D Changhai Hospital of Shanghai 10.13039/501100008866 2019YXK014 22QA1411400 The author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by the “234 Discipline Peak Climbing Plan” of Changhai Hospital, Shanghai (Grant No. 2019YXK014), the Shanghai Science and Technology Development Funds (Grant No. 22QA1411400), and the Shanghai Key Laboratory Project (Grant No. 2025SZ04). This research has been conducted using the UK Biobank Resource (Application Number 106397). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Nutritional Epidemiology Introduction Vitamin D, a micronutrient, is primarily produced by the skin when exposed to sufficient ultraviolet B radiation from the sun, but can also be acquired from food or supplements ( 1 2 3 4 5–7 8–11 Studies have shown that serum 25 (OH) D deficiency is very common in the population. The 2011–2014 US Health and Nutrition Survey found that around 70% of females lack vitamin D, with the likelihood of insufficient vitamin D concentration being highest in individuals between 20 and 39 years old and slightly lower in those 60 years old and older. Vitamin D deficiency is very common in premenopausal women ( 12 13–16 17 18 19 This study utilized data from the UK Biobank (UKB) to examine the association between serum 25 (OH) D levels and specific tumorigenesis in premenopausal women, exploring whether vitamin D may help prevent certain types of cancer in women before menopause and providing evidence to support public health guidelines. Methods Study design and participants The UKB is a prospective cohort study initiated by the UK government that collected more than 500,000 samples from within the Commonwealth between 2006 and 2010 from 22 assessment centers. Participants consisted of women between the ages of 37–73. Data collection included questionnaires, physical exams, and samples of blood, urine, and saliva. Health outcomes were abstracted using hospital records and cancer registries. The research was authorized by the Ethics Board, and all participants gave informed consent in an electronic questionnaire. The UK Biobank approved limited data access (application number 106397) for a research project centered on premenopausal females (aged 39–70 years) with initial serum 25 (OH) D levels recorded (n = 58,404). Exclusion criteria included a history of cancer (n = 2,671), missing key covariate data (n = 4,447), comprised age, TSO, TDI, VD_supplement, DM, drink, smoke, BMI, number of live births, OCP, HRT, sleep duration, milk type. Cancer status at baseline was determined through self-reported medical conditions and hospital inpatient data. Ultimately, the analytic cohort comprised 51,286 premenopausal women, including: (1) women with natural premenopausal status, and (2) HRT-treated women who maintained cyclic menstrual function prior to treatment initiation ( Figure 1 Figure 1 Flow chart showing the patient selection for the study. Flowchart showing participant selection from the UK Biobank study. Initially, 273,293 female participants were recruited after excluding 229,064 males. Exclusions included 209,266 for menopause data issues, 5,623 for missing vitamin D data, and 2,671 for previous cancer. Finally, 51,286 participants were included in the analysis after removing 4,447 missing key covariate data. Measurement of serum 25 (OH) D Volunteer blood samples were obtained during the initial recruitment period from 2006 to 2010, subsequently processed, and preserved at −80 °C in liquid nitrogen. The density of serum 25 (OH) D was measured in nanomoles per liter (nmol/L) using a chemiluminescent immunoassay technique on the DiaSorin Liaison XL platform at the central laboratory facility of the UKB. This assay demonstrates a sensitivity range of 10–375 nmol/L for detecting vitamin D, enabling precise assessment of vitamin D concentrations across a broad range. For in-depth information on how the assay performs, visit the UK Biobank website ( 20 21 22 Determination of gynecologic malignant tumor cases Hospital records from inpatient databases in England, Scotland, and Wales dating back to 1998 were accessed for this study. Data on female-specific malignancies were collected by the National Cancer Registry from regional cancer centers across the UK. Malignancy status for ovarian cancer (C56), breast cancer (C50, D05), and uterine body cancer (C54, D07.0) was classified using ICD-10 codes. Cervical malignancies were excluded from the analysis due to the small number of cervical cancer cases. If a participant had multiple gynecologic malignancies, they were counted as a single case in all cancer cases. The date of disease onset was defined as the first recorded date. Follow-up began from the baseline recruitment date until the onset of disease or the end of follow-up. Covariate assessment Covariate data were obtained from touchscreen questionnaires completed at recruitment, covering sociodemographic factors (age, Townsend Deprivation Index [TDI]), lifestyle factors (history of alcohol use, history of smoking, sleep duration, time spent outdoors [TSO], milk type used), female-specific factors (number of live births, oral contraceptive [OCP], hormone replacement therapy [HRT]), health-related outcomes (Diabetes Mellitus [DM]) and health history (vitamin D supplement). The trained nurses meticulously collected data on individuals’ weight and height measurements at recruitment, utilizing these figures to compute their Body Mass Index (BMI, kg/m 2 23 Statistical analysis The study calculated medians (interquartile spacing) for continuous variables and employed the Wilcoxon rank sum test to assess differences in baseline characteristics between cohorts with serum 25 (OH) D concentration ≥50 nmol/L and those with concentration <50 nmol/L. Categorical variables were described and compared using frequencies (percentages) and the chi-squared test. We analyzed the connection between serum 25 (OH) D density and the incidence of female-specific malignancies using a multivariable Cox regression model, adjusting for age, TSO, TDI, VD_supplement, DM, drink, smoke, BMI, number of live births, OCP, HRT, sleep duration, milk type. The serum 25 (OH) D was included in the Cox regression model in three forms respectively: continuous variables (per 10 nmol/L increment), binary classification (50 nmol/L vs. ≥ 50 nmol/L), and trinary classification (30–50 nmol/L or <30 nmol/L vs. ≥ 50 nmol/L). To evaluate potential nonlinear associations between gynecologic malignancy incidence and serum 25 (OH) D concentration, we utilized restricted cubic splines (RCS) with three knots. Sensitivity analyses were performed using propensity score matching (PSM) and overlap weight (OW) propensity score weighting models to compare the incidence of female-specific malignancies between groups with serum 25 (OH) D concentration <50 nmol/L and ≥50 nmol/L ( 24 25 All statistical analyses were performed utilizing the R software version 4.0.3. All p Results Baseline characteristics of subjects Table 1 2 p Table 1 Supplementary Table S1 Table 1 Baseline characteristics of study participants by vitamin D levels. Overall N Original cohort PSM cohort Normal (VD ≥ 50 nmol/L) N Deficiency or Low (VD < 50 nmol/L) N  p ASMD Normal (VD ≥ 50 nmol/L) N Deficiency or Low (VD < 50 nmol/L) N  p ASMD Age, median [IQR] 46.00 [43.00, 49.00] 46.00 [43.00, 49.00] 46.00 [43.00, 49.00] 0.026 0.009 46.00 [43.00, 49.00] 46.00 [43.00, 49.00] 0.032 0.007 TSO, median [IQR] 2.00 [1.25, 3.00] 2.00 [1.50, 3.00] 2.00 [1.25, 3.00] <0.001 0.151 2.00 [1.50, 3.00] 2.00 [1.25, 3.00] <0.001 0.005 TDI, median [IQR] −1.98 [−3.57, 0.71] −2.32 [−3.73, 0.02] −1.69 [−3.43, 1.13] <0.001 0.206 −2.23 [−3.68, 0.18] −2.23 [−3.70, 0.25] 0.686 0.003 VD_supplement, n 13,580 (26.5) 6,797 (33.0) 6,783 (22.1) <0.001 0.246 5,579 (29.1) 5,533 (28.9) 0.612 0.005 DM, n 1703 (3.3) 413 (2.0) 1,290 (4.2) <0.001 0.127 408 (2.1) 425 (2.2) 0.575 0.006 Drinking, n <0.001 0.165 0.877 0.005 Never 2,210 (4.3) 509 (2.5) 1701 (5.5) 509 (2.7) 495 (2.6) Previous 1,371 (2.7) 463 (2.2) 908 (3.0) 450 (2.3) 443 (2.3) Current 47,705 (93.0) 19,616 (95.3) 28,089 (91.5) 18,194 (95.0) 18,215 (95.1) Smoke, n <0.001 0.052 0.779 0.007 Never 33,171 (64.7) 13,136 (63.8) 20,035 (65.3) 12,267 (64.0) 12,201 (63.7) Previous 13,130 (25.6) 5,538 (26.9) 7,592 (24.7) 5,065 (26.4) 5,118 (26.7) Current 4,985 (9.7) 1914 (9.3) 3,071 (10.0) 1821 (9.5) 1834 (9.6) BMI, median [IQR] 25.18 [22.68, 28.75] 24.49 [22.32, 27.39] 25.73 [22.99, 29.76] <0.001 0.322 24.68 [22.45, 27.65] 24.68 [22.39, 27.83] 0.980 0.008 Number of live births, median [IQR] 2.00 [0.00, 2.00] 2.00 [1.00, 2.00] 2.00 [0.00, 2.00] <0.001 0.071 2.00 [1.00, 2.00] 2.00 [1.00, 2.00] 0.475 0.003 OCP, n 45,762 (89.2) 18,968 (92.1) 26,794 (87.3) <0.001 0.160 17,560 (91.7) 17,588 (91.8) 0.616 0.005 HRT, n 1776 (3.5) 804 (3.9) 972 (3.2) <0.001 0.040 691 (3.6) 700 (3.7) 0.827 0.003 Sleep duration, median [IQR] 7.00 [7.00, 8.00] 7.00 [7.00, 8.00] 7.00 [7.00, 8.00] <0.001 0.078 7.00 [7.00, 8.00] 7.00 [7.00, 8.00] 0.488 0.003 Milk type used, n 5,068 (9.9) 1949 (9.5) 3,119 (10.2) 0.010 0.023 1815 (9.5) 1841 (9.6) 0.664 0.005 All Cancer, n 2,614 (5.1) 1,005 (4.9) 1,609 (5.2) 0.072 0.016 932 (4.9) 993 (5.2) 0.161 0.015 Ovary cancer, n 176 (0.3) 54 (0.3) 122 (0.4) 0.013 0.024 48 (0.3) 73 (0.4) 0.029 0.023 Breast cancer, n 2,232 (4.4) 897 (4.4) 1,335 (4.3) 0.982 <0.001 831 (4.3) 844 (4.4) 0.764 0.003 Uterine body cancer, n 235 (0.5) 67 (0.3) 168 (0.5) <0.001 0.034 65 (0.3) 87 (0.5) 0.088 0.018 TSO, Time spent outdoors (hours); TDI, Townsend deprivation index; DM, Diabetes Mellitus; OCP, Oral contraceptive; HRT, hormone replacement therapy; PSM, Propensity score matching; ASMD, Absolute standardized mean differences; VD, Serum 25 (OH) D; BMI, body mass index. Before conducting PSM, Table 1 Supplementary Figure S1A Serum 25 (OH) D levels and the risk of female-specific malignancies Over a 13.8-year following period, the incidence ratio of all cancers was 5.1% ( n n n n Table 1 Table 2 Table 2 Primary endpoint analysis of vitamin D levels and female-specific cancers. All Cancer Ovary cancer^ Breast cancer Uterine body cancer^ HR (95% CI) P HR (95% CI) P HR (95% CI) P HR (95% CI) P Vitamin D, per 10 nmol/L increase * 0.979 (0.96–0.998) 0.0279 0.904 (0.835–0.979) 0.0129 0.989 (0.969–1.009) 0.2845 0.945 (0.882–1.013) 0.1095 Low or Deficiency (50 nmol/L) vs. Normal (≥50 nmol/L) Multivariable Cox regression * 1.066 (0.983–1.157) 0.1219 1.457 (1.047–2.027) 0.0257 1.014 (0.929–1.107) 0.7532 1.372 (1.023–1.841) 0.0347 Propensity score matching # 1.069 (0.977–1.169) 0.1454 1.521 (1.056–2.189) 0.0241 1.018 (0.925–1.120) 0.7213 1.337 (0.969–1.844) 0.0767 OW weighting $ 1.065 (0.982–1.156) 0.1279 1.435 (1.031–1.998) 0.0324 1.012 (0.928–1.105) 0.7834 1.36 (1.013–1.826) 0.0408 Three group compare * Deficiency (<30 nmol/L) vs. Normal (≥50 nmol/L) 1.083 (0.978–1.199) 0.1237 1.668 (1.131–2.461) 0.0099 1.023 (0.916–1.143) 0.6859 1.35 (0.952–1.914) 0.0926 Low (30–50 nmol/L) vs. Normal (≥50 nmol/L) 1.056 (0.965–1.156) 0.2389 1.326 (0.919–1.913) 0.1315 1.009 (0.915–1.111) 0.8634 1.387 (1.009–1.906) 0.0437 *The hazard ratios and p- p- In sensitivity analyses, baseline characteristics of covariates after PSM and OW weighting are shown in Supplementary Figure S1B n Table 2 Table 2 Table 2 Figure 2 p Figure 2 Risk of cancer incidence according to Vitamin D. The solid line indicates AHRs for any vitamin D, with corresponding 95% CIs indicated by the shaded area. Vitamin D, Serum 25 (OH) D; AHRs, adjusted hazard ratios. (A) (B) (C) (D) Graphs show the adjusted hazard ratio of all, ovary, breast, and uterine cancer risk against Vitamin D levels. Each graph displays a line with a shaded confidence interval and p-values for non-linearity. The x-axis represents Vitamin D levels ranging from 10 to 170, while the y-axis represents the adjusted hazard ratio. Horizontal dotted lines indicate a baseline hazard ratio of 1.0, with varying trends in each cancer type graph. Accumulated cancer occurrence based on serum 25 (OH) D levels Supplementary Table S2 Figure 3 Figure 3B Figure 3D p Supplementary Table S2 Figure 3A Figure 3C p Figure 3 Cumulative incidence of cancer over time in normal and low or deficiency groups. (A) (B) (C) (D) Four graphs depict cumulative cancer probability over time for different conditions. Graph A shows all cancer types. Graph B focuses on ovary cancer. Graph C covers breast cancer. Graph D illustrates uterine cancer. In each graph, two lines compare normal levels (blue) with low or deficient levels (red), indicating higher cancer probabilities in the deficient group. Number at risk is provided below each graph. Subgroup analysis The following were revealed through subgroup analyses that considered vitamin D supplementation, alcohol consumption, smoking status, BMI, DM, sleep duration, and TSO. In the subgroup analysis of ovarian cancer ( Figure 4B p p p Figure 4 Forest plot depicting adjusted hazard ratios of Low or Deficiency (50) group versus Normal (≥50) group for all cancer and each cancer incidence risk in subgroup population. (A) (B) (C) (D) Forest plot showing hazard ratios (HR) and confidence intervals for the impact of various factors on cancer types: A) All cancer, B) Ovary cancer, C) Breast cancer, and D) Uterine cancer. Subgroups include VD supplement, drink and smoke status, BMI, diabetes mellitus, sleep duration, and time spent outdoors. The plots compare normal and deficiency or low groups. HRs and p-values are provided, indicating the statistical significance of each factor. Horizontal axes represent the hazard rate, with markers indicating whether normal or deficiency groups are better. A similar trend was observed for uterine body cancer ( Figure 4D p In the analyses for all cancers ( Figure 4A Figure 4C p Discussion Principal findings Analysis of data from the UK Biobank over a 13.8-year follow-up period indicated that higher serum 25 (OH) D concentrations in premenopausal women were associated with a reduced incidence of ovarian cancer and potentially linked to a lower incidence of uterine body cancer. In individuals with a sleep duration of less than 6 h and those who currently consume alcohol, serum 25 (OH) D concentrations below 50 nmol/L were associated with a significantly increased risk of ovarian and uterine body cancer compared to those with sufficient serum 25 (OH) D levels. Results in the context of what is known Circulating 25 (OH) D serves as the primary biomarker of vitamin D status, reflecting both endogenous synthesis and dietary intake. Limited research has been conducted on the correlation between levels of circulating 25 (OH) D and the likelihood of developing tumors specific to females in women before menopause ( 26 27 18 28 A Mendelian randomization (MR) study in European populations reported an inverse association between genetically predicted lower serum 25 (OH) D levels and ovarian cancer risk ( 29 30–32 Potential biological plausibility 1α,25 (OH) 2D3 can promote the production of antimicrobial peptides, suppress excessive inflammation to prevent tissue damage, bind to VDR in monocytes, induce the expression of the cathelicidin antimicrobial peptide (hCAP), and enhance bactericidal activity ( 33 4 34 35 Clinical implications We did not observe a significant association between serum 25 (OH) D levels and breast cancer risk across various subgroups, a result that differs from the significant associations found for ovarian and uterine body cancers. In a 5-year follow-up study of postmenopausal women, Marie K. Dam reported that alcohol intake was associated with an increased risk of breast cancer ( 36 37 38 Modern medicine identifies diabetes and obesity as high-risk factors for endometrial cancer. In this study, subgroup analyses based on diabetes status and BMI revealed no significant association between serum 25 (OH) D levels and the risk of uterine body cancer, consistent with the findings of a case–control study conducted in 2010 ( 39 40 41 Research implications The findings of this research have important implications for public health and clinical practice, particularly highlighting the high prevalence of vitamin D deficiency in premenopausal women. This highlights the importance of implementing specific measures to enhance serum 25 (OH) D density in this demographic ( 42 19 43 Strengths and limitations This study has several strengths, including a large sample size, robust statistical analysis, and comprehensive adjustment for potential confounders, but it also has its limitations. Specifically, this is an observational study, so causal relationships cannot be inferred. The association between serum 25 (OH) D concentrations and cancer risk may be influenced by unmeasured confounding factors, including participants’ race and the season of blood sample collection. Additionally, this study relied on a single measurement of serum 25 (OH) D, which may not fully reflect long-term vitamin D levels or changes in individual lifestyle factors that could impact vitamin D metabolism. Further longitudinal studies are needed to validate these findings and explore the causal mechanisms between vitamin D and cancer risk. Recognizing the complexity of the relationship between cancer and vitamin D is essential, as it is affected by various factors ( 44 45 Conclusion This study demonstrates that insufficient serum 25 (OH) D levels are associated with an increased risk of ovarian cancer and potentially endometrial cancer, particularly among individuals with alcohol consumption and sleep duration less than 6 h. Our findings further substantiate the importance of maintaining adequate vitamin D levels for overall health and reducing potential risks of specific cancers. Public health policies should prioritize optimizing vitamin D status, while further research is needed to elucidate the complex relationship between vitamin D and cancer risk, which may lead to improved prevention and treatment strategies for premenopausal women’s malignancies. Although our study supports maintaining sufficient vitamin D status for cancer prevention, individualized risk–benefit assessments remain crucial, especially for patients with a history of nephrolithiasis or granulomatous disorders. We especially thank all the participants of UK Biobank and all the people involved in building the UK Biobank study. We use Chat GPT to polish the language of the article. Abbreviations VDR, vitamin D receptor; TDI, Townsend Deprivation Index; TSO, time spent outdoors; OCP, oral contraceptive; HRT, hormone replacement therapy; BMI, body mass index; PSM, propensity score matching; OW, overlap weight; AHRs, adjusted hazard ratios; hCAP, human cathelicidin antimicrobial peptide. Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Ethics statement The studies involving humans were approved by the UK Biobank Ethics Advisory Committee (EAC) and the North West Multi-centre Research Ethics Committee. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Author contributions YH: Investigation, Data curation, Conceptualization, Formal analysis, Methodology, Writing – original draft. CZ: Methodology, Data curation, Project administration, Writing – original draft, Formal analysis. YQ: Funding acquisition, Formal analysis, Methodology, Data curation, Investigation, Writing – original draft. YZ: Writing – original draft, Methodology, Resources. JZ: Resources, Project administration, Writing – original draft. QT: Supervision, Conceptualization, Writing – review & editing, Validation, Resources, Visualization, Funding acquisition, Project administration. SC: Visualization, Conceptualization, Methodology, Validation, Resources, Project administration, Supervision, Writing – review & editing, Software. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fnut.2025.1617565/full#supplementary-material References 1. Pludowski P Holick MF Grant WB Konstantynowicz J Mascarenhas MR Haq A Vitamin D supplementation guidelines J Steroid Biochem Mol Biol 2018 175 125 35 10.1016/j.jsbmb.2017.01.021 28216084 2. Giustina A Bilezikian JP Adler RA Banfi G Bikle DD Binkley NC Consensus statement on vitamin D status assessment and supplementation: whys, whens, and Hows Endocr Rev 2024 45 625 54 10.1210/endrev/bnae009 38676447 PMC11405507 3. Tsuprykov O Chen X Hocher CF Skoblo R Lianghong Yin Hocher B Why should we measure free 25 (OH) vitamin D? J Steroid Biochem Mol Biol 2018 180 87 104 10.1016/j.jsbmb.2017.11.014 29217467 4. Xia X Xu F Dai D Xiong A Sun R Ling Y VDR is a potential prognostic biomarker and positively correlated with immune infiltration: a comprehensive pan-cancer analysis with experimental verification Biosci Rep 2024 44 10.1042/BSR20231845 38639057 PMC11065647 5. Lucas A Wolf M Vitamin D and health outcomes: then came the randomized clinical trials JAMA 2019 322 1866 8 10.1001/jama.2019.17302 31703117 6. Reid IR Vitamin D and fractures The Lancet Diabetes & Endocrinology 2023 11 301 2 10.1016/S2213-8587(23)00087-6 37011648 7. Zhao S Qian F Wan Z Chen X Pan A Liu G Vitamin D and major chronic diseases Trends Endocrinol Metab 2024 35 1050 61 10.1016/j.tem.2024.04.018 38824035 8. Ting H-J Yasmin-Karim S Yan SJ Hsu JW Lin TH Zeng W A positive feedback signaling loop between ATM and the vitamin D receptor is critical for cancer chemoprevention by vitamin D Cancer Res 2012 72 958 68 10.1158/0008-5472.CAN-11-0042 22207345 PMC6616526 9. Jeon S-M Shin E-A Exploring vitamin D metabolism and function in cancer Exp Mol Med 2018 50 1 14 10.1038/s12276-018-0038-9 29657326 PMC5938036 10. Feldman D Krishnan AV Swami S Giovannucci E Feldman BJ The role of vitamin D in reducing cancer risk and progression Nat Rev Cancer 2014 14 342 57 10.1038/nrc3691 24705652 11. Giampazolias E Pereira da Costa M Lam KC Lim KHJ Cardoso A Piot C Vitamin D regulates microbiome-dependent cancer immunity Science 2024 384 428 37 10.1126/science.adh7954 38662827 PMC7615937 12. Herrick KA Storandt RJ Afful J Pfeiffer CM Schleicher RL Gahche JJ Vitamin D status in the United States, 2011-2014 Am J Clin Nutr 2019 110 150 7 10.1093/ajcn/nqz037 31076739 PMC7263437 13. Kim Y Chang Y Cho Y Chang J Kim K Park DI Serum 25-Hydroxyvitamin D levels and risk of colorectal Cancer: an age-stratified analysis Gastroenterology 2023 165 920 31 10.1053/j.gastro.2023.06.029 37429364 14. Kanaan Y Copeland RL The link between vitamin D and prostate cancer Nat Rev Cancer 2022 22 435 10.1038/s41568-022-00493-y 35761063 15. Jacot W Firmin N Roca L Topart D Gallet S Durigova A Impact of a tailored oral vitamin D supplementation regimen on serum 25-hydroxyvitamin D levels in early breast cancer patients: a randomized phase III study Annal Oncol 2016 27 1235 41 10.1093/annonc/mdw145 27029707 16. Zhang X He Y Li X Shraim R Xu W Wang L Circulating 25-hydroxyvitamin D and survival outcomes of colorectal cancer: evidence from population-based prospective cohorts and Mendelian randomisation Br J Cancer 2024 130 1585 91 10.1038/s41416-024-02643-5 38480934 PMC11058806 17. Webb PM de Fazio A Protani MM Ibiebele TI Nagle CM Brand AH Circulating 25-hydroxyvitamin D and survival in women with ovarian cancer Am J Clin Nutr 2015 102 109 14 10.3945/ajcn.114.102681 25971716 18. Liu JJ Bertrand KA Karageorgi S Giovannucci E Hankinson SE Rosner B Prospective analysis of vitamin D and endometrial cancer risk Annal Oncol 2013 24 687 92 10.1093/annonc/mds509 23136228 PMC3574547 19. Manson JE Crandall CJ Rossouw JE Chlebowski RT Anderson GL Stefanick ML The Women's Health Initiative randomized trials and clinical practice: a review JAMA 2024 331 1748 60 10.1001/jama.2024.6542 38691368 20. UK Biobank Companion document for serum biomarker data [Internet] 2018 https://biobank.ndph.ox.ac.uk/ukb/refer.cgi?id=1227 21. UK Biobank UK biobank biomarker project, companion document to accompany serum biomarker data 2019 https://biobank.ndph.ox.ac.uk/ukb/refer.cgi?id=1227 22. Chen L-J Sha S Stocker H Brenner H Schöttker B The associations of serum vitamin D status and vitamin D supplements use with all-cause dementia, Alzheimer's disease, and vascular dementia: a UK biobank based prospective cohort study Am J Clin Nutr 2024 119 1052 64 10.1016/j.ajcnut.2024.01.020 38296029 PMC11007746 23. Jordan H Roderick P Martin D The index of multiple deprivation 2000 and accessibility effects on health J Epidemiol Community Health 2004 58 250 7 10.1136/jech.2003.013011 14966241 PMC1732697 24. Li F Morgan K Zaslavsky A Balancing covariates via propensity score weighting J Am Stat Assoc 2018 113 390 400 10.1080/01621459.2016.1260466 25. Zhang Z Kim HJ Lonjon G Zhu Y Written on behalf of AME Big-Data Clinical Trial Collaborative Group. Balance diagnostics after propensity score matching Annal Transl Med 2019 7 16 10.21037/atm.2018.12.10 30788363 PMC6351359 26. Thomson CA Aragaki AK Prentice RL Stefanick ML Manson JAE Wactawski-Wende J Long-term effect of randomization to calcium and vitamin D supplementation on health in older women: Postintervention follow-up of a randomized clinical trial Ann Intern Med 2024 177 428 38 10.7326/M23-2598 38467003 27. Bauer SR Hankinson SE Bertone-Johnson ER Ding EL Plasma vitamin D levels, menopause, and risk of breast cancer: dose-response meta-analysis of prospective studies Medicine 2013 92 123 31 10.1097/MD.0b013e3182943bc2 23625163 PMC4553988 28. Ritonja JA Danieli C Pana MP Palmer MJ L’Espérance K Ho V Predicted 25-hydroxyvitamin D over the adult life and the risk of ovarian cancer Am J Epidemiol 2024 193 1233 41 10.1093/aje/kwae070 38754871 PMC11369219 29. Ong J-S Cuellar-Partida G Lu Y Australian Ovarian Cancer Study Fasching PA Hein A Association of vitamin D levels and risk of ovarian cancer: a Mendelian randomization study Int J Epidemiol 2016 45 1619 30 10.1093/ije/dyw207 27594614 PMC5100621 30. Dimitrakopoulou VI Tsilidis KK Haycock PC Dimou NL al-Dabhani K Martin RM Circulating vitamin D concentration and risk of seven cancers: Mendelian randomisation study BMJ (Clinical Research ed.) 2017 359 j4761 10.1136/bmj.j4761 29089348 PMC5666592 31. Lawler T Warren Andersen S Serum 25-Hydroxyvitamin D and Cancer risk: a systematic review of Mendelian randomization studies Nutrients 2023 15 422 10.3390/nu15020422 36678292 PMC9865859 32. Yuan S Baron JA Michaëlsson K Larsson SC Serum calcium and 25-hydroxyvitamin D in relation to longevity, cardiovascular disease and cancer: a Mendelian randomization study NPJ Genom Med 2021 6 86 10.1038/s41525-021-00250-4 34650087 PMC8516873 33. Adams JS Ren S Liu PT Chun RF Lagishetty V Gombart AF Vitamin d-directed rheostatic regulation of monocyte antibacterial responses J Immunol 2009 182 4289 95 10.4049/jimmunol.0803736 19299728 PMC2683618 34. Jensen SS Madsen MW Lukas J Binderup L Bartek J Inhibitory effects of 1alpha,25-dihydroxyvitamin D(3) on the G(1)-S phase-controlling machinery Molec Endocrinol 2001 15 1370 80 10.1210/mend.15.8.0673 11463860 35. Schlange T Matsuda Y Lienhard S Huber A Hynes NE Autocrine WNT signaling contributes to breast cancer cell proliferation via the canonical WNT pathway and EGFR transactivation Breast Cancer Res 2007 9 R63 10.1186/bcr1769 17897439 PMC2242658 36. Dam MK Hvidtfeldt UA Tjønneland A Overvad K Grønbæk M Tolstrup JS Five year change in alcohol intake and risk of breast cancer and coronary heart disease among postmenopausal women: prospective cohort study BMJ (Clinical Research ed) 2016 353 i2314 10.1136/bmj.i2314 PMC5068920 27169583 37. Akram M Iqbal M Daniyal M Khan AU Awareness and current knowledge of breast cancer Biol Res 2017 50 33 10.1186/s40659-017-0140-9 28969709 PMC5625777 38. Shirazi L Almquist M Borgquist S Malm J Manjer J Serum vitamin D (25OHD3) levels and the risk of different subtypes of breast cancer: a nested case-control study Breast (Edinburgh, Scotland) 2016 28 184 90 10.1016/j.breast.2016.06.002 27326980 39. Zeleniuch-Jacquotte A Gallicchio L Hartmuller V Helzlsouer KJ McCullough ML Setiawan VW Circulating 25-hydroxyvitamin D and risk of endometrial cancer: cohort consortium vitamin D pooling project of rarer cancers Am J Epidemiol 2010 172 36 46 10.1093/aje/kwq114 20562189 PMC2892537 40. Choi JH Lee B Lee JY Kim CH Park B Kim DY Relationship between sleep duration, Sun exposure, and serum 25-Hydroxyvitamin D status: a Cross-sectional study Sci Rep 2020 10 4168 10.1038/s41598-020-61061-8 32144371 PMC7060268 41. Berretta M Quagliariello V Bignucolo A Facchini S Maurea N di Francia R The multiple effects of vitamin D against chronic diseases: from reduction of lipid peroxidation to updated evidence from clinical studies Antioxidants 2022 11 1090 10.3390/antiox11061090 35739987 PMC9220017 42. Méndez-Sánchez L Clark P Winzenberg TM Tugwell P Correa-Burrows P Costello R Calcium and vitamin D for increasing bone mineral density in premenopausal women. The Cochrane Database Syst Rev 2023 2023 CD012664 10.1002/14651858.CD012664.pub2 36705288 PMC9881395 43. Chan DSM Cariolou M Markozannes G Balducci K Vieira R Kiss S Post-diagnosis dietary factors, supplement use and colorectal cancer prognosis: a global Cancer update Programme (CUP global) systematic literature review and meta-analysis Int J Cancer 2024 155 445 70 10.1002/ijc.34906 38692645 44. Olszewska AM Zmijewski MA Genomic and non-genomic action of vitamin D on ion channels - targeting mitochondria Mitochondrion 2024 77 101891 10.1016/j.mito.2024.101891 38692383 45. Shu J Zhang M Dong X Long J Li Y Tan P Vitamin D receptor gene polymorphisms, bioavailable 25-hydroxyvitamin D, and hepatocellular carcinoma survival J Natl Cancer Inst 2024 116 1687 96 10.1093/jnci/djae116 38830043 ",
  "metadata": {
    "Title of this paper": "Vitamin D receptor gene polymorphisms, bioavailable 25-hydroxyvitamin D, and hepatocellular carcinoma survival",
    "Journal it was published in:": "Frontiers in Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477915/"
  }
}