{
  "title": "Paper_923",
  "abstract": "pmc Patient Prefer Adherence Patient Prefer Adherence 966 ppa ppa Patient preference and adherence 1177-889X Dove Press PMC12477276 PMC12477276.1 12477276 12477276 41030513 10.2147/PPA.S544351 544351 1 Review A Systematic Review of Internet-Based Remote Patient Monitoring Systems for Chronic Disease Management in Asian Emaliyawati et al Emaliyawati et al http://orcid.org/0000-0002-9123-4843 Emaliyawati Etika  1 http://orcid.org/0000-0001-8609-288X Ibrahim Kusman  2 Kurniawan Titis  2 http://orcid.org/0000-0001-9970-0135 Fitria Nita  3 http://orcid.org/0000-0003-1967-848X Songwathana Praneed  4 1 Department of Emergency and Critical Care Nursing, Faculty of Nursing, Universitas Padjadjaran Sumedang West Java Indonesia 2 Department of Medical-Surgical Nursing, Faculty of Nursing, Universitas Padjadjaran Sumedang West Java Indonesia 3 Department of Fundamental Nursing, Faculty of Nursing, Universitas Padjadjaran Sumedang West Java Indonesia 4 Faculty of Nursing, Prince of Songkla University Songkhla 90110 Thailand Correspondence: Etika Emaliyawati, Department of Emergency and Critical Care Nursing, Faculty of Nursing, Universitas Padjadjaran Sumedang West Java Indonesia Fax +622287793411 24 9 2025 2025 19 478558 2985 3000 08 6 2025 28 8 2025 24 09 2025 30 09 2025 01 10 2025 © 2025 Emaliyawati et al. 2025 Emaliyawati et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Background Chronic diseases are an increase global health concern driven by aging populations and lifestyle changes. In Asia, rapid demographic shifts and diverse healthcare systems pose unique challenges for chronic disease management. Internet-based remote monitoring systems offer innovative solutions for early detection and timely intervention, but their effectiveness within the varied Asian context requires thorough evaluation. Purpose This systematic review aimed to evaluate the effectiveness of internet-based remote monitoring systems in managing outcomes among patients with chronic diseases. Methods A systematic literature search was conducted across major electronic databases, including PubMed, Scopus, Taylor and Francis, and EBSCOhost, employing a combination of relevant search terms. The keywords used were “remote monitoring OR telemonitoring OR internet-based monitoring AND chronic disease OR chronic illness AND patient outcome OR health outcome OR clinical outcome”. The inclusion criteria are defined using the PICO framework. The data were analyzed descriptively and qualitatively using thematic analysis. Results Following rigorous screening and quality appraisal, 16 studies met the inclusion criteria. These studies employed diverse remote monitoring modalities, encompassing automated remote monitoring systems, patient-reported monitoring, and personalized telecommunication-based approaches. The evidence demonstrates that internet-based remote monitoring systems significantly enhance chronic disease management across various Asian contexts. Conclusion Internet-based remote patient monitoring constitutes a pivotal advancement in chronic disease management. It facilitates timely emergency responses, reduces healthcare utilization, and optimizes clinical outcomes within Asian healthcare settings. Future efforts should focus on synergizing automated data acquisition, patient self-reporting, and personalized communication to overcome challenges related to sustained behavioral change and quality-of-life improvements. Keywords remote monitoring internet-based monitoring chronic diseases emergency response systematic review pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Chronic diseases have become increasing global health challenge due to aging populations and changing lifestyles. 1 2 3 2 1 4 5 6 7 Patients with chronic diseases often experience medical emergencies. Early detection of changes in health conditions is key in managing chronic diseases. 8 9 10 7 11 12 13 Previous studies have reported that remote monitoring systems have shown effectiveness in managing chronic diseases by reducing rehospitalization rates and mortality, especially in patients with heart failure and chronic obstructive pulmonary disease. 13–15 13 16 13 16 11 One of the main advantages of internet-based remote monitoring systems is their potential to reduce the incidence of hospitalization and optimize the use of medical resources. 17 6 10 17 17 Despite its many advantages, implementing remote monitoring systems is still faces several technical and operational challenges. Issues such as interoperability between devices, reliability of internet connections, and real-time data analysis capabilities must be addressed. 18 19 18 19 The rapid demographic transition and increasing burden of chronic diseases in Asia make this region a critical focus for evaluating remote monitoring interventions. Asian countries face unique challenges, including diverse healthcare infrastructures, varying levels of technology access, and differing cultural attitudes towards digital health. Moreover, many Asian populations are experiencing accelerated aging and urbanization, which compound the prevalence of chronic diseases and strain healthcare systems. Despite promising evidence globally, remote monitoring technologies’ contextual effectiveness, feasibility, and acceptability within Asian settings remain underexplored. Existing reviews have predominantly focused on Western and high-income countries, 6 20 21 Materials and Methods Study Design This review employed a systematic review design and followed the guidelines of the Cochrane Handbook for Systematic Reviews of Interventions and the Preferred Reporting Item for Systematic Reviews and Meta-analysis (PRISMA). 22 23 Eligibility Criteria This literature review used PRISMA to find the efficacy of internet-based remote monitoring systems for emergency response in chronic disease care. 22 P (Population): Adult patients with chronic diseases I (Intervention): Remote monitoring or telemonitoring C (Comparison): Standard care or usual care O (Outcome): Emergency response, readmission, quality of life, etc In this review, articles without full-text access, not published in English, and classified as secondary research were excluded from the analysis. The inclusion criteria consisted of full-text accessible articles published in English and original research discussing the efficacy of internet-based remote monitoring systems in chronic disease care. Additionally, this review did not limit the year of publication in the selection of literature to ensure broader coverage of the development of internet-based remote monitoring systems for emergency response. This approach enables the analysis of long-term trends, identification of early innovations, and comparison of the effectiveness of both old and new methods in enhancing learning outcomes. Data Collection and Analysis Search Strategy Two authors (E.E and K.I) conducted a systematic literature search through four primary databases: EBSCOhost, Pubmed, Scopus, and Taylor and Francis. The keywords used were “remote monitoring OR telemonitoring OR internet-based monitoring AND chronic disease OR chronic illness AND patient outcome OR health outcome OR clinical outcome”. Each keyword is verified using MeSH (Medical Subject Headings), and synonyms are applied to capture all relevant articles. In addition, the author uses Boolean operators such as “AND” and “OR” to filter or expand search results based on various word variations. Each database may have specific search features. Therefore, search terms will be adjusted to the relevant syntax and thesaurus. Study Selection and Quality Appraisal Two authors (E.E and K.I) independently selected studies that met the eligibility criteria. Using the Mendeley reference manager, the authors checked for duplication in the initial selection process. Then, check the title, abstract, and full text for relevance to the research topic and establish inclusion and exclusion criteria. Three authors (E.E., T.K., and N.F.) checked each text completely using the Joanna Briggs Institute (JBI) critical appraisal checklist in the final process. 24 Data Extraction and Analysis The first author extracted the data and double-checked it with other authors in the form of an extraction table In this review, data extraction from the studies was analyzed using a table describing all the results related to the topic discussed. The information presented in the extraction table is related to the characteristics of the study and remote monitoring characteristics. The data analysis process begins with the identification and presentation of data obtained in the form of tables based on the reviewed articles. After receiving the data, all authors analyze and explain each finding based on the extraction results. The analysis uses thematic analysis to identify key themes and patterns across the studies, complemented by a qualitative descriptive approach to provide rich, detailed descriptions of the findings. Finally, the authors recheck the included studies to ensure and minimize errors during extraction. Assessment of Risk of Bias in Included Studies Three authors (E.E, K.I, and T.K) independently assessed the Risk of Bias (RoB) for RCT studies included in this review analysis using the Cochrane Risk of Bias (RoB) tool. RCT studies consist of five RoB domains, including (1) randomization process, (2) deviation from the intended intervention, (3) missing outcome data, (4) outcome measurement, and (5) selection of reported outcomes. 25 Rob assessment for the quasi-experimental and observational study design used the Cochrane Review of Nonrandomized Intervention Studies (ROBINS-I). 26 Results Study Selection In the identification phase, 8185 records were retrieved from major electronic databases, including PubMed (774), Scopus (5636), EBSCOhost (320), and Taylor & Francis (1455) (see Figure 1 Figure 1 PRISMA Flow Diagram. Adapted from Page MJ, McKenzie JE, Bossuyt PM et al. The PRISMA 2020 statement: an updated guideline for reporting systematic reviews. BMJ 22 At the eligibility assessment stage, a total of 275 full-text articles were assessed for eligibility. However, 194 reports were not retrieved so only 81 articles could be fully assessed. Of these 81 articles, 69 were excluded for the following reasons: inappropriate study design (n=21), inappropriate intervention (n=6), publication not in English (n=8), and study not conducted in Asia (n=34). Finally, 16 studies met all inclusion criteria. Of these, 12 articles were from database searches and 4 articles from manual searches. Critical Appraisal and Risk of Bias Results Table 1 Table 1 Characteristics of Study Ref Design Country Participants Mean Age Male (%) Diagnosis JBI Amir et al, 2017 27 Prospective, longitudinally-controlled study Israel 50 73.8 ± 10.3 62 Acute decompensated heart failure 81.8% Chau et al, 2012 28 RCT Hong Kong 40 73.50 ± 6.05) 95.5 Moderate to severe COPD 77% Chen et al, 2013 29 Quasi-experimental Taiwan 141 70.8 (60.8–78.3) 61 Cardiovascular diseases 100% Cho et al, 2009 30 RCT South Korea 69 45.2 ± 11.3 78.2 Type 2 diabetes mellitus 77% Chow et al, 2019 31 Non-randomized controlled study Singapore 205 57.9 ± 12.3 60.7 Heart failure 100% Kim et al, 2008 32 Quasi-experimental South Korea 34 45.5 ± 9.1 50 Obese type 2 diabetes 100% Kim et al, 2019 33 RCT South Korea 60 45.3 (9.5) 85 Obstructive sleep apnea (OSA) 77% Kotooka et al, 2018 34 RCT Japan 181 67.1 ± 12.8 59.1 Heart failure 84.6% Liew et al, 2009 35 RCT Malaysia 931 57.73 39.5 Chronic disease (DM, HT, Hyperlipidaemia) 92.3% Liu et al (2011) 36 RCT Taiwan 89 50.4 ± 1.9 51.2 Moderate-to-severe persistent asthma 77% Porath et al (2017) 37 Quasi-experimental Israel 389 79.6+ 7.4 44.8 Complex chronic conditions (DM, HT, TIA, HF, COPD, Dementia) 100% Shahid et al (2015) 38 RCT Pakistan 440 48.95 ± 8.83 61.4 Type-2 Diabetes Mellitus with HbA1c ≥ 8% 77% Shetty et al (2011) 39 Pilot Study with Randomization India 144 50.5 ± 8.3 NR Type-2 Diabetes Mellitus 77% Shimoyama et al (2023) 40 RCT Japan 31 72.5 ± 10.9 58.1 Chronic respiratory failure with NPPV 77% Tian et al (2015) 41 RCT China and India 2.086 59.7±11.7 34,6 CHD, stroke, diabetes, hypertension 84.6% Tsang et al (2001) 42 Prospective interventional crossover study Hong Kong 19 30 ± 8.0 68.4 Diabetes mellitus 81.8% Abbreviations In randomized controlled trials (RCTs), most studies applied proper randomization and adequately concealed treatment allocation with comparable groups at baseline. However, several studies showed participant, provider, and outcome assessor blinding limitations, which could introduce bias. Despite these limitations, outcome measurements were consistent and reliable, with complete follow-up data and appropriate statistical analysis, yielding quality scores ranging from 77% to 92.3%. For quasi-experimental studies, all evaluated research demonstrated a clear understanding of causal relationships, comparability between participant groups, the presence of control groups, repeated outcome measurements before and after the intervention, and completeness and reliability of follow-up data. All studies also employed appropriate statistical analyses, resulting in a perfect quality score of 100%. Risk of bias assessment for cohort and quasi-experimental studies showed a low risk of bias in most domains, except for confounding bias, which was rated as moderate across all studies (see Figure 2 Figure 2 Risk of Bias Assessment Results. 27–42 Characteristics of Studies Geographically, the study was conducted in various countries in Asia and beyond, including Israel, Hong Kong, Taiwan, South Korea, Singapore, Japan, Malaysia, Pakistan, India, China, and a combination of China and India. The study with the most significant number of participants was researched by Tian et al 41 42 Figure 3 Figure 3 Country by Design. Characteristics of Participants The characteristics of the various studies reviewed showed quite wide variations in terms of the number of participants and the average age (see Table 1 42 37 Analysis of Delivery Method in Remote Monitoring This review categorized remote monitoring into three types: automated remote monitoring systems, patient-reported monitoring systems, and personalized remote monitoring via telecommunication (see Table 2 Table 2 Characteristics of Remote Monitoring Ref Intervention Delivery Method Monitored Component Outcomes Theme I: Automated Remote Monitoring Systems Amir et al, 2017 27 Remote Dielectric Sensing (ReDS) technology-guided therapy Wearable vest for daily ReDS lung fluid volume readings Daily lung fluid volume BNP (B-type natriuretic peptide) and patient weight Reduce HF readmissions Chau et al, 2012 28 Telecare service Telecare kit (Mobile phone, pulse oximeter RR sensor) with data transmission to online platform Physiological monitoring plus medication and breathing reminders, monitoring oxygen saturation, pulse and respiration rate. High satisfaction; no significant difference in quality of life or hospital readmission between groups Chen et al, 2013 29 Synchronous telehealth services Instant transmission of vitals plus telephone support BP, pulse, ECG, oximetry, glucometry monitoring. Significant reduction in hospital admission rates and length of stays; cost savings Cho et al, 2009 30 Mobile phone glucometer vs Internet-based glucose monitoring system Mobile phone with integrated glucometer and web platform Blood glucose (via glucometer integrated in mobile phone) Patients also record medication, lifestyle changes, symptoms related to diabetes management HbA1c significantly decreased; high satisfaction and adherence. Chow et al, 2019 31 Telemonitoring vs Structured Telephone Support Telemonitoring using Bluetooth-enabled devices (daily weight, BP, HR) combined with teleeducation and telesupport Body weight, blood pressure, heart rate, symptom surveys. Reduced heart failure-related bed days at 180 days and 1 year Lower all-cause bed days and mortality at 1 year in telemonitoring group Improved patient self-care maintenance and confidence scores Estimated healthcare cost savings (~SGD 2774) Kim et al, 2019 33 Personal Health Record (PHR) + wearable vs PHR app only Mobile app + wristband activity tracker Weight, daily step counts, sleep log, stress, blood pressure Significant weight reduction in both intervention groups (app + wearables and app only) App + wearables group had higher physical activity levels Kotooka et al, 2018 34 Home telemonitoring for heart failure Home telemonitoring system involving wireless electronic scales, blood pressure monitors, and pulse rate monitors that transmitted physiological data daily via internet to a telemonitoring center staffed by nurses. Body weight, blood pressure, pulse rate, and body composition. Monitoring nurses reviewed these data daily and contacted patients or their physicians if data crossed predefined thresholds. No significant difference in composite end-point (death or rehospitalization); feasible telemonitoring Theme II: Patient-Healthcare Reported Monitoring Systems Kim et al, 2008 32 SMS + Internet self-monitoring intervention SMS and Internet-based weekly feedback on self-recorded glucose and medication data via website HbA1c, fasting plasma glucose (FPG), 2-hour post-prandial glucose (2HPPT) Significant HbA1c and postprandial glucose improvements. Intervention helps maintain blood glucose levels and reduce body weight Liu et al (2011) 36 Mobile phone-based interactive asthma self-care system Mobile phone-based interactive software installed on patients’ phones for daily symptom tracking and management advice. Peak expiratory flow rate (PEFR), asthma symptom scores (sleep quality, coughing severity, breathing difficulty, daily activity limitation), and reliever medication use. Improved asthma control measured by increased PEFR, better lung function (FEV1), fewer exacerbations and unscheduled visits, and improved quality of life over 6 months. Porath et al (2017) 37 Proactive multidisciplinary telecare center Telecare system with phone and EMR integration. Clinical status of frail elderly patients with complex chronic conditions, including comorbidities, hospitalization data, medication adherence, and health service utilization. Significant reduction in hospital days and costs, lower monthly healthcare costs, improved care quality Shahid et al (2015) 38 Mobile phone direct calls every 15 days Telephone calls to patients to discuss self-monitoring blood glucose (SMBG), medication adherence, diet, physical activity, and lifestyle. Monitoring of self-monitoring: HbA1c levels, SMBG adherence, following diet, physical activity, medication intake, BP, LDL, It is helpful in lowering HbA1c levels in the intervention group through direct communication with the diabetic patients. Lowering LDL and following a diabetic diet plan can reduce HbA1c in these patients and help prevent future complications. Shimoyama et al (2023) 40 ICT-based telenursing intervention program Tablet (telemonitoring + telehealth counseling) Daily input of vital signs and symptoms, telemonitoring, health counseling, nursing interventions for exacerbation prevention Reduced hospitalizations and hospital days, improved quality of life, enhanced self-care ability. Tsang et al (2001) 42 Hand-held electronic diary with feedback Handheld electronic diary + phone modem Recording dietary intake and blood glucose, immediate nutritional feedback, Email consultation with health professionals Significant HbA1c reduction, high patient satisfaction, and acceptability Theme III: Personalized Remote Monitoring via Telecommunication Liew et al, 2009 35 Text messaging reminder vs telephone reminder vs no reminder SMS and telephone call reminders 24–48 hours pre-appointment Patient attendance to scheduled follow-up appointments. Both text messaging and telephone reminders significantly reduced non-attendance rates compared to no reminder. Text messaging was found to be as effective as telephone reminders but more cost-effective. Shetty et al (2011) 39 SMS reminders reinforcing prescription adherence SMS (text messages) Adherence to medication, diet, physical activity in type 2 diabetes patients Improved medication adherence and diabetes management Tian et al (2015) 41 Multifaceted simplified management program for CVD risk Smartphone-based Electronic Decision Support System operated by Community Health Workers Lifestyle counseling (smoking cessation, salt reduction), medication prescription (antihypertensives, aspirin), monthly CHW visits Increased medication use (antihypertensive, aspirin), reduced systolic blood pressure, no significant lifestyle changes Abbreviations Theme I: Automated Remote Monitoring Systems Interventions in this category utilize electronic devices that automatically record and transmit patients’ physiological data to monitoring systems without requiring intensive manual input from the patients. Seven studies were identified within this category that employed various types of wearable technologies, body sensors, and telemonitoring tools capable of collecting patient health data either continuously or at regular intervals. 27–29 31 33 34 Several studies use a variety of devices to support the monitoring system. Amir et al (2017) used a wearable vest to automatically measure lung fluid, which helped reduce the number of heart failure readmissions. 27 28 28 29 29 Cho et al used a mobile phone with an integrated glucometer for automatic blood sugar monitoring, which successfully reduced HbA1c with high compliance rates. 30 31 Similarly, Kim et al, who used a wearable activity tracker that monitored weight, steps, sleep, and blood pressure. 33 33 Lastly, Kotooka et al used a wireless device that sent daily data. 34 Theme II: Patient and Healthcare-Reported Monitoring Systems Interventions in this category rely on patients and providers actively entering health data through digital media, such as mobile apps, SMS, or web platforms. 32 36–38 40 42 Patients use various digital methods to report their health in the monitoring system. Kim et al used SMS and internet-based interventions to monitor blood glucose levels and medication compliance in diabetic patients. 32 36 36 Shimoyama et al reported an ICT-based telenursing program that combined telemonitoring with remote counseling using tablets. 40 40 42 42 42 Shahid et al used routine telephone calls every 15 days to discuss the results of self-monitoring of blood glucose levels, medication compliance, diet, and physical activity of diabetes patients. 38 38 38 In contrast to Porath et al’s research, they introduced a multidisciplinary telecare approach integrating telephone and electronic medical records (EMR) by Maccabi Telecare Center (MTC). 37 37 Theme III: Personalized Remote Monitoring via Telecommunication This intervention combines direct communication with active monitoring between patients and health workers through telecommunication media such as telephone, video calls, voice messages, and short messages. 35 39 41 A primary focus is using personalized telecommunications technology to support patient adherence to treatment and improve attendance at healthcare services. One common approach is sending reminders via SMS or phone calls to ensure patients attend follow-up appointments and comply with their medication prescriptions. Liew et al showed that reminders via SMS and telephone calls sent 24–48 hours before the scheduled visit significantly reduced the rate of patient no-shows compared to no reminders. 35 39 In the context of CVD, Tian et al developed a multifaceted risk management program involving an electronic decision support system operated by community health workers via smartphones. 41 41 Monitoring Component and Outcomes of Remote Monitoring The monitoring components vary but can generally be classified into three main themes (see Figure 4 Figure 4 Delivery Method, Monitoring Component, and Outcomes. Measurement of specific biomarkers, such as B-type natriuretic peptide, along with reminder systems for medication and lifestyle changes, serve as essential pillars in facilitating the management of chronic conditions. Significant outcomes include reduced hospitalization rates, improved clinical parameters such as HbA1c, decreased mortality, and enhanced physical activity and quality of life. However, it is essential to note that specific outcomes, such as subjective quality of life and readmission risk, showed no significant change in several studies, indicating the need for a more integrative and personalized approach. The second theme, Patient and Healthcare-Reported Monitoring Systems relies on direct reporting by patients and healthcare professionals through digital platforms such as mobile applications, SMS, and online forms. The device emphasizes monitoring symptoms, vital signs, and daily activities reported by patients, as well as relevant biomarker data such as HbA1c levels and postprandial plasma glucose. The integration of reminders and nutritional feedback facilitates increased patient engagement in self-management. Significant outcomes reflect improvements in glucose control, reduced hospitalization days, and enhanced quality of life. The third theme, Personalized Remote Monitoring via Telecommunication, utilizes communication media such as telephone calls, video calls, and voice messages to support more personal and direct patient engagement. Monitoring focuses on attendance at routine visits, medication adherence, and lifestyle modifications, including diet, physical activity, and smoking cessation. Through this approach, significant outcomes reported include reduced absenteeism and improved medication adherence, including better diabetes management and lower systolic blood pressure. Lifestyle changes remain a less significant outcome, indicating ongoing challenges in achieving long-term behavioral modification through telecommunication-based interventions. Discussion This review aims to explore the delivery method of remote monitoring systems among patients with chronic diseases, focusing on studies in Asia. Chronic patient monitoring systems are increasingly developing along with information and communication technology advances, especially with the increasing need for effective and efficient chronic disease management. In this review, monitoring systems are grouped into three primary delivery methods: automated remote monitoring systems, patient-reported monitoring systems, and personalized remote monitoring via telecommunication. These three methods demonstrate different approaches to collecting and responding to data. First, automated remote monitoring systems rely on electronic devices that automatically record patient physiological data such as blood pressure, heart rate, oxygen saturation, and specific biomarkers without requiring intensive manual input from the patient. 27–29 31 33 34 27 28 30 29 33 Second, patient-reported monitoring systems rely on the active participation of patients in reporting their health data via mobile applications, SMS, or other digital platforms. 32 36–38 40 42 32 32 36 Although the patient-reported monitoring system relies on patient reporting, the device was is able to reduce emergency visits and improve quality of life, proving that active patient involvement significantly impacts chronic disease management. 36 37 40 37 Another category of monitoring system is personalized remote monitoring via telecommunication. This method uses direct communication media such as telephone, video call, and SMS to increase patient engagement and clinical support. 35 39 41 35 39 41 In terms of monitoring components, automated systems provide objective and continuous biometric and physiological data, including blood pressure, heart rate, oxygen saturation, and biomarkers such as BNP, which are essential for early detection of disease exacerbations. 27 34 32 37 38 40 This expands the monitoring dimensions to focus not only on physiological parameters but also on the patient’s functional condition and quality of life. As developed in previous studies, interactive applications provide added value in improving self-management and patient education in real time. 32 37 40 35 39 41 35 39 These three methods do not consistently yield positive effects on the measured outcomes. Several studies present contrasting results. 28 29 31 33 34 40 28 31 40 33 28 40 These three methods synergistically provide varying but complementary clinical results. Automated monitoring systems effectively reduce hospitalization rates, improve clinical parameters such as HbA1c and blood pressure, and reduce mortality in heart failure, DM and COPD. 27 28 31 32 36 37 40 35 39 Implication for Practice The Asian context, which is this study’s primary focus, has challenges related to technology access, health infrastructure, and the culture of digital technology use. Tian et al’s study in rural China and India confirmed that the success of cardiovascular risk management programs is highly dependent on the active role of community health workers and the adaptation of technology to local conditions. 41 43–46 Strengths and Limitations of Study This review followed the rigorous PRISMA guidelines and employed robust methodological quality assessments using tools from the Joanna Briggs Institute and Cochrane Risk of Bias instruments. Including diverse study designs such as randomized controlled trials, quasi-experimental, and observational studies from multiple Asian countries allowed for a comprehensive and regionally relevant synthesis of evidence on remote monitoring. The thematic analysis approach enabled a rich exploration of different delivery models and monitoring components, thus providing valuable insights into how these interventions function in practice. However, the review is limited by excluding non-English language publications, which may have introduced language bias and omitted potentially relevant regional studies. Additionally, most studies had relatively short follow-up periods, limiting the ability to assess the durability of intervention effects, particularly with respect to lifestyle changes and patient-centered outcomes. The heterogeneity of intervention types and outcome measures also hindered the possibility of a meta-analysis, reducing the precision with which effect sizes could be estimated. Furthermore, some included studies demonstrated risks of bias related to confounding factors and lack of blinding, which must be considered when interpreting the results. Conclusion Internet-based remote patient monitoring represents a promising approach for chronic disease management in Asia, with demonstrated benefits including fewer hospital readmissions and improved clinical indicators like blood sugar and blood pressure control and enhanced patient adherence to treatment protocols. The review revealed that automated monitoring systems provide continuous and objective physiological data, facilitating timely clinical interventions, while patient-reported systems and personalized telecommunication approaches improve patient engagement and self-management. However, the impact on long-term lifestyle modification and quality of life remains variable, underscoring the need for more integrative and patient-centered intervention models. The integration of remote patient monitoring systems offers a valuable solution for chronic disease management, particularly in resource-limited settings. These technologies enable healthcare providers to deliver more frequent and timely interventions, optimizing healthcare resources. Additionally, the system empower patients to monitor and manage their health, enhancing engagement in their care. For successful implementation, systems must be accessible, user-friendly, and culturally adapted. Personalized support and education are essential to maximize patient benefits. Future research should focus on scaling these technologies across Asia, addressing barriers like digital literacy and access, and integrating them into existing healthcare infrastructures. The goal is to create a sustainable model that improves patient outcomes, reduces healthcare costs, and supports long-term health across the region. Acknowledgments All authors thank Universitas Padjadjaran, Bandung, West Java, Indonesia, for facilitating the database and funding this study. Disclosure The authors had no conflicts of interest in this research. References 1. Koehlmoos TP Anwar S Cravioto A Global health: chronic diseases and other emergent issues in global health Infect Dis Clin North Am 2011 25 3 623 38,ix 10.1016/j.idc.2011.05.008 21896363 PMC7135337 2. Sharma J Chronic disease management in the South-East Asia Region: a need to do more WHO South-East Asia J Public Heal 2013 2 2 79 10.4103/2224-3151.122935 28612763 3. World Health Organization (WHO) Noncommunicable diseases in the South-East Asia [Internet] 2025 cited May 20, 2025 Available from https://www.who.int/southeastasia/health-topics/noncommunicable-diseases Accessed September 16 4. Momtazmanesh S Moghaddam SS Ghamari SH Global burden of chronic respiratory diseases and risk factors, 1990–2019: an update from the global burden of disease study 2019 eClinicalMedicine 2023 59 10.1016/j.eclinm.2023.101936 PMC7614570 37229504 5. Vaduganathan M Mensah GA Turco JV Fuster V Roth GA The global burden of cardiovascular diseases and risk: a compass for future health J Am Coll Cardiol 2022 80 25 2361 2371 10.1016/j.jacc.2022.11.005 36368511 6. Peyroteo M Ferreira IA Elvas LB Ferreira JC Lapão LV Remote monitoring systems for patients with chronic diseases in primary health care: systematic review JMIR mHealth uHealth 2021 9 12 e28285 10.2196/28285 34932000 PMC8734917 7. Salisbury C Thomas C O’Cathain A TElehealth in CHronic disease: mixed-methods study to develop the TECH conceptual model for intervention design and evaluation BMJ Open 2015 5 2 e006448 10.1136/bmjopen-2014-006448 PMC4322202 25659890 8. Fu MR Real-time detection and management of chronic illnesses mHealth 2021 Vol. 7 1 China 10.21037/mHealth-2020-2 PMC7882261 33634184 9. Otoom M Otoum N Alzubaidi MA Etoom Y Banihani R An IoT-based framework for early identification and monitoring of COVID-19 cases Biomed Signal Process Control 2020 62 102149 10.1016/j.bspc.2020.102149 32834831 PMC7428786 10. Milinovich GJ Williams GM Clements ACA Hu W Internet-based surveillance systems for monitoring emerging infectious diseases Lancet Infect Dis 2014 14 2 160 168 10.1016/S1473-3099(13)70244-5 24290841 PMC7185571 11. Marques A Bosch P De Thurah A Effectiveness of remote care interventions: a systematic review informing the 2022 EULAR points to consider for remote care in rheumatic and musculoskeletal diseases RMD Open 2022 8 1 e002290 10.1136/rmdopen-2022-002290 35523520 PMC9083395 12. Virginia Anikwe C Friday Nweke H Chukwu Ikegwu A Mobile and wearable sensors for data-driven health monitoring system: state-of-the-art and future prospect Expert Syst Appl 2022 202 117362 10.1016/j.eswa.2022.117362 13. Bashi N Karunanithi M Fatehi F Ding H Walters D Remote monitoring of patients with heart failure: an overview of systematic reviews J Med Internet Res 2017 19 1 e18 10.2196/jmir.6571 28108430 PMC5291866 14. Herlina H Masfuri M Herawati T Efektivitas telemonitoring dalam mencegah eksaserbasi pada pasien penyakit paru obstruktif kronis PREPOTIF J Kesehat Masy 2023 7 April 935 943 15. Walker R Tong A Howard K Palmer S Patient expectations and experiences of remote monitoring for chronic diseases: systematic review and thematic synthesis of qualitative studies Int J Med Inform 2019 124 78 85 10.1016/j.ijmedinf.2019.01.013 30784430 16. Taylor M Thomas E Snoswell C Smith A Caffery L Does remote patient monitoring reduce acute care use? A systematic review BMJ Open 2021 11 3 e040232 10.1136/bmjopen-2020-040232 PMC7929874 33653740 17. Serrano LP Maita KC Avila FR Benefits and challenges of remote patient monitoring as perceived by health care practitioners: a systematic review Perm J 2023 27 4 100 111 10.7812/TPP/23.022 37735970 PMC10730976 18. Mahmmod BM Naser MA Shanin Al-Sudani AH Patient monitoring system based on internet of things: a review and related challenges with open research issues IEEE Access 2024 January 2025 19. Canali S Schiaffonati V Aliverti A Challenges and recommendations for wearable devices in digital health: data quality, interoperability, health equity, fairness PLOS Digit Heal 2022 1 10 e0000104 10.1371/journal.pdig.0000104 PMC9931360 36812619 20. Leo DG Buckley BJR Chowdhury M Interactive remote patient monitoring devices for managing chronic health conditions: systematic review and meta-analysis J Med Internet Res 2022 24 11 1 23 10.2196/35508 PMC9673001 36326818 21. Rebolledo Del Toro M Herrera Leaño NM Barahona-Correa JE Muñoz Velandia OM Fernández Ávila DG García Peña ÁA Effectiveness of mobile telemonitoring applications in heart failure patients: systematic review of literature and meta-analysis Heart Fail Rev 2023 28 2 431 452 10.1007/s10741-022-10291-1 36652096 PMC9845822 22. Page MJ McKenzie JE Bossuyt PM The PRISMA 2020 statement: an updated guideline for reporting systematic reviews BMJ 2021 372 10.1136/bmj.n71 PMC8005924 33782057 23. Riley RD Moons KGM Snell KIE A guide to systematic review and meta-analysis of prognostic factor studies BMJ 2019 364 10.1136/bmj.k4597 30700442 24. Joanna Briggs Institute (JBI) JBI’s critical appraisal tools [Internet] Joanna Briggs Institute 2022 cited January 1, 2023 Available from https://jbi.global/critical-appraisal-tools Accessed September 16 25. Strene JAC Page JSMRGE Blencowe NS RoB 2: a revised tool for assessing risk of bias in randomised trials BMJ 2019 366 1 8 10.1136/bmj.l4898 31462531 26. Sterne JA Hernán MA McAleenan A Reeves BC Higgins JP Chapter 25: assessing risk of bias in a non-randomized study Cochrane Handbook for Systematic Reviews of Interventions Version 64 Cochrane 2023 27. Amir O Ben-Gal T Weinstein JM Evaluation of remote dielectric sensing (ReDS) technology-guided therapy for decreasing heart failure re-hospitalizations Int J Cardiol 2017 240 279 284 10.1016/j.ijcard.2017.02.120 28341372 28. Chau JPC Lee DTF DSF Y A feasibility study to investigate the acceptability and potential effectiveness of a telecare service for older people with chronic obstructive pulmonary disease Int J Med Inform 2012 81 10 674 682 10.1016/j.ijmedinf.2012.06.003 22789911 29. Chen YH Lin YH Hung CS Clinical outcome and cost-effectiveness of a synchronous telehealth service for seniors and nonseniors with cardiovascular diseases: quasi-experimental study J Med Internet Res 2013 15 4 1 11 10.2196/jmir.2091 PMC3636317 23615318 30. Cho JH Lee HC Lim DJ Kwon HS Yoon KH Mobile communication using a mobile phone with a glucometer for glucose control in type 2 patients with diabetes: as effective as an internet-based glucose monitoring system J Telemed Telecare 2009 15 2 77 82 10.1258/jtt.2008.080412 19246607 31. Leng Chow W Aung CYK Tong SC Effectiveness of telemonitoring-enhanced support over structured telephone support in reducing heart failure-related healthcare utilization in a multi-ethnic Asian setting J Telemed Telecare 2020 26 6 332 340 10.1177/1357633X18825164 30782070 32. Kim S Kim HS Effectiveness of mobile and internet intervention in patients with obese type 2 diabetes Int J Med Inform 2008 77 6 399 404 10.1016/j.ijmedinf.2007.07.006 17881285 33. Kim JW Ryu B Cho S Impact of personal health records and wearables on health outcomes and patient response: three-arm randomized controlled trial JMIR mHealth uHealth 2019 7 1 1 13 10.2196/12070 PMC6682299 30609978 34. Kotooka N Kitakaze M Nagashima K The first multicenter, randomized, controlled trial of home telemonitoring for Japanese patients with heart failure: home telemonitoring study for patients with heart failure (HOMES-HF) Heart Vessels 2018 33 8 866 876 10.1007/s00380-018-1133-5 29450689 35. Liew SM Tong SF Lee VKM Ng CJ Leong KC Teng CL Text messaging reminders to reduce non-attendance in chronic disease follow-up: a clinical trial Br J Gen Pract 2009 59 569 916 920 10.3399/bjgp09X472250 19712544 PMC2784529 36. Liu WT Huang CD Wang CH Lee KY Lin SM Kuo HP A mobile telephone-based interactive self-care system improves asthma control Eur Respir J 2011 37 2 310 317 10.1183/09031936.00000810 20562122 37. Porath A Irony A Borobick AS Maccabi proactive telecare center for chronic conditions - the care of frail elderly patients Isr J Health Policy Res 2017 6 1 1 7 10.1186/s13584-017-0192-x 29228992 PMC5724333 38. Shahid M Mahar SA Shaikh S Shaikh ZUD Mobile phone intervention to improve diabetes care in rural areas of Pakistan: a randomized controlled trial J Coll Physicians Surg Pakistan 2015 25 3 166 171 25772954 39. Shetty AS Chamukuttan S Nanditha A Raj RKC Ramachandran A Reinforcement of adherence to prescription recommendations in Asian Indian diabetes patients using short message service (SMS)-a pilot study J Assoc Physicians India 2011 59 11 711 714 22616337 40. Shimoyama M Yoshida S Takahashi C Inoue M Sato N Sato F Effectiveness of a telenursing intervention program in reducing exacerbations in patients with chronic respiratory failure receiving noninvasive positive pressure ventilation: a randomized controlled trial PLoS One 2023 18 10 October 1 17 10.1371/journal.pone.0269753 PMC10602241 37883428 41. Tian M Ajay VS Dunzhu D A cluster-randomized controlled trial of a simplified multifaceted management program for individuals at high cardiovascular risk (SimCard Trial) in Rural Tibet, China and Haryana, India Circulation 2015 132 9 815 824 10.1161/CIRCULATIONAHA.115.015373 26187183 PMC4558306 42. Tsang MW Mok M Kam G Improvement in diabetes control with a monitoring system based on a hand-held, touch-screen electronic diary J Telemed Telecare 2001 7 1 47 50 10.1258/1357633011936138 11265938 43. Eriyani T Sugiharto F Hidayat MN Shalahuddin I Maulana I Rizkiyani F Self-care-based interventions in hypertensive patients: a scoping review J Keperawatan BSI 2022 10 1 41 52 44. Nuraeni A Mirwanti R Sugiharto F Efficacy of Non-invasive hemodynamic monitoring in heart failure patients: literature review J Keperawatan Muhammadiyah 2022 7 3 2022 45. Sugiharto F Haroen H Alya FP Health educational methods for improving self-efficacy among patients with coronary heart disease: a scoping review J Multidiscip Healthc 2024 17 779 792 10.2147/JMDH.S455431 38410523 PMC10896095 46. Sugiharto F Nuraeni A Trisyani Y Putri AM Armansyah NA Nursing interventions for improving quality of life among patients with coronary heart disease after percutaneous coronary intervention: a scoping review J Keperawatan Padjadjaran 2024 12 1 56 67 ",
  "metadata": {
    "Title of this paper": "Nursing interventions for improving quality of life among patients with coronary heart disease after percutaneous coronary intervention: a scoping review",
    "Journal it was published in:": "Patient preference and adherence",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477276/"
  }
}