{
  "title": "Paper_1135",
  "abstract": "pmc Toxics Toxics 3287 toxics toxics Toxics 2305-6304 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473884 PMC12473884.1 12473884 12473884 41012340 10.3390/toxics13090719 toxics-13-00719 1 Article Inhibitory Effects of Aquadag, a Black Carbon Surrogate, on Microbial Growth via Surface-Mediated Stress: Evidence from Adenosine Triphosphate Assay https://orcid.org/0009-0006-2195-6740 Yoo Hwangyu 1 † ‡ Lim Saehee Conceptualization Writing – original draft Supervision Funding acquisition 1 2 * ‡ https://orcid.org/0009-0000-3179-7401 Cho I Seul 2 https://orcid.org/0009-0002-1330-4428 Im Haneul Writing – original draft 2 Lee Euna Writing – original draft 2 https://orcid.org/0000-0003-4125-8756 Choi Siyoung Writing – original draft 2 Kim Han-Suk Methodology Writing – review & editing 3 4 Jeong Sohee Methodology Investigation 2 https://orcid.org/0000-0002-0028-2090 Choi Younggyun Methodology Resources Writing – review & editing 1 2 Wang Ting Academic Editor Ku Tingting Academic Editor Xu Jia Academic Editor 1 hwankuy97@gmail.com youngchoi@cnu.ac.kr 2 iseuljo22@gmail.com dlagksmf3020@gmail.com pringles6946@gmail.com swing0128@gmail.com sosohee9@naver.com 3 hskim77@dm-ent.co.kr 4 * saehee.lim@cnu.ac.kr † Current Address: Industry Coordination Department, Korea Meteorological Institute, Seoul 03735, Republic of Korea. ‡ These authors contributed equally to this work. 27 8 2025 9 2025 13 9 497672 719 14 7 2025 20 8 2025 25 8 2025 27 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Black carbon (BC) from incomplete combustion sources including traffic emissions affects human health due to its physical characteristics and ubiquity in urban environments. We examined the effects of BC on microbial growth in the presence of particulate matter (PM), using Aquadag as a surrogate for BC. Brunauer–Emmett–Teller analysis showed BC had a specific surface area of 123.2 m 2 −1 −1 −1 −1 −1 particulate matter black carbon microbial growth adenosine triphosphate (ATP) human health National Research Foundation of Korea (NRF) funded by the Ministry of Science and ICT RS-2021-NR061996 RS-2023-00218203 2023 research fund of Chungnam National University 2023-0560-01 PRIDE research institute funding program at Chungnam National University Korea Ministry of Environment (Korea MOE) through the Waste-to-Energy Recycling Human Resource Development Project This study was supported by the National Research Foundation of Korea (NRF) funded by the Ministry of Science and ICT (RS-2021-NR061996 and RS-2023-00218203, as well as under project BK21 FOUR), the 2023 research fund of Chungnam National University (grant no. 2023-0560-01), the PRIDE research institute funding program at Chungnam National University and Korea Ministry of Environment (Korea MOE) through the Waste-to-Energy Recycling Human Resource Development Project. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Atmospheric particulate matter (PM) significantly impacts air quality, climate systems, and public health. Of particular concern is fine particulate matter (PM 2.5 2.5 1 2 3 4 5 6 7 8 9 10 11 2.5 Black carbon (BC) is a carbonaceous component of PM 2.5 12 13 14 15 16 17 18 19 20 2.5 21 22 In recent years, a limited number of experiments have reported that exposure of pathogens to BC induces structural, compositional, and functional changes in biofilms, most notably biofilm resistance to multiple antibiotics and proteolysis [ 23 24 25 26 Adenosine triphosphate (ATP) is a crucial molecule for cellular energy transport and processes. ATP bioluminescence has become a reliable method for detecting bioaerosols, unaffected by non-bioaerosols [ 27 28 29 30 31 32 33 34 31 This study aims to evaluate the effects of BC on microbial growth by monitoring Pseudomonas aeruginosa PA14 under prolonged exposure to PM and BC. While previous studies have primarily relied on indirect microbial indicators such as biofilm morphology, mitochondrial membrane potential, and reactive oxygen species (ROS) generation, we directly quantified bacterial metabolic activity using ATP bioluminescence as a proxy for microbial activity, enabling time-resolved assessment of cellular energy capacity. Generating a 7-day quantitative profile of ATP production across multiple BC exposure levels and using it to assess metabolic activity provides unprecedented, time-resolved experimental evidence of the impact of BC on PA14, offering new insights into pollutant–pathogen interactions at the metabolic level. 2. Materials and Methods 2.1. Materials 2.1.1. Particulate Matter The PM used in this study was a certified standard material (KRISS CRM 109-02-004) provided by the Korea Research Institute of Standards and Science (KRISS), containing known fractions of elements and PAHs resembling urban PM ( Table 1 Table 1 Table 2 2.1.2. Aquadag—BC Reference Material Aquadag (Acheson Inc., Port Huron, MI, USA), a colloidal dispersion of irregular graphite flakes suspended in approximately 80% water [ 36 37 38 39 40 −1 The morphology of ambient BC is typically small spherical aggregates with a size range between 20 and 50 nm, which is expected to facilitate effective surface reactions. The small size and significant porosity of BC particles may play an important role in surface interactions with microorganisms. The porosity and size distribution of Aquadag were analyzed using the Brunauer–Emmett–Teller (BET) method and a single-particle soot photometer (SP2; Droplet Measurement Technologies, Longmont, CO 80503, USA) coupled with an atomizer, respectively. BET measurements are an experimental method for determining the surface area of porous materials, in which a specific gas is adsorbed onto a sample at a constant temperature, and the amount of adsorbed gas is measured for calculating the surface area of the sample. The SP2 uses laser-induced incandescence to measure the mass of individual BC particles with diameters ranging between approximately 80 and 550 nm [ 41 2.1.3. Bacterial Strains and Culture Pseudomonas aeruginosa PA14 is a facultative anaerobic pathogenic bacterium with a broad host range, including humans, and is widely used as a model organism to study antibiotic resistance mechanisms and associated biological changes during infection [ 42 43 44 45 46 P. aeruginosa −1 −1 −1 −1 4 2 47 w v 48 2.2. Experiments 2.2.1. Cultivation Setup To better simulate atmospheric exposure in urban environments, experimental groups were prepared in which PA14 cultures were combined with PM and varying concentrations of Aquadag. PA14 was cultured in 10 glass vials per set, each containing PA14 mixed with a solution of urban PM and Aquadag. Since PM and Aquadag often coexist in urban air as complex mixtures, this study maintained a fixed concentration of PM across all experimental conditions to simulate realistic exposure scenarios, with only the Aquadag levels being varied. The Aquadag stock solution (25,000 ng mL −1 −1 −1 Table 3 49 50 2.2.2. Measurement of ATP Levels Based on the bioluminescence reaction in which the enzyme luciferase catalyzes a reaction using ATP and the substrate luciferin to produce light, the intensity of the emitted light is directly proportional to the concentration of ATP, allowing a quantitative determination of ATP in the sample [ 51 52 53 49 54 (1) c A T P = t A T P − d A T P (2) B S I % = d A T P t A T P × 100  After measuring ATP, the biomass stress index (BSI) was calculated (Equation (2)), which has been employed as an indicator of microbial stress levels in recent research [ 55 Figure 1 3. Results and Discussion 3.1. Surface and Size Characteristics of the Black Carbon Reference Material The BET analysis showed that the specific surface area of Aquadag was 123.2 m 2 −1 2 −1 56 2 −1 57 58 59 Figure 2 −3 60 Aquadag’s surface area is higher compared to other materials, likely due to nanoparticle agglomeration ( Figure 2 61 3.2. Microbial Growth Under the Presence of PM and BC To assess the concentration-dependent effects of BC on microbial activity, ATP levels were measured at three time points (days 1, 5, and 7) during the 7-day incubation period. Their average was used to represent the cumulative physiological response, reducing temporal variability and enabling comparison across BC levels. Figure 3 −1 −1 2 Figure 3 2 Figure 3 −1 −1 2 Figure 3 62 P. aeruginosa 26 63 Table S1 −1 −1 −1 −1 −1 −1 −1 −1 In Figure 3 −1 −1 −1 −1 −1 −1 −1 Figure 4 −1 2 −1 2 Although linear regression ( Figure 3 2 Figure 5 p −1 −1 −1 −1 −1 −1 −1 −1 p This interpretation is further supported by previous findings that carbon-based nanomaterials (CBNs), including graphene nanoparticles and multi-walled carbon nanotubes, induced cytotoxic effects, with toxicity increasing over prolonged exposure durations [ 64 65 66 67 68 3.3. Stress Index of Bacterial Growth over Time (BSI) Environmental stressors such as pH, oxygen concentration, and beneficial or harmful material load are generally considered in the culture conditions [ 69 70 71 In this experiment, we analyzed the relationship between BC concentration and microbial stress in microbial cultures. Table S1 Figure 6 −1 2 Figure 6 Table S1 A more detailed examination by day further revealed that BSI values on day 1 showed relatively low variability across BC concentrations (slope = +0.064 ± 0.047, R 2 Figure 6 −1 2 −1 Figure 7 −1 −1 Figure 5 p −8 These results suggest that surface interactions between BC and microorganisms lead to a significant negative effect on energy production and maintenance in microbial cells. Ultimately, these results demonstrate that exposure duration, not merely concentration, plays a critical role in the toxicity of BC. 4. Conclusions The effects of BC exposure on microbial growth were examined using a reference material exhibiting similar physical characteristics to urban ambient BC particles. As BC concentration increased from 0 to 100 ng mL −1 However, Aquadag, used as a BC surrogate in this study, may not fully represent the chemical complexity of BC in ambient environments. In real atmospheric conditions, BC particles are often mixed with various substances generated during combustion processes, such as polycyclic aromatic hydrocarbons (PAHs), heavy metals, and oxidized organics that may further increase the toxicity of the BC-containing particles. In addition, microorganisms used in this study were PA14, a harmful bacterial strain, which may not adequately reflect the responses of non-pathogenic or environmentally relevant microorganisms. To extend the findings in this study to the context of human health, future research should integrate non-pathogenic or beneficial microorganisms and use BC material derived from real-world environmental or combustion emission sources. The incorporation of these elements would allow a more realistic assessment of BC’s impacts and could provide a stronger scientific basis for policy recommendations on BC emission reduction to protect both environmental integrity and public health. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/toxics13090719/s1 −1 Author Contributions H.Y.: investigation, visualization, writing—original draft; S.L.: conceptualization, funding acquisition, supervision, writing—original draft; I.S.C.: writing—original draft, visualization; H.I.: writing—original draft; E.L.: writing—review and editing, visualization; S.C.: writing—review and editing; H.-S.K.: methodology, writing—review and editing; S.J.: investigation, methodology; Y.C.: methodology, resources, writing—review and editing. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Data will be made available on request. Conflicts of Interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1. Bi J. D’Souza R.R. Moss S. Senthilkumar N. Russell A.G. Scovronick N.C. Chang H.H. Ebelt S. Acute Effects of Ambient Air Pollution on Asthma Emergency Department Visits in Ten U.S. States Environ. Health Perspect. 2023 131 47003 10.1289/EHP11661 37011135 PMC10069759 2. Feng S. Gao D. Liao F. Zhou F. Wang X. The health effects of ambient PM 2.5 Ecotoxicol. Environ. Saf. 2016 128 67 74 10.1016/j.ecoenv.2016.01.030 26896893 3. Hayes R.B. Lim C. Zhang Y. Cromar K. Shao Y. Reynolds H.R. Silverman D.T. Jones R.R. Park Y. Jerrett M. PM 2.5 Int. J. Epidemiol. 2020 49 25 35 10.1093/ije/dyz114 31289812 PMC7124502 4. Krittanawong C. Qadeer Y.K. Hayes R.B. Wang Z. Virani S. Thurston G.D. Lavie C.J. PM 2.5 Curr. Probl. Cardiol. 2023 48 101670 10.1016/j.cpcardiol.2023.101670 36828043 5. Fu P. Guo X. Cheung F.M.H. Yung K.K.L. The association between PM 2.5 Sci. Total Environ. 2019 655 1240 1248 10.1016/j.scitotenv.2018.11.218 30577116 6. Shi L. Wu X. Danesh Yazdi M. Braun D. Abu Awad Y. Wei Y. Liu P. Di Q. Wang Y. Schwartz J. Long-term effects of PM 2.5 Lancet Planet. Health 2020 4 e557 e565 10.1016/S2542-5196(20)30227-8 33091388 PMC7720425 7. Ethan C.J. Mokoena K.K. Yu Y. Shale K. Fan Y. Rong J. Liu F. Association between PM 2.5 Environ. Sci. Pollut. Res. Int. 2020 27 22353 22363 10.1007/s11356-020-08628-0 32314282 8. Huang F. Pan B. Wu J. Chen E. Chen L. Relationship between exposure to PM 2.5 Oncotarget 2017 8 43322 43331 10.18632/oncotarget.17313 28487493 PMC5522148 9. Pritchett N. Spangler E.C. Gray G.M. Livinski A.A. Sampson J.N. Dawsey S.M. Jones R.R. Exposure to Outdoor Particulate Matter Air Pollution and Risk of Gastrointestinal Cancers in Adults: A Systematic Review and Meta-Analysis of Epidemiologic Evidence Environ. Health Perspect. 2022 130 36001 10.1289/EHP9620 35234536 PMC8890324 10. Wang Y. Li M. Wan X. Sun Y. Cheng K. Zhao X. Zheng Y. Yang G. Wang L. Spatiotemporal analysis of PM 2.5 Environ. Res. 2018 164 132 139 10.1016/j.envres.2018.02.026 29486344 11. Zhang J.-S. Gui Z.-H. Zou Z.-Y. Yang B.-Y. Ma J. Jing J. Wang H.-J. Luo J.-Y. Zhang X. Luo C.-Y. Long-term exposure to ambient air pollution and metabolic syndrome in children and adolescents: A national cross-sectional study in China Environ. Int. 2021 148 106383 10.1016/j.envint.2021.106383 33465664 12. Brines M. Dall’Osto M. Beddows D.C.S. Harrison R.M. Gómez-Moreno F. Núñez L. Artíñano B. Costabile F. Gobbi G.P. Salimi F. Traffic and nucleation events as main sources of ultrafine particles in high-insolation developed world cities Atmos. Chem. Phys. 2015 15 5929 5945 10.5194/acp-15-5929-2015 13. Bond T.C. Doherty S.J. Fahey D.W. Forster P.M. Berntsen T. DeAngelo B.J. Flanner M.G. Ghan S. Kärcher B. Koch D. Bounding the role of black carbon in the climate system: A scientific assessment J. Geophys. Res. Atmos. 2013 118 5380 5552 10.1002/jgrd.50171 14. Johnson B.T. Haywood J.M. Hawcroft M.K. Are Changes in Atmospheric Circulation Important for Black Carbon Aerosol Impacts on Clouds, Precipitation, and Radiation? J. Geophys. Res. Atmos. 2019 124 7930 7950 10.1029/2019JD030568 15. Song X. Hu Y. Ma Y. Jiang L. Wang X. Shi A. Zhao J. Liu Y. Liu Y. Tang J. Is short-term and long-term exposure to black carbon associated with cardiovascular and respiratory diseases? A systematic review and meta-analysis based on evidence reliability BMJ Open 2022 12 e049516 10.1136/bmjopen-2021-049516 PMC9066484 35504636 16. Zanobetti A. Coull B.A. Gryparis A. Kloog I. Sparrow D. Vokonas P.S. Wright R.O. Gold D.R. Schwartz J. Associations between arrhythmia episodes and temporally and spatially resolved black carbon and particulate matter in elderly patients Occup. Environ. Med. 2014 71 201 207 10.1136/oemed-2013-101526 24142987 PMC4371778 17. Hua J. Yin Y. Peng L. Du L. Geng F. Zhu L. Acute effects of black carbon and PM 2.5 Sci. Total Environ. 2014 481 433 438 10.1016/j.scitotenv.2014.02.070 24631605 18. Lin W. Huang W. Zhu T. Hu M. Brunekreef B. Zhang Y. Liu X. Cheng H. Gehring U. Li C. Acute Respiratory Inflammation in Children and Black Carbon in Ambient Air before and during the 2008 Beijing Olympics Environ. Health Perspect. 2011 119 1507 1512 10.1289/ehp.1103461 21642045 PMC3230448 19. Vanbrabant K. Van Dam D. Bongaerts E. Vermeiren Y. Bové H. Hellings N. Ameloot M. Plusquin M. De Deyn P.P. Nawrot T.S. Accumulation of Ambient Black Carbon Particles Within Key Memory-Related Brain Regions JAMA Netw. Open 2024 7 e245678 10.1001/jamanetworkopen.2024.5678 38592718 PMC11004827 20. Bongaerts E. Lecante L.L. Bové H. Roeffaers M.B.J. Ameloot M. Fowler P.A. Nawrot T.S. Maternal exposure to ambient black carbon particles and their presence in maternal and fetal circulation and organs: An analysis of two independent population-based observational studies Lancet Planet. Health 2022 6 e804 e811 10.1016/S2542-5196(22)00200-5 36208643 PMC9553674 21. Cai H. Zhang Y. Wei J. Lawrence W.R. Chen S. Cheng H. Tang H. Chen D. Wang Y. Gu J. Potential causal associations of long-term exposure to PM 2.5 Ecotoxicol. Environ. Saf. 2025 291 117897 10.1016/j.ecoenv.2025.117897 39954626 PMC11871989 22. Wang W. Yang C. Wang F. Wang J. Zhang F. Li P. Zhang L. Does Nonsteroidal Anti-inflammatory Drug Use Modify All-Cause and Cause-Specific Mortality Associated with PM 2.5 Environ. Health 2024 3 14 25 10.1021/envhealth.4c00133 PMC11744395 39839242 23. Hussey S.J.K. Purves J. Allcock N. Fernandes V.E. Monks P.S. Ketley J.M. Andrew P.W. Morrissey J.A. Air pollution alters Staphylococcus aureus and Streptococcus pneumoniae biofilms, antibiotic tolerance and colonisation Environ. Microbiol. 2017 19 1868 1880 10.1111/1462-2920.13686 28195384 PMC6849702 24. Chu S. Li X. Sun N. He F. Cui Z. Li Y. Liu R. The combination of ultrafine carbon black and lead provokes cytotoxicity and apoptosis in mice lung fibroblasts through oxidative stress-activated mitochondrial pathways Sci. Total Environ. 2021 799 149420 10.1016/j.scitotenv.2021.149420 34371411 25. Shang Y. Xue W. Kong J. Chen Y. Qiu X. An X. Li Y. Wang H. An J. Ultrafine black carbon caused mitochondrial oxidative stress, mitochondrial dysfunction and mitophagy in SH-SY5Y cells Sci. Total Environ. 2022 813 151899 10.1016/j.scitotenv.2021.151899 34838543 26. Salinas M.E. Gutiérrez D.A. Varela-Ramírez A. Garza K.M. Continuous Exposure to Low Doses of Ultrafine Black Carbon Reduces the Vitality of Immortalized Lung-Derived Cells and Activates Senescence J. Toxicol. 2020 2020 5702024 10.1155/2020/5702024 33488704 PMC7787833 27. Zhang Y. Liu B. Tong Z. Adenosine triphosphate (ATP) bioluminescence-based strategies for monitoring atmospheric bioaerosols J. Air Waste Manag. Assoc. 2022 72 1327 1340 10.1080/10962247.2022.2101566 36226866 28. Cho Y.S. Kim H.R. Ko H.S. Jeong S.B. Chan Kim B. Jung J.H. Continuous Surveillance of Bioaerosols On-Site Using an Automated Bioaerosol-Monitoring System ACS Sens. 2020 5 395 403 10.1021/acssensors.9b02001 31913022 29. Oh J. Choi J. Massoudifarid M. Park J.Y. Hwang J. Lim J. Byeon J.H. Size-classified monitoring of ATP bioluminescence for rapid assessment of biological distribution in airborne particulates Biosens. Bioelectron. 2023 234 115356 10.1016/j.bios.2023.115356 37172362 30. Liu Q. Yan S. Zhang M. Wang C. Xing D. Air sampling and ATP bioluminescence for quantitative detection of airborne microbes Talanta 2024 274 126025 10.1016/j.talanta.2024.126025 38574539 31. Secka F. Allward N.E. Stoddart A.K. Gagnon G.A. An automated and high-throughput method for adenosine triphosphate quantification AWWA Water Sci. 2020 2 e1202 10.1002/aws2.1202 32. Kooij D.v.d. Bakker G.L. Italiaander R. Veenendaal H.R. Wullings B.A. Biofilm Composition and Threshold Concentration for Growth of Legionella pneumophila on Surfaces Exposed to Flowing Warm Tap Water without Disinfectant Appl. Environ. Microbiol. 2017 83 e02737 02716 10.1128/aem.02737-16 28062459 PMC5311405 33. Hammes F. Goldschmidt F. Vital M. Wang Y. Egli T. Measurement and interpretation of microbial adenosine tri-phosphate (ATP) in aquatic environments Water Res. 2010 44 3915 3923 10.1016/j.watres.2010.04.015 20605621 34. Nescerecka A. Rubulis J. Vital M. Juhna T. Hammes F. Biological Instability in a Chlorinated Drinking Water Distribution Network PLoS ONE 2014 9 e96354 10.1371/journal.pone.0096354 24796923 PMC4010465 35. Ahn Y. Yim Y.-H. Yoo H.M. Particulate Matter Induces Oxidative Stress and Ferroptosis in Human Lung Epithelial Cells Toxics 2024 12 161 10.3390/toxics12020161 38393256 PMC10893167 36. Gysel M. Laborde M. Olfert J.S. Subramanian R. Gröhn A.J. Effective density of Aquadag and fullerene soot black carbon reference materials used for SP2 calibration Atmos. Meas. Technol. 2011 4 2851 2858 10.5194/amt-4-2851-2011 37. Laborde M. Schnaiter M. Linke C. Saathoff H. Naumann K.H. Möhler O. Berlenz S. Wagner U. Taylor J.W. Liu D. Single Particle Soot Photometer intercomparison at the AIDA chamber Atmos. Meas. Technol. 2012 5 3077 3097 10.5194/amt-5-3077-2012 38. Hu S. Zeng L. Zhao G. Chen S. Zhao C. Zhao W. Hu M. Significant changes in the physicochemical properties of BC-containing particles during the cold season in Beijing J. Environ. Sci. 2025 151 667 676 10.1016/j.jes.2024.04.035 39481971 39. Hu D. Alfarra M.R. Szpek K. Langridge J.M. Cotterell M.I. Belcher C. Rule I. Liu Z. Yu C. Shao Y. Physical and chemical properties of black carbon and organic matter from different combustion and photochemical sources using aerodynamic aerosol classification Atmos. Chem. Phys. 2021 21 16161 16182 10.5194/acp-21-16161-2021 40. Kompalli S.K. Suresh Babu S.N. Satheesh S.K. Krishna Moorthy K. Das T. Boopathy R. Liu D. Darbyshire E. Allan J.D. Brooks J. Seasonal contrast in size distributions and mixing state of black carbon and its association with PM1.0 chemical composition from the eastern coast of India Atmos. Chem. Phys. 2020 20 3965 3985 10.5194/acp-20-3965-2020 41. Moteki N. Kondo Y. Dependence of Laser-Induced Incandescence on Physical Properties of Black Carbon Aerosols: Measurements and Theoretical Interpretation Aerosol Sci. Technol. 2010 44 663 675 10.1080/02786826.2010.484450 42. Grace A. Sahu R. Owen D.R. Dennis V.A. Pseudomonas aeruginosa reference strains PAO1 and PA14: A genomic, phenotypic, and therapeutic review Front. Microbiol. 2022 13 1023523 10.3389/fmicb.2022.1023523 36312971 PMC9607943 43. Mikkelsen H. McMullan R. Filloux A. The Pseudomonas aeruginosa Reference Strain PA14 Displays Increased Virulence Due to a Mutation in ladS PLoS ONE 2011 6 e29113 10.1371/journal.pone.0029113 22216178 PMC3245244 44. Cheng Y. Yam J.K.H. Cai Z. Ding Y. Zhang L.-H. Deng Y. Yang L. Population dynamics and transcriptomic responses of Pseudomonas aeruginosa in a complex laboratory microbial community npj Biofilms Microbiomes 2019 5 1 10.1038/s41522-018-0076-z 30675369 PMC6334633 45. Kim H.-S. Lee S.-H. Byun Y. Park H.-D. 6-Gingerol reduces Pseudomonas aeruginosa biofilm formation and virulence via quorum sensing inhibition Sci. Rep. 2015 5 8656 10.1038/srep08656 25728862 PMC4345325 46. Viducic D. Murakami K. Amoh T. Ono T. Miyake Y. RpoN Promotes Pseudomonas aeruginosa Survival in the Presence of Tobramycin Front. Microbiol. 2017 8 839 10.3389/fmicb.2017.00839 28553272 PMC5427110 47. Heydorn A. Nielsen A.T. Hentzer M. Sternberg C. Givskov M. Ersbøll B.K. Molin S. Quantification of biofilm structures by the novel computer program comstat Microbiology 2000 146 2395 2407 10.1099/00221287-146-10-2395 11021916 48. Green M.R. Sambrook J. Molecular Cloning: A Laboratory Manual 4th ed. Ingram International Inc. Irvine, CA, USA 2012 448 49. Bisht K. Moore J.L. Caprioli R.M. Skaar E.P. Wakeman C.A. Impact of temperature-dependent phage expression on Pseudomonas aeruginosa biofilm formation npj Biofilms Microbiomes 2021 7 22 10.1038/s41522-021-00194-8 33727555 PMC7966754 50. LaBauve A.E. Wargo M.J. Growth and Laboratory Maintenance of Pseudomonas aeruginosa Curr. Protoc. Microbiol. 2012 25 6E.1.1 6E.1.8 10.1002/9780471729259.mc06e01s25 22549165 PMC4296558 51. Pistelok F. Pohl A. Wiera B. Stuczyński T. Using the ATP test in wastewater treatment in the Silesia Province Environ. Prot. Eng. 2016 42 17 32 10.37190/epe160102 52. Marques S.M. Esteves da Silva J.C.G. Firefly bioluminescence: A mechanistic approach of luciferase catalyzed reactions IUBMB Life 2009 61 6 17 10.1002/iub.134 18949818 53. Shama G. Malik D.J. The uses and abuses of rapid bioluminescence-based ATP assays Int. J. Hyg. Environ. Health 2013 216 115 125 10.1016/j.ijheh.2012.03.009 22541898 54. LIU W. Application of Microbiological Monitoring Techniques at Biological Wastewater Treatment Plant in CSC CSC China Steel Technol. Rep. 2019 32 55 60 Available online: https://www.csc.com.tw/csc/ts/ena/pdf/no32/pages/9-Application%20of%20Microbiological%20Monitoring.pdf (accessed on 28 October 2019) 55. Mo H. Lin L. Zhang Q. Zhang Z. Lin J.-G. Cao W. Zhang Y. Interactions and coupling mechanisms between Anammox, partial denitrification (PD) and hydroxyapatite (HAP) biomineralization in a PD/A-HAP system Chem. Eng. J. 2024 487 150537 10.1016/j.cej.2024.150537 56. Okuda T. Measurement of the specific surface area and particle size distribution of atmospheric aerosol reference materials Atmos. Environ. 2013 75 1 5 10.1016/j.atmosenv.2013.04.033 57. Hammes K. Smernik R.J. Skjemstad J.O. Schmidt M.W.I. Characterisation and evaluation of reference materials for black carbon analysis using elemental composition, colour, BET surface area and 13C NMR spectroscopy Appl. Geochem. 2008 23 2113 2122 10.1016/j.apgeochem.2008.04.023 58. Williams J.H. Gbadomosi M. Greytak A.B. Myrick M.L. Measuring the Surface Area of Carbon Black Using BET Isotherms: An Experiment in Physical Chemistry J. Chem. Educ. 2023 100 4838 4844 10.1021/acs.jchemed.3c00764 59. Ouf F.X. Bourrous S. Vallières C. Yon J. Lintis L. Specific surface area of combustion emitted particles: Impact of primary particle diameter and organic content J. Aerosol Sci. 2019 137 105436 10.1016/j.jaerosci.2019.105436 60. Lim S. Lee M. Yoo H.-J. Size distributions, mixing state, and morphology of refractory black carbon in an urban atmosphere of northeast Asia during summer Sci. Total Environ. 2023 856 158436 10.1016/j.scitotenv.2022.158436 36108842 61. Sager T.M. Castranova V. Surface area of particle administered versus mass in determining the pulmonary toxicity of ultrafine and fine carbon black: Comparison to ultrafine titanium dioxide Part. Fibre Toxicol. 2009 6 15 10.1186/1743-8977-6-15 19413904 PMC2681444 62. Mortimer M. Devarajan N. Li D. Holden P.A. Multiwall Carbon Nanotubes Induce More Pronounced Transcriptomic Responses in Pseudomonas aeruginosa PG201 than Graphene, Exfoliated Boron Nitride, or Carbon Black ACS Nano 2018 12 2728 2740 10.1021/acsnano.7b08977 29455524 63. Maksimova Y. Zorina A. Nesterova L. Oxidative Stress Response and E. coli Microorganisms 2023 11 1221 10.3390/microorganisms11051221 37317195 PMC10222281 64. Nasirzadeh N. Mohammadian Y. Rasoulzadeh Y. Rezazadeh Azari M. Khodagholi F. Toxicity of Carbon-Based Nanomaterials in the Human Lung: A Comparative In-Vitro Study Tanaffos 2022 21 391 400 Available online: https://pmc.ncbi.nlm.nih.gov/articles/PMC10073947/ (accessed on 22 March 2022) 37025312 PMC10073947 65. Varghese S. Kuriakose S. Jose S. Antimicrobial Activity of Carbon Nanoparticles Isolated from Natural Sources against Pathogenic Gram-Negative and Gram-Positive Bacteria J. Nanosci. 2013 2013 457865 10.1155/2013/457865 66. Ude J. Tripathi V. Buyck J.M. Söderholm S. Cunrath O. Fanous J. Claudi B. Egli A. Schleberger C. Hiller S. Outer membrane permeability: Antimicrobials and diverse nutrients bypass porins in Pseudomonas aeruginosa Proc. Natl. Acad. Sci. USA 2021 118 e2107644118 10.1073/pnas.2107644118 34326266 PMC8346889 67. Stapleton E.M. Manges R. Parker G. Stone E.A. Peters T.M. Blount R.J. Noriega J. Li X. Zabner J. Polgreen P.M. Indoor Particulate Matter from Smoker Homes Induces Bacterial Growth, Biofilm Formation, and Impairs Airway Antimicrobial Activity. A Pilot Study Front. Public Health 2020 7 418 10.3389/fpubh.2019.00418 32039129 PMC6992572 68. Nolan L.M. Cavaliere R. Turnbull L. Whitchurch C.B. Extracellular ATP inhibits twitching motility-mediated biofilm expansion by Pseudomonas aeruginosa BMC Microbiol. 2015 15 55 10.1186/s12866-015-0392-x 25879216 PMC4355966 69. Dsane V.F. An S. Oh T. Hwang J. Choi Y. Choi Y. Saline conditions effect on the performance and stress index of anaerobic ammonium oxidizing (anammox) bacteria Chemosphere 2021 267 129227 10.1016/j.chemosphere.2020.129227 33326902 70. Muñoz Sierra J.D. Oosterkamp M.J. Spanjers H. van Lier J.B. Effects of large salinity fluctuations on an anaerobic membrane bioreactor treating phenolic wastewater Chem. Eng. J. 2021 417 129263 10.1016/j.cej.2021.129263 71. Luján-Facundo M.J. Fernández-Navarro J. Alonso-Molina J.L. Amorós-Muñoz I. Moreno Y. Mendoza-Roca J.A. Pastor-Alcañiz L. The role of salinity on the changes of the biomass characteristics and on the performance of an OMBR treating tannery wastewater Water Res. 2018 142 129 137 10.1016/j.watres.2018.05.046 29864648 Figure 1 Schematic diagram of the experimental setup and procedure. Figure 2 Number size distribution of Aquadag, a BC surrogate, obtained from SP2 measurements. Aquadag particles’ size is expressed in mass-equivalent diameter (see Section 3.1 Figure 3 Variations in tATP, cATP, and dATP in incubated samples with different BC (Aquadag) concentrations: ( a b c Figure 4 Changes in cATP over time (day 1, day 5, and day 7) in samples with varying BC (Aquadag) concentrations. The red dashed lines represent the trend lines of cATP changes. Figure 5 Changes in cATP ( a b −1 Figure 6 Changes in BSI values in samples with varying BC (Aquadag) concentrations for whole experimental days ( a b a b Figure 7 Changes in BSI over time (day 1, day 5, and day 7) across all samples. Black text above each bar indicates the measured average BSI value for each day. toxics-13-00719-t001_Table 1 Table 1 Elemental composition and mass fraction with PAH analysis (adopted from [ 35 Elemental Composition Mass Fraction (%) Measurement * Measurement Uncertainty Sb 0.0679 0.0030 Ca 39.5 2.4 Cr 0.307 0.014 Co 0.01996 0.00070 Cu 4.01 0.30 Pb 0.293 0.013 Mg 9.43 0.54 Sn 0.191 0.012 Zn 8.17 0.44 Benz(a)anthracene 0.494 0.044 Benzo(a)pyrene 0.354 0.032 Benzo(b)fluoranthene 1.24 0.12 Benzo(e)pyrene 0.89 0.10 Benzo(ghi)perylene 1.11 0.12 Benzo(j)fluoranthene 0.466 0.046 Benzo(k)fluoranthene 0.420 0.045 Chrysene 1.019 0.097 Indeno(1,2,3-cd)pyrene 0.742 0.087 Triphenylene 0.399 0.039 * The units of measurement for Sb through Zn are g·kg −1 −1 Table 1 toxics-13-00719-t002_Table 2 Table 2 ICP/MS (inductively coupled plasma–mass spectrometry) and WD-XRF (X-ray fluorescence spectroscopy) Measurements, Korea Research Institute of Standard and Science (KRISS). Analyze ICP/MS (g·kg −1 WD-XRF (g·kg −1 Na 10.7 13.1 Al 37.0 45.5 K 17.7 15.1 Ti - 4.1 Mn 1.5 1.2 Fe 99.0 81.2 toxics-13-00719-t003_Table 3 Table 3 Cultivation conditions for PA14 with PM and BC (Aquadag). Sample ID Cultured Strain Concentration (ng mL −1 PM BC Control PA14 0 0 PM 5 0 PM + BC5 5 5 PM + BC10 5 10 PM + BC20 5 20 PM + BC30 5 30 PM + BC40 5 40 PM + BC50 5 50 PM + BC75 5 75 PM + BC100 5 100 ",
  "metadata": {
    "Title of this paper": "The role of salinity on the changes of the biomass characteristics and on the performance of an OMBR treating tannery wastewater",
    "Journal it was published in:": "Toxics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473884/"
  }
}