{
  "title": "Paper_448",
  "abstract": "pmc JMIR Mhealth Uhealth JMIR Mhealth Uhealth 2531 mhealth JMU JMIR mHealth and uHealth 2291-5222 JMIR Publications Inc. PMC12485267 PMC12485267.1 12485267 12485267 40957011 10.2196/69512 v13i1e69512 1 Original Paper Original Paper Integrating a Multimodal Digital Device for Continuous Perioperative Monitoring in Patients With Lung Cancer Undergoing Thoracic Surgery: Development and Usability Study Buis Lorraine Yang Homer Zhang Ruoyu Bang Ho Tat Wang Runchen MD 1 https://orcid.org/0000-0003-1969-7859 Zheng Jianqi MD 1 https://orcid.org/0000-0002-7545-6323 Guo Wenwei MD 1 https://orcid.org/0009-0008-3630-9452 Huang Haiqi MD 1 https://orcid.org/0009-0008-4418-8339 Wang Qixia MD 2 https://orcid.org/0000-0001-6759-530X Li Yihong MD 1 https://orcid.org/0009-0006-3722-9425 Lin Manwan MD 1 https://orcid.org/0009-0009-5203-5938 Huang Linchong MD 1 https://orcid.org/0000-0002-8418-5414 Zhang Qing MD 1 https://orcid.org/0000-0002-2028-9302 Chen Kaishen BA 3 https://orcid.org/0009-0008-2969-9819 Ye Zhiming MD 1 https://orcid.org/0009-0003-5753-0328 Deng Hongsheng MD 1 https://orcid.org/0000-0003-4886-0889 Jiang Yu MD 1 https://orcid.org/0000-0001-7344-7274 Lin Yuechun MD 1 https://orcid.org/0009-0004-8855-8355 Feng Yi MD 1 https://orcid.org/0000-0001-7998-656X Huang Ying MD 1 https://orcid.org/0009-0004-4450-6668 Chen Ying MD 1 https://orcid.org/0009-0007-2694-755X He Jianxing MD, PhD 1 https://orcid.org/0000-0003-1737-8192 Liang Hengrui MD, PhD https://orcid.org/0000-0002-1155-5963 1 Department of Thoracic Surgery, China State Key Laboratory of Respiratory Disease & National Clinical Research Center for Respiratory Disease the First Affiliated Hospital of Guangzhou Medical University 191 Yanjiang Road Guangzhou, 510120 China 86 02083062810 hengrui_liang@163.com  1 Department of Thoracic Surgery, China State Key Laboratory of Respiratory Disease & National Clinical Research Center for Respiratory Disease the First Affiliated Hospital of Guangzhou Medical University Guangzhou China  2 Department of Respiratory and Critical Care Medicine, Guangzhou Institute of Respiratory Health, State Key Laboratory of Respiratory Disease, National Clinical Research Center for Respiratory Disease, National Center for Respiratory Medicine the First Affiliated Hospital of Guangzhou Medical University Guangzhou China  3 CinoCore AI department Shanghai CinoCore Health Technology Co Ltd Shanghai China Corresponding Author: Hengrui Liang hengrui_liang@163.com 2025 16 9 2025 13 479656 e69512 2 12 2024 18 3 2025 6 4 2025 10 7 2025 16 09 2025 02 10 2025 02 10 2025 ©Runchen Wang, Jianqi Zheng, Wenwei Guo, Haiqi Huang, Qixia Wang, Yihong Li, Manwan Lin, Linchong Huang, Qing Zhang, Kaishen Chen, Zhiming Ye, Hongsheng Deng, Yu Jiang, Yuechun Lin, Yi Feng, Ying Huang, Ying Chen, Jianxing He, Hengrui Liang. Originally published in JMIR mHealth and uHealth (https://mhealth.jmir.org), 16.09.2025. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ https://mhealth.jmir.org/ Background Minimally invasive thoracic surgery has improved lung cancer outcomes but requires enhanced postoperative care. Traditionally, the episodic care model has limited timely and multidimensional monitoring of patients. Recent technological advances in multimodal digital devices, including wearable devices and electronic patient-reported outcomes (ePROs), offer a promising solution to these challenges. However, current studies focus on only a few parameters and limited application in thoracic surgery. Objective This study aims to propose a self-controlled study to evaluate the feasibility and reliability of multimodal digital devices, including wearables and ePROs, for continuous perioperative monitoring to enhance recovery after thoracic surgery. Methods We included 288 patients with non–small cell lung cancer from the Guangzhou Medical University cohort, which includes 2757 participants with various lung diseases. Digital data were collected during hospitalization using a commercial smartwatch combined with an ePROs questionnaire, while clinical data were obtained from electronic health records (EHRs). Agreement between the digital device and EHR was evaluated via Bland-Altman analysis. Time-series data were normalized for continuous outlier monitoring, and threshold analysis of ePROs scores were used to explore associations across different modules. Results Throughout hospitalization, digital devices provided a subjective overview of the patients’ recovery trajectories. Results of Bland-Altman analysis demonstrated a high level of agreement between the digital device and the EHR. For body temperature, the analysis revealed a minimal bias of 0.02 °C (95% CI –0.01 °C to 0.05 °C), the agreement for heart rate showed a bias of 0.26 beats per minute (bpm; 95% CI –0.49 bpm to 1.01 bpm), and the bias for oxygen saturation was –0.06% (95% CI –0.27% to 0.15%), indicating close alignment between the 2 measurement methods. Meanwhile, wearable devices demonstrate significant potential in outlier detection compared to the episodic care model, offering accurate and sensitive monitoring of outliers between traditional measurement intervals. Using a thresholding method, we found that wearable metrics were correlated with the severity of ePROs. Conclusions These findings highlight the reliability and clinical potential of digital device–based multimodal systems within the enhanced recovery after surgery framework, offering a novel approach for continuous perioperative monitoring. lung cancer digital device wearable device patients reported outcomes multi-modal artificial intelligence AI pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Background Minimally invasive thoracic surgery (MITS) has significantly improved perioperative outcomes for patients with lung cancer, offering benefits such as reduced postoperative pain, shorter hospital stays, and quicker recovery times [ 1 2 3 4 Currently, the commonly used perioperative monitoring model in clinical practice is episodic care, such as bedside monitoring, periodic assessment, and ward rounds. However, this care model limits patients’ activities and timely feedback on subjective feelings. Moreover, some abnormal signs of intermittent attacks may be missed due to the discontinuity of monitoring. Therefore, a novel pattern to obtain multimodal, comprehensive, real-time, continuous, and reliable data of patient condition is urgently needed to achieve ERAS. Recent technological advances in digital devices, including wearable devices and electronic patient-reported outcomes (ePROs) systems, offer a promising solution to these challenges [ 5 6 7 8 10 11 Despite these advances, several challenges still remain. First, most studies focus on the continuous tracking of only a few parameters, predominantly heart rate (HR) and step count. Second, previous research has mainly concentrated on cardiovascular disease, as HR monitoring is relatively straightforward. Finally, there is a scarcity of studies combining wearable devices with ePROs for use in clinical practice, particularly in thoracic surgery. Objective To address the gaps mentioned earlier, we propose a prospective, self-controlled study to explore the feasibility and reliability of using multimodal digital devices, including wearable technology combined with ePROs, and provide a novel evidence-based approach to continuous perioperative monitoring for enhanced recovery after thoracic surgery. Methods Ethical Considerations This prospective study received approval from the Ethics Committee of the National Center for Respiratory Medicine and the First Affiliated Hospital of Guangzhou Medical University (ES-2024-073-02) and was registered with the clinical trial registry ( NCT06118229 Patients Selection All patients were drawn from the Guangzhou Medical University cohort, a prospective, multicenter cohort designed to use multimodal data, including intelligent digital data, biospecimen data, and imaging artificial intelligence data from 2757 participants with various lung diseases, to assist in diagnosis, monitor treatment efficacy, and promote the rapid recovery of surgical patients. In this study, we prospectively and consecutively recruited patients with non–small cell lung cancer, one of the study arms within the Guangzhou Medical University cohort, aged ≥18 years, who were scheduled to undergo thoracic surgery between March 2023 and December 2023. Detailed exclusion criteria were as follows: (1) patients unable to wear the wearable device or have poor compliance; (2) patients with a previous history of trauma, infection, or tumor; (3) patients without a smartphone equipped with an Android (Google LLC) or iOS (Apple Inc) operating system; (4) patients with other systemic inflammatory or neurological diseases; and (5) pregnant or lactating women. All eligible patients provided informed consent after receiving detailed written information about the study, including the purpose of the study and use of wearable devices. Both verbal and written informed consent was obtained. Wearable Device The HUAWEI WATCH D (Huawei Device Co, Ltd) is a wrist-worn class II medical device approved by the Chinese National Medical Products Administration and certified under the EU Medical Device Regulation; it combines a micromechanical air pump, the TruBP pressure module, and temperature, photoplethysmography (PPG), and electrocardiography sensors to deliver continuous perioperative monitoring of body temperature, HR, oxygen saturation, and blood pressure. To limit motion- and wear-related artifacts, the watch uses an upgraded TruSeen 5.0+ optical system with 8 circumferential photodiodes and dual LEDs, a Fresnel film, and a curved 2.5-D sapphire back with physical vapor deposition electrodes that improve skin contact; abnormal strap loosening or compression triggers an automatic hardware repeat-measurement and refusal protocol. Raw signals were processed in real time by a HiFi-Encoder deep learning pipeline that performs multichannel enhancement and concurrent time and frequency noise suppression, discarding any frame whose signal-quality index falls below 0.8; under vigorous movement, this yields 98% accuracy for HR deviations ≤10 beats per minute (bpm) and 95% for deviations ≤5 bpm, and the same signal-quality index filter is available to downstream analyses via Huawei Health Kit. Device accuracy had been confirmed against ANSI/AAMI/ISO 81060-2:2018 criteria, while the “Huawei Heart Study” (>3.2 million participants) demonstrated a 92.8% positive predictive value for atrial fibrillation (AF) detection, a result incorporated into the 2020 European Society of Cardiology AF guidelines, collectively supporting the WATCH D’s capability to identify and suppress artifacts and to provide clinically reliable physiological data. Collection of Wearable Data The data recorded by the wearable device included body temperature, skin temperature, HR, oxygen saturation, sleep quality score, shallow sleep duration, deep sleep duration, dream duration, awake duration, daytime sleep duration, total sleep duration, step volume, distance movement, and calorie consumption. For safety considerations, the blood pressure measurement function on the wearable device was disabled by technicians from the backend. Each participant was assigned a unique application account to access HUAWEI’s developer application programming interface. Measurement data were transmitted to the application via Bluetooth, aggregated through the application programming interface backend, and deidentified before being stored on a secure network drive within the Tianhe-2 supercomputer, supported by the National Supercomputer Center in Guangzhou. Collection of Electronic Health Record Patients baseline characteristics, tumor characteristics, surgical information, and perioperative characteristics were included. Baseline characteristics comprised age, sex, BMI, smoking status, and consumption history. Tumor characteristics included pathological type, tumor location, tumor size, and tumor-node-metastasis stage. Surgical information encompassed American Society of Anesthesiologists grade, operation time, surgical procedures, anesthesia method, lymph node dissection, and intraoperative bleeding. Postoperative characteristics included length of hospital stay, duration of chest tube placement, pleural drainage volume, body temperature, oxygen saturation, HR, amount of postoperative pain medication, frequency of pain medication, administration via pain medication, administration method, and visual analog score for pain and postoperative complications. Collection of ePROs Data ePROs included 9 symptoms, which is described in a former study [ 12 A link to the survey was sent each night at 7 PM during hospitalization. Automatic reminders were sent every 30 minutes thereafter if the questionnaires were not completed. If the survey was not completed by 10 PM, the investigator would remind the patients to complete it. All collected data were aggregated and stored using the same strategy as described earlier. Time-Series Data Processing Given the considerable variations in the duration of wearing the wearable device during the perioperative period among different patients, we normalized the time scale. Specifically, we set the start time of surgery as the origin time, with the preoperative period as negative time and the postoperative period as positive time. A large amount of time-series data could be obtained using wearable devices, including body temperature, skin temperature, HR, and oxygen saturation. Multiple measurements could be recorded within a single minute to enhance the analyzability of the time-series data, and to further reduce the likelihood of potential false positives and false negatives arising from spurious signals, we averaged all measurements obtained within each minute and used these aggregated values in downstream analyses. Statistical Analysis Mean and SD or median and range were used to describe continuous data, while categorical data were presented as numbers and percentages. The agreement between the reference method and the wearable device was assessed using the Bland-Altman analysis [ 13 Wearable devices can bridge gaps in patient monitoring within the traditional episodic care model. We analyzed the occurrences of outlier detections during periods lacking nursing supervision and visualized these occurrences as line graphs. After aggregating the raw high-frequency measurements into 1-minute averages, we defined outliers on the basis of these minute-averaged values: a minute-averaged body temperature >37 °C or <36 °C; a minute-averaged HR >90 bpm or<60 bpm; and a minute-averaged oxygen saturation <95%. Differences between groups were compared using Student t All data preparation, analyses, and visualization were performed using R (version 4.0.5; The R Core Team, R Foundation for Statistical Computing). We deemed P Results Participant Demographics and Baseline Data A schematic overview of the study is presented in Figure 1 Figure 2 Table 1 Figure 1 Schema of overall study design. A total of 288 patients were prospectively involved in this study. Multimodal data, including electronic health records (EHRs), wearable devices, and electronic patient-reported outcomes (ePROs), were collected, and multimethod statistical analysis was applied. ERAS: enhanced recovery after surgery. See Multimedia Appendix 1 Figure 2 Patient recruitment. The flowchart illustrates the recruitment process and inclusion and exclusion criteria, and included participants underwent multimodal digital device monitoring. ePRO: electronic patient-reported outcome. See Multimedia Appendix 1 Table 1 Baseline characteristics of enrolled participants (N=288). Characteristic Value  Sex, n (%)  Female 174 (60.4)  Male 114 (39.6) Age (y), median (range) 56 (24-82)  BMI (kg/m 2  <18.5 20 (6.9)  18.5-24.9 201 (69.8)  ≥25 67 (23.3)  Smoking history, n (%)  Former smoker 37 (12.8)  Never smoker 251 (87.2)  History of alcohol use, n (%)  Current alcohol use 27 (9.4)  Never drank alcohol 261 (90.6)  Preoperative comorbidities, n (%)  Hypertension 29 (10.1)  Diabetes mellitus 23 (8)  COPD a 17 (5.9)  Arrhythmia 7 (2.4)  CAD b 4 (1.4)  Valvular heart disease 3 (1)  Family history of cancer, n (%)  Yes 46 (16)  No 242 (84)  Surgical position, n (%)  LUL c 70 (24.3)  LLL d 33 (11.5)  RUL e 73 (25.3)  RML f 19 (6.6)  RLL g 49 (17)  LUL+LLL 17 (5.9)  RUL+RML 6 (2.1)  RUL+RLL 16 (5.6)  RML+RLL 3 (1)  RUL+RML+RLL 2 (0.7)  Surgical method, n (%)  Lobectomy 85 (29.5)  Segmentectomy 203 (70.5)  Anesthesia method, n (%)  Spontaneous ventilation 116 (40.3)  Mechanical ventilation 172 (59.7)  Tumor stage, n (%)  Tis 50 (17.4)  1 198 (68.8)  2 32 (11.1)  3 7 (2.4)  4 1 (0.3)  Node stage, n (%)  Nx 14 (4.9)  0 254 (88.2)  1 11 (3.8)  2 8 (2.8)  3 1 (0.3)  Metastasis stage, n (%)  0 285 (99)  1 3 (1)  ASA h  I 5 (1.7)  II 241 (83.7)  III 42 (14.6) Surgical time (h), median (range) 1.50 (0.40-7.05) Anesthesia time (h), median (range) 3.08 (1.35-8.15) Intraoperative blood loss (mL), median (range) 10.00 (0-1300.00) a b c d e f g h Mapping Patient Vital Status and Recovery During Perioperative Vital Signs and Recovery Figures 3 4 Figure 3 Heatmap illustrates the patients’ perioperative body temperature, heart rate (HR), and oxygen saturation using wearable device data. (A) body temperature, (B) HR, and (C) oxygen saturation. Each parameter is displayed with its maximum, minimum, and average values. The sex and age of each patient are annotated and displayed alongside the heatmap. NS: not significant. See Multimedia Appendix 1 Figure 4 The heat map illustrates the patients’ perioperative recovery status using electronic patient-reported outcomes (eRPOs) data. (A) Pain, (B) cough, (C) shortness of breath, (D) restless sleep, (E) fatigue, (F) drowsiness, (G) distressed, (H) walking difficulties, and (I) limitation of activities. NS: not significant. See Multimedia Appendix 1 In the analysis of wearable device data, both body and skin temperatures showed consistent increases after surgery, indicating inflammatory or healing responses ( Figure 3 Multimedia Appendix 2 Figure 3 Figure 3 Multimedia Appendix 2 Multimedia Appendix 2 A total of 288 ePROs questionnaires were collected and analyzed. Figures 4 We also calculated the median and IQRs of ePRO scores during the perioperative period. The results suggested a pattern consistent with the objective trajectory of postoperative recovery. Taking pain as an example, the median pain score and IQR were 0 (IQR 0-0) on the day before surgery. The score peaked on the day of surgery, with a median of 5 (IQR 3-7), and gradually decreased starting from the second postoperative day, remaining at a low level. By the seventh postoperative day, the median pain score was 1 (IQR 1-2), and it further decreased by the 15th postoperative day, with a median of 1 (IQR 0-2; Multimedia Appendix 3 Evaluation of Agreement Between Wearable Devices and Electronic Health Record A Bland-Altman analysis was conducted to assess the agreement between wearable device data and electronic health record (EHR; episodic care model) for body temperature, HR, and oxygen saturation. For body temperature, the analysis revealed a minimal bias of 0.02 °C (95% CI –0.01 °C to 0.05 °C), with limits of agreement ranging from –0.47 °C (95% CI –0.52 °C to –0.41 °C) to 0.50 °C (95% CI 0.45 °C to 0.55 °C), indicating strong consistency between the 2 methods ( Figure 5 Figure 5 Figure 5 t Figure 6 Figure 6 Figure 6 Figure 5 Bland-Altman plot shows the agreement between digital devices and electronic health records (EHRs) in all participants. (A) Body temperature, (B) heart rate (HR), and (C) oxygen saturation. See Multimedia Appendix 1 Figure 6 Raincloud plot shows the comparison between digital devices and electronic health records (EHRs) in all participants. (A) Body temperature, (B) heart rate (HR), and (C) oxygen saturation. See Multimedia Appendix 1 Continuous Vital Signs Monitoring: Bridging Gaps in Perioperative EHR Systems Perioperative records in EHR systems often suffer from discontinuities, with significant temporal gaps in vital sign data. To address this issue, we conducted a systematic review to evaluate the benefits of wearable devices for continuous, 24-hour monitoring of vital signs. Table 2 Table 2 Comparative performance and outliers between electronic health records (EHRs) and wearable devices.  EHR Wearable device P  Body temperature (times)  Total number per patient 10.00 14,219.04 <.001  Total number per patient per day 3.08 4440.69 <.001  Outliers number per patient 0.23 2707.47 <.001  Outliers number per patient per day 0.07 845.56 <.001  He art rate (times)  Total number per patient 10.19 4293.75 <.001  Total number per patient per day 2.65 1339.16 <.001  Outliers number per patient 2.08 964.96 <.001  Outliers number per patient per day 0.54 300.96 <.001  Oxygen saturation (times)  Total number per patient 6.83 6924.67 <.001  Total number per patient per day 1.77 2057.24 <.001  Outliers number per patient 0.17 2644.67 <.001  Outliers number per patient per day 0.04 785.70 <.001 During hospitalization, body temperature, HR, and oxygen levels were measured an average of 3.08, 2.65, and 1.77 times per patient per day, respectively, during ward rounds, leading to 10.00, 10.19, and 6.83 measurements per patient over the course of their stay. In contrast, wearable devices recorded these parameters continuously, providing an average of 4440.69, 1339.16, and 2057.24 measurements per patient per day, with total readings reaching 14,219.04, 4293.75, and 6924.67 times. The difference in detection sensitivity was particularly notable when comparing outlier detection. For body temperature, the ward rounds identified 0.07 times outliers per patient, per day, whereas the wearable devices detected significantly more outliers, averaging 845.56 times per patient per day. Similarly, HR outliers were recorded at a rate of 0.54 times per patient per day through ward rounds, compared to 300.96 times detected by the wearable devices. For oxygen saturation levels, ward rounds captured 0.04 times outliers per patient per day, while wearable devices identified 785.70 times outliers. This comparison underscores the advantage of wearable devices in providing continuous, real-time vital sign monitoring, filling the gaps left by intermittent EHR-based records, and enabling earlier detection of critical physiological changes. Typical Case Presentation and Comparison To provide a clearer and more intuitive comparison between episodic care methods and digital devices, we sampled 2 typical cases and visualized their perioperative body temperature, HR, and oxygen saturation levels. Figures 7 Figure 7 Typical case presentation of perioperative continuous monitoring and comparison between episodic care method and digital device. (A) Perioperative body temperature trends of case 1, (B) perioperative body temperature trends of case 2, (C) perioperative heart rate (HR) trend of case 1, (D) perioperative HR trend of case 2, (E) perioperative oxygen saturation trend of case 1, and (F) perioperative oxygen saturation trend of case 2. See Multimedia Appendix 1 Figures 7 Figures 7 Assessing the Correlation Between Wearable Metrics and ePROs Scores To explore the potential association between data from wearable devices and ePROs, we conducted a threshold analysis comparing wearable parameters between 2 subgroups, categorized based on the overall ePROs score and 9 subindexes. Multimedia Appendix 4 Further analysis based on the 9 subindexes, detailed in Multimedia Appendix 5 Reported Feasibility and Acceptance of Digital Device Upon completing the study, all patients were interviewed to assess their experience with the ePROs and wearable devices. Table 3 Table 3 Feedback regarding the digital device from patient and medical team interviews. Themes Interview response Overall experience  “It has a positive effect on my preoperative status assessment and postoperative recovery.” “It is non-invasive, I just need to wear the watch as usual and complete the electronic questionnaire.” “It is waterproof, I can even keep wearing it while taking a shower.” “I don’t need to charge it frequently, once or twice a week is sufficient, which is very convenient.” “I’m satisfied, medical team can better understand my condition through the wearable device and ePROs, which makes me feel valued.” Device comfort  “It looks like a watch for daily wear.” “There are different types of watchbands to choose, offering a comfortable, barely noticeable wear.” “It is very lightweight, and I wear it while sleeping without any impacts.” “I can easily fill the questionnaires on my phone, simply selecting options based on my condition. Only takes a few minutes to complete.” “The questionnaire comes with reminder notifications on my phone, ensuring that I don’t forget to complete it.” Problems and improvements to the device  “Plastic watchbands tend to cause swearing when worn outdoors in the summer.” “Is it possible to add a blood pressure monitoring feature?” “Is it possible to use an infinitely adjustable watchband?” “Is it possible to combine the wearable device’s software with the questionnaire app into one? Download multiple apps can be quite frustrating.” Useful for the medical team?  “Yes, it would greatly assist the medical team in supplementing critical data amidst their busy work schedules.” “Yes, it can be more objectively reflect the patient’s perioperative vital status.” “Yes, it also serves as a motivation for patients. When patients wear the device and complete the ePROs questionnaires, it encourages them to be more proactive in order to achieve feedback and outcomes.” Evaluation of the Digital Device in Patients With and Without Postoperative Complications Postoperative complications were recorded in 25 (8.7%) out of 288 patients. Of these 25 patients, 13 (52%) experienced air leaks, 6 (24%) developed sustained high fever, 5 (20%) had persistent pleural drainage, and 1 (4%) exhibited poor lung re-expansion. The remaining 263 (31.3%) patients did not report any recordable postoperative complications. The baseline characteristics of patients with postoperative complications were summarized in Multimedia Appendix 6 Therefore, we performed the subgroup analyses based on patients with postoperative complications. The results of the Bland-Altman analysis demonstrated consistency with the overall findings. The body temperature revealed a minimal bias of –0.02 °C (95% CI –0.33 °C to 0.29 °C), with limits of agreement ranging from –0.33 °C (95% CI –0.44 °C to –0.22 °C) to 0.30 °C (95% CI 0.18 °C to 0.40 °C; Multimedia Appendix 7 Multimedia Appendix 6 Multimedia Appendix 8 t Multimedia Appendix 7 We also conducted a subgroup analysis of patients without postoperative complications; their baseline characteristics were summarized in Multimedia Appendix 9 Multimedia Appendices 10 11 In summary, the results of the subgroup analysis demonstrated a high level of consistency with the overall findings, thereby confirming the robustness of the study’s main results. Furthermore, these findings reinforced that the digital device was capable of effectively capturing clinically relevant vital information even in complex clinical settings, supporting its broad feasibility and reliability for clinical application. Discussion Principal Findings This is the first study to investigate the feasibility and reliability of using digital devices, including wearable devices and ePRO questionnaire, in the perioperative management of patients with lung cancer who underwent thoracic surgery. In this study, perioperative recovery was monitored through digital devices. Our results indicated that multimodal data could reflect patients’ perioperative status objectively and provide rapid, sensitive outlier detection. This innovation can assist the medical team in optimizing recovery trajectories and achieving the goals of ERAS in the context of the MITS era. Using prospectively collected data, we systematically mapped the perioperative recovery trajectory of patients with lung cancer who underwent thoracic surgery. Comparison across days revealed significant improvements in the vast majority of parameters, underscoring their critical role in recovery. Notably, the duration of shallow sleep, deep sleep, dreaming, total sleep, and day sleep, as recorded by the wearable device, showed no significant differences across days. However, the sleep quality score significantly improved during hospitalization. This discrepancy aligns with the restless sleep and drowsiness reported via ePROs, which reflect patients’ subjective experiences, suggesting a higher level of accuracy [ 14 15 Although this is a noninterventional study, its potential impact on nursing care and therapeutic procedures holds significant clinical importance. Through the recovery trajectories monitored by wearable devices and ePROs, we were able to capture real-time vital signs and subjective experiences of patients, thereby providing more comprehensive information for clinical decision-making. As a self-reported tool, ePROs effectively reflect patients’ subjective experiences, such as anxiety, pain, and activity limitations, and changes in their scores can serve as triggers for interventions. Specifically, when a score in a particular ePROs measure exceeds a set threshold, the nursing team can immediately implement corresponding interventions based on the patient’s reported concerns. For example, if a patient reports high pain levels, the nursing team can provide a pain management plan according to the assessment results; if a patient’s anxiety score exceeds the threshold, a psychological evaluation and consultation can be arranged. This precision-based intervention model using ePROs enables more individualized care, preventing both overintervention and undercare, thereby more effectively supporting the patient’s recovery process. In addition, digital devices can promptly alert nursing staff when vital signs deviate from normal ranges, enabling timely interventions. The integration of ePROs and digital device monitoring data significantly enhances nursing efficiency, optimizes resource allocation, and reduces unnecessary interventions. Future interventional studies will further explore how these monitoring data can be integrated into routine clinical workflows to improve perioperative recovery outcomes and enhance nursing care quality. Wearable devices are gaining attention in monitoring patients, and the health population has garnered significant attention. These devices are equipped with various sensors and chips designed to track a wide range of data, including HR sensors, accelerometers, gyroscopes, temperature sensors, oxygen saturation sensors, electrode sensors, and ambient light sensors. While their convenience is widely recognized, concerns regarding reliability and data security remain [ 16 17 t 18 21 22 In this study, the wearable device estimated core body temperature by measuring peripheral skin temperature at the wrist. During the development phase, the research team established a mapping model by simultaneously collecting data on both core and skin temperatures. This model was further optimized using physiological and environmental parameters such as HR and ambient temperature. After the stability of the model was validated, it was integrated into the device’s algorithm, enabling accurate real-time estimation of core body temperature based on skin temperature readings. In addition, the temperature sensor underwent calibration and performance testing under various environmental conditions to ensure measurement accuracy. Continuous monitoring offers distinct advantages in perioperative management. In contrast to traditional EHRs, which capture vital signs at discrete time points, wearable devices provide real-time, continuous monitoring and reduce the likelihood of missing critical clinical changes. A key advancement in this area is the development of PPG technology, which has made HR monitoring a reliable and established feature of wearable devices [ 23 24 New England Journal of Medicine 25 26 27 In the perioperative management within the surgical community, wearable devices have shown promise across various surgical disciplines. Beqari et al [ 28 29 30 Despite the advances seen in other surgical fields, the utility of wearable devices in patients with lung cancer undergoing thoracic surgery remains underexplored. Our findings revealed that outliers in vital signs, such as fluctuations in body temperature, HR, oxygen saturation levels, and other key metrics, occurred between the time points of EHR monitoring. Implementing robust continuous monitoring and alarm mechanism could enable the medical team to better track patients’ baseline vital signs, thereby facilitating ERAS protocols. Effective outlier detection in this study relied on a 2-tier strategy that integrated device-embedded safeguards with protocol-level quality control. First, at the hardware–algorithm tier, the wrist-worn HUAWEI WATCH D combined (1) an upgraded TruSeen 5.0+ optical module—8 circumferential photodiodes, dual LEDs, a Fresnel film, and a curved 2.5-D sapphire or physical vapor deposition back—plus the TruBP pressure system [ 31 27 32 The benefits of integrating EHRs with wearable devices are gradually becoming more apparent. Building on this foundation, we further incorporated ePROs to develop a multimodule perioperative monitoring network. Previous studies have demonstrated that patient reported outcomes (PROs) can effectively capture various aspects of a patient’s perioperative status, such as sleep, fatigue, and drowsiness [ 33 8 9 In this study, we introduced a threshold analysis to stratify patients based on the ePROs overall score and subindexes. Most vital signs and physiological parameters measured by the wearable device showed statistically significant differences between the high and low ePROs score groups, suggesting a potential relevance between various digital device modules. This highlights the advantages of using multimodal data to comprehensively assess the perioperative recovery status of patients who underwent lung cancer surgery. Our study also highlighted the potential economic benefits of the digital device–based continuous monitoring system. By enabling early detection of complications and timely interventions, the system may shorten hospital stays and reduce associated costs. Its integration into perioperative workflows can also alleviate nursing workload and improve resource efficiency. Furthermore, the use of the HUAWEI WATCH D, a certified medical-grade wearable device covered by the National Medical Products Administration, enhances the feasibility of large-scale clinical implementation. The acceptability, usability, and comfort of digital devices are crucial determinants of their successful clinical implementation [ 25 To address these limitations and further enhance the robustness of digital perioperative monitoring, our study integrated ePROs as a complementary data modality alongside wearable devices. While wearable devices continuously captured objective physiological parameters such as HR and oxygen saturation, ePROs provided direct insights into patients’ subjective symptoms and functional status, including pain, fatigue, and sleep quality. The design of combining sensor-based and self-reported data improved the overall reliability and interpretability of perioperative monitoring. Moreover, this integration supported seamless, minimally burdensome data acquisition and enabled more individualized recovery profiling. In future applications, this multimodal framework may also contribute to the development of more accurate and generalizable predictive models for surgical recovery. There are several limitations in our study that warrant acknowledgment. First, this was a single-center, prospective, self-controlled study conducted among patients undergoing thoracic surgery, which limited the generalizability of the results to other populations. However, our findings provide a foundation for future multicenter clinical trials. Second, all patients enrolled were required to own and operate a smartphone and to have a basic understanding of the functions provided by the wearable device; while the research team made every effort to provide technical support and detailed assistance to all potentially eligible patients, we acknowledge that individuals with limited technological literacy, including some older adults, may have been excluded, which highlights the importance of future research into the usability and compliance of wearable technologies across diverse patient demographics. Third, although the 2-tier strategy of device-embedded safeguards coupled with protocol-level quality control used in this study could identify and manage most potential artifacts in the wearable-device data, we acknowledge that residual false positive and false negative readings may still have influenced the study’s results and conclusions. Fourth, although the wearable device used in this study was the first wrist-worn wearable device to receive class II medical device certification, the blood pressure measurement function required the patient to perform the measurement autonomously. This could potentially lead to frequent measurements that might affect blood circulation or result in missing or reduced data quality if measurements were not taken according to the study protocol. After careful consideration, to avoid interfering with the normal treatment process of the patients, we ultimately decided not to include blood pressure as one of the planned measurement outcomes in this study. Previous studies have demonstrated the safety and feasibility of using the HUAWEI Watch D for blood pressure measurement, which could compensate for the lack of blood pressure monitoring data in this study [ 21 Conclusions Within the perioperative management of patients with lung cancer under the ERAS framework, the digital device composed of wearable devices and ePROs demonstrated feasibility and reliability in the continuous perioperative monitoring of patients who underwent lung cancer surgery. Our study offered a novel approach for multimodal, continuous perioperative monitoring, thereby laying the foundation for future research. The authors express their appreciation to all participants in this study; they also sincerely appreciate the technical staff from HUAWEI for generously answering their questions regarding the technical details of the devices. This study was supported by the R&D Program of Guangzhou National Laboratory (grant SRPG22-017). The writing and visualization in this study were entirely completed by the research team without the use of generative artificial intelligence for text or figure generation. ChatGPT was consulted for suggestions regarding code modification and error handling, and the final implementations were independently conducted based on the advice provided. Authors' Contributions: JH is the co–corresponding author and can be reached at hejx@vip.163.com. RW, WG, and HL were responsible for the conceptualization. JZ, HH, WG, Y Li, ML, and QZ were responsible for data curation. RW, WG, Y Lin, and YF were responsible for the formal analysis. JH was responsible for funding acquisition. RW, HH, YC, and HL were responsible for the investigation. RW and YJ were responsible for the methodology. YH, JH, and HL were responsible for the project administration. KC was responsible for software. YC, JH, and HL were responsible for resources. WG, JH, and HL were responsible for the supervision. JZ, HH, and YF were responsible for validation. RW, LH, and ZY were responsible for visualization. RW and QW were responsible for writing—original draft. HD, YH, and HL were responsible for writing—reviewing and editing. Conflicts of Interest: None declared. Multimedia Appendix 1 High resolution version of all figures. Multimedia Appendix 2 Heatmap illustrated the patients’ perioperative skin temperature, activity, and sleep status using wearable device data. (A) skin temperature;(B) sleep assessment;(C) activity assessment. Each parameter was displayed with its maximum, minimum, and average values. The gender and age of each patient were annotated and displayed alongside the heatmap. Multimedia Appendix 3 Median and Interquartile Range Distribution of electronic patients-report outcome. Multimedia Appendix 4 Results of threshold analysis based on the ePROs overall score. Multimedia Appendix 5 Results of threshold analysis based on the nine symptoms. Multimedia Appendix 6 Baseline characteristic of patients with postoperative complications. Multimedia Appendix 7 Bland-Altman plot showed the agreement between digital device and EHR in participants with postoperative complications. (A) body temperature; (B) HR; (C) oxygen saturation. Multimedia Appendix 8 Raincloud plot showed the comparison between digital device and EHR in participants with postoperative complications. (A) body temperature; (B) HR; (C) oxygen saturation. Multimedia Appendix 9 Baseline characteristic of patients without postoperative complications. Multimedia Appendix 10 Bland-Altman plot showed the agreement between digital device and EHR in participants without postoperative complications. (A) body temperature; (B) HR; (C) oxygen saturation. Multimedia Appendix 11 Raincloud plot showed the comparison between digital device and EHR in participants without postoperative complications. (A) body temperature; (B) HR; (C) oxygen saturation. Abbreviations AF atrial fibrillation bpm beats per minute EHR electronic health record ePRO electronic patient-reported outcome ERAS enhanced recovery after surgery HR heart rate MITS minimally invasive thoracic surgery PPG photoplethysmography PRO patient-reported outcome Data Availability The datasets generated or analyzed during this study are not publicly available due to institutional regulations concerning patient data but are available from the corresponding author upon reasonable request. 1 Bendixen M Jørgensen OD Kronborg C Andersen C Licht PB Postoperative pain and quality of life after lobectomy via video-assisted thoracoscopic surgery or anterolateral thoracotomy for early stage lung cancer: a randomised controlled trial Lancet Oncol 2016 06 17 6 836 44 10.1016/S1470-2045(16)00173-X 27160473 S1470-2045(16)00173-X 27160473 2 Fan CJ Chien HL Weiss MJ He J Wolfgang CL Cameron JL Pawlik TM Makary MA Minimally invasive versus open surgery in the Medicare population: a comparison of post-operative and economic outcomes Surg Endosc 2018 09 32 9 3874 80 10.1007/s00464-018-6126-z 29484556 10.1007/s00464-018-6126-z 29484556 3 Biere SS Maas KW Bonavina L Garcia JR van Berge Henegouwen MI Rosman C Sosef MN de Lange ES Bonjer HJ Cuesta MA van der Peet DL Traditional invasive vs. minimally invasive esophagectomy: a multi-center, randomized trial (TIME-trial) BMC Surg 2011 01 12 11 2 10.1186/1471-2482-11-2 21226918 1471-2482-11-2 21226918 PMC3031195 4 Nelson DB Mehran RJ Mena GE Hofstetter WL Vaporciyan AA Antonoff MB Rice DC Enhanced recovery after surgery improves postdischarge recovery after pulmonary lobectomy J Thorac Cardiovasc Surg 2023 05 165 5 1731 40.e5 10.1016/j.jtcvs.2022.09.064 36404141 S0022-5223(22)01143-6 36404141 5 Wang C Goel R Noun M Ghanta RK Najafi B Wearable sensor-based digital biomarker to estimate chest expansion during sit-to-stand transitions-a practical tool to improve sternal precautions in patients undergoing median sternotomy IEEE Trans Neural Syst Rehabil Eng 2020 01 28 1 165 73 10.1109/TNSRE.2019.2952076 31714229 31714229 PMC7027954 6 Michard F Smartphones and e-tablets in perioperative medicine Korean J Anesthesiol 2017 10 70 5 493 9 10.4097/kjae.2017.70.5.493 29046768 29046768 PMC5645581 7 Boffa DJ Kosinski AS Furnary AP Kim S Onaitis MW Tong BC Cowper PA Hoag JR Jacobs JP Wright CD Putnam JB Fernandez FG Minimally invasive lung cancer surgery performed by thoracic surgeons as effective as thoracotomy J Clin Oncol 2018 08 10 36 23 2378 85 10.1200/JCO.2018.77.8977 29791289 29791289 8 Dai W Feng W Zhang Y Wang XS Liu Y Pompili C Xu W Xie S Wang Y Liao J Wei X Xiang R Hu B Tian B Yang X Wang X Xiao P Lai Q Wang X Cao B Wang Q Liu F Liu X Xie T Yang X Zhuang X Wu Z Che G Li Q Shi Q Patient-reported outcome-based symptom management versus usual care after lung cancer surgery: a multicenter randomized controlled trial J Clin Oncol 2022 03 20 40 9 988 96 10.1200/JCO.21.01344 34995100 34995100 PMC8937008 9 Dai W Wang Y Liao J Wei X Dai Z Xu W Liu Y Wang XS Pompili C Yu H Pu Y Zhao Y Cao B Wang Q Feng W Zhang Y Liu F Deng Y Zhou J Li J Xie S Xiang R Wang X Tian B Yang X Hu B Liu X Xie T Yang X Zhuang X Qiao G Li Q Shi Q Electronic patient-reported outcome-based symptom management versus usual care after lung cancer surgery: long-term results of a multicenter, randomized, controlled trial J Clin Oncol 2024 06 20 42 18 2126 31 10.1200/JCO.23.01854 38574304 38574304 PMC11191061 10 Basch E Patient-reported outcomes - harnessing patients' voices to improve clinical care N Engl J Med 2017 01 12 376 2 105 8 10.1056/NEJMp1611252 28076708 28076708 11 Basch E Deal AM Dueck AC Scher HI Kris MG Hudis C Schrag D Overall survival results of a trial assessing patient-reported outcomes for symptom monitoring during routine cancer treatment JAMA 2017 07 11 318 2 197 8 10.1001/jama.2017.7156 28586821 2630810 28586821 PMC5817466 12 Lv C Lu F Zhou X Li X Yu W Zhang C Chen K Du S Han C Wang J Wang Y Li S Wang L Liu Y Zhang S Huang M Song D Zhao D Liu B Wang Y Cui X Zhou Z Yan S Wu N Efficacy of a smartphone application assisting home-based rehabilitation and symptom management for patients with lung cancer undergoing video-assisted thoracoscopic lobectomy: a prospective, single-blinded, randomised control trial (POPPER study) Int J Surg 2025 01 01 111 1 597 608 10.1097/JS9.0000000000001845 38905505 01279778-990000000-01711 38905505 PMC11745689 13 Bland JM Altman DG Statistical methods for assessing agreement between two methods of clinical measurement Lancet 1986 02 08 1 8476 307 10 2868172 S0140-6736(86)90837-8 2868172 14 Basch E Deal AM Kris MG Scher HI Hudis CA Sabbatini P Rogak L Bennett AV Dueck AC Atkinson TM Chou JF Dulko D Sit L Barz A Novotny P Fruscione M Sloan JA Schrag D Symptom monitoring with patient-reported outcomes during routine cancer treatment: a randomized controlled trial J Clin Oncol 2016 02 20 34 6 557 65 10.1200/JCO.2015.63.0830 26644527 JCO.2015.63.0830 26644527 PMC4872028 15 Sun V Kim J Symptom and functional recovery monitoring in thoracic surgery J Thorac Dis 2020 11 12 11 6931 9 10.21037/jtd.2020.03.59 33282397 jtd-12-11-6931 33282397 PMC7711426 16 Shei RJ Holder IG Oumsang AS Paris BA Paris HL Wearable activity trackers-advanced technology or advanced marketing? Eur J Appl Physiol 2022 09 21 122 9 1975 90 10.1007/s00421-022-04951-1 35445837 10.1007/s00421-022-04951-1 35445837 PMC9022022 17 Kim J Campbell AS de Ávila BE Wang J Wearable biosensors for healthcare monitoring Nat Biotechnol 2019 04 37 4 389 406 10.1038/s41587-019-0045-y 30804534 10.1038/s41587-019-0045-y 30804534 PMC8183422 18 He Y Chen Y Tang L Chen J Tang J Yang X Su S Zhao C Xiao N Accuracy validation of a wearable IMU-based gait analysis in healthy female BMC Sports Sci Med Rehabil 2024 01 02 16 1 2 10.1186/s13102-023-00792-3 38167148 10.1186/s13102-023-00792-3 38167148 PMC10762813 19 van der Stam JA Mestrom EH Scheerhoorn J Jacobs F de Hingh IH van Riel NA Boer A Scharnhorst V Nienhuijs SW Bouwman RA Accuracy of vital parameters measured by a wearable patch following major abdominal cancer surgery Eur J Surg Oncol 2022 04 48 4 917 23 10.1016/j.ejso.2021.10.034 34753618 S0748-7983(21)00784-8 34753618 20 Cao R Azimi I Sarhaddi F Niela-Vilen H Axelin A Liljeberg P Rahmani AM Accuracy assessment of Oura ring nocturnal heart rate and heart rate variability in comparison with electrocardiography in time and frequency domains: comprehensive analysis J Med Internet Res 2022 01 18 24 1 e27487 10.2196/27487 35040799 v24i1e27487 35040799 PMC8808342 21 Zhang W Zhou YN Zhou Y Wang JG Validation of the watch-type HUAWEI WATCH D oscillometric wrist blood pressure monitor in adult Chinese Blood Press Monit 2022 10 01 27 5 353 6 10.1097/MBP.0000000000000608 35687029 00126097-202210000-00012 35687029 22 Germini F Noronha N Borg Debono V Abraham Philip B Pete D Navarro T Keepanasseril A Parpia S de Wit K Iorio A Accuracy and acceptability of wrist-wearable activity-tracking devices: systematic review of the literature J Med Internet Res 2022 01 21 24 1 e30791 10.2196/30791 35060915 v24i1e30791 35060915 PMC8817215 23 Ray D Collins T Woolley S Ponnapalli P A review of wearable multi-wavelength photoplethysmography IEEE Rev Biomed Eng 2023 16 136 51 10.1109/rbme.2021.3121476 34669577 24 Lubitz SA Faranesh AZ Selvaggi C Atlas SJ McManus DD Singer DE Pagoto S McConnell MV Pantelopoulos A Foulkes AS Detection of atrial fibrillation in a large population using wearable devices: the Fitbit heart study Circulation 2022 11 08 146 19 1415 24 10.1161/circulationaha.122.060291 36148649 PMC9640290 25 Spatz ES Ginsburg GS Rumsfeld JS Turakhia MP Wearable digital health technologies for monitoring in cardiovascular medicine N Engl J Med 2024 01 25 390 4 346 56 10.1056/NEJMra2301903 38265646 38265646 26 Guo Y Wang H Zhang H Liu T Liang Z Xia Y Yan L Xing Y Shi H Li S Liu Y Liu F Feng M Chen Y Lip GY MAFA II Investigators Mobile photoplethysmographic technology to detect atrial fibrillation J Am Coll Cardiol 2019 11 12 74 19 2365 75 10.1016/j.jacc.2019.08.019 31487545 S0735-1097(19)36365-X 31487545 27 Hindricks G Potpara T Dagres N Arbelo E Bax JJ Blomström-Lundqvist C Boriani G Castella M Dan G Dilaveris PE Fauchier L Filippatos G Kalman JM La Meir M Lane DA Lebeau J Lettino M Lip GY Pinto FJ Thomas GN Valgimigli M Van Gelder IC Van Putte BP Watkins CL ESC Scientific Document Group 2020 ESC Guidelines for the diagnosis and management of atrial fibrillation developed in collaboration with the European Association for Cardio-Thoracic Surgery (EACTS): The Task Force for the diagnosis and management of atrial fibrillation of the European Society of Cardiology (ESC) Developed with the special contribution of the European Heart Rhythm Association (EHRA) of the ESC Eur Heart J 2021 02 01 42 5 373 498 10.1093/eurheartj/ehaa612 32860505 5899003 32860505 28 Beqari J Powell J Hurd J Potter AL McCarthy M Srinivasan D Wang D Cranor J Zhang L Webster K Kim J Rosenstein A Zheng Z Lin TH Fang Z Zhang Y Anderson A Madsen J Anderson J Clark A Yang ME Nurko A Li J El-Jawahri AR Sundt TM Melnitchouk S Jassar AS D'Alessandro D Panda N Schumacher LY Wright CD Auchincloss HG Sachdeva UM Lanuti M Colson YL Langer N Osho A Yang CJ Li X A pilot study using machine-learning algorithms and wearable technology for the early detection of postoperative complications after cardiothoracic surgery Ann Surg 2025 03 01 281 3 514 21 10.1097/SLA.0000000000006263 38482684 00000658-202503000-00027 38482684 PMC11399322 29 Ghomrawi HM O'Brien MK Carter M Macaluso R Khazanchi R Fanton M DeBoer C Linton SC Zeineddin S Pitt JB Bouchard M Figueroa A Kwon S Holl JL Jayaraman A Abdullah F Applying machine learning to consumer wearable data for the early detection of complications after pediatric appendectomy NPJ Digit Med 2023 08 16 6 1 148 10.1038/s41746-023-00890-z 37587211 10.1038/s41746-023-00890-z 37587211 PMC10432429 30 Kane WJ Hassinger TE Myers EL Chu DL Charles AN Hoang SC Friel CM Thiele RH Hedrick TL Wearable technology and the association of perioperative activity level with 30-day readmission among patients undergoing major colorectal surgery Surg Endosc 2022 02 36 2 1584 92 10.1007/s00464-021-08449-3 33782756 10.1007/s00464-021-08449-3 33782756 31 Five years of evolution of HUAWEI TruSeen™ 5.0+, HUAWEI WATCH GT 3 achieves more accurate heart rate monitoring Huawei 2025-05-29 https://consumer.huawei.com/sa-en/stories/wearables/news-gt3/ 32 Wang L Xian H Guo J Li W Wang J Chen Q Fu X Li H Chen Q Zhang W Chen Y A novel blood pressure monitoring technique by smart HUAWEI WATCH: a validation study according to the ANSI/AAMI/ISO 81060-2:2018 guidelines Front Cardiovasc Med 2022 9 923655 10.3389/fcvm.2022.923655 36304535 36304535 PMC9592900 33 Wang XS Gottumukkala V Patient-reported outcomes: is this the missing link in patient-centered perioperative care? Best Pract Res Clin Anaesthesiol 2021 12 35 4 565 73 10.1016/j.bpa.2020.10.006 34801218 S1521-6896(20)30102-6 34801218 PMC9879129 ",
  "metadata": {
    "Title of this paper": "Patient-reported outcomes: is this the missing link in patient-centered perioperative care?",
    "Journal it was published in:": "JMIR mHealth and uHealth",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485267/"
  }
}