{
  "title": "Paper_1105",
  "abstract": "pmc Vaccines (Basel) Vaccines (Basel) 2764 vaccines vaccines Vaccines 2076-393X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474311 PMC12474311.1 12474311 12474311 41012104 10.3390/vaccines13090898 vaccines-13-00898 1 Article TCR-T Cell Recognition of an NY-ESO-1 Epitope Presented by HLA-A2 Supertype: Implications for Cancer Immunotherapy Lin Qingqing Formal analysis Investigation Writing – original draft Writing – review & editing 1 2 † Liu Fenglan Formal analysis Investigation Writing – original draft Writing – review & editing 1 2 † Ma Yipeng Formal analysis Investigation Writing – original draft Writing – review & editing 1 2 Li Yanwei Methodology Investigation 1 2 Lin Tong Methodology Investigation 1 2 Chen Xiaochun Methodology Investigation 1 2 Zhang Jinling Methodology Investigation 1 2 Sun Heng Methodology Investigation 3 Wang Zhi Methodology Investigation 1 2 https://orcid.org/0000-0003-4444-7472 Xia Xiaojun Formal analysis Resources Writing – review & editing 4 5 Tian Geng Resources Writing – review & editing Funding acquisition 6 Jin Shi Resources Writing – review & editing Funding acquisition 3 * Wang Mingjun Conceptualization Writing – review & editing Supervision Funding acquisition 1 2 7 * Tripp Ralph Academic Editor 1 qingqingl@szinno.com fenglanl@szinno.com yipengma@hotmail.com yanweil@szinno.com lint@mail.sustech.edu.cn xiaochunc@szinno.com jinlingz@szinno.com zhiwang@szinno.com 2 3 sunheng@cicams-sz.org.cn 4 xiaxj@sysucc.org.cn 5 6 tiangeng666@aliyun.com 7 * jinshi@cicams-sz.org.cn mingjunw@szinno.com † These authors contributed equally to this work and share first authorship. 25 8 2025 9 2025 13 9 497676 898 03 7 2025 09 8 2025 12 8 2025 25 08 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: T-cell receptor (TCR)-engineered T-cell therapy (TCR-T) has become a promising anticancer therapy. Recognition of tumor cells by TCR-T cells requires matched human leukocyte antigen (HLA) alleles and tumor antigens, which seriously limits their population coverage. One strategy to expand the population coverage of a specific TCR-T cell therapy is to enable TCR-T cells to recognize target peptides presented by more HLA alleles. Methods: In this study, HLA alleles were selected based on the Chinese population frequency and HLA supertype classification. Then, COS-7 and two tumor cell lines (586 mel and 5637) were transduced with selected HLA alleles for functional evaluation of TCR-T cells. HLA-A2 alleles capable of both exogenously and endogenously presenting the NY-ESO-1-derived epitope and thereby being recognized by TCR-T cells were tested. Results: We demonstrated that a given TCR-T cell product can recognize the NY-ESO-1 peptide exogenously and endogenously presented not only by HLA-A*02:01 but also by HLA-A*02:03, HLA-A*02:06, and HLA-A*02:10, almost doubling the population coverage in the Chinese population from 12.01% to 21.05%. Conclusions: Our study suggests that cancer patients expressing members of the HLA-A2 supertype may benefit from the TCR-T cell product, and other TCR-T cell products could similarly expand their population coverage even within the non-Chinese population through an analogous approach. cancer immunotherapy TCR-T HLA-A2 alleles HLA-A2 supertype NY-ESO-1 Shenzhen Major Science and Technology Special Project KJZD20240903102713018 Shenzhen Basic Research Program JCYJ20180507182902330 JCYJ20190809115811354 Shenzhen Peacock Plan KQTD20130416114522736 Special Funds for Dapeng New District Industry Development KJYF202001-13 KJYF202001-12 KY20180214 PT201901-12 Guangdong Basic and Applied Basic Research Foundation 2020B1515120018 Shenzhen Science and Technology Research and Development Fund CJGJZD20200617102403009 Shenzhen Science and Technology Program RCJC20200714114436049 Cancer Hospital, Chinese Academy of Medical Sciences, Shenzhen Center/Shenzhen Cancer Hospital Research Project SZ2020ZD006 This study was supported by the Shenzhen Major Science and Technology Special Project [grant number: KJZD20240903102713018], the Shenzhen Basic Research Program [grant numbers: JCYJ20180507182902330 and JCYJ20190809115811354], the Shenzhen Peacock Plan [grant number: KQTD20130416114522736], the Special Funds for Dapeng New District Industry Development [grant numbers: KJYF202001-13, KJYF202001-12, KY20180214, and PT201901-12], the Guangdong Basic and Applied Basic Research Foundation [Grant number: 2020B1515120018], the Shenzhen Science and Technology Research and Development Fund [Grant number: CJGJZD20200617102403009], the Shenzhen Science and Technology Program [Grant number: RCJC20200714114436049], and the Cancer Hospital, Chinese Academy of Medical Sciences, Shenzhen Center/Shenzhen Cancer Hospital Research Project [Grant number: SZ2020ZD006]. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Although considerable advances have been made in the development of targeted therapy and immunotherapy, cancers are still one of the leading causes of death in most countries [ 1 2 3 4 5 6 7 8 ® 9 The recognition of target cells by TCR-T cells requires matching of both human leukocyte antigen (HLA) alleles and targeted proteins [ 10 11 12 13 14 15 14 16 17 18 ® 9 Several approaches have been employed to evaluate the function of different HLA alleles in TCR-T cell therapy. One of them utilizes lymphoblastoid cell lines (LCLs) that naturally express different HLA alleles as antigen-presenting cells [ 19 20 21 22 23 24 25 26 In the present study, by using an HLA-A*02:01-restricted NY-ESO-1-specific TCR, we developed a novel strategy for expanding the population coverage of TCR-T cells. HLA alleles were selected based on their population frequency and HLA supertype classification [ 16 2. Materials and Methods 2.1. Cells 293T and T2 cells were purchased from the American Type Culture Collection (ATCC). 5637 and COS-7 cells were purchased from the Cell Bank of the Chinese Academy of Sciences. In total, 586 mel cells were kindly provided by Dr. Rongfu Wang from the University of Southern California. NY-ESO-1 TCR-T cells, called 1G4-α95:LY TCR-T cells, were obtained as described previously [ 7 8 8 27 2.2. Generation of COS-7-A2, COS-7-NY-A2, 586 mel-A2, and 5637-NY-A2 Cells Nucleotide sequences of NY-ESO-1, HLA-A*02:01, HLA-A*02:03, HLA-A*02:05, HLA-A*02:06, HLA-A*02:07, HLA-A*02:09, HLA-A*02:10, HLA-A*02:11, and HLA-A*02:48 were extracted from the IMGT database [ 28 29 2.3. Incubation of the TCR-T Cells with COS-7-A2, COS-7-NY-A2, 586 mel-A2, and 5637-NY-A2 Cells TCR-T cells were incubated with COS-7-A2 cells stably transfected with HLA-A*02:01, HLA-A*02:03, HLA-A*02:05, HLA-A*02:06, HLA-A*02:07, HLA-A*02:09, HLA-A*02:10, HLA-A*02:11, and HLA-A*02:48, with the wild type (WT) as a non-transfected control. COS-7-A2 cells were loaded with 10 μM of the corresponding peptide for 2 h at 37 °C and then washed twice prior to co-culture. After 16–24 h, supernatants were collected and analyzed for IFN-γ by ELISA. COS-7-NY-A2, 586 mel-A2, 586 mel-WT, 5637-NY-A2, 5637-NY, 5637-WT, or 624 mel cells were co-cultured with TCR-T cells in the same manner. 2.4. ELISA An anti-IFN-γ monoclonal antibody was used as the primary antibody (Clone 2G1, Invitrogen, M700A, Carlsbad, CA, USA), which was coated onto a MaxiSorp 96-well plate (Nunc, 442404) overnight at 4 °C. The antibody was removed, and the plates were blocked with PBS supplemented with 1% BSA for 2 h. The cells were co-cultured as previously described, and the supernatants were transferred to precoated plates for incubation. A biotin-labeled anti-IFN-γ antibody was used as the secondary antibody (clone B133.5, M701b, Invitrogen), and HRP-conjugated streptavidin (Thermo Scientific, N200, Waltham, MA, USA) was added after secondary antibody incubation. Then, 100 μL/well TMB (Sigma Aldrich, St. Louis, MO, USA, T5525) was added as the substrate for HRP. The plates were read using an Infinite M200 PRO reader (TECAN Austria GmbH, Grödlg, Austria). 2.5. Flow Cytometry (FACS) Analysis T cells were analyzed by flow cytometry (FCM). Briefly, the cells were suspended in FCM buffer containing sterile phosphate-buffered saline (PBS, Corning, 21-040-CV) supplemented with 1% bovine serum albumin (Roche, 10735078001). Transduction efficiency of HLA-A2 alleles was assessed 48 h after transduction by staining for HLA-A2 (clone BB7.2, BD Biosciences, 558570). 7-AAD (559925; BD Biosciences) was used to remove dead cells. For TCR-T cells, the following markers were used: PE-eF610-CD3 (clone UCHT1, Invitrogen, 61-0038-42), TCR Vβ 13.1-APC (clone H131, Biolegend, 362408), APC-H7-CD8 (clone SK1, BD Biosciences, 561423), Alexa Fluor 700-CD4 (clone SK3, BD Biosciences, 566318), BV421-4-1BB (clone 4B4-1, BD Biosciences, 564091), PE-PD-1 (clone EH12.1, BD Biosciences, 560795), and BV785-LAG-3 (clone 11C3C65, Biolegend, 369322). The stained cells were washed and resuspended in FCM buffer and analyzed using a FACS Aria II (BD Biosciences, San Jose, CA, USA). 2.6. Statistical Analysis Statistical analyses were performed using GraphPad Prism version 6.01 for Windows (GraphPad Software, San Diego, CA, USA). For multiple comparisons between groups, we employed multiple t p p 3. Results 3.1. Population Frequency-Based Selection of HLA Supertype Genes for the Expansion of Population Coverage of a Given TCR A selection strategy combining the population frequency of HLA subtypes and HLA supertype classifications was employed. As shown in Supplementary Figure S1a 12 14 Supplementary Figure S1b 30 Figure 1 Supplementary Table S1, Supplementary Figure S2 Supplementary Table S2 3.2. Target Antigen Peptide Presented by Members of the HLA-A2 Supertype in Cos-7 Cells Could Activate the HLA-A*02:01-Restricted TCR-T Cells To investigate the potential presentation of the target antigen peptide by different HLA-A2 molecules, COS-7 wild-type (WT) and COS-7 cells transduced with different HLA-A2 subtype genes (COS-7-A2) were loaded with the corresponding NY-ESO-1 157-165 epitope (SLLMWITQC) and then co-incubated with 1G4-α95:LY TCR-T cells derived from HLA-A*02:01+ patients [ 27 Figure 2 Supplementary Figure S3a After preliminary selection of HLA-A2 supertype candidates by loading the exogenous tumor antigen epitope onto COS-7-A2 cells, NY-ESO-1 genes were further transduced into COS-7-A2 cells (COS-7-NY-A2) to evaluate the ability of HLA superfamily members to present endogenously processed antigen epitopes. As depicted in Figure 2 3.3. Evaluation of the Functional Avidity of Target Antigen Peptide Presented by Different HLA-A2 Alleles of the HLA-A2 Supertype To quantify the functional avidity of TCR-T cells for the five active HLA-A2 alleles (A*02:01, A*02:03, A*02:05, A*02:06, and A*02:10), the antigen peptide (SLLMWITQC) was loaded onto COS-7-A2 and T2 cells in serial dilutions. As shown in Figure 3 3.4. Target Antigen Peptide Could Be Presented by Transduced HLA-A2 Supertype Members in Tumor Cells and Be Recognized by HLA-A*02:01-Restricted TCR-T Cells The presentation of endogenous epitopes in tumor cells is a complex process involving proteolysis, peptide transportation, peptide binding to HLA alleles, etc. To evaluate this process, 586 mel (NY-ESO-1+A2-) was used for the transduction of different HLA-A2 alleles. Similar to COS-7-A2 cells, TCR-T cells also exhibited activity for different HLA-A2 alleles other than HLA-A*02:01 according to ELISA ( Figure 4 Figure 4 Figure 4 In addition, similar to 586 mel-A2 cells, TCR-T cells exhibited activity for different HLA-A2 alleles other than HLA-A*02:01 in 5637-NY-A2 cells ( Supplementary Figure S4 4. Discussion Despite being a promising precision medicine for tumor treatment, the limited population coverage of TCR-T cell therapy hinders its clinical application. Each HLA allele can potentially possess a unique repertoire of binding peptides, considering that most HLA allele polymorphisms are located in the epitope-binding region. However, despite this polymorphism, HLA class I molecules can be clustered into supertypes that share overlapping peptide binding specificity and present a given epitope to be recognized by a single TCR [ 31 32 The top 10 HLA-A2 supertype alleles were selected based on their population frequencies in the Chinese population. The 10 chosen alleles can cover 99.85% of the entire HLA-A2 population with the potential to be recognized by the HLA-A*02:01-restricted TCR, considering that they may bind with the same NY-ESO-1 157-165 epitope. Among them, HLA-A*02:48 has a frequency of 0.0097% and is a rare allele encountered in the clinical use of TCR-T cell therapy. These findings suggest that the selected alleles encompass nearly all clinically relevant HLA-A2 supertype variants. The functional clustering of these 10 alleles suggested that there are certain differences among the peptide-binding capacities of different alleles, although they belong to the same supertype. Furthermore, it is well known that the amino acid substitutions that define the different HLA-A2 subtypes can potentially influence not only peptide binding but also the conformation of the peptide/HLA complex and thus its recognition by the TCR, which also warrants further functional evaluation of TCR-T cells harboring different supertype alleles. One advantage of using an exogenously loaded peptide is that a particular epitope from an antigen can be clearly targeted and evaluated. In this study, the specific recognition of the NY-ESO-1 157-165 epitope (SLLMWITQC) by TCR-T cells over the control peptide loaded on COS-7-A2 cells suggests that this TCR specifically recognizes the NY-ESO-1 157-165 epitope. A similar level of IFN-γ release by TCR-T cells activated by either peptide-loaded COS-7-A*02:01 or T2 cells confirms the reliability of using transgenic HLA-A2 alleles. The highest activity of TCR-T cells activated by the NY-ESO-1 157-165 loaded on HLA-A*02:01-expressing antigen-presenting cells (APCs) is expected because it is an endogenous TCR identified in HLA-A*02:01 patients. Interestingly, for the first time, we found that this TCR is also reactive to NY-ESO-1 157-165-loaded APC expressing HLA-A*02:03, HLA-A*02:05, HLA-A*02:06, or HLA-A*02:10, in addition to HLA-A*02:01. In addition, we introduced a number of HLA-I alleles (such as HLA-A*11:01 and HLA-A*24:02) that were highly frequent in the Chinese population into COS-7 cells, and only the antigen peptide presented by COS-7 transfected with HLA-A*02:01 could stimulate TCR-T cells to release high levels of IFN-γ, indicating that the TCR-T response is indeed HLA-A2-restricted ( Supplementary Figure S3b Supplementary Figure S3c,d Supplementary Figure S1b 30 To investigate why TCR-T cells do not respond to the epitope presented by other members of the HLA-A2 supertype, such as HLA-A*02:07, HLA-A*02:48, HLA-A*02:09, and HLA-A*02:11, we compared the sequences of HLA-A2 alleles ( Supplementary Figure S5 and Supplementary Table S3 https://www.uniprot.org/ Supplementary Table S4 33 Supplementary Table S5 Additionally, we assessed the functional avidity of TCR-T cells against the NY-ESO-1 peptide presented by HLA-A2 supertype alleles by EC50, defined as the peptide concentration inducing half-maximal activation of the T-cell population. Theoretically, low EC50 values indicate that the TCR can recognize tumor cells with low epitope density, potentially translating to improved clinical efficacy. For instance, a study optimizing an MAGE-A1-specific TCR via somatic hypermutation demonstrated that T cells with enhanced avidity exhibited significantly higher IFN-γ production and cytotoxicity against melanoma cells, both in vitro and in mouse models [ 34 35 35 36 Figure 4 NCT02457650 7 36 In addition, we compared the avidity obtained by co-culturing TCR-T cells with COS-7-A2 cells pulsed with antigen epitopes. A strong positive correlation was found between avidity and the predicted binding affinity of the antigen epitope for HLA-A*02:01, HLA-A*02:03, HLA-A*02:06, and HLA-A*02:10 ( Supplementary Figure S6b Supplementary Figure S6a One of the disadvantages of both COS-7-A2 cells and commonly used LCLs is that the evaluation of antigen processing is not considered during functional tests of TCR-T cells. This process can have tremendous effects on the surface presentation of epitopes, because the alleles are required to bind with the processed short peptide before being transported to the cell surface. Therefore, the inclusion of antigen-positive COS-7-NY-A2 and tumor cells is critical for overcoming these drawbacks. NY-ESO-1 can be detected in multiple tumor cells; therefore, two types of tumor cells were chosen to verify the members of the HLA-A2 supertype. Surprisingly, HLA-A*02:05 in antigen-presenting cells could present endogenously processed peptides to TCR-T cells within the context of COS-7 cells but failed to do so within tumor cells. However, when tumor-A*02:05 cells were loaded with the exogenous NY-ESO-1 epitope, TCR-T cells could still recognize them. Furthermore, a strong positive correlation between IFN-γ secretion and 4-1BB upregulation was demonstrated in TCR-T cells upon co-culture with 586 mel-A2 cells, with only minor fluctuations in the expression of LAG-3 and PD-1. To further validate these conclusions, we will perform experiments using HLA-A2+ NY-ESO-1+ patient-derived organoids or primary cells in future studies, including mass spectrometry (MS) analysis and co-culture assays with TCR-T cells. Differences in cell types may be one reason for this finding. COS-7 cells, a fibroblast-like cell line derived from African green monkey kidney, function as “non-professional” antigen-presenting cells (APCs) and lack MHC class II and costimulatory molecules [ 37 38 39 40 41 42 Supplementary Table S2 Figure 2 43 44 45 45 46 Additionally, the stability of peptide-MHC (pMHC) complexes on target cells may represent another contributing factor. The affinity of peptide binding to MHC-I is important for the formation of pMHC, and multiple prediction methods have been developed, such as NetMHC 4.1 and MHCflurry [ 47 48 49 50 51 52 53 54 55 Supplementary Table S5 As mentioned above, it is critical to include both exogenously and endogenously presented epitopes in the functional evaluation of TCR-T cells, and a strong positive correlation between these two different assays is required for the functional verification of TCR-T cells for different HLA alleles as well as the particular epitope ( Supplementary Figure S7 11 Supplementary Table S6 ® 9 NCT02457650 7 Nonetheless, we acknowledge the need for further validation to strengthen these conclusions. Our prospective research agenda includes two key components: First, establishing humanized xenograft models in NSG mice, where tumor cells engineered to express HLA-A2 supertype alleles will be implanted, followed by adoptive transfer of 1G4-α95:LY TCR-T cells to assess allele-specific tumor rejection and persistence. Second, expanding the clinical trial to enroll more patients across these HLA-A2 subtypes, with monitoring of objective response rates and correlation with TCR-T cell expansion and function in vivo. 5. Conclusions In summary, we demonstrated that HLA-A*02:01-restricted TCR-T cells might be used not only for patients expressing HLA-A*02:01 but also for patients expressing HLA-A*02:03, HLA-A*02:06, or HLA-A*02:10. Based on the frequency of these HLA alleles, the population coverage almost doubled from 12.01% to 21.05%. More importantly, the HLA selection strategy based on population frequencies and HLA supertype classification has proven viable for the evaluation and expansion of population coverage of TCR-T cell therapies. Our results suggest that artificial expression of HLA supertype genes in both COS-7 cells and antigen-positive cells is necessary for the functional verification of TCR-T cells for a particular epitope. Acknowledgments We thank Lei Chen for providing assistance in experimental design. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded https://www.mdpi.com/article/10.3390/vaccines13090898/s1 Author Contributions Conceptualization, M.W.; formal analysis, Q.L., F.L., Y.M. and X.X.; funding acquisition, G.T., S.J. and M.W.; investigation, Q.L., F.L., Y.M., Y.L., T.L., X.C., J.Z., H.S. and Z.W.; methodology, Y.L., T.L., X.C., J.Z., H.S. and Z.W.; resources, X.X., G.T. and S.J.; supervision, M.W.; writing—original draft, Q.L., F.L. and Y.M.; writing—review and editing, Q.L., F.L., Y.M., X.X., G.T., S.J. and M.W. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Material Conflicts of Interest Author Qingqing Lin, Fenglan Liu, Yipeng Ma, Yanwei Li, Tong Lin, Xiaochun Chen, Jinling Zhang and Zhi Wang were employed by Shenzhen Innovation Immunotechnology Co., Ltd. The remaining authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Abbreviations The following abbreviations are used in this manuscript: AFND Allele Frequency Net Database CAR-T Chimeric antigen receptor T-cell therapy FDA US Food and Drug Administration FCM Flow cytometry GFP Green Fluorescent Protein HLA Human leukocyte antigen HPV Human papillomavirus LCLs Lymphoblastoid cell lines pMHC Peptide-major histocompatibility complex TCR-T T-cell receptor-engineered T-cell therapy WT Wild type References 1. Bray F. Ferlay J. Soerjomataram I. Siegel R.L. Torre L.A. Jemal A. Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2018 68 394 424 10.3322/caac.21492 30207593 2. Saito M. Suzuki H. Kono K. Takenoshita S. Kohno T. Treatment of lung adenocarcinoma by molecular-targeted therapy and immunotherapy Surg. Today 2018 48 1 8 10.1007/s00595-017-1497-7 28280984 3. Li B. Chan H.L. Chen P. Immune Checkpoint Inhibitors: Basics and Challenges Curr. Med. Chem. 2019 26 3009 3025 10.2174/0929867324666170804143706 28782469 4. Baulu E. Gardet C. Chuvin N. Depil S. TCR-engineered T cell therapy in solid tumors: State of the art and perspectives Sci. Adv. 2023 9 eadf3700 10.1126/sciadv.adf3700 36791198 PMC9931212 5. Nagarsheth N.B. Norberg S.M. Sinkoe A.L. Adhikary S. Meyer T.J. Lack J.B. Warner A.C. Schweitzer C. Doran S.L. Korrapati S. TCR-engineered T cells targeting E7 for patients with metastatic HPV-associated epithelial cancers Nat. Med. 2021 27 419 425 10.1038/s41591-020-01225-1 33558725 PMC9620481 6. Doran S.L. Stevanovic S. Adhikary S. Gartner J.J. Jia L. Kwong M.L.M. Faquin W.C. Hewitt S.M. Sherry R.M. Yang J.C. T-Cell Receptor Gene Therapy for Human Papillomavirus-Associated Epithelial Cancers: A First-in-Human, Phase I/II Study J. Clin. Oncol. 2019 37 2759 2768 10.1200/JCO.18.02424 31408414 PMC6800280 7. Xia Y. Tian X. Wang J. Qiao D. Liu X. Xiao L. Liang W. Ban D. Chu J. Yu J. Treatment of metastatic non-small cell lung cancer with NY-ESO-1 specific TCR engineered-T cells in a phase I clinical trial: A case report Oncol. Lett. 2018 16 6998 7007 10.3892/ol.2018.9534 30546433 PMC6256329 8. Robbins P.F. Kassim S.H. Tran T.L. Crystal J.S. Morgan R.A. Feldman S.A. Yang J.C. Dudley M.E. Wunderlich J.R. Sherry R.M. A pilot trial using lymphocytes genetically engineered with an NY-ESO-1-reactive T-cell receptor: Long-term follow-up and correlates with response Clin. Cancer Res. 2015 21 1019 1027 10.1158/1078-0432.CCR-14-2708 25538264 PMC4361810 9. US Food & Drug Administration Approval Letter–TECELRA Available online: https://www.fda.gov/vaccines-blood-biologics/cellular-gene-therapy-products/tecelra (accessed on 1 August 2024) 10. Wang R.F. Wang H.Y. Immune targets and neoantigens for cancer immunotherapy and precision medicine Cell Res. 2017 27 11 37 10.1038/cr.2016.155 28025978 PMC5223235 11. Gonzalez-Galarza F.F. McCabe A. Santos E. Jones J. Takeshita L. Ortega-Rivera N.D. Cid-Pavon G.M.D. Ramsbottom K. Ghattaoraya G. Alfirevic A. Allele frequency net database (AFND) 2020 update: Gold-standard data classification, open access genotype data and new query tools Nucleic Acids Res. 2020 48 D783 D788 10.1093/nar/gkz1029 31722398 PMC7145554 12. He Y. Li J. Mao W. Zhang D. Liu M. Shan X. Zhang B. Zhu C. Shen J. Deng Z. HLA common and well-documented alleles in China HLA 2018 92 199 205 10.1111/tan.13358 30073798 13. Robinson J. Halliwell J.A. Hayhurst J.D. Flicek P. Parham P. Marsh S.G. The IPD and IMGT/HLA database: Allele variant databases Nucleic Acids Res. 2015 43 D423 D431 10.1093/nar/gku1161 25414341 PMC4383959 14. Sidney J. Peters B. Frahm N. Brander C. Sette A. HLA class I supertypes: A revised and updated classification BMC Immunol. 2008 9 1 10.1186/1471-2172-9-1 18211710 PMC2245908 15. Sette A. Sidney J. Nine major HLA class I supertypes account for the vast preponderance of HLA-A and -B polymorphism Immunogenetics 1999 50 201 212 10.1007/s002510050594 10602880 16. Wang M. Claesson M.H. Classification of human leukocyte antigen (HLA) supertypes Methods Mol. Biol. 2014 1184 309 317 10.1007/978-1-4939-1115-8_17 25048132 PMC7121184 17. Lund O. Nielsen M. Kesmir C. Petersen A.G. Lundegaard C. Worning P. Sylvester-Hvid C. Lamberth K. Roder G. Justesen S. Definition of supertypes for HLA molecules using clustering of specificity matrices Immunogenetics 2004 55 797 810 10.1007/s00251-004-0647-4 14963618 18. Shen Y. Parks J.M. Smith J.C. HLA Class I Supertype Classification Based on Structural Similarity J. Immunol. 2023 210 103 114 10.4049/jimmunol.2200685 36453976 19. Wisskirchen K. Metzger K. Schreiber S. Asen T. Weigand L. Dargel C. Witter K. Kieback E. Sprinzl M.F. Uckert W. Isolation and functional characterization of hepatitis B virus-specific T-cell receptors as new tools for experimental and clinical use PLoS ONE 2017 12 e0182936 10.1371/journal.pone.0182936 28792537 PMC5549754 20. Fleischhauer K. Tanzarella S. Wallny H.J. Bordignon C. Traversari C. Multiple HLA-A alleles can present an immunodominant peptide of the human melanoma antigen Melan-A/MART-1 to a peptide-specific HLA-A*0201+ cytotoxic T cell line J. Immunol. 1996 157 787 797 10.4049/jimmunol.157.2.787 8752930 21. Fleischhauer K. Tanzarella S. Russo V. Sensi M.L. van der Bruggen P. Bordignon C. Traversari C. Functional heterogeneity of HLA-A*02 subtypes revealed by presentation of a MAGE-3-encoded peptide to cytotoxic T cell clones J. Immunol. 1997 159 2513 2521 10.4049/jimmunol.159.5.2513 9278345 22. Wang R.F. Johnston S.L. Southwood S. Sette A. Rosenberg S.A. Recognition of an antigenic peptide derived from tyrosinase-related protein-2 by CTL in the context of HLA-A31 and -A33 J. Immunol. 1998 160 890 897 10.4049/jimmunol.160.2.890 9551926 23. McGranahan N. Rosenthal R. Hiley C.T. Rowan A.J. Watkins T.B.K. Wilson G.A. Birkbak N.J. Veeriah S. Van Loo P. Herrero J. Allele-Specific HLA Loss and Immune Escape in Lung Cancer Evolution Cell 2017 171 1259 1271.e11 10.1016/j.cell.2017.10.001 29107330 PMC5720478 24. Horlock C. Stott B. Dyson J. Ogg G. McPherson T. Jones L. Sewell A.K. Wooldridge L. Cole D.K. Stebbing J. ELISPOT and functional T cell analyses using HLA mono-specific target cells J. Immunol. Methods 2009 350 150 160 10.1016/j.jim.2009.08.011 19729014 25. Jurtz V. Paul S. Andreatta M. Marcatili P. Peters B. Nielsen M. NetMHCpan-4.0: Improved Peptide-MHC Class I Interaction Predictions Integrating Eluted Ligand and Peptide Binding Affinity Data J. Immunol. 2017 199 3360 3368 10.4049/jimmunol.1700893 28978689 PMC5679736 26. Rammensee H. Bachmann J. Emmerich N.P. Bachor O.A. Stevanovic S. SYFPEITHI: Database for MHC ligands and peptide motifs Immunogenetics 1999 50 213 219 10.1007/s002510050595 10602881 27. Robbins P.F. Li Y.F. El-Gamil M. Zhao Y. Wargo J.A. Zheng Z. Xu H. Morgan R.A. Feldman S.A. Johnson L.A. Single and dual amino acid substitutions in TCR CDRs can enhance antigen-specific T cell functions J. Immunol. 2008 180 6116 6131 10.4049/jimmunol.180.9.6116 18424733 PMC2424230 28. Robinson J. Barker D.J. Georgiou X. Cooper M.A. Flicek P. Marsh S.G.E. IPD-IMGT/HLA Database Nucleic Acids Res. 2020 48 D948 D955 10.1093/nar/gkz950 31667505 PMC7145640 29. Kochenderfer J.N. Yu Z. Frasheri D. Restifo N.P. Rosenberg S.A. Adoptive transfer of syngeneic T cells transduced with a chimeric antigen receptor that recognizes murine CD19 can eradicate lymphoma and normal B cells Blood 2010 116 3875 3886 10.1182/blood-2010-01-265041 20631379 PMC2981541 30. Thomsen M. Lundegaard C. Buus S. Lund O. Nielsen M. MHCcluster, a method for functional clustering of MHC molecules Immunogenetics 2013 65 655 665 10.1007/s00251-013-0714-9 23775223 PMC3750724 31. Sette A. Sidney J. HLA supertypes and supermotifs: A functional perspective on HLA polymorphism Curr. Opin. Immunol. 1998 10 478 482 10.1016/S0952-7915(98)80124-6 9722926 32. Sidney J. Grey H.M. Kubo R.T. Sette A. Practical, biochemical and evolutionary implications of the discovery of HLA class I supermotifs Immunol. Today 1996 17 261 266 10.1016/0167-5699(96)80542-1 8962628 33. Reynisson B. Alvarez B. Paul S. Peters B. Nielsen M. NetMHCpan-4.1 and NetMHCIIpan-4.0: Improved predictions of MHC antigen presentation by concurrent motif deconvolution and integration of MS MHC eluted ligand data Nucleic Acids Res. 2020 48 W449 W454 10.1093/nar/gkaa379 32406916 PMC7319546 34. Bassan D. Gozlan Y.M. Sharbi-Yunger A. Tzehoval E. Eisenbach L. Optimizing T-cell receptor avidity with somatic hypermutation Int. J. Cancer 2019 145 2816 2826 10.1002/ijc.32612 31381134 35. Johnson L.A. Morgan R.A. Dudley M.E. Cassard L. Yang J.C. Hughes M.S. Kammula U.S. Royal R.E. Sherry R.M. Wunderlich J.R. Gene therapy with human and mouse T-cell receptors mediates cancer regression and targets normal tissues expressing cognate antigen Blood 2009 114 535 546 10.1182/blood-2009-03-211714 19451549 PMC2929689 36. Zhong S. Malecek K. Johnson L.A. Yu Z. Vega-Saenz de Miera E. Darvishian F. McGary K. Huang K. Boyer J. Corse E. T-cell receptor affinity and avidity defines antitumor response and autoimmunity in T-cell immunotherapy Proc. Natl. Acad. Sci. USA 2013 110 6973 6978 10.1073/pnas.1221609110 23576742 PMC3637771 37. Eiz-Vesper B. Schmetzer H.M. Antigen-Presenting Cells: Potential of Proven und New Players in Immune Therapies Transfus. Med. Hemother 2020 47 429 431 10.1159/000512729 33442337 PMC7768096 38. Kanaseki T. Blanchard N. Hammer G.E. Gonzalez F. Shastri N. ERAAP synergizes with MHC class I molecules to make the final cut in the antigenic peptide precursors in the endoplasmic reticulum Immunity 2006 25 795 806 10.1016/j.immuni.2006.09.012 17088086 PMC2746443 39. Serwold T. Gaw S. Shastri N. ER aminopeptidases generate a unique pool of peptides for MHC class I molecules Nat. Immunol. 2001 2 644 651 10.1038/89800 11429550 40. Hill A. Jugovic P. York I. Russ G. Bennink J. Yewdell J. Ploegh H. Johnson D. Herpes simplex virus turns off the TAP to evade host immunity Nature 1995 375 411 415 10.1038/375411a0 7760935 41. Wang Q. Douglass J. Hwang M.S. Hsiue E.H. Mog B.J. Zhang M. Papadopoulos N. Kinzler K.W. Zhou S. Vogelstein B. Direct Detection and Quantification of Neoantigens Cancer Immunol. Res. 2019 7 1748 1754 10.1158/2326-6066.CIR-19-0107 31527070 PMC6825591 42. Osawa R. Tsunoda T. Yoshimura S. Watanabe T. Miyazawa M. Tani M. Takeda K. Nakagawa H. Nakamura Y. Yamaue H. Identification of HLA-A24-restricted novel T Cell epitope peptides derived from P-cadherin and kinesin family member 20A J. Biomed. Biotechnol. 2012 2012 848042 10.1155/2012/848042 22778556 PMC3388625 43. Marincola F.M. Shamamian P. Alexander R.B. Gnarra J.R. Turetskaya R.L. Nedospasov S.A. Simonis T.B. Taubenberger J.K. Yannelli J. Mixon A. Loss of HLA haplotype and B locus down-regulation in melanoma cell lines J. Immunol. 1994 153 1225 1237 10.4049/jimmunol.153.3.1225 8027550 44. Marincola F.M. Shamamian P. Simonis T.B. Abati A. Hackett J. O’Dea T. Fetsch P. Yannelli J. Restifo N.P. Mule J.J. Locus-specific analysis of human leukocyte antigen class I expression in melanoma cell lines J. Immunother. Emphas. Tumor Immunol. 1994 16 13 23 10.1097/00002371-199407000-00002 PMC2561308 8081556 45. Xu X. Wang X. Fu B. Meng L. Lang B. Differentially expressed genes and microRNAs in bladder carcinoma cell line 5637 and T24 detected by RNA sequencing Int. J. Clin. Exp. Pathol. 2015 8 12678 12687 26722457 PMC4680402 46. Leibowitz M.S. Andrade Filho P.A. Ferrone S. Ferris R.L. Deficiency of activated STAT1 in head and neck cancer cells mediates TAP1-dependent escape from cytotoxic T lymphocytes Cancer Immunol. Immunother. 2011 60 525 535 10.1007/s00262-010-0961-7 21207025 PMC3426276 47. O’Donnell T.J. Rubinsteyn A. Bonsack M. Riemer A.B. Laserson U. Hammerbacher J. MHCflurry: Open-Source Class I MHC Binding Affinity Prediction Cell Syst. 2018 7 129 132.e4 10.1016/j.cels.2018.05.014 29960884 48. Assarsson E. Sidney J. Oseroff C. Pasquetto V. Bui H.H. Frahm N. Brander C. Peters B. Grey H. Sette A. A quantitative analysis of the variables affecting the repertoire of T cell specificities recognized after vaccinia virus infection J. Immunol. 2007 178 7890 7901 10.4049/jimmunol.178.12.7890 17548627 49. Busch D.H. Pamer E.G. MHC class I/peptide stability: Implications for immunodominance, in vitro proliferation, and diversity of responding CTL J. Immunol. 1998 160 4441 4448 10.4049/jimmunol.160.9.4441 9574549 50. Lazarski C.A. Chaves F.A. Jenks S.A. Wu S. Richards K.A. Weaver J.M. Sant A.J. The kinetic stability of MHC class II:peptide complexes is a key parameter that dictates immunodominance Immunity 2005 23 29 40 10.1016/j.immuni.2005.05.009 16039577 51. van der Burg S.H. Visseren M.J. Brandt R.M. Kast W.M. Melief C.J. Immunogenicity of peptides bound to MHC class I molecules depends on the MHC-peptide complex stability J. Immunol. 1996 156 3308 3314 10.4049/jimmunol.156.9.3308 8617954 52. Harndahl M. Rasmussen M. Roder G. Dalgaard Pedersen I. Sorensen M. Nielsen M. Buus S. Peptide-MHC class I stability is a better predictor than peptide affinity of CTL immunogenicity Eur. J. Immunol. 2012 42 1405 1416 10.1002/eji.201141774 22678897 53. Jorgensen K.W. Rasmussen M. Buus S. Nielsen M. NetMHCstab–predicting stability of peptide-MHC-I complexes; impacts for cytotoxic T lymphocyte epitope discovery Immunology 2014 141 18 26 10.1111/imm.12160 23927693 PMC3893846 54. Rasmussen M. Fenoy E. Harndahl M. Kristensen A.B. Nielsen I.K. Nielsen M. Buus S. Pan-Specific Prediction of Peptide-MHC Class I Complex Stability, a Correlate of T Cell Immunogenicity J. Immunol. 2016 197 1517 1524 10.4049/jimmunol.1600582 27402703 PMC4976001 55. Fasoulis R. Rigo M.M. Antunes D.A. Paliouras G. Kavraki L.E. Transfer learning improves pMHC kinetic stability and immunogenicity predictions Immunoinformatics 2024 13 100030 10.1016/j.immuno.2023.100030 38577265 PMC10994007 Figure 1 Transfection efficiency of transfectants. FACS and RT-PCR were performed to analyze HLA-A2 expression in COS-7-A2 cells ( a b Figure 2 TCR-T cells restricted by HLA-A*02:01 demonstrated the ability to recognize the target antigen peptide presented by members of the HLA-A2 supertype in COS-7 cells. IFN-γ secretion results of incubating TCR-T cells with COS-7-A2 cells loaded with different peptides ( a b p p Figure 3 Functional avidity of target antigen peptide presented by members of the HLA-A2 supertype. TCR-T cells were co-cultured with T2 cells ( a b f Figure 4 HLA-A*02:01-restricted TCR-T cells could recognize target antigen peptide presented by members of the HLA-A2 supertype in 586 mel cells. ( a t b c d p ",
  "metadata": {
    "Title of this paper": "Transfer learning improves pMHC kinetic stability and immunogenicity predictions",
    "Journal it was published in:": "Vaccines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474311/"
  }
}