{
  "title": "Paper_32",
  "abstract": "pmc Am J Case Rep Am J Case Rep 2001 amjcasereps amjcaserep The American Journal of Case Reports 1941-5923 International Scientific Information, Inc. PMC12490279 PMC12490279.1 12490279 12490279 41014585 10.12659/AJCR.949989 949989 1 Articles SMARCA4-Deficient Undifferentiated Carcinoma: A Report of 2 Cases Kim Sa-Hong 1 2 A B D E F Park Kyoyoung 1 2 D Kim Jane Chungyoon 1 2 D Kim Jeesun 1 2 D Park Do-Joong 1 2 3 D Lee Hyuk-Joon 1 2 3 D Yang Han-Kwang 1 2 3 D # Kwak Yoonjin 4 5 A B D E F Kong Seong-Ho 1 2 3 A B D E F  1  2  3  4  5 Corresponding Authors: Seong-Ho Kong, e-mail: seongho.kong@snu.ac.kr yoon131@snu.ac.kr A Study Design B Data Collection C Statistical Analysis D Data Interpretation E Manuscript Preparation F Literature Search G Funds Collection # Current affiliation: Center of Gastric Cancer, National Cancer Center, Goyang, South Korea 2025 27 9 2025 19 8 2025 26 478682 e949989 25 5 2025 06 8 2025 27 09 2025 03 10 2025 03 10 2025 © Am J Case Rep, 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This work is licensed under Creative Common Attribution-NonCommercial-NoDerivatives 4.0 International ( CC BY-NC-ND 4.0 Case series Patients: Female, 71-year-old • Male, 80-year-old Final Diagnosis: SMARCA4-deficient undifferentiated carcinoma of the stomach Symptoms: Weight loss Clinical Procedure: — Specialty: Gastroenterology and Hepatology Objective: Rare disease Background SMARCA4-deficient undifferentiated carcinoma (SMARCA4-DUC) is a rare and aggressive malignancy caused by inactivation of the SMARCA4 Initially identified in thoracic tumors, it is increasingly recognized in extrathoracic sites, including the gastrointestinal tract. These tumors often mimic other malignancies, such as poorly differentiated adenocarcinomas, malignant melanoma, hematolymphoid malignancies, or sarcomas, complicating diagnosis. Histologically, SMARCA4-DUC shows expression loss of BRG1 (the protein encoded by SMARCA4 Case Reports Case 1 was a 71-year-old woman with a 13.6-cm gastric tumor involving GE junction, with direct invasion to pancreas and transverse mesocolon. Initial impression suggested gastrointestinal stromal tumor (GIST) of stomach or sarcoma. Endoscopic biopsy followed by targeted next-generation sequencing revealed a pathogenic SMARCA4 Case 2 was an 80-year-old man with a 9.0-cm gastric tumor at cardia, directly invading the pancreas. Endoscopic biopsy revealed poorly differentiated tubular adenocarcinoma. Following laparoscopic gastrectomy, the specimen showed a predominantly undifferentiated malignant tumor with focal adenocarcinoma components. IHC demonstrated loss of BRG1 expression in the undifferentiated tumor component, confirming SMARCA4-DUC. He completed several cycles of adjuvant XELOX, without recurrence. Conclusions These 2 cases of SMARCA4-DUC of the stomach underscore the importance of molecular diagnostics and multidisciplinary management to avoid delayed diagnosis and to establish appropriate therapeutic strategies. Keywords SMARCA4 Protein, Human Undifferentiated Carcinoma Stomach Neoplasms pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction SMARCA4-deficient undifferentiated carcinoma (SMARCA4-DUC) is a rare (fewer than 100 SMARCA4-DUC cases have been reported [ 1 2 3 Initially identified in thoracic tumors, particularly in the mediastinum, SMARCA4-DUC is now increasingly recognized in extrathoracic sites, including the gastrointestinal tract, genitourinary system, and soft tissues [ 4 5 SMARCA4 Clinically, SMARCA4-DUC is characterized by rapid tumor progression, extensive local invasion, and poor prognosis due to its undifferentiated morphology and high proliferative potential. Patients often present symptoms such as pain, significant weight loss, and mass effect, reflecting the tumor’s aggressive and invasive nature. Among these, gastric SMARCA4-DUC is not only extremely rare, with SMARCA4 loss observed in less than 0.5% of gastric tumors, but also often mimics other malignancies such as poorly differentiated adenocarcinoma, gastrointestinal stromal tumor (GIST), lymphomas, metastatic melanoma, germ cell tumors, or sarcomas [ 6 Here, we report 2 rare cases of gastric SMARCA4-DUC with extensive local invasion and metastasis. These cases underscore the importance of early clinical suspicion, timely molecular diagnostics, and multidisciplinary management to prevent diagnostic delays and to guide appropriate therapeutic strategies for this rare gastric tumor. Case Reports Case 1 A 71-year-old woman presented with a 2-month history of nausea, dyspepsia, and significant weight loss. An initial gastroscopy at an outside hospital identified a 5-cm ulcerofungating mass at the gastroesophageal junction to the midbody along the greater curvature, raising suspicion for advanced gastric cancer. She received her last gastroscopy 2 or 3 years ago. Her medical history included hypertension and dyslipidemia, with a family history for her father’s gastric cancer. Endoscopic re-evaluation revealed a large ulcerofungating mass in the gastric cardia ( Figure 1A Figure 1B, 1C Figure 1D Endoscopic biopsy revealed a malignant tumor composed of round-to-epithelioid cells arranged in solid sheets without evidence of glandular or squamous differentiation ( Figure 2A Figure 2B Figure 2C The patient underwent total gastrectomy with lymph node dissection, distal pancreatectomy, and segmental colectomy. No pelvic seeding nodules were found during surgery. The postoperative course was complicated by transient bacteremia effectively managed with antibiotics and supportive care. A CT scan taken 1 week after surgery revealed multiple liver metastases ( Figure 3A–3D Case 2 An 80-year-old man with a history of hypertension, diabetes mellitus, chronic kidney disease (CKD), benign prostatic hyperplasia (BPH), and a 6 pack-year smoking history visited Seoul National University Hospital following the incidental discovery of a gastric mass during routine health screening. He reported general fatigue and a 5 kg weight loss over 1 month but denied significant abdominal pain or other specific symptoms. Gastroscopy performed at an outside hospital revealed a gastric tumor suspicious for Borrmann type III advanced gastric cancer (AGC) located in the gastric cardia ( Figure 4A Figure 4B, 4C Figure 4D The patient underwent laparoscopic total gastrectomy, distal pancreatectomy, and splenectomy. Postoperative recovery was complicated by a loculated fluid collection in the distal pancreatectomy bed and mild pleural effusion, both of which were managed conservatively with antibiotics and supportive care. Postoperative pathology confirmed a SMARCA4-deficient undifferentiated gastric carcinoma with a poorly differentiated tubular adenocarcinoma component (20%). Immunohistochemical staining revealed complete loss of SMARCA4 expression in the undifferentiated component, while expression was retained in the adenocarcinoma component ( Figure 5A–5C Table 1 Discussion SMARCA4-deficient undifferentiated carcinoma (SMARCA4-DUC) is a rare and underrecognized malignancy of the gastrointestinal tract, often leading to delayed diagnosis [ 1 5 Surgical resection remains the cornerstone of treatment; however, given the aggressive nature of SMARCA4-DUC, systemic therapy is generally required after surgery, even in resectable cases. While cytotoxic regimens such as paclitaxel-carboplatin and XELOX have shown potential for initial disease stabilization, no standardized treatment protocols have been established, and long-term outcomes remain unsatisfactory. Clinical courses vary considerably, as reflected in our 2 cases: one patient developed liver metastases shortly after surgery and was unable to proceed beyond the first cycle of chemotherapy due to poor general condition, whereas the other completed 5 cycles of adjuvant chemotherapy and remains recurrence-free under active surveillance. Interestingly, the latter case exhibited a 20% component of poorly differentiated tubular adenocarcinoma. Some undifferentiated carcinomas demonstrate focal glandular differentiation, implying a potential dedifferentiation from more differentiated gastric cancer subtypes. However, due to their rarity and aggressive nature, the prognostic implications of such histologic features remain poorly defined [ 6 Recent molecular studies have identified potential vulnerabilities in SMARCA4-DUC, including synthetic lethality with inhibition of epigenetic regulators such as bromodomain and extra-terminal motif (BET) proteins and enhancer of Zeste homolog 2 (EZH2), which are currently under clinical investigation [ 4 Accordingly, maintaining a high index of clinical suspicion and ensuring early referral for multidisciplinary evaluation are essential to improve diagnostic accuracy and therapeutic outcomes. Conclusions In cases where gastric tumors reveal an extensive and undifferentiated morphology, the differential diagnosis encompasses a broad spectrum of malignancies, including adenocarcinoma, GIST, lymphoma, melanoma, germ cell tumors, and sarcoma. SMARCA4-deficient undifferentiated carcinoma should be included as a potential entity, particularly in cases lacking lineage-specific features. BRG1 immunohistochemistry, along with clinicopathologic correlation, plays a key role in accurate identification. Multidisciplinary management should involve early consultation among surgeons, medical oncologists, pathologists, and radiologists to ensure accurate diagnosis, timely surgery, and initiation of systemic therapy and appropriate surveillance strategies. We report 2 rare cases of SMARCA4-DUC of the stomach, which initially mimicked other malignancies, resulting in diagnostic ambiguity. Despite similar preoperative presentations, the clinical outcomes differed significantly. These cases are novel in highlighting the importance of early recognition and in proposing a practical diagnostic and tailored management workflow for this rare and aggressive tumor. Further studies are warranted to clarify the prognostic implications of tumor biology, including the potential role of histologic heterogeneity. Conflict of interest: Declaration of Figures’ Authenticity: Financial support: References 1 Lin J Ren Q Liu B SMARCA4-deficient undifferentiated tumor with high quality of life and far exceeding predicted survival: A case report Medicine (Baltimore) 2024 103 31 e39045 39093728 10.1097/MD.0000000000039045 PMC11296419 2 Mehta A Bansal D Tripathi R Jajodia A SMARCA4/BRG1 protein-deficient thoracic tumors dictate re-examination of small biopsy reporting in non-small cell lung cancer J Pathol Transl Med 2021 55 5 307 16 34147056 10.4132/jptm.2021.05.11 PMC8476316 3 Le Loarer F Watson S Pierron G SMARCA4 inactivation defines a group of undifferentiated thoracic malignancies transcriptionally related to BAF-deficient sarcomas Nat Genet 2015 47 10 1200 5 26343384 10.1038/ng.3399 4 Zhou P Fu Y Wang W Gastric SMARCA4-deficient undifferentiated tumor (SMARCA4-UT): A clinicopathological analysis of four rare cases Orphanet J Rare Dis 2024 19 1 237 38877473 10.1186/s13023-024-03244-4 PMC11179226 5 An HR Kim HD Ryu MH Park YS SMARCA4-deficient undifferentiated gastric carcinoma: A case series and literature review Gastric Cancer 2024 27 5 1147 52 38772975 10.1007/s10120-024-01510-9 6 Shin J Park YS Unusual or Uncommon Histology of Gastric Cancer J Gastric Cancer 2024 24 1 69 88 38225767 10.5230/jgc.2024.24.e7 PMC10774758 Figure 1 Preoperative evaluations (Case 1) ( A B, C D Figure 2 Histologic and immunohistochemical features of SMARCA4-deficient undifferentiated carcinoma from endoscopic biopsy (Case 1) ( A B C Figure 3 Postoperative liver metastases (Case 1) ( A–D Figure 4 Preoperative evaluations (Case 2) ( A B, C D Figure 5 Histologic and immunohistochemical features of SMARCA4-deficient undifferentiated carcinoma with a focal adenocarcinoma component (Case 2) ( A B C Table 1 Comparison of clinical and pathological features of the two cases. Category Case 1 Case 2 Age/sex 71/Female 80/Male Medical history Hypertension, dyslipidemia Hypertension, type 2 diabetes, CKD, BPH, smoking Presenting symptoms Nausea, dyspepsia, weight loss Fatigue, weight loss Location Gastric cardia Gastric cardia Tumor size in CT 13.6×13.0×9.0 cm 9.0×7.4×4.6 cm Invasion in CT Pancreas, colon Pancreas tail Metastasis in CT None None Surgery Open total gastrectomy with distal pancreatectomy and segmental colectomy Laparoscopic total gastrectomy with distal pancreatectomy Pathology pT4bN0(0/12) M0 pT4bN2(4/62) M0 Immunohistochemistry (IHC) Loss of BRG1 Loss of BRG1 Metastasis after surgery Yes; No Chemo Paclitaxel + Carboplatin (1 cycle) XELOX (5 cycles) Outcome Transferred for hospice care Surveillance without recurrence CKD – chronic kidney disease; BPH – benign prostatic hyperplasia; CT – computed tomography; IHC – immunohistochemistry; XELOX – combination Xeloda ® ",
  "metadata": {
    "Title of this paper": "Unusual or Uncommon Histology of Gastric Cancer",
    "Journal it was published in:": "The American Journal of Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490279/"
  }
}