{
  "title": "Paper_504",
  "abstract": "pmc Front Cell Infect Microbiol Front Cell Infect Microbiol 1860 fcimb Front. Cell. Infect. Microbiol. Frontiers in Cellular and Infection Microbiology 2235-2988 Frontiers Media SA PMC12484166 PMC12484166.1 12484166 12484166 41040986 10.3389/fcimb.2025.1659729 1 Cellular and Infection Microbiology Original Research Characterization and immunoprotection of thioredoxin reductase TrxB knockout mutant of Salmonella Zhu Siping  1  † Wang Lili  1  † Li Hong  1 Li Chihuan  1 Zhu Xintong  1 Ren Chao  1 Liu Xiaochen  1 Dong Yulai  2 Shi Qiumei  1 Zhang Zhiqiang  1  *  1 Hebei key laboratory of preventive veterinary medicine, Hebei Normal University of Science & Technology Qinhuangdao China  2 Weichang Man and Mongolian Autonomous County Xinrui Agricultural Development Ltd. Chengde China Edited by: Sara María Soto, Instituto Salud Global Barcelona (ISGlobal), Spain Reviewed by: Pengpeng Xia  Mauro Saraiva  Shenye Yu *Correspondence: Zhiqiang Zhang, zhangzhiqiang87@hevttc.edu.cn †These authors have contributed equally to this work and share first authorship 17 9 2025 2025 15 481321 1659729 04 7 2025 01 9 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Zhu, Wang, Li, Li, Zhu, Ren, Liu, Dong, Shi and Zhang. 2025 Zhu, Wang, Li, Li, Zhu, Ren, Liu, Dong, Shi and Zhang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background  Salmonella S S Methods In this study, we generated a trxB S C50336 trxB trxB 50 in vivo trxB Results We found that deletion of trxB S trxB S trxB 50 trxB C50336 Conclusion These findings indicate that TrxB is a crucial virulence factor in S Salmonella TrxB gene deletion virulence vaccine The author(s) declare financial support was received for the research and/or publication of this article. This study was supported by Science and Technology Special Project for the Construction of Chengde National Innovation Demonstration Zones for Sustainable Development Agenda (202302F040), Natural Science Foundation of Hebei Province (C2024407005), Hebei Province High-level Talent Funding Program (C20231014), Special Funding Program for Basic Research of Universities from Hebei University of Science and Technology Normal College (2023JK14), Hebei Modern Agricultural Industry Technology System Beef Cattle Industry Innovation Team Disease Prevention and Control and Resistance Reduction Post (HBCT2023190201). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Molecular Bacterial Pathogenesis 1 Introduction  S Knodler and Elfenbein, 2019 S S Coburn et al., 2007 Quan et al., 2019 Takaya et al., 2019 The thioredoxin system (Trx) is a widespread antioxidant enzyme system found in all living organisms. It plays a crucial role in maintaining cellular redox balance and facilitating redox-mediated signal transduction ( Kanzok et al., 2001 Branco et al., 2014 Lu and Holmgren, 2014a Ren et al., 2018 Kreimer et al., 1997 Kuhns et al., 2015 Chupakhin and Krasavin, 2021 Salmonella Kobayashi, 2019 Salmonella SPI Kim et al., 2022 S S S 2 Materials and methods 2.1 Bacterial strains, cells and plasmids  S C50336 2 2 2.2 Experimental animals Kunming mice (6–8 weeks old) were purchased from Beijing Speifu Biotechnology Co., Ltd. (Beijing, China) and kept according to standard protocols for animal experiments. 2.3 Construction of a trxB S. Enteritidis The trxB cat  Table 1 C50336  Table 1 C50336 trxB cat cat C50336 trxB  Table 1 trxB trxB trxB trxB trxB trxB trxB trxB  Table 1 trxB Table 1 Primers used for constructing the mutant and the complemented strain. Primer Sequence (5’-3’) P1 CTCATGGGCACGACCAAACACAGTAAGCTGCTTATTCTGGGCTCAGGACCGTGTAGGCTGGAGCTGCTTCG P2 AAAGTCCGGCGATGTCCAGCGTCTCGATATTATCGCTCTGCTGCGTGTCGATGGGAATTAGCCATGGTCC P3 TATGTCCGCAGTTACGTTGGC P4 CAGGATACCTCTTACACCCTCACC P5 CG GGATCC P6 GC GTCGAC P7 CGATAGACCGAAACCCAGAG P8 GCGGAGGACAAAGACCAGTA 2.4 Growth curve analysis The strains were cultured overnight, and then transferred into LB and M9 medium with a 1:50 dilution on the next day, and cultured at 37°C with shaking at 180 rpm. M9 medium consists of 17 g Na 2 4 2 2 4 4 600 2.5 Bacterial motility assay Bacterial motility was analyzed on semi-solid plates following the method described in literature ( Duan et al., 2012 2.6 Detection of biofilm formation Referring to the literature ( Dong et al., 2011 570 Each strain was inoculated onto medium containing Congo red (160 mg/L) and Caulmers Brilliant Blue (10 mg/L), then incubated at 28°C for 48 hours. The morphology and color of the colonies of each strain were observed. Additionally, each strain was inoculated onto medium containing 200 mg/L fluorescent whitening agent and incubated at 28°C for 48 hours. The fluorescence intensity of the colonies was compared under D366 nm ultraviolet light to that of the fluorescent whitening agent alone, in order to analyze cellulose production in the biofilm. 2.7 Determination of minimum inhibitory concentration of various antimicrobials The minimum inhibitory concentration was determined following the Clinical and Laboratory Standards Institute guidelines ( Clinical and Laboratory Standards Institute, 2009 6 E. coli 2.8 Stress tolerance assay Bacterial stress tolerance was assessed by measuring the survival of each strain under stress conditions as previously described ( Bringer et al., 2005 2 2 2.9 Adhesion, invasion and intracellular survival assays The Caco-2BBE cells line, derived from colon adenocarcinoma, was used to assess bacterial adhesion and invasion abilities ( Kortman et al., 2012 For the invasion assay, the infection method was the same as that of the adhesion assay. After incubation for 1 h at 37 °C in a 5% CO 2 The bacterial intracellular survival in macrophage was determined using cell line RAW264.7, a mouse macrophage cell line. Similar to the adhesion and invasion assays, RAW264.7 cells were infected with bacteria at a MOI of 100 and cells were incubated for 1h and then the medium was switched to DMEM containing gentamicin (100 μg/mL) to continue incubation. The cells were lysed at 3 and 23 hours post-infection (hpi), and the lysates were collected for bacterial enumeration. Bacterial survival and proliferation within macrophages were determined by calculating the ratio of bacterial counts at 23 hpi to those at 3 hpi. 2.10 Bacterial virulence evaluation Fifty-five Kunming mice were randomly divided into 11 groups, with 5 mice in each group. Five groups were i.p. challenged with C50336 8 4 trxB 10 6 50 Park et al., 2020 To determine the bacterial load in the primary target organs of S S trxB 6 2.11 Transcriptome analysis The C50336 trxB 600nm trxB C50336 2.12 RNA extraction and quantitative real-time PCR RNA was extracted using the Bacterial RNA Extraction Kit (Beijing Aide Biotechnology Co., Ltd., China). gDNA was eliminated during extraction using DNase I from the same company, and reverse transcription was performed using the Reverse Transcription Kit (Bohang Biotechnology Co., Ltd., China). RT-qPCR was performed using SYBR ® -ΔΔCt C50336  Table 2 Table 2 Primers used for qPCR. Primers Nucleotide sequences (5′-3′)  rpoS- TTTTTCATCGGCCAGGATGT  rpoS- CGCTGGGCGGTGATTC  csgD- GCCTCATATTAACGGCGTG  csgD- AGCGGTAATTTCCTGAGTGC  bcsA- TGGAAGGGCAGAAAGTGAAT  bcsA- GCCCAGCTTCAGAATATCCA  ompR- TGTGCCGGATCTTCTTCCA  ompR- CTCCATCGACGTCCAGATCTC  pipB- GCTCCTGTTAATGATTTCGCTAAAG  pipB- GCTCAGACTTAACTGACACCAAACTAA  hflK- AGCGCGGCGTTGTGA  hflK- TCAGACCTGGCTCTACCAGATG rfbHF ACGGTCGGTATTTGTCAACTCA rfbHR TCGCCAACCGTATTTTGCTAA Primers Nucleotide sequences (5′-3′)  spvB- TGGGTGGGCAACAGCAA  spvB- GCAGGATGCCGTTACTGTCA  flgG- GCGCCGGACGATTGC  flgG- CCGGGCTGGAAAGCATT  invH- CCCTTCCTCCGTGAGCAAA  invH- TGGCCAGTTGCTCTTTCTGA  sodC- CACATGGATCATGAGCGCTTT  sodC- CTGCGCCGCGTCTGA  ssaV-F GCGCGATACGGACATATTCTG  ssaV- TGGGCGCCACGTGAA 16SF CCAGGGCTACACACGTGCTA 16SR TCTCGCGAGGTCGCTTCT 2.13 Measurement of immunoprotective efficacy Thirty Kunming mice were randomly divided into two groups: an immunized group and a control group. The immunized group received orally of the Δ trxB trxB 8 Serum-specific IgG assay: Indirect ELISA was employed to assess the level of S C50336 450nm Spleen index determination: Three mice were randomly selected and weighed on the 7th, 14th, 21st, and 28th days after immunization, and the spleens were picked up and weighed after euthanasia for calculation of the spleen index. The spleen index was calculated by dividing the spleen weight by the body weight of the mouse as a percentage. Lymphocyte proliferation assay: Three immunized or non-immunized mice were euthanized 14 days after immunization. The spleens of the immunized mice were aseptically isolated and homogenized. The homogenate was then filtered through a 70 μm cell strainer (Beijing Labgic Technology Co., Ltd.) to obtain spleen cells. Red blood cells were lysed using a red blood cell lysis buffer (Beijing Solarbio Science & Technology Co., Ltd.). The spleen lymphocytes were suspended in RPMI 1,640 Medium(Thermo Fisher Scientific Co., Ltd.) supplemented with 10% fetal bovine serum (FBS), 50 μg/mL penicillin, and 50 μg/mL streptomycin. Cell viability was assessed using the trypan blue exclusion test, and cells were counted using a haemocytometer. After cell counting, lymphocytes were seeded into 96-well tissue culture plate at 5×10 5 2 450 450 450 450 Relative protection measurement: Twenty KM mice were randomly divided into two groups, each containing 10 mice. Group A was the immunization group, and Group B was the control group. Mice in Group A were received orally with 1.3 × 10 8 trxB C50336 8 2.14 Ethics statement All animal experiments were conducted in full compliance with international ethical standards and the Experimental Animal Regulation Ordinances (HPDST 2020-17) as stipulated by the Hebei Provincial Department of Science and Technology. The study protocol was reviewed and approved by the Animal Care and Use Committee of Hebei Normal University of Science and Technology. 2.15 Statistical analysis The significance of the differences between C50336 trxB 3 Results 3.1 The trxB S Using λ-Red recombination technology, a trxB S C50336 trxB trxB trxB  Figure 1A trxB trxB S  Figures 1B, C trxB S Figure 1 Generation of trxB (A) trxB trxB C50336 trxB trxB trxB C50336 trxB (B) C50336 trxB trxB trxB (C) C50336 trxB trxB trxB A composite image showing three panels. Panel A: Gel electrophoresis image with a DNA ladder and three samples labeled M, 1, 2, and 3, showing distinct bands between one thousand and three thousand base pairs. Panel B: Line graph depicting bacterial growth in LB broth over ten hours with three lines representing C50336 3.2 The trxB S The results of the motility skill assessment showed (  Figure 2A trxB C50336 trxB trxB trxB trxB  Figure 2B trxB S Figure 2 Motiity analysisi of each strain. (A) (B) Three petri dishes show bacterial growth for C50336 C50336 3.3 The trxB S The biofilm formation ability of C50336 trxB trxB trxB  Figure 3A trxB C50336 trxB trxB trxB trxB trxB  Figure 3B trxB 570nm Figure 3 Biofilm formation capacity and composition analysis. (A) (B) (C) (D) A set of four panels showing biofilm formation and characteristics of strains C50336 In order to clarify which components of the biofilm were affected by trxB  Figure 3C trxB C50336 trxB trxB trxB trxB C50336 trxB trxB trxB  Figure 3D S 3.4 TrxB plays an important role in the drug resistance of S The antibiotic sensitivity of the strains was assessed by MIC determination (  Table 3 trxB S Table 3 MIC of trxB Drug name C50336 Δ trxB Fold change Cefotaxime Sodium 0.0625 0.015625 4 Cefuroxim 0.03125 0.0078125 4 Penicillin 8 1 8 Ampicillin 0.03125 0.0078125 4 Paediatric Compound 3200 800 4 Norfloxacin 0.03125 0.0078125 4 Ciprofloxacin 0.03125 0.0078125 4 Enrofloxacin 0.03125 0.0078125 4 Ofloxacin 0.0625 0.015625 4 Lincomycin 800 200 4 Mequindox 8 1 8 Fosfomycin 64 16 4 3.5 TrxB regulates the stress response of S The environmental tolerance results showed (  Figures 4A–F rxB C50336 trxB trxB trxB S Figure 4 Bacterial stress-tolerance analysis. (A) (B) (C) (D) (E) (F) Bar graphs labeled A to F show survival rates for strains C50336 3.6 The trxB S Using Caco-2 and RAW264.7 cell models, we tested the adhesion, invasion and intracellular survival abilities of the Δ trxB  Figures 5A, B trxB C50336 trxB C50336 trxB  Figure 5C S Figure 5 Adhesion, invasion and intracellular survival analysis of each strain. (A) (B) (C) Bar charts comparing bacterial ratio in “Caco-2” cells and proliferation ratio in “RAW246.7” cells for different conditions: C50336 3.7 Deletion of the trxB S The pathogenicity results of the Δ trxB  Table 4 50 C50336 6 trxB 8 in vivo  Figure 6 trxB C50336 trxB C50336 trxB S Table 4 LD 50 C50336 trxB Strain Inoculation dose (CFU/mouse) No. of deaths/total no. of mice LD 50 C50336 2.1×10 8 5/5 3.98×10 6 2.1×10 7 4/5 2.1×10 6 4/5 2.1×10 5 0/5 2.1×10 4 0/5 ΔtrxB 1.3×10 10 5/5 5.13×10 8 1.3×10 9 2/5 1.3×10 8 0/5 1.3×10 7 0/5 1.3×10 6 0/5 Figure 6 Distribution of bacteria in Kunming (KM) mice post infection. At 6 h and 48 h post-intraperitoneal injection of C50336 trxB Bar graph depicting bacterial counts in liver, spleen, and lung organs measured in log base ten colony-forming units. Four conditions are shown: C50336 C50336 C50336 3.8 The trxB RNA-seq analysis identified 1561 differentially expressed genes (DEGs) in C50336 trxB  Figure 7A Figure 7 DEGs screening by RNA-seq and virulence gene expression analysis. (A) (B) C50336 trxB trxB trxB Panel A shows a volcano plot with data points indicating gene expression changes, with significant upregulated genes in red and downregulated genes in blue. Panel B consists of three bar graphs showing relative fold changes in gene expression for various strains, labeled C50336 Among these DEGs, we selected virulence-related genes and confirmed their expression levels by PCR. The results showed (  Figure 7B rpoS csgD bcsA ompR pipB hflK rfbH spvB flgG ssrA sodC saV trxB S 3.9 Deletion of the trxB The mice were immunized with Δ trxB C50336  Figure 8A  Figure 8B trxB trxB C50336 Figure 8 Determination of immunoprotective effect of the Δ trxB (A) trxB C50336 8 (B) (C) trxB (D) (E) Diagram featuring multiple panels: A) Experimental timeline for KM mice involving vaccination and infection with C50336 C50336 Mouse blood serum was collected at different times after immunization for the detection of IgG antibody levels. The results showed (  Figure 8C trxB trxB Mouse spleens were collected at various time points after immunization to measure the splenic index. Results (  Figure 8D  Figure 8E 4 Discussion Thioredoxin reductase catalyzes the reduction of thioredoxin. It plays critical roles in thioredoxin-mediated redox homeostasis, cellular homeostasis, and oxidative stress tolerance ( Lu and Holmgren, 2014b Kwon et al., 2003 Mohammadi et al., 2019 S trxB S trxB S The thioredoxin system regulates cell growth and death in mammals through redox regulation ( Kwon et al., 2003 She et al., 2023 trxB S Thioredoxin reductase can help organisms cope with oxidative stress by alleviating oxidative damage, which has been demonstrated in a variety of cancer cells and bacteria ( Serata et al., 2012 He et al., 2023 Uziel et al., 2004 Birk et al., 2012 trxB S Biofilm is an important accessory structure that helps bacteria survive harsh environments. It has also been reported to be closely associated with virulence ( Karygianni et al., 2020 Salmonella Chen and Wang, 2020 trxB trxB trxB S The oxidative stress tolerance is closely related to bacterial virulence, and as a key system regulating bacterial redox homeostasis, thioredoxin system’s involvement in bacterial virulence regulation has been demonstrated in Edwardsiell Mycobacterium tuberculosis Olson et al., 2013 Acinetobacter baumannii May et al., 2019 Salmonella Bjur et al., 2006 S 50 S Yang et al., 2024 trxB S SPI Storz et al., 1990 SPI spvB pipB csgD bcsA ompR In S Siddique et al., 2024 trxB S trxB S S 5 Conclusion These studies indicate that TrxB is an important virulence factor of S trxB Acknowledgments We would also like to thank Guanxin Hou, Xinyi Sun, Fuqiang Guo, Yong Tao and Rui An for their help with this study. Data availability statement The datasets presented in this study can be found in online repositories. The names of the repository/repositories and accession number(s) can be found in the article/  Supplementary Material Ethics statement The animal study was approved by The animal studies were approved by All animal experiments were conducted in full compliance with international ethical standards and the Experimental Animal Regulation Ordinances (HPDST 2020-17) as stipulated by the Hebei Provincial Department of Science and Technology. The study protocol was reviewed and approved by the Animal Care and Use Committee of Hebei Normal University of Science and Technology. The studies were conducted in accordance with the local legislation and institutional requirements. The study was conducted in accordance with the local legislation and institutional requirements. Author contributions SZ: Conceptualization, Data curation, Methodology, Writing – original draft, Writing – review & editing. LW: Conceptualization, Data curation, Methodology, Writing – original draft, Writing – review & editing. HL: Conceptualization, Writing – original draft, Writing – review & editing. CL: Conceptualization, Writing – original draft, Writing – review & editing. XZ: Formal Analysis, Writing – original draft, Writing – review & editing. CR: Formal Analysis, Writing – original draft, Writing – review & editing. XL: Formal Analysis, Writing – original draft, Writing – review & editing. YD: Funding acquisition, Investigation, Supervision, Validation, Writing – original draft, Writing – review & editing. QS: Funding acquisition, Investigation, Supervision, Validation, Writing – original draft, Writing – review & editing. ZZ: Funding acquisition, Investigation, Supervision, Validation, Writing – original draft, Writing – review & editing. Conflict of interest Authors YD was employed by Weichang Man and Mongolian Autonomous County Xinrui Agricultural Development Ltd. The remaining authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fcimb.2025.1659729/full#supplementary-material References Birk T. Wik M. T. Lametsch R. Knøchel S 2012 Acid stress response and protein induction in Campylobacter jejuni BMC Microbiol. 12 174 10.1186/1471-2180-12-174 22889088 PMC3528441 Bjur E. Eriksson-Ygberg S. Aslund F. Rhen M. 2006 Thioredoxin 1 promotes intracellular replication and virulence of Salmonella Infect. Immun. 74 5140 5151 10.1128/IAI.00449-06 16926406 PMC1594827 Branco V. Godinho-Santos A. Gonçalves J. Lu J. Holmgren A. Carvalho C. 2014 Mitochondrial thioredoxin reductase inhibition, selenium status, and Nrf-2 activation are determinant factors modulating the toxicity of mercury compounds Free Radic. Biol. Med. 73 95 105 10.1016/j.freeradbiomed.2014.04.030 24816296 Bringer M. A. Barnich N. Glasser A. L. Bardot O. Darfeuille-Michaud A 2005 HtrA stress protein is involved in intramacrophagic replication of adheren and invasive Escherichia coli Infect. Immun. 73 712 721 10.1128/IAI.73.2.712-721.2005 15664909 PMC546957 Chen J. Wang Y. 2020 Genetic determinants of Salmonella Int. J. Food Microbiol. 320 108524 10.1016/j.ijfoodmicro.2020.108524 32000116 Chupakhin E. Krasavin M. 2021 Thioredoxin reductase inhibitors: updated patent review (2017-present) Expert Opin. Ther. Pat. 31 745 758 10.1080/13543776.2021.1899160 33666133 Clinical and Laboratory Standards Institute 2009 Performance standards for antimicrobial susceptibility testing; 19th informational supplement CLSI document M100-S19 Wayne, PA Clinical and Laboratory Standards Institute Coburn B. Grassl G. A. Finlay B. B. 2007  Salmonella Immunol. Cell Biol. 85 112 118 10.1038/sj.icb.7100007 17146467 Dong H. Peng D. Jiao X. Zhang X. Geng S. Liu X. 2011 Roles of the spiA gene from Salmonella Microbiology. 157 1798 1805 10.1099/mic.0.046185-0 21415117 PMC3167914 Duan Q. Zhou M. Zhu X. Bao W. Wu S. Ruan X. 2012 The flagella of F18ab Escherichia coli in vitro Vet. Microbiol. 160 132 140 10.1016/j.vetmic.2012.05.015 22658629 He J. Liu S. Fang Q. Gu H. Hu Y 2023 The thioredoxin system in edwardsiella piscicida contributes to oxidative stress tolerance, motility, and virulence Microorganisms 11 4 827 10.3390/microorganisms11040827 37110252 PMC10145099 Kanzok S. M. Fechner A. Bauer H. 2001 Substitution of the thioredoxin system for glutathione reductase in Drosophila melanogaster Science 291 643 646 10.1126/science.291.5504.643 11158675 Karygianni L. Ren Z. Koo H. Thurnheer T 2020 Biofilm matrixome: extracellular components in structured microbial communities Trends Microbiol. 28 668 681 10.1016/j.tim.2020.03.016 32663461 Kim J. S. Liu L. Davenport B. Kant S. Morrison T. E. Vazquez-Torres A. 2022 Oxidative stress activates transcription of Salmonella J. Biol. Chem. 298 102130 10.1016/j.jbc.2022.102130 35714768 PMC9270255 Knodler L. A. Elfenbein J. R. 2019 Salmonella enterica Trends Microbiol. 27 964 965 10.1016/j.tim.2019.05.002 31160162 Kobayashi K. 2019 Inactivation of inhibits biofilm formation by activating the disulfide stress regulator Spx in Bacillus subtilis J. Bacteriology 201 15 21 10.1128/JB.00712-18 30718304 PMC6436345 Kortman G. A. M. Boleij A. Swinkels D. W. Tjalsma H. 2012 Ironavailability increases the pathogenic potential of Salmonella PloS One 7 e29968 10.1371/journal.pone.0029968 22272265 PMC3260200 Kreimer S. Sohling B. Andreesen J. R. 1997 Two closely linked genes encoding thioredoxin and thioredoxin reductase in Clostridium Arch. Microbiol. 168 328 337 10.1007/s002030050506 9297471 Kuhns L. G. Wang G. Maier R. J. 2015 Comparative roles of the two Helicobacter pylori Infection Immun. 83 2935 2943 10.1128/IAI.00232-15 25964471 PMC4468550 Kwon Y. W. Masutani H. Nakamura H. 2003 Redox regulation of cell growth and cell death Biol. Chem. 384 991 996 10.1515/BC.2003.111 12956415 Lu J. Holmgren A. 2014 The thioredoxin antioxidant system Free Radic. Biol. Med. 66 75 87 10.1016/j.freeradbiomed.2013.07.036 23899494 Lu J. Holmgren A. 2014 The thioredoxin antioxidant system Free Radic. Biol. Med. 66 75 87 10.1016/j.freeradbiomed.2013.07.036 23899494 May H. C. Yu J. J. Zhang H. 2019 Thioredoxin-A is a virulence factor and mediator of the type IV pilus system in Acinetobacter baumannii PloS One 14 e218505 10.1371/journal.pone.0218505 31265467 PMC6605650 Mohammadi F. Soltani A. Ghahremanloo A. Javid H. Hashemy S. I 2019 The thioredoxin system and cancer therapy: a review Cancer Chemother. Pharmacol. 84 925 935 10.1007/s00280-019-03912-4 31367788 Olson A. L. Neumann T. S. Cai S. Sem D. S 2013 Solution structures of Mycobacterium tuberculosis Proteins. 81 675 689 10.1002/prot.24228 23229911 PMC3620657 Park S. Jung B. Kim E. Hong S.-T. Yoon H. Hahn T.-W. 2020  Salmonella salmonella Front. Immunol. 11 1277 10.3389/fimmu.2020.01277 32655567 PMC7324483 Quan G. Xia P. Zhao J. Zhu C. Meng X. Yang Y. 2019 Fimbriae and related receptors for Salmonella Microb. Pathog. 126 357 362 10.1016/j.micpath.2018.10.025 30347261 Ren X. Zou L. Lu J. Holmgren A 2018 Selenocysteine in mammalian thioredoxin reductase and application of ebselen as a therapeutic Free Radic. Biol. Med. 127 238 247 10.1016/j.freeradbiomed.2018.05.081 29807162 Serata M. Iino T. Yasuda E. Sako T 2012 Roles of thioredoxin and thioredoxin reductase in the resistance to oxidative stress in Lactobacillus casei Microbiol. (Reading) 158 953 962 10.1099/mic.0.053942-0 22301908 She W. Shi X. Liu T. Liu Y. Liu Y 2023 Discovery of novel organoarsenicals as robust thioredoxin reductase inhibitors for oxidative stress mediated cancer therapy Biochem. Pharmacol. 218 115908 10.1016/j.bcp.2023.115908 37931662 Siddique A. Wang Z. Zhou H. Huang L. Jia C. Wang B. 2024 The Evolution of Vaccines Development across Salmonella Serovars among Animal Hosts: A Systematic Review Vaccines (Basel) 12 10.3390/vaccines12091067 39340097 PMC11435802 Storz G. Tartaglia L. A. Ames B. N. 1990 Transcriptional regulator of oxidative stress-inducible genes: direct activation by oxidation Science. 248 189 194 10.1126/science.2183352 2183352 Takaya A. Yamamoto T. Tokoyoda K. 2019 Humoral immunity vs. Salmonella Front. Immunol. 10 3155 10.3389/fimmu.2019.03155 32038650 PMC6985548 Uziel O. Borovok I. Schreiber R. Cohen G. Aharonowitz Y 2004 Transcriptional regulation of the Staphylococcus aureus J. Bacteriol. 186 326 334 10.1128/JB.186.2.326-334.2004 14702300 PMC305758 Yang B. Lin Y. Huang Y. Shen Y. Q. Chen Q 2024 Thioredoxin (Trx): A redox target and modulator of cellular senescence and aging-related diseases Redox Biol. 70 103032 10.1016/j.redox.2024.103032 38232457 PMC10827563 ",
  "metadata": {
    "Title of this paper": "Thioredoxin (Trx): A redox target and modulator of cellular senescence and aging-related diseases",
    "Journal it was published in:": "Frontiers in Cellular and Infection Microbiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484166/"
  }
}