{
  "title": "Paper_810",
  "abstract": "Neurol Clin Pract Neurol Clin Pract 1965 ncp neucp NEURCLINPRACT Neurology: Clinical Practice 2163-0402 2163-0933 American Academy of Neurology PMC11195434 PMC11195434.1 11195434 11195434 38919929 10.1212/CPJ.0000000000200323 CPJ-2023-000546 1 3 25 355 357 Research Article Association of the Area Deprivation Index With Dementia Basic Workup and Diagnosis in Central and Western Virginia A Cross-Sectional Study https://orcid.org/0000-0001-6786-555X D'Abreu Anelyssa MD, PhD MPH https://orcid.org/0000-0001-8585-4643 Bankole Azziza MD, DFAPA https://orcid.org/0000-0002-8608-1352 Kapur Jaideep MBBS, PhD https://orcid.org/0000-0003-4205-2485 Manning Carol A. PhD, ABPP-CN https://orcid.org/0000-0002-4664-3517 Chernyavskiy Pavel PhD Departments of Neurology (ADA, CAM, JK), Neuroscience (JK), and Public Health Sciences (PC), University of Virginia, Charlottesville; Department of Psychiatry and Behavioral Health (AB), Virginia Tech Carilion School of Medicine, Roanoke. Correspondence ad9rn@virginia.edu Funding information and disclosures are provided at the end of the article. Full disclosure form information provided by the authors is available with the full text of this article at Neurology.org/cp Submitted and externally peer-reviewed. The handling editor was Associate Editor Jack W. Tsao, MD, DPhil, FAAN. 10 2024 10 6 2024 14 5 464652 e200323 21 12 2023 02 4 2024 01 10 2025 01 10 2025 25 06 2024 01 10 2025 © 2024 American Academy of Neurology 2024 American Academy of Neurology Background and Objectives The Area Deprivation Index (ADI) provides a validated and multidimensional metric of areal disadvantage. Our goals were to determine if the ADI influences the likelihood of receiving workup based on published guidelines and an etiologic diagnosis of dementia in Central and Western Virginia. Methods We collected deidentified data from the electronic health record of individuals aged 50–105 years diagnosed with dementia at the University of Virginia (UVA) Medical Center (2016–2021) and at Carillion Clinic (2018–2021). Visit-specific ICD-10 codes were used to classify each dementia diagnosis as “disease-specific” (e.g., Alzheimer disease) or “general” (e.g., unspecified dementia). Following the American Academy of Neurology guidelines, we considered the evaluation performed as “adequate” if patients had vitamin B12, thyroid-stimulating hormone, and brain CT or magnetic resonance imaging within 6 months of the initial diagnosis. Census tract ADI was linked to study participants using the unique census tract identifier derived from the participants' home addresses at the time of diagnosis. Statistical modeling occurred under a Bayesian paradigm implemented using a standard code in R. Results The study included 13,431 individuals diagnosed with dementia at UVA (n = 7,152) and Carillion Clinic (n = 6,279). Of those, 32.5% and 20.4% received “disease-specific” diagnoses at UVA and Carillion Clinic and 8.2% and 20.4% underwent “adequate” workup, respectively. The adjusted relationship between census tract ADI and the likelihood of a disease-specific diagnosis was U-shaped: Residence in moderately disadvantaged areas was associated with the lowest likelihood of disease-specific diagnosis. Discussion Most patients diagnosed with dementia did not receive an adequate evaluation or an etiologic diagnosis. Those living in locations just above the national median ADI levels had the lowest likelihood of receiving an etiologic diagnosis, lower than those in the least and most deprived areas. Renewed awareness efforts among providers are needed to increase compliance with diagnostic guidelines. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Association of the Area Deprivation Index With Dementia Basic Workup and Diagnosis in Central and Western Virginia",
    "Journal it was published in:": "Neurology: Clinical Practice",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11195434/"
  }
}