{
  "title": "Paper_414",
  "abstract": "pmc Cancer Sci Cancer Sci 2682 cas CAS Cancer Science 1347-9032 1349-7006 Wiley PMC12485868 PMC12485868.1 12485868 12485868 40702751 10.1111/cas.70150 CAS70150 CAS-OA-0307-2025.R1 1 Original Article ORIGINAL ARTICLE Cell, Molecular, and Stem Cell Biology Intrinsic PDL1 TGFBI Nguyen Thi Thanh Nha  1 Chen Pei‐Yu  2 Zheng Ming‐Yi  2 Lin Ting‐Kuang  2 Wang Chun‐Chao  1 Chen Yuh‐Min  3 Chou Yu‐Ting https://orcid.org/0000-0001-9274-8603  2 ytchou@life.nthu.edu.tw   1 Institute of Molecular Medicine, National Tsing Hua University Hsinchu Taiwan   2 Institute of Biotechnology, National Tsing Hua University Hsinchu Taiwan   3 Department of Chest Medicine Taipei Veterans General Hospital, and School of Medicine, National Yang Ming Chiao Tung University Taipei Taiwan * Correspondence: ytchou@life.nthu.edu.tw 23 7 2025 10 2025 116 10 498068 10.1111/cas.v116.10 2737 2749 28 6 2025 06 2 2025 10 7 2025 23 07 2025 02 10 2025 02 10 2025 © 2025 The Author(s). Cancer Science https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Programmed death ligand 1 (PDL1) suppresses T‐cell immunity by engaging programmed cell death protein 1 (PD1), and its blockade can activate T‐cell responses. Although PDL1 is a transmembrane protein, its intrinsic signaling role in regulating oncogenesis remains unclear. Our study reveals lung adenocarcinomas (ADCs) exhibit deficient PDL1 PDL1 PDL1 PDL1 PDL1 PDL1 TGFBI TGFBI CITED2 p21  CIP1 PDL1 TGFBI CITED2 p21  CIP1 CITED2 p21  CIP1 PDL1 p21  CIP1 PDL1 Programmed death ligand 1 (PDL1) is known for suppressing T‐cell immunity, but its intrinsic role in oncogenesis remains unclear. This study demonstrates that PDL1 expression in lung adenocarcinoma (ADC) inhibits tumor cell growth by reducing FAK activation and regulating the CITED2‐p21 CIP1 cell growth arrest cellular signaling lung adenocarcinoma PDL1 TGF‐β signaling National Science and Technology Council 10.13039/501100020950 109‐2320‐B‐007‐003‐MY3 112‐2320‐B‐007‐005 National Tsing Hua University 10.13039/501100005057 112DFA0400007 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  Funding: Abbreviations ADC Adenocarcinoma ATCC American Type Culture Collection CPTAC Clinical Proteomic Tumor Analysis Consortium ECM Extracellular matrix EMT Epithelial‐mesenchymal transition FAK Focal adhesion kinase NSCLC Non‐small cell lung cancer PD1 Programmed cell death protein 1 PDL1 Programmed death ligand 1 RNA‐seq RNA‐sequencing SCC Squamous cell carcinoma TCGA The Cancer Genome Atlas TGF‐β Transforming growth factor‐beta TGFBI Transforming growth factor beta‐induced TGFBR2 Transforming growth factor‐beta receptor 2 1 Introduction Programmed death ligand 1 (PDL1), also known as B7‐H1 or CD274, is a transmembrane protein expressed on both tumor cells and normal tissues [ 1 2 3 4 5 The regulation of PDL1 expression is complex and influenced by various cytokines and growth factors, which complicates its role as an immunotherapeutic biomarker [ 6 7 8 9 10 11 12 TGF‐β inhibits the growth of lung cancer cells by modulating MYC‐mediated transcription and inducing p21 CIP1 CITED2 13 CIP1 14 15 16 17 18 19 20 21 This study explores the independent role of PDL1 in lung adenocarcinoma (ADC) beyond its interaction with PD1 on CD8+ T cells. Our findings indicate that PDL1 deficiency in ADCs is associated with poor prognosis in patients and that PDL1 knockdown promotes lung cancer cell growth. Gene expression profiling revealed that TGFBI regulates the PDL1‐mediated growth‐suppressive effect by interfering with FAK‐CITED2 signaling in lung cancer cells. Our data characterized a novel PDL1‐mediated growth suppression pathway in cancer cells that operates independently of the PD1‐mediated immune response. 2 Materials and Methods 2.1 Cell Culture CL1‐5 cells were established as previously described [ 22 23 2.2 Plasmids PDL1 and TGFBI cDNAs (Sino Biological) were subcloned into HR' vectors. shRNAs targeting PDL1 TGFBI FAK CITED2 TP53 S1 22 24 2.3 Conditioned Medium Preparation HEK293T cells were transduced with TGFBI 2.4 Clonogenic Assay Cells (500/well) were seeded in 6‐well plates and cultured in standard or CM‐supplemented medium for 14 days. Colonies were fixed, stained with 0.25% crystal violet, and quantified using ImageJ. 2.5 Cell Detachment Assay Cells (3 × 10 5 2.6 Quantitative Real‐Time PCR qRT PCR Gene expression was measured using the Universal Probe Library (Roche) on a StepOnePlus system (Applied Biosystems). RNA18S served as the reference gene. Primers and probes are listed in Table S2 2.7 Immunoblotting Cells were lysed in RIPA buffer supplemented with protease and phosphatase inhibitors. Protein lysates were subjected to SDS‐PAGE and transferred to PVDF membranes, followed by immunoblotting with the following primary antibodies: PDL1 (Cell Signaling Technology, #13684), TGFBI (GeneTex, GTX100744), phospho‐FAK (Tyr397; Cell Signaling Technology, #3283), total FAK (Cell Signaling Technology, #3285), phospho‐AKT (Ser473; Cell Signaling Technology, #4060P), total AKT (GeneTex, GTX121937), phospho‐ERK1/2 (Thr202/Tyr204; Cell Signaling Technology, #4370S), total ERK (GeneTex, GTX59618), p21 CIP1 2.8 Flow Cytometry Analysis Cells were fixed in 70% ethanol, stained with PI or DAPI, and analyzed for cell cycle distribution (APOLO Biochemical). 2.9 Public Domain Data Analysis Gene expression profiling and RNA sequencing (RNA‐seq) datasets were analyzed based on previously described methods [ 12 PDL1 25 26 27 PDL1 PDL1 PDL1 TGFBI CITED2 p21  CIP1 TGFBR2 GSE30219 S3 2.10 Statistical Analysis Statistical significance was assessed using Student's t 3 Results 3.1 Deficient  PDL1 We explored the clinical significance of PDL1 PDL1 PDL1 PDL1 1A PDL1 1B 1C PDL1 FIGURE 1 Loss of PDL1 PDL1 p p PDL1 PDL1 p PDL1 PDL1 GSE13213 To further understand the genetic alterations associated with PDL1 PDL1 PDL1 1D PDL1 PDL1 1E PDL1 1F PDL1 1G PDL1 3.2  PDL1 To investigate the functional role of PDL1 2A PDL1 2B S1A PDL1 PDL1 2B S1A 2C S1B PDL1 PDL1 2D 2E PDL1 FIGURE 2 PDL1 suppresses lung adenocarcinoma growth. (A) qRT‐PCR (upper) and immunoblotting (lower) analyses to measure PDL1 PDL1 p p p PDL1 p PDL1 p PDL1 p 3.3  TGFBI PDL1 To elucidate the mechanism by which PDL1 regulates cellular growth in lung ADC, we performed gene expression profiling in CL1‐5 cells following PDL1 TGFBI PDL1 3A S2A TGFBI PDL1 3B TGFBI TGFBI 3C S2B TGFBI 3D 3E S2C TGFBI FIGURE 3 PDL1 regulates TGFBI TGFBI PDL1 p PDL1 TGFBI GSE30219 p TGFBI p p TGFBI p p p 3.4  TGF  PDL1  TGFBI Given that TGFBI is a known downstream effector of TGF‐β signaling, we investigated whether TGF‐β regulates both PDL1 TGFBI PDL1 TGFBI PDL1 TGFBI PDL1 TGFBI 4A S3 4B TGFBI PDL1 TGFBI 4C PDL1 TGFBI 4C PDL1 TGFB1 TGFBR2 4D TGFBI TGFBR2 4D PDL1 TGFBI FIGURE 4 TGF‐β induces PDL1‐TGFBI signaling. (A) qRT‐PCR of PDL1 TGFBI p p PDL1 TGFBI PDL1 p p p PDL1 TGFB1 TGFBR2 TGFBI p 3.5  CITED2 PDL1 TGFBI CITED2, a transcriptional coactivator, is known to be downregulated in response to TGF‐β‐mediated growth arrest. Under TGF‐β1 treatment, A549 cells exhibited a reduction in CITED2 p21  CIP1 5A PDL1 TGFBI CITED2 CITED2 PDL1 TGFBI CITED2 5B S4A CIP1 CITED2 p21  CIP1 5C CITED2 5D CITED2 p21  CIP1 CITED2 p21  CIP1 5E S4B p21  CIP1 PDL1 TGFBI 5F p21  CIP1 FIGURE 5 CITED2 regulates PDL1/TGFBI‐mediated growth arrest. (A) qRT‐PCR of CITED2 p21  CIP1 p p CITED2 PDL1 TGFBI p p CITED2 p21  CIP1 CITED2 p p CITED2 p CITED2 p21  CIP1 p p21  CIP1 PDL1 TGFBI p 3.6  PDL1 FAK CITED2 p21 CIP1 TGFBI is known to mediate cell‐matrix adhesion, with dysregulation leading to cell cycle arrest. We investigated the role of PDL1 in cell‐matrix adhesion. Detachment assays demonstrated that the overexpression of PDL1 6A PDL1 6B PDL1 6C,D 6E PDL1 CIP1 6F S5A FAK CIP1 PDL1 6G,H S5B S5C CIP1 FIGURE 6 PDL1 inhibits FAK‐CITED2 signaling. (A, C) Cell detachment assays in A549 and CL1‐5 cells with PDL1 p p CIP1 PDL1 p p FAK CITED2 p21  CIP1 PDL1 FAK p p p CIP1 PDL1 FAK Given that p21  CIP1 p21  CIP1 TP53 S6A p21  CIP1 TP53 PDL1 p21  CIP1 PDL1 S6B S6C 4 Discussion The significance of PDL1 in cancer has predominantly been studied within the framework of immune checkpoint blockade therapy, particularly its role in activating T‐cell responses via interaction with PD1 [ 28 29 CIP1 7 FIGURE 7 Intrinsic PDL1 growth suppressive signaling. Diagram illustrating PDL1‐mediated tumor suppression via TGFBI induction, FAK inhibition, and CITED2/p21 CIP1 BioRender.com While PDL1 is widely studied as a predictive marker for immunotherapy, its clinical utility remains inconsistent. Some patients with high PDL1 expression fail to respond to immune checkpoint inhibitors, while others without detectable PDL1 still benefit [ 30 31 32 33 34 35 36 37 38 Figure S7 39 40 Although our findings support a tumor‐suppressive role for PDL1 in lung ADC, this contrasts with studies identifying PDL1 as an oncogene in other cancers, such as breast and liver [ 41 CIP1 The complex regulation of PDL1 expression on the cell membrane is significantly influenced by TGF‐β1 signaling, a key factor among multiple cytokines. This signaling induces PDL1 expression, influencing tissue differentiation and modulating cancer progression [ 12 42 As a secreted tumor protein, TGFBI is known to be induced upon activation of TGF‐β signaling and plays a crucial role in inducing anoikis [ 16 43 44 45 19 46 47 48 CITED2 plays a pivotal role as a molecular switch in determining cellular proliferation or quiescence in response to cytokine signaling. Stimulated by TGF‐α, CITED2 interacts with MYC to facilitate CBP/p300 recruitment, thereby promoting cellular growth [ 49 CIP1 CIP1 13 CIP1 PDL1 TGFBI CITED2 p21  CIP1 PDL1 CITED2 CITED2 p21  CIP1 CITED2 TGFBI CITED2 p21  CIP1 p21  CIP1 PDL1 TGFBI CIP1 In conclusion, our data indicate that cell‐intrinsic PDL1 regulates the growth of lung ADC cells via a PD1‐independent mechanism. Deficient PDL1 expression in lung ADC suggests a growth‐suppressive role for PDL1 in lung ADC. Mechanistically, PDL1−mediated TGFBI expression inhibits FAK activation, which subsequently reduces CITED2 expression and increases p21 CIP1 Author Contributions  Thi Thanh Nha Nguyen: Pei‐Yu Chen: Ming‐Yi Zheng: Ting‐Kuang Lin: Chun‐Chao Wang: Yuh‐Min Chen: Yu‐Ting Chou: Disclosure Registry and the Registration No. of the Study/Trial: N/A. The authors declare no conflicts of interest. Ethics Statement Approval of the Research Protocol by an Institutional Review Board: N/A. Consent The authors have nothing to report. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Table S1  Table S2  Table S3  Figure S1 PDL1  Figure S2 TGFBI  Figure S3 PDL1 TGFBI  Figure S4 CITED2  Figure S5 CIP1  Figure S6 p21  CIP1  Figure S7 Acknowledgments We thank the RNA Technology Platform and Gene Manipulation Core Facility (RNAi Core) of the National Core Facility for Biopharmaceuticals at Academia Sinica, Taiwan, for providing the shRNA reagents. We also thank Dr. Daw‐Yang Hwang at the National Health Research Institutes (NHRI), Taiwan, for conducting whole‐exome sequencing of CL1‐5 cells. References 1 H. Dong G. Zhu K. Tamada L. Chen B7‐H1, a Third Member of the B7 Family, Co‐Stimulates T‐Cell Proliferation and Interleukin‐10 Secretion Nature Medicine 5 1999 1365 1369 10.1038/70932 10581077 2 G. J. Freeman A. J. Long Y. Iwai Engagement of the Pd‐1 Immunoinhibitory Receptor by a Novel B7 Family Member Leads to Negative Regulation of Lymphocyte Activation Journal of Experimental Medicine 192 2000 1027 1034 11015443 10.1084/jem.192.7.1027 PMC2193311 3 J. D. Wolchok H. Kluger M. K. Callahan Nivolumab plus Ipilimumab in Advanced Melanoma New England Journal of Medicine 369 2013 122 133 23724867 10.1056/NEJMoa1302369 PMC5698004 4 B. Yin J. Xiao J. Li X. Liu J. Wang Immune‐Related Organizing Pneumonitis in Non‐Small Cell Lung Cancer Receiving PD‐1 Inhibitor Treatment: A Case Report and Literature Review Journal of Cancer Research and Therapeutics 16 2020 1555 1559 33565499 10.4103/jcrt.JCRT_971_20 5 B. Zhang Y. Liu S. Zhou H. Jiang K. Zhu R. Wang Predictive Effect of PD‐L1 Expression for Immune Checkpoint Inhibitor (PD‐1/PD‐L1 Inhibitors) Treatment for Non‐Small Cell Lung Cancer: A Meta‐Analysis International Immunopharmacology 80 2020 106214 31982822 10.1016/j.intimp.2020.106214 6 M. Yi M. Niu L. Xu S. Luo K. Wu Regulation of PD‐L1 Expression in the Tumor Microenvironment Journal of Hematology & Oncology 14 2021 10 33413496 10.1186/s13045-020-01027-5 PMC7792099 7 F. Concha‐Benavente R. M. Srivastava S. Trivedi Identification of the Cell‐Intrinsic and ‐Extrinsic Pathways Downstream of EGFR and IFNγ That Induce PD‐L1 Expression in Head and Neck Cancer Cancer Research 76 2016 1031 1043 26676749 10.1158/0008-5472.CAN-15-2001 PMC4775348 8 A. H. Sharpe E. J. Wherry R. Ahmed G. J. Freeman The Function of Programmed Cell Death 1 and Its Ligands in Regulating Autoimmunity and Infection Nature Immunology 8 2007 239 245 17304234 10.1038/ni1443 9 A. B. Roberts L. M. Wakefield The Two Faces of Transforming Growth Factor β in Carcinogenesis National Academy of Sciences of the United States of America 100 2003 8621 8623 10.1073/pnas.1633291100 PMC166359 12861075 10 S. H. Wrzesinski Y. Y. Wan R. A. Flavell Transforming Growth Factor‐β and the Immune Response: Implications for Anticancer Therapy Clinical Cancer Research 13 2007 5262 5270 17875754 10.1158/1078-0432.CCR-07-1157 11 J. M. David C. Dominguez K. K. McCampbell J. L. Gulley J. Schlom C. Palena A Novel Bifunctional Anti‐PD‐L1/TGF‐β Trap Fusion Protein (M7824) Efficiently Reverts Mesenchymalization of Human Lung Cancer Cells Oncoimmunology 6 2017 e1349589 29123964 10.1080/2162402X.2017.1349589 PMC5665067 12 M.‐H. Kuo P.‐Y. Chen Y.‐P. Yang Cytokine and Epigenetic Regulation of Programmed Death‐Ligand 1 in Stem Cell Differentiation and Cancer Cell Plasticity Stem Cells 39 2021 1298 1309 34182610 10.1002/stem.3429 13 Y. T. Chou Y. C. Yang Post‐Transcriptional Control of Cited2 by Transforming Growth Factor Beta. Regulation via Smads and Cited2 Coding Region Journal of Biological Chemistry 281 2006 18451 18462 16675452 10.1074/jbc.M601720200 14 S. Wu C. Cetinkaya M. J. Munoz‐Alonso Myc Represses Differentiation‐Induced p21CIP1 Expression via Miz‐1‐Dependent Interaction With the p21 Core Promoter Oncogene 22 2003 351 360 12545156 10.1038/sj.onc.1206145 15 J. Massagué TGFβ Signalling in Context Nature Reviews. Molecular Cell Biology 13 2012 616 630 22992590 10.1038/nrm3434 PMC4027049 16 J. Skonier M. Neubauer L. Madisen K. Bennett G. D. Plowman A. F. Purchio cDNA Cloning and Sequence Analysis of Beta Ig‐h3, a Novel Gene Induced in a Human Adenocarcinoma Cell Line After Treatment With Transforming Growth Factor‐Beta DNA and Cell Biology 11 1992 511 522 1388724 10.1089/dna.1992.11.511 17 J. E. Kim S. J. Kim B. H. Lee R. W. Park K. S. Kim I. S. Kim Identification of Motifs for Cell Adhesion Within the Repeated Domains of Transforming Growth Factor‐Beta‐Induced Gene, Betaig‐h3 Journal of Biological Chemistry 275 2000 30907 30915 10906123 10.1074/jbc.M002752200 18 Y. Zhang G. Wen G. Shao TGFBI deficiency predisposes mice to spontaneous tumor development Cancer Research 69 2009 37 44 19117985 10.1158/0008-5472.CAN-08-1648 PMC2664305 19 P. Nummela J. Lammi J. Soikkeli O. Saksela P. Laakkonen E. Hölttä Transforming Growth Factor Beta‐Induced (TGFBI) is an Anti‐Adhesive Protein Regulating the Invasive Growth of Melanoma Cells American Journal of Pathology 180 2012 1663 1674 22326753 10.1016/j.ajpath.2011.12.035 20 G. Wen M. Hong B. Li Transforming Growth Factor‐β‐Induced Protein (TGFBI) Suppresses Mesothelioma Progression Through the Akt/mTOR Pathway International Journal of Oncology 39 2011 1001 1009 21701776 10.3892/ijo.2011.1097 PMC4090925 21 G. Wen M. A. Partridge B. Li TGFBI Expression Reduces in Vitro and in Vivo Metastatic Potential of Lung and Breast Tumor Cells Cancer Letters 308 2011 23 32 21561707 10.1016/j.canlet.2011.04.010 PMC3167173 22 S.‐C. Lin Y.‐T. Chou S. S. Jiang Epigenetic Switch Between SOX2 and SOX9 Regulates Cancer Cell Plasticity Cancer Research 76 2016 7036 7048 27758880 10.1158/0008-5472.CAN-15-3178 23 Y. T. Chou C. C. Lee S. H. Hsiao The Emerging Role of SOX2 in Cell Proliferation and Survival and Its Crosstalk With Oncogenic Signaling in Lung Cancer Stem Cells 31 2013 2607 2619 23940081 10.1002/stem.1518 24 C.‐C. Miao W. Hwang L.‐Y. Chu LC3A‐Mediated Autophagy Regulates Lung Cancer Cell Plasticity Autophagy 18 2022 921 934 34470575 10.1080/15548627.2021.1964224 PMC9037431 25 E. Cerami J. Gao U. Dogrusoz The cBio Cancer Genomics Portal: An Open Platform for Exploring Multidimensional Cancer Genomics Data Cancer Discovery 2 2012 401 404 22588877 10.1158/2159-8290.CD-12-0095 PMC3956037 26 J. Gao B. A. Aksoy U. Dogrusoz Integrative Analysis of Complex Cancer Genomics and Clinical Profiles Using the cBioPortal Science Signaling 6 2013 pl1 23550210 10.1126/scisignal.2004088 PMC4160307 27 M. A. Gillette S. Satpathy S. Cao Proteogenomic Characterization Reveals Therapeutic Vulnerabilities in Lung Adenocarcinoma Cell 182 2020 200 225 32649874 10.1016/j.cell.2020.06.013 PMC7373300 28 H. Dong S. E. Strome D. R. Salomao Tumor‐Associated B7‐H1 Promotes T‐Cell Apoptosis: A Potential Mechanism of Immune Evasion Nature Medicine 8 2002 793 800 10.1038/nm730 12091876 29 A. O. Kamphorst A. Wieland T. Nasti Rescue of Exhausted CD8 T Cells by PD‐1–Targeted Therapies Is CD28‐Dependent Science 355 2017 1423 1427 28280249 10.1126/science.aaf0683 PMC5595217 30 C. Gridelli A. Ardizzoni M. Barberis Predictive Biomarkers of Immunotherapy for Non‐Small Cell Lung Cancer: Results From an Experts Panel Meeting of the Italian Association of Thoracic Oncology Translational Lung Cancer Research 6 2017 373 386 28713682 10.21037/tlcr.2017.05.09 PMC5504112 31 S. P. Patel R. Kurzrock PD‐L1 Expression as a Predictive Biomarker in Cancer Immunotherapy Molecular Cancer Therapeutics 14 2015 847 856 25695955 10.1158/1535-7163.MCT-14-0983 32 J. Brahmer K. L. Reckamp P. Baas Nivolumab Versus Docetaxel in Advanced Squamous‐Cell Non‐Small‐Cell Lung Cancer New England Journal of Medicine 373 2015 123 135 26028407 10.1056/NEJMoa1504627 PMC4681400 33 H. Borghaei L. Paz‐Ares L. Horn Nivolumab Versus Docetaxel in Advanced Nonsquamous Non–Small‐Cell Lung Cancer New England Journal of Medicine 373 2015 1627 1639 26412456 10.1056/NEJMoa1507643 PMC5705936 34 A. Rittmeyer F. Barlesi D. Waterkamp Atezolizumab Versus Docetaxel in Patients With Previously Treated Non‐Small‐Cell Lung Cancer (OAK): A Phase 3, Open‐Label, Multicentre Randomised Controlled Trial Lancet 389 2017 255 265 27979383 10.1016/S0140-6736(16)32517-X PMC6886121 35 Y. Kogashiwa M. Yasuda H. Sakurai PD‐L1 Expression Confers Better Prognosis in Locally Advanced Oral Squamous Cell Carcinoma Anticancer Research 37 2017 1417 1424 28314313 10.21873/anticanres.11465 36 J. M. Taube R. A. Anders G. D. Young Colocalization of Inflammatory Response With B7‐h1 Expression in Human Melanocytic Lesions Supports an Adaptive Resistance Mechanism of Immune Escape Science Translational Medicine 4 2012 127ra137 10.1126/scitranslmed.3003689 PMC3568523 22461641 37 R. A. Droeser C. Hirt C. T. Viehl Clinical Impact of Programmed Cell Death Ligand 1 Expression in Colorectal Cancer European Journal of Cancer 49 2013 2233 2242 23478000 10.1016/j.ejca.2013.02.015 38 E. J. Lipson J. G. Vincent M. Loyo PD‐L1 Expression in the Merkel Cell Carcinoma Microenvironment: Association With Inflammation, Merkel Cell Polyomavirus and Overall Survival Cancer Immunology Research 1 2013 54 63 24416729 10.1158/2326-6066.CIR-13-0034 PMC3885978 39 X. Wang X. Yang C. Zhang Tumor Cell‐Intrinsic PD‐1 Receptor Is a Tumor Suppressor and Mediates Resistance to PD‐1 Blockade Therapy National Academy of Sciences of the United States of America 117 2020 6640 6650 10.1073/pnas.1921445117 PMC7104341 32161124 40 D. Xu P. Dong Y. Xiong PD‐L1 Is a Tumor Suppressor in Aggressive Endometrial Cancer Cells and Its Expression Is Regulated by miR‐216a and lncRNA MEG3 Frontiers in Cell and Developmental Biology 8 2020 8 33363153 10.3389/fcell.2020.598205 PMC7755603 41 A. V. R. Kornepati R. K. Vadlamudi T. J. Curiel Publisher Correction: Programmed Death Ligand 1 Signals in Cancer Cells Nature Reviews. Cancer 22 2022 190 10.1038/s41568-022-00445-6 35046562 42 L. Sun Y. Wang X. Wang PD‐L1 Promotes Myofibroblastic Activation of Hepatic Stellate Cells by Distinct Mechanisms Selective for TGF‐β Receptor I Versus II Cell Reports 38 2022 110349 35139382 10.1016/j.celrep.2022.110349 PMC8903892 43 J.‐E. Kim S.‐J. Kim H.‐W. Jeong RGD Peptides Released From βig‐h3, a TGF‐β‐Induced Cell‐Adhesive Molecule, Mediate Apoptosis Oncogene 22 2003 2045 2053 12673209 10.1038/sj.onc.1206269 44 S. Frisch H. Francis Disruption of Epithelial Cell‐Matrix Interactions Induces Apoptosis Journal of Cell Biology 124 1994 619 626 8106557 10.1083/jcb.124.4.619 PMC2119917 45 D. A. Tumbarello J. Temple J. D. Brenton ß3 Integrin Modulates Transforming Growth Factor Beta Induced (TGFBI) Function and Paclitaxel Response in Ovarian Cancer Cells Molecular Cancer 11 2012 36 22640878 10.1186/1476-4598-11-36 PMC3442987 46 M. Irigoyen M. J. Pajares J. Agorreta TGFBI Expression Is Associated With a Better Response to Chemotherapy in NSCLC Molecular Cancer 9 2010 130 20509890 10.1186/1476-4598-9-130 PMC2900244 47 S. K. Mitra D. D. Schlaepfer Integrin‐Regulated FAK‐Src Signaling in Normal and Cancer Cells Current Opinion in Cell Biology 18 2006 516 523 16919435 10.1016/j.ceb.2006.08.011 48 Z. Lu G. Jiang P. Blume‐Jensen T. Hunter Epidermal Growth Factor‐Induced Tumor Cell Invasion and Metastasis Initiated by Dephosphorylation and Downregulation of Focal Adhesion Kinase Molecular and Cellular Biology 21 2001 4016 4031 11359909 10.1128/MCB.21.12.4016-4031.2001 PMC87064 49 Y. T. Chou C. H. Hsieh S. H. Chiou CITED2 Functions as a Molecular Switch of Cytokine‐Induced Proliferation and Quiescence Cell Death & Differentiation 19 2012 2015 2028 22814619 10.1038/cdd.2012.91 PMC3504715 ",
  "metadata": {
    "Title of this paper": "CITED2 Functions as a Molecular Switch of Cytokine‐Induced Proliferation and Quiescence",
    "Journal it was published in:": "Cancer Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485868/"
  }
}