{
  "title": "Paper_325",
  "abstract": "pmc J Nucl Med J Nucl Med 3060 jnucmed jnm Journal of Nuclear Medicine 0161-5505 1535-5667 Society of Nuclear Medicine and Molecular Imaging PMC12487870 PMC12487870.1 12487870 12487870 40813233 10.2967/jnumed.125.270266 270266 1 Featured Basic Science Article Combination Image-Guided and Antibody-Targeted α-Therapy Before Targeted Immunotherapy for Treatment of Solid Tumors Kujawski Maciej  1 Aniogo Eric  1 Wong Patty  2 Hui Susanta  2 Ghimire Hemendra  2 Poku Erasmus K.  3 Yazaki Paul J.  1 Wong Jeffrey Y.C.  2 Shively John E.  1 1 2 3 For correspondence or reprints, contact John E. Shively ( jshively@coh.org Published online Aug. 14, 2025. 10 2025 66 10 498107 1605 1611 24 4 2025 14 7 2025 01 10 2025 02 10 2025 02 10 2025 © 2025 by the Society of Nuclear Medicine and Molecular Imaging. 2025 https://creativecommons.org/licenses/by/4.0/ Immediate Open Access: Creative Commons Attribution 4.0 International License (CC BY) allows users to share and adapt with attribution, excluding materials credited to previous publications. License: https://creativecommons.org/licenses/by/4.0/ https://jnm.snmjournals.org/page/permissions Visual Abstract  The rationale of this study was to evaluate the efficacy of 3 types of targeted therapy for solid tumors, comprising image-guided radiation therapy (IGRT), low-dose targeted α-therapy (TAT), and antibody-targeted interleukin-2 immunocytokine therapy, with the expectation that the combination of 2 types of targeted radiation therapy would perform better than either monotherapy with immunocytokine therapy. Methods: 225 Results: Conclusion: image-guided radiotherapy targeted α-therapy targeted immunotherapy radioimmunoimaging radionuclide therapy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Even when immunotherapy is used as the first-line treatment for solid tumors, the response rate is low due to a refractory immune tumor microenvironment (TME) ( 1 2 3 4 5 6 7 8 9 10 11 12 13 10 Since untargeted immunotherapy can result in unexpected side effects, including autoimmunity ( 14 15 16 17 18 18 19 Given the inherent challenges of treating immunologically refractive tumors, we combined IGRT and TAT for the treatment of an immunocompetent solid tumor model expressing a human tumor antigen ( 20 MATERIALS AND METHODS Cell Lines Murine breast cancer E0771 and colon cancer MC38 cells stably transfected with carcinoembryonic antigen (CEA) were used, as previously described ( 18 Animal Studies Animal studies were performed in accordance with Institutional Animal Care and Use Committee Protocol 91017 and approved by the City of Hope Institutional Animal Care and Use Committee. Immunocompetent CEA transgenic mice on a C57BL/6J background were used, as previously described ( 20 http://jnm.snmjournals.org PET Imaging Studies Humanized anti-CEA antibody huM5A was conjugated with NHS-DOTA and radiolabeled with 64 19 21 Leukocyte Analysis Tissues were collected and analyzed by flow cytometry, as described previously ( 18 18 Statistical Analysis Unpaired t P RESULTS Effect of IGRT on Antibody Penetration into Tumors A major drawback of antibody-targeted therapy is the poor penetration of antibodies into the TME ( 22 Fig. 1 FIGURE 1. Effects of IGRT on antibody penetration into orthotopic breast tumors. (A) 64 n P P Thus, both single- and fractionated-dose IGRT improved antibody penetration, most likely due to changes in tumor vascular permeability, partly attributable to the reduction of high fluid pressure within the TME ( 23 Combination of IGRT and TAT in a Breast Cancer Model Before performing experiments with 2 types of radiation therapy before immunotherapy, each of the radiation monotherapies were evaluated in 2 CEA+ tumor model systems to determine if IGRT plus TAT was more effective than either therapy alone. In the first study, the orthotopic breast tumor line E0771 transfected with CEA was used in CEA transgenic mice to mimic the situation in CEA+ human breast cancer ( 18 In previous studies where we compared a single dose of 10 Gy to a fractionated-dose IGRT (4 doses of 2.5 Gy) ( 18 D new D old 0.27 24 Fig. 2 Fig. 2A Figs. 2A and 2B 225 19 Figs. 2C–2F Figs. 2G and 2H Fig. 2H FIGURE 2. Comparisons of monotherapies with IGRT or TAT vs. combined IGRT plus TAT in immunocompetent breast cancer model. (A and B) CEA transgenic mice bearing established CEA transfected E0771 orthotopic breast tumors ( n 225 n n n P P P P Combination of IGRT and TAT in a Colon Cancer Model The analogous study was repeated in a second tumor model in which CEA was transfected into the murine colon carcinoma line MC38 grown in CEA transgenic mice ( 19 Figs. 3A and 3B Figs. 3C and 3D Figs. 3E and 3F Figs. 3G–3I FIGURE 3. Comparisons of monotherapies with IGRT or TAT vs. combined IGRT plus TAT in colon cancer model. (A and B) CEA transgenic mice bearing established CEA transfected MC38 tumors ( n 225 n n n P P P P Combination Therapy for Colon Cancer Tumors with Fractionated IGRT Plus TAT Followed by Immunotherapy Comparing the results from the 2 CEA+ tumor models, we selected the colon cancer model for further treatment with immunotherapy. The colon cancer model allowed 50% mice to survive for a longer period (80 d), and this model benefitted most from the combination of IGRT plus targeted immunotherapy or TAT plus targeted immunotherapy in previous studies ( 18 19 In those studies, as well as the current study, we selected anti-CEA-IL-2 immunocytokine as the targeted immunotherapy. In the IGRT plus TAT treatment group, 1 of 5 tumors were eradicated, and 4 of 5 tumors in the group treated with IGRT plus TAT plus immunocytokine therapy (IGRT/TAT/immunocytokine therapy) ( Fig. 4A Fig. 4B Fig. 4C FIGURE 4. Combination IGRT/TAT/immunocytokine therapy in colon cancer model. (A and B) CEA transgenic mice bearing established CEA transfected MC38 tumors ( n 225 n P P Early Immunophenotype Analysis with IGRT/TAT/Immunocytokine Therapy The effect of various therapies and their combination on the tumors, tumor-draining lymph nodes (TDLNs), and the spleen must be evaluated within a few days after the start of therapy. By the end of the abovementioned studies, the tumors were absent or, if regrowing, reverted to the immune-resistant phenotype of untreated tumors. Therefore, we performed a study comparing tumors treated with IGRT monotherapy, IGRT plus TAT, and IGRT/TAT/immunocytokine therapy with untreated controls. Tumors, TDNLs, and spleens were harvested 2 d after each treatment was administered. When 3 types of infiltrating immune cells in the spleen were analyzed for the 3 treatment groups and the untreated controls, significant changes were found only in the IGRT/TAT/immunocytokine therapy group, where the frequency of CD4-positive (CD4+) T cells decreased, CD8-positive (CD8+) T cells increased, and natural killer (NK) cells increased by almost 6-fold ( Fig. 5A 25 Fig. 5B FIGURE 5. Selected immunophenotypes in CEA transgenic mice bearing CEA+ colon cancers after treatment with IGRT, IGRT plus TAT, or IGRT/TAT/immunocytokine therapy vs. untreated controls. (A and B) Frequency of T cells and NK cells in spleen (A) and tumor (B). CD8+/CD4+ T cell ratios (C) and percentage of CD4+ Tregs (D) in tumor, TDLN, and spleen. (E and F) Percentage of IFNγ+ CD8+ T cells (E) and their ratio to CD4+ Tregs in tumor, TDLN, and spleen (F). (G) Phenotypes of tumor myeloid cells ( n P P P Next, we analyzed the ratios of CD4+-to-CD8+ T cells versus the percentage of Tregs (FoxP3+/CD4+ T cells) in spleens, TDLNs, and tumors ( Fig. 5C 18 18 Fig. 5D Given the importance of infiltrating cytotoxic CD8+ T cells as measured by their production of IFNγ, we analyzed both their frequency and ratio to CD4+ Tregs ( Figs. 5E and 5F Since we were also interested in the myeloid component of the tumors, we analyzed subsets of CD11b+ cells: Ly6C Hi Fig. 5G Sources of Infiltrating CD4+ and CD8+ T Cells Given that tumor-infiltrating CD4+ and CD8+ T cells may arise from naïve, central memory, or effector memory precursor cells ( 26 Fig. 6 FIGURE 6. Origin of CD4+ and CD8+ T cells in CEA transgenic mice bearing CEA+ colon cancers after treatment with IGRT, IGRT plus TAT, or IGRT/TAT/immunocytokine therapy vs. untreated controls. (A–F) Frequency of CD4+ and CD8+ naïve (CD62L+CD44−), central (CD62L+CD44+), and effector (CD62L−CD44+) memory T cells in TDLN (A and B), spleen (C and D) and tumor (E and F) ( n P P P As expected, the majority of CD4+ T cells in the TDLNs were of the naïve phenotype, and the changes with therapy were minor in magnitude but were significant when compared with untreated controls ( Fig. 6A Fig. 6B For spleens, a more complex picture was seen for CD4+ T cells. Depending on the therapy, the number of naïve CD4+ T cells decreased with IGRT but increased with IGRT plus TAT or IGRT/TAT/immunocytokine therapy ( Fig. 6C Fig. 6D In contrast to the spleen and TDLNs, there was almost a complete lack of naïve CD4+ T cells in the control tumor, a situation that was reversed by all 3 types of therapy, with IGRT/TAT/immunocytokine therapy exhibiting the most dramatic increase ( Fig. 6E Fig. 6F DISCUSSION There is a growing consensus that the effectiveness of immunotherapy alone, though often ineffective for solid tumors, can be dramatically improved by the prior use of low-dose targeted radiation therapy ( 8 27 31 Fig. 1 31 225 19 32 33 It is well known that targeted radionuclide therapy transforms immunologically cold tumors into immune-responsive tumors when combined with untargeted checkpoint blockade therapy ( 34 34 Nonetheless, it appears that the goal of inducing complete inhibition of tumor growth, as well as tumor immunity, is possible. Moreover, immunophenotyping performed in a separate experiment 2 d after the completion of all 3 therapies showed major changes in the population of CD8+/IFNγ+ T cells versus CD4+/FoxP3+ Tregs, especially their ratios, and correlated well with therapy efficacy, similar to our previous studies ( 18 19 Figs. 5A and 5B 35 36 In this study, we found that exposing tumors to radiation affects the composition of myeloid cells by reducing F4/80+ macrophages and increasing Ly6C Hi Fig. 5G 37 In terms of tracking the origins of the antitumor immune cells, we found that a central memory subset of tumor-infiltrating CD8+ T cells provided superior antitumor immunity compared with effector memory CD8+ T cells, similar to the findings of a comparative study by Klebanoff et al. ( 38 39 Hi 40 CONCLUSION Using 2 syngeneic tumor models, we showed that low-dose fractionated IGRT combined with low-dose TAT showed the highest tumor growth inhibition and immune memory against tumor rechallenge. Moreover, the combination of these radiation therapies, followed with tumor-targeting immunocytokine therapy, had the best therapeutic effects, as evidenced by tumor cure, rejection of tumor rechallenge, and immunophenotyping indicating the dominant effector responses exerted by cytotoxic NK and CD8+ T cells. Based on these preliminary findings, further studies to explore the doses and timing of IGRT, TAT, and immunocytokine combination therapies are warranted. DISCLOSURE This research was supported by NIH grant CA283603 and cancer center support grant P30CA033572. No other potential conflict of interest relevant to this article was reported. KEY POINTS QUESTION: PERTINENT FINDINGS: IMPLICATIONS FOR PATIENT CARE: REFERENCES 1. Abizanda-Campo S Virumbrales-Muñoz M Humayun M Microphysiological systems for solid tumor immunotherapy: opportunities and challenges Microsyst Nanoeng. 2023 9 154 38106674 10.1038/s41378-023-00616-x PMC10724276 2. Tzeng HT Huang YJ Tumor vasculature as an emerging pharmacological target to promote anti-tumor immunity Int J Mol Sci. 2023 24 4422 36901858 10.3390/ijms24054422 PMC10002465 3. Martin JD Seano G Jain RK Normalizing function of tumor vessels: progress, opportunities, and challenges Annu Rev Physiol. 2019 81 505 534 30742782 10.1146/annurev-physiol-020518-114700 PMC6571025 4. Togashi Y Shitara K Nishikawa H Regulatory T cells in cancer immunosuppression—implications for anticancer therapy Nat Rev Clin Oncol. 2019 16 356 371 30705439 10.1038/s41571-019-0175-7 5. Barry ST Gabrilovich DI Sansom OJ Campbell AD Morton JP Therapeutic targeting of tumour myeloid cells Nat Rev Cancer. 2023 23 216 237 36747021 10.1038/s41568-022-00546-2 6. Yang D Liu J Qian H Zhuang Q Cancer-associated fibroblasts: from basic science to anticancer therapy Exp Mol Med. 2023 55 1322 1332 37394578 10.1038/s12276-023-01013-0 PMC10394065 7. Tiwari A Oravecz T Dillon LA Towards a consensus definition of immune exclusion in cancer Front Immunol. 2023 14 1084887 37033994 10.3389/fimmu.2023.1084887 PMC10073666 8. Zhang Z Liu X Chen D Yu J Radiotherapy combined with immunotherapy: the dawn of cancer treatment Signal Transduct Target Ther. 2022 7 258 35906199 10.1038/s41392-022-01102-y PMC9338328 9. Coussens LM Werb Z Inflammation and cancer Nature. 2002 420 860 867 12490959 10.1038/nature01322 PMC2803035 10. Herrera FG Ronet C Ochoa de Olza M Low-dose radiotherapy reverses tumor immune desertification and resistance to immunotherapy Cancer Discov. 2022 12 108 133 34479871 10.1158/2159-8290.CD-21-0003 PMC9401506 11. Ghita M Brown KH Kelada OJ Graves EE Butterworth KT Integrating small animal irradiators with functional imaging for advanced preclinical radiotherapy research Cancers (Basel). 2019 11 170 30717307 10.3390/cancers11020170 PMC6406472 12. Sgouros G Bodei L McDevitt MR Nedrow JR Radiopharmaceutical therapy in cancer: clinical advances and challenges Nat Rev Drug Discov. 2020 19 589 608 32728208 10.1038/s41573-020-0073-9 PMC7390460 13. Feuerecker B Kratochwil C Ahmadzadehfar H Clinical translation of targeted α-therapy: an evolution or a revolution? J Nucl Med. 2023 64 685 692 37055224 10.2967/jnumed.122.265353 14. Caspi RR Immunotherapy of autoimmunity and cancer: the penalty for success Nat Rev Immunol. 2008 8 970 976 19008897 10.1038/nri2438 PMC2764117 15. Chen T Wang M Chen Y Liu Y Current challenges and therapeutic advances of CAR-T cell therapy for solid tumors Cancer Cell Int. 2024 24 133 38622705 10.1186/s12935-024-03315-3 PMC11017638 16. Frey N Porter D Cytokine release syndrome with chimeric antigen receptor T cell therapy Biol Blood Marrow Transplant. 2019 25 e123 e127 30586620 10.1016/j.bbmt.2018.12.756 17. Gout DY Groen LS van Egmond M The present and future of immunocytokines for cancer treatment Cell Mol Life Sci. 2022 79 509 36066630 10.1007/s00018-022-04514-9 PMC9448690 18. Kujawski M Sherman M Hui S Potent immunomodulatory effects of an anti-CEA-IL-2 immunocytokine on tumor therapy and effects of stereotactic radiation Oncoimmunology. 2020 9 1724052 32117587 10.1080/2162402X.2020.1724052 PMC7028338 19. Minnix M Kujawski M Poku E Yazaki PJ Wong JYC Shively JE Improved tumor responses with sequential targeted α-particles followed by IL2 immunocytokine therapies in treatment of CEA positive breast and colon tumors in CEA transgenic mice J Nucl Med. 2022 63 1859 1864 35772959 10.2967/jnumed.122.264126 PMC9730924 20. Clarke P Mann J Simpson JF Rickard-Dickson K Primus FJ Mice transgenic for human carcinoembryonic antigen as a model for immunotherapy Cancer Res. 1998 58 1469 1477 9537250 21. Minnix M Li L Yazaki PJ TAG-72-targeted α-radionuclide therapy of ovarian cancer using 225 J Nucl Med. 2021 62 55 61 32620701 10.2967/jnumed.120.243394 PMC9364881 22. Thurber GM Schmidt MM Wittrup KD Factors determining antibody distribution in tumors Trends Pharmacol Sci. 2008 29 57 61 18179828 10.1016/j.tips.2007.11.004 PMC2820301 23. Kataru RP Ly CL Shin J Tumor lymphatic function regulates tumor inflammatory and immunosuppressive microenvironments Cancer Immunol Res. 2019 7 1345 1358 31186247 10.1158/2326-6066.CIR-18-0337 PMC6677612 24. Spring E A simple formula for calculation of the total dose in fractionated radiotherapy Cancer Res. 1972 32 1995 1997 4641282 25. Skrombolas D Frelinger JG Challenges and developing solutions for increasing the benefits of IL-2 treatment in tumor therapy Expert Rev Clin Immunol. 2014 10 207 217 24410537 10.1586/1744666X.2014.875856 PMC4072333 26. Han J Khatwani N Searles TG Turk MJ Angeles CV Memory CD8 + Semin Immunol. 2020 49 101435 33272898 10.1016/j.smim.2020.101435 PMC7738415 27. Fong KHA Ho I So TH Case report: low-dose radiation reverses pembrolizumab resistance in melanoma Front Oncol. 2025 15 1483117 40012549 10.3389/fonc.2025.1483117 PMC11860094 28. Zagardo V Martorana E Harikar M Pergolizzi S Ferini G Effectiveness of radiotherapy in delaying treatment changes in primary or secondary immunorefractory oligoprogressive patients: preliminary results from a single-center study Discov Oncol. 2024 15 531 39377996 10.1007/s12672-024-01360-y PMC11461402 29. He K Barsoumian HB Bertolet G Novel use of low-dose radiotherapy to modulate the tumor microenvironment of liver metastases Front Immunol. 2021 12 812210 34975924 10.3389/fimmu.2021.812210 PMC8714746 30. Schoenfeld JD Giobbie-Hurder A Ranasinghe S Durvalumab plus tremelimumab alone or in combination with low-dose or hypofractionated radiotherapy in metastatic non-small-cell lung cancer refractory to previous PD(L)-1 therapy: an open-label, multicentre, randomised, phase 2 trial Lancet Oncol. 2022 23 279 291 35033226 10.1016/S1470-2045(21)00658-6 PMC8813905 31. Demaria S Guha C Schoenfeld J Radiation dose and fraction in immunotherapy: one-size regimen does not fit all settings, so how does one choose? J Immunother Cancer. 2021 9 e002038 33827904 10.1136/jitc-2020-002038 PMC8031689 32. Tafreshi NK Doligalski ML Tichacek CJ Development of targeted alpha particle therapy for solid tumors Molecules. 2019 24 4314 31779154 10.3390/molecules24234314 PMC6930656 33. Marcu L Bezak E Allen BJ Global comparison of targeted alpha vs targeted beta therapy for cancer: in vitro, in vivo and clinical trials Crit Rev Oncol Hematol. 2018 123 7 20 29482781 10.1016/j.critrevonc.2018.01.001 34. Patel RB Hernandez R Carlson P Low-dose targeted radionuclide therapy renders immunologically cold tumors responsive to immune checkpoint blockade Sci Transl Med. 2021 13 eabb3631 34261797 10.1126/scitranslmed.abb3631 PMC8449934 35. Wu SY Fu T Jiang YZ Shao ZM Natural killer cells in cancer biology and therapy Mol Cancer. 2020 19 120 32762681 10.1186/s12943-020-01238-x PMC7409673 36. Coenon L Geindreau M Ghiringhelli F Villalba M Bruchard M Natural killer cells at the frontline in the fight against cancer Cell Death Dis. 2024 15 614 39179536 10.1038/s41419-024-06976-0 PMC11343846 37. Guo S Yao Y Tang Y Radiation-induced tumor immune microenvironments and potential targets for combination therapy Signal Transduct Target Ther. 2023 8 205 37208386 10.1038/s41392-023-01462-z PMC10199044 38. Klebanoff CA Gattinoni L Torabi-Parizi P Central memory self/tumor-reactive CD8+ T cells confer superior antitumor immunity compared with effector memory T cells Proc Natl Acad Sci USA. 2005 102 9571 9576 15980149 10.1073/pnas.0503726102 PMC1172264 39. Yang Z Liu L Zhu Z Tumor-associated monocytes reprogram CD8 + Adv Sci (Weinh). 2024 11 e2304501 38386350 10.1002/advs.202304501 PMC11040375 40. Williams L Li L Yazaki PJ Comparison of IL-2-antibody to IL-2-Fc with or without stereotactic radiation therapy in CEA immunocompetent mice with CEA positive tumors Cancer Med. 2024 13 e6909 38317590 10.1002/cam4.6909 PMC10905250 ",
  "metadata": {
    "Title of this paper": "Comparison of IL-2-antibody to IL-2-Fc with or without stereotactic radiation therapy in CEA immunocompetent mice with CEA positive tumors",
    "Journal it was published in:": "Journal of Nuclear Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487870/"
  }
}