{
  "title": "Paper_123",
  "abstract": "pmc Front Public Health Front Public Health 2277 frontpubhealth Front. Public Health Frontiers in Public Health 2296-2565 Frontiers Media SA PMC12488707 PMC12488707.1 12488707 12488707 10.3389/fpubh.2025.1639229 1 Public Health Original Research Hemoglobin-to-red blood cell distribution width ratio in the relationship between occupational aluminum exposure and cognitive function impairment: a mediation analysis Wang Ruo-nan  1  2  † Wang Zhuo-hui  1  2  † Hu Wen-cheng  1  2  † Kong Fan-peng  1  2 Pei Zi-yan  1  2 Song Jing  1 Lu Xiao-ting  1 Pan Bao-long  2  * 1 Department of Occupational Health, School of Public Health, Shanxi Medical University Taiyuan, Shanxi China 2 Sixth Hospital of Shanxi Medical University (General Hospital of Tisco) Taiyuan, Shanxi China Edited by: Ben Nephew Reviewed by: Caishui Yang Tijana Nastasovic Jingtao Wu Azmi Eyiol *Correspondence: Bao-long Pan, 2057749336@qq.com † 18 9 2025 2025 13 480651 1639229 01 6 2025 03 9 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Wang, Wang, Hu, Kong, Pei, Song, Lu and Pan. 2025 Wang, Wang, Hu, Kong, Pei, Song, Lu and Pan https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Objective To investigate the partial mediating role of the inflammatory marker hemoglobin-to-red cell distribution width ratio (HRR) in the association between occupational aluminum exposure and cognitive function impairment, and its significance. Methods In this study, 401 workers from a Shanxi aluminum plant were selected by Cluster Sampling. Fasting elbow venous blood was collected for measuring routine blood counts, plasma aluminum concentration (P-Al) was measured using inductively coupled plasma mass spectrometry (ICP-MS), Montreal Cognitive Assessment (MoCA) was used to assess the cognitive function. Multiple linear regression was used to analyze the relationship between P-Al and cognitive function and HRR, and a restricted cubic spline model was used to fit the dose–response relationship, and mediated effects analysis was performed. Results The median plasma aluminum concentration (  P 25 , P 75  P 25 , P 75 Conclusion Occupational aluminum exposure negatively affects workers’ cognitive function and HRR levels. HRR can partially explain the effects of occupational aluminum exposure on workers’ cognitive function. occupational aluminum exposure cognitive function blood indicators inflammatory markers mediating analysis Natural Science Foundation of Shanxi Province 10.13039/501100004480 BYBLD001 The author(s) declare that financial support was received for the research and/or publication of this article. This study was supported by the Shanxi Province Higher Education “Billion Project” Science and Technology Guidance Project (BYBLD001), Natural Science Foundation of Shanxi Province (20210302122426 and 202203021211245), Shanxi Scholarship Council of China (2021-084), Shanxi Health Commission Key Laboratory of Nervous System Disease Prevention and Treatment (2020SY20), Fundamental Research Program of Shanxi Province [No. 202303021211255]. Fundamental Research Program of Shanxi Province, China [No. 202303021211123]. Supported by Scientific Research Projects of Six Special Actions (Z2025002). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Occupational Health and Safety 1 Introduction Aluminum, the most abundant metallic element in the Earth’s crust (about 8.88%), is widely used in industries like aerospace, transportation, machinery, and power due to its high conductivity, processability, and plasticity. China, the world’s largest aluminum producer and consumer, has seen extensive occupational aluminum exposure from large-scale electrolytic aluminum production. Numerous studies have established an association between occupational aluminum exposure and cognitive impairment in workers ( 1 Accumulating evidence indicates that aluminum enters the human body primarily through the respiratory and digestive tracts, exerting toxic effects on the nervous, skeletal, endocrine, and hematopoietic systems ( 2 3 4 5 Conventional blood indicators in the hematopoietic system include white blood cell count (WBC), lymphocyte count, neutrophil count, monocyte count, red blood cell count (RBC), and hemoglobin (HGB). Mean corpuscular volume (MCV), mean corpuscular hemoglobin content (MCH), mean corpuscular hemoglobin concentration (MCHC), hematocrit (PCV), platelet count (PLT), and red blood cell distribution width (RDW), etc. ( 6 7 8 9 In vivo 10 11 Hemoglobin (Hb), an oxygen-carrying protein predominantly found in red blood cells, serves as a key component of complete blood count analysis. Hb levels correlate with nutritional status and immune function, providing an indicator of anemia severity. Emerging evidence suggests Hb may also function as a marker of chronic inflammation ( 12 13 14 The hemoglobin-to-red cell distribution width ratio (HRR), calculated as Hb/RDW, represents a novel inflammatory marker proposed by Sun et al., which can effectively reflect the levels of oxidative stress and systemic inflammatory response in the body ( 15 16 17 18 19 20 We thus hypothesize that HRR mediates aluminum-induced cognitive impairment. Current studies largely focus on aluminum’s impact on the overall blood system, with limited research on its relationship with inflammatory markers and cognitive function. Occupational aluminum workers, due to their unique exposure, are more vulnerable to harmful effects. This study thus examines the relationship between plasma aluminum concentration, HRR level, and cognitive function in these workers. 2 Objects and methods 2.1 Study population This study adopts the method of cluster sampling, mainly selecting on-the-job male workers in the electrolytic aluminum workshop and alumina workshop in a large-scale aluminum plant in Shanxi in 2019. Its leading products are alumina and aluminum hydroxide, and the production process adopts the more mature mixed-linkage method in China. We recruited 434 male workers and excluded 33 subjects based on the following criteria: service <1 year ( n n n n n n 2.2 Measurement of plasma aluminum concentration Using sodium heparin anticoagulation tubes, 2 mL of whole blood was collected from workers in the early morning fasting state and centrifuged at 1000 r/min ( r r 21 2.3 Routine blood measurements Sodium heparin anticoagulant tubes were used to collect 5.0 mL/person of fasting elbow venous blood from workers in the early morning, which was gently mixed at room temperature using a Sysmex XN1000 Hematology Analyzer, and the test was completed within 2 h. Routine blood measurements included RBC, Hb, RDW, WBC, and PLT. Instrument calibration is performed before testing, and quality control products are run daily to ensure that the coefficient of variation (CV) within a batch is <5%. 2.4 HRR calculations Calculate the hemoglobin to red blood cell distribution width ratio (HRR) by dividing the hemoglobin (HGB) in grams per liter (g/L) by the red blood cell distribution width (RDW), with the detection unit being ‘%’. The normal reference value range for each indicator: HGB (120.00–160.00); RDW (11.50–14.50), any value below or above the normal reference range is defined as abnormal for this indicator. For accuracy, the result is rounded to two decimal places. 2.5 Cognitive assessment In this study, we used the Montreal Cognitive Assessment (MoCA) to assess the cognitive function of workers. It was administered by professional nurses from the Department of Neurology of the First Hospital of Shanxi Medical University in a standardized and quiet environment in a one-to-one manner. The MoCA scale covers a wide range of cognitive domains and has high sensitivity and specificity for the identification of MCI ( 22 2.6 Other variables In this study, the Body Mass Index (BMI) is calculated by dividing an individual’s weight in kilograms (kg) by the square of their height in meters (  m 2 2.7 Statistical analysis R 4.3.0 statistical analysis software was used in this study, all the research subjects were divided into the low-aluminum exposure group and the high-aluminum exposure group according to the median plasma aluminum concentration Normal distribution of continuous data was expressed as mean± standard deviation (Mean ± SD), and comparisons between multiple groups were performed using analysis of variance (ANOVA); Skewed distribution of continuous data was expressed as median and interquartile spacing M (  P 25 , P 75 p Multiple linear regression models were used to explore the relationship between P-Al, HRR, and MoCA total scores, and univariate analyses were not adjusted for confounding variables, such as age, BMI, duration employment, education level, per capita monthly household income, smoking, alcohol consumption, exercise, and marital status, so further multivariate analyses were performed to rule out the above variables, followed by restricted cubic spline (RCS) to reflect the dose–response relationship of P-Al with HRR and MoCA total score. RCS indicates the existence of nonlinear correlations that can assist in identifying potential threshold intervals. Threshold analysis is conducted using the ‘segmented’ package. The threshold effect refers to the phenomenon where the magnitude of the effect on the dependent variable changes when the independent variable exceeds a certain point. Through threshold effect analysis, important inflection points that significantly affect the correlation between variables can be identified. In the threshold analysis results, Model 1 is a regular regression analysis, while Model 2 is a two-stage regression. By observing the p P p p Mediation analysis examines how the effect of an exposure variable on an outcome variable is mediated through a third variable, given the association between the independent and dependent variables. The mediating effect requires three conditions ( 23 α 3 Results 3.1 General characteristics of participants A total of 401 male workers participated in this study. The age of the study participants M (  P 0 , P 100  P 0 , P 100 Table 1 p p Table 1 General demographic characteristics. Variables Total ( n Low-aluminum exposure group ( n High-aluminum exposure group ( n  p P-Al, (μg/L) 50.74 (23.45, 85.52) 23.31 (10.48, 36.02) 85.52 (68.10, 120.99)  <0.001 Age, (years) 45.00 (39.00, 49.00) 47.00 (41.00, 49.25) 44.00 (38.00, 49.00)  0.009 BMI, (  kg / m 2 24.22 (21.22, 26.93) 24.55 (21.61, 27.02) 23.45 (20.98, 26.60) 0.081 Duration employment (years) 25.00 (17.00, 29.00) 26.00 (20.00, 30.00) 22.00 (14.00, 29.00)  0.008 Sum of MoCA 24.00 (22.00, 26.00) 24.00 (22.00, 26.00) 23.00 (21.00, 25.00)  0.025 HRR 11.87 ± 0.88 11.99 ± 0.81 11.75 ± 0.93  0.007 Per Capita 0.189 <1999 51 (12.72) 30 (15.00) 21 (10.45) 2000–4,999 335 (83.54) 165 (82.50) 170 (84.58) >5,000 15 (3.74) 5 (2.50) 10 (4.98) Education level 0.883 Junior high school and below 210 (52.37) 104 (52.00) 106 (52.74) High school and above 191 (47.63) 96 (48.00) 95 (47.26) Smoking 0.159 No 135 (33.67) 74 (37.00) 61 (30.35) Yes 266 (66.33) 126 (63.00) 140 (69.65) Drinking 0.099 No 199 (49.63) 91 (45.50) 108 (53.73) Yes 202 (50.37) 109 (54.50) 93 (46.27) Exercise  0.031 No 228 (56.86) 103 (51.50) 125 (62.19) Yes 173 (43.14) 97 (48.50) 76 (37.81) Marriage 0.771 No 13 (3.24) 7 (3.50) 6 (2.99) Yes 388 (96.76) 193 (96.50) 195 (97.01) Note: Bolded p p P-Al, plasma aluminum; BMI, Body Mass Index; HRR, hemoglobin-to-red cell distribution width ratio; the measurement data are Mean ± SD or M ( P 25 P 75 3.2 Relationship between aluminum exposure and cognitive scores With the help of a multiple linear regression model, the effect of aluminum exposure level on cognitive scores was deeply analyzed, and the results of the analysis showed that there was a significant negative correlation between the aluminum exposure level and the total MoCA scores under the dual validation of univariate and multivariate analyses. As shown in Table 2 β β Table 2 Relationship between plasma aluminum levels and cognitive scores. Variables Single factor Multifactorial β (95% CI)  p β (95% CI)  p P-Al −0.89 (−1.50–−0.27)  0.005 −0.90 (−1.50–−0.30)  0.004 Age −0.09 (−0.14–−0.05)  <0.001 −0.07 (−0.15–0.00) 0.053 BMI 0.07 (−0.00–0.15) 0.051 0.04 (−0.03–0.11) 0.268 Duration employment −0.07 (−0.10–−0.03)  <0.001 −0.01 (−0.07–0.06) 0.867 Per Capita <1999 Reference Reference 2000–4,999 0.13 (−0.82–1.08) 0.791 0.02 (−0.88–0.92) 0.967 >5,000 0.59 (−1.26–2.45) 0.532 −0.01 (−1.77–1.75) 0.989 Education level Junior middle school and below Reference Reference High school and above 1.80 (1.19–2.40)  <0.001 1.38 (0.75–2.01)  <0.001 Smoking No Reference Reference Yes −0.04 (−0.71–0.63) 0.910 −0.14 (−0.79–0.52) 0.685 Drinking No Reference Reference Yes 0.84 (0.22–1.47)  0.009 0.80 (0.19–1.41)  0.010 Exercise No Reference Reference Yes 0.65 (0.02–1.28)  0.044 0.38 (−0.23–1.00) 0.221 Marriage No Reference Reference Yes 0.02 (−1.76–1.80) 0.982 0.40 (−1.28–2.09) 0.638 Note: Bolded p p Adjusted age, BMI, duration employment, education level, per capita monthly household income, smoking, alcohol consumption, exercise, and marital status. P-Al, plasma aluminum; BMI, Body Mass Index. In addition, the RCS model confirmed the dose-effect relationship between plasma aluminum concentration and total MoCA score, as shown in Figure 1A p Table 3 β Figure 1 Restricted cubic spline model representing the association between log-transformed plasma aluminum concentrations and cognitive scores (A) (B) β Two graphs display the relationship between the natural logarithm of plasma AI concentration and its effect size (beta with 95% confidence interval). Graph A shows a significant nonlinear trend with a downward curve, while Graph B shows a less pronounced curve. Both graphs have pink shaded areas representing confidence intervals and include p-values for overall and nonlinear trends. Table 3 Threshold analysis between plasma aluminum levels and total MoCA score. Sum of MoCA Effect  p Model 1 Fitting model by standard linear regression −0.90 (−1.50–−0.30)  0.004 Model 2 Fitting model by two-piecewise linear regression Inflection point 1.81 <1.81 0.02 (−0.88–0.91) 0.973 ≥1.81 −4.17 (−6.77–−1.57)  0.002 P for likelihood test  0.002 Note: The bolded p Model 1, Model 2 adjusted age, BMI, duration employment, education level, per capita monthly household income, smoking, alcohol consumption, exercise, and marital status. 3.3 Relationship between aluminum exposure level and HRR Analyzing the relationship between aluminum exposure level and HRR, the results of univariate analysis showed that for each unit increase in aluminum exposure level, HRR decreased by 0.21 units on average ( p β Table 4 Figure 1B Table 5 Table 4 Relationship between plasma aluminum levels and HRR. Variables Single factor Multifactorial β (95% CI)  p β (95% CI)  p P-Al −0.21 (−0.38–−0.04)  0.014 −0.17 (−0.34–−0.01)  0.047 Age −0.02 (−0.03–−0.01)  0.011 −0.02 (−0.04–−0.01)  0.042 BMI 0.05 (0.03–0.07)  <0.001 0.04 (0.02–0.06)  <0.001 Duration employment −0.00 (−0.02–0.01) 0.354 0.01 (−0.01–0.03) 0.203 Per Capita <1999 Reference Reference 2000–4,999 −0.04 (−0.30–0.22) 0.744 −0.06 (−0.31–0.19) 0.654 >5,000 −0.27 (−0.77–0.24) 0.304 −0.33 (−0.82–0.16) 0.186 Education level Junior middle school and below Reference Reference High school and above 0.38 (0.22–0.55)  <0.001 0.32 (0.15–0.50)  <0.001 Smoking No Reference Reference Yes −0.04 (−0.23–0.14) 0.640 −0.00 (−0.18–0.18) 0.977 Drinking No Reference Reference Yes 0.05 (−0.12–0.22) 0.588 0.03 (−0.14–0.20) 0.710 Exercise No Reference Reference Yes 0.18 (0.01–0.35)  0.041 0.09 (−0.08–0.26) 0.288 Marriage No Reference Reference Yes 0.06 (−0.42–0.55) 0.798 0.07 (−0.39–0.54) 0.761 Note: Bolded p p Adjusted age, BMI, duration employment, education level, per capita monthly household income, smoking, alcohol consumption, exercise, and marital status. P-Al, plasma aluminum; BMI, Body Mass Index. Table 5 Threshold analysis between plasma aluminum level and HRR. HRR level Effect  p Model 1 Fitting model by standard linear regression −0.17 (−0.34–−0.00)  0.047 Model 2 Fitting model by two-piecewise linear regression Inflection point 1.68 <1.68 0.02 (−0.24–0.28) 0.873 ≥1.68 −0.56 (−1.15–0.04) 0.067 P for likelihood test 0.194 Note: The bolded p Model 1, Model 2 adjusted age, BMI, duration employment, education level, per capita monthly household income, smoking, alcohol consumption, exercise, and marital status. 3.4 Relationship between HRR level and total MoCA score HRR was included as a continuous variable in the multiple linear regression model for statistical analysis, and the results showed that there was a significant positive correlation between HRR and the total MoCA score. Specifically, as the HRR increases, the total MoCA score also increases, i.e., for every unit change in HRR, the total MoCA score increases by 0.45 points on average ( Table 6 Table 6 Relationship between HRR level and total MoCA score. Variables Single factor Multifactorial β (95% CI)  p β (95% CI)  p HRR 0.74 (0.39–1.10)  <0.001 0.45 (0.09–0.81)  0.015 Age −0.09 (−0.14–−0.05)  <0.001 −0.05 (−0.13–0.02) 0.156 BMI 0.07 (−0.00–0.15) 0.051 0.03 (−0.04–0.11) 0.381 Duration employment −0.07 (−0.10–−0.03)  <0.001 −0.01 (−0.07–0.05) 0.782 Per Capita <1999 Reference Reference 2000–4,999 0.13 (−0.82–1.08) 0.791 −0.05 (−0.96–0.85) 0.907 >5,000 0.59 (−1.26–2.45) 0.532 0.04 (−1.73–1.81) 0.964 Education level Junior middle school and below Reference Reference High school and above 1.80 (1.19–2.40)  <0.001 1.30 (0.66–1.94)  <0.001 Smoking No Reference Reference Yes −0.04 (−0.71–0.63) 0.910 −0.18 (−0.83–0.48) 0.599 Drinking No Reference Reference Yes 0.84 (0.22–1.47)  0.009 0.85 (0.24–1.46)  0.007 Exercise No Reference Reference Yes 0.65 (0.02–1.28)  0.044 0.41 (−0.20–1.03) 0.192 Marriage No Reference Reference Yes 0.02 (−1.76–1.80) 0.982 0.42 (−1.27–2.11) 0.623 Note: Bolded p p Adjusted age, BMI, duration employment, education level, per capita monthly household income, smoking, alcohol consumption, exercise, and marital status. BMI, Body Mass Index; HRR, hemoglobin-to-red cell distribution width ratio. 3.5 Role of HRR in cognitive impairment due to aluminum exposure Since the level of aluminum exposure was significantly correlated with HRR and total MoCA score, and there was also an association between HRR and total MoCA score, we hypothesized that HRR might play a mediating role in cognitive impairment induced by aluminum exposure. We analyzed the mediating role of HRR by using plasma aluminum concentration as the independent variable, cognitive score as the dependent variable, and HRR as the mediator, and the adjustment of covariates was carried out. The results showed that HRR played a partial mediating role between cognitive dysfunction due to aluminum exposure, explaining about 9.89% of the effect ( Table 7 Figure 2 Table 7 The coefficients of each path of the mediating effect. Path  β 95% CI  p P-Al → HRR −0.19 −0.36–−0.03  0.024 P-Al → MoCA −0.90 −1.51–−0.29  0.004 HRR → MoCA 0.52 0.17–0.88  0.004 Note: Bolded p p Adjusted age, BMI, duration employment, education level, per capita monthly household income, smoking, alcohol consumption, exercise, and marital status. P-Al, plasma aluminum; HRR, hemoglobin-to-red cell distribution width ratio. Figure 2 Estimated proportions of correlations between plasma aluminum concentrations and HRR-mediated cognitive scores corrected for age, BMI, length of service, education level, per capita monthly household income, smoking, alcohol consumption, exercise, and marital status. Flowchart illustrating mediation analysis. P-AI influences Sum of MoCA through HRR. Indirect effect: -0.10, 95% CI: -0.23 to -0.01, p=0.028. Total effect: -0.98, 95% CI: -1.59 to -0.40, p=0.004. Direct effect: -0.88, 95% CI: -1.49 to -0.29, p=0.006. Mediation is 9.89%. 4 Discussion This study explored HRR’s mediating role in aluminum-induced cognitive impairment. Results showed significant links between aluminum exposure and both HRR levels and cognitive dysfunction. HRR independently correlated with cognitive impairment, and mediation analysis indicated that HRR mediated 9.89% of aluminum’s total neurotoxic effect, highlighting its partial role in mediating aluminum’s impact on cognition. Evidence shows rising human exposure to aluminum, causing health concerns. Aluminum exerts toxic effects on multiple systems, including the nervous, hematopoietic, and skeletal systems, and is associated with encephalopathy, anemia, alumina disease, osteochondrosis and osteoporosis, and other adverse health effects ( 24 25 26 27 28 This study further explored the relationship between aluminum exposure and cognitive function. Maintaining metal homeostasis in the central nervous system is crucial for normal brain function, as metals serve as enzyme cofactors and key components in neuronal signaling. Disruption of metal regulation can severely impair neural networks, triggering pathological pathways that lead to oxidative stress, synaptic damage, and cognitive deficits ( 29 30 In the present study, we employed the MoCA scale to evaluate workers’ cognitive performance, as it demonstrates high sensitivity (up to 90%) for early-stage MCI detection ( 31 32 33 34 MCI represents a preclinical and transitional stage between normal aging and dementia ( 35 36 37 25 38 33 39 Detecting cognitive impairment in primary care is challenging due to screening complexities. However, blood-based biomarkers provide accessible, minimally invasive, and cost-effective alternatives, potentially aiding large-scale cognitive screening. Emerging evidence links routine blood parameters based on routine blood and biochemical tests, including Hb, platelets, and physiologic ion concentrations, are associated with cognitive impairment ( 40 41 42 43 The hemoglobin-to-red blood cell distribution width ratio (HRR) is recognized as a marker of inflammation associated with the incidence of various diseases and adverse events, and is an indicator of the level of inflammation and immunometabolism in the body. Neuroinflammation is key in neurodegenerative diseases. To facilitate early detection of dementia-related pathological changes as early as possible, considerable biomarker research has increasingly focused on several markers of peripheral inflammation that are key elements of neurodegenerative changes, including cytokines, lymphocytes, neutrophils, and various blood cell indices ( 10 11 44 45 16 14 46 16 Our findings demonstrate that the hemoglobin-to-red cell distribution width ratio (HRR) mediated approximately 9.89% of the cognitive impairment induced by aluminum exposure. Although this mediating effect does not represent the dominant pathway, its statistical significance suggests HRR may constitute one potential mechanism underlying aluminum-induced neurotoxicity. The level of HRR reflects the anemia and inflammatory state of the organism, chronic and acute cerebral hypoxia may exist as a result of respiratory, cardiovascular, or anemia disorders, and hypoxia is widely associated with cognitive deficits ( 47 48 49 The advantages of this study are as follows: this study is the first cross-sectional research on the association between HRR and cognitive function in the occupational aluminum exposure population, the focus was placed on the occupational aluminum exposure population, filling the evidence gap in the association between HRR and cognitive function in this special exposure population. Combining the traditional anemia differentiation indicator of the ratio of hemoglobin to red blood cell distribution width and extending the HRR indicator to the field of cognitive function research, a new perspective has been proposed for its potential biomarker of early neurological dysfunction. Through a cross-sectional study design, a direct association between HRR and cognitive function can be rapidly established, providing a hypothesis basis for subsequent longitudinal mechanism research. These findings highlight HRR’s dual value as both an early warning indicator and intervention target: If elevated HRR is primarily driven by anemia, correction of anemia may partially reverse cognitive impairment, and HRR could be incorporated into multi-targeted intervention (such as concurrent control of aluminum exposure, improvement of anemia, antioxidant therapy) rather than as a stand-alone target of intervention. Targeted interventions may be of more pronounced benefit in aluminum-exposed individuals with abnormal HRR (such as anemia combined with high RDW). This study provides simple and economical blood routine-derived indicators for the early screening of neurotoxicity among aluminum workers and optimizes occupational health monitoring strategies. However, this study has certain limitations: firstly, the moderate sample size may limit the generalizability of our findings, so the results should be treated with caution; secondly, this study is a cross-sectional design, so it is not possible to clarify the causal relationship between plasma aluminum exposure levels, HRR levels, and cognitive impairment. Thirdly, the subjective/anamnestic data of this study were mainly used to establish inclusion/exclusion criteria, ensuring the homogeneity of the cohort and minimizing confounding effects to the greatest extent. Although this method enhanced internal effectiveness, it failed to capture the subjective complaints reported by the research subjects. Fourth, this study did not measure the aluminum concentration in the external working environment where aluminum workers were located, and lacked specific environmental aluminum concentration data, making it difficult to determine the specific level of aluminum exposure of workers and their direct association with health effects. This also limits our ability to fully understand the potential risks to worker health from aluminum exposure in the external work environment. Finally, current research reveals the correlation characteristics among variables through statistical models. However, the underlying biological regulatory mechanisms have not yet been verified through experimental means. The biological rationality of this approach still requires further clarification through subsequent studies in combination with molecular biology, neurophysiology, or neuroimaging. Our research results indicate that the level of aluminum exposure is significantly negatively correlated with the total MoCA score: the higher the aluminum exposure, the lower the total MoCA score. It was also significantly negatively correlated with HRR, and this association remained significant even after controlling for related variables. In addition, HRR is significantly positively correlated with the total score of MoCA. This advances our understanding of aluminum toxicity mechanisms and how environmental factors impact brain health via blood components. Clinically, monitoring HRR in aluminum-exposed workers can identify changes due to high aluminum exposure and reduce cognitive impairment. Therefore, future studies should expand the sample size, consider a longitudinal design to more accurately assess the dynamic role of HRR between aluminum exposure and cognitive impairment, and incorporate detailed environmental monitoring data to more accurately quantify the level of aluminum exposure and to explore its relationship with health effects. Given that this study focuses on the health monitoring of the occupational aluminum exposure population and aims to rapidly assess the inflammatory status of the group through the basic data in routine blood tests, the selection of this indicator does not deny the clinical value of classic inflammatory indicators such as C-reactive protein (CRP), PCT, or WBC. Rather, it is a targeted choice made based on the actual demands for the convenience, economy, and operability of detection in large-scale occupational population screening. Future research can further incorporate these indicators. Through the joint analysis of multiple indicators, the characteristics of inflammatory responses related to occupational aluminum exposure can be revealed more comprehensively. 5 Conclusion Occupational aluminum exposure increases the risk of HRR levels and cognitive impairment. HRR levels may be a mediator of cognitive impairment due to aluminum exposure. It is recommended that occupational aluminum workers focus on routine blood markers in their daily physical examinations and have their HRR levels monitored regularly. The authors thank the participants and medical staff, who assisted with the sample collection. Data availability statement The original contributions presented in the study are included in the article/supplementary material, further inquiries can be directed to the corresponding author. Ethics statement The studies involving humans were approved by Shanxi Medical University (Number: 2019LL115). The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Written informed consent was obtained from the individual(s) for the publication of any potentially identifiable images or data included in this article. Author contributions R-nW: Data curation, Formal analysis, Writing – original draft, Writing – review & editing. Z-hW: Formal analysis, Writing – review & editing. W-cH: Investigation, Writing – review & editing. F-pK: Validation, Writing – review & editing. Z-yP: Validation, Writing – review & editing. JS: Validation, Writing – review & editing. X-tL: Validation, Writing – review & editing. B-lP: Conceptualization, Funding acquisition, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Meng H Liu B Lu X Tan Y Wang S Pan B Alterations of gray matter volume and functional connectivity in patients with cognitive impairment induced by occupational aluminum exposure: a case-control study Front Neurol 2025 15 15 2024 10.3389/fneur.2024.1500924 39839872 PMC11747109 2. Niu Q Overview of the relationship between aluminum exposure and health of human being Adv Exp Med Biol 2018 1091 1 31 10.1007/978-981-13-1370-7_1 30315446 3. Zuo Y Lu X Wang X Sooranna SR Tao L Chen S High-dose aluminum exposure further alerts immune phenotype in aplastic Anemia patients Biol Trace Elem Res 2021 199 1743 53 10.1007/s12011-020-02313-6 32761514 PMC7990755 4. Rahimzadeh MR Rahimzadeh MR Kazemi S Amiri RJ Pirzadeh M Moghadamnia AA Aluminum poisoning with emphasis on its mechanism and treatment of intoxication Emerg Med Int 2022 2022 1480553 10.1155/2022/1480553 35070453 PMC8767391 5. aziz I Zabut B Determination of blood indices of albino rats treated with aluminum chloride and investigation of antioxidant effects of vitamin E and C Egypt J Biol 2011 13 1 7 6. Wu K. Xu C. Tian X. Qiu G. Association between the alterations in the blood routine check parameters and cognitive impairment in the Shenzhen ageing-related disorder cohort in China 2021 7. Winchester LM Powell J Lovestone S Nevado-Holgado AJ Red blood cell indices and anaemia as causative factors for cognitive function deficits and for Alzheimer's disease Genome Med 2018 10 51 10.1186/s13073-018-0556-z 29954452 PMC6022699 8. Zhang H Cao F Zhou Y Wu B Li C Peripheral immune cells contribute to the pathogenesis of Alzheimer's disease Mol Neurobiol 2025 62 264 70 10.1007/s12035-024-04266-6 38842674 9. Zheng Y Yu Y Gao L Yu M Jiang L Zhu Q Association of red blood cell count, hemoglobin concentration, and inflammatory indices with cognitive impairment severity in Alzheimer's disease Sci Rep 2025 15 17425 10.1038/s41598-025-02468-z 40394088 PMC12092686 10. Tondo G Aprile D De Marchi F Sarasso B Serra P Borasio G Investigating the prognostic role of peripheral inflammatory markers in mild cognitive impairment J Clin Med 2023 12 10.3390/jcm12134298 37445333 PMC10342872 11. Sayed A Bahbah EI Kamel S Barreto GE Ashraf GM Elfil M The neutrophil-to-lymphocyte ratio in Alzheimer's disease: current understanding and potential applications J Neuroimmunol 2020 349 577398 10.1016/j.jneuroim.2020.577398 32977249 12. Tan B Venketasubramanian N Vrooman H Cheng CY Wong TY Chen C Haemoglobin, magnetic resonance imaging markers and cognition: a subsample of population-based study Alzheimer's Res Ther 2018 10 114 10.1186/s13195-018-0440-5 30400991 PMC6220511 13. Liu J Wang J Association between hemoglobin-to-red blood cell distribution width ratio and hospital mortality in patients with non-traumatic subarachnoid hemorrhage Front Neurol 2023 14 1180912 10.3389/fneur.2023.1180912 37388548 PMC10303799 14. Zhang Y Fang F Xi L Zhou J Xu P Tu J Association of hemoglobin-to-red blood cell distribution width ratio and cognition: a cross-sectional study Archives Gerontol Geriatrics Plus 2024 1 10.1016/j.aggp.2024.100027 15. Sun P Zhang F Chen C Bi X Yang H An X The ratio of hemoglobin to red cell distribution width as a novel prognostic parameter in esophageal squamous cell carcinoma: a retrospective study from southern China Oncotarget 2016 7 42650 60 10.18632/oncotarget.9516 27223088 PMC5173164 16. Xiong Y Xie S Yao Y Chen Y Ding J Zhou R Hemoglobin-to-red blood cell distribution width ratio is negatively associated with stroke: a cross-sectional study from Nhanes Sci Rep 2024 14 28098 10.1038/s41598-024-79520-x 39543321 PMC11564829 17. Weuve J Mendes De Leon CF Bennett DA Dong X Evans DA The red cell distribution width and anemia in association with prevalent dementia Alzheimer Dis Assoc Disord 2014 28 99 105 10.1097/WAD.0b013e318299673c 23751369 PMC3844541 18. Liu Y Xie Z Wang P Liu F Zhao L Chen C Relationship between the hemoglobin-to-red cell distribution width ratio and post-stroke cognitive impairment: a prospective study Front Aging Neurosci 2025 17 1552956 10.3389/fnagi.2025.1552956 40370755 PMC12075231 19. Xi L Fang F Zhou J Xu P Zhang Y Zhu P Association of hemoglobin-to-red blood cell distribution width ratio and depression in older adults: a cross sectional study J Affect Disord 2024 344 191 7 10.1016/j.jad.2023.10.027 37832737 20. Wang X Li T Li H Li D Wang X Zhao A Association of Dietary Inflammatory Potential with blood inflammation: the prospective markers on mild cognitive impairment Nutrients 2022 14 10.3390/nu14122417 35745147 PMC9229190 21. Mohammed Nawi A Chin SF Jamal R Simultaneous analysis of 25 trace elements in micro volume of human serum by inductively coupled plasma mass spectrometry (Icp-Ms) Pract Lab Med 2020 18 e00142 10.1016/j.plabm.2019.e00142 31720354 PMC6838531 22. Larner A Julayanont P Phillips N Chertkow H Nasreddine Z Cognitive screening instruments Cham, Switzerland Springer 2017 23. Zhonglin W Baojuan Y Analyses of mediating effects: the development of methods and models Adv Psychol Sci 2014 22 731 45 10.3724/SP.J.1042.2014.00731 24. Valenzuela-Briseño AR Arredondo-Damian JG Rascón-Careaga A Astiazaran-Garcia H Gómez-Álvarez A Esquivel-Gónzalez R Hematologic evaluation of peripheral blood in Sprague Dawley rats by chronic exposure to aluminum chloride (AlCl3) Environ Anal Health Toxicol 2022 37 e2022034 10.5620/eaht.2022034 36916047 PMC10014743 25. Renke G Almeida VBP Souza EA Lessa S Teixeira RL Rocha L Clinical outcomes of the deleterious effects of aluminum on neuro-cognition, inflammation, and health: a review Nutrients 2023 15 10.3390/nu15092221 37432384 PMC10180736 26. Chen JL Wu JN Lv XD Yang QC Chen JR Zhang DM The value of red blood cell distribution width, neutrophil-to-lymphocyte ratio, and hemoglobin-to-red blood cell distribution width ratio in the progression of non-small cell lung cancer PLoS One 2020 15 e0237947 10.1371/journal.pone.0237947 32833961 PMC7446848 27. Zaman K Zaman A Batcabe J Hematological effects of aluminum on living organisms Comp Biochem Physiol C Comp Pharmacol Toxicol 1993 106 285 93 7904906 10.1016/0742-8413(93)90136-9 28. Geyikoglu F Türkez H Bakir TO Cicek M The genotoxic, hepatotoxic, nephrotoxic, haematotoxic and histopathological effects in rats after aluminium chronic intoxication Toxicol Ind Health 2013 29 780 91 10.1177/0748233712440140 22421584 29. Das N Raymick J Sarkar S Role of metals in Alzheimer's disease Metab Brain Dis 2021 36 1627 39 10.1007/s11011-021-00765-w 34313926 30. Bondy SC Prolonged exposure to low levels of aluminum leads to changes associated with brain aging and neurodegeneration Toxicology 2014 315 1 7 10.1016/j.tox.2013.10.008 24189189 31. Nasreddine ZS Phillips NA Bédirian V Charbonneau S Whitehead V Collin I The Montreal cognitive assessment, Moca: a brief screening tool for mild cognitive impairment J Am Geriatr Soc 2005 53 695 9 10.1111/j.1532-5415.2005.53221.x 15817019 32. Xu SM Pan BL Gao D Zhang YW Huan JP Han X Blood glucose mediated the effects of cognitive function impairment related to aluminum exposure in Chinese aluminum smelting workers Neurotoxicology 2022 91 282 9 10.1016/j.neuro.2022.06.001 35679993 33. Martinez CS Alterman CD Peçanha FM Vassallo DV Mello-Carpes PB Miguel M Aluminum exposure at human dietary levels for 60 days reaches a threshold sufficient to promote memory impairment in rats Neurotox Res 2017 31 20 30 10.1007/s12640-016-9656-y 27473855 34. Liu W Liu J Gao J Duan X Zhang L Effects of subchronic aluminum exposure on learning, memory, and neurotrophic factors in rats Neurotox Res 2022 40 2046 60 10.1007/s12640-022-00599-z 36342585 35. Bai W Chen P Cai H Zhang Q Su Z Cheung T Worldwide prevalence of mild cognitive impairment among community dwellers aged 50 years and older: a meta-analysis and systematic review of epidemiology studies Age Ageing 2022 51 10.1093/ageing/afac173 35977150 36. Deng Y Zhao S Cheng G Yang J Li B Xu K The prevalence of mild cognitive impairment among Chinese people: a Meta-analysis Neuroepidemiology 2021 55 79 91 10.1159/000512597 33756479 37. Yang X Yuan Y Lu X Yang J Wang L Song J The relationship between cognitive impairment and global Dna methylation decrease among aluminum Potroom workers J Occup Environ Med 2015 57 713 7 10.1097/JOM.0000000000000474 26147539 38. Klotz K Weistenhöfer W Neff F Hartwig A Van Thriel C Drexler H The health effects of aluminum exposure Dtsch Arztebl Int 2017 114 653 9 10.3238/arztebl.2017.0653 29034866 PMC5651828 39. Xu SM Zhang YW Ju XF Gao D Yang H Wang LP Cross-sectional study based on occupational aluminium exposure population Environ Toxicol Pharmacol 2021 83 103581 10.1016/j.etap.2020.103581 33412297 40. Dong B He M Ji S Yang W Hong Q Tang Y Blood predictive biomarkers for cognitive impairment among community-dwelling older adults: a cross-sectional study in China Sci Rep 2025 15 7700 10.1038/s41598-025-92764-5 40044775 PMC11882945 41. Schneider AL Jonassaint C Sharrett AR Mosley TH Astor BC Selvin E Hemoglobin, Anemia, and cognitive function: the atherosclerosis risk in communities study J Gerontol A Biol Sci Med Sci 2016 71 772 9 10.1093/gerona/glv158 26363510 PMC4888383 42. Yang J Sui H Song H Jiao R Zhao X Red cell distribution width is related to mild cognitive impairment: a cross-sectional study of community residents Neurol India 2024 72 64 8 10.4103/ni.ni_211_22 38443003 43. Öztürk ZA Ünal A Yiğiter R Yesil Y Kuyumcu ME Neyal M Is increased red cell distribution width (Rdw) indicating the inflammation in Alzheimer's disease (ad)? Arch Gerontol Geriatr 2013 56 50 4 10.1016/j.archger.2012.10.002 23103090 44. Kara SP Altunan B Unal A Investigation of the peripheral inflammation (neutrophil-lymphocyte ratio) in two neurodegenerative diseases of the central nervous system Neurol Sci 2022 43 1799 807 10.1007/s10072-021-05507-5 34331157 PMC8324446 45. Kuyumcu ME Yesil Y Oztürk ZA Kizilarslanoğlu C Etgül S Halil M The evaluation of neutrophil-lymphocyte ratio in Alzheimer's disease Dement Geriatr Cogn Disord 2012 34 69 74 10.1159/000341583 22922667 46. Liu S Zhang H Zhu P Chen S Lan Z Predictive role of red blood cell distribution width and hemoglobin-to-red blood cell distribution width ratio for mortality in patients with Copd: evidence from Nhanes 1999-2018 BMC Pulm Med 2024 24 413 10.1186/s12890-024-03229-w 39187816 PMC11348710 47. Snyder B Simone SM Giovannetti T Floyd TF Cerebral hypoxia: its role in age-related chronic and acute cognitive dysfunction Anesth Analg 2021 132 1502 13 10.1213/ANE.0000000000005525 33780389 PMC8154662 48. Du Y Jin M Liu Q Zhao J Song A Li W Association of red Blood Cell Indices with mild cognitive impairment in Chinese elderly individuals: a matched case-control study Curr Alzheimer Res 2020 17 1161 6 10.2174/1567205018666210218144856 33602086 49. Griffin WS Inflammation and neurodegenerative diseases Am J Clin Nutr 2006 83 470s 4s 10.1093/ajcn/83.2.470S 16470015 ",
  "metadata": {
    "Title of this paper": "Inflammation and neurodegenerative diseases",
    "Journal it was published in:": "Frontiers in Public Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488707/"
  }
}