{
  "title": "Paper_2",
  "abstract": "pmc Case Rep Oncol Med Case Rep Oncol Med 1803 crimoncmed CRIONM Case Reports in Oncological Medicine 2090-6706 2090-6714 Wiley PMC12490923 PMC12490923.1 12490923 12490923 10.1155/crom/8889550 1 Case Report Isolated Leptomeningeal Carcinomatosis in Urothelial Carcinoma: A Case Report of Positive CSF Cytology With Negative Imaging https://orcid.org/0009-0003-8253-8794 Lim Christina clim54@uwo.ca  1 Winquist Eric  2 Joseph Mariamma  3 Nathan Prathana  4  1  2  3  4 Academic Editor: Jose I. Mayordomo 2025 25 9 2025 2025 479484 8889550 12 6 2025 28 8 2025 4 9 2025 25 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Christina Lim et al. Case Reports in Oncological Medicine published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. Bladder cancer is one of the most common cancers worldwide; however, leptomeningeal carcinomatosis (LMC) is an uncommon and understudied complication. We report a male patient diagnosed with LMC while in apparent clinical remission of metastatic urothelial carcinoma of the bladder. He presented with headaches, vision changes, hearing impairment, and leg weakness. Imaging of the brain and spinal cord was negative; however, the cerebrospinal fluid was positive for malignant cells consistent with high-grade urothelial carcinoma, confirming the diagnosis of LMC. Conservative measures and whole-brain radiation were ineffective, and he died 2 months after his LMC diagnosis. Literature review identified 45 cases of LMC due to bladder cancer, and we summarize these data. It is unclear whether new and more effective systemic treatment approaches for urothelial carcinoma will also reduce the risk of LMC or provide better treatment for LMC, supporting a need for more study of this devastating complication. Keywords bladder cancer leptomeningeal carcinomatosis urological oncology No funding was received for this manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Leptomeningeal carcinomatosis (LMC) describes the spread of cancer cells to the leptomeninges, including the pia, arachnoid mater, and the subarachnoid space [ 1 2 3 4 5 6 2. Case A 62-year-old male with a history of metastatic urothelial cancer presented to the emergency department with a 3-day history of occipital headache worse when sitting. He subsequently developed hearing impairment, photophobia, nausea, vomiting, and intermittent left leg weakness resulting in a fall. Computed tomography (CT) of the brain showed prominent ventricles but no other abnormal findings, and he was admitted to the hospital for investigation ( Figure 1 Seven months earlier, after presenting with hematuria, he underwent cystoscopy, which revealed a significant tumor in the right bladder wall. Transurethral resection of bladder tumor (TURBT) was performed, and the pathology confirmed muscle-invasive (T2), Grade 3 urothelial carcinoma ( Figure 2 μ The patient had received four cycles of gemcitabine (1000 mg/m 2 2 Past medical history included a diagnosis of high-grade, noninvasive, urothelial carcinoma of the bladder 7 years earlier treated with TURBT and 10 cycles of BCG, with surveillance cystoscopies for three subsequent years negative for recurrence. He was a lifelong nonsmoker and consumed two drinks of alcohol per day. There was no family history of malignancy. Following the development of his occipital headaches, lumbar puncture (LP) yielded an opening pressure of 43 cm of water, and cerebrospinal fluid (CSF) analysis showed glucose 0.6 mmol/L, protein 457 mg/L, 47 × 10 6 6 3 4 CSF cytology was positive for epithelial malignancy consistent with high-grade urothelial carcinoma ( Figure 5 3. Discussion To date, 45 cases of LMC from bladder cancer have been reported [ 7 9 Table 1 LMC is thought to be caused by the infiltration of cancer cells into the CSF, then the subarachnoid space, leading to the dissemination and seeding of the leptomeninges [ 37 1 2 35 7 LMC can have a variety of initial clinical presentations including, but not limited to, cranial nerve deficits, radicular pain, headache, back pain, visual disturbances, gait disturbances, diplopia, hearing loss, onset of psychiatric disorders, seizures, or cauda equina syndrome [ 1 2 As seen in Table 1 The gold standard for diagnosing LMC is the presence of cancer cells on CSF cytology, supplemented by T1-weighted cranial and spine MRI with gadolinium contrast [ 1 37 39 7 9 Of the 45 cases summarized in the literature, approximately 24% (11 of 45) demonstrated negative CNS imaging with positive CSF cytology. This emphasizes the importance of considering LMC when brain and spine imaging are unremarkable and supports the use of CSF cytology for definitive diagnosis when clinical suspicion is high. MRI has shown findings of LMC more commonly than CT, likely indicating that MRI is more specific in the diagnosis of LMC. We did not identify other reports of LMC in urothelial cancer patients without evidence of other metastases and negative CNS imaging. The prognosis of LMC from urothelial carcinoma is poor, with a median survival time of 35 days following diagnosis even with the use of aggressive intervention [ 1 7 40 1 There is no standardized treatment approach for LMC [ 2 7 3 4 32 3 HER2-targeted agents in breast cancer and immunotherapy in melanoma patients with CNS disease have shown greater benefits. Systemic therapy for metastatic urothelial cancer now incorporates immunotherapy and the nectin-targeted antibody-drug conjugate, enfortumab vedotin [ 41 4. Conclusion Our case report is unique because it involved negative neuroimaging and positive CSF cytology in a patient in apparent clinical remission without synchronous metastatic progression. This demonstrates the potential virulence of metastatic urothelial cancer with an abrupt presentation of LMC. Hopefully, improvements in systemic therapy for urothelial cancer will reduce the incidence of this devastating condition and provide better treatment options. A high index of suspicion for LMC in oncology patients with nonspecific CNS symptoms, along with prompt initiation of CSF cytologic studies and standardization of LMC management, remains important. Acknowledgments The authors thank Ms. Morgan Black for the assistance in obtaining consent for this report. Data Availability Statement Data sharing is not applicable to this article as no new data were created or analyzed in this study. Ethics Statement This case report was written in consultation with CARE guidelines [ 42 Consent Written consent for publication of this case report and associated images was obtained from the patient's next of kin prior to submission, in accordance with institutional policy. Conflicts of Interest The authors declare no conflicts of interest. 1 Nayar G. Ejikeme T. Chongsathidkiet P. Leptomeningeal Disease: Current Diagnostic and Therapeutic Strategies Oncotarget 2017 8 42 73312 73328 10.18632/oncotarget.20272 29069871 PMC5641214 2 Le Rhun E. Weller M. Van Den Bent M. Leptomeningeal Metastasis From Solid Tumours: EANO–ESMO Clinical Practice Guideline for Diagnosis, Treatment and Follow-Up ESMO Open 2023 8 5 101624 10.1016/j.esmoop.2023.101624 PMC10619142 37863528 3 Beauchesne P. Intrathecal Chemotherapy for Treatment of Leptomeningeal Dissemination of Metastatic Tumours Lancet Oncology 2010 11 9 871 879 10.1016/S1470-2045(10)70034-6 2-s2.0-77956188377 20598636 4 Bhambhvani H. P. Rodrigues A. J. Umeh-Garcia M. C. Gephart M. H. Leptomeningeal Carcinomatosis Neurosurgery Clinics of North America 2020 31 4 613 625 10.1016/j.nec.2020.06.010 32921356 PMC8403494 5 Yust-Katz S. Mathis S. Groves M. D. Leptomeningeal Metastases From Genitourinary Cancer: The University of Texas MD Anderson Cancer Center Experience Medical Oncology 2013 30 1 p. 429 10.1007/s12032-012-0429-z 2-s2.0-84880626862 23292836 6 Ploeg M. Aben K. K. H. Kiemeney L. A. The Present and Future Burden of Urinary Bladder Cancer in the World World Journal of Urology 2009 27 3 289 293 10.1007/s00345-009-0383-3 2-s2.0-67349258581 19219610 PMC2694323 7 Umezawa Y. Shirotake S. Kaneko G. Meningeal Carcinomatosis From Bladder Cancer: A Case Report and Review of the Literature Molecular and Clinical Oncology 2019 10 5 506 510 10.3892/mco.2019.1820 31007911 PMC6466998 8 Tomioka M. Kawase M. Kato D. Leptomeningeal Carcinomatosis in Urothelial Carcinoma of the Urinary Bladder: A Report of a Patient With a Fulminant Course Who Died of Cancer After Definitive Therapies Case Reports in Urology 2021 2021 5543939 10.1155/2021/5543939 34012689 PMC8105107 9 Lambird J. Beerepoot L. Leptomeningeal Carcinomatosis as Primary Presentation of Metastatic Urothelial Cancer BML Case Reports 2018 2018 10.1136/bcr-2017-224150 2-s2.0-85056377678 PMC6229135 30413436 10 Bloch J. L. Nieh P. T. Walzak M. P. Brain Metastases From Transitional Cell Carcinoma The Journal of Urology 1987 137 1 97 99 10.1016/S0022-5347(17)43886-9 2-s2.0-0023200765 3795376 11 Bishop J. R. Moul J. W. Maldonado L. McLeod D. G. Transitional Cell Carcinomatous Meningitis After M-VAC (Methotrexate, Vinblastine, Doxorubicin, and Cisplatin) Chemotherapy Urology 1990 36 4 373 377 10.1016/0090-4295(90)80253-j 2-s2.0-0025086923 2219624 12 Bowen C. Carcinomatous Meningitis Secondary to Transitional Cell Bladder Cancer Accessed October 9, 2024. https://oce-ovid-com.proxy1.lib.uwo.ca/article/00007611-201008000-00017/HTML 10.1097/SMJ.0b013e3181e6d3a7 20622726 13 Bruna J. Rojas-Marcos I. Martínez-Yelamos S. Meningeal Carcinomatosis as the First Manifestation of a Transitional Cell Carcinoma of the Bladder Journal of Neuro-Oncology 2003 63 1 63 67 10.1023/a:1023781604980 2-s2.0-0038545210 12814256 14 Butchart C. Dahle-Smith A. Bissett D. Mackenzie J. M. Williams D. J. P. Isolated Meningeal Recurrence of Transitional Cell Carcinoma of the Bladder Case Reports in Oncology 2010 3 2 171 175 10.1159/000315473 20740192 PMC2919995 15 Cozzarini C. Reni M. Mangili F. Baldoli M. C. Galli L. Bolognesi A. Meningeal Carcinomatosis From Transitional Cell Carcinoma of the Bladder: Report of Two Cases and Review of the Literature Cancer Investigation 1999 17 6 402 407 10.3109/07357909909021432 2-s2.0-0032795758 10434951 16 Eng C. Cunningham D. Quade B. J. Schwamm L. Kantoff P. W. Skarin A. T. Meningeal Carcinomatosis From Transitional Cell Carcinoma of the Bladder Cancer 1993 72 2 553 557 10.1002/1097-0142(19930715)72:2&#x0003c;553::aid-cncr2820720236&#x0003e;3.0.co;2-z 8319186 17 Hasbini A. Himberlin C. Beguinot I. Bonnet-Gausserand F. Coninx P. La méningite carcinomateuse: une complication rare du cancer de la vessie Rev Médecine Interne 1997 18 5 402 406 10.1016/S0248-8663(97)82512-X 2-s2.0-0031005509 9183449 18 Hust M. H. Pfitzer P. Cerebrospinal Fluid and Metastasis of Transitional Cell Carcinoma of the Bladder Acta Cytologica 1982 26 2 217 223 6952725 19 Hussein A. M. Savaraj N. Feun L. G. Ganjei P. Donnelly E. Carcinomatous Meningitis From Transitional Cell Carcinoma of the Bladder: Case Report Journal of Neuro-Oncology 1989 7 3 255 260 10.1007/BF00172919 2-s2.0-0024394235 2795119 20 Imamura S. Nozawa I. Imamura M. Murakami Y. Clinicopathologic Study of Leptomeningeal Carcinomatosis Involving the Temporal Bone Annals of Otology, Rhinology, and Laryngology 1997 106 8 674 679 10.1177/000348949710600811 2-s2.0-0030742956 9270432 21 Isaka T. Maruno M. Sato M. Brain Metastasis From Small-Cell Neuroendocrine Carcinoma of the Urinary Bladder: A Case Report Brain Tumor Pathology 2002 19 2 117 122 10.1007/BF02478938 2-s2.0-0036952581 12622144 22 Kastritis E. Zagouri F. Dimopoulos M. A. Papadimitriou C. A. Carcinomatous Meningitis From Transitional Cell Carcinoma of the Urinary Bladder Journal of BU ON.: Official Journal of the Balkan Union of Oncology 2011 16 2 373 374 21766515 23 Kim S. Shin J. Kim D. Y. Choi G. H. Kim M. J. Choi J. Y. Radiomics on Gadoxetic Acid-Enhanced Magnetic Resonance Imaging for Prediction of Postoperative Early and Late Recurrence of Single Hepatocellular Carcinoma Clinical Cancer Research 2019 25 13 3847 3855 10.1158/1078-0432.CCR-18-2861 2-s2.0-85068563562 30808773 24 Iriarte A. L. García J. A. Riaño R. I. Jaime V. U. Sastre E. G. Corral N. F. Carcinomatosis meníngea en un tumor vesical Actas Urologicas Españolas 1998 23 10 873 875 10.1016/S0210-4806(99)72387-9 2-s2.0-17644434337 10670130 25 Mandell S. Wernz J. Morales P. Weinberg H. Steinfeld A. Carcinomatous Meningitis From Transitional Cell Carcinoma of Bladder Urology 1985 25 5 520 521 10.1016/0090-4295(85)90466-2 2-s2.0-0022189634 3992779 26 Molek K. R. Seili-Bekafigo I. Štemberger C. Jonjić N. Đordević G. Duletić-Načinović A. Plasmacytoid Urothelial Carcinoma--Diagnostic Challenge in Cytology Diagnostic Cytopathology 2013 41 4 369 373 10.1002/dc.22867 2-s2.0-84876473875 22550058 27 Matsushita M. Kawasaki Y. Okada Y. Carcinomatous Meningitis From Urothelial Carcinoma of Bladder and Ureter: Case Report Nihon Hinyokika Gakkai zasshi. The Japanese Journal of Urology 2004 95 7 817 819 10.5980/jpnjurol1989.95.817 2-s2.0-10044268363 15624493 28 Raghavan D. Chye R. W. Treatment of Carcinomatous Meningitis From Transitional Cell Carcinoma of the Bladder British Journal of Urology 1991 67 4 438 440 10.1111/j.1464-410x.1991.tb15178.x 2-s2.0-0025793987 2032089 29 Santarossa S. Vaccher E. Balestreri L. Volpe R. Tirelli U. Solitary Meningeal Recurrence in a Patient With Transitional Cell Carcinoma of the Bladder With Locally Bulky Disease at Presentation Journal of Neuro-Oncology 1997 35 2 141 143 10.1023/a:1005870408066 2-s2.0-0030751706 9266450 30 Steg R. E. Frank A. R. Lefkowitz D. M. Complex Partial Status Epilepticus in a Patient With Dural Metastases Neurology 1993 43 11 2389 2392 10.1212/wnl.43.11.2389 8232965 31 Sugimori K. Kobayashi K. Hayashi M. Sakai N. Sasaki M. Koshino Y. Leptomeningeal Carcinomatosis From Urinary Bladder Adenocarcinoma: A Clinicopathological Case Study Neuropathology 2005 25 1 89 94 10.1111/j.1440-1789.2004.00580.x 2-s2.0-16444387589 15822823 32 Swallow T. W. Mabbutt S. Bell C. R. W. Muscle Invasive Bladder Cancer Culminating With Leptomeningeal Carcinomatosis Canadian Urological Association Journal 2015 9 11-12 E903 E904 10.5489/cuaj.3185 2-s2.0-84949682804 26834903 PMC4707915 33 Tadepalli S. Coleman T. Hacket L. A. Liles G. B. Carcinomatous Meningitis: The Natural History of Successfully Treated Metastatic Bladder Cancer Case Reports in Oncology 2011 4 2 406 412 10.1159/000331263 2-s2.0-80052735757 21941490 PMC3177797 34 Teyssonneau D. Daste A. Dousset V. Hoepffner J. L. Ravaud A. Gross-Goupil M. Metastatic Non-Muscle Invasive Bladder Cancer With Meningeal Carcinomatosis: Case Report of an Unexpected Response BMC Cancer 2017 17 1 p. 323 10.1186/s12885-017-3309-2 2-s2.0-85019066603 28494780 PMC5425980 35 Uncu D. Arpaci F. Beyzadeoglu M. Meningeal Carcinomatosis: An Extremely Rare Involvement of Urinary Bladder Carcinoma Tumori Journal 2010 96 2 352 354 10.1177/030089161009600229 20572600 36 Zada G. Chen T. C. A Novel Method for Administering Intrathecal Chemotherapy in Patients With Leptomeningeal Metastases and Shunted Hydrocephalus Neurosurgery 2010 67 3 onsE306 onsE307 10.1227/01.NEU.0000383138.78632.BA 2-s2.0-78650637012 20679917 37 Chamberlain M. C. Sandy A. D. Press G. A. Leptomeningeal Metastasis Neurology 1990 40 3_part_1 435 438 10.1212/wnl.40.3_part_1.435 2314584 38 Mack F. Baumert B. G. Schäfer N. Therapy of Leptomeningeal Metastasis in Solid Tumors Cancer Treatment Reviews 2016 43 83 91 10.1016/j.ctrv.2015.12.004 2-s2.0-84962909752 26827696 39 Collie D. A. Brush J. P. Lammie G. A. Imaging Features of Leptomeningeal Metastases Clinical Radiology 1999 54 11 765 771 10.1016/S0009-9260(99)91181-9 2-s2.0-0032702863 10580769 40 Balm M. Hammack J. Leptomeningeal Carcinomatosis Archives of Neurology 1996 53 7 626 632 10.1001/archneur.1996.00550070064013 2-s2.0-0029901665 8929170 41 Powles T. Valderrama B. P. Gupta S. Enfortumab Vedotin and Pembrolizumab in Untreated Advanced Urothelial Cancer New England Journal of Medicine 2024 390 10 875 888 10.1056/NEJMoa2312117 38446675 42 Gagnier J. J. Kienle G. Altman D. G. Moher D. Sox H. Riley D. The CARE Guidelines: Consensus-Based Clinical Case Reporting Guideline Development Global Advances in Health and Medicine 2013 2 5 38 43 10.7453/gahmj.2013.008 24416692 PMC3833570 Figure 1 CT brain imaging demonstrating prominent ventricles. (a) Axial and (b) sagittal noncontrast CT images of the brain show prominent lateral and third ventricles without evidence of hydrocephalus, mass effect, or acute intracranial pathology. No signs of leptomeningeal disease were detected radiographically, despite the patient's neurologic symptoms (original image, Department of Medical Imaging, Western University). Figure 2 Histopathology of bladder tumor demonstrating invasive high-grade urothelial carcinoma. Hematoxylin and eosin (H&E) stained section of bladder curettings at 40× magnification shows invasive high-grade urothelial carcinoma with marked nuclear atypia and disorganized architecture. There was evidence of muscle invasion (original image, Department of Pathology, Western University). Figure 3 MRI of the brain (DWI-DTI) showing no evidence of neoplastic involvement. Axial diffusion–weighted and diffusion tensor imaging (DWI-DTI) sequences demonstrate no definite hydrocephalus or ventricular obstruction. There is no radiologic evidence of cranial neoplastic disease or leptomeningeal enhancement, despite positive cerebrospinal fluid cytology for malignant cells (original image, Department of Medical Imaging, Western University). Figure 4 MRI of the entire spine showing no evidence of leptomeningeal carcinomatosis. Sagittal T1-weighted postcontrast MRI of the cervical, thoracic, and lumbar spine shows no abnormal leptomeningeal enhancement or evidence of spinal metastases. Findings were radiographically unremarkable despite positive cerebrospinal fluid cytology, underscoring the diagnostic limitations of imaging in leptomeningeal carcinomatosis (original image, Department of Medical Imaging, Western University). Figure 5 Cerebrospinal fluid cytology and immunocytochemistry confirming metastatic urothelial carcinoma. (a) Papanicolaou-stained cytology smear (40×) of cerebrospinal fluid demonstrates dissociated and loosely cohesive of malignant epithelial cells consistent with high-grade urothelial carcinoma. Immunocytochemistry (40×) shows carcinoma cells positive for (b) cytokeratin AE1/AE3, (c) cytokeratin 7 (CK7), and (d) cytokeratin 20 (CK20), supporting urothelial origin (original image, Department of Pathology, Western University). Table 1 Summary of reported cases of leptomeningeal carcinomatosis in patients with bladder cancer. Overview of 45 published case reports describing patient characteristics, clinical presentation, imaging findings, cerebrospinal fluid (CSF) results, treatment approaches, and outcomes in individuals diagnosed with leptomeningeal carcinomatosis secondary to urothelial carcinoma. Data were extracted from peer-reviewed case reports identified through a structured literature review.  Author  Year of LMC diagnosis  1° Ca  Age  Sex  Presenting symptoms of LMC  CT  MRI  CSF  Treatment  Survival Bloch et al. [ 10 1986 TCC 67 M A, HA, and C + X + WBRT for initial brain mass 4 months Bishop et al. [ 11 1990 TCC 60 M Sz and Sc − X + ITM and WBRT 2 months Bishop et al. [ 11 1990 TCC 55 M NR, C, Da, and Sz − X + None < 1 month Bowen [ 12 2010 TCC 50 M Da, CN, FD, HL, and A − + + WBRT 2 months Bruna et al. [ 13 2003 TCC 66 M Sz − − + ITM 2 months Butchart et al. [ 14 2010 TCC 58 M PW and Di − − + None < 1 month Cozzarini et al. [ 15 1999 TCC 46 M N, V, HA, and C − + X ITC 5 months Cozzarini et al. [ 15 1999 TCC 40 M HA, LH, C, and V − + + ITC 1 month Eng et al. [ 16 1993 TCC 71 M WA, Da, and FD − + + None 25 days Eng et al. [ 16 1993 TCC 64 M HA, N, V, A, and PW − − + ITC and SR 3 months Hasbini et al. [ 17 1997 Undiff bladder Ca 63 M A and C X X + None 18 days Hust and Pfitzer [ 18 1982 TCC 52 M A and Di + X + None 1 month Hust and Pfitzer [ 18 1982 TCC 66 F A X X + None 15 days Hussein et al. [ 19 1991 TCC 60 M HA − + + ITC and SR 5 months Imamura et al. [ 20 1997 TCC 71 M HL, FD, Di, Dp, Da, HA, and NR + X + Surg resection < 3 months Isaka et al. [ 21 2002 Small cell NE Ca (SCNC) 67 M HA and PW + + + Surgical resection, WBRT, chemotherapy, and Ommaya reservoir 5 months Kastritis et al. [ 22 2011 TCC 67 M NR, PN, and C X X + ITC 9 days Kim et al. [ 23 2005 TCC 76 M C − + + None 1 month Lambird and Beerepoot [ 9 2018 UC 59 M HA, Di, HTN, and AM X − + None < 1 month Loizaga iriarte et al. [ 24 1999 X 60 M PW and PN − + X SCT < 1 month Mandell et al. [ 25 1985 TCC 59 M Di, Vt, and HFLD − X + ITM and SR X Molek et al. [ 26 2013 Plasmacytoid UC 49 M CN, Di, A, PW, Sz, and HL X X + None 10 days Matsushita et al. [ 27 2004 TCC 77 M NR and PW X X + None 6 days Raghavan and Chye [ 28 1991 TCC 42 M HA, C, and Dr − X + ITC and SR 4 months Santarossa et al. [ 29 1997 TCC 52 F Sz − − + ITM and WBRT 9 months Steg et al. [ 30 1993 TCC 68 M Sz X + − WBRT < 1 month Sugimori et al. [ 31 2005 AdenoCa 73 M HA, A, and SS − − + None 6 days Swallow et al. [ 32 2015 UC 51 F Sz, NR, and PW X + − None < 1 month Tadepalli et al. [ 33 2011 TCC 47 M HA and CN X + + ITM via Ommaya and WBRT > 9 months Teyssonneau et al. [ 34 2017 UC 63 M Di and CN + + − SCT < 4 years complete response on PET Tomioka et al. [ 8 2021 UC with CIS 45 M Vt and Da − + + Dex 6.6 mg IV, WBRT (30 Gy), and pembrolizumab (200 mg) 1 month Umezawa et al. [ 7 2018 UC 66 M N and PW X + X Scheduled for WBRT but patient died 14 days Uncu et al. [ 35 2007 TCC 52 M HA and LH − + + WBRT and ITM 2 months Bowen [ 12 2000 TCC 46 M D − + − ITM and SCT < 1 month Bowen [ 12 2000 TCC 68 M C, CDI, and SS + X X None < 1 month Cozzarini et al. [ 15 1964 NR X X X X X X X NR Yust-Katz et al. [ 5 2013 Signet ring signet cell adenoCa X X X X X X X 8 weeks Yust-Katz et al. [ 5 2013 TCC X X X X X X X 29 weeks Yust-Katz et al. [ 5 2013 AdenoCa X X X X X X X 14 weeks Yust-Katz et al. [ 5 2013 TCC X X X X X X X 2 weeks Yust-Katz et al. [ 5 2013 TCC X X X X X X X 6 weeks Yust-Katz et al. [ 5 2013 TCC X X X X X X X 3 weeks Yust-Katz et al. [ 5 2013 Small oat cell Ca X X X X X X X 22 week Yust-Katz et al. [ 5 2013 TCC X X X X X X X 4 weeks Zada and Chen [ 36 2010 TCC 60 M HA − + + ITC NR This study 2024 UC 63 M HA, Di, and HL − − + WBRT 2 months  Note: Abbreviations: A, ataxia; AM, adrenal mass; C, confusion; CDI, central diabetes insipidus; CN, cranial nerve palsy; Da, dysarthria; Di, diplopia or vision loss; Dp, dysphagia; Dr, drowsiness; F, female; FD, facial droop; HA, headache; HL, hearing loss; HTN, hypertension; ITM, intrathecal methotrexate; IVS, intravenous steroids; LH, lightheadedness; M, male; N, nausea; NR, nuchal rigidity; PN, polyneuropathy; PW, peripheral weakness; RSc, surgical resection; Sc, syncope; SCT, systemic chemotherapy; SR, spinal radiation; Sz, seizure activity; TCC, transitional cell carcinoma; UC, urothelial carcinoma; V, vomiting; Vt, vertigo; WA, Wernicke aphasia; WBRT, whole brain radiation therapy. ",
  "metadata": {
    "Title of this paper": "The CARE Guidelines: Consensus-Based Clinical Case Reporting Guideline Development",
    "Journal it was published in:": "Case Reports in Oncological Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490923/"
  }
}