{
  "title": "Paper_445",
  "abstract": "pmc Haematologica Haematologica 820 haematol HAEMA Haematologica 0390-6078 1592-8721 Ferrata Storti Foundation PMC12485317 PMC12485317.1 12485317 12485317 40371888 10.3324/haematol.2025.287774 1 Review Articles Treatment-related mutagenic processes in acute lymphoblastic leukemia van der Ham Cédric G.  1 van Leeuwen Frank N.  1 Kuiper Roland P.  1  2 Contributions RPK conceptualized the study and supervised the review. CGH conceptualized the study, wrote the first version of the manuscript, and prepared the figures. All authors wrote the manuscript. 1 2 Utrecht University Medical Center, Utrecht University the Netherlands R.P. Kuiper r.kuiper@prinsesmaximacentrum.nl  Disclosures  No conflicts of interest to disclose. 15 5 2025 01 10 2025 110 10 498052 2261 2272 06 3 2025 30 4 2025 15 05 2025 02 10 2025 02 10 2025 Copyright© 2025 Ferrata Storti Foundation https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution Noncommercial License ( by-nc 4.0 Karyotyping, SNP arrays, fluorescence in situ TP53 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Over the past decades, our understanding of the genetic drivers of acute lymphoblastic leukemia (ALL) has greatly improved. Initially, karyotyping and fluorescence in situ ETV6::RUNX1 BCR::ABL1 1 2 3 3 4 Next-generation sequencing techniques were also of great importance in the identification of secondary drivers. In fact, some primary subtype-defining drivers, like ETV6::RUNX1 5 ETV6 PAX5 6 7 IKZF1 8-10 11-13 Next-generation sequencing studies have also provided information about the frequency of somatic mutations. Overall, the mutational load in ALL is among the lowest in human cancer. 14 15 13 14 15 14 15 14-16 15 17 Mutational signatures are commonly detected in cancer and can originate from acquisition of mutations during DNA replication as well as from abnormal activation of mutational processes or defects in DNA repair. 14 15 18 19 15 15 20 In ALL, several mutational processes were shown to be active at time of diagnosis, often in specific subtypes. For example, a subset of patients with aneuploid karyotypes, including the hyperdiploid, near haploid and iAMP21 subtypes, are affected by SBS7a, a mutational signature that has been associated with UV-light induced DNA damage. 12 13 21 ETV6::RUNX1 ETV6::RUNX1 12 13 22 23 Acute lymphoblastic leukemia is mainly a pediatric disease with approximately 80% of cases occurring in children. 24 25 26 24 27 28 4 24 29 The mutational load in ALL generally increases with every relapse, and in patients that experience multiple relapses, the mutational load may even reach a hypermutation threshold. 11 30 31 32 Treatment-related mutational signatures in acute lymphoblastic leukemia Acute lymphoblastic leukemia treatment is extensive, consisting of an induction phase, a consolidation phase, and a maintenance phase. In total, treatment generally lasts two years, and involves a large variety of chemotherapeutics. 24 29 33-36 15 37 in vitro in vitro in vivo in vivo Regarding the in vitro 20 38 39 20 39 in vitro in vivo The second strategy to identify therapy-related mutational processes is by studying cohorts after therapy. Mutational signature analysis in relapsed ALL has so far revealed six mutational signatures that can be associated with ALL treatment ( Table 1 40 41 30 40 40 41 in vitro 20 39 30 42 43 25 Thiopurine metabolism Thiopurines have been a core component of ALL treatment since the 1950s 44 24 29 45 Table 1. Mutational signatures identified after acute lymphoblastic leukemia treatment. 6-MP is a pro-drug that requires metabolic activation to become cytotoxic. The first conversion step is catalyzed by hypoxanthine-guanine phosphoribosyltransferase (HGPRT) to produce thioinosine monophosphate (TIMP). TIMP is further metabolized to form thioguanine nucleotides (TGN) or methyl-thioinosine monophosphate. 46-48 Figure 1 46 46 49 50 Figure 1 46 48 Besides 6-MP, the thiopurine analog 6-thioguanine (6-TG) is also used in ALL treatment, but 6-MP is now preferred due to 6-TG hepatotoxicity. 51 Figure 1 46 46 de novo Figure 1 46-48 Figure 1. Pathway of thiopurine pro-drug conversion to cytotoxic thioguanosine triphosphate. de novo de novo DNA mismatch repair in acute lymphoblastic leukemia and thiopurine metabolism MMR plays a key role in the repair of thioguanine-thymine lesions, as well as in triggering apoptosis upon thiopurine exposure. MMR deficiency, caused by alterations (SNV, indels or deletions) in either of the key genes MSH2 MSH6 MLH1 PMS2 15 52 MSH2 MSH6 11 53 54 53 52 53 52 MSH2 MSH6 MLH1 PMS2 41 55-57 Recently, it was noticed that MMR deficiency rarely co-occurs with mutations in the base excision repair pathway. Hence, the authors posited that base excision repair would be critical for survival of thiopurine DNA damage in an MMR-deficient context. 54 54 The etiology of thiopurine-associated mutational signatures SBS87 and thio-dMMR have been identified in large cohorts of relapsed patients. 11 40 41 40 41 52-54 Figure 2 Whereas TGN have no known preference for specific genomic regions or consensus sequences, 48 58 59 15 18 41 While Yang et al 41 11 40 41 et al et al 11 41 Possible mechanisms underlying thiopurine mutagenesis Despite widespread use of thiopurines in ALL treatment, the detection of SBS87 in only approximately 15% of first relapses may be unexpected. 40 41 Figure 2. Cytotoxicity and mutagenesis by the thiopurine metabolite thioguanosine triphosphate. Numerous genes regulate thiopurine metabolism and, thereby, the efficacy and toxicity of 6-MP treatment ( Figure 1 TPMT NUDT15 60 61 Figure 1 46 Figure 1 61 NUDT15 TPMT 60-62 63 de novo Figure 1 63 TPMT et al TPMT 40 NT5C2 PRPS1 PRPS2 NT5C2 Figure 1 64-66 PRPS1 de novo de novo PRPS1 de novo Figure 1 67 PRPS2 68 NT5C2 PRPS1 30 41 NT5C2 PRPS1 NT5C2 PRPS1 Another cause of SBS87 could be a more general 6-MP dosing issue. The most accurate measure of thiopurine efficacy during maintenance therapy is the amount of thioguanine nucleotides incorporated into DNA, called the DNA-TGN. As leukemic cells and circulating leukocytes are similarly exposed to thiopurines, the DNA-TGN of circulating leukocytes can be used as a proxy. 69 69 70 71 72 A third possible cause of SBS87 relates to the need for synergy with other drugs, as 6-MP alone might simply not eliminate all leukemic cells in a patient. ALL is treated with a multi-drug regimen and resistance to a single drug will lower treatment efficacy. 73 35 36 45 Figure 1 47 74 de novo Figure 1 47 74 47 74 75 76 77 Pathogenicity of mutational signatures Mutational processes can affect highly specific DNA contexts and, as a result, some mutational processes have a high propensity of inducing specific driver (hotspot) mutations. 78 79 80 81 The role of treatment-related mutational processes in relapse development has also been studied in ALL. SBS86, SBS87 and thio-dMMR were all found to induce relapse-driving mutations. 30 40 41 TP53 82 NT5C2 PRPS1 66 67 NR3C1 83 30 40 41 TP53 Table 2 Figure 2 TP53 et al 41 Around 0.5-2% of children treated for cancer develop a therapy-related second malignancy. 5 84 32 TP53 32 61 86 Future perspectives Insight into the mutational processes at play in ALL has helped understand the negative side-effects of chemotherapy and the process of relapse development. Nevertheless, much remains to be studied. For example, it is still not fully understood why treatment-related mutations are only found in a subset of patients, but metabolic defects and acquired therapy resistance likely play a role. Moreover, techniques to recognize those patients acquiring treatment-related mutations before a relapse-driving mutation is induced need further development. Additionally, there are rare mutational signatures that are only sporadically identified. What causes patients to acquire mutagenesis that is not or rarely seen in other patients, and if such rare mutational signatures impact therapy and disease development, requires further study as well. Another key area of research is the role of treatment-related mutagenesis in second malignancies. Identifying which patients are at the greatest risk of second malignancies could enable effective monitoring and prevention strategies to reduce mutational burden during treatment. Furthermore, the presence of treatment-related mutational signatures in relapsed adult ALL is understudied, despite the high relapse rate of adult ALL. Adult treatment protocols are mostly based on pediatric treatment regimens. 24 29 Table 2. Recurrent pathogenic driver mutations induced by treatment-related mutagenesis. To better monitor if and when patients acquire treatment-related mutations, studies are needed in which the effective drug dose is closely monitored throughout treatment. In the case of SBS87, the incorporation rate of thioguanines in DNA should then be monitored during treatment. It will be interesting to compare the rate of SBS87 acquisition between patients that had extensive periods of low thioguanine incorporation with patients that had high thioguanine incorporation levels. Such studies could help clarify whether it is thiopurine underexposure or overexposure that causes SBS87. A major ongoing development in ALL treatment is the addition of various forms of immunotherapy. 87 87 TP53 AT M CDKN2A 42 Over the past decades, multiple ALL relapse-drivers have been identified. 88 NT5C2 NT5C2 in vitro 64-66 NT5C2 NT5C2 The additional mutational load induced by mutational signatures is thought to result in higher clonal heterogeneity. This increased clonal heterogeneity may increase the chance that a therapy-resistant clone emerges, as recently observed in patients treated with InO. 42 81 89 TP53 TP53 82 TP53 90 91 92-94 95 96 97 98 Finally, mutational processes have mostly been defined using SBS, but this does not necessarily mean that other mutational signatures are absent. After all, rare or less distinct mutational signatures can easily be missed when lacking sufficient power. Moreover, the repertoire of mutational signatures is ever expanding, as mutational signatures have now been defined for copy number alterations, 99 100 101-103 104 12 References 1. Harrison CJ Johansson B. Acute lymphoblastic leukemia Heim S Mitelman F Cancer Cytogenetics: Chromosomal and Molecular Genetic Aberrations of Tumor Cells. 4th ed John Wiley & Sons Ltd 2015 198 251 2. Inaba H Mullighan CG Pediatric acute lymphoblastic leukemia Haematologica 2020 105 11 2524 2539 33054110 10.3324/haematol.2020.247031 PMC7604619 3. Iacobucci I Kimura S Mullighan CG Biologic and therapeutic implications of genomic alterations in acute lymphoblastic leukemia J Clin Med 2021 10 17 3792 34501239 10.3390/jcm10173792 PMC8432032 4. Jeha S Choi J Roberts KG Clinical significance of novel subtypes of acute lymphoblastic leukemia in the context of minimal residual disease-directed therapy Blood Cancer Discov 2021 2 4 326 337 34250504 10.1158/2643-3230.BCD-20-0229 PMC8265990 5. Papaemmanuil E Rapado I Li Y RAG-mediated recombination is the predominant driver of oncogenic rearrangement in ETV6-RUNX1 acute lymphoblastic leukemia Nat Genet 2014 46 2 116 125 24413735 10.1038/ng.2874 PMC3960636 6. Kuiper RP Schoenmakers EFPM van Reijmersdal SV High-resolution genomic profiling of childhood ALL reveals novel recurrent genetic lesions affecting pathways involved in lymphocyte differentiation and cell cycle progression Leukemia 2007 21 6 1258 1266 17443227 10.1038/sj.leu.2404691 7. Mullighan CG Goorha S Radtke I Genome-wide analysis of genetic alterations in acute lymphoblastic leukaemia Nature 2007 446 7137 758 764 17344859 10.1038/nature05690 8. Mullighan CG Su X Zhang J Deletion of IKZF1 and prognosis in acute lymphoblastic leukemia N Engl J Med 2009 360 5 470 480 19129520 10.1056/NEJMoa0808253 PMC2674612 9. Kuiper RP Waanders E van der Velden VHJ IKZF1 deletions predict relapse in uniformly treated pediatric precursor B-ALL Leukemia 2010 24 7 1258 1264 20445578 10.1038/leu.2010.87 10. Marke R van Leeuwen FN Scheijen B. The many faces of IKZF1 in B-cell precursor acute lymphoblastic leukemia Haematologica 2018 103 4 565 574 29519871 10.3324/haematol.2017.185603 PMC5865415 11. Waanders E Gu Z Dobson SM Mutational landscape and patterns of clonal evolution in relapsed pediatric acute lymphoblastic leukemia Blood Cancer Discov 2020 1 1 96 111 32793890 10.1158/0008-5472.BCD-19-0041 PMC7418874 12. Studd JB Cornish AJ Hoang PH Law P Kinnersley B Houlston R. Cancer drivers and clonal dynamics in acute lymphoblastic leukaemia subtypes Blood Cancer J 2021 11 11 177 34753926 10.1038/s41408-021-00570-9 PMC8578656 13. Brady SW Roberts KG Gu Z The genomic landscape of pediatric acute lymphoblastic leukemia Nat Genet 2022 54 9 1376 1389 36050548 10.1038/s41588-022-01159-z PMC9700506 14. Alexandrov LB Nik-Zainal S Wedge DC Signatures of mutational processes in human cancer Nature 2013 500 7463 415 421 23945592 10.1038/nature12477 PMC3776390 15. Alexandrov LB Kim J Haradhvala NJ The repertoire of mutational signatures in human cancer Nature 2020 578 7793 94 101 32025018 10.1038/s41586-020-1943-3 PMC7054213 16. Koh G Degasperi A Zou X Momen S Nik-Zainal S. Mutational signatures: emerging concepts, caveats and clinical applications Nat Rev Cancer 2021 21 10 619 637 34316057 10.1038/s41568-021-00377-7 17. Degasperi A Zou X Amarante TD Substitution mutational signatures in whole-genome-sequenced cancers in the UK population Science 2022 376 6591 science.abl9283 35949260 10.1126/science.abl9283 PMC7613262 18. Alexandrov LB Jones PH Wedge DC Clock-like mutational processes in human somatic cells Nat Genet 2015 47 12 1402 1407 26551669 10.1038/ng.3441 PMC4783858 19. Bertrums EJM Rosendahl Huber AKM de Kanter JK Elevated mutational age in blood of children treated for cancer contributes to therapy-related myeloid neoplasms Cancer Discov 2022 12 8 1860 1872 35678530 10.1158/2159-8290.CD-22-0120 PMC7613255 20. Kucab JE Zou X Morganella S A compendium of mutational signatures of environmental agents Cell 2019 177 4 821 836.e16 30982602 10.1016/j.cell.2019.03.001 PMC6506336 21. Hayward NK Wilmott JS Waddell N Whole-genome landscapes of major melanoma subtypes Nature 2017 545 7653 175 180 28467829 10.1038/nature22071 22. Li Z Zhao H Yang W Molecular and pharmacological heterogeneity of ETV6::RUNX1 acute lymphoblastic leukemia Nat Commun 2025 16 1 1153 39880832 10.1038/s41467-025-56229-7 PMC11779914 23. Petljak M Dananberg A Chu K Mechanisms of APOBEC3 mutagenesis in human cancer cells Nature 2022 607 7920 799 807 35859169 10.1038/s41586-022-04972-y PMC9329121 24. Terwilliger T Abdul-Hay M. Acute lymphoblastic leukemia: a comprehensive review and 2017 update Blood Cancer J 2017 7 6 e577 28665419 10.1038/bcj.2017.53 PMC5520400 25. Sentís I Gonzalez S Genescà E The evolution of relapse of adult T cell acute lymphoblastic leukemia Genome Biol 2020 21 1 284 33225950 10.1186/s13059-020-02192-z PMC7682094 26. Roberts KG Genetics and prognosis of ALL in children vs adults Hematology Am Soc Hematol Educ Program 2018 2018 1 137 145 30504302 10.1182/asheducation-2018.1.137 PMC6245970 27. Iacobucci I Mullighan CG Genetic basis of acute lymphoblastic leukemia J Clin Oncol 2017 35 9 975 983 28297628 10.1200/JCO.2016.70.7836 PMC5455679 28. Pieters R Mullighan CG Hunger SP Advancing diagnostics and therapy to reach universal cure in childhood ALL J Clin Oncol 2023 41 36 5579 5591 37820294 10.1200/JCO.23.01286 PMC10730082 29. Gökbuget N Boissel N Chiaretti S Management of ALL in adults: 2024 ELN recommendations from a European expert panel Blood 2024 143 19 1903 1930 38306595 10.1182/blood.2023023568 30. van der Ham CG Suurenbroek LC Kleisman MM Mutational mechanisms in multiply relapsed pediatric acute lymphoblastic leukemia Leukemia 2024 38 11 2366 2375 39232206 10.1038/s41375-024-02403-7 PMC11518985 31. Pich O Muiños F Lolkema MP Steeghs N Gonzalez-Perez A Lopez-Bigas N. The mutational footprints of cancer therapies Nat Genet 2019 51 12 1732 1740 31740835 10.1038/s41588-019-0525-5 PMC6887544 32. Schwartz JR Ma J Kamens J The acquisition of molecular drivers in pediatric therapy-related myeloid neoplasms Nat Commun 2021 12 1 985 33579957 10.1038/s41467-021-21255-8 PMC7880998 33. Hunger SP Mullighan CG Acute lymphoblastic leukemia in children N Engl J Med 2015 373 16 1541 1552 26465987 10.1056/NEJMra1400972 34. Malard F Mohty M. Acute lymphoblastic leukaemia Lancet 2020 395 10230 1146 1162 32247396 10.1016/S0140-6736(19)33018-1 35. Angiolillo AL Schore RJ Kairalla JA Excellent outcomes with reduced frequency of vincristine and dexamethasone pulses in standard-risk B-lymphoblastic leukemia: results from Children’s Oncology Group AALL0932 J Clin Oncol 2021 39 13 1437 1447 33411585 10.1200/JCO.20.00494 PMC8274746 36. Pieters R de Groot-Kruseman H Fiocco M Improved outcome for ALL by prolonging therapy for IKZF1 deletion and decreasing therapy for other risk groups J Clin Oncol 2023 41 25 4130 4142 37459571 10.1200/JCO.22.02705 37. Hurley LH DNA and its associated processes as targets for cancer therapy Nat Rev Cancer 2002 2 3 188 200 11990855 10.1038/nrc749 38. Olivier M Weninger A Ardin M Modelling mutational landscapes of human cancers in vitro Sci Rep 2014 4 1 4482 24670820 10.1038/srep04482 PMC5259794 39. Szikriszt B Póti Á Pipek O A comprehensive survey of the mutagenic impact of common cancer cytotoxics Genome Biol 2016 17 1 99 27161042 10.1186/s13059-016-0963-7 PMC4862131 40. Li B Brady SW Ma X Therapy-induced mutations drive the genomic landscape of relapsed acute lymphoblastic leukemia Blood 2020 135 1 41 55 31697823 10.1182/blood.2019002220 PMC6940198 41. Yang F Brady SW Tang C Chemotherapy and mismatch repair deficiency cooperate to fuel TP53 mutagenesis and ALL relapse Nat Cancer 2021 2 8 819 834 35122027 10.1038/s43018-021-00230-8 42. Zhao Y Short NJ Kantarjian HM Genomic determinants of response and resistance to inotuzumab ozogamicin in B-cell ALL Blood 2024 144 1 61 73 38551807 10.1182/blood.2024023930 PMC11251222 43. de Kanter JK Peci F Bertrums E Antiviral treatment causes a unique mutational signature in cancers of transplantation recipients Cell Stem Cell 2021 28 10 1726 1739.e6 34496298 10.1016/j.stem.2021.07.012 PMC8516432 44. Burchenal JH Murphy ML Ellison RR Clinical evaluation of a new antimetabolite, 6-mercaptopurine, in the treatment of leukemia and allied diseases Blood 1953 8 11 965 999 13105700 45. Kato M Ishimaru S Seki M Long-term outcome of 6-month maintenance chemotherapy for acute lymphoblastic leukemia in children Leukemia 2017 31 3 580 584 27698447 10.1038/leu.2016.274 46. Karran P Attard N. Thiopurines in current medical practice: molecular mechanisms and contributions to therapy-related cancer Nat Rev Cancer 2008 8 1 24 36 18097462 10.1038/nrc2292 47. Schmiegelow K Nielsen SN Frandsen TL Nersting J. Mercaptopurine/methotrexate maintenance therapy of childhood acute lymphoblastic leukemia: clinical facts and fiction J Pediatr Hematol Oncol 2014 36 7 503 517 24936744 10.1097/MPH.0000000000000206 PMC4222610 48. Toksvang LN Lee SHR Yang JJ Schmiegelow K. Maintenance therapy for acute lymphoblastic leukemia: basic science and clinical translations Leukemia 2022 36 7 1749 1758 35654820 10.1038/s41375-022-01591-4 PMC9252897 49. Swann PF Waters TR Moulton DC Role of postreplicative DNA mismatch repair in the cytotoxic action of thioguanine Science 1996 273 5278 1109 1111 8688098 10.1126/science.273.5278.1109 50. Waters TR Swann PF Cytotoxic mechanism of 6-thioguanine: hMutSalpha, the human mismatch binding heterodimer, binds to DNA containing S6-methylthioguanine Biochemistry 1997 36 9 2501 2506 9054555 10.1021/bi9621573 51. De Bruyne R Portmann B Samyn M Chronic liver disease related to 6-thioguanine in children with acute lymphoblastic leukaemia J Hepatol 2006 44 2 407 410 16226335 10.1016/j.jhep.2005.06.020 52. Diouf B Cheng Q Krynetskaia NF Somatic deletions of genes regulating MSH2 protein stability cause DNA mismatch repair deficiency and drug resistance in human leukemia cells Nat Med 2011 17 10 1298 1303 21946537 10.1038/nm.2430 PMC3192247 53. Evensen NA Madhusoodhan PP Meyer J MSH6 haploinsufficiency at relapse contributes to the development of thiopurine resistance in pediatric B-lymphoblastic leukemia Haematologica 2018 103 5 830 839 29449434 10.3324/haematol.2017.176362 PMC5927991 54. Teng J-Y Yang D-P Tang C Targeting DNA polymerase β elicits synthetic lethality with mismatch repair deficiency in acute lymphoblastic leukemia Leukemia 2023 37 6 1204 1215 37095208 10.1038/s41375-023-01902-3 55. Ma X Edmonson M Yergeau D Rise and fall of subclones from diagnosis to relapse in pediatric B-acute lymphoblastic leukaemia Nat Commun 2015 6 1 6604 25790293 10.1038/ncomms7604 PMC4377644 56. Oshrine B Grana N Moore C B-cell acute lymphoblastic leukemia with high mutation burden presenting in a child with constitutional mismatch repair deficiency Blood Adv 2019 3 12 1795 1798 31189528 10.1182/bloodadvances.2019000358 PMC6595266 57. Kato K Yoshimi A Ikenobe N Kobayashi C Koike K Tsuchida M. Additional evidence of mismatch repair pathway as relapse-specific alteration in B-cell precursor acute lymphoblastic leukemia: discovery of novel somatic mutation in MLH1 and establishment of new cell line with MLH1 mutation Blood 2020 136 Suppl 1 10 58. Karran P Thiopurines, DNA damage, DNA repair and therapy-related cancer Br Med Bull 2006 79-80 153 170 17277075 10.1093/bmb/ldl020 59. Moore LD Le T Fan G. DNA methylation and its basic function Neuropsychopharmacology 2013 38 1 23 38 22781841 10.1038/npp.2012.112 PMC3521964 60. Schmiegelow K Al-Modhwahi I Andersen MK Methotrexate/6-mercaptopurine maintenance therapy influences the risk of a second malignant neoplasm after childhood acute lymphoblastic leukemia: results from the NOPHO ALL-92 study Blood 2009 113 24 6077 6084 19224761 10.1182/blood-2008-11-187880 PMC2699230 61. Yoshida M Nakabayashi K Yang W NUDT15 variants confer high incidence of second malignancies in children with acute lymphoblastic leukemia Blood Adv 2021 5 23 5420 5428 34662904 10.1182/bloodadvances.2021005507 PMC9153020 62. Schwarz UI Woldanski-Travaglini M Swanston V Thiopurine methyltransferase intermediate metabolizer status and thiopurine-associated toxicity during maintenance therapy in childhood acute lymphoblastic leukemia Clin Pharmacol Ther 2023 113 6 1326 1336 36932910 10.1002/cpt.2894 63. Ebbesen MS Nersting J Jacobsen JH Incorporation of 6-thioguanine nucleotides into DNA during maintenance therapy of childhood acute lymphoblastic leukemia-the influence of thiopurine methyltransferase genotypes J Clin Pharmacol 2013 53 6 670 674 23585236 10.1002/jcph.81 64. Tzoneva G Perez-Garcia A Carpenter Z Activating mutations in the NT5C2 nucleotidase gene drive chemotherapy resistance in relapsed ALL Nat Med 2013 19 3 368 371 23377281 10.1038/nm.3078 PMC3594483 65. Meyer JA Wang J Hogan LE Relapse-specific mutations in NT5C2 in childhood acute lymphoblastic leukemia Nat Genet 2013 45 3 290 294 23377183 10.1038/ng.2558 PMC3681285 66. Tzoneva G Dieck CL Oshima K Clonal evolution mechanisms in NT5C2 mutant-relapsed acute lymphoblastic leukaemia Nature 2018 553 7689 511 514 29342136 10.1038/nature25186 PMC5931372 67. Li B Li H Bai Y Negative feedback-defective PRPS1 mutants drive thiopurine resistance in relapsed childhood ALL Nat Med 2015 21 6 563 571 25962120 10.1038/nm.3840 PMC4670083 68. Song L Li P Sun H PRPS2 mutations drive acute lymphoblastic leukemia relapse through influencing PRPS1/2 hexamer stability Blood. Sci 2023 5 1 39 50 36742181 10.1097/BS9.0000000000000139 PMC9891442 69. Nielsen SN Grell K Nersting J DNA-thioguanine nucleotide concentration and relapse-free survival during maintenance therapy of childhood acute lymphoblastic leukaemia (NOPHO ALL2008): a prospective substudy of a phase 3 trial Lancet Oncol 2017 18 4 515 524 28258828 10.1016/S1470-2045(17)30154-7 70. Toksvang LN Grell K Nersting J DNA-thioguanine concentration and relapse risk in children and young adults with acute lymphoblastic leukemia: an IPD meta-analysis Leukemia 2021 36 1 33 41 34175901 10.1038/s41375-021-01182-9 71. Larsen RH Rank CU Grell K Increments in DNA-thioguanine level during thiopurine-enhanced maintenance therapy of acute lymphoblastic leukemia Haematologica 2021 106 11 2824 2833 34047177 10.3324/haematol.2020.278166 PMC8561300 72. Toksvang LN Als-Nielsen B Bacon C Thiopurine Enhanced ALL Maintenance (TEAM): study protocol for a randomized study to evaluate the improvement in disease-free survival by adding very low dose 6-thioguanine to 6-mercaptopurine/methotrexate-based maintenance therapy in pediatric and adult patients (0-45 years) with newly diagnosed B-cell precursor or T-cell acute lymphoblastic leukemia treated according to the intermediate risk-high group of the ALLTogether1 protocol BMC Cancer 2022 22 1 483 35501736 10.1186/s12885-022-09522-3 PMC9063225 73. Bhojwani D Pui C-H Relapsed childhood acute lymphoblastic leukaemia Lancet Oncol 2013 14 6 e205 217 23639321 10.1016/S1470-2045(12)70580-6 74. Fotoohi AK Albertioni F. Mechanisms of antifolate resistance and methotrexate efficacy in leukemia cells Leuk Lymphoma 2008 49 3 410 426 18297517 10.1080/10428190701824569 75. Rots MG Pieters R Peters GJ Role of folylpolyglutamate synthetase and folylpolyglutamate hydrolase in methotrexate accumulation and polyglutamylation in childhood leukemia Blood 1999 93 5 1677 1683 10029597 76. Liani E Rothem L Bunni MA Smith CA Jansen G Assaraf YG Loss of folylpoly-gamma-glutamate synthetase activity is a dominant mechanism of resistance to polyglutamylation-dependent novel antifolates in multiple human leukemia sublines Int J Cancer 2003 103 5 587 599 12494465 10.1002/ijc.10829 77. Wojtuszkiewicz A Peters GJ van Woerden NL Methotrexate resistance in relation to treatment outcome in childhood acute lymphoblastic leukemia J Hematol Oncol 2015 8 1 61 26022503 10.1186/s13045-015-0158-9 PMC4455979 78. Temko D Tomlinson IPM Severini S Schuster-Böckler B Graham TA The effects of mutational processes and selection on driver mutations across cancer types Nat Commun 2018 9 1 1857 29748584 10.1038/s41467-018-04208-6 PMC5945620 79. Brady SW Ma X Bahrami A The clonal evolution of metastatic osteosarcoma as shaped by cisplatin treatment Mol Cancer Res 2019 17 4 895 906 30651371 10.1158/1541-7786.MCR-18-0620 PMC8518028 80. Wong JKL Aichmüller C Schulze M Association of mutation signature effectuating processes with mutation hotspots in driver genes and non-coding regions Nat Commun 2022 13 1 178 35013316 10.1038/s41467-021-27792-6 PMC8748499 81. Li X Wang Y Deng S Loss of SYNCRIP unleashes APOBEC-driven mutagenesis, tumor heterogeneity, and AR-targeted therapy resistance in prostate cancer Cancer Cell 2023 41 8 1427 1449.e12 37478850 10.1016/j.ccell.2023.06.010 PMC10530398 82. Hof J Krentz S van Schewick C Mutations and deletions of the TP53 gene predict nonresponse to treatment and poor outcome in first relapse of childhood acute lymphoblastic leukemia J Clin Oncol 2011 29 23 3185 3193 21747090 10.1200/JCO.2011.34.8144 83. Xiao H Ding Y Gao Y Haploinsufficiency of NR3C1 drives glucocorticoid resistance in adult acute lymphoblastic leukemia cells by down-regulating the mitochondrial apoptosis axis, and is sensitive to Bcl-2 blockage Cancer Cell Int 2019 19 218 31462891 10.1186/s12935-019-0940-9 PMC6708234 84. Brown CA Youlden DR Aitken JF Moore AS Therapy-related acute myeloid leukemia following treatment for cancer in childhood: a population-based registry study Pediatr Blood Cancer 2018 65 12 e27410 30183136 10.1002/pbc.27410 85. Youlden DR Baade PD Green AC Valery PC Moore AS Aitken JF Second primary cancers in people who had cancer as children: an Australian Childhood Cancer Registry population-based study Med J Aust 2020 212 3 121 125 31743457 10.5694/mja2.50425 86. Bertrums EJM de Kanter JK Derks LLM Selective pressures of platinum compounds shape the evolution of therapy-related myeloid neoplasms Nat Commun 2024 15 1 6025 39019934 10.1038/s41467-024-50384-z PMC11255340 87. Inaba H Pui C-H Immunotherapy in pediatric acute lymphoblastic leukemia Cancer Metastasis Rev 2019 38 4 595 610 31811553 10.1007/s10555-019-09834-0 PMC6995750 88. Kimura S Mullighan CG Molecular markers in ALL: clinical implications Best Pract Res Clin Haematol 2020 33 3 101193 33038982 10.1016/j.beha.2020.101193 PMC7548398 89. McGranahan N Swanton C. Clonal heterogeneity and tumor evolution: past, present, and the future Cell 2017 168 4 613 628 28187284 10.1016/j.cell.2017.01.018 90. Stengel A Kern W Haferlach T Meggendorfer M Fasan A Haferlach C. The impact of TP53 mutations and TP53 deletions on survival varies between AML, ALL, MDS and CLL: an analysis of 3307 cases Leukemia 2017 31 3 705 711 27680515 10.1038/leu.2016.263 91. Aronson M Colas C Shuen A Diagnostic criteria for constitutional mismatch repair deficiency (CMMRD): recommendations from the international consensus working group J Med Genet 2022 59 4 318 327 33622763 10.1136/jmedgenet-2020-107627 92. Wimmer K Kratz CP Vasen HFA Diagnostic criteria for constitutional mismatch repair deficiency syndrome: suggestions of the European consortium “care for CMMRD” (C4CMMRD) J Med Genet 2014 51 6 355 365 24737826 10.1136/jmedgenet-2014-102284 93. Ripperger T Schlegelberger B. Acute lymphoblastic leukemia and lymphoma in the context of constitutional mismatch repair deficiency syndrome Eur J Med Genet 2016 59 3 133 142 26743104 10.1016/j.ejmg.2015.12.014 94. Tabori U Hansford JR Achatz MI Clinical management and tumor surveillance recommendations of inherited mismatch repair deficiency in childhood Clin Cancer Res 2017 23 11 e32 e37 28572265 10.1158/1078-0432.CCR-17-0574 95. Walter AW Ennis S Best H Constitutional mismatch repair deficiency presenting in childhood as three simultaneous malignancies: constitutional mismatch repair deficiency in childhood Pediatr Blood Cancer 2013 60 11 E135 136 23729388 10.1002/pbc.24613 96. Vasen HFA Ghorbanoghli Z Bourdeaut F Guidelines for surveillance of individuals with constitutional mismatch repair-deficiency proposed by the European Consortium “Care for CMMR-D” (C4CMMR-D) J Med Genet 2014 51 5 283 293 24556086 10.1136/jmedgenet-2013-102238 97. Pollack IF Hamilton RL Sobol RW Mismatch repair deficiency is an uncommon mechanism of alkylator resistance in pediatric malignant gliomas: a report from the Children’s Oncology Group Pediatr Blood Cancer 2010 55 6 1066 1071 20589656 10.1002/pbc.22634 PMC3036982 98. Macintyre G Goranova TE De Silva D Copy number signatures and mutational processes in ovarian carcinoma Nat Genet 2018 50 9 1262 1270 30104763 10.1038/s41588-018-0179-8 PMC6130818 99. Steele CD Abbasi A Islam SMA Signatures of copy number alterations in human cancer Nature 2022 606 7916 984 991 35705804 10.1038/s41586-022-04738-6 PMC9242861 100. Funnell T Zhang AW Grewal D Integrated structural variation and point mutation signatures in cancer genomes using correlated topic models PLoS Comput Biol 2019 15 2 e1006799 30794536 10.1371/journal.pcbi.1006799 PMC6402697 101. Li Y Roberts ND Wala JA Patterns of somatic structural variation in human cancer genomes Nature 2020 578 7793 112 121 32025012 10.1038/s41586-019-1913-9 PMC7025897 102. Everall A Tapinos A Hawari A Comprehensive repertoire of the chromosomal alteration and mutational signatures across 16 cancer types from 10,983 cancer patients medRxiv 2023 103. Martínez-Ruiz C Black JRM Puttick C Genomic-transcriptomic evolution in lung cancer and metastasis Nature 2023 616 7957 543 552 37046093 10.1038/s41586-023-05706-4 PMC10115639 ",
  "metadata": {
    "Title of this paper": "Genomic-transcriptomic evolution in lung cancer and metastasis",
    "Journal it was published in:": "Haematologica",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485317/"
  }
}