{
  "title": "Paper_840",
  "abstract": "ACS Appl Nano Mater ACS Appl Nano Mater 319 nihpa ACS applied nano materials 2574-0970 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12478556 PMC12478556.1 12478556 12478556 NIHMS2112578 41030685 10.1021/acsanm.5c03528 NIHMS2112578 NIHPA2112578 1 Article Prostate-Specific Membrane Antigen (PSMA)-Directed Dendrimer–Camptothecin Conjugate for Targeted Treatment of Prostate Cancer Dhull Anubhav # Department of Chemistry, College of Arts and Sciences, Washington State University, Pullman, Washington 99164, United States Pulukuri Anunay James # Department of Chemistry, College of Arts and Sciences, Washington State University, Pullman, Washington 99164, United States Dar Aqib Iqbal Department of Chemistry, College of Arts and Sciences, Washington State University, Pullman, Washington 99164, United States Palmer Nina Julia Department of Chemistry, College of Arts and Sciences, Washington State University, Pullman, Washington 99164, United States Gonzalez Joan Castaneda Department of Chemistry, College of Arts and Sciences, Washington State University, Pullman, Washington 99164, United States Rani Anu Department of Chemistry, College of Arts and Sciences, Washington State University, Pullman, Washington 99164, United States Sharma Rishi Department of Chemistry, College of Arts and Sciences, Washington State University, Pullman, Washington 99164, United States http://orcid.org/0000-0003-2544-5252 Berkman Clifford E. Department of Chemistry, College of Arts and Sciences, Washington State University, Pullman, Washington 99164, United States http://orcid.org/0000-0003-0748-3001 Sharma Anjali Department of Chemistry, College of Arts and Sciences, Washington State University, Pullman, Washington 99164, United States # A.D. and A.J.P. contributed equally to this work. Corresponding Author: Anjali Sharma anjali.sharma@wsu.edu The authors declare the following competing financial interest(s): AS and CEB have pending patents on PSMA dendrimers and drug conjugates presented here. 18 9 2025 497744 10.1021/acsanm.5c03528 22 09 2025 30 09 2025 30 09 2025 02 10 2025 Prostate cancer (PC) remains a major global health challenge, particularly in its advanced, treatment-resistant form. Although Camptothecin (Campto) is a potent topoisomerase I inhibitor with strong antiproliferative and pro-apoptotic activity, its clinical utility is limited by poor aqueous solubility, instability, and systemic toxicity. To address these challenges, we developed a prostate-specific membrane antigen (PSMA)-targeted dendrimer-Camptothecin conjugate (PD-Campto-CTT1298) that improves drug solubility, enables receptor-mediated uptake, and enhances therapeutic effects. This platform was synthesized by conjugating Campto and a high-affinity PSMA ligand (CTT1298) to a generation-4 hydroxyl-terminated PAMAM dendrimer (PD) via copper-catalyzed and strain-promoted azide–alkyne cycloaddition reactions. The resulting conjugate exhibited high aqueous solubility, formulation stability, and efficient drug loading. In vitro Graphical Abstract  PAMAM dendrimer prostate cancer targeted drug delivery camptothecin click chemistry pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf yes pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Prostate-Specific Membrane Antigen (PSMA)-Directed Dendrimer–Camptothecin Conjugate for Targeted Treatment of Prostate Cancer",
    "Journal it was published in:": "ACS applied nano materials",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478556/"
  }
}