{
  "title": "Paper_167",
  "abstract": "pmc Saf Health Work Saf Health Work 1859 shaw Safety and Health at Work 2093-7911 2093-7997 Occupational Safety and Health Research Institute PMC12490664 PMC12490664.1 12490664 12490664 10.1016/j.shaw.2025.06.004 S2093-7911(25)00051-4 1 Original Article Quantitative Analysis of the Factors that Influence Welding Fume Exposure via ART Modelling Jiang Wei jiangwei@cumtb.edu.cn ⁎ Xu Yuan Zhang Mengqi Ma Shengxiang School of Emergency Management and Safety Engineering, China University of Mining & Technology (Beijing), Beijing, China ⁎ jiangwei@cumtb.edu.cn 9 2025 27 6 2025 16 3 498203 317 324 8 1 2025 30 5 2025 22 6 2025 27 06 2025 03 10 2025 03 10 2025 © 2025 Occupational Safety and Health Research Institute. Published by Elsevier B.V. on behalf of Institute, Occupational Safety and Health Research Institute, Korea Occupational Safety and Health Agency. 2025 Occupational Safety and Health Research Institute https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Background Welding fumes from industrial operations pose serious health risks. This study aimed to investigate the factors driving changes in welding fume exposure by analyzing key factors using the Advanced REACH Tool (ART) for dust exposure assessment in building materials enterprises. Methods The dust exposure of 18 building materials enterprises was compared using ART model assessments and measured data. Multiple covariance analysis identified key influencing factors consistent with field conditions. Finally, correlation and regression analyses evaluated the relationships between these factors and dust exposure. Results The ART model showed the highest agreement with field data at the 95th percentile. Correlation and regression analyses identified moisture content, surface contamination/emissions, and dust particle size as the main influencing factors. Conclusion Mitigating occupational health risks requires prioritized control of moisture content, followed by dust particle size and surface contamination/emission. Targeted control of these parameters supports actionable strategies to reduce occupational health risks from welding fume exposure. Keywords ART Exposure assessment Influencing factors Occupational exposure Welding operations pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Welding is an integral part of global industrial production, affecting the occupational health of welders [ 1 2 3 4 5 The current research on welding fumes has focused mainly on dust removal technology [ 6 7 8 9 10 Currently, many exposure assessment models, such as MEASE [ 11 11 12 13 14 Studies using the ART model for dust exposure assessment have addressed respiratory dust in paint spraying companies and pharmaceutical factories [ 15 16 17 In addition, the ART model’s built-in Bayesian algorithm can update the assessment values by adding exposure measurements that match the assessment scenarios, achieving more accurate exposure assessment values, reducing uncertainty, and increasing the reliability of the interactions among multiple influences [ 18 2 Methods 2.1 Measurement of welding fume concentration In this work, 18 building materials enterprises in a city in China were investigated and their welding fume concentrations were measured. They are mainly engaged in processing, manufacturing, and selling welding operations. Welding fumes may be generated during welding processes, such as during electric welding and gas welding. Their typical work day lasted for 8 hours, and their main occupational disease hazard is the welding fumes that are generated during the processing of building materials. Welding fume mass concentrations were determined for each of the 18 construction material enterprises through quadruplicate measurements using the filtration membrane gravimetric method, with mass quantification performed via electronic analytical balance. The measurements obtained by this method do not include chemical fumes, solvents, or gases. 2.2 ART exposure assessment model ART is a semiquantitative model designed to improve the accuracy and utility of occupational exposure assessments. As a methodology for assessing the risk of exposure to chemicals in the workplace, the ART model has significant advantages in predicting the level of exposure to chemicals at a given site [ 19 Forward exposure assessment refers to the process of calculating the potential concentration of chemical substances to which workers may be exposed on the basis of known working environmental conditions and their relative probabilities as defined in the CPTs. This reflects the derivation from known exposure scenarios to the extent of exposure. Inverse assessment, in contrast, involves extrapolating the likelihood of various working conditions that contribute to a concentration level after it is known to have occurred, i.e., updating the probability of the conditions on the basis of the results, which is commonly used for risk management and the development of exposure precautions in the work environment. This approach is often used for risk management and the development of exposure-prevention measures in work environments. More complex risk assessments can be performed via this model, allowing safety engineers and health professionals to consider the entire exposure status, including multivariate factors such as the frequency of chemical use and work patterns. The superiority of the ART model in predicting occupational exposures has been demonstrated in numerous real-world applications through the validation of field data and the integration and analysis of existing research results [ 20 Fig. 1 21 Fig. 1 Flowchart of the ART model. ART, Advanced REACH Tool. Fig. 1 The model consists of algorithms for the near-field source contribution and far-field source contribution as shown in Equations (1) (2) (1) C n f = ( E n f · H n f · L C n f 1 · L C n f 2 ) · D n f (2) C f f = ( E f f · H f f · L C f f 1 · L C f f 2 · S e g f f ) · D f f · S e p The level of surface contamination for each activity depends on the location of the source, i.e., whether there is a near-field source alone, a far-field source alone, or both a near-field source and a far-field source. In the last case, it is assumed that surface contamination in the near-field source is dominant as shown in Equations (3) (4) (3) S u n f = S u f a c t o r · ( E n f · H n f · L C n f 1 · L C n 12 · D n f ) (4) S u f f = S u f a c t o r . ( E f f · H f f · L C f f 1 · L C f f 2 · S e g f f · D n f · S e p f f ) The overall exposure can subsequently be estimated via Equation (5) (5) C t = 1 t t o t a l ∑ t a s k s { t e x p o s u r e · ( C n f + C f f + S u ) } + t n o n − e x p o s u r e · 0 total exposure non-exposure non-exposure According to Fig. 1 Table 1 21 Table 1 Influencing factors in ART model Table 1 Influencing factors Description Substance emission potential (exposure duration, dust particle size, moisture content, and mass fraction) Determines the intrinsic emission potential of a substance (e.g., dustiness for particulate agents and volatility for liquids). Activity emission potential Describes the potential of the activity to generate exposure and is determined by the following characteristics: type and amount of energy transfer, scale (e.g., amount of product used), and product-to-air interface (e.g., level of containment). Local control Control measures in close proximity of the source intended to remove emissions (e.g., LEV, wet suppression techniques). Segregation Isolation of sources from the work environment without containment of the source itself (e.g., a separate drying room). Dispersion Natural and mechanical ventilation characteristics and determining the dilution of air contaminants through the room, i.e. between NF–FF zone and FF outside. individual separation Providing a worker with a personal enclosure within a work environment (e.g., air conditioned cabin). Surface contamination/emissions Emission related to the release of deposited contaminants on surrounding surfaces (including worker clothing) due to natural means or general workplace activities (e.g., moving equipment/vehicles) and unintended and unpredictable leaks from process equipment. ART, Advanced REACH Tool; FF, far-field; LEV, local exhaust ventilation; NF, near-field. 2.3 Correlation and regression analysis This study uses correlation analysis and regression analysis to reveal the intrinsic relationship between influencing factors. Firstly, the Kendall rank correlation coefficient matrix is used to evaluate the nonlinear correlation between variables. The advantage of this method is that it does not rely on the assumption of data normality and is robust to outliers. It can effectively identify the similarity pattern among different enterprises or business unit parameters and quantify the key drivers of risk exposure [ 22 23 3 Results 3.1 Analysis of exposure assessment 3.1.1 The ART model evaluation results The exposure period for each segment was determined. The exposure period is the measured time for which workers are exposed to welding fumes and the rest of the time is the non-exposure period. Exposure sessions are constructed on the basis of measured information from the work session combined with the influencing factors provided in the ART, which includes 10 categories of influencing factors: exposure duration, dust particle size, moisture content, mass fraction, activity emission potential, local control, segregation, dispersion, individual separation, and surface contamination/emissions. Specific information is shown in Table 1 On this basis, the data from the Bayesian database that best matched the exposure scenarios of each session were selected for correction. The 50th, 75th, 90th, 95th, and 99th percentile dust exposure concentrations for each of the 18 building materials enterprises are shown in Table 2 Table 2 Final results of exposure assessment of 18 building materials companies Table 2 Corporations Percentile exposure and exposure ranges (mg/m 3 50th 75th 90th 95th 99th 1 0.07 0.18 0.46 0.80 2.20 2 0.11 0.32 0.86 1.50 4.60 3 0.05 0.14 0.36 0.62 1.70 4 0.09 0.24 0.62 1.10 3.10 5 0.06 0.17 0.43 0.74 2.10 6 0.06 0.16 0.39 0.68 1.90 7 0.45 0.49 1.40 2.60 8.60 8 0.13 0.38 1.00 1.90 5.90 9 0.05 0.14 0.36 0.63 1.80 10 0.08 0.24 0.61 1.10 3.00 11 0.07 0.20 0.50 0.87 2.40 12 0.07 0.20 0.51 0.90 2.50 13 0.21 0.76 2.40 4.80 18.00 14 0.07 0.18 0.46 0.79 2.20 15 0.10 0.28 0.74 1.30 3.80 16 0.17 0.56 1.70 3.20 11.00 17 0.14 0.43 1.20 2.20 7.00 18 0.07 0.19 0.49 0.85 2.40 3.1.2 Comparative analysis of field data and assessment results 3.1.2.1 Field measurement data The welding fume concentrations measured across 18 enterprises are presented in Table 3 Table 3 Measurement of welding fume in 18 building materials enterprises Table 3 Corporations Exposure time (hours) Welding fume concentration (mg/m 3 1 2 3 4 1 6 1.90 1.20 1.70 1.10 2 8 2.90 4.10 1.70 1.60 3 8 0.30 0.40 0.50 0.60 4 6 1.00 3.20 0.80 2.10 5 8 0.50 0.50 0.50 0.50 6 8 1.40 1.70 1.00 0.30 7 2 3.20 2.60 3.30 4.00 8 2 1.40 3.70 1.80 3.50 9 2 0.60 0.50 0.90 1.00 10 2 1.40 1.80 2.60 1.90 11 2 1.00 1.20 3.10 0.90 12 2 1.10 5.20 2.50 0.90 13 2 4.50 3.60 4.70 5.90 14 2 1.70 4.90 0.90 1.20 15 4 2.10 5.70 2.20 0.60 16 6 2.40 4.60 3.00 1.50 17 6 2.40 2.50 2.80 6.40 18 7 2.20 2.40 2.80 1.00 The ART model was run after completing the exposure assessment of the electric welding operations of 18 building materials enterprises. To verify the validity of the ART model, the exposure data in Table 3 Table 4 Table 4 Processing results of measured values of 18 building materials enterprises Table 4 Corporations Average concentration of welding fume (mg/m 3 1 1.48 2 2.58 3 0.45 4 1.78 5 0.50 6 1.10 7 3.28 8 2.60 9 0.75 10 1.96 11 1.55 12 2.43 13 4.68 14 2.18 15 2.65 16 2.88 17 3.53 18 2.10 3.1.2.2 Comparison of field data and assessment results This section compares the field data in Table 2 Table 4 Fig. 2 Fig. 2 Comparison of welding fume exposure assessment results and measured data. Fig. 2 Fig. 2 3.1.3 Similarities The ART model had the greatest overlap between the assessment results and the field data at the 95th percentile. For further validation, this study analyzed the error between the field data and assessment results on the basis of 18 sets of test samples as shown in Table 5 Table 5 Comparison of errors Table 5 Percentile Average absolute error mg/m 3 Average relative error 50th 2.02 94.21% 75th 1.84 84.69% 90th 1.33 59.33% 95th 0.75 38.24% 99th 1.80 99.08% At the 95th percentile, the mean absolute error of the assessed values was 0.75 mg/m 3 3.1.4 Differences  ①The field data showed some bias in distribution, with some enterprise field data well below the 99th percentile, which suggests that the model may have some degree of conservatism in predicting extremely high values. ②The site data were much more dispersed at the 50th, 75th, and 90th percentiles, with the site data points being higher than the predicted values represented by these percentiles. This finding suggests possible bias in the model’s prediction of low- and intermediate-level exposure, which may be due to model assumptions, uncertainty in the input parameters, or the complexity of site conditions. To analyze the causes of these phenomena in depth, we performed a correlation analysis and regression analysis to study the influencing factors in assessments with the ART model to identify those that cause changes in the exposure to welding fumes during welding operations. 3.2 Screening of influencing factors The scenarios demanded by some of the influencing factors in the ART model did not match the actual welding operation scenarios in 18 building materials enterprises, and these influencing factors are not fully applicable to the calculation of exposure to welding fumes. Therefore, to ensure the accuracy and applicability of the assessment results, we used IBM SPSS Statistics Version 29 statistical analysis software to screen the influencing factors that could be used for further analysis. After covariates were removed, eight influencing factors, namely, exposure duration, dust particle size, moisture content, local control, segregation, dispersion, individual separation, surface contamination/emissions, were diagnosed by multiple covariates [variance inflation factor (VIF) < 10] and were suitable for use in the next stage of the analysis of influencing factors as shown in Table 6 Table 6 Assessment of key influencing factors of welding fume exposure and their variance inflation factors (VIF) Table 6 Factor VIF Exposure duration 2.30 Dust particle size 2.36 Moisture content 3.62 Local control 4.03 Segregation 3.49 Dispersion 4.52 Individual separation 2.32 Surface contamination/emissions 9.16 3.3 Quantification of ART model influences The ART model is a semiquantitative assessment model and there are no strict quantitative indicators for the selection of model parameters. However, the ART model scores the influencing factors during the assessment, and the combination effect among the influencing factors can be described via the scoring multiplication mechanism. This assumes a simple multiplicative relationship among the factors and may not be able to comprehensively capture the complex interactions among the factors, especially when there is a nonlinear relationship or interaction effect relationship. Notably, the influence factor score provided by the ART model was selected on the basis of the degree of influence of a particular factor on the assessment results. For some influencing factors, such as the moisture content of the product, the higher the moisture content was, the lower the score was. In the analysis, the results of this type of parameter were affected. To facilitate the analysis, hierarchical analysis was adopted on the basis of the ART model score, which is divided into levels 1–5, to reassign quantitative values to the influencing factors. According to the quantitative standard, a model score of 0–0.02 was quantified as 5; 0.02–0.05 was quantified as 4; 0.05–0.2 was quantified as 3; 0.2–0.5 was quantified as 2; and 0.5–1 was quantified as 1, as shown in Table 7 Table 7 Quantification of dust release potential parameters in the ART model Table 7 Exposure parameter Parameter type options Model scoring Quantize Dust particle size Extremely light and fine powder 1.00 1 Fine dust 0.30 2 Coarse dust 0.10 3 Granules, flakes 0.03 4 Large pellets, flakes 0.01 5 ART, Advanced REACH Tool. According to the above quantification criteria, the eight independent variables in the ART model that were suitable for use in the following model fitting stage were quantified and the range of exposure values was increased so that even small changes could be detected, as shown in Table 8 Table 8 Quantitative results for each parameter of the ART model Table 8 Corporation Exposure duration Dust particle size Moisture content Local control Segregation Dispersion Individual separation Surface contamination/emissions Exposure 1 2 4 3 5 4 4 3 5 160 2 1 3 1 2 3 3 2 3 300 3 1 3 5 4 4 4 5 5 124 4 2 2 3 3 4 4 1 4 220 5 1 3 5 4 4 5 5 5 148 6 1 4 5 5 2 2 3 5 136 7 4 2 1 4 2 2 1 2 520 8 4 2 1 3 2 2 2 3 380 9 4 2 5 5 3 5 5 5 126 10 4 2 1 2 2 3 4 3 220 11 4 3 3 4 1 3 1 4 174 12 4 3 3 1 2 2 2 2 180 13 4 2 1 1 1 2 1 2 960 14 4 3 3 3 2 3 2 3 158 15 3 2 1 1 1 3 4 3 260 16 2 2 1 2 2 3 1 2 640 17 2 2 1 1 2 2 1 2 440 18 2 3 3 3 3 3 3 3 170 ART, Advanced REACH Tool. 3.4 Correlation analysis of influencing factors To further explore and understand the potential relationships among the various influencing factors and their relationships with the final exposure assessment value, a similarity analysis was conducted as shown in Fig. 3 Fig. 3 Results of correlation analysis of influencing factors of ART model. ART, Advanced REACH Tool. Fig. 3 The dust exposure evaluated by the ART model was positively correlated with the exposure duration, with a correlation coefficient of 0.23 that is between 0.1 and 0.3, which is a weak correlation. The other parameters were negatively correlated; the correlation coefficient of surface contamination/emission with exposure was -0.72 that is between -0.7 and -0.9, which is a strong correlation. The other parameters were in the range of -0.3 and -0.7, which is a medium correlation, and the moisture content had the strongest correlation with exposure (correlation coefficient of -0.82). In addition, there was a correlation among the influencing factors, and the interactions of the influencing factors also affected the assessment of the final exposure results. Therefore, the ART model was further analyzed by regression analysis, with the exposure being the dependent variable and the influencing factors being the independent variables, to evaluate the specific relationships between the influencing factors and the exposure. 3.5 Regression analysis of influencing factors The ART model assessment results of welding fume exposure were set as the dependent variable Y, the exposure duration X1, dust particle size X2, moisture content X3, local control X4, segregation X5, dispersion X6, individual separation X7, and surface contamination/emissions X8. The results of the multivariate regression analysis carried out in SPSS statistical analysis software are shown in Table 9 6 (6) Table 9 Regression coefficients for exposure value formula Table 9 Parameters Unstandardized factor B Standardized coefficient B′ Standard error Constant 9.42 — 3.19 Exposure duration 0.12 0.10 0.23 Dust particle size -1.56 -0.92 1.18 Moisture content -0.69 -0.62 0.64 Local control measures 0.01 0.01 0.23 Segregation -0.49 -0.44 0.42 Dispersion -0.32 -0.33 0.43 Individual separation -0.07 -0.04 0.16 Surface contamination/emissions -0.61 -0.50 0.51 Correlation coefficient R 2 p As shown in Table 9 2 p The regression analysis of the influencing factors revealed that moisture content, surface contamination/emissions, and dust particle size were the main factors affecting the exposure to welding fumes. Specifically, an increase in moisture content significantly reduced the diffusion of the welding fumes, thus reducing their exposure impact. Strengthening the control of the degree of surface contamination/emissions can reduce the impact of welding fumes on exposures. The size of the dust particles had a significant effect on the suspension characteristics of welding fumes; i.e., smaller particles are easier to suspend in the air, increasing the risk of inhalation. 4 Discussion In summary, this paper compares the field data of welding fume exposure with the assessment results of the ART model. The results showed that there was a strong agreement between the assessment results at the 95th percentile and the field data. We adopted the multiple covariance diagnoses method to identify the influencing factors that could be quantitatively analyzed, and combined a Kendall correlation analysis and regression analysis to evaluate the relationship between the changes in welding fume exposure due to the influencing factors in the electric welding process. In this section, the effects of various parameters in the ART model on the measured exposure and detailed information about the different influencing factors are discussed to facilitate the targeted increase in control measures and protect workers from welding fume-related injuries. 1. Although awareness of the hazards of welding fumes has increased in recent years, many people involved in welding lack awareness, especially of the International Agency for Research on Cancer (IARC’s) reclassification of welding fumes as carcinogens [ 24 24 25 2. Comparison of the welding processes of the 18 building materials enterprises with the ART model assessment results and welding fume concentration data that were measured onsite showed that the 95th percentile assessment value and the measured value had a high degree of consistency, and the model used in the assessment of higher or lower values may have a certain degree of conservatism. As in a previous study, the ART model tends to overestimate lower exposures and underestimate higher exposures [ 26 3. The ART model for welding fume exposure assessment in building materials enterprises was influenced mainly by moisture content, dust particle size, and surface contamination/emissions. For example, the literature emphasizes the importance of controlling dust particle size and workplace humidity in occupational health [ 27 4. Localized control, although with near-zero coefficients, are a cause for concern because even small changes can have an impact on worker exposure over long periods of time or in high-intensity operations. In addition, the negative impacts of segregation, dispersion, and individual separation indicate the importance of these factors in reducing exposure. Money proposed that in order to strengthen occupational health control, factories should improve segregation facilities [ 28 29 30 The results provide specific guidance for the development and implementation of methods for controlling the spread of welding fumes in welding workplaces and a scientific basis for the development of targeted occupational health interventions. 5 Conclusion This study revealed that moisture content, dust particle size, and surface contamination/emissions are the main factors that influence welding fume exposure and that control strategies that target influencing factors can be developed and implemented to reduce the exposure risk to workers. It is recommended that building materials enterprises should be able to adjust and optimize welding fume control measures in a timely manner. For workplaces with high concentrations of welding fumes, enterprises should promptly implement effective control measures to mitigate occupational health risks. This study has several limitations. First, only 18 building materials enterprises were analyzed and the sample size should be increased in future research to validate the study’s findings. In future studies, the ART model may be applied in comparative analyses to evaluate exposures across different enterprise types or to various substances, thereby enhancing its applicability. CRediT authorship contribution statement Wei Jiang: Yuan Xu: Mengqi Zhang: Shengxiang Ma: Conflicts of interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Korczynski R.E. Occupational health concerns in the welding industry Applied Occupational and Environmental Hygiene 12 2000 936 945 10.1080/104732200750051175 11141606 2 Renee C. Kamil A. Tim R.D. Lin F. Ha N. Occupational exposure to welding fumes and resultant health effects: a scoping review — the UWA Profiles and Research Repository 2024 3 Antonini J.M. Health effects of welding Critical Reviewsin Toxicology 33 1 2003 61 103 10.1080/713611032 12585507 4 Flynn M.R. Susi P. Local exhaust ventilation for the control of welding fumes in the construction industry-A literature review Annals of Occupational Hygiene 56 7 2012 764 776 10.1093/annhyg/mes018 22459321 5 Li G. Jiang J. Liao Y. Wan S. Yao Y. Luo Y. Chen X. Qian H. Dai X. Yin W. Min Z. Yi G. Tan X. Risk for lung-related diseases associated with welding fumes in an occupational population: evidence from a Cox model Frontiers in Public Health 10 2022 990547 10.3389/fpubh.2022.990547 36091502 PMC9455702 6 Meskhi B.C. Evtushenko A.I. Sergina N.M. Azarov V.N. Research of abrasive properties separate dust to ensure the reliability of dusting systems in the production of building materials Iop Conference Series: Materials Science and Engineering 1083 1 2021 012091 10.1088/1757-899X/1083/1/012091 7 Meskhi B. Evtushenko А. Azarov V. Zhukova N. Comprehensive assessment of the dust environment at the construction industry enterprises E3S Web of Conferences 281 2021 09024 10.1051/e3sconf/202128109024 8 Omelchenko E.V. Trushkova E.A. Sidelnikov M.V. Pushenko S.L. Staseva E.V. Algorithm research exposure dust emissions enterprises of building production on the environment Iop Conference Series: Earth and Environmental Science 50 1 2017 012018 10.1088/1755-1315/50/1/012018 9 ChunPeng W. JuXiang Y. Jian M. Yanli W. Shoufang J. Junwang T. Shuyu X. Fuhai S. catchers in an open pit Iron mine Medical Journal of China Coal Industry 19 8 2016 1193 1198 10.11723/mtgyyx.1007-9564.201608030 10 Ting S. YongWei W. SiYi W. Research on the application of four risk assessment models in the key industries of dust occupational exposure Chinese Health Engineering 20 4 2021 550 554 10.19937/j.issn.1671-4199.2021.04.006 11 van Tongeren M. Lamb J. Cherrie J.W. Maccalman L. Basinas I. Hesse S. Validation of lower tier exposure tools used for REACH: comparison of tools estimates with available exposure measurements Annals of Work Exposures and Health 61 8 2017 921 938 10.1093/annweh/wxx056 29028246 12 Creely K.S. Tickner J. Soutar A.J. Evaluation and further development of EASE model 2.0 The Annals of Occupational Hygiene 49 2004 135 145 10.1093/annhyg/meh069 15734826 13 Marquart H. Heussen H. Le Feber M. Noy D. Tielemans E. Schinkel J. West J. Van Der Schaaf D. Stoffenmanager A Web-Based Control Banding Tool Using an Exposure Process Model The Annals of Occupational Hygiene 52 6 2008 429 441 10.1093/annhyg/men032 18587140 14 Tielemans E. Warren N. Schneider T. Van Tongeren M. Tischer M. Ritchie P. Fransman W. Kromhout H. Schinkel J. Van Hemmen J. Cherrie J. Development of an advanced exposure assessment tool: Advanced REACH Tool (ART) 2009 15 Landberg H.E. Axmon A. Westberg H. Tinnerberg H. A study of the validity of two exposure assessment tools: stoffenmanager and the advanced reach tool Annals of Work Exposures and Health 61 5 2017 575 588 10.1093/annweh/wxx008 28355454 16 Goede H.A. McNally K. Gorce J.P. Marquart H. Warren N.D. Fransman W. Tischer M. Schinkel J. Dermal advanced REACH tool (dART)-Development of a dermal exposure model for low-volatile liquids Annals of Work Exposures and Health 63 6 2019 624 636 10.1093/annweh/wxy106 30851094 17 Sailabaht A. Wang F. Cherrie J. Extension of the advanced REACH tool (ART) to include welding fume exposure International Journal of Environmental Research and Public Health 15 10 2018 2199 10.3390/ijerph15102199 30304799 PMC6211129 18 Tischer M. Lamb J. Hesse S. Tongeren M.V. Evaluation of tier one exposure assessment models (ETEAM): Project overview and methods Annals of Work Exposures and Health 61 8 2017 911 920 10.1093/annweh/wxx066 29028257 19 Tielemans E. Warren N. Fransman W. Advanced REACH tool (ART): overview of version 1.0 and research needs The Annals of Occupational Hygiene 55 2011 949 956 10.1093/annhyg/mer094 22080161 20 Schinkel J. Warren N. Fransman W. Tongeren M.V. McDonnell P. Voogd E. Cherrie J. Tischer M. Kromhout H. Tielemans E. Advanced REACH tool (ART): calibration of the mechanistic model Journal of Environmental Monitoring 13 5 2011 1374 21403945 10.1039/c1em00007a 21 Fransman W. Tongeren M.V. Cherrie J.W. Tischer M. Schneider T. Schinkel J. Kromhout H. Warren N. Goede H. Tielemans E. Advanced reach tool (ART): development of the mechanistic model The Annals of Occupational Hygiene 55 2011 957 979 10.1093/annhyg/mer083 22003239 22 Price P.S. Han X. Maximum cumulative ratio (MCR) as a tool for assessing the value of performing a cumulative risk assessment International Journal of Environmental Research And Public Health 8 6 2011 2212 2225 10.3390/ijerph8062212 21776227 PMC3138022 23 LiPing M. Learning and using modern statistical analysis methods (X) - multiple linear regression analysis Beijing Statistics 10 2000 38 39 24 Carey R.N. Fritschi L. Nguyen H. Abdallah K. Driscoll T.R. Factors influencing the use of control measures to reduce occupational exposure to welding fume in Australia: a qualitative Study 14 2023 384 389 10.1016/j.shaw.2023.09.001 PMC10770092 38187202 25 Buonanno G. Morawska L. Stabile L. Exposure to welding particles in automotive plants Journal of Aerosol Science 42 5 2011 295 304 10.1016/j.jaerosci.2011.02.003 26 Lee S. Lee K. Kim H. Comparison of quantitative exposure models for occupational exposure to organic solvents in Korea Annals of Work Exposures and Health 63 2 2019 197 217 10.1093/annweh/wxy087 30445617 27 Anlimah F. Gopaldasani V. MacPhail C. Davies B. A systematic review of the effectiveness of dust control measures adopted to reduce workplace exposure Environmental Science and Pollution Research 30 19 2023 54407 54428 10.1007/s11356-023-26321-w 36964805 PMC10121514 28 Money C.D. A structured approach to occupational hygiene in the design and operation of fine chemical plant The Annals of Occupational Hygiene 36 1992 601 607 10.1093/annhyg/36.6.601 1471813 29 Lee T. Barone Teresa L. Yantek David S. Portnoff Lee Zheng Y. Evaluation of a prototype local ventilation system to mitigate retail store worker exposure to airborne particles Journal of Occupational and Environmental Hygiene 20 2023 289 303 10.1080/15459624.2023.2205448 37084391 30 Chakr N. Sav A. The role of personal protective equipment (PPE) in reducing firefighter exposure to chemical hazards: a systematic review Journal of Occupational and Environmental Hygiene 21 2024 831 841 10.1080/15459624.2024.2400237 39442142 Acknowledgments The authors are grateful to the Beijing Higher Education Society 2023 Project (Topic No: MS2023073). ",
  "metadata": {
    "Title of this paper": "The role of personal protective equipment (PPE) in reducing firefighter exposure to chemical hazards: a systematic review",
    "Journal it was published in:": "Safety and Health at Work",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490664/"
  }
}