{
  "title": "Paper_559",
  "abstract": "pmc Oncologist Oncologist 1643 oncologist oncolo The Oncologist 1083-7159 1549-490X Oxford University Press PMC12483163 PMC12483163.1 12483163 12483163 40920370 10.1093/oncolo/oyaf274 oyaf274 1 Original Article Genitourinary Cancer Genitourinary Cancer AcademicSubjects/MED00010 The safety profile of belzutifan in renal tumors: real-world data from a tertiary academic center https://orcid.org/0000-0003-0635-7898 Winer Aaron Jacob Conceptualization Data curation Formal analysis Methodology Writing - original draft Writing - review & editing  Department of Medicine, Vanderbilt University Medical Center United States https://orcid.org/0009-0003-3205-3799 do Amaral Paulo Siqueira Conceptualization Data curation Formal analysis Methodology Writing - original draft Writing - review & editing  Vanderbilt-Ingram Cancer Center, Vanderbilt University Medical Center United States Ryan Elizabeth G Writing - review & editing  Vanderbilt-Ingram Cancer Center, Vanderbilt University Medical Center United States Lambrecht Morgan A Writing - review & editing  Vanderbilt-Ingram Cancer Center, Vanderbilt University Medical Center United States Chen Chiu-Lan Data curation Formal analysis  Department of Biostatics, Vanderbilt University Medical Center United States https://orcid.org/0000-0002-2212-080X Rini Brian I Data curation Formal analysis Investigation Methodology Supervision Validation Writing - review & editing  Vanderbilt-Ingram Cancer Center, Vanderbilt University Medical Center United States https://orcid.org/0000-0002-4616-6140 Beckermann Kathryn E Conceptualization Data curation Formal analysis Investigation Methodology Supervision Validation Writing - review & editing  Vanderbilt-Ingram Cancer Center, Vanderbilt University Medical Center United States Corresponding author: Aaron Jacob Winer, MD, Department of Medicine, Vanderbilt University Medical Center, 1211 Medical Center Drive, Nashville, TN 37232, USA ( aaron.winer@vumc.org 9 2025 08 9 2025 30 9 495970 oyaf274 29 5 2025 04 9 2025 30 9 2025 08 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025. Published by Oxford University Press. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract Background Belzutifan is a HIF-2ɑ inhibitor approved for the treatment of tumors in von Hippel-Lindau (VHL) syndrome and sporadic metastatic clear cell renal cell carcinoma (spRCC) in the refractory setting. The efficacy and side effects of belzutifan are well-documented from clinical trials; however, real-world data examining the incidence and management of adverse events (AEs) are lacking. Our study aims to describe the AE profiles of belzutifan in spRCC and VHL populations. Methods A retrospective analysis was conducted at Vanderbilt University Medical Center assessing patients who received belzutifan monotherapy. Primary endpoints were the incidence of anemia and hypoxia. Secondary endpoints included time to onset of anemia and hypoxia, as well as management strategies. Results Forty-four patients were identified with either spRCC ( n n Conclusions The time to onset and severity of belzutifan AEs may differ between patients with VHL syndrome and spRCC. These findings suggest the need for a patient-centered approach to monitor and manage toxicity based on disease setting. belzutifan VHL spRCC anemia hypoxia safety pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Implications for Practice While belzutifan’s efficacy and side effect profile have been defined in clinical trials, data regarding its safety remain limited in the real-world setting. Our retrospective study provides a detailed analysis of adverse events (AEs) associated with belzutifan in both VHL and spRCC populations. This manuscript demonstrates differences observed in the incidence, timing, and severity of anemia between the 2 populations. Our findings suggest that patients with spRCC may be at higher risk for early and severe AEs, often resulting in treatment interruption and discontinuation. These results highlight the need for clearer guidelines for disease-specific toxicity monitoring and management. Introduction The VHL-HIF-VEGF pathway is a compelling therapeutic target for both von Hippel-Lindau (VHL) syndrome and sporadic clear cell renal cell carcinoma (spRCC) patients, given the high prevalence of VHL VHL 1–4 5 VHL Belzutifan, a selective HIF-2α inhibitor, marked a significant advance in the treatment of VHL-associated tumors and spRCC. In these patients, belzutifan exerts antitumoral effects by binding HIF-2α, thereby inhibiting downstream transcriptional activity. 6 6 , 7 8 , 9 8 8 The LITESPARK-004 and LITESPARK-005 trials demonstrated the clinical efficacy and safety of belzutifan in VHL disease and spRCC. 10 , 11 10 10 11 11 As belzutifan was recently approved in both VHL disease and spRCC, there is a need to better understand the AE profile of these patient populations in everyday practice. This study aims to enhance the understanding of its AE profile and contribute to the optimization of treatment in VHL syndrome and spRCC. Methods Eligibility criteria Subjects were eligible for inclusion if they were ≥ 18 years of age with either sporadic renal cell carcinoma or VHL syndrome with an associated tumor. Patients must have received belzutifan as a single agent at any disease stage or line of therapy. Patients were excluded if they received belzutifan as part of combination therapy or were lost to follow-up. Patients were included if they had a minimum follow-up time of 1.5 months. Data collection Patients were identified using a pharmacy database query of all belzutifan prescriptions at Vanderbilt University Medical Center (VUMC) between August 30, 2021 and August 30, 2024. Data were also collected using SlicerDicer, a data exploration tool proprietary to the Epic health record system that allows for customized searches among VUMC patients. Using SlicerDicer, subjects were identified who had been prescribed belzutifan over a 5-year period. This study was conducted under IRB approval #160979. Assessment Demographic and clinical data were collected from medical records. The primary endpoint was the incidence of anemia and hypoxia classified as any grade and grade ≥ 3, per Common Terminology Criteria for Adverse Events (CTCAE 5.0). Secondary endpoints included time to anemia, need for supplemental ESA and/or blood transfusion, and dose reduction, treatment interruption, discontinuation, or hospitalization. Similar outcomes were measured for hypoxia, including time to hypoxia, need for supplemental oxygen therapy, and hypoxia-related belzutifan dose reduction, treatment interruption, or discontinuation. The endpoints above were evaluated separately for the spRCC and VHL syndrome cohorts. Time intervals The median time to events was determined from the date of belzutifan initiation until the event of interest. These events included anemia and hypoxia. Results Patient characteristics A total of 44 patients who received belzutifan monotherapy were identified. Twenty-two patients had spRCC, and 22 patients had VHL-associated tumors, including bilateral RCC (45.5% of patients), unilateral RCC (22.7%), CNS hemangioblastoma (86.4%), retinal hemangioma (59.1%), and pancreatic neuroendocrine tumor (50%) ( Table 1 Table 1. VHL disease manifestations. VHL, von Hippel-Lindau. VHL disease manifestations  RCC 15 (68.2)  Unilateral RCC 5 (22.7)  Bilateral RCC 10 (45.5)  CNS hemangioblastoma 19 (86.4)  Pancreatic neuroendocrine tumor 11 (50.0)  Ear endolymph 2 (9.1)  Pheochromocytoma 6 (27.3)  Retinal hemangioma 13 (59.1)  Paraganglioma 2 (9.1) Abbreviations: CNS, central nervous system; RCC, renal cell carcinoma; VHL, Von Hippel-Lindau. The VHL cohort had a younger age distribution than the spRCC cohort, with a median age of 41 years (IQR 33-54), compared to a median age of 67 years (IQR 62-71) ( Table 2 Table 2 Table 2. Patient characteristics. VHL patients ( n Sporadic RCC ( n  Age  Median (IQR) 41 (33-54) 67 (62-71)  Sex, n  Male 8 (36.4) 15 (68.2)  Female 14 (63.6) 7 (31.8)  ECOG, n  0-1 21 (95.5) 20 (90.9)  2 1 (4.5) 2 (9.1)  Comorbidities, n  Smoking history 9 (40.9) 12 (54.6)  Obesity 11 (50.0) 10 (45.5)  CKD (estimated Glomerular Filtration Rate (eGFR) < 50) 1 (4.5) 8 (36.4)  COPD 0 (0) 3 (13.6)  Prior venous thromboembolism (VTE) 1 (4.5) 2 (9.1)  Baseline supplemental O 2 0 (0) 2 (9.1)  Prior nephrectomy 9 (40.9) 17 (77.3)  Baseline hemoglobin, g/dL  Median (IQR) 13 (12-15) 13 (10-14)  Mean ± SD 14 ± 2 12 ± 3  Time to follow-up, months  Median (IQR) 27 (21-29) 4 (2-5)  Duration on belzutifan, months 31 (22-33) 3 (2-6)  Median (IQR)  Number of metastatic sites, median (range) 0 2 (1-4)  Sites of metastasis  Lung 0 20 (90.9)  Lymph node 0 9 (40.9)  Bone 0 9 (40.9)  Adrenal gland 0 5 (22.7)  Liver 0 3 (13.6)  ≥3 sites of metastatic disease, no. (%) N/A 8 (36.4%)  Number of lines of therapy, median (range) N/A 3 (1-7)  Line of therapy for belzutifan, no. (%)  2 L 4 (18.2)  3 L 5 (22.7)  ≥4 L 13 (59.1)  Prior treatment before belzutifan start, no. (%)  ICI 21 (95.5)  Tyrosine kinase inhibitor (TKI) 21 (95.5) Abbreviations: ECOG, Eastern Cooperative Oncology Group; ICI, immune checkpoint inhibitor; VHL, Von Hippel-Lindau. Time to follow-up, defined as the duration between the first dose of belzutifan and last treatment follow-up, was longer in VHL patients (median of 27 months [IQR 21-29]) compared to spRCC patients (median of 4 months [IQR 2-5]). Duration on belzutifan therapy was similarly longer in the VHL cohort (median of 31 months [IQR 22-33]) vs the spRCC cohort (median of 3 months [IQR 2-6]). Of spRCC patients, 36.4% of patients had 3 or more sites of metastatic disease, with the lung (90.9%), lymph node (40.9%), bone (40.9%), adrenal (22.7%), and liver (13.6%) being the most common. SpRCC patients had a median of 3 prior lines of therapy (range 1-7). In spRCC patients, 95.5% had previously received immune checkpoint inhibitors (ICIs), with ICI combinations being the most common prior line of therapy (50% of patients). Adverse events In spRCC patients, 81.8% of patients had any-grade anemia and 41% of patients developed grade 3 anemia ( Figure 1 Figure 2 Figure 1 Figure 2 Figure 1. Incidence of anemia and hypoxia (%). Figure 2. Time to AE development. AE, adverse event. In the VHL cohort, 95.5% of patients developed any-grade anemia with a median time to onset of 77 days (range 49-278). Grade 3 anemia did not occur. Any-grade hypoxia occurred in 13.6% of patients; median time to onset was 105 days (range 84-225). Grade 3 hypoxia occurred in 9.1% of VHL patients with a median time to onset of 225 days (range 165-285). Death occurred in one VHL patient from an unknown cause during follow-up. Management of AEs The management of anemia and hypoxia was assessed among the entire 44-patient cohort ( Figure 3 Figure 3. AE management (%). AE, adverse event. Measures for AE management were next assessed in each group. In spRCC patients, management included ESA alone in 4 patients (18.2% of patients), blood transfusions alone in 3 patients (13.6%), and both ESA and blood transfusions in one patient (4.5%). Eleven spRCC patients (50%) were treated with supplemental oxygen. In spRCC, treatment modification due to AE included belzutifan dose reduction in 9 patients (40.9% of patients), treatment interruption in 16 (72.7%), and treatment discontinuation in 11 patients (50%) ( Table 3 Table 3. Dose reduction, treatment interruption, discontinuation. Pooled population ( n VHL ( n Sporadic RCC ( n  All cause dose reduction, n 22 (50.0) 13 (59.1) 9 (40.9)  All cause treatment interruption, n 31 (70.5) 15 (68.2) 16 (72.7)  Treatment discontinuation, n 14 (31.8) 3 (13.6) 11 (50.0)  Tolerance 8 1 7  Anemia 1 1 0  Hypoxia 5 0 5  Both anemia and hypoxia 2 0 2  Disease progression 5 1 4  Death 1 1 0 Abbreviations: RCC, renal cell carcinoma; VHL, Von Hippel-Lindau. In VHL patients, one patient received ESA only, and no VHL patients required blood transfusions. Two patients (9.1%) received supplemental oxygen for hypoxia, and no patients required hospitalization during the management of their hypoxia. Due to AEs, 59.1% had dose reduction, 68.2% treatment interruption, and 13.6% treatment discontinuation. Of the 3 VHL patients who discontinued treatment, the causes included one case of anemia, one case of PD, and one patient had passed away as previously noted. Discussion In this retrospective analysis of 44 patients treated with belzutifan, there were no newly emergent AEs beyond those reported in the clinical trials that led to drug approval. However, in this real-world population, we observed that patients with spRCC developed high-grade anemia and hypoxia more frequently and rapidly. Among the 22 spRCC patients, high-grade anemia and hypoxia occurred in nearly half of the patients. In contrast, the 22 patients in our series with VHL had no grade ≥3 anemia and only one case of grade ≥3 hypoxia, consistent with the findings of LITESPARK-004. 10 Several factors may have contributed to the high AE burden in our spRCC group vs the prospective trials LITESPARK-001, -005, and -013, 9 , 11 , 12 Similarly, the contrast in AE rates between our spRCC and VHL cohorts may be explained by differences, including age, comorbidities (eg, CKD, chronic obstructive pulmonary disease (COPD), fewer drugs for other diseases), and a higher tumor burden. We observed a lower glomerular filtration rate in the spRCC cohort which is associated with loss of EPO-producing interstitial cells, which may contribute to the lower mean hemoglobin. 13 , 14 In VHL patients, management strategies of anemia and hypoxia were not drastically different from LITESPARK-004. Dose reductions due to any AE occurred at a higher frequency in our VHL population (59.1 vs 15%), but AE-related treatment discontinuation rarely occurred in both our population and the prospective trial (4.5 vs 2%), reinforcing the tolerability of belzutifan in VHL patients, even in the real-world setting. Compared with spRCC patients, VHL patients required fewer interventions for anemia and hypoxia as well as all-cause treatment discontinuation. For both anemia and hypoxia in our spRCC patients, dose reduction and treatment interruption occurred at a higher rate than the prospective studies, which is likely a reflection of the higher rate of severe AEs in our spRCC patients. Most of our patients required treatment interruption for hypoxia, underscoring the need for close follow-up in real-world patients, as most AEs develop within 3 to 4 weeks of treatment initiation. 15 Currently, there is a paucity of guidelines for AE monitoring and management in patients receiving belzutifan. These data prompt the further need to document real-world use of this novel class of drug and create guidelines for HIF inhibitor toxicity management. Considerations include baseline and intermittent assessments with pulmonary function testing, arterial blood gas with A-a gradient calculation, or ventilation-perfusion scintigraphy. Patient education is necessary regarding monitoring and reporting common side effects via home O 2 2 15 Pharmacogenomic variation may also contribute to toxicity risk. Belzutifan exposure-response analyses show an increased risk of grade 3 anemia in patients with poor metabolizer genotypes of UGT2B17 and CYP2C19. 7 16 17 Limitations of this study include differences in follow-up intervals, which may have introduced detection bias. Additionally, spRCC patients underwent more frequent clinical and laboratory evaluations than VHL patients who often had longer follow-up overall. These differences, along with the retrospective nature and limited sample size of our study, are important limitations to acknowledge. A multivariable analysis would help disentangle the independent effects of baseline characteristics, but our limited sample size and retrospective design precluded the approach; future larger cohorts with sufficient power will be necessary to perform these analyses. Conclusion This analysis identified important differences in both the incidence and time to onset of anemia and hypoxia between patients with spRCC and those with VHL syndrome, as well as between real-world spRCC patients and those enrolled on the registrational clinical trials. These findings underscore the need for a personalized approach to monitoring and managing patients taking belzutifan. Further studies are needed to help develop guidelines regarding follow-up strategies and toxicity management to best optimize patient outcomes. Acknowledgments None. Author contributions Aaron Jacob Winer (Conceptualization, Data curation, Formal analysis, Methodology, Writing—original draft, Writing—review & editing), Paulo Siqueira do Amaral (Conceptualization, Data curation, Formal analysis, Methodology, Writing—original draft, Writing—review & editing), Elizabeth G. Ryan (Writing—review & editing), Morgan A. Lambrecht (Writing—review & editing), Chiu-Lan Chen (Data curation, Formal analysis), Brian I. Rini (Data curation, Formal analysis, Investigation, Methodology, Supervision, Validation, Writing—review & editing), and Kathryn E. Beckermann (Conceptualization, Data curation, Formal analysis, Investigation, Methodology, Supervision, Validation, Writing—review & editing) Funding None declared. Conflicts of interest B.I.R. has served in consulting and research support for Merck. The remaining authors have no conflicts of interest to declare. Data availability The data underlying this article will be shared on reasonable request to the corresponding author. References 1 Kaelin WG. Von Hippel-Lindau disease Annu Rev Pathol 2007 2 145 173 10.1146/annurev.pathol.2.010506.092049 18039096 2 Gnarra JR Tory K Weng Y et al Mutations of the VHL tumour suppressor gene in renal carcinoma Nat Genet 1994 7 85 90 10.1038/ng0594-85 7915601 3 Choueiri TK Bauer TM Papadopoulos KP et al Inhibition of hypoxia-inducible factor-2α in renal cell carcinoma with belzutifan: a phase 1 trial and biomarker analysis Nat Med 2021 27 802 805 10.1038/s41591-021-01324-7 33888901 PMC9128828 4 Linehan WM Ricketts CJ. The cancer genome atlas of renal cell carcinoma: findings and clinical implications Nat Rev Urol 2019 16 539 552 10.1038/s41585-019-0211-5 31278395 5 Haase VH. Regulation of erythropoiesis by hypoxia-inducible factors Blood Rev 2013 27 41 53 10.1016/j.blre.2012.12.003 23291219 PMC3731139 6 Chidharla A Fleer R Murphy M et al Real-world outcomes and safety in patients with VHL associated tumors receiving belzutifan J Clin Oncol 2023 41 10515 10515 10.1200/JCO.2023.41.16_suppl.10515 7 Marathe DD Jauslin PM Jan Kleijn H et al Exposure–response analyses for belzutifan to inform dosing considerations and labeling J Clin Pharmacol 2024 64 1246 1258 10.1002/jcph.2459 38752556 8 Choueiri TK Kaelin WG. Targeting the HIF2–VEGF axis in renal cell carcinoma Nat Med 2020 26 1519 1530 10.1038/s41591-020-1093-z 33020645 9 Agarwal N Brugarolas J Ghatalia P et al Randomized phase II dose comparison LITESPARK-013 study of belzutifan in patients with advanced clear cell renal cell carcinoma Ann Oncol 2024 35 1148 1156 10.1016/j.annonc.2024.08.2338 39233312 10 Jonasch E Donskov F Iliopoulos O et al Belzutifan for renal cell carcinoma in von hippel–lindau disease N Engl J Med 2021 385 2036 2046 10.1056/NEJMoa2103425 34818478 PMC9275515 11 Choueiri TK Powles T Peltola K et al Belzutifan versus everolimus for advanced Renal-Cell carcinoma N Engl J Med 2024 391 710 721 10.1056/NEJMoa2313906 39167807 12 Jonasch E Bauer TM Papadopoulos KP et al Phase I LITESPARK-001 study of belzutifan for advanced solid tumors: Extended 41-month follow-up in the clear cell renal cell carcinoma cohort Eur J Cancer 2024 196 113434 10.1016/j.ejca.2023.113434 38008031 13 Stevens PE Ahmed SB Carrero JJ et al KDIGO 2024 clinical practice guideline for the evaluation and management of chronic kidney disease Kidney Int 2024 105 S117 S314 10.1016/j.kint.2023.10.018 38490803 14 Olmos G Muñoz‐Félix JM Mora I et al Impaired erythropoietin synthesis in chronic kidney disease is caused by alterations in extracellular matrix composition J Cell Mol Med 2018 22 302 314 10.1111/jcmm.13319 28857467 PMC5742742 15 FDA Belzutifan Label https://www.accessdata.fda.gov/drugsatfda_docs/label/2024/215383Orig1s007lbl.pdf 16 Vaishampayan UN Saavedra AJZ Beckermann K et al 1695P phase I LITESPARK-018: Dose escalation study of belzutifan in advanced pretreated clear cell renal cell carcinoma (ccRCC) Ann Oncol 2024 35 S1016 10.1016/j.annonc.2024.08.1788 17 Mizutani T. PM frequencies of major CYPs in Asians and Caucasians Drug Metab Rev 2003 35 99 106 10.1081/DMR-120023681 12959412 ",
  "metadata": {
    "Title of this paper": "PM frequencies of major CYPs in Asians and Caucasians",
    "Journal it was published in:": "The Oncologist",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483163/"
  }
}