{
  "title": "Paper_478",
  "abstract": "pmc Commun Biol Commun Biol 3495 commbiol Communications Biology 2399-3642 Nature Publishing Group PMC12484690 PMC12484690.1 12484690 12484690 41028816 10.1038/s42003-025-08741-1 8741 1 Article Uncovering a fibroblast differentiation-based keloid classification by integration of single-cell and bulk RNA sequencing Zhang Wei 1 2 Lu Jianyu 1 2 Tong Xirui 1 2 Xie Sujie 1 2 Xian Shuyuan 1 2 Liu Yifan 3 Yan Jiale 4 Qian Weijin 5 Sun Hanlin 1 2 Zhu Yushu 1 2 Jiang Luofeng 1 2 Guo Xinya 1 2 Ding Xinran 1 2 Li Yixu 1 2 http://orcid.org/0000-0001-9980-8381 Bai Chenguang bcg709@126.com 6 http://orcid.org/0000-0003-2302-7305 Huang Runzhi runzhihuang2022@163.com 1 2 Xia Zhaofan xiazhaofan_smmu@163.com 1 2 http://orcid.org/0000-0002-5083-288X Ji Shizhao shizhaoji2022@163.com 1 2 1 https://ror.org/04wjghj95 grid.412636.4 Department of Burn Surgery, the First Affiliated Hospital of Naval Medical University, 2 https://ror.org/02drdmm93 grid.506261.6 0000 0001 0706 7839 Research Unit of key techniques for treatment of burns and combined burns and trauma injury, Chinese Academy of Medical Sciences, 3 https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 Department of Urology, Xinhua Hospital Affiliated to Shanghai Jiao Tong University School of Medicine, 4 https://ror.org/03rc6as71 grid.24516.34 0000000123704535 Department of Gynecology, Shanghai First Maternity and Infant Hospital, Tongji University School of Medicine, 5 https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 Shanghai Jiao Tong University School of Medicine, 6 https://ror.org/02bjs0p66 grid.411525.6 0000 0004 0369 1599 Department of Pathology, Changhai Hospital, 30 9 2025 2025 8 478257 1387 5 4 2024 19 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Keloids are dermal fibroproliferative skin disorders caused by abnormal wound healing, resulting in impaired skin function and aesthetic defects. Abnormal fibroblast proliferation and excessive collagen deposition are involved in keloid formation. This study investigated the role of fibroblast differentiation in keloid development. Single-cell and bulk RNA sequencing data of keloids were comprehensively analyzed, and 25 clinically relevant differentially expressed fibroblast-differentiation-related genes (DEFDRGs) were identified. Based on DEFDRGs, a keloid diagnostic classification system comprising three subtypes was constructed, indicating that DEFDRGs could serve as therapeutic targets. Additionally, multiple microarray datasets, protein sequencing data, and immunohistochemical analyses of key markers in clinical keloid samples were used for further verification. In conclusion, this study established a molecular classification of keloids based on fibroblast differentiation, contributing to the further understanding of keloid pathogenesis and providing new insights for diagnosis and treatment. This study establishes a molecular classification of keloids based on fibroblast differentiation via integrated single-cell/bulk RNA-seq, offering novel insights into pathogenesis and enabling precision clinical management with therapeutic avenues. Subject terms Computational models High-throughput screening Genetic markers Risk factors Skin diseases This work was supported by the National Natural Science Foundation of China (82472546); CAMS Innovation Fund for Medical Sciences (2019-I2M-5-076); Clinical Key Discipline Project of Shanghai; Shanghai Top Priority Research Center Project (2023ZZ02013); the Excellent Academic Leader Project of Shanghai Science and Technology Committee (23XD1425000); Deep Blue Talent Project of Naval Medical University; National Key Research and Development Program (2024YFA1108405); Postdoctoral Fellowship Program of CPSF (GZC20242278); Shanghai Rising-Star Program (Sailing Special Program) (No. 23YF1458400). The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Keloids are dermal fibroproliferative skin disorders caused by abnormal wound healing, affecting approximately 4.5% to 16% of the population 1 2 3 2 Currently, various therapeutic approaches for keloids have been developed, including intralesional corticosteroid injection, cryotherapy, surgical resection, radiotherapy, and laser therapy 4 5 4 6 7 8 Fibroblasts are vital cells that promote keloid formation. Abnormal fibroblast proliferation and excessive collagen deposition constitute the histopathological characteristics of keloids 4 9 10 13 14 14 15 Considering the importance of fibroblasts, the study reconstructed the de novo differentiation trajectory of keloid fibroblasts and identified 25 differentially expressed fibroblast-differentiation-related genes (DEFDRGs) associated with keloid development. Using integrated bioinformatics analysis of data from scRNA-seq (3 keloids and 3 normal scars) and RNA-seq (37 keloids, 27 healthy skins), the study finally developed a keloid classification based on multi-dimensional analyses and experimental validation. This approach deepens our understanding of new mechanisms underlying keloid pathogenesis and contributes to a theoretical basis for clinical precision treatments of keloid patients. Results Single-Cell Atlas Reveals Dominant Cellular Composition in Keloids After stringent quality control (QC) filtering, a total of 44,463 single cells (keloids: 23,638; normal scars: 20,825) from scRNA-seq data met the criteria and were included for downstream analyses. The experimental workflow is detailed in Fig. 1A 1 1B 1B 2A 2B DCN, KRT1, PTPRC VWF 2C 1C 16 Fig. 1 Comprehensive scRNA-seq analysis reveals cellular heterogeneity in keloids and normal scars. A B C D E F Fibroblasts emerge as central hubs in cell communication networks Cell communication analysis demonstrated fibroblasts as the predominant cellular interactors, exhibiting the highest communication frequency across all cell types (Fig. 1 1F 2D Single-cell profiling unveils fibroblast heterogeneity in keloids A total of 13,925 fibroblasts were extracted only for further analysis. Through unsupervised clustering, 6 distinct clusters were identified and annotated as fibroblast 1-6 (Fig. 2A 2B ACTA2, COL1A1, TGFBI TOP2A 2C 2C POSTN, ASPN COMP 2D 14 COL1A1 COL1A2 2E-F 3A 3 Fig. 2 Identification of fibroblast subtypes and cell communication networks. A B C ACTA2 COL1A1 TGFBI TOP2A D ASPN COMP POSTN E F Trajectory analysis decodes differentiation fates and expression dynamics in keloid fibroblasts To delineate the differentiation hierarchy of keloid fibroblasts, we employed Monocle 2 for single-cell pseudotemporal ordering analysis. This computational framework reconstructed lineage trajectories through dimensionality reduction (DDRTree algorithm), revealing 7 distinct cellular states along fibroblast maturation paths (Fig. 3A–C 3D 3E Fig. 3 Pseudotime trajectory analysis and identification of DEFDRGs. A B C D E F Integrated trajectory-clinical analysis identifies core fate-determining regulators in keloid fibroblasts Through the aforementioned analyses, we mapped the transcriptomes of all fibroblast states and used Monocle 2 to identify 14,467 FDRGs (Monocle-sig, P P P 3F 4A 4B Kallikrein Related Peptidase 6 (KLK6) Tryptase Beta 2 (TPSB2) 4C Construct fibroblast differentiation-based keloid classification (FDBKC) based on DEFDRGs Through consensus clustering analysis of 25 fibroblast differentiation-regulated genes, we established the FDBKC system to stratify patients into three molecular subtypes ( k 5A 5B 4A 4A Fig. 4 Consensus clustering and clinical correlation analysis. A B C D E F G Furthermore, chi-square tests confirmed that FDBKC was significantly associated with keloid diagnosis and time ( P 4 In addition, to further clarify the molecular pathological features of fibroblasts in each FDBKC cluster and minimize bias introduced by categorical variable analysis, principal component analysis (PCA) was performed based on DEFDRGs to calculate the fibroblast score (FS) of each sample (Fig. 4D 4E 4F The expression of 25 DEFDRGs across three FDBKC clusters was analyzed using the ssGSEA algorithm, revealing significant differences in gene expression levels among clusters (Fig. 4G 4A 5C 1 GSE188952 GSE7890 GSE44270 17 18 5D–F 2 Immune infiltration characteristics of FDBKC The correlation between immune cells or immune function and PCA FS was demonstrated in Supplementary Fig. 6A 6B 6 19 Identify DEGs, differentially expressed transcription factors (DETFs), and signaling pathways of bulk transcriptomics In the Bulk-RNA seq analysis of 37 keloids and 27 healthy samples, we found that 1828 genes satisfied P 7A 7B P Homeobox C9 (HOXC9) LIM Domain Only 2 (LMO2) Pancreatic and Duodenal Homeobox 1 (PDX1) RUNX Family Transcription Factor 1 (RUNX1) 7C 7D DEFGDRs demonstrate significant clinical relevance To clarify the clinical relevance of DEFDRGs, PCA analysis and LASSO regression were finally used to establish a multivariable logistic regression model. The LASSO regression was applied to prevent overfitting of the model. Then, 11 DEFDRGs were extracted for subsequent analyses (Fig. 5A 5B TPSB2 KLK6 5C TPSB2 Fig. 5 Multivariable logistic regression analysis of DEFDRGs for keloid classification. A B C D E F Clinical correlation analysis showed that the risk score was associated with age, sex, diagnosis, and time. Patients under 30 years old, female sex, prolonged time, and keloid diagnosis were associated with high risk (Fig. 5D 5E 5F Construct regulatory networks and identify corresponding specific drugs for FDBKC The subtype-specific and DEFDRG-centered regulatory network containing upstream DETFs, downstream signaling pathways, and potential regulation abilities of immune cells/immune functions was constructed in LFDC, MFDC, and HFDC, respectively (Fig. 6A RUNX1 RUNX1 20 22 RUNX1 6B Fig. 6 Regulatory network construction for keloid molecular subtypes and candidate drug identification. A B C COL1A1 VIM TPSB2/PECAM1 D E In LFDC, the key DEFDRGs were C-Type Lectin Domain Containing 11A (CLEC11A) Midkine (MDK) CLEC11A RUNX1 R LMO2 R HOXC9 R MDK R CLEC11A MDK R R In MFDC, Platelet and Endothelial Cell Adhesion Molecule 1 (PECAM1) LIM Domain Only 2 (LMO2) PECAM1 RUNX1 R LMO2 HOXC9 R PECAM1 R R R LMO2 R In HFDC, KLK6 Coagulation Factor XIII A Chain (F13A1) KLK6 F13A1 RUNX1 KLK6 R F13A1 R KLK6 R F13A1 R R Considering that PECAM1 TPSB2 PECAM1 COL1A1 VIM; TPSB2 COL1A1 VIM PECAM1 TPSB2 6C Furthermore, the marker genes for each FDBKC classification were identified based on high expression levels, role in the regulatory network, and relevant biological function: LFDC (cluster 1, markers: MMP1 F13A1 FOXC2 MDK KLK6 TPSB2 The differential expression of key TFs and genes in the aforementioned regulatory network is shown in Fig. 6D P 6E Pathological manifestations of different clinical subtypes of keloids Informed consent from 19 keloid patients was obtained before collecting discarded samples and relevant clinical information. A representative marker from each FDBKC type was selected for Immunohistochemistry (IHC). Given that HFDC is associated with more severe pathological manifestations and its identification is more informative for clinical treatment, two HFDC markers were chosen. Then, IHC for MMP1, FOXC2, KLK6, and TPSB2 was performed on keloid tissues, and professional pathologists were invited to score the expression of related marker genes in keloids to determine clinical subtypes. The baseline information, Vancouver Scar Scale (VSS) scores, and IHC scores are displayed in Table 1 7A Fig. 7 IHC validation in clinical samples and clinical phenotype correlation analysis. A n P P P P B G B C D E F Table 1 Baseline information of keloid patients, clinical-pathological feature of keloids, and immunohistochemical scores of each marker (MMP1, FOXC2, TPSB2, and KLK6) Patient Sex Age Location Color Blood vessel Softness Thickness Pain Itch VSS score Recurrence FDBKC KLK6 TPSB2 FOXC2 MMP1 1 Male 50 Limb Normal Normal Normal <2 mm No No 4 – LFDC 4 6 0 4 2 Male 25 Limb Abnormal Normal Abnormal <2 mm Yes No 5 – HFDC 6 6 0 2 3 Male 45 Ear Abnormal Abnormal Abnormal >2 mm Yes Yes 8 Yes HFDC 3 3 0 0 4 Male 32 Ear Abnormal Abnormal Abnormal >2 mm Yes Yes 8.5 Yes HFDC 3 3 1 0 5 Female 29 Ear Normal Normal Abnormal >2 mm Yes No 4 No HFDC 3 3 0 0 6 Female 5 Ear Normal Normal Normal <2 mm No No 4 No HFDC 3 9 0 0 7 Female 55 Limb Abnormal Normal Normal <2 mm No No 5.5 No MFDC 3 0 2 2 8 Female 35 Ear Normal Normal Abnormal >2 mm Yes Yes 6 – HFDC 3 3 0 0 9 Male 34 Ear Abnormal Abnormal Abnormal >2 mm Yes Yes 7.5 Yes HFDC 3 3 0 0 10 Male 26 Ear Abnormal Abnormal Abnormal >2 mm Yes Yes 8.5 Yes HFDC 3 3 1 4 11 Female 27 Ear Normal Normal Normal <2 mm No No 5 No LFDC 3 3 0 0 12 Male 21 Ear Abnormal Abnormal Abnormal >2 mm Yes Yes 8.5 Yes HFDC 3 6 0 1 13 Female 76 Ear Normal Normal Normal <2 mm No No 6 – LFDC 3 3 0 3 14 Female 45 Faciocervical region Normal Normal Normal <2 mm Yes No 5.5 No MFDC 3 3 1 0 15 Female 22 Ear Normal Normal Normal <2 mm No No 4 – LFDC 3 6 0 0 16 Female 43 Trunk Normal Abnormal Normal >2 mm Yes No 7 – HFDC 3 3 1 2 17 Female 15 Ear Normal Normal Normal <2 mm No No 5 – MFDC 3 6 3 3 18 Female 56 Trunk Abnormal Abnormal Abnormal >2 mm Yes No 8.5 No HFDC 3 9 0 0 19 Male 70 Faciocervical region Normal Normal Abnormal >2 mm Yes Yes 7.5 No HFDC 6 6 0 1 The symbol “-” represents loss to follow-up. VSS According to the clinical manifestations of patients with different subtypes, the average VSS score in the HFDC group was significantly higher than that in the other two groups (Fig. 7B 7C 7D 7E–G Discussion Keloid is a dermal fibroproliferative disease characterized by abnormal deposition of collagen and ECM, affecting patients’ life quality due to cosmetic and functional impairments and the consequent psychological disorders 23 24 23 24 25 26 27 In this study, 44,463 cells from 3 keloids and 3 normal scars were clustered into 9 cell types. Then, 13,925 fibroblasts were clustered into 6 fibroblast subpopulations, with fibroblast 3 showing enriched distribution in keloids. Cell lineage trajectories were reconstructed using Monocle 2, and FDRGs were identified. Furthermore, we integrated FDRGs with genes significantly associated with clinical outcomes (diagnosis and time) to derive 25 clinical-related FDRGs, termed DEFDRGs. To address the lack of an effective genotyping system for keloids with distinct molecular expression patterns and differentiation states, we developed a consensus-based clustering system, FDBKC, and proposed a keloid classification based on DEFDRGs. The FDBKC comprised 3 clusters: LFDC (cluster 1, markers: MMP1 F13A1 FOXC2 MDK KLK6 TPSB2 LFDC In the study, many DEFDRGs are highly expressed in LFDC, such as MMP1 F13A1 28 human 29 30 31 32 F13A1 33 34 35 36 37 38 39 40 41 MFDC In MFDC, MDK FOXC2 42 43 44 45 46 FOXC2, a member of the Forkhead transcription factor family, is involved in angiogenesis and mesenchymal-epithelial transformation (MET)/EMT, critical processes for embryonic development and wound healing. It is commonly accepted that abnormal angiogenesis and dysregulation of EMT/MET processes contribute to fibrosis and even keloid formation 16 47 In summary, MDK and FOXC2 exhibit dual properties. They promote wound repair via angiogenesis and EMT, yet also drive excessive vascular proliferation and ECM deposition, thereby promoting fibrosis and scar formation. HFDC The keloids in the HFDC group showed more severe clinical manifestations. Gene expression analysis revealed elevated expression of KLK6 TPSB2 48 50 KLK6 belongs to the family of serine proteases and is emerging as a universal biomarker of inflammation. It may promote inflammation and autoimmunity by cleaving protease-activated receptors (PARs) 1 and 2 51 52 53 54 55 Tryptase, a serine protease mainly produced by tissue mast cells, is stored in secretory granules alongside other pre-formed mediators like histamine and chemokines. Interestingly, our findings indicate that TPSB2 may be involved in fibroblast differentiation and keloid progression. Recent studies have verified that TPSB2 enhances collagen synthesis in fibroblasts and leads to peritoneal adhesion 56 57 58 60 To date, there remains a lack of precision therapies targeting keloid pathophysiology molecular mechanisms. Computational in silico analyses are widely used to develop and evaluate pharmacological hypotheses, and are suitable for identifying and optimizing small molecules with specific target affinity 61 62 63 This study differs from previous studies identifying biomarkers for keloids. Firstly, we classified keloids into three subtypes based on fibroblast differentiation-related genes and identified marker genes with potentially therapeutic value. These markers are endogenously expressed in their cell of origin, as opposed to free-floating molecules in blood or cerebrospinal fluid. Secondly, unlike studies preselecting candidate biomarkers, we performed unbiased high-throughput analyses of transcripts from 44,463 single cells isolated from keloids and normal scars. Meanwhile, we quantified the typing markers by IHC. All results proved that the DEFDRGs-based keloid classification had high diagnostic value, as it better reflected clinical reality and distinguished keloid patients from healthy controls. However, this study has limitations. Mast cells and endothelial cells have also been reported to be closely associated with keloid pathogenesis and activity 16 19 In conclusion, this study elucidated the mechanisms of fibroblast differentiation in keloid pathogenesis, identified stage-dependent diagnostic gaps in keloids, and predicted new diagnostic biomarkers and therapeutic targets. Our research is of great significance for exploring keloid pathophysiological mechanisms and resolving clinical dilemmas in keloid management. Methods Data collection Keloid and normal scar tissues were obtained from patients with confirmed clinical diagnoses, and scRNA-seq was performed using the 10x genomics platform. The scRNA-seq data used in this study were derived from a previous publication (accession code: GSE163973 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE163973 14 GSE113619 64 http://cistrome.org/ 65 http://www.import.org/ 66 https://www.gsea-msigdb.org/gsea/msigdb/index.jsp 67 https://biorender.com/ ScRNA-seq data processing Sample procession and scRNA-seq were conducted using 10x Genomics Chromium ( https://www.10xgenomics.com/instruments/chromium-x-series http://10xgenomics.com/ Then, gene expression matrices were analyzed with the Seurat pipeline (Version: 5.1.0) 68 68 RNA-seq data processing Firstly, we used fastQC and Trimmomatic software to ensure and control the quality of raw fastq files; the flanking and low-quality sequences were processed to get clean data without redundancy ( http://www.bioinformatics.babraham.ac.uk/projects/fastqc/ human 69 70 DEGs analysis Using the “FindAllMarkers” function and “Wilcox” method, the scRNA-seq DEGs between keloids and normal scars were identified from HVGs only when the gene satisfied the condition of |log 2 Cell type annotation To identify the cell type of each unsupervised cluster, we integrated the above DEGs in all sub-clusters with known specific biomarkers of a particular cell type from CellMarker 71 Considering the variability of gene expression patterns in keloids, we used a specific cellular annotation method. Firstly, the known cell types in keloids included endothelial cells (SELE, PECAM1), fibroblasts (DCN, COL1A1), glandular cells (SCGB2A2, DCD), immune cells (LYZ, PTPRC), keratinocytes (KRT5, KRT1), lymphatic endothelial cells (LYVE1, PROX1), melanocytes (MLANA, DCT), smooth muscle cells (MYH11, ACTA2), and neural cells (S100B, MPZ). The marker genes for these cell types were also known (in parentheses), which were used to annotate corresponding cell types. Besides, we also used the Seurat R package (Version: 3.2.2) and SCANPY module (Version: 1.7.1) in Python (Version 3.6) to display the cellular feature plots and violin plots 72 73 Fibroblast subtype analysis To assess the distribution of different subtypes in fibroblasts, we extracted all fibroblasts from the integrated dataset, constructed a Seurat object, and performed subgroup clustering analysis. We then used RunUMAP, the FindAllMarkers function, and the Wilcoxon test method to identify DEGs of different fibroblast subgroups. Ultimately, the expression signatures of the top DEGs between different fibroblast subsets were shown by violin plots. Cell communication analysis To explore potential interactions and ligand-receptor pairs among different cell types in keloids, we used the iTALK R package (Version: 0.1.0) ( https://github.com/Coolgenome/iTALK 74 https://github.com/garthtarr/edgebundleR 75 https://www.gsea-msigdb.org/gsea/msigdb/index.jsp 76 77 Trajectory analysis To analyze pseudotime trajectories of keloid fibroblast lineages, we performed trajectory inference using the Monocle R package (Version: 2.18.0) 78 78 ConsensusClusterPlus analysis and construction of FDBKC Firstly, we took the intersection of keloid-related DEGs and FDRGs, which was defined as DEFDRGs. Then, ConsensusClusterPlus analysis was conducted to cluster all included samples based on their internal characteristics of DEFDRGs and construct the FDBKC using ConsensusClusterPlus R package 79 80 k k k k k 79 80 PCA and clinical correlation analysis Since the consensus clustering results were categorical variables, PCA was used to calculate the FS of each cluster according to the expression patterns of DEFDRGs to further explore the molecular pathological characteristics of fibroblasts and reduce bias 81 DEGs identification of RNA-seq data We utilized the “limma” R package to recognize DEGs between 37 keloid and 27 healthy samples based on RNA-seq data of patients 82 Quantification of Hallmark signaling pathways by GSVA We used GSVA to detect the absolute quantification of differentially expressed signaling pathways between keloids and normal scars from 50 hallmark signaling pathways downloaded from MSigDB 76 Functional enrichment analysis To detect the important downstream signaling pathways, the Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) enrichment analyses were both performed 83 84 P Immune Cell Infiltration Patterns in Keloids As a method to estimate the cell composition of complex tissues based on gene expression characteristics, the cell type identification by estimating relative subsets of RNA transcripts (CIBERSORT) algorithm was generally used to explore immune cell infiltrating 85 https://cibersort.stanford.edu/ 85 P 86 P Construction of the FDBKC subtypes regulatory network To further explore the potential key regulatory mechanisms of FDBKC subtypes, Pearson’s correlation analysis was carried out on account of DETFs, DEFDRGs, immune cells, and hallmark pathways with a correlation coefficient R P R 87 CMap analysis The CMap database ( https://portals.broadinstitute.org/cmap/ 88 P P Patients Formalin-fixed paraffin-embedded human IHC IHC was performed on formalin-fixed paraffin-embedded human Protein sequencing Keloid, hypertrophic scar, and normal skin samples were collected. The BCA kit was employed to measure the protein concentration after protein extraction. Equal amounts of proteins from each sample were subjected to enzymatic digestion to obtain peptides. The peptides were dissolved and then loaded onto Evotip Pure columns according to the manufacturer’s protocol. Subsequently, the Evosep One ultra-high-performance liquid system was utilized for separation. After that, the peptides were ionized via the capillary ion source and then analyzed by the timsTOF Pro 2 mass spectrometer. RNA-FISH For RNA-FISH on tissue sections, start with antigen retrieval using an EDTA buffer (pH 9.0), followed by three PBS washes. Block endogenous peroxidase with 3% hydrogen peroxide at room temperature in the dark for 25 min. Rehydrate sections in DEPC water and DEPC-PBS, then digest with 20 μg/mL protease K at 37 °C for 20 min. After prehybridizing with prehybridization solution for 2 h at 37 °C, dilute probes in prehybridization buffer, denature at 85 °C, chill on ice, and incubate at 42 °C. Apply the probe mixture for overnight hybridization at 37 °C in a humidified chamber. Perform sequential washes with SSC buffers, incubate with a biotin-conjugated secondary antibody for 1 h, and conduct TSA signal amplification. Finally, counterstain nuclei with DAPI and incubate for 10 min in the dark at room temperature. Images were captured using a fluorescence microscope. The probes used in the experiment were designed and synthesized by Genomeditech (Shanghai, China). The probe sequences were as follows (from 5’ to 3’): VIM COL1A1 PECAM1 TPSB2 Statistics and reproducibility Statistical analysis was performed using R version 4.0.3 (Institute for Statistics and Mathematics, Vienna, Austria, www.r-project.org https://www.python.org/ https://www.perl.org/ P P P P P Ethics approval This study was approved by the Ethics Committees of the Shanghai Changhai Hospital (CHEC2023-088). Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary materials Description of Additional Supplementary Materials Supplementary Data 1 Reporting Summary Transparent Peer Review file Publisher’s note These authors contributed equally: Wei Zhang, Jianyu Lu, Xirui Tong, Runzhi Huang. Supplementary information The online version contains supplementary material available at 10.1038/s42003-025-08741-1. Acknowledgements The authors thank teams of the NCBI-GEO (https://www.ncbi.nlm.nih.gov/gds/) for using their data. This work was supported by the National Natural Science Foundation of China (82472546); CAMS Innovation Fund for Medical Sciences (2019-I2M-5-076); Clinical Key Discipline Project of Shanghai; Shanghai Top Priority Research Center Project (2023ZZ02013); the Excellent Academic Leader Project of Shanghai Science and Technology Committee (23XD1425000); Deep Blue Talent Project of Naval Medical University; National Key Research and Development Program (2024YFA1108405); Postdoctoral Fellowship Program of CPSF (GZC20242278); Shanghai Rising-Star Program (Sailing Special Program) (No. 23YF1458400). The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript. Author contributions Conception/design: Wei Zhang, Jianyu Lu, Xirui Tong, Chenguang Bai, Runzhi Huang, Zhaofan Xia, Shizhao Ji. Collection and/or assembly of data: Wei Zhang, Jianyu Lu, Xirui Tong, Sujie Xie, Shuyuan Xian, Yifan Liu, Jiale Yan, Weijin Qian, Hanlin Sun, Yushu Zhu, Luofeng Jiang, Xinya Guo, Xinran Ding, Yixu Li, Chenguang Bai, Runzhi Huang, Zhaofan Xia, Shizhao Ji. Data analysis and interpretation: Wei Zhang, Jianyu Lu, Xirui Tong, Chenguang Bai, Runzhi Huang, Zhaofan Xia, Shizhao Ji. Manuscript writing: Wei Zhang, Jianyu Lu, Xirui Tong, Chenguang Bai, Runzhi Huang, Zhaofan Xia, Shizhao Ji. Final approval of manuscript: Wei Zhang, Jianyu Lu, Xirui Tong, Sujie Xie, Shuyuan Xian, Yifan Liu, Jiale Yan, Weijin Qian, Hanlin Sun, Yushu Zhu, Luofeng Jiang, Xinya Guo, Xinran Ding, Yixu Li, Chenguang Bai, Runzhi Huang, Zhaofan Xia, Shizhao Ji. Peer review Peer review information Communications Biology Data availability The datasets generated and/or analyzed during the current study are available in the NCBI-GEO database, including GSE163973 GSE113619 64 GSE188952 GSE7890 17 GSE44270 18 supplementary materials 1 Code availability The code for expressing matrix quantification can be found at http://10xgenomics.com/ Competing interests The authors declare no competing interests. References 1. Glass DA Current understanding of the genetic causes of keloid formation J. Investig. Dermatol Symp. Proc. 2017 18 S50 S53 10.1016/j.jisp.2016.10.024 28941494 Glass, D. A. Current understanding of the genetic causes of keloid formation. J. Investig. Dermatol Symp. Proc. 18 28941494 10.1016/j.jisp.2016.10.024 2. Zhang T Current potential therapeutic strategies targeting the TGF-β/Smad signaling pathway to attenuate keloid and hypertrophic scar formation Biomed. Pharmacother. 2020 129 110287 10.1016/j.biopha.2020.110287 32540643 Zhang, T. et al. Current potential therapeutic strategies targeting the TGF-β/Smad signaling pathway to attenuate keloid and hypertrophic scar formation. Biomed. Pharmacother. 129 32540643 10.1016/j.biopha.2020.110287 3. Macarak EJ Wermuth PJ Rosenbloom J Uitto J Keloid disorder: fibroblast differentiation and gene expression profile in fibrotic skin diseases Exp. Dermatol. 2021 30 132 145 10.1111/exd.14243 33211348 Macarak, E. J., Wermuth, P. J., Rosenbloom, J. & Uitto, J. Keloid disorder: fibroblast differentiation and gene expression profile in fibrotic skin diseases. Exp. Dermatol. 30 33211348 10.1111/exd.14243 4. Kim HJ Kim YH Comprehensive insights into keloid pathogenesis and advanced therapeutic strategies Int. J. Mol. Sci. 2024 25 8776 10.3390/ijms25168776 39201463 PMC11354446 Kim, H. J. & Kim, Y. H. Comprehensive insights into keloid pathogenesis and advanced therapeutic strategies. Int. J. Mol. Sci. 25 39201463 10.3390/ijms25168776 PMC11354446 5. Gauglitz GG Korting HC Pavicic T Ruzicka T Jeschke MG Hypertrophic scarring and keloids: pathomechanisms and current and emerging treatment strategies Mol. Med. 2011 17 113 125 10.2119/molmed.2009.00153 20927486 PMC3022978 Gauglitz, G. G., Korting, H. C., Pavicic, T., Ruzicka, T. & Jeschke, M. G. Hypertrophic scarring and keloids: pathomechanisms and current and emerging treatment strategies. Mol. Med. 17 20927486 10.2119/molmed.2009.00153 PMC3022978 6. Limandjaja GC Niessen FB Scheper RJ Gibbs S The Keloid Disorder: Heterogeneity, Histopathology, Mechanisms and Models Front. Cell Dev. Biol. 2020 8 360 10.3389/fcell.2020.00360 32528951 PMC7264387 Limandjaja, G. C., Niessen, F. B., Scheper, R. J. & Gibbs, S. The Keloid Disorder: Heterogeneity, Histopathology, Mechanisms and Models. Front. Cell Dev. Biol. 8 32528951 10.3389/fcell.2020.00360 PMC7264387 7. Xu H Downregulated cytotoxic CD8+ T-cell identifies with the NKG2A-soluble HLA-E axis as a predictive biomarker and potential therapeutic target in keloids Cell Mol. Immunol. 2022 19 527 539 10.1038/s41423-021-00834-1 35039632 PMC8975835 Xu, H. et al. Downregulated cytotoxic CD8+ T-cell identifies with the NKG2A-soluble HLA-E axis as a predictive biomarker and potential therapeutic target in keloids. Cell Mol. Immunol. 19 35039632 10.1038/s41423-021-00834-1 PMC8975835 8. Song B Revealing the roles of glycosphingolipid metabolism pathway in the development of keloid: a conjoint analysis of single-cell and machine learning Front. Immunol. 2023 14 1139775 10.3389/fimmu.2023.1139775 37168863 PMC10164993 Song, B. et al. Revealing the roles of glycosphingolipid metabolism pathway in the development of keloid: a conjoint analysis of single-cell and machine learning. Front. Immunol. 14 37168863 10.3389/fimmu.2023.1139775 PMC10164993 9. Kulkarni A Anderson AG Merullo DP Konopka G Beyond bulk: a review of single cell transcriptomics methodologies and applications Curr. Opin. Biotechnol. 2019 58 129 136 10.1016/j.copbio.2019.03.001 30978643 PMC6710112 Kulkarni, A., Anderson, A. G., Merullo, D. P. & Konopka, G. Beyond bulk: a review of single cell transcriptomics methodologies and applications. Curr. Opin. Biotechnol. 58 30978643 10.1016/j.copbio.2019.03.001 PMC6710112 10. Tabib T Morse C Wang T Chen W Lafyatis R SFRP2/DPP4 and FMO1/LSP1 define major fibroblast populations in human skin J. Invest. Dermatol. 2018 138 802 810 10.1016/j.jid.2017.09.045 29080679 PMC7444611 Tabib, T., Morse, C., Wang, T., Chen, W. & Lafyatis, R. SFRP2/DPP4 and FMO1/LSP1 define major fibroblast populations in human skin. J. Invest. Dermatol. 138 29080679 10.1016/j.jid.2017.09.045 PMC7444611 11. Philippeos C Spatial and single-cell transcriptional profiling identifies functionally distinct human dermal fibroblast subpopulations J. Invest. Dermatol. 2018 138 811 825 10.1016/j.jid.2018.01.016 29391249 PMC5869055 Philippeos, C. et al. Spatial and single-cell transcriptional profiling identifies functionally distinct human dermal fibroblast subpopulations. J. Invest. Dermatol. 138 29391249 10.1016/j.jid.2018.01.016 PMC5869055 12. Solé-Boldo L Single-cell transcriptomes of the human skin reveal age-related loss of fibroblast priming Commun. Biol. 2020 3 188 10.1038/s42003-020-0922-4 32327715 PMC7181753 Solé-Boldo, L. et al. Single-cell transcriptomes of the human skin reveal age-related loss of fibroblast priming. Commun. Biol. 3 32327715 10.1038/s42003-020-0922-4 PMC7181753 13. Vorstandlechner V Deciphering the functional heterogeneity of skin fibroblasts using single-cell RNA sequencing FASEB J. 2020 34 3677 3692 10.1096/fj.201902001RR 31930613 Vorstandlechner, V. et al. Deciphering the functional heterogeneity of skin fibroblasts using single-cell RNA sequencing. FASEB J. 34 31930613 10.1096/fj.201902001RR 14. Deng C-C Single-cell RNA-seq reveals fibroblast heterogeneity and increased mesenchymal fibroblasts in human fibrotic skin diseases Nat. Commun. 2021 12 3709 10.1038/s41467-021-24110-y 34140509 PMC8211847 Deng, C.-C. et al. Single-cell RNA-seq reveals fibroblast heterogeneity and increased mesenchymal fibroblasts in human fibrotic skin diseases. Nat. Commun. 12 34140509 10.1038/s41467-021-24110-y PMC8211847 15. Shim J Integrated analysis of single-cell and spatial transcriptomics in keloids: highlights on fibrovascular interactions in keloid pathogenesis J. Invest. Dermatol. 2022 142 2128 2139.e11 10.1016/j.jid.2022.01.017 35123990 Shim, J. et al. Integrated analysis of single-cell and spatial transcriptomics in keloids: highlights on fibrovascular interactions in keloid pathogenesis. J. Invest. Dermatol. 142 35123990 10.1016/j.jid.2022.01.017 16. Liu X Single-cell RNA-sequencing reveals lineage-specific regulatory changes of fibroblasts and vascular endothelial cells in keloids J. Invest. Dermatol. 2022 142 124 135.e11 10.1016/j.jid.2021.06.010 34242659 Liu, X. et al. Single-cell RNA-sequencing reveals lineage-specific regulatory changes of fibroblasts and vascular endothelial cells in keloids. J. Invest. Dermatol. 142 34242659 10.1016/j.jid.2021.06.010 17. Smith, J. C., Boone, B. E., Opalenik, S. R., Williams, S. M. & Russell, S. B. Gene profiling of keloid fibroblasts shows altered expression in multiple fibrosis-associated pathways. J. Investig. Dermatol. 128 10.1038/sj.jid.5701149 PMC2933038 17989729 18. Hahn, J. M. et al. Keloid-derived keratinocytes exhibit an abnormal gene expression profile consistent with a distinct causal role in keloid pathology. Wound Repair Regener. 21 10.1111/wrr.12060 23815228 19. Yeo E Revisiting roles of mast cells and neural cells in keloid: exploring their connection to disease activity Front. Immunol. 2024 15 1339336 10.3389/fimmu.2024.1339336 38524141 PMC10957560 Yeo, E. et al. Revisiting roles of mast cells and neural cells in keloid: exploring their connection to disease activity. Front. Immunol. 15 38524141 10.3389/fimmu.2024.1339336 PMC10957560 20. Razavi-Mohseni M Machine learning identifies activation of RUNX/AP-1 as drivers of mesenchymal and fibrotic regulatory programs in gastric cancer Genome Res. 2024 34 680 695 10.1101/gr.278565.123 38777607 PMC11216402 Razavi-Mohseni, M. et al. Machine learning identifies activation of RUNX/AP-1 as drivers of mesenchymal and fibrotic regulatory programs in gastric cancer. Genome Res. 34 38777607 10.1101/gr.278565.123 PMC11216402 21. Wang D-X FTO-mediated m6A mRNA demethylation aggravates renal fibrosis by targeting RUNX1 and further enhancing PI3K/AKT pathway FASEB J. 2024 38 e23436 10.1096/fj.202302041R 38430461 Wang, D.-X. et al. FTO-mediated m6A mRNA demethylation aggravates renal fibrosis by targeting RUNX1 and further enhancing PI3K/AKT pathway. FASEB J. 38 38430461 10.1096/fj.202302041R 22. Koth J Runx1 promotes scar deposition and inhibits myocardial proliferation and survival during zebrafish heart regeneration Development 2020 147 dev186569 10.1242/dev.186569 32341028 PMC7197712 Koth, J. et al. Runx1 promotes scar deposition and inhibits myocardial proliferation and survival during zebrafish heart regeneration. Development 147 32341028 10.1242/dev.186569 PMC7197712 23. Lee HJ Jang YJ Recent understandings of biology, prophylaxis and treatment strategies for hypertrophic scars and keloids Int J. Mol. Sci. 2018 19 711 10.3390/ijms19030711 29498630 PMC5877572 Lee, H. J. & Jang, Y. J. Recent understandings of biology, prophylaxis and treatment strategies for hypertrophic scars and keloids. Int J. Mol. Sci. 19 29498630 10.3390/ijms19030711 PMC5877572 24. Naik PP Novel targets and therapies for keloid Clin. Exp. Dermatol. 2022 47 507 515 10.1111/ced.14920 34480483 Naik, P. P. Novel targets and therapies for keloid. Clin. Exp. Dermatol. 47 34480483 10.1111/ced.14920 25. Lynch MD Watt FM Fibroblast heterogeneity: implications for human disease J. Clin. Invest. 2018 128 26 35 10.1172/JCI93555 29293096 PMC5749540 Lynch, M. D. & Watt, F. M. Fibroblast heterogeneity: implications for human disease. J. Clin. Invest. 128 29293096 10.1172/JCI93555 PMC5749540 26. Seki E TLR4 enhances TGF-beta signaling and hepatic fibrosis Nat. Med 2007 13 1324 1332 10.1038/nm1663 17952090 Seki, E. et al. TLR4 enhances TGF-beta signaling and hepatic fibrosis. Nat. Med 13 17952090 10.1038/nm1663 27. Szabo G Mandrekar P Dolganiuc A Innate immune response and hepatic inflammation Semin. Liver Dis. 2007 27 339 350 10.1055/s-2007-991511 17979071 Szabo, G., Mandrekar, P. & Dolganiuc, A. Innate immune response and hepatic inflammation. Semin. Liver Dis. 27 17979071 10.1055/s-2007-991511 28. Sternlicht MD Werb Z How matrix metalloproteinases regulate cell behavior Annu. Rev. Cell Dev. Biol. 2001 17 463 516 10.1146/annurev.cellbio.17.1.463 11687497 PMC2792593 Sternlicht, M. D. & Werb, Z. How matrix metalloproteinases regulate cell behavior. Annu. Rev. Cell Dev. Biol. 17 11687497 10.1146/annurev.cellbio.17.1.463 PMC2792593 29. Pardo A Selman M MMP-1: the elder of the family Int J. Biochem. Cell Biol. 2005 37 283 288 10.1016/j.biocel.2004.06.017 15474975 Pardo, A. & Selman, M. MMP-1: the elder of the family. Int J. Biochem. Cell Biol. 37 15474975 10.1016/j.biocel.2004.06.017 30. Rohani MG Parks WC Matrix remodeling by MMPs during wound repair Matrix Biol. 2015 44–46 113 121 10.1016/j.matbio.2015.03.002 25770908 Rohani, M. G. & Parks, W. C. Matrix remodeling by MMPs during wound repair. Matrix Biol. 44–46 25770908 10.1016/j.matbio.2015.03.002 31. Keskin ES Keskin ER Öztürk MB Çakan D The effect of MMP-1 on wound healing and scar formation Aesthetic Plast. Surg. 2021 45 2973 2979 10.1007/s00266-021-02369-2 34075460 Keskin, E. S., Keskin, E. R., Öztürk, M. B. & Çakan, D. The effect of MMP-1 on wound healing and scar formation. Aesthetic Plast. Surg. 45 34075460 10.1007/s00266-021-02369-2 32. Aoki M siRNA knockdown of tissue inhibitor of metalloproteinase-1 in keloid fibroblasts leads to degradation of collagen type I J. Invest. Dermatol. 2014 134 818 826 10.1038/jid.2013.396 24042342 Aoki, M. et al. siRNA knockdown of tissue inhibitor of metalloproteinase-1 in keloid fibroblasts leads to degradation of collagen type I. J. Invest. Dermatol. 134 24042342 10.1038/jid.2013.396 33. Eckert RL Transglutaminase regulation of cell function Physiol. Rev. 2014 94 383 417 10.1152/physrev.00019.2013 24692352 PMC4044299 Eckert, R. L. et al. Transglutaminase regulation of cell function. Physiol. Rev. 94 24692352 10.1152/physrev.00019.2013 PMC4044299 34. Mitchell JL Mutch NJ Let’s cross-link: diverse functions of the promiscuous cellular transglutaminase factor XIII-A J. Thromb. Haemost. 2019 17 19 30 10.1111/jth.14348 30489000 Mitchell, J. L. & Mutch, N. J. Let’s cross-link: diverse functions of the promiscuous cellular transglutaminase factor XIII-A. J. Thromb. Haemost. 17 30489000 10.1111/jth.14348 35. Dardik R Krapp T Rosenthal E Loscalzo J Inbal A Effect of FXIII on monocyte and fibroblast function Cell Physiol. Biochem. 2007 19 113 120 10.1159/000099199 17310105 Dardik, R., Krapp, T., Rosenthal, E., Loscalzo, J. & Inbal, A. Effect of FXIII on monocyte and fibroblast function. Cell Physiol. Biochem. 19 17310105 10.1159/000099199 36. Inbal A Impaired wound healing in factor XIII deficient mice Thromb. Haemost. 2005 94 432 437 10.1160/TH05-04-0291 16113836 Inbal, A. et al. Impaired wound healing in factor XIII deficient mice. Thromb. Haemost. 94 16113836 10.1160/TH05-04-0291 37. Anwar R Miloszewski KJ Factor XIII deficiency Br. J. Haematol. 1999 107 468 484 10.1046/j.1365-2141.1999.01648.x 10583246 Anwar, R. & Miloszewski, K. J. Factor XIII deficiency. Br. J. Haematol. 107 10583246 10.1046/j.1365-2141.1999.01648.x 38. Board PG Losowsky MS Miloszewski KJ Factor XIII: inherited and acquired deficiency Blood Rev. 1993 7 229 242 10.1016/0268-960X(93)90010-2 8130686 Board, P. G., Losowsky, M. S. & Miloszewski, K. J. Factor XIII: inherited and acquired deficiency. Blood Rev. 7 8130686 10.1016/0268-960x(93)90010-2 39. Paye M Read D Nusgens B Lapiere CM Factor XIII in scleroderma: in vitro studies Br. J. Dermatol 1990 122 371 382 10.1111/j.1365-2133.1990.tb08286.x 1969747 Paye, M., Read, D., Nusgens, B. & Lapiere, C. M. Factor XIII in scleroderma: in vitro studies. Br. J. Dermatol 122 1969747 10.1111/j.1365-2133.1990.tb08286.x 40. Griffin KJ Transglutaminase 2 limits the extravasation and the resultant myocardial fibrosis associated with factor XIII-A deficiency Atherosclerosis 2020 294 1 9 10.1016/j.atherosclerosis.2019.12.013 31874419 PMC7024992 Griffin, K. J. et al. Transglutaminase 2 limits the extravasation and the resultant myocardial fibrosis associated with factor XIII-A deficiency. Atherosclerosis 294 31874419 10.1016/j.atherosclerosis.2019.12.013 PMC7024992 41. Jullien D Souillet AL Faure M Claudy A Coagulation factor XIII in scleroderma Eur. J. Dermatol. 1998 8 231 234 9649677 Jullien, D., Souillet, A. L., Faure, M. & Claudy, A. Coagulation factor XIII in scleroderma. Eur. J. Dermatol. 8 9649677 42. Muramatsu T Midkine and pleiotrophin: two related proteins involved in development, survival, inflammation and tumorigenesis J. Biochem 2002 132 359 371 10.1093/oxfordjournals.jbchem.a003231 12204104 Muramatsu, T. Midkine and pleiotrophin: two related proteins involved in development, survival, inflammation and tumorigenesis. J. Biochem 132 12204104 10.1093/oxfordjournals.jbchem.a003231 43. Yamada H Inazumi T Tajima S Muramatsu H Muramatsu T Stimulation of collagen expression and glycosaminoglycan synthesis by midkine in human skin fibroblasts Arch. Dermatol. Res. 1997 289 429 433 10.1007/s004030050216 9248623 Yamada, H., Inazumi, T., Tajima, S., Muramatsu, H. & Muramatsu, T. Stimulation of collagen expression and glycosaminoglycan synthesis by midkine in human skin fibroblasts. Arch. Dermatol. Res. 289 9248623 10.1007/s004030050216 44. Misa K Involvement of midkine in the development of pulmonary fibrosis Physiol. Rep. 2017 5 e13383 10.14814/phy2.13383 28811360 PMC5582267 Misa, K. et al. Involvement of midkine in the development of pulmonary fibrosis. Physiol. Rep. 5 28811360 10.14814/phy2.13383 PMC5582267 45. Zhang R Mechanical stress and the induction of lung fibrosis via the midkine signaling pathway Am. J. Respir. Crit. Care Med. 2015 192 315 323 10.1164/rccm.201412-2326OC 25945397 Zhang, R. et al. Mechanical stress and the induction of lung fibrosis via the midkine signaling pathway. Am. J. Respir. Crit. Care Med. 192 25945397 10.1164/rccm.201412-2326OC 46. Takenaka H Midkine prevents ventricular remodeling and improves long-term survival after myocardial infarction Am. J. Physiol. Heart Circ. Physiol. 2009 296 H462 H469 10.1152/ajpheart.00733.2008 19060126 Takenaka, H. et al. Midkine prevents ventricular remodeling and improves long-term survival after myocardial infarction. Am. J. Physiol. Heart Circ. Physiol. 296 19060126 10.1152/ajpheart.00733.2008 47. Lee YI WNT5A drives interleukin-6-dependent epithelial-mesenchymal transition via the JAK/STAT pathway in keloid pathogenesis Burns Trauma 2022 10 tkac023 10.1093/burnst/tkac023 36225328 PMC9547497 Lee, Y. I. et al. WNT5A drives interleukin-6-dependent epithelial-mesenchymal transition via the JAK/STAT pathway in keloid pathogenesis. Burns Trauma 10 36225328 10.1093/burnst/tkac023 PMC9547497 48. Mak K Scarless healing of oral mucosa is characterized by faster resolution of inflammation and control of myofibroblast action compared to skin wounds in the red Duroc pig model J. Dermatol. Sci. 2009 56 168 180 10.1016/j.jdermsci.2009.09.005 19854029 Mak, K. et al. Scarless healing of oral mucosa is characterized by faster resolution of inflammation and control of myofibroblast action compared to skin wounds in the red Duroc pig model. J. Dermatol. Sci. 56 19854029 10.1016/j.jdermsci.2009.09.005 49. Ogawa R Keloid and hypertrophic scars are the result of chronic inflammation in the reticular dermis Int J. Mol. Sci. 2017 18 606 10.3390/ijms18030606 28287424 PMC5372622 Ogawa, R. Keloid and hypertrophic scars are the result of chronic inflammation in the reticular dermis. Int J. Mol. Sci. 18 28287424 10.3390/ijms18030606 PMC5372622 50. Huang C Akaishi S Hyakusoku H Ogawa R Are keloid and hypertrophic scar different forms of the same disorder? A fibroproliferative skin disorder hypothesis based on keloid findings Int. Wound J. 2014 11 517 522 10.1111/j.1742-481X.2012.01118.x 23173565 PMC7950391 Huang, C., Akaishi, S., Hyakusoku, H. & Ogawa, R. Are keloid and hypertrophic scar different forms of the same disorder? A fibroproliferative skin disorder hypothesis based on keloid findings. Int. Wound J. 11 23173565 10.1111/j.1742-481X.2012.01118.x PMC7950391 51. Oikonomopoulou K Kallikrein-mediated cell signalling: targeting proteinase-activated receptors (PARs) Biol. Chem. 2006 387 817 824 16800746 10.1515/BC.2006.104 Oikonomopoulou, K. et al. Kallikrein-mediated cell signalling: targeting proteinase-activated receptors (PARs). Biol. Chem. 387 16800746 10.1515/BC.2006.104 52. Radulovic M Genetic targeting of protease activated receptor 2 reduces inflammatory astrogliosis and improves recovery of function after spinal cord injury Neurobiol. Dis. 2015 83 75 89 10.1016/j.nbd.2015.08.021 26316358 PMC4674329 Radulovic, M. et al. Genetic targeting of protease activated receptor 2 reduces inflammatory astrogliosis and improves recovery of function after spinal cord injury. Neurobiol. Dis. 83 26316358 10.1016/j.nbd.2015.08.021 PMC4674329 53. Lundberg KC Proteomics of skin proteins in psoriasis: from discovery and verification in a mouse model to confirmation in humans Mol. Cell Proteom. 2015 14 109 119 10.1074/mcp.M114.042242 PMC4288247 25351201 Lundberg, K. C. et al. Proteomics of skin proteins in psoriasis: from discovery and verification in a mouse model to confirmation in humans. Mol. Cell Proteom. 14 10.1074/mcp.M114.042242 PMC4288247 25351201 54. Billi AC KLK6 expression in skin induces PAR1-mediated psoriasiform dermatitis and inflammatory joint disease J. Clin. Invest. 2020 130 3151 3157 10.1172/JCI133159 32155135 PMC7260032 Billi, A. C. et al. KLK6 expression in skin induces PAR1-mediated psoriasiform dermatitis and inflammatory joint disease. J. Clin. Invest. 130 32155135 10.1172/JCI133159 PMC7260032 55. Yoon H Scarisbrick IA Kallikrein-related peptidase 6 exacerbates disease in an autoimmune model of multiple sclerosis Biol. Chem. 2016 397 1277 1286 10.1515/hsz-2016-0239 27533119 PMC5453667 Yoon, H. & Scarisbrick, I. A. Kallikrein-related peptidase 6 exacerbates disease in an autoimmune model of multiple sclerosis. Biol. Chem. 397 27533119 10.1515/hsz-2016-0239 PMC5453667 56. Xu X Rivkind A Pappo O Pikarsky A Levi-Schaffer F Role of mast cells and myofibroblasts in human peritoneal adhesion formation Ann. Surg. 2002 236 593 601 10.1097/00000658-200211000-00009 12409665 PMC1422617 Xu, X., Rivkind, A., Pappo, O., Pikarsky, A. & Levi-Schaffer, F. Role of mast cells and myofibroblasts in human peritoneal adhesion formation. Ann. Surg. 236 12409665 10.1097/00000658-200211000-00009 PMC1422617 57. Akers IA Mast cell tryptase stimulates human lung fibroblast proliferation via protease-activated receptor-2 Am. J. Physiol. Lung Cell Mol. Physiol. 2000 278 L193 L201 10.1152/ajplung.2000.278.1.L193 10645907 Akers, I. A. et al. Mast cell tryptase stimulates human lung fibroblast proliferation via protease-activated receptor-2. Am. J. Physiol. Lung Cell Mol. Physiol. 278 10645907 10.1152/ajplung.2000.278.1.L193 58. Knight V Tchongue J Lourensz D Tipping P Sievert W Protease-activated receptor 2 promotes experimental liver fibrosis in mice and activates human hepatic stellate cells Hepatology 2012 55 879 887 10.1002/hep.24784 22095855 Knight, V., Tchongue, J., Lourensz, D., Tipping, P. & Sievert, W. Protease-activated receptor 2 promotes experimental liver fibrosis in mice and activates human hepatic stellate cells. Hepatology 55 22095855 10.1002/hep.24784 59. Gaça MDA Zhou X Benyon RC Regulation of hepatic stellate cell proliferation and collagen synthesis by proteinase-activated receptors J. Hepatol. 2002 36 362 369 10.1016/S0168-8278(01)00285-9 11867180 Gaça, M. D. A., Zhou, X. & Benyon, R. C. Regulation of hepatic stellate cell proliferation and collagen synthesis by proteinase-activated receptors. J. Hepatol. 36 11867180 10.1016/s0168-8278(01)00285-9 60. Grandaliano G Protease-activated receptor-2 expression in IgA nephropathy: a potential role in the pathogenesis of interstitial fibrosis J. Am. Soc. Nephrol. 2003 14 2072 2083 10.1097/01.ASN.0000080315.37254.A1 12874461 Grandaliano, G. et al. Protease-activated receptor-2 expression in IgA nephropathy: a potential role in the pathogenesis of interstitial fibrosis. J. Am. Soc. Nephrol. 14 12874461 10.1097/01.asn.0000080315.37254.a1 61. Ekins S Mestres J Testa B In silico pharmacology for drug discovery: applications to targets and beyond Br. J. Pharm. 2007 152 21 37 10.1038/sj.bjp.0707306 PMC1978280 17549046 Ekins, S., Mestres, J. & Testa, B. In silico pharmacology for drug discovery: applications to targets and beyond. Br. J. Pharm. 152 10.1038/sj.bjp.0707306 PMC1978280 17549046 62. La J Regulation of myofibroblast differentiation by cardiac glycosides Am. J. Physiol. Lung Cell Mol. Physiol. 2016 310 L815 L823 10.1152/ajplung.00322.2015 26851261 PMC4867347 La, J. et al. Regulation of myofibroblast differentiation by cardiac glycosides. Am. J. Physiol. Lung Cell Mol. Physiol. 310 26851261 10.1152/ajplung.00322.2015 PMC4867347 63. Li B Ouabain ameliorates bleomycin induced pulmonary fibrosis by inhibiting proliferation and promoting apoptosis of lung fibroblasts Am. J. Transl. Res. 2018 10 2967 2974 30323883 PMC6176221 Li, B. et al. Ouabain ameliorates bleomycin induced pulmonary fibrosis by inhibiting proliferation and promoting apoptosis of lung fibroblasts. Am. J. Transl. Res. 10 30323883 PMC6176221 64. Onoufriadis, A. et al. Time series integrative analysis of RNA sequencing and MicroRNA expression data reveals key biologic wound healing pathways in keloid-prone individuals. J. Invest. Dermatol. 138 10.1016/j.jid.2018.05.017 29870686 65. Zheng R Cistrome Data Browser: expanded datasets and new tools for gene regulatory analysis Nucleic Acids Res 2019 47 D729 D735 10.1093/nar/gky1094 30462313 PMC6324081 Zheng, R. et al. Cistrome Data Browser: expanded datasets and new tools for gene regulatory analysis. Nucleic Acids Res 47 30462313 10.1093/nar/gky1094 PMC6324081 66. Bhattacharya S ImmPort: disseminating data to the public for the future of immunology Immunol. Res. 2014 58 234 239 10.1007/s12026-014-8516-1 24791905 Bhattacharya, S. et al. ImmPort: disseminating data to the public for the future of immunology. Immunol. Res. 58 24791905 10.1007/s12026-014-8516-1 67. Subramanian A Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles Proc. Natl Acad. Sci. USA 2005 102 15545 15550 10.1073/pnas.0506580102 16199517 PMC1239896 Subramanian, A. et al. Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles. Proc. Natl Acad. Sci. USA 102 16199517 10.1073/pnas.0506580102 PMC1239896 68. Stuart T Comprehensive integration of single-cell data Cell 2019 177 1888 1902.e21 10.1016/j.cell.2019.05.031 31178118 PMC6687398 Stuart, T. et al. Comprehensive integration of single-cell data. Cell 177 31178118 10.1016/j.cell.2019.05.031 PMC6687398 69. Li H The sequence alignment/map format and SAMtools Bioinformatics 2009 25 2078 2079 10.1093/bioinformatics/btp352 19505943 PMC2723002 Li, H. et al. The sequence alignment/map format and SAMtools. Bioinformatics 25 19505943 10.1093/bioinformatics/btp352 PMC2723002 70. Liao Y Smyth GK Shi W featureCounts: an efficient general purpose program for assigning sequence reads to genomic features Bioinformatics 2014 30 923 930 10.1093/bioinformatics/btt656 24227677 Liao, Y., Smyth, G. K. & Shi, W. featureCounts: an efficient general purpose program for assigning sequence reads to genomic features. Bioinformatics 30 24227677 10.1093/bioinformatics/btt656 71. Zhang X CellMarker: a manually curated resource of cell markers in human and mouse Nucleic Acids Res. 2019 47 D721 D728 10.1093/nar/gky900 30289549 PMC6323899 Zhang, X. et al. CellMarker: a manually curated resource of cell markers in human and mouse. Nucleic Acids Res. 47 30289549 10.1093/nar/gky900 PMC6323899 72. Butler A Hoffman P Smibert P Papalexi E Satija R Integrating single-cell transcriptomic data across different conditions, technologies, and species Nat. Biotechnol. 2018 36 411 420 10.1038/nbt.4096 29608179 PMC6700744 Butler, A., Hoffman, P., Smibert, P., Papalexi, E. & Satija, R. Integrating single-cell transcriptomic data across different conditions, technologies, and species. Nat. Biotechnol. 36 29608179 10.1038/nbt.4096 PMC6700744 73. Wolf FA Angerer P Theis FJ SCANPY: large-scale single-cell gene expression data analysis Genome Biol. 2018 19 15 10.1186/s13059-017-1382-0 29409532 PMC5802054 Wolf, F. A., Angerer, P. & Theis, F. J. SCANPY: large-scale single-cell gene expression data analysis. Genome Biol. 19 29409532 10.1186/s13059-017-1382-0 PMC5802054 74. Wang, Y. et al. iTALK: an R package to characterize and illustrate intercellular communication. 507871 10.1101/507871 (2019). 75. Zhou H Xu P Yuan X Qu H Edge bundling in information visualization Tsinghua Sci. Technol. 2013 18 145 156 10.1109/TST.2013.6509098 Zhou, H., Xu, P., Yuan, X. & Qu, H. Edge bundling in information visualization. Tsinghua Sci. Technol. 18 76. Liberzon, A. et al. The Molecular Signatures Database (MSigDB) hallmark gene set collection. Cell Syst. 1 10.1016/j.cels.2015.12.004 PMC4707969 26771021 77. Hänzelmann S Castelo R Guinney J GSVA: gene set variation analysis for microarray and RNA-seq data BMC Bioinform. 2013 14 7 10.1186/1471-2105-14-7 PMC3618321 23323831 Hänzelmann, S., Castelo, R. & Guinney, J. GSVA: gene set variation analysis for microarray and RNA-seq data. BMC Bioinform. 14 10.1186/1471-2105-14-7 PMC3618321 23323831 78. Qiu X Reversed graph embedding resolves complex single-cell trajectories Nat. Methods 2017 14 979 982 10.1038/nmeth.4402 28825705 PMC5764547 Qiu, X. et al. Reversed graph embedding resolves complex single-cell trajectories. Nat. Methods 14 28825705 10.1038/nmeth.4402 PMC5764547 79. Reich M GenePattern 2.0 Nat. Genet. 2006 38 500 501 10.1038/ng0506-500 16642009 Reich, M. et al. GenePattern 2.0. Nat. Genet. 38 16642009 10.1038/ng0506-500 80. Wilkerson MD Hayes DN ConsensusClusterPlus: a class discovery tool with confidence assessments and item tracking Bioinformatics 2010 26 1572 1573 10.1093/bioinformatics/btq170 20427518 PMC2881355 Wilkerson, M. D. & Hayes, D. N. ConsensusClusterPlus: a class discovery tool with confidence assessments and item tracking. Bioinformatics 26 20427518 10.1093/bioinformatics/btq170 PMC2881355 81. Ringnér M What is principal component analysis? Nat. Biotechnol. 2008 26 303 304 10.1038/nbt0308-303 18327243 Ringnér, M. What is principal component analysis?. Nat. Biotechnol. 26 18327243 10.1038/nbt0308-303 82. Varet H Brillet-Guéguen L Coppée J-Y Dillies M-A SARTools: A DESeq2- and EdgeR-Based R pipeline for comprehensive differential analysis of RNA-seq data PLoS ONE 2016 11 e0157022 10.1371/journal.pone.0157022 27280887 PMC4900645 Varet, H., Brillet-Guéguen, L., Coppée, J.-Y. & Dillies, M.-A. SARTools: A DESeq2- and EdgeR-Based R pipeline for comprehensive differential analysis of RNA-seq data. PLoS ONE 11 27280887 10.1371/journal.pone.0157022 PMC4900645 83. Ashburner M Gene ontology: tool for the unification of biology. The Gene Ontology Consortium Nat. Genet. 2000 25 25 29 10.1038/75556 10802651 PMC3037419 Ashburner, M. et al. Gene ontology: tool for the unification of biology. The Gene Ontology Consortium. Nat. Genet. 25 10802651 10.1038/75556 PMC3037419 84. Kanehisa M Goto S KEGG: kyoto encyclopedia of genes and genomes Nucleic Acids Res. 2000 28 27 30 10.1093/nar/28.1.27 10592173 PMC102409 Kanehisa, M. & Goto, S. KEGG: kyoto encyclopedia of genes and genomes. Nucleic Acids Res. 28 10592173 10.1093/nar/28.1.27 PMC102409 85. Newman AM Robust enumeration of cell subsets from tissue expression profiles Nat. Methods 2015 12 453 457 10.1038/nmeth.3337 25822800 PMC4739640 Newman, A. M. et al. Robust enumeration of cell subsets from tissue expression profiles. Nat. Methods 12 25822800 10.1038/nmeth.3337 PMC4739640 86. Xiao B Identification and verification of immune-related gene prognostic signature based on ssGSEA for osteosarcoma Front. Oncol. 2020 10 607622 10.3389/fonc.2020.607622 33384961 PMC7771722 Xiao, B. et al. Identification and verification of immune-related gene prognostic signature based on ssGSEA for osteosarcoma. Front. Oncol. 10 33384961 10.3389/fonc.2020.607622 PMC7771722 87. Mora A Donaldson IM iRefR: an R package to manipulate the iRefIndex consolidated protein interaction database BMC Bioinform. 2011 12 455 10.1186/1471-2105-12-455 PMC3282787 22115179 Mora, A. & Donaldson, I. M. iRefR: an R package to manipulate the iRefIndex consolidated protein interaction database. BMC Bioinform. 12 10.1186/1471-2105-12-455 PMC3282787 22115179 88. Lamb J The Connectivity Map: using gene-expression signatures to connect small molecules, genes, and disease Science 2006 313 1929 1935 10.1126/science.1132939 17008526 Lamb, J. et al. The Connectivity Map: using gene-expression signatures to connect small molecules, genes, and disease. Science 313 17008526 10.1126/science.1132939 ",
  "metadata": {
    "Title of this paper": "The Connectivity Map: using gene-expression signatures to connect small molecules, genes, and disease",
    "Journal it was published in:": "Communications Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484690/"
  }
}