{
  "title": "Paper_266",
  "abstract": "pmc Strahlenther Onkol Strahlenther Onkol 365 springeropen Strahlentherapie Und Onkologie 0179-7158 1439-099X pmc-is-collection-domain yes pmc-collection-title Springer PMC12488766 PMC12488766.1 12488766 12488766 40526132 10.1007/s00066-025-02420-0 2420 1 Review Article 5-Aminolevulinic acid as an emerging radiosensitizer for radiodynamic therapy in solid tumors: a systematic review of available data and clinical potential http://orcid.org/0000-0002-5917-4203 Pepper Niklas B. niklas.pepper@ukmuenster.de 1 Troschel Fabian M. 1 Stummer Walter 2 Eich Hans T. 1 1 https://ror.org/01856cw59 grid.16149.3b 0000 0004 0551 4246 Department of Radiation Oncology, University Hospital Muenster, 2 https://ror.org/01856cw59 grid.16149.3b 0000 0004 0551 4246 Department of Neurosurgery, University Hospital Muenster, 17 6 2025 2025 201 10 498144 1071 1085 1 2 2025 13 5 2025 17 06 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/  Open Access http://creativecommons.org/licenses/by/4.0/ Background 5‑Aminolevulinic acid (5-ALA) is a keto-carbon amino acid frequently used in glioma surgery for fluorescence-guided resection. Additionally, cytotoxic properties of 5‑ALA can be induced via stimulation with laser light in photodynamic therapy (PDT). Preclinical in vitro and in vivo trials have also demonstrated this effect to be inducible by photon irradiation as used in radiation treatment. This makes 5‑ALA a potential sensitizer for radiation therapy whose capabilities and limitations have not yet been fully evaluated. In this article, we present results from a systematic literature review regarding the evidence of 5‑ALA’s radiosensitizing properties and the context of its use. We discuss these findings in terms of the underlying mechanisms, their limitations, and the questions to be addressed in future clinical trials. Methods A systematic review in the PubMed database was performed via a specifically designed search term, including all search results that featured the combination of 5‑ALA with ionizing radiation. The last date of search was November 13, 2024. Risk of bias among study data was assessed individually according to the study setup after full-text analysis. The results were synthesized based on the underlying tumor entity. Results A total of 31 articles were included that examined the combination of 5‑ALA with radiotherapy (RT) in glioma ( n n n n n n n n Conclusion These results imply a basis for 5‑ALA as a possible radiosensitizer for RT, but several questions remain unanswered, as limitations arise from the fact that data are predominantly based on in vitro or rodent in vivo trials, with only two ongoing clinical trials and one case report involving human patients. Moreover, trial setups varied in terms of ALA dose and application timing. Supplementary Information The online version of this article (10.1007/s00066-025-02420-0) contains supplementary material, which is available to authorized users. Keywords 5‑ALA Radiotherapy Glioma Skin cancer Photon irradiation Universitätsklinikum Münster (8918) Open Access funding enabled and organized by Projekt DEAL. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer-Verlag GmbH Germany, part of Springer Nature 2025 Introduction 5‑Amniolevulinic acid (5-ALA) is an amino acid of the keto-carbon group. As a substrate in cellular heme synthesis, it is used to create porphobilinogen (PBG) in the mitochondrial matrix, which is then converted to protoporphyrin IX (PpIX) and, sequentially, to heme in normal cells. The value of 5‑ALA in oncological treatment derives from an accumulation of PpIX in tumor or tumor-like tissue [ 1 2 3 7 6 8 10 11 13 14 When exposed to ionizing radiation (IR), a cascade of processes unfolds: reactive oxygen species (ROS) such as hydrogen peroxide (H 2 2 2 15 2 16 17 18 19 17 Thus, these synergistic mechanisms enhance the cytotoxic capabilities of ionizing radiation in the presence of 5‑ALA. Furthermore, arrest in the G2/M phase may lead to increased sensitivity of cells to ionizing radiation (IR) by sequential RT fractions, as this state is highly vulnerable to IR-mediated cell damage. The mechanism is illustrated in Fig. 1 Fig. 1 Mechanism of the radiosensitizing effect of 5‑aminolevulinic acid (5-ALA) in tumor cells. PpIX ROS While preclinical data have delivered promising results, the value of 5‑ALA has not yet been fully explored; it is under investigation in contemporary clinical and preclinical trials. In this article, we focus on the use of 5‑ALA as a radiosensitizer for photon irradiation. Our objective is to systematically review and discuss the available data for ALA-RDT in different malignancies as well as the uncertainties and limitations of this emerging concept. Methods This article was prepared following the Preferred Reporting Items for Systemic Review and Meta-Analysis (PRISMA) guideline [ 20 We performed a systematic review in the PubMed database with the search term “5-ALA [All] AND (photon irradiation [All] OR radiotherapy [All] OR radiodynamic therapy [All]).” The last date of consultation was November 13, 2024. All abstracts identified by this search term were included in the analysis, screened for accessibility, and reviewed. Articles were then excluded if they did not cover treatment involving RDT (but rather PDT, sonodynamic therapy [SDT], or fluorescence-guided resection) or if they were limited to background information (comments on other articles or letters regarding trial designs). When in doubt, studies underwent full-text analysis. Two different radiation oncologists performed the full-text analysis as a means of verification of the inclusion process to validate the article selection; no automation tools were used, and no data were directly obtained from study investigators. The search strategy as well as the inclusion and exclusion criteria are summarized in Table 1 Table 1 Search strategy and inclusion and exclusion criteria of the systematic literature review. 5-ALA RDT PDT SDT Search strategy Database: PubMed Search algorithm: 5‑ALA [All] AND (photon irradiation [All] OR radiotherapy [All] OR radiodynamic therapy [All]) Inclusion criteria All abstracts identified by the search strategy were included Exclusion criteria Articles featuring fluorescence-guided resection rather than RDT Articles featuring PDT or SDT rather than RDT Articles without distinctive data (e.g., comment or review) Articles not available in English Results Our search strategy generated 249 results, of which 28 abstracts were included for full-text study, and 221 were excluded from further analysis. Reasons for exclusion were articles featuring ALA-PDT rather than RDT ( n n n n 2 2 Fig. 2 Study screening and inclusion during the literature review process as recommended by the PRISMA guideline Table 2 Results of the systematic literature review First author Year Tumor entity Setup Cell line or type ALA dose RT dose Observed effect of 5‑ALA + RT Reference Yamamoto J 2012 GBM In vitro 9L/C6 1 mM, 4 h prior to RT Up to 10 Gy in 5 fx Increased radiosensitivity and ROS production [ 22 Yamamoto J 2015 Glioma In vivo 9L 100 mg/kg i.v. injection, 3h prior to RT 10 Gy in 5 fx Significant delay in tumor growth [ 10 Kitagawa T 2015 Glioma In vitro 9L/U251 1 mM, 4 h prior to RT 10 Gy in 1 fx Significant increase in ROS production [ 9 Park Y 2016 Glioma In vitro and in vivo MES-GSCs/NP-GSCs/MES-GSCs 240 mg/kg i.p. injection 30 Gy in 10 fx Significant increase in median survival [ 25 Ueta K 2016 Glioma In vitro 9L/U251 Up to 1 mM, 24 h prior to RT Up to 10 Gy in 1 fx Increased cell death and increased production of delayed mitochondrial ROS [ 23 Takahashi J 2021 GBM In vivo U251/U87 Up to 240 mg/kg orally, 4 h prior to RT 60 Gy in 30 fx Slowed tumor progression and promoted regression with no significant increase in toxicity [ 70 Chiang CS 2021 GBM In vitro and in vivo GBM8401/GL261 20 mg/kg i.c. injection, 24 h prior to RT 2 Gy in 1 fx Significant reduction of cell viability in combination with a spherical radioenhancer (GD) [ 73 Dupin C 2022 GBM In vivo Human GBM cells 100 mg/kg i.p. injection, 4 h prior to RT Up to 15 Gy in 5 fx No enhancement of radiation efficiency [ 26 Fukumura M 2023 GBM In vitro and in vivo HGG13/HGG30/TS 80 mg/kg orally, 4–26.5 h prior to RT Up to 21.9 Gy Eq in 1 fx Improved survival and upregulation of amino acid transporters [ 24 Gordon JA 2023 Glioma Case report Human HGG cells N/A 60 Gy BTX Effective radiotherapy dose localization with sparing of organs at risk [ 74 Mandl GA 2023 GBM In vitro U251 1 mM, 24 h prior to RT Up to 20 Gy in 1 fx Increased radiosensitizing effect in combination with Pr3+ nanoparticles [ 75 Pepper NB 2024 GBM Clinical trial Human GBM 20 mg/kg orally, 6–8h prior to RT Up to 39.6 Gy in 22 fx Results pending [ 28 Takahashi J 2013 Melanoma In vitro and in vivo B16-BL6 50 mg/kg i.t. injection, 24 h prior to RT 30 Gy in 10 fx Significant delay in tumor growth [ 29 Takahashi J 2016 Melanoma In vivo B16-BL6 50 mg/kg i.t. injection, 24 h prior to RT 30 Gy in 10 fx Significant delay in tumor growth and dysregulation of genes related to cell cycle arrest [ 30 Mohammadi Z 2017 Melanoma In vitro MeL-Rm 20 mM, 24 h prior to RT Up to 16 Gy in 1 fx No enhancement of radiation efficiency in combination with gold nanoparticles [ 31 Takahashi J 2018 Melanoma In vivo B16-BL6 50 mg/kg i.v. injection, 4–5 h prior to RT Up to 30 Gy in 10 fx Slowed tumor progression and promoted regression [ 8 Takahashi J 2019 Melanoma In vivo B16-Luc 200 mg/kg i.p. injection, 4 h prior to RT 14 Gy in 7 fx Significant delay in tumor growth [ 17 Hasegawa T 2020 Melanoma In vitro B16 5 µM PpIX Up to 10 Gy in 1 fx Increase in ROS production, single-strand and double-strand breaks [ 16 Kaneko T 2018 Breast In vitro EMT6 1 mM, 5 h prior to RT Up to 1.5 Gy Eq in 1 fx Increase in mitochondrial ROS production and double-strand breaks [ 37 Jiang F 2022 Breast In vitro 4T1 N/A 5 Gy in 1 fx Significantly improved tumor suppression and survival in combination with RDT with the CsI(Na)@MgO nanoparticles but no enhancement of radiation efficiency of ALA alone [ 35 Viswanath D 2023 Breast In vivo 4T1 1 mM, 5 h prior to RT 8 Gy in 1 fx Significantly improved survival in combination with calcium tungstate nanoparticles but no enhancement of radiation efficiency of ALA alone [ 36 Yang DM 2022 SCLC In vivo KP1 100 mg/kg i.v. injection, 4 h prior to RT 4 Gy in 1 fx Significant delay in tumor growth [ 38 Han J 2022 NSCLC In vivo H1299 50 mg/kg i.v. injection, 3 h prior to RT 5 Gy in 1 fx Significant delay in tumor growth, further increase in combination with doxorubicin-coated nanoparticles [ 39 Miyake M 2019 Prostate In vitro and in vivo MyC-CaP Up to 300 mg/kg orally 12 Gy in 3 fx Significant delay in tumor growth and radioprotective profile in normal rectal and urinary bladders [ 32 Miyake M 2020 Prostate Clinical trial Human PC 200 mg per day orally for 6 months 160 Gy BTX Results pending [ 33 Panetta JV 2020 Prostate In vivo PC‑3 100 mg/kg iv injection, 4 h prior to RT 4 Gy in 1 fx Significant delay in tumor growth in combination with carbamide peroxide but not with ALA alone [ 34 Owari T 2022 Prostate In vitro and in vivo PC-3/DU-145/MyC-CaP 30 mg/kg orally, 3 h prior to RT 20 Gy in 10 fx Significant delay in tumor growth, increased mitochondrial ROS production, induced mitochondrial dysfunction, and decreased radiation resistance under hypoxic conditions [ 71 Yamada K 2019 Colorectal In vitro and in vivo HT29 50 mg i.p. injection, 4 h prior to RT Up to 15 Gy in 5 fx Significant delay in tumor growth [ 48 Schaffer M 2002 Sarcoma In vivo Lewis sarcoma 200 mg/kg injection, 24 h prior to RT 3 Gy in 1 fx No enhancement of radiation efficiency [ 45 Tung FI 2021 Sarcoma In vitro MG63 200 μg/ml, 24 h prior to RT 2gy in 1 fx Increased ROS production in combination with chitosan-coated nanoparticles but no enhancement of radiation efficiency of ALA alone [ 46 Suzuki K 2023 PCNSL In vitro Raji/HKBML/TK 0.3 μM, 4 h prior to RT Up to 20 Gy in 10 fx Increased delayed ROS production for all cell lines under normoxic conditions and for TK cells under hypoxic conditions [ 15 ALA BTX fx GBM i.p. i.v. ROS RT @ Discussion Glioma The largest body of evidence for the radiosensitizing properties of 5‑ALA can be found in the treatment of glioma. Since 5‑ALA is commonly used for fluorescence-guided resection in high-grade glioma and PDT has also shown promising results, it is not surprising that the use of ALA-RDT has been explored in this field by several working groups [ 1 21 22 9 23 8 10 24 25 26 15 Two trials involved human patients: in a phase I study, Schaffer et al. treated 12 patients with solid tumors at different sites (including 3 high-grade gliomas) with radiotherapy and upfront injection of Photofrin II (initially provided by Axcan Pharma Inc, Mont-Saint-Hilaire, Canada; now distributed by Concordia Laboratories Inc. Pinnacle Biologics, Bannockburn, IL, USA), a commercially available hematoporphyrin derivate. Of the 3 glioma patients, 2 showed stable disease for > 12 months and one developed early relapse [ 27 28 26 The existing preclinical evidence and setup of a first prospective phase 1 trial make the field of glioma the entity most likely to see an implementation of ALA-RDT in the future. However, several questions remain unanswered, as discussed in the “Uncertainties and possible limitations of ALA-RDT” section. Melanoma 5‑ALA is commonly used as a mediator of PDT in the treatment of skin diseases [ 5 17 29 30 8 31 16 2 2 2 Prostate cancer Radiotherapy is a common treatment option for prostate cancer in different scenarios. Especially in early-stage disease, external-beam radiotherapy (EBRT), brachytherapy (BTX), or a combination of both offer excellent degrees of long-term disease-free survival. With modern RT techniques like image-guided RT (IGRT), intensity-modulated RT (IMRT), and daily adaptation of target volumes (ART), high levels of precision have become standard. However, due to a need for high doses in a target volume adjacent to vulnerable organs at risk, the reduction of treatment toxicity remains a focus of clinical research. In this regard, a study by Miyake et al. not only demonstrated a radiosensitizing effect in human and murine prostate cancer cells but could also show a radioprotective effect for rectal and urinary tract mucosa, potentially representing a double benefit of ALA in the treatment of prostate cancer [ 32 33 34 Breast cancer For women receiving breast-conserving surgery, postoperative RT is the standard of care, making breast cancer (as well as the previously outlined prostate cancer) one of the most frequent indications for radiation oncologists. Evidence regarding a benefit of 5‑ALA is limited, consisting of two studies of nanoparticle-based delivery of 5‑ALA before irradiation in 4T1 cells, which present improved tumor suppression when combining the respective models with ionizing radiation in vitro [ 35 36 37 37 35 36 Lung cancer Radiotherapy in the form of (neo)adjuvant or definitive chemoradiotherapy (CRT) as well as monomodal stereotactic RT is commonly used in curative treatment of lung cancer patients. Especially cases with mediastinal involvement could potentially benefit from a selective increase in RT effectiveness in tumor cells, due to the close proximity to organs at risk (e.g., heart and esophagus). Two preclinical trials have demonstrated the use of 5‑ALA as a radiosensitizer for lung cancer: Yang et al. used an in vivo model with KP1 SCLC cells, showing a significant delay in tumor growth, increased survival, and reduction of fluorodeoxyglucose (FDG) uptake after injection of 100 mg/kg 5‑ALA 4 h prior to single-fraction RT with 4 Gy [ 38 39 Lymphoma Primary central nervous system lymphoma (PCNSL) is a rare disease with a mostly poor outcome: low-grade entities account for only a very small fraction, while the majority of cases comprise aggressive subtypes (usually diffuse large B‑cell lymphoma). PCNSL is highly radiosensitive, and indolent subtypes may be treated with focal RT alone [ 40 41 42 44 15 Sarcoma In 2002, Schaffer et al. compared the radiosensitizing capabilities of Photofrin II (another mediator of PDT increasing ROS via accumulation of PpIX) to 5‑ALA in a rodent model using a Lewis rat sarcoma cell model. While an effect was found after 1 × 3 Gy RT for Photofrin, no effect was seen after pretreatment with 5‑ALA [ 45 46 Colorectal cancer While colon cancer is typically treated with surgery and chemotherapy, RT is regularly administered in the treatment of rectal cancer for locally advanced disease as part of neoadjuvant treatment (in the form of short-course RT, long-course CRT, or intensified total neoadjuvant treatment). Modern concepts also focus on organ preservation, exploring inducing complete remission via an increase in focal treatment dose [ 47 48 2 49 32 Future perspective entities Of the excluded manuscripts, 16 articles featured entities with potential RT indications. Since the use of PDT might translate into RDT, these entities are summarized in the following. In meningioma, radiotherapy plays a key role in the treatment of high-grade, unresectable, or recurrent tumors, with a variety of possible fractioned or stereotactic RT application methods and dose schedules. As 5‑ALA has already been explored in the context of fluorescence-guided resection and PDT for meningioma as well [ 50 52 53 56 57 58 61 62 63 64 68 67 Uncertainties and possible limitations of ALA-RDT The included studies consist mainly of preclinical trials and therefore have a low risk of bias. While the majority of publications could demonstrate a benefit of combining 5‑ALA with ionizing irradiation, some authors did not find a synergistic effect or, in some cases, an additional agent was needed to trigger an increase in radiosensitivity [ 34 36 46 The first and most fundamental uncertainty is the overall manifestation of a synergistic effect in different tumor entities: As pointed out by Dupin et al., preclinical models show a variety of implantation sites of tumor cells in vivo. In their approach, using an orthotopic model of glioblastoma cells did not show the radiosensitizing effect described by several other authors under different circumstances [ 26 15 69 Additionally, the presented review demonstrates variability in the susceptibility to ALA-RDT in different tumor entities. While the existing data do not allow a conclusive explanation for this heterogeneity, it is most likely to be attributed to differences in tumor biology. Again, tissue- and tumor-specific differences in cell proliferation, intracellular metabolism, oxygen supply, and amino acid channel structures might be the underlying reasons. The articles discussed in this review might depict melanoma and glioma as the most susceptible to ALA-RDT, but this is likely biased by the relatively larger number of publications in these entities, for which 5‑ALA has already been implemented in the context of PDT and/or fluorescence-guided resection. But as the investigation of this novel combination of RT and radiosensitizer progresses into clinical use, positive results might also kindle additional efforts exploring other entities. Further uncertainty concerns the optimal manner, dose, and timing of ALA application: again, the included studies show high diversity regarding the form of application (oral, intraperitoneal, and intravenous), the respective dose (ranging from 50 to 300 mg/kg), and the latency between drug administration and irradiation (ranging from 3 to 24 h). Oral 5‑ALA is easily administrable and has demonstrated tissue penetrance even in privileged areas like the brain in the context of PDT and fluorescence-guided resection and has shown a positive radiosensitizing effect in multiple in vivo experiments [ 24 32 70 71 28 33 The optimal timing and dose of drug administration also remain elusive, as the presented trials do not enable correlation of the effectiveness of ALA-RDT with certain parameters. The time between drug application and irradiation varies between 3 and 24 h prior to RT. Again, different tumors are likely to need different solutions based on tissue penetration. For glioma, data on fluorescence kinetics point towards a peak of mediating PpIX after 7–8 h [ 72 26 33 15 10 70 32 28 33 Lastly, the optimal RT dose and fractionation schedule for RDT remains unclear. In the context of modern radiation oncology, normofractioned RT remains common, but hypofractioned treatment with SRS or SBRT/SABR concepts is gaining increasing popularity, especially in palliative settings. The existing data range widely between single- and multi-fraction RT, with single fraction doses between 2 and 20 Gy, which correlate well with clinically implemented RT doses. Again, additional scientific effort is needed to sharpen the view on this detail, as current data do not allow for confident estimation of the superiority of one fractionation schedule over another. Notably, only one in vivo trial has replicated the course of standard RT in a rodent trial: Takahashi et al. used 60 Gy in 30 fractions for their GBM model and were able to demonstrate a radiosensitizing effect compared to normal treatment by the addition of 5‑ALA [ 70 While these limitations are varied and concern major details in the planning and conduction of ALA-RDT, the existing data deliver a promising foundation, and currently ongoing trials suggest a substantial chance to generate the necessary data regarding tolerability and effectiveness to further implement repeated applications of 5‑ALA as a radiosensitizer to increase the effectiveness of modern RT for different tumor entities. Conclusion The capabilities of 5‑aminolevulinic acid as a radiosensitizer in radiodynamic therapy have been evaluated in a multitude of solid tumors. Preclinical data seem to deliver a solid basis for combined application of 5‑ALA and radiotherapy, as in vivo and in vitro models reveal the mechanism of enhancing radiation-induced cell damage, and tissue uptake is well documented based on experiences in PDT and fluorescence-guided resection. Uncertainties remain regarding the timing, dose, and combination of repeated ALA administrations in the context of modern radiation treatment concepts. Clinical trials and future scientific efforts will help to further explore the potential of this promising combination and are currently underway. Supplementary Information  Prisma checklist Use of generative AI: No AI or large language models (LLMs) were used to generate content of written or illustrative form in the preparation of this manuscript. During finalization, the authors used LLMs in the form of ChatGPT, version May 16, 2024, provided by OpenAI (San Francisco, CA, USA) to correct spelling mistakes and improve wording. After using this tool/service, the main author reviewed and edited the content as needed and takes full responsibility for the content of the publication. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author Contribution Conceptualization: N.B. Pepper; methodology: N.B. Pepper; investigation and data curation: N.B. Pepper; writing—original draft preparation: N.B. Pepper; writing—review and editing: F.M. Troschel, W. Stummer, and H.T. Eich; illustration design: F.M. Troschel; supervision: H.T. Eich; all authors have read and agreed to the published version of the manuscript. Funding Open Access funding enabled and organized by Projekt DEAL. Data Availability All data are publicly available via the PubMed database. Declarations Conflict of interest W. Stummer received research support from Photonamic, Novocure, Zeiss Meditec, and Alpheus. Furthermore, W. Stummer has consulting activities for Stryker, Olympus, and SBI ALA Pharma. N.B. Pepper, F.M. Troschel, and H.T. Eich declare that they have no competing interests. Ethical standards For this article no studies with human participants or animals were performed by any of the authors. All studies mentioned were in accordance with the ethical standards indicated in each case. References 1. Nordmann NJ Michael AP 5-Aminolevulinic acid radiodynamic therapy for treatment of high-grade gliomas: a systematic review Clin Neurol Neurosurg 2021 201 106430 10.1016/j.clineuro.2020.106430 33360951 Nordmann NJ, Michael AP (2021) 5‑Aminolevulinic acid radiodynamic therapy for treatment of high-grade gliomas: a systematic review. Clin Neurol Neurosurg 201:106430 33360951 10.1016/j.clineuro.2020.106430 2. Stummer W Pichlmeier U Meinel T Wiestler OD Zanella F Reulen HJ Fluorescence-guided surgery with 5-aminolevulinic acid for resection of malignant glioma: a randomised controlled multicentre phase III trial Lancet Oncol 2006 7 5 392 401 10.1016/S1470-2045(06)70665-9 16648043 Stummer W, Pichlmeier U, Meinel T, Wiestler OD, Zanella F, Reulen HJ (2006) Fluorescence-guided surgery with 5‑aminolevulinic acid for resection of malignant glioma: a randomised controlled multicentre phase III trial. Lancet Oncol 7(5):392–401 16648043 10.1016/S1470-2045(06)70665-9 3. Schipmann S Müther M Stögbauer L Zimmer S Brokinkel B Holling M Grauer O Suero Molina E Warneke N Stummer W Combination of ALA-induced fluorescence-guided resection and intraoperative open photodynamic therapy for recurrent glioblastoma: case series on a promising dual strategy for local tumor control J. Neurosurg. 2021 134 2 426 436 10.3171/2019.11.JNS192443 31978877 Schipmann S, Müther M, Stögbauer L, Zimmer S, Brokinkel B, Holling M, Grauer O, Suero Molina E, Warneke N, Stummer W (2021) Combination of ALA-induced fluorescence-guided resection and intraoperative open photodynamic therapy for recurrent glioblastoma: case series on a promising dual strategy for local tumor control. J Neurosurg 134(2):426–436 31978877 10.3171/2019.11.JNS192443 4. Stummer W Beck T Beyer W Mehrkens JH Obermeier A Etminan N Stepp H Tonn JC Baumgartner R Herms J Kreth FW Long-sustaining response in a patient with non-resectable, distant recurrence of glioblastoma multiforme treated by interstitial photodynamic therapy using 5-ALA: case report J Neurooncol 2008 87 1 103 109 10.1007/s11060-007-9497-x 18034212 Stummer W, Beck T, Beyer W, Mehrkens JH, Obermeier A, Etminan N, Stepp H, Tonn JC, Baumgartner R, Herms J, Kreth FW (2008) Long-sustaining response in a patient with non-resectable, distant recurrence of glioblastoma multiforme treated by interstitial photodynamic therapy using 5‑ALA: case report. J Neurooncol 87(1):103–109 18034212 10.1007/s11060-007-9497-x 5. Morton C The emerging role of 5-ALA-PDT in dermatology: is PDT superior to standard treatments? J Dermatological Treat 2002 13 1 s25 9 10.1080/095466302317414672 12060514 Morton C (2002) The emerging role of 5‑ALA-PDT in dermatology: is PDT superior to standard treatments? J Dermatological Treat 13(1):s25–9 10.1080/095466302317414672 12060514 6. Casas A Clinical uses of 5-aminolaevulinic acid in photodynamic treatment and photodetection of cancer: a review Cancer Lett 2020 490 165 173 10.1016/j.canlet.2020.06.008 32534172 Casas A (2020) Clinical uses of 5‑aminolaevulinic acid in photodynamic treatment and photodetection of cancer: a review. Cancer Lett 490:165–173 32534172 10.1016/j.canlet.2020.06.008 7. Shinoda Y Kato D Ando R Endo H Takahashi T Tsuneoka Y Fujiwara Y Systematic review and meta-analysis of in vitro anti-human cancer experiments investigating the use of 5-Aminolevulinic acid (5-ALA) for photodynamic therapy Pharmaceuticals 2021 14 3 229 10.3390/ph14030229 33800109 PMC8000125 Shinoda Y, Kato D, Ando R, Endo H, Takahashi T, Tsuneoka Y, Fujiwara Y (2021) Systematic review and meta-analysis of in vitro anti-human cancer experiments investigating the use of 5‑Aminolevulinic acid (5-ALA) for photodynamic therapy. Pharmaceuticals 14(3):229 33800109 10.3390/ph14030229 PMC8000125 8. Takahashi J Murakami M Mori T Iwahashi H Verification of radiodynamic therapy by medical linear accelerator using a mouse melanoma tumor model Sci Rep 2018 8 1 2728 10.1038/s41598-018-21152-z 29426920 PMC5807383 Takahashi J, Murakami M, Mori T, Iwahashi H (2018) Verification of radiodynamic therapy by medical linear accelerator using a mouse melanoma tumor model. Sci Rep 8(1):2728 29426920 10.1038/s41598-018-21152-z PMC5807383 9. Kitagawa T Yamamoto J Tanaka T Nakano Y Akiba D Ueta K Nishizawa S 5-Aminolevulinic acid strongly enhances delayed intracellular production of reactive oxygen species (ROS) generated by ionizing irradiation: quantitative analyses and visualization of intracellular ROS production in glioma cells in vitro Oncol Rep 2015 33 2 583 590 10.3892/or.2014.3618 25420428 Kitagawa T, Yamamoto J, Tanaka T, Nakano Y, Akiba D, Ueta K, Nishizawa S (2015) 5‑Aminolevulinic acid strongly enhances delayed intracellular production of reactive oxygen species (ROS) generated by ionizing irradiation: quantitative analyses and visualization of intracellular ROS production in glioma cells in vitro. Oncol Rep 33(2):583–590 25420428 10.3892/or.2014.3618 10. Yamamoto J Ogura SI Shimajiri S Nakano Y Akiba D Kitagawa T Ueta K Tanaka T Nishizawa S 5-Aminolevulinic acid-induced protoporphyrin IX with multi-dose ionizing irradiation enhances host antitumor response and strongly inhibits tumor growth in experimental glioma in vivo Mol Med Rep 2015 11 3 1813 1819 10.3892/mmr.2014.2991 25420581 Yamamoto J, Ogura SI, Shimajiri S, Nakano Y, Akiba D, Kitagawa T, Ueta K, Tanaka T, Nishizawa S (2015) 5‑Aminolevulinic acid-induced protoporphyrin IX with multi-dose ionizing irradiation enhances host antitumor response and strongly inhibits tumor growth in experimental glioma in vivo. Mol Med Rep 11(3):1813–1819 25420581 10.3892/mmr.2014.2991 11. Zhao SG Chen XF Wang LG Yang G Han DY Teng L Yang MC Wang DY Shi C Liu YH Zheng BJ Shi CB Gao X Rainov NG Increased expression of ABCB6 enhances protoporphyrin IX accumulation and photodynamic effect in human glioma Ann Surg Oncol 2013 20 13 4379 4388 10.1245/s10434-011-2201-6 22688660 Zhao SG, Chen XF, Wang LG, Yang G, Han DY, Teng L, Yang MC, Wang DY, Shi C, Liu YH, Zheng BJ, Shi CB, Gao X, Rainov NG (2013) Increased expression of ABCB6 enhances protoporphyrin IX accumulation and photodynamic effect in human glioma. Ann Surg Oncol 20(13):4379–4388 22688660 10.1245/s10434-011-2201-6 12. Tran TT Mu A Adachi Y Adachi Y Taketani S Neurotransmitter transporter family including SLC 6 A 6 and SLC 6 A 13 contributes to the 5-Aminolevulinic acid (ALA)-induced accumulation of protoporphyrin IX and photodamage, through uptake of ALA by cancerous cells Photochem Photobiol 2014 90 5 1136 1143 10.1111/php.12290 24842606 Tran TT, Mu A, Adachi Y, Adachi Y, Taketani S (2014) Neurotransmitter transporter family including SLC 6 A 6 and SLC 6 A 13 contributes to the 5‑Aminolevulinic acid (ALA)-induced accumulation of protoporphyrin IX and photodamage, through uptake of ALA by cancerous cells. Photochem Photobiol 90(5):1136–1143 24842606 10.1111/php.12290 13. Hagiya Y Fukuhara H Matsumoto K Endo Y Nakajima M Tanaka T Okura I Kurabayashi A Furihata M Inoue K Shuin T Expression levels of PEPT1 and ABCG2 play key roles in 5-aminolevulinic acid (ALA)-induced tumor-specific protoporphyrin IX (PpIX) accumulation in bladder cancer Photodiagnosis Photodyn Ther 2013 10 3 288 295 10.1016/j.pdpdt.2013.02.001 23993855 Hagiya Y, Fukuhara H, Matsumoto K, Endo Y, Nakajima M, Tanaka T, Okura I, Kurabayashi A, Furihata M, Inoue K, Shuin T (2013) Expression levels of PEPT1 and ABCG2 play key roles in 5‑aminolevulinic acid (ALA)-induced tumor-specific protoporphyrin IX (PpIX) accumulation in bladder cancer. Photodiagnosis Photodyn Ther 10(3):288–295 23993855 10.1016/j.pdpdt.2013.02.001 14. Ishizuka M Abe F Sano Y Takahashi K Inoue K Nakajima M Kohda T Komatsu N Novel development of 5-aminolevurinic acid (ALA) in cancer diagnoses and therapy Int Immunopharmacol 2011 11 3 358 365 10.1016/j.intimp.2010.11.029 21144919 Ishizuka M, Abe F, Sano Y, Takahashi K, Inoue K, Nakajima M, Kohda T, Komatsu N (2011) Novel development of 5‑aminolevurinic acid (ALA) in cancer diagnoses and therapy. Int Immunopharmacol 11(3):358–365 21144919 10.1016/j.intimp.2010.11.029 15. Suzuki K Yamamoto J Toh K Miyaoka R 5-aminiolevulinic acid induces a radiodynamic effect with enhanced delayed reactive oxygen species production under hypoxic conditions in lymphoma cells: an in vitro study Exp Ther Med 2023 26 1 360 10.3892/etm.2023.12059 37324514 PMC10265716 Suzuki K, Yamamoto J, Toh K, Miyaoka R (2023) 5‑aminiolevulinic acid induces a radiodynamic effect with enhanced delayed reactive oxygen species production under hypoxic conditions in lymphoma cells: an in vitro study. Exp Ther Med 26(1):360 37324514 10.3892/etm.2023.12059 PMC10265716 16. Hasegawa T Takahashi J Nagasawa S Doi M Moriyama A Iwahashi H DNA strand break properties of protoporphyrin IX by X-ray irradiation against melanoma Int J Mol Sci 2020 21 7 2302 10.3390/ijms21072302 32225109 PMC7177738 Hasegawa T, Takahashi J, Nagasawa S, Doi M, Moriyama A, Iwahashi H (2020) DNA strand break properties of protoporphyrin IX by X‑ray irradiation against melanoma. Int J Mol Sci 21(7):2302 32225109 10.3390/ijms21072302 PMC7177738 17. Takahashi J Nagasawa S Ikemoto MJ Sato C Sato M Iwahashi H Verification of 5-Aminolevurinic radiodynamic therapy using a murine melanoma brain metastasis model Int J Mol Sci 2019 20 20 5155 10.3390/ijms20205155 31627442 PMC6834170 Takahashi J, Nagasawa S, Ikemoto MJ, Sato C, Sato M, Iwahashi H (2019) Verification of 5‑Aminolevurinic radiodynamic therapy using a murine melanoma brain metastasis model. Int J Mol Sci 20(20):5155 31627442 10.3390/ijms20205155 PMC6834170 18. Yamamori T Yasui H Yamazumi M Wada Y Nakamura Y Nakamura H Inanami O Ionizing radiation induces mitochondrial reactive oxygen species production accompanied by upregulation of mitochondrial electron transport chain function and mitochondrial content under control of the cell cycle checkpoint Free Radic Biol Med 2012 53 2 260 270 10.1016/j.freeradbiomed.2012.04.033 22580337 Yamamori T, Yasui H, Yamazumi M, Wada Y, Nakamura Y, Nakamura H, Inanami O (2012) Ionizing radiation induces mitochondrial reactive oxygen species production accompanied by upregulation of mitochondrial electron transport chain function and mitochondrial content under control of the cell cycle checkpoint. Free Radic Biol Med 53(2):260–270 22580337 10.1016/j.freeradbiomed.2012.04.033 19. Saenko Y Cieslar-Pobuda A Skonieczna M Rzeszowska-Wolny J Changes of reactive oxygen and nitrogen species and mitochondrial functioning in human K562 and HL60 cells exposed to ionizing radiation Radiat Res 2013 180 4 360 366 10.1667/RR3247.1 24033192 Saenko Y, Cieslar-Pobuda A, Skonieczna M, Rzeszowska-Wolny J (2013) Changes of reactive oxygen and nitrogen species and mitochondrial functioning in human K562 and HL60 cells exposed to ionizing radiation. Radiat Res 180(4):360–366 24033192 10.1667/RR3247.1 20. Moher D Liberati A Tetzlaff J Altman DG Preferred reporting items for systematic reviews and meta-analyses: the PRISMA statement BMJ 2009 339 1 b2535 10.1136/bmj.b2535 19622551 PMC2714657 Moher D, Liberati A, Tetzlaff J, Altman DG (2009) Preferred reporting items for systematic reviews and meta-analyses: the PRISMA statement. BMJ 339(1):b2535 19622551 10.1136/bmj.b2535 PMC2714657 21. Kostron H Swartz MR Miller DC Martuza RL The interaction of hematoporphyrin derivative, light, and ionizing radiation in a rat glioma model Cancer 1986 57 5 964 970 10.1002/1097-0142(19860301)57:5&#x0003c;964::AID-CNCR2820570515&#x0003e;3.0.CO;2-S 3943032 Kostron H, Swartz MR, Miller DC, Martuza RL (1986) The interaction of hematoporphyrin derivative, light, and ionizing radiation in a rat glioma model. Cancer 57(5):964–970 3943032 10.1002/1097-0142(19860301)57:5<964::aid-cncr2820570515>3.0.co;2-s 22. Yamamoto J Radiosensitizing effect of 5-aminolevulinic acid-induced protoporphyrin IX in glioma cells inï¿½vitro Oncol Rep 2012 10.3892/or.2012.1699 22378066 Yamamoto J (2012) Radiosensitizing effect of 5‑aminolevulinic acid-induced protoporphyrin IX in glioma cells inï¿½vitro. Oncol Rep. 10.3892/or.2012.1699 22378066 10.3892/or.2012.1699 23. Ueta K Yamamoto J Tanaka T Nakano Y Kitagawa T Nishizawa S 5-Aminolevulinic acid enhances mitochondrial stress upon ionizing irradiation exposure and increases delayed production of reactive oxygen species and cell death in glioma cells Int J Mol Med 2017 39 2 387 398 10.3892/ijmm.2016.2841 28035368 Ueta K, Yamamoto J, Tanaka T, Nakano Y, Kitagawa T, Nishizawa S (2017) 5‑Aminolevulinic acid enhances mitochondrial stress upon ionizing irradiation exposure and increases delayed production of reactive oxygen species and cell death in glioma cells. Int J Mol Med 39(2):387–398 28035368 10.3892/ijmm.2016.2841 24. Fukumura M Nonoguchi N Kawabata S Hiramatsu R Futamura G Takeuchi K Kanemitsu T Takata T Tanaka H Suzuki M Sampetrean O Ikeda N Kuroiwa T Saya H Nakano I Wanibuchi M 5-Aminolevulinic acid increases boronophenylalanine uptake into glioma stem cells and may sensitize malignant glioma to boron neutron capture therapy Sci Rep 2023 13 1 10173 10.1038/s41598-023-37296-6 37349515 PMC10287723 Fukumura M, Nonoguchi N, Kawabata S, Hiramatsu R, Futamura G, Takeuchi K, Kanemitsu T, Takata T, Tanaka H, Suzuki M, Sampetrean O, Ikeda N, Kuroiwa T, Saya H, Nakano I, Wanibuchi M (2023) 5‑Aminolevulinic acid increases boronophenylalanine uptake into glioma stem cells and may sensitize malignant glioma to boron neutron capture therapy. Sci Rep 13(1):10173 37349515 10.1038/s41598-023-37296-6 PMC10287723 25. Park Y Nonoguchi N Ikeda N Yoshikawa N Sato T Mishima Y Kajimoto Y Narumi Y Takahashi J Kuroiwa T OS3.2 Delta-aminolevulinic acid can decrease the radioresistance of glioma stem cells with mesenchymal phenotypes in vitro and in vivo Neuro Oncol 2016 18 4 iv7 iv7 10.1093/neuonc/now188.020 Park Y, Nonoguchi N, Ikeda N, Yoshikawa N, Sato T, Mishima Y, Kajimoto Y, Narumi Y, Takahashi J, Kuroiwa T (2016) OS3.2 Delta-aminolevulinic acid can decrease the radioresistance of glioma stem cells with mesenchymal phenotypes in vitro and in vivo. Neuro Oncol 18(4):iv7–iv7 26. Dupin C Sutter J Amintas S Derieppe MA Lalanne M Coulibaly S Guyon J Daubon T Boutin J Blouin JM Richard E Moreau-Gaudry F Bedel A Vendrely V Dabernat S An orthotopic model of glioblastoma is resistant to radiodynamic therapy with 5-AminoLevulinic acid Cancers 2022 14 17 4244 10.3390/cancers14174244 36077783 PMC9454704 Dupin C, Sutter J, Amintas S, Derieppe MA, Lalanne M, Coulibaly S, Guyon J, Daubon T, Boutin J, Blouin JM, Richard E, Moreau-Gaudry F, Bedel A, Vendrely V, Dabernat S (2022) An orthotopic model of glioblastoma is resistant to radiodynamic therapy with 5‑AminoLevulinic acid. Cancers 14(17):4244 36077783 10.3390/cancers14174244 PMC9454704 27. Schaffer M Ertl-Wagner B Schaffer PM Kulka U Jori G Wilkowski R Hofstetter A Dühmke E Feasibility of photofrin II as a radiosensitizing agent in solid tumors—preliminary results Oncol Res Treat 2006 29 11 514 519 10.1159/000095979 17068386 Schaffer M, Ertl-Wagner B, Schaffer PM, Kulka U, Jori G, Wilkowski R, Hofstetter A, Dühmke E (2006) Feasibility of photofrin II as a radiosensitizing agent in solid tumors—preliminary results. Oncol Res Treat 29(11):514–519 10.1159/000095979 17068386 28. Pepper NB Eich HT Müther M Oertel M Rehn S Spille DC Stummer W ALA-RDT in GBM: protocol of the phase I/II dose escalation trial of radiodynamic therapy with 5-Aminolevulinic acid in patients with recurrent glioblastoma Radiat Oncol 2024 19 1 11 10.1186/s13014-024-02408-7 38254201 PMC10804590 Pepper NB, Eich HT, Müther M, Oertel M, Rehn S, Spille DC, Stummer W (2024) ALA-RDT in GBM: protocol of the phase I/II dose escalation trial of radiodynamic therapy with 5‑Aminolevulinic acid in patients with recurrent glioblastoma. Radiat Oncol 19(1):11 38254201 10.1186/s13014-024-02408-7 PMC10804590 29. Takahashi J Misawa M Murakami M Mori T Nomura K Iwahashi H 5-Aminolevulinic acid enhances cancer radiotherapy in a mouse tumor model SpringerPlus 2013 2 1 602 10.1186/2193-1801-2-602 24324921 PMC3853190 Takahashi J, Misawa M, Murakami M, Mori T, Nomura K, Iwahashi H (2013) 5‑Aminolevulinic acid enhances cancer radiotherapy in a mouse tumor model. SpringerPlus 2(1):602 24324921 10.1186/2193-1801-2-602 PMC3853190 30. Takahashi J Misawa M Iwahashi H Combined treatment with X-ray irradiation and 5-aminolevulinic acid elicits better transcriptomic response of cell cycle-related factors than X-ray irradiation alone Int J Radiat Biol 2016 92 12 774 789 10.1080/09553002.2016.1230240 27586078 Takahashi J, Misawa M, Iwahashi H (2016) Combined treatment with X‑ray irradiation and 5‑aminolevulinic acid elicits better transcriptomic response of cell cycle-related factors than X‑ray irradiation alone. Int J Radiat Biol 92(12):774–789 27586078 10.1080/09553002.2016.1230240 31. Mohammadi Z Sazgarnia A Rajabi O Seilanian Toosi M Comparative study of X-ray treatment and photodynamic therapy by using 5-aminolevulinic acid conjugated gold nanoparticles in a melanoma cell line Artif Cells Nanomed Biotechnol 2017 45 3 467 473 10.3109/21691401.2016.1167697 27052440 Mohammadi Z, Sazgarnia A, Rajabi O, Seilanian Toosi M (2017) Comparative study of X‑ray treatment and photodynamic therapy by using 5‑aminolevulinic acid conjugated gold nanoparticles in a melanoma cell line. Artif Cells Nanomed Biotechnol 45(3):467–473 27052440 10.3109/21691401.2016.1167697 32. Miyake M Tanaka N Hori S Ohnishi S Takahashi H Fujii T Owari T Ohnishi K Iida K Morizawa Y Gotoh D Itami Y Nakai Y Inoue T Anai S Torimoto K Aoki K Fujimoto K Dual benefit of supplementary oral 5-aminolevulinic acid to pelvic radiotherapy in a syngenic prostate cancer model Prostate 2019 79 4 340 351 10.1002/pros.23740 30450646 Miyake M, Tanaka N, Hori S, Ohnishi S, Takahashi H, Fujii T, Owari T, Ohnishi K, Iida K, Morizawa Y, Gotoh D, Itami Y, Nakai Y, Inoue T, Anai S, Torimoto K, Aoki K, Fujimoto K (2019) Dual benefit of supplementary oral 5‑aminolevulinic acid to pelvic radiotherapy in a syngenic prostate cancer model. Prostate 79(4):340–351 30450646 10.1002/pros.23740 33. Miyake M Tanaka N Asakawa I Yamaki K Inoue T Suzuki S Hori S Nakai Y Anai S Torimoto K Toritsuka M Nakagawa H Tsukamoto S Fujii T Ohbayashi C Hasegawa M Kasahara M Fujimoto K A prospective study of oral 5-aminolevulinic acid to prevent adverse events in patients with localized prostate cancer undergoing low-dose-rate brachytherapy: protocol of the AMBER study Contemp Clin Trials Commun 2020 19 100593 10.1016/j.conctc.2020.100593 32637724 PMC7327239 Miyake M, Tanaka N, Asakawa I, Yamaki K, Inoue T, Suzuki S, Hori S, Nakai Y, Anai S, Torimoto K, Toritsuka M, Nakagawa H, Tsukamoto S, Fujii T, Ohbayashi C, Hasegawa M, Kasahara M, Fujimoto K (2020) A prospective study of oral 5‑aminolevulinic acid to prevent adverse events in patients with localized prostate cancer undergoing low-dose-rate brachytherapy: protocol of the AMBER study. Contemp Clin Trials Commun 19:100593 32637724 10.1016/j.conctc.2020.100593 PMC7327239 34. Panetta JV Cvetkovic D Chen X Chen L Ma CMC Radiodynamic therapy using 15-MV radiation combined with 5-aminolevulinic acid and carbamide peroxide for prostate cancer in vivo Phys Med Biol 2020 65 16 165008 10.1088/1361-6560/ab9776 32464613 PMC8409498 Panetta JV, Cvetkovic D, Chen X, Chen L, Ma CMC (2020) Radiodynamic therapy using 15-MV radiation combined with 5‑aminolevulinic acid and carbamide peroxide for prostate cancer in vivo. Phys Med Biol 65(16):165008 32464613 10.1088/1361-6560/ab9776 PMC8409498 35. Jiang F Lee C Zhang W Jiang W Cao Z Chong HB Yang W Zhan S Li J Teng Y Li Z Xie J Radiodynamic therapy with CsI(na)@MgO nanoparticles and 5-aminolevulinic acid J Nanobiotechnol 2022 20 1 330 10.1186/s12951-022-01537-z PMC9288050 35842630 Jiang F, Lee C, Zhang W, Jiang W, Cao Z, Chong HB, Yang W, Zhan S, Li J, Teng Y, Li Z, Xie J (2022) Radiodynamic therapy with CsI(na)@MgO nanoparticles and 5‑aminolevulinic acid. J Nanobiotechnol 20(1):330 10.1186/s12951-022-01537-z PMC9288050 35842630 36. Viswanath D Shin SH Yoo J Torregrosa-Allen SE Harper HA Cervantes HE Elzey BD Won YY Radiation-induced photodynamic therapy using calcium tungstate nanoparticles and 5-aminolevulinic acid prodrug Biomater Sci 2023 11 18 6311 6324 10.1039/D3BM00921A 37552121 Viswanath D, Shin SH, Yoo J, Torregrosa-Allen SE, Harper HA, Cervantes HE, Elzey BD, Won YY (2023) Radiation-induced photodynamic therapy using calcium tungstate nanoparticles and 5‑aminolevulinic acid prodrug. Biomater Sci 11(18):6311–6324 37552121 10.1039/d3bm00921a 37. Kaneko T Tominaga M Kouzaki R Hanyu A Ueshima K Yamada H Suga M Yamashita T Okimoto T Uto Y Radiosensitizing effect of 5-Aminolevulinic acid and protoporphyrin IX on carbon-ion beam irradiation Anticancer Res 2018 38 7 4313 4317 10.21873/anticanres.12730 29970567 Kaneko T, Tominaga M, Kouzaki R, Hanyu A, Ueshima K, Yamada H, Suga M, Yamashita T, Okimoto T, Uto Y (2018) Radiosensitizing effect of 5‑Aminolevulinic acid and protoporphyrin IX on carbon-ion beam irradiation. Anticancer Res 38(7):4313–4317 29970567 10.21873/anticanres.12730 38. Yang DM Cvetkovic D Chen L Ma CMC Therapeutic effects of in-vivo radiodynamic therapy (RDT) for lung cancer treatment: a combination of 15 MV photons and 5-aminolevulinic acid (5-ALA) Biomed Phys Eng Express 2022 8 6 065031 10.1088/2057-1976/ac9b5c PMC9916272 36263662 Yang DM, Cvetkovic D, Chen L, Ma CMC (2022) Therapeutic effects of in-vivo radiodynamic therapy (RDT) for lung cancer treatment: a combination of 15 MV photons and 5‑aminolevulinic acid (5-ALA). Biomed Phys Eng Express 8(6):65031 10.1088/2057-1976/ac9b5c PMC9916272 36263662 39. Han J Yang W Li Y Li J Jiang F Xie J Huang X Combining doxorubicin-conjugated polymeric nanoparticles and 5-Aminolevulinic acid for enhancing radiotherapy against lung cancer Bioconjugate Chem 2022 33 4 654 665 10.1021/acs.bioconjchem.2c00066 35385661 Han J, Yang W, Li Y, Li J, Jiang F, Xie J, Huang X (2022) Combining doxorubicin-conjugated polymeric nanoparticles and 5‑Aminolevulinic acid for enhancing radiotherapy against lung cancer. Bioconjugate Chem 33(4):654–665 10.1021/acs.bioconjchem.2c00066 35385661 40. Pepper NB Oertel M Reinartz G Elsayad K Hering DA Yalcin F Wildgruber M Stummer W Lenz G Klapper W Eich HT Involved-site radiation therapy enables effective disease control in parenchymal low-grade primary cerebral lymphoma Cancers 2023 15 23 5564 10.3390/cancers15235564 38067268 PMC10705142 Pepper NB, Oertel M, Reinartz G, Elsayad K, Hering DA, Yalcin F, Wildgruber M, Stummer W, Lenz G, Klapper W, Eich HT (2023) Involved-site radiation therapy enables effective disease control in parenchymal low-grade primary cerebral lymphoma. Cancers 15(23):5564 38067268 10.3390/cancers15235564 PMC10705142 41. Seidel C Viehweger C Kortmann RD Is there an indication for first line radiotherapy in primary CNS lymphoma? Cancers 2021 13 11 2580 10.3390/cancers13112580 34070309 PMC8197540 Seidel C, Viehweger C, Kortmann RD (2021) Is there an indication for first line radiotherapy in primary CNS lymphoma? Cancers 13(11):2580 34070309 10.3390/cancers13112580 PMC8197540 42. Evers G Kamp M Warneke N Berdel W Sabel M Stummer W Ewelt C 5-Aminolaevulinic acid-induced fluorescence in primary central nervous system lymphoma World Neurosurg 2017 98 375 380 10.1016/j.wneu.2016.11.011 27838426 Evers G, Kamp M, Warneke N, Berdel W, Sabel M, Stummer W, Ewelt C (2017) 5‑Aminolaevulinic acid-induced fluorescence in primary central nervous system lymphoma. World Neurosurg 98:375–380 27838426 10.1016/j.wneu.2016.11.011 43. Yamamoto J Kitagawa T Akiba D Nishizawa S 5-aminolevulinic acid-induced fluorescence in cerebellar primary central nervous system lymphoma: a case report and literature review Turk Neurosurg 2014 10.5137/1019-5149.JTN.10594-14.1 26442550 Yamamoto J, Kitagawa T, Akiba D, Nishizawa S (2014) 5‑aminolevulinic acid-induced fluorescence in cerebellar primary central nervous system lymphoma: a case report and literature review. Turk Neurosurg. 10.5137/1019-5149.JTN.10594-14.1 10.5137/1019-5149.JTN.10594-14.1 26442550 44. Kiesel B Millesi M Woehrer A Furtner J Bavand A Roetzer T Mischkulnig M Wolfsberger S Preusser M Knosp E Widhalm G 5-ALA-induced fluorescence as a marker for diagnostic tissue in stereotactic biopsies of intracranial lymphomas: experience in 41 patients Neurosurg Focus 2018 44 6 E7 10.3171/2018.3.FOCUS1859 29852770 Kiesel B, Millesi M, Woehrer A, Furtner J, Bavand A, Roetzer T, Mischkulnig M, Wolfsberger S, Preusser M, Knosp E, Widhalm G (2018) 5‑ALA-induced fluorescence as a marker for diagnostic tissue in stereotactic biopsies of intracranial lymphomas: experience in 41 patients. Neurosurg Focus 44(6):E7 29852770 10.3171/2018.3.FOCUS1859 45. Schaffer M Schaffer PM Jori G Corti L Sotti G Hofstetter A Dühmke E Radiation therapy combined with photofrin or 5-Ala: effect on lewis sarcoma tumor lines implanted in mice. Preliminary results Tumori 2002 88 5 407 410 10.1177/030089160208800511 12487560 Schaffer M, Schaffer PM, Jori G, Corti L, Sotti G, Hofstetter A, Dühmke E (2002) Radiation therapy combined with photofrin or 5‑Ala: effect on lewis sarcoma tumor lines implanted in mice. Preliminary results. Tumori 88(5):407–410 12487560 10.1177/030089160208800511 46. Tung FI Chen LC Wang YC Chen MH Shueng PW Liu TY Using a hybrid radioenhancer to discover tumor cell-targeted treatment for osteosarcoma: an in vitro study CMC 2021 28 19 3877 3889 10.2174/0929867327666201118155216 33213306 Tung FI, Chen LC, Wang YC, Chen MH, Shueng PW, Liu TY (2021) Using a hybrid radioenhancer to discover tumor cell-targeted treatment for osteosarcoma: an in vitro study. CMC 28(19):3877–3889 10.2174/0929867327666201118155216 33213306 47. Gerard JP Barbet N Schiappa R Magné N Martel I Mineur L Deberne M Zilli T Dhadda A Myint AS Neoadjuvant chemoradiotherapy with radiation dose escalation with contact x-ray brachytherapy boost or external beam radiotherapy boost for organ preservation in early cT2-cT3 rectal adenocarcinoma (OPERA): a phase 3, randomised controlled trial Lancet Gastroenterol Hepatol 2023 8 4 356 367 10.1016/S2468-1253(22)00392-2 36801007 Gerard JP, Barbet N, Schiappa R, Magné N, Martel I, Mineur L, Deberne M, Zilli T, Dhadda A, Myint AS (2023) Neoadjuvant chemoradiotherapy with radiation dose escalation with contact x‑ray brachytherapy boost or external beam radiotherapy boost for organ preservation in early cT2-cT3 rectal adenocarcinoma (OPERA): a phase 3, randomised controlled trial. Lancet Gastroenterol Hepatol 8(4):356–367 36801007 10.1016/S2468-1253(22)00392-2 48. Yamada K Murayama Y Kamada Y Arita T Kosuga T Konishi H Morimura R Shiozaki A Kuriu Y Ikoma H Kubota T Nakanishi M Fujiwara H Okamoto K Otsuji E Radiosensitizing effect of 5-aminolevulinic acid in colorectal cancer in-vitro and in-vivo Oncol Lett 2019 10.3892/ol.2019.10198 31186727 PMC6507316 Yamada K, Murayama Y, Kamada Y, Arita T, Kosuga T, Konishi H, Morimura R, Shiozaki A, Kuriu Y, Ikoma H, Kubota T, Nakanishi M, Fujiwara H, Okamoto K, Otsuji E (2019) Radiosensitizing effect of 5‑aminolevulinic acid in colorectal cancer in-vitro and in-vivo. Oncol Lett. 10.3892/ol.2019.10198 31186727 10.3892/ol.2019.10198 PMC6507316 49. Kamada Y Murayama Y Harada K Nishimura M Kondo Y Konishi H Morimura R Komatsu S Shiozaki A Kuriu Y Ikoma H Nakanishi M Ichikawa D Fujiwara H Okamoto K Sakakura C Otsuji E Radiosensitizing effect of 5-aminolevulinic acid (5-ALA ) in Colon cancer Gan to Kagaku Ryoho 2014 41 12 1608 1610 25731269 Kamada Y, Murayama Y, Harada K, Nishimura M, Kondo Y, Konishi H, Morimura R, Komatsu S, Shiozaki A, Kuriu Y, Ikoma H, Nakanishi M, Ichikawa D, Fujiwara H, Okamoto K, Sakakura C, Otsuji E (2014) Radiosensitizing effect of 5‑aminolevulinic acid (5-ALA ) in Colon cancer. Gan to Kagaku Ryoho 41(12):1608–1610 25731269 50. Spille DC Bunk EC Thomas C Özdemir Z Wagner A Akkurt BH Mannil M Paulus W Grauer OM Stummer W Senner V Brokinkel B Protoporphyrin IX (PpIX) fluorescence during meningioma surgery: correlations with histological findings and expression of heme pathway molecules Cancers 2023 15 1 304 10.3390/cancers15010304 36612300 PMC9818642 Spille DC, Bunk EC, Thomas C, Özdemir Z, Wagner A, Akkurt BH, Mannil M, Paulus W, Grauer OM, Stummer W, Senner V, Brokinkel B (2023) Protoporphyrin IX (PpIX) fluorescence during meningioma surgery: correlations with histological findings and expression of heme pathway molecules. Cancers 15(1):304 36612300 10.3390/cancers15010304 PMC9818642 51. Bunk EC Wagner A Stummer W Senner V Brokinkel B 5-ALA kinetics in meningiomas: analysis of tumor fluorescence and PpIX metabolism in vitro and comparative analyses with high-grade gliomas J Neurooncol 2021 152 1 37 46 10.1007/s11060-020-03680-9 33389565 Bunk EC, Wagner A, Stummer W, Senner V, Brokinkel B (2021) 5‑ALA kinetics in meningiomas: analysis of tumor fluorescence and PpIX metabolism in vitro and comparative analyses with high-grade gliomas. J Neurooncol 152(1):37–46 33389565 10.1007/s11060-020-03680-9 52. Stummer W Holling M Bendok BR Vogelbaum MA Cox A Renfrow SL Widhalm G Ezrin A DeSena S Sackman ML Wyse JW The NXDC-MEN-301 study on 5-ALA for meningiomas surgery: an innovative study design for the assessing the benefit of intra-operative fluorescence imaging Brain Sci 2022 12 8 1044 10.3390/brainsci12081044 36009108 PMC9405714 Stummer W, Holling M, Bendok BR, Vogelbaum MA, Cox A, Renfrow SL, Widhalm G, Ezrin A, DeSena S, Sackman ML, Wyse JW (2022) The NXDC-MEN-301 study on 5‑ALA for meningiomas surgery: an innovative study design for the assessing the benefit of intra-operative fluorescence imaging. Brain Sci 12(8):1044 36009108 10.3390/brainsci12081044 PMC9405714 53. Wang X Li N Meng J Wen N The use of topical ALA-photodynamic therapy combined with induction chemotherapy for locally advanced oral squamous cell carcinoma Am J Otolaryngol 2021 42 6 103112 10.1016/j.amjoto.2021.103112 34214712 Wang X, Li N, Meng J, Wen N (2021) The use of topical ALA-photodynamic therapy combined with induction chemotherapy for locally advanced oral squamous cell carcinoma. Am J Otolaryngol 42(6):103112 34214712 10.1016/j.amjoto.2021.103112 54. Ma Y Qu S Xu L Lu H Li B An in vitro study of the effect of 5-ALA-mediated photodynamic therapy on oral squamous cell carcinoma BMC Oral Health 2020 20 1 258 10.1186/s12903-020-01239-8 32938451 PMC7493380 Ma Y, Qu S, Xu L, Lu H, Li B (2020) An in vitro study of the effect of 5‑ALA-mediated photodynamic therapy on oral squamous cell carcinoma. BMC Oral Health 20(1):258 32938451 10.1186/s12903-020-01239-8 PMC7493380 55. Fan KFM Hopper C Speight PM Buonaccorsi G MacRobert AJ Bown SG Photodynamic therapy using 5-aminolevulinic acid for premalignant and malignant lesions of the oral cavity Cancer 1996 78 7 1374 1383 10.1002/(SICI)1097-0142(19961001)78:7&#x0003c;1374::AID-CNCR2&#x0003e;3.0.CO;2-L 8839541 Fan KFM, Hopper C, Speight PM, Buonaccorsi G, MacRobert AJ, Bown SG (1996) Photodynamic therapy using 5‑aminolevulinic acid for premalignant and malignant lesions of the oral cavity. Cancer 78(7):1374–1383 8839541 10.1002/(SICI)1097-0142(19961001)78:7<1374::AID-CNCR2>3.0.CO;2-L 56. Qin J Zhou C Zhu M Shi S Zhang L Zhao Y Li C Wang Y Wang Y Iron chelation promotes 5-aminolaevulinic acid-based photodynamic therapy against oral tongue squamous cell carcinoma Photodiagnosis Photodyn Ther 2020 31 101907 10.1016/j.pdpdt.2020.101907 32619712 Qin J, Zhou C, Zhu M, Shi S, Zhang L, Zhao Y, Li C, Wang Y, Wang Y (2020) Iron chelation promotes 5‑aminolaevulinic acid-based photodynamic therapy against oral tongue squamous cell carcinoma. Photodiagnosis Photodyn Ther 31:101907 32619712 10.1016/j.pdpdt.2020.101907 57. Pogue BW Sheng C Benevides J Forcione D Puricelli B Nishioka N Hasan T Protoporphyrin IX fluorescence photobleaching increases with the use of fractionated irradiation in the esophagus J Biomed Opt 2008 13 3 034009 10.1117/1.2937476 18601554 PMC3787899 Pogue BW, Sheng C, Benevides J, Forcione D, Puricelli B, Nishioka N, Hasan T (2008) Protoporphyrin IX fluorescence photobleaching increases with the use of fractionated irradiation in the esophagus. J Biomed Opt 13(3):34009 18601554 10.1117/1.2937476 PMC3787899 58. Fang HG Lu BM Wei ZY Xiang Q Yan LH Xiao C Effects of 5-aminolevulinic acid photodynamic therapy on cervical cancer: in vivo experiment with nude mice Zhonghua Yi Xue Za Zhi 2008 88 9 635 640 18646722 Fang HG, Lu BM, Wei ZY, Xiang Q, Yan LH, Xiao C (2008) Effects of 5‑aminolevulinic acid photodynamic therapy on cervical cancer: in vivo experiment with nude mice. Zhonghua Yi Xue Za Zhi 88(9):635–640 18646722 59. Qiu L Li J Chen F Wang Y Wang Y Wang X Lv Q Li C Li M Yang Q Wu D Zhang Y Zhang Y Zhang M Zhang Y Qie M Zhou H Zhou J Zhao W Xia B Liang X Cai Y Teng Y Huang Z Sui L Wei L Di W Chinese expert consensus on the clinical applications of aminolevulinic acid-based photodynamic therapy in female lower genital tract diseases Photodiagnosis Photodyn Ther 2022 39 102993 10.1016/j.pdpdt.2022.102993 35781093 Qiu L, Li J, Chen F, Wang Y, Wang Y, Wang X, Lv Q, Li C, Li M, Yang Q, Wu D, Zhang Y, Zhang Y, Zhang M, Zhang Y, Qie M, Zhou H, Zhou J, Zhao W, Xia B, Liang X, Cai Y, Teng Y, Huang Z, Sui L, Wei L, Di W (2022) Chinese expert consensus on the clinical applications of aminolevulinic acid-based photodynamic therapy in female lower genital tract diseases. Photodiagnosis Photodyn Ther 39:102993 35781093 10.1016/j.pdpdt.2022.102993 60. Wang L Liu X Zhang J Li H Wang X Fu Y Liu H Xu Y Meng L Cui B Zhang Y Jia L Comparison of ALA-PDT and CO2 laser treatment of low-grade vaginal intraepithelial neoplasia with high-risk HPV infection: a non-randomized controlled pilot study Photodiagnosis Photodyn Ther 2023 43 103695 10.1016/j.pdpdt.2023.103695 37422201 Wang L, Liu X, Zhang J, Li H, Wang X, Fu Y, Liu H, Xu Y, Meng L, Cui B, Zhang Y, Jia L (2023) Comparison of ALA-PDT and CO2 laser treatment of low-grade vaginal intraepithelial neoplasia with high-risk HPV infection: a non-randomized controlled pilot study. Photodiagnosis Photodyn Ther 43:103695 37422201 10.1016/j.pdpdt.2023.103695 61. Gui T Wang Y Mao Y Liu J Sun S Cao D Yang J Shen K Comparisons of 5-aminolevulinic acid photodynamic therapy and after-loading radiotherapy in vivo in cervical cancer Clin Transl Oncol 2013 15 6 434 442 10.1007/s12094-012-0945-5 23054758 Gui T, Wang Y, Mao Y, Liu J, Sun S, Cao D, Yang J, Shen K (2013) Comparisons of 5‑aminolevulinic acid photodynamic therapy and after-loading radiotherapy in vivo in cervical cancer. Clin Transl Oncol 15(6):434–442 23054758 10.1007/s12094-012-0945-5 62. Ozten O Eskiler GG Sonmez F Yıldız MZ Investigation of the therapeutic effect of 5-aminolevulinic acid based photodynamic therapy on hepatocellular carcinoma Lasers Med Sci 2022 37 2 1325 1332 10.1007/s10103-021-03398-8 34392466 Ozten O, Eskiler GG, Sonmez F, Yıldız MZ (2022) Investigation of the therapeutic effect of 5‑aminolevulinic acid based photodynamic therapy on hepatocellular carcinoma. Lasers Med Sci 37(2):1325–1332 34392466 10.1007/s10103-021-03398-8 63. Inoue K 5-Aminolevulinic acid-mediated photodynamic therapy for bladder cancer Int J Urol 2017 24 2 97 101 10.1111/iju.13291 28191719 Inoue K (2017) 5‑Aminolevulinic acid-mediated photodynamic therapy for bladder cancer. Int J Urol 24(2):97–101 28191719 10.1111/iju.13291 64. Sun L Shi J Su Z Zhang M Lu Y Successful treatment of Rosai-Dorfman disease using ALA-PDT Photodiagnosis Photodyn Ther 2018 21 128 129 10.1016/j.pdpdt.2017.11.014 29197644 Sun L, Shi J, Su Z, Zhang M, Lu Y (2018) Successful treatment of Rosai-Dorfman disease using ALA-PDT. Photodiagnosis Photodyn Ther 21:128–129 29197644 10.1016/j.pdpdt.2017.11.014 65. Zane C Venturini M Sala R Calzavara-Pinton P Photodynamic therapy with methylaminolevulinate as a valuable treatment option for unilesional cutaneous T-cell lymphoma Photoderm Photoimm Photomed 2006 22 5 254 258 10.1111/j.1600-0781.2006.00246.x 16948827 Zane C, Venturini M, Sala R, Calzavara-Pinton P (2006) Photodynamic therapy with methylaminolevulinate as a valuable treatment option for unilesional cutaneous T‑cell lymphoma. Photoderm Photoimm Photomed 22(5):254–258 10.1111/j.1600-0781.2006.00246.x 16948827 66. Bu W Fang F Zhang M Chen J Combination of 5-ALA photodynamic therapy, surgery and superficial X-ray for the treatment of keloid Photoderm Photoimm Photomed 2020 36 1 65 67 10.1111/phpp.12506 31424139 Bu W, Fang F, Zhang M, Chen J (2020) Combination of 5‑ALA photodynamic therapy, surgery and superficial X‑ray for the treatment of keloid. Photoderm Photoimm Photomed 36(1):65–67 10.1111/phpp.12506 31424139 67. Nakano A Watanabe D Akita Y Kawamura T Tamada Y Matsumoto Y Treatment efficiency of combining photodynamic therapy and ionizing radiation for Bowen’s disease Acad Dermatol Venereol 2011 25 4 475 478 10.1111/j.1468-3083.2010.03757.x 20569287 Nakano A, Watanabe D, Akita Y, Kawamura T, Tamada Y, Matsumoto Y (2011) Treatment efficiency of combining photodynamic therapy and ionizing radiation for Bowen’s disease. Acad Dermatol Venereol 25(4):475–478 10.1111/j.1468-3083.2010.03757.x 20569287 68. Calin MA Diaconeasa A Savastru D Tautan M Photosensitizers and light sources for photodynamic therapy of the Bowen’s disease Arch Dermatol Res 2011 303 3 145 151 10.1007/s00403-011-1122-3 21286736 Calin MA, Diaconeasa A, Savastru D, Tautan M (2011) Photosensitizers and light sources for photodynamic therapy of the Bowen’s disease. Arch Dermatol Res 303(3):145–151 21286736 10.1007/s00403-011-1122-3 69. Ebrahimi S Khaleghi Ghadiri M Stummer W Gorji A Enhancing 5-ALA-PDT efficacy against resistant tumor cells: strategies and advances Life Sci 2024 351 122808 10.1016/j.lfs.2024.122808 38852796 Ebrahimi S, Khaleghi Ghadiri M, Stummer W, Gorji A (2024) Enhancing 5‑ALA-PDT efficacy against resistant tumor cells: strategies and advances. Life Sci 351:122808 38852796 10.1016/j.lfs.2024.122808 70. Takahashi J Nagasawa S Doi M Takahashi M Narita Y Yamamoto J Ikemoto MJ Iwahashi H In vivo study of the efficacy and safety of 5-Aminolevulinic radiodynamic therapy for glioblastoma fractionated radiotherapy Int J Mol Sci 2021 22 18 9762 10.3390/ijms22189762 34575921 PMC8470662 Takahashi J, Nagasawa S, Doi M, Takahashi M, Narita Y, Yamamoto J, Ikemoto MJ, Iwahashi H (2021) In vivo study of the efficacy and safety of 5‑Aminolevulinic radiodynamic therapy for glioblastoma fractionated radiotherapy. Int J Mol Sci 22(18):9762 34575921 10.3390/ijms22189762 PMC8470662 71. Owari T Tanaka N Nakai Y Miyake M Anai S Kishi S Mori S Fujiwara-Tani R Hojo Y Mori T Kuwada M Fujii T Hasegawa M Fujimoto K Kuniyasu H 5-Aminolevulinic acid overcomes hypoxia-induced radiation resistance by enhancing mitochondrial reactive oxygen species production in prostate cancer cells Br J Cancer 2022 127 2 350 363 10.1038/s41416-022-01789-4 35365766 PMC9296661 Owari T, Tanaka N, Nakai Y, Miyake M, Anai S, Kishi S, Mori S, Fujiwara-Tani R, Hojo Y, Mori T, Kuwada M, Fujii T, Hasegawa M, Fujimoto K, Kuniyasu H (2022) 5‑Aminolevulinic acid overcomes hypoxia-induced radiation resistance by enhancing mitochondrial reactive oxygen species production in prostate cancer cells. Br J Cancer 127(2):350–363 35365766 10.1038/s41416-022-01789-4 PMC9296661 72. Suero Molina E Kaneko S Sporns PB Schipmann-Miletic S Black D Stummer W Fluorescence real-time kinetics of protoporphyrin IX after 5-ALA administration and factors predicting fluorescence in low-grade glioma 2020 10.3171/2020.10.JNS202881 34144512 Suero Molina E, Kaneko S, Sporns PB, Schipmann-Miletic S, Black D, Stummer W (2020) Fluorescence real-time kinetics of protoporphyrin IX after 5‑ALA administration and factors predicting fluorescence in low-grade glioma (71 Jahrestagung der Deutschen Gesellschaft für Neurochirurgie (DGNC)) 73. Chiang CS Shih IJ Shueng PW Kao M Zhang LW Chen SF Chen MH Liu TY Tumor cell-targeting radiotherapy in the treatment of glioblastoma multiforme using linear accelerators Acta Biomater 2021 125 300 311 10.1016/j.actbio.2021.02.019 33609743 Chiang CS, Shih IJ, Shueng PW, Kao M, Zhang LW, Chen SF, Chen MH, Liu TY (2021) Tumor cell-targeting radiotherapy in the treatment of glioblastoma multiforme using linear accelerators. Acta Biomater 125:300–311 33609743 10.1016/j.actbio.2021.02.019 74. Gordon JA Pasli M Cook CM Connor R Boyer PJ Ju AW Lee KS Knudson KE Peach MS Novel combination of GammaTile cesium-131 brachytherapy with 5-aminolevulinic acid fluorescence-guided resection in the re-irradiation of pediatric recurrent high-grade glioma: illustrative case J Neurosurg Case Lessons 2023 6 16 CASE23346 10.3171/CASE23346 37870768 PMC10584082 Gordon JA, Pasli M, Cook CM, Connor R, Boyer PJ, Ju AW, Lee KS, Knudson KE, Peach MS (2023) Novel combination of GammaTile cesium-131 brachytherapy with 5‑aminolevulinic acid fluorescence-guided resection in the re-irradiation of pediatric recurrent high-grade glioma: illustrative case. J Neurosurg Case Lessons 6(16):CASE23346 37870768 10.3171/CASE23346 PMC10584082 75. Mandl GA Vettier F Tessitore G Maurizio SL Bietar K Stochaj U Capobianco JA Combining Pr 3+ ACS Appl Bio Mater 2023 6 6 2370 2383 10.1021/acsabm.3c00201 37267436 Mandl GA, Vettier F, Tessitore G, Maurizio SL, Bietar K, Stochaj U, Capobianco JA (2023) Combining Pr 3+ 37267436 10.1021/acsabm.3c00201 ",
  "metadata": {
    "Title of this paper": "Combining Pr",
    "Journal it was published in:": "Strahlentherapie Und Onkologie",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488766/"
  }
}