{
  "title": "Paper_15",
  "abstract": "pmc J Surg Case Rep J Surg Case Rep 2009 jscr jscr Journal of Surgical Case Reports 2042-8812 Oxford University Press PMC12490716 PMC12490716.1 12490716 12490716 10.1093/jscr/rjaf788 rjaf788 1 Case Report AcademicSubjects/MED00910 jscrep/040 Prophylactic intestinal resection following carbon-ion radiotherapy for locally recurrent rectal cancer: a case report Furuyama Takaki  Department of Surgery, Tokyo Kyosai Hospital 2-3-8 Nakameguro, Meguro-ku, Tokyo 153-8934 Japan Takiyama Hirotoshi  Department of Radiation Oncology, QST Hospital, National Institute for Quantum Science and Technology 4-9-1 Anagawa, Inage-ku, Chiba 263-8555 Japan Kondo Ito  Department of Surgery, Tokyo Kyosai Hospital 2-3-8 Nakameguro, Meguro-ku, Tokyo 153-8934 Japan Enjyoji Megumu  Department of Surgery, JA Toride Medical Center 2-1-1 Hongo, Toride-city, Ibaraki 302-0022 Japan Hinokida Makoto  Department of Surgery, Tokyo Kyosai Hospital 2-3-8 Nakameguro, Meguro-ku, Tokyo 153-8934 Japan Tatsutomi Yusuke  Department of Surgery, Tokyo Kyosai Hospital 2-3-8 Nakameguro, Meguro-ku, Tokyo 153-8934 Japan Nakazawa Kunihiko  Department of Surgery, Tokyo Kyosai Hospital 2-3-8 Nakameguro, Meguro-ku, Tokyo 153-8934 Japan Yamada Shigeru  Department of Radiation Oncology, QST Hospital, National Institute for Quantum Science and Technology 4-9-1 Anagawa, Inage-ku, Chiba 263-8555 Japan Ushirokoji Yoshio  Department of Surgery, Tokyo Kyosai Hospital 2-3-8 Nakameguro, Meguro-ku, Tokyo 153-8934 Japan Corresponding author. Department of Surgery, Tokyo Kyosai Hospital, 2-3-8 Nakameguro, Meguro-ku, Tokyo 153-8934, Japan. E-mail: furuyama.tmd@gmail.com 10 2025 02 10 2025 2025 10 498081 rjaf788 23 7 2025 15 9 2025 02 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025. Published by Oxford University Press and JSCR Publishing Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract Treatment of locally recurrent rectal cancer (LRRC) after surgery is often complex and challenging. A 52-year-old man received emergency surgery (Hartmann’s procedure) for bowel perforation caused by a huge sigmoid colon cancer, followed by treatment for concurrent advanced lower rectal cancer with neoadjuvant chemoradiotherapy and abdominoperineal resection. A solitary lung metastasis emerged afterwards, and was surgically removed. However, the patient developed LRRC in front of the sacrum. As surgical resection for the local recurrence was considered too invasive, carbon-ion radiotherapy (CIRT) was performed as radical local therapy. Because the surrounding intestine was highly adherent to the tumor and there was a high risk of developing an ulcer, the intestine was prophylactically resected. The patient has remained relapse-free for 2 years and 6 months since the most recent surgery. CIRT for LRRC appears to represent a useful therapeutic option in combination with prophylactic intestinal resection. locally recurrent rectal cancer carbon-ion radiotherapy prophylactic resection pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Locally recurrent rectal cancer (LRRC) severely affects both prognosis and quality of life. Although surgical resection is the only curative treatment for LRRC, curative surgery for LRRC is highly invasive. Favorable clinical outcomes for LRRC have recently been reported with carbon-ion radiotherapy (CIRT), even in previously irradiated patients. However, CIRT for LRRC is inapplicable when the recurrent tumor is attached to radiosensitive organs such as the bowel and bladder. We report a case of LRRC successfully treated with CIRT followed by prophylactic resection of the irradiated small intestine. Case report A 52-year-old man underwent emergency Hartmann’s procedure for peritonitis caused by perforated sigmoid colon cancer. The tumor was staged as pT4b N0 M0 with no lymphovascular invasion. Postoperative examination revealed synchronous advanced lower rectal cancer. Systemic chemotherapy with mFOLFOX6 plus bevacizumab was administered, followed by neoadjuvant chemoradiotherapy and abdominoperineal resection. Pathological examination confirmed pT3 N0 M0 disease, with no lymphovascular invasion. A total of 2 years and 4 months after the initial surgery, a solitary lung metastasis appeared and was surgically resected. Three years after the initial surgery, imaging revealed LRRC on the anterior surface of the sacrum ( Fig. 1 Fig. 2 Fig. 3A B Fig. 3C Fig. 3D Fig. 4 Fig. 5 Figure 1 Imaging findings at the time of local recurrence diagnosis. (A) Contrast-enhanced CT. (B) Positron emission tomography-CT. Arrows indicate the recurrent lesion. Figure 2 Dose distribution for carbon ion radiotherapy. The irradiation field includes the recurrent lesion, the anterior surface of the sacrum, and the adjacent small intestine. Figure 3 Intraoperative findings. (A) The small intestine is adherent to the locally recurrent lesion at the pelvic floor. (B) The adhesion is successfully separated without injury of the small intestine. (C) The serosal surface of the dissected small intestine shows no gross abnormalities. (D) ICG fluorescence imaging also reveals no evidence of decreased blood flow in the small intestine. Figure 4 Macroscopic findings. (A) Ulcer formation on the mucosal surface caused by CIRT (arrows, ulcers; arrow head, adhesion site with the recurrent lesion). (B) Illustration of the macroscopic image. Figure 5 Hematoxylin and eosin staining. (A) Low-power view (magnification, ×40). Arrows indicate the ulcer base. (B) High-power view (magnification, ×200). Discussion Despite curative-intent surgery, 5%–10% of rectal cancer patients develop LRRC [ 1 2 3 4–6 4 7 4 5 7–9 5 6 8 In recent years, CIRT has emerged as a treatment option for LRRC. CIRT shows two unique characteristics. First, a high dose of energy is delivered with precise localization to the targeted area. Carbon-ion beams provide a unique depth dose distribution profile characterized by the Bragg peak. Most of the energy is deposited at the specific planned depth (called the spread-out Bragg peak; SOBP) in a body so that the dose delivered before and further than the depth of the target is relatively low. The second characteristic is the strong cell-killing activity against cancers. Conventional X-ray therapy primarily causes indirect DNA damage, typically resulting in single-strand breaks. In contrast, CIRT acts directly on DNA, causing double-strand breaks more frequently, that are significantly more difficult to repair than single-strand breaks, resulting in high biological effect. In a phase II trial of 156 LRRC patients, CIRT achieved 5-year local control and OS rates of 88% and 59%, respectively [ 10 11 12 Gastrointestinal ulceration and perforation are among the most serious late toxicities of CIRT. When the radiation dose to the adjacent intestinal tract exceeds 60 Gy, perforation has been reported to occur with a frequency of 19% after 9 months or more post-irradiation [ 13 14 15 In this case, toxicity to the small intestine adjacent to the local recurrence would be inevitable with CIRT. Although placement of a spacer was also considered, concerns regarding the dissemination of cancer cells, intra-abdominal adhesions from multiple previous surgeries, the risk of spacer infection due to bowel perforation, and the lack of tissues such as peritoneum or omentum to cover the placed spacer made this option unfavorable. Consequently, the strategy was chosen to perform CIRT followed by prophylactic resection of the adjacent small intestine. Considering that problematic ulcers and perforations often occur 9–12 months after CIRT, the prophylactic resection surgery was carried out 3 months after CIRT. During surgery the serosal surface of the irradiated small intestine appeared normal, and blood flow was confirmed to be good using ICG fluorescence imaging. However, examination of the resected specimen revealed ulceration already present on the mucosal surface, suggesting that delayed perforation would have eventually occurred. The prophylactic resection in this case enabled timely and definitive administration of CIRT and may serve as a potential treatment option, particularly for cases of LRRC that are considered unsuitable for CIRT due to difficulties in spacer placement. Conclusions CIRT combined with prophylactic intestinal resection can represent a viable therapeutic option for LRRC. Prophylactic resection of the irradiated bowel may expand the indications for CIRT in the treatment of LRRC. Acknowledgements We would like to thank Forte ( www.forte-science.co.jp Conflict of interest statement None declared. Funding None declared. References 1. Palmer G Martling A Cedermark B et al. A population-based study on the management and outcome in patients with locally recurrent rectal cancer Ann Surg Oncol 2006 14 447 54 10.1245/s10434-006-9256-9 17139457 2. Bakx R Visser O Josso J et al. Management of recurrent rectal cancer: a population based study in greater Amsterdam World J Gastroenterol 2008 14 6018 23 10.3748/wjg.14.6018 18932280 PMC2760194 3. Matsuyama T Yamauchi S Masuda T et al. Treatment and subsequent prognosis in locally recurrent rectal cancer: a multicenter retrospective study of 498 patients Int J Colorectal Dis 2021 36 1243 50 10.1007/s00384-021-03856-3 33515308 4. Harris CA Solomon MJ Heriot AG et al. The outcomes and patterns of treatment failure after surgery for locally recurrent rectal cancer Ann Surg 2016 264 323 9 10.1097/SLA.0000000000001524 26692078 5. Hagemans JAW van Rees JM Alberda WJ et al. Locally recurrent rectal cancer; long-term outcome of curative surgical and non-surgical treatment of 447 consecutive patients in a tertiary referral Centre Eur J Surg Oncol 2020 46 448 54 10.1016/j.ejso.2019.10.037 31761506 6. You YN Skibber JM Hu CY et al. Improved long-term salvage potential of locally recurrent rectal cancer with evolving multimodality therapy Br J Surg 2016 103 753 62 10.1002/bjs.10079 26933792 PMC5407413 7. Westberg K Palmer G Hjern F et al. Management and prognosis of locally recurrent rectal cancer - a national population-based study Eur J Surg Oncol 2018 44 100 7 10.1016/j.ejso.2017.11.013 29224985 8. Nielsen M Rasmussen P Pedersen B et al. Early and late outcomes of surgery for locally recurrent rectal cancer: a prospective 10-year study in the total mesorectal excision era Ann Surg Oncol 2015 22 2677 84 10.1245/s10434-014-4317-y 25564165 9. Kanemitsu Y Hirai T Komori K et al. Prediction of residual disease or distant metastasis after resection of locally recurrent rectal cancer Dis Colon Rectum 2010 53 779 89 10.1007/DCR.0b013e3181cf7609 20389212 10. Yamada S Kamada T Ebner DK et al. Carbon-ion radiation therapy for pelvic recurrence of rectal cancer Int J Radiat Oncol Biol Phys 2016 96 93 101 10.1016/j.ijrobp.2016.04.022 27375166 11. Shinoto M Yamada S Okamoto M et al. Carbon-ion radiotherapy for locally recurrent rectal cancer: Japan carbon-ion radiation oncology study group (J-CROS) study 1404 rectum Radiother Oncol 2019 132 236 40 10.1016/j.radonc.2018.10.007 30360998 12. Yamada S Takiyama H Isozaki Y et al. Carbon ion radiotherapy for locally recurrent rectal cancer of patients with prior pelvic irradiation Ann Surg Oncol 2022 29 99 106 10.1245/s10434-021-10876-4 34664141 PMC8677685 13. Matsushita K Ochiai T Shimada H et al. The effects of carbon ion irradiation revealed by excised perforated intestines as a late morbidity for uterine cancer treatment Surg Today 2006 36 692 700 10.1007/s00595-006-3231-8 16865512 14. Kato S Ohno T Tsujii H et al. Dose escalation study of carbon ion radiotherapy for locally advanced carcinoma of the uterine cervix Int J Radiat Oncol Biol Phys 2006 65 388 97 10.1016/j.ijrobp.2005.12.050 16626894 15. Shiba S Okamoto M Sakai M et al. Visualizing bioabsorbable spacer effectiveness by confirming the distal-tail of carbon-ion beams: first-in-human report Tomography 2022 8 2339 46 10.3390/tomography8050195 36287794 PMC9610790 ",
  "metadata": {
    "Title of this paper": "Visualizing bioabsorbable spacer effectiveness by confirming the distal-tail of carbon-ion beams: first-in-human report",
    "Journal it was published in:": "Journal of Surgical Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490716/"
  }
}