{
  "title": "Paper_985",
  "abstract": "pmc World J Hepatol 1321 worldjhepatol WJH World Journal of Hepatology 1948-5182 Baishideng Publishing Group Inc PMC12476723 PMC12476723.1 12476723 12476723 41024874 10.4254/wjh.v17.i9.108259 jWJH.v17.i9.eid108259 1 Review Extracellular vesicles in metabolic dysfunction-associated steatotic liver disease: From intercellular signaling to clinical translation Boonkaew B et al. Boonkaew Bootsakorn Department of Biochemistry, Faculty of Medicine, Chulalongkorn University, Bangkok 10330, Thailand Center of Excellence in Hepatitis and Liver Cancer, Faculty of Medicine, Chulalongkorn University, Bangkok 10330, Thailand Charoenthanakitkul Denita Department of Biochemistry, Faculty of Medicine, Chulalongkorn University, Bangkok 10330, Thailand Center of Excellence in Hepatitis and Liver Cancer, Faculty of Medicine, Chulalongkorn University, Bangkok 10330, Thailand Suntornnont Nuchanart Department of Biochemistry, Faculty of Medicine, Chulalongkorn University, Bangkok 10330, Thailand Center of Excellence in Hepatitis and Liver Cancer, Faculty of Medicine, Chulalongkorn University, Bangkok 10330, Thailand Ariyachet Chaiyaboot Department of Biochemistry, Faculty of Medicine, Chulalongkorn University, Bangkok 10330, Thailand Center of Excellence in Hepatitis and Liver Cancer, Faculty of Medicine, Chulalongkorn University, Bangkok 10330, Thailand. chaiyaboot.a@chula.ac.th Tangkijvanich Pisit Department of Biochemistry, Faculty of Medicine, Chulalongkorn University, Bangkok 10330, Thailand Center of Excellence in Hepatitis and Liver Cancer, Faculty of Medicine, Chulalongkorn University, Bangkok 10330, Thailand Author contributions: Boonkaew B and Ariyachet C conceptualized the study and reviewed and edited the various versions of the paper; Boonkaew B, Charoenthanakitkul D, and Ariyachet C wrote the original draft of the paper; Suntornnont N generated the data visualization images; Tangkijvanich P supervised the project; and all authors have read and approved the final manuscript. Corresponding author: Chaiyaboot Ariyachet, Assistant Professor, Department of Biochemistry, Faculty of Medicine, Chulalongkorn University, 1873 Paettayaphat Bldg, Rama IV Road, Bangkok 10330, Thailand. chaiyaboot.a@chula.ac.th 27 9 2025 27 9 2025 17 9 497735 108259 9 4 2025 18 5 2025 13 8 2025 27 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ Metabolic dysfunction-associated steatotic liver disease (MASLD) poses a substantial global health burden, progressing from simple steatosis to metabolic dysfunction-associated steatohepatitis and cirrhosis. A deeper understanding of the underlying mechanisms and associated complications is crucial for developing effective therapies. Extracellular vesicles (EVs), nanoscale membrane-enclosed particles carrying bioactive cargoes such as proteins and noncoding RNAs, including microRNAs and long noncoding RNAs, play crucial roles in intercellular communication and have emerged as critical mediators of MASLD pathogenesis. This article details the current understanding of the function of EVs in MASLD progression, emphasizing specific cell-derived EVs implicated in disease development. We elucidate how EVs facilitate intercellular communication and influence key pathological processes, including lipotoxicity, inflammation, and fibrosis. Furthermore, we examine the involvement of EVs in MASLD-associated complications and evaluate their potential as minimally invasive tools for disease diagnosis, staging, and prognosis. We also explore EV-based therapeutic strategies, encompassing preclinical studies, while acknowledging current challenges and future opportunities. Finally, we discuss emerging research trends, the potential for personalized medicine, and areas necessitating further investigation, particularly the utilization of EVs as therapeutic targets or delivery vehicles. This review underscores the pivotal role of EVs in MASLD, providing insights into their translational potential for improved patient outcomes. Metabolic dysfunction-associated steatotic liver disease Metabolic dysfunction-associated steatohepatitis Extracellular vesicles Fibrosis Lipotoxicity pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION The prevalence of metabolic dysfunction-associated steatotic liver disease (MASLD), the updated nomenclature for steatotic liver disease associated with metabolic syndrome, has rapidly increased, becoming a leading global health challenge. It affects approximately 30% of the worldwide population and represents the most prevalent form of chronic liver disease[ 1 4 5 6 7 8 9 10 11 MASLD encompasses a spectrum of chronic liver disorders, beginning with simple hepatic steatosis, characterized by excessive triglyceride accumulation in hepatocytes[ 12 13 14 15 16 Central to the pathogenesis of MASLD is the complex interplay of intercellular communication, where extracellular vesicles (EVs) are increasingly recognized as pivotal mediators. EVs are lipid bilayer-enclosed, nonreplicative particles released by all cells into the extracellular space and circulation. EVs are classified on the basis of size: Large EVs (100-1000 nm, primarily < 400 nm) are associated with microvesicle markers, whereas small EVs (40-200 nm) are characterized by exosome markers. The two major classes of EVs - exosomes and microvesicles - differ in their biogenesis and functional roles. Microvesicles range from 70 nm to nearly 1 μm in size and bud directly from the plasma membrane, whereas exosomes originate within the endosomal system before secretion and typically range from 50 nm to 150 nm in size[ 17 18 19 20 22 23 24 This review aims to provide a comprehensive overview of the role of EVs in MASLD, bridging the gap between basic mechanistic insights and potential clinical applications. Specifically, we explore the fundamental biology of EVs, delineate their involvement in MASLD pathogenesis, and critically assess their potential as diagnostic biomarkers, therapeutic delivery vehicles, and targets for therapeutic intervention. We also address the inherent challenges associated with EV research and clinical translation, providing a holistic perspective on the current state of knowledge in this rapidly evolving field. EV AND MASLD PATHOGENESIS Mechanisms of EV release and uptake in the liver  Biogenesis and secretion by liver cells: 25 26 27 28 29 30 31 32 33 34 The release of EVs is an energy-dependent process that is intricately regulated by cellular stress, nutrient availability, and signaling pathways, thereby modulating EV secretion across diverse cell types[ 35 in vivo in vitro 36  Mechanisms of EV uptake by recipient cells: 37 38 39 40 42 43 44 46 47 51 38 In the liver, these cells are internalized by various cell types, contributing to critical physiological processes such as macrophage modulation and HSC activation (Figure 1 52 53 54 55 56 57 58 Figure 1  Extracellular vesicle-mediated cellular interactions in metabolic dysfunction-associated steatotic liver disease pathogenesis. EV-mediated intercellular communication in MASLD EVs play a crucial role in intercellular communication by transferring bioactive cargo from donor cells to recipient cells, thereby influencing various pathological processes in MASLD. Previous studies have demonstrated that elevated levels of circulating EVs in both patients and animal models correlate with liver injury, inflammation, and fibrosis, highlighting their importance in disease progression. EVs released from hepatocytes, immune cells, and HSCs carry diverse molecular cargo, including proteins, lipids, and nucleic acids, which alter the phenotype and function of recipient cells[ 59 62 63 1 1 Table 1 Extracellular vesicle cargo and functional effects in metabolic dysfunction-associated steatotic liver disease progression  Donor cells/ EV sources  Recipient cells  EV cargoes  EV effects  Ref. Hepatocyte-derived EVs to other cells Lipotoxic hepatocytes, primary mouse hepatocytes and Huh7 cells treated with PA or LPC Macrophages, BMDMs CXCL10 Recruits macrophages and exacerbates inflammation [ 65 67 Lipotoxic hepatocytes, mouse hepatocyte cell lines, primary mouse hepatocytes, and Huh7 cells treated with PA or OA Macrophages, BMDMs Ceramide, S1P Activates IRE1α, recruits macrophages, and amplifies liver inflammation [ 36 68 Lipotoxic hepatocytes, primary mouse hepatocytes and Huh7 cells treated with LPC Macrophages, BMDMs TRAIL Activates macrophages via [ 64 Primary mouse hepatocytes Macrophages, RAW264.7 cells mtDNA Activates macrophages, increasing inflammatory signaling [ 24 Lipotoxic hepatocytes, LO2 cells treated with PA, Huh7 cells treated with ox-LDL and MβCD cholesterol Macrophages, THP-1 cell diferentiation miR-122-5p, miR-192-5p, miR-9-5p Polarizes macrophages to M1, enhances inflammatory responses [ 70 71 72 Hypoxia in fat-laden liver cells, primary mouse hepatocytes and HepG2 treated with PA + OA HFD-mouse Kupffer cells mtDNA Activates TLR9, inducing TNFα and IL-1β secretion [ 73 Primary rat hepatocytes Primary rat Kupffer cells N/A Stimulates inflammation in Kupffer cells [ 74 Lipotoxic hepatocytes, LO2 cells treated with PA Primary human Kupffer cells RBP4 Promotes M1 polarization, increases ROS and TNF-α production [ 75 Lipotoxic hepatocytes, HepG2 treated with PA + OA, chemical hypoxia induction hepatocytes, treated with CoCl 2 HSCs, LX-2 cells Hypoxia-induced cargo Promotes pro-fibrotic gene expression and fibrosis [ 66 76 Lipotoxic hepatocytes, primary mouse hepatocytes and HepG2 cells treated with PA HSCs, LX-2 cells, primary mouse HSCs miR-128-3p Suppresses PPAR-γ, enhances pro-fibrogenic gene expression, proliferation, and chemotactic responses [ 66 Lipotoxic hepatocytes, primary hepatocytes, LO2 cells treated with PA HSCs, LX-2 cells miR-1297 Targets PTEN, leading to HSC activation and proliferation via [ 77 Lipotoxic hepatocytes, primary hepatocytes treated with PA HSCs, LX-2 cells miR-107 Activates Wnt signaling, promoting HSC activation [ 78 Lipotoxic hepatocytes, primary rat hepatocytes treated with PA + OA HSCs, primary rat HSCs Various mRNAs and miRNAs Induces pro-fibrotic and pro-senescent phenotype, reduce fibrosis, increase ROS and senescence markers, mediated via [ 79 Lipotoxic hepatocytes, primary rat hepatocytes, HepG2 cells treated with PA Endothelial cells, primary rat endothelial cells, HUVECs VNN1 Promotes angiogenesis and endothelial migration [ 61 Lipotoxic hepatocytes, primary mouse hepatocytes, Huh7 cells treated with PA Endothelial cells, primary rat endothelial cells, HUVECs miR-1 Promotes endothelial inflammation and atherogenesis [ 80 Lipotoxic hepatocytes, primary mouse hepatocytes, Huh7 cells treated with LPC Endothelial cells, primary mouse LSECs ITGβ1 Induces monocyte adhesion to LSECs, facilitating inflammation and fibrosis [ 81 Primary mouse hepatocytes Adipocytes, 3T3-L1 cell differentiation let-7e-5p Promotes adipogenesis and lipid accumulation [ 82 Immune cell-derived EVs to other cells Neutrophills isolated from CCL4- and MCD-treated mice Macrophages, mouse primary hepatic macrophages miR-223 Promotes restorative macrophage phenotype, reduces HSC activation and fibrosis [ 84 Neutrophills isolated from HFD-treated mice Lipotoxic hepatocytes, AML12 cells treated with PA miR-223 Inhibits hepatic inflammatory and fibrogenic gene expression in LDLR/ApoE dependent manner [ 55 Macrophages and neutrophils isolated from IL-6 knockout HFD-treated mice Hepatocytes, primary mouse hepatocytes miR-223 Suppresses fibrotic gene and immflmatory gene expression, reducing liver fibrosis [ 87 Macrophages, human PBMC dirferentiation Lipotoxic hepatocytes, Huh7 treated with PA miR-223 Reduces inflammatory and fibrotic responses within the liver by suppressing FOXO3 and TAZ through LDLR/ApoE axis [ 56 Macrophages, RAW264.7 cells HSCs, primary mouse HSCs isolated from CCL4-induced mice miR-500 Activates TGF-β/Smad pathway, accelerating fibrosis [ 88 Kupffer cells isolated from MASH mice Hepatocytes, HSCs isolated from MASH mice miR-690 Regulates inflammation, fibrogenesis, and lipogenesis [ 89 Other cell-derived EVs Visceral adipose tissue isolated from obese and lean patients HSCs N/A Alters liver matrix regulation by increasing TIMP, Smad-3, integrin, and MMP-9 expression in HSCs [ 90 HSCs, primary human HSCs, LX-2 cells HSCs, primary human HSCs, LX-2 cells PDGFRα, SHP2 Promotes HSC migration and fibrosis progression by suppressing REDD1 and enhancing mTOR [ 91 92 BMSCs HSCs miR-192-5p Inhibits HSC activation by targeting PPP2R3A [ 93 ADMSCs isolated from CCl4-induced mice HSCs miR-150-5p Suppresses CXCL1, reducing fibrosis [ 94 MSCs isolated from the human umbilical cords HSCs, LX-2 cells miR-4465 Reduces fibrosis by altering LOXL2 expression [ 95 Gut-derived EVs, HFD-fed mice Hepatocytes, HSCs, HFD-fed mice, Mki67 mice HMGB1 Activates cGAS/STING pathway, driving inflammation and fibrosis [ 96 97 EV: Extracellular vesicle; MASLD: Metabolic dysfunction-associated steatotic liver disease; MASH: Metabolic dysfunction-associated steatohepatitis; PA: Palmitic acid; LPC: Lysophosphatidylcholine; BMDMs: Bone marrow-derived macrophages; CXCL: C-X-C motif chemokine ligand; OA: Oleic acid; S1P: Sphingosine-1-phosphate; IRE1α: Inositol-requiring enzyme 1 alpha; TRAIL: Tumor necrosis factor-related apoptosis-inducing ligand; RIP1-DR5: Receptor-interacting serine/threonine-protein kinase 1-death receptor 5; mtDNA: Mitochondrial DNA; ox-LDL: Oxidized low-density lipoprotein; MβCD: Methyl-β-cyclodextrin; HFD: High-fat diet; TLR9: Toll-like receptor 9; TNFα: Tumor necrosis factor alpha; IL-1β: Interleukin-1 beta; LO2: Human normal liver cell line LO2; RBP4: Retinol-binding protein 4; ROS: Reactive oxygen species; HSCs: Hepatic stellate cells; PPAR-γ: Peroxisome proliferator-activated receptor gamma; PTEN: Phosphatase and tensin homolog; PI3K: Phosphoinositide 3-kinase; AKT: Protein kinase B; AKT-mTOR: Protein kinase B-mammalian target of rapamycin; VNN1: Vanin 1; HUVECs: Human umbilical vein endothelial cells; ITGβ1: Integrin subunit beta 1; LSECs: Liver sinusoidal endothelial cells; CCL4: Carbon tetrachloride; MCD: Methionine-choline deficient; LDLR: Low-density lipoprotein receptor; ApoE: Apolipoprotein E; TGF-β: Transforming growth factor beta; Smad: Small mothers against decapentaplegic; TIMP: Tissue inhibitor of metalloproteinases; MMP-9: Matrix metalloproteinase 9; PDGFRα: Platelet-derived growth factor receptor alpha; SHP2: Src homology region 2 domain-containing phosphatase-2; REDD1: Regulated in development and DNA damage responses 1; mTOR: Mammalian target of rapamycin; BMSCs: Bone marrow mesenchymal stem cells; PPP2R3A: Protein phosphatase 2 regulatory subunit B alpha; ADMSCs: Adipose-derived mesenchymal stem cells; CXCL1: C-X-C motif chemokine ligand 1; MSCs: Mesenchymal stem cells; HMGB1: High mobility group box 1; cGAS/STING: Cyclic guanosine monophosphate–adenosine monophosphate synthase/stimulator of interferon genes; N/A: Not applicable; FOXO3: Forkhead box O3; TAZ: Transcriptional coactivator with PDZ-binding motif.  Hepatocyte-derived EVs: via 64 65 66 65 67 36 via 68 via 24 69 In addition to direct inflammatory signaling, lipotoxic hepatocytes release EVs carrying specific miRNAs, which influence the phenotype of recipient cells. For example, cholesterol-exposed hepatocytes release EVs containing miR-122-5p, which polarizes macrophages into the proinflammatory M1 subtype[ 70 71 72 EVs facilitate communication between lipotoxic hepatocytes and Kupffer cells, the resident macrophages of the liver, perpetuating liver inflammation. Hepatocyte-derived EVs containing mtDNA act as danger signals, activating Toll-like receptor 9 on Kupffer cells and triggering the release of TNFα and IL-1β, thereby driving liver damage[ 73 74 75 In addition to Kupffer cells, EVs from lipotoxic hepatocytes also target HSCs, which are key players in liver fibrosis. FA-treated hepatocytes exposed to chemical hypoxia with cobalt chloride (referred to as CoCl 2 In vivo 76 66 via 77 + + 78 79 The communication mediated by EVs from lipotoxic hepatocytes extends beyond HSCs, encompassing other cell types involved in MASLD pathogenesis, including endothelial cells and adipocytes. Lipotoxic hepatocyte stress leads to the release of EVs that, when internalized by endothelial cells via 61 80 81 via 82  Immune cell-derived EVs: 83 84 via 55 via 85 86 via 87 via 56 Further investigations revealed the contributions of other miRNAs to MASLD pathogenesis. In both in vitro in vivo 88 in vivo 89  Other cell-derived EVs: 90 91 2 92 93 94 95 Notably, the dysbiotic gut environment significantly influences hepatic pathology through the release of EVs. Specifically, elevated levels of high mobility group box 1 protein are incorporated into EVs within the intestine and released into the circulation. These high mobility group box 1-enriched EVs travel to the liver, where they induce hepatic steatosis[ 96 via 97 Collectively, EVs emerge as pivotal mediators in MASLD pathogenesis, facilitating intercellular communication among lipotoxic hepatocytes, macrophages, Kupffer cells, HSCs, endothelial cells, and adipocytes. These EVs carry a complex cargo of miRNAs, lipids, and proteins that orchestrate inflammatory and fibrotic responses. While lipotoxic hepatocyte-derived EVs contribute to MASLD/MASH progression, immune cell-derived EVs exert protective effects by transferring regulatory molecules to hepatocytes, ameliorating disease progression. Further exploration of EV biogenesis, cargo selection, and uptake mechanisms would provide critical insights into MASLD pathogenesis and uncover novel therapeutic targets. EVS IN MASLD-ASSOCIATED COMPLICATIONS EVs and hepatic fibrosis/cirrhosis MASLD progresses through different stages after liver steatosis by fibrosis development and eventually results in cirrhosis[ 98 99 100 74 101 61 102 74 101 103 104 90 EVs and HCC MASLD has manifestations that can lead to disease progression and result in HCC[ 105 106 107 108 109 110 59 EVs and cardiovascular complications Following MASLD, patients are at high risk of developing CVDs, which stem from cardiometabolic imbalances and may result in death[ 111 112 113 80 114 115 116 In addition to the molecular mechanisms involving circulating factors such as EVs and miRNAs, these vesicles also play a significant role in mediating histological and tissue-level changes that contribute to CV complications in MASLD. Indeed, EVs released in the context of MASLD are pivotal in driving these complications by inducing significant alterations, particularly in the heart and blood vessels. These EVs contribute to endothelial dysfunction by impairing nitric oxide production and increasing oxidative stress, affecting the proper dilation and constriction of blood vessels[ 113 117 118 119 120 121 122 EVs and other extrahepatic complications The influence of EVs in MASLD extends beyond the CV system, impacting a range of extrahepatic organs, including the pancreas, colon, and nervous system[ 123 124 125 126 127 128 129 EVS AS BIOMARKERS FOR MASLD EV-based liquid biopsies The limitations of existing noninvasive diagnostics for MASLD and MASH, which rely on imaging-based methods and multiple algorithm tests, have been recognized. While techniques such as magnetic resonance elastography and transient elastography (TE) offer high diagnostic accuracy, magnetic resonance elastography is costly, and TE lacks specificity for MASH-associated fibrosis[ 130 131 132 133 134 EVs serve as promising biomarkers for MASLD by carrying lipids, proteins, miRNAs, and lncRNAs, reflecting pathological alterations in liver metabolism and inflammation[ 135 136 137 Lipid-based EV diagnosis EV-associated lipids have been particularly investigated as biomarkers, given the close link between MASLD and lipid metabolism. A study demonstrated an increase in C16: 0 ceramide-containing EVs in both murine models and human subjects with MASH[ 36 138 + 139 Protein-based EV biomarkers Proteomic analysis of EV proteins reveals their potential as biomarkers in MASLD. Liquid chromatography-mass spectrometry/mass spectrometry analysis of EVs from human serum samples revealed various liver diseases, identifying alpha-2-macroglobulin for alcoholic hepatitis and apolipoprotein C3 for MASLD as significantly upregulated proteins[ 140 62 62 141 142 miRNA-based EV biomarkers MiRNAs carried by EVs have been extensively investigated for their potential as MASLD biomarkers. The diagnostic performance of EV-derived miRNAs in MASLD has been previously reviewed[ 143 144 145 145 + 146 107 71 59 However, a crucial point to consider is that miRNAs, while promising for both diagnosis and treatment, encounter obstacles because of their relatively low specificity. This lack of precise targeting can impede their successful translation into routine clinical practice. The challenge lies in the fact that a single miRNA can interact with multiple mRNAs, making it difficult to pinpoint and modulate a specific biological pathway with the accuracy needed for effective diagnosis and targeted therapies[ 147 148 147 lncRNA-based EV biomarkers lncRNAs, a diverse class of noncoding RNAs ranging from over 200 base pairs to 100 kilobases, play crucial roles in regulating gene expression, notably by acting as miRNA sponges to control mRNA levels. Previous research has demonstrated a strong association between lncRNAs and various pathophysiological conditions, including liver diseases and MASLD. RNA sequencing of samples from patients with liver fibrosis and MASLD has revealed distinct lncRNA expression profiles[ 149 151 152 153 154 via 155 156 157 158 159 In summary, EVs hold considerable promise as biomarkers in MASLD, which makes them attractive candidates for noninvasive liquid biopsies, potentially offering earlier and more accurate diagnoses than traditional methods do. However, despite this potential, the translation of EV-based biomarkers into routine clinical practice faces significant limitations. One major hurdle is the variability in EV isolation and analysis methods, leading to low sensitivity and specificity in diagnostic tests. The absence of standardized protocols for EV isolation, characterization, and cargo analysis has contributed to inconsistent results across studies[ 160 161 162 163 EV-BASED THERAPEUTIC STRATEGIES FOR MASLD While significant progress has been made in MASLD drug therapies, with novel agents such as thyroid hormone receptor beta, farnesoid X receptor, PPAR, sodium-glucose cotransporter-2, and glucagon-like peptide-1 receptor agonists demonstrating efficacy in clinical trials, challenges remain[ 164 165 166 167 In response to these limitations, EVs have emerged as a highly promising avenue for targeted MASLD treatment. These naturally occurring, membrane-bound nanoparticles offer a unique advantage by shielding their molecular cargo from degradation within biological environments. As inherent carriers, EVs can effectively transport therapeutic payloads directly to the site of action, encompassing a diverse range of molecules, such as proteins, lipids, miRNAs, and nucleic acids[ 168 169 168 169 168 170 Given the inherent potential of EVs as therapeutic tools, distinguishing between their two primary modes of application is crucial: As delivery vehicles and as therapeutic agents[ 171 44 172 172 168 Preclinical studies: Harnessing EVs for targeted MASLD therapy A crucial advantage of using EVs as therapeutic delivery vehicles lies in their inherent ability to protect their cargo from degradation within the complex biological milieu[ 173 174 Furthermore, the EV membrane is not merely a passive barrier. A variety of surface proteins that contribute to vesicle stability and functionality have been studied[ 175 176 EVs delivering miRNAs to target fibrosis in MASLD HSCs are central to the progression of liver fibrosis, a critical aspect of MASLD. EVs offer a promising avenue for delivering therapeutic miRNAs that can modulate HSC activity and reduce collagen production. In a dietary-induced mouse model of MASH characterized by steatosis, inflammation, and fibrosis, EVs isolated from human HepG2 hepatocytes displayed notable therapeutic efficacy[ 177 In addition to the role of hepatocyte-derived EVs in MASLD, recent studies have investigated the direct impact of EVs released from steatotic hepatocytes on HSC behavior. Specifically, research employing primary rat hepatocytes, where steatosis was induced via 79 In addition to the direct impact of hepatocyte-derived EVs, the role of LSECs in modulating MASLD-related fibrosis is emerging. LSECs, which are critical for maintaining hepatic microcirculation and nutrient exchange, exert paracrine effects through the release of EVs[ 178 EV delivery of anti-inflammatory effects in MASLD Building upon the exploration of EV-based therapies in MASLD, a significant area of interest lies in their capacity to modulate macrophage polarization, a key factor in disease progression. Given the limited availability of effective treatments for MASH, the therapeutic potential of human umbilical cord MSC derived EVs (huc-MSC-EVs) has been investigated[ 179 Continuing the exploration of the use of MSC-EVs in MASLD treatment is crucial to address the complex role of macrophage polarization. While the preceding study highlighted the beneficial shift toward M2 macrophage polarization in mitigating MASH, concerns exist regarding the potential profibrotic nature of M2 macrophages, which could theoretically exacerbate liver fibrosis. However, evidence suggests that MSC-EVs can alleviate HFD-induced MASH despite this concern[ 180 in vitro + While previous research has highlighted the potential of MSC-EVs in modulating macrophage polarization to alleviate inflammation in MASLD, alternative strategies leveraging the targeted delivery of anti-inflammatory agents via via 181 in vitro in vivo EV delivery of therapeutics to target lipid metabolism in MASLD In addition to the immunomodulatory effects of EVs, particularly in terms of macrophage polarization, another promising avenue for MASLD therapy involves directly targeting lipid metabolism. Given the central role of lipid accumulation in the pathogenesis of MASLD, the potential of MSC-EVs to modulate this process has been explored. A recent study investigated whether MSC-EVs could inhibit hepatocyte lipid accumulation by regulating mitochondrial fission, a process implicated in steatosis[ 182 in vitro To further explore the therapeutic potential of MSC-EVs for MASLD, researchers have investigated their role in regulating lipid homeostasis. A recent study elucidated the mechanisms by which MSC-EVs influence lipid accumulation[ 183 via In addition to the inherent therapeutic capabilities of MSC-EVs, recent investigations have explored strategies to further augment their efficacy in treating MASLD. One such approach involves preconditioning MSCs with curcumin (Cur), a natural compound known for its anti-inflammatory and immunomodulatory properties[ 184 In vitro Research on the therapeutic potential of stem cell-derived EVs in mitigating MASLD has also explored the effects of EVs from stem cells of the apical papilla (SCAPs). In one study utilizing an HFD-induced MASH mouse model and oleic acid/PA-treated HCC cells in vitro 185 186 The promising therapeutic potential of EVs in addressing various facets of MASLD is evident, particularly their ability to target fibrosis, modulate macrophage polarization, and regulate lipid metabolism. Compared with traditional drug delivery methods, EVs offer distinct advantages, including enhanced biocompatibility, improved bioavailability, and reduced off-target effects. However, challenges such as reduced bioavailability following systemic delivery and the need for repeated fresh EV isolation hinder their clinical translation. To overcome these limitations, innovative strategies, such as the development of “off-the-shelf” three-dimensional bioprinted hyaluronic acid-based hepatic patches, are being explored[ 187 CHALLENGES AND FUTURE DIRECTIONS Current challenges in EV research  Standardization of EV isolation and characterization methods: 188 189 Similarly, characterizing isolated EVs faces challenges, as the reliability of results is affected by difficulties in isolating EVs from complex biofluids and accurately determining their contents. Techniques such as flow cytometry, resistive pulse sensing, dynamic light scattering, enzyme-linked immunosorbent assay, and nanoparticle tracking analysis are frequently employed for characterization[ 190 191 190 192  Understanding the complexity of EV cargo and function: 7  Challenges and issues in vivo In vivo 193 194 TM 195 in vivo 196 ex vivo in vivo 197 198 199  Addressing translational challenges in clinical applications: in vitro 196 Macaca nemestrina 200  Single-EV analysis and advanced imaging techniques: 201 202  Integration of multi-omics data for comprehensive EV profiling: 203 204 Potential for personalized medicine The application of EVs derived from induced pluripotent stem cells (iPSCs) represents a significant advancement in personalized medicine. Given the inherent capacity of iPSCs to be generated from an individual’s somatic cells, they offer a platform for autologous therapies, thereby mitigating immunogenic complications[ 205 206 207 209 210 CONCLUSION EVs have emerged as critical mediators of intercellular communication, influencing key processes in MASLD, such as lipotoxicity, inflammation, and fibrogenesis. Their utility as diagnostic and prognostic biomarkers offer a pathway toward minimally invasive and targeted patient care. However, the translation of these promising findings into clinical practice necessitates addressing significant challenges. These include standardizing EV isolation and characterization, unraveling the intricate complexity of EV cargo, and developing robust in vivo ACKNOWLEDGEMENTS We would like to thank all the members of the Center of Excellence in Hepatitis and Liver Cancer, Faculty of Medicine, Chulalongkorn University, for their technical support.  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Younossi Z Anstee QM Marietti M Hardy T Henry L Eslam M George J Bugianesi E Global burden of NAFLD and NASH: trends, predictions, risk factors and prevention Nat Rev Gastroenterol Hepatol 2018 15 11 20 28930295 10.1038/nrgastro.2017.109 2 Chan WK Chuah KH Rajaram RB Lim LL Ratnasingam J Vethakkan SR Metabolic Dysfunction-Associated Steatotic Liver Disease (MASLD): A State-of-the-Art Review J Obes Metab Syndr 2023 32 197 213 37700494 10.7570/jomes23052 PMC10583766 3 Eslam M Newsome PN Sarin SK Anstee QM Targher G Romero-Gomez M Zelber-Sagi S Wai-Sun Wong V Dufour JF Schattenberg JM Kawaguchi T Arrese M Valenti L Shiha G Tiribelli C Yki-Järvinen H Fan JG Grønbæk H Yilmaz Y Cortez-Pinto H Oliveira CP Bedossa P Adams LA Zheng MH Fouad Y Chan WK Mendez-Sanchez N Ahn SH Castera L Bugianesi E Ratziu V George J A new definition for metabolic dysfunction-associated fatty liver disease: An international expert consensus statement J Hepatol 2020 73 202 209 32278004 10.1016/j.jhep.2020.03.039 4 Paik JM Henry L Younossi Y Ong J Alqahtani S Younossi ZM The burden of nonalcoholic fatty liver disease (NAFLD) is rapidly growing in every region of the world from 1990 to 2019 Hepatol Commun 2023 7 e0251 37782469 10.1097/HC9.0000000000000251 PMC10545420 5 Karlsen TH Sheron N Zelber-Sagi S Carrieri P Dusheiko G Bugianesi E Pryke R Hutchinson SJ Sangro B Martin NK Cecchini M Dirac MA Belloni A Serra-Burriel M Ponsioen CY Sheena B Lerouge A Devaux M Scott N Hellard M Verkade HJ Sturm E Marchesini G Yki-Järvinen H Byrne CD Targher G Tur-Sinai A Barrett D Ninburg M Reic T Taylor A Rhodes T Treloar C Petersen C Schramm C Flisiak R Simonova MY Pares A Johnson P Cucchetti A Graupera I Lionis C Pose E Fabrellas N Ma AT Mendive JM Mazzaferro V Rutter H Cortez-Pinto H Kelly D Burton R Lazarus JV Ginès P Buti M Newsome PN Burra P Manns MP The EASL-Lancet Liver Commission: protecting the next generation of Europeans against liver disease complications and premature mortality Lancet 2022 399 61 116 34863359 10.1016/S0140-6736(21)01701-3 6 Wong VW Ekstedt M Wong GL Hagström H Changing epidemiology, global trends and implications for outcomes of NAFLD J Hepatol 2023 79 842 852 37169151 10.1016/j.jhep.2023.04.036 7 Riazi K Azhari H Charette JH Underwood FE King JA Afshar EE Swain MG Congly SE Kaplan GG Shaheen AA The prevalence and incidence of NAFLD worldwide: a systematic review and meta-analysis Lancet Gastroenterol Hepatol 2022 7 851 861 35798021 10.1016/S2468-1253(22)00165-0 8 Dulai PS Singh S Patel J Soni M Prokop LJ Younossi Z Sebastiani G Ekstedt M Hagstrom H Nasr P Stal P Wong VW Kechagias S Hultcrantz R Loomba R Increased risk of mortality by fibrosis stage in nonalcoholic fatty liver disease: Systematic review and meta-analysis Hepatology 2017 65 1557 1565 28130788 10.1002/hep.29085 PMC5397356 9 Singh S Allen AM Wang Z Prokop LJ Murad MH Loomba R Fibrosis progression in nonalcoholic fatty liver vs nonalcoholic steatohepatitis: a systematic review and meta-analysis of paired-biopsy studies Clin Gastroenterol Hepatol 2015 13 643 54.e1 24768810 10.1016/j.cgh.2014.04.014 PMC4208976 10 Benedé-Ubieto R Cubero FJ Nevzorova YA Breaking the barriers: the role of gut homeostasis in Metabolic-Associated Steatotic Liver Disease (MASLD) Gut Microbes 2024 16 2331460 38512763 10.1080/19490976.2024.2331460 PMC10962615 11 Targher G Byrne CD Tilg H MASLD: a systemic metabolic disorder with cardiovascular and malignant complications Gut 2024 73 691 702 38228377 10.1136/gutjnl-2023-330595 12 Chalasani N Younossi Z Lavine JE Diehl AM Brunt EM Cusi K Charlton M Sanyal AJ The diagnosis and management of non-alcoholic fatty liver disease: practice Guideline by the American Association for the Study of Liver Diseases, American College of Gastroenterology, and the American Gastroenterological Association Hepatology 2012 55 2005 2023 22488764 10.1002/hep.25762 13 Burt AD Lackner C Tiniakos DG Diagnosis and Assessment of NAFLD: Definitions and Histopathological Classification Semin Liver Dis 2015 35 207 220 26378639 10.1055/s-0035-1562942 14 White DL Kanwal F El-Serag HB Association between nonalcoholic fatty liver disease and risk for hepatocellular cancer, based on systematic review Clin Gastroenterol Hepatol 2012 10 1342 1359.e2 23041539 10.1016/j.cgh.2012.10.001 PMC3501546 15 Cotter TG Rinella M Nonalcoholic Fatty Liver Disease 2020: The State of the Disease Gastroenterology 2020 158 1851 1864 32061595 10.1053/j.gastro.2020.01.052 16 Le MH Yeo YH Li X Li J Zou B Wu Y Ye Q Huang DQ Zhao C Zhang J Liu C Chang N Xing F Yan S Wan ZH Tang NSY Mayumi M Liu X Liu C Rui F Yang H Yang Y Jin R Le RHX Xu Y Le DM Barnett S Stave CD Cheung R Zhu Q Nguyen MH 2019 Global NAFLD Prevalence: A Systematic Review and Meta-analysis Clin Gastroenterol Hepatol 2022 20 2809 2817.e28 34890795 10.1016/j.cgh.2021.12.002 17 Cocucci E Meldolesi J Ectosomes and exosomes: shedding the confusion between extracellular vesicles Trends Cell Biol 2015 25 364 372 25683921 10.1016/j.tcb.2015.01.004 18 Meldolesi J Exosomes and Ectosomes in Intercellular Communication Curr Biol 2018 28 R435 R444 29689228 10.1016/j.cub.2018.01.059 19 Saha B Momen-Heravi F Kodys K Szabo G MicroRNA Cargo of Extracellular Vesicles from Alcohol-exposed Monocytes Signals Naive Monocytes to Differentiate into M2 Macrophages J Biol Chem 2016 291 149 159 26527689 10.1074/jbc.M115.694133 PMC4697152 20 Théry C Witwer KW Aikawa E Alcaraz MJ Anderson JD Andriantsitohaina R Antoniou A Arab T Archer F Atkin-Smith GK Ayre DC Bach JM Bachurski D Baharvand H Balaj L Baldacchino S Bauer NN Baxter AA Bebawy M Beckham C Bedina Zavec A Benmoussa A Berardi AC Bergese P Bielska E Blenkiron C Bobis-Wozowicz S Boilard E Boireau W Bongiovanni A Borràs FE Bosch S Boulanger CM Breakefield X Breglio AM Brennan MÁ Brigstock DR Brisson A Broekman ML Bromberg JF Bryl-Górecka P Buch S Buck AH Burger D Busatto S Buschmann D Bussolati B Buzás EI Byrd JB Camussi G Carter DR Caruso S Chamley LW Chang YT Chen C Chen S Cheng L Chin AR Clayton A Clerici SP Cocks A Cocucci E Coffey RJ Cordeiro-da-Silva A Couch Y Coumans FA Coyle B Crescitelli R Criado MF D'Souza-Schorey C Das S Datta Chaudhuri A de Candia P De Santana EF De Wever O Del Portillo HA Demaret T Deville S Devitt A Dhondt B Di Vizio D Dieterich LC Dolo V Dominguez Rubio AP Dominici M Dourado MR Driedonks TA Duarte FV Duncan HM Eichenberger RM Ekström K El Andaloussi S Elie-Caille C Erdbrügger U Falcón-Pérez JM Fatima F Fish JE Flores-Bellver M Försönits A Frelet-Barrand A Fricke F Fuhrmann G Gabrielsson S Gámez-Valero A Gardiner C Gärtner K Gaudin R Gho YS Giebel B Gilbert C Gimona M Giusti I Goberdhan DC Görgens A Gorski SM Greening DW Gross JC Gualerzi A Gupta GN Gustafson D Handberg A Haraszti RA Harrison P Hegyesi H Hendrix A Hill AF Hochberg FH Hoffmann KF Holder B Holthofer H Hosseinkhani B Hu G Huang Y Huber V Hunt S Ibrahim AG Ikezu T Inal JM Isin M Ivanova A Jackson HK Jacobsen S Jay SM Jayachandran M Jenster G Jiang L Johnson SM Jones JC Jong A Jovanovic-Talisman T Jung S Kalluri R Kano SI Kaur S Kawamura Y Keller ET Khamari D Khomyakova E Khvorova A Kierulf P Kim KP Kislinger T Klingeborn M Klinke DJ 2nd Kornek M Kosanović MM Kovács ÁF Krämer-Albers EM Krasemann S Krause M Kurochkin IV Kusuma GD Kuypers S Laitinen S Langevin SM Languino LR Lannigan J Lässer C Laurent LC Lavieu G Lázaro-Ibáñez E Le Lay S Lee MS Lee YXF Lemos DS Lenassi M Leszczynska A Li IT Liao K Libregts SF Ligeti E Lim R Lim SK Linē A Linnemannstöns K Llorente A Lombard CA Lorenowicz MJ Lörincz ÁM Lötvall J Lovett J Lowry MC Loyer X Lu Q Lukomska B Lunavat TR Maas SL Malhi H Marcilla A Mariani J Mariscal J Martens-Uzunova ES Martin-Jaular L Martinez MC Martins VR Mathieu M Mathivanan S Maugeri M McGinnis LK McVey MJ Meckes DG Jr Meehan KL Mertens I Minciacchi VR Möller A Møller Jørgensen M Morales-Kastresana A Morhayim J Mullier F Muraca M Musante L Mussack V Muth DC Myburgh KH Najrana T Nawaz M Nazarenko I Nejsum P Neri C Neri T Nieuwland R Nimrichter L Nolan JP Nolte-'t Hoen EN Noren Hooten N O'Driscoll L O'Grady T O'Loghlen A Ochiya T Olivier M Ortiz A Ortiz LA Osteikoetxea X Østergaard O Ostrowski M Park J Pegtel DM Peinado H Perut F Pfaffl MW Phinney DG Pieters BC Pink RC Pisetsky DS Pogge von Strandmann E Polakovicova I Poon IK Powell BH Prada I Pulliam L Quesenberry P Radeghieri A Raffai RL Raimondo S Rak J Ramirez MI Raposo G Rayyan MS Regev-Rudzki N Ricklefs FL Robbins PD Roberts DD Rodrigues SC Rohde E Rome S Rouschop KM Rughetti A Russell AE Saá P Sahoo S Salas-Huenuleo E Sánchez C Saugstad JA Saul MJ Schiffelers RM Schneider R Schøyen TH Scott A Shahaj E Sharma S Shatnyeva O Shekari F Shelke GV Shetty AK Shiba K Siljander PR Silva AM Skowronek A Snyder OL 2nd Soares RP Sódar BW Soekmadji C Sotillo J Stahl PD Stoorvogel W Stott SL Strasser EF Swift S Tahara H Tewari M Timms K Tiwari S Tixeira R Tkach M Toh WS Tomasini R Torrecilhas AC Tosar JP Toxavidis V Urbanelli L Vader P van Balkom BW van der Grein SG Van Deun J van Herwijnen MJ Van Keuren-Jensen K van Niel G van Royen ME van Wijnen AJ Vasconcelos MH Vechetti IJ Jr Veit TD Vella LJ Velot É Verweij FJ Vestad B Viñas JL Visnovitz T Vukman KV Wahlgren J Watson DC Wauben MH Weaver A Webber JP Weber V Wehman AM Weiss DJ Welsh JA Wendt S Wheelock AM Wiener Z Witte L Wolfram J Xagorari A Xander P Xu J Yan X Yáñez-Mó M Yin H Yuana Y Zappulli V Zarubova J Žėkas V Zhang JY Zhao Z Zheng L Zheutlin AR Zickler AM Zimmermann P Zivkovic AM Zocco D Zuba-Surma EK Minimal information for studies of extracellular vesicles 2018 (MISEV2018): a position statement of the International Society for Extracellular Vesicles and update of the MISEV2014 guidelines J Extracell Vesicles 2018 7 1535750 30637094 10.1080/20013078.2018.1535750 PMC6322352 21 Kato S Kowashi Y Demuth DR Outer membrane-like vesicles secreted by Actinobacillus actinomycetemcomitans are enriched in leukotoxin Microb Pathog 2002 32 1 13 11782116 10.1006/mpat.2001.0474 22 Yáñez-Mó M Siljander PR Andreu Z Zavec AB Borràs FE Buzas EI Buzas K Casal E Cappello F Carvalho J Colás E Cordeiro-da Silva A Fais S Falcon-Perez JM Ghobrial IM Giebel B Gimona M Graner M Gursel I Gursel M Heegaard NH Hendrix A Kierulf P Kokubun K Kosanovic M Kralj-Iglic V Krämer-Albers EM Laitinen S Lässer C Lener T Ligeti E Linē A Lipps G Llorente A Lötvall J Manček-Keber M Marcilla A Mittelbrunn M Nazarenko I Nolte-'t Hoen EN Nyman TA O'Driscoll L Olivan M Oliveira C Pállinger É Del Portillo HA Reventós J Rigau M Rohde E Sammar M Sánchez-Madrid F Santarém N Schallmoser K Ostenfeld MS Stoorvogel W Stukelj R Van der Grein SG Vasconcelos MH Wauben MH De Wever O Biological properties of extracellular vesicles and their physiological functions J Extracell Vesicles 2015 4 27066 25979354 10.3402/jev.v4.27066 PMC4433489 23 Malhi H Emerging role of extracellular vesicles in liver diseases Am J Physiol Gastrointest Liver Physiol 2019 317 G739 G749 31545919 10.1152/ajpgi.00183.2019 PMC6879890 24 Hirsova P Ibrahim SH Krishnan A Verma VK Bronk SF Werneburg NW Charlton MR Shah VH Malhi H Gores GJ Lipid-Induced Signaling Causes Release of Inflammatory Extracellular Vesicles From Hepatocytes Gastroenterology 2016 150 956 967 26764184 10.1053/j.gastro.2015.12.037 PMC4808464 25 Record M Silvente-Poirot S Poirot M Wakelam MJO Extracellular vesicles: lipids as key components of their biogenesis and functions J Lipid Res 2018 59 1316 1324 29764923 10.1194/jlr.E086173 PMC6071772 26 Raposo G Stoorvogel W Extracellular vesicles: exosomes, microvesicles, and friends J Cell Biol 2013 200 373 383 23420871 10.1083/jcb.201211138 PMC3575529 27 Traub LM The reverse logic of multivesicular endosomes EMBO Rep 2010 11 79 81 20062001 10.1038/embor.2009.281 PMC2828756 28 Raiborg C Stenmark H The ESCRT machinery in endosomal sorting of ubiquitylated membrane proteins Nature 2009 458 445 452 19325624 10.1038/nature07961 29 Wollert T Hurley JH Molecular mechanism of multivesicular body biogenesis by ESCRT complexes Nature 2010 464 864 869 20305637 10.1038/nature08849 PMC2851844 30 Stuffers S Sem Wegner C Stenmark H Brech A Multivesicular endosome biogenesis in the absence of ESCRTs Traffic 2009 10 925 937 19490536 10.1111/j.1600-0854.2009.00920.x 31 Kobayashi T Beuchat MH Chevallier J Makino A Mayran N Escola JM Lebrand C Cosson P Kobayashi T Gruenberg J Separation and characterization of late endosomal membrane domains J Biol Chem 2002 277 32157 32164 12065580 10.1074/jbc.M202838200 32 Kajimoto T Okada T Miya S Zhang L Nakamura S Ongoing activation of sphingosine 1-phosphate receptors mediates maturation of exosomal multivesicular endosomes Nat Commun 2013 4 2712 24231649 10.1038/ncomms3712 33 Stenmark H Rab GTPases as coordinators of vesicle traffic Nat Rev Mol Cell Biol 2009 10 513 525 19603039 10.1038/nrm2728 34 Haraszti RA Didiot MC Sapp E Leszyk J Shaffer SA Rockwell HE Gao F Narain NR DiFiglia M Kiebish MA Aronin N Khvorova A High-resolution proteomic and lipidomic analysis of exosomes and microvesicles from different cell sources J Extracell Vesicles 2016 5 32570 27863537 10.3402/jev.v5.32570 PMC5116062 35 Jackson CE Scruggs BS Schaffer JE Hanson PI Effects of Inhibiting VPS4 Support a General Role for ESCRTs in Extracellular Vesicle Biogenesis Biophys J 2017 113 1342 1352 28629620 10.1016/j.bpj.2017.05.032 PMC5607042 36 Kakazu E Mauer AS Yin M Malhi H Hepatocytes release ceramide-enriched pro-inflammatory extracellular vesicles in an IRE1α-dependent manner J Lipid Res 2016 57 233 245 26621917 10.1194/jlr.M063412 PMC4727419 37 Gurung S Perocheau D Touramanidou L Baruteau J The exosome journey: from biogenesis to uptake and intracellular signalling Cell Commun Signal 2021 19 47 33892745 10.1186/s12964-021-00730-1 PMC8063428 38 Mulcahy LA Pink RC Carter DR Routes and mechanisms of extracellular vesicle uptake J Extracell Vesicles 2014 3 10.3402/jev.v3.24641 PMC4122821 25143819 39 Joshi BS de Beer MA Giepmans BNG Zuhorn IS Endocytosis of Extracellular Vesicles and Release of Their Cargo from Endosomes ACS Nano 2020 14 4444 4455 32282185 10.1021/acsnano.9b10033 PMC7199215 40 Wadia JS Schaller M Williamson RA Dowdy SF Pathologic prion protein infects cells by lipid-raft dependent macropinocytosis PLoS One 2008 3 e3314 19390657 10.1371/journal.pone.0003314 PMC2671965 41 Costa Verdera H Gitz-Francois JJ Schiffelers RM Vader P Cellular uptake of extracellular vesicles is mediated by clathrin-independent endocytosis and macropinocytosis J Control Release 2017 266 100 108 28919558 10.1016/j.jconrel.2017.09.019 42 Feng D Zhao WL Ye YY Bai XC Liu RQ Chang LF Zhou Q Sui SF Cellular internalization of exosomes occurs through phagocytosis Traffic 2010 11 675 687 20136776 10.1111/j.1600-0854.2010.01041.x 43 Svensson KJ Christianson HC Wittrup A Bourseau-Guilmain E Lindqvist E Svensson LM Mörgelin M Belting M Exosome uptake depends on ERK1/2-heat shock protein 27 signaling and lipid Raft-mediated endocytosis negatively regulated by caveolin-1 J Biol Chem 2013 288 17713 17724 23653359 10.1074/jbc.M112.445403 PMC3682571 44 Murphy DE de Jong OG Brouwer M Wood MJ Lavieu G Schiffelers RM Vader P Extracellular vesicle-based therapeutics: natural versus engineered targeting and trafficking Exp Mol Med 2019 51 1 12 10.1038/s12276-019-0223-5 PMC6418170 30872574 45 Nanbo A Kawanishi E Yoshida R Yoshiyama H Exosomes derived from Epstein-Barr virus-infected cells are internalized via caveola-dependent endocytosis and promote phenotypic modulation in target cells J Virol 2013 87 10334 10347 23864627 10.1128/JVI.01310-13 PMC3753980 46 Wei F Ma C Zhou T Dong X Luo Q Geng L Ding L Zhang Y Zhang L Li N Li Y Liu Y Exosomes derived from gemcitabine-resistant cells transfer malignant phenotypic traits via delivery of miRNA-222-3p Mol Cancer 2017 16 132 28743280 10.1186/s12943-017-0694-8 PMC5526308 47 Andreu Z Yáñez-Mó M Tetraspanins in extracellular vesicle formation and function Front Immunol 2014 5 442 25278937 10.3389/fimmu.2014.00442 PMC4165315 48 Williams C Pazos R Royo F González E Roura-Ferrer M Martinez A Gamiz J Reichardt NC Falcón-Pérez JM Assessing the role of surface glycans of extracellular vesicles on cellular uptake Sci Rep 2019 9 11920 31417177 10.1038/s41598-019-48499-1 PMC6695415 49 Altei WF Pachane BC Dos Santos PK Ribeiro LNM Sung BH Weaver AM Selistre-de-Araújo HS Inhibition of αvβ3 integrin impairs adhesion and uptake of tumor-derived small extracellular vesicles Cell Commun Signal 2020 18 158 32988382 10.1186/s12964-020-00630-w PMC7520983 50 Hoshino A Costa-Silva B Shen TL Rodrigues G Hashimoto A Tesic Mark M Molina H Kohsaka S Di Giannatale A Ceder S Singh S Williams C Soplop N Uryu K Pharmer L King T Bojmar L Davies AE Ararso Y Zhang T Zhang H Hernandez J Weiss JM Dumont-Cole VD Kramer K Wexler LH Narendran A Schwartz GK Healey JH Sandstrom P Labori KJ Kure EH Grandgenett PM Hollingsworth MA de Sousa M Kaur S Jain M Mallya K Batra SK Jarnagin WR Brady MS Fodstad O Muller V Pantel K Minn AJ Bissell MJ Garcia BA Kang Y Rajasekhar VK Ghajar CM Matei I Peinado H Bromberg J Lyden D Tumour exosome integrins determine organotropic metastasis Nature 2015 527 329 335 26524530 10.1038/nature15756 PMC4788391 51 Nishida-Aoki N Tominaga N Kosaka N Ochiya T Altered biodistribution of deglycosylated extracellular vesicles through enhanced cellular uptake J Extracell Vesicles 2020 9 1713527 32082512 10.1080/20013078.2020.1713527 PMC7006786 52 Imai T Takahashi Y Nishikawa M Kato K Morishita M Yamashita T Matsumoto A Charoenviriyakul C Takakura Y Macrophage-dependent clearance of systemically administered B16BL6-derived exosomes from the blood circulation in mice J Extracell Vesicles 2015 4 26238 25669322 10.3402/jev.v4.26238 PMC4323410 53 Bala S Csak T Momen-Heravi F Lippai D Kodys K Catalano D Satishchandran A Ambros V Szabo G Biodistribution and function of extracellular miRNA-155 in mice Sci Rep 2015 5 10721 26024046 10.1038/srep10721 PMC4448655 54 Nojima H Freeman CM Schuster RM Japtok L Kleuser B Edwards MJ Gulbins E Lentsch AB Hepatocyte exosomes mediate liver repair and regeneration via sphingosine-1-phosphate J Hepatol 2016 64 60 68 26254847 10.1016/j.jhep.2015.07.030 PMC4843792 55 He Y Rodrigues RM Wang X Seo W Ma J Hwang S Fu Y Trojnár E Mátyás C Zhao S Ren R Feng D Pacher P Kunos G Gao B Neutrophil-to-hepatocyte communication via LDLR-dependent miR-223-enriched extracellular vesicle transfer ameliorates nonalcoholic steatohepatitis J Clin Invest 2021 131 e141513 33301423 10.1172/JCI141513 PMC7843220 56 Boonkaew B Satthawiwat N Pachane BC Brett LM Tangkijvanich P Ariyachet C Palmitic acid reduces LDLR-dependent uptake of macrophage-derived extracellular vesicles by hepatoma cells Noncoding RNA Res 2025 13 71 83 40476020 10.1016/j.ncrna.2025.04.007 PMC12139455 57 Nozue T Lipid Lowering Therapy and Circulating PCSK9 Concentration J Atheroscler Thromb 2017 24 895 907 28804094 10.5551/jat.RV17012 PMC5587514 58 Choi YJ Lee SJ Kim HI Lee HJ Kang SJ Kim TY Cheon C Ko SG Platycodin D enhances LDLR expression and LDL uptake via down-regulation of IDOL mRNA in hepatic cells Sci Rep 2020 10 19834 33199761 10.1038/s41598-020-76224-w PMC7670405 59 Boonkaew B Satthawiwat N Pinjaroen N Chuaypen N Tangkijvanich P Circulating Extracellular Vesicle-Derived microRNAs as Novel Diagnostic and Prognostic Biomarkers for Non-Viral-Related Hepatocellular Carcinoma Int J Mol Sci 2023 24 16043 38003232 10.3390/ijms242216043 PMC10671272 60 Welsh JA Scorletti E Clough GF Englyst NA Byrne CD Leukocyte extracellular vesicle concentration is inversely associated with liver fibrosis severity in NAFLD J Leukoc Biol 2018 104 631 639 29603349 10.1002/JLB.5A1217-501R 61 Povero D Eguchi A Niesman IR Andronikou N de Mollerat du Jeu X Mulya A Berk M Lazic M Thapaliya S Parola M Patel HH Feldstein AE Lipid-induced toxicity stimulates hepatocytes to release angiogenic microparticles that require Vanin-1 for uptake by endothelial cells Sci Signal 2013 6 ra88 24106341 10.1126/scisignal.2004512 PMC4016801 62 Povero D Yamashita H Ren W Subramanian MG Myers RP Eguchi A Simonetto DA Goodman ZD Harrison SA Sanyal AJ Bosch J Feldstein AE Characterization and Proteome of Circulating Extracellular Vesicles as Potential Biomarkers for NASH Hepatol Commun 2020 4 1263 1278 32923831 10.1002/hep4.1556 PMC7471415 63 Deng ZB Liu Y Liu C Xiang X Wang J Cheng Z Shah SV Zhang S Zhang L Zhuang X Michalek S Grizzle WE Zhang HG Immature myeloid cells induced by a high-fat diet contribute to liver inflammation Hepatology 2009 50 1412 1420 19708080 10.1002/hep.23148 PMC2852608 64 Hirsova P Gores GJ Death Receptor-Mediated Cell Death and Proinflammatory Signaling in Nonalcoholic Steatohepatitis Cell Mol Gastroenterol Hepatol 2015 1 17 27 25729762 10.1016/j.jcmgh.2014.11.005 PMC4340657 65 Ibrahim SH Hirsova P Tomita K Bronk SF Werneburg NW Harrison SA Goodfellow VS Malhi H Gores GJ Mixed lineage kinase 3 mediates release of C-X-C motif ligand 10-bearing chemotactic extracellular vesicles from lipotoxic hepatocytes Hepatology 2016 63 731 744 26406121 10.1002/hep.28252 PMC4764421 66 Lee YS Kim SY Ko E Lee JH Yi HS Yoo YJ Je J Suh SJ Jung YK Kim JH Seo YS Yim HJ Jeong WI Yeon JE Um SH Byun KS Exosomes derived from palmitic acid-treated hepatocytes induce fibrotic activation of hepatic stellate cells Sci Rep 2017 7 3710 28623272 10.1038/s41598-017-03389-2 PMC5473841 67 Tomita K Kabashima A Freeman BL Bronk SF Hirsova P Ibrahim SH Mixed Lineage Kinase 3 Mediates the Induction of CXCL10 by a STAT1-Dependent Mechanism During Hepatocyte Lipotoxicity J Cell Biochem 2017 118 3249 3259 28262979 10.1002/jcb.25973 PMC5550329 68 Liao CY Song MJ Gao Y Mauer AS Revzin A Malhi H Hepatocyte-Derived Lipotoxic Extracellular Vesicle Sphingosine 1-Phosphate Induces Macrophage Chemotaxis Front Immunol 2018 9 2980 30619336 10.3389/fimmu.2018.02980 PMC6305739 69 Hwang S He Y Xiang X Seo W Kim SJ Ma J Ren T Park SH Zhou Z Feng D Kunos G Gao B Interleukin-22 Ameliorates Neutrophil-Driven Nonalcoholic Steatohepatitis Through Multiple Targets Hepatology 2020 72 412 429 31705800 10.1002/hep.31031 PMC7210045 70 Zhao Z Zhong L Li P He K Qiu C Zhao L Gong J Cholesterol impairs hepatocyte lysosomal function causing M1 polarization of macrophages via exosomal miR-122-5p Exp Cell Res 2020 387 111738 31759057 10.1016/j.yexcr.2019.111738 71 Liu XL Pan Q Cao HX Xin FZ Zhao ZH Yang RX Zeng J Zhou H Fan JG Lipotoxic Hepatocyte-Derived Exosomal MicroRNA 192-5p Activates Macrophages Through Rictor/Akt/Forkhead Box Transcription Factor O1 Signaling in Nonalcoholic Fatty Liver Disease Hepatology 2020 72 454 469 31782176 10.1002/hep.31050 PMC10465073 72 Liu H Niu Q Wang T Dong H Bian C Lipotoxic hepatocytes promote nonalcoholic fatty liver disease progression by delivering microRNA-9-5p and activating macrophages Int J Biol Sci 2021 17 3745 3759 35261562 10.7150/ijbs.57610 PMC8898344 73 Garcia-Martinez I Santoro N Chen Y Hoque R Ouyang X Caprio S Shlomchik MJ Coffman RL Candia A Mehal WZ Hepatocyte mitochondrial DNA drives nonalcoholic steatohepatitis by activation of TLR9 J Clin Invest 2016 126 859 864 26808498 10.1172/JCI83885 PMC4767345 74 Hernández A Geng Y Sepúlveda R Solís N Torres J Arab JP Barrera F Cabrera D Moshage H Arrese M Chemical hypoxia induces pro-inflammatory signals in fat-laden hepatocytes and contributes to cellular crosstalk with Kupffer cells through extracellular vesicles Biochim Biophys Acta Mol Basis Dis 2020 1866 165753 32126269 10.1016/j.bbadis.2020.165753 75 Yao JM Ying HZ Zhang HH Qiu FS Wu JQ Yu CH Exosomal RBP4 potentiated hepatic lipid accumulation and inflammation in high-fat-diet-fed mice by promoting M1 polarization of Kupffer cells Free Radic Biol Med 2023 195 58 73 36572267 10.1016/j.freeradbiomed.2022.12.085 76 Hernández A Reyes D Geng Y Arab JP Cabrera D Sepulveda R Solis N Buist-Homan M Arrese M Moshage H Extracellular vesicles derived from fat-laden hepatocytes undergoing chemical hypoxia promote a pro-fibrotic phenotype in hepatic stellate cells Biochim Biophys Acta Mol Basis Dis 2020 1866 165857 32512191 10.1016/j.bbadis.2020.165857 77 Luo X Luo SZ Xu ZX Zhou C Li ZH Zhou XY Xu MY Lipotoxic hepatocyte-derived exosomal miR-1297 promotes hepatic stellate cell activation through the PTEN signaling pathway in metabolic-associated fatty liver disease World J Gastroenterol 2021 27 1419 1434 33911465 10.3748/wjg.v27.i14.1419 PMC8047533 78 Wang W Li F Lai X Liu H Wu S Han Y Shen Y Exosomes secreted by palmitic acid-treated hepatocytes promote LX-2 cell activation by transferring miRNA-107 Cell Death Discov 2021 7 174 34234100 10.1038/s41420-021-00536-7 PMC8263701 79 Wu Z Xia M Wang J Aguilar MM Buist-Homan M Moshage H Extracellular vesicles originating from steatotic hepatocytes promote hepatic stellate cell senescence via AKT/mTOR signaling Cell Biochem Funct 2024 42 e4077 38881228 10.1002/cbf.4077 80 Jiang F Chen Q Wang W Ling Y Yan Y Xia P Hepatocyte-derived extracellular vesicles promote endothelial inflammation and atherogenesis via microRNA-1 J Hepatol 2020 72 156 166 31568800 10.1016/j.jhep.2019.09.014 81 Guo Q Furuta K Lucien F Gutierrez Sanchez LH Hirsova P Krishnan A Kabashima A Pavelko KD Madden B Alhuwaish H Gao Y Revzin A Ibrahim SH Integrin β(1)-enriched extracellular vesicles mediate monocyte adhesion and promote liver inflammation in murine NASH J Hepatol 2019 71 1193 1205 31433301 10.1016/j.jhep.2019.07.019 PMC6864271 82 Zhao Y Zhao MF Jiang S Wu J Liu J Yuan XW Shen D Zhang JZ Zhou N He J Fang L Sun XT Xue B Li CJ Liver governs adipose remodelling via extracellular vesicles in response to lipid overload Nat Commun 2020 11 719 32024826 10.1038/s41467-020-14450-6 PMC7002740 83 Cai J Zhang XJ Li H The Role of Innate Immune Cells in Nonalcoholic Steatohepatitis Hepatology 2019 70 1026 1037 30653691 10.1002/hep.30506 84 Calvente CJ Tameda M Johnson CD Del Pilar H Lin YC Adronikou N De Mollerat Du Jeu X Llorente C Boyer J Feldstein AE Neutrophils contribute to spontaneous resolution of liver inflammation and fibrosis via microRNA-223 J Clin Invest 2019 129 4091 4109 31295147 10.1172/JCI122258 PMC6763256 85 Aucher A Rudnicka D Davis DM MicroRNAs transfer from human macrophages to hepato-carcinoma cells and inhibit proliferation J Immunol 2013 191 6250 6260 24227773 10.4049/jimmunol.1301728 PMC3858238 86 Ismail N Wang Y Dakhlallah D Moldovan L Agarwal K Batte K Shah P Wisler J Eubank TD Tridandapani S Paulaitis ME Piper MG Marsh CB Macrophage microvesicles induce macrophage differentiation and miR-223 transfer Blood 2013 121 984 995 23144169 10.1182/blood-2011-08-374793 PMC3567345 87 Hou X Yin S Ren R Liu S Yong L Liu Y Li Y Zheng MH Kunos G Gao B Wang H Myeloid-Cell-Specific IL-6 Signaling Promotes MicroRNA-223-Enriched Exosome Production to Attenuate NAFLD-Associated Fibrosis Hepatology 2021 74 116 132 33236445 10.1002/hep.31658 PMC8141545 88 Chen L Huang Y Duan Z Huang P Yao H Zhou Y Ji Q Liu X Exosomal miR-500 Derived From Lipopolysaccharide-Treated Macrophage Accelerates Liver Fibrosis by Suppressing MFN2 Front Cell Dev Biol 2021 9 716209 34676206 10.3389/fcell.2021.716209 PMC8525629 89 Gao H Jin Z Bandyopadhyay G Cunha E Rocha K Liu X Zhao H Zhang D Jouihan H Pourshahian S Kisseleva T Brenner DA Ying W Olefsky JM MiR-690 treatment causes decreased fibrosis and steatosis and restores specific Kupffer cell functions in NASH Cell Metab 2022 34 978 990.e4 35700738 10.1016/j.cmet.2022.05.008 PMC9262870 90 Koeck ES Iordanskaia T Sevilla S Ferrante SC Hubal MJ Freishtat RJ Nadler EP Adipocyte exosomes induce transforming growth factor beta pathway dysregulation in hepatocytes: a novel paradigm for obesity-related liver disease J Surg Res 2014 192 268 275 25086727 10.1016/j.jss.2014.06.050 91 Kostallari E Hirsova P Prasnicka A Verma VK Yaqoob U Wongjarupong N Roberts LR Shah VH Hepatic stellate cell-derived platelet-derived growth factor receptor-alpha-enriched extracellular vesicles promote liver fibrosis in mice through SHP2 Hepatology 2018 68 333 348 29360139 10.1002/hep.29803 PMC6033667 92 Gao J Wei B de Assuncao TM Liu Z Hu X Ibrahim S Cooper SA Cao S Shah VH Kostallari E Hepatic stellate cell autophagy inhibits extracellular vesicle release to attenuate liver fibrosis J Hepatol 2020 73 1144 1154 32389810 10.1016/j.jhep.2020.04.044 PMC7572579 93 Tan J Chen M Liu M Chen A Huang M Chen X Tian X Chen W Exosomal miR-192-5p secreted by bone marrow mesenchymal stem cells inhibits hepatic stellate cell activation and targets PPP2R3A J Histotechnol 2023 46 158 169 37226801 10.1080/01478885.2023.2215151 94 Du Z Wu T Liu L Luo B Wei C Extracellular vesicles-derived miR-150-5p secreted by adipose-derived mesenchymal stem cells inhibits CXCL1 expression to attenuate hepatic fibrosis J Cell Mol Med 2021 25 701 715 33342075 10.1111/jcmm.16119 PMC7812282 95 Wang Y Chen Y Yang F Yu X Chu Y Zhou J Yan Y Xi J MiR-4465-modified mesenchymal stem cell-derived small extracellular vesicles inhibit liver fibrosis development via targeting LOXL2 expression J Zhejiang Univ Sci B 2024 25 594 604 39011679 10.1631/jzus.B2300305 PMC11254680 96 Chen KY Chang ZF A marked increase of fucosylation of glycoproteins in IMR-90 human diploid fibroblasts during senescence in vitro Biochem Biophys Res Commun 1987 142 767 774 3827902 10.1016/0006-291x(87)91480-x 97 Luo Z Ji Y Zhang D Gao H Jin Z Yang M Ying W Microbial DNA enrichment promotes liver steatosis and fibrosis in the course of non-alcoholic steatohepatitis Acta Physiol (Oxf) 2022 235 e13827 35500155 10.1111/apha.13827 PMC9335517 98 Elshaer A Chascsa DMH Lizaola-Mayo BC Exploring Varied Treatment Strategies for Metabolic Dysfunction-Associated Steatotic Liver Disease (MASLD) Life (Basel) 2024 14 844 39063598 10.3390/life14070844 PMC11278185 99 Svobodová G Horní M Velecká E Boušová I Metabolic dysfunction-associated steatotic liver disease-induced changes in the antioxidant system: a review Arch Toxicol 2025 99 1 22 39443317 10.1007/s00204-024-03889-x PMC11748479 100 Li X Chen R Kemper S Brigstock DR Dynamic Changes in Function and Proteomic Composition of Extracellular Vesicles from Hepatic Stellate Cells during Cellular Activation Cells 2020 9 290 31991791 10.3390/cells9020290 PMC7072607 101 Wu HM Ni XX Xu QY Wang Q Li XY Hua J Regulation of lipid-induced macrophage polarization through modulating peroxisome proliferator-activated receptor-gamma activity affects hepatic lipid metabolism via a Toll-like receptor 4/NF-κB signaling pathway J Gastroenterol Hepatol 2020 35 1998 2008 32128893 10.1111/jgh.15025 102 Povero D Panera N Eguchi A Johnson CD Papouchado BG de Araujo Horcel L Pinatel EM Alisi A Nobili V Feldstein AE Lipid-induced hepatocyte-derived extracellular vesicles regulate hepatic stellate cell via microRNAs targeting PPAR-γ Cell Mol Gastroenterol Hepatol 2015 1 646 663.e4 26783552 10.1016/j.jcmgh.2015.07.007 PMC4714359 103 Luo X Xu ZX Wu JC Luo SZ Xu MY Hepatocyte-derived exosomal miR-27a activateshepatic stellate cells through the inhibitionof PINK1-mediated mitophagy in MAFLD Mol Ther Nucleic Acids 2021 26 1241 1254 34853724 10.1016/j.omtn.2021.10.022 PMC8607138 104 Li S Yang F Cheng F Zhu L Yan Y Lipotoxic hepatocyte derived LIMA1 enriched small extracellular vesicles promote hepatic stellate cells activation via inhibiting mitophagy Cell Mol Biol Lett 2024 29 82 38822260 10.1186/s11658-024-00596-4 PMC11140962 105 Daher D Dahan KSE Singal AG Non-alcoholic fatty liver disease-related hepatocellular carcinoma J Liver Cancer 2023 23 127 142 37384032 10.17998/jlc.2022.12.30 PMC10202236 106 Kim J Seki E Unveiling the cancer risk nexus of the steatotic liver Trends Endocrinol Metab 2024 35 708 719 38531699 10.1016/j.tem.2024.02.017 PMC11321945 107 Jiang H Qian Y Shen Z Liu Y He Y Gao R Shen M Chen S Fu Q Yang T Circulating microRNA135a3p in serum extracellular vesicles as a potential biological marker of nonalcoholic fatty liver disease Mol Med Rep 2021 24 498 33955511 10.3892/mmr.2021.12137 PMC8127071 108 Quan H Li B Yang J MicroRNA-504 functions as a tumor suppressor in hepatocellular carcinoma through inhibiting Frizzled-7-mediated-Wnt/β-catenin signaling Biomed Pharmacother 2018 107 754 762 30142536 10.1016/j.biopha.2018.07.150 109 Hu Z You L Hu S Yu L Gao Y Li L Zhang S Hepatocellular carcinoma cell-derived exosomal miR-21-5p promotes the polarization of tumor-related macrophages (TAMs) through SP1/XBP1 and affects the progression of hepatocellular carcinoma Int Immunopharmacol 2024 126 111149 38006750 10.1016/j.intimp.2023.111149 110 Rodrigues PM Afonso MB Simão AL Islam T Gaspar MM O'Rourke CJ Lewinska M Andersen JB Arretxe E Alonso C Santos-Laso Á Izquierdo-Sanchez L Jimenez-Agüero R Eizaguirre E Bujanda L Pareja MJ Prip-Buus C Banales JM Rodrigues CMP Castro RE miR-21-5p promotes NASH-related hepatocarcinogenesis Liver Int 2023 43 2256 2274 37534739 10.1111/liv.15682 111 Targher G Byrne CD Tilg H NAFLD and increased risk of cardiovascular disease: clinical associations, pathophysiological mechanisms and pharmacological implications Gut 2020 69 1691 1705 32321858 10.1136/gutjnl-2020-320622 112 Zisis M Chondrogianni ME Androutsakos T Rantos I Oikonomou E Chatzigeorgiou A Kassi E Linking Cardiovascular Disease and Metabolic Dysfunction-Associated Steatotic Liver Disease (MASLD): The Role of Cardiometabolic Drugs in MASLD Treatment Biomolecules 2025 15 324 40149860 10.3390/biom15030324 PMC11940321 113 Vo J Truyen TTTT Uy-Evanado A Sargsyan A Chugh H Young C Hurst S Miyake CY Reinier K Chugh SS Sudden cardiac death associated with fatty liver disease Int J Cardiol Heart Vasc 2025 56 101602 39867850 10.1016/j.ijcha.2025.101602 PMC11759637 114 Chen X Chen S Pang J Huang R You Y Zhang H Xiao J Xue H Ling W Hepatic steatosis aggravates atherosclerosis via small extracellular vesicle-mediated inhibition of cellular cholesterol efflux J Hepatol 2023 79 1491 1501 37678722 10.1016/j.jhep.2023.08.023 115 Zuo R Ye LF Huang Y Song ZQ Wang L Zhi H Zhang MY Li JY Zhu L Xiao WJ Shang HC Zhang Y He RR Chen Y Hepatic small extracellular vesicles promote microvascular endothelial hyperpermeability during NAFLD via novel-miRNA-7 J Nanobiotechnology 2021 19 396 34838052 10.1186/s12951-021-01137-3 PMC8626954 116 Yuan X Bhat OM Zou Y Zhang Y Li PL Contribution of Hepatic Steatosis-Intensified Extracellular Vesicle Release to Aggravated Inflammatory Endothelial Injury in Liver-Specific Asah1 Gene Knockout Mice Am J Pathol 2023 193 493 508 36638912 10.1016/j.ajpath.2022.12.007 PMC10123522 117 Andrabi SM Sharma NS Karan A Shahriar SMS Cordon B Ma B Xie J Nitric Oxide: Physiological Functions, Delivery, and Biomedical Applications Adv Sci (Weinh) 2023 10 e2303259 37632708 10.1002/advs.202303259 PMC10602574 118 Batty M Bennett MR Yu E The Role of Oxidative Stress in Atherosclerosis Cells 2022 11 3843 36497101 10.3390/cells11233843 PMC9735601 119 Prakash A Crespo-Avilan GE Hernandez-Resendiz S Ong SG Hausenloy DJ Extracellular vesicles - mediating and delivering cardioprotection in acute myocardial infarction and heart failure Cond Med 2020 3 227 238 34296067 PMC8294590 120 Han C Yang J Sun J Qin G Extracellular vesicles in cardiovascular disease: Biological functions and therapeutic implications Pharmacol Ther 2022 233 108025 34687770 10.1016/j.pharmthera.2021.108025 PMC9018895 121 Kaya E Yilmaz Y Metabolic-associated Fatty Liver Disease (MAFLD): A Multi-systemic Disease Beyond the Liver J Clin Transl Hepatol 2022 10 329 338 35528971 10.14218/JCTH.2021.00178 PMC9039705 122 Leroyer AS Isobe H Lesèche G Castier Y Wassef M Mallat Z Binder BR Tedgui A Boulanger CM Cellular origins and thrombogenic activity of microparticles isolated from human atherosclerotic plaques J Am Coll Cardiol 2007 49 772 777 17306706 10.1016/j.jacc.2006.10.053 123 Li S Cheng F Zhang Z Xu R Shi H Yan Y The role of hepatocyte-derived extracellular vesicles in liver and extrahepatic diseases Biomed Pharmacother 2024 180 117502 39357327 10.1016/j.biopha.2024.117502 124 Fu Q Li Y Jiang H Shen Z Gao R He Y Liu Y Xu K Yang T Hepatocytes derived extracellular vesicles from high-fat diet induced obese mice modulate genes expression and proliferation of islet β cells Biochem Biophys Res Commun 2019 516 1159 1166 31284955 10.1016/j.bbrc.2019.06.124 125 Ji Y Luo Z Gao H Dos Reis FCG Bandyopadhyay G Jin Z Manda KA Isaac R Yang M Fu W Ying W Olefsky JM Hepatocyte-derived exosomes from early onset obese mice promote insulin sensitivity through miR-3075 Nat Metab 2021 3 1163 1174 34489604 10.1038/s42255-021-00444-1 PMC8460610 126 Wu J Dong T Chen T Sun J Luo J He J Wei L Zeng B Zhang H Li W Liu J Chen X Su M Ni Y Jiang Q Zhang Y Xi Q Hepatic exosome-derived miR-130a-3p attenuates glucose intolerance via suppressing PHLPP2 gene in adipocyte Metabolism 2020 103 154006 31715176 10.1016/j.metabol.2019.154006 127 Polyzos SA Kountouras J Mavrouli M Katsinelos P Doulberis M Gavana E Duntas L Selenoprotein P in Patients with Nonalcoholic Fatty Liver Disease Exp Clin Endocrinol Diabetes 2019 127 598 602 30625508 10.1055/a-0811-9136 128 Jin Y Chung YW Jung MK Lee JH Ko KY Jang JK Ham M Kang H Pack CG Mihara H Kim IY Apolipoprotein E-mediated regulation of selenoprotein P transportation via exosomes Cell Mol Life Sci 2020 77 2367 2386 31471680 10.1007/s00018-019-03287-y PMC11104972 129 Wang Z Kim SY Tu W Kim J Xu A Yang YM Matsuda M Reolizo L Tsuchiya T Billet S Gangi A Noureddin M Falk BA Kim S Fan W Tighiouart M You S Lewis MS Pandol SJ Di Vizio D Merchant A Posadas EM Bhowmick NA Lu SC Seki E Extracellular vesicles in fatty liver promote a metastatic tumor microenvironment Cell Metab 2023 35 1209 1226.e13 37172577 10.1016/j.cmet.2023.04.013 PMC10524732 130 Loomba R Wolfson T Ang B Hooker J Behling C Peterson M Valasek M Lin G Brenner D Gamst A Ehman R Sirlin C Magnetic resonance elastography predicts advanced fibrosis in patients with nonalcoholic fatty liver disease: a prospective study Hepatology 2014 60 1920 1928 25103310 10.1002/hep.27362 PMC4245360 131 Foncea CG Popescu A Lupusoru R Fofiu R Sirli R Danila M Sporea I Comparative study between pSWE and 2D-SWE techniques integrated in the same ultrasound machine, with Transient Elastography as the reference method Med Ultrason 2020 22 13 19 32096782 10.11152/mu-2179 132 Stål P Liver fibrosis in non-alcoholic fatty liver disease - diagnostic challenge with prognostic significance World J Gastroenterol 2015 21 11077 11087 26494963 10.3748/wjg.v21.i39.11077 PMC4607906 133 Vallet-Pichard A Mallet V Nalpas B Verkarre V Nalpas A Dhalluin-Venier V Fontaine H Pol S FIB-4: an inexpensive and accurate marker of fibrosis in HCV infection. comparison with liver biopsy and fibrotest Hepatology 2007 46 32 36 17567829 10.1002/hep.21669 134 Feldstein AE Wieckowska A Lopez AR Liu YC Zein NN McCullough AJ Cytokeratin-18 fragment levels as noninvasive biomarkers for nonalcoholic steatohepatitis: a multicenter validation study Hepatology 2009 50 1072 1078 19585618 10.1002/hep.23050 PMC2757511 135 Alexander M Hu R Runtsch MC Kagele DA Mosbruger TL Tolmachova T Seabra MC Round JL Ward DM O'Connell RM Exosome-delivered microRNAs modulate the inflammatory response to endotoxin Nat Commun 2015 6 7321 26084661 10.1038/ncomms8321 PMC4557301 136 Hoshino A Kim HS Bojmar L Gyan KE Cioffi M Hernandez J Zambirinis CP Rodrigues G Molina H Heissel S Mark MT Steiner L Benito-Martin A Lucotti S Di Giannatale A Offer K Nakajima M Williams C Nogués L Pelissier Vatter FA Hashimoto A Davies AE Freitas D Kenific CM Ararso Y Buehring W Lauritzen P Ogitani Y Sugiura K Takahashi N Alečković M Bailey KA Jolissant JS Wang H Harris A Schaeffer LM García-Santos G Posner Z Balachandran VP Khakoo Y Raju GP Scherz A Sagi I Scherz-Shouval R Yarden Y Oren M Malladi M Petriccione M De Braganca KC Donzelli M Fischer C Vitolano S Wright GP Ganshaw L Marrano M Ahmed A DeStefano J Danzer E Roehrl MHA Lacayo NJ Vincent TC Weiser MR Brady MS Meyers PA Wexler LH Ambati SR Chou AJ Slotkin EK Modak S Roberts SS Basu EM Diolaiti D Krantz BA Cardoso F Simpson AL Berger M Rudin CM Simeone DM Jain M Ghajar CM Batra SK Stanger BZ Bui J Brown KA Rajasekhar VK Healey JH de Sousa M Kramer K Sheth S Baisch J Pascual V Heaton TE La Quaglia MP Pisapia DJ Schwartz R Zhang H Liu Y Shukla A Blavier L DeClerck YA LaBarge M Bissell MJ Caffrey TC Grandgenett PM Hollingsworth MA Bromberg J Costa-Silva B Peinado H Kang Y Garcia BA O'Reilly EM Kelsen D Trippett TM Jones DR Matei IR Jarnagin WR Lyden D Extracellular Vesicle and Particle Biomarkers Define Multiple Human Cancers Cell 2020 182 1044 1061.e18 32795414 10.1016/j.cell.2020.07.009 PMC7522766 137 Kornek M Lynch M Mehta SH Lai M Exley M Afdhal NH Schuppan D Circulating microparticles as disease-specific biomarkers of severity of inflammation in patients with hepatitis C or nonalcoholic steatohepatitis Gastroenterology 2012 143 448 458 22537612 10.1053/j.gastro.2012.04.031 PMC3404266 138 Zhu Q Li H Ao Z Xu H Luo J Kaurich C Yang R Zhu PW Chen SD Wang XD Tang LJ Li G Huang OY Zheng MH Li HP Liu F Lipidomic identification of urinary extracellular vesicles for non-alcoholic steatohepatitis diagnosis J Nanobiotechnology 2022 20 349 35897102 10.1186/s12951-022-01540-4 PMC9327366 139 Nakao Y Amrollahi P Parthasarathy G Mauer AS Sehrawat TS Vanderboom P Nair KS Nakao K Allen AM Hu TY Malhi H Circulating extracellular vesicles are a biomarker for NAFLD resolution and response to weight loss surgery Nanomedicine 2021 36 102430 34174416 10.1016/j.nano.2021.102430 PMC8418232 140 Nguyen HQ Lee D Kim Y Bang G Cho K Lee YS Yeon JE Lubman DM Kim J Label-free quantitative proteomic analysis of serum extracellular vesicles differentiating patients of alcoholic and nonalcoholic fatty liver diseases J Proteomics 2021 245 104278 34089894 10.1016/j.jprot.2021.104278 PMC8277700 141 Sakane S Hikita H Shirai K Sakamoto T Narumi R Adachi J Kakita N Yamada Y Toyoda H Takahashi H Suda G Kai M Tahata Y Sakamori R Kumazaki S Fukumoto K Myojin Y Murai K Kodama T Tatsumi T Tomonaga T Sakamoto N Morii E Takehara T Proteomic analysis of serum extracellular vesicles reveals Fibulin-3 as a new marker predicting liver-related events in MASLD Hepatol Commun 2024 8 e0448 38829196 10.1097/HC9.0000000000000448 PMC11150025 142 Zhang W Zhang J Shi H Liu F Yu H Shi H Exosome GLUT1 derived from hepatocyte identifies the risk of non-alcoholic steatohepatitis and fibrosis Hepatol Int 2023 17 1170 1181 37278869 10.1007/s12072-023-10520-1 143 Newman LA Sorich MJ Rowland A Role of Extracellular Vesicles in the Pathophysiology, Diagnosis and Tracking of Non-Alcoholic Fatty Liver Disease J Clin Med 2020 9 2032 32610455 10.3390/jcm9072032 PMC7409057 144 Hu J Xu Y Hao J Wang S Li C Meng S MiR-122 in hepatic function and liver diseases Protein Cell 2012 3 364 371 22610888 10.1007/s13238-012-2036-3 PMC4875471 145 Povero D Eguchi A Li H Johnson CD Papouchado BG Wree A Messer K Feldstein AE Circulating extracellular vesicles with specific proteome and liver microRNAs are potential biomarkers for liver injury in experimental fatty liver disease PLoS One 2014 9 e113651 25470250 10.1371/journal.pone.0113651 PMC4254757 146 Newman LA Useckaite Z Johnson J Sorich MJ Hopkins AM Rowland A Selective Isolation of Liver-Derived Extracellular Vesicles Redefines Performance of miRNA Biomarkers for Non-Alcoholic Fatty Liver Disease Biomedicines 2022 10 195 35052873 10.3390/biomedicines10010195 PMC8773667 147 What will it take to get miRNA therapies to market? Nat Biotechnol 2024 42 1623 1624 39496928 10.1038/s41587-024-02480-0 148 Diener C Keller A Meese E Emerging concepts of miRNA therapeutics: from cells to clinic Trends Genet 2022 38 613 626 35303998 10.1016/j.tig.2022.02.006 149 Guo CJ Xiao X Sheng L Chen L Zhong W Li H Hua J Ma X RNA Sequencing and Bioinformatics Analysis Implicate the Regulatory Role of a Long Noncoding RNA-mRNA Network in Hepatic Stellate Cell Activation Cell Physiol Biochem 2017 42 2030 2042 28803234 10.1159/000479898 150 Yuan X Wang J Tang X Li Y Xia P Gao X Berberine ameliorates nonalcoholic fatty liver disease by a global modulation of hepatic mRNA and lncRNA expression profiles J Transl Med 2015 13 24 25623289 10.1186/s12967-015-0383-6 PMC4316752 151 Sun C Liu X Yi Z Xiao X Yang M Hu G Liu H Liao L Huang F Genome-wide analysis of long noncoding RNA expression profiles in patients with non-alcoholic fatty liver disease IUBMB Life 2015 67 847 852 26472541 10.1002/iub.1442 152 Zeng Q Liu CH Wu D Jiang W Zhang N Tang H LncRNA and circRNA in Patients with Non-Alcoholic Fatty Liver Disease: A Systematic Review Biomolecules 2023 13 560 36979495 10.3390/biom13030560 PMC10046118 153 Shi N Sun K Tang H Mao J The impact and role of identified long noncoding RNAs in nonalcoholic fatty liver disease: A narrative review J Clin Lab Anal 2023 37 e24943 37435630 10.1002/jcla.24943 PMC10431402 154 Jin SS Lin CJ Lin XF Zheng JZ Guan HQ Silencing lncRNA NEAT1 reduces nonalcoholic fatty liver fat deposition by regulating the miR-139-5p/c-Jun/SREBP-1c pathway Ann Hepatol 2022 27 100584 34808393 10.1016/j.aohep.2021.100584 155 Guo B Cheng Y Yao L Zhang J Lu J Qi H Chen H LncRNA HOTAIR regulates the lipid accumulation in non-alcoholic fatty liver disease via miR-130b-3p/ROCK1 axis Cell Signal 2022 90 110190 34774989 10.1016/j.cellsig.2021.110190 156 Liu J Tang T Wang GD Liu B LncRNA-H19 promotes hepatic lipogenesis by directly regulating miR-130a/PPARγ axis in non-alcoholic fatty liver disease Biosci Rep 2019 39 BSR20181722 31064820 10.1042/BSR20181722 PMC6629946 157 Ma M Duan R Shen L Liu M Ji Y Zhou H Li C Liang T Li X Guo L The lncRNA Gm15622 stimulates SREBP-1c expression and hepatic lipid accumulation by sponging the miR-742-3p in mice J Lipid Res 2020 61 1052 1064 32229588 10.1194/jlr.RA120000664 PMC7328049 158 Yan C Chen J Chen N Long noncoding RNA MALAT1 promotes hepatic steatosis and insulin resistance by increasing nuclear SREBP-1c protein stability Sci Rep 2016 6 22640 26935028 10.1038/srep22640 PMC4776244 159 Zou D Liu L Zeng Y Wang H Dai D Xu M LncRNA MEG3 up-regulates SIRT6 by ubiquitinating EZH2 and alleviates nonalcoholic fatty liver disease Cell Death Discov 2022 8 103 35256601 10.1038/s41420-022-00889-7 PMC8901640 160 Van Dorpe S Tummers P Denys H Hendrix A Towards the Clinical Implementation of Extracellular Vesicle-Based Biomarker Assays for Cancer Clin Chem 2024 70 165 178 38175582 10.1093/clinchem/hvad189 161 González Á López-Borrego S Sandúa A Vales-Gomez M Alegre E Extracellular vesicles in cancer: challenges and opportunities for clinical laboratories Crit Rev Clin Lab Sci 2024 61 435 457 38361287 10.1080/10408363.2024.2309935 162 Cusi K Chang Z Harrison S Lomonaco R Bril F Orsak B Ortiz-Lopez C Hecht J Feldstein AE Webb A Louden C Goros M Tio F Limited value of plasma cytokeratin-18 as a biomarker for NASH and fibrosis in patients with non-alcoholic fatty liver disease J Hepatol 2014 60 167 174 23973932 10.1016/j.jhep.2013.07.042 163 Gurjar S Bhat A R Upadhya R Shenoy RP Extracellular vesicle-mediated approaches for the diagnosis and therapy of MASLD: current advances and future prospective Lipids Health Dis 2025 24 5 39773634 10.1186/s12944-024-02396-3 PMC11705780 164 Ciardullo S Muraca E Vergani M Invernizzi P Perseghin G Advancements in pharmacological treatment of NAFLD/MASLD: a focus on metabolic and liver-targeted interventions Gastroenterol Rep (Oxf) 2024 12 goae029 38681750 10.1093/gastro/goae029 PMC11052658 165 van Erpecum KJ Dalekos GN New horizons in the diagnosis and management of patients with MASLD Eur J Intern Med 2024 122 1 2 38350783 10.1016/j.ejim.2024.01.038 166 European Association for the Study of the Liver (EASL) European Association for the Study of Diabetes (EASD) European Association for the Study of Obesity (EASO) EASL-EASD-EASO Clinical Practice Guidelines on the Management of Metabolic Dysfunction-Associated Steatotic Liver Disease (MASLD) Obes Facts 2024 17 374 444 38852583 10.1159/000539371 PMC11299976 167 Alkhouri N Gawrieh S A perspective on RNA interference-based therapeutics for metabolic liver diseases Expert Opin Investig Drugs 2021 30 237 244 10.1080/13543784.2021.1879792 33470860 168 Kumar MA Baba SK Sadida HQ Marzooqi SA Jerobin J Altemani FH Algehainy N Alanazi MA Abou-Samra AB Kumar R Al-Shabeeb Akil AS Macha MA Mir R Bhat AA Extracellular vesicles as tools and targets in therapy for diseases Signal Transduct Target Ther 2024 9 27 38311623 10.1038/s41392-024-01735-1 PMC10838959 169 Kou M Huang L Yang J Chiang Z Chen S Liu J Guo L Zhang X Zhou X Xu X Yan X Wang Y Zhang J Xu A Tse HF Lian Q Mesenchymal stem cell-derived extracellular vesicles for immunomodulation and regeneration: a next generation therapeutic tool? Cell Death Dis 2022 13 580 35787632 10.1038/s41419-022-05034-x PMC9252569 170 Kunitake K Mizuno T Hattori K Oneyama C Kamiya M Ota S Urano Y Kojima R Barcoding of small extracellular vesicles with CRISPR-gRNA enables comprehensive, subpopulation-specific analysis of their biogenesis and release regulators Nat Commun 2024 15 9777 39562573 10.1038/s41467-024-53736-x PMC11577021 171 Liu S Wu X Chandra S Lyon C Ning B Jiang L Fan J Hu TY Extracellular vesicles: Emerging tools as therapeutic agent carriers Acta Pharm Sin B 2022 12 3822 3842 36213541 10.1016/j.apsb.2022.05.002 PMC9532556 172 Jia X Tang J Yao C Yang D Recent Progress of Extracellular Vesicle Engineering ACS Biomater Sci Eng 2021 7 4430 4438 34455789 10.1021/acsbiomaterials.1c00868 173 Leclaire M Gimzewski J Sharma S A review of the biomechanical properties of single extracellular vesicles Nano Select 2021 2 1 15 174 Jain KK Drug delivery systems - an overview Methods Mol Biol 2008 437 1 50 18369961 10.1007/978-1-59745-210-6_1 175 Wang J Xing K Zhang G Li Z Ding X Leong DT Surface Components and Biological Interactions of Extracellular Vesicles ACS Nano 2025 19 8433 8461 39999425 10.1021/acsnano.4c16854 176 Pinheiro A Silva AM Teixeira JH Gonçalves RM Almeida MI Barbosa MA Santos SG Extracellular vesicles: intelligent delivery strategies for therapeutic applications J Control Release 2018 289 56 69 30261205 10.1016/j.jconrel.2018.09.019 177 Li X Chen R Kemper S Xu Z Brigstock DR Therapeutic Actions of Hepatocyte Extracellular Vesicles in a Murine Model of Diet-Induced Steatohepatitis with Fibrosis Biomedicines 2025 13 274 40002688 10.3390/biomedicines13020274 PMC11852249 178 Wang J Wu Z Xia M Salas SS Ospina JA Buist-Homan M Harmsen MC Moshage H Extracellular vesicles derived from liver sinusoidal endothelial cells inhibit the activation of hepatic stellate cells and Kupffer cells in vitro Biochim Biophys Acta Mol Basis Dis 2024 1870 167020 38244390 10.1016/j.bbadis.2024.167020 179 Jiang W Zeng Q Liu CH Wang Y Wang S Chen E Wang M Zhou T Bai L Wu D Tang H Huc-MSCs-derived exosomes alleviate non-alcoholic steatohepatitis by regulating macrophages polarization through miR-24-3p/STING axis Stem Cell Res Ther 2025 16 74 39984996 10.1186/s13287-025-04197-6 PMC11846240 180 Zhang B Zhang B Lai RC Sim WK Lam KP Lim SK MSC-sEV Treatment Polarizes Pro-Fibrotic M2 Macrophages without Exacerbating Liver Fibrosis in NASH Int J Mol Sci 2023 24 8092 37175803 10.3390/ijms24098092 PMC10179074 181 He F Du W Liu Y Ling Y Xu M Liu J Song P Fang Z Yue Z Duan J Wang L Exosome-equipped TNF antisense oligodeoxynucleotide or 2-deoxy-D-glucose ameliorated nonalcoholic steatohepatitis by modulating superoxide dismutase 1 in mice Redox Biol 2025 80 103488 39778469 10.1016/j.redox.2025.103488 PMC11763583 182 Chen Y Yang F Wang Y Shi Y Liu L Luo W Zhou J Yan Y Mesenchymal stem cell-derived small extracellular vesicles reduced hepatic lipid accumulation in MASLD by suppressing mitochondrial fission Stem Cell Res Ther 2025 16 116 40045380 10.1186/s13287-025-04228-2 PMC11884000 183 Yang F Wu Y Chen Y Xi J Chu Y Jin J Yan Y Human umbilical cord mesenchymal stem cell-derived exosomes ameliorate liver steatosis by promoting fatty acid oxidation and reducing fatty acid synthesis JHEP Rep 2023 5 100746 37274776 10.1016/j.jhepr.2023.100746 PMC10232730 184 Tawfeek GA Kasem HA Curcumin preconditioned mesenchymal stem cells derived exosomes transplantation ameliorate and protect against non- alcoholic steatohepatitis by regulation the expression of key genes of inflammation and oxidative stress Transpl Immunol 2023 78 101837 37031771 10.1016/j.trim.2023.101837 185 Nie Y Meng W Liu D Yang Z Wang W Ren H Mao K Lan W Li C Wang Z Lan J Exosomes derived from apical papilla stem cells improve NASH by regulating fatty acid metabolism and reducing inflammation Mol Med 2024 30 186 39462343 10.1186/s10020-024-00945-1 PMC11512503 186 Nie YF Shang JM Liu DQ Meng WQ Ren HP Li CH Wang ZF Lan J Apical papilla stem cell-derived exosomes regulate lipid metabolism and alleviate inflammation in the MCD-induced mouse NASH model Biochem Pharmacol 2024 222 116073 38395263 10.1016/j.bcp.2024.116073 187 Saha T Mehrotra S Gupta P Kumar A Exosomal miRNA combined with anti-inflammatory hyaluronic acid-based 3D bioprinted hepatic patch promotes metabolic reprogramming in NAFLD-mediated fibrosis Biomaterials 2025 318 123140 39892017 10.1016/j.biomaterials.2025.123140 188 Clos-Sansalvador M Monguió-Tortajada M Roura S Franquesa M Borràs FE Commonly used methods for extracellular vesicles' enrichment: Implications in downstream analyses and use Eur J Cell Biol 2022 101 151227 35460958 10.1016/j.ejcb.2022.151227 189 Simonsen JB What Are We Looking At? Circ Res 2017 121 920 922 28963190 10.1161/CIRCRESAHA.117.311767 190 Dilsiz N A comprehensive review on recent advances in exosome isolation and characterization: Toward clinical applications Transl Oncol 2024 50 102121 39278189 10.1016/j.tranon.2024.102121 PMC11418158 191 Mladenović D Brealey J Peacock B Koort K Zarovni N Quantitative fluorescent nanoparticle tracking analysis and nano-flow cytometry enable advanced characterization of single extracellular vesicles J Extracell Biol 2025 4 e70031 39790179 10.1002/jex2.70031 PMC11707551 192 Leggio L Paternò G Vivarelli S Bonasera A Pignataro B Iraci N Arrabito G Label-free approaches for extracellular vesicle detection iScience 2023 26 108105 37867957 10.1016/j.isci.2023.108105 PMC10589885 193 Wu AY Sung YC Chen YJ Chou ST Guo V Chien JC Ko JJ Yang AL Huang HC Chuang JC Wu S Ho MR Ericsson M Lin WW Cheung CHY Juan HF Ueda K Chen Y Lai CP Multiresolution Imaging Using Bioluminescence Resonance Energy Transfer Identifies Distinct Biodistribution Profiles of Extracellular Vesicles and Exomeres with Redirected Tropism Adv Sci (Weinh) 2020 7 2001467 33042758 10.1002/advs.202001467 PMC7539214 194 Rodrigues G Hoshino A Kenific CM Matei IR Steiner L Freitas D Kim HS Oxley PR Scandariato I Casanova-Salas I Dai J Badwe CR Gril B Tešić Mark M Dill BD Molina H Zhang H Benito-Martin A Bojmar L Ararso Y Offer K LaPlant Q Buehring W Wang H Jiang X Lu TM Liu Y Sabari JK Shin SJ Narula N Ginter PS Rajasekhar VK Healey JH Meylan E Costa-Silva B Wang SE Rafii S Altorki NK Rudin CM Jones DR Steeg PS Peinado H Ghajar CM Bromberg J de Sousa M Pisapia D Lyden D Tumour exosomal CEMIP protein promotes cancer cell colonization in brain metastasis Nat Cell Biol 2019 21 1403 1412 31685984 10.1038/s41556-019-0404-4 PMC7354005 195 Hyenne V Ghoroghi S Collot M Bons J Follain G Harlepp S Mary B Bauer J Mercier L Busnelli I Lefebvre O Fekonja N Garcia-Leon MJ Machado P Delalande F López AA Silva SG Verweij FJ van Niel G Djouad F Peinado H Carapito C Klymchenko AS Goetz JG Studying the Fate of Tumor Extracellular Vesicles at High Spatiotemporal Resolution Using the Zebrafish Embryo Dev Cell 2019 48 554 572.e7 30745140 10.1016/j.devcel.2019.01.014 196 Lucotti S Kenific CM Zhang H Lyden D Extracellular vesicles and particles impact the systemic landscape of cancer EMBO J 2022 41 e109288 36052513 10.15252/embj.2021109288 PMC9475536 197 Rodriguez BV Wen Y Shirk EN Vazquez S Gololobova O Maxwell A Plunkard J Castell N Carlson B Queen SE Izzi JM Driedonks TAP Witwer KW An ex vivo model of interactions between extracellular vesicles and peripheral mononuclear blood cells in whole blood J Extracell Vesicles 2023 12 e12368 38047476 10.1002/jev2.12368 PMC10694845 198 Erratum for Pharmacokinetics and biodistribution of extracellular vesicles administered intravenously and intranasally to Macaca nemestrina J Extracell Biol 2022 1 e67 36591537 10.1002/jex2.59 PMC9799283 199 Ridder K Sevko A Heide J Dams M Rupp AK Macas J Starmann J Tjwa M Plate KH Sültmann H Altevogt P Umansky V Momma S Extracellular vesicle-mediated transfer of functional RNA in the tumor microenvironment Oncoimmunology 2015 4 e1008371 26155418 10.1080/2162402X.2015.1008371 PMC4485784 200 Skotland T Iversen TG Llorente A Sandvig K Biodistribution, pharmacokinetics and excretion studies of intravenously injected nanoparticles and extracellular vesicles: Possibilities and challenges Adv Drug Deliv Rev 2022 186 114326 35588953 10.1016/j.addr.2022.114326 201 Burbidge K Zwikelmaier V Cook B Long MM Balva B Lonigro M Ispas G Rademacher DJ Campbell EM Cargo and cell-specific differences in extracellular vesicle populations identified by multiplexed immunofluorescent analysis J Extracell Vesicles 2020 9 1789326 32944176 10.1080/20013078.2020.1789326 PMC7480458 202 Han C Kang H Yi J Kang M Lee H Kwon Y Jung J Lee J Park J Single-vesicle imaging and co-localization analysis for tetraspanin profiling of individual extracellular vesicles J Extracell Vesicles 2021 10 e12047 33456726 10.1002/jev2.12047 PMC7797949 203 Karczewski KJ Snyder MP Integrative omics for health and disease Nat Rev Genet 2018 19 299 310 29479082 10.1038/nrg.2018.4 PMC5990367 204 Shaba E Vantaggiato L Governini L Haxhiu A Sebastiani G Fignani D Grieco GE Bergantini L Bini L Landi C Multi-Omics Integrative Approach of Extracellular Vesicles: A Future Challenging Milestone Proteomes 2022 10 12 35645370 10.3390/proteomes10020012 PMC9149947 205 Park S Gwon Y Khan SA Jang KJ Kim J Engineering considerations of iPSC-based personalized medicine Biomater Res 2023 27 67 37420273 10.1186/s40824-023-00382-x PMC10326963 206 Küstermann C Narbute K Movčana V Parfejevs V Rūmnieks F Kauķis P Priedols M Mikilps-Mikgelbs R Mihailova M Andersone S Dzalbs A Bajo-Santos C Krams A Abols A iPSC-derived lung and lung cancer organoid model to evaluate cisplatin encapsulated autologous iPSC-derived mesenchymal stromal cell-isolated extracellular vesicles Stem Cell Res Ther 2024 15 246 39113093 10.1186/s13287-024-03862-6 PMC11304910 207 Ohara M Ohnishi S Hosono H Yamamoto K Yuyama K Nakamura H Fu Q Maehara O Suda G Sakamoto N Extracellular Vesicles from Amnion-Derived Mesenchymal Stem Cells Ameliorate Hepatic Inflammation and Fibrosis in Rats Stem Cells Int 2018 2018 3212643 30675167 10.1155/2018/3212643 PMC6323530 208 Gopal A Gangadaran P Rajendran RL Oh JM Lee HW Hong CM Kalimuthu S Han MH Lee J Ahn BC Extracellular vesicle mimetics engineered from mesenchymal stem cells and curcumin promote fibrosis regression in a mouse model of thioacetamide-induced liver fibrosis Regen Ther 2024 26 911 921 39502438 10.1016/j.reth.2024.10.005 PMC11535984 209 Gupta S Pinky Vishal Sharma H Soni N Rao EP Dalela M Yadav A Nautiyal N Kumar A Nayak B Banerjee A Dinda AK Mohanty S Comparative Evaluation of Anti-Fibrotic Effect of Tissue Specific Mesenchymal Stem Cells Derived Extracellular Vesicles for the Amelioration of CCl4 Induced Chronic Liver Injury Stem Cell Rev Rep 2022 18 1097 1112 34859376 10.1007/s12015-021-10313-9 210 Povero D Pinatel EM Leszczynska A Goyal NP Nishio T Kim J Kneiber D de Araujo Horcel L Eguchi A Ordonez PM Kisseleva T Feldstein AE Human induced pluripotent stem cell-derived extracellular vesicles reduce hepatic stellate cell activation and liver fibrosis JCI Insight 2019 5 e125652 31184999 10.1172/jci.insight.125652 PMC6675559 ",
  "metadata": {
    "Title of this paper": "Human induced pluripotent stem cell-derived extracellular vesicles reduce hepatic stellate cell activation and liver fibrosis",
    "Journal it was published in:": "World Journal of Hepatology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476723/"
  }
}