{
  "title": "Paper_1167",
  "abstract": "pmc Nutrients Nutrients 1692 nutrients nutrients Nutrients 2072-6643 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473124 PMC12473124.1 12473124 12473124 41010454 10.3390/nu17182928 nutrients-17-02928 1 Review Nutritional Challenges in Older Cancer Patients: A Narrative Review of Assessment Tools and Management Strategies https://orcid.org/0000-0002-9384-7037 Giordano Giulia 1 * † https://orcid.org/0009-0008-9777-2563 Terranova Roberta 2 † Mastrantoni Luca 3 Landi Francesco 1 2 Kostka Tomasz Academic Editor 1 francesco.landi@unicatt.it 2 rob.terranova@libero.it 3 luca.mastrantoni01@icatt.it * giuliagiordano3792@gmail.com † These authors contributed equally to this work. 11 9 2025 9 2025 17 18 497660 2928 03 8 2025 07 9 2025 10 9 2025 11 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Results Conclusions malnutrition geriatric oncology elderly This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cancer is the second leading cause of death worldwide, contributing significantly to both morbidity and mortality, particularly in the older population [ 1 2 3 4 4 In this context, the aim of this narrative review is to synthesize the prevalence and clinical impact of malnutrition and related conditions such as sarcopenia, cachexia, and frailty in older adults with cancer, to summarize the available tools for nutritional screening and assessment, and to review the evidence on clinical management and interventions, thus supporting clinicians in the implementation of early screening and favoring multidimensional and personalized nutritional care. 2. Materials and Methods This narrative review was conducted according to the SANRA (Scale for the Assessment of Narrative Review Articles) guidelines ( Supplementary Materials 5 2.1. Search Strategy and Data Source A comprehensive literature search was performed on PubMed for studies published between 1 January 2000 and 30 June 2025, with no language restrictions, focused on articles involving human subjects, with attention to populations aged ≥65 years. The search strategy included the following terms: (“malnutrition” OR “nutritional status” OR “nutritional assessment” OR “cachexia” OR “sarcopenia” OR “frailty”) AND (“older adults” OR “elderly” OR “geriatric patients”) AND (“cancer” OR “neoplasm” OR “oncology”) AND (“nutrition intervention” OR “Mediterranean diet”). Additional sources were identified through manual searches of reference lists from key reviews and meta-analyses. The literature search was conducted by two authors (GG and RT), and studies were included by consensus. Disagreements were resolved referring to another author (LM). The initial search yielded 523 articles, which were screened for relevance based on titles and abstracts. Relevant studies were assessed by full text for inclusion. 2.2. Inclusion and Exclusion Criteria The inclusion criteria were as follows: (1) studies involving adults ≥ 65 years with cancer, (2) focus on nutritional status, screening tools, and syndromes (cachexia, sarcopenia, frailty), or nutrition-related interventions, and (3) RCTs, observational studies, reviews, or guidelines (ESPEN, ESMO, SIOG, ASCO). The exclusion criteria included (1) preclinical or animal studies and (2) articles with insufficient methodological clarity or outcome data. 2.3. Data Extraction and Synthesis of Results Data extraction was performed by two authors (GG and RT); disagreements were resolved by consensus or referring to another author (LM). For each study, information such as study design, population characteristics, cancer type, nutritional assessment methods, and interventions (when applicable) was considered. The studies were narratively synthesized, and given the narrative nature of this review, no formal meta-analysis nor risk-of-bias assessment was conducted. 3. Malnutrition, Sarcopenia, Cachexia, and Frailty: Definitions and Overlap 3.1. Malnutrition According to the 2019 Global Leadership Initiative on Malnutrition (GLIM), malnutrition is defined by the presence of phenotypic criteria (weight loss, low body mass index, or reduced muscle mass) and etiologic criteria (reduced food intake/assimilation or disease burden/inflammation) [ 6 3.2. Cachexia A closely related concept is cancer cachexia, a syndrome consistent of weight loss and muscle mass loss, driven by the tumor and systemic inflammation [ 7 8 9 10 Cachexia represents a hypercatabolic condition that cannot be fully reversed by conventional nutritional support alone, and it can contribute directly to mortality, with an estimated 20–30% of cancer deaths attributable to this specific wasting syndrome. Dunne et al. found that cachexia was associated with impairment in instrumental activities of daily living (IADLs), while sarcopenia and isolated weight loss were not significantly linked to IADL impairment [ 11 12 3.3. Sarcopenia Sarcopenia is the age-related loss of skeletal muscle mass and strength, which can be accelerated by malignancy and its treatments. It is characterized by low muscle mass (assessed by imaging or other methods such as bioimpedance) plus evidence of low muscle function, evaluated through grip strength, the chair stand test, or gait speed, in accordance with the EWGSOP2 consensus criteria [ 13 14 In older cancer patients, sarcopenia and cachexia could overlap considerably, since both involve muscle wasting. However, sarcopenia can also occur in patients who are weight-stable or obese—a condition known as sarcopenic obesity—and is not necessarily driven by inflammation, which distinguishes it from cachexia [ 8 8 15 3.4. Frailty All the above conditions—malnutrition, cachexia, and sarcopenia—could reciprocally influence and amplify their effects, possibly leading to frailty. Frailty is a syndrome consisting of a state of increased vulnerability to several stressors and often coexists with malnutrition and sarcopenia in older patients with cancer. Frailty has been defined by Fried as meeting three out of five phenotypic criteria: low grip strength, low energy, slowed walking speed, low physical activity, and/or unintentional weight loss [ 16 17 17 18 19 20 A summary of key points regarding malnutrition, cachexia, sarcopenia, and frailty is available in Table 1 4. Prevalence and Clinical Impact of Malnutrition Malnutrition is highly prevalent in older people with cancer, with rates ranging from 30% to 80% across studies [ 4 22 Malnutrition emerged as an independent predictor of worse overall survival (OS) in numerous analyses. A retrospective study found malnourishment was a risk factor for all-cause mortality in older cancer patients, both in univariate (HR, 1.49; 95% CI, 1.08–2.05; p p 23 Malnutrition is also associated with functional impairment and poorer physical performance, both worsening QoL [ 24 25 26 A cross-sectional study involving 336 older adults (mean age 70 ± 7.2 years) used a geriatric assessment (GA) along with the Cancer & Aging Resilience Evaluation (CARE) survey, which includes nutritional evaluation. The most common tumor types included in the study were colorectal (33.6%) and pancreatic cancer (24.4%). Nutrition scores were dichotomized into normal (0–5) and malnourished (≥6), and multivariate analyses, adjusting for demographics, cancer type, and cancer stage, were used to examine associations with GA impairment, health-related quality of life (HRQOL), and healthcare utilization. Overall, 52.1% of the patients were identified as malnourished. Malnutrition was related to a higher prevalence of several GA impairments, such as ≥1 falls with adjusted odds ratio (aOR) of 2.1, iADL impairment (aOR = 4.1), and frailty (aOR 8.2). Malnutrition was also associated with HRQOL domains, both physical (aOR = 8.7) and mental (aOR = 5.0), and with prior hospitalizations (aOR = 2.2) [ 27 It is important to note the overlapping nature of these conditions: many older cancer patients show concurrent malnutrition, sarcopenia, and frailty, compounding their risks. In a study involving adults aged ≥70 with cancer, 33% had upper gastrointestinal and 27% had lung cancer and 83.3% had at least one of the three conditions; 26.7% were identified as having only one condition and 30.0% as having all three conditions simultaneously [ 28 5. Nutritional Assessment: Screening Tools and Comprehensive Evaluation 5.1. Comprehensive Geriatric Assessment Comprehensive geriatric assessment (CGA) evaluates several domains, including social, demographic information, comorbidities, functional and physical performance, medications, mood and cognitive functions, nutrition, and treatment-associated side effects [ 29 5.2. Geriatric 8 The geriatric 8 (G8) is a short screening tool specifically developed for older cancer patients which comprises eight items covering multiple domains as nutritional status (evaluating food intake, weight loss), mobility, neuropsychological problems, polypharmacy, self-rated health, and age [ 30 31 32 5.3. Mini-Nutritional Assessment A validated and useful tool for the identification of older adults at risk of malnutrition is the Mini-Nutritional Assessment (MNA), often used in its short form (MNA-SF), assessing the presence of signs such as reduced food intake, weight loss, mobility, recent acute illness or stress, neuro-psychological problems, and low BMI [ 33 34 6 35 5.4. Patient-Generated Subjective Global Assessment The Patient-Generated Subjective Global Assessment (PG-SGA) is an oncology specific nutritional assessment tool which combines a patient-based questionnaire (covering weight history, food intake, symptoms like anorexia or pain, and functional capacity) with a clinician assessment of metabolic demand and physical exam findings. The PG-SGA yields both a global rating (well-nourished A, moderate malnutrition B, severe malnutrition C) and a numeric score that guides the intervention urgency. Scores ≥ 9 indicate a critical need for nutritional intervention (corresponding to severe malnutrition). The PG-SGA is considered a gold-standard assessment in cancer patients and is widely used in clinical trials. However, it is more time-intensive than a screening tool and often requires dietitian involvement. Q. Zhang et al. validated the predictive value of the nutritional assessment tool (Patient-Generated Subjective Global Assessment Short Form, PG-SGA SF) for clinical outcomes in older adults with cancer [ 36 36 37 5.5. Controlling Nutritional Status Score The Controlling Nutritional Status (CONUT) Score is an objective screening tool based on laboratory values (serum albumin, total lymphocyte count, and total cholesterol levels) to assess nutritional status [ 38 39 40 41 38 5.6. Geriatric Nutritional Risk Index The Geriatric Nutritional Risk Index (GNRI) represents an objective index designed for older adults. It is calculated from weight and albumin (1.489 × albumin [g/L]) + (41.7 × (current weight/ideal weight)) [ 42 5.7. Recommended Approach A summary of nutritional assessment tools is available in Table 2 29 43 These assessment tools are complementary: a recommended approach is to screen every older cancer patient with a quick tool like G8 (or an alternative such as the MNA-SF or MST—Malnutrition Screening Tool—in non-oncology settings). If the screen is positive (e.g., G8 ≤ 14 or MNA-SF ≤ 11), the clinician should proceed with a more detailed assessment, including a full PG-SGA by a dietitian and a CGA by a geriatrician expert in geriatric oncology, both part of a multidisciplinary team. It is useful to run relevant laboratory blood tests to evaluate specific indices (such as albumin or lymphocytes, which can be used to calculate the CONUT, PNI, and the GNRI and gain additional prognostic insight). Throughout, close follow-up and reassessment are key: weight and performance status are tracked, and the nutrition plan can be adjusted accordingly to implement a proactive approach. 6. Nutritional Interventions and Management Strategy Managing malnutrition and its related syndromes in older cancer patients requires a multimodal and tailored approach due to the heterogeneity of this population in terms of tumor types, disease stages, comorbidities, and individual goals. 6.1. Nutrional Counseling Nutritional counseling represents the first step, giving guidance on meal planning aiming to increase protein and calories intake (such as adding snacks, high-protein beverages, frequent small meals), treating contributory symptoms (providing suggestions for managing taste changes or nausea), and involving caregivers in meal support. An open-label RCT conducted between April 2020 and May 2022 evaluated 80 lung cancer patients, randomizing 43 to dietary counseling and 37 to routine care: the dietary counseling group showed significant benefits, such as smaller decreases in body weight at 3–4 weeks (−0.8% vs. −2.6%, p p 45 6.2. Oral Nutritional Supplements Oral nutritional supplements (ONSs), such as high-calorie or high protein drinks, are often prescribed to help patients meet daily requirements when diet alone is not sufficient. ONS could be in different formats (liquid, powder, pudding, and pre-thickened) and types (high in protein, rich in fiber containing). ONS are classified as “high-protein”, when they provide > 20% of energy from protein and “high-energy”, when they provide > 1.5 kcal/mL or gram [ 46 47 6.3. Management of Symptoms and Therapy-Related Adverse Events Another important aspect is represented by symptoms and therapy-related adverse events, which can impact daily dietary intake. The incidence of oral mucositis in patients undergoing chemo-radiotherapy for head and neck tumors ranges from 59.4% to 100%, and tailored interventions should include texture-modified diets, and/or topical analgesics [ 48 49 50 51 52 53 54 Diarrhea is frequent with irinotecan-based regimes, with an overall incidence of between 60 and 90% and an incidence of 20–40% for severe diarrhea [ 55 56 57 58 59 60 61 62 Dental issues in older adults such as poor dentition can severely limit intake: referral to a dentist or modification of food consistency can have an immediate impact on nutritional intake [ 63 64 65 66 67 Polypharmacy is another potential contributor factor, as concomitant medications can cause anorexia or taste changes: simplifying regimens or switching drugs, when possible, may improve appetite and reduce the risk of drug–drug interactions [ 68 69 6.4. Physical Activity Malnutrition in older adults often coexists with physical inactivity, and purely nutritional interventions can be less effective if not paired with exercise [ 70 71 72 73 74 The American College of Sports Medicine (ACSM) recommended that patients with cancer and cancer survivors should achieve 150 min per week of moderate intensity aerobic activity [ 75 76 In a recent multicenter phase 3 RCT, patients with colon cancer who completed adjuvant chemotherapy were randomized to a group receiving exercise program and one who received health educational materials only, over a total period of 3 years, for a total of 889 patients [ 77 p 6.5. Pharmacological Agents In cases of cancer cachexia or when conventional dietary measures fail to counteract weight loss, pharmacologic agents can be considered. Appetite stimulants like megestrol acetate have been used for cancer anorexia: megestrol increases appetite and helps gain weight (mostly fat and water weight) [ 78 79 80 81 Another class under study is ghrelin agonists, which seem promising in terms of increasing appetite and lean body mass (LBM) in advanced cancer patients with cachexia. Recent meta-analysis found that anamorelin is associated with an increase in total body weight, LBM, and QOL in patients with cancer-related cachexia, with no increasing overall adverse events [ 82 Anti-inflammatory agents, like interleukin-6 (IL-6) inhibitors, have been explored to counteract the inflammatory drive of cachexia: IL-6 targets adipose tissue, skeletal muscle, and gut and liver tissue. Plus, Il-6-sensitive tissues could have their sensitivity increased through a specific mechanism called the “trans-IL6-signaling cascade”, mediated by soluble Il-6 receptors (sIL-6Rs), leading to amplification of its effects, especially in the cachectic patient [ 83 84 85 86 86 87 88 Some patients may benefit from omega-3 supplementation, which is known to help in gaining weight and in weight maintenance and has been shown to have benefits on muscle [ 89 6.6. Enteral and Parenteral Nutriotion Enteral and parenteral nutrition represent suitable options when energetical and nutritional needs of the patients are not meet by oral intake. Enteral nutrition via feeding tube is indicated if the gastrointestinal tract is functional: this is a common scenario in head/neck or esophageal cancers and during chemoradiation to prevent severe weight loss. Parenteral nutrition is generally reserved for those patients where the GI tract is non-functional or obstructed (as in malignant bowel obstruction in ovarian cancer or severe radiation enteritis). In advanced cancer patients, the role of long-term home parenteral nutrition is controversial, but it can be considered on a case-by-case basis. Recent guidelines by ESPEN suggest offering parenteral nutrition to advanced cancer patients only if life expectancy is several months or years and if starvation is the primary threat to life: on the opposite, if expected survival is in a few to several weeks, interventions should be non-invasive, aiming at existential support [ 90 7. Evidence of Benefits from Nutritional Interventions Recent studies have started to provide evidence that nutritional support can indeed translate into better outcomes in older or malnourished cancer populations. A secondary analysis of the EFFORT trial (enrolling malnourished medical inpatients, ~20% of whom had cancer) showed that patients receiving individualized nutritional support had fewer serious adverse events [ 91 92 A network meta-analysis focused on patients with head and neck cancer receiving radiotherapy or chemo-radiotherapy, comparing the effects of different enteral feeding methods such as nasogastric tube (NGT), prophylactic percutaneous endoscopic gastrostomy (pPEG), and reactive percutaneous endoscopic gastrostomy (rPEG). After the selection of 13 studies (a total of 1631 participants), the results showed that both pPEG and NGT were superior to rPEG in the management of the weight loss, and that pPEG was associated with the lowest rate of treatment interruption or nutrition-related illnesses requiring hospital admission. No difference in tube-related complications emerged [ 93 Nutritional interventions often result in better patient-reported outcomes: as a 2021 systematic review found, focusing on 18 studies for a total of 2720 subjects included in the analyses, patients receiving nutritional counseling or receiving ONS reported an improved global QoL and physical function. Still, a real specific optimum nutritional intervention was not identified [ 94 Preserving muscle mass via a combined nutrition and exercise regimen leads to maintained functional independence, retarding or avoiding becoming wheelchair- or bed-bound. Also, mental health can also improve, as patients with better nutrition often experience less fatigue and depression [ 95 Specific dietary regimens such as the Mediterranean Diet (MD) are known for their beneficial effects in cancer incidence: MD is well known to be enriched in antioxidant compounds, associated with promoting anti-inflammatory and metabolic regulatory pathways with several beneficial effects. A recent meta-analysis including 16 studies evaluated the impact of MD in cancer incidence and mortality in older adults, finding that MD could represent a protective factor in cancer prevention in older populations, while no clear effect regarding cancer-related mortality emerged [ 96 8. Research Gaps and Future Directions 8.1. Optimization of Screening Strategy Despite increased awareness, standardized screening strategies remain lacking. Currently, patients are not always systematically screened for malnutrition: understanding barriers (time, reimbursement, lack of training) and testing pragmatic solutions (such as electronic health record prompts or use of automated screening based on routine data such as BMI trends) represents a priority. Moreover, the adoption of GLIM criteria for malnutrition and a consensus on cachexia criteria remains limited [ 6 8.2. Interventions Trials While evidence is growing, to date, intervention studies have had limitations such as small sample sizes or heterogeneity. Currently, there is a need for large RCTs focusing on malnourished or sarcopenic cancer patient groups, especially in the elderly. Studies combining multimodal therapy, including nutrition, physical exercise, and anti-inflammatory drugs, could be particularly promising: a proof of this concept is represented by the Pre-MENAC study, a randomized phase II trial focused on lung and pancreatic cancer patients undergoing chemotherapy who were randomized to standard care alone or to a treatment arm including nutritional interventions, anti-inflammatory drug administration, and a home-based physical exercise regimen (aerobic associated with resistance training). The results showed a mean weight gain of 0.91 kg in the treatment arm and a mean weight loss of 2.12 kg within the control arm at 6 weeks [ 97 8.3. Patient-Tailored Interventions Tailoring nutritional interventions to an individual needs is critical, as some patients lose weight primarily from a reduced intake mechanism, for whom high-calorie diets could be helpful, or due to other mechanisms such as hypermetabolism. Precision nutrition includes adjusting protein targets (considering that some older adults might need 1.5 g/kg/day protein to gain muscle, versus the standard 1.0–1.2 g/kg) [ 46 In light of this, recently, the European Union proposed the MyPath Nutrition Care Pathway (NCP), a digital platform, aiming to offer an accessible and patient-centered assessment system integrating nutritional, health status, and inflammatory status evaluation in cancer patients; this represents a resourceful solution that can be implemented across several health care settings [ 98 9. Conclusions Malnutrition is highly prevalent in older adults with cancer, significantly affecting clinical outcomes, and itoften coexists with sarcopenia, cachexia, and frailty. These four conditions overlap and are frequently underrecognized in clinical practice and their management is often fragmented, despite being potentially actionable from a clinical point of view with timely screening and integrated interventions. In this narrative review, we highlighted the importance of a multidisciplinary approach, emphasizing a two-step screening and assessment process using validated tools. Careful evaluation of each patient’s individual needs should guide targeted interventions, including nutritional counseling and geriatric assessment. We identified three major gaps for future research: (1) optimization of screening strategies, (2) the need for dedicated interventions trials for malnutrition management in elderly patients, and (3) a transition towards a personalized nutrition approach. In conclusion, proactive identification and integrated management of malnutrition, sarcopenia, cachexia, and frailty should be considered a priority for clinicians, as it can improve quality of life, treatment tolerance, and survival in elderly patients with cancer. Acknowledgments Italian Ministry of Health (Ricerca Corrente 2025). Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/nu17182928/s1 Author Contributions Conceptualization, G.G. and R.T.; methodology G.G., L.M., and R.T.; investigation, G.G., L.M., and R.T.; resources, F.L.; writing—original draft preparation, G.G. and R.T.; writing—review and editing, G.G., R.T., and L.M.; visualization, G.G., L.M., and R.T.; supervision, L.M., F.L.; project administration, G.G. and L.M.; funding acquisition, F.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. References 1. Bray F. Laversanne M. Weiderpass E. Soerjomataram I. The ever-increasing importance of cancer as a leading cause of premature death worldwide Cancer 2021 127 3029 3030 10.1002/cncr.33587 34086348 2. Berben L. Floris G. Wildiers H. Hatse S. Cancer and Aging: Two Tightly Interconnected Biological Processes Cancers 2021 13 1400 10.3390/cancers13061400 33808654 PMC8003441 3. Norman K. Haß U. Pirlich M. Malnutrition in Older Adults—Recent Advances and Remaining Challenges Nutrients 2021 13 2764 10.3390/nu13082764 34444924 PMC8399049 4. Bauer J.M. Pattwell M. Barazzoni R. Battisti N.M.L. Soto-Perez-de-Celis E. Hamaker M.E. Scotté F. Soubeyran P. Aapro M. Systematic nutritional screening and assessment in older patients: Rationale for its integration into oncology practice Eur. J. Cancer 2024 209 114237 10.1016/j.ejca.2024.114237 39096852 5. Baethge C. Goldbeck-Wood S. Mertens S. SANRA—A scale for the quality assessment of narrative review articles Res. Integr. Peer Rev. 2019 4 5 10.1186/s41073-019-0064-8 30962953 PMC6434870 6. Cederholm T. Jensen G.L. Correia M.I.T.D. Gonzalez M.C. Fukushima R. Higashiguchi T. Baptista G. Barazzoni R. Blaauw R. Coats A. GLIM criteria for the diagnosis of malnutrition—A consensus report from the global clinical nutrition community Clin. Nutr. 2019 38 1 9 10.1016/j.clnu.2018.08.002 30181091 7. Arends J. Strasser F. Gonella S. Solheim T.S. Madeddu C. Ravasco P. Buonaccorso L. de van der Schueren M.A.E. Baldwin C. Chasen M. Cancer cachexia in adult patients: ESMO Clinical Practice Guidelines ESMO Open 2021 6 100092 10.1016/j.esmoop.2021.100092 34144781 PMC8233663 8. Williams G.R. Dunne R.F. Giri S. Shachar S.S. Caan B.J. Sarcopenia in the Older Adult with Cancer J. Clin. Oncol. 2021 39 2068 2078 10.1200/JCO.21.00102 34043430 PMC8260902 9. Ni J. Zhang L. Cancer Cachexia: Definition, Staging, and Emerging Treatments Cancer Manag. Res. 2020 12 5597 5605 10.2147/CMAR.S261585 32753972 PMC7358070 10. Poisson J. Martinez-Tapia C. Heitz D. Geiss R. Albrand G. Falandry C. Gisselbrecht M. Couderc A. Boulahssass R. Liuu E. Prevalence and prognostic impact of cachexia among older patients with cancer: A nationwide cross-sectional survey (NutriAgeCancer) J. Cachexia Sarcopenia Muscle 2021 12 1477 1488 10.1002/jcsm.12776 34519440 PMC8718093 11. Dunne R.F. Roussel B. Culakova E. Pandya C. Fleming F.J. Hensley B. Magnuson A.M. Loh K.P. Gilles M. Ramsdale E. Characterizing cancer cachexia in the geriatric oncology population J. Geriatr. Oncol. 2019 10 415 419 10.1016/j.jgo.2018.08.008 30196027 PMC6401352 12. Caillet P. Liuu E. Raynaud Simon A. Bonnefoy M. Guerin O. Berrut G. Lesourd B. Jeandel C. Ferry M. Rolland Y. Association between cachexia, chemotherapy and outcomes in older cancer patients: A systematic review Clin. Nutr. 2017 36 1473 1482 10.1016/j.clnu.2016.12.003 28017447 13. Cruz-Jentoft A.J. Bahat G. Bauer J. Boirie Y. Bruyère O. Cederholm T. Cooper C. Landi F. Rolland Y. Sayer A.A. Sarcopenia: Revised European consensus on definition and diagnosis Age Ageing 2019 48 16 31 10.1093/ageing/afy169 30312372 PMC6322506 14. Giordano G. Mastrantoni L. Landi F. Development and Validation of Quantile Regression Forests for Prediction of Reference Quantiles in Handgrip and Chair-Stand Test J. Cachexia Sarcopenia Muscle 2025 16 e13868 10.1002/jcsm.13868 40525650 PMC12171994 15. Caan B.J. Meyerhardt J.A. Kroenke C.H. Alexeeff S. Xiao J. Weltzien E. Feliciano E.C. Castillo A.L. Quesenberry C.P. Kwan M.L. Explaining the Obesity Paradox: The Association between Body Composition and Colorectal Cancer Survival (C-SCANS Study) Cancer Epidemiol. Biomark. Prev. 2017 26 1008 1015 10.1158/1055-9965.EPI-17-0200 28506965 PMC5647152 16. Fried L.P. Tangen C.M. Walston J. Newman A.B. Hirsch C. Gottdiener J. Seeman T. Tracy R. Kop W.J. Burke G. Frailty in Older Adults: Evidence for a Phenotype J. Gerontol. A Biol. Sci. Med. Sci. 2001 56 M146 M157 10.1093/gerona/56.3.M146 11253156 17. Lao J. Su M. Zhang J. Liu L. Zhou S. Yao N. Frailty and medical financial hardship among older adults with cancer in the United States Front. Oncol. 2023 13 1202575 10.3389/fonc.2023.1202575 37456241 PMC10344591 18. Ethun C.G. Bilen M.A. Jani A.B. Maithel S.K. Ogan K. Master V.A. Frailty and cancer: Implications for oncology surgery, medical oncology, and radiation oncology CA Cancer J. Clin. 2017 67 362 377 10.3322/caac.21406 28731537 19. Lin H.-S. Watts J.N. Peel N.M. Hubbard R.E. Frailty and post-operative outcomes in older surgical patients: A systematic review BMC Geriatr. 2016 16 157 10.1186/s12877-016-0329-8 27580947 PMC5007853 20. Mohile S.G. Xian Y. Dale W. Fisher S.G. Rodin M. Morrow G.R. Neugut A. Hall W. Association of a Cancer Diagnosis With Vulnerability and Frailty in Older Medicare Beneficiaries JNCI J. Natl. Cancer Inst. 2009 101 1206 1215 10.1093/jnci/djp239 19638506 PMC3937788 21. Cruz-Jentoft A.J. Baeyens J.P. Bauer J.M. Boirie Y. Cederholm T. Landi F. Martin F.C. Michel J.-P. Rolland Y. Schneider S.M. Sarcopenia: European consensus on definition and diagnosis Age Ageing 2010 39 412 423 10.1093/ageing/afq034 20392703 PMC2886201 22. Amrein K. Scherkl M. Hoffmann M. Neuwersch-Sommeregger S. Köstenberger M. Tmava Berisha A. Martucci G. Pilz S. Malle O. Vitamin D deficiency 2.0: An update on the current status worldwide Eur. J. Clin. Nutr. 2020 74 1498 1513 10.1038/s41430-020-0558-y 31959942 PMC7091696 23. Zhang X. Pang L. Sharma S.V. Li R. Nyitray A.G. Edwards B.J. Malnutrition and overall survival in older patients with cancer Clin. Nutr. 2021 40 966 977 10.1016/j.clnu.2020.06.026 32665101 24. Isabel T.D. Correia M. The impact of malnutrition on morbidity, mortality, length of hospital stay and costs evaluated through a multivariate model analysis Clin. Nutr. 2003 22 235 239 10.1016/S0261-5614(02)00215-7 12765661 25. van Bokhorst-de van der Schueren M.A.E. Lonterman-Monasch S. de Vries O.J. Danner S.A. Kramer M.H.H. Muller M. Prevalence and determinants for malnutrition in geriatric outpatients Clin. Nutr. 2013 32 1007 1011 10.1016/j.clnu.2013.05.007 23755842 26. Johansson L. Sidenvall B. Malmberg B. Christensson L. Who will become malnourished? A prospective study of factors associated with malnutrition in older persons living at home J. Nutr. Health Aging 2009 13 855 861 10.1007/s12603-009-0242-3 19924344 27. Williams G.R. Al-Obaidi M. Dai C. Mir N. Challa S.A. Daniel M. Patel H. Barlow B. Young-Smith C. Gbolahan O. Association of malnutrition with geriatric assessment impairments and health-related quality of life among older adults with gastrointestinal malignancies Cancer 2020 126 5147 5155 10.1002/cncr.33122 32885848 PMC7747231 28. Bullock A.F. Patterson M.J. Paton L.W. Currow D.C. Johnson M.J. Malnutrition, sarcopenia and cachexia: Exploring prevalence, overlap, and perceptions in older adults with cancer Eur. J. Clin. Nutr. 2024 78 486 493 10.1038/s41430-024-01433-9 38580728 PMC11182746 29. Wildiers H. Heeren P. Puts M. Topinkova E. Janssen-Heijnen M.L.G. Extermann M. Falandry C. Artz A. Brain E. Colloca G. International Society of Geriatric Oncology Consensus on Geriatric Assessment in Older Patients With Cancer J. Clin. Oncol. 2014 32 2595 2603 10.1200/JCO.2013.54.8347 25071125 PMC4876338 30. Cavusoglu C. Tahtaci G. Dogrul R.T. Ileri I. Yildirim F. Candemir B. Kizilarslanoglu M.C. Uner A. Goker B. Predictive ability of the G8 screening test to determine probable sarcopenia and abnormal comprehensive geriatric assessment in older patients with solid malignancies BMC Geriatr. 2021 21 574 10.1186/s12877-021-02544-9 34666690 PMC8524815 31. Bellera C.A. Rainfray M. Mathoulin-Pélissier S. Mertens C. Delva F. Fonck M. Soubeyran P.L. Screening older cancer patients: First evaluation of the G-8 geriatric screening tool Ann. Oncol. 2012 23 2166 2172 10.1093/annonc/mdr587 22250183 32. van Walree I.C. Scheepers E. van Huis-Tanja L. Emmelot-Vonk M.H. Bellera C. Soubeyran P. Hamaker M.E. A systematic review on the association of the G8 with geriatric assessment, prognosis and course of treatment in older patients with cancer J. Geriatr. Oncol. 2019 10 847 858 10.1016/j.jgo.2019.04.016 31078444 33. Guigoz Y. Vellas B. Garry P.J. Assessing the Nutritional Status of the Elderly: The Mini Nutritional Assessment as Part of the Geriatric Evaluation Nutr. Rev. 2009 54 S59 S65 10.1111/j.1753-4887.1996.tb03793.x 8919685 34. Kaiser M.J. Bauer J.M. Ramsch C. Uter W. Guigoz Y. Cederholm T. Thomas D.R. Anthony P. Charlton K.E. Maggio M. Validation of the Mini Nutritional Assessment short-form (MNA ® J. Nutr. Health Aging 2009 13 782 788 10.1007/s12603-009-0214-7 19812868 35. Cereda E. Pedrolli C. Klersy C. Bonardi C. Quarleri L. Cappello S. Turri A. Rondanelli M. Caccialanza R. Nutritional status in older persons according to healthcare setting: A systematic review and meta-analysis of prevalence data using MNA ® Clin. Nutr. 2016 35 1282 1290 10.1016/j.clnu.2016.03.008 27086194 36. Zhang Q. Li X.-R. Zhang X. Ding J.-S. Liu T. Qian L. Song M.-M. Song C.-H. Barazzoni R. Tang M. PG-SGA SF in nutrition assessment and survival prediction for elderly patients with cancer BMC Geriatr. 2021 21 687 10.1186/s12877-021-02662-4 34893024 PMC8665602 37. Jun Wang W. Ting Li T. Wang X. Li W. Wei Cui J. Combining the Patient-Generated Subjective Global Assessment (PG-SGA) and Objective Nutrition Assessment Parameters Better Predicts Malnutrition in Elderly Patients with Colorectal Cancer J. Nutr. Oncol. 2020 5 22 30 10.34175/jno202001003 38. Hayama T. Ozawa T. Okada Y. Tsukamoto M. Fukushima Y. Shimada R. Nozawa K. Matsuda K. Fujii S. Hashiguchi Y. The pretreatment Controlling Nutritional Status (CONUT) score is an independent prognostic factor in patients undergoing resection for colorectal cancer Sci. Rep. 2020 10 13239 10.1038/s41598-020-70252-2 32764671 PMC7413386 39. Zhang H. Liu N. Dang H. Association of the Controlling Nutritional Status (CONUT) score with all-cause and cause-specific mortality in patients with diabetic kidney disease: Evidence from the NHANES 2009–2018 BMJ Open 2024 14 e079992 10.1136/bmjopen-2023-079992 PMC11043715 38653515 40. Suzuki H. Ito M. Takemura K. Kobayashi S. Kataoka M. Iida N. Sekiya K. Matsumoto T. Koga F. The Controlling Nutritional Status (CONUT) Score is a Prognostic Biomarker in Advanced Urothelial Carcinoma Patients Treated with First-Line Platinum-Based Chemotherapy Bladder Cancer 2021 7 13 21 10.3233/BLC-200354 38993214 PMC11181873 41. Suzuki H. Ito M. Takemura K. Nakanishi Y. Kataoka M. Sakamoto K. Tobisu K. Koga F. Prognostic significance of the controlling nutritional status (CONUT) score in advanced urothelial carcinoma patients Urol. Oncol. Semin. Orig. Investig. 2020 38 e11 e76 10.1016/j.urolonc.2019.10.014 31864938 42. Bouillanne O. Morineau G. Dupont C. Coulombel I. Vincent J.-P. Nicolis I. Benazeth S. Cynober L. Aussel C. Geriatric Nutritional Risk Index: A new index for evaluating at-risk elderly medical patients Am. J. Clin. Nutr. 2005 82 777 783 10.1093/ajcn/82.4.777 16210706 43. Dale W. Klepin H.D. Williams G.R. Alibhai S.M.H. Bergerot C. Brintzenhofeszoc K. Hopkins J.O. Jhawer M.P. Katheria V. Loh K.P. Practical Assessment and Management of Vulnerabilities in Older Patients Receiving Systemic Cancer Therapy: ASCO Guideline Update J. Clin. Oncol. 2023 41 4293 4312 10.1200/JCO.23.00933 37459573 44. Suzuki S. Kanaji S. Yamamoto M. Oshikiri T. Nakamura T. Kakeji Y. Controlling Nutritional Status (CONUT) Score Predicts Outcomes of Curative Resection for Gastric Cancer in the Elderly World J. Surg. 2019 43 1076 1084 10.1007/s00268-018-04889-6 30569221 45. Chewaskulyong B. Malairungsakul H. Buranapin S. Jesadaporn P. Ketpueak T. Suksombooncharoen T. Charoentum C. Dietary Counseling Outcomes in Patients with Lung Cancer in an Upper-Middle-Income Country: An Open-Label Randomized Controlled Trial J. Clin. Med. 2024 13 5236 10.3390/jcm13175236 39274449 PMC11396147 46. Volkert D. Beck A.M. Cederholm T. Cruz-Jentoft A. Goisser S. Hooper L. Kiesswetter E. Maggio M. Raynaud-Simon A. Sieber C.C. ESPEN guideline on clinical nutrition and hydration in geriatrics Clin. Nutr. 2019 38 10 47 10.1016/j.clnu.2018.05.024 30005900 47. Sa-nguansai S. Pintasiri P. Tienchaiananda P. Efficacy of oral nutritional supplement in cancer patients receiving chemotherapy: A systematic review and meta-analysis of randomized controlled trials Ann. Palliat. Med. 2024 13 260 272 10.21037/apm-23-558 38584474 48. Murphy B.A. Gilbert J. Dysphagia in Head and Neck Cancer Patients Treated With Radiation: Assessment, Sequelae, and Rehabilitation Semin. Radiat. Oncol. 2009 19 35 42 10.1016/j.semradonc.2008.09.007 19028344 49. Xia J. Tao X. Hu Q. Luo W. Tong X. Zhou G. Zhou H. Hua H. Tang G. Wu T. Expert consensus on the prevention and treatment of radiochemotherapy-induced oral mucositis Int. J. Oral Sci. 2025 17 54 10.1038/s41368-025-00382-8 40664676 PMC12264017 50. Mastrantoni L. Beccia V. Caira G. Trovato G. Calegari M.A. Basso M. Salvatore L. Pozzo C. Tortora G. Bria E. Maintenance strategies after anti-EGFR-based induction in metastatic colorectal cancer: A systematic review and bayesian network meta-analysis Crit. Rev. Oncol. Hematol. 2023 191 104106 10.1016/j.critrevonc.2023.104106 37659764 51. Passaro A. Wang J. Wang Y. Lee S.-H. Melosky B. Shih J.-Y. Wang J. Azuma K. Juan-Vidal O. Cobo M. Amivantamab plus chemotherapy with and without lazertinib in EGFR-mutant advanced NSCLC after disease progression on osimertinib: Primary results from the phase III MARIPOSA-2 study Ann. Oncol. 2024 35 77 90 10.1016/j.annonc.2023.10.117 37879444 52. Pulito C. Cristaudo A. Porta CLa Zapperi S. Blandino G. Morrone A. Strano S. Oral mucositis: The hidden side of cancer therapy J. Exp. Clin. Cancer Res. 2020 39 210 10.1186/s13046-020-01715-7 33028357 PMC7542970 53. Lacouture M.E. Anadkat M.J. Bensadoun R.-J. Bryce J. Chan A. Epstein J.B. Eaby-Sandy B. Murphy B.A. Clinical practice guidelines for the prevention and treatment of EGFR inhibitor-associated dermatologic toxicities Support. Care Cancer 2011 19 1079 1095 10.1007/s00520-011-1197-6 21630130 PMC3128700 54. Ezeoke C.C. Morley J.E. Pathophysiology of anorexia in the cancer cachexia syndrome J. Cachexia Sarcopenia Muscle 2015 6 287 302 10.1002/jcsm.12059 26675762 PMC4670736 55. Bailly C. Irinotecan: 25 years of cancer treatment Pharmacol. Res. 2019 148 104398 10.1016/j.phrs.2019.104398 31415916 56. Van Cutsem E. Köhne C.-H. Hitre E. Zaluski J. Chang Chien C.-R. Makhson A. D’Haens G. Pintér T. Lim R. Bodoky G. Cetuximab and Chemotherapy as Initial Treatment for Metastatic Colorectal Cancer N. Engl. J. Med. 2009 360 1408 1417 10.1056/NEJMoa0805019 19339720 57. Mastrantoni L. Chiaravalli M. Spring A. Beccia V. Di Bello A. Bagalà C. Bensi M. Barone D. Trovato G. Caira G. Comparison of first-line chemotherapy regimens in unresectable locally advanced or metastatic pancreatic cancer: A systematic review and Bayesian network meta-analysis Lancet Oncol. 2024 25 1655 1665 10.1016/S1470-2045(24)00511-4 39542008 58. Gourgou-Bourgade S. Bascoul-Mollevi C. Desseigne F. Ychou M. Bouché O. Guimbaud R. Bécouarn Y. Adenis A. Raoul J.-L. Boige V. Impact of FOLFIRINOX Compared With Gemcitabine on Quality of Life in Patients With Metastatic Pancreatic Cancer: Results From the PRODIGE 4/ACCORD 11 Randomized Trial J. Clin. Oncol. 2013 31 23 29 10.1200/JCO.2012.44.4869 23213101 59. Bossi P. Antonuzzo A. Cherny N.I. Rosengarten O. Pernot S. Trippa F. Schuler U. Snegovoy A. Jordan K. Ripamonti C.I. Diarrhoea in adult cancer patients: ESMO Clinical Practice Guidelines Ann. Oncol. 2018 29 iv126 iv142 10.1093/annonc/mdy145 29931177 60. Martins F. Sofiya L. Sykiotis G.P. Lamine F. Maillard M. Fraga M. Shabafrouz K. Ribi C. Cairoli A. Guex-Crosier Y. Adverse effects of immune-checkpoint inhibitors: Epidemiology, management and surveillance Nat. Rev. Clin. Oncol. 2019 16 563 580 10.1038/s41571-019-0218-0 31092901 61. Som A. Mandaliya R. Alsaadi D. Farshidpour M. Charabaty A. Malhotra N. Mattar M.C. Immune checkpoint inhibitor-induced colitis: A comprehensive review World J. Clin. Cases 2019 7 405 418 10.12998/wjcc.v7.i4.405 30842952 PMC6397821 62. Giesler S. Riemer R. Lowinus T. Zeiser R. Immune-mediated colitis after immune checkpoint inhibitor therapy Trends Mol. Med. 2025 31 265 280 10.1016/j.molmed.2024.09.009 39477757 63. Chan A.K.Y. Tamrakar M. Jiang C.M. Lo E.C.M. Leung K.C.M. Chu C.-H. Common Medical and Dental Problems of Older Adults: A Narrative Review Geriatrics 2021 6 76 10.3390/geriatrics6030076 34449647 PMC8395714 64. Mastrantoni L. Garufi G. Di Monte E. Maliziola N. Pasqualoni M. Pontolillo L. Pannunzio S. Cannizzaro M.C. Di Bello A. Fabi A. Adjuvant denosumab in early breast cancer: A systematic review and meta-analysis of randomized controlled clinical trials Ther. Adv. Med. Oncol. 2023 15 17588359231173180 10.1177/17588359231173180 37284523 PMC10240867 65. Breast Cancer Trialists E. Group C. Adjuvant bisphosphonate treatment in early breast cancer: Meta-analyses of individual patient data from randomised trials Lancet 2015 386 1353 1361 10.1016/s0140-6736(15)60908-4 26211824 66. Eisen A. Somerfield M.R. Accordino M.K. Blanchette P.S. Clemons M.J. Dhesy-Thind S. Dillmon M.S. D’Oronzo S. Fletcher G.G. Frank E.S. Use of Adjuvant Bisphosphonates and Other Bone-Modifying Agents in Breast Cancer: ASCO-OH (CCO) Guideline Update J. Clin. Oncol. 2022 40 787 800 10.1200/JCO.21.02647 35041467 67. Smith M.R. Saad F. Egerdie B. Sieber P.R. Tammela T.L.J. Ke C. Leder B.Z. Goessl C. Sarcopenia During Androgen-Deprivation Therapy for Prostate Cancer J. Clin. Oncol. 2012 30 3271 3276 10.1200/JCO.2011.38.8850 22649143 PMC3434987 68. Maggiore R.J. Gross C.P. Hurria A. Polypharmacy in Older Adults with Cancer Oncologist 2010 15 507 522 10.1634/theoncologist.2009-0290 20418534 PMC3227983 69. Bandidwattanawong C. Rattanaserikulchai P. Jetsadavanit N. Polypharmacy and potentially-inappropriate medications are prevalent in the elderly cancer patients receiving systemic cancer therapy and they co-relate with adverse outcomes BMC Geriatr. 2023 23 775 10.1186/s12877-023-04471-3 38012569 PMC10680314 70. Kramer C.S. Groenendijk I. Beers S. Wijnen H.H. van de Rest O. de Groot L.C. The Association between Malnutrition and Physical Performance in Older Adults: A Systematic Review and Meta-Analysis of Observational Studies Curr. Dev. Nutr. 2022 6 nzac007 10.1093/cdn/nzac007 35415390 PMC8989279 71. Deutz N.E.P. Bauer J.M. Barazzoni R. Biolo G. Boirie Y. Bosy-Westphal A. Cederholm T. Cruz-Jentoft A. Krznariç Z. Nair K.S. Protein intake and exercise for optimal muscle function with aging: Recommendations from the ESPEN Expert Group Clin. Nutr. 2014 33 929 936 10.1016/j.clnu.2014.04.007 24814383 PMC4208946 72. Mustian K.M. Griggs J.J. Morrow G.R. McTiernan A. Roscoe J.A. Bole C.W. Atkins J.N. Issell B.F. Exercise and side effects among 749 patients during and after treatment for cancer: A University of Rochester Cancer Center Community Clinical Oncology Program Study Support. Care Cancer 2006 14 732 741 10.1007/s00520-005-0912-6 16482444 73. Mustian K.M. Sprod L.K. Palesh O.G. Peppone L.J. Janelsins M.C. Mohile S.G. Carroll J. Exercise for the Management of Side Effects and Quality of Life Among Cancer Survivors Curr. Sports Med. Rep. 2009 8 325 330 10.1249/JSR.0b013e3181c22324 19904073 PMC2875185 74. Sprod L.K. Mohile S.G. Demark-Wahnefried W. Janelsins M.C. Peppone L.J. Morrow G.R. Lord R. Gross H. Mustian K.M. Exercise and cancer treatment symptoms in 408 newly diagnosed older cancer patients J. Geriatr. Oncol. 2012 3 90 97 10.1016/j.jgo.2012.01.002 22712028 PMC3376161 75. Mustian K.M. Morrow G.R. Carroll J.K. Figueroa-Moseley C.D. Jean-Pierre P. Williams G.C. Integrative Nonpharmacologic Behavioral Interventions for the Management of Cancer-Related Fatigue Oncologist 2007 12 52 67 10.1634/theoncologist.12-S1-52 17573456 76. Schmitz K.H. Courneya K.S. Matthews C. Demark-Wahnefried W. Galvão D.A. Pinto B.M. Irwin M.L. Wolin K.Y. Segal R.J. Lucia A. American College of Sports Medicine Roundtable on Exercise Guidelines for Cancer Survivors Med. Sci. Sports Exerc. 2010 42 1409 1426 10.1249/MSS.0b013e3181e0c112 20559064 77. Courneya K.S. Vardy J.L. O’Callaghan C.J. Gill S. Friedenreich C.M. Wong R.K.S. Dhillon H.M. Coyle V. Chua N.S. Jonker D.J. Structured Exercise after Adjuvant Chemotherapy for Colon Cancer N. Engl. J. Med. 2025 393 13 25 10.1056/NEJMoa2502760 40450658 78. Loprinzi C.L. Schaid D.J. Dose A.M. Burnham N.L. Jensen M.D. Body-composition changes in patients who gain weight while receiving megestrol acetate J. Clin. Oncol. 1993 11 152 154 10.1200/JCO.1993.11.1.152 8418227 79. Ruiz Garcia V. López-Briz E. Carbonell Sanchis R. Gonzalvez Perales J.L. Bort-Martí S. Megestrol acetate for treatment of anorexia-cachexia syndrome Cochrane Database Syst. Rev. 2013 2019 CD004310 10.1002/14651858.CD004310.pub3 PMC6418472 23543530 80. Ruiz-García V. López-Briz E. Carbonell-Sanchis R. Bort-Martí S. Gonzálvez-Perales J.L. Megestrol acetate for cachexia–anorexia syndrome. A systematic review J. Cachexia Sarcopenia Muscle 2018 9 444 452 10.1002/jcsm.12292 29542279 PMC5989756 81. Lim Y.L. Teoh S.E. Yaow C.Y.L. Lin D.J. Masuda Y. Han M.X. Yeo W.S. Ng Q.X. A Systematic Review and Meta-Analysis of the Clinical Use of Megestrol Acetate for Cancer-Related Anorexia/Cachexia J. Clin. Med. 2022 11 3756 10.3390/jcm11133756 35807039 PMC9267332 82. Taniguchi J. Mikura S. da Silva Lopes K. The efficacy and safety of anamorelin for patients with cancer-related anorexia/cachexia syndrome: A systematic review and meta-analysis Sci. Rep. 2023 13 15257 10.1038/s41598-023-42446-x 37709824 PMC10502008 83. Wolf J. Rose-John S. Garbers C. Interleukin-6 and its receptors: A highly regulated and dynamic system Cytokine 2014 70 11 20 10.1016/j.cyto.2014.05.024 24986424 84. Puppa M.J. Murphy E.A. Fayad R. Hand G.A. Carson J.A. Cachectic skeletal muscle response to a novel bout of low-frequency stimulation J. Appl. Physiol. 2014 116 1078 1087 10.1152/japplphysiol.01270.2013 24610533 PMC4035786 85. Gordon B.S. Kelleher A.R. Kimball S.R. Regulation of muscle protein synthesis and the effects of catabolic states Int. J. Biochem. Cell Biol. 2013 45 2147 2157 10.1016/j.biocel.2013.05.039 23769967 PMC3759561 86. Suzuki H. Asakawa A. Amitani H. Nakamura N. Inui A. Cancer cachexia—Pathophysiology and management J. Gastroenterol. 2013 48 574 594 10.1007/s00535-013-0787-0 23512346 PMC3698426 87. Egerman M.A. Glass D.J. Signaling pathways controlling skeletal muscle mass Crit. Rev. Biochem. Mol. Biol. 2014 49 59 68 10.3109/10409238.2013.857291 24237131 PMC3913083 88. Narsale A.A. Carson J.A. Role of interleukin-6 in cachexia Curr. Opin. Support. Palliat. Care 2014 8 321 327 10.1097/SPC.0000000000000091 25319274 PMC4323347 89. Malta F.A.P.S. Estadella D. Gonçalves D.C. The role of omega 3 fatty acids in suppressing muscle protein catabolism: A possible therapeutic strategy to reverse cancer cachexia? J. Funct. Foods 2019 54 1 12 10.1016/j.jff.2018.12.033 90. Muscaritoli M. Arends J. Bachmann P. Baracos V. Barthelemy N. Bertz H. Bozzetti F. Hütterer E. Isenring E. Kaasa S. ESPEN practical guideline: Clinical Nutrition in cancer Clin. Nutr. 2021 40 2898 2913 10.1016/j.clnu.2021.02.005 33946039 91. Struja T. Wolski W. Schapbach R. Mueller B. Laczko E. Schuetz P. Association of metabolomic markers and response to nutritional support: A secondary analysis of the EFFORT trial using an untargeted metabolomics approach Clin. Nutr. 2021 40 5062 5070 10.1016/j.clnu.2021.07.029 34455264 92. Li D. Sun C.-L. Kim H. Soto-Perez-de-Celis E. Chung V. Koczywas M. Fakih M. Chao J. Cabrera Chien L. Charles K. Geriatric Assessment–Driven Intervention (GAIN) on Chemotherapy-Related Toxic Effects in Older Adults With Cancer JAMA Oncol. 2021 7 e214158 10.1001/jamaoncol.2021.4158 34591080 PMC8485211 93. Zhang Z. Zhu Y. Ling Y. Zhang L. Wan H. Comparative effects of different enteral feeding methods in head and neck cancer patients receiving radiotherapy or chemoradiotherapy: A network meta-analysis OncoTargets Ther. 2016 2016 2897 2909 10.2147/OTT.S101983 PMC4876095 27274283 94. Mcluskie A. Bowers M. Bayly J. Yule M.S. Maddocks M. Fallon M. Skipworth R.J. Laird B.J.A. Nutritional interventions in randomised clinical trials for people with incurable solid cancer: A systematic review Clin. Nutr. 2025 44 201 219 10.1016/j.clnu.2024.12.008 39708462 95. Marconcin P. Marques A. Ferrari G. Gouveia É.R. Peralta M. Ihle A. Impact of Exercise Training on Depressive Symptoms in Cancer Patients: A Critical Analysis Biology 2022 11 614 10.3390/biology11040614 35453813 PMC9031941 96. Giordano G. Mastrantoni L. Terranova R. Colloca G.F. Zuccalà G. Landi F. The role of Mediterranean diet in cancer incidence and mortality in the older adults npj Aging 2024 10 61 10.1038/s41514-024-00186-w 39639020 PMC11621705 97. Solheim T.S. Laird B.J.A. Balstad T.R. Stene G.B. Bye A. Johns N. Pettersen C.H. Fallon M. Fayers P. Fearon K. A randomized phase II feasibility trial of a multimodal intervention for the management of cachexia in lung and pancreatic cancer J. Cachexia Sarcopenia Muscle 2017 8 778 788 10.1002/jcsm.12201 28614627 PMC5659068 98. Hustad K.S. Koteng L.H. Urrizola A. Arends J. Bye A. Dajani O. Deliens L. Fallon M. Hjermstad M.J. Kohlen M. Practical cancer nutrition, from guidelines to clinical practice: A digital solution to patient-centred care ESMO Open 2025 10 104529 10.1016/j.esmoop.2025.104529 40179818 PMC11998113 nutrients-17-02928-t001_Table 1 Table 1 Prevalence and clinical impact of nutrition-related conditions in older adults with cancer. Condition Definition (Criteria) Prevalence in Older Adults with Cancer Clinical Impact (Associated Outcomes) Malnutrition Chronic undernutrition resulting in weight loss or low BMI; inadequate calorie/protein intake (GLIM criteria: >5% weight loss or BMI) [ 6 From 30 to 60% overall; up to 80% in high-risk groups (as advanced GI cancers) [ 4 Increases chemotherapy toxicity and interruptions; postoperative complications (infections, poor wound healing). Sarcopenia Age or disease-related loss of skeletal muscle mass and strength (e.g., low muscle mass on CT or BIA plus low grip strength or gait speed per EWGSOP2 criteria) [ 13 21 Variable (definition-dependent). Increases chemotherapy dose-limiting toxicities (altered drug distribution); surgical complications (e.g., infections); and longer recovery. Cachexia Multifactorial wasting syndrome due to disease (e.g., cancer) characterized by involuntary weight loss > 5% (or >2% if BMI Approximately 50% of all cancer patients develop cachexia; prevalence is 50–80% in advanced or metastatic cancers (especially pancreatic, gastric, lung). Directly causes ~20% of cancer deaths; leads to profound weakness and functional decline; poor tolerance of chemo/radiotherapy (cachectic patients often cannot complete treatment); refractoriness to nutritional support (difficulty reversing weight loss); reduction of QoL (high symptom burden: pain, fatigue, early satiety). Cachexia indicates poor prognosis and often signals limited survival time. Frailty Geriatric syndrome of increased vulnerability can be defined by Frailty Phenotype (≥3 of weight loss, exhaustion, weakness, slowness, low activity) or Frailty Index (accumulation of deficits) [ 16 Approximately 20–40% classified as frail among older cancer patients; another 30–40% prefrail. Prevalence varies by tool and population (frailty higher in advanced disease and in patients > 80). Increases adverse events from treatment (chemo toxicity, surgical complications, delirium), risk of unplanned hospitalization, and longer hospital stay. nutrients-17-02928-t002_Table 2 Table 2 Nutritional assessment tools in older cancer patients. Tool Type Content/Parameters Scoring Strengths Limitations Geriatric 8 (G8) [ 31 Screening 8 items (nutrition, mobility, neuropsychology, polypharmacy, self-rated health, age) 0–17 (≤14 = risk) Quick (<5 min), recommended by SIOG, sensitive Requires CGA if ≤ 14 Mini Nutritional Assessment - Short Form (MNA-SF) [ 34 Screening Food intake, weight loss, mobility, acute stress, neuropsychological problems, BMI 0–14 (<12 = risk) Validated in elderly, easy to use Not cancer-specific; confirmation with GLIM needed Patient-Generated Subjective Global Assessment (PG-SGA) [ 36 Assessment Weight history, food intake, symptoms (e.g., anorexia, pain), functional capacity + clinical exam Global rating (A/B/C classes) + Numeric score (≥9 = urgent intervention) Oncology gold standard, incorporates both patient-reported and clinician-evaluated components incorporates both patient-reported and clinician-evaluated components Time-intensive, often requires dietitian involvement Controlling Nutritional Status (CONUT) [ 38 39 41 44 Screening Serum albumin, lymphocyte count, total cholesterol levels 0–12 Lab-based, simple Affected by inflammation/infection Geriatric Nutritional Risk Index (GNRI) [ 42 Prognostic Index Calculated from weight and albumin Typical: 60–120 Easy to compute Requires ideal weight, affected by edema/ascites ",
  "metadata": {
    "Title of this paper": "Practical cancer nutrition, from guidelines to clinical practice: A digital solution to patient-centred care",
    "Journal it was published in:": "Nutrients",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473124/"
  }
}