{
  "title": "Paper_62",
  "abstract": "pmc Oncoimmunology Oncoimmunology 1816 oncoimmun Oncoimmunology 2162-4011 2162-402X Taylor & Francis PMC12489990 PMC12489990.1 12489990 12489990 41029175 10.1080/2162402X.2025.2564734 2564734 1 Version of Record Article Commentary Article Commentary Selective serotonin reuptake inhibitors enhance cancer immunosurveillance by pleiotropic mechanisms K. ALVAREZ-VALADEZ ET AL. ONCOIMMUNOLOGY https://orcid.org/0000-0002-6276-8010 Alvarez-Valadez Karla a Conceptualization Validation Visualization Writing – review & editing https://orcid.org/0000-0002-9334-4405 Kroemer Guido a b c Conceptualization Funding acquisition Project administration Supervision Validation Visualization Writing – original draft Writing – review & editing https://orcid.org/0000-0003-4893-6505 Djavaheri-Mergny Mojgan a * Conceptualization Funding acquisition Project administration Supervision Validation Writing – original draft Writing – review & editing a Team Metabolism, Cancer & Immunity, Centre de Recherche des Cordeliers, INSERM UMRS1138, Sorbonne Université, Université de Paris Cité, Institut Universitaire de France Paris France b INSERM US23/CNRS UAR 3655, Metabolomics and Cell Biology Platforms, Institut Gustave Roussy, Université Paris-Saclay Villejuif France c Department of Biology, Institut du Cancer Paris CARPEM, Hôpital Européen Georges Pompidou, AP-HP Paris France CONTACT mojgan.mergny@inserm.fr Team Metabolism, Cancer & Immunity, Centre de Recherche des Cordeliers, INSERM UMRS1138, Sorbonne Université, Université de Paris Cité, Institut Universitaire de France France 30 9 2025 2025 14 1 476837 2564734 30 09 2025 03 10 2025 03 10 2025 4 9 2025 15 9 2025 17 9 2025 MPS 29 9 2025 © 2025 The Author(s). Published with license by Taylor & Francis Group, LLC. 2025 The Author(s) https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial License ( http://creativecommons.org/licenses/by-nc/4.0/ ABSTRACT In a recent paper published in Cell + Keywords Antitumor immunity immunogenic cell death antidepressant T cells tumor microenvironment Institut Universitaire de France 10.13039/501100004795 the RHUs Immunolife and LUCA-pi INCa (PLBIO23-216-2023-181) Agence Nationale de la Recherche (ANR-21-CE44-0016, ANR-23-CE13-0013 (JANUS) the Ligue contre le Cancer (équipe labellisée); the Ligue contre le Cancer Mexican National Council of Science and Technology INCa PLBIO (PLBIO23-216-2023-181) Fondation pour la Recherche Médicale Hevolution Network on Senescence in Aging Canceropôle Île-de-France Association pour la recherche sur le cancer (ARC) Agence National de la Recherche (ANR-22-CE14-0066 VIVORUSH, ANR-23-CE44-0030 COPPERMAC, ANR-23-R4HC-0006 Ener-LIGHT National support managed by the Agence Nationale de la Recherche under the France 2030 programme European Union Horizon 2020 research and innovation programss Oncobiome The ERA4 Health Cardinoff Grant Ener-LIGHT European Research Council Advanced Investigator Award PAIR-Obésité INCa_18713 IdEx Université de Paris Cité ANR-18-IDEX-0001 SIRIC Cancer Research and Personalized Medicine Institut National du Cancer (INCa Seerave Foundation 10.13039/100015545 K.A-V. is supported by a post-doctoral fellowship from INCa PLBIO (PLBIO23-216-2023-181), the Mexican National Council of Science and Technology (CONACYT, funding #757821), and by the Ligue contre le Cancer (IP/SC-17519). M.D-M. is supported by funds from the Institut National de la Santé et de la Recherche Médicale (Inserm) and grants from the Agence Nationale de la Recherche (ANR-21-CE44-0016 (CISCO), ANR-23-CE13-0013 (JANUS), INCa (PLBIO23-216-2023-181). G.K. is supported by the Ligue contre le Cancer (équipe labellisée); Agence National de la Recherche (ANR-22-CE14-0066 VIVORUSH, ANR-23-CE44-0030 COPPERMAC, ANR-23-R4HC-0006 Ener-LIGHT); Association pour la recherche sur le cancer (ARC); Cancéropôle Ile-de-France; Fondation pour la Recherche Médicale (FRM); European Research Council Advanced Investigator Award (ERC-2021-ADG, Grant No. 101052444; project acronym: ICD-Cancer, project title: Immunogenic cell death (ICD) in the cancer-immune dialog); The ERA4 Health Cardinoff Grant Ener-LIGHT; European Union Horizon 2020 research and innovation programs Oncobiome (grant agreement number: 825410, Project Acronym: ONCOBIOME, Project title: Gut OncoMicrobiome Signatures [GOMS] associated with cancer incidence, prognosis and prediction of treatment response, Prevalung (grant agreement number 101095604, Project Acronym: PREVALUNG EU, project title: Biomarkers affecting the transition from cardiovascular disease to lung cancer: towards stratified interception), Neutrocure (grant agreement number 861878: Project Acronym: Neutrocure; project title: Development of “smart” amplifiers of reactive oxygen species specific to aberrant polymorphonuclear neutrophils for treatment of inflammatory and autoimmune diseases, cancer and myeloablation); National support managed by the Agence Nationale de la Recherche under the France 2030 program (reference number 21-ESRE-0028, ESR/Equipex + Onco-Pheno-Screen); Hevolution Network on Senescence in Aging (reference HF-E Einstein Network); Institut National du Cancer (INCa); Institut Universitaire de France; PAIR-Obésité INCa_18713, the RHUs Immunolife and LUCA-pi (ANR-21-RHUS-0017 and ANR-23-RHUS−0010, both dedicated to France Relance 2030); Seerave Foundation; SIRIC Cancer Research and Personalized Medicine (CARPEM, SIRIC CARPEM INCa-DGOS-Inserm-ITMO Cancer_18006 supported by Institut National du Cancer, Ministère des Solidarités et de la Santé and INSERM). This study contributes to the IdEx Université de Paris Cité ANR-18-IDEX-0001. ((ANR-21-CE44-0016, ANR-23-CE13-0013 (JANUS)) (Canceropôle Île-de-France) (National support managed by the Agence Nationale de la Recherche under the France 2030 programme) (European Union Horizon 2020 research and innovation programss Oncobiome) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Serotonin (5-hydroxytryptamine, 5-HT) is a well-known neurotransmitter in the central nervous system, where it regulates various neuropsychological functions such as mood and behavior. The dysregulation of the serotonin axis in the brain is linked to psychiatric disorders like depression. This has led to the development of numerous antidepressants that target the serotonergic system. 1 , 2 The intracellular and extracellular levels of serotonin, as well as its biological effects, are regulated by a molecular network that coordinates the synthesis, degradation, secretion, and reuptake of serotonin, as well as its binding to 5-HT receptors (5-HTRs). The latter play a key role in transmitting signals such as T-cell receptor (TCR) signaling in T cells. 3 4 Beyond its classical role as a neurotransmitter, which by definition involves neuron-to-neuron communication in synaptic clefts, serotonin can also serve as a peripheral hormone, a growth factor, or a vasoactive agent, highlighting its broad role as an extracellular mediator that regulates several physiological processes. 2 The pro-cancer properties of serotonin have been recognized for many years and several serotonergic-targeted elements have demonstrated promising anticancer effects across a variety of tumor cell types. 3 , 5 , 6 3 The use of SSRIs antidepressants, especially sertraline, citalopram and fluoxetine, is associated with a lower risk of cancer morbidity and mortality in the UK Biobank. 7 8 While these findings underscore the antitumor effects of SSRIs in a broad range of cancer cell types, several questions have remained unanswered.  • What are the exact targets and mechanisms of action of SSRIs in cancer cells, and to what extent are these mechanisms dependent on or independent of the serotonergic axis? • Do SSRIs impact the tumor microenvironment (TME)? • What is the effect of SSRIs on the dialogue between the immune and cancer cells? Recent studies, including our own, explored these critical questions and compiled evidence indicating that several SSRIs stimulate cancer immunosurveillance through multiple pathways ( Table 1 Table 1. Selective serotonin reuptake inhibitors (SSRIs) in antitumor immunity. SSRI Dose / administration mode Biological model SSRI effects Proposed mechanism Ref.  Citalopram Citalopram: 30 mg/kg/d Cells: B16-F10, B16-OVA, MC38, CT26, MB49, 4T1. ↑ CD8 + + + Accumulation of intratumoral serotonin, thereby activating the 5-HTR-MAPK-TCR signaling pathway and enhancing CD8 + [ 9  Citalopram 5 mg/kg/d; i.p. injections daily for 30 d after bearing palpable tumors Cells: Hepa1-6, Hep53.4 -/- ↑ CD8 + Stimulation of TAM phagocytic activity by targeting C5aR1 on TAM. + [ 18  Fluoxetine 20 mg/kg/d; oral, Cells: MC38, Panc02 Inhibition of tumor growth. Fluoxetine induces increased infiltration of CD8 + [ 10  Fluoxetine 5, 10 and 20 mg/kg/d; i.p. injections daily for 21 d, starting 7 d after tumor Cells: S180 ↑ CD4 + + + + + + + Reduction of immunosuppressive myeloid cells and inflammatory mediators. Enhancing the number and function of effector T cells. [ 14  Fluoxetine 15 mg/kg/d; oral, Cells: LBC T-cell lymphoma d ↑ CD8 + + T-cell-mediated antitumor immunity, disruption of cell cycle in tumor cells and induction of apoptosis. [ 15  Fluoxetine 10 mg/kg; oral, Cells: BMDM and PBDNs Reduction of liver metastasis of NE cancers. Repression of histone serotonylation and the formation of neutrophil extracellular traps (NETs). [ 19  Fluvoxamine 100, 200 and 400 μg/mouse; Cells: CT‐26 ↑ CD4 + + Induction of apoptosis in cancer cells. Attraction of CD4 + + [ 17  Sertraline 10 mg/kg; i.p. injection, Cells: MCA205 and B16-F10 CD4 + + ICD induction through lysosomal cholesterol accumulation and a lysosomal damage-dependent mechanism. Identification of NPC1 and NPC2 as potential targets of sertraline. [ 11  Sertraline 30 mg/kg; administration Cells: EL4 ↑ CD8 + + Sertraline reduces the elevated levels of 5-HT observed in the serum of mice subjected to chronic stress. [ 16 Abbreviations: 5-HT: 5-hydroxytryptamine; 5-HTRs: 5-hydroxytryptamine receptors; C5aR1: complement component 5a receptor 1; FOXP3: forkhead box P3; GzmB: granzyme B; ICD: immunogenic cell death; IFN- γ: interferon gamma; I.P.: intraperitoneal; NE: neuroendocrine; NETs: neutrophil extracellular traps; NPC1: NPC intracellular cholesterol transporter 1; NPC2: NPC intracellular cholesterol transporter 2; PD-1: programmed cell death protein 1; PD-L1: programmed death ligand 1; SSRI: selective serotonin reuptake inhibitor; TAM: tumor-associated macrophages; TCF1: T-cell factor 1; Th17: T helper 17; TNF-α: tumor necrosis factor alpha; Tregs: regulatory T cells. In a recent paper published in Cell + 9 + + + The study of M.A Schneider et al. also reported the negative regulation of CD8 + 10 + + In a recent study, we uncovered a tumor-intrinsic mechanism by which the SSRI sertraline (the most widely used antidepressant in the world) triggers cancer immunosurveillance. 11 12 , 13 CD8 + Table 1 14–18 + 14 In a recent study, K. Liu et al. explored the crosstalk between neutrophil granulocytes and the serotonin axis in neuroendocrine prostate cancer (NEPC). 19 In another study, F. Dong et al. revealed multiple immunomodulatory roles of the SSRI antidepressant citalopram that involve the regulation of both tumor-associated macrophages (TAMs) and CD8 + 18 + 18 high 20 Altogether, the above-mentioned studies shed light on multiple cancer cell-intrinsic and extrinsic mechanisms that may explain how SSRIs elicit antitumor immunity. These mechanisms include the induction of ICD in cancer cells; the stimulation of both T cells and TAM, and the reduction of immunosuppressive myeloid cells within the TME. These effects are mediated by the serotonergic axis (e.g., SERT, 5-HT receptors), non-serotonergic targets (e.g., such as C5aR1, GLUT1 and NPC1/NPC2), or a combination of both. Moreover, a synergistic effect between certain SSRIs and immune checkpoint inhibitors (ICI) targeting the PD-1/PD-L1 interaction has been observed in several cancer types ( Table 1 9 , 10 , 21 Disclosure of potential conflicts of interest G.K. has been holding research contracts with Daiichi Sankyo, Eleor, Kaleido, Lytix Pharma, PharmaMar, Osasuna Therapeutics, Samsara Therapeutics, Sanofi, Sutro, Tollys, and Vascage. G.K. is on the Board of Directors of the Bristol Myers Squibb Foundation France. G.K. is a scientific co-founder of everImmune, Osasuna Therapeutics, Samsara Therapeutics and Therafast Bio. G.K. is in the scientific advisory boards of Hevolution, Institut Servier, and Rejuveron Life Sciences/Centenara Labs AG. G.K. is the inventor of patents covering therapeutic targeting of aging, cancer, cystic fibrosis and metabolic disorders. Among these patents, one “Methods for weight reduction” (US11905330B1) is relevant to this study. G.K.’s brother, Romano Kroemer, was an employee of Sanofi and now consults for Boehringer-Ingelheim. G.K.'s wife, Laurence Zitvogel, has held research contracts with Glaxo Smyth Kline, Incyte, Lytix, Kaleido, Innovate Pharma, Daiichi Sankyo, Pilege, Merus, Transgene, 9 m, Tusk and Roche, was on the on the Board of Directors of Transgene, is a cofounder of everImmune, and holds patents covering the treatment of cancer and the therapeutic manipulation of the microbiota. The funders had no role in the design of the study; in the writing of the manuscript, or in the decision to publish the results. K.A-V., G.K., and M.D-M. are the inventors of the patent BIO23161 (EF23306013.6), filed on 26/06/2023 related to this study. Data availability statement Data sharing is not applicable to this article as no new data were created or analyzed in this commentary. References 1. Štrac DŠ Pivac N Mück-Šeler D The serotonergic system and cognitive function Transl Neurosci 2016 7 1 35 49 10.1515/tnsci-2016-0007 28123820 PMC5017596 2. Berger M Gray JA Roth BL The expanded biology of serotonin Annu Rev Med 2009 60 355 366 10.1146/annurev.med.60.042307.110802 19630576 PMC5864293 3. Karmakar S Lal G Role of serotonin receptor signaling in cancer cells and anti-tumor immunity Theranostics 2021 11 11 5296 5312 10.7150/thno.55986 33859748 PMC8039959 4. Bader M Serotonylation: serotonin signaling and epigenetics Front Mol Neurosci 2019 12 288 10.3389/fnmol.2019.00288 31824263 PMC6881384 5. Sarrouilhe D Mesnil M Serotonin and human cancer: a critical view Biochimie 2019 161 46 50 10.1016/j.biochi.2018.06.016 29936294 6. Chen L Huang S Wu X He W Song M Serotonin signalling in cancer: emerging mechanisms and therapeutic opportunities. Clin Transl Med 2024 14 7 e1750 10.1002/ctm2.1750 38943041 PMC11213692 7. Ma Y He J Li C-Y Liu F-B Wang Y-G Song F-J Effect of antidepressants use on cancer morbidity and mortality: a propensity score-matched longitudinal cohort study. J Affect Disord 2025 387 119554 10.1016/j.jad.2025.119554 40449745 8. Magagnoli J Narendran S Pereira F Cummings TH Hardin JW Sutton SS Ambati J Association between fluoxetine use and overall survival among patients with cancer treated with PD-1/L1 immunotherapy Pharmaceuticals (Basel) 2023 16 5 640 10.3390/ph16050640 37242422 PMC10220705 9. Li B Elsten-Brown J Li M Zhu E Li Z Chen Y Kang E Ma F Chiang J Li Y-R et al. Serotonin transporter inhibits antitumor immunity through regulating the intratumoral serotonin axis. Cell 2025 188 14 3823 3842.e21 10.1016/j.cell.2025.04.032 40403728 PMC12255530 10. Schneider MA Heeb L Beffinger MM Pantelyushin S Linecker M Roth L Lehmann K Ngethüm U Kobold S Graf R et al. Attenuation of peripheral serotonin inhibits tumor growth and enhances immune checkpoint blockade therapy in murine tumor models. Sci Transl Med 2021 13 611 eabc8188 10.1126/scitranslmed.abc8188 34524861 11. Alvarez-Valadez K Sauvat A Diharce J Leduc M Stoll G Guittat L Lambertucci F Paillet J Motiño O Ferret L et al. Lysosomal damage due to cholesterol accumulation triggers immunogenic cell death Autophagy 2024 21 1 23 10.1080/15548627.2024.2440842 39663580 PMC12013445 12. Galluzzi L Vitale I Warren S Adjemian S Agostinis P Martinez AB Chan TA Coukos G Demaria S Deutsch E et al. Consensus guidelines for the definition, detection and interpretation of immunogenic cell death J Immunother Cancer 2020 8 1 e000337 10.1136/jitc-2019-000337 32209603 PMC7064135 13. Kroemer G Galassi C Zitvogel L Galluzzi L Immunogenic cell stress and death Nat Immunol 2022 23 4 487 500 10.1038/s41590-022-01132-2 35145297 14. Mahanti K Saha J Sarkar D Pramanik A Das D Mondal P Mahato M Bhattacharyya S Selective serotonin reuptake inhibitor fluoxetine alters gene expression patterns of sarcoma and significantly reduces tumor load through modulation of the tumor microenvironment and restoration of the host antitumor immune system ACS Pharmacol Transl Sci 2025 8 7 2132 2152 10.1021/acsptsci.5c00199 40672680 PMC12260934 15. Frick LR Rapanelli M Arcos MLB Cremaschi GA Genaro AM Oral administration of fluoxetine alters the proliferation/apoptosis balance of lymphoma cells and up-regulates T cell immunity in tumor-bearing mice. Eur J Pharmacol 2011 659 2–3 265 72 10.1016/j.ejphar.2011.03.037 21497159 16. Zhou S Ye D Xia H Xu H Tang W Tang Q Bi F Sertraline inhibits stress-induced tumor growth through regulating CD8 + T cell-mediated anti-tumor immunity. Anticancer Drugs 2022 33 9 935 942 10.1097/CAD.0000000000001383 36066403 17. Wei P Jia H Li R Zhang C Guo S Wei S Sun K Cheng S Cui T Huang J et al. Fluvoxamine prompts the antitumor immune effect via inhibiting the PD-L1 expression on mice-burdened colon tumor Cell Biol Int 2023 47 2 439 450 10.1002/cbin.11936 36259746 18. Dong F Zhang S Song K Jiang L Hu L-P Li Q Zhang X-L Li J Feng M Cai Z-W et al. Citalopram exhibits immune-dependent anti-tumor effects by modulating C5aR1+ TAMs and CD8+ T cells eLife 2025 14. 10.7554/eLife.103016.1 19. Liu K Zhang Y Du G Chen X Xiao L Jiang L Jing N Xu P Zhao C Liu Y et al. 5-HT orchestrates histone serotonylation and citrullination to drive neutrophil extracellular traps and liver metastasis. J Clin Invest 2025 135 8 e183544 10.1172/JCI183544 39903533 PMC11996869 20. Dong F He K Zhang S Song K Jiang L Hu L-P Li Q Zhang X-L Zhang N Li B-T et al. SSRI antidepressant citalopram reverses the Warburg effect to inhibit hepatocellular carcinoma by directly targeting GLUT1. Cell Rep 2024 43 10 114818 10.1016/j.celrep.2024.114818 39388353 21. Jing Q Nie Y Zhang X Zhu L Gui H Li L Wang C Chen S Wang M Yuan H et al. Antidepressants combined with immunotherapy for cancer treatment Biomed J Sci Tech Res 2022 47 3 38552 38556 10.26717/BJSTR.2022.47.007510 ",
  "metadata": {
    "Title of this paper": "Antidepressants combined with immunotherapy for cancer treatment",
    "Journal it was published in:": "Oncoimmunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489990/"
  }
}