{
  "title": "Paper_1177",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472957 PMC12472957.1 12472957 12472957 41011358 10.3390/microorganisms13092026 microorganisms-13-02026 1 Article Methods for Evaluating the Effects of 2D and 3D Culture Environment on Macrophage Response to Mycobacterium Infection Stolley Danielle L. 1 Rasaputra Komal S. 1 May Elebeoba E. 1 2 3 * Esin Semih Academic Editor 1 2 3 * emay5@wisc.edu 29 8 2025 9 2025 13 9 496716 2026 03 7 2025 02 8 2025 04 8 2025 29 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Macrophages are critical to the formation of infection- and non-infection-associated immune structures such as cancer spheroids, pathogen-, and non-pathogen-associated granulomas, contributing to the spatiotemporal and chemical immune response and eventual outcome of disease. While well established in cancer immunology, the prevalence of using three-dimensional (3D) cultures to characterize later-stage structural immune response in pathogen-associated granulomas continues to increase, generating valuable insights for empirical and computational analysis. To enable integration of data from 3D in vitro studies with the vast bibliome of standard two-dimensional (2D) tissue culture data, methods that determine concordance between 2D and 3D immune response need to be established. Focusing on macrophage migration and oxidative species production, we develop experimental and computational methods to enable concurrent spatiotemporal and biochemical characterization of 2D versus 3D macrophage–mycobacterium interaction. We integrate standard biological sampling methods, time-lapse confocal imaging, and 4D quantitative image analysis to develop a 3D ex vivo model of Mycobacterium smegmatis 2D versus 3D infection structural immune response macrophage Mycobacterium smegmatis 4D confocal imaging National Science Foundation MCB-1445470 MCB-1812455 PHY-2019745 MCB-2227598 This research was supported in part by National Science Foundation awards: MCB-1445470, MCB-1812455, PHY-2019745, and MCB-2227598. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Studies of immune response and disease often focus on chemical mediators of immunity. However, spatiotemporal dynamics of immune cells drive the formation of key structures such as spheroids and granulomas that are central to disease pathophysiology. Changes in chemical and structural immunity contribute to and determine progression and outcome of non-infectious diseases such as cancer, sarcoidosis, and infection-associated granulomatous diseases such as tuberculosis (TB) caused by Mycobacterium tuberculosis Infection-associated immune structures, the focus of this study, can occur following uptake of bacteria by primary phagocytes, triggering the production of cytokines, chemokines, and effector molecules that recruit and act on various immune cells, including neutrophils, inflammatory monocytes, interstitial macrophages, and dendritic cells, that localize to the site of infection aiding in the establishment of nascent granulomas [ 1 2 Staphylococcus aureus Burkholderia Pseudomonas cepacia Escherichia coli 3 Within the host, dissemination of bacteria can be chemically and physically constrained through a coordinated multicellular immune response that results in extracellular matrix (ECM) remodeling, biochemical regulation of cellular interactions, and cellular aggregation [ 4 5 4 6 1 7 In Vitro Models for Characterizing Granuloma Formation In vivo infection models, ranging from zebrafish, mouse, guinea pig, rabbit, to non-human primates, combined with various cell imaging modalities have been used to characterize the structure and function of mature granulomas, as well as to investigate genetic correlates of disease, co-infection (e.g., TB-HIV), and chemotherapeutic treatments [ 1 7 8 9 10 Mimics of nascent granulomas have been particularly important for investigating molecular to structural aspects of diseases like tuberculosis [ 11 12 13 14 15 16 17 18 19 15 20 21 21 The purpose of this work is to demonstrate the feasibility of developing 3D infection models that are comparable to standard 2D culture-based models with respect to ease of implementation, relative cost, and measurement of immune response and outcomes. We develop methods to address some of the challenges of 3D systems, and characterize the impact of biological variables (antibiotics, persistence and quantifiability of fluorescent signal) and engineering constraints (oxygen diffusion and optimal sampling for 3D) on construction of 3D infection models. This work also determines areas of concordance and dissonance between macrophage infection response in 2D versus 3D environments. 2. Materials and Methods 2.1. Developing and Characterizing System and Component Constraints for the Ex Vivo Infection Platform We developed and evaluated biological and engineering constraints needed for a 3D ex vivo platform that is compatible with standard 2D sampling plus downstream assay methods, permissive of mycobacterial infection models, facilitates imaging-based spatiotemporal monitoring, and extensible for higher-throughput characterization studies ( Figure 1 Supplementary Materials Section S1 M. smegmatis 22 n n 2.1.1. Determining Optimal ECM Gel Height for 3D Cell Culture To ensure balanced oxygen and nutrient diffusion, we determined ECM gel height and density constraints by taking into consideration cellular consumption rates, cell state, and duration of experiment. Using Colom et al.’s oxygen tension models (Equation (1)) for human lung epithelial cell line A549 [ 23 Table 1 Supplementary Materials Section S1 (1) h m a x = ϕ l i m i t 2 K m D G * ρ 0 V m a x e − t τ 1 \\ 2 2.1.2. mCherry M. smegmatis To ensure high correspondence between image-based data and standard biological assays, we isolated M. smegmatis Supplementary Materials Section S1, Figure S2 M. smegmatis M. smegmatis To determine the impact of the 2D and 3D environment on the bacterium, we characterized growth/death of mCherry M. smegmatis 2.1.3. Impact of Macrophage EGFP and Bacterial mCherry on Infection Response Macrophage, gfpBMDM, and b6BMDM response to mCherry M. smegmatis 25 M. smegmatis 2.2. Development of 2D and 3D Ex Vivo Model of Mycobacteria Infection High-plasmid-expressing mCherry M. smegmatis g 2 25 ® 2.2.1. Infection Studies in 2D/3D Environments The 2D ex vivo model was implemented using our standard protocol with the addition of 10 μg/mL of gentamicin in the culture media, comparable to the amount in RBM buffer. Prior studies indicated 10 μg/mL of gentamicin inhibits extracellular but not intracellular growth of M. smegmatis 26 To prevent formation of an RBM-culture plate interface void of ECM proteins we adapted Xu et al.’s protocol [ 27 2 6 n 2.2.2. Quantifying Biochemical Response Supernatant samples were collected and bacterial CFUs enumerated at 0, 12, 24, 36, 48, and 72 h post-infection. For cells in 2D [ 25 For the 3D model, hydrating supernatant was collected and 375 μL of ice-cold PBS (0–4 °C) added and vigorously pipetted to disrupt and dissolve RBM matrix. Liquefied RBM solution was collected, centrifuged (1500 RPM, 4 °C) for 10 min, and 200 μL of solution collected for downstream assays, avoiding disruption of loose RBM/cell pellets. To disrupt cells, 200 μL of 1% Triton-X 100 was added to RBM/cell pellet, incubated (20–25 °C, 5 min), vigorously pipetted, and vortexed to lyse cells and release bacteria. Lysate was serially diluted 10-fold and plated (7H11 agar plates) for CFU enumeration. Then, 2D/3D supernatants and 3D matrix lysates were stored at −80 °C until used to quantify nitric oxide (NO; Griess assay Promega™, G2930, Madison, WI, USA) and cell death (LDH cytotoxicity assay; Pierce™, 88954, Thermo Fisher Scientific, Fitchburg, WI, USA). Assays were performed in replicate according to the manufacturer’s protocol, with standards generated using gfpBMDMs and potential impact of RBM on the assay quantified ( Supplementary Materials Section S2; Figure S3, Table S7 Figure S4, Tables S8 and S9 2.3. Image-Based Quantification of Spatiotemporal Response Infected and non-infected cells (Ibidi 8-well) were incubated in a stage top system (TokaiHit, Fujinomiya, Shizuoka Japan) and imaged for 72 h using multi-area time-lapse confocal imaging (Olympus FV1200, UPLSAPO40X2 40×/0.95NA objective; Fluoview software v4.2b; Olympus, Center Valley, PA, USA). Two replicate wells were imaged per condition for each of the two independent trials. Images were acquired every 90 min for 100 μm Z-sections at 1 μm axial resolution (settings based on estimating Nyquist limit of macrophages and M. smegmatis 28 29 30 Equation (S1), Table S1A n Image Processing and Analysis Confocal images were appended over time in Olympus Fluoview software. The resulting 4D time-appended 100 μm Z-stacks were rendered and analyzed using Imaris 8.1.2 (Bitplane, Belfast, UK) with surface creation and tracking of macrophages to enable spatiotemporal monitoring and analysis of cellular immune response. Image processing parameters ( Table S1B Table 2 2.4. Image and Data Analysis 2.4.1. Data Processing and Feature Analysis in MATLAB We developed a MATLAB-based (MATLAB 2018b, MathWorks, Natick, MA, USA) pipeline for high-throughput analysis of the 4D structural immune response dataset. Using MATLAB GUIDE we developed an interface that facilitated data organization based on conditions (2D/3D, non-infected/infected), biological replicates, and hierarchical processing of 4D datasets. Variations in signal-to-noise ratio (SNR) were reduced post-acquisition using background normalization to bacterial RFP levels in the non-infected conditions [ 31 2.4.2. Statistical Analysis Where noted, log 2 32 (2) L o g 2 F C = L o g 2 X t X 0 3. Results To characterize and determine concordance of macrophage response in 3D versus 2D culture, we used a reconstituted basement membrane (RBM) to recapitulate the ECM microenvironment. We developed and used a 2D/3D ex vivo experimental and quantitative analysis platform to concurrently monitor chemical and spatial immune response during infection ( Figure 1 M. smegmatis 22 3.1. Oxygen Diffusion in 3D Cell Culture Is Sufficient to Maintain Normoxia for Cell Populations In 3D cultures sufficient oxygenation for cells in various states (infected or non-infected) is an important consideration used to determine optimal ECM gel height and density. Using Colom et al.’s oxygen tension models (Equation (1)) and based on the estimated change in maximal oxygen consumption rate (OCR) for BMDMs in RBM (5 × 10 −17 Figure S1 3.2. Fluorescent Strains Persist and Are Comparable to Wild Type in Growth and Infection Response Continuous-time spatiotemporal characterization is a differentiating advantage of non-in vivo 3D and 2D infection models. However, most image-based methods require labeled cells, with some requiring antibiotics for maintenance. Potential biological variability associated with using labeled cells was assessed to ensure similar behavior of GFP/RFP and wild-type infection models and high correspondence between image-based data and standard biological assays. 3.2.1. mCherry Growth and Fluorescence Maintained Absent Antibiotic Selection Using differential plating (CFUs, Figure 2 Table S2 Figure 2 M. smegmatis 8 M. smegmatis 3.2.2. Post-Infection Response Comparable for Fluorescent and Wild-Type Strains Comparing macrophages from our two mice strains, we found the response of fluorescent gfpBMDMs and non-fluorescent wild-type b6BMDMs to infection with wild-type M. smegmatis Figure 2 Table S3 5 7 4 7 M. smegmatis Figure 2 Table S4 3.2.3. Impact of Gentamicin on 3D Bacteria Culture Reproducible in 2D Culture To disaggregate the potential contribution of the culture environment (media or 3D matrix) on the bacteria from that of macrophage-associated immune response, we evaluated bacteria growth in culture alone without macrophage cells. The growth dynamics of mCherry M. smegmatis Figure 2 Tables S5 and S6 2 M. smegmatis 3.3. Extra-Matrix Sampling Sufficiently Captures Biochemical Response in 3D Infection in a Manner Comparable to Sample Collection in 2D Culture To determine the most effective sampling method for our 3D cultures, we compared oxidative molecules sampled from dissolved RBM (intra-RBM) versus samples from the 3D supernatant or hydrating media ( Figure S4, Tables S8 and S9 Figure S3, Table S7 n Figure S4A, Table S8 Figure S4B, Table S9 5 5 5 5 Table S18 25 3.4. Macrophages in 3D Culture Exhibit Similar Infection Outcomes as in 2D Culture but Biochemical Response Dynamics Differ 3.4.1. Relative Increase in Oxidative Response During 3D Infection Comparison of 2D and 3D infection response showed similar bacterial clearance dynamics ( Figure 3 Table S10 p Figure 3 Table S11 Comparison of NO using 2D and 3D supernatant (Log2FC) showed a general increase of nitric oxide production by macrophages in 3D infected cultures compared to 3D control, 2D control, and 2D infected cultures, with average values of 0.25, −0.11, −0.03, and −0.07, respectively ( Figure 3 Tables S12 and S13 Figure 3 Tables S14 and S15 3.4.2. Necrotic Cell Death Is Reduced for Infected Macrophages in 3D Culture There were notable differences between the relative levels of cell cytotoxicity (LDH) for control non-infected and infected macrophages in 3D versus 2D environments. Results showed a consistent increase in macrophage death over time ( Figure 3 p Tables S16 and S17 p Figure 3 Table S18 Table S19 3.5. Imaging-Based Quantification Shows Differences in Macrophage 2D/3D Spatiotemporal Response Mirroring our sample collection experiments, for each of the two biological trials (one mouse per trial), we set up two independent technical replicates of 2D and 3D culture for an imaging-based monitoring and quantification study. For each of the n n Table 2 Figure 4 Figure 5 Figure 6 Figure 7 3.5.1. Imaging Shows Structural and Morphological Differences Related to Infection and 3D Environment Imaris rendering of the 4D data showed constitutive expression of actin-GFP in the BMDMs for control and infected conditions ( Figure 4 Supplementary Materials Videos S1–S4 M. smegmatis Figure 4 Figure 4 Figure 4 33 Figure 4 Figure 4 3.5.2. Image-Based Characterization of 2D and 3D Cytotoxicity and Bacterial Load Shows Concordance with Standard Downstream Assays The number of cells observed in our 4D dataset per condition concurred with LDH-based cell cytotoxicity patterns over the span of the study, with 3D control cells having the fewest number of cells. Comparison of infected to non-infected cultures reinforced results from cytotoxicity assays, with infected 2D cultures having on average fewer (87%) cells than non-infected 2D control and 3D infected cultures having markedly more (237%) macrophages than 3D control. To minimize non-mycobacterium-associated RFP signals we compared RFPs from control (non-infected) and infected wells in 2D and 3D. RFP mean values in macrophages for the first experimental trial yielded significant differences between control and infected cells, which was expected. Evaluated over all time, raw RFP values also showed significant difference between controls ( Figure 5 Table S20 Figure 5 Table S21 Figure 5 Figure 7 Figure 5 RFP mean of all cells at all timepoints (trial 1 only). ( A B p C 3.5.3. Environment Drives Differences in Cell Motility and Migration, While Volumetric Differences Driven by Infection State While standard and image-based quantification show that macrophages in 2D and 3D similarly clear M. smegmatis Figure 6 Table 3 −4 p −4 −4 p −4 Figure 6 Table S22 Figure 6 Figure S5 p Figure 6 Tables S23 and S24 Figure 6 Image analysis of individual cell dynamics of gfpBMDMs infected with mCherry M. smegmatis A B C D E F G H p Figure 7 ( A B p p p In 2D, the average acceleration of non-infected macrophages (5.81 × 10 −8 2 p −8 2 −8 2 −8 2 p Table S25 Figure 6 Table 4 Figure 6 Figure S6, Tables S26 and S27 Average cell directedness (non-random movement) decreased as macrophage cells accumulated greater total distance traveled over time. For both 2D and 3D environments, over all time points, the average directedness for non-infected macrophages (2D: 0.31165, 3D: 0.188757) was higher ( p Figure 6 Table 5 Table S28 Figure 6 Figure S7, Table S30 Figure 6 Table S29 Significant volumetric differences were observed between 2D/3D and control/infected conditions throughout the study ( Tables S31–S33 3 3 p 3 3 Figure 6 Table S31 Table 6 Figure 6 Figure S8 3.6. Correlative Characteristics Vary Depending on Infection and Environment Figure 7 Figure 7 p Supplementary Materials Section S4 3.6.1. Relationship Between Cytotoxicity, Speed, and Bacteria Load Concordant in 2D and 3D Cultures, but NO Negatively Correlates with Speed and Mycobacterial Load in 3D Consistent with previous 2D studies of M. smegmatis 25 Nitric oxide was not significantly ( p p p LDH/cytotoxicity was negatively correlated with speed in all conditions except the 3D control (range −0.57 to −1), with significance for 2D and 3D infected conditions (−0.96, −1). LDH correlated positively with acceleration (range 0.14 to 0.94) except in the 2D control, with statistical significance in 3D controls (0.94, p p p Figure S9 3.6.2. Macrophage Speed and Directedness Positively Correlate with Bacteria Load with Significance in 3D Infection Conditions Cell speed correlated positively with directedness in 2D (0.89, p p p p p CFUs and adjusted RFP mean were positively correlated in 2D and 3D infection (>0.8), with significance in 3D ( p The positive tripartite correlation between speed, directedness, and CFUs is concordant in 2D and 3D, and indicative of directional movement driven by macrophage response to infection. It is notable that this connection is stronger in the 3D environment and only in 3D culture do the infected and non-infected states differ in the correlations between speed and directedness. 4. Discussion To support movement towards ubiquitous use of in vitro and ex vivo 3D models for the study of structural immune response, we developed a platform to characterize spatiotemporal immune response and evaluated engineering constraints plus biological variables that impact model implementation and sample recovery. The platform was used to investigate concordance between 3D and 2D infection models and characterize macrophage structural immune response using GFP BMDMs infected with mCherry M. smegmatis 4.1. Effectiveness of Biochemical Response During Infection More Pronounced in 3D Environment Based on CFU enumeration, BMDMs in the 3D RBM environment did not differ significantly from those in 2D culture in clearance of bacteria during infection. However, the adjusted RFP mean, the imaging-based metric for bacterial load, did show environment-associated differences. Unlike 2D, infection in 3D resulted in a negative correlation between NO production and CFUs/bacteria load. This distinct correlation pattern, in addition to higher levels of NO and LDH in 3D infection and control, respectively, suggests that infection-associated production of NO is highly consequential in 3D versus 2D environments, with NO impacting macrophage cytotoxicity and bactericidal activity. NO is also negatively correlated with LDH only in 3D control conditions. LDH has the strongest positive correlations with speed and acceleration in the 3D control, but negative correlation with directedness for all conditions. Therefore, we expect that in 3D culture, absent of infection, cell death may have a greater dependence on cell migration and proximity to other cells rather than the diffusion of oxidative molecules. The significantly higher level of LDH in 3D uninfected control further supports spatial dispersion in the 3D environment as a contributing factor to decreased cell viability. 4.2. 3D Spatiotemporal Response Associates with Infection and NO and Is Consistent with Prior Observations of Virulence and Proinflammatory Modulation of Cell Speed and Morphology The overall decrease in motility in the 3D environment was anticipated due to ECM-associated impedance. However, the distinct infection-associated increase in spatiotemporal dynamics in 3D clearly indicates cellular migration and mobilization are measurably consequential in 3D versus 2D structural response to mycobacterium infection. Davis and Ramakrishnan noted increased cellular speed with increasing virulence when comparing in vivo wild-type Mycobacterium marinum 1 The in vivo speeds observed for the Mm granuloma model (1 × 10 −2 −2 M. smegmatis. −3 −3 34 −4 −4 −4 −4 In addition to infected versus non-infected states impacting cell motility and morphology, the macrophage population in 2D and 3D infected conditions are a heterogeneous compilation of cells [ 31 35 35 M. smegmatis 4.3. BMDMs in 3D Environment Exhibit Significantly Increased Volume During Infection While direct comparison between cell volume in 2D and 3D was challenging due to differing morphologies, analysis of control versus infected 2D and 3D conditions showed a notable increase in cellular volume for infected conditions. Increased cell volume correlating to bacterial infection has been observed in granulocytes incubated with Escherichia coli 36 4.4. 3D Environment Results in a Comparatively Distinct Biochemical and Structural Immune Response Signature Macrophage response in 3D environments results in a distinct infection-associated biochemical and spatiotemporal immune signature, which is not readily observed for infected macrophages in the 2D environment. The relative concentration and impact of the measured biochemical effector was more consequential in the 3D environment. Whereas relative NO levels were minimally distinguishable in 2D infected versus non-infected cells, notably higher NO levels directly correlated to a reduction in bacteria in 3D. Correlations between NO, cytotoxicity, and bacterial load, key infection-associated phenotypes, were markedly absent in 2D but distinctly positive (NO, cytotoxicity) and negative (NO, CFUs) in 3D infection. Spatiotemporal characteristics quantified in the 3D environment exhibited a pronounced infection-associated signature, specifically for macrophage speed and volume. Compared to control non-infected conditions, correlations between speed and cytotoxicity, directedness, and time post-infection showed inverse relationships in 3D in the presence of infection. Volume-associated temporal correlations differed in 3D as did the correlations between volume, NO, and cytotoxicity. 5. Conclusions We developed an integrated experimental and computational platform to compare Mycobacterium smegmatis This work demonstrates the importance of the ECM and physiological components of immune response. Our results suggest some concordance in the outcome of infection for 2D and 3D environments, but notable discordance on the effects of NO and divergence between non-infected and infected cells in 3D versus 2D environments. Several differentiating features observed in 3D concurred with observations from in vitro migration studies and in vivo infection studies with mycobacteria of varying virulence. Outcomes demonstrate the feasibility of using traditional sample collection plus 4D confocal imaging methods to concurrently probe 3D biochemical and structural immune response to infection using cost-effective culture methods. Methods used are extensible to studies with pathogenic mycobacterium and inclusion of more complex combinations of innate immune cell populations, which will be required to fully characterize structural immunity, nascent granuloma formation, and function in infection clearance, containment, and dissemination. Acknowledgments Fluorescent mycobacterium strains were provided by Cirillo Lab, Texas A&M University College of Medicine. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/microorganisms13092026/s1 M. smegmatis M. smegmatis M. smegmatis M. smegmatis M. smegmatis M. smegmatis M. smegmatis M. smegmatis M. smegmatis M. smegmatis M. smegmatis M. smegmatis M. smegmatis M. smegmatis 37 38 39 40 Author Contributions Conceived and supervised project: E.E.M. Developed and designed the experiments: D.L.S., K.S.R. (preliminary), and E.E.M. Performed the experiments: D.L.S. and K.S.R. (preliminary). Analyzed the data: D.L.S. and E.E.M. Manuscript preparation: D.L.S. and E.E.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved by the University of Houston’s Institutional Animal Care and Use Committee (IACUC protocol no. 16-024, approved 23 September 2016) and in accordance with the Guide for the Care and Use of Laboratory Animals and the American Veterinary Medical Association (AVMA) Guidelines for the Euthanasia of Animals. Informed Consent Statement Not applicable. Data Availability Statement The datasets presented in this article are not readily available because dataset is part of an ongoing study. Requests to access the datasets should be directed to the corresponding author (emay5@wisc.edu). Conflicts of Interest The authors declare no conflict of interest. References 1. Davis J.M. Ramakrishnan L. The Role of the Granuloma in Expansion and Dissemination of Early Tuberculous Infection Cell 2009 136 37 49 10.1016/j.cell.2008.11.014 19135887 PMC3134310 2. Ernst J.D. The immunological life cycle of tuberculosis Nat. Rev. Immunol. 2012 12 581 591 10.1038/nri3259 22790178 3. Batista L.A.F. Silva K.J.S. da Costa E.S.L.M. de Moura Y.F. Zucchi F.C.R. Tuberculosis: A granulomatous disease mediated by epigenetic factors Tuberculosis 2020 123 101943 10.1016/j.tube.2020.101943 32741528 4. Al Shammari B. Shiomi T. Tezera L. Bielecka M.K. Workman V. Sathyamoorthy T. Mauri F. Jayasinghe S.N. Robertson B.D. D’Armiento J. The Extracellular Matrix Regulates Granuloma Necrosis in Tuberculosis J. Infect. Dis. 2015 212 463 473 10.1093/infdis/jiv076 25676469 PMC4539912 5. Guirado E.L.S.S. Kaplan G. Macrophages in Tuberculosis: Friend or Foe Semin. Immunopathol. 2013 35 563 583 10.1007/s00281-013-0388-2 23864058 PMC3763202 6. Marakalala M.J. Raju R.M. Sharma K. Zhang Y.J. Eugenin E.A. Prideaux B. Daudelin I.B. Chen P.Y. Booty M.G. Kim J.H. Inflammatory signaling in human Tuberculosis granulomas is spatially organized Nat. Med. 2016 22 531 538 10.1038/nm.4073 27043495 PMC4860068 7. Bold T.D. Ernst J.D. Who Benefits from Granulomas, Mycobacteria or Host? Cell 2009 136 17 19 10.1016/j.cell.2008.12.032 19135882 PMC4214211 8. Egen J.G. Rothfuchs A.G. Feng C.G. Winter N. Sher A. Germain R.N. Macrophage and T Cell Dynamics during the Development and Disintegration of Mycobacterial Granulomas Immunity 2008 28 271 284 10.1016/j.immuni.2007.12.010 18261937 PMC2390753 9. Flynn J.L. Gideon H.P. Mattila J.T. Lin P.L. Immunology studies in non-human primate models of tuberculosis Immunol. Rev. 2015 264 60 73 10.1111/imr.12258 25703552 PMC4339213 10. Kramnik I. Beamer G. Mouse models of human TB pathology: Roles in the analysis of necrosis and the development of host-directed therapies Semin. Immunopathol. 2016 38 221 237 10.1007/s00281-015-0538-9 26542392 PMC4779126 11. Cutter S. Wright M.D. Reynolds N.P. Binger K.J. Towards using 3D cellular cultures to model the activation and diverse functions of macrophages Biochem. Soc. Trans. 2023 51 387 401 10.1042/BST20221008 36744644 PMC9987999 12. Mukundan S. Bhatt R. Lucas J. Tereyek M. Chang T.L. Subbian S. Parekkadan B. 3D host cell and pathogen-based bioassay development for testing anti-tuberculosis (TB) drug response and modeling immunodeficiency Biomol. Concepts 2021 12 117 128 10.1515/bmc-2021-0013 34473918 13. Mukundan S. Singh P. Shah A. Kumar R. O’Neill K.C. Carter C.L. Russell D.G. Subbian S. Parekkadan B. In Vitro Miniaturized Tuberculosis Spheroid Model Biomedicines 2021 9 1209 10.3390/biomedicines9091209 34572395 PMC8470281 14. Puissegur M.-P. Botanch C. Duteyrat J.-L. Delsol G. Caratero C. Altare F. An in vitro dual model of mycobacterial granulomas to investigate the molecular interactions between mycobacteria and human host cells Cell. Microbiol. 2004 6 423 433 10.1111/j.1462-5822.2004.00371.x 15056213 15. Parasa V.R. Rahman M.J. Hoang A.T.N. Svensson M. Brighenti S. Lerm M. Modeling Mycobacterium tuberculosis early granuloma formation in experimental human lung tissue Dis. Model. Mech. 2014 7 281 288 24203885 10.1242/dmm.013854 PMC3917249 16. Bielecka M.K. Tezera L.B. Zmijan R. Drobniewski F. Zhang X. Jayasinghe S. Elkington P. A Bioengineered Three-Dimensional Cell Culture Platform Integrated with Microfluidics to Address Antimicrobial Resistance in Tuberculosis mBio 2017 8 e02073-16 10.1128/mBio.02073-16 28174307 PMC5296599 17. Berry S.B. Gower M.S. Su X. Seshadri C. Theberge A.B. A Modular Microscale Granuloma Model for Immune-Microenvironment Signaling Studies in vitro Front. Bioeng. Biotechnol. 2020 8 931 10.3389/fbioe.2020.00931 32974300 PMC7461927 18. Guirado E. Mbawuike U. Keiser T.L. Arcos J. Azad A.K. Wang S.H. Schlesinger L.S. Characterization of host and microbial determinants in individuals with latent tuberculosis infection using a human granuloma model mBio 2015 6 e02537-14 10.1128/mBio.02537-14 25691598 PMC4337582 19. Kapoor N. Pawar S. Sirakova T.D. Deb C. Warren W.L. Kolattukudy P.E. Human Granuloma In Vitro Model, for TB Dormancy and Resuscitation PLoS ONE 2013 8 e53657 10.1371/journal.pone.0053657 23308269 PMC3538642 20. Griffith L.G. Swartz M.A. Capturing complex 3D tissue physiology in vitro Nat. Rev. Mol. Cell Biol. 2006 7 211 224 10.1038/nrm1858 16496023 21. Kim J. Koo B.K. Knoblich J.A. Human organoids: Model systems for human biology and medicine Nat Rev Mol Cell Biol 2020 21 571 584 10.1038/s41580-020-0259-3 32636524 PMC7339799 22. Kong Y. Yang D. Cirillo S.L. Li S. Akin A. Francis K.P. Maloney T. Cirillo J.D. Application of fluorescent protein expressing strains to evaluation of anti-tuberculosis therapeutic efficacy in vitro and in vivo PLoS ONE 2016 11 e0149972 10.1371/journal.pone.0149972 26934495 PMC4774912 23. Colom A. Galgoczy R. Almendros I. Xaubet A. Farré R. Alcaraz J. Oxygen diffusion and consumption in extracellular matrix gels: Implications for designing three-dimensional cultures J. Biomed. Mater. Res. A 2014 102 2776 2784 10.1002/jbm.a.34946 24027235 24. Pavlou S. Lindsay J. Ingram R. Xu H. Chen M. Sustained high glucose exposure sensitizes macrophage responses to cytokine stimuli but reduces their phagocytic activity BMC Immunol. 2018 19 24 10.1186/s12865-018-0261-0 29996768 PMC6042333 25. Gough M.E. Graviss E.A. May E.E. The dynamic immunomodulatory effects of vitamin D3 during Mycobacterium infection Innate Immun. 2017 23 506 523 10.1177/1753425917719143 28770668 26. Lagier B. Pelicic V. Lecossier D. Prod’hom G. Rauzier J. Guilhot C. Gicquel B. Hance A.J. Identification of genetic loci implicated in the survival of Mycobacterium smegmatis Mol. Microbiol. 1998 29 465 475 10.1046/j.1365-2958.1998.00933.x 9720865 27. Xu C. Inokuma M.S. Denham J. Golds K. Kundu P. Gold J.D. Carpenter M.K. Feeder-free growth of undifferentiated human embryonic stem cells Nat. Biotechnol. 2001 19 971 974 10.1038/nbt1001-971 11581665 28. Krombach F. Münzing S. Allmeling A.-M. Gerlach J.T. Behr J. Dörger M. Cell Size of Alveolar Macrophages: An Interspecies Comparison Environ. Health Perspect. 1997 105 1261 1263 9400735 10.1289/ehp.97105s51261 PMC1470168 29. Vijay S. Nair R.R. Sharan D. Jakkala K. Mukkayyan N. Swaminath S. Pradhan A. Joshi N.V. Ajitkumar P. Mycobacterial Cultures Contain Cell Size and Density Specific Sub-populations of Cells with Significant Differential Susceptibility to Antibiotics, Oxidative and Nitrite Stress Front. Microbiol. 2017 8 463 10.3389/fmicb.2017.00463 28377757 PMC5359288 30. Yamane T. Elementary Sampling Theory Prentice-Hall, Inc. Englewood Cliffs, NJ, USA 1967 31. Stolley D.L. May E.E. Spatiotemporal Analysis of Mycobacterium-Dependent Macrophage Response Proceedings of the 2018 40th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC) Honolulu, HI, USA 18–21 July 2018 2390 2393 10.1109/EMBC.2018.8512849 30440888 32. R Core Team R: A Language and Environment for Statistical Computing R Foundation for Statistical Computing Vienna, Austria 2018 33. McWhorter F.Y. Wang T. Nguyen P. Chung T. Liu W.F. Modulation of macrophage phenotype by cell shape Proc. Natl. Acad. Sci. USA 2013 110 17253 17258 10.1073/pnas.1308887110 24101477 PMC3808615 34. Webb S.E. Pollard J.W. Jones G.E. Direct observation and quantification of macrophage chemoattraction to the growth factor CSF-1 J. Cell Sci. 1996 109 793 803 10.1242/jcs.109.4.793 8718671 35. Cui K. Ardell C.L. Podolnikova N.P. Yakubenko V.P. Distinct Migratory Properties of M1, M2, and Resident Macrophages Are Regulated by αDβ 2 2 Front. Immunol. 2018 9 2650 10.3389/fimmu.2018.02650 30524429 PMC6262406 36. Rothe G. Valet G. Phagocytosis, intracellular pH, and cell volume in the multifunctional analysis of granulocytes by flow cytometry Cytometry 1988 9 316 324 10.1002/cyto.990090408 2456897 37. Gough M.E. Graviss E.A. Chen T.A. Obasi E.M. May E.E. Compounding effect of vitamin D3 diet, supplementation, and alcohol exposure on macrophage response to mycobacterium infection Tuberculosis 2019 116S S42 S58 10.1016/j.tube.2019.04.010 31126718 38. Marim F.M. Silveira T.N. Lima D.S. Jr. Zamboni D.S. A Method for Generation of Bone Marrow-Derived Macrophages from Cryopreserved Mouse Bone Marrow Cells PLoS ONE 2010 5 e15263 10.1371/journal.pone.0015263 21179419 PMC3003694 39. Loose L.D. Characterization of Macrophage Dysfunction in Rodent Malaria J. Leukoc. Biol. 1984 36 703 718 10.1002/jlb.36.6.703 6389742 40. Sershen C.L. Plimpton S.J. May E.E. Oxygen Modulates the Effectiveness of Granuloma Mediated Host Response to Mycobacterium tuberculosis: A Multiscale Computational Biology Approach Front. Cell. Infect. Microbiol. 2016 6 6 10.3389/fcimb.2016.00006 26913242 PMC4753379 Figure 1 Overview of experimental methodology. To accommodate biological and engineering constraints, we developed a 3D ex vivo platform that was compatible with standard 2D sampling methods, permissive of mycobacterial infection models, and enabled imaging-based spatiotemporal monitoring. Bone-marrow-derived macrophages (BMDMs) from 10-week-old female transgenic C57BL/6-Tg (CAG-EGFP)131Osb/LeySobJ (gfpBMDM) or wild-type C57BL/6 (b6BMDM) mice (Jackson Labs) were used for all studies unless otherwise specified (isolation methods described in Supplementary Materials Section S1 M. smegmatis 14 n n Figure 2 ( A M. smegmatis n B M. smegmatis n C M. smegmatis n D M. smegmatis M. smegmatis n n E M. smegmatis n 2 Figure 3 Quantification of bacterial load and effector molecules in 2D and 3D infection (* p A n B n C D n E p n F p n 2 Figure 4 Imaris rendering of 2D and 3D infected and 2D non-infected control cells at hour 0 of imaging. EGFP expressing BMDMs are green and mCherry expressing M. smegmatis A M. smegmatis B C D Figure 5 Figure 6 Figure 7 microorganisms-13-02026-t001_Table 1 Table 1 Colom et al.’s formula for maximal gel height to prevent hypoxia in RBM culture. Variable Description and Values Used   h , h m a x (Maximum) gel thickness   ϕ l i m i t Thiele modulus for normoxic environment (19 in for half gel depth, 16.45 for full gel depth (estimate)) assuming an oxygen tension limit of 50 mmHg [ 23   K m Oxygen concentration at which OCR is half of Vmax; V m a x −3 −3 23   D G * Oxygen diffusivity in the gel in the presence of cells (1.7 × 10 −5 2 23   p 0 Initial cell seeding density (2.5 × 10 6   V m a x Maximum OCR per cell 23 −16 24 −17   τ Time constant describing cell proliferation rate (54 h for A549 cells in gel) [ 23 e − t τ p 0 e t τ p 0 ,   t Time in cell culture (hours) microorganisms-13-02026-t002_Table 2 Table 2 Number of observations (cells) during each hour-range. Hour-Range 2D Control 3D Control 2D Infection MOI 50 3D Infection MOI 50  0–12 1586 740 1205 959  12–24 2171 855 1779 1309  24–36 2502 718 2044 1341  36–48 2337 453 2107 1452  48–72 3679 334 3542 2301  Total 12,275 3100 10,677 7362 microorganisms-13-02026-t003_Table 3 Table 3 Average individual cell speed over all time: log 2 Condition 1 Condition 2 Log 2 2D control 3D control 2.235 2D infection 3D infection 1.0015 2D control 2D infection 0.766 3D control 3D infection −0.467 microorganisms-13-02026-t004_Table 4 Table 4 Average individual cell acceleration over all time: log 2 Condition 1 Condition 2 Log 2 2D control 3D control 1.223 2D infection 3D infection 0.601 2D control 2D infection 0.224 3D control 3D infection −0.389 microorganisms-13-02026-t005_Table 5 Table 5 Average individual cell directedness over all time: log 2 Condition 1 Condition 2 Log 2 2D control 3D control 0.723 2D infection 3D infection 0.564 2D control 2D infection 0.365 3D control 3D infection 0.206 microorganisms-13-02026-t006_Table 6 Table 6 Average individual cell volume over all time: log 2 Condition 1 Condition 2 Log 2 2D control 3D control 0.658 2D infection 3D infection 0.325 2D control 2D infection −0.025 3D control 3D infection −0.357 ",
  "metadata": {
    "Title of this paper": "Oxygen Modulates the Effectiveness of Granuloma Mediated Host Response to Mycobacterium tuberculosis: A Multiscale Computational Biology Approach",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472957/"
  }
}