{
  "title": "Paper_634",
  "abstract": "pmc J Biomed Res J Biomed Res 1958 jbr J Biomed Res Journal of Biomedical Research 1674-8301 2352-4685 Education Department of Jiangsu Province PMC12481674 PMC12481674.1 12481674 12481674 40420608 10.7555/JBR.39.20250067 jbr-39-5-467 1 Original Article The effects and toxicity profiles of consolidative and salvage thoracic radiotherapy following chemoimmunotherapy in patients with extensive-stage small cell lung cancer Sun Ruozhou 1 2 △ Zong Dan 1 2 △ Chen Xin 1 2 Ge Yizhi 1 Jiang Ning 1 Zhao Lijun 1 Song Xue 1 He Xia 1 2 * hexiabm@163.com Zhu Xiangzhi 1 * 13182948068@163.com  1 Department of Radiation Oncology, the Affiliated Cancer Hospital of Nanjing Medical University, Jiangsu Cancer Hospital, Jiangsu Institute of Cancer Research, Nanjing, Jiangsu 210009, China  2 Department of Environmental Genomics, Jiangsu Key Laboratory of Cancer Biomarkers, Prevention and Treatment, Collaborative Innovation Center for Cancer Personalized Medicine, Nanjing Medical University, Nanjing, Jiangsu 210009, China Xia He and Xiangzhi Zhu, Department of Radiation Oncology, the Affiliated Cancer Hospital of Nanjing Medical University, Jiangsu Cancer Hospital, Jiangsu Institute of Cancer Research, 42 Baiziting Road, Nanjing, Jiangsu 210009, China. E-mail: hexiabm@163.com 13182948068@163.com △ 9 2025 27 5 2025 39 5 497987 467 477 19 2 2025 19 5 2025 22 5 2025 01 09 2025 01 10 2025 01 10 2025 © 2025 by Journal of Biomedical Research. https://creativecommons.org/licenses/by/4.0/ This is an open access article under the Creative Commons Attribution (CC BY 4.0) license, which permits others to distribute, remix, adapt and build upon this work, for commercial use, provided the original work is properly cited. The present study assessed the efficacy and safety of thoracic radiotherapy (TRT) following first-line chemotherapy or chemoimmunotherapy in patients with extensive-stage small cell lung cancer (ES-SCLC), focusing on the influence of different TRT timing strategies (consolidative vs. n vs. P vs. P vs. P n extensive-stage small cell lung cancer thoracic radiotherapy chemoimmunotherapy survival rate safety The present study was supported by the Young Talents Program of Jiangsu Cancer Hospital (Grant No. QL201802) and the Science and Technology Development Fund of Jiangsu Cancer Hospital (Grant No. ZL202105). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Small cell lung cancer (SCLC) is among the most aggressive malignancies, comprising approximately 15% of all lung cancers [ 1 [ 2 [ 3 4 SCLC is categorized into limited and extensive stages according to the Veterans Administration Lung Study Group (VALSG) staging system [ 5 [ 6 [ 7 8 [ 9 [ 10 [ 11 In the era of immunotherapy, the efficacy of TRT in treating ES-SCLC remains controversial [ 12 13 [ 14 15 [ 16 vs. Materials and methods Patients We retrospectively analyzed patients diagnosed with SCLC at Nanjing Medical University Affiliated Cancer Hospital between January 2019 and July 2022. The primary inclusion criteria were as follows: (1) histological or cytological diagnosis of SCLC; (2) confirmed diagnosis of ES-SCLC according to the VALSG staging system; (3) all patients had received first-line platinum-containing chemotherapy regimens, with or without concurrent immunotherapy; and (4) patients underwent TRT. The exclusion criteria were as follows: (1) patients who did not receive first-line chemotherapy or chemoimmunotherapy; (2) patients who did not undergo TRT; or (3) patients who were lost to follow-up or had insufficient clinical data. Ultimately, 54 patients were included in the study. The patient selection process is shown in Fig. 1 Figure 1 Diagram of the patient selection process. Diagram illustrating the selection process of patients diagnosed with small cell lung cancer (SCLC) between January 2019 and July 2022. Of 131 patients initially diagnosed, 33 were identified with limited-stage SCLC (LD-SCLC) and were excluded. The remaining 98 patients were diagnosed with extensive-stage SCLC (ES-SCLC). Among these, 44 patients were excluded due to not receiving first-line chemoimmunotherapy ( n n n Chemotherapy and immunotherapy All patients received chemotherapy with either etoposide (100 mg/m 2 2 TRT and grouping All patients ultimately received TRT, either as consolidative treatment following first-line therapy or as salvage treatment upon disease progression. Notably, we classified the patients into two groups: those undergoing cTRT within three months after completing first-line treatment were categorized as the active group, while those undergoing sTRT following the progression of thoracic lesions were categorized as the passive group. TRT was administered using intensity-modulated radiotherapy. For treatment simulation, four-dimensional computed tomography was performed to evaluate respiratory-induced tumor motion and optimize target delineation. The gross tumor volume encompassed the post-chemotherapy residual tumor and involved lymph nodes, delineated based on pre-treatment imaging. To account for setup uncertainties and respiratory motion, the planning target volume was generated by expanding the gross tumor volume with an isotropic margin of 0.5–1.0 cm. To minimize the effects of respiratory motion and enhance treatment precision, respiratory management techniques were applied during both simulation and radiotherapy delivery. Depending on tumor location, motion amplitude, and individual patient tolerance, either active breathing control or respiratory gating was selectively employed. In the present study, cTRT was administered to eligible patients following the completion of first-line treatment, regardless of the presence of residual thoracic disease. The decision to administer cTRT was based on a multidisciplinary evaluation of disease status, treatment response, and patient condition. Prophylactic cranial irradiation was selectively performed at the discretion of the treating physician, considering treatment response and patient characteristics. Additionally, patients who developed brain metastases after initial treatment received therapeutic whole-brain radiotherapy. Follow-up assessments and endpoints Patients were evaluated every two treatment cycles during chemoimmunotherapy and within one month after TRT. Follow-up visits were conducted every three months for the first two years after treatment, and every six months thereafter. Follow-up procedures included imaging tests (chest computed tomography [CT], brain magnetic resonance imaging, and neck ultrasound), laboratory tests (blood counts, liver and kidney function, and tumor markers), and clinical symptom records. The primary endpoints of the present study were OS, PFS, locoregional-free survival (LRFS), and distant metastasis-free survival (DMFS). OS was defined as the time from the initiation of treatment to death from any cause or the last follow-up, whichever occurred first. PFS was defined as the time from the initiation of treatment to disease progression or death from any cause, whichever occurred first. LRFS was defined as the time from the initiation of treatment to the first locoregional recurrence or death from any cause. DMFS was defined as the time from the initiation of treatment to the first distant metastasis or death from any cause. The secondary endpoint was the safety of the combined radiotherapy. Toxic effects were assessed according to the Common Terminology Criteria for Adverse Events (version 4.0). Tumor response to first-line therapy was measured by the Response Evaluation Criteria in Solid Tumors (RECIST) guidelines (version 1.1). The efficacy was categorized as complete response, partial response, stable disease, or progressive disease. Statistical analysis All statistical analyses were performed using SPSS (version 27.0) and R software (version 4.3.3). The Kaplan–Meier method was employed to estimate patient OS, PFS, LRFS, and DMFS. The log-rank test was used to compare survival curves. The Cox proportional hazards model was utilized for univariate and multivariate analyses. Variables with P P i.e. P Supplementary Table 1 Results Patient characteristics Between January 2019 and July 2022, we screened 54 eligible patients from a total of 131 SCLC patients admitted to the Nanjing Medical University Affiliated Cancer Hospital. The basic characteristics of the 54 ES-SCLC patients are shown in Table 1 Table 1 Baseline characteristics of 54 ES-SCLC patients Characteristics cTRT ( n sTRT ( n  P  Data are presented as the number (percentage). Statistical comparisons between the cTRT ( n n P Age [years; n 0.947 < 70 35 (85.4) 11 (84.6) ≥70 6 (14.6) 2 (15.4) Sex [ n 0.739 Male 33 (80.5) 11 (84.6) Female 8 (19.5) 2 (15.4) First-line treatment [ n 0.198 Chemotherapy alone 21 (51.2) 4 (30.8) Chemoimmunotherapy 20 (48.8) 9 (69.2) Maintenance therapy [ n 0.349 Yes 14 (34.1) 3 (23.1) No 27 (65.9) 10 (76.9) Brain radiotherapy [ n 0.971 Prophylactic cranial irradiation 3 (7.3) 0 Therapeutic cranial irradiation for brain metastases 13 (31.7) 5 (38.5) No cranial radiotherapy 25 (61.0) 8 (61.5) Metastatic sites at initial diagnosis [ n — Bone metastases 2 (4.9) 5 (38.5) Brain metastases 3 (7.3) 0 Adrenal metastases 2 (4.9) 0 Liver metastases 1 (2.4) 1 (7.7) All patients underwent TRT encompassing the primary site and the associated lymphatic drainage region. Based on the timing of radiotherapy application, 41 patients (76%) received cTRT and 13 patients (24%) received sTRT. The comparison of baseline characteristics between the cTRT and sTRT groups revealed no significant differences in age, sex, first-line treatment modality, maintenance therapy, brain metastases, or extent of metastatic disease, suggesting a relatively balanced distribution ( Table 1 Fig. 2 Fig. 2A 2D Fig. 2E 2H Figure 2 Computed tomography (CT) images and radiotherapy target volumes for patients in both the active and passive radiotherapy groups. A–D: CT images and radiotherapy target volumes for patients in the consolidative thoracic radiotherapy group are displayed as follows: pre-chemoimmunotherapy (A), pre-radiotherapy (B), radiotherapy target volume (C), and post-radiotherapy (D). E–H: For the salvage thoracic radiotherapy group, the corresponding images and volumes are shown as pre-chemoimmunotherapy (E), pre-radiotherapy (F), radiotherapy target volume (G), and post-radiotherapy (H). Survival analysis The final follow-up was on October 30, 2023. The median follow-up time was 37.9 months (95% confidence interval [CI]: 33.7–42.2 months). Within the entire cohort, the median OS was 25.5 months (95% CI: 18.7–32.2 months), with corresponding 6-month, 1-year, and 2-year OS rates of 94.4%, 85.5%, and 50.3%, respectively ( Supplementary Fig. 1A Supplementary Fig. 1B After the completion of first-line chemoimmunotherapy or chemotherapy, we assessed the therapeutic response using the RECIST guidelines, which included both the primary tumor and measurable metastatic lesions. Among the patients, 4% achieved a complete response, 67% had a partial response, 22% had progressive disease, and 7% had stable disease. The median OS of patients who received chemotherapy alone was 25.5 months (95% CI: 19.3 months to not applicable), and the median PFS was 10.1 months (95% CI: 8.0–17.1 months). For those who underwent chemoimmunotherapy, the median OS was 26.6 months (95% CI: 15.5 months to not applicable), and the median PFS was 7.8 months (95% CI: 7.0–23.6 months). Nevertheless, there were no significant differences in OS and PFS between the two groups ( Fig. 3A 3B P vs P Fig. 3C 3D Figure 3 Kaplan–Meier curves comparing the survival outcomes between the chemoimmunotherapy and chemotherapy groups. A–D: The comparisons of survival outcomes for overall survival (A), progression-free survival (B), locoregional-free survival (C), and distant metastasis-free survival (D) between the two groups. Furthermore, we performed subgroup analyses of consolidative and salvage TRT. Patients who received cTRT had a significantly longer median OS (26.6 vs P vs. P Fig. 4A 4B vs. P Fig. 4C Fig. 4D 4E Figure 4 Kaplan–Meier curves illustrating survival outcomes in different treatment comparisons. A–D: The comparisons of survival outcomes for overall survival (A), progression-free survival (B), and distant metastasis-free survival (C) between the consolidative thoracic radiotherapy (cTRT) and salvage thoracic radiotherapy (sTRT) groups. D and E: Comparisons are made between the high-dose and low-dose groups for overall survival (D) and locoregional-free survival (E). To further identify which variables predominantly influence survival outcomes, we performed univariate and multivariate Cox regression analyses ( Tables 2 3 P P P P P i.e. P P P P Table 2 Univariate analysis of survival in 54 EC-SCLC patients Variables OS PFS LRFS DMFS HR (95% CI)  P HR (95% CI)  P HR (95% CI)  P HR (95% CI)  P  Univariate Cox proportional hazards models were used to evaluate associations between clinical variables and survival outcomes, including OS, PFS, LRFS, and DMFS. HRs, 95% CIs, and P n P Age (years; ≥70 vs. 1.82 (0.74–4.50) 0.19 0.48 (0.17–1.35) 0.17 0.82 (0.19–3.61) 0.80 0.53 (0.19–1.50) 0.23 Sex (male vs. 1.82 (0.63–5.24) 0.27 1.07 (0.47–2.41) 0.88 0.82 (0.27–2.52) 0.73 0.92 (0.42–2.01) 0.84 First-line treatment vs. 1.09 (0.53–2.22) 0.82 1.12 (0.61–2.07) 0.71 0.97 (0.37–2.52) 0.95 1.25 (0.66–2.36) 0.49 Thoracic radiotherapy vs. 0.46 (0.21–1.01)  0.05 0.06 (0.03–0.16)  < 0.001 0.66 (0.21–2.06) 0.48 0.34 (0.16–0.74)  0.006 Maintenance therapy vs. 0.32 (0.13–0.79)  0.01 0.91 (0.48–1.72) 0.78 0.76 (0.28–2.07) 0.59 0.69 (0.35–1.35) 0.28 Brain radiotherapy vs. 1.40 (0.69–2.83) 0.36 1.14 (0.62–2.12) 0.67 0.90 (0.33–2.44) 0.84 1.32 (0.69–2.52) 0.40 Table 3 Multivariate analysis of survival in 54 EC-SCLC patients Variables OS PFS LRFS DMFS HR (95% CI)  P HR (95% CI)  P HR (95% CI)  P HR (95% CI)  P  Multivariate Cox proportional hazards models were used to identify factors independently associated with survival outcomes (OS, PFS, LRFS, and DMFS). Maintenance therapy was modeled as a time-dependent covariate because of a violation of the proportional hazards assumption. Adjusted HRs, 95% CIs, and P n P First-line treatment vs. 1.13 (0.52–2.43) 0.75 0.76 (0.38–1.51) 0.43 0.97 (0.36–2.57) 0.95 1.44 (0.75–2.78) 0.27 Thoracic radiotherapy vs. 0.43 (0.18–1.02)  0.05 0.06 (0.02–0.15)  < 0.001 0.64 (0.20–2.04) 0.45 0.32 (0.15–0.71)  0.005 Maintenance therapy vs. 0.30 (0.11–0.77)  0.01 0.97 (0.47–1.98) 0.93 0.71 (0.24–2.03) 0.52 0.65 (0.31–1.36) 0.25 Brain radiotherapy vs. 1.07 (0.52–2.23) 0.84 1.15 (0.58–2.29) 0.69 0.83 (0.30–2.34) 0.73 1.14 (0.57–2.30) 0.71 Safety evaluation Treatment-related adverse events are summarized in Table 4 Table 4 Summary of the adverse events during treatment Toxicity G1 G2 G3 G4  Adverse events are reported as the number (percentage) and categorized by grade (G1–G4) according to the Common Terminology Criteria for Adverse Events (version 4.0). Toxicities are grouped into hematologic, respiratory, gastrointestinal, systemic disease, and other categories. n Hematologic Leukopenia 2 (4%) 18 (33%) 13 (24%) 9 (17%) Anemia 18 (33%) 22 (41%) 5 (9%) 2 (4%) Thrombocytopenia 13 (24%) 5 (9%) 5 (9%) 3 (6%) Respiratory Pneumonitis 12 (22%) 13 (24%) 0 0 Cough 10 (19%) 6 (11%) 0 0 Dyspnea 9 (17%) 3 (6%) 0 0 Fever 3 (6%) 11 (20%) 0 0 Gastrointestinal Esophagitis 1 (2%) 5 (9%) 2 (4%) 0 Odynophagia 2 (4%) 4 (7%) 1 (2%) 0 Decreased appetite 8 (15%) 2 (4%) 1 (2%) 0 Elevated transaminase 10 (19%) 1 (2%) 0 0 Systemic disease Fatigue 7 (13%) 4 (7%) 2 (4%) 0 Skin reaction 4 (7%) 1 (2%) 0 0 Others Lactate dehydrogenase 25 (46%) 8 (15%) 2 (4%) 1 (2%) Cardiac enzymes 10 (19%) 7 (13%) 0 1 (2%) Discussion In the present retrospective study, we evaluated the efficacy and safety of TRT following first-line chemoimmunotherapy or chemotherapy in ES-SCLC patients. Our findings indicate that patients who received cTRT had significantly prolonged OS, PFS, and DMFS compared with those who received sTRT. Furthermore, multivariate analysis identified cTRT as an independent favorable prognostic factor for OS, PFS, and DMFS, highlighting its potential role in optimizing the timing of TRT to improve long-term outcomes for ES-SCLC patients. Although immunotherapy has shown promise in ES-SCLC, its efficacy is influenced by multiple factors, including the patient's overall condition, tumor characteristics, and treatment regimen [ 17 Our results showed that patients in the cTRT group had a significantly extended median OS (26.6 vs. P vs. P vs. P et al [ 18 P [ 19 20 The optimal dose of TRT remains debated. Xu et al [ 21 et al [ 22 vs. P vs. P et al [ 23 [ 24 In addition to TRT parameters, maintenance therapy emerged as a significant prognostic factor in the current study. Univariate analysis indicated that maintenance therapy was significantly associated with OS, while multivariate analysis demonstrated it as an independent and favorable prognostic factor. Given these results, maintenance therapy should be further emphasized in ES-SCLC treatment strategies, as it may play a critical role in improving long-term survival outcomes. Immunotherapy, which carries specific toxicity risks, remains a cautious option when combined with TRT. The safety profile of concurrent or sequential TRT with immunotherapy in ES-SCLC remains underexplored. A phase Ⅰ clinical trial by Welsh et al [ 25 et al [ 26 [ 27 The current study has several limitations. First, as a retrospective study, potential selection bias cannot be excluded. The absence of baseline disease severity indicators, such as gross tumor volume, may have affected survival outcomes and limited comparisons between the cTRT and sTRT groups. Second, heterogeneity in radiotherapy regimens and post-progression treatments may have introduced confounding factors. Third, a substantial proportion of patients were lost to follow-up, potentially underestimating long-term survival benefits and treatment-related toxicities. In our upcoming prospective study, we will systematically address these limitations and improve future analyses. In conclusion, adding cTRT following the completion of first-line chemotherapy combined with immunotherapy may improve the prognosis of ES-SCLC patients. Additionally, emphasizing maintenance therapy in treatment strategies is crucial. Low-dose TRT may be adopted, with treatment-related adverse events being well tolerated and clinically manageable. SUPPLEMENTARY DATA Supplementary data to this article can be found online. Acknowledgments None. CLC number: R734.2, Ducument code: A The authors reported no conflict of interests. References 1 Thai AA, Solomon BJ, Sequist LV, et al Lung cancer Lancet 2021 398 10299 535 554 10.1016/S0140-6736(21)00312-3 34273294 2 Gazdar AF, Bunn PA, Minna JD Small-cell lung cancer: What we know, what we need to know and the path forward Nat Rev Cancer 2017 17 12 725 737 10.1038/nrc.2017.87 29077690 3 Megyesfalvi Z, Gay CM, Popper H, et al Clinical insights into small cell lung cancer: Tumor heterogeneity, diagnosis, therapy, and future directions CA Cancer J Clin 2023 73 6 620 652 10.3322/caac.21785 37329269 4 American Cancer Society. Cancer facts &amp; figures 2021[EB/OL]. [2024-05-19]. https://www.cancer.org/research/cancer-facts-statistics/all-cancer-facts-figures/cancer-facts-figures-2021.html. 5 Ganti AKP, Loo JR BW, Bassetti M, et al Small cell lung cancer, version 2.2022, NCCN clinical practice guidelines in oncology J Natl Compr Canc Netw 2021 19 12 1441 1464 10.6004/jnccn.2021.0058 34902832 PMC10203822 6 Farago AF, Keane FK Current standards for clinical management of small cell lung cancer Transl Lung Cancer Res 2018 7 1 69 79 10.21037/tlcr.2018.01.16 29535913 PMC5835595 7 Rossi A, Di Maio M, Chiodini P, et al Carboplatin- or cisplatin-based chemotherapy in first-line treatment of small-cell lung cancer: The COCIS meta-analysis of individual patient data J Clin Oncol 2012 30 14 1692 1698 10.1200/JCO.2011.40.4905 22473169 8 Wang Y, Zou S, Zhao Z, et al New insights into small-cell lung cancer development and therapy Cell Biol Int 2020 44 8 1564 1576 10.1002/cbin.11359 32281704 PMC7496722 9 Liu SV, Reck M, Mansfield AS, et al Updated overall survival and PD-L1 subgroup analysis of patients with extensive-stage small-cell lung cancer treated with atezolizumab, carboplatin, and etoposide (IMpower133) J Clin Oncol 2021 39 6 619 630 10.1200/JCO.20.01055 33439693 PMC8078320 10 Paz-Ares L, Dvorkin M, Chen Y, et al Durvalumab plus platinum-etoposide versus platinum-etoposide in first-line treatment of extensive-stage small-cell lung cancer (CASPIAN): A randomised, controlled, open-label, phase 3 trial Lancet 2019 394 10212 1929 1939 10.1016/S0140-6736(19)32222-6 31590988 11 Cheng Y, Han L, Wu L, et al Effect of first-line serplulimab vs placebo added to chemotherapy on survival in patients with extensive-stage small cell lung cancer: The ASTRUM-005 randomized clinical trial JAMA 2022 328 12 1223 1232 10.1001/jama.2022.16464 36166026 PMC9516323 12 Nesbit EG, Leal TA, Kruser TJ What is the role of radiotherapy for extensive-stage small cell lung cancer in the immunotherapy era? Transl Lung Cancer Res 2019 8 S2 S153 S162 10.21037/tlcr.2019.05.01 31673520 PMC6795575 13 Li H, Zhao Y, Ma T, et al Radiotherapy for extensive-stage small-cell lung cancer in the immunotherapy era Front Immunol 2023 14 1132482 10.3389/fimmu.2023.1132482 37701437 PMC10493776 14 Deng L, Liang H, Burnette B, et al Irradiation and anti-PD-L1 treatment synergistically promote antitumor immunity in mice J Clin Invest 2014 124 2 687 695 10.1172/JCI67313 24382348 PMC3904601 15 Dovedi SJ, Cheadle EJ, Popple AL, et al Fractionated radiation therapy stimulates antitumor immunity mediated by both resident and infiltrating polyclonal T-cell populations when combined with PD-1 blockade Clin Cancer Res 2017 23 18 5514 5526 10.1158/1078-0432.CCR-16-1673 28533222 16 Antonia SJ, Villegas A, Daniel D, et al Durvalumab after chemoradiotherapy in stage Ⅲ non-small-cell lung cancer N Engl J Med 2017 377 20 1919 1929 10.1056/NEJMoa1709937 28885881 17 Kang K, Wu Y, Yao Z, et al Tackling the current dilemma of immunotherapy in extensive-stage small cell lung cancer: A promising strategy of combining with radiotherapy Cancer Lett 2023 565 216239 10.1016/j.canlet.2023.216239 37211066 18 Jeremic B, Shibamoto Y, Nikolic N, et al Role of radiation therapy in the combined-modality treatment of patients with extensive disease small-cell lung cancer: A randomized study J Clin Oncol 1999 17 7 2092 2099 10.1200/JCO.1999.17.7.2092 10561263 19 Slotman BJ, van Tinteren H, Praag JO, et al Use of thoracic radiotherapy for extensive stage small-cell lung cancer: A phase 3 randomised controlled trial Lancet 2015 385 9962 36 42 10.1016/S0140-6736(14)61085-0 25230595 20 Slotman BJ, Faivre-Finn C, van Tinteren H, et al Which patients with ES-SCLC are most likely to benefit from more aggressive radiotherapy: A secondary analysis of the phase Ⅲ CREST trial Lung Cancer 2017 108 150 153 10.1016/j.lungcan.2017.03.007 28625628 21 Xu L, Zhao L, Simone II CB, et al Receipt of thoracic radiation therapy and radiotherapy dose are correlated with outcomes in a retrospective study of three hundred and six patients with extensive stage small-cell lung cancer Radiother Oncol 2017 125 2 331 337 10.1016/j.radonc.2017.10.005 29079309 22 Han J, Fu C, Li B Clinical outcomes of extensive-stage small cell lung cancer patients treated with thoracic radiotherapy at different times and fractionations Radiat Oncol 2021 16 1 47 10.1186/s13014-021-01773-x 33663551 PMC7934361 23 Liu C, Zeng L, Deng C, et al Hypofractionated radiotherapy with immunochemotherapy for extensive-stage small-cell lung cancer Front Immunol 2023 14 1175960 10.3389/fimmu.2023.1175960 37350968 PMC10282832 24 Kuncman Ł, Fijuth J, Tworek D, et al Radiotherapy(R) integration(I) strategy for small(S)-cell lung cancer in extensive(E) stage(RISE) with up to 10 metastases—a study protocol of a randomized phase Ⅱ trial BMC Cancer 2025 25 1 142 10.1186/s12885-025-13552-y 39856583 PMC11760097 25 Welsh JW, Heymach JV, Chen D, et al Phase Ⅰ trial of pembrolizumab and radiation therapy after induction chemotherapy for extensive-stage small cell lung cancer J Thorac Oncol 2020 15 2 266 273 10.1016/j.jtho.2019.10.001 31605794 26 Diamond BH, Verma N, Shukla UC, et al Consolidative thoracic radiation therapy after first-line chemotherapy and immunotherapy in extensive-stage small cell lung cancer: A multi-institutional case series Adv Radiat Oncol 2022 7 2 100883 10.1016/j.adro.2021.100883 35387416 PMC8977911 27 Li B, Jiang C, Pang L, et al Toxicity profile of combining PD-1/PD-L1 inhibitors and thoracic radiotherapy in non-small cell lung cancer: A systematic review Front Immunol 2021 12 627197 10.3389/fimmu.2021.627197 33859637 PMC8042254 ",
  "metadata": {
    "Title of this paper": "Toxicity profile of combining PD-1/PD-L1 inhibitors and thoracic radiotherapy in non-small cell lung cancer: A systematic review",
    "Journal it was published in:": "Journal of Biomedical Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481674/"
  }
}