{
  "title": "Paper_929",
  "abstract": "J Histochem Cytochem J Histochem Cytochem 584 jhc JHC Journal of Histochemistry and Cytochemistry 0022-1554 1551-5044 Histochemical Society PMC12477178 PMC12477178.1 12477178 12477178 41015934 10.1369/00221554251374108 10.1369_00221554251374108 1 Article Expression of Glial Cell Line–derived Neurotrophic Factor and Its Receptors in Glioblastoma https://orcid.org/0000-0002-3452-2291 Ewald Jesper Dupont Department of Clinical Research, University of Southern Denmark, Odense, Denmark Department of Pathology, Odense University Hospital, Odense, Denmark Knudsen Arnon Møldrup Department of Clinical Research, University of Southern Denmark, Odense, Denmark Department of Pathology, Odense University Hospital, Odense, Denmark Wohlleben Helle Department of Pathology, Odense University Hospital, Odense, Denmark Christiansen Lone Department of Pathology, Odense University Hospital, Odense, Denmark Michaelsen Signe Regner Department of Pathology, The Bartholin Institute, Copenhagen University Hospital, Copenhagen, Denmark Department of Clinical Medicine and Biotech Research and Innovation Center, University of Copenhagen, Copenhagen, Denmark https://orcid.org/0000-0001-7474-5433 Anand Atul Department of Pathology, The Bartholin Institute, Copenhagen University Hospital, Copenhagen, Denmark Department of Clinical Medicine and Biotech Research and Innovation Center, University of Copenhagen, Copenhagen, Denmark https://orcid.org/0000-0002-6352-0826 Kristensen Bjarne Winther Department of Pathology, The Bartholin Institute, Copenhagen University Hospital, Copenhagen, Denmark Department of Clinical Medicine and Biotech Research and Innovation Center, University of Copenhagen, Copenhagen, Denmark Bjarne Winther Kristensen, Department of Pathology, The Bartholin Institute, Copenhagen University Hospital, Blegdamsvej 9, DK-2100 Copenhagen East, Denmark. E-mail: bjarne.winther.kristensen.01@regionh.dk The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. 28 9 2025 475329 00221554251374108 18 5 2025 11 8 2025 28 09 2025 30 09 2025 30 09 2025 © The Author(s) 2025 2025 The Histochemical Society Glioblastoma is the most frequent and aggressive primary brain cancer in adults, and the prognosis is poor. The neurotrophic factor glial cell–derived neurotrophic factor (GDNF) and its receptors, which are involved in neuronal development, have in experimental studies been suggested to drive tumorigenic processes in glioblastoma, but the role and expression in glioblastoma in patients is under-investigated. The aim of this study was to investigate the expression of GDNF, GDNF family receptor 1–4 (GFRA1–4), and the downstream REarranged during Transfection (RET) receptor in human glioblastoma tissue by RNA in situ hybridization, immunohistochemistry, and immunofluorescence. Expression was quantified by software-based classifiers. The results showed that GDNF was expressed in approximately 10% of tumor cells. The GFRA1 receptor was widely expressed in tumor cells, often colocalizing with the astrocytic tumor cell marker glial fibrillary acidic protein (GFAP), and in a smaller fraction of tumor cells expressing the stem cell markers oligodendrocyte transcription factor 2 (OLIG2) and SRY-Box Transcription Factor 2 (SOX2). The GFRA2 receptor expression was very limited, whereas expression of GFRA3, GFRA4, and RET, respectively, was almost absent. In conclusion, GDNF and its primary receptor GFRA1 were expressed in patient glioblastoma tissue. Potential clinical value needs further investigation. GDNF GFRA1 glioblastoma immunohistochemistry in situ hybridization RET Danish Cancer Society Research Center (DCRC) The Neye Foundation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf yes pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes edited-state corrected-proof typesetter ts1 ",
  "metadata": {
    "Title of this paper": "Expression of Glial Cell Line–derived Neurotrophic Factor and Its Receptors in Glioblastoma",
    "Journal it was published in:": "Journal of Histochemistry and Cytochemistry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477178/"
  }
}