{
  "title": "Paper_673",
  "abstract": "pmc J Korean Med Sci J Korean Med Sci 658 jkms JKMS Journal of Korean Medical Science 1011-8934 1598-6357 Korean Academy of Medical Sciences PMC12480960 PMC12480960.1 12480960 12480960 41025342 10.3346/jkms.2025.40.e249 1 Original Article Respiratory Diseases & Critical Care Medicine Pulmonary Fibrosis in Critically Ill Patients With COVID-19: A Multi-Center Retrospective Cohort Study in Korea https://orcid.org/0009-0000-2002-8359 Cho Daehong 1 https://orcid.org/0000-0002-7480-2634 Chae Ganghee 2 https://orcid.org/0000-0002-5044-2742 Joh Joon-Sung 3 https://orcid.org/0000-0002-6868-6534 Kim Junghyun 4 https://orcid.org/0000-0003-4142-2755 Park Tae Yun 5 https://orcid.org/0000-0003-1350-610X Baek Ae-Rin 6 https://orcid.org/0000-0002-6038-9818 Kim Won-Young 7 https://orcid.org/0000-0002-1935-7240 Jegal Yangjin 2 https://orcid.org/0000-0003-1830-307X Chung Chi Ryang 8 https://orcid.org/0000-0003-0958-106X Lee Jinwoo 9 https://orcid.org/0000-0001-9971-7025 Park Joo Hun 10 https://orcid.org/0000-0002-1496-472X Lee Jae Wook 11 https://orcid.org/0000-0002-0922-6677 Lim Soyeoun 12 https://orcid.org/0000-0001-5121-3522 Song Jin Woo 1 1 Korea 2 Korea 3 Korea 4 Korea 5 Korea 6 Korea 7 Korea 8 Korea 9 Korea 10 Korea 11 Korea 12 Korea Address for Correspondence: Jin Woo Song, MD, PhD. Department of Pulmonary and Critical Care Medicine, Asan Medical Center, University of Ulsan College of Medicine, 88 Olympic-ro 43-gil, Songpa-gu, Seoul 05505, Korea. jwsongasan@gmail.com 29 9 2025 22 8 2025 40 38 497964 e249 03 7 2024 11 3 2025 22 08 2025 01 10 2025 01 10 2025 © 2025 The Korean Academy of Medical Sciences. 2025 The Korean Academy of Medical Sciences https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( https://creativecommons.org/licenses/by-nc/4.0/ Background Pulmonary fibrosis can persist long after recovery from coronavirus disease 2019 (COVID-19) infection, thereby reducing quality of life and lung function. We aimed to evaluate the frequency and risk factors for pulmonary fibrosis in patients with severe COVID-19 pneumonia requiring mechanical ventilation (MV), a high-risk group for developing pulmonary fibrosis. Methods Clinical data and chest computed tomography (CT) scans of patients with severe COVID-19 pneumonia requiring MV were retrospectively collected from nine hospitals in South Korea. Fibrotic-like changes on chest CT were visually assessed. Results We included 125 patients with a mean age of 68.5 years, 60.8% men and 7.2% having underlying lung disease. Based on follow-up chest CT (the median interval, 38.0 days; interquartile range, 24.0–68.0 days), 94 (75.2%) patients exhibited fibrotic-like changes, with traction bronchiectasis and/or bronchiolectasis being the most common change (60.8%). Among all patients, 17.6% died during hospitalization and 71.2% experienced complications, including intubation-related airway injury (12.8%), ventilator-associated pneumonia (44.8%), lung injury (11.2%), and hemodynamic disturbance (33.4%). In-hospital mortality (16.1% vs. 18.1%) and complications (67.7% vs. 72.3%) were similar between patients with and without fibrotic-like changes. In multivariable logistic regression analysis, a higher daily steroid dose (odds ratio, 0.961; 95% confidence interval, 0.849–0.993; P Conclusion Our study demonstrated that in patients with severe COVID-19 pneumonia requiring MV, chest CT revealed fibrotic-like changes in approximately three-quarters of patients. In addition, our results suggest that higher daily doses of steroids may be associated with a reduced risk of pulmonary fibrosis. Further research is needed to determine the appropriate steroid dose that may reduce the progression of pulmonary fibrosis and improve clinical outcomes. Trial Registration Clinical Research Information Service Identifier: KCT0006312 Graphical Abstract  Coronavirus Disease 2019 Pulmonary Fibrosis Computed Tomography Complication Risk Factor Mechanical Ventilation Corticosteroid National Research Foundation of Korea https://doi.org/10.13039/501100003725 2022R1A2B5B02001602 2022M3A9E4082647 Korea National Institute of Health https://doi.org/10.13039/501100003653 2021ER190400 2021ER120701 Ministry of Environment https://doi.org/10.13039/501100002701 RS-2022-KE002197 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION The coronavirus disease 2019 (COVID-19) pandemic has imposed a substantial global burden, resulting in > 700 million confirmed cases and > 6 million deaths by August 2023. 1 2 3 4 5 Complications such as pulmonary fibrosis are common in severe COVID-19 patients. Understanding the patterns and identifying risk factors for pulmonary fibrosis in this high-risk group are paramount in managing the long-term sequelae of COVID-19. In a meta-analysis, Lee et al. 6 P Furthermore, COVID-19 disease severity has been suggested to be significantly associated with an increased risk of developing pulmonary fibrosis. 7 8 METHODS Study design and participants This multicenter, retrospective observational cohort study included patients who required MV for COVID-19 pneumonia between February 2020 and October 2021, enrolled from nine South Korea hospitals. The inclusion criteria were as follows: 1) age ≥ 18 years; 2) confirmation of SARS-CoV-2 infection using real-time polymerase chain reaction assays conducted on nasopharyngeal swabs; 3) classification as severe or critical condition according to the COVID-19 World Health Organization (WHO) clinical classification; 4) admission to the intensive care unit (ICU) with a requirement for MV; and 5) patients with follow-up chest CT conducted 1 month post-discharge in an outpatient setting, or the last CT scans conducted during hospitalization in cases of patient’s death or transfer to another medical facility. Patients previously diagnosed with interstitial lung disease were excluded from this study. A total of 353 patients with COVID-19 pneumonia who required MV were admitted to the ICU. Among them, 228 patients who did not undergo follow-up CT during hospitalization or post-discharge were excluded from the study. Ultimately, 125 patients were included in the analysis and categorized into pulmonary fibrosis and no pulmonary fibrosis groups, based on the fibrotic-like changes detected on chest CT scans ( Fig. 1 Fig. 1 Flowchart of selection of the study participants. COVID-19 = coronavirus disease 2019, CT = computed tomography. Data collection Patients' demographic and clinical data at ICU admission were retrospectively collected. Treatment-related data, including antiviral drugs and steroid administration, MV settings, extracorporeal membrane oxygenation use, and continuous renal replacement therapy application, were collected to evaluate the effects of medical interventions on pulmonary fibrosis. Additionally, data on mortality and ventilator-associated complications, including intubation-related airway injury (IRAI), ventilator-associated pneumonia (VAP), ventilator-induced lung injury (VILI), and hemodynamic disturbance, were collected. IRAI was defined as an injury to the airway, including the nasal cavity, oral cavity, oropharynx, and larynx, following intubation. 9 10 11 Assessment of pulmonary fibrosis We collected outpatient chest CT scans acquired 1 month post-discharge or the last scan obtained during hospitalization for patients who died or were transferred to another hospital. Two thoracic radiologists (Jinwoo Lee and Soyeoun Lim) with 9 years of experience independently reviewed the scans to assess pulmonary fibrosis, blinded to clinical information except for the presence of COVID-19. Disagreements between the two readers were resolved by consensus. Fibrotic-like changes, including reticulation, architectural distortion and/or parenchymal band, traction bronchiectasis and/or bronchiolectasis, and honeycombing, were considered indicative of pulmonary fibrosis on CT imaging ( Supplementary Fig. 1 12 12 12 12 12 Statistical analysis Data were presented as mean ± standard deviation or median ± interquartile range (IQR) for continuous variables and number (%) for categorical variables. The Student’s t U 2 P Ethics statement The Institutional Review Board (IRB) of each participating hospital, including Asan Medical Center (IRB No. 2021-1353) approved the study and waived the need of informed consent. This study was registered with the Korea Clinical Research Informative Service (No. KCT0006312 RESULTS Baseline characteristics and pulmonary fibrosis Among the 125 enrolled patients, the mean age was 68.5 years, 60% of them were male, and 7.2% had pre-existing lung disease. One or more fibrotic-like changes were identified in 75.2% (94/125) of all patients. No differences were observed in baseline characteristics, including body mass index and smoking history, between patients with fibrotic-like changes and those without them ( Table 1 Supplementary Table 1 Table 1 Comparison of baseline characteristics between the pulmonary fibrosis and no pulmonary fibrosis groups Variables All patients PF group No PF group P No. of patients 125 94 31 Age, yr 68.5 ± 12.3 68.7 ± 11.0 67.8 ± 15.7 0.775 BMI, kg/m 2 25.0 ± 4.2 25.0 ± 3.6 24.9 ± 5.8 0.941 Sex, male 76 (60.8) 56 (59.6) 20 (64.5) 0.625 Smoking history 0.152 Never-smoker 80 (75.5) 60 (76.9) 20 (71.4) Ex-smoker 19 (17.9) 15 (19.2) 4 (14.3) Current smoker 7 (6.6) 3 (3.8) 4 (14.3) Comorbidity No. of comorbidities ≥ 1 97 (77.6) 74 (78.7) 23 (74.2) 0.600 Diabetes mellitus 53 (42.4) 39 (41.5) 14 (45.2) 0.720 Hypertension 83 (66.4) 61 (64.9) 22 (71.0) 0.535 Cardiovascular disease 16 (12.8) 11 (11.7) 5 (16.1) 0.542 Cerebrovascular disease 18 (14.4) 13 (13.8) 5 (16.1) 0.711 Liver disease 4 (3.2) 2 (2.1) 2 (6.5) 0.257 Kidney disease 10 (8.0) 6 (6.4) 4 (12.9) 0.263 Malignancy 13 (10.4) 9 (7.4) 4 (12.7) 0.735 Lung disease 9 (7.2) 6 (6.4) 3 (9.7) 0.689 COPD 3 (33.3) 2 (33.3) 1 (33.3) 1.000 Asthma 4 (44.4) 3 (50.0) 1 (33.3) 1.000 Bronchiectasis 1 (11.1) 1 (16.7) 0 (0.0) 1.000 Lung cancer 1 (11.1) 0 (0.0) 1 (33.3) 0.333 TB destroyed lung 2 (22.2) 1 (16.7) 1 (33.3) 1.000 CCI 1.2 ± 1.2 1.1 ± 1.5 1.5 ± 1.4 0.148 Data are presented as mean ± standard deviation or number (%), unless otherwise stated. PF = pulmonary fibrosis, BMI = body mass index, COPD = chronic obstructive pulmonary disease, TB destroyed lung = tuberculosis destroyed lung, CCI = Charlson Comorbidity Index. Among all patients, 54 (43.2%) exhibited two or more fibrotic-like changes and 7 (5.6%) exhibited three or more such changes ( Table 2 P Table 2 Radiographic findings detected on chest computed tomography scan Radiographic findings No. of patients All patients 125 Fibrosis (any component) 94 (75.2) Reticulation 23 (18.4) Architectural distortion and/or parenchymal band 56 (44.8) Traction bronchiectasis/bronchiolectasis 76 (60.8) Honeycombing 1 (0.8) Fibrosis (≥ 2 components) 54 (43.2) Fibrosis (≥ 3 components) 7 (5.6) Data are presented as number (%), unless otherwise stated. Treatment In total, 94.4% (118/125) of patients received systemic steroids and 74.7% (93/125) received antiviral therapy, mostly remdesivir ( Supplementary Table 2 Mortality and ventilator-associated complications Overall, 22 (17.6%) patients died during hospitalization, and 89 (71.2%) experienced one or more ventilator-associated complications. No differences in in-hospital mortality and occurrence of complications were observed between the two groups ( Table 3 Table 3 Comparison of mortality and complications between pulmonary fibrosis and no pulmonary fibrosis groups Variables All patients PF group No PF group P No. of patients 125 94 31 Complication 89 (71.2) 68 (72.3) 21 (67.7) 0.624 IRAI 16 (12.8) 13 (13.8) 3 (9.7) 0.759 VAP 56 (44.8) 45 (49.7) 11 (35.5) 0.229 VILI 14 (11.2) 10 (10.6) 4 (12.9) 0.747 Hemodynamic disturbance 43 (34.4) 32 (34.0) 11 (35.5) 0.884 Mortality 22 (17.6) 17 (18.1) 5 (16.1) 0.804 Data are presented as number (%), unless otherwise stated. PF = pulmonary fibrosis, IRAI = intubation-related airway injury, VAP = ventilator associated pneumonia, VILI = ventilator induced lung injury. Factors associated with pulmonary fibrosis Univariable logistic regression analysis identified that a higher heart rate (odds ratio [OR], 0.966; 95% confidence interval [CI], 0.944–0.989; P P P Table 4 6 7 13 14 15 16 P P Table 4 Table 4 Logistic regression analysis for identifying risk factors associated with pulmonary fibrosis Variables Univariate analysis Multivariate analysis b OR (95% CI) P OR (95% CI) P Age, yr 1.006 (0.973–1.039) 0.730 - - Sex, male 1.234 (0.531–2.867) 0.625 - - BMI, kg/m 2 1.005 (0.912–1.107) 0.926 - - Current or past smoker 1.333 (0.503–3.533) 0.563 - - Lung disease 1.571 (0.369–6.697) 0.541 - - CCI 0.797 (0.584–1.086) 0.150 - - Systolic BP, mmHg 1.010 (0.994–1.027) 0.214 - - Diastolic BP, mmHg 1.010 (0.986–1.036) 0.416 - - Heart rate, /min 0.966 (0.944–0.989) 0.004 0.963 (0.937–0.990) 0.008 Respiratory rate, /min 0.986 (0.927–1.049) 0.654 - - P/F ratio 1.000 (0.991–1.008) 0.934 - - SOFA score 0.868 (0.754–0.999) 0.049 1.013 (0.849–1.209) 0.886 APACHE score 0.996 (0.944–1.050) 0.877 - - Leukocyte, × 10 3 0.982 (0.924–1.043) 0.546 - - Neutrophil, % 1.010 (0.975–1.047) 0.584 - - Hemoglobin, g/dL 0.961 (0.777–1.188) 0.714 - - Platelet, × 10 3 0.999 (0.996–1.003) 0.741 - - AST, IU/L 0.991 (0.980–1.002) 0.120 - - ALT, IU/L 0.993 (0.982–1.005) 0.245 - - Total bilirubin, mg/dL 0.371 (0.123–1.117) 0.078 - - Total protein, g/dL 0.929 (0.526–1.641) 0.799 - - Albumin, g/dL 1.164 (0.469–2.888) 0.744 - - BUN, mg/dL 0.987 (0.965–1.009) 0.238 - - Creatinine, mg/dL 0.893 (0.592–1.346) 0.589 - - LDH, U/l 0.999 (0.997–1.000) 0.086 - - CRP, mg/L 0.998 (0.948–1.051) 0.953 - - Procalcitonin, ng/mL 1.015 (0.796–1.294) 0.905 - - Troponin I, ng/mL 0.995 (0.988–1.002) 0.177 - - D-dimer, mcg/mL 1.016 (0.967–1.067) 0.533 - - Minute ventilation, L/min 1.043 (0.881–1.233) 0.627 - - Peak pressure, cm H 2 0.989 (0.889–1.101) 0.846 - - Use of antiviral agents 0.642 (0.263–1.565) 0.329 - - Use of steroid 0.815 (0.150–4.426) 0.812 - - Steroid duration days 0.989 (0.940–1.041) 0.678 - - Steroid dose per day, mg a 0.964 (0.933–0.996) 0.028 0.961 (0.849–0.993) 0.018 Steroid total dose, mg a 1.000 (0.997–1.003) 0.974 - - Use of NMBA 0.886 (0.290–2.704) 0.832 - - NO inhalation 2.045 (0.237–17.686) 0.516 - - Prone duration, days 1.064 (0.627–1.806) 0.819 - - CRRT duration, days 1.013 (0.968–1.059) 0.580 - - ECMO duration, days 1.073 (0.949–1.215) 0.262 - - OR = hazard ratios, CI = confidence interval, BMI = body mass index, CCI = Charlson Comorbidity Index, BP = blood pressure, P/F = PaO 2 2 a b DISCUSSION In our study, pulmonary fibrotic-like changes were observed in about three-quarters of patients with severe COVID-19 pneumonia requiring MV. A higher daily steroid dose was associated with a decreased risk of pulmonary fibrosis, along with a higher heart rate on ICU admission. The reported incidence of pulmonary fibrosis in patients with COVID-19 varies from 25.5% to 84.1%, 7 8 13 14 15 16 17 Previous studies have suggested patient-related factors such as older age, male sex, smoking, obesity, and underlying disease 7 8 13 14 15 16 18 19 20 21 22 23 24 25 Dexamethasone has become a standard treatment for severe COVID-19 patients who require oxygen therapy and MV due to its significant protective effect against mortality. 26 27 28 29 30 31 32 33 34 35 36 However, the dose of dexamethasone used in the standard treatment of severe COVID-19 is considerably lower than the corticosteroid dose used in the treatment of acute exacerbations of idiopathic pulmonary fibrosis. 37 38 39 To our knowledge, this is the first observational study investigating the characteristics and risk factors associated with pulmonary fibrosis in patients with severe COVID-19 requiring MV. However, our study is subject to several limitations due to its retrospective nature. First, there is a possibility of selection bias, as only patients who underwent CT scans were included, potentially favoring those suspected of having fibrosis. Since data from patients without CT scans were not collected per study criteria, additional analyses to address this bias were not feasible. Second, defining fibrosis onset based on CT diagnosis may have caused outcome misclassification, particularly if CT evaluations occurred after fibrosis had already developed. Such misclassification could introduce bias, potentially affecting the accuracy of association estimates in the analysis. Third, CT used to assess pulmonary fibrosis development was performed within a short period of time after ICU admission. Notably, long-term follow-up CT studies including patients with severe COVID-19 pneumonia have demonstrated that lung fibrosis can resolve over time. The lack of long-term follow-up and assessment of pulmonary function in our study limited our understanding of progression or resolution of pulmonary fibrosis in patients with severe COVID-19. 7 13 40 In conclusion, our study demonstrated that fibrotic-like changes were observed on chest CT scans in approximately three-quarters of patients with severe COVID-19 pneumonia requiring MV. Furthermore, our findings suggest that higher daily dose of steroid may play a critical role in mitigating fibrotic progression. Further research is needed to determine the optimal timing, dosage, and duration of corticosteroid therapy, particularly in patients with severe COVID-19, to improve clinical outcomes and prevent long-term pulmonary sequelae. Funding: Disclosure: Data Sharing Statement: Supplementary Data 1 Author Contributions: Conceptualization: Data curation: Formal analysis: Funding acquisition: Investigation: Methodology: Project administration: Resources: Supervision: Writing - original draft: Writing - review & editing: 1 World Health Organization WHO COVID-19 dashboard Updated 2025 Accessed August 15, 2023 https://covid19.who.int/ 2 Mahase E COVID-19: what do we know about “long COVID”? BMJ 2020 370 m2815 32665317 10.1136/bmj.m2815 3 Willi S Lüthold R Hunt A Hänggi NV Sejdiu D Scaff C COVID-19 sequelae in adults aged less than 50 years: a systematic review Travel Med Infect Dis 2021 40 101995 33631340 10.1016/j.tmaid.2021.101995 PMC7898978 4 So M Kabata H Fukunaga K Takagi H Kuno T Radiological and functional lung sequelae of COVID-19: a systematic review and meta-analysis BMC Pulm Med 2021 21 1 97 33752639 10.1186/s12890-021-01463-0 PMC7983097 5 Fan Y Li X Zhang L Wan S Zhang L Zhou F SARS-CoV-2 omicron variant: recent progress and future perspectives Signal Transduct Target Ther 2022 7 1 141 35484110 10.1038/s41392-022-00997-x PMC9047469 6 Lee JH Yim JJ Park J Pulmonary function and chest computed tomography abnormalities 6-12 months after recovery from COVID-19: a systematic review and meta-analysis Respir Res 2022 23 1 233 36068582 10.1186/s12931-022-02163-x PMC9446643 7 Li X Shen C Wang L Majumder S Zhang D Deen MJ Pulmonary fibrosis and its related factors in discharged patients with new corona virus pneumonia: a cohort study Respir Res 2021 22 1 203 34243776 10.1186/s12931-021-01798-6 PMC8267229 8 Ali RMM Ghonimy MBI Post-COVID-19 pneumonia lung fibrosis: a worrisome sequelae in surviving patients Egypt J Radiology Nucl Med 2021 52 101 9 Pacheco-Lopez PC Berkow LC Hillel AT Akst LM Complications of airway management Respir Care 2014 59 6 1006 1021 24891204 10.4187/respcare.02884 10 Haribhai S Mahboobi SK Ventilator Complications. In StatPearls Updated 2023 Accessed August 15, 2023 https://www.ncbi.nlm.nih.gov/books/NBK560535/ 32809370 11 Slutsky AS Ranieri VM Ventilator-induced lung injury N Engl J Med 2013 369 22 2126 2136 24283226 10.1056/NEJMra1208707 12 Hansell DM Bankier AA MacMahon H McLoud TC Müller NL Remy J Fleischner society: glossary of terms for thoracic imaging Radiology 2008 246 3 697 722 18195376 10.1148/radiol.2462070712 13 Han X Fan Y Alwalid O Li N Jia X Yuan M Six-month follow-up chest CT findings after severe COVID-19 pneumonia Radiology 2021 299 1 E177 E186 33497317 10.1148/radiol.2021203153 PMC7841877 14 Yang ZL Chen C Huang L Zhou SC Hu YN Xia LM Fibrotic changes depicted by thin-section CT in patients with COVID-19 at the early recovery stage: preliminary experience Front Med (Lausanne) 2020 7 605088 33330571 10.3389/fmed.2020.605088 PMC7732534 15 Marvisi M Ferrozzi F Balzarini L Mancini C Ramponi S Uccelli M First report on clinical and radiological features of COVID-19 pneumonitis in a Caucasian population: factors predicting fibrotic evolution Int J Infect Dis 2020 99 485 488 32841688 10.1016/j.ijid.2020.08.054 PMC7443096 16 Zou JN Sun L Wang BR Zou Y Xu S Ding YJ The characteristics and evolution of pulmonary fibrosis in COVID-19 patients as assessed by AI-assisted chest HRCT PLoS One 2021 16 3 e0248957 33755708 10.1371/journal.pone.0248957 PMC7987145 17 Nabahati M Ebrahimpour S Khaleghnejad Tabari R Mehraeen R Post-COVID-19 pulmonary fibrosis and its predictive factors: a prospective study Egypt J Radiology Nucl Med 2021 52 248 18 Xue M Zhang T Chen H Zeng Y Lin R Zhen Y Krebs von den Lungen-6 as a predictive indicator for the risk of secondary pulmonary fibrosis and its reversibility in COVID-19 patients Int J Biol Sci 2021 17 6 1565 1573 33907520 10.7150/ijbs.58825 PMC8071769 19 Naderi N Rahimzadeh M Krebs von den Lungen-6 (KL-6) as a clinical marker for severe COVID-19: a systematic review and meta-analyses Virology 2022 566 106 113 34896901 10.1016/j.virol.2021.11.006 PMC8642780 20 Hu ZJ Xu J Yin JM Li L Hou W Zhang LL Lower circulating interferon-gamma is a risk factor for lung fibrosis in COVID-19 patients Front Immunol 2020 11 585647 33133104 10.3389/fimmu.2020.585647 PMC7550399 21 Ghahramani S Tabrizi R Lankarani KB Kashani SMA Rezaei S Zeidi N Laboratory features of severe vs. non-severe COVID-19 patients in Asian populations: a systematic review and meta-analysis Eur J Med Res 2020 25 1 30 32746929 10.1186/s40001-020-00432-3 PMC7396942 22 Velavan TP Meyer CG Mild versus severe COVID-19: laboratory markers Int J Infect Dis 2020 95 304 307 32344011 10.1016/j.ijid.2020.04.061 PMC7194601 23 Hama Amin BJ Kakamad FH Ahmed GS Ahmed SF Abdulla BA Mohammed SH Post COVID-19 pulmonary fibrosis; a meta-analysis study Ann Med Surg (Lond) 2022 77 103590 35411216 10.1016/j.amsu.2022.103590 PMC8983072 24 Shen Y Cheng C Zheng X Jin Y Duan G Chen M Elevated procalcitonin is positively associated with the severity of COVID-19: a meta-analysis based on 10 cohort studies Medicina (Kaunas) 2021 57 6 594 34207689 10.3390/medicina57060594 PMC8227321 25 Yoon HY Uh ST Post-coronavirus disease 2019 pulmonary fibrosis: wait or needs intervention Tuberc Respir Dis 2022 85 4 320 331 10.4046/trd.2022.0053 PMC9537661 35722706 26 Horby P Lim WS Emberson JR Mafham M Bell JL Linsell L Dexamethasone in hospitalized patients with COVID-19 N Engl J Med 2021 384 8 693 704 32678530 10.1056/NEJMoa2021436 PMC7383595 27 Sterne JAC Murthy S Diaz JV Slutsky AS Villar J Angus DC Association between administration of systemic corticosteroids and mortality among critically ill patients with COVID-19: a meta-analysis JAMA 2020 324 13 1330 1341 32876694 10.1001/jama.2020.17023 PMC7489434 28 World Health Organization Corticosteroids for COVID-19 Updated 2020 Accessed August 15, 2023 https://www.who.int/publications/i/item/WHO-2019-nCoV-Corticosteroids-2020.1 29 National Institutes of Health COVID-19 treatment guidelines, corticosteroids Updated 2024 Accessed August 11, 2025 https://www.ncbi.nlm.nih.gov/books/NBK570371/pdf/Bookshelf_NBK570371.pdf 30 Shankar-Hari M Vale CL Godolphin PJ Fisher D Higgins JPT Spiga F Association between administration of IL-6 antagonists and mortality among patients hospitalized for COVID-19: a meta-analysis JAMA 2021 326 6 499 518 34228774 10.1001/jama.2021.11330 PMC8261689 31 Kalil AC Patterson TF Mehta AK Tomashek KM Wolfe CR Ghazaryan V Baricitinib plus Remdesivir for hospitalized adults with COVID-19 N Engl J Med 2021 384 9 795 807 33306283 10.1056/NEJMoa2031994 PMC7745180 32 Guimarães PO Quirk D Furtado RH Maia LN Saraiva JF Antunes MO Tofacitinib in patients hospitalized with COVID-19 pneumonia N Engl J Med 2021 385 5 406 415 34133856 10.1056/NEJMoa2101643 PMC8220898 33 Agarwal A Hunt B Stegemann M Rochwerg B Lamontagne F Siemieniuk RA A living WHO guideline on drugs for COVID-19 BMJ 2020 370 m3379 32887691 10.1136/bmj.m3379 34 Huang R Zhu C Jian Wang Xue L Li C Yan X Corticosteroid therapy is associated with the delay of SARS-CoV-2 clearance in COVID-19 patients Eur J Pharmacol 2020 889 173556 32941927 10.1016/j.ejphar.2020.173556 PMC7490250 35 Cano EJ Fonseca Fuentes X Corsini Campioli C O’Horo JC Abu Saleh O Odeyemi Y Impact of corticosteroids in coronavirus disease 2019 outcomes: systematic review and meta-analysis Chest 2021 159 3 1019 1040 33129791 10.1016/j.chest.2020.10.054 PMC7598533 36 Collard HR Ryerson CJ Corte TJ Jenkins G Kondoh Y Lederer DJ Acute exacerbation of idiopathic pulmonary fibrosis. An international working group report Am J Respir Crit Care Med 2016 194 3 265 275 27299520 10.1164/rccm.201604-0801CI 37 Raghu G Collard HR Egan JJ Martinez FJ Behr J Brown KK An official ATS/ERS/JRS/ALAT statement: idiopathic pulmonary fibrosis: evidence-based guidelines for diagnosis and management Am J Respir Crit Care Med 2011 183 6 788 824 21471066 10.1164/rccm.2009-040GL PMC5450933 38 Granholm A Munch MW Myatra SN Vijayaraghavan BKT Cronhjort M Wahlin RR Dexamethasone 12 mg versus 6 mg for patients with COVID-19 and severe hypoxaemia: a pre-planned, secondary Bayesian analysis of the COVID STEROID 2 trial Intensive Care Med 2022 48 1 45 55 34757439 10.1007/s00134-021-06573-1 PMC8579417 39 Lopinto J Arrestier R Peiffer B Gaillet A Voiriot G Urbina T High-dose steroids for nonresolving acute respiratory distress syndrome in critically ill COVID-19 patients treated with dexamethasone: a multicenter cohort study Crit Care Med 2023 51 10 1306 1317 37199534 10.1097/CCM.0000000000005930 40 Steinbeis F Thibeault C Doellinger F Ring RM Mittermaier M Ruwwe-Glösenkamp C Severity of respiratory failure and computed chest tomography in acute COVID-19 correlates with pulmonary function and respiratory symptoms after infection with SARS-CoV-2: an observational longitudinal study over 12 months Respir Med 2022 191 106709 34871947 10.1016/j.rmed.2021.106709 PMC8632363 SUPPLEMENTARY MATERIALS Supplementary Data 1 Data sharing statement Supplementary Table 1 Comparison of clinical findings at intensive care unit admission between the pulmonary fibrosis and no pulmonary fibrosis groups Supplementary Table 2 Comparison of treatment between PF and no PF groups Supplementary Fig. 1 Fibrotic-like changes detected on computed tomography scans. ( A B C D ",
  "metadata": {
    "Title of this paper": "Severity of respiratory failure and computed chest tomography in acute COVID-19 correlates with pulmonary function and respiratory symptoms after infection with SARS-CoV-2: an observational longitudinal study over 12 months",
    "Journal it was published in:": "Journal of Korean Medical Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480960/"
  }
}