{
  "title": "Paper_419",
  "abstract": "pmc Cancer Sci Cancer Sci 2682 cas CAS Cancer Science 1347-9032 1349-7006 Wiley PMC12485665 PMC12485665.1 12485665 12485665 40734624 10.1111/cas.70142 CAS70142 CAS-OA-0641-2025.R3 1 Original Article ORIGINAL ARTICLE Genetics, Genomics and Proteomics Discovery of Novel  RASGRF2 Terashima Yuki  1  2 Park Soohwan  1  3 Ikeuchi Hiroshi  1  3 Hayashi Takuo  4 Kojima Shinya  1 Ueno Toshihide  1 Ikegami Masachika  1 Kitada Rina  1 Suehara Yoshiyuki  1 Tanaka Shinya https://orcid.org/0000-0001-6470-3301  2  5 Suzuki Kenji  3 Mano Hiroyuki https://orcid.org/0000-0003-4645-0181  1 Takamochi Kazuya  3 ktakamo@juntendo.ac.jp Kohsaka Shinji https://orcid.org/0000-0001-8651-6136  1 skohsaka@ncc.go.jp   1 Division of Cellular Signaling National Cancer Center Research Institute Tokyo Japan   2 Department of Cancer Pathology Faculty of Medicine, Hokkaido University Sapporo Japan   3 Department of General Thoracic Surgery Juntendo University School of Medicine Tokyo Japan   4 Department of Human Pathology Juntendo University, Graduate School of Medicine Tokyo Japan   5 Institute for Chemical Reaction Design and Discovery, Hokkaido University Sapporo Japan * Correspondence: ktakamo@juntendo.ac.jp skohsaka@ncc.go.jp 30 7 2025 10 2025 116 10 498068 10.1111/cas.v116.10 2868 2881 12 6 2025 19 3 2025 02 7 2025 30 07 2025 02 10 2025 02 10 2025 © 2025 The Author(s). Cancer Science https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc/4.0/ ABSTRACT Lung adenocarcinomas (LUADs) in never‐smokers exhibit distinct molecular profiles from those of smokers, and their driver mutations are quite divergent. We aimed to evaluate the utility of RNA‐seq for the molecular profiling of LUAD in Japanese never or light smokers. A hybridization capture‐based RNA panel (TOP2‐RNA) was used to confirm the validity of mutational and expression analyses of the panel in 122 Japanese LUAD cases. For the discovery cohort, 270 primary LUADs were molecularly profiled using TOP2‐RNA. Whole transcriptome sequencing (WTS) was conducted for the samples without any oncogenic driver mutations. A risk score was developed using TOP2‐RNA expression data to predict the prognosis of surgically resected LUAD. Driver oncogenes were identified in 180 cases (66.7%) of the discovery cohort. The frequency of MET EGFR RDX‐RASGRF1 PRKCI‐RASGRF2, OCLN‐RASGRF2 RASGRF RASGRF1/2 This study discovered actionable novel fusions of RASGRF1 and RASGRF2 in lung adenocarcinoma of never‐smoker and identified that those fusions transformed the cells through phosphorylation of MEK, which was inhibited by cobimetinib treatment. A risk score based on the four‐gene signature could predict the prognosis of surgically resected lung adenocarcinoma using RNA expression data. driver mutation lung adenocarcinoma molecular profiling never‐smoker RNA‐seq Japan Agency for Medical Research and Development 10.13039/100009619 JP22kk0305018 JP22zf0127009 JP23kk0305018 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  Funding: Abbreviations LUAD lung adenocarcinoma NSCLC non‐small cell lung cancer RASGRF Ras‐specific guanine nucleotide‐releasing factor WES whole‐exome sequencing WTS whole‐transcriptome sequencing 1 Introduction Globally, lung cancer is the leading cause of cancer morbidity and mortality, accounting for over 1.8 million deaths annually [ 1 EGFR 2 3 KRAS 4 BRAF 5 MET 6 7 ALK 8 9 RET 10 ROS1 11 12 NTRK1/2/3 13 14 ERBB2 15 16 NRG1 17 Today, targetable molecular alterations are identified in approximately 60% and 80% of patients with Western and Asian LUAD, respectively [ 18 MET 19 20 Although smoking‐related lung cancers continue to account for the majority of diagnoses, smoking rates have been decreasing for several decades, resulting in a proportional increase in the incidence of lung cancer in individuals who have never smoked (LCINS) [ 21 22 23 KRAS TP53 EGFR 22 24 Given the increased likelihood of targetable somatic alterations, several diagnostic and management principles can be applied to LCINS. While panel‐based NGS is preferred for broad target coverage, fusion detection via DNA‐based NGS is challenging due to degraded DNA in formalin‐fixed and paraffin‐embedded (FFPE) samples. Targeted DNA panels often miss rarer fusions like NTRK1/2/3 NRG1 ROS1 25 26 27 28 29 Significant research on gene expression‐based prognostic signatures using microarrays has led to the commercialization of two LUAD biomarkers (myPlan Lung Cancer and Pervenio Lung RS), but their accuracy in predicting survival remains limited. RNA‐seq can address some microarray limitations, especially for detecting low‐level transcripts. While a recent study used RNA‐seq for prognostic analysis in LUAD with TCGA data [ 29 30 To assess the importance of RNA‐seq in clinical practice, the present study aimed to evaluate the validity and utility of a targeted RNA panel, TOP2‐RNA, in detecting known oncogenic driver mutations in LUAD of never or light smokers. Gene expression analysis was performed to develop a risk score to predict cancer recurrence after surgery for LUAD in the early stage. Furthermore, whole transcriptome sequencing (WTS) was conducted to explore novel oncogenic alterations among tumors lacking known drivers. 2 Materials and Methods Detailed information can be found in Doc. S1 2.1 Study Design and Patient Specimens The study included 392 LUAD patients who underwent surgery at Juntendo University (2010–2019). The validation cohort (122 patients, 2010–2014) included 122 of 125 cases from a previous whole‐exome sequencing (WES) and RNA‐seq study [ 31 EGFR 32 1 TABLE 1 Clinicopathological description of the two cohorts of the present study. Variable Stratication #Cases (%) Validation cohort Discovery cohort Age < 40 5 (4.1%) 11 (4.1%) 40–59 32 (26.2%) 57 (21.1%) 60–79 76 (62.3%) 170 (63.0%) ≥ 80 9 (7.4%) 32 (11.9%) Gender Female 93 (76.2%) 183 (67.8%) Male 29 (23.8%) 87 (32.2%) Smoking Never smoker 99 (81.1%) 214 (79.3%) Light smoker 23 (18.9%) 56 (20.7%) Stage 0 0 (0%) 21 (7.8%) I 104 (85.2%) 191 (70.7%) II 3 (2.5%) 23 (8.5%) III 3 (2.5%) 28 (10.4%) IV 0 (0%) 5 (1.9%) NA 12 (9.8%) 2 (0.7%) 2.2 Data Collection From the Center for Cancer Genomics and Advanced Therapeutics (C‐ CAT GENIE C‐CAT is a national cancer genomics database storing clinical and genomic data from comprehensive genomic profiling tests in Japan [ 33 34 2.3  WTS WES The molecular profiling of the validation cohort was conducted and described elsewhere [ 31 2.4  TOP2 RNA Total RNA was extracted from the fresh frozen samples. cDNA was synthesized from 200 ng RNA. Target enrichment used TOP2‐RNA‐V6 probes and the Twist Library Preparation EF Kit (Twist Bioscience, South San Francisco, CA). Sequencing on a NovaSeq 6000 (Illumina) generated paired‐end reads, aligned to hg38. Mutations were called using an in‐house method based on SAMtools' mpileup and filtered by depth (< 20), allele frequency (< 0.05), or presence in the 1000 Genomes Project or in‐house database. 2.5  TOP2 RNA Fusion genes were detected using STAR‐Fusion (v1.2.0; https://github.com/STAR‐Fusion https://bio‐bwa.sourceforge.net/ https://subread.sourceforge.net/ 2.6 Targeted Amplicon Sequencing of MET Genomic DNA was prepared from the frozen samples. MET S1 2.7  WTS Total RNA was extracted from fresh frozen samples. A total of 200 ng of RNA was converted to cDNA. Using a paired‐end option, sequencing was conducted using NovaSeq 6000 (Illumina). Gene fusion was analyzed using STAR‐Fusion and Arriba ( https://github.com/suhrig/arriba 2.8 Prognostic Signature Generation and Gene Set Enrichment Analysis ( GSEA Univariate Cox regression identified 15 genes ( p S1 2.9 Cell Lines HEK293T cells (RRID:CVCL_0063) and 3 T3 (RRID:CVCL_0594) fibroblasts were maintained in Dulbecco's modified Eagle's medium‐F12 (DMEM‐F12) with 10% FBS (both from Thermo Fisher Scientific). Authentication and Mycoplasma testing were not conducted within 6 months. 2.10 Retrovirus Preparation and Cell Transduction Full‐length and fusion cDNAs of RASGRF1 NM_001145648 RASGRF2 NM_006909 2.11 Focus Formation Assay 3 T3 cells expressing variants were cultured for 2 weeks, then stained with Giemsa solution. 2.12  PrestoBlue The transformed 3 T3 cells expressing each RASGRF1/2 2.13 Western Blotting Protein separation and detection were performed using a Simple Western system and Compass software (ProteinSimple, San Jose, CA). Antibody information is provided in Doc. S1 3 Results 3.1 The Validity of Targeted RNA LUAD The study overview is shown in Figure 1A 1B S1 MET EGFR, ERBB2 BRAF EML4‐ALK MET FIGURE 1 Study design and the validity of targeted RNA sequencing for the molecular profiling of LUAD. (A) The overview of the study. (B) TOP2‐RNA successfully identified the oncogenic mutations of EGFR, ERBB2, BRAF MAP2K1 MET EGFR ERBB2 MET r TOP2‐RNA TPM expression correlated with WTS ( EGFR ERBB2 MET 1C S2 EGFR ERBB2 MET S1 3.2 Comparison of Gene Alteration Frequencies in LUAD Driver gene alteration frequencies in Japanese and US LUAD cohorts were compared to assess Comprehensive genomic profiling (CGP) test utility. While overall frequencies differed, they were similar when stratified by smoking history. EGFR KRAS BRAF 2A S3 EGFR ALK RET KRAS 2A S4 EGFR p −6 p −4 FIGURE 2 Comparison of the frequency of gene alterations in the discovery cohort to the real‐world data of LUAD in Japan and the United States. (A) Comparison of the frequency of gene alterations between patients LUAD in Japan and those in the United States and the clinical features related to gene alterations. The volcano plots (upper panels) indicate the clinical features correlating with gene alterations. The odds ratio (logistic regression) to acquire the stated gene alterations and p S4 EGFR KRAS ERBB2 BRAF MAP2K1, MET ALK RET ROS1 FGFR1/2/3 NTRK1/2/3 n EGFR MET MET MET MET MET C > A single base substitution, linked to smoking, was more frequent in smokers of C‐CAT and GENIE cohorts (21.2% vs. 12.6% for C‐CAT and 39.3% vs. 13.2% for GENIE) (Figure S2 3.3 Targeted RNA  MET In the discovery cohort ( n 2B S5 The frequencies of oncogenic mutations in EGFR, KRAS, ERBB2, BRAF MAP2K1 MET ALK RET ROS1 NRG1 S3 KIF5B‐EGFR TPM3‐NTRK1 MYB‐NFIB MYBL1‐NFIB EGFR KRAS, ERBB2, BRAF MAP2K1 MET ALK RET ROS1 NRG1 2C MET p NRG1 NRG1 mRNA overexpression was detected in EGFR FGFR1 FGFR2 FGFR3 MET PDGFRA PDGFRB MDM2 CDK4 2A S4 3.4 Mutational Analysis on the  MET Targeted amplicon sequencing of 25 MET 2D S6 MET S5A S5B S5C 3.5 Discovery of Novel Oncogenic  RASGRF2 WTS of 114 never/light smokers' samples, including 90 samples without driver oncogenes, identified 30 fusion genes in 16 cases by both STAR‐Fusion and Arriba, among them novel RDX‐RASGRF1 PRKCI‐RASGRF2 3A S7 OCLN‐RASGRF2 RASGRF1 RASGRF2 FIGURE 3 Discovery of novel oncogenic RASGRF2 RDX‐RASGRF1 PRKCI‐RASGRF2 OCLN‐RASGRF2 RASGRF1/2 RASGRF1/2 RASGRF1/2 RASGRF1/2 RASGRF1/2 RASGRF1/2  RASGRF1/2 2 S6A–C TABLE 2 Clinicopathologic characteristics of patients with RASGRF1 RASGRF2 Sample ID Fusion Age Gender Smoking index Primary tumor site Surgery Postoperative pathological diagnosis Proportions of histological subtypes Pathological stage IASLC grade STAS Adjuvant chemotherapy Postoperative course LUAD_267  PRKCI‐RASGRF2 64 Female 0 Left lower lobe  Left lower lobectomy  Papillary adenocarcinoma  Papillary 60% Acinar 20% Micropapillary 20% IA3 (pT1cN0M0) Grade 3 + UFT for 2 years Alive with no reccurence at 5 years and 9 months. LUAD_100  OCLN‐RASGRF2 74 Female 0 Right lower lobe Right lower lobectomy Papillary adenocarcinoma  Papillary 70% Lepidic 20% Acinar 10% IIIA (pT1aN2M0) Grade 2 −  CDDP + VNR (discontinued after one cycle due to AE)  Recurrent at 7 years after the surgery. Died 3 years later. LUAD_308  RDX‐RASGRF1 81 Female 0 Left lower lobe Left lower lobectomy Solid adenocarcinoma  Solid 50% Acinar 20% Papillary 20% Micropapillary 10% IA3 (pT1cN0M0) Grade 3 + −  Recurrent at 29 months after the surgery, and a left total lobecotmy was performed. Died 7 months later. Abbreviations: AE, adverse events; CDDP, cisplatin; IASLC, the International Association for the Study of Lung Cancer; STAS, a spread through the alveolar spaces; UFT, uracil and tegafur; VNR, vinorelbine; +, present; −, absent.  RASGRF2 PRKCI‐RASGRF2 RASGRF1 RDX‐RASGRF1 3B To assess contact inhibition loss, 3 T3 cells expressing RASGRF1/2 RASGRF1/2 3C Given the expected RAS activity of RASGRF2, MEK inhibitor cobimetinib sensitivity was tested. 3 T3 cells with RDX‐RASGRF1 PRKCI‐RASGRF2, and OCLN‐RASGRF2 50 3D RASGRF1/2 3E 3.6 Prognostic Biomarker of LUAD There is a substantial risk for recurrence and death in patients with early‐stage LUAD, even after undergoing complete surgical resection. The use of adjuvant therapy in LUAD at the early stages, particularly at stage I, remains controversial because no consistent survival benefit was demonstrated in previous randomized trials. Reliable prognostic biomarkers are critically needed to identify the patients at high risk for recurrence and who might benefit from additional systemic therapies. Our previous study has not shown a difference in postoperative prognosis based on the presence or absence of driver mutations [ 32 We analyzed 1390 genes with a standard deviation of TPM of > 1.0 to ensure adequate variance. Univariate Cox proportional hazards regression analysis in the discovery cohort showed that 15 genes were significantly correlated with RFS ( p S7 CA9, GAST, IGF2BP3 UGT1A1 35 36 37 38 39 40 We constructed a risk score with the regression coefficients from this model and determined the optimal cut‐off value to be 2.43 using the surv_cutpoint from the survminer package (Figure 4A p −8 p −8 p −3 p −4 4B FIGURE 4 Four‐gene prognostic signature in LUAD in Japanese patients who have never smoked or only lightly smoked. (A) Four‐gene expression and risk score distribution in the discovery cohort by z‐score (in the lower part). Here, red indicates a higher expression, whereas light blue indicates a lower expression. The risk scores for all patients are plotted in ascending order (in the middle part) and marked as a low risk (blue) or a high risk (red), as divided by the threshold (horizontal black line). The risk score threshold is 2.43. The clinical information and mutational status of the individual samples are shown in the upper part. SI, smoking index; NA, not available. (B) Kaplan–Meier curves of overall survival and recurrence‐free survival for all stages (upper) or for stage I (lower) in the discovery cohort stratified by the four‐gene prognostic signature into those at high and low risk. A univariate Cox analysis was used to calculate the hazard ratio (HR). The HR, 95% confidence interval (CI), p S8 Using the same risk score cut‐off value, the four‐gene prognostic signature significantly stratified the validation cohort for the RFS and OS for all stages ( p −3 p −3 p −2 p −2 S8 Finally, in a multivariable Cox analysis that includes the EGFR ALK p −5 3 TABLE 3 Cox proportional hazard models of discovery cohort of Japanese lung adenocarcinoma. Variables Categories No. Univariate analysis Multivariate analysis Hazard ratio 95% CI  p Hazard ratio 95% CI  p Gender Female 183 Male 87 2.51 1.34–4.72 4.1E‐03 1.63 0.85–3.11 0.14  Age < 40 11 40–59 57 0.73 0.08–6.50 0.78 60–79 170 1.61 0.22–11.9 0.64 ≥ 80 32 3.82 0.48–30.1 0.20 Smoking index 0–100 48 ≥ 101 222 1.15 0.53–2.50 0.73  Stage I 191 II 23 2.90 1.08–7.83 0.035 1.95 0.69–5.45 0.21 III 28 7.03 3.37–14.7 2.1E‐07 4.44 1.94–10.2 4.2E‐04 IV 5 14.9 4.24–52.2 2.5E‐05 18.6 4.82–72.1 2.3E‐05 Mutations  TP53 62 2.92 1.55–5.51 9.1E‐04 0.99 0.45–2.16 0.98  MET 38 1.34 0.59–3.03 0.49  KRAS 38 1.65 0.76–3.59 0.21  ERBB2 31 1.21 0.47–3.09 0.69  EGFR 18 0.00 0.00‐Inf 1.00  BRAF 16 0.40 0.05–2.89 0.36  ALK 14 0.43 0.06–3.11 0.40  MAP2K1 12 0.55 0.08–4.02 0.56  ROS1 9 0.84 0.12–6.15 0.87  NRG1 8 0.00 0.00‐Inf 1.00  PIK3CA 7 1.15 0.16–8.37 0.89  MYC 7 2.04 0.49–8.49 0.33  Risk score LR 217 HR 53 5.62 2.99–10.6 7.8E‐08 4.4 2.11–9.18 7.7E‐05  Note: Abbreviation: CI, confidence interval. GSEA was performed to understand the biological underpinning of high‐risk tumors. We found significant enrichment for high‐risk tumors for the gene sets related to cancer biology, including the E2F targets, G2M checkpoint, and MYC targets (Figure 4C S8 4 Discussion In this study, TOP2‐RNA identified driver mutations in two‐thirds of the patients previously negative for common EGFR 31 Particularly, the detection rate for MET MET MET 41 42 While TOP2‐RNA showed high concordance with WES and WTS for driver detection, some drivers were uniquely identified by either method. This may reflect differences in analysis pipelines or the detection threshold around VAF cutoffs. A key finding in this study is the identification of the novel RASGRF1/2 RASGRF2 43 RASGRF1 OCLN‐RASGRF1 TMEM87A‐RASGRF1 RASGRF1 44 45 TMEM154‐RASGRF1 SLC4A4‐RASGRF1 IQGAP1‐RASGRF1 44 46 A common feature of RASGRF1 RASGRF2 OCLN While clinical applications for RASGRF1/2 RASGRF1 45 RASGRF2 RASGRF3 RASGRF4 47 48 49 RASGRF There are some possible reasons why RASGRF2 RASGRF2 ALK RET EGFR OCLN RASGRF1 TMEM87A RASGRF1 44 45 RASGRF1/2 While genomic/transcriptomic testing is not yet routine in early‐stage disease, reliable prognostic biomarkers may help identify the patients who are at high risk for recurrence and who might benefit from additional systemic therapies. Our study findings can be easily applied in a clinical setting because the clinical grade test covering the same bait with TOP2‐RNA is available in clinical practice as GenMinTOP (Konica Minolta, Tokyo, Japan), which has been approved by the Pharmaceuticals and Medical Devices Agency (PMDA) and covered by national health insurance of Japan. This RNA‐based assay enables both driver detection and prognostic signature evaluation. Mutational profiling of LUAD in C‐CAT and GENIE revealed that driver mutation patterns were more strongly associated with smoking status than ethnicity: KRAS EGFR ALK RET 50 51 This study has several limitations. First, the C‐CAT and GENIE cohorts are different from our study cohort. Given that gene panel testing is currently approved for patients with advanced cancer who are refractory to the standard treatment in Japan, C‐CAT data may have a selection bias. In fact, the frequency of EGFR In conclusion, our study findings can be easily applied in a clinical setting. Moreover, our data indicate the value of applying gene expression profiling for predicting the prognosis after a surgical operation and that identifying actionable mutations is important for optimizing the targeted drugs. RASGRF2 Author Contributions  Yuki Terashima: Soohwan Park: Hiroshi Ikeuchi: Takuo Hayashi: Shinya Kojima: Toshihide Ueno: Masachika Ikegami: Rina Kitada: Yoshiyuki Suehara: Shinya Tanaka: Kenji Suzuki: Hiroyuki Mano: Kazuya Takamochi: Shinji Kohsaka: Ethics Statement This study was approved by the Ethics Committee of the National Cancer Center (2015‐202) and Juntendo University School of Medicine (No. 2014176). This study was conducted in accordance with the Declaration of Helsinki. Informed Consent: all patients provided signed consent forms. Registry and the Registration No. of the study/trial: N/A. Animal Studies: N/A. Consent All authors are in agreement with the content of the manuscript. Conflicts of Interest S. Kohsaka is an editorial board member of Cancer Science. S. Kohsaka reports research grants from Boehringer Ingelheim, Chordia Therapeutics, Eisai, Konica Minolta, CIMIC, and H.U. Group Research Institute. Other authors declare no conflicts of interest. Supporting information Data S1. Table S1. Figure S1. Acknowledgments The authors would like to thank Akane Maruyama‐Shiino and Hisashi Tomita for their technical assistance. The results presented in this publication are partially based on data generated by C‐CAT and the AACR Project GENIE registry. The authors gratefully acknowledge both C‐CAT and the American Association for Cancer Research for their financial and material support in the development of these registries, and extend their appreciation to all consortium members for their dedication to open data sharing. Data Availability Statement We deposited the raw sequencing data under accession number hum0094.v11 in the Japanese Genotype–Phenotype Archive, which is hosted by the DNA Data Bank of Japan [accession number JGAS000215]. References 1 F. Bray M. Laversanne H. Sung Global Cancer Statistics 2022: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA: A Cancer Journal for Clinicians 74 2024 229 263 38572751 10.3322/caac.21834 2 S. Lu T. Kato X. Dong Osimertinib After Chemoradiotherapy in Stage III EGFR‐Mutated NSCLC New England Journal of Medicine 391 2024 585 597 38828946 10.1056/NEJMoa2402614 3 S. S. Ramalingam J. Vansteenkiste D. Planchard Overall Survival With Osimertinib in Untreated, EGFR‐Mutated Advanced NSCLC New England Journal of Medicine 382 2020 41 50 31751012 10.1056/NEJMoa1913662 4 F. Skoulidis B. T. Li G. K. Dy Sotorasib for Lung Cancers With KRAS p.G12C Mutation New England Journal of Medicine 384 2021 2371 2381 34096690 10.1056/NEJMoa2103695 PMC9116274 5 D. Planchard E. F. Smit H. J. M. Groen Dabrafenib Plus Trametinib in Patients With Previously Untreated BRAF(V600E)‐Mutant Metastatic Non‐Small‐Cell Lung Cancer: An Open‐Label, Phase 2 Trial Lancet Oncology 18 2017 1307 1316 28919011 10.1016/S1470-2045(17)30679-4 6 J. Wolf T. Seto J. Y. Han Capmatinib in MET Exon 14‐Mutated or MET‐Amplified Non‐Small‐Cell Lung Cancer New England Journal of Medicine 383 2020 944 957 32877583 10.1056/NEJMoa2002787 7 P. K. Paik E. Felip R. Veillon Tepotinib in Non‐Small‐Cell Lung Cancer With MET Exon 14 Skipping Mutations New England Journal of Medicine 383 2020 931 943 32469185 10.1056/NEJMoa2004407 PMC8422679 8 Y. L. Wu R. Dziadziuszko J. S. Ahn Alectinib in Resected ALK‐Positive Non‐Small‐Cell Lung Cancer New England Journal of Medicine 390 2024 1265 1276 38598794 10.1056/NEJMoa2310532 9 S. Peters D. R. Camidge A. T. Shaw Alectinib Versus Crizotinib in Untreated ALK‐Positive Non‐Small‐Cell Lung Cancer New England Journal of Medicine 377 2017 829 838 28586279 10.1056/NEJMoa1704795 10 C. Zhou B. Solomon H. H. Loong First‐Line Selpercatinib or Chemotherapy and Pembrolizumab in RET Fusion‐Positive NSCLC New England Journal of Medicine 389 2023 1839 1850 37870973 10.1056/NEJMoa2309457 PMC10698285 11 S. Peters S. M. Gadgeel T. Mok Entrectinib in ROS1‐Positive Advanced Non‐Small Cell Lung Cancer: The Phase 2/3 BFAST Trial Nature Medicine 30 2024 1923 1932 10.1038/s41591-024-03008-4 PMC11271410 38898120 12 A. Drilon D. R. Camidge J. J. Lin Repotrectinib in ROS1 Fusion‐Positive Non‐Small‐Cell Lung Cancer New England Journal of Medicine 390 2024 118 131 38197815 10.1056/NEJMoa2302299 PMC11702311 13 D. S. Hong S. G. DuBois S. Kummar Larotrectinib in Patients With TRK Fusion‐Positive Solid Tumours: A Pooled Analysis of Three Phase 1/2 Clinical Trials Lancet Oncology 21 2020 531 540 32105622 10.1016/S1470-2045(19)30856-3 PMC7497841 14 R. C. Doebele A. Drilon L. Paz‐Ares Entrectinib in Patients With Advanced or Metastatic NTRK Fusion‐Positive Solid Tumours: Integrated Analysis of Three Phase 1–2 Trials Lancet Oncology 21 2020 271 282 31838007 10.1016/S1470-2045(19)30691-6 PMC7461630 15 S. M. Liu H. Y. Tu X. W. Wei First‐Line Pyrotinib in Advanced HER2‐Mutant Non‐Small‐Cell Lung Cancer: A Patient‐Centric Phase 2 Trial Nature Medicine 29 2023 2079 2086 10.1038/s41591-023-02461-x 37488286 16 B. T. Li E. F. Smit Y. Goto Trastuzumab Deruxtecan in HER2‐Mutant Non‐Small‐Cell Lung Cancer New England Journal of Medicine 386 2022 241 251 34534430 10.1056/NEJMoa2112431 PMC9066448 17 A. M. Schram I. Odintsov M. Espinosa‐Cotton Zenocutuzumab, a HER2xHER3 Bispecific Antibody, Is Effective Therapy for Tumors Driven by NRG1 Gene Rearrangements Cancer Discovery 12 2022 1233 1247 35135829 10.1158/2159-8290.CD-21-1119 PMC9394398 18 A. C. Tan D. S. W. Tan Targeted Therapies for Lung Cancer Patients With Oncogenic Driver Molecular Alterations Journal of Clinical Oncology 40 2022 611 625 34985916 10.1200/JCO.21.01626 19 J. Mazieres H. Vioix B. M. Pfeiffer MET Exon 14 Skipping in NSCLC: A Systematic Literature Review of Epidemiology, Clinical Characteristics, and Outcomes Clinical Lung Cancer 24 2023 483 497 37451931 10.1016/j.cllc.2023.06.008 20 G. Harada S. R. Yang E. Cocco A. Drilon Rare Molecular Subtypes of Lung Cancer Nature Reviews Clinical Oncology 20 2023 229 249 10.1038/s41571-023-00733-6 PMC10413877 36806787 21 J. LoPiccolo A. Gusev D. C. Christiani P. A. Janne Lung Cancer in Patients Who Have Never Smoked—An Emerging Disease Nature Reviews Clinical Oncology 21 2024 121 146 10.1038/s41571-023-00844-0 PMC11014425 38195910 22 S. Devarakonda Y. Li F. Martins Rodrigues Genomic Profiling of Lung Adenocarcinoma in Never‐Smokers Journal of Clinical Oncology 39 2021 3747 3758 34591593 10.1200/JCO.21.01691 PMC8601276 23 L. B. Alexandrov Y. S. Ju K. Haase Mutational Signatures Associated With Tobacco Smoking in Human Cancer Science 354 2016 618 622 27811275 10.1126/science.aag0299 PMC6141049 24 M. E. Arcila J. E. Chaft K. Nafa Prevalence, Clinicopathologic Associations, and Molecular Spectrum of ERBB2 (HER2) Tyrosine Kinase Mutations in Lung Adenocarcinomas Clinical Cancer Research 18 2012 4910 4918 22761469 10.1158/1078-0432.CCR-12-0912 PMC3865806 25 J. P. Solomon J. F. Hechtman Detection of NTRK Fusions: Merits and Limitations of Current Diagnostic Platforms Cancer Research 79 2019 3163 3168 31196931 10.1158/0008-5472.CAN-19-0372 PMC6606326 26 P. C. Mack R. B. Keller‐Evans G. Li Real‐World Clinical Performance of a DNA‐Based Comprehensive Genomic Profiling Assay for Detecting Targetable Fusions in Nonsquamous NSCLC Oncologist 29 2024 e984 e996 38401173 10.1093/oncolo/oyae028 PMC11299949 27 E. E. Heyer I. W. Deveson D. Wooi Diagnosis of Fusion Genes Using Targeted RNA Sequencing Nature Communications 10 2019 1388 10.1038/s41467-019-09374-9 PMC6437215 30918253 28 J. Ahmed C. Torrado A. Chelariu S. H. Kim J. R. Ahnert Fusion Challenges in Solid Tumors: Shaping the Landscape of Cancer Care in Precision Medicine JCO Precision Oncology 8 2024 e2400038 38986029 10.1200/PO.24.00038 PMC11371109 29 S. Kohsaka K. Tatsuno T. Ueno Comprehensive Assay for the Molecular Profiling of Cancer by Target Enrichment From Formalin‐Fixed Paraffin‐Embedded Specimens Cancer Science 110 2019 1464 1479 30737998 10.1111/cas.13968 PMC6447855 30 S. Shukla J. R. Evans R. Malik Development of a RNA‐Seq Based Prognostic Signature in Lung Adenocarcinoma Journal of the National Cancer Institute 109 2017 djw200 27707839 10.1093/jnci/djw200 PMC5051943 31 A. G. Nicholson M. S. Tsao M. B. Beasley The 2021 WHO Classification of Lung Tumors: Impact of Advances Since 2015 Journal of Thoracic Oncology 17 2022 362 387 34808341 10.1016/j.jtho.2021.11.003 32 S. Kohsaka T. Hayashi M. Nagano Identification of Novel CD74‐NRG2alpha Fusion From Comprehensive Profiling of Lung Adenocarcinoma in Japanese Never or Light Smokers Journal of Thoracic Oncology 15 2020 948 961 32036070 10.1016/j.jtho.2020.01.021 33 T. Kohno M. Kato S. Kohsaka C‐CAT: The National Datacenter for Cancer Genomic Medicine in Japan Cancer Discovery 12 2022 2509 2515 36321305 10.1158/2159-8290.CD-22-0417 PMC9762342 34 Consortium APG AACR Project GENIE: Powering Precision Medicine Through an International Consortium Cancer Discovery 7 2017 818 831 28572459 10.1158/2159-8290.CD-17-0151 PMC5611790 35 Z. F. Han S. T. Lin M. Zhong D. J. Yu Correlations of UGT1A1 Gene Polymorphisms With Onset and Prognosis of Non‐Small Cell Lung Cancer European Review for Medical and Pharmacological Sciences 24 2020 9973 9980 33090402 10.26355/eurrev_202010_23210 36 X. Chen X. Zhu X. Shen Y. Liu W. Fu B. Wang IGF2BP3 Aggravates Lung Adenocarcinoma Progression by Modulation of PI3K/AKT Signaling Pathway Immunopharmacology and Immunotoxicology 45 2023 370 377 36972188 10.1080/08923973.2022.2150636 37 W. Guo Q. Huai H. Wan Prognostic Impact of IGF2BP3 Expression in Patients With Surgically Resected Lung Adenocarcinoma DNA and Cell Biology 40 2021 316 331 33493403 10.1089/dna.2020.6136 38 W. Li N. Li L. Gao C. You Integrated Analysis of the Roles and Prognostic Value of RNA Binding Proteins in Lung Adenocarcinoma PeerJ 8 2020 e8509 32071816 10.7717/peerj.8509 PMC7007976 39 A. Giatromanolaki A. L. Harris A. H. Banham C. A. Contrafouris M. I. Koukourakis Carbonic Anhydrase 9 (CA9) Expression in Non‐Small‐Cell Lung Cancer: Correlation With Regulatory FOXP3+T‐Cell Tumour Stroma Infiltration British Journal of Cancer 122 2020 1205 1210 32066909 10.1038/s41416-020-0756-3 PMC7156529 40 J. J. Zhang J. Hong Y. S. Ma Identified GNGT1 and NMU as Combined Diagnosis Biomarker of Non‐Small‐Cell Lung Cancer Utilizing Bioinformatics and Logistic Regression Disease Markers 2021 2021: 6696198 10.1155/2021/6696198 PMC7806402 33505535 41 K. D. Davies A. Lomboy C. A. Lawrence DNA‐Based Versus RNA‐Based Detection of MET Exon 14 Skipping Events in Lung Cancer Journal of Thoracic Oncology 14 2019 737 741 30639620 10.1016/j.jtho.2018.12.020 42 C. Descarpentries F. Lepretre F. Escande Optimization of Routine Testing for MET Exon 14 Splice Site Mutations in NSCLC Patients Journal of Thoracic Oncology 13 2018 1873 1883 30195702 10.1016/j.jtho.2018.08.2023 43 A. Houlier D. Pissaloux F. Tirode RASGRF2 Gene Fusions Identified in a Variety of Melanocytic Lesions With Distinct Morphological Features Pigment Cell & Melanoma Research 34 2021 1074 1083 34310073 10.1111/pcmr.13004 44 L. Hunihan D. Zhao H. Lazowski RASGRF1 Fusions Activate Oncogenic RAS Signaling and Confer Sensitivity to MEK Inhibition Clinical Cancer Research 28 2022 3091 3103 35247929 10.1158/1078-0432.CCR-21-4291 PMC9288503 45 A. J. Cooper Y. Kobayashi D. Kim Identification of a RAS‐Activating TMEM87A‐RASGRF1 Fusion in an Exceptional Responder to Sunitinib With Non‐Small Cell Lung Cancer Clinical Cancer Research 26 2020 4072 4079 32312893 10.1158/1078-0432.CCR-20-0397 PMC7415568 46 J. M. Watts A. Perez L. Pereira A Case of AML Characterized by a Novel t (4;15)(q31;q22) Translocation That Confers a Growth‐Stimulatory Response to Retinoid‐Based Therapy International Journal of Molecular Sciences 18 2017 10.3390/ijms18071492 PMC5535982 28696354 47 D. Cai P. S. Choi M. Gelbard M. Meyerson Identification and Characterization of Oncogenic SOS1 Mutations in Lung Adenocarcinoma Molecular Cancer Research 17 2019 1002 1012 30635434 10.1158/1541-7786.MCR-18-0316 PMC6445719 48 V. Thatikonda H. Lyu S. Jurado Co‐Targeting SOS1 Enhances the Antitumor Effects of KRAS(G12C) Inhibitors by Addressing Intrinsic and Acquired Resistance Nature Cancer 5 2024 1352 1370 39103541 10.1038/s43018-024-00800-6 PMC11424490 49 F. C. Baltanas R. Garcia‐Navas P. Rodriguez‐Ramos Critical Requirement of SOS1 for Tumor Development and Microenvironment Modulation in KRAS(G12D)‐Driven Lung Adenocarcinoma Nature Communications 14 2023 5856 10.1038/s41467-023-41583-1 PMC10511506 37730692 50 D. Albano A. Dhamija Y. Liao Lung Cancer in Nonsmokers—A Risk Factor Analysis Cancer Epidemiology 86 2023 102439 37598649 10.1016/j.canep.2023.102439 51 G. A. Silvestri R. P. Young N. T. Tanner P. Mazzone Screening Low‐Risk Individuals for Lung Cancer: The Need May be Present, but the Evidence of Benefit Is Not Journal of Thoracic Oncology 19 2024 1155 1163 39112003 10.1016/j.jtho.2024.05.001 ",
  "metadata": {
    "Title of this paper": "Screening Low‐Risk Individuals for Lung Cancer: The Need May be Present, but the Evidence of Benefit Is Not",
    "Journal it was published in:": "Cancer Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485665/"
  }
}