{
  "title": "Paper_1148",
  "abstract": "pmc Tomography Tomography 3480 tomog tomography Tomography 2379-1381 2379-139X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473628 PMC12473628.1 12473628 12473628 41003479 10.3390/tomography11090096 tomography-11-00096 1 Review Leveraging Multimodal Foundation Models in Biliary Tract Cancer Research https://orcid.org/0000-0002-5848-7072 Singh Yashbir 1 * https://orcid.org/0000-0003-1760-5244 Andersen Jesper B. 2 https://orcid.org/0000-0001-8226-2319 Hathaway Quincy A. 3 https://orcid.org/0000-0002-0520-3582 Vera-Garcia Diana V. 4 Keishing Varekan 1 https://orcid.org/0000-0002-7514-1030 Venkatesh Sudhakar K. 1 https://orcid.org/0009-0003-3223-9059 Salehi Sara 1 Povero Davide 5 https://orcid.org/0000-0002-6446-5785 Wallace Michael B. 4 https://orcid.org/0000-0003-3151-009X Gores Gregory J. 5 https://orcid.org/0000-0002-9342-0498 Wei Yujia 1 Horvat Natally 1 https://orcid.org/0000-0001-7926-6095 Erickson Bradley J. 1 https://orcid.org/0000-0003-2020-9365 Quaia Emilio 6 Curvo-Semedo Luís Academic Editor Schreyer Andreas G. Academic Editor 1 keishing.varekan@mayo.edu venkatesh.sudhakar@mayo.edu salehi.sara@mayo.edu yujia.wei@mayo.edu horvat.natally@mayo.edu bje@mayo.edu 2 jesper.andersen@bric.ku.dk 3 quincy.hathaway@pennmedicine.upenn.edu 4 veragarcia.diana@mayo.edu 5 povero.davide@mayo.edu gores.gregory@mayo.edu 6 emilio.quaia@unipd.it * singh.yashbir@mayo.edu 25 8 2025 9 2025 11 9 497671 96 26 6 2025 30 7 2025 21 8 2025 25 08 2025 27 09 2025 28 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ This review explores how multimodal foundation models (MFMs) are transforming biliary tract cancer (BTC) research. BTCs are aggressive malignancies with poor prognosis, presenting unique challenges due to difficult diagnostic methods, molecular complexity, and rarity. Importantly, intrahepatic cholangiocarcinoma (iCCA), perihilar cholangiocarcinoma (pCCA), and distal bile duct cholangiocarcinoma (dCCA) represent fundamentally distinct clinical entities, with iCCA presenting as mass-forming lesions amenable to biopsy and targeted therapies, while pCCA manifests as infiltrative bile duct lesions with challenging diagnosis and primarily palliative management approaches. MFMs offer potential to advance research by integrating radiological images, histopathology, multi-omics profiles, and clinical data into unified computational frameworks, with applications tailored to these distinct BTC subtypes. Key applications include enhanced biomarker discovery that identifies previously unrecognizable cross-modal patterns, potential for improving currently limited diagnostic accuracy—though validation in BTC-specific cohorts remains essential—accelerated drug repurposing, and advanced patient stratification for personalized treatment. Despite promising results, challenges such as data scarcity, high computational demands, and clinical workflow integration remain to be addressed. Future research should focus on standardized data protocols, architectural innovations, and prospective validation studies. The integration of artificial intelligence (AI)-based methodologies offers new solutions for these historically challenging malignancies. However, current evidence for BTC-specific applications remains largely theoretical, with most studies limited to proof-of-concept designs or related cancer types. Comprehensive clinical validation studies and prospective trials demonstrating patient benefit are essential prerequisites for clinical implementation. The timeline for evidence-based clinical adoption likely extends 7–10 years, contingent on successful completion of validation studies addressing current evidence gaps. biliary tract cancer cholangiocarcinoma artificial intelligence multimodal foundation models precision oncology biomarkers drug repurposing This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Evidence Classification Framework To provide clarity regarding the maturity of different MFM applications in BTC, we employ the following evidence hierarchy throughout this review: Level 1: Validated in prospective, multi-center BTC clinical trials; Level 2: Demonstrated in retrospective, Multi-Institutional BTC-specific cohorts with external validation; Level 3: Proof-of-concept in single-institution BTC cohorts or biologically relevant cancers; Level 4: Theoretical or in silico hypothesis requiring validation. Each claim is marked with its corresponding evidence level (e.g., [Level 3]) to distinguish between validated findings and theoretical potential. 2. Important Clinical Considerations Evidence Limitation Notice: While this review explores the potential applications of multimodal foundation models in BTC research, readers should note that: No MFM approach has achieved prospective clinical validation in BTC-specific populations. Most evidence derives from related cancer types or computational studies. Cost-effectiveness and real-world implementation feasibility remain unproven. Current applications should be considered investigational and require institutional review board approval. Healthcare providers should not alter clinical practice based on the theoretical potential described in this review without appropriate validation studies and regulatory approval. 3. Introduction Biliary tract cancers (BTCs) represent a compelling example of malignancies where therapeutic progress has lagged dramatically behind other cancer types. While 5-year survival rates for breast cancer have improved from 75% to 91% over the past three decades, and melanoma mortality has decreased by 7% annually following immunotherapy introduction, BTC survival remains stagnant below 20% across all subtypes [ 1 2 3 IDH1/2 FGFR2 KRAS PRKACA/PRKACB ERBB 4 Despite originating from the bile duct epithelium, iCCA and pCCA represent fundamentally different clinical entities that pose distinct challenges for diagnosis, treatment, and research [ 1 3 Table 1 5 6 7 8 9 3 10 Multimodal foundation models (MFMs) represent an emerging paradigm in artificial intelligence (AI), designed to integrate and process heterogeneous data types simultaneously [ 5 Current diagnostic workflows for symptomatic patients involve integration of complex datasets including structured (laboratory values, genomic risk data) and unstructured (free text electronic health records) clinical information alongside multimodal imaging (MRI, MRCP, cholangiography, cholangioscopy). While these modalities are performed after clinical presentation, MFMs may enhance diagnostic accuracy and reduce time to definitive diagnosis in symptomatic patients. True early detection—identification of malignancy before symptom onset—remains a largely unmet need in BTC, as current screening approaches lack sufficient sensitivity and specificity for the predominant asymptomatic population. The integration of risk stratification models incorporating genetic predisposition, environmental factors, and subclinical biomarkers represents a potential future application, though evidence for such approaches remains theoretical. Unlike traditional machine learning models that operate individually on single data modalities, MFMs can analyze text, images, genomic sequences, and clinical measurements within a unified computational framework. These models encompass various architectures including Transformers, GANs (Generative Adversarial Networks), encoder–decoder frameworks, and diffusion models, each offering unique strengths for multimodal integration. By leveraging self-supervised learning techniques on vast, diverse datasets, MFMs develop generalizable representations that transfer effectively across domains and tasks ( Figure 1 6 13 In clinical settings, MFMs have demonstrated promising results in various diseases. For instance, in hepatocellular carcinoma (HCC), multimodal models integrating radiological images with genomic and clinical data have improved early detection and prognostic accuracy [ 6 13 This narrative review explores the intersection of MFMs and BTC research, highlighting both the clinical needs driving innovation and the technical considerations for AI implementation. For clinicians managing BTC patients, we provide a framework for understanding how these advanced AI systems can augment diagnostic workflows, treatment selection, and prognostic evaluation. For AI researchers and bioinformaticians, we offer insights into the unique challenges of BTC data and outline architectural considerations for developing clinically relevant models. By bridging these perspectives, we aim to accelerate the translation of cutting-edge AI methodologies into practical clinical tools for this challenging malignancy. 3.1. Distinct Clinical Entities: iCCA Versus pCCA Biliary tract cancers represent a heterogeneous group of malignancies that exhibit markedly different characteristics based on anatomical location. While sharing a common tissue of origin in the bile duct epithelium, iCCA and pCCA present as fundamentally distinct clinical entities with significant implications for diagnosis, molecular characterization, and treatment approaches [ 1 iCCA typically manifests as a mass-forming lesion within the liver parenchyma, making it relatively accessible for diagnostic tissue acquisition through core needle biopsy. This availability of adequate tissue samples facilitates comprehensive molecular profiling, revealing characteristic genetic alterations including IDH1/2 FGFR2 4 5 7 8 14 KRAS PRKACA/PRKACB 4 10 15 pCCA management, however, centers on addressing biliary obstruction and associated complications. Palliative biliary stenting often represents a critical intervention to relieve jaundice, prevent cholangitis, and improve quality of life [ 3 10 11 12 3.2. Current State of Evidence in BTC-Specific MFM Applications While this review explores the potential of MFMs in BTC research, it is crucial to acknowledge the current limitations in evidence. A systematic review of published literature reveals that only three studies have directly applied multimodal AI approaches specifically to BTC cohorts [Level 2–3], with most evidence extrapolated from related gastrointestinal malignancies or pan-cancer datasets with limited BTC representation. This evidence gap stems from the rarity of BTC (incidence 1–2 per 100,000) and the challenges in assembling sufficiently large, well-characterized cohorts for robust AI model development and validation. 3.3. Molecular Profiling and Biomarker Discovery The molecular heterogeneity of BTCs presents significant challenges for implementing precision medicine approaches in clinical practice [ 16 17 18 While ctDNA serves as a biomarker primarily valuable for monitoring treatment efficacy, it often requires prior knowledge of key mutations or DNA methylation patterns to effectively track them in serum. Beyond ctDNA, the biomarker landscape includes extracellular vesicles (EVs), non-coding RNAs (ncRNAs)/microRNAs (miRs), metabolites, and proteins, all of which have been investigated in large cohort studies but remain primarily in the research domain [ 18 19 Indeed, these computational frameworks could be particularly valuable for establishing correlations between liquid biopsy profiles and primary tumor characteristics in BTC. By simultaneously analyzing tumor tissue data and circulating biomarkers (such as ctDNA, EVs, or circulating proteins), MFMs could potentially differentiate tumor-derived signals from systemic responses to the malignancy. This capability would address a fundamental challenge in liquid biopsy interpretation: determining which biomarker signatures directly reflect tumor biology versus those representing secondary systemic adaptations or host responses to the tumor. This discriminative power could significantly enhance the clinical utility of liquid biopsies by providing more precise insights into tumor evolution, treatment response, and resistance mechanisms. By accounting for the complex interplay between the tumor and its host environment, MFMs could lead to more accurate and personalized treatment strategies for patients with biliary tract cancers (BTCs). Histopathological images require hierarchical vision transformers capable of processing gigapixel whole-slide images at multiple magnification levels [ 19 20 Recent architectural approaches for BTC applications have leveraged hierarchical attention networks with domain-specific inductive biases, such as vision transformers adapted for histopathology analysis and transformer-based encoders for genomic sequence data, with cross-modal attention mechanisms facilitating information exchange between modalities. These implementations face substantial computational demands, often requiring specialized GPU infrastructure for training, though recent advances in model efficiency and edge deployment have reduced resource requirements for clinical inference. Optimization approaches include mixed-precision training, gradient checkpointing to reduce memory requirements, and curriculum learning strategies that progressively introduce more complex cross-modal correlations. For deployment in clinical settings, model distillation has proven effective, compressing knowledge from larger multimodal architectures into more efficient inference models with approximately 70–80% parameter reduction while maintaining clinical performance. For BTC-specific applications, specialized attention to the low-resource nature of this cancer type is critical. Transfer learning from larger cancer datasets (such as TCGA pan-cancer) with subsequent fine-tuning on BTC-specific cohorts can mitigate data scarcity issues. Recent implementations have demonstrated promising results, with multimodal models identifying integrated biomarkers that outperform single modality approaches in predicting treatment response and survival [ 21 16 Recent multimodal approaches have demonstrated varying degrees of success in BTC biomarker discovery, though with important limitations that highlight the gap between theoretical potential and clinical reality ( Table 2 16 In contrast, Chen et al. [ 21 Yoo et al. [ 18 These studies collectively illustrate both the promise and current limitations of multimodal approaches in BTC. While performance improvements over single-modality analyses are consistently demonstrated, the magnitude of benefit varies considerably, and most approaches remain confined to specialized academic centers with advanced computational infrastructure. The translation of these research findings into routine clinical practice represents a significant ongoing challenge. The application of MFMs for biomarker discovery differs substantially between iCCA and pCCA. For iCCA, with its more accessible tissue sampling, MFMs can integrate comprehensive molecular profiles with imaging and clinical data to identify novel therapeutic targets beyond established IDH and FGFR alterations [ 16 21 18 19 Current multimodal biomarker discovery approaches show varying maturity levels. While Lin et al. [ 16 18 3.4. Improved Diagnostic Accuracy Diagnostic challenges in BTCs span the spectrum from initial detection to definitive classification [ 24 9 25 One compelling approach to address these diagnostic challenges would be to integrate multiple data streams directly into a comprehensive diagnostic model. By simultaneously analyzing imaging studies, histopathology, laboratory results, and clinical parameters within a unified AI framework, such models could potentially reduce the significant interobserver variability that currently affects diagnosis. This integration would offer standardized interpretation across healthcare settings, allowing community centers without specialized hepatobiliary expertise to achieve diagnostic accuracy comparable to tertiary referral centers. The resulting consistency and objectivity in diagnostic assessment could significantly reduce both the time to diagnosis and the variability in classification, ultimately enabling earlier intervention and more precise treatment planning for BTC patients. MFMs hold transformative potential for BTC diagnostics through simultaneous analysis of radiological imaging, histopathology, clinical parameters, and molecular markers [ 11 Figure 2 Table 3 26 Implementation challenges include handling variable data availability across patients, as not all diagnostic modalities may be performed for each case. Modality dropout during training enables the model to make predictions with incomplete data, mirroring real-world clinical scenarios. Curriculum learning strategies can progressively introduce more complex cases, such as PSC-associated cholangiocarcinoma or mixed hepatocellular-cholangiocarcinoma, after the model establishes proficiency on more distinct presentations. Pretraining strategies for diagnostic MFMs typically involve self-supervised learning on large, unlabeled medical imaging datasets, followed by supervised fine-tuning on BTC-specific data [ 27 12 Cross-modal patterns are distinctive of various BTC presentations. The evidence base for multimodal diagnostic approaches varies significantly in methodological rigor and clinical applicability. Esteva et al. [ 11 Chen et al. [ 12 The technical architecture also differs substantially. Dosovitskiy et al. [ 26 27 While comprehensive validation studies remain limited, preliminary reports suggest potential performance improvements of MFMs over traditional diagnostic approaches. Proof-of-concept studies in pancreatic adenocarcinoma have demonstrated [Level 3] that multimodal approaches combining imaging and molecular data can achieve sensitivities exceeding 85% for malignant stricture detection [ 12 11 12 9 25 Diagnostic accuracy studies reveal a hierarchy of evidence quality and clinical applicability. Large-scale studies in related cancers (Chen et al. [ 12 26 3.5. MFM Diagnostic Strategies for iCCA For iCCA, where tissue diagnosis is generally accessible, MFMs primarily enhance subtype classification, distinguish from metastatic adenocarcinoma or hepatocellular variants, and predict molecular alterations from imaging features [Level 3]. The integration challenge involves correlating radiological features of mass-forming lesions with comprehensive molecular profiles. 3.6. MFM Diagnostic Strategies for pCCA For pCCA, MFMs address the fundamental challenge of initial detection and differentiation from benign strictures. The integration of cholangioscopic images, brush cytology findings, and circulating biomarkers can potentially overcome the notoriously low sensitivity (<60%) of conventional sampling techniques [Level 3]. Critical Need: Current evidence derives primarily from pancreatic cancer studies; BTC-specific validation remains essential [Level 4]. 3.7. Drug Discovery and Repurposing Therapeutic options for BTCs remain limited, with modest advances in first-line systemic therapy [ 30 15 7 IDH1 8 Figure 3 31 MFMs show theoretical promise for drug repurposing in BTC by leveraging computational analysis of data from previous clinical trials across multiple cancer types. However, the translation of computational predictions to clinical efficacy requires extensive validation through preclinical studies and clinical trials. By integrating and analyzing molecular, phenotypic, and clinical response data from historical trials, these models can identify non-obvious patterns that suggest therapeutic opportunities. For instance, an MFM might recognize that a subset of BTCs shares critical pathway dependencies with responders to specific therapies in gastric or pancreatic cancer trials, despite differences in histological origin. This cross-cancer analysis could reveal unexpected drug candidates that target conserved vulnerabilities, potentially identifying existing approved medications that could be rapidly repositioned for BTC patients with similar molecular signatures, bypassing years of early drug development. Implementation strategies for BTC-focused drug discovery models must address several challenges [Level 4]. Transfer learning from larger chemical databases (such as ChEMBL or PubChem) with subsequent fine-tuning on BTC-specific data helps overcome the limited availability of BTC-specific compounds [ 32 28 Data integration presents challenges, requiring harmonization across diverse sources: high-throughput screening assays, patient-derived organoid responses, electronic health record outcomes, and molecular characterization datasets [Level 4]. Federated learning approaches allow training across institutional boundaries without compromising data privacy, particularly important for sensitive patient data [ 22 33 7 8 33 10 34 35 3.8. Patient Stratification and Personalized Medicine The heterogeneity of BTCs presents substantial challenges for treatment selection and prognostication [ 10 34 10 36 MFMs enable sophisticated approaches to patient stratification by integrating diverse data streams to identify clinically relevant BTC subgroups with distinct prognoses and treatment responses [ 34 36 23 14 Recent applications have demonstrated significant improvements over conventional approaches [Level 3]. Multimodal models integrating volumetric tumor measurements, radiomic features, and molecular profiles have identified novel BTC subtypes with distinct therapeutic vulnerabilities, such as DNA damage response-deficient tumors responsive to PARP inhibition despite lacking canonical BRCA mutations [ 37 38 3.9. Explainable AI and Clinical Trust in MFM Applications Clinical adoption of MFMs in BTC management requires transparent decision-making processes that clinicians can understand and trust. The complexity of multimodal integration necessitates sophisticated explainability approaches beyond traditional single-modality AI systems. 3.10. Multimodal Attention Visualization MFMs can provide multimodal attention maps that visualize which data regions (imaging features, pathological patterns, genomic alterations, clinical parameters) contribute most to diagnostic or prognostic predictions [Level 3]. For BTC applications, this might highlight specific radiological textures correlating with molecular subtypes or pathological patterns predicting treatment response. 3.11. Counterfactual Explanations Counterfactual analysis demonstrates how predictions would change with different inputs, answering “what-if” scenarios crucial for clinical decision-making [Level 3]. For example: “If this patient’s CA 19-9 level were normal, would the diagnostic probability change?” or “What molecular alterations would shift this patient to a different treatment-responsive subgroup?” 3.12. Uncertainty Quantification Bayesian uncertainty quantification provides confidence metrics for model outputs, particularly valuable for rare molecular subtypes with limited training examples [Level 3]. This addresses the critical clinical need to distinguish between high-confidence predictions requiring immediate action and uncertain predictions requiring additional validation. Implementation Challenges: Current explainable AI (XAI) methods are primarily designed for single-modality applications. Developing interpretability frameworks for multimodal BTC applications represents an active area of research [Level 4]. 3.13. Current Challenges and Limitations The implementation of multimodal AI approaches in BTC clinical practice faces substantial challenges from both clinical and technical perspectives [ 39 Figure 4 The clinical implementation of MFMs faces substantial practical barriers beyond technical considerations [Level 3]. Current regulatory frameworks lack clear pathways for approving multimodal AI systems that integrate across diagnostic and therapeutic domains [Level 3]. Reimbursement models do not adequately account for the computational resources and specialist interpretation time required for multimodal analysis [Level 3]. Additionally, the majority of BTC patients are managed in community settings with limited access to the computational infrastructure and specialized expertise needed for MFM deployment, potentially exacerbating existing disparities in cancer care [Level 3]. Data quality and standardization issues are pervasive in BTC management [Level 3]. Inconsistent scanning protocols across imaging centers complicate radiological analysis [Level 3]. Variability in tissue processing and staining techniques impacts histopathological assessment [Level 3]. Non-standardized reporting of molecular profiling results, performed by diverse commercial and academic laboratories, creates challenges for data integration [ 40 41 Edge deployment in clinical settings with limited GPU infrastructure remains challenging, necessitating model compression techniques such as knowledge distillation, quantization, and pruning, which may compromise performance [ 42 Regulatory and reimbursement landscapes present additional barriers [Level 3]. Current reimbursement models inadequately compensate for the time and resources required for comprehensive multimodal data collection and analysis [Level 3]. Regulatory pathways for approval of AI-based clinical decision support tools remain evolving, particularly for multimodal approaches that integrate across diagnostic and therapeutic domains [ 43 44 45 3.14. Critical Evidence Gaps and Clinical Reality The clinical implementation of MFMs in BTC faces a fundamental challenge: the disconnect between theoretical potential and validated clinical utility. Current evidence suggests that while proof-of-concept studies demonstrate feasibility [Level 3], no MFM approach has achieved prospective clinical validation in BTC-specific cohorts [Level 1]. This limitation is particularly concerning given that: 1. Most performance metrics derive from retrospective analyses or related cancer types 2. No randomized controlled trials have compared MFM-guided versus conventional BTC management 3. Cost-effectiveness analyses for MFM implementation in BTC are entirely absent 4. Real-world performance in community practice settings remains unknown. These gaps necessitate cautious interpretation of the potential benefits outlined in this review, as translation from computational promise to clinical impact requires extensive validation that has not yet been completed. 3.15. Technical Architecture Challenges Beyond data scarcity, MFM implementation faces substantial technical barriers specific to multimodal medical data: Batch Effects and Institutional Variability: Different imaging scanners, staining protocols, and molecular profiling platforms create systematic biases that can confound model training [Level 3]. For example, H&E staining variations across pathology laboratories can significantly impact histological feature extraction. Domain-Adversarial Training: Emerging architectures incorporate adversarial components that learn institution-invariant representations while maintaining biological signal [Level 3]. These approaches show promise for creating generalizable models despite technical variability. Federated Learning for Rare Cancers: Distributed training across institutions without centralizing sensitive data addresses both privacy concerns and the critical need to aggregate rare BTC cases for meaningful sample sizes [Level 3]. Recent implementations demonstrate maintenance of 95% centralized performance while enabling Multi-Institutional collaboration. Modality-Specific Preprocessing: Each data type requires specialized preprocessing (imaging normalization, genomic variant calling, clinical data standardization) that must be harmonized across contributing institutions [Level 3]. 3.16. Future Directions The evolution of MFMs in BTC management will require coordinated efforts across clinical, technical, and regulatory domains. Establishing standardized workflows for comprehensive multimodal data collection represents a critical initial step [ 45 Realistic implementation timelines suggest that comprehensive clinical validation studies will require 3–5 years, with widespread clinical adoption likely occurring over a 7–10 year horizon. This timeline accounts for the need for large-scale prospective studies, regulatory review processes, healthcare system integration, and clinician training programs [Level 4]. From a technical perspective, several promising directions will shape the next generation of MFMs for BTC applications. Architectural innovations include the development of modality-agnostic transformers capable of processing arbitrary combinations of data types through unified encoding strategies. Self-supervised pretraining approaches specifically designed for multimodal medical data will enable more efficient knowledge transfer from large, unlabeled datasets to BTC-specific applications with limited labeled examples [ 46 47 48 29 49 3.17. Recommended Clinical Trial Framework To address the evidence gaps identified in this review, we propose a structured clinical trial framework: Immediate Priorities (0–2 years): (1) multi-center retrospective validation study (target: n = 500 BTC patients) comparing MFM diagnostic accuracy to expert consensus (2) Feasibility study of MFM implementation in 3–5 community cancer centers (3) Cost-effectiveness modeling study based on existing data Medium-term Studies (2–5 years): (1) Prospective diagnostic accuracy trial (SPIRIT-AI compliant) comparing MFM-augmented versus conventional diagnostic workflows (2) Pilot randomized trial of MFM-guided treatment selection versus standard molecular profiling in iCCA patients (3) Implementation science study evaluating barriers to MFM adoption in diverse healthcare settings. These studies should prioritize patient-relevant outcomes including survival, quality of life, and time to appropriate treatment, rather than solely focusing on technical performance metrics. 4. Conclusions The integration of multimodal foundation models into BTC research and clinical practice represents a paradigm shift in our approach to these challenging malignancies. By leveraging the complementary information contained in clinical, radiological, pathological, and molecular data, these models offer unprecedented opportunities to advance diagnosis, treatment selection, and therapeutic development. The clinical impact of these approaches will depend on thoughtful implementation that addresses workflow integration, validation requirements, and educational needs of the healthcare workforce. The technical evolution of these models will continue to improve their performance, interpretability, and computational efficiency, enabling broader adoption across healthcare settings. Ultimately, the successful translation of multimodal AI approaches in BTC management will require collaborative efforts across disciplines. Clinicians must articulate unmet needs and validation requirements, while AI researchers develop architectures and methodologies tailored to the unique challenges of these rare malignancies. Regulatory bodies, professional societies, and patient advocacy organizations all play critical roles in establishing frameworks for responsible implementation. The promise of these technologies lies not in replacing clinical expertise but in augmenting it—providing clinicians with integrated insights drawn from complex, multimodal data that would otherwise remain fragmented across specialties. For patients with biliary tract cancers, the potential impact is profound: earlier diagnosis, more precise treatment selection, accelerated therapeutic development, and ultimately, improved survival outcomes for these historically challenging malignancies. Acknowledgments This study was developed under the Precision-BTC Scientific Mentorship Program 2024-25 as part of the COST Action Precision-BTC Network (CA22125). We thank the Mayo Clinic Comprehensive Cancer Center for their support as well. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, Y.S. and J.B.A.; methodology, Y.S., J.B.A. and Q.A.H.; formal analysis, Y.S., J.B.A., Q.A.H., D.V.V.-G., V.K., S.K.V., D.P., M.B.W., G.J.G., Y.W., N.H., B.J.E., E.Q. and S.S.; investigation, G.J.G. and B.J.E.; data curation, Y.S.; writing—original draft preparation, Y.S. and Q.A.H.; writing—review and editing, D.V.V.-G., V.K., S.K.V., D.P., M.B.W., G.J.G., Y.W., N.H., B.J.E. and E.Q. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. References 1. Banales J.M. Marin J.J.G. Lamarca A. Rodrigues P.M. Khan S.A. Roberts L.R. Cardinale V. Carpino G. Andersen J.B. Braconi C. Cholangiocarcinoma 2020: The next horizon in mechanisms and management Nat. Rev. Gastroenterol. Hepatol. 2020 17 557 588 10.1038/s41575-020-0310-z 32606456 PMC7447603 2. Valle J.W. Kelley R.K. Nervi B. Oh D.Y. Zhu A.X. Biliary tract cancer Lancet 2021 397 428 444 10.1016/S0140-6736(21)00153-7 33516341 3. Pellino A. Loupakis F. Cadamuro M. Dadduzio V. Fassan M. Guido M. Cillo U. Indraccolo S. Fabris L. Precision medicine in cholangiocarcinoma Transl. Gastroenterol. Hepatol. 2018 3 40 10.21037/tgh.2018.07.02 30148225 PMC6087799 4. Nakamura H. Arai Y. Totoki Y. Shirota T. Elzawahry A. Kato M. Hama N. Hosoda F. Urushidate T. Ohashi S. Genomic spectra of biliary tract cancer Nat. Genet. 2015 47 1003 1010 10.1038/ng.3375 26258846 5. Li C. Gan Z. Yang Z. Yang J. Li L. Wang L. Gao J. Multimodal Foundation Models: From Specialists to General-Purpose Assistants arXiv 2023 10.48550/arXiv.2309.10020 2309.10020 6. Chen J. Kaya N.A. Zhang Y. Kendarsari R.I. Sekar K. Chong S.L. Seshachalam V.P. Ling W.H. Phua C.Z.J. Lai H. A multimodal atlas of hepatocellular carcinoma reveals convergent evolutionary paths and ‘bad apple’ effect on clinical trajectory J. Hepatol. 2024 81 667 678 10.1016/j.jhep.2024.05.017 38782118 7. Patel T.H. Marcus L. Horiba M.N. Donoghue M. Chatterjee S. Mishra-Kalyani P.S. Fashoyin-Aje L.A. FDA approval summary: Pemigatinib for previously treated, unresectable locally advanced or metastatic cholangiocarcinoma with FGFR2 fusion or other rearrangement Clin. Cancer Res. 2023 29 838 842 10.1158/1078-0432.CCR-22-2036 36206041 PMC9991984 8. Zhu A.X. Macarulla T. Javle M.M. Kelley R.K. Lubner S.J. Adeva J. Abou-Alfa G.K. Final overall survival efficacy results of ivosidenib for patients with advanced cholangiocarcinoma with IDH1 mutation: The phase 3 randomized clinical ClarIDHy trial JAMA Oncol. 2021 7 1669 1677 10.1001/jamaoncol.2021.3836 34554208 PMC8461552 9. Navaneethan U. Njei B. Lourdusamy V. Konjeti R. Vargo J.J. Parsi M.A. Comparative effectiveness of biliary brush cytology and intraductal biopsy for detection of malignant biliary strictures: A systematic review and meta-analysis Gastrointest. Endosc. 2015 81 168 176 10.1016/j.gie.2014.09.017 25440678 PMC4824293 10. Bridgewater J. Sah J. Szende A. Paskow M. Messina P. Baur B. Banales J.M. Real-world treatment patterns and challenges of patients with biliary tract cancer: Retrospective chart review survey in Europe (GARNET-2) ESMO Real World Data Digit. Oncol. 2024 5 100060 10.1016/j.esmorw.2024.100060 11. Esteva A. Kuprel B. Novoa R.A. Ko J. Swetter S.M. Blau H.M. Thrun S. Correction: Corrigendum: Dermatologist-level classification of skin cancer with deep neural networks Nature 2017 546 686 10.1038/nature22985 28658222 12. Chen P.T. Wu T. Wang P. Chang D. Liu K.L. Wu M.S. Roth H.R. Lee P.C. Liao W.C. Wang W. Pancreatic cancer detection on CT scans with deep learning: A nationwide population-based study Radiology 2023 306 172 182 10.1148/radiol.220152 36098642 13. Venugopalan J. Tong L. Hassanzadeh H.R. Wang M.D. Multimodal deep learning models for early detection of Alzheimer’s disease stage Sci. Rep. 2021 11 3254 10.1038/s41598-020-74399-w 33547343 PMC7864942 14. Navaneethan U. Njei B. Venkatesh P.G. Vargo J.J. Parsi M.A. Fluorescence in situ hybridization for diagnosis of cholangiocarcinoma in primary sclerosing cholangitis: A systematic review and meta-analysis Gastrointest. Endosc. 2014 79 943 950 10.1016/j.gie.2013.11.001 24360654 15. Kelley R.K. Ueno M. Yoo C. Finn R.S. Furuse J. Ren Z. Yau T. Klümpen H.J. Chan S.L. Ozaka M. Pembrolizumab in combination with gemcitabine and cisplatin compared with gemcitabine and cisplatin alone for patients with advanced biliary tract cancer (KEYNOTE-966): A randomised, double-blind, placebo-controlled, phase 3 trial Lancet 2023 401 1853 1865 10.1016/S0140-6736(23)00727-4 37075781 16. Lin J. Dai Y. Sang C. Song G. Xiang B. Zhang M. Dong L. Xia X. Ma J. Shen X. Multimodule characterization of immune subgroups in intrahepatic cholangiocarcinoma reveals distinct therapeutic vulnerabilities J. Immunother. Cancer 2022 10 e004892 10.1136/jitc-2022-004892 35863823 PMC9310257 17. Vedeld H.M. Grimsrud M.M. Andresen K. Pharo H.D. von Seth E. Karlsen T.H. Honne H. Paulsen V. Färkkilä M.A. Bergquist A. Early and accurate detection of cholangiocarcinoma in patients with primary sclerosing cholangitis by methylation markers in bile Hepatology 2022 75 59 73 10.1002/hep.32125 34435693 PMC9300181 18. Yoo C. Jeong H. Jeong J.H. Kim K.P. Lee S. Ryoo B.Y. Hwang D.W. Lee J.H. Moon D.B. Kim K.H. Circulating tumor DNA status and dynamics predict recurrence in patients with resected extrahepatic cholangiocarcinoma J. Hepatol. 2025 82 861 870 10.1016/j.jhep.2024.10.043 39532185 19. Bahadir C.D. Omar M. Rosenthal J. Marchionni L. Liechty B.L. Pisapia D. Sabuncu M.R. Artificial intelligence applications in histopathology Nat. Rev. Electr. Eng. 2024 1 93 108 10.1038/s44287-023-00012-7 20. Chen C.L. Chen C.C. Yu W.H. Chen S.H. Chang Y.C. Hsu T.I. Hsiao M. Yeh C.Y. Chen C.Y. An annotation-free whole-slide training approach to pathological classification of lung cancer types using deep learning Nat. Commun. 2021 12 1193 10.1038/s41467-021-21467-y 33608558 PMC7896045 21. Chen R.J. Lu M.Y. Wang J. Williamson D.F. Rodig S.J. Lindeman N.I. Mahmood F. Pathomic fusion: An integrated framework for fusing histopathology and genomic features for cancer diagnosis and prognosis IEEE Trans. Med. Imaging. 2020 41 757 770 10.1109/TMI.2020.3021387 PMC10339462 32881682 22. Krook M.A. Lenyo A. Wilberding M. Barker H. Dantuono M. Bailey K.M. Chen H.Z. Reeser J.W. Wing M.R. Miya J. Efficacy of FGFR inhibitors and combination therapies for acquired resistance in FGFR2-fusion cholangiocarcinoma Mol. Cancer Ther. 2020 19 847 857 10.1158/1535-7163.MCT-19-0631 31911531 PMC7359896 23. Kather J.N. Pearson A.T. Halama N. Jäger D. Krause J. Loosen S.H. Marx A. Boor P. Tacke F. Neumann U.P. Deep learning can predict microsatellite instability directly from histology in gastrointestinal cancer Nat. Med. 2019 25 1054 1056 10.1038/s41591-019-0462-y 31160815 PMC7423299 24. Razumilava N. Gores G.J. Cholangiocarcinoma Lancet 2014 383 2168 2179 10.1016/S0140-6736(13)61903-0 24581682 PMC4069226 25. Lv T. Chen S. Li M. Zhang D. Kong Y. Jia J. Regional variation and temporal trend of primary biliary cholangitis epidemiology: A systematic review and meta-analysis J. Gastroenterol. Hepatol. 2021 36 1423 1434 10.1111/jgh.15329 33141955 26. Dosovitskiy A. Beyer L. Kolesnikov A. Weissenborn D. Zhai X. Unterthiner T. Dehghani M. Minderer M. Heigold G. Gelly S. An Image is Worth 16x16 Words: Transformers for Image Recognition at Scale arXiv 2020 2010.11929 27. Ghesu F.C. Georgescu B. Mansoor A. Yoo Y. Neumann D. Patel P. Vishwanath R.S. Balter J.M. Cao Y. Grbic S. Contrastive self-supervised learning from 100 million medical images with optional supervision J. Med. Imaging 2022 9 064503 10.1117/1.JMI.9.6.064503 36466078 PMC9710476 28. Kaissis G.A. Makowski M.R. Rückert D. Braren R.F. Secure, privacy-preserving and federated machine learning in medical imaging Nat. Mach. Intell. 2020 2 305 311 10.1038/s42256-020-0186-1 29. Singh Y. Andersen J.B. Hathaway Q. Venkatesh S.K. Gores G.J. Erickson B. Deep learning-based uncertainty quantification for quality assurance in hepatobiliary imaging-based techniques Oncotarget 2025 16 249 10.18632/oncotarget.28709 40184325 PMC11970935 30. Rizzo A. Brandi G. First-line chemotherapy in advanced biliary tract cancer ten years after the ABC-02 trial: “And yet it moves!” Cancer Treat. Res. Commun. 2021 27 100335 10.1016/j.ctarc.2021.100335 33592561 31. Vamathevan J. Clark D. Czodrowski P. Dunham I. Ferran E. Lee G. Li B. Madabhushi A. Shah P. Spitzer M. Applications of machine learning in drug discovery and development Nat. Rev. Drug. Discov. 2019 18 463 477 10.1038/s41573-019-0024-5 30976107 PMC6552674 32. Ramsundar B. Kearnes S. Riley P. Webster D. Konerding D. Pande V. Massively multitask networks for drug discovery arXiv 2015 10.48550/arXiv.1502.02072 1502.02072 33. Broutier L. Mastrogiovanni G. Verstegen M.M. Francies H.E. Gavarró L.M. Bradshaw C.R. Allen G.E. Arnes-Benito R. Sidorova O. Gaspersz M.P. Human primary liver cancer–derived organoid cultures for disease modeling and drug screening Nat. Med. 2017 23 1424 1435 10.1038/nm.4438 29131160 PMC5722201 34. Kourou K. Exarchos T.P. Exarchos K.P. Karamouzis M.V. Fotiadis D.I. Machine learning applications in cancer prognosis and prediction Comput. Struct. Biotechnol. J. 2015 13 8 17 10.1016/j.csbj.2014.11.005 25750696 PMC4348437 35. Honkala A. Malhotra S.V. Kummar S. Junttila M.R. Harnessing the predictive power of preclinical models for oncology drug development Nat. Rev. Drug Discov. 2022 21 99 114 10.1038/s41573-021-00301-6 34702990 36. Heymans M.W. Twisk J.W. Handling missing data in clinical research J. Clin. Epidemiol. 2022 151 185 188 10.1016/j.jclinepi.2022.08.016 36150546 37. Piha-Paul S.A. Oh D.Y. Ueno M. Malka D. Chung H.C. Nagrial A. Kelley R.K. Ros W. Italiano A. Nakagawa K. Efficacy and safety of pembrolizumab for the treatment of advanced biliary cancer: Results from the KEYNOTE-158 and KEYNOTE-028 studies Int. J. Cancer 2020 147 2190 2198 10.1002/ijc.33013 32359091 38. Liddell S.S. Chakrabarti S. Wintheiser G.A. Zemla T.J. Shi Q. Tella S.H. Mahipal A. Tumor mutational burden is a potential predictive biomarker for response to immune checkpoint inhibitors in patients with advanced biliary tract cancer JCO Precis. Oncol. 2022 6 e2200003 10.1200/PO.22.00003 35772047 39. Niazi M.K.K. Parwani A.V. Gurcan M.N. Digital pathology and artificial intelligence Lancet Oncol. 2019 20 e253 e261 10.1016/S1470-2045(19)30154-8 31044723 PMC8711251 40. Christenson R.H. Snyder S.R. Shaw C.S. Derzon J.H. Black R.S. Mass D. Epner P. Favoretto A.M. Liebow E.B. Laboratory medicine best practices: Systematic evidence review and evaluation methods for quality improvement Clin. Chem. 2011 57 816 825 10.1373/clinchem.2010.157131 21515742 41. Deep Learning Methods for Leveraging Data Scarcity and Enforcing Prior in Healthcare Image Analysis Available online: https://iris.unige.it/handle/11567/1244197 (accessed on 14 April 2025) 42. He J. Baxter S.L. Xu J. Xu J. Zhou X. Zhang K. The practical implementation of artificial intelligence technologies in medicine Nat. Med. 2019 25 30 36 10.1038/s41591-018-0307-0 30617336 PMC6995276 43. Gianfrancesco M.A. Tamang S. Yazdany J. Schmajuk G. Potential biases in machine learning algorithms using electronic health record data JAMA Intern. Med. 2018 178 1544 1547 10.1001/jamainternmed.2018.3763 30128552 PMC6347576 44. Wilhelm C. Steckelberg A. Rebitschek F.G. Is artificial intelligence for medical professionals serving the patients? Protocol for a mixed method systematic review on patient-relevant benefits and harms of algorithmic decision-making medRxiv 2024 10.1101/2024.03.27.24304965 PMC11378383 39242544 45. Goetze T.O. Roderburg C. Friedrich F.W. Trojan J. New perspectives in biliary tract cancers ESMO Gastrointest. Oncol. 2024 5 100092 10.1016/j.esmogo.2024.100092 46. Azizi S. Mustafa B. Ryan F. Beaver Z. Freyberg J. Deaton J. Loh A. Karthikesalingam A. Kornblith S. Chen T. Big self-supervised models advance medical image classification Proceedings of the IEEE/CVF International Conference on Computer Vision Montreal, QC, Canada 10–17 October 2021 3478 3488 47. Liu X. Rivera S.C. Moher D. Calvert M.J. Denniston A.K. Spirit A.I. Reporting guidelines for clinical trial reports for interventions involving artificial intelligence: The CONSORT-AI Extension Lancet Digit. Health 2020 2 e537 e548 10.1016/S2589-7500(20)30218-1 33328048 PMC8183333 48. He B. Bergenstråhle L. Stenbeck L. Abid A. Andersson A. Borg Å. Maaskola J. Lundeberg J. Zou J. Integrating spatial gene expression and breast tumour morphology via deep learning Nat. Biomed. Eng. 2020 4 827 834 10.1038/s41551-020-0578-x 32572199 49. Xu Q. Xie W. Liao B. Hu C. Qin L. Yang Z. Luo A. Interpretability of clinical decision support systems based on artificial intelligence from technological and medical perspective: A systematic review J. Healthc. Eng. 2023 9919269 10.1155/2023/9919269 36776958 PMC9918364 Figure 1 Multimodal foundation models (MFM) in biliary tract cancer (BTC) research. Figure 2 Multimodal foundation model architecture for the BTC analysis. Figure 3 Multimodal biomarker discovery in BTC. Figure 4 Challenges and future directions in multimodel AI for BTC Management. tomography-11-00096-t001_Table 1 Table 1 Distinct clinical and biological characteristics of iCCA versus pCCA with implications for MFM applications. Characteristic Intrahepatic Cholangiocarcinoma (iCCA) Perihilar Cholangiocarcinoma (pCCA) Presentation Mass-forming lesion within liver parenchyma [ 1 2 Infiltrative lesion at liver hilum [ 1 2 Diagnosis Accessible via core needle biopsy with high yield [ 9 Challenging; ERCP with brush cytology (<60% sensitivity) [ 9 Molecular Profile IDH1/2 FGFR2 4 5 KRAS PRKACA/PRKACB 4 Targeted Therapeutics FGFR inhibitors (pemigatinib, infigratinib), IDH inhibitors (ivosidenib) [ 7 8 Fewer clearly defined actionable targets [ 4 Primary Management Surgical resection with curative intent for localized, resectable disease [ 10 Palliative biliary stenting for unresectable tumors or those presenting with biliary obstruction [ 3 Surgical Approach Similar to other primary liver malignancies [ 10 Complex procedures with extensive hepatectomy with biliary vascular reconstruction [ 10 MFM Applications Integration of radiological features with molecular profiles to identify treatment-relevant subgroups Enhanced diagnostic accuracy through integration of imaging, cholangiography, and limited molecular data [ 11 12 tomography-11-00096-t002_Table 2 Table 2 Summary of Key Multimodal AI Studies in BTC and Related Cancers. Study Cancer Type Sample Size Data Modalities Key Findings Strengths Limitations Biomarker Discovery       Lin et al. (2022) [ 16 iCCA 363 patients Transcriptomics, genomics, clinical data Identified 4 immune subgroups; C-index 0.72 vs. 0.65 conventional Large iCCA cohort; validated immune signatures iCCA-only; high computational requirements Chen et al. (2022) [ 21 Pan-cancer (87 BTC) 5000+ samples Histology, genomics 85% accuracy predicting molecular alterations from H&E Pan-cancer validation; standardized methodology Small BTC subset; requires specialized infrastructure Yoo et al. (2024) [ 18 Extrahepatic CCA 156 patients ctDNA, clinical parameters AUC 0.78 vs. 0.62 for recurrence prediction Longitudinal design; clinical applicability Limited early-stage sensitivity (45%) Diagnostic Applications       Chen et al. (2023) [ 12 Pancreatic cancer 12,345 scans CT imaging, clinical data 94.1% sensitivity, 99.9% specificity Large-scale validation; high performance Not BTC-specific; different tumor biology Esteva et al. (2017) [ 11 Skin cancer 129,450 images Clinical images, metadata 91% sensitivity, 89% specificity vs. dermatologists Specialist-level performance; robust validation Different organ system; limited applicability Drug Discovery       Krook et al. (2020) [ 22 FGFR2-fusion CCA 25 patients Genomics, drug response Identified mTOR pathway synergy with FGFR inhibitors Mechanistic insights; clinically actionable Small sample; single molecular subtype Patient Stratification       Kather et al. (2019) [ 23 Gastrointestinal cancers 862 patients Histology, molecular data Microsatellite instability prediction from H&E alone Clinical validation; multiple cancer types Limited BTC representation; requires validation tomography-11-00096-t003_Table 3 Table 3 Technical Architectures and Performance Metrics. Architecture Type Study Technical Approach Performance Computational Clinical Feasibility Vision Transformers      Dosovitskiy et al. [ 26 ViT-Base/16 Self-attention mechanism for image patches 87% accuracy vs. 82% CNN 86 M parameters; 8 GPUs training Moderate—requires GPU infrastructure Lu et al. [ 20 Hierarchical ViT Multi-scale attention for WSI AUC 0.94 for survival prediction 300 M parameters; specialized memory High—requires HPC resources Cross-Modal Attention      Chen et al. [ 21 Histology-genomics fusion Cross-attention between image and molecular features 85% molecular prediction accuracy 150 M parameters; 4 GPUs Moderate—feasible in academic centers Self-Supervised Learning      Ghesu et al. [ 27 Contrastive learning 100 M medical images pretraining 15–20% improvement over supervised Variable; pretrained models available Low—uses pretrained features Federated Learning      Kaissis et al. [ 28 Privacy-preserving multimodal Distributed training across institutions Maintains 95% of centralized performance Network bandwidth dependent High—addresses privacy concerns Uncertainty Quantification      Singh et al. [ 29 Bayesian deep learning Monte Carlo dropout for confidence estimation Improved reliability in 78% of predictions 2× computational overhead Moderate—essential for clinical deployment ",
  "metadata": {
    "Title of this paper": "Interpretability of clinical decision support systems based on artificial intelligence from technological and medical perspective: A systematic review",
    "Journal it was published in:": "Tomography",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473628/"
  }
}