{
  "title": "Paper_163",
  "abstract": "pmc Dig Dis Dig Dis 2985 kargersd DDI Digestive Diseases (Basel, Switzerland) 0257-2753 1421-9875 pmc-is-collection-domain yes pmc-collection-title Karger Author's Choice PMC12490836 PMC12490836.1 12490836 12490836 40555196 10.1159/000547007 547007 1 Small and Large Bowel Impact of Therapeutic Agents on Serum Leucine-Rich Alpha-2 Glycoprotein for Monitoring Endoscopically Remitted Ulcerative Colitis Effect of Therapeutic Agents on Serum LRG in UC 2791507 Hayasaka Junnosuke  a 2791508 Matsui Akira  a 2791509 Kikuchi Daisuke  a  b 2791510 Hoteya Shu  a  a Minato-ku Japan  b Kawasaki Japan Correspondence to: Junnosuke Hayasaka, bandwagondane@gmail.com 24 6 2025 10 2025 43 5 498211 506 514 9 3 2025 9 6 2025 2025 24 06 2025 03 10 2025 03 10 2025 © 2025 The Author(s). Published by S. Karger AG, Basel 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is licensed under the Creative Commons Attribution-NonCommercial 4.0 International License (CC BY-NC) ( https://karger.com/Services/OpenAccessLicense Abstract Introduction Serum leucine-rich alpha-2 glycoprotein (LRG) levels are measured to monitor ulcerative colitis; however, the impact of concomitant medications on LRG remains unclear. This exploratory study aimed to determine the effects of various agents on serum LRG levels. Methods We conducted a single-center, retrospective study using medical records at our hospital from October 1, 2020, to June 30, 2023. Patients who underwent lower gastrointestinal endoscopy within 1 year before or after LRG measurement and had confirmed mucosal healing were included. The effects of medication on LRG levels were assessed using multiple regression analysis following multiple imputations. The analyzed agents included 5-aminosalicylic acid (5-ASA), immunomodulators, corticosteroids, calcineurin inhibitors, Janus kinase inhibitors, vedolizumab, interleukin-23 receptor antagonists, and anti-tumor necrosis factor (TNF)-α agents. Results A total of 214 patients (351 measurements) were included. The median LRG was 11.2 μg/mL. Among patients, 63.2 had a Mayo Endoscopic Subscore of 0, while 36.8% had a score of 1. The frequency of medication use was as follows: 5-ASA (88.9%), immunomodulators (13.1%), corticosteroids (2.6%), calcineurin inhibitors (0.9%), Janus kinase inhibitors (5.7%), vedolizumab (3.4%), interleukin-23 receptor antagonists (1.7%), and anti-TNF-α agents (7.4%). Corticosteroids, calcineurin inhibitors, Janus kinase inhibitors, and anti-TNF-α agents were negatively associated with LRG (β = −3.42, −10.4, −2.34, and −3.01, respectively). Conversely, vedolizumab and interleukin-23 receptor antagonists were positively associated with LRG (β = 1.83 and 4.69, respectively). Discussion/Conclusion LRG levels are influenced by medications, even in patients with mucosal healing. These effects should be considered when using LRG to monitor UC. Keywords Leucine-rich alpha-2 glycoprotein Ulcerative colitis Mucosal healing Biomarkers No funding was received for this study. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes accessibilitySummary WCAG 2.1 Level AA accessibility-pdf-ua-compliance yes Introduction Inflammatory bowel diseases (IBDs) are prevalent in North America and Europe, with incidence rates remaining stable [ 1 1 2 3 4 5 7 3 8 Serum biomarkers, on the other hand, offer a relatively noninvasive and easily repeatable alternative for monitoring disease activity. Therefore, identifying serum biomarkers that accurately reflect endoscopic activity is crucial. Leucine-rich α-2 glycoprotein (LRG) is a novel serum biomarker increasingly used to monitor UC. LRG is a 50-kDa glycoprotein with eight leucine-rich repeat domains and is induced by IL-22, tumor necrosis factor (TNF)-α, and IL-1β in an IL-6-independent manner [ 9 10 11 12 13 14 Currently, a wide range of therapeutic options for UC exists, including 5-aminosalicylic acid (5-ASA), immunosuppressive agents, small-molecule compounds, and biologics. Since LRG is influenced by cytokines, it may also be affected by immunosuppressive agents and biologics. However, it remains unclear whether LRG levels are impacted by these agents when used for UC monitoring. To address this gap, we conducted an exploratory study to evaluate the effects of various agents on LRG levels in the context of UC monitoring. Methods This retrospective study utilized electronic medical records at our hospital. The study included patients with UC whose LRG levels were measured between October 1, 2020, and June 30, 2023. For endoscopic monitoring, patients who underwent lower gastrointestinal endoscopy within 1 year before or after LRG measurement and had confirmed mucosal healing were included. When multiple LRG measurements were available for a single patient, not all were included in the analysis. Only values obtained within a short interval of the corresponding endoscopic examination were selected. Patients were excluded if they were undergoing remission induction therapy, experienced treatment modifications, had symptoms that changed after colorectal surgery, or exhibited symptom variation between examinations. In addition, one case in which LRG levels fell below the sensitivity threshold was excluded. Ultimately, 214 patients were included, with a total of 351 measurements: 65 patients tested twice, 22 patients three times, 8 patients four times, and 1 patient five times. Data Extraction Method In Japan, LRG testing is covered by insurance for patients with UC and Crohn’s disease. Therefore, we selected patients who were registered with either condition and had undergone LRG measurement during the study period. All cases were reviewed retrospectively using electronic medical records, and patients diagnosed with UC based on endoscopic, radiologic, histologic, and clinical criteria [ 15 16 This study was conducted in accordance with the 1975 Declaration of Helsinki (6th Edition, 2008) and was approved by the Hospital’s Ethics Committee (Approval No. 2202). Written informed consent was not required due to the retrospective study design, but patients were given the opportunity to opt out. LRG Monitoring In Japan, LRG measurement is generally reimbursed by health insurance only once every 3 months; thus, monitoring of UC using LRG is typically performed at 3-month intervals. A cutoff value of 16 μg/mL is commonly used, with levels below this threshold considered indicative of endoscopic remission, whereas levels at or above 16 μg/mL suggest the possibility of endoscopic disease activity. Evaluation Criteria We collected the following data: age, sex, disease location, disease duration, intervals between blood sampling and colonoscopy, and comorbidities (cancer, infectious disease, autoimmune disorder). Additionally, we recorded the partial Mayo score (PMS), Mayo Endoscopic Subscore (MES), medication use (5-aminosalicylic acid, immunomodulators, corticosteroids, calcineurin inhibitors, Janus kinase inhibitors, vedolizumab, interleukin-23 receptor antagonists, anti-TNF-α agents), and laboratory parameters (LRG, C-reactive protein, white blood cell count, hemoglobin, platelet count, erythrocyte sedimentation rate). Cancer was defined as any malignancy diagnosed within the past 5 years that was either not cured or remained under follow-up. Infections were classified as acute infections present at the time of LRG measurement. PMS was assessed at the time of LRG measurement. Concomitant medications included those prescribed for UC as well as those used to manage comorbid conditions. Statistical Analyses Univariate analysis was performed as follows: continuous variables were expressed as medians and interquartile ranges, while categorical variables were presented as numbers and percentages. The effect on LRG was evaluated using multiple regression analysis. The explanatory variables included age, sex, disease location, disease duration, comorbidities (cancer, infectious disease, autoimmune disorder), medications (5-ASA, immunomodulators, corticosteroids, calcineurin inhibitors, Janus kinase inhibitors, vedolizumab, interleukin-23 receptor antagonists, anti-TNF-α agents), and laboratory parameters (C-reactive protein, white blood cell count, hemoglobin, platelet count, and erythrocyte sedimentation rate). Missing data were present in 42.2% (148/351) of all cases. To address this, we used multiple imputations (MIs) to replace missing values with statistically plausible estimates, reducing potential bias. MI is a method that generates multiple datasets by imputing missing values based on observed data, often producing more reliable results than complete case analysis [ 17 18 19 Statistical significance was set at p Results The baseline characteristics of the participants are presented in Table 1 Table 2 Table 1. Characteristics of patients with ulcerative colitis ​  N Missing data Age, median [IQR], years 55.0 [43.0, 66.0] 0 Sex, male, N 225 (64.1) 0 Disease location, N 0 Proctitis 95 (27.1) ​ Left-sided 62 (17.7) ​ Extensive 194 (55.3) ​ Disease duration, median [IQR], years 12.0 [4.0, 23.0] 3 (0.85) Comorbidities, N Cancer 23 (6.6) 0 Infectious disease 3 (0.9) 0 Autoimmune disorder 12 (3.4) 0 Medication, N 5-aminosalicylic acid 312 (88.9) 0 Immunomodulators 46 (13.1) 0 Corticosteroids 9 (2.6) 0 Calcineurin inhibitors 3 (0.9) 0 Janus kinase inhibitor 20 (5.7) 0 Vedolizumab 12 (3.4) 0 Interleukin-12/23 receptor antagonists 6 (1.7) 0 Anti-TNF agents 26 (7.4) 0 Laboratory data, median [IQR] Leucine-rich alpha-2 glycoprotein, μg/mL 11.2 [9.8, 13.6] 0 Albumin, g/dL 4.4 [4.2, 4.6] 1 (0.28) C-reactive protein, mg/dL 0.05 [0.02, 0.12] 10 (2.85) White blood cell, /μL 5,500 [4,700, 6,500] 2 (0.57) Hemoglobin, g/dL 14.3 [13.2, 15.2] 2 (0.57) Platelet count, 10 3 253 [217, 293] 2 (0.57) Erythrocyte sedimentation rate, mm 5.0 [3.0, 11.5] 36 (10.3) Partial Mayo score, median [IQR] 0.0 [0.0, 1.0] 148 (42.2) Mayo Endoscopic Subscore, N 0 0 222 (63.2) ​ 1 129 (36.8) ​ Intervals between blood sampling and colonoscopy, median [IQR], days 23 [0, 119] 0 Immunomodulators included azathioprine and methotrexate. Calcineurin inhibitors included tacrolimus and cyclosporine. Janus kinase inhibitor included tofacitinib, upadacitinib, and filgotinib. Interleukin-23 receptor antagonists included ustekinumab and risankizumab. Anti-TNF-α agents included infliximab, adalimumab, and golimumab. Cancers included lung cancer, breast cancer, colorectal cancer, basal cell carcinoma, prostate cancer, vaginal cancer, mucosa-associated lymphoid tissue lymphoma, and neuroendocrine tumors. Infectious diseases include diverticulitis, herpes zoster, and the common cold. Autoimmune disorders included remitting seronegative symmetrical synovitis with pitting edema, polyarteritis nodosa, psoriasis, primary sclerosing cholangitis, and autoimmune hepatitis. IQR, interquartile range; TNF-α, tumor necrosis factor-alpha. Values are presented as number (%) or median [interquartile range]. Table 2. Clinical factors affecting LRG analyzed using multiple regression analysis with MIs ​ β 95% confidence interval  p Age (years) 0.004 −0.02 0.03 0.77 Sex, male −0.74 −1.48 0.01 0.066 Disease location Proctitis – Left-sided 0.11 −0.78 0.99 0.81 Extensive 0.36 −0.36 1.08 0.34 Disease duration, years −0.008 −0.04 0.02 0.58 Comorbidities Cancer 0.14 −1.08 1.36 0.84 Infectious disease 0.93 −2.15 4.01 0.56 Autoimmune disorder −1.37 −3.41 0.67 0.20 Medication 5-aminosalicylic acid −0.34 −1.28 0.59 0.49 Immunomodulators 0.54 −0.37 1.45 0.25 Corticosteroid −3.42 −5.94 −0.90 0.017 Calcineurin inhibitors −10.4 −15.2 −5.46 <0.001 Janus kinase inhibitor −2.34 −3.58 −1.09 <0.001 Vedolizumab 1.83 0.19 3.47 0.030 Interleukin-23 receptor antagonists 4.69 2.22 7.16 <0.001 Anti-TNF-α agents −3.01 −4.16 −1.85 <0.001 Laboratory data Albumin (g/dL) −1.59 −2.79 −0.40 0.013 C-reactive protein (mg/dL) 1.56 0.94 2.18 <0.001 White blood cell 0.25 <3,000/10 3 0.37 −1.95 2.69 0.77 3,000–9,999/10 3 – ≥10,000/10 3 1.73 −0.34 3.80 0.14 Hemoglobin, g/dL 0.36 0.08 0.64 0.013 Platelet <150/10 5 0.63 −1.17 2.42 0.62 150–349/10 5 – ≥350/10 5 1.98 0.81 3.14 0.002 Erythrocyte sedimentation rate, mm 0.30 0.26 0.34 <0.001 Immunomodulators included azathioprine and methotrexate. Calcineurin inhibitors included tacrolimus and cyclosporine. Janus kinase inhibitor included tofacitinib, upadacitinib, and filgotinib. Interleukin-23 receptor antagonists included ustekinumab and risankizumab. Anti-TNF-α agents included infliximab, adalimumab, and golimumab. Cancers included lung cancer, breast cancer, colorectal cancer, basal cell carcinoma, prostate cancer, vaginal cancer, mucosa-associated lymphoid tissue lymphoma, and neuroendocrine tumor. Infectious diseases included diverticulitis, herpes zoster, and the common cold. Autoimmune disorders included remitting seronegative symmetrical synovitis with pitting edema, polyarteritis nodosa, psoriasis, primary sclerosing cholangitis, and autoimmune hepatitis. TNF-α, tumor necrosis factor-alpha; LRG, leucine-rich alpha-2 glycoprotein. Corticosteroids, calcineurin inhibitors, Janus kinase inhibitors, and anti-TNF-α agents were negatively associated with LRG, whereas interleukin-23 receptor antagonists and vedolizumab were positively associated with LRG. 5-ASA and immunomodulators showed no significant association with LRG. Additionally, C-reactive protein, hemoglobin, platelet count, and ESR were positively associated with LRG, while albumin levels were negatively associated with LRG. Sensitivity Analysis  Table 3 Table 3. Three sensitivity analyses for agents affecting LRG ​ β 95% confidence interval  p Add MES as an explanatory variable 5-aminosalicylic acid −0.17 −1.10 0.75 0.72 Immunomodulators 0.43 −0.47 1.33 0.35 Corticosteroid −3.21 −5.70 −0.72 0.023 Calcineurin inhibitors −9.87 −14.7 −5.05 <0.001 Janus kinase inhibitor −2.11 −3.35 −0.88 0.001 Vedolizumab 2.13 0.50 3.75 0.011 Interleukin-23 receptor antagonists 4.75 2.32 7.18 <0.001 Anti-TNF-α agents −2.72 −3.87 −1.57 <0.001 Within 90 days of the LRG and colonoscopy 5-aminosalicylic acid −0.32 −1.38 0.74 0.56 Immunomodulators 0.08 −1.11 1.27 0.89 Corticosteroid −5.43 −9.42 −1.45 0.009 Calcineurin inhibitors −7.65 −13.0 −2.31 0.0067 Janus kinase inhibitor −2.45 −4.02 −0.87 0.003 Vedolizumab 2.58 0.64 4.52 0.010 Interleukin-23 receptor antagonists 4.93 1.98 7.88 0.002 Anti-TNF-α agents −2.36 −3.85 −0.86 0.002 Complete case analysis 5-aminosalicylic acid −0.96 −2.29 0.36 0.16 Immunomodulators 0.71 −0.34 1.76 0.18 Corticosteroid −2.20 −6.24 −1.83 0.29 Calcineurin inhibitors −1.27 −7.43 4.90 0.69 Janus kinase inhibitor −1.81 −3.47 −0.16 0.033 Vedolizumab 2.92 1.12 4.72 0.002 Interleukin-23 receptor antagonists 3.39 −0.46 7.24 0.087 Anti-TNF-α agents −2.68 −3.94 −1.43 <0.001 Immunomodulators included azathioprine and methotrexate. Calcineurin inhibitors included tacrolimus and cyclosporine. Janus kinase inhibitor included tofacitinib, upadacitinib, and filgotinib. Interleukin-23 receptor antagonists included ustekinumab and risankizumab. Anti-TNF-α agents included infliximab, adalimumab, and golimumab. MES, Mayo Endoscopic Subscore; TNF-α, tumor necrosis factor-alpha; LRG, leucine-rich alpha-2 glycoprotein. Corticosteroids and calcineurin inhibitors were negatively associated with LRG in both the MES-adjusted regression analysis and the analysis restricted to cases with ≤90 days between LRG measurement and colonoscopy; however, no such association was observed in the complete case analysis. Similarly, interleukin-23 receptor antagonists showed a positive association with LRG in the MES-adjusted and ≤90-day analyses, but not in the complete case analysis. Neither 5-ASA nor immunomodulators showed significant associations with LRG in any of the sensitivity analyses. Discussion This retrospective study analyzed the effects of various agents on LRG using MI. These findings revealed that LRG levels were negatively affected by corticosteroids, calcineurin inhibitors, Janus kinase inhibitors, and anti-TNF-α agents, while they were positively influenced by vedolizumab and interleukin-23 receptor antagonists. In contrast, 5-ASA and immunosuppressive agents had no apparent effect. These results suggest that LRGs are differentially affected by agents targeting distinct cytokines. To the best of our knowledge, this is the first study to evaluate the effects of agents on LRG after adjusting for clinical variables. Corticosteroids induce anti-inflammatory proteins via glucocorticoid receptor (GR)α and inhibit the production of various inflammatory proteins. When GRα enters the nucleus, it induces IκB kinase, a nuclear factor kappa B (NF-κB) inhibitory protein, via the glucocorticoid response element. GRα also interacts with transcription factors such as activator protein 1 (AP-1) and NF-κB via protein-protein interactions, inhibiting their DNA binding and transcriptional activity [ 20 23 24 When T cells recognize antigens via the TCR, signals are transmitted to the nucleus, and cytokines such as IL-1β, IL-2, IL-4, IL-6, TNF-α, and IFN-γ are produced. Calcineurin inhibitors form a complex with FK506-binding protein, which binds to calcineurin and inhibits its activity [ 25 26 27 28 There are four types of JAKs – JAK1, JAK2, JAK3, and TYK2 – which pair to facilitate intracellular signaling [ 29 30 31 32 33 However, JAK inhibitors do not inhibit TNF-α, IL-17, or IL-1, among other cytokines [ 29 TNF-α binds to TNF receptors, inducing cell death via caspase-8 and caspase-3, as well as triggering inflammatory responses via NF-κB, mitogen-activated protein kinase, and AP-1 pathways. It is speculated that by neutralizing TNF-α and suppressing the secretion of proinflammatory cytokines, anti-TNF-α agents contribute to lower LRG levels. Furthermore, even during mucosal healing, corticosteroids, calcineurin inhibitors, JAK inhibitors, and anti-TNF-α agents likely suppress cytokines that induce LRG, albeit through distinct pharmacologic mechanisms. In contrast, vedolizumab and interleukin-23 receptor antagonists were positively associated with LRG. Vedolizumab inhibits lymphocyte migration into the intestinal tract, exerting an anti-inflammatory effect [ 34 35 36 Ustekinumab targets the p40 subunit shared by IL-12 and IL-23 [ 37 38 39 40 39 41 42 43 Although some variability was observed in the sensitivity analyses, the associations remained consistent with the main analysis when endoscopic activity within the mucosal healing range was considered and when the interval between LRG measurement and colonoscopy was limited to 90 days or less, supporting the robustness of the primary findings. The fact that considering MES 0 and MES 1 in the sensitivity analysis did not change the effect of the agents on LRG is likely due to the limited discriminative power of LRG for MES 0 and MES 1. However, the number of complete cases was approximately half of the total cases. The differences observed in the sensitivity analysis compared to the main analysis may have resulted from the reduced number of agents included and potential overfitting in the multivariate analysis. We anticipate that the robustness of the findings will be further validated as more data are accumulated in future studies. This study had several limitations. First, it was a single-center, retrospective study, making some degree of bias unavoidable. Second, because this was a retrospective study, the timing of LRG measurement did not coincide with that of endoscopy. Therefore, discrepancies in endoscopic findings may have existed at the time of LRG measurement, even in the absence of changes in clinical symptoms. Third, not all biologics and JAK inhibitors could be evaluated individually. Finally, the study focused on patients undergoing maintenance therapy, and it remains unclear whether these findings apply to remission induction therapy. In conclusion, LRG levels are influenced differently by various agent concentrations, even in the presence of mucosal healing. Therefore, when using LRG to monitor UC, the specific medications being administered should be taken into account. Statement of Ethics This study received ethical approval from the Toranomon Hospital Institutional Review Board and conducted in accordance with the 1975 Declaration of Helsinki (6th edition, 2008). Informed consent was obtained from the patients through an opt-out method. Opt-out informed consent protocol was used for this study. This consent procedure was reviewed and approved by the Institutional Review Board of Toranomon Hospital, Approval No. (2202). Conflict of Interest Statement All authors have no conflicts of interest to disclose. Funding Sources No funding was received for this study. Author Contributions Junnosuke Hayasaka and Akira Matsui designed and conducted the study; Junnosuke Hayasaka performed statistical analysis and drafted the article; and Junnosuke Hayasaka, Akira Matsui, Daisuke Kikuchi, and Shu Hoteya collected and interpreted the data. All authors critically revised and prepared the manuscript and read and approved the submitted version of the manuscript. Data Availability Statement The data that support the findings of this study are not publicly available due to privacy and ethical restrictions but are available from the corresponding author upon reasonable request. References 1. Ng SC Shi HY Hamidi N Underwood FE Tang W Benchimol EI Worldwide incidence and prevalence of inflammatory bowel disease in the 21st century: a systematic review of population-based studies Lancet 2017 390 10114 2769 78 29050646 10.1016/S0140-6736(17)32448-0 2. Murakami Y Nishiwaki Y Oba MS Asakura K Ohfuji S Fukushima W Estimated prevalence of ulcerative colitis and Crohn’s disease in Japan in 2014: an analysis of a nationwide survey J Gastroenterol 2019 54 12 1070 7 31309327 10.1007/s00535-019-01603-8 3. Turner D Ricciuto A Lewis A D’Amico F Dhaliwal J Griffiths AM STRIDE-II: an update on the selecting therapeutic targets in inflammatory bowel disease (STRIDE) initiative of the International Organization for the Study of IBD (IOIBD)– determining therapeutic goals for treat-to-target strategies in IBD Gastroenterology 2021 160 5 1570 83 33359090 10.1053/j.gastro.2020.12.031 4. Arai M Naganuma M Sugimoto S Kiyohara H Ono K Mori K The ulcerative colitis endoscopic index of severity is useful to predict medium-to long-term prognosis in ulcerative colitis patients with clinical remission J Crohns Colitis 2016 10 11 1303 9 27194529 10.1093/ecco-jcc/jjw104 5. Ikeya K Hanai H Sugimoto K Osawa S Kawasaki S Iida T The ulcerative colitis endoscopic index of severity more accurately reflects clinical outcomes and long-term prognosis than the Mayo Endoscopic Score J Crohns Colitis 2016 10 3 286 95 26581895 10.1093/ecco-jcc/jjv210 PMC4957474 6. López-Palacios N Mendoza JL Taxonera C Lana R López-Jamar JM Díaz-Rubio M Mucosal healing for predicting clinical outcome in patients with ulcerative colitis using thiopurines in monotherapy Eur J Intern Med 2011 22 6 621 5 22075292 10.1016/j.ejim.2011.06.017 7. Peyrin-Biroulet L Ferrante M Magro F Campbell S Franchimont D Fidder H Results from the 2nd Scientific Workshop of the ECCO. I: impact of mucosal healing on the course of inflammatory bowel disease J Crohns Colitis 2011 5 477 83 21939925 10.1016/j.crohns.2011.06.009 8. Magro F Gionchetti P Eliakim R Ardizzone S Armuzzi A Barreiro-de Acosta M Third European evidence-based consensus on diagnosis and management of ulcerative colitis. Part 1: definitions, diagnosis, extra-intestinal manifestations, pregnancy, cancer surveillance, surgery, and ileo-anal pouch disorders J Crohns Colitis 2017 11 6 649 70 28158501 10.1093/ecco-jcc/jjx008 9. Haupt H Baudner S Isolierung und Charakterisierung eines bisher unbekannten leucinreichen 3.1S-α 2 Hoppe Seylers Z Physiol Chem 1977 358 1 639 46 69600 10. Serada S Fujimoto M Terabe F Iijima H Shinzaki S Matsuzaki S Serum leucine-rich alpha-2 glycoprotein is a disease activity biomarker in ulcerative colitis Inflamm Bowel Dis 2012 18 11 2169 79 22374925 10.1002/ibd.22936 11. Shinzaki S Matsuoka K Iijima H Mizuno S Serada S Fujimoto M Leucine-rich Alpha-2 glycoprotein is a serum biomarker of mucosal healing in ulcerative colitis J Crohns Colitis 2017 11 1 84 91 27466171 10.1093/ecco-jcc/jjw132 PMC5175492 12. Yasutomi E Inokuchi T Hiraoka S Takei K Igawa S Yamamoto S Leucine-rich alpha-2 glycoprotein as a marker of mucosal healing in inflammatory bowel disease Sci Rep 2021 11 1 11086 34045529 10.1038/s41598-021-90441-x PMC8160157 13. Ha YJ Kang EJ Lee SW Lee SK Park YB Song JS Usefulness of serum leucine-rich alpha-2 glycoprotein as a disease activity biomarker in patients with rheumatoid arthritis J Korean Med Sci 2014 29 9 1199 204 25246736 10.3346/jkms.2014.29.9.1199 PMC4168171 14. Furukawa K Kawamoto K Eguchi H Tanemura M Tanida T Tomimaru Y Clinicopathological significance of leucine-rich α2-Glycoprotein-1 in sera of patients with pancreatic cancer Pancreas 2015 44 1 93 8 25058884 10.1097/MPA.0000000000000205 15. Podolsky DK Inflammatory bowel disease (1) N Engl J Med 1991 325 13 928 37 1881418 10.1056/NEJM199109263251306 16. Podolsky DK Inflammatory bowel disease (2) N Engl J Med 1991 325 14 1008 16 1886623 10.1056/NEJM199110033251406 17. Rubin DB Schenker N Multiple imputation in health-care databases: an overview and some applications Stat Med 1991 10 4 585 98 2057657 10.1002/sim.4780100410 18. Aloisio KM Micali N Swanson SA Field A Horton NJ Analysis of partially observed clustered data using generalized estimating equations and multiple imputation Stata J 2014 14 4 863 83 25642154 PMC4306281 19. Rubin DB Multiple imputation for Nonresponse in Surveys New York Wiley 1987 20. Jonat C Rahmsdorf HJ Park KK Cato AC Gebel S Ponta H Antitumor promotion and antiinflammation: down-modulation of AP-1 (Fos/Jun) activity by glucocorticoid hormone Cell 1990 62 6 1189 204 2169351 10.1016/0092-8674(90)90395-u 21. Yang-Yen HF Chambard JC Sun YL Smeal T Schmidt TJ Drouin J Transcriptional interference between c-Jun and the glucocorticoid receptor: mutual inhibition of DNA binding due to direct protein-protein interaction Cell 1990 62 6 1205 15 2169352 10.1016/0092-8674(90)90396-v 22. Schüle R Rangarajan P Kliewer S Ransone LJ Bolado J Yang N Functional antagonism between oncoprotein c-Jun and the glucocorticoid receptor Cell 1990 62 6 1217 26 2169353 10.1016/0092-8674(90)90397-w 23. Ray A Prefontaine KE Physical association and functional antagonism between the p65 subunit of transcription factor NF-kappa B and the glucocorticoid receptor Proc Natl Acad Sci USA 1994 91 2 752 6 8290595 10.1073/pnas.91.2.752 PMC43027 24. Hoesel B Schmid JA The complexity of NF-κB signaling in inflammation and cancer Mol Cancer 2013 12 86 23915189 10.1186/1476-4598-12-86 PMC3750319 25. Siekierka JJ Staruch MJ Hung SH Sigal NH FK-506, a potent novel immunosuppressive agent, binds to a cytosolic protein which is distinct from the cyclosporin A-binding protein, cyclophilin J Immunol 1989 143 5 1580 3 2474605 26. Mattila PS Ullman KS Fiering S Emmel EA McCutcheon M Crabtree GR The actions of cyclosporin A and FK506 suggest a novel step in the activation of T lymphocytes EMBO J 1990 9 13 4425 33 1702384 10.1002/j.1460-2075.1990.tb07893.x PMC552235 27. Liu J Farmer JD Jr Lane WS Friedman J Weissman I Schreiber SL Calcineurin is a common target of cyclophilin-cyclosporin A and FKBP-FK506 complexes Cell 1991 66 4 807 15 1715244 10.1016/0092-8674(91)90124-h 28. McCaffrey PG Luo C Kerppola TK Jain J Badalian TM Ho AM Isolation of the cyclosporin-sensitive T cell transcription factor NFATp Science 1993 262 5134 750 4 8235597 10.1126/science.8235597 29. O’Shea JJ Laurence A McInnes IB Back to the future: oral targeted therapy for RA and other autoimmune diseases Nat Rev Rheumatol 2013 9 3 173 82 23419429 10.1038/nrrheum.2013.7 PMC4169143 30. Traves PG Murray B Campigotto F Galien R Meng A Di Paolo JA JAK selectivity and the implications for clinical inhibition of pharmacodynamic cytokine signalling by filgotinib, upadacitinib, tofacitinib and baricitinib Ann Rheum Dis 2021 80 7 865 75 33741556 10.1136/annrheumdis-2020-219012 PMC8237188 31. Honap S Danese S Peyrin-Biroulet L Are all janus kinase inhibitors for inflammatory bowel disease the same? Gastroenterol Hepatol 2023 19 12 727 38 PMC10885424 38404416 32. Dal Buono A Gabbiadini R Solitano V Vespa E Parigi TL Repici A Critical appraisal of filgotinib in the treatment of ulcerative colitis: current evidence and place in therapy Clin Exp Gastroenterol 2022 15 121 8 35909812 10.2147/CEG.S350193 PMC9329679 33. McInnes IB Byers NL Higgs RE Lee J Macias WL Na S Comparison of baricitinib, upadacitinib, and tofacitinib mediated regulation of cytokine signaling in human leukocyte subpopulations Arthritis Res Ther 2019 21 1 183 31375130 10.1186/s13075-019-1964-1 PMC6679539 34. Ley K Rivera-Nieves J Sandborn WJ Shattil S Integrin-based therapeutics: biological basis, clinical use and new drugs Nat Rev Drug Discov 2016 15 3 173 83 26822833 10.1038/nrd.2015.10 PMC4890615 35. Danese S Panés J Development of drugs to target interactions between leukocytes and endothelial cells and treatment algorithms for inflammatory bowel diseases Gastroenterology 2014 147 5 981 9 25220794 10.1053/j.gastro.2014.08.044 36. Matsumoto S Mashima H Clinical profiles of leucine-rich Alpha-2 glycoprotein for indicating mucosal healing in ulcerative colitis patients under administration of molecular-targeted drug Dig Dis 2025 43 1 11 8 39462503 10.1159/000542062 37. Sands BE Sandborn WJ Panaccione R O’Brien CD Zhang H Johanns J Ustekinumab as induction and maintenance therapy for ulcerative colitis N Engl J Med 2019 381 13 1201 14 31553833 10.1056/NEJMoa1900750 38. Pang Y D’Cunha R Winzenborg I Veldman G Pivorunas V Wallace K Risankizumab: mechanism of action, clinical and translational science Clin Transl Sci 2024 17 1 e13706 38266061 10.1111/cts.13706 PMC10777435 39. Moschen AR Tilg H Raine T IL-12, IL-23 and IL-17 in IBD: immunobiology and therapeutic targeting Nat Rev Gastroenterol Hepatol 2019 16 3 185 96 30478416 10.1038/s41575-018-0084-8 40. Watford WT Moriguchi M Morinobu A O’Shea JJ The biology of IL-12: coordinating innate and adaptive immune responses Cytokine Growth Factor Rev 2003 14 5 361 8 12948519 10.1016/s1359-6101(03)00043-1 41. Neurath MF IL-23 in inflammatory bowel diseases and colon cancer Cytokine Growth Factor Rev 2019 45 1 8 30563755 10.1016/j.cytogfr.2018.12.002 42. Pickert G Neufert C Leppkes M Zheng Y Wittkopf N Warntjen M STAT3 links IL-22 signaling in intestinal epithelial cells to mucosal wound healing J Exp Med 2009 206 7 1465 72 19564350 10.1084/jem.20082683 PMC2715097 43. Amano T Yoshihara T Shinzaki S Sakakibara Y Yamada T Osugi N Selection of anti-cytokine biologics by pretreatment levels of serum leucine-rich alpha-2 glycoprotein in patients with inflammatory bowel disease Sci Rep 2024 14 1 29755 39613813 10.1038/s41598-024-80285-6 PMC11607305 ",
  "metadata": {
    "Title of this paper": "Selection of anti-cytokine biologics by pretreatment levels of serum leucine-rich alpha-2 glycoprotein in patients with inflammatory bowel disease",
    "Journal it was published in:": "Digestive Diseases (Basel, Switzerland)",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490836/"
  }
}