{
  "title": "Paper_617",
  "abstract": "pmc Mater Today Bio Mater Today Bio 3810 mtbio Materials Today Bio 2590-0064 Elsevier PMC12481930 PMC12481930.1 12481930 12481930 41036215 10.1016/j.mtbio.2025.102320 S2590-0064(25)00890-7 102320 1 Review Article Recent advances in metal ions overloading for tumors: Mechanisms, nanomaterials, and therapies Gong Qiufang a b Shi Lili a Wen Lutong a Zhang Yanni a Chen Zaifeng a Wei Xiaojie a Song Xuejiao xjsong@njtech.edu.cn c ⁎ Dong Jingbo crydjb@wmu.edu.cn a ⁎⁎ Liang Chao liangchao@wmu.edu.cn a b ⁎⁎⁎ a b c ⁎ xjsong@njtech.edu.cn ⁎⁎ crydjb@wmu.edu.cn ⁎⁎⁎ liangchao@wmu.edu.cn 12 2025 16 9 2025 35 497120 102320 23 7 2025 2 9 2025 16 9 2025 16 09 2025 01 10 2025 02 10 2025 © 2025 The Authors. Published by Elsevier Ltd. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Metal ions serve as indispensable regulators in fundamental biological processes, maintaining critical physiological functions including osmotic equilibrium, acid-base regulation, intracellular signaling, and biomolecular recognition. Perturbations of ionic homeostasis can disrupt cellular integrity, leading to functional impairment and ultimately programmed cell death. Capitalizing on this paradigm, emerging nanotherapeutic approaches have pioneered the strategic induction of tumor-selective ions overloading as a potent anticancer strategy. This comprehensive review critically evaluates the roles of key metal ions (Na + + 2+ 2+ 2+ 2+/3+ 2+ Graphical abstract (1) Critically evaluates the roles of key metal ions (Na + + 2+ 2+ 2+ 2+ 3+ 2+ Image 1 Keywords Metal ions Ions overloading Mechanisms Nanomedicines Tumor therapy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Metal ions, as substances essential for cellular life activities, play vital roles in energy conversion, information transfer, metabolic regulation and other processes [ 1 2 3 4 5 6 7 8 Tumor cells themselves have a strong ability of self-regulation. When the ions distribution is abnormal, the cell will start the ions regulation mechanism and regulate the ions transport process by means of expulsion or internal storage to restore the physiological homeostasis [ 9 in vivo [10] [11] [12] 13 14 In this comprehensive review, we aim to systematically summarize the research progress and developmental trends in antitumor therapy centered around ions overloading, with a focus on sodium, potassium, calcium, copper, zinc, iron and manganese ions. The review encompasses various facets, including: (1) the key roles of different ions in tumor growth; (2) the underlying mechanisms of ions overloading in inhibiting tumor growth; (3) anti-tumor nanomedicine centered solely on ions overloading; (4) therapeutic strategies based on nanomedicine for combining ions overloading with other innovative therapies. Eventually, future direction and challenges of ions overloading in anti-tumor nanomedicines are elaborated, and the key problems and unsolved bottlenecks in promoting the development of ions overloading nanomedicines are also discussed ( Scheme 1 Scheme 1 Schematic overview of ions overloading based on nanoparticles for tumor treatment. Scheme 1 2 Ions overloading for tumor therapy 2.1 Sodium and potassium ions 2.1.1 Mechanisms of sodium and potassium ions overloading in tumor therapy Changes in intracellular concentrations of several key ions have been reported to have different effects on many cancers [ 15 16 + 2+ 17 2+ 18 In the field of tumor therapy, sodium ions overload exhibits unique mechanisms of action and potential applications. Under normal circumstances, cells maintain the homeostasis of low intracellular sodium and high extracellular sodium through sodium-potassium ATPase and ions channels. When sodium ions overloading occurs, it can affect tumor cells through multiple pathways. On one hand, excessive sodium ions disrupt the osmotic balance of cells, causing cells to swell due to massive water absorption and even rupture and die. Zhong et al. found that the small molecule compound Necrocide 1 (NC1) can specifically bind to and continuously activate the transient receptor potential cation channel subfamily M member 4 (TRPM4). As a non-selective monovalent cation channel, TRPM4, when activated, promotes a large influx of sodium ions, leading to membrane depolarization and subsequent induction of cell necrosis, a process named NECSO (Necrosis by Sodium Overload) [ 19 Potassium channels selectively promote potassium ions permeability between intracellular and extracellular compartments, and are extensively involved in the vital activities of cells. For instance, the expression of channels like Kv10.1 can influence the progression of the cell cycle, thereby directly increasing the proliferation of tumor cells [ 20 21 22 2.1.2 Nanoparticles for sodium ions overloading therapy Sodium ions are important ions to maintain the osmotic pressure of the fluid in the cell, and they can resist the outflow of chloride ions, thereby preventing the cell from dehydration and expansion. Controlling the flow of sodium ions can effectively affect the movement of the cell membrane, increase the impact resistance of the cell membrane, thereby promoting cell vitality and enhancing cell function. Based on these functions of sodium ions, breaking the equilibrium homeostasis of sodium ions changes the osmotic pressure of cells, which can cause cell damage. To this end, Liu et al. prepared phospholipid-coated Na 2 2 8 23 2 2 8 + 4 2− + 3 24 3 25 3 + + 3 26 4 4 2 4 Fig. 1 27 Fig. 1 4 4 2 4 + Fig. 1 Fig. 1 4 4 2 4 Fig. 1 (a) A schematic illustration demonstrating the fabrication procedure and functional mechanism of sodium succinate nanoparticles (C 4 4 2 4 4 4 2 4 27 Fig. 1 2.1.3 Nanoparticles for potassium ions overloading therapy Potassium is an important intracellular cation that regulates membrane potential, electrical excitation, protein synthesis, and cell death. Recent studies have shown that dying cancer cells release potassium into the tumor microenvironment, which affects cell survival. In addition, potassium channels and high potassium levels have also been reported to affect apoptosis. To achieve K + 3 7 28 29 + − 30 The delivery of a large amount of Na + + 2.2 Calcium ions 2.2.1 Mechanisms of calcium ions overloading in tumor therapy As a crucial intracellular second messenger, calcium ions maintain a free cytosolic concentration of approximately 100 nM under physiological homeostasis via a sophisticated regulatory system. This system encompasses calcium channels and transporterson the cell membrane, as well as specific calcium-regulating proteins on organelles such as the endoplasmic reticulum (ER), mitochondria, and lysosome. This dynamic balance underpins the orderly progression of core physiological processes, including cell proliferation, metabolism, and signal transduction [ 31 2+ 2+ 2+ 32 The role of calcium ions overloading in tumor therapy relies on multi-dimensional engineered strategies for the precise regulation of Ca 2+ 33 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ 34 In terms of therapeutic effects, calcium ions overloading not only directly kills tumor cells but also synergizes with other therapeutic modalities. The direct killing mechanisms primarily involve two pathways [ 35 2+ 2+ 2+ 2+ 2+ 2+ + 2+ 36 3 37 2 38 39 40 Table 1 Table 1 Recent advances of calcium overload-based cancer therapy. Table 1 Categories Materials Advantages Antitumor activities Activation mode Ref CaCO 3 Cu/CaCO 3 GSH depletion, mitochondrial dysfunction CDT, SDT US/pH/GSH [ 41 CaCO 3 Exogenous CO 2 / pH/GSH [ 42 VS 4 5 3 CO therapy, GSH depletion CDT, SDT US [ 43 CaNP CAT + BSO Oxygen/GSH depletion, Ca 2+ PDT pH [ 44 PLT@MCC/CUR Inhibit Ca 2+ 2+ Chemotherapy pH [ 45 B16F10@CaCO 3 2 TME reprogramming Immunotherapy pH [ 37 CaCUR Immunogenic cell death SDT, Immunotherapy US/pH [ 46 CaCO 3 2 Immunogenic cell death SDT, Immunotherapy US/pH [ 47 CMS Activate the STING signaling pathway, GSH depletion Immunotherapy, Ferroptosis pH/GSH [ 38 MG-RNP@CaCO 3 Combinatorial gene editing, CO gas nanotherapy GT pH/GSH [ 48 SA/Cur@CaCO 3 Cut off the energy supply PTT pH [ 49 O 2 3 Alleviate hypoxia in TME PDT pH/O 2 [ 50 OVA@CaCO 3 Disrupt multiple barriers in antigen cross-presentation of DCs Chemo-immunotherapy pH [ 51 PEG Enhance Mn 2+ CDT pH [ 52 IrCOOH–CaCO 3 Two-photon near-infrared excited photosensitizers PDT pH [ 53 M@CaCO 3 Break the calcium balance / pH [ 54 CoP@CaCO3 Immune cell death CDT, Immunotherapy pH [ 55 CaO 2 CaO 2 GSH depletion / pH [ 56 CaO 2 2 Two-way enhancement of ICD PDT, Immunotherapy pH [ 57 SH-CaO 2 Calcification / pH [ 58 CaO 2 Self-supplied H 2 2 CDT pH [ 59 HA/CaO 2 Self-supplied H 2 2 2 CDT, PDT pH [ 60 CCQ Weaken the heat resistance of tumors PTT pH [ 61 CaO 2 Self-supplied H 2 2 CDT pH [ 62 CaO 2 2 Self-supplied H 2 2 CDT pH [ 63 CMFO GSH depletion, amplify the oxidative stress CDT pH [ 64 BPQD@CaO 2 Combination therapy with calcium-overloading-mediated therapy and PDT PDT pH/NIR [ 65 mSiO 2 2 Self-supplied H 2 2 2 CDT, PDT pH [ 66 ECMT NSs ECM destruction, Self-supplied O 2 PDT, Immunotherapy pH [ 67 CaO 2 Cascade catalytic Ferroptosis pH [ 68 Lipo CaO 2 3+ Self-circulating ·OH, Multichannel amplified calcium overloading CDT pH [ 69 CaO 2 Reverse the TME / pH [ 70 CaP DECaNG Imbalance of mitochondrial Ca 2+ PTT pH [ 71 IDMMS@CaP NC GSH depletion and multiple O 2 PDT, PTT pH/GSH [ 72 TiO 2 Immunogenic cell death SDT, Immunotherapy US/pH [ 73 GO-Alg@CaP/CO Trebling additive efficacy of starvation therapy / pH [ 74 C@CF/CaP Increase the accumulation of drugs / pH [ 39 CaP-AA Mitochondrial disorder / pH [ 75 TCaNG Reversal of drug resistance / pH [ 76 DPGC/OI Autophagy inhibition PDT pH [ 77 CaBPs Changing the osmotic pressure / pH [ 78 CaF 2 CaF 2 Ca 2+ SDT US [ 79 CaH 2 CaH 2 Activate the immune system Hydrogen therapy, Immunotherapy pH [ 80 CaS ZnPP@PAA-CaS Chemical messenger-mediated immunotherapy Immunotherapy pH [ 81 CSSG Switch caspase-3-dependent apoptosis to pyroptosis Immunotherap pH [ 82 Others CSPN Overexpression of caspase-3 PDT NIR [ 83 CMA-nPS Membrane damage, mitochondrial dysfunction PDT NIR [ 84 2.2.2 Nanoparticles for calcium ions overloading therapy 2.2.2.1 Nanoparticles exclusively for calcium ions overloading therapy Hydroxyapatite (HAP, Ca 10 4 6 2 85 86 87 2+ 2+ Compared to CaP, due to the lower stability of CaO 2 2+ 2 2 2+ 2+ 2+ 2 2 58 2 2 2 2 88 2+ 2.2.2.2 Nanoparticles for combined calcium ions overloading and other therapy Chemotherapy is one of the most commonly utilized approaches for tumor treatment; however, it encounters numerous challenges throughout the treatment process, including non-specific distribution and multidrug resistance [ 89 2+ 76 3 54 3 3 2+ 2+ 2+ Pyroptosis, emerging as a promising avenue in cancer therapy, not only eradicates tumor cells but also incites a potent inflammatory reaction and bolsters anti-tumor immune responses [ 90 2+ 91 2+ 3 2+ 2+ 2+ 2+ 2+ Fig. 2 92 2+ 2+ Fig. 2 Fig. 2 2+ Fig. 2 (a) Anticancer mechanisms of Ca (IO 3 2 2+ + + + + + + + + 92 Fig. 2 Calcium signaling affects ROS levels by targeting crucial sites such as mitochondrial respiration and NOX enzymes. These ROS, in turn, directly and indirectly influence calcium transport proteins located in the plasma membrane, ER, and mitochondria [ 93 94 2 2+ 2 2 2+ 2 2+ 2+ 3 PEG 2+ 46 PEG 2+ Due to tumors' robust self-defense mechanisms, relying solely on a single ion overloading strategy for effective ion interference is extremely challenging. Shi et al. introduced a Cu + 2+ Fig. 3 95 3 Fig. 3 2+ Fig. 3 Fig. 3 (a) Therapeutic strategy of CCPCR NPs for tumor cells. (b) Mass ratios of Cu 2+ 2+ 95 Fig. 3 It is evident that calcium-based nanoplatforms represent a direct and highly effective approach to elevate intracellular Ca 2+ 2+ 2.3 Copper ions 2.3.1 Mechanisms of copper ions overloading in tumor therapy Copper, an essential trace element in the human body, plays a crucial role in cellular metabolism and signal transduction. However, imbalances in its concentration can trigger cytotoxicity [ 96 97 Normal cells maintain intracellular copper homeostasis through a series of regulatory processes, wherein copper uptake is controlled by membrane transporters, subcellular distribution is achieved via copper chaperones, and copper efflux is mediated by Cu-ATPases (ATP7A/B). In contrast, tumor cells exhibit elevated copper demand due to rapid proliferation, leading to upregulated expression of copper transporters such as CTR1. Additionally, characteristics of the TME including an acidic environment and high GSH levels, provide targets for the targeted induction of copper ions overloading. Two primary strategies are employed to induce copper ions overloading including active delivery of copper ions, and inhibition of copper efflux coupled with depletion of copper chelators. Notably, copper ions overloading kills tumor cells not through traditional oxidative stress, but via a cascade of “proteotoxic stress-mitochondrial dysfunction” known as cuproptosis, which specifically targets proteins associated with the mitochondrial TCA cycle. The key molecular steps of cuproptosis are as follows [ 98 + + 99 2+ + + 10 + 9 In recent years, there has been an upsurge of interest in developing strategies to utilize copper-based nanoparticles for the treatment of tumors, while copper chelators and copper ions carriers have shown great potential in targeted cancer therapy. In contrast to copper chelators, copper ions carriers are able to increase the concentration of copper ions in tumor cells, thereby triggering excess ROS-mediated cell death [ 97 2.3.2 Nanoparticles for copper ions overloading therapy 2.3.2.1 Nanoparticles exclusively for copper ions overloading Cuproptosis, a novel form of regulated cell death, hinges on copper ionophores to mediate copper delivery into cancer cells. To date, diverse ionophores have been developed, including disulfiram, 8-hydroxyquinoline, pyrithione, and elesclomol (ES). Notably, ES distinguishes itself via mitochondria-targeted selectivity, enabling selective copper transport and persistent mitochondrial accumulation to induce apoptosis for tumor suppression [ 100 101 2+ + 2+ 102 2.3.2.2 Nanoparticles for copper ions overloading and chemodynamic therapy Copper ions, the typical transition metal ions, can not only induce cuproptosis when overloadeding but also trigger copper ions-based Fenton-like reactions, thereby catalyzing the production of ROS from the overexpressed hydrogen peroxide in TME. However, both strategies are limited in practical applications by dysregulated key reaction substrates in the TME [ 103 2 2+ 2 2 2+ + + 104 2 2 4 105 2 106 To surmount challenges within the TME, the application of multimodal combination therapy has gained widespread use [ 107 108 Fig. 4 2+ 2 2 2 Fig. 4 2+ + Fig. 4 Fig. 4 Fig. 4 (a) Preparation and anti-tumor process of intelligent nanohybrid gels-Diagram. (b) Oxygen production curves for various samples. (c) UV–Vis spectra of MB over time. (d) Tumor photos and corresponding H&E staining post-treatment with various samples. Reproduced with permission from Ref. [ 108 Fig. 4 2.3.2.3 Nanoparticles for the copper ions overloading and other therapy Despite the higher concentration of copper ions in tumor tissues compared to normal tissues, achieving ideal therapeutic efficiency remains a challenge due to the intracellular copper ions concentration being too low. Additionally, copper ions-based therapy suffers from a lack of targeting, potentially resulting in non-selective accumulation of copper ions in normal tissues and subsequent cytotoxicity [ 100 109 2+ 110 2+ Cu 2+ 111 E.coli@Cu 2 112 E.coli@Cu 2 2 Fig. 5 2 x 2 Fig. 5 E.coli@Cu 2 Fig. 5 Fig. 5 (a) E.coli@Cu 2 2 112 Fig. 5 Copper overloading emerges as a potent strategy for eradicating tumor cells and augmenting ferroptosis within them, owing to its outstanding redox capabilities and catalytic impact on various proteins and enzymes. Copper ions overloading is frequently synergized with other treatments to amplify anticancer efficacy. Despite the heightened Fenton-like efficiency induced by copper overloading, the accrual of excessive copper ions in the body may entail certain biological metabolic toxicity. Therefore, continuous exploration of the specific metabolic processes in different tumor types is imperative, along with the ongoing optimization of copper ions drugs. 2.4 Zinc ions 2.4.1 Mechanisms of zinc ions overloading in tumor therapy Zinc, an essential trace element in the human body, maintains intracellular homeostasis through the coordinated regulation of zinc transporter families and metallothioneins. Zinc ions overloading refers to a state where the level of intracellular free zinc ions exceeds the physiological threshold, disrupting the dynamic balance [ 113 114 2+ 2+ + 115 Zinc ions overloading exerts antitumor effects through a multi-dimensional mechanism. Its targeting relies on the high expression of zinc transporters (e.g., ZIP4, ZIP6) and low metallothioneins buffering capacity in tumor cells. This strategy provides a novel approach with both specificity and low toxicity for combined tumor therapies, holding significant potential for clinical translation. 2.4.2 Nanoparticles for zinc ions overloading therapy 2.4.2.1 Zinc MOF-induced zinc ions overloading ZIF-8, or zinc imidazolate metal-organic framework, serves dual roles as a drug carrier and a nanoreactor. Furthermore, it has been discovered that ZIF-8 can deactivate glyceraldehyde phosphate dehydrogenase (GAPDH), consequently disrupting the glycolytic pathway [ 116 2+ 2+ 117 118 2+ 2+ 2+ 119 While immunotherapy holds the capability to automatically identify and eliminate malignant cells through the immune system, its efficacy relies heavily on the activation of tumor-associated antigens and specific T cells to stimulate the immune response against cancer cells [ 120 2+ 121 2+ 122 123 2+ 2.4.2.2 ZnO/ZnO 2 To better understand the mechanism of ZnO NPs-mediated cell death, Nadine Wiesmann et al. selected two different zinc oxide nanoparticles: ZnO NPs without any surface treatment and ZnO@SiO 2 124 2+ 125 ZnO 2 2 2 2+ 126 2 127 2 2+ 2 2 2 2 128 2+ 2 2 2 2+ 2 2 2+ 2+ Moreover, recent research has shed light on another strategy for combating tumors, involving the degradation of Mutp53 and activation of WTp53 protein [ 129 130 2+ 2 2 2+ 2+ 131 2 2 2+ Fig. 6 132 2 2 2 2 2 2+ 2+ Fig. 6 2 2+ 1 2 2+ Fig. 6 Fig. 6 (a) Schematic of multifunctional ZCIB inducing mitochondrial dysfunction via ROS/Zn 2+ 2+ 132 Fig. 6 2.5 Iron ions 2.5.1 Mechanisms of iron ions overloading in tumor therapy Tumor cells typically exhibit enhanced iron uptake capacity to meet the metabolic demands of rapid proliferation, a characteristic that renders them more susceptible to the cytotoxic effects induced by iron ions overloading [ 133 134 2+ 2+ 2 2 3+ − 135 136 137 + + 133 The iron ions overloading can also regulate the tumor microenvironment to inhibit tumor angiogenesis and metastasis [ 138 139 2.5.2 Nanoparticles for iron ions overloading therapy 2.5.2.1 Nanoparticles exclusively for iron ions overloading therapy Iron overloading can induce the occurrence of ferroptosis, which typically involves two primary mechanisms. One is controlled by the GPX4 pathway, triggering ferroptosis by disrupting the membrane protection mechanisms of tumor cells. The other involves inducing ferroptosis by elevating the Fe 2+ 140 2+ 141 142 2 2 Fig. 7 143 3+ 2+ Fig. 7 2+ Fig. 7 Fig. 7 Fig. 7 Fig. 7 (a) Schematic of mitoFePDA@R synthesis and the “closed-loop” strategy for ferroptosis-induced antitumor responses triggered by mitoFePDA@R. (b) Fe 2+ 143 Fig. 7 However, insufficient H 2 2 144 2 2 2 2 − 2.5.2.2 Nanoparticles for iron ions overloading and other therapy PDT enables photosensitizers to produce ROS in response to laser irradiation, but this approach is hampered by limited therapeutic range and extremely high oxygen consumption. Iron ions can improve the efficacy of PDT by producing large amounts of oxygen through the Fenton reaction to alleviate hypoxia in the tumor microenvironment [ 145 146 147 148 2 3+ 149 2+ 2+ − In order to improve the efficiency of ferroptosis, Zhou et al. devised a sophisticated liposomal nanosystem by encapsulating iron oxide nanoparticles ferumoxytol and sonsensitizers. This innovative approach aimed at achieving comprehensive tumor resection by inducing SDT-driven apoptosis and ferroptosis [ 150 3 4 151 3 4 3 4 152 Fig. 8 3 4 Fig. 8 Fig. 8 Fig. 8 Fig. 8 Fig. 8 Fig. 8 (a) Synthesis procedure and therapeutic mechanism of ferroptosis induction. (b) Western blot analysis of ferroptosis-related protein (GPX4 and DHODH) expression levels in CT26 cells treated with different formulations. (c) Photothermal effect of AZFCP observed in vivo. (d) Capacity of AZFCP for GSH depletion. (e) Time-dependent profiles of calcium overload achievement and O 2 152 Fig. 8 The immunogenicity of apoptotic cell fragments triggered by ferroptosis is strong, effectively stimulating the immune response and prompting specific immunity against antigens [ 153 154 3 4 155 3 4 − The iron ions overloading provides new targets and strategies for tumor therapy by inducing tumor cell ferroptosis, enhancing treatment sensitivity, and regulating the tumor microenvironment. In addition to iron-based nanocarriers that can induce ferroptosis caused by iron ions overloading alone, there are also non-iron-based nanocarriers. But the concentration of Fe 3+ 2+ 2.6 Manganese ions 2.6.1 Mechanisms of manganese ions overloading in tumor therapy Manganese, an essential micronutrient, maintains intracellular homeostasis via transporters such as ZIP8, ZIP14, and ZnT10 [ 156 2+ 157 Mechanistically, the excess Mn 2+ 158 159 + 2+ 2+ 2 2 160 161 Excess Mn 2+ 162 2+ 163 2.6.2 Nanoparticles for manganese ions overloading therapy Although manganese ions can activate the cGAS-STING pathway, they encounter issues with low efficiency and in vivo delivery challenges. In response, Du et al. have engineered an innovative manganese-based immunostimulatory metal-organic framework (ISAMn-MOF) [ 164 2+ 2+ 2+ 157 2+ 2+ Given the overarching influence of Mn 2+ Fig. 9 165 2 Fig. 9 Fig. 9 Fig. 9 2 166 167 Fig. 9 (a) Nanozymes (gCM@MnAu) for Cancer Immunotherapy: Design and Mechanism. (b) MB Absorption Spectra under Various Conditions. (c) Manau’s Mn 2+ 2 2 165 Fig. 9 2.7 Multiple metal ions 2.7.1 Roles and mechanisms In the context of antitumor therapy, the overloading of diverse metal ions exerts distinct roles by triggering unique biological effects (as presented in Table 2 35 168 Table 2 Roles of diverse metal ions in tumor therapy: mechanisms, biological behaviors, and signaling pathways. Table 2 Ions Types Mechanisms in Tumor Therapy Changes in Tumor Cell Biological Behavior Related Signaling Pathway Changes Na Disrupt cellular osmotic balance; Inhibit Na + + Induce necroptosis, inhibit proliferation and migration Activate the MAPK/JNK pathway Ca Activates phospholipases and endonucleases; Disrupts membranes and releases cytochrome c Induces mitochondria-dependent apoptosis and pyroptosis; Enhances immunogenicity ROS/Caspase-3/GSDME pathway; NF-κB pathway 2+ Cu Fenton-like reaction; Induces cuproptosis, ferroptosis and pyroptosis; Releases DAMPs, activating DC maturation and T cell responses Induces apoptosis, cuproptosis, ferroptosis, and pyroptosis; Remodels the immune microenvironment FDX1/DLAT pathway; NF-κB pathway; cGAS-STING pathway; GPX4 pathway Zn Inhibits glutathione reductase and thioredoxin reductase, and inducing mitochondrial dysfunction; Promoting DC maturation Induces apoptosis, pyroptosis; Enhances cytotoxic T cell infiltration and killing activity Caspase-1/GSDMD pathway; cGAS-STING/IRF3 pathway; p53 pathway Fe Inducing lipid peroxidation and ferroptosis; Downregulates intracellular Fe 2+ Induces ferroptosis and apoptosis; Enhances sensitivity to immune checkpoint inhibitors System Xc − Mn Generate ·OH via Fenton-like reaction; promoting type I interferon and proinflammatory cytokine secretion; Enhances immunogenic cell death Induces oxidative stress-mediated apoptosis; Promotes DC maturation and cytotoxic T cell infiltration cGAS-STING/IRF3 pathway; NF-κB pathway; MAPK pathway 2.7.2 Nanoparticles for multiple ions overloading therapy In recent years, multimetallic ions synergistic strategies have demonstrated significant advantages in tumor therapy through functional complementarity and mechanism superposition, forming cascade effects from inducing cell death to activating immune responses, thereby greatly improving therapeutic efficacy. Xu et al. developed a hollow calcium-copper bimetallic nanoplatform D@HCC-CuTH, which constructed an “endoplasmic reticulum-mitochondria” dual strike system through the synergistic overloading of Ca 2+ 2+ 169 2+ 2+ 2+ 2+ 170 2+ 2+ 2+ 171 2+ 2+ + 3 4 2 172 2+ 1 2 2+ 173 2+ 3 Conclusions and perspectives In essence, when the cellular homeostasis of specific ions is disrupted, it has a profound impact on the normal physiological activities of the cell. Consequently, we can impede the proliferation of tumor cells by intentionally inducing ions overloading in these cells, leading to an imbalance in ions homeostasis. Through meticulous design, nanoparticles can specifically target tumor cells and release drugs in response to specific environmental stimuli. This targeted approach not only enhances treatment efficacy but also serves to prevent resistance to other treatments. Various ions induce cancer cell death through distinct mechanisms. Although various nanoplatforms based on ions overloading regulation have made great progress in the research of tumor therapy, there are still areas that need to be explored. The characteristic of calcium overloading is the excessive accumulation of intracellular Ca 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ 2+ Similar to Ca 2+ 2+ 2+ 2+ 2+ 2+ 2+ Cuproptosis is a cell death mode directly induced by copper ions overloading, characterized by protein lipoylation and proteotoxic stress. In contrast, ferroptosis is primarily driven by iron-dependent lipid peroxidation and ROS accumulation, where iron ions act as critical cofactors. Nevertheless, metal ions overloading can potentiate ferroptosis by enhancing the availability of labile iron pools, thereby accelerating lipid peroxidation cascades. Cuproptosis is still in the exploratory stage, requiring continuous development of effective biomarkers to explore its relationship with cancer. Due to the potential cytotoxicity of excess copper ions, efforts are needed to enhance the controllability and targeting of copper ions release for improved biological safety. In addition, harnessing the bioimaging capabilities of manganese ions overloading nanoparticles, alongside actively exploring combined treatment strategies involving these nanoparticles and other therapeutic modalities (such as chemotherapy, immunotherapy, etc.), holds promise for overcoming tumor drug resistance and enhancing therapeutic efficacy. Furthermore, the sensitivity of tumor tissues to ions overloading depends on the metabolic state of cells, and there are differences in ions metabolism among different cell types. Targeted regulation for different cell types and the establishment of accurate biomarkers for predicting ions signals are essential. Despite the promising potential of metal ions overloading strategies in tumor therapy, their clinical translation faces multiple challenges and risks that require systematic consideration. The primary concern is the non-specific accumulation of metal ions in normal tissues, which may trigger toxic side effects, while nanocarriers used for ions delivery may trigger immune responses that further limit their biocompatibility. The complex TME, such as dense extracellular matrix and abnormal vasculature, hinders the accumulation and deep penetration of metal ions carriers in tumors, and even with ligand-modified targeted nanocarriers, the binding site barrier effect may prevent sufficient ions delivery to inner tumor cells, reducing therapeutic efficacy and increasing the risk of drug resistance. Precise regulation of intracellular metal ions concentrations is critical, as insufficient release fails to induce overload-mediated tumor cell death while excessive release exacerbates systemic toxicity, and current stimuli-responsive release systems often suffer from inconsistent responsiveness in heterogeneous TMEs, leading to uneven ions distribution within tumors that may result in incomplete tumor regression and recurrence. Therefore, based on the above discussion, further research is needed to design nanoparticles that can further improve their performance, improve the high selectivity of nanoparticles and minimize the adverse reactions caused by cancer treatment. In addition, the synergies between different ions and the synergistic effects of ions overloading with other treatments should be considered to jointly defeat tumor cells and achieve the optimal therapeutic effect. CRediT authorship contribution statement Qiufang Gong: Lili Shi: Lutong Wen: Yanni Zhang: Zaifeng Chen: Xiaojie Wei: Xuejiao Song: Jingbo Dong: Chao Liang: Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Chi Y. Sun P. Gao Y. Ion interference therapy of tumors based on inorganic nanoparticles Biosensors 12 2 2022 100 35200360 10.3390/bios12020100 PMC8870137 2 Rana S.V.S. Metals and apoptosis: recent developments J. Trace Elem. Med. Biol. 22 4 2008 262 284 19013355 10.1016/j.jtemb.2008.08.002 3 Yang L. Han B. Zhang M. Activation of BK channels prevents hepatic stellate cell activation and liver fibrosis through the suppression of TGFβ1/SMAD3 and JAK/STAT3 profibrotic signaling pathways Front. Pharmacol. 2020 11 2020 32210801 10.3389/fphar.2020.00165 PMC7068464 4 Yao J. Peng H. Qiu Y. Nanoplatform-mediated calcium overload for cancer therapy J. Mater. Chem. B 10 10 2022 1508 1519 35166287 10.1039/d1tb02721b 5 Yang M. Hu Y. Hao X. Ultrasound-actuated ion homeostasis perturbator for oxidative damage-augmented Ca2+ interference therapy and combined immunotherapy Mater. Today Bio 32 2025 101666 10.1016/j.mtbio.2025.101666 PMC11957807 40166376 6 Zhou J.-Y. Shen Q.-H. Xiong Y.-W. Zinc-mediated metalloimmunotherapy with dual elimination of tumor and intratumoral bacteria in oral squamous cell carcinoma Biomaterials 323 2025 123439 10.1016/j.biomaterials.2025.123439 40450766 7 Sun X. Zhang Y. Li J. Amplifying STING activation by cyclic dinucleotide–manganese particles for local and systemic cancer metalloimmunotherapy Nat. Nanotechnol. 16 11 2021 1260 1270 34594005 10.1038/s41565-021-00962-9 PMC8595610 8 Wang D. Zhang M. Qiu G. Extracellular Matrix Viscosity Reprogramming by In Situ Au Bioreactor-Boosted Microwavegenetics Disables Tumor Escape in CAR-T Immunotherapy ACS Nano 17 6 2023 5503 5516 36917088 10.1021/acsnano.2c10845 9 Wang W. Mo W. Hang Z. Cuproptosis: harnessing transition metal for cancer therapy ACS Nano 17 20 2023 19581 19599 37820312 10.1021/acsnano.3c07775 10 Mao L. Lu J. Wen X. Cuproptosis: mechanisms and nanotherapeutic strategies in cancer and beyond Chem. Soc. Rev. 54 13 2025 6282 6334 40433941 10.1039/d5cs00083a 11 Cai L. Han F. Ding J. Biodegradable and piezoelectric Mn-Doped hydroxyapatite for sonodynamic immunotherapy ACS Nano 2025 10.1021/acsnano.5c06775 40554728 12 Meng Q. Ding B. Ma P.A. Inorganic nanobiomaterials boost tumor immunotherapy: strategies and applications Accounts Chem. Res. 58 8 2025 1210 1223 10.1021/acs.accounts.4c00843 40179239 13 Wu Q. Zhang H. Liu H. External physical field-driven nanocatalytic cancer therapy 1 1 2023 e12010 14 Cui M. Xu B. Wang L. Recent advances in multi-metallic-based nanozymes for enhanced catalytic cancer therapy 2 1 2024 e12043 15 Ouwerkerk R. Bleich K.B. Gillen J.S. Tissue sodium concentration in human brain tumors as measured with 23Na MR imaging Radiology 227 2 2003 529 537 12663825 10.1148/radiol.2272020483 16 Biller A. Pflugmann I. Badde S. Sodium MRI in multiple sclerosis is compatible with intracellular sodium accumulation and inflammation-induced hyper-cellularity of acute brain lesions Sci. Rep. 6 1 2016 31269 10.1038/srep31269 PMC4978993 27507776 17 Wen J. Pang Y. Zhou T. Essential role of Na +/Ca2 + exchanger 1 in smoking-induced growth and migration of esophageal squamous cell carcinoma Oncotarget 7 39 2016 10.18632/oncotarget.11695 PMC5325406 27588478 18 Fulgenzi G. Graciotti L. Faronato M. Human neoplastic mesothelial cells express voltage-gated sodium channels involved in cell motility Int. J. Biochem. Cell Biol. 38 7 2006 1146 1159 16458569 10.1016/j.biocel.2005.12.003 19 Fu W. Wang J. Li T. Persistent activation of TRPM4 triggers necrotic cell death characterized by sodium overload Nat. Chem. Biol. 21 8 2025 1238 1249 39915626 10.1038/s41589-025-01841-3 20 Pardo L.A. Stühmer W. The roles of K+ channels in cancer Nat. Rev. Cancer 14 1 2014 39 48 24336491 10.1038/nrc3635 21 Dubois J.-M. Rouzaire-Dubois B. The influence of cell volume changes on tumour cell proliferation Eur. Biophys. J. 33 3 2004 227 232 14598000 10.1007/s00249-003-0364-1 22 Shimoda L.A. Polak J. Hypoxia. 4. Hypoxia and ion channel function Am. J. Physiol. Cell Physiol. 300 5 2011 C951 C967 21178108 10.1152/ajpcell.00512.2010 PMC3093942 23 Liu Y. Zhen W. Wang Y. Na2S2O8 nanoparticles trigger antitumor immunotherapy through reactive oxygen species storm and surge of tumor osmolarity J. Am. Chem. Soc. 142 52 2020 21751 21757 33337859 10.1021/jacs.0c09482 24 Zhang K, Li D, Wang K, et al. Lattice-Distortion Induced Niobium-based Perovskite Polarization Cascade Regulates Na+/K+ Atpase to Enhance Pyroptosis for Cancer Treatment[J], n/a(n/a): e11949. 25 Ding B. Zheng P. Tan J. Sodium bicarbonate nanoparticles for amplified cancer immunotherapy by inducing pyroptosis and regulating lactic acid metabolism Angew. Chem. Int. Ed. 62 40 2023 e202307706 10.1002/anie.202307706 37587061 26 Li J. Ding B. Tan J. Sodium citrate nanoparticles induce dual-path pyroptosis for enhanced antitumor immunotherapy through synergistic ion overload and metabolic disturbance Nano Lett. 23 21 2023 10034 10043 37903236 10.1021/acs.nanolett.3c03382 27 Zheng P. Wang G. Liu B. Succinate nanomaterials boost tumor immunotherapy via activating cell pyroptosis and enhancing MHC-I expression J. Am. Chem. Soc. 147 2 2025 1508 1517 39743855 10.1021/jacs.4c09566 PMC11744746 28 Ding B. Sheng J. Zheng P. Biodegradable upconversion nanoparticles induce pyroptosis for cancer immunotherapy Nano Lett. 21 19 2021 8281 8289 34591494 10.1021/acs.nanolett.1c02790 29 Huang Z. Zhang X. Luo Y. KCl nanoparticles as potential inducer of immunogenic cell death for cancer immunotherapy ACS Appl. Bio Mater. 6 6 2023 2404 2414 10.1021/acsabm.3c00219 37192493 30 Ma P. Luo Z. Li Z. Mitochondrial artificial K+ channel construction using MPTPP@5F8 nanoparticles for overcoming cancer drug resistance via disrupting cellular ion homeostasis Adv. Healthcare Mater. 13 2 2024 2302012 10.1002/adhm.202302012 37742136 31 Zeng G. Liang X. Ling Y. Tumor vascular occlusion by calcium-based thermosensitizer provokes continuous cavitation effect and thermal energy transition efficiency of radiofrequency ablation therapy Biomaterials 315 2025 122944 10.1016/j.biomaterials.2024.122944 39500110 32 Xiao Y. Li Z. Bianco A. Recent advances in calcium-based anticancer nanomaterials exploiting calcium overload to trigger cell apoptosis Adv. Funct. Mater. 33 3 2023 2209291 33 Panda S. Chatterjee O. Roy L. Targeting Ca2+ signaling: a new arsenal against cancer Drug Discov. Today 27 3 2022 923 934 34793973 10.1016/j.drudis.2021.11.012 34 Zhu Y. Yang Q. Yang M. Protein Corona of magnetic hydroxyapatite scaffold improves cell proliferation via activation of mitogen-activated protein kinase signaling pathway ACS Nano 11 4 2017 3690 3704 28314099 10.1021/acsnano.6b08193 35 Liang J.-L. Cao Y. Lv K. Amplifying Ca2+ overload by engineered biomaterials for synergistic cancer therapy Biomaterials 316 2025 123027 10.1016/j.biomaterials.2024.123027 39700532 36 Liu X. Hu H. Chen J. Engineering of calcium overload for state-of-the-art tumor therapy Chem. Eng. J. 501 2024 157747 37 Luo G. Li X. Lin J. Multifunctional calcium–manganese nanomodulator provides antitumor treatment and improved immunotherapy via reprogramming of the tumor microenvironment ACS Nano 17 16 2023 15449 15465 37530575 10.1021/acsnano.3c01215 PMC10448754 38 Deng X. Liu T. Zhu Y. Ca & Mn dual-ion hybrid nanostimulator boosting anti-tumor immunity via ferroptosis and innate immunity awakening Bioact. Mater. 33 2024 483 496 38125638 10.1016/j.bioactmat.2023.11.017 PMC10730349 39 Lv Y. Chen X. Shen Y. Folate-modified carboxymethyl chitosan-based drug delivery system for breast cancer specific combination therapy via regulating mitochondrial calcium concentration Carbohydr. Polym. 323 2024 121434 10.1016/j.carbpol.2023.121434 37940300 40 Wang D. Zhang L. Yang W.-H. Arginine-loaded nano-calcium-phosphate-stabilized lipiodol pickering emulsions potentiates transarterial embolization-immunotherapy 12 6 2025 2410484 10.1002/advs.202410484 PMC11809372 39680010 41 Zhao Y. Bian Y. Xiao X. Tumor microenvironment-responsive Cu/CaCO3-Based nanoregulator for mitochondrial homeostasis disruption-enhanced chemodynamic/sonodynamic therapy 18 38 2022 2204047 10.1002/smll.202204047 35997705 42 Xie C. Zhang T. Fu Y. CaCO3-MnSiOx hybrid particles to enable CO2-mediated combinational tumor therapy Nano Res. 15 9 2022 8281 8290 43 Chen H. Li Q. Kang H. An ultrasound-responsive smart nanoplatform leads to mitochondrial apoptosis of tumor cells from multiple levels Chem. Eng. J. 470 2023 143974 44 Zhu J. Jiao A. Li Q. Mitochondrial Ca2+-overloading by oxygen/glutathione depletion-boosted photodynamic therapy based on a CaCO3 nanoplatform for tumor synergistic therapy Acta Biomater. 137 2022 252 261 34653696 10.1016/j.actbio.2021.10.016 45 Zhang Y. Feng X. Jia X. Biomimetic Ca2+ nanogenerator based on ions interference strategy for tumour-specific therapy J. Drug Target. 29 10 2021 1094 1101 33896301 10.1080/1061186X.2021.1919123 46 Zheng P. Ding B. Jiang Z. Ultrasound-Augmented mitochondrial calcium ion overload by calcium nanomodulator to induce immunogenic cell death Nano Lett. 21 5 2021 2088 2093 33596078 10.1021/acs.nanolett.0c04778 47 Tang C. Li H. Sha M. A tumor microenvironment responsive titanium-based nanosonosensitizer for combination sonodynamic-immunotherapy with calcium ion overload Chem. Eng. J. 475 2023 146054 48 Li Y. Pan Y. Chen C. Multistage-Responsive gene editing to sensitize ion-interference enhanced carbon monoxide gas therapy 18 40 2022 2204244 10.1002/smll.202204244 36055775 49 Wang C. Li T. Wang Z. Nano-modulators with the function of disrupting mitochondrial Ca2+ homeostasis and photothermal conversion for synergistic breast cancer therapy J. Nanobiotechnol. 21 1 2023 465 10.1186/s12951-023-02220-7 PMC10694906 38049882 50 Zhou Y. Jing S. Liu S. Double-activation of mitochondrial permeability transition pore opening via calcium overload and reactive oxygen species for cancer therapy J. Nanobiotechnol. 20 1 2022 188 10.1186/s12951-022-01392-y PMC9004178 35413984 51 An J. Zhang K. Wang B. Nanoenabled disruption of multiple barriers in Antigen cross-presentation of dendritic cells via calcium interference for enhanced chemo-immunotherapy ACS Nano 14 6 2020 7639 7650 32427462 10.1021/acsnano.0c03881 52 Zheng P. Ding B. Zhu G. Usnea acid-incorporated Ca2+/Mn2+ ions reservoirs for elevated ion-interference therapy through synergetic biocatalysis and osmolarity imbalance 19 29 2023 2300370 10.1002/smll.202300370 37029698 53 Shen J. Liao X. Wu W. A pH-responsive iridium(iii) two-photon photosensitizer loaded CaCO3 nanoplatform for combined Ca2+ overload and photodynamic therapy Inorg. Chem. Front. 9 16 2022 4171 4183 54 Li Y. Zhou S. Song H. CaCO3 nanoparticles incorporated with KAE to enable amplified calcium overload cancer therapy Biomaterials 277 2021 121080 10.1016/j.biomaterials.2021.121080 34488120 55 Zhao X. Wan X. Huang T. Acidity-responsive nanocages as robust reactive oxygen species generators with butterfly effects for maximizing oxidative damage and enhancing cancer therapy J. Colloid Interface Sci. 618 2022 270 282 35339963 10.1016/j.jcis.2022.03.084 56 Sun Q. Liu B. Zhao R. Calcium peroxide-based nanosystem with cancer microenvironment-activated capabilities for imaging guided combination therapy via mitochondrial Ca2+ overload and chemotherapy ACS Appl. Mater. Interfaces 13 37 2021 44096 44107 34499466 10.1021/acsami.1c13304 57 Huang C. Lin B. Chen C. Synergistic reinforcing of immunogenic cell death and transforming tumor-associated macrophages via a multifunctional Cascade bioreactor for optimizing Cancer Immunother. 34 51 2022 2207593 10.1002/adma.202207593 36245299 58 Zhang M. Song R. Liu Y. Calcium-Overload-Mediated Tumor therapy by calcium peroxide nanoparticles Chem 5 8 2019 2171 2182 59 Kong H. Chu Q. Fang C. Cu–Ferrocene-Functionalized CaO2 nanoparticles to enable tumor-specific synergistic therapy with GSH depletion and calcium overload 8 14 2021 2100241 10.1002/advs.202100241 PMC8292872 34032026 60 Liang Y. Cai Z. Tang Y. H2O2/O2 self-supply and Ca2+ Overloading MOF-based Nanoplatform for cascade-amplified Chemodynamic and Photodynamic Therapy 2023 11 2023 10.3389/fbioe.2023.1196839 PMC10245387 37292097 61 Wang W. Yu J. Lin Y. NIR absorptive croconic acid/quercetin/CaO2 nanoplatform for tumor calcium overload therapy combined mild photothermal therapy Biomater. Adv. 149 2023 213418 10.1016/j.bioadv.2023.213418 37062124 62 Kong H. Fang C. Chu Q. Catalytic core–shell nanoparticles with self-supplied calcium and H2O2 to enable combinational tumor inhibition J. Nanobiotechnol. 19 1 2021 313 10.1186/s12951-021-01055-4 PMC8507391 34641854 63 Liu B. Bian Y. Liang S. One-Step integration of tumor microenvironment-responsive calcium and copper peroxides nanocomposite for enhanced Chemodynamic/Ion-interference therapy ACS Nano 16 1 2022 617 630 34957819 10.1021/acsnano.1c07893 64 Wang X. Li C. Jin H. Mutual promotion of oxidative stress amplification and calcium overload by degradable spatially selective self-cascade catalyst for synergistic tumor therapy Chem. Eng. J. 432 2022 134438 65 Guo D. Dai X. Liu K. A self-reinforcing nanoplatform for highly effective synergistic targeted combinatary calcium-overload and photodynamic therapy of cancer 12 12 2023 2202424 10.1002/adhm.202202424 36640265 66 Chen Y.-C. Liu Y.-J. Lee C.-L. Engineering H2O2 and O2 self-supplying nanoreactor to conduct synergistic chemiexcited photodynamic and calcium-overloaded therapy in orthotopic hepatic tumors 11 20 2022 2201613 10.1002/adhm.202201613 35879269 67 Chen X. Zhang X. Wu Y. Tumor extracellular matrix-targeted nanoscavengers reverse suppressive microenvironment for cocktail therapy Mater. Today 61 2022 78 90 68 Yin Y. Jiang T. Hao Y. Cascade catalytic nanoplatform based on ions interference strategy for calcium overload therapy and ferroptosis Int. J. Pharm. 606 2021 120937 10.1016/j.ijpharm.2021.120937 34310960 69 Chen X. Xu C. Zhao P. A multichannel Ca2+ nanomodulator amplifies exogenous and endogenous calcium overload for efficient antitumor and antimetastasis therapy Chem. Eng. J. 463 2023 142478 70 Wang Y. He X. Zhou C. Nanoscale CaO2 materials for synergistic transarterial chemoembolization in a VX2 orthotopic rabbit liver cancer model Acta Biomater. 154 2022 536 548 36241014 10.1016/j.actbio.2022.09.074 71 Xu L. Tong G. Song Q. Enhanced intracellular Ca2+ nanogenerator for tumor-specific synergistic therapy via disruption of mitochondrial Ca2+ homeostasis and photothermal therapy ACS Nano 12 7 2018 6806 6818 29966081 10.1021/acsnano.8b02034 72 Liu B. Feng L. Bian Y. Calcification of indocyanine green laden dendritic mesoporous manganese-silicon nanocomposite for multiple oxygen compensation enhanced phototherapy 11 11 2023 2202022 73 Tan X. Huang J. Wang Y. Transformable nanosensitizer with tumor microenvironment-activated sonodynamic process and calcium release for enhanced cancer Immunotherapy[J] 60 25 2021 14051 14059 10.1002/anie.202102703 33797161 74 Wang X. Li Y. Jia F. Boosting nutrient starvation-dominated cancer therapy through curcumin-augmented mitochondrial Ca2+ overload and obatoclax-mediated autophagy inhibition as supported by a novel nano-modulator GO-Alg@CaP/CO J. Nanobiotechnol. 20 1 2022 225 10.1186/s12951-022-01439-0 PMC9097046 35551609 75 Zhao Y. Yu X. Kong W. Responsive calcium-derived nanoassemblies induce mitochondrial disorder to promote tumor calcification Chem. Sci. 14 35 2023 9350 9359 37712028 10.1039/d3sc02945j PMC10498499 76 Liu J. Zhu C. Xu L. Nanoenabled intracellular calcium bursting for safe and efficient reversal of drug resistance in tumor cells Nano Lett. 20 11 2020 8102 8111 33064007 10.1021/acs.nanolett.0c03042 77 Wang X. Li Y. Deng X. Colloidally stabilized DSPE-PEG-Glucose/Calcium phosphate hybrid nanocomposites for enhanced photodynamic cancer therapy via complementary mitochondrial Ca2+ overload and autophagy inhibition ACS Appl. Mater. Interfaces 13 33 2021 39112 39125 34384220 10.1021/acsami.1c11583 78 Pan T. Fu W. Xin H. Calcium phosphate mineralized black phosphorous with enhanced functionality and anticancer bioactivity 30 38 2020 2003069 79 Dong C. Dai X. Wang X. A calcium fluoride nanozyme for ultrasound-amplified and Ca2+-Overload-Enhanced catalytic tumor nanotherapy 34 43 2022 2205680 10.1002/adma.202205680 36106691 80 Gong F. Xu J. Liu B. Nanoscale CaH2 materials for synergistic hydrogen-immune cancer therapy Chem 8 1 2022 268 286 81 Zhao H. Wang L. Zeng K. Nanomessenger-mediated signaling Cascade for antitumor immunotherapy ACS Nano 15 8 2021 13188 13199 34342966 10.1021/acsnano.1c02765 82 Yu Q. Li Q. Tu L. Calcium sulfide based nanoreservoirs elicit dual pyroptosis pathways for enhanced anti-tumor immunity Chem. Eng. J. 477 2023 147085 83 Ni X. Shi W. Liu Y. Capsaicin-decorated semiconducting polymer nanoparticles for light-controlled calcium-Overload/Photodynamic combination therapy 18 19 2022 2200152 10.1002/smll.202200152 35398988 84 2022, 18(48): 2204689. 85 Zhou H. Lee J. Nanoscale hydroxyapatite particles for bone tissue engineering Acta Biomater. 7 7 2011 2769 2781 21440094 10.1016/j.actbio.2011.03.019 86 Sun Y. Chen Y. Ma X. Mitochondria-targeted hydroxyapatite nanoparticles for selective growth inhibition of lung cancer in vitro and in vivo ACS Appl. Mater. Interfaces 8 39 2016 25680 25690 27602785 10.1021/acsami.6b06094 87 Zhang S. Ma X. Sha D. A novel strategy for tumor therapy: targeted, PAA-functionalized nano-hydroxyapatite nanomedicine J. Mater. Chem. B 8 41 2020 9589 9600 33006361 10.1039/d0tb01603a 88 Liu B. Liang S. Wang Z. A tumor-microenvironment-responsive nanocomposite for hydrogen sulfide gas and trimodal-enhanced enzyme dynamic therapy Adv. Mater. 33 30 2021 2101223 10.1002/adma.202101223 34145652 89 Zeng J.-Y. Zhang M.-K. Peng M.-Y. Porphyrinic metal–organic frameworks coated gold nanorods as a versatile nanoplatform for combined photodynamic/photothermal/chemotherapy of tumor Adv. Funct. Mater. 28 8 2018 1705451 90 Zhang Z. Zhang Y. Xia S. Gasdermin E suppresses tumour growth by activating anti-tumour immunity Nature 579 7799 2020 415 420 32188940 10.1038/s41586-020-2071-9 PMC7123794 91 Zheng P. Ding B. Zhu G. Biodegradable Ca2+ nanomodulators activate pyroptosis through mitochondrial Ca2+ overload for cancer immunotherapy Angew. Chem. Int. Ed. 61 36 2022 e202204904 10.1002/anie.202204904 35687022 92 Wang M, Xue F, An L, et al. Photoacoustic-imaging-guided photothermal regulation of calcium influx for enhanced immunogenic cell death[J]. Adv. Funct. Mater., n/a(n/a): 2311853. 93 Madreiter-Sokolowski C.T. Thomas C. Ristow M. Interrelation between ROS and Ca2+ in aging and age-related diseases J. Redox Biol. 36 2020 101678 10.1016/j.redox.2020.101678 PMC7451758 32810740 94 Shen J. Yu H. Shu Y. A robust ROS generation strategy for enhanced chemodynamic/photodynamic therapy via H2O2/O2 self-supply and Ca2+ overloading Adv. Funct. Mater. 31 50 2021 2106106 95 Yan J, Chen H, Guimarães C F, et al. Cu+/Ca2+ dual-overload strategy assisted by metabolic-symbiotic-destruction for tumor apoptosis and tumor immune activation[J]. Adv. Funct. Mater.: 2403245. . 96 Leung L. Niculescu-Duvaz D. Smithen D. Anti-metastatic inhibitors of lysyl oxidase (LOX): design and structure–activity relationships J. Med. Chem. 62 12 2019 5863 5884 31070916 10.1021/acs.jmedchem.9b00335 PMC6937593 97 Ge E.J. Bush A.I. Casini A. Connecting copper and cancer: from transition metal signalling to metalloplasia Nat. Rev. Cancer 22 2 2022 102 113 34764459 10.1038/s41568-021-00417-2 PMC8810673 98 Halliwell B. Gutteridge J.M.C. Oxygen toxicity, oxygen radicals, transition metals and disease Biochem. J. 219 1 1984 1 14 6326753 10.1042/bj2190001 PMC1153442 99 Tsvetkov P. Coy S. Petrova B. Copper induces cell death by targeting lipoylated TCA cycle proteins Science 375 6586 2022 1254 1261 35298263 10.1126/science.abf0529 PMC9273333 100 Oliveri V. Biomedical applications of copper ionophores Coord. Chem. Rev. 422 2020 213474 101 Guo B. Yang F. Zhang L. Cuproptosis induced by ROS responsive nanoparticles with elesclomol and copper combined with αPD-L1 for enhanced Cancer Immunother. 35 22 2023 2212267 10.1002/adma.202212267 36916030 102 Huynh T.M.H. Luc V.-S. Chiang M.-R. Programmed lung metastasis immunotherapy via cascade-responsive cell membrane-mimetic copolymer-wrapped nanoraspberry-mediated elesclomol-copper delivery 34 34 2024 2401806 103 Jia C. Guo Y. Wu F.-G. Chemodynamic therapy via fenton and fenton-like nanomaterials: strategies and recent advances Small 18 6 2022 2103868 10.1002/smll.202103868 34729913 104 Chen C. Tan Y. Xu T. Sorafenib-loaded copper peroxide nanoparticles with redox balance disrupting capacity for enhanced chemodynamic therapy against tumor cells Langmuir 38 40 2022 12307 12315 36154182 10.1021/acs.langmuir.2c01938 105 Zhao F. Liang L. Wang H. H2S-Activated ion-interference therapy: a novel tumor targeted therapy based on copper-overload-mediated cuproptosis and pyroptosis Adv. Funct. Mater. 33 38 2023 2300941 106 Zhang J. Han M. Zhang J. Syphilis mimetic nanoparticles for cuproptosis-based synergistic cancer therapy via reprogramming copper metabolism Int. J. Pharm. 640 2023 123025 10.1016/j.ijpharm.2023.123025 37164186 107 Sen S. Won M. Levine M.S. Metal-based anticancer agents as immunogenic cell death inducers: the past, present, and future Chem. Soc. Rev. 51 4 2022 1212 1233 35099487 10.1039/d1cs00417d PMC9398513 108 Yang Z. Zhao Z. Cheng H. In-situ fabrication of novel Au nanoclusters-Cu2+@sodium alginate/hyaluronic acid nanohybrid gels for cuproptosis enhanced photothermal/photodynamic/chemodynamic therapy via tumor microenvironment regulation J. Colloid Interface Sci. 641 2023 215 228 36933468 10.1016/j.jcis.2023.03.065 109 Zhou J. Yu Q. Song J. Photothermally triggered copper payload release for Cuproptosis-Promoted cancer synergistic therapy Angew. Chem. Int. Ed. 62 12 2023 e202213922 10.1002/anie.202213922 36585379 110 Ning S. Lyu M. Zhu D. Type-I AIE photosensitizer loaded biomimetic system boosting cuproptosis to inhibit breast cancer metastasis and rechallenge ACS Nano 17 11 2023 10206 10217 37183977 10.1021/acsnano.3c00326 111 Xu W. Qian J. Hou G. A hollow amorphous bimetal organic framework for synergistic cuproptosis/ferroptosis/apoptosis anticancer therapy via disrupting intracellular redox homeostasis and copper/iron metabolisms Adv. Funct. Mater. 32 40 2022 2205013 112 Ruan Y, Zhuang H, Zeng X, et al. Engineered microbial nanohybrids for tumor-mediated NIR II photothermal enhanced ferroptosis/cuproptosis and immunotherapy[J]. Adv. Healthcare Mater., n/a(n/a): 2302537. 10.1002/adhm.202302537 37742322 113 Zhao L. Xia Z. Wang F. Zebrafish in the sea of mineral (iron, zinc, and copper) metabolism Front. Pharmacol. 5 2014 10.3389/fphar.2014.00033 PMC3944790 24639652 114 Kaltenberg J. Plum L.M. Ober-Blöbaum J.L. Zinc signals promote IL-2-dependent proliferation of T cells Eur. J. Immunol. 40 5 2010 1496 1503 20201035 10.1002/eji.200939574 115 Nimmanon T. Ziliotto S. Ogle O. The ZIP6/ZIP10 heteromer is essential for the zinc-mediated trigger of mitosis Cell. Mol. Life Sci. 78 4 2021 1781 1798 32797246 10.1007/s00018-020-03616-6 PMC7904737 116 Abildgaard C. Guldberg P. Molecular drivers of cellular metabolic reprogramming in melanoma Trends Mol. Med. 21 3 2015 164 171 25618774 10.1016/j.molmed.2014.12.007 117 Wu S. Zhang K. Liang Y. Nano-enabled tumor systematic energy exhaustion via zinc (II) interference mediated glycolysis inhibition and specific GLUT1 depletion Adv. Sci. 9 7 2022 2103534 10.1002/advs.202103534 PMC8895132 34913610 118 Meng Z. Zhang X. Tan H. Zinc-enriched nanosystem for dual glycolysis regulation and photothermal therapy to synergistically inhibit primary melanoma and lung metastasis Chem. Eng. J. 435 2022 134781 119 Lv C. Kang W. Liu S. Growth of ZIF-8 nanoparticles in situ on graphene oxide nanosheets: a multifunctional nanoplatform for combined ion-interference and photothermal therapy ACS Nano 16 7 2022 11428 11443 35816172 10.1021/acsnano.2c05532 120 Jhunjhunwala S. Hammer C. Delamarre L. Antigen presentation in cancer: insights into tumour immunogenicity and immune evasion Nat. Rev. Cancer 21 5 2021 298 312 33750922 10.1038/s41568-021-00339-z 121 Wu F. Li Y. Meng Y. An ion-enhanced oncolytic virus-like nanoparticle for tumor immunotherapy Angew. Chem. Int. Ed. 61 45 2022 e202210487 10.1002/anie.202210487 36117387 122 Lim B. Kim K.S. Na K. pH-Responsive zinc ion regulating immunomodulatory nanoparticles for effective cancer immunotherapy Biomacromolecules 24 9 2023 4263 4273 37616157 10.1021/acs.biomac.3c00557 123 Guo X. Tu P. Wang X. Decomposable nanoagonists enable NIR-elicited cGAS-STING activation for tandem-amplified photodynamic-metalloimmunotherapy 36 21 2024 2313029 10.1002/adma.202313029 38353366 124 Wiesmann N. Kluenker M. Demuth P. Zinc overload mediated by zinc oxide nanoparticles as innovative anti-tumor agent J. Trace Elem. Med. Biol. 51 2019 226 234 30115501 10.1016/j.jtemb.2018.08.002 125 Zhao Y.-Z. Lin M.-T. Lan Q.-H. Silk fibroin-modified disulfiram/zinc oxide nanocomposites for pH triggered release of Zn2+ and synergistic antitumor efficacy Mol. Pharm. 17 10 2020 3857 3869 32833457 10.1021/acs.molpharmaceut.0c00604 126 Lin L.-S. Wang J.-F. Song J. Cooperation of endogenous and exogenous reactive oxygen species induced by zinc peroxide nanoparticles to enhance oxidative stress-based cancer therapy Theranostics 9 24 2019 7200 7209 31695762 10.7150/thno.39831 PMC6831298 127 Zhang D.-Y. Huang F. Ma Y. Tumor microenvironment-responsive Theranostic nanoplatform for guided molecular dynamic/photodynamic synergistic therapy ACS Appl. Mater. Interfaces 13 15 2021 17392 17403 33829761 10.1021/acsami.1c03277 128 Jiang Y. Shao K. Zhang F. “Block and attack” strategy for tumor therapy through ZnO2/siRNA/NIR-mediating Zn2+-overload and amplified oxidative stress Aggregate 4 4 2023 e321 129 Yue X. Zhao Y. Xu Y. Mutant p53 in cancer: accumulation, Gain-of-Function, and therapy J. Mol. Biol. 429 11 2017 1595 1606 28390900 10.1016/j.jmb.2017.03.030 PMC5663274 130 Wang J. Qu C. Shao X. Carrier-free nanoprodrug for p53-mutated tumor therapy via concurrent delivery of zinc-manganese dual ions and ROS Bioact. Mater. 20 2023 404 417 35784636 10.1016/j.bioactmat.2022.06.005 PMC9218170 131 Zhou M. Liang S. Liu D. Manganese-enriched zinc peroxide functional nanoparticles for potentiating cancer immunotherapy Nano Lett. 23 22 2023 10350 10359 37930173 10.1021/acs.nanolett.3c02941 132 Jin L. Zhou S. Zhang T. A multi-functional Cascade nanoreactor for remodeling tumor microenvironment to realize mitochondria dysfunction via ROS/Zn2+ ions overload 21 2 2025 2408639 10.1002/smll.202408639 39538991 133 Stockwell B.R. Ferroptosis turns 10: emerging mechanisms, physiological functions, and therapeutic applications Cell 185 14 2022 2401 2421 35803244 10.1016/j.cell.2022.06.003 PMC9273022 134 Dixon Scott j Lemberg Kathryn m Lamprecht Michael r Ferroptosis: an iron-dependent form of nonapoptotic cell death Cell 149 5 2012 1060 1072 22632970 10.1016/j.cell.2012.03.042 PMC3367386 135 Minotti G. Aust S.D. The role of iron in oxygen radical mediated lipid peroxidation Chem. Biol. Interact. 71 1 1989 1 19 2550151 10.1016/0009-2797(89)90087-2 136 Zuo S. Yu J. Pan H. Novel insights on targeting ferroptosis in cancer therapy Biomark. Res. 8 1 2020 50 33024562 10.1186/s40364-020-00229-w PMC7532638 137 Turcu A.L. Versini A. Khene N. DMT1 inhibitors kill cancer stem cells by blocking lysosomal iron translocation Chemistry 26 33 2020 7369 7373 32083771 10.1002/chem.202000159 138 Fang X. Ardehali H. Min J. The molecular and metabolic landscape of iron and ferroptosis in cardiovascular disease Nat. Rev. Cardiol. 20 1 2023 7 23 35788564 10.1038/s41569-022-00735-4 PMC9252571 139 Ru Q. Li Y. Chen L. Iron homeostasis and ferroptosis in human diseases: mechanisms and therapeutic prospects Signal Transduct. Targeted Ther. 9 1 2024 271 10.1038/s41392-024-01969-z PMC11486532 39396974 140 Dixon S.J. Patel D.N. Welsch M. Pharmacological inhibition of cystine–glutamate exchange induces endoplasmic reticulum stress and ferroptosis eLife 3 2014 e02523 10.7554/eLife.02523 PMC4054777 24844246 141 Li K. Xu K. He Y. Functionalized tumor-targeting nanosheets exhibiting Fe(II) overloading and GSH consumption for ferroptosis activation in liver tumor Small 17 40 2021 2102046 10.1002/smll.202102046 34448349 142 He Z. Guo Y. Chen J. Unsaturated phospholipid modified FeOCl nanosheets for enhancing tumor ferroptosis J. Mater. Chem. B 11 9 2023 1891 1903 36744515 10.1039/d2tb01854c 143 Xiao J. Feng N. Li Q. Mitochondria-specific GPX4 inhibition enhances ferroptosis and antitumor immunity J. Contr. Release 383 2025 113841 10.1016/j.jconrel.2025.113841 40373937 144 Feng W. Shi W. Wang Z. Enhancing tumor therapy of Fe(III)-Shikonin supramolecular nanomedicine via triple ferroptosis amplification ACS Appl. Mater. Interfaces 14 33 2022 37540 37552 35944147 10.1021/acsami.2c11130 145 Yang B. Chen Y. Shi J. Reactive oxygen species (ROS)-based nanomedicine Chem. Rev. 119 8 2019 4881 4985 30973011 10.1021/acs.chemrev.8b00626 146 Chen Q. Ma X. Xie L. Iron-based nanoparticles for MR imaging-guided ferroptosis in combination with photodynamic therapy to enhance cancer treatment Nanoscale 13 9 2021 4855 4870 33624647 10.1039/d0nr08757b 147 Zhao Z. Zhang H. Lam J.W.Y. Aggregation-induced emission: new vistas at the aggregate level Angew. Chem. Int. Ed. 59 25 2020 9888 9907 10.1002/anie.201916729 32048428 148 Yu X. Zhang Y.-C. Yang X. Bonsai-inspired AIE nanohybrid photosensitizer based on vermiculite nanosheets for ferroptosis-assisted oxygen self-sufficient photodynamic cancer therapy Nano Today 44 2022 101477 149 He Z. Zhou H. Zhang Y. Oxygen-boosted biomimetic nanoplatform for synergetic phototherapy/ferroptosis activation and reversal of immune-suppressed tumor microenvironment Biomaterials 290 2022 121832 10.1016/j.biomaterials.2022.121832 36228518 150 Zhou L. Dong C. Ding L. Targeting ferroptosis synergistically sensitizes apoptotic sonodynamic anti-tumor nanotherapy Nano Today 39 2021 101212 151 Shen S. Liu X. Jiang P. Nanoscale micelles loaded with Fe3O4 nanoparticles for deep-tissue penetration and ferroptosis/sonodynamic tumor therapy ACS Appl. Nano Mater. 5 12 2022 17664 17672 152 Xu W. Yang Y. Liu L. Dual-release free iron and breakdown of ferroptosis defenses to achieve ferroptosis Cascade storms for potent antitumor therapy Adv. Funct. Mater. 35 24 2025 2420540 153 Ding B. Zheng P. Jiang F. MnOx nanospikes as nanoadjuvants and immunogenic cell death drugs with enhanced antitumor immunity and antimetastatic effect Angew. Chem. Int. Ed. 59 38 2020 16381 16384 10.1002/anie.202005111 32484598 154 Zhang K. Ma Z. Li S. Disruption of dual homeostasis by a metal-organic framework nanoreactor for ferroptosis-based immunotherapy of tumor Biomaterials 284 2022 121502 10.1016/j.biomaterials.2022.121502 35390708 155 Xie B. Zhao H. Ding Y.-F. Supramolecularly engineered conjugate of bacteria and cell membrane-coated magnetic nanoparticles for enhanced ferroptosis and immunotherapy of tumors Adv. Sci. 10 34 2023 2304407 10.1002/advs.202304407 PMC10700203 37850572 156 Winslow J.W.W. Limesand K.H. Zhao N. The functions of ZIP8, ZIP14, and ZnT10 in the regulation of systemic manganese Homeostasis 21 9 2020 3304 10.3390/ijms21093304 PMC7246657 32392784 157 Peng C. Zhao M. Wang X. Manganese ion gradient liposomes modified by disulfide bond enhance cellular uptake and tumor immunity Mater. Des. 233 2023 112178 158 Taguchi T. Mukai K. Takaya E. STING Operation at the ER/Golgi Interface 2021 12 2021 10.3389/fimmu.2021.646304 PMC8126659 34012437 159 Song Y. Liu Y. Teo H.Y. Manganese enhances the antitumor function of CD8+ T cells by inducing type I interferon production Cell. Mol. Immunol. 18 6 2021 1571 1574 32801367 10.1038/s41423-020-00524-4 PMC8166851 160 Yang G. Ji J. Liu Z. Multifunctional MnO2 nanoparticles for tumor microenvironment modulation and cancer therapy WIREs Nanomed. Nanobiotechnol. 13 6 2021 e1720 10.1002/wnan.1720 33908171 161 Wang D. Nie T. Huang C. Metal-cyclic dinucleotide nanomodulator-stimulated STING signaling for strengthened radioimmunotherapy of large tumor 18 41 2022 2203227 10.1002/smll.202203227 36026551 162 Zhao Z. Ma Z. Wang B. Mn2+ directly activates cGAS and structural analysis suggests Mn2+ induces a noncanonical catalytic synthesis of 2′3′-cGAMP Cell Rep. 32 7 2020 108053 10.1016/j.celrep.2020.108053 32814054 163 Lin L.-S. Song J. Song L. Simultaneous fenton-like ion delivery and glutathione depletion by MnO2-Based nanoagent to enhance chemodynamic therapy 57 18 2018 4902 4906 10.1002/anie.201712027 29488312 164 Zheng S.-J. Yang M. Luo J.-Q. Manganese-based immunostimulatory metal–organic framework activates the cGAS-STING pathway for cancer metalloimmunotherapy ACS Nano 17 16 2023 15905 15917 37565626 10.1021/acsnano.3c03962 165 Zhang J. Pan Y. Liu L. Genetically edited Cascade nanozymes for cancer immunotherapy ACS Nano 18 19 2024 12295 12310 38695532 10.1021/acsnano.4c01229 166 Liu Y, Pi F, He L, et al. Oxygen vacancy-rich manganese nanoflowers as ferroptosis inducers for tumor radiotherapy[J]. Small, n/a(n/a): 2310118. 10.1002/smll.202310118 38506599 167 Huo L. Zhu S. Zeng J. Multivalence manganese mediated dual ROS generator for augmented chemodynamic therapy and activated antitumor immunogenic responses ACS Mater. Lett. 6 3 2024 885 895 168 Xu L. Peng M. Gao T. Nanoenabled intracellular metal ion homeostasis regulation for tumor therapy 11 7 2024 2306203 10.1002/advs.202306203 PMC10870045 38063781 169 Xu W. Suo A. Aldai A.J.M. Hollow calcium/copper bimetallic amplifier for cuproptosis/paraptosis/apoptosis cancer therapy via Cascade reinforcement of endoplasmic reticulum stress and mitochondrial dysfunction ACS Nano 18 43 2024 30053 30068 39412236 10.1021/acsnano.4c11455 170 Liu B. Chen X. Zhu Y. One-step symbiosis of bimetallic peroxides nanoparticles to induce ferroptosis/cuproptosis and activate cGAS-STING pathway for enhanced tumor Immunotherapy 37 21 2025 2500337 [J] 10.1002/adma.202500337 40181655 171 Peng Y. Liang S. Liu D. Multi-metallic nanosheets reshaping immunosuppressive tumor microenvironment through augmenting cGAS-STING innate activation and adaptive immune responses for Cancer Immunother. 11 38 2024 2403347 10.1002/advs.202403347 PMC11481177 39120546 172 Wang T. Zhang F. Guimarães C.F. Zn/Cu bi-single-atom nanoplatform: hexagonal anti-tumor warrior by ROS amplification for DOX resistance reversal and immune activation 34 52 2024 2410962 173 Zhang J. Yang C. Tan J. Bimetallic nanoadjuvant-mediated glutamine metabolism intervention and STING activation for enhanced antitumor immunity Nano Today 65 2025 102866 Data availability Data will be made available on request. Acknowledgement This work was supported by 10.13039/501100004731 Zhejiang Provincial Natural Science Foundation LQN25C100009 10.13039/100007834 Ningbo Natural Science Foundation 2023J395 ",
  "metadata": {
    "Title of this paper": "Bimetallic nanoadjuvant-mediated glutamine metabolism intervention and STING activation for enhanced antitumor immunity",
    "Journal it was published in:": "Materials Today Bio",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481930/"
  }
}