{
  "title": "Paper_331",
  "abstract": "pmc Genome Res Genome Res 102 genores GENOME Genome Research 1088-9051 1549-5469 Cold Spring Harbor Laboratory Press PMC12487822 PMC12487822.1 12487822 12487822 40858362 10.1101/gr.280338.124 1 Research APOBEC3A drives deaminase mutagenesis in human gastric epithelium An et al. APOBEC3A is mutagenic in human cells An Yohan 1 10 Lee Ji-Hyun 2 10 Lim Joonoh 1 3 10 Youk Jeonghwan 1 11 Park Seongyeol 1 12 Park Ji-Hyung 1 4 Yi Kijong 1 3 Kim Taewoo 1 13 Nam Chang Hyun 1 Lee Won Hee 1 14 Oh Soo A 3 Bae Yoo Jin 5 Klompstra Thomas M. 2 Lee Haeun 1 Han Jinju 1 Lee Junehwak 6 Park Jung Woo 6 Kim Jie-Hyun 5 Kim Hyunki 7 Snippert Hugo 8 Koo Bon-Kyoung 2 9 http://orcid.org/0000-0002-5514-4189 Ju Young Seok 1 3 1 2 3 4 5 6 7 8 9 10 These authors contributed equally to this work. Present addresses: 11 12 13 14 Corresponding authors: ysju@kaist.ac.kr koobk@ibs.re.kr 10 2025 35 10 498104 2158 2172 12 12 2024 22 8 2025 01 10 2025 02 10 2025 02 10 2025  © 2025 An et al.; Published by Cold Spring Harbor Laboratory Press 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article, published in Genome Research http://creativecommons.org/licenses/by-nc/4.0/ Cancer genomes frequently carry apolipoprotein B mRNA editing catalytic polypeptide-like (APOBEC)-associated DNA mutations, suggesting APOBEC enzymes as innate mutagens during cancer initiation and evolution. However, the pure mutagenic impacts of the specific enzymes among this family remain unclear in human normal cell lineages. Here, we investigate the comparative mutagenic activities of APOBEC3A and APOBEC3B, through whole-genome sequencing of human normal gastric organoid lines carrying doxycycline-inducible APOBEC expression cassettes. Our findings demonstrate that transcriptional upregulation of APOBEC3A leads to the acquisition of a massive number of genomic mutations in just a few cell cycles. In contrast, despite clear deaminase activity and DNA damage, APOBEC3B upregulation does not generate a significant increase in mutations in the gastric epithelium. APOBEC3B-associated mutagenesis remains minimal even in the context of TP53 Human Frontier Science Program 10.13039/100004412 RGY0071/2018 National Research Foundation of Korea 10.13039/501100003725 NRF-2020R1A3B2078973 Korea Bio Data Station N24NM016-24 Institute for Basic Science 10.13039/501100010446 IBS-R021-D1 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Large-scale cancer genome studies have revealed various mutational processes in human somatic cells ( Alexandrov et al. 2020 Vieira and Soares 2013 Nik-Zainal et al. 2012a b Lawrence et al. 2013 Roberts et al. 2013 Sondka et al. 2024 Lawson et al. 2020 Yoshida et al. 2020 Wang et al. 2023 C https://cancer.sanger.ac.uk/signatures/ APOBEC3A APOBEC3B Roberts et al. 2013 Chan et al. 2015 APOBEC1 Wang et al. 2023 The mutagenic potential of A3A and A3B has been investigated across a range of human cancer cell lines ( Burns et al. 2013 Petljak et al. 2022 Carpenter et al. 2023 Petljak et al. 2019 Mus musculus, Saccharomyces cerevisiae Gallus gallus domesticus Chan et al. 2015 Law et al. 2020 DeWeerd et al. 2022 Durfee et al. 2023 Naumann et al. 2023 Jager et al. 2019 Pleguezuelos-Manzano et al. 2020 Youk et al. 2024 Hoang et al. 2016 Results Gastric organoids with doxycycline-inducible APOBEC We established human gastric organoid lines with doxycycline-inducible expression of either A3A or A3B, referred to as hGO iA3A iA3B CMV-rtTA-Hyg R TRE-APOBEC (A3A or A3B)-IRES-mCherry piggyBac Fig. 1 Woodard and Wilson 2015 Wilson et al. 2007 Supplemental Fig. S1 Supplemental Tables S1 S2 APOBEC Supplemental Fig. S2 Figure 1. Overview of conditional APOBEC (APOBEC3A or APOBEC3B) overexpression models with human gastric organoids. ( A B top iA3A bottom iA3B C iA3A iA3B D left iA3A right iA3B t P P P E F top iA3A bottom iA3B P G left iA3A right iA3B H left iA3A right iA3B Upon doxycycline treatment, mCherry fluorescence as well as APOBEC upregulation were clearly detected within 48 h ( Fig. 1 Fig. 1 Supplemental Fig. S3 APOBEC APOBEC Supplemental Table S3 Single-cell transcriptome data from various cancer types indicated that the range of APOBEC expression levels observed in our models were comparable to those observed during episodic bursts in many cancer types, including lung adenocarcinoma, head-and-neck squamous cell carcinoma, triple-negative breast cancer, esophageal adenocarcinomas, and squamous cell carcinomas ( Supplemental Fig. S4 Puram et al. 2017 Karaayvaz et al. 2018 Wu et al. 2018 Maynard et al. 2020 Following A3A or A3B induction, the viability of the organoid lines was substantially compromised, suggesting a detrimental impact of APOBEC upregulation on cell survival ( Fig. 1 CDKN1A CDC20 CXCL8 CCL20 iA3A iA3B Fig. 1 Amador et al. 2007 Wu et al. 2007 Cazzalini et al. 2010 Matsushima et al. 2022 Fig. 1 Supplemental Fig. S5 Burns et al. 2013 Green et al. 2016 APOBEC3A, not APOBEC3B, induces genomic mutations To assess the mutagenic impacts of A3A and A3B, we investigated acquired mutations in the hGO iA3A iA3B iA3A Fig. 2 Supplemental Tables S4 S5 iA3B Fig. 2 Supplemental Tables S4 S5 Figure 2. Mutational impact of APOBEC-associated single base substitutions in DNA and RNA. ( A left iA3A right iA3B B iA3A TP53 iA3A iA3A TP53 iA3A t P C iA3A D iA3B TP53 iA3B iA3B TP53 iA3B t E iA3B F left iA3A right iA3B G iA3A H iA3A I iA3A J iA3B To minimize potential detection bias in our single-cell cloning system, where proliferative cells are preferentially sequenced, we employed duplex DNA sequencing ( Hoang et al. 2016 Fig. 2 Supplemental Table S6 iA3B Fig. 2 Supplemental Table S6 iA3A Fig. 2 iA3B Despite the absence of fixed mutations in hGO iA3B Fig. 3 Fig. 3 iA3B Supplemental Fig. S6A,B Abascal et al. 2021 iA3B Fig. 1 Supplemental Fig. S5 Figure 3. Deamination activity of APOBEC3B in vitro. ( A iA3A iA3B B C To further investigate whether inactivation of tumor suppressor genes accelerates APOBEC-associated mutagenesis, we generated the hGO iA3A iA3B TP53 TP53 iA3A TP53 iA3B Fig. 1 TP53 iA3A iA3A Fig. 2 Supplemental Table S5 TP53 iA3B iA3B Fig. 2 Supplemental Table S5 Despite the increased γ-H2AX foci following A3A or A3B overexpression ( Fig. 1 Supplemental Fig. S5 Supplemental Table S5 TP53 iA3A TP53 iA3B Both APOBEC3A and APOBEC3B induce C > U RNA editing Despite their contrasting mutagenic impact on DNA, both enzymes exhibited C > U RNA editing events. In RNA sequencing normalized to a total base count of 3.1Gb, both the hGO iA3A iA3B Fig. 2 Supplemental Fig. S7A Supplemental Table S7 The spectra of C > U RNA editing deviated from SBS2 associated with DNA mutations and also varied between A3A and A3B ( Fig. 2 C C C C C C Further de novo decomposition of RNA editing spectra revealed three RNA editing signatures, referred to as RNA-SBS A B C Supplemental Fig. S8A,B A Martínez-Ruiz et al. 2023 Fixman et al. 2024 B Mus musculus Alonso de la Vega et al. 2023 C C C C Supplemental Fig. S9 The C > U RNA editing sites were frequently recurrent, particularly among the sites identified in the low doxycycline concentration ( Supplemental Fig. S7B Supplemental Fig. S7C–E Supplemental Table S8 iA3A iA3B Supplemental Fig. S7D,F A3A-associated RNA editing hotspots were enriched in specific sites in the secondary stem-loop structure of RNAs, including the 3rd, 4th, and 4th positions of the 3-bp, 4-bp, and 5-bp RNA-loop structures, respectively, as reported previously ( Supplemental Fig. S7G Jalili et al. 2020 Supplemental Fig. S7G Supplemental Fig. S7G Kim et al. 2023 Characteristics of APOBEC-associated mutations Using the pure A3A-mediated mutational profiles from hGO iA3A Supplemental Fig. S10A–C C C C Fig. 4 C Saccharomyces cerevisiae Chan et al. 2015 Sanchez et al. 2024 C C C Figure 4. Characteristics of A3A-associated mutational signatures. ( A C C iA3A iA3A B iA3A C iA3A TP53 iA3A D POLH A3A iA3A TP53 iA3A Further, in line with previous reports from cancer ( DeWeerd et al. 2022 Sondka et al. 2024 iA3A P Fig. 4 Fig. 4 iA3A TP53 Fig. 4 Kim et al. 2016 POLH Choi and Pfeifer 2005 Delbos et al. 2005 Fig. 4 Supplemental Fig. S11 REV1 Petljak et al. 2022 Clusters of APOBEC-associated mutations In cancer genomes, APOBEC-induced localized hypermutation events are frequently observed ( Nik-Zainal et al. 2012a The ICGC/TCGA Pan-Cancer Analysis of Whole Genomes Consortium 2020 iA3A TP53 iA3A Fig. 5 omikli kataegis Bergstrom et al. 2022b omikli kataegis kataegis kataegis kataegis Nik-Zainal et al. 2012a The ICGC/TCGA Pan-Cancer Analysis of Whole Genomes Consortium 2020 Bergstrom et al. 2022b kataegis kataegis Maciejowski et al. 2020 Bergstrom et al. 2022b Figure 5. Landscape of APOBEC3A-associated clustered mutation. ( A B omikli kataegis C C C T kataegis D C kataegis E kataegis F omikli kataegis G kataegis H C kataegis The relative frequencies of omikli kataegis Fig. 5 Supplemental Table S9 TP53 omikli kataegis omikli kataegis Fig. 5 Supplemental Table S9 Within kataegis C C Fig. 5 2 P C kataegis C Fig. 5 C kataegis C C Of the 615 omikli kataegis kataegis ) omikli kataegis Fig. 5 kataegis Fig. 5 C Fig. 5 C kataegis Fig. 5 Fig. 5 Epigenetic contexts associated with A3A-associated mutations Mutational processes are often influenced by the epigenetic contexts of the genome ( Otlu et al. 2023 Fig. 6 Supplemental Table S10 Figure 6. Genomic and epigenomic distribution of APOBEC3A-associated mutations. ( A B C 2 P D E 2 P F iA3A left TP53 iA3A right For the replication timing, the latest-replicating regions showed a 1.26-fold higher rate of A3A-associated mutation compared to the earliest-replicating regions ( Fig. 6 Kazanov et al. 2015 Amouroux et al. 2010 Rhind and Gilbert 2013 Fig. 6 Wu et al. 2020 Hoopes et al. 2016 Fig. 6 Nordentoft et al. 2014 Kazanov et al. 2015 Okazaki et al. 1968 Gnatt et al. 2001 Fig. 6 Saini et al. 2017 Compared with noncoding sequences, protein-coding sequences showed much lower mutation rates, at 0.79-fold the genome average, suggesting a selective pressure against mutations that could alter amino acid-changing mutations ( Fig. 6 TP53 iA3A TP53 Discussion Our study clearly demonstrated the qualitative and quantitative mutational impact of A3A and A3B in human non-neoplastic cells using a gastric organoid culture system. Previous studies have highlighted the mutagenic potential of A3B in various model systems ( Chan et al. 2015 Carpenter et al. 2023 Durfee et al. 2023 Dananberg et al. 2024 Petljak et al. 2022 The gastric organoid model offered distinct advantages based on three key criteria: (1) biological relevance, supported by the frequent occurrence of APOBEC-associated mutations in gastric cancers; (2) experimental feasibility, owing to its robust proliferative capacity under culture conditions; and (3) the availability of standardized protocols for genetic manipulation ( Fujii et al. 2015 Gaebler et al. 2020 When A3A was induced by 3 µg/mL of doxycycline in hGO iA3A Petljak et al. 2019 Supplemental Fig. S12 Giobbe et al. 2021 Our models also indicated increased mutational burdens of SBS5 and SBS40 proportional to the overall burden of A3A-associated mutations, suggesting that base substitutions attributable to other than SBS2 and SBS13 can also be indirectly promoted in APOBEC upregulation. These signatures were significantly enriched in late-replicating regions and correlated with multiple epigenomic features, including replication timing and transcriptional activity, in line with previous reports ( Supplemental Fig. S13A,B Sondka et al. 2024 Although this study successfully evaluated the mutagenic activity of A3A and A3B in human normal cells, several technical limitations warrant consideration. First, the study was primarily conducted using gastric epithelial cells, and we cannot exclude the possibility that A3B may exhibit substantial mutagenic activity in other cell types. Second, the endogenous copies of A3A and A3B were not inactivated in the hGO iA3A iA3B Carpenter et al. 2023 Park et al. 2021 Supplemental Fig. S14 Methods Material availability Organoids established in this study will be available under a material transfer agreement. To do so, please contact the lead author ( ysju@kaist.ac.kr Human normal gastric samples Normal gastric tissues were obtained via endoscopic biopsy from a female undergoing routine screening. The protocol for this study was approved by the Institutional Review Board of Yonsei University Gangnam Severance Hospital (3-2018-0207) and KAIST (KH2022-211). Human stomach organoid culture Organoid culture methods and media compositions were adopted from previous research with slight modifications ( Bartfeld et al. 2015 Mihara et al. 2016 Tissues were incubated in TrypLE (Gibco, #12604013) at 37°C for 30 min, then dissociated into clusters of 10–15 cells by pipetting. After washing with PBS twice and centrifugation at 300 g 2 Supplemental Methods Supplemental Table S11 Preparation of vectors for transfection Two vectors were purchased: (1) CMV-rtTA-Hyg R Cas9 TP53 pPB-CMVmin-APOBEC (A3A or A3B)-IRES-mCherry NM_145699.4 NM_004900.4 pPB-TRE-CMVmin-IRES-mCherry Supplemental Methods Lee et al. 2022 Transfection of organoids Transfection methods were adopted from previously reported protocols ( Fujii et al. 2015 Gaebler et al. 2020 pPB-TRE-APOBEC (A3A or A3B)-IRES-mCherry pPB-CMV-rtTA-Hyg R piggyBac Supplemental Methods Supplemental Table S12 Fujii et al. 2015 Youk et al. 2021 Doxycycline treatment A doxycycline (Sigma-Aldrich, #D9891-1G) stock solution was prepared by dissolving doxycycline in DMSO. Prior to treatment, dissociated 10k viable cells were seeded in 24-well plates. After 7 days, doxycycline solution was added to the medium, and the organoids were incubated with doxycycline. Capturing fluorescent images mCherry fluorescence following doxycycline treatment was visualized using a fluorescence microscope (LEICA, DMi8). Fluorescent images were captured using Las X programs, and brightness/contrast adjustments were applied using the same program. Preparation of cell lysates Organoids treated with 3 µg/mL doxycycline were harvested using Cell Recovery solution (Corning), followed by one wash with PBS. The isolated cell pellets by centrifugation were resuspended in lysis buffer containing 25 mM HEPES (pH 7.9), 10% glycerol, 150 mM NaCl, 0.5% Triton X-100, 1 mM EDTA, 1 mM MgCl 2 2 Q33211 Western blotting Lysates were prepared by mixing samples 1:1 with Laemmli Sample Buffer (Bio-Rad, #161-0737), followed by denaturation at 95°C for 5 min. Proteins were separated by SDS-PAGE on a Mini-PROTEAN TGX pre-cast 12% gel (Bio-Rad, #4561044) in SDS running buffer (Higene, #PB151-10h) and transferred to an Immobilon PVDF membrane (Millipore, #IPFL00010) via overnight wet transfer in Tris/Glycine buffer (Bio-Rad, #1610771). Primary antibodies included anti-HA.11 Epitope Tag Antibody (1:5000; BioLegend, #951514) and anti-α-Antin-1 (1:1000; Sigma-Aldrich, #A2066). HRP-conjugated secondary antibodies were used at 1:2000 dilution: goat anti-mouse IgG-HRP for anti-HA (Santa Cruz, #sc-2005) and goat anti-rabbit IgG-HRP for anti-actin (Santa Cruz, #sc-2004) (see Supplemental Methods Whole transcriptome sequencing library construction RNA was isolated during DNA extraction for BotSeqS libraries with AllPrep DNA/RNA Mini kit (QIAGEN, #80204), following the manufacturer's instructions. Libraries were constructed with the NEBNext Ultra II Directional DNA Library Prep kit for Illumina (NEB, #E7760) and the QIAseq FastSelect -rRNA HMR kit (QIAGEN, #334388), according to the manufacturer's instructions. Libraries were sequenced on the NovaSeq 6000 with paired-end sequencing. Calculating RNA expression levels Bulk RNA-seq reads were aligned to GRCh37 using STAR2 v2.6.1d ( Dobin et al. 2013 Li and Dewey 2011 Love et al. 2014 Calculation of the ratio between endogenous APOBEC mRNA and overexpressed APOBEC mRNA Sequence differences between the endogenous and overexpressed mRNA were utilized for counting (see Supplemental Methods Analysis of APOBEC3A APOBEC3B Publicly available single-cell RNA-seq data sets, generated with a Smart-seq library, from lung adenocarcinoma, triple negative breast cancer, esophageal adenocarcinoma, and esophageal squamous cell carcinoma were analyzed using the same pipeline applied to our bulk RNA-seq data. Epithelial cell populations were first identified following the tutorial workflow of the Seurat R package ( Satija et al. 2015 https://infercnvpy.readthedocs.io/en/latest/index.html Viability assay of organoids Organoid viability was assessed using the Celltiter-Glo 3D Assay kit (Promega, #G9681), following the manufacturer's instructions (see Supplemental Methods Immunostaining and imaging of organoids Whole-mount staining of human gastric organoids was performed as previously described ( van Ineveld et al. 2020 Standard whole-genome sequencing alignment According to the manufacturer's protocol, DNA from clonal organoids was extracted using a DNeasy Blood & Tissue kit (QIAGEN, #69506), and libraries were constructed with TruSeq DNA PCR-Free Library Prep kits (Illumina, #20015963). Whole-genome sequencing was performed on the NovaSeq 6000 with a mean 30× depth of coverage. Adapter sequences in the FASTAQ files were removed by cutadapt software ( Martin 2011 Li and Durbin 2010 Li et al. 2009 McKenna et al. 2010 McKenna et al. 2010 https://felixkrueger.github.io/Bismark/ BotSeqS library construction Libraries constructed with TruSeq DNA PCR-Free Library Prep Kit (Illumina) were utilized for the BotSeqS libraries construction. The construction of BotSeqS libraries was based on the previous literature with slight modifications ( Hoang et al. 2016 Forward: 5′-AATGATACGGCGACCACCGAG*A-3′ Reverse: 5′-CAAGCAGAAGACGGCATACGA*G-3′ PCR was performed for 20 cycles, following the protocol of the KAPA Library Amplification kit (Roche). Libraries were sequenced as paired-end sequencing (2 × 151 bps) on the NovaSeq 6000. Calling copy number variations Copy number variations were accessed by Sequenza ( Favero et al. 2015 Confirming non-neoplasticity in primary human gastric organoid Germline variant calling was performed using the germline mutation calling mode in GATK v4.0.12.0 ( McKenna et al. 2010 Li et al. 2009 Supplemental Fig. S15 Detection of somatic mutations To detect single nucleotide variants and indels in clonal organoids, GATK Mutect2 v4.1.9 ( McKenna et al. 2010 Kim et al. 2018 iA3A TP53 iA3A iA3B TP53 iA3B Supplemental Methods For BotSeqS, VarScan2 v2.3.9 ( Koboldt et al. 2012 Supplemental Methods Supplemental Fig. S6A,B Calculation of mutation rate in BotSeqS Unlike standard WGS, the effective covered region was calculated for each BAM file. First, each read was evaluated using in-house scripts that considered DNA strand orientation and applied the following criteria to isolate effective DNA fragments: (1) median mapping quality >20; and (2) total depth of each type of reads ≥3. Only regions where both F1R2 and F2R1 reads were aligned were included in the covered region calculation. To account for the exclusion of mutations located within 100 bp of the extreme of read-ends during variant filtering (considering the reference genome strand), the total length of the covered region was adjusted by multiplying it by [(151 × 2–110)/(151 × 2)]. Mutation rates were calculated by dividing the number of observed mutations by this adjusted covered length. To normalize mutational burdens to the standard genome length, mutation rates were then multiplied by dividing the number of observed mutations by this adjusted covered length. To normalize mutational burdens to the standard genome length, mutation rates were then multiplied by the total genome length excluding repeat regions (3,041,373,115 bp) and further doubled. Analysis of mutational signatures Mutational signature analysis of single base substitutions (SBSs) and small indels were carried out using the nonnegative least squares method. The mutational signature was represented by 96 patterns of SBSs and 83 patterns of small indels ( Alexandrov et al. 2020 Sondka et al. 2024 Calling RNA editings VarScan2 was utilized to identify RNA editing. WGS of first single-cell cloned lines served as the paired normal reference. RNA editings were filtered with in-house Python script with the pysam module (see Supplemental Methods Analysis of RNA editing signatures RNA editing signatures were obtained by a modified version of the mutational signature extraction method described in previous studies ( Alexandrov et al. 2013 Youk et al. 2024 Supplemental Methods Cichocki et al. 2006 Roux et al. 2015 iA3A iA3B Analysis of secondary structure of RNA editing sites The secondary structures of RNA editing sites were predicted as described previously ( Jalili et al. 2020 Calling structural variations Structural variations were identified using DELLY v0.7.6 ( Rausch et al. 2012 Lee et al. 2019 Robinson et al. 2011 DNA deaminase activity assay The cytosine deaminase activity assay against DNA was conducted based on the previous literature with slight modifications ( Buisson et al. 2019 Sanchez and Buisson 2025 The reaction mixture was incubated at 37°C for 40 min, followed by the addition of 0.5 µL of 10 N In vitro deamination of DNA with recombinant APOBEC3B The NEBNext Enzymatic Methyl-seq (EM-seq) kit (NEB, #E7120S) was utilized, following the manufacturer's protocol, for DNA library construction with slight modifications. Ten picograms of input DNA were utilized for the library construction. For the deamination steps, recombinant APOBEC3B, synthesized by EUPROTEIN INC., was used. The deamination step with APOBEC enzymes were conducted for 30 and 60 sec. Library amplification steps followed the BotSeqS library construction. Detection of cytosine deamination by recombinant APOBEC3B in vitro The BotSeqS variant calling pipeline was utilized with slight modifications. Among the criteria, the distances from read ends were excluded. Initially, all filtered mutations were collected. Among mutations in grouped DNA, only those located in DNA fragments where only one strand was mapped were counted. To calculate the genome-wide mutation rates, the BotSeqS pipeline was utilized, with the exception that cytosines or guanines were counted in a strand-specific manner. Because original methylated CpG sites were preserved during the library construction, both total base counts and mutation counts in CpG contexts were excluded from the analysis. To calculate mutation rates in DNA fragments containing at least one C > T variant, the genomic ranges of such fragments were identified using BEDTools ( Quinlan and Hall 2010 Analysis of 4-bp context mutations SNVs from 10 hGO iA3A TP53 iA3B Calling clustered mutations SigProfilerClusters ( Bergstrom et al. 2022a Leisch 2004 omikli kataegis Supplemental Methods Supplemental Fig. S16 Ritz et al. 2019 Analysis of mutation rates based on epigenetic marker Relative risk of mutation rates between signal and nonsignal regions was analyzed for each epigenetic marker, based on previous studies ( Supek and Lehner 2017 Nam et al. 2023 For APOBEC-associated mutations, cytosines in the T C C For replication timing and H3K27me3, signal-detected regions were further divided into four equal-length bins to assess fold-enrichment. For transcriptional activity, TPM values in each base were derived from RNA-seq of doxycycline-treated organoids (3 µg/mL, 48 h). Using the “hg19_refGene.txt” file from ANNOVAR ( Wang et al. 2010 Venables and Ripley 2003 Supek and Lehner 2017 Analysis of mutation rates based on genomic location SNVs located in previously described mappable regions were utilized throughout the analysis. Gene annotations from the “hg19_refGene.txt” file were utilized to match the additional information of position of SNVs. Classification of subgenic regions (5′-/3′-UTR, protein coding sequence [CDS], and intron) and transcription strand orientation was also based on this gene information. All merged genic regions were used as reference for discrimination of genic and intergenic regions. For subgenic mutation rate comparisons, only non-overlapping genic regions and CDS regions flanked by introns were used, following a previously reported approach ( Frigola et al. 2017 Comparison of single nucleotide variants (SNVs) between reference genome versions SNVs were additionally identified using human GRCh38 genome sequence. Coordinates of SNVs based on GRCh37 were converted to GRCh38 using BCFtools/liftover for comparative analysis ( Supplemental Fig. S14 Genovese et al. 2024 Publicly available data sets Publicly available whole-genome sequencing data were utilized to demonstrate copy number variation in the normal human gastric organoid. WGS of blood from HC05 sample was utilized as the unpaired normal sample (obtained from the European Genome-phenome Archive [EGA; https://ega-archive.org Nam et al. 2023 https://docs.icgc-argo.org/docs/data-access/icgc-25k-data#relocated-icgc-25k-data We analyzed publicly available Smart-seq-based single-cell RNA-seq data sets from five cancer types: (1) lung adenocarcinoma (obtained from the NCBI BioProject database [ https://www.ncbi.nlm.nih.gov/bioproject/ Maynard et al. 2020 https://www.ncbi.nlm.nih.gov/geo/ GSE103322 Puram et al. 2017 GSE118390 Karaayvaz et al. 2018 Wu et al. 2018 In addition, we analyzed publicly available whole transcriptomic sequencing data of SARS-CoV-2-infected human gastric organoid (BioProject: PRJNA643724; GEO: GSE153698 Giobbe et al. 2021 Quantification and statistical analysis All statistical analyses were performed with R version 4.1.3 ( https://www.npackd.org/p/r/4.1.3 t P 2 P Data access All raw and processed sequencing data generated in this study have been submitted to the Korean Nucleotide Archive (KoNA; https://kbds.re.kr/KRA https://doi.org/10.5281/zenodo.12771074 Supplemental Code Supplemental Material Supplement 1 Supplement 2 Supplement 3 Supplement 4 Supplement 5 Supplement 6 Supplement 7 Supplement 8 Supplement 9 Supplement 10 Supplement 11 Supplement 12 Supplement 13 Supplement 14 Acknowledgments The authors thank Youngwon Cho (Epithelial Biology Center, Vanderbilt University Medical Center) for help with the cell viability test, Myungsuk Choi (KAIST) for technical help for organoids, and Mia Petljak (New York University) for her valuable advice and feedback on the manuscript. This work was supported by the Young Investigator Grants from the Human Frontier Science Program (RGY0071/2018 to Y.S.J., B.-K.K., and H.S.); the National Research Foundation of Korea (Leading Researcher Program NRF-2020R1A3B2078973 to Y.S.J.); the Korea Bio Data Station (N24NM016-24 to J.L. and J.W.P.); and the Institute for Basic Science (IBS-R021-D1 to B.-K.K.). Author contributions [Supplemental material is available for this article.] Article published online before print. Article, supplemental material, and publication date are at https://www.genome.org/cgi/doi/10.1101/gr.280338.124 Freely available online through the Genome Research Competing interest statement Y.S.J. is a genomic cofounder of Inocras Inc. All other authors declare no competing interests. References Abascal F Harvey LMR Mitchell E Lawson ARJ Lensing SV Ellis P Russell AJC Alcantara RE Baez-Ortega A Wang Y 2021 Somatic mutation landscapes at single-molecule resolution Nature 593 405 410 10.1038/s41586-021-03477-4 33911282 Alexandrov LB Nik-Zainal S Wedge DC Campbell PJ Stratton MR 2013 Deciphering signatures of mutational processes operative in human cancer Cell Rep 3 246 259 10.1016/j.celrep.2012.12.008 23318258 PMC3588146 Alexandrov LB Kim J Haradhvala NJ Huang MN Tian Ng AW Wu Y Boot A Covington KR Gordenin DA Bergstrom EN 2020 The repertoire of mutational signatures in human cancer Nature 578 94 101 10.1038/s41586-020-1943-3 32025018 PMC7054213 Alonso de la Vega A Temiz NA Tasakis R Somogyi K Salgueiro L Zimmer E Ramos M Diaz-Jimenez A Chocarro S Fernández-Vaquero M 2023 Acute expression of human APOBEC3B in mice results in RNA editing and lethality Genome Biol 24 267 10.1186/s13059-023-03115-4 38001542 PMC10668425 Amador V Ge S Santamaría PG Guardavaccaro D Pagano M 2007 APC/c(Cdc20) controls the ubiquitin-mediated degradation of p21 in prometaphase Mol Cell 27 462 473 10.1016/j.molcel.2007.06.013 17679094 PMC2000825 Amouroux R Campalans A Epe B Radicella JP 2010 Oxidative stress triggers the preferential assembly of base excision repair complexes on open chromatin regions Nucleic Acids Res 38 2878 2890 10.1093/nar/gkp1247 20071746 PMC2875005 Bartfeld S Bayram T van de Wetering M Huch M Begthel H Kujala P Vries R Peters PJ Clevers H 2015 In vitro expansion of human gastric epithelial stem cells and their responses to bacterial infection Gastroenterology 148 126 136.e6 10.1053/j.gastro.2014.09.042 25307862 PMC4274199 Bergstrom EN Kundu M Tbeileh N Alexandrov LB 2022a Examining clustered somatic mutations with SigProfilerClusters Bioinformatics 38 3470 3473 10.1093/bioinformatics/btac335 35595234 PMC9237733 Bergstrom EN Luebeck J Petljak M Khandekar A Barnes M Zhang T Steele CD Pillay N Landi MT Bafna V 2022b Mapping clustered mutations in cancer reveals APOBEC3 mutagenesis of ecDNA Nature 602 510 517 10.1038/s41586-022-04398-6 35140399 PMC8850194 Buisson R Langenbucher A Bowen D Kwan EE Benes CH Zou L Lawrence MS 2019 Passenger hotspot mutations in cancer driven by APOBEC3A and mesoscale genomic features Science 364 eaaw2872 10.1126/science.aaw2872 31249028 PMC6731024 Burns MB Lackey L Carpenter MA Rathore A Land AM Leonard B Refsland EW Kotandeniya D Tretyakova N Nikas JB 2013 APOBEC3B is an enzymatic source of mutation in breast cancer Nature 494 366 370 10.1038/nature11881 23389445 PMC3907282 Carpenter MA Temiz NA Ibrahim MA Jarvis MC Brown MR Argyris PP Brown WL Starrett GJ Yee D Harris RS 2023 Mutational impact of APOBEC3A and APOBEC3B in a human cell line and comparisons to breast cancer PLoS Genet 19 e1011043 10.1371/journal.pgen.1011043 38033156 PMC10715669 Cazzalini O Scovassi AI Savio M Stivala LA Prosperi E 2010 Multiple roles of the cell cycle inhibitor p21 CDKN1A Mutat Res 704 12 20 10.1016/j.mrrev.2010.01.009 20096807 Chan K Roberts SA Klimczak LJ Sterling JF Saini N Malc EP Kim J Kwiatkowski DJ Fargo DC Mieczkowski PA 2015 An APOBEC3A hypermutation signature is distinguishable from the signature of background mutagenesis by APOBEC3B in human cancers Nat Genet 47 1067 1072 10.1038/ng.3378 26258849 PMC4594173 Choi J-H Pfeifer GP 2005 The role of DNA polymerase eta in UV mutational spectra DNA Repair (Amst) 4 211 220 10.1016/j.dnarep.2004.09.006 15590329 Cichocki A Zdunek R Amari S 2006 New algorithms for non-negative matrix factorization in applications to blind source separation 2006 IEEE International Conference on Acoustics Speed and Signal Processing Proceedings Toulouse, France V V 10.1109/ICASSP.2006.1661352 Dananberg A Striepen J Rozowsky JS Petljak M 2024 APOBEC mutagenesis in cancer development and susceptibility Cancers (Basel) 16 374 10.3390/cancers16020374 38254863 PMC10814203 Delbos F De Smet A Faili A Aoufouchi S Weill J-C Reynaud C-A 2005 Contribution of DNA polymerase eta to immunoglobulin gene hypermutation in the mouse J Exp Med 201 1191 1196 10.1084/jem.20050292 15824086 PMC2213152 DeWeerd RA Németh E Póti Á Petryk N Chen C-L Hyrien O Szüts D Green AM 2022 Prospectively defined patterns of APOBEC3A mutagenesis are prevalent in human cancers Cell Rep 38 110555 10.1016/j.celrep.2022.110555 35320711 PMC9283007 Dobin A Davis CA Schlesinger F Drenkow J Zaleski C Jha S Batut P Chaisson M Gingeras TR 2013 STAR: ultrafast universal RNA-seq aligner Bioinformatics 29 15 21 10.1093/bioinformatics/bts635 23104886 PMC3530905 Durfee C Temiz NA Levin-Klein R Argyris PP Alsøe L Carracedo S Alonso de la Vega A Proehl J Holzhauer AM Seeman ZJ 2023 Human APOBEC3B promotes tumor development in vivo including signature mutations and metastases Cell Rep Med 4 101211 10.1016/j.xcrm.2023.101211 37797615 PMC10591044 Favero F Joshi T Marquard AM Birkbak NJ Krzystanek M Li Q Szallasi Z Eklund AC 2015 Sequenza: allele-specific copy number and mutation profiles from tumor sequencing data Ann Oncol 26 64 70 10.1093/annonc/mdu479 25319062 PMC4269342 Fixman B Díaz-Gay M Qiu C Margaryan T Lee B Chen XS 2024 Validation of the APOBEC3A-mediated RNA single base substitution signature and proposal of novel APOBEC1, APOBEC3B, and APOBEC3G RNA signatures J Mol Biol 436 168854 10.1016/j.jmb.2024.168854 39510348 PMC11637894 Frigola J Sabarinathan R Mularoni L Muiños F Gonzalez-Perez A López-Bigas N 2017 Reduced mutation rate in exons due to differential mismatch repair Nat Genet 49 1684 1692 10.1038/ng.3991 29106418 PMC5712219 Fujii M Matano M Nanki K Sato T 2015 Efficient genetic engineering of human intestinal organoids using electroporation Nat Protoc 10 1474 1485 10.1038/nprot.2015.088 26334867 Gaebler A-M Hennig A Buczolich K Weitz J Welsch T Stange DE Pape K 2020 Universal and efficient electroporation protocol for genetic engineering of gastrointestinal organoids J Vis Exp 156 60704 10.3791/60704 32150173 Genovese G Rockweiler NB Gorman BR Bigdeli TB Pato MT Pato CN Ichihara K McCarroll SA 2024 BCFtools/liftover: an accurate and comprehensive tool to convert genetic variants across genome assemblies Bioinformatics 40 btae038 10.1093/bioinformatics/btae038 38261650 PMC10832354 Giobbe GG Bonfante F Jones BC Gagliano O Luni C Zambaiti E Perin S Laterza C Busslinger G Stuart H 2021 SARS-CoV-2 infection and replication in human gastric organoids Nat Commun 12 6610 10.1038/s41467-021-26762-2 34785679 PMC8595698 Gnatt AL Cramer P Fu J Bushnell DA Kornberg RD 2001 Structural basis of transcription: an RNA polymerase II elongation complex at 3.3 Å resolution Science 292 1876 1882 10.1126/science.1059495 11313499 Green AM Landry S Budagyan K Avgousti DC Shalhout S Bhagwat AS Weitzman MD 2016 APOBEC3A damages the cellular genome during DNA replication Cell Cycle 15 998 1008 10.1080/15384101.2016.1152426 26918916 PMC4889253 Hoang ML Kinde I Tomasetti C McMahon KW Rosenquist TA Grollman AP Kinzler KW Vogelstein B Papadopoulos N 2016 Genome-wide quantification of rare somatic mutations in normal human tissues using massively parallel sequencing Proc Natl Acad Sci 113 9846 9851 10.1073/pnas.1607794113 27528664 PMC5024639 Hoopes JI Cortez LM Mertz TM Malc EP Mieczkowski PA Roberts SA 2016 APOBEC3A and APOBEC3B preferentially deaminate the lagging strand template during DNA replication Cell Rep 14 1273 1282 10.1016/j.celrep.2016.01.021 26832400 PMC4758883 The ICGC/TCGA Pan-Cancer Analysis of Whole Genomes Consortium 2020 Pan-cancer analysis of whole genomes Nature 578 82 93 10.1038/s41586-020-1969-6 32025007 PMC7025898 Jager M Blokzijl F Kuijk E Bertl J Vougioukalaki M Janssen R Besselink N Boymans S de Ligt J Pedersen JS 2019 Deficiency of nucleotide excision repair is associated with mutational signature observed in cancer Genome Res 29 1067 1077 10.1101/gr.246223.118 31221724 PMC6633256 Jalili P Bowen D Langenbucher A Park S Aguirre K Corcoran RB Fleischman AG Lawrence MS Zou L Buisson R 2020 Quantification of ongoing APOBEC3A activity in tumor cells by monitoring RNA editing at hotspots Nat Commun 11 2971 10.1038/s41467-020-16802-8 32532990 PMC7293259 Karaayvaz M Cristea S Gillespie SM Patel AP Mylvaganam R Luo CC Specht MC Bernstein BE Michor F Ellisen LW 2018 Unravelling subclonal heterogeneity and aggressive disease states in TNBC through single-cell RNA-seq Nat Commun 9 3588 10.1038/s41467-018-06052-0 30181541 PMC6123496 Kazanov MD Roberts SA Polak P Stamatoyannopoulos J Klimczak LJ Gordenin DA Sunyaev SR 2015 APOBEC-induced cancer mutations are uniquely enriched in early-replicating, gene-dense, and active chromatin regions Cell Rep 13 1103 1109 10.1016/j.celrep.2015.09.077 26527001 PMC4644490 Kim J Mouw KW Polak P Braunstein LZ Kamburov A Kwiatkowski DJ Rosenberg JE Van Allen EM D'Andrea A Getz G 2016 Somatic ERCC2 mutations are associated with a distinct genomic signature in urothelial tumors Nat Genet 48 600 606 10.1038/ng.3557 27111033 PMC4936490 Kim S Scheffler K Halpern AL Bekritsky MA Noh E Källberg M Chen X Kim Y Beyter D Krusche P 2018 Strelka2: fast and accurate calling of germline and somatic variants Nat Methods 15 591 594 10.1038/s41592-018-0051-x 30013048 Kim K Shi AB Kelley K Chen XS 2023 Unraveling the enzyme-substrate properties for APOBEC3A-mediated RNA editing J Mol Biol 435 168198 10.1016/j.jmb.2023.168198 37442413 PMC10528890 Koboldt DC Zhang Q Larson DE Shen D McLellan MD Lin L Miller CA Mardis ER Ding L Wilson RK 2012 VarScan 2: somatic mutation and copy number alteration discovery in cancer by exome sequencing Genome Res 22 568 576 10.1101/gr.129684.111 22300766 PMC3290792 Law EK Levin-Klein R Jarvis MC Kim H Argyris PP Carpenter MA Starrett GJ Temiz NA Larson LK Durfee C 2020 APOBEC3A catalyzes mutation and drives carcinogenesis in vivo J Exp Med 217 e20200261 10.1084/jem.20200261 32870257 PMC7953736 Lawrence MS Stojanov P Polak P Kryukov GV Cibulskis K Sivachenko A Carter SL Stewart C Mermel CH Roberts SA 2013 Mutational heterogeneity in cancer and the search for new cancer-associated genes Nature 499 214 218 10.1038/nature12213 23770567 PMC3919509 Lawson ARJ Abascal F Coorens THH Hooks Y O'Neill L Latimer C Raine K Sanders MA Warren AY Mahbubani KTA 2020 Extensive heterogeneity in somatic mutation and selection in the human bladder Science 370 75 82 10.1126/science.aba8347 33004514 Lee JJ-K Park S Park H Kim S Lee J Lee J Youk J Yi K An Y Park IK 2019 Tracing oncogene rearrangements in the mutational history of lung adenocarcinoma Cell 177 1842 1857.e21 10.1016/j.cell.2019.05.013 31155235 Lee J-H Kim S Han S Min J Caldwell B Bamford A-D Rocha ASB Park J Lee S Wu S-HS 2022 p57 Kip2 Cell Stem Cell 29 826 839.e9 10.1016/j.stem.2022.04.001 35523142 PMC9097776 Leisch F 2004 FlexMix: a general framework for finite mixture models and latent class regression in R J Stat Softw 11 1 18 10.18637/jss.v011.i08 Li H Durbin R 2010 Fast and accurate long-read alignment with Burrows–Wheeler transform Bioinformatics 26 589 595 10.1093/bioinformatics/btp698 20080505 PMC2828108 Li B Dewey CN 2011 RSEM: accurate transcript quantification from RNA-seq data with or without a reference genome BMC Bioinformatics 12 323 10.1186/1471-2105-12-323 21816040 PMC3163565 Li H Handsaker B Wysoker A Fennell T Ruan J Homer N Marth G Abecasis G Durbin R 1000 Genome Project Data Processing Subgroup 2009 The Sequence Alignment/Map format and SAMtools Bioinformatics 25 2078 2079 10.1093/bioinformatics/btp352 19505943 PMC2723002 Love MI Huber W Anders S 2014 Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol 15 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 Maciejowski J Chatzipli A Dananberg A Chu K Toufektchan E Klimczak LJ Gordenin DA Campbell PJ de Lange T 2020 APOBEC3-dependent kataegis and TREX1-driven chromothripsis during telomere crisis Nat Genet 52 884 890 10.1038/s41588-020-0667-5 32719516 PMC7484228 Martin M 2011 Cutadapt removes adapter sequences from high-throughput sequencing reads EMBnetjournal 17 10 12 10.14806/ej.17.1.200 Martínez-Ruiz C Black JRM Puttick C Hill MS Demeulemeester J Larose Cadieux E Thol K Jones TP Veeriah S Naceur-Lombardelli C 2023 Genomic-transcriptomic evolution in lung cancer and metastasis Nature 616 543 552 10.1038/s41586-023-05706-4 37046093 PMC10115639 Matsushima K Yang D Oppenheim JJ 2022 Interleukin-8: an evolving chemokine Cytokine 153 155828 10.1016/j.cyto.2022.155828 35247648 Maynard A McCoach CE Rotow JK Harris L Haderk F Kerr DL Yu EA Schenk EL Tan W Zee A 2020 Therapy-induced evolution of human lung cancer revealed by single-cell RNA sequencing Cell 182 1232 1251.e22 10.1016/j.cell.2020.07.017 32822576 PMC7484178 McKenna A Hanna M Banks E Sivachenko A Cibulskis K Kernytsky A Garimella K Altshuler D Gabriel S Daly M 2010 The Genome Analysis Toolkit: a MapReduce framework for analyzing next-generation DNA sequencing data Genome Res 20 1297 1303 10.1101/gr.107524.110 20644199 PMC2928508 Mihara E Hirai H Yamamoto H Tamura-Kawakami K Matano M Kikuchi A Sato T Takagi J 2016 Active and water-soluble form of lipidated Wnt protein is maintained by a serum glycoprotein afamin/α-albumin eLife 5 e11621 10.7554/eLife.11621 26902720 PMC4775226 Nam CH Youk J Kim JY Lim J Park JW Oh SA Lee HJ Park JW Won H Lee Y 2023 Widespread somatic L1 retrotransposition in normal colorectal epithelium Nature 617 540 547 10.1038/s41586-023-06046-z 37165195 PMC10191854 Naumann JA Argyris PP Carpenter MA Gupta HB Chen Y Temiz NA Zhou Y Durfee C Proehl J Koniar BL 2023 DNA deamination is required for human APOBEC3A-driven hepatocellular carcinoma in vivo Int J Mol Sci 24 9305 10.3390/ijms24119305 37298259 PMC10253583 Nik-Zainal S Alexandrov LB Wedge DC Van Loo P Greenman CD Raine K Jones D Hinton J Marshall J Stebbings LA 2012a Mutational processes molding the genomes of 21 breast cancers Cell 149 979 993 10.1016/j.cell.2012.04.024 22608084 PMC3414841 Nik-Zainal S Van Loo P Wedge DC Alexandrov LB Greenman CD Lau KW Raine K Jones D Marshall J Ramakrishna M 2012b The life history of 21 breast cancers Cell 149 994 1007 10.1016/j.cell.2012.04.023 22608083 PMC3428864 Nordentoft I Lamy P Birkenkamp-Demtröder K Shumansky K Vang S Hornshøj H Juul M Villesen P Hedegaard J Roth A 2014 Mutational context and diverse clonal development in early and late bladder cancer Cell Rep 7 1649 1663 10.1016/j.celrep.2014.04.038 24835989 Okazaki R Okazaki T Sakabe K Sugimoto K Sugino A 1968 Mechanism of DNA chain growth. I. Possible discontinuity and unusual secondary structure of newly synthesized chains Proc Natl Acad Sci 59 598 605 10.1073/pnas.59.2.598 4967086 PMC224714 Otlu B Díaz-Gay M Vermes I Bergstrom EN Zhivagui M Barnes M Alexandrov LB 2023 Topography of mutational signatures in human cancer Cell Rep 42 112930 10.1016/j.celrep.2023.112930 37540596 PMC10507738 Park S Mali NM Kim R Choi J-W Lee J Lim J Park JM Park JW Kim D Kim T 2021 Clonal dynamics in early human embryogenesis inferred from somatic mutation Nature 597 393 397 10.1038/s41586-021-03786-8 34433967 Petljak M Alexandrov LB Brammeld JS Price S Wedge DC Grossmann S Dawson KJ Ju YS Iorio F Tubio JMC 2019 Characterizing mutational signatures in human cancer cell lines reveals episodic APOBEC mutagenesis Cell 176 1282 1294.e20 10.1016/j.cell.2019.02.012 30849372 PMC6424819 Petljak M Dananberg A Chu K Bergstrom EN Striepen J von Morgen P Chen Y Shah H Sale JE Alexandrov LB 2022 Mechanisms of APOBEC3 mutagenesis in human cancer cells Nature 607 799 807 10.1038/s41586-022-04972-y 35859169 PMC9329121 Pleguezuelos-Manzano C Puschhof J Rosendahl Huber A van Hoeck A Wood HM Nomburg J Gurjao C Manders F Dalmasso G Stege PB 2020 Mutational signature in colorectal cancer caused by genotoxic pks + E. coli Nature 580 269 273 10.1038/s41586-020-2080-8 32106218 PMC8142898 Puram SV Tirosh I Parikh AS Patel AP Yizhak K Gillespie S Rodman C Luo CL Mroz EA Emerick KS 2017 Single-cell transcriptomic analysis of primary and metastatic tumor ecosystems in head and neck cancer Cell 171 1611 1624.e24 10.1016/j.cell.2017.10.044 29198524 PMC5878932 Quinlan AR Hall IM 2010 BEDTools: a flexible suite of utilities for comparing genomic features Bioinformatics 26 841 842 10.1093/bioinformatics/btq033 20110278 PMC2832824 Rausch T Zichner T Schlattl A Stütz AM Benes V Korbel JO 2012 DELLY: structural variant discovery by integrated paired-end and split-read analysis Bioinformatics 28 i333 i339 10.1093/bioinformatics/bts378 22962449 PMC3436805 Rhind N Gilbert DM 2013 DNA replication timing Cold Spring Harb Perspect Biol 5 a010132 10.1101/cshperspect.a010132 23838440 PMC3721284 Ritz C Jensen SM Gerhard D Streibig JC 2019 Dose-response analysis using R PLoS One 10 e0146021 10.1371/journal.pone.0146021 PMC4696819 26717316 Roberts SA Lawrence MS Klimczak LJ Grimm SA Fargo D Stojanov P Kiezun A Kryukov GV Carter SL Saksena G 2013 An APOBEC cytidine deaminase mutagenesis pattern is widespread in human cancers Nat Genet 45 970 976 10.1038/ng.2702 23852170 PMC3789062 Robinson JT Thorvaldsdóttir H Winckler W Guttman M Lander ES Getz G Mesirov JP 2011 Integrative Genomics Viewer Nat Biotechnol 29 24 26 10.1038/nbt.1754 21221095 PMC3346182 Roux LJ Weninger FJ Hershey JR 2015 Sparse NMF – half-baked or well done? Tech. Rep. No. TR2015-023. https://www.merl.com/publications/docs/TR2015-023.pdf Saini N Roberts SA Sterling JF Malc EP Mieczkowski PA Gordenin DA 2017 APOBEC3B cytidine deaminase targets the non-transcribed strand of tRNA genes in yeast DNA Repair (Amst) 53 4 14 10.1016/j.dnarep.2017.03.003 28351647 PMC5450012 Sanchez A Buisson R 2025 An in vitro cytidine deaminase assay to monitor APOBEC activity on DNA Methods Enzymol 713 201 219 10.1016/bs.mie.2024.11.037 40250954 PMC12083365 Sanchez A Ortega P Sakhtemani R Manjunath L Oh S Bournique E Becker A Kim K Durfee C Temiz NA 2024 Mesoscale DNA features impact APOBEC3A and APOBEC3B deaminase activity and shape tumor mutational landscapes Nat Commun 15 2370 10.1038/s41467-024-45909-5 38499542 PMC10948877 Satija R Farrell JA Gennert D Schier AF Regev A 2015 Spatial reconstruction of single-cell gene expression data Nat Biotechnol 33 495 502 10.1038/nbt.3192 25867923 PMC4430369 Sondka Z Dhir NB Carvalho-Silva D Jupe S Madhumita McLaren K Starkey M Ward S Wilding J Ahmed M 2024 COSMIC: a curated database of somatic variants and clinical data for cancer Nucleic Acids Res 52 D1210 D1217 10.1093/nar/gkad986 38183204 PMC10767972 Supek F Lehner B 2017 Clustered mutation signatures reveal that error-prone DNA repair targets mutations to active genes Cell 170 534 547.e23 10.1016/j.cell.2017.07.003 28753428 van Ineveld RL Ariese HCR Wehrens EJ Dekkers JF Rios AC 2020 Single-cell resolution three-dimensional imaging of intact organoids J Vis Exp 160 e60709 10.3791/60709 32568249 Venables WN Ripley BD 2003 Modern applied statistics with S Springer Science & Business Media, Berlin/Heidelberg Vieira VC Soares MA 2013 The role of cytidine deaminases on innate immune responses against human viral infections Biomed Res Int 2013 683095 10.1155/2013/683095 23865062 PMC3707226 Wang K Li M Hakonarson H 2010 ANNOVAR: functional annotation of genetic variants from high-throughput sequencing data Nucleic Acids Res 38 e164 10.1093/nar/gkq603 20601685 PMC2938201 Wang Y Robinson PS Coorens THH Moore L Lee-Six H Noorani A Sanders MA Jung H Katainen R Heuschkel R 2023 APOBEC mutagenesis is a common process in normal human small intestine Nat Genet 55 246 254 10.1038/s41588-022-01296-5 36702998 PMC9925384 Wilson MH Coates CJ George AL Jr 2007 PiggyBac Mol Ther 15 139 145 10.1038/sj.mt.6300028 17164785 Woodard LE Wilson MH 2015 piggyBac Trends Biotechnol 33 525 533 10.1016/j.tibtech.2015.06.009 26211958 PMC4663986 Wu Y-Y Tsai H-F Lin W-C Hsu P-I Shun C-T Wu M-S Hsu P-N 2007 Upregulation of CCL20 and recruitment of CCR6 + Helicobacter pylori Infect Immun 75 4357 4363 10.1128/IAI.01660-06 17562763 PMC1951156 Wu H Yu J Li Y Hou Q Zhou R Zhang N Jing Z Jiang M Li Z Hua Y 2018 Single-cell RNA sequencing reveals diverse intratumoral heterogeneities and gene signatures of two types of esophageal cancers Cancer Lett 438 133 143 10.1016/j.canlet.2018.09.017 30223068 Wu T Lyu R You Q He C 2020 Kethoxal-assisted single-stranded DNA sequencing captures global transcription dynamics and enhancer activity in situ Nat Methods 17 515 523 10.1038/s41592-020-0797-9 32251394 PMC7205578 Yoshida K Gowers KHC Lee-Six H Chandrasekharan DP Coorens T Maughan EF Beal K Menzies A Millar FR Anderson E 2020 Tobacco smoking and somatic mutations in human bronchial epithelium Nature 578 266 272 10.1038/s41586-020-1961-1 31996850 PMC7021511 Youk J Kwon HW Kim R Ju YS 2021 Dissecting single-cell genomes through the clonal organoid technique Exp Mol Med 53 1503 1511 10.1038/s12276-021-00680-1 34663940 PMC8569207 Youk J Kwon HW Lim J Kim E Kim T Kim R Park S Yi K Nam CH Jeon S 2024 Quantitative and qualitative mutational impact of ionizing radiation on normal cells Cell Genom 4 100499 10.1016/j.xgen.2024.100499 38359788 PMC10879144 ",
  "metadata": {
    "Title of this paper": "Quantitative and qualitative mutational impact of ionizing radiation on normal cells",
    "Journal it was published in:": "Genome Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487822/"
  }
}