{
  "title": "Paper_501",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12484178 PMC12484178.1 12484178 12484178 41041344 10.3389/fimmu.2025.1682992 1 Immunology Review The role of cGAS-STING signaling in the liver and gastrointestinal system: from signaling networks to target intervention Tan Zhengli  1 Shi Jiayue  2 Zhang Shiyi  1 Liu Yanyao  1  *  1 Department of Hepatobiliary Surgery, The First Affiliated Hospital of Chongqing Medical University Chongqing China  2 College of Traditional Chinese Medicine, Chongqing Medical University Chongqing China Edited by: Junji Xing Reviewed by: Xin Mu Omkar Shinde, Sinhgad Dental College and Hospital, India *Correspondence: Yanyao Liu, liuyanyao@hospital.cqmu.edu.cn 17 9 2025 2025 16 480569 1682992 10 8 2025 01 9 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Tan, Shi, Zhang and Liu. 2025 Tan, Shi, Zhang and Liu https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. The cyclic guanosine monophosphate-adenylate synthase (cGAS)-stimulator of interferon genes (STING) signaling pathway constitutes a fundamental mechanism through which the host innate immune system identifies cytoplasmic DNA. This pathway triggers a range of immune responses, notably the production of type I interferon (IFN-I), by detecting both exogenous pathogen-derived DNA and endogenous damage-associated DNA. It plays a pivotal role in anti-infective and anti-tumor responses, as well as in the maintenance of tissue homeostasis. Nevertheless, within the liver and gastrointestinal system—an environment persistently subjected to microbial and metabolic stress—the functionality of the cGAS-STING pathway demonstrates considerable complexity and context dependence. This review provides a comprehensive analysis of the molecular structure and activation mechanisms of the cGAS-STING signaling pathway. It systematically examines the variations in the pathway’s role across different disease contexts, cell types, and modes of stimulation. Furthermore, it synthesizes the latest therapeutic strategies targeting this pathway, offering a theoretical foundation and advanced insights for the development of more precise interventions for liver and gastrointestinal diseases. cGAS-STING liver diseases gastrointestinal diseases innate immune response inflammation The author(s) declare financial support was received for the research and/or publication of this article. This work was funded by the National Natural Science Foundation of China (Grant No. 82300745 and No. 82570779 to Yanyao Liu), National Training Program of Innovation and Entrepreneurship for Undergraduates (Grant No. 202410631017 to Zhengli Tan). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Molecular Innate Immunity 1 Introduction The innate immune system constitutes the host’s primary defense mechanism against both external pathogenic invasions and internal cellular damage. This system operates through a series of germline-encoded pattern recognition receptors (PRRs), which are responsible for identifying conserved pathogen-associated molecular patterns (PAMPs) and damage-associated molecular patterns (DAMPs) ( 1 2 The liver and gastrointestinal tract collectively constitute a distinctive and functionally intricate organ system that functions not only as the central hub for digestion, absorption, and nutrient metabolism but also as the body’s primary defense against external pathogens and toxins. The intestinal mucosa is persistently exposed to substantial quantities of commensal microorganisms, pathogens, food antigens, and environmental toxins, necessitating its immune system to sustain a delicate equilibrium between immune tolerance and immune response ( 3 4 5 This review seeks to systematically elucidate the role of the cGAS-STING signaling pathway in a range of hepatic and gastrointestinal diseases (  Figure 1 Figure 1 Activation of the cGAS-STING signaling pathway in liver and GI diseases. The cGAS-STING signaling pathway is integral to the processes of infection, inflammation, immunity, injury, and oncogenesis in the hepatic and GI systems. Infectious and inflammatory diseases include viral hepatitis, non-alcoholic liver disease, alcoholic liver disease. Autoimmune and injury-related diseases include liver fibrosis, IBD, and hepatic IRI. Neoplastic diseases include HCC and CRC. Diagram showing liver and bowel diseases affecting the human body. The liver conditions include viral hepatitis, non-alcoholic fatty liver disease, alcoholic liver disease, hepatic fibrosis, hepatic ischemia-reperfusion injury, and hepatocellular carcinoma. The bowel conditions depicted are inflammatory bowel disease and colorectal cancer. Sections highlight the affected organs: liver on the left and bowel on the right, connected to a human figure in the center. 2 The structure and molecular mechanism of cGAS-STING signaling A key component of the innate immune system’s defense against cytosolic DNA is the cGAS-STING signaling, functioning through precise molecular interactions that drive downstream inflammatory responses. Deciphering the structural basis and activation mechanisms of cGAS and STING is crucial for understanding their roles in disease pathogenesis and therapeutic targeting. 2.1 cGAS: structural features and immune activation paradigms cGAS is a double-stranded DNA (dsDNA) sensor in the cytoplasm ( 6 7 8 9 10 11 12 11 13 14 2.2 STING as a central hub: molecular activation, trafficking, and signal transduction pathways STING is a transmembrane adaptor protein crucial for the natural immune signaling pathway. Five transmembrane regions are present, along with N-terminal and C-terminal domains. The N-terminal domain comprises four transmembrane helices (amino acids 1–152), whereas the C-terminal domain is primarily composed of a V-shaped ligand-binding domain oriented toward the cytoplasm, as well as a C-terminal tail ( 15 16 17 18  Figure 2 19 Figure 2 An overview of the cGAS-STING signaling pathway. The process begins when microbial DNA, genomic DNA, or mtDNA trigger cGAS, resulting in the creation of the second messenger, cGAMP. cGAMP subsequently stimulates STING, thereby activating the cGAS-STING-TANK-TBK1-IRF3/NF-κB signaling cascade. This activation results in the expression of type I IFNs and pro-inflammatory cytokines. In addition to cGAMP, cyclic di-adenosine monophosphate (c-di-AMP) or cyclic di-guanosine monophosphate (c-di-GMP) can directly activate STING. Furthermore, cGAMP can activate STING in neighboring cells through gap junctions. Diagram illustrating the cellular signaling pathway. Microbial, genomic, and mitochondrial DNA are detected by cGAS, producing cGAMP. cGAMP activates STING in the endoplasmic reticulum (ER). STING transfers a signal through ERGIC to the Golgi, activating TBK1. TBK1 triggers IRF3 and NF-kB, which enter the nucleus, resulting in the production of Type I interferons and proinflammatory cytokines. Gap junctions show the transfer of c-di-AMP and c-di-GMP. 3 cGAS-STING in infection and inflammation As a central component of anti-infective immunity, the cGAS-STING pathway plays a pivotal role in mediating responses to pathogen invasion and associated inflammatory processes within the liver and gastrointestinal system. Nevertheless, its function is not uniform; instead, it demonstrates highly specific mechanisms and effects across various disease contexts. 3.1 Viral hepatitis Viral hepatitis encompasses a group of infectious diseases instigated by diverse hepatitis viruses, predominantly marked by liver inflammation and necrosis. Notably, the hepatitis B virus (HBV) and hepatitis C virus (HCV) are principal agents responsible for chronic hepatitis, cirrhosis, and hepatocellular carcinoma (HCC), thereby constituting a significant global public health concern ( 20 21 As a DNA virus, the HBV genome would typically serve as a direct substrate for cGAS recognition, thereby initiating a robust antiviral immune response. Nevertheless, the capacity of HBV to establish chronic infection is primarily attributed to its evolution of a sophisticated and efficient immune evasion strategy, which suppresses the activation of the cGAS-STING pathway through a variety of mechanisms ( 22 23 22 24 25 26 27 28 29 In contrast to HBV, HCV is an RNA virus, and its genome is not typically detected by the DNA sensor cGAS ( 30 31 32 33 34 Due to the protective role of STING pathway activation in mitigating HBV-induced liver damage, researchers are actively screening and developing STING agonists or small molecules with STING agonist properties to combat HBV. Recent research indicates that Schisandra C promotes the cGAS-STING signaling pathway, thereby exhibiting antiviral effects in HBV-infected mice ( 35 36 37 The distinct interaction patterns between HBV and HCV with the cGAS-STING pathway underscore the intricate nature of virus-host coevolution. HBV, as a DNA virus, encounters substantial selective pressure to be directly identified by cGAS, resulting in the development of sophisticated, multi-layered inhibitory mechanisms. Conversely, HCV, an RNA virus, indirectly activates this otherwise unrelated immune pathway by disrupting cellular metabolism. This illustrates the adaptability of the host immune system in leveraging cellular damage signals to identify a wide range of threats. 3.2 NAFLD Non-alcoholic fatty liver disease (NAFLD) represents a chronic hepatic condition intricately linked with metabolic syndrome ( 38 The fundamental pathophysiological basis of NAFLD is the excessive intracellular accumulation of free fatty acids within hepatocytes, a phenomenon termed lipotoxicity. This lipotoxicity imposes considerable stress on organelles, particularly mitochondria, which are integral to energy metabolism. Under conditions of sustained metabolic burden, hepatic mitochondrial dysfunction ensues, leading to the release of mtDNA into the cytoplasm. This cytoplasmic mtDNA functions as an endogenous DAMP, serving as a potent activator of the cGAS-STING pathway ( 4 39 40 41 A notable characteristic of cGAS-STING pathway activation in NAFLD is its pronounced cell type specificity. Extensive research has demonstrated that in the normal livers of adult mice and humans, hepatocytes exhibit minimal or undetectable levels of STING protein expression ( 42 43 Recognizing the significant impact of the cGAS-STING pathway on inflammation and fibrosis in NAFLD/NASH, targeting this pathway to inhibit its activity has emerged as a hopeful therapeutic strategy. RNF13 effectively inhibits lipid accumulation, inflammation, and metabolic dysfunction during NASH progression. It supports TRIM29 stabilization via K63-linked ubiquitination, which permits TRIM29 to ubiquitin-dependently break down STING and prevent the irregular activation of downstream signaling pathways ( 44 45 3.3 ALD Alcoholic liver disease (ALD) is marked by liver injury due to long-term excessive drinking and is a leading cause of cirrhosis and alcohol-related deaths worldwide. The pathogenesis of ALD is primarily driven by the direct toxicity of alcohol and its metabolites, oxidative stress, nutritional imbalances, and dysbiosis of the gut microbiota ( 46 The activation of the cGAS-STING pathway in ALD is attributed to the synergistic interaction of at least three contributing factors (  Figure 3 47 48 49 50 47 Figure 3 The cGAS-STING signaling in ALD. The activation of the cGAS-STING pathway in ALD is attributed to multiple sources. Firstly, metabolites of alcohol induce mitochondrial damage, resulting in the release of mtDNA. Furthermore, alcohol compromises the integrity of the gastrointestinal tract barrier, facilitating the translocation of gut microorganisms into the liver. The dsDNA from these microorganisms serves as a coactivator for cGAS. Additionally, the metabolic processing of alcohol can induce ER stress, which directly activates the downstream signaling of STING. Diagram illustrating alcohol's impact on liver cells and intestinal barrier. Alcohol induces ER stress and mitochondrial leak in hepatocytes, releasing mtDNA. This activates cGAS and STING, leading to IFN and pro-inflammatory factors. Simultaneously, bacterial products (PAMPs) from the intestinal community cross the vascular barrier, influencing the liver's response. Although no STING inhibitors specifically targeting ALD have yet progressed to clinical trials, potential therapeutic targets, such as direct inhibition of STING or cGAS, blockade of the endoplasmic reticulum stress-STING axis, inhibition of intercellular gap junctions, and enhancement of intestinal barrier function, present promising avenues for the development of effective ALD treatments. 4 cGAS-STING in autoimmunity and injury 4.1 Hepatic fibrosis Chronic liver disease is often characterized by liver fibrosis, a compensatory response secondary to tissue repair following various chronic liver injuries ( 51 52 Engaging the cGAS-STING pathway might elevate liver inflammation, promote fibrosis, harm liver sinusoidal endothelial cells (LSECs), and hasten microthrombi development in hepatic sinusoids ( 53 54 Eliminating activated HSCs to prevent excessive EM deposition is an effective strategy for treating liver fibrosis. Atractylenolide III (ATR III) mitigates liver fibrosis by suppressing the cGAS/NF-κB pathway in HSCs, which subsequently inhibits the senescent cell-derived senescence-associated secretory phenotype (SASP) and decreases inflammation ( 55 56 57 2+ 2+ 2+ 58 59 60 4.2 Inflammatory bowel disease IBD, which is also referred to as CD or UC, is a long-term condition marked by inflammation in the gastrointestinal tract ( 61 62 STING has recently emerged as a key regulator of intestinal homeostasis by activating pro-inflammatory IFN-I and cytokines that must be tightly controlled to maintain intestinal balance ( 63 64  Figure 4 65 64 66 67 68 69 70 17 Figure 4 The cGAS-STING signaling pathway in IBD plays different roles in different cells. In IBD, the integrity of intestinal architecture is compromised, resulting in increased permeability. This disruption allows pathogens, including bacteria, to infiltrate the intestinal lamina propria, where they activate macrophages and promote their differentiation into the M2 phenotype, subsequently damaging the intestinal mucosa. Within intestinal epithelial cells, the cGAS-STING signaling pathway is activated, producing IFNs and cytokines that prevent pathogen invasion. Diagram illustrating cellular response in intestinal epithelial cells. Pathogen intrusion leads to dsDNA detection, activating cGAS and STING pathways. This triggers autophagy and cytokine release, resulting in immune responses like proinflammatory Th1 cell development and macrophage differentiation into M2 macrophages. Injury is depicted in one cell, indicating cellular stress response. Inhibiting the overactive cGAS-STING, which is crucial for intestinal homeostasis and inflammation regulation, could be an effective therapeutic strategy for IBD. RU.521, the first selective cGAS inhibitor, was identified using high-throughput screening and subsequent structural enhancement. Immunoblot analysis demonstrated that intraperitoneal administration of RU.521 in a mouse model effectively targeted the cGAS-STING signaling pathway, thereby ameliorating colitis symptoms ( 71 72 in vitro in vivo 73 4.3 Hepatic ischemia-reperfusion injury Hepatic ischemia-reperfusion injury (HIRI) frequently occurs in clinical contexts such as liver transplantation, hepatic resection, and traumatic injury, and it constitutes a significant contributor to postoperative liver dysfunction and failure ( 74 During HIRI, hepatocytes experience significant damage due to hypoxia and oxidative stress, leading to the release of substantial amounts of mtDNA. It can be recognized by Kupffer cells, which subsequently activate the cGAS-STING pathway. This process recruits inflammatory cells, such as neutrophils, to infiltrate the tissue, thereby exacerbating inflammatory damage and hepatocyte death. In HIRI models, mice deficient in STING demonstrate a significant reduction in liver damage and improved hepatic function ( 75 76 The dual role of the cGAS-STING pathway in HIRI necessitates more sophisticated treatment strategies. Simple cGAS inhibitors may inadvertently impede its beneficial autophagic function, potentially leading to adverse effects. Consequently, more nuanced intervention strategies are required. Direct inhibition of STING or its downstream signaling pathways represents a clearly effective approach. For instance, compounds such as dimethyl fumarate have demonstrated efficacy in mitigating HIRI by disrupting the interaction between STING and its downstream effectors TBK1/IRF3 ( 77 75 5 cGAS-STING in cancer 5.1 Hepatocellular carcinoma Hepatocellular carcinoma (HCC) is the most common type of primary liver cancer worldwide and is known for its high mortality rate. Its development is strongly linked to sustained inflammation and fibrosis associated with chronic liver disease ( 78 During the chronic liver disease stage that precedes HCC, the persistent, low-level activation of the cGAS-STING pathway exhibits tumorigenic properties. As previously discussed, chronic inflammation driven by DAMPs and PAMPs, such as mtDNA or bacterial DNA, continuously stimulates hepatic immune cells and HSCs. This stimulation creates a microenvironment conducive to fibrosis, angiogenesis, and cell proliferation, thereby establishing the “soil” necessary for the malignant transformation of hepatocytes ( 4 49 79 80 42 81 82 Due to their robust capacity to activate anti-tumor immune responses, STING agonists have emerged as a highly promising avenue of research within the domain of tumor immunotherapy, particularly in the treatment of HCC. A variety of synthetic cyclic dinucleotide (CDN) analogues, such as ADU-S100, MK-1454, and BMS-986301, along with non-CDN small-molecule agonists, have been developed and have shown efficacy in preclinical models of HCC, either as standalone treatments or in combination with other therapies ( 83 42 84 85 87 5.2 Colorectal cancer CRC represents about 10% of global cancer diagnoses and deaths, posing a major health threat worldwide ( 88 89 Current research extensively explores the cGAS-STING signaling pathway in CRC, and the potential mechanisms are elucidated in this study by examining each module of the pathway. In tumor cells, the main cGAS activators are DNA after tumor cell damage and mtDNA. Research has focused on improving tumor cell damage to trigger the cGAS-STING signaling pathway and activate the innate immune response. In cancer cells, RT-induced endogenous production of IFN-I primarily relies on the cGAS/STING pathway activated by cytoplasmic dsDNA, boosting cancer immunogenicity and strengthening antitumor immune responses, leading to better treatment outcomes ( 90 91 92 93 94 95 The downstream cGAS-STING pathway is linked to immune cells, including IFN, which plays a crucial role. The combination of irinotecan dioxide nanorods and RT activates the cGAS/STING pathway in CRC, resulting in the enhanced infiltration of CD4+ T cells, CD8+ T cells, and DCs within the TME (  Figure 5 96 97 Figure 5 Activation of the cGAS-STING pathway in CRC can augment innate immune responses. RT and administration of TOPI inhibitors induce tumor damage, resulting in the release of dsDNA, which subsequently activates the cGAS-STING pathway. This activation enhances the infiltration of CD4+ T cells, CD8+ T cells, and DCs into the TME. Diagram illustrating the interaction between radiation therapy (RT), topoisomerase I (TOPI) inhibitor, and tumor cells in intestinal epithelial cells. Genomic and mitochondrial DNA (mtDNA) activate cGAS, leading to STING activation and production of interferons (IFN-I) and cytokines. This process recruits CD4+ T cells, CD8+ T cells, and dendritic cells (DCs) to the tumor microenvironment (TME). 6 Deeper insights into the significance and function of cGAS-STING The cGAS-STING signaling pathway demonstrates markedly diverse and sometimes contradictory functions across various hepatic and gastrointestinal diseases. Its roles span from serving as an antiviral “guardian” to acting as a pro-inflammatory “catalyst,” and from functioning as an anti-tumor “sword” to facilitating a pro-carcinogenic “breeding ground.” A comprehensive investigation into the underlying causes of these functional disparities, along with a strategic framework for the precise application of this pathway, is essential for advancing both fundamental research and clinical translation. The cGAS-STING pathway, often perceived as a straightforward “DNA sensing-IFN/inflammation production” linear model, is in fact modulated by a multitude of factors within complex biological systems, resulting in diverse outcomes. The variability in its functional roles can be attributed to several levels of regulation. Foremost, the cell type in which the pathway is activated plays a pivotal role in determining its function. Activation within immune cells generally triggers classical immune responses. For instance, in the context of NAFLD, Kupffer cells are the primary responders to STING activation. This activation induces the release of pro-inflammatory mediators via the NF-κB pathway, thereby promoting sterile inflammation ( 43 81 82 50 55 76 22 4 47 42 79 The intricate and dual nature of the cGAS-STING pathway poses significant challenges for therapeutic interventions, while simultaneously indicating potential avenues for future development. Furthermore, addressing the toxicity associated with STING agonists presents a significant challenge. The activation of the STING pathway results in the overproduction of proinflammatory cytokines, potentially leading to severe adverse effects, including fever and chills. The risk is exacerbated with systemic administration, underscoring the necessity to optimize dosing strategies and develop more selective STING activators to reduce off-target effects ( 84 85 42 76 7 Conclusion The cGAS-STING signaling pathway, as a fundamental component of the innate immune system, plays a significant and intricate role in the physiological and pathological processes of the liver and gastrointestinal system. It functions not only as a robust defense mechanism against viral infections but also as a sensitive detector of cellular stress and tissue damage. This review systematically elucidates that the functions and effects of this pathway are dynamic and are meticulously regulated by the disease context, cell type, stimulus signals, and timing of activation. In the context of antiviral immunity, it acts as both a potent mechanism for the host to eliminate viruses and a target that viruses attempt to suppress to establish persistent infection. In metabolic diseases such as NAFLD and ALD, it serves as the central driver of sterile inflammation induced by metabolic disorders. During processes of tissue damage and repair, it can facilitate fibrosis and inflammatory damage through STING-dependent mechanisms, while also exerting protective effects via cGAS-dependent non-canonical pathways. During tumor development, the STING pathway exhibits dual roles: it acts as a protective agent against cancer during acute activation but may promote tumorigenesis under chronic stimulation. A comprehensive understanding of this context-dependent behavior presents novel therapeutic opportunities. STING agonists have shown considerable promise in immunotherapy for tumors and chronic viral infections, whereas STING inhibitors have paved the way for novel treatments of inflammatory diseases, including NAFLD, ALD, IBD, and liver fibrosis. The field faces both challenges and opportunities moving forward. Key areas for advancement include the development of cell-specific targeted delivery systems, identification of optimal therapeutic windows, exploration of refined regulatory mechanisms within the pathway, and the implementation of personalized treatments based on biomarkers. Effectively harnessing this dual-function pathway holds the potential for groundbreaking advancements in the treatment of various challenging liver and gastrointestinal diseases. Acknowledgments Figures are supported by Figdraw. Author contributions ZT: Data curation, Visualization, Methodology, Conceptualization, Project administration, Funding acquisition, Investigation, Writing – review & editing, Writing – original draft. JS: Writing – original draft. SZ: Writing – original draft. YL: Funding acquisition, Project administration, Resources, Supervision, Conceptualization, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Khoo LT Chen LY Role of the cGAS-STING pathway in cancer development and oncotherapeutic approaches EMBO Rep 2018 19 e4693 10.15252/embr.201846935 30446584 PMC6280650 2 Pan J Fei CJ Hu Y Wu XY Nie L Chen J Current understanding of the cGAS-STING signaling pathway: Structure, regulatory mechanisms, and related diseases Zool Res 2023 44 183 218 10.24272/j.issn.2095-8137.2022.464 36579404 PMC9841179 3 Long D Mao C Zhu Y Xu Y cGAS-STING pathway as a promising target for digestive diseases: insights from natural plant products Front Nutr 2025 12 1594120 10.3389/fnut.2025.1594120 40621423 PMC12226309 4 Wang Z Chen N Li Z Xu G Zhan X Tang J The cytosolic DNA-sensing cGAS-STING pathway in liver diseases Front Cell Dev Biol 2021 9 717610 10.3389/fcell.2021.717610 34386500 PMC8353273 5 Su J Cheng F Yuan W Unraveling the cGAS/STING signaling mechanism: impact on glycerolipid metabolism and diseases Front Med (Lausanne) 2024 11 1512916 10.3389/fmed.2024.1512916 39669992 PMC11634591 6 Sun L Wu J Du F Chen X Chen ZJ Cyclic GMP-AMP synthase is a cytosolic DNA sensor that activates the type I interferon pathway Science 2013 339 786–91 10.1126/science.1232458 23258413 PMC3863629 7 Tan X Sun L Chen J Chen ZJ Detection of microbial infections through innate immune sensing of nucleic acids Annu Rev Microbiol 2018 72 447–78 10.1146/annurev-micro-102215-095605 30200854 8 Li T Chen ZJ The cGAS-cGAMP-STING pathway connects DNA damage to inflammation, senescence, and cancer J Exp Med 2018 215 1287–99 10.1084/jem.20180139 29622565 PMC5940270 9 Hopfner KP Hornung V Molecular mechanisms and cellular functions of cGAS-STING signalling Nat Rev Mol Cell Biol 2020 21 501–21 10.1038/s41580-020-0244-x 32424334 10 Volkman HE Cambier S Gray EE Stetson DB Tight nuclear tethering of cGAS is essential for preventing autoreactivity Elife 2019 8 e47491 10.7554/eLife.47491 31808743 PMC6927687 11 Chen Q Sun L Chen ZJ Regulation and function of the cGAS-STING pathway of cytosolic DNA sensing Nat Immunol 2016 17 1142–9 10.1038/ni.3558 27648547 12 Rasaiyaah J Tan CP Fletcher AJ Price AJ Blondeau C Hilditch L HIV-1 evades innate immune recognition through specific cofactor recruitment Nature 2013 503 402–5 10.1038/nature12769 24196705 PMC3928559 13 Pépin G De Nardo D Rootes CL Ullah TR Al-Asmari SS Balka KR Connexin-dependent transfer of cGAMP to phagocytes modulates antiviral responses mBio 2020 11 e03187–19 10.1128/mBio.03187-19 31992625 PMC6989113 14 Thomsen MK Nandakumar R Stadler D Malo A Valls RM Wang F Lack of immunological DNA sensing in hepatocytes facilitates hepatitis B virus infection Hepatology 2016 64 746–59 10.1002/hep.28685 27312012 15 Ishikawa H Barber GN STING is an endoplasmic reticulum adaptor that facilitates innate immune signalling Nature 2008 455 674–8 10.1038/nature07317 18724357 PMC2804933 16 Yang K Han W Jiang X Piffko A Bugno J Han C Zinc cyclic di-AMP nanoparticles target and suppress tumours via endothelial STING activation and tumour-associated macrophage reinvigoration Nat Nanotechnol 2022 17 1322–31 10.1038/s41565-022-01225-x 36302963 17 Liang Q Seo GJ Choi YJ Kwak MJ Ge J Rodgers MA Crosstalk between the cGAS DNA sensor and Beclin-1 autophagy protein shapes innate antimicrobial immune responses Cell Host Microbe 2014 15 228–38 10.1016/j.chom.2014.01.009 24528868 PMC3950946 18 Gui X Yang H Li T Tan X Shi P Li M Autophagy induction via STING trafficking is a primordial function of the cGAS pathway Nature 2019 567 262–6 10.1038/s41586-019-1006-9 30842662 PMC9417302 19 Lousberg EL Fraser CK Tovey MG Diener KR Hayball JD Type I interferons mediate the innate cytokine response to recombinant fowlpox virus but not the induction of plasmacytoid dendritic cell-dependent adaptive immunity J Virol 2010 84 6549–63 10.1128/JVI.02618-09 20410285 PMC2903286 20 Kudaravalli S Huang DQ Yeh ML Trinh L Tsai PC Hsu YC Sex and ethnic disparities in hepatitis B evaluation and treatment across the world J Hepatol 2024 81 33 41 10.1016/j.jhep.2024.02.033 38906621 21 Bonsignori M Marcotrigiano J HCV neutralization goes elite Immunity 2022 55 195–7 10.1016/j.immuni.2022.01.010 35139349 22 Xu ZY Gao JS He Y Xiao XQ Gong GZ Zhang M Hepatitis B virus confers innate immunity evasion through hepatitis B virus-miR-3 down-regulation of cGAS-Sting-IFN signaling World J Hepatol 2025 17 99292 10.4254/wjh.v17.i2.99292 40027574 PMC11866139 23 Liu Y Li J Chen J Li Y Wang W Du X Hepatitis B virus polymerase disrupts K63-linked ubiquitination of STING to block innate cytosolic DNA-sensing pathways J Virol 2015 89 2287–300 10.1128/JVI.02760-14 25505063 PMC4338878 24 You H Qin S Zhang F Hu W Li X Liu D Regulation of pattern-recognition receptor signaling by HBX during hepatitis B virus infection Front Immunol 2022 13 829923 10.3389/fimmu.2022.829923 35251017 PMC8891514 25 Xing J Zhang A Zhang H Wang J Li XC Zeng MS TRIM29 promotes DNA virus infections by inhibiting innate immune response Nat Commun 2017 8 945 10.1038/s41467-017-00101-w 29038422 PMC5643338 26 Wang J Lu W Zhang J Du Y Fang M Zhang A Loss of TRIM29 mitigates viral myocarditis by attenuating PERK-driven ER stress response in male mice Nat Commun 2024 15 3481 10.1038/s41467-024-44745-x 38664417 PMC11045800 27 Wang J Wang L Lu W Farhataziz N Gonzalez A Xing J TRIM29 controls enteric RNA virus-induced intestinal inflammation by targeting NLRP6 and NLRP9b signaling pathways Mucosal Immunol 2025 18 135–50 10.1016/j.mucimm.2024.10.004 39396665 PMC12210021 28 Verrier ER Yim SA Heydmann L El Saghire H Bach C Turon-Lagot V Hepatitis B virus evasion from cyclic guanosine monophosphate-adenosine monophosphate synthase sensing in human hepatocytes Hepatology 2018 68 1695–709 10.1002/hep.30054 29679386 PMC6195855 29 Lauterbach-Rivière L Bergez M Mönch S Qu B Riess M Vondran FWR Hepatitis B Virus DNA is a Substrate for the cGAS/STING Pathway but is not Sensed in Infected Hepatocytes Viruses 2020 12 592 10.3390/v12060592 32485908 PMC7354540 30 Schwerk J Negash A Savan R Gale M Jr. Innate immunity in hepatitis C virus infection Cold Spring Harb Perspect Med 2021 11 a036988 10.1101/cshperspect.a036988 32341066 PMC7849348 31 Ni G Ma Z Damania B cGAS and STING: At the intersection of DNA and RNA virus-sensing networks PloS Pathog 2018 14 e1007148 10.1371/journal.ppat.1007148 30114241 PMC6095619 32 Wang X Zhang H Wang Y Bramasole L Guo K Mourtada F DNA sensing via the cGAS/STING pathway activates the immunoproteasome and adaptive T-cell immunity EMBO J 2023 42 e110597 10.15252/embj.2022110597 36912165 PMC10106989 33 Liu H Zhu Z Xue Q Yang F Li Z Xue Z Innate sensing of picornavirus infection involves cGAS-STING-mediated antiviral responses triggered by mitochondrial DNA release PloS Pathog 2023 19 e1011132 10.1371/journal.ppat.1011132 36745686 PMC9934381 34 Blumer T Coto-Llerena M Duong FHT Heim MH Activation of cGAS-STING signaling pathway during HCV infection bioRxiv 10.1101/2025.01.11.632524 35 Zhao J Xu G Hou X Mu W Yang H Shi W Schisandrin C enhances cGAS-STING pathway activation and inhibits HBV replication J Ethnopharmacol 2023 311 116427 10.1016/j.jep.2023.116427 37001770 36 Shu D Cheng L Yuan K Liu D Wei H RVX-208, an inducer of Apolipoprotein A-I, inhibits the particle production of hepatitis B virus through activation of cGAS-STING pathway Antivir Ther 2023 28 13596535231219639 10.1177/13596535231219639 38037795 37 Imai H Dansako H Ueda Y Satoh S Kato N Daunorubicin, a topoisomerase II poison, suppresses viral production of hepatitis B virus by inducing cGAS-dependent innate immune response Biochem Biophys Res Commun 2018 504 672–8 10.1016/j.bbrc.2018.08.195 30209005 38 Grander C Grabherr F Tilg H Non-alcoholic fatty liver disease: pathophysiological concepts and treatment options Cardiovasc Res 2023 119 1787–98 10.1093/cvr/cvad095 37364164 PMC10405569 39 Lv J Xing C Chen Y Bian H Lv N Wang Z The STING in non-alcoholic fatty liver diseases: potential therapeutic targets in inflammation-carcinogenesis pathway Pharm (Basel) 2022 15 1241 10.3390/ph15101241 36297353 PMC9611148 40 Luo Z Ji Y Zhang D Gao H Jin Z Yang M Microbial DNA enrichment promotes liver steatosis and fibrosis in the course of non-alcoholic steatohepatitis Acta Physiol (Oxf) 2022 235 e13827 10.1111/apha.13827 35500155 PMC9335517 41 Li H Hu L Wang L Wang Y Shao M Chen Y Iron activates cGAS-STING signaling and promotes hepatic inflammation J Agric Food Chem 2022 70 2211–20 10.1021/acs.jafc.1c06681 35133148 42 Xue F Liu YK Chen XY Chen SS Yu XR Li HW Targeting cGAS-STING: modulating the immune landscape of hepatic diseases Front Immunol 2025 16 1498323 10.3389/fimmu.2025.1498323 40098962 PMC11911377 43 Yu Y Liu Y An W Song J Zhang Y Zhao X STING-mediated inflammation in Kupffer cells contributes to progression of nonalcoholic steatohepatitis J Clin Invest 2019 129 546–55 10.1172/JCI121842 30561388 PMC6355218 44 Lin Z Yang P Hu Y Xu H Duan J He F RING finger protein 13 protects against nonalcoholic steatohepatitis by targeting STING-relayed signaling pathways Nat Commun 2023 14 6635 10.1038/s41467-023-42420-1 37857628 PMC10587083 45 Luo W Xu G Song Z Mu W Wen J Hui S Licorice extract inhibits the cGAS-STING pathway and protects against non-alcoholic steatohepatitis Front Pharmacol 2023 14 1160445 10.3389/fphar.2023.1160445 37081966 PMC10111149 46 Mackowiak B Fu Y Maccioni L Gao B Alcohol-associated liver disease J Clin Invest 2024 134 e176345 10.1172/JCI176345 38299591 PMC10836812 47 Luther J Khan S Gala MK Kedrin D Sridharan G Goodman RP Hepatic gap junctions amplify alcohol liver injury by propagating cGAS-mediated IRF3 activation Proc Natl Acad Sci U S A 2020 117 11667–73 10.1073/pnas.1911870117 32393626 PMC7261084 48 Chen R Du J Zhu H Ling Q The role of cGAS-STING signalling in liver diseases JHEP Rep 2021 3 100324 10.1016/j.jhepr.2021.100324 34381984 PMC8340306 49 Wang R Ma F Yin D Wang H Wei X Intestinal microbes, metabolites, and hormones in alcohol-associated liver disease Semin Liver Dis 10.1055/a-2601-9480 40334703 50 Petrasek J Iracheta-Vellve A Csak T Satishchandran A Kodys K Kurt-Jones EA STING-IRF3 pathway links endoplasmic reticulum stress with hepatocyte apoptosis in early alcoholic liver disease Proc Natl Acad Sci U S A 2013 110 16544–9 10.1073/pnas.1308331110 24052526 PMC3799324 51 Breitkopf-Heinlein K Syn WK Harnessing liver progenitors in the treatment of liver fibrosis: a step in the right direction Gut 2020 69 975–6 10.1136/gutjnl-2019-320203 31959691 52 Li H Liu T Yang Y Cho WC Flynn RJ Harandi MF Interplays of liver fibrosis-associated microRNAs: Molecular mechanisms and implications in diagnosis and therapy Genes Dis 2022 10 1457–69 10.1016/j.gendis.2022.08.013 37397560 PMC10311052 53 Luo S Luo R Lu H Zhang R Deng G Luo H Activation of cGAS-STING signaling pathway promotes liver fibrosis and hepatic sinusoidal microthrombosis Int Immunopharmacol 2023 125 111132 10.1016/j.intimp.2023.111132 37951190 54 Iracheta-Vellve A Petrasek J Gyongyosi B Satishchandran A Lowe P Kodys K Endoplasmic reticulum stress-induced hepatocellular death pathways mediate liver injury and fibrosis via stimulator of interferon genes J Biol Chem 2016 291 26794–805 10.1074/jbc.M116.736991 27810900 PMC5207187 55 Wu H Wu L Xiao L Gu Y Liu H Zhang L Atractylenolide III suppresses senescence-associated secretome via inhibiting cGAS/NF-κB pathway in hepatic stellate cells Clin Exp Pharmacol Physiol 2023 50 316–24 10.1111/1440-1681.13753 36648378 56 Jiang Y Xiang C Zhong F Zhang Y Wang L Zhao Y Histone H3K27 methyltransferase EZH2 and demethylase JMJD3 regulate hepatic stellate cells activation and liver fibrosis Theranostics 2021 11 361–78 10.7150/thno.46360 33391480 PMC7681085 57 Gao B Radaeva S Natural killer and natural killer T cells in liver fibrosis Biochim Biophys Acta 2013 1832 1061–9 10.1016/j.bbadis.2012.09.008 23022478 PMC3552008 58 Gu L Zhao C Wang Y Wang C Yin X Ye Q Senescence of hepatic stellate cells by specific delivery of manganese for limiting liver fibrosis Nano Lett 2024 24 1062–73 10.1021/acs.nanolett.3c03689 38164915 PMC10836362 59 Sun Y Weng J Chen X Ma S Zhang Y Zhang F Oroxylin A activates ferritinophagy to induce hepatic stellate cell senescence against hepatic fibrosis by regulating cGAS-STING pathway BioMed Pharmacother 2023 162 114653 10.1016/j.biopha.2023.114653 37086511 60 Zhao D Gao Y Su Y Zhou Y Yang T Li Y Oroxylin A regulates cGAS DNA hypermethylation induced by methionine metabolism to promote HSC senescence Pharmacol Res 2023 187 106590 10.1016/j.phrs.2022.106590 36464146 61 Yang W Wang Y Wang T Li C Shi L Zhang P Protective effects of IRG1/itaconate on acute colitis through the inhibition of gasdermins-mediated pyroptosis and inflammation response Genes Dis 2022 10 1552–63 10.1016/j.gendis.2022.05.039 37397544 PMC10311025 62 Zhang YZ Li YY Inflammatory bowel disease: pathogenesis World J Gastroenterol 2014 20 91–9 10.3748/wjg.v20.i1.91 24415861 PMC3886036 63 Ke X Hu T Jiang M cGAS-STING signaling pathway in gastrointestinal inflammatory disease and cancers FASEB J 2022 36 e22029 10.1096/fj.202101199R 34907606 64 Shmuel-Galia L Humphries F Lei X Ceglia S Wilson R Jiang Z Dysbiosis exacerbates colitis by promoting ubiquitination and accumulation of the innate immune adaptor STING in myeloid cells Immunity 2021 54 1137 1153.e8 10.1016/j.immuni.2021.05.008 34051146 PMC8237382 65 Wang Q Bu Q Liu M Zhang R Gu J Li L XBP1-mediated activation of the STING signalling pathway in macrophages contributes to liver fibrosis progression JHEP Rep 2022 4 100555 10.1016/j.jhepr.2022.100555 36185574 PMC9520276 66 Agus A Planchais J Sokol H Gut microbiota regulation of tryptophan metabolism in health and disease Cell Host Microbe 2018 23 716–24 10.1016/j.chom.2018.05.003 29902437 67 Sun M Ma N He T Johnston LJ Ma X Tryptophan (Trp) modulates gut homeostasis via aryl hydrocarbon receptor (AhR) Crit Rev Food Sci Nutr 2020 60 1760–8 10.1080/10408398.2019.1598334 30924357 68 Zhang R Yu C Zeh HJ Wang H Kroemer G Klionsky DJ Nuclear localization of STING1 competes with canonical signaling to activate AHR for commensal and intestinal homeostasis Immunity 2023 56 2736 2754.e8 10.1016/j.immuni.2023.11.001 38016467 PMC10842782 69 Cai Y Li S Yang Y Duan S Fan G Bai J Intestinal epithelial damage-derived mtDNA activates STING-IL12 axis in dendritic cells to promote colitis Theranostics 2024 14 4393–410 10.7150/thno.96184 39113810 PMC11303083 70 Yang W Yu T Zhou G Yao S Wakamiya M Hu H Intrinsic STING switches off pathogenetic programs of th1 cells to inhibit colitis Cell Mol Gastroenterol Hepatol 2023 15 1161–79 10.1016/j.jcmgh.2023.01.010 36736893 PMC10040963 71 Vincent J Adura C Gao P Luz A Lama L Asano Y Small molecule inhibition of cGAS reduces interferon expression in primary macrophages from autoimmune mice Nat Commun 2017 8 750 10.1038/s41467-017-00833-9 28963528 PMC5622107 72 Uthaman S Parvinroo S Mathew AP Jia X Hernandez B Proctor A Inhibiting the cGAS-STING pathway in ulcerative colitis with programmable micelles ACS Nano 2024 18 12117–33 10.1021/acsnano.3c11257 38648373 73 Wang Z Guo K Gao P Pu Q Lin P Qin S Microbial and genetic-based framework identifies drug targets in inflammatory bowel disease Theranostics 2021 11 7491–506 10.7150/thno.59196 34158863 PMC8210594 74 Nakamura K Zhang M Kageyama S Ke B Fujii T Sosa RA Macrophage heme oxygenase-1-SIRT1-p53 axis regulates sterile inflammation in liver ischemia-reperfusion injury J Hepatol 2017 67 1232–42 10.1016/j.jhep.2017.08.010 28842295 PMC5884687 75 Xiong Y Chen J Liang W Li K Huang Y Song J Blockade of the mitochondrial DNA release ameliorates hepatic ischemia-reperfusion injury through avoiding the activation of cGAS-Sting pathway J Transl Med 2024 22 796 10.1186/s12967-024-05588-8 39198913 PMC11351313 76 Lei Z Deng M Yi Z Sun Q Shapiro RA Xu H cGAS-mediated autophagy protects the liver from ischemia-reperfusion injury independently of STING Am J Physiol Gastrointest Liver Physiol 2018 314 G655–67 10.1152/ajpgi.00326.2017 29446653 PMC6032062 77 Xiong Y Chen J Li K Liang W Song J Qiu X Dimethyl fumarate alleviate hepatic ischemia-reperfusion injury through suppressing cGAS-STING signaling MedComm (2020) 2025 6 e70077 10.1002/mco2.70077 39877286 PMC11773390 78 Ding Z Wang L Sun J Zheng L Tang Y Tang H Hepatocellular carcinoma: pathogenesis, molecular mechanisms, and treatment advances Front Oncol 2025 15 1526206 10.3389/fonc.2025.1526206 40265012 PMC12011620 79 Lin X Kang K Chen P Zeng Z Li G Xiong W Regulatory mechanisms of PD-1/PD-L1 in cancers Mol Cancer 2024 23 108 10.1186/s12943-024-02023-w 38762484 PMC11102195 80 Tan Y Zhu Q Yang M Yang F Zeng Q Jiang Z Tetrandrine activates STING/TBK1/IRF3 pathway to potentiate anti-PD-1 immunotherapy efficacy in non-small cell lung cancer Pharmacol Res 2024 207 107314 10.1016/j.phrs.2024.107314 39059614 81 Zhang J Yu S Peng Q Wang P Fang L Emerging mechanisms and implications of cGAS-STING signaling in cancer immunotherapy strategies Cancer Biol Med 2024 21 45 64 10.20892/j.issn.2095-3941.2023.0440 38172538 PMC10875285 82 Yue B Gao W Lovell JF Jin H Huang J The cGAS-STING pathway in cancer immunity: dual roles, therapeutic strategies, and clinical challenges Essays Biochem 2025 69 EBC20253006 10.1042/EBC20253006 40052963 PMC12204001 83 Hines JB Kacew AJ Sweis RF The development of STING agonists and emerging results as a cancer immunotherapy Curr Oncol Rep 2023 25 189–99 10.1007/s11912-023-01361-0 36705879 PMC10994474 84 Wang B Yu W Jiang H Meng X Tang D Liu D Clinical applications of STING agonists in cancer immunotherapy: current progress and future prospects Front Immunol 2024 15 1485546 10.3389/fimmu.2024.1485546 39421752 PMC11483357 85 Wehbe M Wang-Bishop L Becker KW Shae D Baljon JJ He X Nanoparticle delivery improves the pharmacokinetic properties of cyclic dinucleotide STING agonists to open a therapeutic window for intravenous administration J Control Release 2021 330 1118–29 10.1016/j.jconrel.2020.11.017 33189789 PMC9008741 86 Xu X Wang X Liao YP Luo L Nel AE Reprogramming the tolerogenic immune response against pancreatic cancer metastases by lipid nanoparticles delivering a STING agonist plus mutant KRAS mRNA ACS Nano 2025 19 8579–94 10.1021/acsnano.4c14102 40025875 PMC11912578 87 Nakamura T Sato T Endo R Sasaki S Takahashi N Sato Y STING agonist loaded lipid nanoparticles overcome anti-PD-1 resistance in melanoma lung metastasis via NK cell activation J Immunother Cancer 2021 9 e002852 10.1136/jitc-2021-002852 34215690 PMC8256839 88 Dekker E Tanis PJ Vleugels JLA Kasi PM Wallace MB Colorectal cancer Lancet 2019 394 1467–80 10.1016/S0140-6736(19)32319-0 31631858 89 Chon HJ Kim H Noh JH Yang H Lee WS Kong SJ STING signaling is a potential immunotherapeutic target in colorectal cancer J Cancer 2019 10 4932–8 10.7150/jca.32806 31598165 PMC6775531 90 Huang KC Chiang SF Chang HY Hong WZ Chen JY Lee PC Colorectal cancer-specific IFNβ delivery overcomes dysfunctional dsRNA-mediated type I interferon signaling to increase the abscopal effect of radiotherapy J Immunother Cancer 2024 12 e008515 10.1136/jitc-2023-008515 38749537 PMC11097864 91 Yang Y Qi J Hu J Zhou Y Zheng J Deng W Lovastatin/SN38 co-loaded liposomes amplified ICB therapeutic effect via remodeling the immunologically-cold colon tumor and synergized stimulation of cGAS-STING pathway Cancer Lett 2024 588 216765 10.1016/j.canlet.2024.216765 38408604 92 Liu C Wang X Qin W Tu J Li C Zhao W Combining radiation and the ATR inhibitor berzosertib activates STING signaling and enhances immunotherapy via inhibiting SHP1 function in colorectal cancer Cancer Commun (Lond) 2023 43 435–54 10.1002/cac2.12412 36855844 PMC10091106 93 Shen D Luo J Chen L Ma W Mao X Zhang Y PARPi treatment enhances radiotherapy-induced ferroptosis and antitumor immune responses via the cGAS signaling pathway in colorectal cancer Cancer Lett 2022 550 215919 10.1016/j.canlet.2022.215919 36116741 94 Saha S Ghosh M Li J Wen A Galluzzi L Martinez LA Serine depletion promotes antitumor immunity by activating mitochondrial DNA-mediated cGAS-STING signaling Cancer Res 2024 84 2645–59 10.1158/0008-5472.CAN-23-1788 38861367 PMC11326969 95 Fang L Hao Y Yu H Gu X Peng Q Zhuo H Methionine restriction promotes cGAS activation and chromatin untethering through demethylation to enhance antitumor immunity Cancer Cell 2023 41 1118 1133.e12 10.1016/j.ccell.2023.05.005 37267951 96 Wang L Zhang T Zheng Y Li Y Tang X Chen Q Combination of irinotecan silicasome nanoparticles with radiation therapy sensitizes immunotherapy by modulating the activation of the cGAS/STING pathway for colorectal cancer Mater Today Bio 2023 23 100809 10.1016/j.mtbio.2023.100809 37779919 PMC10540048 97 Li J Hubisz MJ Earlie EM Duran MA Hong C Varela AA Non-cell-autonomous cancer progression from chromosomal instability Nature 2023 620 1080–8 10.1038/s41586-023-06464-z 37612508 PMC10468402 ",
  "metadata": {
    "Title of this paper": "Non-cell-autonomous cancer progression from chromosomal instability",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484178/"
  }
}