{
  "title": "Paper_636",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12481623 PMC12481623.1 12481623 12481623 41035574 10.7759/cureus.91328 1 Emergency Medicine Gastroenterology A Case of Cecal Volvulus Successfully Managed With Transnasal Ileus Tube Decompression Followed by Elective Laparoscopic Ileocecal Resection Muacevic Alexander Adler John R Hirohara Masayoshi 1 Tsuchida Hiroyoshi 1 Uemura Shuichiro 1 Ozaki Yuhi 1 Saida Shin 1 Koike Nobusada 1  1 Masayoshi Hirohara mozck551@gmail.com 31 8 2025 8 2025 17 8 494304 e91328 31 8 2025 31 08 2025 01 10 2025 02 10 2025 Copyright © 2025, Hirohara et al. 2025 Hirohara et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/403305-a-case-of-cecal-volvulus-successfully-managed-with-transnasal-ileus-tube-decompression-followed-by-elective-laparoscopic-ileocecal-resection Cecal volvulus is a rare but potentially life-threatening cause of colonic obstruction. Emergency surgery is standard but is associated with high morbidity and mortality, especially in high-risk patients. Therefore, non-operative management may be an important alternative in selected cases. A 90-year-old man presented to the emergency department with abdominal distension and pain. He was diagnosed with cecal volvulus without evidence of intestinal necrosis, accompanied by right lower lobe atelectasis and pleural effusion, both attributed to compression of the lung secondary to massive colonic distension. Given the absence of necrosis and the high anesthetic risk associated with advanced age and underlying pulmonary compromise, non-operative management was initiated using a transnasal ileus tube. Successful detorsion was confirmed on day 7 post-insertion, and the patient was discharged. Elective laparoscopic ileocecal resection was performed subsequently to prevent recurrence. Postoperative pneumonia was noted, but no other complications occurred, and the patient was discharged on postoperative day 19. At the 11-month follow-up, the patient remained in good health with no evidence of recurrence. We report a case of cecal volvulus without intestinal necrosis successfully managed by transnasal ileus tube decompression followed by elective laparoscopic ileocecal resection. This approach may be a viable option to avoid emergency surgery in high-risk patients and expands the therapeutic options for elderly individuals. cecal volvulus colon volvulus repair surgery decompression tube ileocecal resection laparoscopic repair pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Cecal volvulus is the second most common type of colonic volvulus, following sigmoid volvulus, and typically occurs due to inadequate fixation of the cecum to the posterior abdominal wall [ 1 2 3 Here, we report a case illustrating the successful application of this strategy in a high-risk elderly patient, demonstrating its potential as an alternative to emergency surgery. We present a case of a 90-year-old male patient with cecal volvulus who did not exhibit signs of intestinal ischemia. He developed right lower lobe atelectasis and pleural effusion caused by compression of the lung due to massive colonic distension. The condition was successfully managed with decompression using a transnasal ileus tube, followed by elective laparoscopic right hemicolectomy to prevent recurrence. Case presentation A 90-year-old man presented to the emergency department in September 2024 with a two-day history of abdominal distension and pain. His medical history included hypertension, dyslipidemia, chronic constipation, and a laparoscopic cholecystectomy two years prior. Upon arrival at the emergency department, vital signs were stable (BP 119/69 mmHg, HR 90 bpm, temp 36.8°C, RR 18/min). Physical examination revealed generalized abdominal distension with mild epigastric tenderness without rebound tenderness. Blood tests revealed a mildly elevated CRP level of 34.1 mg/L, while white blood cell count (7.13 ×10⁹/L) and lactate dehydrogenase (2.65 μkat/L) were within normal ranges, supporting the absence of bowel necrosis (Table 1 1 2 Figure 1 CT scan showed cecal dilation consistent with cecal volvulus Non-contrast CT on admission showing marked cecal dilatation consistent with cecal volvulus. No free air or signs of bowel necrosis are observed. Figure 2 CT scan showed right lower lobe atelectasis and pleural effusion Non-contrast CT on admission showing right lower lobe atelectasis and pleural effusion. These findings contributed to the patient’s increased perioperative risk. Table 1 Laboratory findings on admission Laboratory tests showed a mildly elevated C-reactive protein (CRP) level, while white blood cell count and lactate dehydrogenase remained within normal ranges, suggesting the absence of bowel necrosis. Parameter Value (SI units) Reference range WBC (×10⁹/L) 7.13 3.5–9.0 RBC (×10¹²/L) 3.58 4.3–5.7 Hemoglobin (g/L) 116 135–175 Platelets (×10⁹/L) 169 150–350 Total protein (g/L) 56 66–83 Albumin (g/L) 33 35–50 Total bilirubin (μmol/L) 12 3.4–20.5 Alkaline phosphatase (μkat/L) 0.75 0.50–1.67 Aspartate aminotransferase (μkat/L) 0.317 0.17–0.67 Alanine aminotransferase (μkat/L) 0.15 0.17–0.83 Lactate dehydrogenase (μkat/L) 2.651 2.25–3.75 γ-Glutamyltransferase (μkat/L) 0.3 0.17–0.92 Blood urea nitrogen (mmol/L) 4.64 2.5–7.1 Creatinine (μmol/L) 61 44–106 Estimated GFR (mL/min/1.73 m²) 80 ≥60 Sodium (mmol/L) 135 135–145 Potassium (mmol/L) 4.1 3.5–5.0 Chloride (mmol/L) 101 98–107 Amylase (μkat/L) 1.15 0.33–1.67 C-reactive protein (mg/L) 34.1 < 3.0 Given the patient's advanced age and complications, including atelectasis and pleural effusion, emergency surgery was considered high-risk. Since there were no signs of intestinal necrosis, conservative management with transnasal ileus tube decompression was initiated. Under fluoroscopic guidance, the transnasal tube was advanced into the small intestine just proximal to the dilated cecum (Figure 3 4 Figure 3 Transnasal ileus tube insertion proximal to the dilated colon Abdominal radiograph showing transnasal ileus tube positioned in the small intestine proximal to the dilated cecum. Figure 4 A follow-up abdominal radiograph confirmed resolution of the volvulus Follow-up abdominal radiograph on hospital day 7 showing resolution of the cecal volvulus. The previously dilated cecum has returned to normal caliber, confirming successful decompression after transnasal ileus tube placement. Discussion The treatment strategy for cecal volvulus depends primarily on the presence or absence of intestinal necrosis. In cases with any doubts of cecal necrosis, emergency surgical intervention is mandatory, with treatment options including resection with primary anastomosis or resection with stoma formation. Resection with anastomosis has been associated with a reported morbidity of 29%, mortality of 22%, and a recurrence rate of 0% [ 4 Even in the absence of intestinal necrosis, emergency surgery remains the standard treatment. Surgical options include simple detorsion, detorsion with cecopexy, or resection with anastomosis. For prevention of recurrence, detorsion with cecopexy or resection with anastomosis is recommended, with reported recurrence rates of 13% and 0%, respectively [ 4 5 5 Non-operative interventions, such as colonoscopic reduction or decompression via transanal ileus tube insertion, have been reported in selected cases without signs of ischemia. Colonoscopic reduction has a low success rate (14%) and carries a risk of perforation and is not generally recommended [ 5 3 Resolution of the volvulus in the present case was confirmed on an abdominal radiograph seven days after tube insertion. To date, only a single case of non-operative management of cecal volvulus using a transanal ileus tube has been reported [ 3 The principal benefit of non-operative decompression in cases of cecal volvulus without signs of intestinal ischemia is the potential to avoid emergency surgery. Emergency surgical procedures are known to carry significantly higher risks of postoperative complications and mortality compared to elective operations. In the present case, the patient’s advanced age and complications such as atelectasis placed him at particularly high risk for emergency surgery. According to the NSQIP surgical risk calculator (American College of Surgeons, Chicago, IL, USA), the estimated complication and mortality rates for emergency partial colectomy with anastomosis were 38.6% and 23.8%, respectively, whereas elective colectomy would reduce these rates to 24.8% and 8.3%, respectively. In addition, the presence of concurrent atelectasis was associated with a 2.3-fold increase in postoperative pneumonia risk [ 6 Although there are several reports suggesting that cecal volvulus without intestinal necrosis may be non-operatively resolved through colonoscopic reduction or ileus tube insertion, it must be acknowledged that this approach carries the inherent risk of progression to intestinal necrosis. It has been reported that in cases where intestinal necrosis develops, emergency surgery is associated with a mortality rate more than twice as high as that of emergency surgery performed in the absence of necrosis [ 7 8 9 This case highlights that transnasal ileus tube decompression may represent a viable alternative to emergency surgery in carefully selected high-risk patients. While the current evidence is limited, further studies are warranted to evaluate the safety, efficacy, and optimal selection criteria for broader clinical application in cases of cecal volvulus. Conclusions In conclusion, successful decompression and resolution of cecal volvulus without intestinal necrosis were achieved in a high-risk patient through transnasal ileus tube placement, subsequently allowing for elective surgery. These observations suggest that transnasal decompression may serve as a bridge strategy in carefully selected patients. Nevertheless, surgical management remains the established standard of care, and non-operative approaches should be reserved for select circumstances. Further accumulation of clinical experience and systematic investigations will be essential to clarify the safety, efficacy, and appropriate indications for this approach. Disclosures Human subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: References 1 Colonic volvulus. Diagnosis and results of treatment in 82 patients Eur J Surg Hiltunen KM Syrjä H Matikainen M 607 611 158 1992 https://pubmed.ncbi.nlm.nih.gov/1363066/ 1363066 2 Endoscopic detorsion using single-balloon endoscopy for cecal volvulus Dig Endosc Suzuki H Yamamura T Fujishiro M 149 32 2020 31597202 10.1111/den.13558 3 Case of cecal volvulus successfully treated with endoscopic colopexy Asian J Endosc Surg Sakamoto Y Hiyoshi Y Sakata K 402 404 11 2018 29322628 10.1111/ases.12460 4 Cecal volvulus Dis Colon Rectum Rabinovici R Simansky DA Kaplan O Mavor E Manny J 765 769 33 1990 https://pubmed.ncbi.nlm.nih.gov/2202566/ 2202566 10.1007/BF02052323 5 The American Society of Colon and Rectal Surgeons Clinical Practice Guidelines for the Management of Colonic Volvulus and Acute Colonic Pseudo-Obstruction Dis Colon Rectum Alavi K Poylin V Davids JS 1046 1057 64 2021 34016826 10.1097/DCR.0000000000002159 6 Is atelectasis related to the development of postoperative pneumonia? a retrospective single center study BMC Anesthesiol Ko E Yoo KY Lim CH Jun S Lee K Kim YH 77 23 2023 36906539 10.1186/s12871-023-02020-4 PMC10007747 7 Volvulus of the colon. Incidence and mortality Ann Surg Ballantyne GH Brandner MD Beart RW Jr Ilstrup DM 83 92 202 1985 https://pubmed.ncbi.nlm.nih.gov/4015215/ 4015215 10.1097/00000658-198507000-00014 PMC1250842 8 CT prognostic signs of postoperative complications in emergency surgery for acute obstructive colonic cancer Radiol Med Pezzullo F Comune R D'Avino R 525 535 129 2024 38512630 10.1007/s11547-024-01778-y 9 Acute colonic pseudo-obstruction in polytrauma patients J Trauma Acute Care Surg Johnny CS Schlegel RN Balachandran M 614 622 97 2024 38769618 10.1097/TA.0000000000004392 ",
  "metadata": {
    "Title of this paper": "Acute colonic pseudo-obstruction in polytrauma patients",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481623/"
  }
}