{
  "title": "Paper_39",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490246 PMC12490246.1 12490246 12490246 40925375 10.1016/j.xcrm.2025.102328 S2666-3791(25)00401-X 102328 1 Article Targeting USP21 to inhibit abdominal aortic aneurysm progression by suppressing the phenotypic transition of vascular smooth muscle cells Zhang Huidan 1 2 3 4 5 6 Yue Hongwei 1 2 3 4 5 6 Sun Yijun 1 2 3 4 5 6 Sun Guangqi 1 2 3 4 5 Yang Kehui 1 2 3 4 5 Jiang Tangxing 1 2 3 4 5 Cui Sumei 1 2 3 4 5 Liu Yang 1 2 3 4 5 Guo Yunyun 1 2 3 4 5 Zhang Wencheng 5 Zhang Cheng 5 Chen Yuguo chen919085@sdu.edu.cn 1 2 3 4 5 ∗ Xu Feng xufengsdu@126.com 1 2 3 4 5 7 ∗∗ 1 2 3 4 5 ∗ chen919085@sdu.edu.cn ∗∗ xufengsdu@126.com 6 These authors contributed equally 7 Lead contact 16 9 2025 08 9 2025 6 9 498186 102328 25 3 2025 26 6 2025 7 8 2025 08 09 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary Abdominal aortic aneurysm (AAA) is a life-threatening condition lacking effective treatment. We investigate the role of the deubiquitinating enzyme USP21 in AAA development. Proteomic analysis reveals significant upregulation of USP21 in murine and human abdominal aortic tissues. Using USP21 global knockout models induced by angiotensin II or porcine pancreatic elastase (PPE), and vascular smooth muscle cell (VSMC)-specific models, we assess USP21’s impact on AAA. Coimmunoprecipitation and mass spectrometry identify downstream targets of USP21. USP21 exacerbates AAA by stabilizing aldehyde dehydrogenase 2 (ALDH2) and promoting VSMC dedifferentiation and phenotypic changes. Pharmacological inhibition of USP21 with disulfiram shows therapeutic potential against AAA progression, with efficacy reduced in ALDH2 E506K Graphical abstract Highlights • USP21 is upregulated and facilitates AAA by accelerating VSMC phenotypic switching • USP21 stabilizes ALDH2 protein homeostasis by removing the K48-linked ubiquitin chain • ALDH2 knockout or the ALDH2 E506K • Disulfiram inhibits USP21 to hinder AAA, but its efficacy is reduced in ALDH2 E506K Zhang et al. discover that USP21 is aberrantly upregulated in abdominal aortic tissue, driving the dedifferentiation of vascular smooth muscle cells (VSMCs) through the deubiquitination of ALDH2. The suppression of USP21 using the clinically approved drug disulfiram effectively mitigates AAA development and progression in mice. Keywords abdominal aortic aneurysm deubiquitinating enzymes USP21 aldehyde dehydrogenase 2 VSMC phenotypic switch pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: September 8, 2025 Introduction Abdominal aortic aneurysm (AAA) is characterized by localized dilation of the abdominal aorta, 1 , 2 3 4 , 5 6 7 The main pathological alteration of AAA is rooted in the degeneration of the aortic media. 3 , 8 9 , 10 11 Post-translational modification (PTM) of different proteins by the ubiquitin-proteasome system is essential for protein homeostasis, cellular localization, and function. 12 13 , 14 15 , 16 17 , 18 19 In the present study, by employing proteomic screening, we identified USP21 as key contributor of AAA via exuberating the pathological phenotypic transition of VSMCs to aggravate ECM degradation and vascular inflammation. Multiple genetic mouse models were utilized to investigate the role and mechanism of USP21 in AAA development. Importantly, targeting USP21 using the clinically approved drug disulfiram effectively mitigated AAA in mice. Our study therefore provides valuable insights into the mechanisms underlying AAA pathogenesis and highlights disulfiram as a promising therapeutic strategy for AAA treatment. Results USP21 is markedly upregulated in human and mouse AAA tissues To identify key candidate proteins implicated in AAA, we conducted proteomic profiling and analysis on abdominal aortic tissues obtained from both saline control mice and those with AAA induced by angiotensin II (Ang II) ( Figure 1 Figure S1 Figures 1 S1 Figure S1 Figures 1 S1 Figures 1 Figures 1 Figure 1 USP21 is markedly upregulated in human and mouse AAA tissues (A) Heatmap showing differentially expressed deubiquitinating enzyme genes in abdominal aortas from PCSK9 D377Y D377Y n (B and C) Representative western blot (B) and quantification for USP21 (C) in PCSK9 D377Y D377Y n (D and E) Representative western blot (D) and quantification for USP21 (E) in the abdominal aorta of control patients and the aortas of patients with AAA. n (F and G) Representative images of immunohistochemical staining (F) and quantification of USP21 (G) in the abdominal aorta of healthy control and the aortas of patients with AAA. Scale bar, 100 μm (above) and 50 μm (below). n (H and I) Representative images of immunohistochemical staining (H) and quantification of USP21 (I) in PCSK9 D377Y D377Y n (J) The expressions and distributions of USP21 (red), α-SMA (green), and nuclei (DAPI, blue) in the abdominal aorta of AAA patients and the healthy control. Scale bar, 50 μm. n (K) The expressions and distributions of USP21 (red), α-SMA (green), and nuclei (DAPI, blue) in the abdominal aorta of PCSK9 D377Y D377Y n Data are expressed as mean ± SEM. (C, E, G, and I): unpaired two-tailed Student’s t tests. Considering that the vessel is composed by different cell types including VSMCs, macrophages, adventitial fibroblasts, and endothelial cells, we then profiled the expression pattern of USP21 in these different cell types. The immunofluorescence staining of aortic sections demonstrated markedly increased USP21 protein, predominantly located in VSMCs from both human ( Figure 1 Figure 1 Figures S2 in vitro Figures S3 Figures S3 Global USP21 knockout mitigates AAA development in vivo To elucidate the role of USP21 in the pathology of AAA, we generated global USP21 knockout (USP21 KO Figure S4 Figure S4 D377Y Figure 2 KO Figure S4 KO Figures S4 KO Figures 2 S4 KO Figures 2 KO Figure 2 Figures 2 KO Figures 2 Figure 2 Global USP21 knockout mitigates Ang II-induced AAA (A) Schematic protocol. Eight-week-old USP21 KO D377Y n n KO n KO n (B) Survival curves in the indicated groups. n (C) The incidence of AAA for each group 4 weeks post-Ang II treatment. (D) Representative morphology of aortas in indicated groups with Ang II or saline treatment for 4 weeks. Scale bar, 0.5 cm. (E) Statistical results of maximal aortic diameter of ultrasound at weeks 0, 1, 2, and 4 post-Ang II treatment in indicated groups. n (F) Ultrasound images of the abdominal aorta in indicated groups. n (G–K) Representative images of H&E (G), Masson staining (H) and corresponding quantification (I), and EVG staining (J) and corresponding quantification (K) for the mouse abdominal aortas in indicated groups 4 weeks post-Ang II treatment; scale bar, 200 μm (left) and 50 μm (right). Red arrowheads indicate elastin breaks. n Data are expressed as mean ± SEM. (C): Fisher’s exact test; (E, I, and K): two-way ANOVA followed by Bonferroni post hoc Subsequently, we validated these observations using a second murine model of AAA, specifically through periaortic elastase application ( Figure S5 Figures S5 Figures S5 USP21 in VSMCs promotes Ang II-induced AAA Given the pronounced upregulation of USP21 in VSMCs in AAA, we further investigated the contribution of USP21 expressed in VSMCs to the development and progression of AAA. The VSMC-specific USP21 knockdown virus was constructed ( Figure S6 Figure 3 Figures S6 Figure S6 Figure S6 Figure S6 Figures S6 Figure 3 Figures 3 S6 Figures 3 Figures 3 Figure 3 VSMC-specific USP21 knockdown improves Ang II-induced AAA (A) Schematic protocol. Eight-week-old C57BL/6 mice were injected with AAV9-KD-USP21 or its control virus AAV9-NC 4 weeks prior to saline or angiotensin II (Ang II, 1,000 ng/kg/min) infusion for 4 weeks, monitored for aortic dilation and blood pressure, and euthanized at the indicated time point. Saline + AAV9-NC, n n n n (B) Survival curves in indicated groups. n (C) The incidence of AAA for each group 4 weeks post-Ang II treatment. (D) Representative morphology of aortas in indicated groups with Ang II or saline treatment for 4 weeks. Scale bar, 0.5 cm. (E) Statistical results of maximal aortic diameter of ultrasound at weeks 0, 1, 2, and 4 post-Ang II treatment in indicated groups. n (F) Ultrasound images of the abdominal aorta in indicated groups. n (G–K) Representative images of H&E (G), Masson staining (H) and corresponding quantification (I), and EVG staining (J) and corresponding quantification (K) for the mouse abdominal aortas in indicated groups 4 weeks post-Ang II treatment; scale bar, 200 μm (left) and 50 μm (right). Red arrowheads indicate elastin breaks. n Data are expressed as mean ± SEM. (C): Fisher’s exact test; (E, I, and K): two-way ANOVA followed by Bonferroni post hoc Deleterious effect on AAA development was observed when overexpressing USP21 in mice ( Figure S8 Figures S7 Figure S7 Figure S7 Figure S7 Figures S7 Figure S8 Figure S8 Figures S8 Figures S8 USP21 promotes Ang II-induced VSMC phenotypic transformation in AAA We then proceeded to dissect the pathological mechanism underlying USP21-promoted AAA. According to our proteomic data, VSMC contractile phenotype and inflammatory response were enriched as altered signal pathway upon AAA development ( Figure S1 11 , 20 Figures S9 Figures 4 in vitro Figures S10 21 , 22 23 , 24 , 25 KO Figures 4 S11 In vitro Figure S10 KO Figures 4 S11 Figure 4 USP21 promotes Ang II-induced VSMC phenotypic transformation (A–C) Representative western blot (A) and quantification for SMMHC (B) and SM22α (C) in abdominal aorta tissues obtained from saline-infused mice or Ang II-infused AAA mice. These mice were infected with either the empty control virus (AAV9-vector) or the USP21 knockdown virus (AAV9-KD-USP21). n (D–F) Representative western blot (D) and quantification for MMP9 (E) and OPN (F) in abdominal aorta tissues obtained from saline-infused mice or Ang II-infused AAA mice. These mice were infected with either the empty control virus (AAV9-vector) or the USP21 knockdown virus (AAV9-KD-USP21). n (G–J) Representative photograph of immunohistochemical staining (G and I) and quantification of MMP9 (H and J) in indicated groups; scale bar, 200 μm (left) and 50 μm (right). n (K–P) Concentrations of MMP9 (K and L), IL-6 (M and N), and MCP-1 (O and P) in plasma from mouse in indicated groups. n Data are expressed as mean ± SEM. (B, C, E, F, H, J, K, L, M, N, O, and P): two-way ANOVA followed by Bonferroni post hoc Identification of ALDH2 as a downstream molecule of USP21 and their altered interaction in AAA DUBs exert their regulatory effects on diseases by modulating ubiquitin modification and stability of its downstream substrate proteins. 26 27 , 28 , 29 Figure 5 Figure S12 Figures S12 5 Figures S12 5 Figure 5 Figures 5 Figures 5 Figures 5 Figure 5 Identification of ALDH2 as a downstream molecule of USP21 and their altered interaction in AAA (A) Schematic illustration of quantitative proteomic screen for USP21 target. (B) The Venn diagram illustrating the overlapped proteins upregulated in both the total mouse AAA tissue and those in USP21 interactome. (C) Coimmunoprecipitation and western blot detection of USP21 and ALDH2 in HASMCs treated with or without Ang II. Endogenous USP21 was immunoprecipitated by anti-USP21 antibody, and ALDH2 was immunoblotted by anti-ALDH2. n (D–F) Coimmunoprecipitation and western blot detection of USP21 and ALDH2 in HASMCs treated with or without Ang II (D), human tissues (E), and mouse tissues (F). Endogenous ALDH2 was immunoprecipitated by anti-ALDH2 antibody, and USP21 was immunoblotted by anti-USP21 antibody. n (G) The expressions and distributions of USP21 (red), ALDH2 (green), and nuclei (DAPI, blue) in the abdominal aortas of control or AAA patients. Scale bar, 50 μm. n (H) The expressions and distributions of USP21 (red), ALDH2 (green), and nuclei (DAPI, blue) in the abdominal aortas of saline- or Ang II-induced AAA mice. Scale bar, 50 μm. n (I) Schematic structures of USP21 and ALDH2, together with their truncated mutants. (J) CoIP showing that the C-terminal domain of USP21 is essential for the interaction with ALDH2. n (K) CoIP showing that the N-terminal domain of ALDH2 is essential for the interaction with USP21. n (L) Virtual docking modeling the interaction between USP21 (purple) and ALDH2 protein (cyan). (M) GST pull-down assay of the direct interaction between USP21 and ALDH2. Interaction of the in vitro n We further specified the interaction domain within USP21 and ALDH2 by truncating USP21 to the N-terminal (1–220) and C-terminal domains (221–565) and ALDH2 to the N-terminal (1–289) and C-terminal domains (290–517) ( Figure 5 Figures 5 https://gramm.compbio.ku.edu/request Figure 5 in vitro Figure 5 USP21 enhances ALDH2 protein stability through deubiquitylation of K48-linked conjugation We further clarified the effect of USP21 on ALDH2 protein ubiquitination and stability. As shown in Figures 6 KO Figures S12 in vitro Figure 6 Figures 6 Figure 6 Figures 6 Figure 6 Figure 6 Figure 6 Figure 6 USP21 enhances ALDH2 protein stability through deubiquitylation of K48-linked conjugation (A and B) Immunoprecipitation and western blot analysis of ALDH2 ubiquitination in human aorta tissue from AAA patients (A) and mouse aorta tissue (B) treated with or without Ang II. Endogenous ALDH2 was immunoprecipitated by anti-ALDH2 antibody. The ubiquitination level of ALDH2 was immunoblotted by anti-ubiquitin antibody. n (C) HASMCs were transfected with small interfering RNA (siRNA) against USP21 (USP21 siRNA) or negative control (scramble siRNA), followed by treatment with or without Ang II (1 μM for 24 h). MG132 (10 μM) was applied 12 h before the collection of HASMCs. Coimmunoprecipitation of ALDH2 and ubiquitin was performed, with endogenous ALDH2 immunoprecipitated using an anti-ALDH2 antibody. n (D) Representative western blot for USP21 and ALDH2 in HASMCs transfected with plasmids of His-USP21. n (E and F) HASMCs were transfected with scramble siRNA or USP21 siRNA and then treated with CHX (100 μg/mL) for the indicated time periods. Representative western blot of ALDH2 (E) and quantification of ALDH2 level (F). n (G and H) HASMCs were transfected with scramble siRNA or USP21 siRNA and then treated with Ang II (1 μM for 24 h). MG132 (10 μM) or CQ (50 μM) was applied for 12 h before the collection of HASMCs. Representative western blot of ALDH2 (G) and quantification of ALDH2 (H) were performed. n (I) Immunoprecipitation and western blot analysis of ALDH2 ubiquitination in HEK293T cells that co-transfected with plasmids of His-USP21, FLAG-ALDH2, and HA-Ub (WT, K48, and K63). MG132 (10 μM) was applied 12 h before the collection of HEK293T. Ubiquitinated ALDH2 was detected by immunoblotting via anti-FLAG antibody. n (J) Schematic illustration of the domain structures and the specific enzymatic active sites of USP21 protein. (K) Immunoprecipitation and western blot analysis of ALDH2 ubiquitination in HEK293T cells that co-transfected with plasmids of FLAG-ALDH2, HA-Ub, His-USP21, His-USP21-C221A, His-USP21-H518A, and His-USP21-D534A. MG132 (10 μM) was applied 12 h before the collection of HEK293T. ALDH2 was immunoprecipitated by anti-FLAG antibody, and the ubiquitination signal was detected by anti- hemagglutinin (HA) antibody. n Data are expressed as mean ± SEM. (F and H): one-way ANOVA followed by Tukey post hoc ALDH2 has a common G-to-A polymorphism (ALDH2 rs671) that replaces glutamic acid (Glu) with lysine (Lys), a loss-of-function missense mutation, which plays an important role in cardiovascular diseases. 30 , 31 WT E506K Figures S13 E506K WT Figures S13 ALDH2 knockout ameliorated AAA induced by USP21 overexpression To investigate the role of ALDH2 in USP21-induced AAA, we further employed globally ALDH2 knockout (ALDH2 KO Figure S14 Figure S14 WT KO Figure S15 WT KO WT Figures S15 KO WT Figures S15 WT KO Figures S15 WT KO Figures S16 Consistent results were obtained when overexpressing USP21 in the ALDH2 E506K Figures S14 S17 Figure S17 Figure S17 Figures S17 E506K WT Figures S17 S18 Pharmacological inhibition of USP21 by small-molecule inhibitor disulfiram alleviates AAA The aforementioned findings uncovered the role of USP21 in AAA regulation, suggesting the potential therapeutic implications by targeting USP21. Recent studies have reported that, disulfiram, a commonly used clinical drug for the treatment of alcohol dependence, can selectively inhibit the activity of USP21. 32 Figure 7 WT E506K Figure 7 Figures S19 Figure 7 WT Figures 7 WT Figures 7 E506K 30 WT E506K Figures 7 Figure 7 Pharmacological inhibition of USP21 by small-molecule inhibitor disulfiram alleviated AAA (A) Structures of USP21 (catalytic domain: green; ubiquitin: cyan) is aligned and enlarged view of the dotted box. (B) Schematic protocol. Eight-week-old ALDH2 WT KO WT n WT n E506K n E506K n (C) Survival curves in indicated groups. n (D) The incidence of AAA for each group 4 weeks post-Ang II treatment in indicated groups. (E) Representative morphology of aortas in indicated groups with Ang II or saline treatment for 4 weeks in indicated groups. Scale bar, 0.5 cm. (F) Statistical results of maximal aortic diameter of ultrasound at weeks 0, 1, 2, and 4 post-Ang II treatment in indicated groups. n (G) Ultrasound images of the abdominal aorta in indicated groups. n (H–L) Representative images of H&E (H), Masson staining (I) and corresponding quantification (J), and EVG staining (K) and corresponding quantification (L) for the mouse abdominal aortas in indicated groups 4 weeks post-Ang II treatment; scale bar, 200 μm (left) and 50 μm (right). Red arrowheads indicate elastin breaks. n Data are expressed as mean ± SEM. (D): Fisher’s exact test; (F, J, and L): two-way ANOVA followed by Bonferroni post hoc Discussion In this study, we have uncovered several key findings regarding the role of USP21 in AAA. First, we demonstrate that the deubiquitinating enzyme USP21 is significantly upregulated in both human and mouse AAA tissues. Second, USP21 acts as a critical pathogenic factor in AAA by exacerbating the pathological phenotypic transformation of VSMCs from a contractile to a pro-synthetic or pro-inflammatory phenotype. Third, the upregulated USP21 directly interacts with ALDH2, stabilizing ALDH2 protein homeostasis through K48-linked deubiquitylation, thereby promoting AAA development. Finally, pharmacological inhibition of USP21 using the clinically available disulfiram effectively reduces the incidence of AAA. Ubiquitination is a fundamental PTM essential for protein fate determination and cellular function. 33 34 , 35 36 , 37 38 , 39 , 40 28 , 41 , 42 , 43 44 Conventionally, the function of DUBs is typically executed through binding to specific protein substrates. 45 , 46 27 , 28 , 29 47 30 , 31 30 The discovery that USP21 is a deubiquitinating enzyme for the ALDH2 protein has sparked our immense interest. We, as well as other groups, have demonstrated that ALDH2, the noted “Asian flush” gene, plays a key role in cardiovascular diseases. Research shows that the mutation rate of the ALDH2 rs671 locus in East Asian populations is between 30% and 50%, while its incidence in European and North American populations is typically below 5%. The mutation (G>A) occurs at a relatively consistent rate across different populations, regardless of gender. 31 , 48 30 , 49 WT E506K E506K E506K The pivotal role of DUBs in major diseases renders their pharmacological manipulation a promising therapeutic strategy. 50 , 51 52 53 , 54 WT E506K WT E506K To sum up, we found that USP21 exacerbates AAA development and vascular pathology through deubiquitinating and stabilizing ALDH2 and maintaining the dedifferentiated state of VSMCs. Suppressing USP21 using the clinically approved drug disulfiram could effectively mitigate AAA in mice. Our findings shed light on molecular mechanisms underlying AAA development and highlight the importance of USPs in AAA modulation. Importantly, this study provides important evidence for recommending disulfiram as a potential AAA medication approach. Besides, the unraveling of varying therapeutic efficacy of disulfiram in different ALDH2 genotypes implicates a concept for tailoring personalized treatment regimens for AAA patients. Limitations of the study In our study, we have provided substantial evidence for the role of USP21 in the development and progression of AAA using global knockout strategies and smooth muscle-specific overexpression or knockdown approaches. However, to more rigorously validate the central role of USP21 in medial smooth muscle cells and exclude the potential contributions from other cell types, such as adventitial fibroblasts, more precise cell-specific knockout mouse models are needed for further validation. Secondly, while our study has robustly demonstrated that USP21 is significantly upregulated in AAA tissues and contributes to AAA development and progression, the precise mechanisms underlying the upregulation of USP21 under AAA pathological conditions remain to be fully elucidated. We propose that pathological stimuli, such as Ang II and the infiltration of inflammatory factors, may play a crucial role in inducing the upregulation of USP21. This warrants further detailed research and would thereby provide a more comprehensive understanding of the pathogenesis of AAA. Besides, while disulfiram was employed as a USP21 inhibitor in AAA studies, its lack of specificity necessitates the development of more targeted and potent USP21 inhibitors, potentially leading to improved therapeutic strategies. Resource availability Lead contact Requests for further information, resources, and reagents should be directed to and will be fulfilled by the lead contact, Feng Xu ( xufengsdu@126.com Materials availability This study did not generate new, unique reagents. Data and code availability  • This paper does not report original code. • The proteomics data and proteomics data after immunoprecipitation reported in this paper have been found at Figshare Data and are publicly accessible at https://doi.org/10.6084/m9.figshare.29310944 https://doi.org/10.6084/m9.figshare.29412704 • Any additional information required to reanalyze the data reported in this paper is available from the lead contact Acknowledgments This work was supported by grants from the National Natural Science Foundation of China 82325031 82030059 U23A20485 Noncommunicable Chronic Diseases-National Science and Technology Major Project 2023ZD0505504 2023ZD0505500 Key R&D Program of Shandong Province 2022ZLGX03 Natural Science Foundation of Shandong Province ZR2022QH014 ZR2024QH037 Postdoctoral Science Foundation of China 2023TQ0197 2023M742126 Author contributions H.Z., H.Y., and Y.S. contributed equally to this work. H.Z., H.Y., and Y.S. acquired and analyzed the data and wrote the manuscript. H.Z., H.Y., G.S., and Y.S. performed part of the experiments and acquired data. T.J., G.S., Y.L., and Y.S. performed the bioinformatic analysis. K.Y., Y.G., and S.C. provided valuable suggestions about the experiment. C.Z., W.Z., and Y.G. participated in result discussion. F.X. and Y.C. designed the study protocol and corrected the manuscript. All authors discussed the results and contributed to the final manuscript. Declaration of interests The authors declare no competing interests. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies USP21 SantaCruz Biotechnology Cat#sc-515911; RRID: AB_3713486 USP21 Proteintech Cat#17856-1-AP; RRID: AB_2878453 ALDH2 Abcam Cat#ab227021; RRID: AB_2868491 Ubiquitin Cell Signaling Technolog Cat#3936; RRID: AB_331292 α-SMA Cell Signaling Technolog Cat#48938; RRID: AB_2799347 SMMHC Abcam Cat#ab124679; RRID: AB_10975311 SM22α Abcam Cat#ab14106; RRID: AB_443021 MMP9 Abcam Cat#ab228402; RRID: AB_2910609 Fibronectin Proteintech Cat#15613-1-AP; RRID: AB_2105691 OPN Proteintech Cat#22952-1-AP; RRID: AB_2783651 USP20 Proteintech Cat#17491-1-AP; RRID: AB_2212570 UCHL1 Proteintech Cat#14730-1-AP; RRID: AB_2210497 CD68 Abcam Cat#ab303565; RRID: AB_3075482 CD31 Cell Signaling Technolog Cat#15585; RRID: AB_3697581 Vimentin Abcam Cat#ab8978; RRID: AB_306907 GAPDH Abcam Cat#ab8245; RRID: AB_2107448 Flag Proteintech Cat#20543-1-AP; RRID: AB_11232216 GST Proteintech Cat#66001-2-Ig; RRID: AB_2881488 His Proteintech Cat#66005-1-Ig; RRID: AB_11232599 HA Proteintech Cat#51064-2-AP; RRID: AB_11042321 Alexa Fluor 488 donkey anti-rabbit secondary antibody Invitrogen Cat#A32790; RRID: AB_2762833 Alexa Fluor 488 donkey anti-mouse secondary antibody Invitrogen Cat#A32766; RRID: AB_2762823 Alexa Fluor 594 donkey anti-rabbit secondary antibody Invitrogen Cat#A21207; RRID: AB_141637 Alexa Fluor 594 donkey anti-mouse secondary antibody Invitrogen Cat#A21203; RRID: AB_2535789 Biological samples Human aorta samples Qilu Hospital of Shandong University N/A Chemicals, peptides, and recombinant proteins Angiotensin Ⅱ MedChemExpress Cat# HY-13948 Disulfiram Selleck Chemicals Cat# S1680 Porcine elastase Sigma-Aldrich Cat# E1250 Lipopolysaccharide Sigma-Aldrich Cat# 437627 MG132 Selleck Chemicals Cat# S2619 Chloroquine Selleck Chemicals Cat# S6999 interferon gamma Chamot Cat# CM081-100HP DAPI Invitrogen Cat# S36939 Fetal Bovine Serum Gibco Cat# A5256701 DMEM Medium Gibco Cat# C11995500BT Smooth Muscle Cell Medium ScienCell Cat#1101 Lipofectamine™ 3000 Invitrogen Cat# L3000015 P3000 Invitrogen Cat# L3000015 Lipofectamine RNAiMAX Invitrogen Cat# 13778075 Opti-MEM Thermo Fisher Scientific Cat# 31985070 Trypsin Gibco Cat# 25200072 Critical commercial assays Mouse MMP9 ELISA Kit Boster Biological Technology EK0466 Mouse MCP-1 ELISA Kit Boster Biological Technology EK0568 Mouse IL-6 ELISA Kit Boster Biological Technology EK0411 Acetate Assay Kit (Colorimetric) Abcam ab204719 BCA protein assay Thermo Scientific Cat#23225 Deposited data Proteomic data This paper Figshare Data: https://doi.org/10.6084/m9.figshare.29310944 Proteomic data after Immunoprecipitation This paper Figshare Data: https://doi.org/10.6084/m9.figshare.29412704 Experimental models: Cell lines Human Aortic Smooth Muscle Cells ScienCell #6110 Human Aortic Endothelial Cells ScienCell #6100 HEK293T American Type Culture Collection N/A Experimental models: Organisms/strains C57BL/6J Mice Laboratory Animal Center of ShanDong University N/A USP21 KO GemPharmatech Co., Ltd N/A ALDH2 KO University of Occupational and Environmental Health N/A ALDH2 E506K Viewsolid Biotech Co., Ltd N/A Oligonucleotides siRNA:USP21 This Study N/A Recombinant DNA Homo-USP21-C-HIS in PCDNA3.1 This Study N/A Homo-USP21(del1-211)-C-HIS in PCDNA3.1 This Study N/A Homo-USP21(del212-565)-C-HIS in PCDNA3.1 This Study N/A Homo-ALDH2-C-FLAG in PCDNA3.1 This Study N/A Homo-ALDH2(1–289)-C-FLAG in PCDNA3.1 This Study N/A Homo-ALDH2(290–517)-C-FLAG in PCDNA3.1 This Study N/A HOMO-UBB-N-HA in PCDNA3.1 This Study N/A HOMO-UBB(K63)-N-HA in PCDNA3.1 This Study N/A HOMO-UBB(K48)-N-HA in PCDNA3.1 This Study N/A Software and algorithms ImageJ https://imagej.nih.gov/ij/ N/A Graphpad Prism 8 https://www.graphpad.com N/A Experimental model and study participant details Human study and ethics statement Human abdominal aortic control samples were collected from six organ donors (five males and one female). Six samples were used for immunohistochemical and Western blot validation. All donors were deceased due to acute trauma or cerebral hemorrhage. The range of donor ages was 55–77 years, with a median age of 66 years. Human abdominal aortic aneurysm samples were obtained from six AAA patients undergoing open operative repair (four males and two females) and used for immunohistochemical and Western blot validation. The range of AAA patients ages was 63–81 years, with a median age of 67 years. Information regarding these tissue samples is provided in Table S1 Animal studies and ethics Experiments were approved by Ethics Review Board and Animal Research Committee of The QiLu Hospital, ShanDong University ( DWLL-2022-175 Male C57BL/6J mice (six-eight week) were purchased from Laboratory Animal Center of ShanDong University. Three genetic mouse models were included in this study. The globally USP21 knockout mice (USP21 KO Figure S4 KO E506K E506K E506K Table S3 Tables S4 S5 Method details AAA mouse models All mice were maintained in a specific pathogen-free (SPF) environment, ensuring optimal temperature and humidity for growth. They had unrestricted access to water and food and underwent a one-week acclimatization period prior to the commencement of the experiment. The PCSK9/Ang II-induced abdominal aortic aneurysm (AAA) model was established as previously detailed. 55 ∧11 D377Y 56 Echocardiography To assess changes in aortic width in mice, we utilized a high-resolution ultrasound imaging system (VisualSonics Vevo3100) to measure the maximum diameter of the abdominal aorta. The mice were anesthetized with 1.2–1.5 Vol % isoflurane, maintaining a heart rate of approximately 400 beats per minute during image acquisition. Quantification of Ang Ⅱ-induced aneurysms was determined by an increase in the suprarenal aortic width of 50% or more relative to the aortic diameter in saline-infused controls. Instances of aortic rupture were excluded from the aortic diameter analysis but were included in the analysis of aneurysm incidence. For data analysis, the diameters of the abdominal aorta were measured three times, and the averages were calculated to ensure accuracy. Blood pressure measurement The CODA tail-cuff system (Kent Scientific, USA) was employed for non-invasive blood pressure measurement in mice. Initially, the system was assembled, and the heating platform was preheated to a stable temperature of 37°C. Mice were then carefully positioned in a restrainer, ensuring that the head was secured in a nose cone to restrict any anterior-posterior movement. The tail was threaded through an aperture located at the rear of the apparatus. A pneumatic pressure cuff was affixed proximally on the tail, adjacent to the base, with a precision sensor placed immediately beside the cuff to ensure accurate readings. The protocol involved executing the measurement software to acquire blood pressure data, with each subject undergoing three consecutive measurements at 5-min intervals on the designated measurement day. Data were subjected to statistical analysis, focusing on parameters exhibiting variability of less than 5 mmHg to ensure reliability and accuracy. Adeno-associated virus and viral delivery protocol To achieve specific knockdown or overexpression of the USP21 gene in vascular smooth muscle cells, mice were administered an injection via the tail vein of a recombinant adeno-associated viral vector (AAV2/9) involving a sm22α-specific promoter. The knockdown group was represented by HBAAV2/9-SM22a-mir30-2- m m NM_013919 m ∧11 Figures S6 S7 Cell culture Different cell lines were selected to align with specific experimental objectives. Human aortic smooth muscle cells (HASMCs) were procured from ScienCell Research Laboratories and cultured in smooth muscle cell medium (ScienCell, 1001) at 37°C in a 5% CO 2 2 Adenovirus infection and siRNA transfection The USP21 knockdown group (USP21 siRNA) and the negative control group (scramble siRNA) were both obtained from GenePharma (Shanghai, China) for the purpose of knocking down endogenous USP21. The siRNA sequence for human USP21 was 5′-CUCUGCGGGAUUGUUUCAATT-3′. siRNA duplexes were transiently transfected into HASMCs using the Lipofectamine RNAiMAX reagent. Following a 24-h transfection period, total protein was extracted, and the efficacy of siRNA transfection was evaluated via Western blotting to identify the most effective siRNA for further studies ( Figure S10 To achieve USP21 overexpression, HASMCs were infected with adenoviruses carrying USP21 particles (Ad-USP21) for 12 h, with vector used as a control. The levels of USP21 protein and the efficiency of adenoviral overexpression were assessed using Western blotting ( Figure S10 Plasmid construction and transfection The homo USP21 coding region and its mutant variants were subcloned into the pCDNA3.1(+)-His vector to generate USP21 and its mutant expression constructs. The ALDH2 coding region was amplified and cloned into the pCDNA3.1(+)-Flag vector. The coding regions for ubiquitin (Ubiquitin, WT) and its mutants (K48, K63) were cloned into the pCDNA3.1(+)-HA vector. The plasmid were constructed by Genechem (Shanghai, China). Once the cell density in the wells reached 60%, transfection was performed using DMEM containing 8μL of Lipofectamine 3000 and 8 μL of P3000, along with 4 μg of plasmid DNA. The medium was replaced 6-h post-transfection, and the cells were subsequently cultured for an additional 24-48 h to prepare for subsequent experiments. Western blot Aortic tissue or cell proteins were rapidly collected, and tissue or cell lysates with equivalent protein concentrations were prepared using RIPA lysis buffer, with protein levels determined by the BCA assay (Boster, AR0146). Proteins were resolved on 8%, 10%, or 12% SDS-PAGE gels and subsequently transferred to polyvinylidene difluoride (PVDF) membranes. After blocking with 5% non-fat milk for 1 h, the membranes were incubated overnight at 4°C with the appropriate primary antibodies. Following washes, the membranes were incubated with secondary antibodies for 1 h at room temperature. The detection was performed using a chemiluminescence imaging system (General Electric, AI800RGB). The relative intensity of the immunoreactive bands was analyzed using ImageJ software and normalized to GAPDH levels. All experiments were conducted at least three times. Quantitative real-time PCR Total RNA was meticulously extracted from mouse aorta, heart, liver, kidney, and lung tissues, as well as from isolated macrophages, endothelial cells, adventitial fibroblasts and vascular smooth muscle cells. The extraction process utilized TRIzol reagent (Invitrogen, 15596-026), adhering strictly to the manufacturer’s protocol to ensure RNA integrity and purity. Subsequent synthesis of complementary DNA (cDNA) was performed using the Transcriptor First Strand cDNA Synthesis Kit (Roche Diagnostics, Basel, Switzerland, 04896866001), facilitating the reverse transcription of RNA templates. Amplification of cDNA fragments was conducted using the SYBR Green PCR Kit (Roche, 04707516001) on the Roche LightCycler 480 real-time PCR system, ensuring precise quantification. Primer sequences employed in this study are detailed in Table S2 Immunoprecipitation (IP) and Co-immunoprecipitation (Co-IP) assays Protein A/G magnetic beads were washed three times with a buffer solution (50 mM Tris, 150 mM NaCl, 0.1%–0.5% SDS, pH 7.5). These beads were then incubated with ALDH2-IP, USP21-IP, Flag-IP antibodies at room temperature on a rotator for 1 h, ensuring adequate binding between the beads and antibodies. Subsequently, proteins were extracted from either tissue samples or HASMCs that had been stimulated for 24 h. After the medium was removed, the cells were lysed with RIPA buffer for 15 min, and the lysate was centrifuged at 10 000g for 10 min to eliminate precipitates. The protein concentration in the supernatant was quantified and normalized using a BCA assay kit. For the Input samples in the immunoprecipitation experiment, 50 μL of normalized protein lysate was transferred into a 1.5 mL centrifuge tube, mixed with 10 μL of 6×loading buffer, and heated at 95°C for 10 min in preparation for electrophoresis. For the Co-IP samples, the beads pre-incubated with antibodies were added to the remaining protein lysate and incubated on a rotator at 4°C for 24 h. The beads were subsequently isolated using a magnet, and the supernatant was discarded. After washing the beads three times with buffer, 30 μL of 3×loading buffer was added, and the mixture was heated at 95°C for 5 min. Finally, the beads were removed using a magnet, and the supernatant was transferred to a 1.5 mL centrifuge tube for protein analysis via western blotting. GST-pull down assay GST-fusion proteins were expressed in Escherichia coli Immunofluorescence and confocal microscopy Immunofluorescence staining was employed to investigate the colocalization of USP21 with α-SMA and ALDH2 in human and mouse aorta tissues. Following permeabilization and blocking, the sections were incubated overnight at 4°C with primary antibodies, diluted 1:100 in 1% goat serum. On the following day, after washing, the sections were incubated for 1 h at room temperature with secondary antibodies diluted 1:200 in PBS. DAPI was applied for nuclear staining. Tissue images were captured using an oil-immersion lens on a confocal laser scanning fluorescence microscope (Carl Zeiss AG, LSM710). Cellular immunofluorescence assay To elucidate the subcellular localization and quantify of USP21 expression levels in HASMCs under various treatment conditions, cells cultured on glass slides were subjected to fixation using 4% paraformaldehyde for 8 min at ambient temperature. This was followed by permeabilization with 0.3% Triton X-100 for 15 min to facilitate antibody access. Non-specific binding sites were blocked using 8% goat serum for 1 h at room temperature. The cells were then incubated with specific primary antibodies at 4°C overnight to ensure optimal binding affinity. This was followed by a 60-min incubation with appropriate secondary antibodies at room temperature. Nuclear counterstaining was performed using DAPI, and the slides were subsequently mounted for imaging. High-resolution images were acquired using a confocal laser scanning microscope (Carl Zeiss AG, LSM710) to ensure precise visualization of protein localization and expression. Histological analysis Human and mouse aortic tissues were collected and fixed in 10% formalin at room temperature for 24 h. After dehydration and paraffin embedding, the samples were sectioned into 5 μm tissue slices. Hematoxylin and Eosin (H&E) Staining: Paraffin was removed using xylene, followed by staining with hematoxylin and eosin to assess changes in aortic wall thickness. Elastica van Gieson (EVG) Staining: Deparaffinization and graded alcohol hydration preceded EVG staining, which was performed using a BASO kit (Zhuhai, China) to evaluate elastic fiber fragmentation. Masson’s Trichrome Staining: After deparaffinization and graded alcohol hydration, Masson’s trichrome staining was conducted using a Masson Trichrome kit (Servicebio, G1006, China) according to the manufacturer’s instructions to evaluate vascular fibrosis and collagen deposition. Quantification was performed using the ImageJ software for digital image analysis. All images were captured with an Olympus scanner (VS200) at magnifications of 200× or 400×. ELISA assay Plasma samples were collected from each group of mice to quantify the levels of MCP-1, IL-6, and MMP9 using specific ELISA kits. The assays were performed in accordance with the manufacturer’s protocols. The ELISA kits for MMP9 (catalog number EK0466), MCP-1 (EK0568), and IL-6 (EK0411) were obtained from Boster Biological Technology (Shanghai, China). Immunohistochemical (IHC) analysis Immunohistochemical staining was performed on human and mouse aortic sections to assess the expression of USP21, ALDH2 and MMP9. Aortic tissues were fixed in 10% formalin at room temperature for 24 h, followed by dehydration, paraffin embedding, and sectioning into 5 μm slices. The procedure was carried out using a commercial staining kit (PV-9001, ZSGB-BIO, Beijing, China). Sections were incubated overnight at 4°C with primary antibodies against USP21, ALDH2 or MMP9. Following washing, sections were incubated for 1 h at room temperature with biotin-labeled goat anti-rabbit or goat anti-mouse secondary antibodies. Visualization was achieved using a 0.05% diaminobenzidine solution. All images were captured with an Olympus scanner (VS2000) at magnifications of either 200× or 400×. Deubiquitination assay Deubiquitination assay were performed in both human and mouse tissues as well as in cultured HASMCs and HEK293T cells. The proteins from tissue and HASMCs were directly extracted, ensuring a yield greater than 1 mg. The protein samples were lysed with RIPA buffer, sonicated, and denatured for 10 min. Immunoprecipitation was performed using ALDH2 antibodies (Abcam, ab110311), and conjugated ubiquitination levels were analyzed by immunoblotting using Ubiquitin antibodies (Cell Signaling Technolog, 3936). HEK293T cells were transfected with expression vectors encoding Flag-ALDH2, His-USP21, and HA-Ub. Cells were treated with MG132 (Selleck Chemicals, S2619), a proteasome inhibitor that enhances ubiquitination, for 12 h before harvesting cellular proteins. Proteins were harvested for subsequent immunoprecipitation of Flag-ALDH2 by Flag antibody (Proteintech, 20543-1-AP), His-USP21 by His antibody (Proteintech, 66005-1-Ig), HA-Ubiquitin by HA antibody (Proteintech, 51064-2-AP). Liquid chromatography-tandem mass spectrometry (LC-MS/MS), proteomic sequencing and bioinformatics analysis Proteomic sequencing was performed on aortic tissue lysates from saline control and Ang II-induced AAA mice. Moreover, the USP21 antibody was incorporated into samples of abdominal aortic tissue lysate subjected to Ang II stimulation or saline infusion for the purpose of immunoprecipitation experiments. Utilizing high-resolution mass spectrometry instrumentation, quantitative analyses of the protein complexes post-immunoprecipitation were performed, with a focus on identifying proteins that exhibited a significant increase in binding in the experimental group relative to the control group. In addition, proteomic sequencing of aortic tissue lysates was performed. For proteomic sequencing, the criteria for differential expression proteins (DEPs) were set as p Quantification and statistical analysis Continuous data were presented as means ± SEM, while categorical variables were reported as counts and percentages (%). The number of replicates (n) corresponds to the biological samples used in the study. Statistical analysis involved using the Student’s t test for two-group comparisons, while ANOVA followed by a post hoc Tukey test was employed for assessing differences among multiple groups. Results were deemed statistically significant when p References 1 Baman J.R. Eskandari M.K. What Is an Abdominal Aortic Aneurysm? JAMA 328 2022 2280 10.1001/jama.2022.18638 36511924 2 Nordon I.M. Hinchliffe R.J. Loftus I.M. Thompson M.M. Pathophysiology and epidemiology of abdominal aortic aneurysms Nat. Rev. Cardiol. 8 2011 92 102 21079638 10.1038/nrcardio.2010.180 3 Golledge J. Thanigaimani S. Powell J.T. Tsao P.S. Pathogenesis and management of abdominal aortic aneurysm Eur. Heart J. 44 2023 2682 2697 37387260 10.1093/eurheartj/ehad386 PMC10393073 4 Kessler V. Klopf J. Eilenberg W. Neumayer C. Brostjan C. AAA Revisited: A Comprehensive Review of Risk Factors, Management, and Hallmarks of Pathogenesis Biomedicines 10 2022 94 10.3390/biomedicines10010094 PMC8773452 35052774 5 Wang J. Xu F. Pang J. Zheng W. Chen Y. Emergency care for chest pain in China: the unmet challenges Emerg. Crit. Care Med. 1 2021 82 85 6 Golledge J. Abdominal aortic aneurysm: update on pathogenesis and medical treatments Nat. Rev. Cardiol. 16 2019 225 242 30443031 10.1038/s41569-018-0114-9 7 Puertas-Umbert L. Almendra-Pegueros R. Jiménez-Altayó F. Sirvent M. Galán M. Martínez-González J. Rodríguez C. Novel pharmacological approaches in abdominal aortic aneurysm Clin. Sci. 137 2023 1167 1194 10.1042/CS20220795 PMC10415166 37559446 8 Gao J. Cao H. Hu G. Wu Y. Xu Y. Cui H. Lu H.S. Zheng L. The mechanism and therapy of aortic aneurysms Signal Transduct. Target. Ther. 8 2023 55 10.1038/s41392-023-01325-7 PMC9898314 36737432 9 Miano J.M. Fisher E.A. Majesky M.W. Fate and State of Vascular Smooth Muscle Cells in Atherosclerosis Circulation 143 2021 2110 2116 34029141 10.1161/CIRCULATIONAHA.120.049922 PMC8162373 10 Chen Y. Mao C. Gu R. Zhao R. Li W. Ma Z. Jia Y. Yu F. Luo J. Fu Y. Nidogen-2 is a Novel Endogenous Ligand of LGR4 to Inhibit Vascular Calcification Circ. Res. 131 2022 1037 1054 36354004 10.1161/CIRCRESAHA.122.321614 11 Song T. Zhao S. Luo S. Chen C. Liu X. Wu X. Sun Z. Cao J. Wang Z. Wang Y. SLC44A2 regulates vascular smooth muscle cell phenotypic switching and aortic aneurysm J. Clin. Investig. 134 2024 e173690 10.1172/JCI173690 PMC11324303 38916960 12 Liu F. Chen J. Li K. Li H. Zhu Y. Zhai Y. Lu B. Fan Y. Liu Z. Chen X. Ubiquitination and deubiquitination in cancer: from mechanisms to novel therapeutic approaches Mol. Cancer 23 2024 148 10.1186/s12943-024-02046-3 PMC11270804 39048965 13 Lange S.M. Armstrong L.A. Kulathu Y. Deubiquitinases: From mechanisms to their inhibition by small molecules Mol. Cell 82 2022 15 29 34813758 10.1016/j.molcel.2021.10.027 14 Suresh B. Lee J. Kim K.S. Ramakrishna S. The Importance of Ubiquitination and Deubiquitination in Cellular Reprogramming Stem Cells Int. 2016 2016 6705927 10.1155/2016/6705927 PMC4736574 26880980 15 Wang B. Cai W. Ai D. Zhang X. Yao L. The Role of Deubiquitinases in Vascular Diseases J. Cardiovasc. Transl. Res. 13 2020 131 141 31823221 10.1007/s12265-019-09909-x 16 Harrigan J.A. Jacq X. Martin N.M. Jackson S.P. Deubiquitylating enzymes and drug discovery: emerging opportunities Nat. Rev. Drug Discov. 17 2018 57 78 28959952 10.1038/nrd.2017.152 PMC7097658 17 Snyder N.A. Silva G.M. Deubiquitinating enzymes (DUBs): Regulation, homeostasis, and oxidative stress response J. Biol. Chem. 297 2021 101077 10.1016/j.jbc.2021.101077 PMC8424594 34391779 18 Komander D. Clague M.J. Urbé S. Breaking the chains: structure and function of the deubiquitinases Nat. Rev. Mol. Cell Biol. 10 2009 550 563 19626045 10.1038/nrm2731 19 Yu B. Liu Z. Fu Y. Wang Y. Zhang L. Cai Z. Yu F. Wang X. Zhou J. Kong W. CYLD Deubiquitinates Nicotinamide Adenine Dinucleotide Phosphate Oxidase 4 Contributing to Adventitial Remodeling Arterioscler. Thromb. Vasc. Biol. 37 2017 1698 1709 28751569 10.1161/ATVBAHA.117.309859 20 Zhao G. Zhao Y. Lu H. Chang Z. Liu H. Wang H. Liang W. Liu Y. Zhu T. Rom O. BAF60c prevents abdominal aortic aneurysm formation through epigenetic control of vascular smooth muscle cell homeostasis J. Clin. Investig. 132 2022 e158309 10.1172/JCI158309 PMC9621131 36066968 21 Ladd Z. Su G. Hartman J. Lu G. Hensley S. Upchurch G.R. Jr. Sharma A.K. Pharmacologic inhibition by spironolactone attenuates experimental abdominal aortic aneurysms Front. Cardiovasc. Med. 10 2023 1101389 10.3389/fcvm.2023.1101389 PMC9908993 36776267 22 Skotsimara G. Antonopoulos A. Oikonomou E. Papastamos C. Siasos G. Tousoulis D. Aortic Wall Inflammation in the Pathogenesis, Diagnosis and Treatment of Aortic Aneurysms Inflammation 45 2022 965 976 35076833 10.1007/s10753-022-01626-z 23 Andreucci M. Provenzano M. Faga T. Michael A. Patella G. Mastroroberto P. Serraino G.F. Bracale U.M. Ielapi N. Serra R. Aortic Aneurysms, Chronic Kidney Disease and Metalloproteinases Biomolecules 11 2021 194 10.3390/biom11020194 PMC7912263 33573220 24 Ross J.J. Tranquillo R.T. ECM gene expression correlates with in vitro tissue growth and development in fibrin gel remodeled by neonatal smooth muscle cells Matrix Biol. 22 2003 477 490 14667840 10.1016/s0945-053x(03)00078-7 25 Xiong W. Mactaggart J. Knispel R. Worth J. Zhu Z. Li Y. Sun Y. Baxter B.T. Johanning J. Inhibition of reactive oxygen species attenuates aneurysm formation in a murine model Atherosclerosis 202 2009 128 134 18502427 10.1016/j.atherosclerosis.2008.03.029 PMC2646364 26 Cockram P.E. Kist M. Prakash S. Chen S.H. Wertz I.E. Vucic D. Ubiquitination in the regulation of inflammatory cell death and cancer Cell Death Differ. 28 2021 591 605 33432113 10.1038/s41418-020-00708-5 PMC7798376 27 Zhang Q. Chen Z. Tang Q. Wang Z. Lu J. You Y. Wang H. USP21 promotes self-renewal and tumorigenicity of mesenchymal glioblastoma stem cells by deubiquitinating and stabilizing FOXD1 Cell Death Dis. 13 2022 712 10.1038/s41419-022-05163-3 PMC9381540 35974001 28 Liu X. Yao Y. Ding H. Han C. Chen Y. Zhang Y. Wang C. Zhang X. Zhang Y. Zhai Y. USP21 deubiquitylates Nanog to regulate protein stability and stem cell pluripotency Signal Transduct. Target. Ther. 1 2016 16024 10.1038/sigtrans.2016.24 PMC5661642 29263902 29 Li Y. Lu Y. Wang S. Han Z. Zhu F. Ni Y. Liang R. Zhang Y. Leng Q. Wei G. USP21 prevents the generation of T-helper-1-like Treg cells Nat. Commun. 7 2016 13559 10.1038/ncomms13559 PMC5120220 27857073 30 Yang K. Ren J. Li X. Wang Z. Xue L. Cui S. Sang W. Xu T. Zhang J. Yu J. Prevention of aortic dissection and aneurysm via an ALDH2-mediated switch in vascular smooth muscle cell phenotype Eur. Heart J. 41 2020 2442 2453 32428930 10.1093/eurheartj/ehaa352 31 Zhang J. Guo Y. Zhao X. Pang J. Pan C. Wang J. Wei S. Yu X. Zhang C. Chen Y. The role of aldehyde dehydrogenase 2 in cardiovascular disease Nat. Rev. Cardiol. 20 2023 495 509 36781974 10.1038/s41569-023-00839-5 32 An T. Lu Y. Yan X. Hou J. Insights Into the Properties, Biological Functions, and Regulation of USP21 Front. Pharmacol. 13 2022 944089 10.3389/fphar.2022.944089 PMC9279671 35846989 33 Kessler B.M. Edelmann M.J. PTMs in conversation: activity and function of deubiquitinating enzymes regulated via post-translational modifications Cell Biochem. Biophys. 60 2011 21 38 21480003 10.1007/s12013-011-9176-6 PMC3094536 34 Gao J.J. Wu F.Y. Liu Y.J. Li L. Lin Y.J. Kang Y.T. Peng Y.M. Liu Y.F. Wang C. Ma Z.S. Increase of PCSK9 expression in diabetes promotes VEGFR2 ubiquitination to inhibit endothelial function and skin wound healing Sci. China Life Sci. 67 2024 2635 2649 39153050 10.1007/s11427-023-2688-8 35 Sowa M.E. Bennett E.J. Gygi S.P. Harper J.W. Defining the human deubiquitinating enzyme interaction landscape Cell 138 2009 389 403 19615732 10.1016/j.cell.2009.04.042 PMC2716422 36 Li Y.E. Liu S. Wang L. Du Y. Wu L. Chen H. Zhu T. Lin J. Xiong S. Wang Y. March2 Alleviates Aortic Aneurysm/Dissection by Regulating PKM2 Polymerization Circ. Res. 136 2025 e73 e93 40079144 10.1161/CIRCRESAHA.124.325049 37 Lei C. Kan H. Xian X. Chen W. Xiang W. Song X. Wu J. Yang D. Zheng Y. FAM3A reshapes VSMC fate specification in abdominal aortic aneurysm by regulating KLF4 ubiquitination Nat. Commun. 14 2023 5360 10.1038/s41467-023-41177-x PMC10475135 37660071 38 Shi Z.Y. Li C.Y. Chen R.Y. Shi J.J. Liu Y.J. Lu J.F. Yang G.J. Chen J. The emerging role of deubiquitylating enzyme USP21 as a potential therapeutic target in cancer Bioorg. Chem. 147 2024 107400 10.1016/j.bioorg.2024.107400 38688196 39 Urbe S. Liu H. Hayes S.D. Heride C. Rigden D.J. Clague M.J. Systematic survey of deubiquitinase localization identifies USP21 as a regulator of centrosome- and microtubule-associated functions Mol. Biol. Cell 23 2012 1095 1103 22298430 10.1091/mbc.E11-08-0668 PMC3302736 40 Ye Y. Akutsu M. Reyes-Turcu F. Enchev R.I. Wilkinson K.D. Komander D. Polyubiquitin binding and cross-reactivity in the USP domain deubiquitinase USP21 EMBO Rep. 12 2011 350 357 21399617 10.1038/embor.2011.17 PMC3077245 41 Hou P. Ma X. Yang Z. Zhang Q. Wu C.J. Li J. Tan L. Yao W. Yan L. Zhou X. USP21 deubiquitinase elevates macropinocytosis to enable oncogenic KRAS bypass in pancreatic cancer. Genes Dev 35 2021 1327 1332 10.1101/gad.348787.121 PMC8494209 34531315 42 Hong Y. Lee S.O. Oh C. Kang K. Ryoo J. Kim D. Ahn K. USP21 Deubiquitinase Regulates AIM2 Inflammasome Activation J. Immunol. 207 2021 1926 1936 34470856 10.4049/jimmunol.2100449 43 Fan Y. Mao R. Yu Y. Liu S. Shi Z. Cheng J. Zhang H. An L. Zhao Y. Xu X. USP21 negatively regulates antiviral response by acting as a RIG-I deubiquitinase J. Exp. Med. 211 2014 313 328 24493797 10.1084/jem.20122844 PMC3920558 44 Xu X. Chen Y. Shao S. Wang J. Shan J. Wang Y. Wang Y. Chang J. Zhou T. Chen R. USP21 deubiquitinates and stabilizes HSP90 and ENO1 to promote aerobic glycolysis and proliferation in cholangiocarcinoma Int. J. Biol. Sci. 20 2024 1492 1508 38385089 10.7150/ijbs.90774 PMC10878141 45 Reyes-Turcu F.E. Ventii K.H. Wilkinson K.D. Regulation and cellular roles of ubiquitin-specific deubiquitinating enzymes Annu. Rev. Biochem. 78 2009 363 397 19489724 10.1146/annurev.biochem.78.082307.091526 PMC2734102 46 Khan A. Giri S. Wang Y. Chakraborty A. Ghosh A.K. Anantharaman A. Aggarwal V. Sathyan K.M. Ha T. Prasanth K.V. Prasanth S.G. BEND3 represses rDNA transcription by stabilizing a NoRC component via USP21 deubiquitinase Proc. Natl. Acad. Sci. USA 112 2015 8338 8343 26100909 10.1073/pnas.1424705112 PMC4500215 47 Yang K. Cui S. Wang J. Xu T. Du H. Yue H. Ye H. Guo J. Zhang J. Li P. Early Progression of Abdominal Aortic Aneurysm is Decelerated by Improved Endothelial Barrier Function via ALDH2-LIN28B-ELK3 Signaling Adv. Sci. 10 2023 e2302231 10.1002/advs.202302231 PMC10646281 37822152 48 Guo H. Yu X. Liu Y. Paik D.T. Justesen J.M. Chandy M. Jahng J.W.S. Zhang T. Wu W. Rwere F. SGLT2 inhibitor ameliorates endothelial dysfunction associated with the common ALDH2 alcohol flushing variant Sci. Transl. Med. 15 2023 eabp9952 10.1126/scitranslmed.abp9952 PMC10297796 36696485 49 Zhang J. Zhao X. Guo Y. Liu Z. Wei S. Yuan Q. Shang H. Sang W. Cui S. Xu T. Macrophage ALDH2 (Aldehyde Dehydrogenase 2) Stabilizing Rac2 Is Required for Efferocytosis Internalization and Reduction of Atherosclerosis Development Arterioscler. Thromb. Vasc. Biol. 42 2022 700 716 35354308 10.1161/ATVBAHA.121.317204 PMC9126264 50 Farshi P. Deshmukh R.R. Nwankwo J.O. Arkwright R.T. Cvek B. Liu J. Dou Q.P. Deubiquitinases (DUBs) and DUB inhibitors: a patent review Expert Opin. Ther. Pat. 25 2015 1191 1208 26077642 10.1517/13543776.2015.1056737 PMC4834700 51 D'Arcy P. Wang X. Linder S. Deubiquitinase inhibition as a cancer therapeutic strategy Pharmacol. Ther. 147 2015 32 54 25444757 10.1016/j.pharmthera.2014.11.002 52 Schauer N.J. Magin R.S. Liu X. Doherty L.M. Buhrlage S.J. Advances in Discovering Deubiquitinating Enzyme (DUB) Inhibitors J. Med. Chem. 63 2020 2731 2750 31682427 10.1021/acs.jmedchem.9b01138 53 Lin H.C. Kuan Y. Chu H.F. Cheng S.C. Pan H.C. Chen W.Y. Sun C.Y. Lin T.H. Disulfiram and 6-Thioguanine synergistically inhibit the enzymatic activities of USP2 and USP21 Int. J. Biol. Macromol. 176 2021 490 497 33582217 10.1016/j.ijbiomac.2021.02.072 54 Cvek B. Dvorak Z. The value of proteasome inhibition in cancer. Can the old drug, disulfiram, have a bright new future as a novel proteasome inhibitor? Drug Discov. Today 13 2008 716 722 18579431 10.1016/j.drudis.2008.05.003 55 Sawada H. Daugherty A. Lu H.S. Expression of a PCSK9 Gain-of-Function Mutation in C57BL/6J Mice to Facilitate Angiotensin II-Induced AAAs Biomolecules 12 2022 915 10.3390/biom12070915 PMC9313338 35883473 56 Bhamidipati C.M. Mehta G.S. Lu G. Moehle C.W. Barbery C. DiMusto P.D. Laser A. Kron I.L. Upchurch G.R. Ailawadi G. Development of a novel murine model of aortic aneurysms using peri-adventitial elastase Surgery 152 2012 238 246 22828146 10.1016/j.surg.2012.02.010 PMC3601193 Supplemental information  Document S1. Figures S1–S19 and Tables S1–S5 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102328 ",
  "metadata": {
    "Title of this paper": "Development of a novel murine model of aortic aneurysms using peri-adventitial elastase",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490246/"
  }
}