{
  "title": "Paper_202",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490217 PMC12490217.1 12490217 12490217 40885190 10.1016/j.xcrm.2025.102317 S2666-3791(25)00390-8 102317 1 Article Inhibiting KRAS with CD47 and immune checkpoint overcomes intrinsic resistance to combined KRAS and immune checkpoint inhibitor therapy Hirade Kentaro 1 2 13 Tanaka Noritaka 1 13 Kajino Taisuke 1 13 Adachi Yuta 1 Kimura Ryo 1 Kasuya Hitomi 1 Kisoda Satoru 3 Tan Tze King 4 Hayakawa Sho 1 Sato Takahiko 5 Yanase Shogo 1 Kitaura Yoko 1 Yamamoto Takamasa 1 Nishioka Yuki 1 Muto Osamu 3 6 Muraoka Daisuke 7 Fujishita Teruaki 8 Kasuga Natsumi 1 Watanabe Kageaki 9 Sakata Yoshihiko 10 Aoki Masahiro 8 Matsushita Hirokazu 7 Sanda Takaomi 2 4 Iida Shinsuke 2 Tsuchiya Kohsuke 11 Yamaguchi Rui 3 6 Ebi Hiromichi hebi@aichi-cc.jp 1 12 14 ∗ 1 2 3 4 5 6 7 8 9 10 11 12 ∗ hebi@aichi-cc.jp 13 These authors contributed equally 14 Lead contact 16 9 2025 29 8 2025 6 9 498186 102317 27 5 2024 12 3 2025 30 7 2025 29 08 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary Although Kirsten rat sarcoma virus (KRAS) G12C inhibitors alter the treatment strategy for patients with KRAS G12C-mutant lung cancer, their efficacy remains insufficient to eliminate tumors. Here, we identify that inhibition of mutant KRAS promotes escape from macrophage phagocytosis by upregulating the expression of cluster of differentiation 47 (CD47) and CD24. These proteins are induced by the binding of FOXA1 to the super-enhancer of CD47 CD24 Graphical abstract Highlights • KRAS inhibition upregulates CD47 expression via FOXA1 • Inhibition of KRAS G12C induces the infiltration of suppressive macrophages in vivo • Combined inhibition of KRAS G12C, CD47, and immune checkpoints activates T cells • This triple inhibition prolongs survival in a syngeneic lung cancer model Hirade et al. identify that mutant KRAS inhibition upregulates CD47 and CD24 on tumor cells, suppressing macrophage-mediated phagocytosis. Although anti-CD47 restores phagocytosis, the resulting macrophages upregulate PD-L1 and suppress cytotoxic T cells. Triple inhibition of KRAS, CD47, and immune checkpoints achieves long-term survival in a syngeneic mouse model, highlighting translational potential. Keywords CD47 KRAS mutation immune checkpoint inhibitor pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: August 29, 2025 Introduction Pathogenic mutations in the Kirsten rat sarcoma virus (KRAS) gene are widely observed across the spectrum of human cancers, with these alterations considered to be promising targets given their high prevalence and role in oncogenesis. 1 In addition to its role as a cell-autonomous oncogene, mutant KRAS has an immunosuppressive effect on the tumor microenvironment. 2 , 3 , 4 , 5 3 4 , 6 4 4 7 , 8 9 4 Here, we identified that inhibition of KRAS upregulates the expression of cluster of differentiation 47 (CD47) and CD24. Addition of an anti-CD47 antibody enhanced macrophage-mediated phagocytosis, which was suppressed by KRAS inhibition. However, phagocytic macrophages inhibited cytotoxic T cells by upregulating PD-L1 expression. The triplet combination of a KRAS G12C inhibitor with an anti-CD47 antibody and an immune checkpoint inhibitor achieved long-term survival in a syngeneic mouse model that was recalcitrant to the dual combination of KRAS G12C and immune checkpoint inhibition. Results Inhibition of KRAS upregulates the expression of CD24 and CD47 Oncogenic KRAS signaling regulates the expression of cytokines and immune regulatory proteins that could result in immune-evasive tumor microenvironments. 4 Figure S1 4 , 10 Figure S1 11 Figure S1 Figure 1 Figure S1 Figures 1 S1 Figure S1 Figure 1 Inhibition of KRAS upregulates the expression of CD24 and CD47 (A) NCI-H358 and LU65 KRAS G12C-mutant cancer cell lines were treated with DMSO or 1 μM sotorasib at the indicated time points. Cell lysates were probed with the indicated antibodies. Western blot was repeated three independent times with similar results. (B and C) The mean fluorescent intensity (MFI) of CD47 (B) and CD24 (C) on NCI-H358, LU65, and GP5d cells treated with DMSO or 1 μM sotorasib for 72 h. The data represent MFI ± SD of 3 wells, ∗ p (D) Flow cytometric phagocytosis assay of THP-1-derived macrophages against NCI-H358 and LU65 cells and human monocyte-derived macrophages against NCI-H358 cells. Tumor cells were treated with DMSO or 1 μM sotorasib for 72 h and then stained with CFSE. THP-1-derived macrophages and human monocyte-derived macrophages were labeled with PKH-26 staining solution. Subsequently, tumor cells were co-cultured with macrophages at a 1:1 ratio for 2 h. The percentage of both CFSE- and PKH-positive cells among PKH-positive cells was measured using flow cytometry and compared between DMSO- and sotorasib-treated cells. The data represent mean ± SD of 3 independent experiments, ∗ p (E) The MFI of CD47 on LLC Nras KO cells following inhibition of mutant KRAS. For in vitro in vivo p (F) Flow cytometric phagocytosis assay of murine peritoneal macrophages against LLC Nras KO cells assessed as in (E). The data represent mean ± SD of 3 independent experiments, ∗ p (G) EGFP-labeled LLC Nras KO syngeneic lung tumors were treated with vehicle or 100 mg/kg sotorasib for 3 days. Then tumors were collected, dissociated, and labeled with F4/80 antibody. The percentage of both EGFP- and F4/80-positive cells among F4/80-positive cells was measured using flow cytometry and compared between vehicle- and sotorasib-treated mice. The data represent mean ± SD of 3 independent mice, ∗ p We investigated whether CD47 upregulation following sotorasib treatment is broadly observed in KRAS G12C-mutant lung cancer cell lines. In the KRAS inhibitor-insensitive cell lines NCI-H1792, SW1573, Calu-1, and NCI-H23, 12 Figure S1 12 Figure S1 13 Figure S1 Figure 1 CD47 and its receptor signal regulatory protein α (SIRPα) act as a dominant anti-phagocytic signal. 14 Figures 1 S1 15 Figure 1 p p Figure 1 To further determine whether upregulation of CD47 is observed in vivo Figure S1 in vitro Figure 1 Figure 1 Figures 1 S1 Figure S1 Figure S1 FOXA1 binds to the super-enhancer region of CD47 To interrogate how CD47 expression was induced following sotorasib treatment, we employed an assay for transposase-accessible chromatin combined with next-generation sequencing (ATAC-seq). While ATAC-seq identified several peaks in the super-enhancer and transcription regions of the CD47 Figure S2 CD47 CD47 Figures 2 Table S1 Figure 2 FOXA1 binds to the super-enhancer region of CD47 (A) ATAC-seq signal for the CD47 (B) Flowchart identifying transcription factors that regulate CD47 is shown on the left. Fold change in expression of each candidate transcription factor in NCI-H358 cells transfected with constitutively active YAP (YAP S6A) or in NCI-H358 cells treated with 1 μM sotorasib for 72 h relative to NCI-H358 cells is shown on the right. (C) qPCR analysis of mRNA levels of FOXA1 normalized to ubiquitin following treatment with 1 μM sotorasib for 72 h in NCI-H358 and LU65 cells. Data are mean ± SD ( n p (D) NCI-H358 and LU65 cells were treated with DMSO or 1 μM sotorasib at the indicated time points. Cell lysates were probed with the indicated antibodies. (E and F) NCI-H358 and LU65 cells transduced with control sgRNA or sgFOXA1 were treated with 1 μM sotorasib for 72 h. Cell lysates were probed with the indicated antibodies. Western blot was repeated 2 independent times with similar results (E). The MFI of CD47 on NCI-H358 and LU65 cells is shown (F). The data represent MFI ± SD of 3 wells, ∗ p (G) ChIP-qPCR analysis shows significantly more enrichment of FOXA1 at the super-enhancer regions of the CD47 n p Whereas we previously demonstrated that inhibition of mutant KRAS induces yes-associated protein (YAP) nuclear translocation and transcription of YAP downstream signaling factors, 16 Figure S2 Figure 2 Figures 2 S2 To examine the effect of these proteins on the expression of CD47, we knocked down each transcription factor ( Figures S2 Figure 2 Figures 2 S2 Figure 2 GRHL2 is involved in the regulation of CD24 expression We next explored how CD24 expression was regulated. In contrast to CD47, open chromatin appeared around the transcription start site following sotorasib treatment ( Figure S3 Figures S3 17 Figure S3 Figure S3 Figures S3 Figure S3 The inhibition of KRAS and CD47 induces a phenotypic change in macrophages We determined whether anti-CD47 antibodies could abrogate the suppression of phagocytosis following sotorasib treatment. While treatment with anti-CD47 antibodies increased phagocytosis in NCI-H358 cells compared to control cells, this was not observed in the LU65 cell line. Indeed, the addition of an anti-CD47 antibody was able to negate the suppression of phagocytosis induced by sotorasib treatment in both cell lines ( Figure 3 Figure 3 Figure 3 in vitro Figures 3 S4 Figure S4 18 Figure S4 Figure 3 Inhibition of KRAS and CD47 induces a phenotypic change in macrophages (A–C) Flow cytometric phagocytosis assay of THP-1-derived macrophages against NCI-H358 and LU65 cells (A), human monocyte-derived macrophages against NCI-H358 cells (B), and murine peritoneal macrophages against LLC Nras KO cells (C). Tumor cells were treated with DMSO or 1 μM sotorasib for 72 h and then co-cultured with macrophages at a 1:1 ratio for 2 h with or without 2 μg/mL anti-CD47. The data represent mean ± SD of 3 independent experiments, ∗ two-sided Student’s t test with Bonferroni correction, p (D) Phagocytosis assay in vivo p (E) LLC Nras KO syngeneic lung tumors were treated with vehicle, sotorasib (100 mg/kg), anti-CD47 (100 μg/body), or the combination of these drugs at the same doses for 3 days. Tumors were harvested and subjected to fluorescence immunostaining with the indicated antibodies. Scale bars, 100 μm. (F) LLC Nras KO syngeneic lung tumors were treated as in (E). Gene expression of Adgre1 (G) UMAP visualization of merged sequencing profiles from tumors of each cohort with cells colored and labeled according to cell type. (H) A 100% stacked bar graph showing the proportion of macrophages classified into each cluster. (I) The spatial distribution of each macrophage cluster in each cohort. Scale bars, 1 mm. (J) The top 15 most significantly upregulated genes in clusters 1, 3, and 11. The complete list is included in Table S2 (K) LLC Nras KO syngeneic lung tumors were treated as in (E) and subjected to fluorescence immunostaining with the indicated antibodies. Scale bars, 100 μm. (L) Phagocytosis assay in vivo + p To determine whether phagocytosis induction depends on blocking the CD47/SIRPα interaction via the fragment antigen-binding domain or is mediated through interactions between the fragment crystallizable (Fc) region and Fc gamma receptors (FcγRs), we pretreated cells with a mixture of antibodies against CD16 (FcγRIII), CD32 (FcγRII), and CD64 (FcγRI) before incubating tumor cells with either THP-1-derived macrophages or human monocyte-derived macrophages. Blocking Fcγ receptors significantly reduced phagocytosis induced by the anti-CD47 antibody with sotorasib treatment, suggesting that phagocytosis is primarily mediated by antibody-dependent cellular phagocytosis ( Figure S4 We next evaluated the phenotype of macrophages before and after treatment with a KRAS inhibitor and an anti-CD47 antibody. The number of macrophages defined by F4/80 staining was increased by sotorasib treatment, particularly in the tumor core, and this effect persisted after the addition of an anti-CD47 antibody ( Figures 3 S4 Adgre1 Figures 3 S4 Figure 3 Figure 3 Figure 3 Figure 3 Table S2 To further assess phenotypic changes, we investigated the distribution of macrophages positive for a pro-inflammatory marker iNOS (inducible nitric oxide synthase) and an anti-inflammatory marker CD206. In the control tumor, iNOS-positive cells were located on the surface of tumors while CD206-positive cells were evenly distributed ( Figures 3 S4 Figures 3 S4 Figures S4 THP-1-derived macrophages induced by lipopolysaccharide (LPS) stimulation, known for their immunostimulatory phenotype, 19 in vitro Figure S4 + Figure 3 Phagocytosis upregulates PD-L1 expression on macrophages These results led us to examine the efficacy of combining sotorasib with anti-CD47 antibodies. Consistent with LLC lung tumors constituting a highly immunosuppressive tumor microenvironment that is resistant to the KRAS G12C inhibitor MRTX-1257, 4 Figure S5 Figure 3 Figure S5 We investigated the cell state in phagocytic macrophages. THP-1-derived M0 macrophages were co-cultured with NCI-H358 cells for 24 h and sorted into phagocytic and non-phagocytic populations for RNA sequencing analysis. Hallmark gene sets from the gene set enrichment analysis showed that phagocytosis in macrophages led to downregulation of cell proliferation-related pathways such as E2F targets and the G2M checkpoint, while simultaneously inducing epithelial-to-mesenchymal transition (EMT) and upregulation of transforming growth factor β (TGF-β) signaling ( Figure S5 20 IL1B Figure S5 21 20 Figure S5 We identified upregulation of a key immune checkpoint ligand CD274 (PD-L1) in phagocytic macrophages ( Figure 4 Table S3 Figures 4 S5 Figures 4 S5 Figures 4 S5 Figures 4 S5 Table S4 Figure S5 Figure 4 Figures 4 S5 Figures 3 4 Figures 4 + + Figure 4 Phagocytosis induces PD-L1 expression on macrophages (A) qPCR analysis of mRNA levels of PD-L1 normalized to ubiquitin in non-phagocytic and phagocytic macrophages co-cultured with NCI-H358 cells for 24 h. Data are mean ± SD ( n p (B) The upregulation of PD-L1 MFI following phagocytosis of THP-1-derived macrophages by co-culture with NCI-H358 and LU65 cells for 2 h. The data represent MFI ± SD of 3 wells, two-sided Student’s t test, ∗ p (C) Human monocyte-derived macrophages were co-cultured with NCI-H358 cells for 2 h, and PD-L1 expression was compared between non-phagocytic and phagocytic macrophages. The data represent MFI ±SD of 3 independently treated cell cultures, two-sided Student’s t test, ∗ p (D) The upregulation of PD-L1 MFI following phagocytosis of murine peritoneal macrophages by co-culture with LLC Nras KO cells for 2 h. The data represent MFI ± SD of 3 wells, two-sided Student’s t test, ∗ p (E) Upregulation of PD-L1 MFI on phagocytic macrophages in vivo p (F) PD-L1 expression in the tumor microenvironment of LLC Nras KO syngeneic lung tumors. Tumors were harvested and subjected to fluorescence immunostaining with the indicated antibodies. Scale bars, 50 μm. (G) LLC Nras KO syngeneic lung tumors were treated with vehicle, sotorasib (100 mg/kg), anti-CD47 (100 μg/body), or the combination of these drugs at the same doses for 3 days. Tumors were harvested and subjected to fluorescence immunostaining with the indicated antibodies. Scale bars, 100 μm. (H) Quantitative analyses of PD-L1-positive cells. The y n p KRAS inhibition combined with anti-CD47 and immune checkpoint blockade results in enhanced efficacy Since the functional role of PD-L1 on TAMs remains context dependent and has yet to be conclusively established, 22 , 23 Figure 5 Figure 5 KRAS inhibition combined with anti-CD47 and immune checkpoint blockade results in enhanced efficacy (A) Tumor-associated macrophages suppressed T cell activation that was relieved by anti-PD-L1 antibody. CD8 T cells isolated from C57BL/6 mouse spleen were seeded into plates pre-coated with anti-CD3 antibody and cultured for 24 h in medium supplemented with the anti-CD28 antibody. Tumor-associated macrophages were generated from co-culture of mouse peritoneal macrophages with LLC Nras KO cells for 24 h. Then, tumor-associated macrophages, CD8 T cells, and a mixture of these cells were cultured with or without 10 μg/mL anti-PD-L1 antibody for 24 h. T cell activation was measured by IFN-γ secretion in each media. The data represent mean ± SD of 3 co-cultures, two-sided Student’s t test with Bonferroni correction, ∗ p (B–F) Representative immunofluorescence images (B) and quantitative analyses (C–F) showing indicated immune cells infiltrating tumors. The y n p (G) LLC Nras KO tumors were treated with vehicle, 50 mg/kg sotorasib daily, anti-CD47 antibody 50 μg/body three times a week, atezolizumab 10 mg/kg twice a week, or a combination of these drugs as indicated. Treatments were finished on day 56, and mice were followed until 1 year. Kaplan-Meier survival curve of mice in each group. Significance was determined by a log rank test, ∗ p We next assessed the effects of KRAS G12C inhibition with anti-CD47 antibody treatment and PD-L1 inhibition on macrophage and T cell activation ( Figures 5 S6 Figures 5 Figure 5 Figure 5 + Figures S6 + Figure S6 + Figure 5 Figures 5 S6 This led us to examine the efficacy of combining a KRAS inhibitor with anti-CD47 antibodies and immune checkpoint inhibition. The triplet treatment was feasible without significant body weight loss ( Figure S6 Figure S6 n n p Figure 5 + + + + Figure S6 Lastly, to assess the efficacy of the triplet therapy in a different model, we generated a mouse model of colorectal cancer by combining tamoxifen-inducible expression of stable β-catenin (Ctnnb1 flox(ex3)/+ LSL−G12C/+ flox/flox flox/flox T2 Ctnnb1 Kras Trp53 Smad4 Figure S6 Discussion KRAS G12C inhibition modulates the immune-suppressive tumor microenvironment by downregulating a breadth of cytokines and chemokines. 24 Mutant KRAS inhibition reversed immunosuppression, inducing a pro-inflammatory transcriptional program and adaptive immunity 4 Figure S1 4 Inhibition of mutant KRAS induces genetic and non-genetic mechanisms of adaptation in tumor cells. 16 , 25 CD47 CD47 26 CD47 CD47 26 CD47 27 28 Super-enhancers are also largely different between normal and cancer cells, playing roles in immune escape in the tumor microenvironment. In skin squamous cell carcinoma, cancer stem cells express and secrete CXCL1 and CXCL2 by establishing super-enhancers, which send a signal to the immune system to consolidate cell stability. 29 30 Oncogenic KRAS was also reported to induce CD47 expression by miR-34a suppression through phosphatidylinositol 3-kinase-STAT3 signaling. 31 Macrophages are double-edged swords with dual potential in cancer, reflecting their plasticity in response to the tumor microenvironment. 32 33 34 Kras G12D Trp53 35 36 Inhibition of mutant KRAS has been shown to stimulate anti-tumor immunity by inducing a pro-inflammatory tumor microenvironment, enriched in pro-inflammatory M1 macrophages and cytotoxic T cells, resulting in tumor regression by KRAS inhibitor monotherapy. 7 , 18 , 37 , 38 39 + + + 4 4 , 39 While it is concerning that the combination of sotorasib with the immune checkpoint inhibitor pembrolizumab induced severe liver toxicity in early clinical trials, 40 9 24 41 Limitations of the study A key limitation of our study is that CD47 induction was observed only in KRAS G12C inhibitor-sensitive cell lines. This suggests that the addition of an anti-CD47 antibody does not enhance the efficacy of KRAS inhibitors when combined with immune checkpoint blocking agents in KRAS G12C inhibitor-insensitive cells. Furthermore, our current results do not fully elucidate the roles of other tumor suppressor genes—such as KEAP1 and SMARCA4, which are associated with resistance to KRAS inhibitors, and LKB1, which is linked to resistance to immune checkpoint inhibitors—in influencing the effectiveness of the triplet therapy. Therefore, this triplet therapy may hold the most promise for a specific subset of patients with KRAS-mutant cancers, particularly those whose tumors are sensitive to KRAS G12C inhibition. Further studies, including clinical trials, will be essential to clarify the influence of co-occurring mutations and to determine which patients are most likely to benefit from this therapeutic strategy. Also, the effect of anti-PD-L1 on reversing TAM-mediated T cell suppression is modest, which may indicate that PD-L1 expression by macrophages is not the primary immunosuppressive mechanism involved. Resource availability Lead contact Further information and requests for resources and reagents should be directed to the lead contact, Hiromichi Ebi ( hebi@aichi-cc.jp Materials availability Reagents are available upon request to the lead contact. Data and code availability  • The ATAC-seq and RNA-seq data generated in this study, along with the raw spatial transcriptomics data, have been deposited at the GEO repository and are publicly available as of the date of publication. Accession numbers are listed in the key resources table • This article does not report an original code. • Any additional information required to analyze the data reported in this article is available from the lead contact Acknowledgments This work was supported by 10.13039/501100001691 JSPS 22K19473 24K02313 Princess Takamatsu Cancer Research 21-25306 10.13039/100007449 Takeda Science Foundation Aichi Cancer Center Joint Research 10.13039/501100005694 Hori Sciences and Arts Foundation http://sc.hgc.jp/shirokane.html Author contributions H.E. conceived and designed the project. K.H., N.T., T.K., and Y.A. performed most of the experiments. H.K., S.H., Y.K., K.W., Y.S., T.Y., Y.N., S.Y., D.M., H.M., and K.T. helped with biochemistry experiments. T. Sato helped with flow cytometry experiments. R.K., N.K., T.F., and M.A. helped with animal experiments. S.K., O.M., and R.Y. conducted bioinformatic analyses. T.K.T., T. Sanda, and S.I. analyzed ATAC-seq data. K.H., N.T., and H.E. wrote the manuscript, and all authors contributed to the writing and/or critical review of the manuscript. Declaration of interests H.E. and Y.A. are listed on a patent describing the combinatorial therapy reported in this work. H.E. received honoraria from Amgen. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies Anti-Mouse IgG AF568 invitrogen Cat. A11004; RRID: AB_2534072 Anti-Rabbit IgG AF647 abcam Cat.ab150079; RRID: AB_2722623 Anti-Mouse IgG AF488 CST Cat. 4408; RRID: AB_10694704 APC CD47 (mouse) Biolegend Cat. 127514; RRID: AB_2562920 iNOS (mouse) abcam Cat. ab15323; RRID: AB_1977477 Anti-Rabbit IgG AF488 CST Cat. 4412; RRID: AB_1904025 APC CD206 (mouse) Biolegend Cat. 141707; RRID: AB_10896057 CD47 abcam Cat. ab284132; RRID: AB_3676422 CD24 Biolegend Cat. 311102; RRID: AB_314851 APC PDL-1 Biolegend Cat. 329708; RRID: AB_940360 PE/Cy7 PDL-1 (mouse) Biolegend Cat. 124314; RRID: AB_10643573 APC Rat IgG2b Biolegend Cat. 400612; RRID: AB_326556 PE/Cy7 Rat IgG2b BD Biosciences Cat. 552849; RRID: AB_394490 Brilliant Violet 421 CD86 Biolegend Cat. 374211; RRID: AB_2728393 CD16 Biolegend Cat. 302049; RRID: AB_2783156 CD32 STEMCELL Technologies Cat. ST-60012; RRID: AB_2925215 CD64 Biolegend Cat. 305047; RRID: AB_2810455 Anti-Rat IgG AF488 abcam Cat. ab150153; RRID: AB_2737355 Anti-Rat IgG AF568 abcam Cat. ab175476; RRID: AB_2813739 Anti-Goat IgG AF594 abcam Cat. ab150132; RRID: AB_2810222 Anti-Rabbit IgG AF594 CST Cat. 8889; RRID: AB_2716249 Arginase-1 (mouse) CST Cat. 93668; RRID: AB_2800207 CD8 alpha (mouse) abcam Cat. ab217344; RRID: AB_2890649 F4/80 (mouse) Biorad Cat. MCA497; RRID: AB_2335599 Granzyme B (mouse) R&D Cat. AF1865; RRID: AB_2294988 iNOS (mouse) abcam Cat. ab178945; RRID: AB_2861417 iNOS AF555 (mouse) abcam Cat. ab209594; RRID: AB_2889252 Klrb1c/CD161c (mouse) CST Cat. 39197; RRID: AB_2892989 PD-L1 (mouse) CST Cat. 64988; RRID: AB_2799672 CD206 (mannose receptor, mouse) abcam Cat. ab300621; RRID: AB_2935881 Normal Rabbit IgG CST Cat. 2729; RRID: AB_1031062 FoxA1/HNF3α CST Cat. 53528; RRID: AB_2799438 AKT CST Cat. 9272; RRID: AB_329827 Anti-Mouse IgG-HRP MBL Cat. 330; RRID: AB_2650507 Anti-Rabbit IgG-HRP MBL Cat. 458; RRID: AB_2827722 Anti-Rat IgG-HRP PGI Cat. SA00001-15; RRID: AB_2864369 c-Myc/N-Myc CST Cat. 13987; RRID: AB_2631168 N-Ras (mouse) Santacruz Cat. sc-31; RRID: AB_628041 p44/42 MAPK (ERK1/2) CST Cat. 4695; RRID: AB_390779 p-Akt (Ser473) CST Cat. 4060; RRID: AB_2315049 PD-L1 CST Cat. 13684; RRID: AB_2687655 PD-L1 (mouse) BioXCell Cat. BE0101; RRID: AB_10949073 p-p44/42 MAPK (ERK1/2) CST Cat. 4370; RRID: AB_2315112 p-S6 Ribosomal Protein (Ser235/236) CST Cat. 2211; RRID: AB_331679 S6 Ribosomal Protein CST Cat. 2217; RRID: AB_331355 GRHL2 Novus Cat. H00079977-A01; RRID: AB_2113415 GRHL2 Sigma-Aldrich Cat. HPA004820; RRID: AB_1857928 β-Actin MBL Cat. M177-3; RRID: AB_10697039 CD8 BioXCell Cat. BE0004-1; RRID: AB_1107671 MIAP410 monoclonal InVivoMAb anti-mouse/human/rat CD47 (IAP) BioXCell Cat. BE0283; RRID:AB_2894817 Atezolizumab Chugai Pharmaceutical N/A Mouse IgG2B Isotype Control R & D Systems Cat: MAB004; AB_357346 Rabbit (DA1E) mAb IgG Isotype Control CST Cat: 3900; AB_1550038 CD3ε (mouse) Biolegend Cat. 100340; AB_11149115 CD28 (mouse) Biolegend Cat. 122021; AB_2810370 Rat IgG1 Biolegend Cat. 400432; AB_11150772 Biological samples Human peripheral blood mononuclear cells This paper N/A Human CD14 + PromoCell Cat. C-12909 Murine peritoneal macrophages This paper N/A Murine CD8 + This paper N/A Chemicals, peptides, and recombinant proteins Sotorasib Chemgood Cat. C-1499 Adagrasib Chemgood Cat. C-1526 MRTX-1133 Chemgood Cat. C-1420 Human M-CSF Biolegend Cat. 574802 100 U/mL penicillin, 100 μg/mL streptomycin Nacalai Tesque Cat. 26253-84 Afamin/Wnt3a CM MBL Cat. J2-001 R-spondin 1 R&D Systems Cat. 4645-RS/CF Noggin Peprotech Cat. 250-38 4-hydroxy Tamoxifen Cayman Chemical Cat. 17308 PMA Sigma Aldrich Cat. P1585 LPS Sigma-Aldrich Cat L2630 IL-4 Wako Cat. 098-03964 IL-13 Wako Cat. 091-05171 CFSE DOJINDO Cat. 341-07401 PKH-26 Sigma Aldrich Cat. MINI26 IL-2 Roche Cat. 10799068001 DAPI solution DOJINDO Cat. D523 protein G Sepharose Cytiva Cat. 17061801 Dynabeads protein G Invitrogen Cat. 10004D proteinase K QIAGEN Cat. 19133 2-Mercaptoethanol Wako Cat. 133-14571 L-Glutamine Nacalai Tesque Cat. 16919-42 Critical commercial assays DC protein assay Bio-Rad Cat. 5000112 Tumor Dissociation Kit Miltenyi Cat. 130-096-730 Zombie Aqua Fixable Viability Kit Biolegend Cat. 423102 Universal Plus mRNA-Seq with NuQuant TECAN N/A Cell Counting Kit-8 DOJINDO Cat. CK04 NucleoSpin RNA Plus MACHEREY-NAGEL Cat. 740984 High-Capacity cDNA Reverse Transcription Kit Thermo Fisher Cat. 4374967 TB Green Premix Ex Taq™ II TAKARA Bio Cat. RR820 Mouse IFN-gamma Quantikine ELISA Kit R&D Systems MIF00-1 Deposited data ATAC-seq This paper GEO: GSE266309 RNA-seq This paper GEO: GSE268430 Spatial transcriptomics This Paper GEO: GSE291687 Uncropped western blot images This Paper https://data.mendeley.com/datasets/29ww4s2sp4/1 Experimental models: Cell lines NCI-H358 ATCC CRL-5807 MCF7 ATCC HTB-22 GP5d ECACC 95090715 MIA Paca-2 ATCC CRL-1420 LLC ATCC CRL-1642 LU65 JCRB JCRB0079 THP-1 JCRB JCRB0112.1 RW7213 Mariadason et al. N/A NCI-H358 AMGR Adachi et al. 12 N/A LU65 AMGR Adachi et al. 12 N/A CKPS G12C This paper N/A Experimental models: Organisms/strains Mouse: Ctnnb1 flox(ex3) Harada et al. 42 N/A Mouse: KrasLSL-G12C: B6; 129S4-Kras em1Ldow The Jackson Laboratory RRID: IMSR_JAX:033068 Mouse: Trp53 flox/flox tm1Brn The Jackson Laboratory RRID: IMSR_JAX:008462 Mouse: Smad4 flox/flox tm2.1Cxd The Jackson Laboratory RRID: IMSR_JAX:017462 Mouse: Lgr5-EGFP-IRES-CreERT2: B6.129P2-Lgr5 tm1(cre/ERT2)Cle The Jackson Laboratory RRID: IMSR_JAX:008875 Mouse: C57BL/6JJcl SLC Japan and CLEA Japan N/A Oligonucleotides Primers for qPCR and CRISPR KO, see Table S4 This paper N/A Recombinant DNA pLV-eGFP Addgene Plasmid 36083 pLX304-YAP S6A Addgene Plasmid 42562 plenti-V5-eGFP This paper N/A plenti-V5-YAP S6A This paper N/A plenti-CRISPR V2 Addgene Plasmid 52961 plenti-CRISPR V2-sgFOXA1 This paper N/A plenti-CRISPR V2-sgGRHL2 This paper N/A plenti-CRISPR V2-sgNras This paper N/A pRSV-Rev Addgene Plasmid 12253 pMDLg/pRRE Addgene Plasmid 12251 pMD2.G Addgene Plasmid 12259 Software and algorithms Analyze AnalyzeDirect, Inc N/A Chemiluminescence Imaging System AI680 M&S Instruments Inc N/A FlowJo FlowJo LLC https://www.flowjo.com/ Fast QC Babraham Bioinformatics https://www.bioinformatics.babraham.ac.uk/projects/fastqc/ PePr Zhang et al. 43 https://github.com/shawnzhangyx/PePr HOMER Heinz et al. 44 http://homer.ucsd.edu/homer/ FIMO Grant et al. 45 http://meme-suite.org/tools/fimo IGV Robinson et al. 46 https://igv.org/doc/desktop/ Fastp Chen et al. 47 https://github.com/OpenGene/fastp kallisto Bray et al. 48 https://pachterlab.github.io/kallisto/ R The R Project for Statistical Computing https://www.r-project.org/ GSEA Subramanian et al. 49 https://www.gsea-msigdb.org/gsea/index.jspMSigDB MSigDB Liberzon et al. 50 https://www.gsea-msigdb.org/gsea/msigdb Seurat Hao et al. 51 https://github.com/satijalab/seurat Space Ranger software 10x Genomics https://www.10xgenomics.com/support/software/space-ranger/ Harmony Korsunsky et al. 52 https://github.com/immunogenomics/harmony GraphPad Prism (9) GraphPad Software N/A Experimental model and study participant details Cell lines and reagents NCI-H358, MCF7, 293T, MIA PaCa-2, and LLC were purchased from the American Type Culture Collection. LU65 and THP-1 were obtained from the Japanese Cell Research Bank (Osaka, Japan). GP5d was obtained from ECACC. RW7213 cells were kindly provided by Dr. Diego Arango. NCI-H358 and LU65 cells resistant to sotorasib were generated previously. 12 in vitro Human monocyte-derived macrophage preparation Human CD14 + + in vitro Establishment of CKPS G12C cell line All animal studies received approval from the Animal Care and Use Committee of the Aichi Cancer Center Research Institute (Approved #R-5-2-A and R3-2). The creation of Ctnnb1 flox(ex3) 42 Trp53 flox/flox Smad4 flox/flox Lgr5 EGFP-IRES-Cre ERT2 53 Animal studies For the generation of orthotopic mouse syngeneic models, a suspension of 5 × 10 5 3 In the CKPS G12C experiments, a suspension of 2 × 10 6 3 Method details Plasmids The plasmids pLV-eGFP and pLX304-YAP S6A were acquired from Addgene (#36083 and #42562). Plasmids were recombined into the plenti-V5 vector using in-fusion cloning (Takara Bio) following the manufacturer’s protocol. CRISPR Cas9 knockout The sequence of single guide RNA (sgRNA) for FOXA1, GRHL2, and mouse Nras was designed using online CRISPR design tool (CRISPR direct) and shown in Table S5 siRNA knockdown Cells were seeded into 6-well plates at a density of 1–2 × 10 5 Western blot analysis Cells were lysed with cell lysis buffer (50 mM Tris-HCl, pH 7.5, 2% SDS, 10% glycerol, 12.5 mM EDTA). After sonication, protein concentration was determined by the DC protein assay (Biorad). Protein samples were mixed with an appropriate volume of 4× SDS-PAGE sample buffer and incubated at 98C° for 5 min. In western blot analysis, proteins were separated by SDS-PAGE electrophoresis and then transferred to Polyvinylidene Difluoride membranes. Signal detection was performed using the Chemiluminescence Imaging System AI680 (M&S Instruments Inc, Tokyo, Japan). All western blot experiments were replicated at least twice, and representative results are presented. Preparation of macrophages For in vitro 54 ex vivo Phagocytosis assay For in vitro ex vivo in vivo + + in vitro ex vivo + + in vivo For experiments to determine the contribution of FcγR-mediated phagocytosis, macrophages were pre-incubated for one hour with a combination of 4 μg/mL of anti-CD16 (clone 3G8; Biolegend), anti-CD32 (clone IV3; STEMCELL Technologies), and anti-CD64 (clone 10.1; Biolegend). These antibodies were also added at 2 μg/mL during co-culture with tumor cells. Flow cytometry for in vitro Cells were stained with a fixable viability kit (Biolegend) and fixed with 4% PFA. Subsequently, cells were stained with the indicated primary antibodies. In the case of unconjugated primary antibodies, secondary antibodies were applied. The MFI of cell surface expression was analyzed using a BD LRSFortessa X 20 or Cytoflex flow cytometer. Primary and secondary antibodies are listed in the key resources table Flow cytometry for in vivo EGFP-expressing LLC Nras KO cells were injected into the lungs of 6- to 8-week-old C57BL/6 male mice. After one week of injection, tumors were treated with vehicle or sotorasib (100 mg/kg daily) for 3 days ( n T cell activation assessed by IFNγ ELISA analysis Cell culture plates were coated with 10 μg/mL anti-CD3 antibody (clone 145-2C11, BioLegend) overnight at 4°C prior to seeding CD8 + + + Immunofluorescence Tumor tissues were fixed in 4% PFA overnight. On the following day, samples were stored in 70% ethanol before being embedded in paraffin or in 30% sucrose, followed by embedment in O.C.T. compound (SAKURA). While embedded tissues were sliced at 5μm-thickness, deparaffinization was performed only for paraffin-embedded samples. Tissue sections were washed with PBS and permeabilized by 0.3% Triton X-100 in PBS for 10 min. Sections were washed with PBS and incubated with 1x blocking buffer (Abcam) for 5 min. Sections were incubated with the indicated primary antibody diluted in PBS containing 5% BSA at 4C° overnight. Sections were subsequently washed with PBS and incubated with a fluorescently labeled secondary antibody and DAPI solution (DOJINDO) for 1 hour at room temperature. After washing with PBS, slides were mounted with an antifade mounting medium (Vectashield) and analyzed by a confocal microscope LSM900 (ZEISS). ChIP assay NCI-H358 cells were cross-linked with 1% PFA for 10 min at room temperature. Cells were then washed twice with ice-cold PBS, harvested by scraping, pelleted, and lysed with ChIP lysis buffer (1% SDS, 10mM EDTA, 50mM Tris HCl pH 8.1). Chromatin was sonicated by Covaris M220 to obtain fragments of 200 bp. After removal of a control aliquot (input DNA), samples were incubated at 4°C overnight with protein G Sepharose blocked by salmon sperm DNA with FOXA1 antibody or normal rabbit IgG, or with Dynabeads protein G blocked by salmon sperm DNA with GRHL2 antibody or normal rabbit IgG. After extensive washing, bound chromatin was eluted using ChIP elution buffer (1% SDS, 0.1M NaHCO3), de-crosslinked, and digested with proteinase K (QIAGEN). CHIP DNA was purified by phenol/chloroform extraction and quantified by qPCR. ATAC-sequencing NCI-H358 cells were treated with DMSO or 1uM sotorasib for 72 h. The cells (3 × 10 5 43 44 http://meme-suite.org/tools/fimo 45 46 RNA-seq and gene-level abundance quantification An RNA-seq library was prepared using Universal Plus mRNA-Seq with NuQuant(TECAN, 0521-A1)and sequenced as 100-bp paired-end reads using DNBSEQ-G400RS (MGI Tech Co., Ltd.). For bulk RNA-seq data of macrophage samples with phagocytosis and non-phagocytosis (duplicates for each condition), normalized gene-level expression values were estimated as follows: First, fastp (v0.23.4) 47 48 55 GSEA For each gene, log2-foldchange (log2FC) of the gene expression values between macrophages with phagocytosis and non-phagocytosis were calculated by log 2 F C i = log 2 E ¯ i P + 1 E ¯ i N + 1 , E ¯ i P E ¯ i N i 49 50 Spatial transcriptomic analysis Spatial transcriptomics analysis of FFPE samples was conducted using the Visium HD Spatial Gene Expression platform (10x Genomics, Inc., Pleasanton, CA, USA). Libraries were sequenced on a NovaSeq X Plus (Illumina, Inc., San Diego, CA, USA). For the spatial transcriptome data obtained from Visium HD, FASTQ files and hematoxylin and eosin (H&E)-stained tissue images were processed using 10x Genomics Space Ranger software (v3.0.1). Sequencing reads were aligned to the 10x Genomics transcriptome reference (v2020-A), which is based on the mouse reference genome mm10 (GENCODE vM23/Ensembl 98). Mapped reads were then assigned to their respective spatial positions, corresponding to 2 × 2μm barcoded grid squares on the capture areas. Following the manufacturer’s recommendation, reads from adjacent grids were aggregated into 8 × 8μm bins to avoid data sparsity. Our spatial datasets consist of four samples, i.e., the vehicle-treated tumor (control), the anti-CD47-antibody treated tumor, the sotorasib treated tumor, and the tumor treated with the combination of anti-CD47 antibody and sotorasib. For each captured area, a pair of samples were measured: one treated with the control and sotorasib, and the other treated with the anti-CD47 antibody and the combination. The region of interest (ROI) for each of the samples was selected using 10x Genomics Loupe Browser (v8.1.2). For further downstream analysis, we used the R (v4.4.1, https://www.R-project.org/ 51 The filtered bins from the four samples were integrated using the \"RunHarmony\" function in the Harmony package (v1.2.1) 52 Marker genes for each cluster were identified through the differential gene expression (DEG) analysis using the MAST method implemented in the MAST package (v1.32.0) 56 The bins with integrated gene expression values were visualized using UMAP dimensionality reduction, as shown in Figure 3 https://www.cellkb.com Cell viability assay 2×10 3 n Quantitative PCR analysis RNA was extracted using the NucleoSpin RNA Plus (MACHEREY-NAGEL), and cDNA was generated by the High-Capacity cDNA Reverse Transcription Kit (Thermo Fisher) according to the manufacturer’s instructions. Quantitative real-time PCR was performed using TB Green Premix Ex Taq II (Takara Bio). Each sample was normalized to the housekeeping gene ubiquitin or β2-microgloblin. All samples were analyzed in triplicate, and the relative expression to control samples was determined. Primer sets are shown in Table S5 Quantification and statistical analysis Sample sizes were determined based on commonly used numbers in published literature rather than specific statistical methods. All data were included in the analysis. Investigators were blinded to group allocation during RNA-seq data analysis. For lung cancer mouse model experiments, technicians and researchers were blinded to group allocation during data collection (tumor measurement). Unpaired Student’s t-test was used in Figures 1 2 3 4 5 S1 S2 S3 S5 Figures 4 5 S6 Figures 5 S6 p References 1 Prior I.A. Hood F.E. Hartley J.L. The Frequency of Ras Mutations in Cancer Cancer Res. 80 2020 2969 2974 10.1158/0008-5472.CAN-19-3682 32209560 PMC7367715 2 Pylayeva-Gupta Y. Grabocka E. Bar-Sagi D. RAS oncogenes: weaving a tumorigenic web Nat. Rev. Cancer 11 2011 761 774 10.1038/nrc3106 21993244 PMC3632399 3 Liao W. Overman M.J. Boutin A.T. Shang X. Zhao D. Dey P. Li J. Wang G. Lan Z. Li J. KRAS-IRF2 Axis Drives Immune Suppression and Immune Therapy Resistance in Colorectal Cancer Cancer Cell 35 2019 559 572.e7 10.1016/j.ccell.2019.02.008 30905761 PMC6467776 4 Mugarza E. van Maldegem F. Boumelha J. Moore C. Rana S. Llorian Sopena M. East P. Ambler R. Anastasiou P. Romero-Clavijo P. Therapeutic KRAS(G12C) inhibition drives effective interferon-mediated antitumor immunity in immunogenic lung cancers Sci. Adv. 8 2022 eabm8780 10.1126/sciadv.abm8780 PMC9299537 35857848 5 Muthalagu N. Monteverde T. Raffo-Iraolagoitia X. Wiesheu R. Whyte D. Hedley A. Laing S. Kruspig B. Upstill-Goddard R. Shaw R. Repression of the Type I Interferon Pathway Underlies MYC- and KRAS-Dependent Evasion of NK and B Cells in Pancreatic Ductal Adenocarcinoma Cancer Discov. 10 2020 872 887 10.1158/2159-8290.CD-19-0620 32200350 PMC7611248 6 Pylayeva-Gupta Y. Lee K.E. Hajdu C.H. Miller G. Bar-Sagi D. Oncogenic Kras-induced GM-CSF production promotes the development of pancreatic neoplasia Cancer Cell 21 2012 836 847 10.1016/j.ccr.2012.04.024 22698407 PMC3721510 7 Canon J. Rex K. Saiki A.Y. Mohr C. Cooke K. Bagal D. Gaida K. Holt T. Knutson C.G. Koppada N. The clinical KRAS(G12C) inhibitor AMG 510 drives anti-tumour immunity Nature 575 2019 217 223 10.1038/s41586-019-1694-1 31666701 8 Briere D.M. Li S. Calinisan A. Sudhakar N. Aranda R. Hargis L. Peng D.H. Deng J. Engstrom L.D. Hallin J. The KRAS(G12C) Inhibitor MRTX849 Reconditions the Tumor Immune Microenvironment and Sensitizes Tumors to Checkpoint Inhibitor Therapy Mol. Cancer Therapeut. 20 2021 975 985 10.1158/1535-7163.MCT-20-0462 PMC8444277 33722854 9 Garassino M.C. Theelen W.S.M.E. Jotte R. Laskin J. de Marinis F. Aguado C. Badin F.B. Chmielewska I. Hochmai r.M.J. Lu S. LBA65 KRYSTAL-7: Efficacy and safety of adagrasib with pembrolizumab in patients with treatment-naïve, advanced non-small cell lung cancer (NSCLC) harboring a KRASG12C mutation Ann. Oncl. 34 2023 S1309 S1310 10 Topper M.J. Vaz M. Chiappinelli K.B. DeStefano Shields C.E. Niknafs N. Yen R.W.C. Wenzel A. Hicks J. Ballew M. Stone M. Epigenetic Therapy Ties MYC Depletion to Reversing Immune Evasion and Treating Lung Cancer Cell 171 2017 1284 1300.e21 10.1016/j.cell.2017.10.022 29195073 PMC5808406 11 Casey S.C. Tong L. Li Y. Do R. Walz S. Fitzgerald K.N. Gouw A.M. Baylot V. Gütgemann I. Eilers M. Felsher D.W. MYC regulates the antitumor immune response through CD47 and PD-L1 Science 352 2016 227 231 10.1126/science.aac9935 26966191 PMC4940030 12 Adachi Y. Ito K. Hayashi Y. Kimura R. Tan T.Z. Yamaguchi R. Ebi H. Epithelial-to-Mesenchymal Transition is a Cause of Both Intrinsic and Acquired Resistance to KRAS G12C Inhibitor in KRAS G12C-Mutant Non-Small Cell Lung Cancer Clin. Cancer Res. 26 2020 5962 5973 10.1158/1078-0432.CCR-20-2077 32900796 13 Amodio V. Yaeger R. Arcella P. Cancelliere C. Lamba S. Lorenzato A. Arena S. Montone M. Mussolin B. Bian Y. EGFR Blockade Reverts Resistance to KRAS(G12C) Inhibition in Colorectal Cancer Cancer Discov. 10 2020 1129 1139 10.1158/2159-8290.CD-20-0187 32430388 PMC7416460 14 Logtenberg M.E.W. Scheeren F.A. Schumacher T.N. The CD47-SIRPalpha Immune Checkpoint Immunity 52 2020 742 752 10.1016/j.immuni.2020.04.011 32433947 PMC7340539 15 Genin M. Clement F. Fattaccioli A. Raes M. Michiels C. M1 and M2 macrophages derived from THP-1 cells differentially modulate the response of cancer cells to etoposide BMC Cancer 15 2015 577 10.1186/s12885-015-1546-9 26253167 PMC4545815 16 Adachi Y. Kimura R. Hirade K. Yanase S. Nishioka Y. Kasuga N. Yamaguchi R. Ebi H. Scribble mis-localization induces adaptive resistance to KRAS G12C inhibitors through feedback activation of MAPK signaling mediated by YAP-induced MRAS Nat. Cancer 4 2023 829 843 10.1038/s43018-023-00575-2 37277529 17 Oki S. Ohta T. Shioi G. Hatanaka H. Ogasawara O. Okuda Y. Kawaji H. Nakaki R. Sese J. Meno C. ChIP-Atlas: a data-mining suite powered by full integration of public ChIP-seq data EMBO Rep. 19 2018 e46255 10.15252/embr.201846255 PMC6280645 30413482 18 Barkal A.A. Brewer R.E. Markovic M. Kowarsky M. Barkal S.A. Zaro B.W. Krishnan V. Hatakeyama J. Dorigo O. Barkal L.J. Weissman I.L. CD24 signalling through macrophage Siglec-10 is a target for cancer immunotherapy Nature 572 2019 392 396 10.1038/s41586-019-1456-0 31367043 PMC6697206 19 Murray P.J. Allen J.E. Biswas S.K. Fisher E.A. Gilroy D.W. Goerdt S. Gordon S. Hamilton J.A. Ivashkiv L.B. Lawrence T. Macrophage activation and polarization: nomenclature and experimental guidelines Immunity 41 2014 14 20 10.1016/j.immuni.2014.06.008 25035950 PMC4123412 20 Ma R.Y. Black A. Qian B.Z. Macrophage diversity in cancer revisited in the era of single-cell omics Trends Immunol. 43 2022 546 563 10.1016/j.it.2022.04.008 35690521 21 Viola A. Munari F. Sánchez-Rodríguez R. Scolaro T. Castegna A. The Metabolic Signature of Macrophage Responses Front. Immunol. 10 2019 1462 10.3389/fimmu.2019.01462 31333642 PMC6618143 22 Lin H. Wei S. Hurt E.M. Green M.D. Zhao L. Vatan L. Szeliga W. Herbst R. Harms P.W. Fecher L.A. Host expression of PD-L1 determines efficacy of PD-L1 pathway blockade-mediated tumor regression J. Clin. Investig. 128 2018 1708 10.1172/JCI120803 29608143 PMC5873851 23 Wang L. Guo W. Guo Z. Yu J. Tan J. Simons D.L. Hu K. Liu X. Zhou Q. Zheng Y. PD-L1-expressing tumor-associated macrophages are immunostimulatory and associate with good clinical outcome in human breast cancer Cell Rep. Med. 5 2024 101420 10.1016/j.xcrm.2024.101420 PMC10897617 38382468 24 Molina-Arcas M. Downward J. Exploiting the therapeutic implications of KRAS inhibition on tumor immunity Cancer Cell 42 2024 338 357 10.1016/j.ccell.2024.02.012 38471457 25 Xue J.Y. Zhao Y. Aronowitz J. Mai T.T. Vides A. Qeriqi B. Kim D. Li C. de Stanchina E. Mazutis L. Rapid non-uniform adaptation to conformation-specific KRAS(G12C) inhibition Nature 577 2020 421 425 10.1038/s41586-019-1884-x 31915379 PMC7308074 26 Betancur P.A. Abraham B.J. Yiu Y.Y. Willingham S.B. Khameneh F. Zarnegar M. Kuo A.H. McKenna K. Kojima Y. Leeper N.J. A CD47-associated super-enhancer links pro-inflammatory signalling to CD47 upregulation in breast cancer Nat. Commun. 8 2017 14802 10.1038/ncomms14802 PMC5382276 28378740 27 Zhao Y. Cao Y. Chen Y. Wu L. Hang H. Jiang C. Zhou X. B2M gene expression shapes the immune landscape of lung adenocarcinoma and determines the response to immunotherapy Immunology 164 2021 507 523 10.1111/imm.13384 34115389 PMC8517590 28 Barkal A.A. Weiskopf K. Kao K.S. Gordon S.R. Rosental B. Yiu Y.Y. George B.M. Markovic M. Ring N.G. Tsai J.M. Engagement of MHC class I by the inhibitory receptor LILRB1 suppresses macrophages and is a target of cancer immunotherapy Nat. Immunol. 19 2018 76 84 10.1038/s41590-017-0004-z 29180808 PMC5832354 29 Yang H. Schramek D. Adam R.C. Keyes B.E. Wang P. Zheng D. Fuchs E. ETS family transcriptional regulators drive chromatin dynamics and malignancy in squamous cell carcinomas eLife 4 2015 e10870 10.7554/eLife.10870 PMC4739765 26590320 30 Xu Y. Wu Y. Zhang S. Ma P. Jin X. Wang Z. Yao M. Zhang E. Tao B. Qin Y. A Tumor-Specific Super-Enhancer Drives Immune Evasion by Guiding Synchronous Expression of PD-L1 and PD-L2 Cell Rep. 29 2019 3435 3447.e4 10.1016/j.celrep.2019.10.093 31825827 31 Hu H. Cheng R. Wang Y. Wang X. Wu J. Kong Y. Zhan S. Zhou Z. Zhu H. Yu R. Oncogenic KRAS signaling drives evasion of innate immune surveillance in lung adenocarcinoma by activating CD47 J. Clin. Investig. 133 2023 e153470 10.1172/JCI153470 PMC9843062 36413402 32 Locati M. Curtale G. Mantovani A. Diversity, Mechanisms, and Significance of Macrophage Plasticity Annu. Rev. Pathol. 15 2020 123 147 10.1146/annurev-pathmechdis-012418-012718 31530089 PMC7176483 33 Lemke G. How macrophages deal with death Nat. Rev. Immunol. 19 2019 539 549 10.1038/s41577-019-0167-y 31019284 PMC6733267 34 Pu Y. Ji Q. Tumor-Associated Macrophages Regulate PD-1/PD-L1 Immunosuppression Front. Immunol. 13 2022 874589 10.3389/fimmu.2022.874589 PMC9110638 35592338 35 Gonzalez M.A. Lu D.R. Yousefi M. Kroll A. Lo C.H. Briseño C.G. Watson J.E.V. Novitskiy S. Arias V. Zhou H. Phagocytosis increases an oxidative metabolic and immune suppressive signature in tumor macrophages J. Exp. Med. 220 2023 e20221472 10.1084/jem.20221472 PMC10067971 36995340 36 Su S. Zhao J. Xing Y. Zhang X. Liu J. Ouyang Q. Chen J. Su F. Liu Q. Song E. Immune Checkpoint Inhibition Overcomes ADCP-Induced Immunosuppression by Macrophages Cell 175 2018 442 457.e23 10.1016/j.cell.2018.09.007 30290143 37 Kemp S.B. Cheng N. Markosyan N. Sor R. Kim I.K. Hallin J. Shoush J. Quinones L. Brown N.V. Bassett J.B. Efficacy of a Small-Molecule Inhibitor of KrasG12D in Immunocompetent Models of Pancreatic Cancer Cancer Discov. 13 2023 298 311 10.1158/2159-8290.CD-22-1066 36472553 PMC9900321 38 Mainardi S. With a little help from my T friends: T cells increase efficacy of KRAS (G12D) inhibitors Cell Rep. Med. 4 2023 100950 10.1016/j.xcrm.2023.100950 PMC9975326 36812887 39 van Maldegem F. Valand K. Cole M. Patel H. Angelova M. Rana S. Colliver E. Enfield K. Bah N. Kelly G. Characterisation of tumour microenvironment remodelling following oncogene inhibition in preclinical studies with imaging mass cytometry Nat. Commun. 12 2021 5906 10.1038/s41467-021-26214-x 34625563 PMC8501076 40 Li B.T. Falchook G.S. Durm G.A. Burns T.F. Skoulidis F. Ramalingam S.S. Spira A. Bestvina C.M. Goldberg S.B. Veluswamy R. OA03.06 CodeBreaK 100/101: First Report of Safety/Efficacy of Sotorasib in Combination with Pembrolizumab or Atezolizumab in Advanced KRAS p.G12C NSCLC J. Thorac. Oncol. 17 2022 S10 S11 41 Maute R. Xu J. Weissman I.L. CD47-SIRPalpha-targeted therapeutics: status and prospects Immunooncol. Technol. 13 2022 100070 10.1016/j.iotech.2022.100070 PMC9216458 35754851 42 Harada N. Tamai Y. Ishikawa T. Sauer B. Takaku K. Oshima M. Taketo M.M. Intestinal polyposis in mice with a dominant stable mutation of the beta-catenin gene EMBO J. 18 1999 5931 5942 10.1093/emboj/18.21.5931 10545105 PMC1171659 43 Zhang Y. Lin Y.H. Johnson T.D. Rozek L.S. Sartor M.A. PePr: a peak-calling prioritization pipeline to identify consistent or differential peaks from replicated ChIP-Seq data Bioinformatics 30 2014 2568 2575 10.1093/bioinformatics/btu372 24894502 PMC4155259 44 Heinz S. Benner C. Spann N. Bertolino E. Lin Y.C. Laslo P. Cheng J.X. Murre C. Singh H. Glass C.K. Simple combinations of lineage-determining transcription factors prime cis-regulatory elements required for macrophage and B cell identities Mol. Cell 38 2010 576 589 10.1016/j.molcel.2010.05.004 20513432 PMC2898526 45 Grant C.E. Bailey T.L. Noble W.S. FIMO: scanning for occurrences of a given motif Bioinformatics 27 2011 1017 1018 10.1093/bioinformatics/btr064 21330290 PMC3065696 46 Robinson J.T. Thorvaldsdóttir H. Winckler W. Guttman M. Lander E.S. Getz G. Mesirov J.P. Integrative genomics viewer Nat. Biotechnol. 29 2011 24 26 10.1038/nbt.1754 21221095 PMC3346182 47 Chen S. Zhou Y. Chen Y. Gu J. fastp: an ultra-fast all-in-one FASTQ preprocessor Bioinformatics 34 2018 i884 i890 10.1093/bioinformatics/bty560 30423086 PMC6129281 48 Bray N.L. Pimentel H. Melsted P. Pachter L. Near-optimal probabilistic RNA-seq quantification Nat. Biotechnol. 34 2016 525 527 10.1038/nbt.3519 27043002 49 Subramanian A. Tamayo P. Mootha V.K. Mukherjee S. Ebert B.L. Gillette M.A. Paulovich A. Pomeroy S.L. Golub T.R. Lander E.S. Mesirov J.P. Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles Proc. Natl. Acad. Sci. USA 102 2005 15545 15550 10.1073/pnas.0506580102 16199517 PMC1239896 50 Liberzon A. Birger C. Thorvaldsdóttir H. Ghandi M. Mesirov J.P. Tamayo P. The Molecular Signatures Database (MSigDB) hallmark gene set collection Cell Syst. 1 2015 417 425 10.1016/j.cels.2015.12.004 26771021 PMC4707969 51 Hao Y. Stuart T. Kowalski M.H. Choudhary S. Hoffman P. Hartman A. Srivastava A. Molla G. Madad S. Fernandez-Granda C. Satija R. Dictionary learning for integrative, multimodal and scalable single-cell analysis Nat. Biotechnol. 42 2024 293 304 10.1038/s41587-023-01767-y 37231261 PMC10928517 52 Korsunsky I. Millard N. Fan J. Slowikowski K. Zhang F. Wei K. Baglaenko Y. Brenner M. Loh P.R. Raychaudhuri S. Fast, sensitive and accurate integration of single-cell data with Harmony Nat. Methods 16 2019 1289 1296 10.1038/s41592-019-0619-0 31740819 PMC6884693 53 Kajino-Sakamoto R. Fujishita T. Taketo M.M. Aoki M. Synthetic lethality between MyD88 loss and mutations in Wnt/beta-catenin pathway in intestinal tumor epithelial cells Oncogene 40 2021 408 420 10.1038/s41388-020-01541-3 33177648 54 Chanput W. Mes J.J. Wichers H.J. THP-1 cell line: an in vitro cell model for immune modulation approach Int. Immunopharmacol. 23 2014 37 45 10.1016/j.intimp.2014.08.002 25130606 55 Harrow J. Frankish A. Gonzalez J.M. Tapanari E. Diekhans M. Kokocinski F. Aken B.L. Barrell D. Zadissa A. Searle S. GENCODE: the reference human genome annotation for The ENCODE Project Genome Res. 22 2012 1760 1774 10.1101/gr.135350.111 22955987 PMC3431492 56 Finak G. McDavid A. Yajima M. Deng J. Gersuk V. Shalek A.K. Slichter C.K. Miller H.W. McElrath M.J. Prlic M. MAST: a flexible statistical framework for assessing transcriptional changes and characterizing heterogeneity in single-cell RNA sequencing data Genome Biol. 16 2015 278 10.1186/s13059-015-0844-5 26653891 PMC4676162 Supplemental information  Document S1. Figures S1–S6 Table S1. Transcription factors associated with peaks identified in ATAC-seq analysis, related to Figure 2 Table S2. Results of statistical tests for differentially expressed genes in each macrophage clusters, related to Figure 3 Table S3. Gene expression data identified by RNA sequencing analysis comparing non-phagocytic macrophages with phagocytic macrophages, related to Figure S5 Table S4. Percentage of PD-L1-expressing cells in flow cytometry analyses, related to Figure S5 Table S5. Primers used in this study, related to STAR Methods Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102317 ",
  "metadata": {
    "Title of this paper": "MAST: a flexible statistical framework for assessing transcriptional changes and characterizing heterogeneity in single-cell RNA sequencing data",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490217/"
  }
}