{
  "title": "Paper_839",
  "abstract": "Cancer Prev Res (Phila) Cancer Prev Res (Phila) 319 nihpa Cancer prevention research (Philadelphia, Pa.) 1940-6207 1940-6215 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12478563 PMC12478563.1 12478563 12478563 NIHMS2105765 40625204 10.1158/1940-6207.CAPR-24-0544 NIHMS2105765 NIHPA2105765 1 Article Lung Cancer Screening among Adults Older than Medicare’s Upper Age Eligibility Criteria Hernandez Monica 1 Maki Kristin G. 2 Zhao Hui 1 Toumazis Iakovos 1 Volk Robert J. 1 * 1 2 * BVolk@mdanderson.org 08 7 2025 497744 10.1158/1940-6207.CAPR-24-0544 19 09 2025 29 09 2025 30 09 2025 30 09 2025 Implications on the loss of lung cancer screening (LCS) coverage among Medicare recipients aged 77+ have not been explored. We use a 2022 Behavioral Risk Factor Surveillance System (BRFSS) dataset to examine LCS patterns of screen-eligible adults across three age groups: 65–70, 71–77, 78–79 years. In descriptive analyses, LCS-eligible respondents are compared by screening status across each age category. In regression analyses, we explore various sociodemographic and health-related factors that may help explain age-related differences between these groups. Less than a third of our sample reported LCS in the last year (26.3%). Among eligible respondents, adults aged 78–79 reported the highest LCS rates (32.0%) followed by adults aged 71–77 years (28.3%) and 65–70 years (24.2%). Respondents aged 78–79 and 65–70 years with COPD indicated significantly increased LCS odds (respectively, OR=3.37 [1.12–10.11]; OR=2.91 [1.98–4.27]). Respondents aged 78–79 years with history of a heart attack or kidney disease indicated significantly decreased LCS odds (respectively, OR=0.08 [0.01–0.62]; OR=0.06 [0.01–0.56]). Respondents aged 71–77 years with coronary heart disease indicated a significantly decreased LCS odds (OR=0.54 [0.30–0.96]). Although loss of CMS coverage for LCS is not associated with lower screening among BRFSS adults aged 78–79 years, clinicians should continue to consider the appropriateness of treatment for older LCS eligible adults with chronic health conditions. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf yes pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Lung Cancer Screening among Adults Older than Medicare’s Upper Age Eligibility Criteria",
    "Journal it was published in:": "Cancer prevention research (Philadelphia, Pa.)",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478563/"
  }
}