{
  "title": "Paper_352",
  "abstract": "pmc Radiat Oncol Radiat Oncol 402 radoncol Radiation Oncology (London, England) 1748-717X BMC PMC12487394 PMC12487394.1 12487394 12487394 41029330 10.1186/s13014-025-02720-w 2720 1 Research Optimization and characterization of acute radiation-induced esophagitis in mice Feng Jianhua 1 2 Liu Xiangjun 1 2 Xu Lu 2 Wang Ke 2 He Simin 1 2 Wang Xi 2 Huang Yujun 2 Wang Shubin 2 Lei Xudan 2 Huang Lingxiao 2 Xu Zhenni 2 Lang Jinyi langjinyi@scszlyy.org.cn 1 Liu Dengqun dengqunliu@uestc.edu.cn 2 Yin Jun gzyinjun@163.com 1 3 1 https://ror.org/04qr3zq92 grid.54549.39 0000 0004 0369 4060 Precision Radiation in Oncology Key Laboratory of Sichuan Province, Department of Radiation Oncology, Sichuan Cancer Hospital & Institute, Sichuan Provincial Engineering Research Center for Tumor Organoids and Clinical Transformation, Sichuan Clinical Research Center for Cancer, Sichuan Cancer Center, School of Medicine, University of Electronic Science and Technology of China, 2 https://ror.org/04qr3zq92 grid.54549.39 0000 0004 0369 4060 Precision Radiation in Oncology Key Laboratory of Sichuan Province, Department of Experimental Research, Sichuan Cancer Hospital & Institute, Sichuan Provincial Engineering Research Center for Tumor Organoids and Clinical Transformation, Sichuan Clinical Research Center for Cancer, Sichuan Cancer Center, School of Medicine, University of Electronic Science and Technology of China, 3 https://ror.org/00vva8g89 grid.460079.c Department of Medical Oncology, Affiliated Hospital of Sichuan Nursing Vocational College, The Third People’s Hospital of Sichuan Province, 30 9 2025 2025 20 478405 147 11 1 2025 26 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Purpose To optimize an animal model of acute radiation-induced esophagitis (RIE) in C57BL/6 mice and characterize the histopathological features of RIE at different stages. Materials and methods C57BL/6 mice were subjected to single thoracic X-ray irradiation at doses ranging from 5 to 30 Gy. Changes in body weight, daily food and water intake, and survival were monitored and compared within 2 weeks after radiation exposure. Epithelial damage to the esophagus, apoptosis, and inflammation at different times after irradiation were examined to characterize the pathological process of RIE. Results The incidence of acute RIE was strongly correlated with increasing radiation dose across all the experimental groups. No deaths were observed in mice that received 5 or 10 Gy of irradiation, whereas complete mortality was observed within 15 days after exposure to 30 Gy of irradiation. The mice in 20 Gy irradiation group had a low mortality rate. The peak of esophageal tissue damage occurred at Day 7 and was healed by Day 14 after exposure to 20 Gy of thoracic irradiation. The pathology of RIE was induced by radiation-induced DNA damage, apoptosis, reactive oxygen species (ROS), and mitochondrial impairment. Conclusions In this study, we found that a single 20 Gy thoracic irradiation was the optimal dose to establish acute RIE in C57BL/6 mice. Acute esophageal injury peaked on Day 7 after radiation, and the process of regeneration and repair was complete within 14 days. This work may be a useful reference for experimental research concerning RIE. Supplementary Information The online version contains supplementary material available at 10.1186/s13014-025-02720-w. Keywords Radiation Esophagitis Mitochondria ROS Regeneration https://doi.org/10.13039/501100001809 National Natural Science Foundation of China 81874255 https://doi.org/10.13039/100012542 Sichuan Provincial Science and Technology Support Program 2025NSFJQ0058 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Esophagitis is an inflammatory disease of the esophageal mucosa resulting from abnormal stimuli or injuries, including reflux, drug-induced, infectious, corrosive, and radiation esophagitis. Radiation-induced esophagitis (RIE) is the most frequent complication of radiotherapy for thoracic malignancies, such as lung cancer and esophageal cancer, with a high incidence ranging from 65 to 75%, and it accounts for nearly 100% of cases of esophageal cancer [ 1 2 3 4 5 Establishing an appropriate animal model is a fundamental step for understanding the pathology of clinical diseases and developing new therapeutic targets. The pathogenesis of ARIE has not been fully clarified until now, and it is potentially linked to direct DNA damage caused by radiation or the overproduction of free radicals and ROS generated by radiation interacting with intercellular water molecules [ 6 7 Currently, ARIE has been modeled in many animals, such as rabbits, rats, and mice. Rabbits are large enough to tolerate irradiations, and their esophageal tissues are readily accessible and straightforward to observe, rendering them an optimal animal model for ARIE. However, the high costs greatly increase the overall expense and limit their wide use. Rodents are currently the most widely used animals for RIE because of their high reproductive capacity, easy access to esophageal tissues, low prices, and greater options for genetic modification. For example, some studies established an ARIE model in C57BL/6 mice via single-dose irradiation at 25 Gy, and esophageal damage occurred after 5 days [ 8 9 10 60 11 12 15 131 14 Despite the context presented thus far, there is still a lack of consensus on the optimal radiation dosage to elicit ARIE in mice. In this study, we aimed to optimize the radiation dose for ARIE in mice to more closely reflect a similar process to that of clinical patients. We also characterized the pathological features of ARIE in mice, which revealed more specific intervention points for those different therapeutic strategies in the future. Methods and materials Animals Six to eight-week-old male C57BL/6 mice were obtained from HFK Bioscience Co., LTD (Beijing, China). Mice were accommodated in the specific pathogen-free (SPF) facility, subjected to a 12-h alternating light and dark schedule with access to water and food ad libitum. The experiments were conducted in accordance with the ethical standards outlined for laboratory animal research, and the protocols were licensed by Ethics Committee of Sichuan Cancer Hospital & Institute with the approval number SCCHEC-04–2023-014. Thoracic radiation protocol Radiation of mice was performed using X-RAD 320 irradiator (PXI, CT, USA). Briefly, mice were anesthetized with 1% (w/v) pentobarbital sodium solution and placed in trays covered with 1.5 mm Pb plate, and the exposure field between the base of the neck and the xiphoid process was adjusted to receive thorax irradiation. A single dose of X-ray radiation was delivered to the thorax, including the esophagus, bilateral lungs, and mediastinum, and the doses included 5 Gy, 10 Gy, 15 Gy, 20 Gy, 25 Gy, and 30 Gy. The dosing rate was 75 cGy/min., The radiation program was operated at 320 kV and 9 mA at a source-skin distance (SSD) of 50 cm from the target. Observation and tissue collection After thoracic irradiation, the general healthy status of mice was monitored for 14 days, including body weight, survival, and behavior activity. Daily food and water intakes were quantified during this period by measuring uneaten food and water levels in individual cages. Mice were euthanized by cervical dislocation to collect esophageal tissues on Day 3, Day 7, Day 10, and Day 14 after the irradiation. Histological analysis and Pathological score Esophageal tissues were excised, fixed in 4% cold paraformaldehyde (PFA), and embedded in paraffin following standard procedures. Sections with a thickness of 4 μm were deparaffinized and stained for hematoxylin–eosin (H&E), and then observed under the light microscope (Olympus BX53, Tokyo, Japan). Esophageal tissue damage and inflammatory cell infiltration were evaluated to determine the pathological alterations. The baseline for radiation esophagitis was a pathological score of 0, with the severity being determined by the cumulative score of tissue damage and inflammation [ 16 Immunostaining Esophageal sections were initially deparaffined by xylene and rehydrated by gradient ethanol. Subsequently, antigen retrieval was performed by boiling slides in Tris–EDTA Antigen Retrieval Solution (BL618A, Biosharp). And nonspecific binding was blocked using blocking buffer, which contained 1% solution of bovine serum albumin (BSA, A7906, Sigma-Aldrich) and 0.5% Triton X-100. Different primary antibodies were applied at a dilution of 1:200 and incubated at 4 °C overnight in the darkness. Primary antibodies utilized in this study encompassed mouse anti-proliferating cell nuclear antigen (PCNA, Santa), rat anti-F4/80, mouse anti-cytokeratin 14 (CK14, Abcam), rabbit anti-phospho-histone H3 (PHH3), anti-γH2AX, anti-myeloperoxidase (MPO), and anti-CD3 (Cell Signaling Technology) antibodies. On the subsequent day, HRP-conjugated secondary antibody solution (ZSBio, Beijing, China) was applied, followed by visualization through immunohistochemistry (IHC) using DAB kit (ZSBio, Beijing, China). Nucleus were counterstained by hematoxylin. For immunofluorescence (IF), highly cross-adsorbed donkey anti-rabbit or mouse IgG (H + L) conjugated with Alexa Fluor™ 488 or 594 (ThermoFisher Scientific, USA) were used, and slides were counterstained with VECTASHIELD Antifade Mounting Medium containing 4′6-diamidino-2-phenylindole (DAPI) (Vector Laboratories, Burlingame, CA). Images were captured using an Olympus BX53 microscope, or Zeiss Axio Observer equipped with Apotome3. One-Step TUNEL apoptosis assay Radiation-induced apoptosis of esophageal epithelial cells was demonstrated by One-Step TUNEL Apoptosis Kit (KeyGen Bio-Tech, Nanjing, China). Briefly, slides were dewaxed, rehydrated, and intestinal tissues treated with Proteinase K at 37 °C for 30 min. Subsequently, FITC-labelled TUNEL reaction solution was incubated for 1 h at 37 °C in the dark. Nuclei were counterstained with DAPI, and slides were mounted in antifade medium. Images were captured using a Zeiss Axio Observer with Apotome3. ROS detection assay Intracellular ROS levels were examined with Dihydroethidium (DHE) following the manufacture’s protocol (Beyotime, China). Briefly, fresh esophageal tissues on Day 3, Day 7, Day 10, and Day 14 after irradiation were directly embedded in OCT compound and frozen sections were prepared at -20℃. Frozen sections of 5 μm thickness were incubated in 10 mM DHE for 30 min at room temperature in dark, washed twice with PBS, and then observed using an inverted fluorescence microscope under the appropriate channel following the manufacture’s protocol. Quantitative RT-PCR Total RNA was extracted by RNAiso Plus (TaKaRa, Japan) per the manufacturer's protocol and quantified with a NanoDrop2000 spectrophotometer (Thermo Scientific). cDNA was synthesized using Hifair II 1st Strand cDNA Synthesis SuperMix (YEASEN, China), followed by qPCR with Hief qPCR SYBR Green Master Mix (YEASEN) on a C1000 instrument (Bio-Rad, USA). mRNA expression levels of IL-1β, IL-6, IL-10, and TNFα were determined, and data were normalized to β-actin. Gene expression was calculated using 2 −ΔΔCt Transmission electron microscopy (TEM) Healthy and irradiated esophageal tissues were quickly removed and fixed for 1 h in cold 0.1 m sodium cacodylate–HCl buffer (pH 7.4) containing 4% PFA and 1% glutaraldehyde. After fixation, specimens were washed four times for 15 min in 0.1 m cacodylate buffer containing 0.1 m glycine. Esophageal samples were further postfixed in 1% osmium tetroxide in 0.1 m cacodylate buffer, dehydrated in a methanol series to propylene oxide, and embedded in epoxy resin. Ultrathin esophageal sections were placed on nickel grids for observation. Images were captured by Philips Tecnai-10 transmission electron microscope at an accelerating voltage of 100 kV. Statistical analysis Experimental data were presented as mean ± SD analyzed and analyzed by GraphPad Prism 9 (GraphPad Software, USA). The survival analysis data were analyzed using the Log-rank test. Other data were analyzed using One-way ANOVA, Brown-Forsythe ANOVA, and Two-way ANOVA, while multiple comparisons were conducted using Dunnett’s T3 multiple comparisons test and Tukey’s HSD test. P Results Radiation greatly impaired general health in the ARIE mouse model To confirm the influences of different radiation doses on health, C57BL/6 mice were exposed to whole thorax irradiation at single doses of 5 Gy, 10 Gy, 15 Gy, 20 Gy, 25 Gy, or 30 Gy (Fig. 1 1 1 1 1 Fig. 1 General health status of mice with ARIE caused by different irradiation doses. A B C D E p p p p Epithelial injury of ARIE depends on the radiation dose Esophageal tissues were used for pathological analysis at Day 3, Day7, Day 10, and Day 14 after thorax irradiation. The cross section of the esophagus contained the mucosal epithelium, lamina propria, and muscularis mucosae, followed by the submucosal layer, the muscularis propria, and finally, the adventitia (Figure S1). The esophageal epithelium, as a stratified nonkeratinizing squamous epithelium featuring a quintuple layered structure from bottom to top, is sequentially composed of the stratum base, stratum spinosum, stratum granulosum, stratum lucidum, and stratum corneum. Healthy esophagus contains 6–8 cellular layers. The esophagus of the mice that received 5 Gy and 10 Gy of irradiation presented no apparent tissue damage, and no significant abnormalities in the morphology or number of epithelial cells were observed (Fig. 2 2 2 2 2 2 Fig. 2 Epithelial injury in the ARIE model occurred in a dose-dependent manner. A B C D p p p p # p ## p ### p #### p Pathological characteristics of ARIE after 20 Gy thoracic irradiation We further determined the pathological characteristics of ARIE caused by 20 Gy thoracic irradiation. Compared with the control group, only minor thinning of the epithelial layer was noted on Day 3, without alterations in the keratin layer. By Day 7, both the epithelial and keratinized layers had severely shrunk with disrupted epithelial integrity, and the epithelial cells were swollen, necrotic, and detached, with a greatly reduced number of cells in layers 1–3. Additionally, vacuolation of the cells was observed, which is indicative of acute and severe injury. On Day 10, the esophageal epithelium was thicker than on Day 7, with well-aligned epithelial cells. However, there was significant infiltration of inflammatory cells in the submucosa, and no obvious thickening of the keratin layer was observed. On Day 14, the thickness of the esophageal epithelium was significantly greater than that in the control and early stages of ARIE. The number of cellular layers increased significantly to 7–10, and the size and morphology of the epithelial cells recovered to normal, indicating that the esophageal epithelium may be in a regenerative and repairing stage. The thickness of the esophageal epithelium returned to the pre-irradiation state at Days21, 30, and 60 (Fig. 3 3 3 3 17 18 3 Fig. 3 Pathological response of the esophagus in a 20 Gy ARIE mouse model. A B C D p p p p # p ## p ### p #### p Dynamics of proliferation, ROS levels, and apoptosis in the 20-Gy ARIE model To reveal cellular proliferation is pivotal for understanding the pathology of ARIE. We detected proliferative markers, including PCNA and phospho-histone H3 (PHH3), in the esophageal epithelium following 20 Gy of irradiation (Fig. 4 B 4 F 4 4 D 19 4 4 4 E 4 Fig. 4 Examination of cell proliferation, DNA damage, ROS levels, and apoptosis in the esophageal epithelium of the ARIE mice. A B C F p p p p # p ## p ### p #### p Ultrastructural changes in mitochondria in esophageal epithelial cells in ARIE Mitochondria are the hubs of energy production and major cellular sources of ROS, which are important triggers of mitophagy [ 20 5 B 5 Fig. 5 Ultrastructural images of esophageal epithelial cells after 20 Gy of thoracic irradiation. A B Enhanced inflammatory response-mediated ARIE Inflammation mediates the development of many diseases, so we characterized the infiltration of immune cells, including neutrophils, T cells, and macrophages, during the progression of ARIE. Myeloperoxidase (MPO), a peroxidase enzyme rich in heme, is predominantly found in neutrophils [ 21 6 22 23 6 6 24 26 6 6 Fig. 6 Inflammatory responses within the esophageal epithelium of the ARIE mice following 20 Gy of thoracic irradiation. A B C E p p p p # p ## p ### p #### p Discussion Esophageal injuries of different severities may be manifested in patients following radiotherapy for thoracic, and some head and neck, cancers, and such injuries include both acute and chronic effects due to the range of molecular reactions [ 27 29 6 9 30 31 Mice are the most widely used experimental model, and many well-established genetic resources are available. In this study, we compared X-ray irradiation-induced acute esophagitis in C57BL/6 mice via a wide range of single doses. We have chosen 6 to 8-week-old male C57BL/6 mice for this study in order to better simulate the clinical scenario of radiation esophagitis in human esophageal cancer, which is more prevalent in males [ 32 33 34 35 36 37 38 39 40 2 The progression of typical radiation injury involves five sequential stages: the injury initiation stage, the signal transduction stage, the signal amplification stage, the ulcer formation stage, and the healing and repair stage [ 41 42 3 4 6 B 6 43 44 45 46 In addition, esophageal injury in the 20 Gy group presented clear signs of regeneration and healing on Day 14, characterized by a notable increase in epithelial thickness, a diminished inflammatory response, and well-aligned basal cells. Moreover, both the number of inflammatory cells and the number of inflammatory factors were significantly lower at this time than on Day 7. On day 14, the increased thickness of the esophageal epithelium and the well-aligned basal cells, along with the recovery of CK14-positive stem cells, indicate that the esophageal tissue possesses a certain capacity for self-repair, which may be associated with the activation and proliferation of stem cells. Meanwhile, the significant reduction in the number of inflammatory cells and inflammatory factors, and the attenuation of the inflammatory response, provide a favorable microenvironment for tissue repair and reduce further damage to the tissue caused by inflammation [ 46 47 48 However, it can be observed from Fig. 3 49 54 50 50 49 51 49 51 52 53 54 Presently, the construction of animal models for ARIE predominantly utilizes rats, mice, and rabbits as experimental subjects. The prevailing experimental paradigm in the majority of studies involves administering a single high-dose irradiation regimen, while a few have attempted low-dose fractionated irradiation [ 8 10 13 11 12 55 56 Despite these interesting findings, there are still shortcomings in the current study. First, the model we established was relatively simple and did not explore the potential mechanisms of radiation damage and regeneration of the esophagus in depth, which will be further investigated in future studies. Second, we adopted only a single dose of X-ray irradiation for the purpose of operational convenience in establishing an experimental mouse model. Since fractioned irradiation is used in clinical practice, such an irradiation strategy will also be tested in the future. Finally, we used whole thoracic irradiation which may also damage some vital organs, such as the lung and heart, which can not exactly mimic clinical circumstances. Although this study mainly focuses on acute injury and repair, long-term fibrotic damage is also an issue that needs attention in the radiotherapy of esophageal cancer. Long-term fibrosis can lead to serious complications such as esophageal stricture, affecting patients' quality of life. In clinical practice, long-term follow-up of esophageal cancer patients receiving radiotherapy is necessary to monitor potential late complications and take timely intervention measures. Therefore, future research needs to further explore strategies for preventing and mitigating fibrosis. Conclusions Taken together, in this study, we optimized the doses of thoracic irradiation for acute radiation-induced esophagitis and found that 20 Gy of irradiation was the most ideal dose for establishing ARIE. We demonstrated the pathological process of esophageal epithelial injury in 20-Gy ARIE-treated mice and emphasized that the most severe epithelial injury occurred on Day 7 and that this injury regenerated by Day 14. Our findings might provide important laboratory evidence for future ARIE studies. Supplementary Information  Additional file 1. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Jianhua Feng, Xiangjun Liu and Lu Xu have contributed equally to this work. Acknowledgements We thank all the members in Dr. Liu’s laboratory for their critical reading and helpful suggestions during the preparation and revision of this manuscript. Author contributions D.L, J.Y, J.F conceived this study. J.F, X.L, L.X performed the experiments and data collection. K.W, S.H, X.W, and Y.H helped histological staining and molecular studies. X.L, L.H, and Z.X helped with data analysis and interpretation. The manuscript was written and revised by J.F, J.L, D.L, and J.Y. All the authors have read and approved this manuscript. Funding This work is supported by National Natural Science Foundation of China (82570643, 81874255), Science and Technology Department of Sichuan Province (2025NSFJQ0058). Data Availability No datasets were generated or analysed during the current study. Declarations Competing interests The authors declare no competing interests. References 1. Curran WJ Jr. Sequential vs. concurrent chemoradiation for stage III non-small cell lung cancer: randomized phase III trial RTOG 9410 J Natl Cancer Inst 2011 103 19 1452 1460 10.1093/jnci/djr325 21903745 PMC3186782 Curran WJ Jr., et al. Sequential vs. concurrent chemoradiation for stage III non-small cell lung cancer: randomized phase III trial RTOG 9410. J Natl Cancer Inst. 2011;103(19):1452–60. 21903745 10.1093/jnci/djr325 PMC3186782 2. Takeda K Dosimetric correlations of acute esophagitis in lung cancer patients treated with radiotherapy Int J Radiat Oncol Biol Phys 2005 62 3 626 629 10.1016/j.ijrobp.2005.04.004 15936536 Takeda K, et al. Dosimetric correlations of acute esophagitis in lung cancer patients treated with radiotherapy. Int J Radiat Oncol Biol Phys. 2005;62(3):626–9. 15936536 10.1016/j.ijrobp.2005.04.004 3. Werner-Wasik M Radiation dose-volume effects in the esophagus Int J Radiat Oncol Biol Phys 2010 76 3 Suppl S86 93 10.1016/j.ijrobp.2009.05.070 20171523 PMC3587781 Werner-Wasik M, et al. Radiation dose-volume effects in the esophagus. Int J Radiat Oncol Biol Phys. 2010;76(3 Suppl):S86-93. 20171523 10.1016/j.ijrobp.2009.05.070 PMC3587781 4. Tandon S The use of adaptive intensity-modulated radiotherapy in the treatment of small-cell carcinoma lung refractory to chemotherapy in a patient with preexisting interstitial lung disease Lung India 2018 35 1 54 57 10.4103/lungindia.lungindia_93_17 29319036 PMC5760870 Tandon S, et al. The use of adaptive intensity-modulated radiotherapy in the treatment of small-cell carcinoma lung refractory to chemotherapy in a patient with preexisting interstitial lung disease. Lung India. 2018;35(1):54–7. 29319036 10.4103/lungindia.lungindia_93_17 PMC5760870 5. Verma V Acute and late toxicities of concurrent chemoradiotherapy for locally-advanced non-small cell lung cancer Cancers (Basel) 2017 10.3390/cancers9090120 28885561 PMC5615335 Verma V, et al. Acute and late toxicities of concurrent chemoradiotherapy for locally-advanced non-small cell lung cancer. Cancers (Basel). 2017. 10.3390/cancers9090120. 28885561 10.3390/cancers9090120 PMC5615335 6. Murro D Jakate S Radiation esophagitis Arch Pathol Lab Med 2015 139 6 827 830 10.5858/arpa.2014-0111-RS 26030254 Murro D, Jakate S. Radiation esophagitis. Arch Pathol Lab Med. 2015;139(6):827–30. 26030254 10.5858/arpa.2014-0111-RS 7. Jelvehgaran P Evaluation of acute esophageal radiation-induced damage using magnetic resonance imaging: a feasibility study in mice Radiat Oncol 2019 14 1 188 10.1186/s13014-019-1396-8 31666092 PMC6822441 Jelvehgaran P, et al. Evaluation of acute esophageal radiation-induced damage using magnetic resonance imaging: a feasibility study in mice. Radiat Oncol. 2019;14(1):188. 31666092 10.1186/s13014-019-1396-8 PMC6822441 8. Drishya S Amomum subulatum Food Res Int 2023 174 Pt 1 113582 10.1016/j.foodres.2023.113582 37986451 Drishya S, et al. Amomum subulatum 37986451 10.1016/j.foodres.2023.113582 9. Kitamura H Interferon-α exerts proinflammatory properties in experimental radiation-induced esophagitis: possible involvement of plasmacytoid dendritic cells Life Sci 2022 289 120215 10.1016/j.lfs.2021.120215 34890590 Kitamura H, et al. Interferon-α exerts proinflammatory properties in experimental radiation-induced esophagitis: possible involvement of plasmacytoid dendritic cells. Life Sci. 2022;289:120215. 34890590 10.1016/j.lfs.2021.120215 10. Kim KS Radiation-induced esophagitis in vivo and in vitro reveals that epidermal growth factor is a potential candidate for therapeutic intervention strategy Int J Radiat Oncol Biol Phys 2016 95 3 1032 1041 10.1016/j.ijrobp.2016.02.051 27130791 Kim KS, et al. Radiation-induced esophagitis in vivo and in vitro reveals that epidermal growth factor is a potential candidate for therapeutic intervention strategy. Int J Radiat Oncol Biol Phys. 2016;95(3):1032–41. 27130791 10.1016/j.ijrobp.2016.02.051 11. Northway MG The opossum as an animal model for studying radiation esophagitis Radiology 1979 131 3 731 735 10.1148/131.3.731 441380 Northway MG, et al. The opossum as an animal model for studying radiation esophagitis. Radiology. 1979;131(3):731–5. 441380 10.1148/131.3.731 12. Shen L Therapeutic effect of compound of white peony root oral liquids on radiation-induced esophageal toxicity via the expression of EGF and TGF-β1 Biomed Rep 2013 1 2 308 314 10.3892/br.2012.51 24648940 PMC3956250 Shen L, et al. Therapeutic effect of compound of white peony root oral liquids on radiation-induced esophageal toxicity via the expression of EGF and TGF-β1. Biomed Rep. 2013;1(2):308–14. 24648940 10.3892/br.2012.51 PMC3956250 13. Yao J Transcriptome profiling unveils a critical role of IL-17 signaling-mediated inflammation in radiation-induced esophageal injury in rats Dose Response 2022 20 2 15593258221104609 10.1177/15593258221104609 35677348 PMC9168911 Yao J, et al. Transcriptome profiling unveils a critical role of IL-17 signaling-mediated inflammation in radiation-induced esophageal injury in rats. Dose Response. 2022;20(2):15593258221104608. 35677348 10.1177/15593258221104609 PMC9168911 14. Zhang C Therapeutic effect of dental pulp stem cell transplantation on a rat model of radioactivity-induced esophageal injury Cell Death Dis 2018 9 7 738 10.1038/s41419-018-0753-0 29970894 PMC6030227 Zhang C, et al. Therapeutic effect of dental pulp stem cell transplantation on a rat model of radioactivity-induced esophageal injury. Cell Death Dis. 2018;9(7):738. 29970894 10.1038/s41419-018-0753-0 PMC6030227 15. Wu F Construction of an immune-related lncRNA-miRNA-mRNA regulatory network in radiation-induced esophageal injury in rats Int Immunopharmacol 2023 122 110606 10.1016/j.intimp.2023.110606 37423154 Wu F, et al. Construction of an immune-related lncRNA-miRNA-mRNA regulatory network in radiation-induced esophageal injury in rats. Int Immunopharmacol. 2023;122:110606. 37423154 10.1016/j.intimp.2023.110606 16. Trowers E Chemical- and radiation-induced esophageal injury Gastrointest Endosc Clin N Am 1994 4 4 657 675 10.1016/S1052-5157(18)30474-4 7812640 Trowers E, et al. Chemical- and radiation-induced esophageal injury. Gastrointest Endosc Clin N Am. 1994;4(4):657–75. 7812640 17. Kalabis J A subpopulation of mouse esophageal basal cells has properties of stem cells with the capacity for self-renewal and lineage specification J Clin Invest 2008 118 12 3860 3869 19033657 10.1172/JCI35012 PMC2579884 Kalabis J, et al. A subpopulation of mouse esophageal basal cells has properties of stem cells with the capacity for self-renewal and lineage specification. J Clin Invest. 2008;118(12):3860–9. 19033657 10.1172/JCI35012 PMC2579884 18. Green N The development and characterization of an organotypic tissue-engineered human esophageal mucosal model Tissue Eng Part A 2010 16 3 1053 1064 10.1089/ten.tea.2009.0217 19845463 Green N, et al. The development and characterization of an organotypic tissue-engineered human esophageal mucosal model. Tissue Eng Part A. 2010;16(3):1053–64. 19845463 10.1089/ten.TEA.2009.0217 19. Prabhu KS H2AX: a key player in DNA damage response and a promising target for cancer therapy Biomed Pharmacother 2024 175 116663 10.1016/j.biopha.2024.116663 38688170 Prabhu KS, et al. H2AX: a key player in DNA damage response and a promising target for cancer therapy. Biomed Pharmacother. 2024;175:116663. 38688170 10.1016/j.biopha.2024.116663 20. Kornfeld OS Mitochondrial reactive oxygen species at the heart of the matter: new therapeutic approaches for cardiovascular diseases Circ Res 2015 116 11 1783 1799 10.1161/CIRCRESAHA.116.305432 25999419 PMC4443500 Kornfeld OS, et al. Mitochondrial reactive oxygen species at the heart of the matter: new therapeutic approaches for cardiovascular diseases. Circ Res. 2015;116(11):1783–99. 25999419 10.1161/CIRCRESAHA.116.305432 PMC4443500 21. Lin W The roles of neutrophil-derived myeloperoxidase (MPO) in diseases: the new progress Antioxidants 2024 13 1 132 10.3390/antiox13010132 38275657 PMC10812636 Lin W, et al. The roles of neutrophil-derived myeloperoxidase (MPO) in diseases: the new progress. Antioxidants. 2024;13(1):132. 38275657 10.3390/antiox13010132 PMC10812636 22. Dong D Structural basis of assembly of the human T cell receptor-CD3 complex Nature 2019 573 7775 546 552 10.1038/s41586-019-1537-0 31461748 Dong D, et al. Structural basis of assembly of the human T cell receptor-CD3 complex. Nature. 2019;573(7775):546–52. 31461748 10.1038/s41586-019-1537-0 23. Xin W Structures of human γδ T cell receptor-CD3 complex Nature 2024 630 8015 222 229 10.1038/s41586-024-07439-4 38657677 PMC11153141 Xin W, et al. Structures of human γδ T cell receptor-CD3 complex. Nature. 2024;630(8015):222–9. 38657677 10.1038/s41586-024-07439-4 PMC11153141 24. Drishya S Amomum subulatum J Nutr Biochem 2022 107 109064 10.1016/j.jnutbio.2022.109064 35609850 Drishya S, et al. Amomum subulatum 35609850 10.1016/j.jnutbio.2022.109064 25. Drishya S Amomum subulatum Food Funct 2023 14 3 1545 1559 10.1039/D2FO03208B 36655677 Drishya S, et al. Amomum subulatum 36655677 10.1039/d2fo03208b 26. Qiu X Hydrogen attenuates radiation-induced intestinal damage by reducing oxidative stress and inflammatory response Int Immunopharmacol 2020 84 106517 10.1016/j.intimp.2020.106517 32361189 Qiu X, et al. Hydrogen attenuates radiation-induced intestinal damage by reducing oxidative stress and inflammatory response. Int Immunopharmacol. 2020;84:106517. 32361189 10.1016/j.intimp.2020.106517 27. Li X Phase II trial of epigallocatechin-3-gallate in acute radiation-induced esophagitis for esophagus cancer J Med Food 2020 23 1 43 49 10.1089/jmf.2019.4445 31747326 Li X, et al. Phase II trial of epigallocatechin-3-gallate in acute radiation-induced esophagitis for esophagus cancer. J Med Food. 2020;23(1):43–9. 31747326 10.1089/jmf.2019.4445 28. Simone CB Thoracic radiation normal tissue injury Semin Radiat Oncol 2017 27 4 370 377 10.1016/j.semradonc.2017.04.009 28865520 Simone CB. Thoracic radiation normal tissue injury. Semin Radiat Oncol. 2017;27(4):370–7. 28865520 10.1016/j.semradonc.2017.04.009 29. Zhu W Evaluation of epigallocatechin-3-gallate as a radioprotective agent during radiotherapy of lung cancer patients: a 5-year survival analysis of a phase 2 study Front Oncol 2021 11 686950 10.3389/fonc.2021.686950 34178681 PMC8223749 Zhu W, et al. Evaluation of epigallocatechin-3-gallate as a radioprotective agent during radiotherapy of lung cancer patients: a 5-year survival analysis of a phase 2 study. Front Oncol. 2021;11:686950. 34178681 10.3389/fonc.2021.686950 PMC8223749 30. Bradley J Movsas B Radiation esophagitis: Predictive factors and preventive strategies Semin Radiat Oncol 2004 14 4 280 286 10.1016/j.semradonc.2004.06.003 15558501 Bradley J, Movsas B. Radiation esophagitis: Predictive factors and preventive strategies. Semin Radiat Oncol. 2004;14(4):280–6. 15558501 10.1016/j.semradonc.2004.06.003 31. Werner-Wasik M Acute esophagitis and late lung toxicity in concurrent chemoradiotherapy trials in patients with locally advanced non-small-cell lung cancer: analysis of the radiation therapy oncology group (RTOG) database Clin Lung Cancer 2011 12 4 245 251 10.1016/j.cllc.2011.03.026 21726824 Werner-Wasik M, et al. Acute esophagitis and late lung toxicity in concurrent chemoradiotherapy trials in patients with locally advanced non-small-cell lung cancer: analysis of the radiation therapy oncology group (RTOG) database. Clin Lung Cancer. 2011;12(4):245–51. 21726824 10.1016/j.cllc.2011.03.026 32. Stabellini N Sex differences in esophageal cancer overall and by histological subtype Sci Rep 2022 12 1 5248 10.1038/s41598-022-09193-x 35347189 PMC8960903 Stabellini N, et al. Sex differences in esophageal cancer overall and by histological subtype. Sci Rep. 2022;12(1):5248. 35347189 10.1038/s41598-022-09193-x PMC8960903 33. Sun L Global, regional, and national burden of esophageal cancer using the 2019 global burden of disease study Sci Rep 2025 15 1 3284 10.1038/s41598-025-86244-z 39865149 PMC11770103 Sun L, et al. Global, regional, and national burden of esophageal cancer using the 2019 global burden of disease study. Sci Rep. 2025;15(1):3284. 39865149 10.1038/s41598-025-86244-z PMC11770103 34. Wiseman S Female mice behave well Nat Neurosci 2023 26 4 534 10.1038/s41593-023-01303-w 37020115 Wiseman S. Female mice behave well. Nat Neurosci. 2023;26(4):534. 37020115 10.1038/s41593-023-01303-w 35. Chari T The stage of the estrus cycle is critical for interpretation of female mouse social interaction behavior Front Behav Neurosci 2020 14 113 10.3389/fnbeh.2020.00113 32714163 PMC7340104 Chari T, et al. The stage of the estrus cycle is critical for interpretation of female mouse social interaction behavior. Front Behav Neurosci. 2020;14:113. 32714163 10.3389/fnbeh.2020.00113 PMC7340104 36. Dutta S Sengupta P Men and mice: relating their ages Life Sci 2016 152 244 248 10.1016/j.lfs.2015.10.025 26596563 Dutta S, Sengupta P. Men and mice: relating their ages. Life Sci. 2016;152:244–8. 26596563 10.1016/j.lfs.2015.10.025 37. Moura JF A novel model of megavoltage radiation-induced oral mucositis in hamsters: Role of inflammatory cytokines and nitric oxide Int J Radiat Biol 2015 91 6 500 509 10.3109/09553002.2015.1021964 25758466 Moura JF, et al. A novel model of megavoltage radiation-induced oral mucositis in hamsters: Role of inflammatory cytokines and nitric oxide. Int J Radiat Biol. 2015;91(6):500–9. 25758466 10.3109/09553002.2015.1021964 38. Maria OM Single-dose radiation-induced oral mucositis mouse model Front Oncol 2016 6 154 10.3389/fonc.2016.00154 27446800 PMC4921469 Maria OM, et al. Single-dose radiation-induced oral mucositis mouse model. Front Oncol. 2016;6:154. 27446800 10.3389/fonc.2016.00154 PMC4921469 39. Herr DJ Factors associated with acute esophagitis during radiation therapy for lung cancer Radiother Oncol 2024 197 110349 10.1016/j.radonc.2024.110349 38815695 Herr DJ, et al. Factors associated with acute esophagitis during radiation therapy for lung cancer. Radiother Oncol. 2024;197:110349. 38815695 10.1016/j.radonc.2024.110349 40. Pei J C-X-C-chemokine-receptor-type-4 as a potential target for diagnosis and treatment of acute radiation-induced esophagitis Int Immunopharmacol 2025 150 114289 10.1016/j.intimp.2025.114289 39970707 Pei J, et al. C-X-C-chemokine-receptor-type-4 as a potential target for diagnosis and treatment of acute radiation-induced esophagitis. Int Immunopharmacol. 2025;150:114289. 39970707 10.1016/j.intimp.2025.114289 41. Sonis ST New thoughts on the initiation of mucositis Oral Dis 2010 16 7 597 600 10.1111/j.1601-0825.2010.01681.x 20846150 Sonis ST. New thoughts on the initiation of mucositis. Oral Dis. 2010;16(7):597–600. 20846150 10.1111/j.1601-0825.2010.01681.x 42. Sonis ST Pathobiology of oral mucositis: novel insights and opportunities J Support Oncol 2007 5 9 Suppl 4 3 11 18046993 Sonis ST. Pathobiology of oral mucositis: novel insights and opportunities. J Support Oncol. 2007;5(9 Suppl 4):3–11. 18046993 43. Smith HL DNA damage checkpoint kinases in cancer Expert Rev Mol Med 2020 22 e2 10.1017/erm.2020.3 32508294 Smith HL, et al. DNA damage checkpoint kinases in cancer. Expert Rev Mol Med. 2020;22:e2. 32508294 10.1017/erm.2020.3 44. Li C A novel role for the ROS-ATM-Chk2 axis mediated metabolic and cell cycle reprogramming in the M1 macrophage polarization Redox Biol 2024 70 103059 10.1016/j.redox.2024.103059 38316066 PMC10862067 Li C, et al. A novel role for the ROS-ATM-Chk2 axis mediated metabolic and cell cycle reprogramming in the M1 macrophage polarization. Redox Biol. 2024;70:103059. 38316066 10.1016/j.redox.2024.103059 PMC10862067 45. Trachootham D Targeting cancer cells by ROS-mediated mechanisms: a radical therapeutic approach? Nat Rev Drug Discov 2009 8 7 579 591 10.1038/nrd2803 19478820 Trachootham D, et al. Targeting cancer cells by ROS-mediated mechanisms: a radical therapeutic approach? Nat Rev Drug Discov. 2009;8(7):579–91. 19478820 10.1038/nrd2803 46. Vidotti RB Reduction of inflammation and improvement of skin tissue repair using biomaterials composed of hydroxyapatite and chitosan associated to conditioned media derived from dental pulp stem cells Int J Biol Macromol 2025 10.1016/j.ijbiomac.2025.142353 40158558 Vidotti RB, et al. Reduction of inflammation and improvement of skin tissue repair using biomaterials composed of hydroxyapatite and chitosan associated to conditioned media derived from dental pulp stem cells. Int J Biol Macromol. 2025. 10.1016/j.ijbiomac.2025.142353. 40158558 10.1016/j.ijbiomac.2025.142353 47. Tu S Berberine enhances the function of intestinal stem cells in healthy and radiation-injured mice Int Immunopharmacol 2024 136 112278 10.1016/j.intimp.2024.112278 38815353 Tu S, et al. Berberine enhances the function of intestinal stem cells in healthy and radiation-injured mice. Int Immunopharmacol. 2024;136:112278. 38815353 10.1016/j.intimp.2024.112278 48. He J Intravenous immunoglobulin protects the integrity of the intestinal epithelial barrier and inhibits ferroptosis induced by radiation exposure by activating the mTOR pathway Int Immunopharmacol 2024 131 111908 10.1016/j.intimp.2024.111908 38518594 He J, et al. Intravenous immunoglobulin protects the integrity of the intestinal epithelial barrier and inhibits ferroptosis induced by radiation exposure by activating the mTOR pathway. Int Immunopharmacol. 2024;131:111908. 38518594 10.1016/j.intimp.2024.111908 49. Chen Z The dual role of mesenchymal stem cells in apoptosis regulation Cell Death Dis 2024 15 4 250 10.1038/s41419-024-06620-x 38582754 PMC10998921 Chen Z, et al. The dual role of mesenchymal stem cells in apoptosis regulation. Cell Death Dis. 2024;15(4):250. 38582754 10.1038/s41419-024-06620-x PMC10998921 50. Gundogdu G Molecular mechanisms of esophageal epithelial regeneration following repair of surgical defects with acellular silk fibroin grafts Sci Rep 2021 11 1 7086 10.1038/s41598-021-86511-9 33782465 PMC8007829 Gundogdu G, et al. Molecular mechanisms of esophageal epithelial regeneration following repair of surgical defects with acellular silk fibroin grafts. Sci Rep. 2021;11(1):7086. 33782465 10.1038/s41598-021-86511-9 PMC8007829 51. Yan T NGF receptors and PI3K/AKT pathway involved in glucose fluctuation-induced damage to neurons and α-lipoic acid treatment BMC Neurosci 2020 21 1 38 10.1186/s12868-020-00588-y 32943002 PMC7499848 Yan T, et al. NGF receptors and PI3K/AKT pathway involved in glucose fluctuation-induced damage to neurons and α-lipoic acid treatment. BMC Neurosci. 2020;21(1):38. 32943002 10.1186/s12868-020-00588-y PMC7499848 52. Cesur O Enhancing esophageal repair with bioactive bilayer mesh containing FGF Sci Rep 2021 11 1 19203 10.1038/s41598-021-98840-w 34584186 PMC8478899 Cesur O, et al. Enhancing esophageal repair with bioactive bilayer mesh containing FGF. Sci Rep. 2021;11(1):19203. 34584186 10.1038/s41598-021-98840-w PMC8478899 53. Lim M Esophageal ILC2s mediate abnormal epithelial remodeling in eosinophilic esophagitis via Areg-EGFR signaling Cell Mol Immunol 2025 22 1 97 110 10.1038/s41423-024-01242-x 39653767 PMC11685411 Lim M, et al. Esophageal ILC2s mediate abnormal epithelial remodeling in eosinophilic esophagitis via Areg-EGFR signaling. Cell Mol Immunol. 2025;22(1):97–110. 39653767 10.1038/s41423-024-01242-x PMC11685411 54. Yang Y Identification and characterization of stem cells in mammalian esophageal stratified squamous epithelia J Mol Cell Biol 2022 10.1093/jmcb/mjac038 35709398 PMC9669669 Yang Y, et al. Identification and characterization of stem cells in mammalian esophageal stratified squamous epithelia. J Mol Cell Biol. 2022. 10.1093/jmcb/mjac038. 35709398 10.1093/jmcb/mjac038 PMC9669669 55. Wang Z Pain-relieving effect of a compound isolated from white peony root oral liquid on acute radiation-induced esophagitis Mol Med Rep 2013 7 6 1950 1954 10.3892/mmr.2013.1427 23588387 Wang Z, et al. Pain-relieving effect of a compound isolated from white peony root oral liquid on acute radiation-induced esophagitis. Mol Med Rep. 2013;7(6):1950–4. 23588387 10.3892/mmr.2013.1427 56. Ma L A current review of dose-escalated radiotherapy in locally advanced non-small cell lung cancer Radiol Oncol 2019 53 1 6 14 10.2478/raon-2019-0006 30840594 PMC6411023 Ma L, et al. A current review of dose-escalated radiotherapy in locally advanced non-small cell lung cancer. Radiol Oncol. 2019;53(1):6–14. 30840594 10.2478/raon-2019-0006 PMC6411023 ",
  "metadata": {
    "Title of this paper": "A current review of dose-escalated radiotherapy in locally advanced non-small cell lung cancer",
    "Journal it was published in:": "Radiation Oncology (London, England)",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487394/"
  }
}