{
  "title": "Paper_783",
  "abstract": "Indian J Otolaryngol Head Neck Surg Indian J Otolaryngol Head Neck Surg 1415 ijoto Indian Journal of Otolaryngology and Head & Neck Surgery 2231-3796 0973-7707 Springer PMC11455748 PMC11455748.1 11455748 11455748 39376269 10.1007/s12070-024-04776-8 4776 1 Original Article Exploring the Impact of Model Complexity on Laryngeal Cancer Detection Rao Divya 1 Singh Rohit 2 Koteshwara Prakashini Prakashini.k@manipal.edu 3 Vijayananda J. 4 1 https://ror.org/02xzytt36 grid.411639.8 0000 0001 0571 5193 Department of Information and Communication Technology, Manipal Institute of Technology, Manipal Academy of Higher Education, 2 https://ror.org/02xzytt36 grid.411639.8 0000 0001 0571 5193 Department of Otorhinolaryngology, Kasturba Medical College, Manipal Academy of Higher Education, 3 https://ror.org/02xzytt36 grid.411639.8 0000 0001 0571 5193 Department of Radiodiagnosis and Imaging, Kasturba Medical College, Manipal Academy of Higher Education, 4 grid.497469.1 0000 0004 6073 7450 Data Science and Artificial Intelligence, 6 6 2024 10 2024 76 5 472259 4036 4042 27 10 2023 26 5 2024 01 10 2025 01 10 2025 07 10 2024 01 10 2025 © Association of Otolaryngologists of India 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 Background Methods Results Conclusion Keywords Laryngeal cancer Laryngeal cancer detection Machine learning models CT image analysis Deep learning Computer-aided diagnosis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Association of Otolaryngologists of India 2024 ",
  "metadata": {
    "Title of this paper": "Exploring the Impact of Model Complexity on Laryngeal Cancer Detection",
    "Journal it was published in:": "Indian Journal of Otolaryngology and Head & Neck Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11455748/"
  }
}