{
  "title": "Paper_114",
  "abstract": "pmc Commun Biol Commun Biol 3495 commbiol Communications Biology 2399-3642 Nature Publishing Group PMC12488850 PMC12488850.1 12488850 12488850 41034556 10.1038/s42003-025-08811-4 8811 1 Article A reference-guided iterative approach to polish the nanopore sequencing basecalling for therapeutic RNA quality control http://orcid.org/0000-0002-2476-2929 Wang Ziyuan 1 Tu Mei-Juan 2 Liu Ziyang 1 3 http://orcid.org/0009-0006-2069-5665 Wang Katherine K. 2 http://orcid.org/0000-0001-9249-4498 Fang Yinshan 4 http://orcid.org/0000-0002-3104-5370 Hao Ning 3 5 Zhang Hao Helen 3 5 http://orcid.org/0000-0002-6540-6701 Que Jianwen 4 http://orcid.org/0000-0003-1438-1951 Sun Xiaoxiao xiaosun@arizona.edu 3 6 http://orcid.org/0000-0003-1441-4012 Yu Ai-Ming aimyu@ucdavis.edu 2 http://orcid.org/0000-0002-7846-9744 Ding Hongxu hongxuding@arizona.edu 1 3 1 https://ror.org/03m2x1q45 grid.134563.6 0000 0001 2168 186X Department of Pharmacy Practice and Science, University of Arizona, 2 https://ror.org/05rrcem69 grid.27860.3b 0000 0004 1936 9684 Department of Biochemistry and Molecular Medicine, University of California, Davis, 3 https://ror.org/03m2x1q45 grid.134563.6 0000 0001 2168 186X Statistics and Data Science GIDP, University of Arizona, 4 https://ror.org/01esghr10 grid.239585.0 0000 0001 2285 2675 Department of Medicine, Columbia Center for Human Development, Columbia University Medical Center, 5 https://ror.org/03m2x1q45 grid.134563.6 0000 0001 2168 186X Department of Mathematics, University of Arizona, 6 https://ror.org/03m2x1q45 grid.134563.6 0000 0001 2168 186X Department of Epidemiology and Biostatistics, University of Arizona, 1 10 2025 2025 8 478257 1406 8 4 2025 28 8 2025 01 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Nucleotide modifications deviate nanopore sequencing readouts, therefore generating artifacts during the basecalling of sequence backbones. Here, we present a reference-guided, iterative approach to polish modification-disturbed basecalling results. We show that such an approach is uniquely suitable for training biomolecule-specific high-accuracy basecallers, by improving the basecalling of both artificially-synthesized and real-world molecules. With demonstrated efficacy and reliability, we exploit the approach to precisely basecall therapeutic RNAs consisting of artificial or natural modifications. We first analyzed vaccine mRNAs, which are artificially modified to promote stability and reduce immunogenicity. Specifically, we quantified the sequence purity and integrity, the two most important quality metrics to be controlled during mRNA vaccine production. We also analyzed BioRNAs, which are human tRNA-based carriers for therapeutic RNA interference (RNAi) agents. Specifically, we examined modification hotspots, which are naturally incorporated in vivo during BioRNA production and essential for therapeutic efficacy. Our analysis expands the scope of therapeutic RNA quality control, from the conventional sequence-level to the current modification status-level. The authors introduce a reference-guided iterative method to polish modification-disturbed nanopore sequencing basecalls. It is suitable for training biomolecule-specific high-accuracy basecallers empowering the quality control of therapeutic RNAs. Subject terms Software Computational models pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction In nanopore sequencing, basecalling refers to the process of interpreting nucleotide sequence backbones from ionic current signals 1 2 8 9 More recently, nanopore sequencing has been used for quality control 10 11 12 10 To address such bioinformatic challenges, we present an iterative workflow to polish the nanopore sequencing basecalling for native reads. This iterative basecalling method builds upon the hypothesis that initial analyses with, e.g. Guppy, Bonito and Dorado produce acceptable basecalling accuracy. Iterative basecalling next polishes such yielded sketch sequences by aligning them to ground-truth references. Such polished sequences, paired with their raw nanopore sequencing signals, will be used to train the updated basecallers. Such a process iterates until basecalling accuracy converges, as shown in Fig. 1A Fig. 1 Polishing nanopore sequencing basecalling using an iterative approach. A ++ ++ ++ B C D B C E Results Iterative basecalling for accurately decoding nucleotide sequence backbones We benchmarked iterative basecalling with RNA control oligos 8 1B S1 1C We also confirm that our iterative approach will polish, rather than deviating basecalling. We ran end-product basecallers that were trained in Fig. 1B 1D 1E 5 S2 rRNA and tRNA sequence analysis We applied iterative basecalling to analyze RNAs in real-world biological scenarios. As a proof-of-concept, we first analyzed 18S and 25S yeast rRNA nanopore sequencing data which was previously published 13 S3A–C 2A, B Fig. 2 Iterative basecalling improves yeast rRNA and tRNA sequence analysis. A B C D We also analyzed previously published nano-tRNAseq profiles, which surveyed 42 yeast tRNA species, each having unique modification patterns ranging from densely-modified to all-canonical 9 S3D, E 2C, D mRNA vaccine purity and integrity analysis Building upon the benchmarked efficacy and reliability of iterative basecalling, we next leveraged such a workflow to quantify the purity and integrity of vaccine mRNAs. As a proof-of-concept, we revisited datasets and conclusions from the VAX-seq study 10 S4 3A, B 3C 3D Fig. 3 Iterative basecalling determines mRNA vaccine purity and integrity. A B C D BioRNA modification hotspot inspection Precisely resolved sequence backbones by the iterative basecalling enhance the rigorous determination of nucleotide modifications. As a real-world preclinical usecase, we inspected modification hotspots within BioRNAs. BioRNAs are engineered from human tRNAs, and are molecular carriers for therapeutic RNA interference (RNAi) agents. In particular, the candidate RNAi agent is incorporated in the BioRNA anti-codon loop for the stable large-scale production, and released by the endogenous microRNA processing pathway after the cellular absorption 14 15 16 Ser Leu Ser Leu 4A Fig. 4 Determining BioRNA modification status based on iteratively basecalled sequence backbones. A B C D For each Bio/ChemoRNA category, we iteratively trained and benchmarked a basecaller (Fig. S5 4B, C 4D Ser Leu 17 E.coli E.coli 18 E.coli Discussion In nanopore sequencing, precisely resolving sequence backbones from electric signals, known as basecalling, is the prerequisite for virtually all the downstream bioinformatic analyses. For instance, we have demonstrated that precise basecalling can significantly facilitate pinpointing nucleotide modifications at the single-nucleotide resolution, thereby establishing a general two-step modification detection paradigm 8 1B–D 2 3 4 S6 The success of our iterative approach depends on the performance of initial basecalling. As a result, “non-basecallable” nanopore sequencing signals, such as those significantly deviated by modifications, are unlikely to be properly handled, as one major limitation of our approach. We therefore expect the development of generic basecallers, in particular ones that are tolerant to various categories of modifications as described in our previous research 19 During the iterative basecalling process, sequence backbones will be polished based on the reference sequence. Thus, sequence discrepancies between the provided reference and real-world biomolecules could introduce systematic basecalling artifacts, as another limitation of our approach. For instance, single nucleotide polymorphism sites, which are generally not recorded in the reference, cannot be properly handled by our approach. To maximize the performance of iterative basecalling, the quality of reference sequence, as well as the sequence homogeneity of candidate biomolecules, need to be guaranteed. To examine the reference-candidate sequence discrepancies, further controlling for their resulting systematic artifacts during the iterative basecalling, we recommend to perform companion cDNA sequencing experiments. While this paper primarily focuses on the polishing of modification-disturbed basecalling, our iterative approach could also promote the interpretation of canonical sequences. For example, basecalling accuracy of unmodified RNAs, such as rRNAs produced from IVT, tRNA species Gln-CTG and chemically-synthesized ChemoRNAs, was largely improved by iterative basecalling (Figs. 2 4 Methods The production and purification of BioRNAs The design and production of bioengineered human seryl-tRNA (TGA) and leucyl-tRNA (TAA) (BioRNA Ser Leu 20 21 https://gtrnadb.ucsc.edu/ S1 E. coli Ser Leu Ser Leu 16 21 ChemoRNAs and Nano-tRNAseq adaptors The chemically synthesized, Sephadex aptamer-tagged human seryl-tRNA (TGA) and leucyl-tRNA (TAA) (ChemoRNA Ser Leu 9 S1 The nanopore sequencing of BioRNAs and ChemoRNAs BioRNA and ChemoRNA nanopore sequencing libraries were constructed first following the nano-tRNAseq protocol 9 Adapter annealing 5’ RNA splint adapters and equal moles (~108 pmol) of 3’ RNA:DNA splint adapters were mixed with a dilution buffer consisting of Tris-HCl (10 mM, pH 7.5), NaCl (500 mM), and 1 μL of RNasin Ribonuclease Inhibitor (N2511, Promega) to a final concentration of ~50 ng/μL for each adapter in a total volume of 20 μL. The mixture was incubated at 75 °C for 15 s, further cooled to 25 °C at a rate of 0.1 °C/s (a total of 500 s) to anneal splint adapters. RTA oligo As and oligo Bs (~82 pmol for each, ~200 ng in total) were annealed under the same condition as splint adapters. Ligation 1 1 μg of target RNA (ChemoRNA Ser Leu Ser Leu Ligation 2 and reverse transcription (RT) Purified “Ligation 1” products (400 ng, ~10.4 pmol, for two sequencing replicates) were further ligated to pre-annealed RTA adapters (RNA:adapters = 1:2, molar ratio) with the T4 DNA Ligase (M0202M, NEB) in a 30 μL reaction buffer constituted by 6 μL of NEBNext Quick Ligation Reaction Buffer (B6058S, NEB), 1 μL of RNasin Ribonuclease Inhibitor and RNase-free water by incubating at room temperature for 30 min. Subsequently, the ligation product was mixed with 4 μL of dNTPs (10 mM, N0447S, NEB) and 26 μL of RNase-free water to pre-denature the RNA at 65 °C for 5 min and then cooled down on ice for 2 min. A mixture of Maxima H Minus Reverse Transcriptase (4 μL, EP0751, Thermo Fisher Scientific), 16 μL of Maxima H Minus Reverse Transcriptase Buffer, and 2 μL of RNasin Ribonuclease Inhibitor (80U) were added to the pre-treated RNA sample to perform RT by incubation at 60 °C for 1 h, 85 °C for 5 min, then cooling to 4 °C. AMPure RNAClean XP beads were then added to purify the RT products according to the protocol. The quantity and quality of the purified samples were determined by the Tecan plate reader and the urea PAGE gel, respectively. Ligation 3 and final library Following purification, 40 μL (two replicates) of RT products were ligated to 12 μL of RNA Ligation Adapter (RLA, provided by the SQK-RNA004 kit) in an 80 μL reaction system, supplemented with 16 μL of NEBNext Quick Ligation Reaction Buffer and 6 μL of T4 DNA Ligase for a 30-min incubation at room temperature. The ligation products were purified using AMPure RNAClean XP beads following the protocol provided by the SQK-RNA004 kit. Afterwards, MinION flow cells (RNA chemistry) were primed following manufacturer’s instructions. Meanwhile, Elution Buffer (provided by the SQK-RNA004 kit) re-suspended libraries were gently mixed with 37.5 μL of Sequencing Buffer (provided by the SQK-RNA004 kit) and 25.5 μL of Library Solution (provided by the SQK-RNA004 kit) to obtain final libraries. A total volume of 75 μL final library was loaded to each flow cell for sequencing. The step-by-step validation of RNA purity and quality throughout the library preparation process was presented in Figure S7 Iterative basecalling with the Guppy-Taiyaki workflow The Guppy-Taiyaki workflow is used to analyze nanopore sequencing data produced by the earlier R9.4.1 flowcell chemistry. RNA control oligos, yeast rRNAs and tRNAs, as well as vaccine mRNAs were iteratively basecalled with the Guppy-Taiyaki workflow. The workflow consists of (1) Guppy (version 6.0.6+8a98bbc) for basecalling and alignment; (2) Samtools (version 1.16) for alignment result processing including merge, sort and index 22 S8 For Step 1, the initial basecalling used Guppy model “template_rna_r9.4.1_70bps_hac.jsn”, together with the “--disable_qscore_filtering” flag to keep as many reads as possible for downstream analyses. All other flags were set default. Subsequent iterations used the trained model with the “--disable_qscore_filtering” flag, and other flags were set default. In particular, a stand-alone Minimap2 23 9 For Step 2, default flags for Samtools merge, sort and index were used for all analyses. For Step 3, The “--reverse” flag was used for get_refs_from_sam.py, with other flags set default. Flags for generate_per_read_params.py and merge_mappedsignalfiles.py were set default. The initial iteration used the model checkpoint “r941_rna_minion.checkpoint” that is provided by Taiyaki, to run the prepare_mapped_reads.py (a customized version: https://github.com/wangziyuan66/IL-AD/blob/main/scripts/trna/train_flipflop.py As for model training, the model template “mLstm_flipflop.py” that is provided by Taiyaki, and flags “--size 256 --stride 10 --winlen 31”, were used for train_flipflop.py. Other flags were set default. Default flags for dump_json.py were used for generating final models. Iterative basecalling with the Bonito workflow The Bonito workflow is used to analyze nanopore sequencing data produced by the latest R10.4.1 (for DNA sequencing) and RNA (for RNA sequencing) flowcell chemistry. BioRNAs and ChemoRNAs were iteratively basecalled with the Bonito (version 0.8.1) workflow, including (1) the “bonito baseball” option for basecalling, alignment and training data preparation; (2) the “bonito train” option for model training; (3) iterating Step 1 and 2 with the trained model. Specifically, Poly(A) tails and adapter signals will be trimmed during the basecalling process, following the default setup of the Bonito workflow. The workflow is summarized in Fig. S9 For Step 1, the initial basecalling used Bonito model “rna004_130bps_hac@v3.0” with “--chunksize 3000 --save-ctc --min-accuracy-save-ctc 0.9” flags to prepare high-quality training data. All other flags were set default. Subsequent iterations used the trained model with flags “--chunksize 3000 –save-ctc --min-accuracy-save-ctc 0.9”, and other flags were set default. For Step 2, the initial model training fine-tunes the model “rna004_130bps_hac@v3.0”. Subsequent iterations fine-tune the model produced from the previous iteration. Flags “--size 256 --epochs 5 --lr 5r-4” (other flags were set default) during the training process. Iterative basecalling with the Dorado workflow BioRNAs and ChemoRNAs were also analyzed with Dorado-based iterative basecalling workflow. Dorado shares the same model architecture with Bonito. Thus, we converted Bonito models trained in each iteration as the corresponding Dorado models, using the “bonito export” option. The Dorado version 0.8.1 was used throughout the analysis. Basecalling performance evaluation Basecalling performance was “functionally” evaluated by downstream alignment results, including mappability (the ratio between aligned reads, regardless of SAM flags, and all reads), alignment accuracy (the “alignment_accuracy” entry in the basecalling summary file, calculated as the ratio between correctly aligned bases “alignment_num_correct” and the sum of correctly aligned bases and mismatches “alignment_num_aligned”, insertions “alignment_num_insertions” and deletion “alignment_num_deletions”), alignment consistency (alignment start and end positions) as opposed to results produced by “vanilla” Guppy, Bonito or Dorado, and IGV visualization (version 2.17.4). Nanopore sequencing signal analysis We first basecalled nanopore sequencing reads using Bonito (version 0.8.1) to produce move-tables, which track signal chunks corresponding to individual nucleotides (stored as mv tags in the generated bam files). We next executed the Remora (version 3.2.0) pipeline “Reference Region Metric Extraction” ( https://github.com/nanoporetech/remora/blob/master/notebooks/metrics_api.ipynb Statistics and reproducibility For training the iterative basecalling models, the design of training and test datasets, including the number of reads, whether training and test reads were collected in the same flowcell and the same biological batch, were summarized in Table S2 S3 Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Reporting summary Publisher’s note These authors contributed equally: Ziyuan Wang, Mei-Juan Tu, Ziyang Liu. Supplementary information The online version contains supplementary material available at 10.1038/s42003-025-08811-4. Acknowledgements We thank Dr. Xinlei Sheng for his valuable discussions. We thank the University of Arizona High Performance Computing team and the College of Pharmacy Information Technology Group for their support. H.D. is supported by the University of Arizona Health Sciences Career Development Award, and the University of Arizona Accelerate For Success Award. A.-M.Y. is supported by the National Institute of General Medical Sciences [R35GM140835] and National Cancer Institute [R01CA225958 and R01CA253230], National Institutes of Health (NIH). J.Q. is supported by the National Heart, Lung, and Blood Institute [R01HL159675 and R01HL152293], National Institute of Allergy and Infectious Diseases [R21AI163753] and National Institute of Diabetes and Digestive and Kidney Diseases [R01DK132251], National Institutes of Health (NIH). Author contributions H.D. and A.-M.Y. conceived the idea. Z.W., Z.L., and H.D. performed the analysis. M.-J.T., K.K.W., and Y.F. performed the experiment. N.H., H.H.Z., X.S., J.Q., A.-M.Y., and H.D. supervised the project. Z.W., M.-J.T., A.-M.Y., and H.D. wrote the manuscript. Peer review Peer review information Communications Biology Data availability The BioRNA nanopore sequencing data was deposited at NCBI under the BioProject PRJNA1155679. The RNA oligo nanopore sequencing data was downloaded from NCBI under the BioProject PRJNA1050579 (runs SRR27324841, SRR27324838 and SRR27324839). Corresponding reference sequences were downloaded from the Table S2 8 https://github.com/adbailey4/yeast_rrna_modification_detection/tree/main/notebooks/data https://github.com/novoalab/Nano-tRNAseq/tree/main/ref https://github.com/scchess/Mana/tree/main/data https://figshare.com/s/f39c893a85928aefd10c S4 Code availability The Taiyaki iterative basecalling framework can be found at: https://github.com/wangziyuan66/iterative-labeling-toolkit-taiyaki https://github.com/wangziyuan66/iterative-labeling-toolkit-bonito Competing interests H.D. has a patent application related to this work (Hongxu Ding, An Iterative Approach to Polish the Nanopore Sequencing Basecalling for Therapeutic RNA Quality Control, US Provisional Patent Application No. 63/693,352). Z.W. has received travel expenses from Oxford Nanopore Technologies to speak at the 2025 RNA annual meeting. Other authors declare no competing interests. References 1. Pagès-Gallego M de Ridder J Comprehensive benchmark and architectural analysis of deep learning models for nanopore sequencing basecalling Genome Biol. 2023 24 71 10.1186/s13059-023-02903-2 37041647 PMC10088207 Pagès-Gallego, M. & de Ridder, J. Comprehensive benchmark and architectural analysis of deep learning models for nanopore sequencing basecalling. Genome Biol. 24 37041647 10.1186/s13059-023-02903-2 PMC10088207 2. Liu H Accurate detection of m6A RNA modifications in native RNA sequences Nat. Commun. 2019 10 4079 10.1038/s41467-019-11713-9 31501426 PMC6734003 Liu, H. et al. Accurate detection of m6A RNA modifications in native RNA sequences. Nat. Commun. 10 31501426 10.1038/s41467-019-11713-9 PMC6734003 3. Parker MT Nanopore direct RNA sequencing maps the complexity of Arabidopsis mRNA processing and m6A modification Elife 2020 9 e49658 10.7554/eLife.49658 31931956 PMC6959997 Parker, M. T. et al. Nanopore direct RNA sequencing maps the complexity of Arabidopsis mRNA processing and m6A modification. Elife 9 31931956 10.7554/eLife.49658 PMC6959997 4. Price AM Direct RNA sequencing reveals m6A modifications on adenovirus RNA are necessary for efficient splicing Nat. Commun. 2020 11 6016 10.1038/s41467-020-19787-6 33243990 PMC7691994 Price, A. M. et al. Direct RNA sequencing reveals m6A modifications on adenovirus RNA are necessary for efficient splicing. Nat. Commun. 11 33243990 10.1038/s41467-020-19787-6 PMC7691994 5. Begik O Quantitative profiling of pseudouridylation dynamics in native RNAs with nanopore sequencing Nat. Biotechnol. 2021 39 1278 1291 10.1038/s41587-021-00915-6 33986546 Begik, O. et al. Quantitative profiling of pseudouridylation dynamics in native RNAs with nanopore sequencing. Nat. Biotechnol. 39 33986546 10.1038/s41587-021-00915-6 6. Jenjaroenpun P Decoding the epitranscriptional landscape from native RNA sequences Nucleic Acids Res. 2021 49 e7 e7 10.1093/nar/gkaa620 32710622 PMC7826254 Jenjaroenpun, P. et al. Decoding the epitranscriptional landscape from native RNA sequences. Nucleic Acids Res. 49 32710622 10.1093/nar/gkaa620 PMC7826254 7. Nguyen TA Direct identification of A-to-I editing sites with nanopore native RNA sequencing Nat. Methods 2022 19 833 844 10.1038/s41592-022-01513-3 35697834 Nguyen, T. A. et al. Direct identification of A-to-I editing sites with nanopore native RNA sequencing. Nat. Methods 19 35697834 10.1038/s41592-022-01513-3 8. Wang Z Adapting nanopore sequencing basecalling models for modification detection via incremental learning and anomaly detection Nat. Commun. 2024 15 7148 10.1038/s41467-024-51639-5 39169028 PMC11339354 Wang, Z. et al. Adapting nanopore sequencing basecalling models for modification detection via incremental learning and anomaly detection. Nat. Commun. 15 39169028 10.1038/s41467-024-51639-5 PMC11339354 9. Lucas MC Quantitative analysis of tRNA abundance and modifications by nanopore RNA sequencing Nat. Biotechnol. 2024 42 72 86 10.1038/s41587-023-01743-6 37024678 PMC10791586 Lucas, M. C. et al. Quantitative analysis of tRNA abundance and modifications by nanopore RNA sequencing. Nat. Biotechnol. 42 37024678 10.1038/s41587-023-01743-6 PMC10791586 10. Gunter HM mRNA vaccine quality analysis using RNA sequencing Nat. Commun. 2023 14 5663 10.1038/s41467-023-41354-y 37735471 PMC10514319 Gunter, H. M. et al. mRNA vaccine quality analysis using RNA sequencing. Nat. Commun. 14 37735471 10.1038/s41467-023-41354-y PMC10514319 11. Zeglinski, K. et al. An optimized protocol for quality control of gene therapy vectors using nanopore direct RNA sequencing. Genome Res. 34 10.1101/gr.279405.124 PMC11610601 39467647 12. Sahin U Karikó K Türeci Ö mRNA-based therapeutics—developing a new class of drugs Nat. Rev. Drug Discov. 2014 13 759 780 10.1038/nrd4278 25233993 Sahin, U., Karikó, K. & Türeci, Ö mRNA-based therapeutics—developing a new class of drugs. Nat. Rev. Drug Discov. 13 25233993 10.1038/nrd4278 13. Bailey AD Concerted modification of nucleotides at functional centers of the ribosome revealed by single-molecule RNA modification profiling Elife 2022 11 e76562 10.7554/eLife.76562 35384842 PMC9045821 Bailey, A. D. et al. Concerted modification of nucleotides at functional centers of the ribosome revealed by single-molecule RNA modification profiling. Elife 11 35384842 10.7554/eLife.76562 PMC9045821 14. Traber GM Yu A-M RNAi-based therapeutics and novel RNA bioengineering technologies J. Pharmacol. Exp. Ther. 2023 384 133 154 10.1124/jpet.122.001234 35680378 PMC9827509 Traber, G. M. & Yu, A.-M. RNAi-based therapeutics and novel RNA bioengineering technologies. J. Pharmacol. Exp. Ther. 384 35680378 10.1124/jpet.122.001234 PMC9827509 15. Li M-M Chimeric microRNA-1291 biosynthesized efficiently in Escherichia coli is effective to reduce target gene expression in human carcinoma cells and improve chemosensitivity Drug Metab. Disposition 2015 43 1129 1136 10.1124/dmd.115.064493 PMC4468437 25934574 Li, M.-M. et al. Chimeric microRNA-1291 biosynthesized efficiently in Escherichia coli is effective to reduce target gene expression in human carcinoma cells and improve chemosensitivity. Drug Metab. Disposition 43 10.1124/dmd.115.064493 PMC4468437 25934574 16. Wang W-P Bioengineering novel chimeric microRNA-34a for prodrug cancer therapy: high-yield expression and purification, and structural and functional characterization J. Pharmacol. Exp. Therapeutics 2015 354 131 141 10.1124/jpet.115.225631 PMC4518075 26022002 Wang, W.-P. et al. Bioengineering novel chimeric microRNA-34a for prodrug cancer therapy: high-yield expression and purification, and structural and functional characterization. J. Pharmacol. Exp. Therapeutics 354 10.1124/jpet.115.225631 PMC4518075 26022002 17. Suzuki T The expanding world of tRNA modifications and their disease relevance Nat. Rev. Mol. Cell Biol. 2021 22 375 392 10.1038/s41580-021-00342-0 33658722 Suzuki, T. The expanding world of tRNA modifications and their disease relevance. Nat. Rev. Mol. Cell Biol. 22 33658722 10.1038/s41580-021-00342-0 18. Lauhon CT Erwin WM Ton GN Substrate specificity for 4-thiouridine modification in Escherichia coli J. Biol. Chem. 2004 279 23022 23029 10.1074/jbc.M401757200 15037613 Lauhon, C. T., Erwin, W. M. & Ton, G. N. Substrate specificity for 4-thiouridine modification in Escherichia coli. J. Biol. Chem. 279 15037613 10.1074/jbc.M401757200 19. Wang Z Training data diversity enhances the basecalling of novel RNA modification-induced nanopore sequencing readouts Nat. Commun. 2025 16 679 10.1038/s41467-025-55974-z 39814719 PMC11735843 Wang, Z. et al. Training data diversity enhances the basecalling of novel RNA modification-induced nanopore sequencing readouts. Nat. Commun. 16 39814719 10.1038/s41467-025-55974-z PMC11735843 20. Li P-C In vivo fermentation production of humanized noncoding RNAs carrying payload miRNAs for targeted anticancer therapy Theranostics 2021 11 4858 10.7150/thno.56596 33754032 PMC7978307 Li, P.-C. et al. In vivo fermentation production of humanized noncoding RNAs carrying payload miRNAs for targeted anticancer therapy. Theranostics 11 33754032 10.7150/thno.56596 PMC7978307 21. Tu, M.-J. et al. Expression and purification of tRNA/pre-miRNA-based recombinant noncoding RNAs. in RNA Scaffolds: Methods and Protocols 10.1007/978-1-0716-1499-0_18 PMC9516694 34086286 22. Li H The sequence alignment/map format and SAMtools bioinformatics 2009 25 2078 2079 10.1093/bioinformatics/btp352 19505943 PMC2723002 Li, H. et al. The sequence alignment/map format and SAMtools. bioinformatics 25 19505943 10.1093/bioinformatics/btp352 PMC2723002 23. Li H Minimap2: pairwise alignment for nucleotide sequences Bioinformatics 2018 34 3094 3100 10.1093/bioinformatics/bty191 29750242 PMC6137996 Li, H. Minimap2: pairwise alignment for nucleotide sequences. Bioinformatics 34 29750242 10.1093/bioinformatics/bty191 PMC6137996 ",
  "metadata": {
    "Title of this paper": "Minimap2: pairwise alignment for nucleotide sequences",
    "Journal it was published in:": "Communications Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488850/"
  }
}