{
  "title": "Paper_970",
  "abstract": "pmc PeerJ PeerJ 2057 peerj peerj PeerJ 2167-8359 PeerJ, Inc PMC12476865 PMC12476865.1 12476865 12476865 41025048 10.7717/peerj.20051 20051 1 Bioinformatics Oncology Women’s Health Identification of immunological and prognostic value of SHROOM2 in pan-cancer and experimental verification of its role in promoting malignant phenotypes in breast cancer Wang Yaya 1 Ren Yuechao 2 Zheng Xiaoyan 1 Wang Yan 1 Wang Haoqi 3 Zhang Xi 3 Li Sainan 48402144@hebmu.edu.cn 3 1 School of Agroforestry and Medicine, The Open University of China BeiJing China 2 Research and Development Center, The Open University of China online Education & Information Technology Co., Ltd BeiJing China 3 Department of Breast Center, The Fourth Hospital of Hebei Medical University Shijia Zhuang Hebei China Uversky Vladimir 25 9 2025 2025 13 478561 e20051 24 2 2025 17 8 2025 25 09 2025 29 09 2025 30 09 2025 ©2025 Wang et al. 2025 Wang et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Objective This study aimed to investigate the relationship between Shroom Family Member 2 (SHROOM2) expression and immune features, survival outcomes, and tumor mutational burden (TMB) across various cancer types, as well as its impact on the aggressive behavior of breast cancer (BC). Methods RNA sequencing and clinical survival data were retrieved from the TCGA-BRCA and TCGA-PANCANCER datasets within The Cancer Genome Atlas (TCGA) database. Survival analyses were performed to assess the association between SHROOM2 expression and clinical outcomes across different cancer types. Gene set enrichment analysis (GSEA) was applied to identify potential mechanisms associated with differentially expressed genes in BC. Spearman correlation and Wilcoxon tests were used to evaluate the relationships between SHROOM2 levels and immune characteristics, TMB, or drug sensitivity. Additionally, the effects of SHROOM2 on BC cells were assessed through reverse transcription-quantitative polymerase chain reaction (PCR), cell counting kit-8 (CCK-8) assay, transwell assay, and wound healing assay. Results SHROOM2 was overexpressed in a range of cancers, and its upregulation was associated with poor clinical outcomes. It was significantly correlated with immunomodulators, immune checkpoints, and immune cell infiltration in pan-cancer. Moreover, it showed an association with TMB and drug sensitivity in BC. Increased SHROOM2 expression enhanced the proliferative, migratory, and invasive capabilities of BC cells in vitro Conclusion High SHROOM2 expression is linked to poor prognosis in BC, supporting its potential as both an immunological and predictive biomarker. SHROOM2 Immune Prognosis Malignant phenotypes Breast cancer The Open University of China Science Foundation for Youths Q22I0023 Government-funded Excellent Talents Program of Hebei Provincial Department of Finance ZF2025187 This study was funded by The Open University of China Science Foundation for Youths (Q22I0023). The government-funded Excellent Talents Program of Hebei Provincial Department of Finance (ZF2025187) funded the APC for this article. The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Cancer ranks among the foremost causes of global mortality, presenting significant challenges to both human health and social well-being. It is estimated that one in five individuals, regardless of gender, will develop cancer over the course of their lifetime, with nearly one in nine men and one in twelve women succumbing to cancer-related fatalities ( Bray et al., 2024 Bray et al., 2024 Siegel et al., 2025 Advances in cancer biology have revolutionized cancer management, shifting from single-modality treatments, such as surgery and endocrine therapy, to multimodal approaches combining surgery, radiotherapy, and chemotherapy ( Sonkin, Thomas & Teicher, 2024 Liu & Dilger, 2025 Joshi et al., 2024 Shroom Family Member 2 (SHROOM2) is implicated in ocular albinism type 1 (OA1) due to its localization on the X chromosome and is recognized as a human homolog of apical protein in Xenopus Hagens et al., 2006 Closa et al., 2014 Liu et al., 2024 Shou et al., 2015 Yuan et al., 2019 Chen et al., 2025 via The quantification of non-synonymous somatic mutations in the cancer cell genome defines tumor mutational burden (TMB), which varies across different cancer types and within the same category. Early retrospective and prospective studies identified TMB as a potential predictor of immune checkpoint inhibitor response ( Budczies et al., 2024 Maio et al., 2022 Kiri & Ryba, 2024 Trocchia et al., 2024 Recent advancements in transcriptomics have incorporated innovative methodologies, including generative adversarial networks (GANs) ( Ai, Smith & Feltus, 2023 in vitro Materials & Methods Differential expression analysis RNA-sequencing (RNA-seq) data across multiple cancer types were retrieved from TCGA ( https://portal.gdc.cancer.gov http://www.gtexportal.org/ via Survival and clinicopathological analyses Clinical follow-up and clinicopathological data were sourced from TCGA ( https://portal.gdc.cancer.gov P Samples from TCGA-BRCA were categorized based on estrogen receptor (ER) status, progesterone receptor (PR) status, age, and PAM class. SHROOM2 expression was evaluated and compared across these categories using the Wilcoxon rank-sum test. Additionally, survival analysis was performed within subgroups stratified by these clinicopathological characteristics to assess the prognostic value of SHROOM2 expression in BC. Enrichment analysis Gene set enrichment analysis (GSEA) was performed to assess the potential impact of SHROOM2 levels on cancer-associated pathways, with the results displayed in a heatmap. Furthermore, the role of SHROOM2 expression in BC was explored by applying GSEA to identify pathways associated with genes influenced by SHROOM2 in BC. Assessment of immune characteristics SHROOM2’s impact on immune-related features was evaluated by examining its association with immunomodulators, immune checkpoints, and immune cell infiltration (ICI). Gene catalogs for immune checkpoints and immunomodulatory factors were retrieved from TISIDB ( http://cis.hku.hk/TISIDB/download.php ICI data were sourced from TIMER2.0 ( http://timer.cistrome.org/ Immune activity scores were calculated using the Tumor Immunophenotype tool ( http://biocc.hrbmu.edu.cn/TIP/ Finally, immune checkpoint scores were compared between the high- and low-SHROOM2-expression cohorts to assess the correlation between SHROOM2 expression and immune checkpoint genes across cancer types. TMB and drug sensitivity analyses TMB and drug sensitivity analyses were conducted to assess tumor heterogeneity and predict the efficacy of immunotherapy. TMB scores in the pan-cancer dataset were calculated using the “maftools” package ( Mayakonda et al., 2018 SHROOM2 The chemotherapeutic response of each sample was predicted using drug sensitivity data from the Genomics of Drug Sensitivity in Cancer (GDSC) database ( https://www.cancerrxgene.org/ Geeleher, Cox & Huang, 2014 50 via Jiang et al., 2021 Cell culture and siRNA transfection To explore the involvement of SHROOM2 in breast cancer pathogenesis, in vitro 2 G04026 Table S1 via CCK-8 assay To assess the role of SHROOM2 in breast cancer in vitro Transwell assay Cell migration was assessed using a Transwell assay. MCF7 and MDA-MB-231 cells were resuspended in DMEM without fetal bovine serum (FBS) at a concentration of 2 × 10 4 To assess invasive capacity, a mixture of DMEM without FBS was prepared at a 1:7 ratio with stroma (Beyotime, Guangzhou, China). A 50 µL volume of this mixture was added to the upper chamber, and incubation was carried out for 3–4 h. The subsequent steps were identical to those used in the migration assay. qRT-PCR Total RNA was extracted from MCF7 and MDA-MB-231 cells using the Vazyme RNA Isolation Kit (Vazyme, Nan Jing, China). Complementary DNA (cDNA) synthesis was performed from the isolated RNA following the manufacturer’s protocol with a reverse transcription kit (Vazyme). The resulting cDNA was amplified using the following primers: forward, AGTTCTACTCGCGCTTCTGT; reverse, CCTTCATGTAGCTGAGCCCT. Gene expression levels were quantified using the 2- ΔΔCT via Wound healing assay Cells were seeded into 6-well plates at a density of 1 × 10 6 Statistical analysis Statistical comparisons between two groups were conducted using Student’s t P Results SHROOM2 was highly expressed in pan-cancer Analysis of RNA-seq data from TCGA and GTEx repositories revealed significant overexpression of SHROOM2 in cancers such as adenoid cystic carcinoma (ACC), bladder urothelian carcinoma (BLCA), cervical squamous cell carcinoma and endocervical adenocarcinoma (CESC), colon adenocarcinoma (COAD), colon adenocarcinoma/rectum adenocarcinoma (COADREAD), esophageal carcinoma (ESCA), gliobastoma multiforme (GBM), lower-grade glimas (GBMLGG), kidney chromophobe (KICH), acute myeloid leukemia (LAML), brain lower grade glioma (LGG), liver hepatocellular carcinoma (LIHC), lung adenocarcinoma (LUAD), lung squamous cell carcinoma (LUSC), ovarian carcinoma (OV), pancreatic adenocarcinoma (PAAD), prostate adenocarcinoma (PRAD), skin cutaneous melanoma (SKCM), stomach adenocarcinoma (STAD), stomach and esophageal carcinoma (STES), testicular germ cell tumors (TGCT), thyroid carcinoma (THCA), and uterine carcinosarcoma (UCS) ( Figs. 1A 1B Fig. 1C 10.7717/peerj.20051/fig-1 Figure 1 Expression of SHROOM2 in pan-cancer (including breast cancer). (A) SHROOM2 SHROOM2 SHROOM2 SHROOM2 was correlated with prognosis in pan-cancer SHROOM2 levels correlated with OS in BRCA, kidney renal clear cell carcinoma (KIRC), and rectum adenocarcinoma (READ) ( Fig. 2A Fig. 2B Fig. 2C Figs. 2D 2M 10.7717/peerj.20051/fig-2 Figure 2 Relationship between SHROOM2 (A) Relationship between SHROOM2 SHROOM2 SHROOM2 SHROOM2 Additionally, SHROOM2 expression was associated with several clinicopathological features. Higher levels were observed in patients aged ≤60 years ( Fig. 3A Fig. 3B Fig. 3C Fig. 3D Fig. 3E 10.7717/peerj.20051/fig-3 Figure 3 Relationship between SHROOM2 expression and clinicopathological characteristics. SHROOM2 expression in different groups stratified based on (A) age, (B) ER status, (C) PR status, and (D) PAM50 subtypes. (E) Receiver operating characteristic (ROC) curve demonstrating the diagnostic efficacy of SHROOM2 in breast cancer. Subgroup KM analysis based on (F–G) age, (H–I) ER status, (J–K) PR status, and (L–O) PAM50 subtypes. ER, estrogen receptor; PR, progesterone receptor; PAM50, Prediction Analysis of Microarray 50 gene panel; KM, Kaplan–Meier. Subgroup analysis was conducted to assess the impact of SHROOM2 on survival outcomes in BC patients with varying clinicopathological features ( Figs. 3F 3O Fig. 3H Fig. 3J Fig. 3L SHROOM2 was correlated with multiple cancer-related signaling pathways Pathway analysis was performed to explore the role of SHROOM2 in cancer-related mechanisms. Pan-cancer GSEA identified SHROOM2 enrichment in several cancer-associated pathways, including EMT ( Fig. 4A Fig. 4B 10.7717/peerj.20051/fig-4 Figure 4 Enrichment analysis of upregulated and downregulated genes in two groups stratified based on the median SHROOM2 (A) Pan-cancer GSEA. (B) GSEA analysis based on the SHROOM2 SHROOM2 affected immunomodulators, immune checkpoints, ICI, immune activity, and TMB in pan-cancer Spearman correlation analysis revealed a strong association between SHROOM2 expression and that of immunomodulators in pan-cancer ( Fig. 5 10.7717/peerj.20051/fig-5 Figure 5 Correlation between SHROOM2 Additionally, SHROOM2 levels were found to correlate with immune checkpoint expression across various cancer types ( Fig. 6A Fig. 6A 10.7717/peerj.20051/fig-6 Figure 6 Correlation of SHROOM2 (A) Correlation between SHROOM2 SHROOM2 P P P As illustrated in Fig. 6B Furthermore, as shown in Fig. 7 Fig. 8A Fig. 8B Fig. 8C Fig. 8D 10.7717/peerj.20051/fig-7 Figure 7 Correlation between SHROOM2 10.7717/peerj.20051/fig-8 Figure 8 Correlation between SHROOM2 (A) Correlation between SHROOM2 SHROOM2 SHROOM2 P P P Analysis of the relationship between SHROOM2 expression and TMB ( Figs. 9A 9K Fig. 9F Fig. 9J Fig. 9A Fig. 9B Fig. 9C Fig. 9D Fig. 9E Fig. 9G Fig. 9H Fig. 9I Fig. 9K 10.7717/peerj.20051/fig-9 Figure 9 Correlation between TMB and SHROOM2 SHROOM2 expression was associated with drug sensitivity in BC The relationship between SHROOM2 expression and clinical response to anti-cancer treatments was assessed by examining its correlation with various common anti-cancer agents ( Figs. 10A 10H 50 Fig. 10A Fig. 10B Fig. 10C Fig. 10D Fig. 10E Fig. 10F Figs. 10A 10F Figs. 10G 10H 10.7717/peerj.20051/fig-10 Figure 10 Correlation between SHROOM2 SHROOM2 induced breast cancer cell proliferation, migration, and invasion in vitro In vitro Figs. 11A 11B via Figs. 11C 11D 10.7717/peerj.20051/fig-11 Figure 11 SHROOM2 in vitro qRT-PCR validated the knockdown of SHROOM2 SHROOM2 P P P Transwell assays further confirmed that silencing SHROOM2 impaired the migratory and invasive abilities of both BC cell lines ( Figs. 12A 12B Figs. 12C 12D 10.7717/peerj.20051/fig-12 Figure 12 SHROOM2 in vitro Transwell assays showed that knockdown of SHROOM2 SHROOM2 P P P Discussion This study explored the association between SHROOM2 expression and patient outcomes across multiple cancer types. Additionally, the relationship between SHROOM2 levels and immunomodulators, immune checkpoints, ICI, immune activity, TMB, and drug sensitivity in pan-cancer was evaluated. Finally, the potential oncogenic role of SHROOM2 in BC was validated through in vitro SHROOM2 expression has been linked to the risk and pathogenesis of esophageal squamous carcinoma, colorectal cancer, and medulloblastoma ( Liu et al., 2024 Yuan et al., 2019 in vitro The tumor microenvironment (TME) plays a critical role in tumor progression, comprising a mesenchymal ecosystem of mesenchyme, immune cells, inflammatory cells, endothelial cells, adipocytes, and fibroblasts ( Ugai et al., 2024 Ghaedrahmati, Esmaeil & Abbaspour, 2023 via Niu et al., 2024 Ramapriyan et al., 2024 Kundu et al., 2024 Yu et al., 2024 Splendiani et al., 2024 In addition to immune checkpoints, immunomodulators play a key role in the TME. The immune system functions as a complex network designed to protect the body from harmful agents, eliminate pathogens or cancer cells, maintain memory lymphocytes, and remove autoreactive immune cells to ensure self-tolerance ( Debele, Yeh & Su, 2020 Valdés-González et al., 2023 Valdés-González et al., 2023 TMB quantifies the number of nonsynonymous somatic mutations per megabase (Mb) in a tumor cell genome and is a key predictor of immunotherapy efficacy ( Jardim et al., 2021 Fancello et al., 2019 Wang et al., 2024 Fancello et al., 2019 Chemotherapy effectively targets and destroys rapidly proliferating tumor cells ( Cui et al., 2020 This study investigated the role of SHROOM2 across various cancers, with a specific focus on BC. Despite utilizing the TCGA database to analyze SHROOM2 expression and its associations with tumor immune features and prognosis in pan-cancer, including BC, several limitations of the database must be acknowledged. The TCGA primarily includes data from primary tumors, excluding cell lines, xenografts, and metastatic specimens. This limitation hinders investigations into tumor evolution, drug resistance mechanisms, and the relevance of preclinical models. For example, while amplifications in glioblastoma are best detected in primary tumors, homozygous deletions are more consistently identified in xenografts and cell lines. Additionally, our study does not investigate the SHROOM2-associated signaling pathways that may modulate immune responses. Future research will involve in-depth in vitro in vivo Conclusions This study demonstrates that SHROOM2 expression is associated with immune-related features, prognosis, and chemotherapy sensitivity across multiple cancer types. These results highlight the relevance of SHROOM2 in pan-cancer malignancies, including BC, and validate its potential as a prognostic biomarker for cancer progression. Supplemental Information 10.7717/peerj.20051/supp-1 Supplemental Information 1 siRNA transfection protocol 10.7717/peerj.20051/supp-2 Supplemental Information 2 Raw data of TCGA 10.7717/peerj.20051/supp-3 Supplemental Information 3 Raw data of TCGA+GTEx 10.7717/peerj.20051/supp-4 Supplemental Information 4 Raw data of TCGA-survival information 10.7717/peerj.20051/supp-5 Supplemental Information 5 Raw data of OS 10.7717/peerj.20051/supp-6 Supplemental Information 6 Raw data of DSS 10.7717/peerj.20051/supp-7 Supplemental Information 7 Raw data of PFI 10.7717/peerj.20051/supp-8 Supplemental Information 8 Raw data of KM-KIRC-DSS 10.7717/peerj.20051/supp-9 Supplemental Information 9 Raw data of KM-UVM-PFI 10.7717/peerj.20051/supp-10 Supplemental Information 10 Raw data of KM-THCA-PFI 10.7717/peerj.20051/supp-11 Supplemental Information 11 Raw data of KM-OS-BRCA 10.7717/peerj.20051/supp-12 Supplemental Information 12 Raw data of KM-KIRC-OS 10.7717/peerj.20051/supp-13 Supplemental Information 13 Raw data of KM-READ-OS 10.7717/peerj.20051/supp-14 Supplemental Information 14 Raw data of KM-SARC-PFI 10.7717/peerj.20051/supp-15 Supplemental Information 15 Raw data of KM-KIRC-PFI 10.7717/peerj.20051/supp-16 Supplemental Information 16 Raw data of KM-SARC-DSS 10.7717/peerj.20051/supp-17 Supplemental Information 17 Raw data of TCGA-BRCA clinical information 10.7717/peerj.20051/supp-18 Supplemental Information 18 Raw data of GSEA 10.7717/peerj.20051/supp-19 Supplemental Information 19 List of immunomodulators-related genes 10.7717/peerj.20051/supp-20 Supplemental Information 20 List of subtypes of immunomodulators-related genes (including Receptor, immunomodulator, MHC, Chemokine) 10.7717/peerj.20051/supp-21 Supplemental Information 21 Data about the expression of immune-checkpoint related genes in pan-cancer 10.7717/peerj.20051/supp-22 Supplemental Information 22 Data about spearman correlation coefficient of the relationship between the expression of SHROOM2 and immune-checkpoint related genes in pan-cancer 10.7717/peerj.20051/supp-23 Supplemental Information 23 Data about P value of Spearman analysis about the relationship between the expression of SHROOM2 and immune-checkpoint related genes in pan-cancer 10.7717/peerj.20051/supp-24 Supplemental Information 24 Data about combined results of P value of Spearman analysis and Spearman correlation coefficient of the relationship between the expression of SHROOM2 and immune-checkpoint related genes in pan-cancer 10.7717/peerj.20051/supp-25 Supplemental Information 25 Data about combined results of P value of Spearman analysis and Spearman correlation coefficient of the relationship between the expression of SHROOM2 and immune cell infiltration scores in pan-cancer 10.7717/peerj.20051/supp-26 Supplemental Information 26 Data about spearman correlation coefficient of the relationship between the expression of SHROOM2 and immune inflammation pathway scores in pan-cancer 10.7717/peerj.20051/supp-27 Supplemental Information 27 Data about P value of spearman analysis about the relationship between the expression of SHROOM2 and immune inflammation pathway scores in pan-cancer 10.7717/peerj.20051/supp-28 Supplemental Information 28 Data about immune inflammation pathway scores in pan-cancer 10.7717/peerj.20051/supp-29 Supplemental Information 29 Data about spearman correlation coefficient of the relationship between the expression of SHROOM2 and immune cell infiltration scores in pan-cancer 10.7717/peerj.20051/supp-30 Supplemental Information 30 Data about P value of spearman analysis about the relationship between the expression of SHROOM2 and immune cell infiltration scores in pan-cancer 10.7717/peerj.20051/supp-31 Supplemental Information 31 Data about combined results of Spearman analysis and Spearman correlation coefficient of the relationship between the expression of SHROOM2 and immune cell infiltration scores in pan-cancer 10.7717/peerj.20051/supp-32 Supplemental Information 32 Raw data of immune cell infiltration accumulation diagram 10.7717/peerj.20051/supp-33 Supplemental Information 33 Raw data of immune cell infiltration (BRCA-cibsort) 10.7717/peerj.20051/supp-34 Supplemental Information 34 Raw data of immune cell infiltration (BRCA-estimate) 10.7717/peerj.20051/supp-35 Supplemental Information 35 Raw data of immune cell activity 10.7717/peerj.20051/supp-36 Supplemental Information 36 Raw data of TMB 10.7717/peerj.20051/supp-37 Supplemental Information 37 Raw data of drug sensitivity 10.7717/peerj.20051/supp-38 Supplemental Information 38 PCR raw data 10.7717/peerj.20051/supp-39 Supplemental Information 39 Raw data of CCK8 assays about MCF7 cells 10.7717/peerj.20051/supp-40 Supplemental Information 40 Raw data of CCK8 assay about MDA-MB-231 cells 10.7717/peerj.20051/supp-41 Supplemental Information 41 Raw data of transwell assay about MCF7 cells 10.7717/peerj.20051/supp-42 Supplemental Information 42 Raw data for transwell assay about MDA-MB-231 cells 10.7717/peerj.20051/supp-43 Supplemental Information 43 Raw data of wound healing about MCF7 cells 10.7717/peerj.20051/supp-44 Supplemental Information 44 Raw data about wound healing assays about MDA-MB-231 cells The authors gratefully acknowledge the technical support provided by The Fourth Hospital of Hebei Medical University. Additional Information and Declarations Competing Interests The authors declare there are no competing interests. Yuechao Ren is employed by OUC online Education & Information Technology Co., Ltd. Author Contributions Yaya Wang Yuechao Ren Xiaoyan Zheng Yan Wang Haoqi Wang Xi Zhang Sainan Li Data Availability The following information was supplied regarding data availability: The data is available in the Supplementary Files References Ai, Smith & Feltus (2023) Ai X Smith MC Feltus FA 2023 Generative adversarial networks applied to gene expression analysis: an interdisciplinary perspective Computational and Systems Oncology 3 17 10.1002/cso2.1050 Bray et al. (2024) Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Jemal A 2024 Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA: A Cancer Journal for Clinicians 74 229 263 10.3322/caac.21834 38572751 Budczies et al. (2024) Budczies J Kazdal D Menzel M Beck S Kluck K Altbürger C Schwab C Allgäuer M Ahadova A Kloor M Schirmacher P Peters S Krämer A Christopoulos P Stenzinger A 2024 Tumour mutational burden: clinical utility, challenges and emerging improvements Nature Reviews Clinical Oncology 21 10 725 742 10.1038/s41571-024-00932-9 39192001 Chen et al. (2025) Chen K Zhu M Hu Q Huang H Chen K Shuai X Huang J Tao Q Guo Z 2025 Regulatory role of lnc-MAP3K13-3:1 on miR-6894-3p and SHROOM2 in modulating cellular dynamics in hepatocellular carcinoma BMC Cancer 25 83 10.1186/s12885-024-13263-w 39810131 PMC11731390 Closa et al. (2014) Closa A Cordero D Sanz-Pamplona R Solé X Crous-Bou M Paré-Brunet L Berenguer A Guino E Lopez-Doriga A Guardiola J Biondo S Salazar R Moreno V 2014 Identification of candidate susceptibility genes for colorectal cancer through eQTL analysis Carcinogenesis 35 2039 2046 10.1093/carcin/bgu092 24760461 PMC4146415 Cui et al. (2020) Cui C Yang J Li X Liu D Fu L Wang X 2020 Functions and mechanisms of circular RNAs in cancer radiotherapy and chemotherapy resistance Molecular Cancer 19 58 10.1186/s12943-020-01180-y 32171304 PMC7071709 Debele, Yeh & Su (2020) Debele TA Yeh CF Su WP 2020 Cancer immunotherapy and application of nanoparticles in cancers immunotherapy as the delivery of immunotherapeutic agents and as the immunomodulators Cancers 12 12 3773 10.3390/cancers12123773 33333816 PMC7765190 Fancello et al. (2019) Fancello L Gandini S Pelicci PG Mazzarella L 2019 Tumor mutational burden quantification from targeted gene panels: major advancements and challenges The Journal for ImmunoTherapy of Cancer 7 183 10.1186/s40425-019-0647-4 31307554 PMC6631597 Geeleher, Cox & Huang (2014) Geeleher P Cox NJ Huang RS 2014 Clinical drug response can be predicted using baseline gene expression levels and in vitro Genome Biology 15 R47 10.1186/gb-2014-15-3-r47 24580837 PMC4054092 Ghaedrahmati, Esmaeil & Abbaspour (2023) Ghaedrahmati F Esmaeil N Abbaspour M 2023 Targeting immune checkpoints: how to use natural killer cells for fighting against solid tumors Cancer Communications 43 177 213 10.1002/cac2.12394 36585761 PMC9926962 Hagens et al. (2006) Hagens O Ballabio A Kalscheuer V Kraehenbuhl JP Schiaffino MV Smith P Staub O Hildebrand J Wallingford JB 2006 A new standard nomenclature for proteins related to Apx and Shroom BMC Cell Biology 7 18 10.1186/1471-2121-7-18 16615870 PMC1481537 Jardim et al. (2021) Jardim DL Goodman A De Melo Gagliato D Kurzrock R 2021 The challenges of tumor mutational burden as an immunotherapy biomarker Cancer Cell 39 154 173 10.1016/j.ccell.2020.10.001 33125859 PMC7878292 Jiang et al. (2021) Jiang Q Sun J Chen H Ding C Tang Z Ruan Y Liu F Sun Y 2021 Establishment of an immune cell infiltration score to help predict the prognosis and chemotherapy responsiveness of gastric cancer patients Frontiers in Oncology 11 650673 10.3389/fonc.2021.650673 34307129 PMC8299334 Joshi et al. (2024) Joshi RM Telang B Soni G Khalife A 2024 Overview of perspectives on cancer, newer therapies, and future directions Oncology and Translational Medicine 10 105 109 Kiri & Ryba (2024) Kiri S Ryba T 2024 Cancer, metastasis, and the epigenome Molecular Cancer 23 154 10.1186/s12943-024-02069-w 39095874 PMC11295362 Kundu et al. (2024) Kundu M Butti R Panda VK Malhotra D Das S Mitra T Kapse P Gosavi SW Kundu GC 2024 Modulation of the tumor microenvironment and mechanism of immunotherapy-based drug resistance in breast cancer Molecular Cancer 23 92 10.1186/s12943-024-01990-4 38715072 PMC11075356 Liu & Dilger (2025) Liu H Dilger JP 2025 Different strategies for cancer treatment: targeting cancer cells or their neighbors? Chinese Journal of Cancer Research 37 289 292 10.21147/j.issn.1000-9604.2025.02.12 40353083 PMC12062981 Liu et al. (2024) Liu W Xiu L Zhou M Li T Jiang N Wan Y Qiu C Li J Hu W Zhang W Wu J 2024 The critical role of the shroom family proteins in morphogenesis, organogenesis and disease Phenomics 4 187 202 10.1007/s43657-023-00119-9 38884059 PMC11169129 Maio et al. (2022) Maio M Ascierto PA Manzyuk L Motola-Kuba D Penel N Cassier PA Bariani GM De Jesus Acosta A Doi T Longo F Miller WH Oh DY Gottfried M Xu L Jin F Norwood K Marabelle A 2022 Pembrolizumab in microsatellite instability high or mismatch repair deficient cancers: updated analysis from the phase II KEYNOTE-158 study Annals of Oncology 33 929 938 10.1016/j.annonc.2022.05.519 35680043 Mayakonda et al. (2018) Mayakonda A Lin DC Assenov Y Plass C Koeffler HP 2018 Maftools: efficient and comprehensive analysis of somatic variants in cancer Genome Research 28 1747 1756 10.1101/gr.239244.118 30341162 PMC6211645 Niu et al. (2024) Niu L Wang Q Feng F Yang W Xie Z Zheng G Zhou W Duan L Du K Li Y Tian Y Chen J Xie Q Fan A Dan H Liu J Fan D Hong L Zhang J Zheng J 2024 Small extracellular vesicles-mediated cellular interactions between tumor cells and tumor-associated macrophages: implication for immunotherapy Biochimica et Biophysica Acta: Molecular Basis of Disease 1870 166917 10.1016/j.bbadis.2023.166917 37820821 Ramapriyan et al. (2024) Ramapriyan R Vykunta VS Vandecandelaere G Richardson LGK Sun J Curry WT Choi BD 2024 Altered cancer metabolism and implications for next-generation CAR T-cell therapies Pharmacology and Therapeutics 259 108667 10.1016/j.pharmthera.2024.108667 38763321 Shou et al. (2015) Shou Y Robinson DM Amakye DD Rose KL Cho YJ Ligon KL Sharp T Haider AS Bandaru R Ando Y Geoerger B Doz F Ashley DM Hargrave DR Casanova M Tawbi HA Rodon J Thomas AL Mita AC MacDonald TJ Kieran MW 2015 A five-gene hedgehog signature developed as a patient preselection tool for hedgehog inhibitor therapy in medulloblastoma Clinical Cancer Research 21 585 593 10.1158/1078-0432.ccr-13-1711 25473003 Siegel et al. (2025) Siegel RL Kratzer TB Giaquinto AN Sung H Jemal A 2025 Cancer statistics, 2025 CA: A Cancer Journal for Clinicians 75 10 45 10.3322/caac.21871 39817679 PMC11745215 Sonkin, Thomas & Teicher (2024) Sonkin D Thomas A Teicher BA 2024 Cancer treatments: past, present, and future Cancer Genetics 286–287 18 24 10.1016/j.cancergen.2024.06.002 PMC11338712 38909530 Splendiani et al. (2024) Splendiani E Besharat ZM Covre A Maio M Di Giacomo AM Ferretti E 2024 Immunotherapy in anmoanoma: can we predict response to treatment with circulating biomarkers? Pharmacology and Therapeutics 256 108613 10.1016/j.pharmthera.2024.108613 38367867 Trocchia et al. (2024) Trocchia M Ventrici A Modestino L Cristinziano L Ferrara AL Palestra F Loffredo S Capone M Madonna G Romanelli M Ascierto PA Galdiero MR 2024 Innate immune cells in melanoma: implications for immunotherapy International Journal of Molecular Sciences 25 15 8523 10.3390/ijms25158523 39126091 PMC11313504 Ugai et al. (2024) Ugai T Yao Q Ugai S Ogino S 2024 Advancing precision oncology: insights into the tumor microenvironment and immunotherapy outcomes Innovation (Camb) 5 100656 10.1016/j.xinn.2024.100656 39021526 PMC11253650 Valdés-González et al. (2023) Valdés-González JA Sánchez M Moratilla-Rivera I Iglesias I Gómez-Serranillos MP 2023 Immunomodulatory, anti-inflammatory, and anti-cancer properties of ginseng: a pharmacological update Molecules 28 9 3863 10.3390/molecules28093863 37175273 PMC10180039 Wang et al. (2024) Wang X Lamberti G Di Federico A Alessi J Ferrara R Sholl ML Awad MM Vokes N Ricciuti B 2024 Tumor mutational burden for the prediction of PD-(L)1 blockade efficacy in cancer: challenges and opportunities Annals of Oncology 35 508 522 10.1016/j.annonc.2024.03.007 38537779 Yu et al. (2024) Yu X Zhai X Wu J Feng Q Hu C Zhu L Zhou Q 2024 Evolving perspectives regarding the role of the PD-1/PD-L1 pathway in gastric cancer immunotherapy Biochimica et Biophysica Acta: Molecular Basis of Disease 1870 166881 10.1016/j.bbadis.2023.166881 37696462 Yuan et al. (2019) Yuan J Chen L Xiao J Qi XK Zhang J Li X Wang Z Lian YF Xiang T Zhang Y Chen MY Bei JX Zeng YX Feng L 2019 SHROOM2 inhibits tumor metastasis through RhoA-ROCK pathway-dependent and -independent mechanisms in nasopharyngeal carcinoma Cell Death & Disease 10 58 10.1038/s41419-019-1325-7 30683844 PMC6347642 ",
  "metadata": {
    "Title of this paper": "SHROOM2 inhibits tumor metastasis through RhoA-ROCK pathway-dependent and -independent mechanisms in nasopharyngeal carcinoma",
    "Journal it was published in:": "PeerJ",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476865/"
  }
}