{
  "title": "Paper_806",
  "abstract": "3 Biotech 3 Biotech 1811 threebio 3 Biotech 2190-572X 2190-5738 Springer PMC11377376 PMC11377376.1 11377376 11377376 39247456 10.1007/s13205-024-04063-x 4063 1 Original Article Developing a novel neutralizing monoclonal antibody against TrkB Yildirim Gamze Eda http://orcid.org/0000-0001-7355-3878 Yilmaz Erkan eyilmaz@ankara.edu.tr https://ror.org/01wntqw50 grid.7256.6 0000 0001 0940 9118 Biotechnology Institute, Ankara University, 5 9 2024 10 2024 14 10 469884 221 3 6 2024 23 8 2024 01 10 2025 01 10 2025 11 10 2024 01 10 2025 © King Abdulaziz City for Science and Technology 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 The TrkB receptor, which is highly expressed in various human cancers and considered a pro-oncogene, was targeted to develop neutralizing monoclonal antibodies against its immunoglobulin-like (Ig-like) domains. Recombinant TrkB-IgL peptide, including the Ig-like C2 type 1 (Ig-C2-type 1) and Ig-like C2 type 2 (Ig-C2-type 2) domains, was expressed and purified from E. coli Supplementary Information The online version contains supplementary material available at 10.1007/s13205-024-04063-x. Keywords TrkB Neutralizing antibody Monoclonal antibody TÜBİTAK 119s432 Yilmaz Erkan pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © King Abdulaziz City for Science and Technology (KACST) 2024 ",
  "metadata": {
    "Title of this paper": "Developing a novel neutralizing monoclonal antibody against TrkB",
    "Journal it was published in:": "3 Biotech",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11377376/"
  }
}