{
  "title": "Paper_991",
  "abstract": "pmc World J Gastroenterol World J Gastroenterol 818 wjg WJG World Journal of Gastroenterology 1007-9327 2219-2840 Baishideng Publishing Group Inc PMC12476658 PMC12476658.1 12476658 12476658 41024768 10.3748/wjg.v31.i35.110152 jWJG.v31.i35.eid110152 1 Retrospective Study Radiofrequency ablation with or without capecitabine maintenance therapy for lung oligometastases from colorectal cancer Li KN et al Li Ke-Ning Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China Ying Lei-Lei Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China Du Nan Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China Wang Ying Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China Huang Hao-Zhe Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China Wang Yao-Hui Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China Xu Li-Chao Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China Zhao Qing Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China Song Ge Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China Hu Yu-Bin Department of Tumor and Vascular Interventional Radiology, Clinical Oncology School of Fujian Medical University, Fujian Cancer Hospital, Fuzhou 350000, Fujian Province, China Li Wen-Tao Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China Yan Yan Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China Chen Chao Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China He Xin-Hong Department of Interventional Radiology, Fudan University Shanghai Cancer Center, Shanghai 200032, China Department of Oncology, Shanghai Medical College, Fudan University, Shanghai 200032, China. xinhong.he@shca.org.cn Co-first authors: Ke-Ning Li and Lei-Lei Ying. Co-corresponding authors: Chao Chen and Xin-Hong He. Author contributions: Li KN, and Ying LL wrote the original draft, they contributed equally to this article, they are the co-first authors of this manuscript; Chen C, He XH and Li KN designed the study; Chen C and Li KN designed the methodology of study and analyzed all data; He XH, Chen C, Du N, Wang Y, Huang HZ, Xu LC, Zhao Q, Song G, Hu YB, Li WT, Yan Y, Wang YH performed the ablation procedure as well as documented all data related to radiofrequency ablation; He XH made thoroughly review and editing of the manuscript; He XH and Chen C contributed equally to this article, they are the co-corresponding authors of this manuscript; All authors thoroughly reviewed and endorsed the final manuscript. Supported by the National Natural Science Foundation of China, No. 82072034. Corresponding author: Xin-Hong He, MD, Doctor, Department of Interventional Radiology, Fudan University Shanghai Cancer Center, No. 270 Dongan Road, Xuhui District, Shanghai 200032, China. xinhong.he@shca.org.cn 21 9 2025 21 9 2025 31 35 497732 110152 30 5 2025 7 7 2025 15 8 2025 21 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ BACKGROUND No clear guidelines for long-term postoperative maintenance therapy have been established for patients with lung oligometastases from colorectal cancer (CRC) who achieve radiological no evidence of disease after radiofrequency ablation (RFA) treatment. We compared the outcomes of patients with lung oligometastases from CRC after RFA plus maintenance capecitabine with RFA alone. AIM To determine whether adding capecitabine to RFA improves prognosis compared with RFA alone. METHODS This multicenter retrospective study included consecutive patients from two tertiary cancer centers treated for pulmonary oligometastases from CRC between 2016 and 2023. Subjects were assigned to RFA plus capecitabine (combined) or RFA alone (only RFA) groups. Primary outcomes included overall survival (OS) and progression-free survival (PFS) survival and the secondary outcome was local tumor progression (LTP). The OS, PFS, and LTP rates were compared between the two groups. In addition, prognostic factors were identified using univariate and multivariate analyses. RESULTS Combination therapy (RFA + capecitabine, n n P P P CONCLUSION RFA prolongs survival and local control in patients with CRC pulmonary oligometastases. Adjuvant capecitabine increases OS and reduces LTP compared to RFA alone, but PFS did not significantly change. Colorectal cancer Lung oligometastases Radiofrequency ablation Capecitabine Maintenance therapy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION The global incidence and mortality rates of colorectal cancer (CRC) are high[ 1 2 3 4 5 6 7 RFA, which reduces morbidity and shortens recovery times, is a promising therapeutic option for patients with limited pulmonary metastases. Furthermore, lesions that are not surgically accessible can be treated with RFA[ 8 2 4 9 10 8 11 12 13 16 This multicenter retrospective study aimed to evaluate the outcomes after RFA with or without capecitabine maintenance therapy in patients with lung oligometastases from CRC. A cohort of 247 patients treated at our institutions was analyzed to determine whether adding capecitabine maintenance therapy to RFA enhances progression-free survival (PFS), OS, and local tumor progression (LTP) compared to RFA alone. The results of this study provide valuable insights into optimizing therapeutic strategies for patients with oligometastatic CRC lung lesions and inform future randomized controlled trials. MATERIALS AND METHODS Patient population The study included 247 consecutive CRC patients from Fudan University Shanghai Cancer Center and Fujian Cancer Hospital with lung oligometastases who underwent initial RFA between January 2016 and December 2023. The ethics committees of both participating centers approved this investigation. Due to the retrospective nature of the study, patient informed consent was waived. Lung metastases of colorectal origin were clinically diagnosed after detecting new lesions by computed tomography (CT) or positron emission tomography (PET)-CT or by serial CT images of enlarging known lung defects. Histologic confirmation was attained via via via n n 2 The following clinical data were retrospectively collected from medical records: Age, sex, maximum tumor diameter, number of pulmonary metastases, primary tumor location, carcinoembryonic antigen (CEA) and carbohydrate antigen 19-9 (CA19-9) level at the initial RFA, tumor node metastasis classification of primary CRC, interval between primary CRC resection and RFA, chemotherapy use before lung RFA, history of previous lung metastasectomy, RFA needle type, and complications such as intra-alveolar hemorrhage (IAH) or pneumothorax. Synchronous tumors were defined as lesions occurring before or within 3 months after the surgery for CRC; other tumors were considered metachronous tumors[ 17 RFA procedures Three senior interventional radiologists (He XH, Wang Y, and Xu LC) with > 10 years of experience in CT-guided thoracic interventions conducted the RFA procedures using a 64-slice spiral CT scanner (Philips Healthcare, Amsterdam, The Netherlands). Scanning parameters were as follows: Tube voltage, 120 kVp; Tube current, 130-250 mA; Collimation, 0.625 mm; Slice thickness, 3 mm; Pitch, 0.758-1.015; Rotation time, 0.5 seconds; Field of view, 350 mm; And matrix, 512. CT fluoroscopic guidance was omitted to prevent unnecessary exposure of the radiologists to radiation. Patients were placed in prone, supine, or contralateral-dependent positions for sustained patient comfort and stability while ensuring optimal RFA routing to targeted lesions. Chest CT scans were obtained to facilitate procedural planning. Unenhanced CT images were compared with previous contrast-enhanced diagnostic CT views to identify lesions of interest, determine cross-sections, and establish chest landmarks. Lidocaine was administered at the puncture sites to induce local pleural anesthesia. In addition to CT monitoring, multi-tined (RITA Medical Systems Inc., Fremont, CA, United States) or multipolar (CelonLab POWER; Olympus Corp, Tokyo, Japan) RFA needles were inserted at predetermined directions and angles. Electrode targets snaring was confirmed with CT in all cases before conducting ablations. RFA was administered at a high-frequency current (460-480 kHz) to heat the tissue around the needle electrodes, causing focal coagulative necrosis but sparing more peripheral zones. The goal was to ablate tissue at least 5 mm beyond the lesion borders. If intraoperative complications, such as IAH or atelectasis, obscured the extent of ablation, at least two ablation cycles were administered to raise impedance before cessation. After finishing the ablation, the electrodes were withdrawn, and CT scans (same parameters) were repeated to verify complete tumor ablation and check for associated complications, including pneumothorax and hemorrhage. Chest radiographs (posterior-anterior and lateral views) were acquired within 1 day after the ablation. Complication severity was graded per 18 Follow-up and outcomes Baseline contrast-enhanced chest CT studies were performed 1 month after ablations and repeated at 3-month intervals for 1 year, followed by 4-6-month intervals. If the CT results were unclear, fluoro-2-deoxyglucose-PET and/or contrast-enhanced MRI was performed. To ensure methodological consistency across both centers (Fudan University Shanghai Cancer Center and Fujian Cancer Hospital), standardized data collection protocols were implemented, encompassing uniform imaging acquisition parameters, follow-up schedules, and centralized response assessment criteria. Two dedicated thoracic radiologists (> 10 years’ experience in oncologic imaging) independently evaluated all studies according to modified response evaluation criteria in solid tumors criteria. To ensure inter-reader consistency, discordant interpretations were resolved through joint re-evaluation by a third senior thoracic radiologist (> 15 years’ specialization), whose adjudication determined the outcome. The primary outcomes were OS and PFS. OS was defined as the time from the first RFA treatment to death by any cause. PFS was defined as the interval from RFA to local or distant disease progression or death by any cause. The secondary outcome, LTP, was radiologically defined as new tumor foci within or contiguous to the ablation zone, presuming prior CT-confirmed complete ablation (≥ 5 mm margin). The final follow-ups were concluded on December 31, 2024. Statistical analysis The patients were stratified into two groups according to the therapeutic modality received. Descriptive analyses were performed for the entire study cohort. Continuous data were expressed as mean and standard deviation or median and interquartile range (quartiles 1-3) where applicable. Categorical variables were presented as percentages. Comparisons were made using the χ 2 http://www.R-project.org P RESULTS Patient groups Between January 2016 and December 2023, 1523 patients with lung metastases from CRC underwent RFA at the two institutions. After rigorous screening, 247 patients were included in the study and divided into combined ( n n 1 1 KRAS KRAS Figure 1  Flowchart of patient inclusion and exclusion. Table 1 Clinical characteristics of patients enrolled, n  Variables  Total ( n  Only RFA ( n  Combined ( n   P Sex 0.509 Female 96 (38.9) 36 (36.4) 60 (40.5) Male 151 (61.1) 63 (63.6) 88 (59.5) Age, median (IQR) (years) 58.0 (48.0, 66.0) 58.0 (53.0, 66.5) 58.5 (48.0, 66.0) 0.633  KRAS 0.846 Wild-type 154 (62.3) 61 (61.6) 93 (62.8) Mutated 93 (37.7) 38 (38.4) 55 (37.2) CA19-9 0.029 < 27 U/mL 216 (87.4) 81 (81.8) 135 (91.2) ≥ 27 U/mL 31 (12.6) 18 (18.2) 13 (8.8) CEA 0.267 < 5 ng/mL 188 (76.1) 79 (79.8) 109 (73.6) ≥ 5 ng/mL 59 (23.9) 20 (20.2) 39 (26.4) Location 0.658 Left 129 (52.2) 50 (50.5) 79 (53.4) Right 118 (47.8) 49 (49.5) 69 (46.6) Number of lesions 0.006 1 171 (69.2) 78 (78.8) 93 (62.8) 2 67 (27.1) 21 (21.2) 46 (31.1) 3 9 (3.6) 0 (0) 9 (6.1) Lesion diameter, median (IQR) 1.0 (0.8, 1.5) 1.0 (0.8, 1.5) 1.0 (0.8, 1.4) 0.521 Distance between the lesion and the mediastinum or great vessels 0.392 ≤ 1 cm 124 (50.2) 53 (53.5) 71 (48) > 1 cm 123 (49.8) 46 (46.5) 77 (52) Distance between the lesion and the pleural surface 0.495 ≤ 1 cm 81 (32.8) 30 (30.3) 51 (34.5) > 1 cm 166 (67.2) 69 (69.7) 97 (65.5) Primary lesion pathology 0.807 Rectum 159 (64.4) 66 (66.7) 93 (62.8) Left half colon 52 (21.2) 19 (19.2) 33 (22.3) Right half colon 36 (14.6) 14 (14.1) 22 (14.9) Primary tumor (T) staging 0.8 1 4 (1.6) 2 (2) 2 (1.4) 2 25 (10.1) 10 (10.1) 15 (10.1) 3 128 (51.8) 48 (48.5) 80 (54.1) 4 90 (36.4) 39 (39.4) 51 (34.5) Neural invasion 0.308 None 168 (68.0) 71 (71.7) 97 (65.5) Exist 79 (32.0) 28 (28.3) 51 (34.5) Lymphovascular invasion 0.974 None 150 (60.7) 60 (60.6) 90 (60.8) Exist 97 (39.3) 39 (39.4) 58 (39.2) Synchronous or metachronous 0.217 Metachronous 139 (56.3) 51 (51.5) 88 (59.5) Synchronous 108 (43.7) 48 (48.5) 60 (40.5) Pneumothorax 0.694 None 194 (78.5) 79 (79.8) 115 (77.7) Grade 1 42 (17.0) 18 (18.2) 24 (16.2) Grade 2 11 (4.5) 5 (5.1) 6 (4.1) Grade 3 3 (1.2) 1 (1.0) 2 (1.4) Alveolar hemorrhage 0.643 None 203 (82.2) 80 (80.8) 123 (83.1) Grade 1 39 (15.8) 17 (17.2) 22 (14.9) Grade 2 5 (2.0) 2 (2.0) 3 (2.0) IQR: Interquartile range; CEA: Carcinoembryonic antigen; CA19-9: Carbohydrate antigen 19-9; RFA: Radiofrequency ablation; Combined: Radiofrequency ablation plus capecitabine; Only RFA: Radiofrequency ablation alone. Survival and local tumor response Mortality was significantly lower in the combination therapy group (RFA plus capecitabine) than in the RFA monotherapy group at the end of the follow-up period [5.4% (8/148) vs 2 Figure 2  Kaplan-Meier curves. Although the cumulative 1-, 3-, and 5-year OS rates were similar between the groups (combined: 99.2%, 95.9%, and 88.7% vs P vs P vs vs vs P 2 3 Figure 3  Kaplan-Meier curves of colorectal cancer patients with lung metastases stratified by different treatment modalities, showing cumulative 1-year, 3-year, and 5-year rates. Table 2 Survival and local control outcomes in colorectal cancer patients with lung metastases stratified by treatment modalities   All patients ( n  Only RFA ( n  Combined ( n OS (%) 1-year 99.1 97.9 99.2 3-year 95.4 94.7 95.9 5-year 80.0 69.1 88.7 PFS (%) 1-year 81.8 79.8 83.1 3-year 43.4 38.4 46.8 5-year 26.2 23.7 27.8 LTP (%) 1-year 3.2 5.1 2.0 3-year 18.2 28.8 10.9 5-year 33.8 49.0 22.7 OS: Overall survival; PFS: Progression-free survival; LTP: Local tumor progression; RFA: Radiofrequency ablation; Combined: Radiofrequency ablation plus capecitabine; Only RFA: Radiofrequency ablation alone. Univariate analysis Univariate analysis of OS in the CRC patients with lung oligometastases revealed that tumor diameter ≥ 1 cm [hazard ratio (HR) = 3.2, 95% confidence interval (CI): 1.57-6.55; P P P per P P KRAS 3 Table 3 Univariate analysis of factors associated with overall survival in colorectal cancer patients with lung metastases  Variables  HR (95%CI)   P Sex Female 1 (Reference) Male 0.74 (0.34-1.64) 0.464 Age 0.96 (0.93-1) 0.065  KRAS Wild-type 1 (Reference) Mutated 1.43 (0.64-3.18) 0.388 CA19-9 < 27 U/mL 1 (Reference) ≥ 27 U/mL 1.23 (0.42-3.61) 0.703 CEA < 5 ng/mL 1 (Reference) ≥ 5 ng/mL 1.82 (0.8-4.15) 0.155 Location Left 1 (Reference) Right 0.91 (0.41-2.01) 0.821 Diameter 3.2 (1.57-6.55) 0.001 Distance between the lesion and the mediastinum or great vessels ≤ 1 cm 1 (Reference) > 1 cm 0.77 (0.34-1.74) 0.529 Distance between the lesion and the pleural surface ≤ 1 cm 1 (Reference) > 1 cm 0.38 (0.17-0.86) 0.02 Primary lesion pathology Rectum 1 (Reference) Left half colon 2.38 (0.93-6.09) 0.07 Right half colon 2.2 (0.83-5.87) 0.115 Neural invasion None 1 (Reference) Exist 1.27 (0.57-2.83) 0.562 Lymphovascular invasion None 1 (Reference) Exist 0.84 (0.35-2.02) 0.699 Synchronous or metachronous Metachronous 1 (Reference) Synchronous 0.68 (0.31-1.52) 0.348 Pneumothorax None 1 (Reference) Exist 0.19 (0.03-1.42) 0.105 Alveolar hemorrhage None 1 (Reference) Exist 7.5 (3.34-16.84) < 0.001 CEA: Carcinoembryonic antigen; CA19-9: Carbohydrate antigen 19-9; HR: Hazard ratio; CI: Confidence interval. Multivariable Cox proportional hazards analysis Multivariate Cox proportional hazards analysis revealed that combination therapy was associated with a significantly reduced mortality risk across all adjusted models. The covariates were chosen based on established prognostic factors in mCRC as per 5 8 19 20 P P KRAS P 4 Table 4 Multivariate Cox proportional hazards analysis of the association between whether chemotherapy was combined after radiofrequency ablation and overall survival in colorectal cancer patients with lung metastases  Group   n   n  Crude  Model 1  Model 2  Model 3  Model 4 Only RFA 99 17 (17.2) 1 (Reference) Combined 148 8 (5.4) 0.35 (0.15-0.81) 0.33 (0.14-0.77) 0.31 (0.13-0.73) 0.29 (0.11-0.77) 0.31 (0.12-0.79)  P 0.011 0.014 0.008 0.012 0.014 RFA: Radiofrequency ablation; Combined: Radiofrequency ablation plus capecitabine; Only RFA: Radiofrequency ablation alone; Model 1: Adjusted for sex, age; Model 2: Adjusted for model 1 + KRAS DISCUSSION As noted in current guidelines[ 5 6 Notably, the reported 5-year OS rate after CRC lung metastasectomy is 68.0%-81.2%[ 21 22 vs P 23 24 25 26 27 vs P 10 5 Although this study focused on pulmonary oligometastases, historical data for colorectal liver metastases show that 5-year OS rates following neoadjuvant chemotherapy combined with resection range from 51.2% to 81%[ 28 31 vs 32 34 31 35 Adjuvant systemic therapy has improved disease-free and OS in patients with mCRC[ 36 37 16 38 42 43 44 45 43 46 The necessity of administering adjuvant systemic therapy for mCRC-NED patients is not supported by direct evidence. To the best of our knowledge, this is the first study focusing on the necessity of adjuvant chemotherapy after RFA for lung oligometastases from CRC. Auber et al 43 47 et al 48 48 P 49 50 The cumulative 1-, 3-, and 5-year LTP rates were 2.0, 10.9, and 22.7% in the combined group and 5.1%, 28.8%, and 49.0% in the RFA group, respectively. The differences in LTP rates may be due to patient selection for RFA. Low-risk patients with less history of colorectal liver metastases are often selected for RFA. Patients with fewer lesions and maximum tumor diameter < 3 cm are treated with RFA. Hence, their PFS rates were not significantly different between the two groups. These findings suggest that RFA followed by capecitabine maintenance represents a tailored strategy for lung oligometastatic CRC. It balances the need for aggressive local control with the tolerability of long-term systemic therapy, addressing the variability in treatment response highlighted in clinical practice. Additionally, future randomized trials should standardize RFA protocols and validate this approach in broader populations. While our findings suggest potential benefits of adjuvant capecitabine following RFA, several limitations inherent to the study design warrant careful consideration. First, the retrospective, non-randomized nature introduces the possibility of selection bias, as treatment allocation (only RFA vs KRAS CONCLUSION RFA confers prolonged survival and local control in patients with CRC pulmonary oligometastases. Adjuvant capecitabine increased OS and reduced LTP compared to RFA alone, but PFS was not significantly different. These findings warrant validation in prospective randomized controlled trials comparing RFA with vs KRAS  Institutional review board statement:  Informed consent statement:  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Jemal A Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 229 263 38572751 10.3322/caac.21834 2 Eng C Yoshino T Ruíz-García E Mostafa N Cann CG O'Brian B Benny A Perez RO Cremolini C Colorectal cancer Lancet 2024 404 294 310 38909621 10.1016/S0140-6736(24)00360-X 3 Wang Z Wang X Yuan J Zhang X Zhou J Lu M Liu D Li J Shen L Survival Benefit of Palliative Local Treatments and Efficacy of Different Pharmacotherapies in Colorectal Cancer With Lung Metastasis: Results From a Large Retrospective Study Clin Colorectal Cancer 2018 17 e233 e255 29305209 10.1016/j.clcc.2017.12.005 4 Shen C Tannenbaum D Horn R Rogers J Eng C Zhou S Johnson B Kopetz S Morris V Overman M Parseghian C Chang GJ Lopez-Olivo MA Kanwal R Ellis LM Dasari A Overall Survival in Phase 3 Clinical Trials and the Surveillance, Epidemiology, and End Results Database in Patients With Metastatic Colorectal Cancer, 1986-2016: A Systematic Review JAMA Netw Open 2022 5 e2213588 35608860 10.1001/jamanetworkopen.2022.13588 PMC9131746 5 Cervantes A Adam R Roselló S Arnold D Normanno N Taïeb J Seligmann J De Baere T Osterlund P Yoshino T Martinelli E ESMO Guidelines Committee Electronic address: clinicalguidelines@esmo.org. Metastatic colorectal cancer: ESMO Clinical Practice Guideline for diagnosis, treatment and follow-up Ann Oncol 2023 34 10 32 36307056 10.1016/j.annonc.2022.10.003 6 Van Cutsem E Cervantes A Adam R Sobrero A Van Krieken JH Aderka D Aranda Aguilar E Bardelli A Benson A Bodoky G Ciardiello F D'Hoore A Diaz-Rubio E Douillard JY Ducreux M Falcone A Grothey A Gruenberger T Haustermans K Heinemann V Hoff P Köhne CH Labianca R Laurent-Puig P Ma B Maughan T Muro K Normanno N Österlund P Oyen WJ Papamichael D Pentheroudakis G Pfeiffer P Price TJ Punt C Ricke J Roth A Salazar R Scheithauer W Schmoll HJ Tabernero J Taïeb J Tejpar S Wasan H Yoshino T Zaanan A Arnold D ESMO consensus guidelines for the management of patients with metastatic colorectal cancer Ann Oncol 2016 27 1386 1422 27380959 10.1093/annonc/mdw235 7 Gutiontov SI Pitroda SP Weichselbaum RR Oligometastasis: Past, Present, Future Int J Radiat Oncol Biol Phys 2020 108 530 538 32976785 10.1016/j.ijrobp.2020.02.019 8 Huang H Chen H Zheng D Chen C Wang Y Xu L Wang Y He X Yang Y Li W Habitat-based radiomics analysis for evaluating immediate response in colorectal cancer lung metastases treated by radiofrequency ablation Cancer Imaging 2024 24 44 38532520 10.1186/s40644-024-00692-w PMC10964536 9 de Baere T Bonnet B Tselikas L Deschamps F The percutaneous management of pulmonary metastases J Med Imaging Radiat Oncol 2023 67 870 875 37742316 10.1111/1754-9485.13588 10 de Baère T Aupérin A Deschamps F Chevallier P Gaubert Y Boige V Fonck M Escudier B Palussiére J Radiofrequency ablation is a valid treatment option for lung metastases: experience in 566 patients with 1037 metastases Ann Oncol 2015 26 987 991 25688058 10.1093/annonc/mdv037 PMC4405279 11 Shen C Hu H Cai Y Ling J Zhang J Wu Z Xie X Huang M Wang H Kang L Lan P Wu X Liu G Wan Y Zhou Z Huang Y Li F Wang H Ma T Luo S Cai Y Shi L Deng Y mFOLFOXIRI with or without bevacizumab for conversion therapy of RAS/BRAF/PIK3CA mutant unresectable colorectal liver metastases: the FORBES non-randomized phase II trial Ann Transl Med 2022 10 171 35280386 10.21037/atm-21-6731 PMC8908129 12 Ye S Bai L Qi Y Jin Y Yang Y Song F Gong P Zhang T Retrospective analysis of colorectal cancer patients with metachronous initially unresectable liver metastases (and no other) achieving no evidence of disease after first-line comprehensive therapy: a multicenter real-world study J Cancer Res Clin Oncol 2023 149 8403 8413 37084112 10.1007/s00432-023-04768-1 PMC11797351 13 Sherman SK Lange JJ Dahdaleh FS Rajeev R Gamblin TC Polite BN Turaga KK Cost-effectiveness of Maintenance Capecitabine and Bevacizumab for Metastatic Colorectal Cancer JAMA Oncol 2019 5 236 242 30489611 10.1001/jamaoncol.2018.5070 PMC6440196 14 Sonbol MB Mountjoy LJ Firwana B Liu AJ Almader-Douglas D Mody K Hubbard J Borad M Ahn DH Murad MH Bekaii-Saab T The Role of Maintenance Strategies in Metastatic Colorectal Cancer: A Systematic Review and Network Meta-analysis of Randomized Clinical Trials JAMA Oncol 2020 6 e194489 31855256 10.1001/jamaoncol.2019.4489 PMC6990730 15 Derksen JWG Smit KC May AM Punt CJA Systematic review and non-inferiority meta-analysis of randomised phase II/III trials on S-1-based therapy versus 5-fluorouracil- or capecitabine-based therapy in the treatment of patients with metastatic colorectal cancer Eur J Cancer 2022 166 73 86 35279472 10.1016/j.ejca.2022.02.004 16 Pan QZ Zhao JJ Liu L Zhang DS Wang LP Hu WW Weng DS Xu X Li YZ Tang Y Zhang WH Li JY Zheng X Wang QJ Li YQ Xiang T Zhou L Yang SN Wu C Huang RX He J Du WJ Chen LJ Wu YN Xu B Shen Q Zhang Y Jiang JT Ren XB Xia JC XELOX (capecitabine plus oxaliplatin) plus bevacizumab (anti-VEGF-A antibody) with or without adoptive cell immunotherapy in the treatment of patients with previously untreated metastatic colorectal cancer: a multicenter, open-label, randomized, controlled, phase 3 trial Signal Transduct Target Ther 2024 9 79 38565886 10.1038/s41392-024-01788-2 PMC10987514 17 Nozawa H Sunami E Nakajima J Nagawa H Kitayama J Synchronous and metachronous lung metastases in patients with colorectal cancer: A 20-year monocentric experience Exp Ther Med 2012 3 449 456 22969910 10.3892/etm.2011.443 PMC3438797 18 Freites-Martinez A Santana N Arias-Santiago S Viera A Using the Common Terminology Criteria for Adverse Events (CTCAE - Version 5.0) to Evaluate the Severity of Adverse Events of Anticancer Therapies Actas Dermosifiliogr (Engl Ed) 2021 112 90 92 32891586 10.1016/j.ad.2019.05.009 19 De Baere T Tselikas L Delpla A Roux C Varin E Kobe A Yevich S Deschamps F Thermal ablation in the management of oligometastatic colorectal cancer Int J Hyperthermia 2022 39 627 632 35477367 10.1080/02656736.2021.1941311 20 Matsui Y Tomita K Uka M Umakoshi N Kawabata T Munetomo K Nagata S Iguchi T Hiraki T Up-to-date evidence on image-guided thermal ablation for metastatic lung tumors: a review Jpn J Radiol 2022 40 1024 1034 35778630 10.1007/s11604-022-01302-0 PMC9529706 21 Watanabe K Nagai K Kobayashi A Sugito M Saito N Factors influencing survival after complete resection of pulmonary metastases from colorectal cancer Br J Surg 2009 96 1058 1065 19672932 10.1002/bjs.6682 22 Denz A Hahn V Weber K Weber GF Grützmann R Krautz C Brunner M Survival outcome following surgical versus non-surgical treatment of colorectal lung metastasis-a retrospective cohort study Langenbecks Arch Surg 2024 409 121 38605271 10.1007/s00423-024-03311-1 PMC11009744 23 Onaitis MW Petersen RP Haney JC Saltz L Park B Flores R Rizk N Bains MS Dycoco J D'Amico TA Harpole DH Kemeny N Rusch VW Downey R Prognostic factors for recurrence after pulmonary resection of colorectal cancer metastases Ann Thorac Surg 2009 87 1684 1688 19463577 10.1016/j.athoracsur.2009.03.034 24 Cho S Song IH Yang HC Jheon S Prognostic factors of pulmonary metastasis from colorectal carcinoma Interact Cardiovasc Thorac Surg 2013 17 303 307 23613338 10.1093/icvts/ivt164 PMC3715174 25 Zhong J Palkhi E Ng H Wang K Milton R Chaudhuri N Lenton J Smith J Bhartia B Wah TM Long-Term Outcomes in Percutaneous Radiofrequency Ablation for Histologically Proven Colorectal Lung Metastasis Cardiovasc Intervent Radiol 2020 43 1900 1907 32812121 10.1007/s00270-020-02623-1 PMC7649179 26 Hasegawa T Takaki H Kodama H Yamanaka T Nakatsuka A Sato Y Takao M Katayama Y Fukai I Kato T Tokui T Tempaku H Adachi K Matsushima Y Inaba Y Yamakado K Three-year Survival Rate after Radiofrequency Ablation for Surgically Resectable Colorectal Lung Metastases: A Prospective Multicenter Study Radiology 2020 294 686 695 31934829 10.1148/radiol.2020191272 27 Chu KF Dupuy DE Thermal ablation of tumours: biological mechanisms and advances in therapy Nat Rev Cancer 2014 14 199 208 24561446 10.1038/nrc3672 28 Nordlinger B Sorbye H Glimelius B Poston GJ Schlag PM Rougier P Bechstein WO Primrose JN Walpole ET Finch-Jones M Jaeck D Mirza D Parks RW Mauer M Tanis E Van Cutsem E Scheithauer W Gruenberger T EORTC Gastro-Intestinal Tract Cancer Group Cancer Research UK Arbeitsgruppe Lebermetastasen und–tumoren in der Chirurgischen Arbeitsgemeinschaft Onkologie (ALM-CAO) Australasian Gastro-Intestinal Trials Group (AGITG) Fédération Francophone de Cancérologie Digestive (FFCD) Perioperative FOLFOX4 chemotherapy and surgery versus surgery alone for resectable liver metastases from colorectal cancer (EORTC 40983): long-term results of a randomised, controlled, phase 3 trial Lancet Oncol 2013 14 1208 1215 24120480 10.1016/S1470-2045(13)70447-9 29 Chun YJ Kim SG Lee KW Cho SH Kim TW Baek JY Park YS Hong S Chu CW Beom SH Jung M Shin SJ Ahn JB A Randomized Phase II Study of Perioperative Chemotherapy Plus Bevacizumab Versus Postoperative Chemotherapy Plus Bevacizumab in Patients With Upfront Resectable Hepatic Colorectal Metastases Clin Colorectal Cancer 2020 19 e140 e150 32402681 10.1016/j.clcc.2020.03.004 30 Di Martino M Primavesi F Syn N Dorcaratto D de la Hoz Rodríguez Á Dupré A Piardi T Rhaiem R Blanco Fernández G Prada Villaverde A Rodríguez Sanjuán JC Fernández Santiago R Fernández-Moreno MC Ferret G López Ben S Suárez Muñoz MÁ Perez-Alonso AJ Koh YX Jones R Martín-Pérez E Perioperative chemotherapy versus surgery alone for resectable colorectal liver metastases: an international multicentre propensity score matched analysis on long-term outcomes according to established prognostic risk scores HPB (Oxford) 2021 23 1873 1885 34103246 10.1016/j.hpb.2021.04.026 31 Kanemitsu Y Shimizu Y Mizusawa J Inaba Y Hamaguchi T Shida D Ohue M Komori K Shiomi A Shiozawa M Watanabe J Suto T Kinugasa Y Takii Y Bando H Kobatake T Inomata M Shimada Y Katayama H Fukuda H JCOG Colorectal Cancer Study Group Hepatectomy Followed by mFOLFOX6 Versus Hepatectomy Alone for Liver-Only Metastatic Colorectal Cancer (JCOG0603): A Phase II or III Randomized Controlled Trial J Clin Oncol 2021 39 3789 3799 34520230 10.1200/JCO.21.01032 32 Rubbia-Brandt L Giostra E Brezault C Roth AD Andres A Audard V Sartoretti P Dousset B Majno PE Soubrane O Chaussade S Mentha G Terris B Importance of histological tumor response assessment in predicting the outcome in patients with colorectal liver metastases treated with neo-adjuvant chemotherapy followed by liver surgery Ann Oncol 2007 18 299 304 17060484 10.1093/annonc/mdl386 33 Gervaz P Rubbia-Brandt L Andres A Majno P Roth A Morel P Mentha G Neoadjuvant chemotherapy in patients with stage IV colorectal cancer: a comparison of histological response in liver metastases, primary tumors, and regional lymph nodes Ann Surg Oncol 2010 17 2714 2719 20405223 10.1245/s10434-010-1056-6 34 Guo M Jin N Pawlik T Cloyd JM Neoadjuvant chemotherapy for colorectal liver metastases: A contemporary review of the literature World J Gastrointest Oncol 2021 13 1043 1061 34616511 10.4251/wjgo.v13.i9.1043 PMC8465453 35 Bridgewater JA Pugh SA Maishman T Eminton Z Mellor J Whitehead A Stanton L Radford M Corkhill A Griffiths GO Falk S Valle JW O'Reilly D Siriwardena AK Hornbuckle J Rees M Iveson TJ Hickish T Garden OJ Cunningham D Maughan TS Primrose JN New EPOC investigators Systemic chemotherapy with or without cetuximab in patients with resectable colorectal liver metastasis (New EPOC): long-term results of a multicentre, randomised, controlled, phase 3 trial Lancet Oncol 2020 21 398 411 32014119 10.1016/S1470-2045(19)30798-3 PMC7052737 36 Shah MA Renfro LA Allegra CJ André T de Gramont A Schmoll HJ Haller DG Alberts SR Yothers G Sargent DJ Impact of Patient Factors on Recurrence Risk and Time Dependency of Oxaliplatin Benefit in Patients With Colon Cancer: Analysis From Modern-Era Adjuvant Studies in the Adjuvant Colon Cancer End Points (ACCENT) Database J Clin Oncol 2016 34 843 853 26811529 10.1200/JCO.2015.63.0558 PMC4872008 37 Sargent D Sobrero A Grothey A O'Connell MJ Buyse M Andre T Zheng Y Green E Labianca R O'Callaghan C Seitz JF Francini G Haller D Yothers G Goldberg R de Gramont A Evidence for cure by adjuvant therapy in colon cancer: observations based on individual patient data from 20,898 patients on 18 randomized trials J Clin Oncol 2009 27 872 877 19124803 10.1200/JCO.2008.19.5362 PMC2738431 38 Tournigand C Cervantes A Figer A Lledo G Flesch M Buyse M Mineur L Carola E Etienne PL Rivera F Chirivella I Perez-Staub N Louvet C André T Tabah-Fisch I de Gramont A OPTIMOX1: a randomized study of FOLFOX4 or FOLFOX7 with oxaliplatin in a stop-and-Go fashion in advanced colorectal cancer--a GERCOR study J Clin Oncol 2006 24 394 400 16421419 10.1200/JCO.2005.03.0106 39 Chibaudel B Maindrault-Goebel F Lledo G Mineur L André T Bennamoun M Mabro M Artru P Carola E Flesch M Dupuis O Colin P Larsen AK Afchain P Tournigand C Louvet C de Gramont A Can chemotherapy be discontinued in unresectable metastatic colorectal cancer? The GERCOR OPTIMOX2 Study J Clin Oncol 2009 27 5727 5733 19786657 10.1200/JCO.2009.23.4344 40 Hochster HS Grothey A Hart L Rowland K Ansari R Alberts S Chowhan N Ramanathan RK Keaton M Hainsworth JD Childs BH Improved time to treatment failure with an intermittent oxaliplatin strategy: results of CONcePT Ann Oncol 2014 25 1172 1178 24608198 10.1093/annonc/mdu107 PMC4207881 41 Hegewisch-Becker S Graeven U Lerchenmüller CA Killing B Depenbusch R Steffens CC Al-Batran SE Lange T Dietrich G Stoehlmacher J Tannapfel A Reinacher-Schick A Quidde J Trarbach T Hinke A Schmoll HJ Arnold D Maintenance strategies after first-line oxaliplatin plus fluoropyrimidine plus bevacizumab for patients with metastatic colorectal cancer (AIO 0207): a randomised, non-inferiority, open-label, phase 3 trial Lancet Oncol 2015 16 1355 1369 26361971 10.1016/S1470-2045(15)00042-X 42 Koeberle D Betticher DC von Moos R Dietrich D Brauchli P Baertschi D Matter K Winterhalder R Borner M Anchisi S Moosmann P Kollar A Saletti P Roth A Frueh M Kueng M Popescu RA Schacher S Hess V Herrmann R Bevacizumab continuation versus no continuation after first-line chemotherapy plus bevacizumab in patients with metastatic colorectal cancer: a randomized phase III non-inferiority trial (SAKK 41/06) Ann Oncol 2015 26 709 714 25605741 10.1093/annonc/mdv011 43 Auber ML Wen S Hobbs G Higa GM Capecitabine as Maintenance Therapy for High-Risk, Resected Colorectal Cancer Gastrointest Tumors 2021 8 81 86 33981686 10.1159/000513960 PMC8077449 44 Luo HY Li YH Wang W Wang ZQ Yuan X Ma D Wang FH Zhang DS Lin DR Lin YC Jia J Hu XH Peng JW Xu RH Single-agent capecitabine as maintenance therapy after induction of XELOX (or FOLFOX) in first-line treatment of metastatic colorectal cancer: randomized clinical trial of efficacy and safety Ann Oncol 2016 27 1074 1081 26940686 10.1093/annonc/mdw101 45 Li YH Luo HY Wang FH Wang ZQ Qiu MZ Shi YX Xiang XJ Chen XQ He YJ Xu RH Phase II study of capecitabine plus oxaliplatin (XELOX) as first-line treatment and followed by maintenance of capecitabine in patients with metastatic colorectal cancer J Cancer Res Clin Oncol 2010 136 503 510 19777259 10.1007/s00432-009-0682-5 PMC11828111 46 Ling J Lin Z Shi L Lin Y Liu X Lin J Li J Zhang J Hu H Cai Y Deng Y Capecitabine maintenance therapy in metastatic colorectal cancer patients with no evidence of disease: CAMCO trial Future Oncol 2023 19 2045 2054 37814832 10.2217/fon-2023-0149 47 Al-hajeili M Serzan M Prins P Marshall J P-056 Outcome of maintenance therapy in patients who achieved NED after liver resection for mCRC Ann Oncol 2016 27 ii17 48 Palma DA Olson R Harrow S Gaede S Louie AV Haasbeek C Mulroy L Lock M Rodrigues GB Yaremko BP Schellenberg D Ahmad B Senthi S Swaminath A Kopek N Liu M Moore K Currie S Schlijper R Bauman GS Laba J Qu XM Warner A Senan S Stereotactic Ablative Radiotherapy for the Comprehensive Treatment of Oligometastatic Cancers: Long-Term Results of the SABR-COMET Phase II Randomized Trial J Clin Oncol 2020 38 2830 2838 32484754 10.1200/JCO.20.00818 PMC7460150 49 Gollins S West N Sebag-Montefiore D Susnerwala S Falk S Brown N Saunders M Quirke P Ray R Parsons P Griffiths G Maughan T Adams R Hurt C A prospective phase II study of pre-operative chemotherapy then short-course radiotherapy for high risk rectal cancer: COPERNICUS Br J Cancer 2018 119 697 706 30116024 10.1038/s41416-018-0209-4 PMC6173784 50 Wang Z Ouyang H Luo H Gao F Mie M Ren C Li J Fu H Huang JS A phase II clinical evaluation of radiofrequency ablation (RFA) combined with regorafenib and toripalimab in patients with colorectal cancer with liver metastases J Clin Oncol 2024 42 3566 3566 Data sharing statement The datasets generated and analyzed during this study are not publicly available due to institutional ethical regulations and patient confidentiality protections. However, de-identified data supporting the findings of this study are available from the corresponding author (Chen C, chaochen_cc@fudan.edu.cn ",
  "metadata": {
    "Title of this paper": "A phase II clinical evaluation of radiofrequency ablation (RFA) combined with regorafenib and toripalimab in patients with colorectal cancer with liver metastases",
    "Journal it was published in:": "World Journal of Gastroenterology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476658/"
  }
}