{
  "title": "Paper_807",
  "abstract": "Health Serv Res Health Serv Res 235 hsresearch HESR Health Services Research 0017-9124 1475-6773 Health Research & Educational Trust PMC11366964 PMC11366964.1 11366964 11366964 38958003 10.1111/1475-6773.14348 HESR14348 1 Research Article Medicaid Effects of Medicaid managed care on early detection of cancer: Evidence from mandatory Medicaid managed care program in Pennsylvania Kwon et al. Kwon Youngmin PhD https://orcid.org/0000-0001-8037-5758  1 yok84@pitt.edu Roberts Eric T. PhD https://orcid.org/0000-0002-7439-0799  2 Cole Evan S. PhD  1 Degenholtz Howard B. PhD  1 Jacobs Bruce L. MD, MPH https://orcid.org/0000-0003-1358-0764  3 Sabik Lindsay M. PhD https://orcid.org/0000-0002-0613-4929  1   1 Department of Health Policy & Management University of Pittsburgh School of Public Health Pittsburgh Pennsylvania USA   2 Department of General Internal Medicine Perelman School of Medicine at University of Pennsylvania Philadelphia Pennsylvania USA   3 Department of Urology, Division of Health Services Research University of Pittsburgh School of Medicine Pittsburgh Pennsylvania USA * Correspondence yok84@pitt.edu 03 7 2024 10 2024 59 5 469807 10.1111/hesr.v59.5 e14348 01 10 2025 01 10 2025 03 09 2024 01 10 2025 © 2024 Health Research and Educational Trust. Abstract Objective To examine changes in late‐ versus early‐stage diagnosis of cancer associated with the introduction of mandatory Medicaid managed care (MMC) in Pennsylvania. Data Sources and Study Setting We analyzed data from the Pennsylvania cancer registry (2010–2018) for adult Medicaid beneficiaries aged 21–64 newly diagnosed with a solid tumor. To ascertain Medicaid and managed care status around diagnosis, we linked the cancer registry to statewide hospital‐based facility records collected by an independent state agency (Pennsylvania Health Care Cost Containment Council). Study Design We leveraged a natural experiment arising from county‐level variation in mandatory MMC in Pennsylvania. Using a stacked difference‐in‐differences design, we compared changes in the probability of late‐stage cancer diagnosis among those residing in counties that newly transitioned to mandatory managed care to contemporaneous changes among those in counties with mature MMC programs. Data Collection/Extraction Methods N/A. Principal Findings Mandatory MMC was associated with a reduced probability of late‐stage cancer diagnosis (−3.9 percentage points; 95% CI: −7.2, −0.5; p p Conclusions In Pennsylvania, the implementation of mandatory MMC for adult Medicaid beneficiaries was associated with earlier stage of diagnosis among newly diagnosed cancer patients with Medicaid, especially those diagnosed with screening‐amenable cancers. Considering that over half of the sample was diagnosed with late‐stage cancer even after the transition to mandatory MMC, Medicaid programs and managed care organizations should continue to carefully monitor receipt of cancer screening and design strategies to reduce barriers to guideline‐concordant screening or diagnostic procedures. cancer early detection cancer staging health services accessibility healthcare disparities managed care medicaid national program of cancer registries Agency for Healthcare Research and Quality 10.13039/100000133 R36HS029262‐01A1 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2024 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.4.8 mode:remove_FC converted:02.09.2024  Kwon Y Roberts ET Cole ES Degenholtz HB Jacobs BL Sabik LM Effects of Medicaid managed care on early detection of cancer: Evidence from mandatory Medicaid managed care program in Pennsylvania Health Serv Res 2024 59 5 e14348 10.1111/1475-6773.14348 PMC11366964 38958003 ",
  "metadata": {
    "Title of this paper": "Effects of Medicaid managed care on early detection of cancer: Evidence from mandatory Medicaid managed care program in Pennsylvania",
    "Journal it was published in:": "Health Services Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11366964/"
  }
}