{
  "title": "Paper_1225",
  "abstract": "pmc Mar Drugs Mar Drugs 590 mardrugs marinedrugs Marine Drugs 1660-3397 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472170 PMC12472170.1 12472170 12472170 41003325 10.3390/md23090356 marinedrugs-23-00356 1 Article Improvement Effect and Regulation Mechanism of Oyster Peptide on Dexamethasone-Induced Osteoporotic Rats Yang Wei Conceptualization Methodology Investigation Writing – original draft 1 2 3 Ma Wenyu Investigation Writing – original draft 1 2 3 https://orcid.org/0000-0001-8415-8902 Qin Xiaoming Conceptualization Resources Supervision Funding acquisition 1 2 3 4 5 * Cao Wenhong Writing – review & editing 1 2 3 4 https://orcid.org/0000-0002-9823-2584 Lin Haisheng Methodology 1 2 3 4 Ovchinnikova Tatiana V. Academic Editor 1 wildperson2004@163.com wenyudeyouxiang1@163.com cchunlin@163.com haishenglin@163.com 2 3 4 5 * qinxm@gdou.edu.cn 11 9 2025 9 2025 23 9 497656 356 12 8 2025 08 9 2025 09 9 2025 11 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The increasing global population of the elderly and rising life expectancy have made osteoporosis a more severe public health issue, necessitating the development of safer and more effective therapeutic strategies. This study investigated the osteoprotective effects of low, medium, and high doses of oyster peptide (OP) in dexamethasone (DEX)-induced osteoporotic rats. Pathological analysis showed that OP treatment effectively mitigated bone loss and repaired bone microarchitecture deterioration caused by DEX administration. In the OP groups, levels of the osteogenic markers osteocalcin (OCN) and osteoprotegerin (OPG) were significantly higher than in the DEX group. Moreover, levels of the osteoclastic markers RANKL, Cathepsin K (Cath-K), MMP-9, C-terminal telopeptide of type I collagen (CTX-1), and Deoxypyridine (DPD) were significantly lower. Bone proteomic analysis of the DEX and OP groups revealed that differentially expressed proteins were significantly enriched in pathways related to extracellular matrix and structural reorganization, ECM–receptor interaction, and PI3K-Akt signaling. Furthermore, virtual screening simulations indicated that peptides with lengths ranging from 11 to 20 amino acid residues were involved in modulating the activity of key receptors in these pathways, including Integrins α5β1, Integrins αvβ3, and EGFR. Collectively, these results demonstrate the significant potential of OP as a novel therapeutic agent for osteoporosis. osteoporosis dexamethasone oyster peptides bone homeostasis osteogenesis bone absorption Talent Team Introduction Program of Zhanjiang Bay Laboratory (2025) Modern Agricultural Industry Technology Research System of China CARS-49 National Key Research and Development Program 2024YFD2401905 2024YFD2401903 This research was supported by the Talent Team Introduction Program of Zhanjiang Bay Laboratory (2025) under the project “Development of ‘Guangfu No.1’ Oyster Line and Key Technologies for Enhancing the Zhanjiang Oyster Industrial Chain”. We also acknowledge funding from the Modern Agricultural Industry Technology Research System of China (CARS-49) and the National Key Research and Development Program (2024YFD2401905 and 2024YFD2401903). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The global prevalence of osteoporosis is currently 18.3% (23.1% in females and 11.7% in males), making it one of the most significant public health challenges globally [ 1 2 1 3 4 Bone homeostasis critically relies on the dynamic balance between osteoclastic bone resorption and osteoblastic bone formation. Disruption of this delicate equilibrium leads to microarchitectural deterioration and increased bone fragility, significantly elevating the risk of fracture [ 5 6 4 7 8 9 The unique marine environment and its rich biodiversity serve as an excellent reservoir of novel bioactive substances, with evidence suggesting that high seafood intake correlates with a reduced risk of osteoporosis [ 10 11 Ostrea rivularis 12 13 14 15 Numerous studies have explored the potential anti-osteoporotic components of oysters. For instance, in a mouse model of protein malnutrition, taurine from oyster peptide (OP) has been shown to promote bone growth by upregulating IGF-1 expression and inducing the phosphorylation of JAK2-STAT5 [ 16 10 The main component of oyster meat is protein, and its bioactive hydrolysates have also been shown to possess therapeutic potential against osteoporosis [ 12 2. Results 2.1. Composition Analysis of OP Studies have demonstrated that low-molecular-weight bioactive peptides often possess potent anti-osteoporotic activity [ 7 Figure 1 Figure 1 17 2.2. Effects of OP on Body Weight and Organs To comprehensively evaluate the systemic effects of the treatments, we monitored the body weight of the rats weekly and calculated their organ indices ( Figure 2 Table S1 Figure 2 Figure 2 Histopathological examination of liver tissue via H&E staining ( Figure 2 Gushukang granules 2.3. Protective Effect of OP Against Bone Loss The osteoprotective effect of OP was investigated using a DEX-induced osteoporosis model in rats. After 9 weeks of DEX treatment, micro-CT scanning and 3D reconstruction revealed a significant reduction in femoral bone volume and trabecular number in the DEX group compared to the control, indicating severe bone loss ( Figure 3 Figure 3 Histopathological analysis provided further evidence of OP’s protective effect on bone. The H&E staining results showed that the trabecular bone area in the DEX group was reduced compared to the control, a condition that was alleviated by OP treatment ( Figure 3 Figure 3 2.4. OP Ameliorates Bone Loss by Promoting Bone Formation The dynamic balance between osteoblast-mediated bone formation and osteoclast-mediated bone resorption is essential for bone homeostasis. When this balance is disrupted, it manifests as bone loss, which can lead to osteoporosis [ 18 Figure 4 2.5. OP Ameliorates Bone Loss by Inhibiting Bone Resorption RANK and RANKL are key regulators of osteoclast formation and bone resorption, and their overexpression is a major cause of osteoporosis [ 19 Figure 5 Figure 5 Figure 5 2.6. Screening of Potential Anti-Osteoporotic Active Peptides To further elucidate the protective effects of OP on DEX-induced osteoporosis, a Data-Independent Acquisition (DIA) proteomics analysis was performed, comparing the DEX group with the OPH group. This analysis identified 15 upregulated and 8 downregulated protein genes (fold change > 2, p Figure 6 Figure 6 Figure 6 20 21 To identify the specific anti-osteoporotic peptides, we performed peptidomics on the oyster hydrolysates and identified 142 peptides ( Figure 6 Table S3 Table 1 Figure 6 3. Discussion Oysters, traditionally regarded as a food–medicine homology, have a long history of use in remedies for bone health. Recent interest has grown in the osteoprotective benefits of their hydrolyzed polypeptides, although the underlying mechanisms have not been fully elucidated [ 12 22 23 24 While previous studies have shown that unhydrolyzed oyster matrix proteins can exhibit anti-osteoporotic activity in vivo [ 24 25 7 26 24 26 2 6 Our in vivo studies strongly support the anti-osteoporotic effects of OP. We found that OP administration significantly improved calcium deposition, thereby enhancing bone volume fraction, a critical indicator of skeletal health [ 27 28 29 30 31 32 33 34 35 Interestingly, we observed that low-dose OP exhibited a more pronounced inhibition of RANKL expression compared to medium and high doses. As a critical factor in osteoclast differentiation and maturation, RANKL activation of the RANK receptor initiates osteoclastogenesis; thus, decreased RANKL expression is expected to suppress osteoclast activity [ 36 37 35 Long-term DEX administration, consistent with previous findings, suppressed osteoblast activity and enhanced osteoclast activity, leading to decreased bone density and osteoporosis [ 38 39 40 10 40 41 42 20 43 44 43 42 44 45 46 47 48 49 50 51 52 This study has certain limitations. The exclusive use of animal models means that the findings may not directly translate to human clinical outcomes. Furthermore, a deeper exploration of the underlying mechanisms is warranted. The variability between OP production batches and the complex peptide profile of OP also contribute to uncertainty in its consistent effects. Future research should prioritize the identification of key bioactive peptides and conduct more detailed mechanistic investigations to fully harness OP’s potential for osteoporosis management. In conclusion, our study demonstrates that OP effectively mitigates DEX-induced osteoporosis by restoring the bone balance between osteoblasts and osteoclasts. The food-derived nature of these peptides, coupled with their low side effects and a scalable industrial production process, strongly supports their feasibility as a functional food for the prevention and adjuvant treatment of osteoporosis. Considering the diverse physiological activities often associated with hydrolyzed polypeptides, the strategy of exploring and expanding the functions of active peptides prepared through existing industrial processes holds significant practical relevance for the development of novel health products. 4. Materials and Methods 4.1. Materials Alcalase 2.4L (2.4 Au) and Neutrase 0.8L (0.8 Au) were procured from Novozymes Biotechnology Co., Ltd. (Bagsværd, Denmark), and papain (1000 kU/g) was bought from Nanning Pangbo Bioengineering Co., Ltd. (Guangxi, China). Depth cartridge filters (0.6–0.8 μm and 1.5–3.0 μm) were obtained from Hangzhou Cobetter Filtration Equipment Co., Ltd. (Zhejiang, China). Dexamethasone Sodium Phosphate Injection (DEX; 5 mg/mL, H41020255) was purchased from Suicheng Pharmaceutical Co., Ltd. (Henan, China). Alendronate sodium tablets (AS; 70 mg/tablet, H20090267) were obtained from CSPC Ouyi Co., Ltd. (Hebei, China), and OG (10 g/bag, Z20003255) was obtained from Liaoning Kangchen Pharmaceutical Co., Ltd. (Liaoning, China). 4.2. OP Preparation OP was prepared at the enzymatic hydrolysis workshop of Hainan Shenmeinuo Biotechnology Co., Ltd. Live oysters ( Ostrea rivularis w v 4.3. Protein Content, Amino Acid Composition, and Molecular Weight Distribution of OP The protein content of OP was determined using a fully automated Kjeldahl nitrogen analyzer (NKY-6120, YIHON, Shanghai, China). For amino acid analysis, OP samples were first hydrolyzed according to the method of Chen et al. [ 53 12 4.4. Animal Experiment Design Eight-week-old male Wistar rats were purchased from Youda Biotechnology Co. (Guangzhou, China) and acclimated for one week in a dry, ventilated, SPF-grade animal facility at Guangdong Ocean University. The housing conditions were maintained at a room temperature of 22 ± 2 °C and relative humidity of 55 ± 5%. The experimental design adhered to the ARRIVE guidelines and was approved by the Laboratory Animal Ethics Committee of Guangdong Ocean University (protocol code: GDOU-LAE-2023-035). The rats were randomly divided into seven experimental groups ( n Figure 7 Body weight was assessed weekly. After eight weeks, all rats were anesthetized with 1% sodium pentobarbital (0.4 mL/100 g, i.p.) and euthanized following a 12-h fast. Blood and various organs were collected. Organ weights (thymus, spleen, heart, lung, kidney, and liver) were measured and normalized to body weight to calculate organ indices. Blood was centrifuged at 3500 rpm for 10 min at 4 °C to separate serum, which was then stored at −80 °C for further analysis. 4.5. Histopathological Analysis For liver histology, rat liver tissue samples were embedded in paraffin and sectioned after fixation. The sections were then dewaxed, rehydrated in a graded series of ethanol solutions, and stained with hematoxylin–eosin (H&E). Finally, the stained sections were observed and imaged using an optical microscope (TI-DH, Nikon, Tokyo, Japan). Rat femurs were carefully dissected to remove muscle tissue and then decalcified in hydrochloric acid for 2 days to soften the bone matrix. The bones were subsequently fixed in 4% paraformaldehyde and embedded in paraffin using a machine (EG1150H, Leica, Wetzlar, Germany). Each femur was longitudinally sectioned into 5–6 µm thick slices using a microtome (RM2245, Leica, Wetzlar, Germany). For histological analysis, sections were dewaxed and stained with hematoxylin–eosin. To evaluate bone mineralization, adjacent sections were stained using the Von Kossa method. Samples from each group were immersed in 1% silver nitrate solution and incubated under ultraviolet light for 20 min, followed by a 5-min rinse in 5% sodium thiosulfate solution to remove unreacted silver. 4.6. Micro-Computed Tomography Analysis The femurs of all rats were scanned using a micro-computed tomography system (micro-CT, SKYSCAN1176, Bruker, Billerica, MA, USA) at a scanning resolution of 18 µm. The X-ray source was set to 50 kV/800 µA with a 0.2 mm aluminum filter. Data were collected, and three-dimensional image reconstruction was performed using NRecon software. The trabecular bone in the region of interest was converted into a three-dimensional model. Quantitative data, including BV, TV, bone volume fraction (BV/TV), Tb.N, Tb.Th, and Tb.Sp, were then calculated using the supporting analysis software. 4.7. Determination of Bone Formation and Bone Absorption Indicators Serum biochemical indicators of bone turnover were quantified using commercially available kits. Runx2 and Cath-K were analyzed with kits purchased from Cusabio (Hubei, China). OCN, RANKL, OPG, BALP, MMP-9, DPD, CTX-1, TRACP-5b, and PINP were detected using ELISA kits (Lengton Biotech, Shanghai, China). 4.8. Peptidomics OP was prepared for peptidomic analysis. Briefly, 50 mg of OP was dissolved in 500 μL of 75% methanol–water solution. The mixture was homogenized using a bead mill (35 Hz, 4 min) and sonicated in an ice bath (5 min), with the process repeated three times. After centrifugation (12,000 rpm, 4 °C, 10 min), the supernatant was collected, desalted, and dried in a vacuum concentrator at 45 °C. The resulting sample was redissolved in 50 μL of mobile phase A for LC-MS/MS analysis. LC-MS/MS analysis was performed on an EASYnLC1200 System (Thermo Scientific, Waltham, MA, USA) equipped with a ReprosilPur 120 C18AQ column (1.9 μm, 100 μm ID × 15 cm, Dr. Maisch, Ammerbuch, Germany). The mobile phases were (A) 0.1% formic acid in 2% acetonitrile and (B) 0.1% formic acid in 80% acetonitrile. The injection volume was 4 μL, and the flow rate was 300 nL/min. Peptides were separated using the following elution gradient: 2% B from 0–2 min, ramped to 22% B at 36 min, 45% B at 56 min, 95% B at 58 min, and held at 98% B for 2 min. Data-dependent acquisition was performed in positive mode using an Orbitrap analyzer. The MS1 scan had a resolution of 120,000 (@200 m z m z 4.9. Proteomics For proteomic analysis, proteins were extracted from homogenized tissue using RIPA buffer (300 μL), followed by grinding with a bead mill (70 Hz, 4 min) and sonication in an ice-water bath (20 min). A total of 200 ng of peptides from each sample was separated and analyzed on a Vanquish Neo UHPLC system (Thermo Scientific, Waltham, MA, USA) coupled with an Astral mass spectrometer with a nano-electrospray ion source. Peptides were separated on a reversed-phase EASY-Spray™ HPLC column (150 μm × 15 cm, Thermo Scientific, Waltham, MA, USA) using a 6.9-min gradient. The mobile phases were (A) 0.1% FA in H 2 DIA was performed in profile and positive mode. MS1 scans were at a resolution of 240,000 (@200 m z m z m z 4.10. Molecular Docking Simulation Discovery Studio software (version 2017 R2, Biovia, San Diego, CA, USA) was used to evaluate the potential osteogenic activity-promoting mechanism of OP. Firstly, in the Small Molecules module, energy minimization (Full Minimization) and Prepare Ligands preprocessing were performed on peptide ligands. Subsequently, the receptor proteins were optimized: Integrins α5β1 (PDB ID: 3VI4) and αvβ3 (PDB ID: 1L5G) were processed to remove water molecules and add hydrogen via the Macromolecules module, and the Prepare Protein structure optimization was completed. Based on the classic RGD (Arg-Gly-Asp) interaction sites (Site 2 of 3VI4 and Site 1 of 1L5G), the binding sites were defined using the Define and Edit Binding Site module (the original ligands were removed, and the radius was set to 15r). After undergoing the same preprocessing, the binding site of EGFR (PDB ID: 1IVO) was defined according to the active center residues reported in the literature. Finally, the CDOCKER algorithm in the Receptor–Ligand Interactions module was used for semi-flexible docking between the above three targets and peptide ligands. The results were visualized by Discovery Studio, and the binding modes were analyzed. 4.11. Statistical Analysis Statistical analysis was conducted using SPSS 22.0 software (SPSS Inc., Armonk, NY, USA). Results are expressed as the mean ± standard deviation. One-way analysis of variance (ANOVA) and Student’s t p Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/md23090356/s1 Author Contributions Conceptualization, W.Y. and X.Q.; methodology, W.Y. and H.L.; investigation, W.Y. and W.M.; resources, X.Q.; writing—original draft preparation, W.Y. and W.M.; writing—review and editing, W.C.; supervision, X.Q.; funding acquisition, X.Q. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved by the Laboratory Animal Ethics Committee of Guangdong Ocean University (protocol code GDOU-LAE-2023-035, approved on 30 September 2023). Data Availability Statement Data are contained within the article and Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: AS Alendronate Sodium BALP Bone Alkaline Phosphatase BV Bone Volume Cath-K Cathepsin K CTX-1 C-Terminal Telopeptide of Type I Collagen DEX Dexamethasone, Dexamethasone Sodium Phosphate DIA Data-Independent Acquisition DPD Deoxypyridine EGFR Epidermal Growth Factor Receptor MMP-9 Matrix Metallopeptidase 9 OCN Osteocalcin OG Gushukang Granules OP Oyster Peptide OPG Osteoprotegerin OPH High-Dose Oyster Peptide OPL Low-Dose Oyster Peptide OPM Medium-Dose Oyster Peptide PINP N-Terminal Propeptides of Procollagen Type Ⅰ ROS Reactive Oxygen Species Runx2 Runt-Related Transcription Factor 2 Tb.N Trabecular Number Tb.Sp Trabecular Separation Tb.Th Trabecular Thickness TCM Traditional Chinese Medicine TRACP-5b Tartrate-Resistant Acid Phosphatase 5b TV Tissue Volume OVX Ovariectomy References 1. Salari N. Ghasemi H. Mohammadi L. Behzadi M.H. Rabieenia E. Shohaimi S. Mohammadi M. The global prevalence of osteoporosis in the world: A comprehensive systematic review and meta-analysis J. Orthop. Surg. Res. 2021 16 609 10.1186/s13018-021-02772-0 34657598 PMC8522202 2. Song S. Guo Y. Yang Y. Fu D. Advances in pathogenesis and therapeutic strategies for osteoporosis Pharmacol. Ther. 2022 237 108168 10.1016/j.pharmthera.2022.108168 35283172 3. Sadhukhan S. Sethi S. Rajender S. Mithal A. Chattopadhyay N. Understanding the characteristics of idiopathic osteoporosis by a systematic review and meta-analysis Endocrine 2023 82 513 526 10.1007/s12020-023-03505-5 37733181 4. Mei F. Meng K. Gu Z. Yun Y. Zhang W. Zhang C. Zhong Q. Pan F. Shen X. Xia G. Arecanut ( Areca catechu J. Agric. Food Chem. 2021 69 246 258 10.1021/acs.jafc.0c06671 33382620 5. Li J. Chen X. Lu L. Yu X. The relationship between bone marrow adipose tissue and bone metabolism in postmenopausal osteoporosis Cytokine Growth Factor Rev. 2020 52 88 98 10.1016/j.cytogfr.2020.02.003 32081538 6. Gregson C.L. Armstrong D.J. Bowden J. Cooper C. Edwards J. Gittoes N.J.L. Harvey N. Kanis J. Leyland S. Low R. UK clinical guideline for the prevention and treatment of osteoporosis Arch. Osteoporos. 2022 17 58 10.1007/s11657-022-01061-5 35378630 PMC8979902 7. Zhang Y. Zheng Z. Liu Y. Anti-osteoporosis effects and underpinning mechanisms of food-derived bioactive peptides: A review Trends. Food Sci. Technol. 2024 147 104431 10.1016/j.tifs.2024.104431 8. Zhang C. Li H. Li J. Hu J. Yang K. Tao L. Oxidative stress: A common pathological state in a high-risk population for osteoporosis Biomed. Pharmacother. 2023 163 114834 10.1016/j.biopha.2023.114834 37163779 9. Shahidi F. Saeid A. Bioactivity of marine-derived peptides and proteins: A review Mar. Drugs 2025 23 157 10.3390/md23040157 40278278 PMC12028762 10. Hu Y. Hou Z. Liu Z. Wang X. Zhong J. Li J. Guo X. Ruan C. Sang H. Zhu B. Oyster mantle-derived exosomes alleviate osteoporosis by regulating bone homeostasis Biomaterials 2024 311 122648 10.1016/j.biomaterials.2024.122648 38833761 11. Chen Y. Chen J. Chen J. Yu H. Zheng Y. Zhao J. Zhu J. Recent advances in seafood bioactive peptides and their potential for managing osteoporosis Crit. Rev. Food Sci. Nutr. 2022 62 1187 1203 10.1080/10408398.2020.1836606 33094645 12. Quan Z. Wang Z. Wang Z. Hou Z. Liu B. Guo X. Zhu B. Hu Y. Study on the antioxidant and antiosteoporotic activities of the oyster peptides prepared by ultrasound-assisted enzymatic hydrolysis Ultrason. Sonochem. 2025 112 107211 10.1016/j.ultsonch.2024.107211 39729723 PMC11733053 13. Fu X. Zhang M. Shao C. Li G. Bai H. Dai G. Chen Q. Kong W. Fu X. Wang C. Chinese marine materia medica resources: Status and potential Mar. Drugs 2016 14 46 10.3390/md14030046 26950133 PMC4820300 14. Qi Z. Weini C. Miao J. Guang Z. Hongtao G. Aiping L. Exploring the rules of chinese and western medicine used in the treatment of osteoporosis by text mining World Sci. Technol. 2012 14 1288 1293 10.1016/S1876-3553(12)60035-0 15. Wang Y. Chen G. Ji X. Wong S.K. Ekeuku S.O. Chin K.-Y. Ejiao as a preventive agent for osteoporosis-a scoping review of current evidence J. Orthop. Surg. Res. 2025 20 445 10.1186/s13018-025-05759-3 40325487 PMC12054324 16. Moon P.D. Kim M.H. Lim H.S. Oh H.A. Nam S.Y. Han N.R. Kim M.J. Jeong H.J. Kim H.M. Taurine, a major amino acid of oyster, enhances linear bone growth in a mouse model of protein malnutrition Biofactors 2015 41 190 197 10.1002/biof.1213 25963419 17. Oliveira D.F. Coleone A.P. Lima F.C.D.A. Batagin-Neto A. Reactivity of amino acids and short peptide sequences: Identifying bioactive compounds via DFT calculations Mol. Divers. 2024 29 489 502 10.1007/s11030-024-10868-y 38700810 18. Ponzetti M. Rucci N. Osteoblast differentiation and signaling: Established concepts and emerging topics Int. J. Mol. Sci. 2021 22 6651 10.3390/ijms22136651 34206294 PMC8268587 19. Udagawa N. Koide M. Nakamura M. Nakamichi Y. Yamashita T. Uehara S. Kobayashi Y. Furuya Y. Yasuda H. Fukuda C. Osteoclast differentiation by RANKL and OPG signaling pathways J. Bone Miner. Metab. 2021 39 19 26 10.1007/s00774-020-01162-6 33079279 20. Jia Q. Liu L. Yu Y. Wulamu W. Jia L. Liu B. Zheng H. Peng Z. Zhang X. Zhu R. Inhibition of EGFR Pathway suppresses M1 macrophage polarization and osteoclastogenesis, mitigating titanium particle-induced bone resorption J. Inflamm. Res. 2024 17 9725 9742 10.2147/JIR.S484529 39624396 PMC11609397 21. Yang L. Chen H. Yang C. Hu Z. Jiang Z. Meng S. Liu R. Huang L. Yang K. Research progress on the regulatory mechanism of integrin-mediated mechanical stress in cells involved in bone metabolism J. Cell. Mol. Med. 2024 28 e18183 10.1111/jcmm.18183 38506078 PMC10951882 22. Chen H. Shi P. Xu Z. Fan F. Wang Z. Du M. Oral administration of oyster peptide prevents bone loss in ovariectomized mice eFood 2020 1 298 309 10.2991/efood.k.200812.001 23. Molagoda I.M.N. Jayasingha J. Choi Y.H. Park E.K. Jeon Y.J. Lee B.J. Kim G.Y. Fermented oyster extract promotes insulin-like growth factor-1-mediated osteogenesis and growth rate Mar. Drugs 2020 18 472 10.3390/md18090472 32962034 PMC7551862 24. Feng X. Jiang S. Zhang F. Wang R. Zhang T. Zhao Y. Zeng M. Extraction and characterization of matrix protein from pacific oyster ( Crassostrea gigs Food Funct. 2021 12 9066 9076 10.1039/D1FO00010A 34387295 25. Hou Y. Wu Z. Dai Z. Wang G. Wu G. Protein hydrolysates in animal nutrition: Industrial production, bioactive peptides, and functional significance J. Anim. Sci. Biotechnol. 2017 8 24 10.1186/s40104-017-0153-9 28286649 PMC5341468 26. Yue H. Tian Y. Feng X. Bo Y. Leng Z. Dong P. Xue C. Wang J. Novel peptides from sea cucumber intestinal hydrolysates promote longitudinal bone growth in adolescent mice through accelerating cell cycle progress by regulating glutamine metabolism Food Funct. 2022 13 7730 7739 10.1039/D2FO01063A 35762389 27. Chen J. Li S. Abou-Elsoud M. Liu W. Cui R. Li Z. Shu D. Cai Z. Huang X. Phosvitin phosphopeptides and peptides-calcium chelate promote calcium deposition in a three-cell co-culture system by modulating the OPG/RANKL/RANK signaling pathway Food Biosci. 2024 62 105065 10.1016/j.fbio.2024.105065 28. Shen G. Ren H. Shang Q. Zhao W. Zhang Z. Yu X. Tang K. Tang J. Yang Z. Liang D. Foxf1 knockdown promotes BMSC osteogenesis in part by activating the Wnt/β-catenin signalling pathway and prevents ovariectomy-induced bone loss eBioMedicine 2020 52 102626 10.1016/j.ebiom.2020.102626 31981979 PMC6992955 29. Zhu S. Chen W. Masson A. Li Y.P. Cell signaling and transcriptional regulation of osteoblast lineage commitment, differentiation, bone formation, and homeostasis Cell Discov. 2024 10 71 10.1038/s41421-024-00689-6 38956429 PMC11219878 30. Arya P.N. Saranya I. Selvamurugan N. RUNX2 regulation in osteoblast differentiation: A possible therapeutic function of the lncRNA and miRNA-mediated network Differentiation 2024 140 100803 10.1016/j.diff.2024.100803 39089986 31. Dwi Susetyo H. Dwiningsih S.R. Widjiati W.W. Arsana I.W. The Effects of Increasing Doses of Nigella Sativa Pharmacogn. J. 2024 16 1081 1085 10.5530/pj.2024.16.175 32. Feng X. Jiang S. Zhang F. Wang R. Zhao Y. Zeng M. Shell water-soluble matrix protein from oyster shells promoted proliferation, differentiation and mineralization of osteoblasts in vitro and vivo Int. J. Biol. Macromol. 2022 201 288 297 10.1016/j.ijbiomac.2021.12.168 34998879 33. Abdelfattah M.A. Mohamed A.S. Ibrahim S.A. Fahmy S.R. Allolobophora caliginosa Sci. Rep. 2023 13 2090 10.1038/s41598-023-29070-5 36746995 PMC9902447 34. Yang M. Xu Z. Wu D. Dong Y. Wang Z. Du M. Characterizations and the Mechanism Underlying Osteogenic Activity of Peptides from Enzymatic Hydrolysates of Stichopus japonicus J. Agric. Food Chem. 2021 69 15611 15623 10.1021/acs.jafc.1c06028 34928143 35. Daponte V. Henke K. Drissi H. Current perspectives on the multiple roles of osteoclasts: Mechanisms of osteoclast-osteoblast communication and potential clinical implications eLife 2024 13 e95083 10.7554/eLife.95083 38591777 PMC11003748 36. Wu T. Wang F. Ai C. Li L. Wu F. Tangeretin suppresses RANKL-induced osteoclastogenesis and alleviates postmenopausal osteoporosis by inhibiting Notch signaling Regen. Ther. 2025 30 136 143 10.1016/j.reth.2025.04.019 40535723 PMC12173807 37. Ni X. Wu B. Li S. Zhu W. Xu Z. Zhang G. Cui H. Bai Q. Wang J. Equol exerts a protective effect on postmenopausal osteoporosis by upregulating OPG/RANKL pathway Phytomedicine 2023 108 154509 10.1016/j.phymed.2022.154509 36288653 38. Urquiaga M. Saag K.G. Risk for osteoporosis and fracture with glucocorticoids Best Pract. Res. Clin. Rheumatol. 2022 36 101793 10.1016/j.berh.2022.101793 36347775 39. Ai Y. Xie X. Guo Y. Zhao J. Xu Y. Wang T. Huang Y. Huang W. Ma T. Luo Y. Schisandrin A induces osteoblast differentiation to treat glucocorticoid-induced osteoporosis through activating Wnt pathway Biochem. Biophys. Res. Commun. 2025 776 152230 10.1016/j.bbrc.2025.152230 40555002 40. Ikebuchi Y. Aoki S. Honma M. Hayashi M. Sugamori Y. Khan M. Kariya Y. Kato G. Tabata Y. Penninger J.M. Coupling of bone resorption and formation by RANKL reverse signalling Nature 2018 561 195 200 10.1038/s41586-018-0482-7 30185903 41. Wang Y. Li H. Yang X. Shen J. Yang K. Lv G. Zhang H. Sun J. The role of the PI3K/Akt pathway in adenosine’s mechanism of action in osteoporosis with oxidative stress: A wet-dry experimental approach strategy J. Funct. Foods 2024 120 106366 10.1016/j.jff.2024.106366 42. Chai S. Yang Y. Wei L. Cao Y. Ma J. Zheng X. Teng J. Qin N. Luteolin rescues postmenopausal osteoporosis elicited by OVX through alleviating osteoblast pyroptosis via activating PI3K-AKT signaling Phytomedicine 2024 128 155516 10.1016/j.phymed.2024.155516 38547625 43. Mao L. Wang L. Xu J. Zou J. The role of integrin family in bone metabolism and tumor bone metastasis Cell Death Discov. 2023 9 119 10.1038/s41420-023-01417-x 37037822 PMC10086008 44. Chen C. Chen R. Gu J. Yang F. Wen L. Liu Z. Yang C. Geng B. Xia Y. Integrin αVβ3 mediates estrogen to enhance osteoblast proliferation, differentiation, and alleviate OVX-induced postmenopausal osteoporosis J. Steroid Biochem. Mol. Biol. 2025 252 106800 10.1016/j.jsbmb.2025.106800 40466876 45. Poon C.C.-W. Au-Yeung C. Wong K.-Y. Chan Z. Zhou L.-P. Li G. Wang Y. Zhang Y. Wong M.-S. Icariin promotes cell adhesion for osteogenesis in bone marrow stromal cells via binding to integrin α5β1 Phytomedicine 2024 133 155887 10.1016/j.phymed.2024.155887 39067311 46. Bai R.-J. Li Y.-S. Zhang F.-J. Osteopontin, a bridge links osteoarthritis and osteoporosis Front. Endocrinol. 2022 13 1012508 10.3389/fendo.2022.1012508 PMC9649917 36387862 47. de Morais P.B. de Almeida G.S. Orsi R.d.O. Zambuzzi W.F. Fernandes C.J.D.C. Aqueous extracts of propolis modulate ECM remodeling and calcium levels during pre-osteoblast differentiation Tissue Cell 2025 97 103101 10.1016/j.tice.2025.103101 40886658 48. Li X. Hu G. Guo J. Chang B. Yi X. Yao T. Role and mechanism of Integrin α5β1 in bone formation and disease Front. Cell Dev. Biol. 2025 13 1632710 10.3389/fcell.2025.1632710 40894924 PMC12391163 49. Valat A. Fourel L. Sales A. Machillot P. Bouin A.P. Fournier C. Bosc L. Arboleas M. Bourrin-Reynard I. Wagoner Johnson A.J. Interplay between integrins and cadherins to control bone differentiation upon BMP-2 stimulation Front. Cell Dev. Biol. 2022 10 1027334 10.3389/fcell.2022.1027334 36684447 PMC9846056 50. Al Azim M. Di Martino J.S. ECM, integrins, and DDRs: A nexus of cancer progression, therapy, and future directions Matrix Biol. 2025 138 27 43 10.1016/j.matbio.2025.04.002 40350240 51. Du B. Deng G. Song Z. He T. Nergiz-Unal R. Li C. Yu T. Huang Y. Collagen peptides promote osteogenesis and angiogenesis by activating the PI3K/AKT signaling pathway in mice Chin. Med. J. 2025 138 610 612 10.1097/CM9.0000000000003458 39819767 PMC11882290 52. Tollabi M. Poursalehi Z. Mehrafshar P. Bakhtiari R. Hosseinpour Sarmadi V. Tayebi L. Haramshahi S.M.A. Insight into the role of integrins and integrins-targeting biomaterials in bone regeneration Connect. Tissue Res. 2024 65 343 363 10.1080/03008207.2024.2396002 39297793 PMC11541888 53. Chen C. Huang L. Chen Y. Jin J. Xu Z. Liu F. Li K. Sun Y. Hydrolyzed egg yolk peptide prevented osteoporosis by regulating Wnt/β-catenin signaling pathway in ovariectomized rats Sci. Rep. 2024 14 10227 10.1038/s41598-024-60514-8 38702443 PMC11068896 Figure 1 Composition analysis of OP: ( A B Figure 2 Effects of AS, OG, and OP on ( A B C Figure 3 Protective effects of AS, OG, and OP against DEX-induced bone loss in rats: ( A B C D # p ## p p p Figure 4 Analysis of bone formation-related indices: ( A B C D # p ## p p p Figure 5 Analysis of bone absorption-related indices: ( A B C D E F G # p ## p p p Figure 6 Screening of potential anti-osteoporotic active peptides: ( A p B C D E Figure 7 Timeline of animal experiments and treatment grouping. AS and OG served as positive controls for evaluating the anti-osteoporotic efficacy of different concentrations of OP. The image was created using free, open-source resources from SciDraw ( https://scidraw.io/ marinedrugs-23-00356-t001_Table 1 Table 1 Potential anti-osteoporotic active peptides with lengths of 11–20 amino acid residues. Peptide Sequence Length Molecular Mass (Da) Bioactive Score Toxicity Binding Energy (kcal/mol) Integrins α5β1 Integrins αvβ3 EGFR GQKDSYVGDEAQSKRGILT 19 2052.03 0.2472 Nontoxic 295.89 240.23 272.95 GQKDSYVGDEAQSKRGILTL 20 2165.12 0.2789 Nontoxic 290.02 138.42 281.91 KDAENRATEAERTVSKL 17 1918.00 0.0956 Nontoxic 274.91 246.31 252.32 TTTAEREIVRDIKEK 15 1788.98 0.0291 Nontoxic 270.52 246.22 253.89 TTAEREIVRDIKEK 14 1687.93 0.0333 Nontoxic 242.33 225.85 236.60 SYVGDEAQSKRGIL 14 1522.79 0.3127 Nontoxic 226.72 208.52 203.97 DLAGRDLTDYLMKIL 15 1736.93 0.3487 Nontoxic 225.92 233.64 225.00 TAEREIVRDIKEK 13 1586.89 0.0446 Nontoxic 225.29 225.06 226.24 AEREIVRDIKE 11 1357.74 0.0588 Nontoxic 223.52 190.44 206.26 DVDIRKDLYAN 11 1321.67 0.1576 Nontoxic 219.93 179.26 207.68 AEREIVRDIKEK 12 1485.84 0.0673 Nontoxic 212.54 225.03 215.12 DLAGRDLTDYLMK 13 1510.76 0.3423 Nontoxic 209.64 208.75 198.61 KQEYDESGPSIVH 13 1488.70 0.1903 Nontoxic 209.09 197.81 190.45 DLAGRDLTDYL 11 1251.62 0.2583 Nontoxic 204.29 191.17 189.01 DLAGRDLTDYLM 12 1398.66 0.3555 Nontoxic 203.28 212.97 180.42 KSYELPDGQVITIG 14 1519.80 0.2720 Nontoxic 199.99 140.55 194.27 KQEYDESGPSIV 12 1351.64 0.1908 Nontoxic 196.70 186.03 171.52 EYDESGPSIVHR 12 1388.64 0.1670 Nontoxic 188.00 152.92 166.65 LESSTAGGVAS 11 978.47 0.0860 Nontoxic 169.15 154.10 142.23 ",
  "metadata": {
    "Title of this paper": "Hydrolyzed egg yolk peptide prevented osteoporosis by regulating Wnt/β-catenin signaling pathway in ovariectomized rats",
    "Journal it was published in:": "Marine Drugs",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472170/"
  }
}