{
  "title": "Paper_1106",
  "abstract": "pmc Vet Sci Vet Sci 3286 vetsciences vetsci Veterinary Sciences 2306-7381 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474302 PMC12474302.1 12474302 12474302 41012744 10.3390/vetsci12090815 vetsci-12-00815 1 Review Advancing In Vitro Tools for Oncologic Research in Cats and Dogs https://orcid.org/0009-0003-8464-2392 He Chang 1 2 https://orcid.org/0000-0003-2044-9844 Rottenberg Sven 1 3 * Bennett Peter Academic Editor 1 chang.he@unibe.ch 2 3 * sven.rottenberg@unibe.ch 26 8 2025 9 2025 12 9 497675 815 24 7 2025 20 8 2025 22 8 2025 26 08 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Technological advances now allow scientists to grow cells in a dish outside the body, which has become a fundamental tool in life sciences and especially in cancer research. In recent years, there has been growing interest in using these technologies for pets such as cats and dogs. Both cats and dogs develop cancer similar to humans, such as mammary tumors (breast cancer), which can lead to devastating outcomes and make this disease highly important to study. Growing tumors in a dish makes it possible to study cancer cells without harming the patient, and, in the best case, artificially grown cells can help predict whether a drug will work. While these technologies are constantly improving, such that cells can even form three-dimensional mini tumors, we still face challenges in fully reproducing disease behavior in the body. This review summarizes the current state of tumor culture, with a focus on mammary tumors in cats and dogs. Abstract In vitro culture systems have advanced cancer biology, particularly through 2D and 3D tumor cultures. These have answered numerous scientific inquiries and propelled human oncologic research, with growing recognition of their potential to improve cancer treatment in companion animals, specifically cats and dogs. These species develop cancer spontaneously, closely resembling specific human cancer subtypes. For example, canine and feline mammary tumors are especially valuable for studying tumor biology. In vitro models from these tumors therefore offer a unique opportunity for veterinary cancer research. Recent 3D cell culture advancements provide promising platforms for predicting therapeutic responses in human cancer and may be applied to mammary tumors in animals. However, while limitations in fully recapitulating in vivo conditions and predicting chemotherapy response have been observed in colorectal tumoroids, similar challenges are emerging in mammary and breast tumors. In particular, canine mammary tumors and human breast cancers share critical heterogeneity and microenvironmental factors usually inadequately modeled in vitro. This review critically examines the predictivity of 3D mammary tumoroids from humans and companion animals, highlighting challenges related to stromal and immune cell preservation, reproducibility, and the translational gap between in vitro findings and clinical outcomes. We propose future directions to optimize these models for both comparative oncology and veterinary-specific applications. in vitro model comparative oncology translational medicine dog cat mammary tumor cancer biology 3D culture systems EveryCat Health Foundation EC24F-229 Swiss National Science Foundation 320030M_219453 European Union ERC-2019-AdG-883877 Swiss Cancer Research Foundation KFS-5519-02-2022 Department of Defense W81XWH-22-1-0557 ISREC foundation The research of the Rottenberg laboratory on cat mammary tumors is supported by the EveryCat Health Foundation (EC24F-229). The contents of this publication are solely the responsibility of the authors and do not necessarily represent the views of the EveryCat Health Foundation, its officers, directors, affiliates, or agents. Moreover, the current research in the Rottenberg laboratory is supported by the Swiss National Science Foundation (320030M_219453), the European Union (ERC-2019-AdG-883877), the Swiss Cancer Research Foundation (KFS-5519-02-2022), the Department of Defense (W81XWH-22-1-0557 to S.R.), and the ISREC foundation. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction A cornerstone of both veterinary and human cancer research has been the development of in vitro culture systems, making the study of cancer cells outside of the patient possible. The first attempts at cell culture date back to the late 19th century, when a wide range of cell types were extracted from various organisms and kept viable outside of the donor for a limited amount of time. A pivotal discovery marked the establishment of the first immortalized human cancer cell line, HeLa cells [ 1 2 3 4 5 6 7 8 7 8 9 Human and veterinary oncology are traditionally viewed as entirely different fields because of the differences between species. However, accumulating evidence has revealed striking parallels across species, making them increasingly difficult to distinguish from each other when inspected in detail. Similarly to humans, neoplastic diseases account for a significant proportion of morbidity and mortality in cats and dogs, according to records throughout America and Europe, with mammary tumors, cutaneous epithelial tumors, and lymphomas being frequently reported among the malignant cases [ 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 21 25 Furthermore, companion animals share a similar living environment with their owners and are therefore exposed to similar environmental risk factors. These parallels have led to the introduction of therapeutic strategies originally developed for humans into veterinary medicine. At the same time, cancer in pets offers significant potential to model human disease and serves as a valuable model to study tumor biology and treatment strategies. This reciprocal relationship between companion animals and humans is underscored by the One Health approach, which promotes the advancement of cancer research for both pets and owners [ 27 28 29 30 31 32 TM TM 33 34 This review presents an overview of the application of in vitro culture systems, with a focus on canine and feline mammary tumors. We will explore both classical and advanced systems used to study cancer in cats and dogs. In addition, we will discuss the advantages and limitations of the currently available systems, highlighting the potential of comparative oncology bridging cancer research across species. 2. Conventional Two-Dimensional (2D) Culture 2.1. Overview of 2D Culture To understand the advancements in in vitro systems, it is essential to examine the conventional two-dimensional (2D) culture first. The basic but still canonically used in vitro culture system involves propagating adherent cells in flasks as a monolayer supplemented with various formulations of growth media. This popular system is characterized by its low cost, user-friendliness, and scalability compared to the more complex three-dimensional (3D) systems discussed later. Cells are usually seeded, allowed to grow until reaching confluency, and passaged for continuous growth. 2.2. Immortalization Before focusing on cancer-derived in vitro models, it is important to clarify that the classification of culturable cells as either “normal” or “cancerous” is an oversimplification. In most research settings, the ability to proliferate virtually indefinitely is essential, which poses a major limitation in culturing normal, non-transformed cells. In an ideal world, autologous normal cells—e.g., normal mammary cells derived from the same individual as the mammary tumor—would serve as corresponding controls. However, even under optimal conditions, culturing primary normal somatic cells—those derived from normal donor tissues—will result in replicative senescence. This is primarily due to the activation of tumor suppressor genes, such as TP53 RB1 35 36 37 Most cancer cells typically bypass senescence by acquiring mutations affecting telomere regulation, and such alterations also need to be introduced in normal 2D cells to avoid senescence. A systematic analysis of telomere length in over 6800 human cancer samples revealed that 72% harbored TERT-expressing mutations, followed by samples showing alterations in ATRX DAXX TP53 RB1 36 TP53 RB1 Simian virus Human papilloma 38 Although extensive characterization of telomeric biology in companion animals remains elusive, various early studies identified frequent mutations in similar genes across tumors, including TP53 RB1 ATRX TERT 13 39 40 41 42 42 43 44 45 46 47 48 49 50 51 Notably, in mice, low levels of TERT are also expressed in adult somatic cells [ 52 53 54 54 55 56 57 58 59 2.3. Oncogenic Transformation Given the overlapping features observed in vitro, it is crucial not to confuse immortalized cells with cancer cells. Immortalization only involves bypassing of replicative senescence, allowing cells to divide indefinitely. However, immortalized non-cancerous cell lines still lack certain properties exclusive to cancer cells, such as evasion of growth suppression or resistance to programmed cell death. For instance, normal cells enter a proliferative quiescence when they reach confluency as a monolayer known as contact inhibition or initiate apoptosis upon loss of anchorage through a process called anoikis. In contrast, cancer cells would continue to divide uncontrollably under these conditions [ 60 61 Figure 1 58 62 63 42 The soft agar assay is widely used to assess oncogenic transformation, where the ability to proliferate independently of anchorage is demonstrated, adherent cells being suspended in low-concentration agar, allowing the assessment of resistance to anoikis. This technique can also be adapted to culture some cancer lines in 3D, as will be discussed later. Another well-established method examines the tumorigenic potential of transformed cells in vivo using mice as xenotransplantation models. These models are considered more reliable as they reflect the interaction between the inoculated cells with the complex in vivo environment. Additionally, xenotransplantation models are useful to study long-term tumor progression and metastasis, with tumors often passaged in these mice to maintain tumor lineage and assess metastatic potential [ 64 65 Given this context, for immortalized cell lines to acquire typical hallmarks of cancer, additional pathway perturbations are required. Interestingly, species vary in the number of mutational hits required for successful oncogenic transformation. For instance, while human fibroblasts require perturbations in five different pathways—specifically p53, pRb, PP2A, telomerase, and Ras pathways—to achieve oncogenic transformation, mouse fibroblasts only require perturbations in p53 and Ras [ 66 67 68 68 69 Even more intriguing, studies on canine cell lines suggest that dogs resemble mice in their susceptibility to oncogenic transformation, despite the significant difference in body mass and life span. This was supported by the successful oncogenic transformation of embryonic immortalized canine fibroblasts using h-Ras in addition to the introduction of a catalytic telomerase subunit [ 42 70 TP53 TFE3 71 72 In contrast, the literature is significantly sparser regarding oncogenic transformation in feline cell lines. While successful immortalization was demonstrated in feline endothelial cells [ 50 43 49 43 49 73 Together, these findings highlight the complexity of tumorigenesis across species and the challenges associated with 2D cultures. They emphasize the need for future investigations in companion animals, possibly also by improving current cell culture systems. Elucidating the underlying mechanisms of the differences and similarities may result in more relevant translation across veterinary and human oncology. 3. Three-Dimensional (3D) Culture 3.1. Overview of 3D Culture As technology advances, in vitro culture systems have become increasingly more sophisticated to bridge the gaps between in vitro models and their primary counterparts. While conventional 2D culture systems provide powerful ex vivo tools, the loss of native multicellular architecture and change in cell shape through the growth on hard plastic can substantially impact gene expression [ 74 75 76 In this context, scaffolds refer to supportive materials that mimic the native extracellular matrix (ECM) for cells to grow on or within. Alternatively, scaffold-free approaches, including static suspension cultures, dynamic microfluidic devices, and bioreactors, rely on meticulously controlled biochemical cues to promote 3D growth [ 77 78 77 79 80 3.2. Organoids vs. Spheroids vs. Tumoroids: Definition Matters To better understand the distinct advantages of 3D models, it is important to clarify key terminologies first. Across studies, authors classify their in vitro models as organoids, spheroids, and, in the context of the mammary gland, mammospheres. Etymologically speaking, a spheroid (“sphere-like”) describes a geometric feature—likewise, a mammosphere refers to a spherical structure derived from the mammary gland—whereas an organoid (“organ-like”) implies organotypic complexity. This interchangeable use of these terms to describe various types of 3D models has been a source of confusion. Essentially, the core feature of organoids is their ability to arise from pluripotent or multipotent stem cells and to self-renew into multicellular 3D structures, mimicking key morphological and functional characteristics of an organ [ 4 80 81 77 80 82 Given this context, organoid culture relies on the natural differentiation pathways of these cells—meaning that the composition and architecture of the final organoid depend on both the commitment state of the starting stem cells and the culture conditions ( Figure 2 77 80 81 83 While the definition of an organoid is generally straightforward, classifying tumor-derived 3D structures may pose a challenge, particularly regarding solid tumors that lack clear morphological heterogeneity and architecture. Traditionally, “spheroids” refers to 3D structures generated from any cells forming simple, miniature spheres. One of the earliest models, developed in the 1970s, used hamster cancer cell lines cultured in spinning flasks to keep cells in suspension [ 84 85 86 87 In this context, 3D culture studies of CMT exhibit organoid characteristics, displaying glandular histomorphological features while maintaining the mutational landscape and immunophenotypic signature of the original tumor tissue [ 88 89 The distinction between tumor organoids and tumor spheroids is crucial, as the way we conceptualize tumor-derived 3D structures depends on the tumor growth model we subscribe to. Therefore, we propose the term “tumoroids” (“tumor-like”) as a more appropriate nomenclature for tumor-derived 3D models. According to the cancer stem cell (CSC) theory, only a subset of specialized cells within a tumor are responsible for disease initiation and driving disease progression. These CSCs can additionally differentiate into a variety of non-tumorigenic cells with a limited capacity for self-renewal. Given this context, in vitro conditions suitable for organoid culture should logically produce tumor organoids from these CSCs. However, some researchers may argue that the non-tumorigenic population in 3D HBC cultures may result from contamination by surrounding untransformed cells [ 90 91 Although the CSC model is still debated, there are cancer cell subpopulations expressing stem cell markers such as CD133 or CD44 [ 92 93 94 79 94 In contrast, the stochastic model of carcinogenesis posits that any oncogenetically transformed cells can expand clonally and equally contribute to tumor growth [ 95 At the same time, the line between both models starts to blur given the concept of cancer cell plasticity, positing a continuous transition of cancer cells into—or their reversion to—progenitor-like states [ 61 Ultimately, without clear evidence of differentiation or organization, the distinction between a tumor organoid and a tumor spheroid may require additional investigation such as lineage tracing experiments. While organoid formation typically relies heavily on the culture medium supplements, cancer cells may lose these dependencies to activate oncogenic pathways [ 96 4. Mammary Tumor Models 4.1. Advancements and Challenges in Establishing In Vitro Models for Mammary Tumors With the growing attention to alternative HBC models, there has been a substantial increase in the number of mammary tumor models in companion animals ( Table 1 Efforts to develop 3D CMT models have seen some success. Cocola et al. [ 79 94 88 90 Despite advancements in CMT models, the development of 3D FMT models remains elusive. Success rates for establishing cell lines have ranged from 2.5% to 40% [ 51 97 98 99 100 101 vetsci-12-00815-t001_Table 1 Table 1 Summary of studies on establishing in vitro canine and feline mammary tumor models. Species Model Type Tumor Source Number of Animals Reference Highlights Canine 2D  Primary carcinoma and metastases 2 Van der Burg, 1989 [ 102  4 tumor cell lines established  Primary mixed adenoma 1 Priosoeryanto et al., 1995 [ 103  1 tumor cell line established  Carcinoma and adenoma 5 Hellmén, 1992 [ 104  5 tumor cell lines established Using 3 different modes of sampling: 1) tumor fragment DMSO frozen vs. 2) fine-needle aspirate vs. 3) tumor fragment freshly processed  Primary carcinoma and metastases 4 Uyama et al., 2006 [ 105  4 pairs of tumor cell lines from 4 dogs (primary and metastatic) established  Primary carcinoma 1 Caceres et al., 2015 [ 106  1 tumor cell line established  Primary carcinoma 1 Mei et al., 2021 [ 107  1 tumor cell line established  Primary mixed adenocarcinoma 1 Li et al., 2021 [ 108  1 tumor cell line established  Included tumor types: complex carcinoma, complex adenoma, and mixed adenoma 10 out of 12 Yeom et al., 2023 [ 109  10 tumor cell lines established Targeted sequencing for two variants of PIK3CA Validated for in vitro drug assays  Included tumor types: complex carcinoma, mixed tumor, in situ carcinoma, and simple carcinoma 8 Park et al., 2024 [ 110  8 tumor cell lines established Targeted sequencing for a variant of PIK3CA Validated for in vitro drug assays Identified over 200 highly expressed genes and enriched EMT signatures Canine 3D  Not specified 8 Cocola et al., 2009 [ 94  8 tumoroid lines and 8 normal mammary glands established Could be maintained for up to 5 passages  Included tumor types: complex carcinoma, simple carcinoma, mixed tumor, mixed carcinoma, and malignant myoepithelioma 16 Inglebert et al., 2022 [ 88  23 different tumoroids and normal mammary organoids out of 32 samples established Suitable for long-term culture Validated for gene editing and in vitro drug assays Verified conserved mutational landscape in in vitro models using whole-genome sequencing (WGS) Feline 2D  Primary carcinoma 4 out of 30 Norval et al., 1985 [ 97  4 tumor cell lines established  1× primary carcinoma 3× pulmonary metastases 4 out of 135 Minke et al., 1991 [ 96  4 tumor cell lines established  Primary carcinoma and metastases Including 1 thoracocentesis sample 5 out of 13 Uyama et al., 2005 [ 51  5 cell lines established Telomerase activity detected in all cell lines  Primary carcinoma 1 Borges et al., 2016 [ 111  1 cell line established  Primary carcinoma 1 Granados-Soler et al., 2018 [ 112  1 cell line established Immunophenotypic characterization Copy-number variation analysis of cell lines and tumors Validated for in vitro drug assays Investigated EMT-related gene expression levels 4.2. Predictive Drug Response and Biomarkers in Mammary Tumor Models Building on the development of these models, one of the arguably most clinically relevant aspects of primary in vitro models is their potential to predict drug response without the ethical concerns of in vivo testing. Several studies have investigated drug response involving CMT and FMT models to identify clinically translatable vulnerabilities [ 88 109 110 112 113 114 115 With the recent revelation of PIK3CA 108 109 110 116 109 110 116 88 88 109 110 PIK3CA 116 PIK3CA 109 PIK3CA In contrast, investigations into drug response in FMT models remain limited. Recent copy-number variation (CNV) analysis identified several altered cancer-related genomic regions as prognostic markers, supported by retrospective clinical survival data [ 117 JAK2 PD-L1 PD-L2 PD-L1 PD-L2, 113 112 118 90 119 4.3. Exploring Novel Biomarkers with CRISPR/Cas9 Screening While significant attention has been given to drug testing and mutation-specific drug response prediction, genetic screenings using CRISPR/Cas9 technologies have recently emerged as a powerful tool for discovering novel predictive biomarkers, as well as investigating tumor-specific vulnerabilities and resistance mechanisms. In contrast to traditional genomic screening that identifies mutations in wild-type genomes, CRISPR/Cas9 screening provides functional context for genomic alterations. For example, CRISPR/Cas9 screening enabled the identification of LRP6 120 Moreover, CRISPR/Cas9 screening was successfully applied to both CMT tumoroids and normal canine mammary organoids using a custom-designed CRISPR/Cas9 sub-library targeting over 800 druggable genes. This approach opens new opportunities for uncovering cancer-specific vulnerabilities and mechanisms [ 88 121 Despite the pressing need for effective therapies in FMT, such advanced methodologies remain significantly underrepresented in FMT research. FMT is often proposed as a model for triple-negative breast cancer (TNBC) in women. While TNBC is recognized as the most aggressive subtype of HBC, it is frequently susceptible to poly (ADP-ribose) polymerase inhibitors (PARPi) due to the homologous recombination deficiencies (HRDs) that arise from mutations in BRCA1/2 122 BRCA1/2 123 124 BRCA1/2 125 4.4. Lost in Translation Despite progress in modeling mammary tumors in vitro, translating some findings into clinical applications remains challenging, even using 3D tumoroid models. Current scaffold-based CMT tumoroids can mimic certain aspects of the in vivo environment, but they are still largely limited to epithelial monocultures, excluding stromal and immune cells that are crucial in shaping tumor behavior. This limitation likely contributes to the observed discrepancies in drug sensitivities between in vitro and in vivo mouse mammary tumor models, due to the protective effects of the tumor microenvironment [ 126 127 128 129 These observations raise the important question of how accurately in vitro systems can predict clinically relevant drug efficacies in cancer therapy. In this context, the use of patient-derived tumoroid cultures to guide individualized treatment decisions conceptually aligns with bacteriologic culture-based diagnostics. Interestingly, both in vitro tumoroid culture and antimicrobial susceptibility testing (AST) share similar limitations regarding their predictive value in vivo. In both cases, the systems tend to be selected for specific subpopulations and are susceptible to pre-analytical errors, including variability in clinical sampling and processing. While AST generally correlates well with clinical outcomes, therapy failure still occurs due to factors such as biofilm formation or drug-limiting conditions at the infection site (e.g., pH or perfusion), similar to tumoroid models without a tumor microenvironment [ 130 131 The profound influence of the tumor microenvironment on in vitro models emphasizes the need for comprehensive characterization and optimization of co-culture systems in the future. Accurately replicating the tumor microenvironment requires detailed profiling of the various cellular components involved. Advanced transcriptomic approaches, such as single-cell RNA sequencing (scRNAseq), provide powerful tools for extensive mapping of the cellular composition and gene expression profiles within both the tumor and its microenvironment [ 132 In summary, we think that the challenges summarized in Figure 3 (a) Reproducibility and Standardization Issues Variability in culture conditions remains a major obstacle. Mammary tumoroid protocols, whether derived from human or canine tissues, are frequently based on “homebrew” media compositions that vary between laboratories. Even when commercial kits like those adapted for veterinary oncology are used, slight differences in growth factors, extracellular matrix components, and culture duration may result in significant variability in drug sensitivity readouts. This variability complicates the predictive accuracy when translating in vitro findings to clinical or veterinary settings. (b) Incomplete Recapitulation of the Native TME Although 3D tumoroids have provided an improved platform over conventional 2D cultures, current models for breast and mammary tumors often suffer from a reduction or loss of non-epithelial components. For instance, while human breast cancer tumoroids may retain certain epithelial characteristics, they often lack a fully representative TME—missing stromal support cells, resident immune cells, and the complex extracellular matrix—which are essential for accurate drug response prediction. Moreover, hormone receptor-positive tumor cells appear to lose these during the tumoroid culture. These components may lead to underestimation of therapeutic resistance mechanisms typically observed in vivo. (c) Translational Gaps and Predictive Accuracy Similar to findings in CRC, the sensitivity and specificity of 3D tumoroid models in predicting drug responses in breast and mammary tumors remain moderate. This highlights the discrepancies between in vitro drug responses and the complexity of tumor behavior in a living organism. These discrepancies are partly attributed to the heterogeneous nature of both human and canine mammary tumors, where distinct subtypes (e.g., triple-negative breast cancer in humans and complex carcinoma in dogs) present unique challenges for in vitro modeling. (d) Addressing Tumor Heterogeneity Intrinsic heterogeneity within breast tumors is a well-documented phenomenon, affecting prognosis and therapeutic responsiveness. Despite maintaining some level of histological and molecular fidelity, current mammary tumoroids do not fully capture inter- and intra-tumoral diversity. Incorporating methods such as multi-regional sampling and single-cell sequencing into tumoroid platforms may improve their predictive utility, allowing for a more tailored approach—both in human oncology and in veterinary practice. (e) Cost and Practical Limitations Generating and maintaining mammary tumoroids is often more laborious and costly compared to traditional models. This is especially true when optimizing conditions to preserve aspects of the TME. While some studies on CRC have demonstrated cost-effective methods, the financial constraints in veterinary research may require further innovations, such as automation and high-throughput screening methods, to achieve more consistent and economically feasible results in mammary tumor models. To enhance the translational applicability of mammary tumoroids, future research should focus on several key directions. First, integrating multi-cellular co-culture systems that incorporate fibroblasts, immune cells, and endothelial cells will better recapitulate the complexity of human and animal tumor microenvironments. Second, establishing standardized culture guidelines addressing growth media composition, ECM substrates and culture duration will be crucial to reduce inter-laboratory variability. Additionally, advances in automation and AI-assisted monitoring should be leveraged to generate more refined and predictive readouts. Finally, rigorous in vivo validation is critical to correlate tumoroid drug response profiles with clinical outcomes in both canine and feline mammary tumor cases. 5. Final Remarks Overall, the effort to replicate in vivo conditions in vitro has led to substantial progress in the field of veterinary oncology for cats and dogs. While 2D models have established foundational knowledge, the development of 3D tumoroid models presents an exciting opportunity for more accurate experimental outcomes. However, critical challenges remain, especially in establishing robust FMT models, addressing experimental variation across studies, and integrating the tumor microenvironment in vitro. Ultimately, overcoming these challenges will be crucial for advancing the field of veterinary oncology, ensuring that cancer research yields meaningful experimental outcomes for companion animals. Acknowledgments We thank Leonore Aeschlimann, Simone de Brot, Llorenç Grau Roma, and Demeter Túrós for reading the manuscript and providing their valuable feedback. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, S.R. and C.H.; Writing—Original Draft Preparation, S.R. and C.H.; Writing—Review and Editing, S.R. and C.H.; Supervision, S.R.; Figure Preparation, C.H. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. References 1. Höxtermann E. Cellular ‘Elementary Organisms’ In Vitro. The Early Vision of Gottlieb Haberlandt and Its Realization Physiol. Plant. 1997 100 716 728 10.1111/j.1399-3054.1997.tb03079.x 2. Zhao C. Cell Culture: In Vitro Model System and a Promising Path to In Vivo Applications J. Histotechnol. 2023 46 1 4 10.1080/01478885.2023.2170772 36691848 3. Lorvellec M. Pellegata A.F. Maestri A. Turchetta C. Alvarez Mediavilla E. Shibuya S. Jones B. Scottoni F. Perocheau D.P. Cozmescu A.C. An In Vitro Whole-Organ Liver Engineering for Testing of Genetic Therapies iScience 2020 23 101808 10.1016/j.isci.2020.101808 33305175 PMC7708813 4. Clevers H. Modeling Development and Disease with Organoids Cell 2016 165 1586 1597 10.1016/j.cell.2016.05.082 27315476 5. Brassard J.A. Nikolaev M. Hübscher T. Hofer M. Lutolf M.P. Recapitulating Macro-Scale Tissue Self-Organization through Organoid Bioprinting Nat. Mater. 2021 20 22 29 10.1038/s41563-020-00803-5 32958879 6. Shin W. Kim H.J. 3D In Vitro Morphogenesis of Human Intestinal Epithelium in a Gut-on-a-Chip or a Hybrid Chip with a Cell Culture Insert Nat. Protoc. 2022 17 910 939 10.1038/s41596-021-00674-3 35110737 PMC9675318 7. Neufeld L. Yeini E. Reisman N. Shtilerman Y. Ben-Shushan D. Pozzi S. Madi A. Tiram G. Eldar-Boock A. Ferber S. Microengineered Perfusable 3D-Bioprinted Glioblastoma Model for in Vivo Mimicry of Tumor Microenvironment Sci. Adv. 2021 7 eabi9119 10.1126/sciadv.abi9119 34407932 PMC8373143 8. Bhatia S.N. Ingber D.E. Microfluidic Organs-on-Chips Nat. Biotechnol. 2014 32 760 772 10.1038/nbt.2989 25093883 9. Ben-David U. Siranosian B. Ha G. Tang H. Oren Y. Hinohara K. Strathdee C.A. Dempster J. Lyons N.J. Burns R. Genetic and Transcriptional Evolution Alters Cancer Cell Line Drug Response Nature 2018 560 325 330 10.1038/s41586-018-0409-3 30089904 PMC6522222 10. Pinello K. Amorim I. Pires I. Canadas-Sousa A. Catarino J. Faísca P. Branco S. Peleteiro M.C. Silva D. Severo M. Vet-OncoNet: Malignancy Analysis of Neoplasms in Dogs and Cats Vet. Sci. 2022 9 535 10.3390/vetsci9100535 36288148 PMC9611943 11. Graf R. Grüntzig K. Hässig M. Axhausen K.W. Fabrikant S. Welle M. Meier D. Guscetti F. Folkers G. Otto V. Swiss Feline Cancer Registry: A Retrospective Study of the Occurrence of Tumours in Cats in Switzerland from 1965 to 2008 J. Comp. Pathol. 2015 153 266 277 10.1016/j.jcpa.2015.08.007 26422414 12. MacVean D.W. Monlux A.W. Anderson P.S. Silber Jr S.L. Roszel J.F. Frequency of Canine and Feline Tumors in a Defined Population Vet. Pathol. 1978 15 700 715 10.1177/030098587801500602 220774 13. Ludwig L. Dobromylskyj M. Wood G.A. van der Weyden L. Feline Oncogenomics: What Do We Know about the Genetics of Cancer in Domestic Cats? Vet. Sci. 2022 9 547 10.3390/vetsci9100547 36288160 PMC9609674 14. Graf R. Pospischil A. Guscetti F. Meier D. Welle M. Dettwiler M. Cutaneous Tumors in Swiss Dogs: Retrospective Data From the Swiss Canine Cancer Registry, 2008–2013 Vet. Pathol. 2018 55 809 820 10.1177/0300985818789466 30131007 15. Merlo D.F. Rossi L. Pellegrino C. Ceppi M. Cardellino U. Capurro C. Ratto A. Sambucco P.L. Sestito V. Tanara G. Cancer Incidence in Pet Dogs: Findings of the Animal Tumor Registry of Genoa, Italy J. Vet. Intern. Med. 2008 22 976 984 10.1111/j.1939-1676.2008.0133.x 18564221 16. Dorn C.R. Taylor D.O.N. Schneider R. Hibbard H.H. Klauber M.R. Survey of Animal Neoplasms In Alameda and Contra Costa Counties, California. II. Cancer Morbidity in DOls and Cats From Alameda Countyl,2 J. Natl. Cancer Inst. 1968 40 307 318 5694272 17. Grüntzig K. Graf R. Hässig M. Welle M. Meier D. Lott G. Erni D. Schenker N.S. Guscetti F. Boo G. The Swiss Canine Cancer Registry: A Retrospective Study on the Occurrence of Tumours in Dogs in Switzerland from 1955 to 2008 J. Comp. Pathol. 2015 152 161 171 10.1016/j.jcpa.2015.02.005 25824119 18. Egenvall A. Bonnett B.N. Hedhammar Å. Olson P. Mortality in over 350,000 Insured Swedish Dogs from 1995-2000: II. Breed-Specific Age and Survival Patterns and Relative Risk for Causes of Death Acta Vet. Scand. 2005 46 121 10.1186/1751-0147-46-121 16261925 PMC1624818 19. Dobson J.M. Samuel S. Milstein H. Rogers K. Wood J.L.N. Canine Neoplasia in the UK: Estimates of Incidence Rates from a Population of Insured Dogs J. Small Anim. Pract. 2002 43 240 246 10.1111/j.1748-5827.2002.tb00066.x 12074288 20. Hayes A.A. Mooney S. Feline Mammary Tumors Vet. Clin. N. Am.—Small Anim. Pract. 1985 15 513 520 10.1016/S0195-5616(85)50054-6 3874468 21. Zappulli V. Rasotto R. Caliari D. Mainenti M. Peña L. Goldschmidt M.H. Kiupel M. Prognostic Evaluation of Feline Mammary Carcinomas: A Review of the Literature Vet. Pathol. 2015 52 46 60 10.1177/0300985814528221 24741029 22. Sorenmo K.U. Rasotto R. Zappulli V. Goldschmidt M.H. Development, Anatomy, Histology, Lymphatic Drainage, Clinical Features, and Cell Differentiation Markers of Canine Mammary Gland Neoplasms Vet. Pathol. 2011 48 85 97 10.1177/0300985810389480 21147765 23. Soares M. Correia J. Peleteiro M.C. Ferreira F. St Gallen Molecular Subtypes in Feline Mammary Carcinoma and Paired Metastases-Disease Progression and Clinical Implications from a 3-Year Follow-up Study Tumor Biol. 2016 37 4053 4064 10.1007/s13277-015-4251-z 26486327 24. Goldschmidt M.H. Peña L. Rasotto R. Zappulli V. Classification and Grading of Canine Mammary Tumors Vet. Pathol. 2011 48 117 131 10.1177/0300985810393258 21266722 25. Goldschmidt M.H. Peña L. Zappulli V. Tumors of the Mammary Gland Tumors in Domestic Animals Wiley Hoboken, NJ, USA 2016 723 765 26. Salas Y. Márquez A. Diaz D. Romero L. Epidemiological Study of Mammary Tumors in Female Dogs Diagnosed during the Period 2002–2012: A Growing Animal Health Problem PLoS ONE 2015 10 e0127381 10.1371/journal.pone.0127381 25992997 PMC4436381 27. Hambly J.N. Ruby C.E. Mourich D.V. Bracha S. Dolan B.P. Potential Promises and Perils of Human Biological Treatments for Immunotherapy in Veterinary Oncology Vet. Sci. 2023 10 336 10.3390/vetsci10050336 37235419 PMC10224056 28. Mestrinho L.A. Santos R.R. Translational Oncotargets for Immunotherapy: From Pet Dogs to Humans Adv. Drug Deliv. Rev. 2021 172 296 313 10.1016/j.addr.2021.02.020 33705879 29. LeBlanc A.K. Mazcko C.N. Improving Human Cancer Therapy through the Evaluation of Pet Dogs Nat. Rev. Cancer 2020 20 727 742 10.1038/s41568-020-0297-3 32934365 30. Oh J.H. Cho J.Y. Comparative Oncology: Overcoming Human Cancer through Companion Animal Studies Exp. Mol. Med. 2023 55 725 734 10.1038/s12276-023-00977-3 37009802 PMC10167357 31. Garden O.A. Volk S.W. Mason N.J. Perry J.A. Companion Animals in Comparative Oncology: One Medicine in Action Vet. J. 2018 240 6 13 10.1016/j.tvjl.2018.08.008 30268334 32. Cannon C.M. Cats, Cancer and Comparative Oncology Vet. Sci. 2015 2 111 126 10.3390/vetsci2030111 29061935 PMC5644631 33. London C.A. Hannah A.L. Zadovoskaya R. Chien M.B. Kollias-Baker C. Rosenberg M. Downing S. Post G. Boucher J. Shenoy N. Phase I Dose-Escalating Study of SU11654, a Small Molecule Receptor Tyrosine Kinase Inhibitor, in Dogs with Spontaneous Malignancies12 Clin. Cancer Res. 2003 9 2755 2768 12855656 34. Liao A.T. Chien M.B. Shenoy N. Mendel D.B. McMahon G. Cherrington J.M. London C.A. Inhibition of Constitutively Active Forms of Mutant Kit by Multitargeted Indolinone Tyrosine Kinase Inhibitors Blood 2002 100 585 593 10.1182/blood-2001-12-0350 12091352 35. Karlseder J. Smogorzewska A. de Lange T. Senescence Induced by Altered Telomere State, Not Telomere Loss Science (1979) 2002 295 2446 2449 10.1126/science.1069523 11923537 36. Barthel F.P. Wei W. Tang M. Martinez-Ledesma E. Hu X. Amin S.B. Akdemir K.C. Seth S. Song X. Wang Q. Systematic Analysis of Telomere Length and Somatic Alterations in 31 Cancer Types Nat. Genet. 2017 49 349 357 10.1038/ng.3781 28135248 PMC5571729 37. Yuan X. Xu D. Telomerase Reverse Transcriptase (TERT) in Action: Cross-Talking with Epigenetics Int. J. Mol. Sci. 2019 20 3338 10.3390/ijms20133338 31284662 PMC6651578 38. Hubbard K. Ozer H.L. Mechanism of Immortalization Age 1999 22 65 69 10.1007/s11357-999-0008-1 23604398 PMC3455239 39. Wong K. Ludwig L. Krijgsman O. Adams D.J. Wood G.A. Van Der Weyden L. Comparison of the Oncogenomic Landscape of Canine and Feline Hemangiosarcoma Shows Novel Parallels with Human Angiosarcoma DMM Dis. Models Mech. 2021 14 dmm049044 10.1242/dmm.049044 PMC8319545 34296746 40. Wong K. Abascal F. Ludwig L. Aupperle-Lellbach H. Grassinger J. Wright C.W. Allison S.J. Pinder E. Phillips R.M. Romero L.P. Cross-Species Oncogenomics Offers Insight into Human Muscle-Invasive Bladder Cancer Genome Biol. 2023 24 191 10.1186/s13059-023-03026-4 37635261 PMC10464500 41. Van Leeuwen I.S. Hellmèn E. Cornelisse C.J. Van den Burgh B. Rutteman G.R. P53 Mutations in Mammary Tumor Cell Lines and Corresponding Tumor Tissues in the Dog Anticancer Res. 1996 16 3737 3744 9042250 42. You S. Moon J.-H. Kim T.-K. Kim S.-C. Kim J.-W. Yoon D.-H. Kwak S. Hong K.-C. Choi Y.-J. Kim H. Cellular Characteristics of Primary and Immortal Canine Embryonic Fibroblast Cells Exp. Mol. Med. 2004 36 325 335 10.1038/emm.2004.43 15365251 43. Lee Y. Berríos-Vázquez G. Maes R.K. Kiupel M. Desmarets L.M.B. Nauwynck H.J. Soboll Hussey G. Development of Immortalized Feline Respiratory Epithelial Cells in an Air-Liquid-Interface Culture System for Feline Herpesvirus-1 Study Virus Res. 2023 326 199063 10.1016/j.virusres.2023.199063 36738933 PMC10194272 44. Pelst M. Höbart C. de Rooster H. Devriendt B. Cox E. Immortalised Canine Buccal Epithelial Cells’ CXCL8 Secretion Is Affected by Allergen Extracts, Toll-like Receptor Ligands, IL-17A and Calcitriol Vet. Res. 2022 53 72 10.1186/s13567-022-01090-5 36100942 PMC9469575 45. Guo L. Wang Z. Li J. Li J. Cui L. Dong J. Meng X. Qian C. Wang H. Immortalization Effect of SV40T Lentiviral Vectors on Canine Corneal Epithelial Cells BMC Vet. Res. 2022 18 181 10.1186/s12917-022-03288-3 35578336 PMC9109393 46. Matsumura T. Takesue M. Westerman K.A. Okitsu T. Sakaguchi M. Fukazawa T. Totsugawa T. Noguchi H. Yamamoto S. Stolz D.B. Establishment of an Immortalized Human-Liver Endothelial Cell Line with SV40T and HTERT Transplantation 2004 77 1357 1365 10.1097/01.TP.0000124286.82961.7E 15167590 47. Yasumura Y. Teshima T. Nagashima T. Takano T. Michishita M. Taira Y. Suzuki R. Matsumoto H. Immortalized Canine Adipose-Derived Mesenchymal Stem Cells as a Novel Candidate Cell Source for Mesenchymal Stem Cell Therapy Int. J. Mol. Sci. 2023 24 2250 10.3390/ijms24032250 36768587 PMC9917102 48. López S.M. Balog-Alvarez C. Canessa E.H. Hathout Y. Brown K.J. Vitha S. Bettis A.K. Boehler J. Kornegay J.N. Nghiem P.P. Creation and Characterization of an Immortalized Canine Myoblast Cell Line: Myok9 Mamm. Genome 2020 31 95 109 10.1007/s00335-020-09833-5 32246189 49. Desmarets L.M. Theuns S. Olyslaegers D.A. Dedeurwaerder A. Vermeulen B.L. Roukaerts I.D. Nauwynck H.J. Establishment of Feline Intestinal Epithelial Cell Cultures for the Propagation and Study of Feline Enteric Coronaviruses Vet. Res. 2013 44 71 10.1186/1297-9716-44-71 23964891 PMC3765525 50. Olyslaegers D.A.J. Desmarets L.M.B. Dedeurwaerder A. Dewerchin H.L. Nauwynck H.J. Generation and Characterization of Feline Arterial and Venous Endothelial Cell Lines for the Study of the Vascular Endothelium BMC Vet. Res. 2013 9 170 10.1186/1746-6148-9-170 23987139 PMC3847150 51. Uyama R. Hong S.-H. Nakagawa T. Yazawa M. Kadosawa T. Mochizuki M. Tsujimoto H. Nishimura R. Sasaki N. Establishment and Characterization of Eight Feline Mammary Adenocarcinoma Cell Lines J. Veter-Med. Sci. 2005 67 1273 1276 10.1292/jvms.67.1273 16397390 52. Gorbunova V. Seluanov A. Coevolution of Telomerase Activity and Body Mass in Mammals: From Mice to Beavers Mech. Ageing Dev. 2009 130 3 9 10.1016/j.mad.2008.02.008 18387652 PMC3733351 53. Prowse K.R. Greider C.W. Developmental and Tissue-Specific Regulation of Mouse Telomerase and Telomere Length Proc. Natl. Acad. Sci. USA 1995 92 4818 4822 10.1073/pnas.92.11.4818 7761406 PMC41798 54. Pfeiffer V. Lingner J. Replication of Telomeres and the Regulation of Telomerase Cold Spring Harb Perspect. Biol. 2013 5 a010405 10.1101/cshperspect.a010405 23543032 PMC3632062 55. McKevitt T. Nasir L. Wallis C. Argyle D. A Cohort Study of Telomere and Telomerase Biology in Cats Am. J. Vet. Res. 2003 12 1496 1499 10.2460/ajvr.2003.64.1496 14672427 56. Brümmendorf T.H. Mak J. Sabo K.M. Baerlocher G.M. Dietz K. Abkowitz J.L. Lansdorp P.M. Longitudinal Studies of Telomere Length in Feline Blood Cells: Implications for Hematopoietic Stem Cell Turnover in Vivo Exp. Hematol. 2002 30 1147 1152 10.1016/S0301-472X(02)00888-3 12384145 57. Fick L.J. Fick G.H. Li Z. Cao E. Bao B. Heffelfinger D. Parker H.G. Ostrander E.A. Riabowol K. Telomere Length Correlates with Life Span of Dog Breeds Cell Rep. 2012 2 1530 1536 10.1016/j.celrep.2012.11.021 23260664 58. Greenberg R.A. Allsopp R.C. Chin L. Morin G.B. DePinho R.A. Expression of Mouse Telomerase Reverse Transcriptase during Development, Differentiation and Proliferation Oncogene 1998 16 1723 1730 10.1038/sj.onc.1201933 9582020 59. Wu K.-J. Grandori C. Amacker M. Simon-Vermot N. Polack A. Lingner J. Dalla-Favera R. Direct Activation of TERT Transcription by C-MYC Nat. Genet. 1999 21 220 224 10.1038/6010 9988278 60. Pavel M. Renna M. Park S.J. Menzies F.M. Ricketts T. Füllgrabe J. Ashkenazi A. Frake R.A. Lombarte A.C. Bento C.F. Contact Inhibition Controls Cell Survival and Proliferation via YAP/TAZ-Autophagy Axis Nat. Commun. 2018 9 2961 10.1038/s41467-018-05388-x 30054475 PMC6063886 61. Hanahan D. Hallmarks of Cancer: New Dimensions Cancer Discov. 2022 12 31 46 10.1158/2159-8290.CD-21-1059 35022204 62. Heimann R. Rice R.H. Rat Esophageal and Epidermal Keratinocytes: Intrinsic Differences in Culture and Derivation of Continuous Lines J. Cell Physiol. 1983 117 362 367 10.1002/jcp.1041170311 6197421 63. Zhao X. Zhao Q. Luo Z. Yu Y. Xiao N.A. Sun X. Cheng L. Spontaneous Immortalization of Mouse Liver Sinusoidal Endothelial Cells Int. J. Mol. Med. 2015 35 617 624 10.3892/ijmm.2015.2067 25585915 PMC4314414 64. Hassan B.B. Elshafae S.M. Supsavhad W. Simmons J.K. Dirksen W.P. Sokkar S.M. Rosol T.J. Feline Mammary Cancer: Novel Nude Mouse Model and Molecular Characterization of Invasion and Metastasis Genes Vet. Pathol. 2017 54 32 43 10.1177/0300985816650243 27281014 PMC7212821 65. Chen C. Lin W. Huang Y. Chen X. Wang H. Teng L. The Essential Factors of Establishing Patient-Derived Tumor Model J. Cancer 2021 12 28 10.7150/jca.51749 33391400 PMC7738839 66. Rangarajan A. Hong S.J. Gifford A. Weinberg R.A. Species-and Cell Type-Specific Requirements for Cellular Transformation Cancer Cell 2013 3 171 183 10.1016/j.ccr.2013.08.028 15324700 67. Hahn W.C. Dessain S.K. Brooks M.W. King J.E. Elenbaas B. Sabatini D.M. DeCaprio J.A. Weinberg R.A. Enumeration of the Simian Virus 40 Early Region Elements Necessary for Human Cell Transformation Mol. Cell Biol. 2002 22 2111 2123 10.1128/MCB.22.7.2111-2123.2002 11884599 PMC133688 68. Firsanov D. Zacher M. Tian X. Zhao Y. George J.C. Sformo T.L. Ali Biashad S. Gilman A. Hamilton N. Patel A. DNA Repair and Anti-Cancer Mechanisms in the Longest-Living Mammal: The 1 Bowhead Whale 2 3 BioRxiv 2023 10.1101/2023.05.07.539748 69. Vincze O. Colchero F. Lemaître J.F. Conde D.A. Pavard S. Bieuville M. Urrutia A.O. Ujvari B. Boddy A.M. Maley C.C. Cancer Risk across Mammals Nature 2022 601 263 267 10.1038/s41586-021-04224-5 34937938 PMC8755536 70. Eun K. Park M.G. Jeong Y.W. Jeong Y.I. Hyun S.H. Hwang W.S. Kim S.H. Kim H. Establishment of TP53-Knockout Canine Cells Using Optimized CRIPSR/Cas9 Vector System for Canine Cancer Research BMC Biotechnol. 2019 19 1 10.1186/s12896-018-0491-5 30606176 PMC6318917 71. Yelle J. Lussier G. Pramatarova A. Hamelin C. Low Tumorigenicity of Canine Cells Transformed by the Human Cytomegalovirus Biol. Cell 1990 70 9 18 10.1016/0248-4900(90)90355-7 1964816 72. Geder L. Lausch R. O’Neill F. Rapp F. Oncogenic Transformation of Human Embryo Lung Cells by Human Cytomegalovirus Science (1979) 1976 192 1134 1137 10.1126/science.179143 179143 73. Morel A.P. Hinkal G.W. Thomas C. Fauvet F. Courtois-Cox S. Wierinckx A. Devouassoux-Shisheboran M. Treilleux I. Tissier A. Gras B. EMT Inducers Catalyze Malignant Transformation of Mammary Epithelial Cells and Drive Tumorigenesis towards Claudin-Low Tumors in Transgenic Mice PLoS Genet. 2012 8 e1002723 10.1371/journal.pgen.1002723 22654675 PMC3359981 74. Meyers J. Craig J. Odde D.J.J. Potential for Control of Signaling Pathways via Cell Size and Shape Curr. Biol. 2006 16 1685 1693 10.1016/j.cub.2006.07.056 16950104 75. De Belly H. Stubb A. Yanagida A. Labouesse C. Jones P.H. Paluch E.K. Chalut K.J. Membrane Tension Gates ERK-Mediated Regulation of Pluripotent Cell Fate Cell Stem Cell 2021 28 273 284.e6 10.1016/j.stem.2020.10.018 33217323 PMC7875115 76. Wrzesinski K. Rogowska-Wrzesinska A. Kanlaya R. Borkowski K. Schwämmle V. Dai J. Joensen K.E. Wojdyla K. Carvalho V.B. Fey S.J. The Cultural Divide: Exponential Growth in Classical 2D and Metabolic Equilibrium in 3D Environments PLoS ONE 2014 9 e106973 10.1371/journal.pone.0106973 25222612 PMC4164521 77. Zhao Z. Chen X. Dowbaj A.M. Sljukic A. Bratlie K. Lin L. Fong E.L.S. Balachander G.M. Chen Z. Soragni A. Organoids Nat. Rev. Methods Primers 2022 2 94 10.1038/s43586-022-00174-y 37325195 PMC10270325 78. McKee C. Chaudhry G.R. Advances and Challenges in Stem Cell Culture Colloids Surf. B Biointerfaces 2017 159 62 77 10.1016/j.colsurfb.2017.07.051 28780462 79. Cocola C. Molgora S. Piscitelli E. Veronesi M.C. Greco M. Bragato C. Moro M. Crosti M. Gray B. Milanesi L. FGF2 and EGF Are Required for Self-Renewal and Organoid Formation of Canine Normal and Tumor Breast Stem Cells J. Cell Biochem. 2017 118 570 584 10.1002/jcb.25737 27632571 80. Sato T. Vries R.G. Snippert H.J. Van De Wetering M. Barker N. Stange D.E. Van Es J.H. Abo A. Kujala P. Peters P.J. Single Lgr5 Stem Cells Build Crypt-Villus Structures in Vitro without a Mesenchymal Niche Nature 2009 459 262 265 10.1038/nature07935 19329995 81. Sato T. Clevers H. Growing Self-Organizing Mini-Guts from a Single Intestinal Stem Cell: Mechanism and Applications Science 2013 340 1190 1194 10.1126/science.1234852 23744940 82. Kessler M. Hoffmann K. Brinkmann V. Thieck O. Jackisch S. Toelle B. Berger H. Mollenkopf H.J. Mangler M. Sehouli J. The Notch and Wnt Pathways Regulate Stemness and Differentiation in Human Fallopian Tube Organoids Nat. Commun. 2015 6 8989 10.1038/ncomms9989 26643275 PMC4686873 83. Lancaster M.A. Renner M. Martin C.A. Wenzel D. Bicknell L.S. Hurles M.E. Homfray T. Penninger J.M. Jackson A.P. Knoblich J.A. Cerebral Organoids Model Human Brain Development and Microcephaly Nature 2013 501 373 379 10.1038/nature12517 23995685 PMC3817409 84. Sutherland R.M. McCredie J.A. Inch W.R. Growth of Multicell Spheroids in Tissue Culture as a Model of Nodular Carcinomas2 J. Natl. Cancer Inst. 1971 46 113 120 10.1093/jnci/46.1.113 5101993 85. Hainline K.M. Gu F. Handley J.F. Tian Y.F. Wu Y. de Wet L. Vander Griend D.J. Collier J.H. Self-Assembling Peptide Gels for 3D Prostate Cancer Spheroid Culture Macromol. Biosci. 2019 19 e1800249 10.1002/mabi.201800249 30324687 PMC6333502 86. Dorrigiv D. Goyette P.A. St-Georges-Robillard A. Mes-Masson A.M. Gervais T. Pixelated Microfluidics for Drug Screening on Tumour Spheroids and Ex Vivo Microdissected Tumour Explants Cancers 2023 15 1060 10.3390/cancers15041060 36831403 PMC9954565 87. Petersen O.W. R0nnov-Jessen L. Howlettt A.R. Bissellt M.J. Interaction with Basement Membrane Serves to Rapidly Distinguish Growth and Differentiation Pattern of Normal and Malignant Human Breast Epithelial Cells (Extracelular Matrix/Rapid Transformation Assay/Breast Cancer/Tissue Structure and Function) Proc. Natl. Acad. Sci. USA 1992 89 9064 9068 10.1073/pnas.89.19.9064 1384042 PMC50065 88. Inglebert M. Dettwiler M. Hahn K. Letko A. Drogemuller C. Doench J. Brown A. Memari Y. Davies H.R. Degasperi A. A Living Biobank of Canine Mammary Tumor Organoids as a Comparative Model for Human Breast Cancer Sci. Rep. 2022 12 18051 10.1038/s41598-022-21706-2 36302863 PMC9614008 89. Elbadawy M. Fujisaka K. Yamamoto H. Tsunedomi R. Nagano H. Ayame H. Ishihara Y. Mori T. Azakami D. Uchide T. Establishment of an Experimental Model of Normal Dog Bladder Organoid Using a Three-Dimensional Culture Method Biomed. Pharmacother. 2022 151 113105 10.1016/j.biopha.2022.113105 35605292 90. Goldhammer N. Kim J. Timmermans-Wielenga V. Petersen O.W. Characterization of Organoid Cultured Human Breast Cancer Breast Cancer Res. 2019 21 141 10.1186/s13058-019-1233-x 31829259 PMC6907265 91. Schwerd-Kleine P. Würth R. Cheytan T. Michel L. Thewes V. Gutjahr E. Seker-Cin H. Kazdal D. Neuberth S.-J. Thiel V. Biopsy-Derived Organoids in Personalised Early Breast Cancer Care: Challenges of Tumour Purity and Normal Cell Overgrowth Cap Their Practical Utility Int. J. Cancer 2025 156 2200 2209 10.1002/ijc.35386 40022208 PMC11970545 92. Al-Hajj M. Wicha M.S. Benito-Hernandez A. Morrison S.J. Clarke M.F. Prospective Identification of Tumorigenic Breast Cancer Cells Proc. Natl. Acad. Sci. USA 2003 100 3983 3988 10.1073/pnas.0530291100 12629218 PMC153034 93. Singh S.K. Hawkins C. Clarke I.D. Squire J.A. Bayani J. Hide T. Henkelman R.M. Cusimano M.D. Dirks P.B. Identification of Human Brain Tumour Initiating Cells Nature 2004 432 396 401 10.1038/nature03128 15549107 94. Cocola C. Anastasi P. Astigiano S. Piscitelli E. Pelucchi P. Vilardo L. Bertoli G. Beccaglia M. Veronesi M.C. Sanzone S. Isolation of Canine Mammary Cells with Stem Cell Properties and Tumour-Initiating Potential Reprod. Domest. Anim. 2009 44 214 217 10.1111/j.1439-0531.2009.01413.x 19754572 95. Ward R.J. Dirks P.B. Cancer Stem Cells: At the Headwaters of Tumor Development Annu. Rev. Pathol. 2007 2 175 189 10.1146/annurev.pathol.2.010506.091847 18039097 96. Goldschneider D. Mehlen P. Dependence Receptors: A New Paradigm in Cell Signaling and Cancer Therapy Oncogene 2010 29 1865 1882 10.1038/onc.2010.13 20173780 97. Norval M. Maingay J. Else R.W. Characteristics of a Feline Mammary Carcinoma Cell Line Res. Vet. Sci. 1985 2 157 164 10.1016/S0034-5288(18)31739-9 3906801 98. Minke J.M. Schuuring E. van den Berghe R. Stolwijk J.A. Boonstra J. Cornelisse C. Hilkens J. Misdorp W. Isolation of Two Distinct Epithelial Cell Lines from a Single Feline Mammary Carcinoma with Different Tumorigenic Potential in Nude Mice and Expressing Different Levels of Epidermal Growth Factor Receptors Cancer Res. 1991 51 4028 4037 1649697 99. Kruitwagen H.S. Oosterhoff L.A. Vernooij I.G.W.H. Schrall I.M. van Wolferen M.E. Bannink F. Roesch C. van Uden L. Molenaar M.R. Helms J.B. Long-Term Adult Feline Liver Organoid Cultures for Disease Modeling of Hepatic Steatosis Stem Cell Rep. 2017 8 822 830 10.1016/j.stemcr.2017.02.015 PMC5390114 28344000 100. Haaker M.W. Kruitwagen H.S. Vaandrager A.B. Houweling M. Penning L.C. Molenaar M.R. van Wolferen M.E. Oosterhoff L.A. Spee B. Helms J.B. Identification of Potential Drugs for Treatment of Hepatic Lipidosis in Cats Using an in Vitro Feline Liver Organoid System J. Vet. Intern. Med. 2020 34 132 138 10.1111/jvim.15670 31830357 PMC6979087 101. Tekes G. Ehmann R. Boulant S. Stanifer M.L. Development of Feline Ileum-and Colon-Derived Organoids and Their Potential Use to Support Feline Coronavirus Infection Cells 2020 9 2085 10.3390/cells9092085 32932592 PMC7563363 102. van der Burg B. van Selm-Miltenburg A.J. van Maurik P. Rutteman G.R. Misdorp W. de Laat S.W. van Zoelen E.J. Isolation of Autonomously Growing Dog Mammary Tumor Cell Lines Cultured in Medium Supplemented with Serum Treated to Inactivate Growth Factors J. Natl. Cancer Inst. 1989 81 1545 1551 10.1093/jnci/81.20.1545 2795680 103. Priosoeryanto B.P. Tateyama S. Yamaguchi R. Uchida K. Establishment of a Cell Line (MCM-B2) from a Benign Mixed Tumour of Canine Mammary Gland Res. Vet. Sci. 1995 58 272 276 10.1016/0034-5288(95)90116-7 7659855 104. Hellmén E. Characterization of Four in Vitro Established Canine Mammary Carcinoma and One Atypical Benign Mixed Tumor Cell Lines Vitr. Cell Dev. Biol. 1992 28 309 319 10.1007/BF02877054 1375928 105. Uyama R. Nakagawa T. Hong S.-H. Mochizuki M. Nishimura R. Sasaki N. Establishment of Four Pairs of Canine Mammary Tumour Cell Lines Derived from Primary and Metastatic Origin and Their E-Cadherin Expression Vet. Comp. Oncol. 2006 4 104 113 10.1111/j.1476-5810.2006.00098.x 19754820 106. Caceres S. Peña L. DeAndres P.J. Illera M.J. Lopez M.S. Woodward W.A. Reuben J.M. Illera J.C. Establishment and Characterization of a New Cell Line of Canine Inflammatory Mammary Cancer: IPC-366 PLoS ONE 2015 10 e0122277 10.1371/journal.pone.0122277 25807360 PMC4373858 107. Mei C. Xin L. Liu Y. Lin J. Xian H. Zhang X. Hu W. Xia Z. Wang H. Lyu Y. Establishment of a New Cell Line of Canine Mammary Tumor CMT-1026 Front. Vet. Sci. 2021 8 744032 10.3389/fvets.2021.744032 34712723 PMC8546253 108. Li R. Wu H. Sun Y. Zhu J. Tang J. Kuang Y. Li G. A Novel Canine Mammary Cancer Cell Line: Preliminary Identification and Utilization for Drug Screening Studies Front. Vet. Sci. 2021 8 665906 10.3389/fvets.2021.665906 34124226 PMC8191460 109. Yeom J. Cho Y. Ahn S. Jeung S. Anticancer Effects of Alpelisib on PIK3CA-Mutated Canine Mammary Tumor Cell Lines Front. Vet. Sci. 2023 10 1279535 10.3389/fvets.2023.1279535 38033642 PMC10684731 110. Park S.Y. Baek Y.B. Lee C.H. Kim H.J. Kim H.P. Jeon Y.J. Song J.E. Jung S.B. Kim H.J. Moon K.S. Establishment of Canine Mammary Gland Tumor Cell Lines Harboring PI3K/Akt Activation as a Therapeutic Target BMC Vet. Res. 2024 20 233 10.1186/s12917-024-04085-w 38807154 PMC11134682 111. Borges A. Adega F. Chaves R. Establishment and Characterization of a New Feline Mammary Cancer Cell Line, FkMTp Cytotechnology 2016 68 1529 1543 10.1007/s10616-015-9912-7 26883919 PMC4960199 112. Granados-Soler J.L. Junginger J. Hewicker-Trautwein M. Bornemann-Kolatzki K. Beck J. Brenig B. Betz D. Schille J.T. Murua Escobar H. Nolte I. TiHo-0906: A New Feline Mammary Cancer Cell Line with Molecular, Morphological, and Immunocytological Characteristics of Epithelial to Mesenchymal Transition Sci. Rep. 2018 8 13231 10.1038/s41598-018-31682-1 30185896 PMC6125410 113. Correia A.S. Matos R. Gärtner F. Amorim I. Vale N. High Drug Resistance in Feline Mammary Carcinoma Cell Line (FMCm) and Comparison with Human Breast Cancer Cell Line (MCF-7) Animals 2021 11 2321 10.3390/ani11082321 34438778 PMC8388478 114. Von Hoff D.D. Casper J. Bradley E. Sandbach J. Jones D. Makuch R. Association between Human Tumor Colony-Forming Assay Results and Response of an Individual Patient’s Tumor to Chemotherapy Am. J. Med. 1981 70 1027 1032 10.1016/0002-9343(81)90859-7 7234870 115. Geevimaan K. Guo J.-Y. Shen C.-N. Jiang J.-K. Fann C.S.J. Hwang M.-J. Shui J.-W. Lin H.-T. Wang M.-J. Shih H.-C. Patient-Derived Organoid Serves as a Platform for Personalized Chemotherapy in Advanced Colorectal Cancer Patients Front. Oncol. 2022 12 883437 10.3389/fonc.2022.883437 35719949 PMC9205170 116. Maeda M. Ochiai K. Michishita M. Morimatsu M. Sakai H. Kinoshita N. Sakaue M. Onozawa E. Azakami D. Yamamoto M. In Vitro Anticancer Effects of Alpelisib against PIK3CA-mutated Canine Hemangiosarcoma Cell Lines Oncol. Rep. 2022 47 84 10.3892/or.2022.8295 35234262 PMC8908334 117. Granados-Soler J.L. Bornemann-Kolatzki K. Beck J. Brenig B. Schütz E. Betz D. Junginger J. Hewicker-Trautwein M. Escobar H.M. Nolte I. Analysis of Copy-Number Variations and Feline Mammary Carcinoma Survival Sci. Rep. 2020 10 1003 10.1038/s41598-020-57942-7 31969654 PMC6976565 118. Kruczynski A. Kiss R. Evidence of a Direct Relationship between the Increase in the in Vitro Passage Number of Human Non-Small-Cell-Lung Cancer Primocultures and Their Chemosensitivity Lung Cancer 1994 10 418 10.1016/0169-5002(94)90854-0 7685990 119. Gameiro A. Nascimento C. Correia J. Ferreira F. HER2-Targeted Immunotherapy and Combined Protocols Showed Promising Antiproliferative Effects in Feline Mammary Carcinoma Cell-Based Models Cancers 2021 13 2007 10.3390/cancers13092007 33919468 PMC8122524 120. Gradauskaite V. Inglebert M. Doench J. Scherer M. Dettwiler M. Wyss M. Shrestha N. Rottenberg S. Plattet P. LRP6 Is a Functional Receptor for Attenuated Canine Distemper Virus mBio 2023 14 e0311422 10.1128/mbio.03114-22 36645301 PMC9973313 121. Inglebert M. Dettwiler M. He C. Markkanen E. Opitz L. Naguleswaran A. Rottenberg S. Individualized Pooled CRISPR/Cas9 Screenings Identify CDK2 as a Druggable Vulnerability in a Canine Mammary Carcinoma Patient Vet. Sci. 2025 12 183 10.3390/vetsci12020183 40005944 PMC11861728 122. Cocco S. Piezzo M. Calabrese A. Cianniello D. Caputo R. Di Lauro V. Fusco G. di Gioia G. Licenziato M. de Laurentiis M. Biomarkers in Triple-Negative Breast Cancer: State-of-the-Art and Future Perspectives Int. J. Mol. Sci. 2020 21 4579 10.3390/ijms21134579 32605126 PMC7369987 123. Wiese D.A. Thaiwong T. Yuzbasiyan-Gurkan V. Kiupel M. Feline Mammary Basal-like Adenocarcinomas: A Potential Model for Human Triple-Negative Breast Cancer (TNBC) with Basal-like Subtype BMC Cancer 2013 13 403 10.1186/1471-2407-13-403 24004841 PMC3849986 124. Govoni V.M. Da Silva T.C. Guerra J.M. Pereira I.V.A. Queiroga F.L. Cogliati B. Genetic Variants of BRCA1 and BRCA2 Genes in Cats with Mammary Gland Carcinoma Vet. Comp. Oncol. 2021 19 404 408 10.1111/vco.12685 33576549 125. Meijer T.G. Nguyen L. Van Hoeck A. Sieuwerts A.M. Verkaik N.S. Ladan M.M. Ruigrok-Ritstier K. van Deurzen C.H.M. van de Werken H.J.G. Lips E.H. Functional RECAP (REpair CAPacity) Assay Identifies Homologous Recombination Deficiency Undetected by DNA-Based BRCAness Tests Oncogene 2022 41 3498 3506 10.1038/s41388-022-02363-1 35662281 PMC9232391 126. Duarte A.A. Gogola E. Sachs N. Barazas M. Annunziato S. De Ruiter J.R. Velds A. Blatter S. Houthuijzen J.M. Van De Ven M. BRCA-Deficient Mouse Mammary Tumor Organoids to Study Cancer-Drug Resistance Nat. Methods 2018 15 134 140 10.1038/nmeth.4535 29256493 127. Mcmillin D.W. Negri J.M. Mitsiades C.S. The Role of Tumour-Stromal Interactions in Modifying Drug Response: Challenges and Opportunities Nat. Rev. Drug Discov. 2013 12 217 228 10.1038/nrd3870 23449307 128. Pulz L.H. Cordeiro Y.G. Huete G.C. Cadrobbi K.G. Rochetti A.L. Xavier P.L.P. Nishiya A.T. de Freitas S.H. Fukumasu H. Strefezzi R.F. Intercellular Interactions between Mast Cells and Stromal Fibroblasts Obtained from Canine Cutaneous Mast Cell Tumours Sci. Rep. 2021 11 23881 10.1038/s41598-021-03390-w 34903806 PMC8668961 129. Majety M. Pradel L.P. Gies M. Ries C.H. Fibroblasts Influence Survival and Therapeutic Response in a 3D Co-Culture Model PLoS ONE 2015 10 e0127948 10.1371/journal.pone.0127948 26053043 PMC4460080 130. Richter A. Feßler A.T. Böttner A. Köper L.M. Wallmann J. Schwarz S. Reasons for Antimicrobial Treatment Failures and Predictive Value of In-Vitro Susceptibility Testing in Veterinary Practice: An Overview Vet. Microbiol. 2020 245 108694 10.1016/j.vetmic.2020.108694 32456814 131. Lorian V. Burns L. Predictive Value of Susceptibility Tests for the Outcome of Antibacterial Therapy J. Antimicrob. Chemother. 1990 25 175 181 10.1093/jac/25.1.175 2318750 132. Jia Q. Chu H. Jin Z. Long H. Zhu B. High-Throughput Single-Cell Sequencing in Cancer Research Signal Transduct. Target. Ther. 2022 7 145 10.1038/s41392-022-00990-4 35504878 PMC9065032 Figure 1 Comparison of cell behavior in conventional adherent 2D culture. ( a b c Figure 2 Conceptual comparison of organoid and spheroid models. ( a b c b c Figure 3 Summary of the challenges that need to be addressed to improve the predictivity of 3D tumoroids in mammary tumors. ",
  "metadata": {
    "Title of this paper": "High-Throughput Single-Cell Sequencing in Cancer Research",
    "Journal it was published in:": "Veterinary Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474302/"
  }
}