{
  "title": "Paper_159",
  "abstract": "Toxicol Res (Camb) Toxicol Res (Camb) 3424 toxicolres toxres Toxicology Research 2045-452X 2045-4538 Oxford University Press PMC11447380 PMC11447380.1 11447380 11447380 39371682 10.1093/toxres/tfae161 tfae161 1 Paper AcademicSubjects/MED00305 AcademicSubjects/SCI01040 Transcriptomic analysis reveals transcription factors implicated in radon-induced lung carcinogenesis https://orcid.org/0000-0002-0540-3912 Liu Xing  School of public health, Yangzhou University No. 136, Jiangyang Middle Road, Hanjiang District, Yangzhou 225009 China https://orcid.org/0000-0002-8310-0298 Peng Yuting  School of public health, Yangzhou University No. 136, Jiangyang Middle Road, Hanjiang District, Yangzhou 225009 China Chen Ruobing  School of public health, Yangzhou University No. 136, Jiangyang Middle Road, Hanjiang District, Yangzhou 225009 China Zhou Yueyue  School of public health, Yangzhou University No. 136, Jiangyang Middle Road, Hanjiang District, Yangzhou 225009 China Zou Xihuan  School of public health, Yangzhou University No. 136, Jiangyang Middle Road, Hanjiang District, Yangzhou 225009 China Xia Mingzhu  School of public health, Yangzhou University No. 136, Jiangyang Middle Road, Hanjiang District, Yangzhou 225009 China Wu Xinyi  School of public health, Yangzhou University No. 136, Jiangyang Middle Road, Hanjiang District, Yangzhou 225009 China Yu Meng  Department of Otorhinolaryngology-Head and Neck Surgery, The Affiliated Hospital of Yangzhou University No. 368, hanjiang Middle Road, Hanjiang District, Yangzhou 225009 China Corresponding author: Department of Otorhinolaryngology-Head and Neck Surgery, The Affiliated Hospital of Yangzhou University, Yangzhou University, Yangzhou 225009, China. Email: yumeng@yzu.edu.cn Xing Liu and Yuting Peng contributed equally to this work. 10 2024 03 10 2024 13 5 469875 tfae161 14 2 2024 04 9 2024 24 9 2024 03 10 2025 03 10 2025 04 10 2024 03 10 2025 © The Author(s) 2024. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com 2024 https://academic.oup.com/pages/standard-publication-reuse-rights This article is published and distributed under the terms of the Oxford University Press, Standard Journals Publication Model ( https://academic.oup.com/pages/standard-publication-reuse-rights Abstract Background Radon, a potent carcinogen, is a significant catalyst for lung cancer development. However, the molecular mechanisms triggering radon-induced lung cancer remain elusive. Methods Utilizing a radon exposure concentration of 20,000 Bq/m3 for 20 min/session, malignant transformation was induced in human bronchial epithelial cells (BEAS-2B). Results Radon-exposed cells derived from passage 25 (BEAS-2B-Rn) exhibited enhanced proliferation and increased colony formation. Analysis of differential gene expression (DEG) through transcription factors revealed 663 up-regulated and 894 down-regulated genes in radon-exposed cells. Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) analyses revealed significant alterations in the malignant transformation pathway of cells, including those related to cancer and the PI3K/AKT signaling pathway. A PPI network analysis indicated a significant association of oncogenes, such as CCND1, KIT, and GATA3, with lung cancer among differentially expressed genes. In addition, the stability of the housekeeping gene was determined through RT-qPCR analysis, which also confirmed the results of transcriptome analysis. Conclusions The results suggest that transcription factors may play a pivotal role in conferring a survival advantage to radon-exposed cells. This is achieved by malignant transformation of human bronchial epithelial cells into lung carcinogenesis cell phenotypes. Radon exposure differentially expressed genes bioinformatics analysis pathogenic genes National Natural Science Foundation of China 10.13039/501100001809 81903357 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Transcriptomic analysis reveals transcription factors implicated in radon-induced lung carcinogenesis",
    "Journal it was published in:": "Toxicology Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11447380/"
  }
}