{
  "title": "Paper_509",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12484136 PMC12484136.1 12484136 12484136 41041318 10.3389/fimmu.2025.1630781 1 Immunology Perspective Correlation does not equal causation: the imperative of causal inference in machine learning models for immunotherapy Wang Jia-Wen  1 Meng Meng  2  * Dai Mu-Wei  1 Liang Ping  2 Hou Juan  2  1 Department of Orthopedics, The Fourth Hospital of Hebei Medical University Shijiazhuang, Hebei China  2 Department of Pharmacy, the Fourth Hospital of Hebei Medical University Shijiazhuang, Hebei China Edited by: Vera Rebmann Reviewed by: Paola Lecca *Correspondence: Meng Meng, 48801671@hebmu.edu.cn 17 9 2025 2025 16 480569 1630781 18 5 2025 01 9 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Wang, Meng, Dai, Liang and Hou. 2025 Wang, Meng, Dai, Liang and Hou https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Machine learning (ML) has played a crucial role in advancing precision immunotherapy by integrating multi-omics data to identify biomarkers and predict therapeutic responses. However, a prevalent methodological flaw persists in immunological studies—an overreliance on correlation-based analysis while neglecting causal inference. Traditional ML models struggle to capture the intricate dynamics of immune interactions and often function as “black boxes.” A systematic review of 90 studies on immune checkpoint inhibitors revealed that despite employing ML or deep learning techniques, none incorporated causal inference. Similarly, all 36 retrospective studies modeling melanoma exhibited the same limitation. This “knowledge–practice gap” highlights a disconnect: although researchers acknowledge that correlation does not imply causation, causal inference is often omitted in practice. Recent advances in causal ML, like Targeted-BEHRT, CIMLA, and CURE, offer promising solutions. These models can distinguish genuine causal relationships from spurious correlations, integrate multimodal data—including imaging, genomics, and clinical records—and control for unmeasured confounders, thereby enhancing model interpretability and clinical applicability. Nevertheless, practical implementation still faces major challenges, including poor data quality, algorithmic opacity, methodological complexity, and interdisciplinary communication barriers. To bridge these gaps, future efforts must focus on advancing research in causal ML, developing platforms such as the Perturbation Cell Atlas and federated causal learning frameworks, and fostering interdisciplinary training programs. These efforts will be essential to translating causal ML from theoretical innovation to clinical reality in the next 5-10 years—representing not only a methodological upgrade, but also a paradigm shift in immunotherapy research and clinical decision-making. causal inference machine learning immunotherapy immune checkpoint inhibitors confounding bias treatment effect estimation multimodal data integration precision medicine The author(s) declare financial support was received for the research and/or publication of this article. This work was supported by the Key Research Project Plan of Hebei Provincial Medical Science Research (20230962). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Cancer Immunity and Immunotherapy 1 Introduction Machine learning (ML) technologies have played a pivotal role in advancing precision immunotherapy by integrating multi-omics data to identify biomarkers, predict treatment responses, discover novel therapeutic targets ( 1 2 3 4 5 6 7 Despite broad recognition that “correlation ≠ causation” is a fundamental statistical principle, this distinction is frequently overlooked in practice. A systematic review of 90 studies on immune checkpoint inhibitors (ICIs) revealed that while 72% employed traditional ML and 22% used deep learning, none incorporated causal inference. Consequently, these models were not included in phase III clinical trial designs or referenced in major clinical guidelines ( 8 9 10 This disconnect between knowledge and practice highlights a broader issue in immunology research—an overreliance on digital correlations. Researchers may acknowledge the importance of causality but are deterred from applying causal frameworks due to the intrinsic complexity of immunological data. High-dimensional, noisy, and temporally dynamic immune responses, combined with treatment-induced nonlinear effects and substantial interindividual heterogeneity (across genotype, phenotype, and microenvironment), pose significant challenges to conventional causal inference methods ( 11 14 Fortunately, recent methodological advances have made the integration of causal inference and ML increasingly feasible. For example, the Targeted-BEHRT model combines transformer architecture with doubly robust estimation to infer long-term treatment effects from longitudinal, high-dimensional data ( 15 16 17 18 19 20 These innovations represent a confluence of causal reasoning and machine learning methodologies ( 21 22 23 24 25 26 27 28 This Perspective aims to systematically highlight the paradigm-shifting value of causal machine learning in immunological research. We focus on the following key questions (  Figure 1 Figure 1 Transitioning from the correlation trap to the causal paradigm in immunotherapy machine learning. This figure illustrates the urgent need and conceptual roadmap for transitioning machine learning applications in immunotherapy research from correlation-based analyses to causal inference frameworks. The left red module highlights critical issues in current practice: among 90 ICI (immune checkpoint inhibitor) studies, none incorporated causal inference; the hazard ratio (HR) for immune-related adverse events (irAEs) shifted from 0.37 to 1.02 after causal bias correction, underscoring the misleading nature of pure correlational analysis. Moreover, some models were excluded from Phase III clinical trials due to a lack of causal validation. The central green bridge represents the solution offered by causal machine learning (Causal ML), characterized by three key strengths: identifying true causal effects, integrating multimodal data (genomics, imaging, and clinical records), and providing interpretable mechanistic insights. The right blue module envisions future breakthroughs over the next 5-10 years, including the development of the Perturbation Cell Atlas, federated causal learning approaches, and eventual clinical translation. The cliff–bridge–shoreline metaphor visually encapsulates the methodological leap required to shift from flawed analytics to a robust scientific paradigm. Flowchart titled “From Correlation Trap to Causal Paradigm in Immunotherapy Machine Learning” showing three stages. “Correlation Trap” with issues like 90 studies, no causality, and Phase III trial exclusion. “Causal ML” includes true causal effects and multi-modal integration. “Clinical Future” mentions Perturbation Cell Atlas and Clinical Translation. A diagram below illustrates transitioning from the trap to causal ML via a bridge. 1. Pitfalls of correlation-based approaches 2. Unique advantages of causal ML 3. Implementation challenges 4. Future directions 2 Misconceptions in immunological research: equating correlation with causation In current immunotherapeutic research, traditional machine learning (ML) models primarily rely on retrospective data mining of correlations ( 29 30 31 32 Moreover, the insufficient recognition of the importance of causal inference among researchers ( 33 34 35 36 37 38 39 Therefore, neglecting causal inference not only compromises the reliability of study results ( 40 41 43 44 45 Although the importance of causal inference has been increasingly recognized in clinical research, many studies still rely on conventional causal inference methods, which face significant challenges in practice. Randomized controlled trials (RCTs) are often infeasible due to high costs, ethical constraints, and heterogeneity among patients ( 46 47 8 48 49 50 52   Table 1  Table 2 Table 1 Representative bias cases in immune studies dominated by correlation-based machine learning. Study & Year Correlation-based ML/ statistical approach Identified bias Evidence Ref. Zhang et al., 2023 Cross-cohort Random Forest / SVM in microbiota-ICI response review Antibiotic use, dietary/geographic differences, sequencing batch effects Among 27 studies, only 4 cross-validated the same strains; conclusions showed high heterogeneity, possibly leading to the erroneous rejection or overpromotion of specific microbial therapies. ( 31 Pichler et al., 2025 Early studies used Cox/log-rank; this study used Target Trial Emulation (TTE) Immortal time bias (irAEs occur only in survivors) Conventional analysis showed HR = 0.37, but TTE-corrected HR = 1.02, overturning the “irAE improves prognosis” claim; without correction, irAE benefits may be exaggerated, misleading dose management. ( 32 Eng et al., 2023 Population database with Cox + PSM to assess antibiotic exposure on ICI outcomes Confounding by infection severity, concomitant medications, baseline ECOG status Although HR ≈ 1.3 was statistically significant, authors acknowledged \"residual unmeasured confounding\"; could mislead clinicians into believing all antibiotics are harmful, leading to inappropriate withdrawal. ( 38 Sako et al., 2024 3D ResNet + multitask deep learning for CT-based ICI efficacy prediction Tumor burden, treatment line, imaging device heterogeneity Reported AUC ≈ 0.71; authors emphasized the need for prospective validation, warning that tumor size/stage signals may be misinterpreted as drug sensitivity, affecting patient stratification. ( 39 ML, machine learning; ICI, immune checkpoint inhibitor; irAE, immune-related adverse event; HR, hazard ratio; TTE, target trial emulation; PSM, propensity score matching; ECOG, Eastern Cooperative Oncology Group performance status; AUC, area under the receiver operating characteristic curve. This table presents representative cases from four high-impact areas of immunological research—microbiome, survival analysis, drug exposure, and radiomics—demonstrating how correlation-based approaches can lead to misleading interpretations when causal inference is neglected. Table 2 Limitations of traditional causal inference methods in immune-related studies. Traditional method Core mechanism Limitations Ref. Randomized Controlled Trial (RCT) Eliminates both observed and unobserved confounding via random allocation High cost and ethical concerns; significant patient heterogeneity; multi-arm RCTs are impractical for ICI combination and dynamic exposures ( 11 46 Stratified/Blocked Design Predefined stratification based on limited covariates High-dimensional omics (>10 4 ( 47 100 Multivariable Regression Adjustment Uses linear/generalized linear models to control covariates Requires correct model specification; immune nonlinearity and interaction effects are easily mis-specified ( 47 100 Propensity Score Matching / Inverse Probability Weighting (PSM/IPW) Balances observed covariates through a single score Relies on the “no unmeasured confounding” assumption; unstable in high-dimensional settings; 72% of 90 ICI studies still rely on PSM or correlative ML, lacking prospective design ( 8 9 Mendelian Randomization (MR) Uses germline genetic variants as instrumental variables to mimic natural randomization (1) Horizontal/related pleiotropy may violate exclusion restriction; (2) limited heritability of immune exposures → weak instruments; (3) lifetime average effects ≠ short-term drug effects; (4) population stratification and LD structure may introduce bias ( 50 52 RCT, randomized controlled trial; PSM, propensity score matching; IPW, inverse probability weighting; MR, Mendelian randomization; ICI, immune checkpoint inhibitor; LD, linkage disequilibrium. This table highlights the key limitations of five classical causal inference approaches when applied to high-dimensional, nonlinear, and heterogeneous data settings in immunotherapy research. 3 Unique advantages of causal inference machine learning models To overcome the limitations of both traditional causal inference and conventional machine learning approaches, causal inference-based machine learning (causal ML) models have emerged (  Figure 2 53 55 53 54 Figure 2 Integrating machine learning and causal inference: from predictive models to causal understanding. This figure illustrates the methodological evolution of machine learning from conventional predictive modeling toward causal inference. Traditional machine learning focuses on prediction and classification tasks without addressing underlying causal mechanisms. Causal machine learning integrates causal assumptions into data analysis to estimate true treatment effects. Causal forests extend random forests to enable estimation of heterogeneous treatment effects. Causal neural networks combine deep learning architectures with causal inference to model complex relationships. Together, these approaches bridge the gap between predictive accuracy and causal interpretability, providing a comprehensive analytical framework for immunotherapy research. Flowchart titled “Machine Learning and Causal Inference” with four blocks: “Traditional Machine Learning” for prediction and classification, “Causal Machine Learning” integrating causal assumptions, “Causal Forests” for heterogeneous treatment estimation, and “Causal Neural Networks” combining deep learning with causal inference. Caption explains extending machine learning to explore causal relationships. Moreover, causal ML enables multi-modal modeling by integrating imaging, text, time-series, and genomic data. For example, Clinical Transformer can fuse clinical records, laboratory metrics, and sequencing data. By leveraging counterfactual perturbation strategies, it achieved an improvement of 0.05-0.10 in C-index across seven cancer types ( 56 57 58 33 59 In contrast to conventional machine learning methods such as random forests, LASSO, or deep learning—models that rely solely on correlational pattern discovery—causal ML shifts the focus from predicting associations to identifying causality. For instance, the Super Learner ITE framework estimates individual treatment effects (ITE) through model ensembling, achieving an AUC of 0.77 in external validation, with decision curve analysis showing a significantly higher net clinical benefit compared to treat-all or SAPS-II strategies ( 60 55 Furthermore, causal ML effectively addresses key limitations of correlational models—namely spurious associations and confounding bias—by enabling robust control of unmeasured confounding ( 61 36 62 53 63 43 64 40 In addition, mechanism-aware causal ML approaches embed biological prior knowledge into model structures, achieving a unification of data-driven and mechanism-driven strategies—a closed loop between computation and experimentation ( 65 41 66 64 34   Table 3  Table 4 Table 3 Advantages of causal machine learning (causal ML) over traditional machine learning methods. Causal ML method Traditional method Limitations of traditional method Causal ML highlights Dataset / Scenario Performance gains Ref. CV-TMLE / DML Logistic regression + PSM Unstable estimation in high-dimensional covariates; model misspecification Super Learner ensemble + targeted updates; doubly robust COVID-19 ICU (n = 168): dexamethasone vs hydrocortisone on NLR 95% CI coverage ↑ by 10–20 percentage points; no bias increase ( 53 TMLE-SL / BART Multivariate linear regression Linear assumptions; manual interaction terms Model-agnostic; tree-/network-based flexible estimation COVID-19 ICU (n = 168): dexamethasone vs hydrocortisone on NLR CI width ↓ ≈12%; more stable estimates ( 101 Super Learner ITE SAPS-II rules / Treat-all Ignores patient heterogeneity; low net benefit in decision curves Direct ensemble estimation of individual treatment effects 4 septic shock steroid RCTs (training) + external RCT validation External AUC = 0.77; net benefit > Treat-all/SAPS-II strategies ( 60 Causal Forest / X-Learner Random forest / LASSO Only average treatment effects; heterogeneity missed Adaptive partitioning for CATE estimation MiCML: gut microbiota + ICI response (n = 128) Interaction effect error ↓ 25–40% ( 55 ANN-DML Estimator Kernel/spline nonparametric “Curse of dimensionality” Neural net approximates both treatment and outcome models Simulated immunomarker scenario with p → 2n MSE ↓ ≈30% ( 54 COCA (Negative Control Calibration) OLS / traditional sensitivity analysis Unmeasured confounding not identifiable Negative control outcome + doubly robust via Lavaan framework Education intervention + inflammation markers (simulation + real) Bias ≤ 40% of OLS estimate ( 62 Mechanistic Deep Learning End-to-end CNN/LSTM Lacks mechanistic interpretability; weak extrapolation Embeds ODE tumor-immune dynamics Mathematical tumor models + in vitro experiments RMSE ↓ 25%; reproducible via wet-lab validation ( 65 TNDDR (DML + Cross-fitting) Classic test-negative logit High-dimensional covariates inflate SE Doubly robust + cross-fitting Québec health records (age ≥60): COVID-19 vaccine effectiveness SE ↓ 26–67%; generalization improved ( 102 CV-TMLE, cross-validated targeted maximum likelihood estimation; DML, double machine learning; BART, Bayesian additive regression trees; ITE, individualized treatment effect; CATE, conditional average treatment effect; COCA, causal outcome calibration using negative control; OLS, ordinary least squares; TNDDR, test-negative design doubly robust estimator; CI, confidence interval; pp, percentage points; MSE, mean squared error; RMSE, root mean squared error; SE, standard error. Arrows: ↑ indicates increase/improvement; ↓ indicates reduction. This table summarizes eight representative Causal ML approaches, demonstrating their superiority over traditional methods in terms of robustness, flexibility, and capacity to handle high-dimensional, heterogeneous, and nonlinear immunological data. Table 4 Applications of multimodal causal ML: integrated modeling of imaging, omics, clinical, textual, and temporal data. Study & Year Data modalities Methodological mechanism Dataset / Application outcome Ref. Clinical Transformer, 2025 Clinical records + lab indices + DNA/RNA sequencing Transformer + self-attention; uses in silico counterfactual perturbations to explore immune benefit subgroups External validation across 7 cancer types; C-index ↑ 0.05–0.10; identified a cohort potentially benefiting from immunotherapy ( 56 MOFS Fusion Framework, 2025 MRI + digital pathology + genomics/transcriptomics/proteomics Deep feature fusion with explicit tracking of \"latent causal features\" Stratified 3 glioma subtypes; MOFS3 subtype most sensitive to anti–PD-1 therapy ( 57 MMF HCC, 2025 CT imaging + serum AFP / liver function / clinical phenotypes Residual-attention fusion; quantifies ICI benefit via individualized OS/PFS counterfactual contrasts C-index = 0.76 for ICI benefit prediction; HR = 2.44 in high-risk group ( 103 Bio-relevant AI (CRC II), 2025 CT radiomics + histopathology + gene expression + clinical stage Joint image-omics embedding + counterfactual risk difference for chemotherapy selection Helped 32% of stage II colorectal cancer patients avoid unnecessary chemotherapy; RA-net interpretability score ↑ ( 58 CRISP (ICU), 2025 Temporal vital signs + clinical notes + lab tests Native counterfactual generation + causal graph priors to address class imbalance AUROC = 0.90–0.95 across 3 centers; cross-domain generalization error ↓ 15% ( 104 C-index, concordance index; OS, overall survival; PFS, progression-free survival; HR, hazard ratio; AUROC, area under the receiver operating characteristic curve; AFP, alpha-fetoprotein; MOFS, multi-omics feature selection; MMF, multimodal fusion; HCC, hepatocellular carcinoma; CRC, colorectal cancer; CRISP, causal risk prediction in ICU; ICU, intensive care unit. Arrows: ↑ denotes improvement/increase; ↓ denotes reduction. This table illustrates how causal ML enables personalized treatment effect estimation by integrating multimodal data—spanning imaging, omics, clinical indicators, text, and temporal signals—across diverse immunotherapy-related scenarios. 3 Challenges in the application of causal inference machine learning models At the data acquisition level, the presence of inaccurate or incomplete data significantly hinders the implementation of causal inference models. In particular, measurement errors can amplify causal bias, thereby undermining the reliability of results ( 67 68 At the clinical application level, causal machine learning (Causal ML) models often exhibit a “black-box” nature, which severely limits clinician acceptance ( 69 70 71 At the research methodology level, both methodological selection difficulties and interdisciplinary collaboration barriers constrain the advancement of Causal ML in immunological research. Causal relationships vary in structure and often require tailored methods, yet the abundance of available approaches—each with unique limitations—makes optimal selection challenging, especially for researchers with limited formal training in causal modeling ( 33 72 73   Table 5 Table 5 Challenges and limitations in applying causal machine learning (causal ML) models in immunological research. Challenge Category Study focus Key findings Ref. Data Collection: Inaccuracy and Missingness HIV cohort: modeling measurement error and missingness as latent outcome missingness “All your data are always missing” demonstrates that observational data alone cannot validate causal assumptions; measurement error → information loss → biased ATE; highlights need for additional assumptions or sensitivity analyses in high-noise immunological datasets ( 67 Pediatric long-term medication study using graphical models to analyze missingness patterns In longitudinal pharmacokinetic data, if missing nodes violate identifiability conditions, no estimator can recover the true causal effect; emphasizes prior design and imputation strategy ( 68 Clinical Application: Lack of Model Interpretability Four clinical decision support scenarios comparing interpretable vs. non-interpretable models Summarizes seven dimensions of interpretability (e.g., stakeholder type, transparency-accuracy trade-off); concludes that complex causal models lacking clear explanation are difficult to integrate into clinical workflows ( 69 Review of Causal ML in precision medicine, including a section on explainability and regulatory barriers While causal graphs and deep models can address interventional questions, lack of clinician-facing visualization and auditing tools sustains “black-box” concerns ( 71 Methodological & Cross-Disciplinary Barriers Systematic evaluation of causal inference strategies (IV, RD, PS, G-methods); introduces “evidence triangulation” Many researchers lack training to choose appropriate methods; recommends triangulation and cross-disciplinary validation for greater robustness ( 105 Commentary on clinical research practice Cultural divides between epidemiology, statistics, and clinical medicine hinder communication; advocates for a unified vocabulary and collaborative platforms—still a major bottleneck in immunological causal research ( 72 ATE, average treatment effect; HIV, human immunodeficiency virus; IV, instrumental variable; RD, regression discontinuity; G-methods, graphical-based causal inference methods; HTA, health technology assessment. This table synthesizes three major classes of challenges faced when applying causal ML models to immunological studies: (1) data quality and missingness, (2) model interpretability and clinical adoption, and (3) methodological complexity and interdisciplinary barriers. 4 Discussion Over the next five years, addressing the two core challenges—data quality and model interpretability—will require the development of innovative technical solutions. In terms of data quality, the integration of multiple imputation with the G-formula has significantly reduced bias caused by missingness in cystic fibrosis studies ( 74 75 Regarding interpretability, studies have shown that Causal-XAI hybrid frameworks can generate causal attribution heatmaps, enabling physicians to better understand image-based decisions ( 76 77 78 79 80 81 82 In the next 5-10 years, methodological integration will become a central theme. The emerging “triangulation framework” will be more widely adopted. This framework enhances the robustness of causal inference by integrating and cross-validating multiple approaches such as instrumental variables (IVs), regression discontinuity (RD), and propensity scores ( 83 84 42 73 85 86 87 88 42 73 89 90 91 In the next 5-10 years, causal inference models are expected to be widely implemented in clinical immunology. One notable development is the “Perturbation Cell Atlas” proposed by Rood et al., which represents a conceptual turning point. Future research will likely build on this by leveraging large-scale CRISPR-scRNA-seq perturbation datasets to train and deploy foundational causal models for practical guidance ( 92 93 With the continued advancement of artificial intelligence, AI-assisted vaccine design is poised to become a prevailing trend. This will necessitate the use of target trial emulation, causal NLP, and federated causal estimation frameworks to identify causally relevant endpoints and accelerate critical discoveries ( 94 95 76 96 97 99   Table 6  Table 7 Table 6 Technical strategies addressing the three core challenges in causal machine learning (causal ML) applications. Challenge Solution strategy Supporting evidence Ref. Poor Data Quality (Missingness / Measurement Error) Multiple Imputation + G-formula: Integrates Bayesian multiple imputation into G-formula to simultaneously estimate counterfactuals and impute missing data Demonstrated in cystic fibrosis cohort to recover time-varying treatment effects and significantly reduce bias from missing data ( 74 MI-BART / GAM for multiple-treatment scenarios: Fits flexible models for each treatment arm and imputes all counterfactual outcomes MI-BART showed superior robustness and CI coverage over weighting/matching in multi-center readmission risk comparisons ( 75 Limited Clinical Interpretability Causal-XAI federated learning: Employs causal sparsity weights and blockchain validation for federated clinical feature attribution Heterogeneity-aware causal sparsity FL reduced communication cost (↓) and improved performance (↑), generating causal heatmaps interpretable to clinicians ( 76 CLARUS: An interactive counterfactual explanation platform allowing clinicians to explore GNN-based reasoning chains Combines manual and automated interfaces; enables expert manipulation and validation of reasoning paths to enhance model trust ( 77 Difficulty in Method Selection Evidence triangulation: Parallel use of IV, RD, propensity scores, and G-methods with cross-validation across designs Proposes “biased-but-directionally-consistent cross-validation” framework, emphasizing method and cohort consistency as a criterion for causal reliability ( 83 Interdisciplinary Collaboration Barriers Integration of Health Decision Science & Causal Inference: Aligns DAGs and decision models under shared HTA frameworks Highlights complementarity of causal inference and economic evaluation; provides joint workflow templates for epidemiology, economics, and clinical collaboration ( 84 MI-BART, multiple imputation with Bayesian additive regression trees; GAM, generalized additive model; XAI, explainable artificial intelligence; FL, federated learning; GNN, graph neural network; DAG, directed acyclic graph; HTA, health technology assessment. Arrows: ↑ indicates enhancement/improvement; ↓ indicates reduction. This table presents validated methodological solutions corresponding to the three core Causal ML challenges—data quality, interpretability, and method selection—supported by empirical evidence and interdisciplinary integration practices. Table 7 Future directions for causal machine learning in immunology over the next 5–10 years. Research direction Theoretical foundation Ref. Large-scale Perturbation Single-Cell Atlas Introduced the concept of a “Perturbation Cell Atlas,” proposing training generative causal models on millions of CRISPR-based scRNA-seq perturbation profiles ( 92 Causal GRN Inference from Single-Cell Data Velorama applies RNA velocity to represent developmental trajectories as DAGs, enabling inference of fast/slow transcriptional regulators and dynamic GRNs at single-cell resolution ( 93 Explainable Causal AI for Multi-omics Integration CIMLA framework combines SHAP-style interpretability with structural causal models to trace directional regulation in immune-metabolic pathways ( 96 Causal Inference in Vaccine Design AI-driven vaccinology requires target trial emulation and causal NLP to accelerate discovery of protective correlates ( 94 Toolchains for Single-Cell Causal Discovery CausalCell platform integrates multiple algorithms to facilitate causal signal mining in single-cell immunology ( 106 Explainable Federated Causal Learning Combines causal sparsity weighting with blockchain-based data quality control to enable multi-institutional causal modeling under privacy-preserving constraints ( 76 Cross-Site Distributed Causal Inference Federated causal estimation will extend to Cox and Aalen–Johansen models, correcting for heterogeneity across clinical sites ( 95 CRISPR, clustered regularly interspaced short palindromic repeats; scRNA-seq, single-cell RNA sequencing; GRN, gene regulatory network; DAG, directed acyclic graph; SHAP, Shapley additive explanations; NLP, natural language processing. This table highlights emerging trajectories in causal ML for immunological research, ranging from single-cell network inference to federated causal modeling, paving the way for more interpretable, scalable, and collaborative approaches in precision immunology. Data availability statement The original contributions presented in the study are included in the article/supplementary material. Further inquiries can be directed to the corresponding author. Author contributions JW: Writing – original draft, Investigation, Methodology, Conceptualization. MD: Supervision, Writing – review & editing, Visualization. PL: Writing – review & editing. JH: Writing – review & editing. MM: Writing – review & editing, Visualization, Supervision. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Koelzer VH Sirinukunwattana K Rittscher J Rittscher J Mertz KD Precision immunoprofiling by image analysis and artificial intelligence Virchows Archiv: an Int J Pathol 2019 474 511 522 10.1007/s00428-018-2485-z 30470933 PMC6447694 2 Lu M Jin R Ye H Ma T The artificial intelligence and machine learning in lung cancer immunotherapy J Hematol Oncol 2023 16 55 10.1186/s13045-023-01456-y 37226190 PMC10207827 3 Li Y Wu X Fang D Luo Y Informing immunotherapy with multi-omics driven machine learning NPJ digital Med 2024 7 67 10.1038/s41746-024-01043-6 38486092 PMC10940614 4 Roelofsen LM Thommen DS Multimodal predictors for precision immunotherapy Immuno-oncology Technol 2022 14 100071 100071 10.1016/j.iotech.2022.100071 35755892 PMC9216437 5 Sakhamuri MHR Henna S Creedon L Meehan K Graph modelling and graph-attention neural network for immune response prediction Piscataway, NJ, USA IEEE 2023 6 Murray JD Lange JJ Bennett-Lenane H Holm R Kuentz M O’Dwyer PJ Advancing algorithmic drug product development: Recommendations for machine learning approaches in drug formulation Eur J OF Pharm Sci 2023 191 106562 10.1016/j.ejps.2023.106562 37562550 7 Wossnig L Furtmann N Buchanan A Kumar S Greiff V Best practices for machine learning in antibody discovery and development arXiv.org Ithaca, NY, USA arXiv (Cornell University Library) 2023 10.1016/j.drudis.2024.104025 38762089 8 Prelaj A Miskovic V Zanitti M Trovò F Genova C Viscardi G Artificial intelligence for predictive biomarker discovery in immuno-oncology: a systematic review Ann Oncol 2024 35 29 65 10.1016/j.annonc.2023.10.125 37879443 9 Li J Dan K Ai J Machine learning in the prediction of immunotherapy response and prognosis of melanoma: a systematic review and meta-analysis Front Immunol 2024 15 1281940 10.3389/fimmu.2024.1281940 38835779 PMC11148209 10 Kaiser I Mathes S Pfahlberg AB Uter W Berking C Heppt MV Using the prediction model risk of bias assessment tool (PROBAST) to evaluate melanoma prediction studies Cancers (Basel) 2022 14 3033 10.3390/cancers14123033 35740698 PMC9221327 11 Bao R Hutson A Madabhushi A Jonsson VD Rosario SR Barnholtz-Sloan JS Ten challenges and opportunities in computational immuno-oncology J Immunother Cancer 2024 12 e009721 10.1136/jitc-2024-009721 39461879 PMC11529678 12 Bulbulia JA Methods in causal inference. Part 2: Interaction, mediation, and time-varying treatments Evol Hum Sci 2024 6 e41 10.1017/ehs.2024.32 39600621 PMC11588565 13 Cobey S Baskerville EB Limits to causal inference with state-space reconstruction for infectious disease PloS One 2016 11 e0169050 10.1371/journal.pone.0169050 28030639 PMC5193453 14 Zhang A Miao K Sun H Deng C-X Tumor heterogeneity reshapes the tumor microenvironment to influence drug resistance Int J Biol Sci 2022 18 3019–33 10.7150/ijbs.72534 35541919 PMC9066118 15 Rao S Mamouei M Salimi-Khorshidi G Li Y Ramakrishnan R Hassaine A Targeted-BEHRT: deep learning for observational causal inference on longitudinal electronic health records. Ithaca, NY, USA arXiv (Cornell University Library) 2022 1 12 10.1109/TNNLS.2022.3183864 35737602 16 Bernasconi A Zanga A Lucas PJF Scutari M Stella F Towards a transportable causal network model based on observational healthcare data arXiv.org Ithaca, NY, USA arXiv (Cornell University Library) 2023 17 Dibaeinia P Sinha S CIMLA: Interpretable AI for inference of differential causal networks arXiv.org. Ithaca, NY, USA arXiv (Cornell University Library) 2023 18 Li S Large pre-trained models for treatment effect estimation: Are we there yet Patterns 2024 5 101005–5 10.1016/j.patter.2024.101005 39005493 PMC11240171 19 Fang Y Liang F Causal-stoNet: causal inference for high-dimensional complex data arXiv.org Ithaca, NY, USA arXiv (Cornell University Library) 2024 20 Noh M Kim YS Diabetes prediction through linkage of causal discovery and inference model with machine learning models Adv Cardiovasc Dis 2025 13 124–4 10.3390/biomedicines13010124 39857708 PMC11762388 21 Deng Z Zheng X Tian H Zeng DD Deep causal learning: representation, discovery and inference arXiv.org Ithaca, NY, USA arXiv (Cornell University Library) 2022 22 Chernozhukov V Hansen C Kallus N Spindler M Syrgkanis V Applied causal inference powered by ML and AI arXiv.org Ithaca, NY, USA arXiv (Cornell University Library) 2024 23 Michoel T Zhang JD Causal inference in drug discovery and development Drug Discov Today 2023 28 103737 103737 10.1016/j.drudis.2023.103737 37591410 24 Roy S Salimi B Causal inference in data analysis with applications to fairness and explanations Lecture Notes Comput Sci 2023 105 131 10.1007/978-3-031-31414-8_3 25 Balzer LB Petersen ML Invited commentary: machine learning in causal inference-how do I love thee? Let me count the ways Am J Epidemiol 2021 190 1483 1487 10.1093/aje/kwab048 33751059 26 Wu A Kuang K Xiong R Wu F Instrumental variables in causal inference and machine learning: A survey arXiv.org Ithaca, NY, USA arXiv (Cornell University Library) 2022 27 Kuang K Li L Geng Z Xu L Zhang K Liao B Causal inference. Amsterdam, Netherlands Elsevier 2020 28 Shi J Norgeot B Learning causal effects from observational data in healthcare: A review and summary Front Med 2022 9 10.3389/fmed.2022.864882 35872797 PMC9300826 29 Hünermund P Kaminski J Schmitt C Causal machine learning and business decision making Soc Sci Res Network (SSRN) 2022 1 52 10.2139/ssrn.3867326 30 Ness RO Sachs K Mallick P Vitek O A bayesian active learning experimental design for inferring signaling networks J Comput biology: J Comput Mol Cell Biol 2018 25 709–25 10.1089/cmb.2017.0247 29927613 31 Zhang M Liu J Xia Q Role of gut microbiome in cancer immunotherapy: from predictive biomarker to therapeutic target Exp Hematol Oncol 2023 12 84 10.1186/s40164-023-00442-x 37770953 PMC10537950 32 Pichler R Fritz J Maier S Hassler MR Krauter J Andrea DD Target trial emulation to evaluate the effect of immune-related adverse events on outcomes in metastatic urothelial cancer Cancer Immunol Immunother 2024 74 30 10.1007/s00262-024-03871-7 39708183 PMC11663210 33 Feuerriegel S Frauen D Melnychuk V Schweisthal J Hess K Curth A Causal machine learning for predicting treatment outcomes Nat Med 2024 30 958 968 10.1038/s41591-024-02902-1 38641741 34 Baillie JK Angus D Burnham K Calandra T Calfee C Gutteridge A Causal inference can lead us to modifiable mechanisms and informative archetypes in sepsis Intensive Care Med 2024 50 2031–42 10.1007/s00134-024-07665-4 39432104 PMC7616750 35 Gong P Lu Y Li M Li X Carla CJ WITHDRAWN: Causal relationship between immune cells and idiopathic pulmonary fibrosis based on Mendelian randomization analysis 2023 10.21203/rs.3.rs-3704028/v1 PMC12019702 40167279 36 Cao Z Zhao S Hu S Wu T Sun F Shi LI Screening COPD-related biomarkers and traditional chinese medicine prediction based on bioinformatics and machine learning Int J chronic obstructive pulmonary Dis 2024 19 2073 2095 10.2147/COPD.S476808 39346628 PMC11438478 37 Sharma A Kiciman E Causal inference and counterfactual reasoning Proceedings of the 7th ACM IKDD CoDS and 25th COMAD (CoDS-COMAD 2020) 2020 369 - 370 10.1145/3371158 38 Eng L Sutradhar R Niu Y Liu N Liu Y Kaliwal Y Impact of antibiotic exposure before immune checkpoint inhibitor treatment on overall survival in older adults with cancer: A population-based study J Clin Oncol 2023 41 3122–34 10.1200/JCO.22.00074 36827626 39 Sako C Duan C Maresca K Kent S Gilat-Schmidt T Aerts HJWLA Real-world and clinical trial validation of a deep learning radiomic biomarker for PD-(L)1 immune checkpoint inhibitor response in advanced non-small cell lung cancer JCO Clin Cancer Inform 2024 8 e2400133 10.1200/CCI.24.00133 39671539 PMC11658027 40 Ingle SM Miro JM May MT Cain LE Schwimmer C Zangerle R Early antiretroviral therapy not associated with higher cryptococcal meningitis mortality in people with human immunodeficiency virus in high-income countries: an international collaborative cohort study Clin Infect diseases: an Off Publ Infect Dis Soc America 2023 77 64 73 10.1093/cid/ciad122 36883578 PMC10320049 41 Jordan DM Choi HK Verbanck M Topless R Won H-H Nadkarni G No causal effects of serum urate levels on the risk of chronic kidney disease: A Mendelian randomization study PloS Med 2019 16 e1002725 10.1371/journal.pmed.1002725 30645594 PMC6333326 42 Chaudhary NS Tiwari HK Hidalgo BA Limdi NA Reynolds RJ Cushman M APOL1 risk variants associated with serum albumin in a population-based cohort study Am J Nephrol 2022 53 182 190 10.1159/000520997 35100591 PMC9281481 43 Chen S Yu J Chamouni S Wang Y Li Y Integrating machine learning and artificial intelligence in life-course epidemiology: pathways to innovative public health solutions BMC Med 2024 22 354 10.1186/s12916-024-03566-x 39218895 PMC11367811 44 Hawkes N Poor quality animal studies cause clinical trials to follow false leads BMJ: Br Med J 2015 351 h5453 10.1136/bmj.h5453 26468237 45 Hansen CH Bias in vaccine effectiveness studies of clinically severe outcomes that are measured with low specificity: the example of COVID - 19-related hospitalization Eurosurveillance (Euro Surveill) 2024 29 2300259 10.2807/1560-7917.ES.2024.29.7.2300259 38362627 PMC10986656 46 van Amsterdam W Elias S Ranganath R Causal inference in oncology: why, what, how and when Clin Oncol (R Coll Radiol) 2025 38 103616 10.1016/j.clon.2024.07.002 39122629 47 Moodie E Causal inference and confounding: A primer for interpreting and conducting infectious disease research J Infect Dis 2023 228 365–7 10.1093/infdis/jiad144 37157178 PMC10428195 48 Geng Z Yang T Chen Y Wang J Liu Z Miao J Investigating the causal relationship between immune factors and ankylosing spondylitis: insights from a Mendelian Randomization study Adv Rheumatol 2024 64 89 10.1186/s42358-024-00428-1 39696529 49 Li J Liu L Luo Q Zhou W Zhu Y Jiang W Exploring the causal relationship between immune cell and all-cause heart failure: a Mendelian randomization study Front Cardiovasc Med 2024 11 10.3389/fcvm.2024.1363200 38938655 PMC11210391 50 Burgess S Woolf B Mason AM Ala-Korpela M Gill D Addressing the credibility crisis in Mendelian randomization BMC Med 2024 22 374 10.1186/s12916-024-03607-5 39256834 PMC11389083 51 Chen J Su B Zhang X Gao C Ji Y Xue X Mendelian randomization suggests causal correlations between inflammatory cytokines and immune cells with mastitis Front Immunol 2024 15 1409545 10.3389/fimmu.2024.1409545 39399489 PMC11466835 52 Tang B Lin N Liang J Yi G Zhang L Peng W Leveraging pleiotropic clustering to address high proportion correlated horizontal pleiotropy in Mendelian randomization studies Nat Commun 2025 16 2817 10.1038/s41467-025-57912-5 40118820 PMC11928562 53 Smith MJ Phillips RV Maringe C Luque-Fernández MA Performance of cross-validated targeted maximum likelihood estimation arXiv:2409.11265 Ithaca, NY, USA arXiv (Cornell University Library) 2024 10.48550/arXiv.2409.11265 PMC12270713 40675767 54 Chen X Liu Y Ma S Zhang Z Causal inference of general treatment effects using neural networks with a diverging number of confounders J Econometrics 2024 238 105555 10.1016/j.jeconom.2023.105555 55 Koh H Kim J Jang H MiCML: a causal machine learning cloud platform for the analysis of treatment effects using microbiome profiles BioData Min 2025 18 10 10.1186/s13040-025-00422-3 39885552 PMC11783787 56 Arango-Argoty G Kipkogei E Stewart R Sun GJ Patra A Kagiampakis I Pretrained transformers applied to clinical studies improve predictions of treatment efficacy and associated biomarkers Nat Commun 2025 16 2101 10.1038/s41467-025-57181-2 40025003 PMC11873189 57 Liu Z Wu Y Xu H Wang M Weng S Pei D Multimodal fusion of radio-pathology and proteogenomics identify integrated glioma subtypes with prognostic and therapeutic opportunities Nat Commun 2025 16 3510 10.1038/s41467-025-58675-9 40222975 PMC11994800 58 Xie C Ning Z Guo T Yao L Chen X Huang W Multimodal data integration for biologically-relevant artificial intelligence to guide adjuvant chemotherapy in stage II colorectal cancer EBioMedicine 2025 117 105789 10.1016/j.ebiom.2025.105789 40472802 PMC12171563 59 Rust J Autexier S Causal inference for personalized treatment effect estimation for given machine learning models 2022 IEEE 21st International Conference on Machine Learning and Applications (ICMLA) 2022 1289–95 10.1109/ICMLA55696.2022.00206 60 Pirracchio R Hubbard A Sprung CL Chevret S Annane D RECORDS Collaborators Assessment of machine learning to estimate the individual treatment effect of corticosteroids in septic shock JAMA Netw Open 2020 3 e2029050 10.1001/jamanetworkopen.2020.29050 33301017 PMC7729430 61 Karmakar S Majumder SG Gangaraju D Causal Inference and Causal Machine Learning with Practical Applications: The paper highlights the concepts of Causal Inference and Causal ML along with different implementation techniques. New York, NY, USA Association for Computing Machinery (ACM) 2023 62 Loh WW Causal inference with unobserved confounding: leveraging negative control outcomes using lavaan Multivariate Behav Res 2025 1 13 10.1080/00273171.2025.2507742 40476472 63 Pavlovi’c M Al Hajj GS Kanduri C Pensar J Wood M Sollid LM Improving generalization of machine learning-identified biomarkers with causal modeling: an investigation into immune receptor diagnostics arXiv.org Ithaca, NY, USA arXiv (Cornell University Library) 2022 64 Papanastasiou G Scutari M Tachdjian R Hernandez-Trujillo V Raasch J Billmeyer K Causal modeling in large-scale data to improve identification of adults at risk for combined and common variable immunodeficiencies. Cold Spring Harbor, NY, USA Cold Spring Harbor Laboratory (medRxiv) 2024 65 Metzcar J Jutzeler CR Macklin P Köhn-Luque A Brüningk SC A review of mechanistic learning in mathematical oncology Front Immunol 2024 15 1363144 10.3389/fimmu.2024.1363144 38533513 PMC10963621 66 Oh TR Integrating predictive modeling and causal inference for advancing medical science Childhood Kidney Dis 2024 28 93 98 10.3339/ckd.24.018 67 Edwards JK Cole SR Westreich D All your data are always missing: incorporating bias due to measurement error into the potential outcomes framework Int J Epidemiol 2015 44 1452–9 10.1093/ije/dyu272 25921223 PMC4723683 68 Holovchak A McIlleron H Denti P Schomaker M Recoverability of causal effects under presence of missing data: a longitudinal case study Biostatistics 2024 26 kxae044 10.1093/biostatistics/kxae044 39552060 PMC7617375 69 Hildt E What is the role of explainability in medical artificial intelligence? A case-based approach Bioengineering (Basel) 2025 12 375 10.3390/bioengineering12040375 40281735 PMC12025101 70 Raita Y Camargo CA Jr Liang L Hasegawa K Big data, data science, and causal inference: A primer for clinicians Front Med 2021 8 678047 10.3389/fmed.2021.678047 34295910 PMC8290071 71 Sanchez P Voisey JP Xia T Watson J O’Neil A Tsaftaris SA Causal machine learning for healthcare and precision medicine R Soc Open Sci 2022 9 220638 10.1098/rsos.220638 35950198 PMC9346354 72 Lynch J It’s not easy being interdisciplinary Int J Epidemiol 2006 35 1119–22 10.1093/ije/dyl200 16987842 73 Miles B Shpitser I Kanki P Meloni S Tchetgen E On semiparametric estimation of a path-specific effect in the presence of mediator-outcome confounding Biometrika 2020 107 159 172 10.1093/biomet/asz063 33390591 PMC7773030 74 Bartlett JW Olarte Parra C Granger E Keogh RH van Zwet EW Daniel RM G-formula with multiple imputation for causal inference with incomplete data Stat Methods Med Res 2025 34 1130–43 10.1177/09622802251316971 40165440 PMC12209542 75 Silva GC Gutman R Multiple imputation procedures for estimating causal effects with multiple treatments with application to the comparison of healthcare providers Stat Med 2022 41 208–26 10.1002/sim.9231 34726285 PMC8716426 76 Mu J Kadoch M Yuan T Lv W Liu Q Li B Explainable federated medical image analysis through causal learning and blockchain IEEE J BioMed Health Inform 2024 28 3206–18 10.1109/JBHI.2024.3375894 38470597 77 Metsch JM Saranti A Angerschmid A Pfeifer B Klemt V Holzinger A CLARUS: An interactive explainable AI platform for manual counterfactuals in graph neural networks J BioMed Inform 2024 150 104600 10.1016/j.jbi.2024.104600 38301750 78 Ahmed A Maity GC Ashifizzaj A Najir I Artificial Intelligence in the field of pharmaceutical Science International Journal of Pharmaceutical Research and Applications (IJPRA) 2024 09 927–33 10.35629/4494-0905927933 79 Nihalani G Applications of artificial intelligence in pharmaceutical research: an extensive review Bioequivalence bioavailability Int J 2024 8 1 7 10.23880/beba-16000231 80 Bhattamisra SK Banerjee P Gupta P Mayuren J Patra S Candasamy M Artificial intelligence in pharmaceutical and healthcare research BIG Data AND Cogn COMPUTING 2023 7 10 10 10.3390/bdcc7010010 81 Arora P Behera MD Saraf SA Shukla R Leveraging artificial intelligence for synergies in drug discovery: from computers to clinics Curr Pharm design 2024 30 2187–205 10.2174/0113816128308066240529121148 38874046 82 Pereira A A transformação da indústria farmacêutica pela inteligência artificial: impactos no desenvolvimento de medicamentos Rio de Janeiro, Brazil Editora FT Ltda. 2024 24–5 24–5 83 Hammerton G Munafò MR Causal inference with observational data: the need for triangulation of evidence Psychol Med 2021 51 563–78 10.1017/S0033291720005127 33682654 PMC8020490 84 Kühne F Schomaker M Stojkov I Jahn B Conrads-Frank A Siebert S Causal evidence in health decision making: methodological approaches of causal inference and health decision science Ger Med Sci 2022 20 Doc12 10.3205/000314 36742460 PMC9869404 85 Gong F The exploration and research of talent training ideas in interdisciplinary background Adv Soc Science Educ Humanities Research/Advances Soc science Educ humanities Res 2024 227 235 10.2991/978-2-38476-253-8_28 86 Li J A comparative study on the reform of interdisciplinary talents training model under the background of new liberal arts Occupation and Professional Education 2024 1 25 30 10.62381/O242104 87 Wang L Lan Z Zhang Y Guo Z Sun J Dual-agent, six-dimensional, four-drive” Talent cultivation model innovation and practice Adv education humanities Soc Sci Res 2024 12 137 137 10.56028/aehssr.12.1.137.2024 88 Jia S Chen X Yang T Research on the training model of financial technology talents based on interdisciplinary and multi-professional integration Int J New Developments Educ 2023 5 21–6 10.25236/IJNDE.2023.050204 89 Xu Y Ramli HB Khairani MZB Interdisciplinary talent training model of new media art major at Xi’an University: A literature review Global J arts humanities Soc Sci 2023 11 1–12 10.37745/gjahss.2013/vol11n7112 90 Xi W Yue P Ye XF Deng J Research on the cultivation of innovative talents for science education under the background of new liberal arts Educ review USA 2024 8 43 47 10.26855/er.2024.01.005 91 Sono MG Diputra GBW The evolution of talent development programs in academic literature: A bibliometric review Eastasouth Manage Business 2024 3 133 150 10.58812/esmb.v3i1.336 92 Rood JE Hupalowska A Regev A Toward a foundation model of causal cell and tissue biology with a Perturbation Cell and Tissue Atlas Cell 2024 187 4520–45 10.1016/j.cell.2024.07.035 39178831 93 Singh R Wu AP Mudide A Berger B Causal gene regulatory analysis with RNA velocity reveals an interplay between slow and fast transcription factors Cell Syst 2024 15 462 474.e5 10.1016/j.cels.2024.04.005 38754366 PMC12204218 94 Anderson LN Hoyt CT Zucker JD McNaughton AD Teuton JR Karis K Computational tools and data integration to accelerate vaccine development: challenges, opportunities, and future directions Front Immunol 2025 16 1502484 10.3389/fimmu.2025.1502484 40124369 PMC11925797 95 Li H Xu J Gan K Wang F Zang C Federated causal inference in healthcare: methods, challenges, and applications arXiv preprint arXiv:2505.02238 Ithaca, NY, USA arXiv (Cornell University Library) 2025 10.48550/arXiv.2505.02238 96 Dibaeinia P Ojha A Sinha S Interpretable AI for inference of causal molecular relationships from omics data Sci Adv 2025 11 eadk0837 10.1126/sciadv.adk0837 39951525 PMC11827637 97 Yu X Zoh RS Fluharty DA Mestre LM Valdez D Tekwe CD Misstatements, misperceptions, and mistakes in controlling for covariates in observational research Elife 2024 13 e82268 10.7554/eLife.82268 38752987 PMC11098558 98 Frank KA Impact of a confounding variable on a regression coefficient SOCIOLOGICAL Methods Res 2000 29 147–94 10.1177/0049124100029002001 99 Kahlert J Gribsholt SB Gammelager H Dekkers OM Luta G Control of confounding in the analysis phase - an overview for clinicians Clin Epidemiol 2017 9 195 204 10.2147/CLEP.S129886 28408854 PMC5384727 100 Byrnes J Dee LE Causal inference with observational data and unobserved confounding variables Ecol Lett 2025 28 e70023 10.1111/ele.70023 39836442 PMC11750058 101 Nkuhairwe IN Esterhuizen TM Sigwadhi LN Tamuzi JL Machekano R Nyasulu PS Estimating the causal effect of dexamethasone versus hydrocortisone on the neutrophil- lymphocyte ratio in critically ill COVID - 19 patients from Tygerberg Hospital ICU using TMLE method BMC Infect Dis 2024 24 1365 10.1186/s12879-024-10112-w 39609735 PMC11606140 102 Jiang C Talbot D Carazo S Schnitzer ME A double machine learning approach for the evaluation of COVID - 19 vaccine effectiveness under the test-negative design: analysis of québec administrative data arXiv 2024 23 39985144 10.1002/sim.70025 PMC11845851 103 Xu J Wang T Li J Wang Y Zhu Z Fu X A multimodal fusion system predicting survival benefits of immune checkpoint inhibitors in unresectable hepatocellular carcinoma NPJ Precis Oncol 2025 9 185 10.1038/s41698-025-00979-6 40517171 PMC12167364 104 Wang L Guo X Shi H Ma Y Bao H Jiang L CRISP: A causal relationships-guided deep learning framework for advanced ICU mortality prediction BMC Med Inform Decis Mak 2025 25 165 10.1186/s12911-025-02981-1 40234903 PMC12001402 105 Matthay EC Hagan E Gottlieb LM Tan ML Vlahov D Adler NE Alternative causal inference methods in population health research: Evaluating tradeoffs and triangulating evidence SSM Popul Health 2020 10 100526 10.1016/j.ssmph.2019.100526 31890846 PMC6926350 106 Wen Y Huang J Guo S Elyahu Y Monsonego A Zhang H Applying causal discovery to single-cell analyses using CausalCell Elife 2023 12 e81464 10.7554/eLife.81464 37129360 PMC10229139 ",
  "metadata": {
    "Title of this paper": "Applying causal discovery to single-cell analyses using CausalCell",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484136/"
  }
}