{
  "title": "Paper_63",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12489958 PMC12489958.1 12489958 12489958 10.7759/cureus.91464 1 Cardiology Internal Medicine Immune Checkpoint Inhibitor-Induced Subacute Myocarditis Muacevic Alexander Adler John R Al Janabi Taysir 1 Patel Milan 2 Roomi Sohaib 3 Hoskote Abhinav 1  1  2  3 Taysir Al Janabi taljanabi@wellspan.org 2 9 2025 9 2025 17 9 495976 e91464 2 9 2025 02 09 2025 03 10 2025 03 10 2025 Copyright © 2025, Al Janabi et al. 2025 Al Janabi et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/403375-immune-checkpoint-inhibitor-induced-subacute-myocarditis Immune checkpoint inhibitors (ICIs) are a novel class of drugs that direct the immune system to destroy cancer cells, thereby significantly improving patient survival rates. ICI-induced myocarditis, though uncommon, is the most severe side effect associated with these treatments because of its high mortality rate. We report the case of an 81-year-old man with a medical history significant for non-small cell lung cancer who had previously undergone chemoradiotherapy and was receiving the ICI durvalumab. He presented with progressive shortness of breath, and his clinical picture was complicated by pneumonia. His laboratory workup showed evidence of acute kidney injury, elevated liver enzymes, and volume overload. His echocardiogram showed evidence of systolic dysfunction. Cardiac magnetic resonance imaging (MRI) confirmed the diagnosis of subacute myocarditis, likely caused by the ICI. The main presenting symptoms of ICI-induced subacute myocarditis are arrhythmia and heart failure based on the time interval from the initiation of ICI treatment to the onset of symptoms. Our case could have easily been misdiagnosed as a type 2 myocardial infarction because of the patient’s pneumonia. Cardiac MRI was the diagnostic tool for the diagnosis of ICI-induced subacute myocarditis in our case. Myocarditis should be considered in patients receiving ICIs, particularly those undergoing combination therapy, because it can be misdiagnosed as a type 2 myocardial infarction. cardiotoxicity ici immune checkpoint inhibitors immune-related adverse events myocarditis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Myocarditis is an uncommon but potentially fatal adverse effect of immune checkpoint inhibitors (ICIs). ICIs are a novel class of drugs that direct the immune system to recognize and destroy cancer cells. They are widely used because of their ability to bring about notable improvements in terms of clinical response, tumor reduction, and survival [ 1 2 3 During the initial regulatory approval of ICIs in 2014, immune-related adverse effects (irAEs) were reported to occur in approximately 80%-90% of cases and to involve various organ systems, including the nervous, endocrine, gastrointestinal, respiratory, and renal systems. A few cases of ICI-induced myocarditis were reported after ICIs received approval [ 4 ICI-induced myocarditis is infrequent, but it is the most serious irAE of ICIs, with a mortality rate of up to 50% [ 5 6 6 7 8 1 5 1 9 9 6 Here, we present a case of ICI-induced myocarditis that is notable for having a subacute course. Case presentation An 81-year-old male presented with a medical history significant for coronary artery disease status post (s/p) coronary artery bypass graft, percutaneous coronary intervention (PCI), atrial fibrillation s/p watchman without anticoagulation because of gastrointestinal bleeding, left internal carotid artery stenosis, hypertension, type 2 diabetes mellitus, and non-small cell lung cancer s/p chemoradiotherapy, and he was currently on durvalumab. The patient came to the hospital with complaints of progressive shortness of breath and fatigue over a period of weeks. Prior to visiting the hospital, he contracted a viral upper respiratory infection that was complicated by pneumonia, and for which he received antibiotics that did not improve his symptoms. In the emergency department, his vitals were significant for a temperature of 97.3°F, SpO2 at 86%, requiring 4 L oxygen through nasal cannula, and blood pressure of 116/81 mmHg. His physical examination was notable for elevated jugular venous pressure, bilateral lung rales, and 2+ bilateral leg edema. Comprehensive laboratory studies revealed anemia, thrombocytopenia, acute kidney injury, elevated liver enzymes, and evidence of volume overload (Table 1 1 2 Table 1 Laboratory studies. Test Results Reference range Hemoglobin 10.8 g/dl 13.0–17.3 g/dl Platelets 138 K/mcL 140–400 K/mcL Creatinine 1.62 mg/dl 0.70–1.30 mg/dl Aspartate aminotransferase 61 IU/L 13–39 IU/L Alanine aminotransferase 56 IU/L 7–52 IU/L B-type natriuretic peptide 2,047 pg/mL ≤100 pg/mL High sensitivity troponin 814 ng/L ng/L Figure 1 Electrocardiogram upon presentation showing atrial fibrillation. Figure 2 Chest X-ray showing cardiomegaly and pulmonary edema. Based on the echocardiographic findings, cardiology was consulted, and the recommended PET/CT myocardial perfusion imaging showed a large, predominantly reversible filling perfusion defect in the anterior, anterolateral, and anteroseptal wall segments, suggestive of ischemia in the left anterior descending (LAD)/left internal mammary artery (LIMA) region. Cardiac magnetic resonance imaging (CMR) revealed a severely reduced systolic function of the LV and right ventricle (RV), with an estimated ejection fraction (EF) of 16% and 17%, respectively. Additionally, global dysfunction with regional variation was observed: the interventricular septum, anterior wall, and lateral walls were akinetic, while the inferior wall was severely hypokinetic. Moreover, a dense, patchy enhancement was noted within the mid inferoseptum near the insertion point of the RV, along with scattered areas of subepicardial enhancement within the mid inferior and mid inferolateral walls (Figure 3 Figure 3 Cardiac MRI showing dense patchy enhancement was noted within the mid inferoseptum near the insertion point of the RV along with scattered areas of subepicardial enhancement within the mid inferior and mid inferolateral walls. MRI: Magnetic resonance imaging, RV: Right ventricle The CMR findings were concerning for non-ischemic processes and subacute myocarditis. The durvalumab was immediately discontinued, and the patient was started on a tapering weight-based prednisone of 80 mg daily for one week, then tapered by 10 mg weekly for a total course of eight weeks. The patient also started on milrinone infusion for optimization prior to right and left heart catheterization and possible high-risk PCI. Heart catheterization showed severe stenosis, 95%, at the ostium of the left circumflex artery and severe proximal stenosis of the saphenous vein graft (SVG) to the diagonal, both of which were stented. The cardiac index was low, 1.4. The patient was started on dual antiplatelet therapy (DAPT) with aspirin and Brilinta for one year and then continued on acetylsalicylic acid (ASA) for life. As part of the guideline-directed medical therapy (GDMT) for heart failure with reduced ejection fraction (HFrEF), the patient was started on Jardiance. The rest of the GDMT was initiated on an outpatient basis for as long as his blood pressure and heart rate would tolerate it. The patient was discharged with a life vest in view of his low EF. A three-month follow-up visit revealed improvement in the patient’s EF from 20%-25% to 45%-50%. Additionally, there was an improvement in biomarkers, with a decrease in B-type natriuretic peptide (BNP) from 2,047 pg/mL to 435 pg/mL and troponin from 814 ng/L to 38 ng/L. The patient did not require an implantable cardioverter-defibrillator. Discussion ICI-induced myocarditis is a life-threatening condition, with the median onset of symptoms occurring 30 days after the initiation of ICI treatment. However, symptoms may occur within 15 days among patients on combination ICI therapy. Most initial reports of ICI-induced myocarditis are fulminant, with early onset of symptoms, and these results suggest that less severe or subacute ICI-induced myocarditis has been underreported. Fulminant ICI-induced myocarditis classically begins shortly after ICI treatment is initiated. However, late-onset ICI-induced myocarditis has also been reported. An autopsy diagnosis of ICI-induced myocarditis was reported by Nguyen et al., developed 131 weeks after the initiation of an ICI (and 33 weeks after the ICI was discontinued) [ 6 The clinical presentation of ICI-induced myocarditis varies, potentially in relation to the timing of the onset of symptoms. Arrhythmia is the likely presentation of early-onset ICI-induced myocarditis, while heart failure is a common presentation of late-onset myocarditis. Dolladille et al. reported 19 cases of late-onset ICI-induced myocarditis (with a median time to onset of 304 days from the initiation of treatment), and their findings indicated that heart failure was the main presentation in 50% of these cases, compared with 5% in early-onset cases (with a median time to onset of 14 days from the initiation of ICI) [ 6 8 Once the diagnosis of ICI-induced myocarditis is established, immunotherapy should be discontinued immediately, and corticosteroid therapy should be initiated. Up to 50% of cases fail to respond to corticosteroids; thus, immunosuppressive therapy should be considered as a second-line treatment [ 9 8 While there is no consensus on the screening, surveillance, prevention, or even treatment of ICI-induced myocarditis, many professional medical societies, including the Society for Immunotherapy of Cancer, the European Society of Medical Oncology, and the European Society of Cardiology, recommend obtaining baseline EKG, troponin, and B-type natriuretic peptide levels prior to initiating ICI treatment, and a baseline echocardiogram is also recommended for high-risk individuals [ 8 A main limitation to this case is the concurrent occurrence of ischemic and non-ischemic cardiomyopathy, making it challenging to ascertain the causation of Durvalumab in this patient's presentation. While cardiac MRI is highly suggestive, endomyocardial biopsy is the diagnostic gold standard [ 10 Conclusions Subacute myocarditis, though rare, poses a serious threat to patients undergoing ICI therapy, especially those receiving combination regimens. The fact that its clinical course often leads to misdiagnosis as a type 2 myocardial infarction underscores the importance of heightened clinical awareness and accurate diagnostic strategies to ensure timely and appropriate management. Disclosures Human subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Supervision: References 1 Expansion of pathogenic cardiac macrophages in immune checkpoint inhibitor myocarditis Circulation Ma P Liu J Qin J 48 66 149 2024 37746718 10.1161/CIRCULATIONAHA.122.062551 PMC11323830 2 Rheumatic complications of immune checkpoint inhibitors Rheum Dis Clin North Am Ghosh N Bass AR 411 428 48 2022 https://doi.org/10.1016/j.rdc.2022.02.002 35400368 10.1016/j.rdc.2022.02.002 3 Immune checkpoint inhibitors-related myocarditis: a review of reported clinical cases Diagnostics (Basel) Zotova L 13 2023 10.3390/diagnostics13071243 PMC10093455 37046461 4 Myocarditis in patients treated with immune checkpoint inhibitors J Am Coll Cardiol Mahmood SS Fradley MG Cohen JV 1755 1764 71 2018 29567210 10.1016/j.jacc.2018.02.037 PMC6196725 5 Identification of pathogenic immune cell subsets associated with checkpoint inhibitor-induced myocarditis Circulation Zhu H Galdos FX Lee D 316 335 146 2022 35762356 10.1161/CIRCULATIONAHA.121.056730 PMC9397491 6 Immune checkpoint inhibitor-related myocarditis: current understanding and potential diagnostic and therapeutic strategies Expert Opin Drug Saf Turker I Johnson DB 909 919 22 2023 37647330 10.1080/14740338.2023.2254218 PMC10530188 7 Fatal toxic effects associated with immune checkpoint inhibitors: a systematic review and meta-analysis JAMA Oncol Wang DY Salem JE Cohen JV 1721 1728 4 2018 30242316 10.1001/jamaoncol.2018.3923 PMC6440712 8 Late cardiac adverse events in patients with cancer treated with immune checkpoint inhibitors J Immunother Cancer Dolladille C Ederhy S Allouche S 8 2020 10.1136/jitc-2019-000261 PMC7057417 31988143 9 Immune checkpoint inhibitor myocarditis: pathophysiological characteristics, diagnosis, and treatment J Am Heart Assoc Palaskas N Lopez-Mattei J Durand JB 0 9 2020 10.1161/JAHA.119.013757 PMC7033840 31960755 10 2025 ESC Guidelines for the management of myocarditis and pericarditis Eur Heart J Schulz-Menger J Collini V Gröschel J 55 54 2025 10.1093/eurheartj/ehaf192 40878297 ",
  "metadata": {
    "Title of this paper": "2025 ESC Guidelines for the management of myocarditis and pericarditis",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489958/"
  }
}