{
  "title": "Paper_793",
  "abstract": "Cell Mol Immunol Cell Mol Immunol 2394 cmi Cellular and Molecular Immunology 1672-7681 2042-0226 Nature Publishing Group PMC11443046 PMC11443046.1 11443046 11443046 38942796 10.1038/s41423-024-01199-x 1199 1 Article Lipid droplet accumulation mediates macrophage survival and Treg recruitment via the CCL20/CCR6 axis in human hepatocellular carcinoma Wang Yongchun 1 2 Chen Weibai 1 2 Qiao Shuang 1 Zou Hao 1 Yu Xing-juan 1 Yang Yanyan 2 Li Zhixiong 1 Wang Junfeng 1 Chen Min-shan 1 3 http://orcid.org/0000-0002-4713-2807 Xu Jing xujing@sysucc.org.cn 1 http://orcid.org/0000-0002-8281-1450 Zheng Limin zhenglm@mail.sysu.edu.cn 1 2 1 grid.488530.2 0000 0004 1803 6191 Collaborative Innovation Center for Cancer Medicine, State Key Laboratory of Oncology in South China, Guangdong Provincial Clinical Research Center for Cancer, Sun Yat-sen University Cancer Center, 2 https://ror.org/0064kty71 grid.12981.33 0000 0001 2360 039X Key Laboratory of Gene Function and Regulation of the Ministry of Education, School of Life Sciences, Sun Yat-sen University, 3 https://ror.org/0400g8r85 grid.488530.2 0000 0004 1803 6191 Department of Liver Surgery, Sun Yat-sen University Cancer Center, 28 6 2024 10 2024 21 10 471858 1120 1130 24 1 2024 17 6 2024 01 10 2025 01 10 2025 02 10 2024 01 10 2025 © The Author(s), under exclusive licence to CSI and USTC 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 Metabolic changes play a crucial role in determining the status and function of macrophages, but how lipid reprogramming in macrophages contributes to tumor progression is not yet fully understood. Here, we investigated the phenotype, contribution, and regulatory mechanisms of lipid droplet (LD)-laden macrophages (LLMs) in hepatocellular carcinoma (HCC). Enriched LLMs were found in tumor tissues and were associated with disease progression in HCC patients. The LLMs displayed immunosuppressive phenotypes (with extensive expression of TREM2, PD-L1, CD206, and CD163) and attenuated the antitumor activities of CD8 + + Keywords Lipid droplets Macrophage survival CCL20 Treg Hepatocellular carcinoma Subject terms Cancer microenvironment Tumour immunology https://doi.org/10.13039/501100001809 National Natural Science Foundation of China (National Science Foundation of China) 32230034 82273296 Xu Jing Zheng Limin National Key Research and Development Program of China (2021YFC2300601); Open Fund Project of Guangdong Academy of Medical Sciences (YKY-KF202207) Guangdong Basic and Applied Basic Research Foundation (2022A1515111205) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © CSI and USTC 2024 ",
  "metadata": {
    "Title of this paper": "Lipid droplet accumulation mediates macrophage survival and Treg recruitment via the CCL20/CCR6 axis in human hepatocellular carcinoma",
    "Journal it was published in:": "Cellular and Molecular Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11443046/"
  }
}