{
  "title": "Paper_371",
  "abstract": "pmc Theranostics Theranostics 1512 theranostics thno Theranostics 1838-7640 Ivyspring International Publisher PMC12486991 PMC12486991.1 12486991 12486991 41041077 10.7150/thno.121766 thnov15p9944 1 Review GM-CSF + Fan Sha-Sha 1 2 3 4 # Xu Xuan 5 # Luo Yu-Bin 1 3 Meng Xiang-Yu 2 4 ✉ Liu Yi 1 3 6 ‡ ✉ 1 2 3 4 5 6 ✉ Corresponding authors: Xiang-Yu Meng, Health Science Center, Hubei Minzu University, 39 Xueyuan Road, Enshi 445000, China. E-mail: mengxy_whu@163.com yiliu8999@wchscu.cn ‡ #Equal contribution. Competing Interests: The authors have declared that no competing interest exists. 2025 12 9 2025 15 18 498071 9944 9968 16 7 2025 10 8 2025 12 09 2025 02 10 2025 03 10 2025 © The author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ https://ivyspring.com/terms Autoimmune diseases are driven by a breach of self-tolerance, leading to chronic inflammation and organ damage. While the Th1 and Th17 paradigms have long dominated our understanding of T-cell-mediated pathology, a distinct subset of CD4 + GM-CSF + autoimmune diseases GM-CSF differentiation regulation pathogenic mechanisms clinical applications pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Autoimmune diseases (AIDs) are chronic inflammatory conditions characterized by aberrant immune responses against self-tissues. They encompass a broad range of conditions, including multiple sclerosis (MS), rheumatoid arthritis (RA), type 1 diabetes (T1D), and inflammatory bowel disease (IBD). The pathogenesis of AIDs is driven by complex interactions between genetic susceptibility, environmental triggers, and immune dysregulation, although the precise molecular mechanisms remain incompletely understood 1 2 3 Within the immune regulatory network of AIDs, abnormal activation of CD4 + + 4 5 6 7 However, recent research has revealed contradictory phenomena and challenges the long established Th1/Th17 dogma. In mouse models of AIDs such as MS and T1D, among others, knockout of key factors including IFN-γ, IL-17, T-bet, Rel, or RORγt does not consistently attenuate disease progression and may even exacerbate it. These findings suggest that disease pathogenesis is not solely dependent on canonical Th1 or Th17 pathways, but rather reflects a context-dependent interplay of effector T cell subsets with compensatory mechanisms and functional plasticity 8 18 In recent years, the landscape of Th cell biology has been reshaped by the emergence of a distinct lineage defined by its production of GM-CSF. While GM-CSF can be secreted by various cell types, compelling evidence from multiple AIDs indicates that CD4 + in vitr 19 However, the identity of these cells is complicated by their profound plasticity. In vivo Table 1 + + Regardless of their classification, their pathogenic importance is undisputed. Functional studies have revealed that GM-CSF + 19 20 Csf2 + + 21 This review will systematically dissect the biology of these pivotal cells. We will synthesize the current understanding of their molecular identity and the complex regulatory networks governing their differentiation. Furthermore, we will analyze their specific pathogenic roles across the spectrum of major autoimmune diseases and, based on this evidence, critically evaluate emerging therapeutic strategies that target this axis. By integrating foundational research with translational prospects, we aim to provide a comprehensive theoretical framework for the future of precision intervention in autoimmunity. A landscape summary of the systematically retrieved literature is provided in Figure 1 Table S1 2. Molecular Characteristics and Differentiation Regulation of GM-CSF + The complex molecular aspects of GM-CSF + + Figure 2 2.1 Molecular diversity and disease specificity of GM-CSF + GM-CSF + + 14 22 23 + + + + + + + + + + In humans, Th1-like cells constitute the dominant GM-CSF⁺ Th subset. IL-12 promotes GM-CSF STAT3, STAT4 STAT5 RUNX1 RUNX3 CSF2 GM-CSF 24 26 + 27 + + 27 Regarding disease specificity, GM-CSF + + + + + 13 22 28 + + + 29 + + 12 30 + 31 32 2.2 Conserved and species-specific regulation of GM-CSF + The differentiation of GM-CSF⁺ T helper cells follows a principle of “shared regulatory frameworks with disease- and species-specific modulation”. Core pro-differentiation pathways across contexts include the IL-12/STAT4, IL-23/RORγt, and IL-7/IL-2/STAT5 axes, which broadly support the generation and stabilization of GM-CSF-expressing subsets. Negative regulators such as TGF-β, IFN-γ, and IL-10 generally constrain GM-CSF production to prevent excessive inflammation 12 13 21 13 14 19 20 STAT3/4/5 BHLHE40 RUNX1/3 STAT5 BHLHE40 CSF2 RUNX T-bet RORγt 20 21 27 31 33 Nevertheless, disease-specific heterogeneity has been repeatedly reported. In MS, human cases rely more on the IL-12/STAT4 pathway driving the Th1-like phenotype (T-bet + 11 14 28 + + + 29 + + + + 30 33 Difference between humans and mice involves not only preferences for core pathways but also regulatory factor specificity. For example, IL-2RA polymorphisms directly affect GM-CSF secretion in human MS, while the synergistic effect of IL-7 and IL-2 plays a more critical role in mice 34 35 26 21 36 2.3 Interplay Between heterogeneity and plasticity in GM-CSF + The pathogenic identity of GM-CSF-producing Th cells is defined not by a static phenotype, but by a dynamic interplay between their inherent heterogeneity and profound plasticity. This heterogeneity is evident at multiple molecular levels. In terms of cytokine profiles, beyond their hallmark GM-CSF secretion, these cells can co-express a range of effector molecules including TNF-α, IL-2, and IL-3. Depending on the microenvironment, they polarize into distinct functional subsets, such as IFN-γ-producing (Th1-like), IL-17A-producing (Th17-like), or highly pro-inflammatory hybrid subsets expressing both 14 32 31 33 This spectrum of heterogeneity is not pre-determined but is actively and continuously shaped by the cells' remarkable plasticity. The core “rheostat” governing this plasticity is the dynamic balance of the IL-12 and IL-23 signaling axes. The IL-12/STAT4 pathway preferentially drives the Th1-like phenotype, prevalent in MS, while the IL-1β/IL-23/RORγt axis promotes the Th17-like phenotype often seen in other contexts 11 37 20 26 38 29 30 While the foundational role of GM-CSF + First, moving beyond conserved pathways, how do disease-specific microenvironments, such as the gut microbiome in IBD, metabolic shifts in T1D, or the unique cytokine milieu of a tumor, precisely sculpt the phenotype and function of these cells? Understanding this context-dependent regulation is key to explaining clinical heterogeneity. Second, the significant discrepancies between human disease and murine models, particularly in the dominant Th1-like versus Th17-like polarization, represent a major translational hurdle. This necessitates not only large-scale clinical validation using patient samples but also the development of more sophisticated humanized models to bridge this gap. Finally, how do GM-CSF + In summary, GM-CSF + 3. The Mechanistic Role of GM-CSF + 3.1 Role of GM-CSF + Multiple sclerosis (MS) is a chronic, immune-mediated demyelinating disease of the central nervous system (CNS), characterized by inflammation, myelin destruction, axonal loss, and neurodegeneration. Globally, MS affects an estimated 2.8 million individuals, with a prevalence of approximately 35.9 cases per 100,000 people, and shows striking geographical variation, being more common in high-latitude regions. Women are disproportionately affected, with a female-to-male ratio of approximately 3:1 39 40 Historically, research into MS pathogenesis focused on the classic Th1 (IFN-γ + + 8 9 41 42 The pivotal role of GM-CSF emerged from foundational studies. As early as 2001, McQualter et al. discovered that mice genetically deficient in GM-CSF (i.e., by genetically Csf2 43 + 44 Csf2 14 35 45 50 Subsequent research confirmed that CD4 + + 35 47 51 + 20 20 23 43 52 IL2RA + 35 Early studies described GM-CSF as a co-effector cytokine in Th1 and Th17 cells 31 11 14 A paradigm shift occurred in 2014 when Sheng et al. identified GM-CSF + + 21 Further studies identified GM-CSF⁺ Th subsets in MS patients that lacked IFN-γ and IL-17 but were dependent on IL-2/STAT5 signaling 13 53 20 23 32 49 + + 54 These studies offer significant insights into the immunopathogenesis of MS and its murine model-EAE. Importantly, it is not merely that Th1 or Th17 cells act as passive carriers of GM-CSF-mediated pathogenicity. Rather, the acquisition of GM-CSF-producing capacity is a prerequisite for these T cell subsets to exert their full pathogenic potential in MS or EAE 55 57 + 58 60 in vivo 61 62 64 + Figure 3 + 64 66 14 43 60 67 72 73 43 67 Clinically, MS pathology predominantly features macrophages with accompanying neutrophils 74 75 76 44 77 + + 20 37 A recent study reported that the frequency of GM-CSF⁺ Th17-like cells in C57BL/6 mice immunized with MOG positively correlates with EAE severity, suggesting that this specific Th subset may possess heightened encephalitogenic potential. These findings imply that the abundance of GM-CSF⁺ Th17-like cells could serve as a key determinant of disease intensity 11 In clinical studies involving MS patients, the relative distribution of IFN-γ⁺GM-CSF⁺ versus IL-17⁺GM-CSF⁺ Th cells varies significantly across cohorts, indicating heterogeneity in the GM-CSF⁺ Th cell compartment among individuals. This observed diversity underscores the importance of conducting future clinical investigations using stratified analyses with adequately powered sample sizes to derive more definitive conclusions. Moreover, notable discrepancies exist between findings from EAE models and clinical observations in MS. For instance, while anti-IFN-γ monoclonal antibody treatment exacerbates disease in EAE models, administration of IFN-γ in some MS patients has been associated with clinical deterioration 11 44 78 80 As illustrated in Figure 3 + Future research could prioritize several key areas. First, applying single-cell multi-omics technologies to dissect the dynamic heterogeneity and transcriptional or epigenetic regulatory networks of GM-CSF⁺ CD4⁺ T cells at high resolution. Second, refining therapeutic strategies, such as developing dual-targeted approaches that simultaneously inhibit GM-CSF and other pro-inflammatory cytokines (e.g., IL-17 or IFN-γ) implicated in MS pathogenesis. Third, improving animal models by constructing humanized mouse models that more faithfully replicate the phenotypic and functional characteristics of Th cell subsets observed in MS patients. 3.2 Role of GM-CSF + Rheumatoid arthritis (RA) is a chronic autoimmune disease characterized by persistent synovitis, joint destruction, and systemic immune dysregulation, with a global prevalence of approximately 0.5-1%. Women are affected two to three times more often than men. The pathogenesis of RA involves a multifaceted interplay among genetic predisposition, environmental triggers, and aberrant immune responses 81 82 In a pioneering study using the collagen-induced arthritis (CIA) model, Ian K et al. demonstrated that GM-CSF-deficient (GM-CSF⁻/⁻) mice were resistant to arthritis, where heterozygous mice exhibited mild disease and wild-type mice developed severe arthritis, suggesting a dose-dependent contribution of GM-CSF to disease severity. Moreover, exogenous GM-CSF injection exacerbated joint damage, confirming GM-CSF's role as an endogenous pathogenic factor 83 84 bona fide In vitro + + 13 85 86 In the synovial fluid of RA patients, CD4⁺ T cells are the predominant source of GM-CSF, with significantly higher secretion than in healthy controls. GM-CSF + + 87 88 89 92 43 88 93 Despite encouraging preclinical results, clinical trials targeting GM-CSF have yielded mixed outcomes. While early-phase studies of GM-CSF-neutralizing antibodies (e.g., mavrilimumab) demonstrated reductions in inflammatory biomarkers, many patients failed to achieve primary or key secondary endpoints in phase III trials 94 95 It is also essential to recognize fundamental interspecies differences in the biology of GM-CSF⁺ Th cells. In the SKG mouse model, GM-CSF augments macrophage production of IL-1β and IL-6 and promotes the expansion of both Th17 and GM-CSF⁺ Th cell populations 88 95 96 97 84 88 97 98 99 100 101 As summarized in Figure 4 + 3.3 Role of GM-CSF + The critical role of GM-CSF + Figure 5 3.3.1 Role of GM-CSF + Type 1 diabetes (T1D) is an autoimmune disorder characterized by progressive and irreversible destruction of pancreatic β cells, ultimately resulting in insufficient insulin production 102 103 104 107 33 106 109 Emerging evidence suggests that GM-CSF⁺ Th cells play a central role in mediating β cell destruction in T1D. In patients with T1D, autoreactive CD4⁺ T cells targeting self-antigens such as proinsulin and glutamic acid decarboxylase 65 (GAD65) are elevated, with a significant increase in GM-CSF⁺ Th cells among them. These cells contribute to disease progression by exerting multiple pro-inflammatory effects via GM-CSF secretion. On one hand, GM-CSF promotes recruitment of immune cells—including macrophages and neutrophils—into pancreatic islets, enhancing local immune-mediated injury. On the other hand, GM-CSF facilitates Th17 polarization and IL-17 production, amplifying chronic inflammation and accelerating β cell destruction 110 Moreover, GM-CSF⁺ Th cells often co-express IL-17A and IFN-γ, forming a pathogenic feed-forward loop wherein these pro-inflammatory cytokines mutually reinforce their expression. This loop intensifies local inflammation and directly contributes to β cell dysfunction and insulin insufficiency. Clinical studies show that T1D patients exhibit significantly higher peripheral levels of GM-CSF⁺ Th cells compared to healthy controls, correlating positively with plasma IL-17A, IFN-γ, and IL-2 levels 33 110 Findings from animal models and clinical studies further support the pathogenic role of GM-CSF⁺ Th cells in T1D. In clinical trials, T1D patients responding to alefacept therapy showed a marked reduction in circulating GM-CSF⁺ Th cells. Notably, baseline levels of these cells inversely correlated with post-treatment C-peptide retention, suggesting their potential as predictive biomarkers for therapeutic response 33 108 110 Although the regulatory mechanisms underlying GM-CSF⁺ Th cell differentiation remain incompletely understood, IL-23 has been implicated in promoting their expansion through specific signaling pathways. Ustekinumab, a monoclonal antibody targeting the p40 subunit shared by IL-12 and IL-23, has demonstrated efficacy in reducing GM-CSF⁺ Th cell numbers and alleviating β cell loss in T1D models 108 Further exploration of the transcriptional regulation and microenvironmental interactions of GM-CSF⁺ Th cells within pancreatic islets may uncover novel therapeutic targets. In particular, dual-targeted strategies that simultaneously address inflammatory signaling and immune cell migration hold promise for improving clinical outcomes in T1D. Despite ongoing challenges, GM-CSF⁺ Th cells are increasingly recognized as central amplifiers of inflammation and autoimmunity in T1D, offering a new immunological axis for therapeutic innovation. 3.3.2 Role of GM-CSF + Ulcerative colitis (UC) is a chronic inflammatory bowel disease (IBD) affecting millions worldwide, significantly reducing quality of life and increasing the risk of colorectal cancer. While its immune network is complex, recent research has identified GM-CSF-producing Th cells as key pathogenic drivers that amplify intestinal inflammation. This view is supported by foundational evidence from dextran sodium sulfate (DSS)-induced colitis models, where mice genetically deficient in GM-CSF ( Csf2 -/- 12 Mechanistically, GM-CSF + + 30 Despite this strong evidence, the narrative is not without complexity. An early study from 2014 reported that conditional knockout of GM-CSF in CD4 + 21 + 30 Perhaps the most unique aspect of UC immunopathology is the powerful regulatory role exerted by the intestinal epithelium itself. IFN-γ signaling in intestinal epithelial cells (IECs) has been found to be profoundly protective. In mice with an IEC-specific deletion of the IFN-γ receptor (IfngrΔIEC), GM-CSF + 12 + + 12 30 This intricate regulatory network highlights the therapeutic potential of targeting this axis. While anti-GM-CSF antibodies can alleviate inflammation, their efficacy may be limited unless combined with other immunomodulators. The unique dependency on the IL-1β/NLRP3 pathway suggests that inhibitors of this pathway could be particularly effective in UC. Furthermore, strategies that enhance the protective IFN-γ signaling within the intestinal epithelium could offer a novel approach to restoring immune homeostasis in the gut. Unraveling the distinct functional characteristics of tissue-resident versus circulating GM-CSF + 3.3.3 Role of GM-CSF + Beyond the major autoimmune diseases, the pathogenic footprint of GM-CSF-producing Th cells extends to a wide array of less common but severe disorders. While the specific clinical manifestations differ, a synthesis of these findings reveals a set of conserved, fundamental pathogenic principles that these cells employ to drive tissue damage. A primary and universal mechanism is the recruitment and activation of myeloid cells. This principle is vividly illustrated across multiple organ systems. In the skin of patients with pustular psoriasis, a unique IL-23R + + 111 + 112 A second core principle is the induction of destructive enzymatic pathways in target tissues. This is exemplified in crescentic glomerulonephritis (cGN), where GM-CSF+ Th1-like cells accumulate in the kidneys. The GM-CSF they produce activates infiltrating monocyte-derived cells, inducing them to secrete matrix metalloproteinase 12 (MMP12). This enzyme directly degrades the glomerular basement membrane, leading to irreversible kidney damage and functional decline. This discovery positions the GM-CSF/MMP12 axis as a key therapeutic target for preventing renal destruction in T-cell-driven nephritis 113 Third, GM-CSF + 114 + + 115 Finally, the central role of these cells is underscored in the context of alloimmunity, such as in graft-versus-host disease (GVHD). Here, GM-CSF produced by donor-derived T cells is a critical factor that promotes myeloid cell production of IL-1β and ROS, driving multi-organ damage. The pathogenic importance of this axis is conserved across numerous other inflammatory conditions, including juvenile idiopathic arthritis, Behçet's disease, and endometriosis 34 36 116 122 Moreover, as uncovered recently in an elegant piece of work by Gan and colleagues 123 + + + + in vivo 123 + + In conclusion, regardless of the specific disease context, be it the joint, skin, eye, or kidney, GM-CSF + 4. Translational Applications Targeting GM-CSF + GM-CSF⁺ Th cells represent a highly heterogeneous and plastic subset of helper T cells. Their indispensable role in the pathogenesis of multiple autoimmune diseases has been confirmed in both clinical and experimental settings. Defined by their dependence on STAT5/BHLHE40 signaling, co-expression of pro-inflammatory cytokines (e.g., IL-17A, IFN-γ), and close interaction with myeloid cells, GM-CSF⁺ Th cells offer promising targets for next-generation immunotherapies. 4.1 Cytokine- and receptor-based therapeutic strategies Several cytokine pathways crucial for GM-CSF⁺ Th cell differentiation have been exploited therapeutically. For instance, IL-2/IL-2R signaling is known to promote GM-CSF⁺ Th differentiation through STAT5 phosphorylation. Clinical use of daclizumab, an anti-IL-2Rα monoclonal antibody, showed efficacy in reducing inflammatory activity in relapsing multiple sclerosis (MS) by limiting GM-CSF secretion 124 125 126 Similarly, IL-7 and IL-15 have also been implicated in the differentiation of GM-CSF⁺ Th cells via STAT5 activation. In vitro 127 128 129 130 108 4.2 Direct GM-CSF pathway inhibition Anti-GM-CSF monoclonal antibodies represent a more direct strategy. MOR103 showed favorable safety and tolerability in phase 1b trials for MS 131 132 94 133 148 Table 2 Notably, the novel anti-GM-CSF agent otilimab failed to meet primary and secondary endpoints in RA patients refractory to DMARDs or JAK inhibitors. Despite encouraging preclinical data, it showed no superiority over sarilumab, likely due to suboptimal patient selection and late-stage intervention 94 4.3 Inflammasome and IL-1 axis modulation The NLRP3 inflammasome, which can promote GM-CSF production via IL-1β amplification, is another relevant target. MCC950, a selective NLRP3 inhibitor, has shown anti-inflammatory efficacy in multiple autoimmune disease models—including MS 149 150 151 152 153 154 Canakinumab, a monoclonal antibody against IL-1β, has demonstrated favorable safety and efficacy in autoimmune settings 155 4.4 Precision biomarkers and stratified therapies Advances in mass cytometry and ELISA-based serum profiling enable dynamic tracking of GM-CSF⁺ Th cells or circulating GM-CSF levels. For example, a ≥50% reduction in GM-CSF⁺ Th cells correlates with improved joint swelling index in RA 29 35 27 48 156 4.5 Targeting STAT5 and transcriptional networks STAT5 is a critical regulator of GM-CSF⁺ Th cell fate. IL-2, IL-7, and IL-15 converge on STAT5 phosphorylation to drive GM-CSF⁺ Th differentiation. Although several STAT5 inhibitors (e.g., pimozide) have demonstrated efficacy in oncology 157 158 To improve specificity, cell surface markers such as CD69, CXCR4, and CX3CR1 may be used to guide GM-CSF⁺ Th cell-selective targeting. In addition, transcription factors including BHLHE40, Rel, RUNX1, NLRP3, and T-bet have also been implicated in GM-CSF⁺ Th cell regulation, offering new molecular targets for therapy. 4.6 CRISPR-Cas9 gene editing Recent advances in CRISPR-Cas9 gene editing provide precise tools for disrupting key transcriptional regulators. Lin et al. developed mouse models harboring Y694F and Y699F mutations in STAT5A/B, which abrogate phosphorylation-dependent GM-CSF⁺ Th cell differentiation 159 Despite the immense promise of these strategies, significant translational hurdles remain before they can be widely implemented. The most formidable of these is the issue of cross-species differences. The markers used to identify GM-CSF + + Ultimately, effectively targeting these “inflammatory amplifiers” requires more than just better models; it demands a paradigm shift in our therapeutic philosophy. The future of treating autoimmunity lies in moving beyond broad, indiscriminate immunosuppression toward the goal of precision immune remodeling. This future will be built on a foundation of multi-dimensional strategies that leverage cutting-edge technologies like epigenetic editing to correct faulty gene programs, synthetic biology to create “smart” therapies (e.g., logic-gated CAR-T cells), and artificial intelligence to design patient-specific interventions based on complex multi-omics data. The ultimate goal is no longer simply to dampen the immune response, but to selectively erase pathogenic immune memory, restore self-tolerance, and rebuild a balanced and functional immune homeostasis, offering the potential for truly curative solutions for autoimmune diseases. A summary of these current and future therapeutic strategies is provided in Table 3 Figure 6 5. Take-Home Message and Future Perspectives GM-CSF⁺ Th cells constitute a highly heterogeneous and plastic subset of CD4⁺ helper T cells that act as “inflammatory amplifiers” in autoimmune diseases. Through the secretion of GM-CSF, these cells activate myeloid populations such as macrophages and dendritic cells, disrupt tissue barriers (e.g., the blood-brain barrier, pancreatic islets, or synovial membranes), induce oxidative stress, and engage in feed-forward loops alongside pro-inflammatory cytokines like IL-17 and IFN-γ, thereby driving disease progression. Across different disease contexts, GM-CSF⁺ Th cells exhibit disease-specific phenotypes and regulatory pathways. For instance, a Th1-like profile predominates in RA, whereas in T1D, a notable enrichment of IFN-γ⁺IL-17⁺GM-CSF⁺ triple-positive cells is observed. Their differentiation is governed by a network of signaling pathways, including IL-23/STAT3/RORγt, IL-7/STAT5, as well as epigenetic mechanisms. Despite the promising outcomes observed in preclinical models using GM-CSF-targeted therapies, including monoclonal antibodies, STAT5 inhibitors, and epigenetic modifiers, clinical translation remains hampered by several challenges. These include inter-patient heterogeneity in therapeutic efficacy, unclear windows for optimal intervention, and biological discrepancies between human disease and animal models. Future research should aim to achieve mechanistic and translational breakthroughs in multiple dimensions. First, the integration of single-cell RNA sequencing (scRNA-seq), spatial transcriptomics, and epigenomic profiling will be instrumental in mapping the spatiotemporal evolution and plasticity of GM-CSF⁺ Th subsets across tissues and disease stages. Elucidating regulatory circuits, such as BHLHE40-RUNX1 interactions, may uncover lineage-defining checkpoints. Second, dissecting the metabolic programs of GM-CSF⁺ Th cells, including glycolysis and glutaminolysis, could enable the design of metabolic reprogramming strategies as adjunct therapies. Third, combining genetic risk variants (e.g., IL2RA, ZNF35), epigenetic biomarkers (e.g., GM-CSF promoter methylation), and immunophenotypic data (e.g., from multi-omic profiling) will facilitate the development of predictive biomarker systems for therapeutic stratification. Next-generation therapeutic designs, such as logic-gated CAR-Tregs or switchable STAT5 inhibitors, may achieve spatiotemporal control of GM-CSF⁺ Th cell activity while minimizing systemic immunosuppression. Combinatorial approaches targeting GM-CSF alongside key inflammatory pathways (e.g., IL-1β, IL-23, or CXCL10) may overcome the challenge of cytokine redundancy; for instance, combining anti-GM-CSF monoclonal antibodies with JAK inhibitors could yield synergistic effects. Multifunctional nanomedicines that simultaneously suppress inflammation and promote tissue regeneration (e.g., β-cell recovery or remyelination) may offer a comprehensive therapeutic paradigm. Advances in translational modeling, including organoid-immune cell co-culture systems and humanized mouse models, can more accurately replicate human disease microenvironments and bridge cross-species gaps in drug efficacy. Finally, longitudinal cohort studies in high-risk populations (e.g., preclinical T1D or RA) may help define the critical threshold of GM-CSF⁺ Th cell expansion, guiding early and precisely timed interventions. 6. Concluding Remarks Research on GM-CSF + Supplementary Material Supplementary table. This work was supported by the Clinical Research Innovation Project, West China Hospital, Sichuan University (2019HXCX01). XYM is supported by National Natural Science Foundation of China (82303057), Natural Science Foundation of Hubei Province of China (2023AFB521), and “Chutian Scholars Program” of Hubei Province of China. SSF was supported by the Natural Science Fund and Innovation Horizontal Project of Hubei Minzu University (4178037 and H23123), the guiding Project of Hubei Provincial Department of Education (B2019090), the Youth Project of the Clinical Research Center of Minzu University Hospital (OIR202402Q). XX is supported by the Research Fund for the Doctoral Program of Anhui Medical University (0801059201). YBL is supported by the National Natural Science Foundation of China (No. 82271828) and scientific application and foundation project of Science and Technology Department of Guangxi Province (No. AB25069068). Author contributions SSF, XX, YBL, and XYM: writing - original draft; YL, XX, YXM, and YBL: writing - review and editing; YL: conceptualization, project administration, supervision, funding acquisition. All authors have read and approved the final manuscript. Generative AI statement Generative AI GPT-4o, Claude-Sonnet-3.7, Gemini-2.5-Pro, and Grok 3.0 were used for language assistance during writing but not for any content generation. 1 Conrad N Misra S Verbakel JY Verbeke G Molenberghs G Taylor PN Incidence, prevalence, and co-occurrence of autoimmune disorders over time and by age, sex, and socioeconomic status: a population-based cohort study of 22 million individuals in the UK Lancet 2023 401 1878 90 37156255 10.1016/S0140-6736(23)00457-9 2 Winthrop KL Mease P Kerschbaumer A Voll RE Breedveld FC Smolen JS Unmet need in rheumatology: reports from the Advances in Targeted Therapies meeting, 2023 Ann Rheum Dis 2024 83 409 16 38123338 10.1136/ard-2023-224916 3 Schett G Mackensen A Mougiakakos D CAR T-cell therapy in autoimmune diseases Lancet 2023 402 2034 44 37748491 10.1016/S0140-6736(23)01126-1 4 Zhu J Yamane H Paul WE Differentiation of effector CD4 T cell populations (*) Annu Rev Immunol 2010 28 445 89 20192806 10.1146/annurev-immunol-030409-101212 PMC3502616 5 Sun L Su Y Jiao A Wang X Zhang B T cells in health and disease Signal Transduct Target Ther 2023 8 235 37332039 10.1038/s41392-023-01471-y PMC10277291 6 Jain A Irizarry-Caro RA McDaniel MM Chawla AS Carroll KR Overcast GR T cells instruct myeloid cells to produce inflammasome-independent IL-1β and cause autoimmunity Nat Immunol 2020 21 65 74 31848486 10.1038/s41590-019-0559-y PMC6927526 7 Dardalhon V Korn T Kuchroo VK Anderson AC Role of Th1 and Th17 cells in organ-specific autoimmunity J Autoimmun 2008 31 252 6 18502610 10.1016/j.jaut.2008.04.017 PMC3178062 8 Ferber IA Brocke S Taylor-Edwards C Ridgway W Dinisco C Steinman L Mice with a disrupted IFN-gamma gene are susceptible to the induction of experimental autoimmune encephalomyelitis (EAE) J Immunol 1996 156 5 7 8598493 9 Lublin FD Knobler RL Kalman B Goldhaber M Marini J Perrault M Monoclonal anti-gamma interferon antibodies enhance experimental allergic encephalomyelitis Autoimmunity 1993 16 267 74 7517706 10.3109/08916939309014645 10 Mills KHG IL-17 and IL-17-producing cells in protection versus pathology Nat Rev Immunol 2023 23 38 54 35790881 10.1038/s41577-022-00746-9 PMC9255545 11 El-Behi M Ciric B Dai H Yan Y Cullimore M Safavi F The encephalitogenicity of T(H)17 cells is dependent on IL-1- and IL-23-induced production of the cytokine GM-CSF Nat Immunol 2011 12 568 75 21516111 10.1038/ni.2031 PMC3116521 12 Malik A Sharma D Aguirre-Gamboa R McGrath S Zabala S Weber C Epithelial IFNγ signalling and compartmentalized antigen presentation orchestrate gut immunity Nature 2023 623 1044 52 37993709 10.1038/s41586-023-06721-1 PMC11361632 13 Noster R Riedel R Mashreghi MF Radbruch H Harms L Haftmann C IL-17 and GM-CSF expression are antagonistically regulated by human T helper cells Sci Transl Med 2014 6 241ra80 10.1126/scitranslmed.3008706 24944195 14 Codarri L Gyülvészi G Tosevski V Hesske L Fontana A Magnenat L RORγt drives production of the cytokine GM-CSF in helper T cells, which is essential for the effector phase of autoimmune neuroinflammation Nat Immunol 2011 12 560 7 21516112 10.1038/ni.2027 15 Gerondakis S Strasser A Metcalf D Grigoriadis G Scheerlinck JY Grumont RJ Rel-deficient T cells exhibit defects in production of interleukin 3 and granulocyte-macrophage colony-stimulating factor Proc Natl Acad Sci U S A 1996 93 3405 9 8622948 10.1073/pnas.93.8.3405 PMC39621 16 Damsker JM Hansen AM Caspi RR Th1 and Th17 cells: adversaries and collaborators Ann N Y Acad Sci 2010 1183 211 21 20146717 10.1111/j.1749-6632.2009.05133.x PMC2914500 17 Kamali AN Noorbakhsh SM Hamedifar H Jadidi-Niaragh F Yazdani R Bautista JM A role for Th1-like Th17 cells in the pathogenesis of inflammatory and autoimmune disorders Mol Immunol 2019 105 107 15 30502718 10.1016/j.molimm.2018.11.015 18 Chen Y Dana R Autoimmunity in dry eye disease - An updated review of evidence on effector and memory Th17 cells in disease pathogenicity Autoimmun Rev 2021 20 102933 34509656 10.1016/j.autrev.2021.102933 PMC8530974 19 Zhang J Roberts AI Liu C Ren G Xu G Zhang L A novel subset of helper T cells promotes immune responses by secreting GM-CSF Cell Death Differ 2013 20 1731 41 24076588 10.1038/cdd.2013.130 PMC3824596 20 Komuczki J Tuzlak S Friebel E Hartwig T Spath S Rosenstiel P Fate-Mapping of GM-CSF Expression Identifies a Discrete Subset of Inflammation-Driving T Helper Cells Regulated by Cytokines IL-23 and IL-1β Immunity 2019 50 1289 304.e6 31079916 10.1016/j.immuni.2019.04.006 21 Sheng W Yang F Zhou Y Yang H Low PY Kemeny DM STAT5 programs a distinct subset of GM-CSF-producing T helper cells that is essential for autoimmune neuroinflammation Cell Res 2014 24 1387 402 25412660 10.1038/cr.2014.154 PMC4260352 22 Laurent C Deblois G Clénet ML Carmena Moratalla A Farzam-Kia N Girard M Interleukin-15 enhances proinflammatory T-cell responses in patients with MS and EAE Neurol Neuroimmunol Neuroinflamm 2021 8 10.1212/NXI.0000000000000931 PMC7745728 33323466 23 Galli E Hartmann FJ Schreiner B Ingelfinger F Arvaniti E Diebold M GM-CSF and CXCR4 define a T helper cell signature in multiple sclerosis Nat Med 2019 25 1290 300 31332391 10.1038/s41591-019-0521-4 PMC6689469 24 Deng YN Bellanti JA Zheng SG Essential Kinases and Transcriptional Regulators and Their Roles in Autoimmunity Biomolecules 2019 9 10.3390/biom9040145 PMC6523499 30974919 25 Yosef N Shalek AK Gaublomme JT Jin H Lee Y Awasthi A Dynamic regulatory network controlling TH17 cell differentiation Nature 2013 496 461 8 23467089 10.1038/nature11981 PMC3637864 26 Lin CC Bradstreet TR Schwarzkopf EA Sim J Carrero JA Chou C Bhlhe40 controls cytokine production by T cells and is essential for pathogenicity in autoimmune neuroinflammation Nat Commun 2014 5 3551 24699451 10.1038/ncomms4551 PMC4016562 27 Éliás S Schmidt A Gomez-Cabrero D Tegnér J Gene Regulatory Network of Human GM-CSF-Secreting T Helper Cells J Immunol Res 2021 2021 8880585 34285924 10.1155/2021/8880585 PMC8275380 28 Hasegawa H Mizoguchi I Orii N Inoue S Katahira Y Yoneto T IL-23p19 and CD5 antigen-like form a possible novel heterodimeric cytokine and contribute to experimental autoimmune encephalomyelitis development Sci Rep 2021 11 5266 33664371 10.1038/s41598-021-84624-9 PMC7933155 29 Guo N Ye S Zhang K Yu X Cui H Yang X A critical epitope in CD147 facilitates memory CD4(+) T-cell hyper-activation in rheumatoid arthritis Cell Mol Immunol 2019 16 568 79 29563614 10.1038/s41423-018-0012-4 PMC6804595 30 Hu Y Xu F Zhang R Legarda D Dai J Wang D Interleukin-1β-induced IRAK1 ubiquitination is required for T(H)-GM-CSF cell differentiation in T cell-mediated inflammation J Autoimmun 2019 102 50 64 31080014 10.1016/j.jaut.2019.04.010 31 Cravens PD Hussain RZ Zacharias TE Ben LH Herndon E Vinnakota R Lymph node-derived donor encephalitogenic CD4+ T cells in C57BL/6 mice adoptive transfer experimental autoimmune encephalomyelitis highly express GM-CSF and T-bet J Neuroinflammation 2011 8 73 21702922 10.1186/1742-2094-8-73 PMC3161869 32 Rasouli J Casella G Yoshimura S Zhang W Xiao D Garifallou J A distinct GM-CSF(+) T helper cell subset requires T-bet to adopt a T(H)1 phenotype and promote neuroinflammation Sci Immunol 2020 5 10.1126/sciimmunol.aba9953 33097590 33 Balmas E Chen J Hu AK DeBerg HA Rosasco MG Gersuk VH Islet-autoreactive CD4+ T cells are linked with response to alefacept in type 1 diabetes JCI Insight 2023 8 10.1172/jci.insight.167881 PMC10721267 37751304 34 Piper C Hainstock E Yin-Yuan C Chen Y Khatun A Kasmani MY Single-cell immune profiling reveals a developmentally distinct CD4+ GM-CSF+ T-cell lineage that induces GI tract GVHD Blood Adv 2022 6 2791 804 35015822 10.1182/bloodadvances.2021006084 PMC9092418 35 Hartmann FJ Khademi M Aram J Ammann S Kockum I Constantinescu C Multiple sclerosis-associated IL2RA polymorphism controls GM-CSF production in human TH cells Nat Commun 2014 5 5056 25278028 10.1038/ncomms6056 36 Tugues S Amorim A Spath S Martin-Blondel G Schreiner B De Feo D Graft-versus-host disease, but not graft-versus-leukemia immunity, is mediated by GM-CSF-licensed myeloid cells Sci Transl Med 2018 10 10.1126/scitranslmed.aat8410 30487251 37 Grifka-Walk HM Giles DA Segal BM IL-12-polarized Th1 cells produce GM-CSF and induce EAE independent of IL-23 Eur J Immunol 2015 45 2780 6 26220255 10.1002/eji.201545800 PMC5352159 38 Arbelaez CA Glatigny S Duhen R Eberl G Oukka M Bettelli E IL-7/IL-7 Receptor Signaling Differentially Affects Effector CD4+ T Cell Subsets Involved in Experimental Autoimmune Encephalomyelitis J Immunol 2015 195 1974 83 26223651 10.4049/jimmunol.1403135 PMC4546887 39 Koch-Henriksen N Magyari M Apparent changes in the epidemiology and severity of multiple sclerosis Nat Rev Neurol 2021 17 676 88 34584250 10.1038/s41582-021-00556-y 40 Lassmann H van Horssen J Mahad D Progressive multiple sclerosis: pathology and pathogenesis Nat Rev Neurol 2012 8 647 56 23007702 10.1038/nrneurol.2012.168 41 Panitch HS Hirsch RL Haley AS Johnson KP Exacerbations of multiple sclerosis in patients treated with gamma interferon Lancet 1987 1 893 5 2882294 10.1016/s0140-6736(87)92863-7 42 Haak S Croxford AL Kreymborg K Heppner FL Pouly S Becher B IL-17A and IL-17F do not contribute vitally to autoimmune neuro-inflammation in mice J Clin Invest 2009 119 61 9 19075395 10.1172/JCI35997 PMC2613466 43 McQualter JL Darwiche R Ewing C Onuki M Kay TW Hamilton JA Granulocyte macrophage colony-stimulating factor: a new putative therapeutic target in multiple sclerosis J Exp Med 2001 194 873 82 11581310 10.1084/jem.194.7.873 PMC2193476 44 Kroenke MA Carlson TJ Andjelkovic AV Segal BM IL-12- and IL-23-modulated T cells induce distinct types of EAE based on histology, CNS chemokine profile, and response to cytokine inhibition J Exp Med 2008 205 1535 41 18573909 10.1084/jem.20080159 PMC2442630 45 Carrieri PB Provitera V De Rosa T Tartaglia G Gorga F Perrella O Profile of cerebrospinal fluid and serum cytokines in patients with relapsing-remitting multiple sclerosis: a correlation with clinical activity Immunopharmacol Immunotoxicol 1998 20 373 82 9736442 10.3109/08923979809034820 46 Ghezzi L Cantoni C Cignarella F Bollman B Cross AH Salter A T cells producing GM-CSF and IL-13 are enriched in the cerebrospinal fluid of relapsing MS patients Mult Scler 2020 26 1172 86 31237799 10.1177/1352458519852092 47 Rasouli J Ciric B Imitola J Gonnella P Hwang D Mahajan K Expression of GM-CSF in T Cells Is Increased in Multiple Sclerosis and Suppressed by IFN-β Therapy J Immunol 2015 194 5085 93 25917097 10.4049/jimmunol.1403243 PMC4433790 48 Håkansson I Tisell A Cassel P Blennow K Zetterberg H Lundberg P Neurofilament levels, disease activity and brain volume during follow-up in multiple sclerosis J Neuroinflammation 2018 15 209 30021640 10.1186/s12974-018-1249-7 PMC6052680 49 Spath S Komuczki J Hermann M Pelczar P Mair F Schreiner B Dysregulation of the Cytokine GM-CSF Induces Spontaneous Phagocyte Invasion and Immunopathology in the Central Nervous System Immunity 2017 46 245 60 28228281 10.1016/j.immuni.2017.01.007 50 Broux B Mizee MR Vanheusden M van der Pol S van Horssen J Van Wijmeersch B IL-15 amplifies the pathogenic properties of CD4+CD28- T cells in multiple sclerosis J Immunol 2015 194 2099 109 25617471 10.4049/jimmunol.1401547 51 Kaskow BJ Baecher-Allan C Effector T Cells in Multiple Sclerosis Cold Spring Harb Perspect Med 2018 8 10.1101/cshperspect.a029025 PMC5880159 29358315 52 Monaghan KL Wan ECK The Role of Granulocyte-Macrophage Colony-Stimulating Factor in Murine Models of Multiple Sclerosis Cells 2020 9 10.3390/cells9030611 PMC7140439 32143326 53 Rasouli J Casella G Zhang W Xiao D Kumar G Fortina P Transcription Factor RUNX3 Mediates Plasticity of ThGM Cells Toward Th1 Phenotype Front Immunol 2022 13 912583 35860266 10.3389/fimmu.2022.912583 PMC9289370 54 Stojić-Vukanić Z Pilipović I Vujnović I Nacka-Aleksić M Petrović R Arsenović-Ranin N GM-CSF-Producing Th Cells in Rats Sensitive and Resistant to Experimental Autoimmune Encephalomyelitis PLoS One 2016 11 e0166498 27832210 10.1371/journal.pone.0166498 PMC5104330 55 Fletcher JM Lalor SJ Sweeney CM Tubridy N Mills KH T cells in multiple sclerosis and experimental autoimmune encephalomyelitis Clin Exp Immunol 2010 162 1 11 20682002 10.1111/j.1365-2249.2010.04143.x PMC2990924 56 Carbajal KS Mironova Y Ulrich-Lewis JT Kulkarni D Grifka-Walk HM Huber AK Th Cell Diversity in Experimental Autoimmune Encephalomyelitis and Multiple Sclerosis J Immunol 2015 195 2552 9 26238492 10.4049/jimmunol.1501097 PMC4561206 57 Saligrama N Zhao F Sikora MJ Serratelli WS Fernandes RA Louis DM Opposing T cell responses in experimental autoimmune encephalomyelitis Nature 2019 572 481 7 31391585 10.1038/s41586-019-1467-x PMC7145319 58 Restorick SM Durant L Kalra S Hassan-Smith G Rathbone E Douglas MR CCR6(+) Th cells in the cerebrospinal fluid of persons with multiple sclerosis are dominated by pathogenic non-classic Th1 cells and GM-CSF-only-secreting Th cells Brain Behav Immun 2017 64 71 9 28336414 10.1016/j.bbi.2017.03.008 PMC5490506 59 Ifergan I Davidson TS Kebir H Xu D Palacios-Macapagal D Cann J Targeting the GM-CSF receptor for the treatment of CNS autoimmunity J Autoimmun 2017 84 1 11 28641926 10.1016/j.jaut.2017.06.005 PMC5647260 60 Croxford AL Spath S Becher B GM-CSF in Neuroinflammation: Licensing Myeloid Cells for Tissue Damage Trends Immunol 2015 36 651 62 26431942 10.1016/j.it.2015.08.004 61 Segal BM The Diversity of Encephalitogenic CD4+ T Cells in Multiple Sclerosis and Its Animal Models J Clin Med 2019 8 10.3390/jcm8010120 PMC6352150 30669462 62 Costa-Pereira S Lanzinger M Núñez N Villar-Vesga J Andreadou M Prisco F Regulatory T cells suppress GM-CSF-producing T helper cells via IL-2 modulation to restrain immunopathology Cell Rep 2025 44 115642 40315053 10.1016/j.celrep.2025.115642 63 Van Dis E Fox DM Morrison HM Fines DM Babirye JP McCann LH IFN-γ-independent control of M. tuberculosis requires CD4 T cell-derived GM-CSF and activation of HIF-1α PLoS Pathog 2022 18 e1010721 35877763 10.1371/journal.ppat.1010721 PMC9352196 64 McWilliams IL Rajbhandari R Nozell S Benveniste E Harrington LE STAT4 controls GM-CSF production by both Th1 and Th17 cells during EAE J Neuroinflammation 2015 12 128 26123499 10.1186/s12974-015-0351-3 PMC4491892 65 Zhang H Zhang S Zhang J Liu D Wei J Fang W ZO-1 expression is suppressed by GM-CSF via miR-96/ERG in brain microvascular endothelial cells J Cereb Blood Flow Metab 2018 38 809 22 28430012 10.1177/0271678X17702668 PMC5987931 66 Croxford AL Lanzinger M Hartmann FJ Schreiner B Mair F Pelczar P The Cytokine GM-CSF Drives the Inflammatory Signature of CCR2+ Monocytes and Licenses Autoimmunity Immunity 2015 43 502 14 26341401 10.1016/j.immuni.2015.08.010 67 Ponomarev ED Shriver LP Maresz K Pedras-Vasconcelos J Verthelyi D Dittel BN GM-CSF production by autoreactive T cells is required for the activation of microglial cells and the onset of experimental autoimmune encephalomyelitis J Immunol 2007 178 39 48 17182538 10.4049/jimmunol.178.1.39 68 Feng R Muraleedharan Saraswathy V Mokalled MH Cavalli V Self-renewing macrophages in dorsal root ganglia contribute to promote nerve regeneration Proc Natl Acad Sci U S A 2023 120 e2215906120 36763532 10.1073/pnas.2215906120 PMC9963351 69 Kobayashi SD Voyich JM Whitney AR DeLeo FR Spontaneous neutrophil apoptosis and regulation of cell survival by granulocyte macrophage-colony stimulating factor J Leukoc Biol 2005 78 1408 18 16204629 10.1189/jlb.0605289 70 Martin SJ Brand-Arzamendi K Saab G Muccilli A Oh J Schneider R GM-CSF is a marker of compartmentalised intrathecal inflammation in multiple sclerosis Mult Scler 2023 29 1373 82 37700482 10.1177/13524585231195861 71 Russi AE Walker-Caulfield ME Guo Y Lucchinetti CF Brown MA Meningeal mast cell-T cell crosstalk regulates T cell encephalitogenicity J Autoimmun 2016 73 100 10 27396526 10.1016/j.jaut.2016.06.015 PMC6364701 72 Gilgun-Sherki Y Melamed E Offen D The role of oxidative stress in the pathogenesis of multiple sclerosis: the need for effective antioxidant therapy J Neurol 2004 251 261 8 15015004 10.1007/s00415-004-0348-9 73 King IL Kroenke MA Segal BM GM-CSF-dependent, CD103+ dermal dendritic cells play a critical role in Th effector cell differentiation after subcutaneous immunization J Exp Med 2010 207 953 61 20421390 10.1084/jem.20091844 PMC2867280 74 Brück W Sommermeier N Bergmann M Zettl U Goebel HH Kretzschmar HA Macrophages in multiple sclerosis Immunobiology 1996 195 588 600 8933159 10.1016/S0171-2985(96)80024-6 75 Marignier R Hacohen Y Cobo-Calvo A Pröbstel AK Aktas O Alexopoulos H Myelin-oligodendrocyte glycoprotein antibody-associated disease Lancet Neurol 2021 20 762 72 34418402 10.1016/S1474-4422(21)00218-0 76 Nunes JC Radbruch H Walz R Lin K Stenzel W Prokop S The most fulminant course of the Marburg variant of multiple sclerosis-autopsy findings Mult Scler 2015 21 485 7 25824955 10.1177/1352458514537366 77 Elenein RG Sharer LR Cook SD Pachner AR Michaels J Hillen ME A second case of Marburg's variant of multiple sclerosis with vasculitis and extensive demyelination Mult Scler 2011 17 1531 8 21816761 10.1177/1352458511414042 78 Pierson ER Goverman JM GM-CSF is not essential for experimental autoimmune encephalomyelitis but promotes brain-targeted disease JCI Insight 2017 2 e92362 28405624 10.1172/jci.insight.92362 PMC5374070 79 Arellano G Ottum PA Reyes LI Burgos PI Naves R Stage-Specific Role of Interferon-Gamma in Experimental Autoimmune Encephalomyelitis and Multiple Sclerosis Front Immunol 2015 6 492 26483787 10.3389/fimmu.2015.00492 PMC4586507 80 Safavi F Thome R Li Z Zhang GX Rostami A Dimethyl fumarate suppresses granulocyte macrophage colony-stimulating factor-producing Th1 cells in CNS neuroinflammation Neurol Neuroimmunol Neuroinflamm 2020 7 10.1212/NXI.0000000000000729 PMC7217662 32371548 81 Di Matteo A Bathon JM Emery P Rheumatoid arthritis Lancet 2023 402 2019 33 38240831 10.1016/S0140-6736(23)01525-8 82 Takanashi S Kaneko Y Takeuchi T Elderly patients with comorbidities in the definition of difficult-to-treat rheumatoid arthritis Ann Rheum Dis 2021 80 1491 3 33962961 10.1136/annrheumdis-2021-220315 83 Campbell IK Rich MJ Bischof RJ Dunn AR Grail D Hamilton JA Protection from collagen-induced arthritis in granulocyte-macrophage colony-stimulating factor-deficient mice J Immunol 1998 161 3639 44 9759887 84 Yamada H Haraguchi A Sakuraba K Okazaki K Fukushi JI Mizu-Uchi H Th1 is the predominant helper T cell subset that produces GM-CSF in the joint of rheumatoid arthritis RMD Open 2017 3 e000487 28955490 10.1136/rmdopen-2017-000487 PMC5604604 85 Khullar A Dhir V Saikia B Yadav AK Leishangthem B Prasad CB Rheumatoid arthritis synovial fluid shows enrichment of T-cells producing GMCSF which are polyfunctional for TNFα and IFNγ Clin Exp Rheumatol 2024 42 1435 41 38372731 10.55563/clinexprheumatol/dyjbvf 86 Bystrom J Clanchy FI Taher TE Al-Bogami MM Muhammad HA Alzabin S Response to Treatment with TNFα Inhibitors in Rheumatoid Arthritis Is Associated with High Levels of GM-CSF and GM-CSF(+) T Lymphocytes Clin Rev Allergy Immunol 2017 53 265 76 28488248 10.1007/s12016-017-8610-y PMC5597702 87 Cook AD Braine EL Campbell IK Rich MJ Hamilton JA Blockade of collagen-induced arthritis post-onset by antibody to granulocyte-macrophage colony-stimulating factor (GM-CSF): requirement for GM-CSF in the effector phase of disease Arthritis Res 2001 3 293 8 11549370 10.1186/ar318 PMC64841 88 Reynolds G Gibbon JR Pratt AG Wood MJ Coady D Raftery G Synovial CD4+ T-cell-derived GM-CSF supports the differentiation of an inflammatory dendritic cell population in rheumatoid arthritis Ann Rheum Dis 2016 75 899 907 25923217 10.1136/annrheumdis-2014-206578 PMC4853576 89 Tsark EC Wang W Teng YC Arkfeld D Dodge GR Kovats S Differential MHC class II-mediated presentation of rheumatoid arthritis autoantigens by human dendritic cells and macrophages J Immunol 2002 169 6625 33 12444176 10.4049/jimmunol.169.11.6625 90 Nakano H Lin KL Yanagita M Charbonneau C Cook DN Kakiuchi T Blood-derived inflammatory dendritic cells in lymph nodes stimulate acute T helper type 1 immune responses Nat Immunol 2009 10 394 402 19252492 10.1038/ni.1707 PMC2668134 91 Serbina NV Salazar-Mather TP Biron CA Kuziel WA Pamer EG TNF/iNOS-producing dendritic cells mediate innate immune defense against bacterial infection Immunity 2003 19 59 70 12871639 10.1016/s1074-7613(03)00171-7 92 Rivollier A He J Kole A Valatas V Kelsall BL Inflammation switches the differentiation program of Ly6Chi monocytes from antiinflammatory macrophages to inflammatory dendritic cells in the colon J Exp Med 2012 209 139 55 22231304 10.1084/jem.20101387 PMC3260867 93 Gravallese EM Firestein GS Rheumatoid Arthritis - Common Origins, Divergent Mechanisms N Engl J Med 2023 388 529 42 36780677 10.1056/NEJMra2103726 94 Taylor PC Weinblatt ME McInnes IB Atsumi T Strand V Takeuchi T Anti-GM-CSF otilimab versus sarilumab or placebo in patients with rheumatoid arthritis and inadequate response to targeted therapies: a phase III randomised trial (contRAst 3) Ann Rheum Dis 2023 82 1527 37 37696589 10.1136/ard-2023-224449 PMC10646837 95 Shiomi A Usui T Ishikawa Y Shimizu M Murakami K Mimori T GM-CSF but not IL-17 is critical for the development of severe interstitial lung disease in SKG mice J Immunol 2014 193 849 59 24951817 10.4049/jimmunol.1303255 96 Becher B Segal BM T(H)17 cytokines in autoimmune neuro-inflammation Curr Opin Immunol 2011 23 707 12 21907555 10.1016/j.coi.2011.08.005 PMC3535446 97 Honzawa T Matsuo K Hosokawa S Kamimura M Kaibori Y Hara Y CCR4 plays a pivotal role in Th17 cell recruitment and expansion in a mouse model of rheumatoid arthritis Int Immunol 2022 34 635 42 35997787 10.1093/intimm/dxac041 98 Sendo S Saegusa J Okano T Takahashi S Akashi K Morinobu A CD11b+Gr-1(dim) Tolerogenic Dendritic Cell-Like Cells Are Expanded in Interstitial Lung Disease in SKG Mice Arthritis Rheumatol 2017 69 2314 27 28805019 10.1002/art.40231 99 Blanco FJ Möricke R Dokoupilova E Codding C Neal J Andersson M Secukinumab in Active Rheumatoid Arthritis: A Phase III Randomized, Double-Blind, Active Comparator- and Placebo-Controlled Study Arthritis Rheumatol 2017 69 1144 53 28217871 10.1002/art.40070 100 Pavelka K Chon Y Newmark R Lin SL Baumgartner S Erondu N A study to evaluate the safety, tolerability, and efficacy of brodalumab in subjects with rheumatoid arthritis and an inadequate response to methotrexate J Rheumatol 2015 42 912 9 25877498 10.3899/jrheum.141271 101 Mease PJ Jeka S Jaller JJ Kitumnuaypong T Louthrenoo W Mann H CNTO6785, a Fully Human Antiinterleukin 17 Monoclonal Antibody, in Patients with Rheumatoid Arthritis with Inadequate Response to Methotrexate: A Randomized, Placebo-controlled, Phase II, Dose-ranging Study J Rheumatol 2018 45 22 31 29093159 10.3899/jrheum.161238 102 DiMeglio LA Evans-Molina C Oram RA Type 1 diabetes Lancet 2018 391 2449 62 29916386 10.1016/S0140-6736(18)31320-5 PMC6661119 103 Wen X Yang J James E Chow IT Reijonen H Kwok WW Increased islet antigen-specific regulatory and effector CD4(+) T cells in healthy individuals with the type 1 diabetes-protective haplotype Sci Immunol 2020 5 10.1126/sciimmunol.aax8767 PMC7566980 32060144 104 Arif S Tree TI Astill TP Tremble JM Bishop AJ Dayan CM Autoreactive T cell responses show proinflammatory polarization in diabetes but a regulatory phenotype in health J Clin Invest 2004 113 451 63 14755342 10.1172/JCI19585 PMC324541 105 Honkanen J Nieminen JK Gao R Luopajarvi K Salo HM Ilonen J IL-17 immunity in human type 1 diabetes J Immunol 2010 185 1959 67 20592279 10.4049/jimmunol.1000788 106 Kenefeck R Wang CJ Kapadi T Wardzinski L Attridge K Clough LE Follicular helper T cell signature in type 1 diabetes J Clin Invest 2015 125 292 303 25485678 10.1172/JCI76238 PMC4382272 107 Walker LS von Herrath M CD4 T cell differentiation in type 1 diabetes Clin Exp Immunol 2016 183 16 29 26102289 10.1111/cei.12672 PMC4687517 108 Tatovic D Marwaha A Taylor P Hanna SJ Carter K Cheung WY Ustekinumab for type 1 diabetes in adolescents: a multicenter, double-blind, randomized phase 2 trial Nat Med 2024 30 2657 66 39079992 10.1038/s41591-024-03115-2 PMC11405276 109 Mishra A Jajodia A Weston E Jayavelu ND Garcia M Hossack D Identification of functional enhancer variants associated with type I diabetes in CD4+ T cells Front Immunol 2024 15 1387253 38947339 10.3389/fimmu.2024.1387253 PMC11211866 110 Knoop J Gavrisan A Kuehn D Reinhardt J Heinrich M Hippich M GM-CSF producing autoreactive CD4(+) T cells in type 1 diabetes Clin Immunol 2018 188 23 30 29229565 10.1016/j.clim.2017.12.002 111 Hartwig T Zwicky P Schreiner B Yawalkar N Cheng P Navarini A Regulatory T Cells Restrain Pathogenic T Helper Cells during Skin Inflammation Cell Rep 2018 25 3564 72.e4 30590032 10.1016/j.celrep.2018.12.012 112 Bing SJ Silver PB Jittayasothorn Y Mattapallil MJ Chan CC Horai R Autoimmunity to neuroretina in the concurrent absence of IFN-γ and IL-17A is mediated by a GM-CSF-driven eosinophilic inflammation J Autoimmun 2020 114 102507 32593472 10.1016/j.jaut.2020.102507 PMC7572578 113 Paust HJ Song N De Feo D Asada N Tuzlak S Zhao Y CD4(+) T cells produce GM-CSF and drive immune-mediated glomerular disease by licensing monocyte-derived cells to produce MMP12 Sci Transl Med 2023 15 eadd6137 36921033 10.1126/scitranslmed.add6137 114 Al-Mossawi MH Chen L Fang H Ridley A de Wit J Yager N Unique transcriptome signatures and GM-CSF expression in lymphocytes from patients with spondyloarthritis Nat Commun 2017 8 1510 29142230 10.1038/s41467-017-01771-2 PMC5688161 115 Dohlman TH Ding J Dana R Chauhan SK T Cell-Derived Granulocyte-Macrophage Colony-Stimulating Factor Contributes to Dry Eye Disease Pathogenesis by Promoting CD11b+ Myeloid Cell Maturation and Migration Invest Ophthalmol Vis Sci 2017 58 1330 6 28241321 10.1167/iovs.16-20789 PMC5341624 116 Piper C Pesenacker AM Bending D Thirugnanabalan B Varsani H Wedderburn LR T cell expression of granulocyte-macrophage colony-stimulating factor in juvenile arthritis is contingent upon Th17 plasticity Arthritis Rheumatol 2014 66 1955 60 24692225 10.1002/art.38647 PMC4190686 117 Keller M Spanou Z Schaerli P Britschgi M Yawalkar N Seitz M T cell-regulated neutrophilic inflammation in autoinflammatory diseases J Immunol 2005 175 7678 86 16301678 10.4049/jimmunol.175.11.7678 118 Lin F Yu H Zhang L Zhou J Cao Y Wu S Differential expression of interleukin-35 receptor distinguishes different subsets of granulocyte-macrophage-colony-stimulating factor-producing T helper cells in a mouse endometriosis model Mol Immunol 2023 164 28 38 37944204 10.1016/j.molimm.2023.10.011 119 Gartlan KH Koyama M Lineburg KE Chang K Ensbey KS Kuns RD Donor T-cell-derived GM-CSF drives alloantigen presentation by dendritic cells in the gastrointestinal tract Blood Adv 2019 3 2859 65 31585949 10.1182/bloodadvances.2019000053 PMC6784518 120 Ullrich E Abendroth B Rothamer J Huber C Büttner-Herold M Buchele V BATF-dependent IL-7RhiGM-CSF+ T cells control intestinal graft-versus-host disease J Clin Invest 2018 128 916 30 29376889 10.1172/JCI89242 PMC5824870 121 Waller EK A new role for an old cytokine: GM-CSF amplifies GVHD Blood 2020 135 520 1 32078687 10.1182/blood.2019004681 PMC7033371 122 Piper C Zhou V Komorowski R Szabo A Vincent B Serody J Pathogenic Bhlhe40+ GM-CSF+ CD4+ T cells promote indirect alloantigen presentation in the GI tract during GVHD Blood 2020 135 568 81 31880771 10.1182/blood.2019001696 PMC7033370 123 Gan Y Zhou H Guo Y Huang B Liu H Wang Z A GITRL-mTORC1-GM-CSF Positive Loop Promotes Pathogenic Th17 Response in Primary Sjögren Syndrome Arthritis Rheumatol 2024 76 1419 30 38589318 10.1002/art.42859 124 Baldassari LE Rose JW Daclizumab: Development, Clinical Trials, and Practical Aspects of Use in Multiple Sclerosis Neurotherapeutics 2017 14 842 58 28707278 10.1007/s13311-017-0553-8 PMC5722760 125 Gold R Giovannoni G Selmaj K Havrdova E Montalban X Radue EW Daclizumab high-yield process in relapsing-remitting multiple sclerosis (SELECT): a randomised, double-blind, placebo-controlled trial Lancet 2013 381 2167 75 23562009 10.1016/S0140-6736(12)62190-4 126 ▼ Daclizumab withdrawn from the market worldwide Drug Ther Bull 2018; 56: 38 10.1136/dtb.2018.4.0604 29519948 127 Baslund B Tvede N Danneskiold-Samsoe B Larsson P Panayi G Petersen J Targeting interleukin-15 in patients with rheumatoid arthritis: a proof-of-concept study Arthritis Rheum 2005 52 2686 92 16142748 10.1002/art.21249 128 Sandborn WJ Rebuck R Wang Y Zou B Adedokun OJ Gasink C Five-Year Efficacy and Safety of Ustekinumab Treatment in Crohn's Disease: The IM-UNITI Trial Clin Gastroenterol Hepatol 2022 20 578 90.e4 33618023 10.1016/j.cgh.2021.02.025 PMC8374005 129 Panaccione R Danese S Sandborn WJ O'Brien CD Zhou Y Zhang H Ustekinumab is effective and safe for ulcerative colitis through 2 years of maintenance therapy Aliment Pharmacol Ther 2020 52 1658 75 33086438 10.1111/apt.16119 PMC8776399 130 Gordon KB Strober B Lebwohl M Augustin M Blauvelt A Poulin Y Efficacy and safety of risankizumab in moderate-to-severe plaque psoriasis (UltIMMa-1 and UltIMMa-2): results from two double-blind, randomised, placebo-controlled and ustekinumab-controlled phase 3 trials Lancet 2018 392 650 61 30097359 10.1016/S0140-6736(18)31713-6 131 Constantinescu CS Asher A Fryze W Kozubski W Wagner F Aram J Randomized phase 1b trial of MOR103, a human antibody to GM-CSF, in multiple sclerosis Neurol Neuroimmunol Neuroinflamm 2015 2 e117 26185773 10.1212/NXI.0000000000000117 PMC4442097 132 Crotti C Biggioggero M Becciolini A Agape E Favalli EG Mavrilimumab: a unique insight and update on the current status in the treatment of rheumatoid arthritis Expert Opin Investig Drugs 2019 28 573 81 10.1080/13543784.2019.1631795 31208237 133 Burmester GR Feist E Sleeman MA Wang B White B Magrini F Mavrilimumab, a human monoclonal antibody targeting GM-CSF receptor-α, in subjects with rheumatoid arthritis: a randomised, double-blind, placebo-controlled, phase I, first-in-human study Ann Rheum Dis 2011 70 1542 9 21613310 10.1136/ard.2010.146225 PMC3147227 134 Burmester GR Weinblatt ME McInnes IB Porter D Barbarash O Vatutin M Efficacy and safety of mavrilimumab in subjects with rheumatoid arthritis Ann Rheum Dis 2013 72 1445 52 23234647 10.1136/annrheumdis-2012-202450 PMC3756523 135 Takeuchi T Tanaka Y Close D Godwood A Wu CY Saurigny D Efficacy and safety of mavrilimumab in Japanese subjects with rheumatoid arthritis: findings from a Phase IIa study Mod Rheumatol 2015 25 21 30 24720551 10.3109/14397595.2014.896448 136 Burmester GR McInnes IB Kremer J Miranda P Korkosz M Vencovsky J A randomised phase IIb study of mavrilimumab, a novel GM-CSF receptor alpha monoclonal antibody, in the treatment of rheumatoid arthritis Ann Rheum Dis 2017 76 1020 30 28213566 10.1136/annrheumdis-2016-210624 137 Guo X Higgs BW Bay-Jensen AC Wu Y Karsdal MA Kuziora M Blockade of GM-CSF pathway induced sustained suppression of myeloid and T cell activities in rheumatoid arthritis Rheumatology (Oxford) 2018 57 175 84 29069507 10.1093/rheumatology/kex383 138 Weinblatt ME McInnes IB Kremer JM Miranda P Vencovsky J Guo X A Randomized Phase IIb Study of Mavrilimumab and Golimumab in Rheumatoid Arthritis Arthritis Rheumatol 2018 70 49 59 28941039 10.1002/art.40323 PMC5767745 139 Burmester GR McInnes IB Kremer JM Miranda P Vencovský J Godwood A Mavrilimumab, a Fully Human Granulocyte-Macrophage Colony-Stimulating Factor Receptor α Monoclonal Antibody: Long-Term Safety and Efficacy in Patients With Rheumatoid Arthritis Arthritis Rheumatol 2018 70 679 89 29361199 10.1002/art.40420 PMC5947536 140 Behrens F Tak PP Østergaard M Stoilov R Wiland P Huizinga TW MOR103, a human monoclonal antibody to granulocyte-macrophage colony-stimulating factor, in the treatment of patients with moderate rheumatoid arthritis: results of a phase Ib/IIa randomised, double-blind, placebo-controlled, dose-escalation trial Ann Rheum Dis 2015 74 1058 64 24534756 10.1136/annrheumdis-2013-204816 PMC4431325 141 Genovese MC Berkowitz M Conaghan PG Peterfy C Davy K Fisheleva E MRI of the joint and evaluation of the granulocyte-macrophage colony-stimulating factor-CCL17 axis in patients with rheumatoid arthritis receiving otilimab: a phase 2a randomised mechanistic study Lancet Rheumatol 2020 2 e666 e76 38279363 10.1016/S2665-9913(20)30224-1 142 Buckley CD Simón-Campos JA Zhdan V Becker B Davy K Fisheleva E Efficacy, patient-reported outcomes, and safety of the anti-granulocyte macrophage colony-stimulating factor antibody otilimab (GSK3196165) in patients with rheumatoid arthritis: a randomised, phase 2b, dose-ranging study Lancet Rheumatol 2020 2 e677 e88 38279364 10.1016/S2665-9913(20)30229-0 143 Fleischmann RM van der Heijde D Strand V Atsumi T McInnes IB Takeuchi T Anti-GM-CSF otilimab versus tofacitinib or placebo in patients with active rheumatoid arthritis and an inadequate response to conventional or biologic DMARDs: two phase 3 randomised trials (contRAst 1 and contRAst 2) Ann Rheum Dis 2023 82 1516 26 37699654 10.1136/ard-2023-224482 PMC10646845 144 Weinblatt ME Taylor PC McInnes IB Atsumi T Strand V Takeuchi T Long-term safety and efficacy of anti-GM-CSF otilimab in patients with rheumatoid arthritis: long-term extension of three phase 3 randomised trials (contRAst X) BMJ Open 2025 15 e088869 10.1136/bmjopen-2024-088869 PMC11883618 40044198 145 Huizinga TW Batalov A Stoilov R Lloyd E Wagner T Saurigny D Phase 1b randomized, double-blind study of namilumab, an anti-granulocyte macrophage colony-stimulating factor monoclonal antibody, in mild-to-moderate rheumatoid arthritis Arthritis Res Ther 2017 19 53 28274253 10.1186/s13075-017-1267-3 PMC5343373 146 Papp KA Gooderham M Jenkins R Vender R Szepietowski JC Wagner T Granulocyte-macrophage colony-stimulating factor (GM-CSF) as a therapeutic target in psoriasis: randomized, controlled investigation using namilumab, a specific human anti-GM-CSF monoclonal antibody Br J Dermatol 2019 180 1352 60 30207587 10.1111/bjd.17195 PMC7379964 147 Taylor PC Saurigny D Vencovsky J Takeuchi T Nakamura T Matsievskaia G Efficacy and safety of namilumab, a human monoclonal antibody against granulocyte-macrophage colony-stimulating factor (GM-CSF) ligand in patients with rheumatoid arthritis (RA) with either an inadequate response to background methotrexate therapy or an inadequate response or intolerance to an anti-TNF (tumour necrosis factor) biologic therapy: a randomized, controlled trial Arthritis Res Ther 2019 21 101 30999929 10.1186/s13075-019-1879-x PMC6471864 148 Worth C Al-Mossawi MH Macdonald J Fisher BA Chan A Sengupta R Granulocyte-macrophage colony-stimulating factor neutralisation in patients with axial spondyloarthritis in the UK (NAMASTE): a randomised, double-blind, placebo-controlled, phase 2 trial Lancet Rheumatol 2024 6 e537 e45 38942047 10.1016/S2665-9913(24)00099-7 149 Bakhshi S Shamsi S MCC950 in the treatment of NLRP3-mediated inflammatory diseases: Latest evidence and therapeutic outcomes Int Immunopharmacol 2022 106 108595 35124417 10.1016/j.intimp.2022.108595 150 Coll RC Hill JR Day CJ Zamoshnikova A Boucher D Massey NL MCC950 directly targets the NLRP3 ATP-hydrolysis motif for inflammasome inhibition Nat Chem Biol 2019 15 556 9 31086327 10.1038/s41589-019-0277-7 151 Guo C Fu R Wang S Huang Y Li X Zhou M NLRP3 inflammasome activation contributes to the pathogenesis of rheumatoid arthritis Clin Exp Immunol 2018 194 231 43 30277570 10.1111/cei.13167 PMC6194337 152 Saber S El-Kader EMA Novel complementary coloprotective effects of metformin and MCC950 by modulating HSP90/NLRP3 interaction and inducing autophagy in rats Inflammopharmacology 2021 29 237 51 32594364 10.1007/s10787-020-00730-6 153 Perera AP Fernando R Shinde T Gundamaraju R Southam B Sohal SS MCC950, a specific small molecule inhibitor of NLRP3 inflammasome attenuates colonic inflammation in spontaneous colitis mice Sci Rep 2018 8 8618 29872077 10.1038/s41598-018-26775-w PMC5988655 154 Zhou J Onodera S Yu Q Inhibition of NLRP3 inflammasome activity by MCC950 leads to exacerbation of Sjӧgren's syndrome pathologies in non-obese diabetic mice Immunology 2023 168 697 708 10.1111/imm.13605 PMC10038882 36353754 155 Arnold DD Yalamanoglu A Boyman O Systematic Review of Safety and Efficacy of IL-1-Targeted Biologics in Treating Immune-Mediated Disorders Front Immunol 2022 13 888392 35874710 10.3389/fimmu.2022.888392 PMC9296857 156 Gregory SG Schmidt S Seth P Oksenberg JR Hart J Prokop A Interleukin 7 receptor alpha chain (IL7R) shows allelic and functional association with multiple sclerosis Nat Genet 2007 39 1083 91 17660817 10.1038/ng2103 157 Nelson EA Walker SR Xiang M Weisberg E Bar-Natan M Barrett R The STAT5 Inhibitor Pimozide Displays Efficacy in Models of Acute Myelogenous Leukemia Driven by FLT3 Mutations Genes Cancer 2012 3 503 11 23264850 10.1177/1947601912466555 PMC3527989 158 Xiao Z Liang J Deng Q Song C Yang X Liu Z Pimozide augments bromocriptine lethality in prolactinoma cells and in a xenograft model via the STAT5/cyclin D1 and STAT5/Bcl-xL signaling pathways Int J Mol Med 2021 47 113 24 10.3892/ijmm.2020.4784 PMC7723514 33155660 159 Lin JX Ge M Liu CY Holewinski R Andresson T Yu ZX Tyrosine phosphorylation of both STAT5A and STAT5B is necessary for maximal IL-2 signaling and T cell proliferation Nat Commun 2024 15 7372 39191751 10.1038/s41467-024-50925-6 PMC11349758 Figure 1 Literature landscape of GM-CSF + (B) (C) Figure 2 The differentiation pathway, subtype heterogeneity, and phenotype plasticity of GM-CSF + https://BioRender.com/o6m32us Figure 3 Mechanistic role of GM-CSF + https://BioRender.com/o6m32us Figure 4 Mechanistic role of GM-CSF + https://BioRender.com/o6m32us Figure 5 The versatile mechanistic role of GM-CSF⁺ Th cells in the pathogenesis of miscellaneous autoimmune diseases. https://BioRender.com/o6m32us Figure 6 Possible approaches for targeting GM-CSF + https://BioRender.com/o6m32us Table 1 Subtypes of GM-CSF+ Th cells, their cellular origin, molecular characteristics, driving and suppressing factors, down-stream recruited inflammatory cells, and associated autoimmune diseases. GM-CSF+ Th subtypes Origin Molecular characteristics Drivers Suppressors Recruited infCells† Associated Ads* References Human Mouse Human Mouse Human Mouse GM-CSF + naïve CD4 + Markers: GM-CSF + + + + + + + - - - - ‑ - - ‑ - - +/- +/- + + + + + + + - - - Markers: GM-CSF + + + + + + + + + + + + + + + + + + + + - - - - - - - - + + + + + + + + + + - - - IL-2, IL-2, IL-7, IL-23, CD5L, IL-1β, IL-1R1, GM-CSF, STAT4, STAT5, BATF, NLRP3, Rel; TGF-β, IL-6, IL-12, IL-1β, IL-23, IFN-γ, IL-13, IL-21; 5A12, MTX, IFN-β, STAT3, RORγt, Treg, DMF; IL-4, IL-12, IFN-γ, Treg Eosinophils, ly6C + + MS, 12 14 15 19 20 21 22 23 27 84 28 30 32 35 34 38 42 50 53 86 88 109 114 112 119 120 GM-CSF + + + GM-CSF + Markers: GM-CSF + + + + + + + + + - - - - - +/- +/- + + + + + + + + - Markers: GM-CSF + + + + + + + + - + + - IL-12, T-bet; IL-7, IL-12, RUNX3, T-bet, Bhlhe40; IL-23, IL-1β, IL-6, TGF-β, RORγt; IL-6, IL-12, IL-21, IL-23, IFN-γ, TGF-β; ly6C + + MS, 11 12 13 20 21 22 23 26 27 84 31 32 33 35 37 38 42 47 50 53 71 86 88 98 109 110 113 114 118 122 Th1 Markers: GM-CSF + + + + + + + - + - Markers: GM-CSF + + + + - + + - IL-12, STAT4; IL-7, IL-12, IFN-γ, T-bet, Bhelhe40; IL-1β, IL-6, IL-23, IL-21, IL-27, TGF-β, RORγt, STAT3 IL-10, IL-23; GM-CSF + + Th17 Markers: GM-CSF + + + - + - Markers: GM-CSF + + + + + + + + + - + + + - IL-12, GRP65, IL-15, IL-23; IL-12, IL-7, IL-15, IL-1β, IL-23, IL-17, RORγt, Bhelhe40; IFN-γ, Ustekinumab IL-10, IL-12, IL-27, IFN-γ, TGF-β; neutrophils, ly6C + + EAE, 11 12 13 14 21 22 23 26 28 30 31 32 33 35 37 38 42 71 97 98 108 109 110 113 115 119 GM-CSF + + + GM-CSF + + Markers: GM-CSF + + + + + + + Markers: GM-CSF + + + + + + + IL-12, BHELHE40 IL-7, IFN-γ, Ustekinumab neutrophils, ly6C + + EAE, 12 21 26 33 38 42 108 110 †, inflammatory cells recruited by GM-CSF + *, Autoimmune diseases associated with GM-CSF + Table 2 Tabular summary of clinical trials of anti-GM-CSF agents in autoimmune disorders Target Molecule Drug Type Indication Phase Status ClinicalTrials.gov identifier Efficacy outcomes Safety profiles Reference GM-CSFR Mavrilimumab Monoclonal antibody RA I Completed NCT00771420 A significant reduction in disease activity was observed in patients with high baseline disease activity Safety was favorable with most adverse events being mild to moderate, with no SAEs or DLTs.  133 RA II Completed NCT01050998 Mavrilimumab significantly increased the proportion of patients achieving a reduction in DAS28-CRP score at Week 12 (55.7% vs. 34.7%, P Mild to moderate adverse events such as infections and hypersensitivity reactions were observed.  134 RA IIa Completed NCT01050998 Mavrilimumab demonstrated significant efficacy across multiple dose groups, especially in the 30 mg and 100 mg dose groups. Improvements in DAS28-CRP and HAQ-DI scores were notable. Most adverse events were mild to moderate. Overall tolerability was favorable.  135 RA IIb Completed NCT01706926 Mavrilimumab significantly reduced disease activity in RA patients with clinically meaningful responses observed as early as in Week 1. ACR20 response rates were significantly higher in all dose groups compared to placebo. No treatment-related safety signals were identified, demonstrating good tolerability.  136 RA IIb Completed NCT01706926 Mavrilimumab significantly reduced inflammatory markers and improved RA symptoms. The efficacy was associated with the inhibition of myeloid and T-cell signaling pathways. Overall tolerability was favorable. No serious adverse events were reported, demonstrating a favorable safety profile.  137 RA IIb Completed NCT01715896 Mavrilimumab demonstrated clinical efficacy in patients with refractory RA. 51.4% of patients in the mavrilimumab treatment group reported treatment-related adverse events. No deaths or specific safety signals were observed.  138 RA IIb Completed NCT01712399 Mavrilimumab showed sustained efficacy in long-term treatment, significantly improving disease status. Biomarker analyses indicated effective control of inflammatory response. Long-term treatment was well-tolerated, with no increase in treatment-related adverse events. Common adverse events were mild to moderate and transient in nature.  139 GM-CSF GSK 3196165 Monoclonal antibody RA Ib/IIa Completed NCT01023256 Clinical efficacy included reductions in disease activity scores and joint counts with higher EULAR response rates. MOR103 was well-tolerated in patients with moderate RA. No serious adverse events were reported.  140 RA IIa Completed NCT02799472 Some positive results were observed in target engagement and biomarkers, but significant improvements in synovitis were not achieved. Otilimab was well-tolerated. No serious adverse events or deaths were reported.  141 RA IIb Completed NCT02504671 Although otilimab combined with methotrexate did not meet the primary endpoint of DAS28-CRP remission, improvements in disease activity scores were observed. Pain and physical function reported by patients improved significantly. Otilimab was well-tolerated. No deaths or clinically significant pulmonary events were reported.  94 RA III Completed NCT04134728 Otilimab showed no superiority in efficacy compared to placebo. Safety was acceptable.  142 RA III Completed NCT03980483 NCT03970837 In two trials, otilimab increased the proportion of patients achieving low disease activity per CDAI and reduced HAQ-DI scores compared to placebo. The safety profile of otilimab was comparable to placebo and tofacitinib. No new safety concerns were identified.  143 RA III Completed NCT04333147 Otilimab demonstrated some efficacy, with stable response rates for patients achieving low disease activity per CDAI. In long-term studies (<2.5 years) of otilimab for RA, safety was favorable. The incidence of adverse events was low.  144 Namilumab (previously MT203) Monoclonal antibody RA Ib Completed NCT01317797 A reduction in disease activity scores and improvement in joint symptoms were observed. Namilumab was well-tolerated in patients with mild to moderate RA. Safety was comparable to placebo.  145 PP II Completed NCT02129777 Namilumab showed no significant efficacy in reducing PASI scores compared to placebo. Safety was favorable, with no serious adverse events or significant drug-related safety issues identified.  146 RA II Completed NCT02379091 The primary endpoint was achieved at Week 12, showing a clear dose-response effect. Tolerability was favorable. No serious infections were reported.  147 axSpA II Completed NCT03622658 Namilumab showed no efficacy in patients with active axSpA compared to placebo. Tolerability was favorable.  148 RA, rheumatoid arthritis; PP, plaque psoriasis; axSpA, axial spondyloarthritis; DAS28-CRP, disease activity Score in 28 joints using C-reactive protein; ACR, American college of rheumatology; HAQ-DI, health assessment questionnaire disability Index; EULAR, European alliance of associations for rheumatology; CADI, clinical disease activity index; PASI, psoriasis area and severity index. Table 3 Potential strategies for autoimmune disease management through targeting GM-CSF + Potential Targets Drug types Agents Disease* & development stage Adverse effects & limitations Possible strategies for improvement GM-CSF anti-GM-CSF mAb Otilimab RA, phase III 94 drug resistance, immunosuppression, precise patient stratification and biomarker - guided treatment; optimization of dosing regimens; enhancement of safety monitoring and management; combination therapy strategies synergizing with other immunosuppressive drugs; improvement of patient compliance; conducting additional real - world studies. GM-CSF receptors anti-GM-CSF receptor mAb Mavrilimumab RA, phase IIb 132 limited response rate, immunosuppression IL-2 receptors anti-IL-2Rα mAb Daclizumab MS 124 125 126 severe inflammatory brain disease, hepatic injury, drug-induced rash, allergic reactions IL-7 receptors anti-IL-7Rα mAb Lusvertikimab UC, phase II (CoTikiS) immunosuppression; impaired immune tolerance, formation of anti-drug antibodies IL-15 anti-IL-15 mAb HuMax-IL15 RA, phase I/II 127 mild to moderate infections, NK cell function impairment, possible tumorigenicity,inadequate efficacy precision patient selection, e.g. overexpression of GM-CSF+ Th1/Th17 cells and IL-15 both; integrating disease staging criteria into treatment decisions, e.g focusing on early-stage disease; STAT5 small-molecule targeted inhibitors Pimozide (repositioning) inhibiting STAT5 phosphorylation in cells 157 158 mechanistic complexity, lack of human study, off-target effect; targeted delivery of STAT5 inhibitor to GM-CSF-expressing Th cells with STAT5 overexpression; IL-12 & IL-23 (P40) anti-(IL-12 and IL-23) P40 mAb Ustekinumab clinical trial: Crohn's Disease 128 128 130 108 limited clinical data, immunosuppression, individual variability, potential impacts on adolescent development evaluating IL-12/IL-23 p40 as a biomarker for stratifying patients NLRP3 NLRP3 inflammasome inhibitor MCC950 preclinical studies in animal models: MS 149 150 151 152 153 limited clinical data, hepatotoxicity, immunosuppression, off-target effects, tissue-specific variability developing oral prodrugs and nanoparticle-delivered long-acting sustained-release formulations to improve bioavailability; stratifying patients using NLRP3 genetic markers; designing bispecific antibodies targeting NLRP3 and IL-1β to mitigate immunosuppression-related risks; engineering reversible inhibitors to preserve host defense during infections IL-1β anti-IL-1β mAb Canakinumab RA, phaseI/II 155 immunosuppression, individual variability in efficacy, high cost screening patient populations responsive to IL-1β inhibition; developing long-acting sustained-release and oral formulations. STAT5/T-bet/BHLHE40/Rel Conditional gene editing or Small-molecule inhibitor CRISPR-mediated knockout of STAT5 phosphorylation sites mouse model with tyrosine-to-phenylalanine mutations (Y694F and Y699F) in STAT5A and STAT5B 159 o-target effects, Editing efficiency, cell or tissue specificity, potential immune response optimizing sgRNA design targeting GM-CSF + * MS, multiple sclerosis; RA, rheumatoid arthritis; T1D, type 1 diabetes; UC, ulcerative colitis. ",
  "metadata": {
    "Title of this paper": "Tyrosine phosphorylation of both STAT5A and STAT5B is necessary for maximal IL-2 signaling and T cell proliferation",
    "Journal it was published in:": "Theranostics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486991/"
  }
}