{
  "title": "Paper_161",
  "abstract": "pmc Cell Rep Cell Rep 319 nihpa Cell reports 2211-1247 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12490864 PMC12490864.1 12490864 12490864 NIHMS2113377 40884791 10.1016/j.celrep.2025.116175 NIHMS2113377 NIHPA2113377 1 Article The bidirectional interplay between RNA processing and mechanotransduction Bais Gabrielle B. 1 2 3 Giudice Jimena 1 2 4 5 * 1 2 3 4 5 AUTHOR CONTRIBUTIONS G.B.B. and J.G. conceived and wrote this article. Both authors approved the final version of this article. * jimena_giudice@med.unc.edu 23 9 2025 29 8 2025 44 9 498135 116175 116175 26 09 2025 02 10 2025 03 10 2025 03 10 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license ( http://creativecommons.org/licenses/by/4.0/ SUMMARY Through mechanotransduction, cells sense and respond to mechanical stimuli from their environment. A mechanical stimulus is first detected by a mechanosensor, then converted into a biochemical signal, which can ultimately control the expression of genes. RNA processing, which includes canonical and alternative splicing, 3 ′ ′ pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Cells sense and respond to various stimuli from their physical environment via mechanotransduction, wherein mechanical cues are converted into biochemical signals that regulate transcriptional and post-transcriptional programs. Mechanotransduction is essential to all tissues, but is particularly important in cardiac, skeletal, and smooth muscles as well as bone, cartilage, and blood vessels because these tissues are constantly under mechanical stress. 1 2 3 4 7 8 9 10 13 Global changes in gene expression drive cellular adaptations to mechanical stimuli. 14 16 17 19 ′ ′ 17 20 Figure 1A ′ ′ Figure 1A ′ Figure 1B 21 24 24 25 20 ′ 20 26 20 27 20 21 Both RNA processing and mechanotransduction are implicated in development and disease. 1 2 28 30 + + MECHANOTRANSDUCTION IS REGULATED BY NUMEROUS CELLULAR COMPONENTS Mechanotransduction encompasses the sensing of mechanical stimuli, the triggered signal transduction,and the subsequent cellular response to these stimuli. Several protein complexes and signaling pathways are implicated at specific stages of mechanotransduction ( Figure 2 1 2 1 31 32 33 Mechanically gated and stretch-activated ion channels, such as Piezo proteins 34 35 Figure 2 36 37 36 38 39 40 41 Figure 2 9 41 43 Figure 2 44 45 46 47 48 49 50 Figure 2 14 15 51 53 Another key layer of gene regulation via mechanotransduction is through the linker of nucleoskeleton and cytoskeleton complex and the nuclear lamina, wherein both tether the nucleus to the cytoskeleton. 54 55 56 57 54 55 58 RBPs CAN REGULATE RNA PROCESSING DURING MECHANOTRANSDUCTION RNA processing as well as all other aspects of RNA biology are highly regulated by RBPs. 59 61 HNRNPC activity is regulated by changes in mechanical forces during heart failure The composition and stiffness of the ECM greatly contribute to the activation of mechanotransduction pathways, 9 in silico 62 65 66 62 65 66 67 68 Figure 3A Figure 3A 66 66 Multiple HNRNPC splicing targets are involved in mechanotransduction pathways. One of these targets is the Yes-associated protein 1 (YAP1), which is a main effector of the mechano-sensitive Hippo cascade. 66 Figure 3A Figure 3A 66 66 72 66 72 73 Figure 3A 72 72 73 72 In summary, ECM remodeling in response to cardiac insults controls HNRNPC regulation of alternative splicing and localization in cardiomyocytes. However, HNRNPC belongs to the HNRNP family of RBPs, and members of this family participate in multiple spheres of RNA biology, including transcription, mRNA stabilization, and translational regulation. 68 74 76 RBM4 regulates the Hippo pathway during tumor proliferation The Hippo pathway can be mechanically activated by changes in cellular tension, cell attachment, fluid flow, and ECM stiffness. 50 77 85 78 79 78 69 69 86 69 86 Figure 3B 69 69 Figure 3B 69 69 Figure 3B 69 86 87 88 89 In humans, TEAD4-S expression is reduced in cancerous versus healthy tissues. 69 69 Figure 3B 69 90 91 90 91 SR proteins in muscle and tumor microenvironment Another class of RBPs implicated in mechanotransduction and alternative splicing regulation is the serine arginine-rich (SR) proteins. Phosphorylation of SR proteins facilitates their functions in splice site recognition. 92 93 93 Similarly, SRSF5 was more phosphorylated when ECM stiffness increased in cultured endothelial cells and less phosphorylated when ECM stiffness was decreased in mouse mammary tumors in vivo 94 94 95 97 94 in vivo 94 98 100 101 102 103 104 94 105 RBFOX1 regulates alternative splicing of proteins important for cardiac muscle contraction The RNA-binding fox-1 or RBFOX family of proteins is widely known for its roles in regulating tissue-specific alternative splicing, particularly in the heart and skeletal muscle. 71 106 107 108 71 109 Figure 3C 110 Figure 3C 70 Rbfox-1 70 Figure 3C 70 rbfox1 111 More recently, RBFOX1 has been shown to regulate alternative splicing of several focal adhesion proteins, including paxillin and vinculin. 71 112 112 113 114 71 VCL 115 117 118 119 Alternative splicing of fibronectin, a mechanosensitive ECM protein Figure 3D 71 Figure 3E 71 Figure 3E 71 Mechanical cues regulate PTBP1 subcellular localization A recently published screen to identify proteins involved in mechanotransduction via proteomics revealed that the subcellular localization of the polypyrimidine tract binding protein 1 (PTBP1) is mechanosensitive, responding to differences in cell density, cell area, and ECM stiffness. 120 121 120 120 120 120 120 122 123 NUMEROUS MECHANOSENSITIVE PROTEINS ARE ALTERNATIVELY SPLICED Over 90% of multi-exonic human genes undergo alternative splicing; therefore, it is no surprise that several genes encoding proteins involved in mechanotransduction pathways are alternatively spliced. This section will focus on alternatively spliced mechanosensors and mechanotransducers that modulate the cellular response to mechanical stimuli. Table S1 in vivo Alternative splicing of fibronectin, a mechanosensitive ECM protein ECM composition influences the stiffness of the extracellular environment and the activation of mechanotransduction pathways. 9 9 124 125 125 126 Fibronectin was one of the first genes to be studied in terms of its ability to be alternatively spliced. 29 127 130 131 132 133 134 135 136 137 52 131 132 138 127 139 141 142 143 143 143 29 144 145 140 144 147 148 150 145 151 153 147 154 156 Decades of research on fibronectin splicing have identified the cis trans 157 158 60 108 159 160 162 160 161 SRSF1 is indeed one regulator of ED-A splicing. Differential expression of SRSF1 in endometrium and dermis fibroblasts in the uterus contributes to the regulation of trophoblast invasion. 163 163 163 163 163 The RBP Quaking (QKI) can also repress ED-A inclusion by binding to upstream intronic sequences. 137 137 137 Regulation of fibronectin splicing is mechanosensitive. Endothelial cells lining the vasculature are highly sensitive to shear stress from the blood flow. The level of exposure to endothelium shear stress is one of the best predictors of atherosclerotic lesion size and vulnerability, as well as aneurysm growth and rupture. 164 167 166 167 131 161 161 161 Moreover, when mice unable to express ED-A and ED-B were exposed to low flow, more severe and frequent localized hemorrhages were formed in the blood vessels than those in wild-type littermates. 131 168 132 169 132 RBFOX1 regulates alternative splicing of proteins important for cardiac muscle contraction 94 Alternative splicing of Piezo proteins regulates their functions as mechanosensors Piezo proteins are components of mechanically activated ion channels that form pores in the plasma membrane to enable cation transport. Piezo1 and Piezo2 are the two Piezo proteins conserved in mammals. 34 170 171 172 173 174 175 176 178 179 Alternative splicing regulation of the mammalian Piezo proteins alters their sensitivity to mechanical forces. Piezo1.1 is an evolutionarily conserved splice isoform of Piezo1, which is produced by skipping exon 30 from the Piezo1 transcript. 180 180 180 180 180 180 Piezo2 is also alternatively spliced at its exon 33, which encodes a region homologous to the Piezo1 lateral plug domain. 180 181 181 181 181 181 181 181 Szczot and colleagues sought to characterize the properties of neuronal versus non-neuronal Piezo2 variants. 181 181 181 182 in vivo TREK-1 splice isoforms exhibit different localization at the plasma membrane and conductance capacity Similar to Piezo channels, other transmembrane proteins are mechanically activated. The potassium two-pore domain channel subfamily K member 2 ( KCNK2 183 184 185 186 187 KCNK2 188 192 191 191 192 188 192 192 192 192 In the human myometrium, TREK-1a, TREK-1b, and TREK-1c are expressed during non-pregnancy and pregnancy conditions. 188 188 184 188 184 188 184 188 Studies in cell culture revealed differences in the functions and localization of TREK-1 splice variants. Specifically, HEK293T cells expressing individual TREK-1 short variants exhibited decreased KCNK2 mRNA expression, reduced localization of TREK-1 at the plasma membrane, and reduced TREK-1 function compared to cells expressing the full-length TREK-1 isoform. 184 193 193 Although these studies have provided great evidence for the role of splicing regulation in TREK-1 functions, they were all performed in cells. Further research is needed to fully understand how TREK-1 splicing regulates the in vivo 185 189 192 194 186 195 196 in vivo Vinculin and its splice variant metavinculin have unique mechanical properties Vinculin is an action-binding protein that acts as a molecular force transducer by connecting actin filaments to the integrin receptor activator talin. 118 119 197 198 118 199 201 200 202 In metavinculin, the 68-amino-acid insert encoded by exon 19 results in an extended coil domain and modified first alpha helix in the actin-binding domain situated in the C-terminus. 203 204 203 205 208 To first address this question, several groups analyzed meta-vinculin expression in different cell types. While vinculin is ubiquitously expressed, metavinculin expression is predominantly limited to myocytes. 115 117 209 115 116 209 210 209 211 212 211 213 211 212 Though vinculin and metavinculin are co-expressed, 115 117 214 215 205 208 216 The specific functions of metavinculin are the focus of recent publications and ongoing investigations. To distinguish between isoform-specific functions at focal adhesions, Lee and colleagues stably expressed vinculin or metavinculin in Vcl 215 Vcl 200 215 215 71 RBPs can regulate RNA processing during mechanotransduction 217 217 in vitro 217 A very interesting study measured the mechanical properties of metavinculin and vinculin in cells using piconewton-sensitive tension sensors. 216 216 216 211 212 216 216 Alternative splicing regulates multiple transmembrane components of the hair cell mechanotransduction complex The inner ear, or cochlea, contains auditory hair cells whose function is to convert sound (a mechanical stimulus) into electrical signals that are propagated by neurons. 37 37 37 218 218 219 220 The molecular mechanisms responsible for hair cell mechanotransduction are still under investigation; therefore, it is only reasonable that our understanding of the role of splicing in this context is still developing. The hair cell mechanotransduction complex, which includes a mechanosensitive ion channel that is sensitive to hair bundle deflection and other molecular players, is positioned at the apical tip of stereocilia and converts sound waves into electrical signals. 37 218 221 222 37 223 225 TMC1 forms the core of mechanoelectrical transduction channels at the tips of stereocilia in inner ear hair cells, making its expression essential for hearing in mice and humans. 221 226 227 TMC1 226 228 221 221 Tmc1 229 230 221 224 ′ 224 221 224 231 Alternative splicing events were also identified for LHFPL5 and TMIE pre-mRNAs via in-silico 224 232 233 234 ′ 224 235 236 ′ 224 224 ′ 150 224 224 PCDH15 and cadherin 23 form tip links, which are structures that act as extracellular linkages between adjacent stereocilia. 220 237 238 223 239 223 239 223 223 239 223 223 240 223 223 223 Further, isoform-specific knockout of PCDH15-CD1, PCDH15-CD2, or PCDH15-CD3 in mice revealed that PCDH15 isoform expression directly impacts tip link formation and hearing. 239 239 239 225 225 241 MECHANOSENSITIVE RNA PROCESSING PROGRAMS Mechanosensitive splicing networks in skeletal muscle and kidney Alternative splicing programs regulate development, tissue identity acquisition, and disease progression. 29 242 23 243 247 93 Figure 4A 93 More recently, analysis of transcriptomic data has identified over 3,000 alternatively spliced genes after mechanical stretch of podocytes as a model of glomerular hypertension. 250 251 252 in vitro in vivo 250 253 250 The two studies discussed above in the kidney and skeletal muscle are the first evidence that mechanosensitive splicing networks might exist in different cells but might be cell-type- and/or tissue-specific. Thus, future studies should assess the functional consequences of the activation of mechanosensitive splicing networks, and further global transcriptomic studies should be conducted in other cell and tissue contexts where mechanotransduction is important. Alternative polyadenylation in cardiac diseases Alternative polyadenylation is another main RNA processing mechanism that modulates gene expression. 25 ′ 21 254 ′ 21 255 257 258 260 Previous work showed that bovine aortic endothelial cells exposed to laminar shear stress expressed a higher proportion of endothelial nitric oxide synthase transcripts with long 3 ′ 261 262 263 248 ′ ′ Figure 4B 248 248 ′ ′ Figure 4B 248 ′ Figure 4C 249 ′ Figure 4C 249 These two studies indicate that alternative polyadenylation might have an important role in regulating changes in gene expression required for pathological cardiac remodeling. However, we still do not know which mechanosensors and mechanotransducers are responsible for triggering the changes in alternative polyadenylation observed by Creemers et al. and Soetano et al. 248 249 ′ 264 ′ CONCLUSIONS Mechanotransduction is critical for individual cell behavior, function, and health as well as for tissue homeostasis under various mechanical stressors. On the other hand, RNA processing is essential for tuning gene expression during all biological processes, including mechanotransduction. Recent studies have only begun to explore the interplay between RNA processing and mechanotransduction. In this review, we have described three emerging areas of research: the functions of RBPs in mechanotransduction, alternative splicing of mechanosensitive proteins, and the role of mechanical forces in regulating RNA processing programs. However, we have also identified some important gaps still present in the field. One major gap is partially due to technological limitations, as until recently, it was very challenging to generate datasets to analyze global alternative polyadenylation. Consequentially, there are only a few studies examining the physiological significance of alternative polyadenylation, and even fewer investigating the connection between alternative polyadenylation and mechanotransduction. The studies reviewed above provide justification for the pursuit of this line of research to characterize global alternative polyadenylation changes in response to mechanical stressors. Another outstanding gap in the field is the lack of attempts to connect the changes in activity of mechanosensors to the global changes in transcription and RNA processing. In other words, there are a few existing models that map mechanotransduction pathways from what we view as the true start to finish: from the moment when a mechanical signal is received by a cell and transduced through biochemical signaling to the point when it is translated into gene expression changes that are modulated by RNA processing. Our group has begun to do so in skeletal muscle cells, where we have identified a specific mechanosensitive RBP (SRSF4). 93 Because mechanotransduction is important in human diseases, particularly cardiac pathologies and cancer, and the increased clinical interest in using RNAs and RBPs as therapeutic targets, 265 270 Supplementary Material 1 Supplemental information can be found online at https://doi.org/10.1016/j.celrep.2025.116175 ACKNOWLEDGMENTS The authors were supported by the following funding sources: NIH/NHLBI T32 training grant (T32HL069768) (G.B.B.), NIH/NHLBI Ruth L. Kirschstein Predoctoral Individual National Research Service Award (F31HL176049) (G.B.B.), NIH/NIGMS Maximizing Investigators’ Research Award (R35GM152426) (J.G.), NSF CAREER Award (#2239056) (J.G.), and startup funds from The University of North Carolina at Chapel Hill (J.G.). DECLARATION OF INTERESTS The authors declare no competing interests. REFERENCES 1. Jaalouk DE Lammerding J 2009 Mechanotransduction gone awry Nat. Rev. Mol. Cell Biol 10 63 73 19197333 10.1038/nrm2597 PMC2668954 2. Di X Gao X Peng L Ai J Jin X Qi S Li H Wang K Luo D 2023 Cellular mechanotransduction in health and diseases: from molecular mechanism to therapeutic targets Signal Transduct. Target. Ther 8 282 37518181 10.1038/s41392-023-01501-9 PMC10387486 3. Sweeney HL Hammers DW 2018 Muscle Contraction Cold Spring Harb. Perspect. Biol 10 a023200 29419405 10.1101/cshperspect.a023200 PMC5793755 4. Discher DE Mooney DJ Zandstra PW 2009 Growth Factors, Matrices, and Forces Combine and Control Stem Cells Science 324 1673 1677 19556500 10.1126/science.1171643 PMC2847855 5. Hahn C Schwartz MA 2009 Mechanotransduction in vascular physiology and atherogenesis Nat. Rev. Mol. Cell Biol 10 53 62 19197332 10.1038/nrm2596 PMC2719300 6. Wang N Tytell JD Ingber DE 2009 Mechanotransduction at a distance: Mechanically coupling the extracellular matrix with the nucleus Nat. Rev. Mol. Cell Biol 10 75 82 19197334 10.1038/nrm2594 7. Wozniak MA Chen CS 2009 Mechanotransduction in development: a growing role for contractility Nat. Rev. Mol. Cell Biol 10 34 43 19197330 10.1038/nrm2592 PMC2952188 8. Engler AJ Sen S Sweeney HL Discher DE 2006 Matrix elasticity directs stem cell lineage specification Cell 126 677 689 16923388 10.1016/j.cell.2006.06.044 9. Saraswathibhatla A Indana D Chaudhuri O 2023 Cell–extracellular matrix mechanotransduction in 3D Nat. Rev. Mol. Cell Biol 24 495 516 36849594 10.1038/s41580-023-00583-1 PMC10656994 10. Bansaccal N Vieugue P Sarate R Song Y Minguijon E Miroshnikova YA Zeuschner D Collin A Allard J Engelman D 2023 The extracellular matrix dictates regional competence for tumour initiation Nature 623 828 835 37968399 10.1038/s41586-023-06740-y PMC7615367 11. Gilkes DM Semenza GL Wirtz D 2014 Hypoxia and the extracellular matrix: drivers of tumour metastasis Nat. Rev. Cancer 14 430 439 24827502 10.1038/nrc3726 PMC4283800 12. Wei SC Fattet L Tsai JH Guo Y Pai VH Majeski HE Chen AC Sah RL Taylor SS Engler AJ Yang J 2015 Matrix stiffness drives epithelial–mesenchymal transition and tumour metastasis through a TWIST1–G3BP2 mechanotransduction pathway Nat. Cell Biol 17 678 688 25893917 10.1038/ncb3157 PMC4452027 13. Paszek MJ Zahir N Johnson KR Lakins JN Rozenberg GI Gefen A Reinhart-King CA Margulies SS Dembo M Boettiger D 2005 Tensional homeostasis and the malignant phenotype Cancer Cell 8 241 254 16169468 10.1016/j.ccr.2005.08.010 14. Wang JH-C Thampatty BP Lin J-S Im H-J 2007 Mechanoregulation of gene expression in fibroblasts Gene 391 1 15 17331678 10.1016/j.gene.2007.01.014 PMC2893340 15. Eroshkin FM Zaraisky AG 2017 Mechano-sensitive regulation of gene expression during the embryonic development genesis 55 10.1002/dvg.23026 28236362 16. Copland IB Post M 2007 Stretch-activated signaling pathways responsible for early response gene expression in fetal lung epithelial cells J. Cell. Physiol 210 133 143 16998809 10.1002/jcp.20840 17. Manning KS Cooper TA 2017 The roles of RNA processing in translating genotype to phenotype Nat. Rev. Mol. Cell Biol 18 102 114 27847391 10.1038/nrm.2016.139 PMC5544131 18. Pope SD Medzhitov R 2018 Emerging Principles of Gene Expression Programs and Their Regulation Mol. Cell 71 389 397 30075140 10.1016/j.molcel.2018.07.017 19. Misteli T 2020 The Self-Organizing Genome: Principles of Genome Architecture and Function Cell 183 28 45 32976797 10.1016/j.cell.2020.09.014 PMC7541718 20. Choquet K Patop IL Churchman LS 2025 The regulation and function of post-transcriptional RNA splicing Nat. Rev. Genet 26 378 394 40217094 10.1038/s41576-025-00836-z 21. Tian B Manley JL 2017 Alternative polyadenylation of mRNA precursors Nat. Rev. Mol. Cell Biol 18 18 30 27677860 10.1038/nrm.2016.116 PMC5483950 22. Tian B Hu J Zhang H Lutz CS 2005 A large-scale analysis of mRNA polyadenylation of human and mouse genes Nucleic Acids Res 33 201 212 15647503 10.1093/nar/gki158 PMC546146 23. Nakka K Ghigna C Gabellini D Dilworth FJ 2018 Diversification of the muscle proteome through alternative splicing Skelet. Muscle 8 8 29510724 10.1186/s13395-018-0152-3 PMC5840707 24. Ule J Blencowe BJ 2019 Alternative Splicing Regulatory Networks: Functions, Mechanisms, and Evolution Mol. Cell 76 329 345 31626751 10.1016/j.molcel.2019.09.017 25. Mitschka S Mayr C 2022 Context-specific regulation and function of mRNA alternative polyadenylation Nat. Rev. Mol. Cell Biol 23 779 796 35798852 10.1038/s41580-022-00507-5 PMC9261900 26. Pandya-Jones A Bhatt DM Lin CH Tong AJ Smale ST Black DL 2013 Splicing kinetics and transcript release from the chromatin compartment limit the rate of Lipid A-induced gene expression RNA 19 811 827 23616639 10.1261/rna.039081.113 PMC3683915 27. Huang L Li G Du C Jia Y Yang J Fan W Xu YZ Cheng H Zhou Y 2023 The polyA tail facilitates splicing of last introns with weak 3’ splice sites via PABPN1 EMBO Rep 24 e57128 37661812 10.15252/embr.202357128 PMC10561182 28. Cooper TA Wan L Dreyfuss G 2009 RNA and Disease. Cell 136 777 793 10.1016/j.cell.2009.02.011 PMC2866189 19239895 29. Baralle FE Giudice J 2017 Alternative splicing as a regulator of development and tissue identity Nat. Rev. Mol. Cell Biol 18 437 451 28488700 10.1038/nrm.2017.27 PMC6839889 30. Marasco LE Kornblihtt AR 2023 The physiology of alternative splicing Nat. Rev. Mol. Cell Biol 24 242 254 36229538 10.1038/s41580-022-00545-z 31. Ingber DE 2006 Cellular mechanotransduction: putting all the pieces together again FASEB J 20 811 827 16675838 10.1096/fj.05-5424rev 32. Janoštiak R Pataki AC Brábek J Rösel D 2014 Mechanosensors in integrin signaling: the emerging role of p130Cas Eur. J. Cell Biol 93 445 454 25062607 10.1016/j.ejcb.2014.07.002 33. Hoffman BD Grashoff C Schwartz MA 2011 Dynamic molecular processes mediate cellular mechanotransduction Nature 475 316 323 21776077 10.1038/nature10316 PMC6449687 34. Coste B Mathur J Schmidt M Earley TJ Ranade S Petrus MJ Dubin AE Patapoutian A 2010 Piezo1 and Piezo2 are essential components of distinct mechanically activated cation channels Science 330 55 60 20813920 10.1126/science.1193270 PMC3062430 35. Honoré E 2007 The neuronal background K2P channels: Focus on TREK1 Nat. Rev. Neurosci 8 251 261 10.1038/nrn2117 17375039 36. Reitsma S Slaaf DW Vink H Van Zandvoort MAMJ Oude Egbrink MGA 2007 The endothelial glycocalyx: Composition, functions, and visualization Pflugers Arch 454 345 359 10.1007/s00424-007-0212-8 17256154 PMC1915585 37. Caprara GA Peng AW 2022 Mechanotransduction in mammalian sensory hair cells Mol. Cell. Neurosci 120 103706 35218890 10.1016/j.mcn.2022.103706 PMC9177625 38. Tarbell JM Ebong EE 2008 The endothelial glycocalyx: a mechano-sensor and -transducer Sci. Signal 1 pt8 18840877 10.1126/scisignal.140pt8 39. Roca-Cusachs P del Rio A Puklin-Faucher E Gauthier NC Biais N Sheetz MP 2013 Integrin-dependent force transmission to the extracellular matrix by α-actinin triggers adhesion maturation Proc. Natl. Acad. Sci. USA 110 E1361 E1370 23515331 10.1073/pnas.1220723110 PMC3625291 40. Ross TD Coon BG Yun S Baeyens N Tanaka K Ouyang M Schwartz MA 2013 Integrins in mechanotransduction Curr. Opin. Cell Biol 25 613 618 23797029 10.1016/j.ceb.2013.05.006 PMC3757118 41. Schiller HB Hermann MR Polleux J Vignaud T Zanivan S Friedel CC Sun Z Raducanu A Gottschalk KE Théry M 2013 β 1 - And α v -class integrins cooperate to regulate myosin II during rigidity sensing of fibronectin-based microenvironments Nat. Cell Biol 15 625 636 23708002 10.1038/ncb2747 42. Strohmeyer N Bharadwaj M Costell M Fässler R Müller DJ 2017 Fibronectin-bound α5β1 integrins sense load and signal to reinforce adhesion in less than a second Nat. Mater 16 1262 1270 29115292 10.1038/nmat5023 43. Alenghat FJ Ingber DE 2002 Mechanotransduction: all signals point to cytoskeleton, matrix, and integrins Sci. STKE 2002 pe6 11842240 10.1126/stke.2002.119.pe6 44. Müller P Langenbach A Kaminski A Rychly J 2013 Modulating the Actin Cytoskeleton Affects Mechanically Induced Signal Transduction and Differentiation in Mesenchymal Stem Cells PLoS One 8 e71283 23923061 10.1371/journal.pone.0071283 PMC3726577 45. Seetharaman S Vianay B Roca V Farrugia AJ De Pascalis C Boëda B Dingli F Loew D Vassilopoulos S Bershadsky A 2022 Microtubules tune mechanosensitive cell responses Nat. Mater 21 366 377 34663953 10.1038/s41563-021-01108-x 46. Martineau LC Gardiner PF 2001 Insight into skeletal muscle mechanotransduction: MAPK activation is quantitatively related to tension J. Appl. Physiol 91 693 702 11457783 10.1152/jappl.2001.91.2.693 47. Hishikawa K Oemar BS Yang Z Lüscher TF 1997 Pulsatile stretch stimulates superoxide production and activates nuclear factor-κb in human coronary smooth muscle Circ. Res 81 797 803 9351451 10.1161/01.res.81.5.797 48. Khachigian LM Resnick N Gimbrone MA Collins T 1995 Nuclear factor-kappa B interacts functionally with the platelet-derived growth factor B-chain shear-stress response element in vascular endothelial cells exposed to fluid shear stress J. Clin. Investig 96 1169 1175 7635955 10.1172/JCI118106 PMC185309 49. Calvo F Ege N Grande-Garcia A Hooper S Jenkins RP Chaudhry SI Harrington K Williamson P Moeendarbary E Charras G Sahai E 2013 Mechanotransduction and YAP-dependent matrix remodelling is required for the generation and maintenance of cancer-associated fibroblasts Nat. Cell Biol 15 637 646 23708000 10.1038/ncb2756 PMC3836234 50. Dupont S Morsut L Aragona M Enzo E Giulitti S Cordenonsi M Zanconato F Le Digabel J Forcato M Bicciato S 2011 Role of YAP/TAZ in mechanotransduction Nature 474 179 183 21654799 10.1038/nature10137 51. Agarwal P Zaidel-Bar R 2021 Mechanosensing in embryogenesis Curr. Opin. Cell Biol 68 1 9 32898827 10.1016/j.ceb.2020.08.007 52. Tschumperlin DJ Ligresti G Hilscher MB Shah VH 2018 Mechanosensing and fibrosis J. Clin. Investig 128 74 84 29293092 10.1172/JCI93561 PMC5749510 53. Bergmann MW De Windt LJ 2007 Linking Cardiac Mechanosensing at the Sarcomere M-Band, Nuclear Factor κB Signaling, and Cardiac Remodeling Hypertension 49 1225 1227 17404179 10.1161/HYPERTENSIONAHA.107.089052 54. Dupont S Wickström SA 2022 Mechanical regulation of chromatin and transcription Nat. Rev. Genet 23 624 643 35606569 10.1038/s41576-022-00493-6 55. Tajik A Zhang Y Wei F Sun J Jia Q Zhou W Singh R Khanna N Belmont AS Wang N 2016 Transcription upregulation via force-induced direct stretching of chromatin Nat. Mater 15 1287 1296 27548707 10.1038/nmat4729 PMC5121013 56. Chambliss AB Khatau SB Erdenberger N Robinson DK Hodzic D Longmore GD Wirtz D 2013 The LINC-anchored actin cap connects the extracellular milieu to the nucleus for ultrafast mechanotransduction Sci. Rep 3 1087 23336069 10.1038/srep01087 PMC3548190 57. Shiu JY Aires L Lin Z Vogel V 2018 Nanopillar force measurements reveal actin-cap-mediated YAP mechanotransduction Nat. Cell Biol 20 262 271 29403039 10.1038/s41556-017-0030-y 58. Kirby TJ Lammerding J 2018 Emerging views of the nucleus as a cellular mechanosensor Nat. Cell Biol 20 373 381 10.1038/s41556-018-0038-y 29467443 PMC6440800 59. Gebauer F Schwarzl T Valcárcel J Hentze MW 2021 RNA-binding proteins in human genetic disease Nat. Rev. Genet 22 185 198 33235359 10.1038/s41576-020-00302-y 60. Van Nostrand EL Freese P Pratt GA Wang X Wei X Xiao R Blue SM Chen JY Cody NAL Dominguez D 2020 A large-scale binding and functional map of human RNA-binding proteins Nature 583 711 719 32728246 10.1038/s41586-020-2077-3 PMC7410833 61. Neve J Patel R Wang Z Louey A Furger AM 2017 Cleavage and polyadenylation: Ending the message expands gene regulation RNA Biol 14 865 890 28453393 10.1080/15476286.2017.1306171 PMC5546720 62. Harpster MH Bandyopadhyay S Thomas DP Ivanov PS Keele JA Pineguina N Gao B Amarendran V Gomelsky M McCormick RJ Stayton MM 2006 Earliest changes in the left ventricular transcriptome post-myocardial infarction Mamm. Genome 17 701 715 16845475 10.1007/s00335-005-0120-1 63. Barth AS Kuner R Buness A Ruschhaupt M Merk S Zwermann L Kääb S Kreuzer E Steinbeck G Mansmann U 2006 Identification of a Common Gene Expression Signature in Dilated Cardiomyopathy Across Independent Microarray Studies J. Am. Coll. Cardiol 48 1610 1617 17045896 10.1016/j.jacc.2006.07.026 64. Colak D Kaya N Al-Zahrani J Al Bakheet A Muiya P Andres E Quackenbush J Dzimiri N 2009 Left ventricular global transcriptional profiling in human end-stage dilated cardiomyopathy Genomics 94 20 31 19332114 10.1016/j.ygeno.2009.03.003 PMC4152850 65. Rowell J Koitabashi N Kass DA Barth AS 2014 Dynamic gene expression patterns in animal models of early and late heart failure reveal biphasic-bidirectional transcriptional activation of signaling pathways Physiol. Genomics 46 779 787 25159852 10.1152/physiolgenomics.00054.2014 PMC4200378 66. Martino F Varadarajan NM Perestrelo AR Hejret V Durikova H Vukic D Horvath V Cavalieri F Caruso F Albihlal WS 2022 The mechanical regulation of RNA binding protein hnRNPC in the failing heart Sci. Transl. Med 14 eabo5715 36417487 10.1126/scitranslmed.abo5715 67. Chaudhury A Chander P Howe PH 2010 Heterogeneous nuclear ribonucleoproteins (hnRNPs) in cellular processes: Focus on hnRNP E1’s multifunctional regulatory roles RNA 16 1449 1462 20584894 10.1261/rna.2254110 PMC2905745 68. Geuens T Bouhy D Timmerman V 2016 The hnRNP family: insights into their role in health and disease Hum. Genet 135 851 867 27215579 10.1007/s00439-016-1683-5 PMC4947485 69. Qi Y Yu J Han W Fan X Qian H Wei H Tsai YHS Zhao J Zhang W Liu Q 2016 A splicing isoform of TEAD4 attenuates the Hippo–YAP signalling to inhibit tumour proliferation Nat. Commun 7 10.1038/ncomms11840 PMC4909989 27291620 70. Gao C Ren S Lee JH Qiu J Chapski DJ Rau CD Zhou Y Abdellatif M Nakano A Vondriska TM 2016 RBFox1-mediated RNA splicing regulates cardiac hypertrophy and heart failure J. Clin. Investig 126 195 206 26619120 10.1172/JCI84015 PMC4701548 71. Zorn P Calvo Sánchez J Alakhras T Schreier B Gekle M Hüttelmaier S Köhn M 2024 Rbfox1 controls alternative splicing of focal adhesion genes in cardiac muscle cells J. Mol. Cell Biol 16 mjae003 10.1093/jmcb/mjae003 38253401 PMC11216089 72. Vrbský J Vinarský V Perestrelo AR De La Cruz JO Martino F Pompeiano A Izzi V Hlinomaz O Rotrekl V Sudol M 2021 Evidence for discrete modes of YAP1 signaling via mRNA splice isoforms in development and diseases Genomics 113 1349 1365 33713822 10.1016/j.ygeno.2021.03.009 73. Nardone G Oliver-De La Cruz J Vrbsky J Martini C Pribyl J Skládal P Pe sl M Caluori G Pagliari S Martino F 2017 YAP regulates cell mechanics by controlling focal adhesion assembly Nat. Commun 8 15321 28504269 10.1038/ncomms15321 PMC5440673 74. Lin PK Davis GE 2023 Extracellular Matrix Remodeling in Vascular Disease: Defining Its Regulators and Pathological Influence Arterioscler. Thromb. Vasc. Biol 43 1599 1616 37409533 10.1161/ATVBAHA.123.318237 PMC10527588 75. Huang J Zhang L Wan D Zhou L Zheng S Lin S Qiao Y 2021 Extracellular matrix and its therapeutic potential for cancer treatment Signal Transduct. Target. Ther 6 153 33888679 10.1038/s41392-021-00544-0 PMC8062524 76. Kim HE Dalal SS Young E Legato MJ Weisfeldt ML D’Armiento J 2000 Disruption of the myocardial extracellular matrix leads to cardiac dysfunction J. Clin. Investig 106 857 866 11018073 10.1172/JCI8040 PMC517818 77. Chakraborty S Njah K Pobbati AV Lim YB Raju A Lakshmanan M Tergaonkar V Lim CT Hong W 2017 Agrin as a Mechanotransduction Signal Regulating YAP through the Hippo Pathway Cell Rep 18 2464 2479 28273460 10.1016/j.celrep.2017.02.041 78. Fu M Hu Y Lan T Guan KL Luo T Luo M 2022 The Hippo signalling pathway and its implications in human health and diseases Signal Transduct. Target. Ther 7 376 36347846 10.1038/s41392-022-01191-9 PMC9643504 79. Kwon Y Vinayagam A Sun X Dephoure N Gygi SP Hong P Perrimon N 2013 The Hippo Signaling Pathway Interactome Science 342 737 740 24114784 10.1126/science.1243971 PMC3951131 80. Li Z Chen S Cui H Li X Chen D Hao W Wang J Li Z Zheng Z Zhang Z Liu H 2021 Tenascin-C-mediated suppression of extracellular matrix adhesion force promotes entheseal new bone formation through activation of Hippo signalling in ankylosing spondylitis Ann. Rheum. Dis 80 891 902 33858850 10.1136/annrheumdis-2021-220002 PMC8237173 81. Ma S Meng Z Chen R Guan K-L 2018 The Hippo Pathway: Biology and Pathophysiology Annu Rev Biochem 88 577 604 10.1146/annurev-biochem-013118 30566373 82. Meng Z Qiu Y Lin KC Kumar A Placone JK Fang C Wang KC Lu S Pan M Hong AW 2018 RAP2 mediates mechanoresponses of the Hippo pathway Nature 560 655 660 30135582 10.1038/s41586-018-0444-0 PMC6128698 83. Pereira D Richert A Medjkane S Hénon S Weitzman JB 2020 Cell geometry and the cytoskeleton impact the nucleo-cytoplasmic localisation of the SMYD3 methyltransferase Sci. Rep 10 20598 33244033 10.1038/s41598-020-75833-9 PMC7691988 84. Roux E Bougaran P Dufourcq P Couffinhal T 2020 Fluid Shear Stress Sensing by the Endothelial Layer Front. Physiol 11 861 10.3389/fphys.2020.00861 32848833 PMC7396610 85. Wada K-I Itoga K Okano T Yonemura S Sasaki H 2011 Hippo pathway regulation by cell morphology and stress fibers Development 138 3907 3914 21831922 10.1242/dev.070987 86. Wang Y Chen D Qian H Tsai YS Shao S Liu Q Dominguez D Wang Z 2014 The Splicing Factor RBM4 Controls Apoptosis, Proliferation, and Migration to Suppress Tumor Progression Cancer Cell 26 374 389 25203323 10.1016/j.ccr.2014.07.010 PMC4159621 87. Lin J-C Lee YC Liang YC Fann YC Johnson KR Lin YJ 2017 The impact of the RBM4-initiated splicing cascade on modulating the carcinogenic signature of colorectal cancer cells Sci. Rep 7 44204 28276498 10.1038/srep44204 PMC5343574 88. Chen L Zhang W Chen D Yang Q Sun S Dai Z Li Z Liang X Chen C Jiao Y 2023 RBM4 dictates ESCC cell fate switch from cellular senescence to glutamine-addiction survival through inhibiting LKB1-AMPK-axis Signal Transduct. Target. Ther 8 159 37080995 10.1038/s41392-023-01367-x PMC10119322 89. Duan Y Liu S Wang J Yang K Xu J Wang Q Liu J Hao J Cui X Tan Y 2024 Overexpression of RBM4 promotes acute myeloid leukemia cell differentiation by regulating alternative splicing of TFEB J. Biol. Chem 300 107729 39214303 10.1016/j.jbc.2024.107729 PMC11467665 90. Lin J-C Hsu M Tarn W-Y 2007 Cell stress modulates the function of splicing regulatory protein RBM4 in translation control Proc. Natl. Acad. Sci. USA 104 2235 2240 17284590 10.1073/pnas.0611015104 PMC1893002 91. Lin J-C Tarn W-Y 2009 RNA-binding Motif Protein 4 Translocates to Cytoplasmic Granules and Suppresses Translation via Argo- naute2 during Muscle Cell Differentiation J. Biol. Chem 284 34658 34665 19801630 10.1074/jbc.M109.032946 PMC2787328 92. Cao W Jamison SF Garcia-Blanco MA 1997 Both phosphorylation and dephosphorylation of ASF/SF2 are required for pre-mRNA splicing in vitro RNA 3 1456 1467 9404896 PMC1369586 93. Hinkle ER Blue RE Tsai YH Combs M Davi J Coffey AR Boriek AM Taylor JM Parker JS Giudice J 2022 Stretching muscle cells induces transcriptional and splicing transitions and changes in SR proteins Commun. Biol 5 987 36123433 10.1038/s42003-022-03915-7 PMC9485123 94. Bordeleau F Califano JP Negrón Abril YL Mason BN LaValley DJ Shin SJ Weiss RS Reinhart-King CA 2015 Tissue stiffness regulates serine/arginine-rich protein-mediated splicing of the extra domain B-fibronectin isoform in tumors Proc. Natl. Acad. Sci. USA 112 8314 8319 26106154 10.1073/pnas.1505421112 PMC4500261 95. Hauptmann S Zardi L Siri A Carnemolla B Borsi L Castellucci M Klosterhalfen B Hartung P Weis J Stöcker G 1995 Extracellular matrix proteins in colorectal carcinomas. Expression of tenascin and fibronectin isoforms Lab. Invest 73 172 182 7543628 96. Scarpino S Stoppacciaro A Pellegrini C Marzullo A Zardi L Tartaglia F Viale G Ruco LP 1999 Expression of EDA/EDB isoforms of fibronectin in papillary carcinoma of the thyroid J. Pathol 188 163 167 10398159 10.1002/(SICI)1096-9896(199906)188:2<163::AID-PATH335>3.0.CO;2-1 97. Astrof S Crowley D George EL Fukuda T Sekiguchi K Hanahan D Hynes RO 2004 Direct Test of Potential Roles of EIIIA and EIIIB Alternatively Spliced Segments of Fibronectin in Physiological and Tumor Angiogenesis Mol. Cell Biol 24 8662 8670 15367684 10.1128/MCB.24.19.8662-8670.2004 PMC516752 98. Srebrow A Blaustein M Kornblihtt AR 2002 Regulation of fibronectin alternative splicing by a basement membrane-like extracellular matrix FEBS Lett 514 285 289 11943167 10.1016/s0014-5793(02)02382-7 99. Anczuków O Akerman M Cléry A Wu J Shen C Shirole NH Raimer A Sun S Jensen MA Hua Y 2015 SRSF1-Regulated Alternative Splicing in Breast Cancer Mol. Cell 60 105 117 26431027 10.1016/j.molcel.2015.09.005 PMC4597910 100. Urbanski LM Leclair N Anczuków O 2018 Alternative-splicing defects in cancer: Splicing regulators and their downstream targets, guiding the way to novel cancer therapeutics Wiley Interdiscip. Rev. RNA 9 e1476 29693319 10.1002/wrna.1476 PMC6002934 101. Blaustein M Pelisch F Tanos T Muñoz MJ Wengier D Quadrana L Sanford JR Muschietti JP Kornblihtt AR Cáceres JF 2005 Concerted regulation of nuclear and cytoplasmic activities of SR proteins by AKT Nat. Struct. Mol. Biol 12 1037 1044 16299516 10.1038/nsmb1020 102. Patel NA Kaneko S Apostolatos HS Bae SS Watson JE Davidowitz K Chappell DS Birnbaum MJ Cheng JQ Cooper DR 2005 Molecular and genetic studies imply Akt-mediated signaling promotes protein kinase CbetaII alternative splicing via phosphorylation of serine/arginine-rich splicing factor SRp40 J. Biol. Chem 280 14302 14309 15684423 10.1074/jbc.M411485200 103. Mouw JK Yui Y Damiano L Bainer RO Lakins JN Acerbi I Ou G Wijekoon AC Levental KR Gilbert PM 2014 Tissue mechanics modulate microRNA-dependent PTEN expression to regulate malignant progression Nat. Med 20 360 367 24633304 10.1038/nm.3497 PMC3981899 104. Wu B Liu DA Guan L Myint PK Chin L Dang H Xu Y Ren J Li T Yu Z 2023 Stiff matrix induces exosome secretion to promote tumour growth Nat. Cell Biol 25 415 424 36797475 10.1038/s41556-023-01092-1 PMC10351222 105. Phanish MK Heidebrecht F Nabi ME Shah N Niculescu-Duvaz I Dockrell MEC 2015 The Regulation of TGFβ1 Induced Fibronectin EDA Exon Alternative Splicing in Human Renal Proximal Tubule Epithelial Cells J. Cell. Physiol 230 286 295 24962218 10.1002/jcp.24703 106. Conboy JG 2017 Developmental regulation of RNA processing by Rbfox proteins WIREs RNA 8 10.1002/wrna.1398 PMC5315656 27748060 107. Jin Y Suzuki H Maegawa S Endo H Sugano S Hashimoto K Yasuda K Inoue K 2003 A vertebrate RNA-binding protein Fox-1 regulates tissue-specific splicing via the pentanucleotide GCAUG EMBO J 22 905 912 12574126 10.1093/emboj/cdg089 PMC145449 108. Lambert N Robertson A Jangi M McGeary S Sharp PA Burge CB 2014 RNA Bind-n-Seq: Quantitative Assessment of the Sequence and Structural Binding Specificity of RNA Binding Proteins Mol. Cell 54 887 900 24837674 10.1016/j.molcel.2014.04.016 PMC4142047 109. Zhang C Zhang Z Castle J Sun S Johnson J Krainer AR Zhang MQ 2008 Defining the regulatory network of the tissue-specific splicing factors Fox-1 and Fox-2 Genes Dev 22 2550 2563 18794351 10.1101/gad.1703108 PMC2546699 110. Kalsotra A Xiao X Ward AJ Castle JC Johnson JM Burge CB Cooper TA 2008 A postnatal switch of CELF and MBNL proteins reprograms alternative splicing in the developing heart Proc. Natl. Acad. Sci. USA 105 20333 20338 19075228 10.1073/pnas.0809045105 PMC2629332 111. Frese KS Meder B Keller A Just S Haas J Vogel B Fischer S Backes C Matzas M Köhler D 2015 RNA splicing regulated by RBFOX1 is essential for cardiac function in zebrafish J. Cell Sci 128 3030 3040 10.1242/jcs.166850 26116573 PMC4541041 112. Sastry SK Burridge K 2000 Focal Adhesions: A Nexus for Intracellular Signaling and Cytoskeletal Dynamics Exp. Cell Res 261 25 36 11082272 10.1006/excr.2000.5043 113. Burridge K Chrzanowska-Wodnicka M 1996 FOCAL ADHESIONS, CONTRACTILITY, AND SIGNALING Annu. Rev. Cell Dev. Biol 12 463 518 8970735 10.1146/annurev.cellbio.12.1.463 114. Calderwood DA Shattil SJ Ginsberg MH 2000 Integrins and Actin Filaments: Reciprocal Regulation of Cell Adhesion and Signaling J. Biol. Chem 275 22607 22610 10801899 10.1074/jbc.R900037199 115. Feramisco JR Smart JE Burridge K Helfman DM Thomas GP 1982 Co-existence of vinculin and a vinculin-like protein of higher molecular weight in smooth muscle J. Biol. Chem 257 11024 11031 6809764 116. Glukhova MA Kabakov AE Belkin AM Frid MG Ornatsky OI Zhidkova NI Koteliansky VE 1986 Meta-vinculin distribution in adult human tissues and cultured cells FEBS Lett 207 139 141 3095141 10.1016/0014-5793(86)80027-8 117. Belkin AM Ornatsky OI Kabakov AE Glukhova MA Koteliansky VE 1988 Diversity of vinculin/meta-vinculin in human tissues and cultivated cells. Expression of muscle specific variants of vinculin in human aorta smooth muscle cells J. Biol. Chem 263 6631 6635 3129429 118. Dumbauld DW Lee TT Singh A Scrimgeour J Gersbach CA Zamir EA Fu J Chen CS Curtis JE Craig SW García AJ 2013 How vinculin regulates force transmission Proc. Natl. Acad. Sci. USA 110 9788 9793 23716647 10.1073/pnas.1216209110 PMC3683711 119. Atherton P Stutchbury B Wang DY Jethwa D Tsang R Meiler-Rodriguez E Wang P Bate N Zent R Barsukov IL 2015 Vinculin controls talin engagement with the actomyosin machinery Nat. Commun 6 10038 26634421 10.1038/ncomms10038 PMC4686655 120. Tseng P-L Sun W Salem A Alaklobie M Macfarlane SC Gad AKB Collins MO Erdmann KS 2025 Mechanical control of the alternative splicing factor PTBP1 regulates extracellular matrix stiffness induced proliferation and cell spreading iScience 28 112273 40241749 10.1016/j.isci.2025.112273 PMC12002664 121. Keppetipola N Sharma S Li Q Black DL 2012 Neuronal regulation of pre-mRNA splicing by polypyrimidine tract binding proteins, PTBP1 and PTBP2 Crit. Rev. Biochem. Mol. Biol 47 360 378 22655688 10.3109/10409238.2012.691456 PMC3422667 122. Yeh Y-C Ling J-Y Chen W-C Lin H-H Tang M-J 2017 Mechanotransduction of matrix stiffness in regulation of focal adhesion size and number: reciprocal regulation of caveolin-1 and β1 integrin Sci. Rep 7 15008 29118431 10.1038/s41598-017-14932-6 PMC5678369 123. Du J Chen X Liang X Zhang G Xu J He L Zhan Q Feng XQ Chien S Yang C 2011 Integrin activation and internalization on soft ECM as a mechanism of induction of stem cell differentiation by ECM elasticity Proc. Natl. Acad. Sci. USA 108 9466 9471 21593411 10.1073/pnas.1106467108 PMC3111285 124. To WS Midwood KS 2011 Plasma and cellular fibronectin: distinct and independent functions during tissue repair Fibrogenesis Tissue Repair 4 21 21923916 10.1186/1755-1536-4-21 PMC3182887 125. Patten J Wang K 2021 Fibronectin in development and wound healing Adv. Drug Deliv. Rev 170 353 368 32961203 10.1016/j.addr.2020.09.005 126. Elosegui-Artola A Bazellières E Allen MD Andreu I Oria R Sunyer R Gomm JJ Marshall JF Jones JL Trepat X Roca-Cusachs P 2014 Rigidity sensing and adaptation through regulation of integrin types Nat. Mater 13 631 637 24793358 10.1038/nmat3960 PMC4031069 127. Kornblihtt AR Umezawa K Vibe-Pedersen K Baralle FE 1985 Primary structure of human fibronectin: differential splicing may generate at least 10 polypeptides from a single gene EMBO J 4 1755 1759 2992939 10.1002/j.1460-2075.1985.tb03847.x PMC554414 128. Kornblihtt AR Vibe-Pedersen K Baralle FE 1984 Human fibronectin: cell specific alternative mRNA splicing generates polypeptide chains dfffering in the number of internal repeats Nucleic Acids Res 12 5853 5868 6462919 10.1093/nar/12.14.5853 PMC320036 129. Kornblihtt AR Pesce CG Alonso CR Cramer P Srebrow A Werbajh S Muro AF 1996 The fibronectin gene as a model for splicing and transcription studies FASEB J 10 248 257 8641558 10.1096/fasebj.10.2.8641558 130. Schwarzbauer JE 1991 Alternative splicing of fibronectin: Three variants, three functions Bioessays 13 527 533 1755828 10.1002/bies.950131006 131. Murphy PA Hynes RO 2014 Alternative Splicing of Endothelial Fibronectin Is Induced by Disturbed Hemodynamics and Protects Against Hemorrhage of the Vessel Wall Arterioscler. Thromb. Vasc. Biol 34 2042 2050 24903094 10.1161/ATVBAHA.114.303879 PMC4140979 132. Murphy PA Jailkhani N Nicholas SA Del Rosario AM Balsbaugh JL Begum S Kimble A Hynes RO 2021 Alternative Splicing of FN (Fibronectin) Regulates the Composition of the Arterial Wall Under Low Flow Arterioscler. Thromb. Vasc. Biol 41 e18 e32 33207933 10.1161/ATVBAHA.120.314013 PMC8428803 133. Astrof S Crowley D Hynes RO 2007 Multiple cardiovascular defects caused by the absence of alternatively spliced segments of fibronectin Dev. Biol 311 11 24 17706958 10.1016/j.ydbio.2007.07.005 PMC2080666 134. Franco-Valls H Tusquets-Uxó E Sala L Val M Peña R Iaconcig A Villarino Á Jiménez-Arriola M Massó P Trincado JL 2023 Formation of an invasion-permissive matrix requires TGFβ/ SNAIL1-regulated alternative splicing of fibronectin Breast Cancer Res 25 143 37964360 10.1186/s13058-023-01736-y PMC10647173 135. Hooper AT Marquette K Chang CPB Golas J Jain S Lam MH Guffroy M Leal M Falahatpisheh H Mathur D 2022 Anti-Extra Domain B Splice Variant of Fibronectin Antibody-Drug Conjugate Eliminates Tumors with Enhanced Efficacy When Combined with Checkpoint Blockade Mol. Cancer Ther 21 1462 1472 35793468 10.1158/1535-7163.MCT-22-0099 PMC9446899 136. Phanish MK Heidebrecht F Jackson M Rigo F Dockrell MEC 2024 Targeting alternative splicing of fibronectin in human renal proximal tubule epithelial cells with antisense oligonucleotides to reduce EDA+ fibronectin production and block an autocrine loop that drives renal fibrosis Exp. Cell Res 442 114186 39098465 10.1016/j.yexcr.2024.114186 137. Liao K-C Chuo V Fagg WS Modahl CM Widen S Garcia-Blanco MA 2021 The RNA binding protein Quaking represses splicing of the Fibronectin EDA exon and downregulates the interferon response Nucleic Acids Res 49 10034 10045 34428287 10.1093/nar/gkab732 PMC8464043 138. Arriagada C Lin E Schonning M Astrof S 2025 Mesodermal fibronectin controls cell shape, polarity, and mechanotransduction in the second heart field during cardiac outflow tract development Dev. Cell 60 62 84.e7 10.1016/j.devcel.2024.09.017 39413783 PMC11706711 139. Schwarzbauer JE Patel RS Fonda D Hynes RO 1987 Multiple sites of alternative splicing of the rat fibronectin gene transcript EMBO J 6 2573 2580 2445560 10.1002/j.1460-2075.1987.tb02547.x PMC553677 140. Norton PA Hynes RO 1987 Alternative Splicing of Chicken Fibronectin in Embryos and in Normal and Transformed Cells Mol. Cell Biol 7 4297 4307 2830487 10.1128/mcb.7.12.4297 PMC368112 141. Sekiguchi K Klos AM Kurachi K Yoshitake S Hakomori S 1986 Human liver fibronectin complementary DNAs: identification of two different messenger RNAs possibly encoding the .alpha. and .beta. subunits of plasma fibronectin Biochemistry 25 4936 4941 3021206 10.1021/bi00365a032 142. White ES Baralle FE Muro AF 2008 New insights into form and function of fibronectin splice variants J. Pathol 216 1 14 18680111 10.1002/path.2388 PMC4630009 143. Pankov R Yamada KM 2002 Fibronectin at a glance J. Cell Sci 115 3861 3863 12244123 10.1242/jcs.00059 144. Liao Y-F Gotwals PJ Koteliansky VE Sheppard D Van De Water L 2002 The EIIIA Segment of Fibronectin Is a Ligand for Integrins α9β1 and α4β1Providing a Novel Mechanism for Regulating Cell Adhesion by Alternative Splicing J. Biol. Chem 277 14467 14474 11839764 10.1074/jbc.M201100200 145. Ffrench-Constant C Van de Water L Dvorak HF Hynes RO 1989 Reappearance of an embryonic pattern of fibronectin splicing during wound healing in the adult rat J. Cell Biol 109 903 914 2760116 10.1083/jcb.109.2.903 PMC2115730 146. George EL Georges-Labouesse EN Patel-King RS Rayburn H Hynes RO 1993 Defects in mesoderm, neural tube and vascular development in mouse embryos lacking fibronectin Development 119 1079 1091 8306876 10.1242/dev.119.4.1079 147. Peters JH Hynes RO 1996 Fibronectin Isoform Distribution in the Mouse I. The Alternatively Spliced EIIIB, EIIIA, and V Segments Show Widespread Codistribution in the Developing Mouse Embryo Cell Adhes. Commun 4 103 125 8937746 10.3109/15419069609010766 148. Peters JH Loredo GA Chen G Maunder R Hahn TJ Willits NH Hynes RO 2003 Plasma levels of fibronectin bearing the alternatively spliced EIIIB segment are increased after major trauma J. Lab. Clin. Med 141 401 410 12819638 10.1016/S0022-2143(03)00042-8 149. Peters JH Maunder RJ Woolf AD Cochrane CG Ginsberg MH 1989 Elevated plasma levels of ED1+ (‘cellular’) fibronectin in patients with vascular injury J. Lab. Clin. Med 113 586 597 2715681 150. Chang M-L Chen J-C Alonso CR Kornblihtt AR Bissell DM 2004 Regulation of fibronectin splicing in sinusoidal endothelial cells from normal or injured liver Proc. Natl. Acad. Sci. USA 101 18093 18098 15604136 10.1073/pnas.0408439102 PMC539814 151. Brown LF Dubin D Lavigne L Logan B Dvorak HF Van de Water L 1993 Macrophages and fibroblasts express embryonic fibronectins during cutaneous wound healing Am. J. Pathol 142 793 801 8456940 PMC1886786 152. Barnes JL Hastings RR De la Garza MA 1994 Sequential expression of cellular fibronectin by platelets, macrophages, and mesangial cells in proliferative glomerulonephritis Am. J. Pathol 145 585 597 8080041 PMC1890339 153. Kuhn C Boldt J King TE Jr. Crouch E Vartio T McDonald JA 1989 An immunohistochemical study of architectural remodeling and connective tissue synthesis in pulmonary fibrosis Am. Rev. Respir. Dis 140 1693 1703 2604297 10.1164/ajrccm/140.6.1693 154. Peters JH Chen GE Hynes RO 1996 Fibronectin isoform distribution in the mouse. II. Differential distribution of the alternatively spliced EIIIB, EIIIA, and V segments in the adult mouse Cell Adhes. Commun 4 127 148 8937747 10.3109/15419069609010767 155. Gehris AL Oberlender SA Shepley KJ Tuan RS Bennett VD 1996 Fibronectin mRNA alternative splicing is temporally and spatially regulated during chondrogenesis in vivo and in vitro Dev. Dyn 206 219 230 8725289 10.1002/(SICI)1097-0177(199606)206:2<219::AID-AJA11>3.0.CO;2-Y 156. Barone MV Henchcliffe C Baralle FE Paolella G 1989 Cell type specific trans-acting factors are involved in alternative splicing of human fibronectin pre-mRNA EMBO J 8 1079 1085 2545440 10.1002/j.1460-2075.1989.tb03476.x PMC400917 157. Lim LP Sharp PA 1998 Alternative splicing of the fibronectin EIIIB exon depends on specific TGCATG repeats Mol. Cell Biol 18 3900 3906 9632774 10.1128/mcb.18.7.3900 PMC108974 158. Huh GS Hynes RO 1994 Regulation of alternative pre-mRNA splicing by a novel repeated hexanucleotide element Genes Dev 8 1561 1574 7958840 10.1101/gad.8.13.1561 159. Dominguez D Freese P Alexis MS Su A Hochman M Palden T Bazile C Lambert NJ Van Nostrand EL Pratt GA 2018 Sequence, Structure, and Context Preferences of Human RNA Binding Proteins Mol. Cell 70 854 867.e9 29883606 10.1016/j.molcel.2018.05.001 PMC6062212 160. Hensel JA Heineman BD Kimble AL Jellison ER Reese B Murphy PA 2021 Identification of splice regulators of fibronectin-EIIIA and EIIIB by direct measurement of exon usage in a flow-cytometry based CRISPR screen Sci. Rep 11 19835 34615942 10.1038/s41598-021-99079-1 PMC8494765 161. Murphy PA Butty VL Boutz PL Begum S Kimble AL Sharp PA Burge CB Hynes RO 2018 Alternative RNA splicing in the endothelium mediated in part by Rbfox2 regulates the arterial response to low flow eLife 7 e29494 29293084 10.7554/eLife.29494 PMC5771670 162. Jangi M Boutz PL Paul P Sharp PA 2014 Rbfox2 controls autoregulation in RNA-binding protein networks Genes Dev 28 637 651 24637117 10.1101/gad.235770.113 PMC3967051 163. Lopez-Mejia IC De Toledo M Della Seta F Fafet P Rebouissou C Deleuze V Blanchard JM Jorgensen C Tazi J Vignais ML 2013 Tissue-specific and SRSF1-dependent splicing of fibronectin, a matrix protein that controls host cell invasion Mol. Biol. Cell 24 3164 3176 23966470 10.1091/mbc.E13-03-0142 PMC3806663 164. Xiang J Natarajan SK Tremmel M Ma D Mocco J Hopkins LN Siddiqui AH Levy EI Meng H 2011 Hemodynamic–Morpho-logic Discriminants for Intracranial Aneurysm Rupture Stroke 42 144 152 21106956 10.1161/STROKEAHA.110.592923 PMC3021316 165. Cicha I Wörner A Urschel K Beronov K Goppelt-Struebe M Ver-hoeven E Daniel WG Garlichs CD 2011 Carotid Plaque Vulnerability: A Positive Feedback Between Hemodynamic and Biochemical Mechanisms Stroke 42 3502 3510 21998063 10.1161/STROKEAHA.111.627265 166. Cheng C Tempel D van Haperen R van der Baan A Grosveld F Daemen MJAP Krams R de Crom R 2006 Atherosclerotic Lesion Size and Vulnerability Are Determined by Patterns of Fluid Shear Stress Circulation 113 2744 2753 16754802 10.1161/CIRCULATIONAHA.105.590018 167. Boussel L Rayz V McCulloch C Martin A Acevedo-Bolton G Lawton M Higashida R Smith WS Young WL Saloner D 2008 Aneurysm Growth Occurs at Region of Low Wall Shear Stress Stroke 39 2997 3002 18688012 10.1161/STROKEAHA.108.521617 PMC2661849 168. Argraves WS Tanaka A Smith EP Twal WO Argraves KM Fan D Haudenschild CC 2009 Fibulin-1 and fibrinogen in human atherosclerotic lesions Histochem. Cell Biol 132 559 565 19693531 10.1007/s00418-009-0628-7 169. Bhosale SD Moulder R Venäläinen MS Koskinen JS Pitkänen N Juonala MT Kähönen MAP Lehtimäki TJ Viikari JSA Elo LL 2018 Serum Proteomic Profiling to Identify Biomarkers of Premature Carotid Atherosclerosis Sci. Rep 8 9209 29907817 10.1038/s41598-018-27265-9 PMC6003912 170. Zhao Q Zhou H Li X Xiao B 2019 The mechanosensitive Piezo1 channel: a three-bladed propeller-like structure and a lever-like mechanogating mechanism FEBS J 286 2461 2470 30500111 10.1111/febs.14711 171. Miyamoto T Mochizuki T Nakagomi H Kira S Watanabe M Takayama Y Suzuki Y Koizumi S Takeda M Tominaga M 2014 Functional role for Piezo1 in stretch-evoked Ca2+ influx and ATP release in Urothelial cell cultures J. Biol. Chem 289 16565 16575 24759099 10.1074/jbc.M113.528638 PMC4047422 172. Lee W Leddy HA Chen Y Lee SH Zelenski NA McNulty AL Wu J Beicker KN Coles J Zauscher S 2014 Synergy between Piezo1 and Piezo2 channels confers high-strain mechanosensitivity to articular cartilage Proc. Natl. Acad. Sci. USA 111 E5114 E5122 25385580 10.1073/pnas.1414298111 PMC4250098 173. Cahalan SM Lukacs V Ranade SS Chien S Bandell M Patapoutian A 2015 Piezo1 links mechanical forces to red blood cell volume eLife 4 e07370 26001274 10.7554/eLife.07370 PMC4456639 174. Faucherre A Kissa K Nargeot J Mangoni ME Jopling C 2014 Piezo1 plays a role in erythrocyte volume homeostasis Haemato-logica 99 70 75 10.3324/haematol.2013.086090 PMC4007942 23872304 175. Santana Nunez D Malik AB Lee Q Ahn SJ Coctecon-Murillo A Lazarko D Levitan I Mehta D Komarova YA 2023 Piezo1 induces endothelial responses to shear stress via soluble adenylyl Cyclase-IP3R2 circuit iScience 26 106661 37168565 10.1016/j.isci.2023.106661 PMC10164902 176. Ranade SS Woo SH Dubin AE Moshourab RA Wetzel C Petrus M Mathur J Bégay V Coste B Mainquist J 2014 Piezo2 is the major transducer of mechanical forces for touch sensation in mice Nature 516 121 125 25471886 10.1038/nature13980 PMC4380172 177. Maksimovic S Nakatani M Baba Y Nelson AM Marshall KL Wellnitz SA Firozi P Woo SH Ranade S Patapoutian A Lumpkin EA 2014 Epidermal Merkel cells are mechanosensory cells that tune mammalian touch receptors Nature 509 617 621 24717432 10.1038/nature13250 PMC4097312 178. Woo SH Ranade S Weyer AD Dubin AE Baba Y Qiu Z Petrus M Miyamoto T Reddy K Lumpkin EA 2014 Piezo2 is required for Merkel-cell mechanotransduction Nature 509 622 626 24717433 10.1038/nature13251 PMC4039622 179. Schulz K Hazelton-Cavill P Alornyo KK Edenhofer I Lindenmeyer M Lohr C Huber TB Denholm B Koehler S 2024 Piezo activity levels need to be tightly regulated to maintain normal morphology and function in pericardial nephrocytes Sci. Rep 14 28254 39548228 10.1038/s41598-024-79352-9 PMC11568303 180. Geng J Liu W Zhou H Zhang T Wang L Zhang M Li Y Shen B Li X Xiao B 2020 A Plug-and-Latch Mechanism for Gating the Mechanosensitive Piezo Channel Neuron 106 438 451.e6 32142647 10.1016/j.neuron.2020.02.010 181. Szczot M Pogorzala LA Solinski HJ Young L Yee P Le Pichon CE Chesler AT Hoon MA 2017 Cell-Type-Specific Splicing of Piezo2 Regulates Mechanotransduction Cell Rep 21 2760 2771 29212024 10.1016/j.celrep.2017.11.035 PMC5741189 182. Lewis AH Cui AF McDonald MF Grandl J 2017 Transduction of Repetitive Mechanical Stimuli by Piezo1 and Piezo2 Ion Channels Cell Rep 19 2572 2585 28636944 10.1016/j.celrep.2017.05.079 PMC5646378 183. Heyman NS Cowles CL Barnett SD Wu YY Cullison C Singer CA Leblanc N Buxton IL 2013 TREK-1 currents in smooth muscle cells from pregnant human myometrium Am J Physiol Cell Physiol 305 C632 42 10.1152/ajpcell.00324.2012 23804201 PMC3761174 184. Cowles CL Wu YY Barnett SD Lee MT Burkin HR Buxton ILO 2015 Alternatively Spliced Human TREK-1 Variants Alter TREK-1 Channel Function and Localization1 Biol. Reprod 93 122 26400398 10.1095/biolreprod.115.129791 PMC4712007 185. Bechard E Bride J Le Guennec JY Brette F Demion M 2022 TREK-1 in the heart: Potential physiological and pathophysiological roles Front. Physiol 13 1095102 10.3389/fphys.2022.1095102 36620226 PMC9815770 186. Alloui A Zimmermann K Mamet J Duprat F Noël J Chemin J Guy N Blondeau N Voilley N Rubat-Coudert C 2006 TREK-1, a K+ channel involved in polymodal pain perception EMBO J 25 2368 2376 16675954 10.1038/sj.emboj.7601116 PMC1478167 187. Hervieu GJ Cluderay JE Gray CW Green PJ Ranson JL Randall AD Meadows HJ 2001 Distribution and expression of TREK-1, a two-pore-domain potassium channel, in the adult rat CNS Neuroscience 103 899 919 11301200 10.1016/s0306-4522(01)00030-6 188. Wu YY Singer CA Buxton ILO 2012 Variants of stretch-activated two-pore potassium channel TREK-1 associated with preterm labor in humans Biol. Reprod 87 96 22811574 10.1095/biolreprod.112.099499 PMC3507547 189. Fink M Duprat F Lesage F Reyes R Romey G Heurteaux C Lazdunski M 1996 Cloning, functional expression and brain localization of a novel unconventional outward rectifier K+ channel EMBO J 15 6854 6862 9003761 PMC452511 190. Bockenhauer D Zilberberg N Goldstein SA 2001 KCNK2: reversible conversion of a hippocampal potassium leak into a voltage-dependent channel Nat. Neurosci 4 486 491 11319556 10.1038/87434 191. Xian Tao L Dyachenko V Zuzarte M Putzke C Preisig-Müller R Isenberg G Daut J 2006 The stretch-activated potassium channel TREK-1 in rat cardiac ventricular muscle Cardiovasc. Res 69 86 97 16248991 10.1016/j.cardiores.2005.08.018 192. Rinné S Renigunta V Schlichthörl G Zuzarte M Bittner S Meuth SG Decher N Daut J Preisig-Müller R 2014 A splice variant of the two-pore domain potassium channel TREK-1 with only one pore domain reduces the surface expression of full-length TREK-1 channels Pflugers Arch 466 1559 1570 24196565 10.1007/s00424-013-1384-z 193. Veale EL Rees KA Mathie A Trapp S 2010 Dominant Negative Effects of a Non-conducting TREK1 Splice Variant Expressed in Brain J. Biol. Chem 285 29295 29304 20605797 10.1074/jbc.M110.108423 PMC2937962 194. Abraham DM Lee TE Watson LJ Mao L Chandok G Wang HG Frangakis S Pitt GS Shah SH Wolf MJ Rockman HA 2018 The two-pore domain potassium channel TREK-1 mediates cardiac fibrosis and diastolic dysfunction J. Clin. Investig 128 4843 4855 30153110 10.1172/JCI95945 PMC6205385 195. Li Z-B Zhang H-X Li L-L Wang X-L 2005 Enhanced expressions of arachidonic acid-sensitive tandem-pore domain potassium channels in rat experimental acute cerebral ischemia Biochem. Biophys. Res. Commun 327 1163 1169 15652517 10.1016/j.bbrc.2004.12.124 196. Devilliers M Busserolles J Lolignier S Deval E Pereira V Alloui A Christin M Mazet B Delmas P Noel J 2013 Activation of TREK-1 by morphine results in analgesia without adverse side effects Nat. Commun 4 2941 24346231 10.1038/ncomms3941 197. Austen K Ringer P Mehlich A Chrostek-Grashoff A Kluger C Klingner C Sabass B Zent R Rief M Grashoff C 2015 Extracellular rigidity sensing by talin isoform-specific mechanical linkages Nat. Cell Biol 17 1597 1606 26523364 10.1038/ncb3268 PMC4662888 198. Huveneers S Oldenburg J Spanjaard E van der Krogt G Grigoriev I Akhmanova A Rehmann H de Rooij J 2012 Vinculin associates with endothelial VE-cadherin junctions to control force-dependent remodeling J. Cell Biol 196 641 652 22391038 10.1083/jcb.201108120 PMC3307691 199. del Rio A Perez-Jimenez R Liu R Roca-Cusachs P Fernandez JM Sheetz MP 2009 Stretching Single Talin Rod Molecules Activates Vinculin Binding Science 323 638 641 19179532 10.1126/science.1162912 PMC9339221 200. Grashoff C Hoffman BD Brenner MD Zhou R Parsons M Yang MT McLean MA Sligar SG Chen CS Ha T Schwartz MA 2010 Measuring mechanical tension across vinculin reveals regulation of focal adhesion dynamics Nature 466 263 266 20613844 10.1038/nature09198 PMC2901888 201. Humphries JD Wang P Streuli C Geiger B Humphries MJ Ballestrem C 2007 Vinculin controls focal adhesion formation by direct interactions with talin and actin J. Cell Biol 179 1043 1057 18056416 10.1083/jcb.200703036 PMC2099183 202. Thompson PM Tolbert CE Shen K Kota P Palmer SM Plevock KM Orlova A Galkin VE Burridge K Egelman EH 2014 Identification of an Actin Binding Surface on Vinculin that Mediates Mechanical Cell and Focal Adhesion Properties Structure 22 697 706 24685146 10.1016/j.str.2014.03.002 PMC4039106 203. Rangarajan ES Lee JH Yogesha SD Izard T 2010 A Helix Replacement Mechanism Directs Metavinculin Functions PLoS One 5 e10679 20502710 10.1371/journal.pone.0010679 PMC2873289 204. Byrne BJ Kaczorowski YJ Coutu MD Craig SW 1992 Chicken vinculin and meta-Vinculin are derived from a single gene by alternative splicing of a 207-base pair exon unique to meta-Vinculin J. Biol. Chem 267 12845 12850 1618784 205. Janssen MEW Liu H Volkmann N Hanein D 2012 The C-terminal tail domain of metavinculin, vinculin’s splice variant, severs actin filaments J. Cell Biol 197 585 593 22613835 10.1083/jcb.201111046 PMC3365496 206. Kim LY Thompson PM Lee HT Pershad M Campbell SL Alushin GM 2016 The Structural Basis of Actin Organization by Vinculin and Metavinculin J. Mol. Biol 428 10 25 26493222 10.1016/j.jmb.2015.09.031 PMC4738167 207. Oztug Durer ZA McGillivary RM Kang H Elam WA Vizcarra CL Hanein D De La Cruz EM Reisler E Quinlan ME 2015 Meta-vinculin Tunes the Flexibility and the Architecture of Vinculin-Induced Bundles of Actin Filaments J. Mol. Biol 427 2782 2798 26168869 10.1016/j.jmb.2015.07.005 PMC4540644 208. Rüdiger M Korneeva N Schwienbacher C Weiss EE Jockusch BM 1998 Differential actin organization by vinculin isoforms: Implications for cell type-specific microfilament anchorage FEBS Lett 431 49 54 9684863 10.1016/s0014-5793(98)00723-6 209. Belkin AM Ornatsky OI Glukhova MA Koteliansky VE 1988 Immunolocalization of meta-vinculin in human smooth and cardiac muscles J. Cell Biol 107 545 553 3138246 10.1083/jcb.107.2.545 PMC2115213 210. Witt S Zieseniss A Fock U Jockusch BM Illenberger S 2004 Comparative Biochemical Analysis Suggests That Vinculin and Metavinculin Cooperate in Muscular Adhesion Sites J. Biol. Chem 279 31533 31543 15159399 10.1074/jbc.M314245200 211. Olson TM Illenberger S Kishimoto NY Huttelmaier S Keating MT Jockusch BM 2002 Metavinculin Mutations Alter Actin Interaction in Dilated Cardiomyopathy Circulation 105 431 437 11815424 10.1161/hc0402.102930 212. Vasile VC Will ML Ommen SR Edwards WD Olson TM Ackerman MJ 2006 Identification of a metavinculin missense mutation, R975W, associated with both hypertrophic and dilated cardiomyopathy Mol. Genet. Metab 87 169 174 16236538 10.1016/j.ymgme.2005.08.006 213. Maeda M Holder E Lowes B Valent S Bies RD 1997 Dilated Cardiomyopathy Associated With Deficiency of the Cytoskeletal Protein Metavinculin Circulation 95 17 20 8994410 10.1161/01.cir.95.1.17 214. Turner CE Burridge K 1989 Detection of metavinculin in human platelets using a modified talin overlay assay Eur. J. Cell Biol 49 202 206 2503380 215. Lee HT Sharek L O’Brien ET Urbina FL Gupton SL Superfine R Burridge K Campbell SL 2019 Vinculin and metavinculin exhibit distinct effects on focal adhesion properties, cell migration, and mechanotransduction PLoS One 14 e0221962 31483833 10.1371/journal.pone.0221962 PMC6726196 216. Kanoldt V Kluger C Barz C Schweizer AL Ramanujam D Wind-gasse L Engelhardt S Chrostek-Grashoff A Grashoff C 2020 Metavinculin modulates force transduction in cell adhesion sites Nat. Commun 11 6403 33335089 10.1038/s41467-020-20125-z PMC7747745 217. Krishnamoorthy GP Glover AR Untch BR Sigcha-Coello N Xu B Vukel D Liu Y Tiedje V Pineda JMB Berman K 2025 RBM10 loss promotes metastases by aberrant splicing of cytoskeletal and extracellular matrix mRNAs J. Exp. Med 222 e20241029 39992626 10.1084/jem.20241029 PMC11849553 218. Caprara GA Mecca AA Wang Y Ricci AJ Peng AW 2019 Hair Bundle Stimulation Mode Modifies Manifestations of Mechanotransduction Adaptation J. Neurosci 39 9098 9106 31578232 10.1523/JNEUROSCI.1408-19.2019 PMC6855673 219. Hudspeth AJ 2008 Making an Effort to Listen: Mechanical Amplification in the Ear Neuron 59 530 545 18760690 10.1016/j.neuron.2008.07.012 PMC2724262 220. Petit C Richardson GP 2009 Linking genes underlying deafness to hair-bundle development and function Nat. Neurosci 12 703 710 19471269 10.1038/nn.2330 PMC3332156 221. Kawashima Y Géléoc GSG Kurima K Labay V Lelli A Asai Y Makishima T Wu DK Della Santina CC Holt JR Griffith AJ 2011 Mechanotransduction in mouse inner ear hair cells requires transmembrane channel-like genes J. Clin. Investig 121 4796 4809 22105175 10.1172/JCI60405 PMC3223072 222. Cunningham CL Müller U 2019 Molecular Structure of the Hair Cell Mechanoelectrical Transduction Complex. Cold Spring Harb Perspect. Med 9 a033167 10.1101/cshperspect.a033167 PMC6496331 30082452 223. Ahmed ZM Goodyear R Riazuddin S Lagziel A Legan PK Behra M Burgess SM Lilley KS Wilcox ER Riazuddin S 2006 The tip-link antigen, a protein associated with the transduction complex of sensory hair cells, is protocadherin-15 J. Neurosci 26 7022 7034 16807332 10.1523/JNEUROSCI.1163-06.2006 PMC6673907 224. Zhou Z Yu X Jiang B Feng W Tian Y Liu Z Wang J Huang P 2021 Alternative Splicing of Three Genes Encoding Mechanotransduction-Complex Proteins in Auditory Hair Cells eNeuro 8 10.1523/ENEURO.0381-20.2020 PMC7920537 33509951 225. Pepermans E Michel V Goodyear R Bonnet C Abdi S Dupont T Gherbi S Holder M Makrelouf M Hardelin JP 2014 The CD 2 isoform of protocadherin-15 is an essential component of the tip-link complex in mature auditory hair cells EMBO Mol. Med 6 984 992 24940003 10.15252/emmm.201403976 PMC4119359 226. Corey DP Akyuz N Holt JR 2019 Function and Dysfunction of TMC Channels in Inner Ear Hair Cells. Cold Spring Harb Perspect. Med 9 a033506 10.1101/cshperspect.a033506 PMC6450785 30291150 227. Pan B Akyuz N Liu XP Asai Y Nist-Lund C Kurima K Derfler BH György B Limapichat W Walujkar S 2018 TMC1 Forms the Pore of Mechanosensory Transduction Channels in Vertebrate Inner Ear Hair Cells Neuron 99 736 753.e6 30138589 10.1016/j.neuron.2018.07.033 PMC6360533 228. Kurima K Peters LM Yang Y Riazuddin S Ahmed ZM Naz S Arnaud D Drury S Mo J Makishima T 2002 Dominant and recessive deafness caused by mutations of a novel gene, TMC1, required for cochlear hair-cell function Nat. Genet 30 277 284 11850618 10.1038/ng842 229. Steel KP Bock GR 1980 The nature of inherited deafness in deafness mice Nature 288 159 161 7432512 10.1038/288159a0 230. Deol MS Kocher W 1958 A new gene for deafness in the mouse Heredity 12 463 466 231. Yamaguchi S Hamamura M Otsuguro KI 2020 Mechanosensitive Channel, Mouse Transmembrane Channel-Like Protein 1 (mTMC1) Is Translated from a Splice Variant mTmc1ex1 but Not from the Other Variant mTmc1ex2 Int. J. Mol. Sci 21 6465 32899784 10.3390/ijms21186465 PMC7554986 232. Li Y Liu H Giffen KP Chen L Beisel KW He DZZ 2018 Transcriptomes of cochlear inner and outer hair cells from adult mice Sci. Data 5 180199 30277483 10.1038/sdata.2018.199 PMC6167952 233. Qiu X Liang X Llongueras JP Cunningham C Müller U 2023 The tetraspan LHFPL5 is critical to establish maximal force sensitivity of the mechanotransduction channel of cochlear hair cells Cell Rep 42 112245 36917610 10.1016/j.celrep.2023.112245 PMC10337519 234. Xiong W Grillet N Elledge HM Wagner TFJ Zhao B Johnson KR Kazmierczak P Müller U 2012 TMHS Is an Integral Component of the Mechanotransduction Machinery of Cochlear Hair Cells Cell 151 1283 1295 23217710 10.1016/j.cell.2012.10.041 PMC3522178 235. Longo-Guess CM Gagnon LH Fritzsch B Johnson KR 2007 Targeted knockout and lacZ reporter expression of the mouse Tmhs deafness gene and characterization of the hscy-2J mutation Mamm. Genome 18 646 656 17876667 10.1007/s00335-007-9049-x PMC2613174 236. Cunningham CL Qiu X Wu Z Zhao B Peng G Kim YH Lauer A Müller U 2020 TMIE Defines Pore and Gating Properties of the Mechanotransduction Channel of Mammalian Cochlear Hair Cells Neuron 107 126 143.e8 32343945 10.1016/j.neuron.2020.03.033 PMC7351599 237. Dionne G Qiu X Rapp M Liang X Zhao B Peng G Katsamba PS Ahlsen G Rubinstein R Potter CS 2018 Mechanotransduction by PCDH15 Relies on a Novel cis-Dimeric Architecture Neuron 99 480 492.e5 30057206 10.1016/j.neuron.2018.07.006 PMC6168201 238. Assad JA Shepherd GM Corey DP 1991 Tip-link integrity and mechanical transduction in vertebrate hair cells Neuron 7 985 994 1764247 10.1016/0896-6273(91)90343-x 239. Webb SW Grillet N Andrade LR Xiong W Swarthout L Della Santina CC Kachar B Müller U 2011 Regulation of PCDH15 function in mechanosensory hair cells by alternative splicing of the cytoplasmic domain Development 138 1607 1617 21427143 10.1242/dev.060061 PMC3062428 240. Rouget-Quermalet V Giustiniani J Marie-Cardine A Beaud G Besnard F Loyaux D Ferrara P Leroy K Shimizu N Gaulard P 2006 Protocadherin 15 (PCDH15): a new secreted isoform and a potential marker for NK/T cell lymphomas Oncogene 25 2807 2811 16369489 10.1038/sj.onc.1209301 241. Wang Y Zhang C Peng W Du H Xi Y Xu Z 2023 RBM24 is required for mouse hair cell development through regulating pre-mRNA alternative splicing and mRNA stability J. Cell. Physiol 238 1095 1110 36947695 10.1002/jcp.31003 242. Merkin J Russell C Chen P Burge CB 2012 Evolutionary Dynamics of Gene and Isoform Regulation in Mammalian Tissues Science 338 1593 1599 23258891 10.1126/science.1228186 PMC3568499 243. Brinegar AE Xia Z Loehr JA Li W Rodney GG Cooper TA 2017 Extensive alternative splicing transitions during postnatal skeletal muscle development are required for calcium handling functions eLife 6 e27192 28826478 10.7554/eLife.27192 PMC5577920 244. Fugier C Klein AF Hammer C Vassilopoulos S Ivarsson Y Toussaint A Tosch V Vignaud A Ferry A Messaddeq N 2011 Misregulated alternative splicing of BIN1 is associated with T tubule alterations and muscle weakness in myotonic dystrophy Nat. Med 17 720 725 21623381 10.1038/nm.2374 245. Giudice J Loehr JA Rodney GG Cooper TA 2016 Alternative Splicing of Four Trafficking Genes Regulates Myofiber Structure and Skeletal Muscle Physiology Cell Rep 17 1923 1933 27851958 10.1016/j.celrep.2016.10.072 PMC5140099 246. Moulay G Lainé J Lemaître M Nakamori M Nishino I Caillol G Mamchaoui K Julien L Dingli F Loew D 2020 Alternative splicing of clathrin heavy chain contributes to the switch from coated pits to plaques J. Cell Biol 219 e201912061 32642759 10.1083/jcb.201912061 PMC7480091 247. Yang J Hung LH Licht T Kostin S Looso M Khrameeva E Bindereif A Schneider A Braun T 2014 RBM24 Is a Major Regulator of Muscle-Specific Alternative Splicing Dev. Cell 31 87 99 25313962 10.1016/j.devcel.2014.08.025 248. Creemers EE Bawazeer A Ugalde AP van Deutekom HWM van der Made I de Groot NE Adriaens ME Cook SA Bezzina CR Hubner N 2016 Genome-Wide polyadenylation maps reveal dynamic mRNA 3 ′ Circ. Res 118 433 438 26671978 10.1161/CIRCRESAHA.115.307082 249. Soetanto R Hynes CJ Patel HR Humphreys DT Evers M Duan G Parker BJ Archer SK Clancy JL Graham RM 2016 Role of miRNAs and alternative mRNA 3 ′ Biochim. Biophys. Acta 1859 744 756 27032571 10.1016/j.bbagrm.2016.03.010 250. Mattias F Tsoy O Hammer E Gress A Simm S Lio CT Ameling S Amann K Dreher L Wenzel U 2025 Alternative Splicing in Mechanically Stretched Podocytes as a Model of Glomerular Hypertension J. Am. Soc. Nephrol 10.1681/ASN.0000000706 PMC12416947 40418580 251. Endlich N Kress KR Reiser J Uttenweiler D Kriz W Mundel P Endlich K 2001 Podocytes respond to mechanical stress in vitro J. Am. Soc. Nephrol 12 413 422 11181788 10.1681/ASN.V123413 252. Friedrich C Endlich N Kriz W Endlich K 2006 Podocytes are sensitive to fluid shear stress in vitro Am. J. Physiol. Renal Physiol 291 F856 F865 16684926 10.1152/ajprenal.00196.2005 253. Endlich K Kliewe F Endlich N 2017 Stressed podocytes-mechanical forces, sensors, signaling and response Pflugers Arch 469 937 949 28687864 10.1007/s00424-017-2025-8 254. Shi Y 2012 Alternative polyadenylation: New insights from global analyses Rna 18 2105 2117 23097429 10.1261/rna.035899.112 PMC3504663 255. Li L Huang KL Gao Y Cui Y Wang G Elrod ND Li Y Chen YE Ji P Peng F 2021 An atlas of alternative polyadenylation quantitative trait loci contributing to complex trait and disease heritability Nat. Genet 53 994 1005 33986536 10.1038/s41588-021-00864-5 256. Mariella E Marotta F Grassi E Gilotto S Provero P 2019 The Length of the Expressed 3′ UTR Is an Intermediate Molecular Phenotype Linking Genetic Variants to Complex Diseases Front. Genet 10 714 31475030 10.3389/fgene.2019.00714 PMC6707137 257. Mittleman BE Pott S Warland S Zeng T Mu Z Kaur M Gilad Y Li Y 2020 Alternative polyadenylation mediates genetic regulation of gene expression eLife 9 e57492 32584258 10.7554/eLife.57492 PMC7338057 258. Sadek J Omer A Hall D Ashour K Gallouzi IE 2019 Alternative polyadenylation and the stress response WIREs RNA 10 e1540 31050180 10.1002/wrna.1540 259. Hollerer I Curk T Haase B Benes V Hauer C Neu-Yilik G Bhuvanagiri M Hentze MW Kulozik AE 2016 The differential expression of alternatively polyadenylated transcripts is a common stress-induced response mechanism that modulates mammalian mRNA expression in a quantitative and qualitative fashion RNA 22 1441 1453 27407180 10.1261/rna.055657.115 PMC4986898 260. Zheng D Wang R Ding Q Wang T Xie B Wei L Zhong Z Tian B 2018 Cellular stress alters 3 ′ Nat. Commun 9 2268 29891946 10.1038/s41467-018-04730-7 PMC5995920 261. Weber M Hagedorn CH Harrison DG Searles CD 2005 Laminar shear stress and 3’ polyadenylation of eNOS mRNA Circ. Res 96 1161 1168 15905462 10.1161/01.RES.0000170651.72198.fa 262. Lyon RC Zanella F Omens JH Sheikh F 2015 Mechanotransduction in Cardiac Hypertrophy and Failure Circ. Res 116 1462 1476 25858069 10.1161/CIRCRESAHA.116.304937 PMC4394185 263. Lammerding J Kamm RD Lee RT 2004 Mechanotransduction in cardiac myocytes Ann. N. Y. Acad. Sci 1015 53 70 15201149 10.1196/annals.1302.005 264. Gruber AJ Zavolan M 2019 Alternative cleavage and polyadenylation in health and disease Nat. Rev. Genet 20 599 614 31267064 10.1038/s41576-019-0145-z 265. Zhang Y Li Z 2021 RNA binding proteins: Linking mechanotransduction and tumor metastasis Cancer Lett 496 30 40 33007411 10.1016/j.canlet.2020.09.020 266. Seufert L Benzing T Ignarski M Müller RU 2022 RNA-binding proteins and their role in kidney disease Nat. Rev. Nephrol 18 153 170 10.1038/s41581-021-00497-1 34732838 267. Hastings ML Krainer AR 2023 RNA therapeutics RNA 29 393 395 10.1261/rna.079626.123 36928165 PMC10019368 268. Sachse M Tual-Chalot S Ciliberti G Amponsah-Offeh M Stamate-lopoulos K Gatsiou A Stellos K 2023 RNA-binding proteins in vascular inflammation and atherosclerosis Atherosclerosis 374 55 73 10.1016/j.atherosclerosis.2023.01.008 36759270 269. Takakusa H Iwazaki N Nishikawa M Yoshida T Obika S Inoue T 2023 Drug Metabolism and Pharmacokinetics of Antisense Oligonucleotide Therapeutics: Typical Profiles, Evaluation Approaches, and Points to Consider Compared with Small Molecule Drugs Nucleic Acid Ther 33 83 94 10.1089/nat.2022.0054 36735616 PMC10066781 270. Black AJ Gamarra JR Giudice J 2019 More than a messenger: Alternative splicing as a therapeutic target Biochim. Biophys. Acta. Gene Regul. Mech 1862 194395 31271898 10.1016/j.bbagrm.2019.06.006 PMC6875611 Figure 1. RNA processing as a regulator of gene expression (A) Alternative splicing is an RNA processing mechanism wherein the inclusion or exclusion of alternative regions results in different processed RNA transcripts. Constitutive splicing refers to the general inclusion of exons and splicing out of introns during RNA processing (left). The most common types of alternative splicing events are as follows: (1) cassette exons that can be either included or skipped, (2) intronic regions that instead of being spliced out are retained completely or partially, (3) alternative usage of 3 ′ ′ (B) Alternative polyadenylation is an RNA processing mechanism that generates RNA transcript diversity by using different polyadenylation sites (PASs) where mRNA cleavage and attachment of the poly(A) tail occur. PASs that are sometimes found within introns are known as intronic PASs. When an intronic PAS is upstream of a stop codon, both the coding sequence and the 3 ′ ′ ′ Figure 2. Players involved in each step of cellular mechanotransduction Mechanical forces can be intercepted by a variety of mechanosensors and mechanotransducers (green). Piezo channels and two-pore domain potassium (K2P) channels (such as TREK-1) are ion channels that are activated by mechanical force. When activated, Piezo channels allow for calcium ions (Ca 2+ + Figure 3. Mechanical forces influence the activity of RBPs (A) In healthy cardiomyocytes, HNRNPC localizes to the nucleus where it promotes skipping of YAP1 exon 4 (left). During heart failure, the ECM undergoes remodeling, and as a result, HNRNPC shuttles to the sarcomere, where it functions in local translation. Because there is less nuclear HNRNPC, YAP1 exon 4 inclusion is increased. When exon 4 is included, YAP1 readily activates TEAD transcription factors, which drive the transcription of Hippo pathway targets (right). This illustration is based on work published in Martino et al. 66 (B) The transcription factor TEAD4 is alternatively spliced at exon 3. When exon 3 is included, the full-length TEAD4 (TEAD4-FL) is produced. TEAD4-FL contains the DNA-binding domain and YAP1-interacting motif. TEAD4-FL can bind YAP1 and drive transcription of Hippo-YAP1 targets. In cancer, the inclusion of TEAD4 exon 3 is associated with tumor cell proliferation and metastasis (bottom left). The RBP RBM4 binds a CGGCCGG motif within TEAD4 exon 3 and induces its skipping, which results in the production of a short TEAD4 protein isoform (TEAD4-S). Since exon 3 encodes the DNA-binding domain of TEAD4, TEAD4-S protein does not have a DNA-binding domain but retains the YAP1-interacting motif. Thus, TEAD4-S isoforms compete with TEAD4-FL for YAP1 binding. When YAP1 binds TEAD4-S, transcription is not activated, and there is an attenuation of transcription of Hippo-YAP1 targets. As a result, cancer cells expressing high levels of RBM4 exhibit reduced cell proliferation, migration, and apoptosis, and consequently, patients with higher levels of RBM4 have improved chances of cancer survival (right). This illustration is based on results published in Qi et al. 69 (C) RBFOX1 is upregulated during postnatal heart development and is downregulated in pathological cardiac hypertrophy. Mice overexpressing RBFOX1 present reduced progression of pathological cardiac hypertrophy due to RBFOX1 regulation of alternative splicing. This illustration is based on findings from Gao et al. 70 (D) RBFOX1 regulates alternative splicing of the pre-mRNAs of two focal adhesion proteins, paxillin (PXN) and vinculin (VCL). When RBFOX1 is depleted, Pxn exon 6 and Vcl exon 19 are skipped, generating PXN and VCL proteins (left), whereas when RBFOX1 is overexpressed, Pxn exon 6 and Vcl exon 19 are included via RBFOX1 binding to a (U)GGAUG motif in the intron downstream of these alternative exons. These alternative splicing events result in the production of extended PXN (ePXN) and metavinculin (MVCL) proteins (right). (E) In cultured H9C2 embryonic cardiomyocytes, the abundance of RBFOX1 regulates cellular morphology, gene expression, and actin cytoskeleton. When RBFOX1 is depleted (left), differentiated cardiomyocytes were more frequently mononuclear when compared to cells expressing endogenous RBFOX1, which became more often multinucleated after differentiation (middle). Moreover, differentiated RBFOX1-depleted cells exhibited reduced expression of myocyte differentiation markers such as myoblast determination protein 1 (MyoD) and cardiac troponin T (Tnnt2). MVcl and ePxn expression was also downregulated at the mRNA level in RBFOX1-depleted cardiomyocytes when compared to differentiating cells with normal RBFOX1 levels. RBFOX1 overexpressing cells (right) were overall more elongated, and VCL was increasingly localized to the plasma membrane (PM) when compared to wild-type cardiomyocytes (middle). Moreover, RBFOX1 overexpressing cells contained notably shortened actin filaments and actin rings when compared to wild-type. The illustrations in (D) and (E) are based on Zorn et al. 71 Figure 4. Alternative splicing and alternative polyadenylation networks can be mechanosensitive (A) Cultured C2C12 myoblasts and myotubes exhibited distinct alternative splicing changes in response to increasing time of equiaxial stretching. This schematic is based on findings published in Hinkle et al. 93 (B) Healthy human hearts and hearts with dilated cardiomyopathy exhibit differences in 3 ′ ′ ′ ′ ′ 248 (C) Mouse hearts that underwent transverse aortic constriction exhibited cardiac hypertrophy and differences in alternative polyadenylation compared to healthy hearts. The overall cardiac hypertrophy resulted in global 3 ′ 249 ",
  "metadata": {
    "Title of this paper": "More than a messenger: Alternative splicing as a therapeutic target",
    "Journal it was published in:": "Cell reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490864/"
  }
}