{
  "title": "Paper_334",
  "abstract": "pmc JCI Insight JCI Insight 3101 jciinsight JCI Insight JCI Insight 2379-3708 American Society for Clinical Investigation PMC12487691 PMC12487691.1 12487691 12487691 40694429 10.1172/jci.insight.190311 190311 1 Research Article Coagulation proteases modulate nucleic acid uptake and cGAS-STING-IFN induction in the tumor microenvironment Wilgenbus Petra wilgenbu@uni-mainz.de 1 Pott Jennifer jennpott@uni-mainz.de 1 Pagel Sven sven.pagel@unimedizin-mainz.de 1 Witzler Claudius c.witzler@uni-mainz.de 1 Royce Jennifer jroyce3825@gmail.com 2 https://orcid.org/0000-0003-3252-7758 Marini Federico marinif@uni-mainz.de 3 4 5 Reyda Sabine reyda@uni-mainz.de 1 Madhusudhan Thati m.thati@uni-mainz.de 1 Kindler Thomas Thomas.Kindler@unimedizin-mainz.de 6 7 8 Hausen Anne Anne.Hausen@unimedizin-mainz.de 9 Gaida Matthias M. Matthias.Gaida@unimedizin-mainz.de 4 8 9 Weiler Hartmut HWeiler@Versiti.org 10 https://orcid.org/0000-0002-6064-2166 Ruf Wolfram ruf@uni-mainz.de 1 2 4 5 Graf Claudine grafc@uni-mainz.de 1 4 5 1 2 3 4 5 6 7 8 9 10 Address correspondence to: Claudine Graf or Wolfram Ruf, University Medical Center Mainz, Center for Thrombosis and Hemostasis (CTH), Langenbeckstraße 1, 55131 Mainz, Germany. Phone: 49.6131.17.8014; Email: grafc@uni-mainz.de ruf@uni-mainz.de 22 7 2025 9 9 2025 10 17 498102 e190311 16 12 2024 16 7 2025 22 07 2025 02 10 2025 02 10 2025 © 2025 Wilgenbus et al. 2025 Wilgenbus et al. https://creativecommons.org/licenses/by/4.0/ This work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ This article is available online at https://insight.jci.org/articles/view/190311 Malignancies increase the risk for thrombosis and metastasis dependent on complex interactions of innate immune cells, platelets, and the coagulation system. Immunosuppressive functions of platelets and macrophage-derived coagulation factors in the tumor microenvironment (TME) drive tumor growth. Here, we show that patients with malignancies and tumor-bearing mice have increased levels of coagulation factor (F) X–expressing circulating monocytes engaged in platelet aggregate formation. This interaction and resulting thrombin generation on platelets interferes with monocyte differentiation and antigen uptake of antigen-presenting cells (APCs). Myeloid cell–specific deletion of FX or abrogated FXa signaling via protease activated receptor 2 (PAR2) averts the suppressive activity of platelets on tumor cell debris uptake and promotes the immune stimulatory activity of APCs in the TME. Myeloid cell FXa-PAR2 signaling deficiency specifically enhances activation of the cGAS-STING-IFN-I pathway with a resulting expansion of antigen experienced progenitor exhausted CD8 + +  Targetable FXa-PAR2 signaling promoting monocyte-platelet aggregate formation subverts tumor DNA stimulation of the cGAS-STING-IFN pathway required for T cell priming and efficient checkpoint inhibitor therapy. Immunology Oncology Vascular biology Cancer immunotherapy Coagulation Platelets Deutsche Forschungsgemeinschaft https://doi.org/10.13039/501100001659 Project-ID 318346496 DFG SFB 1292 TP10,TP02,TP19,TP22,TPQ1 Bundesministerium für Bildung und Forschung https://doi.org/10.13039/501100002347 BMBF 01EO1003 01EO1503 National Heart, Lung, and Blood Institute https://doi.org/10.13039/100000050 HL60742 Deutsches Krebsforschungszentrum https://doi.org/10.13039/100008658 HITR-2021-10 Alexander von Humboldt-Stiftung https://doi.org/10.13039/100005156 AvH Ruf pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Malignancies remain a major cause of age-related mortality and are frequently associated with thrombosis due to a hyperactivated coagulation system. While obstruction of large peripheral veins and vessels in lungs is the major clinical manifestation of cancer associated thrombosis (CAT), microthrombi within tumors can impair tissue penetrance of drugs and thereby efficacy of systemic anticancer therapies ( 1 2 4 4 8 9 11 12 14 15 16 17 17 19 Indeed, tumors have been coined ‘wounds that do not heal’ ( 20 21 22 23 24 23 23 23 25 23 25 TAMs typically form the most prevalent immune cell population within the TME and are highly heterogenous. TAMs are major drivers of intratumoral coagulation activation and the major extrahepatic cellular synthesis source for coagulation proteases. TAMs express key components of coagulation signaling complexes, including FVII, FX, and their cognate receptors, tissue factor (TF), endothelial protein C receptor (EPCR), and protease activated receptor (PAR) 2 ( 26 + 26 Moreover, recent studies support the translational relevance of these findings ( 10 23 26 27 23 26 10 27 F10 2 In this study, we systematically probe the interplay of monocyte/macrophage–derived FXa and platelet bound (pro)thrombin in suppressing antitumor responses by antigen presenting cells (APCs). These experiments uncover crucial roles of platelet-dependent thrombin generation, myeloid cell–derived FXa and FXa-PAR2 signaling in monocyte-platelet aggregate formation, propagating monocyte differentiation into functionally impaired APCs. Those compromised APCs show reduced antigen uptake, cGAS-STING-IFN induction, and, in consequence, less capacity in fostering the expansion of antigen-experienced progenitor exhausted CD8 + + Results FXa-PAR2 signaling modulates nucleic acid uptake and cGAS-STING-IFN-I induction in vivo. Myeloid cell autonomous FXa-PAR2 signaling mediates immunosuppression in several spontaneous and transplanted tumor models ( 26 G37I WT 26 G37I WT Figure 1A WT G37I Figure 1B 28 30 Figure 1C Supplemental Figure 1A https://doi.org/10.1172/jci.insight.190311DS1 F10 F7 , Figure 1C Supplemental Figure 1B Besides phenotypic macrophage markers ( Figure 1, C and D Fabp5 Txn1 Lgals3 Prdx5 31 hi 32 Figure 1, C and D 33 Mrc1 Cd209a 34 F10, G37I Lilrb4a Il10 Thbs1 Nrros Lrrc32 Tgfbr1 Fn1 35 36 38 Cluster 1 and 6 cells, which were expanded in PyMT-PAR2 WT Figure 1D 31 32 Pf4 H1 reg 39 WT Vegfa Thbs1 Tgfb1 Tgfbr1, Lilrb4a, 40 41 Mrc1, Il10 G37I Havcr2 Vsir Lag3 Cd274 Timd4 Figure 1E 42 Cluster 17 cells expressed transcripts ( Figure 1D 33 43 44 Hspa4l Lyar Ddx20 Acrbp G37I WT Figure 1E 45 + 46 47 Mb21d1 G37I Klra17 48 Ly6a 49 Rsad2, Tnfrsf9 50 51 Figure 1E G37I Ifi208 52 Mid1 53 Ifif208 Mid1 G37I WT Figure 1E Supplemental Figure 1C Expression of transcription factors ( Zbtb46 Fcgr1 Batf3 54 Itgae G37I Figure 1, C and E Ifnb1 Cxcl9 Interestingly, impaired FXa-PAR2 signaling also affected the phenotype of contaminating Cd44/Epcam + G37I Supplemental Figure 1D 55 26 Myeloid cell FX deficiency and abrogated FXa-PAR2 signaling cause similar quantitative shifts in myeloid subpopulations in the TME. Myeloid cell FX deficiency phenocopies the reduced tumor growth seen in FXa-PAR2 signaling–defective mice ( 26 fl/fl fl/fl Fcgr1 Procr Supplemental Figure 2A Figure 2A G37I WT Supplemental Figure 2B fl/fl + Figure 2A Mertk/Fcgr1 F10 G37I WT lo/– – – + Figure 2B Supplemental Figure 2B fl/fl Figure 2B + fl/fl Btla G37I WT Figure 2C Itgae G37I WT fl/fl + Figure 2D Myeloid cell–expressed FXa is crucial for nucleic acid uptake by antigen presenting cells. We next asked whether the suggested improved uptake of tumor cell debris and activation of the cGAS-STING-IFN-I pathway in vivo resulted from the loss of cell intrinsic FXa-PAR2 signaling. Therefore, we differentiated BM monocytes from F10 fl/fl G37I Supplemental Figure 3A + + 56 Figure 3A Figure 3B Figure 3C fl/fl fl/fl Figure 1E Mb21d1 Sting1 Ifnb1 Figure 3D Induction of the cGAS-STING-IFN-I pathway stimulates antitumor immune responses in vivo ( 46 47 Supplemental Figure 3B G37I fl/fl Figure 3E Il12p40 Figure 3F fl/fl G37I Itgae Figure 3F + fl/fl Figure 2D Itgae G37I Figure 1B Myeloid cell–derived FXa recruits immune suppressive platelets. Macrophage FX is typically activated by coagulation factor VIIa (FVIIa) in complex with TF. FXa, in turn, binds to activated factor V (FVa) as part of the prothrombinase complex, which subsequently catalyzes the conversion of prothrombin (FII) to thrombin (FIIa) ( Figure 4A Supplemental Figure 3 Supplemental Figure 4A 26 Figure 4B 57 F2 Supplemental Figure 4 Supplemental Figure 4C fl/fl G37I Supplemental Figure 4C 23 Supplemental Figure 4D Platelet-derived TGFβ has been demonstrated to be the dominant source of functional TGFβ systemically and in the TME and to be bound to the platelet TGFβ docking receptor GARP ( 24 Figure 4C Figure 4D Figure 4C Figure 4E 58 Supplemental Figure 4E Supplemental Figure 5A We next asked whether aggregate formation with platelets could alter the phenotypes of in vitro–differentiated DCs and macrophages. Macrophage differentiation in the presence of platelets, thrombin, or active TGFβ significantly reduced the uptake of EdU + Figure 4F Mb21d1 Figure 4G Figure 4H Itgae Cd103 Figure 4I Activated platelets also form aggregates with circulating monocytes. We next asked whether the association of platelets with monocytes was dependent on monocyte synthesized FX. We isolated monocytes from the BM of F10 fl/fl fl/fl WT G37I Figure 4J Figure 4K + G37I Figure 4L fl/fl G37I Figure 4K FX regulates monocyte-platelet aggregate formation during tumor progression. To investigate the relevance of the platelet aggregate supporting role of monocyte-derived FX and FXa-PAR2 signaling in tumor progression, we measured the abundance of FX-expressing monocytes in the peripheral blood of tumor-bearing WT mice. The frequency of FX + Supplemental Figure 5B + Supplemental Figure 5B Figure 4K Figure 5A + + + Figure 5B 59 + Figure 5, A and C We next studied monocyte-platelet aggregates in mice with subcutaneously implanted PyMT breast cancer cells. In line with spontaneously developing breast cancer ( 26 Figure 5D fl/fl fl/fl WT G37I + Figure 5E + Figure 5F Increased circulating monocyte-platelet aggregates were also detected in human patients with lung cancer. In this explorative study, the patients with untreated disease at primary diagnosis or with progressive disease showed the highest abundance of FX + Figure 5G + Figure 5H Figure 5I + Progenitor exhausted CD8 + cGAS-STING–induced IFN-I increases the expression of the transcription factor TCF1, and, in consequence, the activity of stem-like CD8 + 60 61 + G37I WT G37I WT Figure 6A Cells from these clusters expressed TCRβ chain ( Trbc2) Cd8a Figure 6B Figure 6, C and D 61 Ifnar1 Ifnar2 Tnfrsf9 62 63 Satb1 Cd28 Figure 6D WT Ccl5, Figure 6E G37I Satb1 Lef1 Bcl6 Ccr7 61 Gzmb Ccl5 61 WT Figure 6E Tbx21 Tnf, Tcf7 G37I 63 Figure 6F Figure 6G fl/fl fl/fl + pex tex + Activation of the cGAS-STING-IFN pathway in the APCs from the TME of PyMT-PAR2 G37I + G37I WT Figure 7A Ifi208 Mid1 G37I WT Figure 7, A and B 64 65 FXa inhibition synergizes with immune checkpoint blockade to expand progenitor-exhausted CD8 + As demonstrated above, loss of myeloid FX expression or FXa-PAR2 signaling improved tumor debris uptake and APC function by induction of the cGAS-STING-IFN-I axis ( Figure 1E Figure 3 Figure 5C 10 26 + Figure 8A Figure 8B Figure 8C To elucidate the synergistic mechanism, we analyzed tumor draining lymph nodes and the TME for the abundance of CD103 + + + + Figure 8D Figure 8E pex tex + + + + Figure 8F + pex tex + Figure 8F We next addressed the question of whether rivaroxaban treatment also synergized with the checkpoint inhibitor αCTLA. In contrast to αPD-L1, which predominantly reverses the suppression of effector T cells, αCTLA mainly acts on the priming phase of T cells in the lymph nodes. We injected WT mice with T241 tumor cells and randomized the mice to mono or combination therapy of αPD-L1 or αCTLA with rivaroxaban ( Figure 8G Figure 8H Figure 8I + + Figure 8J Figure 8K + + pex Figure 7L + + tex Figure 8, J–L Discussion Cancer is a systemic disease with a complex interplay between a diversity of cell types and imposes inflammatory conditions associated with the activation of the coagulation system. At the cellular level, the interactions of platelets with immune and tumor cells are key players, and activation of platelets in malignancy occurs by various stimuli, including podoplanin and thrombin, which facilitate tumor cell metastasis as consequence of tumor cell–platelet aggregate formation ( 66 67 66 68 Here, we show that the formation of monocyte-platelet aggregates in the TME as well as in the circulating blood is remarkably dependent on monocyte FX expression as well as cell autonomous FXa-PAR2 signaling. In addition, circulating tumor educated platelets show higher expression of GARP and TGFβ/LAP in mice and humans, as demonstrated here and elsewhere ( 69 Myeloid cell–autonomous FXa-PAR2 signaling also promotes platelet recruitment and mediates immunosuppressive alterations in the TME by influencing the phenotype of monocyte-derived DCs and macrophages. For effective antitumor immune responses, the induction of the cGAS-STING-IFN-I pathway that is driven by the uptake of tumor-derived nucleic acids plays a major role ( 46 47 + + 60 64 65 70 71 NCT03172936 NCT05846659 NCT05846646 NCT05070247 We show that the presence of platelets, myeloid cell–derived FXa, and thrombin reduces the uptake of tumor cell–derived nucleic acids, while lack of myeloid cell FX expression or FXa-PAR2 signaling conversely increases cGAS-STING-IFN-I induction in vitro and in vivo. These coagulation pathways thus interfere with the priming capacities of DCs and reduce the TME abundance of progenitor-exhausted CD8 + + The presented data define mechanistic details of coagulation signaling–mediated immunosuppression and identify a convergent function of FXa and thrombin as crucial modulators of APC function in the TME. In consequence, the pharmacological suppression of these immune evasive mechanisms by tissue penetrant oral anticoagulants increases the T cell priming capacity of APCs and the accumulation of progenitor exhausted CD8 + 61 8 72 Although we demonstrate that anticoagulants such as the direct FXa inhibitor rivaroxaban improves APC function and the priming of T cell responses leading to attenuated tumor growth, we do not know whether these beneficial effects are generally applicable to human cancers with variable immunogenic profiles and whether synergistic effects will be seen also with other treatment combinations, including chemotherapy or radiation, which cause cell death and release of nucleic acids as part of their immunostimulatory activity. Prospective clinical trials with oral anticoagulants, as (neo)adjuvant therapies will need to control such pretreatments and drug interactions, comorbidities, and anatomical location of tumors that may predispose to unwanted bleeding. In addition, biomarker profiles such as FX + Methods Sex as a biological variable. As only female mice can be used in the spontaneous breast cancer model PyMT, we used only female mice for the transplantable tumor models MC38, T241, and PyMT, to make data comparable. For in vitro differentiation assays, male as well as female mice were used as bone marrow donors. Experiments were sex and age matched. Study design. Adult mice of similar age (10 to 12 weeks) and same sex from the same breeding colony were used. Comparisons of PyMT tumor development involved cohorts in the same animal facility to avoid environmental variability. Tumor cell suspensions of transplantable tumors were randomly injected into different lines that originated from littermate founders or were cre-deleter strains of floxed alleles and littermate controls without cre-recombinase. Effects of host genetic mutations were independently confirmed in repeat experiments or different tumor models, and pooled data were analyzed. For treatment experiments, groups were randomized by cage, assuring equal tumor volume at the beginning of treatment. Treatment and tumor monitoring were performed by the same investigators, but analysis of flow cytometry data was performed without knowledge of the treatment groups. Flow cytometry comparisons were based on biological replicates stained with the same fluorophore combinations and compensations analyzed on the same flow cytometer. Expression profiles were obtained from biological replicates randomly analyzed by quantitative polymerase chain reaction (RT-PCR) in parallel; technical failures were eliminated from the analysis. Animal models and tumor models. We used C57BL/6N ( C57BL6/NCrl fl/fl B6(Cg)-F10 tm1c(EUCOMM)/Hmgu fl/fl B6(Cg)-F10 tm1c(EUCOMM)/Hmgu tm1(cre)Ifo WT C57BL/6(Cg) G37I B6(Cg)-F2rl1 tm2.1Wmrf G37I B6(Cg)-Tg (MMTV–PyVT)634Mul/LeIIJ tm2.1Wmrf WT B6(Cg)-Tg (MMTV–PyVT)634Mul/LeIIJ fl/fl B6(Cg)-Tg (MMTV–PyVT)634Mul/LeIIJ tm1c (EUCOMM)/Hmgu tm1(cre)Ifo flfl B6(Cg)-Tg (MMTV–PyVT)634Mul/LeIIJ tm1c (EUCOMM)/Hmgu 73 4 Tumor scoring was performed as previously published ( 26 Supplemental Table 1 Flow cytometry. Cells directly isolated from mouse tissues or from culture plates were incubated with Fc-block (αCD16/32) in PBS/0.5% BSA for 15 min at 4°C before staining. Cells were washed once. For surface epitopes, cells were stained for 20 min at 4°C with the antibody cocktail, as indicated in the respective experiment. For intracellular epitopes, cells were fixed and permeabilized using the Foxp3 / Transcription Factor Staining Buffer Set (eBioscience). The intracellular antibodies were diluted in the permeabilization buffer. Cells were analyzed on an Attune NxT (Thermo Fisher) and data were analyzed with FlowJo10.8.1. Antibodies were purchased from eBioscience, BD or biolegend ( Supplemental Table 1 scRNA-seq of TAMs and tumor infiltrating lymphocytes. CD11c bead selected cells from late-stage tumors or CD4/CD8 bead selected cells from mid-size tumors were frozen in 90% FCS/10% dimethyl sulfoxide and thawed cell suspensions were processed for single cell sequencing on the 10x Genomics platform as described ( 26 26 74 Immunohistochemistry. PFA fixed human pancreatic cancer samples were stained with αCD45, αCD68, and αFX ( Supplemental Table 1 + + + Western blotting. Cells were lysed with RIPA lysis buffer and sample concentration adjusted to the desired value. After addition of Laemmli buffer with β-mercaptoethanol, samples were run on a 4%–20% Mini Protean TGX gel (Cat# 45611094). The proteins were transferred to a 0.2 μm PVDF membrane (Cat#1704156) with the Trans Blot Turbo System from BioRad. Membranes were blocked with milk powder TBST and incubated over night with anti-mouse prothrombin (abcam AB208590 In vitro differentiation of moDCs and macrophages. Monocytes were isolated from bone marrow using the EasySep monocyte isolation kit (Stem cell) according to manufacturer instructions. Monocytes were plated (2x10 5 E2 Real-time PCR. Total RNA was extracted with Trizol, and cDNA was synthesized from 100 ng of total RNA with LunaScript RT SuperMix (New England Biolabs). Relative expression levels were determined by RT-PCR on a BioRad Real-Time System (CFX Connect Real-Time System; CFX96 Real-Time System) using Luna Universal qPCR Master Mix (New England Biolabs). Primer sequences are listed in Supplemental Table 2 Isolation of platelets. Citrated blood was taken from healthy or tumor bearing mice. Platelets were separated as published ( 75 Active TGFβ levels in cell culture supernatant. Cell culture supernatant from in vitro generated macrophages was collected at day 5 after macrophages were either or not exposed to platelets in a ratio of 1:10 in prothrombin supplemented medium. TGFβ levels were determined with the TGF beta1 mouse ELISA (enzyme linked immunosorbent assay) Kit (Abcam, cat#ab119557). Cytokine release by platelets. Platelets (9x10 6 Thrombin generation. In vitro generated macrophages or DCs (2x10 5 6 Uptake of EdU labeled tumor debris. MC38 was cultured in RPMI/10%FCS until 50% confluency. EdU labeling was performed using the Click-iT Plus EdU Alexa Fluor 594 Flow Cytometry Kit as published (Invitrogen) ( 56 6 g cGAMP ELISA. For quantification of intracellular cGAMP in macrophages, BM monocytes were seeded at 3.5 x 10 5 6 Statistics. Statistical analyses were performed with GraphPad Prism 10 or R statistical software ( 74 P t Study approval. All animal experiments had approved protocols at Scripps Research (IACUC 09-0111) or University Medical Center Mainz (Landesuntersuchungsamt Koblenz, AZ 23 177-07/G14-1-041; AZ 23 177-07G20-1-081). PBMC samples from healthy donors and lung cancer patients were collected from citrated blood by FICOLL after informed consent (Landesärztekammer Rheinland-Pfalz, ethical approval 2020-15203). Data availability. Single cell sequencing data are available through the NCBI Gene Expressing Omnibus (accession number, GSE214518 Processed scRNA-seq data (in the RDS binary format) are available under https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE214518 74 74 http://shiny.imbei.uni-mainz.de:3838/iSEE_PAR2_TILs/ http://shiny.imbei.uni-mainz.de:3838/iSEE_PAR2_TAMs/, https://github.com/federicomarini/PAR2_TAMs_TILs/blob/main/shinyserver_config/iSEE_PAR2_TAMs/app.R https://github.com/federicomarini/PAR2_TAMs_TILs Supporting Data Values Author contributions PW design and execution of experiments; JP, SP, JR, CW, AH, and MMG execution of experiments; FM and SP, bioinformatics; SR, generation of mouse strains; HW, single cell transcriptomics; TK, collection of patient samples; TM, reviewed and edited the manuscript; CG, study conception, design and execution of the experiments, data analysis and interpretation, preparation of figures, and writing of the manuscript; WR, study conception, design and supervision, data analysis and interpretation, and writing of the manuscript. Supplementary Material Supplemental data Unedited blot and gel images Supporting data values Funding: This study was supported by grants from the National Institutes of Health (NHLBI, HL60742), the Alexander von Humboldt Foundation of Germany (Humboldt Professorship Ruf), the Federal Ministry of Education and Research Germany (BMBF 01EO1003 and 01EO1503), the German Research Foundation (Project-ID 318346496; DFG SFB 1292 TP10, TP02, TP19, TP22, TPQ1) and HI-TRON (HITR-2021-10). This work is the result of NIH funding, in whole or in part, and is subject to the NIH Public Access Policy. Through acceptance of this federal funding, the NIH has been given a right to make the work publicly available in PubMed Central. Conflict of interest: Copyright: Reference information: JCI Insight 1 Choi JU et al Anticoagulation therapy promotes the tumor immune-microenvironment and potentiates the efficacy of immunotherapy by alleviating hypoxia J Immunother Cancer 2021 9 8 e2021 10.1136/jitc-2021-002332 34341129 PMC8330593 2 Wu C et al Reactive myelopoiesis and FX-expressing macrophages triggered by chemotherapy promote cancer lung metastasis JCI Insight 2023 8 9 e167499 10.1172/jci.insight.167499 36976637 PMC10243818 3 Grover SP et al Cancer therapy-associated thrombosis Arterioscler Thromb Vasc Biol 2021 41 4 1291 1305 10.1161/ATVBAHA.120.314378 33567864 PMC7990713 4 Moik F Ay C Venous and arterial thromboembolism in patients with cancer treated with targeted anti-cancer therapies Thromb Res 2022 213 Suppl 1 S58 S65 10.1016/j.thromres.2022.01.004 36210562 5 Levi M Sivapalaratnam S An overview of thrombotic complications of old and new anticancer drugs Thromb Res 2020 191 Suppl 1 S17 S21 10.1016/S0049-3848(20)30391-1 32736772 6 Wang T-F Carrier M Immune checkpoint inhibitors-associated thrombosis: incidence, risk factors and management Curr Oncol 2023 30 3 3032 3046 10.3390/curroncol30030230 36975443 PMC10047296 7 Wang TF et al Thrombotic complications associated with immune checkpoint inhibitors Cancers (Basel) 2021 13 18 e13184606 10.3390/cancers13184594 34572833 PMC8469452 8 Sussman TA et al Incidence of thromboembolism in patients with melanoma on immune checkpoint inhibitor therapy and its adverse association with survival J Immunother Cancer 2021 9 1 e2020 10.1136/jitc-2020-001719 33436486 PMC7805375 9 Assi HA et al Development of thrombocytopenia is associated with improved survival in patients treated with immunotherapy Future Sci OA 2020 6 7 FSO581 10.2144/fsoa-2020-0021 32802390 PMC7421541 10 Haist M et al Anticoagulation with factor Xa inhibitors is associated with improved overall response and progression-free survival in patients with metastatic malignant melanoma receiving immune checkpoint inhibitors-a retrospective, real-world cohort study Cancers (Basel) 2021 13 20 e13205103 10.3390/cancers13205103 34680252 PMC8534137 11 Kött J et al Improved survival of advanced melanoma patients receiving immunotherapy with concomitant antithrombotic therapy - a multicenter study on 2419 patients from the prospective skin cancer registry ADOReg Eur J Cancer 2025 214 115159 10.1016/j.ejca.2024.115159 39642845 12 Swanton C et al Embracing cancer complexity: hallmarks of systemic disease Cell 2024 187 7 1589 1616 10.1016/j.cell.2024.02.009 38552609 PMC12077170 13 Palumbo JS Crosstalk between hemostasis and immunity in cancer pathogenesis Thromb Res 2022 213 Suppl 1 S3 S7 10.1016/j.thromres.2021.12.013 36210558 14 Cantrell R Palumbo JS The thrombin-inflammation axis in cancer progression Thromb Res 2020 191 Suppl 1 S117 S122 10.1016/S0049-3848(20)30408-4 32736768 15 Scheuerer B et al The CXC-chemokine platelet factor 4 promotes monocyte survival and induces monocyte differentiation into macrophages Blood 2000 95 4 1158 1166 10.1182/blood.V95.4.1158.004k31_1158_1166 10666185 16 Xia CQ Kao KJ Effect of CXC chemokine platelet factor 4 on differentiation and function of monocyte-derived dendritic cells Int Immunol 2003 15 8 1007 1015 10.1093/intimm/dxg100 12882838 17 Kral JB et al Platelet interaction with innate immune cells Transfus Med Hemother 2016 43 2 78 88 10.1159/000444807 27226790 PMC4872052 18 Singh MV et al Monocytes complexed to platelets differentiate into functionally deficient dendritic cells J Leukoc Biol 2021 109 4 807 820 10.1002/JLB.3A0620-460RR 32663904 PMC7854860 19 Li Y et al Effects of the interactions between platelets with other cells in tumor growth and progression Front Immunol 2023 14 1165989 10.3389/fimmu.2023.1165989 37153586 PMC10158495 20 Schäfer M Werner S Cancer as an overhealing wound: an old hypothesis revisited Nat Rev Mol Cell Biol 2008 9 8 628 638 10.1038/nrm2455 18628784 21 Dvorak HF Tumors: wounds that do not heal. Similarities between tumor stroma generation and wound healing N Engl J Med 1986 315 26 1650 1659 10.1056/NEJM198612253152606 3537791 22 Goswami S et al Myeloid cell-targeted therapies for solid tumours Nat Rev Immunol 2023 23 2 106 120 10.1038/s41577-022-00737-w 35697799 23 Metelli A et al Thrombin contributes to cancer immune evasion via proteolysis of platelet-bound GARP to activate LTGF-β Sci Transl Med 2020 12 525 eaay4860 10.1126/scitranslmed.aay4860 31915300 PMC7814995 24 Rachidi S et al Platelets subvert T cell immunity against cancer via GARP-TGFβ axis Sci Immunol 2017 2 11 eaai7911 10.1126/sciimmunol.aai7911 28763790 PMC5539882 25 Lutz MS et al Platelets subvert antitumor efficacy of T cell-recruiting bispecific antibodies J Immunother Cancer 2022 10 2 e2021 10.1136/jitc-2021-003655 35110356 PMC8811601 26 Graf C et al Myeloid cell-synthesized coagulation factor X dampens antitumor immunity Sci Immunol 2019 4 39 eaaw8405 10.1126/sciimmunol.aaw8405 31541031 PMC6830514 27 Calì B et al Coagulation factor X promotes resistance to androgen-deprivation therapy in prostate cancer Cancer Cell 2024 42 10 1676 1692 10.1016/j.ccell.2024.08.018 39303726 28 Hashimoto D et al Dendritic cell and macrophage heterogeneity in vivo Immunity 2011 35 3 323 335 10.1016/j.immuni.2011.09.007 21943488 PMC4520532 29 Jakubzick C et al Lymph-migrating, tissue-derived dendritic cells are minor constituents within steady-state lymph nodes J Exp Med 2008 205 12 2839 2850 10.1084/jem.20081430 18981237 PMC2585843 30 Brown CC et al Transcriptional basis of mouse and human dendritic cell heterogeneity Cell 2019 179 4 846 863 10.1016/j.cell.2019.09.035 31668803 PMC6838684 31 Ibrahim AM et al Diverse macrophage populations contribute to the inflammatory microenvironment in premalignant lesions during localized invasion Front Oncol 2020 10 569985 10.3389/fonc.2020.569985 33072601 PMC7541939 32 Cochain C et al Single-cell RNA-seq reveals the transcriptional landscape and heterogeneity of aortic macrophages in murine atherosclerosis Circ Res 2018 122 12 1661 1674 10.1161/CIRCRESAHA.117.312509 29545365 33 Sanin DE et al A common framework of monocyte-derived macrophage activation Sci Immunol 2022 7 70 eabl7482 10.1126/sciimmunol.abl7482 35427180 PMC12362712 34 Cheong C et al Microbial stimulation fully differentiates monocytes to DC-SIGN/CD209(+) dendritic cells for immune T cell areas Cell 2010 143 3 416 429 10.1016/j.cell.2010.09.039 21029863 PMC3150728 35 Paavola KJ et al The fibronectin-ILT3 interaction functions as a stromal checkpoint that suppresses myeloid cells Cancer Immunol Res 2021 9 11 1283 1297 10.1158/2326-6066.CIR-21-0240 34426457 PMC9414285 36 Doyen V et al Thrombospondin 1 is an autocrine negative regulator of human dendritic cell activation J Exp Med 2003 198 8 1277 1283 10.1084/jem.20030705 14568985 PMC2194231 37 Zhao Y et al Thrombospondin-1 triggers macrophage IL-10 production and promotes resolution of experimental lung injury Mucosal Immunol 2014 7 2 440 448 10.1038/mi.2013.63 24045574 PMC3945733 38 Jiang A et al Loss of LRRC33-dependent TGFβ1 activation enhances antitumor immunity and checkpoint blockade therapy Cancer Immunol Res 2022 10 4 453 467 10.1158/2326-6066.CIR-21-0593 35181792 PMC9052945 39 Kuratani A et al Platelet factor 4-induced T H reg Science 2024 386 6724 eadn8608 10.1126/science.adn8608 39571033 40 Saban DR et al Thrombospondin-1 derived from APCs regulates their capacity for allosensitization J Immunol 2010 185 8 4691 4697 10.4049/jimmunol.1001133 20844200 PMC3090006 41 Batlle E Massagué J Transforming growth factor-β signaling in immunity and cancer Immunity 2019 50 4 924 940 10.1016/j.immuni.2019.03.024 30995507 PMC7507121 42 Caronni N et al TIM4 expression by dendritic cells mediates uptake of tumor-associated antigens and anti-tumor responses Nat Commun 2021 12 1 2237 10.1038/s41467-021-22535-z 33854047 PMC8046802 43 Cai Y et al Transcriptomic dynamics of breast cancer progression in the MMTV-PyMT mouse model BMC Genomics 2017 18 1 185 10.1186/s12864-017-3563-3 28212608 PMC5316186 44 Mac Keon S et al Syngeneic B16-F1 cells are more efficient than allogeneic Cloudman cells as antigen source in DC-based vaccination in the B16-F1 murine melanoma model Vaccine 2019 37 35 4947 4955 10.1016/j.vaccine.2019.07.018 31307876 PMC7713901 45 Mankan AK et al Cytosolic RNA:DNA hybrids activate the cGAS-STING axis EMBO J 2014 33 24 2937 2946 10.15252/embj.201488726 25425575 PMC4282641 46 Woo SR et al STING-dependent cytosolic DNA sensing mediates innate immune recognition of immunogenic tumors Immunity 2014 41 5 830 842 10.1016/j.immuni.2014.10.017 25517615 PMC4384884 47 Khoo LT Chen LY Role of the cGAS-STING pathway in cancer development and oncotherapeutic approaches EMBO Rep 2018 19 12 e201846935 10.15252/embr.201846935 30446584 PMC6280650 48 Rahim MM et al Ly49Q positively regulates type I IFN production by plasmacytoid dendritic cells in an immunoreceptor tyrosine-based inhibitory motif-dependent manner J Immunol 2013 190 8 3994 4004 10.4049/jimmunol.1200873 23479228 49 Khan KD et al Induction of the Ly-6A/E gene by interferon alpha/beta and gamma requires a DNA element to which a tyrosine-phosphorylated 91-kDa protein binds Proc Natl Acad Sci U S A 1993 90 14 6806 6810 10.1073/pnas.90.14.6806 7688129 PMC47021 50 Stoll A et al CD137 (4-1BB) stimulation leads to metabolic and functional reprogramming of human monocytes/macrophages enhancing their tumoricidal activity Leukemia 2021 35 12 3482 3496 10.1038/s41375-021-01287-1 34021248 PMC8632678 51 Kwajah MMS Schwarz H CD137 ligand signaling induces human monocyte to dendritic cell differentiation Eur J Immunol 2010 40 7 1938 1949 10.1002/eji.200940105 20432236 52 Cridland JA et al The mammalian PYHIN gene family: phylogeny, evolution and expression BMC Evol Biol 2012 12 140 10.1186/1471-2148-12-140 22871040 PMC3458909 53 Wang Y Erdr1 drives macrophage programming via dynamic interplay with YAP1 and Mid1 Immunohorizons 2024 8 2 198 213 10.4049/immunohorizons.2400004 38392560 PMC10916360 54 Briseño CG et al Distinct transcriptional programs control cross-priming in classical and monocyte-derived dendritic cells Cell Rep 2016 15 11 2462 2474 10.1016/j.celrep.2016.05.025 27264183 PMC4941620 55 Ionkina AA et al Transcriptome analysis of heterogeneity in mouse model of metastatic breast cancer Breast Cancer Res 2021 23 1 93 10.1186/s13058-021-01468-x 34579762 PMC8477508 56 Celias DP et al Detection of exogenous DNA uptake by murine dendritic cells STAR Protoc 2022 3 3 101464 10.1016/j.xpro.2022.101464 35719726 PMC9204794 57 Nourse J, et al. Non-invasive imaging of gene expression and protein secretion dynamics in living mice uncovers ectopic prothrombin expression as driver of thrombosis in cancer [preprint]. 10.1101/2021.07.08.451623 Posted on bioRxiv November 10, 2021 58 Chimen M et al Appropriation of GPIbα from platelet-derived extracellular vesicles supports monocyte recruitment in systemic inflammation Haematologica 2020 105 5 1248 1261 10.3324/haematol.2018.215145 31467123 PMC7193470 59 Flierl U et al The direct factor Xa inhibitor Rivaroxaban reduces platelet activation in congestive heart failure Pharmacol Res 2013 74 49 55 10.1016/j.phrs.2013.05.002 23714416 60 Li W et al cGAS-STING-mediated DNA sensing maintains CD8 + Sci Transl Med 2020 12 549 eaay9013 10.1126/scitranslmed.aay9013 32581136 61 Miller BC et al Subsets of exhausted CD8 + Nat Immunol 2019 20 3 326 336 10.1038/s41590-019-0312-6 30778252 PMC6673650 62 Ugolini A Nuti M CD137 + Cancers (Basel) 2021 13 3 e13030456 10.3390/cancers13030456 33530328 PMC7866028 63 Beltra JC et al Developmental relationships of four exhausted CD8 + Immunity 2020 52 5 825 841 10.1016/j.immuni.2020.04.014 32396847 PMC8360766 64 Boding L et al Midline 1 directs lytic granule exocytosis and cytotoxicity of mouse killer T cells Eur J Immunol 2014 44 10 3109 3118 10.1002/eji.201344388 25043946 65 Boding L et al Midline 1 controls polarization and migration of murine cytotoxic T cells Immun Inflamm Dis 2014 2 4 262 271 10.1002/iid3.44 25866633 PMC4386920 66 Strasenburg W et al Tumor cell-induced platelet aggregation as an emerging therapeutic target for cancer therapy Front Oncol 2022 12 909767 10.3389/fonc.2022.909767 35814405 PMC9259835 67 Takemoto A et al A critical role of platelet TGF-β release in podoplanin-mediated tumour invasion and metastasis Sci Rep 2017 7 1 42186 10.1038/srep42186 28176852 PMC5297242 68 Byzova TV Plow EF Networking in the hemostatic system. Integrin alphaiibbeta3 binds prothrombin and influences its activation J Biol Chem 1997 272 43 27183 27188 10.1074/jbc.272.43.27183 9341161 69 Zimmer N et al Platelet-derived GARP induces peripheral regulatory T cells-potential impact on T cell suppression in patients with melanoma-associated thrombocytosis Cancers (Basel) 2020 12 12 e12123653 10.3390/cancers12123653 33291452 PMC7762193 70 Padovan E et al IFN-alpha2a induces IP-10/CXCL10 and MIG/CXCL9 production in monocyte-derived dendritic cells and enhances their capacity to attract and stimulate CD8+ effector T cells J Leukoc Biol 2002 71 4 669 676 10.1189/jlb.71.4.669 11927654 71 Wang H et al cGAS is essential for the antitumor effect of immune checkpoint blockade Proc Natl Acad Sci U S A 2017 114 7 1637 1642 10.1073/pnas.1621363114 28137885 PMC5320994 72 Kewan T et al Prognostic impact and risk factors of cancer-associated thrombosis events in stage-IV cancer patients treated with immune checkpoint inhibitors Eur J Haematol 2021 106 5 682 688 10.1111/ejh.13598 33565130 73 Sugiura K Stock CC Studies in a tumor spectrum. I. Comparison of the action of methylbis (2-chloroethyl)amine and 3-bis(2-chloroethyl)aminomethyl-4-methoxymethyl -5-hydroxy-6-methylpyridine on the growth of a variety of mouse and rat tumors Cancer 1952 5 2 382 402 10.1002/1097-0142(195203)5:2&#x0003c;382::AID-CNCR2820050229&#x0003e;3.0.CO;2-3 14905426 74 Rue-Albrecht K et al iSEE: interactive summarizedexperiment explorer F1000Res 2018 7 741 10.12688/f1000research.14966.1 30002819 PMC6013759 75 Im JH Muschel RJ Protocol for murine/mouse platelets isolation and their reintroduction in vivo Bio Protoc 2017 7 4 e2132 10.21769/BioProtoc.2132 34458453 PMC8376615 Version 1 07/22/2025 In-Press Preview Version 2 09/09/2025 Electronic publication Figure 1 FXa-PAR2 signaling modulates macrophage phenotypes in the TME. ( A WT G37I n = B WT G37I n = t C D E n = P adj.loc Figure 2 Myeloid cell FX deficiency and abrogated FXa-PAR2 signaling cause similar quantitative shifts in myeloid subpopulations in the TME. ( A C WT G37I n = Supplemental Figure 1D fl/fl fl/fl n = t A Mertk Fcgr1 Mrc1 Procr B Itga4 + – + + lo/– – – + C Itgae + + + + + + + D + fl/fl fl/fl n = t P P P Figure 3 Myeloid cell derived FXa is crucial for nucleic acid uptake by antigen presenting cells and cGAS-STING-IFN-I induction. ( A WT fl/fl G37I fl/fl n = B F10 fl/fl fl/fl n = C fl/fl fl/fl D Mb21d1, Sting1, Ifnb1 WT fl/fl G37I fl/fl n = E WT G37I fl/fl fl/fl n = F Mb21d1, Sting1, Ifnb1, Itgae and Il12p40 G37I fl/fl fl/fl n = P P P P Figure 4 Myeloid cell–derived FXa recruits immune suppressive platelets. ( A B naive tumor fl/fl fl/fl C D C n = E n = F naïve tumor n = G Mb21d1 n = H n = t I Itgae n = J fl/fl fl WT G37I K L K + L n = P P P P Figure 5 Myeloid cell–expressed FX regulates monocyte-platelet aggregate formation during tumor progression. ( A C A n = n = n = B – + A C + n = n = D F fl/fl fl/fl WT G37I D n = t E + n = t fl/fl fl/fl F + fl/fl f/fll : n = WT G37I n = G + + + n = H + n = n = I + n = P P P P Figure 6 Progenitor exhausted CD8 + ( A WT G37I n = B Trbc2, Trac, Tcrg-C4, Cd8a, Cd4, Cd3e Ncr1, Klrb1c C + Pdcd1 Cd44 Tcf7 Ifnar2 Tnfrsf9 D + E + WT G37I n P loc.adj F G pex + – + + tex – + + + + F G fl/fl fl/fl n = t P P Figure 7 CD8 + ( A WT G37I n P adj B Ifnar2 Ifi208 Mid1 Figure 8 FXa inhibition improves priming function of APCs and synergizes with immune checkpoint blockade to expand progenitor and terminally exhausted CD8 + ( A B n = C n = D E + + D E F + reg + + pex + tex + n = G H n = I n = J K + + J K L + reg + + pex + tex + n = P P P P ",
  "metadata": {
    "Title of this paper": "Protocol for murine/mouse platelets isolation and their reintroduction in vivo",
    "Journal it was published in:": "JCI Insight",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487691/"
  }
}