{
  "title": "Paper_1014",
  "abstract": "pmc Andrology Andrology 379 blackwellopen ANDR Andrology 2047-2919 2047-2927 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12476218 PMC12476218.1 12476218 12476218 39587831 10.1111/andr.13814 ANDR13814 1 Original Article Original Article Therapeutic potential of hesperidin in diabetes mellitus‐induced erectile dysfunction through Nrf2‐mediated ferroptosis and oxidative stress XIN et al. Xin Sheng https://orcid.org/0009-0007-7733-3275  1  2 Song Wen  1  2 Mao Jiaquan  1  2 Hu Peng  1  2 Chen Zhong  1  2 Liu Jihong  1  2 Song Xiaodong  1  2 Fang Qian  3  4 fx96815@163.com Cui Kai https://orcid.org/0000-0001-8406-6549  1  2 kaicui1990@yeah.net   1 Department of Urology Tongji Hospital, Tongji Medical College, Huazhong University of Science & Technology Wuhan Hubei China   2 Institute of Urology Tongji Hospital, Tongji Medical College, Huazhong University of Science & Technology Wuhan Hubei China   3 Department of Anesthesiology Hubei Key Laboratory of Geriatric Anesthesia and Perioperative Brain Health Wuhan China   4 Wuhan Clinical Research Center for Geriatric Anesthesia Tongji Hospital, Tongji Medical College Huazhong University of Science and Technology Wuhan China * Correspondence fx96815@163.com kaicui1990@yeah.net 25 11 2024 10 2025 13 7 497679 10.1111/andr.v13.7 1702 1714 23 10 2024 07 5 2024 17 11 2024 27 09 2025 28 09 2025 28 09 2025 © 2024 The Author(s). Andrology Andrology Andrology https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ Abstract Background Among erectile dysfunction (ED) caused by metabolic abnormalities, diabetes mellitus‐induced ED (DMED) progresses rapidly, manifests with severe symptoms, and shows reduced responsiveness to conventional medications. Hyperglycemia in the corpus cavernosum has been linked to the induction of both ferroptosis and oxidative stress, which are mediated by nuclear factor E2 related factor 2 (Nrf2). Hesperidin (Hes), a flavonoid compound, has been revealed to activate Nrf2 in certain diabetic complications, yet the efficacy of Hes on DMED and the specific mechanism remain unclear. Objectives To elucidate the potential mechanism and efficacy of Hes in regulating Nrf2‐mediated ferroptosis and oxidative stress in DMED. Materials and methods DMED rats were constructed through the intraperitoneal injection of streptozotocin (STZ), partially supplemented with Hes. In parallel, in vitro research utilized human umbilical vein endothelial cells (HUVECs), with glucose addition to simulating a high glucose (HG) environment, and induced with Hes or ML385 (an Nrf2 inhibitor). Penile tissues and HUVECs were harvested for subsequent analyses. Results The results of this study indicate that Hes partially reversed the impaired erectile function. The expression of Nrf2, glutathione peroxidase 4 (GPX4), and heme oxygenase‐1 (HO‐1) in the corpus cavernosum elevated after supplementing with Hes, resulted in an inhibition in ferroptosis and oxidative stress. Moreover, the quantity and function of erectile effector cells were restored, and cavernous fibrosis was ameliorated. In HG‐induced HUVECs, Hes ameliorated Nrf2‐mediated ferroptosis and oxidative stress, effects which ML385 partially reversed. Conclusions Hes exerts a therapeutic effect on DMED rats and a regulatory mechanism on the Nrf2–HO‐1/GPX4 axis, concurrently revitalizing endothelial and smooth muscle cells, and diminishing fibrosis. Our study provides robust preclinical evidence for employing Hes in treating DMED. diabetes mellitus erectile dysfunction ferroptosis hesperidin Nrf2–HO‐1/GPX4 axis National Natural Science Foundation Youth Fund 82101693 81901140 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:27.09.2025  Xin S Song W Mao J Therapeutic potential of hesperidin in diabetes mellitus‐induced erectile dysfunction through Nrf2‐mediated ferroptosis and oxidative stress Andrology 2025 13 1702 1714 10.1111/andr.13814 PMC12476218 39587831 1 INTRODUCTION Erectile dysfunction (ED) is commonly referred to as sexual dysfunction, which arises from psychological and/or physiological factors that impede the achievement of a satisfactory erection.  1  2  3  4  5 Extant studies have elucidated that reactive oxygen species (ROS) accumulate excessively in the pathogenesis of DMED, inducing oxidative stress.  6  7  8  9  10  11  12  13  14  15 Hesperidin (Hes) is a natural flavonoid extract. Research has demonstrated that Hes could alleviate oxidative stress and reduce cisplatin or arsenic trioxide‐induced cardiotoxicity in mice through activating Nrf2.  16  17  18 Consequently, we speculate that Hes modulates ferroptosis and reduces oxidative stress by activating Nrf2 in the corpus cavernosum. In this investigation, we treated type 1 diabetic rats constructed by injecting streptozotocin (STZ) with Hes to assess the variation in the erectile function and ferroptosis activity in the corpus cavernosum and carried out in vitro validation in human umbilical vein endothelial cells (HUVECs). The experimental flowchart is shown in Figure 1 FIGURE 1 The flowchart of this study. 2 MATERIALS AND METHODS 2.1 Animals Eight‐week‐old male Sprague–Dawley (SD) rats were procured from the Experimental Animal Center at Tongji Medical College, under Huazhong University of Science and Technology, for this research approved by Tongji Hospital's Institutional Research Ethics Committee (approval number TJH‐202205016). After a 1‐week acclimatization period to adjust to new surroundings and diet, the rats were weighed and tested for fasting blood glucose levels. Building on prior research, a portion of these rats were designated for the DMED model development.  19  20  21  22 2.2 Assessment of erectile dysfunction Penile erection depends on the increase in intracavernous pressure (ICP) caused by congestion of the cavernous sinus.  1 2.3 Cell culture HUVECs (MiaoLingBio, Wuhan, China) were cultured in an ECM medium supplemented with 10% FBS, penicillin/streptomycin, and ECGS, as well as an environment maintained at 5% CO 2  23  24 2.4 Western blot analysis Western blot analysis was employed following methodologies outlined in prior publications.  19 S1 2.5 Histologic evaluation 2.5.1 Immunohistochemistry staining For immunohistochemistry (IHC), we sectioned paraffin‐embedded penile tissues into 5 µm slices and performed antigen retrieval. Post‐blocking, slices were incubated with the primary antibody (referenced in Table S1 2.5.2 Immunofluorescence staining The preparation of immunofluorescence (IF) slices was the same as that of IHC procedures. And incubated the primary antibody (details are listed in Table S1 The dihydroethidium (DHE; Beyotime Biotechnology, Shanghai, China) fluorescent probe was used to detect ROS in frozen penile slices, and after incubation, red fluorescent ROS could be observed under the fluorescence microscope. ROS in HUVECs exhibited green fluorescence after incubating with DCFH‐DA (Yeasen Biotechnology, Shanghai, China). 2.5.3 Masson's trichrome staining Masson's trichrome staining was conducted on the corpus cavernosum following the protocol provided by the staining kit, which highlighted collagen fibers in blue and smooth muscle in red. The extent of cavernous fibrosis was evaluated by calculating the smooth muscle to collagen fiber ratio. 2.6 Detection of oxidative activity and iron contents The oxidative activity was assessed by detecting malondialdehyde (MDA) and superoxide dismutase (SOD) levels using kits from Beyotime Biotechnology. Additionally, both in vivo and in vitro iron content and glutathione (GSH; Jiancheng, Nanjing, China) levels were measured following the recommended protocols from reagent merchant. 2.7 Detection of endothelial function and oxidative activity The endothelial function was evaluated by measuring nitric oxide (NO; Beyotime Biotechnology) and cyclic guanosine monophosphate (cGMP; Mbbiology, Jiangsu, China) levels in tissue lysates following standard protocols. 2.8 Statistical analysis GraphPad Prism 9 software was employed in all data analyses in this research. Results were presented as mean ± standard deviation. After confirming that the data conform to a normal distribution and the variance is consistent, we applied Tukey's test for one‐way ANOVA and Dunnett's test for two‐way ANOVA, and the p 3 RESULTS 3.1 Hes mitigated erectile injury without altering metabolism By the 12th week of the experiment, there were 10, 10, and 11 rats in the control group, DMED group, and DMED+Hes group, respectively. As depicted in Figure 2A,B p FIGURE 2 Evaluation of the therapeutic effect of Hes on metabolic disorders and erectile dysfunction in rats. Transformation curve of body weight (A) and fasting blood glucose (B). (C) Representative AP and ICP waveforms of individual rats during electrical stimulation in each group. The ratio of maximum ICP to MAP (D) and AUC to MAP (E) for each group. * p p Carotid artery manometry revealed that the MAP of each group was approximately 100 mm/Hg (Figure 2C p 2D,E 3.2 Hes enhanced GPX4 expression and attenuated ferroptosis in diabetes mellitus‐induced erectile dysfunction rats GPX4 exerts the primary negative regulatory effect on LPO. In western blot analysis (Figure 3A–F p p 3G p 3J 3K FIGURE 3 Activation of Hes on GPX4 in mediating ferroptosis regulation in DMED rats. (A) Western blot images depicting GPX4 and ACSL4–LPCAT3–LOX pathway expressions. (B–F) Semi‐quantitative determination of western blot results. (G) IHC images showing GPX4 and ACSL4 in each group (×200, bars = 100 µm). Semi‐quantitative determination of IHC of GPX4 (H) and ACSL4 (I). Total iron (J) and GSH (K) contents in each group. * p p 3.3 Hes restored the Nrf2/HO‐1 pathway in vivo Ferroptosis and oxidative stress are both primarily negatively regulated by Nrf2. Building upon the observation that Hes successfully restored the expression of GPX4, we sought to clarify whether Nrf2 was also involved in this process. As depicted in Figure 4A–C p p 4D–G FIGURE 4 Effect of Hes on Nrf2–HO‐1 pathway in DMED rats. (A) Western blot images depicting Nrf2 and HO‐1 expressions. (B,C) Semi‐quantitative determination of western blot results. (D) IF images showing Nrf2 and HO‐1 in each group (×200, bars = 100 µm). Semi‐quantitative determination of IF of Nrf2 (E) and HO‐1 (F). * p p 3.4 Hes ameliorated oxidative stress in diabetes mellitus‐induced erectile dysfunction rats Previous research generally supports a pronounced activation of oxidative stress in DMED's corpus cavernosum, which is consistent with our results. The expression of three NADPH oxidases (NOX1, 2, and 4) was elevated in DMED rats (all p 5A–D 5E,F p 5G,H 5I 5J FIGURE 5 Inhibitory effect of Hes on oxidative stress in DMED rats. (A) Western blot images depicting NADPH oxidases (NOX1, 2, and 4) expressions. (B–D) Semi‐quantitative determination of western blot results. (E) IHC images showing NOX2 in each group (×200, bars = 100 µm). (F) Semi‐quantitative determination of IHC of NOX2. Representative images (G) and semi‐quantitative determination (H) of ROS in the corpus cavernosum of each group (×200, bars = 100 µm). Activity assays of MDA (I) and SOD (J) in each group. * p p 3.5 Hes enhanced the quantity and function of erectile effector cells in diabetes mellitus‐induced erectile dysfunction rats To ascertain whether ED was caused by ferroptosis in erectile effector cells, we assessed the quantity and function of endothelial cells in each group. Compared to the control group, eNOS/p‐eNOS–NO–cGMP activity downregulated in DMED rats (all p 6A–C,F G p 6D,E p 6A FIGURE 6 Restorative effect of Hes on the quantity and function of effector cells in DMED rats. (A) Western blot images depicting eNOS, p‐eNOS, RhoA‐ROCK1/ROCK2 pathway expressions. (B,C,H–J) Semi‐quantitative determination of western blot results. (D) IF images showing CD31 in each group (×200, bars = 100 µm). (E) Semi‐quantitative determination of IF of CD31. The production of NO (F) and cGMP (G) in each group. * p p 3.6 Hes reversed fibrosis in the corpus cavernosum Several fibrosis markers including TGF‐β1, Smad2/3, p‐Smad2/3, collagen I, collagen IV, and α‐SMA were measured to reflect the degree of corpus cavernosum fibrosis in each group. It is revealed that fibrosis‐related proteins in the DMED group expressed higher except for α‐SMA, while the expression of these proteins decreased by Hes supplementation (all p 7A 7A,H p 7J,K FIGURE 7 Effect of Hes on cavernous fibrosis in DMED rats. (A) Western blot images depicting TGF‐β1, Smad2/3, p‐Smad2/3, collagen I, collagen IV, and α‐SMA expressions. (B–G) Semi‐quantitative determination of western blot results. (H) IF images showing α‐SMA in each group (×200, bars = 100 µm). (I) Semi‐quantitative determination of IF of α‐SMA. (J) Representative images of Masson's trichrome staining in each group (×100, bars = 100 µm). (K) Semi‐quantitative determination of the ratio of smooth muscle and collagen fiber area in each group. * p p 3.7 Hes inhibited Nrf2–HO‐1/GPX4 pathway in vitro Due to the immature extraction process of primary endothelial cells from corpus cavernosum, we utilized HUVECs for in vitro experiments to elucidate the mechanism of Hes. Initially, we observed a decrease in HUVECs viability induced by HG via cell counting kits (CCK‐8). Upon supplementation with Hes, viability was restored, however, this effect was attenuated by ML385 (all p 8A p 8B,H I p p 8B 8J,K 8L FIGURE 8 Inhibitory effect of Hes on Nrf2–HO‐1/GPX4 pathway in HUVECs. (A) Cell viability of each group. (B) Western blot images depicting Nrf2, HO‐1, NOX1, 2, and 4 expressions. (C–G) Semi‐quantitative determination of the western blot results of oxidative stress. Representative images (H) and semi‐quantitative determination (I) of ROS in HUVECs of each group (×100, bars = 100 µm). Representative images (J) and semi‐quantitative determination (K) of IF of Nrf2 in each group (×100, bars = 100 µm). (L,M) CETSA assay showing the thermal stabilizations between Hes and Nrf2. (N) Western blot images depicting GPX4 and ACSL4–LPCAT3–LOX pathway expressions in each group. (O–S) Semi‐quantitative determination of the western blot results of ferroptosis. Total MDA (T), iron (U), and GSH (V) contents in each group. * p # p & p In the determination of ferroptosis, western blot analysis detected a decreased expression of GPX4 in the HG group, followed by an increase in the HG+Hes group, while ML385 reduced GPX4 expression (all p 8M p p 8T,U 8V 4 DISCUSSION ED is a complication of DM, characterized by a complex pathogenesis and a generally unsatisfactory response to traditional medications. Hes has demonstrated efficacy in improving lesions across various diabetes models, yet its effectiveness and mechanisms in DMED remain unclear. Our research employed the type 1 diabetic rat model to induce ED, and the results of the subsequent research revealed that Hes effectively restored the partial erectile function in DMED rats via enhancing endothelial function, smooth muscle function, and alleviating fibrosis. In terms of the molecular mechanism, Hes was found to reduce oxidative stress and mitigate ferroptosis, which were attributed to activating Nrf2 and subsequent antioxidant elements. Ferroptosis is an iron‐dependent PCD hallmarked by excessive accumulation of LPO.  9  25  26  27  28  29  12  30  31  32  33 Severe oxidative stress is often observed in the pathogenesis of DMED.  15  34  35  36  37  38  33  39  40  32  41 The primary effector cells in the corpus cavernosum include endothelial and smooth muscle cells, with a reduction in cell quantity and function leading to ED. eNOS synthesized by endothelial cells is the principal source of NO in the corpus cavernosum, facilitating the conversion of cGMP in smooth muscle cells to relax smooth muscles.  42  43 Cavernous fibrosis is a typical pathological change in DMED that arises from chronic inflammation, oxidative stress, and other factors.  19  44 This research confirmed that DM precipitated the inhibition of Nrf2 in the corpus cavernosum, consequently weakening the antioxidant and anti‐ferroptosis effects. These cascading effects led to a decrease in the quantity of smooth muscles, suppression of the eNOS–NO–cGMP and RhoA–ROCK1/ROCK2 pathways, and an increase in the fibrosis of the corpus cavernosum, which ultimately led to the onset of DMED. Hes, as an agent capable of effectively activating Nrf2 in DM, obviously alleviated oxidative stress and ferroptosis in the corpus cavernosum, restored the function of effector cells, and reversed fibrosis. Hesperidin is abundant in citrus fruits such as oranges, tangerines, lemons, and grapefruits, and can therefore be supplemented through consumption.  45  46  47 However, there are still some limitations to be addressed. First, the conducted experiments were carried out in STZ‐induced type 1 diabetes, and its applicability remains unproven in type 2 diabetes. Moreover, PDE5is is still the most commonly prescribed treatment for ED in the clinic, thus it is necessary to conduct a randomized controlled trial with a sufficient sample size to demonstrate that Hes is more effective than PDE5is, and whether there is a potential synergistic effect of their combined usage. Lastly, ferroptosis regulation is not only dependent on Nrf2 but also involves other pathways such as HIF‐1α/IRP1/TFR1,  48 5 CONCLUSIONS This study revealed that Hes modulated the Nrf2–HO‐1/GPX4 axis, restored the activity of eNOS–NO–cGMP and RhoA–ROCK1/ROCK2 pathways, alleviated fibrosis, and enhanced erectile function in DMED rats. Our findings enriched the regulatory mechanism of ferroptosis in DMED and provided robust preclinical evidence for Hes in treating DMED. AUTHOR CONTRIBUTIONS  Conceptualization Data curation Formal analysis Funding acquisition Investigation Methodology Project administration Resources Software Supervision Validation Visualization Writing—original draft Writing—review & editing CONFLICT OF INTEREST STATEMENT The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Supporting information Supporting information ACKNOWLEDGMENTS This research was funded by: National Natural Science Foundation Youth Fund (Grant Numbers: 82101693 and 81901140). DATA AVAILABILITY STATEMENT The research data used in the study are available from the corresponding author upon reasonable request. REFERENCES 1 McMahon CG Current diagnosis and management of erectile dysfunction Med J Aust 2019 210 10 469 476 31099420 10.5694/mja2.50167 2 Sun H Saeedi P Karuranga S IDF Diabetes Atlas: global, regional and country‐level diabetes prevalence estimates for 2021 and projections for 2045 Diabetes Res Clin Pract 2022 183 109119 34879977 10.1016/j.diabres.2021.109119 PMC11057359 3 Salonia A Bettocchi C Boeri L European Association of Urology Guidelines on Sexual and Reproductive Health‐2021 Update: male sexual dysfunction Eur Urol 2021 80 3 333 357 34183196 10.1016/j.eururo.2021.06.007 4 Fink HA Mac Donald R Rutks IR Nelson DB Wilt TJ Sildenafil for male erectile dysfunction: a systematic review and meta‐analysis Arch Intern Med 2002 162 12 1349 1360 12076233 10.1001/archinte.162.12.1349 5 Defeudis G Gianfrilli D Di Emidio C Erectile dysfunction and its management in patients with diabetes mellitus Rev Endocr Metab Disord 2015 10.1007/s11154-015-9321-4 26497842 6 Yuan P Ma D Gao X Liraglutide ameliorates erectile dysfunction via regulating oxidative stress, the RhoA/ROCK pathway and autophagy in diabetes mellitus Front Pharmacol 2020 11 1257 32903510 10.3389/fphar.2020.01257 PMC7435068 7 Chen Y Zhou B Yu Z Baicalein alleviates erectile dysfunction associated with streptozotocin‐induced type I diabetes by ameliorating endothelial nitric oxide synthase dysfunction, inhibiting oxidative stress and fibrosis J Sexual Med 2020 17 8 1434 1447 10.1016/j.jsxm.2020.04.390 32586748 8 Coradduzza D Congiargiu A Chen Z Zinellu A Carru C Medici S Ferroptosis and senescence: a systematic review Int J Mol Sci 2023 24 4 3658 36835065 10.3390/ijms24043658 PMC9963234 9 Jiang X Stockwell BR Conrad M Ferroptosis: mechanisms, biology and role in disease Nat Rev Mol Cell Biol 2021 22 4 266 282 33495651 10.1038/s41580-020-00324-8 PMC8142022 10 Ursini F Maiorino M Lipid peroxidation and ferroptosis: the role of GSH and GPx4 Free Radical Biol Med 2020 152 175 185 32165281 10.1016/j.freeradbiomed.2020.02.027 11 Tonelli C Chio IIC Tuveson DA Transcriptional regulation by Nrf2 Antioxid Redox Signal 2018 29 17 1727 1745 28899199 10.1089/ars.2017.7342 PMC6208165 12 Abdalkader M Lampinen R Kanninen KM Malm TM Liddell JR Targeting Nrf2 to suppress ferroptosis and mitochondrial dysfunction in neurodegeneration Front Neurosci 2018 12 466 30042655 10.3389/fnins.2018.00466 PMC6048292 13 Xu W Sun T Wang J GPX4 alleviates diabetes mellitus‐induced erectile dysfunction by inhibiting ferroptosis Antioxidants 2022 11 10 1896 36290619 10.3390/antiox11101896 PMC9598206 14 Xu W Sun T Wang J Ferroptosis is involved in corpus cavernosum smooth muscle cells impairment in diabetes mellitus‐induced erectile dysfunction Andrology 2023 11 2 332 343 36098277 10.1111/andr.13291 PMC10087266 15 Sun T Xu W Wang J Saxagliptin alleviates erectile dysfunction through increasing stromal cell‐derived factor‐1 in diabetes mellitus Andrology 2023 11 2 295 306 36113503 10.1111/andr.13296 16 Jia Y Li J Liu P Based on activation of p62‐Keap1–Nrf2 pathway, hesperidin protects arsenic‐trioxide‐induced cardiotoxicity in mice Front Pharmacol 2021 12 758670 34721041 10.3389/fphar.2021.758670 PMC8548645 17 Muhammad T Ikram M Ullah R Rehman SU MO Kim Hesperetin, a citrus flavonoid, attenuates LPS‐induced neuroinflammation, apoptosis and memory impairments by modulating TLR4/NF‐κB signaling Nutrients 2019 11 3 648 30884890 10.3390/nu11030648 PMC6471991 18 Zhu J Sun R Yan C Hesperidin mitigates oxidative stress‐induced ferroptosis in nucleus pulposus cells via Nrf2/NF‐κB axis to protect intervertebral disc from degeneration Cell Cycle 2023 22 10 1196 1214 37055945 10.1080/15384101.2023.2200291 PMC10193898 19 Sun T Xu W Wang J Paeonol ameliorates diabetic erectile dysfunction by inhibiting HMGB1/RAGE/NF‐kB pathway Andrology 2023 11 2 344 357 35678254 10.1111/andr.13203 20 Heaton JP Varrin SJ Morales A The characterization of a bio‐assay of erectile function in a rat model J Urol 1991 145 5 1099 1102 2016801 10.1016/s0022-5347(17)38543-9 21 Shi X Liao S Mi H Hesperidin prevents retinal and plasma abnormalities in streptozotocin‐induced diabetic rats Molecules 2012 17 11 12868 12881 23117428 10.3390/molecules171112868 PMC6268103 22 Aksu EH Kandemir FM Küçükler S Ameliorative effect of hesperidin on streptozotocin‐diabetes mellitus‐induced testicular DNA damage and sperm quality degradation in Sprague–Dawley rats J Food Biochem 2021 45 10 e13938 34532874 10.1111/jfbc.13938 23 Gao G Nakamura S Asaba S Miyata Y Nakayama H Matsui T Hesperidin preferentially stimulates transient receptor potential vanilloid 1, leading to NO production and Mas receptor expression in human umbilical vein endothelial cells J Agric Food Chem 2022 70 36 11290 11300 36039965 10.1021/acs.jafc.2c04045 24 Hou H Qin X Li G Nrf2‐mediated redox balance alleviates LPS‐induced vascular endothelial cell inflammation by inhibiting endothelial cell ferroptosis Sci Rep 2024 14 1 3335 38336964 10.1038/s41598-024-53976-3 PMC10858270 25 Kajarabille N Latunde‐Dada GO Programmed cell‐death by ferroptosis: antioxidants as mitigators Int J Mol Sci 2019 20 19 4968 31597407 10.3390/ijms20194968 PMC6801403 26 Jana T Tzveta S Zlatina N Effect of endurance training on diurnal rhythms of superoxide dismutase activity, glutathione and lipid peroxidation in plasma of pinealectomized rats Neurosci Lett 2020 716 134637 31751669 10.1016/j.neulet.2019.134637 27 Xing G Meng L Cao S PPARα alleviates iron overload‐induced ferroptosis in mouse liver EMBO Rep 2022 23 8 e52280 35703725 10.15252/embr.202052280 PMC9346473 28 Tu H Tang LJ Luo XJ Ai KL Peng J Insights into the novel function of system Xc‐ in regulated cell death Eur Rev Med Pharmacol Sci 2021 25 3 1650 1662 33629335 10.26355/eurrev_202102_24876 29 Latunde‐Dada GO Ferroptosis: role of lipid peroxidation, iron and ferritinophagy Biochim Biophys Acta Gen Subj 2017 1861 8 1893 1900 28552631 10.1016/j.bbagen.2017.05.019 30 Wang X Chen X Zhou W Ferroptosis is essential for diabetic cardiomyopathy and is prevented by sulforaphane via AMPK/NRF2 pathways Acta Pharm Sin B 2022 12 2 708 722 35256941 10.1016/j.apsb.2021.10.005 PMC8897044 31 Yang Y Lin Y Wang M Targeting ferroptosis suppresses osteocyte glucolipotoxicity and alleviates diabetic osteoporosis Bone Res 2022 10 1 26 35260560 10.1038/s41413-022-00198-w PMC8904790 32 Zhu X Liu H Liu Y Chen Y Liu Y Yin X The antidepressant‐like effects of hesperidin in streptozotocin‐induced diabetic rats by activating Nrf2/ARE/glyoxalase 1 pathway Front Pharmacol 2020 11 1325 32982741 10.3389/fphar.2020.01325 PMC7485173 33 Li J Wang T Liu P Hesperetin ameliorates hepatic oxidative stress and inflammation via the PI3K/AKT–Nrf2–ARE pathway in oleic acid‐induced HepG2 cells and a rat model of high‐fat diet‐induced NAFLD Food Funct 2021 12 9 3898 3918 33977953 10.1039/d0fo02736g 34 Kobayashi M Yamamoto M Molecular mechanisms activating the Nrf2–Keap1 pathway of antioxidant gene regulation Antioxid Redox Signal 2005 7 3‐4 385 394 15706085 10.1089/ars.2005.7.385 35 Bellezza I Giambanco I Minelli A Donato R Nrf2‐Keap1 signaling in oxidative and reductive stress Biochim Biophys Acta Mol Cell Res 2018 1865 5 721 733 29499228 10.1016/j.bbamcr.2018.02.010 36 Li B Hu P Liu K MiRNA‐100 ameliorates diabetes mellitus‐induced erectile dysfunction by modulating autophagy, anti‐inflammatory, and antifibrotic effects Andrology 2024 12 6 1280 1293 38227138 10.1111/andr.13586 37 Hayes JD Dinkova‐Kostova AT The Nrf2 regulatory network provides an interface between redox and intermediary metabolism Trends Biochem Sci 2014 39 4 199 218 24647116 10.1016/j.tibs.2014.02.002 38 Dodson M Redmann M Rajasekaran NS Darley‐Usmar V Zhang J KEAP1‐NRF2 signalling and autophagy in protection against oxidative and reductive proteotoxicity Biochem J 2015 469 3 347 355 26205490 10.1042/BJ20150568 PMC5514546 39 Xu Y Li Y Li J Chen W Ethyl carbamate triggers ferroptosis in liver through inhibiting GSH synthesis and suppressing Nrf2 activation Redox Biol 2022 53 102349 35623314 10.1016/j.redox.2022.102349 PMC9142717 40 Jiménez‐Osorio AS Picazo A González‐Reyes S Barrera‐Oviedo D Rodríguez‐Arellano ME Pedraza‐Chaverri J Nrf2 and redox status in prediabetic and diabetic patients Int J Mol Sci 2014 15 11 20290 20305 25383674 10.3390/ijms151120290 PMC4264167 41 Atoki AV Aja PM Shinkafi TS Ondari EN Awuchi CG Hesperidin plays beneficial roles in disorders associated with the central nervous system: a review Int J Food Prop 2023 26 1 1867 1884 42 Mitidieri E Cirino G d'Emmanuele di Villa Bianca R Sorrentino R Pharmacology and perspectives in erectile dysfunction in man Pharmacol Ther 2020 208 107493 31991196 10.1016/j.pharmthera.2020.107493 43 Tang L Dai F Liu Y RhoA/ROCK signaling regulates smooth muscle phenotypic modulation and vascular remodeling via the JNK pathway and vimentin cytoskeleton Pharmacol Res 2018 133 201 212 29791873 10.1016/j.phrs.2018.05.011 44 Watabe T Nishihara A Mishima K TGF‐beta receptor kinase inhibitor enhances growth and integrity of embryonic stem cell‐derived endothelial cells J Cell Biol 2003 163 6 1303 1311 14676305 10.1083/jcb.200305147 PMC2173713 45 Panche AN Diwan AD Chandra SR Flavonoids: an overview J Nutr Sci 2016 5 e47 28620474 10.1017/jns.2016.41 PMC5465813 46 Homayouni F Haidari F Hedayati M Zakerkish M Ahmadi K Hesperidin supplementation alleviates oxidative DNA damage and lipid peroxidation in Type 2 diabetes: a randomized double‐blind placebo‐controlled clinical trial Phytother Res 2017 31 10 1539 1545 28805022 10.1002/ptr.5881 47 Al‐Aubaidy HA Dayan A Deseo MA Twelve‐week Mediterranean Diet intervention increases citrus bioflavonoid levels and reduces inflammation in people with Type 2 diabetes mellitus Nutrients 2021 13 4 1133 33808180 10.3390/nu13041133 PMC8065815 48 Cai S Ding Z Liu X Zeng J Trabectedin induces ferroptosis via regulation of HIF‐1α/IRP1/TFR1 and Keap1/Nrf2/GPX4 axis in non‐small cell lung cancer cells Chem Biol Interact 2023 369 110262 36396105 10.1016/j.cbi.2022.110262 ",
  "metadata": {
    "Title of this paper": "Trabectedin induces ferroptosis via regulation of HIF‐1α/IRP1/TFR1 and Keap1/Nrf2/GPX4 axis in non‐small cell lung cancer cells",
    "Journal it was published in:": "Andrology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476218/"
  }
}