{
  "title": "Paper_88",
  "abstract": "pmc Oncol Lett Oncol Lett 1736 onclett OL Oncology Letters 1792-1074 1792-1082 Spandidos Publications PMC12489525 PMC12489525.1 12489525 12489525 10.3892/ol.2025.15290 OL-30-6-15290 1 Articles Retrospective comparisons of the dosimetric differences between coplanar and non-coplanar volume-modulated arc therapy in patients with pediatric brainstem glioma Lei Zhanquan 1 * Jing Junjie 2 * Shi Yuequan 3 * Gao Bo 1 Shao Kongfeng 1 Liu Yiqun 1 Yan Junjin 1 1 2 3 Correspondence to 455676689@qq.com leizhanquan1209@163.com * Contributed equally 12 2025 22 9 2025 30 6 498062 544 08 5 2025 05 9 2025 22 09 2025 03 10 2025 03 10 2025 Copyright: © 2025 Lei et al. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs License The present study aimed to compare the dosimetric characteristics of non-coplanar (NC) and coplanar volumetric modulated arc therapy (VMAT) in the treatment of pediatric brainstem glioma, to inform clinical decision-making and improve therapeutic strategies. A retrospective analysis was performed on 10 pediatric patients diagnosed with brainstem glioma who received radiotherapy at Department of Radiotherapy, Fujian Children's Hospital (Fuzhou, China). Using the Eclipse 15.5 treatment planning system, both coplanar VMAT and NC-VMAT plans were generated for each patient. Key dosimetric parameters, including the conformity index (CI), homogeneity index (HI), dose to organs at risk, γ passing rate and treatment time, were compared between the two planning approaches. Compared with standard VMAT, NC-VMAT demonstrated significantly improved dosimetric performance in target coverage, with superior CI (1.045±0.003 vs. 1.095±0.010; P<0.01) and HI (0.066±0.003 vs. 0.849±0.004; P<0.001). NC-VMAT also resulted in significantly reduced radiation doses to critical structures, including the left (L) and right (R) lenses (lens-L: 2.89±0.30 Gy vs. 4.13±0.40 Gy; lens-R: 2.94±0.27 Gy vs. 4.07±0.32 Gy; P<0.05), cochleae (cochlea-L: 35.20±1.97 Gy vs. 42.03±2.21 Gy; cochlea-R: 36.71±1.64 Gy vs. 42.18±1.54 Gy; P<0.001) and optic chiasm (45.11±0.62 Gy vs. 50.63±0.40 Gy; P<0.05). However, standard VMAT showed better sparing of the temporal lobes (TLs) (TL-L: 19.77±1.55 Gy vs. 24.91±0.88 Gy; TL-R: 19.61±1.44 Gy vs. 24.77±0.86 Gy; P<0.005) and normal brain tissue (13.98±0.10 Gy vs. 15.40±0.17 Gy; P<0.001). In conclusion, NC-VMAT demonstrates clear dosimetric advantages in the radiotherapeutic management of pediatric brainstem gliomas. These findings may contribute meaningfully to improving the precision, safety and clinical outcomes of radiotherapy for children affected by this challenging condition. radiotherapy non-coplanar gliomas pediatric volume-modulated arc therapy Natural Science Foundation of Fujian Province 2023J011305 2023J011299 This study was supported by the Natural Science Foundation of Fujian Province (grant nos. 2023J011305 and 2023J011299). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Brainstem gliomas are malignant primary tumors originating from glial cells within the brainstem and account for 10–20% of all pediatric central nervous system (CNS) tumors ( 1 2 3 5 6 7 Radiotherapy remains the cornerstone of treatment for brainstem gliomas, particularly in high-grade tumors. In pediatric patients over the age of 3 years, clinical improvement is often observed within 1 to 2 weeks of radiotherapy ( 8 9 13 14 15 10 16 17 While VMAT has demonstrated promising potential in pediatric glioma treatment, most existing studies have focused on coplanar techniques ( 18 Materials and methods Patients The present study included 10 pediatric patients (aged <18 years) who were diagnosed with brainstem glioma and underwent postoperative VMAT at the Department of Radiotherapy, Fujian Children's Hospital (Fuzhou, China) between August 2022 and September 2024. The inclusion criteria were as follows: i) Histopathological confirmation of glioma; ii) availability of complete medical records; and iii) documented clinical administration of VMAT. All patients received standard coplanar VMAT as part of their routine treatment protocol. The study cohort consisted of 4 male and 6 female patients, with a median age of 5.5 years (range, 4–12 years). For this study, NC-VMAT plans were retrospectively created using the same computed tomography (CT) datasets as the clinically implemented VMAT plans, allowing for direct dosimetric comparison. It is important to emphasize that NC-VMAT was not delivered to patients in clinical practice. Patient follow-up was conducted through a combination of regular outpatient visits, telephone interviews and, where applicable, death certificate verification. All follow-up data were reviewed and validated by attending clinical physicians to ensure accuracy and completeness. Patient positioning and imaging CT imaging was performed with patients positioned in a supine manner on an integrated immobilization system (Huayuxin HYX-UTS-CM; Jinan Huayu New Casting and Forging Materials Co., Ltd.) using a customized thermoplastic mask and headrest to ensure a stable and reproducible posture. Contrast-enhanced scans were acquired using a 16-slice, large-aperture CT simulator (Discovery RT590; GE Healthcare) following intravenous administration of iodinated contrast. Axial images were obtained at a slice thickness of 2.5 mm for precise anatomical delineation. The acquired images were then imported into the Eclipse treatment planning system (TPS) (version 15.5; Varian; Siemens Healthineers), where radiation oncologists delineated the target volumes and organs at risk (OARs) to develop the treatment plans. All radiotherapy treatments were delivered using a Varian TrueBeam linear accelerator (Varian; Siemens Healthineers). Target volume delineation To improve the accuracy of target and normal tissue delineation, both preoperative and postoperative contrast-enhanced T1-weighted and fluid attenuated inversion recovery magnetic resonance imaging (MRI) sequences were imported into the TPS for all patients. These MRI datasets were automatically aligned with the planning CT images using rigid registration within the TPS. Radiation oncologists manually reviewed and, if necessary, adjusted the image registration to ensure anatomical accuracy. The gross tumor volume (GTV) of the tumor bed was defined as the surgical resection cavity along with all regions of contrast enhancement observed on the preoperative T1-weighted MRI scans. The clinical target volume (CTV) was generated by expanding the GTV by 2 cm in all directions, followed by manual modification by the physician to conform to anatomical boundaries. A uniform 0.3-cm margin was then added to the CTV to create the planning target volume (PTV). Surrounding OARs were also carefully delineated with regard to the target area. Treatment planning All treatment plans were developed by the same team of radiation physicists using calibrated 6 MV X-rays within the TPS. For each patient, two distinct plans were retrospectively generated using the same CT dataset. In the control group (VMAT), a standard coplanar technique was employed, consisting of two full 360° arcs delivered with the treatment couch fixed at 0°. In the experimental group (NC-VMAT), the plan began with a single 360° arc at a couch angle of 0°, followed by four non-coplanar 180° half-arcs delivered at couch angles of 20°, 40°, 320° and 340°, respectively (schematic diagrams are shown in Fig. 1 19 20 Dosimetric evaluation The dosimetric characteristics of the target dose distribution for the two treatment groups were evaluated using dose-volume histogram (DVH) analysis. Key parameters included the conformity index (CI) and homogeneity index (HI), calculated as follows: i) CI=TV95%/PTV total total 2 98 50 2 50 98 In addition to these indices, comparisons were made between the two groups for the maximum dose delivered to critical structures, including the optic nerves, optic chiasm, lenses and cochleae, as well as the mean dose (D mean Fig. 2 Plan verification and treatment duration Plan verification for both treatment groups was conducted using the PTW OCTAVIUS 4D dosimetric validation system in conjunction with Verisoft 7.1 analysis software (PTW Freiburg GmbH). The γ passing rate was evaluated following AAPM Task Group 218 guidelines ( 21 Statistical analysis Statistical analyses were performed using IBM SPSS Statistics version 24.0 (IBM Corp.). Given the paired design of the study, where both treatment techniques were applied to the same patient cohort, continuous variables were first tested for normality using the Shapiro-Wilk test. Data following a normal distribution are presented as the mean ± standard deviation, and comparisons between techniques were conducted using paired-samples t-tests. For data that did not meet normality assumptions, values are presented as the median and interquartile range (IQR), with comparisons made using the Wilcoxon signed-rank test. A two-sided P-value of <0.05 was considered to indicate a statistically significant difference. Results The baseline characterestics of the 10 pediatric patients included in this study are summarized in Table I Dosimetric comparisons of the PTVs revealed that the NC-VMAT technique outperformed conventional VMAT in terms of D mean Table II Regarding radiation dose to OARs surrounding the target volume, NC-VMAT significantly reduced exposure to the lenses, optic nerves, cochlea, and optic chiasm compared to VMAT (all P<0.05). VMAT resulted in substantially lower radiation doses to the TLs and normal brain tissue relative to NC-VMAT (P<0.05). Corresponding DVH parameters and statistical analyses are provided in Table III Fig. 3 Discussion The results of the present retrospective dosimetric analysis demonstrated that NC-VMAT radiotherapy provides superior target CI and HI compared with coplanar VMAT, aligning with findings from previous studies ( 22 24 25 26 According to Radiation Therapy Oncology Group, American Society for Radiation Oncology and Pediatric Normal Tissue Effects in the Clinic guidelines, the risk of radiation-induced toxicity in pediatric patients significantly increases when the lens is exposed to doses >3 Gy, when the optic nerves or optic chiasm receive doses >45 Gy or when the cochlea is subjected to a D mean 27 28 29 30 However, the present analysis also revealed that the D mean 26 et al 31 et al 32 Although NC-VMAT technology offers significant advantages, its clinical implementation presents several challenges. As demonstrated in the present study, treatment time for NC-VMAT was nearly double that of conventional VMAT, which may pose difficulties during radiotherapy sessions for young children. Prolonged treatment durations can reduce patient compliance, particularly in pediatric patients who may struggle to remain still, potentially compromising irradiation accuracy. Moreover, children requiring sedation may need increased doses of anesthetic agents. Previous studies by Guilcher et al 33 34 Further limitations to the widespread adoption of NC-VMAT include its higher equipment and operational costs, the complexity of its treatment planning process and the need for highly skilled technical personnel ( 35 Future studies are warranted to evaluate the clinical application of NC-VMAT further. These should include long-term follow-up to assess dose distribution, tumor control efficacy, patient survival outcomes, and treatment-related complications across various tumor types and patient subgroups. Whether the dosimetric benefits of NC-VMAT ultimately translate into meaningful clinical improvements remains an open question, and addressing this gap will be essential for informing evidence-based clinical guidelines. The present study has several limitations. Firstly, as a single-center investigation with a relatively small sample size (n=10), the statistical power to detect subtle clinical differences may be limited. Although strict inclusion and exclusion criteria were applied to minimize potential confounding factors, larger multicenter studies with expanded cohorts are necessary to improve the generalizability and robustness of the findings. Furthermore, the current research lacks a comprehensive assessment of long-term neurocognitive outcomes in brain regions exposed to low-dose irradiation. Given the heightened radiosensitivity of the developing pediatric nervous system, the potential for delayed adverse effects from low-dose exposure warrants further investigation through extended follow-up. Furthermore, none of the patients received NC-VMAT treatment in clinical practice. The NC-VMAT plans were generated retrospectively using the same CT images and planning data as the clinically delivered VMAT plans. These experimental plans were used solely for dosimetric comparison within the study framework. In conclusion, NC-VMAT demonstrates significant advantages in the radiotherapeutic management of pediatric brainstem gliomas, particularly in terms of improved target dose conformity and enhanced protection of critical organs. Despite these benefits, its clinical implementation presents certain challenges, including longer treatment durations and increased radiation exposure to the TLs and surrounding brain tissue. However, the dosimetric strengths of NC-VMAT suggest that it holds potential for optimizing radiotherapy outcomes and improving the overall treatment experience for children with brainstem gliomas. Acknowledgements Not applicable. Availability of data and materials The data generated in the present study may be requested from the corresponding author. Authors' contributions ZL, JJ, YS, BG, KS, YL and JY contributed to the study conception and design. ZL and YS were mainly responsible for study conception. BG and ZL were responsible for methodology. Formal analysis and investigation was performed by YL and KS. Original draft preparation was performed by ZL and YS. JJ and BG reviewed and edited the manuscript. Funding was acquired by ZL and BG. YS and JY supervised the study. ZL and BG confirm the authenticity of all the raw data. All authors commented on previous versions of the manuscript. All authors have read and approved the final manuscript. Ethics approval and consent to participate This study was conducted in strict adherence to the Ethical Review Measures for Biomedical Research Involving Human Subjects, the Declaration of Helsinki (as revised in 2013) and the International Ethical Guidelines for Health-related Research Involving Humans. All research activities involving human participants were approved by the Ethics Committee of Fujian Children's Hospital (Fuzhou, China; approval no. 2024ETKLRK10007). The ethics committee approved the waiver of parental consent due to the retrospective nature of the study and the anonymized nature of the data, and no identifiable MRI was included in the manuscript. Patient consent for publication Not applicable. Competing interests The authors declare that they have no competing interests. References 1 Hassan H Pinches A Picton SV Phillips RS Survival rates and prognostic predictors of high grade brain stem gliomas in childhood: A systematic review and meta-analysis J Neurooncol 135 13 20 2017 10.1007/s11060-017-2546-1 28681244 PMC5658459 2 Louis DN Perry A Wesseling P Brat DJ Cree IA Figarella-Branger D Hawkins C Ng HK Pfister SM Reifenberger G The 2021 WHO classification of tumors of the central nervous system: A summary Neuro Oncol 23 1231 1251 2021 10.1093/neuonc/noab106 34185076 PMC8328013 3 Green AL Kieran MW Pediatric brainstem gliomas: New understanding leads to potential new treatments for two very different tumors Curr Oncol Rep 17 436 2015 10.1007/s11912-014-0436-7 25702179 4 Upadhyaya SA Koschmann C Muraszko K Venneti S Garton HJ Hamstra DA Maher CO Betz BL Brown NA Wahl D Brainstem low-grade gliomas in children-excellent outcomes with multimodality therapy J Child Neurol 32 194 203 2017 10.1177/0883073816675547 27810966 PMC5582383 5 Ostrom QT Price M Neff C Cioffi G Waite KA Kruchko C Barnholtz-Sloan JS CBTRUS statistical report: Primary brain and other central nervous system tumors diagnosed in the United States in 2016–2020 Neuro Oncol 25 (Suppl 4) iv1 iv99 2023 10.1093/neuonc/noad149 37793125 PMC10550277 6 Pasqualetti F Lombardi G Gadducci G Giannini N Montemurro N Feletti A Zeppieri M Somma T Caffo M Bertolotti C Ius T Brain stem glioma recurrence: Exploring the therapeutic frontiers J Pers Med 14 899 2024 10.3390/jpm14090899 39338153 PMC11433503 7 Grimm SA Chamberlain MC Brainstem Glioma: A review Curr Neurol Neurosci Rep 13 346 2013 10.1007/s11910-013-0346-3 23512689 8 Janssens GO Gidding CE Van Lindert EJ Oldenburger FR Erasmus CE Schouten-Meeteren AY Kaanders JH The role of hypofractionation radiotherapy for diffuse intrinsic brainstem glioma in children: A pilot study Int J Radiat Oncol Biol Phys 73 722 726 2009 10.1016/j.ijrobp.2008.05.030 18990510 9 Laghari AA Baig MZ Bari E Darbar A Mushtaq N Hani Abdullah UE Khan DA Pediatric brainstem gliomas: An institutional experience Asian J Neurosurg 14 1144 1150 2019 10.4103/ajns.AJNS_101_19 31903354 PMC6896630 10 Briere TM McAleer MF Levy LB Yang JN Sparing of normal tissues with volumetric arc radiation therapy for glioblastoma: Single institution clinical experience Radiat Oncol 12 79 2017 10.1186/s13014-017-0810-3 28464840 PMC5414281 11 Schulz-Ertner D Debus J Lohr F Frank C Höss A Wannenmacher M Fractionated stereotactic conformal radiation therapy of brain stem gliomas: Outcome and prognostic factors Radiother Oncol 57 215 223 2000 10.1016/S0167-8140(00)00230-9 11054526 12 Khan L Soliman H Sahgal A Perry J Xu W Tsao MN External beam radiation dose escalation for high grade glioma Cochrane Database Syst Rev 5 CD011475 2020 32437039 10.1002/14651858.CD011475.pub3 PMC7389526 13 Hatim G Chekrine T Houjami M Boughafour M Bouchbika Z Benchakroun N Jouhadi H Tawfiq N Benider A Sahraoui S Pediatric brainstem glioma J Neurosci Neurol Disord 6 001 004 2022 10.29328/journal.jnnd.1001059 14 Kortmann RD Timmermann B Taylor RE Scarzello G Plasswilm L Paulsen F Jeremic B Gnekow AK Dieckmann K Kay S Bamberg M Current and future strategies in radiotherapy of childhood low-grade glioma of the brain: Part II: Treatment-related late toxicity Strahlenther Onkol 179 585 597 2003 10.1007/s00066-003-9104-9 14628124 15 Merchant TE Conklin HM Wu S Lustig RH Xiong X Late effects of conformal radiation therapy for pediatric patients with low-grade glioma: Prospective evaluation of cognitive, endocrine, and hearing deficits J Clin Oncol 27 3691 3697 2009 10.1200/JCO.2008.21.2738 19581535 PMC2799064 16 Shaffer R Nichol AM Vollans E Fong M Nakano S Moiseenko V Schmuland M Ma R McKenzie M Otto K A comparison of volumetric modulated arc therapy and conventional intensity-modulated radiotherapy for frontal and temporal high-grade gliomas Int J Radiat Oncol Biol Phys 76 1177 1184 2010 10.1016/j.ijrobp.2009.03.013 19560880 17 Sheu T Briere TM Olanrewaju AM McAleer MF Intensity modulated radiation therapy versus volumetric arc radiation therapy in the treatment of glioblastoma-does clinical benefit follow dosimetric advantage? Adv Radiat Oncol 4 50 56 2018 10.1016/j.adro.2018.09.010 30706010 PMC6349632 18 Horbinski C Nabors LB Portnow J Baehring J Bhatia A Bloch O Brem S Butowski N Cannon DM NCCN Guidelines ® J Natl Compr Canc Netw 21 12 20 2023 10.6004/jnccn.2023.0002 36634606 19 Van Esch A Tillikainen L Pyykkonen J Tenhunen M Helminen H Siljamäki S Alakuijala J Paiusco M Lori M Huyskens DP Testing of the analytical anisotropic algorithm for photon dose calculation Med Phys 33 4130 4148 2006 10.1118/1.2358333 17153392 20 Gajjar A Mahajan A Abdelbaki M Anderson C Antony R Bale T Bindra R Bowers DC Cohen K Cole B Pediatric central nervous system cancers, version 2.2023, NCCN Clinical Practice Guidelines in Oncology J Natl Compr Canc Netw 20 1339 1362 2022 36509072 10.6004/jnccn.2022.0062 21 Miften M Olch A Mihailidis D Moran J Pawlicki T Molineu A Li H Wijesooriya K Shi J Xia P Tolerance limits and methodologies for IMRT measurement-based verification QA : Recommendations of AAPM Task Group No. 218 Med Phys 45 e53 e83 2018 10.1002/mp.12810 29443390 22 Hijazi WBM El-Sayed A El-Sayed SM El-Sayed M Comparison of coplanar and non-coplanarvmat for brain cancer by using the dosimetrical and radiobiological indices Int J Adv Res 10 577 596 2022 10.21474/IJAR01/14925 23 Fitzgerald R Owen R Hargrave C Pryor D Barry T Lehman M Bernard A Mai T Seshadri V Fielding A A comparison of three different VMAT techniques for the delivery of lung stereotactic ablative radiation therapy J Med Radiat Sci 63 23 30 2016 10.1002/jmrs.156 27087972 PMC4775834 24 Fitzgerald R Owen R Hargrave C Pryor D Lehman M Bernard A Mai T Seshadri V Fielding A A comparison of non-coplanar three-dimensional conformal radiation therapy, intensity modulated radiation therapy, and volumetric modulated radiation therapy for the delivery of stereotactic ablative radiation therapy to peripheral lung cancer J Med Imaging Radiat Sci 48 360 369 2017 10.1016/j.jmir.2017.05.003 31047471 25 Kim ST An HJ Kim JI Yoo JR Kim HJ Park JM Non-coplanar VMAT plans for lung SABR to reduce dose to the heart: A planning study Br J Radiol 93 20190596 2020 10.1259/bjr.20190596 31625759 PMC6948076 26 Cheung EYW Lee KHY Lau WTL Lau APY Wat PY Non-coplanar VMAT plans for postoperative primary brain tumour to reduce dose to hippocampus, temporal lobe and cochlea: A planning study BJR Open 3 20210009 2021 34381950 10.1259/bjro.20210009 PMC8320115 27 Constine LS Marks LB Milano MT Ronckers CM Jackson A Hudson MM Marcus KJ Hodgson DC Hua CH Howell RM A user's guide and summary of pediatric normal tissue effects in the clinic (PENTEC): Radiation dose-volume response for adverse effects after childhood cancer therapy and future directions Int J Radiat Oncol Biol Phys 119 321 337 2024 10.1016/j.ijrobp.2023.09.005 37999712 28 Lee AW Ng WT Pan JJ Chiang CL Poh SS Choi HC Ahn YC AlHussain H Corry J Grau C International guideline on dose prioritization and acceptance criteria in radiation therapy planning for nasopharyngeal carcinoma Int J Radiat Oncol Biol Phys 105 567 580 2019 10.1016/j.ijrobp.2019.06.2540 31276776 29 Wong FHC Moleme PA Ali OA Mugabe KV Clinical implementation of HyperArc Phys Eng Sci Med 45 577 587 2022 10.1007/s13246-022-01123-5 35404028 30 Xue J Jin S Zhang H Zou K Sheng J Tang J Zhao W Yang P Tang L Lv X Lv L A simplified non-coplanar volumetric modulated arc therapy for the whole brain radiotherapy with hippocampus avoidance Front Oncol 13 1143564 2023 10.3389/fonc.2023.1143564 37152035 PMC10155751 31 Pokhrel D Mallory R Bush M St Clair W Bernard ME Feasibility study of stereotactic radiosurgery treatment of glomus jugulare tumors via HyperArc VMAT Med Dosim 47 307 311 2022 10.1016/j.meddos.2022.05.002 35717426 32 Bertholet J Zhu C Guyer G Mueller S Volken W Mackeprang P Loebner HA Stampanoni MFM Aebersold DM Fix MK Manser P Dosimetrically motivated beam-angle optimization for non-coplanar arc radiotherapy with and without dynamic collimator rotation Med Phys 51 1326 1339 2024 10.1002/mp.16899 38131614 33 Guilcher GMT Rivard L Huang JT Wright NAM Anderson L Eissa H Pelletier W Ramachandran S Schechter T Shah AJ Immune function in childhood cancer survivors: A Children's Oncology Group review Lancet Child Adolesc Health 5 284 294 2021 10.1016/S2352-4642(20)30312-6 33600774 PMC8725381 34 Docking KM Knijnik SR Prospective longitudinal decline in cognitive-communication skills following treatment for childhood brain tumor Brain Inj 35 1472 1479 2021 10.1080/02699052.2021.1970806 34495783 35 Torizuka D Uto M Mizowaki T Dosimetric impact of adding non-coplanar arcs for scalp-avoidance whole-brain irradiation with volumetric-modulated arc radiotherapy on scalp dose reduction in pediatric patients with medulloblastomas J Appl Clin Med Phys 25 e14189 2024 10.1002/acm2.14189 37917885 PMC10860547 Figure 1. Schematic illustration of a non-coplanar irradiation field. (A) The radiation beam paths from a three-dimensional spatial perspective. (B) Distribution path of the beams relative to the target volume on a specific imaging plane. Figure 1. Schematic ill ustration of a non–coplanar irradiation field. (A) The radiation beam paths from a three–dimensional spatial perspective. (B) Distribution path of the beams relative to the tar... Figure 2. Comparison of dose coverage on the same level between two different plans: VMAT and NC-VMAT. NC-VMAT, non-coplanar volume-modulated arc therapy. Figure 2. Com parison of dose coverage on the same level between two different plans: VMAT and NC–VMAT. NC–VMAT, non–coplanar volume–modulated arc therapy. Figure 3. Radiation dose comparison of OARs between VMAT and NC-VMAT treatment plans. ***P<0.001, **P<0.01 and *P<0.05. NC-VMAT, non-coplanar volume-modulated arc therapy; L, left; R, right; OAR, organs at risk. Figure 3. Rad iation dose comparison of OARs between VMAT and NC–VMAT treatment plans. *** P<0.001, ** P<0.01 and * P<0.05. NC–VMAT, non–coplanar volume–modulated arc therapy; L, left; R, right; OAR, ... Table I. Baseline characteristics of the study participants. SN Age, years Sex PTV total Histology WHO grade 1 5 Female 121.10 Ependymoma II 2 6 Female 132.70 Diffuse midline glioma IV 3 4 Male 125.20 Anaplastic astrocytoma III 4 7 Female 154.60 Diffuse midline glioma IV 5 5 Female 176.20 Diffuse midline glioma IV 6 4 Female 171.40 Ependymoma II 7 7 Female 218.40 Diffuse midline glioma IV 8 12 Male 179.00 Ependymoma II 9 4 Male 165.40 Glioblastoma IV 10 12 Male 155.70 Glioblastoma IV PTV, planning target volume; WHO, World Health Organization; SN, serial number. Table II. Dosimetric parameter comparisons for the planning target volume in the VMAT and NC-VMAT patient cohorts. Parameter VMAT NC-VMAT t P-value D mean 5271.90±20.91 5220.40±18.98 5.848 <0.001 HI 0.849±0.004 0.066±0.003 13.481 <0.001 CI 1.095±0.010 1.045±0.003 4.701 0.001 Treatment time, min 3.06±0.54 5.90±0.10 −32.111 <0.001 γ pass rate, % 99.10±0.30 98.80±0.20 0.896 0.394 NC-VMAT, non-coplanar volume-modulated arc therapy; D mean Table III. Comparative analysis of OAR dose exposure between two planning groups. Mean radiation dose, cGy  OAR VMAT NC-VMAT t P-value Lens-L 413.20±40.65 289.50±30.00 −6.147 <0.001 Lens-R 407.30±32.05 294.00±27.74 −4.487 0.002 Optic nerve-L 2,318.50±312.59 2,111.10±293.98 −3.274 0.010 Optic nerve-R 2,422.30±336.65 2,208.20±286.93 −3.661 0.005 Temporal lobe-L 1,977.70±155.11 2,491.20±88.48 4.480 0.002 Temporal lobe-R 1,961.50±144.14 2,477.00±86.29 4.688 0.001 Optic chiasm 5,063.70±40.71 4,511.10±62.58 −17.969 <0.001 Cochlea-L 4,203.70±221.98 3,520.20±197.45 −9.052 <0.001 Cochlea-R 4,218.00±154.47 3,671.90±164.12 −7.969 <0.001 Brain 1,398.50±10.28 1,540.30±17.79 8.242 <0.001 OAR, organ at risk; L, left; R, right; NC-VMAT, non-coplanar volume-modulated arc therapy. ",
  "metadata": {
    "Title of this paper": "Dosimetric impact of adding non-coplanar arcs for scalp-avoidance whole-brain irradiation with volumetric-modulated arc radiotherapy on scalp dose reduction in pediatric patients with medulloblastomas",
    "Journal it was published in:": "Oncology Letters",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489525/"
  }
}