{
  "title": "Paper_601",
  "abstract": "pmc Exp Hematol Oncol Exp Hematol Oncol 1955 exhemaoncol Experimental Hematology & Oncology 2162-3619 BMC PMC12482239 PMC12482239.1 12482239 12482239 41024108 10.1186/s40164-025-00706-8 706 1 Editorial Precise regulation of RAS-Mediated PI3Kα activation: therapeutic potential of BBO-10203 in cancer treatment Fan Ziyi Tan Erqing Song Bin songbin@sxbqeh.com.cn https://ror.org/04tshhm50 grid.470966.a Third Hospital of Shanxi Medical University, Shanxi Bethune Hospital, Shanxi Academy of Medical Sciences, Tongji Shanxi Hospital, 29 9 2025 2025 14 478171 115 26 7 2025 25 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ In recent years, the Phosphoinositide-3-Kinase α (PI3Kα) signaling pathway has been increasingly recognized as a critical driver of tumorigenesis, particularly in breast cancer drug resistance and other solid tumors. Although conventional PI3Kα inhibitors (e.g., Alpelisib) have shown efficacy in extending progression-free survival in patients with PI3Kα-mutant breast cancer, their clinical application remains constrained by off-target toxicities, particularly hyperglycemia, which limits dosing and therapeutic feasibility. Building on recent preclinical findings, this study introduces BBO-10203, a first-in-class, orally bioavailable small-molecule inhibitor targeting the RAS-PI3Kα interaction. The compound is rationally designed to selectively and covalently bind to Cysteine 242 (Cys242) within the Rat Sarcoma (RAS)-Binding Domain (RBD) of PI3Kα, thereby effectively disrupting RAS-mediated PI3Kα activation. This unique mechanism confers potent in vivo antitumor activity while preserving insulin-regulated glucose metabolism, thereby mitigating metabolic adverse effects. Keywords RAS-PI3Kα signaling pathway BBO-10203 Protein-Protein interaction inhibitor Research and Innovation Team Project for Scientific Breakthroughs at Shanxi Bethune Hospital 2024AOXIANG04 Song Bin pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © YUMED Inc. and BioMed Central Ltd. 2025 RAS protein cycles between active and inactive states through binding to Guanosine Triphosphate (GTP) or Guanosine Diphosphate (GDP), respectively. In its GTP-bound state (RAS-ON), RAS facilitates activation of downstream signaling pathways. Within the RAS-PI3K-AKT-mTOR signaling axis, RAS binds to and activates PI3K, triggering the generation of Phosphatidylinositol 3,4,5-Trisphosphate (PIP3), which subsequently activates Serine-Threonine Protein Kinase (AKT) and mammalian Target of Rapamycin (mTOR), thereby regulating essential cellular processes including growth, metabolism, and anti-apoptotic mechanisms [ 1 2 3 6 3 7 Innovative mechanism of BBO-10203 As a first-in-class, orally bioavailable covalent small molecule, BBO-10203 represents a paradigm shift in antitumor drug development, transitioning from conventional kinase activity inhibition to precise upstream modulation of signaling pathways. In contrast to conventional PI3Kα kinase inhibitors that directly engage the kinase active site, BBO-10203 selectively and covalently binds the critical Cys242 residue within the RBD of the PI3Kα catalytic subunit p110α, thereby specifically disrupting the interaction between RAS isoforms (K-RAS, H-RAS, and N-RAS) and PI3Kα [ 3 4 7 8 1  Fig. 1 The PI3K-AKT axis regulates cell cycle progression, apoptosis, angiogenesis, and glucose transport, with glucose uptake mediated by PI3Kα activation independently of RAS. BBO-10203 selectively and covalently binds to the RBD of the p110α subunit, thereby specifically blocking RAS-dependent pathway activation without affecting glucose metabolism. The diagram illustrates the combination regimens currently under clinical trials involving BBO-10203, including Trastuzumab (anti-HER2 monoclonal antibody), Fulvestrant (estrogen receptor antagonist), Ribociclib (CDK4/6 inhibitor), and Bevacizumab (anti-VEGF antibody) combined with FOLFOX chemotherapy in KRASmutant tumors. (Created by Figdraw). Abbreviations: FOLFOX = folinic acid, fluorouracil & oxaliplatin; GLUT4 = Glucose Transporter Type 4; AS160 = AKT Substrate of 160 kDa; NUR77 = Nuclear receptor NR4A1; RXRα = Retinoid X Receptor alpha; eNOS = Endothelial nitric oxide synthase; RNA Pol II = RNA Polymerase II BBO-10203 demonstrates potent inhibition of phospho-AKT (pAKT) across multiple cell lines, with particularly high efficacy observed in BT-474 cells. In vivo, oral administration of BBO-10203 resulted in 80–88% tumor growth inhibition in KYSE-410 and BT-474 xenograft models, with sustained effects observed for up to 24 h [ 3 7 9 11 3 7 3 7 Combination therapy strategies and potential applications in drug-resistance mechanisms Drug resistance continues to represent a major challenge in cancer therapy. Current evidence indicates that persistent activation of the AKT/mTOR pathway not only drives tumor cell proliferation but also underlies resistance to diverse anticancer therapies. Although single-target PI3K/AKT pathway inhibitors (e.g., Idelalisib, GSK2334470, and Ipatasertib) can rapidly suppress AKT activity within minutes, such inhibition is often transient, with AKT activity frequently rebounding, occasionally exceeding baseline levels within 24 hours. Simultaneous inhibition at multiple nodes of the pathway using a combination of three targeted inhibitors can, however, induce a more sustained suppression of AKT activity while reducing the effective dose required for each agent [ 12 Within this context, BBO-10203 demonstrates synergistic potential in multiple combination therapies through effective blockade of RAS-mediated PI3Kα activation. In combination with the anti-HER2 antibody Trastuzumab, BBO-10203 exhibited pronounced synergistic antitumor effects in HER2-positive breast cancer models [ 7 7 13 1 3 4 7 8 13 NCT06625775 1  Table 1 A Phase 1a/1b Open-Label Study Evaluating the Safety, Tolerability, Pharmacokinetics, and Efficacy of BBO-10203 in Subjects With Advanced Solid Tumors (The BREAKER-101 Study) Participant Group Details Drug Intervention Drug Administration Cancer type Experimental: BBO-10203 Participants enrolled in this cohort will receive BBO-10203 tablets orally (different dose levels will be evaluated) once daily as monotherapy. This cohort will enroll patients with HER2-positive advanced breast cancer, HR-positive HER2-negative advanced breast cancer, advanced colorectal cancer, and advanced lung cancer. Drug: BBO-10203 Participants will receive assigned dose of BBO-10203 orally once daily Breast Cancer, Colorectal Cancer and Lung Cancer Experimental: BBO-10203 + Trastuzumab Participants enrolled in this cohort will receive BBO-10203 tablets orally in combination with trastuzumab (8mg/kg infusion over 90 minutes on Cycle 1 Day 1, 6mg/kg infusion over 30–90 minutes during subsequent cycles or 600mg subcutaneous). This cohort will enroll patients with HER2-positive advanced breast cancer. Drug: Trastuzumab Participants will receive trastuzumab as infusion or subcutaneous injection every 21 days Breast Cancer Drug: BBO-10203 Participants will receive assigned dose of BBO-10203 orally once daily Experimental: BBO-10203 + Fulvestrant Participants enrolled in this cohort will receive BBO-10203 tablets orally in combination with fulvestrant (500mg IM). This cohort will enroll patients with HR-positive, HER2-negative advanced breast cancer. Drug: BBO-10203 Participants will receive assigned dose of BBO-10203 orally once daily Breast Cancer Drug: Fulvestrant Patients will receive Fulvestrant as an intramuscular injection every 28 days (additional dose on C1D15) Drug: Ribociclib Patients will receive Ribociclib orally once a day (21 days on treatment, 7 days off) Experimental: BBO10203 Participants enrolled in this cohort will receive BBO-10203 tablets orally in combination with fulvestrant (500mg IM) and ribociclib (600mg orally) as determined in the dose escalation. This cohort will enroll patients with HR-positive, HER2-negative advanced breast cancer. Drug: BBO-10203 Participants will receive assigned dose of BBO-10203 orally once daily Breast Cancer Drug: Fulvestrant Patients will receive Fulvestrant as an intramuscular injection every 28 days (additional dose on C1D15) Drug: Ribociclib Patients will receive Ribociclib orally once a day (21 days on treatment, 7 days off) Experimental: BBO10203 Participants enrolled in this cohort will receive BBO-10203 tablets orally in combination with FOLFOX (oxaliplatin 85 mg/m2, leucovorin 400 mg/m2, 5FU 400 mg/m2 + 2400 mg/m2) and bevacizumab (5 mg/kg IV). This cohort will enroll patients with KRAS-mutant advanced colorectal cancer. Drug: FOLFOX Patients will receive FOLFOX as infusion every 14 days Colorectal Cancer Drug: Bevacizumab Patients will receive bevacizumab as infusion every 28 days Drug: BBO-10203 Participants will receive assigned dose of BBO-10203 orally once daily Recently, structural biology has assumed an increasingly pivotal role in elucidating protein-protein interactions [ 14 4 Conclusion As a small-molecule inhibitor targeting protein–protein interactions (PPI), BBO-10203 has demonstrated potent antitumor activity in preclinical models, with the potential to provide safer and more effective therapeutic options for PI3K-driven tumors. Preclinical findings indicate that BBO-10203 may represent a first-in-class PI3Kα-targeted agent, conferring dual advantages of robust antitumor efficacy and reduced metabolic toxicity through selective inhibition of the RAS-PI3Kα interaction. This approach may offer novel therapeutic opportunities for patients with RAS-mutant or PI3K active solid tumors. Although research is currently confined to the preclinical stage, BBO-10203 has exhibited substantial promise with respect to efficacy, pharmacokinetics/pharmacodynamics, and safety. Future investigations should prioritize clinical development, elucidation of resistance mechanisms, exploration of rational combination strategies, and expansion of its therapeutic applications. Moreover, studies addressing its potential in combination regimens, strategies to overcome acquired resistance, and precision applications-particularly in ER+/PIK3CA-mutant and HER2-amplified malignancies-will be of critical importance. Achieving safe and effective therapeutic targeting of the RAS and PI3K pathways continues to represent a major challenge. Detection of the RAS-PI3Kα complex may facilitate validation of the target dependency of BBO-10203, while monitoring dynamic changes in key downstream effectors, such as AKT phosphorylation, could provide pharmacodynamic readouts for efficacy assessment and potential biomarkers to guide personalized precision therapy. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Author contributions ZY.F and EQ.T: writing the original draft; B.S: a critical review of the manuscript. All authors reviewed the manuscript. Funding This study was supported by grants from Research and Innovation Team Project for Scientific Breakthroughs at Shanxi Bethune Hospital (grant numbers: 2024AOXIANG04). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent for publication All authors agreed on the manuscript. Competing interests The authors declare no competing interests. Abbreviations PI3Kα Phosphoinositide 3-Kinasesα Cys242 Cysteine 242 RBD RAS-Binding Domain RAS Rat Sarcoma GTP Guanosine Triphosphate GDP Guanosine Diphosphate PIP3 Phosphatidylinositol 3,4,5-Trisphosphates KRAS Kirsten Rat Sarcoma AKT Serine-Threonine Protein Kinase pAKT Phospho-AKT ER Estrogen Receptor Positive HER2 Human Epidermal Growth Factor Receptor 2 OGTT Oral Glucose Tolerance Test PPI Protein-Protein Interaction References 1. Yang X Wu H RAS signaling in carcinogenesis, cancer therapy and resistance mechanisms J Hematol Oncol 2024 17 108 10.1186/s13045-024-01631-9 39522047 PMC11550559 Yang X, Wu H. RAS signaling in carcinogenesis, cancer therapy and resistance mechanisms. J Hematol Oncol. 2024;17:108. 39522047 10.1186/s13045-024-01631-9 PMC11550559 2. Ma Q Zhang W Wu K Shi L The roles of KRAS in cancer metabolism, tumor microenvironment and clinical therapy Mol Cancer 2025 24 14 10.1186/s12943-024-02218-1 39806421 PMC11727292 Ma Q, Zhang W, Wu K, Shi L. The roles of KRAS in cancer metabolism, tumor microenvironment and clinical therapy. Mol Cancer. 2025;24:14. 39806421 10.1186/s12943-024-02218-1 PMC11727292 3. Beltran P, Dhirendra S, Xu R et al. Abstract RF02-02: BBO-10203, a first-in-class, orally bioavailable, selective covalent small molecule that inhibits RAS-driven PI3Kalpha activity without affecting glucose metabolism. Cancer Res. 2024;84: RF02-02-RF02-02. 4. Czyzyk D Yan W Messing S Structural insights into isoform-specific RAS-PI3Kα interactions and the role of RAS in PI3Kα activation Nat Commun 2025 16 525 10.1038/s41467-024-55766-x 39788953 PMC11718114 Czyzyk D, Yan W, Messing S, et al. Structural insights into isoform-specific RAS-PI3Kα interactions and the role of RAS in PI3Kα activation. Nat Commun. 2025;16:525. 39788953 10.1038/s41467-024-55766-x PMC11718114 5. Shi Y Zheng H Wang T Targeting KRAS: from metabolic regulation to cancer treatment Mol Cancer 2025 24 9 10.1186/s12943-024-02216-3 39799325 PMC11724471 Shi Y, Zheng H, Wang T, et al. Targeting KRAS: from metabolic regulation to cancer treatment. Mol Cancer. 2025;24:9. 39799325 10.1186/s12943-024-02216-3 PMC11724471 6. Li Y Zhao J Li Y New exploration of KRASG12D inhibitors and the mechanisms of resistance Experimental Hematol Oncol 2025 14 39 10.1186/s40164-025-00637-4 PMC11912584 40097966 Li Y, Zhao J, Li Y. New exploration of KRASG12D inhibitors and the mechanisms of resistance. Experimental Hematol Oncol. 2025;14:39. 10.1186/s40164-025-00637-4 PMC11912584 40097966 7. Sinkevicius K, Stice J, Riegler E et al. Abstract PS7-04: BBO-10203, a first-in-class, orally bioavailable, selective blocker of the PI3Kα: RAS interaction inhibits tumor growth alone and in combination with standard of care therapies in breast cancer models without inducing hyperglycemia. Clinical Cancer Research. 2025;31:PS7-04-PS07-04. 8. Simanshu DK Xu R Stice JP BBO-10203 inhibits tumor growth without inducing hyperglycemia by blocking RAS-PI3Kα interaction Science 2025 389 409 15 10.1126/science.adq2004 40504949 Simanshu DK, Xu R, Stice JP, et al. BBO-10203 inhibits tumor growth without inducing hyperglycemia by blocking RAS-PI3Kα interaction. Science. 2025;389:409–15. 40504949 10.1126/science.adq2004 9. Vanhaesebroeck B Burke JE Madsen RR Precision targeting of mutant PI3Kα in cancer by selective degradation Cancer Discov 2022 12 20 2 10.1158/2159-8290.CD-21-1411 35022207 PMC7612218 Vanhaesebroeck B, Burke JE, Madsen RR. Precision targeting of mutant PI3Kα in cancer by selective degradation. Cancer Discov. 2022;12:20–2. 35022207 10.1158/2159-8290.CD-21-1411 PMC7612218 10. Song KW Edgar KA Hanan EJ RTK-Dependent inducible degradation of mutant PI3Kα drives GDC-0077 (Inavolisib) efficacy Cancer Discov 2022 12 204 19 10.1158/2159-8290.CD-21-0072 34544753 PMC9762331 Song KW, Edgar KA, Hanan EJ, et al. RTK-Dependent inducible degradation of mutant PI3Kα drives GDC-0077 (Inavolisib) efficacy. Cancer Discov. 2022;12:204–19. 34544753 10.1158/2159-8290.CD-21-0072 PMC9762331 11. Jhaveri KL Accordino MK Bedard PL Phase i/ib trial of inavolisib plus Palbociclib and endocrine therapy for PIK3CA-Mutated, hormone receptor-Positive, human epidermal growth factor receptor 2-Negative advanced or metastatic breast cancer J Clin Oncology: Official J Am Soc Clin Oncol 2024 42 3947 56 10.1200/JCO.24.00110 PMC11575912 39236276 Jhaveri KL, Accordino MK, Bedard PL, et al. Phase i/ib trial of inavolisib plus Palbociclib and endocrine therapy for PIK3CA-Mutated, hormone receptor-Positive, human epidermal growth factor receptor 2-Negative advanced or metastatic breast cancer. J Clin Oncology: Official J Am Soc Clin Oncol. 2024;42:3947–56. 10.1200/JCO.24.00110 PMC11575912 39236276 12. Kupcova K Senavova J Jura F Vertical targeting of the PI3K/AKT pathway at multiple points is synergistic and effective for non-Hodgkin lymphoma Experimental Hematol Oncol 2024 13 108 10.1186/s40164-024-00568-6 PMC11529427 39487517 Kupcova K, Senavova J, Jura F, et al. Vertical targeting of the PI3K/AKT pathway at multiple points is synergistic and effective for non-Hodgkin lymphoma. Experimental Hematol Oncol. 2024;13:108. 10.1186/s40164-024-00568-6 PMC11529427 39487517 13. Stahlhut Espinosa CE Singh K Zhang Z Abstract 4378: BBO-11818, an orally bioavailable, highly potent and non-covalent pan-KRAS inhibitor demonstrates robust anti-tumor activity in KRAS-mutant preclinical models Cancer Res 2025 85 4378 4378 10.1158/1538-7445.AM2025-4378 Stahlhut Espinosa CE, Singh K, Zhang Z, et al. Abstract 4378: BBO-11818, an orally bioavailable, highly potent and non-covalent pan-KRAS inhibitor demonstrates robust anti-tumor activity in KRAS-mutant preclinical models. Cancer Res. 2025;85:4378–4378. 14. Nada H Choi Y Kim S Jeong KS Meanwell NA Lee K New insights into protein–protein interaction modulators in drug discovery and therapeutic advance Signal Transduct Target Therapy 2024 9 341 10.1038/s41392-024-02036-3 PMC11621763 39638817 Nada H, Choi Y, Kim S, Jeong KS, Meanwell NA, Lee K. New insights into protein–protein interaction modulators in drug discovery and therapeutic advance. Signal Transduct Target Therapy. 2024;9:341. 10.1038/s41392-024-02036-3 PMC11621763 39638817 ",
  "metadata": {
    "Title of this paper": "New insights into protein–protein interaction modulators in drug discovery and therapeutic advance",
    "Journal it was published in:": "Experimental Hematology & Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482239/"
  }
}