{
  "title": "Paper_574",
  "abstract": "pmc BMC Geriatr BMC Geriatr 33 bmcgeri BMC Geriatrics 1471-2318 BMC PMC12482861 PMC12482861.1 12482861 12482861 41023930 10.1186/s12877-025-06440-4 6440 1 Research Association between nutrition literacy and physical function limitations among geriatric population in China Sun Yuhui Tian Xi Hu Xiaoting Liu Huaqing lhqbbmc@163.com School of Public Health, Bengbu Medical University, Bengbu, 233030 Anhui People’s Republic of China 29 9 2025 2025 25 478199 752 14 5 2025 2 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Introduction To assess the relationship between nutrition literacy (NL) and physical function limitations among Chinese older adults. Methods It was a cross-sectional survey carried out in May – Results In the study, among 1348 participants, 17.4% had ADL limitations, and 33.8% had IADL limitations. NL was negatively associated with limitations in ADL (OR: 0.97, 95% CI: 0.95 – – – Conclusion NL was negatively associated with physical function limitations in older adults, and the association varied by monthly income, education, and chronic disease status. Findings underscore that NL may be a promising intervention target to improve the physical function of older adults and interventions should be directed towards those with low levels of education and income, and chronic diseases. Supplementary Information The online version contains supplementary material available at 10.1186/s12877-025-06440-4. Keywords Activities of daily living Nutrition literacy Nutritional status Instrumental activities of daily living Older adults Natural Science Foundation of the Anhui Provincial Educational Committee No. KJ2019A0302 and 2022AH040217 Liu Huaqing pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction China’s accelerated demographic aging presents unprecedented public health challenges. Demographic data indicate that older adults aged 60 and over accounted for 21.1% of the population by the end of 2023 in China [ 1 2 3 4 5 6 7 8 6 9 The main influencing factors for the limitations in ADL and IADL in older people can be summarized into several aspects. However, studies suggest that good eating habits and nutrient intake play significant roles in maintaining independence in ADL and IADL [ 10 11 13 14 15 16 17 Nutrition literacy (NL) is a new field of study, and its concept originates from health literacy. It is characterized in operational terms as the ability to acquire, process, and comprehend dietary knowledge and competencies, thereby enabling individuals to formulate optimal dietary decisions [ 18 19 20 18 21 22 21 23 24 25 26 Materials and methods Study design and participants A cross-sectional survey was carried out from May to July 2023 to explore the association between NL and health condition in Bengbu, China. A stratified cluster sampling was used to select participants. Inclusion criteria for the survey’s participants were being older than 18 years, and living in their community for at least 6 months prior to the survey. A self-designed structured questionnaire was used to collect data by interview. More details have been presented in previous study [ 27 A comprehensive survey was administered by community workers to a total of 2400 individuals. Out of the total participants, 2279 successfully completed the questionnaire, leading to an impressive completion rate of 95.0%. Given that ADL and IADL limitations are common among older adults, the study analyzed those aged ≥ 60 years. The initial study comprised 1355 participants, of which 7 cases (0.5%) underwent exclusion owing to incomplete datasets regarding NL, ADL, and IADL parameters. Ultimately, 1348 eligible subjects were retained for final analysis. Characteristics of the lost sample were found to be consistent with those of the final sample, with no significant differences. Sample size calculation The sample size was calculated using the formula: N Z 1−α/2 2 P P δ 2 P 4 δ P Nutrition literacy measurement The nutrition literacy-short form (NL-SF), adapted from the comprehensive 43-item NL assessment tool [ 28 29 27 Physical function limitations measurement Physical function limitations included ADL and IADL limitations. ADL were assessed based on the Katz Index [ 30 31 Covariates The subsequent sociodemographic information was gathered: gender (female, male), age (60–74 years old, 75–89 years old, 90 years old and above), marital status (married, others), education (primary school or below, secondary school and above), occupation (farmer, separated/retired staff and others), monthly income (< 1,000 RMB, 1,000–3,000 RMB, ≥ 3,000 RMB), drinking (never, former and current drinking), and smoking (never, former and current smoking). Place of residence included “urban areas” and “rural areas” based on the administrative division standards in China, i.e., districts or sub-districts (jiedao) in cities officially designated as urban areas, and townships (xiang) or villages (cun) officially designated as rural areas. Chronic disease status was acquired through the question “Do you have a physician-diagnosed chronic diseases listed below (hypertension, diabetes, heart disease, cerebrovascular disease, chronic lung disease, digestive system disorders, osteoporosis, abnormal blood lipids, arthritis, rheumatism or rheumatoid disorder, lumbar and back disorders, and cancer)?”. Response includes yes or no. Additionally, body mass index (BMI) was assessed using the following categories: underweight (< 18.5 kg/m 2 2 2 2 Statistical analysis The SPSS was employed for statistical analyses. Continuous variables were represented as mean ± standard deviation (SD) and categorical variables were represented as frequencies and percentages. Chi-square test was applied to compare differences in groups for categorical variables. The variance inflation factor (VIF) was calculated to examine potential multicollinearity among the NL subdomains in the logistic model, where a VIF value < 10 was considered indicative of no severe multicollinearity [ 32 p Results Basic characteristics Table 1  Table 1 Participants’ demographic characteristics and ADL and IADL limitations ADL IADL Variable  N Preserved Impaired χ 2 Independence Dependence χ 2 Total 1348 1114(82.6) 234(17.4) 893(66.2) 455(33.8) Age(year) 17.751*** 64.192*** 60–74 573(43.5) 501(87.4) 72(12.6) 439(76.6) 134(23.4) 75–89 584(43.3) 468(80.1) 116(19.9) 365(62.5) 219(37.5) 90 and above 191(14.2) 145(75.9) 46(24.1) 89(46.6) 102(53.4) Gender 16.434*** 33.784*** Male 611(45.3) 533(87.2) 78(12.8) 455(74.5) 156(25.5) Female 737(54.7) 581(78.8) 156(21.2) 438(59.4) 299(40.6) Place of residence 30.543*** 30.543*** Urban areas 624(46.3) 554(88.8) 70(11.2) 513(82.2) 111(17.8) Rural areas 724(53.7) 560(77.3) 164(22.7) 380(52.5) 344(47.5) Marital status 12.816*** 10.016** Married 1062(78.8) 898(84.6) 164(15.4) 726(68.4) 336(31.6) Others 286(21.2) 216(75.5) 70(24.5) 167(58.4) 119(41.6) Education 30.110*** 168.089*** Primary school and below 790(58.6) 615(77.8) 175(22.2) 412(52.2) 378(47.8) Junior high school and above 555(41.2) 496(89.4) 59(10.6) 478(86.1) 77(13.9) Type of occupation 27.464*** 74.861*** Farmers 468(34.7) 361(77.1) 107(22.9) 243(51.9) 225(48.1) Separated/retired staff 624(46.3) 552(88.5) 72(11.5) 480(76.9) 144(23.1) Others 253(18.8) 199(78.7) 54(21.3) 169(66.8) 84(33.2) Monthly income(¥) 42.528*** 165.037*** < 1000 657(48.7) 499(76.0) 158(24.0) 328(49.9) 329(50.1) 1000–3000 369(27.4) 327(88.6) 42(11.4) 286(77.5) 83(22.5) 3000 and above 309(22.9) 279(90.3) 30(9.7) 272(88.0) 37(12.0) Smoking 10.057** 16.065*** No 912(67.7) 736(80.6) 177(19.4) 572(62.7) 340(37.3) Former Smoker 167(12.4) 140(83.8) 27(16.2) 120(71.9) 47(28.1) Current smoker 269(20.0) 239(88.8) 30(11.2) 201(74.7) 68(25.3) Alcohol drinking 5.658 15.546*** No 844(62.6) 686(81.3) 158(18.7) 526(62.3) 318(37.7) Former drinker 187(13.9) 152(81.3) 35(18.7) 136(72.7) 51(27.3) Current drinker 317(23.5) 276(87.1) 41(12.9) 231(72.9) 86(27.1) BMI <18.5 kg/m 2 32(2.0) 28(87.5) 4(12.5) 5.200 19(59.4) 13(40.6) 4.110 18.5–23.9 kg/m 2 491(36.4) 414(84.3) 77(15.7) 326(66.4) 165(33.6) 24–27.9 kg/m 2 550(40.8) 455(82.7) 95(17.3) 380(69.1) 170(30.9) ≥ 28 kg/m 2 240(17.8) 187(77.9) 53(22.1) 150(62.5) 90(37.5) Chronic diseases status 20.054*** 29.426*** No 211(15.7) 197(93.4) 14(6.6) 174(82.5) 37(17.5) Yes 1137(84.3) 917(80.7) 220(19.3) 719(63.2) 418(36.8) * P ** p *** p Associations between NL levels and ADL and IADL limitations Table 2 p 3 p  Table 2 Nutrition literacy according to ADL and IADL limitations Variable Mean ± SD ADL IADL No limitation ( n Limitation ( n t Independence ( n Dependence ( n t Nutrition literacy 35.61 ± 8.35 36.23 ± 8.34 32.69 ± 7.78 5.95 *** 37.58 ± 8.21 31.73 ± 7.22 13.42 *** Knowledge 7.64 ± 1.56 7.69 ± 1.56 7.42 ± 1.55 2.36 ** 7.79 ± 1.54 7.36 ± 1.56 4.83 *** Understanding 5.52 ± 2.20 5.66 ± 2.21 4.82 ± 2.04 5.33 *** 6.01 ± 2.18 4.55 ± 1.92 12.61 ** Obtaining skills 5.05 ± 2.10 5.17 ± 2.12 4.47 ± 1.93 4.92 *** 5.51 ± 2.10 4.15 ± 1.81 12.35 *** Applying skills 4.96 ± 1.87 5.05 ± 1.89 4.53 ± 1.70 3.85 *** 5.27 ± 1.89 4.35 ± 1.66 9.24 *** Interactive skills 6.57 ± 1.80 6.63 ± 1.79 6.26 ± 1.84 2.86 ** 6.82 ± 1.77 6.07 ± 1.75 7.42 *** Critical skills 5.88 ± 1.84 6.03 ± 1.81 5.18 ± 1.81 6.54 *** 6.19 ± 1.76 5.27 ± 1.84 8.79 *** * P ** P *** P  Table 3 Association between NL and ADL and IADL limitations by multivariate logistic regression Variable ADL OR (95%CI)  P IADL OR (95%CI)  P Nutrition literacy 0.97(0.95, 0.99) 0.013 0.95(0.93, 0.97) < 0.001 Knowledge 0.98(0.89, 1.08) 0.703 0.95(0.87, 1.04) 0.235 Understanding 0.92(0.85, 0.99) 0.048 0.86(0.80, 0.92) < 0.001 Obtaining skills 0.94(0.86, 1.02) 0.152 0.85(0.79, 0.91) < 0.001 Applying skills 0.95(0.87, 1.05) 0.316 0.86(0.79, 0.94) < 0.001 Interactive skills 0.95(0.87, 1.04) 0.256 0.85(0.79, 0.92) < 0.001 Critical skills 0.83(0.76, 0.91) < 0.001 0.85(0.78, 0.92) < 0.001 The OR (95% CI) was calculated using binary logistic regression when adjusting for age, marital status, education, occupation, monthly income, smoking status, drinking status, BMI and chronic diseases. VIF value < 10 was considered indicative of no severe multicollinearity OR 95% CI * P ** P *** P Subgroup analysis Table 4  Table 4 Subgroup analysis of association between nutrition literacy and ADL as well as IADL limitations among the elderly population ADL OR (95%CI)  P IADL OR (95%CI)  P Education Primary school and below 0.97(0.94, 0.99) 0.016 0.95(0.92, 0.97) < 0.001 Junior high school and above 0.99(0.95, 1.03) 0.616 0.96(0.93, 0.99) 0.04 Monthly income (¥) < 1000 0.97(0.94, 0.99) 0.015 0.94(0.92, 0.97) < 0.001 1000–3000 0.98(0.94, 1.03) 0.462 0.97(0.93, 1.01) 0.128 3000 and above 0.99(0.94, 1.04) 0.706 0.96(0.91, 1.01) 0.089 Chronic diseases status No 1.04(0.95, 1.14) 0.373 0.99(0.92, 1.07) 0.869 Yes 0.97(0.95, 0.99) 0.005 0.95(0.93, 0.97) < 0.001 Discussion The study is the first to investigate the associations between NL and physical function limitations among older adults in Bengbu, China. Findings showed that approximately one-fifth of older adults have ADL limitations, one-third have IADL limitations, and a negative relationship was found between NL and ADL and IADL limitations. This suggests that physical function limitations become a public health issue in older people and enhancing NL might represent an effective approach for reducing the prevalence of ADL and IADL limitations. Our study showed that greater levels of NL were linked with lower rates of ADL and IADL limitations. NL is closely associated with individuals’ dietary habits and serves as a predictor of their dietary behaviors and quality. Consequently, this has a significant impact on the individual’s health [ 33 34 35 36 This study indicated a lack of association between nutritional knowledge and limitations in both ADL and IADL. This could be attributed to older adults accessing nutritional knowledge from non-professional sources (e.g., social media), which often contains inaccurate information [ 37 38 39 40 In this study, the inverse association of NL with ADL and IADL limitations was only observed in older adults with low education. This indicates that individuals with lower education attainment may improve their health management capabilities through practical learning, such as life experience [ 41 42 43 31 44 Among older individuals with a Monthly income of less than 1,000 yuan, NL is significantly and negatively correlated with physical function limitations. Low income hinders access to healthcare services and social resources [ 45 46 47 48 There are limitations in our study. First, as a cross-sectional survey, this research cannot establish causality regarding the association between NL and physical function limitations in older adults, and prospective longitudinal studies are needed to verify this relationship. Second, participants in this study were exclusively recruited from a specific geographical region in Bengbu, China, which may limit the generalizability of the findings. The elderly population in this region may have unique characteristics in terms of socioeconomic status, cultural factors, and health behaviors that are not representative of older adults in other regions of China or globally. Therefore, future research should endeavor to cover a diverse range of geographical regions and demographic groups to ascertain if these findings can be generalized to other populations. Third, the chronic disease categories included in this study are limited, and unassessed diseases may contribute to functional decline. Additionally, the assessment of the total number of chronic diseases in participants relied on self-reported data without verification of diagnostic details, which may result in an undercount or incomplete recording of comorbidities. Future research could employ more comprehensive chronic disease assessment methods, integrating medical records or clinical diagnoses. Finally, physical functional limitations rely primarily on self-reported information on ADL and IADL rather than objective measurements or clinical diagnoses. In such scenarios, older adults may choose to conceal their poor health and lifestyle habits, potentially impeding the accurate estimation of functional limitations and risking an underestimation. Future research needs to employ objective measures for assessing physical functional limitations. Conclusions NL showed a significant inverse association with physical function limitations in older adults, and this relationship appears to be influenced by factors such as education, income, and chronic disease. The findings suggest that NL may be a potential target for interventions aimed at improving physical function in older people. Moreover, policies or interventions targeting NL should consider differences in education, income, and chronic disease status. There is a need for increased focus on individuals with low education, low income, and chronic diseases. Supplementary Information  Supplementary Material 1: Supplementary Table S1.pdf: The short-form NL self-assessment questionnaire.  Supplementary Material 2: Supplementary Table S2.pdf: Activities of daily living questionnaire and instrumental activities of daily living questionnaire. Abbreviations NL Nutrition literacy ADL Activities of daily living IADL Instrumental activities of daily living NL-SF Nutrition literacy-short form BMI Body mass index SD Standard deviation OR Odds ratio CI Confidence interval Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors thank all the study participants and staff who helped us with this study. Author details 1 School of Public Health, Bengbu Medical University, Bengbu 233030, Anhui, People’s Republic of China. Authors’ contributions Y.S. and X.H. conducted statistical analysis and wrote the manuscript; Y.S. and X.T. reviewed and revised the manuscript; H.L. conceptualized and designed the study, and critically reviewed the manuscript. All authors reviewed and approved the manuscript. Funding This research was funded by the Natural Science Foundation of the Anhui Provincial Educational Committee (Grant No. KJ2019A0302 and 2022AH040217). Data availability Data are available from the corresponding author upon reasonable request. Declarations Ethics approval and consent to participate The authors affirm that all research methodologies and procedures employed in this study adhered to the guidelines and regulations set forth by the Declaration of Helsinki. All participants in this study provided individual informed consent, and the ethics committee of Bengbu Medical College (No. 2019002) sanctioned the study procedures. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Doe J. National Bulletin on the Development of Aging Undertakings in 2023. Ministry of Civil Affairs, China National Committee on Ageing. 2025. Available from: https://www.gov.cn/lianbo/bumen/202410/P020241012307602653540.pdf 2. Wang B. Health status and health changes of older adults in China and the relevant socioeconomic impacts: an analysis based on the data of the seventh National census. J Yunnan Nationalities Univ Social Sci Ed. 2022; (05), 68–75. 3. Doe J. Global Report on Health Equity for Persons with Disabilities. World Health Organization (WHO). 2025. Accessed 11 Mar 2025. Available from: https://iris.who.int/bitstream/handle/10665/365253/9789240064577-chi.pdf?sequence=1 4. Doe J. Mar. The Fifth Sample Survey on the Living Conditions of China’s Urban and Rural Older Persons. China National Committee on Ageing.2025. Available from: http://www.crca.cn/images/20241017wdsjgb.pdf 5. Gu MO Conn VS Meta-analysis of the effects of exercise interventions on functional status on older adults Res Nurs Health 2008 31 6 594 603 10.1002/nur.20290 18546240 Gu MO, Conn VS. Meta-analysis of the effects of exercise interventions on functional status on older adults. Res Nurs Health. 2008;31(6):594–603. 18546240 10.1002/nur.20290 6. Beltz S Gloystein S Litschko T Laag S van den Berg N Multivariate analysis of independent determinants of ADL/IADL and quality of life in the elderly BMC Geriatr 2022 22 1 894 10.1186/s12877-022-03621-3 36418975 PMC9682836 Beltz S, Gloystein S, Litschko T, Laag S, van den Berg N. Multivariate analysis of independent determinants of ADL/IADL and quality of life in the elderly. BMC Geriatr. 2022;22(1):894. 36418975 10.1186/s12877-022-03621-3 PMC9682836 7. Zeng Y Feng Q Hesketh T Christensen K Vaupel JW Survival, disabilities in activities of daily living, and physical and cognitive functioning among the oldest-old in China: a cohort study Lancet 2017 389 10079 1619 29 10.1016/S0140-6736(17)30548-2 28285816 PMC5406246 Zeng Y, Feng Q, Hesketh T, Christensen K, Vaupel JW. Survival, disabilities in activities of daily living, and physical and cognitive functioning among the oldest-old in China: a cohort study. Lancet. 2017;389(10079):1619–29. 28285816 10.1016/S0140-6736(17)30548-2 PMC5406246 8. Guo J Xu YS Chen SL Zhu L Impact of activities of daily living on depression in the elderly aged 60 and above in China Chin J Epidemiol 2022 43 2 213 7 10.3760/cma.j.cn112338-20210823-00667 35184487 Guo J, Xu YS, Chen SL, Zhu L. Impact of activities of daily living on depression in the elderly aged 60 and above in China. Chin J Epidemiol. 2022;43(2):213–7. 10.3760/cma.j.cn112338-20210823-00667 35184487 9. Brown RT Diaz-Ramirez LG Boscardin WJ Cappola AR Lee SJ Steinman MA Changes in the hierarchy of functional impairment from middle age to older age The Journals of Gerontology: Series A 2022 77 8 1577 84 10.1093/gerona/glab250 PMC9373945 34498040 Brown RT, Diaz-Ramirez LG, Boscardin WJ, Cappola AR, Lee SJ, Steinman MA. Changes in the hierarchy of functional impairment from middle age to older age. The Journals of Gerontology: Series A. 2022;77(8):1577–84. 10.1093/gerona/glab250 PMC9373945 34498040 10. Wu T Lu L Luo L Guo Y Ying L Tao Q Zeng H Han L Shi Z Zhao Y Factors associated with activities of daily life disability among centenarians in rural Chongqing, China: a cross-sectional study Int J Environ Res Public Health 2017 14 11 1364 10.3390/ijerph14111364 29120382 PMC5708003 Wu T, Lu L, Luo L, Guo Y, Ying L, Tao Q, et al. Factors associated with activities of daily life disability among centenarians in rural Chongqing, China: a cross-sectional study. Int J Environ Res Public Health. 2017;14(11):1364. 29120382 10.3390/ijerph14111364 PMC5708003 11. Huang L, Gao J, Mou H, Xu D, Wang K. Effects of nutrition status on activities of daily living among nursing home residents: the mediating role of physical function. Chin J Practical Nurs. 2019;(36): 132–6. 12. Witard OC McGlory C Hamilton DL Phillips SM Growing older with health and vitality: a nexus of physical activity, exercise and nutrition Biogerontology 2016 17 3 529 46 10.1007/s10522-016-9637-9 26878863 PMC4889705 Witard OC, McGlory C, Hamilton DL, Phillips SM. Growing older with health and vitality: a nexus of physical activity, exercise and nutrition. Biogerontology. 2016;17(3):529–46. 26878863 10.1007/s10522-016-9637-9 PMC4889705 13. Mugica-Errazquin I Zarrazquin I Seco-Calvo J Gil-Goikouria J Rodriguez-Larrad A Virgala J Arizaga N The nutritional status of long-term institutionalized older adults is associated with functional status, physical performance and activity, and frailty Nutrients 2021 13 11 3716 10.3390/nu13113716 34835971 PMC8619061 Mugica-Errazquin I, Zarrazquin I, Seco-Calvo J, Gil-Goikouria J, Rodriguez-Larrad A, Virgala J, Arizaga N, et al. The nutritional status of long-term institutionalized older adults is associated with functional status, physical performance and activity, and frailty. Nutrients. 2021;13(11):3716. 34835971 10.3390/nu13113716 PMC8619061 14. Tepper S Alter Sivashensky A Rivkah Shahar D Geva D Cukierman-Yaffe T The association between Mediterranean diet and the risk of falls and physical function indices in older type 2 diabetic people varies by age Nutrients 2018 10 6 767 10.3390/nu10060767 29899221 PMC6024581 Tepper S, Alter Sivashensky A, Rivkah Shahar D, Geva D, Cukierman-Yaffe T. The association between Mediterranean diet and the risk of falls and physical function indices in older type 2 diabetic people varies by age. Nutrients. 2018;10(6):767. 29899221 10.3390/nu10060767 PMC6024581 15. Assmann KE Adjibade M Andreeva VA Hercberg S Galan P Kesse-Guyot E Association between adherence to the Mediterranean diet at midlife and healthy aging in a cohort of French adults The Journals of Gerontology: Series A 2018 73 3 347 54 10.1093/gerona/glx066 28460137 Assmann KE, Adjibade M, Andreeva VA, Hercberg S, Galan P, Kesse-Guyot E. Association between adherence to the Mediterranean diet at midlife and healthy aging in a cohort of French adults. The Journals of Gerontology: Series A. 2018;73(3):347–54. 10.1093/gerona/glx066 28460137 16. Kramer CS Groenendijk I Beers S Wijnen HH van de Rest O de Groot LCPGM The association between malnutrition and physical performance in older adults: a systematic review and meta-analysis of observational studies Curr Developments Nutr 2022 6 4 nzac007 10.1093/cdn/nzac007 PMC8989279 35415390 Kramer CS, Groenendijk I, Beers S, Wijnen HH, van de Rest O, de Groot LCPGM. The association between malnutrition and physical performance in older adults: a systematic review and meta-analysis of observational studies. Curr Developments Nutr. 2022;6(4):nzac007. 10.1093/cdn/nzac007 PMC8989279 35415390 17. Song Y Liu M Jia WP Han K Wang SS He Y The association between nutritional status and functional limitations among centenarians: a cross-sectional study BMC Geriatr 2021 21 1 376 10.1186/s12877-021-02312-9 34154543 PMC8218470 Song Y, Liu M, Jia WP, Han K, Wang SS, He Y. The association between nutritional status and functional limitations among centenarians: a cross-sectional study. BMC Geriatr. 2021;21(1):376. 34154543 10.1186/s12877-021-02312-9 PMC8218470 18. Silk KJ Sherry J Winn B Keesecker N Horodynski MA Sayir A Increasing nutrition literacy: testing the effectiveness of print, web site, and game modalities J Nutr Educ Behav 2008 40 1 3 10 10.1016/j.jneb.2007.08.012 18174098 Silk KJ, Sherry J, Winn B, Keesecker N, Horodynski MA, Sayir A. Increasing nutrition literacy: testing the effectiveness of print, web site, and game modalities. J Nutr Educ Behav. 2008;40(1):3–10. 18174098 10.1016/j.jneb.2007.08.012 19. Zoellner J Connell C Bounds W Crook L Yadrick K Nutrition literacy status and preferred nutrition communication channels among adults in the lower Mississippi delta Prev Chronic Dis 2009 6 4 A128 19755004 PMC2774642 Zoellner J, Connell C, Bounds W, Crook L, Yadrick K. Nutrition literacy status and preferred nutrition communication channels among adults in the lower Mississippi delta. Prev Chronic Dis. 2009;6(4):A128. 19755004 PMC2774642 20. Spronk I Kullen C Burdon C O’Connor H Relationship between nutrition knowledge and dietary intake Br JNutr. 2014 111 10 1713 1726 24621991 10.1017/S0007114514000087 Spronk I, Kullen C, Burdon C, O’Connor H. Relationship between nutrition knowledge and dietary intake. Br JNutr. 2014;111(10):1713–26. 24621991 10.1017/S0007114514000087 21. Yang L Cui Y Du J Liu Z Duan Y Qi Q Association between nutritional literacy and nutrition label use in Chinese community residents Front Nutr 2024 11 1380310 10.3389/fnut.2024.1380310 38993238 PMC11236719 Yang L, Cui Y, Du J, Liu Z, Duan Y, Qi Q, et al. Association between nutritional literacy and nutrition label use in Chinese community residents. Front Nutr. 2024;11:1380310. 38993238 10.3389/fnut.2024.1380310 PMC11236719 22. Taylor MK Sullivan DK Ellerbeck EF Gajewski BJ Gibbs HD Nutrition literacy predicts adherence to healthy/unhealthy diet patterns in adults with a nutrition-related chronic condition Public Health Nutr 2019 22 12 2157 69 10.1017/S1368980019001289 31146797 PMC6827561 Taylor MK, Sullivan DK, Ellerbeck EF, Gajewski BJ, Gibbs HD. Nutrition literacy predicts adherence to healthy/unhealthy diet patterns in adults with a nutrition-related chronic condition. Public Health Nutr. 2019;22(12):2157–69. 31146797 10.1017/S1368980019001289 PMC6827561 23. Qi Q Sun Q Yang L Cui Y Du J Liu H High nutrition literacy linked with low frequency of take-out food consumption in Chinese college students BMC Public Health 2023 23 1 1132 10.1186/s12889-023-16078-9 37312097 PMC10262486 Qi Q, Sun Q, Yang L, Cui Y, Du J, Liu H. High nutrition literacy linked with low frequency of take-out food consumption in Chinese college students. BMC Public Health. 2023;23(1):1132. 37312097 10.1186/s12889-023-16078-9 PMC10262486 24. Velpini B Vaccaro G Vettori V Lorini C Bonaccorsi G What is the impact of nutrition literacy interventions on children’s food habits and nutrition security? A scoping review of the literature Int J Environ Res Public Health 2022 19 7 3839 10.3390/ijerph19073839 35409523 PMC8997863 Velpini B, Vaccaro G, Vettori V, Lorini C, Bonaccorsi G. What is the impact of nutrition literacy interventions on children’s food habits and nutrition security? A scoping review of the literature. Int J Environ Res Public Health. 2022;19(7):3839. 35409523 10.3390/ijerph19073839 PMC8997863 25. Tang S Li X Wang M Sha L Nutrition literacy mediates the relationship between self-efficacy and eating behavior in young tuberculosis patients: a cross-sectional study Prev Med Rep 2023 33 102187 10.1016/j.pmedr.2023.102187 37223557 PMC10201870 Tang S, Li X, Wang M, Sha L. Nutrition literacy mediates the relationship between self-efficacy and eating behavior in young tuberculosis patients: a cross-sectional study. Prev Med Rep. 2023;33:102187. 37223557 10.1016/j.pmedr.2023.102187 PMC10201870 26. Agbozo F Amardi-Mfoafo J Dwase H Ellahi B Nutrition knowledge, dietary patterns and anthropometric indices of older persons in four peri-urban communities in Ga West municipality, Ghana Afr Health Sci 2018 18 3 743 55 10.4314/ahs.v18i3.33 30603008 PMC6307008 Agbozo F, Amardi-Mfoafo J, Dwase H, Ellahi B. Nutrition knowledge, dietary patterns and anthropometric indices of older persons in four peri-urban communities in Ga West municipality, Ghana. Afr Health Sci. 2018;18(3):743–55. 30603008 10.4314/ahs.v18i3.33 PMC6307008 27. Du J Cui Y Yang L Sun Y Tian X Hu X Liu H Associations between nutrition literacy and possible sarcopenia among older adults in Bengbu, China Br J Nutr 2024 132 10 1377 85 10.1017/S000711452400268X 39494602 Du J, Cui Y, Yang L, Sun Y, Tian X, Hu X, et al. Associations between nutrition literacy and possible sarcopenia among older adults in Bengbu, China. Br J Nutr. 2024;132(10):1377–85. 39494602 10.1017/S000711452400268X 28. Zhang Y Sun Q Zhang M Mo G Liu H Nutrition literacy measurement tool with multiple features for Chinese adults Food Nutr Bull 2022 43 2 189 200 10.1177/03795721211073221 35021916 Zhang Y, Sun Q, Zhang M, Mo G, Liu H. Nutrition literacy measurement tool with multiple features for Chinese adults. Food Nutr Bull. 2022;43(2):189–200. 35021916 10.1177/03795721211073221 29. Mo G Han S Gao T Sun Q Zhang M Liu H Development and validation of a novel short-form nutrition literacy measurement tool for Chinese college students Front Public Health 2022 10 962371 10.3389/fpubh.2022.962371 36159278 PMC9500412 Mo G, Han S, Gao T, Sun Q, Zhang M, Liu H. Development and validation of a novel short-form nutrition literacy measurement tool for Chinese college students. Front Public Health. 2022;10:962371. 36159278 10.3389/fpubh.2022.962371 PMC9500412 30. Katz S Ford AB Moskowitz RW Jackson BA Jaffe MW Studies of illness in the aged: the index of ADL: a standardized measure of biological and psychosocial function JAMA 1963 185 12 914 9 10.1001/jama.1963.03060120024016 14044222 Katz S, Ford AB, Moskowitz RW, Jackson BA, Jaffe MW. Studies of illness in the aged: the index of ADL: a standardized measure of biological and psychosocial function. JAMA. 1963;185(12):914–9. 14044222 10.1001/jama.1963.03060120024016 31. Lawton MP Brody EM Assessment of older people: self-maintaining and instrumental activities of daily living Gerontologist 1969 9 3 179 86 10.1093/geront/9.3_Part_1.179 5349366 Lawton MP, Brody EM. Assessment of older people: self-maintaining and instrumental activities of daily living. Gerontologist. 1969;9(3):179–86. 5349366 32. Kalnins A Multicollinearity. How common factors cause type 1 errors in multivariate regression Strateg Manag J 2018 39 2362 85 10.1002/smj.2783 Kalnins A. Multicollinearity. How common factors cause type 1 errors in multivariate regression. Strateg Manag J. 2018;39:2362–85. 33. Wang S Yang Y Hu R Long H Wang N Wang Q Mao Z Trends and associated factors of dietary knowledge among Chinese older residents: results from the China health and nutrition survey 2004–2015 Int J Environ Res Public Health 2020 17 21 8029 10.3390/ijerph17218029 33142725 PMC7662652 Wang S, Yang Y, Hu R, Long H, Wang N, Wang Q, et al. Trends and associated factors of dietary knowledge among Chinese older residents: results from the China health and nutrition survey 2004–2015. Int J Environ Res Public Health. 2020;17(21):8029. 33142725 10.3390/ijerph17218029 PMC7662652 34. Zhu W Xu Y Wang J Zhang Z Xu M Li M Conceptual framework of nutrition literacy and its applicablity Acta Nutrimenta Sinica 2022 44 3 213 7 Zhu W, Xu Y, Wang J, Zhang Z, Xu M, Li M, et al. Conceptual framework of nutrition literacy and its applicablity. Acta Nutrimenta Sinica. 2022;44(3):213–7. 35. Jing Liu W Xu J Zhu M Xiao Q Zhao The status and influencing factors of malnutrition among the institutionalized elderly J Nurs Sci 2022 37 3 97 100 Jing Liu W, Xu J, Zhu M, Xiao Q, Zhao. The status and influencing factors of malnutrition among the institutionalized elderly. J Nurs Sci. 2022;37(3):97–100. 36. Danielewicz AL Barbosa AR Del Duca GF Nutritional status, physical performance and functional capacity in an elderly population in southern Brazil Rev Assoc Med Bras (1992) 2014 60 3 242 248 10.1590/1806-9282.60.03.0013 25004270 Danielewicz AL, Barbosa AR, Del Duca GF. Nutritional status, physical performance and functional capacity in an elderly population in southern Brazil. Rev Assoc Med Bras (1992). 2014;60(3):242–8. 25004270 10.1590/1806-9282.60.03.0013 37. Kalkan I The impact of nutrition literacy on the food habits among young adults in Turkey Nutr Res Pract 2019 13 4 352 7 10.4162/nrp.2019.13.4.352 31388412 PMC6669071 Kalkan I. The impact of nutrition literacy on the food habits among young adults in Turkey. Nutr Res Pract. 2019;13(4):352–7. 31388412 10.4162/nrp.2019.13.4.352 PMC6669071 38. Li Q Wu C Social interaction, lifestyle, and depressive status: mediators in the longitudinal relationship between cognitive function and instrumental activities of daily living disability among older adults Int J Environ Res Public Health 2022 19 7 4235 10.3390/ijerph19074235 35409918 PMC8998450 Li Q, Wu C. Social interaction, lifestyle, and depressive status: mediators in the longitudinal relationship between cognitive function and instrumental activities of daily living disability among older adults. Int J Environ Res Public Health. 2022;19(7):4235. 35409918 10.3390/ijerph19074235 PMC8998450 39. Wilson MD Ramírez AS Arsenault JE Miller LMS Nutrition label use and its association with dietary quality among latinos: the roles of poverty and acculturation J Nutr Educ Behav 2018 50 9 876 87 10.1016/j.jneb.2018.05.019 30297015 PMC6181580 Wilson MD, Ramírez AS, Arsenault JE, Miller LMS. Nutrition label use and its association with dietary quality among latinos: the roles of poverty and acculturation. J Nutr Educ Behav. 2018;50(9):876–87. 30297015 10.1016/j.jneb.2018.05.019 PMC6181580 40. LeBlanc J Ward S LeBlanc CP The association between adolescents’ food literacy, vegetable and fruit consumption, and other eating behaviors Health Educ Behav 2022 49 4 603 12 10.1177/10901981221086943 35373626 PMC9350450 LeBlanc J, Ward S, LeBlanc CP. The association between adolescents’ food literacy, vegetable and fruit consumption, and other eating behaviors. Health Educ Behav. 2022;49(4):603–12. 35373626 10.1177/10901981221086943 PMC9350450 41. Harleli H Irma Fithria F Zainuddin A Penyuluhan Gizi Tentang Peningkatan Kualitas Hidup Pada Lansia Melalui Penerapan Pola Hidup Sehat Jurnal Pengabdian Meambo 2022 1 1 22 7 10.56742/jpm.v1i1.4 Harleli H, Irma Fithria F, Zainuddin A. Penyuluhan Gizi Tentang Peningkatan Kualitas Hidup Pada Lansia Melalui Penerapan Pola Hidup Sehat. Jurnal Pengabdian Meambo. 2022;1(1):22–7. 42. Wu SY Cheng YY Chang HY Wang PH Hsieh IC Yeh NH Efficacy of dietary intervention with group activities on dietary intakes, frailty status, and working memory: a cluster-randomized controlled trial in community strongholds Nutrients 2023 15 8 1976 10.3390/nu15081976 37111195 PMC10146965 Wu SY, Cheng YY, Chang HY, Wang PH, Hsieh IC, Yeh NH, et al. Efficacy of dietary intervention with group activities on dietary intakes, frailty status, and working memory: a cluster-randomized controlled trial in community strongholds. Nutrients. 2023;15(8):1976. 37111195 10.3390/nu15081976 PMC10146965 43. Makizako H Shimada H Doi T Tsutsumimoto K Lee S Lee SC Age-dependent changes in physical performance and body composition in community-dwelling Japanese older adults J Cachexia Sarcopenia Muscle 2017 8 4 607 14 10.1002/jcsm.12197 28597612 PMC5566639 Makizako H, Shimada H, Doi T, Tsutsumimoto K, Lee S, Lee SC, et al. Age-dependent changes in physical performance and body composition in community-dwelling Japanese older adults. J Cachexia Sarcopenia Muscle. 2017;8(4):607–14. 28597612 10.1002/jcsm.12197 PMC5566639 44. Rongdongqing Shi X, Wang H, Guo K, Chen C, Qi L, Zhou. Investigation and analysis of nutrition literacy of urban and rural residents in Anhui Province. J Bengbu Med Coll (05).2023;641–5. 45. Xu X Yang L Miao X Hu X An investigation and analysis of the activities of daily living of older adults living at home in Ningxia Hui autonomous region of China: a cross-sectional study BMC Geriatr 2020 20 1 369 10.1186/s12877-020-01765-8 32977753 PMC7519571 Xu X, Yang L, Miao X, Hu X. An investigation and analysis of the activities of daily living of older adults living at home in Ningxia Hui autonomous region of China: a cross-sectional study. BMC Geriatr. 2020;20(1):369. 32977753 10.1186/s12877-020-01765-8 PMC7519571 46. Aihemaitijiang S Ye C Halimulati M Huang X Wang R Zhang Z Development and validation of nutrition literacy questionnaire for the Chinese elderly Nutrients 2022 14 5 1005 10.3390/nu14051005 35267979 PMC8912634 Aihemaitijiang S, Ye C, Halimulati M, Huang X, Wang R, Zhang Z. Development and validation of nutrition literacy questionnaire for the Chinese elderly. Nutrients. 2022;14(5):1005. 35267979 10.3390/nu14051005 PMC8912634 47. Espinoza SE Quiben M Hazuda HP Distinguishing comorbidity, disability, and frailty Curr Geriatr Rep 2018 7 4 201 9 10.1007/s13670-018-0254-0 30984516 PMC6457658 Espinoza SE, Quiben M, Hazuda HP. Distinguishing comorbidity, disability, and frailty. Curr Geriatr Rep. 2018;7(4):201–9. 30984516 10.1007/s13670-018-0254-0 PMC6457658 48. Zhiping Du Q Wang Y Li J Lv S Feng Y Bao Associations between chronic diseases and activities of daily living of elderly in lu’an urban and rural communities Acta Universitatis Medicinalis Anhui 2020 55 11 1758 62 Zhiping Du Q, Wang Y, Li J, Lv S, Feng Y, Bao, et al. Associations between chronic diseases and activities of daily living of elderly in lu’an urban and rural communities. Acta Universitatis Medicinalis Anhui. 2020;55(11):1758–62. ",
  "metadata": {
    "Title of this paper": "Associations between chronic diseases and activities of daily living of elderly in lu’an urban and rural communities",
    "Journal it was published in:": "BMC Geriatrics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482861/"
  }
}