{
  "title": "Paper_356",
  "abstract": "pmc BMC Cancer BMC Cancer 16 bmccanc BMC Cancer 1471-2407 BMC PMC12487351 PMC12487351.1 12487351 12487351 41034771 10.1186/s12885-025-14791-9 14791 1 Research Real-world management strategies and clinical outcomes of metastatic HER2-positive breast cancer in Greece in the second-line setting and beyond (the togetHER study) Korantzis Ippokratis 1 Koumarianou Anna 2 Rapti Vassiliki 3 Timotheadou Eleni 4 Christodoulou Christos 5 Tryfonopoulos Dimitrios 6 Karageorgopoulou Sofia 7 Boukovinas Ioannis 8 Zagouri Flora 9 Nikolaidi Adamantia 10 Papazisis Konstantinos 11 Razis Evangelia 12 Barbounis Vasileios 13 Christopoulou Athina 14 Mavroudis Dimitrios 15 Georgoulias Vassilios 16 Kesisis Georgios 17 Papadopoulos Emmanuel I. manos.papadopoulos@astrazeneca.com 18 Michalea Rozalia 18 Ardavanis Alexandros 19 1 2 https://ror.org/04gnjpq42 grid.5216.0 0000 0001 2155 0800 Hematology Oncology Unit, Fourth Department of Internal Medicine, Attikon University Hospital, National and Kapodistrian University of Athens, 3 https://ror.org/03qv5tx95 grid.413693.a 0000 0004 0622 4953 Oncology Department, Hygeia Hospital, 4 https://ror.org/02j61yw88 grid.4793.9 0000 0001 0945 7005 Department of Medical Oncology, Papageorgiou Hospital, School of Medicine, Aristotle University of Thessaloniki, 5 https://ror.org/05a3efx98 grid.415451.0 0000 0004 0622 6078 Second Department of Medical Oncology, Metropolitan Hospital, 6 7 8 9 https://ror.org/04gnjpq42 grid.5216.0 0000 0001 2155 0800 Department of Clinical Therapeutics, National and Kapodistrian University of Athens, Alexandra Hospital, 10 https://ror.org/02mgwph26 grid.452556.5 0000 0004 0622 4590 Oncology Department, Mitera Hospital, 11 https://ror.org/015aet155 grid.434438.c Oncology Department, Euromedica General Clinic, 12 https://ror.org/03qv5tx95 grid.413693.a 0000 0004 0622 4953 Third Department of Medical Oncology, Hygeia Hospital, 13 14 https://ror.org/03c3d1v10 grid.412458.e Oncology Unit, ST Andrews General Hospital of Patras, 15 https://ror.org/00dr28g20 grid.8127.c 0000 0004 0576 3437 Department of Medical Oncology, University Hospital of Heraklion and Medical School, University of Crete, 16 https://ror.org/02dvs1389 grid.411565.2 0000 0004 0621 2848 First Department of Medical Oncology, Metropolitan General Hospital of Athens, 17 18 19 https://ror.org/036h9st94 grid.416564.4 First Department of Medical Oncology, Saint Savvas Hospital, 1 10 2025 2025 25 478185 1473 24 1 2024 1 8 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background In the realm of HER2-positive (HER2+) metastatic breast cancer (MBC), the advent of targeted therapies, notably trastuzumab and pertuzumab, represents a substantial advancement in enhancing patient outcomes. However, the intricacies of treatment escalate when patients encounter progression or resistance during first-line (1L) therapy. The togetHER study aimed to elucidate real-world insights into the profile, management strategies, and outcomes for HER2+ MBC patients initiating second-line treatment (2LT) in Greece, predating recent international guideline changes incorporating trastuzumab deruxtecan and tucatinib in the second line and beyond lines of treatments. Methods Data from adult female patients with HER2+ MBC who had initiated 2LT between 01-Jan-2015 and 31-Dec-2018 in 18 oncology departments across Greece were retrospectively abstracted through medical chart review. Results The eligible population comprised 122 patients, 68.0% of whom presented with recurrent MBC. Among the latter, 26.5% were tested for HER2 both in early and metastatic settings with 27.3% of them changing HER2 status from negative to positive. Retesting of HER2 expression following 2LT initiation was recorded in 8 cases. At 2LT initiation, patients’ median age was 57.0 years and 63.6% were hormone receptor-positive. The most common metastatic sites were bone (56.6%), lung (44.3%), liver (41.0%), and brain (29.5%). Anti-HER2 agent usage in 1L and 2L stood at 91.8% and 92.6%, respectively, with rates slightly diminishing in third (3L) (85.9%) and fourth line (4L) (82.4%). Endocrine therapy administration was generally low across treatment lines (12.3%, 9.9%, and 5.9%, in 2L, 3L, and 4L respectively), while chemotherapy use increased from 30.3% in 2L to 47.9% and 47.1% to 3L and 4L, correspondingly. Median progression-free survival (PFS) for 2L, 3L, and 4L was 7.7 [95% confidence interval (CI) 6.0–14.4], 6.4 (95% CI 5.4–7.1), and 5.6 (95% CI 2.6–9.0) months, respectively, while median overall survival was 25.0 (95% CI 20.5–34.4) months. Conclusions Although the 2LT pattern in Greece generally aligned with guidelines, persistently poor treatment outcomes underscore a significant unmet medical need for these patients. Supplementary Information The online version contains supplementary material available at 10.1186/s12885-025-14791-9. Keywords Anti-HER2 Metastatic breast cancer OS PFS Real-world Treatment patterns AstraZeneca Greece pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Breast cancer (BC) ranks as the most prevalent cancer and the primary cause of cancer-related mortality in women globally [ 1 2 3 4 4 5 6 In the realm of HER2+ MBC, the advent of anti-HER2 targeted therapies, particularly the addition of pertuzumab to trastuzumab, has marked a significant stride in improving patient outcomes in the first-line (1L) setting [ 7 8 9 After nearly 8 years of limited therapeutic progress in HER2+ MBC, marked by a well-established 1L treatment algorithm and an unmet need for effective 2L, third-line (3L), and subsequent regimens, recent advancements have ushered in a paradigm shift in disease management. The updated international guidelines continue to endorse the standard of care (SoC) for 1L treatment (1LT) involving two anti-HER2 monoclonal antibodies (mAb), trastuzumab, and pertuzumab, alongside chemotherapy (ChT). However, the antibody–drug conjugate (ADC) trastuzumab emtansine (T-DM1) is no longer recommended in 2L [ 10 13 14 15 16 17 18 11 12 Given the dearth of local routine care evidence in the 2L HER2+ MBC setting and beyond, our study aims to characterize the real-world patient profile and changing disease characteristics, as well as unravel physicians’ testing and treatment strategies along with their adherence to international guidelines. Our investigation specifically focuses on the 2–L setting, where significant amendments have recently transpired with novel agents providing better patient outcomes in randomized clinical trials but simultaneously impacting healthcare systems, thus mandating evidence generation on real-world outcomes of patients treated with the until recently recommended regimens. Materials and methods Study design and population The togetHER study was a non-interventional, single-country, multicenter, retrospective chart review study of HER2+ MBC patients that initiated 2LT between 01 January 2015 and 31 December 2018 (‘index period’). The ending cut-off date, which served as the latest permissible date for 2LT initiation, aimed to ensure a minimum 30-month observation period to enable the assessment of the clinical outcomes of interest in line with the median OS value expected with the best available 2LT during study period [ 8 Medical charts were reviewed and assessed through a process of consecutive sampling that followed reverse chronological order based on 2LT initiation date. Patients who had initiated 2LT, within the index period were further assessed for inclusion against the study-specific eligibility criteria. Eligible patients who attended the study sites within the context of a routine clinical visit during the accrual period were also considered for inclusion in the study. Eligible patients were women diagnosed with de novo or recurrent HER2+ (IHC3+ or IHC2+/ISH+) MBC who had initiated 2LT during the index period, and aged ≥ 18 years at the time of MBC diagnosis. Patients were excluded if they had another primary malignancy that required anticancer treatment as of MBC diagnosis and throughout the study observation period. The study was designed, conducted and reported in accordance with the ethical principles laid down in the Declaration of Helsinki, the Guidelines for Good Pharmacoepidemiology Practice of the International Society for Pharmacoepidemiology, the STROBE (Strengthening the Reporting of Observational Studies in Epidemiology) guidelines where applicable, the European Union General Data Protection Regulation, and the local rules and regulations. The local institutional review board and ethics committee approved the study in all participating centers. All patients provided written informed consent for collecting and processing their medical data, whereas for deceased patients, the institutional review board of each site granted a relative waiver of consent. Study objectives, variables and definitions Clinical parameters for each patient were collected from the date of initial BC diagnosis and ended on the earliest date of either informed consent or death, as applicable. The primary objectives of this study were to capture patient demographic and clinical characteristics as well as the systemic treatment and sequencing patterns employed 2/3/4LT of HER2+ MBC. Treatment line was defined as the sequence of all anticancer therapies (monotherapies or combinations), including those administered in the maintenance setting, initiated after discontinuation of the previous line regimen until the date of switch to another regimen due to disease progression or other reason (or until chart abstraction initiation, if the patient’s 2L therapy was ongoing at the time of chart abstraction initiation). Systemic treatments for MBC were collected and analyzed in terms of pharmacological categories and drug classes based on the 4th level of chemical subgroup of the World Health Organization Collaborating Centre for Drug Statistics—Anatomical Therapeutic Chemical (WHOCC-ATC) classification system [ 19 Secondary objectives included real-world PFS (rw-PFS) in 2/3/4L, defined as the time from 2/3/4L treatment initiation to the earliest date of the first documentation of real-world (radiological or clinical) progression (rwP) or death due to any cause, rw-PFS2 proportionally defined as the time from 2LT initiation until rwP or all-cause death among 2L patients who had advanced to 3LT, and OS estimated from 2LT initiation until death due to any cause. Time to treatment discontinuation or all-cause death (TTD) in 2/3/4L and time to first subsequent therapy or all-cause death (TFST) after the start of 2/3/4LT were respectively estimated as exploratory endpoints. Secondary and exploratory endpoints were also assessed per most prevalent 2/3/4LT regimens and HR status, wherever deemed appropriate based on subgroup size. Employed anti-HER2 mAb treatment strategy served as the grouping factor across all subanalyses conducted with patients being classified into the groups of ‘Single anti-HER2 mAb alone’ ‘Single anti-HER2 mAb other’ ‘Dual anti-HER2 mAb other’ ‘Other (not containing anti-HER2 mAb)’ Sample size determination Based on feasibility projections, the study initially forecasted to include 200 eligible patients; this sample size was considered sufficient for estimating the primary outcomes with a margin of error not exceeding 7.1% [95% confidence intervals (CIs) using the Clopper-Pearson exact method between 42.9% and 57.1%], corresponding to the estimation of a frequency of 50% where the width of the CI is biggest, while respective estimates for any subpopulation representing at least 50% of the overall population (i.e., 100 patients) could be determined with a margin of error of 10.2%. As a result of lower than planned accrual rate during the conduct of the study, the initial forecast of 200 patients was revisited and set at a minimum of 100 patients in line with the initial above assumption. The sample size determination was performed using the statistical software package SAS v9.4 (SAS Institute, Cary, NC, USA). Statistical analysis Collected data were mainly analyzed by applying descriptive statistics. Inferential statistics were used for the calculation of the Clopper-Pearson binomial 95% CIs. Absolute and relative frequencies were estimated for all categorical variables. For continuous variables, the normality of distribution was firstly examined using the Shapiro–Wilk test, and depending on the outcome of the test data are presented either as mean (standard deviation; SD) for normally distributed data, or median (interquartile range; IQR) for data not meeting the normality criteria. Time-to-event analyses were performed using the Kaplan–Meier method. All statistical tests were conducted two-sided with the level of significance set at 0.05. Statistical analyses were performed using SAS® software Version 9.4 (SAS Institute Inc., Cary, NC, USA). Results Patient disposition Over an 8.7-month accrual period from September 28, 2021 (first patient in) to June 20, 2022 (last patient in), 128 patients were consecutively included in the study by oncologists practicing in 18 hospital departments across 4 Greek geographic regions. Six patients did not meet eligibility criteria and were excluded from the analyses (Fig. 1 Fig. 1 Patient disposition in the study and vital status at study inclusion. a b Abbreviations At the time of inclusion, 71.3% of patients (87/122) were deceased (Fig. 1 1 1 Table 1 Patient and disease characteristics at initial diagnosis and at 2LT initiation Characteristic Full analysis set (N = 122) Caucasian, % (n/N) 99.2% (120/121) a Age at initial BC diagnosis (N = 122), median (IQR), years 51.5 (43.0–61.0) Age at metastatic BC diagnosis (N = 122), median (IQR), years 55.0 (46.0–65.0) Time from initial to metastatic BC diagnosis (N = 122), median (IQR), months 24.1 (0.0–49.5) Primary tumor characteristics, % (n/N) Unilateral primary tumor localization 96.7 (118/122) Pure ductal histology 90.1 (100/111) Grade 1/2 tumor 42.3 (41/97) Grade 3 tumor 57.7 (56/97) De novo metastatic disease, % (n/N) 32.0 (39/122) Postmenopausal status at MBC diagnosis, % (n/N) 66.7 (72/108) Oligometastatic disease at first presentation with distant disease, % (n/N) 46.4 (52/112) Sites of first presentation of distant disease (in > 10% of the patients), % (n/N) Bone 50.8 (62/122) Liver 39.3 (48/122) Lung 29.5 (36/122) Brain 13.1 (16/122) Other b 31.1 (38/122) Time from MBC diagnosis to 2LT initiation (N = 122), median (IQR), months 15.7 (9.9–26.0) Age at 2LT initiation (N = 122), median (IQR) years 57.0 (47.0–67.0) Age < 65 years, % (n/N) 71.3 (87/122) BMI at 2LT initiation (N = 66), median (IQR) kg/m 2 25.4 (22.4–28.6) Obese (BMI ≥ 30), % (n/N) 19.7 (13/66) Most common metastatic sites at 2LT initiation (in > 10% of the patients), % (n/N) Bone 56.6 (69/122) Lung 44.3 (54/122) Liver 41.0 (50/122) Brain 29.5 (36/122) Lung and/or liver 64.8 (79/122) ECOG PS at 2LT initiation, % (n/N) ECOG PS 0 65.4 (68/104) ECOG PS 1 24.0 (25/104) ECOG PS 2/3 c 10.6 (11/104) 2LT, second-line treatment; BC, breast cancer; BMI, body mass index; ECOG, Eastern cooperative oncology group; HER2, human epidermal growth factor receptor 2; HR, hormone receptor; IHC, immunohistochemistry; IQR, interquartile range; MBC, metastatic breast cancer; N, number of patients with available data; n, number of patients with indicated characteristics; PS, performance status a b c d e Diagnostic testing patterns Information on estrogen receptor (ER), progesterone receptor (PgR), and HER2 status assessments and positivity rates are presented in Fig. 2 2 Fig. 2 HR and HER2 status before 2LT initiation for MBC. a b a b Abbreviations For six patients out of the 22 (27.3%) with rMBC who were retested for HER2 in the metastatic setting, HER2 status changed from negative to positive as shown in Fig. 5 2 2 Table 2 HR and HER2 status retesting rates in HER2-positive MBC patients initiating 2LT, 3LT and 4LT n (%) Prior to 2LT a After 2LT and prior to 3LT After 3LT and prior to 4LT Any HR/HER2 re-testing 22 (26.5%) 4 (5.6%) b 4 (11.8%) c ER re-testing 21 (25.3%) 4 (5.6%) 4 (11.8%) Same result 19 (90.5%) 3 (75.0%) 4 (100.0%) Positive 12 (57.1%) 2 (50.0%) 4 (100.0%) c Negative 7 (33.3%) 1 (25.0%) – Different results 2 (9.5%) 1 (25.0%) – Negative → Positive 1 (4.8%) – – Positive → Negative 1 (4.8%) 1 (25.0%) – PgR re-testing 20 (24.1%) 4 (5.6%) 4 (11.8%) Same results 14 (70.0%) 3 (75.0%) 4 (100.0%) Negative 8 (40.0%) 1 (25.0%) Positive 6 (30.0%) 2 (50.0%) 4 (100.0%) c Different results 6 (30.0%) 1 (25.0%) – Negative → Positive 4 (20.0%) – – Positive → Negative 2 (10.0%) 1 (25.0%) – HER2 re-testing 22 (26.5%) 4 (5.6%) 4 (11.8%) Same results 16 (72.7%) 2 (50.0%) 2 (50.0%) Positive 16 (72.7%) 2 (50.0%) 2 (50.0%) Different results 6 (27.3%) d 2 (50.0%) 2 (50.0%) Negative → Positive 6 (27.3%) 1 (25.0%) 1 (25.0%) Positive → Negative – 1 (25.0%) 1 (25.0%) Bold indicates the primary category title 2/3/4LT, second-/third-/fourth-line treatment; ER, estrogen receptor; HER2, human epidermal growth factor receptor 2; HR, hormone receptor; MBC, metastatic breast cancer; N, total number of patients; n, number of patients with indicated characteristics; PgR, progesterone receptor a b c d Course of metastatic disease As shown in Table 1 Treatments Among HER2+ MBC patients initiating 2LT, the median (IQR) length of 1LT was 10.9 (5.6–19.4) months with 91.8% (112/122) having received anti-HER2 agents. The reason for 1LT discontinuation was disease progression in 84.4% (103/122), other than progression in 13.1% (16/122), and unknown for three patients (2.5%). A median (IQR) of 15.7 (9.9–26.0) months and 27.0 (21.0–51.0) days had elapsed from MBC diagnosis and 1LT end date until 2LT initiation. In the 2L, the majority of patients (92.6%;113/122) were treated with anti-HER2 agents comprising anti-HER2 mAb (89.3%;109/122) or HER2 TKI (8.2%;10/122), either alone or in combination with other treatment (Fig. 3 S1 single anti-HER2 mAb alone 3 S2 ‘Single anti-HER2 mAb other’ 3 S1 S1 S2 Fig. 3 Treatments for HER2+ MBC in terms of pharmacological categories, per line of treatment. a b Abbreviations Efficacy outcomes In 2L setting, the median rw-PFS was 7.7 (95% CI 6.0–14.4) months (Fig. 4 S2 single anti-HER2 mAb alone’ 4 4 4 4 S2 4 2 5 Fig. 4 KM-estimated rw-PFS, rw-PFS2 and OS in HER2-positive MBC patients initiating 2LT. a b c d e f Abbreviations Fig. 5 Swimmer plot showing individual patient characteristics with respect to HER2 retesting, treatment type, and disease progression for patients who underwent HER2 retesting and had different results. *Treatment was discontinued for reason other than PD or unknown reason. **This patient underwent 5 different HER2 testings after initiation of 2LT but only 2 are shown in the plot: an uncertain result was obtained ~ 12 months after 2LT initiation, which was followed by a negative result after 15 days (the latter is shown on the plot) and the next result was ~ 6 months later which was uncertain (not shown on the plot) and was followed by 2 negative results after 6 days, both on the same day (the latter are shown on the plot as one timepoint). ***Start date and end date of 2LT was the same. For this patient, death without PD was recorded Discussion The present study provides a robust dataset of 122 HER2+ MBC patients having initiated 2LT in a routine care setting in Greece between January 2015 and December 2018, a period which precedes recent changes in international guidelines [ 10 13 20 32 33 20 32 11 34 38 In reference to treatment strategies, our data demonstrated high utilization rate of anti-HER2 agents in 1L and 2L (91.8% and 92.6%, correspondingly), with the respective rates remaining high but slightly dropping in 3L (85.9%) and 4L (82.4%). These results are consistent with clinical evidence and guidelines suggesting that maintaining HER2 suppression throughout the course of disease can be beneficial [ 11 12 39 20 29 40 42 8 43 15 20 22 24 28 30 32 41 44 Our study has a number of limitations inherent to its observational design, including patient selection and information bias. Interpretation of study outcomes should also take into consideration that as this was a real-world study aiming to capture routine practice paradigms, no specific response assessment criteria were used thus PFS was not standardized. Nevertheless, TFST and TTD analyses were also provided, showing relatively consistent results. Lastly, although the actual sample size of 122 was lower than originally planned, the margin of error generated for the frequencies of interest in the 2L setting did not exceed 9% across treatment regimens and patterns, which represents an acceptable level of precision. On the other hand, the small sample sizes of the subgroups of interest in the 2-4L settings may have adversely affected the precision of outcomes. Conclusions Real-world data documented herein show that treatment strategies applied in Greece for HER2+ MBC, during the era which preceded recent guidelines revision for 2LT and beyond, were mostly in line with evidence-based recommendations. Nevertheless, treatment outcomes remained poor revealing a significant unmet medical need in these patients and underscoring the importance of expanding the treatment arsenal with novel therapeutic strategies. Furthermore, analysis of disease characteristics confirmed the dynamic nature of HER2 expression and the high prevalence of brain metastases. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable Author contributions All authors contributed to the study design. Data collection and analysis were performed by I.K., A.K., V.R., E.T., C.C., D.T., S.K., I.B., F.Z., A.N., K.P, E.R., V.B., A.C., D.M., V.G., G.K., and A.A. E.I. P. conceived of the study concept. The first draft of the manuscript was written by E. I. P. and R. M. and all authors commented on previous versions of the manuscript. All authors read and approved the final manuscript. Funding This research and the article processing fee was funded by AstraZeneca Greece. Data availability The datasets generated and/or analysed during the current study are not publicly available due to legal and ethical restrictions related to patient data but are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate The present study was designed, conducted and reported in accordance with the ethical principles laid down in the Declaration of Helsinki, the Guidelines for Good Pharmacoepidemiology Practice of the International Society for Pharmacoepidemiology, the STROBE (Strengthening the Reporting of Observational Studies in Epidemiology) guidelines where applicable, the EU General Data Protection Regulation, and the local rules and regulations. In compliance with the latter, the final protocol of this Observational Study, including the final version of the Subject ICF, along with any amendments have been approved in writing by the Institutional Review Board of each participating hospital. National Ethics Committee (NEC) approval was waived based on local legislation. Informed consent was obtained from all individual participants included in the study except for deceased patients for whom a waiver of consent has been granted by the Institutional Review Board of each study site. Consent for publication Not applicable. Competing interests Ippokratis Korantzis, Anna Koumarianou, Vassiliki Rapti, Adamantia Nikolaidi, Vasileios Barbounis, Athina Christopoulou, Dimitrios Mavroudis, Vassilios Georgoulias, Georgios Kesisis, and Alexandros Ardavanis have no relevant financial or non-financial interests to disclose; Eleni Timotheadou has received research funding and honoraria from Roche, AstraZeneca, Amgen, Genesis, Pfizer, GSK, MSD, Novartis; Christos Christodoulou declared financial or non-financial interest with Amgen, AstraZeneca, BMS, Genesis, Gilead, Lilly, Merck, MSD, Novartis, Pfizer, Roche; Dimitrios Tryfonopoulos has received honoraria from Roche, AstraZeneca, Genesis-pharma; Sofia Karageorgopoulou has received honoraria for satellite lectures/advisory boards and research compensation and/or conference registration fees and travel grants from Amgen, AstraZeneca, Gilead Sciences, Genesis Pharma, GlaxoSmithKline, MSD, Novartis, Pfizer, Roche, Teva; Ioannis Boukovinas has received honoraria from Roche, MSD, Bristol-Myers Squibb, Pfizer, Novartis, Merck, AstraZeneca, LEO Pharma, Servier, consulting or advisory role fees from Roche, Sanofi, AstraZeneca, Bristol-Myers Squibb, LEO Pharma, MSD, Novartis, Ipsen, Genesis Pharma, research funding from Roche, Novartis, Bristol-Myers Squibb, MSD, Regeneron, Boehringer Ingelheim, Lilly, Pfizer, and travel, accommodations, expenses support from MSD, Roche, Pfizer, Bristol-Myers Squibb; Flora Zagouri has received honoraria for lectures and has served in an advisory role for AstraZeneca, Daiichi, Eli- Lilly, Merck, Novartis, MSD, Pfizer, Genesis- Pharma and Roche; Konstantinos Papazisis has received honoraria and consultancy fees from MSD, Gilead, AstraZeneca, Novartis, Genesis, IPSEN, Eli Lilly, Roche and GSK, research funding from Roche, MSD, Novartis, Daiichi Sankyo, Eli Lilly, Nektar, AstraZeneca, BMS, Sanofi, Boehringer and EISAI; Evangelia Razis has received travel grants from BMS, Roche, Pfizer, Karyo, Gilead Sciences and Genesis Pharma. Furthermore, Dr Razis has received honoraria from Servier pharmaceuticals and research funding from Tesaro, IQvia, AstraZeneca, Exelixis, PPD Global and MSD. Dr Razis has served in consulting/advisory role for AstraZeneca; Emmanuel I Papadopoulos and Rozalia Michalea are employees of AstraZeneca Greece. The Study was designed collaboratively by the Sponsor and Investigators. The sponsor had no involvement in the collection, analysis, and interpretation of data. A Medical writing vendor was used and paid by the sponsor to compose the first draft of the manuscript which was reviewed and approved by all authors who unanimously made the decision to submit the manuscript for publication. References 1. Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Bray F Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 3 209 249 33538338 10.3322/caac.21660 Sung H, Ferlay J, Siegel RL, Laversanne M, Soerjomataram I, Jemal A, Bray F. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71(3):209–49. 33538338 10.3322/caac.21660 2. Ferlay J, Ervik M, Lam F, Laversanne M, Colombet M, Mery L, Piñeros M, Znaor A, Soerjomataram I, Bray F. Global cancer observatory: cancer today. lyon, france: international agency for research on cancer. Available from: https://gco.iarc.who.int/today 3. Zhao W Wu L Zhao A Zhang M Tian Q Shen Y Wang F Wang B Wang L Chen L A nomogram for predicting survival in patients with de novo metastatic breast cancer: a population-based study BMC Cancer 2020 20 1 982 10.1186/s12885-020-07449-1 33046035 PMC7549197 Zhao W, Wu L, Zhao A, Zhang M, Tian Q, Shen Y, Wang F, Wang B, Wang L, Chen L, et al. A nomogram for predicting survival in patients with de novo metastatic breast cancer: a population-based study. BMC Cancer. 2020;20(1):982. 33046035 10.1186/s12885-020-07449-1 PMC7549197 4. National Cancer Institute (NCI). Surveillance, Epidemiology, and End Results Program. Cancer Stat Facts: Female Breast Cancer. Available from: https://seer.cancer.gov/statfacts/html/breast.html 5. Giaquinto AN Sung H Miller KD Kramer JL Newman LA Minihan A Jemal A Siegel RL Breast cancer statistics, 2022 CA Cancer J Clin 2022 72 6 524 541 36190501 10.3322/caac.21754 Giaquinto AN, Sung H, Miller KD, Kramer JL, Newman LA, Minihan A, Jemal A, Siegel RL. Breast cancer statistics, 2022. CA Cancer J Clin. 2022;72(6):524–41. 36190501 10.3322/caac.21754 6. Piccart-Gebhart MJ Procter M Leyland-Jones B Goldhirsch A Untch M Smith I Gianni L Baselga J Bell R Jackisch C Trastuzumab after adjuvant chemotherapy in HER2-positive breast cancer N Engl J Med 2005 353 16 1659 1672 10.1056/NEJMoa052306 16236737 Piccart-Gebhart MJ, Procter M, Leyland-Jones B, Goldhirsch A, Untch M, Smith I, Gianni L, Baselga J, Bell R, Jackisch C, et al. Trastuzumab after adjuvant chemotherapy in HER2-positive breast cancer. N Engl J Med. 2005;353(16):1659–72. 16236737 10.1056/NEJMoa052306 7. Baselga J Cortes J Kim SB Im SA Hegg R Im YH Roman L Pedrini JL Pienkowski T Knott A Pertuzumab plus trastuzumab plus docetaxel for metastatic breast cancer N Engl J Med 2012 366 2 109 119 10.1056/NEJMoa1113216 22149875 PMC5705202 Baselga J, Cortes J, Kim SB, Im SA, Hegg R, Im YH, Roman L, Pedrini JL, Pienkowski T, Knott A, et al. Pertuzumab plus trastuzumab plus docetaxel for metastatic breast cancer. N Engl J Med. 2012;366(2):109–19. 22149875 10.1056/NEJMoa1113216 PMC5705202 8. Verma S Miles D Gianni L Krop IE Welslau M Baselga J Pegram M Oh DY Diéras V Guardino E Trastuzumab emtansine for HER2-positive advanced breast cancer N Engl J Med 2012 367 19 1783 1791 10.1056/NEJMoa1209124 23020162 PMC5125250 Verma S, Miles D, Gianni L, Krop IE, Welslau M, Baselga J, Pegram M, Oh DY, Diéras V, Guardino E, et al. Trastuzumab emtansine for HER2-positive advanced breast cancer. N Engl J Med. 2012;367(19):1783–91. 23020162 10.1056/NEJMoa1209124 PMC5125250 9. Wang S Yang Q Deng L Lei Q Yang Y Ma P Men Y Yung BC Lee RJ Zhang M An overview of cancer drugs approved through expedited approval programs and orphan medicine designation globally between 2011 and 2020 Drug Discov Today 2022 27 5 1236 1250 10.1016/j.drudis.2021.12.021 34971818 Wang S, Yang Q, Deng L, Lei Q, Yang Y, Ma P, Men Y, Yung BC, Lee RJ, Zhang M, et al. An overview of cancer drugs approved through expedited approval programs and orphan medicine designation globally between 2011 and 2020. Drug Discov Today. 2022;27(5):1236–50. 34971818 10.1016/j.drudis.2021.12.021 10. Cardoso F Paluch-Shimon S Senkus E Curigliano G Aapro MS André F Barrios CH Bergh J Bhattacharyya GS Biganzoli L 5th ESO-ESMO international consensus guidelines for advanced breast cancer (ABC 5) Ann Oncol 2020 31 12 1623 1649 10.1016/j.annonc.2020.09.010 32979513 PMC7510449 Cardoso F, Paluch-Shimon S, Senkus E, Curigliano G, Aapro MS, André F, Barrios CH, Bergh J, Bhattacharyya GS, Biganzoli L, et al. 5th ESO-ESMO international consensus guidelines for advanced breast cancer (ABC 5). Ann Oncol. 2020;31(12):1623–49. 32979513 10.1016/j.annonc.2020.09.010 PMC7510449 11. Gennari A André F Barrios CH Cortés J de Azambuja E DeMichele A Dent R Fenlon D Gligorov J Hurvitz SA Esmo clinical practice guideline for the diagnosis, staging and treatment of patients with metastatic breast cancer Ann Oncol 2021 32 12 1475 1495 10.1016/j.annonc.2021.09.019 34678411 Gennari A, André F, Barrios CH, Cortés J, de Azambuja E, DeMichele A, Dent R, Fenlon D, Gligorov J, Hurvitz SA, et al. Esmo clinical practice guideline for the diagnosis, staging and treatment of patients with metastatic breast cancer. Ann Oncol. 2021;32(12):1475–95. 34678411 10.1016/j.annonc.2021.09.019 12. Giordano SH Franzoi MAB Temin S Anders CK Chandarlapaty S Crews JR Kirshner JJ Krop IE Lin NU Morikawa A Systemic therapy for advanced human epidermal growth factor receptor 2-positive breast cancer: ASCO guideline update J Clin Oncol 2022 40 23 2612 2635 10.1200/JCO.22.00519 35640077 Giordano SH, Franzoi MAB, Temin S, Anders CK, Chandarlapaty S, Crews JR, Kirshner JJ, Krop IE, Lin NU, Morikawa A, et al. Systemic therapy for advanced human epidermal growth factor receptor 2-positive breast cancer: ASCO guideline update. J Clin Oncol. 2022;40(23):2612–35. 35640077 10.1200/JCO.22.00519 13. Giordano SH Temin S Chandarlapaty S Crews JR Esteva FJ Kirshner JJ Krop IE Levinson J Lin NU Modi S Systemic therapy for patients with advanced human epidermal growth factor receptor 2-positive breast cancer: ASCO clinical practice guideline update J Clin Oncol 2018 36 26 2736 2740 10.1200/JCO.2018.79.2697 29939838 Giordano SH, Temin S, Chandarlapaty S, Crews JR, Esteva FJ, Kirshner JJ, Krop IE, Levinson J, Lin NU, Modi S, et al. Systemic therapy for patients with advanced human epidermal growth factor receptor 2-positive breast cancer: ASCO clinical practice guideline update. J Clin Oncol. 2018;36(26):2736–40. 29939838 10.1200/JCO.2018.79.2697 14. Cortés J Kim S-B Chung W-P Im S-A Park YH Hegg R Kim MH Tseng L-M Petry V Chung C-F Trastuzumab deruxtecan versus trastuzumab emtansine for breast cancer N Engl J Med 2022 386 12 1143 1154 10.1056/NEJMoa2115022 35320644 Cortés J, Kim S-B, Chung W-P, Im S-A, Park YH, Hegg R, Kim MH, Tseng L-M, Petry V, Chung C-F, et al. Trastuzumab deruxtecan versus trastuzumab emtansine for breast cancer. N Engl J Med. 2022;386(12):1143–54. 35320644 10.1056/NEJMoa2115022 15. Hurvitz SA Hegg R Chung WP Im SA Jacot W Ganju V Chiu JWY Xu B Hamilton E Madhusudan S Trastuzumab deruxtecan versus trastuzumab emtansine in patients with HER2-positive metastatic breast cancer: updated results from DESTINY-Breast03, a randomised, open-label, phase 3 trial Lancet (London, England) 2023 401 10371 105 117 10.1016/S0140-6736(22)02420-5 36495879 Hurvitz SA, Hegg R, Chung WP, Im SA, Jacot W, Ganju V, Chiu JWY, Xu B, Hamilton E, Madhusudan S, et al. Trastuzumab deruxtecan versus trastuzumab emtansine in patients with HER2-positive metastatic breast cancer: updated results from DESTINY-Breast03, a randomised, open-label, phase 3 trial. Lancet (London, England). 2023;401(10371):105–17. 36495879 10.1016/S0140-6736(22)02420-5 16. Modi S Jacot W Yamashita T Sohn J Vidal M Tokunaga E Tsurutani J Ueno NT Prat A Chae YS Trastuzumab deruxtecan in previously treated HER2-low advanced breast cancer N Engl J Med 2022 387 1 9 20 10.1056/NEJMoa2203690 35665782 PMC10561652 Modi S, Jacot W, Yamashita T, Sohn J, Vidal M, Tokunaga E, Tsurutani J, Ueno NT, Prat A, Chae YS, et al. Trastuzumab deruxtecan in previously treated HER2-low advanced breast cancer. N Engl J Med. 2022;387(1):9–20. 35665782 10.1056/NEJMoa2203690 PMC10561652 17. Lin NU Borges V Anders C Murthy RK Paplomata E Hamilton E Hurvitz S Loi S Okines A Abramson V Intracranial efficacy and survival with tucatinib plus trastuzumab and capecitabine for previously treated HER2-positive breast cancer with brain metastases in the HER2CLIMB trial J Clin Oncol 2020 38 23 2610 2619 10.1200/JCO.20.00775 32468955 PMC7403000 Lin NU, Borges V, Anders C, Murthy RK, Paplomata E, Hamilton E, Hurvitz S, Loi S, Okines A, Abramson V, et al. Intracranial efficacy and survival with tucatinib plus trastuzumab and capecitabine for previously treated HER2-positive breast cancer with brain metastases in the HER2CLIMB trial. J Clin Oncol. 2020;38(23):2610–9. 32468955 10.1200/JCO.20.00775 PMC7403000 18. Murthy RK Loi S Okines A Paplomata E Hamilton E Hurvitz SA Lin NU Borges V Abramson V Anders C Tucatinib, trastuzumab, and capecitabine for HER2-positive metastatic breast cancer N Engl J Med 2020 382 7 597 609 10.1056/NEJMoa1914609 31825569 Murthy RK, Loi S, Okines A, Paplomata E, Hamilton E, Hurvitz SA, Lin NU, Borges V, Abramson V, Anders C, et al. Tucatinib, trastuzumab, and capecitabine for HER2-positive metastatic breast cancer. N Engl J Med. 2020;382(7):597–609. 31825569 10.1056/NEJMoa1914609 19. World Health Organization. The WHO Collaborating Centre for Drug Statistics Methodology. Available from: https://atcddd.fhi.no/ 20. Sanglier T Fabi A Flores C Flahavan EM Pena-Murillo C Meyer AM Montemurro F T-DM1 after Pertuzumab plus Trastuzumab: treatment sequence-induced selection bias in HER2-positive metastatic breast cancer Cancers 2022 10.3390/cancers14102468 35626072 PMC9139620 Sanglier T, Fabi A, Flores C, Flahavan EM, Pena-Murillo C, Meyer AM, Montemurro F. T-DM1 after Pertuzumab plus Trastuzumab: treatment sequence-induced selection bias in HER2-positive metastatic breast cancer. Cancers. 2022. 10.3390/cancers14102468. 35626072 10.3390/cancers14102468 PMC9139620 21. Pizzuti L Krasniqi E Sperduti I Barba M Gamucci T Mauri M Veltri EM Meattini I Berardi R Di Lisa FS Panher study: a 20-year treatment outcome analysis from a multicentre observational study of HER2-positive advanced breast cancer patients from the real-world setting Ther Adv Med Oncol 2021 13 17588359211059873 10.1177/17588359211059873 35173816 PMC8842182 Pizzuti L, Krasniqi E, Sperduti I, Barba M, Gamucci T, Mauri M, Veltri EM, Meattini I, Berardi R, Di Lisa FS, et al. Panher study: a 20-year treatment outcome analysis from a multicentre observational study of HER2-positive advanced breast cancer patients from the real-world setting. Ther Adv Med Oncol. 2021;13:17588359211059872. 35173816 10.1177/17588359211059873 PMC8842182 22. Laakmann E Emons J Taran FA Janni W Uhrig S Overkamp F Kolberg HC Hadji P Tesch H Häberle L Treatment landscape and prognosis after treatment with trastuzumab emtansine Geburtshilfe Frauenheilkd 2020 80 11 1134 1142 10.1055/a-1286-2917 33173241 PMC7647719 Laakmann E, Emons J, Taran FA, Janni W, Uhrig S, Overkamp F, Kolberg HC, Hadji P, Tesch H, Häberle L, et al. Treatment landscape and prognosis after treatment with trastuzumab emtansine. Geburtshilfe Frauenheilkd. 2020;80(11):1134–42. 33173241 10.1055/a-1286-2917 PMC7647719 23. Michel LL Hartkopf AD Fasching PA Kolberg HC Hadji P Tesch H Häberle L Ettl J Lüftner D Wallwiener M Progression-free survival and overall survival in patients with advanced HER2-positive breast cancer treated with trastuzumab emtansine (T-DM1) after previous treatment with pertuzumab Cancers 2020 10.3390/cancers12103021 33080911 PMC7603111 Michel LL, Hartkopf AD, Fasching PA, Kolberg HC, Hadji P, Tesch H, Häberle L, Ettl J, Lüftner D, Wallwiener M, et al. Progression-free survival and overall survival in patients with advanced HER2-positive breast cancer treated with trastuzumab emtansine (T-DM1) after previous treatment with pertuzumab. Cancers. 2020. 10.3390/cancers12103021. 33080911 10.3390/cancers12103021 PMC7603111 24. Tataroglu Ozyukseler D Basak M Ay S Koseoglu A Arıcı S Oyman A Sürmeli H Turan M Turan N Odabaş H Prognostic factors of ado-trastuzumab emtansine treatment in patients with metastatic HER-2 positive breast cancer J Oncol Pharm Pract Off Publ Int Soc Oncol Pharm Pract 2021 27 3 547 554 10.1177/1078155220924088 32423326 Tataroglu Ozyukseler D, Basak M, Ay S, Koseoglu A, Arıcı S, Oyman A, Sürmeli H, Turan M, Turan N, Odabaş H, et al. Prognostic factors of ado-trastuzumab emtansine treatment in patients with metastatic HER-2 positive breast cancer. J Oncol Pharm Pract Off Publ Int Soc Oncol Pharm Pract. 2021;27(3):547–54. 10.1177/1078155220924088 32423326 25. Conte B Fabi A Poggio F Blondeaux E Dellepiane C D'Alonzo A Buono G Arpino G Magri V Naso G T-DM1 efficacy in patients with HER2-positive metastatic breast cancer progressing after a taxane plus pertuzumab and trastuzumab: an Italian multicenter observational study Clin Breast Cancer 2020 20 2 e181 e187 10.1016/j.clbc.2019.09.001 31735691 Conte B, Fabi A, Poggio F, Blondeaux E, Dellepiane C, D’Alonzo A, Buono G, Arpino G, Magri V, Naso G, et al. T-DM1 efficacy in patients with HER2-positive metastatic breast cancer progressing after a taxane plus pertuzumab and trastuzumab: an Italian multicenter observational study. Clin Breast Cancer. 2020;20(2):e181–7. 31735691 10.1016/j.clbc.2019.09.001 26. Pizzuti L Krasniqi E Barchiesi G Della Giulia M Izzo F Sanguineti G Marchetti P Mazzotta M Giusti R Botticelli A Distinct HR expression patterns significantly affect the clinical behavior of metastatic HER2+ breast cancer and degree of benefit from novel anti-HER2 agents in the real world setting Int J Cancer 2020 146 7 1917 1929 10.1002/ijc.32583 31330065 PMC7027476 Pizzuti L, Krasniqi E, Barchiesi G, Della Giulia M, Izzo F, Sanguineti G, Marchetti P, Mazzotta M, Giusti R, Botticelli A, et al. Distinct HR expression patterns significantly affect the clinical behavior of metastatic HER2+ breast cancer and degree of benefit from novel anti-HER2 agents in the real world setting. Int J Cancer. 2020;146(7):1917–29. 31330065 10.1002/ijc.32583 PMC7027476 27. De Luca R Profita G Cicero G Nab-paclitaxel in pretreated metastatic breast cancer: evaluation of activity, safety, and quality of life Onco Targets Ther 2019 12 1621 1627 10.2147/OTT.S191519 30881017 PMC6396668 De Luca R, Profita G, Cicero G. Nab-paclitaxel in pretreated metastatic breast cancer: evaluation of activity, safety, and quality of life. Onco Targets Ther. 2019;12:1621–7. 30881017 10.2147/OTT.S191519 PMC6396668 28. Vici P Pizzuti L Michelotti A Sperduti I Natoli C Mentuccia L Di Lauro L Sergi D Marchetti P Santini D A retrospective multicentric observational study of trastuzumab emtansine in HER2 positive metastatic breast cancer: a real-world experience Oncotarget 2017 8 34 56921 56931 10.18632/oncotarget.18176 28915642 PMC5593613 Vici P, Pizzuti L, Michelotti A, Sperduti I, Natoli C, Mentuccia L, Di Lauro L, Sergi D, Marchetti P, Santini D, et al. A retrospective multicentric observational study of trastuzumab emtansine in HER2 positive metastatic breast cancer: a real-world experience. Oncotarget. 2017;8(34):56921–31. 28915642 10.18632/oncotarget.18176 PMC5593613 29. Yardley DA Krop IE LoRusso PM Mayer M Barnett B Yoo B Perez EA Trastuzumab emtansine (T-DM1) in patients with HER2-positive metastatic breast cancer previously treated with chemotherapy and 2 or more HER2-targeted agents: results from the T-PAS expanded access study Cancer J (Sudbury, Mass) 2015 21 5 357 364 10.1097/PPO.0000000000000144 26389758 Yardley DA, Krop IE, LoRusso PM, Mayer M, Barnett B, Yoo B, Perez EA. Trastuzumab emtansine (T-DM1) in patients with HER2-positive metastatic breast cancer previously treated with chemotherapy and 2 or more HER2-targeted agents: results from the T-PAS expanded access study. Cancer J (Sudbury, Mass). 2015;21(5):357–64. 10.1097/PPO.0000000000000144 26389758 30. Sanglier T Ross R Shi T Mouta J Swain S Cardoso F Trastuzumab-based regimens beyond progression: a crucial treatment option for HER2+ advanced/metastatic breast cancer Breast (Edinburgh, Scotland) 2022 66 262 271 10.1016/j.breast.2022.10.008 36375387 PMC9663523 Sanglier T, Ross R, Shi T, Mouta J, Swain S, Cardoso F. Trastuzumab-based regimens beyond progression: a crucial treatment option for HER2+ advanced/metastatic breast cancer. Breast (Edinburgh, Scotland). 2022;66:262–71. 36375387 10.1016/j.breast.2022.10.008 PMC9663523 31. Ramagopalan SV Pisoni R Zenin A Rathore LS Ray J Sammon C Comparative effectiveness of trastuzumab emtansine versus lapatinib plus chemotherapy for HER2+ metastatic breast cancer J Comp Eff Res 2021 10 7 595 602 10.2217/cer-2020-0201 33095031 Ramagopalan SV, Pisoni R, Zenin A, Rathore LS, Ray J, Sammon C. Comparative effectiveness of trastuzumab emtansine versus lapatinib plus chemotherapy for HER2+ metastatic breast cancer. J Comp Eff Res. 2021;10(7):595–602. 33095031 10.2217/cer-2020-0201 32. Gavilá J De La Haba J Bermejo B Rodríguez-Lescure Á Antón A Ciruelos E Brunet J Muñoz-Couselo E Santisteban M Rodríguez Sánchez CA A retrospective, multicenter study of the efficacy of lapatinib plus trastuzumab in HER2-positive metastatic breast cancer patients previously treated with trastuzumab, lapatinib, or both: the Trastyvere study Clin Transl Oncol 2020 22 3 420 428 10.1007/s12094-019-02145-4 31203575 Gavilá J, De La Haba J, Bermejo B, Rodríguez-Lescure Á, Antón A, Ciruelos E, Brunet J, Muñoz-Couselo E, Santisteban M, Rodríguez Sánchez CA, et al. A retrospective, multicenter study of the efficacy of lapatinib plus trastuzumab in HER2-positive metastatic breast cancer patients previously treated with trastuzumab, lapatinib, or both: the Trastyvere study. Clin Transl Oncol. 2020;22(3):420–8. 31203575 10.1007/s12094-019-02145-4 33. Kotsakis A Ardavanis A Koumakis G Samantas E Psyrri A Papadimitriou C Epidemiological characteristics, clinical outcomes and management patterns of metastatic breast cancer patients in routine clinical care settings of Greece: results from the EMERGE multicenter retrospective chart review study BMC Cancer 2019 19 1 88 10.1186/s12885-019-5301-5 30658600 PMC6339387 Kotsakis A, Ardavanis A, Koumakis G, Samantas E, Psyrri A, Papadimitriou C. Epidemiological characteristics, clinical outcomes and management patterns of metastatic breast cancer patients in routine clinical care settings of Greece: results from the EMERGE multicenter retrospective chart review study. BMC Cancer. 2019;19(1):88. 30658600 10.1186/s12885-019-5301-5 PMC6339387 34. DeBusk K Ike C Lindegger N Schwartz N Surinach A Liu Y Forero-Torres A Real-world outcomes among patients with HER2+ metastatic breast cancer with brain metastases J Manag Care Spec Pharm 2022 28 6 657 666 35621719 10.18553/jmcp.2022.28.6.657 PMC10373006 DeBusk K, Ike C, Lindegger N, Schwartz N, Surinach A, Liu Y, Forero-Torres A. Real-world outcomes among patients with HER2+ metastatic breast cancer with brain metastases. J Manag Care Spec Pharm. 2022;28(6):657–66. 35621719 10.18553/jmcp.2022.28.6.657 PMC10373006 35. Hedayatizadeh-Omran A Rafiei A Alizadeh-Navaei R Tehrani M Valadan R Moradzadeh K Panbechi M Taghavi SM Role of HER2 in brain metastasis of breast cancer: a systematic review and meta-analysis Asian Pac J Cancer Prev APJCP 2015 16 4 1431 1434 10.7314/APJCP.2015.16.4.1431 25743811 Hedayatizadeh-Omran A, Rafiei A, Alizadeh-Navaei R, Tehrani M, Valadan R, Moradzadeh K, Panbechi M, Taghavi SM. Role of HER2 in brain metastasis of breast cancer: a systematic review and meta-analysis. Asian Pac J Cancer Prev APJCP. 2015;16(4):1431–4. 25743811 10.7314/apjcp.2015.16.4.1431 36. Hurvitz SA O'Shaughnessy J Mason G Yardley DA Jahanzeb M Brufsky A Rugo HS Swain SM Kaufman PA Tripathy D Central nervous system metastasis in patients with HER2-positive metastatic breast cancer: patient characteristics, treatment, and survival from SystHERs Clin Cancer Res 2019 25 8 2433 2441 10.1158/1078-0432.CCR-18-2366 30593513 Hurvitz SA, O’Shaughnessy J, Mason G, Yardley DA, Jahanzeb M, Brufsky A, Rugo HS, Swain SM, Kaufman PA, Tripathy D, et al. Central nervous system metastasis in patients with HER2-positive metastatic breast cancer: patient characteristics, treatment, and survival from SystHERs. Clin Cancer Res. 2019;25(8):2433–41. 30593513 10.1158/1078-0432.CCR-18-2366 37. Komorowski AS Warner E MacKay HJ Sahgal A Pritchard KI Jerzak KJ Incidence of brain metastases in nonmetastatic and metastatic breast cancer: is there a role for screening? Clin Breast Cancer 2020 20 1 e54 e64 10.1016/j.clbc.2019.06.007 31447286 Komorowski AS, Warner E, MacKay HJ, Sahgal A, Pritchard KI, Jerzak KJ. Incidence of brain metastases in nonmetastatic and metastatic breast cancer: is there a role for screening? Clin Breast Cancer. 2020;20(1):e54–64. 31447286 10.1016/j.clbc.2019.06.007 38. Tung I Moldovan C Wong V De Boer R Yeo B Malik L Greenberg S Anton A Nott L Barnett F Real-world outcomes in patients with brain metastases secondary to HER2-positive breast cancer: an Australian multi-centre registry-based study Clin Breast Cancer 2022 22 7 e764 e772 10.1016/j.clbc.2022.07.005 35941066 Tung I, Moldovan C, Wong V, De Boer R, Yeo B, Malik L, Greenberg S, Anton A, Nott L, Barnett F, et al. Real-world outcomes in patients with brain metastases secondary to HER2-positive breast cancer: an Australian multi-centre registry-based study. Clin Breast Cancer. 2022;22(7):e764–72. 35941066 10.1016/j.clbc.2022.07.005 39. Jackisch C Welslau M Schoenegg W Selbach J Harich HD Schröder J Schmidt M Göhler T Eustermann H Ringel R Impact of trastuzumab treatment beyond disease progression for advanced/metastatic breast cancer on survival—results from a prospective, observational study in Germany Breast (Edinburgh, Scotland) 2014 23 5 603 608 10.1016/j.breast.2014.06.003 25012046 Jackisch C, Welslau M, Schoenegg W, Selbach J, Harich HD, Schröder J, Schmidt M, Göhler T, Eustermann H, Ringel R, et al. Impact of trastuzumab treatment beyond disease progression for advanced/metastatic breast cancer on survival—results from a prospective, observational study in Germany. Breast (Edinburgh, Scotland). 2014;23(5):603–8. 25012046 10.1016/j.breast.2014.06.003 40. Omarini C Piacentini F Sperduti I Cerma K Barbolini M Canino F Nasso C Isca C Caggia F Dominici M T-DM1 efficacy in trastuzumab-pertuzumab pre-treated HER2 positive metastatic breast cancer patients: a meta-analysis BMC Cancer 2022 22 1 623 10.1186/s12885-022-09556-7 35672679 PMC9172020 Omarini C, Piacentini F, Sperduti I, Cerma K, Barbolini M, Canino F, Nasso C, Isca C, Caggia F, Dominici M, et al. T-DM1 efficacy in trastuzumab-pertuzumab pre-treated HER2 positive metastatic breast cancer patients: a meta-analysis. BMC Cancer. 2022;22(1):623. 35672679 10.1186/s12885-022-09556-7 PMC9172020 41. Hardy-Werbin M Quiroga V Cirauqui B Romeo M Felip E Teruel I Garcia JJ Erasun C España S Cucurull M Real-world data on T-DM1 efficacy—results of a single-center retrospective study of HER2-positive breast cancer patients Sci Rep 2019 9 1 12760 10.1038/s41598-019-49251-5 31484985 PMC6726763 Hardy-Werbin M, Quiroga V, Cirauqui B, Romeo M, Felip E, Teruel I, Garcia JJ, Erasun C, España S, Cucurull M, et al. Real-world data on T-DM1 efficacy—results of a single-center retrospective study of HER2-positive breast cancer patients. Sci Rep. 2019;9(1):12760. 31484985 10.1038/s41598-019-49251-5 PMC6726763 42. Orditura M Gravina A Riccardi F Diana A Mocerino C Leopaldi L Fabozzi A Giordano G Nettuno R Incoronato P Eribulin for metastatic breast cancer (MBC) treatment: a retrospective, multicenter study based in Campania, south Italy (Eri-001 trial) ESMO Open 2017 2 2 e000176 10.1136/esmoopen-2017-000176 28761747 PMC5519815 Orditura M, Gravina A, Riccardi F, Diana A, Mocerino C, Leopaldi L, Fabozzi A, Giordano G, Nettuno R, Incoronato P, et al. Eribulin for metastatic breast cancer (MBC) treatment: a retrospective, multicenter study based in Campania, south Italy (Eri-001 trial). ESMO Open. 2017;2(2): e000176. 28761747 10.1136/esmoopen-2017-000176 PMC5519815 43. Emens LA Esteva FJ Beresford M Saura C De Laurentiis M Kim SB Im SA Wang Y Salgado R Mani A Trastuzumab emtansine plus atezolizumab versus trastuzumab emtansine plus placebo in previously treated, HER2-positive advanced breast cancer (KATE2): a phase 2, multicentre, randomised, double-blind trial Lancet Oncol 2020 21 10 1283 1295 10.1016/S1470-2045(20)30465-4 33002436 Emens LA, Esteva FJ, Beresford M, Saura C, De Laurentiis M, Kim SB, Im SA, Wang Y, Salgado R, Mani A, et al. Trastuzumab emtansine plus atezolizumab versus trastuzumab emtansine plus placebo in previously treated, HER2-positive advanced breast cancer (KATE2): a phase 2, multicentre, randomised, double-blind trial. Lancet Oncol. 2020;21(10):1283–95. 33002436 10.1016/S1470-2045(20)30465-4 44. Daniels B Kiely BE Tang M Tervonen H Pearson SA Trastuzumab use in older patients with HER2-positive metastatic breast cancer: outcomes and treatment patterns in a whole-of-population Australian cohort (2003–2015) BMC Cancer 2019 19 1 909 10.1186/s12885-019-6126-y 31510955 PMC6740010 Daniels B, Kiely BE, Tang M, Tervonen H, Pearson SA. Trastuzumab use in older patients with HER2-positive metastatic breast cancer: outcomes and treatment patterns in a whole-of-population Australian cohort (2003–2015). BMC Cancer. 2019;19(1):909. 31510955 10.1186/s12885-019-6126-y PMC6740010 ",
  "metadata": {
    "Title of this paper": "Trastuzumab use in older patients with HER2-positive metastatic breast cancer: outcomes and treatment patterns in a whole-of-population Australian cohort (2003–2015)",
    "Journal it was published in:": "BMC Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487351/"
  }
}