{
  "title": "Paper_353",
  "abstract": "pmc BMC Public Health BMC Public Health 63 bmcph BMC Public Health 1471-2458 BMC PMC12487387 PMC12487387.1 12487387 12487387 41034855 10.1186/s12889-025-24558-3 24558 1 Research Association of social isolation and loneliness with incident cancer in A Population-based cohort study Liu Xiaojuan 1 2 Chen Ping 3 4 Wang Junru 1 Li Zhuoyuan 1 Zhu Yongbin 1 Yang Jiafei 1 2 Wang Liqun 1 2 He Shulan 1 2 Sun Xian 1 2 Li Jiangping lijp@nxmu.edu.cn 1 2 Yang Huifang joyceyhf@163.com 1 2 1 https://ror.org/02h8a1848 grid.412194.b 0000 0004 1761 9803 School of Public Health, Ningxia Medical University, 2 https://ror.org/02h8a1848 grid.412194.b 0000 0004 1761 9803 Key Laboratory of Environmental Factors and Chronic Disease Control, Ningxia Medical University, 3 https://ror.org/02h8a1848 grid.412194.b 0000 0004 1761 9803 Medical Experiment center, General Hospital of Ningxia Medical University, 4 https://ror.org/02h8a1848 grid.412194.b 0000 0004 1761 9803 Ningxia Key Laboratory Clinical and Pathogenic Microbiology, General Hospital of Ningxia Medical University, 1 10 2025 2025 25 478168 3274 13 3 2025 21 8 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Social isolation and loneliness pose significant public health challenges globally. This study aims to examine the association of social isolation, loneliness and their combined effects with incident cancer. Methods This study utilized data from the UK Biobank (UKB), which is a population-based prospective cohort. Social isolation and loneliness were assessed through self-reported questionnaires. Cancer cases were identified by linking to cancer registries. Results A total of 430,376 participants were included, during a mean follow-up of 14.32 years, 45,131 participants were diagnosed with cancer. Compared to participants in least isolated group, those in most isolated group had significantly higher risks of cancer of lip, oral cavity and pharynx (HR 1.32, 95% CI 1.11–1.58), cancer of digestive organs (HR 1.10, 95% CI 1.03–1.16), cancer of respiratory and intrathoracic organs (HR 1.17, 95% CI 1.07–1.28), breast cancer (HR 1.11, 95% CI 1.04–1.18), cancer of female genital organs (HR 1.23, 95% CI 1.09–1.38), and cancer of urinary tract (HR 1.31, 95% CI 1.17–1.46). However, the most isolated group had lower risks of cancer of mesothelial and soft tissue (HR 0.80, 95% CI 0.64–0.99), prostate cancer (HR 0.88, 95% CI 0.83–0.94). Individuals with loneliness had a significantly increased risk of cancer of urinary tract (HR 1.19, 95% CI 1.01–1.40), but a reduced risk of cancer of skin (HR 0.76, 95% CI 0.61–0.93). Conclusions Social isolation and loneliness were independently associated with incident cancer, with implications for early effective cancer prevention. Supplementary Information The online version contains supplementary material available at 10.1186/s12889-025-24558-3. Keywords Social isolation Loneliness Cancer Cohort study https://doi.org/10.13039/501100004772 Natural Science Foundation of Ningxia Province 2022AAC03174 2022AAC03174 Liu Xiaojuan Li Jiangping pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Cancer, characterized by its malignant progression and potential to cause multiple organ failure, remains one of the leading causes of death globally [ 1 2 3 4 5 Strong empirical evidence suggests that positive social connections promote engagement in health-promoting behaviors and subsequently improve health outcomes [ 6 8 9 10 11 12 13 14 15 19 20 21 22 23 24 26 27 29 30 To address these gaps in knowledge, this study was designed to analyze data from the UK Biobank (UKB) prospective cohort (participants aged 37–73 years at baseline) to investigate associations between social isolation, loneliness and incident cancer risk. By examining these relationships in this large-scale population, we aim to provide new insights into cancer prevention through the lens of social determinants of health. Materials and methods Study design and participants This study used data from the UKB, a prospective, population-based cohort comprising over 500,000 participants aged 37–73 years who were recruited between 2006 and 2010. Participants finished an electronic questionnaire and a verbal interview, physical measurements, and provided biological samples from 22 assessment centers across England, Scotland, and Wales [ 31 In the current study, 502,370 UK adults were initially screened. After excluding individuals with missing data on loneliness or social isolation ( n n S1 Assessment of exposure The exposures of interest included social isolation and loneliness. Social isolation was evaluated through objective indicators of social connections, focusing on the frequency of social interactions and involvement in social activities [ 10 11 32 33 S1 Assessment of outcome In this study, the primary outcomes were first primary incident cancers. Cancers were ascertained through record linkage to the cancer registries in England, Wales, and Scotland, which provide comprehensive data on cancer registrations and deaths [ 34 S2 Assessment of covariates The selection of potential covariates was guided by established confounders identified in prior epidemiological studies, followed by multicollinearity diagnostics. Consequently, the following variables were included in the final analysis: age, sex, ethnicity, household income, educational level, employment status, smoking status, alcohol consumption, sun exposure time, dietary patterns, sleep patterns, Townsend deprivation index, and self-reported medical conditions (including hypertension, dyslipidemia, and family history of cancer). Household annual income was categorised into four levels: < £18,000, £18,000– £51,999, ≥ £52,000, and unknown (GBP per annum). The Townsend deprivation index was derived from four socioeconomic indicators: unemployment, overcrowded household, non-car ownership, and non-home ownership [ 35 36 37 S3 S4 S5 Statistical analyses Person-years of follow-up were calculated from the baseline survey date to the earliest occurrence of one of the following events: the first cancer diagnosis, death, or the end of the study. Basic characteristics were presented as mean (standard deviation, SD) or median (interquartile range, IQR) for continuous variables and frequencies (percentages) for categorical variables. Statistical differences in continuous variables were evaluated using t χ 2 S6 The association between exposure (social isolation and loneliness) and incident cancer was examined using multivariable Cox proportional hazards models. The results were presented as hazard ratios (HRs) with 95% confidence intervals (CIs). The proportional-hazard assumptions were verified using Schoenfeld’s test and by plotting residuals.The association between social isolation, loneliness, and cancer risk was evaluated through both main-effect and interaction models. The analyses were adjusted for the following covariates: age, sex, ethnicity, household income, educational level, Townsend deprivation index, body mass index (BMI), employment status, smoking status, alcohol consumption, sun exposure time, healthy diet score, healthy sleep score, family cancer history, and history of hypertension and dyslipidemia. For models analyzing breast cancer and cancers of the female genital organs, additional adjustments were made for menopausal status, HRT use, and parity. These adjustments ensured a comprehensive evaluation of the associations while accounting for potential confounding factors. Furthermore, subgroup analyses were carried out, with stratification based on age (< 60 or ≥ 60 years), sex (male or female), ethnicity (White British or other), BMI (< 25 kg/m 2 2 2 In addition, two sensitivity analyses were performed to evaluate the robustness of the findings. We excluded individuals with a family history of cancer to minimize the potential influence of genetic factors. Additionally, we excluded those diagnosed with cancer within the initial 3 years of follow-up to address the impact of reverse causality. All statistical analyses were performed using R P Results Baseline characteristics Among the 430,376 participants included in the study, 200,544 (46.6%) were men and 229,832 (53.4%) were women, and the mean age was 56.8 years (SD 8.1) at baseline. The baseline characteristics of participants were summarized in Table 1 1  Table 1 Baseline characteristics grouped by social isolation and loneliness Characteristics All n Social isolation Loneliness Least isolated n Moderately isolated n Most isolated n  P No loneliness n Loneliness n  P Age, mean (SD), y 56.8 (8.1) 57.1 (8.1) 56.6 (8.1) 56.3 (7.9) < 0.001 56.8 (8.1) 56.3 (7.9) < 0.001 Male, n(%) 200,544 (46.6) 88,550 (45.4) 80,135 (46.2) 31,859 (51.6) < 0.001 189,689 (46.3) 10,855 (52.3) < 0.001 Ethnicity, white, n(%) 408,296 (94.9) 189,846 (95.8) 164,199 (94.6) 57,251 (92.8) < 0.001 388,947 (95.0) 19,349 (93.2) < 0.001 Household income Low, n(%) 81,652 (19.0) 25,814 (13.2) 37,501 (21.6) 18,337 (29.7) < 0.001 74,943 (18.3) 6709 (32.3) < 0.001 Medium, n(%) 193,215 (44.9) 91,375 (46.8) 76,739 (44.2) 25,101 (40.7) 184,745 (45.1) 8470 (40.8) High, n(%) 100,224 (23.3) 51,265 (26.3) 37,756 (21.7) 11,203 (18.2) 97,492 (23.8) 2732 (13.2) Unknown, n(%) 55,285 (12.8) 16,610 (13.6) 21,629 (12.5) 7046 (11.4) 52,439 (12.8) 2846 (13.7) College/university degree, n(%) 142,955 (40.0) 65,016 (39.3) 57,118 (40.1) 20,821 (42.3) < 0.001 138,021 (40.4) 4934 (31.7) < 0.001 Employed, n(%) 254,171 (59.5) 111,149 (57.3) 104,736 (60.8) 38,286 (62.7) < 0.001 242,905 (59.7) 11,266 (54.8) < 0.001 Current smoker, n(%) 44,785 (10.4) 15,558 (8.0) 19,285 (11.1) 9942 (16.2) < 0.001 41,099 (10.1) 3686 (17.8) < 0.001 Current drinker, n(%) 397,788 (92.5) 183,287 (94.0) 159,885 (92.2) 54,616 (88.7) < 0.001 379,365 (92.7) 18,423 (88.9) < 0.001 Sun exposure, mean (SD), h/d 2.8 (2.0) 2.9 (1.9) 2.8 (2.0) 2.7 (2.1) < 0.001 2.8 (2.0) 2.7 (2.2) < 0.001 Healthy diet score 3.0 (2.0, 4.0) 3.0 (2.0, 4.0) 3.0 (2.0, 3.0) 3.0 (2.0, 3.0) < 0.001 3.0 (2.0, 4.0) 3.0 (2.0, 4.0) < 0.001 Healthy sleep pattern, n(%) 209,835 (58.3) 101,148 (59.7) 82,907 (57.9) 25,780 (54.8) < 0.001 203,244 (59.1) 6591 (42.1) < 0.001 Obesity, n(%) 104,219 (24.3) 44,144 (22.7) 43,243 (25.0) 16,832 (27.5) < 0.001 97,457 (23.9) 6762 (32.8) < 0.001 Townsend deprivation index, median (IQR) −2.2 (4.1) −2.5 (4.3) −2.0 (4.3) −1.1 (5.2) < 0.001 −2.2 (4.0) −1.2 (5.3) < 0.001 Total cholesterol, mmol/L 5.7 (4.9, 6.4) 5.7 (5.0, 6.4) 5.6 (4.9, 6.4) 5.6 (4.8, 6.4) < 0.001 5.7 (4.9, 6.4) 5.6 (4.8, 6.4) < 0.001 Triglycerides, mmol/L 1.5 (1.0, 2.1) 1.5 (1.0, 2.1) 1.5 (1.0, 2.2) 1.5 (1.1, 2.2) < 0.001 1.5 (1.0, 2.1) 1.6 (1.1, 2.3) < 0.001 HDL cholesterol, mmol/L 1.4 (1.2, 1.7) 1.4 (1.2, 1.7) 1.4 (1.2, 1.7) 1.3 (1.1, 1.6) < 0.001 1.4 (1.2, 1.7) 1.3 (1.1, 1.6) < 0.001 LDL cholesterol, mmol/L 3.5 (3.0, 4.1) 3.5 (3.0, 4.1) 3.5 (2.9,4.1) 3.5 (2.9, 4.1) < 0.001 3.5 (3.0, 4.1) 3.5 (2.9, 4.1) < 0.001 History of dyslipidemia, n(%) 196,037 (45.6) 87,770 (45.0) 79,394 (45.7) 28,873 (46.8) < 0.001 185,935 (45.4) 10,102 (48.7) < 0.001 History of hypertension, n(%) 201,837 (46.9) 91,822 (47.1) 81,194 (46.8) 28,821 (46.7) 0.110 192,518 (47.0) 9319 (44.9) < 0.001 Family history of cancer, n(%) 92,734 (25.2) 42,682 (25.5) 37,209 (25.0) 12,843 (24.6) < 0.001 88,609 (25.2) 4125 (23.7) < 0.001 Menopausal (women), n(%) 128,246 (55.8) 59,435 (55.8) 51,793 (55.4) 17,018 (57.1) < 0.001 122,281 (55.6) 5965 (60.2) < 0.001 Ever HRT use (women), n(%) 86,187 (37.5) 39,516 (37.1) 35,246 (37.7) 11,425 (38.3) < 0.001 82,914 (37.7) 3237 (33.1) < 0.001 Parity (women), n(%) 0 child 42,979 (18.7) 19,812 (18.6) 17,576 (18.8) 5591 (18.7) < 0.001 41,127 (18.7) 1800 (18.2) < 0.001 1–2 children 130,774 (56.9) 60,500 (56.8) 53,009 (56.7) 17,265 (57.9) 125,140 (56.9) 5634 (56.9) ≥ 3 children 56,079 (24.4) 25,883 (24.3) 22,905 (24.5) 7291 (24.4) 53,883 (24.5) 2196 (22.2) The association of social isolation and loneliness with incident cancer During 6.16 million person-years (mean 14.32 years) of follow-up, a total of 45,131 (10.49%) participants were diagnosed with cancer. In multivariable model, compared to participants in the least isolated group, those in the moderately or/and most isolated groups showed significantly higher risks of incident cancer in six categories, including oral cavity (most isolated: HR 1.32, 95% CI 1.11–1.57), digestive organs (most isolated: HR 1.09, 95% CI 1.03–1.16), respiratory organs (moderately isolated: HR 1.11, 95% CI 1.04–1.19; most isolated: HR 1.17, 95% CI 1.07–1.28), breast cancer (most isolated: HR 1.11, 95% CI 1.04–1.18), female genital organs (moderately isolated: HR 1.10, 95% CI 1.01–1.20; most isolated: HR 1.23, 95% CI 1.09–1.38), and urinary tract (most isolated: HR 1.31, 95% CI 1.17–1.46). However, in two categories, those in the moderately or/and most isolated groups had significantly lower risks of incident cancer, including mesothelial and soft tissue (moderately isolated: HR 0.85, 95% CI 0.73–0.98; most isolated: HR 0.80, 95% CI 0.64–0.99), prostate (most isolated: HR 0.88, 95% CI 0.83–0.94), and no significant positive or negative associations for the rest (The detailed results can be found in Fig. 1 S2  Fig. 1 Multivariable hazard ratios for most isolation vs. least isolation by cancer. Model was adjusted for age, sex, ethnicity, household income, college/university degree, Townsend deprivation index, body mass index (BMI, continuous), employment status, current smoking status, current alcohol consumption, sun exposure time, healthy diet score, healthy sleep score, family history of cancer, and history of hypertension and dyslipidemia. For models analyzing breast cancer and cancers of the female genital organs, additional adjustments were made for menopausal status, HRT and parity For loneliness, compared to participants in the no loneliness group, individuals in the loneliness group had a significantly increased risk of urinary tract cancer(HR 1.19, 95% CI 1.01–1.40), but exhibited a significantly reduced risk of skin cancer(HR 0.76, 95% CI 0.61–0.93), and no significant positive or negative associations for the rest (The detailed results can be found in Fig. 2  Fig. 2 Multivariable hazard ratios for loneliness vs. no-loneliness by cancer. Model was adjusted for age, sex, ethnicity, household income, college/university degree, Townsend deprivation index, body mass index (BMI, continuous), employment status, current smoking status, current alcohol consumption, sun exposure time, healthy diet score, healthy sleep score, family history of cancer, and history of hypertension and dyslipidemia. For models analyzing breast cancer and cancers of the female genital organs, additional adjustments were made for menopausal status, HRT and parity Joint analysis of social isolation and loneliness with incident cancer Accordingly, for participants experiencing both most social isolation and loneliness, there were progressively and significantly higher risks of cancer in four categories: oral cavity (HR 1.79, 95% CI 1.27–2.54), digestive organs (HR 1.19, 95% CI 1.03–1.26), female genital organs (HR 1.25, 95% CI 1.10–1.42), and urinary tract (most isolated: HR 1.31, 95% CI 1.17–1.46). Conversely, there was a decreasingly and significantly lower risk of skin cancer(HR 0.65, 95% CI 0.43–0.98), and no significant association for the remaining cancer types (The detailed results can be found in Supplemental Table S7 Furthermore, we analyzed the separate and joint associations of social isolation and loneliness with the risk of both single and multiple categories of cancer. Compared to participants in the least isolated group, those in the most isolated group had significantly higher risks of developing a single category of cancer (HR 1.05, 95% CI 1.02–1.07) and multiple categories of cancer (HR 1.19, 95% CI 1.02–1.37). Similarly, for participants experiencing both most social isolation and loneliness, there were significantly higher risks of a single category of cancer (HR 1.05, 95% CI 1.02–1.08) and multiple categories of cancer (HR 1.20, 95% CI 1.03–1.40) (The detailed results can be found in Fig. 3  Fig. 3 Separate and joint association of social isolation and loneliness with cancer risk. The analysis was performed in multivariable model (age, sex, ethnicity, household income, college/university degree, Townsend deprivation index, BMI, employment status, current smoking status, current alcohol consumption, sun exposure time, healthy diet score, healthy sleep score, family history of cancer, and history of hypertension and dyslipidemia) A B Subgroups and sensitivity analyses Nearly consistent results were observed in the subgroup analyses (Supplemental Table S8 29 In the sensitivity analyses, after excluding participants with a family history of cancer (Supplemental Table S30 31 S32 33 Discussion Our study represents the first comprehensive assessment of the impact of social isolation and loneliness on a wide range of cancer types within a large-scale prospective cohort, marking a novel contribution to the field. The key findings can be summarized as follows: loneliness and social isolation were separately and jointly associated with higher risks of developing most types of cancer, while being linked to lower risks of prostate and skin cancer. Additionally, social isolation was found to play a more significant role in estimating cancer risk compared to loneliness. While previous research has provided important insights into the relationship between loneliness, social isolation, and the risk of specific cancers, certain limitations still need to be addressed. For instance, previous studies have primarily focused on the individual associations of either social isolation or loneliness with cancer, without exploring their potential joint effects. Additionally, these studies were limited to only a few specific types of cancer, rather than examining a broad range of cancer types. Other concerns, such as insufficient follow-up durations and relatively small sample sizes, may further undermine the reliability of the conclusions drawn from prior research. In our study, we have addressed these limitations and provided a more comprehensive understanding of the associations between social isolation, loneliness and a wide range of cancer risks. Our study found that individuals with the most social isolation were at a higher risk of cancer than those with the least social isolation. Our study findings align with previous research that demonstrated low social support was linked to a higher risk of colorectal cancer incidence and mortality among men [ 27 38 29 In this large, population-based cohort study involving 430,376 participants, we found that loneliness elevated the risk of urinary tract cancer, but no significant positive or negative associations for the rest. A previous case-control study conducted in China enrolled a total of 324 urological cancer patients and 100 healthy controls. The study revealed that urological cancer patients experienced higher levels of loneliness and reduced spiritual well-being compared to healthy controls [ 30 Intriguingly, our study suggested that social isolation was associated with a lower risk of developing prostate cancer, the same goes for loneliness and skin cancer, which was beyond our thoughts. Elovainio Marko et al. came to the same conclusion with us, they assessed cancer risk among all Finnish people over 40, their study concluded that men living alone was associated with lower risk of prostate cancer and skin melanoma [ 29 28 39 Our study indicated that social isolation was more strongly associated with cancer than loneliness, consistent with others [ 33 40 40 33 41 Several mechanisms could explain the observed association between social isolation, loneliness, and incident cancer. First, traditional risk factors, underlying diseases, and unhealthy lifestyles might act as mediators or moderators [ 42 36 43 44 20 From a public health perspective, our findings emphasize the need to develop and validate reliable tools for screening social isolation and loneliness. A comprehensive, multi-level approach that integrates interventions at the individual, community, and societal levels, is crucial for effectively alleviating the burden of social isolation and loneliness. Strategies at the individual level include psychological therapies, social skills training, and socialization supporting [ 45 Although this study has notable strengths, such as its large sample size, reliable assessment of exposure, comprehensive data on covariates, complete follow-up, and inclusion of a wide range of cancer types, certain limitations should be acknowledged. First, although changes over time were acknowledged, we were unable to directly evaluate the potential underestimation of risks associated with these changes during the follow-up period. Second, participants in the UKB were predominantly of European descent, restricting the generalizability of the results to diverse ethnic and racial groups. Third, social isolation and loneliness could be affected by undiagnosed cancer or poor health at baseline. Fourth, observational study cannot draw causality between social isolation, loneliness and the incidence of cancer, which warrants more well-conducted intervention studies to verify. Despite these limitations, our study contributes to the growing literature demonstrating the association of social isolation, loneliness and a wide range of cancer risk. Future studies should incorporate randomized controlled trials to alleviate loneliness and social isolation among individuals experiencing or at high risk of these unhealthy psychological conditions. This approach will generate more robust evidence regarding the causality of the association between loneliness, social isolation and cancer. Conclusion This study provides novel evidence linking social isolation and loneliness to increased risks of a wide range of cancers, underscoring the urgent need to address these psychosocial factors as integral components of cancer prevention strategies. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements This study is conducted under application number 98124 for UK Biobank Resource. The authors gratefully thank all the participants and professionals contributing to the UK Biobank. Author contributions Conceptualization: Xiaojuan Liu. Software: Ping Chen, Junru Wang and Zhuoyuan Li. Formal analysis: Xiaojuan Liu, Ping Chen, Yongbin Zhu. Writing - Original Draft: Xiaojuan Liu, Jiafei Yang and Liqun Wang. Proposed critical revisions to the manuscript: Shulan He, Xian Sun. Funding acquisition: Xiaojuan Liu, Jiangping Li and Huifang Yang. Supervision: Jiangping Li and Huifang Yang. All authors contributed to the interpretation of the results, review, and approval of the final manuscript. Funding This work was supported by the Natural Science Foundation of Ningxia Province of China (2022AAC03174). Data availability The UK Biobank is an open-access resource, available at https://www.ukbiobank.ac.uk/researchers/, and can be obtained by submitting a data request proposal. The data that support the findings of this study were used under license for the current study (Application 98124), and thus are not publicly available. Declarations Ethics approval and consent to participate UK Biobank data has approval from the North West Multi-centre Research Ethics Committee (MREC) (REC reference: 21/NW/0157), and all participants provided written informed consent at recruitment to the study. All data collection and research use is in accordance with the Declaration of Helsinki. Consent for publication Not applicable. Competing interests The authors declare no competing interests. Clinical trial number Not applicable. Abbreviations UKB UK Biobank SD Standard deviation HR Hazard ratio CI Confidence interval NHS National Health Service ICD-10 International Classification of Diseases, 10th Revision BMI body mass index HRT hormone replacement therapy IQR interquartile range HPA hypothalamic–pituitary–adrenal MREC Multi-centre Research Ethics Committee NA Not applicable References 1. Ning D Fang Y Zhang W Association of habitual sleep duration and its trajectory with the risk of cancer according to sex and body mass index in a population-based cohort Cancer 2023 129 22 3582 94 10.1002/cncr.34951 37432142 Ning D, Fang Y, Zhang W. Association of habitual sleep duration and its trajectory with the risk of cancer according to sex and body mass index in a population-based cohort. Cancer. 2023;129(22):3582–94. 37432142 10.1002/cncr.34951 2. Bray F Laversanne M Weiderpass E Soerjomataram I The ever-increasing importance of cancer as a leading cause of premature death worldwide Cancer 2021 127 16 3029 30 10.1002/cncr.33587 34086348 Bray F, Laversanne M, Weiderpass E, Soerjomataram I. The ever-increasing importance of cancer as a leading cause of premature death worldwide. Cancer. 2021;127(16):3029–30. 34086348 10.1002/cncr.33587 3. Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Bray F Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 3 209 49 33538338 10.3322/caac.21660 Sung H, Ferlay J, Siegel RL, Laversanne M, Soerjomataram I, Jemal A, et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71(3):209–49. 33538338 10.3322/caac.21660 4. Maomao C He L Dianqin S Siyi H Xinxin Y Fan Y Shaoli Z Changfa X Lin L Ji P Current cancer burden in china: epidemiology, etiology, and prevention CANCER BIOL MED 2022 19 8 1121 38 10.20892/j.issn.2095-3941.2022.0231 36069534 PMC9425189 Maomao C, He L, Dianqin S, Siyi H, Xinxin Y, Fan Y, Shaoli Z, Changfa X, Lin L, Ji P, et al. Current cancer burden in china: epidemiology, etiology, and prevention. CANCER BIOL MED. 2022;19(8):1121–38. 36069534 10.20892/j.issn.2095-3941.2022.0231 PMC9425189 5. Lapane KL Lim E McPhillips E Barooah A Yuan Y Dube CE Health effects of loneliness and social isolation in older adults living in congregate long term care settings: a systematic review of quantitative and qualitative evidence Arch Gerontol Geriatr 2022 102 104728 10.1016/j.archger.2022.104728 35597183 PMC12102736 Lapane KL, Lim E, McPhillips E, Barooah A, Yuan Y, Dube CE. Health effects of loneliness and social isolation in older adults living in congregate long term care settings: a systematic review of quantitative and qualitative evidence. Arch Gerontol Geriatr. 2022;102:104728. 35597183 10.1016/j.archger.2022.104728 PMC12102736 6. Houle J Meunier S Coulombe S Mercerat C Gaboury I Tremblay G de Montigny F Cloutier L Roy B Auger N Peer positive social control and men’s health-promoting behaviors Am J Mens Health 2017 11 5 1569 79 10.1177/1557988317711605 28670962 PMC5675192 Houle J, Meunier S, Coulombe S, Mercerat C, Gaboury I, Tremblay G, et al. Peer positive social control and men’s health-promoting behaviors. Am J Mens Health. 2017;11(5):1569–79. 28670962 10.1177/1557988317711605 PMC5675192 7. Lem K McGilton KS Aelick K Iaboni A Babineau J Hewitt CD Edwards C Bretzlaff M Lender D Gibson JL Social connection and physical health outcomes among long-term care home residents: a scoping review BMC GERIATR 2021 21 1 722 10.1186/s12877-021-02638-4 34922469 PMC8683818 Lem K, McGilton KS, Aelick K, Iaboni A, Babineau J, Hewitt CD, Edwards C, Bretzlaff M, Lender D, Gibson JL, et al. Social connection and physical health outcomes among long-term care home residents: a scoping review. BMC GERIATR. 2021;21(1):722. 34922469 10.1186/s12877-021-02638-4 PMC8683818 8. Tuncgenc B van Mulukom V Newson M Social bonds are related to health behaviors and positive well-being globally SCI ADV 2023 9 2 eadd3715 10.1126/sciadv.add3715 36638167 PMC10957100 Tuncgenc B, van Mulukom V, Newson M. Social bonds are related to health behaviors and positive well-being globally. SCI ADV. 2023;9(2):eadd3715. 36638167 10.1126/sciadv.add3715 PMC10957100 9. Song Y Zhu C Shi B Song C Cui K Chang Z Gao G Jia L Fu R Dong Q Social isolation, loneliness, and incident type 2 diabetes mellitus: results from two large prospective cohorts in Europe and East Asia and Mendelian randomization EClinicalMedicine 2023 64 102236 10.1016/j.eclinm.2023.102236 37767193 PMC10520296 Song Y, Zhu C, Shi B, Song C, Cui K, Chang Z, Gao G, Jia L, Fu R, Dong Q, et al. Social isolation, loneliness, and incident type 2 diabetes mellitus: results from two large prospective cohorts in Europe and East Asia and Mendelian randomization. EClinicalMedicine. 2023;64:102236. 37767193 10.1016/j.eclinm.2023.102236 PMC10520296 10. Escalante E Golden RL Mason DJ Social isolation and loneliness: imperatives for health care in a post-COVID world JAMA 2021 325 6 520 1 10.1001/jama.2021.0100 33560310 Escalante E, Golden RL, Mason DJ. Social isolation and loneliness: imperatives for health care in a post-COVID world. JAMA. 2021;325(6):520–1. 33560310 10.1001/jama.2021.0100 11. Hoang P King JA Moore S Moore K Reich K Sidhu H Tan CV Whaley C McMillan J Interventions associated with reduced loneliness and social isolation in older adults: a systematic review and meta-analysis JAMA Netw Open 2022 5 10 e2236676 10.1001/jamanetworkopen.2022.36676 36251294 PMC9577679 Hoang P, King JA, Moore S, Moore K, Reich K, Sidhu H, et al. Interventions associated with reduced loneliness and social isolation in older adults: a systematic review and meta-analysis. JAMA Netw Open. 2022;5(10):e2236676. 36251294 10.1001/jamanetworkopen.2022.36676 PMC9577679 12. Cacioppo S Grippo AJ London S Goossens L Cacioppo JT Loneliness: clinical import and interventions Perspect Psychol Sci 2015 10 2 238 49 10.1177/1745691615570616 25866548 PMC4391342 Cacioppo S, Grippo AJ, London S, Goossens L, Cacioppo JT. Loneliness: clinical import and interventions. Perspect Psychol Sci. 2015;10(2):238–49. 25866548 10.1177/1745691615570616 PMC4391342 13. Teo RH Cheng WH Cheng LJ Lau Y Lau ST Global prevalence of social isolation among community-dwelling older adults: a systematic review and meta-analysis Arch Gerontol Geriatr 2023 107 104904 10.1016/j.archger.2022.104904 36563614 Teo RH, Cheng WH, Cheng LJ, Lau Y, Lau ST. Global prevalence of social isolation among community-dwelling older adults: a systematic review and meta-analysis. Arch Gerontol Geriatr. 2023;107:104904. 36563614 10.1016/j.archger.2022.104904 14. Surkalim DL Luo M Eres R Gebel K van Buskirk J Bauman A Ding D The prevalence of loneliness across 113 countries: systematic review and meta-analysis BMJ 2022 376 e67068 10.1136/bmj-2021-067068 PMC8826180 35140066 Surkalim DL, Luo M, Eres R, Gebel K, van Buskirk J, Bauman A, Ding D. The prevalence of loneliness across 113 countries: systematic review and meta-analysis. BMJ. 2022;376:e67068. 10.1136/bmj-2021-067068 PMC8826180 35140066 15. Golaszewski NM LaCroix AZ Godino JG Allison MA Manson JE King JJ Weitlauf JC Bea JW Garcia L Kroenke CH Evaluation of social isolation, loneliness, and cardiovascular disease among older women in the US JAMA Netw Open 2022 5 2 e2146461 10.1001/jamanetworkopen.2021.46461 35107574 PMC8811637 Golaszewski NM, LaCroix AZ, Godino JG, Allison MA, Manson JE, King JJ, Weitlauf JC, Bea JW, Garcia L, Kroenke CH, et al. Evaluation of social isolation, loneliness, and cardiovascular disease among older women in the US. JAMA Netw Open. 2022;5(2):e2146461. 35107574 10.1001/jamanetworkopen.2021.46461 PMC8811637 16. Dhanda N Hall A Martin J Does social isolation mediate the association between hearing loss and cognition in adults? A systematic review and meta-analysis of longitudinal studies Front Public Health 2024 12 1347794 10.3389/fpubh.2024.1347794 38292910 PMC10824982 Dhanda N, Hall A, Martin J. Does social isolation mediate the association between hearing loss and cognition in adults? A systematic review and meta-analysis of longitudinal studies. Front Public Health. 2024;12:1347794. 38292910 10.3389/fpubh.2024.1347794 PMC10824982 17. Lara E Martin-Maria N De la Torre-Luque A Koyanagi A Vancampfort D Izquierdo A Miret M Does loneliness contribute to mild cognitive impairment and dementia? A systematic review and meta-analysis of longitudinal studies Ageing Res Rev 2019 52 7 16 10.1016/j.arr.2019.03.002 30914351 Lara E, Martin-Maria N, De la Torre-Luque A, Koyanagi A, Vancampfort D, Izquierdo A, et al. Does loneliness contribute to mild cognitive impairment and dementia? A systematic review and meta-analysis of longitudinal studies. Ageing Res Rev. 2019;52:7–16. 30914351 10.1016/j.arr.2019.03.002 18. Courtin E Knapp M Social isolation, loneliness and health in old age: a scoping review Health Soc Care Community 2017 25 3 799 812 10.1111/hsc.12311 26712585 Courtin E, Knapp M. Social isolation, loneliness and health in old age: a scoping review. Health Soc Care Community. 2017;25(3):799–812. 26712585 10.1111/hsc.12311 19. Santini ZI Jose PE York CE Koyanagi A Nielsen L Hinrichsen C Meilstrup C Madsen KR Koushede V Social disconnectedness, perceived isolation, and symptoms of depression and anxiety among older Americans (NSHAP): a longitudinal mediation analysis Lancet Public Health 2020 5 1 e62 70 10.1016/S2468-2667(19)30230-0 31910981 Santini ZI, Jose PE, York CE, Koyanagi A, Nielsen L, Hinrichsen C, Meilstrup C, Madsen KR, Koushede V. Social disconnectedness, perceived isolation, and symptoms of depression and anxiety among older Americans (NSHAP): a longitudinal mediation analysis. Lancet Public Health. 2020;5(1):e62–70. 31910981 10.1016/S2468-2667(19)30230-0 20. Li H Xia N The role of oxidative stress in cardiovascular disease caused by social isolation and loneliness Redox Biol 2020 37 101585 10.1016/j.redox.2020.101585 32709420 PMC7767744 Li H, Xia N. The role of oxidative stress in cardiovascular disease caused by social isolation and loneliness. Redox Biol. 2020;37:101585. 32709420 10.1016/j.redox.2020.101585 PMC7767744 21. Qi X Pei Y Malone SK Wu B Social isolation, sleep disturbance, and cognitive functioning (HRS): a longitudinal mediation study The Journals of Gerontology: Series A 2023 78 10 1826 33 10.1093/gerona/glad004 PMC10562894 36617184 Qi X, Pei Y, Malone SK, Wu B. Social isolation, sleep disturbance, and cognitive functioning (HRS): a longitudinal mediation study. The Journals of Gerontology: Series A. 2023;78(10):1826–33. 10.1093/gerona/glad004 PMC10562894 36617184 22. Hodgson S Watts I Fraser S Roderick P Dambha-Miller H Loneliness, social isolation, cardiovascular disease and mortality: a synthesis of the literature and conceptual framework J R Soc Med 2020 113 5 185 92 10.1177/0141076820918236 32407646 PMC7366328 Hodgson S, Watts I, Fraser S, Roderick P, Dambha-Miller H. Loneliness, social isolation, cardiovascular disease and mortality: a synthesis of the literature and conceptual framework. J R Soc Med. 2020;113(5):185–92. 32407646 10.1177/0141076820918236 PMC7366328 23. Wootton RE Greenstone H Abdellaoui A Denys D Verweij K Munafo MR Treur JL Bidirectional effects between loneliness, smoking and alcohol use: evidence from a Mendelian randomization study Addiction 2021 116 2 400 6 10.1111/add.15142 32542815 Wootton RE, Greenstone H, Abdellaoui A, Denys D, Verweij K, Munafo MR, et al. Bidirectional effects between loneliness, smoking and alcohol use: evidence from a Mendelian randomization study. Addiction. 2021;116(2):400–6. 32542815 10.1111/add.15142 24. Fox RS Armstrong GE Gaumond JS Vigoureux TFD Miller CH Sanford SD Salsman JM Katsanis E Badger TA Reed DR Social isolation and social connectedness among young adult cancer survivors: a systematic review Cancer 2023 129 19 2946 65 10.1002/cncr.34934 37489837 PMC10584376 Fox RS, Armstrong GE, Gaumond JS, Vigoureux TFD, Miller CH, Sanford SD, et al. Social isolation and social connectedness among young adult cancer survivors: a systematic review. Cancer. 2023;129(19):2946–65. 37489837 10.1002/cncr.34934 PMC10584376 25. Hilakivi-Clarke L, de Oliveira AF. Social isolation and breast cancer. Endocrinology. 2023;164(10):bqad126. 10.1210/endocr/bqad126 37586098 26. Gallagher S Bennett KM Roper L Loneliness and depression in patients with cancer during COVID-19 J Psychosoc Oncol 2021 39 3 445 51 10.1080/07347332.2020.1853653 33274697 Gallagher S, Bennett KM, Roper L. Loneliness and depression in patients with cancer during COVID-19. J Psychosoc Oncol. 2021;39(3):445–51. 33274697 10.1080/07347332.2020.1853653 27. Ikeda A Kawachi I Iso H Iwasaki M Inoue M Tsugane S Social support and cancer incidence and mortality: the JPHC study cohort II Cancer Causes Control 2013 24 5 847 60 23549959 10.1007/s10552-013-0147-7 Ikeda A, Kawachi I, Iso H, Iwasaki M, Inoue M, Tsugane S. Social support and cancer incidence and mortality: the JPHC study cohort II. Cancer Causes Control. 2013;24(5):847–60. 23549959 10.1007/s10552-013-0147-7 28. Salmon C Quesnel-Vallee A Barnett TA Benedetti A Cloutier MS Datta GD Kestens Y Nicolau B Parent ME Neighbourhood social deprivation and risk of prostate cancer Br J Cancer 2023 129 2 335 45 10.1038/s41416-023-02299-7 37188877 PMC10338528 Salmon C, Quesnel-Vallee A, Barnett TA, Benedetti A, Cloutier MS, Datta GD, et al. Neighbourhood social deprivation and risk of prostate cancer. Br J Cancer. 2023;129(2):335–45. 37188877 10.1038/s41416-023-02299-7 PMC10338528 29. Elovainio M Lumme S Arffman M Manderbacka K Pukkala E Hakulinen C Living alone as a risk factor for cancer incidence, case-fatality and all-cause mortality: a nationwide registry study SSM 2021 15 100826 10.1016/j.ssmph.2021.100826 PMC8219898 34189239 Elovainio M, Lumme S, Arffman M, Manderbacka K, Pukkala E, Hakulinen C. Living alone as a risk factor for cancer incidence, case-fatality and all-cause mortality: a nationwide registry study. SSM. 2021;15:100826. 10.1016/j.ssmph.2021.100826 PMC8219898 34189239 30. Xia C Zhao X Li B Qi B Hong Y Loneliness, spiritual well-being, and death perception, as well as their risk factors in urological cancer patients BRAZ J MED BIOL RES 2023 56 e12915 10.1590/1414-431x2023e12915 37585919 PMC10427158 Xia C, Zhao X, Li B, Qi B, Hong Y. Loneliness, spiritual well-being, and death perception, as well as their risk factors in urological cancer patients. BRAZ J MED BIOL RES. 2023;56:e12915. 37585919 10.1590/1414-431X2023e12915 PMC10427158 31. Sudlow C Gallacher J Allen N Beral V Burton P Danesh J Downey P Elliott P Green J Landray M UK biobank: an open access resource for identifying the causes of a wide range of complex diseases of middle and old age PLoS Med 2015 12 3 e1001779 10.1371/journal.pmed.1001779 25826379 PMC4380465 Sudlow C, Gallacher J, Allen N, Beral V, Burton P, Danesh J, et al. UK biobank: an open access resource for identifying the causes of a wide range of complex diseases of middle and old age. PLoS Med. 2015;12(3):e1001779. 25826379 10.1371/journal.pmed.1001779 PMC4380465 32. Smith RW Barnes I Green J Reeves GK Beral V Floud S Social isolation and risk of heart disease and stroke: analysis of two large UK prospective studies Lancet Public Health 2021 6 4 e232 9 10.1016/S2468-2667(20)30291-7 33662329 PMC7994247 Smith RW, Barnes I, Green J, Reeves GK, Beral V, Floud S. Social isolation and risk of heart disease and stroke: analysis of two large UK prospective studies. Lancet Public Health. 2021;6(4):e232–9. 33662329 10.1016/S2468-2667(20)30291-7 PMC7994247 33. Elovainio M Hakulinen C Pulkki-Raback L Virtanen M Josefsson K Jokela M Vahtera J Kivimaki M Contribution of risk factors to excess mortality in isolated and lonely individuals: an analysis of data from the UK biobank cohort study Lancet Public Health 2017 2 6 e260 6 10.1016/S2468-2667(17)30075-0 28626828 PMC5463031 Elovainio M, Hakulinen C, Pulkki-Raback L, Virtanen M, Josefsson K, Jokela M, et al. Contribution of risk factors to excess mortality in isolated and lonely individuals: an analysis of data from the UK biobank cohort study. Lancet Public Health. 2017;2(6):e260-6. 28626828 10.1016/S2468-2667(17)30075-0 PMC5463031 34. Cao Z Xu C Li S Wang Y Yang H Residential greenspace and risk of cancer: a prospective cohort study from the UK biobank Sci Total Environ 2023 871 162145 10.1016/j.scitotenv.2023.162145 36773899 Cao Z, Xu C, Li S, Wang Y, Yang H. Residential greenspace and risk of cancer: a prospective cohort study from the UK biobank. Sci Total Environ. 2023;871:162145. 36773899 10.1016/j.scitotenv.2023.162145 35. Asaria M Doran T Cookson R The costs of inequality: whole-population modelling study of lifetime inpatient hospital costs in the English National health service by level of neighbourhood deprivation J Epidemiol Community Health 2016 70 10 990 6 10.1136/jech-2016-207447 27189975 PMC5036206 Asaria M, Doran T, Cookson R. The costs of inequality: whole-population modelling study of lifetime inpatient hospital costs in the English National health service by level of neighbourhood deprivation. J Epidemiol Community Health. 2016;70(10):990–6. 27189975 10.1136/jech-2016-207447 PMC5036206 36. Liang YY Chen Y Feng H Liu X Ai QH Xue H Shu X Weng F He Z Ma J Association of social isolation and loneliness with incident heart failure in a population-based cohort study JACC Heart Fail 2023 11 3 334 44 10.1016/j.jchf.2022.11.028 36737310 PMC9891238 Liang YY, Chen Y, Feng H, Liu X, Ai QH, Xue H, et al. Association of social isolation and loneliness with incident heart failure in a population-based cohort study. JACC Heart Fail. 2023;11(3):334–44. 36737310 10.1016/j.jchf.2022.11.028 PMC9891238 37. Li X Zhou T Ma H Huang T Gao X Manson JE Qi L Healthy sleep patterns and risk of incident arrhythmias J Am Coll Cardiol 2021 78 12 1197 207 10.1016/j.jacc.2021.07.023 34531019 PMC8454031 Li X, Zhou T, Ma H, Huang T, Gao X, Manson JE, et al. Healthy sleep patterns and risk of incident arrhythmias. J Am Coll Cardiol. 2021;78(12):1197–207. 34531019 10.1016/j.jacc.2021.07.023 PMC8454031 38. Lutgendorf SK DeGeest K Sung CY Arevalo JM Penedo F Lucci JR Goodheart M Lubaroff D Farley DM Sood AK Depression, social support, and beta-adrenergic transcription control in human ovarian cancer Brain Behav Immun 2009 23 2 176 83 10.1016/j.bbi.2008.04.155 18550328 PMC2677379 Lutgendorf SK, DeGeest K, Sung CY, Arevalo JM, Penedo F, Lucci JR, et al. Depression, social support, and beta-adrenergic transcription control in human ovarian cancer. Brain Behav Immun. 2009;23(2):176–83. 18550328 10.1016/j.bbi.2008.04.155 PMC2677379 39. Salmon C Quesnel-Vallee A Parent ME Family structure and living arrangements as indicators of social isolation, and prostate cancer risk Prev Med 2023 172 107544 10.1016/j.ypmed.2023.107544 37178831 Salmon C, Quesnel-Vallee A, Parent ME. Family structure and living arrangements as indicators of social isolation, and prostate cancer risk. Prev Med. 2023;172:107544. 37178831 10.1016/j.ypmed.2023.107544 40. Zhou J Tang R Wang X Li X Heianza Y Qi L Improvement of social isolation and loneliness and excess mortality risk in people with obesity JAMA Netw Open 2024 7 1 e2352824 10.1001/jamanetworkopen.2023.52824 38252435 PMC10804268 Zhou J, Tang R, Wang X, Li X, Heianza Y, Qi L. Improvement of social isolation and loneliness and excess mortality risk in people with obesity. JAMA Netw Open. 2024;7(1):e2352824. 38252435 10.1001/jamanetworkopen.2023.52824 PMC10804268 41. Christiansen J Lund R Qualter P Andersen CM Pedersen SS Lasgaard M Loneliness, social isolation, and chronic disease outcomes Ann Behav Med 2021 55 3 203 15 10.1093/abm/kaaa044 32865550 Christiansen J, Lund R, Qualter P, Andersen CM, Pedersen SS, Lasgaard M. Loneliness, social isolation, and chronic disease outcomes. Ann Behav Med. 2021;55(3):203–15. 32865550 10.1093/abm/kaaa044 42. National Academies of Sciences, Engineering, and Medicine; Division of Behavioral and Social Sciences and Education; Health and Medicine Division; Board on Behavioral, Cognitive, and Sensory Sciences; Board on Health Sciences Policy; Committee on the Health and Medical Dimensions of Social Isolation and Loneliness in Older Adults. Social isolation and loneliness in older adults: Opportunities for the health care system. National Academies Press (US). 2020. 32510896 43. Xiong Y Hong H Liu C Zhang YQ Social isolation and the brain: effects and mechanisms Mol Psychiatry 2023 28 1 191 201 10.1038/s41380-022-01835-w 36434053 PMC9702717 Xiong Y, Hong H, Liu C, Zhang YQ. Social isolation and the brain: effects and mechanisms. Mol Psychiatry. 2023;28(1):191–201. 36434053 10.1038/s41380-022-01835-w PMC9702717 44. Brown EG Gallagher S Creaven AM Loneliness and acute stress reactivity: a systematic review of psychophysiological studies Psychophysiology 2018 55 5 e13031 10.1111/psyp.13031 29152761 Brown EG, Gallagher S, Creaven AM. Loneliness and acute stress reactivity: a systematic review of psychophysiological studies. Psychophysiology. 2018;55(5):e13031. 29152761 10.1111/psyp.13031 45. Prohaska T Burholt V Burns A Golden J Hawkley L Lawlor B Leavey G Lubben J O’Sullivan R Perissinotto C Consensus statement: loneliness in older adults, the 21st century social determinant of health? BMJ OPEN 2020 10 8 e34967 10.1136/bmjopen-2019-034967 PMC7422633 32788184 Prohaska T, Burholt V, Burns A, Golden J, Hawkley L, Lawlor B, Leavey G, Lubben J, O’Sullivan R, Perissinotto C, et al. Consensus statement: loneliness in older adults, the 21st century social determinant of health? BMJ OPEN. 2020;10(8):e34967. 10.1136/bmjopen-2019-034967 PMC7422633 32788184 ",
  "metadata": {
    "Title of this paper": "Consensus statement: loneliness in older adults, the 21st century social determinant of health?",
    "Journal it was published in:": "BMC Public Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487387/"
  }
}