{
  "title": "Paper_1215",
  "abstract": "pmc Nanomaterials (Basel) Nanomaterials (Basel) 3130 nanomat nanomaterials Nanomaterials 2079-4991 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472363 PMC12472363.1 12472363 12472363 41003038 10.3390/nano15181402 nanomaterials-15-01402 1 Article Comparative Carcinogenicity of Double-Walled Carbon Nanotubes of Different Lengths Administered by Intratracheal Installation into Rat Lungs https://orcid.org/0000-0001-5241-2195 Ahmed Omnia Hosny Mohamed 1 2 3 * https://orcid.org/0000-0002-8848-6708 Saleh Dina Mourad 1 4 Alexander William T. 1 Takase Hiroshi 5 https://orcid.org/0000-0002-4612-0652 Taquahashi Yuhji 6 https://orcid.org/0000-0001-5386-5110 Hojo Motoki 7 Maeno Ai 7 Fukamachi Katsumi 8 Gi Min 9 https://orcid.org/0000-0003-1703-4883 Hirose Akihiko 10 Tsuruoka Shuji 11 † https://orcid.org/0000-0002-8139-8158 Takahashi Satoru 2 Tsuda Hiroyuki 1 2 https://orcid.org/0000-0003-0828-2033 Naiki-Ito Aya 2 * Malagù Cesare Academic Editor 1 drdina@aun.edu.eg william@phar.nagoya-cu.ac.jp htsuda@phar.nagoya-cu.ac.jp 2 sattak@med.nagoya-cu.ac.jp 3 4 5 takase@med.nagoya-cu.ac.jp 6 taquahashi@nihs.go.jp 7 8 kfukamac@med.nagoya-cu.ac.jp 9 mwei@omu.ac.jp 10 akihikoh@dranihs.net 11 sh.tsuruoka@neura.co.jp * omnia.hosny@aswu.edu.eg ayaito@med.nagoya-cu.ac.jp † Current address: Neura Inc., Tokyo 100-0005, Japan. 11 9 2025 9 2025 15 18 497662 1402 06 8 2025 01 9 2025 08 9 2025 11 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ We previously carried out an in vivo 2-year study to assess the potential toxicity/carcinogenicity of double-walled carbon nanotubes (DWCNTs) in a rat lung. We found that administration of DWCNTs by intratracheal–intrapulmonary spraying (TIPS) at a dose of 0.5 mg/rat induced the development of lung tumors in 7 of 24 treated rats while 1 of 21 untreated rats and 1 of 25 vehicle treated rats developed lung tumors. In the current study, we administered DWCNTs of different lengths, 1.5 µm, 7 µm, and 15 µm, to rats by TIPS to investigate the possible effect of the length of this thin, flexible CNT on toxicity/carcinogenicity in rat lungs. Rats were administered DWCNTs with lengths of 1.5 µm (D1.5), 7 µm (D7), and 15 µm (D15) by TIPS once every other day over the course of two weeks for a total of eight administrations. The total dose administered was approximately 22 × 10 12 carbon nanotubes DWCNT lung carcinogenicity rats MHLW Association H25-kagaku-ippan-004 H27-kagaku-shitei-004 H28-kagaku-ippan-004 H30-kagaku-shitei-004 JPMH19KD0101 JPMH20KD0201 JPMH21KD2004 JPMH23KD0101 YOG Specified Nonprofit Corporation Japan Chemical Industry Association Cultural Affairs and Missions Sector, Ministry of higher education of the Arab republic of Egypt This work was supported by the MHLW Association for Promotion of Research on Risk Assessment Program, grant numbers H25-kagaku-ippan-004 (2013–2015), H27-kagaku-shitei-004 (2015–2017), H28-kagaku-ippan-004 (2016–2018), H30-kagaku-shitei-004 (2018–2020), JPMH19KD0101 (2019–2021), JPMH20KD0201 (2020–2022), JPMH21KD2004 (2021–2023), and JPMH23KD0101 (2023–2025); the YOG Specified Nonprofit Corporation, Association for Promotion of Research on Risk Assessment (2018–2021); the Long-range Research Initiative, LRI, (2017–2019) of the Japan Chemical Industry Association; and the Cultural Affairs and Missions Sector, Ministry of higher education of the Arab republic of Egypt. Funding was provided by Research Grants awarded to Dina Mourad Saleh, Hiroyuki Tsuda and Aya Naiki-Ito. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Carbon nanotubes (CNTs) are extremely valuable materials with a wide range of applications. However, because of their light weight, individual CNTs and small CNT agglomerates are easily airborne and inhaled. Despite the widespread production and use of carbon nanotubes (CNTs), long-term in vivo studies to examine the toxicity and carcinogenicity of CNTs in the lung are extremely limited. To date, only eleven long-term lung carcinogenicity studies have been reported: Sargent et al. (2014) [ 1 2 3 4 5 6 7 8 9 10 Initial studies of CNTs administered the fibers by intraperitoneal and intrascrotal injection, as reviewed by Ahmed et al. (2025) [ 11 7 9 The mechanisms of CNT-induced carcinogenesis appear to differ between anatomical sites. In the peritoneal cavity, thick, rigid CNTs physically damage mesothelial cells, triggering the release of HMGB1 and promoting mesothelioma development [ 9 12 13 14 9 15 16 11 Given the established pulmonary carcinogenicity of DWCNTs [ 9 2. Materials and Methods 2.1. DWCNTs and MWCNT-7 DWCNTs of 3 different lengths, 1.5, 7, and 15 µm, were supplied by Neura Inc., Tokyo, Japan. These DWCNTs contained iron levels below the detectable limit. MWCNT-7 (40–50 wall layers, 66.8 nm mean diameter, 6.65 μm mean length) was supplied by Mitsui Chemicals Inc. (Tokyo, Japan). MWCNT-7 had an iron content of 0.3% by weight [ 16 2.2. CNT Suspensions DWCNT 1.5 µm in length (D1.5): 1.008 mg of D1.5 fibers with a total fiber count of 4.256 × 10 14 12 14 12 14 12 2.3. Animals Ten-week-old male F344/rats (F344/DuCrlCrlj) were purchased from Charles River Laboratories Japan, Inc., Kanagawa, Japan. Animals were housed in the Center for Experimental Animal Science of Nagoya City University Medical School, maintained on a 12/12 h light/dark cycle, and received an Oriental MF Basal diet (Oriental Yeast, Tokyo, Japan) and tap water ad libitum. The study was conducted according to the Guidelines for the Care and Use of Laboratory Animals of Nagoya City University Medical School (Nagoya, Japan), and the experimental protocol was approved by the Nagoya City University Animal Care and Use Committee. 2.4. Experimental Design After acclimatization for 2 weeks, the rats were divided into 6 groups of 16–20 animals each: Group 1—untreated, 18 rats; Group 2—vehicle, 18 rats; Group 3, D1.5, 18 rats; Group 4, D7, 16 rats; Group 5, D15, 16 rats; Group 6, MWCNT-7, 20 rats. One rat in the vehicle group and 3 rats in the D7 group died during weeks 29–30 due to mechanical failure of the drinking water supply system and were removed from the study; therefore, the vehicle group was composed of 17 rats, and the D7 group was composed of 13 rats. Immediately prior to each TIPS administration, the solutions containing the test materials were sonicated for 30 min, as previously described [ 9 Rats, under 3% isoflurane anesthesia, were administered the test materials in 500 µL saline containing 0.5% poloxamer 188 solution using TIPS once every other day over a 2-week period (total 8 doses). The single administration doses were 6.3 µg/2.660 × 10 12 12 12 13 13 13 At six weeks (4 weeks after the final TIPS administration), 5 rats per group underwent complete necropsy and histopathological examination to evaluate acute pulmonary effects. All rats that lived longer than 52 weeks were included in the assessment of mesothelioma development, and all rats that lived longer than 75 weeks were included in the assessment of chronic lung toxicity/carcinogenicity. All rats that were found in a moribund condition or found dead before the end of the study period at 104 weeks underwent complete necropsy and histopathological examination. A total of 11 of the 15 rats administered MWCNT-7 died before 75 weeks due to the development of malignant mesothelioma. To relieve the remaining 4 rats of unnecessary suffering, these rats were sacrificed at week 75. 2.5. Tissue Sampling and Histopathology The rats were deeply anesthetized by 5% isoflurane then killed by exsanguination from the inferior vena cava. The whole lung was excised, and the posterior lobe of right lung was tied off, and 10 mL of phosphate-buffered 4% paraformaldehyde solution was infused into the lung. The posterior lobe was frozen, and the remaining lobes were processed for histological analysis. The chest wall, major organs, and mediastinal and mesenteric lymph nodes were excised and fixed in phosphate-buffered 4% paraformaldehyde solution and processed for histological analysis. Identification of DWCNTs and MWCNT-7 in the lung and other tissue was confirmed using a microscope equipped with a polarizing lens (PLM; SX51N-31P-O, Olympus, Tokyo, Japan and N11599BNZ, KEYENCE, Osaka, Japan). Diagnosis of the induced lesions was performed by Hiroyuki Tsuda, M.D., Ph.D., a board-certified pathologist of the Japanese Society of Toxicologic Pathology (Diplomate of JSTP) and the Japanese Society of Pathology. Diagnosis is consistent with the INHAND project [ 17 The total number of granulomas and CD68-positive macrophages were counted manually within sections from the entire 4 lobes from the fixed lung tissue. Total lung areas were determined using an image analyzer (KEYENCE BZ-X810). The frequency of granulomas and CD68-positive macrophages was determined by dividing their total numbers by the total area of the lung tissue examined. Data are presented as count/cm 2 For the PCNA index, sections were incubated with anti-PCNA (Cell Signaling Technology, Danvers, MA, USA) in concentration of 1:2000. In each section, more than 1000 pulmonary epithelial cells and more than 500 visceral and parietal pleural mesothelial cells were counted blindly in random fields. All nuclei showing brown staining of more than half of the nucleus were considered to be positive. 2.6. Electron Microscopy The DWCNTs and MWCNT-7 test solutions used for TIPS administration were treated with ultrasound for 30 min, followed by placement on carbon supported film copper grid, and then observed by transmission electron microscopy (TEM) (JEM-1400Plus, JEOL, Tokyo, Japan). To observe CNTs present in the lung alveoli, H&E-stained slides prepared from paraffin embedded blocks were immersed in xylene to remove the cover glass, dried, coated with a layer of sublimated OsO4 using an osmium plasma coater (OPC80N; Filgen, Nagoya, Japan), and then processed for scanning electron microscopy (SEM) (S-4800, Hitachi, Tokyo, Japan). 2.7. CCL2, CCL3, and HO-1 ELISA Frozen non-tumor lung tissue samples (approximately 100 mg) were thawed and rinsed 3 times with ice-cold PBS and homogenized in 1 mL tissue protein extraction reagent (Thermo Scientific, Rockford, IL, USA) containing 1% ( v v g 2.8. Measurement of DWCNT and MWCNT in the Lung Measurement of the amount of CNT fibers in the lung tissue was performed as previously described [ 18 2.9. Statistical Analysis Statistical significance was analyzed using a 2-sided t p 3. Results 3.1. Characterization of Test CNTs After the 30 min sonication of the test solutions prior to TIPS administration, 20 µL of the test solution was processed for TEM. Representative TEM images of the three different DWCNTs and MWCNT-7 in suspension, prior to TIPS administration, are shown in Figure 1 19 Table 1 3.2. Lung Lesions at Six Weeks ( Table 2 Five rats from each group were sacrificed at 6 weeks (4 weeks after the final TIPS administration) to assess the acute lung toxicity of the CNTs. Granulomas were significantly increased in the lungs of rats treated with the three different DWCNTs and with MWCNT-7 ( Figure 2 Figure 3 Macrophages forming granulation tissue engulfed DWCNTs and MWCNT-7, and most of these phagocytes were positive for PCNA ( Figure 4 20 3.3. Survival Time One rat in the vehicle control group and three rats in the D7 group died during weeks 29–30 due to mechanical failure of the drinking water supply system. The remaining rats in the D7 group lived to the end of the study period. One rat in the D1.5 group and one rat in the D15 group died before week 75. The mean survival times of the untreated, vehicle, D1.5, D7, and D15 groups were 99.1 ± 10.1, 101 ± 5.9, 102 ± 7.9, 104, and 100 ± 8.7 weeks, respectively. In contrast to these groups, 11 rats treated with MWCNT-7 died before week 75 due to the development of malignant mesothelioma. 3.4. Incidence of Mesothelioma ( Table 3 All rats that survived for 52 weeks or longer were included in the assessment of pleural mesothelioma development. In the MWCNT-7 group, 11/15 rats developed pleural mesothelioma ( Figure 5 11 3.5. Incidence of Preneoplastic and Neoplastic Lesions in the Lung ( Table 4 One rat in the D1.5 group and one rat in the D15 group died before week 75. All of the rats in the untreated, vehicle, and D7 groups lived longer than 75 weeks. All rats in the control and DWCNT groups that lived longer than 75 weeks were included in the final assessment of the development of preneoplastic and neoplastic lesions in the lung. Due to the early deaths of the MWCNT-7-treated rats, accurate assessment of MWCNT-7-induced lung proliferative lesions was not possible. Therefore, the MWCNT-7 group is not included in Table 4 No hyperplastic or neoplastic bronchioloalveolar lesions were induced in the untreated or vehicle control groups. Development of bronchioloalveolar hyperplasia ( Figure 5 p p Figure 5 p p While accurate assessment of MWCNT-7-induced lung proliferative lesions was not possible, the four rats that did not die from malignant mesothelioma before 75 weeks were examined for proliferative lung lesions. One rat developed bronchioloalveolar hyperplasia, and two rats developed bronchioloalveolar carcinoma. None of the four rats developed bronchioloalveolar adenoma. 3.6. Fiber-Induced Toxicity Not Related to Pleural and Lung Toxicities No clinical signs or toxicities that were not related to pleural and lung toxicities were elevated in the DWCNT-administered groups compared to the control groups. 3.7. Alveolar Granulomas, CD68-Positive Macrophages, and PCNA-Positive Lung Alveolar Epithelial and Pleural Cell Counts at the Final Sacrifice ( Table 5 Fibers in the alveoli were phagocytosed by macrophages, forming granulomas ( Figure 6 Figure 7 Figure 8 Similarly to granuloma count and CD68-positive macrophages, there was a significant increase in PCNA labelling of alveolar epithelial cells in the DWCNT groups compared with untreated/vehicle controls, and PCNA labelling increased with the increase in DWCNT fiber length. In DWCNT- and MWCNT-7-treated rats, alveolar epithelial and some alveolar stromal cells were positive for PCNA, and many alveolar wall cells were also positive for PCNA ( Figure 9 Figure 9 Figure 9 3.8. CCL2, CCL3, and HO-1 in Non-Tumor Lung Tissue ( Table 6 CCL2, also known as Monocyte Chemoattractant Protein 1 (MCP-1), binds to chemokine receptors CCR2 and CCR4 and functions to attract and activate macrophages. CCL3, also known as monocyte inflammatory protein 1 alpha (MIP-1alpha), binds to chemokine receptors CCR1, CCR4, and CCR5 and functions to attract and activate macrophages and neutrophils and other lymphocytes. HO-1 is produced by macrophages as an anti-inflammatory mechanism [ 21 3.9. Fiber Retention in the Lungs The amounts (μg/g lung tissue) of the three different DWCNTs and MWCNT-7 were measured at week 6 and week 104 for DWCNTs and week 6 and week 75 for MWCNT-7 ( Figure 10 4. Discussion In the present study, we administered DWCNTs of different lengths into the lungs of rats using TIPS: 1.5 µm (D1.5), 7 µm (D7), and 15 µm (D15). Each of these groups of rats was administered approximately 22 × 10 12 One rat in the D15 group developed mesothelioma on the visceral pleura. This is significant compared to the incidence of spontaneous mesothelioma in male Fischer 344 rats, with 22 cases of spontaneous mesothelioma in 51,326 male rats [ 22 9 Figure 6 9 9 15 16 23 12 13 14 24 25 9 In the MWCNT-7-treated group, 11 rats died from malignant mesothelioma, which is similar to the results of our previous studies and agrees with the cytotoxicity and pleural malignancy of MWCNT-7 administered into the rat lung, discussed above. The four rats that did not die from malignant mesothelioma were examined for the development of proliferative lung lesions. One rat developed bronchioloalveolar hyperplasia, and two rats developed bronchioloalveolar carcinoma. None of the four rats developed bronchioloalveolar adenoma. These results are compatible with the study by Hojo et al. who administered MWCNT-7 to rats using TIPS once every 4 weeks over the course of 2 years [ 8 It is notable that the incidence of lung tumor development was not lower in the D1.5 group compared to the D15 group. While the same number of fibers were administered to the rats in the D1.5, D7, and D15 groups, the different lengths of the fibers resulted in substantial differences in the total amount of material administered. Rats in the D1.5 group were administered 0.0504 mg DWCNT, rats in the D7 group were administered 0.2323 mg DWCNT, and rats in the D15 group were administered 0.5040 mg DWCNT. At six weeks granulomas had developed in the lungs of all three groups, and the granulation tissue count increased in proportion to DWCNT fiber length. Thus, longer fibers, which means more material administered, caused the development of more granulation tissue than shorter fibers. The alveolar epithelial cell PCNA index also increased with increasing fiber length; however, the increases were less than the increases in granulation tissue count. In contrast to the increases in granulation tissue count and alveolar epithelial cell PCNA index, CD68-positive macrophage count did not increase with increasing fiber length. These findings at six weeks indicate that sequestration of fibers in granulation tissue dampened the biological reaction to the fibers and may have lessened the difference in the reaction to shorter versus longer fibers. At the final sacrifice, in addition to increases in granuloma count, increases in CD68-positive macrophages, CCL2, the alveolar epithelial cell PCNA index, and HO-1, which is involved in the generation of antioxidants, were found. All five parameters increased with increasing fiber length. These findings indicate that although the fibers were being sequestered in granulation tissue, DWCNT fibers were continuing to elicit a biological response. Thus, at 104 weeks, the difference in biological responses elicited by longer fibers versus shorter fibers was not proportional to the length of the fibers, likely due to sequestration of the fibers in granulation tissue; however, longer fibers appeared to elicit a stronger biological response compared to the shorter fibers. Thus, at both 6 weeks and 104 weeks, the longer fibers appeared to elicit a stronger biological response compared to the shorter fibers. In addition, bronchioloalveolar hyperplasia was found in the lungs of 5 of 8 rats in the D7 group and 5 of 10 rats in the D15 group, but no bronchioloalveolar hyperplasia was found in any of the 12 rats in the D1.5 group ( Table 4 Table 4 The most obvious explanation for the discrepancy in carcinogenicity versus administered DWCNT dose is the low number of rats administered the three different DWCNTs and administration of only a single dose of each of the three different DWCNTs to the rats. This limitation in the present study was due to the fact that we used DWCNT of precise lengths specifically manufactured for our study, resulting in very limited quantities of materials available for the study. A biologically relevant explanation for the observed pattern of biological responses observed in the present study is blockade of the smaller airways and bronchioles by the larger agglomerates formed by the longer fibers. This would result in decreased deposition of the longer fibers in the alveoli and decreased carcinogenicity elicited by the longer fibers. As shown in Table 4 Table 2 Table 2 Table 2 Table 4 Table 5 Table 6 Table 4 An important point is the development of bronchioloalveolar hyperplasia (BAH) in the D7 and D15 groups. In the D7 group, three rats developed carcinomas, and the other five rats developed BAH. In the D15 group, two rats developed carcinomas, and five of the remaining rats developed BAH. Thus, the incidence of proliferative lung lesions in the three groups was 4 of 12 rats in the D1 group, 8 of 8 rats in the D7 group, and 7 of 10 rats in the D15 group. Consequently, potential development of lung tumors increased with increasing DWCNT fiber length. This result agrees with the increase in CD68-positive lung macrophages and the increase in PCNA positive alveolar epithelial cells with increasing fiber length at week 104 ( Table 5 Another interesting possibility that there were differences in the molecular signatures of one bronchioloalveolar carcinoma that developed in a D1.5 rat and one bronchioloalveolar carcinoma that developed in a D7 rat. This suggests the possibility that the agglomerates formed by DWCNT fibers of different lengths may have different effects on carcinogenic pathways. One possible mechanism would be different effects on macrophages and the production of tissue-damaging ROS and other cytotoxic and DNA-damaging molecules as the macrophages attempt to destroy the alveoli-invading pathogens/fibers, and different effects on the production of chemokines and inflammatory cytokines. One possible mechanism by which shorter and longer fibers could interact differently with macrophages is by forming smaller and larger agglomerates, with the larger agglomerates exerting a more cytotoxic effect on the engulfing macrophage. This in turn would result in exposure of alveolar cells to increased levels of intracellular cytotoxic molecules produced by macrophages when macrophages interact with larger agglomerates, resulting in alveolar cell damage and increased alveolar cell proliferation to repair the damage. Such a mechanism could lead to the findings shown in Table 2 Using flexible MWCNTs that formed tangled agglomerates, two in vitro studies by Sweeney et al., 2014 [ 26 27 Figure 1 26 Table 2 In addition, the in vitro study by Sweeney et al. (2014) [ 26 It is also notable that at the final sacrifice, the levels of CCL2, CCL3, and HO-1 were not significantly increased in the MWCNT-7 group. This would appear to be due to the level of CD68-positive macrophages in the lungs of these rats at the final sacrifice: the D1.5-treated rats and the MWCNT-7-treated rats had similar levels of CD68-positive macrophages ( Table 5 Table 6 21 9 9 11 15 The increased levels of CD68-positive alveolar macrophages, the alveolar epithelial cell PCNA index, CCL2, HO-1, and hyperplasia at two years coupled with lower carcinogenicity per mg fiber in the D7 and D15 groups compared with the D1.5 group can also be explained by blockade of smaller airways and bronchioles by the aggregates formed by longer DWCNT fibers. As discussed above, blockade of smaller airways and bronchioles would result in deceased deposition of longer fibers in the alveoli coupled with decreased clearance of fibers via the mucociliary escalator. This would result in exposure to lower levels of fibers but for an increased period of time. Consequently, lung carcinogenesis in the D7 and D15 groups would be delayed compared to the D1.5 group. In addition, increased clearance of D1.5 fibers would result in decreased activity in response to these fibers. Therefore, at two years, the longer fibers would induce increased biological activity coupled with fewer fully developed tumors. In addition, macrophage cytotoxicity could also play a role the carcinogenic potential of DWCNT fibers of different lengths. Overall, the differences in carcinogenicity of the DWCNTs used in the present study can be explained by blockade of smaller airways and bronchioles, possibly in conjunction with increased macrophage cytotoxicity, and by the agglomerates formed by longer fibers; however, this premise needs to be verified in future studies. The major limitation of this study is the small number of rats administered each DWCNT. As noted above, this was due to the fact that we used DWCNTs of precise lengths specifically manufactured for our study, resulting in very limited quantities of materials available for the study. Despite this constraint, our findings are consistent with previous results demonstrating that double-walled carbon nanotubes (DWCNTs) are carcinogenic in rat lungs. Furthermore, the data suggest that the size and morphology of fiber agglomerates may influence carcinogenic potential. This highlights the importance of considering not only the intrinsic properties of carbon nanotubes, such as length and wall number, but also the physical form in which they are encountered. When evaluating the potential human health risks of CNT exposure, the characteristics of airborne agglomerates in occupational or environmental settings should be carefully taken into account. Acknowledgments The authors wish to thank Chisato Ukai for administrative assistance. The authors wish to thank the staff of the animal center at Nagoya City University Graduate School of Medical Sciences for monitoring and care of the test animals used in this study. This work was the result of using research equipment shared in MEXT Project for promoting public utilization of advanced research infrastructure (program for supporting construction of core facilities), grant number JPMXS0441500025. Disclaimer/Publisher’s Note: Author Contributions O.H.M.A. collected and prepared tissue samples, directed pathological examination, drafted and wrote the manuscript. D.M.S. characterized the materials used in this study, collected and prepared tissue samples, analyzed tissue samples, and characterized lung inflammation. W.T.A. helped prepare and administer the materials used in the study and assisted in animal care. H.T. (Hiroshi Takase) helped characterize the materials used in the study and performed SEM and TEM. Y.T., M.H., and A.M. performed measurement of the amount of CNT fibers in the lung tissue. K.F. helped prepare and administer the materials used in the study and assisted in animal care. M.G. contributed to the conception and design of the study and assisted in writing the manuscript. A.H. contributed to the conception and design of the study and confirmed the pathological analysis and analysis of tissue samples. S.T. (Shuji Tsuruoka) assisted Neura Inc. in the design of the different DWCNT lengths. S.T. (Satoru Takahashi) and A.N.-I. contributed to the conception and design of the study, assisted in pathological analysis, analysis of tissue samples, and assisted in writing the manuscript. A.N.-I. acquired funding for the study and gave final approval of the manuscript submitted for publication. H.T. (Hiroyuki Tsuda) acquired funding for the study and contributed to the conception and design of the study, directed pathological analysis, confirmed diagnosis of the induced lesions, assisted in writing the manuscript, and gave final approval of the manuscript submitted for publication. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved by the Nagoya City University Animal Care and Use Committee (protocol code 22-014 and date of approval 21 September 2022). Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding authors. Conflicts of Interest Author Shuji Tsuruoka was employed by the Neura Inc. The remaining authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Abbreviations The following abbreviations are used in this manuscript: DWCNT Double-walled carbon nanotube MWCNT Multi-walled carbon nanotube TIPS Trans-tracheal intra-pulmonary spraying CNT Carbon nanotube HMGB1 High mobility group box protein 1 PCNA Proliferating cell nuclear antigen SEM Scanning electron microscope TEM Transmission electron microscope References 1. Sargent L.M. Porter D.W. Staska L.M. Hubbs A.F. Lowry D.T. Battelli L. Siegrist K.J. Kashon M.L. Mercer R.R. Bauer A.K. Promotion of lung adenocarcinoma following inhalation exposure to multi-walled carbon nanotubes Part. Fibre Toxicol. 2014 11 3 10.1186/1743-8977-11-3 24405760 PMC3895742 2. Fujita K. Fukuda M. Fukui H. Horie M. Endoh S. Uchida K. Shichiri M. Morimoto Y. Ogami A. Iwahashi H. Intratracheal instillation of single-wall carbon nanotubes in the rat lung induces time-dependent changes in gene expression Nanotoxicology 2015 9 290 301 10.3109/17435390.2014.921737 24911292 PMC4487535 3. Suzui M. Futakuchi M. Fukamachi K. Numano T. Abdelgied M. Takahashi S. Ohnishi M. Omori T. Tsuruoka S. Hirose A. Multiwalled carbon nanotubes intratracheally instilled into the rat lung induce development of pleural malignant mesothelioma and lung tumors Cancer Sci. 2016 107 924 935 10.1111/cas.12954 27098557 PMC4946724 4. Kasai T. Umeda Y. Ohnishi M. Mine T. Kondo H. Takeuchi T. Matsumoto M. Fukushima S. Lung carcinogenicity of inhaled multi-walled carbon nanotube in rats Part. Fibre Toxicol. 2016 13 53 10.1186/s12989-016-0164-2 27737701 PMC5064785 5. Honda K. Naya M. Takehara H. Kataura H. Fujita K. Ema M. A 104-week pulmonary toxicity assessment of long and short single-wall carbon nanotubes after a single intratracheal instillation in rats Inhal. Toxicol. 2017 29 471 482 10.1080/08958378.2017.1394930 29110549 6. Numano T. Higuchi H. Alexander D.B. Alexander W.T. Abdelgied M. El-Gazzar A.M. Saleh D. Takase H. Hirose A. Naiki-Ito A. MWCNT-7 administered to the lung by intratracheal instillation induces development of pleural mesothelioma in F344 rats Cancer Sci. 2019 110 2485 2492 10.1111/cas.14121 31265162 PMC6676138 7. Saleh D.M. Alexander W.T. Numano T. Ahmed O.H.M. Gunasekaran S. Alexander D.B. Abdelgied M. El-Gazzar A.M. Takase H. Xu J. Comparative carcinogenicity study of a thick, straight-type and a thin, tangled-type multi-walled carbon nanotube administered by intra-tracheal instillation in the rat Part. Fibre Toxicol. 2020 17 48 10.1186/s12989-020-00382-y 33054855 PMC7559486 8. Hojo M. Maeno A. Sakamoto Y. Ohnuki A. Tada Y. Yamamoto Y. Ikushima K. Inaba R. Suzuki J. Taquahashi Y. Two-year intermittent exposure of a multiwalled carbon nanotube by intratracheal instillation induces lung tumors and pleural mesotheliomas in F344 rats Part. Fibre Toxicol. 2022 19 38 10.1186/s12989-022-00478-7 35590372 PMC9118836 9. Saleh D.M. Luo S. Ahmed O.H.M. Alexander D.B. Alexander W.T. Gunasekaran S. El-Gazzar A.M. Abdelgied M. Numano T. Takase H. Assessment of the toxicity and carcinogenicity of double-walled carbon nanotubes in the rat lung after intratracheal instillation: A two-year study Part. Fibre Toxicol. 2022 19 30 10.1186/s12989-022-00469-8 35449069 PMC9026941 10. Sheema A.N. Naiki-Ito A. Kakehashi A. Ahmed O.H.M. Alexander D.B. Alexander W.T. Numano T. Kato H. Goto Y. Takase H. Fullerene and fullerene whisker are not carcinogenic to the lungs and pleura in rat long-term study after 2-week intra-tracheal intrapulmonary administration Arch. Toxicol. 2024 98 4143 4158 10.1007/s00204-024-03863-7 39269499 PMC11496356 11. Ahmed O.H.M. Naiki-Ito A. Takahashi S. Alexander W.T. Alexander D.B. Tsuda H. A Review of the Carcinogenic Potential of Thick Rigid and Thin Flexible Multi-Walled Carbon Nanotubes in the Lung Nanomaterials 2025 15 168 10.3390/nano15030168 39940144 PMC11820818 12. Qi F. Okimoto G. Jube S. Napolitano A. Pass H.I. Laczko R. Demay R.M. Khan G. Tiirikainen M. Rinaudo C. Continuous exposure to chrysotile asbestos can cause transformation of human mesothelial cells via HMGB1 and TNF-alpha signaling Am. J. Pathol. 2013 183 1654 1666 10.1016/j.ajpath.2013.07.029 24160326 PMC3814524 13. Yang H. Rivera Z. Jube S. Nasu M. Bertino P. Goparaju C. Franzoso G. Lotze M.T. Krausz T. Pass H.I. Programmed necrosis induced by asbestos in human mesothelial cells causes high-mobility group box 1 protein release and resultant inflammation Proc. Natl. Acad. Sci. USA 2010 107 12611 12616 10.1073/pnas.1006542107 20616036 PMC2906549 14. Xue J. Patergnani S. Giorgi C. Suarez J. Goto K. Bononi A. Tanji M. Novelli F. Pastorino S. Xu R. Asbestos induces mesothelial cell transformation via HMGB1-driven autophagy Proc. Natl. Acad. Sci. USA 2020 117 25543 25552 10.1073/pnas.2007622117 32999071 PMC7568322 15. Nagai H. Okazaki Y. Chew S.H. Misawa N. Yamashita Y. Akatsuka S. Ishihara T. Yamashita K. Yoshikawa Y. Yasui H. Diameter and rigidity of multiwalled carbon nanotubes are critical factors in mesothelial injury and carcinogenesis Proc. Natl. Acad. Sci. USA 2011 108 E1330 E1338 10.1073/pnas.1110013108 22084097 PMC3241783 16. Sakamoto Y. Hojo M. Kosugi Y. Watanabe K. Hirose A. Inomata A. Suzuki T. Nakae D. Comparative study for carcinogenicity of 7 different multi-wall carbon nanotubes with different physicochemical characteristics by a single intraperitoneal injection in male Fischer 344 rats J. Toxicol. Sci. 2018 43 587 600 10.2131/jts.43.587 30298847 17. Renne R. Brix A. Harkema J. Herbert R. Kittel B. Lewis D. March T. Nagano K. Pino M. Rittinghausen S. Proliferative and Nonproliferative Lesions of the Rat and Mouse Respiratory Tract Toxicol. Pathol. 2009 37 5S 73S 10.1177/0192623309353423 20032296 18. Ohnishi M. Yajima H. Kasai T. Umeda Y. Yamamoto M. Yamamoto S. Okuda H. Suzuki M. Nishizawa T. Fukushima S. Novel method using hybrid markers: Development of an approach for pulmonary measurement of multi-walled carbon nanotubes J. Occup. Med. Toxicol. 2013 8 30 10.1186/1745-6673-8-30 24160567 PMC4177529 19. Walter D. Primary particles–agglomerates–aggregates Nanomaterials 2013 20 9 24 20. Williams K. Schwartz A. Corey S. Orandle M. Kennedy W. Thompson B. Alvarez X. Brown C. Gartner S. Lackner A. Proliferating cellular nuclear antigen expression as a marker of perivascular macrophages in simian immunodeficiency virus encephalitis Am. J. Pathol. 2002 161 575 585 10.1016/S0002-9440(10)64213-7 12163382 PMC1850726 21. Campbell N.K. Fitzgerald H.K. Dunne A. Regulation of inflammation by the antioxidant haem oxygenase 1 Nat. Rev. Immunol. 2021 21 411 425 10.1038/s41577-020-00491-x 33514947 22. Tokarz D.A. Gruebbel M.M. Willson G.A. Hardisty J.F. Pearse G. Cesta M.F. Spontaneous Primary Pleural Mesothelioma in Fischer 344 (F344) and Other Rat Strains: A Retrospective Review Toxicol. Pathol. 2022 50 167 175 10.1177/01926233211053631 34727809 PMC8831442 23. Rittinghausen S. Hackbarth A. Creutzenberg O. Ernst H. Heinrich U. Leonhardt A. Schaudien D. The carcinogenic effect of various multi-walled carbon nanotubes (MWCNTs) after intraperitoneal injection in rats Part. Fibre Toxicol. 2014 11 59 10.1186/s12989-014-0059-z 25410479 PMC4243371 24. Jube S. Rivera Z.S. Bianchi M.E. Powers A. Wang E. Pagano I. Pass H.I. Gaudino G. Carbone M. Yang H. Cancer cell secretion of the DAMP protein HMGB1 supports progression in malignant mesothelioma Cancer Res. 2012 72 3290 3301 10.1158/0008-5472.CAN-11-3481 22552293 PMC3389268 25. Wang Y. Jiang Z. Yan J. Ying S. HMGB1 as a Potential Biomarker and Therapeutic Target for Malignant Mesothelioma Dis. Markers 2019 2019 4183157 10.1155/2019/4183157 30891101 PMC6390248 26. Sweeney S. Berhanu D. Misra S.K. Thorley A.J. Valsami-Jones E. Tetley T.D. Multi-walled carbon nanotube length as a critical determinant of bioreactivity with primary human pulmonary alveolar cells Carbon. N. Y. 2014 78 26 37 10.1016/j.carbon.2014.06.033 25780270 PMC4357847 27. Sweeney S. Grandolfo D. Ruenraroengsak P. Tetley T.D. Functional consequences for primary human alveolar macrophages following treatment with long, but not short, multiwalled carbon nanotubes Int. J. Nanomed. 2015 10 3115 3129 10.2147/ijn.s77867 25960651 PMC4412488 Figure 1 Transmission electron microscopic findings of three DWCNTs and MWCNT-7 before administration. ( A B C D Figure 2 Granuloma formation in the alveoli at week 6. ( A B C D E F C F Figure 3 Alveolar CD68-positive macrophages (brown) at week 6. ( A B C D E F C E Figure 4 PCNA-positive macrophages (brown nuclei) in the alveoli at week 6. ( A B C D E F C F Figure 5 Proliferative lesions at the final sacrifice. ( A B C D Figure 6 Engulfment of the three different-length DWCNTs and MWCNT-7 by alveolar macrophages at the final sacrifice. ( A B C D E F C E E F C F Figure 7 CD68-positive alveolar macrophages (brown) at the final sacrifice. ( A B C D E F Figure 8 Scanning electron microscopic photos of DWCNTs engulfed by alveolar macrophages. ( A B A C D C A E F E G H G Figure 9 Proliferating cell nuclear antigen (PCNA) staining in the alveolar epithelial and parietal mesothelial cells from rats treated with DWCNT and MWCNT-7 at the final sacrifice. ( A F B G C H D I E J Figure 10 Comparison of retention rates of the three DWCNTs and MWCNT-7 in the lung at weeks 6 and 104 for DWCNTs and weeks 6 and 75 for MWCNT-7. The residual amounts of DWCNTs and MWCNT-7 in the lung tissue after 104 and 75 weeks are compared with those 6 weeks after administration. The results show increasing retention of fibers with increasing fiber agglomerate size ( Table 1 nanomaterials-15-01402-t001_Table 1 Table 1 Size of three DWCNTs and MWCNT-7 shortly before dosing.  DWCNT 1.5 μm DWCNT 7 μm DWCNT 15 μm MWCNT-7 Length of the 4.5 ± 2.2 μm 6.8 ± 8.2 μm 10.2 ± 5.8 μm 8.5 ± 4.5 μm Diameter of the 143.7 ± 120.1 nm 268.2 ± 416.1 nm 227.6 ± 172.5 nm 63.9 ± 20.0 nm All the DWCNT fibers form irregular agglomerates. At least 100 agglomerates formed by each of the fibers were measured. The lengths of the DWCNT agglomerates increase with increasing fiber length. nanomaterials-15-01402-t002_Table 2 Table 2 Count of granulomas, macrophages, and alveolar epithelial cell proliferation at week 6 $  Group Group 1 Group 2 Group 3 Group 4 Group 5 Group 6 Tissue  Untreated Vehicle DWCNT MWCNT-7 (0.5 # 1.5 μm (0.050 # 7 μm (0.232 # 15 μm (0.504 # Granuloma 2 0 ± 0 0.6 ± 0.5 12.1 ± 9.5 *** 50.5 ± 5.8 *** a 194.7 ± 36.2 *** b 49.8 ± 15.6 *** c Macrophage cell & 2 26.6 ± 19.4 124.3 ± 20.5 351.3 ± 26.6 *** 313.6 ± 15.5 *** 388.6 ± 29.3 *** d 468.6 ± 15.3 *** e Alveolar epithelial cell PCNA index % 1.24 ± 0.55 0.93 ± 0.25 1.96 ± 0.23 3.73 ± 2.19 * 8.53 ± 3.63 *** 3.74 ± 0.79 *** $ # & p a p b p c p d p e p nanomaterials-15-01402-t003_Table 3 Table 3 Incidence of pleural mesothelioma at the final sacrifice $  Group 1 Group 2 Group 3 Group 4 Group 5 Group 6 Untreated Vehicle DWCNT MWCNT-7 1.5 μm (0.050 # 7 μm (0.232 # 15 μm (0.504 # No. of rats examined 13 12 13 8 11 15 Mean survival time 99.1 ± 10.1 101 ± 5.9 102 ± 7.9 104 100 ± 8.7 74.9 ± 10.3 Pleural 0 0 0 0 1 12 *** $ # p nanomaterials-15-01402-t004_Table 4 Table 4 Incidence of lung proliferative lesions at the final sacrifice $  Group 1 Group 2 Group 3 Group 4 Group 5 Untreated Vehicle DWCNT 1.5 μm (0.050 # 7 μm (0.232 # 15 μm (0.504 # No. of rats examined 13 12 12 8 10 Mean survival time 99.1 ± 10.1 101 ± 5.9 102 ± 7.9 104 100 ± 8.7 Bronchioloalveolar lesions 0 0 0 5 ** 5 ** Adenoma (BAA) 0 0 0 0 0 Carcinoma (BAC) 0 0 4 * 3 * 2 $ # p p nanomaterials-15-01402-t005_Table 5 Table 5 Alveolar granulomas, CD68-positive macrophages, and PCNA-positive alveolar epithelial and pleural mesothelial cell count at the final sacrifice $ Group Group 1 Group 2 Group 3 Group 4 Group 5 Group 6 Tissue Untreated Vehicle DWCNT MWCNT-7 1.5 μm (0.050 # 7 μm (0.232 # 15 μm (0.504 # Granuloma 2 1.0 ± 0.8 1.0 ± 0.8 43.7 ± 14.4 *** 133.7 ± 46.3 *** a 188.5 ± 71.2 *** b 83.8 ± 42.0 *** Macrophage cell & 2 78.5 ± 15.1 87.2 ± 16.2 250.4 ± 48.8 *** 323.6 ± 36.5 *** c 427.6 ± 96.8 *** d 224.4 ± 82.3 *** e Alveolar epithelial cell PCNA index % 2.1 ± 0.1 1.9 ± 0.6 12.4 ± 4.5 ** 18.7 ± 4.2 ** 29.2 ± 9.8 *** f 24.5 ± 14.1 *** Pleural mesothelial cell PCNA index % 0.4 ± 0.4 0.5 ± 0.2 0.8 ± 0.5 1.0 ± 0.6 0.9 ± 0.6 37.4 ± 12.5 *** g $ # & p a p b p c p d p e p f p g p nanomaterials-15-01402-t006_Table 6 Table 6 Levels of inflammatory cytokines in non-tumor lung tissue at the final sacrifice $  Group 1 Group 2 Group 3 Group 4 Group 5 Group 6 Untreated Vehicle DWCNT MWCNT-7 1.5 μm (0.050 # 7 μm (0.232 # 15 μm (0.504 # CCL2 pg/mg 0.06 ± 0.01 0.07 ± 0.01 0.09 ± 0.03 0.13 ± 0.04 ** 0.21 ± 0.04 *** 0.10 ± 0.03 CCL3 pg/mg 0.24 ± 0.05 0.21 ± 0.05 0.22 ± 0.03 0.21 ± 0.02 0.14 ± 0.03 0.15 ± 0.02 HO-1 pg/mg 0.25 ± 0.22 0.194 ± 0.11 0.17 ± 0.06 0.44 ± 0.03 * 0.62 ± 0.27 * 0.11 ± 0.06 $ # p ",
  "metadata": {
    "Title of this paper": "Functional consequences for primary human alveolar macrophages following treatment with long, but not short, multiwalled carbon nanotubes",
    "Journal it was published in:": "Nanomaterials",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472363/"
  }
}