{
  "title": "Paper_29",
  "abstract": "pmc Thorac Cancer Thorac Cancer 2735 tca TCA Thoracic Cancer 1759-7706 1759-7714 Wiley PMC12490315 PMC12490315.1 12490315 12490315 41037061 10.1111/1759-7714.70169 TCA70169 2444337 1 Original Article Original Article Survival Effectiveness of Uniport Anatomic Resections in Patients With Clinical Stage I Lung Cancer: An Observation Cohort Study Wu Ching Feng  1  2  3 Hsieh Ming Ju  1 Fang Yueh Fu  4 Lin Yi Yu  1 Rivas Diego Gonzalez  2  3 Wu Ching Yang  1 wu.chingyang@gmail.com   1 Chang Gung University, Division of Thoracic and Cardiovascular Surgery, Department of Surgery Chang Gung Memorial Hospital Linkou Taiwan   2 Coruña University Hospital; Minimally Invasive Thoracic Surgery Unit (UCTMI), Department of Thoracic Surgry Coruña Spain   3 Chang Gung University Department of Thoacic Medicine, Chang Gung Memorial Hospital Linkou Taiwan   4 Division of Pulmonary and Critical care Medicine Department of Internal Medicine, Chang Gung Memotial Hospital Linkou Taiwan * Correspondence: wu.chingyang@gmail.com 02 10 2025 10 2025 16 19 498188 10.1111/tca.v16.19 e70169 11 9 2025 11 7 2025 15 9 2025 02 10 2025 03 10 2025 03 10 2025 © 2025 The Author(s). Thoracic Cancer https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Objective Although uniportal video‐assisted thoracoscopic surgery (uVATS) is increasingly adopted for early‐stage lung cancer, long‐term survival data comparing different forms of anatomic resection remain limited. This study aimed to evaluate the long‐term oncologic outcomes—specifically, 5‐year disease‐free survival (DFS) and overall survival (OS)—of patients with clinical stage I non‐small cell lung cancer (NSCLC) who underwent uVATS segmentectomy or lobectomy. Secondary outcomes included perioperative parameters and complication rates. Method We conducted a retrospective analysis of patients with clinical stage I NSCLC who underwent uVATS anatomical resection (lobectomy or segmentectomy) between January 2014 and December 2020. The primary endpoints were 5‐year DFS and OS, while the secondary endpoints included operative time, drainage duration, hospital stay, conversion rates, and postoperative complications. Results A total of 386 patients with clinical stage I NSCLC underwent uVATS anatomical resection, with 280 receiving lobectomy and 106 undergoing segmentectomy. The 5‐year DFS and OS rates did not significantly differ between segmentectomy and lobectomy for patients with pathological stage IA tumors. Segmentectomy was associated with a shorter drainage duration. The overall conversion rate to multiple‐port VATS or thoracotomy was 1.8%, with no 30‐day surgical mortality observed. Prolonged air leaks were the most common complication. Conclusion uVATS anatomical resection is an effective treatment option for clinical stage I NSCLC, offering comparable long‐term survival outcomes for segmentectomy and lobectomy in selected patients. Further prospective studies are warranted to confirm these findings and optimize patient selection. Uniportal VATS segmentectomy and lobectomy yielded similar long‐term survival in stage I NSCLC. Segmentectomy offered faster recovery but fewer N1 nodes. Recurrence was local in stage IA and distant in higher stages, emphasizing stage‐specific surveillance. CTR > 0.5 and stage ≥ IB predicted recurrence. lobectomy lung cancer segmentectomy uniportal VATS pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:02.10.2025  C. F. Wu M. J. Hsieh Y. F. Fang Y. Y. Lin D. G. Rivas C. Y. Wu Survival Effectiveness of Uniport Anatomic Resections in Patients With Clinical Stage I Lung Cancer: An Observation Cohort Study Thoracic Cancer 16 19 2025 e70169 10.1111/1759-7714.70169  Funding: 1 Introduction Early‐stage lung cancers are detectable using low‐dose computed tomography (CT) [ 1 2 3 4 5 6 7 8 2 Materials and Methods We conducted a retrospective chart review of prospectively collected data from a single medical center. The study was conducted in accordance with the Declaration of Helsinki (as revised in 2013) and was independently assessed by the Chang Gung Memorial Hospital Institutional Review Board (IRB No: 202400105B0). Informed consent was waived due to the retrospective design. Patients who underwent uniportal anatomical lung resection between January 1, 2014, and December 31, 2020, were identified and followed through December 31, 2023. Patients were excluded if they had oligometastatic or benign lesions, received neoadjuvant therapy, or were diagnosed with diseases other than clinical stage I non‐small cell lung cancer (NSCLC), according to the AJCC 9th edition Figure 1a FIGURE 1 Flow chart of uniport video‐assisted thoracoscopic surgery (uVATS) anatomic resection performed on patients with clinical stage 1 lung cancer. (A) Flow chart of uVATS segmentectomy and lobectomy performed on patients with clinical stage 1 lung cancer. (B) Flow chart: differentiating multiple primary lung cancer from intrapulmonary metastasis. Abbreviations: MPLC, multiple primary lung cancer; AIS, adenocarcinoma in situ; MIA, minimally invasive adenocarcinoma; IM, intrapulmonary metastasis. 2.1 Preoperative Evaluation and Basic Technique Preoperative evaluation was conducted to confirm staging and assess surgical candidacies for all patients with clinical stage I non‐small cell lung cancer (NSCLC). Baseline cardiopulmonary assessments, including spirometry and electrocardiography, were routinely performed. Imaging studies—chest computed tomography (CT), positron emission tomography (PET), brain magnetic resonance imaging (MRI), and bone scintigraphy—were used to evaluate tumor extent and exclude distant metastases. In cases with suspected mediastinal lymphadenopathy, bronchoscopy and lymph node biopsy were performed to further assess nodal status. Each case was reviewed by a multidisciplinary team, which verified the diagnosis and finalized the clinical staging. For patients found postoperatively to have multiple lung tumors, a comprehensive review was undertaken to differentiate multiple primary lung cancers from intrapulmonary or pulmonary‐to‐pulmonary metastases. This assessment incorporated: (a) detailed histological analysis, (b) radiologic characteristics on CT imaging, (c) PET standardized uptake values (SUVs), and (d) optional tumor‐specific genetic testing, performed at the patient's expense. Treatment strategies, including decisions on adjuvant therapy or surveillance, were based on the tumor with the most advanced pathological stage. Figure 1b 2.2 Surgical Technique Following intravenous induction, each patient was intubated with a double‐lumen endotracheal tube for single‐lung ventilation, with continuous monitoring of vital signs throughout the procedure. Patients were positioned in the lateral decubitus position, while the surgeon and assistant operated from the abdominal side. A 2.5‐cm incision was made in the anterior axillary line at the fourth intercostal space for upper lobe resection or the fifth intercostal space for middle and lower lobe resections. A soft plastic wound protector was applied to the incision, avoiding rib spreading. A 10‐mm 30° thoracoscope was positioned superiorly to the incision for visualization. Dissections were performed with an electric hook or energy device. The bronchus, vein, and artery were separately dissected and divided using an endostapler or Hem‐o‐lok Polymer Locking Ligation. The resected specimen was placed in a plastic bag and removed from the thoracic cavity; the final wound size was adjusted to ensure safe specimen extraction without damage. Before closure, an air leak test was conducted and monitored via endoscope. A 16 Fr chest tube was placed for pleural cavity drainage. Criteria for tube removal included the absence of air leaks and a drainage volume of < 250 mL/day. 3 Statistical Analysis Continuous variables were assessed for normality using the Shapiro–Wilk test and reported as median (IQR) if non‐normally distributed. Categorical variables were presented as counts and percentages. Group comparisons were made using the Mann–Whitney U p 4 Results A total of 728 patients underwent uniportal anatomical lung resection during the study period. After applying exclusion criteria, 386 patients with clinical stage I NSCLC, harboring 403 tumors, were included in the final analysis. Patient characteristics are summarized in Table 1 1 TABLE 1 Baseline and perioperative characteristics of patients undergoing uVATS anatomic resection ( n Category Variable Value (median[IQR]) Demographics Age (years) 64.0 [57.0–71.0] Body mass index (kg/m 2 24.6 [22.8–27.4] Gender Male: 223 (57.8%) Female: 163 (42.2%) Smoking status Yes: 187 (48.4%) No: 199 (51.6%) ECOG performance status 0: 257 (66.6%) 1: 129 (33.4%) Prior malignancy Yes: 94 (24.4%) No: 292 (75.6%) Coronary artery diseases Yes: 55 (14.2%) No: 331 (85.8%) COPD Yes: 49 (12.7%) No: 337 (87.3%) Preoperative evaluation Pre‐op PET performed Yes: 359 (93.0%) No: 27 (7.0%) CT consolidation‐to‐tumor ratio ≤ 0.5: 131 (33.9%) > 0.5: 255 (66.1%) FEV1 (L) 2.1 [1.7–2.5] CT tumor size (cm) 1.63 (1.2–2.2) Clinical stage (AJCC 9th ed.) 1A1 44 (11.4%) 1A2 150 (38.9%) 1A3 101 (26.2%) 1B 78 (20.2%) Synchronous multiple lesions  a 13 (3.4%) Operative variables Type of surgery Segmentectomy: 106 (27.5%) Lobectomy: 280 (72.5%) Operation time (min) 165.0 [122.0–195.0] Pathologic tumor size (cm) 1.6 [1.2–2.3] N1 lymph nodes retrieved 5.0 [4.0–7.0] N2 lymph nodes retrieved 9.0 [6.0–12.8] Tumor location RUL: 127 (32.9%) RML: 28 (7.3%) RLL: 87 (22.5%) LUL: 91 (23.6%) LLL: 53 (13.7%) Conversion Multiport VATS: 2 (0.5%) Thoracotomy: 5 (1.3%) None: 379 (98.2%) Postoperative course Drainage duration (days) 3.0 [2.0–4.0] Hospital stay (days) 4.0 [3.0–5.0] 30‐day mortality 0 (0%) Complications—all 46 (11.9%) Common complications  Air leak > 5 days: 26 Arrhythmia: 8 Pneumonia: 6 Others: 6 Pathology Histology  Adenocarcinoma: 304 (78.8%) Squamous cell carcinoma: 43 (11.1%) Others: 39 (10.1%) Pathological stage (AJCC 9th ed.) 0 (AIS) 4 (1.0%) 1A1 47 (12.2%) 1A2 118 (30.6%) 1A3 68 (17.6%) 1B 77 (19.9%) 2A 28 (7.3%) 2B 26 (6.7%) 3A 17 (4.4%) 4A 1 (0.3%) Abbreviations: COPD, chronic obstructive pulmonary disease; CT, computed tomography; FEV1, forced expiratory volume in 1 s; PET, positron emission tomography; RUL/RML/RLL/LUL/LLL, right/left upper/middle/lower lobes.  a The most advanced pathological stage was recorded in patients with multiple primary lung cancers. 4.1 Subgroup Analysis of Perioperative Outcomes 4.1.1  DFS OS The median follow‐up duration was 76 (54.0–93.0) months. Nodal upstaging occurred in 15.1% of the patients. Adenocarcinoma was the most frequently diagnosed type of lung cancer, followed by squamous cell carcinoma; other types of malignant tumors constituted a relatively small proportion. The 5‐year DFS and OS rates for patients with different p‐stages were as follows: 0 and IA1, 100% and 100%, respectively; IA2, 84.6% and 94.9%, respectively; IA3, 83.1% and 91.8%, respectively; IB, 66% and 79.5%, respectively. The OS and DFS rates of patients carrying tumors from the remaining pathological stages are depicted in Figure 2A,B p p FIGURE 2 Disease‐free survival (DFS) and overall survival (OS) in clinical stage I patients undergoing uniport VATS (uVATS) anatomic resection were analyzed. (A) DFS across the cohort by AJCC 9th classification. (B) OS for uVATS in the same cohort. (C) DFS in pathological stage IA patients. (D) OS of pathological stage IA patients treated with uVATS. 4.2 Subgroup Analysis of DFS OS A total of 233 patients with pathological stage 1A tumors underwent uVATS anatomic resections. The patient data are listed in Table 2 p p 2C,D p p p p 3A–D 3E TABLE 2 Characteristics of patients with pathological IA tumors treated using lobectomy and segmentectomy. Characteristic of pathological 1A patients ( n Variables Lobectomy Segmentectomy  p  n  n Age 64.0 (56.0–71.8) 64.5 (58.0–71.0) 0.73 Gender 0.006 Male 89 36 Female 58 50 ECOG 0.39 0 107 58 1 40 28 FEV1 (l) 2.3 (1.8–2.7) 1.8 (1.6–2.2) < 0.001 Operation time (min) 170.0 (133.5–207.5) 151.0 (113.0–186.0) 0.001 Drainage day (days) 3.0 (2.0–4.0) 2.0 (2.0–3.0) 0.001 Post op hospital stay (days) 4.0 (3.0–4.8) 3.0 (3.0–4.0) 0.095 No of N1 lymph node 5.5 (4.0–7.0) 4.0 (2.3–6.0) 0.003 No of N2 lymph node 8.0 (6.0–12.5) 9.0 (6.0–12.5) 0.78 FIGURE 3 Subgroup analysis of uniport VATS (uVATS) anatomic resection in pathological stage IA3 and IB‐IV patients, including recurrence patterns: (A) DFS for IA3 patients undergoing segmentectomy versus lobectomy. (B) OS for IA3 patients undergoing segmentectomy vs. lobectomy. (C) DFS for IB‐IV patients undergoing segmentectomy vs. lobectomy. (D) OS for IB‐IV patients undergoing segmentectomy vs. lobectomy. (E) Recurrence patterns in IA and IB‐IV patients. We identified two significant risk factors for disease recurrence in the whole cohort: the consolidation to tumor ratio and pathological staging (IA vs. IB~IV) (Table 3 TABLE 3 Recurrent risk factor analysis in patients with clinical stage I lung cancer treated using uniport anatomic resection. Cox proportional hazard model for recurrence Univariate analysis Multivariate analysis Variables HR (95% CI)  p HR (95% CI)  p Gender (female vs. male) 0.8 (0.64–0.99) 0.042 1.15 (0.86–1.52) 0.34 Smoking history (no vs. yes) 0.66 (0.53–0.81) < 0.001 0.55 (0.58–1.05) 0.10 CT ratio (≤ 0.5 vs. > 0.5) 0.42 (0.30–0.59) < 0.001 0.61 (0.42–0.83) 0.009 Operation method (segmentectomy vs. lobectomy) 0.64 (0.48–0.86) 0.003 0.95 (0.70–1.28) 0.72 Angiolymphatic invasion (no vs. yes) 0.58 (0.47–0.72) < 0.001 0.84 (0.67–1.05) 0.13 Differential grade < 0.001 0.10 Moderate vs. well 1.19 (0.90–1.58) 0.23 1.09 (0.82–1.45) 0.55 Poor vs. well 1.80 (1.36–2.89) < 0.001 1.30 (0.97–1.76) 0.08  Pathological stage (AJCC9TH) IA vs. IB‐IV 0.46 (0.37–0.58) < 0.001 0.6 (0.47–0.76) < 0.001 All 13 patients with multiple primary lung cancer identified by the lung cancer multidisciplinary team were discovered to harbor pathological stage 1A tumors. No instance of recurrence was recorded throughout the follow‐up period, indicating 5‐year DFS and OS rates of 100%. 5 Discussion The success of novel lung cancer treatment techniques depends on demonstrating long‐term oncologic effectiveness. While uVATS has been validated for safety and feasibility, few studies have reported survival outcomes due to its recent adoption and the concurrent shift from AJCC 7th to 9th edition staging system [ 6 8 9 10 11 12 Only 17 patients with lung cancer of a higher stage than IA3 were treated through segmentectomy. Eleven of those patients chose segmentectomy because of their poor physiological conditions. The subsequent pathology reports revealed one patient with N1, two patients with N2, and 12 patients with visceral pleural invasion. Although the DFS and OS rates did not differ significantly between the two groups of this study, nearly half of the patients who underwent segmentectomy died due to other underlying health conditions (Figure 3C,D 13 14 15 16 We discovered that most recurrence events occurred within 1–4 years of surgery, which aligns with the findings of previous studies [ 17 18 19 20 21 Early‐stage lung cancer is being increasingly diagnosed in clinical settings by using low‐dose CT screening [ 22 23 24 25 24 This study has several limitations, primarily due to its retrospective, single‐center design. Although the sample size was reasonable, the findings may not be generalizable to broader populations or clinical settings. Because this study was conducted at a single high‐volume institution with substantial uVATS expertise, the findings may not be fully generalized to centers with varying levels of experience. Validation in multicenter, prospective cohorts is essential to confirm the reproducibility and broader applicability of these results. The inclusion of patients with multiple pulmonary nodules—some < 0.6 cm and lacking distinct imaging characteristics—presents classification challenges [ 24 25 26 12 16 18 6 Conclusion Our results suggest that uVATS segmentectomy may provide oncologic outcomes comparable to lobectomy in clinical stage I NSCLC, particularly in well‐selected patients. However, given the retrospective design and lack of formal equivalence testing, these findings should be interpreted with caution. Future prospective, non‐inferiority or equivalence trials are needed to establish whether uVATS segmentectomy can be considered truly oncologically equivalent to lobectomy. Author Contributions Conceptualization: Ching Feng Wu, Ching Yang Wu, Diego Gonzalez Rivas. Methodology: Ching Feng Wu, Ming Ju Hsieh, Ching Yang Wu. Data Acquisition and Analysis: Yi Yu Lin, Ching Feng Wu, Ching Yang Wu. Writing, Original Draft: Ching Feng Wu, Ching Yang Wu. Writing, Review and Editing: Ching Feng Wu, Diego Gonzalez Rivas. Supervision: Ming Ju Hsieh. Ethics Statement This retrospective study was approved by Chang Gung Memorial Hospital Clinical Research Ethics Committee (202400105B0). Consent Because this was a retrospective study, the requirement for informed consent was waived. Conflicts of Interest The authors declare no conflicts of interest. Data Availability Statement The data that support the findings of this study are available on request from the corresponding author. The data are not publicly available due to privacy or ethical restrictions. References 1 S. J. Adams E. Stone D. R. Baldwin R. Vliegenthart P. Lee F. J. Fintelmann Lung Cancer Screening Lancet 401 4 2023 390 408 10.1016/S0140-6736(22)01694-4 36563698 2 Y. Gesthalter R. Smyth D. Sullivan Treatment of Early‐Stage Non‐Small Cell Lung Cancer American Journal of Respiratory and Critical Care Medicine 205 4 2022 P7 P8 35166649 10.1164/rccm.2054P7 3 D. S. Ettinger D. E. Wood D. L. Aisner Non‐Small Cell Lung Cancer, Version 3.2022, NCCN Clinical Practice Guidelines in Oncology Journal of the National Comprehensive Cancer Network 20 5 2022 497 530 35545176 10.6004/jnccn.2022.0025 4 W. Yang G. Zhang S. Pan Comparison of the Perioperative Efficacy Between Single‐Port and Two‐Port Video‐Assisted Thoracoscopic Surgery Anatomical Lung Resection for Non‐Small Cell Lung Cancer: A Systematic Review and Meta‐Analysis Journal of Thoracic Disease 11 7 2019 2763 2773 31463104 10.21037/jtd.2019.07.12 PMC6688006 5 C. G. Harris R. S. James D. H. Tian Systematic Review and Meta‐Analysis of Uniportal Versus Multiportal Video‐Assisted Thoracoscopic Lobectomy for Lung Cancer Annals of Cardiothoracic Surgery 5 2 2016 76 84 10.21037/acs.2016.03.17 27134832 PMC4827401 6 C. F. Wu R. Fernandez M. de la Torre Mid‐Term Survival Outcome of Single‐Port Video‐Assisted Thoracoscopic Anatomical Lung Resection: A Two‐Centre Experience European Journal of Cardio‐Thoracic Surgery 54 2 2018 252 259 29514185 10.1093/ejcts/ezy067 7 C. C. Tu P. K. Hsu Global Development and Current Evidence of Uniportal Thoracoscopic Surgery Journal of Thoracic Disease 8 S3 2016 S308 S318 27014479 10.3978/j.issn.2072-1439.2016.02.53 PMC4783717 8 Y. Ruan W. Cao H. Xue M. You Z. Zhao Long‐Term Outcome of Uniport vs. Multiport Video‐Assisted Thoracoscopic Lobectomy for Lung Cancer Scientific Reports 14 1 2024 5316 10.1038/s41598-024-55737-8 38438473 PMC10912317 9 N. K. Altorki X. Wang D. Wigle Perioperative Mortality and Morbidity After Sublobar Versus Lobar Resection for Early‐Stage Non‐Small‐Cell Lung Cancer: Post‐Hoc Analysis of an International, Randomised, Phase 3 Trial (CALGB/Alliance 140503) Lancet Respiratory Medicine 6 12 2018 915 924 10.1016/S2213-2600(18)30411-9 30442588 PMC6396275 10 H. Saji M. Okada M. Tsuboi Segmentectomy Versus Lobectomy in Small‐Sized Peripheral Non‐Small‐Cell Lung Cancer (JCOG0802/WJOG4607L): A Multicentre, Open‐Label, Phase 3, Randomised, Controlled, Non‐Inferiority Trial Lancet 399 10335 2022 1607 1617 35461558 10.1016/S0140-6736(21)02333-3 11 N. Altorki X. Wang D. Kozono Lobar or Sublobar Resection for Peripheral Stage IA Non‐Small‐Cell Lung Cancer New England Journal of Medicine 388 6 2023 489 498 10.1056/NEJMoa2212083 36780674 PMC10036605 12 N. Altorki X. Wang B. Damman Lobectomy, Segmentectomy, or Wedge Resection for Peripheral Clinical T1aN0 Non‐Small Cell Lung Cancer: A Post Hoc Analysis of CALGB 140503 (Alliance) Journal of Thoracic and Cardiovascular Surgery 167 1 2024 338 347 10.1016/j.jtcvs.2023.07.008 37473998 PMC10794519 13 H. Nomori I. Yamazaki Y. Machida Lobectomy Versus Segmentectomy: A Propensity Score‐Matched Comparison of Postoperative Complications, Pulmonary Function and Prognosis Interactive Cardiovascular and Thoracic Surgery 34 1 2022 57 65 10.1093/icvts/ivab212 34999814 PMC8743134 14 S. S. Razi D. Nguyen N. Villamizar Lobectomy Does Not Confer Survival Advantage Over Segmentectomy for Non‐Small Cell Lung Cancer With Unsuspected Nodal Disease Journal of Thoracic and Cardiovascular Surgery 159 6 2020 2469 2483 10.1016/j.jtcvs.2019.10.165 31928821 15 P. J. Speicher L. Gu B. C. Gulack Sublobar Resection for Clinical Stage IA Non‐Small‐Cell Lung Cancer in the United States Clinical Lung Cancer 17 1 2016 47 55 10.1016/j.cllc.2015.07.005 26602547 PMC5040950 16 B. M. Stiles J. Mao S. Harrison Extent of Lymphadenectomy is Associated With Oncological Efficacy of Sublobar Resection for Lung Cancer ≤2 Cm Journal of Thoracic and Cardiovascular Surgery 157 6 2019 2454 2465 10.1016/j.jtcvs.2019.01.136 30954298 17 F. Lou C. S. Sima V. W. Rusch D. R. Jones J. Huang Differences in Patterns of Recurrence in Early‐Stage Versus Locally Advanced Non‐Small Cell Lung Cancer Annals of Thoracic Surgery 98 5 2014 1755 1760 10.1016/j.athoracsur.2014.05.070 25110337 PMC4256682 18 A. L. Potter C. L. Costantino R. A. Suliman Recurrence After Complete Resection for Non‐Small Cell Lung Cancer in the National Lung Screening Trial Annals of Thoracic Surgery 116 4 2023 684 692 10.1016/j.athoracsur.2023.06.004 37356517 19 D. Jiwangga S. Cho K. Kim S. Jheon Recurrence Pattern of Pathologic Stage I Lung Adenocarcinoma With Visceral Pleural Invasion Annals of Thoracic Surgery 103 4 2017 1126 1131 10.1016/j.athoracsur.2016.09.052 27993377 20 Y. Kudo H. Saji Y. Shimada Impact of Visceral Pleural Invasion on the Survival of Patients With Non‐Small Cell Lung Cancer Lung Cancer 78 2 2012 153 160 10.1016/j.lungcan.2012.08.004 22944144 21 C. I. Bayarri‐Lara P. D. de Miguel A. Cueto Ladrón de Guevara Association of Circulating Tumour Cells With Early Relapse and 18F‐Fluorodeoxyglucose Positron Emission Tomography Uptake in Resected Non‐Small‐Cell Lung Cancers European Journal of Cardio‐Thoracic Surgery 52 1 2017 55 62 10.1093/ejcts/ezx049 28369376 22 D. E. Wood E. A. Kazerooni D. Aberle NCCN Guidelines Insights: Lung Cancer Screening, Version 1.2022 Journal of the National Comprehensive Cancer Network 20 7 2022 754 764 10.6004/jnccn.2022.0036 35830884 23 M. M. Hammer L. L. Palazzo C. Y. Kong A. R. Hunsaker Cancer Risk in Subsolid Nodules in the National Lung Screening Trial Radiology 293 2 2019 441 448 10.1148/radiol.2019190905 31526256 PMC6823608 24 M. Mascalchi C. E. Comin E. Bertelli Screen‐Detected Multiple Primary Lung Cancers in the ITALUNG Trial Journal of Thoracic Disease 10 2 2018 1058 1066 10.21037/jtd.2018.01.95 29607181 PMC5864678 25 S. Ghosh A. C. Mehta S. Abuquyyas S. Raju C. Farver Primary Lung Neoplasms Presenting as Multiple Synchronous Lung Nodules European Respiratory Review 29 157 2020 190142 10.1183/16000617.0142-2019 32878970 PMC9648507 26 H. Asamura K. K. Nishimura D. J. Giroux IASLC Lung Cancer Staging Project: The New Database to Inform Revisions in the Ninth Edition of the TNM Classification of Lung Cancer Journal of Thoracic Oncology 18 5 2023 564 575 10.1016/j.jtho.2023.01.088 36773775 ",
  "metadata": {
    "Title of this paper": "IASLC Lung Cancer Staging Project: The New Database to Inform Revisions in the Ninth Edition of the TNM Classification of Lung Cancer",
    "Journal it was published in:": "Thoracic Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490315/"
  }
}