{
  "title": "Paper_947",
  "abstract": "pmc Front Nutr Front Nutr 2731 fnut Front. Nutr. Frontiers in Nutrition 2296-861X Frontiers Media SA PMC12476995 PMC12476995.1 12476995 12476995 41031358 10.3389/fnut.2025.1624852 1 Nutrition Original Research The inflammatory potential of diet in adults with knee osteoarthritis: sex-specific associations with quality of life, sleep, fatigue and mental health Law Lynette  1 Heerey Joshua J.  1 Devlin Brooke L.  2 Brukner Peter  1 De Livera Alysha M.  1  3 Hebert James R.  4 Price Sherry  4 White Nathan P.  5 Culvenor Adam G.  1  * 1 La Trobe Sport and Exercise Medicine Research Centre, School of Allied Health, Human Services and Sport, La Trobe University Melbourne, VIC Australia 2 School of Human Movement and Nutrition Sciences, University of Queensland Brisbane, QLD Australia 3 Department of Mathematics and Statistics, School of Computing, Engineering and Mathematical Sciences, La Trobe University Melbourne, VIC Australia 4 Cancer Prevention and Control Program, Department of Epidemiology and Biostatistics, Arnold School of Public Health, University of South Carolina Columbia, SC United States 5 Melbourne Knee Centre Melbourne, VIC Australia Edited by: Xiwei Fan Reviewed by: Paola De Luca Yang Chen *Correspondence: Adam G. Culvenor, a.culvenor@latrobe.edu.au 15 9 2025 2025 12 480739 1624852 08 5 2025 25 8 2025 15 09 2025 30 09 2025 01 10 2025 Copyright © 2025 Law, Heerey, Devlin, Brukner, De Livera, Hebert, Price, White and Culvenor. 2025 Law, Heerey, Devlin, Brukner, De Livera, Hebert, Price, White and Culvenor https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Knee osteoarthritis (OA) is a disabling condition—characterized by pain, stiffness, and impaired quality of life—that affects more females than males. Chronic systemic inflammation is a key feature of knee OA and can be modulated by diet. We evaluated the sex-specific relationship between the inflammatory potential of diet and health-related quality of life (HRQOL), sleep quality, energy and fatigue levels, and psychological distress in individuals with knee OA. Methods This cross-sectional study analyzed baseline data from 144 participants (64% female) aged 45–85 years with symptomatic knee OA enrolled in the FEAST (eFEct of an Anti-inflammatory diet for knee oSTeoarthritis) randomized controlled trial, which compared an anti-inflammatory dietary program to a standard low-fat dietary program. Dietary inflammatory potential was assessed using the dietary inflammatory index (DII ® Results Male and female participants had a mean ± standard deviation BMI of 30.4 ± 3.8 and 30.2 ± 7.2 kg/m 2 Conclusion No associations were found between dietary inflammatory potential and sleep quality, fatigue, or psychological distress. A more proinflammatory diet was linked to lower energy levels in males with symptomatic knee OA. Findings from the FEAST trial will clarify whether reducing dietary inflammation improves these outcomes over time. osteoarthritis chronic inflammation health-related quality of life anti-inflammatory diet dietary inflammatory index sleep National Health and Medical Research Council 10.13039/501100000925 The authors declare that financial support was received for the research and/or publication of this article. The FEAST trial is supported by the National Health and Medical Research Council (NHMRC) of Australia through an Investigator Grant held by AGC (GNT2008523) and a philanthropic donation from PB. For the purposes of open access, the author has applied a CC BY public copyright license to any author accepted manuscript version arising from this submission. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Nutritional Epidemiology 1 Introduction Knee osteoarthritis (OA) is a common and disabling condition driven by chronic systemic inflammation ( 1 2 3 4 5 6 7 8 9 10 9 Diet can modulate systemic inflammation by exerting either anti-inflammatory or pro-inflammatory effects ( 11 13 14 15 16 17 18 19 The inflammatory potential of diets can be assessed using the dietary inflammatory index (DII ® 20 21 20 22 8 Given the high burden of knee OA and its impact beyond the joint, it is critical to understand whether diet-associated inflammation influences these outcomes and if these relationships differ by sex, which may have implications for treatment approaches. This study aimed to assess the sex-specific associations between dietary inflammatory potential and HRQOL, sleep quality, energy and fatigue levels, and psychological distress in adults with symptomatic knee OA. 2 Materials and methods 2.1 Study design and participants The current study is an exploratory cross-sectional analysis of baseline data from 144 participants in the FEAST (eFEct of an anti-inflammatory diet for knee oSTeoarthritis) randomized controlled trial, that investigates the effectiveness of an anti-inflammatory dietary program compared to a usual care low-fat dietary program in adults with symptomatic knee OA ( 8 23 2.2 Measurement of dietary inflammatory potential Dietary inflammatory potential was assessed using the E-DII and DII. Details regarding the development of E-DII and DII are described elsewhere ( 21 ® 21 24 21 21 2.3 Outcomes 2.3.1 Health-related quality of life HRQOL was assessed with the EQ-5D-5L ( 25 25 26 27 25 2.3.2 Assessment of sleep quality, and energy and fatigue levels Sleep quality, energy, and fatigue levels in the last 7 days were self-reported by participants on a 100-point VAS, each with specific anchors: sleep quality (0 = worst sleep possible, 100 = best sleep possible); energy levels (0 = not at all energetic, 100 = extremely energetic); and fatigue (0 = extremely/always fatigued, 100 = not at all fatigued). 2.3.3 Assessment of participant characteristics Participant demographic and socioeconomic characteristics, including age, ethnicity, comorbid medical conditions, and employment status were recorded at baseline via self-reported questionnaires. Height and weight were recorded with a stadiometer and column scales, respectively, and used to calculate body mass index [BMI = weight(kg)/height(m) 2 2.3.4 Psychological distress Psychological distress was assessed with the Kessler Psychological Distress Scale (K10) ( 28 29 30 2.4 Statistical analysis Statistical analysis was conducted using Stata, V.12 (StataCorp, College Station, Texas, USA). Participant characteristics were summarized descriptively. Data were first inspected using plots, such as histograms. Categorical data were presented as percentages with frequency, and continuous data presented using mean and standard deviation. Data found to be skewed were presented using median with IQRs (25th–75th centile). Linear regression models with interaction terms were used to obtain sex-specific associations of the dietary inflammatory indices (E-DII, DII) with EQ-5D (utility score, VAS), sleep quality, energy and fatigue levels, and K-10 score. Models with and without adjustment for covariates were used, and the model coefficients, 95% confidence intervals (CI) and associated p a priori 31 32 33 3 Results Of the 144 participants, 92 (64%) were female, and 52 (36%) were male. Females had mean ± SD age 65 ± 8 years, BMI 30.2 ± 7.2 kg/m 2 Table 1 2 TABLE 1 Participant baseline characteristics. Baseline variable Females ( n Males ( n Age, years 65 ± 8 67 ± 8 Weight, kg 80.0 ± 19.7 93.8 ± 14.7 Height, cm 163 ± 6 175 ± 8 Body mass index, kg/m 2 30.2 ± 7.2 30.4 ± 3.8  Body mass index categories (%) Normal (< 25 kg/m 2 18 (20) 2 (4) Overweight (≥ 25 to < 30 kg/m 2 35 (38) 24 (46) Obese (≥ 30 kg/m 2 39 (42) 26 (50)  EQ-5D Utility score α 0.81 ± 0.19 0.85 ± 0.10 VAS β 69.2 ± 19.2 71.2 ± 19.0  Self-perceived health indicators * Sleep quality 51.8 ± 22.2 61.4 ± 26.3 Energy levels 53.6 ± 22.3 60.3 ± 20.5 Fatigue levels 52.3 ± 23.9 58.7 ± 23.2 E-DII ‡ −0.35 ± 1.34 −0.26 ± 1.52 DII ∧ 0.72 ± 1.49 0.33 ± 1.45 K10 score † 17.1 ± 6.1 14.6 ± 4.1  K10 scores by category † Low distress (10–15) 45 (49) 35 (67) Moderate distress (16–21) 27 (30) 13 (25) High distress (22–29) 16 (17) 3 (6) Very high distress (30–50) 4 (4) 1 (2) Values indicate mean (± SD) for continuous variables with normal distribution and n α β *In the last 7 days, rated on a 100 mm VAS (0 = worst quality, 100 = best quality). ∧ ‡ † Higher E-DII scores were associated with lower energy levels in males (unadjusted β = −3.47, 95% CI −7.41 to 0.46; adjusted β = −4.01, 95% CI −7.91 to −0.30) ( Table 2 Table 3 Supplementary Figures 1 2 TABLE 2 Associations between E-DII, HRQOL, sleep quality, energy and fatigue levels. Unadjusted analysis Adjusted analysis * Male ( n Female ( n Male ( n Female ( n Variable β (95% CI) p β (95% CI) p β (95% CI) p β (95% CI) p EQ-5D VAS 0.14 (−3.35 to 3.63) 0.936 −2.04 (−5.00 to 0.92) 0.176 −0.36 (−3.80 to 3.08) 0.836 −1.30 (−4.25 to 1.65) 0.386 EQ-5D-5L utility 0.01 (−0.02 to 0.04) 0.357 −0.03 (−0.05 to −0.001)  0.045 0.01 (−0.02 to 0.03) 0.588 −0.02 (−0.04 to 0.01) 0.181 Sleep quality VAS −2.06 (−6.40 to 2.28) 0.350 0.35 (−3.34 to 4.03) 0.853 −2.33 (−6.71 to 2.05) 0.294 0.74 (−3.02 to 4.49) 0.699 Energy levels VAS −3.47 (−7.41 to 0.46) 0.083 −0.94 (−4.28 to 2.40) 0.577 −4.01 (−7.91 to −0.30)  0.034 0.02 (−3.23 to 3.28) 0.991 Fatigue levels VAS −0.91 (−5.24 to 3.42) 0.678 −0.95 (−4.62 to 2.72) 0.609 −1.06 (−5.44 to 3.32) 0.633 −0.76 (−4.51 to 3.00) 0.691 Kessler 10 −0.10 (−1.11 to 0.91) 0.846 −0.10 (−0.95 to 0.76) 0.820 −0.11 (−0.85 to 1.07) 0.822 −0.41 (−1.23 to 0.41) 0.327 Linear regression assessed the association between E-DII and baseline characteristics. Bold values indicate p *Adjusted for age and BMI. TABLE 3 Associations between DII and HRQOL, sleep quality, energy and fatigue levels. Unadjusted analysis Adjusted analysis * Male ( n Female ( n Male ( n Female ( n Variable β (95% CI) p β (95% CI) p β (95% CI) p β (95% CI) p EQ-5D VAS −0.67 (−4.35 to 3.00) 0.719 −0.01 (−0.03 to 0.02) 0.837 −1.44 (−5.06 to 2.19) 0.435 0.75 (−1.88 to 3.37) 0.576 EQ-5D-5L utility score −0.02 (−0.02 to 0.05) 0.338 −0.01 (−0.03 to 0.02) 0.719 0.01 (−0.02 to 0.04) 0.537 0.01 (−0.02 to 0.03) 0.642 Sleep quality VAS −2.04 (−6.58 to 2.50) 0.376 −1.09 (−4.20 to 2.21) 0.514 −2.44 (−7.05 to 2.17) 0.297 −0.94 (−4.29 to 2.40) 0.577 Energy levels VAS −4.34 (−8.44 to −0.23)  0.039 0.007 (−2.98 to 2.99) 0.996 −5.10 (−9.08 to −1.13)  0.012 0.76 (−2.12 to 3.64) 0.603 Fatigue levels VAS −2.57 (−7.07 to 1.93) 0.261 −1.55 (−4.82 to 1.73) 0.352 −2.93 (−7.51 to 1.64) 0.207 −1.55 (−4.87 to 1.78) 0.357 Kessler 10 0.12 (−0.92 to 1.17) 0.819 0.46 (−0.30 to 1.22) 0.236 0.38 (−0.63 to 1.40) 0.453 0.27 (−0.46 to 1.01) 0.459 Linear regression assessed the association between DII and baseline characteristics. Bold values indicate p *Adjusted for age and BMI. 4 Discussion This cross-sectional study is the first to explore the association between dietary inflammatory potential and key quality of life outcomes in males and females with symptomatic knee OA. Higher E-DII scores (reflecting more pro-inflammatory diets) were associated with lower energy levels in males. Similarly, higher DII scores were associated with lower energy levels in males, but given the paucity of previous research in this area, the clinical significance of these findings are unknown. No associations were found between DII and HRQOL, sleep quality, fatigue, or psychological distress in either sex. These findings are partly consistent with our previous work ( 22 22 There is limited evidence in knee OA populations for direct comparison with our findings. A study by Toopchizadeh et al. ( 34 n 18 18 8 While chronic systemic inflammation is strongly tied to sleep disturbances ( 35 36 37 38 39 41 42 43 5 7 44 45 46 47 48 49 In addition to improved disease-specific outcomes, a reported benefit of lowering dietary inflammatory potential is improved energy levels and less fatigue ( 50 51 52 Despite well-documented sex differences in knee OA severity and symptoms ( 9 53 54 9 54 9 Our results should be interpreted with caution given the exploratory nature of this analysis from baseline FEAST trial data. Limitations include the potential for our analyses to be underpowered, as the sample size calculation was based on the main trial outcome (12-week change in knee symptoms) and may lead to insufficient statistical power for the sex-specific associations. While the EQ-5D and Kessler 10 are valid tools for assessing HRQOL and psychological distress, respectively, we used a single VAS question to assess sleep quality and levels of energy and fatigue. While validated instruments for these measures exist [e.g., the Pittsburgh Sleep Quality Index ( 55 56 57 58 59 60 18 61 62 63 5 Conclusion Dietary inflammatory potential, measured by the E-DII and DII, was generally not associated with HRQOL, self-perceived health indicators of sleep, fatigue, or psychological distress in males or females with symptomatic knee OA. A higher proinflammatory diet score was associated with lower energy levels in males but given the lack of an established minimum clinically important difference (MCID) for single-item energy VAS measures in knee OA populations, the clinical significance of this association is currently uncertain. The results of the FEAST trial will reveal if reducing inflammatory potential of diet improves these important health outcomes longitudinally. We would like to thank the FEAST participants for their time and effort, the La Trobe Nutrition and Dietetics department for providing access to the nutrition lab, and our colleagues in the collaborating orthopedic clinics for their invaluable support. Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Ethics statement The studies involving humans were approved by the La Trobe University Human Research Ethics Committee. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Author contributions LL: Conceptualization, Data curation, Formal analysis, Investigation, Methodology, Project administration, Writing – original draft, Writing – review & editing. JJH: Conceptualization, Project administration, Writing – review & editing. BD: Conceptualization, Writing – review & editing. PB: Conceptualization, Writing – review & editing. AD: Formal analysis, Writing – review & editing. JRH: Formal analysis, Writing – review & editing. SP: Formal analysis, Writing – review & editing. NW: Project administration, Writing – original draft, Writing – review & editing. AGC: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Supervision, Writing – review & editing. Conflict of interest PB was the founder of Defeat Diabetes and author of “A Fat Lot of Good.” PB contributed to study design but has no role in study execution, data management, analysis or the decision to publish. The NHMRC had no role in study design, execution, data management, analysis and interpretation or on the decision to submit the results for publication. AGC is an associate editor of British Journal of Sports Medicine, and Osteoarthritis and Cartilage. JRH wished to disclose that he owns controlling interest in the Connecting Health Innovations LLC (CHI), a company that has licensed the right to his invention of the dietary inflammatory index (DII ® The remaining authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fnut.2025.1624852/full#supplementary-material References 1. Knights A Redding S Maerz T Inflammation in osteoarthritis: the latest progress and ongoing challenges. Curr Opin Rheumatol 2023 35 128 34 10.1097/BOR.0000000000000923 36695054 PMC10821795 2. Neogi T The epidemiology and impact of pain in osteoarthritis. Osteoarthritis Cartilage 2013 21 1145 53 10.1016/j.joca.2013.03.018 23973124 PMC3753584 3. Ackerman I Buchbinder R March L Global Burden of Disease Study 2019: an opportunity to understand the growing prevalence and impact of hip, knee, hand and other osteoarthritis in Australia. Intern Med J 2023 53 1875 82 10.1111/imj.15933 36114616 PMC10946783 4. Park H Kim H Lee Y Knee osteoarthritis and its association with mental health and health-related quality of life: a nationwide cross-sectional study. Geriatr Gerontol Int 2020 20 379 83 10.1111/ggi.13879 32037727 5. Power J Perruccio A Badley E Pain as a mediator of sleep problems in arthritis and other chronic conditions. Arthritis Rheum 2005 53 911 9 10.1002/art.21584 16342098 6. Power J Badley E French M Wall A Hawker G Fatigue in osteoarthritis: a qualitative study. BMC Musculoskelet Disord 2008 9 63 10.1186/1471-2474-9-63 18452607 PMC2386135 7. Parmelee P Tighe C Dautovich N Sleep disturbance in osteoarthritis: linkages with pain, disability, and depressive symptoms. Arthritis Care Res 2015 67 358 65 10.1002/acr.22459 25283955 PMC4342277 8. Law L Heerey J Devlin B Brukner P Kemp J Attanayake A Effectiveness of an anti-inflammatory diet versus low-fat diet for knee osteoarthritis: the FEAST randomised controlled trial protocol. BMJ Open 2024 14 e079374 10.1136/bmjopen-2023-079374 38569708 PMC10989185 9. Tschon M Contartese D Pagani S Borsari V Fini M Gender and sex are key determinants in osteoarthritis not only confounding variables. A systematic review of clinical data. J Clin Med 2021 10 3178 10.3390/jcm10143178 34300344 PMC8303951 10. Rovner G Sunnerhagen K Björkdahl A Gerdle B Börsbo B Johansson F Chronic pain and sex-differences; women accept and move, while men feel blue. PLoS One 2017 12 e0175737 10.1371/journal.pone.0175737 28441403 PMC5404887 11. Koelman L Egea Rodrigues C Aleksandrova K Effects of dietary patterns on biomarkers of inflammation and immune responses: a systematic review and meta-analysis of randomized controlled trials. Adv Nutr 2022 13 101 15 10.1093/advances/nmab086 34607347 PMC8803482 12. Ansari M Ahmad N Haqqi T Oxidative stress and inflammation in osteoarthritis pathogenesis: role of polyphenols. Biomed Pharmacother. 2020 129 110452 10.1016/j.biopha.2020.110452 32768946 PMC8404686 13. Galbete C Kröger J Jannasch F Iqbal K Schwingshackl L Schwedhelm C Nordic diet, Mediterranean diet, and the risk of chronic diseases: the EPIC-Potsdam study. BMC Med 2018 16 99 10.1186/s12916-018-1082-y 29945632 PMC6020433 14. Godos J Guglielmetti M Ferraris C Frias-Toral E Domínguez Azpíroz I Lipari V Mediterranean diet and quality of life in adults: a systematic review. Nutrients 2025 17 577 10.3390/nu17030577 39940436 PMC11819740 15. Cordwell A McClure R Villani A Adherence to a Mediterranean diet and health-related quality of life: a cross-sectional analysis of overweight and obese middle-aged and older adults with and without type 2 diabetes mellitus. Br J Nutr. 2022 10.1017/S0007114521002324. [Online ahead of print] 34167600 16. Guldbrand H Lindström T Dizdar B Bunjaku B Östgren CJ Nystrom FH Randomization to a low-carbohydrate diet advice improves health related quality of life compared with a low-fat diet at similar weight-loss in Type 2 diabetes mellitus. Diabetes Res Clin Pract. 2014 106 221 7 10.1016/j.diabres.2014.08.032 25271116 17. Sköldstam L Hagfors L Johansson G An experimental study of a Mediterranean diet intervention for patients with rheumatoid arthritis. Ann Rheum Dis 2003 62 208 14 10.1136/ard.62.3.208 12594104 PMC1754463 18. Phillips CM Shivappa N Hébert JR Perry IJ Dietary inflammatory index and mental health: a cross-sectional analysis of the relationship with depressive symptoms, anxiety and well-being in adults. Clin Nutr. 2018 37 1485 91 10.1016/j.clnu.2017.08.029 28912008 19. Kase BE Liu J Wirth MD Shivappa N Hebert JR Associations between dietary inflammatory index and sleep problems among adults in the United States, NHANES 2005-2016. Sleep Health. 2021 7 273 80 10.1016/j.sleh.2020.09.002 33071202 20. Shivappa N Steck S Hurley T Hussey J Hébert J Designing and developing a literature-derived, population-based dietary inflammatory index. Public Health Nutr 2014 17 1689 96 10.1017/S1368980013002115 23941862 PMC3925198 21. Hébert J Shivappa N Wirth M Hussey J Hurley T Perspective: the Dietary Inflammatory Index (DII)-lessons learned, improvements made, and future directions. Adv Nutr 2019 10 185 95 10.1093/advances/nmy071 30615051 PMC6416047 22. Law L Heerey J Devlin B Brukner P De Livera A Attanayake A The eFEct of an anti-inflammatory diet for Knee oSTeoarthritis (FEAST) Trial: baseline characteristics and relationships with dietary inflammatory index. J Am Nutr Assoc 2025 44 556 65 10.1080/27697061.2025.2461219 39912561 23. National Institute for Health and Care Excellence. National Institute for Health and Clinical Excellence: Guidance. Osteoarthritis: Care and Management in Adults. London National Institute for Health and Care Excellence 2014 24. Shivappa N Hébert J Rietzschel E De Buyzere M Langlois M Debruyne E Associations between dietary inflammatory index and inflammatory markers in the Asklepios Study. Br J Nutr 2015 113 665 71 10.1017/S000711451400395X 25639781 PMC4355619 25. Herdman M Gudex C Lloyd A Janssen M Kind P Parkin D Development and preliminary testing of the new five-level version of EQ-5D (EQ-5D-5L). Qual Life Res 2011 20 1727 36 10.1007/s11136-011-9903-x 21479777 PMC3220807 26. Norman R Mulhern B Lancsar E Lorgelly P Ratcliffe J Street D The use of a discrete choice experiment including both duration and dead for the development of an EQ-5D-5L Value Set for Australia. Pharmacoeconomics 2023 41 427 38 10.1007/s40273-023-01243-0 36720793 PMC10020301 27. Hurst N Kind P Ruta D Hunter M Stubbings A Measuring health-related quality of life in rheumatoid arthritis: validity, responsiveness and reliability of EuroQol (EQ-5D). Br J Rheumatol 1997 36 551 9 10.1093/rheumatology/36.5.551 9189057 28. Kessler R Andrews G Colpe L Hiripi E Mroczek D Normand S Short screening scales to monitor population prevalences and trends in non-specific psychological distress. Psychol Med 2002 32 959 76 10.1017/s0033291702006074 12214795 29. Anderson T Sunderland M Andrews G Titov N Dear B Sachdev P The 10-item Kessler psychological distress scale (K10) as a screening instrument in older individuals. Am J Geriatr Psychiatry 2013 21 596 606 10.1016/j.jagp.2013.01.009 23567398 30. Australian Bureau of Statistics. Australian Health Survey: first results, 2011-12. Canberra ABS 2013 31. Alkerwi A Vernier C Sauvageot N Crichton G Elias M Demographic and socioeconomic disparity in nutrition: application of a novel Correlated Component Regression approach. BMJ Open 2015 5 e006814 10.1136/bmjopen-2014-006814 25967988 PMC4431064 32. Pourmontaseri H Khanmohammadi S Demographic risk factors of pro-inflammatory diet: a narrative review. Front Nutr 2024 11 1448806 10.3389/fnut.2024.1448806 39483779 PMC11526715 33. Sach T Barton G Doherty M Muir K Jenkinson C Avery A The relationship between body mass index and health-related quality of life: comparing the EQ-5D, EuroQol VAS and SF-6D. Int J Obes 2007 31 189 96 10.1038/sj.ijo.0803365 16682976 34. Toopchizadeh V Dolatkhah N Aghamohammadi D Rasouli M Hashemian M Dietary inflammatory index is associated with pain intensity and some components of quality of life in patients with knee osteoarthritis. BMC Res Notes 2020 13 448 10.1186/s13104-020-05277-x 32958008 PMC7507718 35. Irwin M Sleep and inflammation: partners in sickness and in health. Nat Rev Immunol 2019 19 702 15 10.1038/s41577-019-0190-z 31289370 36. Kapsimalis F Basta M Varouchakis G Gourgoulianis K Vgontzas A Kryger M Cytokines and pathological sleep. Sleep Med 2008 9 603 14 10.1016/j.sleep.2007.08.019 18024171 37. Coxon C Nishihira J Hepsomali P Dietary inflammatory index, sleep duration, and sleep quality: a systematic review. Nutrients 2024 16 890 10.3390/nu16060890 38542801 PMC10974932 38. Setayesh L Yarizadeh H Majidi N Mehranfar S Amini A Himmerich H The negative relationship of dietary inflammatory index and sleeping quality in obese and overweight women. Int J Vitam Nutr Res 2023 93 219 25 10.1024/0300-9831/a000723 34344172 39. Farrell E Wirth M McLain A Hurley T Shook R Hand G Associations between the dietary inflammatory index and sleep metrics in the energy balance study (EBS). Nutrients 2023 15 419 10.3390/nu15020419 36678290 PMC9863135 40. Godos J Ferri R Caraci F Cosentino F Castellano S Shivappa N Dietary inflammatory index and sleep quality in Southern Italian Adults. Nutrients 2019 11 1324 10.3390/nu11061324 31200445 PMC6627935 41. Masaad A Yusuf A Shakir A Khan M Khaleel S Cheikh Ismail L Sleep quality and Dietary Inflammatory Index among university students: a cross-sectional study. Sleep Breath 2021 25 2221 9 10.1007/s11325-020-02169-z 32829458 42. Lopes T Borba M Lopes R Fisberg R Paim S Teodoro V Association between inflammatory potential of the diet and sleep parameters in sleep apnea patients. Nutrition 2019 66 5 10 10.1016/j.nut.2019.04.003 31177057 43. Wang L Sun M Guo Y Yan S Li X Wang X The role of dietary inflammatory index on the association between sleep quality and long-term cardiovascular risk: a mediation analysis based on NHANES (2005-2008). Nat Sci Sleep 2022 14 483 92 10.2147/NSS.S357848 35330783 PMC8939873 44. Lauderdale D Knutson K Yan L Liu K Rathouz P Self-reported and measured sleep duration: how similar are they? Epidemiology 2008 19 838 45 10.1097/EDE.0b013e318187a7b0 18854708 PMC2785092 45. Yan L Li H Fan Q Xue Y Wang T Chronobiological perspectives: association between meal timing and sleep quality. PLoS One 2024 19 e0308172 10.1371/journal.pone.0308172 39088487 PMC11293727 46. St-Onge M Mikic A Pietrolungo C Effects of diet on sleep quality. Adv Nutr 2016 7 938 49 10.3945/an.116.012336 27633109 PMC5015038 47. Huang K Hsieh R Lee W Pain, physical function, and health in patients with knee osteoarthritis. Rehabil Nurs 2017 42 235 41 10.1002/rnj.234 26391619 48. Wise B Niu J Zhang Y Wang N Jordan J Choy E Psychological factors and their relation to osteoarthritis pain. Osteoarthritis Cartilage 2010 18 883 7 10.1016/j.joca.2009.11.016 20346403 PMC2912218 49. Lewis G Wessely S The epidemiology of fatigue: more questions than answers. J Epidemiol Community Health 1992 46 92 7 10.1136/jech.46.2.92 1583440 PMC1059513 50. Moravejolahkami AR Shakibaei M Sharma M Mohammadnezhad M Devarakonda S Effect of Mediterranean diet on body mass index and fatigue severity in patients with multiple sclerosis: A systematic review and meta-analysis of clinical trials. Heliyon. 2024 10 e37705 10.1016/j.heliyon.2024.e37705 39323842 PMC11422037 51. Milte CM Thorpe MG Crawford D Ball K McNaughton SA Associations of diet quality with health-related quality of life in older Australian men and women. Exp Gerontol. 2015 64 8 16 10.1016/j.exger.2015.01.047 25639944 52. Parletta N Milte C Meyer B Nutritional modulation of cognitive function and mental health. J Nutr Biochem 2013 24 725 43 10.1016/j.jnutbio.2013.01.002 23517914 53. Segal N Nilges J Oo W Sex differences in osteoarthritis prevalence, pain perception, physical function and therapeutics. Osteoarthritis Cartilage. 2024 32 1045 53 10.1016/j.joca.2024.04.002 38588890 54. Franke M Mancino C Taraballi F Reasons for the sex bias in osteoarthritis research: a review of preclinical studies. Int J Mol Sci 2023 24 10386 10.3390/ijms241210386 37373536 PMC10299001 55. Buysse D Reynolds C Monk T Berman S Kupfer D The Pittsburgh Sleep Quality Index: a new instrument for psychiatric practice and research. Psychiatry Res 1989 28 193 213 10.1016/0165-1781(89)90047-4 2748771 56. Smets E Garssen B Bonke B De Haes J The Multidimensional Fatigue Inventory (MFI) psychometric qualities of an instrument to assess fatigue. J Psychosom Res 1995 39 315 25 10.1016/0022-3999(94)00125-o 7636775 57. Kowalkowska J Slowinska M Slowinski D Dlugosz A Niedzwiedzka E Wadolowska L Comparison of a full food-frequency questionnaire with the three-day unweighted food records in young Polish adult women: implications for dietary assessment. Nutrients 2013 5 2747 76 10.3390/nu5072747 23877089 PMC3738998 58. Shivappa N Steck S Hurley T Hussey J Ma Y Ockene I A population-based dietary inflammatory index predicts levels of C-reactive protein in the Seasonal Variation of Blood Cholesterol Study (SEASONS). Public Health Nutr 2014 17 1825 33 10.1017/S1368980013002565 24107546 PMC3983179 59. Paultre K Cade W Hernandez D Reynolds J Greif D Best T Therapeutic effects of turmeric or curcumin extract on pain and function for individuals with knee osteoarthritis: a systematic review. BMJ Open Sport Exerc Med 2021 7 e000935 10.1136/bmjsem-2020-000935 33500785 PMC7812094 60. Akhtar N Haqqi T Current nutraceuticals in the management of osteoarthritis: a review. Ther Adv Musculoskelet Dis 2012 4 181 207 10.1177/1759720X11436238 22850529 PMC3400101 61. Marx W Veronese N Kelly J Smith L Hockey M Collins S The dietary inflammatory index and human health: an umbrella review of meta-analyses of observational studies. Adv Nutr 2021 12 1681 90 10.1093/advances/nmab037 33873204 PMC8483957 62. Hebert J Kabat G Distribution of smoking and its association with lung cancer: implications for studies on the association of fat with cancer. J Natl Cancer Inst 1991 83 872 5 10.1093/jnci/83.12.872 2061948 63. Rothman K Greenland S Lash T. Modern Epidemiology. Philadelphia, PA Wolters Kluwer Health 2008 ",
  "metadata": {
    "Title of this paper": "Distribution of smoking and its association with lung cancer: implications for studies on the association of fat with cancer.",
    "Journal it was published in:": "Frontiers in Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476995/"
  }
}