{
  "title": "Paper_877",
  "abstract": "pmc Med Sci Monit Med Sci Monit 1959 medscimon Medical Science Monitor Medical Science Monitor: International Medical Journal of Experimental and Clinical Research 1234-1010 1643-3750 International Scientific Information, Inc. PMC12477972 PMC12477972.1 12477972 12477972 40988320 10.12659/MSM.948226 948226 1 Review Articles Role of Ferroptosis on Lung Epithelial Cells in Disease Progression and Treatment: A Review Yin Xi 1 2 C D E F Hou Xiaohui 1 D E F Feng Jian 1 A D E F  1  2 Corresponding Author: Jian Feng, e-mail: jfeng68@126.com A Study Design B Data Collection C Statistical Analysis D Data Interpretation E Manuscript Preparation F Literature Search G Funds Collection 2025 24 9 2025 11 8 2025 31 478681 e948226 21 1 2025 23 6 2025 24 09 2025 30 09 2025 30 09 2025 © Med Sci Monit, 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This work is licensed under Creative Common Attribution-NonCommercial-NoDerivatives 4.0 International ( CC BY-NC-ND 4.0 Lung epithelial cells, including bronchial and alveolar epithelial cells, serve as the frontline barrier of the respiratory tract and play essential roles in maintaining pulmonary homeostasis and immune defense. Dysfunction of these epithelial cells contributes significantly to the development and progression of various lung diseases. Ferroptosis, an iron-dependent form of regulated cell death characterized by lipid peroxidation and glutathione depletion, has emerged as a key mechanism in pulmonary pathology. It plays distinct roles in benign and malignant lung conditions. In chronic obstructive pulmonary disease and asthma, ferroptosis promotes bronchial epithelial damage, oxidative stress, and persistent inflammation. Pathogens, such as Pseudomonas aeruginosa Iron Lung Diseases Phenylphosphonothioic Acid, 2-Ethyl 2-(4-Nitrophenyl) Ester Nantong Science and Technology Project HS2018003 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Ferroptosis is a distinct, iron-dependent form of regulated cell death, first characterized by Dixon et al in 2012 [ 1 2 3 3 4 5 6 7 Damage or dysfunction of either bronchial or alveolar epithelial cells has been directly linked to the development and progression of several respiratory disorders. In chronic obstructive pulmonary disease (COPD), epithelial injury results in chronic inflammation, tissue remodeling, and airflow limitation [ 8 9 10 11 4 8 9 11 Given the complexity and heterogeneity of pulmonary diseases, this review specifically focuses on the role of ferroptosis in bronchial and alveolar epithelial cells across benign (COPD, asthma, infection, fibrosis) and malignant (lung cancer) conditions. In this article, we aimed to review the role of epithelial cell ferroptosis in benign and malignant lung disease, highlighting current mechanistic insights and therapeutic opportunities related to this regulated cell death pathway. Mechanism of Ferroptosis Ferroptosis is a distinct, iron-dependent form of regulated cell death, first proposed by Dixon et al in 2012, which is primarily driven by intracellular iron accumulation, glutathione depletion, and lipid peroxidation. Dixon and colleagues identified a link between iron chelation, suppression of ROS, and the inhibition of cell death, distinguishing ferroptosis both morphologically and bioenergetically from other forms of programmed cell death, such as apoptosis and autophagy [ 1 12 Iron Metabolism and Ferroptosis Trivalent iron (Fe 3+ 2 13 14 15 TFR1 15 16 17 16 18 19 20 21 22 Lipid Peroxidation in Ferroptosis Polyunsaturated fatty acids (PUFAs), enriched in cellular membranes, are highly susceptible to peroxidation, due to their unstable double bonds, resulting in irreversible damage to cellular structures and function [ 23 24 25 26 27 28 29 30 31 32 33 2+ 23 The Defense Systems Against Ferroptosis Cyst(e)ine/Glutathione/Glutathione Peroxidase 4 System This is the classical and most extensively studied defense pathway against ferroptosis [ 34 − 35 36 37 38 30 39 40 NAD(P)H/Ferroptosis Suppressor Protein 1/Ubiquinone System In GPX4-deficient settings, ferroptosis can still be suppressed via ferroptosis suppressor protein 1 (FSP1), a NAD(P)H-dependent oxidoreductase [ 41 42 43 GTP Cyclohydrolase 1/Tetrahydrobiopterin/Dihydrofolate Reductase System A genome-wide CRISPR/dCas9 overexpression screen identified GTP cyclohydrolase 1 ( GCH1 44 44 46 47 Dihydroorotate Dehydrogenase/CoQ10 System Dihydroorotate dehydrogenase (DHODH), located in the inner mitochondrial membrane, provides mitochondria-specific defense against ferroptosis [ 48 49 Figure 1 Ferroptosis of Lung Epithelial Cells in Pulmonary Diseases Physiological Structure and Functions The lung epithelial cells cover the airways continuously and present diverse morphologies and functions at different anatomical sites [ 50 51 52 53 Ferroptosis of Lung Epithelial Cells in Different Lung Diseases Lung epithelial cells play a pivotal role in the defense against pulmonary diseases, through multiple coordinated mechanisms. They not only serve as a physical barrier against inhaled pathogens and particulates but also actively participate in host defense by producing antimicrobial peptides and chemotactic factors that recruit inflammatory cells. Additionally, they modulate adaptive immunity by secreting innate immune mediators, including cytokines and repellent factors, thereby orchestrating immune responses within the pulmonary microenvironment [ 51 54 55 56 57 58 59 60 61 Pseudomonas aeruginosa Figure 2 Ferroptosis and Pulmonary Infections Pulmonary infections caused by bacteria and viruses can induce severe injury to lung epithelial cells, with ferroptosis emerging as a pivotal mechanism in this process [ 62 P. aeruginosa 62 63 P. aeruginosa P. aeruginosa 64 COVID-19 disease, caused by SARS-CoV-2, emerged in late 2019 and rapidly spread across the globe [ 65 66 67 68 69 70 71 72 73 74 75 76 Ferroptosis in Chronic Inflammatory Lung Diseases Chronic inflammatory lung diseases, such as COPD and bronchial asthma, are characterized by persistent or episodic airway inflammation, in which ferroptosis has emerged as a key contributor to epithelial damage and disease progression. In COPD, one of the leading causes of chronic respiratory morbidity and mortality worldwide, irreversible airflow limitation develops as a result of chronic exposure to harmful particles, most notably cigarette smoke, which disrupts epithelial integrity and alveolar structure [ 77 78 79 80 81 Similarly, in bronchial asthma, which is characterized by reversible airway obstruction and hyperresponsiveness, epithelial cell injury plays a central role in disease onset and exacerbation [ 82 84 85 86 87 88 89 90 91 92 Ferroptosis in Lung Cancer Lung cancer continues to be a major global health burden, being one of the most frequently diagnosed malignancies and a leading cause of cancer-related mortality. It is broadly classified into small cell lung cancer and non-small cell lung cancer (NSCLC) [ 93 94 95 96 97 99 100 In lung adenocarcinoma and squamous cell carcinoma, studies have shown that the E3 ubiquitin ligase MIB1 is frequently upregulated, promoting EMT and simultaneously enhancing sensitivity to ferroptosis by targeting the NRF2 pathway for proteasomal degradation. This dual function suggests that tumors with elevated MIB1 expression may be more amenable to ferroptosis-based interventions [ 101 102 103 Ferroptosis also plays a pivotal role in overcoming therapeutic resistance, which is a persistent challenge in lung cancer management. For instance, the combination of betulin and gefitinib has been shown to reverse resistance in EGFR KRAS 104 105 Radioresistance is another major obstacle in the treatment of lung cancer, particularly for tumors that do not respond adequately to conventional radiotherapy. Induction of ferroptosis has shown promise in enhancing radiation-induced cytotoxicity in tumor cells [ 106 107 108 107 KEAP1 109 110 Ferroptosis in Lung Injury Ferroptosis has emerged as a pivotal contributor to the pathogenesis of acute lung injury, an inflammatory condition characterized by disruption of both the pulmonary endothelial and epithelial barriers [ 111 112 113 114 115 In studies involving intestinal ischemia/reperfusion–induced lung injury, ferroptosis has been mechanistically linked to pulmonary epithelial damage. The inhibitory role of iASPP in hypoxia/reoxygenation-induced ferroptosis in mouse lung epithelial (MLE)-2 cells was shown to operate through activation of the NRF2/HIF-1α/TF signaling pathway [ 116 117 118 119 Lipopolysaccharide-induced sepsis is another prominent model of acute lung injury in which ferroptosis plays a pathogenic role. Ferroptosis inhibition in this context has shown promising therapeutic effects [ 120 121 MLK3 122 123 124 125 126 Ferroptosis and Pulmonary Fibrosis Pulmonary fibrosis represents a progressive and often irreversible condition characterized by recurrent alveolar epithelial injury, proliferation of fibroblasts, and extensive extracellular matrix deposition. These pathological changes are triggered by a wide range of etiologies, including infections, mechanical injury, pharmaceuticals, autoimmune responses, and environmental exposures, ultimately resulting in aberrant lung remodeling and a gradual loss of pulmonary function [ 127 128 129 130 Experimental models further substantiate this relationship. Bleomycin-induced lung fibrosis and genetically or chemically induced murine models of iron overload exhibit hallmark features of fibrotic inflammation, including heightened ROS production, epithelial cell loss, and deteriorated pulmonary mechanics. Notably, iron accumulation has been significantly elevated in idiopathic pulmonary fibrosis lung samples, compared with in non-fibrotic controls, with an inverse relationship to pulmonary function indices [ 131 Of particular interest is the role of EMT, a process by which epithelial cells acquire mesenchymal characteristics, facilitating fibrogenesis. The potent fibrogenic cytokine TGF-β induces EMT and myofibroblast differentiation in alveolar epithelial cells during fibrotic remodeling [ 133 134 130 135 136 137 Treatment Approaches Targeting Ferroptosis in Lung Epithelial Cells Because ferroptosis in lung epithelial cells is associated with a variety of lung diseases, modulating ferroptosis – either inhibiting or inducing it – has emerged as a novel therapeutic strategy. Moreover, several traditional herbal compounds, synthetic agents, and advanced drug delivery systems have been shown to modulate ferroptosis in lung epithelial cells, thereby offering potential therapeutic benefits. The ferroptosis mechanisms and effects in different lung epithelial cell types across pulmonary diseases is summarized in Table 1 Ferroptosis Inhibitors and Inducers Ferrostatin-1 is a lipid peroxidation inhibitor that blocks erastin-induced ferroptosis [ 138 61 139 P. aeruginosa 140 141 129 89 142 143 − 144 Natural Products Natural products are extensively used in the treatment of various diseases [ 145 146 147 148 149 Realgar, a traditional mineral-based antioxidant, demonstrates anti-cancer activity in KRAS 150 Curcuma longa 151 152 153 Ferulic acid, a plant-derived antioxidant, acts via the NRF2/HO-1 signaling axis to protect alveolar epithelial cells from ferroptosis in acute lung injury [ 154 155 156 157 158 159 160 161 137 162 Nanomaterials Janus nanoparticles have emerged as advanced drug delivery tools, with significant interest in cancer therapy applications [ 163 3 4 164 165 166 Comparative Insights Across Lung Diseases Ferroptosis, an iron-dependent form of regulated cell death, plays a pivotal role in the pathogenesis of a wide spectrum of lung diseases. Although the downstream outcomes of ferroptosis, namely lipid peroxidation, oxidative stress, and epithelial injury, are commonly observed across diseases, the upstream triggers, modulators, and associated cellular events vary depending on the pathological context [ 23 55 In COPD, ferroptosis is prominently induced by cigarette smoke, which causes iron accumulation and ROS generation in bronchial epithelial cells [ 77 78 20 21 137 81 In contrast, asthma involves a distinct immunological landscape in which ferroptosis is initiated by allergen exposure, particularly house dust mite allergens. Here, IL-13 plays a central role in initiating ferroptosis through oxidative stress and PEBP1-15-LO-mediated lipid peroxidation. This differs from COPD, in which iron handling is the major trigger [ 62 90 90 91 In pulmonary infections, bacterial and viral pathogens exploit ferroptosis to enhance epithelial damage and immune evasion. For example, P. aeruginosa 62 64 64 161 In acute lung injury and acute respiratory distress syndrome, ferroptosis is often a result of systemic or local inflammation, sepsis, or ischemia/reperfusion injury. Unlike chronic diseases, acute lung injury is characterized by acute epithelial barrier disruption, and ferroptosis contributes to the propagation of alveolar damage and delayed resolution. Studies show that ferroptosis here is regulated by the NRF2/STAT3 and TERT/SLC7A11 pathways, and inhibition of ferroptosis via compounds such as ferrostatin-1 or HIF-1α stabilizers provides protection, emphasizing its role in acute oxidative and hypoxic injury. Compared with COPD and asthma, in which ferroptosis is chronic and progressive, acute lung injury features rapid onset and resolution with timely intervention [ 10 111 In lung fibrosis, ferroptosis is intricately linked with EMT and autophagy [ 11 130 135 Lung cancer presents a duality in ferroptosis, where it can suppress or promote tumor progression. Ferroptosis inhibits tumor proliferation by inducing oxidative death, but can also mediate immune evasion or resistance to therapy through upregulation of anti-ferroptotic mechanisms, such as SLC7A11 or FSP1 [ 41 43 108 134 Future Perspectives Despite substantial advances in our understanding of ferroptosis in lung epithelial cells, many gaps remain in translating this knowledge into clinical practice. Future research directions should prioritize the mechanistic elucidation of ferroptosis signaling across different lung pathologies, explore its interactions with other cell death pathways, and develop targeted interventions with therapeutic potential. One critical area for future exploration is the temporal and spatial regulation of ferroptosis within the lung microenvironment. While many studies have identified ferroptosis markers at static time points, little is known about the dynamic changes in ferroptosis susceptibility during disease initiation, progression, and resolution. Longitudinal studies using animal models and patient-derived tissues could elucidate the stages at which ferroptosis is most detrimental – or beneficial – across diseases like acute lung injury, pulmonary fibrosis, and lung cancer. Moreover, spatial mapping of ferroptosis-related proteins and lipid peroxidation products across different epithelial compartments may help localize zones of epithelial vulnerability. Another promising avenue is the interplay between ferroptosis and immune responses. The lung epithelium is closely involved in immunoregulation, and ferroptotic cell death can release damage-associated molecular patterns that modulate both the innate and adaptive immune responses. In infectious and inflammatory conditions, such as COVID-19, asthma, or sepsis-induced acute lung injury, understanding how ferroptosis influences cytokine production, immune cell recruitment, and resolution of inflammation will be pivotal. This could reveal therapeutic windows in which ferroptosis inhibition not only protects epithelial cells but also restores immune homeostasis. Crosstalk between ferroptosis and other cell death modalities, including apoptosis, necroptosis, and pyroptosis, remains an underexplored but crucial aspect. Emerging evidence suggests that these pathways are not mutually exclusive and may operate in tandem or sequentially. Dissecting how ferroptosis integrates with these parallel mechanisms will help define the dominant death pathways in various pathological contexts and can guide combination therapies that target multiple routes of cell death. On the translational front, drug development and repurposing efforts must be intensified. While inhibitors, such as ferrostatin-1 and liproxstatin-1, and inducers, such as erastin and sulfasalazine, have shown promise in vitro and in preclinical models, their pharmacokinetics, delivery efficiency, and toxicity profiles in humans remain largely unknown. This necessitates more robust pharmacological profiling, particularly in lung-targeted delivery systems. Nanotechnology, for example, offers an attractive platform to improve bioavailability and specificity of ferroptosis modulators. Engineered nanoparticles can deliver antioxidants or iron chelators directly to inflamed or tumor-affected lung tissues, as demonstrated in early animal studies. However, further clinical validation and regulatory assessment are required before these strategies can be implemented. Another forward-looking strategy involves the use of biomarkers to monitor ferroptosis activity in patients. Biomarkers such as ACSL4, lipid peroxidation byproducts (eg, malondialdehyde, 4-HNE), and iron metabolism-related proteins (eg, TFR1, ferritin) could be integrated into diagnostic panels to stratify patients based on ferroptosis risk or to monitor treatment efficacy. Integration of multi-omics platforms, including transcriptomics, metabolomics, and lipidomics, could provide deeper insight into ferroptosis-associated molecular signatures, guiding diagnosis and personalized therapy. Finally, clinical trials targeting ferroptosis in lung diseases are urgently needed. While extensive evidence supports the relevance of ferroptosis in disease mechanisms, there is a lack of human trials evaluating ferroptosis-based therapies. Early-phase studies investigating the use of ferroptosis inhibitors in acute respiratory distress syndrome, or ferroptosis inducers in lung cancer, would be instrumental in translating benchside findings to bedside interventions. Moreover, patient stratification based on ferroptosis-related gene expression or oxidative stress profiles can optimize trial outcomes and therapeutic success. Collectively, ferroptosis stands at the intersection of oxidative biology, cell death, and pulmonary pathology. Continued multidisciplinary efforts integrating molecular biology, immunology, pharmacology, and clinical sciences will be key to unlocking the therapeutic potential of targeting ferroptosis in lung epithelial cells. Conclusions Ferroptosis has emerged as a central mechanism contributing to lung epithelial cell dysfunction across a broad spectrum of pulmonary diseases, including COPD, asthma, pulmonary infections, fibrosis, acute lung injury, and lung cancer. Its involvement in promoting oxidative stress, lipid peroxidation, and inflammatory responses underpins its pathological relevance, while its selective induction in malignancies offers a unique therapeutic opportunity. Targeting ferroptosis through small-molecule inhibitors, bioactive natural compounds, and nanotechnology-based delivery systems holds promise for disease-specific intervention. However, successful clinical translation demands a precise understanding of the context-dependent roles of ferroptosis and rigorous validation in disease models. Continued exploration of ferroptotic pathways in distinct lung epithelial cell types will not only enhance our comprehension of disease mechanisms but will also facilitate the development of novel, targeted treatment strategies. Conflict of interest: Department and Institution Where Work Was Done: Declaration of Figures’ Authenticity: Financial support: References 1 Dixon SJ Lemberg KM Lamprecht MR Ferroptosis: An iron-dependent form of nonapoptotic cell death Cell 2012 149 5 1060 72 22632970 10.1016/j.cell.2012.03.042 PMC3367386 2 Zhang F Xiang Y Ma Q A deep insight into ferroptosis in lung disease: Facts and perspectives Front Oncol 2024 14 1354859 38562175 10.3389/fonc.2024.1354859 PMC10982415 3 Li S Zhang G Hu J Ferroptosis at the nexus of metabolism and metabolic diseases Theranostics 2024 14 15 5826 52 39346540 10.7150/thno.100080 PMC11426249 4 Chen X Kang R Kroemer G Broadening horizons: The role of ferroptosis in cancer Nat Rev Clin Oncol 2021 18 280 96 33514910 10.1038/s41571-020-00462-0 5 Zhang H Zhou S Sun M Ferroptosis of endothelial cells in vascular diseases Nutrients 2022 14 21 4506 36364768 10.3390/nu14214506 PMC9656460 6 Lai B Wu CH Wu CY Ferroptosis and autoimmune diseases Front Immunol 2022 13 916664 35720308 10.3389/fimmu.2022.916664 PMC9203688 7 Russell RJ Boulet LP Brightling CE The airway epithelium: An orchestrator of inflammation, a key structural barrier and a therapeutic target in severe asthma Eur Respir J 2024 63 4 2301397 38453256 10.1183/13993003.01397-2023 PMC10991852 8 Lewicki S Bałan BJ Stelmasiak M Immunological insights and therapeutic advances in COPD: Exploring oral bacterial vaccines for immune modulation and clinical improvement Vaccines 2025 13 2 107 40006655 10.3390/vaccines13020107 PMC11861055 9 Jakwerth CA Ordovas-Montanes J Blank S Role of respiratory epithelial cells in allergic diseases Cells 2022 11 9 1387 35563693 10.3390/cells11091387 PMC9105716 10 Olajuyin A Zhang X Ji H Alveolar type 2 progenitor cells for lung injury repair Cell Death Discovery 2019 5 63 30774991 10.1038/s41420-019-0147-9 PMC6368612 11 Parimon T Yao C Stripp BR Alveolar epithelial type II cells as drivers of lung fibrosis in idiopathic pulmonary fibrosis Int J Mol Sci 2020 21 7 2269 32218238 10.3390/ijms21072269 PMC7177323 12 Lei G Zhuang L Gan B Targeting ferroptosis as a vulnerability in cancer Nat Rev Cancer 2022 22 7 381 96 35338310 10.1038/s41568-022-00459-0 PMC10243716 13 Kawabata T Iron-induced oxidative stress in human diseases Cells 2022 11 14 2152 35883594 10.3390/cells11142152 PMC9324531 14 Cammack R Wrigglesworth JM Baum H Iron-dependent enzymes in mammalian systems Iron Transp Stor 2024 20 17 39 15 Yao H Jiang W Liao X Regulatory mechanisms of amino acids in ferroptosis Life Sci 2024 351 122803 38857653 10.1016/j.lfs.2024.122803 16 Zhu Y Fujimaki M Rubinsztein DC Autophagy-dependent versus autophagy-independent ferroptosis Trends Cell Biol 2025 [Online ahead of print] 10.1016/j.tcb.2025.01.005 40050185 17 Feng H Schorpp K Jin J Transferrin receptor is a specific ferroptosis marker Cell Rep 2020 30 10 3411 3423e7 32160546 10.1016/j.celrep.2020.02.049 PMC7172030 18 Liu YC Gong YT Sun QY Ferritinophagy induced ferroptosis in the management of cancer Cell Oncol (Dordr) 2024 47 1 19 35 37713105 10.1007/s13402-023-00858-x 19 Chen G Shi X Jiao R Expression and prognostic value of ferritinophagy-related NCOA4 gene in low-grade glioma: Integration of bioinformatics and experimental validation BMC Neurol 2025 25 1 26 39825225 10.1186/s12883-025-04036-4 PMC11742756 20 Zheng Y Zhao T Wang J Curcumol alleviates liver fibrosis through inducing autophagy and ferroptosis in hepatic stellate cells FASEB J 2022 36 12 e22665 36398583 10.1096/fj.202200933RR 21 Correnti M Gammella E Cairo G Recalcati S Iron absorption: Molecular and pathophysiological aspects Metabolites 2024 14 4 228 38668356 10.3390/metabo14040228 PMC11052485 22 Fang Y Li W Dong C Inhibition of SLC40A1 represses osteoblast formation via inducing iron accumulation and activating the PERK/ATF4/CHOP pathway mediated oxidative stress Redox Rep 2024 29 1 2428147 39607819 10.1080/13510002.2024.2428147 PMC11610352 23 Gęgotek A Skrzydlewska E Lipid peroxidation products’ role in autophagy regulation Free Radic Biol Med 2024 212 375 83 38182071 10.1016/j.freeradbiomed.2024.01.001 24 Stockwell BR Ferroptosis turns 10: Emerging mechanisms, physiological functions, and therapeutic applications Cell 2022 185 14 2401 21 35803244 10.1016/j.cell.2022.06.003 PMC9273022 25 Kagan VE Mao G Qu F Oxidized arachidonic and adrenic PEs navigate cells to ferroptosis Nat Chem Biol 2017 13 1 81 90 27842066 10.1038/nchembio.2238 PMC5506843 26 Ye L Wen X Qin J Metabolism-regulated ferroptosis in cancer progression and therapy Cell Death Dis 2024 15 3 196 38459004 10.1038/s41419-024-06584-y PMC10923903 27 Reed A Ichu TA Milosevich N LPCAT3 inhibitors remodel the polyunsaturated phospholipid content of human cells and protect from ferroptosis ACS Chem Biol 2022 17 6 1607 18 35658397 10.1021/acschembio.2c00317 28 Yang Y Zhu T Wang X ACSL3 and ACSL4, distinct roles in ferroptosis and cancers Cancers (Basel) 2022 14 23 5896 36497375 10.3390/cancers14235896 PMC9739553 29 Du X Dong R Wu Y Physiological effects of ferroptosis on organ fibrosis Oxid Med Cell Longev 2022 2022 5295434 36238649 10.1155/2022/5295434 PMC9553398 30 Jiang X Stockwell BR Conrad M Ferroptosis: mechanisms, biology and role in disease Nat Rev Mol Cell Biol 2021 22 4 266 82 33495651 10.1038/s41580-020-00324-8 PMC8142022 31 Shah R Shchepinov MS Pratt DA Resolving the role of lipoxygenases in the initiation and execution of ferroptosis ACS Cent Sci 2018 4 3 387 96 29632885 10.1021/acscentsci.7b00589 PMC5879472 32 Lee JY Kim WK Bae KH Lipid Metabolism and ferroptosis Biology (Basel) 2021 10 3 184 33801564 10.3390/biology10030184 PMC8000263 33 Qiu B Zandkarimi F Bezjian CT Phospholipids with two polyunsaturated fatty acyl tails promote ferroptosis Cell 2024 187 1177 90 38366593 10.1016/j.cell.2024.01.030 PMC10940216 34 Yu Y Yan Y Niu F Ferroptosis: A cell death connecting oxidative stress, inflammation and cardiovascular diseases Cell Death Discov 2021 7 1 193 34312370 10.1038/s41420-021-00579-w PMC8313570 35 Parker JL Deme JC Kolokouris D Molecular basis for redox control by the human cystine/glutamate antiporter system xc Nat Commun 2021 12 7147 34880232 10.1038/s41467-021-27414-1 PMC8654953 36 Li FJ Long HZ Zhou ZW System Xc − Front Pharmacol 2022 13 910292 36105219 10.3389/fphar.2022.910292 PMC9465090 37 Mandal PK Seiler A Perisic T System xc(−) and thioredoxin reductase 1 cooperatively rescue glutathione deficiency J Biol Chem 2010 285 29 22244 53 20463017 10.1074/jbc.M110.121327 PMC2903358 38 Hristov BD The role of glutathione metabolism in chronic illness development and its potential use as a novel therapeutic target Cureus 2022 14 9 e29696 36321012 10.7759/cureus.29696 PMC9616098 39 Huang B Wang H Liu S Palmitoylation-dependent regulation of GPX4 suppresses ferroptosis Nat Commun 2025 16 867 39833225 10.1038/s41467-025-56344-5 PMC11746948 40 Maiorino M Conrad M Ursini F GPx4, lipid peroxidation, and cell death: Discoveries, rediscoveries, and open issues Antioxid Redox Signal 2018 29 1 61 74 28462584 10.1089/ars.2017.7115 41 Zou Y Palte MJ Deik AA A GPX4-dependent cancer cell state underlies the clear-cell morphology and confers sensitivity to ferroptosis Nat Commun 2019 10 1 1617 30962421 10.1038/s41467-019-09277-9 PMC6453886 42 Bersuker K Hendricks JM Li Z The CoQ oxidoreductase FSP1 acts parallel to GPX4 to inhibit ferroptosis Nature 2019 575 7784 688 92 31634900 10.1038/s41586-019-1705-2 PMC6883167 43 Doll S Freitas FP Shah R FSP1 is a glutathione-independent ferroptosis suppressor Nature 2019 575 7784 693 98 31634899 10.1038/s41586-019-1707-0 44 Kraft VAN Bezjian CT Pfeiffer S GTP cyclohydrolase 1/tetrahydrobiopterin counteract ferroptosis through lipid remodeling ACS Cent Sci 2019 6 1 41 53 31989025 10.1021/acscentsci.9b01063 PMC6978838 45 Vasquez-Vivar J Shi Z Tan S Tetrahydrobiopterin in cell function and death mechanisms Antioxid Redox Signal 2022 37 1–3 171 83 34806400 10.1089/ars.2021.0136 PMC9293684 46 Soula M Weber RA Zilka O Metabolic determinants of cancer cell sensitivity to canonical ferroptosis inducers Nat Chem Biol 2020 16 12 1351 60 32778843 10.1038/s41589-020-0613-y PMC8299533 47 Berndt C Alborzinia H Amen VS Ferroptosis in health and disease Redox Biol 2024 75 103211 38908072 10.1016/j.redox.2024.103211 PMC11253697 48 Vasan K Werner M Chandel NS Mitochondrial Metabolism as a Target for Cancer Therapy Cell Metab 2020 32 3 341 52 32668195 10.1016/j.cmet.2020.06.019 PMC7483781 49 Mao C Liu X Zhang Y DHODH-mediated ferroptosis defence is a targetable vulnerability in cancer Nature 2021 593 7860 586 90 33981038 10.1038/s41586-021-03539-7 PMC8895686 50 Liu J Wang M Tian X New insights into allergic rhinitis treatment: MSC nanovesicles targeting dendritic cells J Nanobiotechnology 2024 22 575 39294599 10.1186/s12951-024-02748-2 PMC11411834 51 Hiemstra PS McCray PB Jr Bals R The innate immune function of airway epithelial cells in inflammatory lung disease Eur Respir J 2015 45 4 1150 62 25700381 10.1183/09031936.00141514 PMC4719567 52 Depicolzuane L Phelps DS Floros J Surfactant protein-A function: Knowledge gained from SP-A knockout mice Front Pediatr 2021 9 799693 35071140 10.3389/fped.2021.799693 PMC8777267 53 Rock JR Hogan BL Epithelial progenitor cells in lung development, maintenance, repair, and disease Annu Rev Cell Dev Biol 2011 27 493 512 21639799 10.1146/annurev-cellbio-100109-104040 54 Hirota JA Knight DA Human airway epithelial cell innate immunity: Relevance to asthma Curr Opin Immunol 2012 24 6 740 46 23089231 10.1016/j.coi.2012.08.012 55 Pascoe CD Roy N Turner-Brannen E Oxidized phosphatidylcholines induce multiple functional defects in airway epithelial cells Am J Physiol Lung Cell Mol Physiol 2021 321 4 L703 17 34346781 10.1152/ajplung.00539.2020 56 Sarker RSJ Conlon TM Morrone C CARM1 regulates senescence during airway epithelial cell injury in COPD pathogenesis Am J Physiol Lung Cell Mol Physiol 2019 317 5 L602 14 31461302 10.1152/ajplung.00441.2018 57 Skibba M Drelich A Poellmann M Nanoapproaches to modifying epigenetics of epithelial-mesenchymal transition for treatment of pulmonary fibrosis Front Pharmacol 2020 11 607689 33384604 10.3389/fphar.2020.607689 PMC7770469 58 Liu X Wang M Song Y Kukoamine A inhibits C-C motif chemokine receptor 5 to attenuate lipopolysaccharide-induced lung injury Drug Dev Res 2022 83 6 1455 66 35862278 10.1002/ddr.21975 59 Gouda MM Shaikh SB Bhandary YP Inflammatory and fibrinolytic system in acute respiratory distress syndrome Lung 2018 196 5 609 16 30121847 10.1007/s00408-018-0150-6 60 Churchill MJ Mitchell PS Rauch I Epithelial pyroptosis in host defense J Mol Biol 2022 434 4 167278 34627788 10.1016/j.jmb.2021.167278 PMC10010195 61 Chen J Zhu H Chen Q The role of ferroptosis in chronic intermittent hypoxia-induced lung injury BMC Pulm Med 2022 22 1 488 36572881 10.1186/s12890-022-02262-x PMC9793575 62 Vance R Hong S Gronert K The opportunistic pathogen Pseudomonas aeruginosa Proc Natl Acad Sci USA 2004 101 7 2135 39 14766977 10.1073/pnas.0307308101 PMC357064 63 Dar HH Tyurina YY Mikulska-Ruminska K Pseudomonas aeruginosa utilizes host polyunsaturated phosphatidylethanolamines to trigger theft-ferroptosis in bronchial epithelium J Clin Invest 2018 128 10 4639 53 30198910 10.1172/JCI99490 PMC6159971 64 Dar HH Anthonymuthu TS Ponomareva LA A new thiol-independent mechanism of epithelial host defense against Pseudomonas aeruginosa Redox Biol 2021 45 102045 34167028 10.1016/j.redox.2021.102045 PMC8227829 65 Zhou F Yu T Du R Clinical course and risk factors for mortality of adult inpatients with COVID-19 in Wuhan, China: A retrospective cohort study Lancet 2020 395 10229 1054 62 32171076 10.1016/S0140-6736(20)30566-3 PMC7270627 66 Team J W-C S WHO-convened global study of origins of SARS-CoV-2: China part (text extract) Infect Dis Immun 2021 1 3 125 32 67 Li X Geng M Peng Y Molecular immune pathogenesis and diagnosis of COVID-19 J Pharm Anal 2020 10 2 102 8 32282863 10.1016/j.jpha.2020.03.001 PMC7104082 68 Merad M Martin JC Pathological inflammation in patients with COVID-19: A key role for monocytes and macrophages Nat Rev Immunol 2020 20 6 355 62 32376901 10.1038/s41577-020-0331-4 PMC7201395 69 Habib HM Ibrahim S Zaim A The role of iron in the pathogenesis of COVID-19 and possible treatment with lactoferrin and other iron chelators Biomed Pharmacother 2021 136 111228 33454595 10.1016/j.biopha.2021.111228 PMC7836924 70 Dos Santos AAC Rodrigues LE Alecrim-Zeza AL Molecular and cellular mechanisms involved in tissue-specific metabolic modulation by SARS-CoV-2 Front Microbiol 2022 13 1037467 36439786 10.3389/fmicb.2022.1037467 PMC9684198 71 Wang Y Huang J Sun Y SARS-CoV-2 suppresses mRNA expression of selenoproteins associated with ferroptosis, endoplasmic reticulum stress and DNA synthesis Food Chem Toxicol 2021 153 112286 34023458 10.1016/j.fct.2021.112286 PMC8139185 72 Zhou P Yang XL Wang XG A pneumonia outbreak associated with a new coronavirus of probable bat origin Nature 2020 579 7798 270 73 32015507 10.1038/s41586-020-2012-7 PMC7095418 73 Zhang H Penninger JM Li Y Angiotensin-converting enzyme 2 (ACE2) as a SARS-CoV-2 receptor: Molecular mechanisms and potential therapeutic target Intensive Care Med 2020 46 4 586 90 32125455 10.1007/s00134-020-05985-9 PMC7079879 74 Li F Li J Wang PH SARS-CoV-2 spike promotes inflammation and apoptosis through autophagy by ROS-suppressed PI3K/AKT/mTOR signaling Biochim Biophys Acta Mol Basis Dis 2021 1867 12 166260 34461258 10.1016/j.bbadis.2021.166260 PMC8390448 75 Zhu Z Zhao Z Chen X Effects of growth hormone/estrogen/androgen on COVID-19-type proinflammatory responses in normal human lung epithelial BEAS-2B cells BMC Mol Cell Biol 2022 23 1 42 36175845 10.1186/s12860-022-00442-5 PMC9520119 76 Hassan SM Jawad MJ Ahjel SW The Nrf2 activator (DMF) and COVID-19: Is there a possible role? Med Arch 2020 74 2 134 38 32577056 10.5455/medarh.2020.74.134-138 PMC7296400 77 Castaldi PJ Sauler M Molecular characterization of the distal lung: Novel insights from chronic obstructive pulmonary disease omics Am J Respir Crit Care Med 2024 210 147 54 38701385 10.1164/rccm.202310-1972PP PMC11273319 78 Eryüksel E Tunca Z Mercancı Z Stem cell treatment reduces T cell apoptosis in COPD patients with chronic bronchitis but not with emphysema Tissue Cell 2024 89 102452 38986345 10.1016/j.tice.2024.102452 79 Zhou SY Du JM Li WJ The roles and regulatory mechanisms of cigarette smoke constituents in vascular remodeling Int Immunopharmacol 2024 140 112784 39083928 10.1016/j.intimp.2024.112784 80 Yoshida M Minagawa S Araya J Involvement of cigarette smoke-induced epithelial cell ferroptosis in COPD pathogenesis Nat Commun 2019 10 1 3145 31316058 10.1038/s41467-019-10991-7 PMC6637122 81 Gunes Gunsel G Conlon TM Jeridi A The arginine methyltransferase PRMT7 promotes extravasation of monocytes resulting in tissue injury in COPD Nat Commun 2022 13 1 1303 35288557 10.1038/s41467-022-28809-4 PMC8921220 82 Dierick BJ Eikholt AA van de Hei SJ Reshaping respiratory care: Potential advances in inhaled pharmacotherapy in asthma Expert Opin Pharmacother 2024 25 11 1507 16 39099418 10.1080/14656566.2024.2389258 83 Martinovich KM Iosifidis T Buckley AG Conditionally reprogrammed primary airway epithelial cells maintain morphology, lineage and disease-specific functional characteristics Sci Rep 2017 7 1 17971 29269735 10.1038/s41598-017-17952-4 PMC5740081 84 Georas SN Khurana S Update on asthma biology J Allergy Clin Immunol 2024 153 5 1215 28 38341182 10.1016/j.jaci.2024.01.024 85 Holgate ST Roberts G Arshad HS The role of the airway epithelium and its interaction with environmental factors in asthma pathogenesis Proc Am Thorac Soc 2009 6 8 655 59 20008870 10.1513/pats.200907-072DP 86 Lee KS Jin SM Kim HJ Matrix metalloproteinase inhibitor regulates inflammatory cell migration by reducing ICAM-1 and VCAM-1 expression in a murine model of toluene diisocyanate-induced asthma J Allergy Clin Immunol 2003 111 6 1278 84 12789230 10.1067/mai.2003.1501 87 Tang W Dong M Teng F Environmental allergens house dust mite-induced asthma is associated with ferroptosis in the lungs Exp Ther Med 2021 22 6 1483 34765024 10.3892/etm.2021.10918 PMC8576623 88 Zeng Z Huang H Zhang J HDM induce airway epithelial cell ferroptosis and promote inflammation by activating ferritinophagy in asthma FASEB J 2022 36 6 e22359 35621121 10.1096/fj.202101977RR 89 Han F Li S Yang Y Interleukin-6 promotes ferroptosis in bronchial epithelial cells by inducing reactive oxygen species-dependent lipid peroxidation and disrupting iron homeostasis Bioengineered 2021 12 1 5279 88 34402724 10.1080/21655979.2021.1964158 PMC8806540 90 Wenzel SE Tyurina YY Zhao J PEBP1 wardens ferroptosis by enabling lipoxygenase generation of lipid death signals Cell 2017 171 3 628 41e26 29053969 10.1016/j.cell.2017.09.044 PMC5683852 91 Zhao J Dar HH Deng Y PEBP1 acts as a rheostat between prosurvival autophagy and ferroptotic death in asthmatic epithelial cells Proc Natl Acad Sci USA 2020 117 25 14376 85 32513718 10.1073/pnas.1921618117 PMC7321965 92 Boyce JA The role of 15 lipoxygenase 1 in asthma comes into focus J Clin Invest 2022 132 1 e155884 34981786 10.1172/JCI155884 PMC8718133 93 Bray F Ferlay J Soerjomataram I Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries Cancer J Clin 2018 68 6 394 424 10.3322/caac.21492 30207593 94 Arbour KC Riely GJ Systemic therapy for locally advanced and metastatic non-small cell lung cancer: A review JAMA 2019 322 8 764 74 31454018 10.1001/jama.2019.11058 95 Valavanidis A Vlachogianni T Fiotakis K Pulmonary oxidative stress, inflammation and cancer: respirable particulate matter, fibrous dusts and ozone as major causes of lung carcinogenesis through reactive oxygen species mechanisms Int J Environ Res Public Health 2013 10 9 3886 907 23985773 10.3390/ijerph10093886 PMC3799517 96 Nieto MA Huang RY Jackson RA EMT: 2016 Cell 2016 166 1 21 45 27368099 10.1016/j.cell.2016.06.028 97 Zhang Y Dong P Liu N TRIM6 reduces ferroptosis and chemosensitivity by targeting SLC1A5 in lung cancer Oxid Med Cell Longev 2023 2023 9808100 36654781 10.1155/2023/9808100 PMC9842414 98 Luo L Xu G Fascaplysin induces apoptosis and ferroptosis, and enhances anti-PD-1 immunotherapy in non-small cell lung cancer (NSCLC) by promoting PD-L1 expression Int J Mol Sci 2022 23 22 13774 36430250 10.3390/ijms232213774 PMC9699238 99 Dai E Han L Liu J Ferroptotic damage promotes pancreatic tumorigenesis through a TMEM173/STING-dependent DNA sensor pathway Nat Commun 2020 11 1 6339 33311482 10.1038/s41467-020-20154-8 PMC7732843 100 Chen K Zhang S Jiao J Ferroptosis and its potential role in lung cancer: Updated evidence from pathogenesis to therapy J Inflamm Res 2021 14 7079 90 34992407 10.2147/JIR.S347955 PMC8709579 101 Wang H Huang Q Xia J The E3 ligase MIB1 promotes proteasomal degradation of NRF2 and sensitizes lung cancer cells to ferroptosis Mol Cancer Res 2022 20 2 253 64 34670864 10.1158/1541-7786.MCR-21-0342 102 Liu B Ma H Liu X CircSCN8A suppresses malignant progression and induces ferroptosis in non-small cell lung cancer by regulating miR-1290/ACSL4 axis Cell Cycle 2022 21 23 1 19 36482742 10.1080/15384101.2022.2154543 PMC10026894 103 Cui Z Li D Zhao J Falnidamol and cisplatin combinational treatment inhibits non-small cell lung cancer (NSCLC) by targeting DUSP26-mediated signal pathways Free Radic Biol Med 2022 183 106 24 35278641 10.1016/j.freeradbiomed.2022.03.003 104 Yan WY Cai J Wang JN Co-treatment of betulin and gefitinib is effective against EGFR wild-type/KRAS-mutant non-small cell lung cancer by inducing ferroptosis Neoplasma 2022 69 3 648 56 35330996 10.4149/neo_2022_211103N1568 105 Xin Q Ji Q Zhang Y Aberrant ROS served as an acquired vulnerability of cisplatin-resistant lung cancer Oxid Med Cell Longev 2022 2022 1112987 35770045 10.1155/2022/1112987 PMC9236771 106 Niu X Shen Y Wen Y KTN1 mediated unfolded protein response protects keratinocytes from ionizing radiation-induced DNA damage J Dermatol Sci 2024 114 1 24 33 38448340 10.1016/j.jdermsci.2024.02.006 107 Tan X Huang X Niu B Targeting GSTP1-dependent ferroptosis in lung cancer radiotherapy: Existing evidence and future directions Front Mol Biosci 2022 9 1102158 36589232 10.3389/fmolb.2022.1102158 PMC9800622 108 Lei G Zhang Y Koppula P The role of ferroptosis in ionizing radiation-induced cell death and tumor suppression Cell Res 2020 30 2 146 62 31949285 10.1038/s41422-019-0263-3 PMC7015061 109 Koppula P Lei G Zhang Y A targetable CoQ-FSP1 axis drives ferroptosis- and radiation-resistance in KEAP1 inactive lung cancers Nat Commun 2022 13 1 2206 35459868 10.1038/s41467-022-29905-1 PMC9033817 110 Emmanuel N Li H Chen J FSP1, a novel KEAP1/NRF2 target gene regulating ferroptosis and radioresistance in lung cancers Oncotarget 2022 13 1136 39 36264074 10.18632/oncotarget.28301 PMC9584440 111 Mowery NT Terzian WTH Nelson AC Acute lung injury Curr Probl Surg 2020 57 5 100777 32505224 10.1016/j.cpsurg.2020.100777 112 Thompson BT Chambers RC Liu KD Acute respiratory distress syndrome N Engl J Med 2017 377 6 562 72 28792873 10.1056/NEJMra1608077 113 Bos L Ware L Acute respiratory distress syndrome: Causes, pathophysiology, and phenotypes Lancet (London, England) 2022 400 10358 1145 56 36070787 10.1016/S0140-6736(22)01485-4 114 Lagan AL Melley DD Evans TW Pathogenesis of the systemic inflammatory syndrome and acute lung injury: Role of iron mobilization and decompartmentalization Am J Physiol Lung Cell Mol Physiol 2008 294 2 L161 74 18055843 10.1152/ajplung.00169.2007 115 Bezerra FS Lanzetti M Nesi RT Oxidative stress and inflammation in acute and chronic lung injuries Antioxidants 2023 12 3 548 36978796 10.3390/antiox12030548 PMC10045332 116 Li Y Cao Y Xiao J Inhibitor of apoptosis-stimulating protein of p53 inhibits ferroptosis and alleviates intestinal ischemia/reperfusion-induced acute lung injury Cell Death Differ 2020 27 9 2635 50 32203170 10.1038/s41418-020-0528-x PMC7429834 117 Zhongyin Z Wei W Juan X Isoliquiritin apioside relieves intestinal ischemia/reperfusion-induced acute lung injury by blocking Hif-1alpha-mediated ferroptosis Int Immunopharmacol 2022 108 108852 35597117 10.1016/j.intimp.2022.108852 118 Qiang Z Dong H Xia Y Nrf2 and STAT3 alleviates ferroptosis-mediated IIR-ALI by regulating SLC7A11 Oxid Med Cell Longev 2020 2020 5146982 33014271 10.1155/2020/5146982 PMC7520693 119 Dong H Xia Y Jin S Nrf2 attenuates ferroptosis-mediated IIR-ALI by modulating TERT and SLC7A11 Cell Death Dis 2021 12 11 1027 34716298 10.1038/s41419-021-04307-1 PMC8556385 120 Liu P Feng Y Li H Ferrostatin-1 alleviates lipopolysaccharide-induced acute lung injury via inhibiting ferroptosis Cell Mol Biol Lett 2020 25 10 32161620 10.1186/s11658-020-00205-0 PMC7045739 121 Peng J Fan B Bao C JMJD3 deficiency alleviates lipopolysaccharide-induced acute lung injury by inhibiting alveolar epithelial ferroptosis in a Nrf2-dependent manner Mol Med Rep 2021 24 5 807 34542160 10.3892/mmr.2021.12447 122 Chen X Qi G Fang F Silence of MLK3 alleviates lipopolysaccharide-induced lung epithelial cell injury via inhibiting p53-mediated ferroptosis J Mol Histol 2022 53 2 503 10 35247112 10.1007/s10735-022-10064-y 123 Liu X Wang L Xing Q Sevoflurane inhibits ferroptosis: A new mechanism to explain its protective role against lipopolysaccharide-induced acute lung injury Life Sci 2021 275 119391 33774026 10.1016/j.lfs.2021.119391 124 Li X Zhuang X Qiao T Role of ferroptosis in the process of acute radiation-induced lung injury in mice Biochem Biophys Res Commun 2019 519 2 240 45 31493867 10.1016/j.bbrc.2019.08.165 125 Li X Chen J Yuan S Activation of the P62-Keap1-NRF2 pathway protects against ferroptosis in radiation-induced lung injury Oxid Med Cell Longev 2022 2022 8973509 35847598 10.1155/2022/8973509 PMC9277166 126 Li L Wu D Deng S NVP-AUY922 alleviates radiation-induced lung injury via inhibition of autophagy-dependent ferroptosis Cell Death Discov 2022 8 1 86 35220409 10.1038/s41420-022-00887-9 PMC8882174 127 Wijsenbeek M Cottin V Spectrum of fibrotic lung diseases N Engl J Med 2020 383 10 958 68 32877584 10.1056/NEJMra2005230 128 Katzen J Beers MF Contributions of alveolar epithelial cell quality control to pulmonary fibrosis J Clin Invest 2020 130 10 5088 99 32870817 10.1172/JCI139519 PMC7524463 129 Cheng H Feng D Li X Iron deposition-induced ferroptosis in alveolar type II cells promotes the development of pulmonary fibrosis Biochim Biophys Acta Mol Basis Dis 2021 1867 12 166204 34175430 10.1016/j.bbadis.2021.166204 130 Han Y Ye L Du F Iron metabolism regulation of epithelial-mesenchymal transition in idiopathic pulmonary fibrosis Ann Transl Med 2021 9 24 1755 35071449 10.21037/atm-21-5404 PMC8756254 131 Ali MK Kim RY Brown AC Critical role for iron accumulation in the pathogenesis of fibrotic lung disease J Pathol 2020 251 1 49 62 32083318 10.1002/path.5401 132 Zhou J Tan Y Wang R Role of ferroptosis in fibrotic diseases J Inflamm Res 2022 15 3689 708 35783244 10.2147/JIR.S358470 PMC9248952 133 Chung JY Chan MK Li JS TGF-β signaling: From tissue fibrosis to tumor microenvironment Int J Mol Sci 2021 22 14 7575 34299192 10.3390/ijms22147575 PMC8303588 134 Pei Z Qin Y Fu X Inhibition of ferroptosis and iron accumulation alleviates pulmonary fibrosis in a bleomycin model Redox Biol 2022 57 102509 36302319 10.1016/j.redox.2022.102509 PMC9614651 135 Liu T Xu P Ke S Histone methyltransferase SETDB1 inhibits TGF-beta-induced epithelial-mesenchymal transition in pulmonary fibrosis by regulating SNAI1 expression and the ferroptosis signaling pathway Arch Biochem Biophys 2022 715 109087 34801472 10.1016/j.abb.2021.109087 136 Liu Y Cheng D Wang Y UHRF1-mediated ferroptosis promotes pulmonary fibrosis via epigenetic repression of GPX4 and FSP1 genes Cell Death Dis 2022 13 12 1070 36566325 10.1038/s41419-022-05515-z PMC9789966 137 Yuan L Sun Y Zhou N Dihydroquercetin attenuates silica-induced pulmonary fibrosis by inhibiting ferroptosis signaling pathway Front Pharmacol 2022 13 845600 35645837 10.3389/fphar.2022.845600 PMC9133504 138 Zhou Q Yang L Li T Mechanisms and inhibitors of ferroptosis in psoriasis Front Mol Biosci 2022 9 1019447 36188212 10.3389/fmolb.2022.1019447 PMC9520612 139 Yang N Shang Y Ferrostatin-1 and 3-Methyladenine ameliorate ferroptosis in OVA-induced asthma model and in IL-13-challenged BEAS-2B cells Oxid Med Cell Longev 2022 2022 9657933 35154576 10.1155/2022/9657933 PMC8837457 140 Ousingsawat J Schreiber R Gulbins E Pseudomonas aeruginosa Cell Physiol Biochem 2021 55 5 590 604 34637202 10.33594/000000437 141 Bao C Liu C Liu Q Liproxstatin-1 alleviates LPS/IL-13-induced bronchial epithelial cell injury and neutrophilic asthma in mice by inhibiting ferroptosis Int Immunopharmacol 2022 109 108770 35483233 10.1016/j.intimp.2022.108770 142 Guo L Bai S Ding S PM2.5 exposure induces lung injury and fibrosis by regulating ferroptosis via TGF-β signaling Dis Markers 2022 2022 7098463 36204510 10.1155/2022/7098463 PMC9532166 143 He H Liang L Huang J KIF20A is associated with clinical prognosis and synergistic effect of gemcitabine combined with ferroptosis inducer in lung adenocarcinoma Front Pharmacol 2022 13 1007429 36225575 10.3389/fphar.2022.1007429 PMC9549118 144 Yin L Liu P Jin Y Ferroptosis-related small-molecule compounds in cancer therapy: strategies and applications Eur J Med Chem 2022 244 114861 36332549 10.1016/j.ejmech.2022.114861 145 Chan WJ Adiwidjaja J McLachlan AJ Interactions between natural products and cancer treatments: Underlying mechanisms and clinical importance Cancer Chemother Pharmacol 2023 91 3 113041 10.1007/s00280-023-04504-z PMC9905199 36707434 146 Liu P Chen Y Xiao J Protective effect of natural products in metabolic-associated kidney diseases via regulating mitochondrial dysfunction Front Pharmacol 2022 13 1093397 36712696 10.3389/fphar.2022.1093397 PMC9877617 147 Kibble M Saarinen N Tang J Network pharmacology applications to map the unexplored target space and therapeutic potential of natural products Nat Prod Rep 2015 32 8 1249 66 26030402 10.1039/c5np00005j 148 Stepanić V Kučerová-Chlupáčová M Review and chemoinformatic analysis of ferroptosis modulators with a focus on natural plant products Molecules 2023 28 2 475 36677534 10.3390/molecules28020475 PMC9862590 149 Rahman MM Bibi S Rahaman MS Natural therapeutics and nutraceuticals for lung diseases: Traditional significance, phytochemistry, and pharmacology Biomed Pharmacother 2022 150 113041 35658211 10.1016/j.biopha.2022.113041 150 Liu X Hai Y Dong J Realgar-induced KRAS mutation lung cancer cell death via KRAS/Raf/MAPK mediates ferroptosis Int J Oncol 2022 61 6 157 36321791 10.3892/ijo.2022.5447 PMC9635866 151 Ming T Tao Q Tang S Curcumin: An epigenetic regulator and its application in cancer Biomed Pharmacother 2022 156 113956 36411666 10.1016/j.biopha.2022.113956 152 Tang X Ding H Liang M Curcumin induces ferroptosis in non-small-cell lung cancer via activating autophagy Thorac Cancer 2021 12 8 1219 30 33656766 10.1111/1759-7714.13904 PMC8046146 153 Tang X Li Z Yu Z Effect of curcumin on lung epithelial injury and ferroptosis induced by cigarette smoke Hum Exp Toxicol 2021 40 12 Suppl S753 S62 34787501 10.1177/09603271211059497 154 Zduńska K Dana A Kołodziejczak A Antioxidant properties of ferulic acid and its possible application Skin Pharmacol Physiol 2018 31 6 332 36 30235459 10.1159/000491755 155 Breuss JM Atanasov AG Uhrin P Resveratrol and its effects on the vascular system Int J Mol Sci 2019 20 7 1523 30934670 10.3390/ijms20071523 PMC6479680 156 Huang W Yu L Cai W Resveratrol protects BEAS-2B cells against erastin-induced ferroptosis through the Nrf2/Keap1 pathway Planta Med 2022 88 10 821 33 10.1055/a-1923-4399 36167314 157 Tao H Zhao Y Li L Comparative metabolomics of flavonoids in twenty vegetables reveal their nutritional diversity and potential health benefits Food Res Int 2023 164 112384 36737968 10.1016/j.foodres.2022.112384 158 Sun C Jin W Shi H Oligomeric proanthocyanidins protect A549 cells against H 2 2 Int J Mol Med 2017 39 6 1548 54 28487966 10.3892/ijmm.2017.2971 159 Jiang Y Wang X Yang W Procyanidin B2 suppresses lipopolysaccharides-induced inflammation and apoptosis in human type II alveolar epithelial cells and lung fibroblasts J Interferon Cytokine Res 2020 40 1 54 63 31603717 10.1089/jir.2019.0083 160 Lv YW Du Y Ma SS Proanthocyanidins attenuate ferroptosis against influenza-induced acute lung injury in mice by reducing IFN-γ Life Sci 2023 314 121279 36526043 10.1016/j.lfs.2022.121279 161 Liu X Ma Y Luo L Dihydroquercetin suppresses cigarette smoke-induced ferroptosis in the pathogenesis of chronic obstructive pulmonary disease by activating the Nrf2-mediated pathway Phytomedicine 2022 96 153894 34942457 10.1016/j.phymed.2021.153894 162 Tariq H Asif S Andleeb A Flavonoid production: Current trends in plant metabolic engineering and de novo microbial production Metabolites 2023 13 1 124 36677049 10.3390/metabo13010124 PMC9864322 163 Gao Y Wang K Zhang J Multifunctional nanoparticle for cancer therapy MedComm (2020) 2023 4 1 e187 36654533 10.1002/mco2.187 PMC9834710 164 Zhu G Chi H Liu M Multifunctional “ball-rod” Janus nanoparticles boosting Fenton reaction for ferroptosis therapy of non-small cell lung cancer J Colloid Interface Sci 2022 621 12 23 35447518 10.1016/j.jcis.2022.04.021 165 Li Y Yang J Gu G Pulmonary delivery of theranostic nanoclusters for lung cancer ferroptosis with enhanced chemodynamic/radiation synergistic therapy Nano Lett 2022 22 3 963 72 35073699 10.1021/acs.nanolett.1c03786 166 Liu T Yang Q Zheng H Multifaceted roles of a bioengineered nanoreactor in repressing radiation-induced lung injury Biomaterials 2021 277 121103 34478930 10.1016/j.biomaterials.2021.121103 Figure 1 Defense mechanisms of ferroptosis The primary defense systems against ferroptosis include the cyst(e)ine/glutathione/glutathione peroxidase 4 (GPX4) axis, the NAD(P)H/FSP1/CoQ10 system, the GTP cyclohydrolase 1 (GCH1)/tetrahydrobiopterin (BH4)/dihydrofolate reductase (DFH2) pathway, and the dihydroorotate dehydrogenase (DHODH)/CoQ10 pathway. Notably, DHODH exerts its anti-ferroptotic function within mitochondria, highlighting the importance of compartmentalized redox regulation. The figure was drawn using Figdraw ( www.figdraw.com Figure 2 Ferroptosis of lung epithelial cells in different lung diseases Lung epithelial cell ferroptosis is implicated in the pathogenesis of various respiratory diseases, including chronic obstructive pulmonary disease, asthma, pulmonary infections, acute lung injury, pulmonary fibrosis, and lung cancer. The figure illustrates how ferroptosis contributes to epithelial dysfunction and disease progression in each condition. The figure was drawn using Figdraw ( www.figdraw.com Table 1 Summary of ferroptosis mechanisms and effects in different lung epithelial cell types across pulmonary diseases. Lung disease Epithelial cell type involved Role of ferroptosis Key inducers/inhibitors Reference(s) COPD Bronchial epithelial cells (BEAS-2B) Oxidative stress and ferroptosis contribute to epithelial injury and inflammation Ferrostatin-1, Liproxstatin-1, NAC [ 61 89 141 Asthma Bronchial epithelial cells (BEAS-2B) Ferroptosis exacerbates epithelial dysfunction in IL-13-induced asthma model Ferrostatin-1 [ 139 Pulmonary Fibrosis Type II alveolar epithelial cells (MLE-12, A549) Ferroptosis promotes epithelial–mesenchymal transition and fibrosis via oxidative stress and iron overload Deferoxamine, DHQ SETDB1, UHRF1 [ 128 137 Lung infection Bronchial epithelial cells Pseudomonas aeruginosa Ferrostatin-1 [ 140 Acute lung injury Alveolar epithelial cells Increased ROS and ferroptosis worsen epithelial damage Ferulic acid, NAC, proanthocyanidins [ 154 160 142 Lung cancer A549, H1299 cells Ferroptosis induction offers therapeutic benefit via anti-tumor effects Curcumin, erastin, sulfasalazine, nanoparticles [ 143 144 150 152 Radiation-induced lung injury Type II alveolar epithelial cells (surfactant-associated protein C+) Radiation induces ferroptosis contributing to fibrosis SOD@ARA290-HBc nanoreactor [ 166 COPD – chronic obstructive pulmonary disease; DHQ – dihydroquercetin; NAC – N-acetyl-L-cysteine; ROS – reactive oxygen species. ",
  "metadata": {
    "Title of this paper": "Multifaceted roles of a bioengineered nanoreactor in repressing radiation-induced lung injury",
    "Journal it was published in:": "Medical Science Monitor: International Medical Journal of Experimental and Clinical Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477972/"
  }
}