{
  "title": "Paper_1053",
  "abstract": "pmc Scand J Immunol Scand J Immunol 379 blackwellopen SJI Scandinavian Journal of Immunology 0300-9475 1365-3083 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12475091 PMC12475091.1 12475091 12475091 41013715 10.1111/sji.70055 SJI70055 2121418 1 Original Article Original Article Cross‐Sectional and Longitudinal Immunoprofiling of Oligoarticular Juvenile Idiopathic Arthritis Reveals Different Patterns in Synovial Fluid and Plasma Qu Heshuang https://orcid.org/0000-0001-6011-5588  1  2 Neog Manoj  1  2 Palmblad Karin  3  4 Sundberg Erik  3  4 Lövquist Alexandra  5 Melén Erik https://orcid.org/0000-0002-8248-0663  6  7 Aulin Cecilia  1  2 Harris Helena Erlandsson  1  2  8 helena.harris@ki.se   1 Center for Molecular Medicine, Department of Medicine Solna Karolinska Institutet Stockholm Sweden   2 Division of Rheumatology Karolinska University Hospital Stockholm Sweden   3 Unit of Pediatric Rheumatology Karolinska University Hospital Stockholm Sweden   4 Department of Women's and Children's Health Karolinska Institutet Stockholm Sweden   5 Center for Occupational and Environmental Medicine, Region Stockholm Stockholm Sweden   6 Sachs Children's Hospital Stockholm Sweden   7 Department of Clinical Sciences and Education, Karolinska Institutet, Södersjukhuset Stockholm Sweden   8 The Broegelmann Research Laboratory, Department of Clinical Science University of Bergen Bergen Norway * Correspondence: helena.harris@ki.se 26 9 2025 10 2025 102 4 497679 10.1111/sji.v102.4 e70055 05 9 2025 03 7 2025 08 9 2025 27 09 2025 28 09 2025 29 09 2025 © 2025 The Author(s). Scandinavian Journal of Immunology https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Oligoarticular juvenile idiopathic arthritis (oligoJIA) constitutes nearly 60% of all JIA cases. The immune mechanisms involved in the pathogenesis remain incompletely understood. Few proteomic studies have been performed using synovial fluid (SF) samples. We conducted an exploratory analysis of plasma and SF samples to define inflammatory profiles, assess plasma‐SF correlation and examine longitudinal variations. Using proximity extension assay (PEA), we profiled 92 immune‐related proteins in plasma and Sf from 14 oligoJIA patients (untreated or NSAID‐treated) and plasma from 28 age and sex‐matched healthy controls. Differentially expressed proteins were analysed using gene ontology (GO) and KEGG pathways via STRING. Plasma proteomic immune profiles from oligoJIA patients were highly overlapping with immune profiles of healthy donors. Six proteins were differentially expressed between the two groups. Overall, plasma and SF protein expressions correlated ( r Using proximity extension assay, we determined the synovial fluid (SF) and plasma immunoprofiles of oligoJIA patients, cross‐sectionally and longitudinally. More disease‐relevant characteristics were revealed in SF than in plasma. The early‐phase enrichment of chemokines in SF suggests that targeting chemokines may offer therapeutic potential for early disease remission. immunoprofiling oligoarticular juvenile idiopathic arthritis plasma proteomics synovial fluid The Swedish Rheumatism Association 10.13039/501100007949 Magnus Bergvall’s Foundation 10.13039/501100006285 Ulla and Gustaf af Ugglas Foundation 10.13039/501100009806 The Samarithan’s foundation 10.13039/501100008352 Karolinska Institutet 10.13039/501100004047 The Swedish Science Council 10.13039/501100004359 2018–02885 2021‐02723 Stockholm County 20190592 530144 China Scholarship Council 10.13039/501100004543 201807930002 King Gustaf V 80‐year Foundation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:27.09.2025  H. Qu M. Neog K. Palmblad Cross‐Sectional and Longitudinal Immunoprofiling of Oligoarticular Juvenile Idiopathic Arthritis Reveals Different Patterns in Synovial Fluid and Plasma Scandinavian Journal of Immunology 102 4 2025 e70055 10.1111/sji.70055 41013715  Funding: Heshuang Qu and Manoj Neog contributed equally to this work. 1 Introduction Juvenile idiopathic arthritis (JIA) encompasses a diverse group of chronic inflammatory conditions in children, classified into seven subtypes based on clinical features, disease progression and immunological characteristics [ 1 2 Oligoarticular juvenile idiopathic arthritis (oligoJIA) is the most common JIA subtype, characterised by chronic inflammation involving 1 to 4 joints during the first 6 months of disease [ 3 4 While several studies have focused on individual inflammatory molecules important in pathogenesis of JIA, in particular TNF, IL1, IL6 and S100 proteins [ 5 6 7 8 9 10 Despite progress in characterisation of oligoJIA, there are still significant knowledge gaps, in particular the relationship between local and systemic inflammation and the kinetics of joint inflammation during disease progression. Such knowledge may reveal plasma biomarkers reflecting the ongoing joint inflammation, reveal new therapeutic targets and suggest optimal treatment windows for target‐specific therapies. In this study, we investigated the inflammatory protein profile of matched plasma and SF samples from patients with oligoJIA using proximity extension assay (PEA) to quantify 92 inflammation‐related proteins. The primary aim of our study was to characterise and compare the immunoprofiles in plasma and SF. The secondary aim was to explore whether the inflammation pattern changed over time and to define immune mechanisms activated during early and late stages of oligoJIA disease course. 2 Materials and Methods 2.1 Patients Plasma and SF samples from fourteen oligoJIA patients were collected at Astrid Lindgren's Children Hospital in Stockholm, Sweden. Paediatric rheumatologists diagnosed all patients according to the International League of Associations for Rheumatology (ILAR) criteria [ 3 1 TABLE 1 Clinical characteristics of oligoJIA patients at the sampling time points. Patient number Sex Sampling age (years) Disease duration at sampling (weeks) Treatments at sampling Treatment duration at sampling (weeks) GAD (0–10) cJADAS‐71 (0–91) 1 F 7 15 NSAIDs 6 1.0 3.0 10 154 NSAIDs 145 1.0 2.0 2 F 12 10 NSAIDs 3 2.4 10.1 15 150 nt 0 1.5 2.7 3 M 7 40 nt 0 1.8 5.0 9 146 NSAIDs 65 1.8 3.0 4 F 7 17 nt 0 0.7 1.7 9 168 NSAIDs 2 1.0 4.0 5 M 15 5 nt 0 2.1 NA 17 154 nt 0 2.4 3.5 6 F 2 7 nt 0 1.2 NA 7 F 3 44 NSAIDs 36 1.3 7.2 8 F 7 6 NSAIDs 1 2.6 3.6 9 M 9 17 NSAIDs 7 1.8 9.0 10 F 10 14 nt 0 1.4 7.1 11 F 10 8 nt 0 1.0 2.6 12 F 13 15 nt 0 1.9 10.5 13 F 2 1 NSAIDs 1 1.7 NA 14 F 10 13 nt 0 1.1 3.7 Abbreviations: cJADAS‐71, Clinical Juvenile Arthritis Disease Activity Score of 71 joints; F, female; GAD, Global Assessment score by Doctor; M, male; NA, not available; NSAIDs, non‐steroidal anti‐inflammatory drugs; nt, no ongoing treatment. In addition, 20 longitudinally collected SF samples and 10 longitudinally collected plasma samples from one male patient were analysed in a case study (Figure 2C Age‐ and sex‐matched healthy controls were obtained from a population‐based cohort (Barnens miljö‐ och hälsoundersökning [ 11 Fresh SF and blood from both JIA patients and healthy children were collected in citrate tubes and EDTA tubes, respectively. SF samples were centrifuged at 3000 g for 10 min to obtain cell‐free samples. Blood samples were centrifuged at 3000 g for 10 to 15 min. All samples were prepared and aliquoted within 4 h and stored at −80°C until analysed. 2.2 Proximity Extension Assay Undiluted plasma and SF samples were analysed using a high‐throughput, multiplex immunoassay (Proseek Multiplex, Proximity Extension Assay (PEA) technology, Inflammation panel, Olink Bioscience, Sweden). The selected panel includes 92 immune‐related proteins, primarily cytokines and chemokines, as listed in Table S1 2.3 Data Processing and Statistical Analysis In the cross‐sectional analysis of plasma samples from healthy controls and oligoJIA, ordinary two‐way ANOVA was performed on oligoJIA ( n n n n n n p Hierarchical Clustering Analysis (HCA) and Principal Component Analysis (PCA) were performed by ClustVis Web Tool [ 12 13 3 Results Summaries of demographic and disease characteristics of the patients and age and sex distribution of patients and healthy controls are outlined in Tables 1 2 TABLE 2 Average age of patients and healthy controls. Average age  b Average age of females  b Average age of males  b Patients ( n 8.14 ± 3.96 7.55 ± 3.88 10.33 ± 4.16 Healthy controls ( n 8.00 ± 2.67 7.64 ± 2.74 9.33 ± 2.07  p  a 0.904 0.945 0.725  a Statistics: Unpaired t  b Average age at the first sample occasion. Five patients had samples obtained both in the early phase and in the persistent phase; data included in the table are from the early phase sampling. 3.1 Overlapping Proteomic Immunoprofiles in Plasma From oligoJIA We first investigated the inflammation‐related protein profiles in plasma from patients with oligoJIA by comparing them with age‐ and sex‐matched healthy controls. The patients were treatment naïve, that is, no ongoing medication or only NSAIDs (Table 1 1A,B 1C 1C S2 FIGURE 1 Cross‐sectional analysis of plasma immunoprofiles in patients with OligoJIA and in matched healthy controls revealed overlapping profiles. (A) HCA plot of 14 patients and 28 age‐ and sex‐matched healthy controls. Unit variance scaling was applied to rows; Rows are clustered using correlation distance and average linkage; Columns were clustered using Euclidean distance and average linkage. (B) PCA of the two groups based on the 69 proteins shown in (A) displayed a major overlap between oligoJIA and healthy. The confidence level of the ellipses is 0.95. (C) Volcano plot of differentially expressed proteins comparing oligoJIA and healthy controls. X‐axis represent the subtraction between oligoJIA and healthy control. One unit difference in NPX value represents a doubling of the actual concentration. Blue dots represent proteins which are significantly lower in plasma from patients with oligoJIA than healthy controls ( p p 3.2 Immunoprofiles in Plasma and SF oligoJIA Patients with oligoJIA have manifestations in one or several joints and usually do not display quantifiable systemic inflammation. While plasma sampling is commonly used for clinical diagnosis, SF is not. Therefore, to investigate if the systemic protein composition of plasma reflects the local protein composition in SF, we compared paired plasma and SF samples isolated at the same sampling occasion from 11 patients. Multiple correlation analysis indicated that plasma and SF displayed an overall positive correlation, with an R 2A 2B S2 FIGURE 2 Immunoprofiles in plasma and SF from oligoJIA patients. (A) Pearson correlation analysis indicated that plasma and SF from patients ( n R 3.3 Immunoprofiles in Longitudinal SF To investigate if the inflammatory pattern fluctuates over time in oligoJIA, we analysed the immunoprofile of one patient using 20 SF samples and 10 plasma samples collected over a 4‐year time period. The patient was treated with NSAIDs over the course of the sampling, initially ibuprofen, but switched to naproxen at week 97. From week 165, treatment with MTX was added, and at week 205, TNF inhibiting treatment was initiated. Additionally, local cortisone injections were given; these were done immediately following SF withdrawal. Due to recurrent joint inflammation, cortisone injections and SF withdrawals were done on numerous occasions (Figure 2C Immune profiles of the 20 SF samples (Figure 2D 2E The clinical parameters, including C‐reactive protein (CRP), erythrocyte sedimentation rate (ESR), GAD and cJADAS‐71, were recorded at the times of sampling and are listed in Figure S1 S1A,B S1C,D 3.4 Analysis of Early Stage oligoJIA SF As the longitudinal data from the single case study patient indicated that the inflammatory protein profile was stable during NSAID treatment, we sought to further explore whether there are any differences between early and persistent disease phases. Hence, a cross‐sectional analysis of five treatment‐naive patients (no treatment or NSAID) was performed. Paired plasma and SF samples during early (disease duration 17.4 ± 13.5 weeks) and late disease stages (disease duration 154.4 ± 8.3 weeks) were analysed with PEA. The results showed that 4 and 19 proteins were differentially expressed comparing the early and late disease stages in plasma and SF, respectively. Two proteins, OSM and S100A12, differed in both SF and plasma (Figure 3A 3B,C 3D 3E 3F p S3 S4 FIGURE 3 Paired analysis of early and late stages of oligoJIA showed enrichment in immune cell chemotaxis in SF at the early stage. Comparison of plasma and SF protein levels in paired samples from five patients during early (disease duration 17.4 ± 13.5 weeks) and late disease stages (disease duration 154.4 ± 8.3 weeks). All patients were treatment naïve or treated with NSAIDs only. (A) The Venn diagram shows the overlap of significantly differently expressed proteins between early and late stages in plasma and in SF. (B) Individual, paired NPX‐values for the 4 significantly increased plasma proteins during the early stage. (C) Individual, paired NPX‐values for the 19 significantly increased proteins in SF during early and late disease stages. (D) Protein network generated by STRING based on the 19 significantly different proteins in SF. (E) GO analysis and (F) KEGG pathway analysis based on the 19 significantly different proteins in SF. Statistical analysis (B, C) was performed by ordinary two‐way ANOVA. 4 Discussion In this exploratory study, we set out to define inflammatory mediators and pathways involved in the pathogenesis of oligoJIA using a proteomics approach. We took advantage of our collection of paired SF and plasma samples collected in parallel for over 200 weeks. Additionally, we used paired SF and plasma samples from early and late stages of oligoJIA to explore whether inflammatory profiles differed as the disease progressed. Compared with age‐ and sex‐matched healthy controls, the inflammation‐related plasma proteome in patients with oligoJIA showed only minor differences at the individual protein level. This result reflects the clinical picture, as patients with oligoJIA primarily display local joint inflammation with limited systemic symptoms. We found that 6 out of 69 proteins (MMP1, SIRT2, STAMBP, CXCL5, CXCL6 and SULT1A1) were significantly differentially expressed in oligoJIA compared to healthy control plasma. Elevated levels of the collagenase MMP1 have been observed in SF from patients with rheumatoid arthritis (RA) [ 14 15 16 SIRT2 is a cytosolic NAD+ (nicotinamide adenine dinucleotide)‐dependent deacetylase. In collagen‐induced arthritis, a deficiency of SIRT2 16 17 18 STAMBP is an endosome‐associated deubiquitinase. It has been implicated in the modulation of NLRP3 cytokine secretion [ 19 CXCL5 and CXCL6 are chemokines and ligands of CXCR2. It has been demonstrated that fibroblast‐like synoviocytes secrete CXCL5 upon activation, leading to neutrophil recruitment to the joints [ 20 21 22 In a previous study, we observed that plasma CXCL5 levels were dynamically regulated, increasing during active disease and decreasing during inactive phases as compared to healthy controls [ 8 To investigate the inflammatory process over time, a case study of a patient with persistent oligoJIA with 20 sampling occasions over a 4‐year period and a sub‐cohort of longitudinal samples from 5 patients was analysed. The case study patient was diagnosed with oligoJIA having knee joint inflammation. Systemic medication with NSAIDs was not efficient in treating the disease, as joint swelling was not prevented. The disease was considered mild since it only involved one knee joint, and intra‐articular treatment with cortisone caused remission for varying lengths of time. Considering the potential side effects of MTX and anti‐TNF treatment, the patient had NSAIDs only treatment until week 146 after disease onset when MTX was prescribed. As resistance to MTX treatment developed, a switch to TNF‐blockade was prescribed. The washout period for intra‐articular cortisone is considered to be 12 weeks. Most sample occasions were more than 12 weeks apart, although even at the sampling occasions closer than 12 weeks, no major differences were recorded by HCA. Although this patient might not be considered a typical oligoJIA patient, recurrent joint inflammation occurs in a number of oligoJIA patients and by immunoprofiling a longitudinal series of plasma and SF from one individual, we could map the joint inflammation at the molecular level. We observed a persistent inflammatory protein immunoprofile in SF, especially during the NSAIDs treatment period. Interestingly, though MTX was not effective from a clinical perspective as joint swelling reappeared, it did result in a general reduction of inflammatory proteins in both plasma and SF. The effects of MTX were however transient, as downregulation of protein levels started to reverse after 5 weeks. This could possibly be due to the development of MTX resistance, which occurs in up to 65% of patients with JIA [ 23 Despite a positive correlation between plasma and SF measurements being observed in the analysis of the 11 treatment‐naïve oligoJIA, in the case study, the immunoprofile in SF was not reflected in the plasma. For example, at week 165, when we had not mapped any major changes in the SF profile, we could already record an evident inflammation reduction in the plasma profile. Additionally, after adding anti‐TNF treatment, there was no shift in the SF profile, while some up‐ and downregulation could be detected in plasma. In conclusion, at the individual level, the local inflammation profile recorded in SF could not be reproduced in plasma samples. It further implies the necessity to study SF samples to reveal dysregulated immune mechanisms contributing to the local inflammation in joints. Although the case study described a non‐fluctuating immunoprofile over time, the paired analysis of the early and late stages in five patients revealed changes in the immune profile with disease progression. Specifically, a decrease in chemokines and cytokines was observed over time, supported by the enriched pathways of cell chemotaxis from GO and KEGG analysis. STRING analysis of the DEPs placed CXCL and CCL chemokines as central hubs in the immune network. Our data support the current view that the initiation of the JIA pathophysiological cascade includes abnormal infiltration and activation of immune cells in the joints, where the cells produce pro‐inflammatory mediators that cause joint destruction and systemic complications [ 24 Numerous chemokines and their receptors have been detected in arthritic synovium [ 25 26 27 28 The limitations of this study include the small patient cohort and lack of comparison with SF from non‐arthritic controls. Collection of SF from healthy individuals and, in particular, children is rare as it is considered not ethically justified. Further, we used a targeted PEA panel measuring 92 inflammatory‐related proteins, which is a small proportion of all the proteins in plasma and SF. Some mechanisms, for example, MTX resistance, were not explained by the current results. In future studies, verification of our findings in a larger cohort and by techniques covering more of or even the entire proteome is highly warranted. In conclusion, by applying a high‐throughput and multiplex immunoassay, we have defined plasma and SF inflammatory protein profiles in an oligoJIA cohort. We found that patients with oligoJIA showed similar plasma immunoprofiles as age and sex‐matched healthy controls. We performed a longitudinal analysis of a series of plasma and SF samples from an individual oligoJIA case identifying a persistent inflammatory profile over time. A decrease in inflammation was observed by MTX treatment but was not reflected in the clinical symptoms. When comparing early and late disease stages of oligoJIA in a subgroup of our cohort, we found that chemokines and chemotaxis were important contributors early in the disease course and then reduced with the disease progression. Our data indicate chemokines as potential oligoJIA therapeutic targets, especially during the early disease phase. Furthermore, our study underlines the importance of SF samples, or synovial tissue samples, when studying immunopathogenic mechanisms active during oligoJIA. Author Contributions H.E.H., H.Q., E.S., C.A. and M.N. conceived the study. H.E.H., E.S. and K.P. recruited the patients. E.S. and K.P. collected patient samples and recorded the clinical scores. H.Q., K.P., E.S., C.A., M.N. and H.E.H. analysed the data. H.Q. and M.N. wrote the first draft of the manuscript. H.Q., H.E.H. and C.A. produced the illustrations and wrote the final draft of the manuscript. All authors critically reviewed and approved the final version of the manuscript. Ethics Statement The study was performed in accordance with the Declaration of Helsinki and ethical approvals were obtained from the North Ethical Committee in Stockholm, Sweden (Dnrs 2009–1139‐30‐4 and 2010–165–31‐2 for Juvenile Arthritis BioBank Astrid Lindgren's hospital and Dnr 03–067 for Barnens miljö‐och hälsoundersökning). Consent Informed consent was given by all the sample donators and their parents to participate in the study and for dissemination of the results. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Table S1:  Table S2: p  Table S3:  Table S4:  Figure S1: Acknowledgements The authors thank Professors Magnus Wickman and Erik Melén for kindly providing healthy children's plasma samples from Barnens miljö‐ och hälsoundersökning; Karina Mördrup, Lotta Aveberger and Lena Klevenvall for their technical assistance in managing samples in Juvenile Arthritis BioBank Astrid Lindgren's hospital (JABBA). The authors also thank all the participants who donated blood and SF samples to this study. Data Availability Statement The data that supports the findings of this study are available in the Supporting Information References 1 A. Ravelli A. Martini Juvenile Idiopathic Arthritis Lancet 369 2007 767 778 17336654 10.1016/S0140-6736(07)60363-8 2 G. Giancane A. Consolaro S. Lanni S. Davì B. Schiappapietra A. Ravelli Juvenile Idiopathic Arthritis: Diagnosis and Treatment Rheumatology and Therapy 3 2016 187 207 27747582 10.1007/s40744-016-0040-4 PMC5127964 3 R. E. Petty T. R. Southwood P. Manners International League of Associations for Rheumatology Classification of Juvenile Idiopathic Arthritis: Second Revision, Edmonton, 2001 Journal of Rheumatology 31 2004 390 392 14760812 4 C. B. Crayne T. Beukelman Juvenile Idiopathic Arthritis: Oligoarthritis and Polyarthritis Pediatric Clinics of North America 65 2018 657 674 30031492 10.1016/j.pcl.2018.03.005 5 C. Triaille P. Quartier L. De Somer Patterns and Determinants of Response to Novel Therapies in Juvenile and Adult‐Onset Polyarthritis Open Access Rheumatology 63 2024 594 607 37725352 10.1093/rheumatology/kead490 PMC10907821 6 L. Breda S. La Bella A. Di Ludovico Biomarkers in Juvenile Idiopathic Arthritis: Towards Precision Diagnosis and Personalized Therapy? Current Opinion in Rheumatology 37 2025 308 315 40539554 10.1097/BOR.0000000000001109 7 A. C. Brescia M. M. Simonds K. E. Sullivan C. D. Rose Secretion of Pro‐Inflammatory Cytokines and Chemokines and Loss of Regulatory Signals by Fibroblast‐Like Synoviocytes in Juvenile Idiopathic Arthritis Proteomics. Clinical Applications 11 5–6 2017 1600088 28012239 10.1002/prca.201600088 PMC6084365 8 H. Van Der Heijden B. Fatou D. Sibai Proteomics Based Markers of Clinical Pain Severity in Juvenile Idiopathic Arthritis Pediatric Rheumatology Online Journal 20 1 2022 3 35033099 10.1186/s12969-022-00662-1 PMC8761318 9 H. Qu E. Sundberg C. Aulin Immunoprofiling of Active and Inactive Systemic Juvenile Idiopathic Arthritis Reveals Distinct Biomarkers: A Single‐Center Study Pediatric Rheumatology Online Journal 19 2021 173 34963488 10.1186/s12969-021-00660-9 PMC8713412 10 M. Gleerup C. Kessel D. Foell Inflammatory Biomarkers Predicting Long‐Term Remission and Active Disease in Juvenile Idiopathic Arthritis: A Population‐Based Study of the Nordic JIA Cohort RMD Open 10 3 2024 e004317 39242113 10.1136/rmdopen-2024-004317 PMC11381635 11 Barns Hälsa Och Miljö I Stockholms Län 2006 [Press Release] “Arbets‐och miljömedicin inom Centrum för folkhälsa,” 2006 12 T. Metsalu J. Vilo ClustVis: A Web Tool for Visualizing Clustering of Multivariate Data Using Principal Component Analysis and Heatmap Nucleic Acids Research 43 W1 2015 W566 W570 25969447 10.1093/nar/gkv468 PMC4489295 13 D. Szklarczyk A. Franceschini S. Wyder String V10: Protein‐Protein Interaction Networks, Integrated Over the Tree of Life Nucleic Acids Research 43 2015 D447 D452 25352553 10.1093/nar/gku1003 PMC4383874 14 J. Mateos L. Lourido P. Fernández‐Puente Differential Protein Profiling of Synovial Fluid From Rheumatoid Arthritis and Osteoarthritis Patients Using Lc‐Maldi Tof/Tof Journal of Proteomics 75 2012 2869 2878 22245418 10.1016/j.jprot.2011.12.042 15 M. Wojdas K. Dąbkowska K. Kuźnik‐Trocha Plasma Glycosaminoglycans in Children With Juvenile Idiopathic Arthritis Being Treated With Etanercept as Potential Biomarkers of Joint Dysfunction Biomedicine 10 2022 1845 10.3390/biomedicines10081845 PMC9405228 36009392 16 J. Lin B. Sun C. Jiang H. Hong Y. Zheng Sirt2 Suppresses Inflammatory Responses in Collagen‐Induced Arthritis Biochemical and Biophysical Research Communications 441 2013 897 903 24211200 10.1016/j.bbrc.2013.10.153 17 K. M. Rothgiesser S. Erener S. Waibel B. Lüscher M. O. Hottiger Sirt2 Regulates Nf‐Κb Dependent Gene Expression Through Deacetylation of P65 Lys310 Journal of Cell Science 123 2010 4251 4258 21081649 10.1242/jcs.073783 18 M. Wu J. B. Zhang Y. W. Xiong Promotion of Lung Cancer Metastasis by SIRT2‐Mediated Extracellular Protein Deacetylation Advanced Science 10 3 2023 e2205462 36453571 10.1002/advs.202205462 PMC9875677 19 J. S. Bednash F. Johns N. Patel T. R. Smail J. D. Londino R. K. Mallampalli The Deubiquitinase STAMBP Modulates Cytokine Secretion Through the NLRP3 Inflammasome Cellular Signalling 79 2021 109859 33253913 10.1016/j.cellsig.2020.109859 PMC10201604 20 K. Hirota M. Hashimoto Y. Ito Autoimmune Th17 Cells Induced Synovial Stromal and Innate Lymphoid Cell Secretion of the Cytokine Gm‐Csf to Initiate and Augment Autoimmune Arthritis Immunity 48 2018 1220 1232.e5 29802020 10.1016/j.immuni.2018.04.009 PMC6024031 21 A. E. Koch S. L. Kunkel L. A. Harlow Epithelial Neutrophil Activating Peptide‐78: A Novel Chemotactic Cytokine for Neutrophils in Arthritis Journal of Clinical Investigation 94 1994 1012 1018 8083342 10.1172/JCI117414 PMC295150 22 X. Fan C. T. Ng D. Guo Dampened Inflammation and Improved Survival After CXCL5 Administration in Murine Lupus via Myeloid and Neutrophil Pathways Arthritis & Rhematology 75 4 2023 553 566 10.1002/art.42383 36240108 23 G. Ferrara G. Mastrangelo P. Barone Methotrexate in Juvenile Idiopathic Arthritis: Advice and Recommendations From the Marajia Expert Consensus Meeting Pediatric Rheumatology Online Journal 16 2018 46 29996864 10.1186/s12969-018-0255-8 PMC6042421 24 L. N. Zaripova A. Midgley S. E. Christmas M. W. Beresford E. M. Baildam R. A. Oldershaw Juvenile Idiopathic Arthritis: From Aetiopathogenesis to Therapeutic Approaches Pediatric Rheumatology 19 2021 135 34425842 10.1186/s12969-021-00629-8 PMC8383464 25 Z. Szekanecz A. Vegvari Z. Szabo Chemokines and Chemokine Receptors in Arthritis Frontiers in Bioscience (Scholar Edition) 2 2010 153 167 20036936 10.2741/s53 PMC2917905 26 A. E. Koch Chemokines and Their Receptors in Rheumatoid Arthritis: Future Targets? Arthritis and Rheumatism 52 2005 710 721 15751074 10.1002/art.20932 27 N. M. Elemam S. Hannawi A. A. Maghazachi Role of Chemokines and Chemokine Receptors in Rheumatoid Arthritis ImmunoTargets and Therapy 9 2020 43 56 32211348 10.2147/ITT.S243636 PMC7074856 28 J. J. Haringman R. L. Oostendorp P. P. Tak Targeting Cellular Adhesion Molecules, Chemokines and Chemokine Receptors in Rheumatoid Arthritis Expert Opinion on Emerging Drugs 10 2005 299 310 15934868 10.1517/14728214.10.2.299 ",
  "metadata": {
    "Title of this paper": "Targeting Cellular Adhesion Molecules, Chemokines and Chemokine Receptors in Rheumatoid Arthritis",
    "Journal it was published in:": "Scandinavian Journal of Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475091/"
  }
}