{
  "title": "Paper_931",
  "abstract": "pmc Front Surg Front Surg 2654 frontsurg Front. Surg. Frontiers in Surgery 2296-875X Frontiers Media SA PMC12477160 PMC12477160.1 12477160 12477160 41030559 10.3389/fsurg.2025.1652685 1 Surgery Original Research Analysis of the feasibility and health-economics value of simultaneous bilateral pulmonary surgery Li Xiaoyun  1  2  † Huang Kaili  1  2  † Fan Mingyu  1  2 Tang Xiaojun  1  2 * 1 Department of Thoracic Surgery, West China Hospital, Sichuan University Chengdu, Sichuan China 2 Lung Cancer Center/Lung Cancer Institute, West China Hospital, Sichuan University Chengdu, Sichuan China Edited by: Michel Gonzalez Reviewed by: Benoît Bédat Konstantinos Gioutsos * Correspondence: tangxiaojun73@163.com  † These authors have contributed equally to this work 15 9 2025 2025 12 480749 1652685 24 6 2025 27 8 2025 15 09 2025 30 09 2025 01 10 2025 © 2025 Li, Huang, Fan and Tang. 2025 Li, Huang, Fan and Tang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) Background and objective The increased use of chest CT for clinical diagnosis and screening has improved the detection of early-stage lung cancer and the identification of bilateral lung lesions. Despite this, consensus on the feasibility of simultaneous vs. staged bilateral surgery for patients with bilateral lesions remains elusive, necessitating further investigation. This study assessed the safety, feasibility, and health-economics value of simultaneous bilateral pulmonary surgery by comparing perioperative clinical indicators and medical costs with those of unilateral surgery and simulated staged bilateral surgery. Methods A retrospective analysis was conducted using clinical data from 78 patients who underwent simultaneous bilateral pulmonary surgery at the Lung Cancer Center of West China Hospital of Sichuan University by the same medical team from January 2016 to October 2024. An equal number of patients who underwent unilateral surgery during the same period served as controls. Perioperative indicators were compared between these groups, and medical expenses were assessed against those of a second control group undergoing simulated staged surgery. Results All surgeries in both the simultaneous group and the control group were completed successfully, with patients discharged after recovery. The average surgical duration for the 78 patients in the simultaneous group was greater than that in the control group (195.8 ± 58.8 min vs. 136.83 ± 49.1 min; P P P P P P P F P Conclusion When indications are appropriately adhered to, simultaneous bilateral lung surgery for patients with bilateral pulmonary lesions is both safe and feasible; it reduces medical costs, increases diagnostic and treatment efficiency, conserves medical resources, and offers significant health-economics benefits. simultaneous bilateral pulmonary surgery multiple primary lung cancer feasibility health-economics value thoracic surgery The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Thoracic Surgery 1 Introduction With the continuous improvement in health awareness, the widespread use of computed tomography (CT) in lung cancer screening has improved the detection of early-stage lung cancer and the identification of bilateral pulmonary lesions. The malignancy rate in pulmonary nodules is approximately 10%–20% ( 1 2 5 6 7 2 Materials and methods 2.1 Clinical data We retrospectively collected clinical data from 78 consecutive patients who underwent synchronous bilateral lung surgery at the Lung Cancer Center of West China Hospital, Sichuan University, between January 2016 and October 2024. The CT images of two of these patients are shown in Figures 1 2 Table 1 Table 2 Tables 3 4 P Table 4 Figure 1 The arrows indicate masses in the right upper lobe and a nodule in the left upper lobe. Wedge resection of the left upper lobe and resection of the right upper lobe were performed by VATS. Postoperative pathology revealed multiple primary lung cancers in both the right and left upper lobes (A,B ) CT scans showing two axial chest images labeled A and B. Image A displays a dense mass in the left lung with an arrow pointing to it. Image B features a smaller white spot on the right lung near the edge, indicated by an arrow. Figure 2 The arrows indicate adenocarcinoma in the right upper lobe and a solitary nodule in the left upper lobe. Wedge resection of the left upper lobe was performed with VATS, and resection of the right upper lobe was conducted through thoracotomy. Postoperative pathology revealed multiple primary lung cancers in both the right and left upper lobes (A,B) CT scans of the thorax. Panel A shows a large mass on the left side marked by an arrow. Panel B displays a smaller nodule on the right side, also indicated by an arrow. Table 1 General data of 78 patients undergoing simultaneous bilateral lung surgery. Clinical characteristics Data Age (years) 31–73 (57.8 ± 8.2) Gender Male 44 (56.4%) Female 34 (43.6%) Main comorbid diseases Hypertension 12 (15.4%) Diabetes 9 (11.5%) Chronic obstructive pulmonary disease (COPD) 2 (2.6%) Surgical methods VATS lobectomy + contralateral VATS sublobar (wedge or segment) resection 33 (42.3%) Bilateral VATS sublobar (wedge or segment) resection 25 (32.1%) Conventional thoracotomy (5 cases converted from VATS) lobectomy + contralateral VATS sublobar resection 20 (25.6%) Table 2 Postoperative pathological types of 78patients. Pathological results Number of cases (%) Bilateral multiple primary lung cancers 52 (66.7%) Adenocarcinoma + Adenocarcinoma 45 (57.7%) Adenocarcinoma + Squamous cell carcinoma 4 (5.1%) Adenocarcinoma + Small cell lung cancer 1 (1.3%) Squamous cell carcinoma + Squamous cell carcinoma 2 (2.6%) Lung cancer + Contralateral inflammatory nodules 20 (25.6%) Adenocarcinoma + Inflammatory nodules 17 (21.8%) Squamous cell carcinoma + Inflammatory nodules 3 (3.8%) Bilateral benign nodules 6 (7.7%) Table 3 General data comparison of 78 patients between unilateral surgery group and simultaneous bilateral surgery group. Clinical characteristics Unilateral surgery group Simultaneous bilateral surgery group P Age (years) 43–70 (58.2 ± 7.7) 31–73 (57.8 ± 8.2) 0.820 Gender Male 42 (53.8%) 44 (56.4%) 0.848 Female 36 (46.2%) 34 (43.6%) Main comorbid diseases Hypertension 12 (15.4%) 12 (15.4%) 0.109 Diabetes 1 (1.3%) 9 (11.5%) COPD 2 (2.6%) 2 (2.6%) Surgical methods VATS lobectomy 33 (42.3%) 33 (42.3%) Thoracotomy lobectomy 20 (25.6%) 20 (25.6%) VATS sublobar resection (segment or wedge) 25 (32.1%) 25 (32.1%) Table 4 Patients undergoing unilateral surgery with a resection range equivalent to the secondary surgical side of simultaneous bilateral procedures. Clinical characteristics Data Gender Male 37 (47.4%) Female 41 (52.6%) Surgical methods VATS sublobar resection (segment or wedge) 78 (100.0%) Postoperative hospital stay (days) 2–4 (3.1 ± 0.7) Average hospitalization cost (yuan) 21,644–38,606 (32,474 ± 4,225) 2.2 Clinical treatment plan 2.2.1 Preoperative examination and criteria for simultaneous bilateral lung surgeries Preoperative examination: All patients routinely underwent comprehensive preoperative assessments, including enhanced chest CT, abdominal CT, head MRI (Magnetic Resonance Imaging), and whole-body bone isotope scans, to evaluate tumor extent and exclude distant metastases. Selected patients also underwent whole-body Positron Emission Tomography CT (PET-CT); for those with central lung cancer or solid nodules, fiberoptic bronchoscopy was performed to assess tumor invasion into the bronchus and determine the appropriate surgical approach. Additionally, pulmonary function tests, cardiac ultrasound, electrocardiograms, and routine hematological tests were performed to identify any significant abnormalities in critical organ functions, such as those of the heart, liver, lungs, and kidneys, and other surgical contraindications. The inclusion criteria for patients eligible for simultaneous bilateral lung surgeries were as follows: (1) imaging-detected bilateral pulmonary nodules suggestive of bilateral multiple primary lung cancers; (2) a space-occupying lesion in one lung, diagnosed or suspected as lung cancer based on imaging or pathological examination, accompanied by a solitary nodule in the contralateral lung considered to be a solitary metastasis; (3) candidates for sublobar resection that were assessed as primary lung cancers, adhering to NCCN guidelines: nodules ≤2 cm, with one of the following characteristics: pure adenocarcinoma in situ Patients were excluded from simultaneous bilateral lung surgeries if (1) bilateral lung lesions required lobectomy, as determined by imaging; (2) imaging showed extensive bilateral pulmonary nodules, with clinical assessment indicating lung cancer on one side with multiple metastases in the lungs; (3) poor general health, with compromised function of critical organs such as the heart, lungs, liver, and kidneys, rendered them unable to tolerate simultaneous bilateral surgeries; or (4) the patient was unwilling to undergo simultaneous bilateral surgeries, or their family members did not agree to the surgeries. 2.2.2 Surgical methods Determination of the primary and secondary surgical sides: Prior to surgery, the characteristics, size, location, solid component proportion, and pleural involvement of bilateral pulmonary lesions were evaluated via imaging, and a surgical plan was devised. The major and minor surgical sides were determined as follows: (1) In cases involving lobectomy on one side and sublobar resection on the other, the lobectomy side was designated the major surgical side; (2) In cases involving segmentectomy on one side and wedge resection on the other, the segmentectomy side was designated the primary surgical side; (3) In cases of bilateral wedge resections, the side with the larger resection range was considered the major surgical side. Surgical steps: Surgery was performed under general anesthesia with intravenous inhalation and double-lumen endotracheal intubation with the patients in the lateral position. (1) Surgery on the secondary surgical side was conducted first, entirely using VATS. (2) The position of the patient was then altered for surgery on the major side, which included procedures such as bronchial/pulmonary artery sleeve lobectomy, simple lobectomy, and sublobar resection. The choice between VATS and conventional thoracotomy was based on preoperative imaging characteristics. Conversion to thoracotomy was necessary when lymph node calcification and dense adhesion to surrounding structures made completion by thoracoscopy challenging or when a preoperative evaluation indicated that complex procedures such as bronchial/pulmonary artery sleeve resections were required, necessitating direct conventional thoracotomy. 2.3 Postoperative treatment Patients were routinely transferred to the ICU for monitoring and treatment after surgery and were moved to the general ward once their condition stabilized. Postoperatively, preventive measures against infection, expectorants, antispasmodics, lung function enhancement, and analgesia were routinely administered. For patients with significant phlegm production and difficulty expectorating spontaneously after surgery, fiberoptic bronchoscopy was employed for sputum aspiration. Other respiratory management and nursing practices followed those of conventional thoracic surgeries. If the thoracic drainage volume was less than 200 ml/days, there was no persistent air leakage, and a chest x-ray indicated satisfactory lung reexpansion, the thoracic drainage tube was removed. Patients were encouraged to cough and expectorate actively and to engage in suitable activities as soon as possible. 2.4 Statistical analysis Statistical analyses were performed using SPSS version 22.0 software. Continuous variables are presented as the mean values ± standard deviation or median and range. Categorical variables are presented as numbers and percentages. 3 Results The perioperative indicators of the bilateral group and control group are presented in Table 5 P P P P Table 6 F P P Table 5 Perioperative data comparison between the simultaneous bilateral surgery group and unilateral surgery group. Perioperative indicators Simultaneous bilateral group Unilateral surgery group (control group) P Operation time (min) 115–545 (196.36 ± 63.15) 40–240 (136.83 ± 49.10) <0.001 Intraoperative blood loss (ml) 50–500 (137.66 ± 92.34) 50–400 (93.62 ± 63.944) 0.009 Postoperative in-ICU stay (days) 1–3 (1.15 ± 0.42) 1–3 (1.09 ± 0.35) 0.423 Drainage tube indwelling time (days) 1–5 (2.47 ± 0.86) 1–10 (2.15 ± 0.88) 0.079 Postoperative antibiotic use time (days) 1–7 (2.83 ± 1.20) 1–6 (2.45 ± 0.99) 0.096 Postoperative hospital stay (days) 3–10 (5.40 ± 1.50) 3–11 (4.91 ± 1.47) 0.114 The incidence rate of postoperative major complications Pulmonary infection in 6 cases (7.7%) Pulmonary infection in 4 cases (5.1%) 0.562 Persistent air leakage in 4 cases (5.1%) Persistent air leakage in 2 cases (2.6%) Atrial fibrillation in 1 case (1.3%) Atrial fibrillation in 2 cases (2.6%) Table 6 Average hospitalization costs in the bilateral and control groups. Group Total hospitalization cost (yuan) F P Unilateral surgery group 33,525–78,614 (48,556 ± 10,371) F Concurrent bilateral surgery group 31,421–102,428 (68,920 ± 13,384) Simulated staged bilateral surgery group 57,687–107,529 (81,030 ± 10,515) P 4 Discussion Currently, the international consensus for treating early-stage MPLC ( 8 9 10 The results of this study indicate that simultaneous bilateral lung surgeries are safe and feasible for selected patients with good cardiopulmonary function (FEV1 ≥ 2.0 L, EF ≥ 50%) and overall health and without organ dysfunction, following preoperative assessments by experienced thoracic surgeons and radiologists. These assessments confirm that bilateral pulmonary nodules are likely to be bilateral multiple primary lung cancers or involve a space-occupying lesion on one side of the lung suspected or confirmed as lung cancer on the basis of imaging or pathology and that a solitary nodule in the contralateral lung is considered a solitary metastasis. Provided that oncological and surgical principles are not compromised, surgical options include simultaneous lobectomy on one side and sublobar resection (segmental or wedge) on the contralateral side or bilateral sublobar resections. The secondary surgical side is typically approached through thoracoscopy, while the major surgical side may also be managed via thoracoscopy, with thoracotomy reserved as an alternative if necessary. Currently, reports on simultaneous bilateral lobectomy are scarce ( 9 11 11 The total hospitalization cost for the 78 patients who underwent simultaneous bilateral surgery ranged from 31,421 to 102,428 yuan (68,920 ± 13,384 yuan). This figure encompassed all expenses incurred during the hospital stay, including laboratory tests, therapeutic drugs, surgical anesthesia, medical consumables, and nursing care. Compared with staged bilateral surgery, simultaneous bilateral surgery offers advantages such as medical resource conservation, increased diagnostic and treatment efficiency, and notable health-economics benefits. Additionally, it eliminates the discomfort and waiting associated with a second surgery. This is particularly critical for patients with cancer, for whom the waiting period could increase the risk of tumor progression and metastasis ( 9 5 Limitations We acknowledge multiple limitations of this study. First, the study was retrospective and included a relatively small number of patients. Second, the control group was methodologically imperfect. Theoretically, patients undergoing staged bilateral surgery should be selected as the control group to compare perioperative safety and cost-effectiveness, as this would strengthen the methodological rigor of our study design. Prior to initiating this research, we also attempted to collect data from patients who underwent staged bilateral surgery for use as a control group. However, we found that such patients were relatively scarce in our center's clinical practice, making statistical analysis challenging. Third, our study lacks oncologic and long-term functional outcomes (e.g., recurrence, survival, postoperative pulmonary function), which limits the ability to fully assess the safety and feasibility of the approach. 6 Conclusion When indications are appropriately adhered to, simultaneous bilateral lung surgery for patients with bilateral pulmonary lesions is both safe and feasible; it reduces medical costs, increases diagnostic and treatment efficiency, conserves medical resources, and offers significant health-economics benefits. Data availability statement The original contributions presented in the study are included in the article/Supplementary Material, further inquiries can be directed to the corresponding author. Ethics statement The studies involving humans were approved by Ethics Committee of West China Hospital of Sichuan University, Approval number: 2024-1015. The studies were conducted in accordance with the local legislation and institutional requirements. The ethics committee/institutional review board waived the requirement of written informed consent for participation from the participants or the participants' legal guardians/next of kin because Individual consent for this retrospective analysis was waived. Author contributions XL: Data curation, Writing – original draft, Formal analysis. KH: Formal analysis, Writing – original draft, Data curation. MF: Validation, Data curation, Writing – review & editing. XT: Conceptualization, Writing – review & editing, Formal analysis. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Mironova V Blasberg JD Evaluation of ground glass nodules Curr Opin Pulm Med 2018 24 4 350 4 10.1097/MCP.0000000000000492 29634577 2. Hwang Y Kang CH Kim HS Jeon JH Park IK Kim YT Comparison of thoracoscopic segmentectomy and thoracoscopic lobectomy on the patients with non-small cell lung cancer: a propensity score matching study Eur J Cardiothorac Surg 2015 48 2 273 8 10.1093/ejcts/ezu422 25406426 3. Zhong C Fang W Mao T Yao F Chen W Hu D Comparison of thoracoscopic segmentectomy and thoracoscopic lobectomy for small-sized stage IA lung cancer Ann Thorac Surg 2012 94 2 362 7 10.1016/j.athoracsur.2012.04.047 22727321 4. Moon MH Moon YK Moon SW Segmentectomy versus lobectomy in early non-small cell lung cancer of 2 cm or less in size: a population-based study Respirology 2018 23 7 695 703 10.1111/resp.13277 29465766 5. Amiraliev AM Pikin OV Ryabov AB Khalimon AI Bagrov VA Barmin VV Segmentectomy in patients with primary pulmonary malignancies Khirurgiia (Mosk) 2019 10 5 12 English, Russian 10.17116/hirurgia20191015 31626233 6. Xu G Fu X One-stage video-assisted thoracic surgery for bilateral multiple pulmonary nodules J Thorac Dis 2019 11 2 535 41 10.21037/jtd.2019.01.10 30962997 PMC6409284 7. Liang CC Liao CH Cheng YF Hung WH Chen HC Huang CL Bilateral lung nodules resection by image-guided video-assisted thoracoscopic surgery: a case series J Cardiothorac Surg 2020 15 1 203 10.1186/s13019-020-01253-5 32727602 PMC7392697 8. Tan L Yin J Diagnosis and treatment for multiple primary lung cancer Zhongguo Fei Ai Za Zhi 2018 21 3 185 9 Chinese 10.3779/j.issn.1009-3419.2018.03.12 29587937 PMC5973042 9. Huang C Sun Y Wu Q Ma C Jiao P Wang Y Simultaneous bilateral pulmonary resection via single-utility port VATS for multiple pulmonary nodules: a single-center experience of 16 cases Thorac Cancer 2021 12 4 525 33 10.1111/1759-7714.13791 33354921 PMC7882384 10. Qu R Hao Z Zhang Y Bie L Fu X Zhang N Single-center experience of simultaneous bilateral uni-portal video-assisted thoracoscopic surgery for multiple ground-glass opacities J Cardiothorac Surg 2020 15 1 69 10.1186/s13019-020-01107-0 32326944 PMC7178615 11. Yao F Yang H Zhao H Single-stage bilateral pulmonary resections by video-assisted thoracic surgery for multiple small nodules J Thorac Dis 2016 8 3 469 75 10.21037/jtd.2016.02.66 27076942 PMC4805819 ",
  "metadata": {
    "Title of this paper": "Single-stage bilateral pulmonary resections by video-assisted thoracic surgery for multiple small nodules",
    "Journal it was published in:": "Frontiers in Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477160/"
  }
}