{
  "title": "Paper_623",
  "abstract": "pmc J Ovarian Res J Ovarian Res 786 jovares Journal of Ovarian Research 1757-2215 BMC PMC12481845 PMC12481845.1 12481845 12481845 41024209 10.1186/s13048-025-01796-y 1796 1 Research Exploration of propionate metabolism-related genes to predict prognosis and immunotherapy response in ovarian cancer Ni JingJing Qiu JianPing Ma Yan mayanlock@163.com https://ror.org/02cdyrc89 grid.440227.7 0000 0004 1758 3572 Department of Obstetrics and Gynecology, The Affiliated Suzhou Hospital of Nanjing Medical University, Suzhou Municipal Hospital, 29 9 2025 2025 18 478377 209 23 4 2025 25 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Related studies have shown that propionate metabolism-related genes (PMRGs) were associated with the progress of cancers. However, the roles of PMRGs in ovarian cancer (OC) were unclear. Methods In this study, OC-related transcriptome data and clinical information were extracted from The Cancer Genome Atlas (TCGA),Genotype-Tissue Expression (GTEx) and Gene Expression Omnibus (GEO) databases. Firstly, the differentially expressed genes (DEGs) between OC and healthy control (HC) samples were screened by differential expression analysis. Then, the differentially expressed PMRGs (DE-PMRGs) were obtained by intersecting the DEGs with PMRGs. Next, the enrichment analyses of DEGs and DE-PMRGs were conducted to investigate the functions. Moreover, the biomarkers of OC were screened and the risk score was calculated. Then, the nomogram predicting the survival of OC was constructed. Furthermore, the tumor microenvironment analyses and drug sensitivity analysis were proceeded. In addition, the transcription factor (TF)-mRNA regulatory network was constructed to reveal the potential molecular-level regulation of biomarkers. Additionally, the expression levels of biomarkers in IOSE-80, OVCA429, hey and OVCAR-8 were detected through the Quantitative Real-time Polymerase Chain Reaction (qRT-PCR). Immunohistochemistry (IHC) was performed to validate the protein expression of key biomarkers (CETP, ALDH5A1, and PTH) in ovarian cancer tissue microarrays. Results Totals of 280 DE-PMRGs were obtained by intersecting the 9,466 DEGs and 531 PMRGs, and these genes were associated with steroid and fatty acid metabolic process. Five biomarkers (ALDH5A1, CETP, GRIA1, PTH, and TPMT) were identified, and the nomogram was constructed with risk score, age and TMB. Among them, GRIA1 was a negative factor, while age and risk score were negatively associated with patients’ survival. Noticeable, the tumor purity was low and the level of immune escape was high in OC groups. Besides, AKT.inhibitor.VIII A.443654 LFM.A13 BMS.509744 BMS.536924 p Conclusion This study identified 5 biomarkers associated with the prognosis of OC, which might be helpful in understanding the roles of PMRGs in the development of OC in depth. The IHC validation provided additional evidence at the protein level, reinforcing the clinical relevance of these findings. Supplementary Information The online version contains supplementary material available at 10.1186/s13048-025-01796-y. Keywords Propionate metabolism-related genes Ovarian cancer Prognosis Biomarkers Tumor micro-environment Regulation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Ovarian cancer (OC) is the third deadliest cancer among the gynecological Malignant tumors worldwide, accounting for over 320,000 new cases and around 200,000 deaths in 2022 [ 1 2 3 4 5 6 Methylmalonic acid (MMA), a by-product of propionate metabolism, has been identified as a mediator contributing to tumor progression. It has been observed that MMA can confer aggressive properties upon cancer cells and induce reprogramming through the activation of SOX4 [ 7 8 In this study, we utilized bioinformatics approaches to screen for differentially expressed PMRGs across four dataset sources: GeneCards, The Cancer Genome Atlas (TCGA), Genotype-Tissue Expression (GTEx) and Gene Expression Omnibus (GEO). We successfully identified five biomarkers and developed a novel prognostic model specific to OC. We also conducted independent prognosis analysis and characterized the tumor microenvironment (TME) immune cell infiltration. Additionally, we constructed a TF-mRNA regulatory network based on these biomarkers. To sum up, the findings of this study offered potential targets for clinical diagnosis and prognosis of OC, while also providing a theoretical foundation for better understanding the underlying mechanisms driving OC. Materials and methods Data extraction The RNA sequencing (RNA-seq) data, survival and clinical information of OC were downloaded from TCGA ( https://portal.gdc.cancer.gov https://xenabrowser.net/hub https://www.ncbi.nlm.nih.gov/geo/ GSE26712 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi GSE26712 GSE66957 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi GSE66957 https://www.genecards.org Function analysis of differentially expressed PMRGs (DE-PMRGs) in OC Firstly, the distribution of 372 OC and 88 HC samples were verified by principal component analysis (PCA), and the differentially expressed genes (DEGs) between them were compared by “DESeq2” R package (version 1.26.0) (|log 2 p 9 p 10 Construction of the prognostic model of OC In the training set, to identify differentially expressed genes related to propionate metabolism (DE-PMRGs), we first performed univariate Cox regression analysis on the 280 screened DEMNGs ( p 11 12 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\text{RiskScore}}_{\\text{sample}}={\\sum }_{\\text{i}=1}^{\\text{n}}{(\\text{Coef}}_{\\text{i}}*{\\text{x}}_{\\text{i}})$$\\end{document} RiskScore sample = ∑ i = 1 n ( Coef i ∗ x i ) The Kaplan–Meier (K-M) survival analysis was performed between these 2 groups, the risk curve and receiver operating characteristic (ROC) curve were plotted to assess the accuracy of survival risk model. Moreover, the internal validation dataset and external validation dataset ( GSE26712 13 Independent prognostic analysis and clinical correlation analysis The correlations between risk score and different clinical characteristics (age, stage, grade, lymphovascular invasion, OStatus, tumor mutational burden (TMB)) were compared by Wilcoxon test, and the K-M survival analysis was performed to stratified survival analysis. Then, the significant prognostic factors screened by univariate and multifactorial Cox analyses were used to construct the nomogram. Then, the calibration curve and the ROC curves were drawn to verify the validity of the nomogram. Characterization of the TME immune cell infiltration TME is an important part of tumor tissue [ 14 Drug sensitivity analysis The half-maximal inhibitory concentration (IC50) of common chemotherapy agents were calculated by “pRRophetic” R package (version 0.5) [ 15 Regulatory mechanism analysis of biomarkers In this study, the protein–protein interaction (PPI) network was constructed to investigate the relationship of biomarkers in online GeneMANIA database [ 16 https://genemania.org https://amp.pharm.mssm.edu/chea3/ 17 Expression verification of biomarkers Firstly, the expression of biomarkers were verified in both TCGA and GSE66957 1 Table 1 Polymerase chain reaction primer 引物 序列 CCL18 F CCTGGCAGATTCCACAAAAGTT CCL18 R TAGGAGGATGACACCTGGCTTG CCND1 F CAATGACCCCGCACGATTTC CCND1 R CATGGAGGGCGGATTGGAA MXRA5 F TATCAACACCCTCTTCCGACC MXRA5 R CATGAACTCTTCCATCCTGGC NRBP2 F GTGGACCACCCGAACATCG NRBP2 R CCTGATGACACGTACTCTGTGAT OLFML2B F GACAAGGTCAAGGCTATGTCTG OLFML2B R TGGTTTCCACGGTATAGAAGTCT THY1 F CTAACGGCCTGCCTAGTGGA THY1 R GGTTCGGGAGCGGTATGTGT 内参GAPDH-F ACAACTTTGGTATCGTGGAAGG 内参GAPDH-R GCCATCACGCCACAGTTTC Immunohistochemistry (IHC) validation To verify the protein expression levels of candidate biomarkers, we performed immunohistochemical analysis on ovarian cancer tissue microarrays. The product number of the organizational chip was IWLT-C-69O61. First, tissue samples were fixed in formalin and embedded in paraffin, followed by dewaxing with xylene and hydration with gradient ethanol. Subsequently, antigen retrieval was conducted using citrate buffer (pH 6.0) under high-pressure heating. Endogenous peroxidase was blocked with 3% H₂O₂, and non-specific binding sites were blocked with 5% bovine serum albumin (BSA) successively. The sections were incubated with primary antibodies (CETP antibody, ALDH5A1 antibody, and PTH antibody) at 4 °C overnight. Signal detection was performed using a universal two-step detection kit (PV-9000) and a DAB chromogenic system. After counterstaining cell nuclei with hematoxylin, imaging was carried out using a high-resolution digital slide scanner (SQS-12P), and protein expression was quantified using ImageJ-Pro-Plus software. Finally, statistical analysis was completed using GraphPad Prism (version 10.1.2) [ 18 Statistical analysis Differential expression analysis was performed using DESeq2 (version 1.26.0) [ 9 10 19 20 21 15 22 p Results Totals of 280 DE-PMRGs were associated with steroid and fatty acid metabolic process The distributions of 372 OC and 88 HC samples were different (Dim1 = 23.4%) (Fig. 1 1 1 Fig. 1 Identification of differentially expressed propionate metabolism-related genes (DE-PMRGs). A B C D P E P F G As the perspective of function, the DEGs were enriched to 1,139 GO functions, including positive regulation of cell adhesion, collagen-containing extracellular Matrix, signaling receptor activity, etc. And these DEGs were enriched to 32 KEGG pathways, including neuroactive ligand-receptor interaction, cytokine-cytokine receptor interaction and etc (Fig. 1 1 Construction and evaluation of the survival risk models of OC In this study, 5 biomarkers, including ALDH5A1, CETP, GRIA1, PTH and TPMT were identified, and all of them were positive factors (Hazard Ratio < 1), excpet for GRIA1 (Fig. 2 p 2 2 GSE27612 2 Fig. 2 Construction of a risk model. A B C D E F G H I J K Independent prognostic and clinical correlation analysis of survival risk model In this study, the risk scores were significantly different in different groups of lymphovascular invasion and OStatus ( p 3 3 3 3 3 Fig. 3 Clinical correlation analysis between high-risk and low-risk groups. A p p B C D E F G H Adipogenesis pathway was activated in high risk groups The function analysis results showed that a sum of 13 pathways, including apical junction, epithelial mesenchymal transition, adipogenesis and other pathways were significantly activated in high risk groups, totals of 12 pathways were significantly activated in low risk groups, such as interferon alpha response, hypoxia, spermatogenesis and so forth ( p 4 Fig. 4 Differential pathway activity between high and low-risk groups scored by gene set variation analysis TMB could be changed by OC The proportion of the 28 immune cells in two risk groups were shown in Fig. 5 + + + p 5 + + + p 5 + + + 5 Fig. 5 The relationship between immune cell abundance and cancer-related features. A B p p C p p D p p p E Moreover, the stromal score, immune score, and ESTIMATE score were higher in high risk group, age > 55 group and TMB high group (Fig. 6 p 6 AKT.inhibitor.VIII A.443654 LFM.A13 BMS.509744 BMS.536924 6 Fig. 6 The immune landscape associated with PMRGs in OC. A B C D E p p F G Molecular mechanism analysis The PPI network was shown in Fig. 7 7 p 7 7 Fig. 7 PMRGs regulatory mechanism network. A B C p D Expression verification of biomarkers The expression of GRIA1 was significantly lower, and the expressions of ALDH5A1, CETP, PTH, TPMT were extremely significantly higher in OC group of TCGA dataset ( p 8 GSE66957 8 8 Fig. 8 Expression verification of biomarkers and protein ( A p p p p B GSE66957 p p p p C-G p p Immunohistochemical validation of biomarkers in ovarian cancer tissues Immunohistochemical results showed that CETP was strongly positively expressed in the nuclei of ovarian cancer cells (Fig. 9 p 9 p 9 p 9 p 9 Fig. 9 Expression of biomarkers in ovarian cancer tissue sections. A B p C D p E F p G H p I J p Discussion OC is considered one of the most deadly form of gynecological cancers. Research studies have shown that OC exhibits both histological and genomic complexity [ 23 In our study, based on the RNA sequencing data, survival information and clinical data of OC from the TCGA, GTEx and GEO databases, we identified 280 differentially expressed genes related to propionate metabolism (DE-PMRGs), which were associated with fatty acid and steroid metabolic process. Propionate, the primary microbial fermentation metabolite in the human gut, is believed to reduce fat synthesis, serum cholesterol levels, and carcinogenic effects in other tissues [ 24 25 26 8 By employing LASSO, univariate Cox, and multivariate Cox regression analyses, we successfully identified five pivotal biomarkers (ALDH5A1, CETP, GRIA1, PTH, and TPMT) that displayed significant associations with OC. Subsequently, these genes were utilized to construct our prognostic models. Hence, these five genes selected for modeling have been shown to be closely associated with tumor development. Aldehyde dehydrogenase 5 family member A1 (ALDH5A1) belongs to the superfamily of aldehyde dehydrogenases (ALDHs), and encodes the succinic semialdehyde dehydrogenase, also known as SSDH, which participates in GABA degradation [ 27 28 29 30 31 32 34 35 37 38 40 41 42 44 Moreover, we observed significantly higher levels of macrophages, memory CD4 + + + 45 46 47 48 49 + + + + 50 52 50 In this study, we constructed a TF-mRNA regulatory network utilizing predicted TFs and OC biomarkers. In cancer, the activity of TFs is often dysregulated, resulting in aberrant gene expression associated with tumor initiation and progression. By analyzing survival curves in high- and low-risk groups of OC, we found a significant correlation between elevated MXI1 expression and poorer prognosis. Conversely, higher expression levels of the E2F1, YY1, MAZ, and IRF1 were associated with improved prognosis in OC. MXI1 showed a negative correlation with the TPMT gene, while E2F1, YY1, MAZ, and IRF1 exhibited a positive correlation with the TPMT gene. The activation of E2F by the loss of RB1 function is a well-established phenomenon. This activation subsequently enhances the expression of genes associated with cell proliferation, ultimately resulting in uncontrolled cell division. Notably, among the members of the E2F family, E2F1 appears to exert a more pronounced influence on malignant transformation compared to its counterparts [ 53 54 55 56 57 58 To the best of our knowledge, our study is the first to establish a connection between PMRGs and the prognosis of OC, providing novel insights into the molecular mechanisms for further investigation. However, we must acknowledge the limitations of our study. This study relied on bioinformatics analysis using public databases. However, the sample size was relatively small, and there might be biases in clinical information. Therefore, to further validate the research findings, larger-scale and diverse prospective cohort studies are needed, with validation across different regions and ethnicities. This approach will increase the sample size and diversity, providing stronger support and confirmation of our research results. In future studies we will further delve deeper into the mechanisms of prognostic genes in OC progression by conducting experimental studies using clinical tissue samples, which will serve as a continuation and expansion of this study. Supplementary Information  Supplementary Material 1. Supplementary Material 2. Supplementary Material 3. Abbreviations PMRGs Propionate metabolism-related genes OC Ovarian cancer TCGA The Cancer Genome Atlas GTEx Genotype-Tissue Expression GEO Gene Expression Omnibus TME Tumor microenvironment DEGs Differentially expressed genes HC Healthy control DE-PMRGs Differentially expressed PMRGs TF Transcription factor qRT-PCR Quantitative Real-time Polymerase Chain Reaction MMA Methylmalonic acid PCA Principal component analysis LASSO Least absolute shrinkage and selection operator ROC Receiver operating characteristic GSVA Gene set variation analysis TMB Tumor mutational burden TIDE Tumor immune dysfunction and exclusion IC50 The half-maximal inhibitory concentration PPI Protein–protein interaction Th17 T helper type 17 cells Th2 T helper type 2 cells ALDH5A1 Aldehyde dehydrogenase 5 family member A1 SSDH Succinic semialdehyde dehydrogenase CETP Cholesteryl ester transfer protein AMPA Alpha-amino-3-hydroxy-5-methyl-4-isoxazolepropionic acid GRIA1 The glutamate ionotropic receptor alpha-amino-3-hydroxy-5-methyl-4-isoxazolepropionic acid type subunit 1 TPMT Thiopurine S-methyltransferase CC Colon cancer PTH Parathyroid hormone PTHrP PTH-related protein TILs Tumor-infiltrating lymphocytes YY1 Yin Yang-1 MAZ Myc-associated zinc finger protein IRFs Interferon Regulatory Factors Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We sincerely thank the Department of Obstetrics and Gynecology of Suzhou Municipal Hospital for their strong support. We thank our families、friends and colleagues for their unwavering encouragement throughout this research endeavor. Authors' contributions YM: Conceptualization, Methodology, Investigation, Data curation, Formal analysis, Visualization, Writing–review & editing. JJN: Methodology, Investigation, Data curation, Formal analysis, Writing–original draft. JPQ: Supervision, Conceptualization, Writing–review & editing. All authors reviewed and agreed with the contents of the manuscript. Funding This research did not receive any specific grant from funding agencies in the public,commercial,or not-for-profit sectors. Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Filho AM Laversanne M Ferlay J Colombet M Piñeros M Znaor A The GLOBOCAN 2022 cancer estimates: data sources, methods, and a snapshot of the cancer burden worldwide Int J Cancer 2025 156 7 1336 1346 10.1002/ijc.35278 39688499 Filho AM, Laversanne M, Ferlay J, Colombet M, Piñeros M, Znaor A, et al. The GLOBOCAN 2022 cancer estimates: data sources, methods, and a snapshot of the cancer burden worldwide. Int J Cancer. 2025;156(7):1336–46. 39688499 10.1002/ijc.35278 2. Torre LA Trabert B DeSantis CE Miller KD Samimi G Runowicz CD Ovarian cancer statistics, 2018 CA Cancer J Clin 2018 68 4 284 296 29809280 10.3322/caac.21456 PMC6621554 Torre LA, Trabert B, DeSantis CE, Miller KD, Samimi G, Runowicz CD, et al. Ovarian cancer statistics, 2018. CA Cancer J Clin. 2018;68(4):284–96. 29809280 10.3322/caac.21456 PMC6621554 3. Clamp AR James EC McNeish IA Dean A Kim JW O'Donnell DM Weekly dose-dense chemotherapy in first-line epithelial ovarian, fallopian tube, or primary peritoneal carcinoma treatment (ICON8): primary progression free survival analysis results from a GCIG phase 3 randomised controlled trial Lancet 2019 394 10214 2084 2095 10.1016/S0140-6736(19)32259-7 31791688 PMC6902268 Clamp AR, James EC, McNeish IA, Dean A, Kim JW, O’Donnell DM, et al. Weekly dose-dense chemotherapy in first-line epithelial ovarian, fallopian tube, or primary peritoneal carcinoma treatment (ICON8): primary progression free survival analysis results from a GCIG phase 3 randomised controlled trial. Lancet. 2019;394(10214):2084–95. 31791688 10.1016/S0140-6736(19)32259-7 PMC6902268 4. Rižner TL Thalhammer T Özvegy-Laczka C The importance of steroid uptake and intracrine action in endometrial and ovarian cancers Front Pharmacol 2017 8 346 10.3389/fphar.2017.00346 28674494 PMC5474471 Rižner TL, Thalhammer T, Özvegy-Laczka C. The importance of steroid uptake and intracrine action in endometrial and ovarian cancers. Front Pharmacol. 2017;8:346. 28674494 10.3389/fphar.2017.00346 PMC5474471 5. Rehmani H Li Y Li T Padia R Calbay O Jin L Addiction to protein kinase Cɩ due to PRKCI Signal Transduct Target Ther 2020 5 1 140 10.1038/s41392-020-0197-8 32820156 PMC7441162 Rehmani H, Li Y, Li T, Padia R, Calbay O, Jin L, et al. Addiction to protein kinase Cɩ due to PRKCI 32820156 10.1038/s41392-020-0197-8 PMC7441162 6. Gao L Li X Nie X Guo Q Liu Q Qi Y Construction of novel mRNA-miRNA-lncRNA regulatory networks associated with prognosis of ovarian cancer J Cancer 2020 11 23 7057 7072 10.7150/jca.49557 33123295 PMC7592000 Gao L, Li X, Nie X, Guo Q, Liu Q, Qi Y, et al. Construction of novel mRNA-miRNA-lncRNA regulatory networks associated with prognosis of ovarian cancer. J Cancer. 2020;11(23):7057–72. 33123295 10.7150/jca.49557 PMC7592000 7. Gomes AP Ilter D Low V Endress JE Fernández-García J Rosenzweig A Age-induced accumulation of methylmalonic acid promotes tumour progression Nature 2020 585 7824 283 287 10.1038/s41586-020-2630-0 32814897 PMC7785256 Gomes AP, Ilter D, Low V, Endress JE, Fernández-García J, Rosenzweig A, et al. Age-induced accumulation of methylmalonic acid promotes tumour progression. Nature. 2020;585(7824):283–7. 32814897 10.1038/s41586-020-2630-0 PMC7785256 8. Gomes AP Ilter D Low V Drapela S Schild T Mullarky E Altered propionate metabolism contributes to tumour progression and aggressiveness Nat Metab 2022 4 4 435 443 10.1038/s42255-022-00553-5 35361954 PMC9050834 Gomes AP, Ilter D, Low V, Drapela S, Schild T, Mullarky E, et al. Altered propionate metabolism contributes to tumour progression and aggressiveness. Nat Metab. 2022;4(4):435–43. 35361954 10.1038/s42255-022-00553-5 PMC9050834 9. Wang Y Wang H Yu X Wu Q Lv X Zhou X Identification of metabolism related biomarkers in obesity based on adipose bioinformatics and machine learning J Transl Med 2024 22 1 986 10.1186/s12967-024-05615-8 39482740 PMC11526509 Wang Y, Wang H, Yu X, Wu Q, Lv X, Zhou X, et al. Identification of metabolism related biomarkers in obesity based on adipose bioinformatics and machine learning. J Transl Med. 2024;22(1):986. 39482740 10.1186/s12967-024-05615-8 PMC11526509 10. Wu T Hu E Xu S Chen M Guo P Dai Z Clusterprofiler 4.0: a universal enrichment tool for interpreting omics data Innov (Camb) 2021 2 3 100141 10.1016/j.xinn.2021.100141 PMC8454663 34557778 Wu T, Hu E, Xu S, Chen M, Guo P, Dai Z, et al. Clusterprofiler 4.0: a universal enrichment tool for interpreting omics data. Innov (Camb). 2021;2(3):100141. 10.1016/j.xinn.2021.100141 PMC8454663 34557778 11. Lee J Lee DK Survival analysis: part II - applied clinical data analysis Korean J Anesthesiol 2019 72 5 441 457 10.4097/kjae.2012.63.5.441 31096731 PMC6781220 Lee J, Lee DK. Survival analysis: part II - applied clinical data analysis. Korean J Anesthesiol. 2019;72(5):441–57. 31096731 10.4097/kja.19183 PMC6781220 12. Wissel D Janakarajan N Schulte J Rowson D Yuan X Boeva V Sparsesurv: a Python package for fitting sparse survival models via knowledge distillation Bioinformatics 2024 10.1093/bioinformatics/btae521 39177085 PMC11387617 Wissel D, Janakarajan N, Schulte J, Rowson D, Yuan X, Boeva V. Sparsesurv: a Python package for fitting sparse survival models via knowledge distillation. Bioinformatics. 2024. 10.1093/bioinformatics/btae521. 39177085 10.1093/bioinformatics/btae521 PMC11387617 13. Ma L Meng Y An Y Han P Zhang C Yue Y Single-cell RNA-seq reveals novel interaction between muscle satellite cells and fibro-adipogenic progenitors mediated with FGF7 signalling J Cachexia Sarcopenia Muscle 2024 15 4 1388 403 10.1002/jcsm.13484 38751367 PMC11294021 Ma L, Meng Y, An Y, Han P, Zhang C, Yue Y, et al. Single-cell RNA-seq reveals novel interaction between muscle satellite cells and fibro-adipogenic progenitors mediated with FGF7 signalling. J Cachexia Sarcopenia Muscle. 2024;15(4):1388–403. 38751367 10.1002/jcsm.13484 PMC11294021 14. Barriga V Kuol N Nurgali K Apostolopoulos V The complex interaction between the tumor micro-environment and immune checkpoints in breast cancer Cancers (Basel) 2019 10.3390/cancers11081205 31430935 PMC6721629 Barriga V, Kuol N, Nurgali K, Apostolopoulos V. The complex interaction between the tumor micro-environment and immune checkpoints in breast cancer. Cancers (Basel). 2019. 10.3390/cancers11081205. 31430935 10.3390/cancers11081205 PMC6721629 15. Lu X Jiang L Zhang L Zhu Y Hu W Wang J Immune signature-based subtypes of cervical squamous cell carcinoma tightly associated with human papillomavirus type 16 expression, molecular features, and clinical outcome Neoplasia 2019 21 6 591 601 10.1016/j.neo.2019.04.003 31055200 PMC6658934 Lu X, Jiang L, Zhang L, Zhu Y, Hu W, Wang J, et al. Immune signature-based subtypes of cervical squamous cell carcinoma tightly associated with human papillomavirus type 16 expression, molecular features, and clinical outcome. Neoplasia. 2019;21(6):591–601. 31055200 10.1016/j.neo.2019.04.003 PMC6658934 16. Mostafavi S, Ray D, Warde-Farley D, Grouios C, Morris Q. GeneMANIA: a real-time multiple association network integration algorithm for predicting gene function. Genome Biol. 2008;9(Suppl 1):S4. 10.1186/gb-2008-9-s1-s4 PMC2447538 18613948 17. Cheng M Li M Zhang Y Gu X Gao W Zhang S Exploring the mechanism of PPCPs on human metabolic diseases based on network toxicology and molecular docking Environ Int 2025 196 109324 10.1016/j.envint.2025.109324 39952201 Cheng M, Li M, Zhang Y, Gu X, Gao W, Zhang S, et al. Exploring the mechanism of PPCPs on human metabolic diseases based on network toxicology and molecular docking. Environ Int. 2025;196:109324. 39952201 10.1016/j.envint.2025.109324 18. Anguita R Ferro Desideri L Schwember P Shah N Ahmed S Raharja A Early versus delayed vitrectomy for vitreous hemorrhage secondary to proliferative diabetic retinopathy Am J Ophthalmol 2025 270 237 44 10.1016/j.ajo.2024.10.019 39471907 Anguita R, Ferro Desideri L, Schwember P, Shah N, Ahmed S, Raharja A, et al. Early versus delayed vitrectomy for vitreous hemorrhage secondary to proliferative diabetic retinopathy. Am J Ophthalmol. 2025;270:237–44. 39471907 10.1016/j.ajo.2024.10.019 19. Friedman J Hastie T Tibshirani R Regularization paths for generalized linear models via coordinate descent J Stat Softw 2010 33 1 1 22 10.18637/jss.v033.i01 20808728 PMC2929880 Friedman J, Hastie T, Tibshirani R. Regularization paths for generalized linear models via coordinate descent. J Stat Softw. 2010;33(1):1–22. 20808728 PMC2929880 20. Therneau TM, PM Grambsch. Modeling Survival Data: Extending the Cox Model. 2013. 21. Tao L Zhou Y Wu L Liu J Comprehensive analysis of sialylation-related genes and construct the prognostic model in sepsis Sci Rep 2024 14 1 18110 10.1038/s41598-024-69185-x 39103477 PMC11300640 Tao L, Zhou Y, Wu L, Liu J. Comprehensive analysis of sialylation-related genes and construct the prognostic model in sepsis. Sci Rep. 2024;14(1):18110. 39103477 10.1038/s41598-024-69185-x PMC11300640 22. Ahn JH Kim M Kim RW Effects of aromatherapy on nausea and vomiting in patients with cancer: a systematic review and meta-analysis of randomized controlled trials Complement Ther Clin Pract 2024 55 101838 10.1016/j.ctcp.2024.101838 38330531 Ahn JH, Kim M, Kim RW. Effects of aromatherapy on nausea and vomiting in patients with cancer: a systematic review and meta-analysis of randomized controlled trials. Complement Ther Clin Pract. 2024;55:101838. 38330531 10.1016/j.ctcp.2024.101838 23. Zhao Y He M Cui L Gao M Zhang M Yue F Chemotherapy exacerbates ovarian cancer cell migration and cancer stem cell-like characteristics through GLI1 Br J Cancer 2020 122 11 1638 1648 10.1038/s41416-020-0825-7 32242101 PMC7250874 Zhao Y, He M, Cui L, Gao M, Zhang M, Yue F, et al. Chemotherapy exacerbates ovarian cancer cell migration and cancer stem cell-like characteristics through GLI1. Br J Cancer. 2020;122(11):1638–48. 32242101 10.1038/s41416-020-0825-7 PMC7250874 24. Hosseini E Grootaert C Verstraete W Van de Wiele T Propionate as a health-promoting microbial metabolite in the human gut Nutr Rev 2011 69 5 245 58 10.1111/j.1753-4887.2011.00388.x 21521227 Hosseini E, Grootaert C, Verstraete W, Van de Wiele T. Propionate as a health-promoting microbial metabolite in the human gut. Nutr Rev. 2011;69(5):245–58. 21521227 10.1111/j.1753-4887.2011.00388.x 25. de Carvalho C, Caramujo MJ. The Various Roles of Fatty Acids. Molecules. 2018;23(10):2583. 10.3390/molecules23102583 PMC6222795 30304860 26. Schiffer L Barnard L Baranowski ES Gilligan LC Taylor AE Arlt W Human steroid biosynthesis, metabolism and excretion are differentially reflected by serum and urine steroid metabolomes: a comprehensive review J Steroid Biochem Mol Biol 2019 194 105439 10.1016/j.jsbmb.2019.105439 31362062 PMC6857441 Schiffer L, Barnard L, Baranowski ES, Gilligan LC, Taylor AE, Arlt W, et al. Human steroid biosynthesis, metabolism and excretion are differentially reflected by serum and urine steroid metabolomes: a comprehensive review. J Steroid Biochem Mol Biol. 2019;194:105439. 31362062 10.1016/j.jsbmb.2019.105439 PMC6857441 27. Ruan X Li P Chen Y Shi Y Pirooznia M Seifuddin F In vivo functional analysis of non-conserved human lncRNAs associated with cardiometabolic traits Nat Commun 2020 11 1 45 10.1038/s41467-019-13688-z 31896749 PMC6940387 Ruan X, Li P, Chen Y, Shi Y, Pirooznia M, Seifuddin F, et al. In vivo functional analysis of non-conserved human lncRNAs associated with cardiometabolic traits. Nat Commun. 2020;11(1):45. 31896749 10.1038/s41467-019-13688-z PMC6940387 28. Hilvo M de Santiago I Gopalacharyulu P Schmitt WD Budczies J Kuhberg M Accumulated metabolites of hydroxybutyric acid serve as diagnostic and prognostic biomarkers of ovarian high-grade serous carcinomas Cancer Res 2016 76 4 796 804 10.1158/0008-5472.CAN-15-2298 26685161 PMC4762194 Hilvo M, de Santiago I, Gopalacharyulu P, Schmitt WD, Budczies J, Kuhberg M, et al. Accumulated metabolites of hydroxybutyric acid serve as diagnostic and prognostic biomarkers of ovarian high-grade serous carcinomas. Cancer Res. 2016;76(4):796–804. 26685161 10.1158/0008-5472.CAN-15-2298 PMC4762194 29. Tian X Han Y Yu L Luo B Hu Z Li X Decreased expression of ALDH5A1 predicts prognosis in patients with ovarian cancer Cancer Biol Ther 2017 18 4 245 51 10.1080/15384047.2017.1295175 28346042 PMC5450734 Tian X, Han Y, Yu L, Luo B, Hu Z, Li X, et al. Decreased expression of ALDH5A1 predicts prognosis in patients with ovarian cancer. Cancer Biol Ther. 2017;18(4):245–51. 28346042 10.1080/15384047.2017.1295175 PMC5450734 30. Cupido AJ Reeskamp LF Hingorani AD Finan C Asselbergs FW Hovingh GK Joint genetic inhibition of PCSK9 and CETP and the association with coronary artery disease: a factorial Mendelian randomization study JAMA Cardiol 2022 7 9 955 964 10.1001/jamacardio.2022.2333 35921096 PMC9350849 Cupido AJ, Reeskamp LF, Hingorani AD, Finan C, Asselbergs FW, Hovingh GK, et al. Joint genetic inhibition of PCSK9 and CETP and the association with coronary artery disease: a factorial Mendelian randomization study. JAMA Cardiol. 2022;7(9):955–64. 35921096 10.1001/jamacardio.2022.2333 PMC9350849 31. Gao W Yao Y Gao Q Zhao T Li H Impact of serum lipids on prognosis in breast cancer patients: a systematic review and meta-analysis World J Surg Oncol 2025 23 1 234 10.1186/s12957-025-03875-2 40514653 PMC12166568 Gao W, Yao Y, Gao Q, Zhao T, Li H. Impact of serum lipids on prognosis in breast cancer patients: a systematic review and meta-analysis. World J Surg Oncol. 2025;23(1):234. 40514653 10.1186/s12957-025-03875-2 PMC12166568 32. Tilley SK Kim WY Fry RC Analysis of bladder cancer tumor CpG methylation and gene expression within the Cancer Genome Atlas identifies GRIA1 as a prognostic biomarker for basal-like bladder cancer Am J Cancer Res 2017 7 9 1850 1862 28979808 PMC5622220 Tilley SK, Kim WY, Fry RC. Analysis of bladder cancer tumor CpG methylation and gene expression within the Cancer Genome Atlas identifies GRIA1 as a prognostic biomarker for basal-like bladder cancer. Am J Cancer Res. 2017;7(9):1850–62. 28979808 PMC5622220 33. Yang G Zhang Y Yang J A five-microRNA signature as prognostic biomarker in colorectal cancer by bioinformatics analysis Front Oncol 2019 9 1207 10.3389/fonc.2019.01207 31799184 PMC6863365 Yang G, Zhang Y, Yang J. A five-microRNA signature as prognostic biomarker in colorectal cancer by bioinformatics analysis. Front Oncol. 2019;9:1207. 31799184 10.3389/fonc.2019.01207 PMC6863365 34. Song D Zhao L Zhao G Hao Q Wu J Ren H Identification and validation of eight lysosomes-related genes signatures and correlation with immune cell infiltration in lung adenocarcinoma Cancer Cell Int 2023 23 1 322 10.1186/s12935-023-03149-5 38093298 PMC10720244 Song D, Zhao L, Zhao G, Hao Q, Wu J, Ren H, et al. Identification and validation of eight lysosomes-related genes signatures and correlation with immune cell infiltration in lung adenocarcinoma. Cancer Cell Int. 2023;23(1):322. 38093298 10.1186/s12935-023-03149-5 PMC10720244 35. Tamm R Mägi R Tremmel R Winter S Mihailov E Smid A Polymorphic variation in TPMT is the principal determinant of TPMT phenotype: a meta-analysis of three genome-wide association studies Clin Pharmacol Ther 2017 101 5 684 95 10.1002/cpt.540 27770449 PMC5395320 Tamm R, Mägi R, Tremmel R, Winter S, Mihailov E, Smid A, et al. Polymorphic variation in TPMT is the principal determinant of TPMT phenotype: a meta-analysis of three genome-wide association studies. Clin Pharmacol Ther. 2017;101(5):684–95. 27770449 10.1002/cpt.540 PMC5395320 36. Wilke RA Lin DW Roden DM Watkins PB Flockhart D Zineh I Identifying genetic risk factors for serious adverse drug reactions: current progress and challenges Nat Rev Drug Discov 2007 6 11 904 916 10.1038/nrd2423 17971785 PMC2763923 Wilke RA, Lin DW, Roden DM, Watkins PB, Flockhart D, Zineh I, et al. Identifying genetic risk factors for serious adverse drug reactions: current progress and challenges. Nat Rev Drug Discov. 2007;6(11):904–16. 17971785 10.1038/nrd2423 PMC2763923 37. Lorenzoni PJ Kay CSK Zanlorenzi MF Ducci RD Werneck LC Scola RH Myasthenia gravis and azathioprine treatment: adverse events related to thiopurine S-methyl-transferase (TPMT) polymorphisms J Neurol Sci 2020 412 116734 10.1016/j.jns.2020.116734 32070863 Lorenzoni PJ, Kay CSK, Zanlorenzi MF, Ducci RD, Werneck LC, Scola RH. Myasthenia gravis and azathioprine treatment: adverse events related to thiopurine S-methyl-transferase (TPMT) polymorphisms. J Neurol Sci. 2020;412:116734. 32070863 10.1016/j.jns.2020.116734 38. Jia W He YF Qian XJ Chen J TPMT mRNA expression: a novel prognostic biomarker for patients with colon cancer by bioinformatics analysis Int J Gen Med 2022 15 151 160 10.2147/IJGM.S338575 35023953 PMC8747764 Jia W, He YF, Qian XJ, Chen J. TPMT mRNA expression: a novel prognostic biomarker for patients with colon cancer by bioinformatics analysis. Int J Gen Med. 2022;15:151–60. 35023953 10.2147/IJGM.S338575 PMC8747764 39. Kim I Choi YS Song JH Choi EA Park S Lee EJ A drug-repositioning screen for primary pancreatic ductal adenocarcinoma cells identifies 6-thioguanine as an effective therapeutic agent for TPMT-low cancer cells Mol Oncol 2018 12 9 1526 39 10.1002/1878-0261.12364 30055072 PMC6120251 Kim I, Choi YS, Song JH, Choi EA, Park S, Lee EJ, et al. A drug-repositioning screen for primary pancreatic ductal adenocarcinoma cells identifies 6-thioguanine as an effective therapeutic agent for TPMT-low cancer cells. Mol Oncol. 2018;12(9):1526–39. 30055072 10.1002/1878-0261.12364 PMC6120251 40. Zhang L Sun W Ren W Zhang J Xu G Predicting panel of metabolism and immune-related genes for the prognosis of human ovarian cancer Front Cell Dev Biol 2021 9 690542 10.3389/fcell.2021.690542 34322485 PMC8312230 Zhang L, Sun W, Ren W, Zhang J, Xu G. Predicting panel of metabolism and immune-related genes for the prognosis of human ovarian cancer. Front Cell Dev Biol. 2021;9:690542. 34322485 10.3389/fcell.2021.690542 PMC8312230 41. Coelho RM Lemos JM Alho I Valério D Ferreira AR Costa L Dynamic modeling of bone metastasis, microenvironment and therapy: integrating parathyroid hormone (PTH) effect, anti-resorptive and anti-cancer therapy J Theor Biol 2016 391 1 12 10.1016/j.jtbi.2015.11.024 26657065 Coelho RM, Lemos JM, Alho I, Valério D, Ferreira AR, Costa L, et al. Dynamic modeling of bone metastasis, microenvironment and therapy: integrating parathyroid hormone (PTH) effect, anti-resorptive and anti-cancer therapy. J Theor Biol. 2016;391:1–12. 26657065 10.1016/j.jtbi.2015.11.024 42. Kubal M Lech M Lajeunesse-Trempe F Drakou EE Grossman AB Dimitriadis GK Advances in the management of parathyroid carcinoma Mol Cell Endocrinol 2024 592 112329 10.1016/j.mce.2024.112329 38996836 Kubal M, Lech M, Lajeunesse-Trempe F, Drakou EE, Grossman AB, Dimitriadis GK. Advances in the management of parathyroid carcinoma. Mol Cell Endocrinol. 2024;592:112329. 38996836 10.1016/j.mce.2024.112329 43. Kane JF Johnson RW Re-evaluating the role of PTHrP in breast cancer Cancers (Basel) 2023 10.3390/cancers15102670 37345007 PMC10216606 Kane JF, Johnson RW. Re-evaluating the role of PTHrP in breast cancer. Cancers (Basel). 2023. 10.3390/cancers15102670. 37345007 10.3390/cancers15102670 PMC10216606 44. Abudourousuli A Chen S Hu Y Qian W Liao X Xu Y NKX2-8/PTHrP axis-mediated osteoclastogenesis and bone metastasis in breast cancer Front Oncol 2022 12 907000 10.3389/fonc.2022.907000 35707355 PMC9189290 Abudourousuli A, Chen S, Hu Y, Qian W, Liao X, Xu Y, et al. NKX2-8/PTHrP axis-mediated osteoclastogenesis and bone metastasis in breast cancer. Front Oncol. 2022;12:907000. 35707355 10.3389/fonc.2022.907000 PMC9189290 45. Wang C Cao M Jiang X Yao Y Liu Z Luo D Macrophage balance fraction determines the degree of immunosuppression and metastatic ability of breast cancer Int Immunopharmacol 2021 97 107682 10.1016/j.intimp.2021.107682 33895480 Wang C, Cao M, Jiang X, Yao Y, Liu Z, Luo D. Macrophage balance fraction determines the degree of immunosuppression and metastatic ability of breast cancer. Int Immunopharmacol. 2021;97:107682. 33895480 10.1016/j.intimp.2021.107682 46. An Y Yang Q Tumor-associated macrophage-targeted therapeutics in ovarian cancer Int J Cancer 2021 149 1 21 30 10.1002/ijc.33408 33231290 An Y, Yang Q. Tumor-associated macrophage-targeted therapeutics in ovarian cancer. Int J Cancer. 2021;149(1):21–30. 33231290 10.1002/ijc.33408 47. Asem M, Young AM, Oyama C, Claure De La Zerda A, Liu Y, Yang J, et al. Host Wnt5a Potentiates Microenvironmental Regulation of Ovarian Cancer Metastasis. Cancer Res. 2020;80(5):1156–70. 10.1158/0008-5472.CAN-19-1601 PMC8245162 31932454 48. Xu C Chen J Tan M Tan Q The role of macrophage polarization in ovarian cancer: from molecular mechanism to therapeutic potentials Front Immunol 2025 16 1543096 10.3389/fimmu.2025.1543096 40330466 PMC12052780 Xu C, Chen J, Tan M, Tan Q. The role of macrophage polarization in ovarian cancer: from molecular mechanism to therapeutic potentials. Front Immunol. 2025;16:1543096. 40330466 10.3389/fimmu.2025.1543096 PMC12052780 49. Sharma P Siddiqui BA Anandhan S Yadav SS Subudhi SK Gao J The next decade of immune checkpoint therapy Cancer Discov 2021 11 4 838 57 10.1158/2159-8290.CD-20-1680 33811120 Sharma P, Siddiqui BA, Anandhan S, Yadav SS, Subudhi SK, Gao J, et al. The next decade of immune checkpoint therapy. Cancer Discov. 2021;11(4):838–57. 33811120 10.1158/2159-8290.CD-20-1680 50. Yang B Li X Zhang W Fan J Zhou Y Li W Spatial heterogeneity of infiltrating T cells in high-grade serous ovarian cancer revealed by multi-omics analysis Cell Rep Med 2022 3 12 100856 10.1016/j.xcrm.2022.100856 36543113 PMC9798026 Yang B, Li X, Zhang W, Fan J, Zhou Y, Li W, et al. Spatial heterogeneity of infiltrating T cells in high-grade serous ovarian cancer revealed by multi-omics analysis. Cell Rep Med. 2022;3(12):100856. 36543113 10.1016/j.xcrm.2022.100856 PMC9798026 51. Hudry D Le Guellec S Meignan S Bécourt S Pasquesoone C El Hajj H Tumor-infiltrating lymphocytes (TILs) in epithelial ovarian cancer: heterogeneity, prognostic impact, and relationship with immune checkpoints Cancers (Basel) 2022 10.3390/cancers14215332 36358750 PMC9656626 Hudry D, Le Guellec S, Meignan S, Bécourt S, Pasquesoone C, El Hajj H, et al. Tumor-infiltrating lymphocytes (TILs) in epithelial ovarian cancer: heterogeneity, prognostic impact, and relationship with immune checkpoints. Cancers (Basel). 2022. 10.3390/cancers14215332. 36358750 10.3390/cancers14215332 PMC9656626 52. van der Leun AM Thommen DS Schumacher TN CD8(+) T cell states in human cancer: insights from single-cell analysis Nat Rev Cancer 2020 20 4 218 32 10.1038/s41568-019-0235-4 32024970 PMC7115982 van der Leun AM, Thommen DS, Schumacher TN. CD8(+) T cell states in human cancer: insights from single-cell analysis. Nat Rev Cancer. 2020;20(4):218–32. 32024970 10.1038/s41568-019-0235-4 PMC7115982 53. Chen M Zhao Z Wu L Huang J Yu P Qian J E2F1/CKS2/PTEN signaling axis regulates malignant phenotypes in pediatric retinoblastoma Cell Death Dis 2022 13 9 784 10.1038/s41419-022-05222-9 36096885 PMC9468144 Chen M, Zhao Z, Wu L, Huang J, Yu P, Qian J, et al. E2F1/CKS2/PTEN signaling axis regulates malignant phenotypes in pediatric retinoblastoma. Cell Death Dis. 2022;13(9):784. 36096885 10.1038/s41419-022-05222-9 PMC9468144 54. Wang X Fan W Li N Ma Y Yao M Wang G Yy1 lactylation in microglia promotes angiogenesis through transcription activation-mediated upregulation of FGF2 Genome Biol 2023 24 1 87 10.1186/s13059-023-02931-y 37085894 PMC10120156 Wang X, Fan W, Li N, Ma Y, Yao M, Wang G, et al. Yy1 lactylation in microglia promotes angiogenesis through transcription activation-mediated upregulation of FGF2. Genome Biol. 2023;24(1):87. 37085894 10.1186/s13059-023-02931-y PMC10120156 55. Yang H Zhang X Zhu L Yang Y Yin X YY1-induced lncRNA PART1 enhanced resistance of ovarian cancer cells to Cisplatin by regulating miR-512-3p/CHRAC1 axis DNA Cell Biol 2021 40 6 821 832 10.1089/dna.2021.0059 34030482 Yang H, Zhang X, Zhu L, Yang Y, Yin X. YY1-induced lncRNA PART1 enhanced resistance of ovarian cancer cells to Cisplatin by regulating miR-512-3p/CHRAC1 axis. DNA Cell Biol. 2021;40(6):821–32. 34030482 10.1089/dna.2021.0059 56. Wang M Yang X Meng Y Jin Z Cao J Xiong L Comprehensive analysis of the tumor-promoting effect and immune infiltration correlation MAZ from pan-cancer to hepatocellular carcinoma Int Immunopharmacol 2023 115 109660 10.1016/j.intimp.2022.109660 36623412 Wang M, Yang X, Meng Y, Jin Z, Cao J, Xiong L, et al. Comprehensive analysis of the tumor-promoting effect and immune infiltration correlation MAZ from pan-cancer to hepatocellular carcinoma. Int Immunopharmacol. 2023;115:109660. 36623412 10.1016/j.intimp.2022.109660 57. Gungabeesoon J, Gort-Freitas NA, Kiss M, Bolli E, Messemaker M, Siwicki M, et al. A neutrophil response linked to tumor control in immunotherapy. Cell. 2023;186(7):1448–64.e20. 10.1016/j.cell.2023.02.032 PMC10132778 37001504 58. Gao K Shi Q Gu Y Yang W He Y Lv Z SPOP IRF1-PD-L1 Cell Death Differ 2023 30 2 475 487 10.1038/s41418-022-01097-7 36481790 PMC9950446 Gao K, Shi Q, Gu Y, Yang W, He Y, Lv Z, et al. SPOP IRF1-PD-L1 36481790 10.1038/s41418-022-01097-7 PMC9950446 ",
  "metadata": {
    "Title of this paper": null,
    "Journal it was published in:": "Journal of Ovarian Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481845/"
  }
}