{
  "title": "Paper_1120",
  "abstract": "pmc Toxics Toxics 3287 toxics toxics Toxics 2305-6304 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474114 PMC12474114.1 12474114 12474114 41012398 10.3390/toxics13090777 toxics-13-00777 1 Review Review of Health Hazards in High-Entropy Alloy Processing Under Laboratory Conditions and Risk Assessment Using a Simple Risk Scoring Model https://orcid.org/0000-0002-9856-6488 Dewangan Sheetal Kumar Cao Suzhen Academic Editor Department of Materials Science and Engineering, Ajou University, Suwon 16499, Republic of Korea; sheetal@ajou.ac.kr 13 9 2025 9 2025 13 9 497672 777 31 7 2025 08 9 2025 11 9 2025 13 09 2025 28 09 2025 29 09 2025 © 2025 by the author. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Certain metal powders used in the synthesis and processing of high-entropy alloys (HEAs) pose significant health hazards, as many of these metals are toxic substances with no biological role in the human body. These metals can mimic essential elements or interfere with metabolic processes (the chemical reactions in living organisms that sustain life), leading to detrimental health effects. While some metals, such as aluminum, can be eliminated from the body through natural biological processes, others tend to accumulate, causing chronic illnesses over time. This review examines the toxicity mechanisms and health impacts of metals used in HEA synthesis, focusing on laboratory-scale processing. It also identifies potential health risks associated with occupational exposure in laboratory environments, including the inhalation of toxic metal powders and nanoparticles. A simple risk scoring model is introduced to systematically assess and quantify these risks based on factors such as toxicity levels, exposure limits, and carcinogenic potential (the ability of a substance to cause cancer) as given by the Occupational Safety and Health Administration (OSHA) and the National Institute for Occupational Safety and Health (NIOSH) standards. The proposed model can be applied to evaluate the relative hazards of commonly used HEA constituent powders (e.g., Ni, Co, Cr, and Al), offering practical guidance for safer laboratory handling and material selection. By integrating this risk assessment framework, this review aims to enhance workplace safety, guide the development of better material handling practices, and assist researchers in mitigating health risks associated with HEA processing. health hazard metal powder processing powder metallurgy high-entropy alloy risk scoring model Ministry of Education 2021R1A6A1A10044950 This research was supported by the Basic Science Research Program through the National Research Foundation of Korea (NRF) funded by the Ministry of Education (2021R1A6A1A10044950). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction In today’s technologically advanced world, most metals find widespread use as alloys. However, some metals are used in their pure elemental form for engineering purposes. An alloy is defined as a macroscopically homogeneous metallic composition comprising two or more elements mixed in a manner that makes them difficult to separate easily by mechanical means. This definition is accepted worldwide (UN GHS, 2015) [ 1 2 As a result, assessing the health-related and environmental hazards of an alloy based on its constituent elements may produce inaccurate results. Instead, alloys should be evaluated according to their inherent composite properties. Specifically, the following factors must be considered when classifying or analyzing hazardous alloys: (i) Alloys display distinctive properties and intrinsic hazard profiles different from those of their constituent elements. (ii) Identification of the hazards and determination of the toxicity of an alloy depend strongly on the alloy’s rate of transformation/dissolution (TD) into its bioaccessible form [ 3 4 As with metals and metal complexes, speciation is important for alloys. Components of released metals may exist in a range of valences, linked to different anions or cations. Variations in bioavailability (the proportion of a substance that enters circulation and is available for biological activity) might arise from released ions binding to adsorptive substances in the environment, such as mineral components in sediments or soils, or dissolved organic matter in water. As discussed in the following section, speciation and valence are significant factors in determining toxicity, as is the differentiation of released metal ions. Hence, considering the wide variety of alloys currently in existence, grouping alloys and utilizing read-across techniques within an alloy group are essential for effective hazard assessment, which is critical for ensuring human well-being and ecological preservation [ 5 6 7 8 In brief, alloys possess unique properties and pose hazards that differ from those of their constituent elements. Therefore, evaluating alloys based on their intrinsic composite characteristics and considering factors such as TD rates and speciation is essential for accurate hazard assessment and risk management [ 9 10 Certain metal powders used in manufacturing processes and other applications can pose significant health risks. Lead, for example, can be easily absorbed through the lungs and can act as a potent toxin within the body. Similarly, inhaling cadmium particles produced during metal spraying can lead to toxic effects. Furthermore, certain metals have been found to trigger allergic reactions. Cobalt, for instance, has been linked to acute asthma in hypersensitive individuals and has also been identified as the likely cause of slow, progressive lung fibrosis observed in lab personnel exposed to tungsten carbide [ 11 12 13 14 Aluminum powders, commonly used in fireworks, have been known to cause severe lung fibrosis that develops rapidly. Additionally, when deposited in the lungs, metals such as tin and iron generally do not cause immediate harm but can create distinct shadows when viewed through chest radiographs. Preventing these adverse health effects requires awareness of the potential hazards associated with metal powders and strict adherence to permissible threshold limit values (TLVs) for such powders in the atmosphere. In certain situations, medical supervision is advisable for ensuring the well-being of individuals exposed to such hazards [ 15 16 17 18 19 20 Metallic nickel has the potential to cause allergic rashes, such as the commonly observed “suspender rash” resulting from prolonged contact with suspenders on the thigh. Lab personnel handling nickel-plated objects or inhaling nickel fumes during milling processes can develop a high degree of sensitivity to such rashes. In Canada and Norway, an increased incidence of nose and lung disease has been observed among individuals involved in the production of nickel using electrolytic processes. Although no conclusive evidence has been established, there is suggestive evidence of carcinogenicity, as metallic nickel dust is classified by IARC as Group 2B (possibly carcinogenic to humans) [ 21 22 23 24 Pneumoconiosis is a condition wherein the lung reacts to dust by creating fibrous tissue, and it can be induced by graphite dust. Graphite materials with relatively high silica levels can exacerbate this condition. In addition to burning the nose and throat and turning the skin a greenish-black hue, copper dust, in high doses, has been known to induce metal fume fever. The usage of aluminum powder in pyrotechnics has been reported to be associated with the development of acute lung fibrosis among workers in one manufacturing plant and a delayed onset of fibrosis among workers in another plant. These observations appear to be specific to the aforementioned locations and may be related to certain manufacturing and coating processes that utilize aluminum powder [ 15 16 25 In the past, beryllium has been used in powder metallurgy in Germany. Even at very low concentrations, exposure to this metal and its salts can cause berylliosis, also known as beryllium illness, especially in vulnerable people. In severe cases of berylliosis, nodules are formed in the lungs and other organs, and noticeable weight loss occurs [ 26 27 28 29 30 31 32 33 34 35 36 Lead, a toxic metal, produces multiple toxic effects upon absorption into the body. It attaches to the surface of red blood cells and can accumulate in bones in a manner similar to calcium. It is excreted through the bowels and kidneys. Lead affects the synthesis of hemoglobin, leading to anemia and abnormalities in red blood cells. In industrial environments, inhalation is the primary route through which lead is absorbed into the body. While lead poisoning may cause abdominal pain and colic, these symptoms are relatively uncommon. Severe poisoning resulting in nerve damage and brain impairment is now rare but has been observed in the past among individuals exposed to lead spraying. Cadmium is another metal that can be absorbed into the body, transported through the bloodstream, stored in the liver, and ultimately excreted [ 5 37 Table 1 38 39 In general, alloys are composed of a base element, which is typically a metal or a metalloid, constituting the majority of the material, along with one or more added elements. These additions are made to achieve specific and improved mechanical, physical, or chemical properties compared with those of the individual components of the alloy. One of the earliest examples of alloy usage is the production of bronze by combining copper and tin, around 3000 BC. Steel, which is predominantly composed of iron and carbon, with varying amounts of other elements, is the most commonly used alloy. Almost all aluminum products are alloys of aluminum containing small amounts of other metals such as iron, silicon, magnesium, copper, zinc, and manganese, which are added depending on the desired properties for the intended use of the alloy [ 40 41 42 High-entropy alloys (HEAs) have gained significant attention due to their unique combination of properties that make them promising candidates for various industrial applications. Their exceptional mechanical strength, high thermal stability, corrosion resistance, and oxidation resistance enable their use in demanding environments. For instance, HEAs are being explored in aerospace and aviation industries for high-temperature structural components, in nuclear reactors for radiation-resistant materials, in the energy sector for advanced turbine and power generation systems, and in defense applications requiring lightweight yet durable alloys [ 43 44 Alloys are processed using various techniques, which involve modifying the structure and properties of the material. Alloys are often produced to achieve enhanced characteristics such as strength, durability, corrosion resistance, or electrical conductivity. The processing of alloys aims to optimize these properties according to the requirements of specific applications. Some common methods for processing alloys include melting, casting, and powder metallurgy [ 45 46 47 48 While such processing considerations are well established for conventional alloys, high-entropy alloys (HEAs) introduce additional complexity. The novelty of this review lies in systematically linking these well-established occupational hazards with the unique compositional complexity, processing routes, and emerging toxicological concerns specific to HEAs. Unlike conventional alloys, HEAs involve simultaneous handling of multiple hazardous elements (such as Ni, Co, Cr, and refractory metals), where synergistic or cumulative toxic effects may arise. 2. Background of HEAs The novel concept of high-entropy alloys (HEAs) emerged in 2004, marking a new approach in alloy design [ 48 49 49 50 51 Figure 1 Chemicals used in powder metallurgy labs can enter the body through four main ways: ingestion, inhalation, skin contact, and eye contact. Fine metallic powders and fumes can become airborne during a variety of processes, entering the respiratory system and possibly causing irritation or long-term lung conditions, which makes inhalation a serious concern. Handling powders and chemicals directly or through contaminated surfaces can result in skin contact, which can cause skin absorption and potentially cause irritation or allergic reactions. The detailed pathway for entering the body is given in Figure 2 Notably, metallurgy and materials science are interdisciplinary fields, where individuals from the constituent branches may not be aware of the hazards associated with the metals and materials used during the processing of alloys. To mitigate these hazards, it is important to implement appropriate safety measures, including adequate training for the personnel involved in alloy preparation, provisions such as local exhaust ventilation systems to control dust and fume exposure, and appropriate personal protective equipment (PPE) to protect against heat, chemicals, dust, or fumes. Moreover, proper storage, handling, and disposal procedures for hazardous materials and compliance with relevant safety regulations and standards are essential. It is also important to consult material safety data sheets (MSDS) or seek guidance from experts or safety professionals to ensure safe practices during alloy preparation [ 52 Figure 3 The objective of this review is to investigate the processing methods for HEAs within laboratory environments and assess potential health hazards associated with the fabrication, handling, and disposal of HEAs. This includes evaluating the exposure risks faced by laboratory personnel, understanding the toxicity mechanisms (the biological processes through which harmful effects of metals occur) and harmful effects of HEA materials, and proposing mitigation strategies to ensure occupational safety and self-protection. Classes of Elements Used in HEAs HEAs are known for their distinctive properties and versatile applications across industries. These alloys, composed of multiple principal elements in nearly equiatomic proportions, exhibit exceptional mechanical, thermal, and corrosion-resistant characteristics. However, the synthesis and processing of HEAs involve the use of hazardous materials, prompting concerns about their environmental impact and safety. This review identifies the hazardous materials associated with HEAs, explores their potential risks, and discusses ongoing efforts to address environmental and safety concerns while encouraging continued innovation in this promising field [ 44 Figure 4 (i). Reactive metals: 53 Figure 5 (ii). Toxic elements: 54 Figure 6 (iii). Rare-earth elements: 55 56 57 Figure 7 3. Hazardous Effects and Related Diseases Exposure to metal powders can cause respiratory irritation, skin damage, gastrointestinal problems, and long-term health concerns such as organ damage and cancer. The exposure can be in the form of inhalation, touch with the skin, and consumption of metal particles, specifically elements that act as a slow poison to the body, such as aluminum; these elements accumulate inside the body over time, causing major health problems. In addition, while certain heavy metals, such as zinc, copper, chromium, iron, and manganese, are necessary in small amounts for healthy bodily function, excessive concentrations can be hazardous. Some of the major health hazards associated with metal powders are discussed below and presented in Figure 8 44 58 59 60 Preventing these health risks necessitates stringent adherence to safety protocols, the use of PPE, adequate ventilation, and compliance with the permissible exposure limits for the relevant metals [ 61 9 Table 2 4. Risk Assessment Methodology 4.1. Simple Risk Scoring Model The Simple Risk Scoring Model, also known as the Hazard Ranking Approach, is a qualitative method used to assess potential health risks associated with exposure to hazardous substances. This method assigns numerical values to different risk factors, enabling a comparative ranking of materials based on their toxicity and health hazards. It is widely used in cases where detailed exposure data is unavailable, but a relative assessment of risks is necessary [ 62 63 4.2. Methodology The risk assessment in this review is based on two key parameters: toxicity score (TS) and carcinogenicity factor (CF). TS reflects the toxic effects of a metal, considering bio accessibility, organ toxicity, and systemic impacts, based on available toxicological data. A higher TS indicates greater potential harm to laboratory workers exposed to the metal. The risk scoring model in this review evaluates the potential health hazards of metal powders based on two key parameters: TS and CF. TS is assigned by considering the metal’s bioaccessibility, organ-specific toxicity, and systemic impacts, using available toxicological data. Metals with higher toxic effects receive higher TS values on a scale of 1 (low) to 5 (high). CF is determined according to the International Agency for Research on Cancer (IARC) classification, where Group 1 (carcinogenic to humans) = 5, Group 2A (probably carcinogenic) = 4, Group 2B (possibly carcinogenic) = 3, and Not classified = 1. The Risk Score (RS) is calculated as the product of TS and CF (RS = TS × CF), providing a quantitative measure of the overall hazard of each metal. The risk assessment in this review is in Table 3 The Risk Score (RS) is calculated using the Formula: R S = T S × C F 65 66 Table 4 Table 4 38 39 4.3. Discussion on Risk Assessment of Metallic Elements The risk assessment results, when visualized in a bar graph (shown in Figure 9 Figure 9 Figure 9 Elevated to moderate-risk metals such as Cobalt (Co) and Vanadium (V) (RS of 16 and 4, respectively) still pose significant health concerns, with Cobalt metal classified as a probable human carcinogen (Group 2A). Prolonged exposure can lead to respiratory and cardiovascular complications, necessitating careful handling and regulatory oversight. In contrast, low-risk elements (RS ≤ 3), including Manganese (Mn), Iron (Fe), Copper (Cu), Aluminum (Al), and Titanium (Ti), exhibit minimal toxicity concerns but may still pose health hazards at high exposure levels. A graphical representation of RS values clearly differentiates between high, moderate, and low-risk metals, reinforcing the need for tailored safety measures based on toxicity severity. These findings underscore the necessity of regulatory intervention, workplace safety policies, and further research on long-term exposure effects, particularly for metal powders and nanoparticles. By integrating risk assessment into occupational health protocols, industries can mitigate hazards, ensuring safer handling of materials in powder metallurgy, biomedical applications, and nanomanufacturing. The presented methodology provides a structured approach to toxicity evaluation, aiding in risk communication and regulatory decision-making. 5. Essential Precautions and Prevention Measures Working with metal powders involves several safety and health risks due to the fine particle size of the powders, the potential for dust generation, and the specific properties of the metals involved. To ensure safety, lab personnel must take appropriate precautions when handling, processing, or working with metal powders. First and foremost, engineering controls such as local exhaust ventilation (LEV) systems, fume hoods, and enclosed workspaces should be used to minimize airborne dust exposure. The use of glove boxes or sealed containers can further prevent the dispersion of fine particles. Proper personal protective equipment (PPE), including respirators (N95 or higher-rated masks), gloves, lab coats, and safety goggles, must be worn at all times to prevent inhalation, skin contact, or accidental ingestion. Powder handling should be conducted in a designated area with controlled access, and tools such as anti-static brushes or scoops should be used to minimize particle disturbance. Additionally, using wet methods or HEPA-filtered vacuum cleaners instead of compressed air for cleaning prevents powder dispersion and reduces inhalation risks. In addition to physical safety measures, strict procedural controls must be followed. Scholars should undergo proper training on safe handling, emergency response, and waste disposal methods. Material safety data sheets (MSDS) should be reviewed before working with any new metal powder to understand its hazards, reactivity, and recommended safety precautions. Regular air quality monitoring should be performed to assess exposure levels, and any spills should be contained and cleaned up using appropriate methods. Fire hazards must also be considered, particularly for reactive or combustible powders like aluminum, magnesium, or titanium, which require proper storage in airtight containers and handling away from ignition sources. By adhering to these precautions, lab personnel can work safely with metal powders while minimizing health and environmental risks. Some key safety measures and risk-prevention strategies are discussed in the following section. 5.1. Prevention Measures To ensure the safety and well-being of individuals working with hard metals, cobalt levels in the atmosphere must be maintained below the TLV of 0.3 mg/m 3 3 57 For other metals, the TLVs are as follows: nickel, 1 mg/m 3 3 3 67 To mitigate danger, strict control and safety precautions are necessary in laboratories where metal powders are handled. To reduce exposure to airborne particles, measures such as fume hoods or local exhaust ventilation systems must be implemented. The workers should also wear the appropriate PPE ( Table 5 Table 6 Appropriate fire-extinguishing equipment and fire-suppression systems must be provided, especially for highly reactive metals. In addition, PM laboratories often involve high-energy processes such as ball milling, compaction, and sintering, which generate significant noise and vibration. Noise and vibration are significant occupational hazards in laboratories handling metallic powders. Noise exposure can lead to loss of hearing power and induce stress. Studies also indicate that combined exposure to noise and vibration increases fatigue and accelerates hearing damage, emphasizing the need for proper engineering controls, protective equipment, and regular health monitoring [ 69 70 2 Table 7 5.2. Health Monitoring Regular health monitoring and medical surveillance must be conducted for lab personnel handling hazardous metal powders. Access to medical facilities should be provided for immediate treatment in case of exposure or accidents [ 74 75 (i). MSDS: (ii). Regulatory compliance: Lab personnel must always consult with the organization’s safety officer, the safety guidelines, and the relevant regulations to ensure they follow the most up-to-date and appropriate safety practices when working with metal powders. Additionally, they must seek guidance from experts or safety professionals if they are unsure about specific precautions for a particular metal or process. Safety should be the top priority when working with potentially hazardous materials, such as metal powders. In addition, toxins can enter the digestive tract through ingestion if a lab researcher eats, drinks, smokes, or handles contaminated food or food that has been stored in contaminated conditions. Splashes, spills, and airborne particles can cause eye contact and cause irritation or more serious damage to the eyes. It is essential to comprehend these points of entry to put in place practical safeguards to protect the health of lab researchers, as given in Figure 3 Figure 10 Table 8 6. Knowledge Gaps and Future Perspectives The present review underscores the importance of certain specific avenues for future research on the hazardous effects of working with metal powders, particularly for newly employed lab personnel. Numerous studies have investigated lab environments and industrial areas where powders are produced and handled, and the findings highlight noticeable hazards and health risks. This implies the need for comprehensive studies on the working environments in laboratories and metallurgical processes. Ensuring a correlation between the actual safety of a working environment and the health hazards detected in that environment is essential for validating the safe practices identified through critical analysis. Given the wide array of safe work environments available, it becomes necessary for new lab personnel to understand the appropriate way of working in a lab environment and handling different chemical and metal powders to cultivate confidence and produce better research results. A schematic presentation of lab safety equipment and disease is shown in Figure 11 7. Conclusions In conclusion, metals such as nickel, copper, tungsten, chromium, and cobalt pose significant health risks due to their high bioaccessibility in the human gastric and intestinal phases, making careful handling essential in laboratory experiments. A systematic approach to investigating these hazards is crucial for ensuring safe research practices, with continuous health monitoring of lab personnel being necessary to prevent illnesses. Despite the importance of safety, there is a lack of studies examining the correlation between safety protocols and health risks, highlighting the need for standard procedures when handling metal powders. This review underscores the health risks of HEA processing and introduces a simple risk-scoring model to assess hazards based on toxicity, exposure limits, and carcinogenicity. The model serves as a valuable tool for identifying and mitigating high-risk exposures, thereby improving safety practices. Future research should refine the model by integrating experimental toxicity data and real-world exposure scenarios to enhance its applicability in laboratory environments. Although this review emphasizes exposure risks within powder metallurgy research laboratories, it is important to note that similar hazards may also extend to industrial and manufacturing environments where HEA powders are synthesized, processed, or machined, thereby posing potential risks to both laboratory personnel and factory workers. Future research should focus on improving existing risk assessment models by integrating quantitative exposure data, advanced toxicological indicators, and predictive tools such as machine learning. Real-time monitoring of airborne particles and biological markers could provide dynamic risk evaluations, while long-term epidemiological studies would help validate model predictions. Additionally, developing standardized databases for toxicity and carcinogenicity will further strengthen the reproducibility and applicability of risk assessment frameworks in laboratory settings. Acknowledgments During the preparation of some of the artwork, the author used an alternative open-source text-to-image tool (Craiyon, created by Boris Dayma, craiyon.com. Accessed 1 March 2025) to generate an interactive image for presentation purposes only. After using this tool, the author reviewed and edited the content as needed and took full responsibility for the generated images of the publication. Disclaimer/Publisher’s Note: Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The author declares no conflicts of interest. References 1. About the GHS|UNECE Available online: https://unece.org/about-ghs (accessed on 19 March 2024) 2. Mridha S. Metallic Materials Reference Module in Materials Science and Materials Engineering Elsevier Amsterdam, The Netherlands 2016 3. International Atomic Energy Agency Guidelines for Integrated Risk Assessment and Management in Large Industrial Areas International Atomic Energy Agency Vienna, Austria 1998 1 274 4. Nordheim E. Newson T. Risk Assessment of Alloys Risk Management of Complex Inorganic Materials: A Practical Guide Academic Press Cambridge, MA, USA 2018 219 243 5. Balali-Mood M. Naseri K. Tahergorabi Z. Khazdair M.R. Sadeghi M. Toxic Mechanisms of Five Heavy Metals: Mercury, Lead, Chromium, Cadmium, and Arsenic Front. Pharmacol. 2021 12 643972 10.3389/fphar.2021.643972 33927623 PMC8078867 6. Raji Z. Karim A. Karam A. Khalloufi S. Adsorption of Heavy Metals: Mechanisms, Kinetics, and Applications of Various Adsorbents in Wastewater Remediation—A Review Waste 2023 1 775 805 10.3390/waste1030046 7. Türkmen D. Bakhshpour M. Akgönüllü S. Aşır S. Denizli A. Heavy Metal Ions Removal From Wastewater Using Cryogels: A Review Front. Sustain. 2022 3 765592 10.3389/frsus.2022.765592 8. Qasem N.A.A. Mohammed R.H. Lawal D.U. Removal of heavy metal ions from wastewater: A comprehensive and critical review npj Clean Water 2021 4 36 10.1038/s41545-021-00127-0 9. Kipling M.D. Health Hazards and Powder Metallurgy Powder Metall. 1976 19 8 11 10.1179/pom.1976.19.1.8 957627 10. Singer A.R.E. New areas for development in metal powder and particle technology Powder Metall. 1976 19 4 7 10.1179/pom.1976.19.1.4 11. Sprince N.L. Oliver L.C. Eisen E.A. Greene R.E. Chamberlin R.I. Cobalt exposure and lung disease in tungsten carbide production. A cross-sectional study of current workers Am. Rev. Respir. Dis. 1988 138 1220 1226 10.1164/ajrccm/138.5.1220 3264482 12. Swennen B. Buchet J.P. Stanescu D. Lison D. Lauwerys R. Epidemiological survey of workers exposed to cobalt oxides, cobalt salts, and cobalt metal Occup. Environ. Med. 1993 50 835 842 10.1136/oem.50.9.835 8398878 PMC1061317 13. Auchincloss J.H. Abraham J.L. Gilbert R. Lax M. Henneberger P.K. Heitzman E.R. Peppi D.J. Health hazard of poorly regulated exposure during manufacture of cemented tungsten carbides and cobalt Occup. Environ. Med. 1992 49 832 836 10.1136/oem.49.12.832 PMC1061212 1472440 14. Kennedy S.M. Chan-Yeung M. Marion S. Lea J. Teschke K. Maintenance of stellite and tungsten carbide saw tips: Respiratory health and exposure-response evaluations Occup. Environ. Med. 1995 52 185 191 10.1136/oem.52.3.185 7735392 PMC1128185 15. Willhite C.C. Karyakina N.A. Yokel R.A. Yenugadhati N. Wisniewski T.M. Arnold I.M.F. Momoli F. Krewski D. Systematic review of potential health risks posed by pharmaceutical, occupational and consumer exposures to metallic and nanoscale aluminum, aluminum oxides, aluminum hydroxide and its soluble salts Crit. Rev. Toxicol. 2014 44 1 80 10.3109/10408444.2014.934439 PMC4997813 25233067 16. Bhasin P. Singla N. Dhawan D.K. Protective role of zinc during aluminum-induced hepatotoxicity Environ. Toxicol. 2014 29 320 327 10.1002/tox.21760 22422511 17. Nriagu J.O. A global assessment of natural sources of atmospheric trace metals Nature 1989 338 47 49 10.1038/338047a0 18. Lantzy R.J. Mackenzie F.T. Atmospheric trace metals: Global cycles and assessment of man’s impact Geochim. Cosmochim. Acta 1979 43 511 523 10.1016/0016-7037(79)90162-5 19. Nriagu J.O. Pacyna J.M. Quantitative assessment of worldwide contamination of air, water and soils by trace metals Nature 1988 333 134 139 10.1038/333134a0 3285219 20. Fergusson J.E. The Heavy Elements: Chemistry, Environmental Impact and Health Effects Pergamon Press Oxford, UK 1990 21. Genchi G. Carocci A. Lauria G. Sinicropi M.S. Catalano A. Nickel: Human Health and Environmental Toxicology Int. J. Environ. Res. Public Health 2020 17 679 10.3390/ijerph17030679 31973020 PMC7037090 22. Karlsson H.L. Vallabani N.V.S. Wang X. Assenhöj M. Ljunggren S. Karlsson H. Odnevall I. Health hazards of particles in additive manufacturing: A cross-disciplinary study on reactivity, toxicity and occupational exposure to two nickel-based alloys Sci. Rep. 2023 13 20846 10.1038/s41598-023-47884-1 38012238 PMC10682021 23. Wang X. Wallinder I.O. Hedberg Y. Bioaccessibility of Nickel and Cobalt Released from Occupationally Relevant Alloy and Metal Powders at Simulated Human Exposure Scenarios Ann. Work. Expo. Health 2020 64 659 10.1093/annweh/wxaa042 32320011 PMC7328476 24. Occupational Exposure to Hexavalent Chromium|Occupational Safety and Health Administration Available online: https://www.osha.gov/laws-regs/federalregister/2006-02-28-0 (accessed on 19 March 2024) 25. Krewski D. Yokel R.A. Nieboer E. Borchelt D. Cohen J. Harry J. Kacew S. Lindsay J. Mahfouz A.M. Rondeau V. Human health risk assessment for aluminium, aluminium oxide, and aluminium hydroxide J. Toxicol. Environ. Health Part B 2007 10 1 269 10.1080/10937400701597766 PMC2782734 18085482 26. Rosenstock L. Cullen M. Brodkin C. Redlich C. Textbook of Clinical Occupational and Environmental Medicine 2nd ed. U.S. Department of Energy Washington, DC, USA 2004 27. Cummings K.J. Stefaniak A.B. Virji M.A. Kreiss K. A Reconsideration of Acute Beryllium Disease Environ. Health Perspect. 2009 117 1250 10.1289/ehp.0800455 19672405 PMC2721869 28. Clinical Findings Among Hard Metal Workers on JSTOR Available online: https://www.jstor.org/stable/27727367 (accessed on 19 March 2024) 29. Respiratory Diseases in Hard Metal Workers: An Occupational Hygiene Study in a Factory on JSTOR Available online: https://www.jstor.org/stable/27726227 (accessed on 19 March 2024) 10.1136/oem.43.7.474 PMC1007687 3718895 30. Issue Paper on the Human Health Effects of Metals|Request pdf Available online: https://www.researchgate.net/publication/255671769_issue_paper_on_the_human_health_effects_of_metals (accessed on 19 March 2024) 31. World Economic Forum Preface-Global Risks Report 2024 Available online: https://www.weforum.org/publications/global-risks-report-2024/in-full (accessed on 19 March 2024) 32. Sakai M. Kato G. Fujioka T. Sugihara M. Koyanagi K. Kato O. Tominaga M. Kawabata Y. A case of hard metal lung disease in a man who worked as an iron grinder Nihon Kokyuki Gakkai Zasshi 2010 48 282 287 20432968 33. Chiba Y. Kido T. Tahara M. Oda K. Noguchi S. Kawanami T. Yokoyama M. Yatera K. Hard metal lung disease with favorable response to corticosteroid treatment: A case report and literature review Tohoku J. Exp. Med. 2019 247 51 58 10.1620/tjem.247.51 30674737 34. Moriyama H. Kobayashi M. Takada T. Shimizu T. Terada M. Narita J.I. Maruyama M. Watanabe K. Suzuki E. Gejyo F. Two-dimensional analysis of elements and mononuclear cells in hard metal lung disease Am. J. Respir. Crit. Care Med. 2007 176 70 77 10.1164/rccm.200601-134OC 17363774 35. Sakamoto O. Kosai S. Kohrogi H. A case of hard metal lung disease presenting a type of chronic hypersensitivity pneumonitis Nihon Kokyuki Gakkai Zasshi 2008 46 535 541 18700571 36. Nemery B. Abraham J.L. Hard metal lung disease: Still hard to understand Am. J. Respir. Crit. Care Med. 2007 176 2 3 10.1164/rccm.200704-527ED 17586761 37. Wani A.L. Ara A. Usmani J.A. Lead toxicity: A review Interdiscip. Toxicol. 2015 8 55 64 10.1515/intox-2015-0009 27486361 PMC4961898 38. OSHA.gov Occupational Chemical Database Available online: https://www.osha.gov/chemicaldatabase (accessed on 10 September 2025) 39. NIOSH Pocket Guide to Chemical Hazards Introduction|NIOSH|CDC Available online: https://www.cdc.gov/niosh/npg/pgintrod.html?utm_source=chatgpt.com (accessed on 10 February 2025) 40. Raabe D. The Materials Science behind Sustainable Metals and Alloys Chem. Rev. 2023 123 2436 2608 10.1021/acs.chemrev.2c00799 36848879 PMC9999434 41. Yang F. Fu Q. Antonietti M. Anthropogenic, Carbon-Reinforced Soil as a Living Engineered Material Chem. Rev. 2023 123 2420 2435 10.1021/acs.chemrev.2c00399 36633446 PMC9999422 42. Mamtani R. Stern P. Dawood I. Cheema S. Metals and Disease: A Global Primary Health Care Perspective J. Toxicol. 2011 2011 11 10.1155/2011/319136 PMC3189586 22007209 43. Li R. Song X. Duan Z. Hao Z. Yang Y. Han Y. Ran X. Liu Y. Improving the high-temperature ductility of γ-TiAl matrix composites by incorporation of AlCoCrFeNi high entropy alloy particles J. Alloys Compd. 2025 1012 178515 10.1016/j.jallcom.2025.178515 44. Modupeola D. Popoola P. Safety practices and occupational hazards of the additive manufacturing of high entropy alloys Saf. Extrem. Environ. 2024 6 139 146 10.1007/s42797-023-00097-1 45. Dewangan S.K. Nagarjuna C. Lee H. Sharma A. Ahn B. Surface morphology transformation and densification behaviour of conventionally sintered AlFeCoNiSi high entropy alloys Powder Metall. 2023 66 650 661 10.1080/00325899.2023.2223019 46. Rao K.R. Dewangan S.K. Seikh A.H. Sinha S.K. Ahn B. Microstructure and Mechanical Characteristics of AlCoCrFeNi-Based ODS High-Entropy Alloys Consolidated by Vacuum Hot Pressing Met. Mater. Int. 2023 30 726 734 10.1007/s12540-023-01530-7 47. Kumar A. Kumar Dewangan S. Singh S. Chopkar M. Sreesha R.B. Chapter 2 Classification of processing routes High-Entropy Alloys Walter de Gruyter GmbH & Co KG Berlin, Germany 2023 31 40 48. Dewangan S.K. Mangish A. Kumar S. Sharma A. Ahn B. Kumar V. A review on High-Temperature Applicability: A milestone for high entropy alloys Eng. Sci. Technol. Int. J. 2022 35 101211 10.1016/j.jestch.2022.101211 49. Sharma A. Lee H. Ahn B. Effect of Additive Elements (x = Cr, Mn, Zn, Sn) on the Phase Evolution and Thermodynamic Complexity of AlCuSiFe-x High Entropy Alloys Fabricated via Powder Metallurgy Met. Mater. Int. 2022 28 2216 2224 10.1007/s12540-021-01125-0 50. Chae M.J. Sharma A. Oh M.C. Ahn B. Lightweight AlCuFeMnMgTi High Entropy Alloy with High Strength-to-Density Ratio Processed by Powder Metallurgy Met. Mater. Int. 2021 27 629 638 10.1007/s12540-020-00823-5 51. Nagarjuna C. Dewangan S.K. Sharma A. Lee K. Hong S.-J. Ahn B. Application of Artificial Neural Network to Predict the Crystallite Size and Lattice Strain of CoCrFeMnNi High Entropy Alloy Prepared by Powder Metallurgy Met. Mater. Int. 2023 29 1968 1975 10.1007/s12540-022-01355-w 52. Laboratory Safety|Safety Services Available online: https://safetyservices.ucdavis.edu/units/ehs/research/laboratory (accessed on 19 March 2024) 53. Kumari S. Mishra A. Kumari S. Mishra A. Heavy Metal Contamination Soil Contamination-Threats and Sustainable Solutions IntechOpen London, UK 2021 54. Hama Aziz K.H. Mustafa F.S. Omer K.M. Hama S. Hamarawf R.F. Rahman K.O. Heavy metal pollution in the aquatic environment: Efficient and low-cost removal approaches to eliminate their toxicity: A review RSC Adv. 2023 13 17595 10.1039/D3RA00723E 37312989 PMC10258679 55. Massari S. Ruberti M. Rare earth elements as critical raw materials: Focus on international markets and future strategies Resour. Policy 2013 38 36 43 10.1016/j.resourpol.2012.07.001 56. Anastopoulos I. Bhatnagar A. Lima E.C. Adsorption of rare earth metals: A review of recent literature J. Mol. Liq. 2016 221 954 962 10.1016/j.molliq.2016.06.076 57. Malhotra N. Hsu H.S. Liang S.T. Roldan M.J.M. Lee J.S. Ger T.R. Hsiao C.D. An Updated Review of Toxicity Effect of the Rare Earth Elements (REEs) on Aquatic Organisms Animals 2020 10 1663 10.3390/ani10091663 32947815 PMC7552131 58. Barnes P.J. Shapiro S.D. Pauwels R.A. Chronic obstructive pulmonary disease: Molecular and cellular mechanisms Eur. Respir. J. 2003 22 672 10.1183/09031936.03.00040703 14582923 59. Alijagic A. Engwall M. Särndahl E. Karlsson H. Hedbrant A. Andersson L. Karlsson P. Dalemo M. Scherbak N. Färnlund K. Particle Safety Assessment in Additive Manufacturing: From Exposure Risks to Advanced Toxicology Testing Front. Toxicol. 2022 4 836447 10.3389/ftox.2022.836447 35548681 PMC9081788 60. Vardhan K.H. Kumar P.S. Panda R.C. A review on heavy metal pollution, toxicity and remedial measures: Current trends and future perspectives J. Mol. Liq. 2019 290 111197 10.1016/j.molliq.2019.111197 61. Rajak C. Singh N. Parashar P. Metal toxicity and natural antidotes: Prevention is better than cure Environ. Sci. Pollut. Res. 2020 27 43582 43598 10.1007/s11356-020-10783-3 32951168 62. Liu R. Liu H.C. Shi H. Gu X. Occupational health and safety risk assessment: A systematic literature review of models, methods, and applications Saf. Sci. 2022 160 106050 10.1016/j.ssci.2022.106050 63. Gobas F.A.P.C. Mayer P. Parkerton T.F. Burgess R.M. van de Meent D. Gouin T. A chemical activity approach to exposure and risk assessment of chemicals Environ. Toxicol. Chem. 2018 37 1235 1251 10.1002/etc.4091 29697868 PMC5994922 64. IARC Monographs on the Identification of Carcinogenic Hazards to Humans–INTERNATIONAL AGENCY FOR RESEARCH ON CANCER Available online: https://monographs.iarc.who.int/ (accessed on 12 February 2025) 65. Jordan J. Maki R.G. The Weighted Toxicity Score: Confirmation of a Simple Metric to Communicate Toxicity in Randomized Trials of Systemic Cancer Therapy Oncologist 2024 29 67 74 10.1093/oncolo/oyad192 37449664 PMC10769778 66. Chen Z. Krailo M.D. Azen S.P. Tighiouart M. A novel toxicity scoring system treating toxicity response as a quasi-continuous variable in Phase I clinical trials Contemp. Clin. Trials 2010 31 473 482 10.1016/j.cct.2010.05.010 20609419 PMC4871599 67. METALS-International Occupational Safety & Health Information Centre Available online: https://www.ilo.org/static/english/protection/safework/cis/products/safetytm/metals.htm (accessed on 20 March 2024) 68. Akbar-Khanzadeh F. Bisesi M.S. Rivas R.D. Comfort of personal protective equipment Appl. Ergon. 1995 26 195 10.1016/0003-6870(95)00017-7 15677018 69. Golmohammadi R. Darvishi E. The combined effects of occupational exposure to noise and other risk factors-a systematic review Noise Health 2020 21 125 141 10.4103/nah.NAH_4_18 PMC7650855 32719300 70. Turcot A. Girard S.A. Courteau M. Baril J. Larocque R. Noise-induced hearing loss and combined noise and vibration exposure Occup. Med. 2015 65 238 244 10.1093/occmed/kqu214 25759070 71. Lie A. Skogstad M. Johannessen H.A. Tynes T. Mehlum I.S. Nordby K.-C. Engdahl B. Tambs K. Occupational noise exposure and hearing: A systematic review Int. Arch. Occup. Environ. Health 2015 89 351 372 10.1007/s00420-015-1083-5 26249711 PMC4786595 72. Smagowska B. Ultrasonic noise sources in a work environment Arch. Acoust. 2013 38 169 176 10.2478/aoa-2013-0019 73. Sabyrov N. Jahan M.P. Bilal A. Perveen A. Ultrasonic Vibration Assisted Electro-Discharge Machining (EDM)—An Overview Materials 2019 12 522 10.3390/ma12030522 30744142 PMC6384716 74. 3D Printing with Metal Powders: Health and Safety Questions to Ask 2020 Available online: https://www.cdc.gov/niosh/docs/2020-114/default.html (accessed on 10 September 2025) 75. Health Monitoring|WorkSafe.qld.gov.au Available online: https://www.worksafe.qld.gov.au/safety-and-prevention/hazards/hazardous-chemicals/managing-hazchem-risks/health-monitoring (accessed on 20 March 2024) 76. Rahimpoor R. Jalilian H. Mohammadi H. Rahmani A. Biological exposure indices of occupational exposure to benzene: A systematic review Heliyon 2023 9 e21576 10.1016/j.heliyon.2023.e21576 38027568 PMC10660043 77. DeBord D.G. Burgoon L. Edwards S.W. Haber L.T. Kanitz M.H. Kuempel E. Thomas R.S. Yucesoy B. Systems Biology and Biomarkers of Early Effects for Occupational Exposure Limit Setting J. Occup. Environ. Hyg. 2015 12 S41 S54 10.1080/15459624.2015.1060324 26132979 PMC4654673 78. Schulte P.A. Hauser J.E. The use of biomarkers in occupational health research, practice, and policy Toxicol. Lett. 2012 213 91 99 10.1016/j.toxlet.2011.03.027 21477643 79. Khoshakhlagh A.H. Ghobakhloo S. Gruszecka-Kosowska A. Inhalational exposure to heavy metals: Carcinogenic and non-carcinogenic risk assessment J. Hazard. Mater. Adv. 2024 16 100485 10.1016/j.hazadv.2024.100485 Figure 1 Schematic representation of major properties of HEAs, including fundamental properties and the most common hazardous elements used for the synthesis. Figure 2 Schematic presentation of the Pathway by which chemicals enter body. Figure 3 Periodic table of the most common hazardous elements used for the synthesis of HEAs. Figure 4 Different classes of hazardous metals are used to synthesize HEAs. Figure 5 Major properties of reactive metals include low electronegativity, high reactivity with oxygen, malleability, ductility, low bonding strength, and good electrical and thermal conductivity. Figure 6 Major properties of toxic elements, including chemical reactivity, solubility, electronegativity, oxidation states, bioavailability, radioactivity, and their adverse effects on DNA. Figure 7 Major properties of rare-earth metals that pose health and environmental hazards, including water contamination, chemical reactivity, radioactive isotopes, toxicity, and respiratory hazards. Figure 8 Health hazards are associated with exposure to different metal powders. Figure 9 ( a b Figure 10 Safety measures to be followed while synthesizing HEAs and working in the powder metallurgy lab. Figure 11 Laboratory safety equipment used in a powder metallurgy lab and the potential health risks associated with exposure to metal powders and other hazardous materials during experimentation. toxics-13-00777-t001_Table 1 Table 1 Permissible and recommended exposure limits (PEL and REL) by OSHA and NIOSH for different common metals [ 38 39 Metal OSHA PEL NIOSH REL Primary Health Effects  Aluminum (Al) 15 mg/m 3 3 10 mg/m 3 3 Respiratory issues, lung fibrosis  Iron (Fe) 10 mg/m 3 5 mg/m 3 Respiratory irritation, benign pneumoconiosis  Manganese (Mn) 5 mg/m 3 1 mg/m 3 3 Neurological effects, manganism  Zinc (Zn) 5 mg/m 3 3 3 5 mg/m 3 3 Metal fume fever, respiratory irritation  Tungsten (W) 5 mg/m 3 5 mg/m 3 3 Respiratory irritation  Silicon (Si) 15 mg/m 3 3 Not established Respiratory issues with prolonged exposure  Copper (Cu) 1 mg/m 3 3 1 mg/m 3 3 Respiratory irritation, gastrointestinal distress  Titanium (Ti) Not established Not established Generally considered low toxicity, titanium dioxide dust may cause respiratory irritation.  Hafnium (Hf) 0.5 mg/m 3 0.5 mg/m 3 Eye and skin irritation, respiratory issues  Niobium (Nb) Not established Not established Limited data; potential respiratory effects  Tantalum (Ta) 5 mg/m 3 5 mg/m 3 Lung effects, fibrosis with prolonged exposure toxics-13-00777-t002_Table 2 Table 2 List of Diseases Caused by Exposure to Hazardous Substances or Conditions and Their Potential Underlying Causes [ 44 58 59 60 Disease Description  (i) Respiratory concerns The utilization of metal powders in various industries can lead to health issues among lab personnel. Inhaling metal powders, especially fine particles, may result in respiratory complications, such as coughing, shortness of breath, and lung diseases, including fibrosis. Certain metals, such as aluminum and cobalt, have been linked to severe lung diseases.  (ii) Systemic and organ-specific toxicity risks Metal powders, particularly those containing lead and cadmium, can have toxic effects when they enter the body. Lead, in particular, can cause lead poisoning, which impacts the nervous system and various other organs.  (iii) Allergic reactions Working with certain metal powders can trigger allergic responses in susceptible individuals. For instance, cobalt exposure has been associated with acute asthma in sensitive individuals.  (iv) Skin sensitization Contact with metal powders can result in skin irritation, rashes, and dermatitis, especially under prolonged or recurrent exposure.  (v) Cancer susceptibility Prolonged exposure to specific metal powders, such as nickel and chromium, is linked to an increased risk of cancer, particularly in industrial environments.  (vi) Cardiovascular implications Fine particulate matter, including metal powders, can enter the bloodstream and cause cardiovascular problems.  (vii) Digestive disturbances Inadvertently ingesting metal powders, often through hand-to-mouth contact, can lead to gastrointestinal issues.  (viii) Radiographic abnormalities Certain metals, when deposited in the lungs, may not cause immediate harm but may create distinct patterns on chest radiographs. toxics-13-00777-t003_Table 3 Table 3 Key parameters for risk assessment [ 62 63  Key Parameters Description 1 Toxicity Score (TS) Represents the inherent toxicity of a metal, assigned based on known toxicological effects. A higher score indicates greater toxicity. 2 Carcinogenicity Factor (CF) Based on the International Agency for Research on Cancer (IARC) classification, carcinogenicity is categorized as follows [ 64 toxics-13-00777-t004_Table 4 Table 4 Toxicity scores, carcinogenicity, TLV, and risk scores for different elements [ 65 66 Metal Toxicity Score Carcinogenicity Risk Score TLV (mg/m 3 Explanation Mg 1 Not classified 1 10.0  Metal Toxicity Score Carcinogenicity TLV (mg/m 3 Ti 1 Not classified 1 10.0 V 4 Not classified 4 0.05 Cr 5 Group 1 25 0.01 Mn 3 Not classified 3 0.2 Fe 2 Not classified 2 5.0 Co 4 Group 2A 16 0.02 Ni 4 Group 1 20 0.015 Cu 2 Not classified 2 1.0 Zn 1 Not classified 1 5.0 Al 1 Not classified 1 10.0 Si 1 Not classified 1 5.0 Zr 1 Not classified 1 5.0 Nb 1 Not classified 1 5.0 Mo 1 Not classified 1 10.0 Hf 1 Not classified 1 0.5 Ta 1 Not classified 1 5.0 W 1 Not classified 1 5.0 Cd 5 Group 1 25 0.002 Hg 5 Group 2A 20 0.01 Pb 5 Group 2A 20 0.05 toxics-13-00777-t005_Table 5 Table 5 List of personal protective equipment [ 52 68 Personal Protective Equipment Purpose Safety glasses or goggles Protect the eyes from splashes, dust, and particles. Lab coats or protective Clothing Prevent skin contact with powders. Respiratory protection Depending on the particle size and toxicity of the metal powders, use appropriate respirators (e.g., N95 or higher) to prevent inhalation of airborne particles. Gloves Use gloves resistant to the specific metal being handled. Disposable coveralls or dust suits These can provide additional protection when working with highly hazardous or toxic powders. toxics-13-00777-t006_Table 6 Table 6 Control measures for the lab environment. Control Measures Safe Practices for Handling Metal Powders Local exhaust ventilation Install fume hoods or local exhaust systems to capture and remove airborne dust or fumes at the source. Isolation and containment Keep metal-powder handling areas separated from other workspaces to prevent contamination. Dust-collection systems Use dust collectors or industrial vacuum systems to capture and contain loose powders. Safe handling practices Handle all the equipment with patience and mindfulness. Minimize dust generation Use techniques such as wetting the powders or working in glove boxes with controlled atmospheres to reduce dust generation. Avoid spills Handle powders with care to prevent spills or releases. No smoking or eating Prohibit smoking, eating, or drinking in areas where metal powders are handled. Proper labeling Clearly label containers with the type of metal powder and any associated hazards. Regular cleaning Maintain a clean work environment and regularly clean surfaces to prevent dust buildup. Training and Education Ensure that lab personnel are trained in the safe handling of metal powders, including the proper use of PPE and the recognition of potential hazards. Emergency response Establish emergency response procedures, including response to spillage and evacuation plans. toxics-13-00777-t007_Table 7 Table 7 Control measures for noise in the lab environment as per OSHA [ 71 Process/Equipment Noise Level (dB) Vibration Frequency (Hz) Limited by OSHA Remark  Ball Milling 80–90 5–15 <85 dB Noise levels can vary depending on the mill design and operational parameters. Vibration frequencies are typically low, contributing to the overall noise environment.  Sintering 60–70 Minimal Sintering furnaces generally produce low noise and minimal vibration, primarily from auxiliary equipment like fans or conveyors.  Ultrasonication 70–85 20,000–40,000 Ultrasonic processors operate at high frequencies (20 kHz and above), with noise levels depending on power settings and enclosure effectiveness [ 72  Cutting/Polishing 85–95 50–60 Mechanical cutting and polishing tools generate significant noise and vibration, varying with material hardness and equipment type.  Wire EDM 75–85 Variable Wire Electrical Discharge Machining produces moderate noise; vibration levels depend on machine settings and workpiece material [ 73 toxics-13-00777-t008_Table 8 Table 8 Key aspects of medical surveillance, testing indicators, and recommended testing frequency. Aspect Recommendation Details/Indicators Testing Frequency Ref. Initial Medical Examination Baseline assessment Comprehensive medical and occupational history Once, before exposure [ 39 71 Complete Blood Count (CBC) Monitoring hematological changes Detect systemic toxicity High risk: Quarterly [ 71 76 Liver Function Tests (LFTs) Monitor hepatic function Early detection of liver damage High risk: Quarterly [ 71 76 Kidney Function Tests Monitor renal function Early detection of nephrotoxicity High risk: Quarterly [ 71 76 Blood Metal Levels Measure specific metals (e.g., Pb, Cd, Hg) Assess internal exposure High risk: Quarterly [ 71 77 Urinary Metal Excretion Measure metal content in urine Provides body burden information High risk: Quarterly [ 71 78 79 ",
  "metadata": {
    "Title of this paper": "Inhalational exposure to heavy metals: Carcinogenic and non-carcinogenic risk assessment",
    "Journal it was published in:": "Toxics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474114/"
  }
}