{
  "title": "Paper_291",
  "abstract": "pmc Front Med (Lausanne) Front Med (Lausanne) 2657 frontmedicine Front. Med. Frontiers in Medicine 2296-858X Frontiers Media SA PMC12488445 PMC12488445.1 12488445 12488445 10.3389/fmed.2025.1657151 1 Medicine Original Research Relationship between lung function impairment, clinical characteristics and systemic inflammation based on a large-scale population screening Ma Xiaojun  1  2  3  4  5  † Yu Yan  6  † Guan Wenxia  2  † Guo Shuming  3 Gao Zhancheng  3  4  5  6 Jin Mengtong  3 Liu Peng  3 Cheng Lianyu  3 Chen Chunting  3 Ma Kaiyu  3 Zhou Yujie  3 Li Ran  6  * Wu Qi  1  * 1 Department of Respiratory and Critical Care Medicine, Tianjin Medical University General Hospital, Tianjin Medical University Tianjin China 2 Department of Pulmonary and Critical Care Medicine, Linfen Central Hospital Linfen China 3 Linfen Clinical Medicine Research Center, LinFen Central Hospital Linfen China 4 Shanxi Provincial Clinical Medical Research Center for Respiratory Diseases (COPD) Linfen China 5 Joint Research Center for Thoracic and Pulmonary Diseases, Shanxi Medical University Linfen China 6 Department of Respiratory and Critical Care Medicine, Peking University People’s Hospital Beijing China Edited by: Liang Zhao Reviewed by: Hiroya Ohta Da-Wei Wu Hitesh Singh Chaouhan *Correspondence: Ran Li, liran2004@bjmu.edu.cn Qi Wu, wq572004@163.com † 18 9 2025 2025 12 480650 1657151 01 7 2025 04 9 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Ma, Yu, Guan, Guo, Gao, Jin, Liu, Cheng, Chen, Ma, Zhou, Li and Wu. 2025 Ma, Yu, Guan, Guo, Gao, Jin, Liu, Cheng, Chen, Ma, Zhou, Li and Wu https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Lung function impairment, a hallmark of chronic airway diseases like chronic obstructive pulmonary disease (COPD), is often underdiagnosed in China. Preserved Ratio Impaired Spirometry (PRISm) may represent an early, subclinical stage of this process. However, a comprehensive understanding of their clinical phenotypes, effective predictive strategies for early identification in large populations, and the role of systemic inflammation remains underexplored, particularly in the Chinese context. This study aimed to describe the clinical phenotypes of lung function impairment, identify predictive factors using machine learning, and explore associated systemic inflammation in a large-scale population screening. Methods A prospective cross-sectional study was conducted in Hongtong County, China (2021–2024). Participants were classified into airflow obstruction, PRISm, and normal groups via portable spirometry. Using demographic, clinical, and laboratory data, we developed and validated several machine learning (ML) models to predict lung function impairment. Model performance was evaluated by the area under the receiver operating characteristic curve (AUC). Serum cytokines were measured by ELISA in matched sub-cohorts to assess systemic inflammation. Results Among 9,284 enrolled adults, 51.0% had airflow obstruction, 6.7% had PRISm, and 42.3% were normal. We identified distinct phenotypes: the PRISm group was predominantly female with lower smoking rates but a higher risk of coronary heart disease. The airflow obstruction group was characterized by classical risk factors (older age, male sex, lower BMI, smoking) and specific renal and cerebrovascular comorbidities. The ML models identified older age, male sex, lower BMI, respiratory symptoms (cough, dyspnea), and higher creatinine and hemoglobin as key predictors, demonstrating modest performance with an AUC of 0.635 in the validation set. Immunologically, individuals with airflow obstruction or PRISm showed significantly lower serum IL-2 and higher IL-5 and IL-17A levels compared to controls. Conclusion In a large-scale screening, individuals with airflow obstruction and PRISm present with distinct clinical phenotypes. A predictive model using simple clinical variables can help identify individuals at higher risk for lung function impairment, despite modest performance. Serum IL-2, IL-5, and IL-17A are potential biomarkers for the early recognition and understanding of airflow limitation. lung function impairment preserved ratio impaired spirometry (PRISm) predictive model population screening early diagnosis inflammatory biomarkers The author(s) declare that financial support was received for the research and/or publication of this article. This study was funded by Tianjin Key Medical Discipline (Specialty) Construction Project (TJYXZDXK008A). Funded by Shanxi Provincial Clinical Medical Research Center for Respiratory Diseases (COPD) Project (20240410501006). Funded by Linfen Key Research and Development Program (2414). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Pulmonary Medicine 1 Introduction Lung function impairment represents a fundamental physiological aberration common to numerous chronic airway diseases, such as chronic obstructive pulmonary disease (COPD), asthma, bronchiectasis, and tuberculosis-ravaged lung. COPD remains a critical global health burden, ranking as the third leading cause of mortality worldwide (WHO, 2020) ( 1 2 1 3 4 In recent years, increased focus has been directed towards individuals who do not meet the spirometric criteria for persistent airflow obstruction yet display respiratory symptoms or diminished lung function. A noteworthy subgroup in this regard is Preserved Ratio Impaired Spirometry (PRISm), characterized by a preserved FEV1/FVC ratio (≥0.70) alongside a reduced FEV1 (<80% predicted) ( 5 6–8 9–13 Despite these advancements, a comprehensive understanding of the clinical heterogeneity of lung function impairment across its spectrum (from normal to PRISm and established obstruction), and the development of effective, practical predictive strategies for early identification in large populations, remains largely underexplored. Particularly, in high-prevalence, under-diagnosed rural populations like those in China, a systematic “comprehensive atlas” detailing distinct clinical phenotypes, associated predictive factors, and underlying biological mechanisms is still urgently needed. While conventional spirometry is the gold standard for diagnosis, its logistical impracticality and time-consuming nature present a significant barrier for large-scale population screening. To overcome this, the advent and validation of portable spirometers offer a crucial solution, enabling robust and feasible data collection in community settings ( 14 Clinically, distinguishing between individuals with normal lung function, PRISm (subclinical), and advanced airflow obstruction is vital for implementing targeted prevention and management strategies. Although spirometry is fundamental, its results can be influenced by subjective factors. For instance, elderly individuals may have difficulty cooperating with lung function testing, while younger individuals are often unwilling to complete this time-consuming procedure. This variability underscores the need to find simpler, non-invasive factors correlated with lung function impairment. Integrating readily available blood test indicators with comorbidity metrics represents a crucial step toward developing effective predictive models. However, a more comprehensive understanding and robust risk stratification require moving beyond these isolated factors to incorporate multidimensional data, including demographic information, clinical history, laboratory markers, and environmental exposures ( 15–17 18 19 Furthermore, the pathophysiology of lung function decline is deeply rooted in chronic inflammation ( 20 21 22 Therefore, leveraging the feasibility of large-scale population screening using portable spirometry in a high-burden region of Shanxi Province, China, this study aimed to (1) comprehensively characterize the distinct clinical phenotypes of airflow obstruction and PRISm, (2) identify key clinical and laboratory predictive factors for lung function impairment using machine learning, and (3) explore associated systemic inflammatory profiles. By doing so, we seek to contribute to the early recognition and improved management strategies for chronic airway diseases in high-risk populations. 2 Methods and materials 2.1 Study design and population This cross-sectional study was conducted between January 2021 and July 2024 as part of a large-scale epidemiological survey in the rural regions of Hongtong County, Linfen City, Shanxi Province, China. All adult residents aged 18 years and older were invited to participate. Participants were excluded if they met any of the following criteria: (1) inability to perform spirometry or failure to produce acceptable and repeatable results (quality grade below ‘A’ or ‘B’); (2) presence of an acute respiratory infection at the time of assessment; (3) current pregnancy; or (4) incomplete data, defined as >20% missing values for key variables. Clinical data were systematically collected using an electronic questionnaire. This included demographic information [age, sex, Body Mass Index (BMI)], lifestyle factors (smoking status, biofuel and dust exposure), self-reported symptoms (chronic cough, sputum production, dyspnea, and chest pain), and the history of self-reported respiratory diseases and comorbidities (hypertension, chronic bronchitis, emphysema, COPD, asthma, lung cancer, other malignancies, tuberculosis, coronary heart disease, arrhythmia, diabetes mellitus, hyperthyroidism, and cerebrovascular disease). The study was approved by the ethics committee of Linfen Central Hospital (Ethics Approval No. 2021-1-1) and adhered to the principles of the Declaration of Helsinki. Informed consent was obtained from all participants prior to their involvement. 2.2 Spirometry and group classification Given the nature of this large-scale population screening, all classifications were based on pre-bronchodilator spirometry. Pre-bronchodilator spirometry was performed on all participants using portable spirometry devices (BreathHome, Inc., China). To ensure quality control, all spirometry results were independently reviewed by two experienced pulmonologists. The following parameters were recorded: FEV1/FVC, FEV1, FVC, FEV1% predicted, FVC% predicted, forced expiratory flow at 25, 50, and 75% of FVC (FEF25, FEF50, FEF75), Forced Expiratory Time (FET), and FEF25-75. Quality grade of ‘A’ or ‘B’ was regarded to be eligible, which were defined as acceptable data in at least 2 repeated tests with repeatability difference less than 15%. Optimal results in repeated tests were utilized for further analysis. Based on these pre-bronchodilator results, participants were classified into three distinct groups: Airflow Obstruction Group: FEV1/FVC < 0.70 PRISm Group: FEV1/FVC ≥ 0.70 and FEV1 < 80% predicted Normal Group: FEV1/FVC ≥ 0.70 and FEV1 ≥ 80% predicted 2.3 Laboratory test parameters Routine assays of complete blood count, liver function, renal function, lipid profiles, and fasting glucose were performed for all the participants. Additionally, serum cytokine levels, including interleukin (IL)-2 (cat. no. 10353), IL-4 (cat. no. 10375), IL-5 (cat. no. 10376), IL-10 (cat. no. 13626), IL-17A (cat. no. 10344), and IL-22 (cat. no. 10356), were quantified by ELISA (LunChangShuoBiotech Inc., China) in matched cohorts. In consideration of IL-2 representing for Th1 inflammation, IL-4 and IL-5 for Th2 inflammation, IL-17A and IL-22 for Th17 pathway and neutrophil inflammation, and IL-10 for regulatory T cells, a comprehensive immunologic status can be evaluated. From the complete blood count data, several composite inflammatory indices were calculated: the neutrophil-to-lymphocyte ratio (NLR), neutrophil-to-eosinophil ratio (NER), systemic immune-inflammation index (SII = neutrophil × platelet/lymphocyte), systemic inflammation response index (SIRI = neutrophil × monocyte/lymphocyte), and the platelet-to-lymphocyte ratio (PLR). 2.4 Statistical analysis All statistical analyses were performed using R software (version 4.4.1). Continuous variables with a normal distribution were presented as mean ± standard deviation (SD), while nonparametric variables were presented as median and interquartile range (IQR, 25th and 75th percentiles). Student’s t post hoc In the training cohort, various multivariate modeling approaches were initially employed to identify predictive factors for airflow obstruction and PRISm. Specifically, LASSO regression with 10-fold cross-validation for optimal lambda selection, random forest (500 trees, max_depth = 15, min_samples_leaf = 5), and gradient boosting machine (1,000 boosting stages, learning_rate = 0.01, max_depth = 3) were used. Concurrently, adjusted odds ratios (ORs) with 95% confidence intervals (CIs) were provided by conventional logistic regression. Subsequently, using the selected features, four supervised learning algorithms were implemented to classify individuals with impaired versus normal lung function. These included logistic regression (L2 regularization, C = 1.0), random forest (1,000 trees, min_samples_split = 10), gradient boosting (2000 estimators, learning_rate = 0.005, with early stopping), and XGBoost (max_depth = 6, eta = 0.1, gamma = 0.5). Model performance was evaluated through stratified 5-fold cross-validation to ensure robustness. A two-sided p 3 Results 3.1 Comparison of clinical characteristics among individuals with airflow obstruction, PRISm and normal control A total of 16,962 participants were enrolled. After checking for missing data, a total of 9,284 participants were included in the final analysis, comprising 4,738 (51.0%) in the airflow obstruction group, 621 (6.7%) in the PRISm group, and 3,925 (42.3%) in the normal spirometry group ( Figure 1 Figure 1 The flowchart of patient enrollment and follow-up classification. Flowchart depicting participant selection. Out of 16,962 assessed, 7,678 were excluded; 3,112 due to over 20% missing data and 4,566 due to invalid spirometry results. 9,284 were included: 4,738 in the airflow obstruction group, 621 in the PRISm group, and 3,925 in the normal control group. Table 1 p Table 1 Baseline Characteristics among airflow obstruction, PRISm and normal groups. Items Airflow obstruction ( n PRSIm ( n Normal ( n p Age (IQR) 62 (55,68) 55 (49,63) 57 (50,63) <0.001 Sex <0.001 Male (%) 1988 (42.0%) 133 (21.4%) 1,154 (29.4%) Female (%) 2,750 (58.0%) 488 (78.6%) 2,771 (70.6%) BMI (IQR) 24.7 (22.6, 27.0) 25.5 (23.7, 27.8) 25.5 (23.5, 27.7) <0.001 Smoking status <0.001 Never (%) 2,886 (64.2%) 471 (83.1%) 2,729 (77.2%) Current (%) 1,262 (28.1%) 75 (13.2%) 642 (18.2%) Former (%) 348 (7.7%) 21 (3.7%) 164 (4.6%) Biofuel exposure (%) 2,768 (61.6%) 349 (61.6%) 2076 (58.7%) 0.031 Dust exposure (%) 524 (11.7%) 34 (6.1%) 322 (9.0%) <0.001 Symptoms Chronic cough and sputum production (%) 1,097 (24.9%) 140 (24.4%) 814 (22.5%) 0.033 Dyspnea (%) 734 (16.3%) 68 (12.0%) 328 (9.3%) <0.001 Chest pain (%) 169 (3.8%) 16 (2.8%) 133 (3.8%) 0.519 Self-reported disease Chronic bronchitis (%) 276 (6.1%) 21 (3.7%) 57 (1.6%) <0.001 Emphysema (%) 69 (1.5%) 0 (0.0%) 6 (0.2%) <0.001 COPD (%) 17 (0.4%) 0 (0.0%) 3 (0.1%) 0.013 Asthma (%) 186 (4.1%) 7 (1.2%) 22 (0.6%) <0.001 Comorbidities Hypertension (%) 1,352 (30%) 180 (31.5%) 1,105 (31.1%) 0.497 Lung cancer (%) 10 (0.2%) 0 (0.0%) 0 (0.0%) 0.01 Former TB infection (%) 75 (1.7%) 2 (0.4%) 25 (0.7%) <0.001 CHD (%) 188 (4.2%) 26 (4.6%) 92 (2.6%) <0.001 Arrhythmia (%) 141 (3.1%) 16 (2.8%) 103 (2.9%) 0.813 Malignancy other than lung cancer (%) 14 (0.3%) 2 (0.4%) 5 (0.1%) 0.268 Diabetes (%) 284 (6.3%) 47 (8.3%) 229 (6.5%) 0.199 Cerebral infarction (%) 499 (11.1%) 47 (8.3%) 263 (7.4%) <0.001 BMI: Body Mass Index; COPD: Chronic Obstructive Pulmonary Disease; CHD: Coronary Heart Disease. Regarding lifestyle factors, the prevalence of current and former smoking was highest in the airflow obstruction group. Notably, the current smoking rate in airflow obstruction group (28.1%) was double that of the PRISm group (13.2%, p p Dyspnea was the predominant differentiating symptom, showing a clear gradient in prevalence: highest in the airflow obstruction group, followed by the PRISm group, and lowest in the normal group. A significant discrepancy was observed between objective spirometry findings and self-reported diagnoses of respiratory diseases. Strikingly, only 0.4% of participants in the airflow obstruction group reported a prior diagnosis of COPD. The prevalence of self-reported asthma was highest in the airflow obstruction group compared to the other two groups. Individuals with airflow obstruction exhibited a higher prevalence of self-reported prior tuberculosis and cerebrovascular diseases compared to the other groups. Coronary heart disease rates were also elevated in both the airflow obstruction (4.2%) and PRISm (4.6%) groups compared to the normal group (2.6%) ( p Higher counts of WBC and neutrophils were observed in both the airflow obstruction and PRISm group compared to the normal group. The highest levels of eosinophils and hemoglobin was shown in the airflow obstruction group. While the calculated inflammatory indices were less effective in discriminating between the impaired lung function groups, systemic inflammatory markers, including the NLR and SII, were significantly elevated in the airflow limitation group compared to the normal spirometry group (both p Table 2 Table 2 Laboratory test parameters among airflow obstruction, PRISm and normal groups. Items Airflow obstruction ( n PRSIm ( n Normal ( n p WBC × 10 9 5.99 (5.07, 7.11) 6.01 (4.96, 7.01) 5.81 (4.90, 6.84) <0.001 Neutrophil × 10 9 3.33 (2.67, 4.14) 3.31 (2.66, 4.12) 3.18 (2.60, 3.96) <0.001 Eosinophil × 10 9 0.11 (0.07, 0.18) 0.11 (0.07, 0.16) 0.10(0.07, 0.16) <0.001 Valid counts (%) ª 4,650 (98.1) 607 (97.7) 3,850 (98.1) <0.1 × 10 9 1837 (39.5%) 262 (43.2%) 1738 (45.1%) 0.1 ~ 0.3 × 10 9 2,410 (51.8%) 310 (51.1%) 1858 (48.3%) >0.3 × 10 9 403 (8.7%) 35 (5.8%) 254 (6.6%) Basophil × 10 9 0.03 (0.02, 0.04) 0.02 (0.02, 0.03) 0.02 (0.02, 0.03) <0.001 Hemoglobin, g/L (IQR) 140 (130, 151) 136 (127, 144) 137 (128, 148) <0.001 PLT × 10 9 236 (199, 278) 249 (207, 292) 239 (204, 281) <0.001 SII (IQR) 390.85 (288.72, 530.83) 374.25 (287.74, 524.57) 379.94 (280.52, 512.09) 0.016 SIRI (IQR) 0.62 (0.43, 0.88) 0.62 (0.44, 0.89) 0.59 (0.42, 0.86) 0.040 PLR (IQR) 116.79 (92.52, 146.79) 120.10 (96.59, 151.89) 119.62 (95.97, 150.74) <0.001 ALT, U/L (IQR) 18.90 (14.30, 26.20) 21.10 (15.40, 30.95) 20.10 (15.20, 28.50) <0.001 Glucose, mmol/L (IQR) 4.79 (4.36, 5.36) 4.89 (4.51, 5.50) 4.81 (4.40, 5.35) <0.001 BUN, mmol/L (IQR) 5.44 (4.65, 6.43) 5.06 (4.26, 6) 5.22 (4.43, 6.16) <0.001 Creatinine, μmol/L (IQR) 59.40 (51.70, 69.00) 55.20 (48.00, 63.35) 57.40 (50.60, 66.50) <0.001 Triglyceride, mmol/L (IQR) 1.42 (1.04, 1.98) 1.57 (1.18, 2.20) 1.50 (1.09, 2.12) <0.001 ª Valid counts for eosinophil subgroups are shown. Percentages for these subgroups are calculated based on the number of participants with available eosinophil data, not the total group number. Percentages may not sum to 100% due to rounding. WBC, White Blood Cell; PLT, Platelets; SII, Systemic Immune-Inflammation Index; SIRI, Systemic Inflammation Response Index; PLR, Platelet-to-Lymphocyte Ratio; ALT, Alanine Aminotransferase; BUN, Blood Urea Nitrogen. As expected from the group definitions, spirometric parameters showed a gradient of decline from the normal group to the PRISm and airflow obstruction groups. This trend was particularly evident in parameters of small airway function (FEF25, FEF50, and FEF75), which demonstrated a more pronounced stepwise deterioration across the groups. These small airway parameters also exhibited better sensitivity for identifying lung function impairment compared to conventional parameters such as FEV1/FVC, FEV1, and FVC ( Table 3 Table 3 Spirometry Parameters among airflow obstruction, PRISm and normal groups. Items Airflow obstruction ( n PRSIm ( n Normal ( n p FEV1/FVC (IQR) 61.92 (53.83, 66.46) 74.04 (71.87, 76.76) 75.21 (72.73, 78.18) <0.001 FEV1, L/s (IQR) 2.00 (1.57, 2.43) 1.85 (1.61, 2.09) 2.46 (2.16, 2.88) <0.001 FVC, L/s (IQR) 3.32 (2.73, 4.09) 2.46 (2.17, 2.78) 3.24 (2.84, 3.82) <0.001 FEF25, L/s (IQR) 3.2 (2.16, 4.21) 3.91 (3.2, 4.71) 5.11 (4.33, 6.08) <0.001 FEF50, L/s (IQR) 1.43 (0.95, 1.91) 2.05 (1.71, 2.41) 2.88 (2.38, 3.46) <0.001 FEF75, L/s (IQR) 0.3 (0.21, 0.43) 0.45 (0.35, 0.58) 0.65 (0.48, 0.85) <0.001 FEF25-75, L/s (IQR) 0.93 (0.61, 1.28) 1.46 (1.18, 1.76) 2.08 (1.7, 2.55) <0.001 FEV1, Forced Expiratory Volume in 1 s; FVC, Forced Vital Capacity; FEF25, Forced Expiratory Flow at 25% of FVC; FEF50, Forced Expiratory Flow at 50% of FVC; FEF75, Forced Expiratory Flow at 75% of FVC; FEF25-75, Forced Expiratory Flow between 25 and 75% of FVC. 3.2 Predictive model for subclinical and advanced lung function impairment To identify meaningful predictive factors for the early and precise recognition of lung function impairment, we combined the airflow obstruction group (representing advanced impairment) and the PRISm group (representing subclinical impairment) into a single “lung function impairment” entity (Group 1). This combined group was then compared against the normal control group (Group 2). The entire cohort was randomly divided into a training set and a validation set at a 70:30 ratio. Univariate analysis of the training set was shown in Table 4 Table 4 Univariate analysis of the training set. Items Group 1 Group 2 p ( n ( n Age (IQR) 56 (50, 61) 54 (48, 59) <0.001 Sex <0.001 Male (%) 985 (35.91%) 672 (26.96%) Female (%) 1758 (64.09%) 1821 (73.04%) BMI (IQR) 25.10 (23.05, 27.34) 25.61 (23.71, 27.77) <0.001 Smoking status <0.001 Never (%) 1907 (69.52%) 1943 (77.94%) Current (%) 683 (24.90%) 459 (18.41%) Former (%) 153 (5.58%) 91 (3.65%) Biofuel exposure (%) 1611 (58.73%) 1417 (56.84%) 0.166 Dust exposure (%) 332 (12.10%) 234 (9.39%) 0.002 Symptoms Chronic cough and sputum production (%) 712 (25.96%) 555 (22.26%) 0.002 Dyspnea (%) 400 (14.58%) 236 (9.47%) <0.001 Chest pain (%) 101 (3.68%) 93 (3.73%) 0.926 Self-reported disease Chronic bronchitis (%) 138 (5.03%) 30 (1.20%) <0.001 Comorbidities Cerebral infarction (%) 219 (8%) 125 (5%) <0.001 Laboratory examination WBC × 10 9 5.98 (5.04, 7.09) 5.84 (4.91, 6.88) <0.001 Monocyte×10 9 0.39 (0.31, 0.49) 0.36 (0.28, 0.45) <0.001 Eosinophil×10 9 0.11 (0.07,0.18) 0.1 (0.06, 0.16) <0.001 Hemoglobin, g/L (IQR) 139 (129.5, 151) 138 (128, 149) <0.001 NER (IQR) 30.44 (18.58, 49.17) 28.82 (18.23, 47.29) 0.031 BUN, mmol/L (IQR) 5.25 (4.46, 6.15) 5.1 (4.33, 6) <0.001 Creatinine, μmol/L (IQR) 57 (50, 66.3) 56 (49.4, 65) 0.034 Triglyceride, mmol/L (IQR) 1.45 (1.04, 2.06) 1.51 (1.09, 2.16) 0.002 Spirometry examination FEV1/FVC % (IQR) 64.38 (56.97, 68.52) 75.61 (73.15, 78.5) <0.001 FEV1, L/s (IQR) 2.11 (1.74, 2.55) 2.52 (2.22, 2.95) <0.001 FEF25, L/s (IQR) 3.61 (2.63, 4.56) 5.21 (4.45, 6.16) <0.001 FEF50, L/s (IQR) 1.68 (1.20, 2.18) 2.98 (2.5, 3.55) <0.001 FEF75, L/s (IQR) 0.35 (0.25, 0.5) 0.68 (0.51, 0.88) <0.001 FEF25-75, L/s (IQR) 1.13 (0.76, 1.48) 2.18 (1.8, 2.63) <0.001 BMI, Body Mass Index; WBC, White Blood Cell; NER, Neutrophil-to-eosinophil ratio; BUN, Blood Urea Nitrogen; FEV1, Forced Expiratory Volume in 1 s; FVC, Forced Vital Capacity; FEF25, Forced Expiratory Flow at 25% of FVC; FEF50, Forced Expiratory Flow at 50% of FVC; FEF75, Forced Expiratory Flow at 75% of FVC; FEF25-75, Forced Expiratory Flow between 25 and 75% of FVC. To identify robust predictive factors for lung function impairment, several machine learning algorithms for modeling were employed, including logistic regression, Random Forest (RF), Gradient Boosting Machine (GBM) and XGBoost. The validation set was served as an independent external validation for model performance. Multivariable logistic regression analysis identified multiple predictive factors, including older age, male sex, lower BMI, chronic cough and sputum, dyspnea, a history of chronic bronchitis and asthma, higher creatinine, and higher hemoglobin level ( Table 5 Figure 2 Figure 3 Table 5 Predictive factors for lung function impairment using logistic regression modeling. Independent var B SE  z p OR [95%CI] Constant 1.312 0.466 2.816 0.005 Age 0.027 0.003 7.817 0.000 1.03 [1.02, 1.03] Female −0.514 0.085 −6.028 0.000 0.6 [0.51, 0.71] BMI −0.045 0.008 −5.353 0.000 0.96 [0.94, 0.97] Chronic cough and sputum 0.224 0.065 3.429 0.001 1.25 [1.1, 1.42] Dyspnea 0.285 0.091 3.138 0.002 1.33 [1.11, 1.59] Self-reported chronic bronchitis 0.998 0.206 4.850 0.000 2.71 [1.81, 4.06] Self-reported asthma 1.556 0.307 5.062 0.000 4.74 [2.59, 8.65] Creatinine −0.006 0.002 −2.435 0.015 0.99 [0.99, 1] Hemoglobin −0.003 0.002 −1.522 0.128 1 [0.99, 1] BMI, Body Mass Index. Figure 2 Predictive factors of lung function impairment by multivariable logistic regression analysis. Chart showing a point-based risk prediction model for COPD and PRISm. It includes scales for age, sex, BMI, history of chronic cough, breathing difficulties, tracheitis, self-assessed asthma history, creatinine, and hemoglobin. The total points correlate with the risk percentage of COPD and PRISm. Figure 3 ROC-AUC curves (a) (b) (c) Two graphs are displayed. The first set of graphs (a) shows ROC curves for a training set and a validation set, with different models: logistic regression, random forest, gradient boosting machine, and extreme gradient boosting. The AUC values are listed in the legend. The second graph (b) is a decision curve analysis displaying net benefit against different high-risk thresholds for the same models. Each graph includes a legend identifying the models by color. Four calibration plots compare predicted probability against observed probability for model performance. Each plot corresponds to a different model: logistic regression, random forest, gradient boosting, and extreme gradient boosting. All plots show lines deviating from the diagonal, indicating calibration differences. Models used five hundred repetitions with bootstrapping; mean absolute errors are noted. 3.3 Comparison of systemic inflammation among lung function groups After matching for age, sex and smoking status, we quantified six key cytokines in a sub-cohort consisting of 202 participants with airflow obstruction, 202 participants in PRISm, and 209 participants in normal group ( Table 6 Table 6 Serum cytokine Levels among airflow obstruction, PRISm and normal groups in matched sub-cohorts. Cytokines Airflow obstruction PRISm Normal control p ( n ( n ( n IL-2 (IQR) 162.52 (106.92, 239) 240.13 (179.35, 296.67) 280.17 (183.36, 372.2) <0.001 IL-4 (IQR) 26.39 (15.88, 33.82) 17.73 (15.86, 25.85) 25.84 (17.67, 33.18) <0.001 IL-5 (IQR) 94.29 (59.5, 163.56) 93.82 (80.59, 108.35) 62.69 (56.89, 69.21) <0.001 IL-10 (IQR) 39.35 (30.01, 47.69) 28.68 (20.92, 37.31) 44.26 (27.8, 54.83) <0.001 IL-17A (IQR) 9.49 (6.77, 13.05) 9.42 (7.05, 13.22) 7.95 (5.81, 10.98) 0.001 IL-22 (IQR) 199.56 (126.38, 265.49) 202.56 (131.1, 286.45) 183.37 (133.37, 227.14) 0.03 IL-2, Interleukin-2; IL-4, Interleukin-4; IL-5, Interleukin-5; IL-10, Interleukin-10; IL-17A, Interleukin-17A; IL-22, Interleukin-22. While statistically significant differences were observed for all measured cytokines across the three groups, some did not demonstrate a clear or clinically relevant gradient. Upon pairwise comparison, IL-2 levels showed a significant gradient, with the lowest levels in the airflow obstruction group, intermediate levels in the PRISm group, and the highest levels in the normal group (airflow obstruction < PRISm < Normal). Notably, the levels of IL-5 and IL-17A were significantly elevated in the combined lung function impairment group (Group 1: airflow obstruction and PRISm) compared to the normal control group (Group 2). These findings suggest that IL-2, IL-5 and IL-17A could serve as potential biomarkers for the identification of lung function impairment. 4 Discussion This large-scale, real-world population screening characterized the distinct clinical, metabolic, and inflammatory phenotypes of airflow obstruction and PRISm in rural China, a region with a significant COPD burden ( 3 Our study provides an in-depth characterization of PRISm as a distinct clinical entity. Unlike the airflow obstruction group, PRISm was more prevalent in females, associated with lower smoking and dust exposure rates, and exhibited symptom burden intermediate to normal and obstructed groups. Notably, PRISm showed a unique comorbidity pattern, including an elevated risk of coronary heart disease and a characteristic atherogenic lipid profile (higher triglycerides), suggesting intrinsic metabolic dysregulation as a potential underlying mechanism that warrants further investigation. In contrast, the airflow obstruction group presented with a classical risk profile tied to smoking and dust exposure, a higher burden of respiratory symptoms, and comorbidities like tuberculosis and cerebrovascular disease. We identified several readily available clinical and laboratory markers with predictive value for lung function impairment, consistent with some previous literature ( 11 23–25 22 26–29 Our study has several limitations. Its cross-sectional design allows for identification of associations and predictive factors, but not causality; longitudinal follow-up is required to confirm true predictors of disease progression. Second, our reliance on pre-bronchodilator spirometry, while pragmatic for large-scale screening and supported by its utility for risk stratification ( 30 Future research should focus on validating these distinct phenotypes and the predictive model in diverse independent cohorts, particularly through prospective longitudinal studies. Further investigation is also warranted to elucidate the precise mechanistic roles of serum IL-2, IL-5, and IL-17A in the early pathogenesis of lung function impairment and their potential as prognostic biomarkers or therapeutic targets. Finally, exploring the integration of additional, readily available clinical or biological parameters, and potentially more advanced machine learning approaches, could further enhance the predictive power of such models. 5 Conclusion In summary, this large-scale, real-world screening study reveals the distinct clinical, metabolic, and inflammatory landscapes of airflow obstruction and PRISm, highlighting a substantial burden of undiagnosed lung function impairment. We established a potential predictive model using simple clinical history and routine laboratory assays that could help identify high-risk individuals for targeted, early spirometric screening. Furthermore, our findings suggest that serum IL-2, IL-5 and IL-17A may serve as biomarkers for airflow limitation, providing a deeper understanding of the immunological mechanisms driving the gradual impairment of lung function. These insights can inform public health strategies aimed at the early detection and management of chronic airway diseases. The authors would like to extend their heartfelt gratitude to all individuals and institutions whose contributions were instrumental to the success of this study. First and foremost, we sincerely appreciate the invaluable dedication of our colleagues at Linfen Central Hospital. Their exceptional expertise and unwavering support, particularly during the critical phase of epidemiological investigation, were pivotal to the smooth progression of this research. We deeply acknowledge the trust placed in our work by these institutions, as well as their essential funding that enabled the realization of this study. We are truly indebted to all those who have contributed to this endeavor. Data availability statement The datasets presented in this study can be found in online repositories. The names of the repository/repositories and accession number(s) can be found in the article/supplementary material. Ethics statement The studies involving humans were approved by Ethical approval was obtained from the Human Research Ethics Committee of Linfen Central Hospital (Approval No. 2021-1-1) on January 18, 2021. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Author contributions XM: Data curation, Funding acquisition, Project administration, Writing – original draft, Writing – review & editing, Formal analysis. YY: Validation, Methodology, Data curation, Writing – review & editing. WG: Data curation, Writing – review & editing, Formal Analysis. SG: Writing – review & editing, Supervision, Funding acquisition. ZG: Writing – review & editing, Methodology, Supervision. MJ: Writing – review & editing, Data curation. PL: Data curation, Writing – review & editing. LC: Writing – review & editing, Data curation. CC: Data curation, Writing – review & editing. KM: Data curation, Writing – review & editing. YZ: Writing – review & editing, Data curation. RL: Project administration, Data curation, Methodology, Writing – review & editing. QW: Writing – review & editing, Supervision, Project administration, Methodology. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Wang Z Lin J Liang L Huang F Yao X Peng K Global, regional, and national burden of chronic obstructive pulmonary disease and its attributable risk factors from 1990 to 2021: an analysis for the Global Burden of Disease Study 2021 Respir Res. 2025 26 2 10.1186/s12931-024-03051-2 39748260 PMC11697803 2. Singh D Han MK Hawkins NM Hurst JR Kocks JWH Skolnik N Implications of cardiopulmonary risk for the management of COPD: a narrative review Adv Ther 2024 41 2151 67 10.1007/s12325-024-02855-4 38664329 PMC11133105 3. Wang C Xu J Yang L Xu Y Zhang X Bai C Prevalence and risk factors of chronic obstructive pulmonary disease in China (the China Pulmonary Health [CPH] study): a national cross-sectional study Lancet 2018 391 1706 17 10.1016/S0140-6736(18)30841-9 29650248 4. Gao J Prasad N Chronic obstructive pulmonary disease in China: the potential role of indacaterol J Thorac Dis. 2013 5 548 558 10.3978/j.issn.2072-1439.2013.08.04 PMC3755687 23991315 5. Miura S Iwamoto H Omori K Yamaguchi K Sakamoto S Horimasu Y Preserved ratio impaired spirometry with or without restrictive spirometric abnormality Sci Rep 2023 13 2988 10.1038/s41598-023-29922-0 36806707 PMC9941093 6. Zhang Y Li X Wang J Chen L Associated Factors and Pulmonary Function Outcomes of Preserved Ratio Impaired Spirometry: A Scoping Review Int J Chron Obstruct Pulmon Dis. 2025 20 135 148 10.2147/COPD.S506115 PMC11952047 40161397 7. Li M Chen M Li Y Liu Z Li X Lang X Association of preserved ratio impaired spirometry with mortality and cardiovascular diseases: a systematic review and meta-analysis Syst Rev. 2024 13 147 10.1186/s13643-024-02549-6 38971833 PMC11227213 8. Huang J Li W Sun Y Huang Z Cong R Yu C Preserved Ratio Impaired Spirometry (PRISm): A Global Epidemiological Overview, Radiographic Characteristics, Comorbid Associations, and Differentiation from Chronic Obstructive Pulmonary Disease Int J Chron Obstruct Pulmon Dis. 2024 19 753 764 10.2147/COPD.S453086 38505581 PMC10949882 9. Zhao NN Zhou YM Progress in preserved ratio impaired spirometry Zhonghua Jie He He Hu Xi Za Zhi 2022 45 1046 50 10.3760/cma.j.cn112147-20220518-00426 36207961 10. Lai Y Yang T Zhang X Li M Associations between life's essential 8 and preserved ratio impaired spirometry Sci Rep 2025 15 8166 10.1038/s41598-025-90381-w 40059094 PMC11891325 11. Wu J Wang G Gan J Yang L Zhang H Xian J Nomogram to predict progression from preserved ratio impaired spirometry to chronic obstructive pulmonary disease Sci Rep 2025 15 10447 10.1038/s41598-025-93359-w 40140392 PMC11947084 12. Cadham CJ Oh H Han MK Mannino D Cook S Meza R The prevalence and mortality risks of PRISm and COPD in the United States from NHANES 2007-2012 Respir Res 2024 25 208 10.1186/s12931-024-02841-y 38750492 PMC11096119 13. Yang S Liao G Tse LA Association of preserved ratio impaired spirometry with mortality: a systematic review and meta-analysis Eur Respir Rev 2023 32 230135 10.1183/16000617.0135-2023 37914194 PMC10618908 14. Jankowski P Mycroft K Górska K Korczyński P Krenke R How to enhance the diagnosis of early stages of chronic obstructive pulmonary disease (COPD)? The role of Mobile spirometry in COPD screening and diagnosis-a systematic review Adv Respir Med 2024 92 158 74 10.3390/arm92020018 38666812 PMC11047510 15. Wan ES Castaldi PJ Cho MH Hokanson JE Regan EA Make BJ Epidemiology, genetics, and subtyping of preserved ratio impaired spirometry (PRISm) in COPDGene Respir Res. 2014 15 89 10.1186/s12931-014-0089-y 25096860 PMC4256936 16. Georgopoulos PG Brinkerhoff CJ Isukapalli S Dellarco M Landrigan PJ Lioy PJ A tiered framework for risk-relevant characterization and ranking of chemical exposures: applications to the National Children's study (NCS) Risk Anal 2014 34 1299 316 10.1111/risa.12165 24467550 PMC4158851 17. Marrie RA Demographic, genetic, and environmental factors that modify disease course Neurol Clin 2011 29 323 41 10.1016/j.ncl.2010.12.004 21439444 18. Amirthalingam P Alatawi Y Chellamani N Shanmuganathan M Ali MAS Alqifari SF Sea horse optimization-deep neural network: a medication adherence monitoring system based on hand gesture recognition Sensors (Basel) 2024 24 5224 10.3390/s24165224 39204920 PMC11360803 19. Ramasundaram M Sohn H Madhavan T A bird's-eye view of the biological mechanism and machine learning prediction approaches for cell-penetrating peptides Front Artif Intell 2024 7 1497307 10.3389/frai.2024.1497307 39839972 PMC11747587 20. Norris KA Morris A Patil S Fernandes E Pneumocystis colonization, airway inflammation, and pulmonary function decline in acquired immunodeficiency syndrome Immunol Res 2006 36 175 88 10.1385/IR:36:1:175 17337778 21. Tashkin DP Wechsler ME Role of eosinophils in airway inflammation of chronic obstructive pulmonary disease Int J Chron Obstruct Pulmon Dis 2018 13 335 49 10.2147/COPD.S152291 29403271 PMC5777380 22. Jesus FR Moraes ACS da Silva ILN Passos FC Salles C Neves MCLC Analysis of endocrine and inflammatory markers in preserved ratio impaired spirometry Med Sci (Basel) 2024 12 18 10.3390/medsci12020018 38651412 PMC11036252 23. Divo MJ Liu C Polverino F Castaldi PJ Celli BR Tesfaigzi Y From pre-COPD to COPD: a simple, low cost and easy to IMplement (SLIM) risk calculator Eur Respir J 2023 62 2300806 10.1183/13993003.00806-2023 37678951 PMC10533946 24. Hou X Ran P Development and validation a nomogram to predict long-term mortality risks of PRISm and mild-to-moderate COPD based on NHANES 2007-2012 Sci Rep 2025 15 16000 10.1038/s41598-025-94399-y 40341137 PMC12062282 25. Du W Guan H Wan X Circulating liver function markers and the risk of COPD in the UK biobank Front Endocrinol (Lausanne) 2023 14 1121900 10.3389/fendo.2023.1121900 37033218 PMC10073719 26. Agustí AG Noguera A Sauleda J Sala E Pons J Busquets X Systemic effects of chronic obstructive pulmonary disease Eur Respir J 2003 21 347 60 10.1183/09031936.03.00405703 12608452 27. Bożek A Rogala B IgE-dependent sensitization in patients with COPD Ann Agric Environ Med 2018 25 417 20 10.26444/aaem/83413 30260198 28. Starkey MR Plank MW Casolari P Papi A Pavlidis S Guo Y IL-22 and its receptors are increased in human and experimental COPD and contribute to pathogenesis Eur Respir J 2019 54 1800174 10.1183/13993003.00174-2018 31196943 PMC8132110 29. Zou Y Chen X Liu J Zhou D Kuang X Xiao J Serum IL-1β and IL-17 levels in patients with COPD: associations with clinical parameters Int J Chron Obstruct Pulmon Dis 2017 12 1247 54 10.2147/COPD.S131877 28490868 PMC5413485 30. Çolak Y Lange P Vestbo J Nordestgaard BG Afzal S Susceptible young adults and development of chronic obstructive pulmonary disease later in life Am J Respir Crit Care Med 2024 210 607 17 10.1164/rccm.202308-1452OC 38364200 Glossary ALT Alanine Aminotransferase BMI Body Mass Index BUN Blood Urea Nitrogen CHD Coronary heart disease COPD Chronic Obstructive Pulmonary Disease FEF25 Forced Expiratory Flow at 25% of FVC FEF50 Forced Expiratory Flow at 50% of FVC FEF75 Forced Expiratory Flow at 75% of FVC FEF25–75 Forced Expiratory Flow between 25 and 75% of FVC FET Forced expiratory time FEV1 Forced expiratory volume in the first 1.0 s FVC Forced vital capacity IL-2 Interleukin-2 IL-4 Interleukin-4 IL-5 Interleukin-5 IL-10 Interleukin-10 IL-17A Interleukin-17A IL-22 Interleukin-22 ML Machine Learning NER Neutrophil-to-eosinophil ratio NLR Neutrophil-to-lymphocyte ratio PLR Platelet-to-lymphocyte ratio PLT Platelets PRISm Preserved Ratio Impaired Spirometry SIRI Systemic inflammation response index SII Systemic immune-inflammation index TB Tuberculosis WBC White blood cells ",
  "metadata": {
    "Title of this paper": "Susceptible young adults and development of chronic obstructive pulmonary disease later in life",
    "Journal it was published in:": "Frontiers in Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488445/"
  }
}