{
  "title": "Paper_489",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12484439 PMC12484439.1 12484439 12484439 41026280 10.1007/s12672-025-03075-0 3075 1 Analysis TERT links telomere length to cancer risk by integrating genomic instability and immune modulation http://orcid.org/0009-0004-8653-7948 Zhao Jingwei 1 2 Zhu Jiayun 1 2 Zhu Kangle 3 Wang Mingyang 1 2 Gong Wei gongwei@xinhuamed.com.cn 1 2 Wang Jiandong wangjiandong@xinhuamed.com.cn 1 2 Liu Shilei lsl81106626@alumni.sjtu.edu.cn 1 2 1 https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 Department of General Surgery, Xinhua Hospital, Affiliated to Shanghai Jiao Tong University School of Medicine, 2 3 https://ror.org/026axqv54 grid.428392.6 0000 0004 1800 1685 Nanjing Drum Tower Hospital Clinical College of Nanjing Medical University, 30 9 2025 12 2025 16 478248 1788 20 3 2025 24 6 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Telomere homeostasis serves as a key regulatory mechanism linking aging and cancer. While telomere attrition imposes a proliferative barrier by inducing cellular senescence, abnormal telomere elongation circumvents this constraint, thereby granting malignant cells unlimited replicative capacity. This study systematically explores the causal relationship between telomere length and cancer risk, with the goal of elucidating the molecular pathways involved in telomere-driven tumorigenesis. Method Mendelian randomization (MR) was employed to establish a causal link between telomere length and pan-cancer susceptibility. Multiple MR models were employed to ensure the robustness of the results. Telomere-associated genes were identified through SNPense analysis, followed by Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway enrichment. Key gene regulatory networks were identified and visualized using the MCODE and cytoHubba algorithms. The expression profile of TERT across diverse cancer types was analyzed using TCGA datasets, and its diagnostic potential was evaluated via receiver operating characteristic (ROC) curve analysis. Correlations between TERT expression and immune cell infiltration were further explored. Results Longer telomere length was significantly associated with an increased risk of 33 cancer types (IVW OR = 1.27–1.41, all P < 0.001). A total of 143 telomere-related genes were identified, with functional enrichment highlighting their involvement in genome integrity and telomere maintenance. TERT emerged as the most influential hub gene (MCC score = 169). Transcriptomic analyses from TCGA demonstrated widespread TERT overexpression in 16 cancers (e.g., CHOL, LIHC, LUAD), a finding corroborated by RT-qPCR validation. TERT exhibited high diagnostic performance (AUC > 0.85 in 16 cancers, peaking at AUC = 0.97 in LUSC). Immune infiltration analysis revealed a positive correlation with Th2 cells (r = 0.42) but negative correlations with dendritic cells (r = − 0.38) and macrophages (r = − 0.31). Conclusion This study proposes a comprehensive framework linking telomere length regulation to cancer progression through the TERT axis. Telomere dysfunction contributes to tumorigenesis via two key mechanisms: promoting genomic instability and altering the immune microenvironment. These findings offer new insights into telomere-driven oncogenesis and lay a conceptual foundation for precision diagnostics and targeted therapies in oncology. Keywords Cancer Telomere homeostasis Mendelian randomization Genetic variants Immune infiltration Young Scientists Fund of the National Natural Science Foundation of China No. 82303289 Shanghai Sailing Program No. 23YF1426000 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Telomeres are specialized structures located at chromosome ends that preserve genomic stability by preventing DNA degradation and chromosomal fusion [ 1 3 4 6 7 8 9 10 Genes involved in telomere maintenance and DNA repair are essential for preserving genomic integrity [ 11 12 13 14 15 Mendelian randomization (MR) has emerged as a powerful tool in cancer research, offering a way to assess causal relationships by using genetic variants as instrumental variables [ 16 18 19 21 This study aims to systematically investigate the causal relationship between telomere length and the risk of various cancers using MR analyses. We also explore the underlying molecular mechanisms by identifying telomere-related genes and their functional pathways. Furthermore, we examine the expression of the key hub gene across diverse cancer types and evaluate its diagnostic utility and immunomodulatory functions within the tumor microenvironment. Methods Mendelian randomization analysis We used summary-level data from large-scale Genome-Wide Association Study (GWAS) to perform MR analyses, employing the inverse-variance weighted (IVW) method, MR Egger regression, and weighted mode as primary and sensitivity analyses. The analysis method is the same as that reported in our previous articles. The selection criterion of IVs was P < 5e-06. The liftOver tool was used for coordinate conversion and have detailed the SNP quality control criteria, including P-value thresholds, minor allele frequency (MAF) thresholds, and LD pruning parameters, in the methods section [ 22 1 16 https://gwas.mrcieu.ac.uk/ https://www.finngen.fi/en 2 23 24 Table 1 GWAS information of this study Trait Data sources Population Sample Size Sex Year Genome reference version Telomere length MRCIEU (ieu-b-4879) European 472,174 Males and Females 2021 GRCh37 Pan-cancer FinnGen (R11) European 500,244 Males and Females 2024 GRCh38 Table 2 Endpoints included in the pan-cancer GWAS dataset Endpoints HEAD_AND_NECK_EXALLC RESPIRATORY_INTRATHORACIC_EXALLC DIGESTIVE_ORGANS_EXALLC BONE_CARTILAGE_EXALLC SKIN_EXALLC MESTOTHEL_SOFTTISSUE_EXALLC BREAST_EXALLC FEMALE_GENITAL_EXALLC MALE_GENITAL_EXALLC URINARY_TRACT_EXALLC BLADDER_EXALLC EYE_BRAIN_NEURO_EXALLC ENDOCRINE_EXALLC UNCERTAIN_SECONDARY_EXALLC PRIMARY_LYMPHOID_HEMATOPOIETIC INDEPENDENT_MULTIPLE_SITES Linkage disequilibrium (LD) Compared to random chance, LD results in a higher likelihood of alleles from two or more loci co-occurring on a single chromosome. Our screening criteria were consistent with previous work [ 22 2 2 Elimination of weak IVs Weak IVs were evaluated in the same way as in our previous article [ 22 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{F}=\\frac{\\text{N}-\\text{K}-1}{\\text{k}}\\times \\frac{2\\times (1-\\text{MAF})\\times \\text{MAF}\\times (\\upbeta /\\text{SD})}{1-{\\left[2\\times (1-\\text{MAF})\\times \\text{MAF}\\times (\\upbeta /\\text{SD})\\right]}^{2}}$$\\end{document} N represents the sample size of the exposure variable, K represents the number of IVs, MAF indicates the minor allele frequency, β indicates the allele effect size, and SD represents the standard deviation. Protein–protein interaction network construction and analysis To elucidate the mechanisms linking telomere length to pan-cancer pathogenesis, we annotated 121 SNPs using SNPense, identifying 143 protein-coding genes [ 25 Enrichment analysis Local network cluster enrichment analysis of the 143 genes was performed to prioritize key biological processes and molecular functions. This analysis highlighted the involvement of these genes in telomere extension by telomerase and the CST complex, as well as telomere cap complex formation. Gene Ontology (GO) enrichment analysis was conducted to further characterize the cellular component (CC), biological process (BP), and molecular function (MF) of telomere-related genes. Human Phenotype enrichment analysis and Reactome pathway analysis were used to assess the association of these genes with telomere length and hematological phenotypes. Data acquisition and processing of pan-cancer Pan-cancer RNA-seq data were retrieved from the TCGA database ( https://portal.gdc.cancer.gov Expression analysis of TERT in pan-cancer The expression of TERT was examined using the TCGA pan-cancer database. Radar charts were generated to show the expression trend of TERT in pan-cancer. The statistical analysis was performed using R (version 4.2.1) with the following packages: ggplot2 (3.4.4) [ 26 27 27 Cell lines and TERT mRNA expression analysis To assess the relative expression of TERT mRNA across a range of human cancers, we employed 16 tumor cell lines representing malignancies from the urinary, breast, hepatobiliary, gastrointestinal, respiratory, nervous, cutaneous, and reproductive systems. Each tumor cell line was paired with a corresponding non-malignant cell line of the same tissue origin to serve as a normal control. The tumor-control cell line pairs were as follows: UM-UC-3 (bladder cancer, Pricella, CL-0463) and SV-HUC-1 (normal uroepithelial cells, Pricella, CL-0222); MDA-MB-468 (triple-negative breast cancer, Pricella, CL-0290) and MCF 10A (non-tumorigenic breast epithelial cells, Pricella, CL-0525); HuCCT1 (intrahepatic cholangiocarcinoma, Pricella, CL-0725) and HIBEpiC (normal intrahepatic biliary epithelial cells, Pricella, CP-H042); HCT116 (colorectal carcinoma, Pricella, CL-0096) and NCM460 (normal colon mucosal epithelial cells, FENGHUISHENGWU, CL-0393); KYSE-30 (esophageal squamous cell carcinoma, Pricella, CL-0577) and Het-1A (normal esophageal epithelial cells, FENGHUISHENGWU, CL-0139); U251 (glioblastoma, Pricella, CL-0237) and Human Astrocyte cells (normal human astrocytes, Pricella, CP-H122); FaDu (hypopharyngeal squamous cell carcinoma, Pricella, CL-0083) and HOK (human oral keratinocytes, WANWUSHENGWU, Delf-16831); Caki-2 (clear cell renal cell carcinoma, Pricella, CL-0326) and HK-2 (human renal proximal tubular epithelial cells, Pricella, CL-0109); ACHN (metastatic renal adenocarcinoma, Pricella, CL-0021) and HK-2; HepG2 (hepatocellular carcinoma, Pricella, CL-0103) and THLE-2 (normal human liver cells, Pricella, CL-0833); A549 (lung adenocarcinoma, Pricella, CL-0016) and BEAS-2B (normal bronchial epithelial cells, SUNNCELL, SNL-203); H226 (lung squamous cell carcinoma,Pricella, CL-0396) and BEAS-2B; LNCaP (androgen-sensitive prostate cancer, Pricella, CL-0143) and RWPE-1 (normal prostate epithelial cells, Pricella, CL-0200); SW1463 (rectal squamous cell carcinoma, Pricella, CL-0742) and Human Rectal Mucosal Epithelial Cells (human intestinal epithelial cells, CP-H041); AGS (gastric adenocarcinoma, Pricella, CL-0022) and GES-1 (non-tumorigenic gastric epithelial cells, IMMOCELL, IM-H084); and A375 (cutaneous melanoma, Pricella, CL-0014) and NHEM (normal human epidermal melanocytes, Pricella, CP-H108). All cell lines were cultured in appropriate growth media recommended by the supplier, supplemented with 10% fetal bovine serum (FBS, Gibco, 26140079), and maintained at 37 °C in a humidified incubator with 5% CO 2 6 Pan-cancer immune infiltration analysis The immune infiltration analysis of TERT across pan-cancer data was performed using R (version 4.2.1) with the ggplot2 package (3.4.4). Spearman correlation analysis was performed between EGFR expression, immune cell infiltration, and other matrix data. For visualization, heatmaps were generated. Using the GSVA R package (1.46.0) and based on the single-sample gene set enrichment analysis (ssGSEA) algorithm, the infiltration of 24 kinds of immune cells was calculated. The immune cell markers used were obtained from the Immunity article (Bindea, Gabriela, et al., 2013), including aDC, B cells, CD8 T cells, Cytotoxic cells, DC, Eosinophils, iDC, Macrophages, Mast cells, Neutrophils, NK CD56bright cells, NK CD56dim cells, NK cells, pDC, T cells, T helper cells, Tcm, Tem, TFH, Tgd, Th1 cells, Th17 cells, Th2 cells, TReg in the tumor immune microenvironment. Diagnostic potential of TERT in pan-cancer The diagnostic value of TERT was evaluated using ROC curve analysis, with AUC values calculated to assess its ability to distinguish between cancer types. Results Positive correlation between telomere length and pan-cancer risk We first compiled GWAS datasets related to telomere length and pan-cancer risk (Fig. 1 1 1 1 3 1 1 Fig. 1 Positive Association Between Telomere Length and Pan-Cancer Risk. A B C D E F Table 3 Summary of heterogeneity and MR-PRESSO test results Exposure Outcome Heterogeneity tests (Q pval) Horizontal pleiotropy (pval) MR Egger IVW Egger_intercept Telomere length Pan-cancer 0.193 0.341 0.228 Pan-cancer Telomere length 0.730 0.852 0.447 Protein–protein interaction network identifies core telomere length related genes To elucidate mechanisms linking telomere length to pan-cancer pathogenesis, 121 SNPs were annotated using SNPense, identifying 143 protein-coding genes. A PPI network was constructed via the STRING database, followed by module screening using MCODE and cytoHubba (Fig. 2 TERT POT1 TRF1 TRF2 RTEL1 STN1 PARN 2 TERT 2 TERT Fig. 2 Protein–protein interaction network identifies core telomere length related genes. A B Enrichment analysis of telomere related genes Local network cluster enrichment analysis of the 143 genes (Fig. 2 3 3 3 3 3 Fig. 3 Enrichment analysis of telomere-related genes. A B C D E F Pan-cancer expression analysis and experimental verification of TERT In summary, the telomere-related gene TERT drives the core protein interaction network, participating in telomere maintenance, DNA repair, and cellular immortalization, thus potentially playing a key role in the development and progression of pan-cancer. Therefore, we examined the expression of this gene through the TCGA pan-cancer database (Fig. 4 P TERT 4 TERT TERT 4 TERT 5 TERT TERT r TERT TERT Fig. 4 Pan-cancer expression analysis and experimental verification of TERT. A B C *P 0.05, **P 0.01, ***P 0.0001 Fig. 5 Correlation analysis of immune cell infiltration. Asterisks (*) indicate statistically significant correlations (p < 0.05) Diagnostic potential of TERT in pan-cancer As shown in the Fig. 6 TERT TERT TERT TERT TERT Fig. 6 Diagnostic efficacy of TERT in 16 cancers. The dashed diagonal line represents the performance of a random classifier (AUC = 0.5) Discussion Recent studies have highlighted the role of telomere length as a biomarker for cancer aggressiveness, prognosis, and therapeutic response [ 28 6 2 14 TRF1 TRF2 POT1 TPP1 TIN2 RAP1 CTC1 STN1 TEN1, Our study demonstrates a significant positive correlation between telomere length and pan-cancer risk using Mendelian randomization analyses, consistent with previous findings that link telomere length to cancer risk. We identified a core protein–protein interaction network centered on TERT, which plays a crucial role in telomere maintenance and genomic stability. This aligns with existing research highlighting TERT's pivotal role in cancer development and progression. The enrichment analyses reveal that telomere-related genes are involved in key biological processes and molecular functions associated with carcinogenesis, such as telomere extension, DNA synthesis/repair, and cellular responses to DNA damage. These findings are supported by prior studies that have implicated telomere-related genes in cancer development. Pan-cancer expression analysis shows TERT's widespread overexpression in tumor tissues and its associations with immune cell infiltration, particularly Th2 cells, DCs, and macrophages. Given the central role of DCs in T cell priming and immune response regulation, TERT TERT TERT TERT 29 The diagnostic potential of TERT across various cancers, as indicated by ROC analysis, suggests its clinical utility as a molecular marker. This is consistent with studies that have explored TERT as a diagnostic and therapeutic target in specific cancers like gliomas. Telomere-associated TERT is highly expressed in a variety of tumors and is significantly associated with immune regulation. This finding provides a new rationale for cancer treatment strategies targeting TERT and its interacting proteins. While our study provides valuable insights into the relationship between telomere length and pan-cancer risk, several limitations should be acknowledged. First, the Mendelian randomization analyses rely on the assumption of pleiotropy, and although our sensitivity analyses suggested minimal pleiotropic bias, we cannot entirely rule out the possibility of unmeasured pleiotropic effects influencing the results. Second, the protein–protein interaction network and enrichment analyses are based on computational predictions and require further experimental validation to confirm the functional relevance of the identified genes and pathways. Third, the diagnostic potential of TERT identified through ROC analysis needs to be validated in independent cohorts and clinical settings. The importance of TERT was mainly determined by centrality algorithms, But centrality algorithm relies primarily on network topology and highly connected nodes, which does not necessarily equate to biological causal importance. Therefore, our future studies need to focus more on the biological validation of TERT. Future studies should focus on validation of TERT molecular mechanisms and clinical cohorts. Addressing these limitations in future research will help to further refine our understanding of telomere biology in cancer development and its clinical applications. Conclusion In conclusion, our study demonstrates a significant positive correlation between telomere length and pan-cancer risk using Mendelian randomization analyses. We identify a core protein–protein interaction network centered on TERT TERT TERT Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Jingwei Zhao, Jiayun Zhu and Kangle Zhu have contributed equally and consider as co-first authors. Author contributions JWZ, JYZ, and KLZ designed the research.JWZ, JYZ, KLZ, and MYW collected and analyzed the data. JWZ, JYZ, and KLZ performed the literature search. JWZ, JYZ, and KLZ drafted the article. WG, JDW, and SLL supervised the study. Funding This work was supported by the Young Scientists Fund of the National Natural Science Foundation of China (No. 82303289), and the Shanghai Sailing Program (No. 23YF1426000). Data availability The datasets generated during the current study are available in the IEU GWAS database ( https://gwas.mrcieu.ac.uk/ https://www.finngen.fi/en Declarations Ethics approval and consent to participate Not applicable. This study is based on publicly available datasets and does not involve human participants, animals, or tissue samples requiring ethical approval. Not applicable. Consent for publication All authors have read and approved the final manuscript and consent to its submission for publication. Competing interests The authors declare no competing interests. References 1. Takai H CST-polymerase α-primase solves a second telomere end-replication problem Nature 2024 627 8004 664 670 10.1038/s41586-024-07137-1 38418884 PMC11160940 Takai H, et al. CST-polymerase α-primase solves a second telomere end-replication problem. Nature. 2024;627(8004):664–70. 38418884 10.1038/s41586-024-07137-1 PMC11160940 2. Lingner J Cooper JP Cech TR Telomerase and DNA end replication: no longer a lagging strand problem? Science 1995 269 5230 1533 1534 10.1126/science.7545310 7545310 Lingner J, Cooper JP, Cech TR. Telomerase and DNA end replication: no longer a lagging strand problem? Science. 1995;269(5230):1533–4. 7545310 10.1126/science.7545310 3. Griffith JD Mammalian telomeres end in a large duplex loop Cell 1999 97 4 503 514 10.1016/S0092-8674(00)80760-6 10338214 Griffith JD, et al. Mammalian telomeres end in a large duplex loop. Cell. 1999;97(4):503–14. 10338214 10.1016/s0092-8674(00)80760-6 4. Bodnar AG Extension of life-span by introduction of telomerase into normal human cells Science 1998 279 5349 349 352 10.1126/science.279.5349.349 9454332 Bodnar AG, et al. Extension of life-span by introduction of telomerase into normal human cells. Science. 1998;279(5349):349–52. 9454332 10.1126/science.279.5349.349 5. Udroiu I On the correlation between telomere shortening rate and life span Proc Natl Acad Sci U S A 2020 117 5 2248 2249 10.1073/pnas.1920300117 31980517 PMC7007580 Udroiu I. On the correlation between telomere shortening rate and life span. Proc Natl Acad Sci U S A. 2020;117(5):2248–9. 31980517 10.1073/pnas.1920300117 PMC7007580 6. Morland F Early-life telomere length predicts life-history strategy and reproductive senescence in a threatened wild songbird Mol Ecol 2023 32 14 4031 4043 10.1111/mec.16981 37173827 PMC10947174 Morland F, et al. Early-life telomere length predicts life-history strategy and reproductive senescence in a threatened wild songbird. Mol Ecol. 2023;32(14):4031–43. 37173827 10.1111/mec.16981 PMC10947174 7. Shay JW Role of telomeres and telomerase in aging and cancer Cancer Discov 2016 6 6 584 593 10.1158/2159-8290.CD-16-0062 27029895 PMC4893918 Shay JW. Role of telomeres and telomerase in aging and cancer. Cancer Discov. 2016;6(6):584–93. 27029895 10.1158/2159-8290.CD-16-0062 PMC4893918 8. Lanna A Unexpected links between cancer and telomere state Semin Cancer Biol 2025 110 46 55 10.1016/j.semcancer.2025.01.006 39952372 Lanna A. Unexpected links between cancer and telomere state. Semin Cancer Biol. 2025;110:46–55. 39952372 10.1016/j.semcancer.2025.01.006 9. Gao J Pickett HA Targeting telomeres: advances in telomere maintenance mechanism-specific cancer therapies Nat Rev Cancer 2022 22 9 515 532 10.1038/s41568-022-00490-1 35790854 Gao J, Pickett HA. Targeting telomeres: advances in telomere maintenance mechanism-specific cancer therapies. Nat Rev Cancer. 2022;22(9):515–32. 35790854 10.1038/s41568-022-00490-1 10. Cheng F Diabetes, metabolic disease, and telomere length Lancet Diabetes Endocrinol 2021 9 2 117 126 10.1016/S2213-8587(20)30365-X 33248477 Cheng F, et al. Diabetes, metabolic disease, and telomere length. Lancet Diabetes Endocrinol. 2021;9(2):117–26. 33248477 10.1016/S2213-8587(20)30365-X 11. Maciejowski J de Lange T Telomeres in cancer: tumour suppression and genome instability Nat Rev Mol Cell Biol 2017 18 3 175 186 10.1038/nrm.2016.171 28096526 PMC5589191 Maciejowski J, de Lange T. Telomeres in cancer: tumour suppression and genome instability. Nat Rev Mol Cell Biol. 2017;18(3):175–86. 28096526 10.1038/nrm.2016.171 PMC5589191 12. Wu Z Qu J Liu GH Roles of chromatin and genome instability in cellular senescence and their relevance to ageing and related diseases Nat Rev Mol Cell Biol 2024 25 12 979 1000 10.1038/s41580-024-00775-3 39363000 Wu Z, Qu J, Liu GH. Roles of chromatin and genome instability in cellular senescence and their relevance to ageing and related diseases. Nat Rev Mol Cell Biol. 2024;25(12):979–1000. 39363000 10.1038/s41580-024-00775-3 13. Liu B Structure of active human telomerase with telomere shelterin protein TPP1 Nature 2022 604 7906 578 583 10.1038/s41586-022-04582-8 35418675 PMC9912816 Liu B, et al. Structure of active human telomerase with telomere shelterin protein TPP1. Nature. 2022;604(7906):578–83. 35418675 10.1038/s41586-022-04582-8 PMC9912816 14. Cai SW POT1 recruits and regulates CST-Polα/primase at human telomeres Cell 2024 187 14 3638 3651.e18 10.1016/j.cell.2024.05.002 38838667 PMC11246235 Cai SW, et al. POT1 recruits and regulates CST-Polα/primase at human telomeres. Cell. 2024;187(14):3638-3651.e18. 38838667 10.1016/j.cell.2024.05.002 PMC11246235 15. Braun H ZNF524 directly interacts with telomeric DNA and supports telomere integrity Nat Commun 2023 14 1 8252 10.1038/s41467-023-43397-7 38086788 PMC10716145 Braun H, et al. ZNF524 directly interacts with telomeric DNA and supports telomere integrity. Nat Commun. 2023;14(1):8252. 38086788 10.1038/s41467-023-43397-7 PMC10716145 16. Zhao J Genome-wide Mendelian randomization identifies putatively causal gut microbiota for multiple peptic ulcer diseases Front Immunol 2023 14 1260780 10.3389/fimmu.2023.1260780 37869000 PMC10586326 Zhao J, et al. Genome-wide Mendelian randomization identifies putatively causal gut microbiota for multiple peptic ulcer diseases. Front Immunol. 2023;14:1260780. 37869000 10.3389/fimmu.2023.1260780 PMC10586326 17. Hou Y Genetic proxy of lipid-lowering drugs and calcific aortic valve stenosis: a Mendelian randomization study Heliyon 2024 10 13 e34089 10.1016/j.heliyon.2024.e34089 39055828 PMC11269895 Hou Y, et al. Genetic proxy of lipid-lowering drugs and calcific aortic valve stenosis: a Mendelian randomization study. Heliyon. 2024;10(13):e34089. 39055828 10.1016/j.heliyon.2024.e34089 PMC11269895 18. Hou Y Association between regulatory T cells and ischemic heart disease: a Mendelian randomization study J Thorac Dis 2024 16 1 564 572 10.21037/jtd-23-1790 38410592 PMC10894418 Hou Y, et al. Association between regulatory T cells and ischemic heart disease: a Mendelian randomization study. J Thorac Dis. 2024;16(1):564–72. 38410592 10.21037/jtd-23-1790 PMC10894418 19. Wong CC Yu J Mapping the pancancer metastasis tumor microbiome Cell 2024 187 9 2126 2128 10.1016/j.cell.2024.03.040 38670070 Wong CC, Yu J. Mapping the pancancer metastasis tumor microbiome. Cell. 2024;187(9):2126–8. 38670070 10.1016/j.cell.2024.03.040 20. Wu Z A transcriptomic pan-cancer signature for survival prognostication and prediction of immunotherapy response based on endothelial senescence J Biomed Sci 2023 30 1 21 10.1186/s12929-023-00915-5 36978029 PMC10045484 Wu Z, et al. A transcriptomic pan-cancer signature for survival prognostication and prediction of immunotherapy response based on endothelial senescence. J Biomed Sci. 2023;30(1):21. 36978029 10.1186/s12929-023-00915-5 PMC10045484 21. Li J Pan-cancer integrative analyses dissect the remodeling of endothelial cells in human cancers Natl Sci Rev 2024 11 9 nwae231 10.1093/nsr/nwae231 39345334 PMC11429526 Li J, et al. Pan-cancer integrative analyses dissect the remodeling of endothelial cells in human cancers. Natl Sci Rev. 2024;11(9):nwae231. 39345334 10.1093/nsr/nwae231 PMC11429526 22. Zhu K Evidence based on Mendelian randomization: causal relationship between mitochondrial biological function and lung cancer and its subtypes Neoplasia 2023 46 100950 10.1016/j.neo.2023.100950 37976568 PMC10685044 Zhu K, et al. Evidence based on Mendelian randomization: causal relationship between mitochondrial biological function and lung cancer and its subtypes. Neoplasia. 2023;46:100950. 37976568 10.1016/j.neo.2023.100950 PMC10685044 23. Tan K Molecular insights into ulcerative colitis and orbital inflammation Sci Rep 2025 15 1 7130 10.1038/s41598-025-89344-y 40021664 PMC11871363 Tan K, et al. Molecular insights into ulcerative colitis and orbital inflammation. Sci Rep. 2025;15(1):7130. 40021664 10.1038/s41598-025-89344-y PMC11871363 24. Wang YX Unraveling the causal role of immune cells in gastrointestinal tract cancers: insights from a Mendelian randomization study Front Immunol 2024 15 1343512 10.3389/fimmu.2024.1343512 38533503 PMC10963466 Wang YX, et al. Unraveling the causal role of immune cells in gastrointestinal tract cancers: insights from a Mendelian randomization study. Front Immunol. 2024;15:1343512. 38533503 10.3389/fimmu.2024.1343512 PMC10963466 25. Kolberg L G:Profiler-interoperable web service for functional enrichment analysis and gene identifier mapping (2023 update) Nucleic Acids Res 2023 51 W1 W207 w212 10.1093/nar/gkad347 37144459 PMC10320099 Kolberg L, et al. G:Profiler-interoperable web service for functional enrichment analysis and gene identifier mapping (2023 update). Nucleic Acids Res. 2023;51(W1):W207-w212. 37144459 10.1093/nar/gkad347 PMC10320099 26. Peng Y Global trends and prospects in health economics of robotic surgery: a bibliometric analysis Int J Surg 2023 109 12 3896 3904 10.1097/JS9.0000000000000720 37720937 PMC10720792 Peng Y, et al. Global trends and prospects in health economics of robotic surgery: a bibliometric analysis. Int J Surg. 2023;109(12):3896–904. 37720937 10.1097/JS9.0000000000000720 PMC10720792 27. Yao Z Deciphering the multidimensional impact of IGFBP1 expression on cancer prognosis, genetic alterations, and cellular functionality: a comprehensive pan-cancer analysis Heliyon 2024 10 18 e37402 10.1016/j.heliyon.2024.e37402 39309809 PMC11416238 Yao Z, et al. Deciphering the multidimensional impact of IGFBP1 expression on cancer prognosis, genetic alterations, and cellular functionality: a comprehensive pan-cancer analysis. Heliyon. 2024;10(18):e37402. 39309809 10.1016/j.heliyon.2024.e37402 PMC11416238 28. Stone RC Telomere length and the cancer-atherosclerosis trade-off PLoS Genet 2016 12 7 e1006144 10.1371/journal.pgen.1006144 27386863 PMC4936693 Stone RC, et al. Telomere length and the cancer-atherosclerosis trade-off. PLoS Genet. 2016;12(7):e1006144. 27386863 10.1371/journal.pgen.1006144 PMC4936693 29. Xu X An association between elevated telomerase reverse transcriptase expression and the immune tolerance disruption of dendritic cells Cell Commun Signal 2024 22 1 284 10.1186/s12964-024-01650-6 38783329 PMC11112790 Xu X, et al. An association between elevated telomerase reverse transcriptase expression and the immune tolerance disruption of dendritic cells. Cell Commun Signal. 2024;22(1):284. 38783329 10.1186/s12964-024-01650-6 PMC11112790 ",
  "metadata": {
    "Title of this paper": "An association between elevated telomerase reverse transcriptase expression and the immune tolerance disruption of dendritic cells",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484439/"
  }
}