{
  "title": "Paper_113",
  "abstract": "pmc Commun Biol Commun Biol 3495 commbiol Communications Biology 2399-3642 Nature Publishing Group PMC12488886 PMC12488886.1 12488886 12488886 41034557 10.1038/s42003-025-08836-9 8836 1 Article Long non-coding RNAs as a biomarker for homologous recombination deficiency and parp inhibitor sensitivity in high-grade serous ovarian cancers http://orcid.org/0000-0002-9114-9913 Doberstein Kai kai.doberstein@medma.uni-heidelberg.de 1 2 Panther Johannes 1 Hahnen Eric 3 http://orcid.org/0000-0002-9233-5291 Richters Lisa 3 Schouten Philip C. 4 Harter Philipp 5 Heitz Florian 5 6 Kommoss Stefan 7 8 9 Berlit Sebastian 1 Tuschy Benjamin 1 Sütterlin Marc 1 2 http://orcid.org/0000-0002-6591-3367 Marmé Frederik 1 2 9 10 1 https://ror.org/05sxbyd35 grid.411778.c 0000 0001 2162 1728 Department of Obstetrics and Gynecology, Medical Faculty Mannheim of the Heidelberg University, University Medical Centre Mannheim, 2 https://ror.org/038t36y30 grid.7700.0 0000 0001 2190 4373 Mannheim Institute for Innate Immunoscience, Medical Faculty Mannheim of the Heidelberg University, 3 https://ror.org/05mxhda18 grid.411097.a 0000 0000 8852 305X Center for Familial Breast and Ovarian Cancer and Center for Integrated Oncology (CIO), Cologne, Faculty of Medicine and University Hospital Cologne, 4 https://ror.org/04v54gj93 grid.24029.3d 0000 0004 0383 8386 Department of histopathology, Addenbrooke’s Hospital, Cambridge University Hospitals NHS Foundation Trust, 5 https://ror.org/03v958f45 grid.461714.1 0000 0001 0006 4176 Department of Gynecology and Gynecologic Oncology, Evang. Kliniken Essen-Mitte, 6 https://ror.org/0493xsw21 grid.484013.a 0000 0004 6879 971X Department for Gynecology with the Center for Oncologic Surgery Charité Campus Virchow-Klinikum, Charité – Universitätsmedizin Berlin, corporate member of Freie Universität Berlin, Humboldt-Universität zu Berlin, and Berlin Institute of Health, 7 https://ror.org/03a1kwz48 grid.10392.39 0000 0001 2190 1447 Department of Women’s Health, Tübingen University Hospital, 8 9 https://ror.org/01kjfnp05 grid.491700.b AGO Study Group, 10 https://ror.org/05sxbyd35 grid.411778.c 0000 0001 2162 1728 DKFZ-Hector Cancer Institute at University Medical Center Mannheim, 1 10 2025 2025 8 478257 1410 16 12 2024 3 9 2025 01 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Homologous recombination deficiency (HRD) and sensitivity to PARP inhibitors are key determinants of therapeutic response in high-grade serous ovarian cancer (HGSC), yet predictive biomarkers beyond BRCA1/2 mutations or genomic HRD scores remain inadequate. Here, we investigate the potential of long non-coding RNAs (lncRNAs) as predictive markers of HRD and PARP inhibitor response. We identify a panel of lncRNAs that stratifies HGSC tumors by HRD status and drug sensitivity. Among these, ENSG00000272172.1 is significantly upregulated in HRD-positive tumors and is detectable in both formalin-fixed tissue and plasma, supporting its use as a minimally invasive biomarker. Functional analyses reveal that this lncRNA contributes to genome stability by modulating replication dynamics. These findings highlight a previously unrecognized role for lncRNAs in the HRD phenotype and suggest translational potential for ENSG00000272172.1 in guiding clinical decision-making. Long non-coding RNAs are identified as non-invasive biomarkers predicting homologous recombination deficiency and PARP inhibitor sensitivity in high-grade serous ovarian cancer, enabling improved precision oncology approaches. Subject terms Ovarian cancer Tumour biomarkers Long non-coding RNAs pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction HGSC of the fallopian tube, ovary, and peritoneum is a particularly lethal form of gynecologic malignancy 1 3 BRCA1 BRCA2 4 5 BRCA1/2 6 8 9 Due to synergistic mechanisms, PARPi are substantially more effective in cells that harbor deficiencies in HR 10 7 10 11 Predicting PARPi response in HGSC patients remains a significant challenge for clinicians, as the various mechanisms that can cause HRD make it difficult to predict response. Currently, two genome-based approaches are used clinically: (1) targeted capture-based next-generation sequencing (NGS) and (2) measurement of a so called HRD-score, which is based on the quantification of genomic alterations that are characteristic of genomic instability caused by defects in the HR pathway 12 LncRNAs are a class of RNA molecules longer than 500 nucleotides that are generally not thought to encode functional proteins. However, emerging evidence suggests that some lncRNAs may have coding potential, although the extent and biological significance of this remain to be fully defined. Recent studies have revealed that lncRNAs play important roles in a wide range of biological processes through their ability to interact with DNA, RNA, and proteins 13 14 15 16 When compared to mRNAs, lncRNAs have been characterized by their low evolutionary conservation, low expression levels, and high tissue specificity 17 18 19 22 LncRNAs can also be protected from degradation through interactions with RNA-binding proteins or localization in exosomes, making them potential biomarkers that can be detected in body fluids 23 30 31 33 In this study, we aimed to identify a panel of lncRNAs that could predict HRD and PARPi response in HGSC. We identified 29 lncRNAs that could predict the HR-score and PARPi7-score in ovarian cancer tissue of the TCGA dataset. Amongst these lncRNAs, ENSG00000272172.1 strongly correlated with BRCA Results Selecting lncRNAs to predict HRD and PARP inhibitor sensitivity The ability of cells to repair double-strand breaks via HR is an intrinsic mechanism that plays a central role in determining the response to PARPi. In this study, we investigated whether a panel of lncRNAs plays a role in HRD and is able to predict therapeutic response to PARPi in HGSCs. To identify a robust panel of relevant lncRNAs, we utilized different pre-calculated genomic scores, such as the genomic-based HRD-score, as well as expression-based scores such as the PARPi7 and eCARD, which were developed to predict drug responses based on mRNA expression data 34 35 CCNE1 BRCA1 CCNE1 36 1a–f CCNE1 CCNE1 1a CCNE1 1a Our results from the ovarian cancer dataset did not reproduce in the pan-cancer or breast cancer datasets (Supplementary Fig. 1c–f TP53 BRCA1/2 9 We aimed to identify a panel of lncRNAs with predictive value for CCNE1 amplification status, BRCA1/2 mutation status, eCARD-, HRD-, and PARPi7-scores (Fig. 1a 1b 1 Fig. 1 Selecting lncRNAs to predict HRD and PARP inhibitor sensitivity. a CCNE1 BRCA1/2 b c d e f In order to improve the robustness and reliability of the selected panel, we manually selected 29 lncRNAs that were identified by more than one method or that appeared in more than one feature extraction process. This approach ensured that the lncRNAs included were consistently predicted across multiple methods. Additionally, we incorporated lncRNAs that demonstrated high tumor expression or that were correlated with significant changes in patient survival, which provided further validation of their potential relevance. The final panel of 29 lncRNAs thus represents those most consistently predictive of the different outcomes, offering robustness in their potential as biomarkers for further investigation. To evaluate the potential protein-coding capacity of the 29 selected lncRNAs, we analyzed them using five independent computational tools; PRIDE reprocessing 2.0, Lee translation initiation site predictions, PhyloCSF, CPAT, and Bazzini small ORFs. Only three lncRNAs showed evidence of coding potential in one of the five tools, supporting the general classification of these transcripts as non-coding (Supplementary Table 2 Predicting HRD- and PARPi7-score When comparing the correlation of the 29 lncRNAs to different scores, we observed that about half of the lncRNAs clustered with a positive correlation to HRD scores and the other half with a negative correlation (Fig. 1c 1d R 1d 2a 35 37 1e R 1e 2b,c 2d These data indicate that lncRNAs from this panel could be useful for predicting HRD status or PARP inhibitor sensitivity. Since lncRNAs have been shown to have a unique tissue expression, we asked if the expression pattern of those 29 lncRNAs was unique in different cancer types 14 1f Distinct prognostic profiles revealed by lncRNA expression When analyzing the correlation between lncRNA expression and Reverse-Phase Protein Array (RPPA) data in the ovarian cancer TCGA data we observe a similar clustering of the lncRNAs as compared with the HR and HRD cluster in Fig. 1c 1c 3a Based on the expression profiles of the 29 lncRNAs, we identified six distinct clusters of patients within the ovarian TCGA dataset (Fig. 2a 3 3b 2b 3c and d Fig. 2 Clustering of patients revealed poor prognosis. a b a p c CCNE1 d Further analysis using a multivariate Cox proportional hazards model revealed that the clusters 3 (HR = 4.92, 95% CI: 2.26–10.70, p p 3d When analyzing the different characteristics of each cluster we found that cluster 1 best describes patients with high HRD- and PARPi7-score whereas cluster 3 represents patients with a low HRD- and PARPi7-scores (Fig. 2c CCNE1 CCNE1 3e, f 3g CCNE1 2d HDAC LncRNA expression and drug response in cell lines Next, we analyzed the expression of the 29 lncRNAs in different ovarian cancer cell lines. We therefore used the RNAseq dataset of the cancer cell line encyclopedia (CCLE) that was recently analyzed for HR-deficiency (Supplementary Table 4 38 BRCA1 3a 3b R p R p BRCA1 BRCA 3c 3d R p R p 3e Fig. 3 Cell line expression and drug response. a b c BRCA1 BRCA1 t d e f p g GAPDH h p We then used the available IC50 values from five PARP inhibitors: olaparib, rucaparib, talazoparib, veliparib, and niraparib, and calculated the pearson correlation coefficient for each lncRNA (Fig. 3f 3f In agreement with Takamatsu et al., who found that HRD-score and PARP inhibitor response are unrelated in the cancer cell line encyclopedia dataset, we did not identify lncRNAs that were correlated to both HRD-score and PARP inhibitor response 38 We then developed a real time PCR assay to quantify the lncRNAs in our cell lines under different treatment conditions. We used primer pairs for lncRNA that produced consistent ct values, melting curves and were detectable using real time PCR in different cell lines (Fig. 3g 3h 3h ENSG00000272172.1 expression is higher in HRD-positive patients We isolated RNA from FFPE sections that were derived from patients who were participating in the observational AGO-TR1 trial ( NCT02222883 5 39 4a 4b 4c p 4d 1e 4e p -7 40 42 Fig. 4 ENSG00000272172.1 is higher expressed in patients with HRD. a b t c t d a e f BRCA1/2 BRCA1 g BRCA2 h i j Additionally, ENSG00000272172.1 expression was also positively correlated with PARPi7-score (Pearson = 0.19, p p 4a 4b–d When analyzing the TCGA ovarian cancer dataset we observed that ENSG00000272172.1 was overexpressed in BRCA1 BRCA2 BRCA1 4f 43 BRCA1 BRCA2 BRCA2 BRCA2 4g p 4h p p ENSG00000272172.1 can be detected in the plasma of ovarian cancer patients To detect the ENSG00000272172.1 in low quantities patient plasma samples, we used the LNA technology probes (QuantiNova, Qiagen). Using 200 µl plasma for RNA isolation we were able to detect ENSG00000272172.1 in 20 out of 24 plasma samples by real time PCR (Plasma HIPO H059 cohort 1, Supplementary Table 5 n BRCA1 n BRCA1 n 4e BRCA1/2 n n 4i p 4j 5 n BRCA1/2 4f 4g In summary, our data suggests that ENSG00000272172.1 might be a useful biomarker to determine the HRD status in plasma or tissue of BRCA1/2 Loss of ENSG00000272172.1 increases DNA damage To elucidate the biological function of ENSG00000272172.1, we used a pool of three different siRNA to downregulate its expression (Fig. 5a 5a 5b 5c Fig. 5 Loss of the lncRNA ENSG00000272172.1 increases DNA damage. a GAPDH b n c d e BRCA1 f g h p i j BRCA1 t p p p p The knockdown led to an increase in DNA damage response, measured through an increase in nuclear phospho-yH2AX, RAD51, and RPA staining (Fig. 5d We then asked if the loss of ENSG00000272172.1 might sensitize cancer cells to PARPi, similarly to the loss of BRCA1 BRCA2 BRCA1 BRCA1 5e 5f, g In the next step, we analyzed changes in gene expression of a DNA damage gene panel, following the knock down of ENSG00000272172.1 (Fig. 5h RAD17 53BP1 FANCC MCM7 CDT1 MCM2, MCM7 CDT1 5i 5j Loss of ENSG00000272172.1 increases DNA replication speed An increase in replication speed can lead to replication stress and DNA damage 44 Since we observed changes in RECQL4 TRESLIN 6a 6a, b 6b 6c Fig. 6 Loss of ENSG00000272172.1 increases DNA replication speed and alters replication dynamics. a b a c d e d f t p p p p Two mechanisms can lead to an increase in replication speed: (1) An increase in the expression of proteins, such as TRESLIN, increases the replication speed directly. (2) The increase in replication speed counterbalances the reduction in the number of replication origins due to the increased interorigin distance. The cell thereby increases the probability of successfully replicating its genome during a single cell cycle. Previous research has established that ATR inhibitors (ATRi) trigger the activation of all dormant replication origins, thereby decreasing the inter-origin distance. ATRi (AZD6738, 1 µM) treatment resulted in a lower replication speed (Fig. 6d 6e Since licensing of replication origins is restricted to the G1-phase of the cell cycle to prevent re-replication and over-amplification, a shorter G1 phase provides less time for loading replication origins onto the DNA. Our results showed that siRNA knockdown of ENSG00000272172.1 resulted in a marked decrease in cells in the G1 phase and an increase in cells in the G2 phase of the cell cycle (Fig. 6f Discussion Targeted therapy has made significant advancements in recent years. A prime example is that patients with an inactive HR pathway are particularly sensitive to PARPi 4 5 45 46 47 BRCA1/2 48 BRCA1/2 BRCA1/2 The most frequently used approach to predicting PARPi response is to perform targeted hybrid capture and next-generation sequencing (NGS) technology to identify mutations in BRCA1/2 49 BRCA1 BRCA2 BRCA1 An alternative approach is to quantify genomic alterations that are characteristic for HR-deficient cells to calculate a HRD-score 50 51 The identification of biomarkers that predict PARP inhibitor response is clinically important. To address this, we aimed to identify a panel of lncRNAs that could predict PARP inhibitor response. We chose lncRNAs because previous studies have demonstrated that they are highly tissue-specific, relatively stable when released into the blood, and may have roles in DNA stability 17 18 For our initial analysis, we used The Cancer Genome Atlas datasets, as these are well-characterized and include different scores to predict HRD and drug sensitivity. We selected a panel of 29 lncRNAs from over 10,000 lncRNAs in the TCGA dataset. To identify a robust panel, we included genome-based and expression-based scores 9 34 36 We applied clustering methods and identified distinct molecular clusters with significantly different survival outcomes. These clusters also varied in CCNE1 CCNE1 CCNE1 Our study has several limitations, including the inability to validate the functional relevance of the 29 identified lncRNAs in an independent dataset. Additionally, we relied on precomputed genomic and transcriptomic scores to infer HRD status and PARPi sensitivity, both of which have known limitations. For instance, current HRD tests do not consistently predict treatment response, and many patients relapse despite being HRD-positive and receiving PARPi therapy. Future studies are needed to investigate the biological roles of these lncRNAs and evaluate their prognostic and predictive potential in independent patient cohorts. When analyzing the expression of the 29 lncRNAs in the cell line expression from the Cancer Cell Line Encyclopedia dataset, we neither observe a clustering of cell lines based on HRD-score nor on the BRCA1 inactivation status 52 BRCA1 BRCA1 38 The differences observed between cell line based analyses (CCLE) and tumor-derived (TCGA) results likely reflect biological and technical distinctions, including reduced heterogeneity, clonal selection, and altered microenvironmental context in cell lines, as well as disparities in RNA processing methods. Comparing the expression of three immortalized fallopian tube cell lines to a panel of ovarian cancer cell lines, we observed differential expression in three lncRNAs, but this did not reach significance. Notably, these lncRNAs included ENSG00000272172.1, which significantly correlated positively with the HRD-score in four independent datasets, including the TCGA public dataset, cell line CCLE dataset, and RNA that was isolated from paraffin tumor sections as well as from patient plasma. It is also important that the HRD scores in the datasets were generated using different methodologies, strengthening the notion of ENSG00000272172.1 as a robust biomarker for HRD. ENSG00000272172.1 was also higher expressed in germline and somatic BRCA1 BRCA2 BRCA1 BRCA1 BRCA2 The fact that we were able to detect lncRNA ENSG00000272172.1 in RNA formalin-fixed paraffin-embedded (FFPE) samples as well as plasma samples indicates a high stability of this lncRNA. This, together with its strong overexpression in HRD tumors, make it a promising biomarker to predict PARP inhibitor response. We acknowledge that the quantification of circulating lncRNAs remains a methodological challenge, primarily due to the absence of consensus on appropriate normalization strategies 31 It has to be determined how useful ENSG00000272172.1 could be used as an independent predictor or whether it is best used in combination with other markers. While we detected a strong correlation of ENSG00000272172.1 in plasma samples to the individual HRD-scores, we did not observe an increase in patients with a BRCA1 We also had no information of how many of those BRCA1 BRCA1 BRCA1 BRCA2 43 To our knowledge ENSG00000272172.1 (alternative name: RP13-582O9.7) has been described only in one publications: Ma et al. have shown its upregulation in hepatocellular cancer compared to normal tissue and its association with the Jun activation domain-binding protein 1(JAB1) expression 53 Our analysis also revealed a moderate positive correlation between 8q24 copy number alterations (CNA) and HRD status in the TCGA ovarian cancer cohort ( R Since ENSG00000272172.1 correlates with the HRD-score, PARPi7-score, and eCARD-score, we suspected that it might be involved or co-regulated with important DNA repair pathways. We found that the knockdown led to an upregulation of many DNA repair genes and downregulation of origin of replication genes. The increased replication speed, which was most likely responsible for the increase in DNA damage, was likely caused by the reduced number of replication origins. Recently, it was shown that olaparib accelerated the replication apparatus and led to increased replication fork collapse, which contributes to the synthetic lethal effects of olaparib in HR deficient patients 44 54 55 56 Our findings also suggest that HR-deficient cells might upregulate ENSG00000272172.1 as a means to stabilize the genome during replication stress. Future studies will need to elucidate the precise mechanisms by which ENSG00000272172.1 contributes to genome stability, including direct interactions with key replication proteins, cis- or trans-regulation of neighboring or distal genes (such as ZNF696 or DNA repair factors), and roles as a molecular scaffold or decoy, for example, acting as a microRNA sponge to fine-tune DNA damage response pathways. Overall, the findings can open potential avenues of research towards understanding how lncRNAs can impact DNA repair and replication processes, which could eventually lead to therapeutic targets for treating cancer. Recent studies have described mecanisms of other lncRNAs in regulating the DNA damage response and maintaining genomic integrity in cancer. Notably, NORAD was shown to stabilize the PUMILIO proteins, preventing degradation of mitotic and repair genes, with its loss causing chromosomal instability 57 58 59 60 61 62 The identified lncRNA biomarker ENSG00000272172.1 demonstrates significant promise for future clinical applications, as it was detectable not only in tumor tissue but also in plasma-derived RNA, underscoring its potential for non-invasive biomarker development. This opens potential avenues for liquid biopsy approaches, where monitoring lncRNA expression could complement or even replace more invasive tissue sampling methods. Moreover, our approach highlights the feasibility of computationally prioritizing and experimentally validating lncRNAs for their association with HRD status, offering a robust framework for discovering potential biomarkers. As PARP inhibitors gain broader clinical use, our findings support the potential development of a qPCR-based diagnostic assay that could stratify patients based on ENSG00000272172.1 expression. Such an assay would be particularly beneficial in clinical settings where genomic testing for BRCA mutations is either limited or inconclusive. Additionally, this approach could be extended to other cancers characterized by HRD phenotypes, such as triple-negative breast cancer and prostate cancer, broadening the impact of personalized cancer therapy. The utility of ENSG00000272172.1 as a predictive biomarker must be prospectively evaluated on larger patient cohorts and stratified for PARPi response. The measurement of ENSG00000272172.1 offers several advantages over current methods: (1) it can be measured using a simple real-time PCR; (2) it can be detected in low quantities in plasma samples; and (3) it can be measured in FFPE tissue samples. Further studies will also need to explore whether ENSG00000272172.1 levels in plasma reflect current HR status or past genomic events, including whether tumors that acquire PARPi resistance exhibit altered expression of this lncRNA. Such insights could guide treatment decisions in recurrent disease. Ultimately, further research and clinical trials are needed to determine the practicality and full utility of these findings. Methods Bioinformatics and data analysis The data from the TCGA Ovarian cancer cohort (dbGaP Study Accession: phs000178.v11.p8) were extracted and downloaded from the XENA portal of the University of California, Santa Cruz ( http://xena.ucsc.edu/ https://www.cbioportal.org 63 https://depmap.org 64 https://tanric.org/tanric/_design/basic/main.html 65 66 67 38 39 68 6 https://github.com/kaidob/lncRNA_HRD_PAPER_2025.git Selecting of lncRNA panel To identify lncRNAs predictive of key genomic and clinical outcomes, including CCNE1 2 Machine learning framework We developed machine learning models to predict HRD and PARPi7 scores in ovarian cancer using lncRNA expression profiles. A curated dataset filtered for ovarian cancer samples was used, with 29 previously identified lncRNAs selected as predictive features. Samples with missing values were excluded to ensure data quality. All analyses were conducted in R (v4.2.3) using the tidymodels framework. The dataset was split into training (60%), validation (20%), and test (20%) sets using stratified sampling based on HRD or PARPi7 scores. A consistent preprocessing pipeline was applied across all models. Each model underwent hyperparameter tuning via 10-fold cross-validation using grid search, optimizing for root mean squared error (RMSE). Model performance was evaluated using RMSE, mean absolute error (MAE), R Survival analysis Survival analyses were conducted using Kaplan–Meier estimation and Cox proportional hazards modeling to evaluate the prognostic significance of lncRNA expression groups. Kaplan–Meier survival curves were generated using the survfit function from the survival R package, stratified by lncRNA expression cluster or individual lncRNA expression, and statistical significance was assessed with the log-rank test. Survival curves and risk tables were visualized using the ggsurvplot function from the survminer package. For multivariate analysis, Cox proportional hazards models were constructed using the coxph function, adjusting for confounding variables such as age and tumor purity. Hazard ratios were extracted from the models, and the proportional hazards assumption was tested. Western blot and antibodies For western blotting, cells were lysed in RIPA buffer supplemented with protease inhibitors for 30 min on ice. Proteins content was quantified by Bradford assay (Bio-Rad). Twenty microgram proteins were analyzed through a 4–15% gradient SDS-PAGE before being transferred to the PVDF membrane with the TurboBlot system (Bio-Rad). The membrane was blocked with 5% (w/v) milk in TBS-tween for one hour at room temperature before incubating in primary antibody overnight at 4 °C. All antibodies are listed in Supplementary Table 7 Cell culture and cell lines The cell lines FT282, FT240, FT246, KURAMOCHI, OVKATE, COV318, and OVSAHO cells were a gift from Ronny Drapkin (UPenn, Philadelphia, USA). The establishment of the FT cell lines has been previously described in ref. 69 2 Short-interfering RNA transfection A pool of three short-interfering RNA (siRNA) duplexes was used to downregulate the expression of the lncRNA ENSG00000272172.1. The siRNA sequences CAUUGCGCACUGCACCAGUAAACAC, AGAGAACCCUAAGAAGACAGCAACA, and UGCACCAGUAAACACCUGAACACTC are targeting all three transcripts of ENSG00000272172.1. For the knock down of BRCA1 5 Cell survival Cell growth and survival were measured using a CellTiter 96® Non-Radioactive Cell Proliferation Assay at an absorbance of 570 nm using (Promega, Mannheim, Germany). Each assay was performed in triplicates and repeated at least 3 times. Data are presented by means ± SD. Statistical and significant differences were determined by ANOVA with post-hoc analysis. Cells were additionally stained with crystal violet to count the remaining attached cells. Immunofluorescence Cells were grown overnight on coverslips in 96-well Cell Imaging Plates (Eppendorf). After washing, cells were fixed in 4% (v/v) paraformaldehyde in PBS for 20 min at room temperature. Cells were permeabilized and blocked with a super-block buffer (Thermo Scientific) supplemented with 0.3% Triton X-100 for 10 min. Cells were incubated with primary antibodies (Table S7 7 Image analysis Quantification of nuclear foci and nuclear fluorescence intensity was performed using CellProfiler (Broad Institute), an open-source image analysis software. Custom analysis pipelines were developed to identify individual nuclei and quantify foci number, size, and total fluorescence intensity within each nucleus. For each experimental condition, we analyzed images acquired from at least three different fields of view per sample, ensuring representation across the slide. A minimum of 100 nuclei per biological replicate was quantified to provide statistically robust measurements and repeated at least three times. The full CellProfiler pipeline, including input settings, is publicly available at our GitHub repository: https://github.com/kaidob/lncRNA_HRD_PAPER_2025.git Fiber spread 1 × 105 cells per well were plated in each six-well. Seventy-two hours after treatment, cells were labeled with CIdU (38 µM) for 30 min, washed 3 times before medium containing 250 µM IdU was added for 30 min. Cells were trypsinized, washed, and re-suspended in 30 µl PBS. Directly on a glass slide, 2.5 µl cell suspension was mixed with 7.5 µl of lysis buffer (200 mM TrisHCl, pH 7.4, 50 mM EDTA, 0.5% SDS). Slides were tilted manually 45° to allow the drop to run slowly down the slide and air dried. The DNA was fixed in cold methanol/acetic acid (3:1 o/n) for 5 min. Rehydrated slides were denatured in 2.5 M HCl for 1 h. After washing the slides were blocked for 30 min in Superblock solution, following the incubation with the primary antibodies mouse anti-BrdU/IdU (1:100, BD Bioscience) and rat anti-BRDU/CIdU (1:200, Abcam), for overnight at 4 °C. After washing, slides were incubated with secondary fluorescent antibodies (anti-mouse alexa 488, 1:300, Molecular Probes, anti-rat Cy3, 1:300 Jackson ImmunoResearch) diluted in blocking solution for one hour. Slides were washed and air dried before mounted with coverslip and 20 µl Antifade Gold (Invitorgen). Fibers were examined using a DMRE, upright, Light Microscope Leica fluorescence microscope with a 100 × oil immersion objective, and analyzed using ImageJ software. Each assay at least 100 fibers were analyzed per condition and repeated at least 3 times. Cell cycle analysis Cells were incubated with 10 µM EdU for 20–30 min, washed with PBS, and fixed in 70% ethanol at −20°C for 1 h. After washing, EdU incorporation was detected using a click chemistry reaction (10 mM 6-Carboxyfluorescein-TEG-azide, 10 mM sodium ascorbate, 2 mM CuSO₄ in PBS) for 30 min in the dark. Cells were then washed and stained with 1 µg/mL DAPI. Fluorescence was measured on a BD FACS Canto II, acquiring 10,000 single cells per sample, and analyzed using FlowJo. Initial gating was performed on forward scatter (FSC) and side scatter (SSC) to exclude debris and select the main cell population. Next, doublets were excluded by plotting DAPI width (355–450/50 linear mode) against DAPI area, and gating on the singlet population to ensure only single nuclei were analyzed. S phase cells were identified via DAPI vs. EdU dot plots, and EdU intensity was exported for individual cells (Supplementary Fig. 5b n RNA isolation and real-time PCR Total RNA was isolated using the RNeasy Plus Mini Kit (Qiagen) according to the manufacturer’s protocol. RNA quantity and purity were assessed using a NanoDrop spectrophotometer. For each sample, 0.5 µg of RNA was reverse transcribed to cDNA using the RT² Easy First Strand Kit (Qiagen). Quantitative real-time PCR (qPCR) was carried out using the PowerUp SYBR Green Master Mix (Life Technologies) and gene-specific primers (Supplementary Table 8 For RNA isolation from plasma samples, whole blood was first centrifuged at 5000 rpm for 5 min, followed by a second centrifugation at 13,000 rpm for 5 min. RNA was extracted from 200 µL of plasma supernatant using the RNeasy Plasma Kit (Qiagen). Detection of lncRNA ENSG00000272172.1 in plasma was performed using the QuantiNova SYBR Green RT-PCR Kit (Qiagen, #208152) and the corresponding QuantiNova LNA PCR Assay (Qiagen, #249990). Plasma lncRNA expression levels were normalized to plasma input volume. Due to the limited amaRNA from formalin-fixed paraffin-embedded (FFPE) tissue sections was extracted using the RNeasy FFPE Kit (Qiagen) according to the manufacturer’s instructions. Crispr CAS9 OVCAR8 cells were seeded in a 24-well plate 24 h prior to transfection to 80% confluency. 3pmol of the Cas9 Nuclease and 3.9pmol of each BRCA2 BRCA2 Statistics and reproducibility Statistical analyses were performed using GraphPad Prism and R. For comparisons between two groups, we used unpaired two-tailed t All reported sample sizes ( n Ethics oversight This study did not involve animal subjects. Human samples were obtained from patients undergoing surgery at the University Medical Center Mannheim. Ethical approval for the use of these samples was granted by the Ethics Committee of the Medical Faculty Mannheim, Heidelberg University (approval number 2011-380N-MA). Informed consent was obtained from all participants prior to sample collection. All ethical regulations relevant to human research participants were followed. Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Description of Additional Supplementary Files Supplementary Data File 1 Supplementary Data File 2 Reporting Summary Publisher’s note Supplementary information The online version contains supplementary material available at 10.1038/s42003-025-08836-9. Acknowledgements We thank members of the Marmé/Doberstein lab and the department of gynecology, Mannheim for fruitful discussions and comments. We thank Stefanie Gaiser of the Marmé/Doberstein lab for her technical support. Author contributions K.D.: Conceptualization, methodology, validation, formal analysis, investigation, data curation, writing original draft, software, visualization, supervision, project administration, and funding acquisition. J.P.: Methodology and data curation. E.H., L.R., P.C.S., P.H., F.H., S.K., S.B., and B.T.: Investigation and resources. M.S.: Investigation, resources, and funding acquisition. F.M.: Investigation, resources, supervision, project administration, and funding acquisition. All authors reviewed and approved the final manuscript. Peer review Peer review information Communications Biology Funding Open Access funding enabled and organized by Projekt DEAL. Data availability All data used in this study are included in the Supplementary Data files or are publicly available through the TCGA and CCLE data portals. CCLE expression and drug sensitivity data are summarized in Supplementary Table 4 1 6 2 Code availability All custom code and scripts used for data analysis and figure generation in this study are openly available at https://github.com/kaidob/lncRNA_HRD_PAPER_2025.git Competing interests E.H. declares affiliations in various capacities with AstraZeneca, Roche, Tesaro, GSK, Clovis, amedes, ZaiLab, MSD, Immunogen, and AbbVie. P.C.S. declares employment by an AstraZeneca partner, as well as engagement in contract pathology work unrelated to the topic of the paper. Additionally, P.C.S. is a named inventor on the patent application “Methods for assessing homologous recombination deficiency in ovarian cancer cells” (WO2023031121, international publication date: March 9, 2023). P.L. is a shareholder and co-founder of VUS diagnostics BV (trading name VUS Genetics), unrelated to this work. L.R. received a travel accommodation grant from AstraZeneca in 2024. These disclosures do not influence the objectivity or conclusions of this work. The other authors declare no competing interests. References 1. Coburn SB Bray F Sherman ME Trabert B International patterns and trends in ovarian cancer incidence, overall and by histologic subtype Int. J. Cancer 2017 140 2451 2460 10.1002/ijc.30676 28257597 PMC5595147 Coburn, S. B., Bray, F., Sherman, M. E. & Trabert, B. International patterns and trends in ovarian cancer incidence, overall and by histologic subtype. Int. J. Cancer 140 28257597 10.1002/ijc.30676 PMC5595147 2. Sung, H. et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J. Clin 71 10.3322/caac.21660 33538338 3. Torre LA Islami F Siegel RL Ward EM Jemal A Global cancer in women: burden and trends Cancer Epidemiol. Biomark. Prev. 2017 26 444 457 10.1158/1055-9965.EPI-16-0858 28223433 Torre, L. A., Islami, F., Siegel, R. L., Ward, E. M. & Jemal, A. Global cancer in women: burden and trends. Cancer Epidemiol. Biomark. Prev. 26 10.1158/1055-9965.EPI-16-0858 28223433 4. Curtin NJ Szabo C Therapeutic applications of PARP inhibitors: anticancer therapy and beyond Mol. Asp. Med. 2013 34 1217 1256 10.1016/j.mam.2013.01.006 PMC3657315 23370117 Curtin, N. J. & Szabo, C. Therapeutic applications of PARP inhibitors: anticancer therapy and beyond. Mol. Asp. Med. 34 10.1016/j.mam.2013.01.006 PMC3657315 23370117 5. Curtin NJ Szabo C Poly(ADP-ribose) polymerase inhibition: past, present and future Nat. Rev. Drug Discov. 2020 19 711 736 10.1038/s41573-020-0076-6 32884152 Curtin, N. J. & Szabo, C. Poly(ADP-ribose) polymerase inhibition: past, present and future. Nat. Rev. Drug Discov. 19 32884152 10.1038/s41573-020-0076-6 6. Bryant HE Specific killing of BRCA2-deficient tumours with inhibitors of poly(ADP-ribose) polymerase Nature 2005 434 913 917 10.1038/nature03443 15829966 Bryant, H. E. et al. Specific killing of BRCA2-deficient tumours with inhibitors of poly(ADP-ribose) polymerase. Nature 434 15829966 10.1038/nature03443 7. Farmer H Targeting the DNA repair defect in BRCA mutant cells as a therapeutic strategy Nature 2005 434 917 921 10.1038/nature03445 15829967 Farmer, H. et al. Targeting the DNA repair defect in BRCA mutant cells as a therapeutic strategy. Nature 434 15829967 10.1038/nature03445 8. Mateo J A decade of clinical development of PARP inhibitors in perspective Ann. Oncol. 2019 30 1437 1447 10.1093/annonc/mdz192 31218365 PMC6771225 Mateo, J. et al. A decade of clinical development of PARP inhibitors in perspective. Ann. Oncol. 30 31218365 10.1093/annonc/mdz192 PMC6771225 9. Cancer Genome Atlas Research Network Integrated genomic analyses of ovarian carcinoma Nature 2011 474 609 615 10.1038/nature10166 21720365 PMC3163504 Cancer Genome Atlas Research Network Integrated genomic analyses of ovarian carcinoma. Nature 474 21720365 10.1038/nature10166 PMC3163504 10. Murai J Trapping of PARP1 and PARP2 by clinical PARP inhibitors Cancer Res 2012 72 5588 5599 10.1158/0008-5472.CAN-12-2753 23118055 PMC3528345 Murai, J. et al. Trapping of PARP1 and PARP2 by clinical PARP inhibitors. Cancer Res. 72 23118055 10.1158/0008-5472.CAN-12-2753 PMC3528345 11. Hanzlikova H The importance of Poly(ADP-Ribose) polymerase as a sensor of unligated Okazaki fragments during DNA replication Mol. Cell 2018 71 319 331.e3 10.1016/j.molcel.2018.06.004 29983321 PMC6060609 Hanzlikova, H. et al. The importance of Poly(ADP-Ribose) polymerase as a sensor of unligated Okazaki fragments during DNA replication. Mol. Cell 71 29983321 10.1016/j.molcel.2018.06.004 PMC6060609 12. Nguyen L Martens WMJ Van Hoeck A Cuppen E Pan-cancer landscape of homologous recombination deficiency Nat. Commun. 2020 11 5584 10.1038/s41467-020-19406-4 33149131 PMC7643118 Nguyen, L., Martens, W. M. J., Van Hoeck, A. & Cuppen, E. Pan-cancer landscape of homologous recombination deficiency. Nat. Commun. 11 33149131 10.1038/s41467-020-19406-4 PMC7643118 13. Quinn JJ Chang HY Unique features of long non-coding RNA biogenesis and function Nat. Rev. Genet. 2016 17 47 62 10.1038/nrg.2015.10 26666209 Quinn, J. J. & Chang, H. Y. Unique features of long non-coding RNA biogenesis and function. Nat. Rev. Genet. 17 26666209 10.1038/nrg.2015.10 14. Statello L Guo C-J Chen L-L Huarte M Gene regulation by long non-coding RNAs and its biological functions Nat. Rev. Mol. Cell Biol. 2021 22 96 118 10.1038/s41580-020-00315-9 33353982 PMC7754182 Statello, L., Guo, C.-J., Chen, L.-L. & Huarte, M. Gene regulation by long non-coding RNAs and its biological functions. Nat. Rev. Mol. Cell Biol. 22 33353982 10.1038/s41580-020-00315-9 PMC7754182 15. Cesana M A long noncoding RNA controls muscle differentiation by functioning as a competing endogenous RNA Cell 2011 147 358 369 10.1016/j.cell.2011.09.028 22000014 PMC3234495 Cesana, M. et al. A long noncoding RNA controls muscle differentiation by functioning as a competing endogenous RNA. Cell 147 22000014 10.1016/j.cell.2011.09.028 PMC3234495 16. Poliseno L A coding-independent function of gene and pseudogene mRNAs regulates tumour biology Nature 2010 465 1033 1038 10.1038/nature09144 20577206 PMC3206313 Poliseno, L. et al. A coding-independent function of gene and pseudogene mRNAs regulates tumour biology. Nature 465 20577206 10.1038/nature09144 PMC3206313 17. Necsulea A The evolution of lncRNA repertoires and expression patterns in tetrapods Nature 2014 505 635 640 10.1038/nature12943 24463510 Necsulea, A. et al. The evolution of lncRNA repertoires and expression patterns in tetrapods. Nature 505 24463510 10.1038/nature12943 18. Guttman M Chromatin signature reveals over a thousand highly conserved large non-coding RNAs in mammals Nature 2009 458 223 227 10.1038/nature07672 19182780 PMC2754849 Guttman, M. et al. Chromatin signature reveals over a thousand highly conserved large non-coding RNAs in mammals. Nature 458 19182780 10.1038/nature07672 PMC2754849 19. Huarte M A large intergenic noncoding RNA induced by p53 mediates global gene repression in the p53 response Cell 2010 142 409 419 10.1016/j.cell.2010.06.040 20673990 PMC2956184 Huarte, M. et al. A large intergenic noncoding RNA induced by p53 mediates global gene repression in the p53 response. Cell 142 20673990 10.1016/j.cell.2010.06.040 PMC2956184 20. Gupta RA Long non-coding RNA HOTAIR reprograms chromatin state to promote cancer metastasis Nature 2010 464 1071 1076 10.1038/nature08975 20393566 PMC3049919 Gupta, R. A. et al. Long non-coding RNA HOTAIR reprograms chromatin state to promote cancer metastasis. Nature 464 20393566 10.1038/nature08975 PMC3049919 21. Amit D Hochberg A Development of targeted therapy for a broad spectrum of cancers (pancreatic cancer, ovarian cancer, glioblastoma and HCC) mediated by a double promoter plasmid expressing diphtheria toxin under the control of H19 and IGF2-P4 regulatory sequences Int. J. Clin. Exp. Med. 2012 5 296 305 22993648 PMC3443897 Amit, D. & Hochberg, A. Development of targeted therapy for a broad spectrum of cancers (pancreatic cancer, ovarian cancer, glioblastoma and HCC) mediated by a double promoter plasmid expressing diphtheria toxin under the control of H19 and IGF2-P4 regulatory sequences. Int. J. Clin. Exp. Med. 5 22993648 PMC3443897 22. Mizrahi A Development of targeted therapy for ovarian cancer mediated by a plasmid expressing diphtheria toxin under the control of H19 regulatory sequences J. Transl. Med. 2009 7 69 10.1186/1479-5876-7-69 19656414 PMC2734756 Mizrahi, A. et al. Development of targeted therapy for ovarian cancer mediated by a plasmid expressing diphtheria toxin under the control of H19 regulatory sequences. J. Transl. Med. 7 19656414 10.1186/1479-5876-7-69 PMC2734756 23. Cabili MN Integrative annotation of human large intergenic noncoding RNAs reveals global properties and specific subclasses Genes Dev. 2011 25 1915 1927 10.1101/gad.17446611 21890647 PMC3185964 Cabili, M. N. et al. Integrative annotation of human large intergenic noncoding RNAs reveals global properties and specific subclasses. Genes Dev. 25 21890647 10.1101/gad.17446611 PMC3185964 24. Djebali S Landscape of transcription in human cells Nature 2012 489 101 108 10.1038/nature11233 22955620 PMC3684276 Djebali, S. et al. Landscape of transcription in human cells. Nature 489 22955620 10.1038/nature11233 PMC3684276 25. Hon C-C An atlas of human long non-coding RNAs with accurate 5’ ends Nature 2017 543 199 204 10.1038/nature21374 28241135 PMC6857182 Hon, C.-C. et al. An atlas of human long non-coding RNAs with accurate 5’ ends. Nature 543 28241135 10.1038/nature21374 PMC6857182 26. De Goede, O. M. et al. Population-scale tissue transcriptomics maps long non-coding RNAs to complex disease. Cell 10.1016/j.cell.2021.03.050 PMC8651477 33864768 27. Lin Y Leng Q Zhan M Jiang F A plasma long noncoding RNA signature for early detection of lung cancer Transl. Oncol. 2018 11 1225 1231 10.1016/j.tranon.2018.07.016 30098474 PMC6089091 Lin, Y., Leng, Q., Zhan, M. & Jiang, F. A plasma long noncoding RNA signature for early detection of lung cancer. Transl. Oncol. 11 30098474 10.1016/j.tranon.2018.07.016 PMC6089091 28. Gu Z Shen H-Q Fu P-H Chen M Screening of long non-coding RNAs markers in plasma of children with chronic gastritis Chronic Dis. Transl. Med. 2020 6 62 68 32226936 10.1016/j.cdtm.2020.01.001 PMC7096328 Gu, Z., Shen, H.-Q., Fu, P.-H. & Chen, M. Screening of long non-coding RNAs markers in plasma of children with chronic gastritis. Chronic Dis. Transl. Med. 6 32226936 10.1016/j.cdtm.2020.01.001 PMC7096328 29. Shi J The plasma lncRNA acting as fingerprint in hilar cholangiocarcinoma Cell. Physiol. Biochem. 2018 49 1694 1702 10.1159/000493613 30231247 Shi, J. et al. The plasma lncRNA acting as fingerprint in hilar cholangiocarcinoma. Cell. Physiol. Biochem. 49 30231247 10.1159/000493613 30. Hu D Plasma exosomal long non-coding RNAs serve as biomarkers for early detection of colorectal cancer Cell. Physiol. Biochem. 2018 51 2704 2715 10.1159/000495961 30562751 Hu, D. et al. Plasma exosomal long non-coding RNAs serve as biomarkers for early detection of colorectal cancer. Cell. Physiol. Biochem. 51 30562751 10.1159/000495961 31. Badowski C He B Garmire LX Blood-derived lncRNAs as biomarkers for cancer diagnosis: the Good, the Bad and the Beauty NPJ Precis. Oncol. 2022 6 40 10.1038/s41698-022-00283-7 35729321 PMC9213432 Badowski, C., He, B. & Garmire, L. X. Blood-derived lncRNAs as biomarkers for cancer diagnosis: the Good, the Bad and the Beauty. NPJ Precis. Oncol. 6 35729321 10.1038/s41698-022-00283-7 PMC9213432 32. Ji P MALAT-1, a novel noncoding RNA, and thymosin beta4 predict metastasis and survival in early-stage non-small cell lung cancer Oncogene 2003 22 8031 8041 10.1038/sj.onc.1206928 12970751 Ji, P. et al. MALAT-1, a novel noncoding RNA, and thymosin beta4 predict metastasis and survival in early-stage non-small cell lung cancer. Oncogene 22 12970751 10.1038/sj.onc.1206928 33. Neves AF Dias-Oliveira JDD Araújo TG Marangoni K Goulart LR Prostate cancer antigen 3 (PCA3) RNA detection in blood and tissue samples for prostate cancer diagnosis Clin. Chem. Lab. Med. 2013 51 881 887 10.1515/cclm-2012-0392 23241599 Neves, A. F., Dias-Oliveira, J. D. D., Araújo, T. G., Marangoni, K. & Goulart, L. R. Prostate cancer antigen 3 (PCA3) RNA detection in blood and tissue samples for prostate cancer diagnosis. Clin. Chem. Lab. Med. 51 23241599 10.1515/cclm-2012-0392 34. Zimmermann MT Jiang G Wang C Single-sample expression-based chemo-sensitivity score improves survival associations independently from genomic mutations for ovarian cancer Patients AMIA Jt Summits Transl. Sci. Proc. 2016 2016 94 100 27570657 PMC5001782 Zimmermann, M. T., Jiang, G. & Wang, C. Single-sample expression-based chemo-sensitivity score improves survival associations independently from genomic mutations for ovarian cancer Patients. AMIA Jt Summits Transl. Sci. Proc. 2016 27570657 PMC5001782 35. Daemen A Cross-platform pathway-based analysis identifies markers of response to the PARP inhibitor olaparib Breast Cancer Res. Treat. 2012 135 505 517 10.1007/s10549-012-2188-0 22875744 PMC3429780 Daemen, A. et al. Cross-platform pathway-based analysis identifies markers of response to the PARP inhibitor olaparib. Breast Cancer Res. Treat. 135 22875744 10.1007/s10549-012-2188-0 PMC3429780 36. Etemadmoghadam D Synthetic lethality between CCNE1 amplification and loss of BRCA1 Proc. Natl. Acad. Sci. USA 2013 110 19489 19494 10.1073/pnas.1314302110 24218601 PMC3845173 Etemadmoghadam, D. et al. Synthetic lethality between CCNE1 amplification and loss of BRCA1. Proc. Natl. Acad. Sci. USA 110 24218601 10.1073/pnas.1314302110 PMC3845173 37. Wolf DM DNA repair deficiency biomarkers and the 70-gene ultra-high risk signature as predictors of veliparib/carboplatin response in the I-SPY 2 breast cancer trial NPJ Breast Cancer 2017 3 31 10.1038/s41523-017-0025-7 28948212 PMC5572474 Wolf, D. M. et al. DNA repair deficiency biomarkers and the 70-gene ultra-high risk signature as predictors of veliparib/carboplatin response in the I-SPY 2 breast cancer trial. NPJ Breast Cancer 3 28948212 10.1038/s41523-017-0025-7 PMC5572474 38. Takamatsu S Murakami K Matsumura N Homologous recombination deficiency unrelated to platinum and PARP inhibitor response in cell line libraries Sci. Data 2024 11 171 10.1038/s41597-024-03018-4 38321018 PMC10847511 Takamatsu, S., Murakami, K. & Matsumura, N. Homologous recombination deficiency unrelated to platinum and PARP inhibitor response in cell line libraries. Sci. Data 11 38321018 10.1038/s41597-024-03018-4 PMC10847511 39. Schouten PC Ovarian cancer-specific BRCA-like copy-number aberration classifiers detect mutations associated with homologous recombination deficiency in the AGO-TR1 trial Clin. Cancer Res. 2021 27 6559 6569 10.1158/1078-0432.CCR-21-1673 34593530 PMC9401539 Schouten, P. C. et al. Ovarian cancer-specific BRCA-like copy-number aberration classifiers detect mutations associated with homologous recombination deficiency in the AGO-TR1 trial. Clin. Cancer Res. 27 34593530 10.1158/1078-0432.CCR-21-1673 PMC9401539 40. Telli ML Homologous Recombination Deficiency (HRD) score predicts response to platinum-containing neoadjuvant chemotherapy in patients with triple-negative breast cancer Clin. Cancer Res. 2016 22 3764 3773 10.1158/1078-0432.CCR-15-2477 26957554 PMC6773427 Telli, M. L. et al. Homologous Recombination Deficiency (HRD) score predicts response to platinum-containing neoadjuvant chemotherapy in patients with triple-negative breast cancer. Clin. Cancer Res. 22 26957554 10.1158/1078-0432.CCR-15-2477 PMC6773427 41. Timms KM Association of BRCA1/2 defects with genomic scores predictive of DNA damage repair deficiency among breast cancer subtypes Breast Cancer Res. 2014 16 475 10.1186/s13058-014-0475-x 25475740 PMC4308910 Timms, K. M. et al. Association of BRCA1/2 defects with genomic scores predictive of DNA damage repair deficiency among breast cancer subtypes. Breast Cancer Res. 16 25475740 10.1186/s13058-014-0475-x PMC4308910 42. Marquard AM Pan-cancer analysis of genomic scar signatures associated with homologous recombination deficiency suggests novel indications for existing cancer drugs Biomark. Res. 2015 3 9 10.1186/s40364-015-0033-4 26015868 PMC4443545 Marquard, A. M. et al. Pan-cancer analysis of genomic scar signatures associated with homologous recombination deficiency suggests novel indications for existing cancer drugs. Biomark. Res. 3 26015868 10.1186/s40364-015-0033-4 PMC4443545 43. Maxwell KN BRCA locus-specific loss of heterozygosity in germline BRCA1 and BRCA2 carriers Nat. Commun. 2017 8 319 10.1038/s41467-017-00388-9 28831036 PMC5567274 Maxwell, K. N. et al. BRCA locus-specific loss of heterozygosity in germline BRCA1 and BRCA2 carriers. Nat. Commun. 8 28831036 10.1038/s41467-017-00388-9 PMC5567274 44. Maya-Mendoza A High speed of fork progression induces DNA replication stress and genomic instability Nature 2018 559 279 284 10.1038/s41586-018-0261-5 29950726 Maya-Mendoza, A. et al. High speed of fork progression induces DNA replication stress and genomic instability. Nature 559 29950726 10.1038/s41586-018-0261-5 45. D’Andrea AD Mechanisms of PARP inhibitor sensitivity and resistance DNA Repair 2018 71 172 176 10.1016/j.dnarep.2018.08.021 30177437 D’Andrea, A. D. Mechanisms of PARP inhibitor sensitivity and resistance. DNA Repair 71 30177437 10.1016/j.dnarep.2018.08.021 46. Lord CJ Ashworth A PARP inhibitors: synthetic lethality in the clinic Science 2017 355 1152 1158 10.1126/science.aam7344 28302823 PMC6175050 Lord, C. J. & Ashworth, A. PARP inhibitors: synthetic lethality in the clinic. Science 355 28302823 10.1126/science.aam7344 PMC6175050 47. Foo T George A Banerjee S PARP inhibitors in ovarian cancer: an overview of the practice-changing trials Genes Chromosomes Cancer 2021 60 385 397 10.1002/gcc.22935 33382149 Foo, T., George, A. & Banerjee, S. PARP inhibitors in ovarian cancer: an overview of the practice-changing trials. Genes Chromosomes Cancer 60 33382149 10.1002/gcc.22935 48. González-Martín A Niraparib in patients with newly diagnosed advanced ovarian cancer N. Engl. J. Med. 2019 381 2391 2402 10.1056/NEJMoa1910962 31562799 González-Martín, A. et al. Niraparib in patients with newly diagnosed advanced ovarian cancer. N. Engl. J. Med. 381 31562799 10.1056/NEJMoa1910962 49. Morice P-M Identifying patients eligible for PARP inhibitor treatment: from NGS-based tests to 3D functional assays Br. J. Cancer 2021 125 7 14 10.1038/s41416-021-01295-z 33767416 PMC8257604 Morice, P.-M. et al. Identifying patients eligible for PARP inhibitor treatment: from NGS-based tests to 3D functional assays. Br. J. Cancer 125 33767416 10.1038/s41416-021-01295-z PMC8257604 50. Hoppe MM Sundar R Tan DSP Jeyasekharan AD Biomarkers for homologous recombination deficiency in cancer J. Natl Cancer Inst. 2018 110 704 713 10.1093/jnci/djy085 29788099 Hoppe, M. M., Sundar, R., Tan, D. S. P. & Jeyasekharan, A. D. Biomarkers for homologous recombination deficiency in cancer. J. Natl Cancer Inst. 110 29788099 10.1093/jnci/djy085 51. Banerjee SN Lord CJ First-line PARP inhibition in ovarian cancer - standard of care for all? Nat. Rev. Clin. Oncol. 2020 17 136 137 10.1038/s41571-020-0335-9 32051558 Banerjee, S. N. & Lord, C. J. First-line PARP inhibition in ovarian cancer - standard of care for all?. Nat. Rev. Clin. Oncol. 17 32051558 10.1038/s41571-020-0335-9 52. Barretina J The cancer cell line encyclopedia enables predictive modelling of anticancer drug sensitivity Nature 2012 483 603 607 10.1038/nature11003 22460905 PMC3320027 Barretina, J. et al. The cancer cell line encyclopedia enables predictive modelling of anticancer drug sensitivity. Nature 483 22460905 10.1038/nature11003 PMC3320027 53. Ma W Identification of a seven-long non-coding RNA signature associated with Jab1/CSN5 in predicting hepatocellular carcinoma Cell Death Discov. 2021 7 178 10.1038/s41420-021-00560-7 34247194 PMC8272716 Ma, W. et al. Identification of a seven-long non-coding RNA signature associated with Jab1/CSN5 in predicting hepatocellular carcinoma. Cell Death Discov. 7 34247194 10.1038/s41420-021-00560-7 PMC8272716 54. Moiseeva T ATR kinase inhibition induces unscheduled origin firing through a Cdc7-dependent association between GINS and And-1 Nat. Commun. 2017 8 1392 10.1038/s41467-017-01401-x 29123096 PMC5680267 Moiseeva, T. et al. ATR kinase inhibition induces unscheduled origin firing through a Cdc7-dependent association between GINS and And-1. Nat. Commun. 8 29123096 10.1038/s41467-017-01401-x PMC5680267 55. Ge XQ Jackson DA Blow JJ Dormant origins licensed by excess Mcm2-7 are required for human cells to survive replicative stress Genes Dev. 2007 21 3331 3341 10.1101/gad.457807 18079179 PMC2113033 Ge, X. Q., Jackson, D. A. & Blow, J. J. Dormant origins licensed by excess Mcm2-7 are required for human cells to survive replicative stress. Genes Dev. 21 18079179 10.1101/gad.457807 PMC2113033 56. Ibarra A Schwob E Méndez J Excess MCM proteins protect human cells from replicative stress by licensing backup origins of replication Proc. Natl. Acad. Sci. USA 2008 105 8956 8961 10.1073/pnas.0803978105 18579778 PMC2449346 Ibarra, A., Schwob, E. & Méndez, J. Excess MCM proteins protect human cells from replicative stress by licensing backup origins of replication. Proc. Natl. Acad. Sci. USA 105 18579778 10.1073/pnas.0803978105 PMC2449346 57. Lee S Noncoding RNA NORAD regulates genomic stability by sequestering PUMILIO proteins Cell 2016 164 69 80 10.1016/j.cell.2015.12.017 26724866 PMC4715682 Lee, S. et al. Noncoding RNA NORAD regulates genomic stability by sequestering PUMILIO proteins. Cell 164 26724866 10.1016/j.cell.2015.12.017 PMC4715682 58. Liu L Long non-coding RNA ANRIL promotes homologous recombination-mediated DNA repair by maintaining ATR protein stability to enhance cancer resistance Mol. Cancer 2021 20 94 10.1186/s12943-021-01382-y 34225755 PMC8256557 Liu, L. et al. Long non-coding RNA ANRIL promotes homologous recombination-mediated DNA repair by maintaining ATR protein stability to enhance cancer resistance. Mol. Cancer 20 34225755 10.1186/s12943-021-01382-y PMC8256557 59. Chen Y ATR-binding lncRNA ScaRNA2 promotes cancer resistance through facilitating efficient DNA end resection during homologous recombination repair J. Exp. Clin. Cancer Res. 2023 42 256 10.1186/s13046-023-02829-4 37775817 PMC10542231 Chen, Y. et al. ATR-binding lncRNA ScaRNA2 promotes cancer resistance through facilitating efficient DNA end resection during homologous recombination repair. J. Exp. Clin. Cancer Res. 42 37775817 10.1186/s13046-023-02829-4 PMC10542231 60. Prensner JR PCAT-1, a long noncoding RNA, regulates BRCA2 and controls homologous recombination in cancer Cancer Res. 2014 74 1651 1660 10.1158/0008-5472.CAN-13-3159 24473064 PMC4009928 Prensner, J. R. et al. PCAT-1, a long noncoding RNA, regulates BRCA2 and controls homologous recombination in cancer. Cancer Res. 74 24473064 10.1158/0008-5472.CAN-13-3159 PMC4009928 61. Sharma V A BRCA1-interacting lncRNA regulates homologous recombination EMBO Rep. 2015 16 1520 1534 10.15252/embr.201540437 26412854 PMC4641504 Sharma, V. et al. A BRCA1-interacting lncRNA regulates homologous recombination. EMBO Rep. 16 26412854 10.15252/embr.201540437 PMC4641504 62. Liu Y Liu G Targeting NEAT1 affects the sensitivity to parpi in serous ovarian cancer by regulating the homologous recombination repair pathway J. Cancer 2024 15 1397 1413 10.7150/jca.91896 38356722 PMC10861825 Liu, Y. & Liu, G. Targeting NEAT1 affects the sensitivity to parpi in serous ovarian cancer by regulating the homologous recombination repair pathway. J. Cancer 15 38356722 10.7150/jca.91896 PMC10861825 63. Goldman MJ Visualizing and interpreting cancer genomics data via the Xena platform Nat. Biotechnol. 2020 38 675 678 10.1038/s41587-020-0546-8 32444850 PMC7386072 Goldman, M. J. et al. Visualizing and interpreting cancer genomics data via the Xena platform. Nat. Biotechnol. 38 32444850 10.1038/s41587-020-0546-8 PMC7386072 64. Cancer Cell Line Encyclopedia Consortium & Genomics of Drug Sensitivity in Cancer Consortium. Pharmacogenomic agreement between two cancer cell line data sets. Nature 528 10.1038/nature15736 PMC6343827 26570998 65. Li J TANRIC: an interactive open platform to explore the function of lncRNAs in cancer Cancer Res. 2015 75 3728 3737 10.1158/0008-5472.CAN-15-0273 26208906 PMC4573884 Li, J. et al. TANRIC: an interactive open platform to explore the function of lncRNAs in cancer. Cancer Res. 75 26208906 10.1158/0008-5472.CAN-15-0273 PMC4573884 66. Knijnenburg TA Genomic and molecular landscape of DNA damage repair deficiency across the Cancer Genome Atlas Cell Rep. 2018 23 239 254.e6 10.1016/j.celrep.2018.03.076 29617664 PMC5961503 Knijnenburg, T. A. et al. Genomic and molecular landscape of DNA damage repair deficiency across the Cancer Genome Atlas. Cell Rep. 23 29617664 10.1016/j.celrep.2018.03.076 PMC5961503 67. Kraya AA PTEN loss and BRCA1 promoter hypermethylation negatively predict for immunogenicity in BRCA-deficient ovarian cancer JCO Precis. Oncol. 2022 6 e2100159 10.1200/PO.21.00159 35201851 PMC8982238 Kraya, A. A. et al. PTEN loss and BRCA1 promoter hypermethylation negatively predict for immunogenicity in BRCA-deficient ovarian cancer. JCO Precis. Oncol. 6 35201851 10.1200/PO.21.00159 PMC8982238 68. Gu Z Eils R Schlesner M Complex heatmaps reveal patterns and correlations in multidimensional genomic data Bioinformatics 2016 32 2847 2849 10.1093/bioinformatics/btw313 27207943 Gu, Z., Eils, R. & Schlesner, M. Complex heatmaps reveal patterns and correlations in multidimensional genomic data. Bioinformatics 32 27207943 10.1093/bioinformatics/btw313 69. Karst AM Cyclin E1 deregulation occurs early in secretory cell transformation to promote formation of fallopian tube-derived high-grade serous ovarian cancers Cancer Res. 2014 74 1141 1152 10.1158/0008-5472.CAN-13-2247 24366882 PMC4517944 Karst, A. M. et al. Cyclin E1 deregulation occurs early in secretory cell transformation to promote formation of fallopian tube-derived high-grade serous ovarian cancers. Cancer Res. 74 24366882 10.1158/0008-5472.CAN-13-2247 PMC4517944 ",
  "metadata": {
    "Title of this paper": "Cyclin E1 deregulation occurs early in secretory cell transformation to promote formation of fallopian tube-derived high-grade serous ovarian cancers",
    "Journal it was published in:": "Communications Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488886/"
  }
}