{
  "title": "Paper_833",
  "abstract": "pmc PLoS One PLoS One 440 plosone plos PLOS One 1932-6203 PLOS PMC12478893 PMC12478893.1 12478893 12478893 41021558 10.1371/journal.pone.0329774 PONE-D-25-22244 1 Research Article Medicine and Health Sciences Public and Occupational Health Physical Activity Medicine and Health Sciences Oncology Cancer Treatment Medicine and Health Sciences Public and Occupational Health Physical Activity Physical Fitness Exercise Medicine and Health Sciences Sports and Exercise Medicine Exercise Biology and Life Sciences Sports Science Sports and Exercise Medicine Exercise Medicine and Health Sciences Oncology Cancers and Neoplasms Breast Tumors Breast Cancer Medicine and Health Sciences Complementary and Alternative Medicine Exercise Therapy Medicine and Health Sciences Oncology Cancer Treatment Cancer Chemotherapy Medicine and Health Sciences Pharmaceutics Drug Therapy Chemotherapy Cancer Chemotherapy Medicine and Health Sciences Clinical Medicine Clinical Oncology Cancer Chemotherapy Medicine and Health Sciences Oncology Clinical Oncology Cancer Chemotherapy Biology and Life Sciences Physiology Biological Locomotion Walking Medicine and Health Sciences Public and Occupational Health Physical Activity Physical Fitness Exercise Aerobic Exercise Medicine and Health Sciences Sports and Exercise Medicine Exercise Aerobic Exercise Biology and Life Sciences Sports Science Sports and Exercise Medicine Exercise Aerobic Exercise Physical activity is associated with exercise capacity among patients undergoing chemotherapy: A pilot randomized controlled trial Physical activity in patients undergoing chemotherapy https://orcid.org/0009-0004-1182-9807 Antonucci Alexis Writing – original draft Writing – review & editing  1 * https://orcid.org/0000-0001-7318-3387 Lucas Alexander R. Conceptualization Investigation Supervision Writing – review & editing  2  3 * Costa Juliana Writing – review & editing  4 Norton Sam Writing – review & editing  4 Brubaker Peter Writing – review & editing  4 Mihalko Shannon Writing – review & editing  4 Marshall Alexandra Writing – review & editing  2 https://orcid.org/0000-0002-5363-6155 Via Jeremy Writing – review & editing  5 Franco R. Lee Writing – review & editing  5 Ladd Amy Writing – review & editing  2 Vaidya Rakhee Writing – review & editing  6 Yazbeck Victor Writing – review & editing  7 Wagner Lynne Writing – review & editing  8 Hundley W. Gregory Funding acquisition Writing – review & editing  2 1 School of Medicine, Virginia Commonwealth University, Richmond, Virginia, United States of America 2 Department of Internal Medicine, Division of Cardiology, Pauley Heart Center, Virginia Commonwealth University, Richmond, Virginia, United States of America 3 Department of Social and Behavioral Sciences, School of Public Health, Virginia Commonwealth University, Richmond, Virginia, United States of America 4 Department of Health and Exercise Science, Wake Forest University, Winston-Salem, North Carolina, United States of America 5 Department of Kinesiology and Health Sciences, Virginia Commonwealth University, Richmond, Virginia, United States of America 6 Department of Hematology and Oncology, Wake Forest University, Winston-Salem, North Carolina, United States of America 7 Department of Internal Medicine, Hematology/Oncology, Virginia Commonwealth University, Richmond, Virginia, United States of America 8 Department Health Policy and Management, University of North Carolina at Chapel Hill, Chapel Hill, North Carolina, United States of America Arora Esha Editor  Asian Institute of Medicine Science and Technology: AIMST University, MALAYSIA Competing Interests: * E-mail: antonucciag@vcu.edu Alexander.Lucas@vcuhealth.org 29 9 2025 2025 20 9 496058 e0329774 12 5 2025 14 7 2025 29 09 2025 30 09 2025 01 10 2025 © 2025 Antonucci et al 2025 Antonucci et al https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Introduction Exercise intolerance is common among cancer patients undergoing active treatments. We conducted a pilot study in patients receiving potentially cardiotoxic therapies to investigate the impact of participation in a 6-month physical activity intervention (PAI) versus a healthy lifestyle education control intervention (HLI) on accelerometer-derived measures of PA (steps/day or minutes of moderate to vigorous PA [MVPA]/week) and whether these measures were associated with submaximal exercise capacity (6-minute walk distance [6MWD]). Methods Participants with breast cancer or lymphoma (n = 33) were randomized (2:1) into PAI or HLI groups. Exercise training was patient-centered, tailored by treatment and functional status. Objective assessments of PA (steps/day, MVPA/week), and submaximal exercise capacity (6MWD) were completed at baseline, 3-, and 6-months. Descriptive statistics were used to examine changes in PA and 6MWD. T-tests were used to examine differences in 6MWD between groups at 3- and 6-months. Results At baseline, 27 participants in the PAI (n = 20) and HLI (n = 7) groups who completed baseline and at least 1 follow up visit, had a mean age of 53 (range: 23–76) vs 56 (range: 40–77) years, took on average 8,330 ± 2520 vs 7800 ± 3830 steps/day, did an average of 133 ± 44 vs 109 ± 87 minutes of MVPA/week, and had a mean 6MWD of 496 ± 94 vs 440 ± 18 meters, respectively. At 3- and 6-months there was a 87m and 76m difference in 6MWD by intervention group. A correlation analysis did find significant associations between steps/day (r = 0.51, p = .04) and 6MWD at 3-months. Conclusions Baseline data indicate that, on average, our study sample was close to meeting the PA guidelines. Unexpectedly, both groups maintained their activity levels up to 3- and 6-months. Submaximal exercise capacity (6MWD) was also maintained (with a clinically meaningful but not statistically significant relative benefit in the PAI) suggesting higher PA levels may associate with reduced exercise intolerance after anthracycline therapy. http://dx.doi.org/10.13039/100000054 National Cancer Institute NCI CA226960 Hundley W. Gregory The Physical Activity and Lymphoma Study was funded by the National Cancer Institute (NCI) grant CA226960 awarded to W. Gregory Hundley. The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Data Availability The dataset is publicly available at https://doi.org/10.5061/dryad.w6m905qzp Data Availability The dataset is publicly available at https://doi.org/10.5061/dryad.w6m905qzp Introduction Cardiotoxic cancer therapies, such as anthracyclines, are commonly used for the treatment of breast cancer and lymphoma. Exercise intolerance is a common complication of treatment among patients undergoing anthracycline-based chemotherapy. Individuals diagnosed with breast cancer, throughout the disease continuum, have a decreased cardiopulmonary function as measured by cardiopulmonary exercise testing (VO 2 1 Additionally, anthracycline-based chemotherapy can have cardiotoxic effects causing left-ventricular dysfunction, which can ultimately progress to congestive heart failure (CHF) [ 2 3 4 Given the potential benefits of exercise training during receipt of cardiotoxic therapies, we conducted a pilot study in adults with lymphoma or breast cancer who were receiving potentially cardiotoxic treatments to investigate the impact of a 6-month physical activity intervention (PAI) versus a healthy lifestyle education control intervention (HLI) on accelerometer-derived measures of physical activity (steps/day or minutes of moderate to vigorous physical activity [MVPA]/week) and whether these measures were associated with submaximal exercise capacity (6-minute walk distance [6MWD]). Steps per day were specifically analyzed due to their impact on cardiovascular health; a recent meta-analysis of 8 prospective studies showed that in adults sixty or older, walking more steps per day was associated with having lower cardiovascular disease risk [ 5 5 Materials and methods Study design/participant characteristics and recruitment From January 2019 to March 2022, we conducted a 6 month, 2-armed, randomized controlled (2:1) pilot-feasibility study: the Physical Activity and Lymphoma study (PALS) ( NCT01719562 In order to be considered eligible, participants had to meet the following inclusion criteria: (1) between 18 to 85 years of age, (2) diagnosed with stage I-IV Hodgkin’s or non-Hodgkin’s lymphoma, or stage I–III breast cancer, (3) expected to receive an anthracycline-based chemotherapeutic regimen or other potentially cardiotoxic cancer therapies (e.g. immuno-therapies or radiation), (4) ability to speak and understand English, (5) capacity to walk at last 2 city blocks (~0.2 miles) on a flat surface, and (6) expected to survive beyond 6 months. Individuals were excluded for having any of the following: (1) Uncontrolled hypertension (systolic blood pressure >190mmHg or diastolic blood pressure >100mmHg), (2) recent history of alcohol or drug abuse, (3) contraindications to magnetic resonance imaging (MRI), (4) claustrophobia, (5) pregnant, (6) unstable angina, (7) contraindications for exercise training or testing, (8) inability to exercise on a stationary cycle, (9) moving within 12 months of enrollment, and (10) inability to provide informed consent. Fig 1 10.1371/journal.pone.0329774.g001 Fig 1 PALS CONSORT Diagram. Note: Two (2) participants who discontinued the PAI intervention were included in analyses as they had data from baseline and one other visit available. One (1) participant who discontinued the HLI intervention only had baseline data available. Individuals were recruited at both study sites by the study’s oncologists or by a study team member via medical record review. Potential participants were interviewed to gauge interest, determine eligibility, and all participants provided written informed consent. Baseline testing was conducted as soon as possible after treatment initiation. Randomization took place following baseline testing. Fig 2 10.1371/journal.pone.0329774.g002 Fig 2 Study Schema. Participants with breast cancer or lymphoma (n = 33) were randomized (2:1) into 6-month physical activity intervention (PAI) or healthy lifestyle intervention (HLI) groups using a variably sized permuted block randomization devised by the study biostatistician and implemented through an online clinical trials management system. Both groups wore a tri-axial accelerometer, Actigraph wGT3X-BT, on their non-dominant wrist to capture physical activity. Physical Activity Intervention (PAI) and Healthy Living Intervention (HLI) The PAI was a patient-centered supervised- and/or home-based exercise training program that was tailored by treatment and functional status. In-person sessions occurred twice-weekly and were led by a clinical exercise physiologist. The PAI sessions were based on recommendations for cancer survivors from the American Cancer Society and were structured as follows: a slow (15 minute) aerobic warm up, 20 minutes of resistance training, 15 minutes of progressive intensity aerobic exercise (AE), and 10 minutes of cool-down by stretching/toning exercises. Home-based sessions, using PC or mobile devices connected to their wearable devices (i.e., Fitbit), were offered to participants unable to travel to in-person sessions and were tailored to their equipment and facilities. Due to the COVID-19 pandemic, the PAI underwent modifications that allowed participants to perform a home-based exercise training program. In-person and home-based interventions were offered once spaces reopened. The HLI aimed to provide information on healthy lifestyle habits through didactic 60-minute bi-weekly health workshops. Interactive sessions were conducted in-person and were transitioned to Zoom because of the COVID-19 pandemic. Sessions included review of past material and introduction to new material (10 mins), an interactive Healthy Living Presentation (40 mins), and ended with instructor-led stretching exercises (10 mins). With no evidence showing that these sessions would impact the primary outcome, the HLI group served as the control group. Study outcome measures The 6MWD served as a primary outcome of interest study in this study. It is a straightforward and easily attainable measure reflective of typical activities of daily living—a level of activity associated with functional independence, is highly correlated with peak exercise capacity and is an independent predictor of CV mortality [ 6 7 Data analysis Descriptive statistics were used to characterize the study sample. Our analytic dataset included data for 27 participants who had outcome data for at least 2 of 3 study visits. Missing data on key variables ranged between 0–28% for steps/day and MVPA mins/week, and 0–33% for 6MWD across the 3 study visits. We used a Shapiro-Wilk test to check for normality of distribution in 6MWD data by treatment group at each study timepoint and F-tests to examine homogeneity in variances prior to using an unpaired, 2-samples t-tests to examine differences in 6MWD between groups at 3- and 6-month visits. A post hoc correlational analysis examined the association between PA levels (steps/day or MVPA mins/week) and 6MWD at the 3- and 6-month timepoints in participants across both treatment arms. Results Baseline demographic and clinical characteristics are shown in Table 1 Table 2 Fig 3 p p 10.1371/journal.pone.0329774.t001 Table 1 Baseline demographic and clinical characteristics. Mean (Range or SD)/ N (%) PAI (N = 20) HLI (N = 7)  Age (years) 52.5 (23.0-76.0) 55.9 (40.0-77.0)  Race Black 3 (15.0%) 0 (0%) White 17 (85.0%) 5 (71.4%) Asian 0 (0%) 2 (28.6%)  Gender Female 14 (70.0%) 3 (42.9%) Male 6 (30.0%) 4 (57.1%) BMI (kg/m 2 26.3 (10.8, 40.3) 22.4 (11.3-32.0)  Diagnosis BC 7 (35.0%) 1 (14.3%) HL 4 (20.0%) 2 (28.6%) NHL 9 (45.0%) 4 (57.1%)  Time Since Diagnosis (weeks) 35.4 (3.0-465.0) 13.6 (9.0-18.0)  Time on Treatment (weeks) 9.65 (−21.0-66.0) 7.86 (2.0-15.0)  Received Anthracyclines No 4 (20.0%) 3 (42.9%) Yes 14 (70.0%) 4 (57.1%) Missing 2 (10.0%) 0 (0%) 10.1371/journal.pone.0329774.t002 Table 2 Physical activity, and exercise capacity by treatment arm and visit. Baseline 3 Months 6 Months PAI (N = 20) HLI (N = 7) PAI (N = 16) HLI (N = 7) PAI (N = 20) HLI (N = 6)  6-Minute Walk Distance (m) Mean (SD) 496 (94.3) 440 (18.4) 543 (90.6) 457 (77.0) 520 (73.5) 444 (100) Median [Min, Max] 510 [308, 602] 437 [416, 465] 576 [356, 659] 469 [378, 555] 532 [332, 630] 450 [325, 553] Missing 6 (30.0%) 2 (28.6%) 2 (12.5%) 0 (0%) 6 (30.0%) 2 (33.3%)  Steps/ day Mean (SD) 8330 (2520) 7800 (3830) 9910 (2320) 10500 (4440) 8340 (3340) 7440 (3210) Median [Min, Max] 8230 [4440, 14000] 8160 [1760, 11400] 9810 [5270, 13100] 12000 [5630, 15100] 8030 [1270, 15200] 7230 [4570, 12500] Missing 3 (15.0%) 2 (28.6%) 4 (25.0%) 2 (28.6%) 0 (0%) 1 (16.7%)  MVPA/ week Mean (SD) 133 (44.2) 109 (86.9) 159 (47.3) 156 (109) 132 (56.8) 105 (76.5) Median [Min, Max] 137 [66.8, 241] 135 [15.3, 226] 143 [78.1, 233] 186 [14.4, 267] 124 [20.8, 224] 101 [15.7, 212] Missing 3 (15.0%) 2 (28.6%) 4 (25.0%) 2 (28.6%) 0 (0%) 1 (16.7%) Note: 10.1371/journal.pone.0329774.g003 Fig 3 6-minute walk distance by treatment arm and visit. Adverse events One adverse event (AE; 2 participants) was registered as an unanticipated problem involving risks to subjects or others. This AE entailed a participant feeling nauseous and experiencing a headache after participating in an online kickboxing class provided by their local gym. The participant fully recovered within a span of 2 h. Another participant experienced a fall while walking their dog but they were not badly injured and continued with their participation in the intervention. Discussion In this study, we found that the PAI group and HLI group were already close to meeting physical activity guidelines (150 minutes of MVPA) at baseline. This finding is striking given that in 2020, the CDC reported that the prevalence of meeting physical activity guidelines during leisure time in the United States was only 52% for aerobic exercise, 35% for muscle-strengthening exercise, and 28% for both [ 8 Surprisingly, our study also found that on average, both groups maintained their activity levels (steps/day and MVPA mins/week) up to 3 months and the PAI group slightly increased their MVPA minutes (not steps/day) by 6 months. Again, based on our baseline data, this trend may be attributed to our study sample comprising initially active individuals who might have been further motivated to adopt healthy lifestyle habits due to the interventions they received. Participants likely also started feeling better after finishing treatment contributing to the slight increase in activity levels in both groups by 6 months. It is important to note that a study conducted by van der Schoot and colleagues analyzing the optimal timing of implementing an exercise intervention in cancer patients undergoing curative chemotherapy found that VO 2 9 10 11 Further, in both groups 6MWD was maintained. However, it is important to consider the minimal clinically important difference (MCID) when analyzing the data. The MCID represents the smallest change that makes a clinically notable and positive impact on the patient. For the 6-minute walk test, the MCID has been found to be 22–42 meters in individuals with lung cancer [ 12 13 14 15 Supporting information S1 File PALS CONSORT 2010 Checklist. (DOCX) We would like to thank the participants of this study, without whom this work would not be possible. References 1 Jones LW Courneya KS Mackey JR Muss HB Pituskin EN Scott JM Cardiopulmonary function and age-related decline across the breast cancer: survivorship continuum Journal of Clinical Oncology 2012 30 20 10.1200/JCO.2011.39.9014 PMC3397786 22614980 2 Volkova M Russell R Anthracycline cardiotoxicity: prevalence, pathogenesis and treatment Curr Cardiol Rev 2012 7 4 10.2174/157340311799960645 PMC3322439 22758622 3 Von Hoff DD Layard MW Basa P Davis HL Jr Von Hoff AL Rozencweig M et al Risk factors for doxorubicin-induced congestive heart failure Ann Intern Med 1979 91 5 710 7 doi: 10.7326/0003-4819-91-5-710 496103 4 Li H Liu H Wang B Jia X Yu J Zhang Y Exercise interventions for the prevention and treatment of anthracycline-induced cardiotoxicity in women with breast cancer: A systematic review Journal of Science in Sport and Exercise 2024 5 Paluch AE Bajpai S Ballin M Bassett DR Buford TW Carnethon MR et al Prospective Association of Daily Steps With Cardiovascular Disease: A Harmonized Meta-Analysis Circulation 2023 147 2 122 31 doi: 10.1161/CIRCULATIONAHA.122.061288 36537288 PMC9839547 6 Shawon MSR Hsu B Chard R Nicholson IA Elias VL Nicola LK et al Six-minute walk test distance at time of hospital discharge is strongly and independently associated with all-cause mortality following cardiac surgery Sci Rep 2024 14 1 2493 doi: 10.1038/s41598-024-52601-7 38291336 PMC10827724 7 Choi L Liu Z Matthews CE Buchowski MS Validation of accelerometer wear and nonwear time classification algorithm Med Sci Sports Exerc 2011 43 2 357 64 doi: 10.1249/MSS.0b013e3181ed61a3 20581716 PMC3184184 8 Abildso CG Daily SM Umstattd Meyer MR Perry CK Eyler A Prevalence of Meeting Aerobic, Muscle-Strengthening, and Combined Physical Activity Guidelines During Leisure Time Among Adults, by Rural-Urban Classification and Region—United States, 2020 MMWR Morb Mortal Wkly Rep 2023 72 4 10.15585/mmwr.mm7204a1 PMC9925130 36701252 9 van der Schoot GGF Ormel HL Westerink N-DL May AM Elias SG Hummel YM et al Optimal Timing of a Physical Exercise Intervention to Improve Cardiorespiratory Fitness: During or After Chemotherapy JACC CardioOncol 2022 4 4 491 503 doi: 10.1016/j.jaccao.2022.07.006 36444224 PMC9700259 10 Cesnik R Toohey K Freene N Kunstler B Semple S Physical activity levels in people with cancer undergoing chemotherapy: A systematic review Seminars in Oncology Nursing 2023 39 10.1016/j.soncn.2023.151435 37127520 11 Irwin ML Crumley D McTiernan A Bernstein L Baumgartner R Gilliland FD et al Physical activity levels before and after a diagnosis of breast carcinoma: the Health, Eating, Activity, and Lifestyle (HEAL) study Cancer 2003 97 7 1746 57 doi: 10.1002/cncr.11227 12655532 PMC3034406 12 Granger CL Holland AE Gordon IR Denehy L Minimal important difference of the 6-minute walk distance in lung cancer Chron Respir Dis 2015 12 2 146 54 doi: 10.1177/1479972315575715 25749346 13 Cantarero-Villanueva I Postigo-Martin P Granger CL Waterland J Galiano-Castillo N Denehy L The minimal clinically important difference in the treadmill six-minute walk test in active women with breast cancer during and after oncological treatments Disabil Rehabil 2023 45 5 871 8 doi: 10.1080/09638288.2022.2043461 35352996 14 Murphy AC Farouque O Koshy AN Yeo B Dick R Nadurata V Randomized Controlled Trial of a Smartphone-Based Intervention to Enhance 6-Minute Walk Distance during Breast Cancer Treatment: The SMART-BREAST Trial Circulation 2023 147 10.1161/CIRCULATIONAHA.122.062946 36342665 15 Migueles JH Cadenas-Sanchez C Ekelund U Delisle Nyström C Mora-Gonzalez J Löf M Accelerometer data collection and processing criteria to assess physical activity and other outcomes: a systematic review and practical considerations Sports Medicine 2017 47 10.1007/s40279-017-0716-0 PMC6231536 28303543 ",
  "metadata": {
    "Title of this paper": "Accelerometer data collection and processing criteria to assess physical activity and other outcomes: a systematic review and practical considerations",
    "Journal it was published in:": "PLOS One",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478893/"
  }
}