{
  "title": "Paper_1043",
  "abstract": "pmc Tob Use Insights Tob Use Insights 2690 tui TUI Tobacco Use Insights 1179-173X SAGE Publications PMC12475322 PMC12475322.1 12475322 12475322 41018526 10.1177/1179173X251377625 10.1177_1179173X251377625 1 Original Research Article Prevalence and Determinants of Tobacco Smoking Among University Students in Jordan: A Cross-Sectional Study https://orcid.org/0000-0001-8710-8249 Taha Hana 1 2 Al-Maayeh Ameen 3 Al Momani Noora 3 Natour Lana al 3 Abu Abboud Shahid 3 AlRamahi Abdel Rahman 1 Awamleh Suhib 1 https://orcid.org/0000-0002-3517-3601 Al-Ani Abdallah 4 Albsoul Rania Ali 1 Alkhaldi Sireen M. 1 Berggren Vanja 2 1 School of Medicine 54658 The University of Jordan 2 27106 Karolinska Institutet 3 34419 The Hashemite University 4 37559 King Hussein Cancer Center Hana Taha, Department of Family and Community Medicine, School of Medicine, The University of Jordan, Amman 11198, Jordan. Email: hanagh@yahoo.com 2025 26 9 2025 18 478954 1179173X251377625 2 6 2025 6 8 2025 26 8 2025 26 09 2025 28 09 2025 29 09 2025 © The Author(s) 2025 2025 SAGE Publications Ltd unless otherwise noted. Manuscript content on this site is licensed under Creative Commons Licenses https://creativecommons.org/licenses/by/4.0/ This article is distributed under the terms of the Creative Commons Attribution 4.0 License ( https://creativecommons.org/licenses/by/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Background Jordan has one of the highest rates of tobacco smokers worldwide. This study aims to assess the prevalence and the determinants of tobacco smoking among university students in Jordan, including sociodemographic and cultural factors as well as knowledge and attitudes towards smoking. Methods A cross-sectional study was conducted on a randomly selected sample of 763 university students from two public universities in Jordan (The Hashemite University and the University of Jordan) in 2024. The participants filled in a self-administered, structured paper questionnaire. The data was analyzed using descriptive and multivariate analysis by SPSS version 30. Statistical significance was set at P Results Of the 763 university students who participated in this study, 561 participants (73.5%) were identified as smokers. Gender, age, and nationality were all significantly associated with smoking. However, GPA was inversely correlated with smoking, as the lowest smoking rate was among participants with a GPA between 3.5 and 4. Stress and the number of close friends who smoke were both identified as significant factors associated with smoking. Even though most participants agreed that smoking is a serious health hazard, this was not significantly associated with the intention to stop smoking. Conclusion Our study revealed the widespread of smoking among Jordanian university students. We were able to identify multiple significant associations across sociodemographic, knowledge, and attitude factors. Targeted interventions in universities should prioritize smoking cessation programs, awareness campaigns, and academic stress management with a particular focus on addressing peer-driven smoking behaviors. smoking prevalence university students knowledge attitudes practices Jordan pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts10 cover-date January-December 2025 Introduction Smoking tobacco is a serious global public health problem and a significant cause of morbidity and mortality worldwide.  1  2  3  4  5  6 Smoking is a rising global concern, particularly in low- and middle-income countries (LMIC).  7  8  9  10 While the initiation of smoking starts before the age of 18, young adulthood is the period during which smoking increases in frequency, develops into a regular habit, and ultimately, lead to nicotine dependence.  11  12 11 12  13  14  15  16 16 17 Various studies emphasized the impact of close relations on smoking habits, with siblings, friends, and especially parents playing a substantial role as role models. As children and young adults tend to imitate grown-ups, parental smoking becomes a crucial determinant of youth smoking habits.  18  19 20 21 2 22 According to Jordan’s STEPwise non-communicable disease risk factor surveillance (STEPS) surveys, the proportion of males who smoke tobacco daily rose from 49.6% in 2007 to 58.0% in 2019, while the percentage of female daily smokers increased from 5.7% to 10.8% over the same period.  23 Methods Study Setting Jordan is a lower-middle-income country with a population of 11 million.  24 This study was conducted between January and March 2024 at two public universities in Jordan: the Hashemite University (HU) and the University of Jordan (UJ). HU is located in Zarqa governorate with 14 faculties and almost 29 600 students, UJ is located in Amman with 20 faculties and almost 47 000 students.  25 Study Design A quantitative descriptive cross-sectional study design was employed to investigate the prevalence, knowledge, attitudes, and determinants of smoking among university students in Jordan. The cross-sectional approach was appropriate for this study since it captures a precise snapshot at a particular point in time. Also, it is inexpensive, quick to implement, allows for the analysis of various variables, and provides baseline data for decision making and for further research. Ethical Considerations Ethical approval for this study was obtained from the Hashemite University (HU) Institutional Review Board (IRB) (No.2300941/707). Before offering the questionnaire to the students, the researchers explained the study aim and process. Those who agreed to participate gave written consent. Anonymity of participants was ensured, and the data was confidential. Participants had the right to withdraw from the study without explanation at any point throughout the data collection. Study Population Between January and March 2024, personal interviews were conducted with a random sample of 763 university students from both genders enrolled in UJ (396) and HU (367) to assess smoking prevalence, awareness, attitudes, and determinants. The minimum sample size was calculated using the EPI INFO STATCALC tool (version 7.2.6.0). At a 5% margin of error, 95% confidence level, and 50% response rate, the minimum required sample size was 382 participants. However, we recruited a random sample of 763 students to enhance the representation of the study population. The data was collected in face-to-face interviews. The potential participant reviewed the research information page of the questionnaire, and the investigator answered any questions. Following that, those who agreed to participate in the study were asked to sign a written consent. The inclusion criteria were university student aged 18 or above and willing to complete the questionnaire. The exclusion criteria included university students younger than 18 years old and those not willing to complete the questionnaire. Measurement Tool The data was collected from each participant individually using a structured questionnaire, which was developed based on existing literature, 26 29 supplemental material The demographic information domain included gender, age, nationality, faculty, academic year, academic performance (GPA), place of residence, monthly family income, number of family members, and marital status. The smoking behavior domain included smoking history, current smoking habits, age of initiation, types of tobacco used, attempts to quitting smoking, and smoking frequency. Smokers were categorized into “current smokers” and “non-smokers”. Current smokers were defined as those who smoked at least one form of tobacco/nicotine product once per day. Non-smokers were defined as those who do not consume any form of tobacco/nicotine products on daily, weekly, or monthly basis. Moreover, those who have abstained/quit smoking for more than 6 months, were also considered non-smokers. Smoking type (i.e., cigarettes, waterpipe, vape, etc.) was determined based on whether participants have ‘regularly’ used that smoking modality in the past month. The economic and behavioral influences domain concerned itself with exploring willingness to pay certain threshold for smoking products, self-perceived behavioral changes to price changes, current level of physical activity, and smoking behaviors under different conditions, such as stress or social situations. The psychosocial influences domain included social influences such as family and friends’ smoking habits, peer pressure, smoking in different scenarios, and the effect of stress, pleasure, and relief associated with smoking. Finally, the health perceptions and attitudes domain included attitudes towards smoking as a health hazard, knowledge of smoking risks, enjoyment of smoking, and perceptions of smoking’s impact on health, concentration, and alertness. Data Collection The data was collected from January to March 2024 by using a paper self-administered structured questionnaire. For the aforementioned period, affiliated researchers visited the campuses of both UJ and HU. Participants were chosen at random throughout the campuses and were invited to complete a questionnaire concerned with smoking perceptions and habits. Participants were recruited from outside lecture halls, gathering spots, food courts, and dorms. The researchers initiated the interaction by introducing themselves, clarifying the study objectives and relevance, while providing assurances regarding the confidentiality of participants’ input. Additionally, the researchers estimated the time required to complete the questionnaire. Subsequently, participants were respectfully asked about their inclination towards participation in the study, and those who agreed to participate gave written consent. Respondents were invited to pose any inquiries while filling in the questionnaire, all of which were comprehensively addressed by the researcher. Upon finishing answering the questionnaire, the participants were thanked for their cooperation. Statistical Analysis All data was analyzed using SPSS version 30.0.0. Descriptive statistics were utilized to showcase the data in the form of frequencies and percentages (n(%) for categorical variables and mean and standard deviations (mean ± SD) for continuous variables. Associations between categorical variables were explored using the Chi-squared test. In the case of small expected frequencies, the Fischer’s Exact Test was used. Variables measured on a 5-point Likert scale (e.g., perceptions and attitudes) were examined for differences in their means among categorical groups (i.e., current smokers and non-smokers) using the independent sample t-test. A P Results Participants’ Sociodemographic Characteristics A total of 763 participants were included in the study, primarily comprising 468 males (61.3%). The majority were single (739, 96.9%) and Jordanian (726, 95.2%). Participants were categorized into four age groups: 18-20 years, 20-22 years, 22-24 years, and above 25 years, with the largest proportion falling within the 20-22 age range (51.4%). In terms of academic performance, the participants who had a GPA classified as Good (2.5-3.0; 34.7%) or Very Good (3.0-3.5; 30.2%). A significant majority resided in the central region of Jordan (88.6%). Regarding faculty distribution, participants were mainly from human studies faculties (49.7%), followed by science (28.7%) and health studies (20.3%). More than half of the respondents were in their mid-years of study (years 3-4; 55.4%), while 36.3% were in their early years (years 1-2). Income levels varied, with 36.2% of participants reporting a lower income, followed by 26.1% in the lower-middle-income category and 22.8% in the high-income category. Of the total sample, 561 participants (73.5%) identified as smokers, while 202 (26.5%) were non-smokers. Gender was significantly associated with smoking status, as 85% of males were current smokers compared to 55.3% of females ( P P P Academic performance, measured by GPA, was inversely associated with smoking prevalence. Students with a GPA below 2.0 had the highest smoking rate (85.7%), while those with a GPA between 3.5 and 4.0 had the lowest (69.1%) ( P P P Table 1 Table 1. Sociodemographic Characteristics of Participants and Their Association With Smoking Status Variable Category Total N (Smokers) % (Smokers) X  2 P Gender Male 468 398 85.0% 82.49 <0.001 Female 295 163 55.3% Age 18-20 251 172 68.5% 12.31 0.015 20-22 392 288 73.5% 22-24 100 86 86.0% >25 20 15 75.0% Nationality Jordanian 726 539 74.2% 3.95 0.047 Other 37 22 59.5% Marital status Single 739 543 73.5% -- 0.310 Married 16 11 68.8% Other 8 7 87.5% Faculty Health studies faculties 155 106 68.4% 4.394 0.220 Human studies faculties 379 284 75.0% Science studies faculties 219 166 75.8% Graduate studies faculties 10 5 50.0% GPA <2 35 30 85.7% 13.65 0.010 2-2.5 138 109 79.0% 2.5-3 265 204 77.0% 3-3.5 231 153 66.2% 3.5-4 94 65 69.1% Year of study Early years (1-2) 277 190 68.6% 11.30 0.004 Mid years (3-4) 423 315 74.5% Advanced years (5-8) 63 56 88.9% Residence Central region 676 493 72.9% -- 0.490 Northern region 78 60 76.9% Southern region 9 8 88.9% Monthly income Lower income 276 187 67.8% 8.43 0.038 Lower-middle income 199 148 74.4% Upper-middle income 114 89 78.1% High income 174 137 78.7% We found that males heavily predominated the gender distribution, as we found that out of 561 smokers included in the sample, 71% of them were male, as shown in Figure 1 Figure 1. Smoking Status Stratified per Gender Smoking Behavior and Economic Factors Between current smokers, more than half (55.6%) stated smoking less than one pack per day, 37.1% smoked between one and two packs daily, and 7.3% consumed more than two packs per day. Concerning the type of smoking, 34.4% used mixed types, 26.4% smoked only cigarettes, 22.6% used only vape, and 16.5% smoked only hookah. Of the 263 mixed types users, 79.8% were current smokers. Similarly, of the 202 and 173 exclusively cigarette and vape users, 87.1% and 70.5% are current smokers, respectively. Only 41.3% of 126 exclusive waterpipe/hookah users were current smokers. Former attempts to quit smoking were reported by 59.9% of smokers, while 40.1% had not attempted to quit. The starting age for smoking was diverse, with 39% reported starting between 16 and 18 years, 22.6% after 18 years, and 15.4% between 12 and 14 years. In terms of weekly costs of cigarettes, 44.7% spent less than 10 JD (≈14.1 USD), 31.8% spent between 10 and 20 JD (≈14.1 – 28.21 USD), 17% spent 20 and 30 JD (≈28.21 – 42.31 USD), and 6.5% spent 30 and 40 JD (≈42.31 – 56.42 USD). When asked about the possible effect of a price doubling, 40.6% showed that they would continue smoking the same kind, 39% would smoke less, 15.2% would switch to a cheaper alternative, and 5.2% would smoke more. Physical activity levels among the participants were diverse, 28.7% reported no physical activity, 14 8% engaged in daily activity, and the remaining respondents reported engaging in physical activity between one and six days per week. Everyday situations associated with smoking included social situations with friends (63.8%), after eating (59.1%), during stressful situations (49.3%), and routinely throughout the day (42.5%) as shown in Table 2 Table 2. Smoking Behavior and Economic Influences Variable Category N % Packs per day Less than 1 424 55.6% 1 to 2 283 37.1% More than 2 56 7.3% Type of smoking Mixed types 262 34.4% Only cigarette 202 26.4% Only hookah 126 16.5% Only vape 173 22.6% Previous attempts to quit smoking Yes 457 59.9% No 306 40.1% First cigarette age Less than 10 35 4.6% 10 to 12 27 3.5% 12 to 14 118 15.4% 14 to 16 113 14.8% 16 to 18 297 39.0% More than 18 173 22.6% Price of cigarettes per week* Less than 10 JD 341 44.7% 10-20 JD 242 31.8% 20-30 JD 130 17.0% 30-40 JD 50 6.5% More than 40 JD 0 0.0% Doubling of price Smoke less 297 39.0% Smoke a cheaper alternative 116 15.2% Smoke the same kind 310 40.6% Smoke more 40 5.2% Physical activity None 219 28.7% 1 day per week 56 7.3% 2 days per week 83 10.8% 3 days per week 103 13.5% 4 days per week 97 12.7% 5 days per week 75 9.8% 6 days per week 17 2.2% Every day 113 14.8% Smoking scenarios After eating 452 59.1% Social scenarios with friends 488 63.8% Stressful scenarios 377 49.3% Routinely throughout the day 325 42.5% *1 JD is equivalent to 1.41 USD. Influence of Psychosocial Factors on Smoking Status A significant association was found between the belief in quitting smoking and smoking status ( P P Factors such as the impact of pleasure on smoking behavior and perceived relief from smoking both showed significant associations. Participants who reported higher pleasure or relief from smoking had the highest prevalence of smoking, 79.3% and 83.2%, respectively, both with ( P P P Factors such as willingness to accept help to quit smoking and smoking in the family (father, mother, siblings) did not show a statistically significant association with smoking status, as demonstrated in Table 3 Table 3. Association of Psychosocial Factors With Smoking Status Variable Category Total N (Smokers) % (Smokers) X  2 P Belief in quitting smoking is possible Low 201 168 83.2% 24.89 <0.001 Medium 184 145 78.8% High 378 248 65.4% Willingness to accept help to quit smoking Low 304 231 75.7% 2.78 0.250 Medium 123 93 75.6% High 336 237 70.3% Impact of stress on smoking behavior Low 197 143 72.6% 6.86 0.030 Medium 119 77 64.2% High 447 341 76.1% Impact of pleasure on smoking behavior Low 187 121 64.7% 17.20 <0.001 Medium 161 110 67.9% High 415 330 79.3% Perceived relief from smoking Low 190 112 58.9% 42.60 <0.001 Medium 187 127 67.6% High 386 322 83.2% Study concentration during smoking Low 283 163 57.4% 65.64 <0.001 Medium 131 98 74.8% High 349 300 86.0% Smoking in family Father 466 351 75.3% 2.86 0.230 Mother 166 121 72.8% 0.21 0.880 Siblings 390 281 72.1% 1.33 0.510 Smoking among close friends None 21 12 57.1% 16.29 <0.001 1-2 113 68 58.6% 3-4 629 481 76.3% Perception and Attitude towards Smoking Most participants agreed that smoking is a serious health hazard (Mean = 4.15, SD = 1.293). Perceptions of hazard did not significantly differ between current smokers and non-smokers (MD: 0.097; 95%CI: −0.110 – 0.305). Current smokers were significantly more likely to report higher perceptions of smoking enjoyment (MD: −0.571; 95%CI: −0.773 to −0.369) and pleasure (MD: −0.791; 95%CI: −1.020 to −0.561). Moreover, current smokers were significantly more likely to report that smoking helps with concentration (MD: −1.119; 95%CI: −1.351 to −0.886), provide alertness (MD: −0.850; 95%CI: −1.072 to −0.628), and reduces fatigue (MD: −0.701; 95%CI: −0.933 to −0.470). Furthermore, compared to non-smokers, current smokers were significantly more likely to smoke under stress (MD: −1.214; 95%CI: −1.443 to −0.985), have strong craving when abstaining for short periods (MD: −0.837; 95%CI: −1.063 to −0.611), and feel discomfort when running out of cigarettes (MD: −1.181; 95%CI: −1.418 to −0.945). Interestingly, social smoking was normalized across the cohort (Mean = 3.62, SD = 1.379). Similarly, there is consensus that smoking is considered part of the Jordanian cultural traditions (Mean = 3.32, SD = 1.569). Finally, the majority of the cohort disagreed that smoking is associated with attractiveness (Mean = 1.90, SD = 1.362) or maturity (Mean = 2.29, SD = 1.416). These perceptions did not significant differ between current and non-smokers. Additionally, both current and non-smokers believe that smoking does harm even when consumed in small amounts (Mean = 2.73, SD = 1.528) as presented in Table 4 Table 4. Perceptions and Attitudes Towards Smoking Perceptions and attitudes Overall Mean  a SD P Mean Difference  b Lower 95%CI Upper 95%CI Smoking is a serious health hazard 4.15 1.293 .359 0.097 −.110 .305 Enjoyment level of cigarette smoking 3.76 1.283  <.001 −0.571 −.773 −.369 Feeling more mature and Sophisticated when smoking 2.29 1.416 .061 −0.217 −.444 .010 Feeling more attracted to the opposite sex when smoking 1.90 1.362 .53 −0.070 −0.289 0.149 Definite pleasure when smoking 3.18 1.470  <.001 −0.791 −1.020 −0.561 Smoking more when worried 3.64 1.523  <.001 −1.214 −1.443 −0.985 Feeling lift and alert when smoking 3.15 1.434  <.001 −0.850 −1.072 −0.628 Smoking is perceived to help alleviate fatigue 2.66 1.476  <.001 −0.701 −0.933 −0.470 Smoking is perceived to aid in thinking and concentration 3.18 1.529  <.001 −1.119 −1.351 −0.886 Running out of cigarettes is perceived to cause significant discomfort 2.96 1.564  <.001 −1.181 −1.418 −0.945 The craving for cigarettes is perceived to be strong when forced to stop smoking for a period 3.39 1.451  <.001 −0.837 −1.063 −0.611 Smoking is perceived as a part of cultural traditions 3.32 1.569 .051 −0.251 −0.503 0.001 Smoking is considered to have minimal harm when consumed in small amounts 2.73 1.528 .609 0.064 −0.182 0.310 Smoking is perceived as socially acceptable 3.62 1.379 .653 −0.051 −0.273 0.171 a b Discussion This cross-sectional study was conducted in the Hashemite Kingdom of Jordan to identify sociodemographic, economic, and psychological factors that influence the tendency to smoke among university students and their impact on the students’ attitudes towards smoking. Our study revealed that 73.5% of participants were smokers, which is alarmingly high compared to previous studies. 23 30 The prevalence of smoking in our study is relatively higher among Jordanian university students for both males and females in comparison a 2014 report (i.e., 54.3% for males, 11.1% for females) and a 2008 report (i.e., 61.3% for males, 55.3% for females). 23 30  31  6  32 While the increase could be attributed to methodological differences between the already scarce Jordanian reports, it could be a sign that national tobacco control efforts are either ineffective or undermined. Jordan’s Public Health Law number 47 of 2008 prohibits smoking in public areas and bans tobacco advertising. Yet, these laws are lax and lack any form of real enforcement. From a social perspective, smoking is deeply rooted in the Jordanian culture. While an exact phenomological analysis is yet to be produced, an analysis of the Jordanian tobacco market shows that individuals, irrespective of gender, are willing to spend 2.13 to 2.15 JDs per pack while earning less than 250 JDs per month.  33  34 The burden of smoking being higher in males than females is also expected.  35  35  36  37  38 Our findings showed that the most common age for starting smoking was between 22 and 24 years old, which was against other reported studies which showed that university students often start early during their undergraduate years.  16 19 39 Khader and Alsadi (2008) showed that type of undergraduate school could be a predictor for stress and smoking.  23  40 In terms of psycho-social factors, studies have pointed out that smokers have close relations with other smokers, such as siblings, friends, and especially parents. Our study revealed that there is a strong association between smoking and the number of close friends who smoked, in which 76.3% of smokers reported they had 3 to 4 close friends who were smokers. Number of friends who smoke was observed as the most common risk factor linked to cigarette use in terms of both initiation and continuation; the impact of peer pressure is also strongly documented for abuse of a variety of substances including cannabis and alcohol. 41 42 On the other hand, across our cohort, parental smoking and number of smokers in the family members didn’t show any association with smoking behavior and nicotine dependence. This finding might appear contradictory to the greater body of literature; however, Waa et al, provides an alternative explanation of these findings.  43  44 Finally, we have demonstrated cognitive dissonance among our cohort of current smokers. Despite acknowledging the hazardous risk of smoking, even when consumed in small amounts, smokers in our cohort associated the act with pleasure, relief, and perceived withdrawal symptoms, such as stress and worry, when away from smoking. While psychological stress is deemed as a primary driver of smoking initiation, these cognitive signs could be a sign of substance use disorder.  45 Limitations Our results should be interpreted within the context of a number of limitations. The study employs a cross-sectional design within a very specific time frame. This could’ve resulted in missing responses from other sects of students not present within the cross-section. The design also limits our ability to pinpoint causative relationships between risk factors, sociodemographic characteristics, and smoking habits. Moreover, responses, due to resource availability, were extracted from two public universities only. Perceptions towards smoking and habits could be different within private institutions or other academic establishment representing the Jordanian student population away from the center. Due to the sample size and the varying sizes of faculties, certain groups may be under- or overrepresented, introducing potential selection bias. Another source of bias is that nicotine itself can act as a stressor  46 Conclusion We demonstrated an alarmingly high smoking prevalence among Jordanian university students. Such prevalence was significantly associated with a number of sociodemographic factors including male gender, older age, lower academic performance, and higher monthly income. From a psycho-social perspective, smokers were able to realize that smoking was a health hazard even in minute amounts; yet, they associate it with pleasure, relief, and perceive withdrawal symptoms such as stress and worry. These habits are augmented by the presence of like-minded peers, all of which highlights the serious role of social reinforcement in smoking initiation and continuation. Supplemental Material Supplemental Material - Prevalence and Determinants of Tobacco Smoking Among University Students in Jordan: A Cross-Sectional Study Supplemental Material for Prevalence and Determinants of Tobacco Smoking Among University Students in Jordan: A Cross-Sectional Study by Hana Taha, Ameen Al-Maayeh, Noora Al Momani, Lana al Natour, Shahid Abu Abboud, Abdel Rahman AlRamahi, Suhib Awamleh, Abdallah Al-Ani, Rania Ali Albsoul, Sireen M. Alkhaldi, Vanja Berggren in Tobacco Use Insights Authors’ Contributions: Funding: The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Supplemental Material: ORCID iDs Hana Taha https://orcid.org/0000-0001-8710-8249 Abdallah Al-Ani https://orcid.org/0000-0002-3517-3601 Ethical Considerations Ethical approval for this study was obtained from the Institutional Review Board (IRB) at Hashemite University (No.2300941/707). Consent to Participate The researchers administered the questionnaire to the students after explaining the study’s goal and the questionnaire’s content. Those who agreed to participate in the study were asked to sign a written consent. The participants had the right to withdraw from the study without explanation at any point throughout the data collection. Data Availability Statement The datasets used and analyzed during the current study are available from the corresponding author upon request. * References 1 Sadeghi F Alizadeh A Hosseinzadeh F Negarandeh R Prevalence of smoking among Iranian university students: a systematic review and meta-analysis BMC Public Health 2025 25 760 10.1186/s12889-025-21842-0 39994690 PMC11852886 2 Abdelraouf MMF Abdalla RAM Mohamed DMS et al. Prevalence of smoking and its associated factors among students of the University of Dongola, Northern State, Sudan: a cross-sectional study Ann Med Surg 2024 86 5 2543 2548 10.1097/MS9.0000000000001862 PMC11060252 38694294 3 World Health Organization Tobacco 2025 https://www.who.int/news-room/fact-sheets/detail/tobacco Accessed 30 July 2025. 4 Bryazka D Reitsma M Vollset SE Gakidou E Forecasting smoking deaths to 2050: a forecasting analysis for the global burden of disease study Popul Med 2023 5 Supplement e729 e744 10.18332/popmed/164605 5 Hansen MS Licaj I Braaten T Lund E Gram IT The fraction of lung cancer attributable to smoking in the Norwegian Women and Cancer (NOWAC) Study Br J Cancer 2021 124 3 658 662 10.1038/s41416-020-01131-w 33106583 PMC7851133 6 World Health Organization Tobacco or Health : A Global Status Report World Health Organization 1997 https://iris.who.int/handle/10665/41922 Accessed 30 July 2025. 7 Tauras JA Tobacco control in low-income and middle-income countries: findings from WHO FCTC investment cases Tob Control 2024 33 Suppl 1 s1 s2 10.1136/tc-2024-058717 38697657 PMC11103319 8 Ahmed R Osman H Faizo N et al. Factors influencing the initiation of smoking among Taif University students Med Sci 2021 25 112 1318 1325 9 Akl EA Jawad M Lam WY Co CN Obeid R Irani J Motives, beliefs and attitudes towards waterpipe tobacco smoking: a systematic review Harm Reduct J 2013 10 12 10.1186/1477-7517-10-12 23816366 PMC3706388 10 Joveini H Dehdari T Ardebili HE Mahmoudi M Firouzian AA Rohban A Factors associated with hookah smoking among university students Electron Physician 2016 8 12 3403 3408 10.19082/3403 28163855 PMC5279973 11 Campo L Lumia S Fustinoni S Assessing smoking habits, attitudes, knowledge, and needs among university students at the university of milan, Italy Int J Environ Res Public Health 2022 19 19 12527 10.3390/ijerph191912527 36231827 PMC9566438 12 Wamamili B Wallace-Bell M Richardson A Grace RC Coope P Cigarette smoking among university students aged 18–24 years in New Zealand: results of the first (baseline) of two national surveys BMJ Open 2019 9 12 e032590 10.1136/bmjopen-2019-032590 PMC6937031 31857310 13 Jenssen BP Walley SC SECTION ON TOBACCO CONTROL Section on tobacco control. E-Cigarettes and similar devices Pediatrics 2019 143 2 e20183652 10.1542/peds.2018-3652 30835247 PMC6644065 14 Bin Abdulrahman KA Alghamdi HA Alfaleh RS et al. Smoking habits among college students at a public university in Riyadh, Saudi Arabia Int J Environ Res Public Health 2022 19 18 11557 10.3390/ijerph191811557 36141829 PMC9517305 15 Nasser AMA Geng Y Al-Wesabi SA The prevalence of smoking (cigarette and waterpipe) among university students in some Arab countries: a systematic review Asian Pac J Cancer Prev 2020 21 3 583 591 10.31557/APJCP.2020.21.3.583 32212782 PMC7437327 16 Tucktuck M Ghandour R Abu-Rmeileh NME Waterpipe and cigarette tobacco smoking among Palestinian university students: a cross-sectional study BMC Public Health 2017 18 1 1 10.1186/s12889-017-4524-0 28693529 PMC5504745 17 Dalglish E McLaughlin D Dobson A Gartner C Cigarette availability and price in low and high socioeconomic areas Aust N Z J Public Health 2013 37 4 371 376 10.1111/1753-6405.12086 23895481 18 Saito J Shibanuma A Yasuoka J Kondo N Takagi D Jimba M Education and indoor smoking among parents who smoke: the mediating role of perceived social norms of smoking BMC Public Health 2018 18 1 211 10.1186/s12889-018-5082-9 29394912 PMC5797366 19 Mallol J Urrutia-Pereira M Mallol-Simmonds MJ Calderón-Rodríguez L Osses-Vergara F Matamala-Bezmalinovic A Prevalence and determinants of tobacco smoking among low-income Urban adolescents Pediatr Allergy Immunol Pulmonol 2021 34 2 60 67 10.1089/ped.2021.0018 34107753 PMC8329728 20 Alqahtani JS Aldhahir AM Alanazi Z et al. Impact of smoking status and nicotine dependence on academic performance of health sciences students Subst Abuse Rehabil 2023 14 13 24 10.2147/SAR.S393062 36865699 PMC9970882 21 Teixeira-da-Costa EIM Merino-Godoy Mde los A Almeida MMML Silva AMMC Nave FJGM Gender and tobacco consumption among university students Int J Environ Res Public Health 2022 19 22 14772 10.3390/ijerph192214772 36429490 PMC9690291 22 Perelman J Alves J Pfoertner T et al. The association between personal income and smoking among adolescents: a study in six European cities Addiction 2017 112 12 2248 2256 10.1111/add.13930 28667824 PMC5698771 23 Khader YS Alsadi AA Smoking habits among university students in Jordan: prevalence and associated factors East Mediterr Health J 2008 14 4 897 904 19166173 24 The World Bank Jordan World Bank 2025 https://www.worldbank.org/en/country/jordan Accessed 30 July 2025. 25 Ministry of Higher Education and Scientific Research The ministry of higher education recruitment committee announces, for the first time in the kingdom’s history, 51,647 international students enrolled in Jordanian higher education institutions - the ministry of higher education and scientific research 2024 https://mohe.gov.jo/EN//NewsDetails/51647_International_Students_Enrolled_in_Jordanian_Higher_Education_Institutions Accessed 30 July 2025. 26 Glover ED Nilsson F Westin Å Glover PN Laflin MT Persson B Developmental history of the Glover-Nilsson smoking behavioral questionnaire Am J Health Behav 2005 29 5 443 455 10.5993/AJHB.29.5.7 16201861 27 CDC National youth tobacco survey (NYTS) 2020 questionnaire 2020 https://stacks.cdc.gov/view/cdc/157796 Accessed 30 July 2025. 28 University of Waterloo About CSTADS/YSS | Tobacco Use in Canada University of Waterloo https://uwaterloo.ca/tobacco-use-canada/about/data-sources/about-cstadsyss Accessed July 30, 2025. 29 Center for Tobacco Independence Open-ended questions to use in discussing smoking 2018 https://ctimaine.org/wp-content/uploads/2018/09/Open-ended-Questions.pdf Published online 30 Obeidat SR Khabour OF Alzoubi KH et al. Prevalence, social acceptance, and awareness of waterpipe smoking among dental university students: a cross sectional survey conducted in Jordan BMC Res Notes 2014 7 832 10.1186/1756-0500-7-832 25421621 PMC4253988 31 Safi M al-Tahat J Jordan smoking rates highest in world amid claims of big tobacco interference The Guardian https://www.theguardian.com/world/2020/jun/23/jordan-smoking-rates-highest-in-world-amid-claims-of-big-tobacco-interference Published online June 2020. Accessed 2 December 2021. 32 Alkhatib NS Massad E Rashdan O et al. The economic impact of tobacco smoking and secondhand smoke exposure in Jordan: estimating the direct and indirect costs J Med Econ 2024 27 1 880 886 10.1080/13696998.2024.2373002 38923934 33 Al-Sheyab NA Khader YS Alyahya MS Iqbal MA An Analysis of the Tobacco Market in Jordan: A Household Survey Jordan University of Science and Technology 2025 https://www.economicsforhealth.org/files/research/991/jordan-pack-survey-report-final-30-04-2025.pdf 34 Economic Forum J Economics of smoking in Jordan Jordan Economic Forum 2024 https://www.jordaneconomicforum.com/wp-content/uploads/2024/07/%D8%A7%D9%82%D8%AA%D8%B5%D8%A7%D8%AF%D9%8A%D8%A7%D8%AA-%D8%A7%D9%84%D8%AA%D8%AF%D8%AE%D9%8A%D9%86-%D9%81%D9%8A-%D8%A7%D9%84%D8%A3%D8%B1%D8%AF%D9%86-final-1.pdf 35 Hossain S Hossain S Ahmed F Islam R Sikder T Rahman A Prevalence of tobacco smoking and factors associated with the initiation of smoking among university students in Dhaka, Bangladesh Cent Asian J Glob Health 2017 6 1 244 10.5195/cajgh.2017.244 29138736 PMC5675390 36 Kodriati N Pursell L Hayati EN A scoping review of men, masculinities, and smoking behavior: the importance of settings Glob Health Action 2019 11 Suppl 3 1589763 10.1080/16549716.2019.1589763 PMC6461072 30963822 37 Flandorfer P Wegner C Buber I Gender roles and smoking behaviour VID 2021 1 1 25 10.1553/0x003d08ea 38 Haddad LG Malak MZ Smoking habits and attitudes towards smoking among university students in Jordan Int J Nurs Stud 2002 39 8 793 802 10.1016/s0020-7489(02)00016-0 12379297 39 Morrell HER Song AV Halpern-Felsher BL Earlier age of smoking initiation may not predict heavier cigarette consumption in later adolescence Prev Sci 2011 12 3 247 254 10.1007/s11121-011-0209-6 21384136 PMC3152718 40 Alkhalaf M Suwyadi A AlShamakhi E et al. Determinants and prevalence of tobacco smoking among medical students at Jazan university, Saudi Arabia J Smok Cessat 2021 2021 6632379 10.1155/2021/6632379 34306226 PMC8279191 41 Keyzers A Lee SK Dworkin J Peer pressure and substance use in emerging adulthood: a latent profile analysis Subst Use Misuse 2020 55 10 1716 1723 10.1080/10826084.2020.1759642 32400279 42 Leshargie CT Alebel A Kibret GD et al. The impact of peer pressure on cigarette smoking among high school and university students in Ethiopia: a systemic review and meta-analysis PLoS One 2019 14 10 e0222572 10.1371/journal.pone.0222572 31603930 PMC6788683 43 Waa A Edwards R Newcombe R et al. Parental behaviours, but not parental smoking, influence current smoking and smoking susceptibility among 14 and 15 year‐old children Aust N Z J Public Health 2011 35 6 530 536 10.1111/j.1753-6405.2011.00772.x 22151159 44 West P Sweeting H Ecob R Family and friends’ influences on the uptake of regular smoking from mid-adolescence to early adulthood Addiction 1999 94 9 1397 1411 10.1046/j.1360-0443.1999.949139711.x 10615724 45 Barry DT Oberleitner DE Beitel M et al. A student walks into class … vignettes to identify substance use disorder models of illness among college students Subst Use Misuse 2022 57 10 1523 1533 10.1080/10826084.2022.2091787 35787230 46 Parrott AC Murphy RS Explaining the stress-inducing effects of nicotine to cigarette smokers Hum Psychopharmacol 2012 27 2 150 155 10.1002/hup.1247 22389079 ",
  "metadata": {
    "Title of this paper": "Explaining the stress-inducing effects of nicotine to cigarette smokers",
    "Journal it was published in:": "Tobacco Use Insights",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475322/"
  }
}