{
  "title": "Paper_170",
  "abstract": "pmc Saf Health Work Saf Health Work 1859 shaw Safety and Health at Work 2093-7911 2093-7997 Occupational Safety and Health Research Institute PMC12490614 PMC12490614.1 12490614 12490614 10.1016/j.shaw.2025.05.007 S2093-7911(25)00038-1 1 Original Article Development of Korean CARcinogen EXposure: IARC Group 2A Carcinogens Koh Dong-Hee koh.donghee@gmail.com 1 ⁎ Choi Sangjun 2 3 Park Ju-Hyun 4 Lee Sang-Gil 5 Kim Hwan-Cheol 6 Kim Inah 7 Min Jeehee 8 Kim Yujin 5 Lee Jihye 5 Park Dong-Uk 9 1 2 3 4 5 6 7 8 9 ⁎ koh.donghee@gmail.com 9 2025 29 5 2025 16 3 498203 303 309 15 1 2025 12 5 2025 25 5 2025 29 05 2025 03 10 2025 03 10 2025 © 2025 Occupational Safety and Health Research Institute. Published by Elsevier B.V. on behalf of Institute, Occupational Safety and Health Research Institute, Korea Occupational Safety and Health Agency. 2025 Occupational Safety and Health Research Institute https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Backgrounds Reliable exposure data are critical for occupational cancer prevention and epidemiological studies. We developed the Korean CARcinogen EXposure (K-CAREX) to provide exposure prevalence and intensity for 20 carcinogens classified as Group 1 by the International Agency for Research on Cancer (IARC). This study extends K-CAREX to include IARC Group 2A agents. Methods National data sources, including the Work Environment Measurement Database (WEMD), Special Health Examination Database (SHED), and Work Environment Condition Survey (WECS), provided basic exposure data. A stepwise estimation approach was employed to refine exposure prevalence estimates by industry, derived from the WEMD, SHED, and WECS. WEMD was used to estimate exposure intensity by industry, whereas SHED was used to assess exposure prevalence by occupation. Matched data, representing workers who wore samplers and underwent health examinations for the same carcinogen in the same year, were used to estimate exposure intensity by occupation. Results A total of 18 IARC Group 2A agents were included. Exposure prevalence was estimated for all 18 carcinogens by industry, and exposure intensity was estimated for 16. The number of exposed workers was estimated, with 162,153 workers exposed to lead, for example. Exposure prevalence and intensity were also assessed for 18 and 16 carcinogens, respectively, by occupation. Conclusion The K-CAREX database was developed to estimate exposure prevalence and intensity by industry and occupation for 18 IARC Group 2A agents. These findings provide valuable data for cancer prevention and epidemiological studies. Future work may expand K-CAREX to include IARC Group 2B agents and other carcinogenic agents. Keywords Cancer Carcinogen CAREX Job-exposure matrix Occupational exposure pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Many workers are exposed to a variety of chemicals, gases, and dusts during their work. As the workforce ages, these exposures are increasingly linked to chronic diseases such as cancer [ 1 2 3 Aging workers are submitting more claims for work-related diseases, a trend observed in many aging populations [ 4 5 For the effective prevention of occupational diseases, including cancer, it is essential to identify hazardous chemicals and their distribution. Basic epidemiological data, such as the industries and occupations where exposure occurs, are critical for addressing these issues [ 6 7 8 The CARcinogen EXposure (CAREX) project provides an industry-based exposure matrix, estimating the number of exposed workers and the exposure prevalence [ 9 10 To develop the Korean CARcinogen EXposure (K-CAREX), we initiated the project in 2014 by reviewing existing matrices such as EU CAREX [ 9 11 12 13 14 15 16 17 In this study, we extended the K-CAREX framework to include selected IARC Group 2A agents. We describe the process of estimating exposure prevalence and intensity for these carcinogens and discuss the methodologies used to develop the K-CAREX for IARC Group 2A agents. 2 Methods 2.1 Data sources In the Republic of Korea, workplaces exposed to any of the 192 chemical and physical agents designated by the Ministry of Employment and Labor (MOEL) are required to undergo annual monitoring for these hazardous agents [ 18 19 14 15 Workers exposed to 181 physical and chemical agents, including night shiftwork, as designated by the MOEL, must undergo annual special health examinations [ 13 12 The KOSHA conducts a nationwide occupational exposure survey every five years, known as the Work Environment Condition Survey (WECS) [ 13 Additionally, the 2020 National Census data, which surveyed industry and occupation for 20% of the population, was used as baseline data to estimate the number of exposed workers. 2.2 Selection of target carcinogens In 2023, we reviewed the list of carcinogens published by the IARC and identified 93 agents classified as probable human carcinogens (Group 2A). We then cross-referenced these with agents designated for workplace exposure monitoring and special health examinations in the Republic of Korea. As a result, we identified 17 IARC Group 2A agents listed in both the WEMD and SHED, which were subsequently selected as target carcinogens. These agents included acrylamide, aniline, antimony, benzotrichloride, 2-bromopropane, cobalt, dichloromethane, dimethyl sulfate, dimethylformamide, epichlorohydrin, hydrazine, indium, methyl chloroform, lead, perchloroethylene, styrene, and 1,2,3-trichloropropane. In addition, night shiftwork was selected as a target carcinogen due to the large number of exposed workers and its inclusion in the special health examination, despite not being subject to workplace exposure monitoring. Accordingly, a total of 18 IARC Group 2A agents were selected as target carcinogens. 2.3 Classification of industry and occupation For the standard industrial classification (SIC), we used the Republic of Korea Standard Industrial Classification (KSIC, 10th revision), which is based on the International Standard Industrial Classification (ISIC, 4th revision). For the standard occupation classification (SOC), we used the Republic of Korea Standard Classification of Occupations (KSCO, 7th revision), which follows the International Standard Classification of Occupations (ISCO-08). The databases used in this study—WEMD, SHED, WECS, and the Census—are all coded according to the KSIC, while SHED and the Census are also coded according to the KSCO. We applied the 3-digit SIC and SOC codes in the current analysis. 2.4 Estimation process of the industry-based exposure matrix The industry-based exposure matrix includes estimates of exposure prevalence and intensity by industry [ 13 15 In the first step, we calculated three reference estimates of exposure prevalence, derived from the WEMD, SHED, and WECS. Workplace environmental monitoring is conducted on a sampling basis. For a unit workplace with ten or fewer employees, a minimum of two measurements is required—except in cases with only one worker, where a single measurement is sufficient. In larger unit workplaces, one measurement is required for every five employees. To account for this sampling scheme, the number of measurements in the WEMD was multiplied by a factor of four and then divided by the total number of employees in the industry, resulting in the exposure prevalence derived from the WEMD [ 12 12 In the second step, using the three reference prevalence estimates, we developed three rules to estimate exposure prevalence transparently and reasonably. The first rule involved assigning the average of the WEMD and SHED estimates as the base estimate when both were available. If only the WEMD estimate was available, it was used as the base estimate. If only the SHED and WECS estimates were available, the SHED estimate was assigned as the base estimate. In all other cases, a zero estimate was assigned. The second rule applied a weighting factor to adjust the base estimates for potential overestimation in non-manufacturing sectors (SIC: 011–032, 423–990), which can occur, for example, when an industry comprises many workplaces, but exposure is present and measured in only one of them. The weighting factor was calculated as the average of two components: the monitoring rate and the health examination rate. The monitoring rate was defined as the number of employees in companies that conducted environmental monitoring for any of the 192 designated hazardous agents—within a given industry in the WEMD, averaged over the years 2020 to 2022—divided by the total number of individuals in the same industry, based on the 2020 Census. Similarly, the health examination rate was defined as the number of employees in companies that conducted special health examinations for any of the 179 designated hazardous agents (excluding two related to night shiftwork)—within a given industry in SHED, averaged from 2020 to 2022—divided by the corresponding industry population in the 2020 Census. The final weight factor, calculated as the average of these two rates, was applied to non-manufacturing sectors. The third rule involved a review by industrial hygiene experts (DUP, SC, and DHK), who refined the preliminary estimates—calculated as the base estimate multiplied by a weighting factor—into final estimates. Prior to reviewing the preliminary estimates, the experts examined relevant articles and documents identified through literature searches, including IARC monographs and the American Conference of Governmental and Industrial Hygienists (ACGIH) Threshold Limit Values (TLVs) documents, to ensure the estimates were reasonable. The final exposure prevalence estimates were derived from this expert review process. The number of exposed workers was then calculated by multiplying the final exposure prevalence estimates by the number of individuals in each industry, based on the 2020 Census data. For exposure intensity by industry, we used data from the WEMD between 2020 and 2022. The semi-quantitative exposure rating method used for IARC Group 1 agents was also applied to Group 2A agents [ 14 20 2.5 Estimation process of the occupation-based exposure matrix For estimating exposure prevalence by occupation, the number of health examinees (averaged between 2020 and 2022) in each occupation within the SHED was divided by the total number of individuals in the corresponding occupation in the 2020 Census [ 17 The WEMD data includes information on exposure levels but lacks occupation information, whereas the SHED provides information on occupation. To estimate exposure intensity, data from the WEMD (2020–2022) were linked with the SHED (2020–2022) using a unique identifier (year + company + worker), resulting in a matched dataset. For example, if a worker wore samplers for airborne lead monitoring and simultaneously underwent a special health examination, including a blood lead level test in the same year, that worker was included in the matched dataset [ 16 17 For exposure intensity by occupation, the matched data were used to compute the X95 for each 3-digit occupation code across 2020 and 2022 [ 17 3 Results A total of 18 carcinogens were assessed in this study ( Table 1 Table 1 Table 1 IARC Group 2A agents assessed and availability of corresponding exposure matrices Table 1 No Agent Industry-based matrix Occupation-based matrix Prevalence Intensity Prevalence Intensity 1 Acrylamide Yes Yes Yes Yes 2 Aniline Yes Yes Yes Yes 3 Antimony Yes Yes Yes Yes 4 Benzotrichloride Yes No Yes No 5 2-Bromopropane Yes Yes Yes Yes 6 Cobalt Yes Yes Yes Yes 7 Dichloromethane Yes Yes Yes Yes 8 Dimethyl sulfate Yes Yes Yes Yes 9 Dimethylformamide Yes Yes Yes Yes 10 Epichlorohydrin Yes Yes Yes Yes 11 Hydrazine Yes Yes Yes Yes 12 Indium Yes Yes Yes Yes 13 Methyl chloroform Yes Yes Yes Yes 14 Lead Yes Yes Yes Yes 15 Perchloroethylene Yes Yes Yes Yes 16 Night shiftwork Yes No Yes No 17 Styrene Yes Yes Yes Yes 18 1,2,3-Trichloropropane Yes Yes Yes Yes IARC, the International Agency for Research on Cancer. The number of workplace measurements and special health examinees conducted between 2020 and 2022, categorized by carcinogen and based on both industry- and occupation-based matrices, are presented in Table 2 Table 2 Table 2 Number of measurements and number of health examinees in exposure matrices Table 2 IARC Group 2A Industry-based matrix Occupation-based matrix OEL Agent WEMD SHED Exposed Matched SHED Measurement Examinees Measurement Examinees Acrylamide 8,558 30,073 12,869 4,694 32,258 0.03 mg/m 3 Aniline 2,022 15,542 5,478 904 18,627 2 ppm Antimony 27,450 129,848 58,688 12,369 140,034 0.5 mg/m 3 Benzotrichloride 10 298 17 NA 363 C 0.1 ppm 2-Bromopropane 296 1,978 652 181 2,231 1 ppm Cobalt 32,887 164,043 71,540 14,441 174,021 0.02 mg/m 3 Dichloromethane 31,375 137,733 56,807 23,065 226,764 50 ppm Dimethyl sulfate 50,368 215,892 96,423 417 5,880 0.1 ppm Dimethylformamide 784 4,643 1,564 18,562 157,712 10 ppm Epichlorohydrin 3,227 15,550 5,851 1,471 19,524 0.5 ppm Hydrazine 2,018 14,538 4,952 979 15,986 0.05 ppm Indium 3,299 13,815 6,242 1,063 19,886 0.01 mg/m 3 Methyl chloroform 3,997 21,594 8,333 1,802 23,153 350 ppm Lead 98,763 225,274 162,153 34,803 249,854 0.05 mg/m 3 Perchloroethylene 5,056 24,221 10,060 2,086 30,770 25 ppm Night shiftwork NA 3,166,436 2,861,673 NA 3,502,918 NA Styrene 63,597 165,487 86,928 27,099 190,431 20 ppm 1,2,3-Trichloropropane 171 1,514 420 65 2,304 10 ppm IARC, the International Agency for Research on Cancer; OEL, occupational exposure limit; WEMD, work environment measurement database; SHED, special health examination database; NA, not applicable. The top 10 3-digit minor industrial groups by lead exposure prevalence are shown in Table 3 https://k-carex-2a.shinyapps.io/sic_prevalence Table 3 Top 10 industrial groups according to exposure prevalence of lead Table 3 Industry WEMD SHED WECS Prevalence Exposed Code Description % % % % N 242 Manufacture of basic precious and non-ferrous metals 23.17 10.98 1.19 17.08 9,777 282 Manufacture of batteries and accumulators 13.78 18.96 2.46 16.37 5,517 274 Manufacture of watches, clocks and its parts 11.21 21.41 0 16.31 425 351 Electric power generation, transmission and distribution 21.35 10.13 0 15.74 11,934 241 Manufacture of basic iron and steel 17.07 9.91 0.32 13.49 14,242 243 Casting of metals 18.65 4.56 1.51 11.6 2,046 289 Manufacture of other electrical equipment 9.68 11.49 1.06 10.59 1,591 311 Building of ships and boats 19.67 0.6 1.08 10.14 12,326 340 Maintenance and repair services of industrial machinery and equipment 8.56 8.97 0.16 8.77 4,073 062 Mining of non-ferrous metal ores 11.88 5.44 1.11 8.66 23 WEMD, work environment measurement database; SHED, special health examination database; WECS, work environment condition survey; N, estimated number of exposed workers. Regarding exposure intensity by industry, the “manufacture of batteries and accumulators” industry had the highest exposure rating of 4 ( Table 4 https://k-carex-2a.shinyapps.io/sic_intensity Table 4 Top 10 industrial groups according to exposure intensity of lead Table 4 Industry N Rating Code Description 282 Manufacture of batteries and accumulators 2,306 4 259 Manufacture of other fabricated metal products; metalworking service activities 4,685 3 242 Manufacture of basic precious and non-ferrous metals 4,095 3 291 Manufacture of general purpose machinery 3,535 3 243 Casting of metals 2,457 3 251 Manufacture of structural metal products, tanks, reservoirs and steam generators 1,362 3 222 Manufacture of plastics products 1,322 3 852 Secondary education 455 3 221 Manufacture of rubber products 447 3 492 Passenger land transport, except transport via railways 329 3 N, number of measurements between 2020 and 2022 from work environment measurement database. The top 10 3-digit occupational groups by lead exposure prevalence are shown in Table 5 https://k-carex-2a.shinyapps.io/soc_prevalence Table 5 Top 10 occupational groups according to exposure prevalence of lead Table 5 Occupation Examinee Census Prevalence Code Description 149 Other Construction, Electricity and Production Related Managers 1,683 2,667 21.03 872 Freight Train Related Workers 1,936 4,674 13.81 799 Other Technical Workers 17,560 46,113 12.69 153 Environmental, Cleaning, and Protective Service Related Managers 404 1,374 9.80 141 Construction, Electricity and Production Related Managers 13,403 47,739 9.36 861 Power Generation and Distribution Equipment Operators 7,751 28,277 9.14 899 Other Machine Operators 14,906 63,673 7.80 135 Information and Communications Related Managers 672 2,933 7.64 752 Transport Equipment Mechanics 7,568 52,803 4.78 232 Chemical Engineers and Technicians 5,053 44,698 3.77 Examinee, number of special health examinees between 2020 and 2022; Census, number of individuals in national census 2020. For exposure intensity by occupation, “production-related elementary workers” had the highest exposure rating of 4 ( Table 6 https://k-carex-2a.shinyapps.io/soc_intensity Table 6 Top 10 occupational groups according to exposure intensity of lead Table 6 Occupation N Rating Code Description 930 Production Related Elementary Workers 11,675 3 899 Other Machine Operators 2,820 3 841 Metal Casting and Metal Processing Related Operators 2,252 3 799 Other Technical Workers 2,084 3 842 Painting and Coating Machine Operators 1,078 3 832 Chemical, Rubber and Plastic Production Machine Operators 779 3 851 Metal Work Machinery Operators 468 3 741 Die and Mold Makers, Metal Casting Workers and Forge Hammersmiths 108 3 782 Construction Related Technical Workers 32 3 141 Construction, Electricity and Production Related Managers 1,108 2 N, number of measurements between 2020 and 2022 from matched data. 4 Discussion Occupational cancer remains a significant issue in occupational health. However, not all workers are aware that exposure to chemicals and dusts in the workplace can lead to certain types of cancer. As a result, the number of workers recognized for occupational cancer in the Republic of Korea is lower than expected, largely due to low claim rates for occupational cancers [ 21 22 23 24 Establishing the association and causal relationship between carcinogen exposure and cancer requires extensive biomedical and epidemiological evidence. This process is often hindered by the rarity of some cancers and limited exposure measurements and records available for study subjects. While population-based studies, such as case-control and cohort studies, can be used, assessing exposure in the general population remains challenging [ 25 7 26 8 The K-CAREX was initially developed to estimate the number of exposed workers by industry [ 13 15 17 9 27 28 11 29 The process for estimating exposure prevalence by industry in this study differs that used in our previous approach [ 13 13 30 Table 2 12 For occupation-based estimates, we were unable to obtain a stable denominator for estimating exposure prevalence, which precluded the use of exposure prevalence by occupation to estimate the number of exposed workers in those occupations [ 17 There are differences in the number of health examinees in the industry- and occupation-based matrices ( Table 2 The databases used in this study have several limitations, which are explained in detail elsewhere [ 13 31 32 Supplemental Table 1 Table 5 In conclusion, we have developed the K-CAREX for IARC Group 2A agents, which includes both industry- and occupation-based exposure matrices. The industry-based matrix covers exposure prevalence for 18 carcinogens and exposure intensity for 16 carcinogens across 232 industrial groups, while the occupation-based matrix covers exposure prevalence for 18 carcinogens and exposure intensity for 16 carcinogens across 156 occupational groups. The updated K-CAREX framework for IARC Group 2A agents may aid efforts in occupational cancer prevention and provide valuable exposure data for epidemiological studies. Future studies may expand the K-CAREX framework to include IARC Group 2B agents and other non-carcinogenic agents. CRediT authorship contribution statement Dong-Hee Koh: Sangjun Choi: Ju-Hyun Park: Sang-Gil Lee: Hwan-Cheol Kim: Inah Kim: Jeehee Min: Yujin Kim: Jihye Lee: Dong-Uk Park: Ethical statement The study protocol was approved by the Institutional Review Board of the Catholic Kwandong University, International St. Mary's Hospital, Incheon, the Republic of Korea (IS24QIMI0030). Funding This study was also supported by a grant from the Occupational Safety and Health Research Institute (2024-OSHRI-533), funded by the 10.13039/100019908 Korea Occupational Safety and Health Agency Conflicts of interest The authors declare that they have no conflict of interest. References 1 Li N. Zhai Z. Zheng Y. Lin S. Deng Y. Xiang G. Yao J. Xiang D. Wang S. Yang P. Yang S. Xu P. Wu Y. Hu J. Dai Z. Wang M. Association of 13 occupational carcinogens in patients with cancer, individually and collectively, 1990-2017. JAMA Network Open 4 2021 e2037530 10.1001/jamanetworkopen.2020.37530 PMC7893501 33599775 2 Park R.M. Schulte P.A. Bowman J.D. Walker J.T. Bondy S.C. Yost M.G. Touchstone J.A. Dosemeci M. Potential occupational risks for neurodegenerative diseases Am J Ind Med 48 2005 63 77 15940722 10.1002/ajim.20178 3 Gunnarsson L.G. Bodin L. Occupational exposures and neurodegenerative diseases-A systematic literature review and meta-analyses Int J Environ Res Publ Health 16 2019 10.3390/ijerph16030337 PMC6388365 30691095 4 Peng L. Chan A.H.S. A meta-analysis of the relationship between ageing and occupational safety and health Safety Sci 112 2019 162 172 5 Geiser K. Chemicals without harm-policies for a sustainable world 2015 MIT Press 6 Checkoway H. Pearce N. Kriebel D. Research methods in occupational epidemiology 2004 Oxford University Press 7 Nieuwenhuijsen M.J. Exposure assessment in environmental epidemiology 2015 Oxford University Press 8 Kauppinen T. Uuksulainen S. Saalo A. Makinen I. Pukkala E. Use of the Finnish information system on occupational exposure (FINJEM) in epidemiologic, surveillance, and other applications Ann Occup Hyg 58 2014 380 396 24401793 10.1093/annhyg/met074 9 Kauppinen T. Toikkanen J. Pedersen D. Young R. Ahrens W. Boffetta P. Hansen J. Kromhout H. Maqueda Blasco J. Mirabelli D. de la Orden-Rivera V. Pannett B. Plato N. Savela A. Vincent R. Kogevinas M. Occupational exposure to carcinogens in the European Union Occup Environ Med 57 2000 10 18 10711264 10.1136/oem.57.1.10 PMC1739859 10 Hoar S. Job exposure matrix methodology J Toxicol Clin Toxicol 21 1983 9 26 6672226 10.3109/15563658308990408 11 Kauppinen T. Toikkanen J. Pukkala E. From cross-tabulations to multipurpose exposure information systems: a new job-exposure matrix Am J Ind Med 33 1998 409 417 9513649 10.1002/(sici)1097-0274(199804)33:4<409::aid-ajim12>3.0.co;2-2 12 Koh D.H. Park J.H. Lee S.G. Kim H.C. Choi S. Jung H. Park J.O. Park D.U. Estimation of lead exposure prevalence in Korean population through combining multiple experts’ judgment based on objective data sources Ann Work Expo Health 62 2018 210 220 29342235 10.1093/annweh/wxx106 13 Koh D.-H. Park J.-H. Lee S.-G. Kim H.-C. Choi S. Jung H. Kim I. Park D.U. Development of Korean CARcinogen EXposure: an initiative of the occupational carcinogen surveillance system in Korea Ann Work Expo Health 65 2021 528 538 33528514 10.1093/annweh/wxaa135 PMC8323866 14 Koh D.H. Park J.H. Lee S.G. Kim H.C. Jung H. Kim I. Choi S. Park D. Estimation of lead exposure intensity by industry using nationwide exposure databases in Korea. Safety and Health at Work 12 2021 439 444 10.1016/j.shaw.2021.07.008 PMC8640577 34900362 15 Koh D.-H. Park J.-H. Lee S.-G. Kim H.-C. Jung H. Kim I. Kim I. Choi S. Park D. Development of Korean CARcinogen EXposure: assessment of the exposure intensity of carcinogens by industry. Safety and Health at Work 13 2022 308 314 10.1016/j.shaw.2022.05.003 PMC9482008 36156867 16 Koh D.H. Choi S. Park J.H. Lee S.G. Kim H.C. Kim I. Lim D. Seo H. Park D.U. Development of occupation-based exposure matrix of lead for Korean workers: challenges and opportunities Ann Work Expo Health 68 2024 256 268 38377017 10.1093/annweh/wxae006 17 Koh D.-H. Choi S. Park J.-H. Lee S.-G. Kim H.-C. Kim I. Min J. Kim Y. Park D.U. Development of Korean CARcinogen EXposure: occupation-based exposure matrix Ann Work Expo Health 69 2025 191 200 39603817 10.1093/annweh/wxae090 18 Koh D.H. Park J.H. Lee S.G. Kim H.C. Choi S. Jung H. Park D.U. Combining lead exposure measurements and experts’ judgment through a Bayesian framework Ann Work Expo Health 61 2017 1054 1075 29136412 10.1093/annweh/wxx072 19 Koh D.H. Choi S. Park J.H. Lee S.G. Kim H.C. Kim I. Won J.U. Lim D.S. Seo H. Park D.U. Evaluation of temporal trends of lead exposure in Korean workers using workplace monitoring data J Korean Med Sci 38 2023 e271 10.3346/jkms.2023.38.e271 PMC10462473 37644685 20 Jeong J.Y. Choi S. Kho Y.L. Kim P.G. Extensive changes to occupational exposure limits in Korea Regul Toxicol Pharmacol 58 2010 345 348 20709131 10.1016/j.yrtph.2010.08.006 21 Won J. Ahn Y. Song J. Koh D. Roh J. Occupational injuries in Korea: a comparison of blue-collar and white-collar workers' rates and underreporting J Occup Health 49 2007 53 60 17314467 10.1539/joh.49.53 22 Ahn Y.-S. Jeong K.S. Epidemiologic characteristics of compensated occupational lung cancers among Korean workers J Korean Med Sci. 29 2014 1473 1481 25408577 10.3346/jkms.2014.29.11.1473 PMC4234913 23 Song J. Woo K.-H. Kim Y.H. Guidelines for recognition of occupational cancers in Korea: the results of scientific review by Korean Society of Occupational and Environmental Medicine (2013–2016) Ann Occup Environ Med 30 2018 12 29456866 10.1186/s40557-018-0223-2 PMC5809845 24 Kim T.-W. Koh D.-H. Park C.-Y. Decision tree of occupational lung cancer using classification and regression analysis Safety and Health at Work 1 2010 140 148 22953174 10.5491/SHAW.2010.1.2.140 PMC3430888 25 Fritschi L. OccIDEAS – occupational exposure assessment in community-based studies Occup Med 69 2019 156 157 10.1093/occmed/kqy126 31127288 26 Burstyn I. The ghost of methods past: exposure assessment versus job-exposure matrix studies Occup Environ Med 68 2011 2 3 21075766 10.1136/oem.2009.054585 27 Peters C.E. Ge C.B. Hall A.L. Davies H.W. Demers P.A. CAREX Canada: an enhanced model for assessing occupational carcinogen exposure Occup Environ Med 72 2015 64 71 24969047 10.1136/oemed-2014-102286 PMC4283677 28 GBD 2016 Occupational Carcinogens Collaborators Global and regional burden of cancer in 2016 arising from occupational exposure to selected carcinogens: a systematic analysis for the Global Burden of Disease Study 2016 Occup Environ Med 77 2020 151 159 32054819 10.1136/oemed-2019-106012 PMC7035689 29 Siemiatycki J. Lavoué J. Availability of a new job-exposure matrix (CANJEM) for epidemiologic and occupational medicine purposes J Occup Environ Med 60 2018 e324 e328 29642096 10.1097/JOM.0000000000001335 30 Kim Y. Jung K. Hwang T. Jung G. Kim H. Park J. Park D. Park S. Choi K Moon Y. Hematopoietic and reproductive hazards of Korean electronic workers exposed to solvents containing 2-bromopropane Scand J Work Environ Health 22 1996 387 391 8923614 10.5271/sjweh.159 31 Park J.-H. Choi S. Koh D.-H. Lim D. Park D. Kim H.-C. Lee S.G. Lee J. Lim J. Sung Y. Ko K. A pilot establishment of the job-exposure matrix (JEM) of lead using the standard process code of nationwide exposure databases in Korea. Safety and Health at Work 13 2022 10.1016/j.shaw.2022.09.001 PMC9772472 36579012 32 Hwang G. Study on the improvement of reliability assessment of work environment measurement in Korea J Korean Soc Occup Environ Hyg. 29 2018 50 56 Appendix A Supplementary data The following is the Supplementary data to this article. Multimedia component 1 Multimedia component 1 Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.shaw.2025.05.007 ",
  "metadata": {
    "Title of this paper": "Study on the improvement of reliability assessment of work environment measurement in Korea",
    "Journal it was published in:": "Safety and Health at Work",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490614/"
  }
}