{
  "title": "Paper_688",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12480573 PMC12480573.1 12480573 12480573 41022776 10.1038/s41467-025-63599-5 63599 1 Article The pericardium forms as a distinct structure during heart formation http://orcid.org/0000-0001-8056-5762 Moran Hannah R. 1 Nyarko Obed O. 2 http://orcid.org/0009-0006-1449-4939 Garfield Amanda L. 1 http://orcid.org/0000-0003-1198-6963 O’Rourke Rebecca 1 Ching Ryenne-Christine K. 1 http://orcid.org/0000-0001-7792-8358 Gray Raéden 3 Cobb Tristan M. 2 4 5 http://orcid.org/0000-0002-8530-3339 Riemslagh Fréderike W. 1 http://orcid.org/0000-0002-7838-5823 Lovely C. Ben 3 http://orcid.org/0000-0003-4224-6626 Peña Brisa 2 4 5 http://orcid.org/0000-0001-7137-3910 Burger Alexa 1 Sucharov Carmen C. 2 http://orcid.org/0000-0002-0749-2576 Mosimann Christian christian.mosimann@cuanschutz.edu 1 1 https://ror.org/03wmf1y16 grid.430503.1 0000 0001 0703 675X Department of Pediatrics, Section of Developmental Biology, University of Colorado School of Medicine, Anschutz Medical Campus, 2 https://ror.org/03wmf1y16 grid.430503.1 0000 0001 0703 675X Division of Cardiology, Department of Medicine, University of Colorado Anschutz Medical Campus, Anschutz Medical Campus, 3 https://ror.org/01ckdn478 grid.266623.5 0000 0001 2113 1622 Department of Biochemistry and Molecular Genetics, University of Louisville School of Medicine, 580 S. Preston St., 4 https://ror.org/03wmf1y16 grid.430503.1 0000 0001 0703 675X Cardiovascular Institute, Division of Cardiology, University of Colorado School of Medicine, Anschutz Medical Campus, 5 https://ror.org/03wmf1y16 grid.430503.1 0000 0001 0703 675X Bioengineering Department, University of Colorado School of Medicine, Anschutz Medical Campus, 29 9 2025 2025 16 478256 8566 11 10 2024 21 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ The heart is formed from diverse cell lineages that assemble into a functional unit, including the pericardium, a mesothelial sac that supports movement, homeostasis, and immune responses. However, its developmental origins remain unresolved. Here, we find the pericardium forms within the lateral plate mesoderm from dedicated mesothelial progenitors that are distinct from the classic heart field. Imaging of transgenic zebrafish reporters documents lateral plate mesoderm cells that emerge lateral of the heart field among a continuous mesothelial progenitor band. Single-cell transcriptomics and trajectories of hand2 The developing heart integrates several progenitor cell types. Here they show that the pericardium enveloping the heart develops among cells that form the mesothelium around inner organs and body cavities, distinct from the classic heart field. Subject terms Cell lineage Organogenesis Heart development https://doi.org/10.13039/100000050 U.S. Department of Health & Human Services | NIH | National Heart, Lung, and Blood Institute (NHLBI) 1R01HL168097-01A1 5K24HL150630-02 Mosimann Christian https://doi.org/10.13039/100000062 U.S. Department of Health & Human Services | NIH | National Institute of Diabetes and Digestive and Kidney Diseases (National Institute of Diabetes & Digestive & Kidney Diseases) 1R01DK129350-01A1 Mosimann Christian pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction The formation of a functional heart requires precise integration of various cell types during embryonic development. Understanding the diverse cell lineages and mechanisms that contribute to cardiogenesis is essential to uncover the origins of congenital heart disease and to unlock the heart’s regenerative capacity. The developing heart incorporates myocardial, endocardial, and conduction system cells while being surrounded by the pericardium as a multi-layered mesothelial tissue. Covering the heart as the first functional organ in the body, the pericardium forms among the earliest organ-associated mesothelia. The functional, mature pericardium presents as a three-layered structure with (i) a fibrous outer layer that in mammals attaches to the sternum and diaphragm to anchor the cardiac cavity, (ii) an inner serous membrane layer that reduces friction of the constantly beating heart 1 2 4 1 5 8 9 12 13 14 8 15 16 Mesothelia such as the pericardium have been implicated in contributing to a variety of downstream cell fates, including select tissue fibroblast lineages 17 22 23 26 18 27 29 30 32 33 40 31 23 41 49 Within the anterior LPM (ALPM), FHF cells migrate medially to form the linear heart tube that extends with later-differentiating SHF progenitors 31 50 51 18 23 26 52 54 55 56 18 18 23 26 hand2:EGFP Hand 18 23 26 57 58 60 25 61 63 Here, by combining live imaging, machine learning-based cell tracking, single-cell transcriptome-based trajectories, and functional studies in zebrafish, we resolve the earliest origins of the pericardium. We contextualize pericardial precursors to reside among the hand2 Results The pericardium forms among the mesothelium-forming LPM The transgenic zebrafish reporter line hand2:EGFP hand2 18 64 hand2 drl hand2:EGFP 18 1A, B hand2 18 hand2:EGFP Fig. 1 The pericardium forms continuous with the mesothelium-forming LPM. A D A B hand2:EGFP;myl7:DsRed hand2:EGFP myl7:DsRed hand2:EGFP- A B C D C D hand2:EGFP;myl7:DsRed hand2:EGFP- C D E hand2:EGFP;drl:mCherry hand2:EGFP F H F hand2:EGFP;drl:mCherry hand2:EGFP G hand2:EGFP;nkx2.5:ZsYellow H hand2:EGFP;tbx1:mCerulean N I hand2:EGFP;tbx1:mCerulean hand2:EGFP- N A D E H I As an anatomical overview, we first crossed hand2:EGFP myl7:DsRed 65 65 1A–D myl7 hand2 1C, D hand2:EGFP myl7:dsRed 18 1A, B hand2:EGFP In the dynamic heart field, expression of the pan-LPM marker drl:mCherry 66 67 hand2 drl 18 hand2:EGFP 1E hand2:EGFP;drl:mCherry hand2 drl 1F 18 1A, B Nkx2.5 68 70 71 72 nkx2.5:ZsYellow 39 hand2:EGFP 1G 73 75 nkx2.5:ZsYellow hand2:EGFP 1E, G tbx1 76 79 tbx1:mCerulean hand2;EGFP tbx1:mCerulean hand2:EGFP 1H From our reporter expression analysis and considering early LPM architecture 32 18 1E 23 26 tbx1:mCerulean hand2:EGFP 18 79 80 hand2:EGFP 1I 1I 1 2 Taken together, our multi-reporter imaging in zebrafish reveals that ALPM-derived pericardial progenitors share the expression of key markers assigned to heart tube progenitors, and that pericardial progenitors form as the anterior-most extension of a hand2:EGFP Pericardial progenitors have distinct migratory trajectories To corroborate our hypothesis on the distinct origin and dynamics of pericardial progenitors in relation to the emerging heart tube, we performed light sheet-based live imaging of developing hand2:EGFP 1I 2A–F 81 82 2B–F 2 3 1A 40 50 83 18 2B 3 6 2B–F 84 86 Fig. 2 Pericardial progenitors have distinct migratory trajectories among heart-contributing lineages. A hand2:EGFP N B F B E hand2:EGFP B C D E E F 2 3 hand2:EGFP G J G p H p I p J p G J t- N A B F In our resulting timelapse imaging, we once more observed pericardial precursors emerging as a mesh-like territory at the outer lateral-most edge of the heart field (Fig. 2B–F 1E–I 2F 3 6 Imaris-based lineage mapping and machine learning off our imaging datasets further quantified the differences in cellular properties of both the pericardium and heart tube (see Methods for details). Pericardial cells travel a further distance from their original position as they migrate as bilateral coherent units over the yolk of the embryo, whereas cardiac precursors maintain their position near the midline throughout cardiogenesis (Fig. 2G 2H 2J, I Pericardium progenitors emerge among mesothelial lineages We next sought to probe whether pericardial progenitors are a transcriptionally distinct cell population in the emerging LPM and what gene expression signature defines them. We conducted a 10xGenomics-based single-cell RNA-sequencing (scRNA-seq) analysis of zebrafish LPM cells at 10 hpf (tailbud stage, end of gastrulation) when the LPM has coalesced into its bilateral stripe architecture and prior to onset of specification and lineage diversification of the myocardium and pericardium (Fig. 3A drl:mCherry hand2:EGFP drl hand2:EGFP 2A drl:mCherry 2B 18 67 EGFP hand2 87 3B 3 18 67 87 Fig. 3 Pericardial and myocardial precursors are transcriptionally distinct populations. A drl:mCherry;hand2:EGFP N B drl:mCherry;hand2:EGFP C D C D E wt1a, fzd7a, jam2b, twist1a, sfrp5 fn1a N F B A B E https://www.phylopic.org/ The resulting annotated clusters predominantly represent LPM-derived cell types including broadly cranial mesoderm, hemangioblasts and kidney precursors, myeloid and hematopoietic precursors, cardiomyocytes, mesothelia, as well as hatching gland cells and undifferentiated mesoderm (Fig. 3B 18 46 67 88 89 fsta foxc1a tbx1 meox1 lbx2 fli1a pax2a 18 90 lmo2 npas4l tal1 gfi1ab 90 93 tbx20 mef2ca hey2 actn2b ttn.2 nkx2.5 71 75 94 95 tcf21 sema3aa, wt1a, meis3 adra1d kank1a 18 90 96 sox17 foxa2 foxa3 18 88 89 3B drl 18 97 Among the resolved hand2 hand2 hand2:EGFP 18 3C, D nkx2.5 1G hand2:EGFP jam2b, sfrp5, fzd7a, twist1a, fn1a, and wt1a 18 98 100 3C, D wt1a fzd7a fn1a sfrp5 jam2b 3C twist1a hand2 drl:mCherry hand2:EGFP 1E–H We next asked if this differential transcriptome signature between the myocardium and pericardium is also detectable in mammalian systems and remains in more mature hearts. We compiled cluster-defining LPM gene lists for myocardium versus mesothelium/pericardium as informed from our zebrafish scRNA-seq (Fig. 3B 18 90 n n Rattus norvegicus 3F, G 3G 3G 3G 3F, G 101 6 Pericardial progenitors follow a distinct differentiation trajectory Our transcriptome analysis resulted in gene sets assigned to myocardial, pericardial, and more broadly mesothelial progenitors at the end of gastrulation. Pericardial marker genes include jam2b, sfrp5 tmem88b nr2f1a meis2b twist1a 18 4A gata5 gata6 nkx2.5 ttn.2 71 75 94 95 4A 1E–H 4B nkx2.5 39 72 4B Fig. 4 The pericardial lineage trajectory becomes distinct prior to heart tube formation. A B hand2:EGFP;nkx2.5:ZsYellow N C E C D E B To independently corroborate pericardial origins from mesothelial instead of classic heart field progenitors, we sought to apply our cluster-defining gene lists for single-cell-based trajectory inference. This approach requires a comprehensive scRNA-seq dataset with sufficient cells and multiple time points to compute pseudotemporal reconstruction of lineage differentiation 102 105 106 107 107 Our curated gene list matched with the Zebrahub cells designated as “primitive heart tube cells” or “heart” from 12 hpf, 14 hpf, 16 hpf, and 19 hpf, which we then selected for re-analysis as UMAP containing pericardium, myocardium, and early precursor clusters (see Methods for details) (Supplementary Fig. 4A–D 4C 4E–G 4C S4 4C–E 4A 5A, B The pericardium forms independently of the heart tube The concerted development of mesothelia with their associated organs, and how their formation is influenced by organ-specific anomalies, remain understudied 21 22 108 109 mef2ca mef2cb 110 111 hand2:EGFP 5A hand2:EGFP hand2:EGFP 5B mef2ca/b hand2:EGFP 5C 110 111 mef2ca/b 5D 5D Fig. 5 The pericardium forms despite developmental insults to heart formation. A H hand2:EGFP A C E G B D F H A hand2:EGFP hand2:EGFP B hand2:EGFP C D hand2:EGFP mef2ca mef2cb C hand2:EGFP D E F sox32 ta56 hand2:EGFP E casanova F G H han s6 hand2:EGFP G H N A H The midline migration of heart tube progenitors requires the adjacent endoderm 112 116 sox32 casanova, cas 115 117 119 sox32  ta56 cas 5E, F 5F 5F We next assessed the previously established zebrafish hand2 han S6 hands off hand2 75 han S6 18 120 75 121 75 122 han S6 5G hand2 5H hand2 18 sox32 mef2c hand2 Wnt/β-catenin signaling is active in pericardial progenitors Our transcriptomics analysis provides an opportunity to probe molecular mechanisms driving the unique migration and tissue properties of the forming pericardium. We applied Metascape analysis 123 3 4 6A 6B 6B 124 126 Xenopus 58 127 129 Fig. 6 Wnt/β-catenin signaling is differentially active across pericardial progenitors. A B A B C E hand2:EGFP 7xTCF:mCherry C 7xTCF:mCherry D E F G F G C E To visualize active canonical Wnt/β-catenin signaling in developing zebrafish embryos, we used the synthetic reporter-based 7xTCF-Xla.Siam:nlsmCherry ia5 7xTCF:mCherry) 130 131 7xTCF:mCherry hand2:EGFP hand2:EGFP hand2:EGFP 6C 7xTCF:mCherry 6C 130 132 135 6D hand2:EGFP 7xTCF:mCherry 6E 6E 6F, G 58 127 Canonical Wnt signaling influences pericardial cell density Building on previous and our new data, we next aimed to test what impact canonical Wnt/β-catenin signaling has on the morphogenesis and functionality of the pericardium. To inhibit Wnt signaling during pericardium formation, we used the chemical compound IWR-1 that increases β-catenin degradation through Axin stabilization 136 137 71 138 hand2:EGFP;myl7:DsRed n n n 40 139 140 1E–I hand2:EGFP;myl7:DsRed n 7A, B 6 Fig. 7 Inhibition of Wnt/β-catenin alters pericardial morphology and stiffness. A E hand2:EGFP;myl7DsRed A B hand2:EGFP- A B C D hand2:EGFP;myl7:DsRed C D E F hand2:EGFP;myl7:DsRed E F G J n G p p H p p I p p J p p K L n K L t p p p A C E B D F https://www.phylopic.org/ Wnt-inhibited embryos featured severe pericardial edema with minimal to no overt changes to gross morphology of the myocardium (Fig. 7C, D 7G 7E–G 7H, J 7H, I 58 To determine whether reduced pericardial cell number in IWR-1-treated embryos reflected altered proliferation during pericardial formation, we analyzed cell division using PCNA immunostaining at 24 hpf, a period of active pericardial migration. Quantification revealed no significant differences in the number of PCNA-positive cells within the pericardial region between IWR-1-treated and control embryos (Supplementary Fig. S 8 2J ) 2G, H These findings support a model in which canonical Wnt/β-catenin signaling regulates pericardial cell number and density through mechanisms independent of cell division. One possibility is that Wnt signaling maintains progenitor pool size during early specification or epithelial cohesion during later spreading, thereby influencing how many cells ultimately populate the pericardium. An alternate, non-mutually exclusive model is that Wnt activity modulates mechanical properties or adhesion dynamics within the pericardium, and that disruption of these features leads to abnormal cell distribution and stretching, even in the absence of changes in proliferation. Further work integrating live imaging with mechanical perturbation and adhesion markers will be required to distinguish between these possibilities. SFRP1 exposure alters pericardial stiffness in neonatal rats Our finding that reduced canonical Wnt/β-catenin signaling results in a pericardium with fewer cells led us to speculate that tissue rigidity or elasticity may be altered as a result of the changed cellular density. Pediatric patients with dilated cardiomyopathy (DCM) have been found to harbor increased levels of the Wnt-inhibiting SFRP1 protein in blood circulation 141 141 3G As a general hallmark, catecholamines (such as Isoproterenol, Iso) are increased in the serum of pediatric heart failure patients and contribute to increasing disease severity 142 143 7K 7K, L N 7K, L Discussion Despite the central contributions of the pericardium and of its downstream derivative epicardium to cardiac homeostasis and disease, the developmental origins of the pericardium have remained challenging to grasp. Our results uncover that the pericardium develops as a mesothelial lineage that is transcriptionally and by lineage origin within the LPM, distinct from classic heart tube progenitors. Consolidating disparate models of pericardium origins relative to heart field progenitors, our findings advance our concept of how mesothelia co-develop together with their associated organs. Our work also extends the current understanding of cell fate complexity within the ALPM that includes the heart and cardiopharyngeal fields, and integrates LPM-derived mesothelial progenitors into cardiogenesis. Our live imaging and tracking highlight the emergence of the pericardium as the anterior-most portion of a continuous mesothelial progenitor population, expanding the developmental context of earlier, pioneering observations of heart tube formation using transgenic reporters and live labeling in zebrafish, chick, and mouse 18 40 79 85 86 144 146 97 147 Traditional concepts of cardiogenesis have assigned heart-contributing lineages to the first or second heart field 26 36 40 52 146 148 23 56 tbx1 41 43 149 150 9 18 23 85 86 151 152 1 3 4 3 5 18 1E 4C, D 20 21 153 Notably, in mammals, the dorsal portion of the heart tube initially forms continuously with the dorsal pericardial wall and subsequently separates 55 56 154 40 79 83 1 2 18 56 56 155 The pericardium forms around the early-forming heart and accommodates an organ in constant motion. Significant research has focused on the innermost pericardial layer, the epicardium, which envelopes the myocardium following initial pericardium formation and contributes to the heart in development as well as during homeostasis and regenerative responses 9 10 12 53 152 156 158 9 10 12 19 53 153 159 161 2 40 79 85 86 146 162 163 2 mef2ca/b 110 111 114 116 118 5 84 3B, E 4A 4C 4 106 Our observed cell behaviors further underline the unique properties of pericardial cells in development that also carry over to post-natal stages at the transcriptional level (Fig. 3G 164 165 hand2 18 JAM2 SFRP5 TMEM88B NR2F1 MEIS2 TWIST1 3 4 6 4 5 107 4 4 5 Integrating observations in zebrafish and neonatal rats, our data also expand our insights into the impact of canonical Wnt signaling on pericardium formation and tissue stiffness. Previous research in Xenopus discovered that Wnt/β-catenin signaling promotes proliferation in the pericardium, while its inhibition is critical for differentiation of the myocardium 58 128 166 6 7 58 124 126 167 172 58 169 170 173 177 sfrp5 18 3B, C, E sfrp1 58 Sfrp1 176 141 141 143 7K, L DCM is the most common form of cardiomyopathy and the reason for cardiac transplantation in children and adults 178 182 183 184 178 182 185 186 7 141 Methods Zebrafish husbandry and procedures Zebrafish-related animal care and procedures were carried out in accordance with the veterinary office of the IACUC of the University of Colorado School of Medicine (protocol #00979), Aurora, CO, USA. Transgenic zebrafish lines and transgene activity Established transgenic zebrafish lines used in this study include TgBAC(hand2:EGFP) pd24 64 Tg(drl:mCherry) zh705 66 TgBAC(−36nkx2.5:ZsYellow) fb7 39 Tg(myl7:DsRed) s879 65 Tg(7xTCF-Xla.Sia:NLS-mCherry) ia5 130 hand2 han S6 75 sox32 cas sox32 ta56 119 Tg tbx1:mCerulean pAF006 #302 p3E_SV40polyA pSN001 pMEminprom_mCerulean #394 pDestTol2A2 79 187 188 189 Tg(tbx1:EGFP) zh702 79 Morpholino injections The previously characterized and validated mef2ca mef2cb 110 MO1-mef2ca ATG 5 -TTTCCTTCCTCTTCCAAAAGTACAG-3 MO2-mef2cb ATG 5 TGTCCCCGTCTTTTCGTCTCTCTCT-3 hand2:EGFP Single-cell RNA-sequencing Around 1000 drl:mCherry;hand2:EGFP g Bulk RNA-sequencing RNA was extracted from tissues using the mirVana kit (Ambion) and reverse transcribed into complementary DNA using the iScript cDNA Synthesis Kit (Bio-Rad) 190 https://zenodo.org/records/10171269 n n https://zenodo.org/records/10046399 Metascape analysis Using Metascape 123 p Single-cell analysis 10X Genomics Chromium technology was used to capture and profile single-cell transcriptome 3’ gene expression (Genomics Core at CU Anschutz). Generated libraries were sequenced on the Illumina NovaSeq 6000 instrument at the University of Colorado Cancer Center. Upon sequencing, Fastq sequencing files from were processed through Cell Ranger (v5.0.1) 87 GRCz11 87 https://zebrahub.ds.czbiohub.org 107 106 Fluorescent hybridization chain reaction (HCR) Embryos were collected at 24 hpf, dechorionated and fixed in 4% paraformaldehyde/PBS at 4 °C overnight in preparation for HCR 191 fn1a fzd7a jam2b twist1a sfrp5 wt1a 192 hand2 Microscopy and image analysis Confocal imaging Embryos were anesthetized at 3 dpf with 0.016% Tricaine-S (MS-222, Pentair Aquatic Ecosystems, Apopka, FL, USA, NC0342409) in E3 embryo medium. Laser scanning confocal microscopy was performed on a Zeiss LSM880 following embedding in E3 with 1% low-melting-point agarose (LMA) (Sigma-Aldrich, A9045) on glass-bottom culture dishes (Greiner Bio-One, 627861). Heartbeat was stopped with 50 mM 2,3-butanedione monoxime (BDM, Cat#B0753; Sigma) as indicated in individual experiments. Images were collected with a x10/0.8 air-objective lens, Plan-Apochromat ×20/0.8 M27, or with Plan-Apochromat 40x/1.3 Oil DIC M27 objective lenses. All channels were captured sequentially with maximum speed in bidirectional mode, with the range of detection adjusted to avoid overlap between channels. Maximum projections of acquired Z-stacks were made using ImageJ/Fiji 193 Light sheet imaging Embryos used for long-term imaging were treated with 0.003% 1-phenyl-2-thiourea (PTU, Sigma-Aldrich) to prevent melanin pigment formation. The Zeiss Z.1 microscope equipped with a Zeiss W Plan-Apochromat 20×/0.5 NA objective was used for all other light sheet microscopy 18 79 97 120 Multiview Reconstruction BigStitcher 81 194 196 193 1E 18 97 Cell tracking analysis Cell tracking was performed using Imaris’ Object Classification and Lineage tools, as an extension of previously reported manual backtracking of developmental cell lineages 82 Chemical treatments IWR-1-endo (Sigma-Aldrich, 681669) was administered to embryos at 10 µM in E3 at the 18 ss (18 hpf equivalent) overnight and washed out through several washing steps of E3. 2,3-Butanedione monoxime (2,3 BDM, Thermo Fisher, A14339-22) was administered to embryos at 10 mM in E3 at the 18ss (18 hpf) overnight and washed out through several washing steps of E3. Embryos were then raised in E3 to 3 dpf to visualize the pericardial cavity. Controls were treated with an equivalent amount of DMSO. Cell density was quantified using maximum intensity projections in Fiji software by drawing a region of interest (ROI) around the pericardium (labeled by hand2:EGFP Antibody staining Embryos were fixed in 1.44% formaldehyde, 0.1% TritonX in PEM (0.1 M PIPES, 2 mM MgSO 4 79 Proliferation assay Transgenic hand2: Statistics An unpaired non-parametric (Mann–Whitney) two-tailed t p p Neonatal rat injections All animal studies were approved by the Institutional Animal Care and Use Committee (IACUC) of the University of Colorado Anschutz Medical Campus (protocol #00527), Aurora, CO, USA. Pregnant Sprague Dawley female rats were purchased from Charles River Laboratories. All animals were housed in the animal facility of the University of Colorado Anschutz Medical Campus and monitored daily. Male and female young (0–5-day old) Sprague Dawley rats were treated with 100 µg/kg/day Isoproterenol, 50 µg/kg/day sFRP1 and vehicle-treated controls (PBS, 0.5 mM ascorbic acid) every day for 5 days and every other day for 7 days by intraperitoneal injection. The sFRP1 (Recombinant Human sFRP1 Protein, CF, R&D systems) solution was freshly prepared for each treatment by dissolving in phosphate-buffered saline (PBS) at room temperature. Isoproterenol (Isoproterenol hydrochloride, Sigma-Aldrich, St. Louis, MO) was freshly prepared and dissolved in 0.5 mM of ascorbic acid water. Isoproterenol and sFRP1 levels were selected to match serum and cardiac levels observed in human DCM, confirmed by ELISA and qPCR. Isolation of myocardium and pericardium At the end of the study period, rats were euthanized. Myocardial and pericardial tissue were isolated, immediately weighed, frozen in liquid nitrogen and stored at −80 °C for further tissue analysis. AFM assessment for pericardial stiffness Frozen pericardial tissue were embedded in optimal cutting temperature (OCT) (Sakura) and cryosectioned at 5 microns, one section per slide. Tissues were allowed to equilibrate at a cryostat temperature of −20 °C prior to cryosectioning. Isolated pericardial tissue on slides were monitored, selected and their morphological details observed with an optical light microscope. The physical and physiological cues regarding sample preparation and AFM analysis were kept constant across all tissue samples. Three (3) pericardial tissues per treatment group were analyzed. The methodology for AFM measurement and analysis was based on our previous studies 197 200 2 Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Peer Review file Description of Additional Supplementary Files Supplementary Movie 1 Supplementary Movie 2 Supplementary Movie 3 Supplementary Movie 4 Supplementary Movie 5 Supplementary Movie 6 Reporting Summary Source data  Source Data Publisher’s note Supplementary information The online version contains supplementary material available at 10.1038/s41467-025-63599-5. Acknowledgements This work was supported by the University of Colorado School of Medicine, Anschutz Medical Campus, NIH/NHLBI 1R01HL168097-01A1, the Children’s Hospital Colorado Foundation and The Helen and Arthur E. Johnson Chair For The Cardiac Research Director to C.M.; Additional Ventures SVRF 1048003 to C.M. and A.B.; NIH/NIDDK 1R01DK129350-01A1 to A.B.; NIH/NHLBI 5K24HL150630-02, CU Anschutz School of Medicine’s Programmatic Incubator for Research Program (CU ASPIRE) to C.C.S.; NIH/NIGMS 1T32GM141742-01, 3T32GM121742-02S1, and NIH/NHLBI F31HL167580 to H.R.M.; AHA 24DIVSUP1281949 to O.O.N; NIH/NIGMS 5T32GM141742-04 to A.L.G.; NIH/NIAAA R01AA031043 to C.B.L.; NIH/NHLBI K25HL148386, R01HL169578, NIH/NIA R21AG080257 and American Heart Association (AHA) 23CDA1052411 to B.P. F.W.R. has as current affiliation The Netherlands eScience Center. We thank the CU Anschutz CSD Developing Scholars program for supporting R.-C.K.C. We thank C. Archer, A. Gilbard, and O. Gomez for zebrafish husbandry at CU Anschutz, Dr. Victor Ruthig for microscopy support, Greg Crouch and Robert Murchison for administrative support, and past and present members of the Mosimann lab for constructive experimental and conceptual input. We thank Drs. Caroline and Geoff Burns for kindly sharing nkx2.5 myl7 TCF:mCherry Author contributions H.R.M. and C.M. conceived the project and designed the study. H.R.M. performed the zebrafish experiments together with A.L.G., R.-C.K.C., and F.W.R., supervised by A.B. and C.M. A.L.G. and R.G. performed and interpreted gene expression analysis via HCR-FISH in zebrafish embryos, supervised by C.B.L. and C.M. H.R.M. and F.W.R. prepared and interpreted the scRNA-seq. H.R.M. and R.O. processed and analyzed the scRNA-seq data. H.R.M. acquired cell tracking data with multidirectional SPIM and processed the data. O.O.N. and T.M.C. performed AFM experiments, supervised by B.P. O.O.N. performed bulk RNA-seq on rat cardiac and pericardia, supervised by C.C.S. H.R.M. compiled the data and H.R.M. and C.M. wrote the manuscript with input from all co-authors. Peer review Peer review information Nature Communications Data availability All sequencing datasets generated for this study have been deposited on the GEO database under accession code GSE282713 87 GRCz11 87 https://cuanschutz-devbio.shinyapps.io/Moran_scRNAseq/ https://zenodo.org/records/10171269 https://zenodo.org/records/10046399 https://cuanschutz-devbio.shinyapps.io/Moran_rat_bulkRNAseq/ 107 https://zebrahub.ds.czbiohub.org 106 Source data Code availability Code for all sequencing data included in this manuscript are available at https://github.com/rebeccaorourke-cu/Moran_scRNAseq_manuscript 81 https://github.com/DaetwylerStephan/multi_sample_SPIM Competing interests The authors declare no competing interests. References 1. Jaworska-Wilczynska M Trzaskoma P Szczepankiewicz AA Hryniewiecki T Pericardium: structure and function in health and disease Folia Histochem. Cytobiol. 2016 54 121 125 10.5603/FHC.a2016.0014 27654013 Jaworska-Wilczynska, M., Trzaskoma, P., Szczepankiewicz, A. A. & Hryniewiecki, T. Pericardium: structure and function in health and disease. Folia Histochem. Cytobiol. 54 27654013 10.5603/FHC.a2016.0014 2. Schulte I Schlueter J Abu-Issa R Brand T Männer J Morphological and molecular left-right asymmetries in the development of the proepicardium: a comparative analysis on mouse and chick embryos Dev. Dyn. 2007 236 684 695 10.1002/dvdy.21065 17238175 Schulte, I., Schlueter, J., Abu-Issa, R., Brand, T. & Männer, J. Morphological and molecular left-right asymmetries in the development of the proepicardium: a comparative analysis on mouse and chick embryos. Dev. Dyn. 236 17238175 10.1002/dvdy.21065 3. Ratajska A Czarnowska E Ciszek B Embryonic development of the proepicardium and coronary vessels Int. J. Dev. Biol. 2008 52 229 236 10.1387/ijdb.072340ar 18311713 Ratajska, A., Czarnowska, E. & Ciszek, B. Embryonic development of the proepicardium and coronary vessels. Int. J. Dev. Biol. 52 18311713 10.1387/ijdb.072340ar 4. Kruithof BPT BMP and FGF regulate the differentiation of multipotential pericardial mesoderm into the myocardial or epicardial lineage Dev. Biol. 2006 295 507 522 10.1016/j.ydbio.2006.03.033 16753139 Kruithof, B. P. T. et al. BMP and FGF regulate the differentiation of multipotential pericardial mesoderm into the myocardial or epicardial lineage. Dev. Biol. 295 16753139 10.1016/j.ydbio.2006.03.033 5. Shabetai R Function of the normal pericardium Clin. Cardiol. 1999 22 I4 I5 10.1002/clc.4960221304 9929760 PMC6655981 Shabetai, R. Function of the normal pericardium. Clin. Cardiol. 22 9929760 10.1002/clc.4960221304 PMC6655981 6. Deniset JF Gata6+ pericardial cavity macrophages relocate to the injured heart and prevent cardiac fibrosis Immunity 2019 51 131 140.e5 10.1016/j.immuni.2019.06.010 31315031 PMC7574643 Deniset, J. F. et al. Gata6+ pericardial cavity macrophages relocate to the injured heart and prevent cardiac fibrosis. Immunity 51 31315031 10.1016/j.immuni.2019.06.010 PMC7574643 7. Jurrens, T. L., Ammash, N. M. & OH, J. A. E. K. in (eds. Klein, A. L. & Garcia, M. J. B. T.-D.) Ch. 24 (W.B. Saunders, 2008). 8. Hammond HK White FC Bhargava V Shabetai R Heart size and maximal cardiac output are limited by the pericardium Am. J. Physiol. 1992 263 H1675 H1681 1481894 10.1152/ajpheart.1992.263.6.H1675 Hammond, H. K., White, F. C., Bhargava, V. & Shabetai, R. Heart size and maximal cardiac output are limited by the pericardium. Am. J. Physiol. 263 1481894 10.1152/ajpheart.1992.263.6.H1675 9. Xia Y Activation of a transient progenitor state in the epicardium is required for zebrafish heart regeneration Nat. Commun. 2022 13:1 2022 13 1 18 10.1038/s41467-022-35433-9 PMC9747719 36513650 Xia, Y. et al. Activation of a transient progenitor state in the epicardium is required for zebrafish heart regeneration. Nat. Commun. 2022 13:1 13 10.1038/s41467-022-35433-9 PMC9747719 36513650 10. Quijada P Trembley MA Small EM The role of the epicardium during heart development and repair Circ. Res. 2020 126 377 394 10.1161/CIRCRESAHA.119.315857 31999538 PMC7000171 Quijada, P., Trembley, M. A. & Small, E. M. The role of the epicardium during heart development and repair. Circ. Res. 126 31999538 10.1161/CIRCRESAHA.119.315857 PMC7000171 11. Duan J Wnt1/βcatenin injury response activates the epicardium and cardiac fibroblasts to promote cardiac repair EMBO J. 2012 31 429 10.1038/emboj.2011.418 22085926 PMC3261567 Duan, J. et al. Wnt1/βcatenin injury response activates the epicardium and cardiac fibroblasts to promote cardiac repair. EMBO J. 31 22085926 10.1038/emboj.2011.418 PMC3261567 12. Cao J Poss KD The epicardium as a hub for heart regeneration Nat. Rev. Cardiol. 2018 15 631 647 10.1038/s41569-018-0046-4 29950578 PMC6143401 Cao, J. & Poss, K. D. The epicardium as a hub for heart regeneration. Nat. Rev. Cardiol. 15 29950578 10.1038/s41569-018-0046-4 PMC6143401 13. Chiabrando, J. G. et al. Management of acute and recurrent pericarditis: JACC state-of-the-art review. J. Am. Coll. Cardiol. 14. Imazio, M. & Hoit, B. D. Review: post-cardiac injury syndromes. An emerging cause of pericardial diseases. Int. J. Cardiol. 10.1016/j.ijcard.2012.09.052 23040075 15. Borlaug BA Percutaneous pericardial resection: a novel potential treatment for heart failure with preserved ejection fraction Circ. Heart Fail. 2017 10 e003612 10.1161/CIRCHEARTFAILURE.116.003612 28396500 PMC5390814 Borlaug, B. A. et al. Percutaneous pericardial resection: a novel potential treatment for heart failure with preserved ejection fraction. Circ. Heart Fail. 10 28396500 10.1161/CIRCHEARTFAILURE.116.003612 PMC5390814 16. Kass DA Reverse remodeling from cardiomyoplasty in human heart failure. External constraint versus active assist Circulation 1995 91 2314 2318 10.1161/01.CIR.91.9.2314 7729016 Kass, D. A. et al. Reverse remodeling from cardiomyoplasty in human heart failure. External constraint versus active assist. Circulation 91 7729016 10.1161/01.cir.91.9.2314 17. Mutsaers SE Prêle CM Lansley SM Herrick SE The origin of regenerating mesothelium: a historical perspective Int. J. Artif. Organs. 2007 30 484 494 10.1177/039139880703000606 17628849 Mutsaers, S. E., Prêle, C. M., Lansley, S. M. & Herrick, S. E. The origin of regenerating mesothelium: a historical perspective. Int. J. Artif. Organs. 30 17628849 10.1177/039139880703000606 18. Prummel KD Hand2 delineates mesothelium progenitors and is reactivated in mesothelioma Nat. Commun. 2022 13 1 21 10.1038/s41467-022-29311-7 35354817 PMC8967825 Prummel, K. D. et al. Hand2 delineates mesothelium progenitors and is reactivated in mesothelioma. Nat. Commun. 13 35354817 10.1038/s41467-022-29311-7 PMC8967825 19. Que J Mesothelium contributes to vascular smooth muscle and mesenchyme during lung development Proc. Natl Acad. Sci. USA 2008 105 16626 16630 10.1073/pnas.0808649105 18922767 PMC2567908 Que, J. et al. Mesothelium contributes to vascular smooth muscle and mesenchyme during lung development. Proc. Natl Acad. Sci. USA 105 18922767 10.1073/pnas.0808649105 PMC2567908 20. Winters NI Thomason RT Bader DM Identification of a novel developmental mechanism in the generation of mesothelia Development 2012 139 2926 2934 10.1242/dev.082396 22764055 PMC3403102 Winters, N. I., Thomason, R. T. & Bader, D. M. Identification of a novel developmental mechanism in the generation of mesothelia. Development 139 22764055 10.1242/dev.082396 PMC3403102 21. Koopmans T Rinkevich Y Mesothelial to mesenchyme transition as a major developmental and pathological player in trunk organs and their cavities Commun. Biol. 2018 1 170 10.1038/s42003-018-0180-x 30345394 PMC6191446 Koopmans, T. & Rinkevich, Y. Mesothelial to mesenchyme transition as a major developmental and pathological player in trunk organs and their cavities. Commun. Biol. 1 30345394 10.1038/s42003-018-0180-x PMC6191446 22. Rinkevich Y Identification and prospective isolation of a mesothelial precursor lineage giving rise to smooth muscle cells and fibroblasts for mammalian internal organs and their vasculature Nat. Cell Biol. 2012 14 1251 1260 10.1038/ncb2610 23143399 PMC3685475 Rinkevich, Y. et al. Identification and prospective isolation of a mesothelial precursor lineage giving rise to smooth muscle cells and fibroblasts for mammalian internal organs and their vasculature. Nat. Cell Biol. 14 23143399 10.1038/ncb2610 PMC3685475 23. Tyser RCV Characterization of a common progenitor pool of the epicardium and myocardium Science 2021 371 eabb2986 10.1126/science.abb2986 33414188 PMC7615359 Tyser, R. C. V. et al. Characterization of a common progenitor pool of the epicardium and myocardium. Science 371 33414188 10.1126/science.abb2986 PMC7615359 24. Argüello C de la Cruz MV Gómez CS Experimental study of the formation of the heart tube in the chick embryo J. Embryol. Exp. Morphol. 1975 33 1 11 50396 Argüello, C., de la Cruz, M. V. & Gómez, C. S. Experimental study of the formation of the heart tube in the chick embryo. J. Embryol. Exp. Morphol. 33 50396 25. Witty AD The generation of the epicardial lineage from human pluripotent stem cells Nat. Biotechnol. 2014 32 1026 10.1038/nbt.3002 25240927 PMC4192149 Witty, A. D. et al. The generation of the epicardial lineage from human pluripotent stem cells. Nat. Biotechnol. 32 25240927 10.1038/nbt.3002 PMC4192149 26. Zhang Q Unveiling complexity and multipotentiality of early heart fields Circ. Res. 2021 129 474 487 10.1161/CIRCRESAHA.121.318943 34162224 PMC9308985 Zhang, Q. et al. Unveiling complexity and multipotentiality of early heart fields. Circ. Res. 129 34162224 10.1161/CIRCRESAHA.121.318943 PMC9308985 27. Hoit BD Anatomy and physiology of the pericardium Cardiol. Clin. 2017 35 481 490 29025540 10.1016/j.ccl.2017.07.002 Hoit, B. D. Anatomy and physiology of the pericardium. Cardiol. Clin. 35 29025540 10.1016/j.ccl.2017.07.002 28. Spodick DH The normal and diseased pericardium: current concepts of pericardial physiology, diagnosis and treatment J. Am. Coll. Cardiol. 1983 1 240 251 10.1016/S0735-1097(83)80025-4 6338077 Spodick, D. H. The normal and diseased pericardium: current concepts of pericardial physiology, diagnosis and treatment. J. Am. Coll. Cardiol. 1 6338077 10.1016/s0735-1097(83)80025-4 29. Shah AB Kronzon I Congenital defects of the pericardium: a review Eur. Heart J. Cardiovas. Imaging 2015 16 821 827 10.1093/ehjci/jev119 26003149 Shah, A. B. & Kronzon, I. Congenital defects of the pericardium: a review. Eur. Heart J. Cardiovas. Imaging 16 10.1093/ehjci/jev119 26003149 30. Ferretti E Hadjantonakis A-K Mesoderm specification and diversification: from single cells to emergent tissues Curr. Opin. Cell Biol. 2019 61 110 116 10.1016/j.ceb.2019.07.012 31476530 PMC6910985 Ferretti, E. & Hadjantonakis, A.-K. Mesoderm specification and diversification: from single cells to emergent tissues. Curr. Opin. Cell Biol. 61 31476530 10.1016/j.ceb.2019.07.012 PMC6910985 31. Meilhac SM Buckingham ME The deployment of cell lineages that form the mammalian heart Nat. Rev. Cardiol. 2018 1 705 724 10.1038/s41569-018-0086-9 30266935 Meilhac, S. M. & Buckingham, M. E. The deployment of cell lineages that form the mammalian heart. Nat. Rev. Cardiol. 1 10.1038/s41569-018-0086-9 30266935 32. Prummel, K. D., Nieuwenhuize, S. & Mosimann, C. The lateral plate mesoderm. Development 147 10.1242/dev.175059 PMC7328003 32561665 33. Stalsberg H DeHaan RL The precardiac areas and formation of the tubular heart in the chick embryo Dev. Biol. 1969 19 128 159 10.1016/0012-1606(69)90052-9 4180350 Stalsberg, H. & DeHaan, R. L. The precardiac areas and formation of the tubular heart in the chick embryo. Dev. Biol. 19 4180350 10.1016/0012-1606(69)90052-9 34. Meilhac SM A retrospective clonal analysis of the myocardium reveals two phases of clonal growth in the developing mouse heart Development 2003 130 3877 3889 10.1242/dev.00580 12835402 Meilhac, S. M. et al. A retrospective clonal analysis of the myocardium reveals two phases of clonal growth in the developing mouse heart. Development 130 12835402 10.1242/dev.00580 35. Stolfi A Early chordate origins of the vertebrate second heart field Science 2010 329 565 568 10.1126/science.1190181 20671188 PMC4970750 Stolfi, A. et al. Early chordate origins of the vertebrate second heart field. Science 329 20671188 10.1126/science.1190181 PMC4970750 36. Hami D Grimes AC Tsai HJ Kirby ML Zebrafish cardiac development requires a conserved secondary heart field Development 2011 138 2389 2398 10.1242/dev.061473 21558385 PMC3091499 Hami, D., Grimes, A. C., Tsai, H. J. & Kirby, M. L. Zebrafish cardiac development requires a conserved secondary heart field. Development 138 21558385 10.1242/dev.061473 PMC3091499 37. Verzi MP McCulley DJ De Val S Dodou E Black BL The right ventricle, outflow tract, and ventricular septum comprise a restricted expression domain within the secondary/anterior heart field Dev. Biol. 2005 287 134 145 10.1016/j.ydbio.2005.08.041 16188249 Verzi, M. P., McCulley, D. J., De Val, S., Dodou, E. & Black, B. L. The right ventricle, outflow tract, and ventricular septum comprise a restricted expression domain within the secondary/anterior heart field. Dev. Biol. 287 16188249 10.1016/j.ydbio.2005.08.041 38. Mommersteeg MTM The sinus venosus progenitors separate and diversify from the first and second heart fields early in development Cardiovasc. Res. 2010 87 92 101 10.1093/cvr/cvq033 20110338 Mommersteeg, M. T. M. et al. The sinus venosus progenitors separate and diversify from the first and second heart fields early in development. Cardiovasc. Res. 87 20110338 10.1093/cvr/cvq033 39. Zhou Y Latent TGF-β binding protein 3 identifies a second heart field in zebrafish Nature 2011 474 645 648 10.1038/nature10094 21623370 PMC3319150 Zhou, Y. et al. Latent TGF-β binding protein 3 identifies a second heart field in zebrafish. Nature 474 21623370 10.1038/nature10094 PMC3319150 40. de Pater E Distinct phases of cardiomyocyte differentiation regulate growth of the zebrafish heart Development 2009 136 1633 1641 10.1242/dev.030924 19395641 PMC2673760 de Pater, E. et al. Distinct phases of cardiomyocyte differentiation regulate growth of the zebrafish heart. Development 136 19395641 10.1242/dev.030924 PMC2673760 41. Lescroart, F., Dumas, C. E., Adachi, N. & Kelly, R. G. Emergence of heart and branchiomeric muscles in cardiopharyngeal mesoderm. Exp. Cell Res 410 10.1016/j.yexcr.2021.112931 34798131 42. Swedlund, B. & Lescroart, F. Cardiopharyngeal progenitor specification: multiple roads to the heart and head muscles. Cold Spring Harb. Perspect. Biol 10.1101/cshperspect.a036731 PMC7397823 31818856 43. Diogo R A new heart for a new head in vertebrate cardiopharyngeal evolution Nature 2015 520 466 473 10.1038/nature14435 25903628 PMC4851342 Diogo, R. et al. A new heart for a new head in vertebrate cardiopharyngeal evolution. Nature 520 25903628 10.1038/nature14435 PMC4851342 44. Kaplan N Razy-Krajka F Christiaen L Regulation and evolution of cardiopharyngeal cell identity and behavior: insights from simple chordates Curr. Opin. Genet. Dev. 2015 32 119 128 10.1016/j.gde.2015.02.008 25819888 PMC4470797 Kaplan, N., Razy-Krajka, F. & Christiaen, L. Regulation and evolution of cardiopharyngeal cell identity and behavior: insights from simple chordates. Curr. Opin. Genet. Dev. 32 25819888 10.1016/j.gde.2015.02.008 PMC4470797 45. Razy-Krajka F An FGF-driven feed-forward circuit patterns the cardiopharyngeal mesoderm in space and time Elife 2018 7 e29656 10.7554/eLife.29656 29431097 PMC5809146 Razy-Krajka, F. et al. An FGF-driven feed-forward circuit patterns the cardiopharyngeal mesoderm in space and time. Elife 7 29431097 10.7554/eLife.29656 PMC5809146 46. Nomaru H Single cell multi-omic analysis identifies a Tbx1-dependent multilineage primed population in murine cardiopharyngeal mesoderm Nat. Commun. 2021 12 1 19 10.1038/s41467-021-26966-6 34789765 PMC8599455 Nomaru, H. et al. Single cell multi-omic analysis identifies a Tbx1-dependent multilineage primed population in murine cardiopharyngeal mesoderm. Nat. Commun. 12 34789765 10.1038/s41467-021-26966-6 PMC8599455 47. Mahadevan NR Horton AC Gibson-Brown JJ Developmental expression of the amphioxus Tbx1/10 gene illuminates the evolution of vertebrate branchial arches and sclerotome Dev. Genes Evol. 2004 214 559 566 10.1007/s00427-004-0433-1 15372236 Mahadevan, N. R., Horton, A. C. & Gibson-Brown, J. J. Developmental expression of the amphioxus Tbx1/10 gene illuminates the evolution of vertebrate branchial arches and sclerotome. Dev. Genes Evol. 214 15372236 10.1007/s00427-004-0433-1 48. Huynh T Chen L Terrell P Baldini A A fate map of Tbx1 expressing cells reveals heterogeneity in the second cardiac field Genesis 2007 45 470 475 10.1002/dvg.20317 17610275 Huynh, T., Chen, L., Terrell, P. & Baldini, A. A fate map of Tbx1 expressing cells reveals heterogeneity in the second cardiac field. Genesis 45 17610275 10.1002/dvg.20317 49. Heude E Co-option of neck muscles supported the vertebrate water-to-land transition Nat. Commun. 2024 15 10564 10.1038/s41467-024-54724-x 39632846 PMC11618326 Heude, E. et al. Co-option of neck muscles supported the vertebrate water-to-land transition. Nat. Commun. 15 39632846 10.1038/s41467-024-54724-x PMC11618326 50. Kemmler CL Riemslagh FW Moran HR Mosimann C From stripes to a beating heart: early cardiac development in zebrafish J. Cardiovasc. Dev. Dis. 2021 8 17 33578943 10.3390/jcdd8020017 PMC7916704 Kemmler, C. L., Riemslagh, F. W., Moran, H. R. & Mosimann, C. From stripes to a beating heart: early cardiac development in zebrafish. J. Cardiovasc. Dev. Dis. 8 33578943 10.3390/jcdd8020017 PMC7916704 51. Rinkevich Y Identification and prospective isolation of a mesothelial precursor lineage giving rise to smooth muscle cells and fibroblasts for mammalian internal organs, and their vasculature Nat. Cell Biol. 2012 14 1251 1260 10.1038/ncb2610 23143399 PMC3685475 Rinkevich, Y. et al. Identification and prospective isolation of a mesothelial precursor lineage giving rise to smooth muscle cells and fibroblasts for mammalian internal organs, and their vasculature. Nat. Cell Biol. 14 23143399 10.1038/ncb2610 PMC3685475 52. Meilhac SMSM Esner M Kelly RGG Nicolas J-FJF Buckingham MEE The clonal origin of myocardial cells in different regions of the embryonic mouse heart Dev. Cell 2004 6 685 698 10.1016/S1534-5807(04)00133-9 15130493 Meilhac, S. M. S. M., Esner, M., Kelly, R. G. G., Nicolas, J.-F. J. F. & Buckingham, M. E. E. The clonal origin of myocardial cells in different regions of the embryonic mouse heart. Dev. Cell 6 15130493 10.1016/s1534-5807(04)00133-9 53. Peralta M González-Rosa JM Marques IJ Mercader N The epicardium in the embryonic and adult zebrafish J. Dev. Biol. 2014 2 101 116 10.3390/jdb2020101 24926432 PMC4050495 Peralta, M., González-Rosa, J. M., Marques, I. J. & Mercader, N. The epicardium in the embryonic and adult zebrafish. J. Dev. Biol. 2 24926432 10.3390/jdb2020101 PMC4050495 54. Serluca FC Development of the proepicardial organ in the zebrafish Dev. Biol. 2008 315 18 27 10.1016/j.ydbio.2007.10.007 18206866 Serluca, F. C. Development of the proepicardial organ in the zebrafish. Dev. Biol. 315 18206866 10.1016/j.ydbio.2007.10.007 55. Evans SM Yelon D Conlon FL Kirby ML Myocardial lineage development Circ. Res 2010 107 1428 1444 10.1161/CIRCRESAHA.110.227405 21148449 PMC3073310 Evans, S. M., Yelon, D., Conlon, F. L. & Kirby, M. L. Myocardial lineage development. Circ. Res 107 21148449 10.1161/CIRCRESAHA.110.227405 PMC3073310 56. Cortes C Francou A De Bono C Kelly RG Epithelial properties of the second heart field Circ. Res. 2018 122 142 154 10.1161/CIRCRESAHA.117.310838 29301846 Cortes, C., Francou, A., De Bono, C. & Kelly, R. G. Epithelial properties of the second heart field. Circ. Res. 122 29301846 10.1161/CIRCRESAHA.117.310838 57. Sparrow DB Kotecha S Towers N Mohun TJ Xenopus eHAND: a marker for the developing cardiovascular system of the embryo that is regulated by bone morphogenetic proteins Mech. Dev. 1998 71 151 163 10.1016/S0925-4773(98)00010-0 9507100 Sparrow, D. B., Kotecha, S., Towers, N. & Mohun, T. J. Xenopus eHAND: a marker for the developing cardiovascular system of the embryo that is regulated by bone morphogenetic proteins. Mech. Dev. 71 9507100 10.1016/s0925-4773(98)00010-0 58. Gibb N Lavery DL Hoppler S sfrp1 promotes cardiomyocyte differentiation in Xenopus via negative-feedback regulation of Wnt signalling Development 2013 140 1537 1549 10.1242/dev.088047 23482489 PMC4074298 Gibb, N., Lavery, D. L. & Hoppler, S. sfrp1 promotes cardiomyocyte differentiation in Xenopus via negative-feedback regulation of Wnt signalling. Development 140 23482489 10.1242/dev.088047 PMC4074298 59. Yamamoto T Positive feedback regulation of frizzled-7 expression robustly shapes a steep Wnt gradient in Xenopus heart development, together with sFRP1 and heparan sulfate Elife 2022 11 e73818 10.7554/eLife.73818 35942683 PMC9363125 Yamamoto, T. et al. Positive feedback regulation of frizzled-7 expression robustly shapes a steep Wnt gradient in Xenopus heart development, together with sFRP1 and heparan sulfate. Elife 11 35942683 10.7554/eLife.73818 PMC9363125 60. Abu-Elmagd M Mulvaney J Wheeler GN Frizzled-7 is required for Xenopus heart development Biol. Open 2017 6 1861 29101100 10.1242/bio.026963 PMC5769647 Abu-Elmagd, M., Mulvaney, J. & Wheeler, G. N. Frizzled-7 is required for Xenopus heart development. Biol. Open 6 29101100 10.1242/bio.026963 PMC5769647 61. Bargehr J Epicardial cells derived from human embryonic stem cells augment cardiomyocyte-driven heart regeneration Nat. Biotechnol. 2019 37 895 906 10.1038/s41587-019-0197-9 31375810 PMC6824587 Bargehr, J. et al. Epicardial cells derived from human embryonic stem cells augment cardiomyocyte-driven heart regeneration. Nat. Biotechnol. 37 31375810 10.1038/s41587-019-0197-9 PMC6824587 62. Tan JJ Human iPS-derived pre-epicardial cells direct cardiomyocyte aggregation expansion and organization in vitro Nat. Commun. 2021 12 1 19 10.1038/s41467-021-24921-z 34404774 PMC8370973 Tan, J. J. et al. Human iPS-derived pre-epicardial cells direct cardiomyocyte aggregation expansion and organization in vitro. Nat. Commun. 12 34404774 10.1038/s41467-021-24921-z PMC8370973 63. Rao KS Spees JL Harnessing epicardial progenitor cells and their derivatives for rescue and repair of cardiac tissue after myocardial infarction Curr. Mol. Biol. Rep. 2017 3 149 10.1007/s40610-017-0066-6 29057207 PMC5648015 Rao, K. S. & Spees, J. L. Harnessing epicardial progenitor cells and their derivatives for rescue and repair of cardiac tissue after myocardial infarction. Curr. Mol. Biol. Rep. 3 29057207 10.1007/s40610-017-0066-6 PMC5648015 64. Yin C Kikuchi K Hochgreb T Poss KD Stainier DYR Hand2 regulates extracellular matrix remodeling essential for gut-looping morphogenesis in zebrafish Dev. Cell 2010 18 973 984 10.1016/j.devcel.2010.05.009 20627079 PMC2908152 Yin, C., Kikuchi, K., Hochgreb, T., Poss, K. D. & Stainier, D. Y. R. Hand2 regulates extracellular matrix remodeling essential for gut-looping morphogenesis in zebrafish. Dev. Cell 18 20627079 10.1016/j.devcel.2010.05.009 PMC2908152 65. Chi NC Foxn4 directly regulates tbx2b expression and atrioventricular canal formation Genes Dev. 2008 22 734 739 10.1101/gad.1629408 18347092 PMC2275426 Chi, N. C. et al. Foxn4 directly regulates tbx2b expression and atrioventricular canal formation. Genes Dev. 22 18347092 10.1101/gad.1629408 PMC2275426 66. Sánchez-Iranzo H Tbx5a lineage tracing shows cardiomyocyte plasticity during zebrafish heart regeneration Nat. Commun. 2018 9 428 10.1038/s41467-017-02650-6 29382818 PMC5789846 Sánchez-Iranzo, H. et al. Tbx5a lineage tracing shows cardiomyocyte plasticity during zebrafish heart regeneration. Nat. Commun. 9 29382818 10.1038/s41467-017-02650-6 PMC5789846 67. Mosimann C Chamber identity programs drive early functional partitioning of the heart Nat. Commun. 2015 6 8146 10.1038/ncomms9146 26306682 PMC4560818 Mosimann, C. et al. Chamber identity programs drive early functional partitioning of the heart. Nat. Commun. 6 26306682 10.1038/ncomms9146 PMC4560818 68. Olson EN Gene regulatory networks in the evolution and development of the heart Science 2006 313 1922 1927 10.1126/science.1132292 17008524 PMC4459601 Olson, E. N. Gene regulatory networks in the evolution and development of the heart. Science 313 17008524 10.1126/science.1132292 PMC4459601 69. Chen J-N Fishman MC Zebrafish tinman homolog demarcates the heart field and initiates myocardial differentiation Development 1996 122 3809 3816 10.1242/dev.122.12.3809 9012502 Chen, J.-N. & Fishman, M. C. Zebrafish tinman homolog demarcates the heart field and initiates myocardial differentiation. Development 122 9012502 10.1242/dev.122.12.3809 70. Guner-Ataman B Zebrafish second heart field development relies on progenitor specification in anterior lateral plate mesoderm and nkx2.5 function Development 2013 140 1353 1363 10.1242/dev.088351 23444361 PMC3585667 Guner-Ataman, B. et al. Zebrafish second heart field development relies on progenitor specification in anterior lateral plate mesoderm and nkx2.5 function. Development 140 23444361 10.1242/dev.088351 PMC3585667 71. Ren J Canonical Wnt5b signaling directs outlying Nkx2.5+ mesoderm into pacemaker cardiomyocytes Dev. Cell 2019 50 729 743.e5 10.1016/j.devcel.2019.07.014 31402282 PMC6759400 Ren, J. et al. Canonical Wnt5b signaling directs outlying Nkx2.5+ mesoderm into pacemaker cardiomyocytes. Dev. Cell 50 31402282 10.1016/j.devcel.2019.07.014 PMC6759400 72. Paffett-Lugassy N Heart field origin of great vessel precursors relies on nkx2.5-mediated vasculogenesis Nat. Cell Biol. 2013 15 1362 1369 10.1038/ncb2862 24161929 PMC3864813 Paffett-Lugassy, N. et al. Heart field origin of great vessel precursors relies on nkx2.5-mediated vasculogenesis. Nat. Cell Biol. 15 24161929 10.1038/ncb2862 PMC3864813 73. Yamagishi H The combinatorial activities of Nkx2.5 and dHAND are essential for cardiac ventricle formation Dev. Biol. 2001 239 190 203 10.1006/dbio.2001.0417 11784028 Yamagishi, H. et al. The combinatorial activities of Nkx2.5 and dHAND are essential for cardiac ventricle formation. Dev. Biol. 239 11784028 10.1006/dbio.2001.0417 74. Schindler YL Hand2 elevates cardiomyocyte production during zebrafish heart development and regeneration Development 2014 141 3112 3122 10.1242/dev.106336 25038045 PMC4197543 Schindler, Y. L. et al. Hand2 elevates cardiomyocyte production during zebrafish heart development and regeneration. Development 141 25038045 10.1242/dev.106336 PMC4197543 75. Yelon D The bHLH transcription factor hand2 plays parallel roles in zebrafish heart and pectoral fin development Development 2000 127 2573 2582 10.1242/dev.127.12.2573 10821756 Yelon, D. et al. The bHLH transcription factor hand2 plays parallel roles in zebrafish heart and pectoral fin development. Development 127 10821756 10.1242/dev.127.12.2573 76. Chen L Fulcoli FG Tang S Baldini A Tbx1 regulates proliferation and differentiation of multipotent heart progenitors Circ. Res. 2009 105 842 851 10.1161/CIRCRESAHA.109.200295 19745164 PMC2796444 Chen, L., Fulcoli, F. G., Tang, S. & Baldini, A. Tbx1 regulates proliferation and differentiation of multipotent heart progenitors. Circ. Res. 105 19745164 10.1161/CIRCRESAHA.109.200295 PMC2796444 77. Scambler PJ 22q11 Deletion syndrome: a role for TBX1 in pharyngeal and cardiovascular development Pediatr. Cardiol. 2010 31 378 390 10.1007/s00246-009-9613-0 20054531 Scambler, P. J. 22q11 Deletion syndrome: a role for TBX1 in pharyngeal and cardiovascular development. Pediatr. Cardiol. 31 20054531 10.1007/s00246-009-9613-0 78. Jerome LA Papaioannou VE DiGeorge syndrome phenotype in mice mutant for the T-box gene, Tbx1 Nat. Genet. 2001 27 286 291 10.1038/85845 11242110 Jerome, L. A. & Papaioannou, V. E. DiGeorge syndrome phenotype in mice mutant for the T-box gene, Tbx1. Nat. Genet. 27 11242110 10.1038/85845 79. Felker A Continuous addition of progenitors forms the cardiac ventricle in zebrafish Nat. Commun. 2018 9 2001 10.1038/s41467-018-04402-6 29784942 PMC5962599 Felker, A. et al. Continuous addition of progenitors forms the cardiac ventricle in zebrafish. Nat. Commun. 9 29784942 10.1038/s41467-018-04402-6 PMC5962599 80. Huisken J Swoger J Del Bene F Wittbrodt J Stelzer EHK Optical sectioning deep inside live embryos by selective plane illumination microscopy Science 2004 305 1007 1009 10.1126/science.1100035 15310904 Huisken, J., Swoger, J., Del Bene, F., Wittbrodt, J. & Stelzer, E. H. K. Optical sectioning deep inside live embryos by selective plane illumination microscopy. Science 305 15310904 10.1126/science.1100035 81. Daetwyler S Günther U Modes CD Harrington K Huisken J Multi-sample SPIM image acquisition, processing and analysis of vascular growth in zebrafish Development 2019 146 dev173757 10.1242/dev.173757 30824551 PMC6451323 Daetwyler, S., Günther, U., Modes, C. D., Harrington, K. & Huisken, J. Multi-sample SPIM image acquisition, processing and analysis of vascular growth in zebrafish. Development 146 30824551 10.1242/dev.173757 PMC6451323 82. Aguillon R Cell-type heterogeneity in the early zebrafish olfactory epithelium is generated from progenitors within preplacodal ectoderm Elife 2018 7 e32041 10.7554/eLife.32041 29292696 PMC5749950 Aguillon, R. et al. Cell-type heterogeneity in the early zebrafish olfactory epithelium is generated from progenitors within preplacodal ectoderm. Elife 7 29292696 10.7554/eLife.32041 PMC5749950 83. Stainier DY Lee RK Fishman MC Cardiovascular development in the zebrafish. I. Myocardial fate map and heart tube formation Development 1993 119 31 40 10.1242/dev.119.1.31 8275863 Stainier, D. Y., Lee, R. K. & Fishman, M. C. Cardiovascular development in the zebrafish. I. Myocardial fate map and heart tube formation. Development 119 8275863 10.1242/dev.119.1.31 84. Abukar S Early coordination of cell migration and cardiac fate determination during mammalian gastrulation EMBO J. 2025 44 3327 3359 10.1038/s44318-025-00441-0 40360834 PMC12170898 Abukar, S. et al. Early coordination of cell migration and cardiac fate determination during mammalian gastrulation. EMBO J. 44 40360834 10.1038/s44318-025-00441-0 PMC12170898 85. Ivanovitch K Temiño S Torres M Live imaging of heart tube development in mouse reveals alternating phases of cardiac differentiation and morphogenesis Elife 2017 6 e30668 10.7554/eLife.30668 29202929 PMC5731822 Ivanovitch, K., Temiño, S. & Torres, M. Live imaging of heart tube development in mouse reveals alternating phases of cardiac differentiation and morphogenesis. Elife 6 29202929 10.7554/eLife.30668 PMC5731822 86. Dominguez MH Krup AL Muncie JM Correspondence BGB Graded mesoderm assembly governs cell fate and morphogenesis of the early mammalian heart Cell 2023 186 479 496.e23 10.1016/j.cell.2023.01.001 36736300 PMC10091855 Dominguez, M. H., Krup, A. L., Muncie, J. M. & Correspondence, B. G. B. Graded mesoderm assembly governs cell fate and morphogenesis of the early mammalian heart. Cell 186 36736300 10.1016/j.cell.2023.01.001 PMC10091855 87. Hao Y Integrated analysis of multimodal single-cell data Cell 2021 184 3573 3587.e29 10.1016/j.cell.2021.04.048 34062119 PMC8238499 Hao, Y. et al. Integrated analysis of multimodal single-cell data. Cell 184 34062119 10.1016/j.cell.2021.04.048 PMC8238499 88. Farrell JA Single-cell reconstruction of developmental trajectories during zebrafish embryogenesis Science 2018 360 eaar3131 10.1126/science.aar3131 29700225 PMC6247916 Farrell, J. A. et al. Single-cell reconstruction of developmental trajectories during zebrafish embryogenesis. Science 360 29700225 10.1126/science.aar3131 PMC6247916 89. Wagner DE Single-cell mapping of gene expression landscapes and lineage in the zebrafish embryo Science 2018 360 981 987 10.1126/science.aar4362 29700229 PMC6083445 Wagner, D. E. et al. Single-cell mapping of gene expression landscapes and lineage in the zebrafish embryo. Science 360 29700229 10.1126/science.aar4362 PMC6083445 90. Mattonet K Endothelial versus pronephron fate decision is modulated by the transcription factors Cloche/Npas4l, Tal1, and Lmo2 Sci. Adv. 2022 8 31 10.1126/sciadv.abn2082 PMC9432843 36044573 Mattonet, K. et al. Endothelial versus pronephron fate decision is modulated by the transcription factors Cloche/Npas4l, Tal1, and Lmo2. Sci. Adv. 8 10.1126/sciadv.abn2082 PMC9432843 36044573 91. Liao EC SCL/Tal-1 transcription factor acts downstream of cloche to specify hematopoietic and vascular progenitors in zebrafish Genes Dev. 1998 12 621 626 10.1101/gad.12.5.621 9499398 PMC316577 Liao, E. C. et al. SCL/Tal-1 transcription factor acts downstream of cloche to specify hematopoietic and vascular progenitors in zebrafish. Genes Dev. 12 9499398 10.1101/gad.12.5.621 PMC316577 92. Cooney JD Teleost growth factor independence (gfi) genes differentially regulate successive waves of hematopoiesis Dev. Biol. 2013 373 431 441 10.1016/j.ydbio.2012.08.015 22960038 PMC3532562 Cooney, J. D. et al. Teleost growth factor independence (gfi) genes differentially regulate successive waves of hematopoiesis. Dev. Biol. 373 22960038 10.1016/j.ydbio.2012.08.015 PMC3532562 93. Zhu H Regulation of the lmo2 promoter during hematopoietic and vascular development in zebrafish Dev. Biol. 2005 281 256 269 10.1016/j.ydbio.2005.01.034 15893977 Zhu, H. et al. Regulation of the lmo2 promoter during hematopoietic and vascular development in zebrafish. Dev. Biol. 281 15893977 10.1016/j.ydbio.2005.01.034 94. Gibb N Hey2 regulates the size of the cardiac progenitor pool during vertebrate heart development Development 2018 145 dev167510 10.1242/dev.167510 30355727 Gibb, N. et al. Hey2 regulates the size of the cardiac progenitor pool during vertebrate heart development. Development 145 30355727 10.1242/dev.167510 95. Just S Tbx20 is an essential regulator of embryonic heart growth in zebrafish PLoS ONE 2016 11 e0167306 10.1371/journal.pone.0167306 27907103 PMC5132222 Just, S. et al. Tbx20 is an essential regulator of embryonic heart growth in zebrafish. PLoS ONE 11 27907103 10.1371/journal.pone.0167306 PMC5132222 96. Mansour F The centrosomal protein 83 (CEP83) regulates human pluripotent stem cell differentiation toward the kidney lineage Elife 2022 11 e80165 10.7554/eLife.80165 36222666 PMC9629839 Mansour, F. et al. The centrosomal protein 83 (CEP83) regulates human pluripotent stem cell differentiation toward the kidney lineage. Elife 11 36222666 10.7554/eLife.80165 PMC9629839 97. Prummel KD A conserved regulatory program initiates lateral plate mesoderm emergence across chordates Nat. Commun. 2019 10 3857 10.1038/s41467-019-11561-7 31451684 PMC6710290 Prummel, K. D. et al. A conserved regulatory program initiates lateral plate mesoderm emergence across chordates. Nat. Commun. 10 31451684 10.1038/s41467-019-11561-7 PMC6710290 98. Metikala S Integration of vascular progenitors into functional blood vessels represents a distinct mechanism of vascular growth Dev. Cell 2022 57 767 782.e6 10.1016/j.devcel.2022.02.015 35276066 PMC9365108 Metikala, S. et al. Integration of vascular progenitors into functional blood vessels represents a distinct mechanism of vascular growth. Dev. Cell 57 35276066 10.1016/j.devcel.2022.02.015 PMC9365108 99. Thisse, C. & Thisse, B. High throughput expression analysis of ZF-models consortium clones. ZFIN Direct Data Submission. https://zfin.org/ZDB-PUB-051025-1 100. Bradford YM Zebrafish information network, the knowledgebase for Danio rerio Genetics 2022 220 iyac016 10.1093/genetics/iyac016 35166825 PMC8982015 Bradford, Y. M. et al. Zebrafish information network, the knowledgebase for Danio rerio Genetics 220 35166825 10.1093/genetics/iyac016 PMC8982015 101. Williams RM Lukoseviciute M Sauka-Spengler T Bronner ME Single-cell atlas of early chick development reveals gradual segregation of neural crest lineage from the neural plate border during neurulation Elife 2022 11 e74464 10.7554/eLife.74464 35088714 PMC8798042 Williams, R. M., Lukoseviciute, M., Sauka-Spengler, T. & Bronner, M. E. Single-cell atlas of early chick development reveals gradual segregation of neural crest lineage from the neural plate border during neurulation. Elife 11 35088714 10.7554/eLife.74464 PMC8798042 102. Trapnell C The dynamics and regulators of cell fate decisions are revealed by pseudotemporal ordering of single cells Nat. Biotechnol. 2014 32 381 386 10.1038/nbt.2859 24658644 PMC4122333 Trapnell, C. et al. The dynamics and regulators of cell fate decisions are revealed by pseudotemporal ordering of single cells. Nat. Biotechnol. 32 24658644 10.1038/nbt.2859 PMC4122333 103. Bendall SC Single-cell trajectory detection uncovers progression and regulatory coordination in human B cell development Cell 2014 157 714 725 10.1016/j.cell.2014.04.005 24766814 PMC4045247 Bendall, S. C. et al. Single-cell trajectory detection uncovers progression and regulatory coordination in human B cell development. Cell 157 24766814 10.1016/j.cell.2014.04.005 PMC4045247 104. Campbell, K., Ponting, C. P. & Webber, C. Laplacian eigenmaps and principal curves for high resolution pseudotemporal ordering of single-cell RNA-seq profiles. Preprint at bioRxiv 105. Ji Z Ji H TSCAN: pseudo-time reconstruction and evaluation in single-cell RNA-seq analysis Nucleic Acids Res. 2016 44 e117 e117 10.1093/nar/gkw430 27179027 PMC4994863 Ji, Z. & Ji, H. TSCAN: pseudo-time reconstruction and evaluation in single-cell RNA-seq analysis. Nucleic Acids Res. 44 27179027 10.1093/nar/gkw430 PMC4994863 106. Street K Slingshot: cell lineage and pseudotime inference for single-cell transcriptomics BMC Genomics 2018 19 477 10.1186/s12864-018-4772-0 29914354 PMC6007078 Street, K. et al. Slingshot: cell lineage and pseudotime inference for single-cell transcriptomics. BMC Genomics 19 29914354 10.1186/s12864-018-4772-0 PMC6007078 107. Lange, M. et al. A multimodal zebrafish developmental atlas reveals the state-transition dynamics of late-vertebrate pluripotent axial progenitors. Cell 187 10.1016/j.cell.2024.09.047 39454574 108. Han L Single cell transcriptomics identifies a signaling network coordinating endoderm and mesoderm diversification during foregut organogenesis Nat. Commun. 2020 11 4158 10.1038/s41467-020-17968-x 32855417 PMC7453027 Han, L. et al. Single cell transcriptomics identifies a signaling network coordinating endoderm and mesoderm diversification during foregut organogenesis. Nat. Commun. 11 32855417 10.1038/s41467-020-17968-x PMC7453027 109. Kishimoto K Bidirectional Wnt signaling between endoderm and mesoderm confers tracheal identity in mouse and human cells Nat. Commun. 2020 11 4159 10.1038/s41467-020-17969-w 32855415 PMC7453000 Kishimoto, K. et al. Bidirectional Wnt signaling between endoderm and mesoderm confers tracheal identity in mouse and human cells. Nat. Commun. 11 32855415 10.1038/s41467-020-17969-w PMC7453000 110. Hinits Y Zebrafish Mef2ca and Mef2cb are essential for both first and second heart field cardiomyocyte differentiation Dev. Biol. 2012 369 199 210 10.1016/j.ydbio.2012.06.019 22750409 PMC3927553 Hinits, Y. et al. Zebrafish Mef2ca and Mef2cb are essential for both first and second heart field cardiomyocyte differentiation. Dev. Biol. 369 22750409 10.1016/j.ydbio.2012.06.019 PMC3927553 111. Lazic S Scott IC Mef2cb regulates late myocardial cell addition from a second heart field-like population of progenitors in zebrafish Dev. Biol. 2011 354 123 133 10.1016/j.ydbio.2011.03.028 21466801 Lazic, S. & Scott, I. C. Mef2cb regulates late myocardial cell addition from a second heart field-like population of progenitors in zebrafish. Dev. Biol. 354 21466801 10.1016/j.ydbio.2011.03.028 112. Bisgrove BW Essner JJ Yost HJ Bisgrove BW Yost HJ Multiple pathways in the midline regulate concordant brain, heart and gut left-right asymmetry Development 2000 127 3567 3579 10.1242/dev.127.16.3567 10903181 Bisgrove, B. W., Essner, J. J., Yost, H. J., Bisgrove, B. W. & Yost, H. J. Multiple pathways in the midline regulate concordant brain, heart and gut left-right asymmetry. Development 127 10903181 10.1242/dev.127.16.3567 113. Arceci RJ King AA Simon MC Orkin SH Wilson DB Mouse GATA-4: a retinoic acid-inducible GATA-binding transcription factor expressed in endodermally derived tissues and heart Mol. Cell Biol. 1993 13 2235 2246 8455608 10.1128/mcb.13.4.2235 PMC359544 Arceci, R. J., King, A. A., Simon, M. C., Orkin, S. H. & Wilson, D. B. Mouse GATA-4: a retinoic acid-inducible GATA-binding transcription factor expressed in endodermally derived tissues and heart. Mol. Cell Biol. 13 8455608 10.1128/mcb.13.4.2235 PMC359544 114. Lickert H Formation of multiple hearts in mice following deletion of β-catenin in the embryonic endoderm Dev. Cell 2002 3 171 181 10.1016/S1534-5807(02)00206-X 12194849 Lickert, H. et al. Formation of multiple hearts in mice following deletion of β-catenin in the embryonic endoderm. Dev. Cell 3 12194849 10.1016/s1534-5807(02)00206-x 115. Alexander J Rothenberg M Henry GL Stainier DY Casanova plays an early and essential role in endoderm formation in zebrafish Dev. Biol. 1999 215 343 357 10.1006/dbio.1999.9441 10545242 Alexander, J., Rothenberg, M., Henry, G. L. & Stainier, D. Y. Casanova plays an early and essential role in endoderm formation in zebrafish. Dev. Biol. 215 10545242 10.1006/dbio.1999.9441 116. Ye D Xie H Hu B Lin F Endoderm convergence controls subduction of the myocardial precursors during heart-tube formation Development 2015 142 2928 2940 10.1242/dev.113944 26329600 PMC10682956 Ye, D., Xie, H., Hu, B. & Lin, F. Endoderm convergence controls subduction of the myocardial precursors during heart-tube formation. Development 142 26329600 10.1242/dev.113944 PMC10682956 117. Dickmeis T A crucial component of the endoderm formation pathway, CASANOVA, is encoded by a novel sox-related gene Genes Dev. 2001 15 1487 1492 10.1101/gad.196901 11410529 PMC312720 Dickmeis, T. et al. A crucial component of the endoderm formation pathway, CASANOVA, is encoded by a novel sox-related gene. Genes Dev. 15 11410529 10.1101/gad.196901 PMC312720 118. Kikuchi Y casanova encodes a novel Sox-related protein necessary and sufficient for early endoderm formation in zebrafish Genes Dev. 2001 15 1493 1505 10.1101/gad.892301 11410530 PMC312713 Kikuchi, Y. et al. casanova encodes a novel Sox-related protein necessary and sufficient for early endoderm formation in zebrafish. Genes Dev. 15 11410530 10.1101/gad.892301 PMC312713 119. Chen JN Mutations affecting the cardiovascular system and other internal organs in zebrafish Development 1996 123 293 302 10.1242/dev.123.1.293 9007249 Chen, J. N. et al. Mutations affecting the cardiovascular system and other internal organs in zebrafish. Development 123 9007249 10.1242/dev.123.1.293 120. Tzung KW A median fin derived from the lateral plate mesoderm and the origin of paired fins Nature 2023 618 543 549 10.1038/s41586-023-06100-w 37225983 PMC10266977 Tzung, K. W. et al. A median fin derived from the lateral plate mesoderm and the origin of paired fins. Nature 618 37225983 10.1038/s41586-023-06100-w PMC10266977 121. Miller CT Yelon D Stainier DYR Kimmel CB Two endothelin 1 effectors, hand2 and bapx1, pattern ventral pharyngeal cartilage and the jaw joint Development 2003 130 1353 1365 10.1242/dev.00339 12588851 Miller, C. T., Yelon, D., Stainier, D. Y. R. & Kimmel, C. B. Two endothelin 1 effectors, hand2 and bapx1, pattern ventral pharyngeal cartilage and the jaw joint. Development 130 12588851 10.1242/dev.00339 122. Garavito-Aguilar ZV Riley HE Yelon D Hand2 ensures an appropriate environment for cardiac fusion by limiting fibronectin function Development 2010 137 3215 3220 10.1242/dev.052225 20724450 PMC2934734 Garavito-Aguilar, Z. V., Riley, H. E. & Yelon, D. Hand2 ensures an appropriate environment for cardiac fusion by limiting fibronectin function. Development 137 20724450 10.1242/dev.052225 PMC2934734 123. Zhou Y Metascape provides a biologist-oriented resource for the analysis of systems-level datasets Nat. Commun. 2019 10 1523 10.1038/s41467-019-09234-6 30944313 PMC6447622 Zhou, Y. et al. Metascape provides a biologist-oriented resource for the analysis of systems-level datasets. Nat. Commun. 10 30944313 10.1038/s41467-019-09234-6 PMC6447622 124. Mosimann C Hausmann G Basler K Beta-catenin hits chromatin: regulation of Wnt target gene activation Nat. Rev. Mol. Cell Biol. 2009 10 276 286 10.1038/nrm2654 19305417 Mosimann, C., Hausmann, G. & Basler, K. Beta-catenin hits chromatin: regulation of Wnt target gene activation. Nat. Rev. Mol. Cell Biol. 10 19305417 10.1038/nrm2654 125. Nusse R Clevers H Wnt/β-catenin signaling, disease, and emerging therapeutic modalities Cell 2017 169 985 999 10.1016/j.cell.2017.05.016 28575679 Nusse, R. & Clevers, H. Wnt/β-catenin signaling, disease, and emerging therapeutic modalities. Cell 169 28575679 10.1016/j.cell.2017.05.016 126. Söderholm S Cantù C The WNT/β-catenin dependent transcription: a tissue-specific business WIREs Mech. Dis. 2021 13 e1511 10.1002/wsbm.1511 33085215 PMC9285942 Söderholm, S. & Cantù, C. The WNT/β-catenin dependent transcription: a tissue-specific business. WIREs Mech. Dis. 13 33085215 10.1002/wsbm.1511 PMC9285942 127. Lavery DL Martin J Turnbull YD Hoppler S Wnt6 signaling regulates heart muscle development during organogenesis Dev. Biol. 2008 323 177 188 10.1016/j.ydbio.2008.08.032 18804460 PMC2593796 Lavery, D. L., Martin, J., Turnbull, Y. D. & Hoppler, S. Wnt6 signaling regulates heart muscle development during organogenesis. Dev. Biol. 323 18804460 10.1016/j.ydbio.2008.08.032 PMC2593796 128. Afouda BA GATA transcription factors integrate Wnt signalling during heart development Development 2008 135 3185 3190 10.1242/dev.026443 18715946 Afouda, B. A. et al. GATA transcription factors integrate Wnt signalling during heart development. Development 135 18715946 10.1242/dev.026443 129. Lavery DL Davenport IR Turnbull YD Wheeler GN Hoppler S Wnt6 expression in epidermis and epithelial tissues during Xenopus organogenesis Dev. Dyn. 2008 237 768 779 10.1002/dvdy.21440 18224714 Lavery, D. L., Davenport, I. R., Turnbull, Y. D., Wheeler, G. N. & Hoppler, S. Wnt6 expression in epidermis and epithelial tissues during Xenopus organogenesis. Dev. Dyn. 237 18224714 10.1002/dvdy.21440 130. Moro E In vivo Wnt signaling tracing through a transgenic biosensor fish reveals novel activity domains Dev. Biol. 2012 366 327 340 10.1016/j.ydbio.2012.03.023 22546689 Moro, E. et al. In vivo Wnt signaling tracing through a transgenic biosensor fish reveals novel activity domains. Dev. Biol. 366 22546689 10.1016/j.ydbio.2012.03.023 131. Cantù C Mutations in Bcl9 and Pygo genes cause congenital heart defects by tissue-specific perturbation of Wnt/β-catenin signaling Genes Dev. 2018 32 1443 1458 10.1101/gad.315531.118 30366904 PMC6217730 Cantù, C. et al. Mutations in Bcl9 and Pygo genes cause congenital heart defects by tissue-specific perturbation of Wnt/β-catenin signaling. Genes Dev. 32 30366904 10.1101/gad.315531.118 PMC6217730 132. Schier AF Talbot WS Molecular genetics of axis formation in zebrafish Annu Rev. Genet. 2005 39 561 613 10.1146/annurev.genet.37.110801.143752 16285872 Schier, A. F. & Talbot, W. S. Molecular genetics of axis formation in zebrafish. Annu Rev. Genet. 39 16285872 10.1146/annurev.genet.37.110801.143752 133. Mongera A Michaut A Guillot C Xiong F Pourquié O Mechanics of Anteroposterior Axis Formation in Vertebrates Annu Rev. Cell Dev. Biol. 2019 35 annurev-cellbio-100818 annurev-cellbio-125436 10.1146/annurev-cellbio-100818-125436 PMC7394480 31412208 Mongera, A., Michaut, A., Guillot, C., Xiong, F. & Pourquié, O. Mechanics of Anteroposterior Axis Formation in Vertebrates. Annu Rev. Cell Dev. Biol. 35 10.1146/annurev-cellbio-100818-125436 PMC7394480 31412208 134. Huelsken J Requirement for β-catenin in anterior-posterior axis formation in mice J. Cell Biol. 2000 148 567 578 10.1083/jcb.148.3.567 10662781 PMC2174807 Huelsken, J. et al. Requirement for β-catenin in anterior-posterior axis formation in mice. J. Cell Biol. 148 10662781 10.1083/jcb.148.3.567 PMC2174807 135. Larabell CA Establishment of the dorso-ventral axis in Xenopus embryos is presaged by early asymmetries in beta-catenin that are modulated by the Wnt signaling pathway J. Cell Biol. 1997 136 1123 1136 10.1083/jcb.136.5.1123 9060476 PMC2132470 Larabell, C. A. et al. Establishment of the dorso-ventral axis in Xenopus embryos is presaged by early asymmetries in beta-catenin that are modulated by the Wnt signaling pathway. J. Cell Biol. 136 9060476 10.1083/jcb.136.5.1123 PMC2132470 136. Chen B Small molecule–mediated disruption of Wnt-dependent signaling in tissue regeneration and cancer Nat. Chem. Biol. 2009 5 100 107 10.1038/nchembio.137 19125156 PMC2628455 Chen, B. et al. Small molecule–mediated disruption of Wnt-dependent signaling in tissue regeneration and cancer. Nat. Chem. Biol. 5 19125156 10.1038/nchembio.137 PMC2628455 137. Ostap EM 2,3-Butanedione monoxime (BDM) as a myosin inhibitor J. Muscle Res.Cell Motil. 2002 23 305 308 10.1023/A:1022047102064 12630704 Ostap, E. M. 2,3-Butanedione monoxime (BDM) as a myosin inhibitor. J. Muscle Res.Cell Motil. 23 12630704 10.1023/a:1022047102064 138. Burkhard SB Bakkers J Spatially resolved RNA-sequencing of the embryonic heart identifies a role for Wnt/β-catenin signaling in autonomic control of heart rate Elife 2018 7 e31515 10.7554/eLife.31515 29400650 PMC5815850 Burkhard, S. B. & Bakkers, J. Spatially resolved RNA-sequencing of the embryonic heart identifies a role for Wnt/β-catenin signaling in autonomic control of heart rate. Elife 7 29400650 10.7554/eLife.31515 PMC5815850 139. Bakkers J Verhoeven MC Abdelilah-Seyfried S Shaping the zebrafish heart: from left-right axis specification to epithelial tissue morphogenesis Dev. Biol. 2009 330 213 220 10.1016/j.ydbio.2009.04.011 19371733 Bakkers, J., Verhoeven, M. C. & Abdelilah-Seyfried, S. Shaping the zebrafish heart: from left-right axis specification to epithelial tissue morphogenesis. Dev. Biol. 330 19371733 10.1016/j.ydbio.2009.04.011 140. Stainier DY Mutations affecting the formation and function of the cardiovascular system in the zebrafish embryo Development 1996 123 285 292 10.1242/dev.123.1.285 9007248 Stainier, D. Y. et al. Mutations affecting the formation and function of the cardiovascular system in the zebrafish embryo. Development 123 9007248 10.1242/dev.123.1.285 141. Jeffrey DA Serum circulating proteins from pediatric patients with dilated cardiomyopathy cause pathologic remodeling and cardiomyocyte stiffness JCI Insight 2021 6 e148637 10.1172/jci.insight.148637 34383712 PMC8525651 Jeffrey, D. A. et al. Serum circulating proteins from pediatric patients with dilated cardiomyopathy cause pathologic remodeling and cardiomyocyte stiffness. JCI Insight 6 34383712 10.1172/jci.insight.148637 PMC8525651 142. Lipshultz SE Cardiomyopathy in children: classification and diagnosis: a scientific statement from the American Heart Association Circulation 2019 140 E9 E68 10.1161/CIR.0000000000000682 31132865 Lipshultz, S. E. et al. Cardiomyopathy in children: classification and diagnosis: a scientific statement from the American Heart Association. Circulation 140 31132865 10.1161/CIR.0000000000000682 143. Venugopalan P Agarwal AK Plasma catecholamine levels parallel severity of heart failure and have prognostic value in children with dilated cardiomyopathy Eur. J. Heart Fail. 2003 5 655 658 10.1016/S1388-9842(03)00109-0 14607205 Venugopalan, P. & Agarwal, A. K. Plasma catecholamine levels parallel severity of heart failure and have prognostic value in children with dilated cardiomyopathy. Eur. J. Heart Fail. 5 14607205 10.1016/s1388-9842(03)00109-0 144. McDole K In toto imaging and reconstruction of post-implantation mouse development at the single-cell level Cell 2018 175 859 876.e33 10.1016/j.cell.2018.09.031 30318151 McDole, K. et al. In toto imaging and reconstruction of post-implantation mouse development at the single-cell level. Cell 175 30318151 10.1016/j.cell.2018.09.031 145. Laura VG Incorporation of the first and second heart fields and prospective fate of the straight heart tube via in vivo labeling of chicken embryos PLoS ONE 2020 15 e0234069 10.1371/journal.pone.0234069 32649674 PMC7351196 Laura, V. G. et al. Incorporation of the first and second heart fields and prospective fate of the straight heart tube via in vivo labeling of chicken embryos. PLoS ONE 15 32649674 10.1371/journal.pone.0234069 PMC7351196 146. Kidokoro H Yonei-Tamura S Tamura K Schoenwolf GC Saijoh Y The heart tube forms and elongates through dynamic cell rearrangement coordinated with foregut extension Development 2018 145 dev152488 10.1242/dev.152488 29490984 PMC5963862 Kidokoro, H., Yonei-Tamura, S., Tamura, K., Schoenwolf, G. C. & Saijoh, Y. The heart tube forms and elongates through dynamic cell rearrangement coordinated with foregut extension. Development 145 29490984 10.1242/dev.152488 PMC5963862 147. Romer, A. S. The vertebrate as a dual animal — somatic and visceral. Evol. Biol 148. Lescroart F Clonal analysis reveals a common origin between nonsomite-derived neck muscles and heart myocardium Proc. Natl Acad. Sci. USA 2015 112 1446 1451 10.1073/pnas.1424538112 25605943 PMC4321263 Lescroart, F. et al. Clonal analysis reveals a common origin between nonsomite-derived neck muscles and heart myocardium. Proc. Natl Acad. Sci. USA 112 25605943 10.1073/pnas.1424538112 PMC4321263 149. Wang W A single-cell transcriptional roadmap for cardiopharyngeal fate diversification Nat. Cell Biol. 2019 21 674 686 10.1038/s41556-019-0336-z 31160712 PMC7491489 Wang, W. et al. A single-cell transcriptional roadmap for cardiopharyngeal fate diversification. Nat. Cell Biol. 21 31160712 10.1038/s41556-019-0336-z PMC7491489 150. Lescroart, F. et al. Clonal analysis reveals common lineage relationships between head muscles and second heart field derivatives in the mouse embryo. Development 137 10.1242/dev.050674 20823066 151. Ivanovitch K Ventricular, atrial, and outflow tract heart progenitors arise from spatially and molecularly distinct regions of the primitive streak PLoS Biol. 2021 19 e3001200 10.1371/journal.pbio.3001200 33999917 PMC8158918 Ivanovitch, K. et al. Ventricular, atrial, and outflow tract heart progenitors arise from spatially and molecularly distinct regions of the primitive streak. PLoS Biol. 19 33999917 10.1371/journal.pbio.3001200 PMC8158918 152. González-Rosa JM Peralta M Mercader N Pan-epicardial lineage tracing reveals that epicardium derived cells give rise to myofibroblasts and perivascular cells during zebrafish heart regeneration Dev. Biol. 2012 370 173 186 10.1016/j.ydbio.2012.07.007 22877945 González-Rosa, J. M., Peralta, M. & Mercader, N. Pan-epicardial lineage tracing reveals that epicardium derived cells give rise to myofibroblasts and perivascular cells during zebrafish heart regeneration. Dev. Biol. 370 22877945 10.1016/j.ydbio.2012.07.007 153. Chen Y-T Lineage tracing reveals distinctive fates for mesothelial cells and submesothelial fibroblasts during peritoneal injury J. Am. Soc. Nephrol. 2014 25 2847 2858 10.1681/ASN.2013101079 24854266 PMC4243351 Chen, Y.-T. et al. Lineage tracing reveals distinctive fates for mesothelial cells and submesothelial fibroblasts during peritoneal injury. J. Am. Soc. Nephrol. 25 24854266 10.1681/ASN.2013101079 PMC4243351 154. Francou A De Bono C Kelly RG Epithelial tension in the second heart field promotes mouse heart tube elongation Nat. Commun. 2017 8 14770 10.1038/ncomms14770 28357999 PMC5379109 Francou, A., De Bono, C. & Kelly, R. G. Epithelial tension in the second heart field promotes mouse heart tube elongation. Nat. Commun. 8 28357999 10.1038/ncomms14770 PMC5379109 155. Arriagada, C., Lin, E., Schonning, M. & Astrof, S. Mesodermal fibronectin controls cell shape, polarity, and mechanotransduction in the second heart field during cardiac outflow tract development. Developmental Cell 60 10.1016/j.devcel.2024.09.017 PMC11706711 39413783 156. Männer J The development of pericardial villi in the chick embryo Anat. Embryol. 1992 186 379 385 10.1007/BF00185988 1416087 Männer, J. The development of pericardial villi in the chick embryo. Anat. Embryol. 186 10.1007/BF00185988 1416087 157. Peralta M Heartbeat-driven pericardiac fluid forces contribute to epicardium morphogenesis Curr. Biol. 2013 23 1726 1735 10.1016/j.cub.2013.07.005 23954432 Peralta, M. et al. Heartbeat-driven pericardiac fluid forces contribute to epicardium morphogenesis. Curr. Biol. 23 23954432 10.1016/j.cub.2013.07.005 158. Weinberger, M., Simões, F. C., Patient, R., Sauka-Spengler, T. & Riley, P. R. Functional hterogeneity within the developing zebrafish epicardium. Dev. Cell 52 10.1016/j.devcel.2020.01.023 PMC7063573 32084358 159. Karki S Wilms’ tumor 1 (Wt1) regulates pleural mesothelial cell plasticity and transition into myofibroblasts in idiopathic pulmonary fibrosis FASEB J. 2014 28 1122 1131 10.1096/fj.13-236828 24265486 PMC3929684 Karki, S. et al. Wilms’ tumor 1 (Wt1) regulates pleural mesothelial cell plasticity and transition into myofibroblasts in idiopathic pulmonary fibrosis. FASEB J. 28 24265486 10.1096/fj.13-236828 PMC3929684 160. Mutsaers SE Mesothelial cells in tissue repair and fibrosis Front. Pharm. 2015 6 113 10.3389/fphar.2015.00113 PMC4460327 26106328 Mutsaers, S. E. et al. Mesothelial cells in tissue repair and fibrosis. Front. Pharm. 6 10.3389/fphar.2015.00113 PMC4460327 26106328 161. Boezio, G. L. M. et al. The developing epicardium regulates cardiac chamber morphogenesis by promoting cardiomyocyte growth. Dis. Model Mech. 10.1242/dmm.049571 PMC9612869 36172839 162. Mickoleit M High-resolution reconstruction of the beating zebrafish heart Nat. Methods 2014 11 919 922 10.1038/nmeth.3037 25042787 Mickoleit, M. et al. High-resolution reconstruction of the beating zebrafish heart. Nat. Methods 11 25042787 10.1038/nmeth.3037 163. Scherz PJ Huisken J Sahai-Hernandez P Stainier DYR High-speed imaging of developing heart valves reveals interplay of morphogenesis and function Development 2008 135 1179 1187 10.1242/dev.010694 18272595 Scherz, P. J., Huisken, J., Sahai-Hernandez, P. & Stainier, D. Y. R. High-speed imaging of developing heart valves reveals interplay of morphogenesis and function. Development 135 18272595 10.1242/dev.010694 164. The Tabula Muris Consortium. Single-cell transcriptomics of 20 mouse organs creates a Tabula Muris. Nature 562 10.1038/s41586-018-0590-4 PMC6642641 30283141 165. Consortium, T. S. et al. The Tabula Sapiens: a multiple-organ, single-cell transcriptomic atlas of humans. Science 376 10.1126/science.abl4896 PMC9812260 35549404 166. Nakamura Y de Paiva Alves E Veenstra GJC Hoppler S Tissue- and stage-specific Wnt target gene expression is controlled subsequent to β-catenin recruitment to cis-regulatory modules Development 2016 143 1914 1925 27068107 10.1242/dev.131664 PMC4920159 Nakamura, Y., de Paiva Alves, E., Veenstra, G. J. C. & Hoppler, S. Tissue- and stage-specific Wnt target gene expression is controlled subsequent to β-catenin recruitment to cis-regulatory modules. Development 143 27068107 10.1242/dev.131664 PMC4920159 167. Valenta T Wnt ligands secreted by subepithelial mesenchymal cells are essential for the survival of intestinal sem cells and gut homeostasis Cell Rep. 2016 15 911 918 10.1016/j.celrep.2016.03.088 27117411 Valenta, T. et al. Wnt ligands secreted by subepithelial mesenchymal cells are essential for the survival of intestinal sem cells and gut homeostasis. Cell Rep. 15 27117411 10.1016/j.celrep.2016.03.088 168. Rousset R Naked cuticle targets dishevelled to antagonize Wnt signal transduction Genes Dev. 2001 15 658 671 10.1101/gad.869201 11274052 PMC312650 Rousset, R. et al. Naked cuticle targets dishevelled to antagonize Wnt signal transduction. Genes Dev. 15 11274052 10.1101/gad.869201 PMC312650 169. Li, Y. et al. Sfrp5 coordinates foregut specification and morphogenesis by antagonizing both canonical and noncanonical Wnt11 signaling. Genes Dev. 10.1101/gad.1687308 PMC2577796 18981481 170. Nathan E Tzahor E sFRPs: a declaration of (Wnt) independence Nat. Cell Biol. 2009 11 13 13 10.1038/ncb0109-13 19122594 Nathan, E. & Tzahor, E. sFRPs: a declaration of (Wnt) independence. Nat. Cell Biol. 11 19122594 10.1038/ncb0109-13 171. David R MesP1 drives vertebrate cardiovascular differentiation through Dkk-1-mediated blockade of Wnt-signalling Nat. Cell Biol. 2008 10 338 345 10.1038/ncb1696 18297060 David, R. et al. MesP1 drives vertebrate cardiovascular differentiation through Dkk-1-mediated blockade of Wnt-signalling. Nat. Cell Biol. 10 18297060 10.1038/ncb1696 172. Niida A DKK1, a negative regulator of Wnt signaling, is a target of the β-catenin/TCF pathway Oncogene 2004 23 8520 8526 10.1038/sj.onc.1207892 15378020 Niida, A. et al. DKK1, a negative regulator of Wnt signaling, is a target of the β-catenin/TCF pathway. Oncogene 23 15378020 10.1038/sj.onc.1207892 173. Guan H Secreted frizzled related proteins in cardiovascular and metabolic diseases Front. Endocrinol. 2021 12 712217 10.3389/fendo.2021.712217 PMC8417734 34489867 Guan, H. et al. Secreted frizzled related proteins in cardiovascular and metabolic diseases. Front. Endocrinol. 12 10.3389/fendo.2021.712217 PMC8417734 34489867 174. Nakamura K Secreted frizzled-related protein 5 diminishes cardiac inflammation and protects the heart from ischemia/reperfusion injury J. Biol. Chem. 2016 291 2566 2575 10.1074/jbc.M115.693937 26631720 PMC4742726 Nakamura, K. et al. Secreted frizzled-related protein 5 diminishes cardiac inflammation and protects the heart from ischemia/reperfusion injury. J. Biol. Chem. 291 26631720 10.1074/jbc.M115.693937 PMC4742726 175. Wu Y Multiple roles of sFRP2 in cardiac development and cardiovascular disease Int. J. Biol. Sci. 2020 16 730 738 10.7150/ijbs.40923 32071544 PMC7019133 Wu, Y. et al. Multiple roles of sFRP2 in cardiac development and cardiovascular disease. Int. J. Biol. Sci. 16 32071544 10.7150/ijbs.40923 PMC7019133 176. Sklepkiewicz P Loss of secreted frizzled-related protein-1 leads to deterioration of cardiac function in mice and plays a role in human cardiomyopathy Circ. Heart Fail. 2015 8 362 372 10.1161/CIRCHEARTFAILURE.114.001274 25669938 PMC4405910 Sklepkiewicz, P. et al. Loss of secreted frizzled-related protein-1 leads to deterioration of cardiac function in mice and plays a role in human cardiomyopathy. Circ. Heart Fail. 8 25669938 10.1161/CIRCHEARTFAILURE.114.001274 PMC4405910 177. Lin H sFRP2 activates Wnt/β-catenin signaling in cardiac fibroblasts: differential roles in cell growth, energy metabolism, and extracellular matrix remodeling Am. J. Physiol. Cell Physiol. 2016 311 C710 C719 10.1152/ajpcell.00137.2016 27605451 PMC5130588 Lin, H. et al. sFRP2 activates Wnt/β-catenin signaling in cardiac fibroblasts: differential roles in cell growth, energy metabolism, and extracellular matrix remodeling. Am. J. Physiol. Cell Physiol. 311 27605451 10.1152/ajpcell.00137.2016 PMC5130588 178. Arola A Epidemiology of idiopathic cardiomyopathies in children and adolescents: a nationwide study in Finland Am. J. Epidemiol. 1997 146 385 393 10.1093/oxfordjournals.aje.a009291 9290498 Arola, A. et al. Epidemiology of idiopathic cardiomyopathies in children and adolescents: a nationwide study in Finland. Am. J. Epidemiol. 146 9290498 10.1093/oxfordjournals.aje.a009291 179. Lipshultz SE The incidence of pediatric cardiomyopathy in two regions of the United States N. Engl. J. Med. 2003 348 1647 1655 10.1056/NEJMoa021715 12711739 Lipshultz, S. E. et al. The incidence of pediatric cardiomyopathy in two regions of the United States. N. Engl. J. Med. 348 12711739 10.1056/NEJMoa021715 180. Nugent AW The epidemiology of childhood cardiomyopathy in Australia N. Engl. J. Med. 2003 348 1639 1646 10.1056/NEJMoa021737 12711738 Nugent, A. W. et al. The epidemiology of childhood cardiomyopathy in Australia. N. Engl. J. Med. 348 12711738 10.1056/NEJMoa021737 181. Towbin JA Incidence, causes, and outcomes of dilated cardiomyopathy in children J. Am. Med. Assoc. 2006 296 1867 1876 10.1001/jama.296.15.1867 17047217 Towbin, J. A. et al. Incidence, causes, and outcomes of dilated cardiomyopathy in children. J. Am. Med. Assoc. 296 10.1001/jama.296.15.1867 17047217 182. Canter CE Indications for heart transplantation in pediatric heart disease: a scientific statement from the American Heart Association Council on Cardiovascular Disease in the Young; the Councils on Clinical Cardiology, Cardiovascular Nursing, and Cardiovascular Surgery and Anesthesia; and the Quality of Care and Outcomes Research Interdisciplinary Working Group Circulation 2007 115 658 676 10.1161/CIRCULATIONAHA.106.180449 17261651 Canter, C. E. et al. Indications for heart transplantation in pediatric heart disease: a scientific statement from the American Heart Association Council on Cardiovascular Disease in the Young; the Councils on Clinical Cardiology, Cardiovascular Nursing, and Cardiovascular Surgery and Anesthesia; and the Quality of Care and Outcomes Research Interdisciplinary Working Group. Circulation 115 17261651 10.1161/CIRCULATIONAHA.106.180449 183. Singh RK Survival without cardiac transplantation among children with dilated cardiomyopathy J. Am. Coll. Cardiol. 2017 70 2663 2673 10.1016/j.jacc.2017.09.1089 29169474 PMC5726578 Singh, R. K. et al. Survival without cardiac transplantation among children with dilated cardiomyopathy. J. Am. Coll. Cardiol. 70 29169474 10.1016/j.jacc.2017.09.1089 PMC5726578 184. Halliday BP Sex- and age-based differences in the natural history and outcome of dilated cardiomyopathy Eur. J. Heart Fail. 2018 20 1392 1400 10.1002/ejhf.1216 29862606 PMC6392171 Halliday, B. P. et al. Sex- and age-based differences in the natural history and outcome of dilated cardiomyopathy. Eur. J. Heart Fail. 20 29862606 10.1002/ejhf.1216 PMC6392171 185. Villalobos Lizardi JC A guide for assessment of myocardial stiffness in health and disease Nat. Cardiovasc. Res. 2022 1 8 22 10.1038/s44161-021-00007-3 39196108 Villalobos Lizardi, J. C. et al. A guide for assessment of myocardial stiffness in health and disease. Nat. Cardiovasc. Res. 1 39196108 10.1038/s44161-021-00007-3 186. Borlaug BA Reddy YNV The role of the pericardium in heart failure: implications for pathophysiology and treatment JACC Heart Fail. 2019 7 574 10.1016/j.jchf.2019.03.021 31248569 PMC6601642 Borlaug, B. A. & Reddy, Y. N. V. The role of the pericardium in heart failure: implications for pathophysiology and treatment. JACC Heart Fail. 7 31248569 10.1016/j.jchf.2019.03.021 PMC6601642 187. Kwan KM The Tol2kit: a multisite gateway-based construction Kit for Tol2 transposon transgenesis constructs Dev. Dyn. 2007 236 3088 3099 10.1002/dvdy.21343 17937395 Kwan, K. M. et al. The Tol2kit: a multisite gateway-based construction Kit for Tol2 transposon transgenesis constructs. Dev. Dyn. 236 17937395 10.1002/dvdy.21343 188. Kemmler CL Next-generation plasmids for transgenesis in zebrafish and beyond Development 2023 150 dev201531 10.1242/dev.201531 36975217 PMC10263156 Kemmler, C. L. et al. Next-generation plasmids for transgenesis in zebrafish and beyond. Development 150 36975217 10.1242/dev.201531 PMC10263156 189. Mosimann, C. Multisite gateway calculations: excel spreadsheet. protocols.io 190. Tatman PD Pediatric dilated cardiomyopathy hearts display a unique gene expression profile JCI Insight 2017 2 e94249 10.1172/jci.insight.94249 28724804 PMC5518568 Tatman, P. D. et al. Pediatric dilated cardiomyopathy hearts display a unique gene expression profile. JCI Insight 2 28724804 10.1172/jci.insight.94249 PMC5518568 191. Ibarra-García-Padilla R Howard AGA Singleton EW Uribe RA A protocol for whole-mount immuno-coupled hybridization chain reaction (WICHCR) in zebrafish embryos and larvae STAR Protoc. 2021 2 100709 10.1016/j.xpro.2021.100709 34401776 PMC8348268 Ibarra-García-Padilla, R., Howard, A. G. A., Singleton, E. W. & Uribe, R. A. A protocol for whole-mount immuno-coupled hybridization chain reaction (WICHCR) in zebrafish embryos and larvae. STAR Protoc. 2 34401776 10.1016/j.xpro.2021.100709 PMC8348268 192. Kuehn E Segment number threshold determines juvenile onset of germline cluster expansion in Platynereis dumerilii J. Exp. Zool. B Mol. Dev. Evol. 2022 338 225 240 10.1002/jez.b.23100 34793615 PMC9114164 Kuehn, E. et al. Segment number threshold determines juvenile onset of germline cluster expansion in Platynereis dumerilii. J. Exp. Zool. B Mol. Dev. Evol. 338 34793615 10.1002/jez.b.23100 PMC9114164 193. Schindelin J Fiji: an open-source platform for biological-image analysis Nat. Methods 2012 9 676 682 10.1038/nmeth.2019 22743772 PMC3855844 Schindelin, J. et al. Fiji: an open-source platform for biological-image analysis. Nat. Methods 9 22743772 10.1038/nmeth.2019 PMC3855844 194. Hörl D BigStitcher: reconstructing high-resolution image datasets of cleared and expanded samples Nat. Methods 2019 16 870 874 10.1038/s41592-019-0501-0 31384047 Hörl, D. et al. BigStitcher: reconstructing high-resolution image datasets of cleared and expanded samples. Nat. Methods 16 31384047 10.1038/s41592-019-0501-0 195. Preibisch S Efficient Bayesian-based multiview deconvolution Nat. Methods 2014 11 645 648 10.1038/nmeth.2929 24747812 PMC4153441 Preibisch, S. et al. Efficient Bayesian-based multiview deconvolution. Nat. Methods 11 24747812 10.1038/nmeth.2929 PMC4153441 196. Preibisch S Saalfeld S Schindelin J Tomancak P Software for bead-based registration of selective plane illumination microscopy data Nat. Methods 2010 7 418 419 10.1038/nmeth0610-418 20508634 Preibisch, S., Saalfeld, S., Schindelin, J. & Tomancak, P. Software for bead-based registration of selective plane illumination microscopy data. Nat. Methods 7 20508634 10.1038/nmeth0610-418 197. Peña B Adbel-Hafiz M Cavasin M Mestroni L Sbaizero O Atomic force microscopy (AFM) applications in arrhythmogenic cardiomyopathy Int. J. Mol. Sci. 2022 23 3700 10.3390/ijms23073700 35409059 PMC8998711 Peña, B., Adbel-Hafiz, M., Cavasin, M., Mestroni, L. & Sbaizero, O. Atomic force microscopy (AFM) applications in arrhythmogenic cardiomyopathy. Int. J. Mol. Sci. 23 35409059 10.3390/ijms23073700 PMC8998711 198. Mueller AC Induction of ADAM10 by radiation therapy drives fibrosis, resistance, and epithelial-to-mesenchyal transition in pancreatic cancer Cancer Res. 2021 81 3255 3269 10.1158/0008-5472.CAN-20-3892 33526513 PMC8260469 Mueller, A. C. et al. Induction of ADAM10 by radiation therapy drives fibrosis, resistance, and epithelial-to-mesenchyal transition in pancreatic cancer. Cancer Res. 81 33526513 10.1158/0008-5472.CAN-20-3892 PMC8260469 199. Travers JG HDAC inhibition reverses preexisting diastolic dysfunction and blocks covert extracellular matrix remodeling Circulation 2021 143 1874 1890 10.1161/CIRCULATIONAHA.120.046462 33682427 PMC8884170 Travers, J. G. et al. HDAC inhibition reverses preexisting diastolic dysfunction and blocks covert extracellular matrix remodeling. Circulation 143 33682427 10.1161/CIRCULATIONAHA.120.046462 PMC8884170 200. Kuwabara JT Regulation of extracellular matrix composition by fibroblasts during perinatal cardiac maturation J. Mol. Cell Cardiol. 2022 169 84 95 10.1016/j.yjmcc.2022.05.003 35569524 PMC10149041 Kuwabara, J. T. et al. Regulation of extracellular matrix composition by fibroblasts during perinatal cardiac maturation. J. Mol. Cell Cardiol. 169 35569524 10.1016/j.yjmcc.2022.05.003 PMC10149041 ",
  "metadata": {
    "Title of this paper": "Regulation of extracellular matrix composition by fibroblasts during perinatal cardiac maturation",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480573/"
  }
}