{
  "title": "Paper_775",
  "abstract": "Skin Appendage Disord Skin Appendage Disord 2974 sad SAD Skin Appendage Disorders 2296-9195 2296-9160 Karger Publishers PMC11460839 PMC11460839.1 11460839 11460839 39386302 10.1159/000538531 538531 1 Clinical Investigations – Research Article Foot, Toe, and Nail Changes: Are They Interdependent? Foot, Toe, and Nail Changes: Interrelated? 2736685 Haneke Eckart  a  b  c  d  e  a Bern Switzerland  b Freiburg Germany  c Matosinhos Portugal  d Zagreb Croatia  e Gent Belgium Correspondence to: Eckart Haneke, haneke@gmx.net This article is dedicated to Robert Baran, MD, who inspired the author over almost 50 years with his enthusiasm and his encyclopaedical knowledge of all aspects of the nails. 24 5 2024 10 2024 10 5 471887 402 414 19 2 2024 13 3 2024 2024 01 10 2025 01 10 2025 09 10 2024 01 10 2025 © 2024 S. Karger AG, Basel 2024 Copyright: All rights reserved. No part of this publication may be translated into other languages, reproduced or utilized in any form or by any means, electronic or mechanical, including photocopying, recording, microcopying, or by any information storage and retrieval system, without permission in writing from the publisher. Abstract Introduction The toes are the distal extension of the foot increasing its weight-bearing area and the security of the stance. The nails are the acral part of the toes and are so intimately linked with the distal interphalangeal joint, its ligaments, and tendons that they were also called musculoskeletal appendages. The big toe is of particular importance for gait and stance. Anatomic alterations of the foot and toe lead to pathological changes of the nails, both directly as well as indirectly. Methods The author evaluated the clinical photographs of 1,663 patients examined for toenail conditions. Results It was found that a normal straight axis of the first ray of metatarsal and phalanx bones occurred in less than 10% of the patients with hallux valgus and hallux valgus interphalangeus being extremely frequent. The commonest nail changes observed were compression nail ( n Conclusion Although a direct causal relationship is hard to prove it was realized that most of the nail changes were associated with foot and toe abnormalities. The study reveals that assessing toenail changes requires examination of the entire foot, best in relaxed, standing, and walking conditions. Plain Language Summary The foot of man is a strong organ consisting of 26 bones, 33 joints, of which 20 are actively movable, and more than 100 muscles, tendons and connective tissue bands keeping this complex body part together. The foot is usually divided into three parts, the hind, mid, and forefoot. The latter contains the toes as their most forward-pointing parts. They are covered by the nails, which are plates of hard horn substance. The toes increase the weight-bearing surface of the foot and are thus important for balance while standing and walking, for running and jumping. If the foot is not healthy this will seriously influence its function and also change the toenails. An examination of more than 1,600 persons’ toenail photographs was performed to find out, whether foot anomalies can be found in patients with toenail changes. This was in fact the case in a very high number of the patients. Keywords Toenails Toes Foot alterations Congenital malalignment Compression nail Retronychia Ingrown nail Nail tumors The author received no funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Foot, Toe, and Nail Changes: Are They Interdependent?",
    "Journal it was published in:": "Skin Appendage Disorders",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11460839/"
  }
}