{
  "title": "Paper_290",
  "abstract": "pmc Front Endocrinol (Lausanne) Front Endocrinol (Lausanne) 1753 frontendo Front. Endocrinol. Frontiers in Endocrinology 1664-2392 Frontiers Media SA PMC12488459 PMC12488459.1 12488459 12488459 10.3389/fendo.2025.1661037 1 Endocrinology Review Gut microbiota dysbiosis in diabetic nephropathy: mechanisms and therapeutic targeting via the gut-kidney axis Jiang Haiyan  1  2  † Wang Xiaoran  3  † Zhou Wei  3  † Huang Zhili  4  † Zhang Wen  1  2  *  1 The First Affiliated Hospital of Zhejiang Chinese Medical University (Zhejiang Provincial Hospital of Chinese Medicine) Hangzhou China  2 Zhejiang Key Laboratory of Research and Translation for Kidney Deficiency-Stasis-Turbidity Disease, Zhejiang-Macau International Joint Laboratory of Integrated Traditional Chinese and Western Medicine for Nephrology and Immunology Hangzhou China  3 Department of Nephrology, The First People’s Hospital of Hangzhou Lin’an District Hangzhou China  4 Department of Hematology and Rheumatology, Tianchang People’s Hospital Chuzhou, Anhui China Edited by: Åke Sjöholm, Gävle Hospital, Sweden Reviewed by: Laura Mitrea  Lin Chen  Dinakaran Vasudevan *Correspondence: Wen Zhang, 306762827@qq.com †These authors have contributed equally to this work and share first authorship 18 9 2025 2025 16 480647 1661037 07 7 2025 28 8 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Jiang, Wang, Zhou, Huang and Zhang. 2025 Jiang, Wang, Zhou, Huang and Zhang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Diabetic kidney disease (DKD) is the primary microvascular complication of diabetes and a leading cause of chronic kidney disease (CKD) and end-stage renal disease (ESRD) worldwide, with its prevalence on the rise. Recent evidence has highlighted the crucial involvement of gut microbiota (GM) dysbiosis in the pathogenesis and progression of DKD, mediated through the gut-kidney axis. At the core of this process is a dynamic network involving metabolic, immune, and barrier dysfunction. Renal impairment—such as that seen in uremia—disrupts gut microbial composition and metabolic function. In turn, dysbiosis compromises intestinal barrier integrity, resulting in increased exposure to endotoxins and a reduction in the production of beneficial metabolites, notably short-chain fatty acids (SCFAs). This triad manifests as: (1) impaired metabolism, marked by decreased SCFAs (e.g., acetate), which weaken anti-inflammatory and immunomodulatory effects, alongside an accumulation of uremic toxins like trimethylamine N-oxide (TMAO) that trigger inflammatory pathways and renal fibrosis; (2) immune dysregulation, where increased endotoxin translocation (e.g., lipopolysaccharide, LPS) provokes systemic inflammation, oxidative stress, and immune cell infiltration (such as macrophages), contributing to renal inflammatory and fibrotic responses; and (3) barrier dysfunction, in which compromised intestinal barrier accelerates the translocation of detrimental microbial components, perpetuating a vicious cycle that exacerbates glomerulosclerosis, tubular injury, and renal function decline.Collectively, metabolic, immune, and barrier alterations reinforce one another and drive DKD progression via gut-derived metabolites and immune activation. Targeted interventions aiming to modulate the GM—using probiotics, prebiotics, or synbiotics—show promise in improving metabolic profiles, restoring gut barrier function, and mitigating DKD phenotypes. This review systematically elucidates the metabolism–immunity–barrier mechanisms by which GM dysbiosis contributes to DKD and discusses the translational potential of microbiome-targeted therapies. Further studies are needed to validate these findings and assess their long-term clinical efficacy. diabetic kidney disease gut microbiota gut-kidney axis metabolism–immunity–barrier interaction microbiome-targeted therapy The author(s) declare financial support was received for the research and/or publication of this article. The authors declare that they received funding support for research, writing, and/or publication of this article. This work was sponsored by research grants from the Hangzhou Science and Technology Bureau (20241029Y164). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Diabetes: Molecular Mechanisms 1 Introduction DKD, a major microvascular complication of diabetes, remains the leading cause of ESRD globally ( 1 2 2 3 1.1 Metabolic dimension DKD is associated with a distinct gut microbial profile, notably a decreased abundance of butyrate-producing bacteria, which leads to reduced synthesis of beneficial SCFAs ( 4 6 2 7 8 2 7 9 1.2 Immune dimension SCFA deficiency impairs their anti-inflammatory effects and the inhibition of histone deacetylases (HDACs) ( 4 6 10 9 11 1.3 Barrier dimension Dysbiosis impairs the integrity of intestinal epithelial tight junctions—such as zonula occludens-1 (ZO-1)—facilitating translocation of endotoxins into the bloodstream ( 8 12 5 12 13 Compared with NDKD, the gut–kidney axis in DKD exhibits unique metabolic features: chronic hyperglycemia selectively suppresses butyrate metabolic pathways ( 6 14 2 7 2 Clinical evidence linking gm dysbiosis to diabetic nephropathy 2.1 Characteristics of GM in patients with DN 2.1.1 Alterations in microbial composition Marked reduction in beneficial bacteria: Patients with DN exhibit a distinct gut microbial profile characterized by a significant decrease in SCFA-producing genera, such as Akkermansia Roseburia Alistipes Akkermansia Alistipes 15 Enrichment of pathogenic bacteria: Conversely, the abundance of pathogenic bacteria, particularly Escherichia-Shigella 16 17 Several studies have demonstrated a robust association between changes in microbial composition and renal function parameters. For instance, reduced Roseburia 18 Dialister 18 19 2.1.2 Potential as biomarkers Characteristic microbial profiles hold significant promise for distinguishing DN from NDKD. For instance, reduced abundance of Verrucomicrobia in DN patients serves as a phylum-level discriminator ( 18 20 21 21 Additionally, Prevotella_9 demonstrates significant alterations in DKD. Metagenomic analyses reveal that Prevotella_9 species (e.g., Prevotella sp. MSX73) are enriched in DKD patients and contribute to a combinatorial biomarker model (AUC = 0.889) differentiating DN from T2DM without nephropathy 22. The decline in Prevotella-associated butyrate production further exacerbates renal dysfunction by impairing anti-inflammatory pathways ( 22 23 Comprehensive integration of microbial signatures (e.g., Prevotella copri, Prevotella_9, and g_Prevotella) with serum metabolites (e.g., imidazolepropionic acid) enhances early DN detection (AUC >0.94) ( 22 23 3 24 2.2 Unresolved causality: insights from MR studies MR has become a crucial approach for establishing causality in the relationship between GM and DN. While accumulating evidence from MR analyses suggests the existence of causal links at the genetic level, several key areas remain contentious, particularly concerning the directionality of effects and the clarification of underlying molecular mechanisms. 2.2.1 Evidence supporting a causal relationship Multiple two-sample MR studies have provided substantial evidence supporting a causal relationship between specific gut microbial taxa and the risk of DN. For instance, studies have identified potential causal links between certain gut microbial taxa and DN, which were confirmed through MR analysis ( 25 27 Catenibacterium 26 27 27 28 28 2.2.1.1 Controversy: the bidirectionality of causality Despite the above findings, one of the major points of contention is the potential bidirectional nature of the relationship between GM dysbiosis and DN. On the one hand, dysbiosis may be an initiating factor in DN: reduced production of SCFAs has been shown to promote renal inflammation and fibrosis, thereby accelerating DN progression ( 9 12 5 29 30 31 3 32 2.2.1.2 Controversy: unclear molecular mechanisms Another unresolved issue lies in the lack of detailed understanding of the molecular mechanisms underlying GM-host interactions in DN. Although numerous studies have postulated that GM-derived metabolites, such as SCFAs, may modulate host pathways—including the renin-angiotensin system (RAS)—direct experimental evidence remains limited. For example, Huang L speculated that SCFAs might influence DN progression via immunometabolic pathways, but this has yet to be verified. Similarly, while Das S investigated the protective effects of SCFAs in DN models, their mechanisms—such as possible regulation of the RAS—require further elucidation ( 5 12 27 2.3 Cross-disease comparison: microbial differences between DN and NDKD Comparative analysis between DN and NDKD reveals disease-specific patterns of GM dysbiosis, which are critical for understanding pathogenesis and guiding personalized treatment strategies. Current evidence indicates that DN and NDKD display distinct alterations in both metabolic and pathogenic microbial taxa, resulting in different responses to microbial interventions. 2.3.1 Disease-specific microbial features in DN 2.3.1.1 Metabolic dysfunction DN is characterized by a notably greater depletion of short-chain fatty acid (SCFA)-producing bacteria, such as butyrate-producing Firmicutes species, compared to NDKD. Experimental studies have shown that DN mouse models exhibit significantly lower fecal SCFA levels (especially acetic acid), which correlate positively with the severity of renal fibrosis ( 6 17 25 2.3.1.2 Differences in pathogenic bacteria The enrichment of pathogenic bacteria also differs between DN and NDKD. In NDKD, dysbiosis mainly affects immune-modulating bacteria; for instance, enrichment of Clostridium 1 Enterobacteriaceae 6 25 Clostridium Enterobacteriaceae 1 33 Therapeutic Implications: Microbiota-targeted interventions appear to be more effective in DN, underscoring the value of disease-specific strategies. For example, butyrate supplementation significantly alleviated renal fibrosis in DN models ( 6 34 17 31 2.4 Key controversies and knowledge gaps Despite significant advances in understanding the gut microbiota - diabetic nephropathy relationship, several critical controversies and knowledge gaps persist. First, while MR studies provide genetic evidence of causality, experimental validation using animal models remains essential. Integrated studies have demonstrated associations between clinical GM profiles and DN, yet in vivo 33 17 35 The translation of microbiota-targeted therapies to clinical practice faces significant challenges. Clinical trials of probiotics and prebiotics have yielded inconsistent results, likely reflecting inter-individual microbiota variability and disease heterogeneity. While short-chain fatty acid (SCFA) supplementation demonstrates benefits in DN animal models ( 34 35 35 36 Furthermore, emerging evidence suggests that DN and NDKD involve distinct dysbiosis-driven immunological mechanisms. DN-associated gut dysbiosis appears to influence host immunity through metabolic-immune crosstalk, whereas NDKD may be more directly linked to immune dysregulation, particularly Th17/Treg cell axis imbalances ( 1 3 Key Mechanisms by which GM dysbiosis drives the progression of DN 3.1 Disruption of the intestinal barrier and translocation of endotoxins 3.1.1 Gut microbiota dysbiosis and intestinal barrier impairment In the context of diabetes, GM dysbiosis is typified by a notable reduction in beneficial bacteria—particularly those producing SCFAs—accompanied by an overgrowth of Gram-negative pathogenic taxa ( 9 12 37 39 40 Akkermansia 23 41 42 3.3.2 Endotoxemia and activation of systemic inflammatory responses Intestinal barrier disruption allows bacterial endotoxins, particularly LPS, to enter the systemic circulation, leading to metabolic endotoxemia ( 40 43 25 44 45 25 46 3 3.3.3 Renal inflammation and fibrosis Systemic inflammatory cytokines, including TNF-α and IL-6, drive the infiltration of immune cells into renal tissue and activate local inflammatory pathways ( 17 1 18 47 48 48 49 36 50  Figure 1 Figure 1 Mechanism of gut microbiota dysbiosis-induced systemic inflammation and renal damage in diabetes. Left: Diabetic conditions drive gut microbiota dysbiosis, characterized by diminished beneficial bacteria (blue) and expansion of pathogenic bacteria (red). This imbalance disrupts intestinal tight junctions, permitting translocation of bacterial fragments (e.g., LPS) into systemic circulation. Center: Key molecular pathway: Circulating bacterial fragments activate the TLR4/MyD88/NF-kB signaling cascade (detailed in dashed- line inset), triggering release of pro- inflammatory cytokines (TNF-α, IL-6). Right: Systemic inflammation propagates renal injury, culminating in inflammatory tubulointerstitial fibrosis. TLR4, Toll-like receptor 4; MyD88, Myeloid differentiation primary response 88; NF-κB, Nuclear factor kappa-light- chain-enhancer of activated B cells; TNF-a, Tumor necrosis factor-alpha; IL-6, Interleukin-6; LPS, Lipopolysaccharide. Diagram illustrating the mechanism of intestinal flora imbalance in diabetes leading to systemic inflammation and kidney damage. It shows gut microbiota dysbiosis, loss of tight junction proteins, and intestinal barrier disruption. Bacterial fragments enter the bloodstream, activating TLR4/MyD88 and the NF-kB pathway. This results in systemic inflammation, indicated by increased TNF-alpha and IL-6, and leads to renal inflammatory tubulointerstitial fibrosis. 3.2 Nephrotoxic effects of microbial metabolites Gut-derived microbial metabolites, particularly the reduction of SCFAs and the accumulation of uremic toxins, play critical roles in the development and progression of DN. Their pathogenic mechanisms involve oxidative stress, inflammatory responses, and fibrosis, in part through modulation of key renal signaling pathways ( 44 51 3.2.1 Pathogenic mechanisms of reduced SCFAs A decrease in SCFAs, such as butyrate and propionate, exacerbates renal injury primarily by impairing renal antioxidant defense systems and disrupting immune homeostasis. SCFA deficiency attenuates the activation of major regulatory pathways, such as nuclear factor erythroid 2-related factor 2 (Nrf2), leading to the accumulation of reactive oxygen species (ROS) and enhancing oxidative stress within the renal microenvironment ( 52 6 44 53 51 54 3.2.2 Nephrotoxic mechanisms of uremic toxin accumulation Uremic toxins, such as indoxyl sulfate (IS) and p-cresyl sulfate (PCS), exhibit a strong inverse correlation with estimated glomerular filtration rate (eGFR) (total IS: r = -0.819; free PCS: r = -0.753) ( 55 53 54 56 54 57 58 59 51 57 In DKD, GM dysbiosis promotes uremic toxin production (e.g., IS/PCS) ( 60 61 62 60 63 64 62 3.2.3 Interventional strategies and therapeutic potential Targeted interventions aimed at restoring microbial metabolic balance have shown promising renoprotective effects, mainly through pharmacological, nutritional, and non-pharmacological approaches. 3.2.3.1 Pharmacological and nutritional modulation Traditional Chinese herbal formulations (e.g., Xiaoyu Xiezhuo decoction, XXD) have been reported to lower plasma IS and PCS levels while increasing colonic SCFA (such as butyrate) concentrations, consequently ameliorating tubular injury and suppressing pro-inflammatory cytokines such as IL-17 and TNF-α ( 65 66 47 6 3.2.3.2 Non-pharmacological toxin removal Use of intestinal adsorbents such as AST-120 effectively reduces circulating IS by binding its precursors in the gut, while extracorporeal techniques including hemodialysis and hemofiltration directly eliminate accumulated IS and PCS from the bloodstream ( 54 44 57 3.3 Activation of immune-inflammatory pathways GM dysbiosis triggers a cascade of immune-inflammatory responses through both innate and adaptive mechanisms, with the NLRP3–IL-1β axis serving as a central regulatory hub. Dysbiosis increases host exposure to endotoxins such as LPS and uremic toxins, which enter systemic circulation and function as pathogen-associated or damage-associated molecular patterns ( 42 67 69 69 71 This activation specifically promotes assembly of the NLRP3–ASC–pro-caspase-1 complex via the P2X7 receptor, leading to caspase-1-dependent maturation of IL-1β and IL-18 ( 68 69 42 72 73 42 67 74 Concurrently, altered GM disrupts adaptive immune homeostasis. Reduced beneficial metabolites, particularly SCFAs, skews T cell differentiation toward excessive Th17 activation while impairing regulatory T cell (Treg) function ( 74 75 73 74 73 74 73 75 The NLRP3–IL-1β axis thus bridges innate and adaptive immunity in DN pathogenesis. Therapeutically, targeting the NLRP3/caspase-1 pathway significantly reduces cytokine release and ameliorates glomerulosclerosis and proteinuria, emerging as a core target for mitigating GM-driven inflammation in DN ( 67 76  Figure 2 Figure 2 Downstream pathological effects, encompassing both renal injury and systemic consequences, involve several key processes. First, an amplification of inflammation occurs as microbial metabolites, such as lipopolysaccharide (LPS) and trimethylamine N-oxide (TMAO), activate renal-resident immune cells like macrophages. This activation triggers the release of pro-inflammatory cytokines, including TNF-α and IL-1β. Concurrently, the NLRP3 inflammasome is activated, promoting renal cell apoptosis and fibrosis. Metabolic imbalances also induce oxidative stress through the accumulation of reactive oxygen species (ROS), which damages the glomerular filtration barrier and leads to tubular epithelial cell injury and proteinuria under chronic conditions. These effects create a systemic feedback loop; for instance, a decline in the glomerular filtration rate (GFR) exacerbates toxin accumulation, which in turn worsens gut dysbiosis. This highlights complex inter- organ crosstalk, such as the kidney-brain axis, driving disease progression. Diagram illustrating the dysbiosis-driven gut-kidney axis in metabolic diseases. It shows bacterial translocation and dysbiosis leading to microbial composition changes. Bacteroidetes decrease, while Verrucomicrobia, Akkermansia, Dialister, and Catenibacterium increase. Metabolite modulation involves decreased short-chain fatty acids and increased trimethylamine N-oxide (TMAO), hypoxanthine, and endotoxin. Pathological effects include inflammation and oxidative stress, influencing receptors like TLRs and NLRP3 and resulting in systemic effects on the kidney. 3.4 Role of metabolic dysregulation as a mediator GM dysbiosis drives DN progression through interconnected metabolic pathways involving insulin resistance and lipid dysregulation. The disruption of gut microbiota significantly reduces SCFA synthesis, particularly acetate and butyrate ( 35 51 34 34 77 34 Concurrently, gut dysbiosis facilitates LPS translocation into systemic circulation, activating TLR4 signaling pathways ( 78 7 44 78 11 Parallel to glucose metabolism disruption, gut dysbiosis profoundly alters lipid homeostasis through impaired bile acid metabolism. The reduced formation of secondary bile acids, particularly deoxycholic acid, impairs farnesoid X receptor (FXR) activation in the intestine ( 77 79 80 77 79 81 35 77 77 79 81 19 81 11 19 78 4 Strategies targeting the GM in the management of DN 4.1 Probiotics, prebiotics, and synbiotics and postbiotics Probiotics, prebiotics, and synbiotics have gained increasing attention as microbiota-targeted interventions for the management of DN. An accumulating body of clinical evidence suggests that these approaches, through modulation of the gut–kidney axis, can reshape intestinal microbial composition, reduce oxidative stress, and ultimately improve renal function parameters such as serum creatinine and blood urea nitrogen ( 47 82 35 83 84 Several randomized controlled trials have demonstrated that these interventions may also promote glycemic control (evidenced by reduced HbA1c levels) and improve lipid metabolism (e.g., lowering low-density lipoprotein cholesterol), underscoring the close interplay between the GM and host metabolic pathways ( 84 85 47 82 Given these challenges, future research should prioritize large-scale, multicenter randomized controlled trials to comprehensively assess the impact of targeted microbiome interventions on hard endpoints in DN and to facilitate the development of next-generation precision microbiome therapeutics ( 86 4.2 Mechanistic insights into the role of high-fiber diets in DN Emerging evidence highlights the therapeutic role of high-fiber diets in delaying the progression of DN, primarily through modulation of GM-derived metabolites such as SCFAs and restoration of intestinal barrier integrity. The underlying mechanisms are summarized as follows: 4.2.1 Enhancement of SCFA production High-fiber diets, particularly those rich in fermentable fibers like pectin and inulin, are metabolized by colonic microbiota, leading to increased production of SCFAs such as acetate, propionate, and butyrate ( 53 87 88 Akkermansia muciniphila Bacteroides 89 90 14 34 4.2.2 Restoration of intestinal barrier function SCFAs are crucial for intestinal barrier integrity by enhancing tight junction protein expression, which decreases endotoxin translocation, such as LPS, into systemic circulation ( 10 34 91 92 94 14 34 95 4.2.3 Modulation of the gut–kidney axis High-fiber dietary interventions have been shown to rebalance GM composition, characterized by a reduction in pathogenic bacteria such as Enterobacter Bacteroidetes 1 3 5 14 96 97 98 In summary, high-fiber diets exert multifaceted renoprotective effects in DN via the microbiota–SCFA–intestinal barrier axis, ultimately ameliorating pathological progression. Future directions should focus on the development of individualized fiber-based dietary strategies and targeted SCFA delivery approaches to maximize therapeutic benefit. 4.3 Regulatory effects of microbiota-derived metabolites: the renoprotective role of butyrate Butyrate, a key short-chain fatty acid derived from gut microbial fermentation, has shown notable renoprotective effects in multiple animal models of DKD and related renal injuries ( 34 99 100 101 Mechanistic investigations indicate that butyrate exerts its renoprotective roles via several pathways. It effectively suppresses renal inflammation and oxidative stress by downregulating pro-inflammatory mediators, such as TNF-α, and inhibits fibrosis by modulating TGF-β signaling in renal tubular cells and podocytes through GPR43 and GPR109A receptors ( 34 102 100 103 80 104 Furthermore, butyrate reinforces the gut–kidney axis by enhancing intestinal barrier integrity and attenuating systemic inflammation, with evidence pointing to a receptor-dependent mechanism and the need for sustained supplementation to maintain its benefits ( 105 106 107 108 4.4 Exploration of novel targeted therapies In recent years, increasing attention has been paid to the interaction between DKD and the GM, leading to the exploration of novel targeted therapeutic strategies. These strategies, primarily based on natural compounds and traditional Chinese medicine interventions, aim to regulate gut microbial homeostasis through multi-target mechanisms. Such interventions not only help restore microbial balance but also alleviate systemic inflammation and metabolic disturbances, ultimately contributing to the delay of DKD progression ( 109 110 4.4.1 Intervention with natural compounds 4.4.1.1 Intervention with natural compounds Natural compounds demonstrate significant potential in modulating the gut microbiome and ameliorating DKD progression, primarily by regulating microbial-derived metabolites. Clinical and preclinical studies consistently report decreased abundance of probiotic genera Bifidobacterium and Lactobacillus (e.g., L. johnsonii, L. reuteri, B. animalis) in patients with CKD including DKD, which correlates with impaired renal function and increased uremic toxins ( 111 112 35 113 114 115 116 Phenylacetylglutamine (PAGln): Derived from phenylalanine metabolism by gut microbes (e.g., Clostridium spp.), PAGln promotes cardiovascular complications and renal fibrosis via activation of G-protein-coupled receptors, exacerbating DKD progression ( 117 p-Cresyl glucuronide and PCS: Protein-bound toxins produced from tyrosine metabolism by Bacteroides and Clostridium. They induce oxidative stress, endothelial dysfunction, and insulin resistance, accelerating renal injury ( 118 119 Hippuric acid: Generated from polyphenol metabolism (e.g., quercetin, chlorogenic acid), it contributes to tubular damage and inflammation in diabetic kidneys ( 119 These interventions further suppress proteobacteria (e.g., Escherichia-Shigella) and reduce LPS release, thereby mitigating systemic inflammation via NLRP3/ASC/Caspase-1 pathway inhibition ( 116 117 119 17 114 Collectively, TCM-based modulation of the gut-kidney axis operates through a “microbiota-metabolite-inflammation” cascade (1): Correction of dysbiosis enriches beneficial taxa (2); Restoration of gut barrier reduces toxin translocation (3); Downregulation of inflammatory pathways (e.g., NLRP3, AhR) alleviates renal fibrosis ( 120 121 3 114 118 4.4.2 Potential of traditional Chinese medicine interventions TCM has demonstrated distinct advantages in the regulation of GM for the management of DN. Mounting evidence highlights that TCM interventions target intestinal-derived metabolites (e.g., SCFAs, tryptophan derivatives, and LPS) through microbiota remodeling, thereby ameliorating gut-kidney axis dysregulation ( 116 122 Recent studies elucidate that TCM formulas significantly modulate tryptophan metabolism pathways. For instance, Tang Shen Formula Lactobacillus Bifidobacterium 1 3 Shenyan Kangfu Tablet 55 Roseburia 123 124 Thonningianin A Penthorum chinense 125 110 126 Yi-Shen-Hua-Shi Granule 116 123 126 The holistic approach of TCM thus addresses the multifaceted pathophysiology of DN through coordinated regulation of gut microecology, microbial metabolite profiles (SCFAs, tryptophan derivatives, LPS), and immune homeostasis ( 123 124 126 55 116 122 125  Table 1 Table 1 Summary of literature on the modulation of gut microbiota by natural compounds and Traditional Chinese Medicine (TCM). Corresponding author Year Study type Sample size Intervention type Core mechanism Key evidence source Pan LM 2024 Review Not Stated Traditional Chinese Medicine (TCM) Modulation of gut microbiota Literature review and summary Wang Y 2024 Review Not Stated No intervention Gut microbiota dysbiosis, altered metabolites, immune-inflammation Literature review and mechanistic discussion Li X 2024 Review Not Stated TCM Modulation of gut microbiota, metabolites, and related signaling pathways Literature review and summary Tian Z 2023 Bibliometric Analysis 1009 publications No intervention No intervention VOSviewer analysis of literature data Dong Y 2025 Bibliometric Analysis 1289 publications No intervention No intervention CiteSpace & VOSviewer analysis of literature data Zhang G 2024 Review with Evidence Mapping 139 studies TCM No intervention Summary and analysis of clinical evidence Gong YX 2025 Review Not Stated Active components of TCM Inhibition of renal tubular epithelial cell apoptosis Literature review and summary Feng Z 2025 Bibliometric Analysis 1585 publications TCM-mediated gut microbiota regulation No intervention CiteSpace & VOSviewer analysis of literature data Du J 2024 Bibliometric Analysis 711 publications TCM No intervention VOSviewer & CiteSpace analysis of literature data Wang Y 2024 Review Not Stated TCM, Gut microbiota Gut-lung axis regulation Literature review and mechanistic discussion Wu J 2023 Preclinical Study Non-obese diabetic (NOD) mice  Abelmoschus manihot Modulation of gut microbiota and circulating metabolites 16S rRNA sequencing, metabolomics Chang H 2024 Review Not Stated Chinese herbal medicine No intervention Review of clinical evidence and potential mechanisms Xue M 2025 Preclinical Study db/db mice Danggui Buxue decoction Regulation of autophagy via the miR-27a/PI3K/AKT pathway Animal model experiments Liu Y 2022 Network Pharmacology N/A Yishen capsules Multi-target, multi-pathway regulation Analysis of network pharmacology databases and software Xu J 2024 Review Not Stated Edible TCM Modulation of gut microbiota metabolites Literature review and summary Xu D 2024 Review Not Stated TCM Modulation of gut microbiota and the microbiota-gut-x axis Literature review and summary Han J 2022 Review Not Stated Herbal medicine Modulation of gut microbiota Literature review and summary Qin Y 2024 Systematic Review & Meta-analysis 30 RCTs (2306 patients) TCM decoction No intervention Meta-analysis of randomized controlled trials (RCTs) Gao S 2024 Preclinical Study db/db mice Jiang Tang San Hao Formula Affecting the gut-microbiota-brain axis 16S rRNA sequencing, metabolomics, behavioral tests Zhang L 2024 Review Not Stated TCM Adjusting gut microbiota to improve immune imbalance Literature review and summary Chen Y 2023 Review Not Stated TCM Gut microbiota-based therapy against bacteria Literature review and summary Tao P 2025 Network Pharmacology N/A Gut microbiota metabolites Synergistic effects of multi-component, multi-target interactions Analysis of databases such as TCMSP and DrugBank Yang J 2023 Review Not Stated Gut microbiota metabolites No intervention Literature review and mechanistic discussion Hui S 2024 Preclinical Study db/db mice Resveratrol Modulation of the gut microbiota-short-chain fatty acids (SCFAs) axis 16S rRNA sequencing, targeted metabolomics 4.5 Potential value of FMT in DN FMT has demonstrated significant therapeutic potential in the management of DN by facilitating the reconstruction of a healthy gut microbial ecosystem and modulating relevant metabolic and immune pathways ( 36 127 4.5.1 Efficacy in animal models Experimental studies have provided robust evidence that FMT can improve renal outcomes and restore intestinal microbial homeostasis in DN models. For instance, in DN animal models such as 5/6 nephrectomized rats, FMT intervention has been shown to remodel gut microbial composition, ameliorate dysbiosis, and attenuate glomerulosclerosis and interstitial fibrosis by regulating metabolic pathways such as serum amino acid metabolism ( 128 129 130 131 17 129 4.5.2 Clinical translation: advances and challenges Preliminary clinical data suggest that FMT may delay the progression of CKD, including diabetes-related CKD, highlighting its potential as an alternative approach to restore GM balance ( 132 133 (1) Safety concerns: The risk of infection associated with FMT procedures and uncertainty regarding long-term safety profiles represent major challenges that require careful evaluation and ongoing surveillance ( 128 134 135 136 18 In summary, while FMT holds considerable promise for the treatment of DN—as substantiated by preclinical evidence—its broader application requires further optimization of safety, standardization of protocols, and mechanistic clarification. Future research combining multi-omics approaches with large-scale clinical studies will be essential to advance the development of precise FMT-based interventions for DN management. 5 Current limitations and challenges in research 5.1 Ambiguity of causal relationships The ambiguity of causal relationships stands as a central bottleneck in current research on DN and GM, significantly impeding clinical translation. This ambiguity arises from several layers of complexity. Firstly, most available evidence is derived from observational studies, which inherently lack the ability to establish definitive causal links. For example, cross-sectional designs have reported alterations in GM abundance among DN patients (such as fluctuations in specific microbial taxa) ( 26 28 18 18 Secondly, the confounding effect of extraneous variables and the possibility of reverse causality further exacerbate this uncertainty. Factors such as metabolic status may generate spurious associations ( 137 18 137 18 Finally, while MR represents a promising tool for disentangling causality, practical limitations persist. MR leverages genetic variants (e.g., GM-related SNPs) to minimize confounding ( 18 138 18 124 5.2 Fragmentation of mechanistic studies: a systemic lack of integration among metabolic, immune, and barrier pathways Despite considerable advances in DN research, the mechanistic understanding remains fragmented, particularly regarding the integration of metabolic, immune, and barrier pathways. Current studies predominantly address these axes independently, resulting in a lack of comprehensive and unified framework for DN pathogenesis. Research on metabolic pathways exemplifies this segregation. While GM-derived metabolites such as pyrroline and glycine-conjugated bile acids have been causally linked to DN progression ( 139 51 139 140 141 139 142 143 139 141 144 145 146 147 145 148 This fragmented approach generates significant limitations in both mechanistic understanding and therapeutic development. Single-pathway analyses, while facilitating understanding of specific molecular events—such as brown adipose tissue-derived NRG4 suppressing podocyte apoptosis through the Akt-GSK3β pathway ( 149 150 151 152 153 145 139 In summary, the current fragmented approach constrains both mechanistic insights and identification of effective therapeutic targets. Comprehensive, multi-dimensional studies integrating metabolism, immunity, and barrier biology are urgently needed to clarify DN pathogenesis and guide the development of more effective interventions. 5.3 Barriers to clinical translation The clinical translation of GM-based interventions for DN faces significant hurdles, primarily arising from the disconnect between findings in animal models and human clinical realities, as well as the lack of longitudinal, stage-specific data in disease progression. These barriers substantially impede the transition from bench to bedside. One core challenge lies in the differences between animal and human GM, which restrict the reproducibility and translatability of preclinical findings. The GM composition in common animal models—such as rodents—differs markedly from that of humans, resulting in inconsistencies in intervention efficacy. Mechanisms such as short-chain fatty acid metabolism or intestinal barrier repair, which often demonstrate efficacy in animal studies, may not be directly reproduced in clinical studies due to these interspecies differences ( 154 155 Additionally, there is a conspicuous lack of systematic, longitudinal data capturing the dynamic shifts of GM throughout the various stages of DN. Most current studies are cross-sectional in design, typically comparing diabetic patients to healthy controls, and fail to longitudinally track changes in GM across clinical stages—from microalbuminuria to established renal failure ( 156 157 The absence of robust, disease stage-oriented microbial evolution data hinders the development of tailored intervention strategies—for example, metabolic modulation in early-stage DN versus barrier restoration in advanced stages. Consequently, the true potential of personalized, microbiota-based therapies remains largely unrealized. The clinical translation workflow is summarized in  Figure 3 Figure 3 Roadmap for translating microbiota- kidney research into clinical applications, with key barriers identified. This schematic outlines a three-tiered framework for advancing gut-kidney axis research. Left panel highlights translational barriers (red boxes): (i) Animal model limitations (non-human microbiota complexity; limited probiotic efficacy in renal contexts), (ii) Staging data gaps (predominance of cross- sectional studies; longitudinal data scarcity), and (iii) Unresolved microbial dynamics (species-specific variations; undefined longitudinal trajectories). Center depicts gut- kidney anatomical targets. Right vertical axis details progressive research phases: Basic research (multi-omics integration; mechanistic network validation) → Clinical research (stage- stratified cohorts; individualized interventions) → Application (diagnostic biomarkers; precision therapies). Blue arrows denote barrier impact on translational stages. Kidney protection seen in animal models using probiotics, antibiotics, or fecal transplants often proves less effective in human trials. This is partly because animal models inadequately capture the complexity of the human gut- kidney axis and host-microbe co-evolution, making therapeutic targets identified in animals less reliable for clinical application. Clinical translational roadmap diagram showing translational barriers and research tiers. Translational barriers include animal model limitations and staging data absence, focusing on species differences in microbiota and unclear longitudinal dynamics. Basic research tier involves multi-omics integration and mechanistic network validation. Clinical research tier entails stage-based cohort establishment and individualized intervention. Application tier includes diagnostic biomarkers and precision therapy. Diagram connects elements starting from intestinal representation to kidneys. 6 Innovation and future directions With the growing recognition of the GM’s pivotal role in DN, innovative research is increasingly oriented toward integrating mechanistic insights, multi-omics approaches, and personalized interventions. The following subsections systematically summarize key innovations and emerging trends in this field. 6.1 Integration of gut–kidney axis mechanisms and targeted interventions At the mechanistic level, recent studies have, for the first time, systematically linked gut dysbiosis in DN with targeted intervention strategies. Specifically, current literature has demonstrated that gut microbial imbalance exacerbates glomerulosclerosis and tubular injury through both metabolic products (e.g., uremic toxins) and immune-inflammatory pathways (e.g., activation of Toll-like receptors) ( 17 44 158 159 6.2 Multi-omics research paradigms across scales Multi-omics approaches have ushered in a new framework for dissecting the mechanisms of GM in DN. Metagenomics can reveal shifts in microbial community structure among DN patients, such as alterations in the abundance of specific genera ( 23 51 79 18 160 160 161 79 162 6.3 Stage-specific and precision intervention strategies Strategic interventions must be tailored to distinct DN stages. In early DN, supplementation with short-chain fatty acid-producing bacteria (such as Butyricicoccus) or their metabolic products (such as butyrate) has the potential to improve insulin resistance and alleviate glomerular hyperfiltration ( 158 159 44 35 163 6.4 Potential of advanced technologies Frontier technologies offer new avenues for GM-targeted therapy. Phage therapy can specifically lyse pathogenic bacteria (such as endotoxin-producing Klebsiella), and animal models have confirmed its ability to reduce serum LPS levels and proteinuria ( 25 45 159 25 In terms of clinical translation, future directions include stratified and personalized probiotic regimens based on enterotype ( 161 162 164 162 7 Conclusion The gut-kidney axis plays a pivotal role in DN pathogenesis through distinct yet interconnected mechanisms. Gut dysbiosis drives DN progression via three pathways: metabolic dysfunction through loss of protective SCFAs and accumulation of nephrotoxic compounds like indoxyl sulfate; compromised intestinal barrier integrity leading to endotoxin translocation and systemic inflammation; and immune dysregulation affecting Th17/Treg balance and macrophage polarization. MR studies have validated specific microbial signatures associated with DN risk, including protective effects of Bacteroidota and detrimental impacts of reduced Akkermansia abundance. Current therapeutic approaches demonstrate promise but require optimization. Probiotic supplementation and TCM interventions have shown benefits in improving renal function markers and restoring gut barrier integrity, yet standardization of protocols remains a critical challenge. Future research priorities include elucidating molecular mechanisms linking specific bacterial strains and their metabolites to renal pathology, integrating multi-omics approaches for patient stratification, and developing DN-specific microbial biomarkers for early diagnosis. Advancing the field necessitates interdisciplinary collaboration between microbiome researchers, nephrologists, and nutrition scientists to develop personalized therapeutic strategies. Key challenges include addressing regional microbiota heterogeneity and the complexity of host-microbe interactions through large-scale prospective cohorts and mechanistically driven randomized controlled trials. As our understanding of the gut-kidney axis deepens, microbiota-targeted interventions represent a promising frontier for DN management, offering potential for both prevention and treatment through precision medicine approaches. Author contributions HJ: Writing – original draft. XW: Writing – original draft, Funding acquisition. WeiZ: Visualization, Writing – review & editing. ZH: Visualization, Writing – review & editing. WenZ: Writing – original draft, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that Generative AI was used in the creation of this manuscript. For the 3D view of the kidneys in the article’s generated images, we used ChatGPT 4.0, developed by OpenAI. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Das S Gnanasambandan R Intestinal microbiome diversity of diabetic and non-diabetic kidney disease: Current status and future perspective Life Sci 2023 316 121414 10.1016/j.lfs.2023.121414 36682521 2 Zhang Y Zhao L Jia Y Zhang X Han Y Lu P Genetic evidence for the causal relationship between gut microbiota and diabetic kidney disease: A bidirectional, two-sample mendelian randomisation study J Diabetes Res 2024 2024 4545595 10.1155/2024/4545595 39479291 PMC11524706 3 Li Q Xie S Liu Y Yue W Wang L Liang Y Gut microbiota profiling reflects the renal dysfunction and psychological distress in patients with diabetic kidney disease Front Endocrinol (Lausanne) 2024 15 1410295 10.3389/fendo.2024.1410295 39076512 PMC11284015 4 Coll E Cigarran S Portolés J Cases A Gut dysbiosis and its role in the anemia of chronic kidney disease Toxins (Basel) 2024 16 495 10.3390/toxins16110495 39591250 PMC11598790 5 Das S Devi Rajeswari V Venkatraman G Elumalai R Dhanasekaran S Ramanathan G Current updates on metabolites and its interlinked pathways as biomarkers for diabetic kidney disease: A systematic review Transl Res 2024 265 71 87 10.1016/j.trsl.2023.11.002 37952771 6 Yan H Zhang Y Lin X Huang J Zhang F Chen C Resveratrol improves diabetic kidney disease by modulating the gut microbiota-short chain fatty acids axis in db/db mice Int J Food Sci Nutr 2024 75 264–76 10.1080/09637486.2024.2303041 38238900 7 Wu X Zhao L Zhang Y Li K Yang J The role and mechanism of the gut microbiota in the development and treatment of diabetic kidney disease Front Physiol 2023 14 1166685 10.3389/fphys.2023.1166685 37153213 PMC10160444 8 Lee TH Chen JJ Wu CY Lin TY Hung SC Yang HY Immunosenescence, gut dysbiosis, and chronic kidney disease: Interplay and implications for clinical management BioMed J 2024 47 100638 10.1016/j.bj.2023.100638 37524304 PMC10979181 9 Zhang Y Qing J Saed YA Li Y Gut microbiota implication in diabetic kidney disease: mechanisms and novel therapeutic strategies Ren Fail 2025 47 2517402 10.1080/0886022X.2025.2517402 40563141 10 Chen J Chen B Lin B Huang Y Li J Li J The role of gut microbiota in prostate inflammation and benign prostatic hyperplasia and its therapeutic implications Heliyon 2024 10 e38302 10.1016/j.heliyon.2024.e38302 39386817 PMC11462338 11 Mao ZH Gao ZX Liu DW Liu ZS Wu P Gut microbiota and its metabolites - molecular mechanisms and management strategies in diabetic kidney disease Front Immunol 2023 14 1124704 10.3389/fimmu.2023.1124704 36742307 PMC9896007 12 Huang L Wu W Wang X Analysis of the microecological mechanism of diabetic kidney disease based on the theory of ‘gut-kidney axis’: A systematic review Open Life Sci 2024 19 20220909 10.1515/biol-2022-0909 39119482 PMC11306963 13 Balint L Socaciu C Socaciu AI Vlad A Gadalean F Bob F Metabolite profiling of the gut-renal-cerebral axis reveals a particular pattern in early diabetic kidney disease in T2DM patients Int J Mol Sci 2023 24 6212 10.3390/ijms24076212 37047187 PMC10094272 14 Zhou T Xu H Cheng X He Y Ren Q Li D Sodium butyrate attenuates diabetic kidney disease partially via histone butyrylation modification Mediators Inflamm 2022 2022 7643322 10.1155/2022/7643322 35909658 PMC9329006 15 Cai C Cheng W Shi T Liao Y Zhou M Liao Z Rutin alleviates colon lesions and regulates gut microbiota in diabetic mice Sci Rep 2023 13 4897 10.1038/s41598-023-31647-z 36966186 PMC10039872 16 Ni Y Zheng L Nan S Ke L Fu Z Jin J Enterorenal crosstalks in diabetic nephropathy and novel therapeutics targeting the gut microbiota Acta Biochim Biophys Sin (Shanghai) 2022 54 1406–20 10.3724/abbs.2022140 36239349 PMC9827797 17 Cheng G Liu Y Guo R Wang H Zhang W Wang Y Molecular mechanisms of gut microbiota in diabetic nephropathy Diabetes Res Clin Pract 2024 213 111726 10.1016/j.diabres.2024.111726 38844054 18 Chen K Wang X Shang Z Li Q Yao W Guo S Exploring the causal effects of gut microbiota on diabetic nephropathy: a two-sample Mendelian randomization study Comb Chem High Throughput Screen 2025 28 1026–38 10.2174/0113862073311197240425073859 38676512 19 Song S Ning L Yu J Elucidating the causal relationship between gut microbiota, metabolites, and diabetic nephropathy in European patients: Revelations from genome-wide bidirectional Mendelian randomization analysis Front Endocrinol (Lausanne) 2025 15 1391891 10.3389/fendo.2024.1391891 39845884 PMC11750691 20 Hong J Fu T Liu W Du Y Bu J Wei G Specific alternation of gut microbiota and the role of Ruminococcus gnavus in the development of diabetic nephropathy J Microbiol Biotechnol 2024 34 547–61 10.4014/jmb.2310.10028 38346799 PMC11016775 21 Tsai CY Liu PY Huang MC Chang CI Chen HY Chou YH Abundance of Prevotella copri in gut microbiota is inversely related to a healthy diet in patients with type 2 diabetes J Food Drug Anal 2023 31 599 608 10.38212/2224-6614.3484 38526814 PMC10962673 22 Hu Y Ni X Chen Q Qu Y Chen K Zhu G Predicting diabetic kidney disease with serum metabolomics and gut microbiota Sci Rep 2025 15 12179 10.1038/s41598-025-91281-9 40204798 PMC11982385 23 Zhang L Wang Z Zhang X Zhao L Chu J Li H Alterations of the gut microbiota in patients with diabetic nephropathy Microbiol Spectr 2022 10 e0032422 10.1128/spectrum.00324-22 35863004 PMC9430528 24 Lin R Chen R Exploring the causal connection: insights into diabetic nephropathy and gut microbiota from whole-genome sequencing databases Ren Fail 2024 46 2385065 10.1080/0886022X.2024.2385065 39090986 PMC11299436 25 Yan W Ge Y Wang L Wang Y He D Causal relationship of gut microbiota with diabetic nephropathy: a Mendelian randomization analysis Front Microbiol 2024 14 1281361 10.3389/fmicb.2023.1281361 38235430 PMC10792041 26 Yan S Wang H Feng B Ye L Chen A Causal relationship between gut microbiota and diabetic nephropathy: a two-sample Mendelian randomization study Front Immunol 2024 15 1332757 10.3389/fimmu.2024.1332757 38533501 PMC10964483 27 Jin Y Han C Yang D Gao S Association between gut microbiota and diabetic nephropathy: a mendelian randomization study Front Microbiol 2024 15 1309871 10.3389/fmicb.2024.1309871 38601939 PMC11004376 28 Fang Y Zhang Y Liu Q Zheng Z Ren C Zhang X Assessing the causal relationship between gut microbiota and diabetic nephropathy: insights from two-sample Mendelian randomization Front Endocrinol (Lausanne) 2024 15 1329954 10.3389/fendo.2024.1329954 38562415 PMC10982433 29 Wu IW Liao YC Tsai TH Lin CH Shen ZQ Chan YH Machine-learning assisted discovery unveils novel interplay between gut microbiota and host metabolic disturbance in diabetic kidney disease Gut Microbes 2025 17 2473506 10.1080/19490976.2025.2473506 40050256 PMC11901534 30 Han S Chen M Cheng P Zhang Z Lu Y Xu Y A systematic review and meta-analysis of gut microbiota in diabetic kidney disease: Comparisons with diabetes mellitus, non-diabetic kidney disease, and healthy individuals Front Endocrinol (Lausanne) 2022 13 1018093 10.3389/fendo.2022.1018093 36339429 PMC9633273 31 Song X Cui J Li S Huang B Causal relationships between gut microbiota, metabolites, and diabetic nephropathy: insights from a two-sample Mendelian randomization analysis Int J Nephrol Renovasc Dis 2024 17 319–32 10.2147/IJNRD.S489074 39679125 PMC11645948 32 Liu X Zhang M Wang X Liu P Wang L Li Y Fecal microbiota transplantation restores normal fecal composition and delays Malignant development of mild chronic kidney disease in rats Front Microbiol 2022 13 1037257 10.3389/fmicb.2022.1037257 36532422 PMC9748282 33 Kim JE Nam H Park JI Cho H Lee J Kim HE Gut microbial genes and metabolism for methionine and branched-chain amino acids in diabetic nephropathy Microbiol Spectr 2023 11 e0234422 10.1128/spectrum.02344-22 36877076 PMC10100834 34 Li YJ Ma J Loh YW Chadban SJ Wu H Short-chain fatty acids directly exert anti-inflammatory responses in podocytes and tubular epithelial cells exposed to high glucose Front Cell Dev Biol 2023 11 1182570 10.3389/fcell.2023.1182570 37215085 PMC10192692 35 Tian E Wang F Zhao L Sun Y Yang J The pathogenic role of intestinal flora metabolites in diabetic nephropathy Front Physiol 2023 14 1231621 10.3389/fphys.2023.1231621 37469558 PMC10352811 36 Qumsani AT Gut microbiome engineering for diabetic kidney disease prevention: a Lactobacillus rhamnosus GG intervention study Biol (Basel) 2025 14 723 10.3390/biology14060723 40563973 PMC12189892 37 Shukla PK Rao RG Meena AS Giorgianni F Lee SC Raju P Paneth cell dysfunction in radiation injury and radiomitigation by human α-defensin 5 Front Immunol 2023 14 1174140 10.3389/fimmu.2023.1174140 37638013 PMC10448521 38 Erkert L Gamez-Belmonte R Kabisch M Schödel L Patankar JV Gonzalez-Acera M TRR241 IBDome Consortium; Neurath MF, Wirtz S, Becker C. Alzheimer’s disease-related presenilins are key to intestinal epithelial cell function and gut immune homoeostasis Gut 2024 73 1618–31 10.1136/gutjnl-2023-331622 38684238 39 Ferreira YAM Jamar G Estadella D Pisani LP Proanthocyanidins in grape seeds and their role in gut microbiota-white adipose tissue axis Food Chem 2023 404 10.1016/j.foodchem.2022.134405 36444031 40 Rao PL Shen YH Song YJ Xu Y Xu HX Prunella vulgaris L. attenuates gut dysbiosis and endotoxin leakage against alcoholic liver disease J Ethnopharmacol 2024 319 117237 10.1016/j.jep.2023.117237 37769885 41 Koshida T Gohda T Kaga N Taka H Shimozawa K Murakoshi M Inappropriate diet and hygiene status affect the progression of diabetic kidney disease by causing dysbiosis Nutr 2025 131 112633 10.1016/j.nut.2024.112633 39642696 42 Li J Lv JL Cao XY Zhang HP Tan YJ Chu T Gut microbiota dysbiosis as an inflammaging condition that regulates obesity-related retinopathy and nephropathy Front Microbiol 2022 13 1040846 10.3389/fmicb.2022.1040846 36406423 PMC9666733 43 Kong J Yang J He C Zhou B Fang S Salinas M Regulation of endotoxemia through the gut microbiota: The role of the Mediterranean diet and its components APMIS 2024 132 948–55 10.1111/apm.13473 39370693 44 Liu J Guo M Yuan X Fan X Wang J Jiao X Gut microbiota and their metabolites: the hidden driver of diabetic nephropathy? Unveiling gut microbe’s role in DN J Diabetes 2025 17 e70068 10.1111/1753-0407.70068 40189872 PMC11973130 45 Chen PP Zhang JX Li XQ Li L Wu QY Liu L Outer membrane vesicles derived from gut microbiota mediate tubulointerstitial inflammation: a potential new mechanism for diabetic kidney disease Theranostics 2023 13 3988 4003 10.7150/thno.84650 37554279 PMC10405836 46 Mázala-de-Oliveira T Jannini de Sá YAP Carvalho VF Impact of gut-peripheral nervous system axis on the development of diabetic neuropathy Mem Inst Oswaldo Cruz 2023 118 e220197 10.1590/0074-02760220197 36946851 PMC10027071 47 Al-Ghamdi SB Probiotics as renal guardians: modulating gut microbiota to combat diabetes-induced kidney damage Biol (Basel) 2025 14 122 10.3390/biology14020122 40001890 PMC11851623 48 Gali S Kundu A Sharma S Ahn MY Puia Z Kumar V Therapeutic potential of bark extracts from Macaranga denticulata on renal fibrosis in streptozotocin-induced diabetic rats J Toxicol Environ Health A 2024 87 911–33 10.1080/15287394.2024.2394586 39306745 49 Ajiboye BO Famusiwa CD Nifemi DM Ayodele BM Akinlolu OS Fatoki TH Nephroprotective effect of hibiscus sabdariffa leaf flavonoid extracts via KIM-1 and TGF-1β Signaling pathways in streptozotocin-induced rats ACS Omega 2024 9 19334–44 10.1021/acsomega.4c00254 38708257 PMC11064007 50 Putra IMWA Fakhrudin N Nurrochmad A Wahyuono S A review of medicinal plants with renoprotective activity in diabetic nephropathy animal models Life (Basel) 2023 13 560 10.3390/life13020560 36836916 PMC9963806 51 Chu C Behera TR Huang Y Qiu W Chen J Shen Q Research progress of gut microbiome and diabetic nephropathy Front Med (Lausanne) 2024 11 1490314 10.3389/fmed.2024.1490314 39735707 PMC11671260 52 Tokarek J Budny E Saar M Kućmierz J Młynarska E Rysz J Does the composition of gut microbiota affect hypertension? Molecular mechanisms involved in increasing blood pressure Int J Mol Sci 2023 24 1377 10.3390/ijms24021377 36674891 PMC9863380 53 Chen CY Ho HC Roles of gut microbes in metabolic-associated fatty liver disease Tzu Chi Med J 2023 35 279–89 10.4103/tcmj.tcmj_86_23 38035063 PMC10683521 54 Cha RH Pharmacologic therapeutics in sarcopenia with chronic kidney disease Kidney Res Clin Pract 2024 43 143–55 10.23876/j.krcp.23.094 38389147 PMC11016676 55 Zhao H Zhao T Li P Gut microbiota-derived metabolites: A new perspective of traditional chinese medicine against diabetic kidney disease Integr Med Nephrol Andrology 2024 11 e23 00024 10.1097/IMNA-D-23-00024 56 Wiefels MD Furar E Eshraghi RS Mittal J Memis I Moosa M Targeting gut dysbiosis and microbiome metabolites for the development of therapeutic modalities for neurological disorders Curr Neuropharmacol 2024 22 123–39 10.2174/1570159X20666221003085508 36200211 PMC10716879 57 Yan W Wen S Zhou L Effect of intestinal flora on hyperuricemia-induced chronic kidney injury in type 2 diabetic patients and the therapeutic mechanism of new anti-diabetic prescription medications Diabetes Metab Syndr Obes 2023 16 3029–44 10.2147/DMSO.S429068 37794899 PMC10547008 58 Jiang L Sun XY Wang SQ Liu YL Lu LJ Wu WH Indoxyl sulphate-TNFα axis mediates uremic encephalopathy in rodent acute kidney injury Acta Pharmacol Sin 2024 45 1406–24 10.1038/s41401-024-01251-6 38589687 PMC11192958 59 Stepanova N Driianska V Korol L Snisar L Association between serum total indoxyl sulfate, intraperitoneal inflammation, and peritoneal dialysis technique failure: a 3-year prospective cohort study BMC Nephrol 2024 25 475 10.1186/s12882-024-03935-x 39741261 PMC11689590 60 Kędzierska-Kapuza K Grudniewska A Durma A Małecki R Franek E Szczuko M Dietary and nutritional strategies to prevent uremic toxin formation and slow the progression of diabetic kidney disease J Clin Med 2025 14 4701 10.3390/jcm14134701 40649074 PMC12251183 61 Tsuji K Uchida N Nakanoh H Fukushima K Haraguchi S Kitamura S The gut-kidney axis in chronic kidney diseases Diagnostics (Basel) 2024 15 21 10.3390/diagnostics15010021 39795549 PMC11719742 62 Altunkaynak HO Karaismailoglu E Massy ZA The ability of AST-120 to lower the serum indoxyl sulfate level improves renal outcomes and the lipid profile in diabetic and nondiabetic animal models of chronic kidney disease: A meta-analysis Toxins (Basel) 2024 16 544 10.3390/toxins16120544 39728802 PMC11679735 63 Czaja-Stolc S Potrykus M Ruszkowski J Styburski D Dębska-Ślizień A Małgorzewicz S The associations between nutrition and circulating gut microbiota-derived uremic toxins in patients undergoing kidney replacement therapy: An observational, cross-sectional study Clin Nutr ESPEN 2025 65 105–14 10.1016/j.clnesp.2024.11.022 39577692 64 Hu D Liu W Yu W Huang L Ji C Liu X Psyllium seed husk regulates the gut microbiota and improves mucosal barrier injury in the colon to attenuate renal injury in 5/6 nephrectomy rats Ren Fail 2023 45 2197076 10.1080/0886022X.2023.2197076 37017261 PMC10078125 65 Ji Y Xiao Y Li S Fan Y Cai Y Yang B Protective effect and mechanism of Xiaoyu Xiezhuo decoction on ischemia-reperfusion induced acute kidney injury based on gut-kidney crosstalk Ren Fail 2024 46 2365982 10.1080/0886022X.2024.2365982 39010816 PMC11740681 66 Zhu N Duan H Feng Y Xu W Shen J Wang K Magnesium lithospermate B ameliorates diabetic nephropathy by suppressing the uremic toxin formation mediated by gut microbiota Eur J Pharmacol 2023 953 175812 10.1016/j.ejphar.2023.175812 37245856 67 Duan J He L Deng W Lu M Zhai Y Pei F Natural swietenine attenuates diabetic nephropathy by regulating the NF-κB/NLRP3/Caspase-1 signaling pathways: In vivo in vitro Environ Toxicol 2022 37 2977–89 10.1002/tox.23653 36066211 68 Afsari Y Atabi F Aghelan Z Khazaie H Vakili Z Abtahi SH Serum levels of 1,3-β-D-glucan is correlated with NLRP3 inflammasome activation and insomnia severity in people with chronic insomnia disorder Sleep Med 2025 129 187–91 10.1016/j.sleep.2025.02.046 40043439 69 Yu T Luo L Xue J Tang W Wu X Yang F Gut microbiota-NLRP3 inflammasome crosstalk in metabolic dysfunction-associated steatotic liver disease Clin Res Hepatol Gastroenterol 2024 48 102458 10.1016/j.clinre.2024.102458 39233138 70 Huang H Zhou T He F Wen B Yang Y Zhong W The gut microbiota improves reproductive dysfunction in obese mice by suppressing the NLRP3/ASC/caspase-1 axis Future Microbiol 2024 19 1389–405 10.1080/17460913.2024.2386867 39225491 PMC11552480 71 Kounatidis D Vallianou N Evangelopoulos A Vlahodimitris I Grivakou E Kotsi E SGLT-2 inhibitors and the inflammasome: what’s next in the 21st century Nutrients 2023 15 2294 10.3390/nu15102294 37242177 PMC10221012 72 Zhao Z Liu W Cheng G Dong S Zhao Y Wu H Knockdown of DAPK1 inhibits IL-1β-induced inflammation and cartilage degradation in human chondrocytes by modulating the PEDF-mediated NF-κB and NLRP3 inflammasome pathway Innate Immun 2024 30 21 30 10.1177/17534259221086837 36412004 PMC10720599 73 Zhou KL He YR Liu YJ Liu YM Xuan LZ Gu ZY IL-17A/p38 signaling pathway induces alveolar epithelial cell pyroptosis and hyperpermeability in sepsis-induced acute lung injury by activating NLRP3 inflammasome Adv Biol (Weinh) 2023 7 e2300220 10.1002/adbi.202300220 37607110 74 Jiang R Zhou H Kong X Zhou Z Reactive Oxygen Species Modulate Th17/Treg Balance in Chlamydia psittaci Pneumonia via NLRP3/IL-1β/Caspase-1 Pathway Differentiation Folia Biol (Praha) 2024 70 74 83 10.14712/fb2024070010074 38830125 75 Liu X Chen J Yue S Zhang C Song J Liang H NLRP3-mediated IL-1β in regulating the imbalance between Th17 and Treg in experimental autoimmune prostatitis Sci Rep 2024 14 18829 10.1038/s41598-024-69512-2 39138267 PMC11322183 76 Yang X Hong C Guan T Zhang C Yang Y Xiao P Periplaneta americana (L.) extract PAS840 promotes ischemic stroke recovery by inhibiting inflammasome activation Biol (Basel) 2025 14 589 10.3390/biology14060589 40563841 PMC12189569 77 Zhang Z He Y Zhao M He X Zhou Z Yue Y Qinlian hongqu decoction modulates FXR/TGR5/GLP-1 pathway to improve insulin resistance in NAFLD mice: bioinformatics and experimental study ACS Omega 2024 9 45447–66 10.1021/acsomega.4c07463 39554433 PMC11561767 78 Zhu M Dagah OMA Silaa BB Lu J Thioredoxin/glutaredoxin systems and gut microbiota in NAFLD: interplay, mechanism, and therapeutical potential Antioxidants (Basel) 2023 12 1680 10.3390/antiox12091680 37759983 PMC10525532 79 Fu S Li F Yu J Ma S Zhang L Cheng Y Investigating the role of gut microbiota in diabetic nephropathy through plasma proteome mediated analysis Sci Rep 2025 15 5457 10.1038/s41598-025-90306-7 39953202 PMC11828962 80 Ye K Zhao Y Huang W Zhu Y Sodium butyrate improves renal injury in diabetic nephropathy through AMPK/SIRT1/PGC-1α signaling pathway Sci Rep 2024 14 17867 10.1038/s41598-024-68227-8 39090182 PMC11294604 81 Lv M Zheng Y Yuan M Zhang E Zheng M Liu G Cassiae semen extract ameliorates hyperlipidemia in rats by modulating lipid metabolism and FcγR-mediated immune regulation Front Pharmacol 2025 16 1546119 10.3389/fphar.2025.1546119 40357000 PMC12066667 82 Paul P Kaul R Chaari A Renal health improvement in diabetes through microbiome modulation of the gut-kidney axis with biotics: A systematic and narrative review of randomized controlled trials Int J Mol Sci 2022 23 14838 10.3390/ijms232314838 36499168 PMC9740604 83 Yadav M Sehrawat N Sharma AK Kumar S Singh R Kumar A Synbiotics as potent functional food: recent updates on therapeutic potential and mechanistic insight J Food Sci Technol 2024 61 1 15 10.1007/s13197-022-05621-y 38192708 PMC10771572 84 Baghel K Khan A Kango N Role of synbiotics (Prebiotics and probiotics) as dietary supplements in type 2 diabetes mellitus induced health complications J Diet Suppl 2024 21 677 708 10.1080/19390211.2024.2340509 38622882 85 Ghosh A Muley A Ainapure AS Deshmane AR Mahajan A Exploring the impact of optimized probiotic supplementation techniques on diabetic nephropathy: mechanisms and therapeutic potential Cureus 2024 16 e55149 10.7759/cureus.55149 38558739 PMC10979819 86 Stougaard EB Tougaard NH Sivalingam S Hansen CS Størling J Hansen TW Effects of probiotics and fibers on markers of nephropathy, inflammation, intestinal barrier dysfunction and endothelial dysfunction in individuals with type 1 diabetes and albuminuria ProFOS Study. J Diabetes Complications 2024 38 108892 10.1016/j.jdiacomp.2024.108892 39471704 87 Bo T Liu H Liu M Liu Q Li Q Cong Y Mechanism of inulin in colic and gut microbiota of captive Asian elephant Microbiome 2023 11 148 10.1186/s40168-023-01581-3 37408039 PMC10324157 88 Zhu M Ouyang J Zhou F Zhao C Zhu W Liu C Polysaccharides from Fu brick tea ameliorate obesity by modulating gut microbiota and gut microbiota-related short chain fatty acid and amino acid metabolism J Nutr Biochem 2023 118 109356 10.1016/j.jnutbio.2023.109356 37087075 89 Yu Z Li D Sun H Herba Origani alleviated DSS-induced ulcerative colitis in mice through remolding gut microbiota to regulate bile acid and short-chain fatty acid metabolisms BioMed Pharmacother 2023 161 114409 10.1016/j.biopha.2023.114409 36822021 90 Chen L Liu B Ren L Du H Fei C Qian C High-fiber diet ameliorates gut microbiota, serum metabolism and emotional mood in type 2 diabetes patients Front Cell Infect Microbiol 2023 13 1069954 10.3389/fcimb.2023.1069954 36794003 PMC9922700 91 Yang R Shan S An N Liu F Cui K Shi J Polyphenols from foxtail millet bran ameliorate DSS-induced colitis by remodeling gut microbiome Front Nutr 2022 9 1030744 10.3389/fnut.2022.1030744 36479296 PMC9719911 92 Yadav SK Ito K Dhib-Jalbut S Interaction of the gut microbiome and immunity in multiple sclerosis: impact of diet and immune therapy Int J Mol Sci 2023 24 14756 10.3390/ijms241914756 37834203 PMC10572709 93 Xu H Yang F Bao Z Gut microbiota and myocardial fibrosis Eur J Pharmacol 2023 940 175355 10.1016/j.ejphar.2022.175355 36309048 94 Budau R Okamura T Hasegawa Y Nakanishi N Hamaguchi M Fukui M Supplementation of miso to a western-type diet stimulates ILC3s and decreases inflammation in the small intestine Nutrients 2024 16 3743 10.3390/nu16213743 39519576 PMC11547460 95 Li X Peng X Qiao B Peng M Deng N Yu R Gut-Kidney Impairment Process of Adenine Combined with Folium sennae-Induced Diarrhea: Association with Interactions between Lactobacillus intestinalis, Bacteroides acidifaciens and Acetic Acid, Inflammation, and Kidney Function Cells 2022 11 3261 10.3390/cells11203261 36291135 PMC9599973 96 Li C Yao J Yang C Yu S Yang Z Wang L Gut microbiota-derived short chain fatty acids act as mediators of the gut-liver-brain axis Metab Brain Dis 2025 40 122 10.1007/s11011-025-01554-5 39921774 97 Xu X Zhang F Ren J Zhang H Jing C Wei M Dietary intervention improves metabolic levels in patients with type 2 diabetes through the gut microbiota: a systematic review and meta-analysis Front Nutr 2024 10 1243095 10.3389/fnut.2023.1243095 38260058 PMC10800606 98 Fu J Zheng Y Gao Y Xu W Dietary fiber intake and gut microbiota in human health Microorganisms 2022 10 2507 10.3390/microorganisms10122507 36557760 PMC9787832 99 Shi Y Xing L Zheng R Luo X Yue F Xiang X Butyrate attenuates high-fat diet-induced glomerulopathy through GPR43-Sirt3 pathway Br J Nutr 2025 133 1 10 10.1017/S0007114524002964 39575829 100 Favero C Pintor-Chocano A Sanz A Ortiz A Sanchez-Niño MD Butyrate promotes kidney resilience through a coordinated kidney protective response in tubular cells Biochem Pharmacol 2024 224 116203 10.1016/j.bcp.2024.116203 38615919 101 Chen WJ Chen YT Ko JL Chen JY Zheng JY Liao JW Butyrate modulates gut microbiota and anti-inflammatory response in attenuating cisplatin-induced kidney injury BioMed Pharmacother 2024 181 117689 10.1016/j.biopha.2024.117689 39581143 102 Tian X Zeng Y Tu Q Jiao Y Yao S Chen Y Butyrate alleviates renal fibrosis in CKD by regulating NLRP3-mediated pyroptosis via the STING/NF-κB/p65 pathway Int Immunopharmacol 2023 124 10.1016/j.intimp.2023.111010 37852118 103 Bashir AM Olaniyi KS Butyrate alleviates renal inflammation and fibrosis in a rat model of polycystic ovarian syndrome by suppression of SDF-1 BMC Pharmacol Toxicol 2023 24 48 10.1186/s40360-023-00692-9 37789355 PMC10548736 104 Yu Y Jia YY Li HJ Sodium butyrate improves mitochondrial function and kidney tissue injury in diabetic kidney disease via the AMPK/PGC-1α pathway Ren Fail 2023 45 2287129 10.1080/0886022X.2023.2287129 38073119 PMC11001342 105 Liu J Gu QH Cui Z Zhao MH Jia XY Short-chain fatty acids ameliorate experimental anti-glomerular basement membrane disease Clin Immunol 2024 259 109903 10.1016/j.clim.2024.109903 38218211 106 Niu H Ren X Tan E Wan X Wang Y Shi H CD36 deletion ameliorates diabetic kidney disease by restoring fatty acid oxidation and improving mitochondrial function Ren Fail 2023 45 2292753 10.1080/0886022X.2023.2292753 38097943 PMC10732185 107 Zhou K Zi X Song J Zhao Q Liu J Bao H Molecular mechanistic pathways targeted by natural compounds in the prevention and treatment of diabetic kidney disease Molecules 2022 27 6221 10.3390/molecules27196221 36234757 PMC9571643 108 Ren N Wang WF Zou L Zhao YL Miao H Zhao YY The nuclear factor kappa B signaling pathway is a master regulator of renal fibrosis Front Pharmacol 2024 14 1335094 10.3389/fphar.2023.1335094 38293668 PMC10824958 109 Gao LW Yang XY Yu YF Yin S Tong KK Hu G Bibliometric analysis of intestinal microbiota in diabetic nephropathy Eur Rev Med Pharmacol Sci 2023 27 8812–28 10.26355/eurrev_202309_33802 37782191 110 Wu XQ Zhao L Zhao YL He XY Zou L Zhao YY Traditional Chinese medicine improved diabetic kidney disease through targeting gut microbiota Pharm Biol 2024 62 423–35 10.1080/13880209.2024.2351946 38757785 PMC11104709 111 Miao H Liu F Wang YN Yu XY Zhuang S Guo Y Targeting Lactobacillus johnsonii to reverse chronic kidney disease Signal Transduct Target Ther 2024 9 195 10.1038/s41392-024-01913-1 39098923 PMC11298530 112 Miao H Wang YN Yu XY Zou L Guo Y Su W Lactobacillus species ameliorate membranous nephropathy through inhibiting the aryl hydrocarbon receptor pathway via tryptophan-produced indole metabolites Br J Pharmacol 2024 181 162–79 10.1111/bph.16219 37594378 113 Zhang X Wang J Zhang T Li S Liu J Li M Updated progress on polysaccharides with anti-diabetic effects through the regulation of gut microbiota: sources, mechanisms, and structure-activity relationships Pharm (Basel) 2024 17 456 10.3390/ph17040456 38675416 PMC11053653 114 Li L Peng P Ding N Jia W Huang C Tang Y Oxidative stress, inflammation, gut dysbiosis: what can polyphenols do in inflammatory bowel disease Antioxidants (Basel) 2023 12 967 10.3390/antiox12040967 37107341 PMC10135842 115 Stepanova N Probiotic interventions in peritoneal dialysis: A review of underlying mechanisms and therapeutic potentials World J Nephrol 2024 13 98719 10.5527/wjn.v13.i4.98719 39723354 PMC11572655 116 Zhang S Zhang S Bai X Wang Y Liu Y Liu W Thonningianin A ameliorated renal interstitial fibrosis in diabetic nephropathy mice by modulating gut microbiota dysbiosis and repressing inflammation Front Pharmacol 2024 15 1389654 10.3389/fphar.2024.1389654 39193336 PMC11347433 117 Mitrea L Medeleanu M Pop CR Rotar AM Vodnar DC Biotics (Pre-, pro-, post-) and uremic toxicity: implications, mechanisms, and possible therapies Toxins (Basel) 2023 15 548 10.3390/toxins15090548 37755974 PMC10535688 118 Rumanli Z Vural IM Avci GA Chronic kidney disease, uremic toxins and microbiota Microbiota Host 2025 3 e240012 10.1530/MAH-24-0012 119 Frąk W Dąbek B Balcerczyk-Lis M Motor J Radzioch E Młynarska E Role of uremic toxins, oxidative stress, and renal fibrosis in chronic kidney disease Antioxidants (Basel) 2024 13 687 10.3390/antiox13060687 38929126 PMC11200916 120 Tao P Huo J Chen L Bibliometric analysis of the relationship between gut microbiota and chronic kidney disease from 2001–2022 Integr Med Nephrol Andrology 2024 11 e00017 10.1097/IMNA-D-23-00017 121 Ye Z So T Zhang T Gao X Association between gut microbiota and diabetic nephropathy: a two-sample Mendelian randomization study Front Endocrinol (Lausanne) 2024 15 1361440 10.3389/fendo.2024.1361440 39027478 PMC11254691 122 Li XJ Shan QY Wu X Miao H Zhao YY Gut microbiota regulates oxidative stress and inflammation: a double-edged sword in renal fibrosis Cell Mol Life Sci 2024 81 480 10.1007/s00018-024-05532-5 39636415 PMC11621299 123 Li YY Guan RQ Hong ZB Wang YL Pan LM Advances in the treatment of diabetic peripheral neuropathy by modulating gut microbiota with traditional Chinese medicine World J Diabetes 2024 15 1712–6 10.4239/wjd.v15.i8.1712 39192853 PMC11346088 124 Tahiri M Gilbert JA Examining the potential prebiotic effect of almonds J Appl Microbiol 2025 136 lxaf078 10.1093/jambio/lxaf078 40156575 125 Miao H Zhang SJ Wu X Li P Zhao YY Tryptophan metabolism as a target in gut microbiota, ageing and kidney disease Int J Biol Sci 2025 21 4374–87 10.7150/ijbs.115359 40765836 PMC12320236 126 Sun X Sun W Huang Y Chen J Traditional chinese medicine: an exogenous regulator of crosstalk between the gut microbial ecosystem and CKD Evid Based Complement Alternat Med 2022 2022 7940684 10.1155/2022/7940684 36536867 PMC9759397 127 Vassallo GA Dionisi T De Vita V Augello G Gasbarrini A Pitocco D The role of fecal microbiota transplantation in diabetes Acta Diabetol 2025 62 977–81 10.1007/s00592-025-02508-0 40252102 PMC12283471 128 Li YG Yu ZJ Li A Ren ZG Gut microbiota alteration and modulation in hepatitis B virus-related fibrosis and complications: Molecular mechanisms and therapeutic inventions World J Gastroenterol 2022 28 3555–72 10.3748/wjg.v28.i28.3555 36161048 PMC9372803 129 Shang J Cui W Guo R Zhang Y Wang P Yu W The harmful intestinal microbial community accumulates during DKD exacerbation and microbiome-metabolome combined validation in a mouse model Front Endocrinol (Lausanne) 2022 13 964389 10.3389/fendo.2022.964389 36601003 PMC9806430 130 Xie YC Jing XB Chen X Chen LZ Zhang SH Cai XB Fecal microbiota transplantation treatment for type 1 diabetes mellitus with malnutrition: a case report Ther Adv Chronic Dis 2022 13 20406223221117449 10.1177/20406223221117449 36003287 PMC9393929 131 Ye XX Jiang QY Wu MJ Ye QH Zheng H Transplant of fecal microbiota from healthy young mice relieves cognitive defects in late-stage diabetic mice by reducing metabolic disorders and neuroinflammation Acta Pharmacol Sin 2024 45 2513–26 10.1038/s41401-024-01340-6 38992120 PMC11579283 132 Arteaga-Muller GY Flores-Treviño S Bocanegra-Ibarias P Robles-Espino D Garza-González E Fabela-Valdez GC Changes in the progression of chronic kidney disease in patients undergoing fecal microbiota transplantation Nutrients 2024 16 1109 10.3390/nu16081109 38674803 PMC11055146 133 Caggiano G Stasi A Franzin R Fiorentino M Cimmarusti MT Deleonardis A Fecal microbiota transplantation in reducing uremic toxins accumulation in kidney disease: current understanding and future perspectives Toxins (Basel) 2023 15 115 10.3390/toxins15020115 36828429 PMC9965504 134 Rakotonirina A Galperine T Allémann E Fecal microbiota transplantation: a review on current formulations in Clostridioides difficile infection and future outlooks Expert Opin Biol Ther 2022 22 929–44 10.1080/14712598.2022.2095901 35763604 135 Zhi W Li A Wang Q Yuan X Qing J Zhang C Safety and efficacy assessment of fecal microbiota transplantation as an adjunctive treatment for IgA nephropathy: an exploratory clinical trial Sci Rep 2024 14 22935 10.1038/s41598-024-74171-4 39358432 PMC11446926 136 Wu L Li MQ Xie YT Zhang Q Lu XJ Liu T Washed microbiota transplantation improves patients with high blood glucose in South China Front Endocrinol (Lausanne) 2022 13 985636 10.3389/fendo.2022.985636 36213281 PMC9539914 137 Xu M Hao J Qi Y Wu B Li R Yang X Causal effects of gut microbiota on diabetic neuropathy: a two-sample Mendelian randomization study Front Endocrinol (Lausanne) 2024 15 1388927 10.3389/fendo.2024.1388927 39157679 PMC11329939 138 Yang CL Chen YJ Huang X Cheng Q Chen W Guo Z Causal relationship between gut microbiota and diabetic nephropathy: A bidirectional mendelian randomization study Cell Mol Biol (Noisy-le-grand) 2024 70 127–33 10.14715/cmb/2024.70.4.20 38678614 139 Cao BN Zhang CY Wang Z Wang YX Causal relationship between 412 gut microbiota, 1,400 blood metabolites, and diabetic nephropathy: a randomized Mendelian study Front Endocrinol (Lausanne) 2025 15 1450428 10.3389/fendo.2024.1450428 39897958 PMC11782027 140 Hu X Chen S Ye S Chen W Zhou Y New insights into the role of immunity and inflammation in diabetic kidney disease in the omics era Front Immunol 2024 15 1342837 10.3389/fimmu.2024.1342837 38487541 PMC10937589 141 Ma L Liu D Yu Y Li Z Wang Q Immune-mediated renal injury in diabetic kidney disease: from mechanisms to therapy Front Immunol 2025 16 1587806 10.3389/fimmu.2025.1587806 40534883 PMC12173918 142 Zhuang M Zhang X Cai J Microbiota-gut-brain axis: interplay between microbiota, barrier function and lymphatic system Gut Microbes 2024 16 2387800 10.1080/19490976.2024.2387800 39182226 PMC11346530 143 Pour-Reza-Gholi F Assadiasl S Immunological approaches in the treatment of diabetic nephropathy Curr Diabetes Rev 2024 21 e061123223172 10.2174/0115733998267893231016062205 37936470 144 Robles-Osorio ML Sabath E Tight junction disruption and the pathogenesis of the chronic complications of diabetes mellitus: A narrative review World J Diabetes 2023 14 1013–26 10.4239/wjd.v14.i7.1013 37547580 PMC10401447 145 Yu B Shen K Li T Li J Meng M Liu W Glycolytic enzyme PFKFB3 regulates sphingosine 1-phosphate receptor 1 in proangiogenic glomerular endothelial cells under diabetic condition Am J Physiol Cell Physiol 2023 325 C1354–68 10.1152/ajpcell.00261.2023 37781737 PMC10861147 146 Zhang J Chen S Xiang H Xiao J Zhao S Shu Z S1PR2/Wnt3a/RhoA/ROCK1/β-catenin signaling pathway promotes diabetic nephropathy by inducting endothelial mesenchymal transition and impairing endothelial barrier function Life Sci 2023 328 121853 10.1016/j.lfs.2023.121853 37307963 147 Li X Miao Y Fang Z Zhang Q The association and prediction value of acylcarnitine on diabetic nephropathy in Chinese patients with type 2 diabetes mellitus Diabetol Metab Syndr 2023 15 130 10.1186/s13098-023-01058-1 37330521 PMC10276375 148 Zhang J Lin B Zhang Y Hu X Liu T Liu EH Baitouweng decoction alleviates ulcerative colitis by regulating tryptophan metabolism through DOPA decarboxylase promotion Front Pharmacol 2024 15 1423307 10.3389/fphar.2024.1423307 38974042 PMC11224817 149 Ding S Xu JL Tong JY Cheng YY Shi LF Wei W Brown adipose tissue alleviates podocyte apoptosis through NRG4 in a male mouse model of diabetic kidney disease Diabetologia 2025 68 1057–75 10.1007/s00125-025-06385-8 40014139 150 Papaetis G SGLT2 inhibitors and diabetic kidney disease: targeting multiple and interrelated signaling pathways for renal protection Curr Mol Pharmacol 2023 10.2174/0118761429261105231011101200 37904562 151 Zhang MY Zheng SQ Network pharmacology and molecular dynamics study of the effect of the Astragalus-Coptis drug pair on diabetic kidney disease World J Diabetes 2024 15 1562–88 10.4239/wjd.v15.i7.1562 39099827 PMC11292324 152 Mao J Lu Q Gao F Liu H Tan J Antagonistic effect of jiawei shengjiang san on a rat model of diabetic nephropathy: related to EGFR/MAPK3/1 signaling pathway J Vis Exp 2024 207 110–6 10.3791/66179 38801274 153 Shi J Liu X Jiao Y Tian J An J Zou G mTOR pathway: A key player in diabetic nephropathy progression and therapeutic targets Genes Dis 2024 12 101260 10.1016/j.gendis.2024.101260 39717716 PMC11665407 154 Jung YS Song NE Oh SY Park YK Kim YJ Seong H Advances in in vitro Biotechnol Adv 2025 82 108595 10.1016/j.bioteChadv.2025.108595 40374084 155 Rocha Martin VN Del’Homme C Chassard C Schwab C Braegger C Bernalier-Donadille A A proof of concept infant-microbiota associated rat model for studying the role of gut microbiota and alleviation potential of Cutibacterium avidum in infant colic Front Nutr 2022 9 902159 10.3389/fnut.2022.902159 36071938 PMC9441890 156 Wang J Liu X Li Q Interventional strategies for ischemic stroke based on the modulation of the gut microbiota Front Neurosci 2023 17 1158057 10.3389/fnins.2023.1158057 36937662 PMC10017736 157 Jiang QR Zeng DW Gut microbiota shifts in hepatitis B-related portal hypertension after transjugular intrahepatic portosystemic shunt: Mechanistic and clinical implications World J Gastroenterol 2025 31 100752 10.3748/wjg.v31.i3.100752 39839897 PMC11684156 158 Yadav S Sapra L Srivastava RK Polysaccharides to postbiotics: Nurturing bone health via modulating ‘gut-immune axis’ Int J Biol Macromol 2024 278 10.1016/j.ijbiomac.2024.134655 39128750 159 Zhao J Liao Y Wei C Ma Y Wang F Chen Y Potential ability of probiotics in the prevention and treatment of colorectal cancer Clin Med Insights Oncol 2023 17 11795549231188225 10.1177/11795549231188225 37601319 PMC10437046 160 Zhao H Yang CE Liu T Zhang MX Niu Y Wang M The roles of gut microbiota and its metabolites in diabetic nephropathy Front Microbiol 2023 14 1207132 10.3389/fmicb.2023.1207132 37577423 PMC10413983 161 Lu X Ma J Li R Alterations of gut microbiota in biopsy-proven diabetic nephropathy and a long history of diabetes without kidney damage Sci Rep 2023 13 12150 10.1038/s41598-023-39444-4 37500743 PMC10374570 162 Dai M Wu J Ji Z Chen P Yang C Luo J Construction of a metabolic-immune model for predicting the risk of diabetic nephropathy and study of gut microbiota J Diabetes Investig 2025 16 863–73 10.1111/jdi.14401 40029758 PMC12057383 163 Wang J Wei HJ Mao RF Chang X Gut microbiota modulating therapy for diabetes mellitus should be individualized World J Diabetes 2024 15 2152–6 10.4239/wjd.v15.i10.2152 39493555 PMC11525721 164 Ma Y Xie H Xu N Li M Wang L Ge H Large yellow tea polysaccharide alleviates HFD-induced intestinal homeostasis dysbiosis via modulating gut barrier integrity, immune responses, and the gut microbiome J Agric Food Chem 2024 72 7230–43 10.1021/acs.jafc.4c00616 38494694 ",
  "metadata": {
    "Title of this paper": "Large yellow tea polysaccharide alleviates HFD-induced intestinal homeostasis dysbiosis via modulating gut barrier integrity, immune responses, and the gut microbiome",
    "Journal it was published in:": "Frontiers in Endocrinology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488459/"
  }
}