{
  "title": "Paper_1027",
  "abstract": "pmc MedComm (2020) MedComm (2020) 4101 mcomm MCO2 MedComm 2688-2663 Wiley PMC12475974 PMC12475974.1 12475974 12475974 41020041 10.1002/mco2.70411 MCO270411 1 Original Article Original Article Cholesterol 25‐Hydroxylase Enhances Myeloid‐Derived Suppressor Cell (MDSC) Immunosuppression via the Stimulator of Interferon Genes (STING)‐Tank‐Binding Kinase 1 (TBK1)‐Receptor‐Interacting Protein Kinase 3 (RIPK3) Pathway in Colorectal Cancer Zhou Dongqin  1 Chen Yu  2 Liu Xudong  3 He Juan  3 Shen Luyao  4 He Yongpeng  5 Zhang Jiangang  2 Zhou Yu  2 Zhang Nan  3 Xu Yanquan  6 Lei Juan  2 Ren Ran  3 Zhao Huakan  2 hk_zhao@cqu.edu.cn Zeng Xianghua  2 zengxh0803@163.com Li Yongsheng https://orcid.org/0000-0003-2175-9449  1  2 lys@cqu.edu.cn   1 The Second Affiliated Hospital and Yuying Children's Hospital of Wenzhou Medical University Wenzhou Zhejiang China   2 Department of Medical Oncology Chongqing University Cancer Hospital Chongqing China   3 School of Medicine Chongqing University Cancer Hospital, Chongqing University Chongqing China   4 Department of Clinical Laboratory Air Force Medical Center Beijing China   5 Chongqing Key Laboratory of Translational Research for Cancer Metastasis and Individualized Treatment Chongqing University Cancer Hospital & Chongqing Cancer Institute & Chongqing Cancer Hospital Chongqing China   6 Clinical Medicine Research Center Xinqiao Hospital, Army Medical University Chongqing China 27 9 2025 10 2025 6 10 496875 10.1002/mco2.v6.10 e70411 31 8 2025 12 1 2025 01 9 2025 27 09 2025 28 09 2025 29 09 2025 © 2025 The Author(s). MedComm https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Myeloid‐derived suppressor cells (MDSCs) represent a significant immunosuppressive population within the tumor microenvironment of colorectal cancer (CRC). Their activity has been strongly associated with the reprogramming of cholesterol metabolism, although the underlying mechanisms remain unclear. To investigate this, we generated myeloid‐specific cholesterol 25‐hydroxylase (CH25H) knockdown mice and differentiated bone marrow cells from wild‐type (WT) or Ch25h f/f Cre A schematic diagram outlines the mechanism by which CH25H enhances the immunosuppressive function of CRC‐infiltrating MDSCs. CH25H in MDSCs inhibits the phosphorylation activation of STING and its downstream effectors, TBK1 and RIPK3, within the endoplasmic reticulum, mediated by its metabolite, 25HC. This inhibition leads to increased expression of ARG1 in MDSCs, thereby enhancing their immunosuppressive activity and facilitating immune evasion in CRC tumor microenviroment. Conversely, a specific deficiency of CH25H disrupts this cascade of changes, resulting in decreased ARG1 expression and diminished immune function of MDSCs. cholesterol metabolism cholesterol 25‐hydroxylase colorectal cancer myeloid‐derived suppressor cells stimulator of interferon genes tumor immunosuppression 25‐hydroxycholesterol Chongqing Natural Science Foundation Innovation and Development Joint Fund Project CSTB2025NSCQ‐LZX0004 Science and Technology Innovation Key R&D Program of Chongqing CSTB2025TIAD‐STX0046 Funding for Chongqing Young and Middle‐Aged Medical Excellence Team Chongqing University Cancer Hospital Research Capacity Enhancement Project Y2024003 Natural Science Foundation of Chongqing Municipality 10.13039/501100005230 cstc2021jcyj‐msxmX0463 National Outstanding Youth Reserve Talent Training Project HBRC202406 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:27.09.2025  D. Zhou Y. Chen X. Liu Cholesterol 25‐Hydroxylase Enhances Myeloid‐Derived Suppressor Cell (MDSC) Immunosuppression via the Stimulator of Interferon Genes (STING)‐Tank‐Binding Kinase 1 (TBK1)‐Receptor‐Interacting Protein Kinase 3 (RIPK3) Pathway in Colorectal Cancer MedComm 6 10 2025 e70411 10.1002/mco2.70411 Dongqin Zhou and Yu Chen contributed equally to this work.  Funding 1 Introduction Colorectal cancer (CRC) is among the most prevalent malignant tumors of the human digestive system. Immunotherapy targeting programmed cell death‐1 (PD‐1) and its ligand programmed cell death ligand‐1 (PD‐L1) has significantly improved survival rates in various cancer types. However, PD‐1 monotherapy exhibits limited efficacy in the majority of CRC patients with microsatellite stability (MSS) or proficient mismatch repair (pMMR), and is therefore not recommended for metastatic CRC [ 1 Immunosuppression plays a critical role in the initiation and progression of tumors, enhancing tolerance to immunotherapy directed against these malignancies [ 2 3 4 5 4 6 7 8 9 10 11 In recent years, key regulators of MDSCs activation have been identified, including proinflammatory factors such as interferon‐gamma (IFN‐γ), interleukin (IL)‐1β, IL‐4, IL‐13, and prostaglandin E 2 2 12 10 11 13 14 15 16 Our previous research indicates a positive correlation between CH25H and 25HC regarding the immunosuppressive properties of MDSCs [ 10 2 Results 2.1 CH25H Is Upregulated in CRC‐Associated MDSCs We analyzed multiple cohorts of CRC patients data from the gene expression omnibus (GEO) database, employing risk‐prognostic modeling and immune infiltration analysis based on immune cell biomarkers. Our findings indicated that both high expression levels of CH25H and a high percentage of MDSCs infiltration were significantly associated with poor prognosis (Figure 1A 1B 16 1C S1A 17 18 19 1D + − 1E FIGURE 1 The abundance of CH25H is increased in tumor‐infiltrated MDSCs. (A, B) The CH25H and MDSC risk‐prognostic models were assessed using four independent datasets sourced from the GEO database: GSE39582 GSE17538 GSE87211 GSE94104 n n n s.c n s.c n n s.c n p p p Subsequently, we conducted further testing and validation using murine models. We utilized two CRC cell lines, MC38 and CT26, to establish subcutaneous tumor models in C57BL/6 wild‐type (WT) male mice and Balb/C WT male mice, respectively. The mice were euthanized when the tumor volume reached 1000–1500 mm 3 + + 1F,G 1B 1C S1D 1H 1I 2.2 CH25H‐Derived 25HC Enhances MDSC‐Mediated Immunosuppression To investigate the role of CH25H upregulation in tumor‐associated MDSCs during the disease procession, we assessed the levels of 25HC in BM‐MDSCs from mice subcutaneously implanted with MC38 tumors compared to unloaded controls using ultra performance liquid chromatography mass spectrometry (UPLC–MS/MS; Figure 2A 2B S2A 2C S2B–D 2D Arg1 2E S2E FIGURE 2 The immunosuppressive function of tumor‐associated MDSCs is regulated by CH25H metabolism of cholesterol, leading to the generation of 25HC. (A) Principal component analysis (PCA) of BM‐MDSCs in subcutaneously (s.c.) MC38‐loaded and tumor‐free mice ( n n n n + n + n p p p TAMs exert their effects by facilitating cholesterol efflux and enhancing macrophage immunosuppression. The deletion of genes encoding ATP‐binding cassette (ABC) transporter proteins, which mediate cholesterol efflux (such as ABCA1 and ABCG1), has been shown to reverse the tumor‐promoting functions of TAMs and slow tumor progression [ 20 Abca1 S2E + 6 7 21 + + 2F,G S2F 2.3 Reversal of MDSC Immunosuppression by 25HC in CH25H‐Deficient Mice To comprehensively investigate the role of CH25H in CRC‐associated MDSCs, we successfully generated conditioned Ch25h Cre/LoxP 3A S3A Ch25h f/f S3B 3B S3C Ch25h f/f Ch25h 3B,D 3D 3C,E Ch25h f/f Cre(±) + Ch25h f/f + 3F,H 3G,I Ch25h FIGURE 3 The myeloid deletion of CH25H reduces the immunosuppressive effects of MDSCs, an effect that can be reversed by the addition of 25HC. (A) A graphical representation illustrating the establishment of a myeloid CH25H‐deficient mouse model. (B) The protein level of ARG1 was measured after in vitro treatment of Ch25h f/f Cre(±) Ch25h f/f n Ch25h f/f Cre(±) Ch25h f/f n Ch25h f/f Cre(±) Ch25h f/f n Ch25h f/f Cre(±) Ch25h f/f n + Ch25h f/f Cre(±) Ch25h f/f + n Ch25h f/f Cre(±) Ch25h f/f + + n Ch25h f/f Cre(±) Ch25h f/f + n Ch25h f/f Cre(±) + n p p p 2.4 Inhibition of the cGAS–STING Pathway Enhances Immunomodulation by 25HC‐Activated MDSCs To elucidate the mechanisms by which CH25H‐derived 25HC accumulation enhance the immunosuppressive capacity of tumor‐infiltriting MDSCs, we conducted RNA transcriptome sequencing on BM‐derived MDSCs (BM‐MDSCs) that were exogenously supplied with 25HC, alongside a control group. Additionally, we performed RNA sequencing (RNA‐seq) on BM‐MDSCs derived from Ch25h f/f Cre Ch25h f/f Fads2 22 Ldlr 23 24 Srebf2 25 Insig1 26 4A 27 28 4B 4C Ch25h f/f Cre(±) 4D 4D FIGURE 4 Regulation of MDSCs by 25HC is dependent on the cGAS–STING pathway. (A) Venn plot analysis of RNA transcript sequencing results of WT MDSCs treated with 25HC, either alone or in combination with MC38‐TCM, as well as Ch25h f/f Cre(±) Ch25h f/f https://www.gsea‐msigdb.org/gsea/msigdb Ch25h f/f Ch25h f/f Cre(±) Ch25h f/f Tmem173 Tmem173 Tmem173 + p p p Based on the aforementioned findings, we utilized C176, a potent and selective STING inhibitor [ 29 30 Ch25h f/f Cre(±) 4E Tmem173 4F,G Tmem173 Tmem173 4H Tmem173 4I + + Ch25h f/f Cre(±) S4A,B 2.5 CH25H Enhances ARG1 Expression by Suppressing TBK1–RIPK3 Signaling in MDSCs Previous studies have elucidated that STING, an ER membrane protein, translocates to the Golgi apparatus from the ER to activate tank‐binding kinase 1 (TBK1) upon receiving 2′,3′‐cyclic‐GMP‐AMP (cGAMP) signals [ 31 5A Ch25h f/f Cre(±) Ch25h f/f 5B,C 5B,C Tmem173 5D Tmem173 Tmem173 5E 5F Ch25h f/f Cre(±) 5G FIGURE 5 CH25H deletion inhibits ARG1 expression by activating the TBK1–RIPK3 complex. (A) WB analysis shows the phosphorylation levels and total protein levels of TBK1 and RIPK3 in WT MDSCs treated with 25HC (using DMSO as the control condition). (B) The activation levels of TBK1 and RIPK3 phosphorylation, as well as their total levels, are assessed following CH25H‐specific knockdown and subsequent treatment with 25HC in MDSCs from both the mock group and the MC38‐TCM treatment group (using Ch25h f/f Ch25h f/f Tmem173 Tmem173 Ch25h f/f Cre(±) Ch25h f/f Ch25h f/f Cre(±) Ch25h f/f Ch25h f/f Cre(±) Ch25h f/f n + Ch25h f/f n + Ch25h f/f n p p p TBK1 is expressed across all tissues and functions as a nonclassical IκB kinase (IKK) [ 32 S5A,B 9 10 33 5A Ch25h f/f Cre(±) Ch25h f/f 5B,C Tmem173 5D,E Ch25h f/f Cre(±) Ch25h f/f 5H To investigate whether CH25H‐enhanced ARG1 expression was dependent on the inhibition of RIPK3, we treated Ch25h f/f Cre(±) 9 10 Ch25h f/f Cre(±) 5I + 5J,K In conclusion, the data suggest that the absence of CH25H in MDSCs activates the STING pathway and suppresses ARG1 expression by facilitating the formation of the TBK1–RIPK3 complex. CH25H‐derived 25HC is implicated in the pathogenesis of CRC by inhibiting the STING–TBK1–RIPK3 signaling axis and promoting the expression of the immunosuppressive molecule ARG1, which enhances the immunosuppressive effects of CRC‐associated MDSCs. 2.6 25HC Promotes Tumor Progression by Enhancing the Immunoregulatory Activity of MDSCs To further elucidate the pivotal role of CH25H‐derived 25HC in the context of CRC‐associated MDSCs, we developed an MC38‐loaded tumor model in WT mice. We administered 25HC alongside the MDSC inhibitor SB225002, a potent and selective C–X–C motif chemokine receptor 2 (CXCR2) antagonist that diminishes MDSC chemotaxis by inhibiting their accumulation [ 9 6A,B 6C + + 6D + 6E FIGURE 6 Functional reprogramming of tumor‐associated MDSCs by 25HC. (A) and (B) Physical images of tumors, along with dynamic growth curves and mass measurements in subcutaneously implanted MC38‐loaded mice following injection of 25HC, both combined and uncombined with SB225002 ( n + n + + n p p p 2.7 Administration of 25HC or C176 Reverses CH25H Myeloid‐Specific Knockdown Effects on Tumor Progression We next conducted a series of in vivo validation experiments utilizing CH25H myeloid‐specific knockdown mice. Specifically, 6–8‐week‐old male Ch25h f/f Cre(±) f/f Ch25h f/f Ch25h f/f Cre(±) Ch25h f/f 7A–C Ch25h f/f Cre(±) Ch25h f/f 7D + Ch25h f/f Cre(±) f/f 7E,F 6A–E Ch25h f/f FIGURE 7 CH25H‐deficient MDSCs can reverse their antitumor effects following stimulation with 25HC and C176. Panels A–F present physical images of solid tumor volume (A), tumor dynamic growth curves (B), and mass (C), as well as ARG1 expression in tumor MDSCs (D), the percentage of CD8 + + + + + Ch25h f/f Cre(±) n + + + + + Ch25h f/f Cre(±) n p p p We also administered C176 to tumor‐bearing CH25H myeloid‐specific knockdown mice, which were randomly assigned to groups in accordance with our previous protocols. Consistent with the in vivo results observed following 25HC injection, tumor growth in Ch25h f/f + + + + Ch25h f/f Cre(±) + + + + 7G–L In the past 3 years, we collected surgical frozen tumor tissue samples from patients with CRC at various stages of clinical progression and performed serial sectioning. Analysis of CH25H and ARG1 IF staining on these serial sections revealed a significant increase in the infiltration of MDSCs within CRC tumor tissues as tumor progression advanced (Figure S5A,B S5A S5B 3 Discussion In this study, we observed that both CH25H and its downstream metabolite 25HC were upregulated in tumor‐associated MDSCs, which in turn suppressed the cGAS–STING pathway. This suppression led to the downregulation of the inhibitory effects of the downstream TBK1–RIPK3 complex on ARG1, thus enhanced the immunosuppressive function of MDSCs, facilitating immune escape in CRC. Conversely, the specific deletion of CH25H in MDSCs resulted in a significant loss of immunosuppressive function and markedly enhanced CD8 + CRC is a malignant tumor characterized by high morbidity and mortality rates worldwide, representing a significant threat to public health due to the considerable challenges associated with its treatment, particularly in the metastatic stage. Recent advancements in the use of immune checkpoint inhibitors (ICIs), such as PD‐1/PD‐L1 antibodies, have generated considerable interest in their application for CRC, following their successful use in various tumors, including non—small‐cell lung cancer [ 34 35 36 37 38 36 39 40 41 37 42 43 37 44 45 43 CH25H is a conserved IFN‐stimulated gene (ISG) situated on the ER. It plays a crucial role in regulating immune cell function and lipid metabolism by catalyzing the oxidation of cholesterol into 25HC [ 46 47 48 46 49 50 51 CH25H is prominently expressed in various immune cells, including T‐lymphocytes, macrophages, and dendritic cells (DCs), under physiological conditions, where it plays distinct roles in tumor immunity [ 52 53 16 16 + 54 Two distinct types of cGAS–STING signaling pathways have been identified: the classical and nonclassical pathways [ 55 56 57 58 59 60 12 61 Recent research indicates that the accumulation of 25HC enhances the binding of 3‐hydroxy‐3‐methylglutaryl coenzyme A reductase (HMGCR) to insig proteins located on the ER. This interaction can activate and initiate the endoplasmic reticulum‐associated degradation (ERAD) mechanism, thereby contributing to the ubiquitin‐mediated degradation of HMGCR [ 62 63 Fads2 Ldlr Srebf2 Insig1 Nevertheless, this study has several limitations. Notably, Ch25h f/f Cre(±) Ch25h f/f Cre Ch25h f/f Cre(±) Ch25h f/f Cre In conclusion, we have thoroughly examined the regulatory effects and mechanisms of CH25H on the function of CRC‐associated MDSCs. Our findings indicate that CH25H and its metabolite, 25HC, which are elevated in tumor‐infiltrating MDSCs, upregulate the expression of ARG1 and enhance immunosuppressive activity by inhibiting the STING–TBK1–RIPK3 signaling axis. This research provides a promising new strategy for further investigations into the reprogramming of cholesterol metabolism in tumor‐infiltrating MDSCs and its role in modulating tumor immune invasion. Additionally, this work enriches our understanding of the regulatory pathways involved in cholesterol metabolic reprogramming and identifies CH25H as a potential new target for improving the efficacy of immunotherapy in clinical CRC patients. 4 Materials and Methods 4.1 Patient Samples Peripheral blood samples were collected from eight patients diagnosed with CRC and five healthy controls at the Chongqing University Cancer Hospital. Blood samples were drawn in the morning, around 8:00 a.m., after a minimum fasting period of 8 h. Subsequently, the fresh blood samples underwent a process for isolating human peripheral blood mononuclear cells (PBMCs). Following gradient centrifugation, the myeloid cells in the middle layer were extracted and analyzed through flow cytometry to assess the levels of target molecules in the MDSCs present in the blood samples. The CD11b + − 4.2 Mice Male WT C57BL/6J mice, aged 4–8 weeks, were sourced from Vital River (Beijing, China). The Ch25h floxp/floxp Ch25h f/f Ch25h Ch25h f/f Cre Cre Ch25h f/f Ch25h f/− Cre Ch25h f/f Ch25h f/f Cre Ch25h f/f Cre Ch25h f/f Cre(±) Following the outlined procedures, genotyping was conducted by excising a small piece of ear or tail tissue from the mice, followed by genomic deoxyribonucleic acid (DNA) extraction using the Rapid DNA Extraction Detection Kit (TIANcombi DNA Lyse&Det PCR Kit, Catalogue No. KG203). The target gene was subsequently amplified through PCR employing specific primers tailored for the target gene. The PCR reaction was executed in a total volume of 20 µL, which included 2 µL of template DNA, 1 µL of each 10 µM forward and reverse primers, 10 µL of 2 × Taq polymerase, and an appropriate volume of 1 × sterile double‐distilled water. After amplification, agarose gel electrophoresis was performed using a 1% agarose gel containing 10% SuperRed/GelRed nucleic acid dye (Biosharp, Catalogue No. BS354A). A DNA ladder served as a size reference to confirm the presence and size of the amplified target gene. 4.3 Cell Culture The mouse colon adenocarcinoma cell line, designated as MC38 (Catalogue No. 1101MOU‐PUMC000523), was obtained from the National Infrastructure for Cell Line Resources (NICR). Additionally, the mouse CRC cell line CT26 (Catalogue No. ATCC CRL‐2638) was sourced from the American Type Culture Collection (ATCC), while the mouse Lewis lung carcinoma cell line (LLC, Catalogue No. GDC0670) and the mouse melanoma cell line (B16‐F10, Catalogue No. GDC0677) were obtained from the China Center for Type Culture Collection (CCTCC). All cell lines were cultured in Dulbecco's modified Eagle medium (DMEM; Gibco), supplemented with 1 mL of fetal bovine serum (FBS; Gibco) and 100 µL of penicillin–streptomycin (Beyotime, Catalogue No. C0222), resulting in a total volume of 10 mL of complete medium. The cultures were maintained at 37°C in a humidified incubator with 5% CO 2 4.4 Animal Models Prior to injection into mice, MC38, CT26, LLC, and B16‐F10 cell lines were digested with trypsin (Beyotime, Catalogue No. C0201) to detach single cells. The cells were then washed twice with phosphate buffered saline (PBS) and resuspended. A total of 5 × 10 5 6 2 3 3 4.5 MDSC Induction in vitro MDSCs were isolated and induced as previously described [ 10 Following this, we utilized an antimouse MDSC isolation kit (CD11b + + 4.6 CD8 + Initially, the spleens of C57BL/6 mice were homogenized to create single‐cell suspensions. Subsequently, CD8 + + 10 11 For functional assays, MDSCs were cocultured with anti‐CD3 (3 µg/mL, BioLegend, Catalogue No. 100238) and anti‐CD28 (3 µg/mL, BioLegend, Catalogue No. 102116) activated enriched CD8 + + + + 4.7 RNA‐Seq Profiling, qPCR Total RNA was extracted using the Eastep Super Total RNA Extraction Kit (Promega, Catalogue No. LS1040). Subsequently, RNA reverse transcription was performed by preparing a 20 µL reverse transcription reaction system utilizing the PrimeScript RT kit (Takara, Catalogue No. RR037Q). Real‐time fluorescence quantitative PCR was conducted with the synergetic binding reagent (SYBR) qPCR Master Mix (Takara, Catalogue No. RR820Q), with the mouse Actin primer serving as the reference gene. The efficiencies of all qPCR assays adhered to the Minimum Information for Publication of Quantitative Real‐Time PCR Experiments (MIQE) guidelines. For RNA‐seq analysis, a total of 3 µg of RNA per sample was utilized as the input material for RNA sample preparation. The resulting products were purified and quantified using a Bioanalyzer 2100 system (Agilent, Palo Alto, CA, USA) with Agilent High Sensitivity DNA Analysis. Finally, the libraries were sequenced on the NovaSeq 6000 platform (Illumina Inc., San Diego, CA, USA). 4.8 Western Blot Cytoplasmic protein lysates were prepared using a radioimmunoprecipitation assay (RIPA) lysis buffer that contained phenylmethylsulfonyl fluoride (PMSF; Beyotime, Catalogue No. ST506) and a phosphatase inhibitor (MCE, Catalogue No. HY‐K0021). Following protein quantification with the bicinchoninic acid (BCA) Protein Assay Kit (Beyotime, Catalogue No. P0012), the samples were separated by electrophoresis on 4%–12% Bis–Tris polyacrylamide gel electrophoresis (PAGE) and subsequently transferred to polyvinylidene fluoride (PVDF) membranes for further analysis. The membranes were blocked with 5% skimmed milk in triple buffered saline with Tween‐20 (TBST) for 2 h at room temperature, washed three times with TBST, and then incubated overnight at 4°C with a specific primary antibody solution at the appropriate concentration. Afterward, the membranes were incubated with a suitable IgG‐horseradish peroxidase (HRP)‐labeled secondary antibody (1:5000, Beyotime) in TBST for 1 h at room temperature. Antigens were visualized using chemiluminescence with Pierce Enhanced Chemiluminescence (ECL) West (Invitrogen, Catalogue No. A45917), and membrane‐bound immunocomplexes were detected using the ChemiDoc imaging system (Bio‐Rad). In our Western blot data, we calculated and normalized the ratios of target proteins to internal references in an Excel table, after analyzing the grayscale values of all protein bands using ImageJ software, based on consistent assay parameters. The first protein expression value from each group of bands was designated as a standard value of 1.00, with subsequent data representing the relative expression of the target proteins in the experimental group compared to the control group. The analyzed data are presented directly below the corresponding bands of the target molecules in the figure. 4.9 Flow Cytometry Single‐cell suspensions of tissues were prepared through mechanical dispersion using the Meltenyi Biotec Gentle Magnetic‐activated Cell Sorting (MACS) Octo 8 and subsequent enzymatic digestion. For surface staining, cells were labeled with the appropriate antibodies (refer to the Supporting Information Table for various antibody staining protocols) for 30 min at 4°C in Ca 2+ 2+ 4.10 Immunohistochemistry The immunohistochemistry (IHC) protocols were performed in accordance with the previously established methodology [ 9 4.11 Cholesterol and 25HC Content Measurement by UPLC–MS/MS MDSCs from Ch25h f/f Ch25h f/f Cre(±) 9 10 4.12 Coimmunoprecipitation The prepared cells were harvested for cellular proteins using Nonidet P 40 (NP40)/immunoprecipitation (IP) lysis buffer (Beyotime, Catalogue No. P0013F), which contained a protease inhibitor mixture with PMSF added at a ratio of 100:1. Whole cell lysates were then mixed with primary antibodies or normal mouse IgG and incubated overnight at 4°C on an overturned shaker. Following this incubation, preactivated magnetic beads were added to the mixture, which continued to be shaken overnight at 4°C. The samples were subsequently washed three to four times with PBS with Tween‐20 (PBST) wash buffer. Finally, the samples were eluted into an SDS sampling buffer and analyzed by protein blotting. 4.13 IF For paraffin section samples: the dewaxed and antigenically repaired paraffin sections were placed in a microwave oven and treated with an ethylenediaminetetraacetic acid (EDTA) antigen repair solution. After natural cooling, the sections were transferred to PBS and subjected to decolorization on a shaker, being washed three times for 5 min each. The sections were then incubated in an osmotic buffer for 40 min. Following a 2‐h blocking period, the sections were incubated overnight at 4°C with the primary antibodies: CD33 (1:50, Santa Cruz, Catalogue No. sc‐19960) and CH25H (1:50, Bioss, Catalogue No. bs‐41322R). After three washes with PBS, the sections were incubated with a secondary antibody conjugated to a fluorescent dye (1:500). Finally, the sections were stained with 4′,6‐diamidino‐2′‐phenylindole (DAPI; Cell Signaling Technology, Catalogue No. 4083S) antifade reagent and visualized using a Leica fluorescence confocal microscope. For frozen section samples: the tissues were washed in PBS for 30 min at room temperature and then fixed in 4% paraformaldehyde for 15 min. Following fixation, the tissues were washed several times with PBS, with each wash lasting 5 min. A circle was drawn around the tissue, after which a sealing solution was applied and allowed to set for 2 h at room temperature. After aspiration, CD33 primary antibody (1:500, 100 µL) was added and incubated at 37°C for 2 h, followed by three washes. The samples were then processed with a permeabilizer for 40 min and washed again. The CH25H or ARG1 (Cell Signaling Technology, Catalogue No. 93668S) primary antibody (1:200, 100 µL) was added, incubated overnight at 4°C, and washed three times after rewarming at room temperature for 30 min the following day. A secondary antibody (1:800, 200 µL) was added and incubated for 2 h at room temperature, followed by five washes. Finally, DAPI staining was performed, followed by five washes, coating with an antifluorescence quencher, and sealing. The samples were visualized using a Leica fluorescence confocal microscope. 4.14 ELISA The ELISA kits used for the detection of IFN‐β (Shfksc, Catalogue No. F2124‐B) and CCL5 (Shfksc, Catalogue No. F30511 4.15 Gene Set Enrichment Analysis (ssGSEA) The CH25H and MDSC risk‐prognostic models were evaluated using four independent datasets from the GEO ( https://www.ncbi.nlm.nih.gov/geo/ GSE39582 GSE17538 GSE87211 GSE94104 4.16 Statistical Analysis The statistical analysis was performed using GraphPad Prism version 9.0 (GraphPad Software, San Diego, CA, USA). Experimental data are presented as mean ± standard error of the mean (SEM) values. A Shapiro–Wilk test was initially conducted to evaluate the normality of the data. Data were deemed normally distributed if the p t p p p p p Author Contributions  Dongqin Zhou Yu Chen Xudong Liu Juan He Luyao Shen Yongpeng He Jiangang Zhang Yu Zhou and Nan Zhang Yanquan Xu Juan Lei and Ran Ren Huakan Zhao Xianghua Zeng Yongsheng Li Ethics Statement This collection adhered to the ethical guidelines outlined in the Declaration of Helsinki and received approval from the Institutional Review Board of Chongqing University Cancer Hospital (CZLS2022255‐A‐34). Written informed consent was obtained from all participants, including both patients and healthy individuals. All animal experimental protocols strictly complied with the National Institutes of Health guidelines for animal care and were approved by the Institutional Animal Care and Use Committee of Chongqing University Cancer Hospital, under the designated animal ethics number (CZLS2022255‐A‐34). Notably, both the animal experiments and the clinical study were approved under the same ethics approval number in the application year. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Supporting Figure 1 n n n p p p  Supporting Figure 2 n Nos2 Cd274 Abca1 n + n p p p  Supporting Figure 3 Ch25h f/f Cre Ch25h f/f Cre(±) Ch25h f/f n Ch25h f/f Cre(±) Ch25h f/f p p p  Supporting Figure 4 Ccl5 Ifnb Ch25h f/f Cre(±) Ch25h f/f n Ch25h f/f Cre(±) Ch25h f/f n p p p  Supporting Figure 5 https://cn.string‐db.org/cgi/network?taskId  Supporting Figure 6 n n p p p  Supporting Table 1  Supporting Table 2 Acknowledgments We sincerely thank all the staff members of the Laboratory Management Platform at Chongqing University Cancer Hospital for their invaluable support, as well as everyone who contributed to this study. The figures presented in this manuscript were created using BioRender.com. Data Availability Statement All data necessary to evaluate the conclusions presented in this paper are included within the main text and/or the Supporting Information. For RNA sequencing data, please access the website associated with the accession number GSE284266 at https://www.ncbi.nlm.nih.gov/bioproject References 1 B. H. O'Neil J. M. Wallmark D. Lorente Safety and Antitumor Activity of the Anti‐PD‐1 Antibody Pembrolizumab in Patients With Advanced Colorectal Carcinoma PLoS ONE 12 12 2017 e0189848 29284010 10.1371/journal.pone.0189848 PMC5746232 2 H. Zhao L. Wu G. Yan Inflammation and Tumor Progression: Signaling Pathways and Targeted Intervention Signal Transduction and Targeted Therapy 6 1 2021 263 34248142 10.1038/s41392-021-00658-5 PMC8273155 3 I. Sieminska J. Baran Myeloid‐Derived Suppressor Cells in Colorectal Cancer Frontiers in Immunology 11 2020 1526 32849517 10.3389/fimmu.2020.01526 PMC7426395 4 S. He L. Zheng C. Qi Myeloid‐Derived Suppressor Cells (MDSCs) in the Tumor Microenvironment and Their Targeting in Cancer Therapy Molecular Cancer 24 1 2025 5 39780248 10.1186/s12943-024-02208-3 PMC11707952 5 D. I. Gabrilovich Myeloid‐Derived Suppressor Cells Cancer Immunology Research 5 1 2017 3 8 28052991 10.1158/2326-6066.CIR-16-0297 PMC5426480 6 F. Veglia E. Sanseviero D. I. Gabrilovich Myeloid‐Derived Suppressor Cells in the Era of Increasing Myeloid Cell Diversity Nature Reviews Immunology 21 8 2021 485 498 10.1038/s41577-020-00490-y PMC7849958 33526920 7 L. van Vlerken‐Ysla Y. Y. Tyurina V. E. Kagan D. I. Gabrilovich Functional States of Myeloid Cells in Cancer Cancer Cell 41 3 2023 490 504 36868224 10.1016/j.ccell.2023.02.009 PMC10023509 8 J. Yu X. Chen S. Zhao J. Jing Q. Wang Y. Dang HOXC10 Promotes Metastasis in Colorectal Cancer by Recruiting Myeloid‐Derived Suppressor Cells Journal of Cancer 13 12 2022 3308 3317 36186898 10.7150/jca.76945 PMC9516010 9 G. Yan H. Zhao Q. Zhang A RIPK3‐PGE2 Circuit Mediates Myeloid‐Derived Suppressor Cell‐Potentiated Colorectal Carcinogenesis Cancer Research 78 19 2018 5586 5599 30012671 10.1158/0008-5472.CAN-17-3962 10 Y. Chen Y. Xu H. Zhao Myeloid‐Derived Suppressor Cells Deficient in Cholesterol Biosynthesis Promote Tumor Immune Evasion Cancer Letters 564 2023 216208 37150500 10.1016/j.canlet.2023.216208 11 L. Wu X. Liu J. Lei Fibrinogen‐Like Protein 2 Promotes Tumor Immune Suppression by Regulating Cholesterol Metabolism in Myeloid‐Derived Suppressor Cells Journal for ImmunoTherapy of Cancer 11 12 2023 e008081 38056898 10.1136/jitc-2023-008081 PMC10711877 12 Y. Wu M. Yi M. Niu Q. Mei K. Wu Myeloid‐Derived Suppressor Cells: An Emerging Target for Anticancer Immunotherapy Molecular Cancer 21 1 2022 184 36163047 10.1186/s12943-022-01657-y PMC9513992 13 J. Luo H. Yang B.‐L. Song Mechanisms and Regulation of Cholesterol Homeostasis Nature Reviews Molecular Cell Biology 21 4 2020 225 245 31848472 10.1038/s41580-019-0190-7 14 Y. Duan K. Gong S. Xu F. Zhang X. Meng J. Han Regulation of Cholesterol Homeostasis in Health and Diseases: From Mechanisms to Targeted Therapeutics Signal Transduction and Targeted Therapy 7 1 2022 265 35918332 10.1038/s41392-022-01125-5 PMC9344793 15 J. G. Cyster E. V. Dang A. Reboldi T. Yi 25‐Hydroxycholesterols in Innate and Adaptive Immunity Nature Reviews Immunology 14 11 2014 731 743 10.1038/nri3755 25324126 16 J. Xiao S. Wang L. Chen 25‐Hydroxycholesterol Regulates Lysosome AMP Kinase Activation and Metabolic Reprogramming to Educate Immunosuppressive Macrophages Immunity 57 5 2024 1087 1104 38640930 10.1016/j.immuni.2024.03.021 17 M. K. Gleason J. A. Ross E. D. Warlick CD16xCD33 Bispecific Killer Cell Engager (BiKE) Activates NK Cells Against Primary MDS and MDSC CD33+ Targets Blood 123 19 2014 3016 3026 24652987 10.1182/blood-2013-10-533398 PMC4014844 18 L. Zhou K. Miao B. Yin Cardioprotective Role of Myeloid‐Derived Suppressor Cells in Heart Failure Circulation 138 2 2018 181 197 29437117 10.1161/CIRCULATIONAHA.117.030811 19 C. Perez C. Botta A. Zabaleta Immunogenomic Identification and Characterization of Granulocytic Myeloid‐Derived Suppressor Cells in Multiple Myeloma Blood 136 2 2020 199 209 32325491 10.1182/blood.2019004537 20 P. Goossens J. Rodriguez‐Vita A. Etzerodt Membrane Cholesterol Efflux Drives Tumor‐Associated Macrophage Reprogramming and Tumor Progression Cell Metabolism 29 6 2019 1376 1389 30930171 10.1016/j.cmet.2019.02.016 21 J. E. Talmadge D. I. Gabrilovich History of Myeloid‐Derived Suppressor Cells Nature Reviews Cancer 13 10 2013 739 752 24060865 10.1038/nrc3581 PMC4358792 22 S. Dadsena R. Cuevas Arenas G. Vieira S. Brodesser M. N. Melo A. J. García‐Sáez Lipid Unsaturation Promotes BAX and BAK Pore Activity During Apoptosis Nature Communications 15 1 2024 4700 10.1038/s41467-024-49067-6 PMC11148036 38830851 23 E. S. Gan H. C. Tan D. H. T. Le Dengue Virus Induces PCSK9 Expression to Alter Antiviral Responses and Disease Outcomes Journal of Clinical Investigation 130 10 2020 5223 5234 32644974 10.1172/JCI137536 PMC7524462 24 C. An F. Sun C. Liu IQGAP1 promotes Mitochondrial Damage and Activation of the mtDNA Sensor cGAS‐STING Pathway to Induce Endothelial Cell Pyroptosis Leading to Atherosclerosis International Immunopharmacology 123 2023 110795 37597406 10.1016/j.intimp.2023.110795 25 T.‐T. Chu X. Tu K. Yang J. Wu J. J. Repa N. Yan Tonic Prime‐Boost of STING Signalling Mediates Niemann‐Pick Disease Type C Nature 596 7873 2021 570 575 34290407 10.1038/s41586-021-03762-2 PMC8859990 26 Q. Wang X. Liu Y. Cui The E3 Ubiquitin Ligase AMFR and INSIG1 Bridge the Activation of TBK1 Kinase by Modifying the Adaptor STING Immunity 41 6 2014 919 933 25526307 10.1016/j.immuni.2014.11.011 27 F. Lin X. Yao C. Kong 25‐Hydroxycholesterol Protecting From Cerebral Ischemia‐Reperfusion Injury Through the Inhibition of STING Activity Aging (Albany New York) 13 16 2021 20149 20163 10.18632/aging.203337 PMC8436919 34406977 28 D. Peng Z. Huang H. Yang Y. Luo Z. Wu PPM1G Regulates Hepatic Ischemia/Reperfusion Injury Through STING‐Mediated Inflammatory Pathways in Macrophages Immunity, Inflammation and Disease 12 2 2024 e1189 38372470 10.1002/iid3.1189 PMC10875902 29 M.‐G. Cho R. J. Kumar C.‐C. Lin MRE11 Liberates cGAS From Nucleosome Sequestration During Tumorigenesis Nature 625 7995 2024 585 592 38200309 10.1038/s41586-023-06889-6 PMC10794148 30 M. S. Woo C. Mayer L. Binkle‐Ladisch STING Orchestrates the Neuronal Inflammatory Stress Response in Multiple Sclerosis Cell 187 15 2024 4043 4060 38878778 10.1016/j.cell.2024.05.031 31 B. Zhao F. Du P. Xu A Conserved PLPLRT/SD Motif of STING Mediates the Recruitment and Activation of TBK1 Nature 569 7758 2019 718 722 31118511 10.1038/s41586-019-1228-x PMC6596994 32 J.‐F. Clément S. Meloche M. J. Servant The IKK‐Related Kinases: From Innate Immunity to Oncogenesis Cell Research 18 9 2008 889 899 19160540 10.1038/cr.2008.273 33 L. Pan L. Yang Z. Yi W. Zhang J. Gong TBK1 Participates in Glutaminolysis by Mediating the Phosphorylation of RIPK3 to Promote Endotoxin Tolerance Molecular Immunology 147 2022 101 114 35533409 10.1016/j.molimm.2022.04.009 34 R. S. Herbst G. Giaccone F. de Marinis Atezolizumab for First‐Line Treatment of PD‐L1‐Selected Patients With NSCLC New England Journal of Medicine 383 14 2020 1328 1339 32997907 10.1056/NEJMoa1917346 35 J. Larkin F. S. Hodi J. D. Wolchok Combined Nivolumab and Ipilimumab or Monotherapy in Untreated Melanoma New England Journal of Medicine 373 13 2015 1270 1271 10.1056/NEJMc1509660 26398076 36 D. T. Le J. N. Uram H. Wang PD‐1 Blockade in Tumors With Mismatch‐Repair Deficiency New England Journal of Medicine 372 26 2015 2509 2520 26028255 10.1056/NEJMoa1500596 PMC4481136 37 S. Takei Y. Tanaka Y.‐T. Lin Multiomic Molecular Characterization of the Response to Combination Immunotherapy in MSS/pMMR Metastatic Colorectal Cancer Journal for ImmunoTherapy of Cancer 12 2 2024 e008210 38336371 10.1136/jitc-2023-008210 PMC10860060 38 A. B. Benson A. P. Venook M. Adam Colon Cancer, Version 3.2024, NCCN Clinical Practice Guidelines in Oncology Journal of the National Comprehensive Cancer Network: JNCCN 22 2D 2024 e240029 38862008 10.6004/jnccn.2024.0029 39 T. André K.‐K. Shiu T. W. Kim Pembrolizumab in Microsatellite‐Instability‐High Advanced Colorectal Cancer New England Journal of Medicine 383 23 2020 2207 2218 33264544 10.1056/NEJMoa2017699 40 T. André E. Elez H.‐J. Lenz Nivolumab Plus Ipilimumab Versus Nivolumab in Microsatellite Instability‐High Metastatic Colorectal Cancer (CheckMate 8HW): A Randomised, Open‐Label, Phase 3 Trial Lancet 405 10476 2025 383 395 39874977 10.1016/S0140-6736(24)02848-4 41 M. J. Overman R. McDermott J. L. Leach Nivolumab in Patients With Metastatic DNA Mismatch Repair‐Deficient or Microsatellite Instability‐High Colorectal Cancer (CheckMate 142): An Open‐Label, Multicentre, Phase 2 Study Lancet Oncology 18 9 2017 1182 1191 28734759 10.1016/S1470-2045(17)30422-9 PMC6207072 42 D. R. Almquist D. H. Ahn T. S. Bekaii‐Saab The Role of Immune Checkpoint Inhibitors in Colorectal Adenocarcinoma Biodrugs 34 3 2020 349 362 32246441 10.1007/s40259-020-00420-3 43 D. Zou X. Xin Y. Xu H. Xu L. Huang T. Xu Improving the Efficacy of Immunotherapy for Colorectal Cancer: Targeting Tumor Microenvironment‐Associated Immunosuppressive Cells Heliyon 10 16 2024 e36446 39262952 10.1016/j.heliyon.2024.e36446 PMC11388603 44 P. Sharma B. A. Siddiqui S. Anandhan The Next Decade of Immune Checkpoint Therapy Cancer Discovery 11 4 2021 838 857 33811120 10.1158/2159-8290.CD-20-1680 45 M. Angelova P. Charoentong H. Hackl Characterization of the Immunophenotypes and Antigenomes of Colorectal Cancers Reveals Distinct Tumor Escape Mechanisms and Novel Targets for Immunotherapy Genome Biology 16 1 2015 64 25853550 10.1186/s13059-015-0620-6 PMC4377852 46 G. Zhong C. He S. Wang C. Lin M. Li Research Progress on the Mechanism of Cholesterol‐25‐Hydroxylase in Intestinal Immunity Frontiers in Immunology 14 2023 1241262 37720208 10.3389/fimmu.2023.1241262 PMC10500599 47 U. Diczfalusy K. E. Olofsson A.‐M. Carlsson Marked Upregulation of Cholesterol 25‐Hydroxylase Expression by Lipopolysaccharide Journal of Lipid Research 50 11 2009 2258 2264 19502589 10.1194/jlr.M900107-JLR200 PMC2759831 48 E. V. Dang J. G. McDonald D. W. Russell J. G. Cyster Oxysterol Restraint of Cholesterol Synthesis Prevents AIM2 Inflammasome Activation Cell 171 5 2017 1057 1071 29033131 10.1016/j.cell.2017.09.029 PMC5693620 49 F. A. de Freitas D. Levy C. O. Reichert E. Cunha‐Neto J. Kalil S. P. Bydlowski Effects of Oxysterols on Immune Cells and Related Diseases Cells 11 8 2022 1251 35455931 10.3390/cells11081251 PMC9031443 50 A. Canfrán‐Duque N. Rotllan X. Zhang Macrophage‐Derived 25‐Hydroxycholesterol Promotes Vascular Inflammation, Atherogenesis, and Lesion Remodeling Circulation 147 5 2023 388 408 36416142 10.1161/CIRCULATIONAHA.122.059062 PMC9892282 51 Z. Li M. Martin J. Zhang Krüppel‐Like Factor 4 Regulation of Cholesterol‐25‐Hydroxylase and Liver X Receptor Mitigates Atherosclerosis Susceptibility Circulation 136 14 2017 1315 1330 28794002 10.1161/CIRCULATIONAHA.117.027462 PMC5741092 52 C. Liu X. V. Yang J. Wu Oxysterols Direct B‐Cell Migration Through EBI2 Nature 475 7357 2011 519 523 21796211 10.1038/nature10226 53 Z. Lu N. McBrearty J. Chen ATF3 and CH25H Regulate Effector Trogocytosis and Anti‐Tumor Activities of Endogenous and Immunotherapeutic Cytotoxic T Lymphocytes Cell Metabolism 34 9 2022 1342 1358 36070682 10.1016/j.cmet.2022.08.007 PMC10496461 54 Z. Lu J. Chen P. Yu Tumor Factors Stimulate Lysosomal Degradation of Tumor Antigens and Undermine Their Cross‐Presentation in Lung Cancer Nature Communications 13 1 2022 6623 10.1038/s41467-022-34428-w PMC9636202 36333297 55 Y. Wang J. Luo A. Alu X. Han Y. Wei X. Wei cGAS‐STING Pathway in Cancer Biotherapy Molecular Cancer 19 1 2020 136 32887628 10.1186/s12943-020-01247-w PMC7472700 56 M. Motwani S. Pesiridis K. A. Fitzgerald DNA Sensing by the cGAS‐STING Pathway in Health and Disease Nature Reviews Genetics 20 11 2019 657 674 10.1038/s41576-019-0151-1 31358977 57 Z. Zhang C. Zhang Regulation of cGAS‐STING Signalling and Its Diversity of Cellular Outcomes Nature Reviews Immunology 25 6 2025 425 444 10.1038/s41577-024-01112-7 39774812 58 K.‐P. Hopfner V. Hornung Molecular Mechanisms and Cellular Functions of cGAS‐STING Signalling Nature Reviews Molecular Cell Biology 21 9 2020 501 521 32424334 10.1038/s41580-020-0244-x 59 F. Luchetti R. Crinelli E. Cesarini Endothelial Cells, Endoplasmic Reticulum Stress and Oxysterols Redox Biology 13 2017 581 587 28783588 10.1016/j.redox.2017.07.014 PMC5545768 60 N. Shibata A. F. Carlin N. J. Spann 25‐Hydroxycholesterol Activates the Integrated Stress Response to Reprogram Transcription and Translation in Macrophages Journal of Biological Chemistry 288 50 2013 35812 35823 24189069 10.1074/jbc.M113.519637 PMC3861632 61 E. Mohamed R. A. Sierra J. Trillo‐Tinoco The Unfolded Protein Response Mediator PERK Governs Myeloid Cell‐Driven Immunosuppression in Tumors Through Inhibition of STING Signaling Immunity 52 4 2020 668 682 32294407 10.1016/j.immuni.2020.03.004 PMC7207019 62 R. A. Faulkner Y. Yang J. Tsien T. Qin R. A. DeBose‐Boyd Direct Binding to Sterols Accelerates Endoplasmic Reticulum‐Associated Degradation of HMG CoA Reductase PNAS 121 7 2024 e2318822121 38319967 10.1073/pnas.2318822121 PMC10873557 63 Y. Ji Y. Luo Y. Wu SEL1L‐HRD1 Endoplasmic Reticulum‐Associated Degradation Controls STING‐Mediated Innate Immunity by Limiting the Size of the Activable STING Pool Nature Cell Biology 25 5 2023 726 739 37142791 10.1038/s41556-023-01138-4 PMC10185471 ",
  "metadata": {
    "Title of this paper": "SEL1L‐HRD1 Endoplasmic Reticulum‐Associated Degradation Controls STING‐Mediated Innate Immunity by Limiting the Size of the Activable STING Pool",
    "Journal it was published in:": "MedComm",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475974/"
  }
}