{
  "title": "Paper_902",
  "abstract": "J Am Chem Soc J Am Chem Soc 319 nihpa Journal of the American Chemical Society 0002-7863 1520-5126 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12477617 PMC12477617.1 12477617 12477617 NIHMS2111397 40947600 10.1021/jacs.5c09297 NIHMS2111397 NIHPA2111397 1 Article An Alkyne-Directed Cleavage Approach for Activity-Based Cu(I) Sensing Reveals Manganese-Promoted Sensitization of Cuproptosis Xie Xiao 1 † Li Gen 1 † Pezacki Aidan T. 1 2 Gao Jiaying 1 Oi Miku 2 Chang Christopher J. 1 2 * 1 2 † These authors contributed equally to this work. * chrischang@princeton.edu Competing interests All authors declare that they have no competing interests. 24 9 2025 14 9 2025 147 38 497744 34564 34574 24 09 2025 29 09 2025 30 09 2025 30 09 2025 Copper is an essential element for sustaining life. However, disruptions in copper homeostasis underpin disease, as illustrated by cuproptosis, an emerging form of cell death resulting from aberrant accumulation of copper pools in loosely-bound, labile forms. Along these lines, activity-based sensing (ABS) offers a powerful strategy for tracking labile copper fluxes with metal and oxidation state selectivity by exploiting analyte reactivity for analyte detection. Traditional ABS probes for Cu(I), the major oxidation state of copper in cells, are selective but require O 2 Graphical Abstract  pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "An Alkyne-Directed Cleavage Approach for Activity-Based Cu(I) Sensing Reveals Manganese-Promoted Sensitization of Cuproptosis",
    "Journal it was published in:": "Journal of the American Chemical Society",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477617/"
  }
}