{
  "title": "Paper_281",
  "abstract": "pmc Front Med (Lausanne) Front Med (Lausanne) 2657 frontmedicine Front. Med. Frontiers in Medicine 2296-858X Frontiers Media SA PMC12488604 PMC12488604.1 12488604 12488604 10.3389/fmed.2025.1686859 1 Medicine Editorial Editorial: Artificial intelligence-assisted medical imaging solutions for integrating pathology and radiology automated systems, volume II Singh Prabhishek  1  * Ravi Vinayakumar  2 Bijalwan Anchit  3 1 School of Computer Science Engineering and Technology, Bennett University Greater Noida India 2 Center for Artificial Intelligence, Prince Mohammad bin Fahd University Khobar Saudi Arabia 3 School of Computing and Innovative Technologies, British University Vietnam Hanoi Vietnam Edited and reviewed by: Luigi M. Terracciano, University of Basel, Switzerland *Correspondence: Prabhishek Singh prabhisheksingh88@gmail.com 18 9 2025 2025 12 480650 1686859 16 8 2025 01 9 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Singh, Ravi and Bijalwan. 2025 Singh, Ravi and Bijalwan https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. pathology radiology computer-aided diagnosis explainable AI generalized models volume II pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Pathology 1 Introduction This Research Topic, Artificial Intelligence-Assisted Medical Imaging Solutions for Integrating Pathology and Radiology Automated Systems - Volume II 2 Contributions A total of 21 publications have been published on this Research Topic. Xie et al. He et al. Maqsood et al. Rani et al. Zhang et al. Sun Baili et al. Amin et al. Al-Adhaileh et al. Alarjani and Almarri Aldhyani et al. Ding et al. Buttar et al. Maity et al. Alharbi et al. Alenezi et al. Sathya et al. Rauf et al. Almarri et al. Alzakari et al. 3 Conclusion This Volume-II of editorial presents 21 research papers exploring AI-assisted medical imaging for integrating automated pathology and radiology systems. The aim was to curate impactful work within AI-driven healthcare. The contributions reflect a growing trend toward intelligent diagnostic solutions, with future efforts encouraged to further enhance integration across both domains using advanced AI techniques. We sincerely thank all authors for their valuable contributions and the reviewers for their timely and insightful evaluations that enhanced the quality of this collection. We also extend our appreciation to the Frontiers in Medicine editorial team for their continuous support in making this Research Topic a success. Author contributions PS: Methodology, Investigation, Writing – original draft. VR: Writing – review & editing, Resources, Project administration. AB: Validation, Writing – review & editing, Visualization. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. ",
  "metadata": {
    "Title of this paper": "Editorial: Artificial intelligence-assisted medical imaging solutions for integrating pathology and radiology automated systems, volume II",
    "Journal it was published in:": "Frontiers in Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488604/"
  }
}