{
  "title": "Paper_583",
  "abstract": "pmc Gut Pathog Gut Pathog 867 gutpath Gut Pathogens 1757-4749 BMC PMC12482689 PMC12482689.1 12482689 12482689 41024079 10.1186/s13099-025-00754-9 754 1 Research Helicobacter pylori http://orcid.org/0000-0002-5643-6095 Chung Chiwook 1 Lee Kyu Na 2 http://orcid.org/0000-0002-9622-0643 Han Kyungdo 2 http://orcid.org/0000-0001-8128-8920 Shin Dong Wook dwshin.md@gmail.com 3 4 http://orcid.org/0000-0003-4814-6730 Lee Sei Won iseiwon@gmail.com 5 1 https://ror.org/04n278m24 grid.488450.5 0000 0004 1790 2596 Division of Pulmonary, Allergy and Critical Care Medicine, Department of Internal Medicine, Hallym University Dongtan Sacred Heart Hospital, Hallym University College of Medicine, 2 https://ror.org/017xnm587 grid.263765.3 0000 0004 0533 3568 Department of Statistics and Actuarial Science, Soongsil University, 3 https://ror.org/05a15z872 grid.414964.a 0000 0001 0640 5613 Department of Family Medicine, Samsung Medical Center Sungkyunkwan University School of Medicine, 4 https://ror.org/04q78tk20 grid.264381.a 0000 0001 2181 989X Department of Clinical Research Design and Evaluation, Samsung Advanced Institute for Health Science and Technology (SAIHST), Sungkyunkwan University School of Medicine, 5 https://ror.org/02c2f8975 grid.267370.7 0000 0004 0533 4667 Department of Pulmonary and Critical Care Medicine, Asan Medical Center, University of Ulsan College of Medicine, 29 9 2025 2025 17 479106 75 15 5 2025 8 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Helicobacter pylori H. pylori Methods Data from individuals who underwent H. pylori H. pylori Results The incidences of COPD and asthma among individuals with H. pylori H. pylori Conclusions H. pylori Supplementary Information The online version contains supplementary material available at 10.1186/s13099-025-00754-9. Keywords Chronic obstructive pulmonary disease Asthma Helicobacter pylori Smoking https://doi.org/10.13039/501100003725 National Research Foundation of Korea RS-2023-NR077159 Lee Sei Won National Institute of Health research project 2024ER080601 Lee Sei Won pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Helicobacter pylori 1 H. pylori 1 3 H. pylori 4 5 6 7 H. pylori Previous studies investigating this association have yielded mixed results. Some case-control and retrospective studies have reported a significant association between H. pylori 8 10 11 H. pylori 12 13 14 15 H. pylori 10 12 13 10 8 9 11 14 Given these uncertainties, further large-scale population-based studies that incorporate clinically verified H. pylori H. pylori H. pylori H. pylori H. pylori H. pylori 16 Methods Data source This study utilized data from the Korean National Health Insurance Database (NHID), a comprehensive population-based dataset maintained by the National Health Insurance Service (NHIS). The NHID includes information on demographics, healthcare utilization, disease diagnoses, prescription records, health screening results, and mortality for nearly the entire Korean population since 2001 [ 17 18 Since 1995, the NHIS has implemented a national health screening program for early disease detection [ 19 18 20 21 Study population H. pylori H. pylori 16 16 A 1:5 age- and sex-matched control group ( n H. pylori H. pylori 20 21 H. pylori Individuals who satisfied the following criteria were excluded from the present study: (1) insufficient insurance data (318 and 2,499, respectively), (2) prior insurance claims of COPD (the International Classification of Diseases 10th revision [ICD-10] codes J41–J44) or asthma (ICD-10 codes J45–J46) before the index date (previous diagnosis wash-out, 7,615 and 34,128, respectively), and (3) insurance claims of COPD or asthma (as mentioned previously) within 1 year after the index date (lag period of 1 year, 966 and 4,429, respectively), to reduce potential over-detection of COPD or asthma (surveillance bias). After applying these criteria, 33,017 H. pylori 1  Fig. 1 Study flow chart. COPD, chronic obstructive pulmonary disease For sensitivity analysis, we included only participants who had undergone national health screening within two years before the index date (21,949 and 88,622, respectively) to ensure the availability of lifestyle and health behavior data and to exclude individuals with potential H. pylori 22 Study outcomes: COPD and asthma New-onset COPD and asthma were the primary outcome measures of the present study. COPD was defined as three or more annual claims for ICD-10 codes J41–J44, excluding cases with prior diagnoses or events within one year of the index date [ 23 24 25 26 Covariates The covariates included demographic variables (age, sex, income level, and region of residence), comorbidities, and health behavior factors. Household income was divided into quintiles (Q1–Q5) based on NHIS premium contributions, with Q1 representing the lowest income group and including Medical Aid recipients. The region of residence was categorized as metropolitan or non-metropolitan. Comorbidities were identified using claims records within the year preceding the index date: (1) diabetes mellitus (ICD-10 E11–E14 + hypoglycemic medications), (2) hypertension (ICD-10 I10–13 and I15 + antihypertensive treatments), and (3) dyslipidemia (ICD-10 E78 + lipid-lowering agents). Data on smoking and alcohol use were obtained from the National Health Screening Program. Smoking status was categorized as never, former, or current, while alcohol consumption was classified as non-drinker, mild (1–29.9 g/day), or heavy (≥ 30 g/day). Statistical analysis Continuous and categorical variables were summarized as mean ± standard deviation and counts (percentage), respectively. Intergroup differences were tested using Student’s t-test and chi-square test, as appropriate. The disease incidence rate was expressed as the ratio between cases of new-onset disease and person-years (PY) at risk (per 1,000). Cumulative incidence was assessed using Kaplan–Meier curves. Multivariable Cox proportional hazards models were used to estimate the adjusted hazard ratios (aHRs) for disease development, and Schoenfeld residuals were used to validate the proportional hazards assumption. Four models were constructed: Model 1: unadjusted. Model 2: adjusted for age and sex. Model 3 (main model): further adjusted for region, income, diabetes, hypertension, and dyslipidemia. Model 4 (sensitivity analysis): Model 3 variables plus smoking status and alcohol use. Subgroup analyses were stratified according to sex, age, and smoking status. To assess the potential surveillance bias following health screening, we conducted the same statistical analyses using a dataset that did not exclude individuals who experienced the study outcome within 1 year after the index date (i.e., without applying a 1-year lag period). Additionally, we performed further analyses on the occurrence of the study outcome after applying the stabilized inverse probability of treatment weighting (IPTW) method. Statistical significance was set at P Results Baseline characteristics Table 1 H. pylori  Table 1 Baseline characteristics of the study population according to Helicobacter pylori Main analysis Sensitivity analysis Total H. pylori H. pylori Total H. pylori H. pylori N 201,541 168,524 33,017 109,971 88,113 21,858 Age, years 53.4 ± 9.4 53.4 ± 9.3 53.4 ± 9.4 53.9 ± 9.3 53.9 ± 9.3 53.7 ± 9.3 40–64 years 174,848 (86.8) 146,269 (86.8) 28,579 (86.6) 94,520 (86.0) 75,690 (85.9) 18,830 (86.2) ≥65 years 26,693 (13.2) 22,255 (13.2) 4,438 (13.4) 15,451 (14.1) 12,423 (14.1) 3,028 (13.9) Male sex 119,020 (59.1) 99,320 (58.9) 19,700 (59.7) 64,289 (58.5) 51,192 (58.1) 13,097 (59.9) Metropolitan 93,023 (46.2) 76,967 (45.7) 16,056 (48.6) 49,920 (45.4) 39,337 (44.6) 10,583 (48.4) Income, Lowest Q1 35,172 (17.5) 29,746 (17.7) 5,426 (16.4) 17,213 (15.7) 13,826 (15.7) 3,387 (15.5) Diabetes mellitus 17,990 (8.9) 14,630 (8.7) 3,360 (10.2) 10,123 (9.2) 7,896 (9.0) 2,227 (10.2) Hypertension 47,475 (23.6) 38,737 (23.0) 8,738 (26.5) 27,906 (25.4) 22,048 (25.0) 5,858 (26.8) Dyslipidemia 31,191 (15.5) 24,076 (14.3) 7,115 (21.6) 20,044 (18.2) 15,117 (17.2) 4,927 (22.5) Smoking status Non 61,934 (56.3) 50,438 (57.2) 11,496 (52.6) Former 21,304 (19.4) 17,057 (19.4) 4,247 (19.4) Current 26,733 (24.3) 20,618 (23.4) 6,115 (28.0) Alcohol consumption Non 56,585 (51.5) 45,796 (52.0) 10,789 (49.4) Mild 43,694 (39.7) 34,753 (39.4) 8,941 (40.9) Heavy 9,692 (8.8) 7,564 (8.6) 2,128 (9.7) Data are presented as the mean ± standard deviation or number (%), unless otherwise indicated Risk of COPD and asthma in H. pylori infection Over the follow-up period (mean duration 5.1 ± 2.7 years), a total of 21,757 new cases of COPD or asthma were identified—17,753 cases in the control group and 4,004 in the H. pylori H. pylori 2  Fig. 2 Cumulative incidence of COPD and asthma plotted using a Kaplan–Meier curve. A B C In multivariable analysis (Model 3), H. pylori H. pylori 2  Table 2 Association between Helicobacter pylori HR (95% CI) Age, years  H. pylori N Event Duration, PY IR, per 1000 PY Model 1 Model 2 Model 3  COPD Total No 168,524 8,473 899,302 9.42 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 33,017 1,926 176,317 10.92 1.16 (1.10, 1.22) 1.15 (1.10, 1.21) 1.13 (1.08, 1.19) 40–64 No 146,269 6,243 791,793 7.88 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 28,579 1,387 154,690 8.97 1.14 (1.07, 1.21) 1.14 (1.07, 1.21) 1.12 (1.05, 1.18) ≥ 65 No 22,255 2,230 107,509 20.74 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 4,438 539 21,627 24.92 1.20 (1.09, 1.32) 1.19 (1.08, 1.31) 1.19 (1.08, 1.30)  Asthma Total No 168,524 11,897 884,206 13.46 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 33,017 2,761 172,658 15.99 1.19 (1.14, 1.24) 1.19 (1.14, 1.24) 1.17 (1.12, 1.22) 40–64 No 146,269 9,492 778,060 12.20 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 28,579 2,186 151,438 14.43 1.18 (1.13, 1.24) 1.19 (1.13, 1.24) 1.17 (1.11, 1.22) ≥ 65 No 22,255 2,405 106,146 22.66 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 4,438 575 21,219 27.10 1.20 (1.09, 1.31) 1.20 (1.09, 1.31) 1.18 (1.08, 1.30)  COPD or asthma Total No 168,524 17,753 864,633 20.53 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 33,017 4,004 168,278 23.79 1.16 (1.12, 1.20) 1.16 (1.12, 1.20) 1.14 (1.10, 1.18) 40–64 No 146,269 13,902 763,253 18.21 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 28,579 3,097 148,171 20.90 1.15 (1.10, 1.19) 1.15 (1.11, 1.20) 1.13 (1.09, 1.18) ≥ 65 No 22,255 3,851 101,380 37.99 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 4,438 907 20,107 45.11 1.19 (1.10, 1.28) 1.18 (1.10, 1.27) 1.17 (1.09, 1.26) Model 1: Non-adjusted Model 2: Adjusted for age and sex Model 3: Adjusted for age, sex, region, income, diabetes, hypertension, and dyslipidemia COPD, chronic obstructive pulmonary disease; IR, incidence rate; PY, person-years; HR, hazard ratio; CI, confidence interval; Ref, reference Among the subset of participants with available health behavior data ( n 3  Table 3 Association between Helicobacter pylori HR (95% CI) Age, years  H. pylori N Event Duration, PY IR, per 1000 PY Model 1 Model 2 Model 3 Model 4  COPD Total No 88,113 4,157 420,369 9.89 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 21,858 1,132 106,054 10.67 1.08 (1.01, 1.15) 1.09 (1.02, 1.17) 1.08 (1.01, 1.16) 1.07 (1.01, 1.15) 40–64 No 75,690 3,012 364,656 8.26 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 18,830 813 92,427 8.80 1.06 (0.98, 1.15) 1.08 (1.00, 1.17) 1.07 (0.99, 1.16) 1.06 (0.98, 1.15) ≥ 65 No 12,423 1,145 55,713 20.55 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 3,028 319 13,627 23.41 1.14 (1.01, 1.29) 1.12 (0.99, 1.27) 1.13 (0.99, 1.28) 1.12 (0.99, 1.26)  Asthma Total No 88,113 5,889 413,727 14.23 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 21,858 1,645 104,003 15.82 1.11 (1.05, 1.17) 1.13 (1.07, 1.19) 1.12 (1.06, 1.18) 1.12 (1.06, 1.18) 40–64 No 75,690 4,602 358,731 12.83 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 18,830 1,301 90,609 14.36 1.12 (1.05, 1.19) 1.14 (1.07, 1.21) 1.13 (1.06, 1.20) 1.13 (1.06, 1.20) ≥ 65 No 12,423 1,287 54,997 23.40 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 3,028 344 13,394 25.68 1.10 (0.97, 1.24) 1.10 (0.97, 1.24) 1.09 (0.97, 1.23) 1.09 (0.96, 1.22)  COPD or asthma Total No 88,113 8,823 404,861 21.79 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 21,858 2,391 101,685 23.51 1.08 (1.03, 1.13) 1.10 (1.05, 1.15) 1.08 (1.04, 1.14) 1.08 (1.04, 1.13) 40–64 No 75,690 6,796 352,154 19.30 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 18,830 1,851 88,874 20.83 1.08 (1.03, 1.14) 1.10 (1.04, 1.16) 1.09 (1.03, 1.14) 1.09 (1.03, 1.14) ≥ 65 No 12,423 2,027 52,707 38.46 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 3,028 540 12,811 42.15 1.10 (1.00, 1.21) 1.09 (0.99, 1.20) 1.09 (0.99, 1.19) 1.08 (0.98, 1.19) Model 1: Non-adjusted Model 2: Adjusted for age and sex Model 3: Adjusted for age, sex, region, income, diabetes, hypertension, and dyslipidemia Model 4: Adjusted for age, sex, region, income, diabetes, hypertension, dyslipidemia, smoking status, and alcohol consumption COPD, chronic obstructive pulmonary disease; IR, incidence rate; PY, person-years; HR, hazard ratio; CI, confidence interval; Ref, reference In the dataset that did not exclude individuals who developed COPD and asthma within 1 year after the index date (i.e., without applying a 1-year lag period), the overall incidence rates of COPD and asthma were slightly higher; however, the hazard ratios remained largely unchanged (supplementary Tables 4, 5, 6, 7). In addition, the Kaplan–Meier survival curves demonstrated a relatively constant slope during the follow-up period after the index date (Supplementary Fig. 1). Similarly, in the analysis utilizing the stabilized IPTW method, no notable differences were observed in the risk of COPD and asthma (Supplementary Tables 8, 9). Stratified analyses according to sex and smoking status When stratified by sex, both male and female participants with H. pylori H. pylori H. pylori 4  Table 4 Association between Helicobacter pylori Main analysis (Model 3) Sensitivity analysis (Model 4) aHR (95% CI) aHR (95% CI) Age, years  H. pylori Male Female Male Female Never and former smokers Current smokers  COPD Total No 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 1.12 (1.05, 1.20) 1.15 (1.07, 1.25) 1.10 (1.01, 1.20) 1.04 (0.94, 1.15) 1.04 (0.97, 1.13) 1.17 (1.03, 1.33)  Asthma Total No 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 1.18 (1.12, 1.26) 1.16 (1.09, 1.23) 1.13 (1.05, 1.22) 1.11 (1.03, 1.20) 1.12 (1.05, 1.19) 1.13 (1.00, 1.28)  COPD or asthma Total No 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) 1 (Ref.) Yes 1.14 (1.09, 1.20) 1.13 (1.08, 1.19) 1.09 (1.02, 1.16) 1.08 (1.01, 1.15) 1.07 (1.02, 1.13) 1.12 (1.02, 1.23) Model 3: Adjusted for age, sex, region, income, diabetes, hypertension, and dyslipidemia Model 4: Adjusted for age, sex, region, income, diabetes, hypertension, dyslipidemia, smoking status, and alcohol consumption COPD, chronic obstructive pulmonary disease; IR, incidence rate; PY, person-years; HR, hazard ratio; CI, confidence interval Discussion In this large-scale population-based cohort study, we demonstrated that individuals with clinically confirmed H. pylori H. pylori H. pylori H. pylori A significant association between H. pylori H. pylori 22 H. pylori H. pylori The observed associations are biologically plausible, given the known pro-inflammatory and immunomodulatory effects of H. pylori H. pylori 27 28 H. pylori 29 23 30 31 32 Second, H. pylori 33 34 33 35 While the first two hypotheses address the risks associated with chronic inflammatory conditions attributable to H. pylori H. pylori 36 37 38 H. pylori 39 H. pylori Stratified analysis according to age revealed a more pronounced association between H. pylori H. pylori 1 27 H. pylori The heightened COPD risk observed in current smokers with H. pylori H. pylori 40 16 H. pylori This study has several strengths that reinforce the credibility of our findings. First, our strict definition of H. pylori 9 14 H. pylori However, some limitations of this study should be acknowledged. First, this study aimed to compare H. pylori H. pylori H. pylori H. pylori 22 H. pylori H. pylori In conclusion, H. pylori H. pylori Supplementary Information  Supplementary Material 1. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Dong Wook Shin and Sei Won Lee contributed equally to this work as corresponding authors. Acknowledgements Not applicable. Author contributions Chiwook Chung, Kyu Na Lee, Kyungdo Han, Dong Wook Shin, and Sei Won Lee conceived and designed the study. Kyu Na Lee, and Kyungdo Han contributed to the data collection and data analysis. Chiwook Chung, Dong Wook Shin, and Sei Won Lee contributed to data interpretation and drafted the manuscript. The final manuscript was revised and approved by all authors. All authors accept responsibility for the accuracy of the content in the final manuscript. Funding This study was supported by the National Research Foundation of Korea (NRF) grant funded by the Korean government (MSIT) (RS-2023-NR077159), the Bio&Medical Technology Development Program of the NRF funded by the MSIT (RS-2022-NR067421 and RS-2023-00222687), and the National Institute of Health Research Project (2024ER080601). Data availability The datasets used and/or analyzed in the current study are available from the corresponding author upon reasonable request. Declarations Ethics approval and consent to participate The study protocol was approved by the Institutional Review Board of Asan Medical Center, Seoul, Republic of Korea (approval No. 2022 − 1593). The requirement for informed consent was waived because this was a retrospective study, and the data used were anonymized. This study complied with the guidelines stipulated in the Declaration of Helsinki, and all methods were performed in accordance with the relevant guidelines. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Malfertheiner P Camargo MC El-Omar E Liou JM Peek R Schulz C Helicobacter pylori infection Nat Rev Dis Primers 2023 9 19 10.1038/s41572-023-00431-8 37081005 PMC11558793 Malfertheiner P, Camargo MC, El-Omar E, Liou JM, Peek R, Schulz C, et al. Helicobacter pylori infection. Nat Rev Dis Primers. 2023;9:19. 37081005 10.1038/s41572-023-00431-8 PMC11558793 2. Jackson L Britton J Lewis SA McKeever TM Atherton J Fullerton D A population-based epidemiologic study of Helicobacter pylori infection and its association with systemic inflammation Helicobacter 2009 14 108 13 10.1111/j.1523-5378.2009.00711.x 19751435 Jackson L, Britton J, Lewis SA, McKeever TM, Atherton J, Fullerton D, et al. A population-based epidemiologic study of Helicobacter pylori infection and its association with systemic inflammation. Helicobacter. 2009;14:108–13. 19751435 10.1111/j.1523-5378.2009.00711.x 3. Shin DW Kwon HT Kang JM Park JH Choi HC Park MS Association between metabolic syndrome and Helicobacter pylori J Clin Gastroenterol 2012 46 840 5 10.1097/MCG.0b013e3182522477 23064216 Shin DW, Kwon HT, Kang JM, Park JH, Choi HC, Park MS, et al. Association between metabolic syndrome and Helicobacter pylori 23064216 10.1097/MCG.0b013e3182522477 4. Bakhti SZ Latifi-Navid S Interplay and cooperation of Helicobacter pylori BMC Microbiol 2021 21 258 10.1186/s12866-021-02315-x 34556055 PMC8461988 Bakhti SZ, Latifi-Navid S. Interplay and cooperation of Helicobacter pylori 34556055 10.1186/s12866-021-02315-x PMC8461988 5. Hou K Wu ZX Chen XY Wang JQ Zhang D Xiao C Microbiota in health and diseases Signal Transduct Target Ther 2022 7 135 10.1038/s41392-022-00974-4 35461318 PMC9034083 Hou K, Wu ZX, Chen XY, Wang JQ, Zhang D, Xiao C, et al. Microbiota in health and diseases. Signal Transduct Target Ther. 2022;7:135. 35461318 10.1038/s41392-022-00974-4 PMC9034083 6. Li N Dai Z Wang Z Deng Z Zhang J Pu J Gut microbiota dysbiosis contributes to the development of chronic obstructive pulmonary disease Respir Res 2021 22 274 10.1186/s12931-021-01872-z 34696775 PMC8543848 Li N, Dai Z, Wang Z, Deng Z, Zhang J, Pu J, et al. Gut microbiota dysbiosis contributes to the development of chronic obstructive pulmonary disease. Respir Res. 2021;22:274. 34696775 10.1186/s12931-021-01872-z PMC8543848 7. Hufnagl K Pali-Scholl I Roth-Walter F Jensen-Jarolim E Dysbiosis of the gut and lung microbiome has a role in asthma Semin Immunopathol 2020 42 75 93 10.1007/s00281-019-00775-y 32072252 PMC7066092 Hufnagl K, Pali-Scholl I, Roth-Walter F, Jensen-Jarolim E. Dysbiosis of the gut and lung microbiome has a role in asthma. Semin Immunopathol. 2020;42:75–93. 32072252 10.1007/s00281-019-00775-y PMC7066092 8. Jun ZJ Lei Y Shimizu Y Dobashi K Mori M High seroprevalence of Helicobacter pylori Tohoku J Exp Med 2006 208 327 31 10.1620/tjem.208.327 16565595 Jun ZJ, Lei Y, Shimizu Y, Dobashi K, Mori M. High seroprevalence of Helicobacter pylori 16565595 10.1620/tjem.208.327 9. Siva R Birring SS Berry M Rowbottom A Pavord ID Peptic ulceration, Helicobacter pylori Respirology 2013 18 728 31 10.1111/resp.12075 23438259 Siva R, Birring SS, Berry M, Rowbottom A, Pavord ID. Peptic ulceration, Helicobacter pylori 23438259 10.1111/resp.12075 10. Peng YH Chen CK Su CH Liao WC Muo CH Hsia TC Increased risk of chronic obstructive pulmonary disease among patients with Helicobacter pylori Clin Respir J 2017 11 558 65 10.1111/crj.12382 26364850 Peng YH, Chen CK, Su CH, Liao WC, Muo CH, Hsia TC, et al. Increased risk of chronic obstructive pulmonary disease among patients with Helicobacter pylori 26364850 10.1111/crj.12382 11. Lee HY Kim JW Lee JK Heo EY Chung HS Kim DK Association between Helicobacter pylori H. pylori Int J Chron Obstruct Pulmon Dis 2016 11 2055 62 10.2147/COPD.S106922 27621611 PMC5012608 Lee HY, Kim JW, Lee JK, Heo EY, Chung HS, Kim DK. Association between Helicobacter pylori H. pylori 27621611 10.2147/COPD.S106922 PMC5012608 12. Reibman J Marmor M Filner J Fernandez-Beros ME Rogers L Perez-Perez GI Asthma is inversely associated with Helicobacter pylori PLoS ONE 2008 3 e4060 10.1371/journal.pone.0004060 19112508 PMC2603593 Reibman J, Marmor M, Filner J, Fernandez-Beros ME, Rogers L, Perez-Perez GI, et al. Asthma is inversely associated with Helicobacter pylori 19112508 10.1371/journal.pone.0004060 PMC2603593 13. Lim JH Kim N Lim SH Kwon JW Shin CM Chang YS Inverse relationship between Helicobacter pylori Medicine (Baltimore) 2016 95 e2609 10.1097/MD.0000000000002609 26937899 PMC4778996 Lim JH, Kim N, Lim SH, Kwon JW, Shin CM, Chang YS, et al. Inverse relationship between Helicobacter pylori 26937899 10.1097/MD.0000000000002609 PMC4778996 14. Fullerton D Britton JR Lewis SA Pavord ID McKeever TM Fogarty AW Helicobacter pylori Int J Epidemiol 2009 38 419 26 10.1093/ije/dyn348 19109248 Fullerton D, Britton JR, Lewis SA, Pavord ID, McKeever TM, Fogarty AW. Helicobacter pylori 19109248 10.1093/ije/dyn348 15. Miftahussurur M Nusi IA Graham DY Yamaoka Y Helicobacter Front Microbiol 2017 8 1034 10.3389/fmicb.2017.01034 28642748 PMC5462935 Miftahussurur M, Nusi IA, Graham DY, Yamaoka Y. Helicobacter 28642748 10.3389/fmicb.2017.01034 PMC5462935 16. Jung HK Kang SJ Lee YC Yang HJ Park SY Shin CM Evidence-based guidelines for the treatment of Helicobacter pylori Gut Liver 2021 15 168 95 10.5009/gnl20288 33468712 PMC7960974 Jung HK, Kang SJ, Lee YC, Yang HJ, Park SY, Shin CM, et al. Evidence-based guidelines for the treatment of Helicobacter pylori 33468712 10.5009/gnl20288 PMC7960974 17. Cheol Seong S Kim YY Khang YH Heon Park J Kang HJ Lee H Data resource profile: the National health information database of the National health insurance service in South Korea Int J Epidemiol 2017 46 799 800 27794523 10.1093/ije/dyw253 PMC5837262 Cheol Seong S, Kim YY, Khang YH, Heon Park J, Kang HJ, Lee H, et al. Data resource profile: the National health information database of the National health insurance service in South Korea. Int J Epidemiol. 2017;46:799–800. 27794523 10.1093/ije/dyw253 PMC5837262 18. Seong SC Kim YY Park SK Khang YH Kim HC Park JH Cohort profile: the National health insurance service-National health screening cohort (NHIS-HEALS) in Korea BMJ Open 2017 7 e016640 10.1136/bmjopen-2017-016640 28947447 PMC5623538 Seong SC, Kim YY, Park SK, Khang YH, Kim HC, Park JH, et al. Cohort profile: the National health insurance service-National health screening cohort (NHIS-HEALS) in Korea. BMJ Open. 2017;7:e016640. 28947447 10.1136/bmjopen-2017-016640 PMC5623538 19. Shin DW Cho J Park JH Cho B National general health screening program in Korea: history, current status, and future direction Precis Future Med 2022 6 9 31 10.23838/pfm.2021.00135 Shin DW, Cho J, Park JH, Cho B. National general health screening program in Korea: history, current status, and future direction. Precis Future Med. 2022;6:9–31. 20. Kim Y Shin DW Kim HW Jung JH Han K Cho IY Disparities in gastric cancer screening among people with disabilities: a national registry-linkage study in South Korea Gastric Cancer 2020 23 497 509 10.1007/s10120-019-01017-8 31677130 Kim Y, Shin DW, Kim HW, Jung JH, Han K, Cho IY, et al. Disparities in gastric cancer screening among people with disabilities: a national registry-linkage study in South Korea. Gastric Cancer. 2020;23:497–509. 31677130 10.1007/s10120-019-01017-8 21. Suh YS Lee J Woo H Shin D Kong SH Lee HJ National cancer screening program for gastric cancer in Korea: nationwide treatment benefit and cost Cancer 2020 126 1929 39 10.1002/cncr.32753 32031687 Suh YS, Lee J, Woo H, Shin D, Kong SH, Lee HJ, et al. National cancer screening program for gastric cancer in Korea: nationwide treatment benefit and cost. Cancer. 2020;126:1929–39. 32031687 10.1002/cncr.32753 22. Lee JH Choi KD Jung HY Baik GH Park JK Kim SS Seroprevalence of Helicobacter pylori Helicobacter 2018 23 e12463 10.1111/hel.12463 29345022 PMC5900911 Lee JH, Choi KD, Jung HY, Baik GH, Park JK, Kim SS, et al. Seroprevalence of Helicobacter pylori 29345022 10.1111/hel.12463 PMC5900911 23. Chung C Kim H Han K Jung J Eun Y Lee H Does rheumatoid arthritis increase the risk of COPD? A nationwide retrospective cohort study Chest 2024 165 1362 71 10.1016/j.chest.2024.02.014 38365176 Chung C, Kim H, Han K, Jung J, Eun Y, Lee H, et al. Does rheumatoid arthritis increase the risk of COPD? A nationwide retrospective cohort study. Chest. 2024;165:1362–71. 38365176 10.1016/j.chest.2024.02.014 24. Chung C Lee KN Shin DW Lee SW Han K Low household income increases risks for chronic obstructive pulmonary disease in young population: a nationwide retrospective cohort study in South Korea BMJ Open Respir Res 2024 10.1136/bmjresp-2024-002444 39074962 PMC11288150 Chung C, Lee KN, Shin DW, Lee SW, Han K. Low household income increases risks for chronic obstructive pulmonary disease in young population: a nationwide retrospective cohort study in South Korea. BMJ Open Respir Res. 2024 Jul 29;11(1):e002444. 10.1136/bmjresp-2024-002444 39074962 10.1136/bmjresp-2024-002444 PMC11288150 25. Kim DH Han K Kim SW Effects of antibiotics on the development of asthma and other allergic diseases in children and adolescents Allergy Asthma Immunol Res 2018 10 457 65 10.4168/aair.2018.10.5.457 30088366 PMC6082825 Kim DH, Han K, Kim SW. Effects of antibiotics on the development of asthma and other allergic diseases in children and adolescents. Allergy Asthma Immunol Res. 2018;10:457–65. 30088366 10.4168/aair.2018.10.5.457 PMC6082825 26. Kim SH Lee H Jung JH Kim BG Park DW Park TS Asthma increases Long-term risk of death by suicide: A nationwide Population-based cohort study J Allergy Clin Immunol Pract 2024 10.1016/j.jaip.2024.11.013 39608752 Kim SH, Lee H, Jung JH, Kim BG, Park DW, Park TS, et al. Asthma increases Long-term risk of death by suicide: A nationwide Population-based cohort study. J Allergy Clin Immunol Pract. 2024. 10.1016/j.jaip.2024.11.013. 39608752 10.1016/j.jaip.2024.11.013 27. Perez-Perez GI Rothenbacher D Brenner H Epidemiology of Helicobacter pylori Helicobacter 2004 9 Suppl 1 1 6 10.1111/j.1083-4389.2004.00248.x 15347299 Perez-Perez GI, Rothenbacher D, Brenner H. Epidemiology of Helicobacter pylori 15347299 10.1111/j.1083-4389.2004.00248.x 28. Bagheri V Memar B Momtazi AA Sahebkar A Gholamin M Abbaszadegan MR Cytokine networks and their association with Helicobacter pylori J Cell Physiol 2018 233 2791 803 10.1002/jcp.25822 28121015 Bagheri V, Memar B, Momtazi AA, Sahebkar A, Gholamin M, Abbaszadegan MR. Cytokine networks and their association with Helicobacter pylori 28121015 10.1002/jcp.25822 29. Chmiela M Gonciarz W Molecular mimicry in Helicobacter pylori World J Gastroenterol 2017 23 3964 77 10.3748/wjg.v23.i22.3964 28652651 PMC5473117 Chmiela M, Gonciarz W. Molecular mimicry in Helicobacter pylori 28652651 10.3748/wjg.v23.i22.3964 PMC5473117 30. Kim SY Min C Oh DJ Choi HG Increased risk of asthma in patients with rheumatoid arthritis: a longitudinal follow-up study using a National sample cohort Sci Rep 2019 9 6957 10.1038/s41598-019-43481-3 31061451 PMC6502877 Kim SY, Min C, Oh DJ, Choi HG. Increased risk of asthma in patients with rheumatoid arthritis: a longitudinal follow-up study using a National sample cohort. Sci Rep. 2019;9:6957. 31061451 10.1038/s41598-019-43481-3 PMC6502877 31. Li X Kong L Li F Chen C Xu R Wang H Association between psoriasis and chronic obstructive pulmonary disease: a systematic review and meta-analysis PLoS ONE 2015 10 e0145221 10.1371/journal.pone.0145221 26700640 PMC4689442 Li X, Kong L, Li F, Chen C, Xu R, Wang H, et al. Association between psoriasis and chronic obstructive pulmonary disease: a systematic review and meta-analysis. PLoS ONE. 2015;10:e0145221. 26700640 10.1371/journal.pone.0145221 PMC4689442 32. Wang J Ke R Shi W Yan X Wang Q Zhang Q Association between psoriasis and asthma risk: a meta-analysis Allergy Asthma Proc 2018 39 103 9 10.2500/aap.2018.39.4109 29490768 PMC5827153 Wang J, Ke R, Shi W, Yan X, Wang Q, Zhang Q, et al. Association between psoriasis and asthma risk: a meta-analysis. Allergy Asthma Proc. 2018;39:103–9. 29490768 10.2500/aap.2018.39.4109 PMC5827153 33. Elghannam MT Hassanien MH Ameen YA Turky EA GM EL AA EL Helicobacter pylori and oral-gut microbiome: clinical implications Infection 2024 52 289 300 10.1007/s15010-023-02115-7 37917397 PMC10954935 Elghannam MT, Hassanien MH, Ameen YA, Turky EA, GM EL, AA EL, et al. Helicobacter pylori and oral-gut microbiome: clinical implications. Infection. 2024;52:289–300. 37917397 10.1007/s15010-023-02115-7 PMC10954935 34. Iino C Shimoyama T Impact of Helicobacter pylori World J Gastroenterol 2021 27 6224 30 10.3748/wjg.v27.i37.6224 34712028 PMC8515792 Iino C, Shimoyama T. Impact of Helicobacter pylori 34712028 10.3748/wjg.v27.i37.6224 PMC8515792 35. Kim NH Choi BY Kim ES Kim SJ Hong JY Heo SH Systemic antibiotics cause deterioration of emphysema associated with exaggerated inflammation and autophagy Exp Mol Med 2023 55 2260 8 10.1038/s12276-023-01099-6 37779147 PMC10618248 Kim NH, Choi BY, Kim ES, Kim SJ, Hong JY, Heo SH, et al. Systemic antibiotics cause deterioration of emphysema associated with exaggerated inflammation and autophagy. Exp Mol Med. 2023;55:2260–8. 37779147 10.1038/s12276-023-01099-6 PMC10618248 36. Gaude GS Pulmonary manifestations of gastroesophageal reflux disease Ann Thorac Med 2009 4 115 23 10.4103/1817-1737.53347 19641641 PMC2714564 Gaude GS. Pulmonary manifestations of gastroesophageal reflux disease. Ann Thorac Med. 2009;4:115–23. 19641641 10.4103/1817-1737.53347 PMC2714564 37. Lee AL Goldstein RS Gastroesophageal reflux disease in COPD: links and risks Int J Chron Obstruct Pulmon Dis 2015 10 1935 49 10.2147/COPD.S77562 26392769 PMC4574848 Lee AL, Goldstein RS. Gastroesophageal reflux disease in COPD: links and risks. Int J Chron Obstruct Pulmon Dis. 2015;10:1935–49. 26392769 10.2147/COPD.S77562 PMC4574848 38. Grandes XA Talanki Manjunatha R Habib S Sangaraju SL Yepez D Gastroesophageal reflux disease and asthma: A narrative review Cureus 2022 14 e24917 35706753 10.7759/cureus.24917 PMC9187188 Grandes XA, Talanki Manjunatha R, Habib S, Sangaraju SL, Yepez D. Gastroesophageal reflux disease and asthma: A narrative review. Cureus. 2022;14:e24917. 35706753 10.7759/cureus.24917 PMC9187188 39. Zhao T Liu F Li Y Effects of Helicobacter pylori eradication on esophageal motility, esophageal acid exposure, and gastroesophageal reflux disease symptoms Front Cell Infect Microbiol 2023 13 1082620 10.3389/fcimb.2023.1082620 36968099 PMC10031050 Zhao T, Liu F, Li Y. Effects of Helicobacter pylori eradication on esophageal motility, esophageal acid exposure, and gastroesophageal reflux disease symptoms. Front Cell Infect Microbiol. 2023;13:1082620. 36968099 10.3389/fcimb.2023.1082620 PMC10031050 40. Yu J Yang P Qin X Li C Lv Y Wang X Impact of smoking on the eradication of Helicobacter pylori Helicobacter 2022 27 e12860 10.1111/hel.12860 34708484 Yu J, Yang P, Qin X, Li C, Lv Y, Wang X. Impact of smoking on the eradication of Helicobacter pylori 34708484 10.1111/hel.12860 ",
  "metadata": {
    "Title of this paper": "Impact of smoking on the eradication of ",
    "Journal it was published in:": "Gut Pathogens",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482689/"
  }
}