{
  "title": "Paper_990",
  "abstract": "pmc World J Gastroenterol World J Gastroenterol 818 wjg WJG World Journal of Gastroenterology 1007-9327 2219-2840 Baishideng Publishing Group Inc PMC12476672 PMC12476672.1 12476672 12476672 41025076 10.3748/wjg.v31.i36.111293 jWJG.v31.i36.eid111293 1 Retrospective Study Predicting pathological complete response to chemoradiotherapy using artificial intelligence-based magnetic resonance imaging radiomics in esophageal squamous cell carcinoma Hirata A et al Hirata Atsushi Department of Frontier Surgery, Chiba University Graduate School of Medicine, Chiba 260-8677, Japan Hayano Koichi Department of Frontier Surgery, Chiba University Graduate School of Medicine, Chiba 260-8677, Japan. hayatin1973@yahoo.co.jp Tochigi Toru Department of Frontier Surgery, Chiba University Graduate School of Medicine, Chiba 260-8677, Japan Kurata Yoshihiro Department of Frontier Surgery, Chiba University Graduate School of Medicine, Chiba 260-8677, Japan Shiraishi Tadashi Department of Frontier Surgery, Chiba University Graduate School of Medicine, Chiba 260-8677, Japan Sekino Nobufumi Department of Frontier Surgery, Chiba University Graduate School of Medicine, Chiba 260-8677, Japan Nakano Akira Department of Frontier Surgery, Chiba University Graduate School of Medicine, Chiba 260-8677, Japan Matsumoto Yasunori Department of Frontier Surgery, Chiba University Graduate School of Medicine, Chiba 260-8677, Japan Toyozumi Takeshi Department of Frontier Surgery, Chiba University Graduate School of Medicine, Chiba 260-8677, Japan Uesato Masaya Department of Frontier Surgery, Chiba University Graduate School of Medicine, Chiba 260-8677, Japan Ohira Gaku Department of Frontier Surgery, Chiba University Graduate School of Medicine, Chiba 260-8677, Japan Author contributions: Hirata A designed and conducted the study, performed the data analysis, and wrote the original manuscript; Hayano K contributed to the conceptualization and methodology, supervised the project, and reviewed and edited the manuscript; Ohira G, Tochigi T, and Kurata Y provided supervision and contributed to the conceptualization; Shiraishi T, Sekino N, Nakano A, Matsumoto Y, Toyozumi T, and Uesato M provided clinical advice; All authors have read and approve the final manuscript. Corresponding author: Koichi Hayano, MD, PhD, FACS, Department of Frontier Surgery, Chiba University Graduate School of Medicine, 1-8-1 Inohana, Chuo-ku, Chiba 260-8677, Japan. hayatin1973@yahoo.co.jp 28 9 2025 28 9 2025 31 36 497730 111293 27 6 2025 28 7 2025 21 8 2025 28 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ BACKGROUND Advanced esophageal squamous cell carcinoma (ESCC) has an extremely poor prognosis. Preoperative chemoradiotherapy (CRT) can significantly prolong survival, especially in those who achieve pathological complete response (pCR). However, the pretherapeutic prediction of pCR remains challenging. AIM To predict pCR and survival in ESCC patients undergoing CRT using an artificial intelligence (AI)-based diffusion-weighted magnetic resonance imaging (DWI-MRI) radiomics model. METHODS We retrospectively analyzed 70 patients with ESCC who underwent curative surgery following CRT. For each patient, pre-treatment tumors were semi-automatically segmented in three dimensions from DWI-MRI images ( b RESULTS pCR was achieved in 15 patients (21.4%). Apparent diffusion coefficient skewness demonstrated the highest predictive performance [area under the curve (AUC) = 0.77]. Gray-level co-occurrence matrix (GLCM) entropy ( b P P P CONCLUSION AI-based radiomics analysis of DWI-MRI images in ESCC has the potential to accurately predict the effect of CRT before treatment and contribute to constructing optimal treatment strategies. Esophageal cancer Diffusion weighted imaging Chemoradiation therapy Radiomics Machine learning pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION Esophageal squamous cell carcinoma (ESCC) is a significant global health concern, characterized by a high incidence in East Asia and a generally poor prognosis[ 1 2 On the other hand, several studies have consistently demonstrated that nCRT yields a significantly higher pathological complete response (pCR) rate compared to nCT alone. Furthermore, patients who achieve pCR exhibit a favorable prognosis, with 5-year overall survival rates exceeding 80%[ 3 4 Diffusion-weighted imaging (DWI) is a functional imaging technique sensitive to water diffusion, capable of detecting tumor microstructural changes at the cellular level. It has been increasingly used in oncology due to its ability to non-invasively characterize tumor biology. The apparent diffusion coefficient (ADC), a quantitative parameter derived from DWI, reflects tissue cellularity and structural abnormalities. ADC maps, calculated from different b 5 6 Radiomics is an advanced image analysis technique that transforms medical images into high-dimensional quantitative data, enabling objective characterization of tumor phenotypes[ 7 8 9 18 10 12 13 14 15 16 MATERIALS AND METHODS Patient population This retrospective study enrolled 70 patients with ESCC who underwent curative surgery after CRT at our institution between 2007 and 2019. All patients had histopathologically confirmed ESCC from biopsy specimens and underwent MRI prior to treatment. Based on the 8 th 17 Treatment plan and therapeutic effect Patients received concurrent CRT consisting of 5-fluorouracil (5-FU), cisplatin and irradiation ranging from 40 to 60 Gy. The chemotherapy regimen involved a continuous 24-hour infusion of 5-FU (500 mg/m 2 2 Following the initial 40 Gy radiation, all patients underwent re-evaluation by CT to assess tumor resectability. If the tumor was diagnosed as resectable, patients proceeded to radical esophagectomy with three-field lymphadenectomy approximately four weeks after completing CRT. Conversely, if the tumor remained unresectable, an additional 20 Gy of irradiation was administered, bringing the total dose to 60 Gy (defined as definitive CRT). For patients whose tumors became resectable after receiving the full 60 Gy, salvage surgery was performed. The pathological response of the primary tumor to CRT was evaluated based on the Japanese Classification of Esophageal Cancer, 12 th 18 MRI acquisition MRI examinations were performed before treatment using a 1.5 T whole-body scanner (Achieva 1.5 T Nova Dual; Philips Medical, Best, The Netherlands). T2-weighted fast spin-echo images were obtained with the following parameters: Repetition time (TR)/echo time (TE): 1100/110 ms; Slice thickness: 4 mm; Matrix size: 256 × 204; Field of view: 320 mm × 320 mm. DWI scans were obtained using a single-shot spin-echo type of echo-planar sequence, and fat signals were suppressed using short-tau inversion recovery. The imaging parameters were as follows: TR/TE: 7800/65 ms; Slice thickness: 4 mm; Matrix size: 160 × 125; Field of view: 400 mm × 400 mm; b 2 Image processing and data analyses All image processing was performed on a dedicated workstation, BD score (PixSpace, Ltd., Fukuoka, Japan), which is certified as a medical device in Japan. An ADC map was generated from DWI acquired with b b b b 19 The software automatically extracted high-signal intensity areas from the DWI data in three dimensions (3D). Subsequently, on the maximum intensity projection images, the initial automated segmentation was manually edited to exclude non-tumorous hyperintense structures, thereby isolating the final tumor volume for analysis. On the BD score display, the first ADC range (0.3-1.0 × 10 -3 -3 -3 1 Figure 1  Workflow of semi-automated three dimensions tumor segmentation using BD score software. -3 -3 -3 Radiomics feature extraction For each of the 70 patients, texture analysis was performed on ADC, DWI ( b b b For histogram parameters, we calculated first-order statistics including mean, median, maximum, minimum, upper quartile value, lower quartile value, skewness, kurtosis, and entropy to describe global intensity distribution. For GLCM features, we captured second-order spatial relationships between voxels. GLCMs were computed at a distance of 1 voxel across four direction angles (0°, 45°, 90°, and 135°); the final feature values were averaged across these directions to ensure rotational invariance (see Parekh and Jacobs[ 20 Feature selection and model construction In this study, we initially selected a total of 76 radiomics features. Recognizing that not all features would be equally suitable for evaluation due to irrelevance or redundancy, we applied a feature selection process to retain only the most informative variables, thereby reducing dimensionality and improving model performance. To enhance model stability and generalizability, feature selection was conducted in two sequential steps. First, we performed the Mann-Whitney U Following feature selection, the retained features were standardized using the StandardScaler method to ensure consistent scaling across all variables. Subsequently, machine learning models were constructed utilizing the AutoGluon framework ( https://github.com/autogluon/autogluon The entire model development process was embedded within a nested cross-validation framework to prevent overfitting and ensure robust generalization performance. Stratified sampling was applied throughout the cross-validation procedures to preserve the class distribution of the outcome variable pCR. Inner cross-validation (5-fold, repeated 10 times) was used for feature selection and hyperparameter tuning. Outer cross-validation (5-fold, repeated 5 times), also stratified, was performed to assess the generalization performance of the models. For each outer loop, predicted probabilities of pCR were calculated, and the average of the five predictions per sample was used as the final prediction score. All machine learning procedures were conducted using Python 3.10.12 with AutoGluon 1.3.1. The summary of the processing is shown in Figure 2 Figure 2  Schematic of the nested cross-validation framework for model development and evaluation. Statistical analysis Continuous variables were presented as their median (range). For comparing differences between the pCR group and the non-pCR group, we utilized the Mann-Whitney U χ 2 P RESULTS Patient characteristics and pathological response to CRT The study population comprised 70 patients with ESCC (60 men and 10 women) with a median age of 66 years (range, 45-78 years). Baseline demographic and clinical characteristics are summarized in Table 1 vs P 3 1 Figure 3  Kaplan-Meier curves for relapse-free survival. b n n vs P n n vs P n n vs P Table 1 Demographic and clinical factors in pathological complete response and non-pathological complete response groups   All ( n  pCR ( n  Non-pCR ( n   P Age, median (range) 66 (45-78) 64 (52-76) 66 (45-78) 0.97 Gender Male/female 60/10 12/3 48/7 0.48 Tumor site Cervical/upper/middle/lower 5/14/33/18 1/5/6/3 4/9/27/15 0.60 TNM staging cT1/2/3/4 0/2/19/49 0/0/3/12 0/2/16/37 0.56 cN0/1/2/3 1/17/29/23 0/1/5/9 1/16/24/14 0.06 cStage I/II/III/IVA 0/0/10/60 0/0/0/15 0/0/10/45 0.075 Total radiation dose 40 Gy/up to 60 Gy 59/11 11/4 48/7 0.19 pCR: Pathological complete response; TNM: Tumor node metastasis. Predictive performance of single radiomics features for pCR Among the 76 individual radiomics features, ADC skewness demonstrated the highest predictive performance for pCR, with an area under the curve (AUC) of 0.77. Following in descending order of performance were GLCM entropy ( b b b b 2 Table 2 Predictive performance and receiver operating characteristic curve analyses of the five radiomics features with the highest area under the curve values and the best performing artificial intelligence-based machine-learning model for pathological complete response   AUC  Sensitivity  Specificity  Accuracy  Cut off  95%CI   P ADC skewness 0.77 0.67 0.82 0.79 0.37 0.61-0.88 0.005 GLCM entropy ( b 0.76 0.87 0.62 0.67 9.28 0.64-0.85 0.002 GLCM autocorrelation ( b 0.76 0.53 0.93 0.84 5276.1 0.60-0.87 0.009 Skewness ( b 0.73 0.87 0.42 0.64 0.72 0.61-0.84 0.006 Kurtosis ( b 0.72 0.73 0.64 0.66 5.05 0.55-0.82 0.005 Machine learning radiomics model 0.85 0.80 0.85 0.81 NA 0.73-0.93 < 0.001 AUC: Area under the curve; CI: Confidence interval; ADC: Apparent diffusion coefficient; GLCM: Gray-level co-occurrence matrix; NA: Not applicable. Prognostic value of single radiomics features Univariate and multivariate Cox regression analyses were performed to identify prognostic factors for RFS among both radiomics and pathological features (Table 3 Table 3 Univariate and multivariate Cox regression analyses for relapse-free survival  Univariate  Multivariate  HR  95%CI   P  HR  95%CI   P Radiomics features ADC skewness 0.42 0.16-1.09 0.076 GLCM entropy ( b 0.25 0.11-0.56 0.001 0.32 0.14-0.75 0.009 GLCM autocorrelation ( b 2.00 0.61-6.57 0.25 Skewness ( b 0.60 0.29-1.22 0.16 Kurtosis ( b 0.76 0.37-1.54 0.45 Pathological features pT3 vs 1.08 0.54-2.18 0.82 pN + vs 3.14 1.48-6.63 0.003 2.20 1.00-4.80 0.042 Grade 3 or 2 vs 0.50 0.25-1.01 0.054 ADC: Apparent diffusion coefficient; GLCM: Gray-level co-occurrence matrix; pN: Positive lymph node status; HR: Hazard ratio; CI: Confidence interval. In the univariate analysis, GLCM entropy ( b P vs P To assess the independent prognostic value of these variables, features found to be significant in the univariate analysis were included in a multivariate Cox regression model. The multivariate analysis confirmed that GLCM entropy ( b P P b vs P 3 Predictive value of machine learning model A two-step feature selection process (Mann-Whitney U b b b The best-performing model, KNeighborsDist_BAG_L1, achieved an AUC of 0.85, sensitivity of 0.80, specificity of 0.85, and accuracy of 0.81, as summarized in Table 2 In Kaplan-Meier analysis, the predicted pCR-positive group ( n n vs P 3 DISCUSSION In this study, we developed and validated a model to predict pCR in patients with ESCC following nCRT. Our study is characterized by a novel approach that combines semi-automated 3D tumor segmentation of pre-treatment MRI-DWI images with an automated machine learning framework for pCR prediction, allowing for highly reproducible and accurate prediction of treatment response. The resulting machine learning radiomics model achieved a high predictive performance, with the best-performing model yielding an AUC of 0.85. These results demonstrate the potential of this semi-automated 3D radiomics approach as a non-invasive biomarker, enabling the construction of optimal treatment strategies for each patient. DWI and its quantitative value, ADC are established techniques for evaluating tumor cellularity and microstructural integrity. The utility of pre-treatment ADC values as a predictive biomarker for nCRT response in ESCC has been investigated, but the results remain controversial. A systematic review by Vollenbrock et al 21 14 7 22 In this study, ADC skewness was the most powerful single predictor of pCR (AUC = 0.77), strongly reinforcing the findings of our previous report[ 4 4 23 24 Furthermore, our study identified GLCM entropy ( b 25 26 In this study, we utilized the automated machine learning framework, AutoGluon, to comprehensively analyze a multitude of radiomics features, thereby constructing a model with highly accurate pCR predictive performance. This AI technique automates algorithm selection and hyperparameter tuning, which is particularly advantageous for radiomics analysis that characteristically involves many features. This approach is particularly valuable as it reduces researcher bias in model selection and allows for a more extensive exploration of models than manual methods permit, thus enhancing the objectivity and reproducibility of the final predictive model[ 27 Previous machine learning-based radiomics studies for predicting pCR in ESCC following nCRT have primarily focused on CT and FDG-PET. For example, Yang et al 12 et al 11 et al 28 et al 29 Radiomics studies using MRI to predict treatment response in esophageal cancer following nCRT remain limited, but reports on its application have emerged in recent years. For example, Lu et al 30 et al 15 et al 16 Our machine learning model achieved an AUC of 0.85, demonstrating a pCR prediction accuracy comparable to these previous reports. Although MRI has limitations, such as susceptibility to motion artifacts and longer scanning times, it remains a highly valuable non-invasive biomarker compared with CT and PET, as it is free from radiation exposure and does not require contrast agents. Furthermore, our study differs from previous reports in that it incorporates semi-automated 3D segmentation of the entire tumor. We believe this approach increases the reliability and clinical value of our findings. The prognostic value of our model is further highlighted by the significantly better RFS observed in the predicted pCR-positive group compared to the predicted non-pCR group (5-year RFS: 73.1% vs P This study has several limitations. First, this was a retrospective, single-center study. This design is susceptible to selection bias and limits the generalizability of our findings. Therefore, a large-scale, prospective, multicenter validation study is required to confirm the robustness and clinical utility of our model. Second, the sample size of our cohort was relatively small, which prevented us from creating a separate hold-out test set. Although we employed a nested cross-validation framework to mitigate overfitting, it will be necessary in the future to validate the model using a larger dataset that can be split into training and test sets, in order to improve its performance and stability. Third, radiomics features are known to be sensitive to imaging parameters. For reproducibility and reliability, the consensus and standardization of DWI protocols should be considered for future applications. Additionally, although we used a semi-automated 3D segmentation method to enhance objectivity, the manual editing step may still be subject to some degree of inter-observer variability. To address this limitation, we are currently developing a fully automated segmentation technique. CONCLUSION In conclusion, we developed an AI-based radiomics model using pre-treatment MRI to predict pCR in ESCC patients following nCRT. The model demonstrated high predictive accuracy, confirming its potential as a non-invasive biomarker. This approach could ultimately enhance clinical decision-making for personalized medicine and contribute to improved patient outcomes.  Institutional review board statement:  Informed consent statement:  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Zhao YX Zhao HP Zhao MY Yu Y Qi X Wang JH Lv J Latest insights into the global epidemiological features, screening, early diagnosis and prognosis prediction of esophageal squamous cell carcinoma World J Gastroenterol 2024 30 2638 2656 38855150 10.3748/wjg.v30.i20.2638 PMC11154680 2 Kato K Machida R Ito Y Daiko H Ozawa S Ogata T Hara H Kojima T Abe T Bamba T Watanabe M Kawakubo H Shibuya Y Tsubosa Y Takegawa N Kajiwara T Baba H Ueno M Takeuchi H Nakamura K Kitagawa Y JCOG1109 investigators Doublet chemotherapy, triplet chemotherapy, or doublet chemotherapy combined with radiotherapy as neoadjuvant treatment for locally advanced oesophageal cancer (JCOG1109 NExT): a randomised, controlled, open-label, phase 3 trial Lancet 2024 404 55 66 38876133 10.1016/S0140-6736(24)00745-1 3 Duan X Yue J Wang S Zhao F Zhang W Qie S Jiang H Prognostic role of the pathological status following neoadjuvant chemoradiotherapy and surgery in esophageal squamous cell carcinoma BMC Cancer 2025 25 61 39794758 10.1186/s12885-025-13465-w PMC11720621 4 Hirata A Hayano K Ohira G Imanishi S Hanaoka T Murakami K Aoyagi T Shuto K Matsubara H Volumetric histogram analysis of apparent diffusion coefficient for predicting pathological complete response and survival in esophageal cancer patients treated with chemoradiotherapy Am J Surg 2020 219 1024 1029 31387687 10.1016/j.amjsurg.2019.07.040 5 Fokkinga E Hernandez-Tamames JA Ianus A Nilsson M Tax CMW Perez-Lopez R Grussu F Advanced Diffusion-Weighted MRI for Cancer Microstructure Assessment in Body Imaging, and Its Relationship With Histology J Magn Reson Imaging 2024 60 1278 1304 38032021 10.1002/jmri.29144 6 Hayano K Ohira G Hirata A Aoyagi T Imanishi S Tochigi T Hanaoka T Shuto K Matsubara H Imaging biomarkers for the treatment of esophageal cancer World J Gastroenterol 2019 25 3021 3029 31293338 10.3748/wjg.v25.i24.3021 PMC6603816 7 Lambin P Leijenaar RTH Deist TM Peerlings J de Jong EEC van Timmeren J Sanduleanu S Larue RTHM Even AJG Jochems A van Wijk Y Woodruff H van Soest J Lustberg T Roelofs E van Elmpt W Dekker A Mottaghy FM Wildberger JE Walsh S Radiomics: the bridge between medical imaging and personalized medicine Nat Rev Clin Oncol 2017 14 749 762 28975929 10.1038/nrclinonc.2017.141 8 Watanabe H Hayano K Ohira G Imanishi S Hanaoka T Hirata A Kano M Matsubara H Quantification of Structural Heterogeneity Using Fractal Analysis of Contrast-Enhanced CT Image to Predict Survival in Gastric Cancer Patients Dig Dis Sci 2021 66 2069 2074 32691383 10.1007/s10620-020-06479-w 9 Wesdorp NJ Hellingman T Jansma EP van Waesberghe JTM Boellaard R Punt CJA Huiskens J Kazemier G Advanced analytics and artificial intelligence in gastrointestinal cancer: a systematic review of radiomics predicting response to treatment Eur J Nucl Med Mol Imaging 2021 48 1785 1794 33326049 10.1007/s00259-020-05142-w PMC8113210 10 Hou Z Ren W Li S Liu J Sun Y Yan J Wan S Radiomic analysis in contrast-enhanced CT: predict treatment response to chemoradiotherapy in esophageal carcinoma Oncotarget 2017 8 104444 104454 29262652 10.18632/oncotarget.22304 PMC5732818 11 Murakami Y Kawahara D Tani S Kubo K Katsuta T Imano N Takeuchi Y Nishibuchi I Saito A Nagata Y Predicting the Local Response of Esophageal Squamous Cell Carcinoma to Neoadjuvant Chemoradiotherapy by Radiomics with a Machine Learning Method Using (18)F-FDG PET Images Diagnostics (Basel) 2021 11 1049 34200332 10.3390/diagnostics11061049 PMC8227132 12 Yang Z He B Zhuang X Gao X Wang D Li M Lin Z Luo R CT-based radiomic signatures for prediction of pathologic complete response in esophageal squamous cell carcinoma after neoadjuvant chemoradiotherapy J Radiat Res 2019 60 538 545 31111948 10.1093/jrr/rrz027 PMC6640907 13 Hou Z Li S Ren W Liu J Yan J Wan S Radiomic analysis in T2W and SPAIR T2W MRI: predict treatment response to chemoradiotherapy in esophageal squamous cell carcinoma J Thorac Dis 2018 10 2256 2267 29850130 10.21037/jtd.2018.03.123 PMC5949509 14 Li Z Han C Wang L Zhu J Yin Y Li B Prognostic Value of Texture Analysis Based on Pretreatment DWI-Weighted MRI for Esophageal Squamous Cell Carcinoma Patients Treated With Concurrent Chemo-Radiotherapy Front Oncol 2019 9 1057 31681593 10.3389/fonc.2019.01057 PMC6811607 15 Liu Y Wang Y Hu X Wang X Xue L Pang Q Zhang H Ma Z Deng H Yang Z Sun X Men Y Ye F Men K Qin J Bi N Zhang J Wang Q Hui Z Multimodality deep learning radiomics predicts pathological response after neoadjuvant chemoradiotherapy for esophageal squamous cell carcinoma Insights Imaging 2024 15 277 39546168 10.1186/s13244-024-01851-0 PMC11568088 16 Liu Y Wang Y Wang X Xue L Zhang H Ma Z Deng H Yang Z Sun X Men Y Ye F Men K Qin J Bi N Wang Q Hui Z MR radiomics predicts pathological complete response of esophageal squamous cell carcinoma after neoadjuvant chemoradiotherapy: a multicenter study Cancer Imaging 2024 24 16 38263134 10.1186/s40644-024-00659-x PMC10804642 17 Rice TW Patil DT Blackstone EH 8th edition AJCC/UICC staging of cancers of the esophagus and esophagogastric junction: application to clinical practice Ann Cardiothorac Surg 2017 6 119 130 28447000 10.21037/acs.2017.03.14 PMC5387145 18 Doki Y Tanaka K Kawachi H Shirakawa Y Kitagawa Y Toh Y Yasuda T Watanabe M Kamei T Oyama T Seto Y Murakami K Arai T Muto M Mine S Japanese Classification of Esophageal Cancer, 12th Edition: Part II Esophagus 2024 21 216 269 38512393 10.1007/s10388-024-01048-w PMC11199314 19 Blackledge MD Leach MO Collins DJ Koh DM Computed diffusion-weighted MR imaging may improve tumor detection Radiology 2011 261 573 581 21852566 10.1148/radiol.11101919 20 Parekh V Jacobs MA Radiomics: a new application from established techniques Expert Rev Precis Med Drug Dev 2016 1 207 226 28042608 10.1080/23808993.2016.1164013 PMC5193485 21 Vollenbrock SE Voncken FEM Bartels LW Beets-Tan RGH Bartels-Rutten A Diffusion-weighted MRI with ADC mapping for response prediction and assessment of oesophageal cancer: A systematic review Radiother Oncol 2020 142 17 26 31431376 10.1016/j.radonc.2019.07.006 22 Gillies RJ Kinahan PE Hricak H Radiomics: Images Are More than Pictures, They Are Data Radiology 2016 278 563 577 26579733 10.1148/radiol.2015151169 PMC4734157 23 Driessen JP Caldas-Magalhaes J Janssen LM Pameijer FA Kooij N Terhaard CH Grolman W Philippens ME Diffusion-weighted MR imaging in laryngeal and hypopharyngeal carcinoma: association between apparent diffusion coefficient and histologic findings Radiology 2014 272 456 463 24749712 10.1148/radiol.14131173 24 Surov A Meyer HJ Wienke A Associations between apparent diffusion coefficient (ADC) and KI 67 in different tumors: a meta-analysis. Part 1: ADC(mean) Oncotarget 2017 8 75434 75444 29088879 10.18632/oncotarget.20406 PMC5650434 25 Werner RA Ilhan H Lehner S Papp L Zsótér N Schatka I Muegge DO Javadi MS Higuchi T Buck AK Bartenstein P Bengel F Essler M Lapa C Bundschuh RA Pre-therapy Somatostatin Receptor-Based Heterogeneity Predicts Overall Survival in Pancreatic Neuroendocrine Tumor Patients Undergoing Peptide Receptor Radionuclide Therapy Mol Imaging Biol 2019 21 582 590 30014345 10.1007/s11307-018-1252-5 26 Pellegrino S Panico M Bologna R Morra R Servetto A Bianco R Del Vecchio S Fonti R Texture Analysis of 68Ga-DOTATOC PET/CT Images for the Prediction of Outcome in Patients with Neuroendocrine Tumors Biomedicines 2025 13 1286 40564005 10.3390/biomedicines13061286 PMC12189759 27 Lin S Ma Z Yao Y Huang H Chen W Tang D Gao W Automatic machine learning accurately predicts the efficacy of immunotherapy for patients with inoperable advanced non-small cell lung cancer using a computed tomography-based radiomics model Diagn Interv Radiol 2025 31 130 140 39817633 10.4274/dir.2024.242972 PMC11880869 28 Li Z Wang F Zhang H Xie S Peng L Xu H Wang Y A radiomics strategy based on CT intra-tumoral and peritumoral regions for preoperative prediction of neoadjuvant chemoradiotherapy for esophageal cancer Eur J Surg Oncol 2024 50 108052 38447320 10.1016/j.ejso.2024.108052 29 Zhang Z Luo T Yan M Shen H Tao K Zeng J Yuan J Fang M Zheng J Bermejo I Dekker A Ruysscher D Wee L Zhang W Jiang Y Ji Y Voxel-level radiomics and deep learning for predicting pathologic complete response in esophageal squamous cell carcinoma after neoadjuvant immunotherapy and chemotherapy J Immunother Cancer 2025 13 e011149 40090670 10.1136/jitc-2024-011149 PMC11911808 30 Lu S Wang C Liu Y Chu F Jia Z Zhang H Wang Z Lu Y Wang S Yang G Qu J The MRI radiomics signature can predict the pathologic response to neoadjuvant chemotherapy in locally advanced esophageal squamous cell carcinoma Eur Radiol 2024 34 485 494 37540319 10.1007/s00330-023-10040-4 Data sharing statement Technical appendix, statistical code, and dataset available from the corresponding author at hayatin1973@yahoo.co.jp ",
  "metadata": {
    "Title of this paper": "The MRI radiomics signature can predict the pathologic response to neoadjuvant chemotherapy in locally advanced esophageal squamous cell carcinoma",
    "Journal it was published in:": "World Journal of Gastroenterology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476672/"
  }
}