{
  "title": "Paper_602",
  "abstract": "pmc BMC Cancer BMC Cancer 16 bmccanc BMC Cancer 1471-2407 BMC PMC12482237 PMC12482237.1 12482237 12482237 41023956 10.1186/s12885-025-14940-0 14940 1 Research Reviewing the lines of therapy-concept in cancer treatment: a survey study among physicians Falchetto Lisa M. M. 1 Bender Bernd bernd.bender@dkfz-heidelberg.de 1 2 Erhard Ian 1 2 Andreas Stefanie 1 2 Schumann Linnea L. I. 1 Schnorr Isabel 1 Berger-Thürmel Karin 4 5 6 Vehreschild Jörg Janne 1 3 7 Maier Daniel 1 2 1 https://ror.org/04cvxnb49 grid.7839.5 0000 0004 1936 9721 Goethe University Frankfurt, Faculty of Medicine, Institute for Digital Medicine and Clinical Data Sciences, 2 https://ror.org/02pqn3g31 0000 0004 7865 6683 German Cancer Consortium (DKTK), Partner Site Frankfurt/Mainz, a partnership between DKFZ and University Medicine Frankfurt, 3 https://ror.org/00rcxh774 grid.6190.e 0000 0000 8580 3777 Department I for Internal Medicine, University of Cologne, Faculty of Medicine and University Hospital Cologne, 4 https://ror.org/05591te55 grid.5252.0 0000 0004 1936 973X Department of Medicine III, University Hospital, Ludwig-Maximilians-University of Munich, 5 6 https://ror.org/02pqn3g31 0000 0004 7865 6683 German Cancer Consortium (DKTK), Partner Site Munich a Partnership Between DKFZ and LMU University Hospital, 7 https://ror.org/028s4q594 grid.452463.2 German Centre for Infection Research (DZIF), Partner Site Bonn-Cologne, 29 9 2025 2025 25 478185 1439 14 7 2025 26 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background While the line of therapy (LOT) concept is crucial for clinical decision-making in oncology, the concept lacks a consensual understanding bearing the risk of miscommunication. This study examines physicians’ understanding of LOT, its perceived relevance, and the events and actions that determine a change of LOT within German oncological networks. Methods Employing a snowball sampling approach, an anonymous online-administered survey was conducted among German physicians with oncological experience. Descriptive statistics and consensus metrics (Gini Mean Difference [GMD] and normalized entropy) were used to summarize the survey results and the relative agreement among the respondents, respectively. Results Sixty physicians completed the survey. The majority were permanent members of an oncological tumor board (N = 46; 76.7%) and worked as a chief or senior physician ( N N N N N N Conclusions This study reveals both commonalities and inconsistencies in physicians’ understanding of LOT in cancer treatment in Germany. Findings support the need for a greater standardization or refinement of the LOT concept which could help to minimize clinical misunderstandings and may enhance patient treatment strategies. Supplementary Information The online version contains supplementary material available at 10.1186/s12885-025-14940-0. Keywords Lines of therapy Cancer treatment Therapy planning Survey study Agreement Deutsches Krebsforschungszentrum (DKFZ) (1052) Open Access funding enabled and organized by Projekt DEAL. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Accurately determining a patient’s line of therapy (LOT) is crucial for planning subsequent anticancer treatment or assessing eligibility for clinical trials [ 1 2 3 4 5 In clinical trials, lines of therapy (LOTs) have been defined for specific cancer entities such as multiple myeloma [ 1 2 6 7 1 8 4 9 1 4 6 7 2 6 10 12 13 15 In medical data science, LOT is often treated as a retrospectively derivable algorithmic concept, e.g., for annotating LOT in electronic health records. Rules delineate LOT based on changes in anti-neoplastic medication and timing of administration, regardless of disease characteristics or treatment guidelines [ 16 18 19 24 Comparing these research strands reveals LOT’s contextual insufficiencies. An interview-based expert review by Falchetto et al. noted contested aspects, including uncertainties about systemic maintenance therapies and local interventions [ 5 4 21 23 This survey study aims to determine how physicians in clinical oncology define a LOT and identify the specific therapeutic events they consider to mark a transition from one LOT to the next. It focuses on elements of the LOT concept previously noted as ambiguous, such as the classification of maintenance therapy, local interventions, or partial regimen changes, and analyzes how oncologists interpret and categorize these situations. The findings are intended to inform the development of a more consistent, comprehensive, and clinically applicable LOT definition. Methods Participants The survey study targeted physicians practicing either in oncology or in another medical or surgical discipline with oncological patients. Respondents were recruited through scientific networks (i.e., German Cancer Consortium, [ German : Deutsches Konsortium für Translationale Krebsforschung German : Onkologisches Forschungsdatenzentrum German: Deutsche Gesellschaft für Hämatologie und Medizinische Onkologie 25 26 Survey design A questionnaire with a total of 50 questions was designed by multiple researchers with disciplinary backgrounds in medicine and social sciences. Questionnaire development was based on a qualitative study that involved a review of the relevant literature and a content analysis of interviews with expert senior physicians [ 5 Regarding the latter, fictitious patient scenarios were illustrated, involving maintenance therapy and different therapy modalities to assess their role in the change of LOT (e.g. “To what extent do the following therapeutic modalities […] represent a separate line of therapy? Surgery”, response scale: “Always”, “Mostly”, “Partially”, “Only in individual cases”, “Never”, “Cannot judge”, “I am not sure”). Finally, the survey explored the role of local therapies and therapy interruptions exemplified in various hypothetical scenarios. The complete questionnaire is provided in Additional file A. Before launching the survey, the questionnaire was piloted by two physicians working in the field, including one trained oncologist, to test its practicability. The survey was conducted anonymously and was accessible via the online survey tool LimeSurvey (Version 3.28.9) from March to early June 2023. An access link to the questionnaire was distributed to the consortia and groups named above in March and a reminder was sent in April 2023 to recruit additional participants. Ethics approval was obtained after review by the Ethics Committee of the Goethe University Frankfurt under reference number 274/18 and project number UCT-13–2022. Data processing and analysis For data cleaning and preprocessing, the statistical programming language R (Version 4.2.2) and RStudio (Version 2023.12.1) were used. Absolute and relative frequencies for all variables of the survey were calculated and reported. Missing values were excluded from calculations. Agreement among respondents was evaluated question-by-question, with separate analyses for binary, ordinal, and categorical (non-binary, non-ordinal) variables due to differing suitability of agreement measures. For binary questions, affirmative response proportions, Clopper-Pearson (CP) 95%-confidence intervals (CIs) [ 27 28 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$0$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$1$$\\end{document} The Gini mean difference (GMD) [ 29 31 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\left[\\text{0,1}\\right]$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$0$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$2/3$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$1$$\\end{document} For categorical questions, NE [ 28 32 A Benjamini-Hochberg (BH) correction [ 33 Results Respondents’ professional background and socio-demographics As part of the data processing, two respondents were excluded because their answers indicated they were not part of the target population. Twenty-nine questionnaires were excluded since only socio-demographic information had been provided. A total of 60 physicians either specialized in oncology or another medical or surgical discipline with a focus on oncological patients (e.g. neuro-oncology, thoracic oncology) participated in the survey. Most participants stated to be specialized in hematology/oncology (N = 42/60; 70.0%) and were permanent members of an oncological tumor board (N = 46/60; 76.7%). The majority was between 36 and 55 years old (N = 42/60; 70.0%) and more than a third had 21 or more years of professional experience (N = 22/60; 36.7%). Additionally, more than half of the physicians worked as a chief or senior physician (N = 37/60; 61.7%) (Table 1 Table 1 Personal and professional background of survey respondents Personal and professional background N (Percentages) Age group 25 or younger 0 (0.0%) 26–35 9 (15.0%) 36–45 21 (35.0%) 46–55 21 (35.0%) 56–65 8 (13.3%) 66 or older 1 (1.7%) Professional experience None 0 (0.0%) 2 years or less 2 (3.3%) 3–5 years 7 (11.7%) 6–10 years 6 (10.0%) 11–15 years 13 (21.7%) 16–20 years 10 (16.7%) 21 years or more 22 (36.7%) Professional position Assistant physician 9 (15.0%) Specialized physician 14 (23.3%) Chief/senior physician or other leading position 37 (61.7%) Other job title 0 (0.0%) Current department Department of Hematology/Oncology 42 (70.0%) Oncological focus within another specialist area 9 (15.0%) Department in which, among other things, oncological diseases are diagnosed/treated 9 (15.0%) Other 0 (0.0%) Experience with oncological tumor boards Hardly/None 0 (0.0%) I present individual cases (10x/year or less) 4 (6.7%) I regularly present cases (more than 10x/year) 10 (16.7%) I am a permanent member 46 (76.7%) LOT: Definition and relevance The vast majority of physicians ( N N N N Stage of disease and treatment intention Most respondents considered LOT as a relevant concept across various disease stages, i.e. from early stages to locally advanced or metastatic disease (N = 41/60; 68.3%). However, opinions varied highly (GMD: 0.62, 95%-CI = [0.49; 0.76]). A majority of respondents (N = 44/60; 73.3%) considered LOT relevant for both palliative and curative treatment intentions. Nevertheless, differing opinions on this question, led to a low level of agreement in responses (GMD: 0.54, 95%-CI = [0.40; 0.65]). Change of LOT Most respondents stated that primary tumor progression (N = 58/60; 96.7%; NE: 0.21, 95%-CI = [0.04; 0.52]), metastasis occurrence (N = 55/60; 91.7%; NE: 0.41, 95%-CI = [0.18; 0.69]), disease recurrence (N = 52/60; 86.7%; NE: 0.57, 95%-CI = [0.32; 0.80]), and relevant therapy side-effects (N = 46/60; 76.7%; NE: 0.78, 95%-CI = [0.57; 0.94]) indicated changing LOTs. Additionally, more than half of the respondents reported that discontinuation of all previously administered drugs (N = 37/54; 68.5%) equaled a change of LOT. A high NE-value of 0.90 (95%-CI = ([0.71; 0.99]), however, indicated strong disagreement. Furthermore, they predominantly stated that replacing previously administered drugs with different, non-equivalent drugs (N = 47/54; 87.0%; NE: 0.56, 95%-CI = [0.30; 0.81]) was a common practice for changing LOT. The majority of the surveyed physicians (N = 33/54; 61.1%) agreed that adding one or more new drugs to an existing drug regimen is an indicator of changing LOT. However, for this statement, analysis revealed a strong dissension (NE: 0.96, 95%-CI = [0.83; 1.00]) (Table 2 2 Table 2 Agreement on occurring events and actions initiating a change of lines of therapy Valid N N (Percentages) of agreement NE (95%-CI) Which of the following events usually initiate a change of a line of therapy? Progression of the primary tumor 60 58/60 (96.7%) 0.21 [0.04, 0.52] Metastasis of the primary tumor 60 55/60 (91.7%) 0.41 [0.18, 0.69] Occurrence of a recurrence 60 52/60 (86.7%) 0.57 [0.32, 0.80] Occurrence of relevant side-effects 60 46/60 (76.7%) 0.78 [0.57, 0.94] Patient's preference 60 29/60 (48.3%) 1.00 [0.94, 1.00] I cannot judge for any of the given answers 60 0/60 (0.0%) 0.00 [0.00, 0.33] Which of the mentioned measures lead to a change of a line of therapy? Adding one or more new drugs to an existing drug regimen 54 33/54 (61.1%) 0.96 [0.83, 1.00] Discontinuation of one or more drugs from an existing drug regimen 54 22/54 (40.7%) 0.98 [0.85, 1.00] Discontinuation of all drugs administered so far 54 37/54 (68.5%) 0.90 [0.71, 0.99] Replacement of a drug with another drug considered equivalent (from the same class of drugs) 54 9/54 (16.7%) 0.65 [0.40, 0.87] Replacing the currently administered drugs with other drugs 54 47/54 (87.0%) 0.56 [0.30, 0.81] Change in dose 54 9/54 (16.7%) 0.65 [0.40, 0.87] Change in administration interval 54 8/54 (14.8%) 0.61 [0.35, 0.84] Change in the route of administration 54 4/54 (7.4%) 0.38 [0.14, 0.68] Interruption of treatment 54 12/54 (22.2%) 0.76 [0.53, 0.94] I cannot judge this for any of the answers mentioned 60 6/60 (10.0%) 0.47 [0.23, 0.73] Multiple answers were possible. Normalized entropy: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$0$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$1$$\\end{document} Abbreviations CI NE For all events and measures regarding the change of LOT, the proportions of affirmative responses and CP CIs are detailed and illustrated in Figure D.1 and Table D.1 in Additional file D. Fig. 1 Descriptive and consensus results (95%-CIs) regarding maintenance therapy with reduced drug regimen or new drugs ( a b c \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$0$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$2/3$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$1$$\\end{document} B1 Maintenance therapy A great part of the respondents (N = 42/54; 77.8%) agreed or tended to agree that maintenance therapy typically involves a reduced regimen of previously administered drugs but may also include new drugs. However, there was considerable heterogeneity across survey participants on this statement (GMD: 0.49, 95%-CI = [0.32; 0.63]). The majority (N = 40/54; 74.1%; GMD: 0.48, 95%-CI = [0.33; 0.60]) agreed that reduced regimen, initiated following systemic therapy, is part of an existing LOT. Conversely, two-third of physicians (N = 36/54; 66.7%; GMD: 0.61, 95%-CI = [0.46; 0.77]) did not consider the introduction of a new drug in systemic therapy as indicative of a LOT change. The results of all descriptive statistics and GMD values including CIs for all questions regarding maintenance therapy are visualized in Fig. 1 Therapy modality For most respondents, surgery (N = 20/54; 37.0%; GMD: 0.55, 95%-CI = [0.43; 0.64]) as well as radiotherapy (N = 23/54; 42.6%; GMD: 0.47, 95%-CI = [0.35; 0.57]) only partially constituted separate LOTs. A majority (N = 42/54; 77.8%; GMD: 0.36, 95%-CI = [0.17; 0.53]) approved that both radiotherapy and chemotherapy are essential to the LOT in cases of radiochemotherapy (Figure 2D in Additional file D). Fig. 2 Descriptive and consensus results (95%-CIs) regarding local therapies in the midst of a systemic therapy ( a b c \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$0$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$1$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$1$$\\end{document} Respondents further indicated that local therapy during systemic therapy is part of the ongoing LOT (N = 31/54; 57.4%; NE: 0.85, 95%-CI = [0.61; 0.95]). Opinions varied on local therapy post-systemic therapy: 27.8% (N = 15/54) considered local therapy as part of the previous LOT, 33.3% (N = 18/54) viewed it as the start of a new LOT, and 31.5% (N = 17/54) believed it does not impact the LOT status (NE: 1.00, 95%-CI = [0.91; 1.00]) (Fig. 2 Therapy interruption In cases where therapy was interrupted for either 30 or 180 days across low- and high-grade tumors, most respondents indicated that the LOT remains unchanged post-interruption (30 days, low-grade: N = 50/53; 94.3%; GMD: 0.11, 95%-CI = [0.00; 0.24]; 180 days, low-grade: N N However, if there was an interruption between two different therapies, either because of a therapy-free period in between (N = 46/52; 88.5%; GMD: 0.09, 95%-CI = [0.00; 0.19]) or due to progression or recurrence ( N 3 3 Table 3 Response behaviour regarding therapy interruptions in relation to lines of therapy based on hypothetical cases Question Response categories N (%) Valid N for calculating GMD GMD (95%-CI) 30-day therapy interruption between the same therapy for low-grade tumors The LOT remains the same after the interruption 50 (94.3%) 53 0.11 [0.00, 0.24] The LOT changes after the interruption 1 (1.9%) I am not sure 2 (3.8%) I cannot judge 0 (0.0%) N total 53 (100.0%) 180-day therapy interruption between the same therapy for low-grade tumors The LOT remains the same after the interruption 30 (56.6%) 51 0.65 [0.49, 0.92] The LOT changes after the interruption 12 (22.6%) I am not sure 9 (17.0%) I cannot judge 2 (3.8%) N total 53 (100.0%) 30-day therapy interruption between the same therapy for high-grade tumors The LOT remains the same after the interruption 44 (83.0%) 52 0.31 [0.11, 0.49] The LOT changes after the interruption 4 (7.6%) I am not sure 4 (7.6%) I cannot judge 1 (1.9%) N total 53 (100.0%) 180-day therapy interruption between the same therapy for high-grade tumors The LOT remains the same after the interruption 24 (46.2%) 49 0.83 [0.60, 0.99] The LOT changes after the interruption 15 (28.9%) I am not sure I cannot judge N total 10 (19.2%) 3 (5.8%) 52 (100.0%) Therapy interruption between two different therapies The LOT remains the same after the interruption 0 (0.0%) 49 0.09 [0.00, 0.19] The LOT changes after the interruption 46 (88.5%) I am not sure 3 (5.8%) I cannot judge 3 (5.8%) N total 52 (100.0%) Therapy interruption during therapy due to tumor progression/recurrence The LOT remains the same after the interruption 20 (38.5%) 51 0.99 [0.66, 1.00] The LOT changes after the interruption 25 (48.1%) I am not sure 6 (11.5%) I cannot judge 1 (1.9%) N total 52 (100.0%) Therapy interruption between two different therapies due to tumor progression/recurrence The LOT remains the same after the interruption 2 (3.9%) 52 0.14 [0.00, 0.29] The LOT changes after the interruption 49 (94.2%) I am not sure 1 (1.9%) I cannot judge 0 (0.0%) N total 52 (100.0%) The value \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$0$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$2/3$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$1$$\\end{document} Abbreviations CI GMD LOT LOTs All non-standardized GMD-values for the various thematic blocks are listed in Table D.2 in Additional file D. Discussion To our knowledge, this is the first survey study with oncological focus to assess physicians’ understandings of the “line of therapy”-concept regarding its defining criteria for change of LOT. Therefore, we have drawn on the expertise of a larger group of physicians with oncological expertise in Germany. Responses are based on many years of clinical experience and therefore provide significant insights on the topic. Our study underscores that the majority of physicians consider LOT as a relevant concept for their oncological practice. Most respondents confirmed a current lack of universal applicable definitions, which was mirrored by heterogenous assessment of specific situations assessed in our study. Our results highlight significant and concrete uncertainties concerning specific criteria and parameters relevant for the definition and operationalization of the LOT concept. Ambiguous response patterns prevailed, for example, concerning the relevance of various therapy modalities within a patient’s course of treatment. The surveyed example cases have put forth the ambiguous nature of the LOT concept with respect to, e.g., the role of local therapies or treatment interruptions. For instance, while a local therapy during a systemic therapy was considered as part of an ongoing LOT, a local therapy after a systemic therapy was rated by over a third of respondents as start of a new LOT. The ambiguity of treatment interruptions was indicated by the influence of progression or recurrence during the interruption on LOT, whereas duration alone did not affect LOT. Based on our findings, future research should aim to explicitly operationalize these criteria related to specific therapeutic constellations and disease entities in question. In summary, our results show that LOT are considered relevant in German oncological networks with respect to palliative and curative treatment intentions, which is in line with findings from an earlier study [ 4 5 8 19 34 Local therapies were only partially considered as separate LOTs, which does not imply local therapies to be irrelevant for LOT definitions. Their exact role in LOT remains unclear, aligning with prior research findings [ 4 6 8 23 24 35 There are limitations that need to be considered regarding the generalizability of our results. First, despite the great effort that went into distributing the questionnaire and reminding the networks to ask for participation repeatedly, the sample size (N = 60) remained relatively small. While a larger sample would imply greater confidence in the results, we deem the sample size sufficiently large for the intended purpose of exploration. Second, the applied snowball sampling method is prone to result in a selection bias which likely impairs the representativity of the results. We deem a sampling bias as very likely with respect to the professional backgrounds of the respondents: the applied snowball-sampling technique led to a respondent sample that overrepresents senior consultants and physicians in leadership positions with extensive professional experience and regular participation in oncological tumor boards. Due to this likely selection bias, we decided against conducting in-depth comparative analyses between demographic and/or professional subgroups which would likely have led to invalid conclusions. Therefore, we hypothesize that the heterogeneity of responses would have been considerably higher if more less experienced physicians would have been participating. In addition, it is possible that language concepts may be interpreted differently in other countries and health systems; since the survey was only spread through German communication channels, transferability to other countries and health systems needs to be confirmed in future studies. To improve generalizability, future studies should try to employ random sampling on a predefined population of physicians and if possible, aim for a comparison across countries. Furthermore, although the questionnaire has been pre-tested, no further validation of the applied scales has been pursued which presents a potential limitation of the applied method. Another possible limitation of the survey study is that participants were asked to rate generic therapeutic concepts, not specific examples. This may have limited their ability to transfer the questions to real-world examples from their respective practice and thus influenced towards stronger abstraction of the answers. However, since we were specifically trying to understand governing principles instead of the assessment of a specific therapeutic situation, we maintain our approach as valid for our objective. In oncology practice, determining LOT is essential for selecting patients’ treatment options, deciding about clinical trial eligibility and quality audit documentation. While treatment guidelines may provide orientation for determining LOT, real-world studies have shown that patient pathways often deviate from these prescribed patterns [ 6 10 Conclusions In conclusion, this study significantly advances the understanding of the complexities in defining and classifying LOTs in cancer treatment and raises the question whether LOT are a reliable means of communicating patient status between physicians. By identifying knowledge gaps and inconsistencies in current definitions and criteria, our results highlight the need for standardizing concepts of LOT. Given that future research corroborates our findings, areas of the agreement (“the common ground”) about LOT can be used as an initial point for a further clarification and disambiguation of the concept. A systematic process (e.g., Delphi-method) could be applied to approximate consensus among experts that, if carried further, might initialize a broader discussion in the scientific and clinical communities. The presumed clinical relevance of LOT lies first and foremost in its predictive value for patient outcomes. Therefore, a re-assessment of the LOT concept and its variants, based on large, socio-demographically and professionally balanced samples, is required to evaluate this predictive potential and should be expanded internationally to compare our findings from Germany with those from other countries. Such a re-assessment should evaluate LOT in comparison to alternative measures of a patient’s therapy status. Such advancements are necessary for improving communication between different care providers, minimizing clinical misunderstandings, optimizing patient treatment strategies, standardizing care procedures across oncology and ultimately improving patient outcomes. Supplementary Information  Supplementary Material 1. Abbreviations LOT Line of therapy LOTs Lines of therapy DKTK German Cancer Consortium OnkoFDZ Oncological Research Data Center DGHO German Society for Hematology and Medical Oncology CP Clopper-Pearson Cis Confidence intervals NE Normalized entropy GMD Gini mean difference CI Confidence interval BH Benjamini-Hochberg FDR False discovery rate Poster presentation. Parts of this study were presented in poster format at the 3rd German Cancer Research Congress 2023 in Heidelberg, Germany. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Lisa M. M. Falchetto and Bernd Bender contributed equally as first authors to this work. Acknowledgements The authors would like to thank all the respondents who participated in the survey for their time and willingness to evaluate the different aspects regarding lines of therapy. We also thank the DKTK Clinical Data Science Group for their support. Authors’ contributions LF was responsible for the conceptualization and the project administration of the study and supported the creation of the survey. BB performed the data curation, analyzed and interpreted the data and wrote the original draft. IE supported the data curation and the analysis of the data as well as the writing process of the original draft. SA, LS, IS and KBT supported the writing process of the original draft. JJV supported the conceptualization and the project administration. DM supported the conceptualization, the project administration, consulted the analysis of the data and supported the writing process of the original draft. All authors read and approved the final manuscript. Funding Open Access funding enabled and organized by Projekt DEAL. This work was partly supported by the German Cancer Consortium (DKTK). The DKTK is funded as one of the National German Health Centers by the German Federal Ministry of Research, Technology and Space (BMFTR). Data availability An anonymized version of the dataset used in this study is available from the corresponding author (Bernd Bender, E-Mail: bernd.bender@dkfz-heidelberg.de) upon reasonable request. Declarations Ethics approval and consent to participate Ethics approval was obtained after review by the Ethics Committee of the Goethe University Frankfurt under reference number 274/18 and project number UCT-13–2022. All procedures performed in this study were in accordance with the ethical standards of the institutional committee, the Helsinki Declaration and its later amendments. Consent for publication Not applicable. Competing Interests SA owns stock in HAVN Life Sciences, Heidelberg Pharma AG and Pfizer, outside the submitted work. LS has received travel compensation from IQVIA, outside the submitted work. JJV has personal fees from Merck/MSD, Gilead, Pfizer, Astellas Pharma, Basilea, German Centre for Infection Research (DZIF), University Hospital Freiburg/Congress and Communication, Academy for Infectious Medicine, University Manchester, German Society for Infectious Diseases (DGI), Ärztekammer Nordrhein, University Hospital Aachen, Back Bay Strategies, German Society for Internal Medicine (DGIM), Shionogi, Molecular Health, Netzwerk Universitätsmedizin, Janssen, NordForsk, Biontech, APOGEPHA and grants from Merck/MSD, Gilead, Pfizer, Astellas Pharma, Basilea, German Centre for Infection Research (DZIF), German Federal Ministry of Education and Research (BMBF), Deutsches Zentrum für Luft- und Raumfahrt (DLR), University of Bristol, Rigshospitalet Copenhagen, outside the submitted work. DM received speaker honoraria from Free University Berlin and travel compensation from IQVIA, outside the submitted work. All remaining authors have nothing to disclose. References 1. Rajkumar S Richardson P San Miguel JF Guidelines for determination of the number of prior lines of therapy in multiple myeloma Blood 2015 126 921 922 10.1182/blood-2015-05-647636 26272048 Rajkumar S, Richardson P, San Miguel JF. Guidelines for determination of the number of prior lines of therapy in multiple myeloma. Blood. 2015;126:921–2. 10.1182/blood-2015-05-647636. 26272048 10.1182/blood-2015-05-647636 2. Davies J Patel M Gridelli C de Marinis F Waterkamp D McCusker ME Real-world treatment patterns for patients receiving second-line and third-line treatment for advanced non-small cell lung cancer: a systematic review of recently published studies PLoS ONE 2017 12 e0175679 10.1371/journal.pone.0175679 28410405 PMC5391942 Davies J, Patel M, Gridelli C, de Marinis F, Waterkamp D, McCusker ME. Real-world treatment patterns for patients receiving second-line and third-line treatment for advanced non-small cell lung cancer: a systematic review of recently published studies. PLoS ONE. 2017;12:e0175679. 10.1371/journal.pone.0175679. 28410405 10.1371/journal.pone.0175679 PMC5391942 3. Wörmann B. Nutzenbewertung von Arzneimitteln der Onkologie und Hämatologie 2013. Eine Standortbestimmung. (ed e.V. DDGfHuMO). In: DGHO Deutsche Gesellschaft für Hämatologie und Medizinische Onkologie e.V., ed. Gesundheitspolitische Schriftenreihe der Deutsche Gesellschaft für Hämatologie und Medizinische Onkologie e.V. (DGHO). Berlin: Deutsche Gesellschaft für Hämatologie und Medizinische Onkologie e.V.; 2013. https://www.dgho.de/publikationen/schriftenreihen/fruehe-nutzenbewertung/dgho_gpsr_arzneimittelnutzenbewertung.pdf 4. Saini KS Twelves C Determining lines of therapy in patients with solid cancers: a proposed new systematic and comprehensive framework Br J Cancer 2021 125 155 163 10.1038/s41416-021-01319-8 33850304 PMC8292475 Saini KS, Twelves C. Determining lines of therapy in patients with solid cancers: a proposed new systematic and comprehensive framework. Br J Cancer. 2021;125:155–63. 10.1038/s41416-021-01319-8. 33850304 10.1038/s41416-021-01319-8 PMC8292475 5. Falchetto L Bender B Erhard I Zeiner KN Stratmann JA Koll FJ Concepts of lines of therapy in cancer treatment: findings from an expert interview-based study BMC Res Notes 2024 17 137 10.1186/s13104-024-06789-6 38750530 PMC11094945 Falchetto L, Bender B, Erhard I, Zeiner KN, Stratmann JA, Koll FJ, et al. Concepts of lines of therapy in cancer treatment: findings from an expert interview-based study. BMC Res Notes. 2024;17:137. 10.1186/s13104-024-06789-6. 38750530 10.1186/s13104-024-06789-6 PMC11094945 6. Bittoni MA Arunachalam A Li H Camacho R He J Zhong Y Real-world treatment patterns, overall survival, and occurrence and costs of adverse events associated with first-line therapies for medicare patients 65 years and older with advanced non–small-cell lung cancer: a retrospective study Clin Lung Cancer 2018 19 e629 e645 10.1016/j.cllc.2018.04.017 29885945 Bittoni MA, Arunachalam A, Li H, Camacho R, He J, Zhong Y, et al. Real-world treatment patterns, overall survival, and occurrence and costs of adverse events associated with first-line therapies for medicare patients 65 years and older with advanced non–small-cell lung cancer: a retrospective study. Clin Lung Cancer. 2018;19:e629–45. 10.1016/j.cllc.2018.04.017. 29885945 10.1016/j.cllc.2018.04.017 7. Hess GP Wang PF Quach D Barber B Zhao Z Systemic therapy for metastatic colorectal cancer: patterns of chemotherapy and biologic therapy use in US medical oncology practice J Oncol Pract 2010 6 301 307 10.1200/JOP.2010.000072 21358960 PMC2988664 Hess GP, Wang PF, Quach D, Barber B, Zhao Z. Systemic therapy for metastatic colorectal cancer: patterns of chemotherapy and biologic therapy use in US medical oncology practice. J Oncol Pract. 2010;6:301–7. 10.1200/JOP.2010.000072. 21358960 10.1200/JOP.2010.000072 PMC2988664 8. OPTUM. Determining lines of therapy (LOT) in oncology in claims databases (White paper). Eden Prairie, Minnesota: OPTUM; 2018. Accessed 8 April 2025. https://www.optum.com/content/dam/optum3/optum/en/resources/white-papers/guidelines-for-determining-lines-of-therapy-whitepaper.pdf 9. Knavel EM Brace CL Tumor ablation: common modalities and general practices Tech Vasc Interv Radiol 2013 16 192 200 10.1053/j.tvir.2013.08.002 24238374 PMC4281168 Knavel EM, Brace CL. Tumor ablation: common modalities and general practices. Tech Vasc Interv Radiol. 2013;16:192–200. 10.1053/j.tvir.2013.08.002. 24238374 10.1053/j.tvir.2013.08.002 PMC4281168 10. Baker K Dunwoodie E Jones RG Newsham A Johnson O Price CP Process mining routinely collected electronic health records to define real-life clinical pathways during chemotherapy Int J Med Inform 2017 103 32 41 10.1016/j.ijmedinf.2017.03.011 28550999 Baker K, Dunwoodie E, Jones RG, Newsham A, Johnson O, Price CP, et al. Process mining routinely collected electronic health records to define real-life clinical pathways during chemotherapy. Int J Med Inform. 2017;103:32–41. 10.1016/j.ijmedinf.2017.03.011. 28550999 10.1016/j.ijmedinf.2017.03.011 11. Kearney M Zhang L Hubscher E Musat M Harricharan S Wilke T Undertreatment in patients with advanced urothelial cancer: systematic literature review and meta-analysis Future Oncol 2024 20 16 1123 1137 10.2217/fon-2023-0298 37526215 PMC11727863 Kearney M, Zhang L, Hubscher E, Musat M, Harricharan S, Wilke T. Undertreatment in patients with advanced urothelial cancer: systematic literature review and meta-analysis. Future Oncol. 2024;20(16):1123–37. 10.2217/fon-2023-0298. 37526215 10.2217/fon-2023-0298 PMC11727863 12. Vyas AM Aroke H Kogut S Guideline-concordant treatment among elderly women with HER2-positive metastatic breast cancer in the United States J Natl Compr Canc Netw 2020 18 4 405 413 10.6004/jnccn.2019.7373 32259787 Vyas AM, Aroke H, Kogut S. Guideline-concordant treatment among elderly women with HER2-positive metastatic breast cancer in the United States. J Natl Compr Canc Netw. 2020;18(4):405–13. 10.6004/jnccn.2019.7373. 32259787 10.6004/jnccn.2019.7373 13. Leaning D Kaur G Morgans AK Ghouse R Mirante O Chowdhury S Treatment landscape and burden of disease in metastatic castration-resistant prostate cancer: systematic and structured literature reviews Front Oncol 2023 13 1240864 10.3389/fonc.2023.1240864 37829336 PMC10565658 Leaning D, Kaur G, Morgans AK, Ghouse R, Mirante O, Chowdhury S. Treatment landscape and burden of disease in metastatic castration-resistant prostate cancer: systematic and structured literature reviews. Front Oncol. 2023;13:1240864. 10.3389/fonc.2023.1240864. 37829336 10.3389/fonc.2023.1240864 PMC10565658 14. Takyar J Raut M Borse R Balakumaran A Sehgal M Relapsed/refractory primary mediastinal large B-cell lymphoma: a structured review of epidemiology, treatment guidelines and real-world treatment practices Expert Rev Hematol 2020 13 3 275 287 10.1080/17474086.2020.1716725 31951774 Takyar J, Raut M, Borse R, Balakumaran A, Sehgal M. Relapsed/refractory primary mediastinal large B-cell lymphoma: a structured review of epidemiology, treatment guidelines and real-world treatment practices. Expert Rev Hematol. 2020;13(3):275–87. 10.1080/17474086.2020.1716725. 31951774 10.1080/17474086.2020.1716725 15. Held N Atallah EL Real-world management of CML: outcomes and treatment patterns Curr Hematol Malig Rep 2023 18 5 167 175 10.1007/s11899-023-00703-w 37395944 Held N, Atallah EL. Real-world management of CML: outcomes and treatment patterns. Curr Hematol Malig Rep. 2023;18(5):167–75. 10.1007/s11899-023-00703-w. 37395944 10.1007/s11899-023-00703-w 16. Wang X Xia R Peng C Wang W Zhu T Yang M RWD28 an innovative algorithm of identifying line of therapy in colorectal cancer Value Health 2022 25 S581 10.1016/j.jval.2022.04.1552 Wang X, Xia R, Peng C, Wang W, Zhu T, Yang M. RWD28 an innovative algorithm of identifying line of therapy in colorectal cancer. Value Health. 2022;25:S581. 10.1016/j.jval.2022.04.1552. 17. Vasudevan A Boyd M Robert N Espirito J PCN233 concordance of clinical vs. algorithm based line of therapy determination in lung cancer Value Health 2021 24 S63 10.1016/j.jval.2021.04.323 Vasudevan A, Boyd M, Robert N, Espirito J. PCN233 concordance of clinical vs. algorithm based line of therapy determination in lung cancer. Value Health. 2021;24:S63. 10.1016/j.jval.2021.04.323. 18. Ailawadhi S Romanus D Shah S Fraeman K Saragoussi D Morris Buus R Development and validation of algorithms for identifying lines of therapy in multiple myeloma using real-world data Future Oncol 2024 20 981 995 10.2217/fon-2023-0696 38231002 Ailawadhi S, Romanus D, Shah S, Fraeman K, Saragoussi D, Morris Buus R, et al. Development and validation of algorithms for identifying lines of therapy in multiple myeloma using real-world data. Future Oncol. 2024;20:981–95. 10.2217/fon-2023-0696. 38231002 10.2217/fon-2023-0696 19. Meng W Ou W Chandwani S Chen X Black W Cai Z Temporal phenotyping by mining healthcare data to derive lines of therapy for cancer J Biomed Inform 2019 100 103335 10.1016/j.jbi.2019.103335 31689549 Meng W, Ou W, Chandwani S, Chen X, Black W, Cai Z. Temporal phenotyping by mining healthcare data to derive lines of therapy for cancer. J Biomed Inform. 2019;100:103335. 10.1016/j.jbi.2019.103335. 31689549 10.1016/j.jbi.2019.103335 20. Bikov KA Mullins CD Seal B Onukwugha E Nader H Algorithm for identifying chemotherapy/biological regimens for metastatic colon cancer in SEER-Medicare Med Care 2015 53 e58 64 10.1097/MLR.0b013e31828fad9f 23552436 Bikov KA, Mullins CD, Seal B, Onukwugha E, Nader H. Algorithm for identifying chemotherapy/biological regimens for metastatic colon cancer in SEER-Medicare. Med Care. 2015;53:e58-64. 10.1097/MLR.0b013e31828fad9f. 23552436 10.1097/MLR.0b013e31828fad9f 21. Carroll N Burniece KM Holzman J McQuillan DB Plata A Ritzwoller DP Algorithm to identify systemic cancer therapy treatment using structured electronic data JCO Clin Cancer Inform 2017 1 1 9 10.1200/CCI.17.00002 30657379 PMC7006900 Carroll N, Burniece KM, Holzman J, McQuillan DB, Plata A, Ritzwoller DP. Algorithm to identify systemic cancer therapy treatment using structured electronic data. JCO Clin Cancer Inform. 2017;1:1–9. 10.1200/CCI.17.00002. 30657379 10.1200/CCI.17.00002 PMC7006900 22. Palmaro A Gauthier M Despas F Lapeyre-Mestre M Identifying cancer drug regimens in French health insurance database: an application in multiple myeloma patients Pharmacoepidemiol Drug Saf 2017 26 1492 1499 10.1002/pds.4266 28745019 Palmaro A, Gauthier M, Despas F, Lapeyre-Mestre M. Identifying cancer drug regimens in French health insurance database: an application in multiple myeloma patients. Pharmacoepidemiol Drug Saf. 2017;26:1492–9. 10.1002/pds.4266. 28745019 10.1002/pds.4266 23. Weymann D Costa S Regier DA Validation of a cyclic algorithm to proxy number of lines of systemic cancer therapy using administrative data JCO Clin Cancer Inform 2019 3 1 10 10.1200/CCI.19.00022 31365273 Weymann D, Costa S, Regier DA. Validation of a cyclic algorithm to proxy number of lines of systemic cancer therapy using administrative data. JCO Clin Cancer Inform. 2019;3:1–10. 10.1200/CCI.19.00022. 31365273 10.1200/CCI.19.00022 24. Sørup S Darvalics B Knudsen JS Rasmussen AS Hjorth CF Vestergaard SV Identifying valid algorithms for number of lines of anti-neoplastic therapy in the Danish National Patient Registry among patients with advanced ovarian, gastric, renal cell, urothelial, and non-small cell lung cancer attending a Danish University Hospital Clin Epidemiol 2022 14 159 171 10.2147/CLEP.S342238 35177936 PMC8846560 Sørup S, Darvalics B, Knudsen JS, Rasmussen AS, Hjorth CF, Vestergaard SV, et al. Identifying valid algorithms for number of lines of anti-neoplastic therapy in the Danish National Patient Registry among patients with advanced ovarian, gastric, renal cell, urothelial, and non-small cell lung cancer attending a Danish University Hospital. Clin Epidemiol. 2022;14:159–71. 10.2147/CLEP.S342238. 35177936 10.2147/CLEP.S342238 PMC8846560 25. Tenny SBJ, Brannan JM, Brannan GD. Qualitative study. Ed. 2024 Jan. Treasure Island, California: StatPearls Publishing; 2022. 26. Naderifar M Goli H Ghaljaie F Snowball sampling: a purposeful method of sampling in qualitative research Strides in Development of Medical Education 2017 14 e67670 10.5812/sdme.67670 Naderifar M, Goli H, Ghaljaie F. Snowball sampling: a purposeful method of sampling in qualitative research. Strides in Development of Medical Education. 2017;14:e67670. 10.5812/sdme.67670. 27. Clopper CJ Pearson ES The use of confidence or fiducial limits illustrated in the case of the binomial Biometrika 1934 26 404 413 10.2307/2331986 Clopper CJ, Pearson ES. The use of confidence or fiducial limits illustrated in the case of the binomial. Biometrika. 1934;26:404–13. 10.2307/2331986. 28. Wilcox AR. Indices of Qualitative Variation. Ed. ORNL. Oak Ridge, Tennessee: Oak Ridge National Laboratory; 1967. https://www.osti.gov/servlets/purl/4167340 29. Yitzhaki S. The GMD: a superior measure of variability for non-normal distributions. SSRN Journal. 2002;301740. 10.2139/ssrn.301740 30. David HA Miscellanea: Gini's mean difference rediscovered Biometrika 1968 55 3 573 575 10.1093/biomet/55.3.573 David HA. Miscellanea: Gini’s mean difference rediscovered. Biometrika. 1968;55(3):573–5. 10.1093/biomet/55.3.573. 31. Gerstenberger C Vogel D On the efficiency of Gini’s mean difference Stat Methods Appl 2015 24 569 596 10.1007/s10260-015-0315-x Gerstenberger C, Vogel D. On the efficiency of Gini’s mean difference. Stat Methods Appl. 2015;24:569–96. 10.1007/s10260-015-0315-x. 32. Sison CP Glaz J Simultaneous confidence intervals and sample size determination for multinomial proportions J Am Stat Assoc 1995 90 366 369 10.1080/01621459.1995.10476521 Sison CP, Glaz J. Simultaneous confidence intervals and sample size determination for multinomial proportions. J Am Stat Assoc. 1995;90:366–9. 10.1080/01621459.1995.10476521. 33. Benjamini Y Hochberg Y Controlling the false discovery rate: a practical and powerful approach to multiple testing J R Stat Soc Ser B Stat Methodol 1995 57 289 300 10.1111/j.2517-6161.1995.tb02031.x Benjamini Y, Hochberg Y. Controlling the false discovery rate: a practical and powerful approach to multiple testing. J R Stat Soc Ser B Stat Methodol. 1995;57:289–300. 10.1111/j.2517-6161.1995.tb02031.x. 34. Hess LM Li X Wu Y Goodloe RJ Cui ZL Defining treatment regimens and lines of therapy using real-world data in oncology Future Oncol 2021 17 1865 1877 10.2217/fon-2020-1041 33629590 Hess LM, Li X, Wu Y, Goodloe RJ, Cui ZL. Defining treatment regimens and lines of therapy using real-world data in oncology. Future Oncol. 2021;17:1865–77. 10.2217/fon-2020-1041. 33629590 10.2217/fon-2020-1041 35. DaCosta Byfield S Yu E Morlock R Evans D Teitelbaum A Corroboration of claims algorithm for second-line costs of metastatic colorectal cancer treatment with targeted agents J Med Econ 2013 16 1071 1081 10.3111/13696998.2013.813513 23777222 DaCosta Byfield S, Yu E, Morlock R, Evans D, Teitelbaum A. Corroboration of claims algorithm for second-line costs of metastatic colorectal cancer treatment with targeted agents. J Med Econ. 2013;16:1071–81. 10.3111/13696998.2013.813513. 23777222 10.3111/13696998.2013.813513 ",
  "metadata": {
    "Title of this paper": "Corroboration of claims algorithm for second-line costs of metastatic colorectal cancer treatment with targeted agents",
    "Journal it was published in:": "BMC Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482237/"
  }
}