{
  "title": "Paper_326",
  "abstract": "pmc JCI Insight JCI Insight 3101 jciinsight JCI Insight JCI Insight 2379-3708 American Society for Clinical Investigation PMC12487864 PMC12487864.1 12487864 12487864 40762983 10.1172/jci.insight.194201 194201 1 Research Article Delineating the short- and long-term impact of ionizing radiation on antigen-inexperienced CD8 + Heidarian Mohammad mohammad-heidarian@uiowa.edu 1 2 Kannan Shravan K. shravankumar-kannan@uiowa.edu 1 3 Swanson Whitney wswanson@umn.edu 4 https://orcid.org/0000-0002-7205-9859 Griffith Thomas S. tgriffit@umn.edu 4 5 6 https://orcid.org/0000-0001-7266-2802 Harty John T. john-harty@uiowa.edu 1 2 3 https://orcid.org/0000-0003-3180-2439 Badovinac Vladimir P. vladimir-badovinac@uiowa.edu 1 2 3 1 2 3 4 5 6 Address correspondence to: Vladimir P. Badovinac, Department of Pathology, The University of Iowa, 1020 Medical Laboratories, 25 S. Grand Avenue, Iowa City, Iowa 52246, USA. Phone: 319.384.2930; Email: Vladimir-badovinac@uiowa.edu 5 8 2025 23 9 2025 10 18 498101 e194201 4 4 2025 31 7 2025 05 08 2025 02 10 2025 02 10 2025 © 2025 Heidarian et al. 2025 Heidarian et al. https://creativecommons.org/licenses/by/4.0/ This work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ This article is available online at https://insight.jci.org/articles/view/194201 Radiation-induced lymphopenia (RIL) remains a challenging side effect of radiation therapy that is often associated with poor prognosis and reduced overall survival. Although CD8 + + + N VM + N VM N + VM N + + + Antigen-inexperienced CD8+ T cells undergo lasting phenotypic and subset composition change following recovery from radiation-induced lymphopenia. Immunology Inflammation Radiation therapy T cells NIH R01AI114543 NIH R01AI042767 NIH GM140881 Veterans Administration Merit Review Award BX001324 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Radiotherapy is a common approach used in more than 50% of solid tumor treatment plans. Ionizing radiation (IR) can directly kill tumor cells through induction of DNA damage and act as an “in situ vaccine” to trigger antitumor immune response ( 1 3 4 6 7 9 10 11 12 13 14 15 16 CD8 + 17 19 + N N + + MEM 20 23 N 24 26 N + VM MEM VM + N 27 29 + 30 33 Thymic production and homeostatic proliferation (HP) of peripheral T cells are 2 mechanisms that can regenerate the T cell compartment under lymphopenic conditions ( 34 35 + + + 36 37 + + 36 38 + + + 39 40 + + + MEM + N + VM + N + Results Ag-inexperienced CD8 + Bona fide T MEM 41 + MEM Figure 1A N N + N Supplemental Figure 1 https://doi.org/10.1172/jci.insight.194201DS1 41 N N Figure 1, B–D VM VM + MEM 27 + VM MEM 44 46 MEM VM N VM Figure 1E MEM + N VM We next investigated the loss and recovery of Ag-inexperienced CD8 + Figure 2A N VM N lo VM hi lo hi hi + Figure 2B N N N N Figure 2C VM N VM N Figure 2D N VM Recovery of T N We next sought to determine the in vivo origin of the emerging T N N N N N N Figure 3A N Figure 3, B and D N N Figure 3, C and E N N Previous results highlighted how the T N N N Supplemental Figure 2A 47 Supplemental Figure 2 N N Lymphopenia can induce robust proliferation of CD8 + 48 N 49 50 N + + N Figure 4, A and B N N N Figure 4C + Figure 4D N Figure 4, E and F N N After recovery T N Thus far we have investigated the numerical changes to T N N N N N 51 53 N Figure 5A N Figure 5B + N N Figure 5, B and C N + + N Figure 5D + + + N Figure 5, E and F N Given the propensity of T N N N N Supplemental Figure 3 N N Supplemental Figure 3C N N N Supplemental Figure 3D N Both newly emerging and radiation-survived naive CD8 + VM Our data in Figures 1 2 N VM + 31 54 + 257-264 33-41 20-27 Plasmodium 40-48 Figure 6, A–C 40-48 + 20-27 33-41 257-264 55 56 Figure 6D VM N VM Figure 6E N VM VM Figure 6F VM VM Figure 6G N VM Given the capacity of radiation-inexperienced T N VM VM N VM VM Figure 7A VM VM Figure 7, B and D N Figure 7, B and D VM + Figure 7C + Figure 7E VM N VM Discussion Patients who receive high doses of IR as part of their solid tumor treatment or prior to hematopoietic stem cell transplant often experience a sustained lymphopenia that can vary greatly in duration ( 57 35 + + N VM VM N N N VM + We have previously demonstrated the inability of circulating and tissue-resident T MEM 41 58 N N VM N N VM VM VM N VM N + N VM + N VM VM Although thymus-derived CD8 + N N N N + N 53 59 60 61 N + N + N + N – N 52 59 We provide evidence that T VM + VM + N 62 64 VM + VM VM MEM N VM Human T VM + – + 28 65 MEM VM N 28 66 67 VM + + VM + + VM N VM + + 68 VM + Differences in murine and human lymphocyte response to IR and RIL may limit the extent to which the findings of this study can be extended. The relatively expeditious numerical recovery of lymphocytes in adult mice following WBI-mediated or focal brain irradiation–induced RIL does not recapitulate the prolonged RIL episodes that are often seen in patients who underwent radiotherapy ( 69 + 70 70 + In summary, this study provides an overview of the dynamic changes to the Ag-inexperienced CD8 + N VM N Methods Sex as a biological variable. Experiments were conducted using both male and female mice, with no differences observed in the kinetic of loss, recovery, and phenotypic changes to the bulk Ag-inexperienced CD8 + + Mice, infections, and memory CD8 + Inbred C57BL/6 (Thy 1.2/1.2) mice were purchased from Charles River and maintained in the animal facilities at the University of Iowa at the appropriate biosafety level. Thymectomized C57BL/6 mice were purchased from Jackson Laboratory. P14 TCR-transgenic mice (Thy1.1/1.1) were bred and maintained at the University of Iowa (Iowa City, Iowa, USA). To generate memory CD8 + 4 + 5 + 6 6 Irradiation. WBI was performed by placing the mice in a 225 kv rotating x-ray tube (Small Animal Radiation Research platform; Xstrahl) available at the Radiation Core at the University of Iowa. Radiation doses of 2 Gy and 5 Gy were used in this study. Mock-treated mice were placed into the same mouse pie cages as IR-treated mice were and remained there for the length of a 5 Gy exposure without WBI exposure. Cell isolation. Peripheral blood was collected by retro-orbital bleeding. Single-cell suspensions from spleen and lymph nodes were generated after mashing tissue through a 70 μm cell strainer (Corning) without enzymatic digestion. ACK lysis buffer was used for red blood cell lysis from peripheral blood and spleen samples. Cell staining and flow cytometry. Single-cell suspensions were incubated with a cocktail of fluorescently labeled mAbs for 30 minutes at 4°C. These mAbs included: CD8a 53-6.7, BioLegend), CD11a (M17/4, BioLegend), Thy1.1 (OX7, BioLegend), CD49d (R1-2, BioLegend), CD62L (MEL14, BioLegend), CD44 (IM7, BioLegend), CD4 (GK1.5, BioLegend), CD19 (1D3, BioLegend), Vβ2 (B20.6, BioLegend), Vβ3 (KJ25, BD), Vβ5.1/5.2 (MR9-4, BioLegend), Vβ6 (RR4-7, eBioscience), Vβ8.1/8.2 (KJ16-133, eBioscience), Vβ8.3 (1B3.3, BioLegend), Vβ10b (B21.5, BioLegend), Vβ11 (KT11, BioLegend), Vβ13 (MR12-3, eBioscience), Vβ14 (14-2, BD), Ly6C (HK1.4, BioLegend) CD122 (5H4, BioLegend), and CD127 (eBioSB/199, eBioscience). Samples were then fixed with Cytofix (BD Biosciences) at 4°C for 15 minutes. To stain for Ki-67 (B56, BD Biosciences), Foxp3/Transcription Factor Staining Buffer reagents (eBioscience) and protocol were used. Flow cytometry data were acquired using an LSRFortessa (BD Biosciences) and analyzed using FlowJo software v.10 (FlowJo LLC) using FlowSOM and tSNE plug-ins. Enrichment and characterization of endogenous Ag-specific naive CD8 + Tetramer-based enrichment protocol ( 31 71 33-41 40-48 b 257-264 20-27 b Statistics. All statistical analyses were performed using GraphPad Prism (v10.0). When indicated, 2-tailed unpaired Student’s t P P Study approval. Experimental procedures using mice were approved by the University of Iowa Animal Care and Use Committee under protocol numbers 2121915. Data availability. All data associated with this study can be found in the main text or the supplement. Values for all data points in graphs are reported in the Supporting Data Values Author contributions MH, JTH, and VPB conceived and the designed the study. MH, SKK, and WS conducted experiments and analyzed data. MH and VPB wrote the original draft, and SKK, VPB, TSG, and JTH reviewed and edited the manuscript. TSG, JTH, and VPB acquired funding and supervised the project. Supplementary Material Supplemental data Supporting data values This study was supported by National Institutes of Health (NIH) grants R01AI114543 (to VPB and JTH), R01AI042767 (to JTH), and GM140881 (to TSG) and a Veterans Administration Merit Review Award (BX001324 to TSG). TSG is the recipient of a Research Career Scientist award (IK6BX006192) from the Department of Veterans Affairs. VPB is a University of Iowa Distinguished Scholar. We thank members of the Harty and Badovinac labs for valuable discussions. We also thank Vahid Nasirian at Ionizing Radiation Services at Free Radical Research Core for assisting with WBI of mice. This work is the result of NIH funding, in whole or in part, and is subject to the NIH Public Access Policy. Through acceptance of this federal funding, the NIH has been given a right to make the work publicly available in PubMed Central. Conflict of interest: Copyright: Reference information: JCI Insight 1 Sia J et al Molecular mechanisms of radiation-induced cancer cell death: a primer Front Cell Dev Biol 2020 8 41 10.3389/fcell.2020.00041 32117972 PMC7031160 2 Rodríguez-Ruiz ME et al Immunological mechanisms responsible for radiation-induced abscopal effect Trends Immunol 2018 39 8 644 655 10.1016/j.it.2018.06.001 30001871 PMC6326574 3 Vanpouille-Box C et al DNA exonuclease Trex1 regulates radiotherapy-induced tumour immunogenicity Nat Commun 2017 8 1 15618 10.1038/ncomms15618 28598415 PMC5472757 4 Giuranno L et al Radiation-induced lung injury (RILI) Front Oncol 2019 9 877 10.3389/fonc.2019.00877 31555602 PMC6743286 5 Straub JM et al Radiation-induced fibrosis: mechanisms and implications for therapy J Cancer Res Clin Oncol 2015 141 11 1985 1994 10.1007/s00432-015-1974-6 25910988 PMC4573901 6 Henson CC et al Structured gastroenterological intervention and improved outcome for patients with chronic gastrointestinal symptoms following pelvic radiotherapy Support Care Cancer 2013 21 8 2255 2265 10.1007/s00520-013-1782-y 23512314 7 Heylmann D et al Radiation sensitivity of human and murine peripheral blood lymphocytes, stem and progenitor cells Biochim Biophys Acta 2014 1846 1 121 129 10.1016/j.bbcan.2014.04.009 24797212 8 Heylmann D et al Sensitivity of CD3/CD28-stimulated versus non-stimulated lymphocytes to ionizing radiation and genotoxic anticancer drugs: key role of ATM in the differential radiation response Cell Death Dis 2018 9 11 1053 10.1038/s41419-018-1095-7 30323167 PMC6189042 9 Nakamura N et al Radiosensitivity of CD4 or CD8 positive human T-lymphocytes by an in vitro colony formation assay Radiat Res 1990 123 2 224 227 10.2307/3577549 2117766 10 Terrones-Campos C et al Hematological toxicity in patients with solid malignant tumors treated with radiation - temporal analysis, dose response and impact on survival Radiother Oncol 2021 158 175 183 10.1016/j.radonc.2021.02.029 33662438 11 Damen PJ et al The influence of severe radiation-induced lymphopenia on overall survival in solid tumors: a systematic review and meta-analysis Int J Radiat Oncol Biol Phys 2021 111 4 936 948 10.1016/j.ijrobp.2021.07.1695 34329738 12 Venkatesulu BP et al A systematic review of the influence of radiation-induced lymphopenia on survival outcomes in solid tumors Crit Rev Oncol Hematol 2018 123 42 51 10.1016/j.critrevonc.2018.01.003 29482778 13 Ménétrier-Caux C et al Lymphopenia in cancer patients and its effects on response to immunotherapy: an opportunity for combination with cytokines? J Immunother Cancer 2019 7 1 85 10.1186/s40425-019-0549-5 30922400 PMC6437964 14 Pike LR et al The impact of radiation therapy on lymphocyte count and survival in metastatic cancer patients receiving PD-1 immune checkpoint inhibitors Int J Radiat Oncol Biol Phys 2019 103 1 142 151 10.1016/j.ijrobp.2018.09.010 30227198 15 Venkatesulu B et al Lymphocyte sparing normal tissue effects in the clinic (LymphoTEC): a systematic review of dose constraint considerations to mitigate radiation-related lymphopenia in the era of immunotherapy Radiother Oncol 2022 177 81 94 10.1016/j.radonc.2022.10.019 36334694 16 Tubin S et al Mono-institutional phase 2 study of innovative Stereotactic Body RadioTherapy targeting PArtial Tumor HYpoxic (SBRT-PATHY) clonogenic cells in unresectable bulky non-small cell lung cancer: profound non-targeted effects by sparing peri-tumoral immune microenvironment Radiat Oncol 2019 14 1 212 10.1186/s13014-019-1410-1 31771654 PMC6878646 17 Adamo S et al Signature of long-lived memory CD8 + Nature 2022 602 7895 148 155 10.1038/s41586-021-04280-x 34875673 PMC8810382 18 Schmidt ME Varga SM The CD8 T cell response to respiratory virus infections Front Immunol 2018 9 678 10.3389/fimmu.2018.00678 29686673 PMC5900024 19 Sahin U et al Personalized RNA mutanome vaccines mobilize poly-specific therapeutic immunity against cancer Nature 2017 547 7662 222 226 10.1038/nature23003 28678784 20 Badovinac VP et al Programmed contraction of CD8(+) T cells after infection Nat Immunol 2002 3 7 619 626 10.1038/ni804 12055624 21 Harty JT Badovinac VP Shaping and reshaping CD8+ T-cell memory Nat Rev Immunol 2008 8 2 107 119 10.1038/nri2251 18219309 22 Takada K Jameson SC Naive T cell homeostasis: from awareness of space to a sense of place Nat Rev Immunol 2009 9 12 823 832 10.1038/nri2657 19935802 23 Youngblood B et al Effector CD8 T cells dedifferentiate into long-lived memory cells Nature 2017 552 7685 404 409 10.1038/nature25144 29236683 PMC5965677 24 Tanchot C et al Differential requirements for survival and proliferation of CD8 naive or memory T cells Science 1997 276 5321 2057 2062 10.1126/science.276.5321.2057 9197272 25 Nešić D Vukmanovic S MHC class I is required for peripheral accumulation of CD8+ thymic emigrants J Immunol 1998 160 8 3705 3712 10.4049/jimmunol.160.8.3705 9558071 26 Vivien L et al T lymphocytes need IL-7 but not IL-4 or IL-6 to survive in vivo Int Immunol 2001 13 6 763 768 10.1093/intimm/13.6.763 11369703 27 Haluszczak C et al The antigen-specific CD8+ T cell repertoire in unimmunized mice includes memory phenotype cells bearing markers of homeostatic expansion J Exp Med 2009 206 2 435 448 10.1084/jem.20081829 19188498 PMC2646575 28 White JT et al Virtual memory T cells develop and mediate bystander protective immunity in an IL-15-dependent manner Nat Commun 2016 7 1 11291 10.1038/ncomms11291 27097762 PMC4844673 29 Drobek A et al Strong homeostatic TCR signals induce formation of self-tolerant virtual memory CD8 T cells EMBO J 2018 37 14 e98518 10.15252/embj.201798518 29752423 PMC6043851 30 Cabrera-Perez J et al Alterations in antigen-specific naive CD4 T cell precursors after sepsis impairs their responsiveness to pathogen challenge J Immunol 2015 194 4 1609 1620 10.4049/jimmunol.1401711 25595784 PMC4412277 31 Condotta SA et al Sustained and incomplete recovery of naive CD8+ T cell precursors after sepsis contributes to impaired CD8+ T cell responses to infection J Immunol 2013 190 5 1991 2000 10.4049/jimmunol.1202379 23355736 PMC3578009 32 Slütter B et al Dynamics of influenza-induced lung-resident memory T cells underlie waning heterosubtypic immunity Sci Immunol 2017 2 7 eaag2031 10.1126/sciimmunol.aag2031 28783666 PMC5590757 33 Nolz Jeffrey C Harty John T Protective capacity of memory CD8+ T cells is dictated by antigen exposure history and nature of the infection Immunity 2011 34 5 781 793 10.1016/j.immuni.2011.03.020 21549619 PMC3103642 34 Mackall CL et al Restoration of T-cell homeostasis after T-cell depletion Semin Immunol 1997 9 6 339 346 10.1006/smim.1997.0091 9405262 35 Velardi E et al T cell regeneration after immunological injury Nat Rev Immunol 2021 21 5 277 291 10.1038/s41577-020-00457-z 33097917 PMC7583557 36 Mackall CL et al Age, thymopoiesis, and CD4+ T-lymphocyte regeneration after intensive chemotherapy N Engl J Med 1995 332 3 143 149 10.1056/NEJM199501193320303 7800006 37 Mackall CL et al Distinctions between CD8+ and CD4+ T-cell regenerative pathways result in prolonged T-cell subset imbalance after intensive chemotherapy Blood 1997 89 10 3700 3707 10.1182/blood.V89.10.3700 9160675 38 den Braber I et al Maintenance of peripheral naive T cells is sustained by thymus output in mice but not humans Immunity 2012 36 2 288 297 10.1016/j.immuni.2012.02.006 22365666 39 Qi Q et al Diversity and clonal selection in the human T-cell repertoire Proc Natl Acad Sci U S A 2014 111 36 13139 13144 10.1073/pnas.1409155111 25157137 PMC4246948 40 Uhlemann H et al Shape of the art: TCR-repertoire after allogeneic hematopoietic cell transplantation Best Pract Res Clin Haematol 2024 37 2 101558 10.1016/j.beha.2024.101558 39098804 41 Heidarian M et al Sublethal whole-body irradiation induces permanent loss and dysfunction in pathogen-specific circulating memory CD8 T cell populations Proc Natl Acad Sci U S A 2023 120 27 e2302785120 10.1073/pnas.2302785120 37364124 PMC10318958 42 Rai D et al Tracking the total CD8 T cell response to infection reveals substantial discordance in magnitude and kinetics between inbred and outbred hosts J Immunol 2009 183 12 7672 7681 10.4049/jimmunol.0902874 19933864 PMC2808048 43 Martin MD et al Revealing the complexity in CD8 T cell responses to infection in inbred C57B/6 versus outbred Swiss mice Front Immunol 2017 8 1527 10.3389/fimmu.2017.01527 29213267 PMC5702636 44 Chiu BC et al Cutting edge: central memory CD8 T cells in aged mice are virtual memory cells J Immunol 2013 191 12 5793 5796 10.4049/jimmunol.1302509 24227783 PMC3858473 45 Berton RR et al Accurate enumeration of pathogen-specific and virtual memory CD8 T cells after infection J Immunol 2025 214 5 995 1007 10.1093/jimmun/vkaf007 40167212 PMC12123210 46 White JT et al Antigen-inexperienced memory CD8 + Nat Rev Immunol 2017 17 6 391 400 10.1038/nri.2017.34 28480897 PMC5569888 47 Pan B et al Acute ablation of DP thymocytes induces up-regulation of IL-22 and Foxn1 in TECs Clin Immunol 2014 150 1 101 108 10.1016/j.clim.2013.11.002 24333537 48 Goldrath AW Bevan MJ Low-affinity ligands for the TCR drive proliferation of mature CD8+ T cells in lymphopenic hosts Immunity 1999 11 2 183 190 10.1016/S1074-7613(00)80093-X 10485653 PMC2789737 49 Jiang J et al Selective depletion of nonspecific T cells during the early stage of immune responses to infection J Immunol 2003 171 8 4352 4358 10.4049/jimmunol.171.8.4352 14530360 50 Cytlak UM et al Immunomodulation by radiotherapy in tumour control and normal tissue toxicity Nat Rev Immunol 2022 22 2 124 138 10.1038/s41577-021-00568-1 34211187 51 Fulton RB et al The TCR’s sensitivity to self peptide-MHC dictates the ability of naive CD8(+) T cells to respond to foreign antigens Nat Immunol 2015 16 1 107 117 10.1038/ni.3043 25419629 PMC4270846 52 Ju Y-J et al Self-reactivity controls functional diversity of naive CD8 + Nat Commun 2021 12 1 6059 10.1038/s41467-021-26351-3 34663827 PMC8523551 53 Jergović M et al Infection-induced type I interferons critically modulate the homeostasis and function of CD8 + Nat Commun 2021 12 1 5303 10.1038/s41467-021-25645-w 34489451 PMC8421345 54 Obar JJ et al Endogenous naive CD8+ T cell precursor frequency regulates primary and memory responses to infection Immunity 2008 28 6 859 869 10.1016/j.immuni.2008.04.010 18499487 PMC2836785 55 Jenkins MK Moon JJ The role of naive T cell precursor frequency and recruitment in dictating immune response magnitude J Immunol 2012 188 9 4135 4140 10.4049/jimmunol.1102661 22517866 PMC3334329 56 Van Braeckel-Budimir N et al A T cell receptor locus harbors a malaria-specific immune response gene Immunity 2017 47 5 835 847 10.1016/j.immuni.2017.10.013 29150238 PMC5724374 57 De Kermenguy F et al Radio-induced lymphopenia in the era of anti-cancer immunotherapy Int Rev Cell Mol Biol 2023 378 1 30 10.1016/bs.ircmb.2023.03.002 37438014 58 Hassert M et al Regenerating murine CD8+ lung tissue resident memory T cells after targeted radiation exposure J Exp Med 2024 221 3 e20231144 10.1084/jem.20231144 38363548 PMC10873130 59 Berton RR et al Sepsis leads to lasting changes in phenotype and function of naïve CD8 T cells PLoS Pathog 2023 19 10 e1011720 10.1371/journal.ppat.1011720 37824591 PMC10597476 60 Leibowitz BJ et al Interferon b drives intestinal regeneration after radiation Sci Adv 2021 7 41 eabi5253 10.1126/sciadv.abi5253 34613772 PMC8494436 61 Feng X et al ATR inhibition potentiates ionizing radiation-induced interferon response via cytosolic nucleic acid-sensing pathways EMBO J 2020 39 14 e104036 10.15252/embj.2019104036 32484965 PMC7361286 62 Cho BK et al Homeostasis-stimulated proliferation drives naive T cells to differentiate directly into memory T cells J Exp Med 2000 192 4 549 556 10.1084/jem.192.4.549 10952724 PMC2193235 63 Goldrath AW et al Naive T cells transiently acquire a memory-like phenotype during homeostasis-driven proliferation J Exp Med 2000 192 4 557 564 10.1084/jem.192.4.557 10952725 PMC2193243 64 Hamilton SE et al The generation of protective memory-like CD8+ T cells during homeostatic proliferation requires CD4+ T cells Nat Immunol 2006 7 5 475 481 10.1038/ni1326 16604076 65 Jacomet F et al Evidence for eomesodermin-expressing innate-like CD8(+) KIR/NKG2A(+) T cells in human adults and cord blood samples Eur J Immunol 2015 45 7 1926 1933 10.1002/eji.201545539 25903796 66 Geginat J et al Proliferation and differentiation potential of human CD8+ memory T-cell subsets in response to antigen or homeostatic cytokines Blood 2003 101 11 4260 4266 10.1182/blood-2002-11-3577 12576317 67 Quinn KM et al Age-related decline in primary CD8 + + Cell Rep 2018 23 12 3512 3524 10.1016/j.celrep.2018.05.057 29924995 68 Alho AC et al Unbalanced recovery of regulatory and effector T cells after allogeneic stem cell transplantation contributes to chronic GVHD Blood 2016 127 5 646 657 10.1182/blood-2015-10-672345 26670634 PMC4742552 69 Piotrowski AF et al Systemic depletion of lymphocytes following focal radiation to the brain in a murine model Oncoimmunology 2018 7 7 e1445951 10.1080/2162402X.2018.1445951 29900062 PMC5993500 70 Ghandhi SA et al Discordant gene responses to radiation in humans and mice and the role of hematopoietically humanized mice in the search for radiation biomarkers Sci Rep 2019 9 1 19434 10.1038/s41598-019-55982-2 31857640 PMC6923394 71 Moon JJ et al Naive CD4(+) T cell frequency varies for different epitopes and predicts repertoire diversity and response magnitude Immunity 2007 27 2 203 213 10.1016/j.immuni.2007.07.007 17707129 PMC2200089 Version 1 08/05/2025 In-Press Preview Version 2 09/23/2025 Electronic publication Figure 1 Numbers of Ag-inexperienced and memory CD8 + ( A 4 + + + + B N VM + C N D E VM E VM + A E n P P P P Figure 2 Naive and virtual memory CD8 + ( A B N VM + N C N + N D VM VM + A D n P P P P Figure 3 Thymus is required for naive CD8 + ( A B N + C + N D E A E n B C D E P P P P Figure 4 WBI-surviving naive CD8 + ( A 6 + + + B + N VM + C N D 5 + + E N F N A F n P P P Figure 5 Phenotypic composition of T N ( A B N lo + + C N D E F + + + N A F n P P Figure 6 Acquisition of virtual memory phenotype by a fraction of proliferating T N ( A + + 33-41 20-27 41-48 257-264 B + C hi lo + + D E b 33-41 40-48 b 20-27 257-264 + F 5 + + G VM + A E F G n t P P P P Figure 7 Repopulation of the virtual memory subset can occur in the absence of thymus. ( A Figure 3 B VM + C + VM D + E A E n B C D E P P P P ",
  "metadata": {
    "Title of this paper": "Naive CD4(+) T cell frequency varies for different epitopes and predicts repertoire diversity and response magnitude",
    "Journal it was published in:": "JCI Insight",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487864/"
  }
}