{
  "title": "Paper_690",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12480536 PMC12480536.1 12480536 12480536 41022731 10.1038/s41467-025-63611-y 63611 1 Article Effect of the gut microbiota-derived tryptophan metabolite indole-3-acetic acid in pneumonia http://orcid.org/0000-0001-8269-9887 Kullberg Robert F. J. r.f.j.kullberg@amsterdamumc.nl 1 2 van Linge Christine C. A. 1 2 Haak Bastiaan W. 1 2 Paul Prasanjit S. 1 2 http://orcid.org/0000-0001-6781-6408 Butler Joe M. 1 2 Wolff Nora 1 2 van Engelen Tjitske S. R. 1 2 http://orcid.org/0000-0001-5481-5596 Sikkens Jonne J. 3 http://orcid.org/0000-0003-0399-6926 Bomers Marije K. 4 Lefèvre Antoine 5 http://orcid.org/0000-0003-4264-1108 Cremer Olaf L. 6 Roelofs Joris J.T.H. 7 Sovran Bruno 8 9 10 van den Wijngaard René 8 http://orcid.org/0000-0002-2472-3014 de Vos Alex F. 1 2 de Jonge Wouter J. 8 11 http://orcid.org/0000-0002-9199-5079 van der Poll Tom 1 2 4 http://orcid.org/0000-0003-2277-1343 Wiersinga W. Joost 1 2 4 1 https://ror.org/04dkp9463 grid.7177.6 0000000084992262 Center for Infection and Molecular Medicine (CIMM), Amsterdam UMC, University of Amsterdam, 2 https://ror.org/00bcn1057 Amsterdam institute for Immunology and Infectious diseases, 3 https://ror.org/05grdyy37 grid.509540.d 0000 0004 6880 3010 Department of Internal Medicine, Section Acute and General Internal Medicine, Amsterdam UMC, 4 https://ror.org/05grdyy37 grid.509540.d 0000 0004 6880 3010 Department of Internal Medicine, Division of Infectious Diseases, Amsterdam UMC, 5 https://ror.org/02wwzvj46 grid.12366.30 0000 0001 2182 6141 UMR 1253, iBrain, INSERM, University of Tours, 6 https://ror.org/04pp8hn57 grid.5477.1 0000000120346234 Department of Intensive Care Medicine, University Medical Center Utrecht, Utrecht University, 7 https://ror.org/04dkp9463 grid.7177.6 0000000084992262 Department of Pathology, Amsterdam UMC, University of Amsterdam, 8 https://ror.org/04dkp9463 grid.7177.6 0000000084992262 Tytgat Institute for Liver and Intestinal Research, Amsterdam Gastroenterology, Endocrinology and Metabolism, Amsterdam UMC, University of Amsterdam, 9 https://ror.org/04dkp9463 grid.7177.6 0000000084992262 Department of Paediatric Surgery, Amsterdam Reproduction and Development Research Institute, Emma Children’s Hospital, Amsterdam UMC, University of Amsterdam and Vrije Universiteit Amsterdam, 10 https://ror.org/04dkp9463 grid.7177.6 0000000084992262 Emma Center for Personalized Medicine, Amsterdam UMC, University of Amsterdam, 11 https://ror.org/01xnwqx93 grid.15090.3d 0000 0000 8786 803X Department of General, Visceral, Thoracic and Vascular Surgery, University Hospital Bonn, 29 9 2025 2025 16 478256 8565 31 8 2024 19 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Gut microbiota influence the severity of pneumonia by producing metabolites that enhance systemic and pulmonary immune responses. Preclinical studies suggested that gut microbiota-derived indoles have protective effects against numerous diseases, including influenza and abdominal infections. However, the precise role of tryptophan metabolites during pneumonia is unknown. Here, we perform translational analyses in a large general-population cohort ( n n NCT01905033 NCT03051698 p p The gut microbiota can influence the severity of pneumonia through the production of metabolites. In this translational study, the authors investigate the effects of tryptophan metabolites, specifically indole-3-acetic acid (IAA), on pneumonia. Subject terms Infectious diseases Respiratory tract diseases Microbiota Translational research Risk factors https://doi.org/10.13039/501100000265 RCUK | Medical Research Council (MRC) MR/N003284/1, MC-UU_12015/1 and MC_UU_00006/1 Kullberg Robert F. J. https://doi.org/10.13039/501100000289 Cancer Research UK (CRUK) C864/A14136 Kullberg Robert F. J. Amsterdam UMC pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Pneumonia, an acute infection of the lower respiratory tract, affects over 450 million people and causes 2.5 million deaths each year 1 2 3 Our group and others identified the intestinal microbiota as modulator of pneumonia severity 4 6 4 6 8 9 11 12 13 14 In the gut, dietary tryptophan can be metabolized into three major pathways: the serotonin, kynurenine and indole pathway. While the serotonin and kynurenine pathways are largely mediated by host cells, it has been reported that intestinal bacteria transform tryptophan into indoles. Indoles bind to and active the nuclear aryl hydrocarbon receptor (AhR) to elicit downstream gene expression 15 16 15 18 19 27 25 26 27 21 22 23 2 24 28 29 However, other indoles (besides IPA) might influence infection severity and, to the best of our knowledge, no studies have reported the role of indoles in bacterial pneumonia while most severe cases of CAP are caused by bacteria (not influenza) 2 30 21 23 Results Tryptophan metabolites correlate with the risk of hospitalization for pneumonia in the general population Most CAP patients have mild disease and can be treated on an outpatient basis 2 3 1A 31 1B 26 p versus p 1C p p 1 Fig. 1 Plasma tryptophan metabolite concentrations are associated with the risk of hospitalization or mortality due to pneumonia in the general population. A B C Tryptophan metabolites are altered during severe pneumonia and correlate with mortality Next, we set out to investigate the association between plasma tryptophan metabolites and the risk of 90 day mortality in patients with severe pneumonia (Fig. 2A 32 34 1 35 36 1 1 Fig. 2 Plasma tryptophan metabolite concentrations are altered during severe pneumonia and correlate with mortality. A n n B n n p C D E n n Table 1 Clinical characteristics of the severe CAP cohort Severe CAP patients n Controls n Age (median, IQR) 63.0 (49.8−72.0) 57.0 (47.3−60.8) Male sex 98 (62.8) 18 (60.0) Body Mass Index (median, IQR) 1 24.7 (22.0−27.4) 25.4 (23.5−28.0) Current smoker 25 (16.0) Comorbidities 1 Cardiovascular disease 32 (20.5) 2 (10.5) Respiratory disease 51 (32.7) 1 (5.3) Malignancy 22 (14.1) 1 (5.3) Diabetes 28 (17.9) 0 (0.0) Renal disease 13 (8.3) 0 (0.0) Immunocompromised 37 (23.7) 1 (5.3) Severity of disease at ICU admission SOFA score 7 (5−10) APACHE IV score 75 (59−91) Antibiotics before sample collection Any 39 (25.0) Anti-anaerobic antibiotics 2 17 (10.9) Causative pathogen 3 No pathogen identified 43 (27.6)  Streptococcus pneumoniae 29 (18.6)  Staphylococcus aureus 21 (13.5)  Haemophilus influenzae 21 (13.5) Influenza 11 (7.1)  Pseudomonas aeruginosa 11 (7.1)  Escherichia coli 10 (6.4)  Klebsiella species 9 (5.8) Other Streptococcus species 5 (3.2)  Aspergillus species 2 (1.3) Other pathogens 33 (21.2) Outcome ICU length of stay, days (median, IQR) 5 (2−10) 90 day mortality 63 (40.4) 1 year mortality 79 (50.6) Data are n IQR ICU SOFA APACHE 1 n 2 3 We used a validated approach 18 37 p 2B 2C p p p p p 15 p p 38 39 Next, we assessed whether the concentrations of tryptophan metabolites at ICU admission were associated with 90 day mortality. Seven out of seventeen plasma tryptophan metabolites differed between survivors and non-survivors (Fig. 2B, D 40 2 Notably, higher levels of IAA at ICU admission were associated with an increased risk of 90 day mortality, both when IAA was analyzed as continuous variable (hazard ratio [HR] 1.31, 95% confidence interval [CI] 1.07-1.62, per log2 increase, p p 2E 41 p 2 p p 2 p 3 n p 3 Taken together, most indoles decrease during severe CAP, while tryptophan metabolites from the kynurenine pathway are higher. In patients with severe CAP, IAA is associated with higher mortality, independent from potential confounders. Effects of broad-spectrum antibiotics on tryptophan metabolites in a human intervention trial Previous studies have reported that indole concentrations are decreased in germ-free mice and are affected by microbiota transfer experiments 17 21 42 3A p 3B 42 Ruminococcaceae Bifidobacterium Blautia Streptococcus, Lactococcus Lactobacillus 3C 3D versus p 2 Fig. 3 Effects of microbiota modulation by broad-spectrum antibiotics on plasma tryptophan metabolites in a human intervention trial. A n n B C Streptococcus Lactococcus Lactobacillus Bifidobacterium D p Dynamics of tryptophan metabolites during experimental bacterial pneumonia Since tryptophan metabolites were associated with the risk of pneumonia in the general population, altered during hospitalization for severe CAP, and previous studies showed that tryptophan metabolism is affected by inflammation 15 43 45 Klebsiella (K.) pneumoniae 4A K. pneumoniae 46 47 40 4B 4B, C 4 K. pneumoniae K. pneumoniae Fig. 4 Dynamics of plasma tryptophan metabolites during experimental bacterial pneumonia. A Klebsiella pneumoniae n B C IAA aggravates pulmonary damage and reduces dissemination during bacterial pneumonia We next investigated the effects of IAA during experimental pneumonia. We focused on IAA since it was the only indole consistently associated with pneumonia severity in both the general population and ICU patients. In addition, IAA was (in contrast to all other metabolites except for 5-OH-indole acetic acid) associated with higher mortality during severe pneumonia, independent from clinical confounders and pro-inflammatory cytokines, and was among the few tryptophan metabolites that were significantly altered following gut microbiota modulation. Moreover, IAA supplementation has protective effects against inflammatory bowel disease and COPD 18 22 21 28 29 22 48 versus p 5 K. pneumoniae 43 45 5A K. pneumoniae p p 5B K. pneumoniae p 5C, D p 5 5E 5F 6 Fig. 5 IAA aggravates pulmonary damage and reduces dissemination during bacterial pneumonia. A Klebsiella pneumoniae n B K. pneumoniae C D K. pneumoniae E K. pneumoniae F IAA impacts bacterial pneumonia through AhR Considering the important role of AhR signaling in immune responses and that IAA serves as a ligand of AhR 15 16 22 27 K. pneumoniae 22 K. pneumoniae 6A 6B p p 6C 6D 7 Fig. 6 IAA impacts K. pneumoniae A n Klebsiella pneumoniae B C D K. pneumoniae IAA increases ROS release during in vitro K. pneumoniae We next aimed to identify the mechanism underlying the detrimental effects of IAA on lung damage during bacterial pneumonia. Neutrophil influx, pulmonary cytokine levels (TNF, IL-1β, IL-6, IL-10, monocyte chemoattractant protein-1, chemokine CXC motif ligand 1) and plasma cytokine concentrations (TNF, IL-6) did not differ between IAA-pretreated mice and controls during bacterial pneumonia (Supplementary Fig. 8 p 9 Previous studies described that IAA increases ROS release from cultured neutrophils 21 49 50 51 2- 50 K. pneumoniae 7A, B K. pneumoniae 10 10 Fig. 7 IAA increases ROS production during in vitro K. pneumoniae Reactive oxygen species (ROS) release from bone-marrow derived neutrophils of mice pretreated for 2 weeks with saline (control) or indole-3-acetic acid (IAA; n B n A n C n D Finally, we wanted to assess the relevance of the association between IAA and increased ROS in patients with severe pneumonia. We used whole blood transcriptomics data, collected within 24 h of ICU admission, from a subset of our severe CAP cohort ( n 34 ROS and RNS production in phagocytes p 7C, D 7C 26 Discussion In this translational study—combining population-based and severe CAP cohorts with murine pneumonia experiments—we found that the gut microbiota-derived tryptophan metabolite IAA affects pneumonia and modulates interpatient heterogeneity in pneumonia. IAA was associated with an increased risk of future hospital admission for pneumonia among 13,464 general population subjects, and with higher mortality during severe CAP. In a randomized human intervention trial, microbiota modulation by broad-spectrum antibiotics resulted in decreased plasma IAA concentrations. Further, we found that IAA supplementation aggravated pulmonary damage while reducing systemic dissemination during K. pneumoniae- 2 52 Gut microbiota are an important modulator of immune responses during pneumonia through the production of immunomodulatory metabolites 5 13 14 K. pneumoniae 43 45 18 21 23 22 16 25 26 Pneumonia itself also affected tryptophan metabolism. In patients with severe CAP, tryptophan metabolite concentrations were extensively altered at ICU admission: plasma tryptophan and indoles were lower, while the kynurenine pathway was increased compared to healthy controls. Experimental pneumonia in mice induced similar changes: a decrease of indoles and increased kynurenine metabolites, suggesting that alterations in patients are (at least partly) induced by the infection, rather than preceding pneumonia onset. An increase in kynurenine metabolites is observed in many inflammatory diseases. The flux of tryptophan into kynurenine is mediated by the rate-limiting enzyme indoleamine 2,3-dioxygenase-1, which is induced by pro-inflammatory cytokines (e.g. TNF) 15 53 15 43 7 We found that gut microbiota significantly contributed to systemic indole concentrations in humans. In a randomized human intervention trial, we demonstrated that indoles are reduced following modulation of microbiota through broad-spectrum antibiotics, strongly suggesting a microbial origin of systemic indoles in humans although we could not definitively exclude dietary or host enzymatic sources of indoles. In the lungs, IAA concentrations were below the lower limit of detection which implies that pulmonary microbiota are not a relevant source of plasma IAA. We could not identify individual intestinal genera significantly associated with tryptophan metabolites. Previous studies reported that IAA is produced by diverse bacteria, including facultative anaerobic Lactobacillus Escherichia coli Bacteroides 21 54 55 E. coli 38 39 56 57 58 Mechanistically, the effects of IAA on bacterial pneumonia were—at least partly—AhR-dependent. Indoles are essential in maintaining intestinal barrier function and, more relevantly, AhR signaling enhanced the lung barrier during influenza-induced pneumonia 15 27 59 Klebsiella 15 53 51 21 49 This study has several shortcomings. First, owing to the observational design of the human cohorts, the relations between tryptophan metabolites and pneumonia severity may be affected by confounding. Yet, the association between IAA and mortality remained significant in multivariable models that controlled for confounders, and key effects of IAA overlapped between patients and mice (e.g., increased pulmonary injury and reduced risk of bacteremia). Furthermore, tryptophan metabolites were measured at a single timepoint in our human cohorts while levels might change over time. Second, we employed a commonly used murine model of severe bacterial pneumonia by intranasal infection with K. pneumonia 43 45 60 61 In summary, we identified IAA as an important contributor to heterogeneity in CAP severity. In translational analyses, IAA increased pulmonary damage while reducing systemic dissemination via AhR-activation and increasing the release of reactive oxygen species from neutrophils. Methods Ethics statement Ethical approval for the EPIC-Norfolk study was obtained from the Norfolk Research Ethics Committee 31 EPIC-NORFOLK cohort To assess the relationship between plasma tryptophan metabolites and incident severe (i.e. either hospitalization or mortality) lower respiratory tract infections in the general population, we used data from the population-based European Prospective Investigation into Cancer (EPIC)-Norfolk cohort. Details on the study design, in- and exclusion criteria, measurement of metabolites, and usage of national registries for clinical outcomes have been previously described 31 62 31 31 31 Severe CAP patient cohort Patients with severe community-acquired pneumonia (CAP) were included as part of the Molecular Diagnosis and Risk Stratification of Sepsis (MARS) study (ClinicalTrials.gov identifier NCT01905033 32 34 63 64 Healthcare workers employed at the Amsterdam University Medical Center and included in the prospective observational S3 study served as healthy controls (Netherlands Trial Register NL8645). Details have been previously described 35 36 Quantification of tryptophan metabolites Blood citrate plasma, BALF and murine lung homogenate samples were shipped to the University of Tours (UMR 1253, iBrain, University of Tours, Inserm, France) to measure tryptophan metabolites using a previously described and validated method 18 37 Whole blood transcriptomics Details on whole blood transcriptomics have been previously described 32 34 65 n Host immune response biomarkers measurements We employed a Luminex multiplex assay (R&D Systems Inc, Minneapolis, MN) on a BioPlex 200 (BioRad, Hercules, CA) to measure 20 host immune response biomarkers reflective of inflammatory cytokines, inflammation and organ damage, and the endothelial and coagulation response in severe CAP patients, as earlier detailed 34 65 67 Human intervention trial This proof-of-concept, single center, randomized, open-label, controlled intervention trial was part of the CAST (C1-inhibitor in allergic ASThma patients) study, in which the effect of C1-inhibitor or microbiota depletion on lung inflammation in asthma patients with allergy was investigated. The study protocol is registered at ClinicalTrials.gov (identifier: NCT03051698 42 68 69 70 42 68 42 68 Gut microbiota analysis Bacterial microbiota were analyzed as previously described by our group 10 42 Mice experiments Specific pathogen-free female C57BL/6 J mice were purchased from Charles River, and housed in individually ventilated cages in rooms with a controlled temperature (20–26 °C with 30–70% humidity) and 12 h light-dark cycle at the Animal Research Institute Amsterdam (ARIA) facility of the Academic Medical Center facility under standard care. Mice were acclimatized for 1 week prior to experiments. All experiments were conducted with mice between 9 and 11 weeks of age at time of infection. IAA, AhR-inhibitor, FICZ and ILA pretreatment Mice were pretreated by daily intraperitoneal injections with 50 mg/kg bodyweight indole-3-acetic acid (Sigma Aldrich) for 2 weeks. Control mice received daily intraperitoneal injections with saline. For experiments with AhR inhibition, CH-223191 (Sigma Aldrich) was given by daily intraperitoneal injections (10 mg/kg bodyweight) for 2 weeks, prior to IAA administration. ILA (50 mg/kg bodyweight; Sigma Aldrich) and FICZ (100 µg/kg bodyweight; Sigma Aldrich) were also administered by intraperitoneal injections for 2 weeks. Dose, duration and route of pretreatment are based on previous publications 22 48 Infection models A detailed protocol for our experimental K. pneumoniae 46 K. pneumoniae 4 4 Following infection and euthanasia, blood was collected via cardiopuncture. The left lung, spleen and liver were harvested and homogenized in four volumes of sterile PBS. Blood and organ homogenates were serially diluted in sterile PBS, plated onto blood agar plates, incubated overnight at 37 °C, and CFUs counted for determination of bacterial growth. Bronchoalveolar lavage fluid (BALF) was collected from right lung lobes using 1 mL phosphate buffered saline (PBS). Lung pathology scores Directly after sacrifice, a section of the left lung was fixed in 4% formalin and embedded in paraffin for routine histology. Hematoxylin and eosin-stained paraffin sections from murine lung tissue were scored as previously described 4 50 Flow cytometry Flow cytometry was performed as earlier detailed 71 72 71 72 11 Murine inflammation and organ damage markers Inflammatory markers (TNF, IL-6, IL-10, monocyte chemoattractant protein-1) in murine BALF supernatant and plasma were quantified by cytometric bead array (mouse inflammation kit, BD Biosciences) according to the manufacturer’s instructions. IL-1β and chemokine CXC motif ligand (CXCL) 1 were measured in BALF supernatant using a commercial ELISA kit (R&D systems, Minneapolis, MN, US). To quantify oxidative stress in the lungs following pneumonia, nitrotyrosine was measured in lung homogenate by ELISA (Abcam, Cambridge, UK) 21 ROS production assay ROS production by neutrophils was measured as previously described 50 73 +/+ 2 2 +/+ 5 K. pneumoniae 6 +/+ Statistical analysis All statistical analyses were performed in R (version 4). Wilcoxon rank-sum tests were used to compare continuous variables between groups. For the EPIC-NORFOLK cohort, competing risk regression models were used to assess associations between the primary outcome (hospitalization or mortality due to lower respiratory tract infections) and tryptophan metabolites, with Benjamini-Hochberg correction for multiple comparisons. Mortality from other causes was treated as competing risk. To calculate effect sizes for differences in tryptophan metabolites between severe CAP patients and controls, between surviving and non-surviving patients at 90 days, and between participants randomized to controls or antibiotics, we calculated Hedges’ g 74 Cox proportional hazards models were used to assess the relationship between log2-transformed IAA concentrations and mortality, at 30 and 90 days, and 1 year. Time zero was defined as the day of ICU admission. Multivariable models were adjusted for age, sex, body mass index, disease severity, antibiotic exposure prior to sample collection, causative pathogen and comorbidities (diabetes, malignancy, immunocompromised state, cardiovascular, renal, and respiratory disease) at ICU admission. We quantified the severity of illness with the Sequential Organ Failure Assessment score. Pearson correlations were calculated between log2-transformed plasma IAA concentrations and the number of ventilator-free days, adjudicated 90 days after ICU admission. The association between IAA at ICU admission and the probability of bacteremia was assessed by univariable logistic regression. For the correlations between tryptophan metabolites and host immune response biomarkers (log2-transformed), Pearson correlations were calculated with Benjamini-Hochberg correction for multiple comparisons. Associations between IAA and gene expression were assessed by linear models, and Gene Set Enrichment Analysis (genes ranked by t-statistic) was applied using Reactome pathways with Benjamini-Hochberg correction 75 76 p Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Reporting Summary Transparent Peer Review file Source data  source data Publisher’s note Supplementary information The online version contains supplementary material available at 10.1038/s41467-025-63611-y. Acknowledgements This research was funded by an Amsterdam UMC PhD scholarship to RFJK. The EPIC-Norfolk study (DOI 10.22025/2019.10.105.00004) has received funding from the Medical Research Council (MR/N003284/1, MC-UU_12015/1 and MC_UU_00006/1) and Cancer Research UK (C864/A14136). We are grateful to all the participants who have been part of the project and to the many members of the study teams at the University of Cambridge who have enabled this research. Illustrations of study designs were created with BioRender.com. The authors thank Marieke ten Brink and Jessie Hulscher for their expert technical support during the experiments, and professor Patrick Emond from iBrain for the measurement and expert analysis of tryptophan metabolites. Author contributions R.F.J.K., C.C.A.v.L., B.W.H., B.S., R.v.d.W., A.F.d.V., W.J.d.J., T.v.d.P. and W.J.W. conceived and designed the study. R.F.J.K., C.C.A.v.L., P.S.P. and N.W. performed the mice experiments. T.v.d.P. and O.L.C. were responsible for the MARS cohort. J.J.S. and M.K.B. were responsible for the S3 study. B.W.H., T.S.R.v.E., T.v.d.P. and W.J.W. were responsible for the CAST study. A.L. performed the quantification of tryptophan metabolites. J.J.T.H.R. analyzed the lung sections for pulmonary damage. R.F.J.K., C.C.A.v.L., B.W.H., J.M.B., B.S., R.v.d.W., W.J.d.J., T.v.d.P. and W.J.W. analyzed and interpreted the data. R.F.J.K., B.W.H. and W.J.W. wrote the first draft of the manuscript. All authors have seen and approved the final version of the manuscript. Peer review Peer review information Nature Communications Data availability Source Data are provided with this paper. Transcriptomics data from the MARS cohort have been deposited at the Gene Expression Omnibus public repository of NCBI under accession number GSE65682 PASS05888 https://www.epic-norfolk.org.uk/for-researchers/data-sharing/ Source data Code availability Code used for analyses is publicly available at https://github.com/rfjkullberg/IAA_pneumonia 77 Competing interests WdJ reports grants from the EU and ZonMW, and is a shareholder and board member of AIBiomics BV. WJW reports grants from the EU and ZonMw/NWO, and ad hoc consultancy for AstraZeneca and Shionogi (fees paid to the host institution), outside the submitted work. All other authors declare no competing interests. References 1. GBD 2019 Diseases and Injuries Collaborators Global burden of 369 diseases and injuries in 204 countries and territories, 1990-2019: a systematic analysis for the global burden of disease study 2019 Lancet 2020 396 1204 1222 10.1016/S0140-6736(20)30925-9 33069326 PMC7567026 GBD 2019 Diseases and Injuries Collaborators Global burden of 369 diseases and injuries in 204 countries and territories, 1990-2019: a systematic analysis for the global burden of disease study 2019. Lancet 396 33069326 10.1016/S0140-6736(20)30925-9 PMC7567026 2. Torres A Pneumonia Nat. Rev. Dis. Prim. 2021 7 25 10.1038/s41572-021-00259-0 33833230 Torres, A. et al. Pneumonia. Nat. Rev. Dis. Prim. 7 33833230 10.1038/s41572-021-00259-0 3. Wunderink RG Waterer G Advances in the causes and management of community acquired pneumonia in adults BMJ 2017 358 j2471 10.1136/bmj.j2471 28694251 Wunderink, R. G. & Waterer, G. Advances in the causes and management of community acquired pneumonia in adults. BMJ 358 28694251 10.1136/bmj.j2471 4. Schuijt TJ The gut microbiota plays a protective role in the host defence against pneumococcal pneumonia Gut 2016 65 575 583 10.1136/gutjnl-2015-309728 26511795 PMC4819612 Schuijt, T. J. et al. The gut microbiota plays a protective role in the host defence against pneumococcal pneumonia. Gut 65 26511795 10.1136/gutjnl-2015-309728 PMC4819612 5. Haak BW Wiersinga WJ The role of the gut microbiota in sepsis Lancet Gastroenterol. Hepatol. 2017 2 135 143 10.1016/S2468-1253(16)30119-4 28403983 Haak, B. W. & Wiersinga, W. J. The role of the gut microbiota in sepsis. Lancet Gastroenterol. Hepatol. 2 28403983 10.1016/S2468-1253(16)30119-4 6. Ichinohe T Microbiota regulates immune defense against respiratory tract influenza A virus infection Proc. Natl. Acad. Sci. USA 2011 108 5354 5359 10.1073/pnas.1019378108 21402903 PMC3069176 Ichinohe, T. et al. Microbiota regulates immune defense against respiratory tract influenza A virus infection. Proc. Natl. Acad. Sci. USA 108 21402903 10.1073/pnas.1019378108 PMC3069176 7. Sencio V Gut dysbiosis during influenza contributes to pulmonary pneumococcal superinfection through altered short-chain fatty acid production Cell Rep. 2020 30 2934 2947.e6 10.1016/j.celrep.2020.02.013 32130898 Sencio, V. et al. Gut dysbiosis during influenza contributes to pulmonary pneumococcal superinfection through altered short-chain fatty acid production. Cell Rep. 30 32130898 10.1016/j.celrep.2020.02.013 8. Le Guern R Gut colonisation with multidrug-resistant Klebsiella pneumoniae worsens pseudomonas aeruginosa lung infection Nat. Commun. 2023 14 78 10.1038/s41467-022-35767-4 36604442 PMC9816093 Le Guern, R. et al. Gut colonisation with multidrug-resistant Klebsiella pneumoniae worsens pseudomonas aeruginosa lung infection. Nat. Commun. 14 36604442 10.1038/s41467-022-35767-4 PMC9816093 9. Bernard-Raichon L Gut microbiome dysbiosis in antibiotic-treated COVID-19 patients is associated with microbial translocation and bacteremia Nat. Commun. 2022 13 5926 10.1038/s41467-022-33395-6 36319618 PMC9626559 Bernard-Raichon, L. et al. Gut microbiome dysbiosis in antibiotic-treated COVID-19 patients is associated with microbial translocation and bacteremia. Nat. Commun. 13 36319618 10.1038/s41467-022-33395-6 PMC9626559 10. Kullberg RFJ Rectal bacteriome and virome signatures and clinical outcomes in community-acquired pneumonia: an exploratory study EclinicalMedicine 2021 39 101074 10.1016/j.eclinm.2021.101074 34611613 PMC8478680 Kullberg, R. F. J. et al. Rectal bacteriome and virome signatures and clinical outcomes in community-acquired pneumonia: an exploratory study. EclinicalMedicine 39 34611613 10.1016/j.eclinm.2021.101074 PMC8478680 11. Yeoh YK Gut microbiota composition reflects disease severity and dysfunctional immune responses in patients with COVID-19 Gut 2021 70 698 706 10.1136/gutjnl-2020-323020 33431578 PMC7804842 Yeoh, Y. K. et al. Gut microbiota composition reflects disease severity and dysfunctional immune responses in patients with COVID-19. Gut 70 33431578 10.1136/gutjnl-2020-323020 PMC7804842 12. Kullberg R. F. J. et al. Association between butyrate-producing gut bacteria and the risk of infectious disease hospitalisation: results from two observational, population-based microbiome studies. Lancet Microbe 5 10.1016/S2666-5247(24)00079-X 38909617 13. Budden KF Emerging pathogenic links between microbiota and the gut-lung axis Nat. Rev. Microbiol 2017 15 55 63 10.1038/nrmicro.2016.142 27694885 Budden, K. F. et al. Emerging pathogenic links between microbiota and the gut-lung axis. Nat. Rev. Microbiol 15 27694885 10.1038/nrmicro.2016.142 14. Özçam M., Lynch S. V. The gut-airway microbiome axis in health and respiratory diseases. Nat. Rev. Microbiol 22 10.1038/s41579-024-01048-8 PMC12051635 38778224 15. Agus A Planchais J Sokol H Gut microbiota regulation of tryptophan metabolism in health and disease Cell Host Microbe 2018 23 716 724 10.1016/j.chom.2018.05.003 29902437 Agus, A., Planchais, J. & Sokol, H. Gut microbiota regulation of tryptophan metabolism in health and disease. Cell Host Microbe 23 29902437 10.1016/j.chom.2018.05.003 16. Roager HM Licht TR Microbial tryptophan catabolites in health and disease Nat. Commun. 2018 9 3294 10.1038/s41467-018-05470-4 30120222 PMC6098093 Roager, H. M. & Licht, T. R. Microbial tryptophan catabolites in health and disease. Nat. Commun. 9 30120222 10.1038/s41467-018-05470-4 PMC6098093 17. Lamas B CARD9 impacts colitis by altering gut microbiota metabolism of tryptophan into aryl hydrocarbon receptor ligands Nat. Med. 2016 22 598 605 10.1038/nm.4102 27158904 PMC5087285 Lamas, B. et al. CARD9 impacts colitis by altering gut microbiota metabolism of tryptophan into aryl hydrocarbon receptor ligands. Nat. Med. 22 27158904 10.1038/nm.4102 PMC5087285 18. Michaudel C Rewiring the altered tryptophan metabolism as a novel therapeutic strategy in inflammatory bowel diseases Gut 2023 72 1296 1307 10.1136/gutjnl-2022-327337 36270778 PMC10314090 Michaudel, C. et al. Rewiring the altered tryptophan metabolism as a novel therapeutic strategy in inflammatory bowel diseases. Gut 72 36270778 10.1136/gutjnl-2022-327337 PMC10314090 19. Natividad JM Impaired aryl hydrocarbon receptor ligand production by the gut microbiota is a key factor in metabolic syndrome Cell Metab. 2018 28 737 749.e4 10.1016/j.cmet.2018.07.001 30057068 Natividad, J. M. et al. Impaired aryl hydrocarbon receptor ligand production by the gut microbiota is a key factor in metabolic syndrome. Cell Metab. 28 30057068 10.1016/j.cmet.2018.07.001 20. Hu Y Interplay between diet, circulating indolepropionate concentrations and cardiometabolic health in US populations Gut 2023 72 2260 2271 10.1136/gutjnl-2023-330410 37739776 PMC10841831 Hu, Y. et al. Interplay between diet, circulating indolepropionate concentrations and cardiometabolic health in US populations. Gut 72 37739776 10.1136/gutjnl-2023-330410 PMC10841831 21. Tintelnot J Microbiota-derived 3-IAA influences chemotherapy efficacy in pancreatic cancer Nature 2023 615 168 174 10.1038/s41586-023-05728-y 36813961 PMC9977685 Tintelnot, J. et al. Microbiota-derived 3-IAA influences chemotherapy efficacy in pancreatic cancer. Nature 615 36813961 10.1038/s41586-023-05728-y PMC9977685 22. Yan Z Multi-omics analyses of airway host-microbe interactions in chronic obstructive pulmonary disease identify potential therapeutic interventions Nat. Microbiol 2022 7 1361 1375 10.1038/s41564-022-01196-8 35995842 Yan, Z. et al. Multi-omics analyses of airway host-microbe interactions in chronic obstructive pulmonary disease identify potential therapeutic interventions. Nat. Microbiol 7 35995842 10.1038/s41564-022-01196-8 23. Wang H Gut microbiota-derived tryptophan metabolites alleviate allergic asthma inflammation in ovalbumin-induced mice Foods 2024 13 1336 10.3390/foods13091336 38731707 PMC11082989 Wang, H. et al. Gut microbiota-derived tryptophan metabolites alleviate allergic asthma inflammation in ovalbumin-induced mice. Foods 13 38731707 10.3390/foods13091336 PMC11082989 24. Torres A Peetermans WE Viegi G Blasi F Risk factors for community-acquired pneumonia in adults in Europe: a literature review Thorax 2013 68 1057 1065 10.1136/thoraxjnl-2013-204282 24130229 PMC3812874 Torres, A., Peetermans, W. E., Viegi, G. & Blasi, F. Risk factors for community-acquired pneumonia in adults in Europe: a literature review. Thorax 68 24130229 10.1136/thoraxjnl-2013-204282 PMC3812874 25. Huang ZB Gut microbiota-derived indole 3-propionic acid partially activates aryl hydrocarbon receptor to promote macrophage phagocytosis and attenuate septic injury Front. Cell Infect. Microbiol. 2022 12 1015386 10.3389/fcimb.2022.1015386 36299625 PMC9589056 Huang, Z. B. et al. Gut microbiota-derived indole 3-propionic acid partially activates aryl hydrocarbon receptor to promote macrophage phagocytosis and attenuate septic injury. Front. Cell Infect. Microbiol. 12 36299625 10.3389/fcimb.2022.1015386 PMC9589056 26. Heumel S Shotgun metagenomics and systemic targeted metabolomics highlight indole-3-propionic acid as a protective gut microbial metabolite against influenza infection Gut Microbes 2024 16 2325067 10.1080/19490976.2024.2325067 38445660 PMC10936607 Heumel, S. et al. Shotgun metagenomics and systemic targeted metabolomics highlight indole-3-propionic acid as a protective gut microbial metabolite against influenza infection. Gut Microbes 16 38445660 10.1080/19490976.2024.2325067 PMC10936607 27. Major J Endothelial AHR activity prevents lung barrier disruption in viral infection Nature 2023 621 813 820 10.1038/s41586-023-06287-y 37587341 PMC7615136 Major, J. et al. Endothelial AHR activity prevents lung barrier disruption in viral infection. Nature 621 37587341 10.1038/s41586-023-06287-y PMC7615136 28. Seo YD Wargo JA From bugs to drugs: bacterial 3-IAA enhances efficacy of chemotherapy in pancreatic cancer Cell Rep. Med 2023 4 101039 10.1016/j.xcrm.2023.101039 37196631 PMC10213830 Seo, Y. D. & Wargo, J. A. From bugs to drugs: bacterial 3-IAA enhances efficacy of chemotherapy in pancreatic cancer. Cell Rep. Med 4 37196631 10.1016/j.xcrm.2023.101039 PMC10213830 29. Barranco C Tryptophan metabolite improves PDAC response rates and survival Nat. Rev. Cancer 2023 23 272 10.1038/s41568-023-00566-6 36973408 Barranco, C. Tryptophan metabolite improves PDAC response rates and survival. Nat. Rev. Cancer 23 36973408 10.1038/s41568-023-00566-6 30. Walter J Armet AM Finlay BB Shanahan F Establishing or exaggerating causality for the gut microbiome: lessons from human microbiota-associated rodents Cell 2020 180 221 232 10.1016/j.cell.2019.12.025 31978342 Walter, J., Armet, A. M., Finlay, B. B. & Shanahan, F. Establishing or exaggerating causality for the gut microbiome: lessons from human microbiota-associated rodents. Cell 180 31978342 10.1016/j.cell.2019.12.025 31. Pietzner M Plasma metabolites to profile pathways in noncommunicable disease multimorbidity Nat. Med 2021 27 471 479 10.1038/s41591-021-01266-0 33707775 PMC8127079 Pietzner, M. et al. Plasma metabolites to profile pathways in noncommunicable disease multimorbidity. Nat. Med 27 33707775 10.1038/s41591-021-01266-0 PMC8127079 32. van Vught LA Incidence, risk factors, and attributable mortality of secondary infections in the intensive care unit after admission for sepsis JAMA 2016 315 1469 1479 10.1001/jama.2016.2691 26975785 van Vught, L. A. et al. Incidence, risk factors, and attributable mortality of secondary infections in the intensive care unit after admission for sepsis. JAMA 315 26975785 10.1001/jama.2016.2691 33. Scicluna BP Classification of patients with sepsis according to blood genomic endotype: a prospective cohort study Lancet Respir. Med. 2017 5 816 826 10.1016/S2213-2600(17)30294-1 28864056 Scicluna, B. P. et al. Classification of patients with sepsis according to blood genomic endotype: a prospective cohort study. Lancet Respir. Med. 5 28864056 10.1016/S2213-2600(17)30294-1 34. Michels EHA Association between age and the host response in critically ill patients with sepsis Crit. Care 2022 26 385 10.1186/s13054-022-04266-9 36514130 PMC9747080 Michels, E. H. A. et al. Association between age and the host response in critically ill patients with sepsis. Crit. Care 26 36514130 10.1186/s13054-022-04266-9 PMC9747080 35. Sikkens JJ Serologic surveillance and phylogenetic analysis of SARS-CoV-2 infection among hospital health care workers JAMA Netw. Open 2021 4 e2118554 10.1001/jamanetworkopen.2021.18554 34319354 PMC9437910 Sikkens, J. J. et al. Serologic surveillance and phylogenetic analysis of SARS-CoV-2 infection among hospital health care workers. JAMA Netw. Open 4 34319354 10.1001/jamanetworkopen.2021.18554 PMC9437910 36. Appelman B Time since SARS-CoV-2 infection and humoral immune response following BNT162b2 mRNA vaccination EbioMedicine 2021 72 103589 10.1016/j.ebiom.2021.103589 34571363 PMC8461365 Appelman, B. et al. Time since SARS-CoV-2 infection and humoral immune response following BNT162b2 mRNA vaccination. EbioMedicine 72 34571363 10.1016/j.ebiom.2021.103589 PMC8461365 37. Lefevre A Validation of a global quantitative analysis methodology of tryptophan metabolites in mice using LC-MS Talanta 2019 195 593 598 10.1016/j.talanta.2018.11.094 30625588 Lefevre, A. et al. Validation of a global quantitative analysis methodology of tryptophan metabolites in mice using LC-MS. Talanta 195 30625588 10.1016/j.talanta.2018.11.094 38. Chanderraj R In critically ill patients, anti-anaerobic antibiotics increase risk of adverse clinical outcomes Eur. Respir. J. 2023 61 2200910 10.1183/13993003.00910-2022 36229047 PMC9909213 Chanderraj, R. et al. In critically ill patients, anti-anaerobic antibiotics increase risk of adverse clinical outcomes. Eur. Respir. J. 61 36229047 10.1183/13993003.00910-2022 PMC9909213 39. Kullberg R. F. J. et al. Empirical antibiotic therapy for sepsis: save the anaerobic microbiota. Lancet Respir. Med 13 10.1016/S2213-2600(24)00257-1 39401510 40. Wu P The trans-omics landscape of COVID-19 Nat. Commun. 2021 12 4543 10.1038/s41467-021-24482-1 34315889 PMC8316550 Wu, P. et al. The trans-omics landscape of COVID-19. Nat. Commun. 12 34315889 10.1038/s41467-021-24482-1 PMC8316550 41. Kosyakovsky LB Machine learning approaches to the human metabolome in sepsis identify metabolic links with survival Intensive Care Med. Exp. 2022 10 24 10.1186/s40635-022-00445-8 35710638 PMC9203139 Kosyakovsky, L. B. et al. Machine learning approaches to the human metabolome in sepsis identify metabolic links with survival. Intensive Care Med. Exp. 10 35710638 10.1186/s40635-022-00445-8 PMC9203139 42. Van Engelen TSR CAST study group. Gut microbiome modulation by antibiotics in adult asthma: a human proof-of-concept intervention trial Clin. Gastroenterol. Hepatol. 2022 20 1404 1407.e4 10.1016/j.cgh.2021.07.030 34303860 Van Engelen, T. S. R. et al. CAST study group. Gut microbiome modulation by antibiotics in adult asthma: a human proof-of-concept intervention trial. Clin. Gastroenterol. Hepatol. 20 34303860 10.1016/j.cgh.2021.07.030 43. Wolff NS Jacobs MC Wiersinga WJ Hugenholtz F Pulmonary and intestinal microbiota dynamics during gram-negative pneumonia-derived sepsis Intensive Care Med Exp. 2021 9 35 10.1186/s40635-021-00398-4 34250564 PMC8272965 Wolff, N. S., Jacobs, M. C., Wiersinga, W. J. & Hugenholtz, F. Pulmonary and intestinal microbiota dynamics during gram-negative pneumonia-derived sepsis. Intensive Care Med Exp. 9 34250564 10.1186/s40635-021-00398-4 PMC8272965 44. Claushuis TAM Platelet glycoprotein VI aids in local immunity during pneumonia-derived sepsis caused by gram-negative bacteria Blood 2018 131 864 876 10.1182/blood-2017-06-788067 29187378 Claushuis, T. A. M. et al. Platelet glycoprotein VI aids in local immunity during pneumonia-derived sepsis caused by gram-negative bacteria. Blood 131 29187378 10.1182/blood-2017-06-788067 45. Qin W Liu Z van der Poll T de Vos AF Induction of acute or disseminating bacterial pneumonia in mice and sampling of infected organs for studying the host response to bacterial pneumonia Bio Protoc. 2022 12 e4287 10.21769/BioProtoc.4287 35118178 PMC8769758 Qin, W., Liu, Z., van der Poll, T. & de Vos, A. F. Induction of acute or disseminating bacterial pneumonia in mice and sampling of infected organs for studying the host response to bacterial pneumonia. Bio Protoc. 12 35118178 10.21769/BioProtoc.4287 PMC8769758 46. Podschun R Ullmann U Klebsiella spp. as nosocomial pathogens: epidemiology, taxonomy, typing methods, and pathogenicity factors Clin. Microbiol. Rev. 1998 11 589 603 10.1128/CMR.11.4.589 9767057 PMC88898 Podschun, R. & Ullmann, U. Klebsiella spp. as nosocomial pathogens: epidemiology, taxonomy, typing methods, and pathogenicity factors. Clin. Microbiol. Rev. 11 9767057 10.1128/cmr.11.4.589 PMC88898 47. Wang M Clinical outcomes and bacterial characteristics of carbapenem-resistant Klebsiella pneumoniae complex among patients from different global regions (CRACKLE-2): a prospective, multicentre, cohort study Lancet Infect. Dis. 2022 22 401 412 10.1016/S1473-3099(21)00399-6 34767753 PMC8882129 Wang, M. et al. Clinical outcomes and bacterial characteristics of carbapenem-resistant Klebsiella pneumoniae complex among patients from different global regions (CRACKLE-2): a prospective, multicentre, cohort study. Lancet Infect. Dis. 22 34767753 10.1016/S1473-3099(21)00399-6 PMC8882129 48. Ji Y Gao Y Chen H Yin Y Zhang W Indole-3-acetic acid alleviates nonalcoholic fatty liver disease in mice via attenuation of hepatic lipogenesis, and oxidative and inflammatory stress Nutrients 2019 11 2062 10.3390/nu11092062 31484323 PMC6769627 Ji, Y., Gao, Y., Chen, H., Yin, Y. & Zhang, W. Indole-3-acetic acid alleviates nonalcoholic fatty liver disease in mice via attenuation of hepatic lipogenesis, and oxidative and inflammatory stress. Nutrients 11 31484323 10.3390/nu11092062 PMC6769627 49. de Melo Pires Curi M Miyasaka TC Palanch CK Curi AC R. Effect of indole acetic acid on oxygen metabolism in cultured rat neutrophil Gen. Pharm. 1998 31 573 578 10.1016/S0306-3623(98)00032-9 9792217 de Melo, P. ires, Curi, M., Miyasaka, T. C., Palanch, C. K. & Curi, A. C. R. Effect of indole acetic acid on oxygen metabolism in cultured rat neutrophil. Gen. Pharm. 31 10.1016/s0306-3623(98)00032-9 9792217 50. Liu Z Bruton’s Tyrosine kinase in neutrophils Is crucial for host defense against Klebsiella pneumoniae J. Innate Immun. 2023 15 1 15 10.1159/000524583 35537415 PMC10643901 Liu, Z. et al. Bruton’s Tyrosine kinase in neutrophils Is crucial for host defense against Klebsiella pneumoniae. J. Innate Immun. 15 35537415 10.1159/000524583 PMC10643901 51. Pechous RD With friends like these: the complex role of neutrophils in the progression of severe pneumonia Front. Cell Infect. Microbiol. 2017 7 160 10.3389/fcimb.2017.00160 28507954 PMC5410563 Pechous, R. D. With friends like these: the complex role of neutrophils in the progression of severe pneumonia. Front. Cell Infect. Microbiol. 7 28507954 10.3389/fcimb.2017.00160 PMC5410563 52. Shankar-Hari M Reframing sepsis immunobiology for translation: towards informative subtyping and targeted immunomodulatory therapies Lancet Respir. Med. 2024 12 323 336 10.1016/S2213-2600(23)00468-X 38408467 PMC11025021 Shankar-Hari, M. et al. Reframing sepsis immunobiology for translation: towards informative subtyping and targeted immunomodulatory therapies. Lancet Respir. Med. 12 38408467 10.1016/S2213-2600(23)00468-X PMC11025021 53. Xue C Tryptophan metabolism in health and disease Cell Metab. 2023 35 1304 1326 10.1016/j.cmet.2023.06.004 37352864 Xue, C. et al. Tryptophan metabolism in health and disease. Cell Metab. 35 37352864 10.1016/j.cmet.2023.06.004 54. Su X Gut microbiota-derived metabolite 3-idoleacetic acid together with LPS induces IL-35 + Microbiome 2022 10 13 10.1186/s40168-021-01205-8 35074011 PMC8785567 Su, X. et al. Gut microbiota-derived metabolite 3-idoleacetic acid together with LPS induces IL-35 + Microbiome 10 35074011 10.1186/s40168-021-01205-8 PMC8785567 55. Gao J Impact of the gut microbiota on intestinal immunity mediated by tryptophan metabolism Front Cell Infect. Microbiol. 2018 8 13 10.3389/fcimb.2018.00013 29468141 PMC5808205 Gao, J. et al. Impact of the gut microbiota on intestinal immunity mediated by tryptophan metabolism. Front Cell Infect. Microbiol. 8 29468141 10.3389/fcimb.2018.00013 PMC5808205 56. Zhang F Gut microbiota in COVID-19: key microbial changes, potential mechanisms and clinical applications Nat. Rev. Gastroenterol. Hepatol. 2023 20 323 337 10.1038/s41575-022-00698-4 36271144 PMC9589856 Zhang, F. et al. Gut microbiota in COVID-19: key microbial changes, potential mechanisms and clinical applications. Nat. Rev. Gastroenterol. Hepatol. 20 36271144 10.1038/s41575-022-00698-4 PMC9589856 57. Schlechte J Dysbiosis of a microbiota-immune metasystem in critical illness is associated with nosocomial infections Nat. Med. 2023 29 1017 1027 10.1038/s41591-023-02243-5 36894652 PMC10115642 Schlechte, J. et al. Dysbiosis of a microbiota-immune metasystem in critical illness is associated with nosocomial infections. Nat. Med. 29 36894652 10.1038/s41591-023-02243-5 PMC10115642 58. Sinha A. K. et al. Dietary fibre directs microbial tryptophan metabolism via metabolic interactions in the gut microbiota. Nat. Microbiol 9 10.1038/s41564-024-01737-3 PMC11306097 38918470 59. Lamas B Natividad JM Sokol H Aryl hydrocarbon receptor and intestinal immunity Mucosal Immunol. 2018 11 1024 1038 29626198 10.1038/s41385-018-0019-2 Lamas, B., Natividad, J. M. & Sokol, H. Aryl hydrocarbon receptor and intestinal immunity. Mucosal Immunol. 11 29626198 10.1038/s41385-018-0019-2 60. Wolff NS Vendor effects on murine gut microbiota and its influence on lipopolysaccharide-induced lung inflammation and gram-negative pneumonia Intensive Care Med Exp. 2020 8 47 10.1186/s40635-020-00336-w 32840685 PMC7447702 Wolff, N. S. et al. Vendor effects on murine gut microbiota and its influence on lipopolysaccharide-induced lung inflammation and gram-negative pneumonia. Intensive Care Med Exp. 8 32840685 10.1186/s40635-020-00336-w PMC7447702 61. Villarino NF Composition of the gut microbiota modulates the severity of malaria Proc. Natl. Acad. Sci. USA 2016 113 2235 2240 10.1073/pnas.1504887113 26858424 PMC4776451 Villarino, N. F. et al. Composition of the gut microbiota modulates the severity of malaria. Proc. Natl. Acad. Sci. USA 113 26858424 10.1073/pnas.1504887113 PMC4776451 62. Day N EPIC-Norfolk: study design and characteristics of the cohort. European prospective investigation of cancer Br. J. Cancer 1999 80 95 103 10466767 Day, N. et al. EPIC-Norfolk: study design and characteristics of the cohort. European prospective investigation of cancer. Br. J. Cancer 80 10466767 63. Klein Klouwenberg PM Interobserver agreement of centers for disease control and prevention criteria for classifying infections in critically ill patients Crit. Care Med. 2013 41 2373 2378 10.1097/CCM.0b013e3182923712 23921277 Klein Klouwenberg, P. M. et al. Interobserver agreement of centers for disease control and prevention criteria for classifying infections in critically ill patients. Crit. Care Med. 41 23921277 10.1097/CCM.0b013e3182923712 64. Singer M The third international consensus definitions for sepsis and septic shock (Sepsis-3) JAMA 2016 315 801 810 10.1001/jama.2016.0287 26903338 PMC4968574 Singer, M. et al. The third international consensus definitions for sepsis and septic shock (Sepsis-3). JAMA 315 26903338 10.1001/jama.2016.0287 PMC4968574 65. Pereverzeva L Blood leukocyte transcriptomes in Gram-positive and Gram-negative community-acquired pneumonia Eur. Respir. J. 2022 59 2101856 10.1183/13993003.01856-2021 34446464 Pereverzeva, L. et al. Blood leukocyte transcriptomes in Gram-positive and Gram-negative community-acquired pneumonia. Eur. Respir. J. 59 34446464 10.1183/13993003.01856-2021 66. Brands X Plasma ferritin as marker of macrophage activation-like syndrome in critically ill patients with community-acquired pneumonia Crit. Care Med. 2021 49 1901 1911 10.1097/CCM.0000000000005072 33935163 Brands, X. et al. Plasma ferritin as marker of macrophage activation-like syndrome in critically ill patients with community-acquired pneumonia. Crit. Care Med. 49 33935163 10.1097/CCM.0000000000005072 67. Chouchane O The plasma lipidomic landscape in patients with sepsis due to community-acquired pneumonia Am. J. Respir. Crit. Care Med. 2024 209 973 986 10.1164/rccm.202308-1321OC 38240721 PMC12039242 Chouchane, O. et al. The plasma lipidomic landscape in patients with sepsis due to community-acquired pneumonia. Am. J. Respir. Crit. Care Med. 209 38240721 10.1164/rccm.202308-1321OC PMC12039242 68. Yang J Effect of C1-inhibitor in adults with mild asthma: a randomized controlled trial Allergy 2020 75 953 955 10.1111/all.14053 31535384 PMC7216929 Yang, J. et al. Effect of C1-inhibitor in adults with mild asthma: a randomized controlled trial. Allergy 75 31535384 10.1111/all.14053 PMC7216929 69. Lankelma JM Antibiotic-induced gut microbiota disruption during human endotoxemia: a randomised controlled study Gut 2017 66 1623 1630 10.1136/gutjnl-2016-312132 27307305 Lankelma, J. M. et al. Antibiotic-induced gut microbiota disruption during human endotoxemia: a randomised controlled study. Gut 66 27307305 10.1136/gutjnl-2016-312132 70. Harris VC Effect of antibiotic-mediated microbiome modulation on rotavirus vaccine immunogenicity: a human, randomized-control proof-of-concept trial Cell Host Microbe 2018 24 197 207.e4 10.1016/j.chom.2018.07.005 30092197 PMC11514417 Harris, V. C. et al. Effect of antibiotic-mediated microbiome modulation on rotavirus vaccine immunogenicity: a human, randomized-control proof-of-concept trial. Cell Host Microbe 24 30092197 10.1016/j.chom.2018.07.005 PMC11514417 71. de Porto AP Bruton’s Tyrosine kinase-mediated signaling in myeloid cells is required for protective innate immunity during pneumococcal pneumonia. Front. Immunol. 2021 12 723967 10.3389/fimmu.2021.723967 34552589 PMC8450579 de Porto, A. P. et al. Bruton’s Tyrosine kinase-mediated signaling in myeloid cells is required for protective innate immunity during pneumococcal pneumonia. Front. Immunol. 12 34552589 10.3389/fimmu.2021.723967 PMC8450579 72. Qin W Role of myeloid tet methylcytosine dioxygenase 2 in pulmonary and peritoneal inflammation induced by lipopolysaccharide and peritonitis induced by Escherichia coli Cells 2021 11 82 10.3390/cells11010082 35011643 PMC8750455 Qin, W. et al. Role of myeloid tet methylcytosine dioxygenase 2 in pulmonary and peritoneal inflammation induced by lipopolysaccharide and peritonitis induced by Escherichia coli Cells 11 35011643 10.3390/cells11010082 PMC8750455 73. Dahlgren C Karlsson A Bylund J Measurement of respiratory burst products generated by professional phagocytes Methods Mol. Biol. 2007 412 349 363 10.1007/978-1-59745-467-4_23 18453123 Dahlgren, C., Karlsson, A. & Bylund, J. Measurement of respiratory burst products generated by professional phagocytes. Methods Mol. Biol. 412 18453123 10.1007/978-1-59745-467-4_23 74. Hedges LV Distribution theory for glass’s estimator of effect size and related estimators J. Educ. Stat. 1981 6 107 128 10.3102/10769986006002107 Hedges, L. V. Distribution theory for glass’s estimator of effect size and related estimators. J. Educ. Stat. 6 75. Fabregat A The reactome pathway knowledgebase Nucleic Acids Res. 2018 46 D649 D655 10.1093/nar/gkx1132 29145629 PMC5753187 Fabregat, A. et al. The reactome pathway knowledgebase. Nucleic Acids Res. 46 29145629 10.1093/nar/gkx1132 PMC5753187 76. Yu G He QY ReactomePA: an R/Bioconductor package for reactome pathway analysis and visualization Mol. Biosyst. 2016 12 477 479 10.1039/C5MB00663E 26661513 Yu, G. & He, Q. Y. ReactomePA: an R/Bioconductor package for reactome pathway analysis and visualization. Mol. Biosyst. 12 26661513 10.1039/c5mb00663e 77. Kullberg RFJ van Linge CCA Effect of the gut microbiota-derived tryptophan metabolite indole-3-acetic acid in pneumonia Github Repos. 2025 10.5281/zenodo.15836609 41022731 Kullberg, R. F. J., van Linge, C. C. A. et al. Effect of the gut microbiota-derived tryptophan metabolite indole-3-acetic acid in pneumonia. Github Repos. 10.1038/s41467-025-63611-y 41022731 ",
  "metadata": {
    "Title of this paper": "Effect of the gut microbiota-derived tryptophan metabolite indole-3-acetic acid in pneumonia",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480536/"
  }
}