{
  "title": "Paper_472",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12484841 PMC12484841.1 12484841 12484841 41028062 10.1038/s41598-025-12807-9 12807 1 Article SARS-CoV-2 spike protein-induced inflammation underlies proarrhythmia in COVID-19 Mezache Louisa mezache.2@osu.edu 1 Soltisz Andrew 2 Tili Esmerina 3 Nuovo Gerard J. nuovo.1@osu.edu 3 4 5 Veeraraghavan Rengasayee veeraraghavan.12@osu.edu 2 6 1 https://ror.org/00rs6vg23 grid.261331.4 0000 0001 2285 7943 College of Pharmacy , The Ohio State University , 2 https://ror.org/00rs6vg23 grid.261331.4 0000 0001 2285 7943 Department of Biomedical Engineering College of Engineering , The Ohio State University , 3 https://ror.org/00c01js51 grid.412332.5 0000 0001 1545 0811 Ohio State University Medical Center , 4 https://ror.org/028t46f04 grid.413944.f 0000 0001 0447 4797 The Ohio State University Comprehensive Cancer Center , 5 6 https://ror.org/00c01js51 grid.412332.5 0000 0001 1545 0811 The Frick Center for Heart Failure and Arrhythmia College of Medicine, Dorothy M. Davis Heart and Lung Research Institute, The Ohio State University Wexner Medical Center, 30 9 2025 2025 15 478255 33991 24 3 2025 21 7 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Coronavirus disease 2019 (COVID-19) patients have a 1.7-fold higher arrhythmia risk with rates of cardiac complications ranging from 2% non-ICU patients to 59% in non-survivors. Atrial fibrillation (AF), the most common arrhythmia, is a frequent complication of acute and long COVID-19. The high expression of ACE2 in the heart suggested that infectious virus may underlie cardiac complications. However, we recently reported in human cardiac tissue from fatal COVID-19 cases perivascular spike protein, elevated pro-inflammatory cytokines, vascular damage, and cardiac remodeling without evidence for direct infection of cardiac cells by SARS-CoV2. Mislocalization of intercalated disc (ID) components, connexin-43 (Cx43) gap junctions and Na V V Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-12807-9. Subject terms Cardiovascular biology Cardiovascular biology https://doi.org/10.13039/100000050 National Heart, Lung, and Blood Institute R01HL148736 R01HL165751 R01HL148736 Mezache Louisa Soltisz Andrew Veeraraghavan Rengasayee pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Atrial arrhythmias are a frequent complication of acute and long Coronavirus disease 2019 (COVID-19) 1 2 3 4 5 5 6 7 8 11 7 9 12 15 SARS-CoV-2 spike protein components, S1 (ACE2 binding subunit) and S2 subunits, are essential for viral binding and infiltration of host cells and have been implicated in eliciting cytokine storms following viral infection. Indeed, fatal COVID-19 hearts also demonstrated elevated levels of inflammatory markers, TNFα, IL-6, and caspase-3, showing the same perivascular distribution as spike protein. Furthermore, histologic analysis revealed considerable microvascular damage, including enlarged endothelial cells, perivascular edema, and formation of microvascular thrombi, each well documented sequela of severe COVID-19, and findings we reported in our previous study 7 V The histologic and molecular observations from patient hearts with fatal COVID-19 infection are consistent with an arrhythmia mechanism we previously identified, wherein an acute inflammatory insult – such as elicited by viral spike protein – triggers vascular endothelial dysfunction, thereby initiating cardiomyocyte structural remodeling, particularly of intercalated disc (ID) components including Cx43 gap junctions (GJs) and Na V 16 17 Methods All animal procedures were approved by Institutional Animal Care and Use Committee at The Ohio State University and performed in accordance with the Guide for the Care and Use of Laboratory Animals published by the U.S. National Institutes of Health (NIH Publication No. 85 − 23, revised 2011). All methods are reported in accordance with ARRIVE guidelines. Animals Wild-type male C57BL/6 mice aged 9 months were used, 6 for each treatment group. Due to the limited availability of the COVID spike protein and the well-documented sex differences in cardiovascular complications— where males are more severely affected 18 19 In vivo ECG Acute 20 S1  i) Cryopreservation 21 24 ii) Fixation for Transmission Electron Microscopy (TEM) 22 23 Primary antibodies The following primary antibodies were used for Western immunoblotting and fluorescence microscopy studies:  Connexin43 (Cx43; mouse monoclonal; EMD Millipore Corp. MAB3067). N-cadherin (N-cad; mouse monoclonal; BD Biosciences 610920). Cardiac isoform of the voltage-gated sodium channel (Na V 22 SARS-CoV-2 spike protein.  S1 subunit (ProSci 9083). S2 subunit (ProSci 9123). Vascular endothelial growth factor A (VEGF-A; mouse monoclonal; Abcam ab1316). Interleukin 6 (IL-6; rabbit polyclonal; Abcam ab6672). Caspase-3 (rabbit polyclonal; Abcam ab4051). Tumor necrosis factor alpha (TNFα; rabbit polyclonal; Proteintech 26405). Immunohistochemistry Immunofluorescent labeling of cryosections (5 μm thickness) of fresh-frozen myocardium was performed, as previously described 20 22 23 25 Samples were then labeled with goat anti-mouse and goat anti-rabbit secondary antibodies conjugated to Alexa 488, Alexa 568 and Alexa 647 were used (1:8000; ThermoFisher Scientific, Grand Island, NY). Samples were then washed in PBS (3 × 5 min in PBS at room temperature) and mounted in ProLong Gold (Invitrogen, Rockford, IL). For simultaneous three-color imaging, immunofluorescent labeling was performed as previously described 26 7 Transmission electron microscopy (TEM) TEM images of the ID, particularly gap junctions (GJs) and mechanical junctions (MJs), were obtained at 60,000x magnification on a FEI Tecnai G2 Spirit electron microscope. Intermembrane distance was measured at a distance of 50 nm from the edges of GJs and MJs using ImageJ (NIH, http://rsbweb.nih.gov/ij/ 22 23 Confocal imaging Confocal imaging was performed using an A1R-HD laser scanning confocal microscope equipped with four solid-state lasers (405 nm, 488 nm, 560 nm, 640 nm, 30 mW each), a 63x/1.4 numerical aperture oil immersion objective, two GaAsP detectors, and two high sensitivity photomultiplier tube detectors (Nikon, Melville, NY). Individual fluorophores were imaged sequentially with the excitation wavelength switching at the end of each frame. Images were collected as z-stacks with fluorophores images sequentially (line-wise) to achieve optimal spectral separation, followed by 3D deconvolution. Images were analyzed using our point pattern analysis-based spatial analysis approach, Spatial Pattern Analysis using Closest Events (SPACE) 27 28 Statistical analysis Treatments were applied in unblinded fashion for all studies. Distributions of measurements were compared using the two-sample Kolmogorov-Smirnov test, while the Wilcoxon Rank Sum test (for TEM data) and a weighted Student’s T-test (for SPACE outputs) were used for comparisons of central tendency. The Bonferroni correction was applied for multiple comparisons. A p Results Intravenous SARS-CoV2 spike protein increases arrhythmia inducibility in mice To investigate if an acute inflammatory insult from viral spike protein is sufficient to precipitate cardiac arrhythmias, we collected in vivo ECGs from adult wild-type mice 5 days following intravenous injection of viral spike protein or its individual components (S1 or S2). Dosing was determined by levels reported in patients experiencing severe symptoms due to viral infection. Control groups included mice injected with albumin, a globular protein of similar size to spike protein, or a low dose of the S1 subunit mimicking vaccine levels (vS1 [10 µg]). Mice injected with high dose of spike protein showed increased arrhythmia burden (total arrhythmia duration per hour of observation) compared with control groups (Fig. 1 2  Fig. 1 Impact of spike protein on atrial arrhythmia susceptibility. (A) Representative in vivo surface ECG illustrates atrial arrhythmia observed in a spike protein-injected mouse following caffeine + epinephrine challenge. (B) n n n p (C) n p  Table 2 Characteristics of atrial arrhythmias observed in mice treated with SARS-CoV2 Spike protein and albumin (controls). Characteristics of atrial arrhythmias Albumin control Spike-treated (high dose) # of experiments 6 18 # of atrial arrhythmias 18 46 # of AFlutter episodes 11 17 # of AFib episodes 7 29 Median duration (s) of atrial arrhythmias 1.7 3.7 SE (s) 15.2 22.5 p vs. Albumin control (Two Sample KS test comparing distributions of durations; α = 0.05) 0.0073 p vs. albumin control (Wilcoxon’s test comparing median durations; α = 0.05) 0.0153 # of AFib episodes ≥ 30s 2 11 Median p-wave duration (s) 0.029 0.025 SE (s) 0.0010 0.00076 Inflammatory markers and spike protein colocalize to vascular endothelium Hearts from patients infected with severe or fatal COVID-19 infection displayed elevated levels of proinflammatory cytokines TNFα and IL-6, and protease caspase-3, localized to vascular endothelial cells 7 2 1 2 1 2  Fig. 2 Histologic observations following spike protein insult. (A) (B) (C)  Table 1 Number of microvessels/cm positive for Spike protein and inflammatory markers per square cm of tissue (Values are mean ± standard deviation; albumin control and low dose S1 n n Category Spike 1 Spike 2 Caspase-3 IL-6 TNFα VEGF Albumin (control) 0 0 0 0 0 1.9 ± 0.1 Low dose S1 (vS1–10 µg) 0.8 ± 0.2 0 1.0 ± 0.2 0.4 ± 0.1 1.0 ± 0.2 Not done High dose S1 + S2 (50 µg) 15.6 ± 1.2 11.9 ± 1.3 13.9 ± 3.3 15.4 ± 2.0 12.0 ± 2.9 17.4 ± 5.1 ID structural remodeling following spike protein insult We previously showed that pathologically elevated vascular leak leads to ultrastructural remodeling within the ID following an acute inflammatory insult 16 3 3  Fig. 3 Ultrastructural effects of spike protein insult. (A) Representative TEM images of IDs from murine atria. White arrows point to GJs, and black arrows point to MJs. (B) n p p ID proteins undergo reorganization following spike protein insult As part of our previously identified arrhythmia mechanism, we identified molecular remodeling within perinexal and MJ-adjacent regions of ID swelling 16 V Low magnification confocal images of ventricular myocardium suggested potential lateralization of Cx43 and Na V V 4 V V en face V 5 V 5 V 28 V 5 V  Fig. 4 Confocal survey views of murine atria. Representative 2D confocal images showing some instances of Cx43 lateralization as well as elevated detection of Na V V V n  Fig. 5 3D Confocal imaging of individual en face IDs. Representative 3D confocal images of en face (A) (B) V V V (C) V n p p Discussion Cardiac arrhythmias are a common complication in severe and fatal cases of COVID-19, with increased arrhythmia incidence correlated with severity of viral infection 2 3 29 30 9 11 V 7 7 9 12 15 16 Our recently published study in human cardiac tissue suggests insult from viral spike protein alone may be sufficient to precipitate arrhythmias. Therefore, we investigated the functional and structural impacts of spike protein in mice 5 days following initial insult. Mice injected with high levels of SARS-CoV2 spike protein demonstrated increased arrhythmia burden, reflecting arrhythmia prevalence in severe/fatal COVID-19 infection. These mice also mimicked the histologic and molecular findings in human cardiac tissue from fatal COVID-19 cases, including elevated expression of pro-inflammatory cytokines, atypical microvascular endothelial cells, perivascular edema, red blood cell extravasation and extensive ID protein remodeling. As noted above, the absence of evidence for direct infection of the heart by SARS-CoV2 suggests that cardiac pathogenesis in COVID-19 may occur independent of direct viral infection of the heart. We observed significant proarrhythmia following spike protein injection in wild-type mice without humanized ACE2 receptors and observed similar impacts from independent administration of the ACE-binding S1 subunit and/or the S2 subunit of the SARS-CoV2 spike protein. These results, along with the lack of efficacy of ACE2 inhibitors for the treatment of COVID-19 15 , 31 Previous work by our group demonstrated swelling of GJ-adjacent perinexal and MJ-adjacent ID regions and concomitant Na V 16 V 32 33 16 V V 34 Taken together, the results presented here provide strong evidence for a potential role of viral spike protein in not only initiating, but also in perpetuating, arrhythmias in COVID-19 patients. Further, we isolated each spike protein subunit and investigated their impact on cardiac function and structure individually and in combination. While the S1 subunit, containing the receptor binding domain, yielded a significant increase in arrhythmia burden, the S2 subunit, essential for host cell internalization, demonstrated similar detrimental functional and structural cardiac effects. However, it should be noted that our results may underestimate the proarrhythmic impact of the S1, which merits reassessment in mice expressing humanized ACE2 receptors. Histologic examination of S1 and/or S2 -treated mice evidenced increased expression of pro-inflammatory cytokines and compromised microvasculature, linking inflammation-induced vascular leak to the observed arrhythmia burden, consistent with our previous results 16 2+ 2+ 35 2+ 36 37 Limitations SARS-CoV2 S1 recognizes and binds to human ACE2, which is distinct from the murine ACE2. However, the present study utilized wild-type mice and found only moderate proarrhythmic impacts from S1 injection. Future studies in mice expressing humanized ACE2 receptors are needed to fully assess S1-induced proarrhythmia. Nevertheless, we observed significant functional differences in our S1-injected mice compared to control groups, indicating that it can elicit proarrhythmic inflammatory responses even in the absence of human ACE2 receptors. Further, the presence alone of S2, which lacks the ACE2 binding domain, was enough to precipitate arrhythmias, further underscoring the proarrhythmic potential of SARS-CoV2 spike proteins. Additionally, comparison of the proarrhythmic effects between SARS-CoV2 spike protein and those from other envelope viruses would be useful; however, such studies fell beyond the scope of this study. We focus here on mechanisms underlying arrhythmia substrate formation given our previous work on inflammation-induced arrhythmia. However, inflammation can also promote arrhythmia triggers via calcium mishandling. Thus, future work should investigate the mechanisms of trigger formation under inflammatory conditions. Finally, while we recognize the importance of incorporating female mice in these studies, limited availability of spike protein available constrained the scope of our experiments. While our study design is consistent with the male predominance of COVID-induced AF observed in patients, future studies incorporating larger cohorts should investigate sex-specific effects in COVID-19-associated CV risk. Conclusions In summary, we provide evidence that the inflammatory response elicited by SARS-CoV2 spike protein components is sufficient to induce a substrate for atrial arrhythmias even in the absence of direct viral infection. Further, we demonstrate that these atrial arrhythmias occur secondary to inflammation-induced vascular leak, and consequent ID nanodomain remodeling, suggesting that severe COVID-19 induces a proarrhythmic mechanism similar to that observed after an acute inflammatory insult. We recently proposed vascular endothelial barrier protection as a mechanistically-derived antiarrhythmic strategy for the prevention of AF in its early stages, especially in inflammation-associated etiologies 37 Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions LM performed the mouse experiments and microscopy image collection in addition to preparing the manuscript and assisting with study design and interpretation of results. AS performed computational image analysis on microscopy data. ET assisted with mouse experiments. GJN and RV conceptualized and designed the study, and assisted with manuscript preparation. RV oversaw the experimental aspects of the study and mentored LM and AS. Funding This work was supported by grants (R01 HL148736 and R01 HL165751) awarded to RV from the National Institutes of Health and an American Heart Association predoctoral fellowship awarded to LM. Data availability All research data pertaining to this study are stored on secure servers at OSU and will be shared freely upon request. Please direct requests for data sharing to R. Veeraraghavan (veeraraghavan.12@osu.edu). Declarations Competing interests The authors declare no competing interests. References 1. Mohammad M Cardiac arrhythmias associated with COVID-19 infection: state of the Art review Expert Rev. Cardiovasc. Ther. 2021 19 881 889 10.1080/14779072.2021.1997589 34702128 PMC8607535 Mohammad, M. et al. Cardiac arrhythmias associated with COVID-19 infection: state of the Art review. Expert Rev. Cardiovasc. Ther. 19 34702128 10.1080/14779072.2021.1997589 PMC8607535 2. Li X Cardiac injury associated with severe disease or ICU admission and death in hospitalized patients with COVID-19: a meta-analysis and systematic review Crit. Care 2020 24 468 10.1186/s13054-020-03183-z 32723362 PMC7386170 Li, X. et al. Cardiac injury associated with severe disease or ICU admission and death in hospitalized patients with COVID-19: a meta-analysis and systematic review. Crit. Care 24 32723362 10.1186/s13054-020-03183-z PMC7386170 3. Rav-Acha M Cardiac arrhythmias amongst hospitalised coronavirus 2019 (COVID-19) patients: prevalence, characterisation, and clinical algorithm to classify arrhythmic risk Int. J. Clin. Pract. 2021 75 e13788 10.1111/ijcp.13788 33128270 Rav-Acha, M. et al. Cardiac arrhythmias amongst hospitalised coronavirus 2019 (COVID-19) patients: prevalence, characterisation, and clinical algorithm to classify arrhythmic risk. Int. J. Clin. Pract. 75 33128270 10.1111/ijcp.13788 4. Chen L Li X Chen M Feng Y Xiong C The ACE2 expression in human heart indicates new potential mechanism of heart injury among patients infected with SARS-CoV-2 Cardiovasc. Res. 2020 116 1097 1100 10.1093/cvr/cvaa078 32227090 PMC7184507 Chen, L., Li, X., Chen, M., Feng, Y. & Xiong, C. The ACE2 expression in human heart indicates new potential mechanism of heart injury among patients infected with SARS-CoV-2. Cardiovasc. Res. 116 32227090 10.1093/cvr/cvaa078 PMC7184507 5. Herman-Edelstein M Expression of the SARS-CoV-2 receptorACE2 in human heart is associated with uncontrolled diabetes, obesity, and activation of the Renin angiotensin system Cardiovasc. Diabetol. 2021 20 90 10.1186/s12933-021-01275-w 33906662 PMC8078096 Herman-Edelstein, M. et al. Expression of the SARS-CoV-2 receptorACE2 in human heart is associated with uncontrolled diabetes, obesity, and activation of the Renin angiotensin system. Cardiovasc. Diabetol. 20 33906662 10.1186/s12933-021-01275-w PMC8078096 6. Vukusic K Overexpression of the SARS-CoV-2 receptor angiotensin converting enzyme 2 in cardiomyocytes of failing hearts Sci. Rep. 2022 12 965 10.1038/s41598-022-04956-y 35046458 PMC8770525 Vukusic, K. et al. Overexpression of the SARS-CoV-2 receptor angiotensin converting enzyme 2 in cardiomyocytes of failing hearts. Sci. Rep. 12 35046458 10.1038/s41598-022-04956-y PMC8770525 7. Mezache L Histologic, viral, and molecular correlates of heart disease in fatal COVID-19 Ann. Diagn. Pathol. 2022 60 151983 10.1016/j.anndiagpath.2022.151983 35660807 PMC9148434 Mezache, L. et al. Histologic, viral, and molecular correlates of heart disease in fatal COVID-19. Ann. Diagn. Pathol. 60 35660807 10.1016/j.anndiagpath.2022.151983 PMC9148434 8. Bois MC COVID-19-Associated nonocclusive fibrin microthrombi in the heart Circulation 2021 143 230 243 10.1161/CIRCULATIONAHA.120.050754 33197204 PMC7805556 Bois, M. C. et al. COVID-19-Associated nonocclusive fibrin microthrombi in the heart. Circulation 143 33197204 10.1161/CIRCULATIONAHA.120.050754 PMC7805556 9. Delorey TM COVID-19 tissue atlases reveal SARS-CoV-2 pathology and cellular targets Nature 2021 595 107 113 10.1038/s41586-021-03570-8 33915569 PMC8919505 Delorey, T. M. et al. COVID-19 tissue atlases reveal SARS-CoV-2 pathology and cellular targets. Nature 595 33915569 10.1038/s41586-021-03570-8 PMC8919505 10. Li H SARS-CoV-2 and viral sepsis: observations and hypotheses Lancet 2020 395 1517 1520 10.1016/S0140-6736(20)30920-X 32311318 PMC7164875 Li, H. et al. SARS-CoV-2 and viral sepsis: observations and hypotheses. Lancet 395 32311318 10.1016/S0140-6736(20)30920-X PMC7164875 11. Zhang Y New Understanding of the damage of SARS-CoV-2 infection outside the respiratory system Biomed. Pharmacother 2020 127 110195 10.1016/j.biopha.2020.110195 32361161 PMC7186209 Zhang, Y. et al. New Understanding of the damage of SARS-CoV-2 infection outside the respiratory system. Biomed. Pharmacother 127 32361161 10.1016/j.biopha.2020.110195 PMC7186209 12. Avolio E The SARS-CoV-2 Spike protein disrupts human cardiac pericytes function through CD147 receptor-mediated signalling: a potential non-infective mechanism of COVID-19 microvascular disease Clin. Sci. (Lond) 2021 135 2667 2689 10.1042/CS20210735 34807265 PMC8674568 Avolio, E. et al. The SARS-CoV-2 Spike protein disrupts human cardiac pericytes function through CD147 receptor-mediated signalling: a potential non-infective mechanism of COVID-19 microvascular disease. Clin. Sci. (Lond) 135 34807265 10.1042/CS20210735 PMC8674568 13. Huang X Sars-Cov-2 Spike Protein-Induced damage of hiPSC-Derived cardiomyocytes Adv. Biol. (Weinh) 2022 6 e2101327 10.1002/adbi.202101327 35523737 PMC9347759 Huang, X. et al. Sars-Cov-2 Spike Protein-Induced damage of hiPSC-Derived cardiomyocytes. Adv. Biol. (Weinh) 6 35523737 10.1002/adbi.202101327 PMC9347759 14. Kato Y TRPC3-Nox2 protein complex formation increases the risk of SARS-CoV-2 spike protein-induced cardiomyocyte dysfunction through ACE2 upregulation Int. J. Mol. Sci. 2022 10.3390/ijms24010102 36613540 PMC9820218 Kato, Y. et al. TRPC3-Nox2 protein complex formation increases the risk of SARS-CoV-2 spike protein-induced cardiomyocyte dysfunction through ACE2 upregulation. Int. J. Mol. Sci. 36613540 10.3390/ijms24010102 PMC9820218 15. Paidi RK ACE-2-interacting domain of SARS-CoV-2 (AIDS) peptide suppresses inflammation to reduce fever and protect lungs and heart in mice: implications for COVID-19 therapy J. Neuroimmune Pharmacol. 2021 16 59 70 10.1007/s11481-020-09979-8 33426604 PMC7797355 Paidi, R. K. et al. ACE-2-interacting domain of SARS-CoV-2 (AIDS) peptide suppresses inflammation to reduce fever and protect lungs and heart in mice: implications for COVID-19 therapy. J. Neuroimmune Pharmacol. 16 33426604 10.1007/s11481-020-09979-8 PMC7797355 16. Mezache L Vascular endothelial growth factor promotes atrial arrhythmias by inducing acute intercalated disk remodeling Sci. Rep. 2020 10 20463 10.1038/s41598-020-77562-5 33235263 PMC7687901 Mezache, L. et al. Vascular endothelial growth factor promotes atrial arrhythmias by inducing acute intercalated disk remodeling. Sci. Rep. 10 33235263 10.1038/s41598-020-77562-5 PMC7687901 17. Nuovo GJ Endothelial cell damage is the central part of COVID-19 and a mouse model induced by injection of the S1 subunit of the Spike protein Ann. Diagn. Pathol. 2021 51 151682 10.1016/j.anndiagpath.2020.151682 33360731 PMC7758180 Nuovo, G. J. et al. Endothelial cell damage is the central part of COVID-19 and a mouse model induced by injection of the S1 subunit of the Spike protein. Ann. Diagn. Pathol. 51 33360731 10.1016/j.anndiagpath.2020.151682 PMC7758180 18. Hockham C Sex differences in cardiovascular complications and mortality in hospital patients with covid-19: registry based observational study BMJ Med. 2023 2 e000245 10.1136/bmjmed-2022-000245 37067859 PMC10083523 Hockham, C. et al. Sex differences in cardiovascular complications and mortality in hospital patients with covid-19: registry based observational study. BMJ Med. 2 37067859 10.1136/bmjmed-2022-000245 PMC10083523 19. Offerhaus JA Sex- and age specific association of new-onset atrial fibrillation with in-hospital mortality in hospitalised COVID-19 patients Int. J. Cardiol. Heart Vasc 2022 39 100970 10.1016/j.ijcha.2022.100970 35136831 PMC8813563 Offerhaus, J. A. et al. Sex- and age specific association of new-onset atrial fibrillation with in-hospital mortality in hospitalised COVID-19 patients. Int. J. Cardiol. Heart Vasc 39 35136831 10.1016/j.ijcha.2022.100970 PMC8813563 20. Koleske M Tetrodotoxin-sensitive Navs contribute to early and delayed afterdepolarizations in long QT arrhythmia models J. Gen. Physiol. 2018 10.1085/jgp.201711909 29793933 PMC6028491 Koleske, M. et al. Tetrodotoxin-sensitive Navs contribute to early and delayed afterdepolarizations in long QT arrhythmia models. J. Gen. Physiol. 29793933 10.1085/jgp.201711909 PMC6028491 21. Veeraraghavan R Gourdie RG Stochastic optical reconstruction microscopy-based relative localization analysis (STORM-RLA) for quantitative nanoscale assessment of Spatial protein organization Mol. Biol. Cell. 2016 27 3583 3590 10.1091/mbc.E16-02-0125 27307586 PMC5221590 Veeraraghavan, R. & Gourdie, R. G. Stochastic optical reconstruction microscopy-based relative localization analysis (STORM-RLA) for quantitative nanoscale assessment of Spatial protein organization. Mol. Biol. Cell. 27 27307586 10.1091/mbc.E16-02-0125 PMC5221590 22. Veeraraghavan R The adhesion function of the sodium channel beta subunit (beta1) contributes to cardiac action potential propagation Elife 2018 10.7554/eLife.37610 30106376 PMC6122953 Veeraraghavan, R. et al. The adhesion function of the sodium channel beta subunit (beta1) contributes to cardiac action potential propagation. Elife 30106376 10.7554/eLife.37610 PMC6122953 23. Veeraraghavan R Sodium channels in the Cx43 gap junction perinexus May constitute a cardiac ephapse: an experimental and modeling study Pflugers Arch. 2015 467 2093 2105 10.1007/s00424-014-1675-z 25578859 PMC4500747 Veeraraghavan, R. et al. Sodium channels in the Cx43 gap junction perinexus May constitute a cardiac ephapse: an experimental and modeling study. Pflugers Arch. 467 25578859 10.1007/s00424-014-1675-z PMC4500747 24. Veeraraghavan R Lin J Keener JP Gourdie R Poelzing S Potassium channels in the Cx43 gap junction perinexus modulate ephaptic coupling: an experimental and modeling study Pflugers Arch. 2016 468 1651 1661 10.1007/s00424-016-1861-2 27510622 PMC5131566 Veeraraghavan, R., Lin, J., Keener, J. P., Gourdie, R. & Poelzing, S. Potassium channels in the Cx43 gap junction perinexus modulate ephaptic coupling: an experimental and modeling study. Pflugers Arch. 468 27510622 10.1007/s00424-016-1861-2 PMC5131566 25. Radwański PB Neuronal Na + Channels are integral components of Pro-Arrhythmic Na+/Ca2 + Signaling nanodomain that promotes cardiac arrhythmias during β-Adrenergic stimulation JACC: Basic. Translational Sci. 2016 1 251 266 10.1016/j.jacbts.2016.04.004 PMC5065245 27747307 Radwański, P. B. et al. Neuronal Na + Channels are integral components of Pro-Arrhythmic Na+/Ca2 + Signaling nanodomain that promotes cardiac arrhythmias during β-Adrenergic stimulation. JACC: Basic. Translational Sci. 1 10.1016/j.jacbts.2016.04.004 PMC5065245 27747307 26. Struckman HL Unraveling impacts of Chamber-Specific differences in intercalated disc ultrastructure and molecular organization on cardiac conduction JACC Clin. Electrophysiol. 2023 9 2425 2443 10.1016/j.jacep.2023.05.042 37498248 PMC11102000 Struckman, H. L. et al. Unraveling impacts of Chamber-Specific differences in intercalated disc ultrastructure and molecular organization on cardiac conduction. JACC Clin. Electrophysiol. 9 37498248 10.1016/j.jacep.2023.05.042 PMC11102000 27. Bogdanov V Distributed synthesis of sarcolemmal and sarcoplasmic reticulum membrane proteins in cardiac myocytes Basic. Res. Cardiol. 2021 116 63 10.1007/s00395-021-00895-3 34713358 PMC8553722 Bogdanov, V. et al. Distributed synthesis of sarcolemmal and sarcoplasmic reticulum membrane proteins in cardiac myocytes. Basic. Res. Cardiol. 116 34713358 10.1007/s00395-021-00895-3 PMC8553722 28. Soltisz AM Craigmile PF Veeraraghavan R Spatial Pattern Analysis using Closest Events (SPACE) – a nearest neighbor point pattern analysis framework for assessing spatial relationships from Image data bioRxiv 2023 10.1101/2023.05.17.541131 38498601 PMC11057815 Soltisz, A. M., Craigmile, P. F. & Veeraraghavan, R. Spatial Pattern Analysis using Closest Events (SPACE) – a nearest neighbor point pattern analysis framework for assessing spatial relationships from Image data. bioRxiv 38498601 10.1093/mam/ozae022 PMC11057815 29. Bailey AL SARS-CoV-2 infects human engineered heart tissues and models COVID-19 myocarditis JACC Basic. Transl Sci. 2021 6 331 345 10.1016/j.jacbts.2021.01.002 33681537 PMC7909907 Bailey, A. L. et al. SARS-CoV-2 infects human engineered heart tissues and models COVID-19 myocarditis. JACC Basic. Transl Sci. 6 33681537 10.1016/j.jacbts.2021.01.002 PMC7909907 30. Perez-Bermejo JA SARS-CoV-2 infection of human iPSC-derived cardiac cells reflects cytopathic features in hearts of patients with COVID-19 Sci. Transl Med. 2021 10.1126/scitranslmed.abf7872 33723017 PMC8128284 Perez-Bermejo, J. A. et al. SARS-CoV-2 infection of human iPSC-derived cardiac cells reflects cytopathic features in hearts of patients with COVID-19. Sci. Transl Med. 33723017 10.1126/scitranslmed.abf7872 PMC8128284 31. Investigators WC f. T. R.-C. Effect of angiotensin-Converting enzyme inhibitor and angiotensin receptor blocker initiation on organ Support–Free days in patients hospitalized with COVID-19: A randomized clinical trial JAMA 2023 329 1183 1196 10.1001/jama.2023.4480 37039790 PMC10326520 Investigators, W. C. f. T. R.-C. Effect of angiotensin-Converting enzyme inhibitor and angiotensin receptor blocker initiation on organ Support–Free days in patients hospitalized with COVID-19: A randomized clinical trial. JAMA 329 37039790 10.1001/jama.2023.4480 PMC10326520 32. Matsushita T Remodeling of cell-cell and cell-extracellular matrix interactions at the border zone of rat myocardial infarcts Circ. Res. 1999 85 1046 1055 10.1161/01.res.85.11.1046 10571536 Matsushita, T. et al. Remodeling of cell-cell and cell-extracellular matrix interactions at the border zone of rat myocardial infarcts. Circ. Res. 85 10571536 10.1161/01.res.85.11.1046 33. Severs NJ Bruce AF Dupont E Rothery S Remodelling of gap junctions and connexin expression in diseased myocardium Cardiovasc. Res. 2008 80 9 19 10.1093/cvr/cvn133 18519446 PMC2533424 Severs, N. J., Bruce, A. F., Dupont, E. & Rothery, S. Remodelling of gap junctions and connexin expression in diseased myocardium. Cardiovasc. Res. 80 18519446 10.1093/cvr/cvn133 PMC2533424 34. Xie Y Xu E Bowe B Al-Aly Z Long-term cardiovascular outcomes of COVID-19 Nat. Med. 2022 28 583 590 10.1038/s41591-022-01689-3 35132265 PMC8938267 Xie, Y., Xu, E., Bowe, B. & Al-Aly, Z. Long-term cardiovascular outcomes of COVID-19. Nat. Med. 28 35132265 10.1038/s41591-022-01689-3 PMC8938267 35. Wenzhong L Hualan L COVID-19: the CaMKII-like system of S protein drives membrane fusion and induces syncytial multinucleated giant cells Immunol. Res. 2021 69 496 519 10.1007/s12026-021-09224-1 34410575 PMC8374125 Wenzhong, L. & Hualan, L. COVID-19: the CaMKII-like system of S protein drives membrane fusion and induces syncytial multinucleated giant cells. Immunol. Res. 69 34410575 10.1007/s12026-021-09224-1 PMC8374125 36. Elseidy SA Cardiovascular complications in the Post-Acute COVID-19 syndrome (PACS) Int. J. Cardiol. Heart Vasc 2022 40 101012 10.1016/j.ijcha.2022.101012 35355927 PMC8958273 Elseidy, S. A. et al. Cardiovascular complications in the Post-Acute COVID-19 syndrome (PACS). Int. J. Cardiol. Heart Vasc 40 35355927 10.1016/j.ijcha.2022.101012 PMC8958273 37. Mezache L Soltisz AM Johnstone SR Isakson BE Veeraraghavan R Vascular endothelial barrier protection prevents atrial fibrillation by preserving cardiac nanostructure bioRxiv 2023 10.1101/2023.06.20.545742 PMC11134328 38032579 Mezache, L., Soltisz, A. M., Johnstone, S. R., Isakson, B. E. & Veeraraghavan, R. Vascular endothelial barrier protection prevents atrial fibrillation by preserving cardiac nanostructure. bioRxiv 10.1016/j.jacep.2023.10.013 PMC11134328 38032579 ",
  "metadata": {
    "Title of this paper": "Vascular endothelial barrier protection prevents atrial fibrillation by preserving cardiac nanostructure",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484841/"
  }
}