{
  "title": "Paper_355",
  "abstract": "pmc Biol Direct Biol Direct 390 bioldirect Biology Direct 1745-6150 BMC PMC12487367 PMC12487367.1 12487367 12487367 41035072 10.1186/s13062-025-00688-x 688 1 Research HMGA1 promotes the progression of lung adenocarcinoma through the STAT1-mediated transcriptional activation of DDAH1 Hu Tong 1 Shi Run 1 Yin Shiyuan 1 Xu Tingting 1 Xu Yangyue 1 Xu Duo xuduo@jsph.org.cn 1 Shu Yongqian shuyongqian@csco.org.cn 1 2 1 https://ror.org/04py1g812 grid.412676.0 0000 0004 1799 0784 Department of Oncology, The First Affiliated Hospital of Nanjing Medical University, 2 https://ror.org/059gcgy73 grid.89957.3a 0000 0000 9255 8984 Collaborative Innovation Center for Cancer Personalized Medicine, Nanjing Medical University, 1 10 2025 2025 20 478659 101 15 5 2025 26 8 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Advancements in precision oncology have generated increased interest in the prognostic and therapeutic capabilities of transcription factors, among which HMGA1 is significantly correlated with LUAD prognosis. However, our understanding of HMGA1 remains insufficient. This study seeks to elucidate the biological functions of HMGA1 and to investigate the underlying mechanisms. Methods The prognostic value of HMGA1 was validated across multiple independent patient cohorts with LUAD, and its impact on tumor proliferation was verified by both in vitro and in vivo models. A series of experiments were performed to investigate the underlying molecular mechanism, including RNA sequencing, co-immunoprecipitation and chromatin immunoprecipitation. Results HMGA1 plays a crucial role in promoting the proliferation of LUAD. The underlying mechanism involves the recruitment of STAT1 to the promoter region of DDAH1, which synergistically increases its transcription and subsequently activates the ADMA/NO signaling pathway. Notably, the STAT1 inhibitor fludarabine has been shown to effectively impede the progression of LUAD models characterized by high levels of HMGA1. Conclusion Our research reveals a previously unrecognized mechanism through which the HMGA1/STAT1 complex facilitates LUAD proliferation by transcriptionally activating DDAH1. Moreover, we propose that fludarabine could serve as a promising therapeutic option for LUAD patients exhibiting elevated levels of HMGA1. Supplementary Information The online version contains supplementary material available at 10.1186/s13062-025-00688-x. Keywords HMGA1 STAT1 DDAH1 Transcription factor Lung adenocarcinoma https://doi.org/10.13039/501100001809 National Natural Science Foundation of China 82404066 82172889 Xu Duo Shu Yongqian https://doi.org/10.13039/501100004608 Natural Science Foundation of Jiangsu Province BK20241139 Xu Duo Jiangsu Province Capability Improvement Project through Science, Technology and Education CXZX202204 Shu Yongqian pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Lung adenocarcinoma (LUAD) is the predominant histological subtype of lung cancer, with complex pathogenesis and significant clinical heterogeneity [ 1 Transcription factors (TFs) have long been considered ideal targets for tumor precision therapy [ 2 3 4 5 6 7 8 Dimethylarginine dimethylaminohydrolase-1 (DDAH1) is the major enzyme that mediates the metabolism of asymmetric dimethylarginine (ADMA) [ 9 10 11 12 13 In this study, we have established that HMGA1 facilitates LUAD proliferation. The underlying mechanism involves HMGA1’s recruitment of signal transducer and activator of transcription 1 (STAT1) to the promoter region of DDAH1, which in turn significantly enhances DDAH1 transcription and activates the ADMA/NO signaling pathway. Notably, the STAT1 inhibitor fludarabine effectively impedes the progression of LUAD models characterized by high levels of HMGA1. Collectively, these findings elucidate a novel regulatory mechanism by which HMGA1 influences the progression of LUAD, thereby offering new insights for therapeutic strategies targeting LUAD. Methods and materials Data collection and processing A series of microarray datasets ( GSE30219 GSE31210 GSE50081 GSE68465 GSE68571 GSE72094 https://www.ncbi.nlm.nih.gov/geo/ 14 19 https://portal.gdc.cancer.gov/ 2 sva S1 The complete catalogue of TFs was downloaded from the AnimalTFDB website ( http://guolab.wchscu.cn/AnimalTFDB4/#/ 20 Bioinformatic analyses Survival data from LUAD cohorts were processed with a 5-year overall survival endpoint, as mortality events beyond this timepoint were unlikely to be tumor-related [ 16 survival 21 survival 22 meta Differential expression of HMGA1 between LUAD and neighboring normal tissue was analyzed using ggplot2 high low limma 2 23 clusterprofiler 24 https://metascape.org 25 Patient tissue microarray (TMA) analysis A TMA containing 30 pairs of LUAD and adjacent tissue were purchased from Outdo Biotech (HLugA060PG03; Shanghai, China) for immunohistochemistry (IHC) staining of HMGA1. IHC assay for TMA was implemented as previously described [ 26 S2 Cell lines and cell culture Human normal bronchial epithelial cells BEAS-2B and human LUAD cell lines A549, PC9, NCI-H23 and NCI-H1299 were obtained from the Shanghai Institute of Biochemistry and Cell Biology (Shanghai, China), and cultured in RPMI-1640 medium (VivaCell, Shanghai, China) with 10% fetal bovine serum (FBS, VivaCell) at 37℃ in 5% CO 2 Real-time quantitative PCR (RT-qPCR) and Western blot RT-qPCR and Western blot experiments were performed according to previously published articles [ 27 S2 S3 Cell viability and proliferation assays Cell counting kit-8 (CCK8), 5-ethynyl-2-deoxyuridine (EdU) incorporation, and colony formation assays were performed in accordance with our previously published articles [ 27 28 Cell transfection and lentivirus infection The plasmids pCMV-HMGA1-3×FLAG pCMV-STAT1-3×FLAG pGL3-DDAH1-Promoter pRL-TK S4 The lentiviral plasmid encoding short hairpin RNA (shRNA) targeting HMGA1, DDAH1 and STAT1, as well as their negative control (shNC) were also obtained from Hanbio. Notably, the sequences of shHMGA1 were identical to si-HMGA1 #2. A549 and PC9 cell lines were transduced with lentiviruses at multiplicities of infection (MOI) of 5 and 10 for 24 h, respectively. Stable cell lines were established by selection with puromycin (1 µg/ml), and validated by qPCR and Western blot. RNA sequencing (RNA-Seq) analysis Total RNA was isolated from A549 cells infected with shNC or shHMGA1 using TRIzol (Invitrogen, USA), following the manufacturer’s protocol. After rRNA removal, mRNA was reverse-transcribed into cDNA for library construction and sequenced by the Alliance of Nanjing Biopharmaceutical Platform (Nanjing, China). High-quality reads were aligned to the GRCh38 human reference genome, and gene expression was normalized using transcripts per million (TPM). Differential analysis was conducted with the DESeq2 29 ADMA and NO detection ADMA concentrations in cell lysates were analyzed by the ADMA ELISA Kit (E-EL-0042; Elabscience, Hubei, China), according to the manufacturer’s recommended guideline. Absorbance at 450 nm was detected by Multiskan FC microplate photometer (Thermo Fisher) after adding stop solution. Intracellular levels of NO were quantified by the nitrate reductase assay using the NO Colorimetric Assay Kit (E-BC-K135-M, Elabscience). Absorbance at 530 nm was measured with the same photometer (Thermo Fisher). Immunoprecipitation (IP) and mass spectrometric (MS) analysis Total proteins were extracted using RIPA lysis buffer (Beyotime, Shanghai, China) supplemented with 1% protease and phosphatase inhibitor cocktails. A portion of lysate was reserved as Input, while the remaining samples were equally divided and incubated overnight at 4 °C with either IgG or target-specific IP antibody. Following the protocol of the Immunoprecipitation Kit (P2179S; Beyotime), antigen-antibody complexes were captured with magnetic beads and then eluted with SDS loading buffer. To identify the HMGA1-interacting proteins, tryptic digests of A549 cells transfected with HMGA1 plasmids were analyzed by MS (BGI, Shenzhen, China). Antibody specifications and dilution ratios are detailed in Table S2 Immunofluorescence (IF) staining and confocal microscopy LUAD cells with overexpressed HMGA1 and STAT1 were seeded onto coverslips in 24-well plates and allowed to adhere for 24 h. After three PBS washes, the cells were fixed with 4% paraformaldehyde (PFA) for 30 min and permeabilized with 0.5% Triton X-100 for 30 min. After blocking with 1% BSA for 2 h at room temperature, cells were incubated with primary antibodies overnight at 4 °C. Following PBS washes, the cells were incubated with fluorescence-conjugated antibodies for 2 h at room temperature under light protection. Nuclei were counterstained with DAPI for 20 min. Intracellular colocalization images were captured with a Stellaris STED confocal microscope (Leica, Germany). Details of antibodies and dilution ratios are provided in Table S2 Chromatin Immunoprecipitation (ChIP) DNA-protein crosslinks in LUAD cells were fixed with 4% PFA. Cells were lysed with SDS buffer (Beyotime), and the chromatin was sheared by sonication to obtain DNA fragments of 200–1000 bp. Approximately 1% of the total chromatin was retained as Input, while the remaining samples were equally divided and incubated overnight at 4 °C with either IgG or target-specific ChIP antibody. According to the guidelines of the ChIP Assay Kit (P2080S; Beyotime), magnetic beads were utilized to capture antigen-antibody complexes, and DNA fragments were subsequently eluted using Elution buffer and analyzed by qPCR and agarose gel electrophoresis. Antibody details and dilution ratios are provided in Table S2 S3 Luciferase reporter assay After seeding in 24-well plates, cells were co-transfected with the pGL3-DDAH1-Promoter pRL-TK Animal studies All animal experiments were conducted in accordance with protocols approved by the Ethics Committee of Nanjing Medical University (IACUC-2109036). 4-week-old female BALB/c nude mice were obtained from the Animal Center of Nanjing Medical University. A549 cells (4 × 10 6 30 31 2 Statistical analysis All statistical analysis and representations were performed using R (version 4.2.3), SPSS (version 21.0) and GraphPad Prism (version 8.0.1) software. Student’s t-test was applied to analyze intergroup differences for variables with normal distribution. All in vitro experiments were repeated at least three times. A two-tailed P value less than 0.05 was used to assess statistical significance. Results HMGA1 is the main TF correlated with poor prognosis in LUAD To identify the most critical TF associated with poor prognosis in LUAD, the C-indices of 1,637 TFs were calculated across 7 independent cohorts (TCGA, GSE30219 GSE31210 GSE50081 GSE68465 GSE68571 GSE72094 1 S5 1 1 1 S1  Fig. 1 HMGA1 correlates with poor prognosis in LUAD. A B-C D E F high low G H I-J high low p p Subsequently, the 5-year survival curves in diverse LUAD cohorts were depicted (Fig. 1 S1 P 1 P 1 GO/KEGG enrichment analysis revealed that HMGA1 was closely correlated with cellular proliferation (Fig. 1 Elevated HMGA1 promotes LUAD proliferation in vitro and in vivo The expression levels of HMGA1 were evaluated across various cell lines, revealing that all LUAD cell lines exhibited elevated HMGA1 expression compared to the normal bronchial epithelial cell line BEAS-2B, with the A549 and PC9 cell lines showing particularly high levels (Fig. 2  Fig. 2 HMGA1 promotes LUAD proliferation in vitro and in vivo. A B-C D-E F-G H-I J K L M n p p p To elucidate the function of HMGA1, we performed plasmid-mediated HMGA1 overexpression and siRNA-mediated HMGA1 knockdown in LUAD cells, and the transfection efficiency was evaluated by qPCR and Western blot (Fig. 2 2 2 2 Given the pronounced inhibitory effect of si-HMGA1 #2 on LUAD proliferation, this specific sequence was chosen for shRNA construction to create stable HMGA1 knockdown cell lines (Figure S2 2 S2 HMGA1 activates DDAH1 transcription by binding with STAT1 To investigate the mechanism by which HMGA1 accelerates LUAD proliferation, a transcriptomic analysis was conducted following the knockdown of HMGA1 (Fig. 3 3 S3 3  Fig. 3 HMGA1 activates the ADMA/NO pathway by elevating DDAH1 expression. A B-C D-E F G H I J K L M n p p p Following this, the phenotypes of DDAH1 regarding cell proliferation in LUAD cell lines were further validated. The expression of DDAH1 in A549 and PC9 cell lines was regulated by exogenous plasmid and shRNA lentivirus (Fig. 3 S3 3 3 S3 Due to the structural limitations, HMGA1 does not possess intrinsic transcriptional activity; instead, it exerts its regulatory functions through interactions with other TFs [ 5 4 4 4  Fig. 4 HMGA1 activates DDAH1 transcription through STAT1 binding. A B C D E F G n p p p ChIP and luciferase reporter assays were then utilized to illustrate the mechanism by which the HMGA1/STAT1 complex activates DDAH1 transcription. Two potential binding sites within the DDAH1 promoter region were identified based on predictions from the JASPAR database (Fig. 4 4 4 S4 4 S4 HMGA1 promotes LUAD proliferation via STAT1-mediated upregulation of DDAH1 Subsequent rescue experiments were conducted to determine whether the pro-proliferative effect of HMGA1 is contingent upon the STAT1-mediated upregulation of DDAH1. The efficiency of transfection and the corresponding expression levels were validated by qPCR and Western blot analysis (Fig. 5 S5 5  Fig. 5 HMGA1 promotes LUAD proliferation via STAT1-mediated upregulation of DDAH1. A-B C-D E-G H I J K n p p p Following this, a series of functional experiments were conducted to confirm the restorative effect of STAT1 on the anti-proliferative characteristics associated with HMGA1 knockdown. Cell viability assay revealed that the overexpression of STAT1 counteracted the proliferation inhibition resulting from HMGA1 knockdown (Fig. 5 5 5 5 S5 Furthermore, loss-of-function assays were conducted for HMGA1 and STAT1 to elucidate the regulatory roles of HMGA1 and STAT1 in DDAH1-mediated proliferation. Knockdown of either HMGA1 or STAT1 differentially suppressed DDAH1 expression and the activation of the ADMA/NO signaling pathway, while simultaneous depletion of both HMGA1 and STAT1 resulted in more pronounced inhibition (Fig. 6 S5 6 6 S5  Fig. 6 Knockdown of HMGA1 and STAT1 inhibited the DDAH1-mediated LUAD proliferation. A-B C-D E-G H I J K n p p p Fludarabine inhibits the progression of HMGA1 high Considering that HMGA1 plays a critical role in LUAD, targeting HMGA1 may provide clinical benefits for LUAD patients by improving survival outcomes. However, drugs precisely targeting HMGA1 are still lacking. Since HMGA1 exerts its biological functions through cooperative interactions with other TFs, we postulated that disrupting the HMGA1/STAT1 complex might achieve similar therapeutic benefits. The STAT1 inhibitor fludarabine exhibited the half-maximal inhibitory concentration (IC 50 7 7  Fig. 7 Fludarabine inhibits the progression of HMGA1 high A 50 B-C 50 D high E F G H-I J n p p p Accordingly, we established an in vivo treatment model (Fig. 7 high 7 high Discussion As illustrated in Fig. 7 high The pro-proliferative phenotype of HMGA1 has been reported in several tumors. In gastric cancer (GC), HMGA1 facilitated cell proliferation by activating the Wnt/β-catenin pathway [ 32 6 33 34 35 36 37 38 Since HMGA1 lacks intrinsic transcriptional activity, it exerts its transcriptional regulatory function by interacting with other TFs [ 3 7 39 40 HMGA1/STAT1 complex showed significant pro-proliferative impacts in LUAD, suggesting that targeting them could effectively block downstream pathway activation and thus suppress tumor progression. Netropsin, a minor groove DNA-binding agent, specifically interferes with protein binding at AT-rich regions, leading to its proposed role as a potential HMGA1 inhibitor in several studies [ 34 41 42 43 44 30 45 high However, this study still has several limitations need to be improved. Firstly, more LUAD samples should be collected to assess the best cutoff between HMGA1 high low high Conclusion In conclusion, our research indicates that the HMGA1/STAT1 complex facilitates LUAD proliferation and progression through the regulation of the DDAH1-ADMA/NO signaling pathway. Furthermore, experiments utilizing xenograft mouse models have demonstrated that LUAD characterized by high levels of HMGA1 exhibits increased sensitivity to fludarabine treatment. This underscores the potential of HMGA1 as both a biomarker and a therapeutic target in the management of LUAD. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Supplementary Material 2 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Tong Hu, Run Shi and Shiyuan Yin contributed equally to this work. Acknowledgements We would like to thank the Core Facility of the First Affiliated Hospital of Nanjing Medical University for the help in this work. Author contributions Y-Q. Shu and D. Xu contributed to the conception and design of the study. T. Hu and R. Shi performed the bioinformatic analysis. T. Hu and S-Y. Yin implemented the experiments. T. Hu and R. Shi wrote the first draft of the manuscript. S-Y. Yin, T-T. Xu and D. Xu assisted with language improvement. All authors read and approved the final manuscript. Funding This work was supported by the National Natural Science Foundation of China (#82404066 to D. Xu, #82172889 to Y-Q. Shu), Natural Science Foundation of Jiangsu Province (#BK20241139 to D. Xu) and Jiangsu Province Capability Improvement Project through Science, Technology and Education (#CXZX202204 to Y-Q. Shu). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate All procedures related to the LUAD TMA were approved by the Ethics Committee of Shanghai Outdo Biotech with an approval number (ZQTYHM-19-01). Participants gave informed consent to participate in the study before taking part. Competing interests The authors declare no competing interests. References 1. Zhang Y Global variations in lung cancer incidence by histological subtype in 2020: a population-based study Lancet Oncol 2023 24 1206 18 37837979 10.1016/S1470-2045(23)00444-8 Zhang Y, et al. Global variations in lung cancer incidence by histological subtype in 2020: a population-based study. Lancet Oncol. 2023;24:1206–18. 37837979 10.1016/S1470-2045(23)00444-8 2. Francois M Donovan P Fontaine F Modulating transcription factor activity: interfering with protein-protein interaction networks Semin Cell Dev Biol 2020 99 12 9 30172762 10.1016/j.semcdb.2018.07.019 Francois M, Donovan P, Fontaine F. Modulating transcription factor activity: interfering with protein-protein interaction networks. Semin Cell Dev Biol. 2020;99:12–9. 30172762 10.1016/j.semcdb.2018.07.019 3. Wang L High mobility group A1 (HMGA1): structure, biological function, and therapeutic potential Int J Biol Sci 2022 18 4414 31 35864955 10.7150/ijbs.72952 PMC9295051 Wang L, et al. High mobility group A1 (HMGA1): structure, biological function, and therapeutic potential. Int J Biol Sci. 2022;18:4414–31. 35864955 10.7150/ijbs.72952 PMC9295051 4. Wang Y Hu L Zheng Y Guo L HMGA1 in cancer: cancer classification by location J Cell Mol Med 2019 23 2293 302 30614613 10.1111/jcmm.14082 PMC6433663 Wang Y, Hu L, Zheng Y, Guo L. HMGA1 in cancer: cancer classification by location. J Cell Mol Med. 2019;23:2293–302. 30614613 10.1111/jcmm.14082 PMC6433663 5. Sumter TF The high mobility group A1 (HMGA1) transcriptome in cancer and development Curr Mol Med 2016 16 353 93 26980699 10.2174/1566524016666160316152147 PMC5408585 Sumter TF, et al. The high mobility group A1 (HMGA1) transcriptome in cancer and development. Curr Mol Med. 2016;16:353–93. 26980699 10.2174/1566524016666160316152147 PMC5408585 6. Chia L HMGA1 induces FGF19 to drive pancreatic carcinogenesis and stroma formation J Clin Invest 2023 133 e151601 36919699 10.1172/JCI151601 PMC10014113 Chia L, et al. HMGA1 induces FGF19 to drive pancreatic carcinogenesis and stroma formation. J Clin Invest. 2023;133:e151601. 36919699 10.1172/JCI151601 PMC10014113 7. Zanin R HMGA1 promotes breast cancer angiogenesis supporting the stability, nuclear localization and transcriptional activity of FOXM1 J Exp Clin Cancer Res 2019 38 313 31311575 10.1186/s13046-019-1307-8 PMC6636010 Zanin R, et al. HMGA1 promotes breast cancer angiogenesis supporting the stability, nuclear localization and transcriptional activity of FOXM1. J Exp Clin Cancer Res. 2019;38:313. 31311575 10.1186/s13046-019-1307-8 PMC6636010 8. Zhao C IL–17 induces NSCLC A549 cell proliferation via the upregulation of HMGA1, resulting in an increased Cyclin D1 expression Int J Oncol 2018 52 1579 92 29512693 10.3892/ijo.2018.4307 Zhao C, et al. IL–17 induces NSCLC A549 cell proliferation via the upregulation of HMGA1, resulting in an increased Cyclin D1 expression. Int J Oncol. 2018;52:1579–92. 29512693 10.3892/ijo.2018.4307 9. Ragavan VN A multicentric consortium study demonstrates that dimethylarginine dimethylaminohydrolase 2 is not a dimethylarginine dimethylaminohydrolase Nat Commun 2023 14 3392 37296100 10.1038/s41467-023-38467-9 PMC10256801 Ragavan VN, et al. A multicentric consortium study demonstrates that dimethylarginine dimethylaminohydrolase 2 is not a dimethylarginine dimethylaminohydrolase. Nat Commun. 2023;14:3392. 37296100 10.1038/s41467-023-38467-9 PMC10256801 10. Liu X Xu X Shang R Chen Y Asymmetric dimethylarginine (ADMA) as an important risk factor for the increased cardiovascular diseases and heart failure in chronic kidney disease Nitric Oxide 2018 78 113 20 29928990 10.1016/j.niox.2018.06.004 PMC6301111 Liu X, Xu X, Shang R, Chen Y. Asymmetric dimethylarginine (ADMA) as an important risk factor for the increased cardiovascular diseases and heart failure in chronic kidney disease. Nitric Oxide. 2018;78:113–20. 29928990 10.1016/j.niox.2018.06.004 PMC6301111 11. Antoniades C Association of plasma asymmetrical dimethylarginine (ADMA) with elevated vascular superoxide production and endothelial nitric oxide synthase uncoupling: implications for endothelial function in human atherosclerosis Eur Heart J 2009 30 1142 50 19297385 10.1093/eurheartj/ehp061 Antoniades C, et al. Association of plasma asymmetrical dimethylarginine (ADMA) with elevated vascular superoxide production and endothelial nitric oxide synthase uncoupling: implications for endothelial function in human atherosclerosis. Eur Heart J. 2009;30:1142–50. 19297385 10.1093/eurheartj/ehp061 12. Böger RH An endogenous inhibitor of nitric oxide synthase regulates endothelial adhesiveness for monocytes J Am Coll Cardiol 2000 36 2287 95 11127475 10.1016/s0735-1097(00)01013-5 Böger RH, et al. An endogenous inhibitor of nitric oxide synthase regulates endothelial adhesiveness for monocytes. J Am Coll Cardiol. 2000;36:2287–95. 11127475 10.1016/s0735-1097(00)01013-5 13. Reddy KRK Dimethylarginine dimethylaminohydrolase-1 (DDAH1) is frequently upregulated in prostate cancer, and its overexpression conveys tumor growth and angiogenesis by metabolizing asymmetric dimethylarginine (ADMA) Angiogenesis 2018 21 79 94 29150732 10.1007/s10456-017-9587-0 Reddy KRK, et al. Dimethylarginine dimethylaminohydrolase-1 (DDAH1) is frequently upregulated in prostate cancer, and its overexpression conveys tumor growth and angiogenesis by metabolizing asymmetric dimethylarginine (ADMA). Angiogenesis. 2018;21:79–94. 29150732 10.1007/s10456-017-9587-0 14. Rousseaux S Ectopic activation of germline and placental genes identifies aggressive metastasis-prone lung cancers Sci Transl Med 2013 5 186ra66 23698379 10.1126/scitranslmed.3005723 PMC4818008 Rousseaux S, et al. Ectopic activation of germline and placental genes identifies aggressive metastasis-prone lung cancers. Sci Transl Med. 2013;5:186ra66. 23698379 10.1126/scitranslmed.3005723 PMC4818008 15. Okayama H Identification of genes upregulated in ALK-positive and EGFR/KRAS/ALK-negative lung adenocarcinomas Cancer Res 2012 72 100 11 22080568 10.1158/0008-5472.CAN-11-1403 Okayama H, et al. Identification of genes upregulated in ALK-positive and EGFR/KRAS/ALK-negative lung adenocarcinomas. Cancer Res. 2012;72:100–11. 22080568 10.1158/0008-5472.CAN-11-1403 16. Der SD Validation of a histology-independent prognostic gene signature for early-stage, non-small-cell lung cancer including stage IA patients J Thorac Oncol 2014 9 59 64 24305008 10.1097/JTO.0000000000000042 Der SD, et al. Validation of a histology-independent prognostic gene signature for early-stage, non-small-cell lung cancer including stage IA patients. J Thorac Oncol. 2014;9:59–64. 24305008 10.1097/JTO.0000000000000042 17. Director’s Challenge Consortium for the Molecular Classification of Lung Adenocarcinoma Gene expression-based survival prediction in lung adenocarcinoma: a multi-site, blinded validation study Nat Med 2008 14 822 7 18641660 10.1038/nm.1790 PMC2667337 Director’s Challenge Consortium for the Molecular Classification of Lung Adenocarcinoma. Gene expression-based survival prediction in lung adenocarcinoma: a multi-site, blinded validation study. Nat Med. 2008;14:822–7. 18641660 10.1038/nm.1790 PMC2667337 18. Beer DG Gene-expression profiles predict survival of patients with lung adenocarcinoma Nat Med 2002 8 816 24 12118244 10.1038/nm733 Beer DG, et al. Gene-expression profiles predict survival of patients with lung adenocarcinoma. Nat Med. 2002;8:816–24. 12118244 10.1038/nm733 19. Schabath MB Differential association of STK11 and TP53 with KRAS mutation-associated gene expression, proliferation and immune surveillance in lung adenocarcinoma Oncogene 2016 35 3209 16 26477306 10.1038/onc.2015.375 PMC4837098 Schabath MB, et al. Differential association of STK11 and TP53 with KRAS mutation-associated gene expression, proliferation and immune surveillance in lung adenocarcinoma. Oncogene. 2016;35:3209–16. 26477306 10.1038/onc.2015.375 PMC4837098 20. Shen W-K AnimalTFDB 4.0: a comprehensive animal transcription factor database updated with variation and expression annotations Nucleic Acids Res 2023 51 D39 45 36268869 10.1093/nar/gkac907 PMC9825474 Shen W-K, et al. AnimalTFDB 4.0: a comprehensive animal transcription factor database updated with variation and expression annotations. Nucleic Acids Res. 2023;51:D39–45. 36268869 10.1093/nar/gkac907 PMC9825474 21. Liu Z Machine learning-based integration develops an immune-derived LncRNA signature for improving outcomes in colorectal cancer Nat Commun 2022 13 816 35145098 10.1038/s41467-022-28421-6 PMC8831564 Liu Z, et al. Machine learning-based integration develops an immune-derived LncRNA signature for improving outcomes in colorectal cancer. Nat Commun. 2022;13:816. 35145098 10.1038/s41467-022-28421-6 PMC8831564 22. Lin H Zelterman D Modeling survival data: extending the Cox model Technometrics 2002 44 85 6 Lin H, Zelterman D. Modeling survival data: extending the Cox model. Technometrics. 2002;44:85–6. 23. Ritchie ME Limma powers differential expression analyses for RNA-sequencing and microarray studies Nucleic Acids Res 2015 43 e47 25605792 10.1093/nar/gkv007 PMC4402510 Ritchie ME, et al. Limma powers differential expression analyses for RNA-sequencing and microarray studies. Nucleic Acids Res. 2015;43:e47. 25605792 10.1093/nar/gkv007 PMC4402510 24. Wu T ClusterProfiler 4.0: a universal enrichment tool for interpreting omics data Innov (Camb) 2021 2 100141 10.1016/j.xinn.2021.100141 PMC8454663 34557778 Wu T, et al. ClusterProfiler 4.0: a universal enrichment tool for interpreting omics data. Innov (Camb). 2021;2:100141. 10.1016/j.xinn.2021.100141 PMC8454663 34557778 25. Zhou Y Metascape provides a biologist-oriented resource for the analysis of systems-level datasets Nat Commun 2019 10 1523 30944313 10.1038/s41467-019-09234-6 PMC6447622 Zhou Y, et al. Metascape provides a biologist-oriented resource for the analysis of systems-level datasets. Nat Commun. 2019;10:1523. 30944313 10.1038/s41467-019-09234-6 PMC6447622 26. Xu T HDAC inhibitor SAHA enhances antitumor immunity via the HDAC1/JAK1/FGL1 axis in lung adenocarcinoma J Immunother Cancer 2024 12 e010077 39384195 10.1136/jitc-2024-010077 PMC11474878 Xu T, et al. HDAC inhibitor SAHA enhances antitumor immunity via the HDAC1/JAK1/FGL1 axis in lung adenocarcinoma. J Immunother Cancer. 2024;12:e010077. 39384195 10.1136/jitc-2024-010077 PMC11474878 27. Hu T Multi-omics and single-cell analysis reveals machine learning-based pyrimidine metabolism-related signature in the prognosis of patients with lung adenocarcinoma Int J Med Sci 2025 22 1375 92 40084259 10.7150/ijms.107694 PMC11898844 Hu T, et al. Multi-omics and single-cell analysis reveals machine learning-based pyrimidine metabolism-related signature in the prognosis of patients with lung adenocarcinoma. Int J Med Sci. 2025;22:1375–92. 40084259 10.7150/ijms.107694 PMC11898844 28. Xie M Exosomal circSHKBP1 promotes gastric cancer progression via regulating the miR-582-3p/HUR/VEGF axis and suppressing HSP90 degradation Mol Cancer 2020 19 112 32600329 10.1186/s12943-020-01208-3 PMC7322843 Xie M, et al. Exosomal circSHKBP1 promotes gastric cancer progression via regulating the miR-582-3p/HUR/VEGF axis and suppressing HSP90 degradation. Mol Cancer. 2020;19:112. 32600329 10.1186/s12943-020-01208-3 PMC7322843 29. Love MI Huber W Anders S Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol 2014 15 550 25516281 10.1186/s13059-014-0550-8 PMC4302049 Love MI, Huber W, Anders S. Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2. Genome Biol. 2014;15:550. 25516281 10.1186/s13059-014-0550-8 PMC4302049 30. Liu W VAV2 is required for DNA repair and implicated in cancer radiotherapy resistance Signal Transduct Target Ther 2021 6 322 34462423 10.1038/s41392-021-00735-9 PMC8405816 Liu W, et al. VAV2 is required for DNA repair and implicated in cancer radiotherapy resistance. Signal Transduct Target Ther. 2021;6:322. 34462423 10.1038/s41392-021-00735-9 PMC8405816 31. Zhou Z Entinostat combined with fludarabine synergistically enhances the induction of apoptosis in TP53 mutated CLL cells via the HDAC1/HO-1 pathway Life Sci 2019 232 116583 31226417 10.1016/j.lfs.2019.116583 Zhou Z, et al. Entinostat combined with fludarabine synergistically enhances the induction of apoptosis in TP53 mutated CLL cells via the HDAC1/HO-1 pathway. Life Sci. 2019;232:116583. 31226417 10.1016/j.lfs.2019.116583 32. Akaboshi S HMGA1 is induced by Wnt/beta-catenin pathway and maintains cell proliferation in gastric cancer Am J Pathol 2009 175 1675 85 19729480 10.2353/ajpath.2009.090069 PMC2751563 Akaboshi S, et al. HMGA1 is induced by Wnt/beta-catenin pathway and maintains cell proliferation in gastric cancer. Am J Pathol. 2009;175:1675–85. 19729480 10.2353/ajpath.2009.090069 PMC2751563 33. Tang C Lei X Xiong L Hu Z Tang B HMGA1B/2 transcriptionally activated-POU1F1 facilitates gastric carcinoma metastasis via CXCL12/CXCR4 axis-mediated macrophage polarization Cell Death Dis 2021 12 422 33927188 10.1038/s41419-021-03703-x PMC8084942 Tang C, Lei X, Xiong L, Hu Z, Tang B. HMGA1B/2 transcriptionally activated-POU1F1 facilitates gastric carcinoma metastasis via CXCL12/CXCR4 axis-mediated macrophage polarization. Cell Death Dis. 2021;12:422. 33927188 10.1038/s41419-021-03703-x PMC8084942 34. Liu Y The RP11-417E7.1/THBS2 signaling pathway promotes colorectal cancer metastasis by activating the Wnt/β-catenin pathway and facilitating exosome-mediated M2 macrophage polarization J Exp Clin Cancer Res 2024 43 195 39020380 10.1186/s13046-024-03107-7 PMC11253389 Liu Y, et al. The RP11-417E7.1/THBS2 signaling pathway promotes colorectal cancer metastasis by activating the Wnt/β-catenin pathway and facilitating exosome-mediated M2 macrophage polarization. J Exp Clin Cancer Res. 2024;43:195. 39020380 10.1186/s13046-024-03107-7 PMC11253389 35. Ridnour LA The biphasic nature of nitric oxide responses in tumor biology Antioxid Redox Signal 2006 8 1329 37 16910780 10.1089/ars.2006.8.1329 Ridnour LA, et al. The biphasic nature of nitric oxide responses in tumor biology. Antioxid Redox Signal. 2006;8:1329–37. 16910780 10.1089/ars.2006.8.1329 36. Thomas DD The chemical biology of nitric oxide: implications in cellular signaling Free Radic Biol Med 2008 45 18 31 18439435 10.1016/j.freeradbiomed.2008.03.020 PMC2572721 Thomas DD, et al. The chemical biology of nitric oxide: implications in cellular signaling. Free Radic Biol Med. 2008;45:18–31. 18439435 10.1016/j.freeradbiomed.2008.03.020 PMC2572721 37. Perrella MA High mobility group-I(Y) protein facilitates nuclear factor-kappaB binding and transactivation of the inducible nitric-oxide synthase promoter/enhancer J Biol Chem 1999 274 9045 52 10085153 10.1074/jbc.274.13.9045 Perrella MA, et al. High mobility group-I(Y) protein facilitates nuclear factor-kappaB binding and transactivation of the inducible nitric-oxide synthase promoter/enhancer. J Biol Chem. 1999;274:9045–52. 10085153 10.1074/jbc.274.13.9045 38. Pellacani A Down-regulation of high mobility group-I(Y) protein contributes to the inhibition of nitric-oxide synthase 2 by transforming growth factor-beta1 J Biol Chem 2001 276 1653 9 11056164 10.1074/jbc.M008170200 Pellacani A, et al. Down-regulation of high mobility group-I(Y) protein contributes to the Inhibition of nitric-oxide synthase 2 by transforming growth factor-beta1. J Biol Chem. 2001;276:1653–9. 11056164 10.1074/jbc.M008170200 39. Foti D Iuliano R Chiefari E Brunetti A A nucleoprotein complex containing Sp1, C/EBP beta, and HMGI-Y controls human insulin receptor gene transcription Mol Cell Biol 2003 23 2720 32 12665574 10.1128/MCB.23.8.2720-2732.2003 PMC152545 Foti D, Iuliano R, Chiefari E, Brunetti A. A nucleoprotein complex containing Sp1, C/EBP beta, and HMGI-Y controls human insulin receptor gene transcription. Mol Cell Biol. 2003;23:2720–32. 12665574 10.1128/MCB.23.8.2720-2732.2003 PMC152545 40. Shuai K Schindler C Prezioso VR Darnell JE Activation of transcription by IFN-gamma: tyrosine phosphorylation of a 91-kD DNA binding protein Science 1992 258 1808 12 1281555 10.1126/science.1281555 Shuai K, Schindler C, Prezioso VR, Darnell JE. Activation of transcription by IFN-gamma: tyrosine phosphorylation of a 91-kD DNA binding protein. Science. 1992;258:1808–12. 1281555 10.1126/science.1281555 41. Lau K-M Overexpression of HMGA1 deregulates tumor growth via cdc25A and alters migration/invasion through a cdc25A-independent pathway in Medulloblastoma Acta Neuropathol 2012 123 553 71 22249617 10.1007/s00401-011-0934-8 Lau K-M, et al. Overexpression of HMGA1 deregulates tumor growth via cdc25A and alters migration/invasion through a cdc25A-independent pathway in Medulloblastoma. Acta Neuropathol. 2012;123:553–71. 22249617 10.1007/s00401-011-0934-8 42. Beerman TA Netropsin and bis-netropsin analogs as inhibitors of the catalytic activity of mammalian DNA topoisomerase II and topoisomerase cleavable complexes Biochim Biophys Acta 1991 1090 52 60 1653020 10.1016/0167-4781(91)90036-l Beerman TA, et al. Netropsin and bis-netropsin analogs as inhibitors of the catalytic activity of mammalian DNA topoisomerase II and topoisomerase cleavable complexes. Biochim Biophys Acta. 1991;1090:52–60. 1653020 10.1016/0167-4781(91)90036-l 43. Hillmen P Ibrutinib and rituximab versus fludarabine, cyclophosphamide, and rituximab for patients with previously untreated chronic lymphocytic leukaemia (FLAIR): interim analysis of a multicentre, open-label, randomised, phase 3 trial Lancet Oncol 2023 24 535 52 37142374 10.1016/S1470-2045(23)00144-4 Hillmen P, et al. Ibrutinib and rituximab versus fludarabine, cyclophosphamide, and rituximab for patients with previously untreated chronic lymphocytic leukaemia (FLAIR): interim analysis of a multicentre, open-label, randomised, phase 3 trial. Lancet Oncol. 2023;24:535–52. 37142374 10.1016/S1470-2045(23)00144-4 44. Locke FL Long-term safety and activity of Axicabtagene Ciloleucel in refractory large B-cell lymphoma (ZUMA-1): a single-arm, multicentre, phase 1–2 trial Lancet Oncol 2019 20 31 42 30518502 10.1016/S1470-2045(18)30864-7 PMC6733402 Locke FL, et al. Long-term safety and activity of Axicabtagene Ciloleucel in refractory large B-cell lymphoma (ZUMA-1): a single-arm, multicentre, phase 1–2 trial. Lancet Oncol. 2019;20:31–42. 30518502 10.1016/S1470-2045(18)30864-7 PMC6733402 45. Nitsche M Fludarabine combined with radiotherapy in patients with locally advanced NSCLC lung carcinoma: a phase I study J Cancer Res Clin Oncol 2012 138 1113 20 22402597 10.1007/s00432-012-1185-3 PMC3605492 Nitsche M, et al. Fludarabine combined with radiotherapy in patients with locally advanced NSCLC lung carcinoma: a phase I study. J Cancer Res Clin Oncol. 2012;138:1113–20. 22402597 10.1007/s00432-012-1185-3 PMC3605492 ",
  "metadata": {
    "Title of this paper": "Fludarabine combined with radiotherapy in patients with locally advanced NSCLC lung carcinoma: a phase I study",
    "Journal it was published in:": "Biology Direct",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487367/"
  }
}