{
  "title": "Paper_301",
  "abstract": "J Aerosol Med Pulm Drug Deliv J Aerosol Med Pulm Drug Deliv 1146 jamp jamp Journal of Aerosol Medicine and Pulmonary Drug Delivery 1941-2711 1941-2703 Mary Ann Liebert, Inc. PMC11502632 PMC11502632.1 11502632 11502632 38669118 10.1089/jamp.2023.0025 10.1089/jamp.2023.0025 1 Review Articles Research Progress on Liposome Pulmonary Delivery of Mycobacterium tuberculosis ZHANG ET AL. LIPOSOME PULMONARY DELIVERY OF DNA VACCINE Zhang Danyang MS  1  2 https://orcid.org/0009-0005-7886-2019 Zhao Haimei MS  1  2 Li Ping MS  2 Wu Xueqiong PhD  1 Liang Yan MD  1 https://orcid.org/0000-0002-7103-6428 1 2 Address correspondence to: Yan Liang, MD, Beijing Key Laboratory of New Techniques of Tuberculosis Diagnosis and Treatment, Senior Department of Tuberculosis, The Eighth Medical Center of PLA General Hospital, 17 Heishanhu Road, Haidian District, Beijing 100091, China amy5919@sina.com Address correspondence to: Xueqiong Wu, PhD, Beijing Key Laboratory of New Techniques of Tuberculosis Diagnosis and Treatment, Senior Department of Tuberculosis, The Eighth Medical Center of PLA General Hospital, 17 Heishanhu Road, Haidian District, Beijing 100091, China xueqiongwu@139.com i https://orcid.org/0009-0005-7886-2019 ii https://orcid.org/0000-0002-7103-6428 10 2024 03 10 2024 37 5 473513 284 298 21 7 2023 Received on July 21, 2023 07 3 2024 in final form, March 7, 2024 03 10 2025 03 10 2025 26 10 2024 03 10 2025 Copyright 2024, Mary Ann Liebert, Inc., publishers 2024 Mary Ann Liebert, Inc., publishers Abstract Traditional vaccines have played an important role in the prevention and treatment of infectious diseases, but they still have problems such as low immunogenicity, poor stability, and difficulty in inducing lasting immune responses. In recent years, the nucleic acid vaccine has emerged as a relatively cheap and safe new vaccine. Compared with traditional vaccines, nucleic acid vaccine has some unique advantages, such as easy production and storage, scalability, and consistency between batches. However, the direct administration of naked nucleic acid vaccine is not ideal, and safer and more effective vaccine delivery systems are needed. With the rapid development of nanocarrier technology, the combination of gene therapy and nanodelivery systems has broadened the therapeutic application of molecular biology and the medical application of biological nanomaterials. Nanoparticles can be used as potential drug-delivery vehicles for the treatment of hereditary and infectious diseases. In addition, due to the advantages of lung immunity, such as rapid onset of action, good efficacy, and reduced adverse reactions, pulmonary delivery of nucleic acid vaccine has become a hot spot in the field of research. In recent years, lipid nanocarriers have become safe, efficient, and ideal materials for vaccine delivery due to their unique physical and chemical properties, which can effectively reduce the toxic side effects of drugs and achieve the effect of slow release and controlled release, and there have been a large number of studies using lipid nanocarriers to efficiently deliver target components into the body. Based on the delivery of tuberculosis (TB) nucleic acid vaccine by lipid carrier, this article systematically reviews the advantages and mechanism of liposomes as a nucleic acid vaccine delivery carrier, so as to lay a solid foundation for the faster and more effective development of new anti-TB vaccine delivery systems in the future. liposomes mechanism of action Mycobacterium tuberculosis nucleic acid vaccines pulmonary delivery pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Research Progress on Liposome Pulmonary Delivery of ",
    "Journal it was published in:": "Journal of Aerosol Medicine and Pulmonary Drug Delivery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11502632/"
  }
}