{
  "title": "Paper_1133",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473930 PMC12473930.1 12473930 12473930 41012511 10.3390/pharmaceutics17091175 pharmaceutics-17-01175 1 Review Integrating Microorganism-Based Therapy and Emerging Biotechnology in the Treatment of Intracranial Central Nervous System Diseases Li Zifan 1 Yang Shihua 2 * https://orcid.org/0000-0002-3970-5193 Su Lida 1 * Kubo Yoshiyuki Academic Editor 1 lizf24@zju.edu.cn 2 * ysh20220921@163.com sulida1001@zju.edu.cn 09 9 2025 9 2025 17 9 497664 1175 19 8 2025 05 9 2025 06 9 2025 09 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The development of drug delivery systems for the treatment of intracranial central nervous system (CNS) diseases remains one of the most intractable medical problems in modern society, owing to the special physiological structure of the brain, including the existence of the blood-brain barrier (BBB), the CNS’s immune privilege, and its high complexity and vulnerability. Recently, a leading approach in the CNS drug delivery domain has been to employ or simulate the physiological behavior of microorganisms to overcome the BBB and remodel the pathological immune microenvironment in intracranial tissue. Considering the exceptional advancements in microorganism-based CNS drug delivery systems, it is imperative to review the latest breakthroughs. Herein, we summarize the emerging trends at the intersection of microorganism-based drug delivery systems and emerging biomedical technology for the treatment of CNS diseases, with a particular focus on preclinical research into microorganism-based drug delivery systems to combat CNS diseases, aiming to describe a credible landscape for further clinical trials. intracranial central nervous system blood-brain barrier microorganism-based drug delivery system emerging biomedical technology clinical trials the National Natural Science Foundation of China 81971874 This study was supported by a grant from the National Natural Science Foundation of China to LD Su (No. 81971874). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Undoubtedly, the CNS is one of the most important and complex systems in the human body; it not only controls and regulates all fundamental bodily functions but also plays a crucial role in cognition, emotion, and behavior. However, the clinical treatment of CNS diseases is extremely challenging [ 1 2 3 4 5 Recently, various novel drug delivery systems have been developed for the treatment of CNS diseases, including transcytosis-based fusion protein, nanoparticles, and exosomes [ 2 6 7 8 9 10 Researchers have recently discovered that various microorganisms can successfully enter the intracranial space and alter the intracranial immune microenvironment. Given this discovery, a growing body of research has focused on microorganism-based therapies for the treatment of CNS disorders [ 11 12 13 There is no doubt that progressive biomedical innovations hold a huge probability to broaden a splendid prospect for the emerging treatments of diseases [ 14 15 15 16 17 18 Considering the rapid development of microorganism-based drug delivery systems against CNS diseases, it is timely to comprehensively review the latest advances in this emerging field. Herein, the CNS barrier’s physiological structure, the foundation of common CNS diseases, and the cross-talk between the pathogenesis of CNS diseases and microorganisms are outlined. Furthermore, the emerging biomedical technologies used for microorganism-based drug delivery systems against CNS diseases are summarized in detail. Last but not least, we emphasize the clinical expectations and challenges of integrating microorganism-based therapy and emerging biotechnology in the treatment of intracranial central nervous system diseases. 2. Foundation of Microorganism-Based CNS Disease Therapeutics 2.1. CNS Barriers and Anatomy The maintenance of homeostasis within the CNS is essential for neuronal and brain function and plays a key part in ensuring the integrity of the organism and a harmonious balance with the external environment [ 19 20 21 2.2. Outline of CNS Diseases CNS diseases remain a severe threat to human health, as reported in the Global Burden of Disease study (GBD) [ 22 2.2.1. Intracranial Cancer Intracranial tumor undoubtedly represents one of the most intractable CNS diseases. In contrast to other cancers, even benign intracranial tumors will elicit different degrees of functional damage once compressed to any site of the brain, not to mention advanced tumors or even diffuse malignancies [ 23 24 25 26 27 28 29 2.2.2. CNS Inflammation CNS inflammation represents one of the brain diseases most closely related to microbial invasion. CNS inflammation can be divided into acute encephalitis and chronic neuroinflammation. Common types of encephalitis include epidemic, sporadic, and autoimmune encephalitis. The pathogenesis of encephalitis is mostly due to viruses and bacteria. Typically, some COVID-19 patients have symptoms of encephalitis [ 30 31 2.2.3. Neurodegenerative Diseases Neurodegenerative diseases are a class of disorders characterized by the gradual loss of function or death of neurons in the nervous system, typically leading to a decline in cognitive and motor function [ 32 33 34 Porphyromonas gingivalis Helicobacter pylori 35 36 37 2.2.4. Stroke Stroke is a common acute cerebrovascular disease, mainly caused by the sudden blockage or rupture of cerebral arteries, resulting in insufficient blood supply to the brain, leading to cerebral tissue ischemia, hypoxia, and consequent functional impairment [ 38 39 40 41 42 43 44 2.3. Cross-Talk Between CNS Diseases and Microorganisms The presence of the BBB creates a highly secure biological environment for the CNS. The complicated dynamic interface plays a key role in maintaining CNS homeostasis by rigorously performing a “gate-controlled switch” to control the passage of specific nutrients while blocking the entry of exogenous ingredients, typically microorganisms [ 3 36 Except for non-contacting communication, it has been reported that many pathogenic microorganisms can traverse the BBB and enter the intracranial CNS by virtue of their own unique physiological structure. For example, as the cause of suppurative meningitis in newborns, Gram-negative Escherichia coli 45 46 45 47 48 Streptococcus pneumoniae group B Streptococcus neonatal meningitis Escherichia coli 49 Streptococcus pneumoniae 50 S. agalactiae 51 L. monocytogenes 52 S. pneumoniae 53 N. meningitidis 54 M. tuberculosis 55 Unlike the above bacteria that cross the BBB relying on receptor-ligand recognition, there are many studies that show that bacteria can enter the CNS via other methods. Typically, the invasion process of S. pneumoniae S. pneumoniae 56 E. coli 57 58 Figure 1 In addition to bacteria, the invasion of viruses can also induce a variety of CNS diseases [ 59 59 60 There are three main pathways by which viruses enter the CNS: (1) by crossing the vascular endothelium; (2) by invading the peripheral nervous system; and (3) by simulating the Trojan horse [ 61 62 63 64 65 66 67 Another way in which viruses invade the CNS is by infecting peripheral sensory and motor neurons. For instance, poliovirus can bind to the poliovirus receptors of neurons (CD155). Adenovirus and coxsackieviruses rely on adenovirus receptors (CAR). Acetylcholine receptors and nerve cell adhesion molecules (NCAMs) mediate rabies virus infection [ 68 69 70 Furthermore, viruses also invade the BBB vascular endothelium cells through the Trojan horse mechanism. Typically, some viruses infect immune cells and travel with them across the BBB. For example, lentiviruses and human immunodeficiency viruses usually migrate across the vascular barrier of the CNS by infecting monocytes and macrophages [ 71 72 Figure 2 73 In addition to bacteria and viruses, other microorganisms are also closely associated with CNS diseases. For example, Ekberg et al. reported that chlamydia pneumoniae, a Gram-negative respiratory pathogen, can invade the brain through the nasal nerves and cause Alzheimer’s disease [ 74 Table 1 3. Emerging Microorganism-Based Therapy for Intracranial Cancer Treatment 3.1. Integrating Virus-Associated Therapy and Emerging Biotechnology Against Intracranial Cancer The COVID-19 pandemic has made the world more aware of the existence of viruses. As organisms that coexist with humans in the ecosystem, viruses play an important role in the occurrence and development of human diseases. 3.1.1. Integrating Oncolytic Virus into Cell-Based Technologies Against Intracranial Cancer Oncolytic viruses (OVs) are a type of virus characterized by their specific selectivity in infecting and lysing tumor cells without invading normal cells [ 75 76 77 78 79 As one of the most promising biomedical technologies, cell therapy utilizes living cells or their products for the treatment of diseases. In the medical field, cell therapy has been widely applied to various types of disease treatment [ 80 81 82 83 84 85 86 87 In addition to intracranial injection in the above-mentioned studies, related research on administration through the nasal mucosa has also been reported. Mahua Dey et al. found that NSCs can migrate to the brain tumor site through intranasal delivery, and hypoxic preconditioning or overexpression of CXCR4 significantly enhances the tumor-targeting ability of NSCs. To achieve this, the authors increased the surface expression of CXCR4 on NSCs through hypoxic preconditioning and genetic modification and used these engineered NSCs to encapsulate OVs. Subsequently, they administered the OVs loaded in NSCs via the nasal mucosa route to investigate the therapeutic effects on intracranial glioma [ 88 89 In addition to NSCs, mesenchymal stem cells (MSCs) are also commonly used to load OVs to treat intracranial tumors. Raymund L. Yong et al. selected an OV (Δ24-RGD) as a model drug that possesses selective infectivity towards glioma cells [ 90 The OV delivery system based on stem cell therapy not only significantly inhibits the growth of gliomas but also shows therapeutic effects on other types of brain tumors. Wanlu Du et al. constructed an intracranial delivery system based on MSCs loaded with oncolytic herpes simplex virus (oHSV) as the model drug (MSC-oHSV) [ 16 + + In addition to stem cell therapy, there are also cases where OVs are combined with other cell therapies to enhance treatment effectiveness against CNS tumors. For example, Liu et al. constructed an engineered OV in combination with CAR-T therapy to achieve synergistic treatment of glioblastoma [ 91 3.1.2. Integrating OVs into Membrane Encapsulation Technology Against Intracranial Cancer Membrane encapsulation technology refers to the biomimetic modification of a cell membrane structure on the surface of a drug delivery system to improve its properties, such as biocompatibility, safety, and tumor selectivity. It represents one of the most promising emerging technologies in the field of drug delivery [ 92 Escherichia coli 92 93 Research on delivering OVs to the intracranial space for the treatment of CNS diseases by means of membrane encapsulation technology has also attracted attention. Considering that stem cells as carriers cannot efficiently deliver OVs to the brain through intravenous administration and are instead sequestered in the liver, Yu and colleagues tried to reform the intracranial OV delivery system [ 94 Figure 3 3.1.3. Integrating OVs into Gene Modification Technology Against Intracranial Cancer Gene modification technology is undoubtedly one of the most impactful technologies in the field of drug delivery [ 95 96 97 Based on gene modification technology, Yu et al. designed and constructed a dual-engineered OV for the treatment of glioblastoma [ 98 Figure 4 99 Montserrat Puigdelloses et al. constructed a novel engineered OV based on Delta-24-RGD, named Delta-24-ACT, which is capable of expressing 4-1BB ligand (4-1BBL), and evaluated its therapeutic effect on glioblastoma by means of immunofluorescence, flow cytometry, and other techniques [ 100 3.1.4. Integrating OVs into Other Biomedical Technologies Against Intracranial Cancer Various biomedical technologies are employed in applications of OV-based intracranial delivery systems for cancer treatment. M.M. Alonso et al. observed that an OV (DNX-2401) showed certain therapeutic efficacy in the clinical treatment of pediatric diffuse intrinsic pontine glioma (DIPG). To obtain the latest relevant clinical research data, DNX-2401 was injected into the patients’ brains and subsequently combined with radiotherapy. Clinical data show that among the 12 patients in the treatment group, 9 survived for over 12 months, including 3 individuals who survived for over 24 months. Overall, the intratumoral infusion of DNX-2401 combined with radiotherapy is feasible for treating DIPG in clinical stages [ 101 The immunogenicity of OVs is the main obstacle to their systemic delivery, primarily due to the rapid clearance of OVs by preexisting IgM in the body. To address this, KEIRO IKEDA et al. attempted to combine OVs with cyclophosphamide (CPA), which inhibits this innate antiviral response by reducing the overall plasma IgM levels [ 102 Table 2 3.1.5. Virus-Based Gene Delivery Technologies Against Intracranial Cancer The gene drug delivery system represents a novel technology that introduces gene drugs into desired cells through vectors, regulating the expression of specific proteins [ 104 105 As a secreted protein of the TNF superfamily, tumor necrosis factor ligand superfamily member 14 (TNFSF14, LIGHT, and CD258) has been widely used in cancer therapy, owing to its ability to induce tumor-associated high endothelial venules (HEVs) and tertiary lymphoid structures (TLSs), thereby facilitating the recruitment and activation of T cells [ 106 107 + 108 109 110 To further enhance the ability of AAV vectors to cross the BBB, Fengfeng Bei et al. developed a novel AAV variant (AAV.CPP.16), which demonstrated superior delivery efficiency compared to the control group in preclinical animal experiments [ 111 Figure 5 + 13 Gene delivery technologies not only hold significant therapeutic implications for intracranial tumors but also offer new strategies for exploring novel anti-tumor mechanisms. For example, Liang et al. utilized AAV technology to intervene in the expression of insulin-like growth factor binding protein-2 (IGFBP2) in order to investigate its relationship with the development of brain gliomas. The results indicate that IGFBP2 can promote further development of brain gliomas by inducing M2-type macrophage polarization at the tumor site [ 112 113 114 115 116 117 118 In addition to the conventional AAV delivery system, other viral delivery systems have been developed for the treatment of intracranial tumors. For example, Hajitou et al. successfully constructed a hybrid AAV/phage (AAVP) for the treatment of glioblastoma by combining the genome of AAV with the M13 phage capsid that possesses the ability to incorporate the RGD4C ligand targeting αβ integrin receptors, achieving the dual targeting of the tumor [ 119 Overall, virus-based gene delivery technologies are widely and effectively utilized in the field of brain glioma treatment, showing broad prospects for development. 3.2. Integrating Virus-like Particle-Associated Therapy into Emerging Biotechnology Against Intracranial Cancer Virus-like particles (VLPs) are artificially prepared biomimetic particles that mimic the structural characteristics of natural viruses but lack viral genomic material [ 120 121 122 123 124 125 126 + 127 128 Figure 6 Based on previous experimental studies, Sakamuro et al. found a significant upregulation of sterile alpha motif and HD domain-containing protein 1 (SAMHD1) in tumor tissues of glioblastoma patients, which is crucial for tumor initiation and progression. The authors designed and constructed VLPs carrying SAMHD1 depletion genes, which were then combined with γ-irradiation or temozolomide. The experimental results demonstrated that SAMHD1 serves as an ideal therapeutic target for brain glioma, improving the efficacy of temozolomide (TMZ) and γ-irradiation in glioblastoma (GBM) treatment [ 129 130 131 132 133 134 3.3. Integrating Bacteria-Associated Therapy into Emerging Biotechnology Against Intracranial Cancer Bacteria had long been viewed as a significant threat to human life and health until Dr. William Coley discovered that Streptococcus pyogenes 135 136 137 2 One of the key challenges in intracranial cancer treatment is how to build efficient delivery systems that can cross the BBB. He et al. developed a complete bacterial delivery system capable of carrying nanoparticles against glioblastoma. In this research, glucose polymer and indocyanine green-modified silicon nanoparticles were loaded into co-anaerobic bacteria via the ABC transporter to form a Trojan bacterial drug carrier system [ 58 EC-K1 138 Figure 7 In addition to bacteria, bacterial derivatives such as bacterial outer membrane vesicles are also used as delivery carriers for intracranial tumor therapy. Compared to bacterial carriers, bacterial outer membrane vesicles possess non-replicability and lower immunogenicity while inheriting various functional proteins of the bacteria themselves, making them a widely used delivery vehicle for intracranial disease treatment drugs. For example, given that Gram-negative Escherichia coli K1 K1 18 4. Emerging Microorganism-Based Therapy for Other CNS Diseases 4.1. Emerging Microorganism-Based Therapy for CNS Inflammation The pathogenesis and characteristics of CNS inflammation have been described in detail in Section 2 In the field of CNS inflammation treatment, microorganism-based nucleic acid therapy represents a main strategy that has attracted much attention recently. For example, using virus-based gene editing technology, Ari Waisman et al. provided a novel therapeutic strategy for multiple sclerosis, a common chronic inflammation of the CNS. Concretely, the authors found that the lack of A20 in CNS endothelial cells, a ubiquitin-modifying protein that negatively regulates NF-κB signaling, would aggravate the experimental autoimmune encephalomyelitis (EAE) in mice. The molecular mechanism of A20 was further investigated, and it was found that the downregulation of A20 leads to intercellular adhesion molecule 1, vascular cell adhesion molecule 1, and the inducible T cell costimulator ligand (ICOSL) being significantly upregulated. Given these research results, the authors constructed a CNS-microvasculature endothelial cell, a specific AAV capable of silencing ICOSL to achieve the regulation of ICOSL. The results showed that after the AAV was injected into mice, some of the experimental severe autoimmune encephalomyelitis mouse models were significantly relieved, which provided an effective treatment strategy for the treatment of CNS inflammation [ 139 In EAE patients, the expression level of glial glutamate transporters is downregulated, which makes neurons more vulnerable to the effects of glutamate excitotoxicity, causing various complications, such as retinal ganglion cell (RGC) degeneration and functional abnormalities. To further explore the mechanism of the effect of EAE on retinal ganglion cells, the authors made a reasonable guess that the expression levels of GLAST in the retina of rats are reduced due to the onset of EAE, which leads to the degeneration and functional abnormalities of retinal ganglion cells. Given this guess and relevant research, the authors constructed an AAV carrying GLAST mRNA to investigate whether the overexpression of GLAST in the retina could protect RGC against degeneration. The experimental results showed that the AAV increased the expression of GLAST in the retina and protected retinal ganglion cells from the effects of inflammatory CNS diseases [ 140 141 As an important channel of CNS immune cell infiltration, the choroid plexus plays an important role in the maintenance of CNS homeostasis and the occurrence of diseases. For example, reports have shown that the onset and development of EAE are also related to the choroid plexus. To further investigate its critical role in CNS disorders, Lin et al. engineered an AAV to achieve the knockdown of relevant genes in choroid plexus tissue. The results showed that, after AAV injection into the lateral ventricle, the carried RNAi successfully silenced the expression of specific genes. Knocking down the adenosine A2A receptor using an AAV led to a significant alleviation of EAE symptoms in experimental mice [ 142 C-X-C motif chemokine 12 represents a multifunctional chemokine. On the one hand, studies have shown that CXCL12 can increase the degree of CNS inflammation, and on the other hand, CXCL12s play a key role in promoting the recovery of EAE. Li et al. conducted a study to delve into the mechanisms of CXCL12 in the onset and treatment of EAE. Concretely, they constructed an AAV carrying the CXCL12 gene and injected it into the body through intrathecal catheterization to induce the upregulation of CXCL12 in the spinal cord. The experimental results demonstrated a significant upregulation of CXCL12 in the spinal cord after AAV injection, leading to a marked alleviation of the clinical signs and symptoms of EAE and a significant reduction in leukocyte infiltration associated with EAE. Furthermore, the authors proved that CXCL12 can promote the maturation and differentiation of oligodendrocyte precursor cells, which play a significant role in promoting remyelination in the spinal cord [ 143 144 Abnormal expression of interleukin-21 (IL-21) can induce a variety of autoimmune diseases. Espejo C et al. investigated the role of IL-21 in the pathogenesis of EAE by using mice as experimental models. Specifically, the authors introduced a gene encoding a novel soluble cytokine receptor (sIL21R) protein into an AAV to block the binding between IL-21 and its receptor (IL-21R). The results show that IL-21 plays a key role in the pathogenesis of EAE [ 145 146 4.2. Emerging Microorganism-Based Therapy for Neurodegenerative Diseases AAV-based gene drug delivery systems are of great significance for the exploration of new mechanisms of neurodegenerative diseases and the development of related emerging target inhibitors/agonists. Here, we introduce applications of AAV-based gene drug delivery systems for various neurodegenerative diseases over the last three years. 4.2.1. Emerging Microorganism-Based Therapy for Parkinson’s Disease Parkinson’s disease is a chronic progressive neurological disorder characterized by motor impairments, including muscle rigidity, tremors, bradykinesia, and postural instability. This disease is typically caused by the degeneration and death of dopaminergic neurons in the brain that control movement, leading to a decrease in dopamine levels. AAV-based gene therapy offers a novel strategy for the treatment of Parkinson’s disease. Lu et al. designed and constructed an engineered AAV that can selectively target striatal D1 medium spiny neurons. By loading promoter elements with enhanced D1-MSN activity into AAV, the treatment of Parkinson’s disease and the restoration of motor ability are realized [ 147 Figure 8 148 149 150 151 12 4.2.2. Emerging Microorganism-Based Therapy for Alzheimer’s Disease Alzheimer’s disease is a progressive neurodegenerative disease and is the most common form of dementia in the elderly [ 152 153 Adiponectin (APN) is a type of adipokine that is expressed specifically in adipocytes and has neuroprotective and anti-inflammatory effects. To further explore the specific mechanism of APN in Alzheimer’s disease, Chan et al. constructed an AAV (AAV2/8-APN) expressing APN by inserting an APN gene fragment. The experimental results showed that the overexpression of APN decreased both the soluble and fibrillar Aβ in the brains of 5xFAD mice and reduced the secretion of IL-1β and IL-18. Subsequent experimental results further showed that treatment with AAV-APN significantly improved memory function and reduced atrophic neuronal processes in 5xFAD mice [ 154 In Alzheimer’s disease (AD), triggering receptor expressed on myeloid cell 2 (TREM2) has been shown to have neuroprotective effects against inflammation and nerve damage. Based on this, Wang et al. introduced TREM2-silencing genes into an AAV to explore the effect of reduced TREM2 expression on Alzheimer’s disease. The experimental results showed that after TREM2 was silenced, the level of pro-inflammatory cytokines in the brain of mice increased inflammation and significantly decreased cognitive levels. In contrast, the overexpression of TREM2 mitigated LPS-induced inflammation in vitro and induced M2-phenotypic microglia [ 155 4.3. Emerging Microorganism-Based Therapy for Stroke Stroke is a CNS disease with a high incidence, causing great harm. Recently, the development of a number of new treatment strategies for stroke has attracted much attention. Among them, the virus-based gene delivery system represents a mainstream strategy for stroke treatment. For example, vascular endothelial growth factor-C (VEGF-C) can impact the stability of the CNS by regulating the development of meningeal lymphatic vessels. Based on this, Thomas JL et al. further explored the effects of VEGF-C overexpression on the onset of ischemic stroke. Specifically, the authors engineered an AAV carrying a segment of mRNA encoding VEGF-C (AAV-mVEGF-C), which was intrathecally injected into a mouse model of stroke. The experimental results showed that AAV-mVEGF-C pretreatment reduced stroke injury and improved motor performance in the subacute stage, possibly attributed to the neuroprotective effects of VEGF-C [ 156 It has been reported that the knockout of polypyrimidine tract-binding protein 1 (PTB) can reprogram astrocytes into functional neurons. Therefore, Huang et al. introduced PTB-silencing gene fragments into an AAV to knock out PTB in mice with ischemic stroke induced by endothelin-1 and then investigated the therapeutic effect on stroke. The results showed that in a mouse model of ischemic stroke, the knockout of PTB effectively transformed endogenous glial cells into functional neurons, thereby restoring the neural tissue structure at the ischemic site. In addition, the elimination of PTB reduced the inflammatory response at the lesion and improved the behavioral function of the stroke mice. In conclusion, this study provides a new strategy for the treatment of stroke [ 157 158 Table 3 5. Concluding Remarks In the past decade, considerable efforts have been made to develop smart drug delivery systems against CNS diseases by integrating the emerging biomedical discovery and technological innovation with traditional microorganism therapy. In this review, we closely focused on the applications of microorganism-based emerging biotechnology therapy in the treatment of CNS diseases in the past three years. First, we explored the necessary relationship between microorganisms and the occurrence and development of CNS diseases. Second, we detailed the latest preclinical studies of various microbial therapies (such as bacteriotherapy, bacterial outer membrane vesicle vectors, OVs, AAVs, and VLPs) in the treatment of several common CNS diseases, including brain cancer, CNS inflammation, neurodegenerative diseases, and stroke. In general, microorganism-based emerging biomedical therapy aids in the treatment of CNS diseases, the discovery of new therapeutic targets, and the development of new drugs. 6. Clinical Challenges Despite the potential benefits of microorganism-based emerging biomedical therapy, there exist several challenges that hamper clinical development in the field of CNS treatment. First, the CNS is a very fragile immune organ; so, it is crucial to achieve disease treatment without affecting CNS homeostasis. Second, although microbial-related delivery systems have a certain ability to leap over the BBB compared to other delivery vectors, systematic delivery strategies of microorganisms are difficult to implement due to their inherent immunogenicity, thus affecting the effectiveness of intracranial targeting. As reviewed in this paper, although there have been studies aimed at improving the long-term cycling capacity of microorganisms through gene editing techniques (such as knocking out lipopolysaccharides of K1 bacteria), many have been limited to invasive drug delivery methods. In addition, the treatment of CNS diseases is associated with higher costs owing to the complex structure. This includes expenses during the drug development phase as well as the financial burden on patients during clinical treatment. These factors significantly hinder the clinical application of microbiome-based drugs in the treatment of CNS diseases. The significance of this review lies in making relevant research more clearly understood and accepted by the public, thereby promoting the progress of clinical development as much as possible. Overall, in this review, we have summarized the preclinical applications of microorganism-based emerging biomedical therapy in the treatment of CNS diseases and laid a foundation for the subsequent development of related clinical products. With concerted efforts in addressing these challenges, microorganism-based emerging biomedical therapy has the potential to be applied in clinical settings for the treatment of CNS diseases ( Figure 9 Disclaimer/Publisher’s Note: Author Contributions Writing—original draft preparation, Z.L.; Conceptualization, S.Y.; Supervision and funding acquisition, L.S. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. References 1. Miller K.D. Ostrom Q.T. Kruchko C. Patil N. Tihan T. Cioffi G. Fuchs H.E. Waite K.A. Jemal A. Siegel R.L. Brain and other central nervous system tumor statistics CA Cancer J. Clin. 2021 71 381 406 34427324 10.3322/caac.21693 2. Terstappen G.C. Meyer A.H. Bell R.D. Zhang W. Strategies for delivering therapeutics across the blood-brain barrier Nat. Rev. Drug Discov. 2021 20 362 383 10.1038/s41573-021-00139-y 33649582 3. Andjelkovic A.V. Situ M. Citalan-Madrid A.F. Stamatovic S.M. Xiang J. Keep R.F. Blood-Brain Barrier Dysfunction in Normal Aging and Neurodegeneration: Mechanisms, Impact, and Treatments Stroke 2023 54 661 672 10.1161/STROKEAHA.122.040578 36848419 PMC9993074 4. Kim M.W. Gao W. Lichti C.F. Gu X. Dykstra T. Cao J. Smirnov I. Boskovic P. Kleverov D. Salvador A.F.M. Endogenous self-peptides guard immune privilege of the central nervous system Nature 2024 637 176 183 10.1038/s41586-024-08279-y 39476864 PMC11666455 5. Yalamandala B.N. Chen Y.J. Lin Y.H. Huynh T.M.H. Chiang W.H. Chou T.C. Liu H.W. Huang C.C. Lu Y.J. Chiang C.S. A Self-Cascade Penetrating Brain Tumor Immunotherapy Mediated by Near-Infrared II Cell Membrane-Disrupting Nanoflakes via Detained Dendritic Cells ACS Nano 2024 18 18712 18728 10.1021/acsnano.4c06183 38952208 PMC11256899 6. Pandit R. Chen L. Götz J. The blood-brain barrier: Physiology and strategies for drug delivery Adv. Drug Deliv. Rev. 2020 165–166 1 14 10.1016/j.addr.2019.11.009 31790711 7. Okuyama T. Eto Y. Sakai N. Minami K. Yamamoto T. Sonoda H. Yamaoka M. Tachibana K. Hirato T. Sato Y. Iduronate-2-Sulfatase with Anti-human Transferrin Receptor Antibody for Neuropathic Mucopolysaccharidosis II: A Phase 1/2 Trial Mol. Ther. 2019 27 456 464 10.1016/j.ymthe.2018.12.005 30595526 PMC6391590 8. Gaillard P.J. Kerklaan B.M. Aftimos P. Altintas S. Jager A. Gladdines W. Lonnqvist F. Soetekouw P. Verheul H. Awada A. Abstract CT216: Phase I dose escalating study of 2B3-101, glutathione PEGylated liposomal doxorubicin, in patients with solid tumors and brain metastases or recurrent malignant glioma Cancer Res. 2014 74 (Suppl. 19) CT216 10.1158/1538-7445.AM2014-CT216 9. Yang T. Martin P. Fogarty B. Brown A. Schurman K. Phipps R. Yin V.P. Lockman P. Bai S. Exosome delivered anticancer drugs across the blood-brain barrier for brain cancer therapy in Danio rerio Pharm. Res. 2015 32 2003 2014 10.1007/s11095-014-1593-y 25609010 PMC4520542 10. Qu M. Lin Q. Huang L. Fu Y. Wang L. He S. Fu Y. Yang S. Zhang Z. Zhang L. Dopamine-loaded blood exosomes targeted to brain for better treatment of Parkinson’s disease J. Control Release 2018 287 156 166 10.1016/j.jconrel.2018.08.035 30165139 11. Li X. Qi L. Yang D. Hao S. Zhang F. Zhu X. Sun Y. Chen C. Ye J. Yang J. Meningeal lymphatic vessels mediate neurotropic viral drainage from the central nervous system Nat. Neurosci. 2022 25 577 587 10.1038/s41593-022-01063-z 35524140 12. Huang Q. Chan K.Y. Wu J. Botticello-Romero N.R. Zheng Q. Lou S. Keyes C. Svanbergsson A. Johnston J. Mills A. An AAV capsid reprogrammed to bind human transferrin receptor mediates brain-wide gene delivery Science 2024 384 1220 1227 10.1126/science.adm8386 38753766 13. Goertsen D. Flytzanis N.C. Goeden N. Chuapoco M.R. Cummins A. Chen Y. Fan Y. Zhang Q. Sharma J. Duan Y. AAV capsid variants with brain-wide transgene expression and decreased liver targeting after intravenous delivery in mouse and marmoset Nat. Neurosci. 2022 25 106 115 10.1038/s41593-021-00969-4 34887588 14. Wang C. Li Y. Gu L. Chen R. Zhu H. Zhang X. Zhang Y. Feng S. Qiu S. Jian Z. Gene Targets of CAR-T Cell Therapy for Glioblastoma Cancers 2023 15 2351 10.3390/cancers15082351 37190280 PMC10136592 15. Choi B.D. Gerstner E.R. Frigault M.J. Leick M.B. Mount C.W. Balaj L. Nikiforow S. Carter B.S. Curry W.T. Gallagher K. Intraventricular CARv3-TEAM-E T Cells in Recurrent Glioblastoma N. Engl. J. Med. 2024 390 1290 1298 10.1056/NEJMoa2314390 38477966 PMC11162836 16. Du W. Seah I. Bougazzoul O. Choi G. Meeth K. Bosenberg M.W. Wakimoto H. Fisher D. Shah K. Stem cell-released oncolytic herpes simplex virus has therapeutic efficacy in brain metastatic melanomas Proc. Natl. Acad. Sci. USA 2017 114 E6157 E6165 10.1073/pnas.1700363114 28710334 PMC5544283 17. István S. Dóra B. Zsolt É. Linda L. Zsuzsa B. Cardiovascular disease and microbiome: Focus on ischemic stroke Pol. Arch. Intern. Med. 2025 135 17088 40838552 10.20452/pamw.17088 18. Chen H. Zhou M. Zeng Y. Miao T. Luo H. Tong Y. Zhao M. Mu R. Gu J. Yang S. Biomimetic Lipopolysaccharide-Free Bacterial Outer Membrane-Functionalized Nanoparticles for Brain-Targeted Drug Delivery Adv. Sci. 2022 9 e2105854 10.1002/advs.202105854 PMC9165477 35355446 19. Smyth L.C.D. Xu D. Okar S.V. Dykstra T. Rustenhoven J. Papadopoulos Z. Bhasiin K. Kim M.W. Drieu A. Mamuladze T. Identification of direct connections between the dura and the brain Nature 2024 627 165 173 10.1038/s41586-023-06993-7 38326613 PMC11254388 20. Zhao S. Umpierre A.D. Wu L.J. Tuning neural circuits and behaviors by microglia in the adult brain Trends Neurosci. 2024 47 181 194 10.1016/j.tins.2023.12.003 38245380 PMC10939815 21. Mathiisen T.M. Lehre K.P. Danbolt N.C. Ottersen O.P. The perivascular astroglial sheath provides a complete covering of the brain microvessels: An electron microscopic 3D reconstruction Glia 2010 58 1094 1103 10.1002/glia.20990 20468051 22. Agrawal M. Saraf S. Saraf S. Dubey S.K. Puri A. Patel R.J. Ajazuddin Ravichandiran V. Murty U.S. Alexander A. Recent strategies and advances in the fabrication of nano lipid carriers and their application towards brain targeting J. Control Release 2020 321 372 415 10.1016/j.jconrel.2020.02.020 32061621 23. Yamaguchi S. Motegi H. Ishi Y. Okamoto M. Sawaya R. Kobayashi H. Terasaka S. Houkin K. Clinical Outcome of Cytoreductive Surgery Prior to Bevacizumab for Patients with Recurrent Glioblastoma: A Single-center Retrospective Analysis Neurol. Med. Chir. 2021 61 245 252 10.2176/nmc.oa.2020-0308 PMC8048115 33658457 24. Schaff L.R. Mellinghoff I.K. Glioblastoma and Other Primary Brain Malignancies in Adults: A Review Jama 2023 329 574 587 10.1001/jama.2023.0023 36809318 PMC11445779 25. Brastianos P.K. Kim A.E. Giobbie-Hurder A. Lee E.Q. Lin N.U. Overmoyer B. Wen P.Y. Nayak L. Cohen J.V. Dietrich J. Pembrolizumab in brain metastases of diverse histologies: Phase 2 trial results Nat. Med. 2023 29 1728 1737 10.1038/s41591-023-02392-7 37268724 PMC10644912 26. Alibek K. Kakpenova A. Baiken Y. Role of infectious agents in the carcinogenesis of brain and head and neck cancers Infect. Agents Cancer 2013 8 7 10.1186/1750-9378-8-7 23374258 PMC3573938 27. Maginnis M.S. Atwood W.J. JC virus: An oncogenic virus in animals and humans? Semin. Cancer Biol. 2009 19 261 269 10.1016/j.semcancer.2009.02.013 19505654 PMC2694964 28. O’Rourke D.M. Nasrallah M.P. Desai A. Melenhorst J.J. Mansfield K. Morrissette J.J.D. Martinez-Lage M. Brem S. Maloney E. Shen A. A single dose of peripherally infused EGFRvIII-directed CAR T cells mediates antigen loss and induces adaptive resistance in patients with recurrent glioblastoma Sci. Transl. Med. 2017 9 eaaa0984 10.1126/scitranslmed.aaa0984 28724573 PMC5762203 29. Liu Z. Zhou J. Yang X. Liu Y. Zou C. Lv W. Chen C. Cheng K.K. Chen T. Chang L.J. Safety and antitumor activity of GD2-Specific 4SCAR-T cells in patients with glioblastoma Mol. Cancer 2023 22 3 10.1186/s12943-022-01711-9 36617554 PMC9827625 30. Steiner S. Kratzel A. Barut G.T. Lang R.M. Aguiar Moreira E. Thomann L. Kelly J.N. Thiel V. SARS-CoV-2 biology and host interactions Nat. Rev. Microbiol. 2024 22 206 225 10.1038/s41579-023-01003-z 38225365 31. Lecca D. Jung Y.J. Scerba M.T. Hwang I. Kim Y.K. Kim S. Modrow S. Tweedie D. Hsueh S.C. Liu D. Role of chronic neuroinflammation in neuroplasticity and cognitive function: A hypothesis Alzheimers Dement. 2022 18 2327 2340 10.1002/alz.12610 35234334 PMC9437140 32. Temple S. Advancing cell therapy for neurodegenerative diseases Cell Stem Cell 2023 30 512 529 10.1016/j.stem.2023.03.017 37084729 PMC10201979 33. Tolosa E. Garrido A. Scholz S.W. Poewe W. Challenges in the diagnosis of Parkinson’s disease Lancet Neurol. 2021 20 385 397 10.1016/S1474-4422(21)00030-2 33894193 PMC8185633 34. Levine K.S. Leonard H.L. Blauwendraat C. Iwaki H. Johnson N. Bandres-Ciga S. Ferrucci L. Faghri F. Singleton A.B. Nalls M.A. Virus exposure and neurodegenerative disease risk across national biobanks Neuron 2023 111 1086 1093.e1082 10.1016/j.neuron.2022.12.029 36669485 PMC10079561 35. Hansson O. Biomarkers for neurodegenerative diseases Nat. Med. 2021 27 954 963 10.1038/s41591-021-01382-x 34083813 36. Hill L. Popov J. Figueiredo M. Caputi V. Hartung E. Moshkovich M. Pai N. Protocol for a systematic review on the role of the gut microbiome in paediatric neurological disorders Acta Neuropsychiatr. 2021 33 211 216 10.1017/neu.2021.8 33818352 37. Jucker M. Walker L.C. Alzheimer’s disease: From immunotherapy to immunoprevention Cell 2023 186 4260 4270 10.1016/j.cell.2023.08.021 37729908 PMC10578497 38. Saini V. Guada L. Yavagal D.R. Global Epidemiology of Stroke and Access to Acute Ischemic Stroke Interventions Neurology 2021 97 S6 S16 10.1212/WNL.0000000000012781 34785599 39. Meng C. Deng P. Miao R. Tang H. Li Y. Wang J. Wu J. Wang W. Liu S. Xia J. Gut microbiome and risk of ischaemic stroke: A comprehensive Mendelian randomization study Eur. J. Prev. Cardiol. 2023 30 613 620 10.1093/eurjpc/zwad052 36799937 40. Cryan J.F. O’Riordan K.J. Sandhu K. Peterson V. Dinan T.G. The gut microbiome in neurological disorders Lancet Neurol. 2020 19 179 194 10.1016/S1474-4422(19)30356-4 31753762 41. Chervinets V.M. Chervinets Y.V. Chichanovskaja L.V. Ganzja D.V. Grigoryants E.O. Belyaev V.S. Mironov A.Y. The microbiome of oral cavity patients with periodontitis, adhesive and biofilm forming properties Klin. Lab. Diagn. 2022 67 163 169 10.51620/0869-2084-2022-67-3-163-169 35320632 42. Li C. Zhao Z. Luo Y. Ning T. Liu P. Chen Q. Chu Y. Guo Q. Zhang Y. Zhou W. Macrophage-Disguised Manganese Dioxide Nanoparticles for Neuroprotection by Reducing Oxidative Stress and Modulating Inflammatory Microenvironment in Acute Ischemic Stroke Adv. Sci. 2021 8 e2101526 10.1002/advs.202101526 PMC8529435 34436822 43. Sorboni S.G. Moghaddam H.S. Jafarzadeh-Esfehani R. Soleimanpour S. A Comprehensive Review on the Role of the Gut Microbiome in Human Neurological Disorders Clin. Microbiol. Rev. 2022 35 e0033820 10.1128/CMR.00338-20 34985325 PMC8729913 44. GBD 2019 Stroke Collaborators Global, regional, and national burden of stroke and its risk factors, 1990–2019: A systematic analysis for the Global Burden of Disease Study Lancet Neurol. 2021 20 795 820 10.1016/S1474-4422(21)00252-0 34487721 PMC8443449 45. Khan N.A. Shin S. Chung J.W. Kim K.J. Elliott S. Wang Y. Kim K.S. Outer membrane protein A and cytotoxic necrotizing factor-1 use diverse signaling mechanisms for Escherichia coli K1 invasion of human brain microvascular endothelial cells Microb. Pathog. 2003 35 35 42 10.1016/S0882-4010(03)00090-1 12860457 46. Coureuil M. Lécuyer H. Bourdoulous S. Nassif X. A journey into the brain: Insight into how bacterial pathogens cross blood-brain barriers Nat. Rev. Microbiol. 2017 15 149 159 10.1038/nrmicro.2016.178 28090076 47. Koebnik R. Structural and functional roles of the surface-exposed loops of the beta-barrel membrane protein OmpA from Escherichia coli J. Bacteriol. 1999 181 3688 3694 10.1128/JB.181.12.3688-3694.1999 10368142 PMC93845 48. Chung J.W. Hong S.J. Kim K.J. Goti D. Stins M.F. Shin S. Dawson V.L. Dawson T.M. Kim K.S. 37-kDa laminin receptor precursor modulates cytotoxic necrotizing factor 1-mediated RhoA activation and bacterial uptake J. Biol. Chem. 2003 278 16857 16862 10.1074/jbc.M301028200 12615923 49. Cheng Z. Zheng Y. Yang W. Sun H. Zhou F. Huang C. Zhang S. Song Y. Liang Q. Yang N. Pathogenic bacteria exploit transferrin receptor transcytosis to penetrate the blood-brain barrier Proc. Natl. Acad. Sci. USA 2023 120 e2307899120 10.1073/pnas.2307899120 37733740 PMC10523449 50. Pinho-Ribeiro F.A. Deng L. Neel D.V. Erdogan O. Basu H. Yang D. Choi S. Walker A.J. Carneiro-Nascimento S. He K. Bacteria hijack a meningeal neuroimmune axis to facilitate brain invasion Nature 2023 615 472 481 10.1038/s41586-023-05753-x 36859544 PMC10593113 51. Tenenbaum T. Spellerberg B. Adam R. Vogel M. Kim K.S. Schroten H. Streptococcus agalactiae invasion of human brain microvascular endothelial cells is promoted by the laminin-binding protein Lmb Microbes Infect. 2007 9 714 720 10.1016/j.micinf.2007.02.015 17400016 52. Niemann H.H. Jäger V. Butler P.J. van den Heuvel J. Schmidt S. Ferraris D. Gherardi E. Heinz D.W. Structure of the human receptor tyrosine kinase met in complex with the Listeria invasion protein InlB Cell 2007 130 235 246 10.1016/j.cell.2007.05.037 17662939 53. Radin J.N. Orihuela C.J. Murti G. Guglielmo C. Murray P.J. Tuomanen E.I. beta-Arrestin 1 participates in platelet-activating factor receptor-mediated endocytosis of Streptococcus pneumoniae Infect. Immun. 2005 73 7827 7835 10.1128/IAI.73.12.7827-7835.2005 16299272 PMC1307033 54. Unkmeir A. Latsch K. Dietrich G. Wintermeyer E. Schinke B. Schwender S. Kim K.S. Eigenthaler M. Frosch M. Fibronectin mediates Opc-dependent internalization of Neisseria meningitidis in human brain microvascular endothelial cells Mol. Microbiol. 2002 46 933 946 10.1046/j.1365-2958.2002.03222.x 12421301 55. Kim K.S. Mechanisms of microbial traversal of the blood-brain barrier Nat. Rev. Microbiol. 2008 6 625 634 10.1038/nrmicro1952 18604221 PMC5206914 56. Ring A. Weiser J.N. Tuomanen E.I. Pneumococcal trafficking across the blood-brain barrier. Molecular analysis of a novel bidirectional pathway J. Clin. Investig. 1998 102 347 360 10.1172/JCI2406 9664076 PMC508893 57. Zhang W.G. Khan A.N. Kim K.J. Stins M. Kim K.S. Transforming growth factor-beta increases Escherichia coli K1 adherence, invasion, and transcytosis in human brain microvascular endothelial cells Cell Tissue Res. 2002 309 281 286 12172787 10.1007/s00441-002-0549-4 58. Sun R. Liu M. Lu J. Chu B. Yang Y. Song B. Wang H. He Y. Bacteria loaded with glucose polymer and photosensitive ICG silicon-nanoparticles for glioblastoma photothermal immunotherapy Nat. Commun. 2022 13 5127 10.1038/s41467-022-32837-5 36050316 PMC9433534 59. Lanz T.V. Brewer R.C. Ho P.P. Moon J.-S. Jude K.M. Fernandez D. Fernandes R.A. Gomez A.M. Nadj G.-S. Bartley C.M. Clonally expanded B cells in multiple sclerosis bind EBV EBNA1 and GlialCAM Nature 2022 603 321 327 10.1038/s41586-022-04432-7 35073561 PMC9382663 60. Vietzen H. Berger S.M. Kühner L.M. Furlano P.L. Bsteh G. Berger T. Rommer P. Puchhammer-Stöckl E. Ineffective control of Epstein-Barr-virus-induced autoimmunity increases the risk for multiple sclerosis Cell 2023 186 5705 5718.e5713 10.1016/j.cell.2023.11.015 38091993 61. McGavern D.B. Kang S.S. Illuminating viral infections in the nervous system Nat. Rev. Immunol. 2011 11 318 329 10.1038/nri2971 21508982 PMC5001841 62. Antar A.A. Konopka J.L. Campbell J.A. Henry R.A. Perdigoto A.L. Carter B.D. Pozzi A. Abel T.W. Dermody T.S. Junctional adhesion molecule-A is required for hematogenous dissemination of reovirus Cell Host Microbe 2009 5 59 71 10.1016/j.chom.2008.12.001 19154988 PMC2642927 63. Afonso P.V. Ozden S. Cumont M.C. Seilhean D. Cartier L. Rezaie P. Mason S. Lambert S. Huerre M. Gessain A. Alteration of blood-brain barrier integrity by retroviral infection PLoS Pathog. 2008 4 e1000205 10.1371/journal.ppat.1000205 19008946 PMC2575404 64. Zhang L. Zhou L. Bao L. Liu J. Zhu H. Lv Q. Liu R. Chen W. Tong W. Wei Q. SARS-CoV-2 crosses the blood-brain barrier accompanied with basement membrane disruption without tight junctions alteration Signal Transduct. Target. Ther. 2021 6 337 10.1038/s41392-021-00719-9 34489403 PMC8419672 65. Chapagain M.L. Verma S. Mercier F. Yanagihara R. Nerurkar V.R. Polyomavirus JC infects human brain microvascular endothelial cells independent of serotonin receptor 2A Virology 2007 364 55 63 10.1016/j.virol.2007.02.018 17399760 PMC2034208 66. Gralinski L.E. Ashley S.L. Dixon S.D. Spindler K.R. Mouse adenovirus type 1-induced breakdown of the blood-brain barrier J. Virol. 2009 83 9398 9410 10.1128/JVI.00954-09 19570856 PMC2738240 67. Verma S. Kumar M. Gurjav U. Lum S. Nerurkar V.R. Reversal of West Nile virus-induced blood-brain barrier disruption and tight junction proteins degradation by matrix metalloproteinases inhibitor Virology 2010 397 130 138 10.1016/j.virol.2009.10.036 19922973 PMC3102050 68. Salinas S. Schiavo G. Kremer E.J. A hitchhiker’s guide to the nervous system: The complex journey of viruses and toxins Nat. Rev. Microbiol. 2010 8 645 655 10.1038/nrmicro2395 20706281 69. Curanovic D. Enquist L. Directional transneuronal spread of α-herpesvirus infection Future Virol. 2009 4 591 603 10.2217/fvl.09.62 20161665 PMC2819188 70. Mori I. Nishiyama Y. Yokochi T. Kimura Y. Olfactory transmission of neurotropic viruses J. Neurovirol. 2005 11 129 137 10.1080/13550280590922793 16036791 71. Alexaki A. Wigdahl B. HIV-1 infection of bone marrow hematopoietic progenitor cells and their role in trafficking and viral dissemination PLoS Pathog. 2008 4 e1000215 10.1371/journal.ppat.1000215 19112504 PMC2603331 72. Clay C.C. Rodrigues D.S. Ho Y.S. Fallert B.A. Janatpour K. Reinhart T.A. Esser U. Neuroinvasion of fluorescein-positive monocytes in acute simian immunodeficiency virus infection J. Virol. 2007 81 12040 12048 10.1128/JVI.00133-07 17715237 PMC2168770 73. Shay T.F. Sullivan E.E. Ding X. Chen X. Ravindra Kumar S. Goertsen D. Brown D. Crosby A. Vielmetter J. Borsos M. Primate-conserved carbonic anhydrase IV and murine-restricted LY6C1 enable blood-brain barrier crossing by engineered viral vectors Sci. Adv. 2023 9 eadg6618 10.1126/sciadv.adg6618 37075114 PMC10115422 74. Chacko A. Delbaz A. Walkden H. Basu S. Armitage C.W. Eindorf T. Trim L.K. Miller E. West N.P. St John J.A. Chlamydia pneumoniae can infect the central nervous system via the olfactory and trigeminal nerves and contributes to Alzheimer’s disease risk Sci. Rep. 2022 12 2759 10.1038/s41598-022-06749-9 35177758 PMC8854390 75. Chen Y. Chen X. Bao W. Liu G. Wei W. Ping Y. An oncolytic virus-T cell chimera for cancer immunotherapy Nat. Biotechnol. 2024 42 1876 1887 10.1038/s41587-023-02118-7 38336902 76. Ling A.L. Solomon I.H. Landivar A.M. Nakashima H. Woods J.K. Santos A. Masud N. Fell G. Mo X. Yilmaz A.S. Clinical trial links oncolytic immunoactivation to survival in glioblastoma Nature 2023 623 157 166 10.1038/s41586-023-06623-2 37853118 PMC10620094 77. Shalhout S.Z. Miller D.M. Emerick K.S. Kaufman H.L. Therapy with oncolytic viruses: Progress and challenges Nat. Rev. Clin. Oncol. 2023 20 160 177 10.1038/s41571-022-00719-w 36631681 78. He J. Connors J. Meador A. Xu S. Meador H. Jiang H. Fueyo J. Gomez-Manzano C. Friedman G.K. Zaky W. Immunotherapy-Related Neurotoxicity in the Central Nervous System of Children with Cancer Neuro Oncol. 2024 27 625 643 10.1093/neuonc/noae243 PMC11889721 39535217 79. Hamad A. Yusubalieva G.M. Baklaushev V.P. Chumakov P.M. Lipatova A.V. Recent Developments in Glioblastoma Therapy: Oncolytic Viruses and Emerging Future Strategies Viruses 2023 15 547 10.3390/v15020547 36851761 PMC9958853 80. Wang Y. Shi J. Xin M. Kahkoska A.R. Wang J. Gu Z. Cell-drug conjugates Nat. Biomed. Eng. 2024 8 1347 1365 10.1038/s41551-024-01230-6 38951139 PMC11646559 81. Vincent R.L. Gurbatri C.R. Li F. Vardoshvili A. Coker C. Im J. Ballister E.R. Rouanne M. Savage T. de Los Santos-Alexis K. Probiotic-guided CAR-T cells for solid tumor targeting Science 2023 382 211 218 10.1126/science.add7034 37824640 PMC10915968 82. Chen X. Xu Z. Gao Y. Chen Y. Yin W. Liu Z. Cui W. Li Y. Sun J. Yang Y. Framework Nucleic Acid-Based Selective Cell Catcher for Endogenous Stem Cell Recruitment Adv. Mater. 2024 36 e2406118 10.1002/adma.202406118 39543443 83. Fueyo J. Gomez-Manzano C. Lang F.F. Alonso M.M. Hitchhiking to brain tumours: Stem cell delivery of oncolytic viruses Lancet Oncol. 2021 22 1049 1051 10.1016/S1470-2045(21)00296-5 34214494 84. Ahmed A.U. Thaci B. Alexiades N.G. Han Y. Qian S. Liu F. Balyasnikova I.V. Ulasov I.Y. Aboody K.S. Lesniak M.S. Neural Stem Cell-based Cell Carriers Enhance Therapeutic Efficacy of an Oncolytic Adenovirus in an Orthotopic Mouse Model of Human Glioblastoma Mol. Ther. 2011 19 1714 1726 10.1038/mt.2011.100 21629227 PMC3182345 85. Thaci B. Ahmed A.U. Ulasov I.V. Tobias A.L. Han Y. Aboody K.S. Lesniak M.S. Pharmacokinetic study of neural stem cell-based cell carrier for oncolytic virotherapy: Targeted delivery of the therapeutic payload in an orthotopic brain tumor model Cancer Gene Ther. 2012 19 431 442 10.1038/cgt.2012.21 22555507 PMC3356460 86. Tyler M.A. Ulasov I.V. Sonabend A.M. Nandi S. Han Y. Marler S. Roth J. Lesniak M.S. Neural stem cells target intracranial glioma to deliver an oncolytic adenovirus in vivo Gene Ther. 2009 16 262 278 10.1038/gt.2008.165 19078993 PMC2642530 87. Tobias A.L. Thaci B. Auffinger B. Rincón E. Balyasnikova I.V. Kim C.K. Han Y. Zhang L. Aboody K.S. Ahmed A.U. The timing of neural stem cell-based virotherapy is critical for optimal therapeutic efficacy when applied with radiation and chemotherapy for the treatment of glioblastoma Stem Cells Transl. Med. 2013 2 655 666 10.5966/sctm.2013-0039 23926209 PMC3754466 88. Dey M. Yu D. Kanojia D. Li G. Sukhanova M. Spencer D.A. Pituch K.C. Zhang L. Han Y. Ahmed A.U. Intranasal Oncolytic Virotherapy with CXCR4-Enhanced Stem Cells Extends Survival in Mouse Model of Glioma Stem Cell Rep. 2016 7 471 482 10.1016/j.stemcr.2016.07.024 27594591 PMC5032402 89. Spencer D. Yu D. Morshed R.A. Li G. Pituch K.C. Gao D.X. Bertolino N. Procissi D. Lesniak M.S. Balyasnikova I.V. Pharmacologic modulation of nasal epithelium augments neural stem cell targeting of glioblastoma Theranostics 2019 9 2071 2083 10.7150/thno.29581 31037157 PMC6485287 90. Yong R.L. Shinojima N. Fueyo J. Gumin J. Vecil G.G. Marini F.C. Bogler O. Andreeff M. Lang F.F. Human bone marrow-derived mesenchymal stem cells for intravascular delivery of oncolytic adenovirus Delta24-RGD to human gliomas Cancer Res. 2009 69 8932 8940 10.1158/0008-5472.CAN-08-3873 19920199 PMC2789204 91. Zhu G. Zhang J. Zhang Q. Jin G. Su X. Liu S. Liu F. Enhancement of CD70-specific CAR T treatment by IFN-γ released from oHSV-1-infected glioblastoma Cancer Immunol. Immunother. 2022 71 2433 2448 10.1007/s00262-022-03172-x 35249119 PMC10992073 92. Chen L. Qin H. Zhao R. Zhao X. Lin L. Chen Y. Lin Y. Li Y. Qin Y. Li Y. Bacterial cytoplasmic membranes synergistically enhance the antitumor activity of autologous cancer vaccines Sci. Transl. Med. 2021 13 eabc2816 10.1126/scitranslmed.abc2816 34233949 93. Huang H. Sun M. Liu M. Pan S. Liu P. Cheng Z. Li J. Xu H. Liu F. Pang Z. Full encapsulation of oncolytic virus using hybrid erythroctye-liposome membranes for augmented anti-refractory tumor effectiveness Nano Today 2022 47 101671 10.1016/j.nantod.2022.101671 94. Jia X. Wang L. Feng X. Liu W. Wang X. Li F. Liu X. Yu J. Yu B. Yu X. Cell Membrane-Coated Oncolytic Adenovirus for Targeted Treatment of Glioblastoma Nano Lett. 2023 23 11120 11128 10.1021/acs.nanolett.3c03516 38032110 95. Liu F. Xin M. Feng H. Zhang W. Liao Z. Sheng T. Wen P. Wu Q. Liang T. Shi J. Cryo-shocked tumor cells deliver CRISPR-Cas9 for lung cancer regression by synthetic lethality Sci. Adv. 2024 10 eadk8264 10.1126/sciadv.adk8264 38552011 PMC10980270 96. Wang P. Li X. Wang J. Gao D. Li Y. Li H. Chu Y. Zhang Z. Liu H. Jiang G. Re-designing Interleukin-12 to enhance its safety and potential as an anti-tumor immunotherapeutic agent Nat. Commun. 2017 8 1395 10.1038/s41467-017-01385-8 29123084 PMC5680234 97. Park B.H. Hwang T. Liu T.C. Sze D.Y. Kim J.S. Kwon H.C. Oh S.Y. Han S.Y. Yoon J.H. Hong S.H. Use of a targeted oncolytic poxvirus, JX-594, in patients with refractory primary or metastatic liver cancer: A phase I trial Lancet Oncol. 2008 9 533 542 10.1016/S1470-2045(08)70107-4 18495536 98. Tian L. Xu B. Chen Y. Li Z. Wang J. Zhang J. Ma R. Cao S. Hu W. Chiocca E.A. Specific targeting of glioblastoma with an oncolytic virus expressing a cetuximab-CCL5 fusion protein via innate and adaptive immunity Nat. Cancer 2022 3 1318 1335 10.1038/s43018-022-00448-0 36357700 PMC10150871 99. Cassady K.A. Human cytomegalovirus TRS1 and IRS1 gene products block the double-stranded-RNA-activated host protein shutoff response induced by herpes simplex virus type 1 infection J. Virol. 2005 79 8707 8715 10.1128/JVI.79.14.8707-8715.2005 15994764 PMC1168740 100. Puigdelloses M. Garcia-Moure M. Labiano S. Laspidea V. Gonzalez-Huarriz M. Zalacain M. Marrodan L. Martinez-Velez N. De la Nava D. Ausejo I. CD137 and PD-L1 targeting with immunovirotherapy induces a potent and durable antitumor immune response in glioblastoma models J. Immunother. Cancer 2021 9 e002644 10.1136/jitc-2021-002644 34281988 PMC8291319 101. Gállego Pérez-Larraya J. Garcia-Moure M. Labiano S. Patiño-García A. Dobbs J. Gonzalez-Huarriz M. Zalacain M. Marrodan L. Martinez-Velez N. Puigdelloses M. Oncolytic DNX-2401 Virus for Pediatric Diffuse Intrinsic Pontine Glioma N. Engl. J. Med. 2022 386 2471 2481 10.1056/NEJMoa2202028 35767439 102. Ikeda K. Ichikawa T. Wakimoto H. Silver J.S. Deisboeck T.S. Finkelstein D. Harsh G.R. Louis D.N. Bartus R.T. Hochberg F.H. Oncolytic virus therapy of multiple tumors in the brain requires suppression of innate and elicited antiviral responses Nat. Med. 1999 5 881 887 10.1038/11320 10426310 103. Liu J. Piranlioglu R. Ye F. Shu K. Lei T. Nakashima H. Immunosuppressive cells in oncolytic virotherapy for glioma: Challenges and solutions Front. Cell. Infect. Microbiol. 2023 13 1141034 10.3389/fcimb.2023.1141034 37234776 PMC10206241 104. Gao J. Gunasekar S. Xia Z.J. Shalin K. Jiang C. Chen H. Lee D. Lee S. Pisal N.D. Luo J.N. Gene therapy for CNS disorders: Modalities, delivery and translational challenges Nat. Rev. Neurosci. 2024 25 553 572 10.1038/s41583-024-00829-7 38898231 105. Verbeke R. Hogan M.J. Loré K. Pardi N. Innate immune mechanisms of mRNA vaccines Immunity 2022 55 1993 2005 10.1016/j.immuni.2022.10.014 36351374 PMC9641982 106. Hsu C.Y. Huang C.Y. Shih C.M. Lin Y.W. Huang P.H. Lin S.J. Liu C.W. Lin C.Y. Lin F.Y. Tumor Necrosis Factor Superfamily 14 (LIGHT) Restricts Neovascularization by Decreasing Circulating Endothelial Progenitor Cells and Function Int. J. Mol. Sci. 2023 24 6997 10.3390/ijms24086997 37108160 PMC10138919 107. Ramachandran M. Vaccaro A. van de Walle T. Georganaki M. Lugano R. Vemuri K. Kourougkiaouri D. Vazaios K. Hedlund M. Tsaridou G. Tailoring vascular phenotype through AAV therapy promotes anti-tumor immunity in glioma Cancer Cell 2023 41 1134 1151.e1110 10.1016/j.ccell.2023.04.010 37172581 108. von Roemeling C. Yegorov O. Yang C. Klippel K. Russell R. Trivedi V. Bhatia A. Doonan B. Carpenter S. Ryu D. CXCL9 recombinant adeno-associated virus (AAV) virotherapy sensitizes glioblastoma (GBM) to anti-PD-1 immune checkpoint blockade Res. Sq. 2023 15 5871 10.1038/s41467-024-49989-1 PMC11245621 38997283 109. Strecker M.I. Wlotzka K. Strassheimer F. Roller B. Ludmirski G. König S. Röder J. Opitz C. Alekseeva T. Reul J. AAV-mediated gene transfer of a checkpoint inhibitor in combination with HER2-targeted CAR-NK cells as experimental therapy for glioblastoma Oncoimmunology 2022 11 2127508 10.1080/2162402X.2022.2127508 36249274 PMC9559045 110. Volak A. LeRoy S.G. Natasan J.S. Park D.J. Cheah P.S. Maus A. Fitzpatrick Z. Hudry E. Pinkham K. Gandhi S. Virus vector-mediated genetic modification of brain tumor stromal cells after intravenous delivery J. Neurooncol. 2018 139 293 305 10.1007/s11060-018-2889-2 29767307 PMC6454875 111. Yao Y. Wang J. Liu Y. Qu Y. Wang K. Zhang Y. Chang Y. Yang Z. Wan J. Liu J. Variants of the adeno-associated virus serotype 9 with enhanced penetration of the blood-brain barrier in rodents and primates Nat. Biomed. Eng. 2022 6 1257 1271 10.1038/s41551-022-00938-7 36217021 112. Zhang X. Sun X. Guo C. Li J. Liang G. Cancer-associated fibroblast-associated gene IGFBP2 promotes glioma progression through induction of M2 macrophage polarization Am. J. Physiol. Cell Physiol. 2024 326 C252 C268 10.1152/ajpcell.00234.2023 37982173 113. Li H. Liu Y. Liu Y. Xu L. Sun Z. Zheng D. Liu X. Song C. Zhang Y. Liang H. Tumor-associated astrocytes promote tumor progression of Sonic Hedgehog medulloblastoma by secreting lipocalin Brain Pathol. 2024 34 e13212 10.1111/bpa.13212 37721122 PMC10711256 114. Wang Y. Liu F. Wu J. Zhang M.Q. Chai J.L. Cao C. G protein inhibitory α subunit 2 is a molecular oncotarget of human glioma Int. J. Biol. Sci. 2023 19 865 879 10.7150/ijbs.79355 36778118 PMC9909998 115. Guo Y.Z. Chen G. Huang M. Wang Y. Liu Y.Y. Jiang Q. Cao C. Liu F. TIMM44 is a potential therapeutic target of human glioma Theranostics 2022 12 7586 7602 10.7150/thno.78616 36438483 PMC9691352 116. Bhere D. Arghiani N. Lechtich E.R. Yao Y. Alsaab S. Bei F. Matin M.M. Shah K. Simultaneous downregulation of miR-21 and upregulation of miR-7 has anti-tumor efficacy Sci. Rep. 2020 10 1779 10.1038/s41598-020-58072-w 32019988 PMC7000780 117. Ye L. Park J.J. Dong M.B. Yang Q. Chow R.D. Peng L. Du Y. Guo J. Dai X. Wang G. In vivo CRISPR screening in CD8 T cells with AAV-Sleeping Beauty hybrid vectors identifies membrane targets for improving immunotherapy for glioblastoma Nat. Biotechnol. 2019 37 1302 1313 10.1038/s41587-019-0246-4 31548728 PMC6834896 118. Chow R.D. Guzman C.D. Wang G. Schmidt F. Youngblood M.W. Ye L. Errami Y. Dong M.B. Martinez M.A. Zhang S. AAV-mediated direct in vivo CRISPR screen identifies functional suppressors in glioblastoma Nat. Neurosci. 2017 20 1329 1341 10.1038/nn.4620 28805815 PMC5614841 119. Przystal J.M. Waramit S. Pranjol M.Z.I. Yan W. Chu G. Chongchai A. Samarth G. Olaciregui N.G. Tabatabai G. Carcaboso A.M. Efficacy of systemic temozolomide-activated phage-targeted gene therapy in human glioblastoma EMBO Mol. Med. 2019 11 e8492 10.15252/emmm.201708492 30808679 PMC6460351 120. Zhao F.H. Wu T. Hu Y.M. Wei L.H. Li M.Q. Huang W.J. Chen W. Huang S.J. Pan Q.J. Zhang X. Efficacy, safety, and immunogenicity of an Escherichia coli-produced Human Papillomavirus (16 and 18) L1 virus-like-particle vaccine: End-of-study analysis of a phase 3, double-blind, randomised, controlled trial Lancet Infect. Dis. 2022 22 1756 1768 10.1016/S1473-3099(22)00435-2 36037823 121. Yin D. Zhong Y. Ling S. Lu S. Wang X. Jiang Z. Wang J. Dai Y. Tian X. Huang Q. Dendritic-cell-targeting virus-like particles as potent mRNA vaccine carriers Nat. Biomed. Eng. 2024 9 185 200 10.1038/s41551-024-01208-4 38714892 122. Ye D. Zimmermann T. Demina V. Sotnikov S. Ried C.L. Rahn H. Stapf M. Untucht C. Rohe M. Terstappen G.C. Trafficking of JC virus-like particles across the blood-brain barrier Nanoscale Adv. 2021 3 2488 2500 10.1039/D0NA00879F 36134165 PMC9418390 123. Madigan V. Zhang F. Dahlman J.E. Drug delivery systems for CRISPR-based genome editors Nat. Rev. Drug Discov. 2023 22 875 894 10.1038/s41573-023-00762-x 37723222 124. Nooraei S. Bahrulolum H. Hoseini Z.S. Katalani C. Hajizade A. Easton A.J. Ahmadian G. Virus-like particles: Preparation, immunogenicity and their roles as nanovaccines and drug nanocarriers J. Nanobiotechnology 2021 19 59 10.1186/s12951-021-00806-7 33632278 PMC7905985 125. Gu W. Luozhong S. Cai S. Londhe K. Elkasri N. Hawkins R. Yuan Z. Su-Greene K. Yin Y. Cruz M. Extracellular vesicles incorporating retrovirus-like capsids for the enhanced packaging and systemic delivery of mRNA into neurons Nat. Biomed. Eng. 2024 8 415 426 10.1038/s41551-023-01150-x 38374224 126. Shukla S. Wang C. Beiss V. Cai H. Washington T. 2nd Murray A.A. Gong X. Zhao Z. Masarapu H. Zlotnick A. The unique potency of Cowpea mosaic virus (CPMV) in situ cancer vaccine Biomater. Sci. 2020 8 5489 5503 10.1039/D0BM01219J 32914796 PMC8086234 127. Kerstetter-Fogle A. Shukla S. Wang C. Beiss V. Harris P.L.R. Sloan A.E. Steinmetz N.F. Plant Virus-Like Particle In Situ Vaccine for Intracranial Glioma Immunotherapy Cancers 2019 11 515 10.3390/cancers11040515 30974896 PMC6521079 128. Pang H.H. Huang C.Y. Chen P.Y. Li N.S. Hsu Y.P. Wu J.K. Fan H.F. Wei K.C. Yang H.W. Bioengineered Bacteriophage-Like Nanoparticles as RNAi Therapeutics to Enhance Radiotherapy against Glioblastomas ACS Nano 2023 17 10407 10422 10.1021/acsnano.3c01102 37120837 PMC10278167 129. Daddacha W. Monroe D. Carver K. Usoro E.R. Alptekin A. Xu H. Osuka S. Arbab A.S. Sakamuro D. Viral Particle-Mediated SAMHD1 Depletion Sensitizes Refractory Glioblastoma to DNA-Damaging Therapeutics by Impairing Homologous Recombination Cancers 2022 14 4490 10.3390/cancers14184490 36139652 PMC9497202 130. Yang J. Zhang Q. Liu Y. Zhang X. Shan W. Ye S. Zhou X. Ge Y. Wang X. Ren L. Nanoparticle-based co-delivery of siRNA and paclitaxel for dual-targeting of glioblastoma Nanomedicine 2020 15 1391 1409 10.2217/nnm-2020-0066 32495692 131. Thuenemann E.C. Le D.H.T. Lomonossoff G.P. Steinmetz N.F. Bluetongue Virus Particles as Nanoreactors for Enzyme Delivery and Cancer Therapy Mol. Pharm. 2021 18 1150 1156 10.1021/acs.molpharmaceut.0c01053 33566625 PMC8086382 132. Pang H.H. Chen P.Y. Wei K.C. Huang C.W. Shiue Y.L. Huang C.Y. Yang H.W. Convection-Enhanced Delivery of a Virus-Like Nanotherapeutic Agent with Dual-Modal Imaging for Besiegement and Eradication of Brain Tumors Theranostics 2019 9 1752 1763 10.7150/thno.30977 31037136 PMC6485197 133. Pang H.H. Huang C.Y. Chou Y.W. Lin C.J. Zhou Z.L. Shiue Y.L. Wei K.C. Yang H.W. Bioengineering fluorescent virus-like particle/RNAi nanocomplexes act synergistically with temozolomide to eradicate brain tumors Nanoscale 2019 11 8102 8109 10.1039/C9NR01247H 30982841 134. Chao C.N. Yang Y.H. Wu M.S. Chou M.C. Fang C.Y. Lin M.C. Tai C.K. Shen C.H. Chen P.L. Chang D. Gene therapy for human glioblastoma using neurotropic JC virus-like particles as a gene delivery vector Sci. Rep. 2018 8 2213 10.1038/s41598-018-19825-w 29396437 PMC5797127 135. Chen Z. Liu Y. Yu Y. Yang S. Feng J. Zhu Y. Huang W. Qin B. Guan X. He Z. Micro-to-Nano Oncolytic Microbial System Shifts from Tumor Killing to Tumor Draining Lymph Nodes Remolding for Enhanced Immunotherapy Adv. Mater. 2024 36 e2306488 10.1002/adma.202306488 37844257 136. Sun M. Yang S. Huang H. Gao P. Pan S. Cheng Z. He Z. Wang Z. Sun J. Liu F. Boarding Oncolytic Viruses onto Tumor-Homing Bacterium-Vessels for Augmented Cancer Immunotherapy Nano Lett. 2022 22 5055 5064 10.1021/acs.nanolett.2c00699 35583490 137. Ban W. Sun M. Huang H. Huang W. Pan S. Liu P. Li B. Cheng Z. He Z. Liu F. Engineered bacterial outer membrane vesicles encapsulating oncolytic adenoviruses enhance the efficacy of cancer virotherapy by augmenting tumor cell autophagy Nat. Commun. 2023 14 2933 10.1038/s41467-023-38679-z 37217527 PMC10203215 138. Lu J. Ding J. Chu B. Ji C. Zhang Q. Xu Y. Song B. Wang H. He Y. Inactive Trojan Bacteria as Safe Drug Delivery Vehicles Crossing the Blood-Brain Barrier Nano Lett. 2023 23 4326 4333 10.1021/acs.nanolett.3c00563 37130058 139. Johann L. Soldati S. Müller K. Lampe J. Marini F. Klein M. Schramm E. Ries N. Schelmbauer C. Palagi I. A20 regulates lymphocyte adhesion in murine neuroinflammation by restricting endothelial ICOSL expression in the CNS J. Clin. Investig. 2023 133 e168314 10.1172/JCI168314 37856217 PMC10721159 140. Boccuni I. Bas-Orth C. Bruehl C. Draguhn A. Fairless R. Glutamate transporter contribution to retinal ganglion cell vulnerability in a rat model of multiple sclerosis Neurobiol. Dis. 2023 187 106306 10.1016/j.nbd.2023.106306 37734623 141. Liu P. Chen W. Jiang H. Huang H. Liu L. Fang F. Li L. Feng X. Liu D. Dalal R. Differential effects of SARM1 inhibition in traumatic glaucoma and EAE optic neuropathies Mol. Ther. Nucleic Acids 2023 32 13 27 10.1016/j.omtn.2023.02.029 36950280 PMC10025007 142. Yang Y. Qi C. Hu L. Zheng C. Li X. Zheng W. Weng Y. Lin H. Targeted Knockdown of Genes in the Choroid Plexus J. Vis. Exp. 2023 16 10.3791/65555 37395567 143. Lin D. Liu H. Song H. Chen B. Fu J. Sun M. Zhou H. Bai W. Wei S. Li H. Upregulation of C-X-C motif chemokine 12 in the spinal cord alleviated the symptoms of experimental autoimmune encephalomyelitis in Lewis rats Front. Neurosci. 2023 17 1105530 10.3389/fnins.2023.1105530 37008218 PMC10060838 144. Zhang Y. Li D. Zeng Q. Feng J. Fu H. Luo Z. Xiao B. Yang H. Wu M. LRRC4 functions as a neuron-protective role in experimental autoimmune encephalomyelitis Mol. Med. 2021 27 44 10.1186/s10020-021-00304-4 33932995 PMC8088686 145. Edo Á. Calvo-Barreiro L. Eixarch H. Bosch A. Chillón M. Espejo C. Therapeutic Effect of IL-21 Blockage by Gene Therapy in Experimental Autoimmune Encephalomyelitis Neurotherapeutics 2022 19 1617 1633 10.1007/s13311-022-01279-8 35902536 PMC9606180 146. Alrashdi B. Dawod B. Schampel A. Tacke S. Kuerten S. Marshall J.S. Côté P.D. Nav1.6 promotes inflammation and neuronal degeneration in a mouse model of multiple sclerosis J. Neuroinflammation 2019 16 215 10.1186/s12974-019-1622-1 31722722 PMC6852902 147. Chen Y. Hong Z. Wang J. Liu K. Liu J. Lin J. Feng S. Zhang T. Shan L. Liu T. Circuit-specific gene therapy reverses core symptoms in a primate Parkinson’s disease model Cell 2023 186 5394 5410.e5318 10.1016/j.cell.2023.10.004 37922901 148. Park H. Kam T.I. Peng H. Chou S.C. Mehrabani-Tabari A.A. Song J.J. Yin X. Karuppagounder S.S. Umanah G.K. Rao A.V.S. PAAN/MIF nuclease inhibition prevents neurodegeneration in Parkinson’s disease Cell 2022 185 1943 1959.e1921 10.1016/j.cell.2022.04.020 35545089 PMC9149120 149. Kaplitt M.G. Feigin A. Tang C. Fitzsimons H.L. Mattis P. Lawlor P.A. Bland R.J. Young D. Strybing K. Eidelberg D. Safety and tolerability of gene therapy with an adeno-associated virus (AAV) borne GAD gene for Parkinson’s disease: An open label, phase I trial Lancet 2007 369 2097 2105 10.1016/S0140-6736(07)60982-9 17586305 150. Rico A.J. Corcho A. Chocarro J. Ariznabarreta G. Roda E. Honrubia A. Arnaiz P. Lanciego J.L. Development and characterization of a non-human primate model of disseminated synucleinopathy Front. Neuroanat. 2024 18 1355940 10.3389/fnana.2024.1355940 38601798 PMC11004326 151. Niu X.Y. Xie X.X. Tuo H.Z. Lv C.P. Huang Y.R. Zhu J. Liang S.Y. Du X.Y. Yang C.G. Hou S.J. Thrombomodulin reduces α-synuclein generation and ameliorates neuropathology in a mouse model of Parkinson’s disease Cell Death Discov. 2024 10 167 10.1038/s41420-024-01939-y 38589400 PMC11002034 152. Graff-Radford J. Yong K.X.X. Apostolova L.G. Bouwman F.H. Carrillo M. Dickerson B.C. Rabinovici G.D. Schott J.M. Jones D.T. Murray M.E. New insights into atypical Alzheimer’s disease in the era of biomarkers Lancet Neurol. 2021 20 222 234 10.1016/S1474-4422(20)30440-3 33609479 PMC8056394 153. Pérez-Sisqués L. Sancho-Balsells A. Solana-Balaguer J. Campoy-Campos G. Vives-Isern M. Soler-Palazón F. Anglada-Huguet M. López-Toledano M. Mandelkow E.M. Alberch J. RTP801/REDD1 contributes to neuroinflammation severity and memory impairments in Alzheimer’s disease Cell Death Dis. 2021 12 616 10.1038/s41419-021-03899-y 34131105 PMC8206344 154. Ng R.C. Jian M. Ma O.K. Xiang A.W. Bunting M. Kwan J.S. Wong C.W. Yick L.W. Chung S.K. Lam K.S. Liver-specific adiponectin gene therapy suppresses microglial NLRP3-inflammasome activation for treating Alzheimer’s disease J. Neuroinflammation 2024 21 77 10.1186/s12974-024-03066-y 38539253 PMC10967198 155. Wang Y. Lin Y. Wang L. Zhan H. Luo X. Zeng Y. Wu W. Zhang X. Wang F. TREM2 ameliorates neuroinflammatory response and cognitive impairment via PI3K/AKT/FoxO3a signaling pathway in Alzheimer’s disease mice Aging 2020 12 20862 20879 10.18632/aging.104104 33065553 PMC7655179 156. Boisserand L.S.B. Geraldo L.H. Bouchart J. El Kamouh M.R. Lee S. Sanganahalli B.G. Spajer M. Zhang S. Lee S. Parent M. VEGF-C prophylaxis favors lymphatic drainage and modulates neuroinflammation in a stroke model J. Exp. Med. 2024 221 e20221983 10.1084/jem.20221983 38442272 PMC10913814 157. Yuan M. Tang Y. Huang T. Ke L. Huang E. In situ direct reprogramming of astrocytes to neurons via polypyrimidine tract-binding protein 1 knockdown in a mouse model of ischemic stroke Neural. Regen. Res. 2024 19 2240 2248 10.4103/1673-5374.390957 38488558 PMC11034579 158. Zhang Y. Li J. Zhao Y. Huang Y. Shi Z. Wang H. Cao H. Wang C. Wang Y. Chen D. Arresting the bad seed: HDAC3 regulates proliferation of different microglia after ischemic stroke Sci. Adv. 2024 10 eade6900 10.1126/sciadv.ade6900 38446877 PMC10917353 Figure 1 Bacteria loaded with glucose polymer and photosensitive ICG silicon nanoparticles for glioblastoma photothermal immunotherapy, *** p t a b c d 58 Figure 2 HIV-1 infection of bone marrow hematopoietic progenitor cells and their role in trafficking and viral dissemination. ( a b c 71 Figure 3 Cell membrane-coated oncolytic adenovirus for targeted treatment of glioblastoma, * p p t a b c d 94 Figure 4 Specific targeting of glioblastoma with an oncolytic virus expressing a cetuximab-CCL5 fusion protein via innate and adaptive immunity. ( a b b c 98 Figure 5 Variants of the adeno-associated virus serotype 9 with enhanced penetration of the blood–brain barrier in rodents and primates. ( a b c d 111 Figure 6 Bioengineered bacteriophage-like nanoparticles as RNAi therapeutics to enhance radiotherapy against glioblastomas, * p t a Let-7g b c 128 Figure 7 Inactive Trojan bacteria as safe drug delivery vehicles crossing the BBB. ( a b c d 138 Figure 8 Circuit-specific gene therapy reverses core symptoms in a primate Parkinson’s disease model. * p p p t a b c d 147 Figure 9 The clinical situations and future prospects of microorganism-based therapy in emerging biotechnology against intracranial central nervous system diseases. pharmaceutics-17-01175-t001_Table 1 Table 1 Cross-talk between CNS diseases and microorganisms. Microbial Type Disease Type Entry Mode Concrete Pathway Reference EC-K1 suppurative meningitis receptor-ligand binding OmpA-gp96 [ 47 EC-K1 suppurative meningitis receptor-ligand binding CNF1 protein [ 48 Streptococcus pneumoniae group B Streptococcus neonatal meningitis Escherichia coli bacterial meningitis and cerebral palsy hijacking the iron transporter receptor transporter receptor [ 49  Streptococcus pneumoniae bacterial meningitis hijacking the polymeric immunoglobulin receptor polymeric immunoglobulin receptor [ 50  S. agalactiae bacterial meningitis receptor-ligand binding Lmb, FbsA, and IagA [ 51  L. monocytogenes bacterial meningitis receptor-ligand binding InlB [ 52  S. pneumoniae bacterial meningitis receptor-ligand binding phosphorylcholine and PAF receptor [ 53  N. meningitidis bacterial meningitis receptor-ligand binding protein Opc-fibronectin [ 54  M. tuberculosis tuberculous meningitis hijacking immune cells scavenger receptors [ 55  S. pneumoniae bacterial meningitis increasing TNF-α level phosphorylcholine relative receptor [ 56 Reovirus viral meningitis receptor-ligand binding JAM-A [ 62 Retrovirus HTLV1 viral meningitis receptor-ligand binding GLUT [ 63 SARS-CoV-2 viral meningitis upregulation of chemokines upregulation of the MMP9 protein [ 64 Polyomavirus viral meningitis receptor-ligand binding serotonin receptor 2A [ 65 Mouse adenovirus type 1 acute encephalomyelitis BBB destruction BBB-destroying E3 protein [ 65 West Nile virus encephalitis BBB destruction MMP-9 [ 67 Poliovirus encephalitis receptor-ligand binding CD155 [ 68 Adenovirus encephalitis receptor-ligand binding CAR [ 68 Rabies virus encephalitis receptor-ligand binding NCAM [ 68 Herpes virus and pseudorabies virus encephalitis receptor-ligand binding PVRL1, 2 [ 69 Trojan horse encephalitis Trojan horse infection of monocytes and macrophages [ 69 Chlamydia pneumoniae Alzheimer’s disease through the nasal nerves nasal nerves [ 74 pharmaceutics-17-01175-t002_Table 2 Table 2 Applications of boarding OVs onto biomedical technologies against intracranial cancer in clinical trials [ 103 Country Type of OV Years Administration Route Biomedical Technologies Clinical Stage Type of Disease References USA Ad (DNX-24-RGD) 2016 i.t. Combined with pembrolizumab II Malignant brain tumor NCT02798406 USA HSV (G207) 2023 MRI-guided infusion Gene modification II High-grade glioma NCT04482933 USA PVSRIPO 2017 i.t. Gene modification II Malignant glioma NCT02986178 Japan HSV (G47 delta) 2014 i.t. Gene modification II Glioblastoma UMIN000015995 USA HSV (M032) 2022 Infusion Gene modification II Glioblastoma multiforme NCT05084430 China HSV (OH2) 2021 Ommaya reservoir injection Gene modification II CNS tumor NCT05235074 Germany H-1 parvovirus 2011 i.t./i.v. Gene modification II Glioblastoma multiforme NCT01301430 France TG6002 2017 i.v. Gene modification II Glioblastoma NCT03294486 The Netherlands Ad (DNX-24-RGD) 2010 Convection-enhanced delivery / II Recurrent glioblastoma NCT01582516 Spain Ad (ICOVIR-5) 2021 Infusion Stem cell therapy II Medulloblastoma NCT04758533 USA PVSRIPO 2017 Convection-enhanced delivery / Ib Malignant glioma NCT03043391 USA HSV (G207) 2019 MRI-guided infusion Gene modification I Glioblastoma multiforme NCT03911388 USA REOLYSIN ® 2006 i.t. / I Malignant glioma NCT00528684 China Ad-TD-nsIL12 2023 i.t. Gene modification I DIPG NCT05717712 Spain DNX-24-RGD 2017 Cerebellar peduncle infusion Gene modification I Brainstem glioma NCT03178032 USA DNX-24-RGD 2019 Infusion Stem cell therapy I High-grade glioma NCT03896568 USA DNX-24-RGD 2014 i.t. Combined with IFNγ I Recurrent glioblastoma NCT02197169 Spain DNX-24-RGD 2013 i.t. or resected cavity Combined with temozolomide I Recurrent glioblastoma NCT01956734 USA CRAd-S-pk7 2017 Resected cavity Stem cell therapy I High-grade glioma NCT03072134 USA CRAd-S-pk7 2023 i.c. / I Recurrent high-grade glioma NCT05139056 Spain DNX-2440 2018 i.t. / I Recurrent glioblastoma NCT03714334 USA Ad5-yCD 2022 i.t. Gene modification I Malignant glioma NCT05686798 USA HSV (G207) 2019 Infusion Gene modification I Glioblastoma multiforme NCT03911388 USA rQNestin 2017 i.t. Gene modification I Malignant glioma NCT03152318 USA HSV (C134) 2019 i.t. / I Recurrent glioblastoma NCT03657576 USA HSV (M032) 2013 Infusion Gene modification I Recurrent glioblastoma NCT02062827 USA HSV (MVR-C5252) 2023 i.t. Gene modification I Recurrent glioblastoma NCT05095441 USA PVSRIPO 2012 i.t. / I Glioblastoma NCT01491893 pharmaceutics-17-01175-t003_Table 3 Table 3 Emerging microorganism-based therapy for intracranial cancer treatment. Microbial Type Disease Type Emerging Biotechnology Specific Empowerment Reference CRAd-S-pk7 Intracranial glioma NSC therapy Tumor tropism [ 17 OVs Intracranial glioma NSC therapy Crossing the BBB, tumor targeting [ 88 Δ24-RGD Intracranial glioma MSC therapy Crossing the BBB, tumor targeting [ 90 oHSV Melanoma brain metastases MSC therapy Crossing the BBB, tumor targeting [ 16 OVs Glioblastoma CAR-T therapy Enhancing the anti-tumor efficacy [ 91 A4/k37 Glioblastoma Membrane encapsulation Crossing the BBB [ 94 Ads Glioblastoma Gene modification Enhancing the anti-tumor efficacy [ 96 OVs Glioblastoma Gene modification Enhancing the anti-tumor efficacy [ 97 OVs Glioblastoma Gene modification Enhancing the anti-tumor efficacy [ 98 OVs Glioblastoma Gene modification Enhancing OV replication [ 99 Delta-24-ACT Glioblastoma Gene modification Enhancing the anti-tumor efficacy [ 100 DNX-2401 DIPG Combination with radiotherapy Enhancing the anti-tumor efficacy [ 101 OVs Glioblastoma Combination with CPA Inhibition of antiviral response [ 102 AAV-LIGHT Glioblastoma Gene delivery (LIGHT) Enhancing the anti-tumor efficacy [ 107 HER2-AAV Glioblastoma Gene delivery (aPD-1) Enhancing the anti-tumor efficacy [ 109 AAV Glioblastoma Gene delivery (IFN-β) Tumor targeting, enhancing the anti-tumor efficacy [ 110 AAV.CPP.16 Glioblastoma Gene delivery (membrane-penetrating peptide) Crossing the BBB [ 13 AAV Glioblastoma Gene delivery (IGFBP2) Exploring novel anti-tumor mechanisms [ 112 AAV Medulloblastoma Gene delivery (lipocalin-2) Exploring novel anti-tumor mechanisms [ 113 AAV Glioblastoma Gene delivery (Gαi2) Exploring novel anti-tumor mechanisms [ 114 AAV Glioblastoma Gene delivery (TIMM44) Exploring novel anti-tumor mechanisms [ 115 AAV Glioblastoma Gene delivery (miRzip-21) Exploring novel anti-tumor mechanisms [ 116 Hybrid AAV/phage Glioblastoma Gene delivery (RGD4C) Enhancing the anti-tumor efficacy [ 119 Bacteriophage Qβ Glioblastoma Gene delivery (b-3WJ) Enhancing the anti-tumor efficacy [ 127 VLPs Glioblastoma Gene delivery (SAMHD1) Enhancing the anti-tumor efficacy [ 129 VLPs Glioblastoma Gene delivery (YAP) Crossing the BBB, tumor targeting [ 130 VLPs Glioblastoma Gene delivery (TK-VLPs) Enhancing the anti-tumor efficacy [ 131 VLPs Glioblastoma Gene delivery (Ga-DOTA) Enhancing the anti-tumor efficacy [ 131 VLPs Glioblastoma Gene delivery (apolipoprotein E peptide) Crossing the BBB, enhancing the anti-tumor efficacy [ 133 VLPs Glioblastoma Gene delivery (JCPYV) Crossing the BBB, enhancing the anti-tumor efficacy [ 134 Bacteria Glioblastoma Combination with silicon nanoparticles Crossing the BBB [ 58 EC-K1 Glioblastoma Combination with photodynamic therapy Crossing the BBB [ 138 EC-K1 OMVs Glioblastoma Combination with PLGA nanoparticles Crossing the BBB [ 18 AAV Multiple sclerosis Gene delivery (ICOSL) Enhancing efficacy [ 139 AAV Encephalomyelitis Gene delivery (GLAST) Enhancing efficacy [ 140 AAV Encephalomyelitis Gene delivery (sterile α) Enhancing efficacy [ 141 AAV Encephalomyelitis Gene delivery (A2A) Enhancing efficacy [ 142 AAV Encephalomyelitis Gene delivery (CXCL12) Enhancing efficacy [ 143 AAV Encephalomyelitis Gene delivery (LRRC4) Enhancing efficacy [ 144 AAV Encephalomyelitis Gene delivery (IL-21) Enhancing efficacy [ 145 AAV Parkinson’s disease Gene delivery (D1-MSN) Enhancing efficacy [ 147 AAV Parkinson’s disease Gene delivery (pathologic α-synuclein) Enhancing efficacy [ 148 AAV Parkinson’s disease Gene delivery (glutamic acid decarboxylase) Enhancing efficacy [ 149 AAV Parkinson’s disease Gene delivery (α-synuclein) Exploring novel mechanisms [ 150 AAV Parkinson’s disease Gene delivery (IL-21) Exploring novel mechanisms [ 151 AAV Parkinson’s disease Gene delivery (Bl-hTFR1) Exploring novel mechanisms [ 12 AAV Alzheimer’s disease Gene delivery (RTP801) Exploring novel mechanisms [ 153 AAV2/8-APN Alzheimer’s disease Gene delivery (APN) Enhancing efficacy [ 154 AAV Alzheimer’s disease Gene delivery (TREM2) Enhancing efficacy [ 155 AAV-mVEGF-C Stroke Gene delivery (VEGF-C) Enhancing efficacy [ 156 AAV Stroke Gene delivery (PTB) Enhancing efficacy [ 157 AAV Stroke Gene delivery (HDAC3/PU.1) Enhancing efficacy [ 158 ",
  "metadata": {
    "Title of this paper": "Arresting the bad seed: HDAC3 regulates proliferation of different microglia after ischemic stroke",
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473930/"
  }
}