{
  "title": "Paper_268",
  "abstract": "pmc Front Cell Dev Biol Front Cell Dev Biol 2593 frontcdb Front. Cell Dev. Biol. Frontiers in Cell and Developmental Biology 2296-634X Frontiers Media SA PMC12488686 PMC12488686.1 12488686 12488686 10.3389/fcell.2025.1564382 1564382 1 Cell and Developmental Biology Original Research Sirtuin 6 mediates the therapeutic effect of endometrial regenerative cell-derived exosomes in alleviation of acute transplant rejection by weakening c-myc-dependent glutaminolysis Liu et al. 10.3389/fcell.2025.1564382 Liu Tong  1  2  † Sun Chenglu  1  2  † Liu Xu  1  2  † Zhao Pengyu  1  2 Shao Bo  1  2 Xu Yini  1  2 Xiao Yiyi  1  2 Wang Hongda  1  2 Chen Qiang  1  2 Yang Guangmei  1  2 Wang Hao  1  2  3 *  1 Department of General Surgery, Tianjin Medical University General Hospital Tianjin China  2 Tianjin General Surgery Institute Tianjin China  3 Tianjin Key Laboratory of Precise Vascular Reconstruction and Organ Function Repair Tianjin China  Edited by: Sukhbir Kaur  Reviewed by: Wen Li  Marcin Kaminski  Shijie Qi *Correspondence: Hao Wang, hwangca272@hotmail.com hwang1@tmu.edu.cn  † These authors share first authorship 18 9 2025 2025 13 480890 1564382 21 1 2025 27 8 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Liu, Sun, Liu, Zhao, Shao, Xu, Xiao, Wang, Chen, Yang and Wang. 2025 Liu, Sun, Liu, Zhao, Shao, Xu, Xiao, Wang, Chen, Yang and Wang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Despite the rapid development of immunosuppressive drugs, acute rejection (AR) remains a cause of allograft dysfunction and allograft failure. Although endometrial regenerative cell-derived exosomes (ERC-Exos) effectively alleviate AR, more research is required to fully understand the underlying mechanisms. Thus, this study aimed to determine whether sirtuin 6 (SIRT6) mediates the therapeutic effect of ERC-Exos on AR and elucidate the underlying mechanisms. Methods The expression of SIRT6 was verified in ERC-Exos by Western blot. ERC-Exos with extremely low expression of SIRT6 (SIRT6-KD-ERC-Exos) were obtained by transducing shRNA-SIRT6 in ERCs. C57BL/6 recipient mice were transplanted with heart grafts from BALB/c donor mice and divided into three groups: untreated, ERC-Exo-treated, and SIRT6-KD-ERC-Exo-treated groups. Recipient mice were sacrificed on post-operative day 8 for the determination of graft pathological changes, intra-graft immunocyte infiltration, splenic CD4 + in vivo + in vitro in vitro Results ERC-Exos expressed SIRT6, and cardiac graft survival was increased by SIRT6-expressing ERC-Exos. Graft pathological damage, intra-graft CD4 + in vitro + in vivo in vitro Conclusion SIRT6 is crucial in mediating ERC-Exos to remodel CD4 + endometrial regenerative cells exosomes SIRT6 CD4 + T cell differentiation glutaminolysis acute rejection National Natural Science Foundation of China 10.13039/501100001809 82071802 号 Natural Science Foundation of Tianjin Municipality 10.13039/501100006606 The author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by grants to HaW from the National Natural Science Foundation of China (No. 82071802 and 82270794), Natural Science Foundation of Tianjin (No. 21JCYBJC00850), Science and Technology Project of Tianjin Health Commission (No. TJWJ2021MS004), and Tianjin Key Medical Discipline (Specialty) Construction Project (TJYXZDXK-076C). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Stem Cell Research Introduction Despite the availability of alternative treatments, organ transplantation remains the most reliable means to treat end-stage organ failure ( Shah et al., 2022 Kittleson and Kobashigawa, 2017 Stewart et al., 2007 Stewart et al., 2007 Söderlund and Rådegran, 2015 Due to their extremely low expression of major histocompatibility complex (MHC) class II and absence of MHC class I as well as co-stimulatory molecules, mesenchymal stem cells (MSCs) are classified as “immune privileged cells” ( Quaranta et al., 2016 Sun et al., 2018 Endometrial regenerative cells (ERCs) are a new type of MSCs collected from menstrual blood with the advantages of non-invasive acquisition and autologous stem cell reinfusion therapy ( Darzi et al., 2016 in vivo + Hu et al., 2021 Li et al., 2019 Wang et al., 2021 Hu et al., 2021 Klabukov et al., 2023 + Sirtuin 6 (SIRT6), an important member of the NAD + Li et al., 2022 Li et al., 2022 Guo et al., 2022 Lee et al., 2017 Schmitz et al., 2003 Wang et al., 2019 + + Sebastián et al., 2012 + GLS1 SCL1A5 Wang et al., 2011 Marchingo et al., 2020 + Glutamine, an immune regulatory nutrient, is frequently used in large amounts for cellular energy and facilitates the intracellular synthesis of genetic material via glutaminolysis in rapidly proliferating and dividing cells ( Yang et al., 2017 + Geltink et al., 2018 + Liu et al., 2023 Geltink et al., 2018 + Yang et al., 2021 + + Klysz et al., 2015 + + Early research found that SIRT6 is widely expressed in various cells and is mainly localized in the nucleus ( Pillai and Gupta, 2020 Hou et al., 2022 Wei WQ. et al., 2021 + + Materials and methods Isolation, culture, and detection of ERCs All human ERCs used in this study were isolated from menstrual blood provided by healthy female volunteers aged 20–30 years, and the procedure was approved by Tianjin Medical University General Hospital (IRB2024-YX-013-01, Tianjin, China). First, menstrual blood is filtered to remove blood clots, and the bottom red precipitate is obtained by centrifugation. Then, these red precipitates were resuspended by PBS, slowly added to the same volume of human peripheral blood lymphocyte separation solution, and ERCs were obtained by density gradient centrifugation. Finally, the extracted ERCs were cultured in Dulbecco’s modified Eagle’s medium/Ham’s F12 (DMEM/F12) nutrient medium supplemented with 10% fetal bovine serum (FBS) and 1% P/S solution in a 37 °C 5% CO 2 Three-lineage experiment In order to further identify the stem cell characteristics of ERCs, the three-line differentiation experiments were carried out. 1. Osteogenic differentiation: 0.1% gelatin was added into a 12-well plate, with 500 μL in each hole, so that it covered the whole bottom surface. Then the gelatin coated 12-well plate was placed in a 37 °C incubator for at least 30 min. After 30 min, the gelatin was discarded and used to inoculate cells after the Petri dish was dried. ERCs were inoculated into a 12-well plate coated with gelatin in the amount of 4 × 10 4 5 g g 4 Construction of ERCs with low expression of SIRT6 (SIRT6-KD-RECs) To knock down SIRT6 in ERCs and further obtain ERC-Exos with low expression of SIRT6 (SIRT6-KD-ERC-Exos), We bought shRNA-SIRT6 lentivirus containing green fluorescent protein (GFP) and puromycin resistance gene from Gene-Chem company (Shanghai, China). The sequence of shRNA-SIRT6 was as follows: 5′-CGAGGATGTCGGTGAATTATTCAAGAGATAATTCACCGACATCCTCG-3’. Specifically, the SIRT6-Knockdown virus consisted of Lv-hU6-MCS (shRNA-SIRT6 sequence insertion site) -CBh-gcGFP-IRES-puromycin. Similarly, the empty vector virus had the same architecture. Empty vector virus inserted an unintentional sequence (5′-TTCTCCGAACGTGTCACGT-3′) at MSC site, which would not affect the expression of SIRT6. Lentiviral transduction was carried out following the instructions from Gene-Chem, using an optimal multiplicity of infection (MOI = 20). ERCs at passage 2 were plated onto a 6-well plate with a density of 15,000/well, and lentiviral transduction was carried out when the confluence reached 50%–60%. The transduction time was 12–16 °h, and the transduction is terminated according to the cell condition. After transduction, the cells were washed by PBS and replaced with fresh medium without lentivirus. To select for successfully transduced cells, puromycin (2 μg/mL, Solarbio, China) was incorporated into the culture medium. At the same time, puromycin was added to the ERCs of un-transduced lentivirus with the same generation and density, and the screening was finished when it died completely. After the cell screening, the GFP positive cells were detected by fluorescence microscope to be more than 90%, and then Western blot was carried out to detect SIRT6 expression level in ERCs. After successfully constructing SIRT6-KD-ERCs, the supernatant was collected to isolate SIRT6-KD-ERC-Exos. Besides, SIRT6-NC-ERCs could be obtained by successfully transducing ERCs with empty vector virus. Similarly, the further obtained exosome was SIRT6-NC-ERC-Exos. Isolation and characterization of ERC-derived exosomes ERCs were cultured in 10-cm dishes, washed with phosphate buffered saline (PBS), and maintained in FBS-free medium (Transgen, Beijing, China) for 48 h upon reaching nearly 90%–95% confluence. Then, the exosomes were obtained by centrifugation (Beckman centrifuge, United States) under the following conditions: 3,000 g g g Animals Adult C57BL/6 and BALB/c mice (male, 6–8 ° weeks old, weighing 23–26 g) were obtained from the China Food and Drug Inspection Institute (Beijing, China). All animals used in this study were housed in a conventional experimental environment with sufficient space, water, food, and appropriate temperature at the Tianjin General Surgery Institute (Tianjin, China). All animal procedures followed the animal use protocol approved by the Animal Care and Use Committee of Tianjin Medical University (Tianjin, China), and all the experiments were performed in accordance with the guidelines of the Chinese Council on Animal Care. Allogeneic cardiac transplantation and experimental groups C57BL/6 mouse recipients were randomly assigned to three experimental groups (n = 5): untreated, ERC-Exo-treated, and SIRT6-KD-ERC-Exo-treated groups (exosomes were obtained through ERC transduction by shRNA-SIRT6 lentivirus). As described in our previous study ( Hu et al., 2021 Hu et al., 2021 Histology assessment After being formalin-fixed, dehydrated, and paraffin-embedded, the heart graft samples were sliced into sections with 5-μm thickness. The sections were stained with hematoxylin and eosin (H&E). All the finished products were used to evaluate the severity of rejection under a light microscope. The presence of myocyte necrosis, interstitial hemorrhage, lymphocyte infiltration, vasculitis, and intravascular thrombosis was detected and scored in accordance with previously described criteria ( Wang et al., 2003 Immunohistochemistry assessment As described above, 5-μm heart tissue slices were obtained from the paraffin-embedded grafts. After programmed dewaxing, the slices were first incubated with ethylene diamine tetra-acetic acid (EDTA) antigen repair solution (Solarbio, Beijing, China), and antigen repair was conducted for 15 min at 100 °C in a microwave oven. They were then cultured with 3% hydrogen peroxide to eliminate endogenous peroxides. After being blocked with 10% goat serum, the sections were incubated with rabbit anti-mouse CD4 (dilution at 1:1,000, Abcam), IFN-γ (dilution at 1:100, ABclonal), IL-17A (dilution at 1:100, ABclonal), and Foxp3 (dilution at 1:100, affinity) antibody overnight at 4 °C and then with 100 μL of enhanced enzyme-labeled goat anti-rabbit IgG polymer (DAB kit, ZSGB-BIO, Beijing, China) for 20 min the next day at room temperature. Finally, the slices were stained with hematoxylin for 1 min and then observed under an optical microscope to evaluate the severity of CD4 + Enzyme-linked immunosorbent assay The serum levels of interferon gamma (IFN-γ), IL-17, and IL-10 in the recipient mice were measured using their corresponding ELISA kits (DAKEWE, Shenzhen, China) in accordance with the manufacturer’s instructions. In this experiment, 100 μL serum samples were required for each test well, and three representative cytokines were tested in this experiment. CD4 + Glutamine uptake analysis The extracted mouse naïve CD4 + 6 + + + α-ketoglutaric acid (α-KG) content detection Naïve CD4 + + Flow cytometry analysis Flow cytometry was performed to identify the phenotype of the ERCs and detect the immune cell population in the spleens of the recipient mice. The collected cells were divided into 100 μL single cell suspensions and then stained with fluorescent-labeled antibodies, including Zombie Dye, anti-CD14-FITC, anti-CD90-PE, anti-CD-79a-PE, anti-HLA-DR-FITC, anti-CD73-FITC, anti-CD44-APC, anti-CD4-FITC, anti-CD25-PE, anti-IL-17A-Percp-cy5.5, anti-FOXP3-APC, and anti-IFN-γ-PE, which were purchased from eBioscience (Thermofisher, United States) and BioLegend (Biolegend, United States). Finally, the percentage of different cells was analyzed using FlowJ software. The columnar statistical chart was made by Graphpad V8.0 software. Immunofluorescence staining ERCs with a good growth state at passage 5 were adopted. The day before, the suspended ERCs were inoculated in a 12-well plate containing round coverslips, with a density of about 5 × 10 4 Exosome phagocytosis detection The uptake of exosomes by naïve CD4 + g + Co-culture of ERC-Exos and C57BL/6 mouse naïve CD4 + in vitro Naïve CD4 + + in vitro + + + 5 + Naïve CD4 + To explore whether SIRT6-expressing ERC-Exos affect naïve CD4 + in vitro + Western blot CD4 + in vitro Statistical analysis Experimental data are presented as mean ± SD. Differences between multiple groups were calculated using one-way analysis of variance (ANOVA). The survival curve of the heart graft was constructed using the Kaplan–Meier cumulative survival method, and differences among groups were analyzed using the log-rank (Mantel–Cox) test. In the data charts, one asterisk represents p p p p Results Characterization of ERCs The ERCs’ morphology at passages 3–5 was used to assess their purity after being extracted from the volunteers’ menstrual blood. Results showed that the ERCs were spindle shaped, fibroblast-like, and colony-forming ( Figure 1A Figure 1B Figure 1C Figure 1D FIGURE 1 Identification of ERC features. (A) (B) (C) (D) Panel A shows three microscopic images of cells labeled P3, P4, and P5 with a scale bar of 250 micrometers. Panel B displays six flow cytometry histograms for markers CD44, CD73, CD90, CD14, CD79a, and HLA-DR, indicating cell surface marker expression. Panel C includes three stained cell images; one with blue nuclei and two showing red staining indicating specific protein expression, with a scale bar of 100 micrometers. Panel D presents three images of differentiated cells stained in red and blue, and a third in a different staining pattern, each with a scale bar of 50 micrometers. Construction of ERC-Exos with low expression of SIRT6 In order to determine whether ERC-Exos can express SIRT6, we first identified the subcellular localization of SIRT6 in ERCs. The results showed that, consistent with previous reports, SIRT6 could be expressed in the nucleus and cytoplasm of ERCs ( Supplementary Figure S1 Figure 2A Figure 2B Figure 2C Figure 2D Figure 2E Figure 2F Figures 2E,F Figure 2G FIGURE 2 Isolation and identification of ERC-Exos and SIRT6-KD-ERC-Exos. (A) (B) (C) (D) (E) (F) (G) Figure includes several panels of scientific data. Panel A shows Western blots for SIRT6, β-Tubulin, and CD9 proteins in ERCs and ERC-Exos. Panel B contains bright field and GFP images comparing ERCs and SIRT6-KD-ERCs, with a scale bar of 250 micrometers. Panel C displays Western blots for SIRT6 and β-Tubulin in ERCs and SIRT6-KD-ERCs. Panel D shows Western blots for SIRT6 and CD9 in ERC-Exos and SIRT6-KD-ERC-Exos. Panel E features TEM images of ERC-Exos and SIRT6-KD-ERC-Exos, with a scale bar of 200 nanometers. Panel F is a graph plotting exosome concentration against particle size, comparing ERC-Exos and SIRT6-KD-ERC-Exos. Panel G presents Western blots for Calnexin, CD9, TSG101, and CD63 in ERCs, ERC-Exos, and SIRT6-KD-ERC-Exos. Then, at the beginning of subsequent experiments, we set up three groups (ERC-Exos, SIRT6-NC-ERC-Exos, and SIRT6-KD-ERC-Exos) to identify exosomes and compare their functions. Results, as shown in the Supplementary Figure S2A + in vitro + Supplementary Figure S2B SIRT6 mediated ERC-Exos to alleviate AR in transplant recipients To determine whether SIRT6 mediates the therapeutic effect of ERC-Exos on AR, C57BL/6 recipient mice were transplanted with heart grafts from BALB/c donor mice and divided into three groups, namely, untreated, ERC-Exo-treated, and SIRT6-KD-ERC-Exo-treated group. As shown in Figure 3A Figure 3B p p Figure 3C Stewart et al., 2005 Figure 3D + Figures 3E,F FIGURE 3 SIRT6 mediated ERC-Exos to prolong graft survival and alleviate acute allograft rejection. (A) in vivo (B) (C) (D) (E) + + (F) + p p p (A) Diagram showing experimental setup for injecting ERC-Exos or SIRT6-KD-ERC-Exos into C57BL/6 mice over eight days. (B) Kaplan-Meier survival curves comparing graft survival among untreated, ERC-Exos, and SIRT6-KD-ERC-Exos treated groups. (C) Histological analysis with H&E staining of graft tissue in untreated, ERC-Exos, and SIRT6-KD-ERC-Exos groups, showing areas of rejection. (D) Bar graph illustrating grading of graft rejection, with significant differences indicated by asterisks. (E) Immunohistochemistry images showing CD4+ cell infiltration in each treatment group. (F) Bar graph quantifying local CD4 positive area, with significant differences highlighted. In order to further verify whether the therapeutic effect of ERC-Exos is related to its regulation of CD4 + + + Figures 4A,B,D,E Figures 4A,B,D,E Figures 4C,F + FIGURE 4 SIRT6 mediated ERC-Exos to regulate CD4 + + (A) (B) (C) (D) (E) (F) Panels A, B, and C display histological images showing tissue sections treated with three different conditions: Untreated, ERC-Exos, and SIRT6-KD-ERC-Exos. Staining indicates protein presence, marked by arrows. Panels D, E, and F present bar graphs representing percentages of positive areas for IFN-γ, IL-17A, and Foxp3, respectively, across the same conditions. Statistically significant differences are marked with asterisks. Scale bars are 50 micrometers. SIRT6 mediated ERC-Exos to remodel the proportion of different CD4 + The above results showed that the SIRT6-expressing ERC-Exos affected the CD4 + + Figures 5A–D p Figures 5E,F p Figures 5E,F p p p p p p Figure 5G p p p Figure 5G + FIGURE 5 SIRT6 mediated ERC-Exos to remodel CD4 + + + + + (A,C) (B,D) + + + (E) (F) (G) + p p p Flow cytometry plots and bar graphs. Panels A, C, and E show flow cytometry data for untreated, ERC-Exos, and SIRT6-KD-ERC-Exos groups with stained CD4+, IFN-γ+, IL-17A+, and Foxp3+ cells. Panels B, D, and F show corresponding bar graphs comparing percentages of T cell subpopulations. Panel G displays bar graphs of serum IFN-γ, IL-17, and IL-10 levels across groups, with statistical significance indicated by asterisks. SIRT6 mediated ERC-Exos to modulate naïve CD4 + in vitro To further explore the role of SIRT6 in mediating ERC-Exo-induced naïve CD4 + in vitro + + Supplementary Figure S3 + + lo hi + Supplementary Figure S3 + hi lo + in vivo in vitro + in vitro p p p Figures 6A–F Figure 6G in vivo + in vitro FIGURE 6 SIRT6 mediated ERC-Exos to modulate CD4 + in vitro + + + + + (A,C) (B,D) + + (E) (F) (G) + p p p Flow cytometry and bar graphs analyze T-cell subsets. Panels A, C, and E display dot plots for IFN-γ⁺, IL-17A⁺, and Foxp3⁺ T-cells with percentages. Panels B, D, and F present bar graphs comparing these cell percentages among three groups: T-cell alone, ERC-Exos + T-cell, and SIRT6-KD-ERC-Exos + T-cell, indicating statistical significance. Panel G shows bar graphs for supernatant cytokine levels (IFN-γ, IL-17, and IL-10) across the same groups, also highlighting statistical differences. Data suggests different effects of treatments on T-cell activation. Subsequently, we further detected the level of cell death and proliferation during CD4 + in vitro Supplementary Figure S4A,B in vitro Supplementary Figure S4C SIRT6 mediated ERC-Exos to inhibit naïve CD4 + To further explore the mechanisms by which SIRT6 mediates ERC-Exos to modulate CD4 + + Figure 7A + + Figures 7B,C + Figures 7B,C FIGURE 7 SIRT6 mediated ERC-Exos to inhibit naïve CD4 + + (A) + + + + (B) (C) (D) (E) + (F) + (G) + (H) + + + (I) (J) (K) p p p A composite image with multiple panels showing experimental data. Panel A displays stained cellular images of PBS, ERC-Exos, and SIRT6-KD-ERC-Exos treatments. Panel B shows a Western blot for SIRT6 expression with β-Tubulin as a loading control. Panel C presents a bar graph of relative SIRT6 protein levels. Panel D features Western blots for c-Myc, ASCT2, and GLS1 proteins. Panel E has bar graphs for protein expression levels. Panel F shows a graph for glutamine content, and Panel G for α-KG content. Panel H includes Western blots for p-S6K1 and S6K1. Panel I is a bar graph of p-S6K1 protein levels. Panel J displays flow cytometry plots for CD4+CD25+ T-cells, and Panel K is a bar graph showing percentages of activated T-cells. SIRT6 has been shown in earlier research to be able to block c-Myc transcription and translation in a variety of cell types. The transcription factor c-Myc is essential for T cell proliferation and differentiation. According to prior proteomic researches, c-Myc regulates the expression of important proteinases and amino acid transporters in immunocompetent T cells, with ASCT2 and GLS1 displaying the most notable alterations ( Wang et al., 2011 Marchingo et al., 2020 + + Supplementary Figure S5 + Supplementary Figure S5 Figures 7D,E Figures 7D,E Supplementary Figure S6A,B + Figure 7F Figure 7F Figure 7F + + Figure 7G + Figure 7G + Supplementary Figure S6C,D + Figures 7H,I Figures 7H,I Supplementary Figure S6E,F In order to further clarify that this effect is mediated by SIRT6, we used SIRT6 activator and SIRT6 inhibitor in Jurkat cell to explore the activated state of c-Myc/glutaminolysis/mTORC1 status respectively. The results showed that the level of c-Myc-dependent glutaminolysis increased after the activation of CD3/CD28 in Jurkat cell, which led to the activation of mTORC1 ( Supplementary Figure S7 Supplementary Figure S7 Supplementary Figure S7 We measured the activation level of naïve CD4 + + p Figures 7J,K Supplementary Figure S8 + p Figures 7J,K Supplementary Figure S8 + Discussion Immunosuppressive medications are currently the primary strategy for managing AR following transplantation. As previously mentioned, it is impossible to overlook these medications’ limits with regard to infection, carcinogenesis, and chronic graft failure ( Söderlund and Rådegran, 2015 Sun et al., 2018 Wei YC. et al., 2021 Hu et al., 2021 Xu et al., 2024 Izawa et al., 2025 Lu et al., 2024 Fathi-Kazerooni and Tavoosidana, 2019 In this study, we first found that SIRT6 expressed in ERC-Exos. We then used the shRNA-SIRT6 lentiviral to successfully obtain SIRT6-KD-ERC-Exos, a type of ERC-Exo with extremely low SIRT6 expression. Though using these two different exosomes to treat intra-abdominal heterotopic cardiac transplantation mice, we found that ERC-Exo treatment alleviated AR in these model mice. Specifically, ERC-Exo treatment prolonged graft survival, reduced the infiltration of inflammatory cell as well as cytokines in the graft, remodeled CD4 + + + + Marchingo et al., 2020 Figure 8 FIGURE 8 Schematic diagram of the therapeutic effects mediated by SIRT6-expressing ERC-Exos on AR. As previously described, ERC-Exos are obtained from the supernatant of ERCs by ultracentrifugation. Then, BALB/c hearts are transplanted into the abdomen of C57BL/6 recipients to construct a heterotopic cardiac transplantation model. And ERC-Exo treatment can alleviate AR in recipient mice by tail vein injection. In terms of mechanism, after the ERC-Exos are injected into recipient mice, they reach all parts of the body with blood circulation, including lesion sites or peripheral lymphoid organs, such as the spleen, and then can be phagocytized by peripheral naïve CD4 + + + Diagram illustrating a process involving exosomes and CD4+ T-cell differentiation. Exosomes and proteins are extracted using centrifugation and injected intravenously into a C57BL/6 mouse with a heterotopic cardiac transplant model. The process influences naïve CD4+ T-cell differentiation via pathways involving SIRT6, c-Myc, mTORC1, and glutaminolysis, ultimately affecting IFN-γ, IL-17A, and Foxp3 expression. This mechanism is aimed at alleviating transplantation rejection. Exosomes are 30–200 nm membrane extracellular vesicles composed of various proteins, enzymes, transcription factors, lipids, extracellular matrix proteins, receptors, and nucleic acids ( Kalluri and LeBleu, 2020 Marinaro et al., 2019 Xu et al., 2024 + Xu et al., 2024 With the discovery of transcription factors in exosomes ( Kalluri and LeBleu, 2020 Qiu et al., 2018 Warren and MacIver, 2019 Warren and MacIver, 2019 Warren and MacIver, 2019 Aksungur et al., 2025 Pillai and Gupta, 2020 Wang et al., 2019 et al. Chamberlain et al., 2021 et al. Wei WQ. et al., 2021 et al. Hou et al., 2022 Previous studies have reported that T cells can change their differentiation fate or function by phagocytosing exosomes secreted by other cells ( Wang et al., 2018 Bolandi et al., 2020 + Wei WQ. et al., 2021 Li et al., 2022 Pillai and Gupta, 2020 et al. Oraby et al., 2024 Stewart et al., 2005 Tao et al., 2013 + ASCT2 is an important amino acid transporter for glutamine uptake into the cytoplasm, and GLS1 is the first rate-limiting enzyme for glutaminolysis after entering the cytoplasm ( Liu et al., 2023 + Yu et al., 2022 Nakaya et al., 2014 et al. + Yu et al., 2022 + Nakaya et al., 2014 Delgoffe et al., 2009 et al. + + Nakaya et al., 2014 Nakaya et al., 2014 mTORC1, a center for sensing and integrating various signals from the environment to control metabolism, plays an indispensable role in integrating the metabolic spectrum and guiding the differentiation of naïve CD4 + Huang et al., 2020 + Delgoffe et al., 2011 Chornoguz et al., 2017 + Wang et al., 2020 Wang et al., 2020 + Dang et al., 2011 Kurebayashi et al., 2012 Kurebayashi et al., 2012 Dang et al., 2011 Shi et al., 2011 + Amino acids, especially glutamine, leucine, arginine, and methionine, play an important role in the activation of the mTORC1 signaling pathway ( Jewell et al., 2015 Meng et al., 2020 Gu et al., 2017 Nakaya et al., 2014 et al. + Nakaya et al., 2014 + + Nakaya et al., 2014 Huang et al., 2020 Cabré et al., 2021 Durán et al., 2013 Cabré et al., 2021 González et al., 2020 + + Previously, studies have revealed that CD4 + Wa et al., 2011 Wa et al., 2011 + Hall, 2015 Hall, 2015 Hall et al., 1984 + Afzali et al., 2007 Laan et al., 2001 Miyamoto et al., 2003 et al. Li et al., 2006 Afzali et al., 2007 Edemir et al., 2008 Edemir et al., 2008 Chen et al., 2007 + In conclusion, we confirmed the therapeutic effects of targeting T cell glutaminolysis in allogeneic transplantation using ERC-Exo therapy. By inhibiting the c-Myc-dependent glutaminolysis of naïve CD4 + Conclusion The present study affirmed the therapeutic effect of ERC-Exos in alleviating AR. Moreover, we emphasized the crucial role of SIRT6 in ERC-Exo-mediated immune tolerance formation via remodeling inordinate CD4 + Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Ethics statement The animal study was approved by the Animal Care and Use Committee of Tianjin Medical University. The study was conducted in accordance with the local legislation and institutional requirements. Author contributions TL: Conceptualization, Data curation, Software, Validation, Visualization, Writing – original draft, Writing – review and editing. CS: Conceptualization, Data curation, Formal Analysis, Investigation, Methodology, Project administration, Supervision, Visualization, Writing – review and editing. XL: Data curation, Investigation, Methodology, Project administration, Software, Supervision, Validation, Visualization, Writing – review and editing. PZ: Conceptualization, Data curation, Investigation, Methodology, Software, Supervision, Writing – review and editing. BS: Conceptualization, Data curation, Investigation, Methodology, Software, Supervision, Writing – review and editing. YnX: Data curation, Formal Analysis, Methodology, Project administration, Software, Supervision, Writing – review and editing. YyX: Formal Analysis, Methodology, Project administration, Software, Supervision, Writing – review and editing. HoW: Conceptualization, Data curation, Investigation, Methodology, Software, Supervision, Writing – review and editing. QC: Conceptualization, Investigation, Methodology, Project administration, Supervision, Writing – review and editing. GY: Formal Analysis, Methodology, Project administration, Supervision, Validation, Writing – review and editing. HaW: Conceptualization, Funding acquisition, Methodology, Project administration, Resources, Supervision, Writing – review and editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fcell.2025.1564382/full#supplementary-material References Afzali B. Lombardi G. Lechler R. I. Lord G. M. 2007 The role of T helper 17 (Th17) and regulatory T cells (Treg) in human organ transplantation and autoimmune disease Clin. Exp. Immunol. 148 1 32 46 10.1111/j.1365-2249.2007.03356.x 17328715 PMC1868863 Aksungur N. Kizilkaya M. Altundaş N. Balkan E. Kara S. Demirci E. 2025 Molecular crosstalk between Sirt1, Wnt/Β-Catenin signaling, and inflammatory pathways in renal transplant rejection: role of mirnas, lncrnas, Il-1, Il-6, and tubulointerstitial inflammation Med. Kaunas. 61 6 1073 10.3390/medicina61061073 40572763 PMC12195052 Bolandi Z. Mokhberian N. Eftekhary M. Sharifi K. Soudi S. Ghanbarian H. 2020 Adipose derived mesenchymal stem cell exosomes loaded with Mir-10a promote the differentiation of Th17 and treg from naive Cd4+ T cell Life Sci. 259 10.1016/j.lfs.2020.118218 32784057 Cabré N. Luciano-Mateo F. Chapski D. J. Baiges-Gaya G. Fernández-Arroyo S. Hernández-Aguilera A. 2021 Glutaminolysis-induced Mtorc1 activation drives non-alcoholic steatohepatitis progression J. hepatology 10.1016/j.jhep.2021.04.037 33961941 Chamberlain K. A. Huang N. Xie Y. X. LiCausi F. Li S. N. Li Y. 2021 Oligodendrocytes enhance axonal energy metabolism by deacetylation of mitochondrial proteins through transcellular delivery of Sirt2 Neuron 109 21 3456 3472.e8 10.1016/j.neuron.2021.08.011 34506725 PMC8571020 Chen B. Kapturczak M. H. Joseph R. George J. F. Campbell-Thompson M. Wasserfall C. H. 2007 Adeno-associated viral vector-mediated Interleukin-10 prolongs allograft survival in a rat kidney transplantation model Am. J. Transplant. 7 5 1112 1120 10.1111/j.1600-6143.2007.01772.x 17456199 Chornoguz O. Hagan R. S. Haile A. Arwood M. L. Gamper C. J. Banerjee A. 2017 Mtorc1 promotes T-Bet phosphorylation to regulate Th1 differentiation J. Immunol. 198 10 3939 3948 10.4049/jimmunol.1601078 28424242 PMC5458608 Dang E. V. Barbi J. Yang H. Y. Jinasena D. Yu H. Zheng Y. 2011 Control of T H Reg Cell 146 5 772 784 10.1016/j.cell.2011.07.033 21871655 PMC3387678 Darzi S. Werkmeister J. A. Deane J. A. Gargett C. E. 2016 Identification and characterization of human endometrial mesenchymal stem/stromal cells and their potential for cellular therapy Stem Cells Transl. Med. 5 9 1127 1132 10.5966/sctm.2015-0190 27245365 PMC4996433 Delgoffe G. M. Pollizzi K. N. Waickman A. T. Heikamp E. Meyers D. J. Horton M. R. 2011 The kinase mtor regulates the differentiation of helper T cells through the selective activation of signaling by Mtorc1 and Mtorc2 Nat. Immunol. 12 4 295 303 10.1038/ni.2005 21358638 PMC3077821 Delgoffe G. M. Kole T. P. Zheng Y. Zarek P. E. Matthews K. L. Xiao B. 2009 The mtor kinase differentially regulates effector and regulatory T cell lineage commitment Immunity 30 6 832 844 10.1016/j.immuni.2009.04.014 19538929 PMC2768135 Durán R. V. MacKenzie E. D. Boulahbel H. Frezza C. Heiserich L. Tardito S. 2013 Hif-independent role of prolyl hydroxylases in the cellular response to amino acids Oncogene 32 38 4549 4556 10.1038/onc.2012.465 23085753 PMC3787797 Edemir B. Kurian S. M. Eisenacher M. Lang D. Müller-Tidow C. Gabriels G. 2008 Activation of counter-regulatory mechanisms in a rat renal acute rejection model Bmc Genomics 9 10.1186/1471-2164-9-71 18261221 PMC2262896 Fathi-Kazerooni M. Tavoosidana G. 2019 Menstrual blood stem cell transplantation in mice model of acute liver failure: does gender of recipient affect the outcome? Avicenna J. Med. Biotechnol. 11 4 308 316 31908739 PMC6925399 Geltink R. I. K. Kyle R. L. Pearce E. L. 2018 Unraveling the complex interplay between T cell metabolism and function Annu. Rev. Immunol. 36 461 488 10.1146/annurev-immunol-042617-053019 29677474 PMC6323527 González A. Hall M. N. Lin S. C. Hardie D. G. 2020 Ampk and tor: the yin and yang of cellular nutrient sensing and growth control Cell Metab. 31 3 472 492 10.1016/j.cmet.2020.01.015 32130880 Gu X. Orozco J. M. Saxton R. A. Condon K. J. Liu G. Y. Krawczyk P. A. 2017 Samtor is an S Science 358 6364 813 818 10.1126/science.aao3265 29123071 PMC5747364 Guo Z. Y. Li P. Ge J. B. Li H. 2022 Sirt6 in aging, metabolism, inflammation and cardiovascular diseases Aging Dis. 13 1787 1822 10.14336/AD.2022.0413 36465178 PMC9662279 Hall B. M. 2015 T cells: soldiers and spies-the surveillance and control of effector T cells by regulatory T cells Clin. J. Am. Soc. Nephrol. 10 11 2050 2064 10.2215/CJN.06620714 25876770 PMC4633791 Hall B. M. Bishop G. A. Duggin G. G. Horvath J. S. Philips J. Tiller D. J. 1984 Increased expression of Hla-Dr antigens on renal tubular cells in renal transplants: relevance to the rejection response Lancet 2 8397 247 251 10.1016/s0140-6736(84)90297-6 6146807 Hou T. Y. Tian Y. Cao Z. Y. Zhang J. Feng T. T. Tao W. H. 2022 Cytoplasmic Sirt6-Mediated Acsl5 deacetylation impedes nonalcoholic fatty liver disease by facilitating hepatic fatty acid oxidation Mol. Cell 82 21 4099 4115.e9 10.1016/j.molcel.2022.09.018 36208627 Hu Y. H. Kong D. J. Qin Y. F. Yu D. D. Jin W. Li X. 2021 Cd73 expression is critical to therapeutic effects of human endometrial regenerative cells in inhibition of cardiac allograft rejection in mice Stem Cells Transl. Med. 10 3 465 478 10.1002/sctm.20-0154 33124777 PMC7900594 Huang H. L. Long L. Y. Zhou P. P. Chapman N. M. Chi H. B. 2020 Mtor signaling at the crossroads of environmental signals and T-Cell fate decisions Immunol. Rev. 295 1 15 38 10.1111/imr.12845 32212344 PMC8101438 Izawa H. Xiang C. Ogawa S. Hisanaga I. Yoshimoto T. 2025 Amelioration of female menopausal syndrome by intravenous administration of autologous menstrual blood-derived stem cells Regen. Ther. 29 192 201 10.1016/j.reth.2025.03.009 40225052 PMC11992397 Jewell J. L. Kim Y. C. Russell R. C. Yu F. X. Park H. W. Plouffe S. W. 2015 Metabolism. Differential regulation of mTORC1 by leucine and glutamine Science 347 6218 194 198 10.1126/science.1259472 25567907 PMC4384888 Kalluri R. LeBleu V. S. 2020 The biology, function, and biomedical applications of exosomes Science 367 6478 eaau6977 10.1126/science.aau6977 32029601 PMC7717626 Kittleson M. M. Kobashigawa J. A. 2017 Cardiac transplantation current outcomes and contemporary controversies Jacc-Heart Fail. 5 12 857 868 10.1016/j.jchf.2017.08.021 29191293 Klabukov I. Yatsenko E. Baranovskii D. 2023 The effects of mesenchymal stromal cells and platelet-rich plasma treatments on cutaneous wound healing: ignoring the possibility of adverse events and side effects could compromise study results Archives Dermatological Res. 316 1 35 10.1007/s00403-023-02783-3 38085349 Klysz D. Tai X. G. Robert P. A. Craveiro M. Cretenet G. Oburoglu L. 2015 Glutamine-dependent Α-Ketoglutarate production regulates the balance between T helper 1 cell and regulatory T cell generation Sci. Signal. 8 396 ra97 10.1126/scisignal.aab2610 26420908 Kurebayashi Y. Nagai S. Ikejiri A. Ohtani M. Ichiyama K. Baba Y. 2012 Pi3k-Akt-Mtorc1-S6k1/2 axis controls Th17 differentiation by regulating Gfi1 expression and nuclear translocation of Rorγ Cell Rep. 1 4 360 373 10.1016/j.celrep.2012.02.007 22832227 Laan M. Lötvall J. Chung K. F. Lindén A. 2001 Il-17-Induced cytokine release in human bronchial epithelial cells in vitro:: Br. J. Pharmacol. 133 1 200 206 10.1038/sj.bjp.0704063 11325811 PMC1572774 Lee Y. Ka S. O. Cha H. N. Chae Y. N. Kim M. K. Park S. Y. 2017 Myeloid sirtuin 6 deficiency causes insulin resistance in high-fat diet-fed mice by eliciting macrophage polarization toward an M1 phenotype Diabetes 66 10 2659 2668 10.2337/db16-1446 28607107 Li J. Simeoni E. Fleury S. Dudler J. Fiorini E. Kappenberger L. 2006 Gene transfer of soluble Interleukin-17 receptor prolongs cardiac allograft survival in a rat model Eur. J. Cardio-Thoracic Surg. 29 5 779 783 10.1016/j.ejcts.2006.01.052 16520057 Li X. Lan X. Zhao Y. M. Wang G. Shi G. G. Li H. Y. 2019 Sdf-1/Cxcr4 axis enhances the immunomodulation of human endometrial regenerative cells in alleviating experimental colitis Stem Cell Res. and Ther. 10 10.1186/s13287-019-1298-6 31286993 PMC6615145 Li Y. J. Jin J. Wang Y. 2022 Sirt6 widely regulates aging, immunity, and cancer Front. Oncol. 12 10.3389/fonc.2022.861334 35463332 PMC9019339 Liu T. Ren S. H. Sun C. L. Zhao P. Y. Wang H. 2023 Glutaminolysis and peripheral Cd4+ T cell differentiation: from mechanism to intervention strategy Front. Immunol. 14 10.3389/fimmu.2023.1221530 37545506 PMC10401425 Lu Y. Liu R. Kang X. Zhang S. Sun Y. Fan W. 2024 Menstrual blood-derived endometrial stem cell transplantation improves Male reproductive dysfunction in T1d mice by enhancing antioxidative capacity Reprod. Sci. 31 6 1719 1731 10.1007/s43032-024-01498-8 38396297 Marchingo J. M. Sinclair L. V. Howden A. J. M. Cantrell D. A. 2020 Quantitative analysis of how myc controls T cell proteomes and metabolic pathways during T cell activation Elife 9 e53725 10.7554/eLife.53725 32022686 PMC7056270 Marinaro F. Gómez-Serrano M. Jorge I. Silla-Castro J. C. Vázquez J. Sánchez-Margallo F. M. 2019 Unraveling the molecular signature of extracellular vesicles from endometrial-derived mesenchymal stem cells: potential modulatory effects and therapeutic applications Front. Bioeng. Biotechnol. 7 431 10.3389/fbioe.2019.00431 31921832 PMC6932983 Meng D. L. Yang Q. M. Wang H. Y. Melick C. H. Navlani R. Frank A. R. 2020 Glutamine and asparagine activate Mtorc1 independently of rag gtpases J. Biol. Chem. 295 10 2890 2899 10.1074/jbc.AC119.011578 32019866 PMC7062167 Miyamoto M. Prause O. Sjöstrand M. Laan M. Lötvall J. Lindén A. 2003 Endogenous Il-17 as a mediator of neutrophil recruitment caused by endotoxin exposure in mouse airways J. Immunol. 170 9 4665 4672 10.4049/jimmunol.170.9.4665 12707345 Nakaya M. Xiao Y. C. Zhou X. F. Chang J. H. Chang M. Cheng X. H. 2014 Inflammatory T cell responses rely on amino acid transporter Asct2 facilitation of glutamine uptake and Mtorc1 kinase activation Immunity 40 5 692 705 10.1016/j.immuni.2014.04.007 24792914 PMC4074507 Oraby M. A. Mageed S. S. A. Raouf A. A. Abdelshafy D. A. Ahmed E. F. Khalil R. T. 2024 Remdesivir ameliorates ulcerative colitis-propelled cell inflammation and pyroptosis in acetic acid rats by restoring Sirt6/Foxc1 pathway Int. Immunopharmacol. 137 112465 10.1016/j.intimp.2024.112465 38878489 Pillai V. B. Gupta M. P. 2020 Is nuclear sirtuin Sirt6 a master regulator of immune function? Am. J. Physiology-Endocrinology Metabolism 320 3 E399 E414 10.1152/ajpendo.00483.2020 33308014 PMC7988780 Qiu J. J. Lin X. J. Tang X. Y. Zheng T. T. Lin Y. Y. Hua K. Q. 2018 Exosomal metastasis-associated lung adenocarcinoma transcript 1 promotes angiogenesis and predicts poor prognosis in epithelial ovarian cancer Int. J. Biol. Sci. 14 14 1960 1973 10.7150/ijbs.28048 30585260 PMC6299373 Quaranta P. Focosi D. Freer G. Pistello M. 2016 Tweaking mesenchymal stem/progenitor cell immunomodulatory properties with viral vectors delivering cytokines Stem Cells Dev. 25 18 1321 1341 10.1089/scd.2016.0145 27476883 Schmitz M. L. Bacher S. Dienz O. 2003 NF-kappaB activation pathways induced by T cell costimulation Faseb J. 17 15 2187 2193 10.1096/fj.02-1100rev 14656980 Sebastián C. Zwaans B. M. M. Silberman D. M. Gymrek M. Goren A. Zhong L. 2012 The histone deacetylase Sirt6 is a tumor suppressor that controls cancer metabolism Cell 151 6 1185 1199 10.1016/j.cell.2012.10.047 23217706 PMC3526953 Shah P. Yuzefpolskaya M. Hickey G. W. Breathett K. Wever-Pinzon O. Ton V. K. 2022 Twelfth interagency registry for mechanically assisted circulatory support report: readmissions after left ventricular assist device Ann. Thorac. Surg. 113 3 722 737 10.1016/j.athoracsur.2021.12.011 35007505 PMC8854346 Shi L. Z. Wang R. N. Huang G. H. Vogel P. Neale G. Green D. R. 2011 HIF1alpha-dependent glycolytic pathway orchestrates a metabolic checkpoint for the differentiation of TH17 and treg cells J. Exp. Med. 208 7 1367 1376 10.1084/jem.20110278 21708926 PMC3135370 Söderlund C. Rådegran G. 2015 Immunosuppressive therapies after heart transplantation - the balance between under- and over-immunosuppression Transplant. Rev. 29 3 181 189 10.1016/j.trre.2015.02.005 25812489 Stewart S. Winters G. L. Fishbein M. C. Tazelaar H. D. Kobashigawa J. Abrams J. 2005 Revision of the 1990 working formulation for the standardization of nomenclature in the diagnosis of heart rejection J. Heart Lung Transplant. 24 11 1710 1720 10.1016/j.healun.2005.03.019 16297770 Stewart S. Fishbein M. C. Snell G. I. Berry G. J. Boehler A. Burke M. M. 2007 Revision of the 1996 working formulation for the standardization of nomenclature in the diagnosis of lung rejection J. Heart Lung Transplant. 26 12 1229 1242 10.1016/j.healun.2007.10.017 18096473 Sun Q. P. Huang Z. Y. Han F. Zhao M. Cao R. H. Zhao D. Q. 2018 Allogeneic mesenchymal stem cells as induction therapy are safe and feasible in renal allografts: pilot results of a multicenter randomized controlled trial J. Transl. Med. 16 52 10.1186/s12967-018-1422-x 29514693 PMC5842532 Tao R. Y. Xiong X. W. DePinho R. A. Deng C. X. Dong X. C. 2013 Foxo3 transcription factor and Sirt6 deacetylase regulate low density lipoprotein (Ldl)-Cholesterol homeostasis via Pcsk9 J. Biol. Chem. 288 41 29252 29259 10.1074/jbc.M113.481473 23974119 PMC3795227 Wang S. H. Li J. Xie A. N. Wang G. H. Xia N. Ye P. 2011 Dynamic changes in Th1, Th17, and Foxp3+T cells in patients with acute cellular rejection after cardiac transplantation Clin. Transplant. 25 2 E177 E186 10.1111/j.1399-0012.2010.01362.x 21114533 Wang H. Hosiawa K. A. Garcia B. Shum J. B. Dutartre P. Kelvin D. J. 2003 Attenuation of acute xenograft rejection by short-term treatment with Lf15-0195 and monoclonal antibody against Cd45rb in a rat-to-mouse cardiac Transplantation model Transplantation 75 9 1475 1481 10.1097/01.TP.0000057245.59998.95 12792500 Wang R. N. Dillon C. P. Shi L. Z. Milasta S. Carter R. Finkelstein D. 2011 The transcription factor myc controls metabolic reprogramming upon T lymphocyte activation Immunity 35 6 871 882 10.1016/j.immuni.2011.09.021 22195744 PMC3248798 Wang X. C. Shen H. Y. Zhangyuan G. Huang R. Y. Zhang W. J. He Q. F. 2018 14-3-3ζ delivered by hepatocellular carcinoma-derived exosomes impaired anti-tumor function of tumor-infiltrating T lymphocytes Cell Death and Dis. 9 159 10.1038/s41419-017-0180-7 29415983 PMC5833352 Wang H. X. Li S. T. Zhang G. Q. Wu H. Chang X. T. 2019 Potential therapeutic effects of Cyanidin 3 O Arthritis Res. and Ther. 21 1 220 10.1186/s13075-019-2001-0 31661005 PMC6819496 Wang P. Zhang Q. Tan L. Xu Y. N. Xie X. B. Zhao Y. 2020 The regulatory effects of mtor complexes in the differentiation and function of Cd4+ T cell subsets J. Immunol. Res. 2020 10.1155/2020/3406032 32377533 PMC7195637 Wang H. D. Zhao Y. M. Ren B. B. Qin Y. F. Li G. M. Kong D. J. 2021 Endometrial regenerative cells with Galectin-9 high-expression attenuate experimental autoimmune hepatitis Stem Cell Res. and Ther. 12 1 541 10.1186/s13287-021-02604-2 34654474 PMC8518235 Warren J. L. MacIver N. J. 2019 Regulation of adaptive immune cells by sirtuins Front. Endocrinol. (Lausanne) 10 466 10.3389/fendo.2019.00466 31354630 PMC6637536 Wei W. Q. Guo X. D. Gu L. J. Jia J. S. Yang M. Yuan W. J. 2021a Bone marrow mesenchymal stem cell exosomes suppress phosphate-induced aortic calcification via Stem Cell Res. and Ther. 12 1 235 10.1186/s13287-021-02307-8 33849640 PMC8042866 Wei Y. C. Chen X. Y. Zhang H. X. Su Q. Peng Y. W. Fu Q. 2021b Efficacy and safety of bone marrow-derived mesenchymal stem cells for chronic antibody-mediated rejection after kidney Transplantation-a single-arm, two-dosing-regimen, phase I/Ii study Front. Immunol. 12 10.3389/fimmu.2021.662441 34248942 PMC8267917 Xu Y. Ren S. Wang H. Qin Y. Liu T. Sun C. 2024 Endometrial regeneration cell-derived exosomes loaded with Sislamf6 inhibit cardiac allograft rejection through the suppression of desialylation modification Cell Mol. Biol. Lett. 29 1 128 10.1186/s11658-024-00645-y 39354345 PMC11443917 Yang L. F. Venneti S. Nagrath D. 2017 Glutaminolysis: a hallmark of cancer metabolism Annu. Rev. Biomed. Eng. 19 163 194 10.1146/annurev-bioeng-071516-044546 28301735 Yang G. Xia Y. Y. Ren W. K. 2021 Glutamine metabolism in Th17/Treg cell fate: applications in Th17 cell-associated diseases Sci. China-Life Sci. 64 2 221 233 10.1007/s11427-020-1703-2 32671630 Yu Q. Tu H. H. Yin X. Y. Peng C. Dou C. Y. Yang W. H. 2022 Targeting glutamine metabolism ameliorates autoimmune hepatitis via Front. Immunol. 13 880262 10.3389/fimmu.2022.880262 35663990 PMC9160195 ",
  "metadata": {
    "Title of this paper": "Targeting glutamine metabolism ameliorates autoimmune hepatitis ",
    "Journal it was published in:": "Frontiers in Cell and Developmental Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488686/"
  }
}