{
  "title": "Paper_852",
  "abstract": "pmc Bioeng Transl Med Bioeng Transl Med 3332 btm BTM2 Bioengineering & Translational Medicine 2380-6761 Wiley PMC12478443 PMC12478443.1 12478443 12478443 41030277 10.1002/btm2.70021 BTM270021 1 Research Article Research Article Engineered lung cell targeting and SLC7A11 siRNA Wan et al. Wan Xiao‐dan  1 Zhou Xue‐liang  2 Liu Jin‐long  3 Xu Hua https://orcid.org/0009-0006-3109-5622  4 ndyfy02167@ncu.edu.cn   1 Department of Electrocardiogram, The First Affiliated Hospital Nanchang University Nanchang Jiangxi China   2 Department of Cardiac Surgery, The First Affiliated Hospital Nanchang University Nanchang Jiangxi China   3 Institute of Translational Medicine Shanghai University Shanghai China   4 Department of Thoracic Surgery, The First Affiliated Hospital Nanchang University Nanchang Jiangxi China * Correspondence ndyfy02167@ncu.edu.cn 16 4 2025 9 2025 10 5 497785 10.1002/btm2.v10.5 e70021 29 3 2025 14 9 2024 01 4 2025 16 04 2025 30 09 2025 01 10 2025 © 2025 The Author(s). Bioengineering & Translational Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Non‐small cell lung cancer (NSCLC) presents significant therapeutic challenges, often characterized by aggressive proliferation and metastasis. This study investigates the role of SLC7A11, a ferroptosis‐related gene, in NSCLC progression and the potential of engineered bacterial extracellular vesicles (BEVs) expressing SLC7A11‐targeting siRNA as a therapeutic strategy. Using TCGA and GEO databases, we identified that SLC7A11 was significantly upregulated in NSCLC tissues. Functional assays demonstrated that SLC7A11 knockdown in NSCLC cell lines (NCI‐H2122 and NCI‐H647) via qPCR, Western blot, and immunofluorescence resulted in impaired proliferation, migration, and invasion abilities. In vivo xenograft models further revealed that SLC7A11 knockdown inhibited tumor growth and metastasis, corroborated by histological analyses. To enhance targeted delivery of SLC7A11 siRNA, we engineered BEVs with a lung cell targeting peptide, verifying their structure and function through transmission electron microscopy (TEM) and nanoparticle tracking analysis (NTA). In vivo toxicity assessments indicated safety for these bioengineered vesicles. Importantly, treatment with BEVs‐LCTP‐siSLC7A11 not only impaired tumorigenesis but also activated ferroptosis pathways, as evidenced by altered expression levels of SLC7A11 and transferrin in tumor and metastatic tissues. Our findings suggest that targeting SLC7A11 through engineered BEVs presents a promising approach to inhibit NSCLC progression while activating ferroptosis, offering insights into novel therapeutic strategies against lung cancer. engineered bacterial extracellular vesicles ferroptosis none‐small cell lung cancer SLC7A11 National Natural Science Foundation of China 10.13039/501100001809 82260054 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  Wan X Zhou X Liu J Xu H Engineered lung cell targeting and SLC7A11 siRNA Bioeng Transl Med 2025 10 5 e70021 10.1002/btm2.70021 Xiao‐dan Wan and Xue‐liang Zhou contribute equally to this study.  Translational Impact Statement This study demonstrates that targeting SLC7A11—a ferroptosis‐linked gene overexpressed in NSCLC—using lung‐targeted bacterial extracellular vesicles (BEVs) delivering shRNA inhibits tumor growth, metastasis, and activates ferroptosis. Engineered BEVs enable safe, precise delivery, combining gene silencing and iron‐dependent cell death to combat aggressive NSCLC, offering a novel therapeutic strategy with clinical potential. 1 INTRODUCTION Lung cancer remains one of the leading causes of cancer‐related mortality worldwide, with non‐small cell lung cancer (NSCLC) accounting for approximately 85% of all lung cancer cases.  1  2  3  4  5  6  7  8  9 Ferroptosis is a form of regulated cell death distinct from apoptosis, necrosis, and autophagy, characterized by iron‐dependent lipid peroxidation leading to cellular damage.  10  11  12  13  14  15  16  17  18  19  20  21 SLC7A11 is part of the solute carrier family of transporters and is primarily responsible for the uptake of cysteine into cells.  22  23  24  25  26  27 Bacterial extracellular vesicles (BEVs) have emerged as versatile nanocarriers for RNA‐based therapeutics due to their natural ability to encapsulate and deliver biologically active molecules.  28  29  30  31  32  33 This research aims to elucidate the role of SLC7A11 in NSCLC biology and explore the potential of engineered BEVs as a novel strategy for targeted therapy. By focusing on inducing ferroptosis through the downregulation of SLC7A11, we aim to overcome traditional treatment resistance mechanisms prevalent in NSCLC. Ultimately, this study could pave the way for innovative therapeutic approaches that harness the unique properties of BEVs, presenting a multifaceted strategy to combat the challenges associated with NSCLC treatment. 2 MATERIALS AND METHODS 2.1 Cell lines and culture Human NSCLC cell lines, NCI‐H2122 and NCI‐H647, were obtained from the American Type Culture Collection (ATCC). Cells were cultured in RPMI‐1640 medium supplemented with 10% fetal bovine serum and 1% penicillin–streptomycin at 37°C in a humidified atmosphere containing 5% CO 2 2.2 Patient samples and data analysis The expression levels of ferroptosis‐related genes were analyzed using publicly available datasets from the Cancer Genome Atlas (TCGA) and the Gene Expression Omnibus (GEO, GSE33532 2.3  siRNA siRNA targeting SLC7A11 was designed and synthesized by Genelily BioTech Co., Ltd. (Shanghai, China). The sequences used were: SLC7A11 siRNA: 5′‐GGAACUUGUCUUUCAGAAUTT‐3′; Control non‐targeting control (si‐NC): provided by Genelily BioTech Co., Ltd. (Shanghai, China). Transfection was performed using Lipofectamine RNAiMAX reagent (Thermo Fisher Scientific) according to the manufacturer's instructions. Briefly, cells were seeded in 6‐well plates at a density of 1 × 10 5 2.4 Quantitative polymerase chain reaction ( qPCR Total RNA was isolated from cultured NSCLC cells or snap‐frozen tumor tissues using TRIzol reagent (Invitrogen, USA) following the manufacturer's protocol. Briefly, cells/tissues were homogenized in TRIzol (1 mL per 100 mg tissue), followed by chloroform phase separation. RNA was precipitated with isopropanol, washed with 75% ethanol, and dissolved in nuclease‐free water. RNA concentration and purity were verified using a NanoDrop 2000 spectrophotometer (Thermo Fisher Scientific, USA), with acceptable A260/A280 ratios of 1.8–2.1 and A260/A230>1.7. RNA integrity was confirmed by 1% agarose gel electrophoresis, displaying intact 28S/18S ribosomal RNA bands. For cDNA synthesis, 1 μg of total RNA was reverse‐transcribed using the PrimeScript RT Reagent Kit (Takara, Japan) in a 20 μL reaction volume under the following conditions: 37°C for 15 min (reverse transcription) and 85°C for 5 s (enzyme inactivation). qPCR amplification was performed in triplicate using SYBR Green PCR Master Mix (Applied Biosystems, USA) on a CFX96 Real‐Time PCR System (BioRad, USA). Each 20 μL reaction contained 2 μL cDNA template, 10 μL SYBR Green mix, 0.8 μL each primer (10 μM), and 6.4 μL nuclease‐free water. Thermocycling parameters: 95°C for 10 min (initial denaturation), followed by 40 cycles of 95°C for 15 s and 60°C for 1 min. Melt curve analysis (60–95°C, 0.3°C/s increment) confirmed primer specificity. No‐template and no‐reverse‐transcriptase (no‐RT) controls were included to rule out genomic DNA contamination. Gene expression was normalized to GAPDH (−ΔΔ Ct The following primers were used: SLC7A11 Forward: 5′‐CCTGGACACTTTGTGCTGAC‐3′; SLC7A11 Reverse: 5′‐GCCACTGATGGTGTTGATCC‐3′; Transferrin Forward: 5′‐GCTGTCCCTGACAAAACGGT‐3′; Transferrin Reverse: 5′‐GTCACGGAAGCTGATGCACT‐3′; GAPDH Forward: 5′‐GTCAGTGGTGGACCTGACCT‐3′; GAPDH Reverse: 5′‐CCTGCTTCACCACCTTCTTG‐3′. 2.5 Western blotting Cells were harvested and lysed in RIPA buffer containing protease inhibitors (Roche). Protein concentration was determined using the BCA protein assay kit (Pierce). Equal amounts of protein were separated by SDS‐PAGE and transferred onto PVDF membranes (Millipore). Membranes were blocked with 5% non‐fat milk in TBST for 1 h and incubated overnight at 4°C with primary antibodies against SLC7A11 (Abcam, ab175185), Transferrin (Cell Signaling Technology, #35293) and GAPDH (Cell Signaling Technology, #2118). Following incubation with HRP‐conjugated secondary antibodies (Cell Signaling Technology), bands were visualized using ECL detection reagents (Thermo Fisher Scientific). 2.6 Immunofluorescence ( IF Cells grown on glass coverslips were fixed with 4% paraformaldehyde and permeabilized with 0.1% Triton X‐100. After blocking with 5% BSA, cells were incubated with anti‐SLC7A11 antibody overnight at 4°C. Subsequently, they were stained with Alexa Fluor 488‐conjugated secondary antibody (Thermo Fisher Scientific) and DAPI (Sigma) for nuclear staining. Images were captured using a fluorescence microscope (Olympus IX71). 2.7  CCK8 Cell viability was assessed using the Cell Counting Kit‐8 (CCK8) assay (Dojindo Molecular Technologies). Following transfection, cells were seeded into 96‐well plates (1 × 104 cells/well) and incubated for 24, 48, or 72 h. CCK8 solution was added to each well, and absorbance was measured at 450 nm using a microplate reader (BioTek). 2.8 Colony formation assay For colony formation, transfected cells were plated at a density of 500 cells per 6‐well plate and cultured for 10–14 days until visible colonies appeared. Colonies were fixed with methanol, stained with crystal violet (0.5% in methanol), and counted using an inverted microscope. The number of colonies formed was recorded and expressed as a percentage of the control group. 2.9  EdU To evaluate cell proliferation, an EdU assay was performed using the EdU Cell Proliferation Kit (Thermo Fisher Scientific). Following transfection, cells were incubated with EdU for 2 h before fixation. Cells were then processed according to the manufacturer's instructions to visualize EdU incorporation. Images were obtained using a fluorescence microscope, and the percentage of EdU‐positive cells was calculated from at least three random fields. 2.10 Wound healing assay Cells were seeded in six‐well plates and allowed to reach confluence. A sterile pipette tip was used to create a wound, and cells were washed with PBS. Fresh medium was added, and images were captured at 0‐ and 24‐h post‐wounding using an inverted microscope. The percentage of wound closure was calculated based on the areas measured. 2.11 Transwell invasion assay For invasion assays, Matrigel‐coated Transwell inserts (Corning) were used. Cells were starved overnight and then resuspended in serum‐free RPMI‐1640. Approximately 1 × 10 5 2.12 Xenograft tumor model Male BALB/c nude mice (4–6 weeks old) were purchased from the Shanghai Laboratory Animal Center and housed in specific pathogen‐free conditions. All animal experiments were approved by the institutional animal care and use committee. For tumorigenesis studies, NCI‐H2122 cells (1 × 10 6 2 2.13 Lung metastasis model For metastasis evaluation, NCI‐H2122 cells were injected via the tail vein into BALB/c nude mice. For the BEVs treatment, mice were divided into groups and weekly injected with PBS, BEVs‐LCTP, BEVs‐siSLC7A11, or BEVs‐LCTP‐siSLC7A11 at a dosage of 10 mg/kg via tail vein injection over a 21‐day treatment period. After 4 weeks, the mice were euthanized, and lungs were collected for analysis. Pulmonary metastases were assessed through imaging, followed by histological examination. 2.14 Generation of BEVs The BEVs were produced from genetically modified bacteria (Nissle1917) capable of expressing ClyA‐LCTP, SLC7A11 shRNA, and ClyA‐LCTP‐SLC7A11 shRNA. Bacteria were cultured in LB broth until they reached an appropriate optical density (OD600 of 0.6), then induced to express the desired constructs. The supernatant was harvested, and BEVs were purified via ultrafiltration and gradient centrifugation as previously described.  34 2.15 Transmission electron microscopy ( TEM BEVs were diluted in PBS and visualized by TEM. Samples were prepared by placing a drop on a copper grid, allowing it to adhere, then negatively staining with uranyl acetate. Imaging was performed using a JEOL JEM‐1400 Plus electron microscope. 2.16 Nanoparticle tracking analysis ( NTA The size distribution and concentration of BEVs were quantified using NTA (NanoSight NS300). Samples were diluted appropriately and analyzed under controlled settings, with three independent measurements taken for each sample. 2.17 Real‐time PCR SLC7A11 shRNA To confirm the successful loading of SLC7A11 shRNA into BEVs, total RNA was extracted from the vesicles using TRIzol reagent. cDNA synthesis and real‐time PCR were conducted as previously described, using specific primers for SLC7A11 shRNA. 2.18 Histological analysis Mice were divided into groups and weekly injected with PBS, BEVs‐LCTP, BEVs‐siSLC7A11, or BEVs‐LCTP‐siSLC7A11 at a dosage of 10 mg/kg via tail vein injection over a 21‐day treatment period. At predetermined time points, major organs (heart, liver, brain, kidneys, and lung) were harvested and fixed in 4% paraformaldehyde. Sections were prepared and stained with hematoxylin and eosin (H&E) for histopathological examination. 2.19 Biochemical analysis Blood samples were collected via cardiac puncture, and serum was separated by centrifugation at 4000 rpm for 10 min. The serum was analyzed for biochemical markers of heart injury, liver and kidney function, including cardiac troponin T (cTnT), Creatine kinase‐MB (CK‐MB), alanine aminotransferase (ALT), aspartate aminotransferase (AST), creatinine, and blood urea nitrogen (BUN), and cytokines (IL‐1 β α 2.20 Statistical analysis Data were analyzed using GraphPad Prism software (version 9.0). All experiments were conducted in triplicate, and results are presented as the mean ± standard deviation (SD). Comparisons between groups were performed using Student's t p 3 RESULTS 3.1 Up‐regulated SLC7A11 NSCLC To investigate the role of ferroptosis‐related genes in NSCLC, we analyzed expression levels using TCGA and GEO databases. Our analysis revealed that SLC7A11, a key regulator of cystine uptake and important for glutathione synthesis, was significantly up‐regulated in NSCLC tissues compared to normal lung tissues (Figure 1 1a p GSE33532 1b FIGURE 1 SLC7A11 was significantly up‐regulated in NSCLC tissues. (a) The expression levels of ferroptosis‐related genes in NSCLC were analyzed in the TCGA database. (B) The expression levels of ferroptosis‐related genes in NSCLC were analyzed in the GEO database ( GSE33532 3.2 Verification of SLC7A11 NSCLC Subsequently, we evaluated the knockdown efficiency of SLC7A11 in two NSCLC cell lines, NCI‐H2122 and NCI‐H647, utilizing quantitative PCR (qPCR), western blotting, and IF techniques. The qPCR results demonstrated a significant reduction in SLC7A11 mRNA expression post‐siRNA treatment, with reductions of approximately 70% in both cell lines (Figure 2a 2b 2c FIGURE 2 SLC7A11 knockdown efficiency in NSCLC cells was verified by qPCR, Western Blot, and IF. (a) Relative PCR was used to verify the knockdown efficiency of SLC7A11 in NSCLC cells (NCI‐H2122 and NCI‐H647). N p N p N 3.3 Effects of SLC7A11 NSCLC Our next objective was to assess how SLC7A11 knockdown affected NSCLC cell behavior, focusing on proliferation, migration, and invasion capabilities. CCK‐8 assays indicated that SLC7A11 knockdown led to significantly reduced proliferation in both NCI‐H2122 and NCI‐H647 cells (Figure 3a 3b 3c FIGURE 3 SLC7A11 knockdown impaired the proliferation, migration, and invasion abilities in NSCLC cell lines. (a) CCK8 assay was used to analyze the effect of SLC7A11 knockdown on the cell proliferation ability in NCI‐H2122 and NCI‐H647 cells. N p p p N p N N p N p In terms of cell migration and invasion, wound healing assays demonstrated that SLC7A11 knockdown significantly inhibited the migratory capacity of NSCLC cells, with healed areas being substantially larger in si‐NC treated controls than in si‐SLC7A11 groups (Figure 3d 3e 3.4 Tumorigenesis impairment by SLC7A11 siRNA We proceeded to assess the tumorigenic potential of NSCLC cells in vivo by employing subcutaneous xenograft models. Notably, tumors derived from NCI‐H2122 cells transfected with si‐SLC7A11 exhibited significantly reduced tumor volume and weight compared to control (si‐NC) groups (Figure 4a–c FIGURE 4 SLC7A11 knockdown impaired the tumorigenesis ability of NSCLC cells in the xenograft model. (a) A subcutaneous transplantation tumor model was used to evaluate SLC7A11 knockdown on the tumorigenesis of NSCLC cells. The generated tumor from NCI‐H2122 (si‐NC and si‐SLC7A11) cells was isolated and pictured. N N p N p 3.5  SLC7A11 siRNA To evaluate the metastatic ability of NSCLC cells influenced by SLC7A11 knockdown, we established subcutaneous lung metastasis models. The results demonstrated that SLC7A11 knockdown led to a significant reduction in the number of pulmonary metastases generated from NCI‐H2122 cells (Figure 5a, b 5c FIGURE 5 SLC7A11 knockdown impaired the tumor metastasis ability of NSCLC cells in the xenograft model. (a) A subcutaneous lung metastasis tumor model was used to evaluate SLC7A11 knockdown on the metastasis of NCI‐H2122 cells. The generated pulmonary metastases from NCI‐H2122 (si‐NC and si‐SLC7A11) cells were isolated and pictured. N N p N 3.6 Characterization and in vivo toxicity assay of engineered BEVs To improve targeted delivery of SLC7A11 siRNA, we engineered BEVs expressing SLC7A11‐specific shRNA. The design included a construct that facilitates lung targeting via ClyA‐LCTP fusion protein. The BEVs containing SLC7A11‐specific shRNA without LCTP fusion were used as a BEV controls (BEVs‐siSLC7A11). TEM confirmed the successful assembly and morphology of BEVs‐LCTP, BEVs‐siSLC7A11, and BEVs‐LCTP‐siSLC7A11 (Figure 6a,b 11 11 11 6c 6d 6e FIGURE 6 Design and characterization of engineered lung cell targeting and SLC7A11 siRNA‐expressing bacterial extracellular vesicles. (a) Schematic illustration of the construct used to express ClyA‐LCTP (NNPWREMMYIEI), ClyA‐SLC7A11‐shRNA (without targeting peptide) and ClyA‐LCTP (NNPWREMMYIEI)‐SLC7A11 shRNA. (b) TEM images of BEVs‐LCTP, BEVs‐siSLC7A11, and BEVs‐LCTP‐siSLC7A11. Scale bars represent 100 μm. N N N p N To evaluate the systemic effects and potential toxicity of our treatment approach, we monitored body weight changes and hematological parameters throughout the study. No significant differences in body weight were observed between treatment groups, suggesting that our engineered BEVs (BEVs‐LCTP; BEVs‐siSLC7A11; BEVs‐LCTP‐siSLC7A11) did not induce substantial adverse effects (Figure 7a 7b β α 7c FIGURE 7 In vivo toxicity assay of bioengineered BEVs. (a) H&E staining of the heart, liver, brain, kidney, and lung after administration of PBS, BEVs‐LCTP, BEVs‐siSLC7A11, and BEVs‐LCTP‐siSLC7A11. N N β α N 3.7  BEVs LCTP siSLC7A11 NSCLC To evaluate the therapeutic potential of SLC7A11‐targeting nanoparticles, NCI‐H2122 xenograft mice were weekly administered BEVs‐siSLC7A11 and BEVs‐LCTP‐siSLC7A11 at graded doses (0.3, 1, 3, 10, 30 mg/kg) over a 21‐day treatment period. Quantitative real‐time PCR analysis revealed distinct dose–response profiles between the two formulations. While BEVs‐siSLC7A11 showed no significant suppression of SLC7A11 mRNA levels at doses below 30 mg/kg, a marked reduction ( p 1A 1A 1B 8 p 8b p 8c p 8d 8e 8f 9a p 9b 9e p 9c 9d 9f FIGURE 8 BEVs‐LCTP‐siSLC7A11 impaired the tumorigenesis ability of NSCLC cells and activated the ferroptosis in the xenograft model. (a) The subcutaneous transplantation tumor model was used to evaluate PBS, BEVs‐LCTP, BEVs‐siSLC7A11, and BEVs‐LCTP‐siSLC7A11 on the tumorigenesis of NSCLC cells. The generated tumor from NCI‐H2122 cells was isolated and pictured. N N p N p N p N p N FIGURE 9 BEVs‐LCTP‐siSLC7A11 impaired the tumor metastasis ability of NSCLC cells and activated ferroptosis in the xenograft model. (a) A subcutaneous lung metastasis tumor model was used to evaluate PBS, BEVs‐LCTP, BEVs‐siSLC7A11, and BEVs‐LCTP‐siSLC7A11 on the metastasis of NCI‐H2122 cells. The generated pulmonary metastases from NCI‐H2122 cells were isolated and pictured. N N p N p N p N N 4 DISCUSSION The findings of this study elucidate the potential therapeutic implications of targeting the SLC7A11 gene in NSCLC using engineered BEVs. The data presented here indicate that SLC7A11 is significantly upregulated in NSCLC tissues, and its knockdown impairs various cancer hallmarks, including proliferation, migration, invasion, tumorigenesis, and metastasis. Moreover, the use of BEVs expressing SLC7A11 siRNA presents a novel strategy for targeted gene silencing in lung cancer therapy, promoting ferroptosis as a mechanism to inhibit tumor progression. Our analysis of publicly available datasets from TCGA and GEO revealed that SLC7A11 expression was markedly elevated in NSCLC tissues compared to normal lung tissues. This finding aligns with previous studies suggesting that SLC7A11 plays a critical role in cancer biology by regulating the cellular uptake of cysteine, which is essential for glutathione synthesis and resistance to oxidative stress.  35  36  37  19  38  39 To explore the functional consequences of SLC7A11 inhibition, we employed diverse techniques including qPCR, Western blotting, and IF to confirm successful knockdown of SLC7A11 in NSCLC cell lines NCI‐H2122 and NCI‐H647. Each technique corroborated the efficiency of our siRNA‐mediated knockdown approach. Notably, this multi‐faceted validation underscores the robustness of our experimental design and provides confidence in the authenticity of subsequent findings regarding the biological implications of SLC7A11 inhibition. In examining the effects of SLC7A11 knockdown on cell behavior, we observed significant impairments in proliferation, migration, and invasion capabilities of NSCLC cells. The CCK8 assay demonstrated reduced cell viability, while colony formation assays confirmed diminished proliferative capacity upon SLC7A11 knockdown. Additionally, EdU incorporation assays illustrated a substantial decrease in DNA synthesis, indicating that SLC7A11 contributes not only to proliferation but also to maintaining the overall growth signal within NSCLC cells. Furthermore, wound healing assays and Transwell invasion assays revealed that SLC7A11 knockdown substantially inhibited the migratory and invasive properties of NSCLC cells. These findings suggest that SLC7A11 is integral to the epithelial‐to‐mesenchymal transition, a critical process underlying cancer metastasis. It is plausible that SLC7A11 enhances cellular plasticity, allowing cancer cells to adaptively respond to microenvironmental cues that promote metastatic spread. To further investigate the translational relevance of SLC7A11 knockdown, we utilized xenograft models to assess its impact on tumorigenesis. Subcutaneous transplantation of NCI‐H2122 cells with SLC7A11 knockdown led to significantly reduced tumor growth and weight compared to control groups. The generation of these tumor models provided crucial insight into the role of SLC7A11 in vivo, demonstrating its contribution to tumor growth dynamics. Importantly, these results highlight the feasibility of targeting SLC7A11 as a therapeutic strategy to impair tumor development in NSCLC. Metastasis remains one of the leading causes of mortality in NSCLC patients. Our investigations into the effects of SLC7A11 knockdown on metastatic potential reveal profound insights. Using a lung metastasis model, we showed that the reduction of SLC7A11 not only decreased the number of pulmonary metastases but also affected the histological characteristics of the metastases themselves. HE staining further illustrated that SLC7A11 knockdown resulted in a marked reduction in the metastatic burden in the lungs. These findings are particularly relevant as they underscore the dual role of SLC7A11 in both primary tumor growth and metastatic spread. By diminishing the migratory and invasive capacities of NSCLC cells, SLC7A11 knockdown could serve as a promising strategy to combat metastasis, which often complicates treatment outcomes in lung cancer patients. One of the standout innovations of this study is the engineering of BEVs for targeted delivery of SLC7A11 siRNA. A critical innovation of this study lies in the strategic selection of BEVs as siRNA delivery vehicles, a choice predicated on their distinct advantages over mammalian‐derived extracellular vehicles (EVs) and synthetic nanoparticle systems.  28  31 Scalability  29 Safety  30 Engineerability  40  34  41  42  32  33  43 Escherichia coli  44 An intriguing aspect of our findings is the role of ferroptosis, a form of regulated cell death characterized by iron‐dependent lipid peroxidation, upon SLC7A11 knockdown.  25  27  38  45  46 In summary, our study underscores the significance of SLC7A11 as a therapeutic target in non‐small cell lung cancer. The development of engineered BEVs as a means to deliver SLC7A11 siRNA provides a novel approach to combat tumor progression and metastasis. By elucidating the relationship between SLC7A11 expression and cancer hallmarks such as proliferation, migration, invasion, and ferroptosis, we propose that targeting this gene may serve as an impactful strategy in the fight against NSCLC (Figure 10 FIGURE 10 Schematic diagram of Design and characterization of Engineered lung cell targeting and SLC7A11 siRNA expressing bacterial extracellular vesicles and its therapeutic strategy for NSLCL via activating ferroptosis. AUTHOR CONTRIBUTIONS X. Wang and H. Xu were primarily responsible for designing the experimental protocols, analyzing the data, and drafting the initial manuscript. X. Zhou played a pivotal role in conducting the experiments, interpreting the results, and providing critical feedback during manuscript preparation. J. Liu assisted in data collection and preliminary analysis. H. Xu supervised the entire project, including the conception of the research idea, coordination of team efforts, and finalization of the manuscript. They also ensured the integrity of the research and were instrumental in securing funding and resources for the study. FUNDING INFORMATION This work was supported by grants from the National Natural Science Foundation of China (82260054). CONFLICT OF INTEREST STATEMENT The authors declare no conflict of interest. Supporting information  Supplementary Figure 1. N p p p DATA AVAILABILITY STATEMENT The data that support the findings of this study are available from the corresponding author upon reasonable request. REFERENCES 1 Jonna S Subramaniam DS Molecular diagnostics and targeted therapies in non‐small cell lung cancer (NSCLC): an update Discov Med 2019 27 148 167 170 31095926 2 Miao D Zhao J Han Y Management of locally advanced non‐small cell lung cancer: state of the art and future directions Cancer Commun 2024 44 1 23 46 10.1002/cac2.12505 PMC10794016 37985191 3 Pan K Concannon K Li J Zhang J Heymach JV Le X Emerging therapeutics and evolving assessment criteria for intracranial metastases in patients with oncogene‐driven non‐small‐cell lung cancer Nat Rev Clin Oncol 2023 20 10 716 732 37592034 10.1038/s41571-023-00808-4 PMC10851171 4 Riely GJ Wood DE Ettinger DS Non‐small cell lung cancer, version 4.2024, NCCN clinical practice guidelines in oncology J Natl Compr Canc Netw 2024 22 4 249 274 10.6004/jnccn.2204.0023 38754467 5 Tian Y Xu L Li X Li H Zhao M SMARCA4: current status and future perspectives in non‐small‐cell lung cancer Cancer Lett 2023 554 216022 36450331 10.1016/j.canlet.2022.216022 6 Siegel RL Giaquinto AN Jemal A Cancer statistics, 2024 CA Cancer J Clin 2024 74 1 12 49 38230766 10.3322/caac.21820 7 Abu Rous F Singhi EK Sridhar A Faisal MS Desai A Lung cancer treatment advances in 2022 Cancer Invest 2023 41 1 12 24 36036470 10.1080/07357907.2022.2119479 8 Duma N Santana‐Davila R Molina JR Non‐small cell lung cancer: epidemiology, screening, diagnosis, and treatment Mayo Clin Proc 2019 94 8 1623 1640 31378236 10.1016/j.mayocp.2019.01.013 9 Herbst RS Morgensztern D Boshoff C The biology and management of non‐small cell lung cancer Nature 2018 553 7689 446 454 29364287 10.1038/nature25183 10 Xing N Du Q Guo S Ferroptosis in lung cancer: a novel pathway regulating cell death and a promising target for drug therapy Cell Death Discov 2023 9 1 110 37005430 10.1038/s41420-023-01407-z PMC10067943 11 Bao Y Pan Z Zhao L BIBR1532 combined with radiotherapy induces ferroptosis in NSCLC cells and activates cGAS‐STING pathway to promote anti‐tumor immunity J Transl Med 2024 22 1 519 38816831 10.1186/s12967-024-05331-3 PMC11138045 12 Du L Yang H Ren Y Inhibition of LSD1 induces ferroptosis through the ATF4‐xCT pathway and shows enhanced anti‐tumor effects with ferroptosis inducers in NSCLC Cell Death Dis 2023 14 11 716 37923740 10.1038/s41419-023-06238-5 PMC10624898 13 Gao GB Chen L Pan JF LncRNA RGMB‐AS1 inhibits HMOX1 ubiquitination and NAA10 activation to induce ferroptosis in non‐small cell lung cancer Cancer Lett 2024 590 216826 38574881 10.1016/j.canlet.2024.216826 14 Kim JW Kim MJ Han TH FSP1 confers ferroptosis resistance in KEAP1 mutant non‐small cell lung carcinoma in NRF2‐dependent and ‐independent manner Cell Death Dis 2023 14 8 567 10.1038/s41419-023-06070-x 37633973 PMC10460413 15 Li S Wang A Wu Y Targeted therapy for non‐small‐cell lung cancer: new insights into regulated cell death combined with immunotherapy Immunol Rev 2024 321 1 300 334 37688394 10.1111/imr.13274 16 Bow YD Ko CC Chang WT A novel quinoline derivative, DFIQ, sensitizes NSCLC cells to ferroptosis by promoting oxidative stress accompanied by autophagic dysfunction and mitochondrial damage Cancer Cell Int 2023 23 1 171 37587444 10.1186/s12935-023-02984-w PMC10433610 17 Deng J Lin X Qin J SPTBN2 suppresses ferroptosis in NSCLC cells by facilitating SLC7A11 membrane trafficking and localization Redox Biol 2024 70 103039 38241838 10.1016/j.redox.2024.103039 PMC10825533 18 Wang Z Shen N Wang Z TRIM3 facilitates ferroptosis in non‐small cell lung cancer through promoting SLC7A11/xCT K11‐linked ubiquitination and degradation Cell Death Differ 2024 31 1 53 64 37978273 10.1038/s41418-023-01239-5 PMC10781973 19 Wen Y Li K Ni M Dendritic polylysine with paclitaxel and triptolide codelivery for enhanced cancer ferroptosis through the accumulation of ROS ACS Appl Mater Interfaces 2024 16 16 20143 20156 38597227 10.1021/acsami.4c00558 20 Zhu X Fu Z Dutchak K Cotargeting CDK4/6 and BRD4 promotes senescence and ferroptosis sensitivity in cancer Cancer Res 2024 84 8 1333 1351 38277141 10.1158/0008-5472.CAN-23-1749 21 Chen SJ Zhang J Zhou T Epigenetically upregulated NSUN2 confers ferroptosis resistance in endometrial cancer via m(5)C modification of SLC7A11 mRNA Redox Biol 2024 69 102975 38042059 10.1016/j.redox.2023.102975 PMC10711489 22 Huang S Zhang Q Zhao M The deubiquitinase ZRANB1 is an E3 ubiquitin ligase for SLC7A11 and regulates ferroptotic resistance J Cell Biol 2023 222 11 e202212072 37831441 10.1083/jcb.202212072 PMC10570852 23 Huang X Wu J Wang Y FOXQ1 inhibits breast cancer ferroptosis and progression via the circ_0000643/miR‐153/SLC7A11 axis Exp Cell Res 2023 431 1 113737 37591453 10.1016/j.yexcr.2023.113737 24 Saini KK Chaturvedi P Sinha A Loss of PERK function promotes ferroptosis by downregulating SLC7A11 (system xc(−)) in colorectal cancer Redox Biol 2023 65 102833 37536085 10.1016/j.redox.2023.102833 PMC10412847 25 Li F Hao S Gao J Jiang P EGCG alleviates obesity‐exacerbated lung cancer progression by STAT1/SLC7A11 pathway and gut microbiota J Nutr Biochem 2023 120 109416 10.1016/j.jnutbio.2023.109416 37451475 26 Liu X Zhuang L Gan B Disulfidptosis: disulfide stress‐induced cell death Trends Cell Biol 2024 34 4 327 337 10.1016/j.tcb.2023.07.009 37574347 27 Lv T Fan X He C SLC7A11‐ROS/alphaKG‐AMPK axis regulates liver inflammation through mitophagy and impairs liver fibrosis and NASH progression Redox Biol 2024 72 103159 38642501 10.1016/j.redox.2024.103159 PMC11047786 28 Gurunathan S Kim JH Bacterial extracellular vesicles: emerging nanoplatforms for biomedical applications Microb Pathog 2023 183 106308 10.1016/j.micpath.2023.106308 37595812 29 Ho MY Liu S Xing B Bacteria extracellular vesicle as nanopharmaceuticals for versatile biomedical potential Nano Converg 2024 11 1 28 38990415 10.1186/s40580-024-00434-5 PMC11239649 30 Ji N Wang F Wang M Zhang W Liu H Su J Engineered bacterial extracellular vesicles for central nervous system diseases J Control Release 2023 364 46 60 37866404 10.1016/j.jconrel.2023.10.027 31 Karaman I Pathak A Bayik D Watson DC Harnessing bacterial extracellular vesicle immune effects for cancer therapy Pathog Immun 2024 9 1 56 90 38690563 10.20411/pai.v9i1.657 PMC11060327 32 Li CC Hsu WF Chiang PC Kuo MC Wo AM Tseng YJ Characterization of markers, functional properties, and microbiome composition in human gut‐derived bacterial extracellular vesicles Gut Microbes 2023 15 2 2288200 38038385 10.1080/19490976.2023.2288200 PMC10730231 33 Li Y Qu G Dou G Engineered extracellular vesicles driven by erythrocytes ameliorate bacterial sepsis by iron recycling, toxin clearing and inflammation regulation Adv Sci 2024 11 13 e2306884 10.1002/advs.202306884 PMC10987154 38247172 34 Liu H Song P Zhang H Synthetic biology‐based bacterial extracellular vesicles displaying BMP‐2 and CXCR4 to ameliorate osteoporosis J Extracell Vesicles 2024 13 4 e12429 38576241 10.1002/jev2.12429 PMC10995478 35 Xia Y Liu T Deng S Lanatoside C induces ferroptosis in non‐small cell lung cancer in vivo and in vitro by regulating SLC7A11/GPX4 signaling pathway Transl Cancer Res 2024 13 5 2295 2307 38881941 10.21037/tcr-23-2285 PMC11170539 36 Xu B Zhou L Zhang Q Curcumin inhibits the progression of non‐small cell lung cancer by regulating DMRT3/SLC7A11 Axis Mol Biotechnol 2024 10.1007/s12033-024-01166-x 38744789 37 Yan R Liu D Guo H LAPTM4B counteracts ferroptosis via suppressing the ubiquitin‐proteasome degradation of SLC7A11 in non‐small cell lung cancer Cell Death Dis 2024 15 6 436 38902268 10.1038/s41419-024-06836-x PMC11190201 38 Wang Z Ouyang L Liu N The DUBA‐SLC7A11‐c‐Myc axis is critical for stemness and ferroptosis Oncogene 2023 42 36 2688 2700 37537342 10.1038/s41388-023-02744-0 39 Yao F Zhao Y Wang G Exosomal lncRNA ROR1‐AS1 from cancer‐associated fibroblasts inhibits ferroptosis of lung cancer cells through the IGF2BP1/SLC7A11 signal axis Cell Signal 2024 120 111221 38729321 10.1016/j.cellsig.2024.111221 40 Chi YH Hsiao JK Lin MH Chang C Lan CH Wu HC Lung cancer‐targeting peptides with multi‐subtype indication for combinational drug delivery and molecular imaging Theranostics 2017 7 6 1612 1632 28529640 10.7150/thno.17573 PMC5436516 41 Pan J Wang Z Huang X Bacteria‐derived outer‐membrane vesicles hitchhike neutrophils to enhance ischemic stroke therapy Adv Mater 2023 35 38 e2301779 37358255 10.1002/adma.202301779 42 Zheng K Feng Y Li L Kong F Gao J Kong X Engineered bacterial outer membrane vesicles: a versatile bacteria‐based weapon against gastrointestinal tumors Theranostics 2024 14 2 761 787 38169585 10.7150/thno.85917 PMC10758051 43 Liu C Yazdani N Moran CS Unveiling clinical applications of bacterial extracellular vesicles as natural nanomaterials in disease diagnosis and therapeutics Acta Biomater 2024 180 18 45 38641182 10.1016/j.actbio.2024.04.022 44 Chen H Lei P Ji H Advances in Escherichia coli Mater Today Bio 2023 18 100543 10.1016/j.mtbio.2023.100543 PMC9840185 36647536 45 Zheng H Liu J Cheng Q Targeted activation of ferroptosis in colorectal cancer via LGR4 targeting overcomes acquired drug resistance Nat Cancer 2024 5 4 572 589 38291304 10.1038/s43018-023-00715-8 46 Wang X Zhu HQ Lin SM Xia BY Xu B RPN1: a pan‐cancer biomarker and disulfidptosis regulator Transl Cancer Res 2024 13 5 2518 2534 38881923 10.21037/tcr-24-581 PMC11170529 ",
  "metadata": {
    "Title of this paper": "RPN1: a pan‐cancer biomarker and disulfidptosis regulator",
    "Journal it was published in:": "Bioengineering & Translational Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478443/"
  }
}