{
  "title": "Paper_434",
  "abstract": "pmc Mol Cancer Ther Mol Cancer Ther 4147 aacrsd Molecular Cancer Therapeutics 1535-7163 1538-8514 pmc-is-collection-domain yes pmc-collection-title AACR Open Access PMC12485387 PMC12485387.1 12485387 12485387 40497697 10.1158/1535-7163.MCT-24-0693 MCT-24-0693 1 Version of Record Biomarkers Diagnostic Biomarkers Early Detection Biomarkers Breast Cancer Drug Resistance Clinical Drug Resistance Epigenetics Gene Regulation Immunotherapy Combination Immunotherapy Liquid Biopsy Small Molecule Therapeutics Depleting the Action of EZH2 through PI3K–mTOR Inhibition to Overcome Metastasis and Immunotherapy Resistance in Triple-Negative Breast Cancer PI3K–mTOR Pathway Epigenetic Switch in TNBC https://orcid.org/0000-0001-6962-9016 Melino Michelle 1  # https://orcid.org/0009-0004-6573-7406 Tu Wen Juan 1  # https://orcid.org/0000-0002-5332-5445 Bielefeldt-Ohmann Helle 2 3 https://orcid.org/0009-0001-0232-6835 Proctor Martina 1 https://orcid.org/0009-0001-7658-1548 Ahuja Taniya 1 https://orcid.org/0000-0003-1741-0076 Vandermeide John 1 https://orcid.org/0000-0002-4980-2114 Bain Amanda L. 1 https://orcid.org/0009-0005-3003-7992 Nallan Gahyathiri 1 https://orcid.org/0000-0002-0727-7200 Goh Sal Lee 1 https://orcid.org/0000-0002-8745-8879 Prasanna Thiru 4 5 https://orcid.org/0000-0001-5608-693X Dahlstrom Jane E. 6 7 https://orcid.org/0009-0003-4435-9082 Miranda Mariska 1 https://orcid.org/0009-0002-9741-0147 Chaudhary Ramesh Kumar 8 https://orcid.org/0009-0008-4684-9751 Anandam Aravind 8 https://orcid.org/0009-0003-6623-4248 Chaudhary Sumit 8 https://orcid.org/0000-0003-0148-5487 Seal Jonathan T. 9 https://orcid.org/0000-0001-7153-856X Sinha Debottam 10 https://orcid.org/0009-0001-8644-0757 Zhang Shaoqian 11 https://orcid.org/0000-0002-9049-5152 Nguyen Tam Hong 12 https://orcid.org/0000-0002-0713-6723 Srihari Sriganesh 13 https://orcid.org/0000-0002-5454-6450 Hartel Gunter 14 15 https://orcid.org/0000-0002-7023-7578 Ives Amy 16 https://orcid.org/0000-0002-5898-5186 Malik Laeeq 4 https://orcid.org/0000-0002-2806-2401 Yip Desmond 4 6 https://orcid.org/0000-0002-1620-1961 Nottage Michelle 16 https://orcid.org/0000-0002-7560-5026 Eastgate Melissa 16 17 https://orcid.org/0000-0001-9547-947X Rao Sudha 1 *  1  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  17 * Corresponding Author: sudha.rao@qimrberghofer.edu.au Mol Cancer Ther 2025;24:1511–26 # M. Melino and W.J. Tu contributed equally to this article. 01 10 2025 17 6 2025 24 10 498054 1511 1526 14 8 2024 22 1 2025 22 5 2025 01 10 2025 02 10 2025 03 10 2025 ©2025 The Authors; Published by the American Association for Cancer Research 2025 American Association for Cancer Research https://creativecommons.org/licenses/by-nc-nd/4.0/ This open access article is distributed under the Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International (CC BY-NC-ND 4.0) license. Abstract Almost half of patients with triple‐negative breast cancer develop distant metastases, heralding unfavorable outcomes. Here, we provide novel insights into the contribution of the PI3K–mTOR pathway to the triple‐negative breast cancer phenotypes that promote growth, migration, metastasis, and therapy resistance. Specifically, we demonstrate that dual targeting of PI3K and mTOR but not PI3K alone inhibits cancer cell proliferation and migration in vitro In vivo QIMR Berghofer Medical Research Institute (QIMR) http://dx.doi.org/10.13039/100013103 N/A Goh S.L. Prasanna T. Dahlstrom J.E. Miranda M. Choudhary R.K. Anandam A. Chaudhary S. Seal J.T. Sinha D. Zhang S. Nguyen T.H. Srihari S. Hartel G. Ives A. Malik L. Yip D. Nottage M. Eastgate M. Rao S. Melino M. Tu W.J. Bielefeldt-Ohmann H. Proctor M. Ahuja T. Vandermeide J. Bain A.L. Nallan G. Daniela Dwyer Foundation N/A Melino M. Tu W.J. Bielefeldt-Ohmann H. Proctor M. Ahuja T. Vandermeide J. Bain A.L. Nallan G. Goh S.L. Prasanna T. Dahlstrom J.E. Miranda M. Choudhary R.K. Anandam A. Chaudhary S. Seal J.T. Sinha D. Zhang S. Nguyen T.H. Srihari S. Hartel G. Ives A. Malik L. Yip D. Nottage M. Eastgate M. Rao S. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Breast cancer is the most common cancer in women worldwide ( 1 2 3 4 5 6 Given its key role in tumorigenesis and immunity, targeting PI3K signaling has long been a therapeutic focus in cancer ( 7 8 9 NCT03522298 NCT03970447 10 12 NCT03994796 NCT03765983 NCT04192981 NCT03696355 NCT05009992 NCT04906096 PIK3CA AKT1 PTEN 13 Here, we demonstrate that dual targeting of the PI3K–mTOR pathway but not PI3K alone inhibits cancer cell proliferation and migration and promotes a mesenchymal-to-epithelial phenotype, simultaneously inhibiting signatures associated with metastasis-initiating cells (MIC), including the highly aggressive CD44 high low In vivo PIK3R2 Materials and Methods Cell culture All cancer cell lines, 4T1 (RRID: CVCL_0125, mouse metastatic TNBC); MDA-MB-231 (RRID: CVCL_0062), MDA-MB-468 (RRID: CVCL_0419), and SUM149PT (RRID: CVCL_3422, human TNBC), were sourced from the ATCC and routinely Mycoplasma-tested using a MycoAlert kit (Lonza). MDA-MB-231, MDA-MB-468, and SUM149PT lines were authenticated in-house by short tandem repeat profiling using a GenePrint 10 kit (Promega). 4T1, MDA-MB-231, and SUM149PT cells were maintained and cultured in DMEM (Gibco; Thermo Fisher Scientific; RRID: 11995073) supplemented with 10% FBS, 2 mmol/L L-glutamine, and 1% penicillin/streptomycin (Gibco). MDA-MB-468 cells were maintained and cultured in RPMI 1640 medium (Gibco) supplemented with 10% FBS, 2 mmol/L L-glutamine, and 1% penicillin/streptomycin. Inhibitors For in vitro in vivo WST-1 cell viability assay 4T1, MDA-MB-231, MDA-MB-468, and SUM149PT cells were seeded at optimized densities in 96-well flat-bottom tissue culture plates in a total volume of 100 µL/well. Cells were left to adhere overnight at 37°C and 5% CO 2 2 50 Scratch wound healing assay 4T1 and MDA-MD-231 cells were stimulated with PMA/TGF-β as indicated above for 24 hours prior to seeding at optimized cell densities in 96-well IncuCyte ImageLock plates (Sartorius). Cells were seeded in a total volume of 100 µL/well in low-serum medium (2%) and left to adhere overnight at 37°C and 5% CO 2 50 Flow cytometry FACS was performed on single-cell suspensions stained with anti–CD44-BV650 (BioLegend, cat. # 103049, RRID: AB_2562600) and anti–CD24-PE antibodies (BD Biosciences, cat. # 560991) using LIVE/DEAD Fixable Aqua Dead Cell Stain Kit (Invitrogen; Thermo Fisher Scientific) to monitor cell viability. The proportion of CD44 high low 14 RNA extraction and cDNA synthesis Cells were lysed in 500 μL TRIzol Reagent (Invitrogen; Thermo Fisher Scientific) before RNA isolation using Direct-zol RNA Miniprep Kit (Zymo Research) and treated with RNase-free DNase I (Qiagen) following the manufacturers’ protocols. The NanoDrop (Thermo Fisher Scientific) instrument was then used to determine RNA concentration and purity (A260/A280). RNA (1 μg) was reverse transcribed to cDNA using SuperScript VILO IV Master Mix (Thermo Fisher Scientific) following the supplier’s protocol. cDNA was diluted 1:20 with RNase-free water for qRT-PCR. qRT-PCR Gene transcription was analyzed using TaqMan Gene Expression Master Mix (Thermo Fisher Scientific) on the ABI Viia 7 real-time PCR machine (Applied Biosystems; Thermo Fisher Scientific). Cycle Threshold (Ct) values were converted to arbitrary copy numbers and normalized to the geomean of the housekeeping genes ACTB PPIA ATR ATM RAD51 EXO1 IL-6 GBP IFIT1 IFIT2 IFIT3 IFIH1 IRF1 NFKB RSAD2 P50 PDL1 PARP1 SNAI1 VIM EZH2 Human research ethics statement The study was performed in accordance with the Declaration of Helsinki, and informed consent was obtained in writing from all participants prior to study enrollment. This research was approved by the Metro North Human Research Ethics Committee (reference number HREC/2020/QRBW/64831) and ACT Health Research Ethics Committee (reference Number 2019.ETH.00080) and accepted by the QIMR Berghofer Medical Research Institute Human Research Ethics Committee under project numbers 3634 and 3659, respectively. Peripheral blood mononuclear cell isolation Whole blood from patients with TNBC was stored in EDTA tubes for CTC identification. Unwanted cells were targeted using glycophorin A on red blood cells and then removed via centrifugation over a buoyant density medium (Lymphoprep, STEMCELL Technologies). Purified peripheral blood mononuclear cells (PBMC) were then extracted as a highly enriched population from the interface between the plasma and the buoyant density medium and harvested in 20% FBS in PBS. CTC enrichment Whole blood from patients with TNBC was stored in EDTA tubes for CTC identification. RosetteSep Human CD45 Depletion Cocktail (STEMCELL Technologies) was used to enrich CTCs from whole blood by depleting CD45 + In the 4T1 intravenous metastasis mouse model, 300 µL of whole blood was collected from the submandibular vein and stored in EDTA tubes. ScreenCellCyto filtration devices (ScreenCell) were used to capture single and clustered CTCs according to the manufacturer’s instructions. Captured cells were validated as CTCs by immunofluorescence (IF) staining with primary antibodies targeting vimentin, Snail1, and CD45. Images were scanned using the Nikon CrestOptics DeepSIM super-resolution microscope (CrestOpics) and analyzed using ImageJ software (RRID: SCR_003070) as required. Histochemistry and IHC The modified Giemsa staining methods is detailed in Supplementary Methods. For human studies, IHC was performed on five formalin-fixed, paraffin-embedded (FFPE) biopsy specimens from patients with stage III TNBC using an antibody directed against PIK3R2 (Atlas Antibodies, cat. # HPA069291, RRID: AB_2686109) and imaged using the Aperio AT Turbo (Leica Biosystems). All tissues were analyzed for nuclear PIK3R2 (p85β) expression by a qualified pathologist and expressed as % positivity. IF MDA-MB-231 and MDA-MB-468 cells were cultured on glass microscope slides at optimized densities and fixed in 3.7% paraformaldehyde following treatment. CTCs and PBMCs were fixed in 3.7% paraformaldehyde, and cytospinning was used to mount them onto glass microscope slides. Cells were permeabilized by incubating with 0.5% Triton X 100 for 15 minutes, blocked with 1% BSA in PBS, and probed with primary antibodies as detailed in Supplementary Methods. Protein expression was visualized with a donkey anti-rabbit Alexa Fluor 488, anti-mouse Alexa Fluor 568, or donkey anti-goat Alexa Fluor 647 (Thermo Fisher Scientific). Cover slips were mounted on glass microscope slides with ProLong Glass Antifade reagent (Thermo Fisher Scientific). Protein targets were imaged using the Zeiss 780 NLO confocal microscope (Zeiss) or the Applied Spectral Imaging Digital Pathology platform and analyzed using Imaris 10.1.1 (RRID: SCR_007370), QuPath (RRID: SCR_0182570), or automated Applied Spectral Imaging software, as required. Duolink proximity ligation assay MDA-MB-231 cells were seeded onto coverslips in 12-well plates at a density of 75,000 cells per well in 1 mL of growth medium (DMEM supplemented with 10% FBS, 200 mmol/L L-glutamine, and antibiotics) and incubated overnight at 37°C to allow for cell attachment. The following day, cells were treated with 10 µmol/L paxalisib or DMSO (vehicle control) for 0.5, 2, 3, or 24 hours. Cells were then fixed with 3.7% formaldehyde and subjected to the Duolink proximity ligation assay (PLA; MilliporeSigma) according to the manufacturer’s protocol. Briefly, cells were fixed and cytospinning was used to mount them onto glass microscope slides. PLA was performed using antibodies targeting p85β (Abcam, cat. # ab16502, RRID: AB_443394) and H3K27Me3 (Abcam, cat. # ab6002, RRID: AB_305237), p85β and EZH2 (Abcam, cat. # ab283270, RRID: AB_3676493), and EZH2 and NF-κB. Digital images were acquired on the Zeiss 780 NLO confocal microscope and analyzed using QuPath 0.4.3 software (RRID: SCR_018257). Animal studies The QIMR Berghofer Medical Research Institute and Sai Life Sciences animal ethics committees approved all experimental procedures under study number A2109-627/project ID 3761 and protocol number FB-24-112, respectively. Six-to-eight-week-old female BALB/c mice were procured from Ozgene and allowed to acclimatize for 1 week. For the orthotopic breast tumor model, 1 × 10 5 5 5 3 2 3 Tumor digestion 4T1 tumors were harvested in cold DMEM supplemented with 2.5% FCS before being finely cut using surgical scalpels and enzymatically dissociated using collagenase type 4 (Worthington Biochemical) at a concentration of 1 mg collagenase/g of tumor at 37°C for 1 hour. Dissociated cells were then passed through a 0.2-µm filter before fixation in 3.7% paraformaldehyde and cytospinning onto glass microscope slides for IF staining. NanoString nCounter assay Total RNA was extracted from FFPE mouse tumor tissue using RNeasy FFPE Kit according to the manufacturer’s protocols (Qiagen). RNA concentration was measured using Qubit RNA HS Assay Kit (Thermo Fisher Scientific). RNA samples were subjected to hybridization with the multiplexed mouse tumor signaling 360 panel codeset. Then, hybridized samples were loaded onto nCounter prep station chips, and data were acquired using the nCounter Digital Analyzer (NanoString Technologies) following the manufacturer’s procedures. Data were analyzed with nSolver Analysis Software v4.0 (NanoString Technologies). Counts were normalized according to the expression levels of housekeeping genes and positive/negative-control probes. NanoString nCounter and RNA sequencing/chromatin immunoprecipitation integrated analysis Chromatin immunoprecipitation (ChIP-seq) data ( GSE223959 callpeak in silico EZH2 chromatin-binding sites in MDA-MB-231 cells were compared with publicly available MDA-MB-231 ChIP-seq data of the repressive mark H3K27me3 ( GSE77772 Spatial Tissue Exploration Program spatial immune profiling and analysis Optimal cutting temperature frozen mouse tumor tissues were immunolabelled with an 18-panel antibody cocktail (CD19, CD21/35, CD3, TCRb, CD4, CD90.2, CD11b, CD45, Ly6G, IgM, CD24, CD11c, CD38, CD31, Ter119, CD49f, CD71, and Ki67) and subjected to the Spatial Tissue Exploration Program platform (Akoya Biosciences). Multiplexed image bioinformatics analysis Data preprocessing The final QPTIFF files of composite images were opened in QuPath ( 15 Segmentation and phenotyping Nuclear segmentation was first performed using StarDist to the 4′,6-diamidino-2-phenylindole (DAPI) channel, with the deep learning model retrained by Akoya internally ( 16 Each protein signal was then z 17 Cellular neighborhood analysis Cellular neighborhood (CN) analysis was performed as previously described ( 18 k k Population-based cancer survival analysis Human cancer datasets meeting the following criteria were downloaded from Array Express, Gene Expression Omnibus (RRID: SCR_005012), and Sequence Read Archive (RRID: SCR_004891): (i) at least 20 expression profiles from tissues of patients with cancer (not cell lines or preclinical models); (ii) annotated with clinical outcomes of at least one of (i) categorical outcomes after treatment, e.g., progressive disease, stable disease, pathologic complete response, response, no response, and distant metastasis; and/or (ii) continuous outcome data, including survival and event follow-up, e.g., overall, disease-specific, distant metastasis–free, or progression-free survival. For cohort analysis, within each cohort, we compared the mRNA expression levels of PIK3R2 PIK3R2 PIK3R2 PIK3R2 PIK3R2 PIK3R2 19 Statistical analysis Statistical significance was assessed in Prism 10 (GraphPad Software) using either paired or unpaired t P P P P P Data availability All data are available upon reasonable request. Results Dual PI3K–mTOR blockade with paxalisib inhibits proliferation and migration, induces mesenchymal-to-epithelial transition, and reduces MIC signatures We first compared the efficacy of pan-PI3K, isoform-specific PI3K, and dual targeting PI3K–mTOR inhibition in MDA-MB-231, MDA-MB-468, SUM149PT, and 4T1 cells (a mouse line with a “cold” tumor profile, i.e., unresponsive to immunotherapy) using wortmannin (pan-PI3K inhibitor), idelalisib (p110δ,γ inhibitor), alpelisib (p110α inhibitor), and LY294002 (p110α,β,δ inhibitor) and the dual PI3K–mTOR inhibitors omipalisib (p110α/β/δ/γ,mTORC1/2), apitolisib (PI3Kα/β/δ/γ, mTOR), dactolisib (p110α,β,δ,γ, mTOR), and paxalisib (p110α,β,δ,γ, mTOR inhibitor; Fig. 1A 50 Fig. 1A 50 Fig. 1B in vitro Figure 1. Dual PI3K–mTOR blockade with paxalisib inhibits proliferation and migration, induces mesenchymal-to-epithelial transition, and reduces MIC signatures. A, B, P n C D P P t n E, F, P t n G, P P P P t n H, + + P t n I, P t n J, GBP2 n Several cancer cell populations, including CSCs, dormant tumor cells, and persister cancer cells, referred to here as MICs, are implicated in metastases and drug resistance ( 20 21 22 in vitro Fig. 1C D high low 23 Fig. 1E 24 Fig. 1F Fig. 1G in vitro in vivo VIM SNAI1 NFKB FOXQ1 Given the importance of inflammation in driving metastases, we next determined the role of the PI3K–mTOR inhibition on proinflammatory cytokine production and cancer immune visibility. Treatment of CTCs isolated from patients with TNBC with paxalisib reduced IL-6 protein expression by 72% in ABCB5 + + Fig. 1H 25 Fig. 1I Fig. 1I Fig. 1J Paxalisib reduces primary tumor burden and metastasis with a favorable toxicity profile We next sought to test the efficacy of paxalisib in a clinically relevant model of immunotherapy resistance in TNBC, the spontaneous metastasis 4T1 TNBC model ( Fig. 2A Fig. 2B Fig. 2C 5 6 Fig. 2B Fig. 2B Figure 2. Paxalisib reduces primary tumor burden and metastasis with a favorable toxicity profile. A, B, P P P n C, P P n P P P n P P P P n D, E, F, G, H, I, P P n In the 4T1 model, 4T1 mouse breast tumor cells are injected into the mammary gland of host mice and metastases usually then develop in the lung, lymph nodes, liver, bone, and other sites. However, mice treated with the paxalisib–anti-PD1 combination regimen did not develop overt metastasis, suggesting an antimetastatic effect. Lung inflammatory infiltrates, enlarged spleens (splenomegaly), and extramedullary hematopoiesis are associated with cancer progression and metastasis in the 4T1 model even in the absence of macroscopic disease ( 26 Fig. 2C Fig. 2C To further assess the impact of paxalisib on tumor metastasis, we injected 4T1 tumor cells into the systemic circulation prior to treatment ( Fig. 2D Fig. 2E − + + Fig. 2F Fig. 2G H Fig. 2I Fig. 2I Fig. 2I Spatial imaging reveals changes in immune cell landscapes when paxalisib is combined with immunotherapy To examine the effects of paxalisib on the tissue microenvironment, we next used spatial immune profiling of tumor tissues from the 4T1 TNBC model to investigate 14 innate and adaptive immune populations, stromal cells, and tumor cell proliferation and their interactions following treatment with paxalisib combined with immunotherapy using a 23-marker (immuno)phenotyping panel ( Fig. 3A Fig. 3B Fig. 3B Fig. 3B Fig. 3C Figure 3. CODEX multiplexed imaging reveals changes in immune cell landscapes when paxalisib is combined with immunotherapy. A, B, C, D, E, To explore potential interactions between immune cell populations, we conducted CN analysis ( Fig. 3D Fig. 3E PI3K–mTOR inhibition enhances antitumor immune profiles in combination with immunotherapy To further understand immune cell changes in the microenvironment of paxalisib-treated tumors at higher resolution, we conducted NanoString nCounter analysis of tumors harvested from the 4T1 model. Paxalisib + anti-PD1 treatment enhanced antitumor immune responses in both paxalisib and combination treatments, such as increases in antigen presentation, TCR signaling, cytotoxicity, and IFN responses (Supplementary Fig. S3). Cell abundance analysis revealed increases in antitumor immune cell populations in response to paxalisib and paxalisib + anti-PD1 treatment, including in cytotoxic cells, DCs, T cells, and B cells ( Fig. 4A Fig. 4B Fig. 4C Fig. 4D Fig. 4E Figure 4. PI3K–mTOR inhibition enhances antitumor immune profiles in combination with immunotherapy. A, n B, n C, IFNG GZMB n D, n E, Collectively, these findings demonstrate that paxalisib + anti-PD1 treatment induces antitumor immune profiles (cytotoxic T cells) and reduces T-cell phenotypes associated with immunotherapy resistance (exhausted T cells and Tregs) while reducing protumor innate immune populations such as mast cells. PI3K–mTOR inhibition targets p85β–H3K27Me3 interactions Recent studies have shown that the p85 regulatory subunit of PI3K can regulate biological processes through nuclear translocation ( 27 27 + in vivo Given p85β nuclear translocation leads to increased H3K27 trimethylation, we next determined the impact of paxalisib treatment on p85β and H3K27Me3 nuclear expression. Paxalisib alone or triple combination–treated 4T1 mice showed a significant decrease in both nuclear p85β and H3K27me3 expression in vimentin + Fig. 5A Fig. 5B Fig. 5A Figure 5. PI3K–mTOR inhibition targets p85β:H3K27Me3 switch. A, B, P P t PI3K–mTOR inhibition targets the dual role of EZH2 EZH2 has been implicated in metastases and recurrence via two mechanisms ( 28 29 30 29 31 29 To investigate the impact of PI3K–mTOR inhibition on EZH2 expression, MDA-MB-231 cells were treated with paxalisib for 24 hours prior to IF and qPCR analyses. PI3K–mTOR blockade reduced EZH2 mRNA ( Fig. 6A Fig. 6B Fig. 6C Fig. 6D 32 Figure 6. PI3K–mTOR inhibition targets the dual role of EZH2. A, EZH2 P t B, P t C, P t D, P t E, 2 P F, G, To investigate the impact of paxalisib on EZH2-targeted gene expression, we overlapped EZH2/H3K27me3 ChIP-seq data ( 29 Fig. 6E + + + + + Fig. 6F A recent study revealed that EZH2 colocalizes with NF-κB to activate pro-oncogenic gene expression in TNBC ( 29 IL- 6 FOXQ1 NNMT RELA NFE2L2 KRT14 Fig. 6G Together, paxalisib and anti-PD1–mediated EZH2 + + + + + + + 33 Associations between PIK3R2 gene expression and survival in patients with TNBC Finally, we analyzed whether expression of PIK3R2 GSE158309 19 PIK3R2 Next, we assessed PIK3R2 34 PIK3R2 PIK3R2 PIK3R2 35 Discussion Here, we provide novel insights into the contribution of the PI3K–mTOR pathway to the TNBC phenotypes associated with growth, migration, metastasis, and therapy resistance. Specifically, we demonstrate that dual targeting of PI3K and mTOR but not PI3K alone inhibits cancer cell proliferation and migration in vitro In vivo PIK3R2 These experiments highlight the importance of dual targeting not only PI3K but also mTOR in tumor cells to reduce or prevent metastases and create a proimmunogenic tumor-immune microenvironment ( Fig. 7 20 36 36 37 TAGLN NNMT 37 39 40 high low in vitro 41 43 Fig. 7 28 44 Figure 7. Impact of dual PI3K–mTOR pathway inhibition in TNBC. Mechanism 1. PI3K–mTOR blockade inhibits the resistant cancer cell populations (dormant tumor cells, CSCs, and persister cells), thereby overcoming resistance and reducing inflammation, including key proinflammatory cytokines such as IL-6. PI3K–mTOR inhibition also increases immune reinvigoration and activates viral mimicry signatures, making the cancer cells more immune visible. Using this biphasic approach of targeting resistance signatures and enhancing cancer immune visibility, when combined with immunotherapy or PARP inhibitors, PI3K–mTOR inhibition reduces primary tumor burden and metastases. Mechanism 2. PI3K mTOR blockade inhibits the dual role of EZH2. We show that the nuclear p85β subunit is enriched in TNBC human cell lines and after chemotherapy and immunotherapy and so might be a marker of residual disease. There is accumulating evidence that EZH2 is a key factor controlling drug resistance via its dual functionality ( 45 29 46 50 29 30 29 31 29 31 51 29 52 53 54 55 Fig. 7 ex vivo 27 45 56 27 27 More recently, a noncatalytic role for EZH2 has been identified, in which it acts as a transcriptional coactivator ( 29 31 51 29 52 53 Fig. 7 In conclusion, this study demonstrates the utility of combining PI3K–mTOR inhibitors with immunotherapy by exploiting interactions between the PI3K–mTOR signaling pathway and the EZH2 epigenetic network. For the first time, we show that dual targeting of the PI3K–mTOR pathway, not PI3K alone, has beneficial effects by inhibiting signatures associated with MICs, altering the tumor immune-microenvironment, preventing metastases, and overcoming resistance associated with immunotherapy. These results pave the way for further testing of PI3K/mTOR inhibitors with immunotherapy in TNBC. Supplementary Material Supplementary Methods Supplementary Methods to accompany manuscript Supplementary Results Supplementary Results to accompany manuscript Supplementary Figure 1 Supplementary Figure 1. PI3K-mTOR blockade inhibits proliferation of TNBC cells Supplementary Figure 2 Supplementary Figure 2. Dose de-escalation of the PI3K-mTOR inhibitor, paxalisib, overcomes toxicity burden in combination treatments. Supplementary Figure 3 Supplementary Figure 3. NanoString nCounter analysis highlighting distinct gene expression profiles in Paxalisib-treated tumors. Supplementary Figure 4 Supplementary Figure 4. Nuclear p85β expression in Stage III TNBC patients and paxalisib- treated 4T1 TNBC mice. Supplementary Figure 5 Supplementary Figure 5. PI3K-mTOR inhibition targets the p85β:H3K27Me3 switch. Supplementary Figure 6 Supplementary Figure 6. EZH2 co-localizes with NF-κB to activate pro-oncogenic gene expression in TNBC. Supplementary Figure 7 Supplementary Figure 7. Associations between PIK3R2 gene expression and survival probability amongst TNBC patient cohorts. Supplementary Table S1 Supplementary Table S1. List of the PI3K/mTOR inhibitors Supplementary Table S2 upplementary Table S2. The 23 antibody CODEX panel. Supplementary Table S3 Supplementary Table S3. Inhibition of human PI3K isoenzymes in vitro by paxalisib in fluorescence polarization biochemical assays. Acknowledgments S. Rao is supported by an Inaugural Daniela Dwyer foundation fellowship. Funding was provided by collaborative agreement between Kazia Therapeutics Limited and QIMR Berghofer Medical Research Institute. We would like to thank Dr. Jenny Dunn for technical assistance with wound healing assays and the Scientific Services team at QIMR Berghofer Medical Research Institute for their support with animal handling, histology, and imaging. Finally, we are grateful to the patients, clinicians, and pathologists who contributed patient material to this study.  Note: http://mct.aacrjournals.org/ Authors’ Disclosures M. Melino reports other support from Kazia Therapeutics and Philanthropy Foundation during the conduct of the study. W.J. Tu reports other support from Kazia Therapeutics and Philanthropy Foundation during the conduct of the study. M. Proctor reports other support from Kazia Therapeutics and Philanthropy Foundation during the conduct of the study. T. Ahuja reports other support from Kazia Therapeutics and Philanthropy Foundation during the conduct of the study. J. Vandermeide reports other support from Kazia Therapeutics and Philanthropy Foundation during the conduct of the study. A.L. Bain reports other support from Kazia Therapeutics and Philanthropy Foundation during the conduct of the study. G. Nallan reports other support from Kazia Therapeutics and Philanthropy Foundation during the conduct of the study. S.L. Goh reports other support from Kazia Therapeutics and Philanthropy Foundation during the conduct of the study. S. Zhang is an employee of Akoya Biosciences. T.H. Nguyen reports other support from Kazia Therapeutics and Philanthropy Foundation during the conduct of the study. M. Eastgate reports personal fees from Merck Sharpe and Dohme outside the submitted work. S. Rao reports other support from Kazia Therapeutics and Philanthropy Foundation during the conduct of the study; in addition, S. Rao has a patent 2022903523 pending and licensed to Kazia Therapeutics and a patent 2024900337 pending and licensed to Kazia Therapeutics. No disclosures were reported by the other authors. Authors’ Contributions  M. Melino: W.J. Tu: H. Bielefeldt-Ohmann: M. Proctor: T. Ahuja: J. Vandermeide: A.L. Bain: G. Nallan: S.L. Goh: T. Prasanna: J.E. Dahlstrom: M. Miranda: R.K. Choudhary: A. Anandam: S. Chaudhary: J.T. Seal: D. Sinha: S. Zhang: T.H. Nguyen: S. Srihari: G. Hartel: A. Ives: L. Malik: D. Yip: M. Nottage: M. Eastgate: S. Rao: References 1. Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 229 63 38572751 10.3322/caac.21834 2. Yin L Duan JJ Bian XW Yu SC Triple-negative breast cancer molecular subtyping and treatment progress Breast Cancer Res 2020 22 61 32517735 10.1186/s13058-020-01296-5 PMC7285581 3. Kesireddy M Elsayed L Shostrom VK Agarwal P Asif S Yellala A Overall survival and prognostic factors in metastatic triple-negative breast cancer: a national cancer database analysis Cancers 2024 16 1791 38791870 10.3390/cancers16101791 PMC11120599 4. Huppert LA Gumusay O Rugo HS Emerging treatment strategies for metastatic triple-negative breast cancer Ther Adv Med Oncol 2022 14 17588359221086916 35422881 10.1177/17588359221086916 PMC9003656 5. Tarantino P Corti C Schmid P Cortes J Mittendorf EA Rugo H Immunotherapy for early triple negative breast cancer: research agenda for the next decade NPJ Breast Cancer 2022 8 23 35181659 10.1038/s41523-022-00386-1 PMC8857212 6. Cortes J Rugo HS Cescon DW Im S-A Yusof MM Gallardo C Pembrolizumab plus chemotherapy in advanced triple-negative breast cancer N Engl J Med 2022 387 217 26 35857659 10.1056/NEJMoa2202809 7. Vanhaesebroeck B Perry MWD Brown JR André F Okkenhaug K PI3K inhibitors are finally coming of age Nat Rev Drug Discov 2021 20 741 69 34127844 10.1038/s41573-021-00209-1 PMC9297732 8. Sirico M D’Angelo A Gianni C Casadei C Merloni F De Giorgi U Current state and future challenges for PI3K inhibitors in cancer therapy Cancers (Basel) 2023 15 703 36765661 10.3390/cancers15030703 PMC9913212 9. Miller J Armgardt E Svoboda A The efficacy and safety of alpelisib in breast cancer: a real-world analysis J Oncol Pharm Pract 2022 28 1152 6 35450470 10.1177/10781552221096413 10. Salphati L Heffron TP Alicke B Nishimura M Barck K Carano RA Targeting the PI3K pathway in the braini—efficacy of a PI3K inhibitor optimized to cross the blood-brain barrier Clin Cancer Res 2012 18 6239 48 22992516 10.1158/1078-0432.CCR-12-0720 11. Heffron TP Ndubaku CO Salphati L Alicke B Cheong J Drobnick J Discovery of clinical development candidate GDC-0084, a brain penetrant inhibitor of PI3K and mTOR ACS Med Chem Lett 2016 7 351 6 27096040 10.1021/acsmedchemlett.6b00005 PMC4834666 12. Wen PY Cloughesy TF Olivero AG Morrissey KM Wilson TR Lu X First-in-Human phase I study to evaluate the brain-penetrant PI3K/mTOR inhibitor GDC-0084 in patients with progressive or recurrent high-grade glioma Clin Cancer Res 2020 26 1820 8 31937616 10.1158/1078-0432.CCR-19-2808 13. Pascual J Turner NC Targeting the PI3-kinase pathway in triple-negative breast cancer Ann Oncol 2019 30 1051 60 31050709 10.1093/annonc/mdz133 14. Zafar A Wu F Hardy K Li J Tu WJ McCuaig R Chromatinized protein kinase C-theta directly regulates inducible genes in epithelial to mesenchymal transition and breast cancer stem cells Mol Cell Biol 2014 34 2961 80 24891615 10.1128/MCB.01693-13 PMC4135602 15. Bankhead P Loughrey MB Fernández JA Dombrowski Y McArt DG Dunne PD QuPath: open source software for digital pathology image analysis Sci Rep 2017 7 16878 29203879 10.1038/s41598-017-17204-5 PMC5715110 16. Schmidt U Weigert M Broaddus C Myers G Cell detection with star-convex polygons: 21st international conference Proceedings Part II. 2018 Sep 16–20 Granada, Spain 2018 Springer 265 73 17. Wolf FA Angerer P Theis FJ SCANPY: large-scale single-cell gene expression data analysis Genome Biol 2018 19 15 29409532 10.1186/s13059-017-1382-0 PMC5802054 18. Schürch CM Bhate SS Barlow GL Phillips DJ Noti L Zlobec I Coordinated cellular neighborhoods orchestrate antitumoral immunity at the colorectal cancer invasive front Cell 2020 182 1341 59.e19 32763154 10.1016/j.cell.2020.07.005 PMC7479520 19. Heimes AS Härtner F Almstedt K Krajnak S Lebrecht A Battista MJ Prognostic significance of interferon-gamma and its signaling pathway in early breast cancer depends on the molecular subtypes Int J Mol Sci 2020 21 7178 33003293 10.3390/ijms21197178 PMC7582264 20. Visvader JE Lindeman GJ Cancer stem cells in solid tumours: accumulating evidence and unresolved questions Nat Rev Cancer 2008 8 755 68 18784658 10.1038/nrc2499 21. Mallick S Duttaroy AK Dutta S The PIK3CA gene and its pivotal role in tumor tropism of triple-negative breast cancer Transl Oncol 2024 50 102140 39369580 10.1016/j.tranon.2024.102140 PMC11491976 22. Fultang N Chakraborty M Peethambaran B Regulation of cancer stem cells in triple negative breast cancer Cancer Drug Resist 2021 4 321 42 35582030 10.20517/cdr.2020.106 PMC9019272 23. Hennessy BT Gonzalez-Angulo AM Stemke-Hale K Gilcrease MZ Krishnamurthy S Lee JS Characterization of a naturally occurring breast cancer subset enriched in epithelial-to-mesenchymal transition and stem cell characteristics Cancer Res 2009 69 4116 24 19435916 10.1158/0008-5472.CAN-08-3441 PMC2737191 24. Li Y Wang Z Ajani JA Song S Drug resistance and Cancer stem cells Cell Commun Signal 2021 19 19 33588867 10.1186/s12964-020-00627-5 PMC7885480 25. Fan W Li W Li L Qin M Mao C Yuan Z Bifunctional HDAC and DNMT inhibitor induces viral mimicry activates the innate immune response in triple-negative breast cancer Eur J Pharm Sci 2024 197 106767 38636781 10.1016/j.ejps.2024.106767 26. Steenbrugge J De Jaeghere EA Meyer E Denys H De Wever O Splenic hematopoietic and stromal cells in cancer progression Cancer Res 2021 81 27 34 32998999 10.1158/0008-5472.CAN-20-2339 27. Hao Y He B Wu L Li Y Wang C Wang T Nuclear translocation of p85β promotes tumorigenesis of PIK3CA helical domain mutant cancer Nat Commun 2022 13 1974 35418124 10.1038/s41467-022-29585-x PMC9007954 28. Chen R Ishak CA De Carvalho DD Endogenous retroelements and the viral mimicry response in cancer therapy and cellular homeostasis Cancer Discov 2021 11 2707 25 34649957 10.1158/2159-8290.CD-21-0506 29. Dardis GJ Wang J Simon JM Wang GG Baldwin AS An EZH2-NF-κB regulatory axis drives expression of pro-oncogenic gene signatures in triple negative breast cancer iScience 2023 26 107115 37416481 10.1016/j.isci.2023.107115 PMC10319845 30. Huang J Gou H Yao J Yi K Jin Z Matsuoka M The noncanonical role of EZH2 in cancer Cancer Sci 2021 112 1376 82 33615636 10.1111/cas.14840 PMC8019201 31. Gan L Yang Y Li Q Feng Y Liu T Guo W Epigenetic regulation of cancer progression by EZH2: from biological insights to therapeutic potential Biomark Res 2018 6 10 29556394 10.1186/s40364-018-0122-2 PMC5845366 32. Wang J Yu X Gong W Liu X Park K-S Ma A EZH2 noncanonically binds cMyc and p300 through a cryptic transactivation domain to mediate gene activation and promote oncogenesis Nat Cel Biol 2022 24 384 99 10.1038/s41556-022-00850-x PMC9710513 35210568 33. Smale ST Dimer-specific regulatory mechanisms within the NF-κB family of transcription factors Immunol Rev 2012 246 193 204 22435556 10.1111/j.1600-065X.2011.01091.x 34. Wilkerson AD Parthasarathy PB Stabellini N Mitchell C Pavicic PG Jr Fu P Phase II clinical trial of pembrolizumab and chemotherapy reveals distinct transcriptomic profiles by radiologic response in metastatic triple-negative breast cancer Clin Cancer Res 2024 30 82 93 37882661 10.1158/1078-0432.CCR-23-1349 PMC10767305 35. Blaye C Darbo É Debled M Brouste V Vélasco V Pinard C An immunological signature to predict outcome in patients with triple-negative breast cancer with residual disease after neoadjuvant chemotherapy ESMO Open 2022 7 100502 35759853 10.1016/j.esmoop.2022.100502 PMC9434232 36. De Angelis ML Francescangeli F La Torre F Zeuner A Stem cell plasticity and dormancy in the development of cancer therapy resistance Front Oncol 2019 9 626 31355143 10.3389/fonc.2019.00626 PMC6636659 37. Dhanyamraju PK Schell TD Amin S Robertson GP Drug-tolerant persister cells in cancer therapy resistance Cancer Res 2022 82 2503 14 35584245 10.1158/0008-5472.CAN-21-3844 PMC9296591 38. Marsolier J Prompsy P Durand A Lyne AM Landragin C Trouchet A H3K27me3 conditions chemotolerance in triple-negative breast cancer Nat Genet 2022 54 459 68 35410383 10.1038/s41588-022-01047-6 PMC7612638 39. Godwin P Baird AM Heavey S Barr MP O’Byrne KJ Gately K Targeting nuclear factor-kappa B to overcome resistance to chemotherapy Front Oncol 2013 3 120 23720710 10.3389/fonc.2013.00120 PMC3655421 40. Francescangeli F De Angelis ML Rossi R Cuccu A Giuliani A De Maria R Dormancy, stemness, and therapy resistance: interconnected players in cancer evolution Cancer Metastasis Rev 2023 42 197 215 36757577 10.1007/s10555-023-10092-4 PMC10014678 41. Tawara K Oxford JT Jorcyk CL Clinical significance of interleukin (IL)-6 in cancer metastasis to bone: potential of anti-IL-6 therapies Cancer Manag Res 2011 3 177 89 21625400 10.2147/CMR.S18101 PMC3101113 42. Sanguinetti A Santini D Bonafè M Taffurelli M Avenia N Interleukin-6 and pro inflammatory status in the breast tumor microenvironment World J Surg Oncol 2015 13 129 25881039 10.1186/s12957-015-0529-2 PMC4397867 43. Pu YS Hour TC Chuang SE Cheng AL Lai MK Kuo ML Interleukin-6 is responsible for drug resistance and anti-apoptotic effects in prostatic cancer cells Prostate 2004 60 120 9 15162378 10.1002/pros.20057 44. Topper MJ Vaz M Marrone KA Brahmer JR Baylin SB The emerging role of epigenetic therapeutics in immuno-oncology Nat Rev Clin Oncol 2020 17 75 90 31548600 10.1038/s41571-019-0266-5 PMC7254932 45. Chen Y Zhu H Luo Y Tong S Liu Y EZH2: the roles in targeted therapy and mechanisms of resistance in breast cancer Biomed Pharmacother 2024 175 116624 38670045 10.1016/j.biopha.2024.116624 46. Yomtoubian S Lee SB Verma A Izzo F Markowitz G Choi H Inhibition of EZH2 catalytic activity selectively targets a metastatic subpopulation in triple-negative breast cancer Cell Rep 2020 30 755 70.e6 31968251 10.1016/j.celrep.2019.12.056 47. Nie L Wei Y Zhang F Hsu YH Chan LC Xia W CDK2-mediated site-specific phosphorylation of EZH2 drives and maintains triple-negative breast cancer Nat Commun 2019 10 5114 31704972 10.1038/s41467-019-13105-5 PMC6841924 48. Bachmann IM Halvorsen OJ Collett K Stefansson IM Straume O Haukaas SA EZH2 expression is associated with high proliferation rate and aggressive tumor subgroups in cutaneous melanoma and cancers of the endometrium, prostate, and breast J Clin Oncol 2006 24 268 73 16330673 10.1200/JCO.2005.01.5180 49. Wang X Hu B Shen H Zhou H Xue X Chen Y Clinical and prognostic relevance of EZH2 in breast cancer: a meta-analysis Biomed Pharmacother 2015 75 218 25 26271144 10.1016/j.biopha.2015.07.038 50. Zong X Wang W Ozes A Fang F Sandusky GE Nephew KP EZH2-mediated downregulation of the tumor suppressor DAB2IP maintains ovarian cancer stem cells Cancer Res 2020 80 4371 85 32816909 10.1158/0008-5472.CAN-20-0458 PMC7572866 51. Lee ST Li Z Wu Z Aau M Guan P Karuturi RK Context-specific regulation of NF-κB target gene expression by EZH2 in breast cancers Mol Cell 2011 43 798 810 21884980 10.1016/j.molcel.2011.08.011 52. Yap TA Winter JN Giulino-Roth L Longley J Lopez J Michot JM Phase I study of the novel enhancer of zeste homolog 2 (EZH2) inhibitor GSK2816126 in patients with advanced hematologic and solid tumors Clin Cancer Res 2019 25 7331 9 31471312 10.1158/1078-0432.CCR-18-4121 PMC7377921 53. Italiano A Soria JC Toulmonde M Michot JM Lucchesi C Varga A Tazemetostat, an EZH2 inhibitor, in relapsed or refractory B-cell non-Hodgkin lymphoma and advanced solid tumours: a first-in-human, open-label, phase 1 study Lancet Oncol 2018 19 649 59 29650362 10.1016/S1470-2045(18)30145-1 54. Thévenod F Friedmann JM Katsen AD Hauser IA Up-regulation of multidrug resistance P-glycoprotein via nuclear factor-kappaB activation protects kidney proximal tubule cells from cadmium- and reactive oxygen species-induced apoptosis J Biol Chem 2000 275 1887 96 10636889 10.1074/jbc.275.3.1887 55. Braeuer SJ Büneker C Mohr A Zwacka RM Constitutively activated nuclear factor-kappaB, but not induced NF-kappaB, leads to TRAIL resistance by up-regulation of X-linked inhibitor of apoptosis protein in human cancer cells Mol Cancer Res 2006 4 715 28 17050666 10.1158/1541-7786.MCR-05-0231 56. Cantley LC The phosphoinositide 3-kinase pathway Science 2002 296 1655 7 12040186 10.1126/science.296.5573.1655 ",
  "metadata": {
    "Title of this paper": "The phosphoinositide 3-kinase pathway",
    "Journal it was published in:": "Molecular Cancer Therapeutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485387/"
  }
}